[
    {
        "source_sentence": "十誦律卷第十八(第三誦之五)",
        "translation": "Ten Recitations Vinaya, Vol. 18 (3rd recitation, 5th)",
        "source": "T23n1435_018:0124c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦北印度三藏弗若多羅譯",
        "translation": "A Translation of the Latter Qin Northern India Tripiṭaka by Pūrṇa",
        "source": "T23n1435_018:0124c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九十波逸提之十",
        "translation": "ninety prāyattika declivities",
        "source": "T23n1435_018:0124c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T23n1435_018:0124c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王作是法，若佛在祇洹，我當日日自往奉見。",
        "translation": "It was then that King Prasenajit made this statement, \"If the Buddha were at Qipuan, I would go there every day to see him.",
        "source": "T23n1435_018:0124c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時波斯匿王聞佛在祇洹，即勅人民掃除祇洹，皆令淨潔我欲見佛。",
        "translation": "It was then that King Prasenajit heard that the Buddha was at Qipuan and ordered the people to cleanse Qipuan and make it clean for me to see the Buddha.",
        "source": "T23n1435_018:0124c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受勅掃灑除却眾人，唯有一人著故弊衣在佛前坐聽法，敬難佛故不敢驅去。",
        "translation": "After I commanded him to clean up and remove the crowd, only one person wearing old, tattered robes sat down in front of the Buddha to listen to the teaching, honoring the difficult Buddha and not daring to leave.",
        "source": "T23n1435_018:0124c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者白王：「我已掃除祇洹淨潔，唯有一人，著弊故衣近佛坐聽法，我等敬難佛故不敢驅却。」",
        "translation": "The messengers told the king, \"I've cleansed Qipuan and made it clean, but there's only one person wearing robes made of rags who's sitting near the Buddha and listening to the teaching, and we respect the Buddha and don't dare to drive him away.\"",
        "source": "T23n1435_018:0124c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「一人著弊故衣在佛前坐，當何所能？」",
        "translation": "The king said, \"One person wearing robes made of rags is sitting in front of the Buddha, what could he do?\"",
        "source": "T23n1435_018:0124c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即勅御者駕乘調車：「我欲見佛。」",
        "translation": "He then commanded his servant to drive the chariot, \"I want to see the Buddha.\"",
        "source": "T23n1435_018:0124c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即嚴駕車，往白王言：「已嚴駕善車。",
        "translation": "He then strictly drove the chariot and went to the king and said, \"I've strictly driven a good chariot.",
        "source": "T23n1435_018:0124c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自知時。」",
        "translation": "The king himself will know when it's time.\"",
        "source": "T23n1435_018:0124c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即上車，出舍衛城往詣祇洹，至下乘處步入祇洹。",
        "translation": "The king then got into the chariot, left Śrāvastī, went to Gipan, and stepped into Gipan at the place where the lower vehicle had been taken.",
        "source": "T23n1435_018:0124c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾遙見王來，皆起迎王。",
        "translation": "At the time, the whole crowd saw the king coming from afar and rose to greet him.",
        "source": "T23n1435_018:0124c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一須達居士佛邊聽法，恭敬佛故不起迎王。",
        "translation": "There was a man named Sudarśana who was listening to the teaching near the Buddha and was respectful of the Buddha, so he didn't rise to greet the king.",
        "source": "T23n1435_018:0124c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即瞋言：「此是何人，著弊故衣在佛前坐、見我不起？",
        "translation": "The king then became angry and said, \"Who is this person sitting in front of the Buddha wearing robes made of rags and not standing up when he sees me?",
        "source": "T23n1435_018:0124c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是澆頂大王、我境界中得自在，無死罪者能殺，有死罪者能放。」",
        "translation": "I'm a great king who pours out his head, attains mastery in my domain, and is able to kill those who don't commit capital offenses and set free those who do.\"",
        "source": "T23n1435_018:0124c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以敬佛故瞋不出口，直詣佛所頭面禮足却坐一面，佛為種種說法示教利喜，不入王心，瞋是人故。",
        "translation": "He didn't speak angrily because he respected the Buddha, went straight to the Buddha, bowed his head and feet, and withdrew to sit to one side while the Buddha taught the Dharma for various reasons, showing benefits and joy, but he didn't enter the king's mind, so he was angry with this person.",
        "source": "T23n1435_018:0124c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛常法，不為不一心人說法。",
        "translation": "The constant Dharma of the buddhas doesn't teach for people who aren't of the same mind.",
        "source": "T23n1435_018:0124c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即問王：「何故以二心聽法？」",
        "translation": "The Buddha then asked the king, \"Why are you listening to the teaching with two minds?\"",
        "source": "T23n1435_018:0124c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「世尊！",
        "translation": "The king said, \"Bhagavān!",
        "source": "T23n1435_018:0124c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是何小人，著弊故衣在佛前坐？",
        "translation": "What kind of a villain is this, sitting in front of the Buddha wearing robes made of rags?",
        "source": "T23n1435_018:0124c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見我來不起立迎，我於國中得自在，無死罪者能殺，有死罪者能放。」",
        "translation": "When they see me coming and don't stand up to greet them, I'll attain mastery in my country, killing those who aren't guilty of death and setting free those who are.\"",
        "source": "T23n1435_018:0125a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須達居士言：「大王不知耶？",
        "translation": "Cistercian Sudarśana said, \"Doesn't the king know about this?",
        "source": "T23n1435_018:0125a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於佛前坐聽法，恭敬佛故不起迎王，無有憍慢。」",
        "translation": "I was sitting here in front of the Buddha listening to the teaching, and I didn't rise to greet the king because I respected the Buddha and had no pride.\"",
        "source": "T23n1435_018:0125a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王時大羞小退一面，問諸大臣：「此是何人，著弊故衣在佛前坐，不起迎我？」",
        "translation": "The king then withdrew to one side in great shame and asked the ministers, \"Who is this person sitting in front of the Buddha wearing robes made of rags and not rising to greet me?\"",
        "source": "T23n1435_018:0125a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大臣言：「大王！",
        "translation": "The ministers said, \"Great king!",
        "source": "T23n1435_018:0125a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此名須達居士，是佛弟子得阿那含道，在佛前坐聽法，敬佛故不起，無憍慢心。」",
        "translation": "This is called a Sudarśana monk who's a disciple of the Buddha and has attained the path of non-returners, sits before him, listens to the teaching, venerates the Buddha, and therefore doesn't arise, and has no pride.\"",
        "source": "T23n1435_018:0125a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語瞋心小息，便作是念：「佛法大力，令人心大得無畏力。",
        "translation": "When the king heard those words, his anger subsided, and he then thought, \"The Buddha's teaching is powerful, and it makes people's minds great and gives them the strength to be fearless.",
        "source": "T23n1435_018:0125a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今何不令諸夫人受學佛法令得大心！」",
        "translation": "Why don't I now cause ladies to accept and train in the Buddha's teachings and attain a great attitude!\"",
        "source": "T23n1435_018:0125a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王語諸夫人：「使從比丘受學經法。」",
        "translation": "The king then said to the ladies, \"Let's accept the sūtras and teach the Dharma from the monks.\"",
        "source": "T23n1435_018:0125a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘不欲教授，作是言：「佛未聽我等教諸夫人法。」",
        "translation": "The monks didn't want to teach them, but they said, \"The Buddha hasn't heard us teach the teachings of the ladies.\"",
        "source": "T23n1435_018:0125a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事白佛，佛言：「從今聽比丘教授諸夫人法。」",
        "translation": "He told the Buddha about this, and he said, \"From now on, listen to the monks as they teach the wives the Dharma.\"",
        "source": "T23n1435_018:0125a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸夫人各各自請經師，有夫人請舍利弗者、有請目連者、有請阿那律者，時末利夫人請迦留陀夷為師。",
        "translation": "Each of the ladies then invited a master of the scriptures, and some of them invited Śāriputra, some invited Maudgalyāyana, and some invited Aniruddha, while Mrs. Mallikā invited Kālôdayin to be their master.",
        "source": "T23n1435_018:0125a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸夫人次第直宿於王，時末利夫人，下著珠網衣，上著磨貝衣，內身露現，如共王宿時。",
        "translation": "When the ladies were staying with the king one by one, Lady Mallikā was wearing a robe of pearls and nets underneath and a robe of molten clams on top, and her inner body was exposed as it had been when she was staying with the king.",
        "source": "T23n1435_018:0125a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即著是衣出，在中庭床上坐。",
        "translation": "She then put on these robes and withdrew to sit on a bed in the courtyard.",
        "source": "T23n1435_018:0125a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦留陀夷地曉時，著衣持鉢入王宮，至門下立彈指。",
        "translation": "At the time, Kālôdayindi entered the king's palace at dawn, dressed in his robe and carrying his bowl, and stood at the foot of the gate, snapping his fingers.",
        "source": "T23n1435_018:0125a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "末利夫人看見師來，便言：「師入。」",
        "translation": "When Madhurā saw her teacher coming, she said, \"Enter, Master!\"",
        "source": "T23n1435_018:0125a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即生慚羞，胡跪而坐不得起。",
        "translation": "She was immediately ashamed, knelt down, sat down, and didn't get up.",
        "source": "T23n1435_018:0125a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦留陀夷見已亦羞，還出到祇洹中，以是事向諸比丘說。",
        "translation": "Kālôdayin was also ashamed when he saw this, so he went back out to Jipan and told the monks about this.",
        "source": "T23n1435_018:0125a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是事向佛廣說。",
        "translation": "The monks then explained this to the Buddha in detail.",
        "source": "T23n1435_018:0125a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘：「若如是過失及過是過失，皆由數入王家故。」",
        "translation": "The Buddha said to the monks, \"If there are such faults and such errors, they all result from frequently entering the king's household.\"",
        "source": "T23n1435_018:0125a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若比丘入王家有十種過失。",
        "translation": "The Buddha said, \"If a monk enters the king's household, there are ten kinds of faults.",
        "source": "T23n1435_018:0125a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等十？",
        "translation": "What are the ten?",
        "source": "T23n1435_018:0125a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若王與夫人共坐，比丘來入。",
        "translation": "\"Suppose the king and his wife are sitting together, and a monk comes in.",
        "source": "T23n1435_018:0125a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時夫人見比丘或笑，比丘見夫人或笑。",
        "translation": "It's then that the lady sees the monk and sometimes smiles, and the monk sees the lady and smiles.",
        "source": "T23n1435_018:0125a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王作是念：『如夫人見比丘笑，比丘見夫人笑，此比丘必起惡業。』",
        "translation": "The king then thinks, 'If a lady sees a monk laughing and a monk sees a lady laughing, this monk will surely start bad karma.'",
        "source": "T23n1435_018:0125a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第一過失。",
        "translation": "This is called the first fault.",
        "source": "T23n1435_018:0125a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次王共夫人宿，不自憶念，是夫人或出外住，行還有娠。",
        "translation": "Furthermore, when the king stayed with the lady, he didn't remember that she might go out to live or travel back to have a pregnancy.",
        "source": "T23n1435_018:0125a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王見比丘入出，王作是念：『是夫人出外，比丘數入出，必共起惡業。』",
        "translation": "When the king sees the monk entering and leaving, the king thinks, 'That lady going out and the monk frequently entering and leaving will surely work together to produce bad karma.'",
        "source": "T23n1435_018:0125b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第二過失。",
        "translation": "This is called the second flaw.",
        "source": "T23n1435_018:0125b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次王家失五寶、若似五寶，王見比丘入出，是中必當起惡業。",
        "translation": "Furthermore, if the king's household loses the five treasures or resembles the five treasures, and the king sees the monks entering and leaving, bad karma will surely arise from that.",
        "source": "T23n1435_018:0125b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第三過失。",
        "translation": "This is the third fault.",
        "source": "T23n1435_018:0125b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次王祕密語論事，或有內鬼神，持外唱說。",
        "translation": "Furthermore, the king may have an internal spirit that speaks in secret about something, or it may tell him to speak outwardly.",
        "source": "T23n1435_018:0125b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王作是念：『如此密語外人得聞，是比丘常入出，必是比丘所傳。』",
        "translation": "The king thinks, 'Such secret speech can be heard by outsiders, and it must have been transmitted by the monk who always enters and leaves.'",
        "source": "T23n1435_018:0125b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第四過失。",
        "translation": "This is called the fourth flaw.",
        "source": "T23n1435_018:0125b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次王欲殺王子、或時王子欲殺王，是中有不喜者，謂比丘所作，作是念：『我寧莫與比丘共事。』",
        "translation": "Furthermore, if the king wishes to kill the prince, or if the prince wishes to kill the king at some point, there's someone who doesn't like what the monk has done and thinks, 'I'd rather not work with that monk.'",
        "source": "T23n1435_018:0125b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第五第六過失。",
        "translation": "This is the fifth and sixth flaw.",
        "source": "T23n1435_018:0125b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次王欲遷小為大、或欲退大為小，是中有不喜者，謂比丘所作，作是念：『我寧莫與比丘共事。』",
        "translation": "Furthermore, when the king wants to change from something small to something large, or wants to turn something large into something small, there's someone who doesn't like it, which is a monk who does this, thinking, 'I'd rather not work with a monk.'",
        "source": "T23n1435_018:0125b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第七、第八過失。",
        "translation": "These are the seventh and eighth faults.",
        "source": "T23n1435_018:0125b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次王大嚴駕幢幡鳴鼓，若乘象馬輦輿出驅人遠道。",
        "translation": "Furthermore, the king's great adornment drives a banner, banners, and drums, and if he rides an elephant, horse, or mule out, he drives people far away.",
        "source": "T23n1435_018:0125b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有不愛比丘者，見比丘在王邊，必謂是比丘所作，作是念：『我寧莫與比丘共事。』",
        "translation": "If someone who doesn't like monks sees a monk near the king, they'll say it's the monk who did it and think, 'I'd rather not work with that monk.'",
        "source": "T23n1435_018:0125b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第九過失。",
        "translation": "This is called the ninth fault.",
        "source": "T23n1435_018:0125b16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次王滅敵國，敵國調伏時，應死者勅殺，又唱莫殺。",
        "translation": "Furthermore, when the king destroys an enemy country and the enemy subdues it, he orders the dead to be killed and says not to kill them.",
        "source": "T23n1435_018:0125b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中不喜者言：『我寧莫與比丘共事。』",
        "translation": "That displeaser says, 'I'd rather not work with a monk.'",
        "source": "T23n1435_018:0125b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名第十過失。」",
        "translation": "This is called the tenth fault.\"",
        "source": "T23n1435_018:0125b19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘：「諸王家多有象兵、馬兵、車兵、步兵，是家中與白衣相宜，非比丘所宜。」",
        "translation": "The Buddha told the monks, \"The king's household often has elephant soldiers, horse soldiers, chariot soldiers, and foot soldiers, and these are appropriate for a household with white clothing, not for a monk.\"",
        "source": "T23n1435_018:0125b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵責入王家已，語諸比丘：「以十利故與比丘結戒。",
        "translation": "After being rebuked for various reasons for entering the king's household, he told the monks, \"It's because of the ten benefits that I've bound the monks to the precepts.",
        "source": "T23n1435_018:0125b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘，水澆頂剎利王家，夜未過未藏寶，若過門闑及闑處，波逸提。」",
        "translation": "From now on, this precept should be explained like this: 'Suppose a monk pours water over the top of the house of King Śāriputra before nightfall and doesn't hide his treasures, or suppose he passes through the doorway or doorway, Boyanti.'\"",
        "source": "T23n1435_018:0125b22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王者，剎利種受水澆頂受王職，是名為王剎利澆頂。",
        "translation": "A king who is a member of the Bālī family who receives the position of king by pouring water over his head is called a king who pours water over his head.",
        "source": "T23n1435_018:0125b24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若婆羅門、若居士乃至女人，受是澆頂王職，亦名為王剎利澆頂。",
        "translation": "If a brāhmaṇa, householder, or even a woman is given the position of king who pours water over their heads, that's also called the king who pours water over his bones.",
        "source": "T23n1435_018:0125b26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜未過者，王未出故，夫人未入故。",
        "translation": "The night has not yet passed, because the king hasn't yet left and the lady hasn't yet entered.",
        "source": "T23n1435_018:0125b27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未藏寶者，未藏莊嚴具，未舉藏故。",
        "translation": "Someone who hasn't hidden the treasures yet has yet to store the ornaments, and they haven't yet raised the store.",
        "source": "T23n1435_018:0125b28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門闑者，門中相。",
        "translation": "The doorway is a representation of what's inside the door.",
        "source": "T23n1435_018:0125b29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "闑處者，是門中地可安闑處。",
        "translation": "The doorway is a place on the ground in the entryway where a doorway can be placed.",
        "source": "T23n1435_018:0125b29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "'Pāyatti' means the hindrance of being burnt, which can obstruct the path if one doesn't repent.",
        "source": "T23n1435_018:0125c01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，王未出、夫人未入、未藏寶，爾時比丘入王門，得波逸提。",
        "translation": "This is a violation when a monk enters the king's gate before the king has left, the wife has entered, or the treasure has been hidden, and he attains pratyekabuddha.",
        "source": "T23n1435_018:0125c02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若王雖出，夫人未入、未藏寶，爾時比丘入王門，得波逸提。",
        "translation": "If a monk enters the king's gate even though the king has emerged and the wife has yet to enter or hide her treasures, he attains pāyattika.",
        "source": "T23n1435_018:0125c03_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若王出、夫人入，未藏寶，比丘爾時入王門，得波逸提。",
        "translation": "If the king emerges and the wife enters but hasn't hidden the treasure, the monk then enters the king's gate and attains pāyattika.",
        "source": "T23n1435_018:0125c04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若王出、夫人已入、已藏寶物，比丘爾時入王內門，不犯。",
        "translation": "If a monk enters the king's gate at that point after the king has emerged or a wife has entered and has hidden treasure, that's not a violation.",
        "source": "T23n1435_018:0125c06_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在俱舍彌國，爾時優填王千夫人，五百人為一部，舍彌婆提為一部首，阿奴跋摩為一部首。",
        "translation": "When the Buddha was in Kauśāmbī, the thousand wives of King Udayin were grouped into five hundred, with Śrāmaṇerī Bhadrika as the head of one group and Anupama as the head of another.",
        "source": "T23n1435_018:0125c07_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中舍彌婆提所領五百人，善好有功德；阿奴跋摩所領五百人，惡邪不善。",
        "translation": "Of those, the five hundred led by Śrāmaṇerī Bhadrika were good, nice, and meritorious, and the five hundred led by Ānubhavaja were bad, evil, and unwholesome.",
        "source": "T23n1435_018:0125c09_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時優填王有小國反叛，王作是念：「我當留誰鎮後令無惡事，自往破賊？」",
        "translation": "It was then that the king of Udayana had a small kingdom rebel against him, and the king thought, \"Who will I leave behind to keep evil from happening and to go by myself to defeat the thieves?\"",
        "source": "T23n1435_018:0125c11_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王作是念：「摩揵提婆羅門利根有威德，是我婦父，我當留鎮後，自往破賊。",
        "translation": "The king thought, \"The Maudgalyāyana Brāhmaṇa has sharp faculties and dignified qualities, and he's the father of my wife; I will stay behind my town and go myself to destroy the thieves.",
        "source": "T23n1435_018:0125c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於是人無有惡事後無憂悔。」",
        "translation": "I won't regret that I didn't do anything bad to that person.\"",
        "source": "T23n1435_018:0125c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王作是念已，即令婆羅門鎮城，自往破賊。",
        "translation": "After the king thought this, he ordered the Brāhmaṇa to calm the city and go by himself to break the thieves.",
        "source": "T23n1435_018:0125c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸城邑聚落名聲流布，王令摩揵提婆羅門守城，後日早起百千種人，在婆羅門門下，有立讚歎者、有稱吉者、有合掌恭敬禮拜者、有餉象馬車乘牛羊駝驢者、有餉金銀琉璃硨璖瑪碯者，摩揵提婆羅門作是念：「我得如是富貴勢力者，皆是我女力故，我當以何報是女？",
        "translation": "When the fame of the towns and villages spread, the king had Mākandiprabha guard the city, and a hundred thousand kinds of people rose up early the next morning and stayed under the Brāhmaṇa's gate, some of whom offered praise, some of whom praised him, some of whom joined their hands in respect and veneration, some of whom paid elephants, horses, carts, oxen, sheep, camels, and donkeys, and some of whom paid gold, silver, lapis lazuli, and model emeralds, Mākandiprabha thought, \"It's because of the strength of my daughter that I've attained such wealth and power; what will I give to that woman?",
        "source": "T23n1435_018:0125c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若與金銀琉璃硨璩瑪碯者宮中不少，女人所有怨嫉憂毒無過對婦。",
        "translation": "\"If he were to give a lot of gold and silver, lapis lazuli, and emerald, there wouldn't be many women in his palace who are more resentful and bitter than his wife.",
        "source": "T23n1435_018:0125c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若令舍彌婆提五百夫人死者，乃當報女恩，我何故不殺？",
        "translation": "If the five hundred wives of Śrāmaṇerī were to die, then they would repay the woman's kindness, so why wouldn't I kill her?",
        "source": "T23n1435_018:0125c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今不可直殺，當作方便火燒殺之。」",
        "translation": "Now, you mustn't kill her outright; you must burn her with a fire of skillful means.\"",
        "source": "T23n1435_018:0125c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，遣使語舍彌婆提夫人：「汝如我女無異，若須蘇油薪草材木樹皮松明，遣人來取。」",
        "translation": "After he thought this, he sent an envoy to say to Lady Śrāmaṇerī, \"You're no different than my daughter; if you need sumac, oil, wood, timber, bark, and pine, send for someone to fetch it.\"",
        "source": "T23n1435_018:0126a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即勅所典：「舍彌婆提夫人遣人來索蘇油薪草，兩三倍與。」",
        "translation": "I then commanded the order to come, \"Send someone from Lady Śrāmaṇerī to fetch oil, wood, bark, and grass, and give them two or three times as much.\"",
        "source": "T23n1435_018:0126a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受教言：「爾。」",
        "translation": "She was instructed, \"Yes.\"",
        "source": "T23n1435_018:0126a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人性貪憙集財物，以易得故多取積聚，滿宮房舍窓向欄楯諸樓閣間及床榻下，諸瓮甕器皆悉盛滿。",
        "translation": "Women are naturally greedy and collect property, so they gather much of it because it's easy to get, filling palace rooms, windows, railings, between mansions, under beds and sofas, and jars and urns with it.",
        "source": "T23n1435_018:0126a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩揵提婆羅門知火具已多，勅閉宮門放火燒之。",
        "translation": "Knowing that there was a lot of fire gear, the Māgandi Brahmins closed the palace doors and set fire to it.",
        "source": "T23n1435_018:0126a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時人民聞王宮中失火，畏王刀力、鞭杖力、瞋力故，多人俱集欲破門入。",
        "translation": "When the people heard about the fire in the king's palace, they were afraid of the power of the king's sword, the force of his whip, and the power of his anger, so many of them gathered to break down the gate and enter.",
        "source": "T23n1435_018:0126a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩揵提婆羅門深惡心故，作是念：「若人民破門入者，或能滅火令不燒死。」",
        "translation": "With deep evil intent, the māgandi brāhmaṇa thought, \"Perhaps if the people break through the gate and enter, they could put out the fire and not be burned to death.\"",
        "source": "T23n1435_018:0126a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，語諸人民：「汝等不知王心妬耶？",
        "translation": "After that thought, he said to the people, \"Don't you know that the king's mind is jealous?",
        "source": "T23n1435_018:0126a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞諸人破門入者，姦我宮人必當大瞋。」",
        "translation": "If I hear that people have broken through the door and entered, the adulterer of my palace will become very angry.\"",
        "source": "T23n1435_018:0126a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人言：「今當云何？」",
        "translation": "The people said, \"What will happen now?\"",
        "source": "T23n1435_018:0126a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「當縛木梯隥入。」",
        "translation": "They replied, \"They will bind a wooden ladder and enter.\"",
        "source": "T23n1435_018:0126a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是集木作梯。",
        "translation": "Thus, they gathered wood to make a ladder.",
        "source": "T23n1435_018:0126a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞舍彌波提及五百女人皆已燒死，遣人白王：「宮中失火，舍彌波提夫人等五百人火所燒死。」",
        "translation": "When he heard that all 500 women of Śāmbīpatī had been burned to death, he sent someone to tell the king, \"A fire broke out in the palace, and 500 of them, including Lady Śāmbīpatī, were burned to death by it.\"",
        "source": "T23n1435_018:0126a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是事心生憂惱，作是言：「如是好福田人，今永別離。」",
        "translation": "Hearing this, the king became distressed and said, \"Such a good person in a field of merit has now been parted forever.\"",
        "source": "T23n1435_018:0126a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王以愁憂因緣迷悶欲死即墮床，諸臣以水灑面即便得醒。",
        "translation": "The king fell onto his bed because he was overcome by grief and sorrow and was about to die, but the ministers sprinkled his face with water and he was able to wake up.",
        "source": "T23n1435_018:0126a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大臣言：「王莫愁憂，更當起宮殿集諸婇女。」",
        "translation": "The ministers said, \"Don't be sad, king; you should get up from the palace and gather the women.\"",
        "source": "T23n1435_018:0126a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王破賊已，還至城外住：「我不入城，乃至新宮殿竟，滿五百女人當入城住。」",
        "translation": "After he had defeated the thieves, the king returned and stayed outside the city, saying, \"I won't enter the city until I finish building a new palace, then all 500 women will enter and stay there.\"",
        "source": "T23n1435_018:0126a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王以鞭杖力、刀力、矟力、健瞋力故，宮殿速成，選取貴人女億財主居士女，得五百人滿宮中。",
        "translation": "With the strength of his whip, his sword, his lance, and his anger, the king quickly completed the palace and chose 500 noble women, 100 million wealthy householders, and women to fill the palace.",
        "source": "T23n1435_018:0126a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有居士名瞿師羅居士，有女是舍彌波提夫人妹名威德。",
        "translation": "There was a householder named Ghoṣila, and there was a woman named Veide, sister of Lady Śrāmaṇepati.",
        "source": "T23n1435_018:0126a25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是女於千夫人中最上，諸臣白王：「新宮已成，諸夫人已滿，王自知時。」",
        "translation": "That woman was the most distinguished of the thousand wives, and the ministers said to the king, \"The new palace has been built, and the wives have been filled, so the king will know when it's time.\"",
        "source": "T23n1435_018:0126a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即入新宮，與新女共相娛樂。",
        "translation": "He then entered the new palace and entertained the new woman with her.",
        "source": "T23n1435_018:0126a28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王漸漸推問因緣，後知摩揵提婆羅門為自女故作是惡事。",
        "translation": "The king gradually inquired about the cause and conditions, but then he realized that the brāhmaṇa Māgandi had done this bad deed for his own daughter.",
        "source": "T23n1435_018:0126a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即遣人喚婆羅門來，語言：「汝出我國去，我不憙殺婆羅門。」",
        "translation": "He then summoned the Brāhmaṇa and told her, \"Get out of my country, and I won't kill the Brāhmaṇa.\"",
        "source": "T23n1435_018:0126b01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即約勅：「殺阿奴跋摩夫人。」",
        "translation": "The king then commanded them, \"Kill Lady Anubhavaja!\"",
        "source": "T23n1435_018:0126b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸新女，為王所親信故，便白王言：「是舍彌波提夫人等，長夜親近供養佛及僧，願聽我等供養佛及僧。」",
        "translation": "The novices, who were close to the king and trusted by him, then said to the king, \"This is Lady Śrāmaṇerīputra and the others who have been so close to making offerings to the Buddha and Saṃgha for so long, may we make offerings to the Buddha and Saṃgha?\"",
        "source": "T23n1435_018:0126b03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王時作是言：「佛不聽諸比丘入王宮。」",
        "translation": "The king then said, \"The Buddha won't listen to the monks entering the king's palace.\"",
        "source": "T23n1435_018:0126b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時諸女欲令王起憍慢心故，作是言：「王有大威德力勢，諸大事尚能辦，何況此事？",
        "translation": "Desiring to make the king proud, the women said, \"The king has great authority and strength, and he's still capable of handling great matters, so why wouldn't he do that?",
        "source": "T23n1435_018:0126b06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願王當成我等供養事。」",
        "translation": "May the king make offerings to us.\"",
        "source": "T23n1435_018:0126b08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸女急白故，令王發憍慢心，即便聽許。",
        "translation": "The women rushed to tell him that they had made the king become proud, and he even agreed to them.",
        "source": "T23n1435_018:0126b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王問諸女：「汝等實欲作供養耶？」",
        "translation": "The king asked the women, \"Do you really want to make offerings?\"",
        "source": "T23n1435_018:0126b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「欲作。」",
        "translation": "They replied, \"I want to make them.\"",
        "source": "T23n1435_018:0126b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等隨力辦供養具。」",
        "translation": "\"Make offerings as you see fit.\"",
        "source": "T23n1435_018:0126b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸女有辦僧伽梨者、有辦欝多羅僧者、有辦安陀衛者、有辦鉢者、有辦漉水囊油囊杖針綖囊。",
        "translation": "Some of the women made saṃghârī, some made uttarâsaṅga, some made antarvās, some made bowls, and some made water and oil bags, staff and needles, and thread bags.",
        "source": "T23n1435_018:0126b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王喚巧匠問言：「汝能令諸夫人不出於宮中得供養佛及僧耶？」",
        "translation": "The king then summoned the skilled craftsman and asked, \"Can you make offerings to the Buddha and Saṃgha without letting the ladies stay in the palace?\"",
        "source": "T23n1435_018:0126b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「可得。」",
        "translation": "He replied, \"It's possible.\"",
        "source": "T23n1435_018:0126b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「云何？」",
        "translation": "The king said, \"What is it?\"",
        "source": "T23n1435_018:0126b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「當作行輪宮殿。」",
        "translation": "He replied, \"Make it a palace for the traveling wheel.\"",
        "source": "T23n1435_018:0126b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即勅令速作。",
        "translation": "He then ordered it to be built quickly.",
        "source": "T23n1435_018:0126b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作已白王：「輪宮已成，王自知時。」",
        "translation": "After it was built, he said to the king, \"The wheel palace is complete, and the king will know when it's ready.\"",
        "source": "T23n1435_018:0126b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即詣佛所，頭面禮足却坐一面，佛以種種因緣說法示教利喜，示教利喜已默然。",
        "translation": "The king went to the Buddha, bowed his head to his feet, and withdrew to sit to one side while the Buddha taught the Dharma based on various causes and conditions that would benefit him, and he was silent after teaching it.",
        "source": "T23n1435_018:0126b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知佛種種因緣說法示教利喜已，從坐起偏袒右肩、合掌，白佛言：「願佛及僧，受我明日請。」",
        "translation": "After he knew that the Buddha had explained the various causes and conditions that would benefit and teach them, the king got up from his seat, bared his right shoulder, put his palms together, and said to the Buddha, \"May the Buddha and the saṃgha accept my invitation for tomorrow.\"",
        "source": "T23n1435_018:0126b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛默然受。",
        "translation": "The Buddha accepted it in silence.",
        "source": "T23n1435_018:0126b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知佛受已，頭面禮佛足右遶而去，是夜勅辦多美種種飲食，晨朝敷座處，遣使白佛時到：「食具已辦。",
        "translation": "After the king knew the Buddha had accepted it, he bowed his head at his feet, circled to his right, and departed. That night, I ordered that a large and beautiful variety of food and drink be prepared, and in the morning, he prepared a seating area and sent an envoy to tell the Buddha when it was time to arrive, \"The food preparation has been made.",
        "source": "T23n1435_018:0126b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛自知時。」",
        "translation": "The Buddha himself knows when it's time.\"",
        "source": "T23n1435_018:0126b24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘往詣王宮，佛自房住迎食分。",
        "translation": "The monks went to the palace, and the Buddha himself stayed in his room to welcome the meal.",
        "source": "T23n1435_018:0126b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時巧匠知僧來至，即出輪宮圍繞眾僧。",
        "translation": "Knowing that the saṃgha had arrived, the skilled craftsman emerged from the wheel-turning palace to surround the saṃgha.",
        "source": "T23n1435_018:0126b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知僧坐已，自手行水，自與多美飲食自恣飽滿，即開宮門。",
        "translation": "After the king knew the saṃgha was sitting there, he offered himself a drink and a dish to fill his stomach, and then he opened the palace doors.",
        "source": "T23n1435_018:0126b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸女皆出問訊諸比丘，有問父母者、姊妹兄弟者，及問訊佛者。",
        "translation": "The women all came out to question the monks, some of whom asked about their parents, sisters and brothers, and those who asked about the Buddha.",
        "source": "T23n1435_018:0126b27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長老舍利弗為上座，語諸比丘：「我等今日不在王宮耶？",
        "translation": "Śāriputra, the elder, then took the high seat and said to the monks, \"Aren't we here today at the palace?",
        "source": "T23n1435_018:0126b29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當共一心。」",
        "translation": "They will all be of one mind.\"",
        "source": "T23n1435_018:0126c01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知僧食已，自行澡水，取小坐床坐僧前聽說法。",
        "translation": "After he knew the saṃgha had eaten, the king himself washed the water, took a small sitting mat, and sat down in front of the saṃgha to listen to the teaching.",
        "source": "T23n1435_018:0126c01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語諸夫人：「所欲供養者，今正是時。」",
        "translation": "He said to the ladies, \"Now is the time to make the desired offerings.\"",
        "source": "T23n1435_018:0126c02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有夫人施僧伽梨者、施欝多羅僧者、施安陀衛者、有施鉢者、有施漉水囊者、有施針綖囊者。",
        "translation": "Some ladies gave offerings to the saṃgha, some to the uttarâsaṅga, some to Andhravaṇa, some to the bowl, some to the water bag, and some to the needle and tassel bag.",
        "source": "T23n1435_018:0126c03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘皆得滿手滿鉢物，相視而坐。",
        "translation": "At the time, the monks all had their hands full of food and bowls, and they were sitting facing each other.",
        "source": "T23n1435_018:0126c05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有方便，心念：「當云何令諸比丘經宮中過？」",
        "translation": "The king had a method and thought, \"How will you get the monks to pass through the palace?\"",
        "source": "T23n1435_018:0126c06_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即令輪宮遮先來道，便白僧言：「大德可去。」",
        "translation": "He then had the wheel-turning palace block the path of the prior comer and said to the monks, \"The great virtuous one may go.\"",
        "source": "T23n1435_018:0126c07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：「佛不聽我等入王宮中。」",
        "translation": "The monks said, \"The Buddha won't listen to us as we enter the king's palace.\"",
        "source": "T23n1435_018:0126c08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我今教出不教入。」",
        "translation": "The king said, \"Now, I'll teach them to leave and not to enter.\"",
        "source": "T23n1435_018:0126c09_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗呪願已，及僧從座起去，還到僧坊，以是事向佛廣說。",
        "translation": "After Śāriputra's vow, he and the saṃgha got up from their seats and returned to the monastery, where they explained this to the Buddha.",
        "source": "T23n1435_018:0126c10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，種種因緣讚戒、讚持戒，讚戒、讚持戒已，語諸比丘：「從今是戒應如是說：若比丘，水澆頂剎利王，夜未過、未藏寶，若過門闑及門闑處，除急因緣，波逸提。」",
        "translation": "After praising the precepts and upholding them for various reasons, the Buddha gathered the monks and saṃgha and said to them, \"From now on, this precept should be explained like this: 'If a monk pours water on the top of his head, King Bali, before the night passes or he hides his treasures, or if he passes through the doorway or doorway, remove urgent causes, pratyekabuddha.'\"",
        "source": "T23n1435_018:0126c11_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "急因緣者，若王遣使喚比丘、若夫人、王子如是等諸有力官屬喚，皆不犯。",
        "translation": "For urgent reasons, it's not a violation if the king sends an envoy to summon a monk, a wife, a prince, or other powerful officials to summon them.",
        "source": "T23n1435_018:0126c15_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十二事)",
        "translation": "(Eighty-two circumstances)",
        "source": "T23n1435_018:0126c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在俱舍彌國。",
        "translation": "The Buddha was in the country of Kauśāmbī.",
        "source": "T23n1435_018:0126c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長老闡那比丘有可悔過罪，諸比丘憐愍慈心求安隱故，教令悔過。",
        "translation": "It was then that the elder monk Cunda had a repentable sin, and the monks, in kindness and compassion, taught him to repent of it because they were seeking peace.",
        "source": "T23n1435_018:0126c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "闡那言：「我始知是事入戒經中半月次來所說。」",
        "translation": "He said, \"I've just learned this from the sutra on entering the precepts half a month ago.\"",
        "source": "T23n1435_018:0126c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，種種因緣呵責：「云何名比丘，犯可悔罪，諸比丘憐愍教令悔過，便作是言：『我今始知是事入戒經中半月次來所說。』」",
        "translation": "A monk who was practicing the ascetic practice of having few desires and being satisfied was displeased when he heard this, and he was rebuked for various reasons, saying, \"What is the name of a monk who commits a repentable sin and is kind enough to teach the monks to repent, and then he said, 'Now I've just learned this thing from the Sutra on Entering the Precepts in Half a Month's Time.'\"",
        "source": "T23n1435_018:0126c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，向佛廣說。",
        "translation": "After he had been told about these various causes and conditions, he explained them in detail to the Buddha.",
        "source": "T23n1435_018:0126c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，知而故問闡那言：「汝實作是事不？」",
        "translation": "The Buddha gathered the monks and knew this and therefore asked Cunda, \"Is this really what you've done?\"",
        "source": "T23n1435_018:0126c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實作。",
        "translation": "He replied, \"It's really done.",
        "source": "T23n1435_018:0127a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_018:0127a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以種種因緣呵責闡那：「云何名比丘，犯可悔過罪，諸比丘憐愍教令悔過，便作是言：『我今始知是事入戒經中半月次來所說。』」",
        "translation": "The Buddha rebuked Cunda for various reasons, \"What's the name of a monk who commits a repentable sin and is kind enough to teach the monks to repent, then says, 'Now I've just learned that this is something that's been taught in the precepts sūtra half a month later.'\"",
        "source": "T23n1435_018:0127a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，語諸比丘：「以十利故與比丘結戒。",
        "translation": "After he had been told about these various causes and conditions, he said to the monks, \"It's for the sake of the ten benefits that I've bound the monks to the precepts.",
        "source": "T23n1435_018:0127a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘說戒時，作是言：『我今始知是事入戒經中隨半月次來所說。』",
        "translation": "From now on, these precepts should be explained in this way: If a monk explains the precepts, he says, 'Now, I've just learned this is something that's entered the precepts in a sutra that's explained in half-moon increments.'",
        "source": "T23n1435_018:0127a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘知是比丘先曾再三聞說此戒，何況復過，是比丘非以不知故得脫。",
        "translation": "Monks who know that this monk has heard the precepts taught again and again before, how much more so in the past, and that monk didn't attain liberation because he didn't know them.",
        "source": "T23n1435_018:0127a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨所犯事，應令如法悔過、應更呵令折伏：『汝失無利是惡不善，說戒時不尊重戒不一心聽。』",
        "translation": "Whatever the offense, he should cause it to be repented of according to the teaching, and he should further reprimand and subdue it: 'Your failure to observe the precepts without benefit is bad and unwholesome, and when they were taught, you didn't respect them and didn't listen to them with a single mind.'",
        "source": "T23n1435_018:0127a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是事故得波逸提。」",
        "translation": "Because of this, you'll attain pratyekabuddha.\"",
        "source": "T23n1435_018:0127a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "A \"pāyattika\" is a burning hindrance that, if not repented of, can obstruct the path.",
        "source": "T23n1435_018:0127a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘說四波羅夷時，作是言：「我今始知是法入戒經中隨半月次來所說。」",
        "translation": "If a monk teaches the four grave offenses, he says, \"Now, I've just realized that this is a teaching that's been given in a sutra on the precepts for half a month.\"",
        "source": "T23n1435_018:0127a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得波逸提。",
        "translation": "He then attains pāyattika.",
        "source": "T23n1435_018:0127a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說十三僧伽婆尸沙時、若說二不定法時、若說三十尼薩耆波逸提時、若說九十波逸提時、若說四波羅提提舍尼法時、若說眾多學法時、若說七止諍法時，及說隨律經時，作是言：「我今始知是法入戒經中隨半月次來所說。」",
        "translation": "When he teaches the thirteen crimes of saṃghâvaśeṣa, the two uncertain principles, the thirty crimes of nisaji pāyatti, the ninety crimes of pāyatti, the four crimes of pratideśanī, the many crimes of training, the seven crimes of stopping arguments, or the vinaya sūtras, he says, \"Now, I've just come to know that this is a teaching that's entered the precepts in a sutra half a month in sequence.\"",
        "source": "T23n1435_018:0127a15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得波逸提。",
        "translation": "He attained pratyutpannas.",
        "source": "T23n1435_018:0127a20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除隨律經，說餘經時作是言：「我今始知是法入戒經中。」",
        "translation": "When he spoke on the sutras other than those that follow the Vinaya, he said, \"Now, I've just come to know that this is the way to enter the sutras on precepts.\"",
        "source": "T23n1435_018:0127a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "突吉羅。",
        "translation": "duṣkṛta.",
        "source": "T23n1435_018:0127a22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十三事)佛在舍衛國。",
        "translation": "(83 events) The Buddha was in the country of Śrāvastī.",
        "source": "T23n1435_018:0127a22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍衛城有治角師名達摩提那，富饒財寶種種成就。",
        "translation": "At the time, there was a horn tamer in Śrāvastī named Dharmadinnā who was wealthy and possessed various kinds of possessions.",
        "source": "T23n1435_018:0127a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人隨佛及僧所須物自恣請與，謂衣鉤、禪鎮、衣釘、鉢支、匕針筒。",
        "translation": "That man freely gave the Buddha and the saṃgha whatever they needed, which was a robe hook, a meditation pillar, a clothes peg, a bowl, and a dagger and a needle.",
        "source": "T23n1435_018:0127a24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸比丘眾多，數數往取，是人作不能供，婦兒空乏。",
        "translation": "Thus, many monks repeatedly went to take them, but that person made offerings that couldn't be made, and his wife and children were left empty.",
        "source": "T23n1435_018:0127a26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘居士瞋責呵言：「沙門釋子不知量不知厭足，若施者不知量，受者應知量。",
        "translation": "The other monks angrily rebuked them, saying, \"That ascetic or Śākyamuni doesn't know the amount and doesn't know enough, and if the donor doesn't know the amount, the recipient should know the amount.",
        "source": "T23n1435_018:0127a27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是達摩提那居士本富饒財，布施不知量故與，不能供，婦兒空乏。」",
        "translation": "That monk Dharmadinnā was wealthy and did not know the right amount of money to give, so he gave it away and couldn't offer it, leaving his wife and children empty.\"",
        "source": "T23n1435_018:0127a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，向佛廣說。",
        "translation": "One of those monks, who was practicing the ascetic practice of having few desires and being satisfied, heard about this and wasn't pleased at heart, so he explained it to the Buddha.",
        "source": "T23n1435_018:0127b01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，種種因緣呵責諸比丘：「云何名比丘，不知時不知量，若施者不知量，受者應知量。",
        "translation": "Because of this, the Buddha gathered a monastic community and rebuked the monks for various reasons, \"What's the name of a monk who doesn't know the amount when he gives and doesn't know the amount when he gives, and the recipient should know the amount?",
        "source": "T23n1435_018:0127b02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是達摩提那居士本富饒財，布施不知量故與，不能供，婦兒空乏。」",
        "translation": "That monk Dharmadinnā was wealthy and did not know the right amount of money to give, so he gave it away and was unable to make offerings, leaving his wife and children empty.\"",
        "source": "T23n1435_018:0127b05_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，語諸比丘：「以十利故與比丘結戒。",
        "translation": "After he had been rebuked for various reasons, he told the monks, \"It's because of the ten benefits that I've bound the monks to the precepts.",
        "source": "T23n1435_018:0127b06_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘，骨牙齒角作針筒者，波逸提。」",
        "translation": "From now on, this precept should be explained like this: 'Suppose a monk makes a needle out of bones, teeth, and horns, Boyanti.'",
        "source": "T23n1435_018:0127b07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "骨者，象骨、馬骨、蛇骨。",
        "translation": "Bone is an elephant bone, a horse bone, or a snake bone.",
        "source": "T23n1435_018:0127b09_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牙者，象牙、馬牙、猪牙。",
        "translation": "A tooth is an elephant's tusk, a horse's tusk, or a pig's tusk.",
        "source": "T23n1435_018:0127b09_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齒者，象齒、馬齒、猪齒。",
        "translation": "A tooth is an elephant tooth, horse tooth, or pig tooth.",
        "source": "T23n1435_018:0127b10_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "角者，羊角、牛角、水牛角、鹿角。",
        "translation": "Horns are the horns of sheep, cattle, buffalo, and deer.",
        "source": "T23n1435_018:0127b10_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "(Pāyatti) is a boiling, burning obstruction that, if not repented of, can obstruct the path.",
        "source": "T23n1435_018:0127b11_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘骨作針筒，波逸提。",
        "translation": "Of these offenses, if a monk's bones are made into a syringe, that's a pāyattika.",
        "source": "T23n1435_018:0127b12_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若牙、若齒、若角，隨作隨得爾所波逸提。",
        "translation": "If he makes a tooth, a tooth, or a horn, he'll get a pāyattika for doing as he pleases.",
        "source": "T23n1435_018:0127b13_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘用骨牙齒角作針筒者，是比丘應破是針筒已，入僧中唱言：「我用骨牙齒角作針筒，得波逸提罪。",
        "translation": "If a monk uses bones, teeth, teeth, and horns to make a syringe, that monk should break that syringe and enter the saṃgha and say, \"I used bones, teeth, teeth, and horns to make a syringe, and I was given the offense of pāyattika.",
        "source": "T23n1435_018:0127b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今發露悔過不覆藏。」",
        "translation": "Now, I'll reveal my repentance and not conceal it.\"",
        "source": "T23n1435_018:0127b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝破針筒未？」",
        "translation": "The saṃgha should then ask, \"Have you broken the syringe yet?\"",
        "source": "T23n1435_018:0127b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「已破。」",
        "translation": "If he says, \"It's been refuted,\" the monk should ask, \"Do you see the sin?\"",
        "source": "T23n1435_018:0127b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝見罪不？」",
        "translation": "the saṃgha should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0127b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「見罪。」",
        "translation": "If you say, \"See a sin,\"",
        "source": "T23n1435_018:0127b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教言：「汝今發露悔過，後莫復作。」",
        "translation": "you should teach them, \"Now, reveal your repentance, and don't do it again.\"",
        "source": "T23n1435_018:0127b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未打破，僧應約勅令破。",
        "translation": "If the saṃgha hasn't broken it, he should order the saṃgha to break it.",
        "source": "T23n1435_018:0127b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧不約勅，一切僧得突吉羅罪。",
        "translation": "If the saṃgha doesn't order it to be broken, then all saṃgha will be guilty of a grave offense.",
        "source": "T23n1435_018:0127b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧約勅不受，是比丘得突吉羅罪。",
        "translation": "If the saṃgha agrees to refuse an order, that monk will be guilty of a grave offense.",
        "source": "T23n1435_018:0127b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十四事)佛在俱舍彌國。",
        "translation": "(84 events) The Buddha was in the country of Kauśāmbī.",
        "source": "T23n1435_018:0127b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長老闡那用高廣好床。",
        "translation": "At the time, the elder Śāna used a high, wide, and nice bed.",
        "source": "T23n1435_018:0127b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與阿難遊行到闡那房，是闡那遙見佛來，從坐起偏袒右肩、合掌白佛言：「世尊！",
        "translation": "When the Buddha and Ānanda marched into Śāna's room, Śāna saw the Buddha coming from a distance, got up from his seat, bared his right shoulder, put his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T23n1435_018:0127b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入我房舍看床。」",
        "translation": "Come into my dwelling and look at the bed.\"",
        "source": "T23n1435_018:0127b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即入，見是床高好見已語阿難：「染污爛壞！",
        "translation": "The Buddha then entered, saw the high, attractive bed, and said to Ānanda, \"It's filthy and rotten!",
        "source": "T23n1435_018:0127b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是癡人用如是高廣好床？」",
        "translation": "How does a deluded person use such a high, wide, and nice bed?\"",
        "source": "T23n1435_018:0127b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種因緣呵責闡那：「云何名比丘，用高廣好床？」",
        "translation": "The Buddha rebuked Cunda for various reasons, \"What do you call a monk who uses a high, wide, and nice bed?\"",
        "source": "T23n1435_018:0127b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛種種因緣呵已，集比丘僧語諸比丘：「以十利故與比丘結戒。",
        "translation": "After the Buddha had spoken to them for various reasons, he gathered the monks and said to them, \"It's because of the ten benefits that we've established precepts for monks.",
        "source": "T23n1435_018:0127b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘欲作床者，當應量作。",
        "translation": "From now on, this precept should be explained like this: 'If a monk wants to make a bed, he should make it according to its measure.",
        "source": "T23n1435_018:0127b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "量者，足高八指，除入梐。",
        "translation": "A bed that's measured is eight fingers high, except when it enters the stockade.",
        "source": "T23n1435_018:0127c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過是作者，波逸提。」",
        "translation": "Make it more than that, pratyekabuddha.\"",
        "source": "T23n1435_018:0127c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "床者有二種：細梐繩床、麁梐繩床。",
        "translation": "There are two kinds of beds: fine stockaded rope beds and crude stockaded rope beds.",
        "source": "T23n1435_018:0127c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麁梐繩床有五種：阿珊蹄脚、波郎劬脚、羝羊角脚、尖脚、曲脚。",
        "translation": "There are five kinds of coarse stockade beds: asanta-legged, borang-legged, billy-goat-horned, pointed, and crooked-legged.",
        "source": "T23n1435_018:0127c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "細梐繩床亦有五種：阿珊蹄脚、波郎劬脚、羝羊角脚、尖脚、曲脚。",
        "translation": "There are also five kinds of sub-stockaded rope-beds: the asanta-leg, the parang-leg, the ram's horn-leg, the pointed leg, and the bent leg.",
        "source": "T23n1435_018:0127c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高八指者，佛言：「用我八指，第三分入梐。」",
        "translation": "One with eight fingers high is one whom the Buddha said, \"Use my eight fingers for the third part of the stockade.\"",
        "source": "T23n1435_018:0127c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "A pāyattika is a boiling, burning, and obstructing obstruction that, if not repented of, can obstruct the path.",
        "source": "T23n1435_018:0127c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘過八指作床脚者，波逸提。",
        "translation": "Of these offenses, if a monk makes a bed leg with more than eight fingers, that's a pāyattika.",
        "source": "T23n1435_018:0127c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨作，隨得爾所波逸提。",
        "translation": "If he does so, he'll get this kind of pāyattika.",
        "source": "T23n1435_018:0127c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘過八指作床脚者，應截脚，入僧中白言：「我過八指作床脚，得波逸提罪，今僧中發露悔過不覆藏。」",
        "translation": "If a monk makes a bedstead with more than eight fingers, he should amputate his feet and go into the saṃgha and say, \"I made a bedstead with more than eight fingers, and I've been given the offense of pāyattika; now, I'll reveal my repentance in the saṃgha and not conceal it.\"",
        "source": "T23n1435_018:0127c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝截未？」",
        "translation": "The saṃgha should then ask, \"Have you cut them off yet?\"",
        "source": "T23n1435_018:0127c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「已截。」",
        "translation": "If you say, 'I've cut it off,'\"",
        "source": "T23n1435_018:0127c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「汝見罪不？」",
        "translation": "and ask, \"Do you see the sin?\"",
        "source": "T23n1435_018:0127c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「見罪。」",
        "translation": "If he says, \"See the offense,\" the saṃgha should say.",
        "source": "T23n1435_018:0127c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應言：「汝如法悔過，後莫復作。」",
        "translation": "the saṃgha should say, \"Repent according to the teaching, and don't do it again.\"",
        "source": "T23n1435_018:0127c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「未截。」",
        "translation": "If he says, \"I haven't cut it off yet,\"",
        "source": "T23n1435_018:0127c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應約勅令截。",
        "translation": "the saṃgha should agree to cut it off with an order.",
        "source": "T23n1435_018:0127c14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧不約勅令載者，僧得突吉羅。",
        "translation": "If the saṃgha doesn't order it to be carried by an imam, the saṃgha will be granted a surpassing legacy.",
        "source": "T23n1435_018:0127c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧約勅不受，是比丘得突吉羅。",
        "translation": "If the saṃgha agrees to accept my order, that monk will obtain a surpassing leg.",
        "source": "T23n1435_018:0127c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十五事)佛在王舍城。",
        "translation": "(85 events) The Buddha was in the city of Rājagṛha.",
        "source": "T23n1435_018:0127c16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時六群比丘以草木兜羅綿貯臥具。",
        "translation": "At the time, six groups of monks were storing bedding made of wood, straw, and tulips.",
        "source": "T23n1435_018:0127c17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士瞋不喜呵罵：「沙門釋子自言：『善好有功德。』",
        "translation": "The monks were angry, displeased, and rebuked, \"The ascetic Śākyamuni said to himself, 'Good, nice, and meritorious!'",
        "source": "T23n1435_018:0127c18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃以兜羅綿貯臥具，如王如大臣。」",
        "translation": "He then packed his bedding with wood and tulips, just like a king or a minister.\"",
        "source": "T23n1435_018:0127c19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，向佛廣說。",
        "translation": "One of those monks, who was practicing the ascetic practice of having few desires and being satisfied, heard about this and wasn't pleased at heart, so he explained it to the Buddha.",
        "source": "T23n1435_018:0127c20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，知而故問六群比丘：「汝實作是事不？」",
        "translation": "The Buddha gathered the monks and knew this, so he asked the six groups of monks, \"Is this really what you do?\"",
        "source": "T23n1435_018:0127c21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實作。",
        "translation": "He replied, \"It's really done.",
        "source": "T23n1435_018:0127c22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_018:0127c22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以種種因緣呵責：「云何名比丘，以兜羅綿貯臥具？」",
        "translation": "The Buddha rebuked them for various reasons, \"What is the name of a monk who stores his bedding in tulip cotton?\"",
        "source": "T23n1435_018:0127c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，語諸比丘：「以十利故與比丘結戒。",
        "translation": "After he had been told about these various causes and conditions, he said to the monks, \"It's for the sake of the ten benefits that he has bound the monks to the precepts.",
        "source": "T23n1435_018:0127c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘自以兜羅綿貯臥具，若使人貯，波逸提。」",
        "translation": "From now on, this precept should be explained like this: 'If a monk stores his own bedding in tulipwood, or if he causes someone else to store it, pratyekabuddha.'",
        "source": "T23n1435_018:0127c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兜羅綿者，柳華、白楊華、阿鳩羅華、波鳩羅華、鳩舍羅華、間闍華、波波闍華、離摩華，皆波逸提。",
        "translation": "Tuluo cotton, which is the willow flower, poplar flower, akula flower, pakula flower, kuśāla flower, mesquite flower, pārājika flower, and freemason flower, is all pāyattika.",
        "source": "T23n1435_018:0127c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "A pāyattika is a boiling, burning, and obstructing obstruction that, if not repented of, can impede the path.",
        "source": "T23n1435_018:0127c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘以草木兜羅綿貯臥具，波逸提。",
        "translation": "If this is a violation, it's a pāyattika if a monk stockpiles bedding with wood, grass, and tulips.",
        "source": "T23n1435_018:0128a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨貯，隨得爾所波逸提。",
        "translation": "Storing it as he wishes will get him pāyattied in that way.",
        "source": "T23n1435_018:0128a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘以兜羅綿貯臥具者，是比丘應摘破却兜羅綿，到僧中白言：「我以兜羅綿貯臥具，得波逸提罪，發露悔過不覆藏。」",
        "translation": "If a monk stores bedding made of tulo wool, that monk should pick off the tulo wool, go to the saṃgha, and say, \"I stored bedding made of tulo wool, which resulted in the offense of pāyattika, and I revealed my repentance and didn't conceal it.\"",
        "source": "T23n1435_018:0128a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝摘却未？」",
        "translation": "The saṃgha should then ask, \"Have you removed it yet?\"",
        "source": "T23n1435_018:0128a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「已却。」",
        "translation": "If he says, \"I've gotten rid of it,\"",
        "source": "T23n1435_018:0128a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝見罪不？」",
        "translation": "the saṃgha should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0128a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「見罪。」",
        "translation": "If he says, \"See the offense,\" the saṃgha will agree to command him, \"Repent according to the teaching, and don't do it again.\"",
        "source": "T23n1435_018:0128a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應約勅：「汝如法悔過，後莫復作。」",
        "translation": "the saṃgha should agree to command, \"Repent according to the teaching, and don't do it again.\"",
        "source": "T23n1435_018:0128a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「未摘。」",
        "translation": "If he says, \"It hasn't been taken away yet,\"",
        "source": "T23n1435_018:0128a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應約勅令摘。",
        "translation": "you should command him to remove it.",
        "source": "T23n1435_018:0128a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不約勅，僧得突吉羅。",
        "translation": "If the saṃgha doesn't order him to do so, he'll get a surrogate.",
        "source": "T23n1435_018:0128a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧約勅不受，是比丘得突吉羅罪。",
        "translation": "If the saṃgha gives an order and doesn't accept it, that monk will be guilty of a grave offense.",
        "source": "T23n1435_018:0128a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十六事)佛在舍衛國。",
        "translation": "(Eighty-six events) The Buddha was in Śrāvastī.",
        "source": "T23n1435_018:0128a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時毘舍佉鹿子母，往詣佛所頭面禮足却坐一面，佛以種種因緣說法示教利喜，示教利喜已默然。",
        "translation": "At the time, the mother of the deer in Vaiśākha went to the Buddha, bowed her head and feet, and withdrew to sit at one side while he explained the various causes and conditions that would benefit him.",
        "source": "T23n1435_018:0128a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知佛說法示教利喜默然已，從坐起偏袒右肩、合掌白佛言：「世尊！",
        "translation": "After he knew that the Buddha had spoken the Dharma and shown them how to benefit and delight, he got up from his seat, bared his right shoulder, put his palms together, and said to the Buddha, \"Bhagavān!",
        "source": "T23n1435_018:0128a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願佛及僧受我明日請。」",
        "translation": "May the Buddha and the saṃgha accept my invitation for tomorrow.\"",
        "source": "T23n1435_018:0128a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛默然受之。",
        "translation": "The Buddha accepted it in silence.",
        "source": "T23n1435_018:0128a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知佛默然受已，頭面禮佛足右繞而去，還自舍通夜辦種種多美飲食。",
        "translation": "After he knew the Buddha had quietly accepted it, he bowed his head to the Buddha's feet, circled to his right, and departed, going back to his house to prepare a variety of delicious foods throughout the night.",
        "source": "T23n1435_018:0128a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛是夜共阿難露地遊行，佛看星宿相，語阿難言：「若今有人問知星宿相者：『何時當雨？』",
        "translation": "That night, the Buddha and Ānanda were promenading in the open air, and the Buddha looked at the stars and said to Ānanda, \"Suppose someone were to ask someone who knows the stars' sign, 'When will it rain?'",
        "source": "T23n1435_018:0128a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼必言：『七歲當雨。』」",
        "translation": "They must say, 'It will rain in seven years.'\"",
        "source": "T23n1435_018:0128a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語阿難：「初夜過已至中夜，是星相滅，更有異相出。",
        "translation": "The Buddha said to Ānanda, \"After the first night passes and the middle of the night, this is the time when the characteristics of the stars cease and another different characteristic appears.",
        "source": "T23n1435_018:0128a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾時有人問知相者：『何時當雨。』",
        "translation": "If someone then asks those who know the signs, 'When will it rain?'",
        "source": "T23n1435_018:0128a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼必言：『過七月當雨。』」",
        "translation": "He'll say, 'After seven months, it will rain.'\"",
        "source": "T23n1435_018:0128a21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又語阿難：「中夜已過至後夜，是星相滅更有異相出。",
        "translation": "Again, he said to Ānanda, \"After the middle of the night and into the latter part of the night, these stars will cease to have different characteristics and another will emerge.",
        "source": "T23n1435_018:0128a22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾時問知相者：『何時當雨？』",
        "translation": "Suppose someone then asks the person who knows the signs, 'When will it rain?'",
        "source": "T23n1435_018:0128a23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼必言：『七日當雨。』」",
        "translation": "They will surely say, 'It will rain for seven days.'\"",
        "source": "T23n1435_018:0128a24_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是夜已過地了時，東方有雲出，形如圓椀遍滿空中，是雲能作大雨滿諸坑坎。",
        "translation": "After that night had passed and the earth had risen, a cloud in the east, shaped like a round shotgun, emerged and filled the sky, and that cloud was capable of producing a great rain that would fill pits and hollows.",
        "source": "T23n1435_018:0128a24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛語阿難：「語諸比丘：『是椀雲雨有功德，能除病。",
        "translation": "It was then that the Buddha said to Ānanda, \"Tell the monks, 'This shotgun cloud of rain has merit and can remove illness.'",
        "source": "T23n1435_018:0128a26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸比丘欲洗者，當露地立洗。』」",
        "translation": "If monks want to wash it, they must stand on the bare ground and wash it.'\"",
        "source": "T23n1435_018:0128a27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難受教，語諸比丘：「是椀雲雨有功德，能除病。",
        "translation": "Ānanda accepted the teaching and said to the monks, \"This shotgun cloud of rain has merit and can remove illness.",
        "source": "T23n1435_018:0128a28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸比丘欲洗者，聽露地立洗。」",
        "translation": "If monks want to wash it, listen to them as they stand in the open air.'\"",
        "source": "T23n1435_018:0128a29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸比丘隨意露地立洗。",
        "translation": "The monks then did as they wished, standing in the open ground to wash.",
        "source": "T23n1435_018:0128a30_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時毘舍佉鹿子母，辦飲食已早起敷座處，遣婢使白佛：「時到食具已辦，佛自知時。」",
        "translation": "After preparing the meal, Vaiśākha's mother got up early and prepared her seat. She sent her servant to tell the Buddha, \"The time has come to prepare the meal; the Buddha himself knows the time.\"",
        "source": "T23n1435_018:0128b01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婢受教往詣祇洹，覓諸比丘不見，於門孔間看，見裸形露洗，見已心不喜，作是念：「是中都無比丘，盡是裸形外道無慚愧人。」",
        "translation": "The servant was instructed to go to Jetavana, look for monks who hadn't seen him, and then he looked between the doorway and saw a naked man in a bare bath. After he saw this, his heart wasn't pleased, and he thought, \"There are no monks here; they're all naked non-Buddhists with no sense of shame.\"",
        "source": "T23n1435_018:0128b02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即還語毘舍佉鹿子母言：「祇洹中無一比丘，盡是裸形外道。」",
        "translation": "After that thought, he then returned to Mother Vaiśākha's deer, saying, \"There isn't a single monk in Jipan, and they're all naked non-Buddhists.\"",
        "source": "T23n1435_018:0128b05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是毘舍佉母智慧利根，知今日雨墮，諸比丘必當露地裸形洗浴，是婢癡無所知故作是言：「祇洹中無一比丘，盡是裸形外道。」",
        "translation": "That mother of Vaiśākha's wisdom and sharp faculties knew that today when the rain falls, the monks will surely be naked and wash their bodies in the open ground, and that maidservant's delusion and lack of knowledge led her to say, \"There isn't a single monk in Jipan who's completely naked and a non-Buddhist.\"",
        "source": "T23n1435_018:0128b07_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便喚餘婢往詣祇洹，打門作聲白言：「時到，食具已辨。」",
        "translation": "She then summoned the other maidservants to go to Jetavana and beat open the door, making a noise and saying, \"The time has come, and the food preparation has been identified.\"",
        "source": "T23n1435_018:0128b10_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即受教去，往到祇洹打門作聲白言：「時到，食具已辦，佛自知時。」",
        "translation": "He then took the teaching and departed, went to Jīvain, punched the door, and said in a loud voice, \"The time has come, the food preparation has been done, and the Buddha himself knows the time.\"",
        "source": "T23n1435_018:0128b11_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛與大眾，著衣持鉢眾僧圍繞俱詣其舍。",
        "translation": "The Buddha then went to his abode with the whole community, wearing robes and carrying bowls, and surrounded by the saṃgha.",
        "source": "T23n1435_018:0128b13_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在僧中坐，毘舍佉母自行澡水，自手與多美飲食。",
        "translation": "While the Buddha was sitting there among the monks, Mother Vaiśākha washed her own hands with water and gave herself a delicious meal.",
        "source": "T23n1435_018:0128b14_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食已自手行水，知收鉢已，持小床坐佛前聽說法，白佛言：「世尊！",
        "translation": "After she had eaten, she carried water in her own hand, knew she had put away her bowl, sat down with her cot in front of the Buddha to listen to his teaching, and said to him, \"Bhagavān!",
        "source": "T23n1435_018:0128b15_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與我願。」",
        "translation": "Give me your vow.\"",
        "source": "T23n1435_018:0128b17_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸多陀阿伽度、阿羅呵、三藐三佛陀，不得與汝過願。」",
        "translation": "The Buddha said, \"The tathāgatas, arhats, and samyak-saṃbuddhas can't grant you a false vow.\"",
        "source": "T23n1435_018:0128b17_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍佉言：「與我可得願。」",
        "translation": "Vaiśākha said, \"Grant me the vow.\"",
        "source": "T23n1435_018:0128b18_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「與汝可得願，汝欲得何願？」",
        "translation": "The Buddha said, \"What vow do you want to obtain that would be obtainable with you?\"",
        "source": "T23n1435_018:0128b19_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍佉言：「一者我欲與比丘僧雨浴衣。",
        "translation": "Vaiśākha said, \"One, I want to give the monks and nuns my bathing suit in the rain.",
        "source": "T23n1435_018:0128b19_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者與比丘尼僧浴衣。",
        "translation": "Second, I'd like to give the monks and nuns bathing robes.",
        "source": "T23n1435_018:0128b20_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者客比丘來我與食。",
        "translation": "Third, I'll give food to a visiting monk who comes to visit.",
        "source": "T23n1435_018:0128b21_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者遠行比丘我與食。",
        "translation": "Fourth, I'll give food to a monk who's traveling from afar.",
        "source": "T23n1435_018:0128b21_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者病比丘我與飲食。",
        "translation": "Fifth, I'll give food and drink to a sick monk.",
        "source": "T23n1435_018:0128b22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者看病比丘我與飲食。",
        "translation": "Six: I'll give food and drink to a monk who's visiting a sick monk.",
        "source": "T23n1435_018:0128b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者我常與比丘僧粥。",
        "translation": "7. I always give a monk his monk's gruel.",
        "source": "T23n1435_018:0128b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者多知識少知識比丘，我與病緣湯藥及所須物。」",
        "translation": "Eight, I give medicine and necessary things to sick monks who have lots of knowledge and few friends.\"",
        "source": "T23n1435_018:0128b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「汝見何因緣故，欲與比丘僧雨浴衣？」",
        "translation": "The Buddha said, \"What do you see as the reason you want to give the monks' raincoats and bathing suits?\"",
        "source": "T23n1435_018:0128b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德！",
        "translation": "He replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0128b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今日早起敷座已，遣婢使詣祇洹白佛時到。",
        "translation": "After I rose early this morning to prepare my seat, I sent a servant to Jīvaka to tell him that the Buddha had arrived at that time.",
        "source": "T23n1435_018:0128b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婢至門間見諸比丘露地雨中裸形洗浴，婢還言：『祇洹中無一比丘，但諸外道無慚愧人。』",
        "translation": "When the maid went to the entrance, she saw the monks naked in the rain on the bare ground, and she returned, saying, 'There isn't a single monk in Jipan, except for those non-Buddhists who have no sense of shame.'",
        "source": "T23n1435_018:0128b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great Teacher!",
        "source": "T23n1435_018:0128b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘裸形在佛前和上阿闍梨一切上座前，則為無羞，是故欲與比丘僧雨浴衣著，自在露地雨中洗浴。」",
        "translation": "It would be shameless for a monk to appear naked before the Buddha and before all the superior seats of the superior preceptors; therefore, he would like to wear a bathing robe with the monks and wash himself in the rain on bare ground.\"",
        "source": "T23n1435_018:0128b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘舍佉！",
        "translation": "\"Vaiśākha!",
        "source": "T23n1435_018:0128c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見何因緣故，欲與比丘尼僧浴衣。」",
        "translation": "What do you see as the reason you want to give the monks and nuns bathing suits?\"",
        "source": "T23n1435_018:0128c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德！",
        "translation": "He replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0128c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我一時與諸居士婦共至阿耆羅河中洗浴，時諸比丘尼亦入河中裸形洗浴。",
        "translation": "One time, I went with some householders and their wives to bathe in the Ajira River, and the monks and nuns also went into the river and washed themselves naked.",
        "source": "T23n1435_018:0128c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸居士婦見已心不喜，呵責言：『是輩薄福德不吉，麁身大腹垂乳，何用學梵行為？』",
        "translation": "When the householders and their wives saw that, they were displeased and rebuked me, saying, 'That's a group of people with little virtue and bad fortune, and they have a crude body and large bellies with drooping breasts; why would they want to train in the religious practice?'",
        "source": "T23n1435_018:0128c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtue!",
        "source": "T23n1435_018:0128c08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人裸形醜惡，是故我欲與浴衣。」",
        "translation": "A woman's naked form is ugly, so I want to give her a bathrobe.\"",
        "source": "T23n1435_018:0128c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘舍佉！",
        "translation": "\"Vaiśākha!",
        "source": "T23n1435_018:0128c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見何因緣故，欲與客來比丘飲食？」",
        "translation": "What do you see as the reason you want to give food and drink to a visiting monk?\"",
        "source": "T23n1435_018:0128c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德！",
        "translation": "He replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0128c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客來比丘不知何處可去、不可去？",
        "translation": "A visiting monk doesn't know where he can or can't go.",
        "source": "T23n1435_018:0128c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道路疲極未得休息。",
        "translation": "The road is exhausted, and I haven't gotten any rest.",
        "source": "T23n1435_018:0128c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我欲與飲食後，隨知可去、不可去處。」",
        "translation": "That's why I want to give you something to eat and drink and then follow it to a place where I know you can and can't go.\"",
        "source": "T23n1435_018:0128c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘舍佉！",
        "translation": "\"Vaiśākha!",
        "source": "T23n1435_018:0128c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見何因緣故，欲與遠行比丘食？」",
        "translation": "What do you see as the reason you want to give food to a monk who travels far?\"",
        "source": "T23n1435_018:0128c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德！",
        "translation": "He replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0128c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠行比丘，若待食時怛鉢那時，若行乞食則伴捨去、或夜中入嶮道、或獨行曠野，我與食故，不失伴不入嶮道，是故我與飲食。」",
        "translation": "If a monk who travels far and wide waits for food when he's in tamponah, or if he goes begging for food, then his companions leave him, or he goes into a dangerous path in the middle of the night, or he travels alone in the wilderness, I give food so that he doesn't lose his companions and doesn't go into a dangerous path; therefore, I give food.\"",
        "source": "T23n1435_018:0128c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘舍佉！",
        "translation": "\"Vaiśākha!",
        "source": "T23n1435_018:0128c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見何因緣故，欲與病比丘飲食？」",
        "translation": "What do you see as the reason you want to give food and drink to a sick monk?\"",
        "source": "T23n1435_018:0128c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德！",
        "translation": "He replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0128c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "病比丘不得隨病飲食則病難差，是故我與隨病飲食，則病易差。」",
        "translation": "If a sick monk doesn't eat and drink according to his illness, then it's difficult to get rid of it; therefore, when I give food and drink according to my illness, it's easy to get rid of it.\"",
        "source": "T23n1435_018:0128c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘舍佉！",
        "translation": "\"Visākhā!",
        "source": "T23n1435_018:0128c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見何因緣故，欲與看病比丘飲食？」",
        "translation": "What do you see as the reason you want to give food and drink to a monk who's looking after him?\"",
        "source": "T23n1435_018:0128c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德！",
        "translation": "He replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0128c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "看病比丘若待僧中食後食、若行乞食去，是病比丘瞻養事闕。",
        "translation": "If a monk who's sick waits for the midday meal in the saṃgha and then eats or goes off on a mission for food, this is a sick monk who's deficient in maintenance.",
        "source": "T23n1435_018:0128c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若煮飯作粥作羹、煮魚肉煮湯藥、出內大小便不淨器若棄唾器。",
        "translation": "If he cooks rice, makes congee, makes soup, cooks fish and meat, boils medicine, relieves himself of impure urine and defecation, or discards his saliva bowl, then he'll be allowed to cook rice, make congee, make soup, cook fish, and make medicine.",
        "source": "T23n1435_018:0128c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我與看病比丘飲食，瞻養不闕，便得煮飯作粥作羹煮肉及煮湯藥、出內大小便器棄唾器。」",
        "translation": "Therefore, when I give a meal to a monk who's sick and whose maintenance isn't lacking, I can cook rice and porridge, make soup and meat, boil meat and medicine, get out of the stool, urinate and defecate, and discard the saliva container.\"",
        "source": "T23n1435_018:0128c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘舍佉！",
        "translation": "\"Vaiśākha!",
        "source": "T23n1435_018:0128c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見何因緣故，欲常與比丘僧粥？」",
        "translation": "What do you see as the reason you want to keep giving monks' gruel?\"",
        "source": "T23n1435_018:0128c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德！",
        "translation": "He replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0128c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘不食粥，有飢渴惱、或時腹內風起，我常與粥故則無眾惱。」",
        "translation": "If a monk who doesn't eat gruel has hunger and thirst, or if a wind rises in his belly at some point, I will always give him gruel, so he won't have any troubles.\"",
        "source": "T23n1435_018:0128c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「毘舍佉！",
        "translation": "\"Vaiśākha!",
        "source": "T23n1435_018:0128c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見何因緣故，欲與多知識、少知識比丘，病緣湯藥及所須物？」",
        "translation": "What do you see as the cause for wanting to give a monk with many or few friends medicines and necessary items for ailments?\"",
        "source": "T23n1435_018:0128c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「病比丘必欲得湯藥所須諸物，以是故我與。",
        "translation": "He replied, \"The sick monk must want the things he needs for the potion, so I'll give them to him.",
        "source": "T23n1435_018:0129a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次大德！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T23n1435_018:0129a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若聞某比丘彼住處死，佛記彼比丘三結斷得須陀洹，不墮惡道必得涅槃，極至七生天人中往返得盡眾苦。",
        "translation": "\"If I hear about a certain monk who dies in that place, the Buddha remembers that monk cutting the three bonds and becoming a stream entrant, not falling into a bad path and surely attaining nirvāṇa, and going back and forth among gods and humans for up to seven lifetimes to end all suffering.",
        "source": "T23n1435_018:0129a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtuous man!",
        "source": "T23n1435_018:0129a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當問：『是長老曾來舍衛國不？』",
        "translation": "I will ask, 'Has this elder ever come to Śrāvastī?'",
        "source": "T23n1435_018:0129a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我聞是比丘曾來舍衛國，我思惟：『是長老或受我雨浴衣、或受客比丘飲食、或遠行飲食、或隨病飲食、或看病飲食、或常與粥、或病比丘湯藥諸物。』",
        "translation": "If I hear that this monk once came to Śrāvastī, I think, 'That elder may have accepted my bathing suit, or he may have accepted food and drink from a visiting monk, or he may have eaten on a journey, or he may have eaten according to illness, or he may have looked after illness, or he may have always given gruel, or he may have given a sick monk something to drink.'",
        "source": "T23n1435_018:0129a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Mañjuśrī!",
        "source": "T23n1435_018:0129a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以是因緣故覺意滿。",
        "translation": "It's for this reason that I've come to realize the fulfillment of my intention.",
        "source": "T23n1435_018:0129a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtue!",
        "source": "T23n1435_018:0129a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若聞某比丘彼住處死，佛記彼比丘三結盡、三毒薄，得斯陀含，一來是世得盡苦際。",
        "translation": "If I hear about a monk who died in that place, the Buddha remembers that monk as having ended the three bonds and weakened the three poisons, and he attained once-returner status, which brings him to the end of suffering in this world.",
        "source": "T23n1435_018:0129a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當問：『是長老曾來舍衛國不？』",
        "translation": "I'll ask, 'Did that elder ever come to Śrāvastī?'",
        "source": "T23n1435_018:0129a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我聞是比丘曾來舍衛國。",
        "translation": "\"If I heard that this monk had come to Śrāvastī.",
        "source": "T23n1435_018:0129a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtue!",
        "source": "T23n1435_018:0129a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是思惟：『是長老，或受我雨浴衣、或受客比丘飲食、或受遠行飲食、或隨病飲食、或看病飲食、或常與粥、或病比丘湯藥諸物。』",
        "translation": "I thus thought, 'That elder may have accepted my bathing suit, or he may have accepted food and drink from a visiting monk, or he may have accepted food and drink from a traveling monk, or he may have accepted food and drink to accompany a sick person, or he may have accepted food and drink to look after a sick person, or he may have always given gruel, or he may have given a sick monk something to drink.'",
        "source": "T23n1435_018:0129a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Mañjuśrī!",
        "source": "T23n1435_018:0129a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以是因緣故覺意滿。",
        "translation": "It's for this reason that I've come to realize the fulfillment of my intention.",
        "source": "T23n1435_018:0129a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtue!",
        "source": "T23n1435_018:0129a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若聞某比丘彼住處死，佛記彼比丘得阿那含，五下結盡，便於天上般涅槃，不還是間。",
        "translation": "\"If I hear that a certain monk dies in that place, the Buddha remembers that monk attaining non-returnerhood and ending the five lower bonds, and then he attains parinirvāṇa in the heavens, never to lapse again.",
        "source": "T23n1435_018:0129a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtue!",
        "source": "T23n1435_018:0129a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當問：『是長老曾來舍衛國不？』",
        "translation": "I will ask, 'Has this elder ever come to Śrāvastī?'",
        "source": "T23n1435_018:0129a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我聞是比丘曾來，我思惟：『是長老，或受我雨浴衣、或受客比丘飲食、或遠行飲食隨病飲食、看病飲食、或常與粥、病比丘湯藥諸物。』",
        "translation": "If I hear that this monk has been here before, I think, 'That elder may have accepted my bathing suit, or he may have accepted food and drink from a visiting monk, or he may have traveled to eat and drink, followed by food and drink for the sick, or he may have taken food and drink for the sick, or he may have always given gruel or things like hot water and medicine for sick monks.'",
        "source": "T23n1435_018:0129a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Mañjuśrī!",
        "source": "T23n1435_018:0129a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以是因緣故覺意滿。",
        "translation": "It's for this reason that I've come to realize the fulfillment of my intention.",
        "source": "T23n1435_018:0129a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtue!",
        "source": "T23n1435_018:0129a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若聞某比丘彼住處死，佛記彼比丘得阿羅漢，我生已盡、梵行已立、所作已辦、自知作證。",
        "translation": "If I hear that a certain monk died in that place, the Buddha remembers that monk as having attained arhatship, and that my births have been ended, the religious practice has been established, the task has been accomplished, and I know and realize it for myself.",
        "source": "T23n1435_018:0129a24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當問：『是長老曾來舍衛國不？』",
        "translation": "I'll ask, 'Did that elder ever come to Śrāvastī?'",
        "source": "T23n1435_018:0129a26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我聞是比丘曾來，我思惟：『是長老，或受我雨浴衣、或受客比丘飲食、遠行飲食、隨病飲食、看病飲食、或常與粥、病比丘湯藥諸物。』",
        "translation": "If I hear that this monk has been here before, I think, 'That elder may have accepted my bathing suit, or he may have accepted food and drink from a visiting monk, food and drink for a journey, food and drink to accompany a sick person, food and drink to help a sick person, or he may have always given me gruel or something like hot water or medicine for a sick monk.'",
        "source": "T23n1435_018:0129a26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以是因緣故覺意滿。",
        "translation": "It's for this reason that I felt my intentions were fulfilled.",
        "source": "T23n1435_018:0129a29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Mañjuśrī!",
        "source": "T23n1435_018:0129b01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我財福德成就，以是因緣攝法福德。」",
        "translation": "Thus have I accumulated wealth and merit, and by these causes and conditions have I gathered the merit of the Dharma.\"",
        "source": "T23n1435_018:0129b01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T23n1435_018:0129b02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍佉！",
        "translation": "Vaiśākha!",
        "source": "T23n1435_018:0129b02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聽汝是諸願：汝與比丘僧雨浴衣、比丘尼僧浴衣、客比丘飲食、遠行比丘飲食、隨病比丘飲食、看病比丘飲食、比丘僧常與粥、多知識少知識比丘與病緣湯藥諸物。",
        "translation": "These are the vows I've heard you make: that you give monks and nuns robes for bathing in the rain, monks and nuns robes for bathing, food for visiting monks, food for monks traveling from afar, food for monks following a sick person, food for monks visiting a sick person, gruel for monks and nuns, and things like hot water and medicine for the sick for monks with many or few friends.",
        "source": "T23n1435_018:0129b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘舍佉！",
        "translation": "Vaiśākha!",
        "source": "T23n1435_018:0129b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是財福德成就，以是因緣攝法福德。」",
        "translation": "This is the achievement of wealth and merit, and it's the cause and condition for gathering the merit of the Dharma.\"",
        "source": "T23n1435_018:0129b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為毘舍佉說種種因緣，示教利喜已從坐起去。",
        "translation": "After explaining the various causes and conditions for Vaiśākha, the Buddha showed them how to rejoice and got up from his seat and departed.",
        "source": "T23n1435_018:0129b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，語諸比丘：「從今聽諸比丘畜雨浴衣隨意露地洗。」",
        "translation": "In that vein, the Buddha gathered the monks and told them, \"From now on, listen to the monks as they store rainwater bathing robes and wash them on the bare ground as they like.\"",
        "source": "T23n1435_018:0129b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸比丘，知佛聽畜雨浴衣，廣長大作。",
        "translation": "Those monks knew that the Buddha had heard that storing rain and bathing suits was a vast, long, and mighty task.",
        "source": "T23n1435_018:0129b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，種種因緣呵責：「云何名比丘，知佛聽畜雨浴衣，便廣長大作？」",
        "translation": "One of those monks, who was practicing the ascetic practice of having few desires and being satisfied, was displeased when he heard this, and he was rebuked for various reasons, \"What's the name of a monk who knows that when the Buddha hears that he's storing bathing suits, it's a big, long, and extensive job?\"",
        "source": "T23n1435_018:0129b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，向佛廣說。",
        "translation": "After he had been told about these various causes and conditions, he explained them in detail to the Buddha.",
        "source": "T23n1435_018:0129b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，知而故問諸比丘：「汝實作是事不？」",
        "translation": "The Buddha gathered the monks and knew this and therefore asked the monks, \"Is this really what you do?\"",
        "source": "T23n1435_018:0129b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實作。",
        "translation": "He replied, \"It's really done.",
        "source": "T23n1435_018:0129b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_018:0129b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以種種因緣呵責：「云何名比丘，知我聽畜雨浴衣，便廣長大作畜？」",
        "translation": "The Buddha rebuked them for various reasons, \"How does a monk know that I hear the rain and bathing clothes of a domestic animal and then grow large and extensive as a domestic animal?\"",
        "source": "T23n1435_018:0129b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，語諸比丘：「以十利故與比丘結戒。",
        "translation": "After he had been told about various causes and conditions, he said to the monks, \"It's for the sake of the ten benefits that I've bound the monks to the precepts.",
        "source": "T23n1435_018:0129b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘欲作雨浴衣，當應量作。",
        "translation": "From now on, this precept should be explained like this: 'If a monk wants to make a raincoat, he should make it according to measure.",
        "source": "T23n1435_018:0129b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "量者，長佛六搩手、廣二搩手半，過是作者，波逸提。」",
        "translation": "A monk who measures it will make it six Ṛvahās and two and a half Ṛvahās long and two Ṛvahās wide, but this is the author, pāyattika.\"",
        "source": "T23n1435_018:0129b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "A \"pāyattika\" is a boiling, burning, and obstructing hindrance that, if not repented of, can obstruct the path.",
        "source": "T23n1435_018:0129b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘過量長作雨浴衣，波逸提。",
        "translation": "Of these offenses, if a monk makes a raincoat an excessive amount of time, it's a pāyattika.",
        "source": "T23n1435_018:0129b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過量廣作，波逸提。",
        "translation": "If he makes them excessively and extensively, it's a pāyattika.",
        "source": "T23n1435_018:0129b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過量廣長作，波逸提。",
        "translation": "If he does it excessively and extensively, it's a pāyattika.",
        "source": "T23n1435_018:0129b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘過量廣長作雨浴衣，是衣應截斷，入僧中作是言：「我過量廣長作雨浴衣，得波逸提罪，今發露悔過不覆藏。」",
        "translation": "If a monk makes a raincoat that's too ample and too long, he should cut it off and go into the saṃgha and say, \"I made a raincoat that's too ample and too long, and I've incurred the offense of pāyattika.",
        "source": "T23n1435_018:0129b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝截斷未？」",
        "translation": "The saṃgha then asks, \"Have you cut it off yet?\"",
        "source": "T23n1435_018:0129b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「已截。」",
        "translation": "If he says, \"I've cut it off,\" the monk should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0129b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝見罪不？」",
        "translation": "the saṃgha should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0129b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「見罪。」",
        "translation": "If he says, \"See the offense,\"",
        "source": "T23n1435_018:0129b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應語言：「汝如法悔過，後莫復作。」",
        "translation": "you should say, \"Repent according to the teaching, and don't do it again.\"",
        "source": "T23n1435_018:0129b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「未截。」",
        "translation": "If he says, \"It hasn't been cut off yet,\"",
        "source": "T23n1435_018:0129b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應約勅令截。",
        "translation": "the saṃgha should order them to stop, according to an order.",
        "source": "T23n1435_018:0129b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧不約勅，僧得突吉羅。",
        "translation": "If the saṃgha doesn't order him to do so, the saṃgha will receive a surrogate.",
        "source": "T23n1435_018:0129b29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧約勅不受，是比丘得突吉羅。",
        "translation": "If the saṃgha gives assent to an order and doesn't accept it, that monk will obtain a surpassing legacy.",
        "source": "T23n1435_018:0129c01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十七事)佛在維耶離國，土地醎濕，諸比丘病癰瘡。",
        "translation": "(87 events) When the Buddha was in the country of Vaiśālī and the land was wet and soggy, the monks were sick with tumors and sores.",
        "source": "T23n1435_018:0129c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一比丘瘡中膿血流出，污安陀衛如水漬。",
        "translation": "One monk had pus and blood flowing from his sores, and it defiled Andhrava like a watery stain.",
        "source": "T23n1435_018:0129c03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛遙見，知而故問是比丘：「汝何以膿血污安陀衛？」",
        "translation": "The Buddha saw it from a distance, knew it, and therefore asked that monk, \"Why are you soiling the undergarment with pus and blood?\"",
        "source": "T23n1435_018:0129c04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘答言：「大德！",
        "translation": "The monks replied, \"Mañjuśrī!",
        "source": "T23n1435_018:0129c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我患癰瘡，膿血流出污安陀衛。」",
        "translation": "I'm suffering from a tumor, and pus and blood are spilling out and defiling Andhrava.\"",
        "source": "T23n1435_018:0129c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，種種因緣讚戒、讚持戒，讚戒、讚持戒已，語諸比丘：「從今聽畜覆瘡衣著，乃至瘡差後十日，若過是畜，波逸提。」",
        "translation": "After he praised the precepts and their observance, and after praising them, he said to the monks, \"From now on, I'll listen to the monks wearing robes to cover sores, even up to ten days after the sores are removed, and if I go beyond that, Boydee.\"",
        "source": "T23n1435_018:0129c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘知佛聽畜覆瘡衣，便廣長大作。",
        "translation": "The monks knew that the Buddha had heard about the sore-covering garment, so they grew it extensively and made it a great undertaking.",
        "source": "T23n1435_018:0129c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，種種因緣呵責：「云何名比丘，知佛聽畜覆瘡衣，便廣長大作？」",
        "translation": "One of those monks, who was practicing the ascetic with few desires and fulfillment, was displeased when he heard this, and he was rebuked for various reasons, \"What's the name of a monk who knows that when the Buddha hears the garment covering sores, it's made to grow widely and greatly?\"",
        "source": "T23n1435_018:0129c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，向佛廣說。",
        "translation": "After he had been told about these various causes and conditions, he explained them in detail to the Buddha.",
        "source": "T23n1435_018:0129c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，知而故問諸比丘：「汝實作是事不？」",
        "translation": "The Buddha gathered the monks and knew this and therefore asked the monks, \"Is this really what you do?\"",
        "source": "T23n1435_018:0129c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實作。",
        "translation": "He replied, \"It's really done.",
        "source": "T23n1435_018:0129c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_018:0129c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以種種因緣呵責：「云何名比丘，知我聽畜覆瘡衣，便廣長大作？」",
        "translation": "The Buddha rebuked them for various reasons, \"How does a monk know that I've heard about the sores-covering garments of animals and then I've grown them extensively?\"",
        "source": "T23n1435_018:0129c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，語諸比丘：「以十利故與諸比丘結戒。",
        "translation": "After he had been told about these various causes and conditions, he said to the monks, \"It's for the sake of the ten benefits that I've bound the monks to the precepts.",
        "source": "T23n1435_018:0129c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘欲作覆瘡衣，當應量作。",
        "translation": "From now on, this precept should be explained like this: 'If a monk wants to make a sore-covering robe, he should make it according to measure.",
        "source": "T23n1435_018:0129c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "量者，長佛四搩手、廣二搩手，過是作者，波逸提。」",
        "translation": "A monk who measures it is one who has four hand-span and two hand-span lengths, and this is the author of a monk who goes beyond that, pāyattika.\"",
        "source": "T23n1435_018:0129c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "A \"pāyattika\" is a boiling, burning, obstructing hindrance that, if not repented of, can obstruct the path.",
        "source": "T23n1435_018:0129c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘過量長作覆瘡衣，波逸提。",
        "translation": "Of these offenses, if a monk makes a sore-covering robe that's too long for the monk, it's a pāyattika.",
        "source": "T23n1435_018:0129c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過量廣作，波逸提。",
        "translation": "If he does it excessively and extensively, it's a pāyattika.",
        "source": "T23n1435_018:0129c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過量廣長作，波逸提。",
        "translation": "If he does it excessively and extensively, it's a pāyattika.",
        "source": "T23n1435_018:0129c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘過量廣長作覆瘡衣，是衣應截斷，入僧中作是言：「我過量廣長作覆瘡衣，得波逸提罪。",
        "translation": "If a monk makes a sore-covering robe that's too large and too long, he should cut it off and go into the saṃgha and say, \"I made a sore-covering robe that's too large and too long, and I'm guilty of pāyattika.",
        "source": "T23n1435_018:0129c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今發露悔過不覆藏。」",
        "translation": "Now, I'll reveal my repentance and not cover it up.\"",
        "source": "T23n1435_018:0129c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝截斷未？」",
        "translation": "The saṃgha then asks, \"Have you cut it off yet?\"",
        "source": "T23n1435_018:0129c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「已截。」",
        "translation": "If he says, \"I've cut it off,\" the monk should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0129c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝見罪不？」",
        "translation": "the saṃgha should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0129c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「見罪。」",
        "translation": "If he says, \"See the offense,\" the saṃgha should say.",
        "source": "T23n1435_018:0129c27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應語：「汝如法悔過，後莫復作。」",
        "translation": "the saṃgha should say, \"Repent according to the teaching, and don't do it again.\"",
        "source": "T23n1435_018:0129c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「未截。」",
        "translation": "If he says, \"I haven't yet cut it off,\"",
        "source": "T23n1435_018:0129c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，僧應約勅令截。",
        "translation": "then the saṃgha should order him to cut it off with an order.",
        "source": "T23n1435_018:0129c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不約勅，僧得突吉羅。",
        "translation": "If he doesn't order them to be cut, the saṃgha will receive a surrogate.",
        "source": "T23n1435_018:0129c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧約勅不受，是比丘得突吉羅罪。",
        "translation": "If the saṃgha agrees to reject my order, that monk will be guilty of a grave offense.",
        "source": "T23n1435_018:0129c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十八事)佛在維耶離國。",
        "translation": "(88 events) The Buddha was in the country of Vaiśālī.",
        "source": "T23n1435_018:0130a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸比丘精污臥具，早起浣精舍門間曬。",
        "translation": "At the time, the monks had soiled their bedding and got up early to dry it between the entrance and the monastery.",
        "source": "T23n1435_018:0130a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中前，佛著衣持鉢入城乞食，見是不淨污臥具浣曬門間。",
        "translation": "In the early afternoon, the Buddha put on his robe and took his bowl into the city to solicit alms and saw this impure and soiled bedding being washed and dried between the entrances.",
        "source": "T23n1435_018:0130a03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛食後以是事集比丘僧，語諸比丘：「我今日中前著衣持鉢入城乞食，見諸比丘精污臥具，早起浣精舍門間曬。」",
        "translation": "After he had eaten, the Buddha gathered the monks for this purpose and said to them, \"Today, before noon, I put on my robe and bowl and went into town to solicit alms and saw the monks' soiled bedclothes that they got up early to wash and dry them between the entrance to the monastery.\"",
        "source": "T23n1435_018:0130a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語諸比丘：「此不應爾，眾僧臥具多用不知量，諸居士血肉乾竭，用布施作福。",
        "translation": "He said to the monks, \"That's not true, because many monks don't know how much of their bedding is used, and the blood and flesh of the monks are dried up, so they use it for merit as an offering.",
        "source": "T23n1435_018:0130a07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中應籌量少用者善。",
        "translation": "It's better to use them sparingly.",
        "source": "T23n1435_018:0130a09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘亂念不一心眠時，有五過失。",
        "translation": "If a monk is distracted by mindfulness and doesn't sleep with one mind, there are five faults.",
        "source": "T23n1435_018:0130a09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_018:0130a10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者難睡苦，二者難覺苦，三者見惡夢，四者睡眠時善神不護，五者覺時心難入善覺觀法。",
        "translation": "One is the pain of difficult sleep, two is the pain of difficult awakening, three sees bad dreams, four isn't protected by a good spirit when he's asleep, and five makes it difficult for his mind to enter into the well-aware contemplation of things when he awakens.",
        "source": "T23n1435_018:0130a10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘不亂念一心睡眠，有五善事。",
        "translation": "If a monk doesn't mindfully concentrate on single-minded sleep, there are five good things about it.",
        "source": "T23n1435_018:0130a12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are the five?",
        "source": "T23n1435_018:0130a13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者無難睡，二者易覺，三者無惡夢，四者眠時善神所護，五者睡覺心易入善覺觀法。",
        "translation": "One, there's no difficulty sleeping, two, it's easy to awaken, three, there are no bad dreams, four, the mind is protected by a good spirit while sleeping, and five, the mind easily enters into a well-aware contemplation of the Dharma during sleep and awakening.",
        "source": "T23n1435_018:0130a13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘有婬怒癡，未得離欲，不亂念一心睡眠，尚不失精，何況離欲？」",
        "translation": "If a monk who's lustful, angry, and deluded has yet to attain freedom from desire and doesn't mindfully and single-mindedly sleep, he still won't lose his concentration, so how could he be free of desire?\"",
        "source": "T23n1435_018:0130a15_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，語諸比丘：「從今聽諸比丘畜尼師檀，護僧臥具故，不應不敷尼師檀僧臥具上坐臥。」",
        "translation": "After he had been rebuked for various reasons, he said to the monks, \"From now on, I'll listen to the monks who are storing nuns' donations and protecting the saṃgha's bedding, so they shouldn't refrain from laying out the nuns' donations and sitting or lying down on the saṃgha's bedding.\"",
        "source": "T23n1435_018:0130a17_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘知佛聽畜尼師檀，便廣長大作。",
        "translation": "The monks knew that the Buddha had heard that they were to store the nuns' donations, so they grew and made a great effort to do so.",
        "source": "T23n1435_018:0130a19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有比丘少欲知足行頭陀，聞是事心不喜，種種因緣呵責：「云何名比丘，知佛聽畜尼師檀，便廣長大作畜？」",
        "translation": "One of those monks, who was practicing the ascetic practice of having few desires and being satisfied, was displeased when he heard this, and he was rebuked for various reasons, \"Who is this monk who knows that when the Buddha hears that he's storing the nuns' donations, he makes a great and extensive effort to store them?\"",
        "source": "T23n1435_018:0130a20_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，向佛廣說。",
        "translation": "After he had been told about these various causes and conditions, he explained them in detail to the Buddha.",
        "source": "T23n1435_018:0130a23_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，知而故問諸比丘：「汝實作是事不？」",
        "translation": "The Buddha gathered the monks and knew this and therefore asked the monks, \"Is this really what you do?\"",
        "source": "T23n1435_018:0130a23_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實作。",
        "translation": "He replied, \"It's really done.",
        "source": "T23n1435_018:0130a24_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_018:0130a25_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以種種因緣呵責：「云何名比丘，知我聽畜尼師檀，便廣長大作畜？」",
        "translation": "The Buddha rebuked them for various reasons, \"How does a monk know that I've grown up to be a large animal after hearing that I'm storing nuns' food?\"",
        "source": "T23n1435_018:0130a25_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣呵已，語諸比丘：「以十利故與比丘結戒。",
        "translation": "After he had been told about various causes and conditions, he said to the monks, \"It's for the sake of the ten benefits that I've bound the monks to the precepts.",
        "source": "T23n1435_018:0130a26_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘作尼師檀當應量作。",
        "translation": "From now on, these precepts should be explained like this: 'If a monk makes a nun's altar, he should make it in measure.",
        "source": "T23n1435_018:0130a27_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "量者，長佛二搩手、廣一搩手半，過是作者，波逸提。」",
        "translation": "A measure that's two Ṛvarti's hands long and one and a half Ṛvarti's hands wide is excessive, Pāyatti.\"",
        "source": "T23n1435_018:0130a29_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "A \"pāyattika\" is a boiling, burning, and obstructing hindrance that, if not repented of, can obstruct the path.",
        "source": "T23n1435_018:0130b01_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘過量長作尼師檀，波逸提。",
        "translation": "Of these offenses, if a monk does it excessively and for a long time, that's a nun's sandal, pāyattika.",
        "source": "T23n1435_018:0130b02_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過量廣作，波逸提。",
        "translation": "If he does it excessively and extensively, it's a pāyattika.",
        "source": "T23n1435_018:0130b03_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過量廣長作，波逸提。",
        "translation": "If he does it excessively and extensively, it's a pāyattika.",
        "source": "T23n1435_018:0130b03_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘過量廣長作尼師檀已，應截斷，入僧中白言：「我過量廣長作尼師檀，得波逸提罪。",
        "translation": "If a monk makes a nun's donation that's too extensive and too many, he should cut it off and go into the saṃgha and say, \"I made a nun's donation that's too extensive and too many, and I've committed the misdeed of pāyattika.",
        "source": "T23n1435_018:0130b04_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今發露悔過不覆藏。」",
        "translation": "Now, I've revealed my repentance and haven't covered it up.\"",
        "source": "T23n1435_018:0130b06_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「已截斷未？」",
        "translation": "The saṃgha then asked, \"Have you cut it off yet?\"",
        "source": "T23n1435_018:0130b06_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「已截。」",
        "translation": "If he says, \"I've cut it off,\" the monk should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0130b07_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝見罪不？」",
        "translation": "the saṃgha should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0130b07_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「見罪。」",
        "translation": "If he says, \"See the offense,\"",
        "source": "T23n1435_018:0130b07_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應教言：「汝今如法悔過，後莫復作。」",
        "translation": "you should be instructed, \"Repent now according to the teaching, and don't do it again.\"",
        "source": "T23n1435_018:0130b08_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未割截，僧應約勅令割截。",
        "translation": "If he hasn't yet cut it off, the saṃgha should order him to do so by agreement.",
        "source": "T23n1435_018:0130b08_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不約勅，僧得突吉羅。",
        "translation": "If he doesn't order it to be cut, the saṃgha will receive a surpassing amount of punishment.",
        "source": "T23n1435_018:0130b09_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧約勅不受，是比丘得突吉羅。",
        "translation": "If the saṃgha agrees to command and doesn't accept it, that monk will attain the status of a duṣkṛṣṇa.",
        "source": "T23n1435_018:0130b10_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在舍衛國。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T23n1435_018:0130b10_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛中前著衣持鉢入舍衛城乞食，食已入安陀林中，一樹下敷尼師檀坐。",
        "translation": "At the time, the Buddha went into Śrāvastī with his robe and bowl to solicit alms, and after he had eaten, he went into the charnel ground and spread out his sitting mat under a tree.",
        "source": "T23n1435_018:0130b11_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老迦留陀夷亦入安陀林，去佛不遠在一樹下敷尼師檀坐。",
        "translation": "The elder Kālôdayin also went into the charnel ground and spread out his sitting mat under a tree not far from the Buddha.",
        "source": "T23n1435_018:0130b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是長老身長大，兩膝到地兩手捉衣，作是願言：「佛何時當聽我等作佛一搩手尼師檀，如是滿足？」",
        "translation": "That elder's body grew large, and he reached down on his knees, grabbed his robe with both hands, and made this vow, \"When will the Buddha hear us make a handful of sitting mat for the Buddha and thus fulfill it?\"",
        "source": "T23n1435_018:0130b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛晡時從禪起，以是事集比丘僧，語諸比丘：「我今日食時著衣持鉢入城乞食，食已入安陀林，一樹下敷尼師檀坐。",
        "translation": "In the afternoon, the Buddha got up from meditation and gathered the monks for this purpose. He said to the monks, \"Today, when I was eating, I put on my robe and took my bowl into the city to solicit alms, and after I ate, I went into the charnel ground and spread out my sitting mat under a tree.",
        "source": "T23n1435_018:0130b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦留陀夷乞食還，亦坐一樹下，作是思惟：『佛今何處行道？",
        "translation": "When Kālôdayin returned from begging for food, he also sat under a tree and thought, 'Where is the Buddha now walking on the path?'",
        "source": "T23n1435_018:0130b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦彼間行道。』",
        "translation": "I, too, have traveled there on the road.'",
        "source": "T23n1435_018:0130b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我時入安陀林，一樹下敷尼師檀坐，迦留陀夷亦爾。",
        "translation": "I went into the charnel ground and spread out my sitting mat under a tree, and so did Kālôdayin.",
        "source": "T23n1435_018:0130b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子身太、兩膝到地，作是願言：『佛何時當聽作佛一搩手尼師檀，如是滿足？』」",
        "translation": "That good man reached the ground with his knees up and made this vow, saying, 'When will the Buddha hear us do a handful of sitting nuns' sandalwood, and will it be fulfilled in this way?'\"",
        "source": "T23n1435_018:0130b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語諸比丘：「從今是戒應如是說：若比丘欲作尼師檀，當應量作。",
        "translation": "The Buddha said to the monks, \"From now on, this precept should be explained like this: 'If a monk wants to make a nun's donation, he should make it according to its measure.'",
        "source": "T23n1435_018:0130b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "量者，長佛二搩手、廣一搩手半，及縷際益一搩手。",
        "translation": "That measurement is two handfuls long, one and a half handfuls wide, and one handful at the end of the threads.",
        "source": "T23n1435_018:0130b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過是作者，波逸提。」",
        "translation": "Do more than that, pratyekabuddha.\"",
        "source": "T23n1435_018:0130b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(八十九事)佛在迦維羅衛國。",
        "translation": "(89 events) The Buddha was in Kapilavastu.",
        "source": "T23n1435_018:0130b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長老難陀，是佛弟，姨母所生，與佛身相似，有三十相，短佛四指。",
        "translation": "At the time, the elder Nandāna, a disciple of the Buddha born to his aunt, resembled the Buddha's body, had thirty marks, and was four fingers shorter than the Buddha.",
        "source": "T23n1435_018:0130b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時難陀作衣與佛同量，諸比丘若食時、會中後會，遙見難陀來，謂是佛，皆起迎：「我等大師來。",
        "translation": "When Nandha made his robe the same size as the Buddha's, the monks who saw Nandha coming from a distance during the meal, in the assembly, or after the assembly said it was the Buddha, and they all rose to greet him, \"We've come, Great Teacher.",
        "source": "T23n1435_018:0130c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊來。」",
        "translation": "The Bhagavān is here!\"",
        "source": "T23n1435_018:0130c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近乃知非。",
        "translation": "They then realized they weren't.",
        "source": "T23n1435_018:0130c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸上座皆羞，作是思惟：「此是我等下座，云何起迎？」",
        "translation": "The superior monks were all ashamed and thought, \"How could we, the junior monks, have risen to greet him?\"",
        "source": "T23n1435_018:0130c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀亦羞言：「乃令諸上座起迎我。」",
        "translation": "Nandika was also ashamed and said, \"Did he make the superior seats get up to greet me?\"",
        "source": "T23n1435_018:0130c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘以是事向佛廣說。",
        "translation": "The monks explained this to the Buddha in detail.",
        "source": "T23n1435_018:0130c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以是事集比丘僧，知而故問難陀：「汝實作是事不？」",
        "translation": "The Buddha gathered the monks and knew this and therefore asked Nandha, \"Is this really what you've done?\"",
        "source": "T23n1435_018:0130c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「實作。",
        "translation": "He replied, \"It's really done.",
        "source": "T23n1435_018:0130c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T23n1435_018:0130c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以種種因緣呵責：「云何名比丘，同佛衣量作衣？",
        "translation": "The Buddha rebuked them for various reasons, \"What is the name of a monk who makes clothes according to the Buddha's robe?",
        "source": "T23n1435_018:0130c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今汝衣應減作，是袈裟應以敷曬。",
        "translation": "From now on, your robes should be made smaller, and this robe should be used to dry them.",
        "source": "T23n1435_018:0130c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T23n1435_018:0130c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等以敷曬難陀衣，更有如是人，僧亦當同心以敷曬。」",
        "translation": "You will dry your robes as nandas, and the saṃgha will also dry such people with one mind.\"",
        "source": "T23n1435_018:0130c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語諸比丘：「以十利故與比丘結戒。",
        "translation": "He said to the monks, \"It's because of the ten benefits that I've established the precepts with the monks.",
        "source": "T23n1435_018:0130c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從今是戒應如是說：若比丘，與佛衣等量作衣及過作，得波逸提。",
        "translation": "From now on, this precept should be explained like this: If a monk makes a robe equal to the Buddha's robe and makes it in excess, he'll attain pratyekabuddha.",
        "source": "T23n1435_018:0130c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛衣量者，長佛九搩手、廣六搩手，是佛衣量。」",
        "translation": "The measure of the Buddha's robe is nine handfuls long and six handfuls wide, which is the measure of the Buddha's robe.\"",
        "source": "T23n1435_018:0130c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波逸提者，煮燒覆障，若不悔過，能障礙道。",
        "translation": "A \"pāyattika\" is a boiling, burning, and obstructing obstruction that, if not repented of, can impede the path.",
        "source": "T23n1435_018:0130c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中犯者，若比丘與佛衣同量作衣，波逸提。",
        "translation": "Among these offenders, if a monk makes a robe the same size as the Buddha's robe, that's a pāyattika.",
        "source": "T23n1435_018:0130c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過佛衣量作，波逸提。",
        "translation": "If he makes them in excess of the Buddha's robe, it's a pāyattika.",
        "source": "T23n1435_018:0130c16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨作，隨得爾所波逸提。",
        "translation": "If he makes them as he sees fit, he'll attain this kind of pāyattika.",
        "source": "T23n1435_018:0130c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若比丘與佛衣同量作衣，是衣應截斷，入僧中白言：「我如佛衣量作衣得波逸提罪。",
        "translation": "If a monk makes a robe in the same amount as the Buddha's robe, he should cut it off and go into the saṃgha and say, \"I made a robe in the same amount as the Buddha's robe, and I've committed a pāyattika.",
        "source": "T23n1435_018:0130c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今發露悔過不覆藏。」",
        "translation": "Now, I've revealed my repentance and won't cover it up.\"",
        "source": "T23n1435_018:0130c19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應問：「汝截斷未？」",
        "translation": "The saṃgha then asks, \"Have you cut it off yet?\"",
        "source": "T23n1435_018:0130c20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「已截。」",
        "translation": "If you say, \"I've cut it off,\"",
        "source": "T23n1435_018:0130c20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應問：「汝見罪不？」",
        "translation": "you should ask, \"Do you see the offense?\"",
        "source": "T23n1435_018:0130c20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「見罪。」",
        "translation": "If he says, \"See the offense,\" the saṃgha should say.",
        "source": "T23n1435_018:0130c21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應言：「汝今如法悔過，後莫復作。」",
        "translation": "the saṃgha should say, \"Now, repent according to the teaching, and don't do it again.\"",
        "source": "T23n1435_018:0130c21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言：「未截。」",
        "translation": "If he says, \"I haven't yet cut it off,\"",
        "source": "T23n1435_018:0130c22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧應約勅令截。",
        "translation": "the saṃgha should order him to do so.",
        "source": "T23n1435_018:0130c22_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧不約勅，僧得突吉羅。",
        "translation": "If the saṃgha doesn't order him to do so, the saṃgha will receive a surrogate.",
        "source": "T23n1435_018:0130c22_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若僧約勅不受，是比丘得突吉羅罪。",
        "translation": "If the saṃgha gives assent to an order and doesn't accept it, that monk will be guilty of a grave offense.",
        "source": "T23n1435_018:0130c23_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(九十事竟)十誦律卷第十八",
        "translation": "(After Ninety Cases) Ten Recitations [of the Vinaya], Vol. 18",
        "source": "T23n1435_018:0130c24_31",
        "is_bad_quality": false
    }
]