[
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事",
        "translation": "Mūlasarvâstivāda-vinaya-vijñāna-breaking-saṃgha",
        "source": "T24n1450_010:0147c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷第十",
        "translation": "Volume 10",
        "source": "T24n1450_010:0147c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏法師義淨奉　制譯",
        "translation": "Translated by the Tripiṭaka Master Yijing of the Great Tang",
        "source": "T24n1450_010:0147c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊既其為彼未生怨王廣說法要，令無根信得生起已，或時乘象出外旋遊，望見世尊在高樓上，遂於其象不覺投身崩墜于地。",
        "translation": "After the Bhagavān had explained the essentials of the Dharma to that unborn enemy king and caused faith to arise in the absence of religious faculties, he sometimes roamed around on an elephant and saw the Bhagavān on a high building, whereupon his elephant unconsciously plunged to the ground.",
        "source": "T24n1450_010:0147c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於一時乘象而出，見薄伽梵不覺投身，於世尊所深生敬信，遂便告彼執仗人曰：「爾等須知！",
        "translation": "Another time, he rode out on an elephant, saw the Bhagavān unconsciously plunging into it, and developed a deep respect and faith in the Bhagavān.",
        "source": "T24n1450_010:0147c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始從今日，我徹歸依薄伽伐多及室羅縛迦僧伽。",
        "translation": "From this day forward, I thoroughly rely on the Bhagavatn and Śrāvastī monks.",
        "source": "T24n1450_010:0147c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾等從今，若見世尊及聲聞眾、苾芻、苾芻尼、鄔波索迦、鄔波斯迦須進入，時於其門戶勿為遮障，啟門令進。",
        "translation": "From now on, if you see the Bhagavān or a group of śrāvakas, bhikṣus, bhikṣuṇīs, upāsaka, or upāsikāsaka who need to enter, don't obstruct their doors, and open them so that they can enter.",
        "source": "T24n1450_010:0147c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見提婆達多及彼徒眾，應須掩障勿使其前。」",
        "translation": "If you see Devadatta and his disciples, you must cover the door and prevent them from entering.\"",
        "source": "T24n1450_010:0147c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於異時，提婆達多有緣，須入未生怨宅。",
        "translation": "At some point later, Devadatta had a reason to enter the house of a resentment that hadn't yet arisen.",
        "source": "T24n1450_010:0147c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守門者而告之曰：「仁應可止，無宜前進。」",
        "translation": "The gatekeeper then told him, \"Sir, you may stop; it's not advisable to go forward.\"",
        "source": "T24n1450_010:0147c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天授問曰：「忽有何緣，遮不聽進？」",
        "translation": "The god imparted the question, \"What sudden reason is there to block or not allow him to enter?\"",
        "source": "T24n1450_010:0147c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門人告曰：「大王有教：『始從今日，我徹歸依薄伽伐多及室羅縛迦僧伽。",
        "translation": "The disciples told him, \"The great king has taught us, 'From this day forward, I've thoroughly taken refuge in the Bhagavatn and Śrāvastī monasteries.",
        "source": "T24n1450_010:0147c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾等從今，若見世尊及聲聞眾、苾芻、苾芻尼、鄔波索迦、鄔波斯迦須進入，時於其門戶勿為遮障，啟門令進。",
        "translation": "From now on, if you see the Bhagavān, the śrāvakas, the bhikṣus, the bhikṣuṇīs, the upāsaka, or the upāsikā, you must enter, so don't obstruct their doors, and open them so that they can enter.",
        "source": "T24n1450_010:0147c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見提婆達多及彼徒眾，應須掩障勿使其前。』」",
        "translation": "If you see Devadatta and his disciples, you must cover them from the obstruction and prevent them from entering.'\"",
        "source": "T24n1450_010:0147c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多既被遮止，情懷不樂住於門外。",
        "translation": "Now that Devadatta was being obstructed, he was unhappy and stayed outside the gate.",
        "source": "T24n1450_010:0147c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時嗢鉢羅色苾芻尼，從王宮中行乞食已持鉢而出。",
        "translation": "The Upāsaka monks and nuns then left the king's palace with their bowls after they had gone begging for food.",
        "source": "T24n1450_010:0147c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多見嗢鉢羅色，便生是念：「豈不由此禿頭之女為離間事，令未生怨及中宮內并大臣宅，便於我處致此稽留。」",
        "translation": "When Devadatta saw her, he thought, \"Couldn't this bald-headed woman have caused a feud that hadn't yet arisen, stayed at my place inside the palace and at the residence of the minister, for the sake of seclusion?\"",
        "source": "T24n1450_010:0147c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思已，告嗢鉢羅色曰：「我於爾處有何過失？",
        "translation": "After thinking this, he told Prasenajit, \"What's wrong with me being here?",
        "source": "T24n1450_010:0147c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由汝令吾乞食之宅皆生障礙。」",
        "translation": "You have caused an obstruction to arise in the house where I was begging for food.\"",
        "source": "T24n1450_010:0147c29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂便前進打搭其尼。",
        "translation": "He then went forward and struck the nun.",
        "source": "T24n1450_010:0148a01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時尼被打，出悲苦言哀告之曰：「願見清白。",
        "translation": "When he was hit, the nun spoke sadly and bitterly, telling him, \"I wish to see innocence.",
        "source": "T24n1450_010:0148a01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我有何因作如斯事？",
        "translation": "What did I do to deserve this?",
        "source": "T24n1450_010:0148a02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德！",
        "translation": "Great virtue!",
        "source": "T24n1450_010:0148a03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既是世尊兄弟，復是舍迦上種而為出家。",
        "translation": "Since I'm a brother of the Bhagavān, I'm also a renunciant of Śākya's lineage.",
        "source": "T24n1450_010:0148a03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我實無心，敢有談說，幸能見恕乞表忠誠。」",
        "translation": "I really don't have the heart to dare to talk about it, but I'm glad to see your forgiveness and beg you to show your loyalty.\"",
        "source": "T24n1450_010:0148a04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假聞斯苦不齒其言，遂努大拳打尼頭破。",
        "translation": "Suppose he heard this pain and didn't approve of his words, so he punched the nun in the head with a big fist.",
        "source": "T24n1450_010:0148a05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既其未摩被損，眾苦咸集，遂乃加持壽命起勇進心，疾行詣彼苾芻尼寺。",
        "translation": "Now that his unenlightened life had been compromised and his numerous sufferings had been collected, he summoned the courageous resolve to go quickly to that monastery.",
        "source": "T24n1450_010:0148a06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸尼眾見其大苦，咸問之曰：「禍哉阿離野迦！",
        "translation": "Seeing their great suffering, the nuns all asked, \"What a pity, āryāyaka!",
        "source": "T24n1450_010:0148a07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何意忽遭如斯困辱？」",
        "translation": "Why did you suddenly experience such a disgrace?\"",
        "source": "T24n1450_010:0148a08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便告眾曰：「仁等姊妹！",
        "translation": "He then addressed the crowd, \"Sisters of Compassion!",
        "source": "T24n1450_010:0148a09_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有壽命皆悉無常，一切諸法並無其我。",
        "translation": "All life spans are impermanent, and all dharmas lack their own self.",
        "source": "T24n1450_010:0148a09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂靜之處是曰涅槃。",
        "translation": "The place of quiescence is called nirvāṇa.",
        "source": "T24n1450_010:0148a10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁等咸應於善法處可勤勗念，勿為放逸。",
        "translation": "You should all diligently reflect on this place of good qualities and not become careless.",
        "source": "T24n1450_010:0148a11_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其提婆達多，已造第三無間之業，吾今時至可入涅槃。」",
        "translation": "That Devadatta, having created the third unremitting act, will now be ready to enter nirvāṇa.\"",
        "source": "T24n1450_010:0148a12_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時便對尼眾之前，現其種種奇異神變，入無餘依妙涅槃界。",
        "translation": "He then showed the nuns a variety of extraordinary miracles and entered the wonderful state of nirvāṇa without remainder.",
        "source": "T24n1450_010:0148a13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻咸起疑念，欲斷疑故請世尊曰：「大德！",
        "translation": "The monks then all had doubts, and wanting to resolve them, they asked the Bhagavān, \"Mañjuśrī!",
        "source": "T24n1450_010:0148a14_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗見提婆達多，於嗢鉢羅色苾芻尼處，假令悲苦告謝之時，不齒其言，拳打頭破因斯就滅。」",
        "translation": "Perhaps I saw Devadatta go to a monk or nun in Upāsaka and pretend to thank him for his suffering, but he didn't listen to his words, so he struck him with his fist and broke his head, which caused him to perish.\"",
        "source": "T24n1450_010:0148a15_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「非但今日作如斯事，於過去世亦為悲苦告謝之時，不聽哀言，遂便斷命而食其肉。",
        "translation": "The Bhagavān told him, \"Not only does he do such a thing today, but he also didn't listen to his words of pity when he gave thanks for his suffering in a past life, so he cut off his life and ate his flesh.",
        "source": "T24n1450_010:0148a17_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾今應聽！",
        "translation": "Now, listen!",
        "source": "T24n1450_010:0148a20_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如往昔時，於一村內有大長者，於此而居，多有羊群廣澤而牧。",
        "translation": "It was like in the past when there was a great elder who lived in a village and had a flock of sheep that grazed in a vast swamp.",
        "source": "T24n1450_010:0148a20_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既其日暮牧者驅還，群中有一老弱牸羊，不及徒伴在後獨進，忽於路側逢一餓豺，問豺曰：「『大舅多獨行，　　頗得安隱樂；　　常居林野內，　　如何得養神？』",
        "translation": "When the shepherd returned at sunset, there was an old, weak sheep among the herd that was not quite ready to go alone with his companions.",
        "source": "T24n1450_010:0148a21_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　「豺答之曰：　　『汝恒踐我尾，　　并常拔我毛；　　口出大舅言，　　欲覓逃身處。』",
        "translation": "\"The jackal answered him, 'You've always trampled on my tail and always plucked my hair; your mouth speaks great words, desiring to find a place to escape.'",
        "source": "T24n1450_010:0148a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　「羊復告曰：　　『爾尾屈背後，　　我在面前來；　　如何見抂余？",
        "translation": "\"The sheep then told him, 'After you bend your tail and turn your back, I'll come in front of you; how can I see the rest of you?'",
        "source": "T24n1450_010:0148a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　尋常蹋仁尾。』",
        "translation": "He always tramples on the tail of [Amitâbha] the human.'",
        "source": "T24n1450_010:0148b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　「豺復答曰：　　『四洲并海岳，　　咸皆是吾尾；　　如其不踐蹋，　　爾從何處來？』",
        "translation": "\"The jackal then answered, 'The four continents and the ocean and mountains are all my tail; if you don't trample it, where did you come from?'",
        "source": "T24n1450_010:0148b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　「羊復告曰：　　『我於親識處，　　聞說皆仁尾；　　在地不敢履，　　我從空處來！』",
        "translation": "\"The sheep again told him, 'Where I know people personally, I hear about kindness and tail; I dare not tread on the ground; I've come from an empty place!'",
        "source": "T24n1450_010:0148b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　「豺復答曰：　　『由爾牸羊空處墜，　　遂使林中野鹿驚；　　廢我今朝所食物，　　豈非下過理分明。』",
        "translation": "\"The jackal then answered, 'Did the sheep fall into the air and scare the deer in the forest? Wouldn't it be a clear mistake to scrap the food I'm eating today?'",
        "source": "T24n1450_010:0148b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時牸羊，雖陳哀告廣述苦言，然而罪惡業豺不肯相放，遂斷其首并飡於肉。」",
        "translation": "\"Although the sheep then expressed its sympathy and spoke out about its suffering, the jackal refused to release it from its evil activities, so it cut off its head and ate its flesh.\"",
        "source": "T24n1450_010:0148b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝諸苾芻勿生異念，昔時豺者，即是今日提婆達多。",
        "translation": "The Bhagavān told them, \"Don't get the wrong idea, you monks, that the jackal of yore was today's Devadatta.",
        "source": "T24n1450_010:0148b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔時牸羊者，即是今日青蓮花色苾芻尼。",
        "translation": "That sheep was once a cow, but now it's a blue lotus-colored monk.",
        "source": "T24n1450_010:0148b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往時雖述悲苦之言，不免身死。",
        "translation": "In the past, even though they spoke words of pity and suffering, they weren't spared physical death.",
        "source": "T24n1450_010:0148b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日雖作種種悲言，亦還被害。」",
        "translation": "Even though he spoke various words of pity today, he was still harmed.\"",
        "source": "T24n1450_010:0148b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多復生是念：「我於世尊屢為尤害，三無間業具已造之：以大拋石遙打世尊，於如來身惡心出血，此是第一無間之業。",
        "translation": "Devadatta then again had this thought, \"I've done three kinds of unremitting acts that have often caused harm to the Bhagavān: striking the Bhagavān with a large, hard-throwing stone and bleeding from malice in the Tathāgata's body is the first of these unremitting acts.",
        "source": "T24n1450_010:0148b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "和合僧伽而為破壞，此是第二無間之業。",
        "translation": "Harmonizing the saṃgha and destroying it is the second kind of unremitting action.",
        "source": "T24n1450_010:0148b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓮花色尼故斷其命，此是第三無間之業。",
        "translation": "To cut off his life because of the lotus' saffron nun is the third kind of unremitting action.",
        "source": "T24n1450_010:0148b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我未能獲一切智，所餘諸事亦未見成，准斯業道更無生處，決定當往捺落迦中。」",
        "translation": "Still, since I haven't attained omniscience and haven't seen the completion of the other tasks, there's no place of birth according to this course of activity, so I'm definitely headed for hell.\"",
        "source": "T24n1450_010:0148b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，以手支頰退在一邊愁思而坐。",
        "translation": "After he thought this, he withdrew to one side with his cheeks propped up in his hands and sat down in thought.",
        "source": "T24n1450_010:0148b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時晡刺拏有緣須過，遇到其邊而告之曰：「提婆達多！",
        "translation": "When Asaṅga had an opportunity to pass by, he met him and told him, \"Devadatta!",
        "source": "T24n1450_010:0148b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾今何意，以手支頰退在一邊愁思而住？」",
        "translation": "What do you think now, holding your cheeks in your hands and retreating to one side to think?\"",
        "source": "T24n1450_010:0148b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼便告曰：「如何我今得無愁思，因瞋惱故，於世尊邊屢為尤害，并已具造三無間業，久當住在大捺落迦受無隙苦。」",
        "translation": "He then told them, \"How could I have attained freedom from worry and thought now, but because of my anger and vexation, I've often been especially harmful to the Bhagavān and have created three kinds of unremitting activity that will cause me to live in the great hell of suffering for a long time to come?\"",
        "source": "T24n1450_010:0148b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晡刺拏曰：「我常謂諸舍迦種內，唯汝一箇解了聰明，豈謂汝今亦成愚憃？",
        "translation": "Asaṅga said, \"I've always said that you're the only one among the Śākya lineage who understands wisdom, so do you think you've become a fool now?",
        "source": "T24n1450_010:0148c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈有後世令汝見憂？",
        "translation": "How could there be a later age that would cause you to see sorrow?",
        "source": "T24n1450_010:0148c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有後世，汝造斯業者，我亦為斯愁思而住。」",
        "translation": "If there's a later life in which you do this kind of activity, I'll also stay here because of these thoughts of worry.\"",
        "source": "T24n1450_010:0148c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼為開解天授情故，便於對面撲破己瓶，而告曰：「縱天世間，不能令此更為和會，更無後世，誰往受之？",
        "translation": "In order to understand the feelings of the gods who had given him the teaching, he then broke his own vial on the other side and told them, \"Even if the gods and the world can't make this a more harmonious union, who will go to accept it in the absence of a later life?",
        "source": "T24n1450_010:0148c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作者、受者並成虛說。",
        "translation": "'The author and recipient are both nominal.",
        "source": "T24n1450_010:0148c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然而可往劫畢羅伐窣覩城，自稱天子為王而住，我當作汝第一聲聞。」",
        "translation": "However, you may go to the city of Pīrvāsthā and claim to be the son of a god who lives as king, and I will be your first śrāvaka.\"",
        "source": "T24n1450_010:0148c07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時提婆達多，便謗無聖，邪見遂興，能令一切善根斷絕。",
        "translation": "Devadatta then denigrated the noble, and a mistaken view arose that could cause all good roots to be cut off.",
        "source": "T24n1450_010:0148c08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告諸苾芻曰：「汝等應知，提婆達多所有善根從斯斷絕。",
        "translation": "It was then that the Bhagavān addressed the monks, \"You should know that this is how Devadatta's good roots were cut off.",
        "source": "T24n1450_010:0148c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_010:0148c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若見彼提婆達多有少白法，我不授記提婆達多：『汝提婆達多！",
        "translation": "If I see that Devadatta has a lesser white dharma, I don't give Devadatta the benefit of the doubt: 'You Devadatta!",
        "source": "T24n1450_010:0148c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生惡道者、生泥黎者，當住一劫不堪救療。』",
        "translation": "Those who are born in a bad path or born into nirvāṇa will live an eon beyond remedy.'",
        "source": "T24n1450_010:0148c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又汝苾芻！",
        "translation": "And you monks!",
        "source": "T24n1450_010:0148c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不見彼提婆達多有少白法如毛端許，我方授記提婆達多：『汝提婆達多！",
        "translation": "Not seeing that Devadatta had a little white dharma like the tip of a hair, we gave Devadatta this prediction: 'You Devadatta!",
        "source": "T24n1450_010:0148c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生惡道者、生泥黎者，當住一劫不堪救療。』",
        "translation": "Those who are born in a bad path or born in a hellish land will live an eon beyond remedy.'",
        "source": "T24n1450_010:0148c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如去村及去城邑，其路不遠有糞屎坑，深可丈餘，臭穢難近。",
        "translation": "It's like going to a village or town, and not far from there there's a pit of excrement that's more than ten feet deep and smells bad and hard to reach.",
        "source": "T24n1450_010:0148c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一人墮斯坑內，頭及手足並皆淪沒。",
        "translation": "A person then falls into this pit, and his head, hands, and feet all fall down.",
        "source": "T24n1450_010:0148c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後有一人每於長夜為慕義者、為樂利者、為與樂者、為與歡者、施安隱者，其人到彼糞屎坑邊，周匝觀望情存救濟：『我若見彼墮糞屎人有片身分無糞污者，我當方便引之令出。』",
        "translation": "Every long night, a person who looks out for the righteous, for those who enjoy gain, for those who are happy, for those who are cheerful, and for those who give peace goes to that dunghole and looks around to try to save him, saying, 'If I see a piece of that person who's fallen into that dunghole that has no dirt in its body, I'll skillfully guide him out.'",
        "source": "T24n1450_010:0148c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既遍觀察，不見其人有少身軀不被糞污，乃至手許可拔令出。",
        "translation": "After looking around, I don't see a little body of that person that isn't soiled by dung, or even a hand that allows him to pull it out.",
        "source": "T24n1450_010:0148c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_010:0148c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦如是，我若見彼提婆達多有少白法，我不授記提婆達多：『汝提婆達多！",
        "translation": "\"So, too, if I see that Devadatta has a little white dharma, I don't give Devadatta the benefit of the doubt: 'You Devadatta!",
        "source": "T24n1450_010:0148c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生惡道者、生泥黎者，當住一劫不堪救療。』",
        "translation": "Those who are born in a bad path or born into nirvāṇa will live an eon beyond remedy.'",
        "source": "T24n1450_010:0148c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又汝苾芻！",
        "translation": "And you monks!",
        "source": "T24n1450_010:0148c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不見彼提婆達多有小白法如毛端許，我方授記提婆達多：『汝提婆達多！",
        "translation": "Not seeing that Devadatta has a small white dharma like the tip of a hair, we gave Devadatta this prediction: 'You Devadatta!",
        "source": "T24n1450_010:0148c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生惡道者、生泥黎者，當住一劫不堪救療。』",
        "translation": "Those who are born in a bad path or born in nirvāṇa will live for an eon that's too long to heal.'",
        "source": "T24n1450_010:0149a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻應知：天授已具三法，生惡道者、生泥黎者，當住一劫不堪救療。",
        "translation": "You monks should know that the Divine Authority has fulfilled three requirements, and those born in a bad path or born in nirvāṇa will be unable to be rescued for an eon.",
        "source": "T24n1450_010:0149a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂三法？",
        "translation": "What are the three things?",
        "source": "T24n1450_010:0149a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_010:0149a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多先具生其罪惡樂欲，遂便遭彼惡欲所牽。",
        "translation": "Having first been endowed with the desire to commit crimes and bad pleasures, Devadatta is then led by those bad desires.",
        "source": "T24n1450_010:0149a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多既生惡欲被欲牽已，此謂是彼提婆達多最初成就罪惡之法。",
        "translation": "After he gives rise to bad desires and is pulled by those desires, this is called the first time that Devadatta accomplished a sinful and evil act.",
        "source": "T24n1450_010:0149a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多生惡道者、生泥黎者，當住一劫不堪救療。",
        "translation": "If Devadatta is born in a bad path or in a hell, he'll live an eon beyond remedy.",
        "source": "T24n1450_010:0149a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸苾芻！",
        "translation": "\"Furthermore, monks!",
        "source": "T24n1450_010:0149a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多近惡知識，得不善伴，共惡人交。",
        "translation": "\"Devadatta approaches a bad friend, obtains unwholesome companionship, and has sexual intercourse with a bad person.",
        "source": "T24n1450_010:0149a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多既近惡知識，得不善伴，共惡人交已，此謂是彼提婆達多第二成就罪惡之法。",
        "translation": "After he approaches a bad friend, obtains unwholesome companions, and has sexual intercourse with bad people, this is called the second way that Devadatta accomplishes bad qualities.",
        "source": "T24n1450_010:0149a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多生惡道者、生泥黎者，當住一劫不堪救療。",
        "translation": "If that Devadatta is born in a bad path or in a hellish state, he'll live an eon beyond remedy.",
        "source": "T24n1450_010:0149a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸苾芻！",
        "translation": "\"Furthermore, monks!",
        "source": "T24n1450_010:0149a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多得其少分，得其下品，證悟之時便生喜足，縱有勝上更不進修。",
        "translation": "Having attained a small portion and attained the lower level, Devadatta becomes satisfied when he realizes it, and he doesn't further his studies even though he has surpassed the higher level.",
        "source": "T24n1450_010:0149a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多既得少分，得其下品，證悟之時便生喜足，縱有勝上更不進修已，此即是彼提婆達多第三成就罪惡之法。",
        "translation": "Once he has attained a small portion and attained the lower level, Devadatta becomes satisfied when he realizes it, and even though he has surpassed the higher level, he doesn't further his studies.",
        "source": "T24n1450_010:0149a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多生惡道者、生泥黎者，當住一劫不堪救療。」",
        "translation": "Devadatta who's born in a bad path or born into nirvāṇa will live an eon beyond remedy.\"",
        "source": "T24n1450_010:0149a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊說伽他曰：「勿汝世間人，　　生於罪過欲；　由斯爾當識，　　惡欲所招殃。",
        "translation": "The Bhagavān then said to Gṛdhrakūṭa, \"Don't you worldly people give rise to sinful desires; because of this, you will realize that bad desires bring misfortune.",
        "source": "T24n1450_010:0149a19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世並知天授，　　聰明不伏心，　不能存少欲，　　空持美形狀，　彼便行驕逸，　　欲陵於世尊；　故我記斯人，　　一劫生無隙。",
        "translation": "A person who has knowledge of the teachings of gods, is too intelligent to control their thoughts, has few desires, and maintains beautiful forms in vain, then becomes proud and desires to torment the Bhagavān; therefore, I'll remember this person, who's born without a break in an eon.",
        "source": "T24n1450_010:0149a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　慳貪生惡念，　　耶見不虔恭；　定生無隙中，　　四門牢閉塞。",
        "translation": "Stinginess and greed give rise to bad thoughts, mistaken views and irreverence, and their certainty is born without a gap, and the four gates are firmly shut.",
        "source": "T24n1450_010:0149a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若他無過失，　　惡謗令生過；　今世若後世，　　自受愚癡人。",
        "translation": "If others have no faults, then bad words will cause faults to arise; whether in this world or the next, he'll suffer foolishness himself.",
        "source": "T24n1450_010:0149a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人於大海，　　毒瓶令水壞；　溟渤寬亡際，　　遣惡定無緣。",
        "translation": "If a person were at sea, a vial of poison would spoil the water; when the seas are vast and perish, the repulsion of evil is certainly unconditional.",
        "source": "T24n1450_010:0149b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯於世尊，　　惡人生謗讟；　常行自他利，　　罪謗豈能成？",
        "translation": "Thus, the Bhagavān, when a bad person is slandered, how can a sin or slander be accomplished when one always practices for the benefit of self and others?",
        "source": "T24n1450_010:0149b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正見心常靜，　　惡緣無處生；　應共為知識，　　親近者聰明；　由斯不造惡，　　恭敬可依行。",
        "translation": "With right view, the mind is always still, and there's no place for bad causes to arise; they should be shared with friends, and those who become close to them are intelligent; thus, they don't do evil and are respectful and can be relied upon to conduct themselves.",
        "source": "T24n1450_010:0149b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於是提婆達多謗毀聖說，決生耶見定斷善根，但有此生更無後世。」",
        "translation": "\"Thus, Devadatta denigrated the noble teaching, decided to give rise to a view that would definitely eliminate good roots, and there would be only this life and no afterlife.\"",
        "source": "T24n1450_010:0149b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是知已，於其徒眾別立五法，便告之曰：「爾等應知！",
        "translation": "Knowing this, he established five separate rules for his disciples and told them, \"You should know this!",
        "source": "T24n1450_010:0149b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門喬答摩及諸徒眾，咸食乳酪，我等從今更不應食。",
        "translation": "The ascetic Gautama and his disciples were eating milk and cheese, but from now on we shouldn't eat it anymore.",
        "source": "T24n1450_010:0149b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣由此？",
        "translation": "What is the reason for this?",
        "source": "T24n1450_010:0149b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令彼犢兒鎮嬰飢苦。",
        "translation": "That causes those calves to calm their infants' hunger and suffering.",
        "source": "T24n1450_010:0149b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門喬答摩聽食魚肉，我等從今更不應食。",
        "translation": "Also, the ascetic Gautama heard that he was eating fish, but from now on we shouldn't eat it anymore.",
        "source": "T24n1450_010:0149b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣由此？",
        "translation": "What is the reason for that?",
        "source": "T24n1450_010:0149b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸眾生為斷命事。",
        "translation": "\"It's a matter of cutting off life for all sentient beings.",
        "source": "T24n1450_010:0149b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門喬答摩聽食其鹽，我等從今更不應食。",
        "translation": "Also, after hearing that the ascetic Gautama had eaten his salt, we should no longer eat it from now on.",
        "source": "T24n1450_010:0149b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣由此？",
        "translation": "What is the reason for that?",
        "source": "T24n1450_010:0149b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其鹽內多塵土故。",
        "translation": "That's because there's so much dirt in that salt.",
        "source": "T24n1450_010:0149b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門喬答摩受用衣時截其縷績，我等從今受用衣時留長縷績。",
        "translation": "Also, when he accepted the robe, the ascetic Gautama cut off its threads, but now when we accept the robe, we leave long threads of it.",
        "source": "T24n1450_010:0149b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣由此？",
        "translation": "What is the reason for this?",
        "source": "T24n1450_010:0149b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壞彼織師作功勞故。",
        "translation": "That's because it destroys the weaver's ability to perform meritorious work.",
        "source": "T24n1450_010:0149b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又沙門喬答摩住阿蘭若處，我等從今住村舍內。",
        "translation": "Also, the ascetic Gautama lives in a forest, and we've been living in a village house since then.",
        "source": "T24n1450_010:0149b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何緣由此？",
        "translation": "What is the reason for this?",
        "source": "T24n1450_010:0149b19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棄捐施主所施物故。」",
        "translation": "It's because he discards the things that the donor gives.\"",
        "source": "T24n1450_010:0149b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故內攝頌曰：　不飡於乳酪、　　魚肉及以鹽，　長績在村中，　　是天授五法。",
        "translation": "Therefore, the internal collection verse says, \"Not eating cheese, fish, or meat and salt for a long time in a village is a gift from the gods about five things.",
        "source": "T24n1450_010:0149b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時溝伽畔遊歷人間，漸行次至室羅筏悉底國。",
        "translation": "He then traveled from Gogabean to the people and gradually reached the country of Śrāvastī.",
        "source": "T24n1450_010:0149b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多遂生是念：「我於沙門喬答摩屢興刑害，而竟不能傷損其命。",
        "translation": "Devadatta then had this thought, \"I've repeatedly tortured that ascetic Gautama, but I haven't been able to harm his life.",
        "source": "T24n1450_010:0149b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今宜可於其妻室而為陵辱。」",
        "translation": "Perhaps now I could humiliate his wife and family.\"",
        "source": "T24n1450_010:0149b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂便往詣劫比羅筏窣覩城，遣使報彼耶輸達羅曰：「沙門喬答摩已捨王業而作出家，我為是緣故來紹繼爾，宜與我為妻室乎。」",
        "translation": "He then went to Kapphiṇa's town of Tuṣita and sent a messenger to him, telling him, \"That ascetic Gautama has left the king's business and left home; for this reason, I've come to take over for him; why don't you take me as his wife and wife's wife?\"",
        "source": "T24n1450_010:0149b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼得信，遂便巡事告瞿彌迦，時瞿彌迦報耶輸達羅曰：「仁應遣使告天授云：『菩提薩埵我昔執手，彼力堪持。",
        "translation": "Believing this, Peter then went on a tour of duty and told Gomīra, who then reported to Yaśodharā, \"Sir, you should send a messenger to the gods to tell them, 'I used to hold Bodhisattva in my hand, and he has the strength to carry it.",
        "source": "T24n1450_010:0149b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若有能可來見就。』」",
        "translation": "If you are able, you may come and see him.'\"",
        "source": "T24n1450_010:0149c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時天授情無羞恥，不忖己骸力，進入中宮進陛昇階，欲就其處。",
        "translation": "Then the godparents, feeling no shame, didn't consider their own bodily strength, went into the central palace, ascended the steps, and desired to take their place.",
        "source": "T24n1450_010:0149c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時瞿彌迦顧諸宮女咍然而笑，天授不覺合掌而居。",
        "translation": "Gomika then looked at the palace maids and laughed, but the god donor didn't realize it and closed his palms and stayed there.",
        "source": "T24n1450_010:0149c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時瞿彌迦有大諾近那力，遂將左手握其天授，于時十指迸血驚流，遂於菩提薩埵昔遊戲池擲之池內，既墮池已出大叫聲。",
        "translation": "Gomika then had the strength of a great novice, so he grasped the god given him his left hand, and blood burst from his ten fingers and spilled out.",
        "source": "T24n1450_010:0149c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時舍迦競來奔就，遂詳議曰：「提婆達多不恃其力，輒入宮內欲事欺陵。」",
        "translation": "Śākyamuni then rushed to meet him and commented in detail, \"Devadatta doesn't rely on his strength to enter the palace and try to deceive him.\"",
        "source": "T24n1450_010:0149c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉復尋聲見在池內，遂相告曰：「斯內亂入，可斷其命。」",
        "translation": "Again, they looked for the sound and saw it inside the pond. They then told each other, \"If you enter here in disorder, your life could be cut off.\"",
        "source": "T24n1450_010:0149c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更議曰：「勿於死人更加其害，世尊記此提婆達多，生惡道者、墮泥黎者，無間一劫不堪救療。",
        "translation": "They further commented, \"Don't do more harm to a dead person; the Bhagavān remembers this Devadatta as someone who was born in a bad path or fell into nirvāṇa and who couldn't be saved in an instant or an eon.",
        "source": "T24n1450_010:0149c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即與死相似，更復何勞見害？」",
        "translation": "This is similar to death, so why bother to see the harm?\"",
        "source": "T24n1450_010:0149c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時人眾捨不與言。",
        "translation": "The crowd then turned away and didn't say anything.",
        "source": "T24n1450_010:0149c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多從池起已，於水竇中逃走而出，被其橛杙裂所著衣，白[疊*毛]一條遂成兩片，便作是念：「善哉！",
        "translation": "When Devadatta got up from the pond and escaped from the watery sinus, he was caught by a peg and tore the robe he was wearing, and one white [tuft of *hair] was formed into two pieces.",
        "source": "T24n1450_010:0149c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯服巧稱淨儀，為我聲聞制其裙服。」",
        "translation": "This robe is skillfully described as purely ceremonial, and it's made for us śrāvakas to wear.\"",
        "source": "T24n1450_010:0149c17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於一時告舍迦種：「汝等宜可策我為王。」",
        "translation": "At another point, he told the Śākya clan, \"It's appropriate for you to make me king.\"",
        "source": "T24n1450_010:0149c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人報曰：「菩提薩埵現有內宮，汝可秉權令其賓伏，既納妻室方可稱王。」",
        "translation": "They replied, \"Bodhisattva now has an inner palace, so you can hold power over it and make it subdue him, and only after accepting a wife and a wife can I be called king.\"",
        "source": "T24n1450_010:0149c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多，於舍迦處息其猜貳，除恐怖心，遂入宮中昇高樓上，到耶輸達羅所，合掌一邊而白之曰：「幸存恩澤曲見哀憐，汝為國大夫人，我乃稱王此邑。」",
        "translation": "Devadatta then stopped his suspicions and removed his fears at Śākya, went into the palace, rose up on a high tower, and went to Yāśodharā, put his palms together at one side, and said, \"After surviving this kindness and seeing your compassion, I will claim you as the country's first wife and then I will be king of this town.\"",
        "source": "T24n1450_010:0149c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時耶輸達羅有大鉢塞建拕力，從妙寶床起就天授，捉其合掌雙膝摧地，天授十指迸血流出，婉轉于地痛不自勝。",
        "translation": "Yāśodharā then had the power of a great pācāra, rose from his marvelously jeweled bed, approached the god given, and grabbed him with his palms together and crushed his knees to the ground.",
        "source": "T24n1450_010:0149c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時耶輸達羅而告之曰：「汝真無賴，愚憃之極，暫執其手已不堪任，況復求念以充交合。",
        "translation": "He was then told by Yaśodharā, \"You're really a scoundrel and a fool! You're already incapable of holding his hand for a moment, so why would you seek to bring mindfulness to bear on sexual intercourse?",
        "source": "T24n1450_010:0149c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪王主應作我夫，或最後生菩提薩埵，我充其室方始合儀，自外諸人全非偶配。」",
        "translation": "The wheel-turning king should become my husband, or perhaps he'll eventually give birth to Bodhisattva, and I'll fill his room before he's joined, for there are no other people outside of him who are not a match.\"",
        "source": "T24n1450_010:0149c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時天授懷恥出宮，舍迦諸人見其憂苦，而告之曰：「汝今先可往世尊處求其懺摩，若見恕容方稱天子。」",
        "translation": "When the god conferred shame on him and left the palace, the Śākya people saw his distress and told him, \"Now, why don't you go to the Bhagavān and ask him to confess his sins, and if you see his forgiveness, then you can call yourself a god.\"",
        "source": "T24n1450_010:0150a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多，以極嚴毒填十爪中，詣世尊邊作如是念：「若沙門喬答摩見恕我者，斯曰：『善哉！』",
        "translation": "Devadatta then filled his ten paws with the most grievous poison and went to the Bhagavān, thinking, \"If the ascetic Gautama sees that he forgives me, then he'll say, 'Good!'",
        "source": "T24n1450_010:0150a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必也不容。",
        "translation": "I'm sure they won't allow it.",
        "source": "T24n1450_010:0150a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當就禮，以其毒爪摑足令傷。」",
        "translation": "I will bow to him and slap his feet with his poisoned claws, causing them to hurt.\"",
        "source": "T24n1450_010:0150a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至佛邊頂禮雙足，請世尊曰：「幸願哀憐見容恕我。」",
        "translation": "He then bowed his head to the Buddha's feet and asked the Bhagavān, \"Please have mercy on me and forgive me.\"",
        "source": "T24n1450_010:0150a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊觀其天授作何種心來向我所？",
        "translation": "The Bhagavān then observed what kind of thoughts did those celestials have when they came to us?",
        "source": "T24n1450_010:0150a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鑒知天授為殺害情，遂以神力變雙膝下成水精石，默然而住。",
        "translation": "Knowing that the gods had authorized him to kill and injure people, he transformed his knees into a rock of water essence with his supernormal powers and stayed silent.",
        "source": "T24n1450_010:0150a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多見默無語，遂起瞋心興其害意，便以毒爪爬摑世尊。",
        "translation": "When Devadatta saw the silence, he became angry and had harmful intentions, so he slapped the Bhagavān with his poisoned claws.",
        "source": "T24n1450_010:0150a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時十指並皆摧破，返中其毒生大苦惱。",
        "translation": "He then smashed all ten fingers together and was struck by the poison that caused great suffering.",
        "source": "T24n1450_010:0150a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時尊者阿難陀而告之曰：「天授！",
        "translation": "Venerable Ānanda then addressed him, saying, \"Godspeed!",
        "source": "T24n1450_010:0150a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾可歸依世尊。」",
        "translation": "Then you can take refuge in the Bhagavān.\"",
        "source": "T24n1450_010:0150a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報阿難陀曰：「大德！",
        "translation": "In response, Ānanda said, \"Mañjuśrī!",
        "source": "T24n1450_010:0150a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今若其歸依佛者，如佛言曰：『若歸依佛陀不生於惡道，捨棄人身已當生勝天上。』",
        "translation": "'Now, if I were to turn to the Buddha, as he said, 'If I turn to the Buddha and don't get born in a bad path, then I'll be born in a superior heaven after abandoning my body.'",
        "source": "T24n1450_010:0150a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然而世尊記我，當生惡道泥黎耶中無間一劫不堪救療。",
        "translation": "Yet the Bhagavān remembers that I'll be born in a bad destiny like Niraya, which lasts an eternity and is beyond remedy.",
        "source": "T24n1450_010:0150a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若生天，彼成虛語；若墮惡趣，還是妄言。」",
        "translation": "If I'm born in heaven, they'll be false words; if I fall into a bad destiny, I'll still be lying.\"",
        "source": "T24n1450_010:0150a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正生如是極瞋怒時，惡業既圓更無所待，無間之火遍燎其身，遂便叫喚高聲告曰：「大德阿難陀！",
        "translation": "When such extreme anger arises, there's nothing left to do after the completion of bad karma, and the fires of unremitting hell engulf his body.",
        "source": "T24n1450_010:0150a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我現被燒！",
        "translation": "I'll be burnt now!",
        "source": "T24n1450_010:0150a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今被炙！」",
        "translation": "I am now scorched!\"",
        "source": "T24n1450_010:0150a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿瑜窣滿阿難陀，既見其苦極軫慈悲，又於親族更加愛念，而告之曰：「提婆達多！",
        "translation": "Having seen his suffering, Aśvajit Ananta showed him extreme compassion and increased his affection for his family, and told him, \"Devadatta!",
        "source": "T24n1450_010:0150a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今宜可極想歸誠怛他揭多阿羅漢三藐三佛陀，勿為餘念。」",
        "translation": "Now, you may wish to give your utmost attention to the Tathāgata Arhat Samyak-saṃbuddha and not think of anything else.\"",
        "source": "T24n1450_010:0150a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其時天授被無隙火燎炙其身，業報現前受嚴極苦，深心慇重口自唱言：「今日我身乃至徹骨，於薄伽畔至心歸伏。」",
        "translation": "Having had his body scorched by a gapless fire, the god given to him experienced severe suffering as the result of his actions, and he spoke with a deep, respectful heart, saying, \"Today, I have been completely subjugated, even down to my bones, here on the shores of the Bhagavān.\"",
        "source": "T24n1450_010:0150a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說斯語已，現身墜墮無間無隙[木*奈]落迦中。",
        "translation": "After saying these words, he fell into a body that had no space or gap [mu*na]lakṣa.",
        "source": "T24n1450_010:0150a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊告諸苾芻：「汝等應知：提婆達多善根已續，於一大劫生於無隙大地獄中，其罪畢已後得人身，展轉修習，終得證悟鉢剌底迦佛陀，名為具骨。",
        "translation": "The Bhagavān then addressed the monks, \"You should know that Devadatta, who had continued his good roots and had been born in a great gapless hell for a great eon, had been reborn in a human body after his crimes were completed, had continued his training, and had eventually realized the Pratibhāna Buddha, who is called Prabhūtaratna.",
        "source": "T24n1450_010:0150a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當爾之時，既獲證已持鉢巡家，既獲所飡還歸本處，置鉢一面，洗手濯足方欲就飡，遂乃攝心觀其宿世：我緣何事久在生津，迷惑輪迴今身覺悟？",
        "translation": "After realizing this, he then took his bowl home, returned to his original place after obtaining food, placed his bowl to one side, washed his hands and feet, and was about to eat, then he collected his mind and looked at his past lives: \"What were the causes for my long stay in the river of birth that led to my delusion, transmigration, and now physical awakening?",
        "source": "T24n1450_010:0150b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂便觀見於世尊邊造其種種惡逆之事，復見往昔世尊本行菩薩時世世生生常為怨隙，但由少許恭敬利養而至於此。",
        "translation": "He then observed the various ways in which he had committed various heinous acts on the Bhagavān's side, and he also saw that in the past, when the Bhagavān was a bodhisattva, his generations were always at odds with him, but he had come to this point because of a little respect and benefit.",
        "source": "T24n1450_010:0150b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既了斯事，其所獲飡一不曾食，遂昇空裏放大光明現諸神變已，於無餘依妙涅槃界而證圓寂。」",
        "translation": "After realizing this, he received food that was never eaten, ascended into the sky, magnified his light, and showed miraculous powers before realizing perfect extinction in the element of wonderful nirvāṇa without remainder.\"",
        "source": "T24n1450_010:0150b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿瑜窣滿舍利弗呾囉、毛嗢揭羅演那，每於時時往[木*奈]落迦，而為看行。",
        "translation": "Jayasuman Śāriputra and Maudgalyāyana went to [Mok*naraka] at regular intervals to examine their practices.",
        "source": "T24n1450_010:0150b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗呾囉告毛嗢揭羅演那曰：「仁可共我往無隙獄觀其天授為慰問耶？」",
        "translation": "Śāriputra then told Māganeyānā, \"Would you go with me to the gapless hell to see the gods granting consolation?\"",
        "source": "T24n1450_010:0150b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時舍利弗呾囉與毛嗢揭羅演那，往阿毘止既至其所。",
        "translation": "Śāriputrâbhisa and Maudgalyāyana then went to Abhisa and arrived there.",
        "source": "T24n1450_010:0150b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗嗢囉命毛嗢揭羅演那曰：「仁今知不？",
        "translation": "Śāriputra then asked Maudgalyāyana, \"Do you know this, sir?",
        "source": "T24n1450_010:0150b15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即是其阿毘止處，上下四邊無不通徹，一焰猛火中無間隙。",
        "translation": "This is his abhisa, which has no unobstructed up or down, no penetration on the four sides, and no gap in a single fiery blaze.",
        "source": "T24n1450_010:0150b16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁於大神大德眾內，世尊記說以為第一，應可運心觀無隙獄，受苦情類為滅火災。」",
        "translation": "Among the great spirits and great virtues, the Bhagavān has described it as the best, so you should apply your mind to observing the gapless hells and extinguishing the scourge of fire for the suffering sentient beings.\"",
        "source": "T24n1450_010:0150b17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語已，時毛嗢揭羅演那便入如是大水之定。",
        "translation": "After speaking these words, Maudgalyāyana then entered into this kind of great watery concentration.",
        "source": "T24n1450_010:0150b19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既定心已從上注雨，渧如杵大入阿毘止，其水於空悉皆消散。",
        "translation": "After establishing his mind, he pours rain from above, and a drop as large as a pounder enters Abhijit, dissipating all the water in the sky.",
        "source": "T24n1450_010:0150b20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復注大雨，滴若犁轅、或如車軸，然其雨水亦皆消散。",
        "translation": "It also pours down a huge rain that drips like a plow pole or a chariot shaft, but the rainwater also dissipates.",
        "source": "T24n1450_010:0150b22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗嗢囉見斯事已，遂便斂念入勝解行定。",
        "translation": "Seeing this, Śāriputra then took a moment to recuperate and enter the concentration of resolute practice.",
        "source": "T24n1450_010:0150b23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既入定已，其水滂沛遍滿獄中，受苦聲除服其本念。",
        "translation": "After he had entered that concentration, the water poured out everywhere in the hells, and the sounds of suffering subdued his original mindfulness.",
        "source": "T24n1450_010:0150b24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿瑜窣滿、毛嗢揭羅演那發言命曰：「若是提婆達多可應前進。」",
        "translation": "Ayusuman and Maudgalyāyana then spoke, commanding, \"Suppose Devadatta should advance.\"",
        "source": "T24n1450_010:0150b25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞斯命已，有多千數提婆達多競來奔就。",
        "translation": "After hearing this order, many thousands of Devadatta rushed forward.",
        "source": "T24n1450_010:0150b27_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿瑜窣滿、摩訶毛嗢揭羅演那報斯眾曰：「若是世尊之親兄弟提婆達多者，宜應住此。」",
        "translation": "Ayuthusuman and Mahāmaudgalyāyana then answered the crowd, \"Suppose he's Devadatta, a blood brother of the Bhagavān, and it's appropriate for him to stay here.\"",
        "source": "T24n1450_010:0150b28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多，遂便進就阿瑜窣滿舍利弗呾囉、摩訶毛嗢揭羅演那。",
        "translation": "Devadatta then went in and met Āyosuman, Śāriputrī, and Mahāmaudgalyāyana.",
        "source": "T24n1450_010:0150c01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至其所，頂禮二尊之雙足已，二尊問曰：「天授！",
        "translation": "When he arrived, he bowed his head at their feet and was greeted by the two honored ones, who asked, \"Priestess!",
        "source": "T24n1450_010:0150c02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今所受大地獄苦，有差別不？」",
        "translation": "Is there a difference between the suffering of the great hell you're experiencing now?\"",
        "source": "T24n1450_010:0150c03_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天授答曰：「且如阿毘止內共受之苦，此不須言。",
        "translation": "The Divine Authority replied, \"This is like the shared suffering within Abhijit, which doesn't need to be explained.",
        "source": "T24n1450_010:0150c04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然於我躬所受別苦，幸存聽察。",
        "translation": "However, I have survived and listened to the different kinds of suffering I personally experience.",
        "source": "T24n1450_010:0150c05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有鐵山火熱遍起，洪焰通為一火，來至我所磨碎我身，譬如石上磨油麻子。",
        "translation": "An iron mountain fire rises up everywhere, and its conflagration becomes a single fire that comes to me and pulverizes my body like grinding oil and sesame seeds on a stone.",
        "source": "T24n1450_010:0150c06_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有極利雙齒鐵鋸，猛焰大熱解割我身，一一肢骸片片零落。",
        "translation": "Then there's a sharp, two-toothed iron saw with a fierce flame and great heat that cuts my body, scattering each limb piece by piece.",
        "source": "T24n1450_010:0150c08_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有鐵棒遍皆熱焰，數數來至打碎我頭。",
        "translation": "There's also an iron bar that's filled with hot flames that comes repeatedly to smash my head.",
        "source": "T24n1450_010:0150c09_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有大象從四方來，踐蹋我身，碎如米粉。」",
        "translation": "Then, a huge elephant came from the four directions, trampled my body, and broke it like rice dust.\"",
        "source": "T24n1450_010:0150c10_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿瑜窣滿舍利弗呾囉、毛嗢揭羅演那同告之曰：「汝提婆達多！",
        "translation": "Ayusuman, Śāriputra, and Maudgalyāyana then both told him, \"You Devadatta!",
        "source": "T24n1450_010:0150c11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所云：『時有鐵山大熱極熱，遍起洪焰通為一火，來至我所磨碎我身，譬如石上磨油麻子。』",
        "translation": "As you said, 'At the time, there was an iron mountain that was so hot that it produced a torrent of flame that became a single fire, and it came to me and pulverized my body like grinding oil and sesame seeds on a stone.'",
        "source": "T24n1450_010:0150c12_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，斯則由汝於其鷲峯山以大拋石打損如來，由波惡業招斯苦果。",
        "translation": "Then you injured the Tathāgata on Vulture Peak with a huge, flaming stone, and this was the result of your bad actions that brought about this painful result.",
        "source": "T24n1450_010:0150c15_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復汝云：『又有鐵棒遍皆熱焰，數數來至打碎我頭。』",
        "translation": "Again, you said, 'There's an iron rod that's filled with hot flames that comes repeatedly to smash my head.'",
        "source": "T24n1450_010:0150c16_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，斯則由汝於阿羅漢嗢鉢羅色尼拳打其頭遂致終卒，由彼惡業招斯苦果。",
        "translation": "Then you beat him on the head with an arhat's fist and he died, and that bad action brought about this painful result.",
        "source": "T24n1450_010:0150c17_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復汝云：『復有大象從四方來踐蹋我身碎如米粉。』",
        "translation": "Again, you said, 'Again, a huge elephant comes from the four directions and tramples on my body, smashing it like rice flour.'",
        "source": "T24n1450_010:0150c19_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，斯則由汝起大害意放護財象欲蹋世尊。",
        "translation": "This is because you had the harmful intention of setting free a wealthy elephant to trample the Bhagavān.",
        "source": "T24n1450_010:0150c20_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼惡業招斯苦果。」",
        "translation": "That bad action brings about this painful result.\"",
        "source": "T24n1450_010:0150c21_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二尊命曰：「提婆達多！",
        "translation": "The two honored ones ordered them, \"Devadatta!",
        "source": "T24n1450_010:0150c22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今雖受如斯極苦。",
        "translation": "Now, even though you've suffered such extreme pain, the Bhagavān remembers you, 'After suffering this sin, you'll finally realize that Pratibhāna Buddha is known as having bones.'",
        "source": "T24n1450_010:0150c22_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊記汝：『受斯罪竟，終得證悟鉢剌底迦佛陀，名為具骨。』」",
        "translation": "The Bhagavān remembers you, 'After suffering this kind of punishment, you'll finally realize the buddha known as pratyekabuddha, who has bones.'\"",
        "source": "T24n1450_010:0150c23_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多聞斯語已，白二尊曰：「若如是者，我今情勇，能於無隙大地獄中，一脇而臥甘受其苦。」",
        "translation": "After hearing those words, Devadatta said to the two honored ones, \"If that's the case, then I would be brave enough to go to the gapless great hell, lie down on one arm, and willingly undergo its suffering.\"",
        "source": "T24n1450_010:0150c24_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已忽然不現。",
        "translation": "After he said that, he suddenly disappeared.",
        "source": "T24n1450_010:0150c26_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿瑜窣滿舍利弗呾囉、毛嗢揭羅演那，次復詣彼外道六師受苦之處，遂便見彼高迦離迦，於其舌上有一百犁周遍耕墾。",
        "translation": "Ayusuman Śāriputra and Maudgalyāyana then went back to the place where the six heretics were suffering, and they saw that Kauṇḍinya, with a hundred plows plowing all over his tongue.",
        "source": "T24n1450_010:0150c27_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時索訶界主梵天王亦隨二尊而往，觀見高迦離迦，而告之曰：「汝高迦離迦，汝可於此二大尊者苾芻之處起極敬心。",
        "translation": "At the time, Brahma King, the lord of the sohā realm, also went with those two honored ones, observed Kauṇḍinya, and told him, \"Kauṇḍinya, you may pay great respect to these two great honored ones at their regal abodes.",
        "source": "T24n1450_010:0150c29_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此二師堅守淨行智慧神通眾中第一。」",
        "translation": "Still, these two masters are the best of all in terms of their steadfast purification, wisdom, and superknowledge.\"",
        "source": "T24n1450_010:0151a03_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時高迦離迦見彼二尊便告之曰：「此二罪惡耶欲之人，何來至此？」",
        "translation": "Seeing those two honored ones, Kaukālaika then told them, \"Why have these two men of sin and desire come here?\"",
        "source": "T24n1450_010:0151a04_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作此惡言纔發聲已，於其舌上遂有千犁而遍耕墾。",
        "translation": "After he utters this bad word, a thousand plows are plowed all over his tongue.",
        "source": "T24n1450_010:0151a06_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿瑜窣滿舍利弗呾羅、毛嗢揭羅演那作是念曰：「此之有情業重難救，無可奈何。」",
        "translation": "Ayosuman Śāriputra and Maudgalyāyana then had this thought, \"This sentient being's actions are too heavy to save, and there's nothing I can do about it.\"",
        "source": "T24n1450_010:0151a07_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨之而去。",
        "translation": "They abandoned them and departed.",
        "source": "T24n1450_010:0151a09_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次便往詣晡剌拏迦攝波處。",
        "translation": "Next, they went to Asra Rānakaśepa.",
        "source": "T24n1450_010:0151a09_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至彼已，時晡剌拏迦攝波，遂便就禮二尊雙足，而白之曰：「願二大德！",
        "translation": "Once he arrived there, Asrāṇakasipa then bowed his head at the feet of the two honored ones and said, \"May it please you, two great masters!",
        "source": "T24n1450_010:0151a10_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "察我罪人，我由昔時說其耶法，矯誑時俗遮其正信，緣斯罪業有五百犁時時耕舌。",
        "translation": "'My fellow sinners, since I taught them the true teaching in the past and deceived the common people of the time into refraining from correct faith, this sinful action has caused me to plow my tongue with five hundred plows from time to time.",
        "source": "T24n1450_010:0151a11_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復我諸聽聞弟子，於我所重餘骨窣覩波邊呈供養時，便有大苦重來逼迫，幸能見報我所受殃。」",
        "translation": "Furthermore, when my disciples who hear and listen to me present offerings to the rest of my bones at the edge of the stūpa, they will be sorely pressed and fortunate enough to see the results of the misfortune I've suffered.\"",
        "source": "T24n1450_010:0151a13_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "并復告知：「更勿於其窣覩波處而興供養。」",
        "translation": "They also told him, \"Don't make offerings at that place of stūpa.\"",
        "source": "T24n1450_010:0151a15_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時二尊既然其語，遊獄事了，俱便返詣贍部洲中。",
        "translation": "After they spoke, the two honored ones returned to Jambudvīpa after their excursions into hell were over.",
        "source": "T24n1450_010:0151a16_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時二尊對薄伽畔并諸大眾，具為說彼提婆達多及高迦離迦并晡剌拏捺落迦中所受苦事。",
        "translation": "The two honored ones then spoke to the Bhagavān and the general public about the suffering of Devadatta, Kauṇḍinya, and Asraṇṇa and Nādika.",
        "source": "T24n1450_010:0151a17_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既廣陳已，時諸苾芻咸共疑念，遂便請問斷疑世尊曰：「大德世尊！",
        "translation": "After they had explained them in detail, the monks shared their doubts and then asked the Bhagavān to end them, \"Bhagavān, O great virtuous one!",
        "source": "T24n1450_010:0151a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故提婆達多，尊所告言不肯見用，墮阿毘止受大極苦，以至斯耶？」",
        "translation": "Why did Devadatta, whom the venerable told us would refuse to see the usefulness of it, fall into abhidharma and experience great suffering, even up to this point?\"",
        "source": "T24n1450_010:0151a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝諸苾芻！",
        "translation": "The Bhagavān addressed them, \"You monks!",
        "source": "T24n1450_010:0151a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但今日不用我言受斯刑酷，曾於往世不受我言遭其苦惱。",
        "translation": "Not only do they not use my words today to suffer this kind of punishment, but in past lives they didn't accept my words and suffered their torment.",
        "source": "T24n1450_010:0151a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應聽！",
        "translation": "All of you should listen!",
        "source": "T24n1450_010:0151a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我曾於昔在不定聚行菩提薩埵行時，中在牛趣為大特牛。",
        "translation": "Once, when I was practicing bodhisattva practices in an indeterminate group, I was in the midst of a cow that was a great special cow.",
        "source": "T24n1450_010:0151a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每於夜中遂便於彼王家豆地隨意飡食，既其旭上，還入城中自在眠臥。",
        "translation": "Every night, he would eat as he liked in the bean field of that king's household, and when he rose, he went back into the city to sleep at ease.",
        "source": "T24n1450_010:0151a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一驢來就牛所，而作斯說：『大舅！",
        "translation": "Then, a donkey came to the cow and said, 'Great Uncle!",
        "source": "T24n1450_010:0151a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故皮膚血肉悉並肥充？",
        "translation": "Why is the skin so full of flesh and blood?",
        "source": "T24n1450_010:0151a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我曾不覩暫出遊放。』",
        "translation": "I didn't see him leave the country for a while.'",
        "source": "T24n1450_010:0151a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牛告之曰：『外甥！",
        "translation": "The ox told him, 'Nephew!",
        "source": "T24n1450_010:0151b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我每於夜出飡王豆，朝曦未啟返跡故居。』",
        "translation": "Every night, I go out to eat the king's beans, but I return to my old house before the sun rises.'",
        "source": "T24n1450_010:0151b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "驢便告曰：『我當隨舅同往食耶？』",
        "translation": "The donkey then told him, 'Shall I go with my uncle to eat?'",
        "source": "T24n1450_010:0151b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牛遂告曰：『外甥！",
        "translation": "The ox then told him, 'Nephew!",
        "source": "T24n1450_010:0151b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝口多鳴聲便遠及，勿因斯響反受纓拘。』",
        "translation": "If you make a lot of noise, then go far away; don't be constrained by this noise.'",
        "source": "T24n1450_010:0151b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "驢便答曰：『大舅！",
        "translation": "The donkey then answered, 'Great-uncle!",
        "source": "T24n1450_010:0151b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若逐去終不出聲。』",
        "translation": "If I banish, I'll never make a sound.'",
        "source": "T24n1450_010:0151b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂乃相隨至其田處，破籬同入食彼王苗。",
        "translation": "They then followed each other to his field and broke through the fence to feed on the king's seedlings.",
        "source": "T24n1450_010:0151b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其驢未飽寂爾無聲，既其腹充即便告曰：『阿舅！",
        "translation": "Before he had eaten, the donkey was silent, but when his belly was full, he said, 'Auntie!",
        "source": "T24n1450_010:0151b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我且唱歌。』",
        "translation": "I will then sing.'",
        "source": "T24n1450_010:0151b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "特牛報曰：『片時忍響，待我出已，後任外甥作其歌唱。』",
        "translation": "The special ox replied, 'Hold your horn for a moment, and then let your nephew sing after I leave.'",
        "source": "T24n1450_010:0151b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作斯語已急走出園，其驢於後遂便鳴喚。",
        "translation": "After he said this, he hurried out of the garden, and his donkey then called out.",
        "source": "T24n1450_010:0151b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時王家守田之輩，即便收掩驅告眾人：『王家豆田並此驢食，宜須苦辱方可棄之。』",
        "translation": "The man guarding the king's farm then even gathered up the donkey and told the people, 'The donkey is feeding on the king's bean field, so you should humiliate it before you abandon it.'",
        "source": "T24n1450_010:0151b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守田人截驢雙耳，并以木臼懸在其咽，痛杖鞭骸趁之而出。",
        "translation": "The man guarding the fields then cut off the donkey's ears, hung a wooden mortar over its throat, and whipped it with a painful stick to get it out.",
        "source": "T24n1450_010:0151b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其驢被辱展轉遊行，特牛既見遂於驢所，說伽他曰：「『善歌大好歌，　　由歌果獲此；　　見汝能歌唱，　　截却於雙耳。",
        "translation": "The donkey was insulted and marched around, and when he saw him, Tejau went to the donkey and said to him, 'That's a great song, a good song, and the result of that song is this; seeing that you can sing, I cut off both your ears.",
        "source": "T24n1450_010:0151b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若不能防口，　　不用善友言；　　非但截却耳，　　舂臼項邊懸。』",
        "translation": "If you can't guard your mouth, you won't use the words of a good friend; not only will your ears be cut off, but your neck will be hung by a pounding mortar.'",
        "source": "T24n1450_010:0151b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「驢復伽他而答之曰：「『缺齒應小語，　　老特勿多言；　　汝但行夜食，　　不久被繩纏。』」",
        "translation": "\"The donkey replied to him, 'You should speak softly when you lack teeth, and don't talk much to old people; just go on a nighttime diet, and soon you'll be tied up by a rope.'",
        "source": "T24n1450_010:0151b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝諸苾芻！",
        "translation": "The Bhagavān told them, \"You monks!",
        "source": "T24n1450_010:0151b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿生餘念。",
        "translation": "\"Don't give rise to any other thoughts.",
        "source": "T24n1450_010:0151b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往時特牛者，即我身是。",
        "translation": "'In the past, that special bull was me.",
        "source": "T24n1450_010:0151b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔日驢者，即提婆達多是。",
        "translation": "That donkey of yore was Devadatta.",
        "source": "T24n1450_010:0151b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔不用我言，已遭其苦。",
        "translation": "He didn't use my words in the past, and he already suffered.",
        "source": "T24n1450_010:0151b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今日不聽吾說，現受如斯大殃。",
        "translation": "Not listening to my teaching today, I've caused such great suffering now.",
        "source": "T24n1450_010:0151b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸苾芻，汝更應知！",
        "translation": "\"Furthermore, monks, you should know better!",
        "source": "T24n1450_010:0151b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如今日提婆達多不用我言招其大苦。",
        "translation": "It's like the time when Devadatta didn't use my words to invite his great suffering.",
        "source": "T24n1450_010:0151b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔之事，宜可更聽。",
        "translation": "It's appropriate to listen further to the events of the past.",
        "source": "T24n1450_010:0151b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_010:0151b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔於一村，有一長者在此而住，有一大牛眾相具足。",
        "translation": "Once upon a time, there was an elder living in a village who had a large bull with an abundance of characteristics.",
        "source": "T24n1450_010:0151b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者延請沙門及婆羅門無依無怙貧窶商客，普設供養，行捨施已遂便解放，具相大牛隨所遊行更無拘繫。",
        "translation": "That elder then invited a monk or brāhmaṇa, a poor man without support or support, a merchant, and a businessman to make universal offerings, and after making alms, he liberated the large, well-proportioned ox that marched along without restraint.",
        "source": "T24n1450_010:0151b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時大牛既蒙釋放，隨意遊行追覓水草。",
        "translation": "Having been freed, the huge bull then freely roamed in search of water and grass.",
        "source": "T24n1450_010:0151c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時行陂澤陷深泥內，自出無由。",
        "translation": "When it traveled to a swamp, it got stuck in deep mud and had no way to escape on its own.",
        "source": "T24n1450_010:0151c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時長者日將曛暮，方見人傳遂尋覓之。",
        "translation": "It was then near sunset when the elder saw a rumor of someone else's presence and searched for him.",
        "source": "T24n1450_010:0151c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到其牛所，長者念曰：『泥深牛大，我獨無堪，待至明朝詳來濟拔。』",
        "translation": "When he reached his ox, the man thought, 'The mud is deep and the ox is too big for me alone; wait until tomorrow morning to rescue him.'",
        "source": "T24n1450_010:0151c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牛遂告曰：『可以繩綣繫我角上置於前面，任曉方來；如有猴狢來逼我時，我以綣繩振角驚怖。』",
        "translation": "The ox then told him, 'You can tie a rope to my horns and put it in front of me until sunrise; if a monkey comes and presses me, I'll shake my horns with the rope and be scared.'",
        "source": "T24n1450_010:0151c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人遂即以繩繫角長，作其綣置地而去。",
        "translation": "The man then tied a rope around the length of his horn, placed it on the ground, and departed.",
        "source": "T24n1450_010:0151c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既屆冥宵，野猴便至，遙覩其牛作斯言曰：『誰於此處偷竊藕根？』",
        "translation": "When the evening was over, a wild monkey arrived and looked at the cow from a distance and said, 'Who stole the roots of the lotus here?'",
        "source": "T24n1450_010:0151c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "牛便報曰：『我被泥溺自出無由，非是竊心盜他蓮藕。』",
        "translation": "The cow then reported, 'I was drowning in the mud and had no way to get out on my own, not because I stole the lotus root from another person with a secret heart.'",
        "source": "T24n1450_010:0151c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猴聞是語遂與言曰：『我之美饍何忽自來？』",
        "translation": "When the monkey heard this, he said, 'Why did my delicious meal suddenly come from me?'",
        "source": "T24n1450_010:0151c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂近其牛欲為屠害，牛告猴曰：『爾宜遠我，莫見相陵，勿使汝身遭羅苦毒。』",
        "translation": "He approaches the ox and tries to kill it, but the ox tells the monkey, 'You'd better keep away from me and don't let yourself be tormented by what you see, so you won't be exposed to pain and suffering.'",
        "source": "T24n1450_010:0151c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猴雖聞告不齒其言，遂就牛邊欲為摣掣。",
        "translation": "Although the monkey heard what he was told, he didn't agree with his words, so he went over to the ox and tried to put a hand to it.",
        "source": "T24n1450_010:0151c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勃利沙婆(譯為牛王)見不用言，說伽他曰：「『我非偷藕根，　　亦非盜蓮者；　　必若情存食，　　上背應從刳。』",
        "translation": "Seeing this, Bṛhatphala (translated as the king of cows) didn't say anything and said to him, \"I didn't steal the root of the lotus, nor did I steal the lotus; surely if I had wanted to eat, I would have scooped up the upper back.\"",
        "source": "T24n1450_010:0151c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「猴曰：『今正是時，應從背後次第而食。』",
        "translation": "\"The monkey said, 'Now is the right time to eat from the back in order.'",
        "source": "T24n1450_010:0151c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "擲上牛背下口欲飡，牛角振綣羂著猴項，遂便擺索空裏懸身。",
        "translation": "He threw himself onto the bull's back and lowered his mouth to eat, but the bull's horns struck the monkey's neck, so he swung his rope around and hung himself in the air.",
        "source": "T24n1450_010:0151c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時大牛說伽他曰：「『汝是美少年，　　戲者空中舞；　　騁伎於村田，　　野田無施主。』",
        "translation": "The bull then said to the gata, 'You're a beautiful young man who dances in the air as a trouper and roams the village fields like a trouper, and there's no donor in the fields.'",
        "source": "T24n1450_010:0151c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時野猴亦以伽他而答牛曰：「『我非作舞者，　　亦非美少年；　　帝釋投梯下，　　吾當往梵天。』",
        "translation": "\"The wild monkey then also answered the ox with a reply of gatha, 'I'm not a dancer, nor am I a pretty boy; Indra threw myself down a ladder, and I'll go to Brahma.'",
        "source": "T24n1450_010:0151c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又復牛王更說頌曰：「『實非天帝釋，　　投梯往梵天；　　繩綣急勒項，　　性命此時窮。』",
        "translation": "\"Again, the king of the bulls spoke another verse, saying, 'It's really not Indra who threw himself down the ladder and went to Brahma; his rope is tightly wrapped around his neck, and his life has ended for now.'",
        "source": "T24n1450_010:0151c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝諸苾芻！",
        "translation": "\"You monks!",
        "source": "T24n1450_010:0152a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿生異念。",
        "translation": "\"Don't give rise to different thoughts.",
        "source": "T24n1450_010:0152a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔時牛王者，即我身是。",
        "translation": "'In the past, that cow king was me.",
        "source": "T24n1450_010:0152a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往日野猴即天授是。",
        "translation": "That wild monkey of yore was the gods' mandate.",
        "source": "T24n1450_010:0152a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔不用我言已遭其苦，今不聽吾說，現受如斯大殃。」",
        "translation": "Those who didn't use my words in the past have suffered, and now, if they didn't listen to my teaching, they'll suffer such great misfortune now.\"",
        "source": "T24n1450_010:0152a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻復有疑念，遂便請問斷疑：「世尊！",
        "translation": "Again, the monks had doubts, so they asked questions to resolve them, \"Bhagavān!",
        "source": "T24n1450_010:0152a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故提婆達多，於世尊所起大嗔心，不隨正語，生阿毘止大苦燎身？」",
        "translation": "Why did Devadatta, having become very angry with the Bhagavān and not following correct speech, give rise to the body of Abhisa, the great painful prairie?\"",
        "source": "T24n1450_010:0152a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「非但今日不用我言，身遭猛火一切無救。",
        "translation": "The Bhagavān told them, \"Not only do you not need my words today, but you won't be able to save yourselves from a raging fire.",
        "source": "T24n1450_010:0152a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_010:0152a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜更應聽。",
        "translation": "It's better to listen.",
        "source": "T24n1450_010:0152a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曾於往昔有一王都，王名制底迦，敷化於此。",
        "translation": "Once upon a time, there was a king's capital named Cetiya who spread his teachings here.",
        "source": "T24n1450_010:0152a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王福力令其國界富饒昌熾安隱豐樂，多諸人眾無所匱乏。",
        "translation": "The king's merits made his realm rich, prosperous, peaceful, and abundant, and many people had nothing to lose.",
        "source": "T24n1450_010:0152a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復其王有大勝福，每欲坐時，有諸天眾捧其座足止在空裏。",
        "translation": "Furthermore, the king had such great fortune that whenever he wanted to sit down, a multitude of gods would carry his seat by its feet and stop it in the air.",
        "source": "T24n1450_010:0152a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王有一知國大臣，便生二子：大名出喜、小名眾愛。",
        "translation": "The king then had a minister who knew his country, and he gave birth to two sons, the older named Delight and the younger named Much Love.",
        "source": "T24n1450_010:0152a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時大兒每見其父以法非法而教於眾，遂便念曰：『我為長子職合襲官，我父終亡當大臣位，吾亦當以法及非法而教於物，緣斯惡業生捺落迦。",
        "translation": "Whenever the older son saw his father teaching the people both the Dharma and the unlaw, he thought, 'I'm the eldest son who's in line to inherit the office, and when my father dies and becomes a minister, I will also teach things both the Dharma and the unlaw, and because of this bad action I'll be born in naraka.'",
        "source": "T24n1450_010:0152a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈若我今修出家行？』",
        "translation": "Wouldn't it be better for me to practice as a renunciant now?'",
        "source": "T24n1450_010:0152a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂至父所求哀出家，父遂許之，於世尊處出家離俗。",
        "translation": "He then went to his father and begged him to leave home, and his father approved, leaving home with the Bhagavān and leaving the secular world.",
        "source": "T24n1450_010:0152a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於異時其父大臣掩隨他世，時第二子為國大臣，以法非法而化於俗，國人怨酷說其非理。",
        "translation": "At some point later, his father's minister took refuge in another world, and the second son, who was then the minister of the country, converted the world because the Dharma was not legal, and the people of the country resented him for being unreasonable.",
        "source": "T24n1450_010:0152a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一人旋遊村邑不期展轉，見彼大兄修出家行。",
        "translation": "Then, a man wandered around a village, but he didn't expect to see his eldest brother practicing renunciation.",
        "source": "T24n1450_010:0152a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時苾芻見其客至，而問之曰：『爾從何處今來至斯？』",
        "translation": "When the monk saw his visitor arrive, he asked him, 'Where did you come from that you've arrived here?'",
        "source": "T24n1450_010:0152a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人報曰：『我住某城。』",
        "translation": "The man reported, 'I live in a certain town.'",
        "source": "T24n1450_010:0152a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂問其弟，客人具答：『彼行非法苦刻人庶，眾皆負怨無賴求生。』",
        "translation": "He then asked his disciple about it, and he replied, 'They practice what's illegal, and they're harsh on the people.",
        "source": "T24n1450_010:0152a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻聞已告其人曰：『仁今可去勿生憂慼，我有容隙當往彼城，以理開導令行正法，冀望人庶離苦得安。』",
        "translation": "After hearing this, the monk told him, 'Sir, you may go now. Don't be sad; I'll go to that city sometime soon and guide you in principle to practice the right Dharma, hoping that many people will escape suffering and attain peace.'",
        "source": "T24n1450_010:0152a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人聞已遂還本處，報其親族具述所由，展轉風聞徹其小弟。",
        "translation": "After hearing this, the man returned to his original place, reported to his relatives, and told them the reason for his actions, and then he spread the news to his younger brother.",
        "source": "T24n1450_010:0152a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟即便往白其王曰：『我之大兄欲來至此。』",
        "translation": "The younger brother then went to the king and told him, 'My oldest brother wants to come here.'",
        "source": "T24n1450_010:0152a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王便告曰：『善哉！",
        "translation": "The king then told him, 'Good!",
        "source": "T24n1450_010:0152a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若至，彼即大臣。』",
        "translation": "If he arrives, he will be a minister.'",
        "source": "T24n1450_010:0152a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人白曰：『我已久來事王殿下，勞誠宿著其事如何？』",
        "translation": "The man said, 'I've been serving Your Majesty for a long time; what about your request to stay with him?'",
        "source": "T24n1450_010:0152b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王便告曰：『我之國法太子襲臣，事不可移，知欲何計？』",
        "translation": "The king then told them, 'My country's laws require that the crown prince assault ministers, and the situation cannot be changed.",
        "source": "T24n1450_010:0152b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王復告曰：『必汝情願，彼若來時，應云：「我大。」』",
        "translation": "The king again told him, 'You must wish it; if he comes, he'll say, 'I am great.'",
        "source": "T24n1450_010:0152b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既蒙王教內喜而歸。",
        "translation": "Having been instructed by the king, he was delighted at first and returned.",
        "source": "T24n1450_010:0152b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻不久還其本邑，王眾見已咸悉起迎，唯獨其弟端居而住。",
        "translation": "Soon after he returned to his native town, the monk was greeted by the king's entourage, except for his brother, who was staying at his house.",
        "source": "T24n1450_010:0152b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻告曰：『汝是我弟，何故端居？』",
        "translation": "The monk told them, 'You're my brother, why are you standing up here?'",
        "source": "T24n1450_010:0152b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人報曰：『爾小，我大。",
        "translation": "That person replies, 'You're small; I'm large.",
        "source": "T24n1450_010:0152b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其不信應取證明。",
        "translation": "If you don't believe me, you should obtain proof.",
        "source": "T24n1450_010:0152b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我長王宮王知大少，宜應共問決判真虛。』",
        "translation": "The king knows that I'm the elder and the younger in the palace, so it's appropriate to ask questions together to decide what's true and false.'",
        "source": "T24n1450_010:0152b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時苾芻進白王曰：『我之二人誰為長子？』",
        "translation": "The monk then advanced to the king and said, 'Which of the two of us is the eldest son?'",
        "source": "T24n1450_010:0152b08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王乃故心而妄語曰：『此人當大，爾為小矣。』",
        "translation": "The king then deliberately and falsely said, 'This person must be great; you must be small.'",
        "source": "T24n1450_010:0152b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "纔發言已，尋聲之後，天便放座摧之於地，即於口內臭氣外充。",
        "translation": "After he had spoken, he looked for the sound, and the gods then placed his seat on the ground and destroyed it, filling his mouth with bad breath.",
        "source": "T24n1450_010:0152b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時太子苾芻見斯事已說多頌曰：「『若人為妄語，　　諸天便捨去；　　口中臭氣出，　　失却天堂路；　　王應為實語，　　平復還如故。",
        "translation": "After seeing this, the prince monk spoke many verses, saying, 'If someone speaks falsely, the gods will abandon them; the stench will come out of their mouths, and they'll lose the way to heaven; the king will speak truly, and they'll return to their former level.'",
        "source": "T24n1450_010:0152b12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若其為妄語，　　下道定當行；　　當招無舌報，　　猶若水中魚。",
        "translation": "If someone speaks falsely, they'll surely walk down the path; they'll incur the consequences of having no tongue and be like a fish in water.",
        "source": "T24n1450_010:0152b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人乖法言，　　作其非法說；　　王應為實語，　　平復還如故。",
        "translation": "If someone doesn't follow the teaching and makes an untrue statement, the king will speak truly and return it to the way it was.",
        "source": "T24n1450_010:0152b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若其為妄語，　　下道定當行；　　當作非男女，　　定受黃門形。",
        "translation": "If someone speaks falsely, they'll surely practice in the lower path; they'll become a man or woman who isn't male or female, and they'll surely receive the shape of a yellow door.",
        "source": "T24n1450_010:0152b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人乖法言，　　作其非法說；　　王應為實語，　　平復還如故。",
        "translation": "If someone says something contrary to the teaching and makes an untrue statement, the king will speak truly and return it to the way it was.",
        "source": "T24n1450_010:0152b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若其為妄語，　　下道定當行；　　應時天不雨，　　非時利雨流。",
        "translation": "If someone speaks falsely, the next path will surely follow; there's a time when it doesn't rain, and there's a time when it doesn't help to rain.",
        "source": "T24n1450_010:0152b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人乖法言，　　作其非法說；　　王應為實語，　　平復還如故。",
        "translation": "If someone says something contrary to the teaching, they make an untrue statement; the king should speak truly and return it to the way it was.",
        "source": "T24n1450_010:0152b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若其為妄語，　　下道定當行；　　當受蛇身報，　　兩舌口中生。",
        "translation": "If someone speaks falsely, the next path will surely follow, and they'll be punished by the snake's body, which will arise from their tongues and mouths.",
        "source": "T24n1450_010:0152b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人乖法言，　　作其非法說；　　王應為實語，　　平復還如故。",
        "translation": "If someone doesn't follow the teaching and makes an untrue statement, the king will speak truly and return it to the way it was.",
        "source": "T24n1450_010:0152c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若其為妄語，　　下道定當行；　　即如制底王，　　造其極惡業；　　當趣阿毘止，　　惡報處泥黎。』",
        "translation": "If he speaks falsely, he'll surely act in the lower path; just like King Cedi, he'll create extremely bad karma; he'll be destined to go to Abhisa and suffer the results of bad actions in Nirvana.'",
        "source": "T24n1450_010:0152c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝諸苾芻！",
        "translation": "\"You monks!",
        "source": "T24n1450_010:0152c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿生異念，其大臣長子，即是我昔身。",
        "translation": "Don't think otherwise, for that minister's eldest son was my body in the past.",
        "source": "T24n1450_010:0152c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其制底迦王，即今時天授！",
        "translation": "His caitya-ruler is the present-day gods' mandate!",
        "source": "T24n1450_010:0152c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今仍於我，起極嗔心不受其語。",
        "translation": "Still, he became extremely angry with me and didn't accept his words.",
        "source": "T24n1450_010:0152c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣斯惡報，生捺落迦在阿毘止。」",
        "translation": "As a result of this bad retribution, I was born in Nādaka and stayed at Abhichai.\"",
        "source": "T24n1450_010:0152c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有苾芻尚有疑念，更便請白斷疑世尊曰：「大德！",
        "translation": "A monk who still had doubts then went on to ask the Bhagavān to end his doubts, \"Mañjuśrī!",
        "source": "T24n1450_010:0152c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故提婆達多，大慈世尊為利益語，不能信用，生捺落迦阿毘止中，受大極苦？」",
        "translation": "Why, Devadatta, was the Bhagavān, who spoke for the benefit of the world and couldn't be trusted, born in the Nādika abhijit and subjected to great suffering?\"",
        "source": "T24n1450_010:0152c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝諸苾芻！",
        "translation": "The Bhagavān addressed them, \"You monks!",
        "source": "T24n1450_010:0152c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多非但今日不用我言受斯獄苦。",
        "translation": "Not only does Devadatta not use my words today to endure the pain of hell.",
        "source": "T24n1450_010:0152c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又過去世時，亦不受語曾遭辛苦。",
        "translation": "Nor did he accept the words of someone who had suffered hardship in a past life.",
        "source": "T24n1450_010:0152c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應聽。",
        "translation": "Now, you should listen.",
        "source": "T24n1450_010:0152c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_010:0152c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於往昔時在一村內有妙巧師，機關善解在此村住，遂於相似族望之中納女為妻。",
        "translation": "In a former village, there was a marvelous master who had a good understanding of the ways of things and lived in that village.",
        "source": "T24n1450_010:0152c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "綢繆結好懽娛得意，未久妊身，八九月已便生一息。",
        "translation": "She made friends and entertained herself, and before long she was expecting a child, and in the eighth or ninth month she gave birth to one breath.",
        "source": "T24n1450_010:0152c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既其誕已經三七日，作其懽會為授其名號曰巧容，如法長養漸至成立。",
        "translation": "Thirty-one days after her birth, she was given the name Qiaolong at a ceremony organized by the government, and she was nurtured according to the rules until her birth was established.",
        "source": "T24n1450_010:0152c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其父不久遂爾身亡，其息於後便向餘村，更就巧師學機關技，復向餘邑轉求伉儷。",
        "translation": "His father died soon afterward, and his breath then went to another village, where he learned the skills of the master of skillful means and went to another town to seek a husband and wife.",
        "source": "T24n1450_010:0152c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一長者，父女居門許與為妻，而報之曰：『汝齊某日促赴我言，不爽斯期任為婚娶，如其不及非我之愆。』",
        "translation": "There was an elderly man whose father and daughter had accepted him as their wife, and he told him, 'You must hurry to my office one day, and let me marry you if you don't meet this deadline; it won't be my fault if you don't make it.'",
        "source": "T24n1450_010:0152c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "巧容復往報巧師曰：『某村有女許我婚成，吉日時臨相期促至，如能赴節必不爽言。",
        "translation": "Qiaolong then went back to Qiaosi and told him, 'A woman from a certain village has promised me marriage, and an auspicious day is approaching when she's expected to arrive.",
        "source": "T24n1450_010:0152c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若也乖時非我之過。』",
        "translation": "It's not my fault if she doesn't make it at the right time.'",
        "source": "T24n1450_010:0152c26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "巧師報曰：『必如是者，我當共汝赴彼促期，良日吉晨理難再得。』",
        "translation": "The skilled teacher replied, 'If that's the case, I'll go with you to that auspicious time; it's unreasonable to expect another good day and an auspicious morning.'",
        "source": "T24n1450_010:0152c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取木孔雀相與俱昇，不遠遐途促赴期日。",
        "translation": "They took the wooden peacock and rose together, rushing off to the appointed day without traveling far.",
        "source": "T24n1450_010:0152c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼村邑人物共觀，見所未曾嗟其奇巧，既呈禮贈取婦歸還，遂與三人俱昇孔雀，機關轉發俄陵太虛，未盡浹辰倏歸故邑。",
        "translation": "When the people of that village looked at it, they admired its marvelous skillfulness like nothing they'd ever seen before. After presenting the wife with a gift and returning, they ascended to the peacock with the three of them, turned away from the authorities, rushed into the sky, and returned to their hometown before the end of the evening.",
        "source": "T24n1450_010:0152c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既其到已，于時巧師報兒母曰：『此機關象汝可藏之，兒若索時必不應與。",
        "translation": "After they arrived, the skilled teacher then reported to the child's mother, saying, 'This is a sign of skillfulness that you can hide, for if the child asks for it, he surely won't get it.'",
        "source": "T24n1450_010:0153a03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由其解去未學還歸，勿使其兒致遭苦厄。』",
        "translation": "Let him go and return before he studies, so his son won't be subjected to suffering and distress.'",
        "source": "T24n1450_010:0153a04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其兒於後，數數從母索其孔雀：『我乘木象暫欲旋遊，欲使多人歸伏於我。』",
        "translation": "Later, his son repeatedly asked his mother for the peacock, saying, 'I rode around in a wooden elephant for a while, hoping to get many people to submit to me.'",
        "source": "T24n1450_010:0153a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母遂報曰：『汝師去日固有留言，兒索象時不宜見與，但解昇去未體歸還，勿令因此致招苦厄。』",
        "translation": "The mother then reported, 'Your teacher will leave a message on the day he leaves; it's not appropriate for him to ask for the elephant when he asks for it; only return it after he's ascended and departed; don't let that bring misery and trouble.'",
        "source": "T24n1450_010:0153a07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兒報母曰：『去還之術，我已並知。",
        "translation": "The child replied to his mother, 'I've already understood both the technique of going and returning.",
        "source": "T24n1450_010:0153a09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師有慳心，不令見與。』",
        "translation": "The teacher is stingy and won't allow him to see and give it to her.'",
        "source": "T24n1450_010:0153a10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人心軟，數見求情，遂以機關持授其子。",
        "translation": "The woman was softened in spirit that she repeatedly asked for her son's permission to take the precepts.",
        "source": "T24n1450_010:0153a10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子得象已遂動發機，直上摶霄眾人歎善。",
        "translation": "After he got the elephant, the son then started to use his faculties and went straight up to the sky, where people praised him for his goodness.",
        "source": "T24n1450_010:0153a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其師見已而歎之曰：『此兒一去不復還來。』",
        "translation": "When his teacher saw him, he praised him, saying, 'This son will never return.'",
        "source": "T24n1450_010:0153a12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更轉機關往而不返，到大海上多雨小晴，所有機繩盡皆爛斷，雹之海內因乃命終。",
        "translation": "He went back to the barrier of opportunity and never returned. When he reached the ocean with much rain and little sunshine, all of his organic cords rotted away and he was hailed into the ocean because his life ended.",
        "source": "T24n1450_010:0153a13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天見之說伽他曰：「『諸有悲憐出益語，　　不從其教自隨心；　　木象無師強乘去，　　終於大海見身沈。』」",
        "translation": "The gods who saw him said to him, \"Suppose you were compassionate and helpful, and you didn't follow their teaching but followed your own heart; the wooden elephant without a teacher forced it to ride away, and it ended up in the ocean where it saw its body sink.\"",
        "source": "T24n1450_010:0153a15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「汝諸苾芻！",
        "translation": "The Bhagavān told them, \"You monks!",
        "source": "T24n1450_010:0153a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿生異念。",
        "translation": "\"Don't give rise to different thoughts.",
        "source": "T24n1450_010:0153a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往時機關師者，即我身是。",
        "translation": "The person who used to be the authority's teacher was me.",
        "source": "T24n1450_010:0153a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其弟子者，即提婆達多是。",
        "translation": "His disciple was Devadatta.",
        "source": "T24n1450_010:0153a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往背利語，已遭沈沒之殃。",
        "translation": "By reneging on beneficial words in the past, I was already plunged into the misfortune of sinking.",
        "source": "T24n1450_010:0153a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今棄益言，現受燒身之酷。」",
        "translation": "Now, I've abandoned the beneficial words, and I'm now suffering the cruelty of having my body burned.\"",
        "source": "T24n1450_010:0153a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事卷第十",
        "translation": "Mūlasarvâstivāda-vinaya-viṃśati-vāda, Volume 10",
        "source": "T24n1450_010:0153a22_0",
        "is_bad_quality": false
    }
]