[
    {
        "source_sentence": "根本說一切有部毘奈耶頌卷下",
        "translation": "Mūlasarvâstivāda-vinaya-vāda, Volume 2",
        "source": "T24n1459_003:0646a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者毘舍佉造",
        "translation": "Venerable Vaiśākha's work",
        "source": "T24n1459_003:0646a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "Translation by the Tripiṭaka Master Yijing Feng",
        "source": "T24n1459_003:0646a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎下明於十七跋窣覩等，中述其要事(跋窣覩是事)。",
        "translation": "Here are the seventeen vastu and so forth, the main points of which are described here (vastu is a matter).",
        "source": "T24n1459_003:0646a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若是旃荼羅，　　唱令及酒舍；　婬女王宮處，　　此五非行境。",
        "translation": "\"Suppose there's a caṇḍāla, a singing order, a wine bar, a place where the queen of lust is kept, or one of these five immoral objects.",
        "source": "T24n1459_003:0646a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　外道諸典籍，　　習讀將為勝；　及數犯罪人，　　所食皆成毒。",
        "translation": "These are the texts of non-Buddhists that will be read and practiced to perfection, and the numerous offenders whose food becomes poisonous.",
        "source": "T24n1459_003:0646a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　常應讀佛教，　　是惡道良醫；　開許讀外書，　　為欲知其過。",
        "translation": "You should always read Buddhism, which is a good doctor for evil destinies, or you should permit the reading of non-Buddhist texts in order to know their faults.",
        "source": "T24n1459_003:0646b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切智言說，　　美妙多譬喻；　豈如外道論，　　無理言麁淺。",
        "translation": "All wise sayings are beautiful and full of parables, but are they like non-Buddhist theories that speak crudely and shallowly without reason?",
        "source": "T24n1459_003:0646b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　多畜諸器具，　　彫飾皆不許；　若畫坐床足，　　斯皆外道儀。",
        "translation": "Many instruments are stored, and their decorations are not permitted; if they were painted, sitting on a bed or foot, these would be the manner of a non-Buddhist.",
        "source": "T24n1459_003:0646b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻身老病，　　若乘輿隨聽；　杖絡及皮衣，　　斯皆在開限。",
        "translation": "If a monk's body is old and sick, if he rides in a mule and listens to it, or if he wears a staff and leather clothes, these are all within the limits.",
        "source": "T24n1459_003:0646b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無由帝釋請，　　遂開於浴室；　并勤定誦人，　　咸聽小食飯。",
        "translation": "Without being invited by Tishri, he opens the bathhouse, and those who diligently chant listen to a small meal.",
        "source": "T24n1459_003:0646b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不注於眼口，　　亦不香薰衣；　不畫傘皮鞋，　　揩爪令光淨。",
        "translation": "They don't bathe their eyes and mouths, don't perfume their robes, don't paint their umbrellas and shoes, and wipe their paws to make them shine clean.",
        "source": "T24n1459_003:0646b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　傘蓋有二種，　　葉作葦竹成；　若至村中時，　　不應正持入。",
        "translation": "There are two kinds of umbrella canopies, made of reeds and bamboos with leaves; if you go to a village, you shouldn't carry it correctly into it.",
        "source": "T24n1459_003:0646b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若作於傘柄，　　應與傘蓋同；　欠呿開口時，　　應將衣手掩。",
        "translation": "If it's made with an umbrella handle, it should be the same as the canopy; when it yawns and opens its mouth, it should be covered by the hand of the robe.",
        "source": "T24n1459_003:0646b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有緣須笑時，　　不得露齗齒；　讚詠大師德，　　說法時非過。",
        "translation": "When he has a reason to smile, he mustn't show his gums; when he praises the virtue of the great teacher, it's not a mistake to preach the Dharma.",
        "source": "T24n1459_003:0646b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不得長作聲，　　宣唱牟尼典；　讀誦宜依法，　　隨處勿相違。",
        "translation": "Don't make a long noise, proclaiming the scriptures of Muni; read and recite them according to the rules, and don't contradict them wherever you go.",
        "source": "T24n1459_003:0646b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若學讚德聲，　　應在於屏處；　為宣揚正法，　　不應生染心。",
        "translation": "If you train in the sound of praising virtues, you should place it in a screened area; in order to proclaim the right teaching, you shouldn't give rise to a defiled mind.",
        "source": "T24n1459_003:0646b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻及尼等，　　五眾許安居；　若至夏罷時，　　五眾集隨意。",
        "translation": "The five groups of monks and nuns are permitted to live in peace; if there's a time after summer, the five groups gather at will.",
        "source": "T24n1459_003:0646b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻苾芻尼，　　一切戒須學；　求寂求寂女，　　受十戒應知。",
        "translation": "Bhikṣus and nuns must train in all the precepts, and women who seek tranquility and seek tranquility should know the ten precepts.",
        "source": "T24n1459_003:0646b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不獨在道行，　　亦不獨渡水；　不故觸男子，　　不與男同宿；　不為媒嫁事，　　不覆藏他罪；　是名為六法，　　正學女應知。",
        "translation": "Not walking alone on the path, not crossing the water alone, not touching a man forcibly, not sleeping with a man, not engaging in matchmaking, and not concealing another's sins are these six things that a woman who is rightly training should know.",
        "source": "T24n1459_003:0646b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金銀不應捉，　　不除隱處毛；　亦不掘生地，　　不斷於青草；　不得不受食，　　及以殘宿食；　是名為六隨，　　學之經兩歲。",
        "translation": "Not to catch gold or silver, not to remove hair from hidden places, not to dig into the living ground, not to cut off grass, not to accept food, and not to eat leftover food, these are called the six followers, and they've been studied for two years.",
        "source": "T24n1459_003:0646c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　上座於日數，　　分明須憶知；　授事在眾前，　　日日當陳告。",
        "translation": "The ascended master clearly recalls the number of days, and he presents the task before the assembly, telling it day by day.",
        "source": "T24n1459_003:0646c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　可於六時中，　　月半減一日；　減日成其月，　　至六成一閏。",
        "translation": "In the six seasons, subtract one day from each half of the month; subtract a day to make a month, and six will make a leap.",
        "source": "T24n1459_003:0646c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如其王作閏，　　月數有參差；　苾芻應可隨，　　由王有勢力。",
        "translation": "If the king creates a leap year, the number of months will vary; the monk may follow, for the king has power.",
        "source": "T24n1459_003:0646c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　洗手洗鉢處，　　若作曼荼羅；　不似日月形，　　及似塔形勢。",
        "translation": "If a maṇḍala were made where he washes his hands and bowl, it wouldn't resemble the shape of the sun and moon or the shape of a stūpa.",
        "source": "T24n1459_003:0646c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻涉路去，　　若過神廟堂；　入彈指作聲，　　伽他說佛語。",
        "translation": "If a monk wades through a path or passes by a shrine hall, he enters, snaps his fingers, and makes a noise as he speaks the Buddha's words to others.",
        "source": "T24n1459_003:0646c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若至神廟所，　　不應為損益；　苾芻若違教，　　便招惡作罪。",
        "translation": "If he goes to a shrine, it shouldn't be a loss or gain; if a monk disobeys the teaching, he'll incur the sin of misdeeds.",
        "source": "T24n1459_003:0646c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻等五眾，　　不供養天神；　自作若使人，　　亦得惡作罪。",
        "translation": "If a monk or one of the five groups of monks doesn't make offerings to the gods, and if he makes or causes others to make offerings, it's also a misdeed.",
        "source": "T24n1459_003:0646c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有餘因緣，　　許香花祭食；　不得違時俗，　　損益不應為。",
        "translation": "If there are other reasons, they'll accept offerings of flowers and food; they mustn't act contrary to the customs of the time, and their gain or loss shouldn't be incurred.",
        "source": "T24n1459_003:0646c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　事佛之善神，　　隨情應供養；　於諸大經內，　　遣作皆無犯。",
        "translation": "The good deities who serve the Buddha should be offered up according to their abilities, and in the great scriptures, their acts of repudiation are not infractions.",
        "source": "T24n1459_003:0646c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於諸有情類，　　常擁護行慈；　由有慈悲種，　　不生於苦趣。",
        "translation": "They always guard and practice kindness toward all sentient beings, and because they have the seed of kindness and compassion, they aren't born in the destiny of suffering.",
        "source": "T24n1459_003:0646c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　愛敬天神者，　　常好為供養；　世間皆共然，　　由貪生死樂。",
        "translation": "Those who love and revere the gods and goddesses and always make offerings to them are all the same in the world because they crave the pleasures of birth-and-death.",
        "source": "T24n1459_003:0646c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　皆求世間果，　　由是祭邪神；　惱害殺眾生，　　引他歸惡趣。",
        "translation": "They all seek worldly rewards, which is why they sacrifice to evil spirits, harm and kill sentient beings, and lead them to a bad destiny.",
        "source": "T24n1459_003:0646c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先已歸依佛，　　轉更事天神；　供養獲果少，　　不知尊敬處。",
        "translation": "After previously relying on the Buddha, they change to serve the gods, reap few rewards from their offerings, and don't know where to place their respect.",
        "source": "T24n1459_003:0647a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　破戒著袈裟，　　欺弄苾芻像；　無慚噉人食，　　事同剛火炭。",
        "translation": "He breaks the precepts, wears a monk's robe, deceives a monk's image, and devours human food without conscience, acting like charcoal on a hard fire.",
        "source": "T24n1459_003:0647a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應寫律教等，　　流布能生福；　忘念者令憶，　　自身兼讀持。",
        "translation": "You should write down vinaya teachings and so forth, spreading them around to produce merit; making those who forget to remember them recall them, and reading and maintaining them yourself.",
        "source": "T24n1459_003:0647a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻入浴室，　　須揩身體時；　應令敬信人，　　勿使不信者。",
        "translation": "When a monk enters the bath, he must wash his body; make him respect those who believe and don't allow those who don't believe.",
        "source": "T24n1459_003:0647a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有持戒人，　　不供破戒者；　不可令師子，　　承事於野干。",
        "translation": "Suppose there's a person who observes the precepts and doesn't offer sacrifices to those who violate them; don't make your lion undertake to serve him in a wilderness.",
        "source": "T24n1459_003:0647a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此是佛法刺，　　正教中死屍；　共住及隨行，　　皆成不應法。",
        "translation": "These are the thorns of the Buddha's teaching, the corpses of the right teaching, and the shared abodes and practices that make them unsuitable.",
        "source": "T24n1459_003:0647a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　親教軌範師，　　及父母有病；　假令是破戒，　　悉可為供給。",
        "translation": "Suppose a teacher who follows the examples of the Buddha's teaching or a parent who's ill were to violate the precepts, and he or she would make offerings to them all.",
        "source": "T24n1459_003:0647a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母老貧病，　　乞食半相供；　由斯有大恩，　　是故應瞻養。",
        "translation": "When their parents are elderly and poor and ill, they ask for food and offer it halfway; because of this great kindness, they should therefore look after them.",
        "source": "T24n1459_003:0647a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見有闕乏處，　　隨事皆供給；　乃至塗足油，　　洗沐令身淨。",
        "translation": "Whenever he sees a lacking place, he offers it up for whatever it is, even to the point of rubbing oil on his feet and washing his body to make it clean.",
        "source": "T24n1459_003:0647a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻若用甎，　　唯得揩踝足；　餘身分不許，　　若為病皆聽。",
        "translation": "If a monk uses oil, he's only allowed to wipe his ankles and feet; the rest of his body is not allowed, and if it's for illness, he'll listen.",
        "source": "T24n1459_003:0647a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不三畫插梳，　　及帶於呪線；　應繫於左臂，　　為治病開聽。",
        "translation": "He doesn't draw a comb three times or carry a spell on a thread; he ties it to his left arm and listens to it for the purpose of healing illness.",
        "source": "T24n1459_003:0647a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如其病除愈，　　應安柱孔中；　醫人若遣為，　　香塗身不犯。",
        "translation": "If he recovers from his illness, he should put it in the hole of a pillar; if the doctor rejects it, it's not a violation to rub incense on his body.",
        "source": "T24n1459_003:0647a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若以香塗身，　　不應出房外；　勿令他嫌慢，　　增其不信心。",
        "translation": "If you rub incense on your body, it shouldn't go out of your room; don't make others dislike you and increase their lack of faith.",
        "source": "T24n1459_003:0647a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有淨信者，　　為福施香泥；　應塗戶扇邊，　　嗅之能益眼。",
        "translation": "If there's a pure believer, he should give scented mud for good causes; it should be rubbed near the door and fan, where it can be smelled to improve the eyes.",
        "source": "T24n1459_003:0647a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　淨信以香泥，　　塗摩苾芻足；　為福宜應受，　　去時當洗除。",
        "translation": "That pure faithful person applies scented mud to the feet of a monk; it's a blessing to be accepted, and when they leave, they must wash it off.",
        "source": "T24n1459_003:0647a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必有妙香花，　　苾芻欲得嗅；　意欲令明眼，　　不應生愛心。",
        "translation": "There must be a wonderfully scented flower that a monk wishes to smell; he wants to make his eyes clear, so he shouldn't become attached to it.",
        "source": "T24n1459_003:0647b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聽持鐵鑰匙，　　為防衣藥故；　勿興煩惱意，　　輒捉打眾生。",
        "translation": "Listen to him as he carries an iron key to protect his clothing and medicine; don't get upset and readily grab and beat sentient beings.",
        "source": "T24n1459_003:0647b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大眾及別人，　　持印皆聽許；　銅鐵木礦石，　　甎錫等應為。",
        "translation": "All sentient beings and others are permitted to bear a seal; copper, iron, wood, ore, tile, and tin should be used for this purpose.",
        "source": "T24n1459_003:0647b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　別人髑髏像，　　或刻為白骨；　大眾法輪形，　　此是作印相。",
        "translation": "Calvary images of others may be carved into white bones, but this is the shape of the Dharma wheel of the great multitude, and this is the sign used to make the sign.",
        "source": "T24n1459_003:0647b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡食小香果，　　皆須待核成；　欲令其福增，　　僧伽果須熟。",
        "translation": "Whenever you eat small fragrant fruits, you must wait until the kernel is complete; in order for their merit to increase, the fruits of the saṃgha must ripen.",
        "source": "T24n1459_003:0647b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不應臨水鏡，　　愛心觀面像；　為病念無常，　　照時無有過。",
        "translation": "You shouldn't look into a mirror of water and love the image of your face; when you illuminate it, there's nothing wrong with being mindful of impermanence.",
        "source": "T24n1459_003:0647b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不自斷生支，　　亦不甎石打；　宜將不淨觀，　　洗除婬染心。",
        "translation": "He doesn't cut off the link of birth himself, and he doesn't strike a stone; it's better to contemplate impurity and wash away lust and defilement.",
        "source": "T24n1459_003:0647b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　洗足盆內高，　　其形如象跡；　竹及多羅葉，　　二種扇應持。",
        "translation": "Wash your feet inside a bowl that's high and shaped like an elephant's footprints; bamboo and a palm leaf are two kinds of fans to be held.",
        "source": "T24n1459_003:0647b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲除蚊子，　　五種拂隨聽；　枝梢劫貝[卄/毦]，　　麻毛并破帛。",
        "translation": "If you want to get rid of mosquitoes, listen to the five kinds of whisks; twigs, plunder shells [twenty/numbers], hemp hair, and torn silk.",
        "source": "T24n1459_003:0647b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若須上高梯，　　應結裙下緣；　苾芻不擎重，　　應覓俗人持。",
        "translation": "If he needs to ascend a high ladder, he should wrap a skirt around it; a monk doesn't carry a heavy load, so he should find a layman to carry it.",
        "source": "T24n1459_003:0647b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻之儀式，　　皆與俗不同；　用梳等搔頭，　　是事咸不可。",
        "translation": "The rituals of the monks are different from those of the laypeople; to scratch one's head with a comb or the like is not an acceptable thing to do.",
        "source": "T24n1459_003:0647b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若髮有塵垢，　　頭癢手揩摩；　或時將故衣，　　此等皆無犯。",
        "translation": "If there's dirt in your hair and your hands itch to wipe it off, or if you sometimes put on old robes, these things are not a violation.",
        "source": "T24n1459_003:0647b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　寺後西北隅，　　安置大便室；　及以小行室，　　皆須店門扇。",
        "translation": "At the back of the temple, in the northwest corner, there's a large toilet room and a small practice room, both of which must have doors and fans.",
        "source": "T24n1459_003:0647b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　西北角下房，　　安大眾瓶水；　此據門南向，　　餘面准應知。",
        "translation": "In the lower room at the northwest corner, a large water bottle is placed; this is according to the south-facing aspect of the entrance, and the rest should be known as such.",
        "source": "T24n1459_003:0647b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若見諸俗人，　　及老苾芻啑；　應云久長壽，　　不言便得罪。",
        "translation": "If he sees secular people or old monks regurgitating, he should say, \"Long life!\" or he'll be offended if he doesn't say something.",
        "source": "T24n1459_003:0647c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大者見小啑，　　應告言無病；　小者於尊年，　　即須云敬禮。",
        "translation": "When a big man sees a little man, he should tell him he's not sick; a little man in his rightful years must then say, \"Respect!",
        "source": "T24n1459_003:0647c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡是噉食時，　　及便利未洗；　或一衣在道，　　或立穢鬧處；　或復食雖了，　　口猶未澡漱；　斯皆不禮他，　　亦不受他禮。",
        "translation": "Whenever he eats, or when his handy man hasn't been washed, or when he puts a robe on the path, or when he stands in a noisy place, or when his mouth hasn't been washed even after he eats again, these things are not worshipful to others, nor do they accept another's worship.",
        "source": "T24n1459_003:0647c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於旦起時，　　齒木未淨口；　禮他及受禮，　　並皆招惡作。",
        "translation": "If someone rises at sunrise with their teeth and wood uncleaned and their mouth uncleaned, paying court to others and accepting courtesies will both cause them to do evil.",
        "source": "T24n1459_003:0647c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見行遍住等，　　皆不應禮拜；　佛及大苾芻，　　唯此二應禮。",
        "translation": "Those who see things like walking and pervasive abiding shouldn't be venerated, but the Buddha and the great monks are the only ones who should be venerated.",
        "source": "T24n1459_003:0647c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於斯聖教內，　　有二種畔睇：　一謂以五輪、　　二乃搦其腨。",
        "translation": "Within this noble teaching, there are two kinds of reverence: one is to take the five wheels, and the other is to take hold of one's heart.",
        "source": "T24n1459_003:0647c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持戒者不應，　　毛繩繫蛇項；　如其不肯去，　　方便好應驅。",
        "translation": "A person upholding the precepts shouldn't bind a hair rope around a snake's neck; if it refuses to leave, it's a good way to repel it.",
        "source": "T24n1459_003:0647c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應可用軟繩，　　徐徐繫項棄；　宜安嶮叢處，　　勿對於眾人。",
        "translation": "He should use a soft rope to slowly tie it around his neck and discard it; it should be placed in a dangerous place, not in front of people.",
        "source": "T24n1459_003:0647c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是於鼠等，　　皆可興悲念；　繫放無令害，　　慇懃善用心。",
        "translation": "Thus, you can be compassionate toward rats and so forth, tying them up and releasing them without causing harm, and you should be diligent and well-intended.",
        "source": "T24n1459_003:0647c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　護戒者悲心，　　蚤虱常存念；　置故衣氈內，　　應安孔隙中。",
        "translation": "The compassionate mind of a person who protects the precepts always keeps the flea and louse in mind; put them under the blanket of his old clothes, or place them in a hole.",
        "source": "T24n1459_003:0647c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若其除壁虱，　　可安青草中；　隨其樂處行，　　勿令生苦害。",
        "translation": "If he removes lice from the walls, he can put them in the grass; follow their pleasurable paths, so they won't become painful and harmful.",
        "source": "T24n1459_003:0647c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　油器有三種：　　大者受一抄，　小半抄餘中，　　隨情可持用。",
        "translation": "There are three kinds of oil containers: a large one that takes one codpiece, and a smaller one that takes the rest, which can be used as you see fit.",
        "source": "T24n1459_003:0647c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　道行為法語，　　或作聖默然；　住息說伽他，　　宿處誦三啟。",
        "translation": "He speaks the Dharma for the practice of the path, or he may act in noble silence; he explains the jhātas at rest, and he recites the three revelations at his lodging.",
        "source": "T24n1459_003:0647c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聽持三種繩：　　長百五十肘，　短百肘餘中，　　隨處應當用。",
        "translation": "He listens to the three kinds of rope he carries: 150 elbows long and more than 100 elbows short, which he uses as he sees fit.",
        "source": "T24n1459_003:0647c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如其井池淺，　　或可水平流；　長短任應持，　　或時全不用。",
        "translation": "Like a well and a pond that's shallow, it might flow horizontally; its length might be whatever you need it to be, but sometimes it might not be used at all.",
        "source": "T24n1459_003:0648a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若為苾芻尼，　　演說律儀教；　中間應幔障，　　異斯便惡作。",
        "translation": "If he were a nun, he would expound the Vinaya's teaching; his middle way would be obstructed, and he would do evil if he didn't do that.",
        "source": "T24n1459_003:0648a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不取賊遺物，　　應可善觀瞻；　多人共委知，　　設取無愆過。",
        "translation": "They don't take what's left by thieves, but they should look at it well; many people should share knowledge of it, so it's not a mistake to assume it.",
        "source": "T24n1459_003:0648a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻若種樹，　　擬充僧果園；　守看經五年，　　去時須囑授。",
        "translation": "If a monk plants a tree, he intends to fill it with the monk's orchard; he guards it for five years, and when he leaves, he must give it a mandate.",
        "source": "T24n1459_003:0648a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻不呪誓，　　若作似妄語，　亦不賭衣等，　　博奕匪尸羅。",
        "translation": "A monk doesn't curse or vow, and if he speaks falsely, he doesn't gamble on clothing or other things, nor does he gamble on śīla.",
        "source": "T24n1459_003:0648a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻見女人，　　若有染心起；　或女生染意，　　住處捨應行。",
        "translation": "If a monk sees a woman and defiled thoughts arise, or if a woman has defiled intentions, he'll abide in a place where he should abandon them.",
        "source": "T24n1459_003:0648a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若見苾芻尼，　　為來聽法故；　不可遣其立，　　與物令安坐。",
        "translation": "If he sees a monk or nun who's come to hear the teaching, he mustn't dismiss her from standing, but give her something to make her sit stably.",
        "source": "T24n1459_003:0648a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應與甎木枮，　　及草稕褥子；　唯此令尼坐，　　餘物並不應。",
        "translation": "You should give them wooden pallets and straw mattresses; only these should be given to the nun to sit on, but nothing else should be given.",
        "source": "T24n1459_003:0648a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尼來至寺中，　　應與其臥具；　令用中下者，　　上物無宜與。",
        "translation": "When a nun comes to the temple, he or she should be given bedding; the middling and lower should be used, but the higher things should not be given.",
        "source": "T24n1459_003:0648a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻苾芻尼，　　相對不說罪；　由於所犯過，　　愧恥難陳說。",
        "translation": "The monks and nuns don't tell each other about their faults; because of the faults they've committed, they're ashamed and embarrassed, and they can't explain them.",
        "source": "T24n1459_003:0648a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻尼有疑，　　於罪應為決；　尼須起尊敬，　　勿生輕慢心。",
        "translation": "If a monk or nun has doubts, he or she should decide the offense; the nun must show respect and not become disrespectful.",
        "source": "T24n1459_003:0648a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尼入僧寺時，　　至門應遣問；　報言無過者，　　隨意令其入。",
        "translation": "When a nun enters a monastery, he or she should be escorted to the door and asked; if he or she says there's nothing wrong, he or she is allowed to enter as he or she wishes.",
        "source": "T24n1459_003:0648a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲居蘭若人，　　應先善三藏；　日月星行次，　　皆應分別知。",
        "translation": "Those who want to live in a monastery should first become adept in the Tripiṭaka; they should discern the sun, moon, and stars and their order of travel.",
        "source": "T24n1459_003:0648a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在蘭若住，　　應畜油等物；　他索可相供，　　令賊歡喜故。",
        "translation": "If he lives in Laṅkā, he should store oil and other things; other people will ask for something to offer, so that thieves will be delighted.",
        "source": "T24n1459_003:0648a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先是工巧人，　　調度不應畜；　醫及解書者，　　針筆等聽持。",
        "translation": "Previously, these skilled people regulated what shouldn't be stored, and doctors and those who understand writing should listen to and hold needles and pens.",
        "source": "T24n1459_003:0648b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻住蘭若，　　應可務精勤；　出家勤最初，　　懈怠便招罪。",
        "translation": "A monk staying at Laṅkā should make effort; if he leaves home and makes the first effort, laziness will bring punishment.",
        "source": "T24n1459_003:0648b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　縱使行精進，　　正法亦須求；　離此見不明，　　失信乖修習。",
        "translation": "Even if one makes effort, the right teaching must be sought; apart from this view, uncertainty leads to a loss of faith and a failure to cultivate it.",
        "source": "T24n1459_003:0648b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若離正教授，　　無宜習定門；　能發狂亂心，　　損害禪支路。",
        "translation": "If someone departs from the right teaching, it's not appropriate to train in the way of concentration; this can cause a frantic mind and harm the branch path of meditation.",
        "source": "T24n1459_003:0648b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於其所住房，　　香花等芬馥；　床服咸應爾，　　異此心難定。",
        "translation": "In their dwelling, there are fragrant flowers and incense, and they all wear robes that make it difficult to concentrate the mind apart from this.",
        "source": "T24n1459_003:0648b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　僧家營作木，　　不可持燒染；　若是曲爛者，　　許用在無傷。",
        "translation": "The wood that monks make for their homes shouldn't be burned or defiled; if it's rotten, it's permissible to use it without harm.",
        "source": "T24n1459_003:0648b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若為他解勞，　　應須觀軌式；　彼人有伴屬，　　勘問乃相容。",
        "translation": "If you're relieving the labor of others, you must examine the way it's done; that person has companions, so you must investigate and find compatibility.",
        "source": "T24n1459_003:0648b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若見有女人，　　水火等漂害；　苾芻應拯濟，　　由悲故非犯。",
        "translation": "If he sees a woman who's been harmed by water and fire, the monk should rescue her; it's out of pity that he doesn't sin.",
        "source": "T24n1459_003:0648b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有人來問，　　云何活命緣？",
        "translation": "If someone comes along and asks, \"What are the conditions for living?",
        "source": "T24n1459_003:0648b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻隨事教，　　勿使違時俗。",
        "translation": "\"A monk follows the teaching of a certain thing, so don't act contrary to the customs of the time.",
        "source": "T24n1459_003:0648b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於寺門下，　　或在房簷前；　若有女人時，　　苾芻不應住。",
        "translation": "If it's under a temple gate or in front of a house eaves, the monk shouldn't stay while there's a woman there.",
        "source": "T24n1459_003:0648b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　已於五欲境，　　捨之而不愛；　是故常用心，　　念住勤修習。",
        "translation": "Having abandoned the five objects of desire and not craving them, they always use their mind and diligently cultivate mindfulness.",
        "source": "T24n1459_003:0648b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三世諸如來，　　獨覺聲聞眾；　皆依此道去，　　能至涅槃城。",
        "translation": "The tathāgatas and pratyekabuddhas of the three times all depart on this path, which leads them to the city of nirvāṇa.",
        "source": "T24n1459_003:0648b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　弟子觀師德，　　方可請為依；　師於弟子邊，　　問知應攝受。",
        "translation": "The disciple observes the teacher's virtue before he can ask for support, and the teacher comes to the disciple and asks if he knows he should be taken in.",
        "source": "T24n1459_003:0648b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　兩人隨有過，　　彼此並招愆；　為斯俱用心，　　慇懃好相察。",
        "translation": "Both have faults that bring guilt to one another, and they are both attentive and diligent about examining each other.",
        "source": "T24n1459_003:0648b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　師須戒行全，　　瞻病不悋法；　隨時常教授，　　當求如是師。",
        "translation": "The teacher must be complete in his moral conduct, observe illness, and not be stingy with the Dharma; he should always teach at appropriate times, and should seek such a teacher.",
        "source": "T24n1459_003:0648b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　弟子亦具戒，　　勤策性柔和；　恭敬於師長，　　禪誦無違闕。",
        "translation": "The disciple also possesses the precepts, diligently encourages gentleness, honors his teacher, and recites meditation without fail.",
        "source": "T24n1459_003:0648c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有緣自行去，　　或復見本師，　入外道歸俗，　　斯皆失依止。",
        "translation": "When a condition arises that makes him leave on his own, or when he sees his original teacher and joins a non-Buddhist group that goes back to the secular world, he loses his support.",
        "source": "T24n1459_003:0648c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又復隨一人，　　作捨依止念；　此即名為捨，　　進否善須知。",
        "translation": "Again, following one person, he'll create the mindfulness of relying on equanimity; this is called equanimity, and it's good to know whether it's advanced or not.",
        "source": "T24n1459_003:0648c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　呵責門徒時，　　不可便驅逐；　權聽寺內住，　　若改命歸房。",
        "translation": "When he rebukes his disciples, he mustn't summarily expel them; he has the right to listen to them while they live inside the temple, or he might change his mind and return to his room.",
        "source": "T24n1459_003:0648c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　說有五種呵：　　不語不教授；　不受其承事，　　遮善品捨衣。",
        "translation": "They say there are five kinds of rebukes: not speaking or teaching, not accepting their commitment, and refusing to give up clothing of good quality.",
        "source": "T24n1459_003:0648c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　呵責及受懺，　　皆須准教行；　此二若乖違，　　俱招惡作罪。",
        "translation": "Both reprimanding and accepting confession must be done in accordance with the teaching; if these two things are not followed, it will both result in the commission of a misdeed.",
        "source": "T24n1459_003:0648c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　嬾惰無孝心，　　麁言親惡友；　於師不恭敬，　　斯人勿懺摩。",
        "translation": "Being lazy and devoid of filial piety, they speak harshly of their intimate and evil friends; they don't respect their teacher, so they mustn't repent and reflect on him.",
        "source": "T24n1459_003:0648c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若擯於求寂，　　隨將上下衣，　并與濾水羅，　　師須善觀察。",
        "translation": "If he rejects those who seek quiescence, he'll place his upper and lower garments at his disposal and give them to a water filter, which the teacher must observe well.",
        "source": "T24n1459_003:0648c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若已受近圓，　　應與其六物；　必是難容忍，　　隨去不須留。",
        "translation": "If he has accepted six things that are near completion, he should give them to them; they must be difficult to tolerate, so he leaves as he goes and doesn't need to stay.",
        "source": "T24n1459_003:0648c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若離本依止，　　一宿不應行；　仍除滿五年，　　善明於戒律。",
        "translation": "If he leaves his original support, he shouldn't practice it for one night; he should still remove it for five full years and well understand the precepts.",
        "source": "T24n1459_003:0648c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如其向餘處，　　緣開五日停；　勤求依止師，　　若無不得住。",
        "translation": "If he goes to another place, stops for five days when the occasion arises, and diligently seeks a teacher to rely on, then he won't be able to stay there if he doesn't have one.",
        "source": "T24n1459_003:0648c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宜於彼師處，　　應為洗摩身；　或染或縫衣，　　斯為弟子法。",
        "translation": "At that teacher's place, he should cleanse his body and either dye or sew his robes, which is the disciple's method.",
        "source": "T24n1459_003:0648c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　軌範於作業，　　知量可應為；　養護起慈悲，　　不應令過分。",
        "translation": "He should standardize his work, know what's appropriate, and cultivate compassion, not allowing it to go beyond the limits.",
        "source": "T24n1459_003:0648c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　教讀依止師，　　報恩俱給侍；　然於二人處，　　恭敬有差殊。",
        "translation": "He relies on a teacher for instruction and reading, and he rewards both with kindness and service; yet there's a difference in how he respects the two of them.",
        "source": "T24n1459_003:0648c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若無教讀師，　　在處住無犯；　無依不應住，　　依止倍存心。",
        "translation": "If there's no teacher who teaches and reads, they'll abide in a place without transgression; without a support, they shouldn't abide, and they'll be doubly diligent in their reliance.",
        "source": "T24n1459_003:0649a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖斷煩惱盡，　　復善閑三藏；　若未滿十夏，　　仍須伏依止。",
        "translation": "Even though he's ended the afflictions, he'll still lay hold of the Tripiṭaka well; if he hasn't completed ten summers, he must still subdue and rely on it.",
        "source": "T24n1459_003:0649a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　去師兩驛半，　　半月一度禮；　此半八日禮，　　同處日須三。",
        "translation": "He travels two and a half kilometers to his teacher, paying homage once every half month; these half-eight days of homage should be three days in the same place.",
        "source": "T24n1459_003:0649a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於後夏內，　　依止師身亡；　宜應自守心，　　更互相監察。",
        "translation": "If a teacher who relies on him dies during the latter part of the summer, he should guard his own mind and monitor each other.",
        "source": "T24n1459_003:0649a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若至三月滿，　　處無依止人；　第二褒灑陀，　　不應於此住。",
        "translation": "If there's no one to rely on when the third month is up, the second poṣadha shouldn't stay here.",
        "source": "T24n1459_003:0649a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既為隨意事，　　勿更褒灑陀；　大聖順時開，　　即名為長淨。",
        "translation": "Since it's a matter of following one's heart, don't praise him any more; when a great sage opens his mind in accord with the seasons, it's called long purification.",
        "source": "T24n1459_003:0649a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　更互相教示，　　隨意聖遣為；　常開長淨門，　　對治眾罪業。",
        "translation": "They teach each other again, do as the sages wish, and always open the door to long purification to counteract all sins.",
        "source": "T24n1459_003:0649a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　寺中有客至，　　主等或時多；　十四五參差，　　應隨主人作。",
        "translation": "When guests arrive at a temple, there may be many hosts and so forth; fourteen or fifteen different kinds of monks should follow the host's actions.",
        "source": "T24n1459_003:0649a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若處客來多，　　舊住人數少；　主應隨彼客，　　共為褒灑陀。",
        "translation": "If many guests come from that place and the number of former residents is small, the host should follow those guests and share the prajñāsada.",
        "source": "T24n1459_003:0649a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　僧伽不和合，　　對一人守持；　若一人亦無，　　心念應言說。",
        "translation": "If the saṃgha isn't united, he'll guard it for one person; if there's not even one person, he should say so in his mind.",
        "source": "T24n1459_003:0649a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是作守持，　　苾芻衣及鉢；　并捨為分別，　　兼捨請應知。",
        "translation": "Thus do they guard, discriminate the monk's robe and bowl, and abandon them together; please know that they are abandoned together.",
        "source": "T24n1459_003:0649a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大眾若和合，　　得好人共住；　理應許說戒，　　心念亦隨聽。",
        "translation": "If the group is united, then good people can dwell together; it's reasonable to permit the precepts to be taught, and to mindfully follow along with them.",
        "source": "T24n1459_003:0649a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必若難緣生，　　有事開心念；　應知隨意事，　　准此亦應為。",
        "translation": "If difficult conditions must arise, there are things to awaken the mind; you should know the appropriate things, and you should do them according to this.",
        "source": "T24n1459_003:0649a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大眾可同心，　　應共作隨意；　異此應須喚，　　同行者為之。",
        "translation": "All people may be of one mind, and they should work together to achieve this intention; those who differ from this should be called upon to do so.",
        "source": "T24n1459_003:0649a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　將去隨意時，　　可有七八日；　應為告白事，　　令使眾人知。",
        "translation": "When they're about to go and do as they please, it could be seven or eight days; they should make a confession so that the people will know about it.",
        "source": "T24n1459_003:0649a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　壇場應秉法，　　界中或出外；　一界不別住，　　眾事悉應為。",
        "translation": "The altar should hold the Dharma, whether in or out of the [three] realms; one realm should not be separately abiding, and all the things should be done.",
        "source": "T24n1459_003:0649b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　二十十或五，　　及以四苾芻；　有此四僧伽，　　隨應秉諸法。",
        "translation": "Twenty-one or five, along with four monks, should maintain the Dharma as it accords with these four saṃgha.",
        "source": "T24n1459_003:0649b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不得以世尊，　　添彼僧伽數；　佛寶殊僧寶，　　秉法者應知。",
        "translation": "The Bhagavān should not be allowed to add to that saṃgha's number; those who hold the Dharma should know that the Buddha's treasures are superior to the saṃgha's treasures.",
        "source": "T24n1459_003:0649b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　出罪須二十，　　近圓十人等；　滿五應隨意，　　四為褒灑陀。",
        "translation": "There must be twenty excommunications, ten near and perfect people, and so forth; fill five as you like, and four are prajñāsadhas.",
        "source": "T24n1459_003:0649b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若處秉羯磨，　　白等如法成；　名住處應知，　　異斯非住處。",
        "translation": "If a monk follows the protocols of karma, he should know that he's called an abode, but anything other than that is not an abode.",
        "source": "T24n1459_003:0649b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻不啞默，　　口應宣法言；　是外道愚癡，　　誘誑諸無識。",
        "translation": "A monk who isn't silent and speaks the Dharma should be silent; this is the foolishness of non-Buddhists who lead people without consciousness.",
        "source": "T24n1459_003:0649b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻安居了，　　三事應隨意；　如不作此事，　　無難不應行。",
        "translation": "A monk who has understood the three things in his stable abode should do as he wishes; if he doesn't do this, there's nothing difficult that he shouldn't do.",
        "source": "T24n1459_003:0649b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖有見聞疑，　　別遇難緣起；　為護於身命，　　越海亦須行。",
        "translation": "Even though there are doubts about what they've seen and heard, and even though they encounter specific difficult conditions that arise, they must cross the ocean to protect their lives.",
        "source": "T24n1459_003:0649b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有王賊等，　　樂聞苾芻戒；　難緣應為說，　　無難不應為。",
        "translation": "If there are kings and thieves who are interested in hearing about the bhikṣu precepts, they should explain them for difficult reasons and do nothing without difficulty.",
        "source": "T24n1459_003:0649b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貧人有信心，　　富人無信敬；　慇懃樂聞戒，　　世尊開為說。",
        "translation": "The poor have faith, the rich have no faith and respect, and they are eager to hear about the precepts, so the Bhagavān will reveal them for them.",
        "source": "T24n1459_003:0649b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻善三藏，　　法師及病人；　眾中最大者，　　咸應放知事。",
        "translation": "The bhikṣus are good tripiṭaka teachers, Dharma masters, and patients, and the greatest of all should release their knowledge of the matter.",
        "source": "T24n1459_003:0649b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞有明三藏，　　遠從他處來；　鼓樂及幢幡，　　應迎兩驛半。",
        "translation": "They hear that there's a bright tripiṭaka that's come from far away, and they're greeted with music and banners two and a half kilometers away.",
        "source": "T24n1459_003:0649b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大眾鳴揵稚，　　隨力悉應迎；　美食解疲勞，　　請次宜應告。",
        "translation": "The great multitude sounds a gandharva, and they all respond according to their abilities; they are fed and relieved of their weariness, and they are invited to tell them in order.",
        "source": "T24n1459_003:0649b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　房舍及臥具，　　常不在分限；　給淨人相供，　　不差知眾事。",
        "translation": "Their living quarters and bedding are never limited, and they make offerings to pure people, knowing no difference between the many things they do.",
        "source": "T24n1459_003:0649b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　戒學佛所制，　　僧制眾同為；　乍可乖眾言，　　無違世尊教。",
        "translation": "The training of morality is established by the Buddha, and the saṃgha rules are shared by all; at first, it's possible to deviate from the words of the crowd, but it's not contrary to the teaching of the Bhagavān.",
        "source": "T24n1459_003:0649c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾意有多途，　　雖立還復廢；　豈有能迴改，　　無二大師言。",
        "translation": "â€œThere are many paths that people take, and even though they are established, they are again abolished; how could there be any possibility of changing them, without the words of two great masters?â",
        "source": "T24n1459_003:0649c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎　◎五月十六日，　　應作前安居；　六月十六日，　　苾芻為後夏。",
        "translation": "â€œOn the 16th day of the fifth month, the monk should make his retreat; on the 16th day of the sixth month, the monk should make his summer retreat.",
        "source": "T24n1459_003:0649c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　但有此二日，　　合作安居事；　中間但空住，　　不許作安居。",
        "translation": "â€œThere are only these two days when the monk cooperates in the retreat; in between, he only abides in emptiness; he's not allowed to retreat.â",
        "source": "T24n1459_003:0649c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻三月內，　　不許外遊行；　飛禽於夏時，　　亦不離巢去。",
        "translation": "During the third month, a monk is not allowed to wander outside, and flying birds don't leave their nests during the summer months.",
        "source": "T24n1459_003:0649c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若至五月初，　　逼夏須存意；　可於其住處，　　營飾等應為。",
        "translation": "If it's the beginning of May and summer approaches, he must pay attention to it; he may decorate his dwelling place as he sees fit.",
        "source": "T24n1459_003:0649c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既至十五日，　　總收於臥具；　差分臥具人，　　應須具德者。",
        "translation": "Once the fifteenth day arrives, he collects all the bedding, and the person who divides the bedding should be virtuous.",
        "source": "T24n1459_003:0649c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於欲瞋癡怖，　　眾過並皆無；　善知分未分，　　此即應差遣。",
        "translation": "Their desires, anger, delusion, and fears are all without error; they well understand that they've been assigned something that hasn't been assigned yet.",
        "source": "T24n1459_003:0649c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　毘訶羅波羅，　　應須告僧制；　冀令安樂住，　　勿使有虧違。",
        "translation": "Vaihārapāla, you must tell the saṃgha to regulate it, hoping to make it comfortable to stay and not to be at odds with it.",
        "source": "T24n1459_003:0649c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸人樂住者，　　不應為鬪諍；　於此受籌人，　　當須自審察。",
        "translation": "Those who live happily should not fight, and those who accept the offer here should examine for themselves.",
        "source": "T24n1459_003:0649c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　單白告大眾：　　今是十五日；　僧當共受籌，　　明作安居事。",
        "translation": "They simply told the crowd, \"Today is the fifteenth day; the saṃgha will collectively accept the offering, and the task of settling down will be accomplished.",
        "source": "T24n1459_003:0649c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從上行籌已，　　次可分房舍；　及以床臥具，　　皆從大至終。",
        "translation": "After the donation is taken from the top, the next step is to divide the dwelling into rooms and bedding, beginning with the great and ending with the bedding.",
        "source": "T24n1459_003:0649c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若近安居時，　　當須善觀察；　所行乞食境，　　無令事有廢。",
        "translation": "When you approach the monk's retreat, you must well examine it, making sure that nothing is left to chance when you go about begging for food.",
        "source": "T24n1459_003:0649c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於所住處，　　知有同行人；　具德有多聞，　　并淳善和合。",
        "translation": "If you know that there are fellow practitioners, that they're virtuous and well-versed, and that they're simply and well harmonized, you'll be able to stay in the same place.",
        "source": "T24n1459_003:0649c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不令煩惱起，　　若起即能除；　有此善伴處，　　宜應共居止。",
        "translation": "They won't allow afflictions to arise, but if they do, they'll remove them; with this good companion, it's appropriate to live and stay together.",
        "source": "T24n1459_003:0649c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　病藥并乞食，　　斯皆易可求；　無多婬女家，　　斯名善行處。",
        "translation": "Medicine for illness and alms are easy to obtain, and there are no many lustful women in their homes, which is called a good practice spot.",
        "source": "T24n1459_003:0650a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　當於隱屏處，　　蹲踞對苾芻；　口說安居文，　　作法應如是。",
        "translation": "In a secluded place, he'll crouch down and face the monk; he'll speak the words of peace and conduct himself in this way.",
        "source": "T24n1459_003:0650a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我施主某甲，　　侍人及作者；　我今於此處，　　作前夏安居。",
        "translation": "\"My donor, Mr. A., my attendant, and my donor, are here now, making my retreat for the summer before.",
        "source": "T24n1459_003:0650a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或云作後夏，　　有破裂修補；　我於此夏居，　　餘並同前說。",
        "translation": "Some say it's for the latter summer, but there's a rupture in the rest of my summer retreat, and the rest is the same as the previous explanation.",
        "source": "T24n1459_003:0650a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於此安居，　　無法界外宿；　現在無饒益，　　來世受泥犁。",
        "translation": "If I had stayed here, I wouldn't have stayed beyond the Dharma realm; I wouldn't have received any benefit in the present, and I would have been subject to the mire of the future.",
        "source": "T24n1459_003:0650a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若為寺等事，　　并諸雜福業；　制底眾食緣，　　及以出罪等。",
        "translation": "If I were to do things like work at a temple or other complex meritorious activities, establish the conditions for numerous meals, and commit crimes, then I'd be forced to do so.",
        "source": "T24n1459_003:0650a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尼違八敬法，　　為欲除其罪；　或為下三眾，　　受戒等須看。",
        "translation": "Those nuns violate the eight precepts in order to remove their sins, or they might accept the precepts for the lower three groups of people who need to see them.",
        "source": "T24n1459_003:0650a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若諸俗人輩，　　有請喚等緣；　苾芻察時宜，　　須時應往赴。",
        "translation": "If there are secular people who are called upon for such reasons, then a monk should examine the appropriate time and go there when necessary.",
        "source": "T24n1459_003:0650a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三寶及父母，　　師主等有事；　并諸病患緣，　　皆請七日去。",
        "translation": "The Three Treasures, parents, teachers, masters, and other affairs, as well as other causes of illness, are all invited to leave for seven days.",
        "source": "T24n1459_003:0650a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一日二日等，　　乃至四十夜；　苾芻應可去，　　勿令前事闕。",
        "translation": "From one day, two days, and so forth, up to forty nights, a monk should be allowed to go, so that the previous situation won't be missed.",
        "source": "T24n1459_003:0650a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有如法事，　　察知非是虛；　僧伽共許差，　　隨情可行去。",
        "translation": "If there are such things as the teaching, and they are discerned not to be false, the saṃgha will permit them to go as they see fit.",
        "source": "T24n1459_003:0650a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　仍於一夏中，　　過半不在外；　為斯但四十，　　若過罪便傷。",
        "translation": "Still, during the summer, more than half of it isn't outside; for this reason, it's only forty, and if it's more than that, then he'll be harmed.",
        "source": "T24n1459_003:0650a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　飲食若有闕，　　醫藥復難求；　全無供侍人，　　去時非破夏。",
        "translation": "If there's a shortage of food and drink, medicine is difficult to obtain, and there's no one to serve, so when he leaves, it won't be a summer break.",
        "source": "T24n1459_003:0650a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若處有八難，　　及婬女黃門，　并惡獸等緣，　　行無破夏罪。",
        "translation": "If there are the eight difficult circumstances, a woman who is promiscuous, a yellow door, or a dangerous animal, then he's guilty of not ruining the summer retreat.",
        "source": "T24n1459_003:0650a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有罪惡人，　　聞來破和眾；　恐為非樂事，　　出去者無傷。",
        "translation": "If a guilty or evil person hears about it and breaks up the peace, they're afraid it'll be something unpleasant, and they won't be harmed if they go out.",
        "source": "T24n1459_003:0650b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　聞彼鬪諍人，　　知是己親友；　不往諫得罪，　　停無破夏愆。",
        "translation": "When they hear about that person in dispute, they know they're their friend; they don't go to remonstrate with them and are offended, but they stop without committing the summer offense.",
        "source": "T24n1459_003:0650b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若共他作契，　　向某處安居；　至日不赴期，　　苾芻招惡作。",
        "translation": "If he makes a promise with another person and goes to a certain place to stay there, then the monk won't show up when the day arrives, which will cause the monk to do misdeeds.",
        "source": "T24n1459_003:0650b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻若守持，　　七日或多日；　在外如逢難，　　便住者隨聽。",
        "translation": "If a monk observes this rule for seven or more days, then he'll listen to those who are outside if they encounter difficulty in staying put.",
        "source": "T24n1459_003:0650b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若無有餘緣，　　留住經多日；　輒違於本限，　　得罪并破夏。",
        "translation": "If he stays for many days without any other reason, then he'll easily violate the original limit and incur a sin and ruin the summer retreat.",
        "source": "T24n1459_003:0650b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　結界有多途，　　略言其四種；　任現所須者，　　隨事今當說。",
        "translation": "There are many ways to set boundaries, and I'll briefly describe four of them; whatever is necessary for the present, I'll explain it now according to the situation.",
        "source": "T24n1459_003:0650b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大齊兩驛半，　　減此任當時；　四方應置標，　　山河樹等記。",
        "translation": "The two and a half stations of the Great Qi are less than that at the time; the four directions should be marked, and the mountains, rivers, and trees should be recorded.",
        "source": "T24n1459_003:0650b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　可於前相中，　　乃至於住處；　除村并勢分，　　結大界應知。",
        "translation": "From the previous examples up to the dwelling place, except for the village and the influencing part, the great circle should be known.",
        "source": "T24n1459_003:0650b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大眾盡須集，　　一人秉羯磨；　白二無差舛，　　斯名結界成。",
        "translation": "When all the people must be gathered, one person should hold the karma; these two are called the completion of a boundary when there's no difference between the white and white.",
        "source": "T24n1459_003:0650b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　又為不離衣，　　依界秉羯磨；　欲令安樂住，　　元由老病緣。",
        "translation": "Also, for the sake of not parting with the garments, they rely on the karma of the realm; the desire to live in comfort is largely the result of old age and illness.",
        "source": "T24n1459_003:0650b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖復離三衣，　　界中別處宿；　除其村勢分，　　隨處任遊行。",
        "translation": "Even though he's still free of the three garments, he stays elsewhere in the realm and travels around freely except for his village's portion of influence.",
        "source": "T24n1459_003:0650b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於前大界內，　　欲作小壇場；　應為白二結，　　先須解大界。",
        "translation": "If he wants to create a small altar site within the previous large element, he should make a white twofold binding, first untying the large element.",
        "source": "T24n1459_003:0650b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若欲結小界，　　置標相同前；　名曰曼荼羅，　　於斯任秉法。",
        "translation": "If he wants to tie up a small altar site, he'll place it in the same place as the previous one, which is called a maṇḍala, and he'll follow the rules here.",
        "source": "T24n1459_003:0650b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先結於小場，　　次結於大界；　依如是次第，　　結界者應知。",
        "translation": "First, he'll tie the small altar site, then he'll tie the large element; in this order, he should know the binding of the elements.",
        "source": "T24n1459_003:0650b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眾咸死轉根，　　或時俱捨戒；　或盡出界外，　　明相過不還。",
        "translation": "All sentient beings sometimes abandon the precepts together when they die and develop their faculties, or they may leave the realm altogether and not return after learning the signs.",
        "source": "T24n1459_003:0650b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或時為白四，　　大眾同心捨；　有斯五種別，　　捨大界應知。",
        "translation": "Sometimes they confess four things, and the great masses confess with one mind; these five kinds of distinctions should be known as the confession of the great element.",
        "source": "T24n1459_003:0650c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡欲結諸界，　　標相復須知：　一樹應兩標，　　分半為其界；　或時以一樹，　　為其四界標；　四分各相當，　　五分便不許。",
        "translation": "Whenever someone wants to define the elements, they should also know their signs: a tree should have two signs, and half of them should be their elements; sometimes a tree should be the sign of four elements; each of the four parts should be equivalent, but the fifth part shouldn't be allowed.",
        "source": "T24n1459_003:0650c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　向下兩驛半，　　向上數亦然；　齊山頂樹梢，　　或至籬牆上。",
        "translation": "It's halfway down a hill and halfway up a tree, or it might reach the top of a hedge.",
        "source": "T24n1459_003:0650c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　種種莊嚴具，　　皆悉在隨聽；　瑩飾大師形，　　令施福增長。",
        "translation": "They are all adorned with various implements that are listened to, and they adorn the form of the great teacher so that generosity and merit may increase.",
        "source": "T24n1459_003:0650c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不許安耳璫，　　及以足鳴釧；　斯為女人飾，　　勿累大師形。",
        "translation": "Don't place your ears in disgrace, and don't wear a foot-ringing bracelet; this is a woman's adornment, so it won't encumber the form of the great teacher.",
        "source": "T24n1459_003:0650c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲使眾人散，　　鼓樂可潛聲；　供具悉應收，　　無令有虧失。",
        "translation": "They want the crowd to disperse, so the drums and music can be heard, and the offerings should all be collected so that nothing is lost.",
        "source": "T24n1459_003:0650c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或時大眾集，　　諠鬧出高聲；　不知時至中，　　應鳴蠡擊鼓。",
        "translation": "Sometimes a large crowd gathers, making a loud noise; unaware that it's in the midst of the crowd, they should sound the calabash and beat the drum.",
        "source": "T24n1459_003:0650c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若分亡人物，　　眾大卒難為；　十人為一朋，　　或至百千數。",
        "translation": "If they divide the dead into groups, it's difficult for a large group of people to do so; ten people may become one group, or even a hundred thousand.",
        "source": "T24n1459_003:0650c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　各分取大段，　　隨人更細分；　得分未分時，　　若死須分別。",
        "translation": "Each part is taken in large pieces, and each person is further divided into smaller pieces; when the parts are obtained and not yet divided, they must be separated if they are to die.",
        "source": "T24n1459_003:0650c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　分竟身方死，　　物入四方僧；　若未細分時，　　當朋人合得。",
        "translation": "After dividing it, his body will die, and his belongings will enter the four directions of the saṃgha; if they haven't been divided into smaller parts, then they'll be joined with others.",
        "source": "T24n1459_003:0650c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有請苾芻處，　　并喚苾芻尼；　食罷與施時，　　持財安眾首。",
        "translation": "When the bhikṣu is invited to a place, he calls the bhikṣuṇīs, and when he finishes his meal and gives it as alms, he takes his wealth and puts it at the head of the congregation.",
        "source": "T24n1459_003:0650c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此應為兩分，　　或隨施主心；　飲食可平分，　　佛亦咸同此。",
        "translation": "This should be divided into two parts, either according to the donor's heart or because the food and drink can be equally divided, even as the Buddha shares this.",
        "source": "T24n1459_003:0650c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻分施物，　　等分應與尼；　式叉摩拏尼，　　應二分與一。",
        "translation": "The bhikṣu's portion of the offering should be given equally to the nun, and the Śikṣamāṇā's portion should be two and one.",
        "source": "T24n1459_003:0650c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　將欲圓具人，　　亦二分與一；　求寂求寂女，　　三分一應知。",
        "translation": "A person who wants to complete a gift should also give two parts to one, and a woman who seeks quiescence and seeks quiescence should know the three parts as one.",
        "source": "T24n1459_003:0651a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有多苾芻，　　苾芻尼眾少；　應計人頭數，　　無宜中半分。",
        "translation": "If there are many monks and nuns, the number of monks and nuns should be small; the number of heads should be counted, but it's not appropriate to divide it by half.",
        "source": "T24n1459_003:0651a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若至大會日，　　請像入村城；　能令災橫除，　　莊嚴為生福。",
        "translation": "If he were to invite an image into a village or town on the day of the assembly, it would remove calamity and adorn it for the benefit of sentient beings.",
        "source": "T24n1459_003:0651a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遍洒康莊道，　　嚴儀巷陌中；　散花懸妙幡，　　雅麗如天苑。",
        "translation": "It's scattered all over the well-adorned roads and decorated in the lanes and streets, scattered with flowers and draped with marvelous banners, elegant as a heavenly garden.",
        "source": "T24n1459_003:0651a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　栴檀及龍腦，　　沈水香普薰；　隨風處處行，　　聞者生欽仰。",
        "translation": "The fragrance of sandalwood and nāga, sinking water, pervades the air; it travels with the wind everywhere, and those who hear it come to admire it.",
        "source": "T24n1459_003:0651a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鳴螺擊鼗鼓，　　撞鍾告四方；　屯聚震鴻音，　　聽者生隨喜。",
        "translation": "Sounding a conch, striking a drum, and striking a bell to announce it to the four directions, the congregation vibrates with a resounding sound, and those who hear it are delighted.",
        "source": "T24n1459_003:0651a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鼓樂無停息，　　高聲出雲表；　旃旐遍縈羅，　　斯名大法會。",
        "translation": "The drums and music never stop, and their voices rise out of the clouds; the flags wreath the land, which is called the great dharma assembly.",
        "source": "T24n1459_003:0651a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大旗有五種，　　鯨牛妙翅龍，　師子畫幡旗，　　咸持以供養。",
        "translation": "There are five kinds of large banners, whales, bulls, and winged dragons, and the lion's son draws banners and banners, which they all carry to make offerings.",
        "source": "T24n1459_003:0651a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　人眾皆陪從，　　法俗兩相依；　如是勝莊嚴，　　引導如來入。",
        "translation": "All the people accompany them, relying on both the Dharma and the secular, such is the splendor and adornment that guides the Tathāgata into the hall.",
        "source": "T24n1459_003:0651a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　由佛入村城，　　敬心興供養；　八部天龍等，　　能除眾毒惡。",
        "translation": "As the Buddha enters the village, offerings are made with reverence, and the eight part celestials and dragons rid themselves of all the poisonous evil.",
        "source": "T24n1459_003:0651a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　因斯獲財利，　　大眾賣應分；　准價上座知，　　善觀其好惡。",
        "translation": "Because of this, he obtains wealth and profit, a great multitude of people sell their fair share, and the worthy superior knows and well observes their likes and dislikes.",
        "source": "T24n1459_003:0651a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有所須人，　　隨情當上價；　還價未了者，　　無宜著此衣。",
        "translation": "If there's someone who needs it, they'll pay the higher price as they see fit; if they haven't paid the price in return, it's inappropriate to wear this robe.",
        "source": "T24n1459_003:0651a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　敬持妻子等，　　三寶隨一施；　不可為作價，　　當隨施主心。",
        "translation": "Respectfully maintaining wives and so forth, he gives one of the three treasures; don't set a price for it, but follow the donor's heart.",
        "source": "T24n1459_003:0651a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　歌舞伎樂處，　　苾芻令作時；　諸有護戒人，　　不應言汝戲。",
        "translation": "When the monks make music and song, they shouldn't say you're playing games when there are people who protect the precepts.",
        "source": "T24n1459_003:0651a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應告言賢首，　　汝可好用心；　供養於大師，　　勿生於嬾墮。",
        "translation": "You should tell Bhadraśri that you may pay good attention to making offerings to the teacher, so that you don't become lazy.",
        "source": "T24n1459_003:0651a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　窣都波掛幡，　　不應將物釘；　元初興造日，　　安橛在隨聽。",
        "translation": "Hang a banner in the stūpa, don't pin it to anything; the first day it was built, it was placed in a peg according to your ear.",
        "source": "T24n1459_003:0651b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　塔上然燈供，　　苾芻不自昇；　有緣須上者，　　應可令求寂。",
        "translation": "The stūpa is a lantern offering, but the monk doesn't ascend by himself; those who have need of it should seek its cessation.",
        "source": "T24n1459_003:0651b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　餘人無可求，　　香水洗雙足；　苾芻應自上，　　供養大師心。",
        "translation": "There's nothing for the rest of us to seek, so we wash our feet with perfume; the monks should ascend on their own and make offerings to the mind of the great teacher.",
        "source": "T24n1459_003:0651b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　造寺三五層，　　香臺或五七；　或可隨情作，　　小寺五三房。",
        "translation": "He built a temple of three or five stories, with an incense stand or five or seven; he might build a small temple of five or three rooms as he sees fit.",
        "source": "T24n1459_003:0651b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　略論處中寺，　　於東西兩邊；　三層各九房，　　房中寬丈二。",
        "translation": "The temple in the middle of the monastery is situated on the east and west sides, with three stories and nine rooms each, and the middle of the room is two zhang wide.",
        "source": "T24n1459_003:0651b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　後面亦三層，　　上取三房地；　中擬安尊像，　　簷前不廢行。",
        "translation": "At the back, there are three stories, and the upper three rooms are taken from the grounds; in the middle, an image of the venerable is planned to be installed, and the front of the eaves is not abandoned.",
        "source": "T24n1459_003:0651b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或可此簷前，　　從地為重閣；　隨安大尊像，　　每日設香花。",
        "translation": "Perhaps this canopy could be approached from the ground and made into a double pavilion; an image of the great honored one could be installed at random, and incense and flowers could be placed daily.",
        "source": "T24n1459_003:0651b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　前面兩房地，　　從下作門樓；　門在下層間，　　小作應牢固。",
        "translation": "In front of it, there are two rooms and a ground, and from below it's made into a gatehouse; the door is between the lower stories, and the small work should be secure.",
        "source": "T24n1459_003:0651b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　入門於一角，　　閣道上三層；　出上並平頭，　　四邊皆絕壁。",
        "translation": "He enters at one corner, ascends three stories above the pavilion; he exits and levels off, and his four sides are cut off from the wall.",
        "source": "T24n1459_003:0651b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　尼寺限三層，　　香臺隨至五；　寺中房軌則，　　准苾芻應知。",
        "translation": "The nun's temple is limited to three stories, and the incense tray follows up to five; the temple's inner rooms are regulated in ways that should be known by the Bhikṣu.",
        "source": "T24n1459_003:0651b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛像形虧壞，　　尊經字滅磨；　拭却可重修，　　令其更增勝。",
        "translation": "The Buddha's image is deformed, and the words of the scriptures are obliterated; clean it up and restore it, making it even more remarkable.",
        "source": "T24n1459_003:0651b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　制底尊儀影，　　新壇足不蹈；　必有緣須過，　　可誦聖伽他。",
        "translation": "The image of the Bhagavān's deportment is shaped, but his feet don't touch the new altar; there must be a reason for it to pass, so he can recite the holy name of the buddha.",
        "source": "T24n1459_003:0651b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻乞食時，　　有人無簡別；　佛想喚為佛，　　持物而相施。",
        "translation": "When a monk begs for food, there are people without distinctions who are summoned by the Buddha's thoughts to become buddhas, and they carry things and give them to one another.",
        "source": "T24n1459_003:0651b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻應問彼，　　詳審觀其意：　汝喚我為佛，　　為是兩足尊；　汝喚為法者，　　為是盡苦法；　汝喚為僧者，　　為是真聖眾。",
        "translation": "The monk should ask them to examine their thoughts carefully: 'You called me Buddha, because I'm a two-legged honored one; you called me Dharma, because it's the Dharma that ends suffering; and you called me saṃgha, because I'm a truly noble congregation.'",
        "source": "T24n1459_003:0651b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既問決知已，　　隨彼所樂情；　施者應受之，　　此皆無有過。",
        "translation": "Once you've asked, you'll definitely know, according to their inclinations, that the donor should accept it, and there's nothing wrong with that.",
        "source": "T24n1459_003:0651c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　假令唯一尼，　　受請向他舍；　行初留一座，　　為擬苾芻來。",
        "translation": "Suppose the only nun is invited to another house, and he leaves a seat at the beginning of his practice in anticipation of a monk's coming.",
        "source": "T24n1459_003:0651c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻應此座，　　求寂亦宜居；　不解願伽他，　　苾芻尼為作。",
        "translation": "The bhikṣu agrees to this seat, seeks peace, and is fit to abide there; he doesn't understand the vow for the other, but the bhikṣu does it for the nun.",
        "source": "T24n1459_003:0651c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若無執事人，　　隨緣詣村落；　獲利應須寄，　　得人方遣持。",
        "translation": "If there's no one to take charge of the monk's household, he'll go to the village as he sees fit; he'll obtain a benefit that must be sent, and then he'll obtain someone to send and maintain it.",
        "source": "T24n1459_003:0651c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　上明諸雜緣，　　多是生存事；　下論身死後，　　焚葬事須知。",
        "translation": "The above explains the various conditions that are often a matter of survival, and the following discusses the burning and burial of a body after it dies.",
        "source": "T24n1459_003:0651c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻身既死，　　告眾鳴健稚；　須喚輿屍人，　　柴薪用僧物。",
        "translation": "After the bhikṣu's body dies, he tells the crowd to call out to the young; he must summon the person who will carry the body, and he uses the monks' property for firewood and fuel.",
        "source": "T24n1459_003:0651c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　香花幡鼓樂，　　送至焚屍林；　親識及門徒，　　愍念相隨去。",
        "translation": "Scented flowers, banners, drums, and music are sent to the burning corpse's grove; relatives, friends, and disciples kindly follow along.",
        "source": "T24n1459_003:0651c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善親應可燒，　　薪火須豐足；　助以旃檀等，　　隨有灌酥油。",
        "translation": "\"Good relatives may be burned, and firewood must be plentiful; help them with sandalwood and so forth, and follow them with ghee.",
        "source": "T24n1459_003:0651c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身瘡若有蟲，　　埋時勿令損；　或安於露地，　　草葉覆其身。",
        "translation": "If there are worms in his body, don't let them damage him when he buries him; perhaps he'll put him on bare ground, where grass and leaves will cover his body.",
        "source": "T24n1459_003:0651c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一一身軀內，　　八萬種蟲居；　隨身共死生，　　雖燒亦無過。",
        "translation": "Inside one body, 80,000 kinds of worms live there, and even though they're burned, it's not wrong to share birth and death with the body.",
        "source": "T24n1459_003:0651c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應持上下衣，　　覆屍令好密；　自餘衣鉢等，　　准法可應分。",
        "translation": "He should carry his upper and lower garments, cover the corpse well and closely, and divide it according to the rules for the rest of his robes and bowls.",
        "source": "T24n1459_003:0651c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　燒時隨處坐，　　略誦無常經；　三啟用心聽，　　各須生厭離。",
        "translation": "Sitting anywhere while being burned, he recites the scripture on impermanence; he listens attentively to the three revelations, and each should become disillusioned.",
        "source": "T24n1459_003:0651c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸行盡無常，　　緣生法皆滅；　剎那不暫住，　　如露被風驚。",
        "translation": "All conditioned phenomena arise and cease, and moments don't last forever, like dew startled by the wind.",
        "source": "T24n1459_003:0651c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　遍觀諸世間，　　無有長存者；　咸趣無常海，　　共被死波漂。",
        "translation": "Pervading the world, there's no one who remains forever, and they all sink into the sea of impermanence, drifting together in the waves of death.",
        "source": "T24n1459_003:0651c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　四大堅性等，　　此不可遷移；　生者必無常，　　死王威力大。",
        "translation": "The four elements are resolute and equal, but they can't be displaced; birth must be impermanent, and death is a powerful king.",
        "source": "T24n1459_003:0652a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無常不簡擇，　　善惡戒多聞；　一種皆歸死，　　不論凡與聖。",
        "translation": "Impermanent and not discriminated, well-versed in the virtues and vices of morality, they all return to death, whether mortal or noble.",
        "source": "T24n1459_003:0652a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛及緣覺，　　聲聞弟子眾；　尚捨無常身，　　何況諸凡夫。",
        "translation": "The buddhas and pratyekbuddhas, the disciples of the śrāvakas, still abandon the body of impermanence, so why wouldn't ordinary people?",
        "source": "T24n1459_003:0652a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯法誦已，　　方說特崎拏；　還歸洗手足，　　制底行旋遶。",
        "translation": "After reciting this teaching, they then say, \"Tejñāna,\" return to washing their hands and feet, and circumambulate them in order to control their bottom.",
        "source": "T24n1459_003:0652a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或可連身洗，　　更復著餘衣；　去時持故衣，　　勿損鮮花服。",
        "translation": "He might wash his body and put on some other clothing; when he leaves, he'll carry his old clothes and not damage his fresh-flower robe.",
        "source": "T24n1459_003:0652a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸行無常等，　　牟尼之所說；　行思歸寺中，　　當息慳貪想。",
        "translation": "\"Such things as conditioned phenomena and impermanence are explained by Muni; when he returns to the temple, he should stop thinking about stinginess and greed.",
        "source": "T24n1459_003:0652a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有諸衣物，　　應隨阿笈摩；　佛子共平分，　　作法如常制。",
        "translation": "All the clothes you own should be followed by the āgama, and the Buddha's disciples should share them equally, working according to the usual rules.",
        "source": "T24n1459_003:0652a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　揵稚誦三啟，　　禮制底行籌；　及為羯磨時，　　五時皆得分。",
        "translation": "He recites the three invocations, follows the rules of propriety, and divides them among the five times when he performs the ritual.",
        "source": "T24n1459_003:0652a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不應眾未聚，　　輒共分亡物；　上座及行終，　　應行其兩分。",
        "translation": "They shouldn't share the deceased's property before the congregation has gathered; the superior monk and the practitioner should perform their two parts at the end of the service.",
        "source": "T24n1459_003:0652a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作斯定記已，　　然後共分財；　設後客人來，　　不應與其分。",
        "translation": "After making this prediction, then they'll share their possessions together; even if guests come later, they shouldn't share with them.",
        "source": "T24n1459_003:0652a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我死方持與，　　慳心作此言；　准斯無決情，　　死後宜歸眾。",
        "translation": "I'll give it to them until I die, but I'll say this with a stingy heart; based on this lack of resolve, it's better to return it to the others after death.",
        "source": "T24n1459_003:0652a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　決情無悋意，　　生存現付與；　隨心施別人，　　此等成依法。",
        "translation": "Being determined and having no desire to be stingy, he gives his life away now; he gives it to others as he wishes, and this becomes the Dharma.",
        "source": "T24n1459_003:0652a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　俗死多悕望，　　出家不合然；　如為顧戀心，　　是日增生死。",
        "translation": "Ordinary people often hope for death, but renunciant monks don't; if they care about it, it increases birth and death every day.",
        "source": "T24n1459_003:0652a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若苾芻身死，　　自他財雜亂；　宜應將鉢等，　　置在於僧前。",
        "translation": "If a monk's body dies and his possessions are mixed up with his own, it's appropriate to put his bowl and so forth in front of the saṃgha.",
        "source": "T24n1459_003:0652a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀知是亡物，　　即應如法分；　所有諸寶等，　　准教而處分。",
        "translation": "Seeing that this is the property of the deceased, it should be divided according to the teaching, and all the treasures should be disposed of according to the teaching.",
        "source": "T24n1459_003:0652b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻身若死，　　還合苾芻分；　當時無苾芻，　　尼眾應分取。",
        "translation": "If a bhikṣu's body dies, it's returned to the bhikṣu's portion; at the time, there was no bhikṣu, but the nuns should take their share.",
        "source": "T24n1459_003:0652b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻尼若死，　　苾芻尼合得；　如其尼若無，　　苾芻應作主。",
        "translation": "If a bhikṣu's nuns die, the bhikṣu's nuns will be combined; if his nuns were nonexistent, the bhikṣu would be in charge.",
        "source": "T24n1459_003:0652b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　俗舍苾芻死，　　無僧由俗人；　宜可與先來，　　俱來與求者。",
        "translation": "If a monk or nun in a secular house dies, then a secular person who has no saṃgha should come with the previous monk or nun to the beggar.",
        "source": "T24n1459_003:0652b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　兩人俱並乞，　　斯應與二人；　或隨施主情，　　與者宜當受。",
        "translation": "If two people are begging together, then they should give to both; perhaps according to the donor's wishes, the donor should accept it.",
        "source": "T24n1459_003:0652b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或時近多寺，　　此家苾芻亡；　隨其頭所指，　　合得亡衣鉢。",
        "translation": "Sometimes there are many temples nearby where a monk from that family has died, and according to what his head says, he'll be given a bowl or robe for the deceased.",
        "source": "T24n1459_003:0652b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻負他債，　　忽爾卒身亡；　應須細問知，　　眾用亡衣與。",
        "translation": "A monk who owes a debt to another suddenly dies; he should ask carefully about it, and the people will use the dead robe to give it to him.",
        "source": "T24n1459_003:0652b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若是知事人，　　為眾取他物；　應將眾物與，　　還債善籌量。",
        "translation": "If someone who knows the right thing to do takes another's goods for the crowd, they should give them to the crowd and repay the debt with a good judgment.",
        "source": "T24n1459_003:0652b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡是知事人，　　向他邊取物；　宜應告上座，　　保券可分明。",
        "translation": "Anyone who knows the right thing to do and takes something from another side should tell the head monk that the guarantee can be clearly identified.",
        "source": "T24n1459_003:0652b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　送死幡衣等，　　持來施苾芻；　受取理無傷，　　令其福增長。",
        "translation": "Sending death banners and other garments, he gives them to a monk; accepting them is reasonable and unhurt, and it causes his fortune to grow.",
        "source": "T24n1459_003:0652b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若彼情生悔，　　還來索此衣；　苾芻應盡還，　　勿令憂火迫。",
        "translation": "If they become remorseful and come back for these robes, the monk should return them in full, so that they won't be persecuted by fire and sorrow.",
        "source": "T24n1459_003:0652b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　被舉共好人，　　同居隨一死；　亡衣好人得，　　舉者不應分。",
        "translation": "A good person who's been held up in common with another good person will die together; a good person who dies will get the robe, but the person who held it up shouldn't share it.",
        "source": "T24n1459_003:0652b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若無持戒人，　　被舉有人死；　雖舉未蒙解，　　宜應共分物。",
        "translation": "If there's no one who upholds the precepts, then someone who's been lifted up will die; even though they've been lifted up but not yet understood, it's better to share the goods.",
        "source": "T24n1459_003:0652b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既有明書券，　　出物與他人；　為眾若身亡，　　眾應依契索。",
        "translation": "Now that there's a certificate, he gives it to another; if he dies for the sake of the crowd, the crowd should rely on the agreement.",
        "source": "T24n1459_003:0652b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　合入眾與眾，　　制底亦皆然；　堪王送與王，　　仍除刀箭等。",
        "translation": "He combines them with the crowd, and so does the restraining authority; he sends them to the king, removing swords and arrows and so forth.",
        "source": "T24n1459_003:0652b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應用此等物，　　作刀子及針；　餘並現前分，　　本物非分限。",
        "translation": "Using these things, he makes a knife and a needle; the rest are clearly distinguished, and the original is not limited to them.",
        "source": "T24n1459_003:0652c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人宣一頌，　　依佛所說經；　由法語得財，　　此物宜應受。",
        "translation": "If someone pronounces a verse, relying on a sutra taught by the Buddha, and obtains wealth from the words of the Dharma, it's appropriate to accept this object.",
        "source": "T24n1459_003:0652c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　牟尼有二法，　　教及證應知；　教是阿笈摩，　　施法應請分。",
        "translation": "There are two things about Muni that should be known, teaching and realization; the teaching is the āgama, so you should ask for a share of the gift.",
        "source": "T24n1459_003:0652c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安居若過半，　　便有捨戒人；　此際苾芻亡，　　應與其人分。",
        "translation": "If he's more than halfway through his retreat, then there'll be someone who renounces the precepts; at that point, the monk dies, so he should share it with that person.",
        "source": "T24n1459_003:0652c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　造佛窣覩波，　　蘇迷盧等量；　四畔基牢固，　　乃至安寶瓶。",
        "translation": "He creates a stūpa of the Buddha, equal in number to Sumeru, which has a firm foundation on its four sides up to the placement of a jeweled vase.",
        "source": "T24n1459_003:0652c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　輪一二三四，　　如次果應知；　凡夫具德人，　　瓦頭為制底。",
        "translation": "The results of one, two, three, and four wheels should be known in this order; for ordinary virtuous people, the tile-head is the base of the monk's retractable penis.",
        "source": "T24n1459_003:0652c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若作佛制底，　　輪蓋無定數；　過千妙高量，　　獲福乃無邊。",
        "translation": "If he were to become a buddha's caitya, his wheel cover would be indeterminate, and his merit would be limitless as it exceeds a thousand wonderfully lofty limitations.",
        "source": "T24n1459_003:0652c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　獨覺麟喻佛，　　不過十三槃；　於彼相輪頭，　　寶瓶不合置。",
        "translation": "The solitary realizer is a metaphorical Buddha, but it's only 13 nirvāṇas, and at the head of that wheel of characteristics, the jeweled vase doesn't fit.",
        "source": "T24n1459_003:0652c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　制底中安佛，　　兩邊二弟子；　餘聖次為行，　　諸凡應在外。",
        "translation": "A buddha is placed in the caitya, with two disciples on either side; the other sages then take action, and ordinary people should be outside.",
        "source": "T24n1459_003:0652c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　次明看病事，　　更互可應為；　藥直若貧無，　　僧物宜當與。",
        "translation": "Next, he explains the mutual necessity of treating the sick; if there's no medicine for the poor, the saṃgha's goods should be given.",
        "source": "T24n1459_003:0652c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若病人來乞，　　洗鉢盛淨水；　應誦佛伽他，　　三遍存心呪。",
        "translation": "If a sick person comes to ask for medicine, he should wash his bowl and fill it with clean water; he should recite the Buddhajata Dhāraṇī, a spell that keeps his mind alive three times.",
        "source": "T24n1459_003:0652c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻為受藥，　　持將與病人；　如其授者無，　　自取亦聽服。",
        "translation": "The monk takes the medicine for the patient and presents it to him; if the donor doesn't have one, he takes it himself and accepts it.",
        "source": "T24n1459_003:0652c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不應就病人，　　教化取衣鉢；　假令雖捨施，　　大眾不應分。",
        "translation": "He shouldn't teach or instruct the sick person to take a bowl or robe; even if he were to dispense it, the large crowd wouldn't share it.",
        "source": "T24n1459_003:0652c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　施者及受者，　　教化者情貪；　三俱非淨心，　　此不應受用。",
        "translation": "The donor and the recipient, as well as the instructor, have cravings for these three things, which are not pure in mind and shouldn't be taken.",
        "source": "T24n1459_003:0652c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　病者若樂欲，　　供養於佛僧；　應用好衣等，　　守持麁惡服。",
        "translation": "If a sick person wants to, he makes offerings to the Buddha and Saṃgha; he uses nice clothes and so forth, but keeps his coarse and unpleasant clothing.",
        "source": "T24n1459_003:0653a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若彼貧無物，　　教化可應為；　隨情施少多，　　令其信增長。",
        "translation": "If he's poor and lacks things, he can teach and educate them; he gives as little or as much as his heart desires, so that his faith will grow.",
        "source": "T24n1459_003:0653a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至一盤花，　　或可持瓶水；　應隨病人語，　　供養使心歡。",
        "translation": "Even a dish of flowers, or perhaps a vial of water, should be offered according to the words of the patient, making his heart happy.",
        "source": "T24n1459_003:0653a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於己財物，　　慳心苦難捨；　宜應用心勸，　　令彼供三尊。",
        "translation": "If he's stingy with his possessions and has trouble discarding them, he should encourage them with his heart and cause them to make offerings to the three honored ones.",
        "source": "T24n1459_003:0653a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或可瞻病人，　　為捨衣鉢等；　令其覩供養，　　引生檀施心。",
        "translation": "Perhaps you can look at the sick person and offer up your robe or bowl for them, so that they'll see the offerings and become mindful of giving.",
        "source": "T24n1459_003:0653a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於資具內，　　有愛著須捨；　當於戒德人，　　隨情施衣鉢。",
        "translation": "If there's an attachment to the necessities in a monk's possessions, he must abandon them; he should give clothing and bowls according to his feelings to someone of virtue who observes the precepts.",
        "source": "T24n1459_003:0653a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻雖持戒，　　愛鉢至身死；　還生自鉢中，　　受惡毒蛇報。",
        "translation": "Even though a monk observes the precepts, he loves his bowl until his body dies; he'll be born in his own bowl and suffer the consequences of a bad viper.",
        "source": "T24n1459_003:0653a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若患痔漏等，　　勿使不信人；　造次輒行醫，　　割除令苦惱。",
        "translation": "If someone is suffering from hemorrhoids or other conditions, don't allow them to be unbelievers; they'll quickly apply a doctor to cut away the pain and suffering.",
        "source": "T24n1459_003:0653a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如其療痔病，　　藥呪可應治；　無醫為處方，　　不以爪甲截。",
        "translation": "If he treats a hemorrhoid, a medicine spell will cure it; there's no doctor to prescribe it, so he doesn't cut it with his fingernail.",
        "source": "T24n1459_003:0653a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若無看病人，　　無弟子及藥；　大眾咸供給，　　藥乃出僧伽。",
        "translation": "If there's no doctor, no disciple, and no medicine, then the medicine comes out of the saṃgha when the whole community makes offerings.",
        "source": "T24n1459_003:0653a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必是孤獨類，　　全無供侍人；　合眾並應看，　　或可為番次。",
        "translation": "He must be an orphan, with no attendants, or he must be seen by the whole group, or he might be able to take his place.",
        "source": "T24n1459_003:0653a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若患疥癩病，　　勿污僧床褥；　宜將厚衣替，　　咸用己私財。",
        "translation": "If they're sick with scabies, don't stain the saṃgha's beds and mats; replace their thick clothing with their own personal belongings.",
        "source": "T24n1459_003:0653a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　簷廳及門屋，　　大小便舍中；　不應看病人，　　可居安隱處。",
        "translation": "The canopies, halls, and entrances of the monastery are in the latrine; you shouldn't look after the sick, but you can stay in a peaceful place.",
        "source": "T24n1459_003:0653a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　造寺主身死，　　被禁或他行；　於斯住五年，　　雖貧不應棄。",
        "translation": "If the monk who built the temple dies or is banned from practicing elsewhere, he may stay here for five years, though poor, and shouldn't abandon it.",
        "source": "T24n1459_003:0653a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　更可於五年，　　與近寺同利；　別為長淨事，　　守護不令虧。",
        "translation": "During those five years, he can share the benefits of the nearby temple; he performs a separate, long-term purification task and guards it without loss.",
        "source": "T24n1459_003:0653a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　看守滿十年，　　若心不樂住；　宜將臥具等，　　移安近寺中。",
        "translation": "After ten years of guardianship, if his mind is not content with abiding there, he should move his bedding and so forth to a nearby temple.",
        "source": "T24n1459_003:0653b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　宜應好閉門，　　隨情向餘處；　苾芻如樂住，　　任意可應居。",
        "translation": "He should close his door well and go to another place as he sees fit; if a monk is happy to stay, he can abide there as he wishes.",
        "source": "T24n1459_003:0653b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　他寺所寄物，　　他索即應還；　必若有餘緣，　　受用誠無過。",
        "translation": "Whatever is sent from another temple should be returned upon request; if there must be another reason, there's really no mistake about accepting it.",
        "source": "T24n1459_003:0653b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　施主有先心，　　施此非餘處；　迴將與他寺，　　宜應強奪來。",
        "translation": "The donor has a prior intention to give something here that isn't elsewhere; if he were to return it to another temple, he should forcibly take it from them.",
        "source": "T24n1459_003:0653b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若著僧衣服，　　及自上價衣；　不應浣染等，　　福增無損故。",
        "translation": "If he wears the robes of the saṃgha or his own high-priced robes, he shouldn't wash or dye them; it's because his merit is enhanced and not harmed.",
        "source": "T24n1459_003:0653b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於雨雪時，　　不應安露地；　無宜著此服，　　入不淨室中。",
        "translation": "If he were to stand on bare ground during rain or snow, it would be inappropriate to wear these robes and enter an impure room.",
        "source": "T24n1459_003:0653b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若其過初夜，　　臥具不應分；　必知長久停，　　宵中亦應給。",
        "translation": "If he goes beyond the first night, he shouldn't share his bedding; he must know that it's long-staying, and he should give it during the night.",
        "source": "T24n1459_003:0653b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　應隨老次第，　　與床并坐枮；　當留一所房，　　與客苾芻住。",
        "translation": "He should follow the order of old age, sitting calmly on a bed with his friends, and leaving a room for a guest monk to stay.",
        "source": "T24n1459_003:0653b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　縱在阿蘭若，　　隨老樂應分；　地樹及叢林，　　准次皆分給。",
        "translation": "Even in a forest, according to the pleasure of the elderly, they should be given a share of the earth and trees and the forest in order.",
        "source": "T24n1459_003:0653b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設居於靜林，　　亦須留客處；　為護其衣鉢，　　異此遂招愆。",
        "translation": "Even if they live in a quiet forest, they must leave a guest room; to protect their clothing and bowls, deviation from this would cause misdeeds.",
        "source": "T24n1459_003:0653b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在於迮處，　　肘地應分臥；　瓶水及齒木，　　藥雜器皆分。",
        "translation": "If he were in a hut, he'd share his bed at his elbow, and he'd share his water bottle and toothpick, as well as his medicine and utensils.",
        "source": "T24n1459_003:0653b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有意欲他行，　　戾須淨掃拭；　如其故令壞，　　惡作罪侵身。",
        "translation": "If you have thoughts of walking with others, you must clean and sweep them away; if you cause them to break down, a bad deed will befall you.",
        "source": "T24n1459_003:0653b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正值分房際，　　不囑便外出；　更令依次行，　　雖啼不應與。",
        "translation": "Just as he's dividing his room, he'll go out without being told to do so; he'll make sure he goes in order, even though he's lamenting and shouldn't be given.",
        "source": "T24n1459_003:0653b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　臥具及飲食，　　小者共平分；　花果等亦然，　　大師法恒爾。",
        "translation": "He shares his bedding and food equally with the small ones, and so do flowers and fruits, even though the great teacher's teaching is always the same.",
        "source": "T24n1459_003:0653b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若彼身重病，　　不樂出本房；　乃至未差來，　　放免其分次。",
        "translation": "If someone is seriously ill, they don't like to go out of their own room; even if they haven't yet arrived, they're excused from taking their place.",
        "source": "T24n1459_003:0653c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若見僧房外，　　臥具露地安；　應可持令入，　　老病令人舉。",
        "translation": "If he sees bedding outside a saṃgha's dormitory that's out in the open, he can carry it in, or he can lift it up when he's old and sick.",
        "source": "T24n1459_003:0653c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　見大眾臥具，　　被火燒水漂；　護身當救持，　　不應為造次。",
        "translation": "Seeing the bedding of a large group of people being burned and drenched by water, you must protect yourself and rescue it; you shouldn't make any distinctions.",
        "source": "T24n1459_003:0653c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先須出己財，　　次出於僧法，　後當持佛物，　　是次第應知。",
        "translation": "You must first give your own possessions, then give the saṃgha's teaching, and then you must carry the Buddha's things, which should be understood in order.",
        "source": "T24n1459_003:0653c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　先須請容許，　　次可相時宜；　方於三藏中，　　隨情問疑處。",
        "translation": "First, you must ask permission, then you can match it with the appropriate time; then you can go to the appropriate place in the Tripiṭaka to ask questions.",
        "source": "T24n1459_003:0653c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡為教授者，　　隨行住坐臥；　於此四儀中，　　說法皆非犯。",
        "translation": "Anyone who teaches follows the activities, stands, sits, and lies down; in these four ways, no teaching is a violation of the Dharma.",
        "source": "T24n1459_003:0653c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸有受學人，　　先須起恭敬；　但除寢臥事，　　餘三不在遮。",
        "translation": "Those who accept the teaching must first be respectful; except for sleeping and lying down, the other three are not covered.",
        "source": "T24n1459_003:0653c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　教授學人時，　　彼愚心未曉；　悲情善開喻，　　百遍不應辭。",
        "translation": "When he teaches a student, he's too stupid to understand; his compassionate friend skillfully explains the teaching, so he shouldn't say anything a hundred times.",
        "source": "T24n1459_003:0653c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻舉手打，　　屋柱樹及牆；　斯皆有愆過，　　智者不應作。",
        "translation": "A monk striking a house, a tree, or a wall with his hand is a transgression that a wise person shouldn't do.",
        "source": "T24n1459_003:0653c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　臂上不安玔，　　呪線任情持；　若有所須時，　　繫臂無令現。",
        "translation": "The spell's cord can be held by any person who wants to wear it; if there's a need, it won't show when it's tied to the arm.",
        "source": "T24n1459_003:0653c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若誦諸明呪，　　不得敬餘天；　宜應禮三寶，　　持外道呪術。",
        "translation": "If you recite these incantations, you mustn't revere other gods; it's better to revere the Three Treasures and maintain non-Buddhist spells.",
        "source": "T24n1459_003:0653c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不於覆鉢家，　　受飲食床座；　亦不往彼舍，　　為其說法等。",
        "translation": "You won't accept a meal or seat in a house that covers your bowl, nor will you go to that house and explain the teaching to it.",
        "source": "T24n1459_003:0653c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必有淨信心，　　敷妙衣布地；　苾芻應為蹈，　　念諸行無常。",
        "translation": "They must have pure faith and spread out fine clothing on the ground; bhikṣu should prepare for them, mindful of the impermanence of conditioned things.",
        "source": "T24n1459_003:0653c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　但畜三衣者，　　唯開一洗裙；　若更畜餘衣，　　便乖杜多行。",
        "translation": "Those who merely store three garments will open only one washcloth; if they store another garment, they'll be out of line with their many actions.",
        "source": "T24n1459_003:0653c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若諸麥豆等，　　曾經蒸煮來；　雖復尚堅生，　　鞕種皆非犯。",
        "translation": "If wheat and beans were steamed and boiled, even though they're still hard and raw, it wouldn't be a violation to take off the seeds.",
        "source": "T24n1459_003:0653c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　嘔食出咽喉，　　吐却淨漱口；　仍除先業力，　　頸內有雙喉。",
        "translation": "They vomit food out of their throat, spit it out, cleanse their mouth, and remove the effects of prior karma, so they have two throats inside their necks.",
        "source": "T24n1459_003:0654a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有彫彩扇，　　為眾畜時聽；　苾芻所著衣，　　不應同一色。",
        "translation": "If there's a fan made of carving or color, listen to it when you're serving animals; the robes worn by a monk shouldn't be the same color.",
        "source": "T24n1459_003:0654a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若是乞食人，　　隨衣著[巾*句]細；　於花果樹下，　　不棄大小便。",
        "translation": "Suppose a beggar wears a [napkin*clause] thinly with his robes; under a flowering fruit tree, he doesn't abandon defecation.",
        "source": "T24n1459_003:0654a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　寺角中閣道，　　木作石不為；　重病不禮他，　　亦不受他禮。",
        "translation": "He doesn't make wood or stone for the pathway in the temple's corner; he doesn't venerate others when he's seriously ill, and he doesn't accept their veneration.",
        "source": "T24n1459_003:0654a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　洗待身乾已，　　方可著餘衣；　或手拂令乾，　　或用身巾拭。",
        "translation": "He waits until his body is dry before putting on the rest of his clothes; he might brush his hands to make them dry, or he might wipe them with a body cloth.",
        "source": "T24n1459_003:0654a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若得花香物，　　屏處隨情嗅；　能使眼目明，　　令施福增長。",
        "translation": "If he obtains a flower-scented object, he'll put it aside and sniff it as he wishes; it will make his eyes and eyesight clear and cause his almsgiving to increase in merit.",
        "source": "T24n1459_003:0654a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　孫陀利打衣，　　寄與難陀著；　世尊聞此事，　　因斯制打衣。",
        "translation": "Sundarī had sent this robe to Nandanavana to wear, and when the Bhagavān heard about it, he had it made.",
        "source": "T24n1459_003:0654a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　得他先打衣，　　水灑柔方著；　依舊光華者，　　便招越法愆。",
        "translation": "When he obtains another's previously beaten robe, he sprinkles it with water and puts it on softly; if it's still shiny, he'll be guilty of transgressing the Dharma.",
        "source": "T24n1459_003:0654a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　知是賊所棄，　　死肉有殘餘；　甘蔗等同然，　　對眾無宜取。",
        "translation": "He knows that it was thrown away by thieves, that there's leftover dead flesh, and that sugarcane is the same, so it's not appropriate for him to take it from the crowd.",
        "source": "T24n1459_003:0654a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若以頭背跨，　　持物路中行；　現苦已招譏，　　當來更被壓。",
        "translation": "If someone carries something on their head and straddles it in the road, that object will invite ridicule in the present painful situation and be crushed in the future.",
        "source": "T24n1459_003:0654a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有貴價緂，　　舉置被蟲穿；　苦木葉餘香，　　裹末便不食。",
        "translation": "If I were to carry a valuable cloth, it would be pierced by worms; the residual scent of bitter wood leaves would be wrapped in powder, and then I wouldn't eat it.",
        "source": "T24n1459_003:0654a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　父母歿亡日，　　遺言與苾芻；　此物可應收，　　宜將供三寶。",
        "translation": "On the day my parents died, I gave the bhikṣu my last words; this is something to be collected, and it should be offered to the Three Treasures.",
        "source": "T24n1459_003:0654a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身在他界住，　　與彼苾芻欲；　此作法不成，　　仍招惡作罪。",
        "translation": "While living in another realm, he shared his desire with that bhikṣu; failing to do this deed still brings the sin of misdeeds.",
        "source": "T24n1459_003:0654a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貴價高攝婆，　　他施應須受；　賣却同分取，　　割破不應為。",
        "translation": "A valuable gift from another should be accepted; it's sold off and taken in equal parts, and it shouldn't be cut up.",
        "source": "T24n1459_003:0654a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻不見蛇，　　被螫便命過；　壓時蛇復死，　　為此臥觀床。",
        "translation": "When a monk doesn't see a snake, his life is cut short when he's stung; when he presses it, the snake dies again, and he lies down on this bed and looks at it.",
        "source": "T24n1459_003:0654b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　眠時不照床，　　即便招惡作；　不應令象馬，　　雞雀鬪傍觀。",
        "translation": "Not looking at the bed while it's sleeping will cause it to do evil; you shouldn't allow elephants, horses, or chickadees to fight and watch from the side.",
        "source": "T24n1459_003:0654b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若須其偃帶，　　是善逝所聽；　老病及風羸，　　隨情可應用。",
        "translation": "If he needs to lay down his belt, this is what Sugata hears; old age, illness, and weak winds can be applied as appropriate.",
        "source": "T24n1459_003:0654b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從斯住處去，　　或復擬旋歸；　臥具囑方行，　　拂拭令清淨。",
        "translation": "From this place of abiding, he may wish to go back again, ask his assistant to conduct his bed, and cleanse and purify it.",
        "source": "T24n1459_003:0654b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　被他囑授人，　　應須為堅守；　若還應即與，　　存心為賞持。",
        "translation": "Those who are instructed by others should guard them firmly; if they return, they should immediately give them back, keeping them in mind for appreciation.",
        "source": "T24n1459_003:0654b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八日十五日，　　曬曝看臥具；　每半月常然，　　異斯招越法。",
        "translation": "On the eighth and fifteenth days, he'll expose his bedding to the sun, and every half month he'll continue doing so, thereby inviting transgressions.",
        "source": "T24n1459_003:0654b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大小便利室，　　及以眾器具；　先至宜應用，　　不應隨大小。",
        "translation": "It's appropriate to use the large and small utility rooms and the many implements that come first, not the large and small.",
        "source": "T24n1459_003:0654b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若眾家器物，　　當其受用時；　應與先借人，　　無令廢其事。",
        "translation": "If there are many household utensils, then when they're used, they should be given to the person who borrowed them first so that their work won't be wasted.",
        "source": "T24n1459_003:0654b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　上妙繩床座，　　眾許非別人；　倚版為除勞，　　僧私皆悉許。",
        "translation": "The highest seat on a marvelously corded bed is approved by all and no one else, and the leaning board is used to remove labor, which is approved by both the saṃgha and private individuals.",
        "source": "T24n1459_003:0654b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若大過三夏，　　開聽一座坐；　如未近圓人，　　曾不許同席。",
        "translation": "If it's been more than three summers, he'll open his seat to one person; if he's not close to a perfect person, he's never been allowed to sit on the same mat.",
        "source": "T24n1459_003:0654b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於俗舍內，　　別座不可求；　設令親教師，　　許暫同居席。",
        "translation": "If he's in a secular dwelling, he can't request a separate seat; if he makes it possible for his teachers to be close to him, he'll be allowed to sit together for a while.",
        "source": "T24n1459_003:0654b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如有難緣事，　　持眾臥衣行；　將者可應眠，　　無怖還隨次。",
        "translation": "If there's a difficult situation, he'll carry his many robes to bed and walk; he'll be able to sleep without fear and return to the next seat.",
        "source": "T24n1459_003:0654b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若恐怖止息，　　受用可如常；　爛破孔穿時，　　如法應縫補。",
        "translation": "If your fears subside, you'll be able to enjoy them as usual; when they're torn and pierced, you should sew them according to the Dharma.",
        "source": "T24n1459_003:0654b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必不堪受用，　　乃至襯替衣；　裂破作燈心，　　或作泥填孔。",
        "translation": "It must be unfit for use, even if it's a substitute garment that's torn and turned into a lamp, or a hole that's filled with mud.",
        "source": "T24n1459_003:0654b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯受用時，　　欲使身安樂；　復令於施主，　　恒為福業因。",
        "translation": "When he uses it like this, he wants to make himself comfortable; furthermore, it will always be a cause of good actions for the donor.",
        "source": "T24n1459_003:0654b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　別寺有定分，　　餘人輒來食；　計價當酬直，　　此不許分踈。",
        "translation": "When there's a set amount at another temple, the rest of the people come to eat; they must be paid a straight price, and this mustn't be shared.",
        "source": "T24n1459_003:0654c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　僧祇臥具物，　　記誌宜須作；　此是某甲施，　　書字好分明。",
        "translation": "It's appropriate to keep a record of the things that the saṃgha wears as bedding; this is a gift from a certain person, and the writing is well-defined.",
        "source": "T24n1459_003:0654c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　枮上更安枮，　　苾芻重疊坐；　黑耳惡作女，　　被壓向幽關。",
        "translation": "A monk places a monk's coffin on top of his coffin, and the monk sits with his coffin stacked high; a black-eared, mischievous woman is crushed into a dark gate.",
        "source": "T24n1459_003:0654c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　求寂有信心，　　存情恭敬戒；　常住之臥具，　　此亦合同分。",
        "translation": "Seeking quiescence with faith, they maintain the precepts with respect for sentient beings; these are also the contractual parts of the bedding for permanent abiding.",
        "source": "T24n1459_003:0654c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　開皮臥具者，　　不許在中方；　俗舍坐權開，　　用臥元非許。",
        "translation": "An open-skin bedding is not permitted in the middle direction; the right to sit in a secular dwelling is opened, and the use of a bedding is not permitted at all.",
        "source": "T24n1459_003:0654c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　熊羆皮總許，　　若坐并承足；　邊方並悉開，　　以皮為臥具。",
        "translation": "A bear's skin is always permissible, and if he sits and bares his feet, he opens them all at the sides and uses the skin as a bedding.",
        "source": "T24n1459_003:0654c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　金銀真珠等，　　希奇寶莊飾；　并將象牙帖，　　此名為大床。",
        "translation": "Adorned with gold, silver, real beads, and other rare treasures, and posted on ivory, it's called a large bed.",
        "source": "T24n1459_003:0654c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻床上坐，　　垂足不至地；　此即是高床，　　奉戒者應識。",
        "translation": "A monk sits on a bed, his feet don't reach the ground; this is a high bed, and those who observe the precepts should know it.",
        "source": "T24n1459_003:0654c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此二大高床，　　苾芻不許坐；　俗亦遮非許，　　謂受褒灑陀。",
        "translation": "These two large, high beds are not permitted for monks to sit on, and they are not permitted by the secular world, which is to say that they are accepted as a poṣadha.",
        "source": "T24n1459_003:0654c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必是堅牢座，　　兩人容共坐；　床亦許三人，　　仍須撿新舊。",
        "translation": "They must be firm seats, where two people can sit together, and the beds may be for three people, but they must still be checked for new or old.",
        "source": "T24n1459_003:0654c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必欲分財物，　　或告或鳴稚；　或可共行籌，　　總告僧伽眾。",
        "translation": "He must want to share his possessions, so he may tell someone or tell them to sound the alarm, or he may share his chips and tell the saṃgha in general.",
        "source": "T24n1459_003:0654c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　揵稚有五種，　　所為事不同；　任用在當時，　　無違大師教。",
        "translation": "There are five kinds of gandharvas, and they do different things; they're used as they are at the time, not contrary to the great teacher's teaching.",
        "source": "T24n1459_003:0654c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一度斂稚訖，　　更不打一稚；　此即是凶緣，　　為表亡人事。",
        "translation": "After once he abridges a child, he doesn't strike another child; this is a bad cause, and it's a sign that someone has died.",
        "source": "T24n1459_003:0654c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作業三過斂，　　摋打兩下稚；　如增一大稚，　　是謂眾常法。",
        "translation": "When three faults are abridged in an action, they will strike two infants with an aniloxic substance; this is called the rule of constancy, which is to increase one infant by one.",
        "source": "T24n1459_003:0654c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　急難稚無定，　　為欲警眾人；　若為警禪思，　　應可搖鳴錫。",
        "translation": "There's no set number of infants in urgent need, but this is to warn the people; if it were to warn meditation, it would be possible to shake a tin.",
        "source": "T24n1459_003:0655a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　客人將入寺，　　門外洗手足；　若處水難求，　　宜將葉拂打。",
        "translation": "When a guest is about to enter the temple, he washes his hands and feet outside the door; if there's a place where water is difficult to find, he should whisk a leaf and beat it.",
        "source": "T24n1459_003:0655a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既入於寺中，　　合掌就尊處；　主唱善來已，　　答曰極善來。",
        "translation": "Once inside the temple, he joins his palms and takes up his place of honor; after the host calls out that he's well come, he replies, \"Very well come!",
        "source": "T24n1459_003:0655a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　主人隨所有，　　斟量為解勞；　并設非時漿，　　令彼心歡喜。",
        "translation": "The master then measured the amount of water he had for relieving his trouble and offered him an untimely drink to make his heart rejoice.",
        "source": "T24n1459_003:0655a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無遑濯手足，　　即問僧常制；　聞已可隨行，　　還如佛親說。",
        "translation": "Without even bothering to wash his hands and feet, he asked about the saṃgha's usual rules; after hearing them, he could follow them, just as the Buddha himself had said.",
        "source": "T24n1459_003:0655a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　舊住諸苾芻，　　所為作制令；　咸依稱理教，　　勿使惱眾人。",
        "translation": "The monks and nuns who used to live there were instructed to follow the principle of praise and not to cause annoyance to the people.",
        "source": "T24n1459_003:0655a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　不得於如知，　　尊極大師處；　苾芻喚名族，　　及以具壽等。",
        "translation": "They couldn't go to the place of the venerable, greatest teacher who was thus known, and the monks called on the names and families of the monks, as well as on the full-life monks.",
        "source": "T24n1459_003:0655a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　小師於大者，　　應喚為大德；　大者於小年，　　應命為具壽。",
        "translation": "A junior teacher should be called a great virtuous man, and a junior great man should be ordained to a full life span.",
        "source": "T24n1459_003:0655a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既被眾處分，　　隨力淨僧坊；　八日十五日，　　鳴稚集弟子。",
        "translation": "Once he's been assigned many duties, he follows his strength to purify the saṃgha's quarters; on the eighth and fifteenth days, he calls out to his disciples and gathers them.",
        "source": "T24n1459_003:0655a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大小便洟唾，　　及以吐血等；　謦咳或彈指，　　再三令警覺。",
        "translation": "They will urinate, defecate, spit, spit blood, and so forth; they will cough or snap their fingers, and they will be repeatedly alerted.",
        "source": "T24n1459_003:0655a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　勿在生草上，　　及於清水中；　好樹及淨田，　　無宜棄不淨。",
        "translation": "Don't stand on raw grass or in fresh water; don't abandon impurity in good trees or pure fields.",
        "source": "T24n1459_003:0655a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　身安無病苦，　　不數食檳榔；　為病乃無違，　　苾芻應噉食。",
        "translation": "Being comfortable and free from illness, he doesn't repeatedly eat betel nut; even though it's illness, it's not a violation; the monk should devour it.",
        "source": "T24n1459_003:0655a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　非時欲受用，　　於諸果味中；　雖不有開遮，　　略教宜詳悉。",
        "translation": "Among the fruits and flavors that they desire to enjoy at times other than these, it's appropriate to explain them in detail, even though there's no preclusion.",
        "source": "T24n1459_003:0655a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　猶如日日中，　　供身恒噉食；　還須安眼藥，　　佛說遣常為。",
        "translation": "It's like making an offering to one's body to keep devouring food day after day; it's also necessary to administer eye medication, which the Buddha teaches is always appropriate.",
        "source": "T24n1459_003:0655a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於寺內淨地，　　不可輒剃頭；　有病在隨聽，　　了時須掃拭。",
        "translation": "In a pure place inside a temple, one shouldn't shave their hair lightly; they should listen to any illness and wipe it when they're done.",
        "source": "T24n1459_003:0655a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於剃髮時，　　必須依小大；　若已下手剃，　　喚起理不應。",
        "translation": "When shaving your hair, you must follow the small and large; if you have already shaved your head, you must call up the principle that it shouldn't be done.",
        "source": "T24n1459_003:0655b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鬚髮隨先後，　　次拔鼻中毛；　手足爪方除，　　須知其次第。",
        "translation": "The beard and hair come first, then the hair on the nose is plucked, and the hands, feet, and paws are removed first, so you must know their order.",
        "source": "T24n1459_003:0655b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻剃髮時，　　不作牛毛剪；　若有瘡病者，　　近處剪無傷。",
        "translation": "When a monk shaves his hair, he doesn't cut it like a cow's hair; if there's a sore or disease, cutting it close to the skin won't hurt it.",
        "source": "T24n1459_003:0655b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於三隱密處，　　不許輒除毛；　若有病時開，　　報知同淨行。",
        "translation": "In the three hidden places, he doesn't readily remove hairs; if he opens them when sick, he'll be reported to have practiced the same purification.",
        "source": "T24n1459_003:0655b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　剪爪如斧刃，　　或可剃刀彎；　甲上聽除垢，　　不合求光飾。",
        "translation": "Their nails are cut like the edge of an axe, or they may be bent by a razor; they hear the removal of dirt from their nails, but they don't seek to polish them.",
        "source": "T24n1459_003:0655b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在蘭若處，　　髮不過兩指；　二指便非咎，　　城村不合然。",
        "translation": "If someone were in a forest, their hair wouldn't reach two fingers; two fingers wouldn't be blamed, and a city or village wouldn't be allowed to do so.",
        "source": "T24n1459_003:0655b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡剃髮了時，　　遍身皆淨洗；　有事便開許，　　但須淨五支。",
        "translation": "When someone shaves their hair, the whole body is cleansed and washed; it's permitted when there's a task, but the five limbs must be purified.",
        "source": "T24n1459_003:0655b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無俗剃髮者，　　應可在房中；　苾芻若善閑，　　為剃時非犯。",
        "translation": "Those who shave their hair without laymen should be allowed to stay in their rooms; if a monk is well disposed, he won't violate the rules when he shaves his hair.",
        "source": "T24n1459_003:0655b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　晨朝嚼齒木，　　或為說法時，　及以食了時，　　不作便招罪。",
        "translation": "When he chews wood for his teeth in the morning, or when he teaches the Dharma, or when he eats, failure to do so will result in a sin.",
        "source": "T24n1459_003:0655b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　齒木有三殊，　　長須十二指；　短便八指量，　　此內總名中。",
        "translation": "There are three kinds of wood for chewing teeth, which must be twelve fingers long and eight fingers short, which is generally referred to as medium.",
        "source": "T24n1459_003:0655b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　隨是何木條，　　大如小指許；　嚼頭軟成絮，　　苦澁者為佳。",
        "translation": "Whatever this wood is, it's about the size of a small finger; when it's chewed, it's soft and lint-like, and the bitter and bitter part is preferable.",
        "source": "T24n1459_003:0655b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　齒木既嚼了，　　刮舌須存意；　銅鐵赤銅鍮，　　刮錍隨樂作。",
        "translation": "After chewing wood with teeth, it's necessary to scrape your tongue with care; copper, iron, red copper, and bronze are used for scraping the blade as you like.",
        "source": "T24n1459_003:0655b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若住村城內，　　四中隨一持；　淨洗用灰揩，　　勿令生垢污。",
        "translation": "If he lives in a village or town, he takes one of the four into his hands and wipes it with ashes to prevent it from becoming soiled.",
        "source": "T24n1459_003:0655b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　必其無此者，　　用前所嚼木；　擘破兩相揩，　　刮舌貧人用。",
        "translation": "If he doesn't have this, he uses the wood he used to chew, breaks it between the two sides, and wipes it off to scrape his tongue for poor people.",
        "source": "T24n1459_003:0655b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　齒木卒難得，　　口齒終須淨；　三屑隨時用，　　權開亦無犯。",
        "translation": "Even though wood for teeth is hard to find, your mouth and teeth must always be clean; use the three scraps at any time, and it's not a violation to open it right away.",
        "source": "T24n1459_003:0655c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　前身作毒蛇，　　今為長者子；　出家因淨口，　　常須刮舌錍。",
        "translation": "He was once a viper, but now he's the son of an elder; his renunciant causes him to cleanse his mouth, so he always needs a tongue-scraper.",
        "source": "T24n1459_003:0655c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　既除其舌垢，　　置地殺小蟲；　由此佛興悲，　　不許隨宜棄。",
        "translation": "Once the tongue's dirt is removed, it's placed on the ground to kill small insects; thus, the Buddha shows compassion and doesn't allow it to be discarded as appropriate.",
        "source": "T24n1459_003:0655c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡是淨口時，　　齒木洗方棄；　無水揩塵土，　　不然招惡作。",
        "translation": "Whenever he purifies his mouth, he washes the wood from his teeth before discarding it; if he doesn't wipe the dirt with water, it will cause misdeeds.",
        "source": "T24n1459_003:0655c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　蠅於齒木死，　　食此守宮亡；　黃狖噉斯終，　　狗飡還命過。",
        "translation": "A fly dies from eating this wood with its teeth, and it dies while guarding the palace; a yellow gourd eats it and ends up eating it, and a dog eats it and returns to life.",
        "source": "T24n1459_003:0655c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻有三事，　　宜於屏處為：　謂是大小便，　　及以嚼齒木。",
        "translation": "There are three things a monk should do in a secluded place: relieving himself and chewing wood for his teeth.",
        "source": "T24n1459_003:0655c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苾芻許皮履，　　但唯開一重；　不許作多重，　　俗淨方聽著。",
        "translation": "A monk permits leather footwear, but only opens it once; he permits no more than one weight, and only mundane and pure people listen to it.",
        "source": "T24n1459_003:0655c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　踏時作聲響，　　縱淨不應畜；　為眾在隨聽，　　著時無有罪。",
        "translation": "When it steps on it, it makes a noise, even though it's pure and shouldn't be stored; it's for the crowd to hear as it goes, and there's no fault when it's attached.",
        "source": "T24n1459_003:0655c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在嚴寒國，　　氷雪滿田中；　此時開富羅，　　著否皆隨意。",
        "translation": "If he were in a country that's bitterly cold, where snow and ice fill the fields, he'd open a pula at that point and do as he pleased whether he put it on or not.",
        "source": "T24n1459_003:0655c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　師子象馬等，　　五皮不合持；　并及此諸筋，　　不可將連綴。",
        "translation": "The five skins of lions, elephants, horses, and so forth don't fit together, and these tendons can't be tied together.",
        "source": "T24n1459_003:0655c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自餘牙爪獸，　　犲及猫狸等；　不合用其皮，　　由斯能作害。",
        "translation": "Other animals with fangs and nails, such as beasts of prey and civets, don't use their skins together, for this reason they can do harm.",
        "source": "T24n1459_003:0655c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在毘訶羅，　　總不聽著屐；　得安便轉室，　　并開俗舍中。",
        "translation": "If someone were at Vihāra, they wouldn't listen to him wearing sandals; after they attain safety, they'll change rooms and open a secular dwelling.",
        "source": "T24n1459_003:0655c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　芒竹等為鞋，　　苾芻不合著；　脚有風血病，　　須著在隨聽。",
        "translation": "A monk won't wear shoes made of mangoes and bamboos, and he'll listen if his feet get sick from wind and blood.",
        "source": "T24n1459_003:0655c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若是無船處，　　憑牛尾渡河；　象馬特水牛，　　此悉非遮限。",
        "translation": "If there's no boat, he'll cross the river on the tail of an ox; elephants, horses, and special buffaloes are not limited to this.",
        "source": "T24n1459_003:0655c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　租田合取分，　　耕業絕不聽；　守看宜用心，　　無令損常住。",
        "translation": "He takes his share of the rented land, but he never listens to its cultivation; he should guard it carefully so that its permanent abiding isn't impaired.",
        "source": "T24n1459_003:0655c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　險途逢難緣，　　自亦持將去；　寺中如有賊，　　鬧亂可應為。",
        "translation": "If there's a thief in the temple, it's possible to cause trouble.",
        "source": "T24n1459_003:0656a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在牧牛坊，　　慇懃好看守；　不應言穀將，　　方便遣如常。",
        "translation": "If he were at the cow pasture, he would guard it well and diligently; he wouldn't say he was a general of grain, but he would skillfully dismiss it as usual.",
        "source": "T24n1459_003:0656a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　求寂等持糧，　　身羸須借助；　勿令其手放，　　舉下並無傷。",
        "translation": "Those who seek the provisions of the quiescent must use help when their bodies are weak; don't let their hands drop, for they won't be harmed if they lift them down.",
        "source": "T24n1459_003:0656a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若其全困乏，　　苾芻應為持；　帒上繫長繩，　　可令求寂捉。",
        "translation": "If he's completely destitute, the monk should carry it for him; tie a long rope around the handbag, and he can make Silence seek to catch it.",
        "source": "T24n1459_003:0656a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　賊來驚走棄，　　或可渡河時；　此即自收來，　　食時無有過。",
        "translation": "When the thieves come and scare them away, they might cross the river; this will be gathered in by itself, and there's nothing to lose when they eat.",
        "source": "T24n1459_003:0656a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　將車載糧食，　　險處恐摧轅；　苾芻應共推，　　仍須防軾處。",
        "translation": "Carrying provisions in a chariot, there's a dangerous place that might be crushed by a pole; the monks should push it together, but there's still a place to guard against a shield.",
        "source": "T24n1459_003:0656a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　船中穀食滿，　　觸淺過灘渦；　牽拔助舟人，　　無宜觸其柁。",
        "translation": "The boat is full of grain and food, and it's shallow enough to cross the bank; it's not advisable for someone in a boat to pull it up and help it reach the crossbar.",
        "source": "T24n1459_003:0656a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　染衣須靜日，　　復非陰午時；　好地不應為，　　恐污生譏過。",
        "translation": "A quiet day is needed to dye robes, but it's not the noon of the sun; good ground shouldn't be used for fear of defiling it and creating criticism.",
        "source": "T24n1459_003:0656a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　忽爾逢風雨，　　塵驚恐污衣；　可移簷宇中，　　污處應摩拭。",
        "translation": "When there's a sudden wind or rain, the dust startles him, for fear it might stain his robes; he can move them to a dwelling, and he should wipe away the stains.",
        "source": "T24n1459_003:0656a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　同法諸苾芻，　　見鬪宜應解；　彼若不用語，　　捨去不須看。",
        "translation": "Like the bhikṣus, it's appropriate to understand disputes when they see them; if they don't use words, they should abandon them without looking at them.",
        "source": "T24n1459_003:0656a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　破持戒信持，　　俱持取聞者；　同聞信少欲，　　少欲有差殊。",
        "translation": "They are both observant of the precepts and faithful, and they both hold to those who hear; they both hear and believe in a few desires, and there's a difference in the few desires.",
        "source": "T24n1459_003:0656a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　此二共鬪時，　　兩言俱可信；　可問極少欲，　　二極乃無爭。",
        "translation": "When these two fight together, both words are believable; they can be asked about the least desire, and the two extremes are not disputed.",
        "source": "T24n1459_003:0656a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若因論法相，　　鬪諍遂便生；　如其惡不除，　　應須為捨置。",
        "translation": "If a fight ensues because of a discussion of the characteristics of the teaching, then it should be abandoned if the evil isn't removed.",
        "source": "T24n1459_003:0656a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　合禮處相逢，　　雖鬪應行敬；　大告言無病，　　若違俱得罪。",
        "translation": "When they meet in a courteous place, they should conduct themselves respectfully even though they're fighting; they should tell each other loudly that they're not sick, or they'll be condemned if they disagree.",
        "source": "T24n1459_003:0656a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若入浴室時，　　令人防守戶；　洗浴事未了，　　少信勿令前。",
        "translation": "When he enters the bathroom, he guards the door; before he finishes his bath, he mustn't let a little faith precede him.",
        "source": "T24n1459_003:0656b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若用眾雜彩，　　繪畫在隨聽；　不得畫眾生，　　仍開剪花葉。",
        "translation": "If you use a variety of colors, paint as you hear fit; don't paint sentient beings, but cut flowers and leaves.",
        "source": "T24n1459_003:0656b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在僧房壁，　　畫白骨死屍；　或時為髑髏，　　見者令生厭。",
        "translation": "If you paint a corpse with white bones on the wall of a saṃgha's dormitory, or a skull at some point, you'll be disgusted by what you see.",
        "source": "T24n1459_003:0656b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大門扇畫神，　　舒顏喜含笑；　或為藥叉像，　　執杖為防非。",
        "translation": "The fan at the front door depicts a god with a smile on his face or an image of a yakṣa holding a staff to prevent wrongdoing.",
        "source": "T24n1459_003:0656b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　畫大神通事，　　華中現佛形；　及畫生死輪，　　可於門兩頰。",
        "translation": "He paints a picture of a great superknowledgeable being, with the shape of a buddha in a flower, and a picture of the wheel of birth-and-death that fits between the cheeks of the door.",
        "source": "T24n1459_003:0656b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　畫香臺戶扇，　　藥叉神執花；　若於僧大厨，　　畫神擎美食。",
        "translation": "He paints an incense tray with a door fan and a yakṣa god holding a flower; or he paints a god holding a meal in a large monk's kitchen.",
        "source": "T24n1459_003:0656b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　庫門藥叉像，　　手持如意帒；　或擎天德瓶，　　口瀉諸金寶。",
        "translation": "He's depicted holding a wish-granting bowl in his hand or holding a vial of heavenly virtue while pouring gold treasure from his mouth.",
        "source": "T24n1459_003:0656b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於供侍堂，　　畫老苾芻像；　應為敷演勢，　　開導於眾生。",
        "translation": "In the service hall, he paints a portrait of an old bhikṣu who demonstrates his strength and guides sentient beings.",
        "source": "T24n1459_003:0656b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　溫堂并浴室，　　畫作五天使；　生老病死繫，　　其事准經為。",
        "translation": "In the bath and shower hall, five messengers of the gods are depicted, bound to birth, old age, illness, and death, according to the sūtras.",
        "source": "T24n1459_003:0656b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在養病堂，　　畫作大師像；　躬持大悲手，　　親扶重病人。",
        "translation": "In the sickroom, he paints a picture of the great teacher holding his compassionate hand and supporting a person who's seriously ill.",
        "source": "T24n1459_003:0656b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於水堂處，　　彫彩畫龍蛇；　若於圊廁中，　　應作尸林像。",
        "translation": "If you're in a water hall, paint a dragon or snake in color, or if you're in a toilet, paint a picture of the Śīlâditya.",
        "source": "T24n1459_003:0656b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　可在簷廊壁，　　畫佛本生時；　難行施女男，　　捨身并忍事。",
        "translation": "On the walls of a veranda, he might paint a picture of the Buddha when he was still alive, a woman or man who gives up his body and works with forbearance.",
        "source": "T24n1459_003:0656b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如斯畫軌式，　　緣在逝多園；　長者造寺成，　　世尊親為說。",
        "translation": "Such a style of painting has its origins in Jeta's Park, where the Bhagavān himself taught it to the elders who built the temple.",
        "source": "T24n1459_003:0656b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若在簷房處，　　不許火烟熏；　必若有餘緣，　　無烟可持進。",
        "translation": "If it's in a canopy, it mustn't be smoked by fire; surely, if there are other conditions, it can be carried forward without smoke.",
        "source": "T24n1459_003:0656b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於好甎地上，　　不應輒然火；　若有要緣者，　　宜可在爐中。",
        "translation": "On a good ground, a fire shouldn't be started lightly; if there's an important condition, it's better to put it in a fireplace.",
        "source": "T24n1459_003:0656b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛及眾中尊老者，　　國王恩濟於兆庶；　親教軌範二尊人，　　此五善教無宜越。",
        "translation": "The Buddha and the venerable elders in his congregation, the king's kindness to the people of the land, and his personal teaching and example to the two honored ones, are not to be surpassed by these five good teachings.",
        "source": "T24n1459_003:0656c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有苾芻所為事，　　世尊不開亦不遮；　清淨不與俗相違，　　斯事應行勿疑慮。",
        "translation": "If there are things that bhikṣus do that the Bhagavān doesn't reveal or refute, that are pure and not at odds with the commonplace, these things should be practiced without misgivings.",
        "source": "T24n1459_003:0656c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若是世間起譏議，　　苾芻受用不應為；　略教能令弟子安，　　亦明佛是一切智。",
        "translation": "If this is the world that gives rise to criticism, the bhikṣu's enjoyment shouldn't be for it; a brief teaching can put the disciple at ease and also shows that the Buddha is omniscient.",
        "source": "T24n1459_003:0656c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若毘奈耶蘇怛羅，　　於其緣起不能憶；　六大都城隨意說，　　縱令差互並無愆。",
        "translation": "If there's a Vinaya sūtra that can't be recalled in terms of its dependent arising, then the six great cities will be explained as they like, even if they differ without fault.",
        "source": "T24n1459_003:0656c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　室羅伐城娑雞多，　　婆羅痆斯及占波；　薜舍離城與王舍，　　此六大城隨處說。",
        "translation": "Śrāvastī, Śāketa, Vārāṇasī, and Jamba, Vaiśālī and Rājagṛha, these six great cities are explained as they see fit.",
        "source": "T24n1459_003:0656c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　長者謂是給孤獨，　　憍薩羅國勝光王；　女人謂是毘舍佉，　　斯等臨時任稱說。",
        "translation": "An elder is called Gokul, the king of Vaiśālī of Kośala, and a woman is called Vaiśākha, and these are called temporary.",
        "source": "T24n1459_003:0656c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　婆羅痆斯大城內，　　國主名為梵授王；　近住女名褒灑陀，　　有大長者名相續。",
        "translation": "Within the great city of Vārāṇasī, the lord of the kingdom is called King Brahmadatta, and the name of the woman who lives near him is Pauṣadha, and there's a great elder named Xiangxu.",
        "source": "T24n1459_003:0656c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　創在婆羅痆斯國，　　法輪初轉濟群迷；　於斯說法度五人，　　為報昔時先願意。",
        "translation": "He founded the country of Vārāṇasī, first turned the wheel of the Dharma to save the misled masses, and then taught the Dharma to five people in order to repay their prior willingness.",
        "source": "T24n1459_003:0656c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　第二五人隣次度，　　為說色等空無我；　總觀諸蘊若浮泡，　　生死輪迴因得出。",
        "translation": "The second five people were saved next, in order to teach that form and so forth are empty of self; generally observing that the aggregates are like floating bubbles, the causes of the cycle of birth-and-death escape.",
        "source": "T24n1459_003:0656c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　初由五人著下裙，　　高低不等招譏醜；　令如梵天圓整著，　　因斯遂制式叉門。",
        "translation": "First, five people wore lower skirts that were unequal in height, which invited ridicule; they were made to wear them like the Brahma gods in perfect harmony, and this led to the establishment of the style of the forked door.",
        "source": "T24n1459_003:0656c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　從次牟尼方制戒，　　蘇陣那等作婬非；　緣起學處免初人，　　此是生天涅槃路。",
        "translation": "From there, Muni then established the precepts, and Sudinna and the others committed sexual misconduct; this is the path to birth in heaven and nirvāṇa, which spares the first person from training in dependent arising.",
        "source": "T24n1459_003:0656c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大哉大德六人眾，　　由斯廣制式叉緣；　悉皆明辯冠當時，　　所作事業無重犯。",
        "translation": "Great is the multitude of six virtuous people who thus extensively define the terms and conditions of the precepts, all of whom were then crowned with eloquence and whose works were not repeatedly transgressed.",
        "source": "T24n1459_003:0656c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　雖為此等制學處，　　因斯洗濁破尸羅；　如信度河至春時，　　流澍平原灌眾澤。",
        "translation": "Even though these are the prescribed places of training, they are cleansed and made turbid by this, breaking through the river śīla like the river of faith reaching springtime, when it flows and pours into the plains and pours out the swamps.",
        "source": "T24n1459_003:0656c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鄔波難陀阿濕迦，　　闡陀難陀鄔陀夷；　補[木*奈]伐蘇六難調，　　世尊教中為滓穢。",
        "translation": "Upananda Aśoka, Cūḷananda Udayin, and Pūrṇa [muktaghasu] Vasudhvaja, the six difficult disciplines, are the dregs of the Bhagavān's teaching.",
        "source": "T24n1459_003:0656c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有要心不犯戒，　　斯則名為上智者；　雖犯能悔亦勝流，　　長時不悔生惡趣。",
        "translation": "If someone has the essential intention not to violate the precepts, then they're called a person of superior knowledge who, even though they violate them, is capable of repentance and surpasses others, and for a long time doesn't repent of being born in a bad destiny.",
        "source": "T24n1459_003:0657a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸佛能超德海岸，　　所有施作叵稱量；　宣說調伏濟眾生，　　於勝善人能引導。",
        "translation": "The buddhas are able to transcend the shores of virtue, performing incalculable acts of charity, preaching submission to save sentient beings, and guiding excellent people.",
        "source": "T24n1459_003:0657a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡夫無始積無明，　　輪轉恒迷處長夜；　唯佛能將正法手，　　慇懃牽使出幽冥。",
        "translation": "Ordinary sentient beings have accumulated ignorance since the beginning, and their transmigration continues long into the night; only the Buddha can put his hand on the right teaching and diligently lead them out of the darkness.",
        "source": "T24n1459_003:0657a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　阿僧企耶割跛時，　　常習大悲熏妙智；　善能調御巡生界，　　十種大事必須為。",
        "translation": "When he was incapacitated, he always cultivated great compassion and perfumed marvelous wisdom; he was able to skillfully regulate the world of birth and perform ten kinds of great tasks.",
        "source": "T24n1459_003:0657a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所謂授記當來佛，　　留第三分為眾生；　舍利目連第一雙，　　佛應化者皆自度。",
        "translation": "They're called the future Buddha who grants assurance of future Buddhahood, who retains the third part for sentient beings, and Śāriputra and Maudgalyāyana, the first pair, who all save those whom the Buddha should transform on his own.",
        "source": "T24n1459_003:0657a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　結界之事終須作，　　現大神變下天宮；　父母獲果說業緣，　　最後涅槃歸命禮。",
        "translation": "The act of binding the world must finally be performed, manifesting a great miracle down into the heavenly palace, where parents obtain the results of their actions and explain the conditions for their final nirvāṇa in homage to their lives.",
        "source": "T24n1459_003:0657a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　敬禮結集諸大德，　　牟尼隱教能彰著；　寶舟沈沒重令浮，　　光明普照無邊海。",
        "translation": "I salute the great virtues who have gathered here, whose hidden teachings are made known, whose jeweled boat sinks and sinks and whose light universally shines in the limitless ocean.",
        "source": "T24n1459_003:0657a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　亦禮侍者阿難陀，　　聞持善集於經藏；　令諸品類生欣樂，　　煩惱繫縛得蠲除。",
        "translation": "I also salute the attendant Ānanda, who hears and maintains the collection of well-collected sūtras, causes delight in all kinds of people, and frees them from the fetters of affliction.",
        "source": "T24n1459_003:0657a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　次禮聖者鄔波離，　　能正宣通調伏藏；　譬如善持明呪者，　　能除惡趣毒蛇王。",
        "translation": "Next, I salute the sage Upāli, who correctly teaches and penetrates the canon of submission; it's like a well-maintained bright spell that removes the poisonous snake king of bad destinies.",
        "source": "T24n1459_003:0657a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　次禮尊者迦攝波，　　善閑摩窒哩迦藏；　於此世間光普照，　　皆令隱義盡敷揚。",
        "translation": "Next, he pays homage to Venerable Kāśyapa, who skillfully reads the mahācārya canon and causes the hidden meanings of this world to be fully disseminated.",
        "source": "T24n1459_003:0657a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　次於王城五百眾，　　結集三藏是應人；　重流法雨潤生津，　　我悉至誠歸命禮。",
        "translation": "Next, there were five hundred people in the king's city who had assembled the tripiṭaka, and they all sincerely venerated me as a worthy of the Dharma rain that nourishes life.",
        "source": "T24n1459_003:0657a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　帝釋天王為上首，　　阿蘇羅眾咸恭敬；　遍滿空中悉雲集，　　稽首深心讚希有。",
        "translation": "The Śakra king of gods was the leader, and the multitude of asuras paid respect; clouds filled the air, and they all bowed their heads in profound praise of the rare.",
        "source": "T24n1459_003:0657a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　爾時王舍大城側，　　天香普馥滿山林；　諸天婇女散名花，　　流芳下落彌山際。",
        "translation": "At the time, a divine fragrance spread throughout the mountains and forests on the side of the great city of Rājagṛha, and the goddesses scattered famous flowers that spread their fragrance down the length of Mount Sumeru.",
        "source": "T24n1459_003:0657a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　次復於彼廣嚴城，　　獼猴池邊重結集；　七百羅漢弘真軌，　　冀令法教得增明。",
        "translation": "Next, in that city of vast splendor, they reassembled by the monkey pond, and 700 arhats promoted the true teaching in hopes of increasing the clarity of the Dharma and doctrine.",
        "source": "T24n1459_003:0657a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大哉佛日埋光盡，　　遺餘法寶恐沈輝；　幸蒙眾聖結微言，　　得使人天重歸仰。",
        "translation": "It's great that the Buddha's sun has buried its light, and the remaining Dharma treasure fears sinking in radiance; fortunately, the sages have given us their humble words, and we've been able to bring back the veneration of humans and gods.",
        "source": "T24n1459_003:0657a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　牟尼忘倦久輪迴，　　為求正法於生死；　願欲濟斯無救者，　　冀令眾苦盡消除。",
        "translation": "Forgetting his long reincarnation, the Muni seeks the right Dharma in birth and death, desiring to save the unredeemed in the hope of ridding them of all suffering.",
        "source": "T24n1459_003:0657b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　頭目手足咸持施，　　骨肉流血濟求人；　男女愛如初月輪，　　皆隨喜捨歸圓寂。",
        "translation": "He gives alms with his head, eyes, hands, and feet, bleeds from bones and flesh, and rescues those who seek it; men and women love each other like the first moon, and they all happily abandon them to perfect extinction.",
        "source": "T24n1459_003:0657b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大師牟尼所宣說，　　乃至正法未滅來；　應除懈怠斷愚癡，　　至願要心勤策勵。",
        "translation": "As taught by the Great Teacher Muni, even before the true teaching ceases, you should remove laziness and end foolishness, and diligently encourage the essential mind of the ultimate vow.",
        "source": "T24n1459_003:0657b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　言論佛教言中勝，　　頌陳正法頌中尊；　我毘舍佉罄微心，　　結頌令生易方便。",
        "translation": "Of all the Buddhists who speak, the best is the one who praises the right teaching; I, Vaiśākha, am full of subtlety, and I conclude this verse so that it's easy to give rise to skillful means.",
        "source": "T24n1459_003:0657b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於聖說有增減，　　前後參差乖次第；　願弘見者共相容，　　無目循塗能不失。",
        "translation": "If there's increase or decrease in the noble teaching, and the prior and subsequent are not in order, may those who share this view be compatible, so that no one can lose sight of what's being said.",
        "source": "T24n1459_003:0657b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我於苾芻調伏教，　　略為少頌收廣文；　願得普共諸群生，　　因此能成福智業。",
        "translation": "I've taught the Bhikṣu's discipline, summarizing the broad text in a few verses, hoping to make it universally applicable to all sentient beings and thus achieve meritorious and wise behavior.",
        "source": "T24n1459_003:0657b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五欲淤泥生厭背，　　恒持淨信作莊嚴；　生生常得苾芻身，　　堅持佛語窮真際。",
        "translation": "As the muck of the five desires becomes distasteful, I'll always maintain pure faith and adorn it; I'll always attain the body of a monk in my lifetime, insisting on the Buddha's words to reach the limit of reality.",
        "source": "T24n1459_003:0657b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若希戒品常清淨，　　無疑正趣涅槃宮；　常於略頌憶修行，　　勿慮一生虛命盡。",
        "translation": "If he hopes that the precepts will always be pure, he'll undoubtedly go straight to the palace of nirvāṇa; always recollecting and cultivating the practice of brief verses, he won't worry about ending his life in vain.",
        "source": "T24n1459_003:0657b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　乃至世間尚煎生死熱，　乃至心內恒為染火燒；　大仙等教猶若弶伽流，　常願久住洗濁無明垢。",
        "translation": "Even while the world still burns with the fever of birth and death, even while the mind is constantly consumed by the fires of defilement, great sages and others teach like snares and streams, always wishing to abide a long time cleansing themselves of the stain of ignorance.",
        "source": "T24n1459_003:0657b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　在那爛陀，　已翻此頌，　還至都下，　重勘疎條。",
        "translation": "After translating this verse in Nālandā, he returned to the lower part of the city and reviewed the loose ends.",
        "source": "T24n1459_003:0657b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有福因，　願霑含識，　專希解脫，　早出生津。",
        "translation": "May all the causes of merit be included in the consciousness, and may they focus on the hope of liberation and early birth.",
        "source": "T24n1459_003:0657b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶頌卷下",
        "translation": "Mūlasarvâstivāda-vinaya-vāda, Volume 2",
        "source": "T24n1459_003:0657b23_0",
        "is_bad_quality": false
    }
]