[
    {
        "source_sentence": "根本說一切有部尼陀那卷第一",
        "translation": "Mūlasarvâstivāda-nidāna, Vol. 1",
        "source": "T24n1452_001:0415a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏法師義淨奉　制譯",
        "translation": "Translated by the Tripiṭaka Master Yijing of the Great Tang",
        "source": "T24n1452_001:0415a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大門總攝頌曰：　初明受近圓，　　次分亡人物，　圓壇并戶鉤，　　菩薩像五門。",
        "translation": "\"The first verse that summarizes the great approach says, 'First, we'll explain the acceptance of the near perfect, then we'll divide it into dead figures, link the round altar to the door, and present the five portals of the bodhisattva image.'",
        "source": "T24n1452_001:0415a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別門初總攝頌曰：　近圓知日數，　　界別不入地，　界邊五眾居，　　不截皮生肉。",
        "translation": "The first general verse for the specific approach says, \"Near the perfection, we know the number of suns, distinguish the elements that don't enter the ground, and abide in the five multitudes at the boundary, not cutting off skin and producing flesh.",
        "source": "T24n1452_001:0415a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一子攝頌曰：　近圓男女狀，　　非近圓為師，　難等十無師，　　莫授我七歲。",
        "translation": "The first son gathered the verse, \"A man and a woman who are near the perfection have the form of a man and a woman who aren't near the perfection are their teachers, and it's difficult to equal the ten no-teachers who don't grant me seven years.",
        "source": "T24n1452_001:0415a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時薄伽梵在室羅伐城逝多林給孤獨園。",
        "translation": "It was then that the Bhagavān was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1452_001:0415a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽鄔波離來詣佛所，禮雙足已在一面坐，合掌恭敬白佛言：「世尊！",
        "translation": "Upāli Kauṇḍinya came to the Buddha, bowed his feet, sat down at one side, put his palms together in respect, and said to the Buddha, \"Bhagavān!",
        "source": "T24n1452_001:0415a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻與他受近圓時，彼若根轉，得名善受不？」",
        "translation": "If a monk's faculties change when he approaches the completion of feelings with another, does he get the name \"good feelings?\"",
        "source": "T24n1452_001:0415a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是受近圓，應可移向苾芻尼處。」",
        "translation": "The Buddha said, \"This is a near-complete reception, so you should move to the bhikṣuṇīs.\"",
        "source": "T24n1452_001:0415a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次世尊！",
        "translation": "\"Furthermore, Bhagavān!",
        "source": "T24n1452_001:0415a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苾芻與他男子受近圓時，而此男子作女人音聲、女人意樂及形狀法式，此人得名為受近圓不？」",
        "translation": "If a monk makes a woman's voice, a woman's intention, and a fancy pattern when he and another man are nearing completion, does that man get the name nearing completion?\"",
        "source": "T24n1452_001:0415a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「鄔波離！",
        "translation": "The Buddha said, \"Upāli!",
        "source": "T24n1452_001:0415a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是受近圓，諸苾芻得越法罪。」",
        "translation": "When this is done, the monk is guilty of transgressing the Dharma.\"",
        "source": "T24n1452_001:0415a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若苾芻尼與他女人受近圓時，而此女人作男子音聲、男子意樂及形狀法式，此人得名受近圓不？」",
        "translation": "\"If a monk or nun makes a man's voice, man's intention, and man's form and manner while he's in close proximity to another woman, can that person be called in close proximity to the perfection?\"",
        "source": "T24n1452_001:0415a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是受近圓，諸苾芻尼得越法罪。」",
        "translation": "The Buddha said, \"Accepting this near-perfection, the monks and nuns will be guilty of transgressing the Dharma.\"",
        "source": "T24n1452_001:0415a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若以不受近圓人為親教師，此人得名受近圓不？」",
        "translation": "\"If someone who doesn't accept the near perfection as a close teacher, can that person be called someone who accepts the near perfection?\"",
        "source": "T24n1452_001:0415a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是受近圓，諸苾芻得越法罪。」",
        "translation": "The Buddha said, \"When this person accepts near-perfection, the monks are guilty of transgressing the Dharma.\"",
        "source": "T24n1452_001:0415a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人身有難事，自言我有，諸苾芻為受近圓，此人得名受近圓不？」",
        "translation": "\"If there's something difficult about the person and he says, 'I have it,' and the monks make it near and perfect for him, can this person be called near and perfect in terms of accepting it?\"",
        "source": "T24n1452_001:0415b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不名受近圓，諸苾芻得越法罪。」",
        "translation": "The Buddha said, \"It's not called accepting what's near and perfect, and the monks are guilty of transgressing the Dharma.\"",
        "source": "T24n1452_001:0415b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人身無難事，自言我有，諸苾芻為受近圓，此人得名受近圓不？」",
        "translation": "\"If there's nothing difficult about the person and he says he has it, and the monks make it near and perfect for him, can this person be called near and perfect in terms of accepting it?\"",
        "source": "T24n1452_001:0415b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是受近圓，諸苾芻得越法罪。」",
        "translation": "The Buddha said, \"This is the kind of person who accepts near-perfection, and the monks are guilty of transgressing the Dharma.\"",
        "source": "T24n1452_001:0415b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人實有難事，自言我無諸難，苾芻為受近圓，此人得名受近圓不？」",
        "translation": "\"If a person really has difficulties and says, 'I have no difficulties,' and a monk makes it near and perfect for that person, can that person be called near and perfect in accepting it?\"",
        "source": "T24n1452_001:0415b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不名受近圓，諸苾芻無犯。」",
        "translation": "The Buddha said, \"It's not called accepting what's near and perfect, and the monks aren't guilty.\"",
        "source": "T24n1452_001:0415b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人實無難事，復自言無，諸苾芻為受近圓，此人得名受近圓不？」",
        "translation": "\"If a person really has no difficulty and says 'no,' and the bhikṣus accept it as near and perfect, can this person be called near and perfect?\"",
        "source": "T24n1452_001:0415b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此名善受。」",
        "translation": "The Buddha said, \"This is called being well-acquired.\"",
        "source": "T24n1452_001:0415b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若苾芻與出家者未受十戒而受近圓，此人得名受近圓不？」",
        "translation": "\"If a monk or renunciant has yet to receive the ten precepts and yet receives them in near-perfect form, can this person be called someone who has received them in near-perfect form?\"",
        "source": "T24n1452_001:0415b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是受，諸苾芻得越法罪。」",
        "translation": "The Buddha said, \"Such an acceptance would be a transgression of the Dharma for those monks.\"",
        "source": "T24n1452_001:0415b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人受近圓時，親教師不現前，諸苾芻為受近圓，此人得名受近圓不？」",
        "translation": "\"If a person's teacher isn't present when they're accepting a near-perfection, and the bhikṣus accept it for them, can that person be called an accepting near-perfection?\"",
        "source": "T24n1452_001:0415b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「是受近圓，諸苾芻得越法罪。」",
        "translation": "The Buddha said, \"Such acceptance of the near perfection will cause the monks to transgress the teaching.\"",
        "source": "T24n1452_001:0415b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若人受近圓時，作如是語：『莫授我近圓。』",
        "translation": "\"Suppose a person accepts a near-perfection and says, 'Don't give me a near-perfection.'",
        "source": "T24n1452_001:0415b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻為受，此人得名受近圓不？」",
        "translation": "Can this person be called a recipient of the near perfection when the bhikṣus accept it for him?\"",
        "source": "T24n1452_001:0415b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「非受近圓，諸苾芻得越法罪。」",
        "translation": "The Buddha said, \"Unless they are trained to approach completion, monks will be guilty of transgressing the Dharma.\"",
        "source": "T24n1452_001:0415b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如世尊說：『若人年滿七歲能驅烏鳥，應與出家。』",
        "translation": "\"Just as the Bhagavān said, 'If a person attains the age of seven years old and can chase away crows and birds, they should be allowed to leave home.'",
        "source": "T24n1452_001:0415b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，大德！",
        "translation": "Yes, Mañjuśrī!",
        "source": "T24n1452_001:0415b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有童子年始六歲，於僧食厨能驅烏鳥，此人應與出家不？」",
        "translation": "If a boy who is six years old and can chase crows and birds from the monks' kitchen, should he leave home?\"",
        "source": "T24n1452_001:0415b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「許滿七歲，此不應與。」",
        "translation": "The Buddha said, \"Perhaps after reaching the age of seven, this shouldn't be given.\"",
        "source": "T24n1452_001:0415b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若滿七歲不能驅烏，與出家不？」",
        "translation": "\"If you've reached the age of seven and can't drive a crow away, will you leave home?\"",
        "source": "T24n1452_001:0415b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不應，許能驅烏故。」",
        "translation": "The Buddha said, \"No, it's because it might drive away crows.\"",
        "source": "T24n1452_001:0415b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二子攝頌曰：　日數每應知、　　告白夜須減、　六日十八日、　　說戒不應頻。",
        "translation": "The second son gathered this verse, saying, \"You should know the number of days each, tell the white night to be reduced, and preach the precepts not too often for six days or eighteen days.",
        "source": "T24n1452_001:0415b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛在室羅伐城，有婆羅門居士等至苾芻所問言：「阿離耶！",
        "translation": "It was then that the Buddha was present in the city of Śrāvastī when some Brāhmaṇa householders and others came to the monks and asked, \"Alakay!",
        "source": "T24n1452_001:0415b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是何日？」",
        "translation": "What day is it now?\"",
        "source": "T24n1452_001:0415c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不知。」",
        "translation": "They replied, \"I don't know.\"",
        "source": "T24n1452_001:0415c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人告曰：「聖者！",
        "translation": "The people told him, \"Sage!",
        "source": "T24n1452_001:0415c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道之類於諸日數及以星曆悉皆善識，仁等亦應知日數星曆。",
        "translation": "That kind of non-Buddhist is well-versed in the number of the sun and the stars, so you, too, should know the number of the sun and the stars.",
        "source": "T24n1452_001:0415c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不解而為出家？」",
        "translation": "Why don't they understand them and become renunciant monks?\"",
        "source": "T24n1452_001:0415c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂默不答。",
        "translation": "They then remained silent and didn't answer.",
        "source": "T24n1452_001:0415c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻以緣白佛，佛言：「我今聽諸苾芻知日數星曆。」",
        "translation": "The monks brought the matter to the Buddha's attention, and he said, \"Now, I've heard that the monks know the number of the sun and the stars and calendars.\"",
        "source": "T24n1452_001:0415c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻悉皆學數星曆及以算法，便生擾亂廢修善業，佛言：「應令一人學數。」",
        "translation": "When all the monks had learned to count calendars and calendrical calculations, they became disturbed and discouraged good actions, and the Buddha said, \"One of them should learn to count.\"",
        "source": "T24n1452_001:0415c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖聞佛教，不知誰當合數？",
        "translation": "Even though they've heard of Buddhism, they don't know who should fit the numbers.",
        "source": "T24n1452_001:0415c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「應令眾首上座數之。」",
        "translation": "The Buddha said, \"You should have the head monk count them.\"",
        "source": "T24n1452_001:0415c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時上座忘失其數，使知事人亦不能憶，佛言：「可作泥珠、或作竹籌，滿十五枚，每日移一。」",
        "translation": "When the head monk forgot to count them, so that even those in positions of authority couldn't remember, the Buddha said, \"You can make clay beads or bamboo sticks, fill them with fifteen pieces, and move one piece each day.\"",
        "source": "T24n1452_001:0415c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此作時被風吹亂，佛言：「應取十五枚竹片，可長四五指，一頭穿孔以繩貫之，挂壁要處，每日移一。」",
        "translation": "When they did so, the wind blew them about, and the Buddha said, \"You should take fifteen pieces of bamboo that are about four or five fingers long, put a hole through one end, thread a string through it, hang them over a wall, and move one every day.\"",
        "source": "T24n1452_001:0415c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼舉眾皆共移籌，佛言：「上座及知事者應移。」",
        "translation": "When the whole crowd gathered to move the chips, the Buddha said, \"The superior monks and those who know their duties should move them.\"",
        "source": "T24n1452_001:0415c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有婆羅門居士至苾芻所問言：「聖者！",
        "translation": "Then a Brāhmaṇa monk came to the monk and asked, \"Sage!",
        "source": "T24n1452_001:0415c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是何日？」",
        "translation": "What day is it now?\"",
        "source": "T24n1452_001:0415c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼便報曰：「仁今可問上座及知事人。」",
        "translation": "They then reported, \"Sir, now you can ask the superior seat and the person who knows the office.\"",
        "source": "T24n1452_001:0415c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人告曰：「仁等亦有計番當直知日人耶？」",
        "translation": "The men told them, \"Do you also have plans for someone who will directly know the sun?\"",
        "source": "T24n1452_001:0415c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻默然無答。",
        "translation": "The monks then remained silent and didn't answer.",
        "source": "T24n1452_001:0415c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以緣白佛，佛言：「應可作白普告眾人。」",
        "translation": "They then cited this as a reason to tell the Buddha, who said, \"You may make a statement to the people.\"",
        "source": "T24n1452_001:0415c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻隨處告白，佛言：「不應隨處作白，然於眾集，在上座前而為秉白：『大眾應知：今是月一日。』」",
        "translation": "The bhikṣus then told them to confess their sins wherever they liked, and the Buddha said, \"You shouldn't confess your sins wherever you like, but when you're gathered here, you should explain it to the elder monk, 'Everyone should know that today is the first day of the moon.'\"",
        "source": "T24n1452_001:0415c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸俗聞說復云：「仁等豈可不說半月黑白分耶？」",
        "translation": "The laypeople who heard what he said then said, \"Couldn't you people have said, 'Half a moon is black and white?'\"",
        "source": "T24n1452_001:0415c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不作。」",
        "translation": "He replied, \"Don't do it.\"",
        "source": "T24n1452_001:0415c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻白佛，佛言：「當稱黑白月分。",
        "translation": "The monk said to the Buddha, \"The Buddha said, 'You should call it the black and white portions of the moon.'",
        "source": "T24n1452_001:0415c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是說：若於晡後大眾集時，令一苾芻於上座前合掌而立，一心恭敬作如是白：『大德僧伽聽！",
        "translation": "You should say this: 'When the assembly gathers after 3 p.m., have a monk stand in front of the head monk's seat with his palms together and say with one heart and respect, 'Listen, Mañjuśrī!'",
        "source": "T24n1452_001:0415c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是黑月一日，仁等應為造寺施主及護寺天神，并舊住天神各誦經中清淨妙頌。』」",
        "translation": "Now, on the first day of the dark moon, you should recite the pure and wonderful verses from the sūtras for the temple builder, the temple guardian gods, and the gods who used to reside there.'\"",
        "source": "T24n1452_001:0415c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻雖復日日告白，不稱造寺施主名字，佛言：「當稱造寺施主名字，亦應稱說明日設食施主名字，令彼施主所願隨意福善彌增。",
        "translation": "Although the monks kept confessing day after day that they didn't call the temple builder by name, the Buddha said, \"You must call the temple builder by name, and you must also call the donor of tomorrow's meal by name, so that the donor's wishes will be increased in goodness and fortune.",
        "source": "T24n1452_001:0415c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若更有餘施主皆同此說，及餘天眾八部之類，師僧父母皆悉稱名，普及一切眾生，皆令福利增長。」",
        "translation": "若更有餘施主皆同此說，及餘天眾八部之類，師僧父母皆悉稱名，普及一切眾生，皆令福利增長。」",
        "source": "T24n1452_001:0416a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻聞是語已，即皆各說清淨伽他曰：「所為布施者，　　必獲其義利；　若為樂故施，　　後必得安樂。",
        "translation": "After the monks heard these words, they each said, \"That almsgiver will surely obtain its benefits, and if he gives for pleasure, he'll surely attain well-being later.",
        "source": "T24n1452_001:0416a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　菩薩之福報，　　無盡若虛空；　施獲如是果，　　增長無休息。」",
        "translation": "The reward of a bodhisattva's merit is inexhaustible like space; the result of such giving will increase without rest.\"",
        "source": "T24n1452_001:0416a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有施主，請諸苾芻當設供養，苾芻知已不為宣告施主名及以住處，佛言：「應預宣告施主名字云：『施主某甲，明日當為大眾設食，住在某處！』」",
        "translation": "When a donor invited the monks to make offerings, the monks knew better and didn't announce the donor's name or place of abode, but the Buddha said, \"You should announce the donor's name in advance, saying, 'Donor A., tomorrow you'll serve food to the people and stay at a certain place!'\"",
        "source": "T24n1452_001:0416a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有婆羅門居士，至苾芻處問言：「聖者！",
        "translation": "Another Brāhmaṇa monk came to the monk and asked, \"Sage!",
        "source": "T24n1452_001:0416a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是何日？」",
        "translation": "What day is it now?\"",
        "source": "T24n1452_001:0416a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「是十五日。」",
        "translation": "They replied, \"It's the fifteenth day.\"",
        "source": "T24n1452_001:0416a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼復問曰：「時人皆云十四日，如何仁等言十五耶？",
        "translation": "Again, he asked, \"People say it's the 14th day, but how can you say the 15th day?",
        "source": "T24n1452_001:0416a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈可苾芻不為減夜？」",
        "translation": "Is it possible that a monk doesn't spend less time in detention?\"",
        "source": "T24n1452_001:0416a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不作。」",
        "translation": "They replied, \"Don't do it.\"",
        "source": "T24n1452_001:0416a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「應為減夜。」",
        "translation": "The monks then brought the matter to the Buddha's attention, and he said, \"It should be done for less night.\"",
        "source": "T24n1452_001:0416a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻頻於半月而為減夜，俗人問言：「聖者！",
        "translation": "When the monks frequently made it less night than half a moon, the laypeople asked, \"Sage!",
        "source": "T24n1452_001:0416a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是何日？」",
        "translation": "What day is it now?\"",
        "source": "T24n1452_001:0416a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「是十四。」",
        "translation": "They replied, \"Yes, 14.\"",
        "source": "T24n1452_001:0416a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼言：「聖者！",
        "translation": "He said, \"Sage!",
        "source": "T24n1452_001:0416a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時人皆云十五日，如何仁等頻於半月而為減夜？」",
        "translation": "Everyone says it's the fifteenth day, but how is it that you often lose the night at the half-moon?\"",
        "source": "T24n1452_001:0416a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「汝等不應頻於半月而減其夜。",
        "translation": "The monks then brought the matter to the Buddha's attention, and he said, \"You shouldn't frequently reduce the night of a half-moon.",
        "source": "T24n1452_001:0416a19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然須計時過月半已應為減夜(謂從正月十六日至二月十五日為一月。",
        "translation": "However, you must take the time to reduce the night after the half-moon (that is, from the sixteenth day of the first month until the fifteenth day of February is one month.",
        "source": "T24n1452_001:0416a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從二月十六日至月盡，即是月半，令減一夜為其小月，餘皆倣此，為東西不同故)，如是一歲總有六日是十四日，有六日是十五日為長淨事。」",
        "translation": "From the sixteenth day of February until the end of the month, that's the half of the month, so that one night is subtracted from it to make it a lesser month, and the rest follow suit because things are different.) Thus, in a year, there are always six days that are 14 days and six days that are 15 days, which is a long and pure event.\"",
        "source": "T24n1452_001:0416a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有婆羅門居士來問苾芻曰：「聖者！",
        "translation": "Then a Brāhmaṇa monk came to the monk and asked, \"Sage!",
        "source": "T24n1452_001:0416a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是何月？」",
        "translation": "What month is it now?\"",
        "source": "T24n1452_001:0416a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「今是室羅末拏月(當五月十六日已去至六月十五日)。」",
        "translation": "He replied, \"Now is the month of śramaṇa (which will be from the sixteenth day of the fifth month until the fifteenth day of the sixth month).\"",
        "source": "T24n1452_001:0416a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼復問言：「聖者！",
        "translation": "Again, he asked, \"Sage!",
        "source": "T24n1452_001:0416a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人咸云阿沙荼月(從四月十六日至五月十五日)，仁等乃云室羅末拏月，豈可仁等不為閏月耶？」",
        "translation": "Everyone says it's the month of Āṣāḍha (from April 16 to May 15), but you say it's the month of śramaṇa, so could it be that you're not a leap month?\"",
        "source": "T24n1452_001:0416a26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「不為。」",
        "translation": "He replied, \"I don't think so.\"",
        "source": "T24n1452_001:0416a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人皆共笑。",
        "translation": "Everyone laughed.",
        "source": "T24n1452_001:0416a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「應為閏月。」",
        "translation": "The monks then brought the matter to the Buddha's attention, and he said, \"It should be a leap month.\"",
        "source": "T24n1452_001:0416a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻於每年中恒為閏月，俗人來問：「聖者！",
        "translation": "When the monks continued to observe leap months every year, the laypeople came and asked, \"Sage!",
        "source": "T24n1452_001:0416a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今是何月？」",
        "translation": "What month is it now?\"",
        "source": "T24n1452_001:0416b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「是阿沙荼月。」",
        "translation": "He replied, \"It's Āṣāḍamāla.\"",
        "source": "T24n1452_001:0416b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼復問言：「聖者！",
        "translation": "Again, he asked, \"Sage!",
        "source": "T24n1452_001:0416b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人咸云：『今是室羅末拏月。』",
        "translation": "Everyone said, 'Now it's the month of śramaṇa.'",
        "source": "T24n1452_001:0416b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁等乃云：『是阿沙荼月。』",
        "translation": "You people then said, 'It's the month of Āṣāḍha.'",
        "source": "T24n1452_001:0416b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈可仁等於每年中為閏月耶？」",
        "translation": "Is it possible that you people have a leap month every year?\"",
        "source": "T24n1452_001:0416b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「如是。」",
        "translation": "He replied, \"So it is.\"",
        "source": "T24n1452_001:0416b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同前譏笑。",
        "translation": "The same criticism was directed at the monk.",
        "source": "T24n1452_001:0416b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻以緣白佛，佛言：「不應於年年中而作閏月，應至六歲方為閏月(即是五六當三十月。",
        "translation": "The monk told the Buddha about this, and he said, \"A leap month shouldn't be made in the middle of each year; it should be a leap month only when it's six years old (that is, when five or six are thirty months).",
        "source": "T24n1452_001:0416b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此謂古法，與今不同)。」",
        "translation": "This is called the ancient teaching, which is different from the present.\"",
        "source": "T24n1452_001:0416b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有國王，至二年半便為一閏，苾芻不隨，人共嫌恥。",
        "translation": "Then there was a king who had a leap month until he was two and a half years old, and the monks didn't follow him, so people disliked him.",
        "source": "T24n1452_001:0416b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「苾芻應隨王法為其閏月，若星道行參差者，亦應隨其星道而數用之。",
        "translation": "The Buddha said, \"The monks should follow the king's teaching about leap months, and if there are differences in the paths of the stars, they should also count and use them according to their paths.",
        "source": "T24n1452_001:0416b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等應可識知日月星分與俗同行，令諸外道來求過者不得其便。」",
        "translation": "Therefore, you should know that the sun, moon, and stars travel with the common people, so that those non-Buddhists who come seeking to surpass them won't be able to do so.\"",
        "source": "T24n1452_001:0416b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0416b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗有苾芻住處令授學人得說戒不？」",
        "translation": "Is there a place where a monk lives and allows a student to receive the precepts?\"",
        "source": "T24n1452_001:0416b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"Not allowed!\"",
        "source": "T24n1452_001:0416b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三子攝頌曰：　界別不告淨，　　亦不為羯磨，　乘空不持欲，　　解前方結後。",
        "translation": "The third son gathered this verse, saying, \"He doesn't tell the world about the purity of the boundary, doesn't perform karmas, rides in emptiness, and doesn't hold desires after he releases the bonds ahead.",
        "source": "T24n1452_001:0416b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛在室羅伐城，具壽鄔波離請世尊曰：「住界內人得向界外者告清淨不？」",
        "translation": "It was then that the Buddha was present in the city of Śrāvastī when Goswami Upāli asked the Bhagavān, \"Can someone who lives inside the boundary tell someone outside the boundary that it's pure?\"",
        "source": "T24n1452_001:0416b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0416b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「住界外人得向界內者告清淨不？」",
        "translation": "\"Can someone who lives outside the [three] realms tell someone inside the realms that they're pure?\"",
        "source": "T24n1452_001:0416b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0416b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「住界內人得為界外者作羯磨不？」",
        "translation": "\"Can someone who lives inside the [three] realms perform a karman for someone outside the realms?\"",
        "source": "T24n1452_001:0416b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0416b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「住界外人得為界內者作羯磨不？」",
        "translation": "\"Can someone who lives outside the [three] realms perform a karman for someone inside the realms?\"",
        "source": "T24n1452_001:0416b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0416b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有乘空持欲去，時成持欲不？」",
        "translation": "\"If someone rides off holding a desire for emptiness, does he then become a holder of that desire?\"",
        "source": "T24n1452_001:0416b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不成，應更取欲。」",
        "translation": "The Buddha said, \"If you don't, you should further pursue your desires.\"",
        "source": "T24n1452_001:0416b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若不解前界得結後界不？」",
        "translation": "\"If you don't understand the prior realm, can you tie the knot in the latter realm?\"",
        "source": "T24n1452_001:0416b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得，應以白四解前然後方結。」",
        "translation": "The Buddha said, \"No, you must explain the four resolves before you tie the knot.\"",
        "source": "T24n1452_001:0416b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四子攝頌曰：　不入界捨界，　　樹界有世尊，　不越及可越，　　羯磨者身死。",
        "translation": "The fourth son gathered the verse, saying, \"He doesn't enter the [three] realms and leaves them, the Bhagavān exists in the tree realm, he doesn't transgress or can transgress, and his karma kills him.",
        "source": "T24n1452_001:0416b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽鄔波離請世尊曰：「頗得以界入餘界不？」",
        "translation": "Gautama Upāli asked the Bhagavān, \"Will he enter the other realms with the realms?\"",
        "source": "T24n1452_001:0416b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"Not allowed.\"",
        "source": "T24n1452_001:0416b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「有幾種界不相涉入？」",
        "translation": "\"How many kinds of elements are there that don't involve each other?\"",
        "source": "T24n1452_001:0416b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「謂小壇場及現停水處，并苾芻、苾芻尼界，此皆不入。」",
        "translation": "The Buddha said, \"These are small altar sites, places where water is presently stopped, and the realms of bhikṣus and bhikṣuṇīs, which are not to be entered.\"",
        "source": "T24n1452_001:0416b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若先結界，有幾種捨法？」",
        "translation": "\"If you first form a boundary, what kinds of equanimity are there?\"",
        "source": "T24n1452_001:0416c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有五：一謂大眾悉皆歸俗，二謂大眾同時轉根，三謂大眾決心捨去，四謂大眾俱時命過，五謂秉白四羯磨解。」",
        "translation": "The Buddha said, \"There are five: one, when the whole group goes back to the conventional world, two, when the group changes roots at the same time, three, when the group is determined to abandon, four, when the group's life is over at the same time, and five, when the group understands the four karmas.\"",
        "source": "T24n1452_001:0416c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得以一樹為二界標不？」",
        "translation": "\"Can one tree be the standard for two realms?\"",
        "source": "T24n1452_001:0416c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「各取一邊得為三界標，或為四界標，量知分齊皆得成就。」",
        "translation": "The Buddha said, \"Take one side of each and you'll attain the mark of the three realms, or you'll attain the mark of the four realms if you measure and know the parts equally.\"",
        "source": "T24n1452_001:0416c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊在迦尸國人間遊行，遇到一處遂便微笑。",
        "translation": "It was then that the Bhagavān was traveling among the people of Kāśī and came upon a place where he smiled.",
        "source": "T24n1452_001:0416c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊常法，若微笑時，即於口中，出五種色：青、黃、赤、白及以紅光，或時下照、或復上昇。",
        "translation": "The Bhagavān's constant teaching is that when he smiles, five colors emerge from his mouth: a blue, yellow, red, white, and red light that sometimes shines down and sometimes rises up.",
        "source": "T24n1452_001:0416c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其光下者，至等活地獄、黑繩地獄、眾合地獄、號叫地獄、大號叫地獄、燒然地獄、大燒然地獄、無間地獄、疱形地獄、連疱地獄、阿吒吒地獄、阿呵呵地獄、阿呼呼地獄、青蓮花地獄、紅蓮花地獄、大紅蓮花地獄。",
        "translation": "The light goes down to the hell of the living, the hell of the black cord, the hell of the many combinations, the hell of the shouting, the hell of the great shouting, the hell of the burning, the hell of the great burning, the hell of the unremitting hell, the hell of the blistering form, the hell of the blistering pearl, the hell of Aṭṭā, the hell of Ahā, the hell of Ahok, the hell of the blue lotus, the hell of the red lotus, and the hell of the great red lotus.",
        "source": "T24n1452_001:0416c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等處，若受炎熱皆得清涼，居處寒氷便獲溫暖。",
        "translation": "Such places can be cooled if they experience heat, and they can be warmed if they live in cold or ice.",
        "source": "T24n1452_001:0416c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸有情各得安樂，皆作是語：「我與汝等，為從此死生餘處耶？」",
        "translation": "Each of those sentient beings attains well-being and says, \"Did we and you come from this place of death to be born in another place?\"",
        "source": "T24n1452_001:0416c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊令彼有情生信心故，復現餘相。",
        "translation": "It was then that the Bhagavān caused those sentient beings to have faith and then showed them another sign.",
        "source": "T24n1452_001:0416c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼見相已咸作是語：「我等不於此死而生餘處，然我必由希有大人威神力故，令我身心現處安樂。」",
        "translation": "After they saw their appearances, they all said, \"We won't be born elsewhere after this death, but I will surely be made to live in well-being, both physically and mentally, by the authoritative power of a rare great person.\"",
        "source": "T24n1452_001:0416c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既生敬信，能滅地獄所有諸苦，於人天處受勝妙身，當為法器得見真理。",
        "translation": "Having developed respect and faith, they'll be able to end all the suffering of hell, receive a marvelous body in a human or heavenly place, and become Dharma vessels who will see the truth.",
        "source": "T24n1452_001:0416c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其光上昇者，從四大王眾天，至三十三天、夜摩天、覩史多天、樂變化天、他化自在天、梵眾天、梵輔天、大梵天、少光天、無量光天、極光淨天、少淨天、無量淨天、遍淨天、無雲天、福生天、廣果天、無煩天、無熱天、善現天、善見天，乃至色究竟天，於此光中演說苦空無常無我等法，并說二伽他曰：「汝當求出離，　　於佛教勤修，　降伏生死軍，　　如象摧草舍。",
        "translation": "When their light rises, from the four great guardian heavens to the Trāyastriṃśa Heaven, Yama Heaven, Tuṣita Heaven, Paranirmitavaśavartin Heaven, Brahmakāyika Heaven, Brahmā-Assisted Heaven, Brahmakāyika Heaven, Limitlessly Radiant Heaven, Perfectly Radiant Pure Heaven, Lesser Pure Heaven, Limitlessly Pure Heaven, Universally Pure Heaven, Cloudless Heaven, Fortunate Life Heaven, Vastly Fruited Heaven, Trouble-Free Heaven, Heat-Free Heaven, Well-Presented Heaven, Well-Seeing Heaven, and even the Form Finality Heaven, they speak in this light about such things as suffering, emptiness, impermanence, and selflessness, and they say to Ekata, \"You must seek escape, diligently cultivate Buddhism, and subdue the armies of birth-and-death like an elephant destroying a hayloft.",
        "source": "T24n1452_001:0416c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於此法律中，　　常為不放逸，　能竭煩惱海，　　當盡苦邊際。」",
        "translation": "Always remaining nonfrivolous in regard to these principles, you'll be able to dry up the ocean of affliction and will end the limit of suffering.\"",
        "source": "T24n1452_001:0417a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼光明遍照三千大千世界已，還至佛所。",
        "translation": "After that light shone everywhere in the 3,000 great one-thousand worlds, he returned to the Buddha.",
        "source": "T24n1452_001:0417a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛世尊說過去事，光從背入。",
        "translation": "If the Bhagavān had spoken about past events, the light would have entered through his back.",
        "source": "T24n1452_001:0417a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說未來事，光從胸入。",
        "translation": "If he talked about future events, the light would enter through his chest.",
        "source": "T24n1452_001:0417a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說地獄事，光從足下入。",
        "translation": "If he talks about the events of hell, the light enters through his feet.",
        "source": "T24n1452_001:0417a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說傍生事，光從足跟入。",
        "translation": "If he talked about the affairs of the near-by world, the light would enter through his heels.",
        "source": "T24n1452_001:0417a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說餓鬼事，光從足指入。",
        "translation": "If he speaks about the affairs of hungry ghosts, the light enters through his fingers.",
        "source": "T24n1452_001:0417a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說人事，光從膝入。",
        "translation": "If he speaks about human affairs, the light enters through his knees.",
        "source": "T24n1452_001:0417a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說力輪王事，光從左手掌入。",
        "translation": "If he speaks about the affairs of a powerful wheel-turning king, the light enters through the palm of his left hand.",
        "source": "T24n1452_001:0417a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說轉輪王事，光從右手掌入。",
        "translation": "If he speaks about the affairs of wheel-turning kings, the light enters through the palm of his right hand.",
        "source": "T24n1452_001:0417a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說天事，光從臍入。",
        "translation": "If he speaks about the affairs of the gods, the light enters through his navel.",
        "source": "T24n1452_001:0417a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說聲聞事，光從口入。",
        "translation": "If he speaks about the affairs of the śrāvakas, the light enters through his mouth.",
        "source": "T24n1452_001:0417a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說獨覺事，光從眉間入。",
        "translation": "If he speaks about the affairs of the solitary realizers, the light enters through his eyebrows.",
        "source": "T24n1452_001:0417a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說阿耨多羅三藐三菩提事，光從頂入。",
        "translation": "If he spoke about the matters of unsurpassed, correct enlightenment, the light would enter from the top of his head.",
        "source": "T24n1452_001:0417a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時光明遶佛三匝從頂而入。",
        "translation": "The light then circled the Buddha three times, entered from the top, and went out.",
        "source": "T24n1452_001:0417a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時具壽阿難陀合掌恭敬而白佛言：「世尊！",
        "translation": "Kauṣṭhila Ānanda then put his palms together in respect and said to the Buddha, \"Bhagavān!",
        "source": "T24n1452_001:0417a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正等覺熙怡微笑，非無因緣。」",
        "translation": "The Tathāgata, Arhat, and Completely Enlightened One smiles joyfully, not without cause.\"",
        "source": "T24n1452_001:0417a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說伽他而請佛曰：「口出種種妙光明，　　流滿大千非一相；　周遍十方諸剎土，　　如日光照盡虛空。",
        "translation": "He then said to the buddha, \"Various wonderful lights emanate from his mouth, filling a great chiliocosm with no single characteristic, pervading the buddhas in the ten directions like sunbeams shining through space.",
        "source": "T24n1452_001:0417a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛是眾生最勝因，　　能除憍慢及憂慼；　無緣不啟於金口，　　微笑當必演希奇。",
        "translation": "The Buddha is the most excellent cause of sentient beings, able to remove conceit and grief; without a cause or condition, he doesn't open his golden mouth, and his smile will surely reveal something rare.",
        "source": "T24n1452_001:0417a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　安詳審諦牟尼尊，　　樂欲聞者能為說；　如師子王發大吼，　　願為我等決疑心。",
        "translation": "Venerable Muni, who carefully investigates, is eager to hear those who can speak for him, like a lion king who raises his voice and wants to resolve our doubts.",
        "source": "T24n1452_001:0417a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如大海內妙山王，　　若無因緣不搖動；　自在慈悲現微笑，　　為渴仰者說因緣。」",
        "translation": "Like the king of a marvelous mountain within the ocean that doesn't budge without a cause, he smiles with unbounded compassion and explains the causes and conditions for those who long for him.\"",
        "source": "T24n1452_001:0417a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告阿難陀曰：「如是，如是。",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"So it is, so it is.",
        "source": "T24n1452_001:0417a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1452_001:0417a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非無因緣，如來、應、正等覺輒現微笑。",
        "translation": "It's not for lack of a cause that the Tathāgata, the Worthy One, and the Perfectly Enlightened One easily appear to smile.",
        "source": "T24n1452_001:0417a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1452_001:0417a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此地方所，乃是過去迦攝波佛為聲聞眾說法之處。」",
        "translation": "This is the place where Kāśyapa Buddha taught the Dharma to the śrāvakas in the past.\"",
        "source": "T24n1452_001:0417a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀聞是語已，疾疾取七條衣疊為四重，白佛言：「世尊！",
        "translation": "After hearing these words, Ānanda quickly took seven pieces of clothing and folded them into four layers, saying to the Buddha, \"Bhagavān!",
        "source": "T24n1452_001:0417a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我已敷座，願佛知時可於斯坐，冀令此地有二正覺受用之處，謂迦攝波佛及今世尊。」",
        "translation": "Now that I've prepared my seat, may the Buddha know that I can sit here, hoping to make this place a place where two right awakenings can be enjoyed, namely, Kāśyapa Buddha and the present Bhagavān.\"",
        "source": "T24n1452_001:0417a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難陀曰：「善哉，善哉！",
        "translation": "The Buddha told Ānanda, \"Good, good!",
        "source": "T24n1452_001:0417b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我雖不說汝自知時。」",
        "translation": "Although I won't tell you, you'll know it yourself when you see it.\"",
        "source": "T24n1452_001:0417b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即便就座，復告阿難陀曰：「此地方所，是迦攝波佛所住之寺、此是經行處、此是廊宇門屋洗足之處、此是淨厨地、此是浴室處，汝等應知。」",
        "translation": "It was then that the Bhagavān again addressed Ānanda as he took his seat, \"This is the temple where Kāśyapa Buddha lives, this is a place for walking, this is a veranda, this is a doorway, this is a place to wash your feet, this is a pure kitchen, and this is a bathhouse, so you should know it.\"",
        "source": "T24n1452_001:0417b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時鄔波離白佛言：「世尊！",
        "translation": "Upāli then said to the Buddha, \"Bhagavān!",
        "source": "T24n1452_001:0417b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說，淨不淨地者，不知齊何名淨不淨？」",
        "translation": "According to the Buddha's teaching, he who is on the pure and impure stages doesn't know what is called pure and impure?\"",
        "source": "T24n1452_001:0417b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「乃至正法住世，有淨不淨。",
        "translation": "The Buddha said, \"Even when the right Dharma abides in the world, there's purity and impurity.",
        "source": "T24n1452_001:0417b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法若滅，悉皆不淨。」",
        "translation": "If the right teaching ceases, they're all impure.\"",
        "source": "T24n1452_001:0417b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T24n1452_001:0417b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "齊何名正法住世？",
        "translation": "What is the name of the right Dharma abiding in the world?",
        "source": "T24n1452_001:0417b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名滅？」",
        "translation": "What do we call extinction?\"",
        "source": "T24n1452_001:0417b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告鄔波離：「乃至有秉羯磨，有如說行者，是則名為正法住世。",
        "translation": "The Buddha told Upāli, \"Even if someone follows the protocols of karma and does what's described, this is called the right teaching abiding in the world.",
        "source": "T24n1452_001:0417b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不秉羯磨，無如說行，是則名為正法滅壞。」",
        "translation": "If someone doesn't follow the protocols of karma and doesn't practice as explained, this is called the cessation of the right teaching.\"",
        "source": "T24n1452_001:0417b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復白佛言：「若無上大師在於界外，苾芻得秉羯磨不？」",
        "translation": "Again, he said to the Buddha, \"If the unsurpassed teacher is outside the realm, can a monk hold the karma?\"",
        "source": "T24n1452_001:0417b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0417b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若大師在於界內，餘人得秉羯磨不？」",
        "translation": "\"If the great teacher is within the boundary, can other people follow the karma?\"",
        "source": "T24n1452_001:0417b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「得。」",
        "translation": "The Buddha said, \"Yes.\"",
        "source": "T24n1452_001:0417b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又得以世尊足僧數不？」",
        "translation": "\"May I also obtain a sufficient number of saṃgha from the Bhagavān?\"",
        "source": "T24n1452_001:0417b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得，佛寶僧寶體差別故。」",
        "translation": "The Buddha said, \"No, because of the distinction between the essence of the buddha's treasures and the saṃgha's treasures.\"",
        "source": "T24n1452_001:0417b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於不可越界得越過不？」",
        "translation": "\"Can you transgress an element that's not to be transgressed?\"",
        "source": "T24n1452_001:0417b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得。」",
        "translation": "The Buddha said, \"No!\"",
        "source": "T24n1452_001:0417b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0417b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不知有幾不可越界？」",
        "translation": "I wonder how much of this is untranscendable?\"",
        "source": "T24n1452_001:0417b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「有其五種：謂苾芻界、苾芻尼界、小壇場、現停水處、二界中間。」",
        "translation": "The Buddha said, \"There are five kinds: the bhikṣu element, the bhikṣuṇī element, the small altar site, the present water stop, and the middle of the two elements.\"",
        "source": "T24n1452_001:0417b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0417b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有深塹及以河澗，不可越界，頗得越不？」",
        "translation": "If there is a deep moat or a river, it must not cross the border; could it?\"",
        "source": "T24n1452_001:0417b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若常有橋梁，越之非咎。」",
        "translation": "The Buddha said, \"If there's always a bridge, it's not blameworthy to cross it.\"",
        "source": "T24n1452_001:0417b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如其橋梁破壞，得齊幾時名不失界？」",
        "translation": "\"If a bridge breaks down, how long does it last before it's called not losing the boundary?\"",
        "source": "T24n1452_001:0417b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「得齊七夜。",
        "translation": "The Buddha said, \"It's possible to complete seven nights.",
        "source": "T24n1452_001:0417b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此據有心修理，無心修理隨破即失。」",
        "translation": "This is based on mindfully repairing it; without mindfully repairing it, it'll be lost as soon as it's broken.\"",
        "source": "T24n1452_001:0417b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有苾芻正結界時，秉羯磨者忽然命過，得成結不？」",
        "translation": "\"If a monk suddenly takes the life of a karmic practitioner while he's in the process of forming a boundary, will he be able to form a bond?\"",
        "source": "T24n1452_001:0417b23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若知標相，所作羯磨已秉多分，此雖命過得成結界。",
        "translation": "The Buddha said, \"If someone knows the marked characteristics and has held the karma for many parts, then they'll be able to form a frontier even though their life has passed.",
        "source": "T24n1452_001:0417b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未知標相，所秉羯磨未過多分，此時命終，不成結界。」",
        "translation": "If someone doesn't know the marked characteristics and hasn't held the karma for more than a few moments, then the frontier won't be formed when their life ends.\"",
        "source": "T24n1452_001:0417b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若苾芻尼結界，成不？」",
        "translation": "\"If a bhikṣuṇī forms a boundary, will it be formed?\"",
        "source": "T24n1452_001:0417b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「准此應知。」",
        "translation": "\"You should know it from this.\"",
        "source": "T24n1452_001:0417b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五子攝頌曰：　地牆等秉事、　　結界無與欲，　但於一處坐，　　得為四羯磨。",
        "translation": "The fifth son gathered the verse, saying, \"It's a matter of the earth's walls and so forth, a condition of the realms that's not shared with desire, but sitting in one place, it becomes four karmas.",
        "source": "T24n1452_001:0417b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣在室羅伐城。",
        "translation": "It's in the city of Śrāvastī.",
        "source": "T24n1452_001:0417c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽鄔波離請世尊曰：「在地居人，共地居者遙秉羯磨，得成秉不？」",
        "translation": "Gautama Upāli asked the Bhagavān, \"Would a person who lives on the ground and works with a ground dweller to perform a karman as a remote support?\"",
        "source": "T24n1452_001:0417c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不成，與欲得成。」",
        "translation": "The Buddha said, \"It's not done, and the desire to get it done.\"",
        "source": "T24n1452_001:0417c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0417c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在地之人與牆頭者共秉羯磨，得成秉不？」",
        "translation": "Does a person on the ground who shares karma with a person at the wall become a buddha?\"",
        "source": "T24n1452_001:0417c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不成。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0417c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0417c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在地之人與樹上者共秉羯磨，得成秉不？」",
        "translation": "Does a person on the ground who shares a kalpa with someone on a tree become a kalpa?\"",
        "source": "T24n1452_001:0417c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不成。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0417c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0417c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在地之人與居空者共秉羯磨，得成秉不？」",
        "translation": "Will a person on the ground who shares the karma with someone who lives in the sky become a buddha?\"",
        "source": "T24n1452_001:0417c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不成。",
        "translation": "The Buddha said, \"It's not possible.",
        "source": "T24n1452_001:0417c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知以樹牆空為頭，各有四句亦如是。」",
        "translation": "You should know that if you take the emptiness of a tree wall as your head, each of the four phrases will be likewise.\"",
        "source": "T24n1452_001:0417c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如世尊說：『有百一羯磨』，幾合與欲？",
        "translation": "\"Just as the Bhagavān said, 'Is there a hundred and one karmas,' how much does it fit into the desire realm?'",
        "source": "T24n1452_001:0417c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾不合與欲？」",
        "translation": "How many times does it not accord with desire?\"",
        "source": "T24n1452_001:0417c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「唯除結界，餘並與欲。」",
        "translation": "The Buddha said, \"Only remove the fetters; the rest are objects of desire.\"",
        "source": "T24n1452_001:0417c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0417c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以神變幻術而作標相，得為標不？」",
        "translation": "If you make a mark by miraculous arts, can it be a mark?\"",
        "source": "T24n1452_001:0417c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得，神力幻術非實有故。」",
        "translation": "The Buddha said, \"No. It's because miraculous powers and techniques don't really exist.\"",
        "source": "T24n1452_001:0417c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「或以日月星宿為標相者，得成標不？」",
        "translation": "\"Perhaps someone uses the sun, moon, and stars as markers, will they become markers?\"",
        "source": "T24n1452_001:0417c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得，日月星宿非定住故。」",
        "translation": "The Buddha said, \"No, because the sun, moon, and stars aren't fixed in place.\"",
        "source": "T24n1452_001:0417c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若以水波浪，得成標不？」",
        "translation": "\"Suppose you use waves and water to form a standard, does it?\"",
        "source": "T24n1452_001:0417c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不得，由其波浪疾移轉故。」",
        "translation": "The Buddha said, \"No, it's because of the swift movement of those waves.\"",
        "source": "T24n1452_001:0417c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若苾芻為他持欲淨乘空而去，此得名為持欲淨不？」",
        "translation": "\"If a monk rides off in the air with pure desires for others, can this be called holding pure desires?\"",
        "source": "T24n1452_001:0417c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不成，應更取欲。」",
        "translation": "The Buddha said, \"If you don't, you should further pursue your desires.\"",
        "source": "T24n1452_001:0417c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若有苾芻秉一羯磨，於四住處並得成不？」",
        "translation": "\"If a monk holds to one karma, will he be able to fulfill all four abodes together?\"",
        "source": "T24n1452_001:0417c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「得。",
        "translation": "The Buddha said, \"They can.",
        "source": "T24n1452_001:0417c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其四界，各有四人事現前者，各於其處別置三人。",
        "translation": "Suppose there are four people in each of the four realms who appear before you, and each places three people in their place.",
        "source": "T24n1452_001:0417c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時秉法者，或席、或床、或板、或薦，壓四界上而秉羯磨。",
        "translation": "A Dharma bearer, whether it's a seat, a bed, a board, or a cushion, presses them up against the four elements and conducts the karma.",
        "source": "T24n1452_001:0417c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以秉法者添彼四數，咸成作法。",
        "translation": "By adding those four numbers to the bearer of the Dharma, they all become accomplished in the performance of the Dharma.",
        "source": "T24n1452_001:0417c20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是若於四界，有別事起，作七羯磨等，謂驅擯羯磨、今怖羯磨、折伏羯磨、求謝羯磨、不見罪羯磨、不如法悔羯磨、不捨惡見羯磨。",
        "translation": "Thus, if something else arises in the four realms, they perform seven karmas, which are the karma of expulsion, the karma of present fears, the karma of subduing, the karma of seeking thanks, the karma of not seeing a sin, the karma of repenting what's not right, and the karma of not abandoning bad views.",
        "source": "T24n1452_001:0417c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作此等羯磨之時，其秉法人，在彼四界角相近處，若以席板床薦總壓而坐，秉法皆成。」",
        "translation": "When these kinds of rituals are performed, if the person in control of the Dharma is sitting near the corners of the four realms with a mat or board and a seat pressed together, the control of the Dharma is accomplished.\"",
        "source": "T24n1452_001:0417c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六子攝頌曰：　大界兩驛半，　　下水上山巔，　異見明相過，　　五眾受七日。",
        "translation": "The sixth son gathered this verse, saying, \"Two and a half journeys across the great realm, down into the water and up to the top of the mountain, a different view reveals a different shape, and five multitudes are subjected to seven days.",
        "source": "T24n1452_001:0417c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽鄔波離請世尊曰：「如世尊說：『應結大界』者，齊幾許來是大界量？」",
        "translation": "Kauśāmbī requested the Bhagavān, \"Suppose the Bhagavān says, 'The great realm should be fettered,' how many times does that come to be the amount of the great realm?\"",
        "source": "T24n1452_001:0418a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大界者，齊兩踰膳那半，應可結之(言踰膳那者，當三十里，是此一驛，由旬者訛也。",
        "translation": "The Buddha said, \"The great realm is the same as two yojanas and a half, and it should be possible to tie it up (speaking of yojanas, it's 30 miles, which is a courier, and it's a falsity in terms of yojanas.",
        "source": "T24n1452_001:0418a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲令易了故有言驛之處)。」",
        "translation": "It's called a road trip because it's meant to be easy to understand.)\"",
        "source": "T24n1452_001:0418a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若過兩踰膳那半亦是界不？」",
        "translation": "\"Is it also a boundary if it's more than two yojana and a half?\"",
        "source": "T24n1452_001:0418a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若過非界。」",
        "translation": "The Buddha said, \"If it goes beyond that, it's not a realm.\"",
        "source": "T24n1452_001:0418a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「向下齊何名為大界？」",
        "translation": "\"How is the downward direction called the great element?\"",
        "source": "T24n1452_001:0418a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齊至水來名為大界。」",
        "translation": "The Buddha said, \"Coming together as one to reach the water is called the great element.\"",
        "source": "T24n1452_001:0418a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「兩踰膳那半外方至水者，此之剩處得名界不？」",
        "translation": "\"When two yojana and a half miles away, does the remaining place reach the water, can it be called a realm?\"",
        "source": "T24n1452_001:0418a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不是。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0418a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「向上齊何名為大界？」",
        "translation": "\"Upward, what's the name of the great element?\"",
        "source": "T24n1452_001:0418a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「上至樹抄或齊牆頭，名為界分。」",
        "translation": "The Buddha said, \"The part that reaches up to the top of a tree or aligns with the wall is called the delimitation part.\"",
        "source": "T24n1452_001:0418a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大德！",
        "translation": "\"Mañjuśrī!",
        "source": "T24n1452_001:0418a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩踰膳那半外方至抄頭，斯之剩處得名界不？」",
        "translation": "Two yojana and a half miles away, it reaches Cāṇḍu; can this remaining place be called a border?\"",
        "source": "T24n1452_001:0418a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不是。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0418a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若上山巔，齊何名界？」",
        "translation": "\"If you go up to the top of the mountain, what do you call the element?\"",
        "source": "T24n1452_001:0418a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「齊其水處。」",
        "translation": "The Buddha said, \"Level off the place where the water is.\"",
        "source": "T24n1452_001:0418a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「兩驛半外方至其水，亦名界不？」",
        "translation": "\"Is that also called a boundary, which is two and a half kilometers away from where the water reaches?\"",
        "source": "T24n1452_001:0418a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不是。」",
        "translation": "The Buddha said, \"No.\"",
        "source": "T24n1452_001:0418a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T24n1452_001:0418a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於夏中僧伽破壞。",
        "translation": "\"Suppose the saṃgha breaks up in the middle of summer.",
        "source": "T24n1452_001:0418a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有苾芻故從法黨向非法黨，為是破夏？",
        "translation": "Is this a way to disrupt the summer when some monk goes from a Dharma group to a non-Dharma group?",
        "source": "T24n1452_001:0418a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為非破耶？」",
        "translation": "Is it not refutation?\"",
        "source": "T24n1452_001:0418a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此之苾芻，樂其異見至惡黨處，經明相時，便即破夏。",
        "translation": "The Buddha said, \"Such a monk who is delighted with dissenting views and goes to a bad party will then break the summer retreat when he goes through the illuminating phase.",
        "source": "T24n1452_001:0418a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不樂異見至惡黨處，雖過明相不名破夏。」",
        "translation": "If someone who doesn't delight in dissenting views goes to a bad gang, even though it's past the time of the bright foreshadowing, it's not called breaking summer.\"",
        "source": "T24n1452_001:0418a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如世尊說：『若在夏中有緣須出，應受七日去。』",
        "translation": "\"Just as the Bhagavān said, 'If there's a reason to leave in the middle of summer, you should accept seven days to depart.'",
        "source": "T24n1452_001:0418a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，不知何人應受？」",
        "translation": "I wonder who should accept it?\"",
        "source": "T24n1452_001:0418a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「所謂五眾：苾芻、苾芻尼、正學女、求寂、求寂女。」",
        "translation": "The Buddha said, \"There are five kinds of people: bhikṣus, bhikṣuṇīs, women who are rightly training, those who are seeking extinction, and those who are seeking extinction.\"",
        "source": "T24n1452_001:0418a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「此於何處應受？」",
        "translation": "\"Where should this be received?\"",
        "source": "T24n1452_001:0418a18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「可於界內隨意可向一苾芻前合掌而住，作如是語：『具壽存念！",
        "translation": "The Buddha said, \"You may place your palms together in front of a monk at any time within the [three] realms and say, 'Long life, keep your mind!'",
        "source": "T24n1452_001:0418a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我苾芻某甲於此住處或前或後三月夏安居。",
        "translation": "'I, Bengku, will stay at this place for three summers, either before or after.",
        "source": "T24n1452_001:0418a20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我苾芻某甲，為僧伽事故，守持七日出界外，若無難緣還來此處，我於今夏在此安居。』",
        "translation": "I, a certain monk, went out of bounds for seven days to observe the affairs of the saṃgha, and if I had no difficult circumstances to return here, I would have stayed here this summer.'",
        "source": "T24n1452_001:0418a21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三說。",
        "translation": "These three things are explained like this.",
        "source": "T24n1452_001:0418a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有六日事來乃至一日，准七日應受，具如餘處。」",
        "translation": "If there are six days' worth of events that come up to one day, these are the seven days that should be accepted, just as they are in the other places.\"",
        "source": "T24n1452_001:0418a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七子攝頌曰：　五眾坐安居，　　親等請日去；　於經有疑問，　　求解者應行。",
        "translation": "The seventh son gathered this verse, saying, \"Five groups of people are sitting here in retreat, and they're invited by their relatives to leave on a day when they have questions about the sūtras, so those who seek to understand them should do so.",
        "source": "T24n1452_001:0418a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽鄔波離請世尊曰：「如世尊說：『應夏安居』者，未知誰合安居？」",
        "translation": "Kauśāmbī requested the Bhagavān, \"As the Bhagavān said, 'Should we retire for the summer retreat,' I wonder who will retire for the summer retreat?\"",
        "source": "T24n1452_001:0418a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「五眾合作：所謂苾芻、苾芻尼、正學女、求寂、求寂女。",
        "translation": "The Buddha said, \"Five people cooperate: a monk, a monk's nun, a woman who's rightly training, a woman who's seeking extinction, and a woman who's seeking extinction.",
        "source": "T24n1452_001:0418a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在於屏處對一苾芻，當前蹲踞作如是說：『具壽存念！",
        "translation": "In a secluded place, they face a monk who is crouching in front of them and says, 'Gokulo kunin!'",
        "source": "T24n1452_001:0418b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今僧伽五月十六日作夏安居。",
        "translation": "Now, on the 16th day of the fifth month, the saṃgha observes summer retreat.",
        "source": "T24n1452_001:0418b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我苾芻某甲亦於五月十六日作夏安居。",
        "translation": "I, Bengku, will also observe the summer retreat on the 16th day of the fifth month.",
        "source": "T24n1452_001:0418b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我苾芻某甲，於此住處界內前三月夏安居，以某甲為施主、某甲為營事人、某甲為瞻病人，於此住處，乃至若有圮裂穿壞，當修補之。",
        "translation": "During the previous three months of summer retreat within the boundaries of this dwelling place, I, Mr. Bhikṣu, had taken Mr. Bhikṣu as a donor, Mr. Bhikṣu as a manager, and Mr. Bhikṣu as a patient, and I repaired any cracks or damage in this dwelling place.",
        "source": "T24n1452_001:0418b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於今夏在此安居。』",
        "translation": "I'll stay here this summer.'",
        "source": "T24n1452_001:0418b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二、第三亦如是說，或前或後隨意應作應知。",
        "translation": "The second and third are likewise explained, either before or after as you like, and should be known as such.",
        "source": "T24n1452_001:0418b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼亦對尼，准苾芻作。",
        "translation": "A nun also tells a nun to tell a monk to do the same thing.",
        "source": "T24n1452_001:0418b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其求寂應對苾芻，正學女、求寂女對尼應作。」",
        "translation": "Their request for quiescence should be addressed to the monks, and the woman who's rightly training and the woman who's requesting quiescence should do the same for the nuns.\"",
        "source": "T24n1452_001:0418b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如世尊說：『苾芻坐夏之時，若有鄔波索迦等請喚之事，守持七日去。』",
        "translation": "\"Just as the Bhagavān said, 'When a monk sits in summer retreat, if he's summoned by a caller like upāsaka, he'll keep it for seven days and leave.'",
        "source": "T24n1452_001:0418b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "者，若有外道及親族等請喚，亦得去不？」",
        "translation": "If a monk is summoned by a non-Buddhist or a relative, will he also be allowed to leave?\"",
        "source": "T24n1452_001:0418b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此亦應去。」",
        "translation": "The Buddha said, \"This, too, should go.\"",
        "source": "T24n1452_001:0418b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若於三藏有疑須欲諮問，亦得去不？」",
        "translation": "\"If you have doubts about the Tripiṭaka and need to ask questions, can you also go?\"",
        "source": "T24n1452_001:0418b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「得去。」",
        "translation": "The Buddha said, \"You can go.\"",
        "source": "T24n1452_001:0418b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若苾芻未得求得、未解求解、未證求證，及有疑心須往開決，為斯等事，亦得守持七日去不？」",
        "translation": "\"If a monk seeks to attain something that has yet to be attained, seeks to understand something that has yet to be understood, seeks to realize something that has yet to be realized, or has doubts that need to be answered, can he also keep his mind for seven days and go away?\"",
        "source": "T24n1452_001:0418b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「皆得。",
        "translation": "The Buddha said, \"They're all allowed.",
        "source": "T24n1452_001:0418b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若受一日二日等，准此應作。」",
        "translation": "If you accept one day, two days, or so forth, you should do it according to this.\"",
        "source": "T24n1452_001:0418b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部尼陀那卷第一",
        "translation": "Mūlasarvâstivāda-nidāna, Vol. 1",
        "source": "T24n1452_001:0418b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐景龍四年",
        "translation": "four years of the Tang emperor Jinglong",
        "source": "T24n1452_001:0418b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歲次庚戌四月壬午朔十五日景申三藏法師大德沙門義淨宣釋梵本并綴文正字翻經沙門吐火羅大德達磨[禾*未]磨證梵義翻經沙門中天竺國大德拔努證梵義翻經沙門罽賓國大德達磨難陀證梵文翻經沙門淄州大雲寺大德慧沼證義翻經沙門洛州崇光寺大德律師道琳證義翻經沙門福壽寺主大德利明證義翻經沙門渭州太平寺大德律師道恪證義翻經沙門大薦福寺大德勝莊證義翻經沙門相州禪河寺大德玄傘證義筆受翻經沙門大薦福寺大德智積證義正字翻經沙門德州大雲寺主慧傘證義翻經沙門西涼州白塔寺大德慧積讀梵本翻經婆羅門右驍衛翊府中郎將員外置宿衛臣李釋迦讀梵本翻經婆羅門東天竺國左屯衛翊府中郎將員外置同正員臣翟金剛證義翻經婆羅門東天竺國大首領臣伊金羅證梵本翻經婆羅門左領軍衛中郎將迦濕彌羅國王子臣何順證義翻經婆羅門東天竺國左領軍右執戟直中書省臣頗具讀梵本翻經婆羅門龍播國大達官准五品臣李輸羅證譯金紫光祿大夫守尚書左僕射同中書門下三品上柱國史舒國公臣韋臣源監譯尚書右僕射同中書門下三品上柱國許國公臣蘇環監譯特進行太子少師同中書門下三品上柱國宋國公臣唐休璟監譯特進太子少保兼揚州大都督同中書門下三品監修國史上柱國彭國公臣韋溫監譯特進同中書門下三品修文館大學士監修國史上柱國趙國公臣李嶠筆受兼潤色特進侍中監修國史上柱國公臣韋安石監譯侍中監修國史上柱國越國公臣紀處訥監譯光祿大夫行中書令修文館大學士監國史上柱國郢國公臣宗楚客監譯中書令監修國史上柱國酇國公臣蕭至忠監譯翻經學士銀青光祿大夫守兵部尚書門下三品修文館大學士上柱國逍遙公臣韋嗣立翻經學士中散大夫守中書侍郎同中書門下三品著紫佩金魚修文館學士上柱國臣趙彥昭翻經學士太中大夫守祕書監員外置同正員修國史修文館學士上柱國臣劉憲翻經學士銀青光祿大夫行中書侍郎修文館學士兼修國史上柱國朝陽縣開國子臣岑義翻經學士通議大夫守吏部侍郎修文館學士兼修國史上柱國臣崔湜翻經學士朝議大夫守兵部侍郎兼修文館學士修國史上柱國臣張說翻經學士太中大夫檢校兵部侍郎騎尉修文館學士安平縣開國子臣崔日用翻經學士朝請大夫守中書舍人兼檢校吏部侍郎修文館學士經車都尉臣盧藏用翻經學士銀青光祿大夫行禮部侍郎修文館學士修國史上柱國慈源縣開國子臣徐堅貞翻經學士正議大夫行國子司業修文館學士上柱國臣郭山惲翻經學士禮部郎中修文館直學士輕車都尉河東縣開國男臣薜稷翻經學士正議大夫前蒲州刺史修文館學士上柱國高平縣開國子臣徐彥伯翻經學士中大夫行中書舍人修文館學士上柱國臣李乂翻經學士中書舍人修文館學士上柱國金鄉縣開國男韋元亘翻經學士中大夫行中書舍人修文館學士上柱國臣馬懷素翻經學士朝請大夫守給事中修文館學士上柱國臣李適翻經學士中書舍人修文館學士上柱國臣蘇頲翻經學士朝散大夫守著作郎修文館學士兼修國史臣鄭愔翻經學士朝散大夫行起居郎修文館直學士上護軍臣沈佺期翻經學士朝請大夫行考功員外郎修文館直學士上輕車都尉臣武平翻經學士著作佐郎修文館直學士臣閻朝隱翻經學士修文館直學士臣符鳳書手祕書省楷書令史臣趙希令寫孔目官文林郎少府監掌治署丞臣殷庭龜判官朝散大夫行著作佐郎臣劉令植使金紫光祿大夫行祕書監檢校殿中監兼知內外閑廐隴右三使上柱國嗣號臣王邕",
        "translation": "歲次庚戌四月壬午朔十五日景申三藏法師大德沙門義淨宣釋梵本并綴文正字翻經沙門吐火羅大德達磨[禾*未]磨證梵義翻經沙門中天竺國大德拔努證梵義翻經沙門罽賓國大德達磨難陀證梵文翻經沙門淄州大雲寺大德慧沼證義翻經沙門洛州崇光寺大德律師道琳證義翻經沙門福壽寺主大德利明證義翻經沙門渭州太平寺大德律師道恪證義翻經沙門大薦福寺大德勝莊證義翻經沙門相州禪河寺大德玄傘證義筆受翻經沙門大薦福寺大德智積證義正字翻經沙門德州大雲寺主慧傘證義翻經沙門西涼州白塔寺大德慧積讀梵本翻經婆羅門右驍衛翊府中郎將員外置宿衛臣李釋迦讀梵本翻經婆羅門東天竺國左屯衛翊府中郎將員外置同正員臣翟金剛證義翻經婆羅門東天竺國大首領臣伊金羅證梵本翻經婆羅門左領軍衛中郎將迦濕彌羅國王子臣何順證義翻經婆羅門東天竺國左領軍右執戟直中書省臣頗具讀梵本翻經婆羅門龍播國大達官准五品臣李輸羅證譯金紫光祿大夫守尚書左僕射同中書門下三品上柱國史舒國公臣韋臣源監譯尚書右僕射同中書門下三品上柱國許國公臣蘇環監譯特進行太子少師同中書門下三品上柱國宋國公臣唐休璟監譯特進太子少保兼揚州大都督同中書門下三品監修國史上柱國彭國公臣韋溫監譯特進同中書門下三品修文館大學士監修國史上柱國趙國公臣李嶠筆受兼潤色特進侍中監修國史上柱國公臣韋安石監譯侍中監修國史上柱國越國公臣紀處訥監譯光祿大夫行中書令修文館大學士監國史上柱國郢國公臣宗楚客監譯中書令監修國史上柱國酇國公臣蕭至忠監譯翻經學士銀青光祿大夫守兵部尚書門下三品修文館大學士上柱國逍遙公臣韋嗣立翻經學士中散大夫守中書侍郎同中書門下三品著紫佩金魚修文館學士上柱國臣趙彥昭翻經學士太中大夫守祕書監員外置同正員修國史修文館學士上柱國臣劉憲翻經學士銀青光祿大夫行中書侍郎修文館學士兼修國史上柱國朝陽縣開國子臣岑義翻經學士通議大夫守吏部侍郎修文館學士兼修國史上柱國臣崔湜翻經學士朝議大夫守兵部侍郎兼修文館學士修國史上柱國臣張說翻經學士太中大夫檢校兵部侍郎騎尉修文館學士安平縣開國子臣崔日用翻經學士朝請大夫守中書舍人兼檢校吏部侍郎修文館學士經車都尉臣盧藏用翻經學士銀青光祿大夫行禮部侍郎修文館學士修國史上柱國慈源縣開國子臣徐堅貞翻經學士正議大夫行國子司業修文館學士上柱國臣郭山惲翻經學士禮部郎中修文館直學士輕車都尉河東縣開國男臣薜稷翻經學士正議大夫前蒲州刺史修文館學士上柱國高平縣開國子臣徐彥伯翻經學士中大夫行中書舍人修文館學士上柱國臣李乂翻經學士中書舍人修文館學士上柱國金鄉縣開國男韋元亘翻經學士中大夫行中書舍人修文館學士上柱國臣馬懷素翻經學士朝請大夫守給事中修文館學士上柱國臣李適翻經學士中書舍人修文館學士上柱國臣蘇頲翻經學士朝散大夫守著作郎修文館學士兼修國史臣鄭愔翻經學士朝散大夫行起居郎修文館直學士上護軍臣沈佺期翻經學士朝請大夫行考功員外郎修文館直學士上輕車都尉臣武平翻經學士著作佐郎修文館直學士臣閻朝隱翻經學士修文館直學士臣符鳳書手祕書省楷書令史臣趙希令寫孔目官文林郎少府監掌治署丞臣殷庭龜判官朝散大夫行著作佐郎臣劉令植使金紫光祿大夫行祕書監檢校殿中監兼知內外閑廐隴右三使上柱國嗣號臣王邕",
        "source": "T24n1452_001:0418b21_0",
        "is_bad_quality": true
    }
]