[
    {
        "source_sentence": "菩薩戒本(出《瑜伽論．本事分》中菩薩地)彌勒菩薩說沙門玄奘奉　詔譯若諸菩薩已受菩薩所受淨戒，應自數數專諦思惟，此是菩薩正所應作，此非菩薩正所應作。",
        "translation": "Bodhisattva Prātimokṣa (from the Bodhisattva Ground in the Expedient Portion of the Yoga Treatise) Translated by the Imperial Decree of the Bodhisattva Maitreya, the ascetic Xuanzang said that if bodhisattvas have received the pure precepts accepted by bodhisattvas, they should repeatedly and intently contemplate that these are the right things for bodhisattvas to do and these are not the right things for bodhisattvas to do.",
        "source": "T24n1501_001:1110b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既思惟已，然後為成正所作業，當勤修學。",
        "translation": "Once they have considered them, they should then diligently cultivate them in order to achieve the right actions.",
        "source": "T24n1501_001:1110b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又應專勵聽聞菩薩素呾纜藏，及以菩薩摩呾理迦，隨其所聞，當勤修學。",
        "translation": "They should also concentrate on hearing the bodhisattva sūtras and the bodhisattva mālikas, and they should diligently train according to what they hear.",
        "source": "T24n1501_001:1110b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩住戒律儀，有其四種他勝處法。",
        "translation": "If bodhisattvas abide in the precepts and regulations, there are four ways in which they are superior to others.",
        "source": "T24n1501_001:1110b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T24n1501_001:1110b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩為欲貪求利養恭敬，自讚毀他，是名第一他勝處法。",
        "translation": "If bodhisattvas desire to seek profit and respect, and praise themselves and disparage others, this is called the first superior position of others.",
        "source": "T24n1501_001:1110b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩現有資財，性慳財故，有苦有貧無依無怙正求財者，來現在前，不起哀憐而修惠捨。",
        "translation": "If bodhisattvas who have existing possessions and are stingy with money, who are suffering, poor, lacking support, and lacking a basis for rightly seeking possessions come to appear before them, they don't take pity on them and cultivate generosity.",
        "source": "T24n1501_001:1110b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正求法者來現在前，性慳法故，雖現有法而不捨施，是名第二他勝處法。",
        "translation": "When someone who is seeking the Dharma comes into existence and shows up, their nature is stingy with the Dharma, and they don't abandon charity even though they have the Dharma in existence, this is called the second superior position of the Dharma in others.",
        "source": "T24n1501_001:1110b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩長養如是種類忿纏，由是因緣，不唯發起麁言便息，由忿蔽故，加以手足塊石刀杖，捶打傷害損惱有情，內懷猛利忿恨意樂，有所違犯。",
        "translation": "If bodhisattvas nurture this kind of anger, then as a result, not only do they start speaking harshly and then stop, but because of the hindrance of anger, they put their hands and feet, lump stones and knives, beat and injure sentient beings, inflict harm on them, and harbor violent anger, resentment, and aspiration internally.",
        "source": "T24n1501_001:1110b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他來諫謝，不受不忍、不捨怨結，是名第三他勝處法。",
        "translation": "To be rebuked by others and not accept intolerance or abandon the bond of enmity is the third superior position.",
        "source": "T24n1501_001:1110b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩謗菩薩藏，愛樂宣說開示建立像似正法，於像似法，或自信解，或隨他轉，是名第四他勝處法。",
        "translation": "If bodhisattvas denigrate the bodhisattva canon, delight in expounding and revealing it to establish what appears to be the right teaching, and either confidently understand what appears to be the teaching or follow others into it, this is called the fourth superior position of others.",
        "source": "T24n1501_001:1110b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於四他勝處法，隨犯一種，況犯一切，不復堪能於現法中，增長攝受菩薩廣大菩提資糧，不復堪能於現法中，意樂清淨。",
        "translation": "If a bodhisattva violates one of the four other superior-position dharmas, let alone all of them, he can no longer grow the vast accumulation of bodhisattvas' awakening in the present life, and he can no longer purify his intentions and happiness in the present life.",
        "source": "T24n1501_001:1110b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是即名為相似菩薩，非真菩薩。",
        "translation": "This is called a resembling bodhisattva, not a true bodhisattva.",
        "source": "T24n1501_001:1110b28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若用軟中品纏，毀犯四種他勝處法，不捨菩薩淨戒律儀。",
        "translation": "If a bodhisattva uses a soft middle-grade affliction to violate the four other superior dharmas and doesn't abandon the bodhisattva's pure precepts and restraints, then he'll be called a bodhisattva of the higher grade of affliction.",
        "source": "T24n1501_001:1110b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上品纏犯，即名為捨。",
        "translation": "When the higher-grade afflictions are violated, that's called equanimity.",
        "source": "T24n1501_001:1110c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩毀犯四種他勝處法，數數現行，都無慚愧；深生愛樂，見是功德，當知說名上品纏犯。",
        "translation": "If bodhisattvas violate the four other superior dharmas, repeatedly manifest them without shame, deeply delight in them, and see their merit, you should know that they're called transgressors of the higher grade of bondage.",
        "source": "T24n1501_001:1110c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非諸菩薩暫一現行他勝處法，便捨菩薩淨戒律儀，如諸苾芻犯他勝法，即便棄捨別解脫戒。",
        "translation": "It's not that bodhisattvas abandon the restraints of the pure bodhisattva precepts once they momentarily manifest the other superior dharmas, just as monks violate the other superior dharmas and then abandon the liberation precepts.",
        "source": "T24n1501_001:1110c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩由此毀犯，棄捨菩薩淨戒律儀，於現法中堪任更受，非不堪任。",
        "translation": "If bodhisattvas thus violate and abandon the observance of the bodhisattva precepts, they're capable of accepting them again in the present life, not incapable of doing so.",
        "source": "T24n1501_001:1110c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如苾芻住別解脫戒，犯他勝法，於現法中不任更受。",
        "translation": "If a monk abides in the individual liberation precepts and violates other superior principles, he's not allowed to accept them again in the present life.",
        "source": "T24n1501_001:1110c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩安住菩薩淨戒律儀，於有違犯及無違犯，是染非染，軟中上品，應當了知。",
        "translation": "Thus, bodhisattvas who abide in the observance of the bodhisattva's pure precepts should know whether transgressions or non-transgressions are defiled or undefiled, and whether they are of the highest quality of softness or middleware.",
        "source": "T24n1501_001:1110c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於日日中，若於如來，或為如來造制多所；若於正法，或為正法造經卷所，謂諸菩薩素呾纜藏，摩呾理迦；若於僧伽，謂十方界已入大地諸菩薩眾，若不以其或少或多諸供養具而為供養，下至以身一拜禮敬，下至以語一四句頌讚佛法僧真實功德；下至以心一清淨信隨念三寶真實功德；空度日夜，是名有犯，有所違越。",
        "translation": "If bodhisattvas well-established in the observance of the bodhisattva precepts make numerous daily offerings to the Tathāgata or to the Tathāgata, or to the right teaching or to the right teaching's sūtra repository, which are the bodhisattvas' sūtras and mālikas, or to the saṃgha, which is the large assembly of bodhisattvas who have entered the great land in the ten directions, and if they don't make offerings with a small or large number of those offerings, from paying homage with a single obeisance to the body down to praising the true merits of the Buddha, Dharma, and Saṃgha with a single, pure verse in speech, or down to remembering the true merits of the Three Treasures with a single, pure faith in their minds, then they spend their days and nights in vain, which is called a violation and a transgression.",
        "source": "T24n1501_001:1110c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不恭敬嬾墮懈怠而違犯者，是染違犯。",
        "translation": "If someone doesn't respect, laziness, and negligence, this is a defiled offense.",
        "source": "T24n1501_001:1110c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若誤失念而違犯者，非染違犯。",
        "translation": "If someone mistakenly loses mindfulness and transgresses, it's not a defiled transgression.",
        "source": "T24n1501_001:1110c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：謂心狂亂；若已證入淨意樂地，常無違犯。",
        "translation": "A non-violation is when the mind is wild and disordered, and if someone has realized the stage of pure aspiration, they'll always have no violations.",
        "source": "T24n1501_001:1110c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由得清淨意樂菩薩，譬如已得證淨苾芻，恒時法爾於佛法僧，以勝供具承事供養。",
        "translation": "Because a bodhisattva has attained pure aspiration, he's like a monk who has realized the purity of the bhikṣu and is constantly making offerings to the Buddha, Dharma, and Saṃgha with excellent provisions.",
        "source": "T24n1501_001:1110c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，有其大欲而無喜足，於諸利養及以恭敬生著不捨，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas firmly abide in the restraints of the bodhisattva precepts and have great desires but aren't satisfied with them, and if they become attached to and don't abandon their benefits and respects, this is called a transgression, and it's a defiled transgression to transgress them.",
        "source": "T24n1501_001:1110c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：謂為斷彼生起樂欲，發勤精進，攝彼對治，雖勤遮遏，而為猛利性惑所蔽，數起現行。",
        "translation": "A non-violation is when someone arouses diligence and effort to end the pleasurable desires that arise, collects counteracting them and, despite diligently restraining them, is hindered by the intense mental disturbances that frequently arise.",
        "source": "T24n1501_001:1110c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，見諸耆長，有德可敬同法者來，憍慢所制，懷嫌恨心，懷恚惱心，不起承迎，不推勝座。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts see elderly people or people of virtue and respect who share the same principles coming, they are restrained by conceit, harbor hostility, and harbor anger, so they don't rise to meet or greet them or push them to their seats of honor.",
        "source": "T24n1501_001:1110c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有他來語言談論、慶慰、請問，憍慢所制，懷嫌恨心，懷恚惱心，不稱正理，發言酬對，是名有犯，有所違越，是染違犯。",
        "translation": "If another person comes to talk, console, or ask questions, and they're restrained by conceit, harbor resentment, and harbor hostility, they don't praise the right principles and speak in response, which is called a transgression and a defiled transgression.",
        "source": "T24n1501_001:1111a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非憍慢制，無嫌恨心，無恚惱心，但由嬾墮、懈怠、忘念、無記之心，是名有犯，有所違越，非染違犯。",
        "translation": "Being unrestrained by conceit, lacking hostility, and lacking anger and vexation, but motivated by laziness, forgetfulness, and indeterminate states of mind, this is called a transgression, a transgression that's not a defiled transgression.",
        "source": "T24n1501_001:1111a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：謂遭重病；或心狂亂；或自睡眠他生覺想而來親附，語言談論、慶慰、請問；或自為他宣說諸法論義決擇；或復與餘談論慶慰；或他說法論義決擇屬耳而聽；或有違犯說正法者，為欲將護說法者心；或欲方便調彼伏彼，出不善處，安立善處；或護僧制；或為將護多有情心而不酬對，皆無違犯。",
        "translation": "Those who don't transgress are those who are seriously ill, or whose minds are deranged, or who come to them with the perceptions of self and others arising from sleep, talk, console, and ask questions, or who explain the doctrinal decisions of the teachings for others, or who talk to others and console them, or who explain the doctrinal decisions of the teachings to their ears, or who violate the mind of someone who explains the right teaching in order to protect the speaker, or who wants to skillfully tame them and subdue them, get out of unwholesome places, and establish wholesome places, or protect the rules of the saṃgha, or who protect the minds of many sentient beings and don't respond to them.",
        "source": "T24n1501_001:1111a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，他來延請，或往居家，或往餘寺，奉施飲食及衣服等諸資生具，憍慢所制，懷嫌恨心，懷恚惱心，不至其所，不受所請，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the observance of the bodhisattva precepts are invited by others, either to their homes or to other temples, to offer food and drink, clothing, and other necessities, and are restrained by conceit, hostility, and anger, and don't go to them or accept their invitation, this is called a violation, and it's a defiled violation to transgress.",
        "source": "T24n1501_001:1111a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮、懈怠、忘念、無記之心，不至其所，不受所請，是名有犯，有所違越，非染違犯。",
        "translation": "If someone's laziness, negligence, forgetfulness, or indeterminate mind prevents them from going to their place and not accepting an invitation, this is an offense, a transgression, or a non-defiled offense.",
        "source": "T24n1501_001:1111a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：或有疾病；或無氣力；或心狂亂；或處懸遠；或道有怖；或欲方便調彼伏彼，出不善處，安立善處；或餘先請；或為無間修諸善法，欲護善品令無暫廢；或為引攝未曾有義；或為所聞法義無退；如為所聞法義無退，論義決擇當知亦爾；或復知彼懷損惱心，詐來延請；或為護他多嫌恨心；或護僧制；不至其所，不受所請，皆無違犯。",
        "translation": "There's no violation if someone is sick, lacks energy, has a frantic mind, is in a distant place, has fears on the road, wants to skillfully control others, subdue them, get out of an unskillful place, and establish a good place, or is invited by others first, wants to protect good qualities so they won't be lost, wants to bring in unprecedented meanings, wants the meanings of the teachings heard to be undiminished, wants the meanings of the teachings heard to be undiminished, and should be known to be the same for the discernment of meanings, or knows that they harbor harmful thoughts and fraudulently solicit offers, protect others with many hostile thoughts, or protect the rules of the saṃgha, and doesn't go to their place and accept an invitation, all of these are not violations.",
        "source": "T24n1501_001:1111a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，他持種種生色、可染、末尼、真珠、琉璃等寶，及持種種眾多上妙財利供具，慇懃奉施，由嫌恨心，或恚惱心，違拒不受，是名有犯，有所違越，是染違犯；捨有情故。",
        "translation": "If bodhisattvas maintain the restraints of the bodhisattva precepts, maintain various raw, tarnishable, maṇi, real pearls, lapis lazuli, and other treasures, and maintain numerous and excellent financial offerings, and give them with care, and then refuse to accept them out of hostility or anger, this is called a violation, and transgressing it is a defiled violation; it's because of the abandonment of sentient beings.",
        "source": "T24n1501_001:1111a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮、懈怠、忘念、無記之心，違拒不受，是名有犯，有所違越，非染違犯。",
        "translation": "If someone rejects an offering out of laziness, negligence, forgetfulness, or indeterminate mind, this is a violation, and there's a transgression that's not a defiled violation.",
        "source": "T24n1501_001:1111b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：或心狂亂；或觀受已心生染著；或觀後時彼定追悔；或復知彼於施迷亂；或知施主隨捨隨受；由是因緣定當貧匱；或知此物是僧伽物、窣堵波物；或知此物劫盜他得；或知此物由是因緣多生過患；或殺或縛、或罰或黜、或嫌或責，違拒不受，皆無違犯。",
        "translation": "There's no transgression when someone's mind is deranged, when they've observed an acceptance and become defiled, when they're sure to repent later, when they know they're confused about giving, when they know the donor will accept whatever he gives, when he's sure to be poor because of these causes, when they know it's a monk's property or a stūpa's property, when they know they've been robbed and obtained by others, when they know the causes and conditions of these things have caused many faults, or when they've killed, bound, punished, deposed, resented, or rebuked them and refuse to accept them.",
        "source": "T24n1501_001:1111b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，他來求法，懷嫌恨心，懷恚惱心，嫉妬變異，不施其法，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts come to seek the Dharma from others with hostility, anger, and jealousy and change, and don't bestow the Dharma, this is called a transgression, and it's a defiled transgression to transgress it.",
        "source": "T24n1501_001:1111b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮、懈怠、忘念、無記之心，不施其法，是名有犯，有所違越，非染違犯。",
        "translation": "If someone's laziness, negligence, forgetfulness, or indeterminate mind prevents them from bestowing the Dharma, this is called a transgression, which is not a defiled transgression.",
        "source": "T24n1501_001:1111b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：謂諸外道伺求過短；或有重病；或心狂亂；或欲方便調彼伏彼，出不善處安立善處；或於是法未善通利；或復見彼不生恭敬，無有羞愧，以惡威儀而來聽受；或復知彼是鈍根性，於廣法教，得法究竟，深生怖畏，當生邪見，增長邪執，衰損惱壞；或復知彼法至其手，轉布非人；而不施與，皆無違犯。",
        "translation": "What's not a transgression is when some non-Buddhist seeks to do wrong; when he's seriously ill; when he's mentally disturbed; when he wants to skillfully tame them and subdue them, get out of an unskillful place, and establish a good place; when he doesn't have a good understanding of the teaching; when he sees them and doesn't respect them, has no shame, and comes to listen with bad manners; when he knows that their faculties are dull, that they're deeply afraid of the broad teaching of the Dharma and the ultimate attainment of the Dharma, that they will give rise to wrong views, develop wrong attachments, and become debilitated and disturbed; or when he knows that the Dharma will reach him and he'll distribute it to non-people and doesn't give it to them.",
        "source": "T24n1501_001:1111b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於諸暴惡犯戒有情，懷嫌恨心，懷恚惱心，由彼暴惡犯戒為緣，方便棄捨，不作饒益，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts harbor resentment and hostility toward sentient beings who violently violate the precepts and, because of those violent violations of the precepts, skillfully discard them without benefiting them, this is called a transgression, and it's a defiled transgression to have transgressed.",
        "source": "T24n1501_001:1111b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮、懈怠、棄捨，由忘念故，不作饒益，是名有犯，有所違越，非染違犯。",
        "translation": "If someone lazily falls into, becomes lazy, abandons, and doesn't do anything to benefit because of forgetfulness, this is a violation, a transgression, and not a defiled violation.",
        "source": "T24n1501_001:1111b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1501_001:1111b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非諸菩薩於淨持戒身語意業，寂靜現行諸有情所，起憐愍心欲作饒益。",
        "translation": "\"It's not bodhisattvas who want to be compassionate and beneficial to sentient beings based on the pure observance of precepts, physical, verbal, and mental actions, and their quiescent performance.",
        "source": "T24n1501_001:1111b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如於暴惡犯戒有情，於諸苦因而現轉者。",
        "translation": "It's like the violent offense against the precepts that manifests in the manifestation of suffering in sentient beings.",
        "source": "T24n1501_001:1111b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：謂心狂亂；或欲方便調彼伏彼，廣說如前；或為將護多有情心；或護僧制；方便棄捨，不作饒益，皆無違犯。",
        "translation": "Those who don't transgress are those whose minds are deranged, who want to skillfully control others and subdue them, as explained in detail above, who want to protect the minds of many sentient beings, or who want to protect the saṃgha's rules and skillfully discard them without benefiting them, all are not transgressing.",
        "source": "T24n1501_001:1111c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，如薄伽梵於別解脫毘奈耶中，將護他故，建立遮罪，制諸聲聞令不造作，諸有情類，未淨信者令生淨信，已淨信者令倍增長。",
        "translation": "If bodhisattvas maintain the restraints of the bodhisattva's pure precepts, like the Bhagavān in Vairocana, they establish a guard against crimes in order to protect others, restrain śrāvakas from creating them, and cause those with purified faith to develop purified faith and those with purified faith to multiply and increase it.",
        "source": "T24n1501_001:1111c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中菩薩與諸聲聞應等修學，無有差別。",
        "translation": "In this way, bodhisattvas and śrāvakas should equally train, with no distinctions.",
        "source": "T24n1501_001:1111c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1501_001:1111c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸聲聞自利為勝，尚不棄捨將護他行，為令有情未信者信，信者增長，學所學處，何況菩薩利他為勝。",
        "translation": "Because it's better for śrāvakas to benefit themselves and not yet discard practices that will protect others, in order to cause those who don't yet believe to believe and those who do believe to grow and train in what they've trained, how much more so for bodhisattvas to benefit others.",
        "source": "T24n1501_001:1111c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，如薄伽梵於別解脫毘奈耶中，為令聲聞少事少業少希望住，建立遮罪，制諸聲聞令不造作；於中菩薩與諸聲聞，不應等學。",
        "translation": "If bodhisattvas maintain the bodhisattva's pure moral discipline, like the Bhagavān in Vairocana, in order to make śrāvakas abide with few deeds, few actions, and few hopes, and to establish a guard against crimes, and to restrain śrāvakas from creating them, bodhisattvas and śrāvakas shouldn't train equally.",
        "source": "T24n1501_001:1111c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1501_001:1111c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸聲聞自利為勝，不顧利他，於利他中少事少業少希望住，可名為妙；非諸菩薩利他為勝，不顧自利，於利他中少事少業少希望住得名為妙。",
        "translation": "It's because śrāvakas are superior in improving themselves, don't care about improving others, and abide in few tasks, little activity, and few hopes in improving others that they can be called marvelous; it's not bodhisattvas who are superior in improving others, don't care about improving themselves, and abide in few tasks, little activity, and few hopes in improving others that they can be called marvelous.",
        "source": "T24n1501_001:1111c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩為利他故，從非親里長者居士婆羅門等，及恣施家，應求百千種種衣服，觀彼有情有力無力，隨其所施如應而受，如說求衣，求鉢亦爾。",
        "translation": "Thus, for the sake of benefiting others, a bodhisattva should ask for a hundred thousand different kinds of clothing from an elder, householder, brāhmaṇa, or other person not close to him, and from a donor who wants to give freely, observing the strength or weakness of those sentient beings and accepting the donation as it comes, just as he asks for clothing and as he asks for bowls.",
        "source": "T24n1501_001:1111c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如求衣、鉢，如是自求種種絲縷，令非親里為織作衣。",
        "translation": "Thus, when seeking clothing and bowls, you should seek various threads yourself, so that someone not related to you can weave clothing for you.",
        "source": "T24n1501_001:1111c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為利他故，應蓄種種憍奢耶衣，諸坐臥具，事各至百，生色可染百千拘胝，復過是數，亦應取積。",
        "translation": "For the benefit of others, they should store various kinds of kauśeya robes, sitting and lying cloth, and things up to a hundred in number that produce a color that can stain a hundred thousand koṭīs, and many more than that, and they should also gather them.",
        "source": "T24n1501_001:1111c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等中少事少業少希望住制止遮罪，菩薩不與聲聞共學。",
        "translation": "Among such things, a bodhisattva who does few deeds, few actions, and few hopes abides to suppress and prevent crimes doesn't train with direct disciples.",
        "source": "T24n1501_001:1111c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安住淨戒律儀菩薩，於利他中，懷嫌恨心，懷恚惱心，少事少業少希望住，是名有犯，有所違越，是染違犯。",
        "translation": "A bodhisattva firmly abiding in the restraints of pure morality who harbors resentment, harbors anger, and abides with few deeds, few actions, and few hopes while benefiting others is said to have transgressed and to have transgressed, which is a defiled transgression.",
        "source": "T24n1501_001:1111c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮、懈怠、忘念、無記之心，少事少業少希望住，是名有犯，有所違越，非染違犯。",
        "translation": "If someone abides with little work, little effort, and little hope because of laziness, negligence, forgetfulness, or an indeterminate mind, this is called a violation that's transgressed and not a defiled violation.",
        "source": "T24n1501_001:1111c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，善權方便，為利他故，於諸性罪少分現行，由是因緣，於菩薩戒無所違犯，生多功德。",
        "translation": "If bodhisattvas abide in the restraints of the bodhisattva precepts, skillfully and expediently apply them for the benefit of others, and are active in a small way with respect to the sins of their nature, this is the cause and condition for not transgressing the bodhisattva precepts and producing much merit.",
        "source": "T24n1501_001:1112a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂如菩薩，見惡劫賊為貪財故，欲殺多生，或復欲害大德聲聞、獨覺、菩薩，或復欲造多無間業。",
        "translation": "That is, suppose a bodhisattva sees a robber of a bad eon who wants to kill many living beings because he desires wealth, or who wants to harm a great virtuous śrāvaka, pratyekabuddha, or bodhisattva, or who wants to create many unremitting actions.",
        "source": "T24n1501_001:1112a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見是事已，發心思惟：「我若斷彼惡眾生命，墮那落迦，如其不斷，無間業成當受大苦，我寧殺彼墮那落迦，終不令其受無間苦。」",
        "translation": "After seeing this, he arouses his mind and thinks, \"If I were to cut off the lives of those evil beings and cause them to fall into hell, I'd rather kill them and cause them to fall into hell than cause them to experience unremitting suffering if they don't stop.\"",
        "source": "T24n1501_001:1112a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩意樂思惟，於彼眾生，或以善心，或無記心，知此事已，為當來故，深生慚愧，以憐愍心而斷彼命。",
        "translation": "Thus, the bodhisattva's intention is to contemplate that, whether with a good or an indeterminate mind, after knowing this, he will deeply conscientious for the sake of the future and cut off their lives with kindness.",
        "source": "T24n1501_001:1112a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，於菩薩戒無所違犯，生多功德。",
        "translation": "Because of this cause, there's no violation of the bodhisattva precepts, and it produces lots of merit.",
        "source": "T24n1501_001:1112a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如菩薩，見有增上增上宰官，上品暴惡，於諸有情無有慈愍，專行逼惱。",
        "translation": "It's also like a bodhisattva who sees a superior, superintendent official of a superior class who's violent, has no compassion for sentient beings, and exclusively acts to harass them.",
        "source": "T24n1501_001:1112a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見已，起憐愍心，發生利益安樂意樂，隨力所能，若廢若黜增上等位。",
        "translation": "After seeing that, the bodhisattva becomes compassionate, develops the intention to benefit, pacify, and remove the superior rank according to his ability.",
        "source": "T24n1501_001:1112a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣，於菩薩戒無所違犯，生多功德。",
        "translation": "Because of these causes and conditions, there's no violation of the bodhisattva precepts, and it produces lots of merit.",
        "source": "T24n1501_001:1112a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如菩薩，見劫盜賊，奪他財物，若僧伽物，窣堵波物，取多物已，執為己有，縱情受用。",
        "translation": "It's also like a bodhisattva who sees a thief who steals another's property, such as a monk's property or a stūpa's property, and then takes many of those things, claims them for himself, and enjoys them even though he wants to.",
        "source": "T24n1501_001:1112a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見已，起憐愍心，於彼有情發生利益安樂意樂，隨力所能，逼而奪取，勿令受用如是財故，當受長夜無義無利，由此因緣，所奪財寶，若僧伽物還復僧伽，窣堵波物還窣堵波，若有情物還復有情。",
        "translation": "After seeing that, the bodhisattva arouses compassion, creates feelings of benefit and well-being for those sentient beings, and forces them to take as much as they can, so that they won't be forced to use such property, which will be meaningless and useless for a long time.",
        "source": "T24n1501_001:1112a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見眾生，或園林主，取僧伽物，窣堵波物，言是己有，縱情受用。",
        "translation": "He also sees a sentient being or a grove owner who takes the property of the saṃgha or the property of the stūpa and says he owns it, even though it's for the enjoyment of sentient beings.",
        "source": "T24n1501_001:1112a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見已，思擇彼惡，起憐愍心，勿令因此邪受用業，當受長夜無義無利，隨力所能，廢其所主。",
        "translation": "After seeing that, the bodhisattva considers that evil, arouses compassion, and doesn't allow that to be the cause of wrong enjoyment, which will lead to a long night of meaninglessness and profitlessness, and abrogates the owner of that thing according to his ability.",
        "source": "T24n1501_001:1112a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是雖不與取，而無違犯，生多功德。",
        "translation": "Although a bodhisattva thus doesn't take what's given, it's not a violation and produces much merit.",
        "source": "T24n1501_001:1112a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如菩薩，處在居家，見有女色，現無繫屬，習婬欲法，繼心菩薩，求非梵行。",
        "translation": "It's also like a bodhisattva who's at home and sees a woman in a form that's presently unattached and accustomed to lustful desires, and then he's a bodhisattva with a secondary intention to pursue what's not the religious life.",
        "source": "T24n1501_001:1112b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見已，作意思惟，勿令心恚，多生非福，若隨其欲，便得自在，方便安處，令種善根，亦當令其捨不善業。",
        "translation": "After seeing that, the bodhisattva makes this thought, \"Don't make your mind angry, which often produces what's not good; if you follow your desires, you'll attain freedom, and you'll make it a comfortable place to plant good roots; you'll also cause them to abandon unskillful actions.",
        "source": "T24n1501_001:1112b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住慈愍心，行非梵行。",
        "translation": "They'll abide in kindness and practice what's not the religious life.",
        "source": "T24n1501_001:1112b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖習如是穢染之法，而無所犯，多生功德。",
        "translation": "Although they practice such defiled things, they do nothing wrong and often produce merit.",
        "source": "T24n1501_001:1112b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家菩薩，為護聲聞聖所教誡，令不壞滅，一切不應行非梵行。",
        "translation": "For the sake of protecting the śrāvaka's noble instructions from decay, a renunciant bodhisattva shouldn't engage in anything other than the religious practice.",
        "source": "T24n1501_001:1112b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如菩薩，為多有情解脫命難、囹圄縛難、刖手足難、劓鼻刵耳剜眼等難，雖諸菩薩為自命難，亦不正知說於妄語，然為救脫彼有情故，知而思擇，故說妄語。",
        "translation": "It's also like a bodhisattva who liberates many sentient beings from the difficulty of dying, the difficulty of being bound in prison, the difficulty of amputating hands and feet, and the difficulty of cutting off the nose and ears and plucking out eyes, even though bodhisattvas incorrectly say false things for the sake of the difficulty of their own lives, but they know and deliberate on them in order to save those sentient beings, so they say false things.",
        "source": "T24n1501_001:1112b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以要言之，菩薩唯觀有情義利，非無義利，自無染心，唯為饒益諸有情故，覆想正知而說異語，說是語時，於菩薩戒無所違犯，生多功德。",
        "translation": "To summarize, a bodhisattva only observes the benefit of sentient beings, not the lack of benefit, and has no defiled mind but speaks false words with imputed concepts and correct knowledge for the benefit of sentient beings.",
        "source": "T24n1501_001:1112b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如菩薩，見諸有情，為惡友朋之所攝受，親愛不捨。",
        "translation": "It's also like a bodhisattva who sees that sentient beings are taken in by bad friends and associates, and they love them intimately and don't abandon them.",
        "source": "T24n1501_001:1112b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見已，起憐愍心，發生利益安樂意樂，隨能隨力說離間語，令離惡友，捨相親愛，勿令有情，由近惡友，當受長夜無義無利。",
        "translation": "After seeing that, the bodhisattva arouses compassion, produces the intention to benefit and comfort them, speaks freely according to his ability and strength, causes them to part with bad friends, and abandons their affection for each other, so that sentient beings who approach bad friends will experience long nights of meaninglessness and lack of benefit.",
        "source": "T24n1501_001:1112b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是以饒益心，說離間語，乖離他愛，無所違犯，生多功德。",
        "translation": "Thus, with a beneficent mind, a bodhisattva speaks free from interruptions, disregards the love of others, commits no infractions, and produces much merit.",
        "source": "T24n1501_001:1112b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如菩薩，見諸有情，為行越路非理而行，出麁惡語，猛利訶擯，方便令其出不善處安立善處。",
        "translation": "Also, suppose a bodhisattva sees sentient beings who act contrary to the path and don't act correctly, speak harshly and unkindly, and violently reprimand them, making it easy for them to leave an unskillful place and establish a good one.",
        "source": "T24n1501_001:1112b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是以饒益心，於諸有情，出麁惡語，無所違犯，生多功德。",
        "translation": "Thus, with a beneficent mind, the bodhisattva speaks harshly and badly to sentient beings, does nothing to offend them, and produces much merit.",
        "source": "T24n1501_001:1112b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如菩薩，見諸有情，信樂倡伎吟詠歌諷，或有信樂王賊飲食、淫蕩街衢無義之論。",
        "translation": "It's also like a bodhisattva who sees sentient beings who believe in and enjoy music, singing, and chanting, or who believe in and enjoy the food and drink of kings and thieves or the meaningless talk of debauchery in the streets.",
        "source": "T24n1501_001:1112b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於中皆悉善巧，於彼有情起憐愍心，發生利益安樂意樂，現前為作綺語相應種種倡伎吟詠歌諷、王賊飲食淫衢等論，令彼有情歡喜引攝，自在隨屬，方便獎導，出不善處安立善處。",
        "translation": "The bodhisattva is skillful in doing so, arouses a compassionate mind for those sentient beings, produces the intention to benefit and comfort them, and creates a variety of theories in response to their beautiful speech, such as singing, chanting, singing, and ridicule, the king's food and drink for thieves, and debauchery in the streets, so that those sentient beings are joyfully led, freely follow them, and are skillfully rewarded and guided out of unwholesome places and into wholesome ones.",
        "source": "T24n1501_001:1112b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是現行綺語，無所違犯，生多功德。",
        "translation": "Such an active manifestation of the bodhisattva's idle chatter will not offend anyone and will produce much merit.",
        "source": "T24n1501_001:1112c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，生起詭詐虛談現相，方便研求假利求利，味邪命法無有羞恥，堅持不捨，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the restraints of the bodhisattva precepts give rise to deceitful false talk about appearances, skillfully pursue false gain and profit, taste wrong livelihoods without shame, and persist in not abandoning them, this is called a violation, and transgressing it is a defiled violation.",
        "source": "T24n1501_001:1112c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若為除遣生起樂欲，發勤精進，煩惱熾盛，蔽抑其心，時時現起。",
        "translation": "Those who don't transgress: If they exert themselves to rid themselves of the pleasures and desires that arise, their minds are overwhelmed by affliction, and it appears from time to time.",
        "source": "T24n1501_001:1112c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，為掉所動，心不寂靜，不樂寂靜，高聲嬉戲，諠譁紛聒，輕躁騰躍，望他歡笑，如此諸緣，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts are distracted by agitation, their minds aren't still, they don't enjoy stillness, and they engage in loud play, clamor, agitation, and laughter at others for such reasons, this is called a violation, a transgression, or a defiled violation.",
        "source": "T24n1501_001:1112c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若忘念起，非染違犯。",
        "translation": "If forgetfulness arises, it's not a defiled offense.",
        "source": "T24n1501_001:1112c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若為除遣生起欲樂，廣說如前；若欲方便解他所生嫌恨令息；若欲遣他所生愁惱；若他性好如上諸事，方便攝受，敬順將護，隨彼而轉；若他有情猜阻菩薩，內懷嫌恨惡謀憎背，外現歡顏，表內清淨；如是一切，皆無違犯。",
        "translation": "Those who have no transgressions: if they want to remove desires and pleasures that arise, as explained in detail above; if they want to skillfully resolve the resentments that arise in others and cause them to calm down; if they want to remove the sorrow and vexation that arises in others; if they have a disposition for such things, skillfully take them in, honor, submit to, and protect them, and follow their lead; if other sentient beings conjecture and hinder the bodhisattva, harboring internal resentments and ill-will and hatred, and displaying a happy countenance outwardly that shows internal purity; all of these things are no transgressions.",
        "source": "T24n1501_001:1112c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，起如是見，立如是論：菩薩不應忻樂涅槃，應於涅槃而生厭背；於諸煩惱及隨煩惱，不應怖畏而求斷滅，不應一向心生厭離；以諸菩薩三無數劫，流轉生死求大菩提。",
        "translation": "If bodhisattvas firmly abide in the discipline of the bodhisattva precepts and come to this view, they will formulate this theory: \"A bodhisattva shouldn't be delighted with nirvāṇa; he should become disillusioned with nirvāṇa; he shouldn't fearfully seek to end the afflictions and the afflictions that follow, and he shouldn't become disillusioned with one single thought; because bodhisattvas have been transmigrating through birth and death for three incalculable eons in search of great enlightenment.",
        "source": "T24n1501_001:1112c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作此說，是名有犯，有所違越，是染違犯。",
        "translation": "If someone says this, it's called a violation, and to transgress it is a defiled violation.",
        "source": "T24n1501_001:1112c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1501_001:1112c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸聲聞，於其涅槃忻樂親近，於諸煩惱及隨煩惱深心厭離；如是菩薩於大涅槃忻樂親近，於諸煩惱及隨煩惱深心厭離，其倍過彼百千俱胝。",
        "translation": "\"If it's the case of śrāvakas who are delighted and intimate with nirvāṇa and are deeply disillusioned with the afflictions and the afflictions that follow it, then it's twice as great as the bodhisattvas who are delighted and intimate with great nirvāṇa and are deeply disillusioned with the afflictions and the afflictions that follow it, which are a hundred thousand koṭīs greater than that.",
        "source": "T24n1501_001:1112c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸聲聞唯為一身，證得義利勤修正行；菩薩普為一切有情，證得義利勤修正行。",
        "translation": "It's because śrāvakas alone realize the benefits and diligently cultivate their practice, whereas bodhisattvas realize the benefits and diligently cultivate their practice for all sentient beings.",
        "source": "T24n1501_001:1112c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩當勤修集無雜染心，於有漏事隨順而行，成就勝出諸阿羅漢無雜染法。",
        "translation": "Therefore, bodhisattvas should diligently cultivate a mind free of defilement and perform contaminated things accordingly, achieving a state of undefiledness that's superior to those of arhats.",
        "source": "T24n1501_001:1112c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於自能發不信重言，所謂惡聲惡稱惡譽，不護不雪。",
        "translation": "If bodhisattvas maintain the discipline of the bodhisattva precepts, they won't guard or snow themselves from harsh words of disbelief, such as harsh sounds and harsh words and harsh reputation.",
        "source": "T24n1501_001:1112c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其事若實而不避護，是名有犯，有所違越，是染違犯。",
        "translation": "If something is true and they don't guard it, this is called a transgression, and it's a defiled transgression to transgress it.",
        "source": "T24n1501_001:1113a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若事不實而不清雪，是名有犯，有所違越，非染違犯。",
        "translation": "If something isn't real and isn't cleansed, this is called a violation, and there's a transgression that isn't a defiled violation.",
        "source": "T24n1501_001:1113a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若他外道；若他憎嫉；若自出家因行乞行，因修善行，謗聲流布；若忿蔽者；若心倒者；謗聲流布，皆無違犯。",
        "translation": "There's no violation if someone is a non-Buddhist, if they hate and resent others, if they leave home because they're engaged in begging practices or because they're cultivating good practices and denigrate the dissemination of sounds, if they're hindered by anger, or if their mind is distorted and they denigrate the dissemination of sounds, all of these things are not violations.",
        "source": "T24n1501_001:1113a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，見諸有情，應以種種辛楚加行，猛利加行，而得義利，護其憂惱而不現行；是名有犯，有所違越，非染違犯。",
        "translation": "If bodhisattvas firmly abide in the discipline of the bodhisattva precepts and see sentient beings who will attain benefit by applying various painful and vigorous practices, protecting them from sorrow and distress, and not acting upon them, this is called a violation that's transgressed and not a defiled violation.",
        "source": "T24n1501_001:1113a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：觀由此緣，於現法中少得義利，多生憂惱。",
        "translation": "Those who don't transgress: observing this condition, they rarely obtain meaningful benefits in the present life, and they often become sad and distressed.",
        "source": "T24n1501_001:1113a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，他罵報罵；他瞋報瞋；他打報打；他弄報弄；是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-maintained the restraints of the bodhisattva precepts and they reprimand others for cursing, reprimand others for anger, reprimand others for beating, and reprimand others for messing with them, this is called a violation, a transgression, or a defiled violation.",
        "source": "T24n1501_001:1113a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於他有情有所侵犯；或自不為，彼疑侵犯；由嫌嫉心，由慢所執，不如理謝而生輕捨；是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the observance of the bodhisattva's pure precepts do something to offend other sentient beings, or if they don't do it themselves and are suspicious of their offense, or if they become despondent out of animosity, attachment based on conceit, and improper appreciation, this is called a violation, a transgression, and a tainted violation.",
        "source": "T24n1501_001:1113a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由懶墮、懈怠、放逸、不謝輕捨，是名有犯，有所違越，非染違犯。",
        "translation": "If someone's indolence, laziness, carelessness, or lack of appreciation and reckless abandonment is a violation, there's a transgression, and it's not a defiled violation.",
        "source": "T24n1501_001:1113a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若欲方便調彼伏彼，出不善處安立善處；若是外道；若彼希望，要因現行非法有罪，方受悔謝；若彼有情性好鬪諍，因悔謝時倍增憤怒；若復知彼為性堪忍，體無嫌恨；若必了他因謝侵犯，深生羞恥，而不悔謝；皆無違犯。",
        "translation": "Those who don't transgress: If they want to skillfully control them and subdue them, get out of an unskillful place and establish a good place, or if they're a non-Buddhist and wish to be thanked only because they're currently unlawful and guilty, or if they're a sentient being with a quarrelsome nature and become more angry when they repent, or if they know that their nature is tolerant and that they harbor no resentment, or if they surely understand that they've been violated by others, are deeply ashamed, and don't repent, they haven't transgressed.",
        "source": "T24n1501_001:1113a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，他所侵犯，彼還如法平等悔謝，懷嫌恨心，欲損惱彼，不受其謝，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the restraints of the bodhisattva precepts and are violated by others still repent equally according to the teaching, and they harbor resentment and want to harm and annoy them but don't accept their thanks, this is called a transgression, and it's a defiled transgression to have transgressed.",
        "source": "T24n1501_001:1113a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復於彼無嫌恨心，不欲損惱，然由稟性不能堪忍，故不受謝，亦名有犯，有所違越，是染違犯。",
        "translation": "Even though he has no resentment toward them and doesn't want to hurt them, he's unable to tolerate it in his nature and therefore doesn't accept his thanks, which is also called a transgression and a violation that's tainted with transgression.",
        "source": "T24n1501_001:1113a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若欲方便調彼伏彼，廣說一切，如前應知。",
        "translation": "Those who don't transgress: If they want to skillfully tame them and subdue them, they'll explain everything in detail, as you should know from the previous section.",
        "source": "T24n1501_001:1113a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不如法不平等謝，不受彼謝，亦無違犯。",
        "translation": "If someone doesn't reciprocate unequally according to the teaching, then they won't receive their thanks, which is also not a violation.",
        "source": "T24n1501_001:1113b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於他懷忿，相續堅持，生已不捨，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the restraints of the bodhisattva precepts persist in their anger toward others and don't abandon it after it arises, this is called a transgression, and transgressing it is a defiled transgression.",
        "source": "T24n1501_001:1113b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：為斷彼故，生起樂欲，廣說如前。",
        "translation": "A non-violation is when a pleasant desire arises for the purpose of ending it, as explained in detail above.",
        "source": "T24n1501_001:1113b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，貪著供事增上力故，以愛染心管御徒眾，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas firmly abide in the restraints of the bodhisattva precepts and become attached to the superior power of making offerings, then they control their followers with a mind that's tainted with desire, which is a violation and a transgression that's a defiled violation.",
        "source": "T24n1501_001:1113b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：不貪供侍，無愛染心管御徒眾。",
        "translation": "A non-violation is when a person doesn't crave making offerings and doesn't have a mind tainted with desire for disciplining the disciples.",
        "source": "T24n1501_001:1113b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，嬾墮懈怠，耽睡眠樂臥樂倚樂，非時非量，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas firmly abide in the restraints of the bodhisattva precepts and become lazy, indulging in the pleasures of sleep and lying down and leaning on them, neither timely nor measured, this is called a transgression, and there's a transgression that's a defiled transgression.",
        "source": "T24n1501_001:1113b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若遭疾病；若無氣力，行路疲弊；若為斷彼生起樂欲，廣說一切，如前應知。",
        "translation": "Those who don't transgress are those who suffer from illness, lack energy, and experience weariness in their travels, and those whose desire for happiness arises in order to stop them, as explained in detail above.",
        "source": "T24n1501_001:1113b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，懷愛染心，談說世事，虛棄時日，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the restraints of the bodhisattva precepts and have a mind impassioned by love and defilement talk about worldly affairs and waste time and days, this is called a transgression, and to transgress it is a defiled transgression.",
        "source": "T24n1501_001:1113b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由忘念虛棄時日，是名有犯，有所違越，非染違犯。",
        "translation": "If a person wastes time and days because of forgetfulness, this is called a violation, and there's a transgression that's not a defiled violation.",
        "source": "T24n1501_001:1113b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：見他談說，護彼意故，安住正念須臾而聽；若事希奇，或暫問他，或答他問，無所違犯。",
        "translation": "There's no violation: When they see someone talking, they protect their intentions, maintain right mindfulness, and listen for a moment; if something is strange, they might ask someone about it for a moment or answer their question, but there's no violation.",
        "source": "T24n1501_001:1113b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，為令心住，欲定其心，心懷嫌恨，憍慢所持，不詣師所求請教授，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the restraints of the bodhisattva precepts and want to concentrate their minds in order to make them stay, harbor resentment in their minds, and are held in arrogance, and don't go to a teacher to ask for a teaching, this is called a violation, and it's a defiled violation to transgress it.",
        "source": "T24n1501_001:1113b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嬾墮懈怠而不請者，非染違犯。",
        "translation": "A person who lazily and negligently refrains from requesting an invitation is not guilty of a defiled infraction.",
        "source": "T24n1501_001:1113b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若遇疾病；若無氣力；若知其師顛倒教授；若自多聞，自有智力，能令心定；若先已得所應教授；而不請者，無所違犯。",
        "translation": "There's no violation if someone meets an illness, lacks energy, knows that their teacher is mistakenly teaching, is well-versed, has their own power, and can calm the mind, or has previously received the teaching they should receive and doesn't request it.",
        "source": "T24n1501_001:1113b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，起貪欲蓋，忍受不捨，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas firmly abide in the restraints of the bodhisattva precepts and become hindered by desire, tolerating it and not abandoning it, this is called a transgression, and to transgress it is a defiled transgression.",
        "source": "T24n1501_001:1113b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若為斷彼生起樂欲，發勤精進，煩惱猛利，蔽抑心故，時時現行。",
        "translation": "There's no violation: If someone arouses diligence and exertion to end the desire that arises, the afflictions are intense and suppress the mind, and it's active from time to time.",
        "source": "T24n1501_001:1113c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如貪欲蓋，如是瞋恚、惛沈、睡眠、掉舉、惡作及與疑蓋，當知亦爾。",
        "translation": "As the hindrance of desire, so it should be known to be the hindrances of anger, delusion, drowsiness, agitation, mistaken action, and doubt.",
        "source": "T24n1501_001:1113c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，貪味靜慮，於味靜慮見為功德，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts crave the meditation of taste and see merit in the meditation of taste, this is called a transgression, and to transgress it is a defiled transgression.",
        "source": "T24n1501_001:1113c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若為斷彼生起樂欲，廣說如前。",
        "translation": "Those who don't transgress: If the intention is to stop them from generating pleasant desires, it's explained in detail as before.",
        "source": "T24n1501_001:1113c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，起如是見，立如是論：菩薩不應聽聲聞乘相應法教；不應受持；不應修學；菩薩何用於聲聞乘相應法教，聽聞受持，精勤修學？",
        "translation": "If bodhisattvas who are stable in the observance of the bodhisattva's pure precepts and regulations come to this view and formulate this theory: 'A bodhisattva shouldn't listen to the teachings associated with the śrāvaka vehicle, shouldn't retain them, and shouldn't train them, but why would a bodhisattva need to listen to, retain, and diligently train in the teachings associated with the śrāvaka vehicle?'",
        "source": "T24n1501_001:1113c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名有犯，有所違越，是染違犯。",
        "translation": "This is called a transgression, and there's a transgression that's a defiled transgression.",
        "source": "T24n1501_001:1113c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1501_001:1113c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩尚於外道書論精勤研究，況於佛語。",
        "translation": "A bodhisattva still diligently studies the writings and theories of non-Buddhists, so why wouldn't he study the words of the Buddha?",
        "source": "T24n1501_001:1113c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：為令一向習小法者，捨彼欲故，作如是說。",
        "translation": "Those who don't transgress: This is said in order to cause those who have always practiced lesser teachings to abandon their desires.",
        "source": "T24n1501_001:1113c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於菩薩藏未精研究，於菩薩藏一切棄捨，於聲聞藏一向修學，是名有犯，有所違越，非染違犯。",
        "translation": "If bodhisattvas firmly abide in the restraints of the bodhisattva precepts but haven't studied them intently in the bodhisattva canon, abandoning them all in the bodhisattva canon and consistently cultivating them in the śrāvaka canon, this is called a violation, a transgression, or not a defiled violation.",
        "source": "T24n1501_001:1113c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，現有佛教，於佛教中未精研究，於異道論及諸外論精勤修學，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the observance of the bodhisattva precepts and existing Buddhism have not yet studied them intently and are diligently cultivating the treatises of non-Buddhists and non-Buddhist treatises, this is a violation, a transgression, or a defiled violation.",
        "source": "T24n1501_001:1113c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若上聰敏；若能速受；若經久時能不忘失；若於其義能思能達；若於佛教如理觀察，成就俱行無動覺者，於日日中，常以二分修學佛語，一分學外，則無違犯。",
        "translation": "Those who don't transgress are those who are intelligent, quick to accept, long-suffering, not forgetful, able to contemplate and comprehend their meaning, and who correctly observe Buddhism and achieve the awakening to the concurrent practice of immovability, and who always cultivate the Buddha's words in two parts day by day and study them in one part externally.",
        "source": "T24n1501_001:1113c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，越菩薩法，於異道論及諸外論研求善巧，深心寶翫，愛樂耽味，非如辛藥而習近之，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas firmly abide in the discipline of the bodhisattva precepts and transgress the bodhisattva's principles, and if they pursue the skillful study of non-Buddhist theories and non-Buddhist theories, deeply cherish them, enjoy their taste, and cultivate their approach other than as spicy medicine, this is called a violation, and transgressing them is a defiled violation.",
        "source": "T24n1501_001:1113c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，聞菩薩藏，於甚深處最勝甚深真實法義，諸佛菩薩難思神力，不生信解，憎背毀謗；不能引義，不能引法，非如來說，不能利益安樂有情，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas firmly abide in the discipline of the bodhisattva precepts and hear about the bodhisattva canon, the most excellent and profound true teaching in a profound place, and the inconceivable powers of the buddhas and bodhisattvas don't give rise to confidence, hate and disparage it, and aren't able to refer to the meaning or the teaching, aren't taught by the Tathāgata, and aren't able to benefit and comfort sentient beings, this is called a violation, a transgression, and a defiled violation.",
        "source": "T24n1501_001:1114a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是毀謗，或由自內非理作意；或隨順他而作是說。",
        "translation": "Such a denigration is either the result of an improper intention within oneself or the result of following someone else's lead and saying so.",
        "source": "T24n1501_001:1114a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，若聞甚深最甚深處，心不信解。",
        "translation": "If bodhisattvas firmly abide in the discipline of the bodhisattva precepts, and if they hear about the most profound and most profound places, their minds don't believe and understand them.",
        "source": "T24n1501_001:1114a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時應強信受，應無諂曲，應如是學，我為非善，盲無慧目，於如來眼隨所宣說，於諸如來密意語言而生誹謗。",
        "translation": "At that point, the bodhisattva should strongly believe and accept them, refrain from flattery, and train in such a way that I'm not good, blind and without the eye of wisdom, and I casually explain them to the Tathāgata's eyes and denigrate the Tathāgata's words with their hidden intent.",
        "source": "T24n1501_001:1114a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是自處無知，仰推如來，於諸佛法無不現知，等隨觀見，如是正行，無所違犯。",
        "translation": "Thus, bodhisattvas who are in their own ignorance and look up to the Tathāgata, know nothing about the Buddha's teachings, observe them equally, and conduct themselves correctly in such a way that they don't violate them.",
        "source": "T24n1501_001:1114a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖無信解，然不誹謗。",
        "translation": "Even though they lack faith and understanding, they don't denigrate them.",
        "source": "T24n1501_001:1114a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於他人所，有染愛心，有瞋恚心，自讚毀他，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts have a mind that's defiled by craving and an attitude of anger, and they praise themselves and disparage others, this is called a violation, and to transgress it is a defiled violation.",
        "source": "T24n1501_001:1114a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若為摧伏諸惡外道；若為住持如來聖教；若為方便調彼伏彼，廣說如前；或欲令其未淨信者發生淨信，已淨信者倍復增長。",
        "translation": "Those who don't transgress are those who do so for the purpose of subduing evil non-Buddhists, for the purpose of maintaining the Tathāgata's noble teaching, for the purpose of skillfully controlling one and subduing the other, as explained in detail above, or for the purpose of causing those who are not yet purely faithful to develop pure faith and those who are already purely faithful to grow even more so.",
        "source": "T24n1501_001:1114a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，聞說正法論義決擇，憍慢所制，懷嫌恨心，懷恚惱心，而不往聽；是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the pure bodhisattva precepts hear the right teaching, discourse, and doctrine, and they're restrained by pride, harbor resentment, and harbor anger and don't listen, this is called a violation, a transgression, and a defiled violation.",
        "source": "T24n1501_001:1114a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為懶墮懈怠所蔽，而不往聽，非染違犯。",
        "translation": "If someone is hindered by laziness and indolence and doesn't listen, it's not a defiled offense.",
        "source": "T24n1501_001:1114a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若不覺知；若有疾病；若無氣力；若知倒說；若為護彼說法者心；若正了知彼所說義，是數所聞所持所了；若已多聞，具足聞持，其聞積集；若欲無間於境住心；若勤引發菩薩勝定；若自了知上品愚鈍，其慧鈍濁，於所聞法難受難持，難於所緣攝心令定；不往聽者，皆無違犯。",
        "translation": "There's no violation if someone doesn't perceive, if they have an illness, if they lack energy, if they know what's being said incorrectly, if they're defending the mind of someone who's teaching the Dharma, if they correctly understand the meaning of what's being taught, the amount of what's heard and maintained and comprehended, if they've heard a lot, have fully heard and maintained it, and have accumulated what they've heard, if they want to abide in their mind without interruption in regard to objects, if they diligently arouse the bodhisattva's superior concentration, or if they know for themselves that the higher qualities are dull and their wisdom is dull, that it's difficult to accept and maintain the teaching they've heard, and that it's difficult to collect the mind and make it concentrate in regard to the object, and they don't go and listen, they're not in violation.",
        "source": "T24n1501_001:1114a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於說法師，故思輕毀，不深恭敬，嗤笑調弄，但依於文，不依於義，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts deliberately disparage their Dharma preacher, don't deeply respect him, ridicule him, and make fun of him, relying only on the text and not on the meaning, this is called a violation, and to transgress it is a defiled violation.",
        "source": "T24n1501_001:1114b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於諸有情所應作事，懷嫌恨心，懷恚惱心，不為助伴。",
        "translation": "If bodhisattvas maintain the restraints of the bodhisattva precepts and harbor resentment and hostility toward the works that sentient beings ought to do, they won't be an accomplice.",
        "source": "T24n1501_001:1114b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於能辦所應作事，或於道路若往若來；或於正說事業加行；或於掌護所有財寶；或於和好乖離諍訟；或於吉會；或於福業；不為助伴，是名有犯，有所違越，是染違犯。",
        "translation": "It's a violation when someone doesn't perform tasks that should be performed, whether on the road or coming, when they're correctly explaining the application of effort, when they're guarding all their possessions, when they're making nice, discordant, and free from strife, when they're having an auspicious meeting, or when they're doing good actions, and doesn't act as an accomplice, which is a defiled violation.",
        "source": "T24n1501_001:1114b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為嬾墮懈怠所蔽，不為助伴，非染違犯。",
        "translation": "If someone is hindered by laziness and doesn't act as an accomplice, it's not a defiled offense.",
        "source": "T24n1501_001:1114b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若有疹疾；若無氣力；若了知彼自能成辦；若知求者自有依怙；若知所作能引非義能引非法；若欲方便調彼伏彼，廣說如前；若先許餘為作助伴；若轉請他有力者助；若於善品正勤修習不欲暫廢；若性愚鈍，於所聞法難受難持，如前廣說；若為將護多有情意；若護僧制，不為助伴，皆無違犯。",
        "translation": "There's no violation if someone has a hindrance or lacks energy, if they know they can do it on their own, if they know the person seeking them has their own support, if they know what they're doing can lead to what's not meant and can lead to what's not, if they want to skillfully tame them and subdue them, as explained in detail above, if they first allow others to be their accomplices, if they invite others to assist them, if they correctly and diligently cultivate good qualities and don't want to lose them for a while, if they're dull and have difficulty accepting and maintaining the teaching they've heard, as explained in detail above, if they want to protect the intentions of many sentient beings, or if they protect the saṃgha's rules and don't serve as an accomplice, they're not in violation.",
        "source": "T24n1501_001:1114b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，見諸有情，遭重疾病，懷嫌恨心，懷恚惱心，不往供事，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the observance of the bodhisattva precepts and see sentient beings suffering from serious illness and harboring resentment or anger, and they don't go to serve them, this is called a violation, and it's a defiled violation to transgress it.",
        "source": "T24n1501_001:1114b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為嬾墮懈怠所蔽，不往供事，非染違犯。",
        "translation": "If someone is hindered by laziness and indolence and doesn't go to offer an offering, it's not a defiled offense.",
        "source": "T24n1501_001:1114b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若自有病；若無氣力；若轉請他有力隨順令往供事；若知病者有依有怙；若知病者自有勢力，能自供事；若了知彼長病所觸，堪自支持；若為勤修廣大無上殊勝善品；若欲護持所修善品令無間缺；若自了知上品愚鈍，其慧鈍濁，於所聞法難受難持，難於所緣攝心令定；若先許餘為作供事。",
        "translation": "There's no violation if the person has their own illness, lacks energy, asks another person with energy to follow them and make offerings, knows that the sick person has support and support, knows that the sick person has strength and is able to make offerings on their own, knows that they're touched by a long-term illness, and are able to support themselves, diligently cultivates vast and unsurpassed good qualities, wants to safeguard the good qualities they cultivate so that they aren't lacking, knows that the higher qualities are dull and their wisdom is dull, has difficulty accepting and retaining the teachings they hear, and has difficulty collecting their mind and making it concentrate on the perceptual objects, or makes an offering to someone else.",
        "source": "T24n1501_001:1114b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如於病者，於有苦者為作助伴欲除其苦，當知亦爾。",
        "translation": "Just as a sick person makes a companion of someone who's suffering in order to remove that person's suffering, you should know that it's the same.",
        "source": "T24n1501_001:1114b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，見諸有情，為求現法、後法事故，廣行非理，懷嫌恨心，懷恚惱心，不為宣說如實正理，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts see sentient beings who, for the sake of the present world or subsequent worldly events, are engaged in extensive untruths, harbor resentment, and harbor anger, and don't explain the true and correct principles for them, this is called a transgression, and to transgress it is a defiled transgression.",
        "source": "T24n1501_001:1114c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮懈怠所蔽，不為宣說，非染違犯。",
        "translation": "If someone is hindered by laziness and doesn't explain it, it's not a defiled offense.",
        "source": "T24n1501_001:1114c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若自無知；若無氣力；若轉請他有力者說；若即彼人自有智力；若彼有餘善友攝受；若欲方便調彼伏彼，廣說如前；若知為說如實正理，起嫌恨心，若發惡言；若顛倒受；若無愛敬；若復知彼性弊[怡-台+龍]戾，不為宣說，皆無違犯。",
        "translation": "There's no violation if someone is ignorant, lacks energy, invites another powerful person to speak, has their own power, has another good friend to take them in, wants to skillfully tame them and subdue them, and explains it in detail as before, or if they become hostile when they know they're speaking the true and correct principle, speak harshly, are mistakenly perceived, or lack respect, or don't preach it when they know their nature is wrong [yi-tai+long].",
        "source": "T24n1501_001:1114c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，於先有恩諸有情所，不知恩惠，不了恩惠，懷嫌恨心，不欲現前如應酬報，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts don't know kindness, don't acknowledge kindness, and harbor resentment toward sentient beings who have previously shown kindness, and don't want to presently repay them as they should, this is called a violation, and transgressing it is a defiled violation.",
        "source": "T24n1501_001:1114c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為懶墮懈怠所蔽，不現酬報，非染違犯。",
        "translation": "If someone is hindered by laziness and indolence and doesn't presently reciprocation, it's not a defiled offense.",
        "source": "T24n1501_001:1114c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：勤加功用，無力無能不獲酬報；若欲方便調彼伏彼，廣說如前；若欲報恩而彼不受，皆無違犯。",
        "translation": "There's no violation: if someone diligently exerts themselves and has no power or ability not to obtain a reward, if they want to skillfully tame them and subdue them, as explained in detail above, or if they want to repay a kindness but don't accept it, there's no violation.",
        "source": "T24n1501_001:1114c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，見諸有情墮在喪失財寶眷屬祿位難處，多生愁惱，懷嫌恨心，不往開解，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts see sentient beings trapped in difficult places where they lose their possessions, their retinues, and their positions, and they become very sad and resentful and don't try to understand them, this is called a transgression, and it's a defiled transgression to transgress it.",
        "source": "T24n1501_001:1114c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為嬾墮懈怠所蔽，不往開解，非染違犯。",
        "translation": "If someone is hindered by laziness or indolence and doesn't come to an understanding, it's not a defiled offense.",
        "source": "T24n1501_001:1114c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：應知如前，於他事業，不為助伴。",
        "translation": "Those who don't transgress should know that, as before, they won't be an accomplice in other undertakings.",
        "source": "T24n1501_001:1114c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，有飲食等資生眾具，見有求者正來悕求飲食等事，懷嫌恨心，懷恚惱心，而不給施，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas who are well-established in the restraints of the bodhisattva precepts and have necessities such as food and drink, and they see a seeker who's seeking food and drink and so forth and harbor resentment and anger and don't give it to him, this is called a violation, and it's a defiled violation to transgress it.",
        "source": "T24n1501_001:1114c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮懈怠放逸，不能施與，非染違犯。",
        "translation": "If someone lazily falls into laziness and negligence and isn't able to give, it's not a defiled offense.",
        "source": "T24n1501_001:1114c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若現無有可施財物；若彼希求不如法物，所不宜物；若欲方便調彼伏彼，廣說如前；若來求者王所不宜，將護王意；若護僧制；而不惠施，皆無違犯。",
        "translation": "There's no violation: If there's nothing to give in the present, if they desire something less than the Dharma or something inappropriate, if they want to skillfully tame them and subdue them, as explained in detail above, if they come seeking something the king doesn't want, they'll defend the king's wishes, and if they defend the saṃgha's rules and don't give generously, all are without violation.",
        "source": "T24n1501_001:1114c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，攝受徒眾，懷嫌恨心，而不隨時無倒教授、無倒教誡；知眾匱乏，而不為彼從清淨信長者居士婆羅門等，如法追求衣服飲食諸坐臥具，病緣醫藥資身什物，隨時供給，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas maintain the restraints of the bodhisattva precepts and accept disciples who harbor resentment and don't teach or admonish without error at any time, and they know that their people are lacking but don't pursue clothing, food, bedding, and necessities for their bodies from pure, faithful householders and priests in ways according to the teaching, and make offerings at any time, this is called a violation, and it's a defiled violation to transgress it.",
        "source": "T24n1501_001:1115a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮懈怠放逸，不往教授，不往教誡，不為追求如法眾具，非染違犯。",
        "translation": "If someone becomes lazy and careless and doesn't go to teach or instruct others, and doesn't pursue the various necessities according to the teaching, it's not a defiled offense.",
        "source": "T24n1501_001:1115a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若欲方便調彼伏彼，廣說如前；若護僧制；若有疹疾；若無氣力不任加行；若轉請餘有勢力者；若知徒眾世所共知有大福德，各自有力求衣服等資身眾具；若隨所應教授教誡，皆已無倒教授教誡；若知眾內，有本外道，為竊法故來入眾中，無所堪能不可調伏，皆無違犯。",
        "translation": "Those who don't transgress: If they want to skillfully control others and subdue them, as explained in detail above; if they guard the rules of the saṃgha; if they have a medical condition; if they lack the energy to apply themselves; if they invite others with strength; if they know that their followers are known to have great virtue and each has a great collection of clothing and other necessities; if they teach and instruct as they should, without fail, and if they know that there are heretics in the congregation who come into the congregation to steal the Dharma and are incapable of being subdued, they don't transgress.",
        "source": "T24n1501_001:1115a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，懷嫌恨心，於他有情，不隨心轉，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts harbor resentment and don't follow the thoughts of other sentient beings, this is called a transgression, and transgressing it is a defiled transgression.",
        "source": "T24n1501_001:1115a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮懈怠放逸，不隨其轉，非染違犯。",
        "translation": "If someone lazily falls into laziness and negligence and doesn't follow it, it's not a defiled transgression.",
        "source": "T24n1501_001:1115a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若彼所愛非彼所宜；若有疾病；若無氣力不任加行；若護僧制；若彼所愛雖彼所宜，而於眾多非宜非愛；若為降伏諸惡外道；若欲方便調彼伏彼，廣說如前；不隨心轉，皆無違犯。",
        "translation": "Those who don't transgress: If something they love is not appropriate for them, if they're ill, if they lack the energy to apply themselves, if they guard the saṃgha's rules, if they love something that's appropriate but there are many things that are not appropriate or desirable, if they want to subdue evil non-Buddhists, or if they want to skillfully control them and subdue them, as explained in detail above, and don't follow their minds, they don't transgress.",
        "source": "T24n1501_001:1115a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，懷嫌恨心，他實有德不欲顯揚；他實有譽不欲稱美；他實妙說不讚善哉；是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas well-established in the restraints of the bodhisattva precepts harbor resentment, don't want to praise others who really have merit, don't want to praise others who really have honor, and don't praise others who really speak well, this is called a transgression, and to transgress it is a defiled transgression.",
        "source": "T24n1501_001:1115a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮懈怠放逸，不顯揚等，非染違犯。",
        "translation": "If someone lazily falls into laziness and negligence and doesn't praise them, it's not a defiled offense.",
        "source": "T24n1501_001:1115a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若知其人性好少欲，將護彼意；若有疾病；若無氣力；若欲方便調彼伏彼，廣說如前；若護僧制；若知由此顯揚等緣，起彼雜染憍舉無義，為遮此過；若知彼德雖似功德而非實德；若知彼譽雖似善譽而非實譽；若知彼說雖似妙說而實非妙；若為降伏諸惡外道；若為侍他言論究竟，不顯揚等，皆無違犯。",
        "translation": "Those who are not in violation know that their human nature has few desires and will protect their wishes; if they have an illness; if they lack energy; if they want to skillfully control them and subdue them, they explain it in detail as before; if they protect the saṃgha's regulations; if they know that this manifestation and other conditions give rise to their defiled arrogance and lack of purpose, in order to shield them from this error; if they know that their virtue may seem like merit but it's not real virtue; if they know that their praise may seem like good praise but it's not real praise; if they know that their discourse may seem like sublime discourse but it's really not sublime; if they don't manifest themselves in order to subdue evil non-Buddhists; and if they serve others in the completion of their discourse, they're not in violation.",
        "source": "T24n1501_001:1115a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，見諸有情應可訶責，應可治罰，應可驅擯，懷染污心，而不訶責；或雖訶責，而不治罰，如法教誡；或雖治罰如法教誡，而不驅擯，是名有犯，有所違越，是染違犯。",
        "translation": "If bodhisattvas firmly abide in the restraints of the bodhisattva precepts and see that sentient beings should be reprimanded, punished, or expelled, and they harbor a defiled mind and don't reprimand them, or if they reprimand them but don't punish them and instruct them according to the teaching, or if they punish them and instruct them according to the teaching but don't expel them, this is called a violation, and it's a defiled violation to transgress.",
        "source": "T24n1501_001:1115b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若由嬾墮懈怠放逸，而不訶責乃至驅擯，非染違犯。",
        "translation": "If someone lazily falls into negligence and dissipation but isn't reprimanded or even expelled, it's not a defiled offense.",
        "source": "T24n1501_001:1115b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若了知彼不可療治，不可與語，喜出麁言，多生嫌恨，故應棄捨；若觀待時；若觀因此鬪訟諍競；若觀因此令僧諠雜；令僧破壞；知彼有情不懷諂曲，成就增上猛利慚愧，疾疾還淨；而不訶責乃至驅擯，皆無違犯。",
        "translation": "Those who don't transgress: If they know that they are untreatable, untreatable in speech, delight in harsh speech, and generate much resentment, and therefore should abandon them, if they contemplate the time, contemplate the resulting quarrels and fights, and contemplate the resulting clutter and disruption of the saṃgha, and know that those sentient beings don't harbor flattery, achieve an intense, intense shame, and quickly return to purity, and don't reprimand or expel them, they don't transgress.",
        "source": "T24n1501_001:1115b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩安住菩薩淨戒律儀，具足成就種種神通變現威力，於諸有情應恐怖者能恐怖之，應引攝者能引攝之；避信施故，不現神通恐怖引攝，是名有犯，有所違越，非染違犯。",
        "translation": "If bodhisattvas firmly abide in the discipline of the pure bodhisattva precepts and fully achieve the power of manifesting various supernormal abilities, and they are able to terrorize sentient beings who should be terrorized and lead those who should be led in; avoiding faith and generosity and not manifesting supernormal abilities to terrorize and lead them in is called a violation, a transgression, and not a defiled violation.",
        "source": "T24n1501_001:1115b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無違犯者：若知此中諸有情類，多著僻執，是惡外道，誹謗賢聖，成就邪見，不現神通恐怖引攝，無有違犯。",
        "translation": "There's no violation: If someone knows that these sentient beings are often attached to remote attitudes, are bad non-Buddhists, denigrate the good and noble, and achieve wrong views, and don't manifest the psychic powers to terrorize and draw them in, there's no violation.",
        "source": "T24n1501_001:1115b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又一切處無違犯者：謂若彼心增上狂亂；若重苦受之所逼切；若未曾受淨戒律儀。",
        "translation": "\"Furthermore, there's no violation in any place: if their minds are increased and deranged, if they're stifled by severe painful feelings, or if they've never received the pure precepts and regulations.",
        "source": "T24n1501_001:1115b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知一切皆無違犯。",
        "translation": "You should know that none of them are transgressed.",
        "source": "T24n1501_001:1115b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩，從他正受戒律儀已，由善清淨求學意樂，菩提意樂；饒益一切有情意樂，生起最極尊重恭敬，從初專精不應違犯。",
        "translation": "If bodhisattvas, after they properly receive the precepts and regulations from others, because of their good and pure intentions to pursue training, their intentions to achieve enlightenment, and their intentions to benefit all sentient beings, generate the utmost respect and veneration, their initial concentration shouldn't be transgressed.",
        "source": "T24n1501_001:1115b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有違犯，即應如法疾疾悔除，令得還淨。",
        "translation": "If there is a transgression, it should be quickly removed according to the teaching, so that it can be returned to purity.",
        "source": "T24n1501_001:1115c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩一切違犯，當知皆是惡作所攝，應向有力，於語表義能覺能受小乘大乘補特伽羅，發露悔滅。",
        "translation": "Thus, bodhisattvas should know that all transgressions are the result of bad actions, so they should direct their strength to words and meanings, recognize and accept the lesser vehicle and greater vehicle pudgala, and reveal their repentance and extinguish it.",
        "source": "T24n1501_001:1115c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩以上品纏，違犯如上他勝處法，失戒律儀，應當更受。",
        "translation": "If bodhisattvas with the above-ranked afflictions violate the other superior dharmas as described above and lose the observance of the precepts, they should again accept them.",
        "source": "T24n1501_001:1115c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若中品纏，違犯如上他勝處法，應對於三補特伽羅，或過是數，應如發露除惡作法，先當稱述所犯事名，應作是說：長老專志，或言大德，我如是名，違越菩薩毘奈耶法，如所稱事，犯惡作罪。",
        "translation": "If a middle-ranking affliction violates the other superior dharmas as above, it should be addressed to the three patriarchs, or if it's more than that, the misdeeds should be removed as revealed, and the offending matter should first be called by its name, which should be explained like this: \"Elder, I'm concentrating, or I'm saying, 'Great Teacher, this is my name, which violates the bodhisattva Vinaya and violates the misdeeds as they're called.'",
        "source": "T24n1501_001:1115c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘如苾芻發露悔滅惡作罪法，應如是說。",
        "translation": "Whatever else a monk reveals and confesses to cease a misdeed, he should explain it this way.",
        "source": "T24n1501_001:1115c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若下品纏，違犯如上他勝處法，及餘違犯，應對於一補特伽羅發露悔法，當知如前。",
        "translation": "If a lower-ranking fetter violates the other superior dharmas as described above, and if there are other violations, the method of revealing repentance should be addressed to a single person in the patchwork, as should be seen above.",
        "source": "T24n1501_001:1115c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無隨順補特伽羅，可對發露，悔除所犯。",
        "translation": "If there's no compliant tutelary, he can reveal it and repent of the offense.",
        "source": "T24n1501_001:1115c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩以淨意樂，起自誓心，我當決定防護當來，終不重犯。",
        "translation": "With pure intention, the bodhisattva then arouses his own vow, \"I will definitely protect myself against future transgressions and never repeat them.",
        "source": "T24n1501_001:1115c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是於犯，還出還淨。",
        "translation": "Thus, the offense is returned, and it's returned to purity.",
        "source": "T24n1501_001:1115c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，如是所犯諸事菩薩學處，佛於彼彼素呾纜中隨機散說，謂依律儀戒，攝善法戒，饒益有情戒，今於此菩薩藏摩呾理迦，綜集而說。",
        "translation": "Furthermore, the bodhisattva's training positions for such offenses are explained in detail by the Buddha in his commentary on the precepts for observing restraint, for collecting good qualities, and for benefiting sentient beings, which are now collected and explained in this bodhisattva treasure house, the Mahāvairocana.",
        "source": "T24n1501_001:1115c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於中應起尊重，住極恭敬，專精修學。",
        "translation": "Bodhisattvas should revere it, abide in utmost respect, and concentrate on its cultivation.",
        "source": "T24n1501_001:1115c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩戒本一卷",
        "translation": "One volume of the Bodhisattva Prātimokṣa",
        "source": "T24n1501_001:1115c22_0",
        "is_bad_quality": false
    }
]