[
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事",
        "translation": "Mūlasarvâstivāda-vinaya-vijñāna-breaking-saṃgha",
        "source": "T24n1450_004:0115a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷第四",
        "translation": "Volume IV",
        "source": "T24n1450_004:0115a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏法師義淨奉　制譯",
        "translation": "Translated by the Tripiṭaka Master Yijing of the Great Tang",
        "source": "T24n1450_004:0115a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩，在於宮內嬉戲之處，私自念言：『我今有三夫人及六萬婇女，若不與其為俗樂者，恐諸外人云：「我不是丈夫。」",
        "translation": "\"At the time, the bodhisattva was playing in the palace and privately thought, 'Now, I have three wives and 60,000 concubines, but if I don't share my worldly pleasures with them, I'm afraid outsiders will say, 'I'm not a husband.'",
        "source": "T24n1450_004:0115a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當與耶輸陀羅共為娛樂。』",
        "translation": "Now, I will share my amusement with Yaśodharā.'",
        "source": "T24n1450_004:0115a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其耶輸陀羅因即有娠，既懷娠已生思念曰：『我於明旦報菩薩知。』",
        "translation": "As a result, Yāsodharā became pregnant, and after becoming pregnant, she gave rise to the thought, 'Tomorrow morning, I'll repay the bodhisattva for his knowledge.'",
        "source": "T24n1450_004:0115a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩，於其夜中約緣生理，而說頌曰：「『所共婦人同居宿，　　此是末後同宿時；　　我今從此更不然，　　永離女人同眠宿。』",
        "translation": "At that point, the bodhisattva made a physiological appointment during the night and spoke a verse, saying, 'This is the last time we shared a bed with a woman; from now on, I won't do so again, so I'll always sleep and sleep with a woman.'",
        "source": "T24n1450_004:0115b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「當此之夜，婇女倡伎悉皆疲倦、昏悶眠睡，或頭髮披亂、或口流涕唾、或復讇語、或半身露。",
        "translation": "\"On that night, the women and their musicians all grow weary and drowsy, and their hair is tousled, their mouths are runny and spiteful, they talk repeatedly, and they're half-exposed.",
        "source": "T24n1450_004:0115b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見此，雖在深宮猶如塚間見諸死人，即自思惟，而說頌曰：「『如風吹倒池蓮花，　　手脚撩亂縱橫臥；　　頭髮蓬亂身形露，　　所有愛心皆捨離。",
        "translation": "When the bodhisattva sees this, even though he's in a deep palace, he's like seeing dead people in a tomb.",
        "source": "T24n1450_004:0115b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我今見此諸女眠，　　猶如死人身形變；　　何故我不早覺知，　　在此無智有情境？",
        "translation": "Now, I see these women sleeping, just like the body of a dead person transformed; why didn't I realize earlier that I was in this cognitively insentient realm?'",
        "source": "T24n1450_004:0115b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　欲同彼泥箭毒火，　　如夢及飲鹹水等；　　當如龍王捨難捨，　　諸苦怨讎因此生。』",
        "translation": "They want to share their poisonous fire of mud and arrows, like a dream or drinking salty water, and so forth; they'll be like a dragon king who rejects what's difficult to reject and whose bitter enemies are thus created.'",
        "source": "T24n1450_004:0115b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩說此頌已便即眠睡。",
        "translation": "\"After speaking this verse, the bodhisattva went to sleep.",
        "source": "T24n1450_004:0115b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大世主夫人，於其夜中見四種夢：一者見月被蝕、二者見東方日出便即却沒、三者見多有人頂禮夫人、四者見其自身或笑或哭。",
        "translation": "At the time, Madame Mahāśrī saw four kinds of dreams during the night: first, she saw the moon being eclipsed, second, she saw the sun rising in the east and then disappearing, third, she saw many people prostrating to her, and fourth, she saw herself either laughing or crying.",
        "source": "T24n1450_004:0115b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時耶輸陀羅復於此夜見八種夢：一者見其母家種族皆悉破散、二者見與菩薩同坐之床皆自摧毀、三者見其兩臂忽然皆折、四者見其牙齒皆悉墮落、五者見其髮鬢悉皆墮落、六者見吉祥神出其宅外、七者見月被蝕、八者見日初出東方便即却沒。",
        "translation": "At the time, Yajñadatta also saw eight kinds of dreams during the night: one, he saw his mother's family all broken up and scattered; two, he saw the bed on which he was sitting with the bodhisattva destroyed; three, he saw his arms suddenly break, four, he saw his teeth all fall out; five, he saw his hair and hair on his head all fall out; six, he saw an auspicious spirit emerge from outside his house; seven, he saw the moon being eclipsed; and eight, he saw the sun rising in the east and then disappearing.",
        "source": "T24n1450_004:0115b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於夜中見五種夢：一者見其身臥大地，頭枕須彌山，左手入東海，右手入西海，雙足入南海；二者見其心上生吉祥草高出空際；三者見諸白鳥頭皆黑色，頂禮菩薩所欲騰空，不過菩薩膝下；四者見於四方雜色諸鳥，至菩薩前皆同一色；五者見雜穢山菩薩在上經行來去。",
        "translation": "During the night, the bodhisattva sees five kinds of dreams: first, he sees his body lying on the earth, his head resting on Mount Sumeru, his left hand entering the East Sea, his right hand entering the West Sea, and his feet entering the South Sea; second, he sees auspicious grass growing on his heart rising above the sky; third, he sees white birds with black heads, bowing their heads to the bodhisattva's wishes, rising into the air, and not reaching past the bodhisattva's knees; fourth, he sees birds of various colors in the four directions coming up to the bodhisattva, all of the same color; and fifth, he sees the bodhisattva on a mountain of various filth walking up and down.",
        "source": "T24n1450_004:0115b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見是夢已，即從臥起歡喜思念：『我今此相，不久之間當得阿耨多羅三藐三菩提無上之智。』",
        "translation": "After seeing this dream, he rose from his bed and joyfully contemplated, 'Now, with this appearance, I will soon attain the unsurpassed knowledge of the unsurpassed state of unsurpassed, correct, and complete enlightenment.'",
        "source": "T24n1450_004:0115c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時耶輸陀羅即從睡覺，便為菩薩說其八夢。",
        "translation": "Yehuda then roused from his sleep and explained the eight dreams to the bodhisattva.",
        "source": "T24n1450_004:0115c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時恐耶輸陀羅情生憂惱，方便為解此夢，令得歡悅：『見汝母家種族皆悉破壞者，今皆見在何為破壞？",
        "translation": "Fearing that Yaśodharā's feelings might be distressed, the bodhisattva then skillfully interpreted the dream and made it happy, 'Whoever saw the whole family of your mother destroyed, what have they seen now that's been destroyed?'",
        "source": "T24n1450_004:0115c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見汝與我同坐之床皆自摧毀者，床今見好云何摧毀？",
        "translation": "\"Whoever saw you destroying the bed on which you were sitting with me, how did he destroy the bed when he saw how nice it was?",
        "source": "T24n1450_004:0115c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見汝兩臂忽然皆折者，今皆無損。",
        "translation": "You saw your arms suddenly break, but now they're all undamaged.",
        "source": "T24n1450_004:0115c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見汝牙齒悉皆墮落者，今亦見好。",
        "translation": "You saw that your teeth all fell out, but now you see them well.",
        "source": "T24n1450_004:0115c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見汝鬢髮亦自墮落者，今見如故。",
        "translation": "You saw your hair on your eyebrows fall off by itself, but now I see it as before.",
        "source": "T24n1450_004:0115c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見吉祥神出汝宅者，婦人吉神所謂夫婿，我今見在。",
        "translation": "Seeing an auspicious spirit emerge from your home, I've seen what the woman's auspicious spirit calls her husband and son-in-law.",
        "source": "T24n1450_004:0115c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見月被蝕者，汝可觀之，今見圓滿。",
        "translation": "You may look at him when you see the moon being eclipsed, but now you see that it's full.",
        "source": "T24n1450_004:0115c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝見日出東方復遂沒者，今見夜半日猶未出，何為遂沒？』",
        "translation": "You saw that the sun rose in the east and then disappeared, but now you see that the sun still hasn't risen by midnight; why has it disappeared?'",
        "source": "T24n1450_004:0115c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時耶輸陀羅聞是解已，默然而住。",
        "translation": "After hearing this understanding, Yaśodharā stayed in silence.",
        "source": "T24n1450_004:0115c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時思惟是夢：『如耶輸陀羅所見之相，我於今夜即合出家。』",
        "translation": "The bodhisattva then considered this dream: 'According to what Yaśodharā has seen, I will leave home this very night.'",
        "source": "T24n1450_004:0115c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又作思念：『我應方便令耶輸陀羅略知覺我。』",
        "translation": "Again, he thought, 'Should I skillfully cause Yaśodharā to briefly perceive me?'",
        "source": "T24n1450_004:0115c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已告耶輸陀羅曰：『我願出家。』",
        "translation": "After that thought, he said to Yaśodharā, 'I'd like to leave home.'",
        "source": "T24n1450_004:0115c17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耶輸陀羅曰：『大天！",
        "translation": "Yajñadatta said, 'Great god!",
        "source": "T24n1450_004:0115c18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝欲往者可將我去。』",
        "translation": "'If you want to go, you can let me go.'",
        "source": "T24n1450_004:0115c18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩思念：『得涅槃時即將汝去。』",
        "translation": "The bodhisattva thought, 'I'll send you away when I attain nirvāṇa.'",
        "source": "T24n1450_004:0115c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報耶輸陀羅曰：『我有去處便將汝去。』",
        "translation": "He replied to Yaśodharā, 'I'll send you away when I have a place to go.'",
        "source": "T24n1450_004:0115c19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時耶輸陀羅聞是語已，歡喜而寢。",
        "translation": "After hearing those words, Yaśodharā rejoiced and went to sleep.",
        "source": "T24n1450_004:0115c20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩發心欲出，大梵天王及帝釋等知菩薩念，應時而至，合掌恭敬而說頌曰：「『心如未調馬，　　亦如躁獼猴；　　能捨五欲樂，　　速證涅槃明。",
        "translation": "\"Knowing the bodhisattva's intention to leave, the king of the Brahmas and Indra knew what the bodhisattva was thinking, and they arrived at the right time, joined their palms in respect, and spoke in verse, saying, 'My mind is like a horse not yet conditioned, and I'm like a restless monkey; I can abandon the five desires and pleasures and quickly realize the insight of nirvāṇa.",
        "source": "T24n1450_004:0115c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　大慈者起起，　　捨此大地尊；　　當得一切智，　　度脫諸眾生。』",
        "translation": "That greatly compassionate person arises, renounces this great earth honored one, and will attain omniscience and liberate all sentient beings.'",
        "source": "T24n1450_004:0115c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩報曰：『天帝釋！",
        "translation": "\"The bodhisattva replied, 'Tendai!",
        "source": "T24n1450_004:0115c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝不見耶？』",
        "translation": "Have you not seen it?'",
        "source": "T24n1450_004:0115c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說頌曰：「『如師子王在鐵檻，　　猛將弓刀守其傍；　　象馬人眾甚繁鬧，　　圍繞此城若為出。",
        "translation": "He then spoke a verse, \"Suppose a lion king is at the iron threshold, with fierce generals guarding his side with bows and swords; a great multitude of elephants, horses, and people surround the city as if to escape.",
        "source": "T24n1450_004:0115c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　父王猶如猛師子，　　四兵鐵甲皆全具；　　城塹樓閣及廊屋，　　種種兵仗皆充滿。",
        "translation": "His father is like a fierce lion, fully armoured with four armies and ironclads; his castle, moat, tower, and veranda are filled with armaments of every kind.",
        "source": "T24n1450_004:0116a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　見彼宮門及閤門，　　乃至城門亦如是；　　安諸鳴鈴普周遍，　　關拒甚難不可越。",
        "translation": "Seeing the palace gates and the burgesses, even the city gates, they are completely surrounded by ringing bells, and their barriers are too difficult to overcome.",
        "source": "T24n1450_004:0116a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　種種螺鼓圍遶我，　　喧聒鳴聲未曾息；　　宮外多諸象馬兵，　　勤加防衛不令出。』",
        "translation": "They're surrounded by various conch drums, and their raucous cries never stop; outside the palace, there are many elephant and horse soldiers who guard diligently and prevent them from leaving.'",
        "source": "T24n1450_004:0116a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時釋提桓因即說頌曰：「『昔有誓願今應思，　　然燈如來先授記；　　眾生多拘苦惱中，　　應速捨家求正道。",
        "translation": "\"It was then that Śakra Devānām-Indra spoke a verse, \"I should have considered that vow in the past, but the Rāṣṭrapāla Tathāgata first gave me the assurance that sentient beings are often constrained by suffering and distress, so I should quickly abandon my family and seek the right path.",
        "source": "T24n1450_004:0116a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我今亦能作如是，　　及彼梵王諸天等；　　當令汝得無障礙，　　詣樹林中修正覺。』",
        "translation": "Now, I can do the same, and so can those brahma kings and gods; I will make sure you'll be unobstructed and will go to the forest to cultivate awakening.'",
        "source": "T24n1450_004:0116a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩聞是頌已，其心歡喜答諸天曰：『善時！』",
        "translation": "\"After hearing this verse, the bodhisattva's heart rejoiced as he answered the gods, 'Good timing!'",
        "source": "T24n1450_004:0116a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋即以昏蓋覆諸兵眾及淨飯王倡伎婇女，所有一切防衛守護劫比羅城者，皆令睡眠，心無覺悟。",
        "translation": "Tendai then covered the soldiers, the king of pure rice, the musicians, and the concubine maidens who were guarding Kapilavastu, all of whom were put to sleep and had no awakening in their minds.",
        "source": "T24n1450_004:0116a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命夜叉大將散支迦持取踏梯，便令菩薩從梯而下至車匿所。",
        "translation": "He ordered the great yakṣa general Sanskrit to take a stepping-stone and have the bodhisattva descend it to Chandaka's place.",
        "source": "T24n1450_004:0116a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見車匿方睡，菩薩以手推覺，良久方悟。",
        "translation": "Seeing that Chandaka was fast asleep, the bodhisattva pushed him away with his hand and realized it only after a long time.",
        "source": "T24n1450_004:0116a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時即說頌曰：「『起起汝車匿，　　速被乾陟來；　　過去勝者林，　　我往彼寂默。』",
        "translation": "The bodhisattva then spoke a verse, \"Rouse yourself, Chasenajit, and quickly be transported to the forest of the victorious ones from the past, to whose silence I will go.\"",
        "source": "T24n1450_004:0116a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時車匿若睡、若覺，以頌報曰：「『今非遊觀時，　　汝先無怨敵；　　既無怨賊來，　　云何夜索馬？』",
        "translation": "\"Whether asleep or awake, the charioteer then replied with a verse, 'This is not a time for wandering, for you had no enemy; since no enemy or thief has come, why did you ask for a horse at night?'",
        "source": "T24n1450_004:0116a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩以頌告曰：「『車匿汝昔來，　　不違我言教；　　勿於末後時，　　方欲違我命。』",
        "translation": "\"The bodhisattva told them in verse, 'Chandaka, you never disobeyed my words in the past; don't try to disobey my order until the latter time.'",
        "source": "T24n1450_004:0116a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「車匿報曰：『今夜半時，我懷恐怖不能取馬。』",
        "translation": "\"Chasenajit reported, 'At midnight tonight, I was too frightened to pick up my horse.'",
        "source": "T24n1450_004:0116a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時聞是語已，便自思念：『我若與此車匿言酬未已，恐傍人聞廢我前去，不如自被馬王乾陟。』",
        "translation": "After hearing those words, the bodhisattva then thought to himself, 'If I haven't finished speaking to this Chakra, I'm afraid people might hear that I'm leaving, so I might as well let myself be taken by the horse king Kanchaku.'",
        "source": "T24n1450_004:0116a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即趨馬坊至乾陟所。",
        "translation": "He then went to the horse park and went to Kanchak's place.",
        "source": "T24n1450_004:0116b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼乾陟見菩薩來，即懷嗔怒如大猛火，跳踉來去未便受捉。",
        "translation": "When he saw the bodhisattva coming, he became angry and raged like a great fire, jumping and stumbling before he could be caught.",
        "source": "T24n1450_004:0116b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩手中先有百寶輪相，一切怖畏眾生見菩薩者，菩薩即以百寶手撫慰安隱。",
        "translation": "The bodhisattva first had a hundred-jewel wheel in his hand, and when all the fearful sentient beings who saw the bodhisattva were comforted and calmed by the bodhisattva's hand with a hundred jewels.",
        "source": "T24n1450_004:0116b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時便以輪手撫其馬頭，即說頌曰：「『我今末後時乘汝，　　速當至彼不久留；　　我當不久證菩提，　　當以法雨潤眾生。』",
        "translation": "The bodhisattva then put his wheel hand on the horse's head and spoke a verse, \"Now, I'll ride you in the latter part of my life; I'll quickly reach them and won't stay long; I'll soon realize enlightenment; and I'll wet sentient beings with the Dharma rain.\"",
        "source": "T24n1450_004:0116b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次一切眾生有常法，有人教者即能習學。",
        "translation": "\"Furthermore, all sentient beings have a constant dharma that can be cultivated by someone who teaches them.",
        "source": "T24n1450_004:0116b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乾陟馬王聞此頌已，即便安住，菩薩歡喜便被牽出。",
        "translation": "After hearing this verse, King Gandhāra immediately took refuge, and the bodhisattva was joyfully led out.",
        "source": "T24n1450_004:0116b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵王帝釋令四天子共扶乾陟擁衛菩薩。",
        "translation": "Brahmā Tissa then asked the four celestials to help the bodhisattva Gandhāra.",
        "source": "T24n1450_004:0116b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天子者：一名彼岸、二名近岸、三名香葉、四名勝香葉，皆有威力，詣菩薩所侍立左右。",
        "translation": "The four celestials, one from the other shore, two from the near shore, three from Kaṇṭhaka and four from Vairocana, were all powerful and went to the bodhisattva to stand at his right and left.",
        "source": "T24n1450_004:0116b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩問曰：『誰能將我騰空而出？』",
        "translation": "The bodhisattva asked, 'Who can make me rise out of the sky?'",
        "source": "T24n1450_004:0116b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天子曰：『我等皆能。』",
        "translation": "The four celestials said, 'We're all capable.'",
        "source": "T24n1450_004:0116b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩又曰：『汝等有何神力？』",
        "translation": "The bodhisattva also said, 'What's your miraculous power?'",
        "source": "T24n1450_004:0116b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼岸報曰：『太子當知！",
        "translation": "The other shore reported, 'The prince should know!",
        "source": "T24n1450_004:0116b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盡大地土我猶擎得，亦復將行。』",
        "translation": "I've managed to reach as far as the whole world, and I'll travel again.'",
        "source": "T24n1450_004:0116b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近岸復曰：『四大海水及諸江河，我今亦能荷負將行。』",
        "translation": "Approaching the shore, he also said, 'Now, I can carry the four great waters and the rivers that will travel.'",
        "source": "T24n1450_004:0116b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香葉又曰：『一切山石我能擔負將行。』",
        "translation": "Gandhaṃśa also said, 'I can carry all the mountains and rocks and will carry them.'",
        "source": "T24n1450_004:0116b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝香葉又曰：『一切林樹及諸叢草，能負將行。』",
        "translation": "Vairocana also said, 'I can carry all the trees and bushes that will carry me.'",
        "source": "T24n1450_004:0116b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩聞已以脚案地，令四天子盡力擎之。",
        "translation": "After hearing this, the bodhisattva put his foot on the ground and asked the four celestials to carry it with all their might.",
        "source": "T24n1450_004:0116b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時四天子，即皆盡力共相動挽，乃至疲乏猶動不得。",
        "translation": "The four celestials then all did their best to pull each other to the ground, even though they were exhausted and couldn't move.",
        "source": "T24n1450_004:0116b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時四天子盡皆驚愕，白菩薩曰：『不知菩薩有大威力，我等若知有是力者，不敢擎之。』",
        "translation": "They were all startled and said to the bodhisattva, 'I don't know that the bodhisattva has great power; if we knew we had such power, we wouldn't dare to carry it.'",
        "source": "T24n1450_004:0116b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時車匿，聞其菩薩與四天子遞相言說，即便趨行至菩薩所。",
        "translation": "Then, when Chandaka heard what the bodhisattva and the four celestials had said to each other, he quickly made his way to the bodhisattva.",
        "source": "T24n1450_004:0116b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時即乘乾陟，時四天子各扶馬足，爾時車匿一手攀鞦、一手執刀。",
        "translation": "The bodhisattva then rode up on a dry heave, while the four celestials each supported the horse's feet, and Chandaka then climbed onto a swing with one hand and held a sword with the other.",
        "source": "T24n1450_004:0116b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩諸天威力感故，即騰虛空。",
        "translation": "The bodhisattva was overcome by the power of the gods and soared into the sky.",
        "source": "T24n1450_004:0116b27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宮中善神既見是已，悉皆號哭，淚下如雨。",
        "translation": "When the good spirits in the palace saw this, they all cried out and wept, and tears poured down like rain.",
        "source": "T24n1450_004:0116b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "車匿見之白菩薩曰：『此是雨不？』",
        "translation": "When he saw them, Chandaka said to the bodhisattva, 'Is this rain?'",
        "source": "T24n1450_004:0116b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『此不是雨，是宮中神見我今去，淚下如此。』",
        "translation": "The bodhisattva replied, 'This isn't rain; it's the gods in the palace who saw me leaving now and shed tears like this.'",
        "source": "T24n1450_004:0116b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "車匿爾時聞菩薩此言，哽咽歔欷，默然不語。",
        "translation": "Hearing this from the bodhisattva, Chandaka choked back his sobs and remained silent.",
        "source": "T24n1450_004:0116c01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時，如象旋顧望其宮中，便自思念：『是我末後與諸女人共居一處，今一時別之，不復更爾。』",
        "translation": "The bodhisattva then looked around like an elephant at his palace and thought to himself, 'This is the last time I lived with women in the same place.",
        "source": "T24n1450_004:0116c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復重思念：『我若不從東門與父王別，恐生嫌恨，責諸兵士不加防守。』",
        "translation": "Again, he thought, 'If I don't part with my father through the east gate, I'm afraid I'll become hostile and blame the soldiers for not guarding it.'",
        "source": "T24n1450_004:0116c04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即詣東門，見其父王睡眠極重。",
        "translation": "He went to the east gate and saw his father in a state of deep sleep.",
        "source": "T24n1450_004:0116c06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時遶父王三匝跪禮父足，作是言曰：『我今去者非不孝敬，但為生老病死磨滅有情。",
        "translation": "The bodhisattva then went around his father three times, prostrated at his father's feet, and said, 'I'm not leaving now because I'm not being ungrateful, but only because I'm grinding away sentient beings in birth, old age, illness, and death.",
        "source": "T24n1450_004:0116c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是義故，我欲出家證菩提道救濟斯苦。』",
        "translation": "For this reason, I want to leave home and realize the path to enlightenment to save them from this suffering.'",
        "source": "T24n1450_004:0116c09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已即騰虛空。",
        "translation": "After saying this, he then rose into the sky.",
        "source": "T24n1450_004:0116c10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時釋迦大名將軍，巡行觀察至城東門，忽見菩薩騰在虛空，發聲啼哭白菩薩曰：『欲何所作？",
        "translation": "\"When the Śākyamuni general was walking around, observing the city's east gate, he suddenly saw the bodhisattva ascending into space, and he cried out and said to the bodhisattva, 'What do you want to do?'",
        "source": "T24n1450_004:0116c10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲何所作？』",
        "translation": "What do you want to do?'",
        "source": "T24n1450_004:0116c12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『大將當知！",
        "translation": "The bodhisattva replied, 'You should know, General!",
        "source": "T24n1450_004:0116c13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲出家。』",
        "translation": "I want to leave home.'",
        "source": "T24n1450_004:0116c13_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大名將曰：『此是非法。』",
        "translation": "The great commander said, 'That's not right.'",
        "source": "T24n1450_004:0116c13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『我已曾於三阿僧祇劫常行苦行求無上菩提，於一切眾生拔諸苦難；我今豈得在於宮中？",
        "translation": "The bodhisattva replied, 'I've spent three incalculable eons engaged in constant austerities in search of unsurpassed enlightenment and removed the suffering and distress of all sentient beings; how could I stay in the palace now?'",
        "source": "T24n1450_004:0116c14_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今當一心為法而去。』",
        "translation": "Now, I will go away with one mind focused on the teaching.'",
        "source": "T24n1450_004:0116c16_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大名釋迦聞是語已即復啼哭：『哀哉！",
        "translation": "After hearing these words, the great-named Śākyamuni again cried out, 'Oh, my!",
        "source": "T24n1450_004:0116c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哀哉！",
        "translation": "Alas!",
        "source": "T24n1450_004:0116c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨飯大王及諸釋種。",
        "translation": "\"King Śuddhodana and the Śākyas.",
        "source": "T24n1450_004:0116c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "What suffering!",
        "source": "T24n1450_004:0116c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！』",
        "translation": "What a pain!'",
        "source": "T24n1450_004:0116c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖發大願欲留太子，徒加愛念，此事便發，釋迦大將即說頌曰：「『今日淨飯王，　　為子生憂惱；　　舉手叫蒼天，　　悲恨大號哭。",
        "translation": "Although he had made a great vow to keep the prince, he was in vain in his thoughts, and then this matter arose, and the Śākyamuni general spoke a verse, saying, \"Today, King Jīvaka becomes sad and troubled for his son; he raises his hand and cries out to the heavens, lamenting his hatred.",
        "source": "T24n1450_004:0116c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　耶輸陀羅等，　　及諸大宮人；　　今別悉達已，　　常為苦所逼。』",
        "translation": "Yaśodharā and the others in the great palace have been separately siddhared and are constantly being forced by suffering.'",
        "source": "T24n1450_004:0116c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大名釋迦說此頌已，悲淚懊惱，速至耶輸陀羅所，以手推耶輸陀羅，即說頌曰：「『悉達夫欲去，　　應可生留戀；　　勿當後時憂，　　為憶夫愁故。",
        "translation": "\"After reciting this verse, the great celebrity Śākyamuni, overcome with sorrow and tears, quickly went to Yāsodhara, thrust his hand against Yāsodhara, and spoke the verse, \"Siddhârtha wants to leave, so he should not become attached; don't be sad later, for the sake of remembering your husband's sorrow.",
        "source": "T24n1450_004:0116c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　今去極難見，　　最後相見時；　　苦哉無人聞，　　覺去勿罪我。』",
        "translation": "It's extremely difficult to see him leaving now, but when we finally meet, it's painful for no one to hear about him; don't offend me by realizing he's leaving.'",
        "source": "T24n1450_004:0116c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大名釋迦頻於內宮遍告眾人，了無覺者，悲惱忙懼。",
        "translation": "\"The great-named Śākyamuni went to the inner palace and told the people there, comprehending that there was no one to awaken, and they were troubled and frightened.",
        "source": "T24n1450_004:0117a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復速往彼淨飯王所，覺淨飯王，即說頌曰：「『悉達今欲去，　　王當速制之；　　勿於彼後時，　　為子常憂惱。』",
        "translation": "He quickly went to King Jīvaka and awakened him, saying, 'Now that Siddhârtha wants to leave, the king will quickly restrain him; don't be so sad and distressed for your son when he comes after him.'",
        "source": "T24n1450_004:0117a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大名釋迦再三覺之，王猶眠睡曾不暫覺。",
        "translation": "\"The king was still asleep when the great-named Śākyamuni awakened him again and again, but he never awoke for a moment.",
        "source": "T24n1450_004:0117a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時釋梵天等與無量百千諸天眷屬來詣菩薩，至菩薩所便即圍遶。",
        "translation": "It was then that Śakra Devānām-Indra and the rest of his retinue came to the bodhisattva with measureless hundreds of thousands of gods and surrounded him when he arrived.",
        "source": "T24n1450_004:0117a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大梵天王及色界諸天，儼然無聲在菩薩右，釋提桓因及欲界天在菩薩左，或有執持幡蓋并奏音樂，或於空中散諸香花供養菩薩，所謂優鉢羅花、波頭摩花、分陀利花、曼陀羅花、摩訶曼陀羅花，栴檀、沈水香、粖香和香，以散菩薩。",
        "translation": "The king of the Brahmas and the gods of the form realm were to the right of the bodhisattva in a silent manner, while Śakra Devānām-Indra and the gods of the desire realm were to the left of the bodhisattva. Some of them carried banners and flags, played music, or scattered flowers and fragrances in the air to offer support to the bodhisattva, such as the flowers of upādhara, padma, puṇḍarī, mandāra, and mahāmandāra, as well as sandalwood, the scent of sinking water, and the scent of mixed incense, to scatter to the bodhisattva.",
        "source": "T24n1450_004:0117a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以種種上妙衣服散於空中；復於空中擊鼓吹螺作諸倡伎，而作頌曰：「『諸天在空中，　　悉皆大踊躍；　　抃舞菩薩前，　　歌讚於菩薩。",
        "translation": "Again, he scattered various fine garments in the air, beat drums and blew conchs in the air, created various tricks, and composed a verse, saying, \"The gods in the air are all in great exultation, dancing and singing praises to the bodhisattva.",
        "source": "T24n1450_004:0117a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　無邊諸天眾，　　揶揄彼魔軍；　　或有作音樂，　　或有引前者。",
        "translation": "An infinite number of gods ridicule that army of Māra; some make music, and some lead them on.",
        "source": "T24n1450_004:0117a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　或復開諸門，　　或以花來散；　　或有扶馬足，　　瞻仰隨從行。",
        "translation": "Some open their gates, some bring flowers to scatter, some support the feet of horses, and some venerate and follow them.",
        "source": "T24n1450_004:0117a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　或復左旋繞，　　或復居左右；　　多聞及梵釋，　　先引菩薩路。",
        "translation": "Sometimes they circled to the left, sometimes they stayed to the left and right, and well-versed monks and Brahmā interpreters first led the bodhisattva on his path.",
        "source": "T24n1450_004:0117a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切威德天，　　無不隨從者；　　如月在星中，　　往彼聖者林。』",
        "translation": "None of the authoritative gods fail to follow them, like the moon among the stars, as they go to the forest of the sages.'",
        "source": "T24n1450_004:0117a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時菩薩出劫比羅城已，梵釋天等皆大歡喜，白菩薩曰：『善哉仁者！",
        "translation": "\"After the bodhisattva left Kapilavastu, the Brahmakāyika gods and others rejoiced greatly and said to the bodhisattva, 'Good, sir!",
        "source": "T24n1450_004:0117a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝昔長夜如是希求言：「我何時獲無障礙在閑林中？」",
        "translation": "For a long time, you've longed for this, saying, \"When will I be unobstructed in a quiet forest?\"",
        "source": "T24n1450_004:0117a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝昔有願，今悉圓滿。",
        "translation": "Now, you've fulfilled all your past vows.",
        "source": "T24n1450_004:0117a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝若證得無上道時，攝受我等。』",
        "translation": "If and when you realize the unsurpassed way, you'll take us in.'",
        "source": "T24n1450_004:0117b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩曰：『如汝所願。』",
        "translation": "The bodhisattva said, 'As you've wished.'",
        "source": "T24n1450_004:0117b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩如象王右顧觀諸天等，作是頌曰：「『不證無上道，　　了知諸佛法；　　不復重來歸，　　入此劫比城。』",
        "translation": "The bodhisattva then looked right at the gods like an elephant king and composed this verse, \"Not realizing the unsurpassed way, I fully understand the Buddha's teaching; I won't return again, but I'll enter this city of Kapphiṇa.\"",
        "source": "T24n1450_004:0117b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時菩薩，以二更中行十二踰膳那，從馬而下，即解瓔珞告車匿曰：『汝可將馬及我瓔飾從此迴去。』",
        "translation": "\"At the time, the bodhisattva traveled 12 yojana in two watches, got down from his horse, and untied his necklace and told Chandaka, 'You may turn back from here with your horse and my necklace.'",
        "source": "T24n1450_004:0117b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說頌曰：「『此馬及瓔飾，　　可付我親屬；　　我今捨貪愛，　　從此被法服。』",
        "translation": "He then spoke a verse, \"This horse and its ornaments may be entrusted to my relatives; now, I've abandoned craving and will be clothed in the Dharma from here.\"",
        "source": "T24n1450_004:0117b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時車匿聞此語已，發聲號哭悲感懊惱，淚下如雨，而說頌曰：「『獅子虎成群，　　蕀林惡獸跡；　　獨住無眷屬，　　聖者如何住？』",
        "translation": "\"After hearing these words, Chandaka raised his voice, wept, was saddened and distressed, and burst into tears as he spoke, saying, \"How can the noble one abide when lions and tigers swarm together and dangerous beasts track in the jungle?\"",
        "source": "T24n1450_004:0117b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩爾時以頌報曰：「『生者獨自生，　　死者亦自死；　　苦者還自受，　　生死無有伴。』",
        "translation": "\"The bodhisattva then replied with a verse, 'Birth alone is born, and death itself is death; suffering is experienced by itself, and birth-and-death has no companion.'",
        "source": "T24n1450_004:0117b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時車匿復說頌曰：「『汝昔常乘諸象馬，　　手足柔軟未經苦；　　攢搓刃石滿斯地，　　如何於此堪行住？』",
        "translation": "\"It was then that Chandaka again spoke a verse, \"You used to ride elephants and horses, whose hands and feet were tender and hadn't yet experienced suffering; how could you walk and stand here while rubbing blades and stones all over the ground?\"",
        "source": "T24n1450_004:0117b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩以頌報曰：「『假令少小憍養育，　　賢善及與諸孤獨；　　勇猛無畏人恭敬，　　如斯等類咸歸死。",
        "translation": "\"The bodhisattva replied with a verse, 'Suppose a young child is nourished, a good person and someone who's alone, courageous and fearless, and respected by others, such a person will all return to death.",
        "source": "T24n1450_004:0117b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　生老病死相紛鬪，　　速來逼迫一切人；　　縱有餘願不少寬，　　能令須臾盡磨滅。』",
        "translation": "Birth, old age, illness, and death are often fought, and they quickly oppress all people; even though there are other vows, they aren't too lenient, and they can be completely annihilated in a moment.'",
        "source": "T24n1450_004:0117b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「車匿報曰：『太子！",
        "translation": "\"Chandaka reported, 'Prince!",
        "source": "T24n1450_004:0117b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨飯大王若不見汝，必大懊惱便當至死。』",
        "translation": "If the great king Śuddhodana didn't see you, he'd be greatly distressed and would die.'",
        "source": "T24n1450_004:0117b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩雖聞是已，為得菩提資糧久圓滿故，於車匿言曾不在念。",
        "translation": "Although the bodhisattva heard this, he told Chandaka that he hadn't been mindful of it for a long time because he had perfected the necessary preparations for attaining enlightenment.",
        "source": "T24n1450_004:0117b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩即於車匿手中取其所執之刀，其刀輕利，青光湛色如青蓮花葉。",
        "translation": "The bodhisattva then took the knife he was holding from Chandaka's hand, and it was a light, sharp blade the color of a blue-glowing lotus leaf.",
        "source": "T24n1450_004:0117b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既拔其刀，即自割髮擲虛空中。",
        "translation": "After pulling it out, he cut off his own hair and threw it into the sky.",
        "source": "T24n1450_004:0117c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因於虛空中即便捧接，將往三十三天。",
        "translation": "Śakrodevānām Indra then picked it up right there in the sky and sent it off to the Trāyastriṃśa Heaven.",
        "source": "T24n1450_004:0117c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每至此日，集三十三大眾旋繞供養。",
        "translation": "Every day he arrived, he gathered a large crowd of the Trāyastriṃśa gods to surround him and make offerings.",
        "source": "T24n1450_004:0117c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其割髮之地，信心長者婆羅門等營一寶塔，名曰割髮地塔，苾芻俗人常應供養。",
        "translation": "At the site where he cuts his hair, the faithful elders Brāhmaṇa and the others build a jeweled stūpa called the stūpa where he cuts his hair, which is always used by monks and laypeople for making offerings.",
        "source": "T24n1450_004:0117c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩當割髮已告車匿曰：『汝見我不？",
        "translation": "After cutting his hair, the bodhisattva told Chandaka, 'Do you see me?'",
        "source": "T24n1450_004:0117c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形容已毀心復堅固，如斯之人豈有更還在人間耶？』",
        "translation": "How could a person whose features have been disfigured and whose mind is still resolute like this be any longer among human beings?'",
        "source": "T24n1450_004:0117c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "車匿曰：『不也。』",
        "translation": "Then Chandaka said, 'No.'",
        "source": "T24n1450_004:0117c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "車匿即自思念：『今此太子是剎帝利種，情多高慢，我雖苦言終不移改。』",
        "translation": "Chandaka then thought to himself, 'Now, this prince is of the Kārttiari lineage and has many arrogant feelings, but even though I've spoken bitterly, I won't change them.'",
        "source": "T24n1450_004:0117c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已禮菩薩足，乾陟馬王亦禮菩薩，便吐其舌舐菩薩足，菩薩即以百寶輪手撫其馬背，而作是言：『汝乾陟去，我證菩提常念汝恩。』",
        "translation": "After he had thought this, he saluted the feet of the Bodhisattva, and the king of the cart-chested horses saluted the Bodhisattva, then he stuck his tongue out and licked the Bodhisattva's feet, and the Bodhisattva then rubbed his horse's back with the hand of the hundred-jeweled wheel and said, 'You cart-chested horse, I'll always think of your kindness as I realize enlightenment.'",
        "source": "T24n1450_004:0117c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告車匿曰：『汝必不應將我乾陟入於宮內。』",
        "translation": "He told Chandaka, 'You mustn't take me into the palace dry-aside.'",
        "source": "T24n1450_004:0117c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "車匿悲泣不勝哽咽，所視迷悶歸還路時顧菩薩前。",
        "translation": "Lamenting and weeping, Chandaka couldn't stop choking, and he looked at the bodhisattva as he returned home.",
        "source": "T24n1450_004:0117c13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以菩薩神德力故，於二更中便至於彼，及車匿還路，經七日方至本國。",
        "translation": "Because of the bodhisattva's spiritual power, he reached him in the second watch of the night, and it took him seven days to reach his native land after returning to the road.",
        "source": "T24n1450_004:0117c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「既到城門，車匿念言：『我若與馬同入城者，當為眾人之所尤怨，我之身命或可不存。』",
        "translation": "\"When he arrived at the city gate, Chasenajit thought, 'If I were to enter the city with the horses, I would be disliked by the people, and my life might not survive.'",
        "source": "T24n1450_004:0117c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時車匿入苑林中，且先遣馬却入城內。",
        "translation": "Then Chandaka went into the park and forest and sent the horses into the city first.",
        "source": "T24n1450_004:0117c18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時乾陟既入城內，即便悲嘶。",
        "translation": "After he entered the city, Gandhāra even hissed sadly.",
        "source": "T24n1450_004:0117c19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時城中人及宮人等，聞此馬聲咸皆忙遽，不見菩薩，抱乾陟項悲號懊惱。",
        "translation": "When the people of the city and the palace heard the sound of the horse, they all rushed about, didn't see the bodhisattva, and embraced Gan Cheok's head, wailing with pity and distress.",
        "source": "T24n1450_004:0117c20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然畜生有常法，於世間情無不解了，況此馬王。",
        "translation": "Still, animals have eternal principles, and there's nothing in the world that they don't understand, so why wouldn't this horse king?",
        "source": "T24n1450_004:0117c21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時乾陟見諸人等號慟傷感，其氣迷絕便至於殞。",
        "translation": "Seeing all these people and others, Kaṇṭhaka was overcome with emotion and sadness, and his energy faded and he died.",
        "source": "T24n1450_004:0117c22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此乾陟從昔已來，於具六種勤事婆羅門家，受其胎形。",
        "translation": "Still, since ancient times, this Kāñcak has been in the home of a Brahmin who has six kinds of diligent service and has received his womb form.",
        "source": "T24n1450_004:0117c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩得無上道時，當言：『汝惡性馬。』",
        "translation": "If a bodhisattva attains the unsurpassed path, he'll say, 'Your bad nature is a horse.'",
        "source": "T24n1450_004:0117c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便得宿念，超於生死畏途中，登究竟涅槃岸。",
        "translation": "Then he'll attain longing for the past, transcend the fearful path of birth and death, and reach the shore of final nirvāṇa.",
        "source": "T24n1450_004:0117c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時菩薩須袈裟，於無比城中有一居士，財寶富盛倉庫盈溢多諸眷屬，如薜室羅末拏天王。",
        "translation": "\"Suppose the bodhisattva needs a robe, and there's a householder in a peerless city with an overflowing storehouse of wealth and possessions and many retinues, like Vaiśravaṇa, the king of the gods.",
        "source": "T24n1450_004:0117c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼居士，於其同類種族中取女為妻，既得為婦共相娛樂，俗禮和合因生一子，如是乃至生於十子，皆悉出家證辟支佛道。",
        "translation": "That householder then took a woman of his own race as his wife, and once she became a wife, they shared in the entertainment of each other, and as a result of their secular union, one son was born, and so on up to the birth of ten sons, all of whom left home and realized the pratyekabuddha path.",
        "source": "T24n1450_004:0117c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其母，與此十子疎布衣服。",
        "translation": "At the time, their mother and these ten sons spread their robes together.",
        "source": "T24n1450_004:0118a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼十子共白母曰：『我今便入涅槃不須此物。』",
        "translation": "The ten sons then said to their mother, 'Now, I'm going to enter nirvāṇa and don't need this.'",
        "source": "T24n1450_004:0118a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時十辟支佛白母言：『淨飯王子釋迦牟尼，當得阿耨多羅三藐三菩提，願母將此衣服可施與彼，必當獲得無量果報。』",
        "translation": "The ten pratyekabuddhas then said to their mother, 'Śākyamuni, the prince of the pure rice, will attain unsurpassed, correct enlightenment, and may his mother give him this robe, for he will surely attain immeasurable rewards.'",
        "source": "T24n1450_004:0118a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，即於宮中現十八變，火化而滅入無餘涅槃。",
        "translation": "After he said this, he was transformed into 18 forms in his palace, and he was cremated and extinguished into nirvāṇa without remainder.",
        "source": "T24n1450_004:0118a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其母年老困疾將死，持其衣服囑付於女，具說前事。",
        "translation": "When her mother was old and sick and about to die, she took her robe and entrusted it to her daughter, explaining the previous events.",
        "source": "T24n1450_004:0118a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時女後時染患將卒，復持此衣置樹空中，告樹神曰：『今此衣服為我守護，待淨飯王子出家之日，當持與之。』",
        "translation": "When she was dying of a late-stage infection, she again put the robe in the air above a tree and told the tree god, 'Now, this robe will be my guard; on the day Prince Jīvaka leaves home, I will give it to him.'",
        "source": "T24n1450_004:0118a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋觀其下界，乃見此衣在樹空中，便往取之身自被著，作老獵師形狀，執持弓箭與菩薩相近。",
        "translation": "Tiṣya then looked down into the world and saw the robe in the sky above the tree, so he went and took it, covered himself in it, assumed the shape of an old hunter, and approached the bodhisattva with a bow and arrow.",
        "source": "T24n1450_004:0118a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩告曰：『此是出家人衣，我衣貴妙是俗人服，今欲相換可得以不？』",
        "translation": "The bodhisattva told him, 'This is the robe of a renunciant; my robe is noble and marvelous, but is it possible to exchange it with a layman's robe?'",
        "source": "T24n1450_004:0118a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獵師報曰：『我不相與。",
        "translation": "The hunter replied, 'I won't go with him.",
        "source": "T24n1450_004:0118a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_004:0118a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若取汝好服行於人間，或有見者便言：「我殺於汝取汝此衣。」』",
        "translation": "If I take your nice clothes and walk among people, then someone who sees them will say, 'I killed you and took this robe from you.'",
        "source": "T24n1450_004:0118a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『汝獵師當知！",
        "translation": "The bodhisattva replied, 'You hunter should know!",
        "source": "T24n1450_004:0118a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切世間所有人眾，咸知我有勇猛智慧無能殺者，誰有將此能殺我者？",
        "translation": "\"All the people of the world know that I have courage and wisdom and that there's no one who can kill me, so who is there who would be able to kill me?",
        "source": "T24n1450_004:0118a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝不須懼。』",
        "translation": "You needn't be afraid.'",
        "source": "T24n1450_004:0118a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋即跪持衣奉與菩薩。",
        "translation": "Śakra then knelt down, took the robe, and handed it to the bodhisattva.",
        "source": "T24n1450_004:0118a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩得此衣已便即著之，衣窄身大不遍覆體，作是念言：『此出家服小，不堪受用。",
        "translation": "After he received this robe, the bodhisattva put it on, but it was narrow and large, not covering his body, and he thought, 'This monk's robe is too small to be used.",
        "source": "T24n1450_004:0118a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有威力，願自寬大今覆我體。』",
        "translation": "If it has the power, may it be generous enough to cover my body now.'",
        "source": "T24n1450_004:0118a23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩及天力之威故，其衣即大。",
        "translation": "Because of the authority of the bodhisattvas and the gods, their robes become large.",
        "source": "T24n1450_004:0118a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時復自念云：『我今既被此衣具出家相，當應救濟諸苦惱者。』",
        "translation": "The bodhisattva then again thought to himself, 'Now that I've been clothed in this robe with the characteristics of a renunciant, I should rescue those who are afflicted.'",
        "source": "T24n1450_004:0118a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以先著細妙之衣將與帝釋。",
        "translation": "He then handed the finely detailed robe to Indra with it.",
        "source": "T24n1450_004:0118a26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝得已，將還三十三天恭敬供養。",
        "translation": "After receiving it, Tiṣya returned to the Trāyastriṃśa Heaven to respect and make offerings.",
        "source": "T24n1450_004:0118a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "換衣之所，諸婆羅門居士長者共於此地造一制底，名為受出家衣塔。",
        "translation": "At the place where he exchanged his robes, the householders and elders of the Brāhmaṇa community built a stūpa here, which is called a stūpa for accepting the renunciant's robe.",
        "source": "T24n1450_004:0118a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩既剃頭被袈裟已，於林野中處處遊行，至婆伽婆仙人所，見其仙人以掌支頰思惟而住。",
        "translation": "\"After shaving his head and putting on the reddish-brown robes, the bodhisattva went wandering through the forest and into the wilderness and saw this sage standing with his palms and cheeks in contemplation.",
        "source": "T24n1450_004:0118a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩問曰：『大仙！",
        "translation": "The bodhisattva asked, 'Great man!",
        "source": "T24n1450_004:0118b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故作此思惟？』",
        "translation": "Why do you think like that?'",
        "source": "T24n1450_004:0118b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人報曰：『我之住處有多羅樹，於先之時生金花金菓，忽於今時花菓自落，我於今時思念此事。』",
        "translation": "The sage reported, 'Where I live, there's a palm tree that used to produce gold flowers and gold fruits, but suddenly now the flowers and fruits fall off by themselves, and I'm thinking about that now.'",
        "source": "T24n1450_004:0118b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『此花菓主，懼諸生老病死之所逼切出家修道，所以花菓自落。",
        "translation": "The bodhisattva replied, 'The owner of the flowers and fruits is afraid that birth, old age, illness, and death will force him to leave home and train, so the flowers and fruits fall off by themselves.",
        "source": "T24n1450_004:0118b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若花菓主不出家者，當為園苑。』",
        "translation": "If the flower and fruit owner doesn't leave home, he'll make a garden of them.'",
        "source": "T24n1450_004:0118b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此仙人聞是語已，即便舉目熟視菩薩，見菩薩儀容端正，便自思念告菩薩曰：『出家人者，豈汝是耶？』",
        "translation": "After hearing those words, this sage then lifted his eyes and looked closely at the bodhisattva. Seeing the bodhisattva's proper demeanor, he then thought to himself and said to the bodhisattva, 'Is that you, renunciant?'",
        "source": "T24n1450_004:0118b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『我是。』",
        "translation": "He replied, 'I am.'",
        "source": "T24n1450_004:0118b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時仙人即大驚悅，明目直視觀覩菩薩，便屈今坐，以諸花菓恭敬供養。",
        "translation": "The recluse was then greatly astonished and delighted, looked with clear eyes and saw the bodhisattva directly, bent his seat now, and offered flowers and fruits in respect and offerings.",
        "source": "T24n1450_004:0118b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩坐須臾間，問仙人曰：『今此之地至劫比羅城可有幾里？』",
        "translation": "After a short time of sitting, the bodhisattva asked the sage, 'How many miles is it from this place to Kapilavastu?'",
        "source": "T24n1450_004:0118b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人報曰：『有十二踰膳那。』",
        "translation": "The sage reported, 'There are 12 yojana.'",
        "source": "T24n1450_004:0118b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩念曰：『此處甚近城國，諸釋種子其數不少，恐相煩亂，我當渡弶伽河。』",
        "translation": "The bodhisattva thought, 'This place is very near a city and country, and there are a lot of seeds of the Buddha, so I'm afraid they'll cause trouble; I'll cross the Nāga River.'",
        "source": "T24n1450_004:0118b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已即渡弶伽河，漸次遊行至王舍城。",
        "translation": "After that thought, he crossed the Nāga River and gradually traveled from there to Rājagṛha.",
        "source": "T24n1450_004:0118b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩有善巧之力，具一切智，取迦囉毘囉拘那一十葉，綴作一鉢，威儀寂靜入城乞食。",
        "translation": "\"With skillful means and omniscience, the bodhisattva took one of the ten leaves of the kalaviṅka and wrapped it around a bowl, entering the city calmly and with dignity to solicit alms.",
        "source": "T24n1450_004:0118b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時頻毘娑羅王在樓觀望，遙見菩薩行步端正、被如法僧伽胝衣、捧持一鉢，如法瞻視威儀庠序次第乞食，見是事已私自念言：『我王舍城中諸出家人，未有若此之者。』",
        "translation": "Looking up from his tower, King Bimbisāra saw the bodhisattva walking correctly, wearing his robe of saṃghāṭi according to the teaching, holding a bowl, and looking at it in proper form and order as he begged for food.",
        "source": "T24n1450_004:0118b18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說頌曰：「『我今讚出家，　　如是賢善者；　　思惟生死故，　　彼人要出家。",
        "translation": "He spoke this verse, \"Now, I praise that person as a renunciant, for being such a good person; it's because they contemplate birth and death that they want to leave home.",
        "source": "T24n1450_004:0118b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　在家諸苦逼，　　糞穢來煎迫；　　出家味禪悅，　　智者樂出家。",
        "translation": "At home, they're stifled by suffering and tormented by filth; at home, they taste meditation and delight in leaving home, and wise people enjoy leaving home.",
        "source": "T24n1450_004:0118b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　身心俱出家，　　諸惡皆捨離；　　口業亦清淨，　　正命以自活。",
        "translation": "Leaving home with both body and mind, he parts with all evil; his speech is purified, and he lives a righteous life for himself.",
        "source": "T24n1450_004:0118b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　聖遊摩竭國，　　漸至王舍城；　　攝心在禪念，　　次第行乞食。』",
        "translation": "The sage travels to the country of Maghā and gradually reaches the city of Rājagṛha; he collects his mind in meditation and goes begging for food in order.'",
        "source": "T24n1450_004:0118b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　國主在高樓，　　遙見此聖者；　　即發歡喜心，　　告諸近臣曰：　『汝等當觀彼，　　勝相皆具足；　　形容甚端嚴，　　視地如法行；　　智者不遙視，　　此非賤種生。』",
        "translation": "The lord of the kingdom was up on a high building, and he saw this saint from a distance. He rejoiced and told his ministers, 'You must examine him; his features are perfectly proportioned; his appearance is quite dignified; he looks at the ground and acts according to the teaching; a wise man doesn't look at him from a distance; he's not born from a lowly breed.'",
        "source": "T24n1450_004:0118c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　即令使者觀，　　彼住在何處？",
        "translation": "He then told his messengers to examine them, 'Where does he live?'",
        "source": "T24n1450_004:0118c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　使者奉王命，　　即隨彼人行；　　觀此出家人，　　當於何處住？",
        "translation": "\"The envoy was ordered by the king to follow that person's steps; observing this monk, where will he stay?",
        "source": "T24n1450_004:0118c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　彼次第乞食，　　歷門至六家，　　鉢中食既滿，　　如法捧其鉢。",
        "translation": "They each begged for food in turn, went from gate to gate to six houses, and once their bowls were full of food, they took their bowls according to the teaching.",
        "source": "T24n1450_004:0118c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩薩乞食已，　　默然出城外；　　往彼般茶林，　　清淨自安止。",
        "translation": "After soliciting alms, the bodhisattva quietly left the city and went to that forest of Pañca, where he was pure and at peace.",
        "source": "T24n1450_004:0118c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　使者知處已，　　即遣一人守；　　一報速還城，　　報彼國王曰：　『天王彼苾芻，　　今在般茶山；　　坐如猛虎兒，　　處山如師子。』",
        "translation": "After the envoy knew where he was, he sent one of his men to guard the place; he quickly returned to the city and reported to the king, saying, 'That monk, king of gods, is now on Mount Phāṇḍa, sitting like a fierce tiger cub and handling the mountain like a lion.'",
        "source": "T24n1450_004:0118c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　王聞說是言，　　即登諸寶輅；　　群臣共圍繞，　　速詣彼所居。",
        "translation": "Hearing those words, the king mounted the jeweled chariots, surrounded by ministers, and quickly went to his abode.",
        "source": "T24n1450_004:0118c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　至彼般茶山，　　王從車輅下；　　步行前往詣，　　便即覩菩薩。",
        "translation": "Reaching Mount Phāṇḍa, the king dismounted from the chariot and went on foot to meet the bodhisattva.",
        "source": "T24n1450_004:0118c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　恭敬相問訊，　　王即相對坐；　　見彼寂靜住，　　便作是言曰：　『汝少年苾芻，　　今是盛壯時；　　端嚴多技藝，　　如何自乞食？",
        "translation": "He greeted them respectfully, and the king sat down facing each other. Seeing him standing calmly, he said, 'Young monk, now that you're in the prime of life, how can you beg for food when you're so elegant and skilled?'",
        "source": "T24n1450_004:0118c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝生何族姓？",
        "translation": "What family name were you born into?",
        "source": "T24n1450_004:0118c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我與汝園宅；　　并給諸婇女，　　種種令具足。』",
        "translation": "'I will give you a garden and a mansion, and I will give you various women, making them abundant in various ways.'",
        "source": "T24n1450_004:0118c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　菩薩聞是言，　　以頌而答曰：　『大王有一國，　　住在雪山傍，　　財食甚豐足，　　名曰嬌薩羅。",
        "translation": "When the bodhisattva heard those words, he replied with a verse, 'Great king, there's a country that lives near a snow-capped mountain, has an abundance of food and clothing, and is called Kośala.",
        "source": "T24n1450_004:0118c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　甘蔗曰喬答，　　彼中住釋迦；　　我是剎利種，　　不樂世間欲。",
        "translation": "It's called Gautama, and there lives the Śākyas; I'm a warrior, and I don't enjoy worldly desires.",
        "source": "T24n1450_004:0119a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人御大地，　　山林及海濱；　　具有諸珍寶，　　貪心猶未足。",
        "translation": "Suppose a person rules the earth, mountains, forests, and seashores, possessing all their treasures, but their desire isn't enough.",
        "source": "T24n1450_004:0119a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以薪投猛火，　　貪欲亦如是；　　怖畏嶮途中，　　御者常憂懼。",
        "translation": "Throwing firewood into a raging fire, desire is likewise; fearful of the road, the person controlling it is always terrified.",
        "source": "T24n1450_004:0119a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　諸苦欲為根，　　能覆於善法；　　我昔出家時，　　諸欲皆棄捨。",
        "translation": "Desires that are painful are the root, and they can obstruct good qualities; when I left home, I abandoned all desires.",
        "source": "T24n1450_004:0119a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　譬如大雪山，　　風吹尚能動；　　我心依解脫，　　諸欲不能牽。",
        "translation": "It's like a great snow-capped mountain that's still moved by the wind; my mind depends on liberation, and desires can't hold it.",
        "source": "T24n1450_004:0119a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　世間欲驅馳，　　生死輪常轉；　　國主唯我能，　　解脫諸怖畏。",
        "translation": "Worldly desires drive us, and the wheel of birth-and-death is always turning; I'm the only one in charge of a country who can free us from these fears.",
        "source": "T24n1450_004:0119a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我知欲愆過，　　見涅槃寂靜；　　我今當捨棄，　　往詣清淨樂。』",
        "translation": "I know the faults of desire, and I see the quiescence of nirvāṇa; now I'll abandon it and go to pure bliss.'",
        "source": "T24n1450_004:0119a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時頻毘娑羅王聞是語已，問菩薩曰：『汝出家士，作此苦行欲有何願？』",
        "translation": "\"After hearing these words, King Bimbisāra asked the bodhisattva, 'What do you, a renunciant, desire as you undertake this ascetic practice?'",
        "source": "T24n1450_004:0119a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『願得阿耨多羅三藐三菩提。』",
        "translation": "The bodhisattva replied, 'May I attain supreme perfect enlightenment.'",
        "source": "T24n1450_004:0119a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『汝若得道者應當念我。』",
        "translation": "The king said, 'If you attain the way, you should think of me.'",
        "source": "T24n1450_004:0119a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報曰：『依汝所願。』",
        "translation": "He replied, 'According to your wish.'",
        "source": "T24n1450_004:0119a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此語已，菩薩即往耆闍崛山傍仙人林下。",
        "translation": "After saying these words, the bodhisattva went to the bottom of the forest of sages near Mount Gṛdhrakūṭa.",
        "source": "T24n1450_004:0119a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既到彼已，隨彼仙眾行住坐臥見彼苦行，常翹一足至一更休，菩薩亦翹一足至二更方休。",
        "translation": "After arriving there, he followed that crowd of sages as they walked, sat, and lay down and saw them engaged in ascetic practices, always resting with one foot up until the first watch of the night, and the bodhisattva also rested with one foot up until the second watch of the night.",
        "source": "T24n1450_004:0119a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見彼苦行，五熱炙身至一更休，菩薩亦五熱炙身至二更方休。",
        "translation": "Seeing that ascetic practice, he burns his body with five hots until he stops at the first watch, and the bodhisattva also burns his body with five hots until he stops at the second watch.",
        "source": "T24n1450_004:0119a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是苦行皆倍於彼，仙人見已共相議曰：『此是大持行沙門。』",
        "translation": "Such austerities are all twice as great as theirs, and when the sages see them, they discuss them together, saying, 'This is a great ascetic who maintains his practice.'",
        "source": "T24n1450_004:0119a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶此緣故，名大沙門。",
        "translation": "It's for this reason that they're called great ascetics.",
        "source": "T24n1450_004:0119a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩問諸仙曰：『諸大仙等！",
        "translation": "It was then that the bodhisattva asked the sages, 'Great sages!",
        "source": "T24n1450_004:0119a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是苦行欲有何願？』",
        "translation": "What is the desire for such ascetic practices?'",
        "source": "T24n1450_004:0119a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一仙報曰：『我等願得帝釋天王。』",
        "translation": "One sage answered, 'We vow to become the king of the Indra Heaven.'",
        "source": "T24n1450_004:0119a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更一仙曰：『我等願得大梵天王。』",
        "translation": "Another sage said, 'We vow to become the king of the Brahma gods.'",
        "source": "T24n1450_004:0119a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一仙又曰：『我等願得欲界魔王。』",
        "translation": "Another sage replied, 'We vow to become the king of the desire realm of Māra.'",
        "source": "T24n1450_004:0119a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時聞是語已，便自思念：『此等仙人天上人間輪迴不絕，此是耶道，非清淨道。』",
        "translation": "After hearing those words, the bodhisattva then thought to himself, 'These sages in heaven and humans never stop transmigrating; this is a certain path, not a pure path.'",
        "source": "T24n1450_004:0119a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩既見仙人行垢穢道，即便棄之，詣歌羅羅仙所。",
        "translation": "\"Seeing that the sage was engaged in a defiled path, the bodhisattva abandoned him and went to the sage Kerala.",
        "source": "T24n1450_004:0119b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至彼已，合掌恭敬相對而坐，問彼仙曰：『汝師是誰？",
        "translation": "Once he reached him, he put his palms together, sat down facing each other in respect, and asked the sage, 'Who's your teacher?'",
        "source": "T24n1450_004:0119b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲共學梵行。』",
        "translation": "I want to train in the religious practice together.'",
        "source": "T24n1450_004:0119b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼仙報曰：『仁者喬答摩！",
        "translation": "The sage replied, 'Sir Gautama!",
        "source": "T24n1450_004:0119b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我無尊者，汝欲學者隨意無礙。』",
        "translation": "'I have no honorable man; do as you wish to train others, without obstruction.'",
        "source": "T24n1450_004:0119b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩問曰：『大仙得何法果？』",
        "translation": "The bodhisattva asked, 'What Dharma fruit has the great sage attained?'",
        "source": "T24n1450_004:0119b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人報曰：『仁者喬答摩！",
        "translation": "The sage replied, 'Kind sir, Gautama!",
        "source": "T24n1450_004:0119b06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得無想定。』",
        "translation": "I've attained the concentration of no-thought.'",
        "source": "T24n1450_004:0119b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩聞此私作是念：『羅羅信心，我亦信心。",
        "translation": "When the bodhisattva heard this, he privately thought, 'Rāṣṭrapāla has faith, and so do I.",
        "source": "T24n1450_004:0119b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅羅精進有念有善有智，我亦有之。",
        "translation": "Rāhula's effort, mindfulness, goodness, and wisdom are mine, too.",
        "source": "T24n1450_004:0119b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅羅仙人見得如許多法乃至無想定，如是之法我豈不得？』",
        "translation": "When the sage Rāhula sees and attains so many things up to the concentration without perception, could I not attain such a thing?'",
        "source": "T24n1450_004:0119b09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩默然而去，念彼諸法，未得欲得、未證欲證、未見欲見。",
        "translation": "The bodhisattva then departed in silence, mindful of those things that he wanted to attain before he could attain them, wanted to realize before he realized them, and wanted to see before he saw them.",
        "source": "T24n1450_004:0119b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時獨處閑林，專念此道勤加精進。",
        "translation": "The bodhisattva then went alone in a quiet forest and focused his mind on this path with diligence and effort.",
        "source": "T24n1450_004:0119b12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是事已不久之間，便得證見此法。",
        "translation": "Soon after doing so, he then realized this teaching.",
        "source": "T24n1450_004:0119b13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得此法已，還乃至彼羅羅仙所，白羅羅曰：『今汝此法乃至無想定，豈自得耶？』",
        "translation": "After attaining this dharma, he went back to that sage Rāhula and said to Rāhula, 'Now, did you attain this dharma up to the concentration without ideation by yourself?'",
        "source": "T24n1450_004:0119b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼仙報曰：『如是喬答摩！",
        "translation": "The sage replied, 'So it is, Gautama!",
        "source": "T24n1450_004:0119b15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至無想定我自得之。』",
        "translation": "I've attained it myself, even to the extent that it's the concentration without perception.'",
        "source": "T24n1450_004:0119b16_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩報曰：『仁者，此等智慧乃至無想定，我亦得之。』",
        "translation": "The bodhisattva replied, 'Sir, this kind of wisdom, up to the concentration without perception, has also been attained by me.'",
        "source": "T24n1450_004:0119b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼仙報曰：『喬答摩！",
        "translation": "The sage replied, 'Gautama!",
        "source": "T24n1450_004:0119b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝既得之我亦得之，我既得之汝亦得之。",
        "translation": "'As you have attained it, I've attained it, and as I've attained it, you've attained it.",
        "source": "T24n1450_004:0119b18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我二人，此弟子眾可共教授，此法義理一種得故。』",
        "translation": "Now, the two of us, this multitude of disciples, can teach each other, for this is the reason that one kind of the doctrine of the Dharma is attained.'",
        "source": "T24n1450_004:0119b19_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此羅羅仙即是菩薩第一教授阿遮利耶。",
        "translation": "This Rāṣṭrapāṇi is the bodhisattva's first professor, ācārya.",
        "source": "T24n1450_004:0119b20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼羅羅仙，以菩薩智慧故，歡喜供養親好而住。",
        "translation": "Because of his wisdom, that Rāṣṭrapāla god rejoices and makes offerings to his friends.",
        "source": "T24n1450_004:0119b21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時作如是念：『今此道法者，非智慧非證見，不得阿耨多羅三藐三菩提道，是垢穢道故。』",
        "translation": "The bodhisattva then had this thought, 'Now, this path and teaching are not wisdom or insight, and they won't attain the unsurpassed, correct path of enlightenment; it's therefore a defiled path.'",
        "source": "T24n1450_004:0119b22_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩知已告羅羅曰：『仁者好住，我今辭去。』",
        "translation": "After he knew this, the bodhisattva told Rāhula, 'Sir, you've stayed well, so I'll leave now.'",
        "source": "T24n1450_004:0119b24_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩爾時遊行山林，見水獺端正仙子（舊云欝頭藍者，此誤也），即往親近恭敬問訊，告彼仙曰：『汝師是誰？",
        "translation": "\"The bodhisattva then wandered into the forest and saw the immortal Tuṣita Zhengzang (a mistake in the old saying, Uddaka Rāmaputta), so he went over to him, asked him respectfully, and told him, 'Who's your teacher?'",
        "source": "T24n1450_004:0119b25_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我共修學。』",
        "translation": "We'll train together.'",
        "source": "T24n1450_004:0119b27_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼仙報曰：『我無尊者，汝欲修學隨意無礙。』",
        "translation": "The recluse replied, 'I have no honor, honored one, but if you want to train, do as you like without obstruction.'",
        "source": "T24n1450_004:0119b28_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩問曰：『汝得何道？』",
        "translation": "The bodhisattva asked, 'What path have you attained?'",
        "source": "T24n1450_004:0119b29_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼仙報曰：『仁者喬答摩！",
        "translation": "The sage replied, 'Sir, Gautama!",
        "source": "T24n1450_004:0119b29_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我得乃至非非想定。』",
        "translation": "I've attained a concentration that extends to neither nonconception.'",
        "source": "T24n1450_004:0119c01_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩聞此私作是念：『此水獺仙有信心，我亦有之。",
        "translation": "When the bodhisattva hears this, he thinks, 'This otter sage has faith, and I have it, too.",
        "source": "T24n1450_004:0119c01_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有精進有念有善有智，我亦有之。",
        "translation": "I have effort, mindfulness, goodness, and wisdom, and I have them, too.",
        "source": "T24n1450_004:0119c02_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼得如是法，乃至非非想定，我豈不得？』",
        "translation": "How could I not attain such a thing as this, even to the extent that it's the concentration of neither nonconception?'",
        "source": "T24n1450_004:0119c03_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "默然而去，念彼諸法，未得欲得、未見欲見、未證欲證。",
        "translation": "He goes away in silence, remembering that there are things he wants to attain before he attains them, wants to see before he sees them, and wants to realize them before he realizes them.",
        "source": "T24n1450_004:0119c04_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往閑林專修此道，勤加精進不久之間，乃至證非想非非想定。",
        "translation": "He then goes to a quiet forest to focus on this path, and soon after diligently exerting himself, he'll achieve concentration that's neither perceived nor unperceived.",
        "source": "T24n1450_004:0119c05_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得是定已，還詣水獺仙所，白彼仙曰：『今汝此法豈自得耶？』",
        "translation": "After attaining this concentration, he went back to the sage Otter and said to him, 'Now, did you attain this dharma on your own?'",
        "source": "T24n1450_004:0119c07_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『如是。』",
        "translation": "He replied, 'So it is.'",
        "source": "T24n1450_004:0119c08_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩又曰：『大仙！",
        "translation": "The bodhisattva also said, 'Great man!",
        "source": "T24n1450_004:0119c08_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此智慧乃至非想非非想定，我亦得之。』",
        "translation": "This wisdom ... up to the concentration of neither perception nor non-perception, I've also attained it.'",
        "source": "T24n1450_004:0119c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "水獺報曰：『汝既得之我亦得之，我既得之汝亦得之。",
        "translation": "The otter replied, 'As you have attained it, I've also attained it, and as I've attained it, you've also attained it.",
        "source": "T24n1450_004:0119c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我二人可共同住教授弟子。",
        "translation": "Now, the two of us can live together and teach the disciple.",
        "source": "T24n1450_004:0119c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_004:0119c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得法同故。』",
        "translation": "It's because they've attained the same dharma.'",
        "source": "T24n1450_004:0119c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時作如是念：『如此之道，非智慧非正見，不得阿耨多羅三藐三菩提果，是垢穢道。』",
        "translation": "The bodhisattva then had this thought, 'Such a path is not wisdom, not right view, and doesn't lead to the fruit of unsurpassed, correct enlightenment; it's a defiled path.'",
        "source": "T24n1450_004:0119c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白彼仙曰：『汝今好住，我辭而去。』",
        "translation": "He said to that sage, 'Now, you may well stay here, but I'll leave you.'",
        "source": "T24n1450_004:0119c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是菩薩第二阿遮利耶。",
        "translation": "This is the second anacardium of the bodhisattva.",
        "source": "T24n1450_004:0119c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩爾時遊行山林，時淨飯王憶念菩薩，令使尋訪相望道路，在所山林悉皆知處。",
        "translation": "\"It was then that the bodhisattva traveled through the mountains and forests, and when King Jōtan remembered the bodhisattva, he had him sent out on a search to see which way he looked, and he knew exactly where he was in the mountains and forests.",
        "source": "T24n1450_004:0119c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既聞太子辭彼水獺，無有侍者獨行山林，即差童子三百人往侍太子；天示城王既聞是事，復差二百童子往侍太子。",
        "translation": "When he heard that the prince had left that otter and was traveling alone in the mountains without an attendant, he sent 300 boys to attend the prince; after hearing about this, the king of Tiṣya sent another 200 boys to attend the prince.",
        "source": "T24n1450_004:0119c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是五百童子圍繞菩薩，於諸山林隨意遊觀。",
        "translation": "Thus, the five hundred boys surrounded the bodhisattva and wandered through the mountains and forests as they pleased.",
        "source": "T24n1450_004:0119c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩便作是念：『我今欲於林間靜住，不可令其多人圍繞而求甘露。",
        "translation": "The bodhisattva then had this thought, 'Now, I want to stay quietly in the forest, so I can't have many of them surround me and seek the ambrosia.",
        "source": "T24n1450_004:0119c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我應留侍者五人，餘者放還。』",
        "translation": "Still, I should leave five attendants and let the rest return.'",
        "source": "T24n1450_004:0119c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時菩薩，於母宗親中而留兩人、於父宗親中而留三人，而此五人承事菩薩，餘者各令還國。",
        "translation": "The bodhisattva then left two of his mother's relatives and three of his father's relatives, and these five people served the bodhisattva while the rest were each sent back to their country.",
        "source": "T24n1450_004:0119c23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩與此五人圍繞，往伽耶城南，詣烏留頻螺西那耶尼聚落。",
        "translation": "\"Surrounded by these five people, the bodhisattva then went south of Gayā and visited the village of Uluvilvāsināyanī.",
        "source": "T24n1450_004:0119c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四邊遊行於尼連禪河邊，見一勝地，樹林美茂其水清冷，底有純沙岸平水滿，易可取汲。",
        "translation": "They marched to the four sides of the Nairañjanā River and saw a wonderful place where the trees were beautifully wooded and the water was clear and cold, with a bottom of pure sand on a flat bank that was full of water and easy to draw from.",
        "source": "T24n1450_004:0119c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "青草遍地，岸闊堤高，有雜花樹。",
        "translation": "Green grass was everywhere, the bank was wide and high, and there were various flowering trees.",
        "source": "T24n1450_004:0119c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在於岸上，滋茂殊勝。",
        "translation": "On the shore, they flourish excellently.",
        "source": "T24n1450_004:0120a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩見此殊勝之地，作如是念：『此地樹茂其水清冷、底有純沙、岸平水滿、易可取汲、青草遍地，岸闊堤高有雜花樹。",
        "translation": "When the bodhisattva sees this remarkable place, he thinks, 'This place has lush trees, its water is clear and cold, its bottom is pure sand, its shore is level and full of water, and it's easy to draw water from.",
        "source": "T24n1450_004:0120a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在於岸上，滋茂殊勝。",
        "translation": "On the shore, it's luxuriant and outstanding.",
        "source": "T24n1450_004:0120a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人樂修禪慧者，可居此地。",
        "translation": "If someone is interested in cultivating meditation and wisdom, they can stay here.",
        "source": "T24n1450_004:0120a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今欲於此地念諸寂定，此樹林中斷諸煩惱。』",
        "translation": "Now, I want to be mindful of the tranquil concentrations here, and in this grove of trees, I'll end the afflictions.'",
        "source": "T24n1450_004:0120a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩作是念已，便於樹下端身而坐，以舌拄腭兩齒相合，善調氣息攝住其心，令心摧伏壓捺考責，於諸毛孔皆悉流汗，猶如猛士搦一弱人，拉摺壓捺復惱彼情，其人當即遍體流汗。",
        "translation": "After he had this thought, the bodhisattva sat upright under the tree, put his tongue against his palate and pressed his teeth together, and collected his mind with well-regulated breath, causing it to subdue, suppress, and criticize him, and sweat in all of his pores like a fierce man taking hold of a weak person, pulling, folding, suppressing, and further distressing that person's feelings, who then sweats all over his body.",
        "source": "T24n1450_004:0120a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩伏其身心亦復如是。",
        "translation": "The bodhisattva's subduing his body and mind is likewise.",
        "source": "T24n1450_004:0120a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因此轉加精進，曾不暫捨，得輕安身獲無障礙，調直其心無有疑惑。",
        "translation": "As a result, he turns up his energy, never for a moment relinquishing it, attains a light and peaceful body without obstructions, and straightens his mind without doubt.",
        "source": "T24n1450_004:0120a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是作極苦苦不樂苦，雖受眾苦，其心猶自不能安於正定。",
        "translation": "Thus, the bodhisattva undertakes suffering, pain, and discomfort, and even though he experiences many kinds of suffering, his mind still can't be at right concentration.",
        "source": "T24n1450_004:0120a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩復作是念：『我今不如閉塞諸根不令放逸，使不喘動寂然而住。』",
        "translation": "\"At that point, the bodhisattva again thinks, 'Now, I might as well shut off my faculties and not allow them to wander, so that I don't stir and stand still.'",
        "source": "T24n1450_004:0120a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是先攝其氣不令出入。",
        "translation": "Then, he first collected his energy and didn't allow it to flow in or out.",
        "source": "T24n1450_004:0120a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由氣不出故，氣上衝頂。",
        "translation": "As a result of this non-entrainment, the breath rushes up to the top of the head.",
        "source": "T24n1450_004:0120a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩因遂頂痛，猶如力士以諸鐵嘴斲弱人頂。",
        "translation": "As a result, the bodhisattva's head hurts, like a strong man carving a man's head with an iron spout.",
        "source": "T24n1450_004:0120a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時轉加精進不起退心。",
        "translation": "The bodhisattva then intensified his effort and didn't retreat from it.",
        "source": "T24n1450_004:0120a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是得輕安身，隨順所修其心專定，無有疑惑。",
        "translation": "Thus, he attains a light and peaceful body, follows what he cultivates, and focuses his mind without doubt.",
        "source": "T24n1450_004:0120a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是種種自強考責，忍受極苦苦及不樂苦，於其心中曾不暫捨，而猶不得入於正定。",
        "translation": "After such self-improvement and rebuke, he endures suffering and discomfort, but never for a moment does he abandon them in his mind, yet he still can't enter right concentration.",
        "source": "T24n1450_004:0120a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_004:0120a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由從多生所熏習故。",
        "translation": "It's because of the conditioning that comes from many lifetimes.",
        "source": "T24n1450_004:0120a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復作是念：『我今應當轉加勤固，閉塞諸根令氣內擁入於禪定。』",
        "translation": "The bodhisattva then thinks, 'Now, I should intensify my efforts to shut off my faculties so that my energy will be internally embraced and I'll enter meditative concentration.'",
        "source": "T24n1450_004:0120a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，便閉其氣不令喘息，其氣復從頂下衝於耳根，氣滿無耳，猶如積氣聚[橐-木+棐]袋口。",
        "translation": "After that thought, he then closes his prana and doesn't allow it to breathe, and it rushes down from the top of his head to his ear faculty, filling it with no prana like accumulating prana in the mouth of a [kuṇḍa-wood+narrow] bag.",
        "source": "T24n1450_004:0120a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受如是種種諸苦，乃至不能得入於正定。",
        "translation": "They experience all these kinds of suffering, and they can't even enter right concentration.",
        "source": "T24n1450_004:0120a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_004:0120a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由久遠時所熏習故。",
        "translation": "It's because of what's been perfumed in the distant past.",
        "source": "T24n1450_004:0120a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復作是念：『我當倍加精進，內攝其氣令其脹滿而入禪定。』",
        "translation": "The bodhisattva then thinks, 'I'll redouble my efforts to gather my energy internally, cause it to swell up, and enter meditative concentration.'",
        "source": "T24n1450_004:0120a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閉其口鼻令氣悉斷。",
        "translation": "He closes his mouth and nose so that his breath is completely stopped.",
        "source": "T24n1450_004:0120a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "氣既不出，却下入腹五藏皆滿，其腹便脹如滿[橐-木+棐]袋。",
        "translation": "Once the Qi is gone, it goes down into his belly and fills all five stores, and his belly then swells up like a [full] [bag]-wood+narrow.",
        "source": "T24n1450_004:0120b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復加功用輕安其身，隨順所修其心專定，無有疑惑。",
        "translation": "He then adds effort to lightly pacify his body, follows what's cultivated, and focuses his mind without doubt.",
        "source": "T24n1450_004:0120b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是受種種苦受，其心猶不入於正定，由從多時染熏習故。",
        "translation": "After thus experiencing various painful feelings, the bodhisattva's mind still doesn't enter right concentration because it's been perfumed by defilements for so many times.",
        "source": "T24n1450_004:0120b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復作是念：『我今倍加入脹滿定。』",
        "translation": "The bodhisattva then thinks, 'Now, I'll redouble my concentration and become fully engulfed in it.'",
        "source": "T24n1450_004:0120b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入此定已擁閉其氣，其氣覆上衝頂，其頂結痛，猶如力士以其繩索勒縛繫羸弱人，頭頂悉皆脹滿。",
        "translation": "After entering this concentration, he traps his breath, which coats his head and causes it to become painful, like a strong man tying a rope around a weak man, and the top of his head is swollen to the brim.",
        "source": "T24n1450_004:0120b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩受如是等最極苦已，乃至不能得於正定。",
        "translation": "After suffering this kind of supreme pain, the bodhisattva can't even attain right concentration.",
        "source": "T24n1450_004:0120b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_004:0120b09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由多時熏習故。",
        "translation": "It's because of the many hours of permeation.",
        "source": "T24n1450_004:0120b09_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復作是念：『我今應當倍加功用入脹滿定。』",
        "translation": "The bodhisattva then thinks, 'Now, I should redouble my exertion and enter a concentration that's full of swelling.'",
        "source": "T24n1450_004:0120b09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入其定已其氣滿脹，其腹結痛，如屠牛人以其利刀刺於牛腹。",
        "translation": "After entering that concentration, his energy fills up, and his belly becomes tied up in pain, like a butcher stabbing a cow in the belly with a sharp knife.",
        "source": "T24n1450_004:0120b10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩受如是苦受，乃至不能獲於正定。",
        "translation": "The bodhisattva experiences such painful sensations, and he can't even attain right concentration.",
        "source": "T24n1450_004:0120b12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_004:0120b13_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由多時染熏習故。",
        "translation": "It's because of the permeation of defilements over time.",
        "source": "T24n1450_004:0120b13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復作是念：『我今應當倍加精進入脹滿定。』",
        "translation": "The bodhisattva then thinks, 'Now, I should redouble my effort and enter the concentration of being filled with distention.'",
        "source": "T24n1450_004:0120b13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既入定已閉塞口鼻，其氣脹滿周遍身體，其身盛熱，猶二力士執羸弱人內於猛火。",
        "translation": "Once he enters that concentration, he closes his mouth and nose, and his breath swells up and fills his body, making it intensely hot like when a strong man or a strong man holds a weak man inside a fierce fire.",
        "source": "T24n1450_004:0120b14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是受種種苦受，乃至不得入於正定。",
        "translation": "The bodhisattva thus experiences various painful sensations, up to the point where he can't enter right concentration.",
        "source": "T24n1450_004:0120b16_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復作是念：『我今不如斷諸食飲。』",
        "translation": "The bodhisattva then thinks, 'Now, I might as well stop eating and drinking.'",
        "source": "T24n1450_004:0120b17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時諸天觀見菩薩斷諸食飲，詣菩薩所告曰：『大士！",
        "translation": "\"The gods then observed the bodhisattva cutting off food and drink, went to him, and said, 'Maestro!",
        "source": "T24n1450_004:0120b18_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今嫌人間食，我等願以甘露入菩薩毛孔，汝應受取。』",
        "translation": "Now that you dislike human food, we'd like to offer you the nectar in the bodhisattva's pores, so you should accept it.'",
        "source": "T24n1450_004:0120b19_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩便作是念：『一切諸人已知我斷人間食，今受甘露便成妄語。",
        "translation": "The bodhisattva then thought, 'All people have known that I've cut off human food, so accepting the nectar now would be a false statement.",
        "source": "T24n1450_004:0120b21_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於邪見一切眾生，由妄語邪見故，身亡滅後，墮落惡趣於地獄中生，我今應當不受此事。",
        "translation": "If all sentient beings with wrong views were to fall into a bad destiny and be born in hell after their bodies die and cease because of false speech and wrong views, I should not accept this now.",
        "source": "T24n1450_004:0120b22_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我今應少通人食，或小豆、大豆及牽牛子，煮取其汁日常少喫。』",
        "translation": "Still, now I should eat a little human food, or perhaps boil some lentils, soybeans, or cowries and take their juice and eat them sparingly every day.'",
        "source": "T24n1450_004:0120b24_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已不受天語，遂取小豆、大豆及牽牛子煮汁少喫。",
        "translation": "After thinking this thought and not accepting the god's words, he took the juice of lentils, soybeans, and calves' seeds, boiled it, and ate it sparingly.",
        "source": "T24n1450_004:0120b26_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是菩薩，身體肢節皆悉萎瘦無肉，如八十歲女人肢節枯憔，菩薩羸瘦亦復如是。",
        "translation": "As a result, the bodhisattva's limbs were all withered and devoid of flesh, like the limbs of an 80-year-old woman who is withered, and so was the bodhisattva's emaciated body.",
        "source": "T24n1450_004:0120b27_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩由少食故，頭頂疼枯又復酸腫，如未熟蓏子擿去其蔓見日萎憔，菩薩頭頂亦復如是。",
        "translation": "As a result of that little food, the bodhisattva's head ached and withered, and it was sore and swollen, like when an unripe fruit is picked off its vines and seen to wither with each passing day, and so was the bodhisattva's head.",
        "source": "T24n1450_004:0120b29_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於是轉加精進得輕安身，隨所念修受種種苦受，乃至心不能獲入於正定。",
        "translation": "The bodhisattva then turns his efforts to attain a light and peaceful body, and he experiences various painful feelings according to his mindfulness, even to the point where his mind can't attain right concentration.",
        "source": "T24n1450_004:0120c02_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時以少食故，眼睛却入，猶如被人挑去，如井中見星，菩薩眼睛亦復如是。",
        "translation": "At the time, the bodhisattva's eyes were partially shut off because of a lack of food, as if someone had picked them away, like seeing a star in a well, and so were the bodhisattva's eyes.",
        "source": "T24n1450_004:0120c04_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於是復倍精進受諸苦受，乃至不獲入於正定。",
        "translation": "The bodhisattva then repeatedly exerts himself to experience painful feelings, so much so that he doesn't attain right concentration.",
        "source": "T24n1450_004:0120c06_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_004:0120c07_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由從多時所熏習故。",
        "translation": "It's because it's been perfumed over many lifetimes.",
        "source": "T24n1450_004:0120c07_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以少食故。",
        "translation": "It's because the bodhisattva eats little.",
        "source": "T24n1450_004:0120c07_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩脇皮骨枯虛高下，猶三百年草屋，菩薩兩脇亦復如是。",
        "translation": "The skin and bones on both sides of his chest are withered and empty, high and low, like a 300-year-old straw hut, and so are the bodhisattva's two chests.",
        "source": "T24n1450_004:0120c08_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩爾時轉倍勤念受諸苦受，乃至心不能獲入於正定，由從多時所熏習故。",
        "translation": "The bodhisattva then becomes doubly mindful of the painful feelings that he experiences, even though his mind can't enter right concentration because it's been perfumed over many hours.",
        "source": "T24n1450_004:0120c09_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以少食故。",
        "translation": "It's because the bodhisattva has had little to eat.",
        "source": "T24n1450_004:0120c11_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脊骨羸屈，猶如箜篌欲起則伏、欲坐仰倒、欲端腰立、上下不隨。",
        "translation": "Their spine is weakened and bent, like a harp that wants to rise but falls, wants to sit but falls back, wants to stand upright, and doesn't go up or down.",
        "source": "T24n1450_004:0120c11_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩困頓乃至於是，以手摩身諸毛隨落。",
        "translation": "The bodhisattva is so distressed that he rubs his body with his hands, and the hairs fall out accordingly.",
        "source": "T24n1450_004:0120c13_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復作是念：『今我所行非正智非正見，不能至無上菩提。』",
        "translation": "The bodhisattva then thinks, 'Now, what I'm doing isn't right knowledge or right view, and I can't reach unsurpassed enlightenment.'",
        "source": "T24n1450_004:0120c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事卷第四",
        "translation": "Mūlasarvâstivāda-vinaya-viṃśati-vāda, Volume 4",
        "source": "T24n1450_004:0120c16_0",
        "is_bad_quality": false
    }
]