[
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事",
        "translation": "Mūlasarvâstivāda-vinaya-vijñāna-breaking-saṃgha",
        "source": "T24n1450_016:0180a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷第十六",
        "translation": "Vol. 16",
        "source": "T24n1450_016:0180a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏法師義淨奉　制譯",
        "translation": "Translated by the Tripiṭaka Master Yijing of the Great Tang",
        "source": "T24n1450_016:0180a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「復聽提婆達多往昔之時無有恩報。",
        "translation": "The Buddha said, \"Again, I heard that in the past, Devadatta had no reward for his kindness.",
        "source": "T24n1450_016:0180a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古昔有一王都，人民熾盛安隱豐樂。",
        "translation": "Once upon a time, there was a king whose people flourished and were peaceful and prosperous.",
        "source": "T24n1450_016:0180a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有四子：一名大枝、二名副枝、三名隨枝、四名小枝。",
        "translation": "The king had four sons: one great-branch, two secondary-branch, three followers, and four little-branch.",
        "source": "T24n1450_016:0180a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其四王子年漸長大，皆娶隣國王女以之為妻，共於父所興逆害心。",
        "translation": "As they grew older, each of those four princes took a daughter from a neighboring kingdom as his wife, and they all became disagreeable to their father.",
        "source": "T24n1450_016:0180a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父覺知已擯令出國，各將妻去，行至曠野路糧皆盡，共立惡制，可殺一妻取肉充食，用濟身命得出長途。",
        "translation": "After their fathers realized this, they each ordered their wives to leave the country, and when they traveled into the wilderness and ran out of provisions, they each established a bad rule that they could kill one of their wives to get meat for food, which would help them save their lives and get out on the long road.",
        "source": "T24n1450_016:0180a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時小枝作如是念：『寧可自死，不斷他命。",
        "translation": "Xiao Zhi then had this thought, 'I'd rather die myself than to kill myself.",
        "source": "T24n1450_016:0180a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更無餘計，宜將己妻密走他國。』",
        "translation": "There's no other plan; it's better to secretly take your wife and leave her for another country.'",
        "source": "T24n1450_016:0180a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，將妻逃走。",
        "translation": "After he thought this, he took his wife and ran away.",
        "source": "T24n1450_016:0180b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "飢渴所逼，妻便困乏不能前進，告其夫曰：『聖子！",
        "translation": "When she was overcome by hunger and thirst, she became too weary to go forward and told her husband, 'Noble son!",
        "source": "T24n1450_016:0180b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我命將終無由涉路。』",
        "translation": "There's no way to cross the road when my life is about to end.'",
        "source": "T24n1450_016:0180b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小枝作念：『我於羅剎惡伴存彼軀命，於此而終深可傷惜。』",
        "translation": "Xiao Zhi then thought, 'I've saved my life as a bad companion in Rāṣṭrapāla, and I'll deeply regret that I'll end up here.'",
        "source": "T24n1450_016:0180b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即割髀肉與食，又刺臂血令飲。",
        "translation": "She then cut off the flesh of her thigh and gave it to her to eat, and she pricked the blood from her arm and made it drink.",
        "source": "T24n1450_016:0180b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妻食肉血，漸漸徐行至一山谷，採拾根菓以濟身命。",
        "translation": "After eating the flesh and blood, she gradually made her way to a valley where she gathered roots and fruits to save her life.",
        "source": "T24n1450_016:0180b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於其山間有大河水，時有一人因遭怨賊截其手足，擲著河中作苦惱聲，隨流而去。",
        "translation": "There was a large river flowing through the mountains, and a man's hand and foot were cut off by a resentful thief, thrown into the river with a painful noise, and left with the current.",
        "source": "T24n1450_016:0180b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小枝因出聞苦叫聲，生悲愍心尋聲往覓，遂見一人隨水流下，即入河中背負令出，置河岸上。",
        "translation": "When Xiao Zhi went out and heard the painful screams, he felt compassion and looked for the sound. He then saw a man flowing downstream with the water, so he went into the river, carried him out, and placed him on the riverbank.",
        "source": "T24n1450_016:0180b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見手足俱無，情懷痛切，問言：『善男子！",
        "translation": "Seeing that his hands and feet were both gone, he felt pain and asked, 'Good man!",
        "source": "T24n1450_016:0180b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾因何事遭斯苦楚？』",
        "translation": "What is the cause of your suffering?'",
        "source": "T24n1450_016:0180b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人具以事答。",
        "translation": "That man answered with a detailed explanation of the matter.",
        "source": "T24n1450_016:0180b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小枝報曰：『汝今雖苦勿生憂怖。』",
        "translation": "The younger branch replied, 'Although you're suffering now, don't become sad and frightened.'",
        "source": "T24n1450_016:0180b12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將根菓令食，便語妻曰：『可生慈念看養此人。』",
        "translation": "He took the fruit and made his wife eat it, then said, 'Have compassionate thoughts about nurturing this person.'",
        "source": "T24n1450_016:0180b13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既蒙恩養瘡苦漸差，其婦於彼情生愛著，頻頻就彼共作言談。",
        "translation": "Since she's been so kind and nurtured, her sores and suffering gradually lessen, and the woman becomes fond of him and often talks to him about it.",
        "source": "T24n1450_016:0180b14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩稟性少行欲染，雖時聚會無解婬情。",
        "translation": "Although bodhisattvas are naturally low in defiled desire, they don't understand lustful feelings when they gather together.",
        "source": "T24n1450_016:0180b15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此山中所有根果，由菩薩威力悉皆精妙，婦人食已彌益邪心，至其人所求行非法。",
        "translation": "Still, all the roots and fruits on this mountain are exquisite because of the bodhisattva's authority, and after eating them, the woman will be able to nourish her wrong thoughts and go to her and ask her to do what's not right.",
        "source": "T24n1450_016:0180b16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼便不許，答曰：『我幾命斷幸蒙見濟，共為惡事便是棄恩，汝夫若知定分身首。』",
        "translation": "She then disallows him and replies, 'My life has almost been cut short, but I'm fortunate to have been saved by a vision; to do evil together would be to forsake kindness; if your husband knew that, he would surely partake of your body as his head.'",
        "source": "T24n1450_016:0180b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婦數求及被煩惱逼，遂共交通深生愛著，不欲暫離，於其本夫心無戀樂。",
        "translation": "After repeatedly seeking and being forced by affliction, the woman becomes deeply attached to the fellowship and doesn't want to part with it for a while, but she has no desire for her husband at heart.",
        "source": "T24n1450_016:0180b20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼雖遣去亦不見隨，便作是念：『今此女人於我耽著，私通他婦乃是大怨，我定遭苦。』",
        "translation": "Even though she sent him away, he didn't see her coming, so he thought, 'Now, this woman's preoccupation with me and her illicit sexual intercourse with another woman is a great enemy, and I'm sure to suffer.'",
        "source": "T24n1450_016:0180b21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即共籌議告其婦曰：『夫若知我行非法者，必當斷命，此不須疑。』",
        "translation": "They then jointly discussed the matter and told the woman, 'If my husband knew that I was acting unlawfully, he would surely cut off my life; there's no need to doubt that.'",
        "source": "T24n1450_016:0180b23_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人聞說以之為然，當設餘計。",
        "translation": "A woman who hears this thinks it's true and will try to devise another plan.",
        "source": "T24n1450_016:0180b25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人耶智不學而知，即以衣纏頭枕石而臥。",
        "translation": "She then wrapped a robe around her head, put it on a rock, and lay down.",
        "source": "T24n1450_016:0180b25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小枝採菓還至其傍，見有異狀問言：『賢首！",
        "translation": "She returned to her side, picked fruit, saw something different, and asked, 'Good man!",
        "source": "T24n1450_016:0180b26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何所苦？』",
        "translation": "What is there to suffer?'",
        "source": "T24n1450_016:0180b27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『聖子！",
        "translation": "He replied, 'Noble son!",
        "source": "T24n1450_016:0180b28_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頭甚苦痛。』",
        "translation": "It's very painful for my head.'",
        "source": "T24n1450_016:0180b28_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小枝報曰：『欲何所作？』",
        "translation": "Xiao Zhi replied, 'What do you want to do?'",
        "source": "T24n1450_016:0180b28_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女密懷計生此惡心告其夫曰：『我先頭痛，醫與石栢塗頭即差。』",
        "translation": "The woman secretly planned to have this bad intention and told her husband, 'First, I had a headache; the doctor gave me cedar to rub on my head, and it went away.'",
        "source": "T24n1450_016:0180b29_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小枝報曰：『何處得有？",
        "translation": "The younger branch replied, 'Where can I get it?'",
        "source": "T24n1450_016:0180c01_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我往求覓。』",
        "translation": "I'll go searching for it.'",
        "source": "T24n1450_016:0180c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女曰：『於彼崖下於山澗邊，見有斯藥；既其懸絕，尋索而下我在上持。』",
        "translation": "The woman said, 'At the bottom of that cliff, by the edge of that mountain stream, I saw this medicine; since it was hanging by a thread, I searched for it and descended to carry it up there.'",
        "source": "T24n1450_016:0180c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼是大人，為性質直不懷邪偽，報言：『可爾。』",
        "translation": "She was a great man who was straightforward and didn't harbor falsehoods and replied, 'So it is.'",
        "source": "T24n1450_016:0180c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以索繫腰懸崖而下，欲採其藥，妻遂放索落崖墮水。",
        "translation": "Tying a rope around his waist, he descends from the cliff intending to collect the medicine, and his wife then releases the rope and falls off the cliff into the water.",
        "source": "T24n1450_016:0180c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼有情有長命報合紹王位，落崖不死，隨水漂流至王都所。",
        "translation": "Because that sentient being has the reward of a long life and is united with the king's throne, he doesn't die when he falls off the cliff and floats along with the water to the king's capital.",
        "source": "T24n1450_016:0180c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "屬彼國主無子命終，臣佐國民共為籌議：『王既無子今已命終，我等立誰紹繼其位？』",
        "translation": "When the king's childless life ended, his ministers and subjects all came together to discuss, 'Now that the king's childless life has ended, who should we appoint to succeed him?'",
        "source": "T24n1450_016:0180c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喚諸相師，令覓一人堪為王者。",
        "translation": "They summoned the master of signs to find someone who could be the king.",
        "source": "T24n1450_016:0180c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸相師四方求覓，如有頌曰：「『假令經百劫，　　所作業不亡；　　因緣會遇時，　　果報還自受。』",
        "translation": "The masters then sought them out in all directions, and there was a verse that said, 'Suppose it takes a hundred eons, but the task that's been accomplished doesn't perish; when causes and conditions meet, the result will be felt on its own.'",
        "source": "T24n1450_016:0180c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時小枝由其業熟合受王位，從水而出坐在崖邊。",
        "translation": "\"As a result of this ripening activity, the young branch is united with the king's position and emerges from the water to sit on the edge of the cliff.",
        "source": "T24n1450_016:0180c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然菩薩威德，所住之處光彩異常。",
        "translation": "Nevertheless, the bodhisattva's authority was so great that the place where he was staying had an extraordinary radiance.",
        "source": "T24n1450_016:0180c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸相師因遊至彼，見此大人有王瑞相，咸皆歡喜往告諸臣曰：『我等求得大人，具王瑞相，堪為國主。』",
        "translation": "The masters who had traveled there and seen this great man with the king's portentous appearance rejoiced and went to the ministers and said, 'We've asked for a great man with the king's portentous appearance who could be the king of the country.'",
        "source": "T24n1450_016:0180c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣聞已，即令國人嚴飾城隍，備其大禮，選擇吉日共冊為王。",
        "translation": "After the ministers heard this, they had the city god decorated, prepared the great ceremonies, and chose an auspicious day to be registered as king.",
        "source": "T24n1450_016:0180c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然未有國后，諸臣告令諸國貴族，若有端正好女，各令嚴飾將赴王都，稱王意者納之為后。",
        "translation": "However, there was no queen, so the ministers told the nobles of those countries that if they had a good, decent woman, they should each have her adorned and brought to the king's capital, and that she should be accepted as the queen if she suited the king's desires.",
        "source": "T24n1450_016:0180c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王緣女人遭大苦惱，深生厭離無心顧眄。",
        "translation": "Because of the great suffering and distress that women endure, the king became profoundly disillusioned and didn't want to look after them.",
        "source": "T24n1450_016:0180c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣啟言：『大王當知！",
        "translation": "The ministers then revealed, 'You must know, Your Majesty!",
        "source": "T24n1450_016:0180c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國后若無，斷王繼嗣，諸方美女咸集於茲，欲冊為后及諸婇女。』",
        "translation": "If there's no queen, the king's heir will be cut off, and beautiful women from different directions will gather here to be registered as queens and concubines.'",
        "source": "T24n1450_016:0180c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王亦不許，說女人過患。",
        "translation": "The king also disallowed it, saying that there were faults with women.",
        "source": "T24n1450_016:0180c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "福德有情所在之處，花菓飲食悉皆甘美多有氣力；爾時菩薩落崖已後，於其山中花菓根莖並悉不生，設有生者苦澁無味。",
        "translation": "Where fortunate sentient beings are, flowers, fruits, and food are all sweet and plentiful with energy; after the bodhisattva fell off a cliff, the roots and stems of flowers and fruits in those mountains didn't grow, and if they did grow, they were bitter and tasteless.",
        "source": "T24n1450_016:0180c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼二惡人由諸根菓無氣力故，漸漸羸弱不能存濟。",
        "translation": "Those two evil men were gradually weakened and unable to save themselves because their roots and fruits lacked energy.",
        "source": "T24n1450_016:0180c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼惡女，即便荷負無手足人，從山而出，入諸聚落巡行告乞。",
        "translation": "That evil woman then even carries the man without arms and legs out of the mountain into the villages and begs for alms.",
        "source": "T24n1450_016:0180c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若他見問：『此是何人？』",
        "translation": "If others see her, they'll ask, 'Who is this person?'",
        "source": "T24n1450_016:0180c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：『此是我夫。』",
        "translation": "They replied, 'This is my husband.'",
        "source": "T24n1450_016:0181a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復如是形容，更無他意。",
        "translation": "Even though it's described like this, there's no other meaning.",
        "source": "T24n1450_016:0181a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然而國法，若有女人事夫貞謹，人多敬重皆為供養。",
        "translation": "Nevertheless, according to the rules of the land, if a woman is faithful to her husband, people will respect her and make offerings to him.",
        "source": "T24n1450_016:0181a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此女到處多饒飲食，如是遊歷漸至王都。",
        "translation": "She provides plenty of food and drink wherever she goes and travels around like this, gradually reaching the king's capital.",
        "source": "T24n1450_016:0181a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人聞已皆悉嗟歎，或有心生喜樂山外遙觀。",
        "translation": "When people hear this, they all praise her, and some of them are delighted at heart and look away from the mountains.",
        "source": "T24n1450_016:0181a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中諸人見斯事已，謂其方便共起譏嫌：『王說女人有多過患，豈不見此貞謹婦人，無手足夫肩上擔負，巡門告乞以相濟給。』",
        "translation": "After they saw this, the people of the city said, 'The king says there are many faults with women, but don't you see this noble woman with no arms or legs who carries a burden on her husband's shoulders and goes around the gate begging for help?'",
        "source": "T24n1450_016:0181a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守門人見如上事，具奏王知。",
        "translation": "When the gatekeeper saw this, he reported it to the king.",
        "source": "T24n1450_016:0181a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語勅令喚入，女人入內，王既見已即便微笑，而說頌曰：「『食髀肉充飢，　　飲我血濟渴；　　肩負肉團行，　　何處有貞謹？",
        "translation": "When the king heard this, he ordered her to be summoned, and when she entered, he smiled when he saw her and spoke a verse, saying, 'Where is there chastity when you eat the flesh of your thigh to satisfy your hunger and drink my blood to quench your thirst and when you carry a lump of flesh on your shoulder?'",
        "source": "T24n1450_016:0181a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　惡計求石栢，　　冀我落崖亡；　　肩負肉團行，　　何處有貞謹？』",
        "translation": "He wickedly sought the rock-parchment, hoping that I would fall off a cliff and perish; carrying a lump of flesh on his shoulders, where could he be chaste?'",
        "source": "T24n1450_016:0181a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時此女人聞王斯頌，情懷羞恥即便低頭。",
        "translation": "\"When this woman heard the king's verse, she felt ashamed and bowed her head.",
        "source": "T24n1450_016:0181a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣聞頌不知其緣，白言：『大王！",
        "translation": "The ministers who heard the verse didn't know the reason for it, so they said, 'Great king!",
        "source": "T24n1450_016:0181a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說之頌是何義利？』",
        "translation": "What is the meaning of this verse that's being spoken?'",
        "source": "T24n1450_016:0181a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王為諸臣次第廣說。",
        "translation": "The king explained it in detail for his ministers in order.",
        "source": "T24n1450_016:0181a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中人民嫌此女人，共唱為惡擯令出國。」",
        "translation": "The people of the city disliked the woman, and they all called her evil and ordered her to leave the country.\"",
        "source": "T24n1450_016:0181a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「於意云何？",
        "translation": "The Buddha told the monks, \"What do you think?",
        "source": "T24n1450_016:0181a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往昔時小枝者，豈異人乎？",
        "translation": "Did he used to be a different person, a twig?",
        "source": "T24n1450_016:0181a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今即是。",
        "translation": "\"I am now.",
        "source": "T24n1450_016:0181a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其女人者，今提婆達多是。",
        "translation": "That woman, now Devadatta, is.",
        "source": "T24n1450_016:0181a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但今時無有恩報，過去之世亦復如然。",
        "translation": "Not only is there no reward for kindness now, but there were times in the past when it was likewise.",
        "source": "T24n1450_016:0181a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等苾芻，復當諦聽，提婆達多無恩無報。",
        "translation": "\"Again, you monks, listen closely, for Devadatta is ungrateful and unrewarding.",
        "source": "T24n1450_016:0181a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古昔有一王都，王名自在友，人民熾盛安隱豐樂，正法治化信重賢良，自利利他常懷大悲恒求妙法，於諸黎庶深有戀慕。",
        "translation": "Once upon a time, there was a king whose name was Jñāniputra, whose people were prosperous, peaceful, and abundant, whose laws were right, whose teachings were faithful and virtuous, whose constant compassion was great, and whose search for the wonderful Dharma was always for the benefit of others, and whose fondness was deep among the common people.",
        "source": "T24n1450_016:0181a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於異時妃誕一子，形儀端正殊妙可觀，顏色光晃如真金鋌，頭有傘髻，手臂纖長，額廣平正，雙眉相連，鼻高且直，諸根具足。",
        "translation": "At another time, his wife gave birth to a son whose form and demeanor were exquisitely beautiful, whose complexion was shining like genuine gold and translucent, whose head was covered with an umbrella topknot, whose arms were long and slender, whose forehead was broad and square, whose eyebrows were linked, and whose nose was high and straight and replete with his faculties.",
        "source": "T24n1450_016:0181a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親族立字名自在，蕳付八乳母，年漸長大令遣入學，算計謀策印文祕字無不該練，工巧技藝悉皆通達，所謂象馬車步乘馭善巧工射干戈，無不備悉。",
        "translation": "His relatives had created a family name, Zizai, and he was given eight nursemothers, who gradually grew up and sent him to school, where he was trained in everything from arithmetic and strategy to seals and esoteric letters, and he fully mastered all the arts and crafts, such as elephants, horses, chariots, footwork, harnesses, and skilled archery.",
        "source": "T24n1450_016:0181a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其自在童子，敬信賢良情懷仁讓，自利利人是其本行，常有悲愍普愛黎元，捨去慳貪修行惠施。",
        "translation": "That Āryasiṃha boy respects and believes in good people, harbors kindness, makes it his practice to benefit himself and others, always has compassion for all the people, abandons stinginess and greed, and cultivates generosity.",
        "source": "T24n1450_016:0181b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有財貨無一慳心，舉國知聞悉皆傾慕，四方遠近百踰膳那所有孤貧盡來臻湊，皆令無乏咸起歡心。",
        "translation": "He possesses possessions and goods without a single stingy thought, and when the whole country hears about it, they all adore him, and all the poor and orphaned people in the four directions and near them come to him for a hundred yojanas, making them all happy without lack.",
        "source": "T24n1450_016:0181b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩曾於一時，乘車出遊趣芳園內，其車皆以金銀、琉璃、硨磲、碼碯、天帝青寶共為嚴飾，皆以微妙栴檀而為轅軛，於其車上皆以師子虎豹之皮而為莊嚴，點諸寶珮，見者愛樂，駕以駟馬，其疾如風趣於園所。",
        "translation": "One time, the bodhisattva traveled in a chariot to the fragrant garden, which was adorned with gold, silver, lapis lazuli, coral, agate, and the blue jewels of Indra, poled with a yoke of subtle sandalwood, adorned with the skins of lions and tigers and leopards, and decorated with jewels and trimmings that delighted those who saw them, and drove a carriage with horses and sped like the wind to the garden.",
        "source": "T24n1450_016:0181b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有聰明智慧大婆羅門，來告童子曰：「『應知世間人，　　皆聞汝行施；　　寶車雖愛重，　　應施婆羅門。』",
        "translation": "Then, a wise, intelligent great brāhmaṇa came to the boy and said, 'You should know that people in the world have heard that you're practicing generosity; although you love the precious chariot, you should give it to the brāhmaṇa.'",
        "source": "T24n1450_016:0181b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩聞是語已，即疾下車生歡喜心，便指其車告婆羅門曰：「『我今捨寶車，　　喜施婆羅門；　　願我捨三有，　　趣無上菩提。』",
        "translation": "\"After hearing those words, the bodhisattva quickly got out of the car and became joyous. He pointed to the chariot and told the Brāhmaṇa, \"Now, I've given up my precious chariot and am delighted to give it to the Brāhmaṇa; may I abandon the three existences and go to unsurpassed enlightenment.\"",
        "source": "T24n1450_016:0181b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時婆羅門既得車馬，乘之而去。",
        "translation": "\"Having then obtained the chariot and horse, the Brāhmaṇa rode off.",
        "source": "T24n1450_016:0181b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩又於一時乘大白象，名曰王增長，色白如珂雪及白銀花，七支圓滿眾相具足，皆善安住，猶如帝釋翳羅跋拏，行步庠序人所樂見。",
        "translation": "One time, the bodhisattva also rode a large white elephant named Wangchao, white in color like snow and white silver flowers, with a full complement of seven limbs and a variety of features, and he was well-adjusted like Tishravarṇa, walking in a peaceful and orderly fashion that people liked to see.",
        "source": "T24n1450_016:0181b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與諸眷屬并諸僕從，咸共圍遶，譬如滿月耀於星漢。",
        "translation": "He's surrounded by his retinue and retinues like a full moon shining brightly above the stars.",
        "source": "T24n1450_016:0181b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復屬以三春之際，雜花叢發泉池清澈眾鳥和鳴，菩薩于時欲往芳園暫為遊戲。",
        "translation": "It's also the time of spring, when a grove of flowers blooms and a spring-fed pond is clear, and birds sing in harmony, when the bodhisattva wants to go to the fragrant garden and play for a while.",
        "source": "T24n1450_016:0181b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有他國怨敵告婆羅門，令從菩薩乞大白象。",
        "translation": "An enemy from another country then told the Brāhmaṇa to beg a large white elephant from the bodhisattva.",
        "source": "T24n1450_016:0181b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門即從菩薩舉手而乞，并說頌曰：「『諸有人天眾，　　咸同好施名；　　所乘大白象，　　宜與我將去。』",
        "translation": "The Brāhmaṇa then begged the bodhisattva with his hand raised and spoke a verse, saying, 'All the people and gods share the same reputation for being charitable; the great white elephant that it rides should be taken away from me.'",
        "source": "T24n1450_016:0181b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩聞是語已，即疾疾下象生歡喜心，便指其象告婆羅門曰：「『我今捨白象，　　喜施婆羅門；　　願出三有流，　　速趣菩提岸。』",
        "translation": "\"After hearing those words, the bodhisattva quickly dismounted from the elephant and became joyous. He pointed to the elephant and told the Brāhmaṇa, \"Now, I've given up my white elephant and am delighted to give it to the Brāhmaṇa; may I escape the stream of the three existences and quickly reach the shore of enlightenment.\"",
        "source": "T24n1450_016:0181c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時有諸臣奏父王曰：『自在太子今以增長大象施與他國怨讐婆羅門。』",
        "translation": "\"It was then that some ministers presented to their father, the king, saying, 'Now, the Ācārya Prince has given a large, growing elephant to a grudge against a Brāhmaṇa in another country.'",
        "source": "T24n1450_016:0181c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語生大瞋怒，便勅使者令喚自在太子。",
        "translation": "Hearing this, the king became furious and sent a messenger to summon the Āryasiṃha prince.",
        "source": "T24n1450_016:0181c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至，王便告言：『汝今不應住我國內。』",
        "translation": "When he arrived, the king told him, 'Now, you shouldn't stay in my country.'",
        "source": "T24n1450_016:0181c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子聞是語已便自念言：『父今捨我，我今為求無上菩提利益一切，被智慧鎧捨此大象。』",
        "translation": "After hearing those words, the prince then thought to himself, 'Now that my father has abandoned me, I've abandoned this large elephant while wearing the armor of wisdom in order to pursue unsurpassed enlightenment and benefit all sentient beings.'",
        "source": "T24n1450_016:0181c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作念言：『我今若在家者，必是不能隨情捨施，宜應往山林堅持戒行。",
        "translation": "Again, he thought, 'If I were at home now, I surely wouldn't be able to follow my heart's desire for generosity, so I should go to the mountains and firmly uphold the precepts.",
        "source": "T24n1450_016:0181c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故今可捨其家緣獨居林藪，有往乞者誓不違逆。』",
        "translation": "Now, therefore, I can abandon my family and live alone in the forest, and I vow not to disobey anyone who goes begging.'",
        "source": "T24n1450_016:0181c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時菩薩作是念已，便還本宮具告妃知。",
        "translation": "After he thought this, the bodhisattva returned to his palace and told his consort about it.",
        "source": "T24n1450_016:0181c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妃既聞已，恐離夫故心懷悲苦，即便合掌白菩薩言：『聖子！",
        "translation": "After hearing this, the consort, fearing that she might be separated from her husband, felt compassion and anguish, and then put her palms together and said to the bodhisattva, 'Noble son!",
        "source": "T24n1450_016:0181c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是者，我亦隨去往山林中，我終不能須臾之間暫相捨離，若乖離者我命不存。』",
        "translation": "If that's the case, I'll go with you to the mountains and forests; I'll never be able to part with you for a moment, and if I part with you, my life won't survive.'",
        "source": "T24n1450_016:0181c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便說伽他告菩薩曰：「『虛空無月無光彩，　　大地無苗實不生；　　蓮花池中水流枯，　　婦人無夫亦如是。』",
        "translation": "He then told the bodhisattva, 'The sky has no moon and no luster, the earth has no seedlings that really don't grow, the water in a lotus pond withers, and a woman has no husband, too.'",
        "source": "T24n1450_016:0181c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「菩薩告曰：『世間常法必有離別，汝於王宮生長，足好飲食衣服臥具，以斯養故身肉柔軟；若山林間以草敷地於草而臥，以菓為食，採花菓時步遊荊棘。",
        "translation": "\"The bodhisattva told him, 'The world's constant dharmas must be separated, so grow up in a king's palace with enough good food and drink, clothing and bedding, and because of that nourishment your body is tender and supple; suppose you were to cover the ground with grass in a mountain forest, lay down on the grass, eat fruit, and walk on thorns when you pick flowers and fruit.",
        "source": "T24n1450_016:0181c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常持戒行，自身亦見眾人心常堅固，來者供養，我亦決定隨意捨施，當施之時勿生憂惱。』",
        "translation": "Always observing precepts and practices, I myself see that the hearts of many people are always strong, and I'm determined to freely dispense offerings when they come, so don't become sad when you give them.'",
        "source": "T24n1450_016:0181c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復告妃曰：『汝應可自當善籌量。』",
        "translation": "The bodhisattva then addressed the concubine, 'You yourself should make a good assessment.'",
        "source": "T24n1450_016:0181c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妃答言：『我隨聖子意。』",
        "translation": "The princess replied, 'I'll follow the noble son's wishes.'",
        "source": "T24n1450_016:0181c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩復告曰：『若如是者，心常寄念發誓願言。』",
        "translation": "The bodhisattva again told her, 'If that's the case, always keep your mind focused on the vow you made.'",
        "source": "T24n1450_016:0181c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既立誓已，菩薩詣父王所頂禮白言：『願父恕過，所施大象與他國怨讐婆羅門故。",
        "translation": "Having made that vow, the bodhisattva went to his father and paid homage to him, saying, 'Please forgive me, Father, for giving that elephant to a rival brigade from another country.",
        "source": "T24n1450_016:0181c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是過失，我往山林，願王庫藏常豐不渴。』",
        "translation": "Because of this mistake, I'll go to the mountains and hope that the king's treasury will always be abundant and I won't get thirsty.'",
        "source": "T24n1450_016:0182a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞語已與子離別，心懷悽愴憂悲苦惱，便告子曰：『汝可住此，勿向山林，隨意布施。』",
        "translation": "After hearing this, the king parted with his son and, overcome with sorrow and distress, told him, 'You may stay here, don't go to the mountain grove, and give as you like.'",
        "source": "T24n1450_016:0182a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩頌伽他答父王曰：「『大地諸山林，　　乍可令迴轉；　　我於乞求者，　　施心終不移。』",
        "translation": "The bodhisattva song jātaka answered his father, \"The mountains and forests of the earth can first be turned around, but I'll never change my mind about giving to those who ask for it.\"",
        "source": "T24n1450_016:0182a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩說是頌已辭父而去。",
        "translation": "\"After speaking this verse, the bodhisattva left his father and departed.",
        "source": "T24n1450_016:0182a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時太子妃及男女，并諸侍從數有千人，皆大泣淚共出此城。",
        "translation": "The crown prince, his wife, his men, women, and their attendants, numbering a thousand, all left the city in great tears.",
        "source": "T24n1450_016:0182a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一人聞是大眾泣淚哀號，問言：『今此大眾因何悲泣？』",
        "translation": "When one man heard this crowd weeping and wailing, he asked, 'What's the reason for this crowd's sorrow and lamentation?'",
        "source": "T24n1450_016:0182a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：『汝豈不聞？』",
        "translation": "He answered, 'Have you not heard?'",
        "source": "T24n1450_016:0182a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便以頌報：「『城中有太子，　　自將象寶施；　　王責遠驅擯，　　由是眾悲啼。』",
        "translation": "He then reported with a verse, \"There's a prince in the city who offers his elephant treasure as a gift. The king rebukes him for expelling it far away, and the people then lament.\"",
        "source": "T24n1450_016:0182a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時太子既出城已，告諸侍從：『汝等迴還。",
        "translation": "\"After he left the city, the prince addressed his attendants, 'Return, all of you!",
        "source": "T24n1450_016:0182a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今應知，一切恩愛會當別離，眷屬聚集法不長久，如彼行路同息樹陰，會合片時要當分散。』",
        "translation": "Now, you should know that all lovers will meet and part, and that the gathering of retinues won't last long, like when they walk on the same road and rest in the shade of a tree, and when they meet for a while, they'll scatter.'",
        "source": "T24n1450_016:0182a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即說頌曰：「『一切世間人，　　會合必離別。』",
        "translation": "He then spoke a verse, saying, 'All worldly people who meet will part.'",
        "source": "T24n1450_016:0182a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩說是語已，可行三十里，見一婆羅門，來至菩薩告言：『剎帝利童子！",
        "translation": "\"After the bodhisattva spoke these words, he traveled 30 miles and saw a Brāhmaṇa come to the bodhisattva and tell him, 'Boy Zetri!",
        "source": "T24n1450_016:0182a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞汝名稱遠聞，從三十驛故來，為求四馬車，願施與我四馬車。』",
        "translation": "I've heard that you're called a distant hearer, and you've come from 30 journeys to ask for four carriages, so I hope you'll give me four carriages.'",
        "source": "T24n1450_016:0182a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時太子妃，既見婆羅門來乞，心生輕慢已，麁惡言詞告婆羅門，即說頌曰：「『希奇甚惡性，　　告言婆羅門：　　在於林樹間，　　來乞四馬車。』",
        "translation": "When the crown prince's wife saw the brāhmaṇa coming to ask for alms, she became contemptuous and spoke harshly to the brāhmaṇa, saying, 'That's a strange and very evil thing to say to a brāhmaṇa, 'I'm here among the trees begging for four carriages.'",
        "source": "T24n1450_016:0182a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩告其妃曰：『汝於婆羅門勿出惡言。』",
        "translation": "\"The bodhisattva then addressed his consort, 'Don't say anything harsh to the brāhmaṇa.'",
        "source": "T24n1450_016:0182a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便說頌曰：「『若無求乞人，　　我施誰當受？",
        "translation": "He then spoke a verse, 'If there's no one seeking alms, who will accept my gift?'",
        "source": "T24n1450_016:0182a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為趣菩提故，　　盡施去慳心。",
        "translation": "'In order to attain enlightenment, I give generously and free myself from stinginess.",
        "source": "T24n1450_016:0182a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　六度殊勝福，　　是名菩薩行；　　為證於菩提，　　圓修一切智。』",
        "translation": "These six excellent merits of the perfections are called the bodhisattva's practice, and in order to realize enlightenment, they completely cultivate omniscience.'",
        "source": "T24n1450_016:0182b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩說是頌已，心生歡喜，復說頌曰：「『我今除此慳貪垢，　　寶輅施與婆羅門；　　古昔大仙皆共行，　　並獲無漏菩提處。』",
        "translation": "\"After speaking this verse, the bodhisattva's heart rejoiced and he spoke the verse again, \"Now, I've removed this stain of stinginess and greed, and I've given a Brahmin the precious garland; great men of yore have practiced together, and they've attained the untainted stage of bodhi.\"",
        "source": "T24n1450_016:0182b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩發此願已，心生歡喜，持此寶輅施與婆羅門。",
        "translation": "\"After he made this vow, the bodhisattva rejoiced in his heart and took this jeweled pallet and gave it to the brāhmaṇas.",
        "source": "T24n1450_016:0182b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時菩薩自負其男而於肩上，又妃將女還安肩上，進路而行，積漸至於山林。",
        "translation": "Carrying his man on his shoulders, the bodhisattva then put his woman back on his shoulders and traveled down the road, gradually reaching the mountain grove.",
        "source": "T24n1450_016:0182b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至林已心生少欲，便修戒行依止而住。",
        "translation": "Once he reached the forest, his mind became less desirous, and he cultivated moral discipline while standing at ease.",
        "source": "T24n1450_016:0182b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後於異時有一婆羅門來詣林間，至菩薩所為求男女。",
        "translation": "At another time, a Brāhmaṇa came to the forest and went to the bodhisattva's residence to ask for a man or woman.",
        "source": "T24n1450_016:0182b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時屬曼低採菓不在，時婆羅門舉手讚歎，告菩薩言：『剎帝利童子！",
        "translation": "When he was away, the brāhmaṇa raised his hand in praise and told the bodhisattva, 'Boy Zetri!",
        "source": "T24n1450_016:0182b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願得尊勝。』",
        "translation": "May I be honored.'",
        "source": "T24n1450_016:0182b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便以伽他告菩薩曰：「『我今無侍者，　　與妻諸處求；　　汝之此二子，　　願將惠施我。』",
        "translation": "He then addressed the bodhisattva with a message, \"Now, I have no attendant, and I'm looking for one in various places with my wife; these two sons of yours, may you bestow them on me.\"",
        "source": "T24n1450_016:0182b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩聞是語已，為離愛子便暫思惟，時婆羅門復告菩薩曰：『剎利童子！",
        "translation": "\"After the bodhisattva heard those words, he took a moment to think about ridding himself of his favorite child, when the brāhmaṇa again addressed the bodhisattva, saying, 'Boy Śāriputra!",
        "source": "T24n1450_016:0182b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我曾聞汝能施一切，今我乞求何須思忖？』",
        "translation": "I've heard that you're able to give everything, so why should I think about asking for it now?'",
        "source": "T24n1450_016:0182b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便即以頌告菩薩言：「『汝今名稱遍諸方，　　能以慈悲施一切；　　如昔所聞能惠施，　　仁今應可順修行。』",
        "translation": "He then addressed the bodhisattva with a verse, saying, 'Now, you're known everywhere, and you're able to bestow compassion on all people; just as you were heard to be able to bestow generosity, you should now cultivate it in accordance with kindness.'",
        "source": "T24n1450_016:0182b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩聞是語已，便以伽他告婆羅門曰：「『我今定可捨身命，　　本願不生於異心；　　假令以子施他人，　　於此終無有退轉。』",
        "translation": "\"After hearing these words, the bodhisattva then addressed the Brāhmaṇa through the jhāta, saying, 'Now, I'm certain to lay down my life, hoping not to give rise to different thoughts; even if I were to give my son to others, there would never be any turning back here.'",
        "source": "T24n1450_016:0182b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復告婆羅門曰：「『我今棄二童，　　夫妻住林藪；　　女人性悲戀，　　云何得存住？",
        "translation": "\"Again, he told the Brāhmaṇa, 'Now, I've abandoned my two children, and the couple lives in the forest; how can a woman who's naturally pitying and attached to them stay here?'",
        "source": "T24n1450_016:0182b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　後人莫說我，　　無悲棄自兒；　　不能捨己身，　　而以男將施。』",
        "translation": "Don't tell those who follow you that I was unmerciful and abandoned my own child, and that I couldn't abandon myself and give generosity to men.'",
        "source": "T24n1450_016:0182b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時婆羅門告菩薩言：『剎利童子，不應如是。",
        "translation": "\"It was then that the Brāhmaṇa addressed the bodhisattva, 'Boy Śāriputra, you shouldn't do that.",
        "source": "T24n1450_016:0182c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝於王種而得生長，此界大地皆共知聞，名稱十方隨順一切，於諸含識生大慈悲，種種惠施恭敬供養，猶如香象。",
        "translation": "You've grown a royal seed that's known and heard by everyone in this world, that's known in ten directions, that follows all [of them], that produces great compassion for the contained consciousnesses, and that gives various gifts and venerates and makes offerings like a scented elephant.",
        "source": "T24n1450_016:0182c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸沙門婆羅門師長貧士及孤寡類，皆能攝受而興供養，隨所求願咸稱本心。",
        "translation": "The ascetics, priests, teachers, poor people, or orphans and widows are all able to accept and make offerings, and they all praise their original intentions according to their desires.",
        "source": "T24n1450_016:0182c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見者招携無有空過，所逢惠施福不唐捐。",
        "translation": "There's nothing wrong with inviting those who see it to carry it, and the blessings they receive are not lost.",
        "source": "T24n1450_016:0182c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我既遠來艱辛備盡，有所求乞幸遂希望，心馬難調無由定住，須臾翻覆不可為常，恐退本心不能惠施，令我辛苦失望而歸，仁今應可滿我本願發遣而去。』",
        "translation": "Since I've come so far to exhaust all my hardships and fortune in seeking what I hope for, it's difficult to control the horses in my mind, and there's no way to hold them in place; they change instantly and become impermanent.",
        "source": "T24n1450_016:0182c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即便以頌讚菩薩曰：「『名聞遍十方，　　能施於一切；　　幸願垂哀愍，　　得遂我希望。』",
        "translation": "Even then, he praised the bodhisattva with a verse, saying, 'They're well-known in ten directions, and they're able to give to all of them. Fortunately, I hope you'll have compassion on them and fulfill my wishes.'",
        "source": "T24n1450_016:0182c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩聞是語已，為離愛子心生憂慼，便自念言：『我今若捨二童子與此婆羅門者，我及曼低離愛子故，生大悲苦。",
        "translation": "\"After hearing those words, the bodhisattva became sad and distressed about being free of his beloved son, and then he thought to himself, 'Now, if I were to abandon these two boys and this brāhmaṇa, great compassion and suffering would arise for me and Manchu because we've been freed from our beloved son.",
        "source": "T24n1450_016:0182c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不捨者，於我梵行便大虧違。",
        "translation": "If I don't abandon them, it will be a great violation of my religious practice.",
        "source": "T24n1450_016:0182c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又婆羅門失其本望空語而去，我今定受離別愛子憂悲大苦，於此地處令我憔然，終是不能違本誓願虧我梵行。』",
        "translation": "Since the brāhmaṇa lost his original intention and left looking for emptiness, I'm sure to experience great sorrow and suffering as I part with my beloved son, which will cause me to pine away in this place, but I won't be able to violate my original vow and lose my religious practice.'",
        "source": "T24n1450_016:0182c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心便決定欲捨其男，而發願言說伽他曰：「『我今捨此子，　　願獲大果利；　　以斯殊勝福，　　度苦海眾生。』",
        "translation": "Determined to abandon the boy, he then spoke the vow, saying, 'Now, I will abandon this son and may I attain great rewards; with this extraordinary merit, I will save sentient beings in the ocean of suffering.'",
        "source": "T24n1450_016:0182c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩纔施女男，而此大地六種振動，所居山側諸有仙人，見地振動並皆驚愕，互相謂曰：『以誰福力復何因緣，而此大地忽然振動？",
        "translation": "\"It was then that the bodhisattva gave a young woman and boy, and the earth shook in six ways.",
        "source": "T24n1450_016:0182c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可審觀誰之勢力而有此瑞？』",
        "translation": "Now, may we examine whose power has produced this auspicious sign?'",
        "source": "T24n1450_016:0182c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於仙眾中有一仙人，年最尊邁善閑占相，復解天文，便以伽他告諸仙曰：「『此是菩薩樂山林，　　飡菓飲水資身命；　　可愛童兒今已捨，　　是故大地有斯徵。』",
        "translation": "Among the sages, there was a sage who was the oldest and most venerable, who was good at leisurely divination and also understood astronomy. He then told the sages by way of a kāṭa, 'This is a bodhisattva who enjoys the mountains and forests, where he sips fruit and drinks water to support himself and his life. Now, his lovely children have abandoned them, and this is why the earth has such a sign.'",
        "source": "T24n1450_016:0182c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時二童子知父情捨悲號啼泣，頂禮父足合掌白言：『願父哀憐莫捨於我，我今無父，而趣何依？』",
        "translation": "\"Knowing their father's feelings of abandonment, the two boys wept and cried out with pity, bowed their heads at their father's feet, put their palms together, and said, 'Please have pity on my father.",
        "source": "T24n1450_016:0183a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩聞是語已，心懷悒悵滿目淚流，便以伽他告愛童曰：「『子等汝應知，　　我非不愛愍；　　為濟眾生苦，　　是故捨兒身。",
        "translation": "After hearing these words, the bodhisattva was overcome with sadness and filled with tears, and then he addressed the beloved child with a message, \"You should know, my son, that I'm not unloving and compassionate; I abandoned my child's body to help save sentient beings from suffering.",
        "source": "T24n1450_016:0183a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　以斯殊勝福，　　度苦海眾生；　　令得出迷津，　　同獲菩提果。』",
        "translation": "Because of this extraordinary merit, I'll save sentient beings in the ocean of suffering and cause them to escape the path of delusion and attain the fruit of enlightenment together.'",
        "source": "T24n1450_016:0183a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時二童子聞父語已，知父決定而將捨施，悲號泣淚頂禮合掌哽咽而言，以頌伽他而白父曰：「『父今決定而施我，　　我今遺言囑我孃；　　我曾先有諸愆過，　　願母哀憐見容恕。",
        "translation": "\"After hearing their father's words, the two boys knew that their father was determined to relinquish his charity. They wept with pity, bowed their heads with their palms together, choked up, and said to their father in verse, \"Now, my father is determined to give to me, and I'll leave my words with him.",
        "source": "T24n1450_016:0183a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我由幼小愚癡故，　　不遵奉敬親教言；　　今時不得報慈恩，　　如此之愆願容恕。』",
        "translation": "Because of my youth and folly, I didn't obey or honor the words of my relatives; now I can't repay your kindness, and I hope you'll forgive me for such transgressions.'",
        "source": "T24n1450_016:0183a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時子等既說頌已，頂禮父足右遶三匝雙目盈淚辭父而去。",
        "translation": "\"After they had spoken their verse, the sons bowed their father's feet, circled him three times to his right, and with eyes full of tears, they left him.",
        "source": "T24n1450_016:0183a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時菩薩念彼童男言詞悲切，心懷憂苦發菩提心便入草菴。",
        "translation": "Then, mindful of the boy's compassionate words, the bodhisattva felt sad and distressed and summoned the aspiration for enlightenment, which led him to enter the hut.",
        "source": "T24n1450_016:0183a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是彼二子纔離草菴，此三千世界六種震動，無量百千諸天在於虛空，作如是言曰：『嗚呼奇事！』",
        "translation": "As soon as those two sons left the hut, six things in the 3,000 worlds shook, and measureless hundreds of thousands of gods appeared in the sky and said, 'Whoo! That's amazing!'",
        "source": "T24n1450_016:0183a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異口同音而說頌曰：「『希奇所施大威德，　　菩薩如是決定心；　　身生愛子二童兒，　　捨盡己身心不悔。』",
        "translation": "Speaking with one voice, they spoke the verse, \"This is a rare gift of great authority, for which the bodhisattva is so resolute; he gives birth to two children whom he loves, and he doesn't regret abandoning his own body and mind.\"",
        "source": "T24n1450_016:0183a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時童子母曼低離，既採菓實，獲已欲來於草菴處，見是大地六種震動，心便驚愕速急向菴。",
        "translation": "\"It was then that the boy's mother, Mañjuśrī, had picked fruit and was about to come to the hut after obtaining it when she saw the earth shake in six ways, and she was startled and quickly headed for the hut.",
        "source": "T24n1450_016:0183a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時有一天子，化為母師子欄路而住，見菩薩欲度脫一切眾生今捨二子，恐此曼低離於檀波羅蜜心生留難。",
        "translation": "At the time, there was a celestial who was transformed into a mother lion and stayed on the road. Seeing that the bodhisattva wanted to liberate all sentient beings and had now abandoned his two sons, he was afraid that Mañjuśrī would find it difficult to stay in the fruit of the sandalwood.",
        "source": "T24n1450_016:0183a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼低離既見師子欄路，以頌伽他報母師子曰：「『師子汝是獸王妻，　　何因欄我此道路？",
        "translation": "Seeing that the lion was barring the way, Manzil reported to the mother lion with a verse, \"Master, you're the wife of an animal king, what is the reason you're barring my path?",
        "source": "T24n1450_016:0183a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　我今共汝悉事夫，　　宜速遠離隨緣去。",
        "translation": "'Now, we'll work together as husband, so we should quickly part and go with our conditions.",
        "source": "T24n1450_016:0183b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　汝是獸王師子妻，　　我是人主帝王妃；　　共仁義合為姊妹，　　當須開路容我去。』",
        "translation": "You are the wife of a lion king who's an animal, and I'm the consort of an emperor who's a human lord; we're sisters in good and righteousness together, so you must clear the way for me to go.'",
        "source": "T24n1450_016:0183b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時天化師子聞是語已，避道而去。",
        "translation": "\"After hearing those words, the transformation lion of heaven avoided the road and departed.",
        "source": "T24n1450_016:0183b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時曼低離在路見種種惡怪，所謂在於虛空聞悲哭聲，復聞居在山林諸有情類皆啼泣淚長吁嘆息，須臾之間便作是念：『我見如是等怪，決定於彼草菴有不善事。』",
        "translation": "When he saw the various strange creatures on the road, he heard the sound of lamentation in the sky and also heard the lamentations of sentient beings living in the mountains and forests, weeping and sighing, and in a moment he thought, 'I've seen such monsters, and I'm sure there's something bad going on in that hay-loft.'",
        "source": "T24n1450_016:0183b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而說頌曰：「『我今雙目[目*需]，　　諸鳥共哀鳴；　　令我心哀切，　　與子定生離。",
        "translation": "They then spoke a verse, saying, 'Now, my eyes [eyes*need] are open, and the birds are all wailing together; they make me sad and anxious, and I'm sure to be born apart from my son.",
        "source": "T24n1450_016:0183b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是大地動，　　身心並皆戰；　　遍身今不安，　　定知離別事。』",
        "translation": "Thus, when the earth moves, both body and mind are at war; now, my whole body is uneasy, and I definitely know that I'm separated from him.'",
        "source": "T24n1450_016:0183b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時曼低離說是頌已，思惟千種有損之事，便到草菴。",
        "translation": "\"After speaking this verse, Mañjuśrī contemplated a thousand harmful things and went into the hut.",
        "source": "T24n1450_016:0183b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "進入菴已，遍觀諸處不見二子，心生憂惱便作是念：『我之二童不與小鹿而為遊戲，復於聚土為城而作戲耶？』",
        "translation": "After entering the hut, he looked around and didn't see his two sons, so he became distressed and thought, 'Wouldn't my two boys be playing with the deer, or would they be playing in a city made of clumps of land?'",
        "source": "T24n1450_016:0183b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往尋求，既尋不見，復作是念：『由不見我入菴而睡。』",
        "translation": "He went looking for them, but when he couldn't find them, he also thought, 'Because I wasn't seen, I went into the hut and fell asleep.'",
        "source": "T24n1450_016:0183b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟，心懷恐懼欲求見子，所採花菓便棄一邊，雙目盈淚頂禮夫足，而白問曰：『我二幼童今何所在？』",
        "translation": "Thinking this, he was afraid and wanted to see his son. He put aside the flowers and fruits he had picked, saluted his husband's feet with tears in his eyes, and asked, 'Where are my two young children now?'",
        "source": "T24n1450_016:0183b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時菩薩以頌報曰：「『超越求乞者，　　婆羅門詣此；　　我施彼二童，　　汝可應隨喜。』",
        "translation": "The bodhisattva then replied with a verse, \"Go beyond those who ask for alms and come here as a brāhmaṇa; you may rejoice as I give alms to these two children.\"",
        "source": "T24n1450_016:0183b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時曼低離聞是語已，猶如鹿母被毒箭傷悶絕擗地，復如居水之魚在地婉轉，譬如鶉鳥失子哀切，亦如牛母失犢悲鳴。",
        "translation": "\"After hearing those words, Manzil was like a deer mother who's been wounded by a poisoned arrow and left for dead, or like a fish living in water that's writhing on the ground, like a quail bird that's sad and distressed about losing its son, or a cow mother that's sad and lamenting about losing her calf.",
        "source": "T24n1450_016:0183b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時曼低離作如是傷歎頌曰：「『我之二子面如花，　　手足柔軟如蓮葉；　　同時俱受於斯苦，　　別我孤去獨如何？』",
        "translation": "Manzil then spoke this sad verse, \"My two sons have faces like flowers, and their hands and feet are tender like lotus leaves; they're both suffering at the same time, so what if they were to part with me and go alone?\"",
        "source": "T24n1450_016:0183b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時天帝釋，知菩薩與曼低離夫人俱與決定希有難行之行，與三十三天共相圍遶，從虛空而下，光明照耀，至菩薩所居山林菴所。",
        "translation": "\"At the time, Tendai knew that the bodhisattva and Mrs. Mañjuśrī were engaged in a rare and difficult practice, and they were surrounded by the Trāyastriṃśa gods as they descended from the sky, shining brightly, and reached the mountain retreat where the bodhisattva was staying.",
        "source": "T24n1450_016:0183c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在於空中，以頌伽他告菩薩曰(此下有頌)。",
        "translation": "While he was up in the sky, he addressed the bodhisattva with a verse (there's a verse below this).",
        "source": "T24n1450_016:0183c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時帝釋作是頌已，令菩薩心堅固勇健，而作思惟：『今菩薩唯有曼低離夫人以為侍者，若有從乞決定捨施，便即無人可事菩薩。",
        "translation": "After he had spoken this verse, Tīrṣa made the bodhisattva's mind resolute and courageous, and he thought, 'Now, the bodhisattva has only Mrs. Mañjuśrī to serve him, and if he were to decide to relinquish alms from begging, there would be no one to serve the bodhisattva.",
        "source": "T24n1450_016:0183c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今應從乞取曼低夫人還。』",
        "translation": "Now, I should take Mrs. Mañjuśrī back from the begging place.'",
        "source": "T24n1450_016:0183c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且權寄在菩薩處已，忽然不現。",
        "translation": "After he authorized her to stay at the bodhisattva's place, he suddenly didn't appear.",
        "source": "T24n1450_016:0183c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋，於後不久化作婆羅門身，至菩薩所而說頌曰：「『此婦容儀極姝好，　　唯獨專心事一夫；　　如斯尊貴好夫人，　　幸願施之承事我。』",
        "translation": "Soon afterward, the god Indra transformed into the body of a brāhmaṇa, went to the bodhisattva, and spoke a verse, saying, 'This woman's features are so beautiful that she's devoted to one husband; such a noble and beautiful woman, please give her to serve me.'",
        "source": "T24n1450_016:0183c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時曼低離夫人聞是語已，心生憂惱，嗔彼乞人，作如是言曰：「『汝是無羞貪愛者，　　滿世間中極惡人；　　若是知法識尊儀，　　豈合從夫強乞我？』",
        "translation": "\"When Lady Manzil heard those words, she became sad and angry with that beggar and said, 'You're a shameless, greedy person who fills the world with the worst kind of people; if you knew the teaching and knew respectable manners, wouldn't you have forced yourself to beg for me from a husband?'",
        "source": "T24n1450_016:0183c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是時菩薩心懷悲感迴顧夫人，夫人以偈告曰：「『我今心不愁，　　亦不憂身苦；　　唯憂君獨住，　　如何可存濟？』",
        "translation": "\"The bodhisattva then looked back at the lady with compassion in his heart, and she told him in a verse, 'Now, my heart isn't sad, and I'm not worried about my physical suffering; I'm only worried about you living alone; how can I save you?'",
        "source": "T24n1450_016:0183c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時菩薩以頌答夫人曰：「『我在此處不須憂，　　我求堅固不壞道；　　汝但恭敬隨斯去，　　我如野獸死於林。』",
        "translation": "\"The bodhisattva then answered the lady with a verse, 'I needn't worry about being here, for I seek a path that's resolute and indestructible; just follow this with respect, and I'll be like a wild animal dying in the forest.'",
        "source": "T24n1450_016:0183c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時菩薩說此頌已，心極歡喜重說頌曰：「『我今此山末後施，　　夫人去後我無憂。』",
        "translation": "\"After speaking this verse, the bodhisattva repeated the verse with great joy in his heart, saying, \"Now, I'll give alms at the end of this mountain, and I won't be sad when the lady leaves.\"",
        "source": "T24n1450_016:0183c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「說半頌已，是時菩薩即以一手執曼低離，以一手執持澡罐，向婆羅門而說頌曰：「『此人清淨無雜染，　　言詞辯了巧祗承；　　今我以茲所重妻，　　奉施仁將願守護。』",
        "translation": "\"After speaking half of the verse, the bodhisattva then took Manzil with one hand and held the bathing pot with the other, addressed the Brāhmaṇa, and spoke the verse, saying, 'This person is pure and undefiled, and his words are eloquent and skillful. Now, with this valuable wife, I'll give her kindness and vow to protect her.'",
        "source": "T24n1450_016:0183c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「于時菩薩既施妻已，發如是願：『以此施福願早成佛。』",
        "translation": "\"After bestowing this wife, the bodhisattva then made this vow: 'Because of this merit of giving, I hope to become a buddha sooner rather than later.'",
        "source": "T24n1450_016:0184a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此語時，爾時大地六種震動。",
        "translation": "When he spoke these words, the earth shook in six ways.",
        "source": "T24n1450_016:0184a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門遂領夫人，去斯不遠，時曼低離心懷悲感，而說是語：『我今已別所敬之夫及所鍾愛極好兒女，不審宿因有何罪業？』",
        "translation": "The brāhmaṇa then led his wife not far from there, and Manzil's heart felt compassionate as he said, 'Now that I've parted with my venerable husband and my beloved, wonderful child, what sins have I committed without examining the causes of my past lives?'",
        "source": "T24n1450_016:0184a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此曠野栖遑哀號，如彼母牛失於犢子。",
        "translation": "Here in the wilderness, he perches and wails like a mother cow that's lost her calf.",
        "source": "T24n1450_016:0184a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋見此相已，還復本形向曼低離而說頌曰：「『妙女我非婆羅門，　　亦非是人是帝釋；　　能壞修羅大天王，　　今我深心憐念汝。",
        "translation": "After he saw this, the god Śakra returned to his original form and spoke a verse to Mañjuśrī, saying, \"My good woman, I am not a brāhmaṇa, nor am I a human being or an Śakra; I am the great celestial king who can destroy Shura, and I deeply pity you now.",
        "source": "T24n1450_016:0184a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『汝須何願，我皆與之？』",
        "translation": "\"'What vows do you need, and I will give them to you?'",
        "source": "T24n1450_016:0184a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞此語已心生歡喜，便即重心恭敬禮拜，而說頌曰：「『千眼天主救我子，　　令離賤身得解脫；　　值見父耶常歡樂，　　帝釋天王我願是。』",
        "translation": "Rejoicing when he heard those words, he paid homage with respect and reverence, saying, 'The Thousand-Eyed God saved my son, freed him from his lowly body and made him free; I am always happy when I meet my father, Indra the King of Heaven, I wish it were so.'",
        "source": "T24n1450_016:0184a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「說此語已，爾時帝釋天主與彼妙女迴還至菩薩所，以右手執曼低離手，語菩薩曰：『我將此女寄與聖者，常以供養看侍仁者，有來求者更不須與。",
        "translation": "\"After he spoke these words, the Śakra Devānām-Indra and that wonderful woman returned to the bodhisattva, took his right hand and held it in his mango hand, and said to the bodhisattva, 'I'll entrust this woman to the noble one to always offer support and look after you, sir, and I won't have to give her to anyone who asks for her.",
        "source": "T24n1450_016:0184a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是受寄，若轉與他世人嫌恥。』",
        "translation": "This is a trustworthy offer; if I were to give it to another person, people would be ashamed.'",
        "source": "T24n1450_016:0184a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋即往將兒婆羅門處，令彼荒迷不知所措，慞惶失次，還到本城市中欲賣。",
        "translation": "Thereupon, Indra went to the general Brahman, causing him to become lost and confused, perplexed, and disoriented, and return to his city with the intention of selling her.",
        "source": "T24n1450_016:0184a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣見已便報國主：『有人將王孫子二人，大名悅意、小名黑兒，無慈心憫市中唱賣。』",
        "translation": "When the ministers saw them, they reported to the king, 'Someone has taken the king's grandsons, the elder named Yeyi and the younger named Heier, and sold them in the market without compassionate consideration.'",
        "source": "T24n1450_016:0184a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞語已情甚悲怪，便遣使往：『追彼人來。",
        "translation": "The king was so pitying and surprised when he heard what he said that he sent an envoy, 'Go after that man.",
        "source": "T24n1450_016:0184a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿令兒子入怨家手。』",
        "translation": "Don't let your sons fall into the hands of a rival.'",
        "source": "T24n1450_016:0184a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宮人聞已悲懷憂惱，合城愁歎。",
        "translation": "After hearing this, the palace people were overcome with grief and sorrow, and they closed the city in sorrow.",
        "source": "T24n1450_016:0184a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者速將王所。",
        "translation": "The messengers quickly brought them to the king's residence.",
        "source": "T24n1450_016:0184a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見孫子命令近前，見子身著蔽破衣服、飢瘦羸弱、垢膩塵穢，心即迷悶，遂從師子座上縱身投地，悶絕久蘇。",
        "translation": "When the king saw his grandson ordered to come near, he saw him clad in tattered clothing, hungry, thin, and weak, with dirt and grime, and he became distraught.",
        "source": "T24n1450_016:0184a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城內諸人大臣輔相宮中婇女，一時號哭聲振城郭從座斃地。",
        "translation": "The people of the city, the ministers, the aides, and the palace maids all wailed and shook the city wall, and they fell to the ground from their seats.",
        "source": "T24n1450_016:0184a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣百官并內宮人，一時號哭悲切無已，良久乃蘇，告諸臣曰：『我兒雖在彼山林，行檀施業猶不休，今遣使往速迎還。』",
        "translation": "The ministers, the hundred officials, and the inner palace staff all wailed and lamented endlessly. After a long time, they recovered and told the ministers, 'Even though my son is up there in the mountains and forests, he's still engaged in generosity; now I'm sending an envoy to quickly welcome him back.'",
        "source": "T24n1450_016:0184a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時帝釋天王復至菩薩所，事既了已，便辭菩薩而退。",
        "translation": "Śakra Devānām-Indra then reappeared at the bodhisattva's residence, and after he had finished his business, he left the bodhisattva and withdrew.",
        "source": "T24n1450_016:0184b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不久之後父王亡沒，諸臣共議：『大王今既捨化，我等諸人應迎太子。』",
        "translation": "Not long after that, his father died, and the ministers all agreed, 'Now that the king has left and gone, we should welcome the prince.'",
        "source": "T24n1450_016:0184b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語已，即迎太子冊立為王。",
        "translation": "After these words were spoken, they welcomed the crown prince and installed him as king.",
        "source": "T24n1450_016:0184b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既昇王位，作大施會，內外諸有無所悋惜，廣施一切沙門婆羅門，及諸貧窮乞求。",
        "translation": "Once he had risen to the throne, he created a great almsgiving, which was free of any stinginess from internal and external beings, and gave generously to all the ascetics, priests, and poor people who asked for help.",
        "source": "T24n1450_016:0184b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠道來者并王眷屬親友人等，普皆霑洽，一切施與種種功德，即說頌曰：「『為求菩提故，　　施與歡喜心，　　剎利婆羅門，　　薜舍達羅等，　　旃荼及惡類，　　持戒清淨人，　　金銀寶瓔珞。",
        "translation": "Those from afar, the king's retinue, friends, relatives, and others all came together to share in the king's generosity and various merits, and he spoke a verse, saying, 'For the sake of seeking enlightenment, give joyful gifts, bhadra palm, śeṣadhara, and others, caṇḍavas and evil types, those who observe precepts and are pure, and gold, silver, and jewelry.'",
        "source": "T24n1450_016:0184b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　驅使奴僕者，　　男女妻子等，　　俱以捨施心，　　即得清淨身，　　今世及後世。",
        "translation": "Those who drive slaves and servants, men, women, wives, and so forth, with mindset of generosity, attain a pure body, both in this world and the next.",
        "source": "T24n1450_016:0184b13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如王救孫子，　　婆羅門受寶，　　眷屬共歡喜，　　如是得安隱。",
        "translation": "Like a king's grandson who rescues his grandson, the Brāhmaṇa receives a treasure, and his retinue rejoices together, thus attaining peace.",
        "source": "T24n1450_016:0184b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　皆由彼王孫，　　云我是最上，　　是人之福田，　　合得受供養，　　因此得財寶。』」",
        "translation": "It's all because that king's grandson said that I was the greatest, that I was a field of merit for people, that they were united in making offerings, and that they thus gained wealth and treasure.'\"",
        "source": "T24n1450_016:0184b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「苾芻！",
        "translation": "The Buddha said, \"Monks!",
        "source": "T24n1450_016:0184b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當知：此是何事？",
        "translation": "You should know, \"What is this?",
        "source": "T24n1450_016:0184b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時捨子王者，我身是也。",
        "translation": "\"At the time, that was the Śāriputra king, which was myself.",
        "source": "T24n1450_016:0184b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門者，提婆達多是，此婆羅門作無恩義。",
        "translation": "That brāhmaṇa was Devadatta, and this brāhmaṇa acted ungratefully.",
        "source": "T24n1450_016:0184b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_016:0184b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿當如此得少供養，須作重心，況復多施。",
        "translation": "Don't make such small offerings; you must focus your attention, much less give much.",
        "source": "T24n1450_016:0184b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等苾芻，當如是學。」",
        "translation": "You monks, you must train yourselves in this way.\"",
        "source": "T24n1450_016:0184b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊在王舍城竹林園中，時有瞻波城長者名曰寶德，多饒財寶受用豐足，娶妻未久便即有娠，其夫遂與盛陳供侍，廣說如餘。",
        "translation": "It was then that the Bhagavān was staying in the bamboo grove of Rājagṛha when there was an elder from Campā named Baode, who had plenty of wealth and possessions and was well endowed, and who had married a woman who was pregnant soon afterward.",
        "source": "T24n1450_016:0184b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後時長者往王舍城，月滿之後，於女星月更誕一男，形貌端嚴人所希見，於其足下毛長四指，同黃金色。",
        "translation": "When the moon was full, another man was born in the moon of the goddess, with a beautiful appearance that was rare to see, and his hair under his feet was four fingers long and golden in color.",
        "source": "T24n1450_016:0184b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即令使人疾詣王舍城報長者曰：「生一男也。」",
        "translation": "He had his messengers quickly go to Rājagṛha and tell the elder, \"A boy has been born!\"",
        "source": "T24n1450_016:0184c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者問曰：「說何語？」",
        "translation": "The elder asked, \"What did he say?\"",
        "source": "T24n1450_016:0184c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使人曰：「長者生男。」",
        "translation": "The messenger said, \"The elder will give birth to a boy.\"",
        "source": "T24n1450_016:0184c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是之問皆云：「長者生男。」",
        "translation": "They all asked, \"The elder will give birth to a boy.\"",
        "source": "T24n1450_016:0184c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時使人曰：「何須多問？」",
        "translation": "The messenger then said, \"Why do we need to ask more questions?\"",
        "source": "T24n1450_016:0184c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更不言答。",
        "translation": "He didn't say anything in reply.",
        "source": "T24n1450_016:0184c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者云：「汝今何不百度而說此語？",
        "translation": "The elder said, \"Why don't you say this now for a hundred degrees?",
        "source": "T24n1450_016:0184c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今還與百過滿口黃金，汝三度說與三口金。」",
        "translation": "Now, I'll give you back a hundred times more than a mouthful of gold, and you'll say three times that you'll give me three mouthfuls of gold.\"",
        "source": "T24n1450_016:0184c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令使却迴報守庫人：「與二十俱胝財寶，與男每日食。」",
        "translation": "The messenger then reported back to the treasurer, \"Give me 20 koṭīs of treasure to give to a man to eat every day.\"",
        "source": "T24n1450_016:0184c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者即向王所白大王言：「我生一男。」",
        "translation": "The elder then went to the king and said to the great king, \"I've given birth to a son.\"",
        "source": "T24n1450_016:0184c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王報言：「我以瞻波城并七頭端正寶莊好象，並與汝男。」",
        "translation": "The king then reported, \"I've given you the city of Campā and seven beautiful, jeweled elephants with seven heads, and I'll give them to you as a male.\"",
        "source": "T24n1450_016:0184c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶德長者既啟王已即還本城，經三七日眷屬來會，既是女星月生應與號曰女星。",
        "translation": "After he had revealed this to the king, the jeweled elder returned to his city, and after three or seven days his retinue came together, saying, \"Since she's a woman star and the moon is born, she should be called a woman star.",
        "source": "T24n1450_016:0184c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "付八嬭母：二人與乳、二人常抱、二人洗衣、二人共戲，種種飲食用為養飼，漸漸長大如蓮在水。",
        "translation": "He gave them eight mothers: two to nurse, two to carry, two to wash, and two to play together, and variously nourished them with food and drink, and they gradually grew up like lotuses in water.",
        "source": "T24n1450_016:0184c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其男如是年既長大即令入學，曆數別寶伎能皆悉明達，諸人將女競至求婚。",
        "translation": "When he's old enough, he'll be sent to school, and he'll learn all the skills of calendrical jewels, and people will compete for his daughter's hand in marriage.",
        "source": "T24n1450_016:0184c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其父與男修三種房室園林，謂春夏冬三時，隨用為立三種宮人，所謂上、中、下。",
        "translation": "His father and the boy build three kinds of rooms and gardens, which are called the three seasons of spring, summer, and winter, and they set up three kinds of people in the palace for their own use, which are called the upper, middle, and lower.",
        "source": "T24n1450_016:0184c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人每在上宮遊戲快樂，日用五百兩黃金作食，與男令食。",
        "translation": "Whenever he plays and enjoys himself in the upper palace, he makes a daily meal of 500 taels of gold and gives it to the man to eat.",
        "source": "T24n1450_016:0184c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時提婆達多，惡諫阿闍世王：「汝父頭白變黃，不厭女戲種種食飲。",
        "translation": "It was then that Devadatta badgered King Ajātaśatru, \"Your father's head turned white and yellow, and he didn't tire of women playing with various foods and drinks.",
        "source": "T24n1450_016:0184c19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾今長大，不與爾位得日未期。」",
        "translation": "Now that you've grown up, the day has not yet come when you won't be granted a position.\"",
        "source": "T24n1450_016:0184c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿闍世王問言：「今欲若為？」",
        "translation": "The Ajātaśatru king asked, \"What do you want now?\"",
        "source": "T24n1450_016:0184c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多答言：「須存過人事，凡所求事無種不作，當為如來服酥。」",
        "translation": "Devadatta answered, \"There's nothing more than a person should save and nothing more than a person should seek to do, so he will serve the Tathāgata with ghee.\"",
        "source": "T24n1450_016:0184c22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父王持粥欲往竹林至如來所，阿闍世王在於中道以擲矟刺頻毘娑羅王打破粥鐺，其王却歸。",
        "translation": "When the father was about to take the gruel to the Tathāgata's place in the bamboo grove, King Ajātaśatru thrust a lance at King Bimbisāra in the middle path and broke the gruel, but the king returned.",
        "source": "T24n1450_016:0184c23_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊以他心智皆悉預知，告目連曰：「其提婆達多，勸阿闍世令墮地獄，我於頻毘娑羅索粥欲食，被打鐺破。",
        "translation": "The Bhagavān then, with the knowledge of other minds, foreknew it all and told Maudgalyāyana, \"That Devadatta encouraged the Ajātaśatru to fall into hell, and I asked for some gruel in Vipaśālī to eat, but it was broken by a blow.",
        "source": "T24n1450_016:0184c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝當為我往瞻波城向寶德長者男邊乞粥將來。」",
        "translation": "You must go to Campā for me and ask the elder man Baode for some rice gruel for the future.\"",
        "source": "T24n1450_016:0184c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目揵連端坐入定，從王舍城沒於瞻波城現。",
        "translation": "At the time, Mahāmaudgalyāyana sat calmly and concentrated, and he disappeared from Rājagṛha and appeared in the city of Campā.",
        "source": "T24n1450_016:0184c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其長者男每事日神，平旦事時，其目揵蓮從日裏下。",
        "translation": "Whenever that elder man served the sun god, his Maudgalyāyana descended from the sun at sunrise.",
        "source": "T24n1450_016:0185a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其長者子見大目連，心極驚怪，而說頌曰：「今見日神身，　　從日下吾前；　誰令現其身？",
        "translation": "When the elder son saw Mahāmaudgalyāyana, he was extremely surprised and spoke a verse, \"Now, I've seen the sun god's body descend from the sun in front of me.",
        "source": "T24n1450_016:0185a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　速答是何人？",
        "translation": "Quickly answer who is it?",
        "source": "T24n1450_016:0185a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為當是日耶？",
        "translation": "Why should this be the day?",
        "source": "T24n1450_016:0185a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為是多聞天？",
        "translation": "Why is it the Vaiśravaṇa?",
        "source": "T24n1450_016:0185a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　為當是月下？",
        "translation": "Why should it be under the moon?",
        "source": "T24n1450_016:0185a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　為復帝釋身？」",
        "translation": "In order to restore the body of Śakra?\"",
        "source": "T24n1450_016:0185a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目揵連審觀知彼長者子意，即說言曰：「不是千光日，　　我非多聞天；　亦非帝釋身，　　我是牟尼子。",
        "translation": "It was then that Mahāmaudgalyāyana carefully observed and knew what that elder son wanted, and he said, \"I'm not a thousand suns of light, I'm not a well-versed god, and I'm not Tishra's body; I'm Muni-putra.",
        "source": "T24n1450_016:0185a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　甚極足威光，　　為乞粥來此，　供養於佛身。」",
        "translation": "I'm perfectly resplendent, and I came here to ask for alms and make offerings to the Buddha himself.\"",
        "source": "T24n1450_016:0185a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者子問曰：「何如佛耶？」",
        "translation": "The elder son asked, \"What's like the Buddha?\"",
        "source": "T24n1450_016:0185a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大目揵連以頌答曰：「芥子不可比須彌，　　螢火小虫不比日；　牛跡之水不比海，　　如諸外道不比佛。」",
        "translation": "Mahāmaudgalyāyana replied with a verse, \"A mustard seed can't compare with Sumeru, a tiny worm on a firefly can't compare with the sun, the water from a cow's trail can't compare with the ocean, and non-Buddhas like the non-Buddhas are not comparable.\"",
        "source": "T24n1450_016:0185a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時長者子聞是所說，問：「今來意欲須何事？」",
        "translation": "Then the elder disciple heard what he said and asked, \"What do you want from me now?\"",
        "source": "T24n1450_016:0185a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「為如來乞粥來。」",
        "translation": "He answered, \"I came to beg for gruel for the Tathāgata.\"",
        "source": "T24n1450_016:0185a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「如來者是何族姓？」",
        "translation": "He asked, \"What's the Tathāgata's clan?\"",
        "source": "T24n1450_016:0185a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連答曰：「有沙門喬答摩是族釋子，剃除鬚髮身被法服，心行正真出家修道證得無上正等菩提，此是佛也。」",
        "translation": "Maudgalyāyana answered, \"There's the ascetic Gautama, a member of the Śākyamuni clan, who shaves off his hair and puts on the Dharma robe, conducts himself in a correct and true manner, leaves home, cultivates, and realizes unsurpassed perfect enlightenment, and this is the Buddha.\"",
        "source": "T24n1450_016:0185a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其長者子先未聞佛，當聞佛名心大歡喜，身毛皆竪，所有五百金錢造得食飲，一時受奉置於鉢中。",
        "translation": "That elder son, who had never heard of the Buddha before, rejoiced when he heard his name, and his hair stood on end.",
        "source": "T24n1450_016:0185a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時目連即入於定，從瞻波城沒於王舍城，出至竹林中將奉世尊。",
        "translation": "At that point, Maudgalyāyana immediately fell into meditative concentration, went from Campā to Rājagṛha, and emerged from the bamboo grove to present the gruel to the Bhagavān.",
        "source": "T24n1450_016:0185a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頻毘娑羅更將粥來欲至佛所，聞食香氣普遍，意：「將諸天及天帝釋來供養佛，我所作粥並不堪用。」",
        "translation": "Bimbisāra then brought some more gruel to the Buddha's place, and when he heard the fragrance of the food, he thought, \"The gods and Indra have come to offer their support to the Buddha, but the gruel I've made isn't fit for use.\"",
        "source": "T24n1450_016:0185a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, \"Bhagavān!",
        "source": "T24n1450_016:0185a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有天帝釋及諸天來供養於佛，此竹林中極理香好。」",
        "translation": "There are gods like Indra and the gods who come to make offerings to the Buddha, and this bamboo grove has a wonderful fragrance.\"",
        "source": "T24n1450_016:0185a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「王國界內有大城名曰瞻波，有長者子日用五百金錢造食，目連苾芻往彼乞來，其長者子有是福力。」",
        "translation": "The Buddha said, \"Within the kingdom realm there's a large city named Campā, where there's an elder son who builds his daily bread with 500 coins, and the monk Maudgalyāyana goes there to solicit it, for that elder son has this kind of merit.\"",
        "source": "T24n1450_016:0185a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼王聞已心生歡喜，欲令使喚。",
        "translation": "After hearing this, the king was delighted and wanted to have him summoned.",
        "source": "T24n1450_016:0185b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知王意即語王言：「汝莫輕彼遣使往喚。」",
        "translation": "Knowing what the king wanted, the Buddha said to the king, \"Don't despise that person for sending an envoy to summon them.\"",
        "source": "T24n1450_016:0185b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告大王：「汝可頗能受我鉢中殘食食不？」",
        "translation": "He also told the king, \"Could you accept the leftover food in my bowl?\"",
        "source": "T24n1450_016:0185b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王白言：「我是積貴摩頂授記王種，不合喫人殘食。",
        "translation": "The king said, \"I'm the seed of the Jaśgulimādin-dhāraṇī king who won't accept leftover food from people.",
        "source": "T24n1450_016:0185b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛是我法王，令食即喫。」",
        "translation": "The Buddha is the king of my Dharma, so I eat as I'm told.\"",
        "source": "T24n1450_016:0185b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問王言：「汝曾生來得如此食隨意喫不？」",
        "translation": "The Buddha asked the king, \"Have you ever been born with this kind of food and eaten it as you like?\"",
        "source": "T24n1450_016:0185b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "They replied, \"Bhagavān!",
        "source": "T24n1450_016:0185b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我生王宮，王宮長養，身見為王，未曾食此好美飲食。」",
        "translation": "I was born in the king's palace, grew up in the palace, and saw myself as king, but I've never eaten such a good meal.\"",
        "source": "T24n1450_016:0185b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「大王當知：彼長者子是大福德之人，常喫如斯上味飲食。」",
        "translation": "The Buddha said, \"Great king, you should know that that elder son is a man of great merit who always eats such a delicious meal.\"",
        "source": "T24n1450_016:0185b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時頻毘娑羅王頂禮佛已退歸還宮，即勅群臣：「當令四事具辦兵馬往瞻波城。」",
        "translation": "It was then that King Bimbisāra bowed his head to the Buddha, retired to his palace, and commanded his ministers, \"You must prepare an army of four things to go to Campā.\"",
        "source": "T24n1450_016:0185b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群臣問王：「因何向彼？」",
        "translation": "The ministers asked the king, \"Why are you going there?\"",
        "source": "T24n1450_016:0185b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「我欲往見寶德之子。」",
        "translation": "The king said, \"I want to go see the Boy of Treasures.\"",
        "source": "T24n1450_016:0185b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣等答言：「在王國境何因往看？",
        "translation": "The ministers answered, \"What reason would there be to go and see him in the kingdom's realm?",
        "source": "T24n1450_016:0185b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令使喚取。」",
        "translation": "Have him summoned.\"",
        "source": "T24n1450_016:0185b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「其人是大福德，不可往喚。」",
        "translation": "The king said, \"That person is too blessed to be summoned.\"",
        "source": "T24n1450_016:0185b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣等答王：「我作方便，不用王喚其人自來。」",
        "translation": "The ministers answered the king, \"I'll make it easy for him to come without the king calling for him.\"",
        "source": "T24n1450_016:0185b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：「可爾，任卿等意。」",
        "translation": "The king said, \"That's fine; do as you like.\"",
        "source": "T24n1450_016:0185b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣即作書使人往送：「令掃灑城，大王欲來。」",
        "translation": "The ministers then wrote a letter and sent someone to deliver it, \"Have the city swept, for the king wishes to come.\"",
        "source": "T24n1450_016:0185b16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其長者子聞已歡喜。",
        "translation": "The elder prince rejoiced when he heard that.",
        "source": "T24n1450_016:0185b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣又報：「王子亦來。」",
        "translation": "The minister also reported, \"The prince is coming, too.\"",
        "source": "T24n1450_016:0185b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時長者子聞其王子性行兇麁，恐有費損。",
        "translation": "The eldest son then heard that his prince was fierce in nature and feared harm.",
        "source": "T24n1450_016:0185b18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大臣等更作書報：「王及王子二俱不來，汝等須作計議，擁塞弶伽令水却流，無今一滴順河而過。」",
        "translation": "The ministers then wrote back, \"Neither the king nor the prince will come, so you must plan to embrace the snare and cause the water to drain away, so that not a single drop now will flow down the river.\"",
        "source": "T24n1450_016:0185b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者聞已心極憂懼：「當知王欲科罰我等作此書來。」",
        "translation": "After the elder heard this, he became extremely worried, \"I'm sure the king wants to punish us for writing this.\"",
        "source": "T24n1450_016:0185b21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其瞻波城諸人聚集，共作一書馳報宰相：「王頻附書，勅云：『王來。』",
        "translation": "The people of Campā gathered together to write a document and rushed to the vizier, \"The king frequently attaches documents to his commands, saying, 'The king has come.'",
        "source": "T24n1450_016:0185b22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復言：『子來。』",
        "translation": "Again, he said, 'Here comes the son.'",
        "source": "T24n1450_016:0185b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復令擁塞弶伽却流。」",
        "translation": "Again, he ordered him to give a snare to Gayatri.\"",
        "source": "T24n1450_016:0185b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讀此書已，又得報云：「王及王子俱亦不來，王欲得見寶德之子，汝等速當遣來是要。」",
        "translation": "After reading this, he was also told, \"The king and the prince aren't coming, but the king wants to see the son of Baode, so you must quickly send him here.\"",
        "source": "T24n1450_016:0185b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時瞻波人密遣一人，往王舍城聽察虛實，其人乃知一依書事。",
        "translation": "The people of Campā then secretly sent someone to the king's residence to hear the truth, and that person learned about the Yi Yi writing.",
        "source": "T24n1450_016:0185b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時城邑諸人，同往長者之宅，諮寶德言：「大王欲見汝男，其國臣相實語不虛，我密遣人而往聽察，一如書事，須見長者之子寶德。」",
        "translation": "The people of the city then went to the house of the elder together and asked Bhadraka about it, saying, \"The king wants to see your son, and the minister of that country is telling the truth.",
        "source": "T24n1450_016:0185b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「若令我等塞弶伽河以金擁之，我男終亦不能發遣。」",
        "translation": "They replied, \"If we were to embrace him with gold from the river Sāgar, my son wouldn't be able to leave him.\"",
        "source": "T24n1450_016:0185c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾人重言：「長者是大富貴，亦知以金擁塞弶伽。",
        "translation": "The crowd repeated, \"The elder is very wealthy and powerful, and he knows how to embrace the snare with gold.",
        "source": "T24n1450_016:0185c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等貧人無計可得，要須慈愍我等。」",
        "translation": "There's no way for poor people like us to get it; you must have compassion for us.\"",
        "source": "T24n1450_016:0185c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者答言：「若於城內，家出一子隨我子者，我當放去。」",
        "translation": "The elder replied, \"If a family in the city produces a son to follow my son, I'll let them go.\"",
        "source": "T24n1450_016:0185c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時人眾皆依長者所言。",
        "translation": "The people then all relied on what the elder said.",
        "source": "T24n1450_016:0185c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者即往男所，竊語子言：「城邑人眾同來啟我，影勝大王欲得見汝。」",
        "translation": "The elder then went to the boy's residence and spoke to the son in secret, saying, \"The people of the town have come together to reveal to me that the great king Shadows wants to see you.\"",
        "source": "T24n1450_016:0185c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子白父言：「我當即去。」",
        "translation": "The son said to his father, \"I'll go right away.\"",
        "source": "T24n1450_016:0185c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父言：「必應為汝脚足之下有金色毛欲得相見，汝勿舉脚以視大王。",
        "translation": "The father said, \"It must be because there's a golden hair under your feet that you want to see, so don't lift your feet to look at the king.",
        "source": "T24n1450_016:0185c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將一寶珠往彼王所，置王足上禮拜王已，即跏趺坐，黃金色毛自然而現。」",
        "translation": "Take a precious pearl and go to the king, place it on his feet, venerate him, sit cross-legged, and the golden hairs will naturally appear.\"",
        "source": "T24n1450_016:0185c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時寶德心自思惟：「我今發遣子去，為當令乘象去？",
        "translation": "The jeweled virtuoso then thought to himself, \"Now that I've sent my son away, why would I allow him to ride away on an elephant?",
        "source": "T24n1450_016:0185c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為復乘馬乘車？",
        "translation": "Why does he again ride a horse and chariot?",
        "source": "T24n1450_016:0185c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為遣乘船？」",
        "translation": "Why do you take the boat?\"",
        "source": "T24n1450_016:0185c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更自思惟：「不及乘船安穩。」",
        "translation": "He further thought to himself, \"It's not as stable as riding in a boat.\"",
        "source": "T24n1450_016:0185c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即令造船，船中更造種種園林，有諸好鳥出種種音，及諸婇女莊嚴身已，往王舍城。",
        "translation": "He then ordered the boat to be built, and in the boat he created a variety of groves, various sounds from beautiful birds, and women who adorned their bodies, and then went to the city of Rājagṛha.",
        "source": "T24n1450_016:0185c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事卷第十六",
        "translation": "Mūlasarvâstivāda-vinaya-viṃśati-vāda-vikrīḍitā, vol. 16",
        "source": "T24n1450_016:0185c17_0",
        "is_bad_quality": false
    }
]