[
    {
        "source_sentence": "根本說一切有部毘奈耶雜事",
        "translation": "Mūlasarvâstivāda-vinaya-kṣudraka-vastu",
        "source": "T24n1451_038:0396a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷第三十八",
        "translation": "Vol. 38",
        "source": "T24n1451_038:0396a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "Translation by the Tripiṭaka Master Yijing Feng",
        "source": "T24n1451_038:0396a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第八門第十子攝頌說涅槃之餘",
        "translation": "After the eighth entry, the tenth son contains a verse that speaks of nirvāṇa",
        "source": "T24n1451_038:0396a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時拘尸那城有出家外道名曰善賢(梵云蘇跋陀羅)，年百二十形容衰朽，俱尸那城所有壯士，於善賢處悉生恭敬，尊重供養如阿羅漢。",
        "translation": "At the time, there was a renunciant layman named Shanxian (Sanskrit: Subhadra) in Kuśinagara who was 120 years old and in a decrepit state.",
        "source": "T24n1451_038:0396a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去斯不遠有大華池名曰曼陀枳爾，於池岸上有烏曇跋樹，善賢梵志常遊於此。",
        "translation": "Not far from there is a large, flowery pond named Māṇḍākhyār, and on the bank of that pond is the udumbara tree, where the good sage priests always wander.",
        "source": "T24n1451_038:0396a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔菩薩在覩史天，作白象狀入母胎時，彼烏曇樹華始新出，降誕之始漸有光色，為童子時其華欲發，厭老病死遠託山林，其華稍大狀如鵶嘴，修苦行時現萎萃相，捨苦行已氣息疎通噉諸飲食廣如前說，乃至成等正覺其華開敷。",
        "translation": "When the bodhisattva was once in Tuṣita Heaven and entered his mother's womb in the shape of a white elephant, the udumbara tree's blossoms first emerged newly, and they gradually took on a radiant color when he was born. When he was a child, his blossoms were about to appear, and he became weary of old age, illness, and death and retired to the mountains.",
        "source": "T24n1451_038:0396a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵王來請於婆羅痆斯轉法輪時，其樹及華光色榮盛，妙香芬馥遍諸方界。",
        "translation": "When the king of Brahmā came to ask him to turn the wheel of the Dharma at Vārāṇasī, his tree and flowers were resplendent in color and fragrant with a wonderful odor that permeated the whole world.",
        "source": "T24n1451_038:0396a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然佛大悲普於有緣，所在世界廣濟度已，詣拘尸那為最後臥，而此華樹形色枯萃，見者驚歎。",
        "translation": "Nevertheless, after the Buddha had shown great compassion for all sentient beings and had extensively liberated the world where he was staying, he went to Kauśinagara to lay down for the last time, and the flowering tree was so withered in appearance that those who saw it were astonished.",
        "source": "T24n1451_038:0396a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時善賢觀斯變異而作是念：「拘尸那城必有凶禍。」",
        "translation": "Good Samantabhadra then observed this change and had this thought, \"There's bound to be bad trouble in Kuśinagara.\"",
        "source": "T24n1451_038:0396a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時護國天神發大音聲告諸人曰：「今日如來於中夜時，必入無餘妙涅槃界。」",
        "translation": "The gods protecting the country then raised a loud voice and told the people, \"Today, at midnight, the Tathāgata will surely enter the wonderful state of nirvāṇa without remainder.\"",
        "source": "T24n1451_038:0396a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善賢梵志聞其說已，作如是念：「哀哉！",
        "translation": "After hearing what he said, the good priest had this thought, \"Oh, my!",
        "source": "T24n1451_038:0396a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦哉！",
        "translation": "What suffering!",
        "source": "T24n1451_038:0396a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大沙門喬答摩氏，必於今夜當般涅槃。",
        "translation": "That great ascetic Gautama will surely attain parinirvāṇa this very night.",
        "source": "T24n1451_038:0396a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我每於自所得法有懷疑惑，常自思惟我於何時因何方便得見彼人諮啟未悟？",
        "translation": "Still, whenever I have doubts about the teaching I've attained, I always think to myself, \"When did I first meet that person by what means and how was it that I consulted him for revelation?",
        "source": "T24n1451_038:0396a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惜哉！",
        "translation": "What a pity!",
        "source": "T24n1451_038:0396b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法眼不久將滅。",
        "translation": "\"The Dharma eye will soon cease.",
        "source": "T24n1451_038:0396b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今宜速往親自啟問。",
        "translation": "Now, it's appropriate to quickly go and personally ask about it.",
        "source": "T24n1451_038:0396b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若蒙大悲垂哀為決，於諸猶豫永得開解。」",
        "translation": "If you let great compassionate sympathy be your resolution, your uncertainties will be permanently liberated.\"",
        "source": "T24n1451_038:0396b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已出拘尸那城詣雙林所。",
        "translation": "After he had this thought, he left Kuśinagara and went to the Shuanglin place.",
        "source": "T24n1451_038:0396b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時阿難陀見佛日將沒，在寺門外身心憂慼露地經行。",
        "translation": "Seeing that the Buddha's sun was about to die, Ānanda was walking on the bare ground outside the temple gate, depressed in body and spirit.",
        "source": "T24n1451_038:0396b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善賢見已近而告曰：「汝阿難陀！",
        "translation": "Seeing this, Shanxi approached him and told him, \"You, Ānanda!",
        "source": "T24n1451_038:0396b06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞沙門喬答摩具一切智，於諸眾生平等濟拔，然我每於自所得法有懷猶豫，比常希願聽受未聞竟不果遂。",
        "translation": "I've heard that the ascetic Gautama possesses omniscience and equally rescues sentient beings, but I've always had hesitation about the teaching I've received, wishing more often than not to hear and accept it but not yet realizing it.",
        "source": "T24n1451_038:0396b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今聞天聲遍告我等，如來今夜定入涅槃。",
        "translation": "Now, I've heard the voice of the gods tell us all that the Tathāgata will surely enter nirvāṇa this evening.",
        "source": "T24n1451_038:0396b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德頗能為我諮啟，容我面奉申述疑情。」",
        "translation": "Great virtuous one, will you please consult with me and allow me to explain my doubts to you personally?\"",
        "source": "T24n1451_038:0396b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀言：「善賢！",
        "translation": "Ānanda said, \"Good man!",
        "source": "T24n1451_038:0396b11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今不應作如是語故惱世尊，然我大師今見背痛未能安隱。」",
        "translation": "Now, you shouldn't say such a thing and thus disturb the Bhagavān, even though I, the great teacher, now see that my back hurts and I'm not at peace.\"",
        "source": "T24n1451_038:0396b12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善賢如是再三諮啟，竟不為白。",
        "translation": "Shanxian thus repeatedly consulted him, but he didn't explain it.",
        "source": "T24n1451_038:0396b13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告曰：「阿難陀！",
        "translation": "He also told him, \"Ānanda!",
        "source": "T24n1451_038:0396b14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔曾聞古仙梵志耆年有德軌範人說，諸佛出世如烏曇華，億百萬劫時乃一現。",
        "translation": "I've heard ancient sages, priests, seniors, and men of virtue and guidance say that buddhas appear in the world like the udumbara flower, which appears only once in a billion million eons.",
        "source": "T24n1451_038:0396b14_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來今日定入涅槃，我懷迷惑願見諮問，唯希大德為我諮白，我得見佛誠為幸甚。」",
        "translation": "Today, the Tathāgata is surely entering nirvāṇa, and I'm confused and wish to see him for counsel. I hope you'll consult him for me, for I'm truly fortunate to see the Buddha.\"",
        "source": "T24n1451_038:0396b16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀告言：「善賢！",
        "translation": "Ānanda told him, \"Good man!",
        "source": "T24n1451_038:0396b18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我大師身有乖違，甚不安隱勿故相惱。」",
        "translation": "Now, there's been a discrepancy in my teacher's body, so I'm very uneasy and don't let it bother you.\"",
        "source": "T24n1451_038:0396b18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善賢再三如前苦請，尊者不允其志。",
        "translation": "Shanxian repeatedly and painstakingly asked him to do so, but the venerable didn't grant his wish.",
        "source": "T24n1451_038:0396b19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀與善賢，於寺門外共言論時。",
        "translation": "Ananta and Shanxian were conversing outside the temple gate.",
        "source": "T24n1451_038:0396b20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以清淨耳超越人天，一一聞說，告阿難陀曰：「汝今不應遮彼善賢，任來見我隨其請問。",
        "translation": "With a clear ear, the Buddha transcended humans and gods, heard them all, and told Ānanda, \"Now, you shouldn't cover up for that Good Samaritan; just come to see me and follow his questions.",
        "source": "T24n1451_038:0396b21_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1451_038:0396b23_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此善賢者即是我於最後為外道說法令生正信，親命善來為我弟子。」",
        "translation": "This Good Samaritan is the one whom I last taught to non-Buddhists to give rise to correct faith and whom I had personally appointed to be my disciple.\"",
        "source": "T24n1451_038:0396b23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時善賢聞佛世尊慈悲容許，心生歡喜不勝抃躍，詣世尊所共申種種往復言談，却住一面白言：「喬答摩！",
        "translation": "When that good man heard about the Bhagavān's compassionate acceptance, he was overjoyed and rejoiced, went to the Bhagavān, shared various stories with him, and stayed to one side, saying, \"Gautama!",
        "source": "T24n1451_038:0396b25_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我欲諮問願垂聽許為我解說。」",
        "translation": "I want to ask a question, so I hope you'll listen and allow me to understand it.\"",
        "source": "T24n1451_038:0396b27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告梵志：「隨汝所問。」",
        "translation": "The Buddha told the priest, \"Ask as you wish.\"",
        "source": "T24n1451_038:0396b28_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即問曰：「喬答摩！",
        "translation": "He then asked, \"Gautama!",
        "source": "T24n1451_038:0396b28_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我曾遍觀諸外道類，各別立宗所謂：晡刺拏迦攝波子、末塞羯利瞿梨子、珊逝移毘刺知子、阿市多雞舍甘跋羅子、脚具陀迦多演那子、昵揭爛陀慎若低子，此等諸師各述異宗，未知誰是？」",
        "translation": "I've looked around at the various types of non-Buddhists who have established separate doctrines, calling them Asaṅga-śipa, Mañjuśrī-ghoṣa, Sañjaya-viśeṣa-cinti-brahma, Aśvakarṇa, Kakuda-katyāyana, and Nirgrantha-saṃjñāna, and I don't know which of these masters has stated a different doctrine.\"",
        "source": "T24n1451_038:0396b29_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即命善賢，為說伽他曰：「我年二十九，　　出家求善法；　又五十餘年，　　專行戒定慧。",
        "translation": "It was then that the Bhagavān instructed Good Samantabhadra to explain the teaching to him, \"I was 29 years old when I left home and sought the good Dharma, and I've been practicing precepts, meditation, and wisdom for more than 50 years.",
        "source": "T24n1451_038:0396c04_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一心無散亂，　　唯求於正理；　除斯真法外，　　無別有沙門。」",
        "translation": "With one mind that's not distracted, I've sought only the right principle; beyond this true teaching, there are no other ascetics.\"",
        "source": "T24n1451_038:0396c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說此頌已，復告善賢曰：「此是諸佛善說八聖道支，甚為希有難可值遇，除此已外欲求一、二、三、四沙門道果終無可得。",
        "translation": "After speaking this verse, the Bhagavān again addressed Shanxian, \"These are the eight noble factors of the path that are well explained by the buddhas, which are rare and difficult to encounter, and beyond that it's never possible to pursue the fruit of the path of one, two, three, or four ascetics.",
        "source": "T24n1451_038:0396c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故能於善說法律八聖道支求沙門果，必定當得。",
        "translation": "Therefore, if you pursue the ascetic path as a result of the eight noble factors of the path that are well-explained, you'll surely attain it.",
        "source": "T24n1451_038:0396c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，善賢！",
        "translation": "\"Furthermore, good man!",
        "source": "T24n1451_038:0396c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離八聖法，諸有外道婆羅門等各執己見，或說三世無因無果，所修福善皆空無益。",
        "translation": "Apart from the eight noble principles, there are non-Buddhists and priests who each hold to their own view or say that the three times have no cause and no effect, and that the merits and virtues they cultivate are empty and useless.",
        "source": "T24n1451_038:0396c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我於沙門婆羅門眾中，大師子吼而作是言：『凡有修行皆獲果報。』」",
        "translation": "Therefore, I was among the community of ascetics and priests when the great teacher Dazi Roared and said, 'Every cultivated practice obtains its result.'\"",
        "source": "T24n1451_038:0396c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此法時，善賢梵志遠塵離垢得法眼淨，於諸諦實得不壞信，超越愛河斷諸疑網，自然通達諸微妙法，即從座起整衣合掌，向阿難陀作如是語：「大師尊重事難諮請，我觀大德獲大善利，幸得值遇無上法王，於諸師中灌頂最上，由師力故我亦善證，我今重希於善說法律而為出家求受近圓，成苾芻性修沙門行。」",
        "translation": "When he spoke this teaching, the good priest, who was far removed from the dust and defilement and had attained purification of the Dharma eye, indestructible faith in the truths, transcended the river of desire and cut off the web of doubt, and naturally comprehended the subtleties of the Dharma, rose from his seat, adjusted his robes, put his palms together, and addressed Ānanda, saying, \"Great teacher, I respectfully request you to do this, but I've observed that the great virtuous one has received great good benefits, and I'm fortunate to have met the unsurpassed Dharma king, who bestowed the highest consecration among teachers, and because of the teacher's strength I've also well realized it.",
        "source": "T24n1451_038:0396c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時具壽阿難陀白佛言：「世尊！",
        "translation": "Kauṣṭhila Ānanda then said to the Buddha, \"Bhagavān!",
        "source": "T24n1451_038:0396c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此善賢聞法悟解，心樂出家廣如前說，乃至成苾芻性，唯願世尊哀愍拔濟。」",
        "translation": "Now, this good man has heard the teaching, realized it, happily left home with his heart, and has become a monk, so please have mercy on the Bhagavān and rescue him.\"",
        "source": "T24n1451_038:0396c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即告善賢：「善來苾芻，可修梵行。」",
        "translation": "It was then that the Bhagavān addressed Good Samaritan, \"Well come, monks, you may cultivate the religious practice.\"",
        "source": "T24n1451_038:0396c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於佛言下如常威儀，出家近圓成苾芻性，一心勤勇不為放逸，作如是念：「善男子！",
        "translation": "At the Buddha's words, he conducted himself as usual, left home and approached the completion of his rudimentary nature, single-mindedly strove and didn't become careless, and had this thought, \"Good man!",
        "source": "T24n1451_038:0396c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故剃除鬢髮而披法服正信出家，於無上道而修梵行？",
        "translation": "Why did you shave off your hair and shave your head, put on the Dharma robe, become a true believer, and leave home, and cultivate the religious practice on the unsurpassed path?",
        "source": "T24n1451_038:0397a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現法中得自證悟：我生已盡、梵行已立、所作已辦、不受後有。」",
        "translation": "In the present life, he has realized for himself, 'My births have been ended, the religious practice has been established, the task has been accomplished, and I won't be subject to a later existence.'",
        "source": "T24n1451_038:0397a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時善賢起徹到心，即便速證阿羅漢果，得心解脫復作是念：「我今不忍見佛般涅槃，宜可先去。」",
        "translation": "It was then that Shanxian arose with a penetrating mind, realized the fruit of the arhat quickly, and attained mental liberation. He then thought, \"Now, I can't bear to see the Buddha in parinirvāṇa; I should probably go first.\"",
        "source": "T24n1451_038:0397a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已詣世尊所，頂禮雙足退坐一面，白佛言：「大德世尊！",
        "translation": "After this thought, he went to the Bhagavān, bowed his head at his feet, withdrew to sit at one side, and said to the Buddha, \"Bhagavān!",
        "source": "T24n1451_038:0397a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我願先入涅槃。」",
        "translation": "I want to enter nirvāṇa first.\"",
        "source": "T24n1451_038:0397a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告善賢：「汝於今者入涅槃耶？」",
        "translation": "The Buddha addressed Shanxian, \"Are you entering nirvāṇa now?\"",
        "source": "T24n1451_038:0397a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「如是。」",
        "translation": "He replied, \"So it is.\"",
        "source": "T24n1451_038:0397a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "再三顧問，佛言：「一切諸行皆悉無常，汝於所作自可知時，我更何言？」",
        "translation": "After three more consultations, the Buddha said, \"All conditioned things are impermanent; when you can know what you're doing, what else can I say?\"",
        "source": "T24n1451_038:0397a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善賢將欲入滅而作是念：「我今應為五種加持方可滅度：諸來觀者皆見我身，剃除鬢髮著僧伽胝，莫令彼見外道儀式。",
        "translation": "As he was about to enter into extinction, Good Samaritan thought, \"Now, I should apply five kinds of blessings before I can be liberated: All those who come to see me shave their hair and put it on a cornelian, and don't let them see the rituals of non-Buddhists.",
        "source": "T24n1451_038:0397a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸外道來舁我時勿令身舉，同梵行者方能舁去。",
        "translation": "When non-Buddhists come to carry me, don't let them lift my body; only those who are practicing the same celibacy can carry me away.",
        "source": "T24n1451_038:0397a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又入浴池洗我身時，令諸外道不得其底，同梵行者能洗我身。",
        "translation": "When I enter the bath, I make it impossible for those non-Buddhists to reach my bottom, but those who practice the same celibacy can wash my body.",
        "source": "T24n1451_038:0397a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸外道入水之時，當令魚鼈擾亂不安，同梵行者即無惱害。",
        "translation": "When non-Buddhists enter the water, they'll cause the fish and turtle to be disturbed, but those who practice the same Brahma will not be troubled.",
        "source": "T24n1451_038:0397a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸外道不能燒我遺身，同梵行者方令火著。」",
        "translation": "Also, those non-Buddhists can't burn my remains, but someone who practices with the Brahma can cause fire to burn them.\"",
        "source": "T24n1451_038:0397a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作此五種加持念已便入涅槃。",
        "translation": "After he performed these five kinds of invocations, he then entered nirvāṇa.",
        "source": "T24n1451_038:0397a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸外道聞善賢梵志已入涅槃，將諸音樂幢旛傘蓋，詣拘尸那城，於四衢道告諸人曰：「汝等當知！",
        "translation": "When those heretics heard that the good priest had entered nirvāṇa, they gathered a banner, a pennant, and an umbrella of musical instruments, went to the city of Kuśinagara, and addressed the people in the four thoroughfares, saying, \"You must know!",
        "source": "T24n1451_038:0397a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼大沙門喬答摩常作此語：『唯我法中有八支聖道四沙門果，外道中無，廣說如前，乃至作師子吼。』",
        "translation": "That great ascetic Gautama always says this, 'Only in my teaching are there eight components of the noble path and four ascetic realizations that don't exist among non-Buddhists, as explained in detail earlier, up to the point of making a lion's roar.'",
        "source": "T24n1451_038:0397a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然我法中同梵行者大師善賢亦得涅槃，與彼何異？」",
        "translation": "But what difference does it make if the great teacher Sunil, who's a fellow practitioner of Brahma in my teaching, also attains nirvāṇa?\"",
        "source": "T24n1451_038:0397a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻曰：「汝等若言是我徒侶，任自持去。」",
        "translation": "The monks said, \"If you say you're my disciples, let's carry them away.\"",
        "source": "T24n1451_038:0397a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而諸外道多人共舉竟不能動況能持去。",
        "translation": "But many of those non-Buddhists lifting them together couldn't move them, so why would they be able to carry them away?",
        "source": "T24n1451_038:0397a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻告曰：「汝等不能，我等自舉。」",
        "translation": "The monks told the monks, \"If you can't, we'll lift it ourselves.\"",
        "source": "T24n1451_038:0397a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「可爾。」",
        "translation": "They replied, \"That's OK.\"",
        "source": "T24n1451_038:0397a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻即共舉去，外道默然。",
        "translation": "The monks then collectively lifted it and departed, and the non-Buddhists remained silent.",
        "source": "T24n1451_038:0397a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸外道來至浴池，諸苾芻曰：「今可為汝同梵行者洗浴其身。」",
        "translation": "When the non-Buddhists came to the bathing hole, the monks said, \"Now, I can give you fellow religious practitioners a bath.\"",
        "source": "T24n1451_038:0397a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼入水時不得其底，又被魚鼈之所擾惱，苾芻不爾。",
        "translation": "When they enter the water, they don't reach the bottom and are disturbed by the fish and turtle, but the monks don't.",
        "source": "T24n1451_038:0397b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻報曰：「此若是汝同梵行者，宜自焚燒。」",
        "translation": "The monk retaliated, saying, \"If this is your fellow religious practitioner, you should burn yourself.\"",
        "source": "T24n1451_038:0397b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而諸外道以火焚燒竟不能著，苾芻然火遂便炎熾。",
        "translation": "When the fires of those non-Buddhists burn them, they don't reach them, and the fires of the monk's body are then inflamed.",
        "source": "T24n1451_038:0397b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人眾共嗤外道，彼各懷慚低頭而去。",
        "translation": "The crowd then ridicules the heretics, and they each bow their heads in shame and depart.",
        "source": "T24n1451_038:0397b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘尸那城諸壯士等，見此希奇於世尊處，倍生敬仰發淨信心，各懷戀慕作如是語：「大悲世尊為最後臥，現身有疾支節不安，尚能為彼善賢說法，令速證得阿羅漢果，復令拘尸那城諸壯士等皆獲善利。」",
        "translation": "When the stalwart monks of Kuśinagara saw this marvelous place of the Bhagavān, they revered it and had pure faith, each yearning for it, and they each said, \"The Bhagavān, who's compassionately the Bhagavān's last bed, is ill and troubled in his body, yet he's still able to preach to those good men, cause them to quickly realize the fruit of the arhat, and bring good benefits to the stalwart monks of Kuśinagara.\"",
        "source": "T24n1451_038:0397b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻咸皆有疑，請世尊曰：「如來今時現身有疾支節不安，尚能令彼善賢梵志出生死海證阿羅漢，究竟涅槃盡諸苦際。」",
        "translation": "The monks then all had doubts and asked the Bhagavān, \"Now, the Tathāgata is physically ill and has trouble limbs, but he's still able to cause that good priest to be born into the ocean of death and realize arhatship, which is the ultimate state of nirvāṇa and the end of suffering.\"",
        "source": "T24n1451_038:0397b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告苾芻：「汝等當知！",
        "translation": "The Buddha told the monks, \"You should know!",
        "source": "T24n1451_038:0397b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此未希有，我今已斷根本三毒，解脫生老病死愁憂苦惱，具一切智，於諸境界得大自在，令彼善賢出生死海，得最後邊住涅槃處不足為難。",
        "translation": "It's not rare, but now that I've ended the fundamental three poisons, liberated myself from the grief, sorrow, pain, and vexation of birth, old age, illness, and death, and have full comprehension of all things, I've attained great freedom in all realms, making it possible for those good men to be born into the ocean of death and attain the final abode of nirvāṇa is not difficult.",
        "source": "T24n1451_038:0397b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於往昔在生死中，具貪、瞋、癡，未斷生老病死憂悲苦惱，無有智慧能善思量，在傍生內尚能為彼善賢梵志，及拘尸那城諸壯士等自捨身命。",
        "translation": "I was in birth-and-death in the past, full of greed, anger, and delusion, not yet free of the grief and suffering of birth, old age, illness, and death, and lacking the wisdom to consider it well, but I was still able to sacrifice my own life for those good priests and stalwart men from Kuśinagara while I was still in the next life.",
        "source": "T24n1451_038:0397b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為汝說，宜應諦聽！",
        "translation": "Listen closely as I explain this for you!",
        "source": "T24n1451_038:0397b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「乃往昔時於大山澤，有一鹿王千鹿圍繞依林而住，有大智慧預識機宜。",
        "translation": "\"Once upon a time, there was a deer king living in a forest surrounded by a thousand deer in a great mountain swamp who had great wisdom and foresight about resourcefulness.",
        "source": "T24n1451_038:0397b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於所居處獵者來見，而往告王。",
        "translation": "A hunter came to see him where he was staying and went to the king to tell him.",
        "source": "T24n1451_038:0397b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王以兵周遍圍繞，鹿王作念：『我若不能救濟眾鹿，必被獵人之所屠害。』",
        "translation": "The king then surrounded them with his troops, and the deer king thought, 'If I don't save the deer, they'll be slaughtered by the hunters.'",
        "source": "T24n1451_038:0397b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時鹿王四顧瞻望而作是念：『我今作何方便，能令群鹿免斯苦厄？』",
        "translation": "The deer king then looked around and thought, 'What method can I use now to save the deer from this misfortune?'",
        "source": "T24n1451_038:0397b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂見深山下有澗水駛流出谷，諸鹿羸弱不能浮趒，鹿王入澗橫流而住，作大音聲普告群鹿：『汝等速來，可從此岸擲上我背趒於彼岸，必得存活。",
        "translation": "When he saw a stream flowing out of a valley below a deep mountain, and the deer were too weak to float, the deer king entered the stream and stayed there, making a loud noise that addressed the deer, \"Come quickly, throw yourselves onto my back from this bank and leap over to the other bank, and you will surely survive.",
        "source": "T24n1451_038:0397b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不爾者當遭屠害。』",
        "translation": "If you don't, you'll be slaughtered.'",
        "source": "T24n1451_038:0397b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是群鹿次第悉踏大鹿王脊，皆越駛河得離危難。",
        "translation": "Then, one by one, the herd of deer stepped on the great deer king's back and all crossed the mighty river to escape danger.",
        "source": "T24n1451_038:0397c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由諸群鹿蹄甲踐蹋，鹿王皮穿血肉皆盡唯餘脊骨，雖極苦痛心無退轉，悉令群鹿安隱得渡，仍懷顧戀誰未渡者？",
        "translation": "Because of the hoof and armor of the herd of deer, the skin of the deer king was pierced, and his flesh and blood were all gone except for his backbone. Although it was extremely painful, my heart didn't turn away, and I was able to get the herd of deer across in safety, but I still had second thoughts about who hadn't crossed yet.",
        "source": "T24n1451_038:0397c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於群鹿中有一鹿兒不能趒渡，爾時鹿王雖受極苦，尚懷哀念不顧自身，從水而出遂取鹿兒，置於脊上渡至彼岸。",
        "translation": "Although he was suffering terribly, the deer king still had compassion for the deer and didn't think about himself, so he got out of the water, picked up the deer, and placed it on his back to cross over to the other side.",
        "source": "T24n1451_038:0397c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹿王遍觀知渡盡已，氣力將竭臨命終時而發誓願：『我救群鹿及此鹿兒，救濟死厄不惜身命，願我當來得成無上正等覺時，令彼得渡生死羅網，置最後邊妙涅槃處。』」",
        "translation": "After he had thoroughly observed the end of the crossing, the deer king knew that his energy was about to run out and when he was about to die, he made a vow, 'I will save the deer and this deer boy, save them from death and trouble without sparing my life, and may I, when I attain unsurpassed perfect enlightenment in the future, cause Peter to wade through the net of birth and death and be placed in the final, marvelous place of nirvāṇa.'\"",
        "source": "T24n1451_038:0397c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「汝意云何？",
        "translation": "The Buddha addressed the monks, \"What do you think?",
        "source": "T24n1451_038:0397c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿生異念。",
        "translation": "\"Don't give rise to different thoughts.",
        "source": "T24n1451_038:0397c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往時鹿王者即我身是，其群鹿者拘尸那城諸壯士是，其鹿兒者即善賢是。",
        "translation": "That deer king was myself, that herd of deer was the strong men of Kuśinagara, and that deer son was Good Samaritan.",
        "source": "T24n1451_038:0397c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又諸苾芻！",
        "translation": "\"And you monks!",
        "source": "T24n1451_038:0397c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我無智在傍生內，喘息不安受諸苦毒，皮肉支節分解之時，救濟善賢令至無畏。",
        "translation": "\"When I'm lacking knowledge and I'm breathing heavily and suffering pain while my skin and flesh are disintegrating, I rescue good men and bring them to fearlessness.",
        "source": "T24n1451_038:0397c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等善聽！",
        "translation": "All of you, listen well!",
        "source": "T24n1451_038:0397c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古昔婆羅痆斯時有國王名曰梵授，以法化世廣如經說。",
        "translation": "It was once upon a time when there was a king of Vārāṇasī named Brahmadatta who taught the world the Dharma in a way that was broadly described in the sutras.",
        "source": "T24n1451_038:0397c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王有智馬預知前事，隣國敬畏悉來朝貢。",
        "translation": "The king had a wise horse that foreknew the previous events, and the neighboring states came to pay homage in reverence.",
        "source": "T24n1451_038:0397c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬既命終，時諸小王令使報曰：『汝梵授王今可輸稅分與我等，若不爾者不得出城。",
        "translation": "When the horse's life ended, the junior kings sent an envoy to report, 'Now, you, King Brahmadatta, can give us our share of the tax; if not, we won't be allowed to leave the city.",
        "source": "T24n1451_038:0397c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見違者，我等同來破滅其國。』",
        "translation": "If you see anything contrary, we'll come along and destroy his kingdom.'",
        "source": "T24n1451_038:0397c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王告使曰：『我不送稅亦不出城。』",
        "translation": "The king told the messenger, 'I won't send the tax, and I won't leave the city.'",
        "source": "T24n1451_038:0397c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂於國內訪求智馬，後於異處遂便獲得。",
        "translation": "He then sought out wise horses within the country and was able to obtain them from another place.",
        "source": "T24n1451_038:0397c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時屬春序卉木敷榮，群鳥和鳴甚可愛樂，王乘智馬將諸婇女遊適芳園歡娛受樂。",
        "translation": "It was springtime, and the flowers and trees were in full bloom, the birds were singing in harmony, and the king rode the horse of wisdom and took his daughters to the fragrant garden to enjoy themselves.",
        "source": "T24n1451_038:0397c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸小王聞梵授王與諸臣佐及宮婇女，在外遊戲情無所懼，未即入城相與謀計，各嚴四兵至城門首。",
        "translation": "When the junior kings heard that King Brahmadatta and his ministers and ladies were out playing without fear, they went into the city to plan with each other beforehand, and they each gathered four armies at the city gates.",
        "source": "T24n1451_038:0397c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大臣白王：『諸小國王不恭朝命，敢興逆亂來扣城門，願見警備。』",
        "translation": "The ministers said to the king, 'How dare the lesser kings disrespect the imperial order and cause rebellion by coming to barricade the city gates, and may I see them guarded?'",
        "source": "T24n1451_038:0397c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王既聞已勅索智馬：『速嚴四兵，我自討擊。』",
        "translation": "After hearing this, the king commanded Saul Jima, 'Quickly decorate the four armies, and I will attack them myself.'",
        "source": "T24n1451_038:0397c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王乘馬嚴兵誓眾共彼鬪戰，王恃威力獨處先鋒，遂被賊軍以槊中馬，腸胃皆出受諸楚毒，眾苦難堪形命無幾，仍作是念：『王遭困厄，我若不救是所不應，宜忍苦楚令王免厄，得至城門到無畏處。』",
        "translation": "The king then rode his horse and harnessed his troops, vowing that they would fight together. Relying on his authority, the king was alone in the vanguard, and was then hit by a lance from the bandits' army, which caused pain and poison to escape from his intestines and stomach, and caused him much suffering and difficulty, so his physical life was limited.",
        "source": "T24n1451_038:0397c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已周迴顧望無入城路，然此城外有大浴池名曰妙梵，近王宮闕，於其池中有四蓮華，青黃赤白皆悉遍滿。",
        "translation": "After that thought, he looked around and saw that there was no way to enter the city, but outside of the city there was a large bathing pond called Myōvatī near the king's palace palace, and in that pond there were four lotus flowers filled with blue, yellow, red, and white flowers.",
        "source": "T24n1451_038:0398a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時智馬不顧身命，騰躍池中踐荷葉上，負王渡難直入宮中。",
        "translation": "Then, without regard for his own life, the wise horse leaped into the pond and trod on the lotus leaves, carrying the king across the difficulty and straight into the palace.",
        "source": "T24n1451_038:0398a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王纔下，馬便命絕。",
        "translation": "As soon as the king got down, the horse's life was cut short.",
        "source": "T24n1451_038:0398a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸小王競入園林，處處尋覓竟不能得，迴軍劫掠各還本居。",
        "translation": "The lesser kings then rushed into the garden, searched everywhere, but couldn't find it, so they turned back to their original homes and plundered it.",
        "source": "T24n1451_038:0398a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梵授王既免危厄得存性命，告婆羅痆斯諸大臣等及眾人曰：『若有能救剎帝利灌頂大王命者如何恩賞？』",
        "translation": "Having been spared danger and saved from death, King Brahmadatta then addressed the ministers of Vārāṇasī and the crowd, saying, 'What would be the reward for someone who could save the life of the great king Kārttivādin?'",
        "source": "T24n1451_038:0398a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣白王：『可分半國。』",
        "translation": "The ministers said to the king, 'They said, 'We can divide the kingdom in half.'",
        "source": "T24n1451_038:0398a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：『此之智馬能全我命，馬今既死欲何以報？』",
        "translation": "The king said, 'This wise horse was able to save my life; now that it's dead, what do you want to do in return?'",
        "source": "T24n1451_038:0398a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣答言：『應為智馬，於城四門宜作非時白蓮華會，廣行惠施盛修福業以資魂路。』",
        "translation": "The ministers replied, 'It would be appropriate for the wise horse to make an untimely white lotus assembly at the city's four gates and to widely practice generosity and abundantly cultivate good actions to support the soul's path.'",
        "source": "T24n1451_038:0398a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『甚善！",
        "translation": "The king said, 'Very good!",
        "source": "T24n1451_038:0398a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜時疾作。』",
        "translation": "It's time to do it quickly.'",
        "source": "T24n1451_038:0398a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王即令太子中宮婇女臣佐使民莊嚴衢路，布列香華幡蓋明燈，在處懸設無不充滿，如歡喜園甚可愛樂。",
        "translation": "The king then had the prince's middle palace, his ladies, ministers, and assistants cause the people to adorn the streets and spread out a display of flowers, banners, and bright lanterns that were placed everywhere and filled them like a delightful garden.",
        "source": "T24n1451_038:0398a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王令擊鼓宣告遠近：『我於明日欲為智馬於城四門營建非時白蓮華會，宜可告知集法場所受我供養。』",
        "translation": "The king ordered the drums to beat and proclaim from afar, 'Tomorrow I want to build an untimely white lotus assembly at the city's four gates for Jīvaka, so it would be a good idea to tell people to gather at the Dharma site and accept my offerings.'",
        "source": "T24n1451_038:0398a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時至雲集，隨須給與普令稱意。",
        "translation": "When the time came, the clouds gathered, and they gave and gave their universal assent as needed.",
        "source": "T24n1451_038:0398a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等苾芻於意云何？",
        "translation": "What do you monks think?",
        "source": "T24n1451_038:0398a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時智馬即我身是，我為彼王受諸苦楚，身形分解不顧身命，尚能救濟令離危厄。」",
        "translation": "That horse of wisdom was me, and I was suffering for that king, and my body decomposed without concern for my life, but I was still able to rescue him from danger and trouble.\"",
        "source": "T24n1451_038:0398a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻又復有疑，請世尊曰：「大德！",
        "translation": "Again, the monks had doubts and asked the Bhagavān, \"Mañjuśrī!",
        "source": "T24n1451_038:0398a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽善賢先作何業？",
        "translation": "What kind of activity did the good men with long lives first do?",
        "source": "T24n1451_038:0398a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今為大師最後弟子。」",
        "translation": "Now, I'm the last disciple of the great teacher.\"",
        "source": "T24n1451_038:0398a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等當知！",
        "translation": "The Buddha addressed the monks, \"You should know this!",
        "source": "T24n1451_038:0398a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自所作業今還自受，廣如餘處乃至說頌。",
        "translation": "\"Now, I'll take back what I've done myself, just as I've explained in detail elsewhere, up to and including the verse.",
        "source": "T24n1451_038:0398a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1451_038:0398a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往古昔此賢劫中人壽二萬歲時，有佛出世名迦攝波十，號具足，在婆羅痆斯仙人墮處施鹿林中。",
        "translation": "Once upon a time in the distant past, when this good eon was 20,000 years old, a Buddha appeared in the world named Kāśyapa ten, who was called Completely Awakened, and was living in a deer park among the sages of Vārāṇas.",
        "source": "T24n1451_038:0398a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼如來、應、正等覺，有外孫子名曰無憂，求解脫故而為出家，謂解脫果自然可得，於八正道而不勤修，經歷多時竟無果證，遊行人間隨處作夏。",
        "translation": "At the time, that Tathāgata, Arhat, and Completely Enlightened One had a grandson named Wuzu who left home because he wanted to be liberated, thinking that the fruit of liberation would come naturally, and he didn't diligently cultivate the eightfold path.",
        "source": "T24n1451_038:0398b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼如來有緣皆度，所作已辦如薪盡火滅，於其中夜將入涅槃。",
        "translation": "That Tathāgata has all the conditions for passing away, and after accomplishing what he did, he's like firewood going out, and he's about to enter nirvāṇa in the middle of the night.",
        "source": "T24n1451_038:0398b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼苾芻在無憂樹下，而此樹神聞迦攝波如來當般涅槃，悲泣雨淚霑無憂身。",
        "translation": "The monk was under the tree of Wuzu when the tree's spirit heard that Tathāgata Kāśyapa would soon attain parinirvāṇa and covered Wuzu's body with tears and sorrow.",
        "source": "T24n1451_038:0398b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻仰觀問其神曰：『有何所以如是悲啼？』",
        "translation": "The monk looked up and asked the god, 'What is the reason for this lamentation?'",
        "source": "T24n1451_038:0398b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹神對曰：『今日中夜迦攝波佛將入涅槃。』",
        "translation": "The tree god replied, 'Today, in the middle of the night, Kāśyapa Buddha will enter nirvāṇa.'",
        "source": "T24n1451_038:0398b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼苾芻聞如是語，情懷痛切如箭入心，悲啼號哭發聲大喚。",
        "translation": "When that monk heard these words, his feelings were as pained as an arrow piercing his heart, and he wailed and cried out in pity.",
        "source": "T24n1451_038:0398b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹神問曰：『何故悲啼？』",
        "translation": "The tree god asked, 'What's the reason for the lamentation?'",
        "source": "T24n1451_038:0398b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：『迦攝波如來、應、正等覺是我親舅，我雖依附而不勤修，去此既遠難申禮敬，我是凡夫無力速往，是以悲哭。』",
        "translation": "He said, 'The Kāśyapa Tathāgata, Arhat, and Perfect Enlightenment are my brothers-in-law. Although I'm dependent on them but don't cultivate them, it's difficult to pay respect to them because they're far away, and I'm an ordinary person who can't afford to go quickly.",
        "source": "T24n1451_038:0398b13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹神報曰：『然我有力令仁疾至，不知見佛得有益不？』",
        "translation": "The tree god replied, 'Still, I have the strength to make Ren arrive quickly; I wonder if seeing the Buddha would be helpful?'",
        "source": "T24n1451_038:0398b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻報曰：『我極勇猛，若見佛者必能依行證獲果利。』",
        "translation": "The monk replied, 'I'm extremely courageous, and if I were to see the Buddha, I would surely realize the fruit of my actions.'",
        "source": "T24n1451_038:0398b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時樹神以神通力，將此苾芻疾至佛所。",
        "translation": "Then, with supernatural powers, the tree spirit quickly brought this monk to the Buddha.",
        "source": "T24n1451_038:0398b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既見佛已發清淨心起廣大願，時彼如來隨其根性，為說妙法證阿羅漢果，不忍見佛入般涅槃，是故於先而取滅度。",
        "translation": "After seeing the Buddha and arousing a pure mind and a great vow, the Tathāgata then, according to his capacity, taught him the wonderful Dharma and realized the fruit of the arhat, and he couldn't bear to see the Buddha enter parinirvāṇa; therefore, he had previously obtained his extinction.",
        "source": "T24n1451_038:0398b19_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼樹神既見世尊及苾芻涅槃已，情懷戀慕作如是念：『今此具壽所獲勝利皆由我得，以此功德願我來世迦攝波佛所授摩納婆記，人壽百歲得成正覺號釋迦牟尼，彼涅槃時，我得聲聞無學果已在先滅度。』」",
        "translation": "After that tree spirit saw the Bhagavān and the monks enter nirvāṇa, he had this longing for them and thought, 'Now, I will attain the excellent benefits of this full life span, and because of this merit, I hope that I will be granted the knowledge of Maṇḍala by the Buddha Kāśyapa in the future and become fully awakened at the age of 100 years, which is called Śākyamuni, and that I will be extinguished before he attains the fruit of śrāvaka and post-learning when he attains nirvāṇa.'\"",
        "source": "T24n1451_038:0398b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「於汝意云何？",
        "translation": "The Buddha addressed the monks, \"What do you think?",
        "source": "T24n1451_038:0398b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天神者今善賢是。",
        "translation": "The gods of the time are now Good Samaritan.",
        "source": "T24n1451_038:0398b27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是義故，於一切時遠離惡友近善知識，應如是學。」",
        "translation": "Because of this, you should at all times avoid bad friends and approach good friends, and you should train in this way.\"",
        "source": "T24n1451_038:0398b27_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀白佛言：「世尊！",
        "translation": "Ānanda then said to the Buddha, \"Bhagavān!",
        "source": "T24n1451_038:0398b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於靜處作如是念：『善知識者是半梵行，諸修行者由善友力方能成辦，得善友故遠離惡友，以是義故方知善友是半梵行。』」",
        "translation": "In my quiet place, I had this thought, 'A good friend is a half-priestly practice, and it's through the power of good friends that practitioners can accomplish this, and it's because of good friends that they become free of bad friends that they know a good friend is a half-priestly practice.'\"",
        "source": "T24n1451_038:0398b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難陀勿作是語：『善知識者是半梵行。』",
        "translation": "The Buddha said, \"Ānanda, don't say this, 'A good friend is a half-priestly practice.'",
        "source": "T24n1451_038:0398c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1451_038:0398c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識者是全梵行，由此便能離惡知識，不造諸惡常修眾善，純一清白具足圓滿梵行之相。",
        "translation": "\"A good friend is someone who engages in the full religious practice, so he can part with bad associates, refrain from doing evil and cultivate goodness, and be pure and clean, fully possessing the characteristics of the full religious life.",
        "source": "T24n1451_038:0398c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由是因緣若得善伴與其同住，乃至涅槃事無不辦，故名全梵行。",
        "translation": "If he obtains a good companion to live with him for this reason, there's nothing he can't do up to nirvāṇa, which is why he's called carrying out the whole religious practice.",
        "source": "T24n1451_038:0398c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1451_038:0398c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_038:0398c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我由善知識故，令諸有情於生老病死憂悲苦惱皆得解脫，若離善友無如是事。",
        "translation": "Because of a good teacher, I cause sentient beings to be liberated from the grief, sorrow, pain, and vexation of birth, age, sickness, and death, which would not have happened if I'd left a good friend.",
        "source": "T24n1451_038:0398c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_038:0398c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於我所說應勤修學。」",
        "translation": "You should diligently train in what I've taught you.\"",
        "source": "T24n1451_038:0398c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸苾芻曰：「由是義故，從今已去不應輒度外道出家并受近圓，除釋迦種及事火留髻外道。",
        "translation": "It was then that the Buddha addressed the monks, \"For this reason, from now on you shouldn't readily allow laypeople to leave home and receive near-complete ordination, except for non-Buddhists of the Śākyamuni lineage and those working with the fire retracts.",
        "source": "T24n1451_038:0398c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若披外道服來求出家及受近圓者，問無障法，此人應與。",
        "translation": "If someone wearing the robes of a non-Buddhist comes seeking to leave home and receive near-complete ordination, they should ask about the unobstructed teaching, and that person should be given it.",
        "source": "T24n1451_038:0398c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1451_038:0398c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是我親有機緣故。",
        "translation": "\"This is because I'm personally endowed with an opportunity.",
        "source": "T24n1451_038:0398c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其事火人說有業用，有因有緣有策勵果故，此等不勞共住，即與出家并受近圓。",
        "translation": "Because these things are said by fire-eaters to have karmic activity and have causes and conditions that bring about the result of encouragement, these people will abide together without difficulty, namely, as renunciant practitioners and near-complete practitioners.",
        "source": "T24n1451_038:0398c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是自餘外道之類，來求出家及近圓者，其親教師應與衣服，食僧常食四月共住。",
        "translation": "If some other kind of non-Buddhist comes seeking renunciation and near-perfection, their relative or teacher will give them clothing and a permanent meal for monks for four months.",
        "source": "T24n1451_038:0398c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀其人性行調柔堪濟度者，應與出家并近圓事，如是應知。",
        "translation": "If they observe that their human behavior is gentle and adaptable to help, they should be given renunciant monks and near-perfection services, as you should know.",
        "source": "T24n1451_038:0398c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次汝等苾芻！",
        "translation": "\"Furthermore, you monks!",
        "source": "T24n1451_038:0398c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法能於現在及未來世生長利樂者，汝等應當受持讀誦，為他演說勿使廢忘，欲令梵行得久住世，安樂人天利樂饒益諸眾生故。",
        "translation": "\"If the teaching can produce benefit in the present and future lives, you should accept, read, and recite it, expound it for others, and don't let it be forgotten, in order to make the religious practice long-lasting and to bring comfort to humans and gods, benefit, and enrich sentient beings.",
        "source": "T24n1451_038:0398c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此法是何？",
        "translation": "What's this teaching?",
        "source": "T24n1451_038:0398c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂契經、應頌、記別、諷頌、自說、因緣、本事、本生、方廣、希有、譬喻、論議。",
        "translation": "They are sūtras, hymns, assurances, chants, self-explanations, causes and conditions, abilities, births, directions, rarities, parables, and discussions.",
        "source": "T24n1451_038:0398c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此十二分教，若能受持讀誦如說行者，能於現未生長利樂，乃至慈愍群生佛法久住。",
        "translation": "If you can memorize, recite, and practice these 12 parts of the teaching as they're described, it will create benefits in the present and happiness in the future, even to the point where the Buddha's teaching will be long-lasting in its kindness to sentient beings.",
        "source": "T24n1451_038:0398c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1451_038:0398c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我涅槃後，作如是念：『我於今日無有大師。』",
        "translation": "After I passed away, I had this thought, 'Today, I have no great teacher.'",
        "source": "T24n1451_038:0398c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等不應起如是見，我令汝等每於半月說波羅底木叉，當知此則是汝大師、是汝依處，若我住世無有異也。",
        "translation": "You shouldn't come to such a view, for I'll have you say every half-moon, 'Prātimokṣa,' and you should know that this is your great teacher and your base, no different than if I had lived in the world.",
        "source": "T24n1451_038:0399a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又始從今日小下苾芻，於長宿處不應喚其氏族姓字，應喚『大德』或云『具壽』，老大苾芻應喚小者為『具壽』。",
        "translation": "From now on, junior monks shouldn't call their clansmen by their surnames when they're in the presence of a senior monk; they should call them 'the great virtuous one' or 'the long-lived one,' and the elder monk should call the junior one 'the long-lived one.'",
        "source": "T24n1451_038:0399a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然大苾芻於小者處，應可存情哀憐覆護生慈念心，或以衣鉢鉢絡腰絛，共相濟給勿令闕事，或復教授讀誦禪思使有日益，如是能令我法增長。",
        "translation": "However, when the older monk goes to the younger one, he or she should show compassion, protect, and show kindness, either by giving him or her a robe, a bowl, a belt, and a handkerchief, helping each other not to run out of things to do, or by teaching reading, reciting, and meditating so that there's more and more, which will cause our teaching to grow.",
        "source": "T24n1451_038:0399a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不爾者法當速滅。",
        "translation": "If that's not the case, the teaching will quickly cease.",
        "source": "T24n1451_038:0399a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又汝等苾芻此地方所有其四處，若有淨信男子女人，乃至盡形常應繫念生恭敬心。",
        "translation": "Furthermore, you monks, there are four places in this place where a man or woman of pure faith, even to the end of their life, should always be mindful and respectful.",
        "source": "T24n1451_038:0399a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T24n1451_038:0399a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一謂佛生處；二、成正覺處；三、轉法輪處；四、入大涅槃處。",
        "translation": "1. the place where a buddha is born; 2. the place where he becomes perfectly enlightened; 3. the place where he turns the wheel of the Dharma; and 4. the place where he enters great nirvāṇa.",
        "source": "T24n1451_038:0399a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能於此四處或自親禮，或遙致敬企念虔誠，生清淨信常繫心者，命終之後必得生天。」",
        "translation": "If someone can either personally venerate or pay homage to these four places, venerate them from afar, and give rise to pure faith and constant reliance, they'll surely be born in heaven after their lives end.\"",
        "source": "T24n1451_038:0399a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(比於西方，親見如來一代五十餘年居止之處，有其八所：一、本生處，二、成道處，三、轉法輪處，四、鷲峯山處，五、廣嚴城處，六、從天下處，七、祇樹園處，八、雙林涅槃處。",
        "translation": "(In the West, there are eight places where the Tathāgata has lived and stayed for more than 50 years: 1. the place of his original birth, 2. the place of his attainment of enlightenment, 3. the place where he turns the wheel of the Dharma, 4. the place on Vulture Peak, 5. the place in Vulture Peak, 5. the place in Vaiśālī, 6. the place under the heavens, 7. the place in Jeta Grove, and 8. the place in Shuanglin Nirvāṇa.",
        "source": "T24n1451_038:0399a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四是定處，餘皆不定。",
        "translation": "Four are places of concentration, and the others are all places of concentration.",
        "source": "T24n1451_038:0399a16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總攝頌曰：「生成法鷲，廣下祇林，虔誠一想，福勝千金。」",
        "translation": "(The summary verse says, \"Becoming a Vulture of the Dharma, going down to Jilin in great measure, one pious thought will bring fortune greater than a thousand pieces of gold.\")",
        "source": "T24n1451_038:0399a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": ")復次佛告諸苾芻：「汝等有疑今悉應問，若於佛法僧寶，苦集滅道四聖諦處，有疑問者我當為答。」",
        "translation": ") Furthermore, the Buddha addressed the monks, \"Now, if you have any doubts, you should all ask them, and I will answer them if you have questions about the treasures of the Buddha, Dharma, and Saṃgha and the four noble truths of suffering, arising, cessation, and the path.\"",
        "source": "T24n1451_038:0399a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時具壽阿難陀白佛言：「世尊！",
        "translation": "Kauṣṭhila Ānanda then said to the Buddha, \"Bhagavān!",
        "source": "T24n1451_038:0399a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今者解佛所說，命諸苾芻有疑當問。",
        "translation": "Now, I understand what the Buddha has taught and order the monks to ask questions if they have doubts.",
        "source": "T24n1451_038:0399a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此眾中竟無一人，於佛法僧寶苦集滅道諦有懷疑惑更須問者。」",
        "translation": "Yet there isn't a single person in this congregation who has doubts about the Buddha, Dharma, Saṃgha, and the noble truths of suffering, arising, cessation, and the path and needs to ask questions.\"",
        "source": "T24n1451_038:0399a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T24n1451_038:0399a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_038:0399a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能如實通達作如是語，於此眾內我以智觀，於諦寶中實無疑者，此是如來最後所作。」",
        "translation": "You can truly comprehend and say this, 'I have observed with wisdom here among all of you that there's really no doubt about the treasure of the truths, and this is the last thing the Tathāgata did.'\"",
        "source": "T24n1451_038:0399a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時如來大悲愍故，遂去上衣現其身相，告諸苾芻：「汝等今者可觀佛身，汝等今者可觀佛身。",
        "translation": "At that point, the Tathāgata, out of great compassion, removed his upper robe and revealed his physical appearance, telling the monks, \"Now, you may look at the Buddha's body; now, you may look at the Buddha's body.",
        "source": "T24n1451_038:0399a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1451_038:0399a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來、應、正等覺難可逢遇，如烏曇跋羅華。」",
        "translation": "The Tathāgata, Arhat, and Completely Enlightened One are difficult to encounter, like the udumbara flower.\"",
        "source": "T24n1451_038:0399a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻咸皆默然，佛言：「法皆如是，諸行無常，是我最後之所教誨。」",
        "translation": "The monks were all silent, and the Buddha said, \"All things are thus, and all conditioned things are impermanent, which is the last thing I'll teach.\"",
        "source": "T24n1451_038:0399b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已安心正念入初靜慮，從此起已順次第入第二靜慮，乃至非想非非想處及滅受想定，寂然宴默。",
        "translation": "After saying this, they entered first meditation with calm correct mindfulness and from there they proceeded in order to second meditation, up to the abode of neither perception nor non-perception and the concentration of cessation of sensation and perception, in silence and repose.",
        "source": "T24n1451_038:0399b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀問尊者阿尼盧陀曰：「今我大師為入涅槃為未入耶？」",
        "translation": "Ānanda then asked Venerable Aniruddha, \"Now, has my teacher entered nirvāṇa or has he not yet entered it?\"",
        "source": "T24n1451_038:0399b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「佛未涅槃，但住滅受想定。」",
        "translation": "He replied, \"The Buddha has yet to attain nirvāṇa but remains in the concentration of ceasing sensation and perception.\"",
        "source": "T24n1451_038:0399b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀言：「我曾從佛親聞此語，若佛世尊入邊際定寂然不動，從此無間世間眼閉必入涅槃。」",
        "translation": "Ānanda said, \"I've heard this from the Buddha himself, 'If the Bhagavān enters the liminal concentration and remains still and unmoving, then from this point on he'll surely enter nirvāṇa after the eyes of the unremitting world are closed.'\"",
        "source": "T24n1451_038:0399b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從滅受想定出，逆次第入非想非非想處，從非想非非想出入無所有處，次入識無邊處，次入空無邊處，次入第四靜慮，入第三、入第二、入初靜慮，從初禪出還入第二、第三、第四靜慮，寂然不動，便入無餘妙涅槃界。",
        "translation": "The Bhagavān then emerged from the concentration of cessation of feeling and perception, entered the abode of neither perception nor non-perception in reverse order, exited from neither perception nor non-perception into the abode of nothingness, then entered the abode of the infinity of consciousness, then entered the abode of the infinity of emptiness, then entered the fourth concentration, entered the third, second, and first concentrations, and exited from the first concentration and returned to the second, third, and fourth concentrations, still and motionless, and then entered the wonderful state of nirvāṇa without remainder.",
        "source": "T24n1451_038:0399b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊纔涅槃後，大地震動流星晝現諸方熾然，於虛空中諸天擊鼓。",
        "translation": "At the time, after the Bhagavān had fallen into nirvāṇa, a great earthquake shook meteors that blazed in the sky in the daytime, and the gods beat their drums.",
        "source": "T24n1451_038:0399b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時具壽大迦攝波，在王舍城羯蘭鐸迦池竹林園中，見大地動，即便斂念觀察何事？",
        "translation": "Kauśāmbī was in the bamboo grove of Kālāndaka Pond in Rājagṛha when he saw the earth shake and recuperated to examine what was going on.",
        "source": "T24n1451_038:0399b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便見如來入大圓寂，自念：「我今既無大師，唯依法住，諸行法爾知更云何？」",
        "translation": "He then saw the Tathāgata enter into great perfect tranquility and thought to himself, \"Now that I have no great teacher but only the abode of the Dharma, what else do I know about the practices and the Dharma?\"",
        "source": "T24n1451_038:0399b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「此未生怨王勝身之子信根初發，彼若聞佛入涅槃者，必嘔熱血而死，我今宜可預設方便。」",
        "translation": "Again, he thought, \"This unborn, resentful son of the king's victorious body has his first roots of faith, and if he hears that the Buddha has entered nirvāṇa, he'll vomit hot blood and die, so now I should prepare a way to help him.\"",
        "source": "T24n1451_038:0399b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念，已即命城中行雨大臣：「仁今知不？",
        "translation": "After he had this thought, he ordered the minister of the rain to come to the city, \"Do you know this, sir?",
        "source": "T24n1451_038:0399b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛已涅槃，未生怨王信根初發，彼若聞佛入涅槃者，必嘔熱血而死。",
        "translation": "After the Buddha's nirvāṇa, the unborn enemy king's first faculty of faith will vomit hot blood and die if he hears that the Buddha has entered nirvāṇa.",
        "source": "T24n1451_038:0399b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今宜可預設方便。」",
        "translation": "Now, it's appropriate for me to pre-designate a method.\"",
        "source": "T24n1451_038:0399b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即依次第而為陳說：「仁今疾可詣一園中，於妙堂殿如法圖畫佛本因緣。",
        "translation": "He then explained the teaching in order, \"Now, Sir, you can quickly go to a park and paint the Buddha's original causes and conditions in the hall of the wonderful hall according to the teaching.",
        "source": "T24n1451_038:0399b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩昔在覩史天宮，將欲下生觀其五事，欲界天子三淨母身，作象子形託生母腹，既誕之後踰城出家，苦行六年坐金剛座，菩提樹下成等正覺。",
        "translation": "Once upon a time, the bodhisattva was in the palace of Tuṣita Heaven, about to descend into the world and observe five things: the desire-sector god child purified his mother's body three times, assumed the shape of an elephant child, and was reborn in his mother's womb.",
        "source": "T24n1451_038:0399b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次至婆羅痆斯國為五苾芻三轉十二行四諦法輪。",
        "translation": "He then went to the country of Vārāṇasī and turned the Dharma wheel of the twelve practices and four truths three times for five monks.",
        "source": "T24n1451_038:0399c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次於室羅伐城為人天眾現大神通。",
        "translation": "Next, he showed great supernormal powers to a multitude of people and gods in the city of Śrāvastī.",
        "source": "T24n1451_038:0399c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次往三十三天為母摩耶廣宣法要，寶階三道下贍部洲，於僧羯奢城人天渴仰。",
        "translation": "He then went to the Trāyastriṃśa Heaven to explain the essentials of the Dharma to Māmāyā, descended from the continent to Jambudvīpa along the three jeweled paths, and longed for by humans and gods in the city of Śākāśa.",
        "source": "T24n1451_038:0399c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸方國在處化生，利益既周將趣圓寂，遂至拘尸那城娑羅雙樹，北首而臥入大涅槃。",
        "translation": "After reborn in various lands, he had completed his benefits and was headed for perfect extinction when he arrived at the Sālêndra tree in Kuśinagara and entered great nirvāṇa while lying on his back to the north.",
        "source": "T24n1451_038:0399c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來一代所有化迹既圖畫已，次作八函與人量等置於堂側，前七函內滿置生酥，第八函中安牛頭栴檀香水。",
        "translation": "After he has drawn and painted the traces of the Tathāgata's life, he then makes eight boxes and places them next to the hall with a human amount, filling the first seven boxes with butter and placing the eighth box with scented water from the oxhead sandalwood.",
        "source": "T24n1451_038:0399c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若因駕出可白王言：『暫迀神駕躬詣芳園所觀其圖畫。』",
        "translation": "If he were to drive out, he could say to the king, 'Perhaps the gods will drive us personally to Fang Yuan to look at his pictures.'",
        "source": "T24n1451_038:0399c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王見已問行雨言：『此述何事？』",
        "translation": "When the king saw this, he asked Xing Yu, 'What's this about?'",
        "source": "T24n1451_038:0399c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即次第為王陳說一如圖畫，始從覩史降身母胎，終至雙林北首而臥。",
        "translation": "He then explained the king's position in turn, just as he had been pictured, starting with Tuṣita descending into his mother's womb and ending up at the northern end of the Shuanglin district, where he lay down.",
        "source": "T24n1451_038:0399c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞是語即便悶絕宛轉于地，可速移入第一函中。",
        "translation": "When the king heard those words, he became despondent and moved to the ground, where he could quickly move into the first compartment.",
        "source": "T24n1451_038:0399c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一、二、三、四乃至第七，後置香水王便穌息。」",
        "translation": "Thus, for one, two, three, four, or even the seventh, the king then calms down after placing the water in the latter.\"",
        "source": "T24n1451_038:0399c14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時尊者次第教已往拘尸那城，行雨大臣一如尊者所教之事次第作已，時王因出大臣白言：「願王暫迀神駕遊觀園中。」",
        "translation": "After the Venerable had taught them in turn and gone to Kuśinagara, the minister of the rain walk had done what the Venerable had taught in turn, and the king then sent out the minister, saying, \"May the king take a short trip in his spiritual car to look around the garden.\"",
        "source": "T24n1451_038:0399c15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王至園所見彼堂中圖畫新異，始從初誕乃至倚臥雙林，王問臣曰：「豈可世尊入涅槃耶？」",
        "translation": "When the king arrived at the garden, he saw the new and different pictures in the hall, from the first birth up to the reclining twin groves, and he asked the minister, \"Could the Bhagavān have entered nirvāṇa?\"",
        "source": "T24n1451_038:0399c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時行雨默然無對。",
        "translation": "The rain of practice was then silent and unanswered.",
        "source": "T24n1451_038:0399c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見是已知佛涅槃，即便號咷悶絕宛轉于地。",
        "translation": "Seeing that he had known about the Buddha's nirvāṇa, the king even cried out, fainted, and fell to the ground.",
        "source": "T24n1451_038:0399c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣即移舉置蘇函中，如是至七方投香水，從此已後王漸穌息。",
        "translation": "The minister then lifted it into the Sukhāvatī and cast perfume in seven directions like this, and gradually from then on the king was calmed.",
        "source": "T24n1451_038:0399c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時如來入涅槃時，娑羅雙樹名華下散彌覆金軀。",
        "translation": "At the time the Tathāgata entered nirvāṇa, the famous flowers of the śāla trees were scattered down to cover the golden body.",
        "source": "T24n1451_038:0399c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有苾芻見斯事已而說頌曰：「世尊涅槃時，　　最勝娑羅樹，　低枝下垂蔭，　　復散以名華。」",
        "translation": "When a monk saw this, he spoke a verse, \"When the Bhagavān was in nirvāṇa, the most excellent śāla tree had its low branches draped with shade, and it spread out its name flowers.\"",
        "source": "T24n1451_038:0399c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋亦說頌曰：「諸行無常，　　是生滅法；　　生滅滅已，　寂滅為樂。」",
        "translation": "The god Indra also spoke a verse, saying, \"Actions are impermanent, which are the law of birth and cessation; after birth and cessation cease, tranquility becomes bliss.\"",
        "source": "T24n1451_038:0399c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時梵天王亦說頌曰：「於一切世間，　　生者皆歸死；　無常力最大，　　諸行盡淪亡。",
        "translation": "The Brahma gods also spoke a verse, \"In all the world, birth always returns to death; impermanence is the greatest force, and all conditioned things fall away.",
        "source": "T24n1451_038:0400a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　大師世間眼，　　十力無與等；　化緣既周遍，　　寂滅在雙林。」",
        "translation": "The worldly eye of the great teacher has no equal among the ten powers; once the causes of transformation are universal, cessation lies in the twin forests.\"",
        "source": "T24n1451_038:0400a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時尊者阿尼盧陀亦說頌曰：「佛無出入息，　　其心亦湛然；　世眼今已閉，　　寂然安不動。",
        "translation": "Venerable Aniruddha then also spoke a verse, \"The Buddha has no in-and-out breath, and his mind is perfectly calm; now that the worldly eye has closed, it's still and unmoving.",
        "source": "T24n1451_038:0400a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊十力具，　　化盡入無餘；　見聞諸有情，　　毛竪心驚怖。",
        "translation": "The Bhagavān's ten powers are complete, and his teachings have ended and entered without remainder; beholding and hearing sentient beings, their hair stands on end and their hearts are frightened.",
        "source": "T24n1451_038:0400a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　汝心莫沈沒，　　亦勿懷憂惱；　佛證真木叉，　　譬如燈焰滅。」",
        "translation": "Don't sink your mind, and don't be troubled; the Buddha's realization of true mokṣa is like a lamp flame going out.\"",
        "source": "T24n1451_038:0400a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻，見佛世尊般涅槃已各懷悲感，或有迷悶宛轉于地，椎胸大喚心生憂慘，或有尋思法理作如是說：「我等今時宜自裁忍，世尊常說：『一切光華可愛樂事，雖是尊重，終歸無常悉皆離別。』」",
        "translation": "The monks then, after seeing the Bhagavān's parinirvāṇa, each felt compassion, some were confused, swayed to the ground, beaten on the chest, and distressed, and some reflected on the principle of the Dharma and said, \"Now, it's appropriate for us to define for ourselves the patience of the Bhagavān, who always says, 'Although all the attractive and pleasant things in glory and splendor are honored, they all eventually become impermanent and are parted.'\"",
        "source": "T24n1451_038:0400a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿尼盧陀告阿難陀曰：「具壽！",
        "translation": "Aniruddha then addressed Ananta, \"Gosu!",
        "source": "T24n1451_038:0400a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜應勸誘大眾，且各裁抑，勿乖儀式莫大悲號。",
        "translation": "It's appropriate to encourage the public to moderate their responses and not to deviate from the rituals or the call of Maitreya's compassion.",
        "source": "T24n1451_038:0400a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1451_038:0400a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此現有住百千劫長壽諸天，皆生嫌恥作如是語：『云何苾芻於佛世尊善說法律而為出家，不能善觀諸無常事乃生憂苦？』」",
        "translation": "Here in the present there are gods who live for a hundred thousand eons and are disgusted, saying, 'How did the monks leave home because the Bhagavān well explained the teaching of the Dharma and became sad and distressed because they couldn't well observe impermanence?'\"",
        "source": "T24n1451_038:0400a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀白言：「此諸天眾其數幾何？」",
        "translation": "Ānanda said, \"How numerous are these gods?\"",
        "source": "T24n1451_038:0400a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「從此拘尸那城，乃至金河及娑羅雙樹，至壯士繫冠制底，於此四邊周十二踰繕那，大威德天悉皆充滿，無有空隙可容立杖。",
        "translation": "They replied, \"From this city of Kuśinagara up to the golden river and the two śāla trees and up to the base of the brave man's crown, the four sides of the city are surrounded by twelve yojanas, and the gods of great authority are all filled, with no space left to stand a staff.",
        "source": "T24n1451_038:0400a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此諸天見佛涅槃，各懷悲感椎胸懊惱悶絕于地，亦有如前共相開解，且各裁止，乃至終歸無常悉皆離別。」",
        "translation": "When these gods see the Buddha's nirvāṇa, they each feel compassionate feelings, beat their chests, and are distressed to the ground, and they each come to terms with each other as before, even to the point where they all part company in impermanence.\"",
        "source": "T24n1451_038:0400a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時尊者阿尼盧陀，為阿難陀及諸大眾，廣說法要乃至天明，時苾芻等默然聽受。",
        "translation": "Venerable Aniruddha then explained the essentials of the Dharma for Ānanda and the crowd, right up to the dawn of heaven, and the monks and others listened quietly.",
        "source": "T24n1451_038:0400b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿尼盧陀復告阿難陀曰：「汝今宜往拘尸那城告諸壯士，昨於中夜如來大師已入無餘妙涅槃界。",
        "translation": "Aniruddha then addressed Ananta, \"Now, you should go to Kuśinagara and tell the stalwarts that last midnight the Tathāgata's teacher had entered the wonderful state of nirvāṇa without remainder.",
        "source": "T24n1451_038:0400b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁等今時所應作者宜當速辦，勿為後悔。」",
        "translation": "You should do what you should do now, so you won't regret it.\"",
        "source": "T24n1451_038:0400b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復重告曰：「如來大師於汝城邑入般涅槃，爾等云何不興供養報佛慈恩？」",
        "translation": "Again, he told them, \"Since the Tathāgata entered parinirvāṇa at your town, why don't you make offerings to the Buddha in return for his kindness?\"",
        "source": "T24n1451_038:0400b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀聞是語已，即持天衣，將一苾芻以為侍者，往壯士集堂。",
        "translation": "After hearing these words, Ānanda took his celestial robes and took a monk as an attendant and went to the hall where the great men were assembled.",
        "source": "T24n1451_038:0400b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五百人先在堂處，尊者告曰：「仁等壯士及諸大眾，如來大師已於中夜入無餘依妙涅槃界。",
        "translation": "When five hundred people were first present in the hall, the venerable told them, \"Gentlemen, the great teacher and the large crowd, the Tathāgata has entered the realm of wonderful nirvāṇa without remainder during the middle of the night.",
        "source": "T24n1451_038:0400b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁等今時所應作者宜應速辦，勿生後悔。」",
        "translation": "It's appropriate for you to do what you should do now, so you don't regret it.\"",
        "source": "T24n1451_038:0400b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又重告曰：「如來大師於汝城邑入般涅槃，汝等云何不興供養報佛慈恩？」",
        "translation": "He also repeatedly told them, \"Since the Tathāgata entered parinirvāṇa at your town, why don't you make offerings to the Buddha in return for his kindness?\"",
        "source": "T24n1451_038:0400b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸壯士聞是告已，或有悶絕宛轉于地，椎胸大喚身體戰慄不能自持，或有高聲作如是語：「我於佛所曾聞是說：『世間無常悉皆離別。』」",
        "translation": "When the stalwarts heard this advice, some of them were overcome by sorrow and swoon, they beat their chests and cried out, their bodies trembling, and they were unable to control themselves, or they raised their voices and said, \"I've heard this before from the Buddha: 'The world is impermanent, and all are free from it.'\"",
        "source": "T24n1451_038:0400b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸壯士共相謂曰：「宜各齎持種種華鬘塗香末香燒香，及諸妙物音聲鼓樂，速往雙林以申供養。」",
        "translation": "The strong men then said to each other, \"It's advisable to carry with you a variety of flowers, cosmetics, scents, powdered incense, burning incense, and other wonderful things, sounds, drums, and music, and quickly go to Shuanglin to make offerings.\"",
        "source": "T24n1451_038:0400b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "并大臣輔相各與眷屬男女大小親友知識，出拘尸城詣雙林所。",
        "translation": "The minister and his assistants left Kuśinagara with their retinues, men and women, large and small, and their friends and relatives, and went to the Shuanglin place.",
        "source": "T24n1451_038:0400b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至彼已，於佛臥處師子床前盡哀情已，各持所有上妙諸香名華，無數幢幡繒綵飲食奇珍，奏諸音樂廣供養已，白阿難陀曰：「無上法王已歸圓寂，不知今者葬禮如何？」",
        "translation": "Once they arrived there, they each paid their respects in front of the lion's seat where the Buddha was lying, and after carrying all the wonderful flowers and incense, countless banners, hangings, decorations, food and drink, and exquisite treasures, and playing music to make offerings, they said to Ānanda, \"The unsurpassed Dharma king has passed away completely; I wonder what the funeral service will be like now?\"",
        "source": "T24n1451_038:0400b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者告曰：「然我先已奉佛教勅，所有葬法如轉輪王。」",
        "translation": "The venerable told him, \"Still, I've been instructed by Buddhism that all funeral practices should be like those of a wheel-turning king.\"",
        "source": "T24n1451_038:0400b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「其法如何？」",
        "translation": "He asked, \"What's the teaching?\"",
        "source": "T24n1451_038:0400b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「以白疊絮先用裹體，次以千張白疊周遍纏身，置金棺中盛滿香油，覆以金蓋積栴檀木及海岸諸香，以火焚燎。",
        "translation": "They replied, \"They first wrap a white pile of wool around their bodies, then wrap a thousand white piles around their bodies, place them in a gold coffin full of fragrant oil, cover them with a gold lid, gather sandalwood and other incense from the coast, and burn them in the fire.",
        "source": "T24n1451_038:0400b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後將牛乳澆火令滅，有餘舍利盛以金瓶，於四衢大道建窣覩波，周匝圍繞懸繒幡蓋，塗末燒香奏眾伎樂，恭敬供養設大施會。",
        "translation": "Afterward, he pours cow's milk over the fire to make it go out, fills a gold vase with the remaining relics, builds a stūpa on the four thoroughfares, surrounds it with silken banners, coats it with the finest ingredients, burns incense, plays music, pays respect to it, and offers it up for a great celebration.",
        "source": "T24n1451_038:0400b28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是輪王焚葬之法，如來大師倍勝於此。」",
        "translation": "This is the method of a wheel-turning king's funeral, and the Tathāgata's great teacher is twice as good as this.\"",
        "source": "T24n1451_038:0400c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸壯士聞是語已，白尊者曰：「我領其言，然非一、二、三日能辦此事。",
        "translation": "After the stalwarts heard those words, they said to the venerable, \"I'll take their advice, but this isn't something that can be done in one, two, or three days.",
        "source": "T24n1451_038:0400c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若至七日住者，如前所為方可成就。」",
        "translation": "If I stay here for seven days, then I'll be able to do what I did before.\"",
        "source": "T24n1451_038:0400c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「可爾。」",
        "translation": "He replied, \"That's right.\"",
        "source": "T24n1451_038:0400c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸人即便如前，依輪王葬法一一備具無有闕少，從拘尸那城周圍十二踰繕那，乃至繫冠制底，所有無量歸仰眾生咸來雲集，各持香華種種伎樂供養之具，壯士眷屬皆悉出城，詣雙樹間於師子床前，陳設所有盡心供養。",
        "translation": "Even then, as before, they prepared everything according to the Wheel-Turning King's funeral ceremony without missing a thing, and from the twelve yojanas surrounding Kuśinagara up to the tipping point of the tethered crown, an endless number of reverential sentient beings gathered here, each carrying fragrant flowers, various musical instruments, and offerings, and their strong men and retinues all left the city and went to sit between two trees in front of the lion's seat, where they made all the offerings with their hearts.",
        "source": "T24n1451_038:0400c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時壯士中有一耆宿，告諸人曰：「現在大眾，女持幢幡、男可擎輿，我等齎持種種華綵、塗香、末香、燒香及諸音樂，從拘尸那城西門而入，於東門出，度金沙河，至壯士繫冠制底勝處安置以火焚燒。」",
        "translation": "An elder among the strong men then addressed the crowd, \"Now, ladies, carry banners and streamers, and men, carry with us a variety of flowers, carvings, incense, incense burners, and music, and enter through the west gate of Kuśinagara and leave at the east gate to cross the Jinsha River to the place where the strong man wears his crown and makes his head stand out, and set it on fire.\"",
        "source": "T24n1451_038:0400c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸人聞是語已，各各爭前欲舉金棺，雖共盡力竟不能動。",
        "translation": "After hearing those words, the people each scrambled forward to lift the gold coffin, but despite their combined efforts, they couldn't move it.",
        "source": "T24n1451_038:0400c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時具壽阿難陀，白尊者阿尼盧陀曰：「拘尸那城諸壯士等，雖竭筋力竟不能動如來金棺，我今不知有何所以？」",
        "translation": "It was then that Kauṣṭhila Āniruddha said to Venerable Aniruddha, \"Those stalwarts in Kuśinagara couldn't move the Tathāgata's gold coffin even though they exerted themselves, so now I wonder what the reason is.\"",
        "source": "T24n1451_038:0400c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者告曰：「此是諸天作如斯意，欲令壯士及諸人民，女持幢幡、男捧尊輿，威儀整肅翊從如來，我等諸天共持華綵，燒眾妙香奏天伎樂廣陳供養，於西門入東門而出，度金沙河至繫冠制底，以是因緣威儀未備不能移動。」",
        "translation": "Venerable Ānanda told him, \"The gods intended this to cause the strong men and women and the people to carry banners and streamers, the men to carry mounts, and they to follow the Tathāgata in proper deportment.",
        "source": "T24n1451_038:0400c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時具壽阿難陀報尊者曰：「若如是者，可隨天意。」",
        "translation": "Gosvānta then reported to Venerable Ānanda, \"If that's the case, you can follow the gods' wishes.\"",
        "source": "T24n1451_038:0400c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸壯士即隨天願，備設如前方來持輿，即便輕舉捧戴而行。",
        "translation": "The stalwarts then complied with the gods' wish and prepared a mantle like the one they had carried before, so they carried it lightly and carried it along.",
        "source": "T24n1451_038:0400c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時空中天雨嗢鉢羅華、拘物頭華、鉢頭摩華、分陀利華，沈水末香、栴檀末香、多揭羅多摩羅末香，及曼陀羅華等。",
        "translation": "It then rained down from the heavens such as the kumbhāra flower, the kovidāra flower, the padma flower, the puṇḍarī flower, the powdered scent of sinking water, the powdered scent of sandalwood, the powdered scent of tagara-tamālā, and the mandāra flower.",
        "source": "T24n1451_038:0400c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天伎樂百千萬種，於虛空中一時俱奏，諸天華蓋其從如雲，并散天衣有盈億數。",
        "translation": "A hundred million kinds of music from the gods were played together in the sky at once, and the gods covered them with flowers like clouds and scattered heavenly garments numbering in the hundreds of millions.",
        "source": "T24n1451_038:0401a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘尸那城諸壯士等各相謂曰：「天供養已，我等應為。」",
        "translation": "The stalwarts of Kuśinagara then each said, \"After the gods make offerings, we should make them.\"",
        "source": "T24n1451_038:0401a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸壯士及餘一切貴賤男女，營辦香華威儀嚴肅，百千萬種不可勝紀，恭敬供養隨從金棺，城中而過度金沙河至繫冠制底，所散之華積至于膝。",
        "translation": "The stalwarts and all the other noble and lowly men and women then maintained their fragrant and floral displays with dignity and a hundred million incalculable kinds of respect and offerings, followed the gold coffin, crossed the Jinsha River to the bottom of the tethered crown, and spread flowers up to their knees.",
        "source": "T24n1451_038:0401a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時有一外道梵志，聞佛滅度詣娑羅林，持華數莖還波波聚落，於其中路逢大迦攝波，與五百弟子威儀整肅，將詣雙林禮大師足，遇見外道問言：「汝從何來？",
        "translation": "It was then that a foreign priest who had heard of the Buddha's passing away went to the Śālavana Grove, returned to the Bāpo village with several stalks of flowers, and met Mahākāśyapa on the road there with five hundred of his disciples in dignified manner as they approached the two groves to bow at the feet of the great teacher.",
        "source": "T24n1451_038:0401a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲向何處？」",
        "translation": "Where do you want to go?\"",
        "source": "T24n1451_038:0401a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道答曰：「我從拘尸那來，將詣波波聚落。」",
        "translation": "The heretic replied, \"I've come from Kuśinagara and will visit the village of Bāpa.\"",
        "source": "T24n1451_038:0401a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦攝波知而故問：「汝從彼來，知我大師釋迦牟尼如來四大安不？」",
        "translation": "Knowing this, Kāśyapa therefore asked, \"Have you come from there to know the four great pacifics of my teacher, Śākyamuni Tathāgata?\"",
        "source": "T24n1451_038:0401a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道答言：「我從彼來，親見大德喬答摩已入涅槃，經今七日。",
        "translation": "The non-Buddhist replied, \"I've come from there to see that the great virtuous Gautama has entered nirvāṇa for the past seven days.",
        "source": "T24n1451_038:0401a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自滅度來，所有人天皆以香華種種威儀，具申供養遺身舍利，我從彼會得此華來。」",
        "translation": "Since his extinction, all the gods have made offerings of flowers, fragrances, and various forms of decorum to the relics of his body, and I came from that congregation to obtain these flowers.\"",
        "source": "T24n1451_038:0401a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大迦攝波所將五百人中有一莫訶羅苾芻，稟性愚癡不辯好惡，聞外道語遂出麁言：「快哉！",
        "translation": "Among the 500 people Mahāśīpatra had assembled, there was a certain Mahākauṣṭhila monk who was stupid by nature and didn't discern good from evil, so he heard the words of a non-Buddhist and spoke harshly, \"How pleasant!",
        "source": "T24n1451_038:0401a17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂哉！",
        "translation": "What a joy!",
        "source": "T24n1451_038:0401a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等從今免被拘制於諸戒律，云：『此應作、此不應作。』",
        "translation": "From now on, we're freed from being restrained by the precepts, which say, 'This should be done, and this shouldn't be done.'",
        "source": "T24n1451_038:0401a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事皆息。",
        "translation": "All of these things have been put to rest.",
        "source": "T24n1451_038:0401a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今已後，能持、不持，皆由於我，可行者行，不須者棄。」",
        "translation": "From now on, it's up to me whether I can uphold or not uphold them; those who can do so will do it, and those who don't need to will discard them.\"",
        "source": "T24n1451_038:0401a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼老叟出此語時，空中諸天聞其非法，即以神力掩蔽聲響不令人聞，唯迦攝波領知斯語。",
        "translation": "When that old man spoke those words, the gods in the sky heard that they were unlawful and used their supernormal powers to muffle the sound so that no one would hear them, except Kāśyapa, who knew what he was saying.",
        "source": "T24n1451_038:0401a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時尊者為教誨彼故，即於道傍暫時停歇，與眾俱坐告言：「諸具壽！",
        "translation": "Then, for the sake of teaching them, the Venerable stopped momentarily near the path, sat down with the crowd, and said, \"All of you!",
        "source": "T24n1451_038:0401a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間諸行皆悉無常，體不堅牢是難委信，不得久存並歸散滅，宜起厭離勿生愛著。",
        "translation": "All worldly activities are impermanent, their essence isn't firm, and it's difficult to commit to faith; they can't last long and will eventually dissipate, so it's better to become disillusioned and not become attached to them.",
        "source": "T24n1451_038:0401a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且止斯事，我等速往，見佛全身各並前進。」",
        "translation": "Stopping there, we quickly go and see the Buddha's whole body as we each advance.\"",
        "source": "T24n1451_038:0401a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸壯士并四眾等，先用疊絮裹如來體，次以千張白疊周匝纏身，置香油棺覆以金蓋，各持香木如法焚燒，火不能著。",
        "translation": "The strong men and the four groups of people first wrapped a pile of wool around the Tathāgata's body, then wrapped a thousand white folds around his body, placed a casket of scented oil over a gold lid, and burned it according to the rules, so the fire wouldn't catch it.",
        "source": "T24n1451_038:0401a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿尼盧陀告阿難陀曰：「雖欲然火終無著法。」",
        "translation": "Aniruddha then told Ānanda, \"Even though I want to, the fire never gets stuck to the Dharma.\"",
        "source": "T24n1451_038:0401b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「其何故？」",
        "translation": "He asked, \"What's the reason?\"",
        "source": "T24n1451_038:0401b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「斯為諸天不令火著。」",
        "translation": "He answered, \"This is because the gods won't let the fire burn.\"",
        "source": "T24n1451_038:0401b04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復問：「何緣？」",
        "translation": "Again, he asked, \"What are the reasons?\"",
        "source": "T24n1451_038:0401b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「為大迦攝波與五百徒眾隨路而來，欲見世尊金色全身親觀焚燎，為待彼故天不令燒。」",
        "translation": "He answered, \"Mahākāśyapa and his five hundred disciples came along the road to see the Bhagavān's golden body burned in person, but the gods didn't allow it to burn because they were expecting him.\"",
        "source": "T24n1451_038:0401b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀即以此事普告眾知，須臾尊者徒眾皆至。",
        "translation": "Ananta then made this known to the crowd, and in a moment his disciples all arrived.",
        "source": "T24n1451_038:0401b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "拘尸那城諸人遙見尊者眾來，各持香華種種音樂，詣尊者所頭面禮足。",
        "translation": "The people of Kuśinagara saw the Venerable's multitude coming from afar, so they each carried a variety of flowers and music, and they bowed their heads and feet to the Venerable.",
        "source": "T24n1451_038:0401b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有無量百千大眾，隨從尊者詣世尊所，除去香木啟大金棺，千疊及絮並開解已，瞻仰尊容頭面禮足，於此時中唯有四大耆宿聲聞，謂具壽阿若憍陳如、具壽難陀、具壽十力迦攝波、具壽摩訶迦攝波。",
        "translation": "An incalculably large crowd of hundreds of thousands of people followed the Bhagavān to his place, removed the incense and wood, opened the large gold coffin, untied it with a thousand piles of floss, and venerated his features as they bowed their heads and feet.",
        "source": "T24n1451_038:0401b09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然摩訶迦攝波有大福德多獲利養，衣鉢藥直觸事有餘，尊者作念：「我今自辦供養世尊。」",
        "translation": "Still, Mahākāśyapa had great merit and had received many benefits, and there was more than enough clothing, bowls, medicine, and direct contact, so the venerable thought, \"Now, I'll make my own offerings to the Bhagavān.\"",
        "source": "T24n1451_038:0401b14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即辦白疊千張及白疊絮，先以絮裹後用疊纏，置金棺中傾油使滿，覆以金蓋積諸香木退住一面。",
        "translation": "He then prepared a thousand white piles of wadding, wrapped them first in wadding, then wrapped them in piles, placed them in a gold coffin, filled them with oil, covered them with a gold lid, and placed incense and wood on one side.",
        "source": "T24n1451_038:0401b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由佛餘威及諸天力，所有香木自然火起。",
        "translation": "Thanks to the Buddha's remaining authority and the power of the gods, all the fragrant wood naturally caught fire.",
        "source": "T24n1451_038:0401b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀右繞火積說伽他曰：「如來妙體歸圓寂，　　自然火起燎餘身；　唯留內外一雙全，　　所有千衣隨火化。」",
        "translation": "Ānanda then circled the fire pile to his right and spoke to it, saying, \"The Tathāgata's marvelous body returns to perfect extinction, and the fire naturally rises to burn the rest of his body; only the inner and outer parts are whole, and his thousand robes are transformed by the fire.\"",
        "source": "T24n1451_038:0401b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時拘尸那城諸壯士等，欲以牛乳注火令滅，未瀉之頃其火積中忽生四樹：一、金色乳樹，二、赤色乳樹，三、菩提樹，四、烏曇跋樹，於此樹中乳自流出令火皆滅。",
        "translation": "It was then that the stalwarts of Kuśinagara wanted to pour cow's milk into the fire to make it go out, but before they could pour it, four trees suddenly grew up in the fire-pile: 1. a golden milk tree, 2. a red milk tree, 3. a bodhi tree, and 4. a udumbara tree, from which milk spontaneously flowed out to make the fire go out.",
        "source": "T24n1451_038:0401b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時拘尸那城諸貴賤等，共收舍利盛金瓶中置七寶輿上，以種種香華栴檀沈水塗香、末香、燒香、繒蓋、幢幡，音聲伎樂廣陳供養，舁入城中安妙堂上，復更如前盛興供養。",
        "translation": "The noble and base people of Kuśinagara then gathered the relics, put them in a golden vase on a palanquin made of seven jewels, and made offerings of various kinds of fragrant flowers, sandalwood, sunken water, perfume, burning incense, silken canopies, banners, and music, carried them into the city, placed them in a wonderful hall, and then made offerings to them in full bloom as before.",
        "source": "T24n1451_038:0401b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時波波聚落諸壯士等，聞佛世尊於拘尸那城入般涅槃已經七日，無量人天廣陳供養，於其聚落總集四兵，象馬車步各自嚴辦種種器仗，共詣拘尸那城欲分舍利。",
        "translation": "It was then that a group of stalwarts from the village of Bopā heard that it had been seven days since the Bhagavān had entered parinirvāṇa in Kuśinagara and that measureless people and gods had made extensive offerings to him, so they gathered together in their village a group of four soldiers, elephants, horses, chariots, and footsteps, each decorated with a variety of weapons, and went to Kuśinagara with the intention of sharing the relics.",
        "source": "T24n1451_038:0401c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至城已報諸人曰：「無上法王眾生慈父，我等諸人比於長夜供養恭敬，親承訓導受持正法。",
        "translation": "When they arrived, they reported to them, \"The unsurpassed Dharma king is the loving father of sentient beings, and we have been like you and I for a long time, making offerings and venerating him, accepting his instructions, and upholding the right teaching.",
        "source": "T24n1451_038:0401c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今既滅度，有餘舍利我等欲取，將往波波聚落，建窣覩波安置供養。」",
        "translation": "Now that we've been extinguished, we'd like to take the rest of the relics and will go to the village of Popo and build a stūpa to house our offerings.\"",
        "source": "T24n1451_038:0401c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中諸人聞斯告已咸作是言：「世尊導師是我慈父親承訓誘，既於我界而般涅槃，全身舍利應留永劫於此供養，終不分與外邑諸人。」",
        "translation": "After the people in the city heard this advice, they all said, \"The Bhagavān, the guide is my loving father who was intimately instructed and guided, and since he passed away in our realm, the whole body of his relics should be kept here for an eternity as an offering, never to be shared with people outside the town.\"",
        "source": "T24n1451_038:0401c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波波人遣使答曰：「若分者善；如不與者，我等當以強力奪取。」",
        "translation": "The Bāpas then sent an envoy to reply, \"It's good if you share it; if you don't, we'll take it by force.\"",
        "source": "T24n1451_038:0401c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城人聞已告彼眾曰：「徒事鬪戰，終不可得。」",
        "translation": "After the townspeople heard this, they told the others, \"We'll never get it by fighting in vain.\"",
        "source": "T24n1451_038:0401c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時遮洛迦邑、部魯迦邑、阿羅摩邑、吠率奴邑、劫比羅城諸釋迦子、薜舍離栗姑毘子悉皆來集。",
        "translation": "It was then that the Śākya sons and the Śākya Lumbinī sons of the cities of Cālaka, Puruṣapura, Arāma, Vaiśravaṇa, and Kapila all gathered there.",
        "source": "T24n1451_038:0401c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時摩伽陀國未生怨王，既聞佛世尊於拘尸那城入般涅槃，一切人天廣設供養。",
        "translation": "At the time, the unborn feuding king of Magadha heard that the Bhagavān had entered parinirvāṇa in Kuśinagara and that all the people and gods had made offerings.",
        "source": "T24n1451_038:0401c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既聞是事生大憂苦，遂告行雨大臣曰：「卿今知不？",
        "translation": "When he heard about this, he became very sad and distressed, so he told the minister of the rain, \"Do you know about it now?",
        "source": "T24n1451_038:0401c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞世尊已入涅槃，在拘尸城大興供養，為爭舍利諸處競來欲相侵奪，我今亦往請取身骨。」",
        "translation": "I've heard that the Bhagavān has entered nirvāṇa and is making offerings in Kuśinagara, and since they're competing for the relics and want to plunder them, I'm also going there to ask for his bones.\"",
        "source": "T24n1451_038:0401c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣曰：「如是，應裝整兵便往拘尸那城。」",
        "translation": "The minister said, \"Thus, you should assemble your troops and go to Kuśinagara.\"",
        "source": "T24n1451_038:0401c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時未生怨王遂乘大象欲往佛所，纔昇象上念佛恩深，心便悶絕從象墜墮宛轉于地，良久乃酥便乘馬去，念佛恩故不能抑止，還墮于地久穌息已，告行雨大臣曰：「我今不能親往佛所，卿等今者可領四兵，往拘尸那城傳我言教，問訊壯士少病小惱、起居輕利、安樂行不？",
        "translation": "After rising on the elephant, he remembered the depth of the Buddha's kindness, then he became despondent, fell off the elephant, and reeled to the ground. After a long time, he then gave up his horse and departed, unable to stop himself because of the Buddha's kindness.",
        "source": "T24n1451_038:0401c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『世尊在日接引我等，長夜慇懃是我大師。",
        "translation": "'The Bhagavān guided us in the past and was our great teacher for a long time.",
        "source": "T24n1451_038:0401c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今於仁等聚落入般涅槃，有遺舍利幸與一分，於王舍城作窣覩波，冀申敬重香華伎樂種種供養。』」",
        "translation": "Now, as we enter parinirvāṇa in our village, we're honored to have a portion of the remaining relics to make a stūpa in Rājagṛha, in hopes of showing respect and making various offerings with flowers, music, and incense.'\"",
        "source": "T24n1451_038:0402a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行雨白言：「如王教勅。」",
        "translation": "Xing Yu said, \"As the king has instructed,\"",
        "source": "T24n1451_038:0402a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即嚴四兵詣拘尸那城，告諸壯士曰：「仁等咸聽！",
        "translation": "He then sent four of his soldiers to the city of Kuśinagara and told the strong men, \"Listen, you people!",
        "source": "T24n1451_038:0402a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩伽陀國未生怨王，問訊仁等具說如前，世尊大師於我等輩，常為饒益令得安樂，可尊可敬。",
        "translation": "The unborn resentful king of Magadha asked you, Sir, to explain in detail how the Bhagavān, the great teacher, has always been helpful to us and made us comfortable, honorable, and venerable.",
        "source": "T24n1451_038:0402a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者於仁聚落入般涅槃，有遺舍利幸當與分，於王舍城建窣覩波廣興供養。」",
        "translation": "Now, when Ren's colony enters parinirvāṇa, we're honored to share the relics that remain with him and build a stūpa in Rājagṛha to make offerings.\"",
        "source": "T24n1451_038:0402a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸壯士曰：「世尊誠是饒益安樂一切群生，可尊可敬。",
        "translation": "The stalwarts said, \"The Bhagavān truly benefits and pleases all sentient beings, and it's honorable and venerable.",
        "source": "T24n1451_038:0402a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然於今者在我聚落入般涅槃，有遺舍利王欲見分，此誠難得。」",
        "translation": "Still, now that he's entered parinirvāṇa in our village, there's a legacy that King Śāri wants to see, but that's really difficult to obtain.\"",
        "source": "T24n1451_038:0402a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時行雨臣告諸壯士曰：「若其仁等能與者善，如不見分我加兵力強奪將去。」",
        "translation": "The rainmaker then told the strong men, \"If those kind people can give it to him, that's good; if they don't see their part, I'll force my troops to take it away.\"",
        "source": "T24n1451_038:0402a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「任意。」",
        "translation": "They replied, \"At will.\"",
        "source": "T24n1451_038:0402a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸人眾悉皆大集闐噎城隅，城中所有壯士男女並閑弓射，即便總出象馬車步，嚴整四兵欲共七邑兵交合戰。",
        "translation": "It was then that a large crowd of people gathered at the edge of the city of Khotan, and all the strong men and women in the city gathered together with elephants, horses, chariots, and foot soldiers, and they solemnly arranged their four armies in order to engage the soldiers of the seven towns in battle.",
        "source": "T24n1451_038:0402a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶雜事卷第三十八",
        "translation": "Mūlasarvâstivāda-vinaya-kṣudraka-vastu, vol. 38",
        "source": "T24n1451_038:0402a17_0",
        "is_bad_quality": false
    }
]