[
    {
        "source_sentence": "佛說沙彌十戒儀則經(計七十二頌)西天譯經朝散大夫試鴻臚少卿傳法大師臣施護奉　詔譯　頂禮一切智，　　妙法及聖眾，　略說沙彌行，　　令發出家心。",
        "translation": "Sutra on the Ten Regulations for Śrāmaṇeras (72 verses) Translated from the Western Paradise by the Imperial Decree, the court adjutant general, the junior minister of Hongluo, and the transmitter of the Dharma, Minister Shihu, paid homage to omniscience, the wonderful Dharma, and the noble ones by briefly explaining the practice of Śrāmaṇeras and causing them to give rise to the intention to leave home.",
        "source": "T24n1473_001:0935b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　於彼釋迦教，　　堅持於禁戒，　持戒如護身，　　防守勿令犯。",
        "translation": "In that Śākyamuni teaching, he adheres to the precepts, observes them as he guards himself, and guards himself against transgressions.",
        "source": "T24n1473_001:0935b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　夜臥從早起，　　淨口及牙齒，　念誦至天明，　　頂禮正等覺。",
        "translation": "He rises from bed at night and rises early in the morning, purifies his mouth and teeth, recites the precepts until dawn, and pays homage to the perfectly enlightened.",
        "source": "T24n1473_001:0935b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　參近於師房，　　以手輕擊門，　入已問訊師，　　身體安樂不？",
        "translation": "Approaching the teacher's room, he strikes the door with his hand and asks the teacher after entering, \"Is his body comfortable?",
        "source": "T24n1473_001:0935b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如是所作已，　　復作曼拏羅，　供養而恭敬，　　早晨觀水內，　中後時亦然，　　甕器盂鉢等。",
        "translation": "\"After doing so, he again makes a maṇḍala, offering it up in respect, observing the water inside in the morning and likewise in the afternoon and evening, such as an urn, a bowl, and so forth.",
        "source": "T24n1473_001:0935b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　水蟲有大小，　　志心恒觀照，　以羅淨濾水，　　審觀而可用。",
        "translation": "\"Whether a water bug is large or small, his mind always observes it, purifying the water with a laver, and he carefully observes and makes it available.",
        "source": "T24n1473_001:0935b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　食飲懷慈愍，　　勿令殺害蟲，　乃至草木上，　　塗壇牛糞中，　如是受用時，　　救護於含識。",
        "translation": "When he eats and drinks with kindness and compassion, he doesn't allow harmful insects to be killed, even on grass and trees, or when he smeared altars and cow dung with it, he protects the contained consciousness when he thus enjoys it.",
        "source": "T24n1473_001:0935b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或彼床座內，　　田地糞土中，　一一子細觀，　　是名出家行。",
        "translation": "Perhaps it's inside a bed or seat, or in the dung of a field, and each child carefully observes it, which is called the religious practice of renunciant monks.",
        "source": "T24n1473_001:0935b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切承事師，　　洗鉢令清淨，　依時三作禮，　　合掌向師前。",
        "translation": "He serves his teacher, washes his bowl to make it clean, pays homage three times in accordance, and joins his palms in front of his teacher.",
        "source": "T24n1473_001:0935b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　問師何所食？",
        "translation": "He asks his teacher what he's eating.",
        "source": "T24n1473_001:0935b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　作食治飢病，　如是若為食，　　用前清淨水，　以水灌手淨，　　如法默然食。",
        "translation": "\"Suppose he prepares food to treat hunger and sickness, thus eating with clean water from before, purifies his hands with the water, and eats in silence according to the teaching.",
        "source": "T24n1473_001:0935b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　食已說二偈，　　迴向於信施，　如說而依行，　　增長正念行。",
        "translation": "After he eats, he explains two verses, dedicating his mind to faithful giving, acting according to what's said, and increasing his practice of right mindfulness.",
        "source": "T24n1473_001:0935c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　信解淨戒法，　　依法而修持，　正觀自相應，　　出家心安樂。",
        "translation": "Understanding the pure precepts with faith, they cultivate their observance in accordance with the Dharma, correctly observe their own association, and leave home with a peaceful mind.",
        "source": "T24n1473_001:0935c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若人自犯戒，　　他見生輕毀，　二人皆得罪，　　持者須一心。",
        "translation": "If someone violates the precepts on their own, and others see it and despise it, both will be sinned against, and the holder must be unified in mind.",
        "source": "T24n1473_001:0935c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　持戒或破戒，　　乃至病患人，　說法不當機，　　他聞心不重，　命終得大苦。",
        "translation": "Whether a person upholds or breaks the precepts, even a sick person who teaches the Dharma improperly and whose mind isn't heavy when others hear it, they'll experience great suffering at the end of their life.",
        "source": "T24n1473_001:0935c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人行毒藥，　及行呪法等，　　令他得命終，　又復以種種，　　方便而行殺，　如是破戒因，　　永沈三惡道，　地獄鬼畜生，　　如次受罪報。",
        "translation": "If a person practices poison, administers a spell, or so forth, so that another person's life ends, and then kills them with various methods, such are the causes of breaking the precepts, which permanently sink them into the three evil destinies, and they're subject to the results of their crimes in hell, ghosts, and animals.",
        "source": "T24n1473_001:0935c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　及彼諸天輩，　　若或亦殺生，　還墮惡趣中，　　受彼諸惡報。",
        "translation": "If some of those gods also kill beings, they'll fall back into a bad rebirth and receive the results of those bad deeds.",
        "source": "T24n1473_001:0935c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有出家者，　　恣用身口意，　誤殺螻蟻類，　　於其三業中，　而得三種罪。",
        "translation": "If a renunciant uses his body, speech, and mind carelessly to accidentally kill an ant, that would result in three kinds of crimes in his three actions.",
        "source": "T24n1473_001:0935c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若人以拳棒，　土石及塼瓦，　　打擲於有情，　駝騾禽獸等，　　亦得破戒罪。",
        "translation": "If a person throws a fist, stick, or block of dirt or tile at a sentient being, such as a camel, mule, or animal, that animal also commits the sin of violating the precepts.",
        "source": "T24n1473_001:0935c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　駝騾象馬類，　　而欲輒乘騎，　往來逼迫他，　　亦得破戒罪。",
        "translation": "A camel, mule, elephant, or horse that wants to ride easily and comes to oppress others is also guilty of violating the precepts.",
        "source": "T24n1473_001:0935c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有出家者，　　不得行偷盜，　若自若教他，　　偷得於財物，　迦哩沙波拏，　　四分中一分，　如是破戒因，　　而成最重罪。",
        "translation": "If a renunciant doesn't steal, and if he himself or teaches others to steal property, kārṣāpaṇa, which is one of the four parts of the precepts, this is a cause for breaking the precepts, which is the most serious offense.",
        "source": "T24n1473_001:0935c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　飲食穀米等，　　花菓草木類，　地生或水生，　　而行於偷竊，　或偷官稅利，　　私過於關律，　及盜於有情，　　二足與多足。",
        "translation": "They may steal food, grain, rice, flowers, fruits, plants, trees, or things that are grown on earth or in water, or they may steal government taxes or profits, go beyond the rules and regulations, and steal from sentient beings, whether two or many-footed.",
        "source": "T24n1473_001:0935c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或彼出家人，　　受用雖具足，　貪心復盜財，　　俱獲於重罪。",
        "translation": "Perhaps a monk has an adequate supply of food and shelter, but he steals property with greed, which is a serious offense.",
        "source": "T24n1473_001:0936a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若自衣鉢等，　　被賊所劫盜，　勿得強取之，　　說法方便化，　或復而迴買，　　不允隨他意。",
        "translation": "If his own clothing or bowl is stolen by thieves, don't force him to take it, teaching him the Dharma and teaching him skillfully, or buy it back again, not allowing him to follow the wishes of others.",
        "source": "T24n1473_001:0936a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是名出家心，　　不動三業瘡，　戒性自成就。",
        "translation": "This is called a renunciant's mind, which doesn't budge from the sores of the three activities and accomplishes the nature of morality on its own.",
        "source": "T24n1473_001:0936a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有出家者，　不得行婬欲。",
        "translation": "If there are renunciant monks, they mustn't engage in sexual misconduct.",
        "source": "T24n1473_001:0936a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　女男及黃門，　自來相慕欲，　　愚迷而愛著，　得彼根本罪。",
        "translation": "Women, men, and the yellow market have longed for each other since then, and foolishly clung to them, acquiring their fundamental sins.",
        "source": "T24n1473_001:0936a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若彼故行婬，　如蛇如毒藥，　　損壞於自身，　得大地獄苦，　　障礙於涅槃，　不出於生死。",
        "translation": "If they thus engage in sexual misconduct, they're like snakes and poison that damage themselves, cause suffering in the great hells, obstruct nirvāṇa, and don't escape birth-and-death.",
        "source": "T24n1473_001:0936a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　正覺非如是，　未曾身犯戒，　　持戒獲大利。",
        "translation": "Correctly enlightened people aren't like this; they've never personally violated the precepts and have gained great rewards from observing them.",
        "source": "T24n1473_001:0936a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有出家者，　　不得出妄語。",
        "translation": "If there are renunciant monks, they mustn't utter false words.",
        "source": "T24n1473_001:0936a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若言見天人，　　與我同言語，　大人所住處，　　我自亦曾到，　乃至乾闥婆，　　恭伴龍夜叉，　摩睺羅伽輩，　　毘舍緊那羅，　鉢哩哆鬼等，　　與我恒言話，　此皆為妄語。",
        "translation": "If someone says they see gods and humans who speak with me, or that I've been to places where great men live, even to the extent that they're like a gandharva, a goddess who respects dragons and yakṣas, a mahoraga, a piśākinara, or a pārijāta demon, and they're always talking to me, they're all speaking falsely.",
        "source": "T24n1473_001:0936a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　或言得五通，　正道及四果，　　曉了甚深法，　未得言為得，　　如斯之妄語，　永沈於惡趣。",
        "translation": "Sometimes they say they've attained the five supernormal powers, the right path, and the four fruits, and they understand the profound Dharma, but they say they've attained it before, so they speak falsely, and they're permanently sunken in a bad destiny.",
        "source": "T24n1473_001:0936a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不得起兩舌，　離別他善友，　　及彼麁惡言，　綺說非與是。",
        "translation": "They mustn't develop duplicity, separate themselves from other good friends, or speak harshly, or speak fancifully about what's not true.",
        "source": "T24n1473_001:0936a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　設被他毀罵，　勿得酬對他，　　種種鬪諍言，　一一須忍受。",
        "translation": "If someone ridicules them, don't respond to them, and you must endure each of the various kinds of fighting words.",
        "source": "T24n1473_001:0936a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若彼不依行，　而得犯戒罪；　　智者一心持，　獲離口業過。",
        "translation": "If someone doesn't follow the practice, they'll commit a violation of the precepts; a wise person single-mindedly observes them and is freed from the transgression of verbal action.",
        "source": "T24n1473_001:0936a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若以穀米等，　為酒醉於人，　　不得而故飲。",
        "translation": "Suppose he makes wine out of grains and rice to get people drunk, and then he doesn't get to drink it because he can't.",
        "source": "T24n1473_001:0936b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或以甘蔗花，　　蒲萄菓實等，　修醞可醉人，　　不得而故飲。",
        "translation": "Perhaps he uses flowers of sugarcane or fruit of bushels of grapes, etc., to cultivate a drink that will intoxicate people, but he doesn't drink it because he can't.",
        "source": "T24n1473_001:0936b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自飲教他飲，　　迷亂而失念，　增長放逸心，　　飲者得重罪。",
        "translation": "Drinking by oneself and teaching others to drink, they become confused and lose mindfulness, increase carelessness, and commit serious crimes when they drink.",
        "source": "T24n1473_001:0936b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是故世尊言，　　若人以草葉，　滴酒於口中，　　增長於過失。",
        "translation": "Therefore, the Bhagavān says, \"If someone puts a drop of wine in their mouth from a blade of grass, it will increase their faults and errors.",
        "source": "T24n1473_001:0936b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　歌舞兼倡妓，　　故往而觀看，　而得犯戒罪。",
        "translation": "He sings, dances, and plays the courtesan, so he goes and watches, and it's a violation of the precepts.",
        "source": "T24n1473_001:0936b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　香油塗飾身，　旃檀欝金等，　　及以好花鬘，　金銀珠寶類，　　種種莊嚴身，　而得犯戒罪。",
        "translation": "They adorn their bodies with scented oil, sandalwood, gold, and so forth, fine flowers, and gold, silver, jewelry, and various other things, and it's a violation of the precepts.",
        "source": "T24n1473_001:0936b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若於眼目上，　點畫令端正，　　而得犯戒罪。",
        "translation": "If someone dots and paints the eyes to make them straight, it's a violation of the precepts.",
        "source": "T24n1473_001:0936b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　座床臥床等，　　量高可一肘，　亦不作莊嚴，　　復不令廣大，　放逸不依行，　　而得犯戒罪。",
        "translation": "A seat or bed that's an elbow's height or so forth isn't adorned and isn't made large, and it's a violation of the precepts if it's done carelessly and not relied upon.",
        "source": "T24n1473_001:0936b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　佛說出家人，　　過失宜遠離。",
        "translation": "The Buddha teaches that renunciant monks should avoid faults and errors.",
        "source": "T24n1473_001:0936b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若受齋食時，　　不得過中午，　日出至午前，　　可許受齋飯；　非時而喫食，　　佛說得重罪。",
        "translation": "If a monk takes a meal of purification no later than noon and allows the meal to be taken between sunrise and noon, then eating at an ungodly hour is a serious offense according to the Buddha.",
        "source": "T24n1473_001:0936b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　如有比丘病，　　治病救於身，　可許中後食；　　無病不依時，　而得犯戒罪。",
        "translation": "If a monk is ill and is treated to save his body, he's allowed to eat after noon; when he's not ill and doesn't rely on it, he commits a violation of the precepts.",
        "source": "T24n1473_001:0936b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　金銀珍寶等，　出家不得觸，　　受者生於貪，　而得犯戒罪。",
        "translation": "Such things as gold, silver, and treasure are not to be touched by renunciant monks, and accepting them gives rise to craving, which is a violation of the precepts.",
        "source": "T24n1473_001:0936b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若有檀信施，　供養佛法僧，　　為彼興福利，　可許而受用。",
        "translation": "If someone gives generously and faithfully to the Buddha, Dharma, and Saṃgha, they'll be permitted to use it for their welfare.",
        "source": "T24n1473_001:0936b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　一切快樂具，　勿得生愛著，　　若有貪著者，　彼人須擯出。",
        "translation": "Don't become attached to all the implements of pleasure, and if you become attached to them, you must cast them out.",
        "source": "T24n1473_001:0936b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所有戲笑等，　沙彌不得作，　　作者得犯罪。",
        "translation": "Such things as play and laughter must not be done by a monk, and the author will commit a crime.",
        "source": "T24n1473_001:0936c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若有呵欠時，　　以手遮蓋口，　不依而得罪。",
        "translation": "If he covers his mouth with his hand when he yawns, he'll be guilty of not complying.",
        "source": "T24n1473_001:0936c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　上座作啑噴，　不審而頂禮，　　新戒等啑噴，　上座須呪願，　　長壽無其病。",
        "translation": "If a superior makes a foul noise, prostrates without examination, or makes a foul noise like a new preceptor, the superior must curse and vow for a long life without illness.",
        "source": "T24n1473_001:0936c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙彌向師前，　　不得於洟唾，　不得刷牙齒。",
        "translation": "When a novice goes before a teacher, he mustn't salivate or brush his teeth.",
        "source": "T24n1473_001:0936c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　不得向師前，　經行及對座。",
        "translation": "They mustn't go over to their teacher, walk around, or sit across from him.",
        "source": "T24n1473_001:0936c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　耆年宿德者，　如法而尊重。",
        "translation": "Those of advanced years and years of virtue should respect the teacher according to the rules.",
        "source": "T24n1473_001:0936c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若入觸溷時，　如有後來者，　　低聲而警覺。",
        "translation": "When he enters a latrine, if there's someone who comes after him, he lowers his voice and alerts himself.",
        "source": "T24n1473_001:0936c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所濾無蟲水，　　用添於淨瓶，　淨手安詳行，　　不失出家行。",
        "translation": "The water that's filtered is insect-free, so he fills it with pure water and walks quietly with clean hands, not losing his religious practice.",
        "source": "T24n1473_001:0936c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　師自座臥床，　　恒用淨襯褥，　所有床椅等，　　不得沙彌座。",
        "translation": "The teacher himself sits on a bed, always uses a clean mat, and doesn't allow any śrāmaṇeras to sit on his bed or chair.",
        "source": "T24n1473_001:0936c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　師自若不在，　　依止清淨僧，　明了律儀者，　　承事而侍奉；　勿更依別僧，　　違者而得罪。",
        "translation": "If the teacher himself is absent, he must rely on a pure monk who understands the rules and regulations and serves him; don't rely on another monk, for he'll be offended if he disobeys.",
        "source": "T24n1473_001:0936c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　比丘若出行，　　而為求緣事，　五日內復歸，　　得利同行眾；　眾得利亦然，　　復與外來者，　如過五日後，　　二俱各無分。",
        "translation": "If a monk goes on a journey and seeks an object, he returns within five days and obtains a benefit from the company of his fellow monks; the same goes for those who obtain a benefit, and he returns with those who come from outside, for after five days, they'll both have no part.",
        "source": "T24n1473_001:0936c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　沙彌大小便，　　須問佛僧地，　不得亂往來，　　行依自界分。",
        "translation": "When a monk relieves himself, he must ask the Buddha and the saṃgha for permission to go to and fro in disorder, and his actions are based on his own level.",
        "source": "T24n1473_001:0936c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切凡所作，　　合掌先問師，　如是所作為，　　不失於正行。",
        "translation": "Whenever he does anything, he joins his palms and asks the teacher first, thus performing an action that doesn't lose its proper conduct.",
        "source": "T24n1473_001:0936c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　日沒禮佛塔，　　禮已復問師，　與師濯雙足，　　事畢一心聽，　顒望於所須。",
        "translation": "When the sun rises, he venerates the stūpa, asks his teacher again after paying homage, washes his feet with his teacher, listens with one mind after the deed is done, and looks out for what's needed.",
        "source": "T24n1473_001:0936c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　初夜及後夜，　持誦勿須停。",
        "translation": "During the early and latter portions of the night, he doesn't need to stop chanting.",
        "source": "T24n1473_001:0937a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　中夜睡眠時，　如彼師子臥。",
        "translation": "During the middle of the night when he's asleep, he'll be like that lion lying down.",
        "source": "T24n1473_001:0937a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　所說一切法，　志心而依行，　　薰識賢種子，　煩惱自斷除，　　速成無上覺。",
        "translation": "Willingly following and practicing all the teachings that are presented, they perfume the seeds of goodness in their consciousness, cut off their own afflictions, and quickly become unsurpassedly enlightened.",
        "source": "T24n1473_001:0937a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說沙彌十戒儀則經",
        "translation": "Foshuo shamisen shishi yizhengyi jing",
        "source": "T24n1473_001:0937a06_0",
        "is_bad_quality": false
    }
]