[
    {
        "source_sentence": "根本說一切有部毘奈耶藥事",
        "translation": "Mūlasarvâstivāda Vinaya",
        "source": "T24n1448_010:0042c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷第十",
        "translation": "Volume 10",
        "source": "T24n1448_010:0042c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏義淨奉　制譯",
        "translation": "Translation of the Tripiṭaka of the Great Tang by Yijing Feng",
        "source": "T24n1448_010:0042c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "儞羅步提緣",
        "translation": "Nīlaputta's conditions",
        "source": "T24n1448_010:0042c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊於勇軍人間遊行，漸至末土羅城。",
        "translation": "It was then that the Bhagavān traveled among the brave soldiers and gradually reached the city of Mathurā.",
        "source": "T24n1448_010:0042c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中淨行婆羅門等，聞喬答摩沙門到末土羅城，彼極讚說，照耀覺悟，安住分析開示顯現，四種人等清淨之法：「彼喬答摩沙門若入此城，我輩利養決定斷除。",
        "translation": "When those Brāhmaṇas of pure practices heard that Gautama the Salmon had arrived in Mathurā, they praised him highly, illuminated his awakening, and calmly analyzed, revealed, and showed him the four kinds of people and other pure things, \"If that Gautama the Salmon were to enter this city, our gains would surely be eliminated.",
        "source": "T24n1448_010:0042c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞喬答摩沙門，有不尊重處，而不遊行。",
        "translation": "I've heard that Gautama the esoteric has a place of disrespect and doesn't march.",
        "source": "T24n1448_010:0042c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此若有人於彼喬答摩不生尊重，彼定不入末土羅城。",
        "translation": "If someone there doesn't respect that Gautama, they certainly won't enter the city of Mathurā.",
        "source": "T24n1448_010:0042c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若令下劣人等往彼輕慢，恐畏喬答摩心，不將為事；若有上首勝人，不生尊重，輕欺喬答摩，此應甚善。",
        "translation": "If we allow inferior people to go there and despise them, fearing Gautama's attitude, they won't do anything, and if there's a superior person who doesn't show respect and despises Gautama, that would be very good.",
        "source": "T24n1448_010:0042c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等眾中，誰為上首？」",
        "translation": "Among us, who is the best?\"",
        "source": "T24n1448_010:0042c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時末土羅城中，有一婆羅門名曰儞羅步提，通達四明四薜陀論，能顯己宗、摧壞他宗，所出言辭隨實而轉。",
        "translation": "It was then that there was a Brāhmaṇa named Nīlaputra in Mathurā who was well-versed in the four sciences and four siddhânta treatises, could express his own views and undermine the views of others, and whose words were transformed according to reality.",
        "source": "T24n1448_010:0042c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時末土羅婆羅門等眾共集會，往儞羅步提所，而即白言：「鄔波馱耶！",
        "translation": "At the time, a group of Brāhmaṇas from Mathurā gathered together and went to Nīlaputī, who then said, \"Udayana!",
        "source": "T24n1448_010:0042c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等既聞喬答摩沙門來於此城，彼極讚說，照耀覺悟，安住分析，開示顯現，四種人等清淨之法。",
        "translation": "\"We've heard that the Gautama ascetic came to this city, and he gave us great praise for shining enlightenment, abiding in analysis, and revealing the four kinds of people and other pure dharmas.",
        "source": "T24n1448_010:0042c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼喬答摩，有不尊重處心不樂往。",
        "translation": "Still, there's a place in Gautama's heart that he doesn't respect and doesn't want to visit.",
        "source": "T24n1448_010:0042c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人等，於彼喬答摩不生尊重，彼定不入末土羅城。",
        "translation": "If someone like that doesn't respect that Gautama, they certainly won't enter the city of Mathurā.",
        "source": "T24n1448_010:0042c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若令下劣人等，往彼輕慢，恐畏喬答摩心，不將為事；若有上首勝人不生尊重，輕欺喬答摩，此應甚善。",
        "translation": "If we allow inferior people to go there and despise them, fearing Gautama's attitude, they won't do anything, and if a superior person doesn't show respect and deceives Gautama lightly, that would be very good.",
        "source": "T24n1448_010:0042c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除鄔波馱耶，豈復更有上首之人能辦斯事？",
        "translation": "How could there be another superior person besides (Skt. upādhyāya) who could do such a thing?",
        "source": "T24n1448_010:0042c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願於彼作不尊重，以言罵辱。」",
        "translation": "Only wishing to show disrespect for them, I would insult them with words.\"",
        "source": "T24n1448_010:0042c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時儞羅步提報諸人曰：「我舌隨意而轉，若堪罵辱，我即罵辱；若堪讚歎，我即讚歎。」",
        "translation": "Nirarbhuti then told the others, \"I'll do as I like with my tongue, insulting if I can and praising if I can.\"",
        "source": "T24n1448_010:0042c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時儞羅步提及與耆舊諸婆羅門等，前後圍遶詣世尊所。",
        "translation": "Nīlaputra and the older brāhmaṇas then surrounded him and went to the Bhagavān.",
        "source": "T24n1448_010:0043a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時儞羅步提婆羅門遙見世尊具三十二大丈夫相、八十隨好而自莊嚴，圓光一尋超過千日，猶如寶山周匝善現，威儀寂靜坐一樹下。",
        "translation": "The Brāhmaṇas of Nīlaputta then saw the Bhagavān adorned with the thirty-two great characteristics and eighty minor features, whose circular radiance extended beyond a thousand suns, like a mountain of treasures well-produced all around, and whose demeanor was serene as he sat under a tree.",
        "source": "T24n1448_010:0043a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "儞羅步提見世尊已，心生踊躍，便即讚言：「儞羅大歡喜，　　讚仙一切智；　今說勝功德，　　人聞皆愛樂。",
        "translation": "After seeing the Bhagavān, Nīlaputra's heart leapt, and he praised him, \"Nīlaputra is overjoyed, praising the sage's omniscience; now, when he teaches about his excellent qualities, people love what they hear.",
        "source": "T24n1448_010:0043a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善調伏諸根，　　如法淨身意；　廣大功德海，　　我今略讚歎。",
        "translation": "Well disciplined in their faculties, they purify their bodies and minds according to the teaching; now I'll offer a brief praise of the vast ocean of merit.",
        "source": "T24n1448_010:0043a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　論義中第一，　　調伏無過失；　能知第一義，　　擊論不能動。",
        "translation": "He's the best among treatises in terms of meaning, taming them without error, and knowing the supreme meaning, he's unmovable when he attacks the debate.",
        "source": "T24n1448_010:0043a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　明行得圓滿，　　善達諸禁戒；　勝定如山王，　　力等那羅延。」",
        "translation": "Their knowledge and conduct are perfected, and they well understand the prohibitions and precepts; their concentration is like a mountain king, and their strength is equal to that of Narayan.\"",
        "source": "T24n1448_010:0043a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是為首，以五百頌讚歎世尊已。",
        "translation": "Thus, he led them in praising the Bhagavān with five hundred verses.",
        "source": "T24n1448_010:0043a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知彼婆羅門心生深信，便為說法，於此座下證真諦理。",
        "translation": "Knowing that this Brāhmaṇa had become deeply convinced, the Bhagavān then preached to him and realized the true truth while he was sitting here.",
        "source": "T24n1448_010:0043a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時儞羅讚世尊已，便即辭去，却還本城。",
        "translation": "After he praised the Bhagavān, Nīlapatra left and returned to his home city.",
        "source": "T24n1448_010:0043a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時城中諸耆舊婆羅門等，知儞羅步提讚歎世尊，作種種美語，而便訶責儞羅曰：「我等先求鄔波馱耶往喬答摩沙門所作不尊重言，何故於彼反為善讚？」",
        "translation": "Knowing that Nīlotiputra had praised the Bhagavān and spoken various beautiful words, the senior brāhmaṇas in the city reprimanded Nīlotiputra, saying, \"Why did we ask Upāya to go to Gautama and tell the brāhmaṇas what was disrespectful, and why did we praise him favorably?\"",
        "source": "T24n1448_010:0043a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時儞羅步提告婆羅門曰：「我豈先不說如是言：『然我舌根隨意而轉。",
        "translation": "Nirarbhuti then told the Brāhmaṇa, \"Did I not first say something like this, 'Still, my tongue faculty turns as it wishes.",
        "source": "T24n1448_010:0043a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人堪罵辱，我即罵辱；若堪讚歎，我還讚歎。』",
        "translation": "If that person is worthy of being ridiculed, I will ridicule them; if they are worthy of praise, I will praise them back.'",
        "source": "T24n1448_010:0043a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見喬答摩沙門功德廣大，堪為讚歎，我即讚歎。",
        "translation": "I've seen the great merit of the Gautama-prajñāpāramitā, and I praised it when it was praiseworthy.",
        "source": "T24n1448_010:0043a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等不應責我。」",
        "translation": "Therefore, you shouldn't blame me.\"",
        "source": "T24n1448_010:0043a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊及諸大眾，於晨朝時著衣持鉢，入末土羅城乞食，於其城內，遂遇祭祀星宿會日。",
        "translation": "At the time, the Bhagavān and the assembly gathered in the city of Mathurā with their robes and bowls in the morning to solicit alms, and then they met the goddess of the constellations at the festival.",
        "source": "T24n1448_010:0043a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時星宿女神便作是念：「喬答摩沙門若入此城，我之節日必有障礙，須預設計令其却迴。」",
        "translation": "The goddess of the constellations then had this thought, \"If Cāṭamāsa entered this city, my festival would surely be obstructed, so I must plan ahead to make it turn back.\"",
        "source": "T24n1448_010:0043a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，於世尊前露形而住。",
        "translation": "After that thought, she revealed her form and stayed there in front of the Bhagavān.",
        "source": "T24n1448_010:0043b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告女神曰：「女人之體，設嚴華服猶不端政，何況露形？」",
        "translation": "The Buddha told the goddess, \"A woman's body is not properly decorated with flowers and clothing, so why wouldn't she reveal her form?\"",
        "source": "T24n1448_010:0043b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時天女聞此語已，便生慚恥，隱形不現。",
        "translation": "After hearing these words, the goddess became ashamed and withdrew from her form.",
        "source": "T24n1448_010:0043b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊避道一邊，於大眾前敷座而坐，告諸苾芻：「此末土羅城，有五種過失：一者土地不平、二者處饒荊棘、三者瓦石充滿、四者人民獨食、五者多諸女人，所以不入此城。」",
        "translation": "The Bhagavān then took refuge on one side of the road, spread out his seat in front of the crowd, and told the monks, \"This city of Mathurā has five faults: first, the ground is uneven, second, it's full of thorns, third, it's full of tiles and stones, fourth, the people eat alone, and fifth, there are many women, so you shouldn't enter it.\"",
        "source": "T24n1448_010:0043b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從坐而起，便往驢藥叉園苑，坐一樹下，大眾圍遶，寂靜而住。",
        "translation": "The Bhagavān then rose from his seat and went to the Donkey Yakṣa Park, sat under a tree, was surrounded by the crowd, and stood in silence.",
        "source": "T24n1448_010:0043b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時末土羅城婆羅門居士，聞喬答摩沙門而欲入城，天女障礙不得入城，現在驢藥叉苑內依一樹下而住。",
        "translation": "It was then that the Brāhmaṇas of Mathurā heard that Gautama's gate had wanted to enter the city, but the goddesses had prevented them from doing so, so they stayed under a tree in the Donkey Yakṣa's garden.",
        "source": "T24n1448_010:0043b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等既聞，各各營造種種飲食，各共車載往世尊所，頂禮雙足，退坐一面。",
        "translation": "When they heard that, they each prepared a variety of foods and beverages, each carried them in a chariot to the Bhagavān, bowed their heads at their feet, and withdrew to sit at one side.",
        "source": "T24n1448_010:0043b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊與彼信心婆羅門居士等略說法要，廣如上說，乃至默然而住。",
        "translation": "The Bhagavān then spoke to those faithful Brāhmaṇas and others about the essentials of the Dharma, explained them in detail as above, and stayed there in silence.",
        "source": "T24n1448_010:0043b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼婆羅門等從坐而起，整理衣服，合掌恭敬，而白佛言：「世尊！",
        "translation": "Those brāhmaṇas then got up from their seats, adjusted their robes, put their palms together in respect, and said to the Buddha, \"Bhagavān!",
        "source": "T24n1448_010:0043b16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等為世尊營辦種種清淨飲食，各將車載來奉世尊，唯願慈悲受我等供。」",
        "translation": "We have prepared a variety of pure foods for the Bhagavān and have each brought a chariotload to present to the Bhagavān. Please have mercy and accept our offerings.\"",
        "source": "T24n1448_010:0043b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告具壽阿難陀：「驢藥叉宮殿之內所有依住諸苾芻眾，並皆令集，於供養會，在中而食。」",
        "translation": "It was then that the Buddha addressed Kauṣṭhila Ānanda, \"Assemble all the congregations of congregations that depend on the Yakṣa palace and cause them to gather in the midst of the feeding ceremony and eat.\"",
        "source": "T24n1448_010:0043b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀言：「唯然。",
        "translation": "Ānanda said, \"Yes, it's true.",
        "source": "T24n1448_010:0043b21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T24n1448_010:0043b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀受佛教勅，所有依止驢藥叉宮殿諸苾芻等，普告令集，至彼會處；詣世尊所，頂禮雙足，而白佛言：「世尊！",
        "translation": "On that occasion, Ananta, having been commanded by the Buddha to assemble all the donkeys and hermits in the palace, was told by the crowd to go to the meeting place, went to the Bhagavān, bowed his head at his feet, and said to the Buddha, \"Bhagavān!",
        "source": "T24n1448_010:0043b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有苾芻，皆悉集於會堂，次第坐已，願聖知時。」",
        "translation": "After all the monks had gathered in the assembly hall and sat down in order, may the sages know when they arrived.\"",
        "source": "T24n1448_010:0043b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊往詣會堂，至已於苾芻前敷座而坐。",
        "translation": "The Bhagavān went to the assembly hall, and when he arrived, he prepared a seat in front of the monks and sat down.",
        "source": "T24n1448_010:0043b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時末土羅城信心婆羅門居士，知佛及僧安坐食已，廣如上說。",
        "translation": "It was then that the faithful Brāhmaṇa monks of Mathurā knew that the Buddha and the saṃgha had sat down to eat, and they explained it in detail as above.",
        "source": "T24n1448_010:0043b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "洗手已，收鉢訖，即於佛前求願而住，作如是言：「彼等毒龍及惡藥叉皆已調伏。",
        "translation": "After washing his hands and putting away his bowl, he asked for permission to stay in front of the Buddha and said, \"Those poisonous dragons and bad yakṣas have all been tamed.",
        "source": "T24n1448_010:0043b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此驢藥叉，常與我等於長夜中非怨為怨、非讎為讎、非逆為逆，我等所生孩子皆被侵奪。",
        "translation": "These asses and yakṣas have always been with us for a long time, and during the night they were not enmity for enmity, not synonym for synonym, and not adversary for adversary, and all the children we had were taken from us.",
        "source": "T24n1448_010:0043b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊頗為我等生哀愍故，調伏惡驢藥叉。」",
        "translation": "The Bhagavān will often show compassion for us and tame that bad ass Yakṣa.\"",
        "source": "T24n1448_010:0043c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼藥叉先坐會中，于時世尊告藥叉曰：「汝聞此語不？」",
        "translation": "Yakṣa was first sitting in the assembly, when the Bhagavān addressed Yakṣa, \"Have you heard this?\"",
        "source": "T24n1448_010:0043c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "They said, \"Bhagavān!",
        "source": "T24n1448_010:0043c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已聞。」",
        "translation": "I've heard it.\"",
        "source": "T24n1448_010:0043c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復告藥叉：「聞此言不？」",
        "translation": "Again, he told Yakṣa, \"Have you heard these words?\"",
        "source": "T24n1448_010:0043c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善逝！",
        "translation": "\"Well gone!",
        "source": "T24n1448_010:0043c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已聞。」",
        "translation": "I've heard it.\"",
        "source": "T24n1448_010:0043c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告藥叉：「此非法事，汝當厭離。」",
        "translation": "He also told Yakṣa, \"This is an unlawful thing that you must get rid of.\"",
        "source": "T24n1448_010:0043c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥叉白佛：「眾人若能為諸四方苾芻造毘訶羅，我當捨離，必不損害。」",
        "translation": "Yakṣa said to the Buddha, \"If people can create vihāras for the four groups of monks, I will abandon them and won't harm them.\"",
        "source": "T24n1448_010:0043c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊，告末土羅聚落信心婆羅門居士等：「汝等聞斯語不？」",
        "translation": "The Bhagavān then addressed the faithful Brāhmaṇas of the Mathurā community, saying, \"Have you heard this?\"",
        "source": "T24n1448_010:0043c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報言：「已聞。",
        "translation": "They replied, \"I've heard it.",
        "source": "T24n1448_010:0043c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T24n1448_010:0043c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等為造。」",
        "translation": "We made them for him.\"",
        "source": "T24n1448_010:0043c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊調伏驢藥叉，及彼五百眷屬已，時婆羅門等為彼藥叉，及五百眷屬，造五百毘訶羅。",
        "translation": "After the Bhagavān had subdued Donkey Yakṣa and his five hundred followers, the Brāhmaṇas and others created five hundred vihāras for Yakṣa and his five hundred followers.",
        "source": "T24n1448_010:0043c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是漸次調伏池藥叉、林藥叉、訶梨迦藥叉女已。",
        "translation": "After thus gradually subduing Yakṣa of the Pond, Yakṣa of the Forest, and Yakṣa of Harike, the Bhagavān then showed great supernormal powers and created five hundred vihāras for Yakṣa and his five hundred followers.",
        "source": "T24n1448_010:0043c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊現大神通，入摩土羅城中，調伏闇藥叉女及五百眷屬；彼城人眾亦為苾芻造五百住處。",
        "translation": "The Bhagavān then showed great supernormal powers and entered the city of Mathurā, subduing the Yakṣa woman of darkness and her 500 retinues, and the people of that city also made 500 dwelling places for the monks.",
        "source": "T24n1448_010:0043c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊於斯城外城內，調伏二千五百藥叉已，時彼城中信心人等，亦復為造二千五百住處。",
        "translation": "After the Bhagavān had subdued 2,500 yakṣas outside and inside that city, the faithful people of that city also made 2,500 dwelling places for the monks.",
        "source": "T24n1448_010:0043c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊復至鄔達羅聚落，住鄔達羅林中。",
        "translation": "The Bhagavān then went back to the Udraka village and stayed in the Udraka grove.",
        "source": "T24n1448_010:0043c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有婆羅門名鄔達羅延，聞世尊在彼林中，遂乘白馬車輅，手持金杖金澡罐，眷屬圍遶從城而出，欲往佛所，車道通處，乘車而進；若不通處，即步涉而進，遂至佛所，以妙言詞，慰問世尊，退坐一面。",
        "translation": "When he heard that the Bhagavān was in that forest, a Brāhmaṇa named Udraka Udraka emerged from the city in a white horse chariot, carrying a golden staff and a golden bathing pot, and surrounded by his retinue, intending to go to the Buddha's abode.",
        "source": "T24n1448_010:0043c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄔達羅延婆羅門大長者白佛言：「世尊！",
        "translation": "The great elder Udayana Brahman said to the Buddha, \"Bhagavān!",
        "source": "T24n1448_010:0043c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今少有問答，願佛聽許。」",
        "translation": "Now, I have a few questions and answers, so may the Buddha hear them.\"",
        "source": "T24n1448_010:0043c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊告曰：「婆羅門！",
        "translation": "The Bhagavān told them, \"Brāhmaṇa!",
        "source": "T24n1448_010:0043c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恣汝所問。」",
        "translation": "Do as you're asked.\"",
        "source": "T24n1448_010:0043c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門白言：「喬答摩！",
        "translation": "The brāhmaṇa then said, \"Gautama!",
        "source": "T24n1448_010:0043c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之五根，種種境界，各取本界、不取別界。",
        "translation": "\"These five faculties, in their various realms, each takes on the original realm and doesn't take on a different realm.",
        "source": "T24n1448_010:0043c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂眼、耳、鼻、舌、身根。",
        "translation": "They are called the eye, ear, nose, tongue, and body faculties.",
        "source": "T24n1448_010:0043c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者界處攝？",
        "translation": "What's included in the elemental field?",
        "source": "T24n1448_010:0043c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者依處？」",
        "translation": "What is the basis?\"",
        "source": "T24n1448_010:0043c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「婆羅門！",
        "translation": "The Buddha said, \"Brāhmaṇa!",
        "source": "T24n1448_010:0043c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若此五根，種種界處，各取本界而不取別。",
        "translation": "\"If these five faculties are variously located in various elements, each takes the original element and doesn't distinguish between them.",
        "source": "T24n1448_010:0043c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂眼界乃至身界，是諸根等，意能攝受。",
        "translation": "They're called the eye realm and even the body realm, which are faculties that the mind can take in.",
        "source": "T24n1448_010:0044a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此五根，以意為依止。」",
        "translation": "These five faculties, however, take the mind as their support.\"",
        "source": "T24n1448_010:0044a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門曰：「意復以何為依止？」",
        "translation": "The Brāhmaṇa said, \"What else does the mind take as its support?\"",
        "source": "T24n1448_010:0044a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「以念為依止。」",
        "translation": "The Buddha said, \"Take mindfulness as your support.\"",
        "source": "T24n1448_010:0044a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門曰：「念以何為依止？」",
        "translation": "The Brāhmaṇa said, \"What does mindfulness serve as a basis?\"",
        "source": "T24n1448_010:0044a04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「以四念處為依止。」",
        "translation": "The Buddha said, \"Take the four abodes of mindfulness as your support.\"",
        "source": "T24n1448_010:0044a04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「四念處以何為依止？」",
        "translation": "He also asked, \"What do the four abodes of mindfulness take as their basis?\"",
        "source": "T24n1448_010:0044a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「七覺支為依止。」",
        "translation": "The Buddha said, \"The seven factors of awakening are supports.\"",
        "source": "T24n1448_010:0044a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「七覺支以何為依止？」",
        "translation": "He also asked, \"What are the seven factors of awakening that serve as supports?\"",
        "source": "T24n1448_010:0044a06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「明解脫為依止。」",
        "translation": "The Buddha said, \"Luminous liberation is the support.\"",
        "source": "T24n1448_010:0044a06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「明解脫以何為依止？」",
        "translation": "He also asked, \"What does insight and liberation take as their support?\"",
        "source": "T24n1448_010:0044a07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「涅槃為依止。」",
        "translation": "The Buddha said, \"Nirvāṇa is the basis.\"",
        "source": "T24n1448_010:0044a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「涅槃以何為依止？」",
        "translation": "He also asked, \"What is the basis of nirvāṇa?\"",
        "source": "T24n1448_010:0044a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「婆羅門！",
        "translation": "The Buddha said, \"Brāhmaṇa!",
        "source": "T24n1448_010:0044a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今所問，此事深遠，汝不能到彼邊際涅槃。",
        "translation": "What you're asking now is so profound that you won't be able to reach the limit of nirvāṇa.",
        "source": "T24n1448_010:0044a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今所修梵行，正斷苦故，盡諸苦際。」",
        "translation": "Now, I'm cultivating the religious practice that correctly ends suffering and thus extinguishes the limits of suffering.\"",
        "source": "T24n1448_010:0044a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時鄔陀延婆羅門大長者聞世尊語已，心生歡喜，從坐而起，辭佛而去。",
        "translation": "After hearing the Bhagavān's words, the great elder Udayana Brahman rejoiced, got up from his seat, left the Buddha, and departed.",
        "source": "T24n1448_010:0044a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者作如是念：「如何於彼而作損害？」",
        "translation": "That elder then had this thought, \"How could I do harm to that person?\"",
        "source": "T24n1448_010:0044a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其長者昔聞有人以食供養世尊及聲聞眾，便即發願：「心有所求，悉皆獲得。」",
        "translation": "When that elder heard that someone had offered food to the Bhagavān and the śrāvakas, he immediately vowed, \"Whatever your heart desires, it will obtain it.\"",
        "source": "T24n1448_010:0044a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，還來佛所，整理衣服，合掌頂禮，而即白言：「唯願世尊及苾芻眾，明日晨朝於我家中願受飯食。」",
        "translation": "After he had this thought, he returned to the Buddha, adjusted his robes, put his palms together in prostration, and said, \"Please let the Bhagavān and the congregation of monks accept a meal at my home tomorrow morning.\"",
        "source": "T24n1448_010:0044a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣如上說。",
        "translation": "It was explained in detail above.",
        "source": "T24n1448_010:0044a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時長者知世尊食訖，洗手收鉢已，於世尊前，即取小座而坐，便念惡願：「此輩沙門喬答摩及諸弟子，食我飯者，與我作牛。」",
        "translation": "Knowing that the Bhagavān had finished his meal, the elder washed his hands and put away his bowl, took a small seat in front of the Bhagavān, and sat down, then recited this bad vow: \"This group of ascetics, Gautama and his disciples, who eat my food, will make oxen of me.\"",
        "source": "T24n1448_010:0044a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知鄔陀延心之所念，而即告曰：「婆羅門！",
        "translation": "Knowing what Udayana had in mind, the Bhagavān then addressed them, \"Brāhmaṇa!",
        "source": "T24n1448_010:0044a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝心違法，終不能成。",
        "translation": "Your thoughts are unlawful; they'll never come true.",
        "source": "T24n1448_010:0044a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸苾芻，已盡後有，汝今可更別發餘願。」",
        "translation": "These monks have ended their subsequent existence, so now you can make another vow.\"",
        "source": "T24n1448_010:0044a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊說施呪願已，從座而去，還至本住處，在苾芻前敷座而坐，告諸苾芻：「彼鄔陀延為求耶願而生惡心。",
        "translation": "After he had spoken the vow to bestow a spell, the Bhagavān departed from his seat, returned to his previous dwelling, spread out his seat in front of the monks, and sat down, telling the monks, \"That Udayana sought that vow and became evil-minded.",
        "source": "T24n1448_010:0044a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等食已，宜可速說先佛伽他，使彼耶願勿得成就。」",
        "translation": "After you eat, it would be helpful if you quickly explained the prior Buddha-gatha so that that vow won't be fulfilled.\"",
        "source": "T24n1448_010:0044a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻說伽他已。",
        "translation": "The monks then finished speaking about the kāṣāya.",
        "source": "T24n1448_010:0044a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊夜分已盡，於清旦時入鄔陀延聚落乞食，侍者具壽阿難陀隨佛左右。",
        "translation": "After the evening portion of the day had ended, the Bhagavān went into the village of Udayana at sunrise to solicit alms, accompanied by his attendant, Gosho Ananta.",
        "source": "T24n1448_010:0044a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼聚落中有一老母名迦戰羅，將欲取水，而向井邊。",
        "translation": "In that village, there was an elderly woman named Kācalindra who was about to fetch water and was headed for the well.",
        "source": "T24n1448_010:0044b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊見彼調伏時至，告具壽阿難陀曰：「汝今可詣彼老母所，告言：『世尊須水，汝可持奉。』」",
        "translation": "When the Bhagavān saw her arriving at the time of her retreat, he told Kauṣṭhila Ānanda, \"Now, you may go to that old mother and tell her, 'The Bhagavān needs water; you may carry it.'\"",
        "source": "T24n1448_010:0044b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「聖者！",
        "translation": "He replied, \"Bhagavān!",
        "source": "T24n1448_010:0044b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今奉水。」",
        "translation": "Now, I'll offer you water.\"",
        "source": "T24n1448_010:0044b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼老母以滿瓶水，速往佛所，見彼如來具三十二相八十種好，光明赫奕超千日輪，如寶山行。",
        "translation": "With a vial full of water, the elderly mother quickly went to the Buddha and saw the Tathāgata with his thirty-two features and eighty beauties, his radiance shining brilliantly beyond a thousand suns, and his movements like a mountain of treasures.",
        "source": "T24n1448_010:0044b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼老母見世尊已，便生恭敬，如愛子心，即便舉手，欲抱世尊，唱言：「子！",
        "translation": "Seeing the Bhagavān, that elderly mother then became respectful and like a beloved son, she even raised her hand, wanted to embrace the Bhagavān, and called out, \"Son!",
        "source": "T24n1448_010:0044b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子！」",
        "translation": "child!\"",
        "source": "T24n1448_010:0044b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻等即前遮止：「莫抱世尊。」",
        "translation": "The monks and nuns immediately went forward to intercept them, \"Don't hug the Bhagavān.\"",
        "source": "T24n1448_010:0044b09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等不須遮此老母。",
        "translation": "The Buddha told the monks, \"You don't need to block this old mother.",
        "source": "T24n1448_010:0044b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1448_010:0044b10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此老母已曾五百生中，與我為母。",
        "translation": "This old mother has been my mother for 500 lifetimes.",
        "source": "T24n1448_010:0044b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不令抱我身者，即吐熱血。」",
        "translation": "If I don't let her embrace me, I'll spit hot blood.\"",
        "source": "T24n1448_010:0044b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊見彼心生子想，念此恩愛，生慈愍心，便即引項，令老母抱。",
        "translation": "Seeing this person's mind give rise to the idea of a son, the Bhagavān remembered this kindness and became compassionate, so he led her to accept the old mother's embrace.",
        "source": "T24n1448_010:0044b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼既抱已，心生歡喜，聽佛說法。",
        "translation": "Once he had embraced her, his heart rejoiced and he listened to the Buddha's teaching.",
        "source": "T24n1448_010:0044b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知彼根性，隨機演說，令證四聖諦理。",
        "translation": "Knowing his faculties, the Bhagavān then spoke at random, causing him to realize the principle of the four noble truths.",
        "source": "T24n1448_010:0044b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母聞法已，以金剛智杵摧滅二十種薩迦耶見煩惱山峯，證預流果，得見諦理，即作是言：「是我世尊，如是勝利，父母兄弟及諸天等所不能作，廣如上說。",
        "translation": "After hearing the teaching, the mother used a vajra-wise pounder to destroy twenty afflicted peaks of the view of identity, realize the fruit of stream-winner, and attain a vision of the truths, and then she said, \"This is the Bhagavān, such an accomplishment that parents, brothers, gods, and so forth can't achieve, as was explained above.",
        "source": "T24n1448_010:0044b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從無始心以來積集二十薩迦耶見山，以金剛慧我已摧滅，得預流果。」",
        "translation": "Since beginningless time, I've accumulated 20 mountains of religious views that I've destroyed with the adamantine wisdom, and I've attained the fruit of stream-winner.\"",
        "source": "T24n1448_010:0044b19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復說頌曰：「善子所應作，　　謂報慈母恩；　我今蒙佛光，　　當進涅槃路。",
        "translation": "Again, he spoke a verse, \"That's what a good son should do to repay his loving mother's kindness; now, having received the Buddha's light, I'll enter the path to nirvāṇa.",
        "source": "T24n1448_010:0044b20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　善哉希有事，　　永超三惡趣；　我今用少功，　　速至無憂處。」",
        "translation": "It's good and rare that I'll transcend the three bad destinies forever; now, with a little effort, I'll quickly reach the land of no sorrow.\"",
        "source": "T24n1448_010:0044b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語已，頂禮佛足，奉辭而去。",
        "translation": "After speaking these words, he bowed his head at the Buddha's feet, took his leave, and departed.",
        "source": "T24n1448_010:0044b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於異時，夫既聽許出家，詣世尊所，頂禮雙足，而白佛言：「唯願世尊聽我於善說法律中出家近圓，成苾芻尼性，於世尊所，修諸梵行。」",
        "translation": "At some point, having been given permission to leave home, he went to the Bhagavān, bowed his head at his feet, and said to the Buddha, \"Please let the Bhagavān grant me permission to leave home among the well-explained principles, to become a nun, and to cultivate religious practices in the Bhagavān's abode.\"",
        "source": "T24n1448_010:0044b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊付囑大世主苾芻尼，于時大世主令彼出家，與受近圓，示以法要，懃心修學，斷諸煩惱，證羅漢果，廣如上說，天人供養。",
        "translation": "The Bhagavān then instructed the Mahādeva Bhikṣuṇī, who then caused him to leave home, accept the near-perfection, show him the essentials of the Dharma, diligently train, end the afflictions, realize the fruit of the arhat, explain it in detail, and have gods and humans make offerings to him.",
        "source": "T24n1448_010:0044c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊與諸苾芻尼，略說法要已，入室宴坐。",
        "translation": "After the Bhagavān and the monks and nuns had given a brief explanation of the essentials of the Dharma, they went into their room and sat down in repose.",
        "source": "T24n1448_010:0044c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時戰迦羅苾芻尼，所聞法要，為他廣說。",
        "translation": "The monks and nuns at Zhanghara then explained the essentials of the teaching that they had heard for others.",
        "source": "T24n1448_010:0044c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊告諸苾芻：「此戰迦羅，於我苾芻尼聲聞眾中，分析經法，而得第一。」",
        "translation": "The Bhagavān then addressed the monks, \"Among the śrāvakas and nuns who are my monks and nuns, this Zhanghara is the best in analyzing the sūtras and Dharma.\"",
        "source": "T24n1448_010:0044c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻皆生疑惑，為斷疑故，而問世尊：「彼戰迦羅苾芻尼，曾作何業，年邁出家？",
        "translation": "The monks then all had doubts and questions, and in order to resolve them, they asked the Bhagavān, \"What was that Zhanghara monk and nun's past life that made him leave home at an early age?",
        "source": "T24n1448_010:0044c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以何緣而受貧賤？",
        "translation": "For what other reason is it that I am poor and disadvantaged?",
        "source": "T24n1448_010:0044c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於最後生而不懷孕，復得出家，證羅漢果？",
        "translation": "In what final lifetime does a person who is not pregnant again attain home and realize the fruit of the arhat?",
        "source": "T24n1448_010:0044c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說法之中，云何最勝？」",
        "translation": "Among the teachings, what is the most excellent?\"",
        "source": "T24n1448_010:0044c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「此戰迦羅苾芻尼，先作白業故，積集資糧，乃至果報自受。",
        "translation": "The Buddha told the monks, \"This is a Cāḷākara monk and nun who first did white karma and accumulated accumulation up to the point where the result is felt by oneself.",
        "source": "T24n1448_010:0044c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻當知！",
        "translation": "You should know this, monks!",
        "source": "T24n1448_010:0044c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於往昔行菩薩道時，曾為我母。",
        "translation": "When I was practicing the bodhisattva path in the past, I was my mother.",
        "source": "T24n1448_010:0044c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼業故，年老出家。",
        "translation": "Because of that activity, I left home when I was old.",
        "source": "T24n1448_010:0044c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔行菩薩道時，母為障礙。",
        "translation": "When I was practicing the bodhisattva path in the past, my mother was an obstacle.",
        "source": "T24n1448_010:0044c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由戰迦羅不作善故，摩耶夫人常作好業。",
        "translation": "Because Tsheṅkala didn't do good deeds, Mrs. Māyā always did good deeds.",
        "source": "T24n1448_010:0044c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戰迦羅為墮胎故，迦葉佛時，罵辱式叉、有學苾芻尼及無學苾芻尼云：『婢！",
        "translation": "When Kāśyapa Buddha, Tsāṅkala insulted Śikṣā, learned bhikṣuṇīs, and nuns without training because she fell into the womb, saying, 'Maidservant!",
        "source": "T24n1448_010:0044c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婢！』",
        "translation": "maidservant!'",
        "source": "T24n1448_010:0044c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此業故，今為婢身。",
        "translation": "As a result of this activity, I'm now a servant.",
        "source": "T24n1448_010:0044c18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由迦葉佛時，出家讀誦，又聞佛說法，因蘊善巧、界處緣起善巧、處非處善巧，在我教中出家，斷一切煩惱，得無學果。",
        "translation": "Since the time of Kāśyapa Buddha, he left home to read and recite, heard the Buddha preach, became adept at the causal aggregates, adept at the dependent arising of elements and realms, and adept at both places and non-places, left home in the midst of our teaching, ended all afflictions, and attained the fruit of post-learners.",
        "source": "T24n1448_010:0044c18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄔波馱耶苾芻尼，於彼迦葉波佛正等覺法中出家，能廣分別，說法人中，最為第一。",
        "translation": "That monk Upādhyāya left home among the perfectly enlightened teachings of Kāśyapa Buddha, and he was able to discern in detail and preach as the foremost among people.",
        "source": "T24n1448_010:0044c21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時戰迦羅苾芻尼臨命終時，作是願言：『我於迦葉波佛法中，修持梵行，讚誦經典，而未得果。",
        "translation": "When he was about to die, that monk Kālādhara made this vow, saying, 'In Kāśyapa Buddha's teaching, I've cultivated the religious practice and praised the sūtras, but I haven't yet attained their fruit.",
        "source": "T24n1448_010:0044c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今迦葉波佛授鄔達羅摩納婆阿耨多羅三藐三菩提記：「汝於未來世，人壽百歲時，成等正覺，號釋迦牟尼。」",
        "translation": "Now, Kāśyapa Buddha has given Uddaka Māṇava the assurance of perfect enlightenment, 'In a future life, when you're 100 years old, you'll become perfectly enlightened and be called Śākyamuni.'",
        "source": "T24n1448_010:0044c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願我善根，於彼釋迦如來法中出家，得如今日鄔波馱耶，說法人中，最為第一。』",
        "translation": "May I have the good roots to leave home among the teachings of that Śākyamuni Tathāgata and attain the status of the best among people who speak the Dharma today, like Upādhyāya.'",
        "source": "T24n1448_010:0044c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼願故，今此苾芻尼於我法中，說法第一。",
        "translation": "Because of that vow, this monk and nun now is the best among my Dharma teachers in terms of expounding the Dharma.",
        "source": "T24n1448_010:0044c29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻當知！",
        "translation": "You should know, monks!",
        "source": "T24n1448_010:0045a01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "黑黑之業，當得黑黑報。",
        "translation": "Black and black actions will result in black and black rewards.",
        "source": "T24n1448_010:0045a01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至汝等苾芻，當修白白業，應如是學。」",
        "translation": "Even you monks, you must cultivate white-white actions and train in this way.\"",
        "source": "T24n1448_010:0045a02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告阿難陀曰：「汝隨我往吠羅聚落。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, \"Follow me to the Vairocana village.\"",
        "source": "T24n1448_010:0045a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀曰：「唯然。",
        "translation": "Ānanda said, \"Yes, I did.",
        "source": "T24n1448_010:0045a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T24n1448_010:0045a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊共阿難陀去，乃至到一園中。",
        "translation": "The Bhagavān and Ānanda then departed and went to a garden.",
        "source": "T24n1448_010:0045a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有婆羅門汲水灑園，其婆羅門遙見世尊，便作是念：「若喬答摩沙門入此園者，污此井水。」",
        "translation": "A brāhmaṇa was drawing water to sprinkle in the garden, and when he saw the Bhagavān from a distance, the brāhmaṇa thought, \"If Gautama's brāhmaṇa had entered this garden, it would have defiled the water from this well.\"",
        "source": "T24n1448_010:0045a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便藏罐索，佇立而住。",
        "translation": "He then hid his jar and lasso and stood erect.",
        "source": "T24n1448_010:0045a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊以神通力而入彼園。",
        "translation": "The Bhagavān then used his supernormal powers to enter that garden.",
        "source": "T24n1448_010:0045a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有半之迦藥叉大將，遂側其井水，流滿園中。",
        "translation": "There was then a general named Kāśyapa who crowded the well and filled the garden with water.",
        "source": "T24n1448_010:0045a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門作如是念：「此喬答摩沙門有大威力，能令井水涌出漫流。」",
        "translation": "The Brāhmaṇa then had this thought, \"This Gautama-prajñā Sāmaṇa has great power to cause the well to well up and flow freely.\"",
        "source": "T24n1448_010:0045a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即生信心，而作是言：「喬答摩來！",
        "translation": "After that thought, he had faith and said, 'Come, Gautama!",
        "source": "T24n1448_010:0045a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是水罐、此是罐索，隨意取水。」",
        "translation": "This is a pitcher and this is a jar of water, so take the water as you like.\"",
        "source": "T24n1448_010:0045a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊即說頌曰：「諸處悉有水，　　井水何所用？",
        "translation": "The Bhagavān then spoke a verse, \"There's water everywhere, but what's the use of water from a well?",
        "source": "T24n1448_010:0045a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　斷此渴愛想，　　更復何所求？」",
        "translation": "After eliminating this craving, what else should I seek?\"",
        "source": "T24n1448_010:0045a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼婆羅門白佛言：「唯願世尊聽我於善說法律之中出家而受近圓，得苾芻性。」",
        "translation": "That brāhmaṇa then said to the Buddha, \"Please let the Bhagavān hear me leave home among the well-explained principles and accept the near-complete, regnant nature.\"",
        "source": "T24n1448_010:0045a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣如上說「善來苾芻！」",
        "translation": "It was as explained above, \"Well-come, monks!\"",
        "source": "T24n1448_010:0045a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即成出家，頌曰：「世尊命善來，　　髮落衣鉢具，　諸根咸寂定，　　隨念悉皆成。」",
        "translation": "He then became a renunciant and spoke this verse, \"The Bhagavān appointed him a good comer, complete with hair down, clothing and bowls, his faculties are all quiescent and concentrated, and his mindfulness is fully achieved.\"",
        "source": "T24n1448_010:0045a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼苾芻策勵勤修，斷諸煩惱，證阿羅漢，厭離三世，廣如上說，乃至釋梵諸天恭敬。",
        "translation": "Because of that monk's encouragement and diligence, he ended the afflictions, realized arhatship, became free of the three worlds, and was widely respected by the gods of Indra and Brahmā as explained above.",
        "source": "T24n1448_010:0045a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊，於勇軍聚落人間遊行，至鞞闌底城，在練木樹下而住。",
        "translation": "At the time, the Bhagavān was marching among the people of the colony of Gṛdhrakūṭa and arrived at the city of Vaibhīti, where he was staying under a lianmu tree.",
        "source": "T24n1448_010:0045a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此城中有婆羅門名曰火授，而作國王，國土豐饒，人民安樂，居者充滿。",
        "translation": "At the time, there was a Brāhmaṇa named Vakkula in that city who became king, and his land was abundant, his people were happy, and his dwellers were filled.",
        "source": "T24n1448_010:0045a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時彼王聞世尊遊行勇軍人間，至此在練木樹下，便作是念：「沙門喬答摩！",
        "translation": "When that king heard that the Bhagavān had marched his brave army among the people and arrived here under the Nandana tree, he thought, \"Cāmu Gautama!",
        "source": "T24n1448_010:0045a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大國王恭敬供養、尊重讚歎，我亦應可供給供養，免被隣國譏嫌笑弄云：『火授王！",
        "translation": "As the great kings respect and offer support and praise me, I should also make offerings, lest my neighbors ridicule me and say, 'King Firebrace!'",
        "source": "T24n1448_010:0045a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來在於境內亦能供養。』",
        "translation": "The Tathāgata can make offerings even when he's within his realm.'",
        "source": "T24n1448_010:0045b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今應請世尊及苾芻僧伽，以一切供具而為供養。」",
        "translation": "Now, I should ask the Bhagavān and the monks and nuns to make offerings with all the necessities.\"",
        "source": "T24n1448_010:0045b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，便即告勅嚴駕出城，往詣佛所，以種種善言慰問世尊，却坐一面。",
        "translation": "After he had this thought, he then told Imahyan to drive out of the city, go to the Buddha, greet the Bhagavān with various kind words, and withdraw to sit to one side.",
        "source": "T24n1448_010:0045b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即為彼王說微妙法，示教利喜，默然而住。",
        "translation": "The Bhagavān then spoke the subtle Dharma for the king, showed him the benefits of his teaching, and waited silently.",
        "source": "T24n1448_010:0045b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時火授王即從坐起，偏袒右肩右膝著地，合掌向佛，而白佛言：「唯願世尊及苾芻眾，受我三月雨安居四事供養：飲食、湯藥、衣服、臥具。」",
        "translation": "The fire-granting king then rose from his seat, bared his right shoulder and knelt on his right knee, put his palms together, and said to the Buddha, \"Please, Bhagavān, and the crowd of monks and nuns, accept my four offerings for the three months of rain and quiet abode: food, medicine, clothing, and bedding.\"",
        "source": "T24n1448_010:0045b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊默然受彼火授王請。",
        "translation": "The Bhagavān then quietly accepted that Firebrace King's invitation.",
        "source": "T24n1448_010:0045b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時火授王既見世尊默然受請，心大歡喜，從坐而起，至本宮已，勅諸臣曰：「卿等宜應日日廣辦十八種飯，及諸美味。」",
        "translation": "Seeing that the Bhagavān had quietly accepted his invitation, the fire king was greatly encouraged, got up from his seat, and went to his palace, where he commanded his ministers, \"You should prepare 18 kinds of rice and other delicious foods every day.\"",
        "source": "T24n1448_010:0045b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於國中而遍告勅：「汝等諸人，夏三月中不得輒供沙門喬答摩。",
        "translation": "Again, he commanded them throughout the country, \"All of you mustn't make frequent offerings to the ascetic Gautama during the summer and March months.",
        "source": "T24n1448_010:0045b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若輒請者，當斷其命。」",
        "translation": "If you frequently invite them, your lives will be cut off.\"",
        "source": "T24n1448_010:0045b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王告勅已，夜便睡眠，夢見白帳圍繞宮城。",
        "translation": "After the king told him, he went to sleep at night and dreamt that he saw a white palace curtain surrounding his palace.",
        "source": "T24n1448_010:0045b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夢已驚怖，心生愁惱，身毛皆竪，從臥速起，拓頰而坐，思惟所夢是何災祥？",
        "translation": "Frightened by the dream, his mind became distressed, and his hair stood on end. He quickly got up from his bed, spread his cheeks, and sat down, thinking, \"What misfortune did I dream about?",
        "source": "T24n1448_010:0045b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為此徵而失王位、或當致死？",
        "translation": "Is it not for this sign that he will lose his position as king or that he will die?",
        "source": "T24n1448_010:0045b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於晨朝，便告國師，具陳所夢：「如是夢者，於我若為？」",
        "translation": "In the morning, he addressed the national teacher and explained the dream, \"Did he dream this, or is it about me?\"",
        "source": "T24n1448_010:0045b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼國師心生異念：「今王所夢，是其善徵。",
        "translation": "That national teacher then had a different thought, \"This dream of the king's was a good sign.",
        "source": "T24n1448_010:0045b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若善解，遂令彼王於喬答摩所倍加敬養；我今惡解彼王所夢。」",
        "translation": "If I had understood it well, I would have caused the king to pay close respect to Gautama, but now I've interpreted the king's dream badly.\"",
        "source": "T24n1448_010:0045b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，而白王曰：「此夢非善。」",
        "translation": "After that thought, he said to the king, \"This dream is not good.\"",
        "source": "T24n1448_010:0045b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王白師言：「此夢非善，當有何報？」",
        "translation": "The king said to his teacher, \"What will be the result of this dream that wasn't good?\"",
        "source": "T24n1448_010:0045b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師答王言：「如王所夢，決定失位，或當致死。」",
        "translation": "The teacher answered the king, \"As the king dreamed, it's certain that he'll lose his position or that he'll die.\"",
        "source": "T24n1448_010:0045b23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王時思念：「為定失國？",
        "translation": "The king then thought, \"Why is it certain that he'll lose his kingdom?",
        "source": "T24n1448_010:0045b24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為致死耶？」",
        "translation": "To cause death?\"",
        "source": "T24n1448_010:0045b25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，復白師言：「有何方便，得不失位及不致死？」",
        "translation": "After this thought, he again said to his teacher, \"What's a way to keep from losing one's position and from dying?\"",
        "source": "T24n1448_010:0045b25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師便答言：「於一夏三月，住幽隱處，勿令人見。",
        "translation": "The teacher then replied, \"During the first three months of summer, stay in a secluded place where no one can see you.",
        "source": "T24n1448_010:0045b26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是，定不失位，身復不死。」",
        "translation": "If he can do that, he certainly won't lose his position, and his body won't die again.\"",
        "source": "T24n1448_010:0045b27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時火授王聞是語已：「此事甚易，我當告勅國內人民，不令見我。」",
        "translation": "When the fire king heard this, he said, \"This is an easy thing to do; I'll tell the people inside my country not to see me.\"",
        "source": "T24n1448_010:0045b28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已，處處遍告：「王有勅令，夏三月中，一切人民，莫復見我。",
        "translation": "After he said this, he told them everywhere, \"The king has ordered that in the third month of summer, all the people must never see me again.",
        "source": "T24n1448_010:0045b29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若輒見者，當斷其命。」",
        "translation": "If they do, their lives will be cut off.\"",
        "source": "T24n1448_010:0045c02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是勅已，入於隱處。",
        "translation": "After such an order, he went into hiding.",
        "source": "T24n1448_010:0045c02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時具壽阿難陀，於其晨朝詣火授王宮，於王門所，見衛門人寂然閑坐，無所營為。",
        "translation": "It was then that Kauṣṭhila Ānanda went to the fire-granting king's palace in the morning and saw the guards at the gate sitting quietly and unmoving.",
        "source": "T24n1448_010:0045c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見已問言：「汝等今者何故閑坐無所營作？」",
        "translation": "When he saw them, he asked, \"Why are you sitting there quietly, doing nothing?\"",
        "source": "T24n1448_010:0045c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼便答言：「聖者阿難陀使我何作？」",
        "translation": "He then answered, \"What did the noble one Ānanda make me do?\"",
        "source": "T24n1448_010:0045c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀報言：「彼火授王！",
        "translation": "Ānanda replied, \"That fire-granting king!",
        "source": "T24n1448_010:0045c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈不請佛及苾芻僧伽，夏三月中四事供養。",
        "translation": "Wouldn't you invite the Buddha and the monks and nuns to make offerings in four ways during the summer and early summer months?",
        "source": "T24n1448_010:0045c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等今者何得閑坐，不營飲食及敷床座，令佛及僧伽一日斷食耶？」",
        "translation": "Why are you sitting idle now, not eating or drinking and making a bed or seat, so that the Buddha and the saṃgha will be without food for a day?\"",
        "source": "T24n1448_010:0045c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼門人白言：「聖者！",
        "translation": "The disciple then said, \"Bhagavān!",
        "source": "T24n1448_010:0045c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王雖告勅，令其廣辦五百人供，不言為誰？」",
        "translation": "Although the king commanded him to make offerings to 500 people, he didn't say for whom?\"",
        "source": "T24n1448_010:0045c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀告言：「汝可白言。」",
        "translation": "Ānanda told him, \"You may say so.\"",
        "source": "T24n1448_010:0045c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼便答曰：「聖者阿難陀！",
        "translation": "He then answered, \"Sage Ānanda!",
        "source": "T24n1448_010:0045c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王先遍告：『夏三月中，勿令人見。",
        "translation": "The king first told them repeatedly, 'In the third month of summer, don't let anyone see it.",
        "source": "T24n1448_010:0045c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若輒見者，當斷其命。』",
        "translation": "If you see them so easily, your life will be cut off.'",
        "source": "T24n1448_010:0045c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等當有第二頭耶？",
        "translation": "Should we have a second head?'",
        "source": "T24n1448_010:0045c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而敢白王。」",
        "translation": "I dare to tell the king.\"",
        "source": "T24n1448_010:0045c14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀聞斯語已，往詣佛所，具陳上事。",
        "translation": "After hearing these words, Ānanda went to the Buddha and explained the above matters.",
        "source": "T24n1448_010:0045c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難陀：「汝今宜可著僧伽胝，將一侍者，往大城中，市陌坊巷四衢道中，作如是告：『誰有信心，於三月日能為供給世尊及苾芻僧伽飲食湯藥者，今正是時。』」",
        "translation": "The Buddha told Ānanda, \"Now, it would be helpful if you were to put on a saṃghāṭī and take an attendant to a large city, going down the four roads in the city streets and alleys, and tell them, 'Now is the time for anyone to have faith that they can make offerings of food and medicine to the Bhagavān and the monks and nuns of the Bhagavān on the third month.'\"",
        "source": "T24n1448_010:0045c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時聖者聞佛教已，即便往告，如上具陳。",
        "translation": "After the sage heard the Buddha's teaching, he went and told them as detailed above.",
        "source": "T24n1448_010:0045c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城中長者婆羅門等，作如是言：「聖者阿難陀！",
        "translation": "The elders of the city, such as the Brāhmaṇas, said, \"Noble Ānanda!",
        "source": "T24n1448_010:0045c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等各各獨能辦供，世尊上首聲聞僧伽，於三月中供給飲食四事無闕。",
        "translation": "Each of us alone can make offerings to the Bhagavān, the chief śrāvaka, and the monks and nuns, and there are no shortages of four things to offer as food and drink during the month of March.",
        "source": "T24n1448_010:0045c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但緣王有嚴勅，於三月日，不許國內人民輒為奉施上首世尊及苾芻僧伽。",
        "translation": "However, the king has issued a strict order not to allow the people of the country to lightly make offerings to the Bhagavān, the Śrī Siṃgha, or to the monks and nuns of the country during the third month.",
        "source": "T24n1448_010:0045c23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若違犯者，罪至於死。」",
        "translation": "If someone violates this rule, their crime will reach death.\"",
        "source": "T24n1448_010:0045c25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是遍告，竟無能者。",
        "translation": "He told them repeatedly, but there was no one who could do it.",
        "source": "T24n1448_010:0045c25_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有商主從北方來，將五百匹馬至此城中，作如是念：「今屬雨時，若我前進，恐泥損馬者多有漏蹄。」",
        "translation": "A merchant came from the north and brought 500 horses into the city, thinking, \"Now, when it's raining, if I go forward, I'm afraid the mud will damage the horses, and many of them will have leaky hooves.\"",
        "source": "T24n1448_010:0045c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於三月中，即便住此。",
        "translation": "In the middle of the third month, he stayed here even then.",
        "source": "T24n1448_010:0045c28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自乘智馬，每日料麥二升，餘者一升。",
        "translation": "He rode the wise horse himself, feeding it two liters of wheat a day and the rest one liter.",
        "source": "T24n1448_010:0045c28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主亦聞王有嚴令，時阿難陀往就商主而為說法，彼便作是念：「我非久住此王境內。」",
        "translation": "When the merchant also heard about the king's strict order, Ānanda went to the merchant and spoke to him, and he then thought, \"I won't stay here in the king's territory for a long time.\"",
        "source": "T24n1448_010:0045c29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念已白言：「聖者阿難陀！",
        "translation": "After he thought this, he said, \"Noble Ānanda!",
        "source": "T24n1448_010:0046a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自乘智馬，每日給料大麥二升，餘者一升。",
        "translation": "He himself rides a horse of wisdom, giving two liters of barley a day and the rest one liter.",
        "source": "T24n1448_010:0046a03_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊頗能食斯麥者，日奉佛二升，餘苾芻等各施一升。」",
        "translation": "The Bhagavān is quite capable of eating this barley, so he serves the Buddha two liters a day, and the rest of the monks and others give one liter each.\"",
        "source": "T24n1448_010:0046a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀聞商主請已，詣世尊所，具陳上事。",
        "translation": "After hearing the merchant's invitation, Ānanda went to the Bhagavān and explained the above.",
        "source": "T24n1448_010:0046a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛作是念：「我自作業，還當自受。」",
        "translation": "The Buddha had this thought, \"I did my own work, and I will receive it back.\"",
        "source": "T24n1448_010:0046a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣如餘說，乃至非外界受，乃至頌曰：「假令經百劫，　　所作業不亡；　因緣會遇時，　　果報還自受。」",
        "translation": "It was explained in detail like the rest, even though it wasn't received by outsiders, and the verse went on to say, \"Suppose it takes a hundred eons, but the work that's done doesn't die; when causes and conditions meet, the result will be reaped by itself.\"",
        "source": "T24n1448_010:0046a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊說是頌已，告具壽阿難陀曰：「汝今可往苾芻眾中次第行籌，作如是告：『若能共佛在此處住，於三月中食馬麥者，可受此籌。』」",
        "translation": "After speaking this verse, the Bhagavān addressed Kauṣṭhila Ānanda, \"Now, you may go to the congregation of monks and perform the preparation in order, telling them, 'If you can stay here with the Buddha and eat horse feed in three months, you may accept this preparation.'\"",
        "source": "T24n1448_010:0046a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時聖者奉佛教已，便往行籌。",
        "translation": "After he had received the Buddha's teaching, the sage then went and distributed the chips.",
        "source": "T24n1448_010:0046a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊教主先受一籌，四百九十八苾芻各受其籌。",
        "translation": "The Bhagavān taught the master to accept one chip first, and each of the four hundred and ninety-eight monks accepted his chip.",
        "source": "T24n1448_010:0046a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時具壽舍利弗白世尊言：「我多風疾，於三月日，不能食麥。」",
        "translation": "Kauṣṭhila Śāriputra then said to the Bhagavān, \"I have a lot of wind trouble, and for three months I couldn't eat wheat.\"",
        "source": "T24n1448_010:0046a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽目連復白佛言：「我為看侍尊者，亦當隨去。」",
        "translation": "Kauṣṭhila Maudgalyāyana then said to the Buddha, \"I'll go along with you, Venerable, as your attendant.\"",
        "source": "T24n1448_010:0046a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛與四百九十八苾芻，於此夏安居，具壽舍利弗、目連詣三峯山，而為安止。",
        "translation": "After the Buddha and 498 monks had settled down for the summer, Kauśālīpta and Maudgalyāyana went to Mount Sambong and made their retreat.",
        "source": "T24n1448_010:0046a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天帝釋來請二尊者，於三月日受其供給。",
        "translation": "The god Indra then invited the two honored ones to accept an offering from him on the third moon.",
        "source": "T24n1448_010:0046a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時商主即以馬麥，每日奉佛二升，諸餘苾芻各施一升。",
        "translation": "The merchant then offered two liters of horse barley to the Buddha each day, and the other monks each gave one liter.",
        "source": "T24n1448_010:0046a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難陀：「汝可為我料理此麥。」",
        "translation": "The Buddha told Ānanda, \"Take care of this wheat for me.\"",
        "source": "T24n1448_010:0046a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀即便持麥往詣聚落，至一老母處，告言：「姊妹！",
        "translation": "Ananta then took the wheat and went to a village, went to an elderly mother, and told her, \"Sister!",
        "source": "T24n1448_010:0046a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可為世尊料理此麥。」",
        "translation": "You can prepare this wheat for the Bhagavān.\"",
        "source": "T24n1448_010:0046a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "老母報曰：「聖者！",
        "translation": "The old mother replied, \"Sage!",
        "source": "T24n1448_010:0046a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我年衰邁，無力料理。",
        "translation": "I'm elderly and unable to take care of things.",
        "source": "T24n1448_010:0046a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此隣家有少壯女，彼能料理。」",
        "translation": "But there's a young and strong woman in my neighborhood who can take care of her.\"",
        "source": "T24n1448_010:0046a24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀復詣彼所，告言：「姊妹！",
        "translation": "Ananta then went back to her and told her, \"Sister!",
        "source": "T24n1448_010:0046a25_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗能為佛料理此麥不？」",
        "translation": "Will you be able to prepare this wheat for the Buddha?\"",
        "source": "T24n1448_010:0046a26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人報曰：「聖者！",
        "translation": "The woman reported, \"Sage!",
        "source": "T24n1448_010:0046a26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能與我料理此麥已來，許我問答者，我即料理。」",
        "translation": "If you can work with me on this wheat and then give me permission to answer, I'll work on it.\"",
        "source": "T24n1448_010:0046a27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀曰：「可爾。」",
        "translation": "Ānanda said, \"That's right.\"",
        "source": "T24n1448_010:0046a28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼即料理。",
        "translation": "He then prepared it.",
        "source": "T24n1448_010:0046a28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時少女問阿難陀言：「聖者！",
        "translation": "The young woman then asked Ānanda, \"Sage!",
        "source": "T24n1448_010:0046a28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛名者，是何義耶？」",
        "translation": "What does it mean, 'the name of the Buddha'?\"",
        "source": "T24n1448_010:0046a29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀便作是念：「佛義甚深，難解難測。",
        "translation": "Ānanda then had this thought, \"The Buddha's teaching is so profound that it's difficult to understand and difficult to fathom.",
        "source": "T24n1448_010:0046b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若顯現，必不能了。",
        "translation": "If I were to reveal it, I wouldn't be able to understand it.",
        "source": "T24n1448_010:0046b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今且為宣揚轉輪王事。」",
        "translation": "Now, I'll proclaim the works of the wheel-turning king for you.\"",
        "source": "T24n1448_010:0046b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告言：「姊妹！",
        "translation": "He told them, \"Sister!",
        "source": "T24n1448_010:0046b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於世間，轉輪聖王出現於世，七寶隨現。",
        "translation": "If a wheel-turning sage king were to appear in the world, seven treasures would appear along with him.",
        "source": "T24n1448_010:0046b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何為七寶？",
        "translation": "What are the seven treasures?",
        "source": "T24n1448_010:0046b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂輪寶、象寶、馬寶、珠寶、女寶、主藏臣寶、主兵將寶、其輪寶等。",
        "translation": "They are called wheel treasure, elephant treasure, horse treasure, jewelry, women's treasure, the chief treasurer's treasure, the chief general's treasure, and their wheel treasure.",
        "source": "T24n1448_010:0046b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何出現於世？",
        "translation": "How do they appear in the world?",
        "source": "T24n1448_010:0046b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若剎帝利灌頂轉輪聖王，於十五日澡浴清淨，與諸臣佐昇高樓上。",
        "translation": "\"Suppose the wheel-turning sage king consecrated by Kārttieri washes himself clean on the fifteenth day, and he and his ministers ascend to a high building.",
        "source": "T24n1448_010:0046b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從於東方，輪寶來現，千輻轂輞皆悉圓備，如天金色自然而成。",
        "translation": "From the east, a wheel-treasure appears, and its thousand-spoked hub and ring are all perfectly proportioned, like the golden color of the sky naturally formed.",
        "source": "T24n1448_010:0046b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見作念：『我曾聞說，若剎帝利灌頂大王，於十五日澡浴清淨，登高樓上，有輪來現，必得成就轉輪聖王。",
        "translation": "The king saw this and thought, 'I've heard that if the great king consecrated by Zetri once took a bath and purified himself on the fifteenth day and ascended to a high building, a wheel would appear, and he would surely achieve the status of wheel-turning sage king.",
        "source": "T24n1448_010:0046b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今試之。』",
        "translation": "Now, I'll try it.'",
        "source": "T24n1448_010:0046b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從坐起，膝輪著地，右手捧輪，按左手掌，左手捧取，按右掌中，王即發願：『勝妙輪寶，如先過去轉輪聖王所行之事，願見示現。』",
        "translation": "Rising from his seat, he put his knees on the ground, held the wheel in his right hand, pressed it into his left palm, and picked it up with his left hand and pressed it into his right palm, and the king then vowed, 'May I see the manifestation of the wonderful wheel treasure, just like what the wheel-turning sage king did in the past.'",
        "source": "T24n1448_010:0046b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王與輪寶，及四種兵，便得昇空。",
        "translation": "The king, the wheel-treasure, and the four kinds of soldiers then ascended into the sky.",
        "source": "T24n1448_010:0046b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如先輪王所行之處，輪所住處，王亦隨住。",
        "translation": "Just like what the wheel-turning sage king did in the past, where the wheel stands, the king also stands.",
        "source": "T24n1448_010:0046b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時東方八萬四千諸小國王，咸詣轉輪王所，白言：『善來大天！",
        "translation": "It was then that 84,000 heads of lesser states in the east all went to the wheel-turning king and said, 'Good lord, great god!",
        "source": "T24n1448_010:0046b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是王國，人民熾盛，安穩豐樂。",
        "translation": "'This is a kingdom where the people are flourishing and there's peace and plenty of happiness.",
        "source": "T24n1448_010:0046b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願天王安住於此，臣等侍衛。』",
        "translation": "May the king of gods abide here in peace while we serve him.'",
        "source": "T24n1448_010:0046b18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輪王勅曰：『卿等各宜正法化世，有非法者勿為共住。",
        "translation": "The wheel-turning king commanded him, 'You should each teach the world the right way, and don't allow anyone who doesn't teach to live with you.",
        "source": "T24n1448_010:0046b19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如斯者，侍衛於我。』",
        "translation": "If that's the case, you'll serve me.'",
        "source": "T24n1448_010:0046b20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時輪寶，而於東方乃至海際，悉皆降伏；南西北方，亦復如是。",
        "translation": "The wheel-treasure then subdued them all, from the east to the edge of the ocean, and so did the south, west, and north.",
        "source": "T24n1448_010:0046b21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依輪寶法，昇空遍遊，還至王宮，住王殿前。",
        "translation": "Relying on the Wheel-Treasure's teachings, he rose into the sky and traveled around, returned to the king's palace, and stayed in front of the king's hall.",
        "source": "T24n1448_010:0046b22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姊妹！",
        "translation": "Sister!",
        "source": "T24n1448_010:0046b23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若轉輪王，出現世間，如是輪寶，必當顯現。",
        "translation": "If the wheel-turning king were to appear in the world, this kind of wheel treasure would surely be revealed.",
        "source": "T24n1448_010:0046b23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言象寶者，作蓮花色，七支圓備，形體姝好，肥壯勇健，甚可愛樂。",
        "translation": "It's called the elephant treasure, which is lotus-colored, has seven well-balanced limbs, has a beautiful body, is sturdy and courageous, and is very desirable.",
        "source": "T24n1448_010:0046b24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王若見已，心生歡悅，作如是語：『象寶善賢。』",
        "translation": "If the king's heart rejoices after seeing it, he says, 'The elephant treasure is good and wise.'",
        "source": "T24n1448_010:0046b26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即令使喚善調象師，告言：『此善象寶，宜速善調。",
        "translation": "He then had his messenger summon a master elephant trainer who was well trained and told him, 'It's appropriate to quickly and skillfully tame this good elephant treasure.",
        "source": "T24n1448_010:0046b27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善調順已，送於我所。』",
        "translation": "After it's well-tuned and compliant, send it to me.'",
        "source": "T24n1448_010:0046b28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：『如王教勅。』",
        "translation": "He said, 'As the king has instructed.'",
        "source": "T24n1448_010:0046b28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於一日中，所應調者悉皆調之。",
        "translation": "In a single day, they'll tame whatever should be tamed.",
        "source": "T24n1448_010:0046b29_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此象寶，其性賢善，能隨調法，如百歲象學調之相。",
        "translation": "This elephant treasure, however, is good by nature and can follow the tuning procedures like a hundred-year-old elephant learning to tame.",
        "source": "T24n1448_010:0046b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見象調已，即將奉王，白言：『大王！",
        "translation": "After he saw the elephant in tune, he came up to the king and said, 'Great king!",
        "source": "T24n1448_010:0046c02_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "象寶調善，王自知時。』",
        "translation": "The elephant's treasure is well adjusted, and the king knows when it's time.'",
        "source": "T24n1448_010:0046c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲試象，日初出時，乘象出宮遍遊四天，食時還至本宮喫食。",
        "translation": "When the sun first rises, the king wants to test the elephant, so he rides it out of the palace on a tour of the four heavens and returns to his palace to eat when it's time to eat.",
        "source": "T24n1448_010:0046c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姊妹！",
        "translation": "Sister!",
        "source": "T24n1448_010:0046c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若轉輪王出現世間，如此象寶方出於世。",
        "translation": "If a wheel-turning king were to appear in the world, then this kind of elephant treasure would emerge in the world.",
        "source": "T24n1448_010:0046c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言馬寶者，如紺青色，頭黑光悅，形狀端正，甚可愛樂。",
        "translation": "It's called a horse treasure that's as deep as a deep blue color, has a shiny black head, and is correctly shaped, which is very desirable.",
        "source": "T24n1448_010:0046c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王若見之，情甚歡悅，令此馬寶，具大賢相。",
        "translation": "If the king sees it, he'll be delighted and cause this horse treasure to have the characteristics of a great sage.",
        "source": "T24n1448_010:0046c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喚調馬者，令速調伏。",
        "translation": "He summons the horse trainer to quickly tame him.",
        "source": "T24n1448_010:0046c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即依王命，以調馬法，於一日中皆悉教授，亦如上說。",
        "translation": "He then complies with the king's order and teaches him the methods for training horses throughout the day, just as he described above.",
        "source": "T24n1448_010:0046c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善調畢已，牽奉王前，白言：『大王！",
        "translation": "After he had finished training them well, he led them to the king and said, 'Great king!",
        "source": "T24n1448_010:0046c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬寶調已，願王知時。』",
        "translation": "After the horse treasure is trained, may the king know when it's time.'",
        "source": "T24n1448_010:0046c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王欲試馬，日初出時，亦乘馬寶遊四天下，具如上說。",
        "translation": "When the king wants to test his horse, he also travels around the four heavens in a horse treasure when the sun first rises, as explained above.",
        "source": "T24n1448_010:0046c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姊妹！",
        "translation": "Sisters!",
        "source": "T24n1448_010:0046c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若轉輪王出現世間，而此馬寶方現於世。",
        "translation": "If a wheel-turning king were to appear in the world, then this horse treasure would only appear in the world.",
        "source": "T24n1448_010:0046c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言珠寶者，有如是形色，八楞具足，紺琉璃色，清淨鮮潔，光明輝耀，破諸幽暗。",
        "translation": "It's called a jewel that has this shape and color, is fully endowed with the eight flutes, is violet in color, is pure and clean, and shines brightly, and refutes darkness.",
        "source": "T24n1448_010:0046c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姊妹！",
        "translation": "Sisters!",
        "source": "T24n1448_010:0046c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其珠寶有如是功德，轉輪王出現，珠寶方現於世。",
        "translation": "Such are the merits of their jewelry that the jewels appear in the world only when the wheel-turning king appears.",
        "source": "T24n1448_010:0046c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言女寶者，形儀端正，容貌超絕，不白不黑、不黃不赤、不長不短、不麁不細，身諸毛孔出栴檀香，口氣香潔如青蓮花，寒時觸即溫煖、熱時觸即清涼。」",
        "translation": "It's called a woman's jewel that's well-formed, has an extraordinary appearance, isn't white or black, yellow or red, long or short, crude or fine, and has the fragrance of sandalwood coming from her pores, and her breath smells clean like a blue lotus flower that's warm and inviting when touched when it's cold and cool when touched when it's hot.\"",
        "source": "T24n1448_010:0046c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時具壽阿難陀為說輪王七寶，至女寶時，而彼女人料理麥了，即便頂禮阿難陀，合掌發願：「願我以斯福業，當作輪王女寶。」",
        "translation": "When Ananta with long life explained the wheel-turning king's seven treasures and arrived at the woman's treasure, the woman who prepared the wheat even paid homage to Ananta, put her palms together, and vowed, \"May I, with this meritorious act, become the wheel-turning king's woman treasure.\"",
        "source": "T24n1448_010:0046c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀持至佛所，諸佛世尊無不覺了，知而故問。",
        "translation": "When Ānanda carried it to the Buddha, none of the buddhas or world-honored ones realized it and asked about it because they knew it.",
        "source": "T24n1448_010:0046c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難陀曰：「誰料理麥耶？」",
        "translation": "The Buddha told Ānanda, \"Who's been tending wheat?\"",
        "source": "T24n1448_010:0046c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀白言：「大德世尊！",
        "translation": "Ānanda said, \"Bhagavān!",
        "source": "T24n1448_010:0046c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一婆羅門女。」",
        "translation": "There's a Brāhmaṇa woman.\"",
        "source": "T24n1448_010:0046c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復問曰：「汝與彼有何言說？」",
        "translation": "The Buddha again asked, \"What did you tell her?\"",
        "source": "T24n1448_010:0046c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「共語。」",
        "translation": "He said, \"Speak together.\"",
        "source": "T24n1448_010:0046c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難陀：「汝與彼女，所有言語，為我說之。」",
        "translation": "The Buddha told Ānanda, \"You and that woman, whatever you say, speak it for me.\"",
        "source": "T24n1448_010:0046c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀奉教具陳。",
        "translation": "Ananta did as he was instructed and explained it fully.",
        "source": "T24n1448_010:0046c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復告阿難陀曰：「何故不與顯說佛德，說轉輪王耶？」",
        "translation": "Again, the Buddha told Ānanda, \"Why didn't you tell her about the merits of the Buddha and about the wheel-turning king?\"",
        "source": "T24n1448_010:0046c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「大德！",
        "translation": "He said, \"Great virtue!",
        "source": "T24n1448_010:0046c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我作是念：『佛德甚深，恐彼女人不能悟解。』",
        "translation": "I thought, 'The Buddha's virtue is so profound, I'm afraid that woman won't be able to understand it.'",
        "source": "T24n1448_010:0046c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故為彼，說轉輪王。」",
        "translation": "Therefore, I'll explain it for them as a wheel-turning king.\"",
        "source": "T24n1448_010:0047a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難陀！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T24n1448_010:0047a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝為過失。",
        "translation": "\"You're wrong.",
        "source": "T24n1448_010:0047a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為彼女人若說佛德，而彼女人聞佛功德，必發無上正等覺心，而不退轉。",
        "translation": "If you were to explain the merits of the Buddha for that woman, and she hears about the Buddha's merits, she will certainly arouse the mind of unsurpassed perfect enlightenment and won't turn back.",
        "source": "T24n1448_010:0047a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由斯願力，然此女人，必當得作輪王女寶。」",
        "translation": "Because of this power of the vow, this woman will surely become a wheel-turning kingess.\"",
        "source": "T24n1448_010:0047a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時遠近人眾，咸聞婆羅門女料理佛麥，蒙佛記為當作轉輪聖王女寶。",
        "translation": "It was then that people from far and near heard that the Brāhmaṇa woman who prepared the Buddha's barley was credited by the Buddha with making her the jewel of a wheel-turning sage king's daughter.",
        "source": "T24n1448_010:0047a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時遂有五百女人來苾芻處所，將麥料理，咸發誓願：「若彼女人，作轉輪王女寶之時，我等咸願與彼侍衛。」",
        "translation": "Then, five hundred women came to the Bhikṣu and prepared the wheat, each vowing, \"When that woman becomes the wheel-turning sage king's lady treasure, we'll all want to serve her.\"",
        "source": "T24n1448_010:0047a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊欲食馬麥，具壽阿難陀悲泣雨淚：「世尊遊行所至之處，國王勝貴，持佛足土而為頂戴。",
        "translation": "When the Bhagavān wanted to eat some horse barley, Kauṇḍinya Ānanda wept and wept, \"Where the Bhagavān travels, the king is so distinguished and noble that he holds the Buddha's feet in his land and venerates them.",
        "source": "T24n1448_010:0047a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於三大劫修諸善品，何為於此城中食斯麁麥？」",
        "translation": "Why did he cultivate good qualities during three great eons, but why did he eat this crude wheat in this city?\"",
        "source": "T24n1448_010:0047a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時佛告具壽阿難陀曰：「汝今何故悲泣雨淚？」",
        "translation": "The Buddha then addressed Kauśāmbī Ananta, \"Why are you weeping and wailing now?\"",
        "source": "T24n1448_010:0047a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「大德世尊生在王宮，合受轉輪王位王四天下；棄捨國榮而為出家，經三無數大劫，廣施頭目手足，具一切智，廣受人天殊勝妙供。",
        "translation": "He said, \"The Bhagavān was born in a king's palace, was united with the position of wheel-turning king, ruled the four worlds, renounced the country's glory, left home, passed through three incalculably long eons, gave generously of his head, eyes, hands, and feet, acquired omniscience, and received an excellent and marvelous offering from humans and gods.",
        "source": "T24n1448_010:0047a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何今欲食馬麥耶？」",
        "translation": "Why do you now want to eat horse feed?\"",
        "source": "T24n1448_010:0047a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難陀！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T24n1448_010:0047a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今能食如來牙齒之中一粒麥不？」",
        "translation": "Now, can you eat a grain of wheat from the Tathāgata's teeth?\"",
        "source": "T24n1448_010:0047a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白言：「甚欲。」",
        "translation": "He said, \"I really want that.\"",
        "source": "T24n1448_010:0047a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛於牙中，取一粒麥與阿難陀，即便食噉。",
        "translation": "The Buddha took a grain of wheat from his teeth and gave it to Ānanda, who then ate and devoured it.",
        "source": "T24n1448_010:0047a18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛問阿難陀：「汝頗曾得如是甘美所食不？」",
        "translation": "The Buddha asked Ānanda, \"Have you ever had anything as delicious as this to eat?\"",
        "source": "T24n1448_010:0047a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「大德世尊！",
        "translation": "He replied, \"Bhagavān!",
        "source": "T24n1448_010:0047a20_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我雖生在輪王族內，能自食噉已來，口未曾得如斯美味。」",
        "translation": "Even though I was born into a clan of wheel-turning kings, I've never had such delicious food in my mouth since I was able to eat it myself.\"",
        "source": "T24n1448_010:0047a20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「阿難陀！",
        "translation": "The Buddha said, \"Ānanda!",
        "source": "T24n1448_010:0047a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來凡所入口，皆為甘美，百味中勝。」",
        "translation": "Whatever the Tathāgata inhales is sweet and delicious, superior among the hundred flavors.\"",
        "source": "T24n1448_010:0047a22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時遠近諸國隣王，咸悉知聞其火授王請佛世尊及苾芻僧伽三月安居，便自入密宮而不出現，不興供養，佛喫馬麥。",
        "translation": "It was then that the neighboring kings of countries near and far all learned that their fire-granting king had invited the Bhagavān and the monks of the monastery to stay for three months, so he had gone into the hidden palace without appearing, making no offerings, and having the Buddha eat horse barley.",
        "source": "T24n1448_010:0047a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞已發使報火授王，其使既此，不許入見，在門首住。",
        "translation": "After hearing this, he sent an envoy to report the fire to the king, but when the envoy did so, he was not allowed to enter or see them and stayed at the head of the gate.",
        "source": "T24n1448_010:0047a25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時給孤長者聞斯事已，五百乘車各載精妙粳米，封閉密蓋，擬送佛所。",
        "translation": "When the elder Vikram heard about this, he sent five hundred chariots each loaded with fine millet, sealed them up under a secret lid, and intended to send them to the Buddha.",
        "source": "T24n1448_010:0047a27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時惡魔作念：「我已多種惱亂沙門喬答摩，不得其便，更宜惱亂，今正得時。」",
        "translation": "It was then that Māra thought, \"I've already troubled the ascetic Gautama in so many ways that I haven't been able to get an advantage over him, so now is the right time to do so.\"",
        "source": "T24n1448_010:0047a28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，即變身而為阿難陀形，往五百車處，告言：「諸仁欲何所去？」",
        "translation": "After he had this thought, he transformed himself into the shape of Ānanda and went to the five hundred chariots and told them, \"Where do you gentlemen want to go?\"",
        "source": "T24n1448_010:0047b01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「聖者阿難陀！",
        "translation": "He replied, \"Sage Ānanda!",
        "source": "T24n1448_010:0047b03_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等聞火授王請佛僧伽三月安居，不興供養，佛及僧伽而噉馬麥。",
        "translation": "We heard that the fire king invited the Buddha and Saṃgha to stay for three months without making any offerings, and that the Buddha and Saṃgha instead ate horse feed.",
        "source": "T24n1448_010:0047b03_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以給孤長者令將此米，奉獻世尊。」",
        "translation": "That's why I gave this rice to the elder Gokul to present to the Bhagavān.\"",
        "source": "T24n1448_010:0047b05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔曰：「天、龍、藥叉敬重世尊，舉鉢向上，三十三天精妙香饌置於鉢中。",
        "translation": "Māra said, \"The gods, dragons, and yakṣas revere the Bhagavān and lift their bowls upward, placing delicately scented foods from the Trāyastriṃśa gods in their bowls.",
        "source": "T24n1448_010:0047b05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故世尊而食馬麥？",
        "translation": "Why is it that the Bhagavān is eating horse barley?",
        "source": "T24n1448_010:0047b07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜可急迴。」",
        "translation": "It's better to turn back quickly.\"",
        "source": "T24n1448_010:0047b07_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人答曰：「我既已出，詣世尊所，不欲却迴。」",
        "translation": "The people replied, \"Now that I've left and arrived at the Bhagavān's place, I don't want to turn back.\"",
        "source": "T24n1448_010:0047b08_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔復作念：「而此諸人不受我教，可作方便。」",
        "translation": "Again, Māra thought, \"Since these people didn't accept my teaching, I could make it easier for them.\"",
        "source": "T24n1448_010:0047b09_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即昇虛空，起大風雨，降如車軸，令其米車咸半溺泥，駕者解牛隨緣而去。",
        "translation": "He then rose into the sky, created a great wind and rain, rained down like a chariot axle, and caused the rice chariot to be half submerged in mud, and the driver unloaded the oxen and departed with them.",
        "source": "T24n1448_010:0047b10_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊與苾芻僧伽而食馬麥，尊者舍利弗及大目連往三峯山受天供養。",
        "translation": "The Bhagavān and his monks and nuns ate horse barley, and Venerable Śāriputra and Mahāmaudgalyāyana went to Mount Sambong to accept offerings from the gods.",
        "source": "T24n1448_010:0047b11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其馬商主，三月既周，來請世尊：「唯願哀愍，與苾芻僧伽，受我微供。」",
        "translation": "After three months had passed, the horse trader came to the Bhagavān, \"Please have mercy on us and accept our humble offerings with the monks and nuns of the monastery.\"",
        "source": "T24n1448_010:0047b13_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛默受請。",
        "translation": "The Buddha accepted the invitation in silence.",
        "source": "T24n1448_010:0047b15_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知佛受已，於其夜中，辦種種精妙飲食，廣如餘說。",
        "translation": "After he knew the Buddha had accepted it, he prepared a delicious meal during the night, which was as detailed as the rest of the explanation.",
        "source": "T24n1448_010:0047b15_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至飯食已，收鉢竟，洗漱淨已，投佛足下，而發誓願：「所有善根，願我當來作轉輪王。",
        "translation": "When he had finished eating, he put away his bowl, washed and purified it, threw himself at the Buddha's feet, and vowed, \"With all my good roots, may I become a wheel-turning king in the future.",
        "source": "T24n1448_010:0047b16_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其乘智馬，當為太子。",
        "translation": "His vehicle, the horse of wisdom, will be the crown prince.",
        "source": "T24n1448_010:0047b18_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百匹馬，而為我子。",
        "translation": "Five hundred horses will be my sons.",
        "source": "T24n1448_010:0047b18_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所記女，為我女寶。",
        "translation": "The woman remembered by the Buddha will be my female treasure.",
        "source": "T24n1448_010:0047b19_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘五百女，為我宮婇女。」",
        "translation": "The other 500 women will be my palace maidens.\"",
        "source": "T24n1448_010:0047b19_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時世尊既知彼念，告言：「商主！",
        "translation": "Knowing this thought, the Bhagavān then told him, \"Master merchant!",
        "source": "T24n1448_010:0047b20_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今所願，當來必就。」",
        "translation": "What you wish now will be fulfilled in the future.\"",
        "source": "T24n1448_010:0047b20_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶藥事卷第十",
        "translation": "Mūlasarvâstivāda-vinaya-medicine, Volume 10",
        "source": "T24n1448_010:0047b22_0",
        "is_bad_quality": false
    }
]