[
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事",
        "translation": "Mūlasarvâstivāda-vinaya-vijñāna-breaking-saṃgha",
        "source": "T24n1450_013:0164a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷第十三",
        "translation": "Vol. 13",
        "source": "T24n1450_013:0164a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐三藏法師義淨奉　制譯",
        "translation": "Translated by the Tripiṭaka Master Yijing of the Great Tang",
        "source": "T24n1450_013:0164a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在劫比羅城尼瞿陀園中，當度五百釋子及鄔波離時，諸苾芻咸皆有疑，以緣白佛：「此鄔波離昔作何業為王剃士？」",
        "translation": "When the Buddha was in the garden of Nigrodha in Kapilavastu, and he was about to pass away five hundred Śākyamuni sons and Upāli, the monks all had doubts and cited the Buddha as a reason, \"What did this Upāli do in the past to become the king's shaver?\"",
        "source": "T24n1450_013:0164a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸苾芻：「往昔國王，有一剃頭人，有辟支佛來立門前，語彼人曰：『善男子！",
        "translation": "It was then that the Buddha addressed the monks, \"Once upon a time, there was a shaven-headed man, a king, and a pratyekabuddha came and stood in front of his gate and said to him, 'Good man!",
        "source": "T24n1450_013:0164a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與我剃頭當獲善果。』",
        "translation": "Shave your head with me, and you'll attain a good result.'",
        "source": "T24n1450_013:0164a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼剃頭人有一外甥，其舅告曰：『我為王使，汝可於後當為此人如法而剃如國王一種。』",
        "translation": "That man who shaves his head has a nephew, and his uncle tells him, 'I'm the king's envoy, so you can shave this man's head afterward according to the teaching, just like the king.'",
        "source": "T24n1450_013:0164a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼外甥聞舅是言，即自思惟：『遣與此人如法剃頭，必應多得功德。』",
        "translation": "When the nephew heard what his uncle said, he thought to himself, 'If I send this man to shave his head according to the teaching, I'm sure he'll attain much merit.'",
        "source": "T24n1450_013:0164a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已即便諦念，為辟支佛如法剃頭。",
        "translation": "After he thought this, he then mindfully considered and shaved Pārśva's head according to the teaching.",
        "source": "T24n1450_013:0164a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛復思念云：『彼人與我如法剃頭，我當護助必令此人多獲利益。』",
        "translation": "The Vairocana Buddha then also thought, 'That person and I will shave their hair according to the teaching, and I will guard and assist them so that they will receive many benefits.'",
        "source": "T24n1450_013:0164a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時辟支佛作是念已，即騰虛空變現種種神變，彼人見已甚生希有，合掌禮敬五體投地，便發願云：『我今既與此人剃頭，如國王相似，願我來生於世世中，常得與諸國王剃頭，如我舅無異。』」",
        "translation": "After he had that thought, the Pārśva Buddha rose into the sky and conjured up various miraculous powers, and when he saw that person, he was so impressed that he put his palms together, saluted him, threw his five bodies to the ground, and vowed, 'Now that I've shaved my head with this person, just like a king, may I always be born in the future and shave my head with other kings, just like my uncle.'\"",
        "source": "T24n1450_013:0164b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「彼時外甥者，今鄔波離是。",
        "translation": "The Buddha told the monks, \"That nephew of his was now Upāli.",
        "source": "T24n1450_013:0164b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由於先世與辟支佛剃頭發願故，今與王為剃頭人。」",
        "translation": "Because he shaved his head with Pārśva in a previous life and made the vow, now he's shaving his head with the king.\"",
        "source": "T24n1450_013:0164b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛復告諸苾芻：「此鄔波離於先世時復有餘願，我今說之，汝等諦聽。",
        "translation": "It was then that the Buddha again addressed the monks, \"This Upāli had another vow in a previous life, which I'm going to tell you about, so listen closely.",
        "source": "T24n1450_013:0164b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往昔村中有一長者，取得一妻生於二男。",
        "translation": "Once upon a time, there was an elder in a village who took a wife and produced two sons.",
        "source": "T24n1450_013:0164b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼時國王，有一剃頭人，與此長者共為親友。",
        "translation": "At the time, the king had a man who shaved his head and was a friend of that man's.",
        "source": "T24n1450_013:0164b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼剃頭人甚有財寶，無有男女，常私念云：『我今多諸財物，而無子息，一旦終沒無可委付，必被國王盡取將去。』",
        "translation": "That shaven-headed man had great wealth and no sons or daughters, and he used to think to himself, 'Now, I have a lot of possessions and no children, and once I end up with nothing to entrust, the king will surely take them all and leave them.'",
        "source": "T24n1450_013:0164b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者見剃頭人愁憂不樂，即便問曰：『汝今云何愁憂如此？』",
        "translation": "When that elder saw that the head-shaver was sad and unhappy, he asked, 'Why are you so sad and unhappy now?'",
        "source": "T24n1450_013:0164b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時剃頭人即如上答。",
        "translation": "The head-shaver then answered as above.",
        "source": "T24n1450_013:0164b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者告曰：『我有二子，今將小者與汝為子。』",
        "translation": "The elder told him, 'I have two sons, and now I'm going to give you the younger one as my son.'",
        "source": "T24n1450_013:0164b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是議已，便取小兒以為其子。",
        "translation": "After he made this suggestion, he then took the younger one and made him his son.",
        "source": "T24n1450_013:0164b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後時長者遇病命終，長者太子與諸童兒共相嬉戲，因或鬪罵，諸童子言：『汝非族姓。",
        "translation": "When the elder met with illness and died, the elder prince and the boys were playing together, and they were fighting and insulting each other, and the boys said, 'You're not from my family.",
        "source": "T24n1450_013:0164b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_013:0164b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝弟見為剃頭家子。』",
        "translation": "Your younger brother sees that he's the son of a shaven-headed monk.'",
        "source": "T24n1450_013:0164b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時此兒，既被斯言愁悴不樂，便私念云：『若我小弟不與剃頭家為子者，我今云何被他毀辱？",
        "translation": "At the time, this child was so distressed and upset by what he said that he privately thought, 'If my little brother hadn't been the son of a head shaver, how would I have been disgraced by him now?'",
        "source": "T24n1450_013:0164b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今應當收奪取弟。』",
        "translation": "'Now, I should take the younger brother and seize him.'",
        "source": "T24n1450_013:0164b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已即奪弟歸。",
        "translation": "After he thought this, he took his younger brother and returned him.",
        "source": "T24n1450_013:0164b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時剃頭人心懷懊惱，便集其家剃頭種類，告彼眾曰：『我養彼兒經多年歲，今奪將去。",
        "translation": "The shaver's mind was distressed, so he gathered the shaving heads of his family and told the crowd, 'I've raised that son for years, and now I'm taking him away.",
        "source": "T24n1450_013:0164b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我諸眷屬自今以後，勿與此家作剃頭人。』",
        "translation": "From now on, my family members mustn't work with this family as head shavers.'",
        "source": "T24n1450_013:0164b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼兄弟不得剃頭，髮毛爪甲皆悉長醜。",
        "translation": "Those brothers then weren't allowed to shave their heads, and their hair, nails, and nails all grew ugly.",
        "source": "T24n1450_013:0164b27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王忽見即便問曰：『汝今云何髮毛爪甲作許長醜？』",
        "translation": "The king suddenly saw them and asked, 'Why have your hair, nails, and nails grown so long and ugly?'",
        "source": "T24n1450_013:0164b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼兄弟答國王言：『王剃頭人制諸種類，令於我家勿為剃頭。』",
        "translation": "Those brothers then answered the king, 'The king's head shavers make various kinds of decisions, so they don't shave my head at home.'",
        "source": "T24n1450_013:0164b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王重問曰：『彼有何故？』",
        "translation": "The king repeatedly asked, 'What's the reason for that?'",
        "source": "T24n1450_013:0164c01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼兄弟具說前事。",
        "translation": "Those brothers then explained the previous events.",
        "source": "T24n1450_013:0164c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王聞已即便告言：『父與他兒，不合更奪。』",
        "translation": "After hearing this, the king even told them, 'A father's son and another's son can't be taken away from each other.'",
        "source": "T24n1450_013:0164c02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既奉王教，即便將弟與彼為兒。",
        "translation": "After he obeyed the king's teaching, he even gave his younger brother to be his son.",
        "source": "T24n1450_013:0164c03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後兄議曰：『由弟與彼剃頭為子，恒令我等被他毀辱，我今應當殺去我弟，必免斯語。』",
        "translation": "The latter brother then said, 'Because my younger brother and that shaven-headed man are my sons, we've always been disgraced by them; now, I should kill my brother and be spared such talk.'",
        "source": "T24n1450_013:0164c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有人聞，往剃頭家告其弟曰：『汝兄等議，恐辱種族，當欲殺汝，宜善防護。』",
        "translation": "When someone heard this, they went to the shaven head's house and told his younger brother, 'Your brother and the others say they're afraid they'll insult our race and want to kill you, so you should guard yourself well.'",
        "source": "T24n1450_013:0164c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟聞是語已告剃頭人曰：『兄今欲來殺我，今宜放我出家學諸仙道。』",
        "translation": "After hearing this, the younger brother told the head shaver, 'Now that you want to kill me, you should let me go home and train in the ways of the sages.'",
        "source": "T24n1450_013:0164c07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剃頭人念：『我若苦留此兒不許出家，必被他殺。",
        "translation": "The head-shaver thought, 'If I had painfully kept this child from leaving home, he would have been killed by others.",
        "source": "T24n1450_013:0164c09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今不如放令出家。』",
        "translation": "Now, I might as well let him leave home.'",
        "source": "T24n1450_013:0164c10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父既念已告其兒曰：『我今放汝出家，汝得仙法將歸教我。』",
        "translation": "After he had thought this, the father told his son, 'Now, I'll let you leave home, and you'll get the immortal teachings and return to me.'",
        "source": "T24n1450_013:0164c10_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子便白曰：『善哉！",
        "translation": "The son then said, 'Good!",
        "source": "T24n1450_013:0164c12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉命。』",
        "translation": "'As ordered.'",
        "source": "T24n1450_013:0164c12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時其子即往山林仙人住處，尋諸仙人了不相見，即自端坐繫念思惟，便證辟支佛果。",
        "translation": "His son then went to the sages' dwelling in the mountain forest, searched for the sages and didn't see them, sat himself down, concentrated his thoughts, and realized the fruit of pratyekabuddha.",
        "source": "T24n1450_013:0164c12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既證果已即便念云：『我先與義父共言誓曰：「若得善法歸來相教。」』",
        "translation": "After realizing the fruit, he then remembered, 'First, I vowed with my rightful father, 'If I attain the good Dharma, I'll return to teach it to you.'",
        "source": "T24n1450_013:0164c14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已即往父所，到已騰空作諸神變。",
        "translation": "After that thought, he went to his father's place and ascended into the air when he arrived, performing miraculous feats.",
        "source": "T24n1450_013:0164c16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其父見已心甚歡喜，合掌發願：『令我世世常與國王作剃頭人。』",
        "translation": "When his father saw this, he was overjoyed, put his palms together, and vowed, 'Let me always be with the king as a shaver of heads from generation to generation.'",
        "source": "T24n1450_013:0164c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時剃頭人於後值五辟支佛，皆發斯願：『令我世世為諸國王作剃頭人。』",
        "translation": "The head shaver then met five pratyekabuddhas later in life, and they all made this vow: 'That I may always be a head shaver for the kings of the world.'",
        "source": "T24n1450_013:0164c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於四生值佛世尊，亦發斯願。」",
        "translation": "Again, when they meet the Bhagavān in four lifetimes, they also give rise to this vow.\"",
        "source": "T24n1450_013:0164c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「彼剃頭人者，今鄔波離是。",
        "translation": "The Buddha told the monks, \"That shaven-headed person is now Upāli.",
        "source": "T24n1450_013:0164c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由先世時發斯願故，今為國王作剃頭人。」",
        "translation": "Because he made this vow in a prior life, he'll now be the king's head-shaver.\"",
        "source": "T24n1450_013:0164c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次諸苾芻，復作是疑：「鄔波離作何福業，證阿羅漢持律第一？」",
        "translation": "Again, the monks wondered, \"What meritorious action did Upāli perform that made him realize that the arhat is the best in upholding the precepts?\"",
        "source": "T24n1450_013:0164c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「其鄔波離復有因緣。",
        "translation": "The Buddha said, \"Upāli has further causes and conditions.",
        "source": "T24n1450_013:0164c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等善聽，我今為說。",
        "translation": "Listen well, and I will explain it for you now.",
        "source": "T24n1450_013:0164c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃往過昔於賢劫中人壽二萬歲，有佛世尊出現於世，號曰迦攝波如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "Once upon a time, during a life of 20,000 years in a good eon, a world-honored Buddha appeared in the world and was called Kāśyapa Tathāgata, Worthy of Offerings, Perfectly Omniscient, Perfect in Knowledge, Well Gone, Understander of the World, Unsurpassed Person, Tamer of Beings, Teacher of Gods and People, Buddha, and World Honored One.",
        "source": "T24n1450_013:0164c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛有一弟子，是阿羅漢，持律為最。",
        "translation": "At the time, the Buddha had a disciple who was an arhat and held the precepts the best.",
        "source": "T24n1450_013:0164c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時鄔波離為彼弟子，終身梵行不獲果利，臨終之時而發誓願：『我所持戒福業善根，願我當來釋迦牟尼如來出現世時，與彼世尊作持律弟子，如我鄔波馱耶無異。』",
        "translation": "When he was dying, Upāli became his disciple and spent his whole life in religious practice without reaping any benefits, and he made a vow: 'With all the virtuous and good roots of my moral discipline, may I, when the Tathāgata Śākyamuni appears in the world in the future, be a disciple of that Bhagavān who observes the precepts like I, Upādhyāya, am no different from him.'",
        "source": "T24n1450_013:0164c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其弟子者，即鄔波離是，為先發願故，今獲斯果。",
        "translation": "That disciple is Upāli, who has now attained this fruit because of a vow he made earlier.",
        "source": "T24n1450_013:0165a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故苾芻！",
        "translation": "Therefore, monks!",
        "source": "T24n1450_013:0165a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "黑業黑業報，白業白業報，雜業雜業報。",
        "translation": "The result of black karma is black karma, white karma is white karma, and mixed karma is mixed karma.",
        "source": "T24n1450_013:0165a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應捨二業繼修白業，乃至廣說如前。」",
        "translation": "You should abandon the two actions and then cultivate the white action, up to the point where it's explained in detail as before.\"",
        "source": "T24n1450_013:0165a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊在菩提樹下，降伏三十六俱胝魔軍，證得無上正遍知覺。",
        "translation": "At the time, the Bhagavān was under the bodhi tree, subduing an army of thirty-six corpuscles of Māra and realizing unsurpassed perfect enlightenment.",
        "source": "T24n1450_013:0165a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時魔即往劫比羅城，於虛空中告淨飯王及諸宮人群臣百姓曰：「沙門喬答摩今夜已死。」",
        "translation": "Māra then went to the city of Kapilavastu and told King Jōtan and the palace staff, ministers, and people in the sky, \"The ascetic Gautama has died this evening.\"",
        "source": "T24n1450_013:0165a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王聞之，心懷懊惱悶絕擗地，及諸宮人群臣百姓，亦皆如是悲泣懊惱。",
        "translation": "When he heard this, King Jōtan was overcome with distress and fell to the ground, and his palace and ministers and people were likewise saddened and distressed.",
        "source": "T24n1450_013:0165a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨居天觀察下方，乃見斯事即下空中，告迦比羅城國王人眾曰：「喬答摩不死，今在菩提樹下，證得無上正遍知道。」",
        "translation": "When the Jñānacitra gods looked down, they saw this and descended into the sky and told the king of Kapilavastu and his people, \"Gautama is not dead; now, under the bodhi tree, he has realized unsurpassed perfect knowledge.\"",
        "source": "T24n1450_013:0165a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨飯王及宮人國臣，忽聞此言踊躍歡喜。",
        "translation": "The king of Jīvaka and his palace staff and ministers suddenly rejoiced when they heard those words.",
        "source": "T24n1450_013:0165a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當此之時，甘露飯王誕生一子，以諸眾人歡喜日生故，因號此兒名曰阿難陀。",
        "translation": "At the time, a son was born to King Amṛtôdana, and because the people rejoiced at his birth on that day, they called his name Ānanda.",
        "source": "T24n1450_013:0165a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既生此兒，置八乳母共養育之。",
        "translation": "Once this child was born, he was nurtured by eight nursemaids.",
        "source": "T24n1450_013:0165a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時甘露王召諸相師，遣占此兒，相師報曰：「今汝此兒，當與釋迦牟尼佛親為侍者。」",
        "translation": "The king then summoned the fortune tellers and sent them to divine this child, and the fortune tellers replied, \"Now, this child of yours will become a personal attendant of Śākyamuni Buddha.\"",
        "source": "T24n1450_013:0165a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時甘露王既聞此言，便作是念：「今我此子宜加守護，不應令釋迦牟尼佛見。」",
        "translation": "Hearing this, King Amṛta then had this thought, \"Now, this son of mine should be guarded, so that Śākyamuni Buddha won't see him.\"",
        "source": "T24n1450_013:0165a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後時佛來至於劫比羅城，其王即將此子藏避於廣嚴城中，待佛去已還將歸來。",
        "translation": "When the Buddha arrived in Kapilavastu, the king hid his son in the city of Vairocana and returned after the Buddha's departure.",
        "source": "T24n1450_013:0165a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊常法：於一切眾生，心無不見、無有不知，此事於妄語戒中及十八頭魚中說並同，乃至世尊作如是念：「此阿難陀童子逮最後身，合於我法中而得出家為親侍者，我所說法皆能領受，更無遺失；我涅槃後成羅漢果。",
        "translation": "The Bhagavān's constant teaching that there's nothing the mind doesn't see and nothing it doesn't know about all sentient beings is the same as that explained in the precepts for false speech and the eighteen fish, up to the point where the Bhagavān had this thought, \"This boy Ānanda has caught his final body, so he'll be able to leave home in my Dharma and become a close attendant, and he'll be able to accept all the teachings I give him without losing them; after I nirvāṇa, he'll achieve the fruit of the arhat.",
        "source": "T24n1450_013:0165a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為度阿難陀故，須入劫比羅城甘露王宮，令彼王宮城人不知我來。」",
        "translation": "In order to deliver Ānanda, I must enter the palace of King Ambrosia in Kapilavastu so that the people of that palace won't know I'm here.\"",
        "source": "T24n1450_013:0165a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊作此念已，即作神通，并苾芻僧伽圍遶，入甘露王宮，如法而坐。",
        "translation": "After he had this thought, the Bhagavān then performed a miraculous act, surrounded by the monks and nuns of the city, and entered King Ambrosia's palace and sat down according to the teaching.",
        "source": "T24n1450_013:0165b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王聞佛到來宮內，即將阿難陀童子藏隱一房中，佛知是已即作神力，令彼房門自然開闢。",
        "translation": "When the king heard that the Buddha had arrived at his palace, he asked the boy Ānanda to hide in a room. Knowing this, the Buddha then performed a miraculous power that caused the door to that room to open naturally.",
        "source": "T24n1450_013:0165b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其阿難陀先至佛所禮世尊足，即便把拂在佛背後，侍立扇佛。",
        "translation": "Ananta first went to the Buddha and bowed his head at the Bhagavān's feet, then put his whisk behind the Buddha's back and stood to fan him.",
        "source": "T24n1450_013:0165b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其甘露王後來，禮世尊足已却坐一面，佛即為王說種種微妙法已，即從坐去。",
        "translation": "After he bowed his head at the Bhagavān's feet, King Amṛta withdrew to sit to one side, and the Buddha then taught the king various subtle teachings and departed from his seat.",
        "source": "T24n1450_013:0165b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其阿難陀童子，先業因緣故，還隨佛去。",
        "translation": "That boy Ānanda, because of the causes of his prior actions, returned and followed the Buddha.",
        "source": "T24n1450_013:0165b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王及夫人婇女眷屬，撮留阿難陀童子，亦不能留得住。",
        "translation": "The king and his wife, Hakuba, and their retinue tried to keep the boy Ānanda, but they couldn't.",
        "source": "T24n1450_013:0165b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即告王及夫人等：「此阿難陀童子是最後身。",
        "translation": "The Buddha then told the king and his wife, \"This boy Ānanda is the last body.",
        "source": "T24n1450_013:0165b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等亦不能留，宜應聽去。」",
        "translation": "You can't keep him, either, so you should listen and leave.\"",
        "source": "T24n1450_013:0165b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王即啟佛：「若當如此，世尊且放歸家，我當如法發遣。」",
        "translation": "The king then inspired the Buddha, \"If that's the way it should be, Bhagavān, please let him go home, and I will send him away according to the teaching.\"",
        "source": "T24n1450_013:0165b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「如是聽汝。」",
        "translation": "The Buddha said, \"So listen to you.\"",
        "source": "T24n1450_013:0165b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時甘露王即使諸內外一切親族，及請沙門婆羅門等設食供養，乃至貧窮下賤乞人皆施錢財衣服。",
        "translation": "King Amṛta then asked all his relatives, both internal and external, and invited ascetics, priests, and others to provide food and offerings, even to poor and humble beggars who gave them money and clothing.",
        "source": "T24n1450_013:0165b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀童子於其會中別諸親族，身著瓔珞乘七寶莊嚴象，多將侍衛前後圍遶，往尼拘律陀林中。",
        "translation": "Separate from his kinsmen at the assembly, the boy Ānanda rode in a decorated elephant adorned with seven jewels, surrounded by a multitude of attendants, and went to the forest of Nirgrantha.",
        "source": "T24n1450_013:0165b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至劫比羅城門，所乘之象見池中有諸妙蓮花，其象即往池邊，以鼻卷取蓮華。",
        "translation": "When he arrived at the gate of Kapilavastu, the elephant he was riding in saw a pond with marvelous lotus flowers, and it went to the edge of the pond and picked up the lotus flowers with its trunk.",
        "source": "T24n1450_013:0165b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其占相師占相此事，白甘露王曰：「阿難陀童子今出遊學，一聞於耳不忘於心。」",
        "translation": "The fortune teller read this and told King Amṛta, \"Now, Boy Ānanda has traveled to study, and once he hears this, he doesn't forget it in his mind.\"",
        "source": "T24n1450_013:0165b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀到尼拘林，從象而下步詣佛所，頂禮恭敬在一面坐。",
        "translation": "When Ānanda arrived at the forest of Nīgas, he descended from the elephant and went to the Buddha, paid homage to him, and sat to one side in respect.",
        "source": "T24n1450_013:0165b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告十力迦葉：「汝應與此大歡喜童子如法度之。」",
        "translation": "The Buddha told Śubhakarpaṇa, \"You should take this great joyful boy and teach him according to the teaching.\"",
        "source": "T24n1450_013:0165b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十力迦葉既奉佛命，即便度之為受具戒。",
        "translation": "Once he had obeyed the Buddha's order, Ten Mighty Kāśyapa was readmitted to receive the full set of precepts.",
        "source": "T24n1450_013:0165b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從劫比羅城，往王舍城竹林園中。",
        "translation": "The Bhagavān then left Kapilavastu and went to the bamboo grove in Rājagṛha.",
        "source": "T24n1450_013:0165b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀背上生一小瘡，佛令侍縛迦治之，即依佛教，為阿難陀治。",
        "translation": "A small sore had developed on Ānanda's back, and the Buddha told his attendant Vātsīputrīya to treat it and then he treated it for Ānanda according to the Buddhist teaching.",
        "source": "T24n1450_013:0165b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊坐師子座，為諸大眾廣說法要，具壽阿難陀亦在此會聽法。",
        "translation": "The Bhagavān was sitting on the lion's seat, explaining the essentials of the Dharma to the crowd, and Ananta, the Arhat of Longevity, was also present at the meeting listening to the Dharma.",
        "source": "T24n1450_013:0165b28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "侍縛迦作是念云：「我治阿難陀瘡，今正是時。",
        "translation": "Gavāṃpati thought, \"Now is the right time for me to treat Ānanda's sores.",
        "source": "T24n1450_013:0165c01_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_013:0165c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聽法心至，割截不知痛故。」",
        "translation": "Hearing the arrival of the teaching, they cut themselves off without knowing the pain.\"",
        "source": "T24n1450_013:0165c02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，便取妙藥傅其瘡上。",
        "translation": "After he thought this, he then took a wonderful potion and rubbed it on his sore.",
        "source": "T24n1450_013:0165c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瘡既熟已，以刀割之出其膿血，復以妙膏傅上，因即除差。",
        "translation": "After the sore had matured, he cut it with a knife to get rid of the pus and blood, and then he put wonderful ointment on it, which immediately removed the difference.",
        "source": "T24n1450_013:0165c03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然作此法時，阿難陀以聽法故，了然不覺。",
        "translation": "Still, when he did this, Ānanda didn't realize it because he was listening to the teaching.",
        "source": "T24n1450_013:0165c05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說法已，侍縛迦白世尊曰：「我於聽法坐中治阿難陀瘡，割截針決，阿難陀以聽法故，皆不覺知。」",
        "translation": "After the Buddha taught the Dharma, the attendant Vākṣu said to the Bhagavān, \"While I was sitting there listening to the Dharma, I treated Ānanda's sores by cutting and needling them, but Ānanda didn't even know it because he was listening to the Dharma.\"",
        "source": "T24n1450_013:0165c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽阿難陀報曰：「我為聽佛法故，假令割截我身碎如油麻，都不覺痛。」",
        "translation": "Ananta replied, \"Because I listened to the Buddha's teaching, even if I were to have my body cut and crushed like oil and flax, I wouldn't have felt any pain.\"",
        "source": "T24n1450_013:0165c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時能治醫王，見斯事已生希有心。",
        "translation": "The healing physician king then saw this and had a rare feeling.",
        "source": "T24n1450_013:0165c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻咸皆有疑，請世尊曰：「大德！",
        "translation": "The monks then all had doubts and asked the Bhagavān, \"Mañjuśrī!",
        "source": "T24n1450_013:0165c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者歡喜曾作何業，遂於背上生癰瘡耶？」",
        "translation": "Venerable Pleasant, what action has he taken that has given rise to the abscesses on his back?\"",
        "source": "T24n1450_013:0165c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「歡喜先業汝今應聽，廣說如前，乃至說伽他曰：「『假令經百劫，　　所作業不亡；　　因緣會遇時，　　果報還自受。』",
        "translation": "The Buddha told the monks, \"Now, you should listen to this joyful prior act, which was explained in detail as before, up to the point where he said, 'Suppose you go through a hundred eons, but your work doesn't perish; when you meet causes and conditions, the result will be felt on its own.'",
        "source": "T24n1450_013:0165c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「乃往古昔，於一邊國名雞羅吒，有王治化，當時無佛，唯有獨覺出現世間。",
        "translation": "\"Once upon a time, in a country called Krakucchanda, there was a king who ruled and educated people, and at the time there was no Buddha but a single enlightened being who appeared in the world.",
        "source": "T24n1450_013:0165c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有獨覺聖者為乞食故，至此城中詣國王宅。",
        "translation": "At the time, a pratyekabuddha sage went to this city and visited the king's residence in order to solicit alms.",
        "source": "T24n1450_013:0165c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見生嗔，便以彈丸打其脊背。",
        "translation": "When he saw this, the king became angry and struck him on the back with a pellet.",
        "source": "T24n1450_013:0165c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼尊者降自貢高，知彼非器捨之而去。",
        "translation": "That noble being then lowered himself into pride, knew he wasn't a vessel, and left.",
        "source": "T24n1450_013:0165c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "\"Monks!",
        "source": "T24n1450_013:0165c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔時王者，即歡喜是，由以瞋心以彈打辟支佛故，五百生中常於背上受惡瘡報，今末後身餘報如是。",
        "translation": "In the past, this was the king who rejoiced because he had hit Pratibhāna with a bolt of anger, and for 500 lifetimes he always received the results of bad sores on his back, and now at the end he'll receive the residual effects of his body like this.",
        "source": "T24n1450_013:0165c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻！",
        "translation": "Bhagavān!",
        "source": "T24n1450_013:0165c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作黑白雜業當受其報，廣說如前。」",
        "translation": "If you do black-and-white mixed actions, you'll receive the results, as explained in detail above.\"",
        "source": "T24n1450_013:0165c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽歡喜有常法：若與如來真身相隨行者，其心則常恭敬；若與如來化身行者，其心則少恭敬。",
        "translation": "There's a constant rule for those who rejoice in life: If they walk with the Tathāgata in his true body, their minds will be constantly respectful; if they walk with the Tathāgata in his transformation body, their minds will be less respectful.",
        "source": "T24n1450_013:0165c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一長者，請如來及諸苾芻，於其家中設諸供養。",
        "translation": "An elderly man then invited the Tathāgata and his monks to make offerings in his home.",
        "source": "T24n1450_013:0165c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊至時著衣持鉢，與諸苾芻前後圍遶，赴長者供，飯食訖還來本處。",
        "translation": "The Bhagavān then arrived, put on his robe and took his bowl, surrounded himself with the monks, went to the elder to make offerings, and returned to his original place after finishing his meal.",
        "source": "T24n1450_013:0165c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻問阿難陀曰：「汝於今日隨如來赴供，為隨真佛？",
        "translation": "The monk asked Ānanda, \"Today, did you follow the Tathāgata in making offerings, or did you follow the real Buddha?",
        "source": "T24n1450_013:0165c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為隨化佛？」",
        "translation": "For the sake of transforming buddhas?\"",
        "source": "T24n1450_013:0166a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀報曰：「我於今日，與佛世尊相隨往彼，非化身也。」",
        "translation": "Ānanda replied, \"Today, I've gone there with the Bhagavān, not in a transformation body.\"",
        "source": "T24n1450_013:0166a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻曰：「以何知之？」",
        "translation": "The monks asked, \"How do you know that?\"",
        "source": "T24n1450_013:0166a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀曰：「我若與真佛行者，心自恭敬內懷慚愧；若與化佛行者，則不如此。」",
        "translation": "Ānanda said, \"If I were to practice with a real Buddha, I would respect myself and feel modest at heart; if I were to practice with a transformation Buddha, I wouldn't be like that.\"",
        "source": "T24n1450_013:0166a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻遞相報曰：「此阿難陀甚為希有，能知真身化身差別諸相貴賤等類。」",
        "translation": "The monks sent word, saying, \"This Ānanda is rare, for he can discern the true body's transformation body's distinctive features, such as nobility and lowliness.\"",
        "source": "T24n1450_013:0166a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是遠近咸知阿難陀善別諸相。",
        "translation": "It was then widely known from near and far that Ānanda was adept at distinguishing between forms.",
        "source": "T24n1450_013:0166a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從王舍城往室羅筏城，至誓多林中住，具壽阿難陀著衣持鉢入室羅筏城乞食。",
        "translation": "It was then that the Bhagavān went from Rājagṛha to Śrāvastī and stayed in the Jetavana Grove, where the Arhat of Longevity Ananta gathered his robe and bowl and entered Śrāvastī to solicit alms.",
        "source": "T24n1450_013:0166a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一婆羅門，於中路逢阿難陀，作是念云：「我先聞此沙門喬答摩弟子善能占相，今應試之，為解、不解？」",
        "translation": "Then, a Brāhmaṇa met Ānanda in the road and had this thought, \"I've heard that this ascetic Gautama's disciple is good at reading signs; now should I test him and see whether he understands them?\"",
        "source": "T24n1450_013:0166a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便問阿難陀曰：「今此路傍勝葉波林，凡有幾葉？」",
        "translation": "He then asked Ānanda, \"Now, how many leaves are there in this forest of leaves near the road?\"",
        "source": "T24n1450_013:0166a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀報曰：「有如許百如許千如許萬如許拘胝。」",
        "translation": "Ānanda replied, \"There are as many as a hundred, as many as a thousand, as many as ten thousand, and as many as Kauṇḍinya.\"",
        "source": "T24n1450_013:0166a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報已便去。",
        "translation": "After he gave his reward, he departed.",
        "source": "T24n1450_013:0166a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼婆羅門，即於林中取一把葉數之，知有七百七十七葉，棄之林外默然而住。",
        "translation": "That brāhmaṇa then took a handful of leaves from the forest and counted them, knowing there were 707 leaves, discarded them outside the forest, and stayed there in silence.",
        "source": "T24n1450_013:0166a14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿難陀乞食已，復還歸來由於舊路，彼婆羅門問曰：「聖者！",
        "translation": "After begging for food, Ānanda returned and went back the old way, and the Brāhmaṇa asked, \"Sage!",
        "source": "T24n1450_013:0166a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此林中凡有幾葉？」",
        "translation": "How many leaves are there in this forest?\"",
        "source": "T24n1450_013:0166a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報曰：「前者有如許百千萬拘胝，今者欠七百七十七葉。」",
        "translation": "He replied, \"The former had as many as a million koṭīs, but now I owe him 707 leaves.\"",
        "source": "T24n1450_013:0166a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門聞此報已，歎甚希有善解算數。",
        "translation": "After hearing this reward, the Brāhmaṇa praised him for his rare and excellent understanding of mathematics.",
        "source": "T24n1450_013:0166a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻聞已生疑白佛言：「世尊！",
        "translation": "After hearing this, the monks had doubts and said to the Buddha, \"Bhagavān!",
        "source": "T24n1450_013:0166a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此具壽阿難陀，先種何業善能占相算數？」",
        "translation": "What prior activity of this perfect-life Ānanda was he able to divine and calculate?\"",
        "source": "T24n1450_013:0166a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「昔種福業廣說如前，乃至說伽他曰：「『假令經百劫，　　所作業不亡；　　因緣會遇時，　　果報還自受。』」",
        "translation": "The Buddha told the monks, \"The meritorious actions of the past were explained in detail as before, up to the point where he spoke of the kāṭa, saying, 'Suppose it takes a hundred eons, but the actions that are performed don't die; when causes and conditions meet, the results are reaped on their own.'\"",
        "source": "T24n1450_013:0166a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「往昔世時，波羅痆斯城中有一婆羅門，取得一妻生得一子，生至二十一日，會諸親族設諸飲食，因為此兒立名號曰大白。",
        "translation": "The Buddha told the monks, \"Once upon a time, there was a Brāhmaṇa in the city of Bārāṇasī who obtained a wife and had a son who was born on the twenty-first day of his life, met his relatives, prepared a meal, and named that son Great White.",
        "source": "T24n1450_013:0166a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年漸長大遊行人間，學六萬頌算數之法，善得明了，復教他人算數之法。",
        "translation": "As he grew older, he traveled among people, learned how to count 60,000 verses, became well-versed in it, and taught others how to count.",
        "source": "T24n1450_013:0166a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此因故，五百生世明了，亦教他人，今最後身得此通達。」",
        "translation": "As a result, he had insight for 500 lifetimes and taught others, and now he's attained this understanding in his final body.\"",
        "source": "T24n1450_013:0166a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時具壽阿難陀，復於一時往波斯匿王宮中，勝軍見來，歡喜頂禮在一面坐，白尊者曰：「我從生已來自然業感，常有一銀娑羅香粳米飯、二頭熟雉、一枚苷蔗，每以食時從空而下入銀盤中，唯一頭雉常落地上不落盤中。」",
        "translation": "One time, Kauṣṭhila Ānanda went to the palace of King Prasenajit and when Venerable Army saw him, he bowed his head in joy and sat to one side, saying to the venerable, \"Since I was born, I've been naturally conditioned by karma to always have a silver dish of sesshouli-scented millet and rice, two heads of ripe pheasant, and a piece of sugarcane that falls out of the sky into a silver dish every time I eat, but the only pheasant always falls to the ground and doesn't fall into the dish.\"",
        "source": "T24n1450_013:0166b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時具壽歡喜，既聞斯言甚生希有，還至僧坊以告諸人。",
        "translation": "Kauśāmbī rejoiced when he heard this, and he went back to the monastery and told the others how rare it was.",
        "source": "T24n1450_013:0166b07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻咸以此緣往白世尊，佛告諸苾芻：「往昔此波羅痆斯城有一長者，多諸珍寶及多田莊，於其莊上，送新粳米，及送死雉并苷蔗等。",
        "translation": "The monks then all went to the Bhagavān for this reason, and the Buddha told the monks, \"Once upon a time, there was an elder in this city of Bārāṇasī who had a lot of treasures and a lot of land, and he sent new millet, a dead pheasant, sugarcane, and so forth on his property.",
        "source": "T24n1450_013:0166b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間常法：若佛不出於世，當有辟支佛現教化。",
        "translation": "It's a common worldly principle that if the Buddha didn't leave this world, there would be a pratyekabuddha who would teach and guide him.",
        "source": "T24n1450_013:0166b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一辟支佛巡門乞食，至長者家入其門內，長者見彼威儀端正言辭柔軟，心生歡喜，便將新粳米飯及炙雉二頭并苷蔗一枚，以施獨覺。",
        "translation": "When a pratyekabuddha went on a food tour and entered an elder's house, the elder rejoiced when he saw his manner and speech, and he gave the pratyekabuddha fresh millet and rice, two heads of roasted pheasant, and a piece of sugarcane.",
        "source": "T24n1450_013:0166b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼獨覺以鉢受之，苷蔗與飯及以一雉，得入鉢中，一雉落地。",
        "translation": "That pratyekabuddha then accepted the offer with a bowl, and the sugarcane, rice, and pheasant went into the bowl, while the pheasant fell to the ground.",
        "source": "T24n1450_013:0166b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此業因受斯果報。",
        "translation": "This was the result of his actions.",
        "source": "T24n1450_013:0166b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼長者，今勝軍王是，於無量百千世，生於天上受諸快樂。",
        "translation": "That elder, now called King Prasenajit, was born in the heavens and enjoyed many pleasures in measureless hundreds of thousands of lifetimes.",
        "source": "T24n1450_013:0166b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受天報已，復生人間作王，感斯勝事。",
        "translation": "After receiving the heavenly reward, he was again born here among humans and became a king, which brought about this remarkable event.",
        "source": "T24n1450_013:0166b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故汝等！",
        "translation": "Therefore, you guys!",
        "source": "T24n1450_013:0166b19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲供養僧食，應勤施與，勿令落地。」",
        "translation": "If you want to offer food to the saṃgha, you should diligently give it to them and not let it fall to the ground.\"",
        "source": "T24n1450_013:0166b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時勝軍王聞佛世尊記說往昔之事，心生歡喜，於佛法僧起大信心，獨坐一處作是思念：「由我前生供養辟支佛故，獲如是報。",
        "translation": "When King Prasenajit heard the Bhagavān recount the events of the past, his heart rejoiced, and he had great faith in the Buddha, Dharma, and Saṃgha as he sat alone in one place and thought, \"This is the reward I got for making offerings to the pratyekabuddhas in my previous life.",
        "source": "T24n1450_013:0166b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我應廣設佛法僧等，必於來世受大利益。」",
        "translation": "I should have set out to make offerings to the Buddha, Dharma, and Saṃgha, and I'm sure I'll receive great benefit in the next life.\"",
        "source": "T24n1450_013:0166b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，占事人奏曰：「明日阿難陀應合得纏頭賞位及灌頂位。」",
        "translation": "After that thought, the magistrate told him, \"Tomorrow, Ānanda will probably attain the position of reward for binding the head and the position of consecration.\"",
        "source": "T24n1450_013:0166b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞此言默然不語。",
        "translation": "The king was silent when he heard those words.",
        "source": "T24n1450_013:0166b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具壽阿難陀於其夜中，額上忽然生一惡瘡，經一宿已王遂聞之，即便生念：「供養有德之人獲福無量，我親供養。」",
        "translation": "During the night, a bad sore suddenly appeared on Ananta's forehead, and after a night passed, the king heard it and even had the thought, \"Making offerings to a virtuous person will bring immeasurable merit; I'll make offerings myself.\"",
        "source": "T24n1450_013:0166b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作此念已即勅天下所有名醫咸集朝所：「阿難陀有病，卿等往治。」",
        "translation": "After he had this thought, he ordered all the world's famous doctors to gather at the courthouse, saying, \"Ananta has a medical condition, so you may go and treat it.\"",
        "source": "T24n1450_013:0166b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸醫奉詔適阿難陀所，便自選擇得一好手，遂即下針刺去惡血。",
        "translation": "Following the order, the doctors went to Ānanda, selected a good doctor, and then put down needles to prick away the bad blood.",
        "source": "T24n1450_013:0166c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自執持千輻輪傘，蓋阿難陀上，刺血了已更傅好藥。",
        "translation": "The king took his thousand-spoked umbrella and placed it over Ānanda, then prepared a good remedy after pricking the blood out of him.",
        "source": "T24n1450_013:0166c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王自以帛纏阿難陀首，當日瘡差，王遂禮拜辭阿難陀去。",
        "translation": "The king wrapped silk around Ānanda's head, and that day the sores came away, so the king paid homage and left Ānanda.",
        "source": "T24n1450_013:0166c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾僧見此事已咸生疑惑，便白佛言：「大德世尊！",
        "translation": "Seeing this, the monks all had doubts and confusions, so they said to the Buddha, \"Bhagavān!",
        "source": "T24n1450_013:0166c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀過去作何福業？",
        "translation": "What kind of meritorious activity did Ānanda do in the past?",
        "source": "T24n1450_013:0166c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今感國王親自承事。」",
        "translation": "Now, I'm grateful to the king for taking it upon himself to serve him.\"",
        "source": "T24n1450_013:0166c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「此阿難陀昔種福事，廣說如前。」",
        "translation": "The Buddha said, \"These are the kinds of meritorious deeds that Ananta used to perform, as explained in detail earlier.\"",
        "source": "T24n1450_013:0166c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「往昔波羅痆斯城有一醫師，時有辟支佛病，往醫師所。",
        "translation": "The Buddha told the monks, \"Once upon a time, there was a physician in the city of Bārāṇasī when a Pratibhāna Buddha was ill and went to the physician's office.",
        "source": "T24n1450_013:0166c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼醫即便盡心恭敬，白辟支佛言：『尊者！",
        "translation": "Even with all due respect, that doctor said to the Pārśva, 'Venerable!",
        "source": "T24n1450_013:0166c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所須衣食一切醫藥，我總供奉之，必至病差。』",
        "translation": "I'll make a general offering of food and clothing and all the medicines that are needed, and it will surely lead to the removal of illness.'",
        "source": "T24n1450_013:0166c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如言奉事乃至病除。」",
        "translation": "According to your words, you'll serve them until your illness is gone.\"",
        "source": "T24n1450_013:0166c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「諸苾芻！",
        "translation": "The Buddha said, \"Precepts, monks!",
        "source": "T24n1450_013:0166c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時醫師者，今阿難陀是。",
        "translation": "At the time, that physician was the present-day Ānanda.",
        "source": "T24n1450_013:0166c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由昔供養病辟支佛故，無量世中生天受福，五百生中常於人間受勝果報，一切國王及婆羅門諸宰貴等親自供養。",
        "translation": "Because he supported the sick pratyekabuddha in the past, he was born in a heavenly existence for measureless lifetimes and received blessings, and for 500 lifetimes he was always among humans and received excellent results, which all the kingdoms and brass of the Brāhmaṇas offered themselves as support.",
        "source": "T24n1450_013:0166c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今最後身，感勝軍王親執傘蓋，萬乘之主屈駕承事，如前廣說。」",
        "translation": "In his final lifetime, he felt the victorious army king personally hold the canopy, and the lord of all vehicles bent over him to serve him, as explained in detail earlier.\"",
        "source": "T24n1450_013:0166c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從室羅筏城往婆羅城，漸漸遊行至於城外，到一村住，其村名曰婆羅門村，大聲聞眾圍遶世尊，不遠而住。",
        "translation": "The Bhagavān then traveled from Śrāvastī to the city of Bālā and gradually made his way outside the city to a village called Brāhmaṇa, where a large assembly of śrāvakas surrounded the Bhagavān and stayed there for a short distance.",
        "source": "T24n1450_013:0166c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂上坐阿若憍陳那、具壽馬勝、具壽賢子、長氣苾芻、大名苾芻、耶舍苾芻、圓滿苾芻、無垢苾芻、牛王苾芻、妙臂苾芻、具壽舍利弗、具壽大目揵連、具壽大迦葉波、具壽俱絺羅、具壽劫賓那、阿尼樓陀、難地迦、金卑羅，住婆羅村住。",
        "translation": "They were Ajñāta Kauṇḍinya, Arjñāta-kauṇḍinya, Arjñāta-kauṇḍinya, Bhikṣu Longevity, Bhikṣu Dame, Bhikṣu Yaśas, Bhikṣu Pūrṇa, Bhikṣu Unsullied, Bhikṣu Ox-King, Bhikṣu Myōkukku, Arjñāta-Śāriputra, Arjñāta-Megha-devan, Arjñāta-Kāśyapa, Arjñāta-Kauṇḍinya, Arjñā-Kauṇḍinya, Kapphiṇa, Aniruddha, Nandika, and Kimbila, all of whom were staying in the village of Brāhmaṇa.",
        "source": "T24n1450_013:0166c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙枕苾芻及阿難陀等，無量苾芻大聲聞眾，於日午後來詣佛所，頂禮佛足次第而坐。",
        "translation": "After sunset, Bhaiṣajyaguru and Āniruddha, a multitude of great śrāvakas who were incalculable monks, came to the Buddha, bowed their heads at his feet, and sat down in order.",
        "source": "T24n1450_013:0166c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告諸苾芻：「吾今年邁氣勢漸微，為諸四眾說法無力。」",
        "translation": "The Bhagavān then addressed the monks, \"My strength is waning this year, and I'm powerless to teach the Dharma to these four groups of people.\"",
        "source": "T24n1450_013:0166c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在波羅痆斯城婆羅門村中間，是時舍利子、大目揵連，勸請阿難陀與佛作侍者，阿難陀一依尊者教。",
        "translation": "When the Buddha was in the middle of the village of Brāhmaṇa in the city of Bārāṇasī, Śāriputra and Mahāmaudgalyāyana urged Ānanda to become an attendant with the Buddha, and Ānanda readily complied with the venerable's teaching.",
        "source": "T24n1450_013:0167a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即讚歎阿難陀。",
        "translation": "The Buddha then praised Ānanda.",
        "source": "T24n1450_013:0167a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時苾芻眾咸皆生疑，即白佛言：「阿難陀修何福業？",
        "translation": "The crowd of monks then had doubts and said to the Buddha, \"What meritorious activity does Ānanda cultivate?",
        "source": "T24n1450_013:0167a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今為佛作叔伯堂弟。",
        "translation": "Now, I've become an uncle and cousin of the Buddha.",
        "source": "T24n1450_013:0167a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作侍者，聰明智慧聽聞佛語，更無忘失。」",
        "translation": "He'll also be an attendant, wise and intelligent enough to listen to the Buddha's words, and he'll never lose them.\"",
        "source": "T24n1450_013:0167a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告苾芻：「汝等當知！",
        "translation": "The Buddha told the monks, \"You should know this!",
        "source": "T24n1450_013:0167a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難陀自作是業，廣說如前。」",
        "translation": "Ānanda himself did this deed, and it was explained in detail as before.\"",
        "source": "T24n1450_013:0167a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「往昔過去時，波羅痆斯城有王名曰日曜，於其國中作王制禮，令其人人豐樂安寧，無諸衰難。",
        "translation": "The Buddha told the monks, \"Once upon a time in the distant past, there was a king in the city of Bārāṇasī named Nirayana who performed royal rituals in his kingdom, making everyone there abundantly happy and peaceful and free from hardship.",
        "source": "T24n1450_013:0167a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王於後妃生一子，三七日中喚諸臣佐，朝集設會為子立名。",
        "translation": "When his queen gave birth to a son, the king summoned his ministers and assistants to assemble in the morning and set up a meeting to name the son.",
        "source": "T24n1450_013:0167a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣佐白王：『王名日曜，子合立名，號大日曜。』",
        "translation": "The ministers and assistants told the king, 'The king's name is Riyao, and the son was given a joint name, Great Riyao.'",
        "source": "T24n1450_013:0167a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其子漸長，策為太子。",
        "translation": "His son grew up and was named crown prince.",
        "source": "T24n1450_013:0167a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後王妃更生一子，群臣立名，號為日智。",
        "translation": "Later, the king's wife gave birth to another son, and the ministers named him Rizhi.",
        "source": "T24n1450_013:0167a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其王太子，每常思念心樂出家。",
        "translation": "The king's prince was always mindful that he wanted to leave home.",
        "source": "T24n1450_013:0167a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每見父王或行非法或依國法，太子見是事已，遂即念言：『我今於後受王國位，行如是法，即墮地獄無有出時。』",
        "translation": "Whenever he saw his father acting contrary to the law or relying on the state's laws, the prince saw this and immediately thought, 'Now, if I were to accept the position of king in the future and do such a thing, I'd fall into hell with no time to escape.'",
        "source": "T24n1450_013:0167a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已往詣王所，跪拜禮畢白父王言：『我今願欲出家，願王垂慈放我令去。』",
        "translation": "After he had thought this, he went to the king, prostrated himself, saluted him, and said to his father, 'Now, I'd like to leave home, but may the king have mercy and let me go.'",
        "source": "T24n1450_013:0167a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼父王告其子曰：『有諸仙人外道，事火事天苦行持戒，作如此業，唯求來世生國王家身為王子受諸快樂。",
        "translation": "The father then told his son, 'There are immortals and heretics who serve the gods through fire, practice austerities and observe precepts, and perform such actions, seeking only to be born in the king's household in the next life as princes and receive many pleasures.",
        "source": "T24n1450_013:0167a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今此身見受果報，如何捨樂願行苦事？』",
        "translation": "Now that you've seen the results of this body, how can you abandon the pleasures and vow to do the painful work?'",
        "source": "T24n1450_013:0167a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時太子復白王言：『聽我出家。』",
        "translation": "It was then that the prince again said to the king, 'Grant me permission to leave home.'",
        "source": "T24n1450_013:0167a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王知其意不求世樂，遂許出家。",
        "translation": "The king knew that he didn't want to pursue worldly pleasures, so he allowed him to leave home.",
        "source": "T24n1450_013:0167a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼太子得王放已，即入山中仙人住處出家修道，父王即冊其弟日智紹太子位。",
        "translation": "After he was released by the king, the prince went to live among the sages in the mountains and left home to train, and his father then nominated his younger brother, Rizhao, to assume the position of prince.",
        "source": "T24n1450_013:0167a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時日曜太子既至山中，繫念思惟，證獨覺果。",
        "translation": "Once he arrived on the mountain, Prince Nisio focused his thoughts and realized the fruit of pratyekabuddha.",
        "source": "T24n1450_013:0167a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後時中，身染疾患周旋消散，還至婆羅痆斯城。",
        "translation": "At some point later, his illness dissipated and he returned to the city of Vārāṇasī.",
        "source": "T24n1450_013:0167a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸人見已而白王言：『日曜太子入山修道證獨覺果，今來城內。』",
        "translation": "After the people saw this, they said to the king, 'Prince Sunraya went into the mountains to train and realize the fruit of solitary realizer and has now come to the city.'",
        "source": "T24n1450_013:0167a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王既聞已即迎日曜，禮其足已白言：『大仙！",
        "translation": "After hearing this, the king greeted Heliophile, paid homage to his feet, and said, 'Great man!",
        "source": "T24n1450_013:0167a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝須衣食、我求福德，今請大仙住我園林，隨時安置所須之物，我當供給。』",
        "translation": "You need food and clothing, and I seek virtue. Now, I'd like to invite the great sage to stay at my garden and place what's needed at any time, and I will make offerings.'",
        "source": "T24n1450_013:0167b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼獨覺默然受請。",
        "translation": "The prince then quietly accepted the invitation.",
        "source": "T24n1450_013:0167b03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見受請，即勅日智太子，侍養獨覺供給所須。",
        "translation": "Seeing that he had accepted the invitation, the king then commanded Prince Sunwise to serve the ascetic and provide him with what he needed.",
        "source": "T24n1450_013:0167b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時獨覺仙即於定中觀見日智太子，却後七日當捨其命，告太子曰：『弟今何故不求出家？』",
        "translation": "The ascetic then observed in his meditation that Prince Sunaji would abandon his life in the next seven days and told the prince, 'Why doesn't he want to leave home now?'",
        "source": "T24n1450_013:0167b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟言：『我願出家。』",
        "translation": "The disciple said, 'I'd like to leave home.'",
        "source": "T24n1450_013:0167b06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺告曰：『白父王知。』",
        "translation": "The prince of Independence told him, 'Tell the king, Father, to let him know.'",
        "source": "T24n1450_013:0167b06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日智太子往父王所白言：『我願出家，願王聽許。』",
        "translation": "The prince Sunjīva went to his father and said, 'I wish to leave home, and I hope the king will grant it.'",
        "source": "T24n1450_013:0167b07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞此言，遂生忿怒告太子曰：『汝兄日曜今已出家，我終沒後須有繼嗣，今不放汝。』",
        "translation": "When the king heard this, he became angry and told the prince, 'Now that your brother Riyo has left home, I need a successor after I die, so I won't let you go now.'",
        "source": "T24n1450_013:0167b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼獨覺聞王不放其弟，即詣王所，說伽他曰：「『日曜放日智，　　令隨我出家；　　出家最勝事，　　諸佛所讚歎。』",
        "translation": "When that prince heard that the king wouldn't release his younger brother, he went to the king and spoke to him, saying, 'Sunrayo released his sunlight wisdom and allowed me to leave home with him; this is the most excellent thing about leaving home that's praised by the buddhas.'",
        "source": "T24n1450_013:0167b10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「父王白言：『大仙當知！",
        "translation": "\"The father said to the king, 'Great man, you should know!",
        "source": "T24n1450_013:0167b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝已出家，我之國法須有紹繼，唯有日智令知國位，在家修福其事足，得何用出家？』",
        "translation": "Now that you've left home, my country's teachings must be carried forward, and only with daily wisdom can I know the state's position; what use would I have in leaving home if I cultivated its virtues at home?'",
        "source": "T24n1450_013:0167b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼獨覺復說伽他曰：「『王先別思，　　此事復別；　　却後七日，　　日智命終。』",
        "translation": "Then that prince, the Sojourner, again said to the Gṛdhrakūṭa, 'The king first considered this separately, and this thing was separated again; seven days after he leaves, Śrī Ji's life will end.'",
        "source": "T24n1450_013:0167b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「王問獨覺：『日智太子却後七日必不活耶？』",
        "translation": "\"The king asked that prince Kokaku, 'Will Prince Sunaji not live for seven days after he leaves?'",
        "source": "T24n1450_013:0167b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：『如是。』",
        "translation": "He replied, 'So it is.'",
        "source": "T24n1450_013:0167b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王言：『若如是者放令出家。』",
        "translation": "The king said, 'If that's the case, then he'll be released from his home.'",
        "source": "T24n1450_013:0167b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子出家已，發善心供養獨覺。",
        "translation": "After he left home, the prince aroused good intentions to support the pratyekabuddha.",
        "source": "T24n1450_013:0167b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼獨覺患風，手執飯鉢掉動不安。",
        "translation": "That prince, the solitary realizer, was suffering from a wind and was agitated when he took his bowl of rice in his hand.",
        "source": "T24n1450_013:0167b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其太子見，遂將金釧以承其鉢，鉢遂不動。",
        "translation": "Seeing this, the prince put a gold bracelet on his bowl, and it didn't budge.",
        "source": "T24n1450_013:0167b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子觀已歡喜，發如是願：『我今聽法亦復如是，法入我心更不傾動。』",
        "translation": "The prince rejoiced as he watched, and he made this vow: 'Now, I'll listen to the teaching and do likewise; the teaching will enter my mind and I won't be distracted.'",
        "source": "T24n1450_013:0167b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往時獨覺未得果證，為弟日智常說圓滿微妙勝法，今得證果更不說法。",
        "translation": "In the past, when he hadn't yet realized the fruit, Sojourner always taught his disciple Śrī Ji the subtle and sublime excellence of the Dharma, but now that he's realized the fruit, he doesn't teach it.",
        "source": "T24n1450_013:0167b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日智見已白獨覺言：『汝未出家恒常說法，何因獲果遂即默然？』",
        "translation": "After he saw this, Śrīgarbha said to Monk, 'You've never left home and have always taught, what was the cause for attaining the fruit and then you just went silent?'",
        "source": "T24n1450_013:0167b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺報言：『我實不說法。』",
        "translation": "The solitary realizer replied, 'I really don't teach the Dharma.'",
        "source": "T24n1450_013:0167b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日智問曰：『誰合說法？』",
        "translation": "Sun Wisdom asked, 'Who is fit to teach the Dharma?'",
        "source": "T24n1450_013:0167b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獨覺報云：『汝知應正等覺出世之時，當說種種圓滿妙法。』",
        "translation": "The answer from the prince was, 'You know that when the correct and perfectly enlightened one appears in the world, he'll explain the various ways to complete the wonderful Dharma.'",
        "source": "T24n1450_013:0167b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子聞此，發如是願：『願以此善根，未來之世與佛作弟，又得出家親承供養，聞法領記獲大總持。』",
        "translation": "Hearing this, the prince made this vow: 'May this good root make you a disciple of the Buddha in a future life, and may you leave home to make offerings to him and receive a great dharma mastery when you hear the teachings.'",
        "source": "T24n1450_013:0167c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時辟支迦謂其弟曰：『却後七日汝當報終，常守此心莫令忘失。』",
        "translation": "It was then that Pratibhāna addressed his disciple, 'For the next seven days, you will be rewarded with death; always guard this mind and don't let it be forgotten.'",
        "source": "T24n1450_013:0167c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七日既滿未得果證，垂將告謝，重發誓言：『如前所願。』」",
        "translation": "When the seven days were up and he hadn't yet realized the fruit, he looked down and thanked him, repeating his vow, 'As I had wished.'\"",
        "source": "T24n1450_013:0167c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸苾芻曰：「時辟支弟，今阿難陀是。",
        "translation": "The Buddha then addressed the monks, \"At the time, that disciple of Pārśva's was now Ānanda.",
        "source": "T24n1450_013:0167c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣過去世供養辟支迦，當發願言：『未來世中與佛作弟，親承供養多聞總持。』",
        "translation": "As a result of making offerings to Pratibhāna in past lives, he must have vowed, 'In future lives, I'll be a disciple of the Buddha and make offerings to the well-versed Dhāraṇī.'",
        "source": "T24n1450_013:0167c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以今時為我毘季；聰明第一，若水注瓶。」",
        "translation": "Now, therefore, he's the most intelligent of us all, like water pouring into a vial.\"",
        "source": "T24n1450_013:0167c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸苾芻咸皆有疑，即白佛言：「其阿難陀過去行何善業？",
        "translation": "The monks then all had doubts and said to the Buddha, \"What good deeds did that Ānanda do in the past?",
        "source": "T24n1450_013:0167c09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今蒙世尊於大眾中歎美稱揚聰明莫比，總持強記領受無遺。」",
        "translation": "The Bhagavān now praises and commends him as unsurpassed in terms of intelligence among the general public, and he has received his comprehensive and powerful prediction without fail.\"",
        "source": "T24n1450_013:0167c10_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「阿難陀往昔自修善業，廣說如前。」",
        "translation": "The Buddha addressed the monks, \"Ananta used to cultivate good actions on his own, as explained in detail above.\"",
        "source": "T24n1450_013:0167c12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「往昔之時於賢劫中，於時有情壽二萬歲，有佛世尊號迦攝波，出現於世，在波羅痆斯城仙人墮處施鹿林中。",
        "translation": "The Buddha told the monks, \"Once upon a time in a good eon, when sentient beings lived for 20,000 years, there was a Buddha, the World Honored One called Kāśyapa, who appeared in the world and was present in the city of Bārāṇasī in a forest of deer that had been planted by immortals.",
        "source": "T24n1450_013:0167c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛有一弟子，多聞不忘聰明第一。",
        "translation": "The Buddha had a disciple who was well-versed, never forgetting, and had the highest intelligence.",
        "source": "T24n1450_013:0167c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有弟子從出家來常修梵行，乃至命終不獲聖果。",
        "translation": "That disciple had always cultivated the religious practice since leaving home, but he didn't attain the noble fruit until the end of his life.",
        "source": "T24n1450_013:0167c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨終之時一心發願：『所作善根，願當來之世，與釋迦如來為親侍弟子，如今無異。",
        "translation": "When he was about to die, he wholeheartedly vowed, 'Having made good roots, may I hope that in a future life I'll be no different from the Śākyamuni Tathāgata as a close disciple now.",
        "source": "T24n1450_013:0167c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於弟子之中聰明第一，願釋迦如來與我授記，如彼無異。』",
        "translation": "Being the most intelligent of his disciples, may the Tathāgata grant me a prediction, just as he did.'",
        "source": "T24n1450_013:0167c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T24n1450_013:0167c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼弟子者，今阿難陀是。",
        "translation": "\"That disciple is the present-day Ānanda.",
        "source": "T24n1450_013:0167c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以先世善心發願力故，今於我弟子中聰明第一。",
        "translation": "Because of the power of his good intentions and vows in prior lives, he's now the most intelligent of my disciples.",
        "source": "T24n1450_013:0167c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Bhikṣus!",
        "source": "T24n1450_013:0167c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作黑白雜染業者，各獲其報，汝等應捨雜染黑業，常修白業。」",
        "translation": "If you do defiled black and white actions, each will receive their own reward, so you should abandon defiled black actions and always cultivate white actions.\"",
        "source": "T24n1450_013:0167c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在王舍城竹林迦蘭鐸迦園中，有五百苾芻圍遶世尊，皆是阿羅漢，唯提婆達多未得聖果。",
        "translation": "When the Buddha was in the Kalandaka Park in the bamboo grove of Rājagṛha, there were five hundred monks surrounding the Bhagavān, all of whom were arhats, except for Devadatta, who hadn't yet attained the noble fruit.",
        "source": "T24n1450_013:0167c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時國土飢荒，人民無食乞求難得。",
        "translation": "At the time, the country was starving, and the people had nothing to eat and were having trouble finding food to beg.",
        "source": "T24n1450_013:0167c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾中有神通苾芻，即騰虛空或下贍部林中，取香美贍部之菓，滿鉢充足還至本處，供養四眾自亦飽足；或往蜜羅林、下迦比陀林、或下甘露園、或下阿犁勒林，取香美之菓，滿鉢充足還至本處，供養四眾自亦充足；或有苾芻神通自在，即騰虛空往北俱盧洲，取自然粳米香美之者，滿鉢充足還至本處，供養四眾自亦飽足；或有苾芻神通自在，虛空遊行往至餘國，乞種種美妙飲食，乃至滿鉢廣說如前；或有苾芻以神通力往四天王所，或往三十三天中，取天厨精妙飲食，滿鉢充足，乃至廣說如前。",
        "translation": "眾中有神通苾芻，即騰虛空或下贍部林中，取香美贍部之菓，滿鉢充足還至本處，供養四眾自亦飽足；或往蜜羅林、下迦比陀林、或下甘露園、或下阿犁勒林，取香美之菓，滿鉢充足還至本處，供養四眾自亦充足；或有苾芻神通自在，即騰虛空往北俱盧洲，取自然粳米香美之者，滿鉢充足還至本處，供養四眾自亦飽足；或有苾芻神通自在，虛空遊行往至餘國，乞種種美妙飲食，乃至滿鉢廣說如前；或有苾芻以神通力往四天王所，或往三十三天中，取天厨精妙飲食，滿鉢充足，乃至廣說如前。",
        "source": "T24n1450_013:0167c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時提婆達多，見諸苾芻有如此神通取諸菓食，作如是念：「此國土飢荒，人民無食等，廣說如前，乃至三十三天取天厨飲食，四眾充足自亦飽足。",
        "translation": "It was then that Devadatta saw that these monks had the superknowledge to obtain food and drink and had this thought, \"This land is starved, and the people have nothing to eat.",
        "source": "T24n1450_013:0168a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若有神通，即騰虛空下贍部林中，取香美贍部果，滿鉢充足，我亦供養四眾自亦飽足，廣說如前，乃至三十三天，取天厨飲食，四眾充足自亦飽足。",
        "translation": "If I had the supernormal power to ascend through the sky and descend into the Jambudvīpa forest and gather a bowl full of the delicious fruits of Jambudvīpa, I would also provide for the four groups of people and fill it myself, as was explained in detail earlier, up to the Trāyastriṃśa Heaven, where I gather food from the gods' kitchens and the four groups of people and fill it myself.",
        "source": "T24n1450_013:0168a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰有與我力得見聖道，依彼教力我得神通？」",
        "translation": "Who has the power to share with me to see the noble path and rely on the power of their teaching to attain my supernormal powers?\"",
        "source": "T24n1450_013:0168a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已，從坐而起往詣佛所，頂禮佛足而立一面。",
        "translation": "After he had this thought, he got up from his seat and went to the Buddha, bowed his head at his feet, and stood to one side.",
        "source": "T24n1450_013:0168a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多白世尊曰：「唯願慈悲，教我聖道令得神通。」",
        "translation": "Devadatta said to the Bhagavān, \"Please be merciful and teach me the noble path so that I can attain supernormal powers.\"",
        "source": "T24n1450_013:0168a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知提婆達多起罪逆心已，告提婆達多：「汝應受增戒中勤心修習，即得神通，乃至增心增智應受，心中當勤修習，即得神通及得餘法。」",
        "translation": "Knowing that Devadatta had developed a sinful and rebellious attitude, the Bhagavān then addressed Devadatta, \"You should accept the enhanced precepts and diligently cultivate them in your mind, and you will attain supernormal powers; even if you accept the enhanced mind and enhanced wisdom, you should diligently cultivate them in your mind, and you will attain supernormal powers and attain the other dharmas.\"",
        "source": "T24n1450_013:0168a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多聞此語已，作如是念：「世尊不肯教我神通法道。」",
        "translation": "After hearing these words, Devadatta had this thought, \"The Bhagavān won't teach me the way of the supernormal powers.\"",
        "source": "T24n1450_013:0168a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念已從座而起，往詣具壽阿若憍陳如所。",
        "translation": "After that thought, he got up from his seat and went to visit Ājñāta-kauṇḍinya.",
        "source": "T24n1450_013:0168a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到已問阿若憍陳如曰：「上座！",
        "translation": "When he arrived, he asked Ājñāta-kauṇḍinya, \"Sir!",
        "source": "T24n1450_013:0168a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願慈悲，教我聖道令得神通。」",
        "translation": "Please have mercy and teach me the noble path so that I can attain supernormal powers.\"",
        "source": "T24n1450_013:0168a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿若憍陳如觀佛，知提婆達多起罪逆心，觀已告提婆達多曰：「汝應增色心中勤習，即得神通及得餘法。」",
        "translation": "It was then that Ājñāta-kauṇḍinya observed the Buddha and knew that Devadatta had developed a sinful and rebellious attitude. After observing this, he told Devadatta, \"You should intensify your mental training in form, and you will attain supernormal powers and attain the rest of the Dharma.\"",
        "source": "T24n1450_013:0168a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多聞此語已，作如是念：「此上坐亦不肯教我神通道法。」",
        "translation": "After hearing these words, Devadatta had this thought, \"Even this superior sitter refuses to teach me the way of the supernormal powers.\"",
        "source": "T24n1450_013:0168b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即往詣馬勝、賢子、禪氣、大名、圓滿、無垢、牛王眼、妙臂乃至五百上坐邊去，到已問曰：「上坐慈悲！",
        "translation": "He then went to visit Mañjuśrī, Bhadraśri, Zenkai, Dame, Pūrṇa, Unsullied, Niuwang-eye, Miaobi, and even the 500 superior sitters, and when he arrived, he asked, \"Have mercy, superior sitter!",
        "source": "T24n1450_013:0168b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教我聖道令得神通。」",
        "translation": "Teach me the noble path so that I'll attain supernormal powers.\"",
        "source": "T24n1450_013:0168b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時妙臂等五百苾芻，咸觀佛意，知提婆達多起罪逆心，觀已告提婆達多曰：「汝應增色心中勤習，即得神通及得餘法，乃至受想行識，汝應增意心中勤習，即得神通及諸餘法。」",
        "translation": "It was then that five hundred monks, including Miaobi, all observed the Buddha's intention, knew that Devadatta had developed a sinful and rebellious attitude, and after observing it, they told Devadatta, \"You should increase your diligence in form and mind, and you'll attain supernormal powers and attain the other dharmas, up to feeling, perception, volition, and consciousness, and you should increase your diligence in mind and mind, and you'll attain supernormal powers and the other dharmas.\"",
        "source": "T24n1450_013:0168b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多聞此語已，作如是念：「此五百上座等，亦不肯教我聖道神通，欲似此五百上座，先共世尊平章，不許教我聖道。",
        "translation": "After hearing this, Devadatta had this thought, \"These 500 ascetics and others wouldn't teach me the noble path's supernormal powers, and I want to be like these 500 ascetics who first shared the Bhagavān's equal rank and didn't allow me to teach the noble path.",
        "source": "T24n1450_013:0168b09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_013:0168b12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今見佛等五百上座，不肯教聖道神通。」",
        "translation": "Now, I see that the Buddha and the other 500 ascended masters won't teach me the noble path's supernormal abilities.\"",
        "source": "T24n1450_013:0168b12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復念：「如是何有能教我聖道神通？",
        "translation": "Again, he thought, \"How could such a person teach me the noble path's supernormal abilities?",
        "source": "T24n1450_013:0168b13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當時十力迦攝波，在王舍城先尼迦窟中，我詣彼處。",
        "translation": "At the time, the ten-powerful Kāśyapa was in the cave of Seneca in Rājagṛha, and I went there.",
        "source": "T24n1450_013:0168b14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼上座直心無諂，及我弟阿難陀親教，彼十力上座能教我聖道神通。」",
        "translation": "That ascetic was straightforward and without guile, and my disciple Ānanda taught him personally that the ten-powerful ascetic could teach me the noble path's supernormal powers.\"",
        "source": "T24n1450_013:0168b15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多念已，即往詣十力迦攝所，頂禮雙足於一邊立，作如是語：「上座十力迦攝慈悲，教我聖道神通。」",
        "translation": "After he thought this, Devadatta went to Śāriputra's place, bowed his head with his feet at one side, and made these words, \"The superior Śāriputra is compassionate and teaches me the noble path's supernormal powers.\"",
        "source": "T24n1450_013:0168b17_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時十力迦葉，不觀佛意及五百上座聖眾意，亦不知提婆達多發生如是逆心。",
        "translation": "At the time, Śubhavyūha-kāśyapa didn't observe the Buddha's intention or the thoughts of the five hundred sages on the throne, nor did he know that Devadatta had developed such a rebellious attitude.",
        "source": "T24n1450_013:0168b19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不觀故，即教提婆達多聖道神通。",
        "translation": "Because he didn't contemplate them, he then taught Devadatta the noble path's supernormal abilities.",
        "source": "T24n1450_013:0168b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時提婆達多，於初夜後夜修習善業而住，依止初禪得獲神通。",
        "translation": "At the time, Devadatta cultivated good actions during the early and latter portions of the night and relied on the first dhyāna to attain supernormal powers.",
        "source": "T24n1450_013:0168b22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以神力，一身變作多身，多身合為一身，或現或隱。",
        "translation": "That is, with supernormal powers, one body becomes many bodies, and many bodies merge into one, whether visible or invisible.",
        "source": "T24n1450_013:0168b23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以智見力故，能如是現。",
        "translation": "Because of the power of wisdom and insight, they're able to show up like this.",
        "source": "T24n1450_013:0168b24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於山石牆壁，通過無礙如於虛空；於大地出沒，猶如水中；在於虛空中結跏趺坐，猶如在地；或騰虛空猶如飛鳥，或在地手捫日月。",
        "translation": "Again, he passes unobstructed over mountains and rocks and walls like space, emerges from the earth like water, sits cross-legged in space like he's on the ground, rises into space like a bird in flight, or stands on the ground with his hand on the sun and moon.",
        "source": "T24n1450_013:0168b25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多得神通已，作如是念：「我得如是神通，作諸變相神通亦得，詣贍部林中取香美果，滿鉢充足，供養四眾自亦飽足，廣說如前。",
        "translation": "After attaining his supernormal powers, Devadatta had this thought, \"I've attained this kind of supernormal power, and I've also attained the supernormal power to perform various miraculous feats.",
        "source": "T24n1450_013:0168b28_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至三十三天取天厨食，亦供養四眾自亦充足。」",
        "translation": "Even the Trāyastriṃśa gods obtain food from the gods' kitchens, and they provide enough for the four groups of people themselves.\"",
        "source": "T24n1450_013:0168c02_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更思念：「此摩揭陀國中誰人最勝？",
        "translation": "Again, he thought, \"Who's the best among the Magadhas?",
        "source": "T24n1450_013:0168c03_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我當歸伏。",
        "translation": "I will subdue them.",
        "source": "T24n1450_013:0168c04_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因彼人故，令一切人皆恭敬我。」",
        "translation": "Because of those people, I'll be respected by all of them.\"",
        "source": "T24n1450_013:0168c04_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復更思念：「此國太子阿闍世，父王亡後太子為王，我應降伏。",
        "translation": "Again, he thought, \"I should subjugate the prince of this country, Ajātaśatru, who became king after his father's death.",
        "source": "T24n1450_013:0168c05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我若降得阿闍世太子，令一切人皆恭敬我。」",
        "translation": "If I subjugate Prince Ajātaśatru, it will cause all people to respect me.\"",
        "source": "T24n1450_013:0168c06_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作此念已，往詣阿闍世所，即現神相化為白象，即入大門從小門出，或入小門從大門出已，自現其身更入大門，變為駿馬從小門出已，自現其身欲入小門。",
        "translation": "After he had this thought, he went to the Ajātaśatru and was transformed into a white elephant that entered the large gate and exited the small gate, or he entered the small gate and exited the large gate, then he showed himself entering the large gate again, and he changed into a stallion that exited the small gate and showed himself wanting to enter the small gate.",
        "source": "T24n1450_013:0168c07_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即為牛王從大門出已，即真身現，如法持鉢詣阿闍世所，即變其身猶如小兒，身衣金瓔坐太子膝上，乍起乍坐流轉徘徊。",
        "translation": "After emerging from the large gate, he then appeared in his true form, carried his bowl according to the teaching, and went to the Ajātaśatru. He then transformed his body into that of a small child, robed in gold and sitting on the prince's lap, and wandered about in circles as he rose and sat down at first.",
        "source": "T24n1450_013:0168c11_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子知是提婆達多神通之相，或抃、或抱、或拍、或嗚，便唾口中。",
        "translation": "Knowing that this was the prince's expression of Devadatta's superknowledge, the prince either applauded, hugged, patted, or cried out, and then spat in his mouth.",
        "source": "T24n1450_013:0168c13_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多以供養利益貪心故，即咽其唾。",
        "translation": "Devadatta then swallowed his saliva out of desire to make offerings for his benefit.",
        "source": "T24n1450_013:0168c15_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿闍世起顛倒心，作如是念：「此提婆達多勝佛神通。」",
        "translation": "The Ajātaśatru then became mistaken and thought, \"This Devadatta is superior to the Buddha's superknowledge.\"",
        "source": "T24n1450_013:0168c16_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多自現真身，是時太子心生恭敬便即頂禮，及諸供養將五百寶車送。",
        "translation": "When Devadatta himself appeared in his true form, the prince was overcome with respect, paid homage, made offerings, and sent five hundred precious carts.",
        "source": "T24n1450_013:0168c17_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多出，時阿闍世還至本處，每日兩迴參提婆達多，及承事供養。",
        "translation": "When Devadatta left, the Ajātaśatru returned to his original place, visited Devadatta twice a day, and made offerings to him.",
        "source": "T24n1450_013:0168c19_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時太子遣立五百大鐺作諸飲食，送至提婆達多以為供養。",
        "translation": "The prince then sent five hundred great chariots to prepare food and drink and deliver it to Devadatta as offerings.",
        "source": "T24n1450_013:0168c20_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時提婆達多收取自食，及五百苾芻圍遶共食。",
        "translation": "Devadatta then collected the food for himself and 500 monks who gathered around him to eat it together.",
        "source": "T24n1450_013:0168c22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時苾芻於王舍城晨朝乞食，聞如是語：「此提婆達多得太子種種利供養，日日二時恒日不絕，及五百車輅寶車承事供養，及五百鐺作諸飲食而為供養，及將自食五百苾芻圍遶而食。」",
        "translation": "The monks were begging for alms in the morning in Rājagṛha when they heard this, \"This Devadatta receives offerings from the prince in various ways, which continue day after day, and he receives offerings from five hundred chariots, five hundred chariots, and jewels, makes offerings of food and drink, and surrounds himself with five hundred monks who eat.\"",
        "source": "T24n1450_013:0168c23_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻聞此事已，次第乞食還至本處，依法食訖，收衣鉢洗足已，往佛所頂禮佛足次第而坐。",
        "translation": "After hearing this, the monks returned to their original place in order to solicit alms, finished eating according to the rules, put away their robes and bowls, washed their feet, went to the Buddha, bowed their heads at his feet, and sat down in order.",
        "source": "T24n1450_013:0168c27_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而白佛言：「大德！",
        "translation": "They then said to the Buddha, \"Mañjuśrī!",
        "source": "T24n1450_013:0168c29_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等晨朝入王舍城乞食，聞提婆達多從阿闍世太子所多得利養，廣說如上。",
        "translation": "We went into Rājagṛha in the morning to solicit alms and heard that Devadatta had received many benefits from Prince Ajātaśatru, as explained in detail above.",
        "source": "T24n1450_013:0168c29_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至五百苾芻圍遶坐共食。」",
        "translation": "Up to five hundred monks sat around them and ate together.\"",
        "source": "T24n1450_013:0169a02_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸苾芻：「時提婆達多受此利益供養，猶此自害及以兼害。",
        "translation": "The Buddha told the monks, \"At the time, Devadatta was accepting this beneficial offering, just as he was doing harm to himself and to others.",
        "source": "T24n1450_013:0169a03_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T24n1450_013:0169a04_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "bhikṣus!",
        "source": "T24n1450_013:0169a04_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如芭蕉出菓便即枯死，猶此自害；提婆達多受此利養亦復如是。",
        "translation": "\"It's like a plantain that withers when fruit emerges, just like this self-harm; so too does Devadatta receive this benefit.",
        "source": "T24n1450_013:0169a05_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如竹葦若出花菓便即枯死，如騾懷妊有子便死。",
        "translation": "It's like the bamboo reed that withers when flowers and fruits emerge, or a maiden that dies when she's expecting a child.",
        "source": "T24n1450_013:0169a06_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "Monks!",
        "source": "T24n1450_013:0169a07_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多受此利益亦復如是。",
        "translation": "*Tridharmapāda likewise received this benefit.",
        "source": "T24n1450_013:0169a07_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苾芻！",
        "translation": "\"Bhikṣus!",
        "source": "T24n1450_013:0169a08_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多若受利養，得彼無智。",
        "translation": "\"If Devadatta receives benefits, he'll attain their lack of knowledge.",
        "source": "T24n1450_013:0169a08_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多日夜長受惡名，苦惱無利，得如是報。",
        "translation": "Day and night, Devadatta is subject to a long, bad reputation, suffering, and lack of benefit, which brings such results.",
        "source": "T24n1450_013:0169a09_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等苾芻應如是知。」",
        "translation": "You monks should know it this way.\"",
        "source": "T24n1450_013:0169a10_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時提婆達多廣得利養，遂起貪心更不希求，起顛倒心別生憶念：「世尊今既年老力弱，今為四眾說法勞苦，世尊不如與我四眾，我自教示而為說法。",
        "translation": "It was then that Devadatta, having gained extensive benefits, became greedy and didn't seek any more, and he gave rise to a mistaken mind that recollected, \"Now that the Bhagavān is old and weak, and now he's doing the hard work of preaching for the four groups of people, why don't you give me four people and I'll teach and instruct them myself?",
        "source": "T24n1450_013:0169a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊當可宴寂而坐，修習善法常住安樂。」",
        "translation": "The Bhagavān will then sit in repose and cultivate good qualities that will lead to permanent happiness.\"",
        "source": "T24n1450_013:0169a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時提婆達多起此念已，即失神通，自不覺知我失神通。",
        "translation": "After he had this thought, Devadatta lost his psychic powers and didn't realize that I'd lost them.",
        "source": "T24n1450_013:0169a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦俱羅苾芻，習四無畏除貪念心，死生梵天，即見提婆達多遂失神通，是提婆達多亦不自知。",
        "translation": "It was then that a monk named Kakkula, who had practiced the four fearlessnesses to rid his mind of craving and had been born in the Brahma Heaven after his death, saw that Devadatta had then lost his psychic powers, and Devadatta didn't know it himself.",
        "source": "T24n1450_013:0169a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目揵連，在揭伽國膠魚山恐怖鹿林中。",
        "translation": "Mahāmaudgalyāyana was then in the Deer Preserve of Terror on Gay Fish Mountain in the country of Ghāra.",
        "source": "T24n1450_013:0169a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼迦俱羅梵天子從彼天沒，如屈申臂頃往目連處，頂禮雙足却住一面，作如是語：「大德目連！",
        "translation": "The Kākulabrahma deva descended from that heaven, went to Maudgalyāyana like he was bending his arm, bowed his head at his feet, and withdrew to one side, saying, \"Maudgalyāyana!",
        "source": "T24n1450_013:0169a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今可知提婆達多為利養故，遂起貪心更復希求，起顛倒心別生憶念：『世尊今既年老力弱，今為四眾說法疲倦勞苦。",
        "translation": "Now, it's clear that Devadatta, because of his desire for gain, then became greedy and sought after it again, and he gave rise to the mistaken thought, \"Now, the Bhagavān is old and weak, and I'm tired and weary from preaching for the four groups of people.",
        "source": "T24n1450_013:0169a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊不如與我四眾，我自教示亦為說法。",
        "translation": "Bhagavān, why don't you give us four people, and I'll teach and instruct them myself?",
        "source": "T24n1450_013:0169a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊當可宴寂而坐，證習善法常住安樂。』",
        "translation": "The Bhagavān will then sit in repose and realize the cultivation of good qualities that are always abiding and comfortable.'",
        "source": "T24n1450_013:0169a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時提婆達多起此念心，即失神通，自不覺知我失神通。",
        "translation": "Devadatta then had this thought, which was to lose his psychic powers, and didn't realize that I'd lost them.",
        "source": "T24n1450_013:0169a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大德大目揵連！",
        "translation": "'Venerable Mahāmaudgalyāyana!",
        "source": "T24n1450_013:0169a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起慈悲心往詣佛所，說提婆達多如上緣起，乃至失其神通自不覺知。」",
        "translation": "He arouse a compassionate mind and went to the Buddha, saying, 'Thus did Devadatta depend on this, even though he lost his supernormal powers and didn't know it himself.'\"",
        "source": "T24n1450_013:0169a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目揵連，從梵天子默然受語。",
        "translation": "Mahāmaudgalyāyana then quietly accepted the words from the Brahmakāyika gods.",
        "source": "T24n1450_013:0169b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時迦俱羅天子知目連受已，心生歡喜，頂禮目連雙足，忽然不現。",
        "translation": "Knowing that Maudgalyāyana had accepted it, the Kākulika gods rejoiced, bowed their heads at Maudgalyāyana's feet, and suddenly disappeared.",
        "source": "T24n1450_013:0169b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目乾連見梵天去，便即入如是定。",
        "translation": "Seeing Brahmā depart, Mahāmaudgalyāyana then immediately entered such a state of meditation.",
        "source": "T24n1450_013:0169b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從膠魚山沒，即於王舍城迦蘭鐸迦竹林園中踊現，詣世尊所頂禮雙足却住一面。",
        "translation": "He left Mount Gumbo and reappeared in the Kalandaka Bamboo Grove of Rājagṛha, where he bowed his head at the feet of the Bhagavān and withdrew to one side.",
        "source": "T24n1450_013:0169b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目乾連，所受迦俱羅天子言語，皆悉諮白。",
        "translation": "Mahāmaudgalyāyana then explained everything that he had heard the Kākulika gods say.",
        "source": "T24n1450_013:0169b07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時世尊告目連曰：「汝先知提婆達多如上事耶？",
        "translation": "The Bhagavān then addressed Maudgalyāyana, \"Did you know the above about Devadatta?",
        "source": "T24n1450_013:0169b08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為復報汝始知。」",
        "translation": "In order to retaliate, you'll first know.\"",
        "source": "T24n1450_013:0169b09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時目揵連白言：「世尊！",
        "translation": "Maudgalyāyana then said, \"Bhagavān!",
        "source": "T24n1450_013:0169b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先舊知。」",
        "translation": "I've known it before.\"",
        "source": "T24n1450_013:0169b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊共目揵連說是語時，提婆達多共四苾芻：一名迦利迦、二名褰荼達驃、三名羯吒謨洛迦底沙、四名三沒羅達多，共此四人同詣佛所。",
        "translation": "When the Bhagavān and Maudgalyāyana said this, four monks named Devadatta and their companions, one from Kālika, two from Śaṇḍadarjuna, three from Kāṭamālokadīṣa, and four from Sambhūradatta, came together to the Buddha.",
        "source": "T24n1450_013:0169b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊遙見提婆達多等來，告目連曰：「且止莫語！",
        "translation": "When the Bhagavān saw Devadatta and the others coming from a distance, he told Maudgalyāyana, \"Stop! Don't say anything!",
        "source": "T24n1450_013:0169b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼無智提婆達多等來。",
        "translation": "That ignorant man Devadatta and the others came.",
        "source": "T24n1450_013:0169b14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此無智人今對我前，如上之事，定當自說亦自讚歎。」",
        "translation": "Now, this ignorant man will surely explain and praise himself for the things like these that he's done before me.\"",
        "source": "T24n1450_013:0169b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大目揵連禮佛雙足，入如是定，從竹林沒，往膠魚山至本處已，如法而坐。",
        "translation": "Venerable Mahāmaudgalyāyana then saluted the Buddha's feet, entered this concentration, left the bamboo grove, went to Gumbo Mountain, and reached his home base, where he sat down according to the teaching.",
        "source": "T24n1450_013:0169b16_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時提婆達多詣世尊所，頂禮雙足却住一面，而白佛言：「世尊今既年老力弱，為四眾說法勞苦。",
        "translation": "Devadatta then went to the Bhagavān, bowed his head at his feet, withdrew to one side, and said to the Buddha, \"Bhagavān, now that you're old and weak, it's hard for you to preach to the four groups of people.",
        "source": "T24n1450_013:0169b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊不如與我徒眾，我自教示而為說法。",
        "translation": "Bhagavān, why don't you give me a group of disciples and I'll teach and instruct them myself?",
        "source": "T24n1450_013:0169b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊當可宴寂而坐，修習善法常住安樂。」",
        "translation": "The Bhagavān can sit in repose and cultivate good qualities that will last forever and be comfortable.\"",
        "source": "T24n1450_013:0169b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊報曰：「如我舍利弗、大目揵連，弟子中尊聰明智慧、梵行神通證羅漢果，我今尚自不以苾芻僧伽而見付囑，豈可況汝無智癡人食唾者乎。」",
        "translation": "The Bhagavān answered, \"Suppose I, Śāriputra, or Mahāmaudgalyāyana, am one of those disciples who are honored for their intelligence, wisdom, and religious practice and superknowledge in realizing the fruit of the arhat, and I myself still don't see fit to entrust that to you as a monk in the monastery, so how could I ask you, an ignorant fool, to eat spit?\"",
        "source": "T24n1450_013:0169b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時提婆達多聞此語已，作如是念：「世尊今者讚歎舍利子、目連等，憎嫌於我。",
        "translation": "After hearing these words, Devadatta had this thought, \"The Bhagavān now praises Śāriputra, Maudgalyāyana, and the others and dislikes me.",
        "source": "T24n1450_013:0169b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罵云：『無智食唾者乎？』」",
        "translation": "Do you condemn them, 'Wisdomless spiteful people?'\"",
        "source": "T24n1450_013:0169b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時提婆達多，於世尊處遂起七種逆心。",
        "translation": "It was then that Devadatta gave rise to seven kinds of rebellious thoughts in the Bhagavān's presence.",
        "source": "T24n1450_013:0169b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事卷第十三",
        "translation": "Mūlasarvâstivāda-vinaya-vāsāṃbhavastu, vol. 13",
        "source": "T24n1450_013:0169c01_0",
        "is_bad_quality": false
    }
]