[
    {
        "source_sentence": "大智度論釋隨喜迴向品",
        "translation": "Gaṇḍavyūhasūtra",
        "source": "T25n1509_061:0487a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三十九(卷六十一)",
        "translation": "XXXIX (Vol. 61)",
        "source": "T25n1509_061:0487a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖者龍樹造",
        "translation": "created by the sage Nāgârjuna",
        "source": "T25n1509_061:0487a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, Tripiṭaka of Kucha, Later Qin Dynasty",
        "source": "T25n1509_061:0487a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】爾時，彌勒菩薩摩訶薩語慧命須菩提：「有菩薩摩訶薩隨喜福德，與一切眾生共之，迴向阿耨多羅三藐三菩提，以無所得故。",
        "translation": "[Sutra] At the time, Maitreya said to Wisdom Life Subhūti, \"There are bodhisattvas, mahāsattvas, and buddhas who delight in merit that's common to all sentient beings and which leads back to unsurpassed, correct enlightenment because it's unobtainable.",
        "source": "T25n1509_061:0487a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聲聞、辟支佛福德，若一切眾生福德，若布施，若持戒，若修定，若隨喜；是菩薩摩訶薩隨喜福德，與一切眾生共之，迴向阿耨多羅三藐三菩提；其福最上、第一、最妙、無上、無與等者！",
        "translation": "If it's the merit of the direct disciples and solitary realizers, if it's the merit of all sentient beings, if it's generosity, if it's observance of precepts, if it's cultivation of concentration, and if it's joyful, then this is the bodhisattva-mahāsattva's joyful merit that's common to all sentient beings and which leads back to unsurpassed, first, most marvelous, unsurpassed, and unequalled merit!",
        "source": "T25n1509_061:0487a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0487a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、辟支佛及一切眾生布施、持戒、修定、隨喜，為自調、為自淨、為自度故，所謂四念處乃至八聖道分，空、無相、無作；菩薩隨喜福德，迴向阿耨多羅三藐三菩提，持是功德，為調一切眾生、為淨一切眾生、為度一切眾生故起。」",
        "translation": "śrāvakas, pratyekabuddhas, and all sentient beings give generosity, observe precepts, cultivate concentration, and follow joy for their own regulation, purification, and deliverance, which are called the four abodes of mindfulness and even the eight noble factors of the path, which are empty, formless, and unconstructed; bodhisattvas follow joy and merit, dedicate themselves to the unsurpassed, correct, and complete enlightenment, and maintain this virtue in order to regulate all sentient beings, purify all sentient beings, and deliver all sentient beings.\"",
        "source": "T25n1509_061:0487a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，慧命須菩提白彌勒菩薩言：「諸菩薩摩訶薩念十方無量無邊阿僧祇世界中，無量無邊阿僧祇諸滅度佛，是佛從初發心至得阿耨多羅三藐三菩提，乃至入無餘涅槃，乃至法盡——於其中間諸善根；應六波羅蜜，及諸聲聞人善根——若布施福德、持戒福德、修定福德，及諸學人無漏善根、無學人無漏善根，諸佛戒眾、定眾、慧眾、解脫眾、解脫知見眾、一切智、大慈大悲及餘無量阿僧祇諸佛法；及諸佛所說法，是法中學，得須陀洹果乃至得阿羅漢果、辟支佛道，入菩薩摩訶薩位；及餘眾生種諸善根。",
        "translation": "爾時，慧命須菩提白彌勒菩薩言：「諸菩薩摩訶薩念十方無量無邊阿僧祇世界中，無量無邊阿僧祇諸滅度佛，是佛從初發心至得阿耨多羅三藐三菩提，乃至入無餘涅槃，乃至法盡——於其中間諸善根；應六波羅蜜，及諸聲聞人善根——若布施福德、持戒福德、修定福德，及諸學人無漏善根、無學人無漏善根，諸佛戒眾、定眾、慧眾、解脫眾、解脫知見眾、一切智、大慈大悲及餘無量阿僧祇諸佛法；及諸佛所說法，是法中學，得須陀洹果乃至得阿羅漢果、辟支佛道，入菩薩摩訶薩位；及餘眾生種諸善根。",
        "source": "T25n1509_061:0487a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸善根，一切和合，隨喜福德，迴向阿耨多羅三藐三菩提，最上、第一、最妙、無上、無與等者！",
        "translation": "These good roots, all combined, are merited, and the resultant virtue is directed toward the unsurpassed, first, most marvelous, unsurpassed, and peerless enlightenment!",
        "source": "T25n1509_061:0487b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是隨喜已，持是隨喜福德，迴向阿耨多羅三藐三菩提。",
        "translation": "After thus rejoicing, he maintains this merit of rejoicing and dedicates it to unsurpassed, correct enlightenment.",
        "source": "T25n1509_061:0487b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子行菩薩乘者作是念：『我是心迴向阿耨多羅三藐三菩提。』",
        "translation": "If there are good sons who practice the bodhisattva vehicle, they think, 'This is my mind converting to unsurpassed, correct enlightenment.'",
        "source": "T25n1509_061:0487b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是生心、緣、事，若善男子取相迴向阿耨多羅三藐三菩提，如所念可得不？」",
        "translation": "Are these the thoughts that arise when a good man takes the form and dedicates it to unsurpassed, correct, and complete enlightenment?\"",
        "source": "T25n1509_061:0487b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒菩薩語須菩提：「是善男子行菩薩乘，迴向阿耨多羅三藐三菩提，心是緣事，若善男子取相，不得如所念！」",
        "translation": "Maitreya said to Subhūti, \"This is a good man who practices the bodhisattva vehicle, dedicates his mind to unsurpassed, perfect enlightenment, and has these conditions in mind; if a good man grasps the marks, he cannot think as he thinks!\"",
        "source": "T25n1509_061:0487b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語彌勒菩薩：「若諸緣、諸事無所有，是善男子行菩薩乘者取相，於十方諸佛諸善根，從初發心乃至法盡，及聲聞辟支佛諸善根，學、無學善根，一切和合隨喜功德，迴向阿耨多羅三藐三菩提；以無相故，是菩薩將無顛倒：無常謂常，想顛倒、心顛倒、見顛倒；不淨謂淨、苦謂樂、無我謂我，想顛倒、心顛倒、見顛倒？",
        "translation": "Subhūti said to Maitreya: \"If conditions and things are nonexistent, is this a good man who practices the bodhisattva vehicle and takes on the characteristics of the good roots of the buddhas in the ten directions, the good roots of the śrāvakas, the good roots of the śrāvakas and pratyekbuddhas from the initial arousal of the mind until the end of the Dharma, the good roots of the śrāvakas and the good roots of the trainees and the post-trainees, and all the merits of combining and rejoicing in them, and dedicating them to the unsurpassed, correct, and contemplated enlightenment because they lack characteristics?",
        "source": "T25n1509_061:0487b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如緣、如事，阿耨多羅三藐三菩提亦如是，迴向心亦如是，檀波羅蜜，尸羅、羼提、毘梨耶、禪、般若波羅蜜，乃至十八不共法亦如是。",
        "translation": "If these are the conditions and circumstances, then so is supreme perfect enlightenment, so is the mind of dedication of merit, so is the perfection of giving, and so are the perfections of śīla, śrāvastī, vīrya, meditation, prajñāpāramitā, and even the 18 uncommon dharmas.",
        "source": "T25n1509_061:0487b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾者，何等是緣？",
        "translation": "If that's the case, what are the conditions?",
        "source": "T25n1509_061:0487b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是事？",
        "translation": "What is this matter?",
        "source": "T25n1509_061:0487b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是阿耨多羅三藐三菩提？",
        "translation": "What is supreme perfect enlightenment?",
        "source": "T25n1509_061:0487b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是善根？",
        "translation": "What are the wholesome roots?",
        "source": "T25n1509_061:0487b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是隨喜心迴向阿耨多羅三藐三菩提？」",
        "translation": "What is the joyous conversion to supreme perfect enlightenment?\"",
        "source": "T25n1509_061:0487b22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：先七品中，佛命須菩提令說般若，中間帝釋多問、多說功德事。",
        "translation": "[Commentary] It says, \"In the first seven chapters, the Buddha ordered Suppositories to teach about prajñā, and in the middle Tissa asked many questions and explained many meritorious qualities.",
        "source": "T25n1509_061:0487b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今彌勒順佛本意，還欲令須菩提因隨喜法廣說般若波羅蜜。",
        "translation": "Now, Maitreya followed the Buddha's original intention and also wanted to make Suppositories teach Prajñāpāramit extensively because of the joyful teaching.",
        "source": "T25n1509_061:0487b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，帝釋聞上供養般若以華香、妓樂、幡蓋之具，得福甚多，深自慶幸，此供養具，唯我等能辦，非出家人所有。",
        "translation": "Furthermore, Tīrṣa rejoiced deeply when he heard that the offerings to Prajñā made with flowers, incense, musicians, and banners had been so blessed that only we could make these offerings, not monks.",
        "source": "T25n1509_061:0487b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故彌勒欲抑其自多之情故語須菩提：「菩薩但以心隨喜，則勝聲聞、辟支佛、一切眾生布施等及諸無漏功德，何況華香、供養經卷等！」",
        "translation": "That's why Maitreya wanted to suppress his own feelings and therefore said to Subhūti, \"A bodhisattva who simply follows the joy of his heart is superior to śrāvakas, pratyekabuddhas, and all sentient beings in terms of generosity and other untainted merits, let alone flowers, incense, offerings to sūtra scrolls, and so forth!\"",
        "source": "T25n1509_061:0487b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩義，如先說。",
        "translation": "The meaning of bodhisattva-mahāsattva is as explained earlier.",
        "source": "T25n1509_061:0487c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨喜福德者，不勞身、口業作諸功德，但以心方便見他修福，隨而歡喜作是念：「一切眾生中，能修福行道者最為殊勝！」",
        "translation": "Those who rejoice in merit don't trouble themselves with physical or verbal actions that produce virtues, but rather use their mind's skillful means to see others cultivating merit, and then rejoice and think, \"Among all sentient beings, that person who cultivates the path of merit is most excellent!\"",
        "source": "T25n1509_061:0487c04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離福德，人與畜生同行三事，三事者：婬欲、飲食、戰鬪。",
        "translation": "If they part with virtue, humans and animals will walk together in three ways, which are lust, food, and fighting.",
        "source": "T25n1509_061:0487c07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能修行福德行道之人，一切眾生所共尊重愛敬。",
        "translation": "Those who cultivate the path of virtuous conduct are respected and venerated by all sentient beings.",
        "source": "T25n1509_061:0487c08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如熱時，清涼滿月，無不樂仰；亦如大會告集，伎樂、餚饌無不畢備，遠近諸人咸共欣赴。",
        "translation": "It's like when it's hot and the moon is cool and full, and no one is without joy or admiration; it's like when a large assembly is called, music and food are always ready, and people from near and far all rejoice.",
        "source": "T25n1509_061:0487c09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修福之人，亦復如是。",
        "translation": "So it is with someone who cultivates merit.",
        "source": "T25n1509_061:0487c11_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "福德有二種樂因緣：世間，出世間。",
        "translation": "There are two kinds of causes and conditions for merit that are pleasant: mundane and transmundane.",
        "source": "T25n1509_061:0487c12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出世間者，諸無漏法，雖無福報，能生福德，故名福德。",
        "translation": "Those who go beyond the mundane are uncontaminated dharmas that produce merit even though they lack the rewards of merit; therefore, they're called virtuous.",
        "source": "T25n1509_061:0487c13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故有漏、無漏，通名福德。",
        "translation": "Therefore, contaminated and uncontaminated things are both called merit.",
        "source": "T25n1509_061:0487c14_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，福德是菩薩摩訶薩根本，能滿所願；一切聖人所讚歎，無智人所毀呰；智人所行處，無智人所遠離。",
        "translation": "Furthermore, merit is the root of the bodhisattva-mahāsattva's ability to fulfill wishes that are praised by all the sages and disparaged by no wise person, and it's the place where wise people go that no wise person leaves.",
        "source": "T25n1509_061:0487c14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是福德因緣故，作人王、轉輪聖王、天王、阿羅漢、辟支佛、諸佛世尊，大慈大悲、十力、四無所畏、一切種智、自在無礙，皆從福德中生。",
        "translation": "Because of these causes and conditions of merit, they become human kings, wheel-turning sage kings, heavenly kings, arhats, pratyekabuddhas, and world-honored buddhas, and they all derive their great kindness, great compassion, the ten powers, the four fearlessnesses, all kinds of cognition, and unimpededness from merit.",
        "source": "T25n1509_061:0487c17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種福德，得正見故，隨而歡喜。",
        "translation": "Because of these various merits, they attain right view and rejoice accordingly.",
        "source": "T25n1509_061:0487c20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩自念：我應與一切眾生樂，而眾生能自行福德，是故心生歡喜。",
        "translation": "Furthermore, the bodhisattva thinks to himself, \"I should give pleasure to all sentient beings, but sentient beings are able to achieve virtue on their own, so my mind rejoices.",
        "source": "T25n1509_061:0487c21_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，一切眾生行善，與我相似，是我同伴，是故隨喜。",
        "translation": "Furthermore, all sentient beings who do good deeds are like me and are my companions, so they rejoice accordingly.",
        "source": "T25n1509_061:0487c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩摩訶薩於十方三世諸佛及菩薩、聲聞、辟支佛及一切修福眾生布施、持戒、修定慧，於此福德中生隨喜福德，是故名隨喜。",
        "translation": "When bodhisattvas, mahāsattvas, buddhas, bodhisattvas, śrāvakas, solitary buddhas, and all living beings who cultivate merit give generosity, observe precepts, and cultivate concentration and wisdom, this merit produces the merit of following joy, which is called rejoicing.",
        "source": "T25n1509_061:0487c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持是隨喜福德共一切眾生，迴向阿耨多羅三藐三菩提。",
        "translation": "Holding this merit of rejoicing shares it with all sentient beings and dedicates it to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0487c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共一切眾生者，是福德不可得與一切眾生，而果報可與。",
        "translation": "Sharing this merit with all sentient beings means that merit can't be shared with all sentient beings, but the fruit can be shared.",
        "source": "T25n1509_061:0487c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩既得福德果報——衣服、飲食等世間樂具，以利益眾生。",
        "translation": "Since the bodhisattva has attained the rewards of merit - clothing, food, and other worldly pleasures - to benefit sentient beings, he'll be able to share them with them.",
        "source": "T25n1509_061:0488a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩以福德清淨身口，人所信受，為眾生說法，令得十善道、四禪等，與作後世利益。",
        "translation": "With merit, the bodhisattva purifies his body and speech, which are accepted by people, and teaches sentient beings, causing them to attain the ten good paths, the four meditation heavens, and so forth, and creates benefits for the afterlife.",
        "source": "T25n1509_061:0488a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "末後成佛，得福德果報，身有三十二相、八十種隨形好、無量光明，觀者無厭；無量清淨，梵音柔和，無礙解脫等諸佛法，於三事示現，度無量阿僧祇眾生。",
        "translation": "At the end, he becomes a buddha and attains the rewards of merit, a body with thirty-two marks, eighty minor features, measureless lights that are unfailing to behold, measureless purity, gentle Sanskrit sounds, unhindered liberation, and other buddha-teachings that are manifested in three ways to save measureless incalculable sentient beings.",
        "source": "T25n1509_061:0488a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般涅槃後，碎身舍利，與人供養，久後皆令得道。",
        "translation": "After parinirvāṇa, he'll dismember his body and give its relics to people for offerings, which will cause them to attain the way after a long time.",
        "source": "T25n1509_061:0488a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是果報可與一切眾生，以果中說因故，言「福德與眾生共」。",
        "translation": "This is a result that can be shared with all sentient beings, and it's because the cause is explained within the result that it's called \"shared by merit with sentient beings.\"",
        "source": "T25n1509_061:0488a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若福德可以與人者，諸佛從初發心所集福德盡可與人，然後更作。",
        "translation": "If merit can be given to people, then all the merit that buddhas gather from their initial arousal of mind can be given to people before they do anything more.",
        "source": "T25n1509_061:0488a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善法體不可與人，今直以無畏、無惱施與眾生用。",
        "translation": "The essence of good qualities can't be given to people, but now I'm simply giving them to sentient beings for their use with fearlessness and lack of vexation.",
        "source": "T25n1509_061:0488a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無所得故」者，義如先說。",
        "translation": "The expression \"because it's unobtainable\" has the same meaning as explained earlier.",
        "source": "T25n1509_061:0488a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名菩薩摩訶薩隨喜福德，比一切聲聞、辟支佛及眾生三種福德中，最勝、最上、第一、最妙、無上、無與等義如先說。",
        "translation": "This is called the blessedness of the bodhisattva-mahāsattva's happiness that compares with the three kinds of merit of all śrāvakas, pratyekabuddhas, and sentient beings, and it's the most excellent, superior, first, most marvelous, unsurpassed, and peerless, just as explained earlier.",
        "source": "T25n1509_061:0488a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中說勝因緣：「是二乘福德，皆為自調、自淨、自度。」",
        "translation": "This explains the superior causes and conditions, \"These two vehicles' merits are self-regulating, self-purifying, and self-transcending.\"",
        "source": "T25n1509_061:0488a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持戒者，是自調；修禪者，是自淨；智慧者，是自度。",
        "translation": "Those who observe precepts are self-regulating, those who practice meditation are self-purifying, and those who are wise are self-transcending.",
        "source": "T25n1509_061:0488a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，自調者，正語、正業、正命；自淨者，正念、正定；自度者，正見、正思惟、正方便。",
        "translation": "Furthermore, self-adjustment is right speech, right action, and right livelihood; self-purity is right mindfulness and right concentration; and self-control is right view, right contemplation, and right method.",
        "source": "T25n1509_061:0488a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，布施因緣故自調，持戒因緣故自淨，修定因緣故自度。",
        "translation": "Furthermore, it's self-regulation for the cause and conditions of generosity, self-purification for the cause and conditions of maintaining precepts, and self-concentration for the cause and conditions of cultivating concentration.",
        "source": "T25n1509_061:0488a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修定者，是無漏法近因緣；無漏者，所謂三十七品、三解脫門等。",
        "translation": "Cultivating concentration is a condition close to the uncontaminated Dharma, and the uncontaminated refers to the thirty-seven factors and the three gates of liberation.",
        "source": "T25n1509_061:0488a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "布施、持戒，遠故不解。",
        "translation": "Giving and observing precepts are distant and therefore not understood.",
        "source": "T25n1509_061:0488a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩隨喜福德，雖無勤勞，為度一切眾生故勝。",
        "translation": "Although the bodhisattvas' joyful merit is lacking in effort, it's superior for the sake of liberating all sentient beings.",
        "source": "T25n1509_061:0488a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：實不度一切眾生，何以言「度一切眾生故勝」？",
        "translation": "Q: How can it be said, 'Superior because it will save all sentient beings' when it really doesn't save all sentient beings?",
        "source": "T25n1509_061:0488a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸佛菩薩功德力能度一切眾生，但以眾生無和合因緣故；譬如大火常有燒力，但以薪不近，故不得燒，近則能燒。",
        "translation": "Answer: \"The power of the merits of the buddhas and bodhisattvas can save all sentient beings, but it's because sentient beings don't have compatible causes and conditions; it's like a great fire that always has the power to burn, but because the firewood isn't near, it can't burn; when it's near, it can burn.",
        "source": "T25n1509_061:0488a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，須菩提以畢竟空智慧難問彌勒菩薩：「念諸佛福德隨喜，迴向無上道，是所念過去事，是事如所念不？」",
        "translation": "It was then that Subhūti asked Maitreya Bodhisattva, with the difficulty of knowing the ultimate emptiness, \"Is mindfulness of the merits of the buddhas and their rejoicing and dedication to the unsurpassed path something that was mindful of in the past, and is it something as mindful as that?\"",
        "source": "T25n1509_061:0488a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒以二因緣故答言：「不也！」",
        "translation": "Maitreya replied, \"No!\" on the basis of two causes.",
        "source": "T25n1509_061:0488b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、過去無量阿僧祇劫諸佛久已滅度，無復遺餘；菩薩或無宿命智，或有而不能及，但以如所聞憶想分別，故不如所念。",
        "translation": "First, the buddhas of the incalculable eons of the past have long since ceased and there are no more left; bodhisattvas might not have knowledge of past lives, or they might have it but aren't able to reach it, but because they discern what they hear, recall, and discern, they aren't as mindful as they should be.",
        "source": "T25n1509_061:0488b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、諸佛及功德，出三界、出三世，斷戲論語言道，如涅槃相，畢竟空清淨。",
        "translation": "Second, the buddhas and their attributes are transcendent, transcendent of the three realms and the three times, cutting off conceptual elaborations and the path of language, like the shape of nirvāṇa, and ultimately empty and pure.",
        "source": "T25n1509_061:0488b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨喜者分別諸佛及諸弟子善根功德，是迴向心及無上道非實，故言：「不也！」",
        "translation": "Those who delight in them discriminate the good roots and merits of the buddhas and disciples, which are not the real mind of dedication and the unsurpassed way, and therefore say, \"No!\"",
        "source": "T25n1509_061:0488b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提難言：「若無是事，是菩薩憶念分別，應墮顛倒。",
        "translation": "Subhūti asked, \"If these things didn't exist, then bodhisattvas would be mistaken in their recollection and discrimination.",
        "source": "T25n1509_061:0488b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是事畢竟空清淨相，憶念亦如是，諸過去佛功德亦如是，無分別、無異，云何得隨喜？」",
        "translation": "If these things are ultimately empty and pure in their characteristics, and their recollection is likewise, and the merits of past buddhas are likewise, without discrimination or difference, how can they be delighted in?\"",
        "source": "T25n1509_061:0488b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是略說義。",
        "translation": "This is a brief explanation of the meaning.",
        "source": "T25n1509_061:0488b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣則如經說，所謂須菩提問彌勒「若菩薩摩訶薩憶念過去十方無量無邊阿僧祇世界中諸滅度佛」者，是菩薩欲起隨喜福德，佛是福德主，是故念佛；聞經書說有過去佛名，故因是名廣念一切過去諸佛。",
        "translation": "It's as detailed as the sūtra says when Suppositior asks Maitreya, \"Suppose a bodhisattva Mahāsattva recollects the incalculable, limitless, and incalculable buddhas of the incalculable world in the ten directions in the past.\" That bodhisattva wants to arouse the merit of following the Buddha as the lord of merit, so he recollects the Buddha; he hears the sūtras say that there are names of past buddhas, so this is called extensive recollection of all the past buddhas.",
        "source": "T25n1509_061:0488b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「從初發心」者，初發心作願：「我當度一切眾生。」",
        "translation": "\"From the first arousal of the intention\" is when a person first arouses the intention and vows, \"I will save all sentient beings.\"",
        "source": "T25n1509_061:0488b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心相應三善根：不貪、不瞋、不癡；善根相應諸善法，及善根所起身、心、口業，和合是法，名為福德。",
        "translation": "This mind is associated with the three good roots: not craving, not angering, and not being foolish; the good roots are associated with good qualities, and the physical, mental, and verbal actions that arise from the good roots are combined with these qualities, which are called merit.",
        "source": "T25n1509_061:0488b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從初發心，行六波羅蜜，入菩薩位，得十地，乃至坐道場，是中菩薩自修福德和合得佛道。",
        "translation": "From the time he first arouses the aspiration, practices the six perfections, enters the bodhisattva stage, attains the tenth ground, and even sits on the site of enlightenment, this is the combination of merits that the bodhisattva cultivates on his own to attain the Buddha Way.",
        "source": "T25n1509_061:0488b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至入無餘涅槃滅度後，舍利及遺法，皆是佛自身功德和合。",
        "translation": "Even after they enter nirvāṇa without remainder and pass away, the relics and remaining teachings are the result of the Buddha's own merit and combination.",
        "source": "T25n1509_061:0488b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因諸佛，大乘人行六波羅蜜相應福德；「相應」者，除六波羅蜜，餘菩薩所行法皆攝入六波羅蜜中，故說「應六波羅蜜和合」。",
        "translation": "Because the buddhas and great vehicle people practice the merit associated with the six perfections, the word \"associated\" means that besides the six perfections, the other things bodhisattvas practice are all included in the six perfections, which is why it's called \"the merging of the six perfections.\"",
        "source": "T25n1509_061:0488b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若求聲聞、辟支佛人，種布施、持戒、修定等福德。",
        "translation": "If śrāvakas and pratyekbuddhas are sought, they'll cultivate the merits of generosity, maintaining precepts, and cultivating concentration.",
        "source": "T25n1509_061:0488b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞、辟支佛人有二種：一者、漏盡，名為「無學」；二者、得道，漏未盡，名為「學」。",
        "translation": "There are two kinds of śrāvakas and pratyekbuddhas: those who have ended the contaminants, which are called \"trainees,\" and those who have attained the path and have yet to end the contaminants, which are called \"trainees.\"",
        "source": "T25n1509_061:0488b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二人諸福德中善根勝，故但說「善根」。",
        "translation": "Of these two kinds of merit, their good roots are superior, so they simply say \"good roots.\"",
        "source": "T25n1509_061:0488c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上言「求二乘人」者，總凡夫、聖人；今「學、無學」者，純是聖人。",
        "translation": "The person who said, \"Seeking adherents of the two vehicles\" above is a general fellow and a sage, but the person who said, \"Trained and untrained,\" is purely a sage.",
        "source": "T25n1509_061:0488c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相好是無記色法，非是善功德，故但說「佛五無學眾」。",
        "translation": "These marks are indeterminate forms and dharmas, not good qualities, so they're simply described as \"the Buddha's five unlearned ones.",
        "source": "T25n1509_061:0488c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大慈大悲、佛法義，如初品中說。",
        "translation": "The meaning of great kindness, great compassion, and the Buddha's teaching is as explained in the preliminary section.",
        "source": "T25n1509_061:0488c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛所說法，學是法得須陀洹果，乃至入菩薩位」者，是佛滅度後，遺法中得道，是故重說。",
        "translation": "The phrase \"taught by the buddhas, who train in this Dharma and attain the fruit of stream entry and even enter the bodhisattvahood\" is repeated because it's the path attained in the remaining Dharma after the Buddha's passing away.",
        "source": "T25n1509_061:0488c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「及餘眾生種諸善根」者，此是佛在世及遺法中，天、人乃至畜生種福德因緣。",
        "translation": "\"This is the result of the merits that were cultivated by the Buddha during his lifetime and during his remaining teachings, which were cultivated by gods, humans, and even animals.",
        "source": "T25n1509_061:0488c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是上四段福德，行者心遍緣、憶念，隨喜，求佛道故迴向，名無上隨喜，最上、無與等。",
        "translation": "Of these four kinds of merit, the practitioner's mind is fully attuned to, recollects, and follows joy, and he dedicates himself to seeking the Buddha's path, which is called unsurpassed following joy, the highest, peerless, and so forth.",
        "source": "T25n1509_061:0488c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：求佛道者，何以不自作功德而心行隨喜？",
        "translation": "Q: Why doesn't someone seeking the Buddha's path create their own merit and conduct themselves in a way that's pleasing to their mind?",
        "source": "T25n1509_061:0488c11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸菩薩以方便力，他勤勞作功德，能於中起隨喜者，福德勝自作者。",
        "translation": "Answer: \"When bodhisattvas work hard with the power of skillful means to produce merits in others and can rejoice in them, their merit is superior to their own.",
        "source": "T25n1509_061:0488c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，是隨喜福德，即是實福德。",
        "translation": "Furthermore, this merit of rejoicing in what's done is real merit.",
        "source": "T25n1509_061:0488c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0488c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念過去佛，即是念佛三昧，亦是六念中念佛、念法、念僧、念戒、念捨、念天等。",
        "translation": "Mindfulness of past buddhas is the samādhi of mindfulness of the buddha, which is also one of the six kinds of mindfulness: mindfulness of the buddha, mindfulness of the Dharma, mindfulness of the saṃgha, mindfulness of precepts, mindfulness of equanimity, and mindfulness of the gods.",
        "source": "T25n1509_061:0488c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因行清淨戒，入禪定，起畢竟智慧，和合故能起正隨喜。",
        "translation": "As a result of practicing pure precepts, they enter meditation and become ultimately wise, and because of this combination, they can give rise to right joy.",
        "source": "T25n1509_061:0488c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不但隨喜而已，亦行是實法。",
        "translation": "Therefore, not only does he simply delight in what's true, he also practices what's true.",
        "source": "T25n1509_061:0488c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心迴向者，即是隨喜心。",
        "translation": "This is the mind that dedicates itself to this, which is the mind that's joyful.",
        "source": "T25n1509_061:0488c19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣者，隨喜心所緣，所謂一切諸佛及一切眾生所作功德。",
        "translation": "Conditioned, the mind that's conditioned by that joyful mind is the merits produced by all buddhas and all sentient beings.",
        "source": "T25n1509_061:0488c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "事者，若是所緣之本，福德是緣功德所住處，所謂諸佛及眾生，并土地、山林、精舍住處，皆名「事」。",
        "translation": "\"Things\" are called \"things\" if they are the origin of the conditioned qualities and the places where merits of conditioned virtues reside, which are the buddhas and sentient beings, as well as the land, mountains, forests, and dwelling places of monasteries.",
        "source": "T25n1509_061:0488c21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如所念可得不？」",
        "translation": "\"Can this be obtained as what's thought of?\"",
        "source": "T25n1509_061:0488c23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒答言：「不也！」",
        "translation": "Maitreya replied, \"No!\"",
        "source": "T25n1509_061:0488c23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語彌勒：「若諸事、諸緣無所有者，云何不墮顛倒？」",
        "translation": "Subhūti said to Maitreya, \"If all things and conditions have no owner, why doesn't he fall into delusion?\"",
        "source": "T25n1509_061:0488c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顛倒者，四顛倒，三種分別。",
        "translation": "\"Confusion\" refers to four kinds of confusion and three kinds of discrimination.",
        "source": "T25n1509_061:0488c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此顛倒是譬喻，無佛而憶想念佛，猶如無常而念常、不淨而念淨。",
        "translation": "This mistakenness is a metaphor for remembering and thinking about a Buddha when there's no Buddha, just like remembering the permanent when it's impermanent and remembering the pure when it's impure.",
        "source": "T25n1509_061:0488c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：見為諸顛倒本，如得初道人，能起想、心顛倒，無見顛倒，以見諦道斷故。",
        "translation": "Q: \"Regarding views as the basis of [mistaken] errors, suppose a person attains the first path and is capable of conceptual and mental mistakenness, but has no mistaken views because the path of seeing the truth is stopped.",
        "source": "T25n1509_061:0488c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：是顛倒，生時異、斷時異。",
        "translation": "Answer: These are mistaken beliefs that differ when they arise and differ when they are stopped.",
        "source": "T25n1509_061:0488c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生時，想在前，次是心，後是見；斷時，先斷見，見諦所斷故。",
        "translation": "When it arises, conception comes first, followed by mind and then views; when it's stopped, views are stopped first, because they are stopped by the seeing truth.",
        "source": "T25n1509_061:0489a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顛倒體皆是見相，見諦所斷。",
        "translation": "The mistaken entities are all characteristics of views, which are stopped by the truth of views.",
        "source": "T25n1509_061:0489a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "想、心顛倒者，學人未離欲，憶念忘故取淨相、起結使；還得正念即時滅，如經中譬喻：「如渧水墮大熱鐵上，即時消滅。」",
        "translation": "When conceptions and thoughts are mistaken, a student who's not yet free of desire and whose memory is forgetful therefore apprehends pure forms and creates the bond; when he returns to right mindfulness, it immediately ceases, as the sutra parables, \"Like a drop of water falling onto a large, hot iron, it immediately goes out.\"",
        "source": "T25n1509_061:0489a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小錯故假名顛倒，非實顛倒。",
        "translation": "Because of this minor mistake, it's nominally called mistaken, but not really mistaken.",
        "source": "T25n1509_061:0489a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說：凡夫人三種顛倒，學人二種顛倒。",
        "translation": "That's why it's said, 'There are three kinds of mistakenness in ordinary people and two kinds of mistakenness in trainees.'",
        "source": "T25n1509_061:0489a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，諸緣、諸事如實畢竟空，念亦空，菩提亦空，隨喜心亦空，檀波羅蜜乃至十八不共法亦空。",
        "translation": "Furthermore, while conditions and things really are ultimately empty, mindfulness is also empty, enlightenment is also empty, the mind of joyfulness is also empty, and the eighteen uncommon dharmas are also empty.",
        "source": "T25n1509_061:0489a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸法一相，所謂無相，此中何等是「緣」？",
        "translation": "If all things are unitary, which is called markless, what are the \"conditions\" here?",
        "source": "T25n1509_061:0489a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是「事」？",
        "translation": "What are these \"things\"?",
        "source": "T25n1509_061:0489a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是「心迴向無上道」？",
        "translation": "What is the \"turning of the mind toward the unsurpassed way\"?",
        "source": "T25n1509_061:0489a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】彌勒菩薩語須菩提：「若諸菩薩摩訶薩久行六波羅蜜、多供養諸佛、種善根、與善知識相隨、善學自相空法；是諸菩薩，是緣、是事、諸佛、諸善根、隨喜福德，不取相，迴向阿耨多羅三藐三菩提，以不二法非不二法、非相非不相、非可得法非不可得法、非淨非垢、不生不滅法，是名迴向阿耨多羅三藐三菩提。",
        "translation": "[Sutra] Maitreya spoke to Subhūti, \"Suppose bodhisattvas and mahāsattvas practice the six perfections for a long time, make many offerings to the buddhas, cultivate good roots, follow good friends, and well train in the Dharma of emptiness in its own aspect; these are the bodhisattvas who, given these conditions, these things, these buddhas, these good roots, and the merit of following joy, don't grasp characteristics and dedicate themselves to the unsurpassed, correct, and complete enlightenment, which is called dedication to the unsurpassed, correct, and complete enlightenment because it's not two things and not two things, not a mark and not a mark, not something obtainable and not something unobtainable, not pure and not defiled, and not something that arises or ceases.",
        "source": "T25n1509_061:0489a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸菩薩不久行六波羅蜜、不多供養諸佛、不種善根、不與善知識相隨、不善學自相空法；是諸菩薩，是諸緣、是諸事、諸佛、諸善根、隨喜福德，諸心取相，迴向阿耨多羅三藐三菩提，是不名迴向。",
        "translation": "If bodhisattvas don't practice the six perfections soon, don't make many offerings to the buddhas, don't plant good roots, don't associate with good friends, and don't train well in the doctrine of emptiness of distinctive characteristics, then these bodhisattvas, which are conditions, things, buddhas, good roots, and the merit of following joy, and which acquire characteristics in their minds, are directed toward unsurpassed, samyak-saṃbodhi, which is not called dedication of merit.",
        "source": "T25n1509_061:0489a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "\"Subhūti!",
        "source": "T25n1509_061:0489a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是般若波羅蜜義乃至一切種智義——所謂內空乃至無法有法空，不應為新學菩薩說。",
        "translation": "Such a meaning of the perfection of wisdom and such a meaning of omniscience - which is called internal emptiness and even the emptiness of nonexistence - shouldn't be explained for newly trained bodhisattvas.",
        "source": "T25n1509_061:0489a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0489a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩所有少許信樂恭敬清淨心皆亡失。",
        "translation": "\"This is a bodhisattva whose slight faith, happiness, respect, and purity of mind are all lost.",
        "source": "T25n1509_061:0489a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當在阿鞞跋致菩薩摩訶薩前說，若有為善知識所護，若久供養諸佛、種諸善根，應為是人說如是般若波羅蜜義乃至一切種智義——所謂內空乃至無法有法空。",
        "translation": "He will tell the abhidharma bodhisattva Mahāsattva, \"If he is protected by a good teacher and if he has long made offerings to the buddhas and planted good roots, he should explain for that person the meaning of such prajñāpāramit and the meaning of all kinds of cognition-that is, internal emptiness and the emptiness of nonexistent things.",
        "source": "T25n1509_061:0489a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人聞是法，不沒、不驚、不畏、不怖。",
        "translation": "When that person hears this teaching, he won't be confused, startled, frightened, or terrified.",
        "source": "T25n1509_061:0489b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "\"Subhūti!",
        "source": "T25n1509_061:0489b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩隨喜福德，應如是迴向阿耨多羅三藐三菩提，所謂菩薩用心隨喜功德，迴向阿耨多羅三藐三菩提，是心盡、滅、變、離，是緣、是事、是諸善根亦盡、滅、變、離。",
        "translation": "The bodhisattva's delight in merit should thus be directed toward unsurpassed, corrected, and complete enlightenment, which is called the bodhisattva's mind delighting in merit and directing it toward unsurpassed, corrected, and complete enlightenment, and these conditions, things, and good roots are also exhausted, ceased, changed, and removed.",
        "source": "T25n1509_061:0489b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中何等是隨喜心？",
        "translation": "What is this mind that delights in?",
        "source": "T25n1509_061:0489b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是諸緣？",
        "translation": "What are the various conditions?",
        "source": "T25n1509_061:0489b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是諸事？",
        "translation": "What are these things?",
        "source": "T25n1509_061:0489b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是諸善根隨喜迴向阿耨多羅三藐三菩提？",
        "translation": "\"What are the good roots that joyfully return to unsurpassed, correct enlightenment?",
        "source": "T25n1509_061:0489b07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二心不俱，是心性亦不可得迴向，菩薩云何隨喜心迴向阿耨多羅三藐三菩提？",
        "translation": "When these two mental states are not shared, this mental nature also cannot be directed, so how does a bodhisattva's mind of joyfulness direct itself to unsurpassed, correct enlightenment?",
        "source": "T25n1509_061:0489b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜時，如是知：是般若波羅蜜無有法，乃至檀波羅蜜亦無有法；色無有法，受、想、行、識乃至阿耨多羅三藐三菩提無有法。",
        "translation": "\"If a bodhisattva Mahāsattva thus knows when he practices the perfection of wisdom that the perfection of wisdom has no dharmas, even the perfection of giving has no dharmas; form has no dharmas, and feeling, perception, volition, and consciousness, even the unsurpassed, correct, and complete enlightenment, have no dharmas.",
        "source": "T25n1509_061:0489b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩應如是隨喜功德，迴向阿耨多羅三藐三菩提。",
        "translation": "Thus, bodhisattvas, mahāsattvas, should thus rejoice in merit and dedicate themselves to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0489b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是迴向，是名隨喜功德迴向阿耨多羅三藐三菩提。」",
        "translation": "If they can thus dedicate themselves, this is called dedicating the merit of joyful following to unsurpassed, correct enlightenment.\"",
        "source": "T25n1509_061:0489b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：彌勒意：以諸法甚深，隨喜心微妙，所謂不壞諸法相，而隨喜心迴向無上道，是事甚難！",
        "translation": "[Commentary] Explanation: Maitreya's teaching is, \"Given the profundity of dharmas and the subtlety of the mind that follows joy, it's a difficult thing to say that the characteristics of dharmas won't be destroyed and that the mind that follows joy will be directed toward the unsurpassed path!",
        "source": "T25n1509_061:0489b16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫人心剛強，不能行是法。",
        "translation": "Ordinary people's minds are too rigid to practice this teaching.",
        "source": "T25n1509_061:0489b18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故彌勒答言：若行者久修六波羅蜜，諸功德深厚故不動，所謂能信、能行，多供養諸佛、種善根故，集無量無邊阿僧祇功德，結使折損，其心柔軟，此是先世因緣。",
        "translation": "That's why Maitreya answered, \"If a practitioner has long cultivated the six perfections, which are deep in merit and therefore unmoving, and is able to believe and practice them, make many offerings to the buddhas, plant good roots, and gather measureless and limitless incalculable merits that bind and break, then his mind is gentle, which are the causes and conditions of prior lives.",
        "source": "T25n1509_061:0489b19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今世得好師、好同學，亦自學諸法實相空，巧方便故不著是空。",
        "translation": "In the present life, they've attained good teachers and fellow students, and they've trained themselves in the emptiness of the true characteristics of dharmas and don't cling to that emptiness because of skillful means.",
        "source": "T25n1509_061:0489b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種無量因緣故，諸法雖無相，而能起隨喜心，迴向無上道。",
        "translation": "Because of these various and innumerable causes, even though things lack characteristics, they can give rise to a joyful mind and dedicate themselves to the unsurpassed path.",
        "source": "T25n1509_061:0489b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鐵雖堅[革*卬]，入鑪則柔軟，隨作何器；菩薩心亦如是，久行六波羅蜜、善知識所護故，其心調柔；過去諸佛、諸緣、諸事、諸善根中，不取相，能起隨喜心，用無相迴向無上道。",
        "translation": "Like an iron that's hard [leather*ang] but becomes flexible when it's put into a metal, depending on what kind of vessel it's made into, so too is the mind of a bodhisattva who, because he's practiced the six perfections for a long time and has been protected by good friends, makes his mind flexible; among the buddhas, conditions, circumstances, and good roots of the past, he doesn't grasp characteristics, can give rise to a mind that's joyful, and uses signlessness to dedicate himself to the unsurpassed path.",
        "source": "T25n1509_061:0489b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無相者，能用不二非不二乃至不生不滅等。",
        "translation": "Being signless, he can use what's not two and what's not two ... what's not arising and what's not ceasing.",
        "source": "T25n1509_061:0489c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與上相違者，是名不能迴向。",
        "translation": "When it's at odds with the above, this is called not being able to dedicate oneself back to the path.",
        "source": "T25n1509_061:0489c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒知須菩提樂說空故語言：「如是般若波羅蜜隨喜義，不應新學菩薩前說。」",
        "translation": "Maitreya knew that Subhūti was comfortable speaking about emptiness, so he said, \"Such is the joyful meaning of prajñā-pāramitā, which shouldn't be explained to newly trained bodhisattvas.\"",
        "source": "T25n1509_061:0489c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0489c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有少福德善根者，聞是畢竟空法，即著空，作是念：「若一切法畢竟空無所有者，我何為作福德？」",
        "translation": "If someone with little virtue and good roots hears this teaching of ultimate emptiness, they become attached to emptiness and think, \"If all things are ultimately empty and have no owner, why should I produce virtue?\"",
        "source": "T25n1509_061:0489c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則忘失善業。",
        "translation": "Then they'll forget about good actions.",
        "source": "T25n1509_061:0489c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，新發意菩薩，先教取相隨喜，漸得方便力，爾乃能行無相隨喜。",
        "translation": "Therefore, newly aspiring bodhisattvas are first taught to take delight in characteristics and gradually attain the power of skillful means, then they'll be able to practice taking delight in none.",
        "source": "T25n1509_061:0489c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如鳥子，羽翼未成，不可逼令高翔；六翮成就，則能遠飛。",
        "translation": "It's like a bird whose wings haven't yet formed and can't be forced to fly high, but when its six limbs are complete, it's able to fly far.",
        "source": "T25n1509_061:0489c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿鞞跋致菩薩，入法位，得法忍，能信、能行，故可為說。",
        "translation": "Since the bodhisattva Abhidharma has entered the Dharma stage and attained the tolerance of the Dharma, he's able to believe and practice it, so we can explain it.",
        "source": "T25n1509_061:0489c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有久行六波羅蜜、與善知識相隨，內福德、外因緣力助，雖非阿鞞跋致，能信、能行。",
        "translation": "If someone has long practiced the six perfections, has good friends who accompany them, and is supported by internal merit and external causes and conditions, they'll be able to believe and practice even though they aren't an abhidharma practitioner.",
        "source": "T25n1509_061:0489c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二種人聞是，心清淨，歡喜信受。",
        "translation": "When these two kinds of people hear this, their minds are purified, and they rejoice and believe in it.",
        "source": "T25n1509_061:0489c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如久飢渴者，得好飲食；如大熱得涼、大寒得溫，其心愛樂歡喜。",
        "translation": "Like someone who's long been hungry and thirsty and gets a good meal, or like someone who gets a cool temperature when it's hot or a warm temperature when it's cold, their minds are delighted and rejoice.",
        "source": "T25n1509_061:0489c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二菩薩亦如是，得是無相智慧，作是念：「我因是智慧，能度無量眾生，何況有驚懼、恐怖！",
        "translation": "Similarly, these two bodhisattvas attain this markless wisdom and think, \"Because of this wisdom, I can save measureless sentient beings, so why should there be fear or terror?",
        "source": "T25n1509_061:0489c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐怖從我心中出，是法中諸法相尚空，何況有我而決定取諸法相，聞一切法無相，則生驚懼！」",
        "translation": "Fear arises from my mind when I hear that all dharmas are without marks, since the marks of these dharmas are still empty, let alone when there's a self that's determined to grasp the marks of dharmas.",
        "source": "T25n1509_061:0489c18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是說隨喜義體竟，後當更以種種異門釋上事。",
        "translation": "After explaining the essence of the meaning of following joy, I'll explain the above in various ways.",
        "source": "T25n1509_061:0489c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，「須菩提！",
        "translation": "Furthermore, \"Subhūti!",
        "source": "T25n1509_061:0489c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩應如是思惟：『用是心迴向無上道，是心念念盡、滅、變、離，無有住時。』」",
        "translation": "A bodhisattva should thus contemplate, 'With this mind, he dedicates himself to the unsurpassed way, and this mind is mindfully exhausted, ceased, transformed, and freed from, with no time of abiding.'\"",
        "source": "T25n1509_061:0489c21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸緣、事，所謂過去諸佛及諸善根。",
        "translation": "These are the conditions and things that are referred to as the buddhas and good roots of the past.",
        "source": "T25n1509_061:0489c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛等諸緣事久已滅，隨喜心今滅；既滅無異，是故經中說：「用是心迴向，是心即盡滅。」",
        "translation": "These buddhas and other conditions and things ceased a long time ago, and the mind that takes delight in them now ceases; since they have ceased without difference, the sūtra says, \"With this mind, I'll dedicate myself to this mind, and this mind will cease completely.\"",
        "source": "T25n1509_061:0489c24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等入過去世故，入諸法實相故，無有分別是心、是緣、是事、是善根等。",
        "translation": "As such, they enter past lives and the true characteristics of dharmas, and there's no discrimination of what's mind, what's conditioned, what's conditioned, what's conditioned, or what's a good root.",
        "source": "T25n1509_061:0489c26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是迴向，是為正迴向。",
        "translation": "If someone can thus dedicate their mind, this is right dedication.",
        "source": "T25n1509_061:0489c28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，一時二心不和合，隨喜心時無菩提心；一切心相畢竟空，不可以取相迴向。",
        "translation": "Furthermore, when two minds don't come together at one time, there's no bodhi mind when one follows joyful thoughts, and all mental characteristics are ultimately empty, so it's not possible to take characteristics and dedicate them.",
        "source": "T25n1509_061:0489c28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0490a01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩知般若波羅蜜空，無有定法。",
        "translation": "\"The bodhisattvas know that the perfection of wisdom is empty and has no set dharmas.",
        "source": "T25n1509_061:0490a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如般若波羅蜜，一切法乃至無上道亦如是。",
        "translation": "As the perfection of prajñā, so are all things ... the unsurpassed path.",
        "source": "T25n1509_061:0490a02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時斷法愛、捨著心，於空無諍，是名菩薩正迴向。",
        "translation": "At that point, cutting off craving for things, abandoning attachment, and having no arguments about emptiness is called a bodhisattva correctly dedicating his mind.",
        "source": "T25n1509_061:0490a03_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】爾時，釋提桓因語須菩提：「新發意菩薩聞是事，將無驚懼、怖畏？",
        "translation": "[Sutra] It was then that Śakra Devānām-Indra said to Subhūti, \"When a newly inspired bodhisattva hears this, will he not be frightened or apprehensive?",
        "source": "T25n1509_061:0490a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_061:0490a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何新發意菩薩作諸善根迴向阿耨多羅三藐三菩提？",
        "translation": "\"How do newly aspiring bodhisattvas create good roots that lead back to unsurpassed, correct enlightenment?",
        "source": "T25n1509_061:0490a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復云何隨喜福德迴向阿耨多羅三藐三菩提？」",
        "translation": "\"And how do you rejoice in the merit of returning to unsurpassed, perfect enlightenment?\"",
        "source": "T25n1509_061:0490a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提語釋提桓因：「若新發意菩薩行般若波羅蜜，不受是般若波羅蜜，以無所得故、無相故，乃至檀波羅蜜亦如是。",
        "translation": "Subhūti told Śakra Devānām-Indra, \"If a newly inspired bodhisattva practices the perfection of wisdom, he doesn't accept this perfection of wisdom because it's unobtainable and formless, and even the perfection of giving is likewise.",
        "source": "T25n1509_061:0490a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多信解內空乃至多信解無法有法空，多信解四念處乃至十八不共法。",
        "translation": "They have a lot of faith and understanding of internal emptiness and even more faith and understanding of the emptiness of nonexistence and dharmas, and they have a lot of faith and understanding of the four abodes of mindfulness and even the 18 distinctive qualities.",
        "source": "T25n1509_061:0490a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常與善知識相隨，是善知識為說六波羅蜜義，開示、分別，如是教授，令常不離般若波羅蜜，乃至得入菩薩法位，終不離般若波羅蜜乃至不離檀波羅蜜，不離四念處乃至十八不共法。",
        "translation": "He'll always associate with a good teacher who explains the meaning of the six perfections, reveals and discerns it, and teaches it in this way, so that he never departs from the perfection of wisdom ... until he attains the bodhisattva's Dharma status, never departs from the perfection of wisdom ... never departs from the perfection of giving, never departs from the four abodes of mindfulness ... and even the 18 uncommon dharmas.",
        "source": "T25n1509_061:0490a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦教語魔事，聞種種魔事已，不增不減。",
        "translation": "He also teaches and speaks about demonic acts, and after hearing about various demonic acts, he doesn't increase or decrease them.",
        "source": "T25n1509_061:0490a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0490a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不受一切法故。",
        "translation": "\"It's because the bodhisattva-mahāsattva doesn't accept all dharmas.",
        "source": "T25n1509_061:0490a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩亦常不離諸佛，乃至得菩薩位，於中種善根；以是善根故，生菩薩家，乃至得阿耨多羅三藐三菩提，終不離是善根。",
        "translation": "That bodhisattva also always remains intact from the buddhas up to the point where he attains the bodhisattva position and plants good roots there; because of those good roots, he's born into a bodhisattva family and never leaves those good roots until he attains unsurpassed, correct enlightenment.",
        "source": "T25n1509_061:0490a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，新發意菩薩摩訶薩於過去十方無量無邊阿僧祇世界中諸佛斷生死道、斷諸戲論、道盡、棄重擔、滅聚落刺、斷諸有結、正智、得解脫，及弟子所作功德，於中若剎利大姓、婆羅門大姓、居士大家、四天王天乃至淨居天所種善根——是一切和合稱量，以隨喜心，最上、第一、最妙、無上、無與等者，迴向阿耨多羅三藐三菩提。」",
        "translation": "\"Furthermore, among the good roots that the newly resolved bodhisattva Mahāsattva planted in the boundless and unlimited incalculable worlds in the past when the buddhas ended birth-and-death, cut off conceptual elaborations, ended the path, discarded heavy burdens, ended the thorns in the villages, cut off the bonds of existence, attained liberation, and the merits of his disciples, whether they were from the great family of the warriors, the great family of the brāhmaṇas, the great house of the householders, the four heavenly kings, or even the heaven of the pure abodes - these were all combined and weighed in such a way that, with joyful intentions, they were the greatest, first, most marvelous, unsurpassed, and unparalleled, and so forth, they were headed toward unsurpassed, correct, and complete enlightenment.\"",
        "source": "T25n1509_061:0490a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒菩薩語須菩提：「若新發意菩薩摩訶薩念諸佛及弟子諸善根隨喜功德最上、第一、最妙、無上、無與等者，隨喜已，應迴向阿耨多羅三藐三菩提；云何菩薩不墮想顛倒、心顛倒、見顛倒？」",
        "translation": "It was then that Maitreya addressed Subhūti, \"Suppose a newly resolved bodhisattva Mahāsattva is mindful of the virtues of the buddhas and disciples' good roots that are most excellent, first, most wonderful, unsurpassed, unparalleled, and so forth, and after rejoicing in them, he should dedicate himself to unsurpassed, correct, and complete enlightenment; how will the bodhisattva not fall into mistaken perception, mental mistakenness, or delusion in views?\"",
        "source": "T25n1509_061:0490b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「若菩薩摩訶薩念諸佛及僧，於中不生佛想、不生僧想，無善根想；用是心迴向阿耨多羅三藐三菩提，是心中亦不生心想。",
        "translation": "Subhūti said, \"Suppose a bodhisattva Mahāsattva is mindful of the buddhas and saṃgha and doesn't give rise to conceptions of the buddhas, conceptions of the saṃgha, or conceptions of the absence of good roots in his mind; with this mind, he dedicates himself to unsurpassed, correct enlightenment, and this mind also doesn't give rise to conceptions of mind.",
        "source": "T25n1509_061:0490b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是迴向，想不顛倒、心不顛倒、見不顛倒。",
        "translation": "When a bodhisattva thus dedicates himself, his thoughts aren't mistaken, his mind isn't mistaken, and his views aren't mistaken.",
        "source": "T25n1509_061:0490b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩念諸佛及僧善根，取相；取相已，迴向阿耨多羅三藐三菩提，菩薩如是名為想顛倒、心顛倒、見顛倒。",
        "translation": "If the bodhisattva Mahāsattva is mindful of the good roots of the buddhas and saṃgha and apprehends their characteristics, and after apprehending their characteristics, he dedicates his mind back to unsurpassed, correct, and complete enlightenment, the bodhisattva thus is called having mistaken conceptions, a mistaken mind, and a mistaken view.",
        "source": "T25n1509_061:0490b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩用是心念諸佛及僧諸善根；是心念時，即知盡滅；若盡滅，是法不可得迴向，所用迴向心亦是盡滅相，所迴向處法亦如是相。",
        "translation": "If a bodhisattva Mahāsattva uses this mindfulness of the good roots of the buddhas and saṃgha, when he's mindful of this mind, he knows that it's completely extinguished; if it were completely extinguished, this teaching couldn't be deduced, and the mind that dedicates itself to this dedication also has the characteristic of being completely extinguished, and the teaching to which it dedicates itself also has this characteristic.",
        "source": "T25n1509_061:0490b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是迴向，是名正迴向，非邪迴向。",
        "translation": "If someone thus dedicates their mind, this is called right dedication and not wrong dedication.",
        "source": "T25n1509_061:0490b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩應如是迴向阿耨多羅三藐三菩提。",
        "translation": "The bodhisattvas, mahāsattvas, should thus dedicate themselves to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0490b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，若菩薩摩訶薩，過去諸佛善根及弟子善根，是中凡夫人聞法種善根，若諸天、龍、夜叉、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽聞法種善根，若剎利大姓、婆羅門大姓、居士大家、四天王天乃至阿迦尼吒天聞法種善根，發阿耨多羅三藐三菩提心——是一切福德和合稱量，隨喜功德，最上、第一、最妙、無上、無與等者，迴向阿耨多羅三藐三菩提。",
        "translation": "\"Furthermore, if bodhisattvas, Mahāsattvas, the good roots of past buddhas and disciples, the good roots of ordinary ladies who hear the Dharma, the good roots of gods, dragons, yakṣas, gandharvas, asuras, kaluras, kiṃnaras, and mahoragas who hear the Dharma, and the good roots of bhadras, brāhmaṇas, householders, the four heavenly kings, and even the Akaniṣṭha Heaven who hear the Dharma, then they'll be directed to unsurpassed, superior, first, most marvelous, unsurpassed, and peerless enlightenment.",
        "source": "T25n1509_061:0490b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時菩薩若如是知是諸法盡滅，所迴向處法亦自性空，能如是迴向，是名真迴向阿耨多羅三藐三菩提。",
        "translation": "If a bodhisattva thus knows that these things have ceased, that the things to which he's dedicating his mind are empty in nature, and that he can thus dedicate his mind, this is called truly dedicating himself to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0490b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，若菩薩如是知，無有法能迴向法。",
        "translation": "\"Furthermore, if a bodhisattva thus knows that there's no dharma to which he can dedicate himself, then he can truly dedicate himself to the unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0490b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0490b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法自性空故。",
        "translation": "\"It's because the self-nature of all things is empty.",
        "source": "T25n1509_061:0490b29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是迴向，是名正迴向阿耨多羅三藐三菩提。",
        "translation": "If someone thus dedicates themselves, this is called correctly dedicating themselves to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0490b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩行般若波羅蜜乃至檀波羅蜜，不墮想顛倒、心顛倒、見顛倒。",
        "translation": "Thus, when bodhisattvas and mahāsattvas practice the perfection of wisdom ... the perfection of giving, they don't fall into mistaken perception, mistaken mind, or mistaken views.",
        "source": "T25n1509_061:0490c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0490c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩不著是迴向，亦不見以諸善根迴向菩提心處，是名菩薩摩訶薩無上迴向。」",
        "translation": "A bodhisattva who doesn't get attached to this dedication and doesn't see the place where he dedicates his good roots to the mind of enlightenment is called a bodhisattva-mahāsattva who makes unsurpassed dedications.\"",
        "source": "T25n1509_061:0490c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：「新發意菩薩聞是事，將無怖畏、驚懼者耶？」",
        "translation": "[Commentary] asked, \"When a newly enlightened bodhisattva hears this, will he have no fear or trepidation?\"",
        "source": "T25n1509_061:0490c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此義先已問答，今何以復問？",
        "translation": "This question was answered before, so why is it being asked again?",
        "source": "T25n1509_061:0490c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：上彌勒雖語須菩提：「不應為新學說；可為阿鞞跋致及久行者說，是二種人，聞能信行。」",
        "translation": "Answer: \"Although Maitreya said to Subhūti, 'It shouldn't be taught to new students; it can be taught to those who have long practiced, and these are the two kinds of people who hear it and are able to believe and practice it.'",
        "source": "T25n1509_061:0490c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已說正迴向因緣，而猶說空法，是故帝釋疑言：「是眾中有新發意者，云何更說使不恐怖？」",
        "translation": "Having explained the causes and conditions for right dedication of merit, he still explained the teaching of emptiness; therefore, Tīrṣa doubted it and said, \"Are there any newly awakened minds among the crowd, so why would you explain it again and make them not afraid?\"",
        "source": "T25n1509_061:0490c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提欲成彌勒所說，欲令新發意者應正迴向，故答帝釋：「若新發意菩薩，雖不久行六波羅蜜、不供養諸佛，而以利根、得善知識是二因緣故，堪任正迴向。」",
        "translation": "Wanting to fulfill Maitreya's teaching and to cause newly awakened individuals to correctly dedicate themselves, Subhūti answered Śāriputra, \"Although a newly awakened bodhisattva won't soon practice the six perfections or make offerings to the buddhas, these two causes and conditions make it possible for him to correctly dedicate himself because he has sharp faculties and has gained a good teacher.\"",
        "source": "T25n1509_061:0490c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故語帝釋：「新發意菩薩行般若波羅蜜，不受是般若，以無所得故、畢竟空故。」",
        "translation": "That's why he said to Tiddish, \"A newly resolved bodhisattva who practices the perfection of wisdom doesn't accept this kind of wisdom because it's unobtainable and ultimately empty.\"",
        "source": "T25n1509_061:0490c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜亦不得、亦不著。",
        "translation": "The perfection of prajñā is also unobtainable and unattached.",
        "source": "T25n1509_061:0490c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至檀波羅蜜亦如是。",
        "translation": "*Up to the perfection of giving is likewise.*",
        "source": "T25n1509_061:0490c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「多信解內空」者，常修樂入觀內空三昧故信解。",
        "translation": "\"A person who has a lot of faith and understanding of internal emptiness\" always cultivates the concentration of happily entering and observing internal emptiness, and therefore has faith and understanding.",
        "source": "T25n1509_061:0490c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至十八不共法多信解亦如是。",
        "translation": "It's likewise true for the 18 distinctive qualities that are often understood with faith.",
        "source": "T25n1509_061:0490c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識相，如先說。",
        "translation": "The characteristics of a good teacher are as explained earlier.",
        "source": "T25n1509_061:0490c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中但明：能隨六波羅蜜義說；聞是義已，常不離般若波羅蜜，乃至得入菩薩法位——有久行入菩薩位，有新發意入菩薩位。",
        "translation": "Here, they simply explain that they can follow the explanation of the six perfections, and after hearing their meanings, they'll always never part from the perfections of wisdom, even to the point of entering the bodhisattva state - there's the long-practiced entry into the bodhisattva state, and there's the newly awakened entry into the bodhisattva state.",
        "source": "T25n1509_061:0490c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，是新發意菩薩，善知識為說魔事；聞魔事已，不增不減，以善修習諸法實相故。",
        "translation": "Furthermore, this is a newly aspiring bodhisattva who has a good teacher who explains the work of Māra and, after hearing about it, doesn't increase or decrease it because he's well cultivated the true characteristics of dharmas.",
        "source": "T25n1509_061:0490c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若魔欲破，為欲破空，空則無破；若有增益，如幻如夢，何所增益？",
        "translation": "If a demon wants to refute, it wants to refute emptiness, but emptiness isn't refuted; if there's gain, it's like an illusion or a dream; what gain is there?",
        "source": "T25n1509_061:0490c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說「不增不減」。",
        "translation": "That's why it's called \"neither increase nor decrease.\"",
        "source": "T25n1509_061:0490c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是因緣故，常不離諸佛，常生菩薩家，世世不離善根乃至無上道。",
        "translation": "Because of these causes and conditions, they never part from the buddhas, are always born in a bodhisattva's household, and don't part from their good roots to the unsurpassed path from generation to generation.",
        "source": "T25n1509_061:0490c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是新發意菩薩得如是因緣，與久發意無異。",
        "translation": "This is the cause and condition for a newly resolved bodhisattva to attain such a state of mind, which is no different from that of a long-motivated one.",
        "source": "T25n1509_061:0490c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，隨喜迴向，所謂新發意菩薩於過去十方無量阿僧祇世界中諸佛斷道者，斷生死道，入無餘涅槃。",
        "translation": "Furthermore, according to the joyful dedication of merit, the newly resolved bodhisattva ended the path of the buddhas in the past in measureless incalculable worlds in the ten directions, ended the path of birth-and-death, and entered nirvāṇa without remainder.",
        "source": "T25n1509_061:0491a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸戲論斷故言滅諸戲論。",
        "translation": "It's called the cessation of conceptual proliferation because conceptual proliferation was stopped.",
        "source": "T25n1509_061:0491a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以空空等三昧捨八聖道分故言道盡。",
        "translation": "He said the path was ended because he abandoned the eight noble factors of the path because of the samādhi of emptiness and so forth.",
        "source": "T25n1509_061:0491a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眾能生苦惱故是「重擔」。",
        "translation": "The five aggregates can produce suffering and distress, so they're \"heavy burdens.\"",
        "source": "T25n1509_061:0491a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眾有二種捨：一者、有餘涅槃中，捨五眾因緣——諸煩惱；二者、入無餘涅槃中，捨五眾果。",
        "translation": "There are two kinds of abandonment of the five aggregates: first, abandoning the causes and conditions of the five aggregates - the afflictions - in nirvāṇa with remainder; and second, abandoning the fruits of the five aggregates in nirvāṇa without remainder.",
        "source": "T25n1509_061:0491a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切白衣舍名為聚落。",
        "translation": "All the white-robed lodges are called settlements.",
        "source": "T25n1509_061:0491a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家人依白衣舍活，而白衣舍有五欲刺，為食故來入惡刺果林；以取果故，為刺所刺。",
        "translation": "Monks who live in a white house, which has five thorns of desire, come into a forest of bad thorns for food and are thorned by the thorns for the sake of obtaining fruit.",
        "source": "T25n1509_061:0491a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人著木屐踐刺，刺則摧折；如是諸佛以禪定、智慧屐摧五欲刺，名滅斷下五分結。",
        "translation": "Like a person wearing wooden sandals to trample on a thorn, which breaks, so the buddhas destroy the five thorns of desire with their sandals of meditation and wisdom, which is called ending the lower five bonds.",
        "source": "T25n1509_061:0491a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有分結盡名斷上分五結。",
        "translation": "When the bonds of existence are ended, that's called cutting the upper five bonds.",
        "source": "T25n1509_061:0491a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法實相，金剛三昧相應智慧，斷一切煩惱及習，故言「正智、得解脫」。",
        "translation": "The true characteristics of dharmas and the wisdom associated with vajrasamādhi cut off all afflictions and accumulations, which is why it's called \"correct wisdom and attainment of liberation.\"",
        "source": "T25n1509_061:0491a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等，皆名讚歎。",
        "translation": "Such and the like are called praises.",
        "source": "T25n1509_061:0491a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「過去諸佛及弟子所作功德」者，佛弟子有三種：菩薩、辟支佛、聲聞。",
        "translation": "\"The merits of past buddhas and disciples\" means there are three kinds of disciples of the Buddha: bodhisattvas, pratyekabuddhas, and direct disciples.",
        "source": "T25n1509_061:0491a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「剎利大姓乃至淨居天，是中種善根」者，是四種福田因，是種福德處。",
        "translation": "\"These are the four causes of the field of merit, which is the locus of various virtues.",
        "source": "T25n1509_061:0491a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是福德和合稱量隨喜心，最上、無與等，迴向無上道。",
        "translation": "These are the merits that combine, measure, and delight in, are the highest, peerless, and so forth, and lead back to the unsurpassed way.",
        "source": "T25n1509_061:0491a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迴向心，作正非邪。",
        "translation": "This attitude of dedication of merit creates what's right and not wrong.",
        "source": "T25n1509_061:0491a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0491a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今彌勒問須菩提：「若新發意菩薩念諸佛等功德，迴向無上道，云何不墮顛倒？」",
        "translation": "Now, Maitreya asked Subhūti, \"If a newly resolved bodhisattva is mindful of the buddhas and other attributes and dedicates himself to the unsurpassed path, why doesn't he fall into delusion?\"",
        "source": "T25n1509_061:0491a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提答：「若是菩薩以般若波羅蜜方便力故，於諸佛不生佛想及弟子想，諸善根中不生善根想。」",
        "translation": "Suppository answered, \"Suppose it's because of the power of the method of prajñā-pāramit that a bodhisattva doesn't give rise to conceptions of buddhas and disciples, and among the good roots, he doesn't give rise to conceptions of the good roots.\"",
        "source": "T25n1509_061:0491a22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法從和合生，無有自性，故無有定法名為佛，是故不生佛等想。",
        "translation": "All things that arise from union have no self-nature, so there's no set dharma that's called a Buddha, and therefore no conceptions of buddhas or the like arise.",
        "source": "T25n1509_061:0491a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迴向心，亦不生心想。",
        "translation": "This is the mind of dedication of merit, and it doesn't give rise to conceptions of mind.",
        "source": "T25n1509_061:0491a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩不墮顛倒。",
        "translation": "Therefore, the bodhisattva doesn't fall into delusion.",
        "source": "T25n1509_061:0491a27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與上相違，即墮顛倒。",
        "translation": "To contradict the above is to fall into delusion.",
        "source": "T25n1509_061:0491a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩以是心念諸佛等及諸善根，是心盡時即知盡，盡心不得迴向。",
        "translation": "Furthermore, when a bodhisattva thus mindfully thinks of the buddhas and other good roots, he knows that his mind is exhausted when it's exhausted, and he can't dedicate his mind back to them.",
        "source": "T25n1509_061:0491a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0491b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "變失滅壞故。",
        "translation": "It's because it changes and disappears.",
        "source": "T25n1509_061:0491b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心亦入無常門，到法性中；法性中無有分別是心、是非心，是佛、是弟子，是善根、是無上道。",
        "translation": "This mind also enters the gate of impermanence and arrives in the Dharma nature, and in the Dharma nature there's no discrimination between right mind and wrong mind, which are buddhas and disciples, good roots, and the unsurpassed way.",
        "source": "T25n1509_061:0491b01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迴向心、迴向處，盡相亦如是。",
        "translation": "The mind that dedicates itself to a point of dedication and the place of dedication are likewise in their final aspect.",
        "source": "T25n1509_061:0491b03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初心是憶念過去諸佛等隨喜功德，後心是迴向心。",
        "translation": "The first mind is remembering the merits of rejoicing in past buddhas, and the second mind is the mind that dedicates itself back to them.",
        "source": "T25n1509_061:0491b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是迴向，是名「正迴向」。",
        "translation": "If someone thus dedicates their mind, this is called \"correctly dedicating it.\"",
        "source": "T25n1509_061:0491b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：初心、後心是生滅相，可無常；所迴向處法是無上道，在未來世中，云何言盡滅？",
        "translation": "Q: The first mind and the second mind are signs of arising and ceasing, which can be impermanent, and the states to which they're dedicating themselves are the unsurpassed path and will continue to be in the future, so how can they be said to be completely extinguished?",
        "source": "T25n1509_061:0491b06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：汝不聞我先答：「入無常門，到法性中。」",
        "translation": "He answered, \"Haven't you heard that I first answered, 'Enter the gate of impermanence and enter the nature of dharmas.'\"",
        "source": "T25n1509_061:0491b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中不說「盡是無常」，但說「諸法實相是盡」。",
        "translation": "Here, it's not said, \"The end is impermanent,\" but rather, \"The true characteristics of dharmas are ended.\"",
        "source": "T25n1509_061:0491b09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先亦說：「阿耨多羅三藐三菩提，出三世、過三界，無受相。」",
        "translation": "Earlier, it also said, \"Anuttarasamyak-saṃbodhi, which transcends the three worlds and the three realms, has no marks of sensation.\"",
        "source": "T25n1509_061:0491b10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能如是迴向者，是為正迴向。",
        "translation": "Someone who can thus dedicate themselves is correctly dedicating themselves.",
        "source": "T25n1509_061:0491b11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，非正非邪迴向，所謂菩薩於過去諸佛善根等，乃至無上、無與等，迴向無上道。",
        "translation": "Furthermore, this is not right or wrong dedication, which is when a bodhisattva dedicates himself to the unsurpassed path based on the good roots of past buddhas and so forth, up to the unsurpassed and unparalleled.",
        "source": "T25n1509_061:0491b12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩知是事皆盡滅，知迴向處法亦自性空，能知滅、知空，是「真迴向」。",
        "translation": "If a bodhisattva knows that these things all cease, knows that the thing to which he's dedicating himself is also empty in nature, and can know cessation and emptiness, this is \"true dedication of merit.\"",
        "source": "T25n1509_061:0491b14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過去法無常，無常故不可迴向自性空法中；若過去法空，空故不可迴向自性空法中。",
        "translation": "If things in the past were impermanent, they couldn't be directed back to the self-nature of emptiness because they were impermanent, and if things in the past were empty, they couldn't be directed back to the self-nature of emptiness because they were empty.",
        "source": "T25n1509_061:0491b15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用如是智慧迴向，是名「正迴向」。",
        "translation": "This is called \"correct dedication of merit\" when one dedicates oneself with this kind of wisdom.",
        "source": "T25n1509_061:0491b17_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，若菩薩知一切法因緣生故無自力常住，自法相不動，況能有所作？",
        "translation": "Furthermore, if a bodhisattva knows that all things that arise from causes and conditions have no self-power and are permanent, and the characteristics of their own dharmas don't move, how could they do anything?",
        "source": "T25n1509_061:0491b18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所作故，一切法中無有法能迴向法，是名「正迴向」。",
        "translation": "Because there's nothing to do, there's nothing in all dharmas that can be directed toward dharmas, and this is called \"correctly directing.\"",
        "source": "T25n1509_061:0491b20_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩雖行般若波羅蜜等諸善法，亦不墮顛倒，一切法不著故。",
        "translation": "Thus, even though a bodhisattva practices such good qualities as prajñā-pāramitā, he doesn't fall into delusion and doesn't cling to all dharmas.",
        "source": "T25n1509_061:0491b21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「復次，若菩薩摩訶薩知所起福德離五眾、十二入、十八界，亦知般若波羅蜜是離相，乃至檀波羅蜜是離相，內空乃至無法有法空是離相，四念處乃至十八不共法是離相。",
        "translation": "[Sutra] \"Furthermore, if a bodhisattva Mahāsattva knows that the merit that arises is free of the five aggregates, 12 sense fields, and 18 elements, he also knows that prajñāpāramit is free of marks, that the perfection of giving is free of marks, that internal emptiness and even the emptiness of nonexistence are free of marks, and that the four abodes of mindfulness and even the 18 distinctive qualities are free of marks.",
        "source": "T25n1509_061:0491b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩隨喜心起福德，迴向阿耨多羅三藐三菩提。",
        "translation": "Thus, the bodhisattva Mahāsattva gives rise to merit with joyful thoughts, and he dedicates himself to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0491b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，若菩薩摩訶薩隨喜福德，知隨喜福德自性離；亦知諸佛離佛性；諸善根亦離善根性；菩提心，菩提心性亦離；迴向，迴向性亦離；菩薩，菩薩性亦離；般若波羅蜜，般若波羅蜜性亦離；禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜；檀波羅蜜，檀波羅蜜性亦離；乃至十八不共法，十八不共法性亦離。",
        "translation": "\"Furthermore, if the bodhisattva Mahāsattva rejoices in merit, he knows that the rejoicing in merit is free of its own nature; he also knows that the buddhas are free of the buddha nature; the good roots are free of the good root nature; the mind of enlightenment is free of the nature of the mind of enlightenment; the dedication of merit is free of its nature; the bodhisattva is free of its nature; the prajñāpāramitā is free of its nature; the meditation prajñāpāramitā, vīrya prajñāpāramitā, kṣatriya prajñāramitā, and śīla prajñā; the sandalwood prajñā is free of its nature; and even the eighteen uncommon dharmas are free of their nature; and the eighteen uncommon dharmas are free of their nature.",
        "source": "T25n1509_061:0491b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩應如是行離相般若波羅蜜，是名菩薩摩訶薩般若波羅蜜中生隨喜福德。",
        "translation": "The bodhisattva Mahāsattva should thus practice the perfection of freedom from characteristics, which is called the merit of delighting in the perfection of wisdom of the bodhisattva Mahāsattva.",
        "source": "T25n1509_061:0491c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩，諸過去滅度佛諸善根，若欲迴向，應如是迴向，作是念：『如諸佛滅度相，諸善根相亦如是，滅度法相亦如是；我用心迴向，是心相亦如是。』",
        "translation": "\"Furthermore, if a bodhisattva Mahāsattva wants to redirect the good roots of the buddhas who were extinguished in the past, he should thus redirect them and think, 'Thus are the marks of the buddhas' extinction, the marks of the good roots, and the marks of the Dharma of extinction; I'll redirect my mind, and the marks of my mind will be thus.'",
        "source": "T25n1509_061:0491c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是迴向，當知是迴向阿耨多羅三藐三菩提，不墮想顛倒、心顛倒、見顛倒。",
        "translation": "If someone can thus dedicate their mind, they should know that they're dedicating it to unsurpassed, correct, and complete enlightenment, and they won't fall into mistaken perception, mistaken mind, or mistaken views.",
        "source": "T25n1509_061:0491c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩行般若波羅蜜時，取諸佛、善根相迴向阿耨多羅三藐三菩提，是不名為迴向。",
        "translation": "If bodhisattvas, mahāsattvas, and practitioners of prajñāpāramitā take the characteristics of buddhas and good roots and dedicate them to unsurpassed, this is not called dedicating them back to the perfect enlightenment.",
        "source": "T25n1509_061:0491c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0491c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸過去佛及善根非相緣、非無相緣。",
        "translation": "\"The past buddhas and good roots don't have formative or formless conditions.",
        "source": "T25n1509_061:0491c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩作如是取相，是不名善根迴向阿耨多羅三藐三菩提。",
        "translation": "If a bodhisattva-mahāsattva thus takes on characteristics, this isn't called a good root converting to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0491c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩摩訶薩墮想顛倒、心顛倒、見顛倒。",
        "translation": "Thus, the bodhisattva Mahāsattva falls into mistaken perception, mental confusion, and mistaken views.",
        "source": "T25n1509_061:0491c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩摩訶薩，諸佛及諸善根及諸心不取相，是名以諸善根迴向阿耨多羅三藐三菩提。",
        "translation": "If bodhisattvas, Mahāsattvas, the buddhas, the good roots, and the mind don't grasp characteristics, this is called dedicating the good roots to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0491c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩不墮想顛倒、心顛倒、見顛倒。」",
        "translation": "This is a bodhisattva, a mahāsattva, who doesn't fall into mistaken perception, mental mistakenness, or mistaken views.\"",
        "source": "T25n1509_061:0491c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，彌勒菩薩問須菩提：「云何菩薩摩訶薩於諸善根不取相，能迴向阿耨多羅三藐三菩提？」",
        "translation": "It was then that Maitreya asked Subhūti, \"How can a bodhisattva-mahāsattva who doesn't grasp the marks of his good roots dedicate himself to unsurpassed, correct enlightenment?\"",
        "source": "T25n1509_061:0491c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提言：「以是事故，當知菩薩摩訶薩所學般若波羅蜜中，應有般若波羅蜜方便力。",
        "translation": "Subhūti said, \"Because of this, you should know that among the prajñāpāramitā that the bodhisattvas and mahāsattvas study, there should be the power of the prajñāpāramitā of skillful means.",
        "source": "T25n1509_061:0491c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是福德離般若波羅蜜，不得迴向阿耨多羅三藐三菩提。",
        "translation": "If this kind of merit departs from the perfection of prajñā, it's not possible to dedicate oneself to unsurpassed, correct enlightenment.",
        "source": "T25n1509_061:0491c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0491c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜中，諸佛不可得，諸善根不可得，迴向阿耨多羅三藐三菩提心亦不可得。",
        "translation": "In the perfection of prajñā, the buddhas are unobtainable, the good roots are unobtainable, and the mind of dedication to unsurpassed, correct enlightenment is also unobtainable.",
        "source": "T25n1509_061:0491c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是中，菩薩摩訶薩行般若波羅蜜時，應如是思惟：『諸過去佛及弟子身皆滅，諸善根亦滅；我今取相分別諸佛、諸善根及諸心，如是取相迴向阿耨多羅三藐三菩提，諸佛所不許。",
        "translation": "Among other things, when practicing the perfection of wisdom, a bodhisattva-mahāsattva should thus think, 'The bodies of the buddhas and disciples of the past all ceased, and so did the good roots; now, I'm discriminating buddhas, good roots, and minds by focusing on their characteristics, and thus focusing on their characteristics and dedicating them to unsurpassed, correct, and complete enlightenment, which won't be permitted by the buddhas.'",
        "source": "T25n1509_061:0492a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0492a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取相、有所得故，所謂於過去諸佛取相分別。』",
        "translation": "It's because they grasp characteristics and have attained something, which is called grasping characteristics and discerning the buddhas of the past.'",
        "source": "T25n1509_061:0492a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩摩訶薩欲以諸善根迴向阿耨多羅三藐三菩提，不應有得、不應取相。",
        "translation": "Therefore, when a bodhisattva wishes to dedicate his mind to unsurpassed, correct enlightenment with good roots, he shouldn't have attained or grasped at appearances.",
        "source": "T25n1509_061:0492a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迴向，若有得、取相迴向，諸佛不說有大利益。",
        "translation": "If they thus dedicate themselves, the buddhas won't say that there's great benefit if they dedicate themselves with attainment or grasping of appearances.",
        "source": "T25n1509_061:0492a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0492a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迴向雜毒故。",
        "translation": "This is because it leads back to mixed poisons.",
        "source": "T25n1509_061:0492a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如美食雜毒，雖有好色、好香，為人所貪而雜毒；愚癡之人食之歡喜，貪其好色香美可口；飯欲消時，受若死、若死等苦。",
        "translation": "It's like the poison of mixed delicacies that have good color and good smells but are mixed because people crave them; a foolish person rejoices in their food and craves its good color, delicious smells, and tastes, and when their desire for food disappears, they experience suffering like death or dying.",
        "source": "T25n1509_061:0492a11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若善男子、善女人不諦受、不諦取相、不諦誦讀、不解中義，如是教他言：『汝善男子！",
        "translation": "\"If good sons and good women don't truly experience, don't truly grasp characteristics, don't truly recite, and don't understand their meaning, they thus teach others, saying, 'You good sons!",
        "source": "T25n1509_061:0492a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去、未來、現在十方諸佛，從初發意已來至得阿耨多羅三藐三菩提，入無餘涅槃乃至法盡，於其中間，行般若波羅蜜時作諸善根；行禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜時作諸善根；修四禪、四無量心、四無色定、四念處乃至八聖道分、佛十力乃至修十八不共法時作諸善根；淨佛世界、成就眾生作諸善根；及諸佛戒眾、定眾、慧眾、解脫眾、解脫知見眾、一切種智、無錯謬法、常捨行；及諸弟子是中所種善根，及諸佛所記當作辟支佛，是中諸天、龍、阿修羅、迦樓羅、緊那羅、摩睺羅伽等所種善根——是諸福德稱量和合隨喜，迴向阿耨多羅三藐三菩提。』",
        "translation": "過去、未來、現在十方諸佛，從初發意已來至得阿耨多羅三藐三菩提，入無餘涅槃乃至法盡，於其中間，行般若波羅蜜時作諸善根；行禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜時作諸善根；修四禪、四無量心、四無色定、四念處乃至八聖道分、佛十力乃至修十八不共法時作諸善根；淨佛世界、成就眾生作諸善根；及諸佛戒眾、定眾、慧眾、解脫眾、解脫知見眾、一切種智、無錯謬法、常捨行；及諸弟子是中所種善根，及諸佛所記當作辟支佛，是中諸天、龍、阿修羅、迦樓羅、緊那羅、摩睺羅伽等所種善根——是諸福德稱量和合隨喜，迴向阿耨多羅三藐三菩提。』",
        "source": "T25n1509_061:0492a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迴向以取相得法故，如雜毒食。",
        "translation": "This dedication of merit is like eating mixed poison because it's based on grasping the features to obtain the teaching.",
        "source": "T25n1509_061:0492a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得法者，終無正迴向。",
        "translation": "When someone attains the Dharma, they'll never properly dedicate themselves.",
        "source": "T25n1509_061:0492a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0492b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是得法雜毒，有相、有動、有戲論。",
        "translation": "This is the mixed poison of attaining the Dharma, which has characteristics, movement, and conceptual elaborations.",
        "source": "T25n1509_061:0492b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是迴向，則為謗佛，不隨佛教、不隨法說。",
        "translation": "If someone thus dedicates their mind, they're denigrating the Buddha and not following Buddhism or teaching the Dharma.",
        "source": "T25n1509_061:0492b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人求佛道，應如是學過去、未來、現在諸佛從初發意乃至法盡，及弟子行般若波羅蜜時作善根，乃至修一切種智，如上說。",
        "translation": "Good sons and good women seeking the Buddha's path should thus train past, future, and present buddhas from the first arousal of their intention until the Dharma is ended, and disciples who cultivate good roots when practicing prajñāparamit, up to cultivating all kinds of cognition, as explained above.",
        "source": "T25n1509_061:0492b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「云何諸善根迴向阿耨多羅三藐三菩提正迴向？",
        "translation": "\"How are these good roots directed toward the correct dedication of the unsurpassed, correct enlightenment?",
        "source": "T25n1509_061:0492b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有求佛道善男子、善女人行般若波羅蜜，不欲謗諸佛者，諸福德應如是迴向：『如諸佛所知無上智慧，是諸善根相、是諸善根性，我亦如是隨喜；如諸佛所知，我亦如是迴向阿耨多羅三藐三菩提。』",
        "translation": "Good men and good women who pursue the buddha path and practice the perfection of wisdom and don't wish to denigrate the buddhas should thus dedicate their merits: 'As the buddhas know unsurpassed wisdom, these are the characteristics of good roots, these are the natures of good roots, and I thus delight in them; as the buddhas know, I thus dedicate myself to unsurpassed, correct, and complete enlightenment.'",
        "source": "T25n1509_061:0492b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求菩薩道善男子、善女人應如是迴向阿耨多羅三藐三菩提。",
        "translation": "Good men and good women seeking the bodhisattva path should thus dedicate themselves to unsurpassed, correct enlightenment.",
        "source": "T25n1509_061:0492b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是迴向，則為不謗佛，如佛所教、如佛法說。",
        "translation": "If someone thus dedicates themselves, they don't denigrate the Buddha and do as he teaches and speaks the Buddha's teaching.",
        "source": "T25n1509_061:0492b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩迴向，則無雜毒。」",
        "translation": "When this is the bodhisattva-mahāsattva's dedication of merit, then there's no mixed poison.\"",
        "source": "T25n1509_061:0492b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：所起福德離五眾者，先但說過去事，今說自起隨喜福德。",
        "translation": "[Commentary] The explanation says, \"The merit that arises apart from the five aggregates was first described as something from the past, but now it's described as the merit of self-rejoicing.",
        "source": "T25n1509_061:0492b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知是福德中無五眾、十二入、十八界，雖行般若波羅蜜等諸法，亦知空離相，如是福德名正迴向。",
        "translation": "If someone knows that this merit doesn't include the five aggregates, 12 sense fields, or 18 elements, and even though they practice such things as prajñā-pāramit, they'll know that they're empty and free of characteristics, and such merit is called right dedication.",
        "source": "T25n1509_061:0492b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，若菩薩知隨喜福德中隨喜福德性自離；諸佛及善根，并諸起阿耨多羅三藐三菩提心、迴向心、菩薩般若波羅蜜等諸行法，知自性空，是名正迴向。",
        "translation": "Furthermore, if a bodhisattva knows that the nature of the merit of joyful service is inherently free from the merit of joyful service, and that the buddhas and good roots and the practices that give rise to the mind of unsurpassed, correct enlightenment, the mind of dedication, and the bodhisattva's prajñāparamitcy are empty of their own nature, this is called right dedication of merit.",
        "source": "T25n1509_061:0492b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨喜福德者，總說一切福德相；善根、隨喜起福德，是別相說。",
        "translation": "Blessedness that accords with joy is a general explanation of all the characteristics of merit, while good roots and merit that accrues from joy are separate explanations.",
        "source": "T25n1509_061:0492b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩自緣所求阿耨多羅三藐三菩提，是名阿耨多羅三藐三菩提心。",
        "translation": "The bodhisattva's self-conditional pursuit of unsurpassed, correct enlightenment is called unsurpassed, correct enlightenment.",
        "source": "T25n1509_061:0492b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩隨喜心功德果，但求無上道，是名迴向心。",
        "translation": "This is called the mind of dedication of merit, which is the result of a bodhisattva's mind that takes delight in but seeks the unsurpassed path.",
        "source": "T25n1509_061:0492b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者五眾中，假名字為菩薩，般若波羅蜜等諸法，如先義說。",
        "translation": "Among the five groups of practitioners, they are nominally called bodhisattvas, and the teachings of prajñāpāramitā and so forth are explained as before.",
        "source": "T25n1509_061:0492b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先說福德中離五眾；今說福德，福德自相空。",
        "translation": "In the first teaching, merit was separated from the five groups, but now we're talking about merit, which is empty of its own characteristics.",
        "source": "T25n1509_061:0492b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩念過去佛因緣生福德，應如是迴向：「如過去諸佛入無餘涅槃，無相、無戲論，性常寂滅，是福德及迴向心亦如是。」",
        "translation": "Furthermore, when a bodhisattva is mindful of the merit that arises from the causes and conditions of past buddhas, he should thus dedicate his mind back to them, \"Just as the buddhas of the past entered nirvāṇa without remainder, had no characteristics, were without conceptual elaborations, and were eternally tranquil in nature, so too are these merits and the mind that dedicates itself back to them.\"",
        "source": "T25n1509_061:0492b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迴向，是名正迴向，不墮顛倒。",
        "translation": "Such a dedication of merit is called a correct dedication of merit that doesn't fall into delusion.",
        "source": "T25n1509_061:0492c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，若菩薩於諸過去佛功德取相、分別迴向，是不名迴向。",
        "translation": "Furthermore, if a bodhisattva were to take the attributes of past buddhas and discriminate and dedicate them, this wouldn't be called dedication of merit.",
        "source": "T25n1509_061:0492c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0492c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有相是一邊，無相是一邊，離是二邊行中道，是諸佛實相。",
        "translation": "To have form on one side and formlessness on the other, and to practice the middle way free of these two extremes is the true character of the buddhas.",
        "source": "T25n1509_061:0492c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說：「諸過去佛不墮相數中，不墮無相數中。」",
        "translation": "That's why they say, \"Past buddhas don't fall into the number of marks and don't fall into the number of marklessness.\"",
        "source": "T25n1509_061:0492c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如是取相數，是不名迴向，則墮顛倒。",
        "translation": "If someone thus takes the number of characteristics, this isn't called dedication of merit, and they fall into delusion.",
        "source": "T25n1509_061:0492c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與上相違，是為不墮顛倒。",
        "translation": "Contrary to the above, this is not falling into delusion.",
        "source": "T25n1509_061:0492c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是事難故，彌勒重問，所謂一切法不取相而復能迴向。",
        "translation": "Because of this difficulty, Maitreya repeatedly asked, \"Are all things capable of dedication of merit without grasping to marks?",
        "source": "T25n1509_061:0492c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提是中不得決定答處，是故語彌勒：「以是事故，菩薩學般若波羅蜜，求方便力。」",
        "translation": "Suppository couldn't decide where to answer this, so he said to Maitreya, \"Such is the reason why bodhisattvas train in the perfection of wisdom and seek the power of skillful means.\"",
        "source": "T25n1509_061:0492c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是福德離般若波羅蜜，不得迴向者，一切法中，一法實而不誑，所謂阿耨多羅三藐三菩提；隨是阿耨多羅三藐三菩提，行不誑道，爾乃可得。",
        "translation": "When this merit departs from the perfection of wisdom and doesn't allow for dedication of merit, there's one thing in all things that's true and not deceiving, which is called the unsurpassed, corrected, and undeceiving path.",
        "source": "T25n1509_061:0492c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不誑道者，即是般若波羅蜜。",
        "translation": "The one who doesn't deceive the way is prajñā-pāramitā.",
        "source": "T25n1509_061:0492c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故說：「離般若波羅蜜，是福德不可得迴向。」",
        "translation": "That's why it's said, \"Apart from the perfection of prajñā, this merit can't be transferred back.\"",
        "source": "T25n1509_061:0492c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0492c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是般若波羅蜜畢竟空，無有分別；福德若離般若波羅蜜、若不離般若波羅蜜，不可得迴向。",
        "translation": "\"This perfection of wisdom is empty and undiscriminated, and it's impossible to transfer merit if it's free of the perfection of wisdom or if it's not free of the perfection of wisdom.",
        "source": "T25n1509_061:0492c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩應作是念：「諸過去佛及弟子身并諸善根、福德皆滅；我今取相分別，所謂是諸佛、是弟子、是善根、是隨喜福德，取相迴向，我為不是！",
        "translation": "Bodhisattvas should think, \"The bodies of past buddhas and disciples, as well as their good roots and merit, have all ceased; now, I've taken on the characteristic and discriminated, saying that these are buddhas, disciples, good roots, and merit that brings joy, and I've taken on the characteristic and directed it back, but I'm not!",
        "source": "T25n1509_061:0492c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0492c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與諸法實相異故。",
        "translation": "It's because it's different from the true characteristics of all dharmas.",
        "source": "T25n1509_061:0492c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受果報已，久久當盡故；不疾至佛道，有所得故。",
        "translation": "After receiving the results, they'll end them in the long run; they won't quickly reach the Buddha Way because they've attained something.",
        "source": "T25n1509_061:0492c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去諸佛憶想分別，即是大失！",
        "translation": "To remember, conceive, and discriminate among the buddhas of the past is a great mistake!",
        "source": "T25n1509_061:0492c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂過去佛空無，而我憶想分別！」",
        "translation": "The so-called buddhas of the past are empty and nonexistent, but I remember and conceptualize them!\"",
        "source": "T25n1509_061:0492c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「譬如雜毒食」：「食」是隨喜福德，「毒」是取相故愛見等諸煩惱生。",
        "translation": "\"Like food mixed with poison\": \"food\" is merit that's enjoyed, and \"poison\" is the attachment to characteristics that gives rise to such afflictions as craving and views.",
        "source": "T25n1509_061:0492c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「好色」者，福德因緣，作人王、轉輪王、天王，得福樂。",
        "translation": "Those who \"like form\" have merit as a cause and condition for becoming a human king, wheel-turning king, or king of the gods, which brings happiness and fortune.",
        "source": "T25n1509_061:0492c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「好香」者，得好名譽、富貴、勢力。",
        "translation": "Someone who \"likes fragrance\" will attain good reputation, wealth, and power.",
        "source": "T25n1509_061:0492c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫無智之人，所共貪愛。",
        "translation": "Ordinary, unwise people commonly crave them.",
        "source": "T25n1509_061:0492c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「愚癡人」者，是新發意取相著心菩薩。",
        "translation": "A \"foolish man\" is a bodhisattva who has newly arisen the mind to attach to characteristics.",
        "source": "T25n1509_061:0493a01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「食之歡喜」者，富樂福德因緣故，於天、人中受此富樂。",
        "translation": "The person who's \"delighted by food\" is a bodhisattva who receives riches and happiness among gods and humans because of the causes and conditions of riches and fortune.",
        "source": "T25n1509_061:0493a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「飯欲消時，受若死、若死等苦」者，是富樂若無常、破壞、離時，憂愁遂死，若次死受諸苦惱。",
        "translation": "\"When the desire for food disappears, I experience suffering like death and dying\" is a bodhisattva who, when affluence and happiness are impermanent, destroyed, and removed, becomes sad and dies, and who experiences suffering and distress when he dies next.",
        "source": "T25n1509_061:0493a03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，「若死、若死等」者，自失命根名「死」，失所著物名「死等」。",
        "translation": "Furthermore, \"whether death or death and so forth\" means that losing one's life root is called \"death,\" and being displaced and attached to things is called \"death and so forth.\"",
        "source": "T25n1509_061:0493a05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，「若死、若死等」者，苦惱多故，失智慧命，名「死」；妨行善道，名「死等」。",
        "translation": "Furthermore, \"if I die and such things as die,\" it's called \"death\" when I lose my life of wisdom because of the many afflictions, and it's called \"such things as die\" when I'm prevented from practicing the good path.",
        "source": "T25n1509_061:0493a07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經中須菩提自說：是無智人「不審諦受」，不取其義，但著語言。",
        "translation": "In this sūtra, Subhūti explains for himself that this is a person without wisdom who \"doesn't examine the senses,\" doesn't grasp their meaning, and only attaches to words.",
        "source": "T25n1509_061:0493a08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不諦取相」者，不如法分別。",
        "translation": "Someone who \"doesn't grasp characteristics with care\" doesn't discern things according to the teaching.",
        "source": "T25n1509_061:0493a10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不諦讀誦」者，忘失句逗，若自失、若受不具足。",
        "translation": "Someone who \"doesn't recite with care\" forgets the phrases and distractions, and if they lose their own or receive them, they don't have them fully.",
        "source": "T25n1509_061:0493a10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不解義」者，不得經意。",
        "translation": "Someone who \"doesn't understand the meaning\" doesn't grasp the meaning of the sūtras.",
        "source": "T25n1509_061:0493a11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是少智師教化弟子：「汝善男子！",
        "translation": "Thus, Shaojian's teacher instructed his disciples, \"You good sons!",
        "source": "T25n1509_061:0493a12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去、未來、現在十方諸佛，從初發意乃至如是迴向。」",
        "translation": "The buddhas of the past, future, and present in ten directions, from the time they first arouse the intention until they thus dedicate themselves.\"",
        "source": "T25n1509_061:0493a13_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則為謗佛，不隨佛教，不隨法說。",
        "translation": "That's denigrating the Buddha, not following Buddhism, and not following the teaching of the Dharma.",
        "source": "T25n1509_061:0493a14_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與此相違，名為「正迴向」。",
        "translation": "To contradict this is called \"correctly dedicating oneself back to the Buddha.\"",
        "source": "T25n1509_061:0493a15_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，正迴向，菩薩應作是念：「如十方三世諸佛所知，用無上智慧知諸善根相。」",
        "translation": "Furthermore, when correctly dedicating himself, the bodhisattva should think, \"As the buddhas of the ten directions and three times know, he uses unsurpassed wisdom to know the characteristics of good roots.\"",
        "source": "T25n1509_061:0493a15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智人中，佛第一勝；佛所知諸善根，必是實相；如佛所知，我亦用如是善根相迴向。",
        "translation": "Among all people of wisdom, the Buddha is the most excellent, and the good roots known by the Buddha must be their true characteristics; just as the Buddha knows them, I'll also dedicate myself with the characteristics of such good roots.",
        "source": "T25n1509_061:0493a17_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如射地，無不著時；若射餘物，或著、或不著。",
        "translation": "It's like shooting at the ground, and there's no time when it doesn't touch it; if you shoot at something else, it might or might not touch it.",
        "source": "T25n1509_061:0493a19_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如諸佛所知隨喜，如射地無不著；若用餘道隨喜，如射餘物，或著、或不著。",
        "translation": "As the buddhas know, they rejoice when they shoot at the ground without fail; if they rejoice when they shoot at something else with the rest of the way, they may or may not be attached.",
        "source": "T25n1509_061:0493a20_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迴向，是為不謗佛。",
        "translation": "Such a dedication of merit is not denigrating the Buddha.",
        "source": "T25n1509_061:0493a22_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎◎【經】「復次，求佛道善男子、善女人行般若波羅蜜時，諸善根應如是迴向：如色不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、不名未來、不名現在。",
        "translation": "Furthermore, when good men and good women who seek the Buddha's path practice prajñāpāramit, they should thus direct their good roots back to such form as that which is not bound to the desire realm, not bound to the form realm, and not bound to the formless realm, and that which is not bound to the Dharma is not called past, not called future, and not called present.",
        "source": "T25n1509_061:0493a23_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如受、想、行、識不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。",
        "translation": "Just as feeling, perception, volition, and consciousness aren't bound to the desire realm, the form realm, or the formless realm, they aren't called past, future, or present if they aren't bound to the Dharma.",
        "source": "T25n1509_061:0493a27_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二入、十八界亦如是。",
        "translation": "The twelve sense-fields and eighteen elements are likewise.",
        "source": "T25n1509_061:0493a29_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如般若波羅蜜不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。",
        "translation": "Thus, the perfection of wisdom isn't bound to the desire realm, the form realm, or the formless realm, and it's not called the past, future, or present when it's not bound to the Dharma.",
        "source": "T25n1509_061:0493a29_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "禪波羅蜜乃至檀波羅蜜亦如是，內空乃至無法有法空亦如是。",
        "translation": "So it is with the perfection of meditation and even the perfection of sandalwood, and so it is with internal emptiness and even the emptiness of nonexistence.",
        "source": "T25n1509_061:0493b02_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如四念處不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。",
        "translation": "Just as the four abodes of mindfulness aren't bound to the desire realm, the form realm, or the formless realm, they aren't called past, future, or present if they aren't bound to things.",
        "source": "T25n1509_061:0493b04_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至八聖道分亦如是，佛十力乃至十八不共法亦如是。",
        "translation": "*Up to the eightfold noble path is likewise, as are the Buddha's ten powers and even his 18 distinctive qualities.",
        "source": "T25n1509_061:0493b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如如、法性、法相、法住、法位、實際、不可思議性，戒、定、慧、解脫、解脫知見眾、一切種智、無錯謬法、常捨行，不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。",
        "translation": "Thusness, Dharma nature, dharma characteristics, dharma abiding, dharma status, reality, inconceivability, morality, meditation, wisdom, liberation, awareness of the multitude of liberation, omniscience, the lack of mistaken dharmas, and the practice of constant equanimity are not bound to the desire realm, the form realm, or the formless realm, and when they aren't bound to dharmas, they aren't called past, future, or present.",
        "source": "T25n1509_061:0493b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迴向、所迴向處、行者不繫皆亦如是。",
        "translation": "This is likewise for those who dedicate themselves to, those who dedicate themselves to, and those whose practice isn't bound.",
        "source": "T25n1509_061:0493b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸佛亦不繫，諸善根亦不繫，是諸聲聞、辟支佛善根亦不繫；不繫法者，不名過去、未來、現在。",
        "translation": "Thus, the buddhas are not bound, nor are their good roots bound, nor are the śrāvakas' and pratyekbuddhas' good roots bound, and they aren't called past, future, or present when they aren't bound to the Dharma.",
        "source": "T25n1509_061:0493b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若菩薩摩訶薩行般若波羅蜜時，如是知色不繫三界；不繫法者，不名過去、未來、現在。",
        "translation": "\"If bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom thus know that form isn't bound to the three realms, and they don't bind the Dharma, it's not called the past, future, or present.",
        "source": "T25n1509_061:0493b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法不過去、未來、現在者，不可以取相有所得法迴向阿耨多羅三藐三菩提。",
        "translation": "If a dharma isn't past, future, or present, it's not possible to grasp the characteristics of a thing that's attained and return to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0493b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0493b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是色無生。",
        "translation": "'This is form that's unarisen.'",
        "source": "T25n1509_061:0493b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法無生則無法，無法中不可迴向。",
        "translation": "If things are unarisen, then there's nothing, and within that nothing, there's no turning back.",
        "source": "T25n1509_061:0493b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受、想、行、識亦如是。",
        "translation": "*Feelings, perceptions, volitions, and consciousness are likewise.*",
        "source": "T25n1509_061:0493b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「檀波羅蜜乃至般若波羅蜜，四念處乃至無錯謬法、常捨行，不繫三界。",
        "translation": "\"The perfection of giving and the perfection of wisdom, the four abodes of mindfulness, the absence of mistaken dharmas, and the practice of constant equanimity are not bound to the three realms.",
        "source": "T25n1509_061:0493b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不繫法者，亦非過去、未來、現在。",
        "translation": "Whatever dharmas they aren't bound to, they weren't in the past, future, or present.",
        "source": "T25n1509_061:0493b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非過去、未來、現在法者，不可以取相有所得法迴向阿耨多羅三藐三菩提。",
        "translation": "If it's not a past, future, or present dharma, then it's not possible to grasp characteristics and obtain dharmas and dedicate them to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0493b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0493b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法無生。",
        "translation": "\"This is the nonarising of dharmas.",
        "source": "T25n1509_061:0493b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法無生則無法，無法中不可迴向。",
        "translation": "If things are unarisen, then there's nothing, and within that nothing, there's no dedication of merit.",
        "source": "T25n1509_061:0493b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是迴向則無雜毒。",
        "translation": "When bodhisattvas, mahāsattvas, and women thus dedicate themselves, there's no mixed poison.",
        "source": "T25n1509_061:0493b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若求佛道善男子、善女人以取相得法，以諸善根迴向阿耨多羅三藐三菩提，是名邪迴向。",
        "translation": "\"If good men and good women seeking the Buddha's path obtain the teaching by apprehending characteristics and dedicate themselves to unsurpassed, correct dedication of effort based on good roots, this is called wrong dedication of effort.",
        "source": "T25n1509_061:0493b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若邪迴向，諸佛所不稱譽。",
        "translation": "If they make wrong dedications, the buddhas won't praise them.",
        "source": "T25n1509_061:0493b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用是邪迴向，不能具足檀波羅蜜乃至般若波羅蜜，不能具足四念處乃至八聖道分、內空乃至無法有法空、佛十力乃至無錯謬法、常捨行，不能具足淨佛世界、成就眾生；若不能淨佛世界、成就眾生，則不能得阿耨多羅三藐三菩提。",
        "translation": "With such wrong dedication, they can't fully attain the perfection of the perfection of giving or the perfection of wisdom, the four abodes of mindfulness or even the eight noble paths, internal emptiness or even the emptiness of nonexistence, the ten powers of the Buddha or even the lack of mistaken dharmas, and the practice of constant detachment, and they can't fully purify the Buddha's world or accomplish sentient beings; if they can't purify the Buddha's world or accomplish sentient beings, then they can't attain unsurpassed, corrected, and complete enlightenment.",
        "source": "T25n1509_061:0493b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0493c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是迴向雜毒故。",
        "translation": "This is because of the poison of redirection.",
        "source": "T25n1509_061:0493c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，菩薩摩訶薩行般若波羅蜜時，應作是念：『如諸佛所知諸善根迴向，是真迴向；我亦應以是法相迴向。』",
        "translation": "\"Furthermore, when practicing the perfection of wisdom, the bodhisattvas and mahāsattvas should think, 'Such is the true dedication of merit as the buddhas know about the dedication of good roots; I should also dedicate myself in terms of this teaching.'",
        "source": "T25n1509_061:0493c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名正迴向。」",
        "translation": "This is called right dedication of merit.\"",
        "source": "T25n1509_061:0493c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛讚須菩提：「善哉！",
        "translation": "At that point, the Buddha praised Subhūti, \"Good!",
        "source": "T25n1509_061:0493c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T25n1509_061:0493c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所為，為作佛事。",
        "translation": "\"As you have done, you're creating a buddha-works.",
        "source": "T25n1509_061:0493c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為諸菩薩摩訶薩說所應迴向法，以無相、無得、無出、無垢無淨、無法性、自相空、常性空、法性、如、實際故。",
        "translation": "For the bodhisattvas and mahāsattvas, you'll explain the principles to which they should dedicate themselves because they are markless, unobtainable, unexcluded, undefiled, impure, lacking in nature, empty of own-nature, empty of eternal nature, Dharma-nature, such, and actual.",
        "source": "T25n1509_061:0493c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_061:0493c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界中眾生皆當得十善道、四禪、四無量心、四無色定、五神通。",
        "translation": "\"Suppose all sentient beings in a world of 3,000 great one-thousand worlds were to attain the ten good destinies, the four meditations, the four immeasurable states of mind, the four formless concentrations, and the five supernormal powers.",
        "source": "T25n1509_061:0493c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於須菩提意云何？",
        "translation": "What does Subhūti think?",
        "source": "T25n1509_061:0493c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是眾生得福多不？」",
        "translation": "Do these sentient beings obtain much merit?\"",
        "source": "T25n1509_061:0493c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「甚多！",
        "translation": "\"Very much!",
        "source": "T25n1509_061:0493c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T25n1509_061:0493c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如是善男子、善女人於諸善根心不著，迴向阿耨多羅三藐三菩提，最上、第一、最妙、無上、無與等。",
        "translation": "The Buddha said, \"Wouldn't it be better for good sons and good women not to be attached to the mind of good roots and to dedicate themselves to unsurpassed, first, most marvelous, unsurpassed, and peerless enlightenment?",
        "source": "T25n1509_061:0493c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T25n1509_061:0493c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界中眾生皆當作須陀洹乃至阿羅漢、辟支佛，若有善男子、善女人盡形壽供養、恭敬、尊重、讚歎，衣服、飲食，臥具、醫藥，供給所須。",
        "translation": "\"If sentient beings in 3,000 great one-thousand worlds were to become stream-winners up to arhats and pratyekabuddhas, and if there were good men and good women who spent their whole lives making offerings, honoring, respecting, and praising them, and who provided what was needed for clothing, food, bedding, and medicine, then what do you think?",
        "source": "T25n1509_061:0493c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於須菩提意云何？",
        "translation": "What does Subhūti think?",
        "source": "T25n1509_061:0493c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，是因緣故，得福德多不？」",
        "translation": "Are these good men and good women the causes and conditions that lead to substantial merit?\"",
        "source": "T25n1509_061:0493c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「甚多！",
        "translation": "\"Very much!",
        "source": "T25n1509_061:0493c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!\"",
        "source": "T25n1509_061:0493c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不如是善男子、善女人於諸善根心不著，迴向阿耨多羅三藐三菩提，最上、第一、最妙、無上、無與等。",
        "translation": "The Buddha said, \"Wouldn't it be better for good sons and good women not to be attached to the mind of good roots and to dedicate themselves to unsurpassed, first, most marvelous, unsurpassed, and peerless enlightenment?",
        "source": "T25n1509_061:0493c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T25n1509_061:0493c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若三千大千世界中眾生皆發阿耨多羅三藐三菩提心，十方如恒河沙等世界中一一眾生，如恒河沙等劫，恭敬、尊重、讚歎、供養是菩薩，衣服、飲食，臥具、醫藥，供給所須。",
        "translation": "\"If sentient beings in 3,000 great one-thousand worlds all arouse the mind of the unsurpassed, correct, and complete bodhisattva, then each sentient being in a world as vast as the sands of the Ganges in the ten directions will respect, honor, praise, and make offerings to that bodhisattva, providing him with clothing, food, bedding, and medicine as needed for an eon as vast as the sands of the Ganges.",
        "source": "T25n1509_061:0493c25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於須菩提意云何？",
        "translation": "What do you think, Subhūti?",
        "source": "T25n1509_061:0493c28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人，是因緣故，得福多不？」",
        "translation": "Are these good men and good women the causes and conditions that lead to much merit?\"",
        "source": "T25n1509_061:0493c29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「甚多！",
        "translation": "\"Very much!",
        "source": "T25n1509_061:0494a01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_061:0494a01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無邊阿僧祇，不可以譬喻為比。",
        "translation": "Measureless and limitless are the incalculably long incalculable eons that can't be compared to metaphors.",
        "source": "T25n1509_061:0494a01_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_061:0494a02_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是福德有形者，十方如恒河沙等世界所不受！」",
        "translation": "If this merit were tangible, it would be unacceptable to worlds as vast as the Ganges in the ten directions!\"",
        "source": "T25n1509_061:0494a02_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須菩提：「善哉！",
        "translation": "The Buddha told Subhūti, \"Good!",
        "source": "T25n1509_061:0494a03_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T25n1509_061:0494a04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言。",
        "translation": "Just as you said.",
        "source": "T25n1509_061:0494a04_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖爾，不如善男子、善女人於諸善根心不著迴向阿耨多羅三藐三菩提，最上、第一、最妙、無上、無與等。",
        "translation": "Still, it's not like good men and good women who don't fix their minds on the good roots and return to unsurpassed, first, most marvelous, unsurpassed, and unparalleled enlightenment.",
        "source": "T25n1509_061:0494a04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是無著迴向功德，比前功德，百倍、千倍、百千億倍乃至算數譬喻所不能及！",
        "translation": "This merit of unattached dedication of merit is a hundredfold, a thousandfold, or a hundred billionfold greater than the previous merit, even beyond the power of mathematical metaphors!",
        "source": "T25n1509_061:0494a06_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0494a08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人取相得法，行十善道、四禪、四無量心、四無色定、五神通，取相得法供養須陀洹，恭敬、尊重、讚歎，衣服、飲食，臥具、醫藥，供給所須，乃至取相供養菩薩故。」",
        "translation": "These good men and good women obtain the Dharma by apprehending characteristics, practice the ten good paths, the four meditations, the four immeasurable states of mind, the four formless concentrations, and the five supernormal powers, make offerings to the stream entry, respect, honor, and praise them, and provide what's needed for clothing, food, bedding, and medicine, even up to making offerings to the bodhisattvas by apprehending characteristics.\"",
        "source": "T25n1509_061:0494a08_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，四天王天與二萬諸天子合掌禮佛，作是言：「世尊！",
        "translation": "At the time, the four heavenly kings and gods and 20,000 celestials joined their palms in prostrating to the Buddha and said, \"Bhagavān!",
        "source": "T25n1509_061:0494a12_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩最大迴向，以方便力故、以無所得故、以無相法故、以無覺法故，諸善根迴向阿耨多羅三藐三菩提。",
        "translation": "The greatest dedication of the bodhisattvas, the great dedication of the bodhisattvas, is the dedication of their good roots to unsurpassed, correct, and complete enlightenment because of the power of skillful means, because of the ungraspable, because of the teaching without characteristics, and because of the teaching without awakening.",
        "source": "T25n1509_061:0494a13_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迴向，不墮二法。」",
        "translation": "Thus dedicating themselves, they don't fall into two dharmas.\"",
        "source": "T25n1509_061:0494a16_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，釋提桓因亦與無數三十三天及餘諸天子持天華、瓔珞、擣香、澤香、天衣、幡蓋、鼓天伎樂以供養佛，作如是言：「世尊！",
        "translation": "At the time, Śakra Devānām-Indra and countless other Trāyastriṃśa gods and gods carried celestial flowers, jewelry, calabash incense, fragrant incense, celestial robes, banners, and drums with celestial music to support the Buddha, and they said, \"Bhagavān!",
        "source": "T25n1509_061:0494a16_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩最大迴向，以方便力故、以無所得故、以無相法故、以無覺法故，諸善根迴向阿耨多羅三藐三菩提。",
        "translation": "The greatest dedication of the bodhisattvas, the great dedication of the bodhisattvas, is the dedication of their good roots to unsurpassed, correct, and complete enlightenment because of the power of skillful means, because of the ungraspable, because of the teaching without characteristics, and because of the teaching without awakening.",
        "source": "T25n1509_061:0494a19_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迴向，不墮二法。」",
        "translation": "Thus dedicating themselves, they don't fall into two dharmas.\"",
        "source": "T25n1509_061:0494a22_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須夜摩天王與千天子，刪兜率陀、化樂、他化自在諸天王各與千天子俱，供養佛已，作如是言：「世尊！",
        "translation": "After making offerings to the Buddha, the Sumeru god king and a thousand celestials, including the god kings Tuṣita, Nirmāṇarati, and Paranirmitavaśavartin, each made these words, \"Bhagavān!",
        "source": "T25n1509_061:0494a22_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩最大迴向，以方便力故、以無所得故、以無相法故、以無覺法故，諸善根迴向阿耨多羅三藐三菩提。",
        "translation": "The greatest dedication of the bodhisattvas, the great dedication of the bodhisattvas, is the dedication of their good roots to unsurpassed, correct, and complete enlightenment because of the power of skillful means, because of the ungraspable, because of the teaching without characteristics, and because of the teaching without awakening.",
        "source": "T25n1509_061:0494a25_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是迴向，不墮二法。」",
        "translation": "Thus dedicating themselves, they don't fall into two dharmas.\"",
        "source": "T25n1509_061:0494a27_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，諸梵天王與無數百千億那由他諸天俱詣佛所，頭面禮佛足，發大音聲，作如是言：「未曾有也！",
        "translation": "At the time, the brahma kings and countless hundreds of billions of nayutas all went to the Buddha, bowed their heads to his feet, made a loud noise, and said, \"Never has it happened before!",
        "source": "T25n1509_061:0494a28_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_061:0494b01_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為般若波羅蜜所護，以方便力故，勝前善男子、善女人取相有所得者。」",
        "translation": "The bodhisattva Mahāsattva is protected by the perfection of wisdom, and by the power of skillful means, he surpasses the previous good sons and good women who grasped to characteristics and had access to them.\"",
        "source": "T25n1509_061:0494b01_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光音天乃至阿迦尼吒天與無數百千億那由他諸天俱詣佛所，頭面禮佛足，發大音聲，作如是言：「未曾有也！",
        "translation": "The Luminous Sound Celestial, the Akaniṣṭha Heaven, and measureless hundreds of billions of nayutas all went to the Buddha, bowed their heads to his feet, made a loud noise, and said, \"Never has it happened before!",
        "source": "T25n1509_061:0494b03_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_061:0494b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為般若波羅蜜所護，以方便力故，勝前善男子、善女人取相有所得者。」",
        "translation": "The bodhisattva Mahāsattva is protected by the perfection of wisdom, and because of the power of skillful means, he's superior to the good man or good woman who previously grasped to characteristics and had access to them.\"",
        "source": "T25n1509_061:0494b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，佛告四天王天乃至阿迦尼吒諸天子：「若三千大千世界中所有眾生皆發阿耨多羅三藐三菩提心，是一切菩薩念過去、未來、現在諸佛及聲聞、辟支佛諸善根，從初發意乃至法住，於其中間所有善根；并餘一切眾生所有善根——所謂布施、持戒、忍辱、精進、一心、智慧，檀波羅蜜乃至般若波羅蜜，戒眾、定眾、慧眾、解脫眾、解脫知見眾——如是等諸餘無量佛法，一切和合隨喜；隨喜已，迴向阿耨多羅三藐三菩提，以取相有所得故。",
        "translation": "爾時，佛告四天王天乃至阿迦尼吒諸天子：「若三千大千世界中所有眾生皆發阿耨多羅三藐三菩提心，是一切菩薩念過去、未來、現在諸佛及聲聞、辟支佛諸善根，從初發意乃至法住，於其中間所有善根；并餘一切眾生所有善根——所謂布施、持戒、忍辱、精進、一心、智慧，檀波羅蜜乃至般若波羅蜜，戒眾、定眾、慧眾、解脫眾、解脫知見眾——如是等諸餘無量佛法，一切和合隨喜；隨喜已，迴向阿耨多羅三藐三菩提，以取相有所得故。",
        "source": "T25n1509_061:0494b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有善男子、善女人發阿耨多羅三藐三菩提心，念過去、未來、現在諸佛及聲聞、辟支佛，從初發意乃至法住，於其中間所有善根；并餘一切眾生所有善根——所謂布施、持戒、忍辱、精進、一心、智慧，檀波羅蜜乃至無量諸佛法，一切和合稱量，以無所得故、無二法故、無相法故、不著法故、無覺法故，是最上隨喜，第一、最妙、無上、無與等隨喜；隨喜已，迴向阿耨多羅三藐三菩提。",
        "translation": "\"Furthermore, good sons and good women who arouse the mind of unsurpassed, correct, and complete enlightenment and remember all the good roots of past, future, and present buddhas, śrāvakas, and pratyekabuddhas from the time they first arouse the intention until the abode of the Dharma, and all the good roots of all other sentient beings-namely, generosity, observance of precepts, patience, humility, effort, single-mindedness, wisdom, the perfection of giving, and countless other Buddha-teachings-are all combined and weighed in such a way that they're unobtainable, nondual, signless, unattached, and without awakening, which is the supreme according delight, the first, most wonderful, unsurpassed, and unparalleled according delight; after according delight, they return to unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_061:0494b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是善男子、善女人功德勝前善男子、善女人功德，百倍、千倍、百千億倍乃至算數譬喻所不能及！」",
        "translation": "This good man's and good woman's merit is one hundredfold, a thousandfold, a hundred billionfold, and even beyond calculation and metaphors, superior to the merit of the good man or good woman before him!\"",
        "source": "T25n1509_061:0494b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，須菩提白佛言：「世尊！",
        "translation": "It was then that Subhūti said to the Buddha, \"Bhagavān!",
        "source": "T25n1509_061:0494b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊說善男子、善女人和合諸善根稱量，隨喜迴向，最上、第一、最妙、無上、無與等。",
        "translation": "The Bhagavān teaches that good men and good women combine and measure their good roots, and they joyfully return them as the best, first, most wonderful, unsurpassed, peerless, and so forth.",
        "source": "T25n1509_061:0494b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T25n1509_061:0494c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名隨喜最上乃至無與等？」",
        "translation": "What is called following the joy of the greatest and even the incomparable?\"",
        "source": "T25n1509_061:0494c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若善男子、善女人念過去、未來、現在諸法，不取不捨、不念非不念、不得非不得，是諸法中，亦無有法生者滅者、若垢若淨，諸法不增不減、不來不去、不合不散、不入不出；如過去、未來、現在諸法相，如如相、法性、法住、法位，我亦如是隨喜；隨喜已，迴向阿耨多羅三藐三菩提，如是迴向，最上、第一、最妙、無上、無與等！",
        "translation": "The Buddha said, \"If good sons and good women are mindful of past, future, and present dharmas and don't acquire or abandon them, don't think or don't think, and don't obtain or don't obtain them, then there are no dharmas that arise or cease, are defiled or pure, that don't increase or decrease, that don't come or go, that don't fit or disperse, that don't enter or leave, such as the characteristics of past, future, and present dharmas, such as their characteristics, their nature, their abiding, and their status, I too thus rejoice; and having rejoiced, I dedicate myself to unsurpassed, first, most sublime, unsurpassed, peerless, and peerless enlightenment!",
        "source": "T25n1509_061:0494c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_061:0494c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是隨喜法，比餘隨喜，百倍、千倍、百千億倍乃至算數譬喻所不能及！",
        "translation": "This is a method of rejoicing that's a hundredfold, a thousandfold, or a hundred billionfold greater than other rejoicings, even beyond the reach of mathematical metaphors!",
        "source": "T25n1509_061:0494c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T25n1509_061:0494c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求佛道善男子、善女人於過去、未來、現在諸佛及聲聞、辟支佛從初發心乃至法住，於其中間所有善根，若布施乃至智慧，檀波羅蜜乃至無量諸佛法，及餘一切眾生所有善根，若欲隨喜者，應如是隨喜！",
        "translation": "Good men and good women who seek the Buddha's path should thus delight in the good roots of past, future, and present buddhas, śrāvakas, and solitary buddhas, from their first arousal of mind until the abiding of the Dharma, whether they are generous or wise, the perfection of giving or countless other Buddha-teachings, or the good roots of all other sentient beings if they wish to do so!",
        "source": "T25n1509_061:0494c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念：『布施與解脫等，戒、忍、精進、禪、智與解脫等；色與解脫等，受、想、行、識亦與解脫等；內空與解脫等，乃至無法有法空亦與解脫等；四念處與解脫等，乃至八聖道分亦與解脫等；佛十力與解脫等，乃至一切種智亦與解脫等；戒眾、定眾、慧眾、解脫眾、解脫知見眾，亦與解脫等；隨喜與解脫等；過去、未來、現在諸法與解脫等；十方諸佛與解脫等；諸佛迴向與解脫等；諸佛與解脫等，諸佛滅度與解脫等；諸佛弟子聲聞、辟支佛與解脫等，諸佛弟子滅度與解脫等；諸佛法相與解脫等，諸聲聞、辟支佛法相與解脫等，一切諸法相亦與解脫等。",
        "translation": "作是念：『布施與解脫等，戒、忍、精進、禪、智與解脫等；色與解脫等，受、想、行、識亦與解脫等；內空與解脫等，乃至無法有法空亦與解脫等；四念處與解脫等，乃至八聖道分亦與解脫等；佛十力與解脫等，乃至一切種智亦與解脫等；戒眾、定眾、慧眾、解脫眾、解脫知見眾，亦與解脫等；隨喜與解脫等；過去、未來、現在諸法與解脫等；十方諸佛與解脫等；諸佛迴向與解脫等；諸佛與解脫等，諸佛滅度與解脫等；諸佛弟子聲聞、辟支佛與解脫等，諸佛弟子滅度與解脫等；諸佛法相與解脫等，諸聲聞、辟支佛法相與解脫等，一切諸法相亦與解脫等。",
        "source": "T25n1509_061:0494c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以是諸善根相隨喜功德迴向阿耨多羅三藐三菩提，亦與解脫等，不生不滅故。』",
        "translation": "The merit of following the characteristics of these good roots as I dedicate myself to unsurpassed, correct, and complete enlightenment is equal to liberation, so it doesn't arise or cease.'",
        "source": "T25n1509_061:0494c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_061:0495a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名諸菩薩摩訶薩隨喜功德，最上、第一、最妙、無上、無與等。",
        "translation": "These are called the virtues that bodhisattvas, mahāsattvas, rejoice in, which are the greatest, first, most marvelous, unsurpassed, peerless, and so forth.",
        "source": "T25n1509_061:0495a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T25n1509_061:0495a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩成就是隨喜功德，當疾得阿耨多羅三藐三菩提。",
        "translation": "When a bodhisattva accomplishes this merit of rejoicing, he'll quickly attain supreme perfect enlightenment.",
        "source": "T25n1509_061:0495a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，須菩提！",
        "translation": "\"Furthermore, Subhūti!",
        "source": "T25n1509_061:0495a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方如恒河沙等諸佛及弟子現在，若有求佛道善男子、善女人盡形壽供養是諸佛及弟子一切所須，供養、恭敬、尊重、讚歎，衣服、飲食，臥具、醫藥；是諸佛滅度後，晝夜懃修，供養、恭敬、尊重、讚歎，華香乃至旛蓋伎樂，以取相有所得故。",
        "translation": "Now, if there are good men and good women in the ten directions like the Ganges sands who seek the Buddha's path and spend their whole lives making offerings to these buddhas and disciples for everything they need, making offerings, honoring, respecting, and praising them, clothing, food and drink, bedding, and medicine, and if they strive day and night after the buddhas' extinction to make offerings, honor, respect, and praise, flowers, fragrances, and even pennants and tricks, it's because they have gained something by grasping their appearances.",
        "source": "T25n1509_061:0495a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持戒、忍辱、精進、禪定、修智慧，以取相有所得故。",
        "translation": "Observing precepts, tolerating humility, making effort, meditating, and cultivating wisdom are acquired by apprehending appearances.",
        "source": "T25n1509_061:0495a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有善男子、善女人發意求阿耨多羅三藐三菩提，行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜時，以不取相、無所得法方便力諸善根迴向阿耨多羅三藐三菩提，是福德最上、第一、最妙、無上、無與等，勝前福德，百倍、千倍、百千億倍乃至算數譬喻所不及！",
        "translation": "\"Furthermore, when good sons and good women arouse the intention to pursue the unsurpassed, correct enlightenment and practice the perfection of giving, the perfection of śīla, the perfection of kṣatriya, the perfection of meditation, and the perfection of prajñāpāramitā, they will dedicate themselves to the unsurpassed, correct enlightenment with the skillful means of not apprehending characteristics and the unobtainable Dharma, which is the greatest, most excellent, most marvelous, unsurpassed, and peerless merit, one hundred, a thousand, a hundred billion, and even a metaphorical one, beyond the preceding merits!",
        "source": "T25n1509_061:0495a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，須菩提！",
        "translation": "Thus, shall bodhi!",
        "source": "T25n1509_061:0495a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行檀波羅蜜時，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜時，以方便力故，諸善根應迴向阿耨多羅三藐三菩提，以不取相、無所得法故。」",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of giving, the perfection of śīla, the perfection of kṣatriya, the perfection of vīrya, the perfection of meditation, and the perfection of prajñā, by virtue of the power of skillful means, the good roots should be directed toward unsurpassed, unacquired features, and unobtainable dharmas.\"",
        "source": "T25n1509_061:0495a18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：菩薩應作是念：從色乃至常捨行諸法，不繫三界故，三世不攝。",
        "translation": "[Commentary] The explanation says, \"A bodhisattva should think this: 'From form up to the constant practice of indifference, the three worlds don't include things because they aren't bound to the three realms.'",
        "source": "T25n1509_061:0495a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛及弟子并諸功德，隨喜心、迴向處、所用迴向法、迴向者亦如是，是名正迴向。",
        "translation": "This is called correctly dedicating [oneself] to the buddhas, disciples, and other merits, as well as to the mind, the place of dedication, the method of dedication used, and the person dedicating [oneself] to them.",
        "source": "T25n1509_061:0495a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，菩薩作是念：若色出三界、三世不攝，不可以取相有所得迴向。",
        "translation": "At that point, the bodhisattva had this thought: \"If form is outside the three realms and isn't included in the three times, it's not possible to take characteristics and have attained dedication of merit.",
        "source": "T25n1509_061:0495a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0495a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是色出三界者，即是色實相，初、後生相不可得，如〈破生品〉中說。",
        "translation": "\"This is form that escapes the three realms, which is the true mark of form, and the marks of first and last birth are unobtainable, as explained in 'Chapter on Refuting Birth.'",
        "source": "T25n1509_061:0495a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若法無生，即是無所有，無所有迴向心云何迴向無所有菩提心？",
        "translation": "If things are unarisen, that is, they are unarisen, so how does the mind that dedicates itself to the unarisen bodhi-mind?",
        "source": "T25n1509_061:0495a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色、受、想、行、識乃至常捨行亦如是。",
        "translation": "So it is with form, feeling, perception, volition, consciousness, and even the practice of permanent equanimity.",
        "source": "T25n1509_061:0495b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名「無雜毒迴向」，所謂「無相無得迴向」。",
        "translation": "This is called \"dedication without mixed poisons,\" which is called \"dedication without marks or attainments.\"",
        "source": "T25n1509_061:0495b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「雜毒」者，所謂諸佛不讚歎，不能具足六波羅蜜等，乃至不能得阿耨多羅三藐三菩提。",
        "translation": "The term \"mixed poisons\" refers to those who aren't praised by the buddhas, who can't fully realize the six perfections, and who can't even attain unsurpassed, correct enlightenment.",
        "source": "T25n1509_061:0495b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩應作是念：「如十方三世諸佛所知，應如是生心、如是念、如是觀、如是迴向，是功德直至無上道，我亦如是隨喜迴向。」",
        "translation": "Furthermore, bodhisattvas should think, \"As the buddhas of the ten directions and three times know, they should thus give rise to mindfulness, mindfulness, contemplation, and dedication of effort that will lead to the unsurpassed path, and I will thus happily dedicate myself to them.\"",
        "source": "T25n1509_061:0495b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩必得實隨喜，迴向不虛，如先說因緣。",
        "translation": "Such a bodhisattva will surely attain true joy and dedication of merit that's not false, just as the causes and conditions explained earlier.",
        "source": "T25n1509_061:0495b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是略說諸迴向品。",
        "translation": "This is an abbreviated explanation of the various stages of dedication of merit.",
        "source": "T25n1509_061:0495b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩禮佛有三品：一者、悔過品，二者、隨喜迴向品，三者、勸請諸佛品。",
        "translation": "There are three ways in which a bodhisattva pays homage to the Buddha: one, the way of repenting faults, two, the way of joyfully dedicating oneself to the teachings, and three, the way of inviting the buddhas.",
        "source": "T25n1509_061:0495b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說則無量無邊。",
        "translation": "When explained in detail, they are countless and limitless.",
        "source": "T25n1509_061:0495b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善哉！",
        "translation": "\"Good!",
        "source": "T25n1509_061:0495b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！",
        "translation": "Bravo!",
        "source": "T25n1509_061:0495b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝作佛事」者，佛初發心，誓度一切眾生；須菩提雖是阿羅漢，而能助佛說法，開菩薩道，是故讚言：「善哉！",
        "translation": "You do the Buddha-works\" means that when the Buddha first aroused his intention, he vowed to save all sentient beings; although he is an arhat, he can assist the Buddha in teaching and opening up the bodhisattva path; therefore, he praises him, saying, \"Good!",
        "source": "T25n1509_061:0495b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！」",
        "translation": "Excellent!\"",
        "source": "T25n1509_061:0495b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛自說因緣：「為諸菩薩說所應迴向法，用無相故」者，以無相智慧，和合迴向福德相者，與上相違，名為「無相」。",
        "translation": "Furthermore, the Buddha himself explained the causes and conditions, \"He teaches the bodhisattvas what to dedicate their minds to, using marklessness.\" This is called \"marklessness\" because it's the markless wisdom that combines the marks of dedication of merit and fortune, which is at odds with the above.",
        "source": "T25n1509_061:0495b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無相有三種：假名相、法相、無相相。",
        "translation": "There are three kinds of marklessness: nominal marks, dharma marks, and markless marks.",
        "source": "T25n1509_061:0495b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「假名相」者，如車、如屋、如林、如軍、如眾生，諸法和合中，更有是名。",
        "translation": "\"Nominal marks\" are like chariots, houses, forests, armies, and sentient beings, and there's another name for them in the confluence of all things.",
        "source": "T25n1509_061:0495b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明力故，取是假名相，起諸煩惱、業。",
        "translation": "Because of the power of ignorance, they grasp these nominally named characteristics and generate afflictions and actions.",
        "source": "T25n1509_061:0495b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「法相」者，五眾、十二入、十八界等諸法。",
        "translation": "\"Characteristics of dharmas\" refers to the five aggregates, 12 sense-fields, 18 elements, and other dharmas.",
        "source": "T25n1509_061:0495b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "肉眼觀故有，以慧眼觀則無，是故法亦虛誑妄語，應捨離法相。",
        "translation": "They exist because they're observed by the physical eye but don't exist when observed with the eye of wisdom, so they are also false and deluded, and they should be abandoned as characteristics of things.",
        "source": "T25n1509_061:0495b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離是二相，餘但有「無相相」。",
        "translation": "After parting with these two marks, the rest only have \"markless marks.\"",
        "source": "T25n1509_061:0495b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人取是無相相，隨逐取相，還生結使，是故亦不應取「無相相」。",
        "translation": "If someone grasps these markless marks, they'll follow their grasping of marks and return to the bonds and tendencies, so they shouldn't grasp \"markless marks\" either.",
        "source": "T25n1509_061:0495b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離三種相，故名無相。",
        "translation": "Being free of the three kinds of marks, it's called having no marks.",
        "source": "T25n1509_061:0495b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無有相，是中「無所得」；無得故「無出」；若法無得、無出，即是「無垢無淨」；若法無垢無淨，即是「無法性」；若法無性，即是「自相空」；若法自相空，即是法「常自性空」；若法常自性空，即同「法性、如、實際」。",
        "translation": "If there are no marks, this is \"ungraspable,\" and because there are no marks, \"there's no emerging,\" and if things are ungraspable and unemerging, that's \"undefiled and impure,\" and if things are undefiled and impure, that's \"lacking in nature,\" and if things are lacking in nature, that's \"emptiness of self-marks,\" and if things are empty of self-marks, that's \"emptiness of constant self-nature,\" and if things are empty of constant self-nature, that's the same as \"Dharma-nature, thusness, and reality.",
        "source": "T25n1509_061:0495b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用如是法和合，隨喜福德迴向，故讚言：「善哉！",
        "translation": "By combining such things, they are able to rejoice in their merits and transfer merit, so they praise them, saying, \"Good!",
        "source": "T25n1509_061:0495b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉！」",
        "translation": "Excellent!\"",
        "source": "T25n1509_061:0495c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有「善哉」因緣，所謂隨喜福德，大利益眾生，有大果報。",
        "translation": "\"Again, there are \"good\" causes and conditions that are called the merit of following joy, which greatly benefits sentient beings and has great rewards.",
        "source": "T25n1509_061:0495c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是大利益？",
        "translation": "What's great benefit?",
        "source": "T25n1509_061:0495c02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂佛語須菩提：「若三千大千世界眾生行十善乃至五通。」",
        "translation": "It's called the Buddha saying to Subhūti, \"Suppose there are sentient beings in a world of 3,000 great one-thousand worlds who practice the ten good qualities up to the five supernormal powers.\"",
        "source": "T25n1509_061:0495c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：欲界中二處天及梵天王何以與多天俱，餘四天何以少？",
        "translation": "The question was, 'Why are the two regions of the desire realm and the Brahma Heavenly Kings joined by so many gods, and why are the other four gods few?'",
        "source": "T25n1509_061:0495c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：是二天依止地，近佛故；又五欲不如上天。",
        "translation": "Answer: These two gods rely on the ground to be near the Buddha, and their five desires aren't as great as those of the higher gods.",
        "source": "T25n1509_061:0495c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛生時、苦行時、降魔時、得道時、轉法輪時，常來供養佛，是故多。",
        "translation": "When the Buddha is born, when he's engaged in ascetic practices, when he subdues Māra, when he attains the way, and when he turns the wheel of the Dharma, he always comes to make offerings to the Buddha, which is why there are so many of them.",
        "source": "T25n1509_061:0495c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘四處天，宮殿在虛空中，不屬地；五欲妙，染著深故，不能多來。",
        "translation": "In the other four heavens, their palaces are in the sky and don't belong to the ground, and their five desires are sublime; because they're deeply defiled, they can't come often.",
        "source": "T25n1509_061:0495c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又兜率天雖利根、樂法，而其天上常有補處菩薩說法，是故不來。",
        "translation": "Although the Tuṣita Heaven has sharp faculties and enjoys the Dharma, there's always a bodhisattva in that heaven who preaches in a supplementary place, so they don't come.",
        "source": "T25n1509_061:0495c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵天雖遠，離欲故樂法情深，佛為法王，是故多來。",
        "translation": "Although the Brahma Heaven is distant, it's free of desire and therefore deeply interested in the Dharma, and the Buddha is the Dharma king; therefore, many of them come.",
        "source": "T25n1509_061:0495c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，梵天王為色界主，請佛初轉法輪，是故應與多眾俱來。",
        "translation": "Furthermore, since the Brahma heaven king is the lord of the form realm and invited the Buddha to first turn the Dharma wheel, he should come with a large group of people.",
        "source": "T25n1509_061:0495c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘色界天，盡名梵天。",
        "translation": "The other form realm gods are all called Brahmā gods.",
        "source": "T25n1509_061:0495c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：先種種因緣說正迴向，正迴向即是最上，今何以更問？",
        "translation": "Q: After explaining the various causes and conditions for correctly turning the wheel, and since correctly turning the wheel is the highest, why do we ask this question again?",
        "source": "T25n1509_061:0495c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：上處處廣說，今略說。",
        "translation": "Answer: The above was explained in detail in various places, but now I'll explain it briefly.",
        "source": "T25n1509_061:0495c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂三世十方一切法，決定心知，於是法中無生者滅者等，一切法不可得、不可念；不得不念故，不取不捨，入諸法實相中。",
        "translation": "It means that he is determined to mindfully know that there are no such things as birth and cessation, and that all things are unobtainable and unthinkable; because he has to think about them, he doesn't grasp or abandon them and enters into the true characteristics of dharmas.",
        "source": "T25n1509_061:0495c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是念：「如諸法實相，我亦如是以隨喜福德迴向，不分別諸法，不壞法性。」",
        "translation": "He thinks, \"Thus are the true characteristics of dharmas, and thus I will dedicate myself with joyful merit, not discriminating qualities or destroying the nature of dharmas.\"",
        "source": "T25n1509_061:0495c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名最上迴向。",
        "translation": "This is called the supreme dedication of merit.",
        "source": "T25n1509_061:0495c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0495c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "果報常無盡故。",
        "translation": "The rewards are always inexhaustible.",
        "source": "T25n1509_061:0495c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：六波羅蜜等諸法各各相，若色相、若無色相等；解脫有二種：有為解脫，無為解脫，云何皆與解脫等？",
        "translation": "Q: Regarding the six perfections and other things that have their own characteristics, such as form and formlessness, and the two kinds of liberation: liberation with effort and liberation without effort, how are they all equal in liberation?",
        "source": "T25n1509_061:0495c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：我先已說：凡夫人以肉眼、六識顛倒觀故見異；若以慧眼，觀諸法皆虛妄，唯涅槃為實。",
        "translation": "Answer: I've already explained that ordinary people see things differently because they use the physical eye and the six consciousnesses to look at them mistakenly; if they use the eye of wisdom, they'll see that all things are false and delusive and that only nirvāṇa is real.",
        "source": "T25n1509_061:0495c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是有為解脫，屬無為、隨無為故名「解脫」。",
        "translation": "This is the liberation of existent beings that belongs to nonexistence and follows nonexistence, so it's called \"liberation.\"",
        "source": "T25n1509_061:0495c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如實得道者名道人，今未得道者，衣服、法則隨得道者故，亦名道人。",
        "translation": "Those who have truly attained the way are called people of the way, and those who haven't yet attained the way are also called people of the way because their clothing and principles follow those who have attained the way.",
        "source": "T25n1509_061:0495c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無餘涅槃，不生不滅、不入不出、不垢不淨、非有非無、非常非無常，常寂滅相，心識觀滅、語言道斷，非法非非法等相，用無所有相故；慧眼觀一切法亦如是相，是名「六波羅蜜等與解脫等」。",
        "translation": "As in nirvāṇa without remainder, it's neither arising nor ceasing, neither entering nor leaving, neither defiled nor pure, neither existent nor nonexistent, neither permanent nor impermanent, and always characterized by extinction, the contemplation of the mental consciousness ceases, the path of language is cut off, and the marks of what's neither illegal nor non-illegal are used, so the wisdom eye observes all things in such a way that they're called \"the six perfections and liberation, etc.\"",
        "source": "T25n1509_061:0495c29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故佛法中說：解脫為貴，上智慧貴解脫。",
        "translation": "Therefore, it's said in the Buddhist teaching that liberation is valued, and superior wisdom values liberation.",
        "source": "T25n1509_061:0496a04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛是中分別說：「若人無量阿僧祇劫行六波羅蜜，用有所得法，種種修集善根；一人用無所得法，但以心隨喜，念他功德，迴向無上道；是人百千萬分不及其一。」",
        "translation": "The Buddha thus discriminates between them and says, \"If a person practices the six perfections for measureless incalculable eons and uses the attained qualities to cultivate good roots in various ways, and a person uses the unattained qualities but simply follows them with joy in their heart, mindful of the merits of others, and dedicating themselves to the unsurpassed path, that person's one hundred million parts are not one of them.\"",
        "source": "T25n1509_061:0496a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_061:0496a09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先福德有量，今福德無量；先福德有盡，今福德無盡；先福德雜毒，今福德無毒；先福德隨生死，今福德隨涅槃；先福德不定，或作佛、或退，今福德定到，必疾作佛。",
        "translation": "Previously, merit was measured, but now merit is measureless; previously, merit was ended, but now merit is endless; previously, merit was mixed with poison, but now merit is without poison; previously, merit followed birth and death, but now merit follows nirvāṇa; previously, merit was uncertain, and he might become a buddha or retreat, but now, when merit is definitely attained, he'll surely become a buddha quickly.",
        "source": "T25n1509_061:0496a09_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有如是等差別。",
        "translation": "There are such and such differences.",
        "source": "T25n1509_061:0496a13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故四種人：若凡夫人求世間樂，若聲聞、辟支佛人求涅槃樂，若諸菩薩摩訶薩求佛樂。",
        "translation": "Therefore, there are four kinds of people: those who are ordinary women seeking worldly happiness, śrāvakas and pratyekbuddhas seeking the happiness of nirvāṇa, and bodhisattvas and mahāsattvas seeking the happiness of the Buddha.",
        "source": "T25n1509_061:0496a13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應如是隨喜生福德迴向阿耨多羅三藐三菩提，如此品中說。",
        "translation": "Thus, they should thus delight in the merit that arises and dedicate themselves to unsurpassed, correct enlightenment, as explained in this section.",
        "source": "T25n1509_061:0496a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "◎大智度論卷第六十一",
        "translation": "Dazhidharma-nyāyânusāra, vol. 61",
        "source": "T25n1509_061:0496a17_1",
        "is_bad_quality": false
    }
]