[
    {
        "source_sentence": "大智度論釋習相應品第三",
        "translation": "Dazhiduolun shi xianying pin 3",
        "source": "T25n1509_036:0322c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "之餘(卷三十六)",
        "translation": "the rest (vol. 36)",
        "source": "T25n1509_036:0322c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖者龍樹造",
        "translation": "created by the sage Nāgârjuna",
        "source": "T25n1509_036:0322c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, Tripiṭaka of Kucha, Later Qin Dynasty",
        "source": "T25n1509_036:0322c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】舍利弗白佛言：「云何菩薩摩訶薩過聲聞、辟支佛地，住阿鞞跋致地，淨佛道？」",
        "translation": "[Sutra] Śāriputra said to the Buddha, \"How does a bodhisattva go beyond the stage of śrāvakas and pratyekabuddhas to abide in the stage of abhidharma, which is the pure buddha path?\"",
        "source": "T25n1509_036:0322c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：舍利弗何因作是問？",
        "translation": "[Treatise] asked, \"Śāriputra, what is the reason you're asking this question?",
        "source": "T25n1509_036:0322c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：舍利弗上問眾智無異，佛既種種譬喻明菩薩智勝；意既已解，今問：「云何能過二乘，住阿毘跋致地，淨佛道？」",
        "translation": "Answer: Śāriputra asked above about the lack of distinction among the various kinds of cognition, and since the Buddha had explained the superiority of the bodhisattvas' cognition through various metaphors, he now asked, \"How can you surpass the adherents of the two vehicles, abide in the stage of abhivartization, and purify the Buddha Way?\"",
        "source": "T25n1509_036:0322c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：小乘不住成佛，何以故問淨佛道事？",
        "translation": "Q: Why do you ask about the purification of the Buddha Way when the lesser vehicle does not abide in the attainment of Buddhahood?",
        "source": "T25n1509_036:0322c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：舍利弗者，是隨佛轉法輪將，雖自無益，為利益求佛道眾生故問。",
        "translation": "Answer: \"Śāriputra is a general who follows the Buddha as he turns the wheel of the Dharma and asks this question for the benefit of sentient beings seeking the Buddha's path, even though it won't benefit them.",
        "source": "T25n1509_036:0322c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以菩薩大悲，多所利益，是故問菩薩事以益眾生。",
        "translation": "It's also because of the bodhisattva's great compassion and many benefits that he asks about the bodhisattva's works to benefit sentient beings.",
        "source": "T25n1509_036:0322c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，舍利弗蒙佛恩故，破諸邪見，得成道果；欲報恩故問菩薩事。",
        "translation": "Furthermore, because of the Buddha's kindness, Śāriputra had dispelled wrong views and attained the fruit of the path; he wanted to repay that kindness by asking about the bodhisattva's works.",
        "source": "T25n1509_036:0322c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗於聲聞地中究盡邊際，所未了者唯菩薩事，是故復問。",
        "translation": "Furthermore, Śāriputra had explored the limit of the śrāvaka stage, and the only thing he hadn't understood was the bodhisattva's works; therefore, he asked again.",
        "source": "T25n1509_036:0322c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以菩薩法甚深微妙，雖不能得，愛樂故問；譬如見人妙寶已，雖自無，愛樂故問。",
        "translation": "It's also because the bodhisattva's teaching is so profound and subtle that even though it's unobtainable, he's delighted to ask about it; it's like seeing someone's marvelous treasure and even though it's not there, he's delighted to ask about it.",
        "source": "T25n1509_036:0322c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】佛告舍利弗：「菩薩摩訶薩從初發意行六波羅蜜，住空、無相、無作法，能過一切聲聞、辟支佛地，住阿毘跋致地，淨佛道。」",
        "translation": "[Sutra] The Buddha told Śāriputra, \"When a bodhisattva Mahāsattva first arouses the intention to practice the six perfections and abides in emptiness, signlessness, and unconstructedness, he's able to transcend the stages of all the śrāvakas and pratyekbuddhas and abide in the stage of abhivarśana, which is the pure buddha path.\"",
        "source": "T25n1509_036:0322c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：是三事後品中各有因緣，佛今何以併說？",
        "translation": "[Commentator] asked, \"These are the causes and conditions for each of the three latter qualities, so why would the Buddha explain them together now?",
        "source": "T25n1509_036:0322c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：是中略說，後當廣說三事因緣。",
        "translation": "Answer: This is a brief explanation, and the causes and conditions of the three things will be explained in detail later.",
        "source": "T25n1509_036:0322c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又今但說空、無相、無作因緣，後當說種種功德，故合說三事。",
        "translation": "Now, we've only talked about the causes and conditions for emptiness, signlessness, and noncontrivance, but we'll talk about the various virtues later, so we'll discuss the three things together.",
        "source": "T25n1509_036:0322c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：入三解脫門則到涅槃，今云何以空、無相、無作能過聲聞、辟支佛地？",
        "translation": "Q: After entering the three gates of liberation, then they'll reach nirvāṇa, so why is it that emptiness, signlessness, and noncontrivance can surpass the stages of śrāvakas and pratyekbuddhas?",
        "source": "T25n1509_036:0322c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無方便力故，入三解脫門，直取涅槃。",
        "translation": "Answer: Without the power of skillful means, they enter the gate of the three liberations and directly attain nirvāṇa.",
        "source": "T25n1509_036:0322c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有方便力，住三解脫門，見涅槃；以慈悲心故，能轉心還起，如後品中說。",
        "translation": "If someone has the power of skillful means to stand at the gate of the three liberations and see nirvāṇa, they'll be able to change their mind and return to it because of their compassionate mind, as explained in a later section.",
        "source": "T25n1509_036:0323a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如仰射虛空，箭箭相拄，不令墮地；菩薩如是，以智慧箭仰射三解脫虛空，以方便後箭射前箭，不令墮涅槃之地。",
        "translation": "Like shooting up into the sky with arrows pointed at each other, which doesn't cause them to fall to the ground, a bodhisattva thus shoots up into the sky with an arrow of wisdom about the three liberations and shoots the former arrow with a later arrow of skillful means, which doesn't cause him to fall to the land of nirvāṇa.",
        "source": "T25n1509_036:0323a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩雖見涅槃，直過不住，更期大事，所謂阿耨多羅三藐三菩提；今是觀時，非是證時。",
        "translation": "Although this bodhisattva sees nirvāṇa, he doesn't stop right past it and looks forward to the great matter known as unsurpassed, correct, and complete enlightenment; this is the time of contemplation, not the time of realization.",
        "source": "T25n1509_036:0323a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等應廣說。",
        "translation": "This and so forth should be explained in detail.",
        "source": "T25n1509_036:0323a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過是二地，知諸法不生不滅，即是阿毘跋致地。",
        "translation": "If someone goes beyond these two stages and knows that things don't arise or cease, they're in the stage of abhivartization.",
        "source": "T25n1509_036:0323a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住阿毘跋致地中，教化眾生、淨佛世界，是為能淨佛道。",
        "translation": "Abiding in the stage of abhivartization, teaching sentient beings and purifying the Buddha world is what purifies the Buddha Way.",
        "source": "T25n1509_036:0323a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩住三解脫門，觀四諦，知是聲聞、辟支佛法；直過四諦，入一諦，所謂一切法不生不滅、不垢不淨、不來不去等。",
        "translation": "Furthermore, when the bodhisattva abides in the gate of the three liberations, he observes the four truths and knows that they are the teachings of the śrāvakas and pratyekbuddhas, and he directly passes through the four truths and enters the single truth, which is to say that all things are neither produced nor ceased, neither defiled nor pure, and neither coming nor going.",
        "source": "T25n1509_036:0323a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入是一諦中，是名「阿毘跋致地」。",
        "translation": "Entering this single truth is called the ground of abhivartization.",
        "source": "T25n1509_036:0323a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住是阿毘跋致地，淨佛道地，滅除身、口、意麁惡之業，及滅諸法中從初已來所失之事，是名「淨佛道地」。",
        "translation": "Abiding in this state of abhivartization, which is the stage of the pure Buddha path, and ceasing the debilitating karma of body, speech, and thought and the things that have been lost since the beginning of time in all things, is called the \"stage of the pure Buddha path.\"",
        "source": "T25n1509_036:0323a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】舍利弗白佛言：「菩薩摩訶薩住何等地能為諸聲聞、辟支佛作福田？」",
        "translation": "[Sutra] Śāriputra said to the Buddha, \"What kind of stage does a bodhisattva-mahāsattva abide in that would make a field of merit for the śrāvakas and pratyekabuddhas?\"",
        "source": "T25n1509_036:0323a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：舍利弗深心恭敬菩薩，故今問：「菩薩漏結未盡，住何功德，能為諸聲聞辟支佛作福田？」",
        "translation": "[Commentary]: Śāriputra explained, \"What merit does the bodhisattva abide in when he deeply respects the bodhisattva and therefore asks, 'What merit does the bodhisattva abide in when he has not yet ended the bonds of contamination that make him a field of merit for the śrāvakas and pratyekabuddhas?'\"",
        "source": "T25n1509_036:0323a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】佛告舍利弗：「菩薩摩訶薩從初發意行六波羅蜜，乃至坐道場，於其中間常為諸聲聞、辟支佛作福田。」",
        "translation": "[Commentary] The Buddha told Śāriputra, \"From the time a bodhisattva first arouses his intention to practice the six perfections until he sits on the site of enlightenment, he always makes a field of merit for the śrāvakas and pratyekabuddhas in the interim.\"",
        "source": "T25n1509_036:0323a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：佛以是義示舍利弗：「雖三解脫門、涅槃事同，而菩薩有大慈悲，聲聞、辟支佛無；菩薩從初發心行六波羅蜜乃至十八不共法，欲度一切眾生、具一切佛法故勝。」",
        "translation": "[Commentary]: The Buddha explained this meaning to Śāriputra: \"Although the three approaches to liberation and nirvāṇa are the same, the bodhisattvas have great compassion that the śrāvakas and pratyekabuddhas don't have; from the time they first arouse their minds to practice the six perfections up to the eighteen uncommon dharmas, the bodhisattvas want to save all sentient beings and possess all the Buddha's teachings, so they are superior.\"",
        "source": "T25n1509_036:0323a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「何以故？",
        "translation": "[Sutra] \"Why is that?",
        "source": "T25n1509_036:0323a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以有菩薩摩訶薩因緣故，世間諸善法生。」",
        "translation": "It's because there are causes and conditions for the bodhisattva-mahāsattva that good dharmas in the world arise.\"",
        "source": "T25n1509_036:0323a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：佛先已以一因緣益，行眾行故，為諸聲聞、辟支佛作福田；今說菩薩外益因緣故，世間有一切諸善法。",
        "translation": "[Commentary] The explanation is: After the Buddha had already made a field of merit for the śrāvakas and pratyekabuddhas by performing numerous practices for the benefit of one cause, he now says that the external causes and conditions of the bodhisattva's benefits give rise to all the good qualities in the world.",
        "source": "T25n1509_036:0323b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0323b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩發心雖未成佛，令可度眾生住三乘道；不得三乘者令住十善道，何況成佛！",
        "translation": "Even though a bodhisattva has arisen the intention to become a buddha but has not yet done so, he causes sentient beings to abide in the path of the three vehicles; if he doesn't attain the three vehicles, he causes them to abide in the path of the ten good qualities, so how could he become a buddha?",
        "source": "T25n1509_036:0323b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：聲聞、辟支佛因緣故，亦使世間得善法，何以但說菩薩能令世間有善法？",
        "translation": "Q: śrāvakas and pratyekabuddhas also cause the world to attain good qualities because of their causes, so why is it only said that bodhisattvas can cause the world to have good qualities?",
        "source": "T25n1509_036:0323b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：因聲聞、辟支佛世間有善法者，亦皆由菩薩故有。",
        "translation": "Answer: \"It's because the śrāvakas and pratyekabuddhas have good qualities in the world, and they all have them because of the bodhisattvas.",
        "source": "T25n1509_036:0323b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩不發心者，世間尚無佛道，何況聲聞、辟支佛！",
        "translation": "If bodhisattvas didn't arouse their minds, there would still be no Buddhahood in the world, so why would there be śrāvakas and pratyekabuddhas?",
        "source": "T25n1509_036:0323b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛道是聲聞、辟支佛根本故。",
        "translation": "\"The Buddha Way is the root of śrāvakas and pratyekabuddhas.",
        "source": "T25n1509_036:0323b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，雖因聲聞、辟支佛有善法，少，以少故不說。",
        "translation": "Furthermore, even though it's because śrāvakas and pratyekabuddhas have good qualities, they have few, and it's because they have few that they don't teach them.",
        "source": "T25n1509_036:0323b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尚不說聲聞、辟支佛，何況外道諸師！",
        "translation": "How could it be possible for non-Buddhist teachers to say nothing about śrāvakas and pratyekabuddhas?",
        "source": "T25n1509_036:0323b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「何等是善法？",
        "translation": "[Sutra] \"What's a good dharma?",
        "source": "T25n1509_036:0323b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂十善道、五戒、八分成就齋，四禪、四無量心、四無色定，四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，盡現於世；以菩薩因緣故，六波羅蜜、十八空，佛十力、四無所畏、四無礙智、十八不共法、大慈、大悲、一切種智，盡現於世；以菩薩因緣故，有剎利大姓、婆羅門大姓、居士大家，四天王天乃至非有想非無想天，皆現於世；以菩薩因緣故，有須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、佛，皆現於世。」",
        "translation": "所謂十善道、五戒、八分成就齋，四禪、四無量心、四無色定，四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，盡現於世；以菩薩因緣故，六波羅蜜、十八空，佛十力、四無所畏、四無礙智、十八不共法、大慈、大悲、一切種智，盡現於世；以菩薩因緣故，有剎利大姓、婆羅門大姓、居士大家，四天王天乃至非有想非無想天，皆現於世；以菩薩因緣故，有須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、佛，皆現於世。」",
        "source": "T25n1509_036:0323b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：以菩薩因緣故有善法於世，可爾；剎利大姓、婆羅門大姓、居士大家，若世無菩薩亦有此貴姓，云何言皆從菩薩生？",
        "translation": "[Commentary] Q: It's true that there are good qualities in the world because of the causes and conditions of bodhisattvas; but if there were no bodhisattvas in the world and there were such noble families, how would it be possible to say that they all arise from bodhisattvas?",
        "source": "T25n1509_036:0323b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：以菩薩因緣故，世間有五戒、十善、八齋等；是法有上、中、下：上者得道，中者生天，下者為人，故有剎利大姓、婆羅門大姓、居士大家。",
        "translation": "Answer: \"Because of the bodhisattva's causes and conditions, there are the five precepts, ten good qualities, eight observances, and so forth in the world; these things are superior, middling, and inferior: the superior attains the way, the middling is born in heaven, and the inferior becomes human, so there's the great family of the bhadra, the great family of the brāhmaṇas, and the great family of the householders.",
        "source": "T25n1509_036:0323b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：若世無菩薩，世間亦有五戒、十善、八齋、剎利等大姓！",
        "translation": "He asked, \"If there were no bodhisattvas in the world, would there be great families of people who observe the five precepts, the ten good qualities, the eight observances, and the bhadra [precepts]?",
        "source": "T25n1509_036:0323b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：菩薩受身種種，或時受業因緣身、或受變化身，於世間教化，說諸善法及世界法、王法、世俗法、出家法、在家法、種類法、居家法，憐愍眾生、護持世界，雖無菩薩法，常行世法。",
        "translation": "Answer: A bodhisattva receives a variety of bodies, sometimes a body that's the result of actions or a body that's undergoing transformation, teaches and educates the world about good qualities, worldly qualities, kingly qualities, secular qualities, religious qualities, lay teachings, domestic teachings, various kinds of teachings, and household teachings, takes pity on sentient beings, protects the world, and always practices worldly teachings even though there are no bodhisattva teachings.",
        "source": "T25n1509_036:0323c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，皆從菩薩有。",
        "translation": "Because of these causes and conditions, they all exist from the bodhisattva.",
        "source": "T25n1509_036:0323c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：菩薩清淨、行大慈悲，云何說世俗諸雜法？",
        "translation": "Q: How do bodhisattvas who are pure and practice great compassion explain the miscellaneous worldly dharmas?",
        "source": "T25n1509_036:0323c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有二種菩薩：一者、行慈悲直入菩薩道；二者、敗壞菩薩，亦有悲心，治以國法，無所貪利，雖有所惱，所安者多，治一惡人，以成一家——如是立法，人雖不名為清淨菩薩，得名敗壞菩薩。",
        "translation": "Answer: There are two kinds of bodhisattvas: those who practice compassion and enter the bodhisattva path directly and those who are corrupt bodhisattvas who also have compassion and rule countries and dharmas without craving for profit and who, despite being troubled, are comfortable with many things, rule one evil person to make a family - such legislation, though not called a pure bodhisattva, can be called a corrupt bodhisattva.",
        "source": "T25n1509_036:0323c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，皆由菩薩有。",
        "translation": "Because of these causes and conditions, they all come from the bodhisattva's possessions.",
        "source": "T25n1509_036:0323c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間諸富貴皆從二乘道有，二乘道從佛有，佛因菩薩有。",
        "translation": "All the world's wealth and prosperity come from the two-vehicle path, the two-vehicle path comes from the Buddha, and the Buddha comes because of the bodhisattva.",
        "source": "T25n1509_036:0323c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無菩薩說善法者，世間無有天道、人道、阿修羅道，無有樂受、不苦不樂受，但有苦受，常有地獄啼哭之聲。",
        "translation": "If there were no bodhisattvas who taught the good Dharma, there would be no heavenly, human, or asura paths in the world, no pleasant feelings or feelings that aren't painful or pleasant, but only painful feelings and the constant sound of lamentation in hell.",
        "source": "T25n1509_036:0323c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是大利益故，云何不名為世間作福田！",
        "translation": "Because a bodhisattva thus greatly benefits, why isn't he called a field of merit in the world?",
        "source": "T25n1509_036:0323c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗聞是菩薩有大功德，應當供養，心念：「煩惱未盡，雖有大福，不能消其供養。",
        "translation": "When Śāriputra heard that this bodhisattva had great merit and should make offerings, he thought, \"Although I have great fortune and haven't yet ended my afflictions, I can't eliminate my offerings.",
        "source": "T25n1509_036:0323c17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人雖噉好食，以內有病故，不能消化。」",
        "translation": "It's like a person who eats good food but can't digest it because of an internal illness.\"",
        "source": "T25n1509_036:0323c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故——【經】舍利弗白佛言：「菩薩摩訶薩淨畢施福不？」",
        "translation": "For this reason ... [Sutra] Śāriputra said to the Buddha, \"Does the bodhisattva Mahāsattva purify the merits of making offerings?\"",
        "source": "T25n1509_036:0323c20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「不也！",
        "translation": "The Buddha said, \"No!",
        "source": "T25n1509_036:0323c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0323c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本以淨畢故。」",
        "translation": "It's because the root is pure and complete.\"",
        "source": "T25n1509_036:0323c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：以菩薩從初發心時，便為一切眾生供養之上首。",
        "translation": "[Commentary] It's explained that from the very beginning, when a bodhisattva first arouses his intention, he's the head of offerings to all sentient beings.",
        "source": "T25n1509_036:0323c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0323c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以決定為無量無邊阿僧祇眾生代受勤苦。",
        "translation": "He's determined to undertake the hard work of sentient beings of measureless and limitless duration.",
        "source": "T25n1509_036:0323c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又利益無量阿僧祇眾生，令得度脫。",
        "translation": "It also benefits measureless incalculable sentient beings and causes them to be liberated.",
        "source": "T25n1509_036:0323c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲取一切諸佛法大智慧力故，能令世間即是涅槃。",
        "translation": "Because he wants to grasp the power of the great wisdom of all the Buddha's teachings, he can cause the world to be nirvāṇa.",
        "source": "T25n1509_036:0323c26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是種種因緣故言「本已淨畢」。",
        "translation": "For these reasons, he says, \"The past has been purified.\"",
        "source": "T25n1509_036:0323c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛重說消施因緣故。",
        "translation": "Furthermore, the Buddha again explained the causes and conditions for eliminating charity.",
        "source": "T25n1509_036:0323c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「舍利弗！",
        "translation": "[Sutra] \"Śāriputra!",
        "source": "T25n1509_036:0323c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩為大施主，施何等？",
        "translation": "What kind of gift does the bodhisattva Mahāsattva give as a great donor?",
        "source": "T25n1509_036:0323c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "施諸善法。",
        "translation": "\"Give generosity to good dharmas.",
        "source": "T25n1509_036:0324a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等善法？",
        "translation": "What are these good qualities?",
        "source": "T25n1509_036:0324a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十善道、五戒乃至十八不共法、一切種智，以是施與。」",
        "translation": "These are the ten good paths, the five precepts, up to the 18 distinctive qualities, and all-inclusive wisdom with which to bestow them.\"",
        "source": "T25n1509_036:0324a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：先說「由菩薩因緣，世間有善法」，今說「菩薩施善法之主」，是為差別。",
        "translation": "[Commentary]: It's a difference between saying, \"It's because of the bodhisattva's causes that there are good qualities in the world,\" and now saying, \"The bodhisattva gives to the lord of good qualities.\"",
        "source": "T25n1509_036:0324a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】舍利弗白佛言：「世尊！",
        "translation": "[Commentary] Śāriputra said to the Buddha, \"Bhagavān!",
        "source": "T25n1509_036:0324a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩云何習應般若波羅蜜，與般若波羅蜜相應？」",
        "translation": "How does a bodhisattva Mahāsattva cultivate the perfection of response and is associated with the perfection of response?\"",
        "source": "T25n1509_036:0324a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：上說「一日修般若波羅蜜勝聲聞、辟支佛」，從是因緣來，佛種種讚歎菩薩。",
        "translation": "[Commentary]: He said, \"One day's practice of the perfection of wisdom is superior to that of śrāvakas and pratyekabuddhas,\" and it's from these causes and conditions that the Buddha praises bodhisattvas in various ways.",
        "source": "T25n1509_036:0324a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是大功德皆從般若波羅蜜生，是故今問：「云何菩薩習行是般若波羅蜜，與般若波羅蜜相應？」",
        "translation": "Such great virtues all arise from the perfection of wisdom, so now I ask, \"How does a bodhisattva's practice of this perfection of wisdom correspond to the perfection of wisdom?\"",
        "source": "T25n1509_036:0324a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，舍利弗知般若波羅蜜難行難得、如幻如化、難可受持，恐行者違錯，故問習應。",
        "translation": "Furthermore, Śāriputra knew that the perfection of wisdom was difficult to practice, difficult to attain, illusory, transformative, and difficult to maintain, so he asked whether it should be practiced, lest practitioners might mistakenly practice it.",
        "source": "T25n1509_036:0324a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】佛告舍利弗：「菩薩摩訶薩習應色空，是名與般若波羅蜜相應；習應受、想、行、識空，是名與般若波羅蜜相應。",
        "translation": "[Sutra] The Buddha told Śāriputra, \"It's called associated with the perfection of wisdom when a bodhisattva-mahāsattva accords with the emptiness of form, and it's called associated with the perfection of wisdom when he accords with the emptiness of feeling, perception, volition, and consciousness.",
        "source": "T25n1509_036:0324a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T25n1509_036:0324a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩習應眼空，是名與般若波羅蜜相應；習應耳、鼻、舌、身、心空，是名與般若波羅蜜相應。",
        "translation": "When bodhisattvas and mahāsattvas accustom themselves to the emptiness of the eye, this is called what's associated with the perfection of wisdom; when they accustom themselves to the emptiness of the ear, nose, tongue, body, and mind, this is called what's associated with the perfection of wisdom.",
        "source": "T25n1509_036:0324a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "習應色空，是名與般若波羅蜜相應；習應聲、香、味、觸、法空，是名與般若波羅蜜相應。",
        "translation": "Accumulating conformity to the emptiness of form is called conformity to the perfection of wisdom, and accumulating conformity to the emptiness of sound, smell, taste, touch, and dharmas is called conformity to the perfection of wisdom.",
        "source": "T25n1509_036:0324a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「習應眼界空、色界空、眼識界空，是名與般若波羅蜜相應；習應耳聲識界、鼻香識界、舌味識界、身觸識界、意法識界空，是名與般若波羅蜜相應。",
        "translation": "\"Accumulating conformity to the emptiness of the eye realm, the emptiness of the form realm, and the emptiness of the eye consciousness realm is called concomitant with the perfection of wisdom, and accumulating conformity to the emptiness of the ear consciousness realm of sound, the nasal consciousness realm of fragrance, the tongue consciousness realm of taste, the body consciousness realm of contact, and the mind consciousness realm of dharmas is called concomitant with the perfection of wisdom.",
        "source": "T25n1509_036:0324a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「習應苦空，是名與般若波羅蜜相應；習應集、滅、道空，是名與般若波羅蜜相應。",
        "translation": "\"Accumulation should be associated with the emptiness of suffering, which is called associated with the perfection of wisdom, and accumulation should be associated with the emptiness of arising, cessation, and the path, which is called associated with the perfection of wisdom.",
        "source": "T25n1509_036:0324a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「習應無明空，是名與般若波羅蜜相應；習應行、識、名色、六處、觸、受、愛、取、有、生、老死空，是名與般若波羅蜜相應。",
        "translation": "\"Accumulation should be associated with the emptiness of nescience, which is called associated with the perfection of wisdom, and accumulation should be associated with the emptiness of volition, consciousness, name-and-form, the six sense-fields, contact, feeling, craving, appropriation, existence, birth, and old-death, which is called associated with the perfection of wisdom.",
        "source": "T25n1509_036:0324a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「習應一切諸法空，若有為、若無為空，是名與般若波羅蜜相應。」",
        "translation": "\"To cultivate the emptiness of all things, whether an existent or an inessential one, is called associated with the perfection of wisdom.\"",
        "source": "T25n1509_036:0324a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：五眾者，色、受、想、行、識。",
        "translation": "[Commentary]: The explanation says, \"The five aggregates are form, feeling, perception, volition, and consciousness.",
        "source": "T25n1509_036:0324b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色眾者，是可見法；是色因緣故，亦有不可見有對；有對雖不可見，亦名為色。",
        "translation": "Of these, form is a visible thing; because it's the cause and condition of form, there's also something invisible and opposable; although opposable, it's still called form.",
        "source": "T25n1509_036:0324b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如得道者名為道人；餘出家未得道者，亦名為道人。",
        "translation": "Such a person who has attained the way is called a person of the way, and others who have left home but haven't yet attained the way are also called people of the way.",
        "source": "T25n1509_036:0324b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是可見？",
        "translation": "What's visible?",
        "source": "T25n1509_036:0324b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一處，是可見有對色小分，一入攝。",
        "translation": "\"One place is a small part of visible and opposable form, which is included in one entry.",
        "source": "T25n1509_036:0324b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘九處及無作業，名不可見色。",
        "translation": "The other nine places and the absence of activity are called invisible form.",
        "source": "T25n1509_036:0324b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有對者十處，無對者唯無作色。",
        "translation": "There are ten places that are objectified, and the only thing that's unobstructed is unconstructed form.",
        "source": "T25n1509_036:0324b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有漏、無漏等分別亦如是。",
        "translation": "This is also true of contaminated, uncontaminated, and other discriminations.",
        "source": "T25n1509_036:0324b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經說：「色有三種：有色可見有對，有色不可見有對，有色不可見無對。」",
        "translation": "As the sūtras say, \"There are three kinds of form: form that's visible and has opposition, form that's invisible and has opposition, and form that's invisible and has no opposition.\"",
        "source": "T25n1509_036:0324b07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知非但眼見故是色，內外十處能起五識者皆名色；因是色分故生無作色。",
        "translation": "Therefore, you should know that not only is form visible to the eye, but the ten internal and external sense-fields that give rise to the five consciousnesses are all called form, and it's because of these form components that unconstructed form arises.",
        "source": "T25n1509_036:0324b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四種色：內有受、不受，外有受、不受。",
        "translation": "There are also four kinds of form: internal form that's sensed and un-sensed, and external form that's sensed and un-sensed.",
        "source": "T25n1509_036:0324b11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五種色，所謂五塵。",
        "translation": "There are also five kinds of form, which are called the five dust motes.",
        "source": "T25n1509_036:0324b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一種色，如經說惱壞相。",
        "translation": "There's another kind of form, which is described in the sūtras as the characteristic of affliction.",
        "source": "T25n1509_036:0324b13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生身色名為惱壞相；非眾生色亦名惱壞相，惱相因緣故亦名惱。",
        "translation": "The form of a sentient being's body is called the characteristic of affliction, and the form of a non-sentient being is also called the characteristic of affliction, which is also called affliction because of its causes and conditions.",
        "source": "T25n1509_036:0324b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有身，則有飢、渴、寒、熱、老、病、刀、杖等苦。",
        "translation": "It's like when there's a body, then there's hunger, thirst, cold, heat, old age, illness, a knife, a stick, and other suffering.",
        "source": "T25n1509_036:0324b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二種色，所謂四大、四大造色；內色、外色，受色、不受色，繫色、不繫色，有色能生罪、有色能生福，業色、非業色，業色、果色，業色、報色，果色、報色，隱沒無記色、不隱沒無記色，可見色、不可見色，有對色、無對色，有漏色、無漏色。",
        "translation": "There are also two kinds of form, which are called the four major forms and the forms created by the four major forms, internal form and external form, feeling form and non-feeling form, bound form and non-bound form, form that produces sins with form and form that produces goodness with form, form of action and non-action, form of action and form of result, form of action and form of reward, form of result and form of reward, concealed and unconcealed indeterminate form, visible and invisible form, opposable and non-opposable form, and contaminated and uncontaminated form.",
        "source": "T25n1509_036:0324b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等二種分別色。",
        "translation": "These are the two kinds of discriminated form.",
        "source": "T25n1509_036:0324b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三種色，如上可見有對中說。",
        "translation": "There are three more kinds of form, which are explained above in the context of visible and opposable forms.",
        "source": "T25n1509_036:0324b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三種色：善色、不善色、無記色，學色、無學色、非學非無學色，從見諦所斷生色、從思惟所斷生色、從無斷生色。",
        "translation": "There are three more kinds of form: good form, unskillful form, and indeterminate form, learned form, unlearned form, and neither learned nor unlearned form, form that arises from the truth of seeing, form that arises from the contemplation of stopping, and form that arises from the lack of stopping.",
        "source": "T25n1509_036:0324b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三種色：欲界繫色、色界繫色、不繫色，有色能生貪欲、有色能生瞋恚、有色能生愚癡，三結、三漏等亦如是。",
        "translation": "There are three more kinds of form: form bound to the desire realm, form bound to the form realm, and form not bound to the form realm, and form that produces desire, form that produces anger, and form that produces delusion, as well as the three bonds, the three contaminants, and so forth.",
        "source": "T25n1509_036:0324b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有色能生不貪善根、不瞋善根、不愚癡善根；如是等諸三善根應廣說。",
        "translation": "There are forms that give rise to the good root of not craving, the good root of not angering, and the good root of not being foolish; these three good roots should be explained in detail.",
        "source": "T25n1509_036:0324b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有色能生隱沒無記法、能生不隱沒無記法——不隱沒無記有二種：有報生、有非報生者，如是等二種無記。",
        "translation": "There are forms that give rise to concealed indeterminacy and forms that give rise to unsubtle indeterminacy-and there are two kinds of unsubtle indeterminacy: those that are produced with retribution and those that are not produced with retribution, and these are the two kinds of indeterminacy.",
        "source": "T25n1509_036:0324b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四種色，如上受、不受中說；四大及造色三種——善、不善、無記；身業作、無作色、口業作、無作色；受色(受戒時得律儀色)、止色(惡不善禁止也)、用色(如眾僧受用檀越所施之物)、不用色(餘無用之色)。",
        "translation": "There are also four kinds of form, as described above in feeling and not feeling; three kinds of the four elements and the form they produce-good, ungood, and indeterminate; form created by physical action and non-action, form created by verbal action and non-action; and form received (the form that attains restraint when receiving the precepts), form stabilized (the prohibition against evil and unwholesome behavior), form used (such as the acceptance by the saṃgha of the things given by the donor), and form not used (the remaining useless forms).",
        "source": "T25n1509_036:0324c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等四種色。",
        "translation": "These are the four kinds of form.",
        "source": "T25n1509_036:0324c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五種色：身作、無作色，口作、無作色，及非業色；五情、五塵；麁色、動色、影色、像色、誑色。",
        "translation": "There are also five kinds of form: form created or uncreated by the body, form created or uncreated by speech, and form that's not karma; the five emotions and five objects; and crude form, moving form, shadow form, form of images, and form of deception.",
        "source": "T25n1509_036:0324c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「麁色」者，可見、可聞、可嗅、可味、可觸，如土石等。",
        "translation": "\"Debilitating forms\" are visible, audible, smellable, tastable, and tactile, such as dirt and rocks.",
        "source": "T25n1509_036:0324c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「動色」者有二種：一者、眾生動作，二者、非眾生動作——如水、火、風動作，地依他故動；下有大風動水，水動地。",
        "translation": "There are two kinds of \"moving form\": first, the movement of sentient beings and second, the movement of non-sentient beings-such as the movement of water, fire, and wind, and the earth moving because of others; down below, a great wind moves water, and water moves the earth.",
        "source": "T25n1509_036:0324c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風之動樹，如酒自沸動，如磁石吸鐵，如真珠、玉、車渠、馬碯夜能自行，皆是眾生先世福德業因緣，不可思議。",
        "translation": "When the wind moves a tree, it's like wine boiling on its own, like a magnet attracting iron, or like a genuine pearl, jade, chariot drain, or horse agate that moves on its own at night, it's all the result of the meritorious actions of sentient beings in prior lifetimes, which are inconceivable.",
        "source": "T25n1509_036:0324c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：影色、像色不應別說！",
        "translation": "He asked, \"Shouldn't shadow form and form of an image be explained separately?",
        "source": "T25n1509_036:0324c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0324c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼、光明對清淨鏡故，反自照見；影亦如是，遮光故影現，無更有法。",
        "translation": "\"The eye and light see themselves in response to a clear mirror, and so do shadows, which block out light and therefore present shadows, and there's nothing else.",
        "source": "T25n1509_036:0324c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：是事不然！",
        "translation": "He replied, \"That's not the case!",
        "source": "T25n1509_036:0324c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如油中見像黑，則非本色。",
        "translation": "\"If an image seen in oil is black, it's not its original color.",
        "source": "T25n1509_036:0324c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如五尺刀中，橫觀則面像廣，縱觀則面像長，則非本面。",
        "translation": "If a five-foot sword contains a broad face image when viewed horizontally and a long face image when viewed vertically, it's not the original face.",
        "source": "T25n1509_036:0324c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大秦水精中玷，玷中皆有面像，則非一面像。",
        "translation": "Like the stain in the water spirit of Daqin, there's an image of a face in each stain, but it's not a one-sided image.",
        "source": "T25n1509_036:0324c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，非還見本像。",
        "translation": "Because of these reasons, it's not possible to see the original image again.",
        "source": "T25n1509_036:0324c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，有鏡、有人、有持者、有光明，眾緣和合故有像生；若眾緣不具則像不生。",
        "translation": "Furthermore, when there's a mirror, a person, a bearer, and a light, the image comes into being because the various conditions combine, but if the various conditions aren't present, then the image doesn't come into being.",
        "source": "T25n1509_036:0324c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是像亦非無因緣，亦不在因緣中；如是別自有法，非是面也。",
        "translation": "This image is not without a cause or condition, nor is it in a cause or condition; it's thus a separate entity, not a face.",
        "source": "T25n1509_036:0324c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此微色，生法如是，不同麁色；如因火有煙，火滅煙在。",
        "translation": "This subtle form is thus produced, unlike crude form; it's like smoke that comes from a fire, and smoke remains when the fire goes out.",
        "source": "T25n1509_036:0324c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：若爾者，不應別說影！",
        "translation": "He asked, \"If that's the case, then we shouldn't be talking about shadows separately!",
        "source": "T25n1509_036:0324c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同是細色故。",
        "translation": "It's the same subtle form.",
        "source": "T25n1509_036:0324c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：鏡中像有種種色，影則一色，是故不同。",
        "translation": "Answer: An image in a mirror has various forms, but a shadow has one form; therefore, they're different.",
        "source": "T25n1509_036:0324c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二雖待形俱動，形質各異：影從遮明而現，像則從種種因緣生。",
        "translation": "Although these two things move together depending on form, their shape and quality are different: the shadow appears from obscuration, and the image arises from various causes and conditions.",
        "source": "T25n1509_036:0324c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖同細色，各各差別。",
        "translation": "Although they're the same subtle form, each is different from the other.",
        "source": "T25n1509_036:0324c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「誑色」者，如炎、如幻、如化、如乾闥婆城等，遠誑人眼，近無所有。",
        "translation": "\"Deceiving form\" refers to things like heat, illusions, transformations, and the city of Gandhāra, which distantly deceive the human eye and nearly have nothing.",
        "source": "T25n1509_036:0325a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種無量色總名色眾。",
        "translation": "Such a variety of immeasurable forms is collectively called a mass of forms.",
        "source": "T25n1509_036:0325a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受眾者，如經說：「因眼緣色生眼識，三事和合故生觸，是觸即時三眾共生，所謂受、想、行。」",
        "translation": "Regarding the mass of sensations, as the sūtra explains, \"As a result of the eye's conditioned form, the eye consciousness arises, and the combination of the three things gives rise to contact, which is the common production of the three masses called sensation, perception, and volition.\"",
        "source": "T25n1509_036:0325a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：眼識亦與三眾作因，何以但說「觸」？",
        "translation": "Q: The visual consciousness also acts as a cause with the three aggregates, so why is it only \"contact\" that's being talked about?",
        "source": "T25n1509_036:0325a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：眼識少時住，見色便滅；次生意識，能分別色好醜。",
        "translation": "Answer: When the eye consciousness is rarely abiding, it ceases when it sees form; the next consciousness is activity, which can discern the good and ugly aspects of form.",
        "source": "T25n1509_036:0325a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不說眼識。",
        "translation": "That's why we don't talk about the eye consciousness.",
        "source": "T25n1509_036:0325a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因眼、色、識三事和合故生觸，觸生心數法。",
        "translation": "It's because the combination of the three things - eye, form, and consciousness - that contact arises, and contact gives rise to mental factors.",
        "source": "T25n1509_036:0325a08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼識因緣遠故不說。",
        "translation": "Because the eye consciousness is remote in its causes and conditions, it's not explained.",
        "source": "T25n1509_036:0325a09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：一切識皆有觸，何以但「觸因緣生心數法」？",
        "translation": "Q: All consciousnesses have contact, so why is it only \"contact that gives rise to mental factors as a cause and condition\"?",
        "source": "T25n1509_036:0325a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：心有二種：一者、念念生滅心，二者、次第相續心。",
        "translation": "Answer: There are two kinds of mind: the mind that arises and ceases from moment to moment and the mind that continues in sequence.",
        "source": "T25n1509_036:0325a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸亦如是，次第相續觸麁故，說因觸生心數法；念念觸微細，亦共生心數法，不了故不說。",
        "translation": "Thus, contact is also like this: because sequential contact is crude, it's said that mental factors arise from contact; moment-to-moment contact is subtle, and mental factors arise together, but it's not explained because it's not comprehensible.",
        "source": "T25n1509_036:0325a11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若情、塵、識三事和合能受苦樂，爾時觸法了了，以是故說因觸生心數法。",
        "translation": "If the combination of three things - sensation, dust, and consciousness - can cause pain and pleasure, then the mental factors arising from contact are fully comprehended; therefore, it's said that the mental factors arising from contact are the result of that.",
        "source": "T25n1509_036:0325a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色法從因緣和合生；心數法亦如是，從觸法和合生。",
        "translation": "Just as form dharmas arise from the combination of causes and conditions, so mind-numbered dharmas arise from the combination of contact dharmas.",
        "source": "T25n1509_036:0325a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色法從和合生，無和合則不生；心數法亦如是，有觸則生，無觸則不生。",
        "translation": "As form dharmas arise from combination and don't arise without combination, so mind dharmas arise with contact and don't arise without contact.",
        "source": "T25n1509_036:0325a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此受眾：一種，所謂受相。",
        "translation": "There are many kinds of sensation: one kind, which is called the characteristic of sensation.",
        "source": "T25n1509_036:0325a18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二種受：身受、心受，內受、外受，麁、細，遠、近，淨、不淨等。",
        "translation": "There are two more kinds of sensations: bodily sensations and mental sensations, internal sensations and external sensations, crude and fine, distant and near, pure and impure, and so forth.",
        "source": "T25n1509_036:0325a19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三種受：苦、樂、不苦不樂；善、不善、無記；學、無學、非學非無學；見諦所斷、思惟所斷、不斷；因見諦所斷生受、因思惟所斷生受、因不斷生受；或因身見生、不還與身見作因，或因身見生、還與身見作因，或不因身見生、不還與身見作因；復有三種受：欲界繫、色界繫、無色界繫。",
        "translation": "There are three more kinds of feelings: painful, pleasant, neither painful nor pleasant; good, unwholesome, and indeterminate; training, no training, neither training nor no training; feelings that are ended in the seeing truth, that are ended in contemplation, and that are not ended; feelings that arise from being ended in the seeing truth, feelings that are ended in contemplation, and feelings that arise from not ending; feelings that arise either from a view of the body and don't return as a cause for a view of the body, or from a view of the body and do return as a cause for a view of the body, or that don't arise from a view of the body and don't return as a cause for a view of the body; and three more kinds of feelings: fetters in the desire realm, fetters in the form realm, and fetters in the formless realm.",
        "source": "T25n1509_036:0325a20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等三種受。",
        "translation": "These are the three kinds of sensation.",
        "source": "T25n1509_036:0325a27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四種受：內身受、外身受、內心受、外心受；四正勤、四如意足等相應受，及四流、四縛等相應受。",
        "translation": "There are also four kinds of feelings: feelings in the internal body, feelings in the external body, feelings in the internal mind, feelings in the external mind, feelings associated with the four correct endeavors and the four supernormal powers, and feelings associated with the four currents and four fetters.",
        "source": "T25n1509_036:0325a27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名四種受。",
        "translation": "These are called the four kinds of sensations.",
        "source": "T25n1509_036:0325a29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五種受：樂根、苦根、憂根、喜根、捨根；見苦所斷相應受，乃至思惟所斷相應受；五蓋、五結諸煩惱相應受亦如是。",
        "translation": "There are another five kinds of feelings: those associated with the faculty of pleasure, the faculty of pain, the faculty of sorrow, the faculty of joy, and the faculty of equanimity, those associated with seeing what's painful and those associated with contemplating what's painful, and those associated with the five hindrances and the five binding afflictions.",
        "source": "T25n1509_036:0325b01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有六受眾：六識相應受。",
        "translation": "There are also six more sensations: the sensation associated with the six consciousnesses.",
        "source": "T25n1509_036:0325b03_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有意識分別為十八受，所謂眼見色思惟分別心生喜，眼見色思惟分別心生憂，眼見色思惟分別心生捨，乃至意識亦如是。",
        "translation": "Also, there are the 18 sensations discriminated by the consciousness, which are described as the joy that arises from the mind that sees form and discerns it, the sadness that arises from the mind that sees form and discerns it, and the equanimity that arises from the mind that sees form and discerns it, and so it is with the consciousness.",
        "source": "T25n1509_036:0325b04_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是十八受中有淨、有垢，為三十六。",
        "translation": "Of these 18 sensations, there are 36 that are pure and 36 that are defiled.",
        "source": "T25n1509_036:0325b07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三世各有三十六，為百八。",
        "translation": "There are 36 in each of the three times, which are 108.",
        "source": "T25n1509_036:0325b08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種因緣分別受義無量，名為受眾。",
        "translation": "These various causes and conditions discern an infinite number of sensations, which are called the multitude of sensations.",
        "source": "T25n1509_036:0325b08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "想眾、相應行眾、識眾亦如是分別。",
        "translation": "The imagined multitude, the associated formative multitude, and the consciousness multitude are also discerned in this way.",
        "source": "T25n1509_036:0325b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0325b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與受眾相應故。",
        "translation": "It's because it's appropriate for the multitude of recipients.",
        "source": "T25n1509_036:0325b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛說有四種想：有小想、大想、無量想、無所有想。",
        "translation": "Furthermore, the Buddha teaches that there are four kinds of perceptions: small perception, large perception, immeasurable perception, and ungraspable perception.",
        "source": "T25n1509_036:0325b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「小想」者，覺知小法。",
        "translation": "\"Small conceptions\" are perceptions of small dharmas.",
        "source": "T25n1509_036:0325b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如說小法者，小欲、小信、小色、小緣相，名為「小想」。",
        "translation": "As it's said, those who perceive small qualities, small desires, small beliefs, small forms, and small perceptual forms are called \"small perceptions.\"",
        "source": "T25n1509_036:0325b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，欲界繫想名為「小」，色界繫想名為「大」，三無色天繫想名為「無量」，無所有處繫想是名「無所有想」。",
        "translation": "Furthermore, the perceptions bound to the desire realm are called \"small,\" the perceptions bound to the form realm are called \"large,\" the perceptions bound to the three formless heavens are called \"immeasurable,\" and the perceptions bound to the sphere of nothingness are called \"perceptions of nothingness.\"",
        "source": "T25n1509_036:0325b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，煩惱相應想名為「小想」，煩惱覆故；有漏無垢想名為「大想」；諸法實相想名為「無所有想」；無漏想名為「無量想」，為涅槃無量法故。",
        "translation": "Furthermore, conceptions associated with the afflictions are called \"minor conceptions\" because they cover the afflictions, contaminated and undefiled conceptions are called \"major conceptions,\" conceptions of the true characteristics of dharmas are called \"immeasurable conceptions,\" and uncontaminated conceptions are called \"immeasurable conceptions\" because they are the immeasurable dharmas of nirvāṇa.",
        "source": "T25n1509_036:0325b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛說有六想：「眼觸相應生想，乃至意觸相應生想。」",
        "translation": "Furthermore, the Buddha said there are six conceptions, which are \"conceptions associated with eye contact and conceptions associated with mental contact.\"",
        "source": "T25n1509_036:0325b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等名為想眾。",
        "translation": "Such-and-such are called the conceptual categories.",
        "source": "T25n1509_036:0325b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行眾者，佛或時說一切有為法名為行。",
        "translation": "The mass of conditioned phenomena is sometimes called conditioned phenomena by the Buddha when he teaches that all conditioned phenomena are conditioned phenomena.",
        "source": "T25n1509_036:0325b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或說三行：身行、口行、意行。",
        "translation": "Some say there are three ways: physical action, verbal action, and mental action.",
        "source": "T25n1509_036:0325b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「身行」者，出入息。",
        "translation": "\"Bodily action\" is movement in and out, and it's movement of breath.",
        "source": "T25n1509_036:0325b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0325b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "息屬身故。",
        "translation": "\"Breathing\" is because it's part of the body.",
        "source": "T25n1509_036:0325b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「口行」者，覺觀。",
        "translation": "\"Verbal action\" is perception and contemplation.",
        "source": "T25n1509_036:0325b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0325b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先覺觀，然後語言。",
        "translation": "First perception and contemplation, then speech.",
        "source": "T25n1509_036:0325b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「意行」者，受、想。",
        "translation": "\"Mentation and volition\" are feeling and perception.",
        "source": "T25n1509_036:0325b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0325b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受苦樂，取相心發，是名意行。",
        "translation": "To experience pain and pleasure and to grasp the characteristics of the mind's arising is called mental action.",
        "source": "T25n1509_036:0325b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心數法有二種：一者、屬見，二者、屬愛。",
        "translation": "There are two kinds of mental factors: those that are contingent on views and those that are contingent on emotions.",
        "source": "T25n1509_036:0325b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "屬愛主名為「受」，屬見主名為「想」。",
        "translation": "Those who belong to craving are called \"feelings\" and those who belong to views are called \"perceptions.\"",
        "source": "T25n1509_036:0325b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故說是二法為「意行」。",
        "translation": "Therefore, these two things are called \"mental formations.\"",
        "source": "T25n1509_036:0325b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛或說十二因緣中三行：福行、罪行、無動行。",
        "translation": "Some buddhas say that there are three actions among the 12 causes and conditions: the meritorious action, the sinful action, and the immovable action.",
        "source": "T25n1509_036:0325b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「福行」者，欲界繫善業；「罪行」者，不善業；「無動行」者，色、無色界繫業。",
        "translation": "\"Acts of merit\" are good actions bound to the desire realm, \"crimes\" are unskillful actions, and \"immovable actions\" are actions bound to the form and formless realms.",
        "source": "T25n1509_036:0325b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿毘曇除受、想，餘心數法及無想定、滅盡定等心不相應法，是名為行眾。",
        "translation": "The abhidharma, which is composed of mental factors other than feelings and perceptions and mental factors not associated with the concentrations of no-thought and cessation, is called the mass of conditioned formations.",
        "source": "T25n1509_036:0325c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識眾者，內外六入和合故生六覺，名為識；以內緣力大故，名為眼識乃至名為意識。",
        "translation": "The mass of consciousnesses, which are the six feelings that arise from the union of the six internal and external sense-fields, are called consciousnesses; they're called the visual consciousness and even the consciousness because the power of internal cognition is great.",
        "source": "T25n1509_036:0325c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：意即是識，云何意緣力故生意識？",
        "translation": "Q: Mentation is consciousness, so why is there business consciousness because of the power of the mind as a cognitive object?",
        "source": "T25n1509_036:0325c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：意生滅相故，多因前意故，緣法生意識。",
        "translation": "Answer: It's because the mind arises and ceases, and it's mostly because of the prior mind that conditioned phenomena give rise to consciousness.",
        "source": "T25n1509_036:0325c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：前意已滅，云何能生後識？",
        "translation": "Q: After the previous intention ceases, how can a subsequent consciousness arise?",
        "source": "T25n1509_036:0325c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：意有二種：一者、念念滅，二者、心次第相續名為一。",
        "translation": "Answer: There are two kinds of mind: first, mindfulness ceases, and second, the sequential succession of minds is called one.",
        "source": "T25n1509_036:0325c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是相續心故，諸心名為一意，是故依意而生識無咎。",
        "translation": "Because these are contiguous mental states, the states of mind are called one mind, so it's no fault that consciousness arises based on mind.",
        "source": "T25n1509_036:0325c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意識難解故，九十六種外道不說依意故生識，但以依神為本。",
        "translation": "Because the mind is difficult to understand, the ninety-six non-Buddhist doctrines don't say that consciousness arises based on the mind, but rely on the soul as the root.",
        "source": "T25n1509_036:0325c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此五眾，四念處中廣說。",
        "translation": "These five groups are discussed in detail in the four abodes of mindfulness.",
        "source": "T25n1509_036:0325c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0325c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身念處說色眾，受念處說受眾，心念處說識眾，法念處說想眾、行眾。",
        "translation": "The mindfulness of body teaches that there are multitudes of form, the mindfulness of feeling teaches that there are multitudes of feeling, the mindfulness of mind teaches that there are multitudes of consciousness, and the mindfulness of dharmas teaches that there are multitudes of perceptions and multitudes of conditioned phenomena.",
        "source": "T25n1509_036:0325c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：不應有五眾，但應有色眾、識眾！",
        "translation": "He asked, \"There shouldn't be five multitudes, but there should be multitudes of form and multitudes of consciousness!",
        "source": "T25n1509_036:0325c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識眾隨時分別故有異名，名為受、想、行。",
        "translation": "The many faculties of consciousness have different names because they can discriminate at any time, and they're called sensation, perception, and volition.",
        "source": "T25n1509_036:0325c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如不淨識名為煩惱，淨識名為善法。",
        "translation": "If a consciousness is impure, it's called an affliction, and a pure consciousness is called a good dharma.",
        "source": "T25n1509_036:0325c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不然！",
        "translation": "Answer: No!",
        "source": "T25n1509_036:0325c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "What is the reason?",
        "source": "T25n1509_036:0325c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若名異故實亦異；若無異法，名不應異。",
        "translation": "If names are different, then reality is also different; if there are no different things, names shouldn't be different.",
        "source": "T25n1509_036:0325c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若唯有心而無心法者，心不應有垢、有淨。",
        "translation": "If there's only mind and no mental factors, then the mind shouldn't be defiled or purified.",
        "source": "T25n1509_036:0325c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如清淨池水，狂象入中，令其混濁；若清水珠入，水即清淨，不得言水外無象、無珠。",
        "translation": "It's like a pure pond of water in which a mad elephant enters, causing it to become turbid; if a pearl of clear water enters, the water is clear, so you can't say there's no elephant or pearl outside of the water.",
        "source": "T25n1509_036:0325c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心亦如是，煩惱入故能令心濁；諸慈悲等善法入心，令心清淨。",
        "translation": "So it is with the mind, which can be made turbid by the entry of afflictions, and it's purified by the entry of good qualities like kindness and pity into the mind.",
        "source": "T25n1509_036:0325c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故不得言「煩惱、慈悲等法即是心」。",
        "translation": "Therefore, it's not permissible to say, \"Such things as affliction and kindness are the mind.\"",
        "source": "T25n1509_036:0325c23_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：汝不聞我先說「垢心即是煩惱，淨心即是善法」？",
        "translation": "Q: Have you not heard me say, 'The defiled mind is the afflictions, and the pure mind is the good dharmas'?",
        "source": "T25n1509_036:0325c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若垢心次第云何能生淨心？",
        "translation": "Answer: \"If the defiled mind proceeds, how can a pure mind arise?",
        "source": "T25n1509_036:0326a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨心次第云何當生垢心？",
        "translation": "What will become of the defiled mind in the sequence of purifying the mind?",
        "source": "T25n1509_036:0326a02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，是事不然！",
        "translation": "For this reason, this is not the case!",
        "source": "T25n1509_036:0326a03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝但知麁現之事，不知心數法；不可以不知故便謂為無，當知必有五眾。",
        "translation": "You only know crude manifestations but don't know the mental factors; you can't just say there are none because you don't know them, for you should know that there must be five of them.",
        "source": "T25n1509_036:0326a03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：若有者，何以不多不少但說五？",
        "translation": "He asked, \"If there are, why are there only five, no more and no less?",
        "source": "T25n1509_036:0326a05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸法各有定限。",
        "translation": "Answer: \"There are definite limits to each method.",
        "source": "T25n1509_036:0326a06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如手法五指，不得求其多少。",
        "translation": "Like the man's five fingers, it's not possible to find out how many of them there are.",
        "source": "T25n1509_036:0326a06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，有為法雖復無量，佛分判為五分則盡。",
        "translation": "Furthermore, although there are countless existent dharmas, the Buddha's division of them into five parts is exhausted.",
        "source": "T25n1509_036:0326a07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：若爾者，何以故復說十二入、十八界？",
        "translation": "Q: If that's the case, why are the 12 sense-fields and 18 elements again explained?",
        "source": "T25n1509_036:0326a08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：眾義應爾；入、界義異。",
        "translation": "Answer: \"So it should be; the meaning of entry and element are different.",
        "source": "T25n1509_036:0326a09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為法王，為眾生故，或時略說、或時廣說。",
        "translation": "As the king of the Dharma, the Buddha sometimes explains them briefly or sometimes extensively for the sake of sentient beings.",
        "source": "T25n1509_036:0326a10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有眾生於色、識中不大邪惑，於心數法中多有錯謬，故說五眾。",
        "translation": "There are sentient beings who don't have mistaken confusion in form and consciousness but who have many errors in mental factors, so he explains the five multitudes.",
        "source": "T25n1509_036:0326a11_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有眾生心、心數法中不生邪惑，但惑於色；為是眾生故，說色為十處，心、心數法總說二處。",
        "translation": "There are sentient beings who aren't mistakenly confused in the mind and mental factors but are confused in form; for these sentient beings, form is described as one of the ten abodes, and the mind and mental factors are generally described as two abodes.",
        "source": "T25n1509_036:0326a12_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生於心數法中少生邪惑，而多不了色、心；為是眾生故，說心數法為一界，色、心為十七界。",
        "translation": "Sometimes there are sentient beings who give rise to a little bit of wrong mental confusion but don't know much about form and mind; for such sentient beings, it's said that mental factors are one realm and form and mind are 17 realms.",
        "source": "T25n1509_036:0326a14_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生不知世間苦法生滅、不知離苦道；為是眾生故說四諦：世間及身皆為是苦，愛等煩惱是苦因，煩惱滅是苦滅，滅煩惱方便法是名道。",
        "translation": "Some sentient beings don't know that the world's painful dharmas arise and cease and don't know the path to escape from suffering; for the sake of these sentient beings, they explain the four truths: the world and the body are all painful, afflictions like craving are the cause of suffering, the cessation of afflictions is the cessation of suffering, and the method of ceasing afflictions is called the path.",
        "source": "T25n1509_036:0326a17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有眾生著吾我故，於諸法中邪見生一、異相；或言世間無因無緣，或墮邪因緣；為是眾生故，說十二因緣。",
        "translation": "Some sentient beings may be attached to self and therefore have mistaken views about the things that are one and different, or they may say that the world has no causes and no conditions, or they may fall into mistaken causes and conditions; for the sake of these sentient beings, they explain the twelve causes and conditions.",
        "source": "T25n1509_036:0326a20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人說常法：或說神常，或說一切法常，但滅時隱藏微細，非是無也，若得因緣會還出，更無異法。",
        "translation": "Some people say that the Dharma of permanence is permanent: some say the soul is permanent, or they say all things are permanent, but when it ceases, it's hidden and subtle, not nonexistent, and if causes and conditions were available, it would come back out, and there would be no different dharma.",
        "source": "T25n1509_036:0326a23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是人故，說：「一切有為法皆是作法，無有常定。",
        "translation": "For this reason, people say, \"All the things that exist are created things, and there's no permanence or certainty.",
        "source": "T25n1509_036:0326a25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如木人，種種機關，木楔和合故能動作，無有實事，是名有為法。」",
        "translation": "They're like wooden figures with various organs that move because the wood wedges fit together; there's no real thing, and this is called a conditioned dharma.\"",
        "source": "T25n1509_036:0326a26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：是中說五眾有何次第？",
        "translation": "Q: What order does this explain for the five groups?",
        "source": "T25n1509_036:0326a28_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：行者初習觀法，先觀麁法，知身不淨、無常、苦、空、無我等，身患如是。",
        "translation": "Answer: When a practitioner first learns to observe the Dharma, he first observes the crude dharmas and knows that the body is impure, impermanent, painful, empty, and without self, and that the body suffers from such things.",
        "source": "T25n1509_036:0326a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生所以著此身者，以能生樂故；諦觀此樂，有無量苦常隨逐之，此樂亦無常、空、無我等。",
        "translation": "That's why sentient beings are attached to this body, because it produces pleasure; when they observe that pleasure, there are measureless sufferings that always follow it, and that pleasure is also impermanent, empty, and without self.",
        "source": "T25n1509_036:0326b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六塵中有無量苦，眾生何因緣生著？",
        "translation": "What are the causes and conditions for sentient beings to become attached to the measureless suffering in the six dust motes?",
        "source": "T25n1509_036:0326b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以眾生取相故著。",
        "translation": "\"It's because sentient beings grasp to characteristics and thus become attached.",
        "source": "T25n1509_036:0326b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人身一種偏有所著，能沒命隨死取相。",
        "translation": "As a human being who has partial attachments of one kind, they can lose their lives and grasp the marks of death.",
        "source": "T25n1509_036:0326b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受苦樂，發動生思等諸行。",
        "translation": "When they experience pain and pleasure, it triggers the mind to generate actions such as contemplation.",
        "source": "T25n1509_036:0326b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心行發動時，識知離苦得樂方便，是為識。",
        "translation": "When mental actions are motivated, consciousness knows the method of escaping suffering and attaining happiness, which is called consciousness.",
        "source": "T25n1509_036:0326b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，眾生，五欲因緣，故受苦樂；取相因緣，故深著是樂；以深著樂故，或起三毒、若三善根，是名為行；識為其主，受用上事。",
        "translation": "Furthermore, because of the five desires as causes, sentient beings experience pain and pleasure; because they grasp characteristics as causes, they become deeply attached to these pleasures; because they're deeply attached to these pleasures, they may give rise to the three poisons or the three good roots, which are called actions; and consciousness is their master and experiences these things.",
        "source": "T25n1509_036:0326b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五欲即是色，色是根本，故初說色眾，餘次第有名。",
        "translation": "The five desires are form, and form is fundamental; therefore, the first group of form is described, and the others are named in order.",
        "source": "T25n1509_036:0326b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘入、界諸法等皆由五眾次第有，唯法入、法界中增無為法，四諦中增智緣滅。",
        "translation": "The other things that enter and form are all produced in sequence from the five aggregates, except for the fact that the Dharma entry and the Dharma realm contain additional unproductive dharmas, and the four truths contain additional cognitive conditions for cessation.",
        "source": "T25n1509_036:0326b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入、界，乃至有為、無為法如上說。",
        "translation": "Entry, the realm, and even the existent and inactive dharmas are as explained above.",
        "source": "T25n1509_036:0326b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今五眾等諸法皆是空。",
        "translation": "Now, the five aggregates and other things are all empty.",
        "source": "T25n1509_036:0326b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0326b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖主說故。",
        "translation": "\"It's because the holy lord says so.",
        "source": "T25n1509_036:0326b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖有三種下、中、上，佛為其主。",
        "translation": "There are three kinds of sages: lower, middle, and higher, and the Buddha is their lord.",
        "source": "T25n1509_036:0326b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如星宿月中，日為其最，光明大故。",
        "translation": "Like the stars, constellations, and moon, the sun is the greatest of them all, and its light is great.",
        "source": "T25n1509_036:0326b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛得一切智慧故名為聖主。",
        "translation": "Because the Buddha has attained all wisdom, he's called the noble lord.",
        "source": "T25n1509_036:0326b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖主所說故，應當是實。",
        "translation": "Therefore, what the noble lord says should be true.",
        "source": "T25n1509_036:0326b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，以有十八空故一切法空。",
        "translation": "Furthermore, it's because there are 18 kinds of emptiness that all things are empty.",
        "source": "T25n1509_036:0326b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若但以性空能空一切法，何況十八！",
        "translation": "If the nature of things is empty because they are empty, how could the eighteen be empty?",
        "source": "T25n1509_036:0326b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以內空、外空能空一切法，何況十八！",
        "translation": "If internal emptiness and external emptiness can empty all dharmas, how much more the eighteen!",
        "source": "T25n1509_036:0326b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，若有法不空，應當有二種：色法、非色法。",
        "translation": "\"Furthermore, if things weren't empty, there would be two kinds: form dharmas and non-form dharmas.",
        "source": "T25n1509_036:0326b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是色法分別破裂乃至微塵，分別微塵亦不可得，終卒皆空。",
        "translation": "These are form dharmas that are discriminated and ruptured, even down to tiny particles, and discriminated tiny particles that are unobtainable and ultimately empty.",
        "source": "T25n1509_036:0326b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無色法，乃至念念生滅故皆空。",
        "translation": "... formless dharmas, even mindfulness of arising and ceasing, are empty.",
        "source": "T25n1509_036:0326b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如四念處中說。",
        "translation": "It's explained in the four abodes of mindfulness.",
        "source": "T25n1509_036:0326b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，諸法性空，但名字，因緣和合故有。",
        "translation": "\"Furthermore, while the nature of dharmas is empty, they only have names and exist because of the combination of causes and conditions.",
        "source": "T25n1509_036:0326b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如山、河、草、木、土地、人民、州郡、城邑名之為「國」，巷、里、市陌、廬館、宮殿名之為「都」，梁柱、椽棟、瓦竹、壁石名之為「殿」，上、中、下分和合名之為「柱」，片片和合故有「分」名，眾札和合故有「片」名，眾微和合故有「札」名。",
        "translation": "For example, mountains, rivers, grass, trees, land, people, counties, and cities are called \"countries,\" alleys, towns, cities, mansions, and palaces are called \"capitals,\" beams, rafters, tiles, bamboos, and walls and rocks are called \"halls,\" the upper, middle, and lower parts are combined, and the name \"pillars\" is given to the combination of pieces, the name \"parts\" is given to the combination of pieces, the name \"pieces\" is given to the combination of joints, and the name \"joints\" is given to the combination of particles.",
        "source": "T25n1509_036:0326b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是微塵有大、有中、有小：大者，遊塵可見；中者，諸天所見；小者，上聖人天眼所見。",
        "translation": "These tiny particles are large, medium, and small: large, which are visible to wandering dust; medium, which are seen by the gods; and small, which are seen by the divine eyes of the most noble people.",
        "source": "T25n1509_036:0326b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧眼觀之則無所見。",
        "translation": "When the eye of wisdom observes them, it sees nothing.",
        "source": "T25n1509_036:0326c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0326c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性實無故。",
        "translation": "Its nature is really nonexistent.",
        "source": "T25n1509_036:0326c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若微塵實有即是常，不可分裂、不可毀壞，火不能燒、水不能沒。",
        "translation": "If tiny particles really exist, they are permanent, indivisible, and indestructible, and they can't be burned by fire or sunk by water.",
        "source": "T25n1509_036:0326c03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，若微塵有形、無形二俱有過。",
        "translation": "Furthermore, if tiny particles have both form and formlessness, then there's something wrong with them.",
        "source": "T25n1509_036:0326c05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無形，云何是色？",
        "translation": "If it has no form, then how could it be form?",
        "source": "T25n1509_036:0326c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若微塵有形，則與虛空作分，亦有十方分；若有十方分，則不名為微。",
        "translation": "If tiny particles had form, then they would be part of space and would have parts in ten directions; if they had parts in ten directions, they wouldn't be called tiny.",
        "source": "T25n1509_036:0326c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛法中「色」，無有遠、近、麁、細是常者。",
        "translation": "In the Buddha's teaching on \"form,\" there's nothing distant, near, crude, or fine that's permanent.",
        "source": "T25n1509_036:0326c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，離是因緣名字則無有法。",
        "translation": "Furthermore, apart from these names of causes and conditions, there are no dharmas.",
        "source": "T25n1509_036:0326c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今除山、河、土地因緣名字更無國名，除廬里、道陌因緣名字則無都名，除梁椽、竹瓦因緣名字更無殿名，除三分因緣名字更無柱名，除片因緣名字則無分名，除札因緣名字則無片名，除眾微因緣名字則無札名，除中微塵名字則無大微塵名，除小微塵名字則無中微塵名，除天眼妄見則無小微塵名。",
        "translation": "Now, except for the names of mountains, rivers, and lands as causal conditions, there would be no country names, except for the names of li and roadways as causal conditions, there would be no capital names, except for the names of beams, rafters, and bamboo tiles as causal conditions, there would be no halls as causal conditions, except for the names of the three parts of a building, except for the names of the parts as causal conditions, except for the names of the pieces as causal conditions, except for the names of the pieces as causal conditions, except for the names of the particles as causal conditions, except for the names of the medium-sized particles, except for the names of the small particles, except for the names of the medium-sized particles, and except for the mistaken view of the divine eye, there would be no names of the small particles.",
        "source": "T25n1509_036:0326c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種因緣義故，知諸法畢竟空。",
        "translation": "Because of these various causal meanings, they know that all dharmas are ultimately empty.",
        "source": "T25n1509_036:0326c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：若法畢竟空，何以有名字？",
        "translation": "Q: If dharmas are ultimately empty, why do they have names?",
        "source": "T25n1509_036:0326c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：名字若是有，與法俱破；若無則不應難。",
        "translation": "Answer: \"If names exist, they break down with dharmas; if they don't, it shouldn't be difficult.",
        "source": "T25n1509_036:0326c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名字與法俱無有異，以是故知一切法空。",
        "translation": "There's nothing different between names and dharmas, so therefore we know that all dharmas are empty.",
        "source": "T25n1509_036:0326c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，一切法實空。",
        "translation": "Furthermore, all things are really empty.",
        "source": "T25n1509_036:0326c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0326c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有一法定故，皆從多法和合生。",
        "translation": "Because there's no single dharma, they all arise from the confluence of many dharmas.",
        "source": "T25n1509_036:0326c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無有一，亦無有多。",
        "translation": "If there were no one, there wouldn't be many.",
        "source": "T25n1509_036:0326c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如樹，根、莖、枝、葉和合故有假名樹；若無樹法，根、莖、枝、葉為誰和合？",
        "translation": "It's like a tree whose roots, stems, branches, and leaves combine to create a hypothetical tree; if there were no tree dharmas, who would the roots, stems, branches, and leaves be that would combine?",
        "source": "T25n1509_036:0326c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無和合則無一法；若無一法則亦無多，初一、後多故。",
        "translation": "If there's no union, then there's no single dharma, and if there's no single dharma, then there aren't many, because the first is one and the latter is many.",
        "source": "T25n1509_036:0326c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，一切諸觀語言戲論皆無實者，若世間常亦不然，世間無常亦不然；有眾生、無眾生，有邊、無邊，有我、無我，諸法實、諸法空皆不然。",
        "translation": "Furthermore, if all contemplations, words, and conceptualizations are without substance, it's not true that the world is permanent, nor is it true that the world is impermanent; it's not true that there are sentient beings and no sentient beings, that there are extremes and no extremes, that there's a self and no self, or that all things are real and all things are empty.",
        "source": "T25n1509_036:0326c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如先種種論議門中說。",
        "translation": "As explained in the previous discussion of various theories.",
        "source": "T25n1509_036:0326c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是諸觀戲論皆無者，云何不空？",
        "translation": "If all this contemplation and conceptualization is nonexistent, then why isn't it empty?",
        "source": "T25n1509_036:0326c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：汝言「諸法實、諸法空皆不然」者，今云何復言「諸法空」？",
        "translation": "Q: If you said, \"Neither the reality of dharmas nor the emptiness of dharmas is true,\" why do you now say, \"The emptiness of dharmas\" again?",
        "source": "T25n1509_036:0327a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有二種空：一者、說名字空，但破著有而不破空；二者、以空破有，亦無有空。",
        "translation": "Answer: There are two kinds of emptiness: first, when someone says the name is empty, they only refute attachment to existence but don't refute emptiness; second, when they use emptiness to refute existence, there's no emptiness.",
        "source": "T25n1509_036:0327a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如小劫盡時，刀兵、疾疫、飢餓，猶有人、物、鳥、獸、山、河；大劫燒時，山河樹木乃至金剛地下大水亦盡，劫火既滅，持水之風亦滅，一切廓然無有遺餘。",
        "translation": "When a minor eon is ended, there are swords, epidemics, and hunger, just like people, things, birds, animals, mountains, and rivers; when a major eon burns up, the mountains, rivers, trees, and even the great water beneath the vajra also end, and once the eon's fires go out, the winds that carry the water also cease, leaving nothing intact.",
        "source": "T25n1509_036:0327a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「空」亦如是，破諸法皆空，唯有「空」在，而取相著之。",
        "translation": "\"Emptiness\" is likewise, which destroys the idea that all things are empty and that only \"emptiness\" exists, and it's attached to that by imagining characteristics.",
        "source": "T25n1509_036:0327a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大空」者，破一切法，空亦復空。",
        "translation": "The \"great emptiness\" is the destruction of all things and the fact that emptiness is also empty.",
        "source": "T25n1509_036:0327a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故汝不應作是難！",
        "translation": "Therefore, you shouldn't make this objection!",
        "source": "T25n1509_036:0327a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若滅諸戲論，云何不空？",
        "translation": "If we extinguish conceptual proliferation, then why isn't it empty?",
        "source": "T25n1509_036:0327a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種因緣，處處說空，當知一切法空。",
        "translation": "From these various causes and conditions, emptiness is explained everywhere, so you should know that all things are empty.",
        "source": "T25n1509_036:0327a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「習」者：隨般若波羅蜜修習行觀，不息不休，是名為「習」。",
        "translation": "\"Accumulation\": Cultivating practice and contemplation in accord with the perfection of wisdom without stopping is called \"accumulation.\"",
        "source": "T25n1509_036:0327a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如弟子隨順師教、不違師意，是名「相應」。",
        "translation": "Like a disciple who follows his teacher's instructions and doesn't disobey his teacher's wishes, this is called \"concomitant.\"",
        "source": "T25n1509_036:0327a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如般若波羅蜜相，菩薩亦隨是相，以智慧觀，能得、能成就，不增不減，是名「相應」；譬如函、蓋，大小相稱。",
        "translation": "Just as the marks of the perfection of wisdom, the bodhisattva follows those marks and observes them with wisdom, observing that they can be attained and accomplished without increase or decrease, which is called \"concomitant.\" It's like a letter and a lid that are proportional in size.",
        "source": "T25n1509_036:0327a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖般若波羅蜜滅諸觀法，而智慧力故，名為無所不能、無所不觀；能如是知，不墮二邊，是為「與般若相應」。",
        "translation": "Although the perfection of wisdom extinguishes contemplations, the power of wisdom makes it possible to say that there's nothing that can't be observed and nothing that isn't observed; to be able to know it this way and not fall into two extremes is to be \"associated with prajñā.\"",
        "source": "T25n1509_036:0327a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「復次，舍利弗！",
        "translation": "[Sutra] \"Furthermore, Śāriputra!",
        "source": "T25n1509_036:0327a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩習應性空，是名與般若波羅蜜相應。",
        "translation": "The bodhisattva Mahāsattva's practice of emptiness in nature is called concomitant with prajñāpāramit.",
        "source": "T25n1509_036:0327a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T25n1509_036:0327a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜習應七空，所謂性空、自相空、諸法空、不可得空、無法空、有法空、無法有法空，是名與般若波羅蜜相應。」",
        "translation": "There are seven emptinesses that bodhisattvas, mahāsattvas, and practitioners of the perfection of wisdom should cultivate, which are called emptiness of nature, emptiness of own-identity, emptiness of dharmas, inaccessible emptiness, emptiness of nonexistence, emptiness of existent dharmas, and emptiness of nonexistence of dharmas, which are called associated with the perfection of wisdom.\"",
        "source": "T25n1509_036:0327a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：何以不說住十八空，但說住七空名與般若波羅蜜相應？",
        "translation": "[Commentator] asked, \"Why isn't it said that abiding in the 18 kinds of emptiness but only in the seven kinds of emptiness is called concomitant with prajñāparamit?",
        "source": "T25n1509_036:0327a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：佛法中廣說則十八空，略說則七空；如廣說助道法則有三十七品，略說則七覺分。",
        "translation": "Answer: In the Buddhist teaching, there are 18 kinds of emptiness when it's explained in detail and seven kinds of emptiness when it's explained in brief; for example, there are 37 categories of factors that aid in the path when it's explained in detail and seven factors of awakening when it's explained in brief.",
        "source": "T25n1509_036:0327a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，是七空多用利益眾生故。",
        "translation": "Furthermore, these seven kinds of emptiness are often used to benefit sentient beings.",
        "source": "T25n1509_036:0327a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如「大空」、「無始空」，或時有眾生起是邪見，為是故說。",
        "translation": "For example, the phrases \"great emptiness\" and \"beginningless emptiness\" may sometimes be mistakenly viewed by sentient beings, so they're explained for that reason.",
        "source": "T25n1509_036:0327a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「性空」者，一切諸法性本末尚自空，何況現在！",
        "translation": "\"Emptiness of nature\" means that the original and ultimate natures of all dharmas are still empty, so why wouldn't they be now?",
        "source": "T25n1509_036:0327b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣尚空，何況果報！",
        "translation": "Causes and conditions are still empty, so how can there be any rewards?",
        "source": "T25n1509_036:0327b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「自相空」者，諸法總相、別相盡觀其空，心則遠離。",
        "translation": "\"Emptiness of distinctive characteristics\" means to fully observe the emptiness of the general and specific characteristics of dharmas, and the mind is free of them.",
        "source": "T25n1509_036:0327b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用是二空，諸法皆空，是名「諸法空」。",
        "translation": "With these two kinds of emptiness, all things are empty, which is called the \"emptiness of dharmas.\"",
        "source": "T25n1509_036:0327b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從「性空」故有相，「相空」故諸法皆空；「諸法空」故，更無所得，是名「不可得空」。",
        "translation": "From \"emptiness of nature\" comes the existence of marks, and from \"emptiness of marks\" comes the emptiness of all dharmas; because \"all dharmas are empty,\" there's nothing more to attain, which is called \"unobtainable emptiness.\"",
        "source": "T25n1509_036:0327b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用是四種空破一切有法；若以有法、有相為過者，取於無法，是故說「無法空」。",
        "translation": "These four kinds of emptiness are used to refute all existent things; if someone takes it as a mistake to think that existent things and marks exist, they're grasping to nothing, which is why they say \"nothing is empty.\"",
        "source": "T25n1509_036:0327b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以無法為非，還欲取有法，是故說「有法空」。",
        "translation": "If someone takes what's not existent to be wrong and still wants to grasp what is existent, it's therefore called the 'emptiness of existent things.'",
        "source": "T25n1509_036:0327b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先說四空雖破有法，行者心則離有而存於無，是則說「無法空」。",
        "translation": "Although the four kinds of emptiness explained earlier destroy existent things, the practitioner's mind is free of existence and remains in nonexistence, which is why it's called \"emptiness of nonexistence.\"",
        "source": "T25n1509_036:0327b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說無法為非，心無所寄，還欲存有，是故略說「有法空」，以存有心薄故。",
        "translation": "If we say that nonexistence is wrong, the mind has no anchor but still wants to exist, so we briefly say \"the existence of dharmas is empty\" because the mind that exists is weak.",
        "source": "T25n1509_036:0327b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無法有法空」者，行者以無法空為非，心還疑有；若心觀有，還疑無法；是故有、無俱觀其空，如內外空觀。",
        "translation": "\"The emptiness of nonexistence and existence\" means that when a practitioner considers the emptiness of nonexistence to be wrong, the mind still doubts existence; if the mind observes existence, it still doubts nonexistence; therefore, it observes the emptiness of both existence and nonexistence, like observing internal and external emptiness.",
        "source": "T25n1509_036:0327b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故但說七空。",
        "translation": "Therefore, it's only explained that there are seven kinds of emptiness.",
        "source": "T25n1509_036:0327b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：汝言「知一切法空，滅諸觀，是名與般若波羅蜜相應」，如是觀是名相應，不如是觀則不相應，分別是非故，即亦是觀，云何言「滅」？",
        "translation": "Q: You say, \"To know the emptiness of all things and to contemplate their cessation is called concomitant with the perfection of wisdom,\" but such contemplation is called concomitant; contemplation that isn't so is not concomitant, and it's because of the discrimination of right and wrong that it's also contemplation, so how do you say \"cessation\"?",
        "source": "T25n1509_036:0327b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：以是故——【經】佛告舍利弗：「菩薩摩訶薩習應七空時，不見色若相應若不相應，不見受、想、行、識若相應若不相應；不見色若生相若滅相，不見受、想、行、識若生相若滅相；不見色若垢相若淨相，不見受、想、行、識若垢相若淨相。」",
        "translation": "Answer: Because of this... [Sutra] The Buddha told Śāriputra, \"When bodhisattvas, mahāsattvas, and practitioners of the seven kinds of emptiness, they don't see form as associated or unassociated, don't see feeling, perception, volition, and consciousness as associated or unassociated, don't see form as arisen, resemble cessation, don't see feeling, perception, volition, and consciousness as arisen, resemble cessation, and don't see form as defiled or purified, and don't see feeling, perception, volition, and consciousness as defiled or purified.\"",
        "source": "T25n1509_036:0327b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：「不見色若生相若滅相」者，不見五眾有生有滅。",
        "translation": "[Commentary] The explanation says, \"Not seeing form that arises similar to its cessation\" means not seeing the five aggregates in their aspect of arising and ceasing.",
        "source": "T25n1509_036:0327b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五眾有生滅相即墮斷滅中；墮斷滅故，則無罪無福；無罪無福故與禽獸無異。",
        "translation": "If the five aggregates have the marks of arising and ceasing, then they fall into extinction; because they fall into extinction, they have no guilt and no merit, and because they have no guilt and no merit, they're no different from animals.",
        "source": "T25n1509_036:0327b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不見色若垢若淨」，不見五眾有縛有解。",
        "translation": "\"Not seeing form as either defiled or pure\" doesn't reveal that the five aggregates have fetters and are freed.",
        "source": "T25n1509_036:0327b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五眾是縛性，無有得解脫者；若五眾是淨性者，則無有學道法。",
        "translation": "If the five aggregates were fettered in nature, there would be no one who attains liberation, and if the five aggregates were pure in nature, then there would be no path of training.",
        "source": "T25n1509_036:0327b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「不見色與受合，不見受與想合，不見想與行合，不見行與識合。",
        "translation": "[Sutra] \"I don't see form united with feeling, feeling united with perception, perception united with volition, and volition united with consciousness.",
        "source": "T25n1509_036:0327c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0327c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有法與法合者，其性空故。」",
        "translation": "There's no such thing as a dharma that combines with a dharma because its nature is empty.\"",
        "source": "T25n1509_036:0327c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：心、心數法無形，無形故則無住處，以是故色不與受合。",
        "translation": "[Treatise] explains, \"The mind and mental factors are formless, and because they're formless, there's no abode; therefore, form doesn't merge with sensation.",
        "source": "T25n1509_036:0327c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如四大及四大所造色二觸和合；心心數法中無觸法，故不得和合。",
        "translation": "Just as the four elements and the forms and two sensations created by the four elements combine, there's no sensation in the mind and mental factors, so they can't be combined.",
        "source": "T25n1509_036:0327c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：若爾者，何以說受、想、行、識不共和合？",
        "translation": "Q: If that's the case, then why do you say that feeling, perception, volition, and consciousness don't combine?",
        "source": "T25n1509_036:0327c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：佛此中自說無有法與法合者。",
        "translation": "Answer: The Buddha himself said here that there's no such thing as a teaching that's compatible with a teaching.",
        "source": "T25n1509_036:0327c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0327c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法性常空故。",
        "translation": "The nature of all dharmas is always empty.",
        "source": "T25n1509_036:0327c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無法與法合，亦無有離。",
        "translation": "If it's impossible to combine with a dharma, there's nothing to separate from.",
        "source": "T25n1509_036:0327c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛自說因緣：【經】「舍利弗！",
        "translation": "Furthermore, the Buddha himself explained the causes and conditions: [Sutra] \"Śāriputra!",
        "source": "T25n1509_036:0327c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色空中無有色，受、想、行，識空中無有識。」",
        "translation": "There's no form in form, and there's no form in feeling, perception, volition, or consciousness in consciousness.\"",
        "source": "T25n1509_036:0327c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：何以故？",
        "translation": "[Commentary] The explanation is: Why is that?",
        "source": "T25n1509_036:0327c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色與空相違。",
        "translation": "\"Form is at odds with emptiness.",
        "source": "T25n1509_036:0327c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若空來則滅色，云何色空中有色？",
        "translation": "If emptiness comes to annihilate form, then how could there be form in form and form in space?",
        "source": "T25n1509_036:0327c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如水中無火，火中無水，性相違故。",
        "translation": "It's like when there's no fire in water and no water in fire, because their natures are contradictory.",
        "source": "T25n1509_036:0327c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，有人言：「色非實空，行者入空三昧中見色為空。」",
        "translation": "Furthermore, some people say, \"Form is not truly empty, but practitioners who enter the samādhi of emptiness see form as empty.\"",
        "source": "T25n1509_036:0327c14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故言：「色空中都無有色；受、想、行、識亦如是。」",
        "translation": "That's why they say, 'There's no form in form; feeling, perception, volition, and consciousness are likewise.'\"",
        "source": "T25n1509_036:0327c15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「舍利弗！",
        "translation": "[Sutra] \"Śāriputra!",
        "source": "T25n1509_036:0327c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色空故無惱壞相，受空故無受相，想空故無知相，行空故無作相，識空故無覺相。」",
        "translation": "There's no mark of affliction because form is empty, no mark of sensation because sensation is empty, no mark of knowing because perception is empty, no mark of doing because form is empty, and no mark of awakening because consciousness is empty.\"",
        "source": "T25n1509_036:0327c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：此義有何次第？",
        "translation": "[Treatise] asked, \"What's the order of this meaning?",
        "source": "T25n1509_036:0327c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：先說五眾空中無五眾，今是中說其因緣。",
        "translation": "Answer: It was first said that there are no five multitudes in the sky, but now we're talking about their causes and conditions.",
        "source": "T25n1509_036:0327c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眾各各自相不可得故，故言「五眾空中無五眾」。",
        "translation": "Because the distinctive characteristics of each of the five aggregates are inapprehensible, it's said, 'There are no five aggregates in the sky.'",
        "source": "T25n1509_036:0327c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「何以故？",
        "translation": "[Sutra] \"Why is that?",
        "source": "T25n1509_036:0327c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_036:0327c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非色異空，非空異色，色即是空，空即是色；受、想、行、識亦如是。」",
        "translation": "Not form is different from emptiness, not emptiness is different from form, form is emptiness, and emptiness is form; feeling, perception, volition, and consciousness are likewise.\"",
        "source": "T25n1509_036:0327c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：佛重說因緣。",
        "translation": "[Commentary] The explanation says, \"The Buddha repeatedly explained causes and conditions.",
        "source": "T25n1509_036:0327c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五眾與空異，空中應有五眾；今五眾不異空、空不異五眾，五眾即是空、空即是五眾。",
        "translation": "If the five aggregates differed from emptiness, there would be five aggregates in emptiness; now, the five aggregates don't differ from emptiness, and emptiness doesn't differ from the five aggregates, so the five aggregates are emptiness and emptiness is the five aggregates.",
        "source": "T25n1509_036:0327c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故空不破五眾。",
        "translation": "Therefore, emptiness doesn't refute the five aggregates.",
        "source": "T25n1509_036:0327c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0327c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中佛自說因緣：【經】「舍利弗！",
        "translation": "Here, the Buddha himself explains the causes and conditions: [Sutra] \"Śāriputra!",
        "source": "T25n1509_036:0327c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸法空相，不生不滅、不垢不淨、不增不減，是空法，非過去、非未來、非現在。",
        "translation": "\"These things are empty in their characteristics, not arising or ceasing, undefiled or impure, neither increasing nor decreasing, and empty of dharmas, not in the past, not in the future, and not in the present.",
        "source": "T25n1509_036:0327c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故空中無色，無受、想、行、識，無眼、耳、鼻、舌、身、意，無色、聲、香、味、觸、法，無眼界乃至無意識界，無無明、亦無無明盡，乃至無老死，亦無老死盡，無苦、集、滅、道，亦無智、亦無得，無須陀洹、無須陀洹果，無斯陀含、無斯陀含果，無阿那含、無阿那含果，無阿羅漢、無阿羅漢果，無辟支佛、無辟支佛道，無佛、亦無佛道。",
        "translation": "Therefore, there's no form in the sky, no feeling, perception, volition, or consciousness, no eyes, ears, nose, tongue, body, or mind, no form, sound, odor, taste, touch, or dharma, no element of vision or even an element of consciousness, no ignorance and no end of ignorance, no old age and no end of old age, no suffering, origination, cessation, or the path, no knowledge and no attainment, no stream and no fruit of stream, no sakṛd-āgāmin and no fruit of sakṛd-āmin, no nonreturner and no fruit of nonreturner, no arhat and no fruit of arhat, no pratyekabuddha and no pratyekabuddha path, and no Buddha and no Buddha path.",
        "source": "T25n1509_036:0328a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_036:0328a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是習應，是名與般若波羅蜜相應。」",
        "translation": "This is called the association with the perfection of wisdom when it's thus cultivated by the bodhisattvas, the mahāsattvas, and the response.\"",
        "source": "T25n1509_036:0328a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：人皆知空中無所有，不生不滅、不垢不淨、不增不減，無一切法，佛何以分別說五眾等諸法各各空？",
        "translation": "[Treatise] asked, \"Everyone knows that existence is nonexistent, unarisen, undefiled, impure, undecaying, neither increasing nor decreasing, and lacking in all dharmas, so why does the Buddha discern that each of the five groups of dharmas is empty?",
        "source": "T25n1509_036:0328a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有人雖復習空，而想空中猶有諸法；如行慈人，雖無眾生而想眾生得樂，自得無量福故。",
        "translation": "Answer: \"Although some people still practice emptiness, they think there are still dharmas in the air; it's like a person who practices kindness, thinking that sentient beings will attain happiness even though there are no sentient beings, and they will attain measureless merit on their own.",
        "source": "T25n1509_036:0328a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故佛說：諸法性常自空，非空三昧故令法空——如水冷相，火令其熱。",
        "translation": "Therefore, the Buddha teaches that the nature of dharmas is always empty on its own, and it's not emptiness samādhi that makes dharmas empty-as when water is cold and fire makes it hot.",
        "source": "T25n1509_036:0328a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言「以空三昧故令法空」者，是事不然！",
        "translation": "If someone says, 'Empty samādhi makes things empty,' this is not the case!",
        "source": "T25n1509_036:0328a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「智」者，是無漏八智。",
        "translation": "\"Wisdom\" refers to the untainted eight kinds of cognition.",
        "source": "T25n1509_036:0328a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得」者，初得聖道須陀洹果乃至佛道。",
        "translation": "\"Attainment\" refers to the first attainment of the noble path, the fruit of stream entry, up to the Buddha path.",
        "source": "T25n1509_036:0328a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是義先已廣說。",
        "translation": "This meaning was explained in detail earlier.",
        "source": "T25n1509_036:0328a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「舍利弗！",
        "translation": "[Sutra] \"Śāriputra!",
        "source": "T25n1509_036:0328a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩行般若波羅蜜，不見般若波羅蜜若相應若不相應，不見檀波羅蜜、尸波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜若相應若不相應，亦不見色若相應若不相應，不見受、想、行、識若相應若不相應，不見眼乃至意、色乃至法、眼色識界乃至意法識界若相應若不相應，不見四念處乃至八聖道分、佛十力乃至一切種智若相應若不相應。",
        "translation": "是菩薩摩訶薩行般若波羅蜜，不見般若波羅蜜若相應若不相應，不見檀波羅蜜、尸波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜若相應若不相應，亦不見色若相應若不相應，不見受、想、行、識若相應若不相應，不見眼乃至意、色乃至法、眼色識界乃至意法識界若相應若不相應，不見四念處乃至八聖道分、佛十力乃至一切種智若相應若不相應。",
        "source": "T25n1509_036:0328a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是，舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T25n1509_036:0328a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知菩薩摩訶薩與般若波羅蜜相應。」",
        "translation": "You should know that the bodhisattva-mahāsattva is associated with the perfection of wisdom.\"",
        "source": "T25n1509_036:0328a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：菩薩得諸法實相，入般若波羅蜜，即於般若波羅蜜不見定相，若相應、若不相應，何況見有餘法！",
        "translation": "[Commentary] explains, \"When a bodhisattva attains the true characteristics of all dharmas and enters into the perfection of wisdom, that is, when he doesn't see the characteristic of concentration in the perfection of wisdom, whether it's associated or not, how could he see any other dharmas?",
        "source": "T25n1509_036:0328a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不見般若相應、不相應？",
        "translation": "Why don't we see that Prajñā is associated and unassociated?",
        "source": "T25n1509_036:0328b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見如是行，為應般若波羅蜜；不見不如是行，為不應般若波羅蜜。",
        "translation": "Not seeing such behavior is the perfection of prajñā, and not seeing behavior that's not like that is the perfection of prajñā that shouldn't be.",
        "source": "T25n1509_036:0328b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如常、樂、我行，不應般若波羅蜜；無常、苦、無我行，為應般若波羅蜜。",
        "translation": "Such actions as permanence, happiness, and selfhood shouldn't be the perfection of prajñā, and actions that are impermanent, painful, and selfless should be the perfection of prajñā.",
        "source": "T25n1509_036:0328b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若行實，不應般若波羅蜜；若行空，為應般若波羅蜜。",
        "translation": "If conditioned existences are real, they shouldn't be the perfection of prajñā; if conditioned existences are empty, they should be the perfection of prajñā.",
        "source": "T25n1509_036:0328b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有無行，為不應般若波羅蜜；如非有非無行，為應般若波羅蜜。",
        "translation": "If there are and aren't formations, they shouldn't be the perfection of prajñā; if they aren't formations that are neither existent nor nonexistent, they should be the perfection of prajñā.",
        "source": "T25n1509_036:0328b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若波羅蜜中皆無是事，般若波羅蜜相畢竟清淨故。",
        "translation": "There are no such things in the perfection of wisdom, so the characteristics of the perfection of wisdom are ultimately pure.",
        "source": "T25n1509_036:0328b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五波羅蜜、五眾，乃至一切種智亦如是。",
        "translation": "So are the five perfections, the five multitudes, and even the knowledge of all kinds.",
        "source": "T25n1509_036:0328b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：般若波羅蜜畢竟清淨應爾，五波羅蜜及餘法云何清淨？",
        "translation": "Q: If it's true that the perfect purity of the perfection of wisdom, how are the five perfections and the other things pure?",
        "source": "T25n1509_036:0328b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：先說：「五事離般若波羅蜜不名波羅蜜，與般若波羅蜜和合故名波羅蜜。」",
        "translation": "Answer: First, it says, \"Five things that are free of prajñāpāramit aren't called prajñāpāramit but are combined with prajñāpāramit to make them prajñāpāramit.\"",
        "source": "T25n1509_036:0328b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如《般若波羅蜜．初品》中說：「云何名檀波羅蜜？",
        "translation": "As it says in the First Chapter of Prajñāpāramitā, \"What is called the perfection of giving?",
        "source": "T25n1509_036:0328b13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見施者、不見受者、無財物故。」",
        "translation": "They don't see the donor, don't see the recipient, and don't have any possessions.\"",
        "source": "T25n1509_036:0328b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五眾法是菩薩觀處，與般若波羅蜜和合故、畢竟清淨故，不見相應、不相應。",
        "translation": "The five categories of dharmas are the bodhisattva's contemplation field, and they're ultimately pure because they're combined with the perfection of wisdom, so they aren't seen as associated or nonassociated.",
        "source": "T25n1509_036:0328b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二入、十八界、十二因緣亦如是。",
        "translation": "The 12 sense-fields, 18 elements, and 12 causes and conditions are likewise.",
        "source": "T25n1509_036:0328b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸法無有定性、無有定法，以是故不見若相應、若不相應。",
        "translation": "These things have no definite nature and no definite dharmas, so it's because of this that they aren't seen as being associated or not associated.",
        "source": "T25n1509_036:0328b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八空、四念處，乃至大慈、大悲、一切種智，不見若相應、若不相應。",
        "translation": "The eighteen kinds of emptiness, the four abodes of mindfulness, and even great kindness, great compassion, and omniscience are not seen as being associated or not associated.",
        "source": "T25n1509_036:0328b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：是菩薩非聲聞、辟支佛，云何有三十七品？",
        "translation": "Q: If this is a bodhisattva and not a śrāvaka or pratyekabuddha, then how come there are thirty-seven classes?",
        "source": "T25n1509_036:0328b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未得佛道，云何有十力、四無所畏？",
        "translation": "Before attaining the Buddha Way, how could there be the ten powers and four forms of fearlessness?",
        "source": "T25n1509_036:0328b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：是菩薩雖非聲聞、辟支佛，亦觀聲聞、辟支佛法，欲以聲聞、辟支佛道度眾生故。",
        "translation": "Answer: \"Although he's not a direct disciple or pratyekabuddha, this bodhisattva still observes the teachings of direct disciples and pratyekabuddhas and wants to save sentient beings through the path of direct disciples and pratyekabuddhas.",
        "source": "T25n1509_036:0328b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有人言：「行聲聞、辟支佛道，但不取證。",
        "translation": "Again, some people say, \"They practice the path of the śrāvakas and pratyekbuddhas but don't attain its realization.",
        "source": "T25n1509_036:0328b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如後品中說：『入空、無相、無作三昧，菩薩住是三解脫門，作是念言：「今是觀時，非是證時。」』」",
        "translation": "As it's explained in a later section, 'Entering the samādhi of emptiness, signlessness, and noncontrivance, a bodhisattva abides in this gate of the three liberations and thinks, 'Now is the time to contemplate, not the time to realize.'\"",
        "source": "T25n1509_036:0328b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有新發意菩薩聞有聲聞、辟支佛三十七品法，讀誦、正憶念、分別。",
        "translation": "Perhaps there are newly awakened bodhisattvas who hear the thirty-seven qualities of śrāvaka and pratyekabuddha teachings, recite them, correctly recall them, and discern them.",
        "source": "T25n1509_036:0328b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故說菩薩有三十七品。",
        "translation": "That's why it's said that bodhisattvas have thirty-seven qualities.",
        "source": "T25n1509_036:0328b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛十力等亦如是。",
        "translation": "So it is with the Buddha's ten powers and so forth.",
        "source": "T25n1509_036:0328c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩自於菩薩十力、四無所畏、十八不共法中住，住是法中，若聞、若憶想、分別佛十力、四無所畏、十八不共法等，甚深微妙，亦是我分。",
        "translation": "The bodhisattva himself abides within the bodhisattva's ten powers, four forms of fearlessness, and 18 distinctive qualities, and if he hears, recollects, and discerns the buddha's ten powers, four forms of fearlessness, 18 distinctive qualities, and so forth, they are also profound and subtle, and they are my part.",
        "source": "T25n1509_036:0328c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，是菩薩無量阿僧祇劫來，修習佛十力、四無所畏等，坐佛樹下時，得無礙解脫故增益清淨。",
        "translation": "Furthermore, when a bodhisattva cultivates the Buddha's ten powers, four forms of unsurpassed fear, and so forth for measureless incalculably long eons, he attains unhindered liberation and thus gains purity while sitting under a buddha tree.",
        "source": "T25n1509_036:0328c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如勳勞既立，然後受其功賞；菩薩亦如是，有是功德乃受其名。",
        "translation": "It's like when merit is established, then one receives its reward; so too, a bodhisattva has these merits before he receives his name.",
        "source": "T25n1509_036:0328c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是功德皆是般若波羅蜜勢力合故，不見若相應、若不相應。",
        "translation": "These merits are all the result of the combined power of the perfection of wisdom, so we don't see whether they're associated or not associated.",
        "source": "T25n1509_036:0328c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸法義，從六波羅蜜乃至一切智，先已說。",
        "translation": "The meaning of these things was explained earlier, starting with the six perfections and ending with omniscience.",
        "source": "T25n1509_036:0328c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「復次，舍利弗！",
        "translation": "[Sutra] \"Furthermore, Śāriputra!",
        "source": "T25n1509_036:0328c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，空不與空合，無相不與無相合，無作不與無作合。",
        "translation": "When bodhisattvas and mahāsattvas practice the perfection of wisdom, emptiness doesn't coincide with emptiness, signlessness doesn't coincide with signlessness, and unconstructedness doesn't coincide with unconstructedness.",
        "source": "T25n1509_036:0328c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0328c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空、無相、無作無有合與不合。",
        "translation": "\"Emptiness, signlessness, and noncontrivance have no conjunction or disjunction.",
        "source": "T25n1509_036:0328c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T25n1509_036:0328c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是習應，是名與般若波羅蜜相應。」",
        "translation": "When bodhisattvas, mahāsattvas, and bodhisattvas thus practice and respond, this is called being associated with the perfection of wisdom.\"",
        "source": "T25n1509_036:0328c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：一心中無有二空，云何說空不與空合？",
        "translation": "[Commentary] Q: How can it be said that emptiness doesn't coincide with emptiness when there are no two kinds of emptiness in one mind?",
        "source": "T25n1509_036:0328c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：空有二種：一者、空三昧，二者、法空。",
        "translation": "Answer: There are two kinds of emptiness: first, emptiness samādhi, and second, emptiness of phenomena.",
        "source": "T25n1509_036:0328c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空三昧不與法空合。",
        "translation": "Emptiness samādhi doesn't combine with the emptiness of dharmas.",
        "source": "T25n1509_036:0328c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0328c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以空三昧力合法空者，是法非自性空。",
        "translation": "\"If someone uses the power of the samādhi of emptiness to legitimately establish emptiness, this is a dharma that isn't empty of its own nature.",
        "source": "T25n1509_036:0328c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又空者，性自空，不從因緣生；若從因緣生，則不名性空。",
        "translation": "Furthermore, emptiness is self-natured and empty, and it doesn't arise from causes and conditions; if it arises from causes and conditions, then it isn't called emptiness in nature.",
        "source": "T25n1509_036:0328c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者若入時見空，出時不見空，當知是虛妄。",
        "translation": "If a practitioner sees emptiness when he enters and doesn't see it when he exits, he should know that it's false.",
        "source": "T25n1509_036:0328c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛自說因緣：「空中無合無不合，無相、無作亦如是。",
        "translation": "Furthermore, the Buddha himself explained the causes and conditions, \"There's no conjunction or disjunction in the sky, and so are marklessness and unconstructedness.",
        "source": "T25n1509_036:0328c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T25n1509_036:0328c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是習應，是名與般若波羅蜜相應。」",
        "translation": "When bodhisattvas thus practice and respond, this is called being associated with the perfection of wisdom.\"",
        "source": "T25n1509_036:0328c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：但一處說「不見與般若波羅蜜相應不相應」便足，何以故復更種種說「相應不相應因緣」？",
        "translation": "Q: It's enough to say in one place, \"I don't see what's associated and what's not associated with the perfection of wisdom,\" so why are there various explanations of \"what's associated and what's not associated with the cause and conditions\"?",
        "source": "T25n1509_036:0328c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一處應，餘則皆應；若一處不應，餘亦不應。",
        "translation": "If one place agrees, the others all agree, and if one place doesn't, the others don't either.",
        "source": "T25n1509_036:0328c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如一盲無見，千盲俱爾。",
        "translation": "It's like when one blind person has no vision, a thousand blind people will follow suit.",
        "source": "T25n1509_036:0328c28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不然！",
        "translation": "Answer, \"No!",
        "source": "T25n1509_036:0328c29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲以戲論求勝，應如是難。",
        "translation": "If you want to seek victory through conceptual elaborations, it should be as difficult as this.",
        "source": "T25n1509_036:0328c29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法相雖不可說，佛以大慈大悲故種種方便說。",
        "translation": "Although the characteristics of all dharmas are inexplicable, the Buddha explains them in various ways out of great kindness and compassion.",
        "source": "T25n1509_036:0329a01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又佛說法，為一種眾生得道，為未悟者重說。",
        "translation": "The Buddha also teaches for the sake of one type of sentient being attaining the path and repeats it for those who haven't yet realized it.",
        "source": "T25n1509_036:0329a02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復一說為斷見諦結使，二說為斷思惟結使，復更說為諸餘結使分分皆斷。",
        "translation": "Again, one teaching explains that it's to end the bondage of views, another explains that it's to end the bondage of contemplation, and yet another explains that the other bonds are partly ended.",
        "source": "T25n1509_036:0329a03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又一說有人得聲聞道，一說種辟支佛道因緣，更一說發阿耨多羅三藐三菩提心。",
        "translation": "Another says that a person attains the path of the śrāvakas, another says to plant the causes and conditions of the path of the solitary realizers, and yet another says to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_036:0329a05_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更一說行六波羅蜜，更一說行方便、得無生忍。",
        "translation": "Another says to practice the six perfections, and yet another says to practice skillful means and attain the patient acceptance of nonarising.",
        "source": "T25n1509_036:0329a07_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更一說得初住地，更一說乃至十住地。",
        "translation": "Another says attaining the first abode, and another says up to the ten abodes.",
        "source": "T25n1509_036:0329a08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更一說為人故，更一說為天故。",
        "translation": "Another teaches it for the sake of humans, and another teaches it for the sake of gods.",
        "source": "T25n1509_036:0329a09_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，是般若波羅蜜相甚深，難解難知，佛知眾生心根有利鈍：鈍根者，少智為其重說；若利根者，一說二說便悟，不須種種重說。",
        "translation": "Furthermore, this is a profound aspect of prajñā-pāramit that's difficult to understand and hard to know, and the Buddha knows that sentient beings have favorable and dull mental faculties: those with dull faculties will have a little wisdom to explain it repeatedly for them, but those with sharp faculties will understand it after one or two explanations, so they don't need to explain it repeatedly.",
        "source": "T25n1509_036:0329a10_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如駛馬，下一鞭便走；駑馬，多鞭乃去。",
        "translation": "It's like driving a horse, which will leave with a single whip, or a stubborn horse, which will leave with many whips.",
        "source": "T25n1509_036:0329a13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種因緣故，經中重說無咎。",
        "translation": "For these reasons, there's no blame for re-explaining the sūtras.",
        "source": "T25n1509_036:0329a14_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「復次，舍利弗！",
        "translation": "[Sutra] \"Furthermore, Śāriputra!",
        "source": "T25n1509_036:0329a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜時，入諸法自相空。",
        "translation": "When the bodhisattva Mahāsattva practices prajñāpāramit, he enters the emptiness of the own-nature of all things.",
        "source": "T25n1509_036:0329a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入已，色不作合，不作不合；受、想、行、識不作合，不作不合。",
        "translation": "After entering, form doesn't come together and doesn't become united, and feeling, perception, volition, and consciousness don't come together and don't become united.",
        "source": "T25n1509_036:0329a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色不與前際合。",
        "translation": "Form doesn't come together with the prior end.",
        "source": "T25n1509_036:0329a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見前際故。",
        "translation": "It's because they don't see the prior end.",
        "source": "T25n1509_036:0329a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色不與後際合。",
        "translation": "form doesn't coincide with the latter end.",
        "source": "T25n1509_036:0329a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見後際故。",
        "translation": "It's because they don't see the latter end.",
        "source": "T25n1509_036:0329a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色不與現在合。",
        "translation": "form doesn't coincide with the present.",
        "source": "T25n1509_036:0329a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見現在故。",
        "translation": "It's because they don't see the present.",
        "source": "T25n1509_036:0329a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受、想、行、識亦如是。」",
        "translation": "*Feelings, perceptions, volitions, and consciousness are likewise.*\"",
        "source": "T25n1509_036:0329a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋曰：先說「空、無相、無作，無合無不合」，今更說因緣：入自相空故，五眾不作合、不作不合。",
        "translation": "[Commentary]: He said, \"First, it's empty, markless, uncontrived, and without unity or dissimilarity,\" and now he'll explain the causes and conditions: Because they enter into the emptiness of their own characteristics, the five groups don't come together and don't come together.",
        "source": "T25n1509_036:0329a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一切法自相空，是中無有合、不合。",
        "translation": "If all things are empty in their own nature, there's no conjunction or disconjunction in them.",
        "source": "T25n1509_036:0329a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「合」者，諸法如其相。",
        "translation": "\"Conformity\" means that all things are as they are in their marks.",
        "source": "T25n1509_036:0329a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如地堅相，識知相，如是等自相不在異法，是名為「合」。",
        "translation": "Such as the firm characteristic of the ground, the characteristic of consciousness knowing, and so forth, their own characteristics aren't in different things, which is called \"unity.\"",
        "source": "T25n1509_036:0329a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不合」者，自相不在自法中。",
        "translation": "What's not \"united\" is that their own characteristics aren't in their own dharmas.",
        "source": "T25n1509_036:0329a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略說諸法相，不增不減。",
        "translation": "It's a brief explanation of the characteristics of dharmas that doesn't increase or decrease.",
        "source": "T25n1509_036:0329a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色不與前際合。",
        "translation": "Form doesn't coincide with the prior end.",
        "source": "T25n1509_036:0329a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前際空無所有，但有名字；若色入過去，則滅無所有，云何與前際合？",
        "translation": "The prior end is empty and lacks existence but has a name; if form enters and passes away, then it ceases to lack existence, so how could it be combined with the prior end?",
        "source": "T25n1509_036:0329a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後際者，未有未生，色不應與後際合。",
        "translation": "\"At the latter end, there's nothing yet to be produced, and form shouldn't be combined with the latter end.",
        "source": "T25n1509_036:0329a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在色，生滅不住故，不可取相，色不應與現在合。",
        "translation": "Regarding present form, it's because birth and death don't stop, and it's not desirable to mark it, so form shouldn't coincide with the present.",
        "source": "T25n1509_036:0329a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛自說因緣：「色不與前際合，非不合。",
        "translation": "Furthermore, the Buddha himself explained the cause and conditions, \"Form doesn't coincide with the prior end; it doesn't not coincide with it.",
        "source": "T25n1509_036:0329b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前際不可見故。",
        "translation": "It's because the prior end can't be seen.",
        "source": "T25n1509_036:0329b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色不與後際合，非不合。",
        "translation": "Form doesn't coincide with the latter end, not does it not coincide with the latter end.",
        "source": "T25n1509_036:0329b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後際不可見故。",
        "translation": "It's because the latter end can't be seen.",
        "source": "T25n1509_036:0329b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色不與現在合，非不合。",
        "translation": "Form doesn't coincide with the present, not doesn't coincide with it.",
        "source": "T25n1509_036:0329b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在不可見故。",
        "translation": "The present is invisible, so it's invisible.",
        "source": "T25n1509_036:0329b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受、想、行、識亦如是。」",
        "translation": "*Feelings, perceptions, volitions, and consciousness are likewise.*\"",
        "source": "T25n1509_036:0329b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】「復次，舍利弗！",
        "translation": "[Sutra] \"Furthermore, Śāriputra!",
        "source": "T25n1509_036:0329b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩行般若波羅蜜，前際不與後際合，後際不與前際合，現在不與前際、後際合，前際、後際亦不與現在合，三際名空故。",
        "translation": "When a bodhisattva practicing prajñā-pāramitā, the prior end doesn't merge with the latter end, the latter end doesn't merge with the prior end, the present doesn't merge with the prior end and the latter end, and the prior end and the latter end don't merge with the present, so the three ends are called empty.",
        "source": "T25n1509_036:0329b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "*Śāriputra!",
        "source": "T25n1509_036:0329b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩如是習應者，是名與般若波羅蜜相應。」",
        "translation": "When bodhisattvas, mahāsattvas, and those who thus practice and respond to them, this is called being associated with the perfection of wisdom.\"",
        "source": "T25n1509_036:0329b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】問曰：云何前際、後際合？",
        "translation": "[Treatise] asked, \"How are the first and last portions combined?",
        "source": "T25n1509_036:0329b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有人說：「三世諸法皆是有，未來法轉為現在，現在轉為過去。",
        "translation": "Answer: Some people say, \"All the dharmas of the three times exist, and future dharmas are transformed into the present, and the present is transformed into the past.",
        "source": "T25n1509_036:0329b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如泥揣現在，瓶為未來，土為過去；若成瓶時，瓶為現在，泥揣為過去，瓶破為未來。",
        "translation": "Suppose a clay pot is made present, a vial is future, and dirt is past; when a vial is formed, the vial is present, the clay pot is past, and the broken vial is future.",
        "source": "T25n1509_036:0329b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是者是為合。」",
        "translation": "Such is the conjunction.\"",
        "source": "T25n1509_036:0329b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有三世相，是事不然，以多過故，是為不合。",
        "translation": "If there were a mark of the three times, this wouldn't be the case, and it's because of many faults that it doesn't fit.",
        "source": "T25n1509_036:0329b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，三世合者，如過去法與過去、未來、現在世作因，現在法與現在、未來世作因，未來世法與未來世作因。",
        "translation": "Furthermore, when the three worlds are combined, it's like past dharmas that cause past, future, and present dharmas, present dharmas that cause present and future dharmas, and future dharmas that cause future dharmas.",
        "source": "T25n1509_036:0329b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又過去心、心數法緣三世法，未來、現在心心數法亦如是。",
        "translation": "Furthermore, while past mental states and mental factors conditioned the dharmas of the three times, the same goes for future and present mental states and mental factors.",
        "source": "T25n1509_036:0329b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷心心數法能緣不斷法，不斷心心數法能緣可斷法。",
        "translation": "The mental factors of discontinued mental states can condition the discontinued mental states, and the mental factors of discontinued mental states can condition the discontinuable mental states.",
        "source": "T25n1509_036:0329b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等三世諸法因緣果報共相和合，是名為合。",
        "translation": "Thus, the conjunction of the causes, conditions, and effects of these three worldly dharmas is called confluence.",
        "source": "T25n1509_036:0329b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩不作是合。",
        "translation": "The bodhisattvas don't make this kind of conjunction.",
        "source": "T25n1509_036:0329b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_036:0329b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如先說：「過去已滅，云何能為因、能為緣？",
        "translation": "As explained earlier, \"After the past has ceased, how could it be a cause and a condition?",
        "source": "T25n1509_036:0329b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來未有，云何為因緣？",
        "translation": "What are the causes and conditions that will not exist in the future?",
        "source": "T25n1509_036:0329b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在乃至一念中不住，云何為因緣？」",
        "translation": "What are the causes and conditions for not abiding in a single thought now or even then?\"",
        "source": "T25n1509_036:0329b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名不合。",
        "translation": "This is called not fitting in.",
        "source": "T25n1509_036:0329b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛自說因緣：「三世及名字空故，云何言合？」",
        "translation": "Furthermore, the Buddha himself explained the causes and conditions, \"How can it be said that the three worlds and names are combined because they are empty?\"",
        "source": "T25n1509_036:0329b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大智度論卷第三十六",
        "translation": "Dazhi douluo lun, vol. 36",
        "source": "T25n1509_036:0329b28_0",
        "is_bad_quality": false
    }
]