[
    {
        "source_sentence": "大智度論釋初品中四無畏義",
        "translation": "Meaning of the Four Fearlessnesses in the First Chapter of the Explanation of the Treatise on the Great Decease",
        "source": "T25n1509_025:0241b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四十(卷二十五)",
        "translation": "XL (Volume XXV)",
        "source": "T25n1509_025:0241b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖者龍樹造",
        "translation": "created by the sage Nāgârjuna",
        "source": "T25n1509_025:0241b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後秦龜茲國三藏鳩摩羅什譯",
        "translation": "Translated by Kumārajīva, Tripiṭaka of Kucha, Later Qin Dynasty",
        "source": "T25n1509_025:0241b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無所畏者。",
        "translation": "\"The four have no fear.",
        "source": "T25n1509_025:0241b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛作誠言：「我是一切正智人。",
        "translation": "The Buddha made a sincere statement, \"I'm a person of all correct cognition.",
        "source": "T25n1509_025:0241b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，如實言：『是法不知。』",
        "translation": "If there are ascetics, priests, gods, Māra, Brahmā, or any other group, they truly say, 'I don't know this teaching.'",
        "source": "T25n1509_025:0241b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至不見是微畏相。",
        "translation": "... doesn't see this mark of subtle fear.",
        "source": "T25n1509_025:0241b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，我得安隱，得無所畏，安住聖主處，如牛王，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。",
        "translation": "Because of this, I've attained peace and fearlessness, and I'm staying in the place of the noble lord like a bull king who's like a lion roaring among the masses and can turn the brahma wheel; ascetics and priests, whether gods, Māra, Brahmā, or any of the others, really can't turn it.",
        "source": "T25n1509_025:0241b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一無畏也。」",
        "translation": "They're all fearless.\"",
        "source": "T25n1509_025:0241b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛作誠言：「我一切漏盡。",
        "translation": "The Buddha made a sincere statement, \"All of my contaminants have ended.",
        "source": "T25n1509_025:0241c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，如實言：『是漏不盡。』",
        "translation": "If there are ascetics and priests, gods, Māra, Brahmā, or any other group of people, they truly say, 'These are contaminants that aren't ended.'",
        "source": "T25n1509_025:0241c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至不見是微畏相。",
        "translation": "That's not to say that they don't see this subtle sign of fear.",
        "source": "T25n1509_025:0241c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，我得安隱，得無所畏，安住聖主處，如牛王，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。",
        "translation": "Because of this, I've attained peace and fearlessness, and I'm staying in the place of the noble lord like a bull king who's like a lion roaring among the masses and can turn the noble wheel; ascetics and priests, whether gods, Māra, Brahmā, or any of the others, really can't turn it.",
        "source": "T25n1509_025:0241c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二無畏也。」",
        "translation": "They're both fearless.\"",
        "source": "T25n1509_025:0241c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛作誠言：「我說障法。",
        "translation": "The Buddha made a sincere statement, \"I'll explain the obstructive state.",
        "source": "T25n1509_025:0241c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，如實言：『受是障法，不障道。』",
        "translation": "Suppose there are ascetics or priests, gods, Māra, Brahmā, or any other group of people who truly say, 'Accepting this obstructing teaching doesn't hinder the path.'",
        "source": "T25n1509_025:0241c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至不見是微畏相。",
        "translation": "That's not to say that they don't see this mark of subtle fear.",
        "source": "T25n1509_025:0241c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，我得安隱，得無所畏，安住聖主處，如牛王，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。",
        "translation": "Because of this, I've attained peace and fearlessness, and I'm staying in the place of the noble lord like a bull king who's like a lion roaring among the masses and can turn the brahma wheel; ascetics and priests, whether gods, Māra, Brahmā, or any of the others, really can't turn it.",
        "source": "T25n1509_025:0241c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三無畏也。」",
        "translation": "He's also one of the three fearless.\"",
        "source": "T25n1509_025:0241c12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛作誠言：「我所說聖道，能出世間，隨是道，能盡諸苦。",
        "translation": "The Buddha made a sincere statement, \"The noble path that I've taught is transcendent, and following that path can end suffering.",
        "source": "T25n1509_025:0241c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，如實言：『行是道，不能出世間，不能盡苦。』",
        "translation": "If there are ascetics, priests, gods, Māra, Brahmā, or any other group of people, they truly say, 'Such a path cannot transcend the world or end suffering when practiced,' ...",
        "source": "T25n1509_025:0241c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至不見是微畏相。",
        "translation": "That's not even the slightest sign of fear that's seen.",
        "source": "T25n1509_025:0241c16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，我得安隱，得無所畏，安住聖主處，如牛王，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。",
        "translation": "Because of this, I've attained peace and fearlessness, and I'm staying in the place of the noble lord like a bull king who's like a lion roaring among the masses and can turn the brahma wheel; ascetics and priests, whether gods, Māra, Brahmā, or any of the others, really can't turn it.",
        "source": "T25n1509_025:0241c16_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四無畏也。」",
        "translation": "He's also one of the four fearless ones.\"",
        "source": "T25n1509_025:0241c19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：以何事故，說「四無所畏」？",
        "translation": "Q: What are the circumstances that led to the teaching of the \"four forms of fearlessness\"?",
        "source": "T25n1509_025:0241c20_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有人言：「佛自稱一切智、一切見；世間一切經書、技術、智巧、方便，甚多無量，若一切眾生共知一切事猶尚難，況佛一人而有一切智！",
        "translation": "Answer: Someone said, \"The Buddha claims to have omniscience and omniscience; there are countless scriptures, techniques, wisdom, and skillful means in the world, but it would still be difficult for all sentient beings to know everything together, so why should the Buddha alone have omniscience?",
        "source": "T25n1509_025:0241c20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有是事、有是難，佛將無有畏？」",
        "translation": "Is there such a thing or such a difficulty that the Buddha would have no fear?\"",
        "source": "T25n1509_025:0241c23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而欲斷是疑妄、斷是難故，佛說四無所畏。",
        "translation": "Because he wants to end these doubts and delusions and end these difficulties, the Buddha teaches the four forms of fearlessness.",
        "source": "T25n1509_025:0241c24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，若佛未出，世間外道等種種因緣，欺誑求道、求福人。",
        "translation": "Furthermore, if there were various causes and conditions for non-Buddhists and others in the world to deceive those who seek the path and seek merit before the Buddha's appearance, they might eat various fruits, various vegetables, various grass roots, cow dung, or tares once a day.",
        "source": "T25n1509_025:0241c25_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或食種種果，或食種種菜，或食種種草根，或食牛屎，或日一食稊稗，或二日、或十日、一月、二月一食，或噏風、飲水，或食水衣，如是等種種食；或衣樹皮、樹葉、草衣、鹿皮，或衣板木；或在地臥，或臥杵上、枝上、灰上、棘上；或寒時入水，或熱時五熱自炙；或入水死，入火死，投巖死，斷食死。",
        "translation": "They might eat various fruits, various vegetables, various grass roots, cow dung, tares once a day, tares once every two days, tares once every ten days, one month, two months, tares once every two months, tares once every two days, tares once every two days, tares once every two days, tares once every ten days, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, one month, and so forth.",
        "source": "T25n1509_025:0241c27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種苦行法中，求天上，求涅槃，亦教弟子令不捨是法；如是引致少智眾生以得供養。",
        "translation": "Among these various ascetic practices, he seeks heaven and nirvāṇa, and he teaches his disciples not to abandon them; this causes sentient beings with little wisdom to obtain offerings.",
        "source": "T25n1509_025:0242a04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如螢火虫，日未出時，少多能照；若日出時，千光明照，月及眾星皆無有明，豈況螢火？",
        "translation": "It's like a firefly. When the sun is still out, a little bit of it shines, but when it rises, a thousand lights shine, and the moon and the stars have no light at all, so why wouldn't a firefly?",
        "source": "T25n1509_025:0242a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛未出世，諸外道輩小明照世得供養；佛出世時，以大智光明，滅諸外道及其弟子，皆不復得供養。",
        "translation": "If the lesser lights of the group of non-Buddhists that illuminate the world before the Buddha's appearance in the world could make offerings, then when the Buddha appears in the world, with his great wisdom and radiance, he'll extinguish the non-Buddhists and their disciples, and they won't be able to make offerings anymore.",
        "source": "T25n1509_025:0242a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以失供養利故，便妄語謗佛及佛弟子。",
        "translation": "Because they lose the benefits of making offerings, they then falsely denigrate the Buddha and his disciples.",
        "source": "T25n1509_025:0242a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如《孫陀利經》中說，自殺孫陀利而謗佛，語眾人言：「世間弊人尚不為是，是人世間禮法尚不能知，何況涅槃！」",
        "translation": "For example, the Sundarī Sutra says that a person who killed Sundarī himself and denigrated the Buddha said to the crowd, \"This is not yet the case for a miscreant in the world; this person is still unable to understand worldly rituals, so why would he want to attain nirvāṇa?\"",
        "source": "T25n1509_025:0242a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛欲滅如是等誹謗故，自說實功德四無所畏，言：「我獨是一切智人，無有能如實言『佛不能知』，我不畏是事。",
        "translation": "Because the Buddha wanted to put an end to such slander, he explained the true merit of the four fearlessnesses and said, \"Alone, I'm a person of omniscience, and there's no one who can truly say, 'The Buddha doesn't know,' and I'm not afraid of that.",
        "source": "T25n1509_025:0242a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我獨一切諸漏及習盡，無有能如實言『佛漏未盡』，我不畏是事。",
        "translation": "Alone, I have ended all contaminants and accumulation, and there's no one who can truly say, 'The Buddha's contaminants have not yet ended,' and I'm not afraid of that.",
        "source": "T25n1509_025:0242a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我說遮涅槃道法，無有能如實言『是法不能遮涅槃』，佛不畏是事。",
        "translation": "When I teach that the path to nirvāṇa is obstructed, there's no one who can truly say, 'This teaching doesn't obstruct nirvāṇa,' and the Buddha isn't afraid of that.",
        "source": "T25n1509_025:0242a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說苦盡道達到涅槃，無有能如實言『是道不能到涅槃』，佛不畏是事。」",
        "translation": "When the Buddha teaches that the path to the end of suffering leads to nirvāṇa, there's no one who can truly say, 'This path cannot lead to nirvāṇa,' and the Buddha isn't afraid of that.\"",
        "source": "T25n1509_025:0242a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略說是四無所畏體：一者、正知一切法，二者、盡一切漏及習，三者、說一切障道法，四者、說盡苦道。",
        "translation": "These are briefly described as the four objects of fearlessness: 1) correct knowledge of all things, 2) ending all contaminants and accumulation, 3) teaching all obstructive factors of the path, and 4) teaching the path to the end of suffering.",
        "source": "T25n1509_025:0242a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是四法中，若有如實言「不能盡遍知」，佛不畏是事。",
        "translation": "Of these four things, if there's something that's truly said, \"I can't know them all,\" the Buddha isn't afraid of it.",
        "source": "T25n1509_025:0242a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0242a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正遍知了了故。",
        "translation": "They understand it because they have full comprehension of it.",
        "source": "T25n1509_025:0242a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初二無畏，為自功德具足故；後二無畏，為具足利益眾生故。",
        "translation": "The first two fearlessnesses are for the purpose of fully possessing their own merits, and the last two fearlessnesses are for the purpose of fully benefiting sentient beings.",
        "source": "T25n1509_025:0242a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，初、第三、第四無畏中說智，第二無畏中說斷；智、斷具足故，所為事畢。",
        "translation": "Furthermore, the first, third, and fourth fearlessness are explained as cognition, and the second fearlessness is explained as stopping; because cognition and stopping are complete, that completes the task that's performed.",
        "source": "T25n1509_025:0242a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：十力皆名智，四無所畏亦是智，有何等異？",
        "translation": "Q: The ten powers are all called cognition, and the four forms of fearlessness are also cognition, so what's the difference?",
        "source": "T25n1509_025:0242a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：廣說佛諸功德是力，略說是無畏。",
        "translation": "Answer: Explaining the Buddha's merits in detail is power, and explaining them briefly is fearlessness.",
        "source": "T25n1509_025:0242b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，能有所作是力，無所疑難是無畏。",
        "translation": "Furthermore, to be able to do something is power, and to have no doubts is fearlessness.",
        "source": "T25n1509_025:0242b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧集故名力，散諸無明故名無畏。",
        "translation": "It's called power because wisdom is collected, and it's called fearlessness because ignorance is dispersed.",
        "source": "T25n1509_025:0242b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集諸善法故名力，滅諸不善法故名無畏。",
        "translation": "It's called power because it gathers good qualities, and it's called fearlessness because it ceases unskillful qualities.",
        "source": "T25n1509_025:0242b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自有智慧故名力，無能壞者故名無畏。",
        "translation": "It's called power because it has its own wisdom, and it's called fearless because there's nothing that can destroy it.",
        "source": "T25n1509_025:0242b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智慧猛健是力，堪受問難是無畏。",
        "translation": "Vigorous wisdom is power, and the ability to accept difficult questions is fearlessness.",
        "source": "T25n1509_025:0242b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集諸智慧是名力，智慧外用是無畏。",
        "translation": "Gathering wisdom is called power, and the outward application of wisdom is fearlessness.",
        "source": "T25n1509_025:0242b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如轉輪聖王七寶成就是力；得是七寶已，周四天下無不降伏，是名無畏。",
        "translation": "Like the wheel-turning sage king who has accomplished the seven treasures, this is power, and once he attains these seven treasures, there's nothing under the whole world that isn't subdued, which is called fearlessness.",
        "source": "T25n1509_025:0242b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如良醫善知藥方是名力，合和諸藥與人是名無畏。",
        "translation": "It's also like a good doctor who well knows the prescriptions for medicines, which is called power, and combining medicines with people is called fearlessness.",
        "source": "T25n1509_025:0242b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自利益是名力，利益他是無畏。",
        "translation": "Benefiting oneself is called power, and benefiting others is called fearlessness.",
        "source": "T25n1509_025:0242b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自除煩惱是名力，除他煩惱是無畏。",
        "translation": "Removing one's own afflictions is called power, and removing the afflictions of others is fearless.",
        "source": "T25n1509_025:0242b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無能沮壞是名力，不難、不退是無畏。",
        "translation": "Not being able to discourage is called power, and not being difficult or retrogressing is fearless.",
        "source": "T25n1509_025:0242b13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自成己善是名力，能成他善是無畏。",
        "translation": "It's called the power of making oneself good, and it's fearless to make others good.",
        "source": "T25n1509_025:0242b14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "巧便智是名力，用巧智是無畏。",
        "translation": "Skillful knowledge is called power, and using skillful knowledge is fearless.",
        "source": "T25n1509_025:0242b15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智、一切種智是名力，一切智、一切種智顯發是無畏。",
        "translation": "Omniscient and omniscient is known as power, and the manifestation of omniscient and omniscient is fearless.",
        "source": "T25n1509_025:0242b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八不共法是名力，十八不共法顯發於外是無畏。",
        "translation": "The eighteen qualities not in common with dharmas is called power, and the eighteen qualities not in common with dharmas that are revealed outwardly are fearless.",
        "source": "T25n1509_025:0242b17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遍通達法性是名力；若有種種問難，不復思惟，即時能答是無畏。",
        "translation": "To fully comprehend the nature of things is called power, and to be able to answer various questions immediately without further thought is fearless.",
        "source": "T25n1509_025:0242b18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得佛眼是名力；佛眼見已，可度者為說法是無畏。",
        "translation": "Attaining the Buddha's eye is called power, and it's fearless to explain the teaching to someone who can be saved after the Buddha's eye has seen it.",
        "source": "T25n1509_025:0242b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得三無礙智是名力，得應辯無礙是無畏。",
        "translation": "Attaining the three kinds of unhindered cognition is known as power, and attaining the unhindered ability to respond to discourse is fearless.",
        "source": "T25n1509_025:0242b21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無礙智是名力，樂說無礙智是無畏。",
        "translation": "Unhindered cognition is known as power, and delighting in unhindered knowledge of what's being taught is fearless.",
        "source": "T25n1509_025:0242b22_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智自在是名力，種種譬喻、種種因緣、莊嚴語言說法是無畏。",
        "translation": "Being comfortable with omniscience is known as power, and speaking the Dharma through various metaphors, various causes, and ornate language is fearless.",
        "source": "T25n1509_025:0242b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破魔眾是名力，破諸外道論議師是無畏。",
        "translation": "To refute crowds of Māras is called power, and to refute the theories of non-Buddhists is fearless.",
        "source": "T25n1509_025:0242b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種因緣，分別力、無畏。",
        "translation": "Such are the various causes and conditions that discern power and fearlessness.",
        "source": "T25n1509_025:0242b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：何等名「無所畏」？",
        "translation": "Q: What's called \"fearlessness\"?",
        "source": "T25n1509_025:0242b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：得無所疑，無所忌難，智慧不却不沒，衣毛不豎，在在法中如說即作，是無畏。",
        "translation": "Answer: To have no doubts, nothing to fear, wisdom that doesn't disappear or vanish, and clothing that doesn't stand on end, and to do as they're told while in the Dharma, is fearless.",
        "source": "T25n1509_025:0242b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：云何當知佛無所畏？",
        "translation": "Q: How do you know that the Buddha has no fear?",
        "source": "T25n1509_025:0242b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若有所畏，不能將御大眾。",
        "translation": "They replied, \"If someone has fear, they can't control the crowd.",
        "source": "T25n1509_025:0242b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能攝、能捨，能苦切治，或軟語教。",
        "translation": "They can gather, relinquish, and treat suffering with care, or they might teach with gentle words.",
        "source": "T25n1509_025:0242c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛一時驅遣舍利弗、目連等，還復憐愍心受。",
        "translation": "Just as the Buddha once expelled Śāriputra and Maudgalyāyana, they still accept them with kindness.",
        "source": "T25n1509_025:0242c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有所忌難者，諸論議師輩，住憍慢山頂，以外智慧心狂醉，皆言天下唯有我一人，更無餘人；自於經書決定知故，破他經書、論議；以惡口訾毀，如狂象無所護惜。",
        "translation": "Those who have misgivings or difficulties are those who live on the peak of a mountain of conceit and arrogance, who are drunk with external wisdom, who say that I alone am the only one in the world and there's no one else, who refute other sūtras and arguments because they know for certain what they write, and who criticize them with harsh words like a mad elephant that doesn't guard anything.",
        "source": "T25n1509_025:0242c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是狂人：菴跋咤、長爪、薩遮祇尼揵、蜫盧坻等諸大論議師皆降伏；若有所畏，則不能爾。",
        "translation": "Such crazy people are subdued by such great polemicists as Ambaṭṭha, Nagarjuna, Sācaketinī, and Kashgar, but they wouldn't be able to subdue them if they had any fear.",
        "source": "T25n1509_025:0242c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及憍陳如等五出家人，漚樓頻螺迦葉等千結髮仙人、舍利弗、目揵連、摩訶迦葉等，於佛法中出家，及百千釋子；并諸閻浮提大王：波斯尼示王、頻婆娑羅王、旃陀波殊提王、優填王、弗迦羅婆利王、梵摩達王等，皆為弟子。",
        "translation": "Five renunciant monks like Kauṇḍinya, a thousand bearded sages like Uruvilvā-Kāśyapa, Śāriputra, Maudgalyāyana, and Mahākāśyapa renounce the Buddha's teachings, and a hundred thousand sons of the Buddha, and the great kings of Jambudvīpa: King Prasenajit, King Bimbisāra, King Candrapājit, King Udayana, King Pokkharabalī, and King Brahmadatta are all disciples.",
        "source": "T25n1509_025:0242c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸在家婆羅門，皆度一切世間智慧，為大國王所師仰：梵摩喻、弗迦羅婆利、鳩羅檀陀等，皆為弟子。",
        "translation": "The householder brāhmaṇas who have attained all worldly wisdom and are revered by the great kings are Brahmā, Pukkusāti, and Kulādanta, and so forth, all of whom are their disciples.",
        "source": "T25n1509_025:0242c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有得初道，有得第二、第三、第四道。",
        "translation": "Some have attained the first path, and some have attained the second, third, and fourth paths.",
        "source": "T25n1509_025:0242c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大鬼神：阿羅婆迦、鞞沙迦等，諸大龍王：阿波羅羅、伊羅鉢多羅等，鴦群梨摩羅諸惡人等，皆降化歸伏。",
        "translation": "The great ghosts and spirits, such as Aravāka and Vaiśālī, the great dragon kings, such as Apalāla and Airāpattra, and the evil men of Aṅgulimālī, all subdue and subdue them.",
        "source": "T25n1509_025:0242c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有所畏，不能獨在樹下師子座處坐。",
        "translation": "If they're afraid, they won't be able to sit alone under a tree at the lion's seat.",
        "source": "T25n1509_025:0242c19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲得阿耨多羅三藐三菩提時，魔王軍眾，化作師子、虎、狼、熊、羆之首，或一眼、或多眼，或一耳、或多耳，擔山、吐火，四邊圍遶。",
        "translation": "When he wants to attain supreme perfect enlightenment, the army of Māra King transforms into a lion, a tiger, a wolf, a bear, or a bear-like head, either with one or many eyes, or with one or many ears, that carries mountains and spits fire, and surrounds him on all sides.",
        "source": "T25n1509_025:0242c20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以手指按地，眴息之頃，即皆消滅。",
        "translation": "When the Buddha presses his finger to the ground, they all disappear in an instant with a flash of lightning.",
        "source": "T25n1509_025:0242c23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天、阿修羅、鞞摩質帝隸、釋提婆那民、梵天王等，引導其心皆為弟子。",
        "translation": "The gods, asuras, Vimalacitrinas, Śakra Devānāmin, and Brahmakāyika Kings guide their minds and make them disciples.",
        "source": "T25n1509_025:0242c24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有所畏，不能在此大眾中說法；以無所畏故，能為如是諸天、鬼神大眾中說法，故名無所畏。",
        "translation": "If they had any fear, they wouldn't be able to preach among this great multitude, but because they have no fear, they're able to preach for such a great multitude of gods and spirits, which is why they're called fearless.",
        "source": "T25n1509_025:0242c25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛於一切眾生最尊、最上，盡到一切法彼岸，得大名聞故，自說無所畏。",
        "translation": "Furthermore, since the Buddha is the most honored and most superior of all sentient beings and has reached the other shore of all things, he attains great renown and is heard, so he himself explains that he has no fear.",
        "source": "T25n1509_025:0242c28_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，且置是佛功德；佛一切世間功德亦無能及者，所畏法一切已拔根本故。",
        "translation": "Furthermore, let's say that this is the merit of the Buddha, and there's nothing that can match all of his worldly merits, so he has uprooted the root of all the things that he fears.",
        "source": "T25n1509_025:0242c29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所畏法者，弊家生、弊生處、惡色、無威儀、麁惡語等。",
        "translation": "The things that are feared are birth in a bad family, a bad birthplace, bad form, lack of dignity, and harsh speech.",
        "source": "T25n1509_025:0243a02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弊家生者，如首陀羅，所謂擔死人、除糞、養鷄猪、捕獵、屠殺、酤酒、兵伍等卑賤小家，若在大眾中，則多怖畏。",
        "translation": "A person born into a disadvantaged family is like a Śubhāra, which is a humble, small family that carries dead people, removes dung, raises chickens and pigs, hunts, slaughters, deals in alcohol, and serves in the army, and so forth, and which would be feared if they were among the general public.",
        "source": "T25n1509_025:0243a03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛從本已來，常生轉輪聖王種中，所謂頂生王、快見王、娑竭王、摩訶提婆王，如是等名日王種家中生，亦以是故無所畏。",
        "translation": "Since the distant past, the Buddha has always been born among the lineage of wheel-turning sage kings, which are called the Paramount King, the Express King, the Sāgara King, and the Mahādeva King, and these are called the Sun King lineage.",
        "source": "T25n1509_025:0243a06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弊生處者，安陀羅、舍婆羅(裸國也)、兜呿羅(小月氏)、修利、安息、大秦國等。",
        "translation": "The bad birth places are Andhra, Śālavana (a naked country), Douyangla (a small Yuezhi), Xurī, Anṣaprāpta, and the great Qin state.",
        "source": "T25n1509_025:0243a09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在此邊國中生，若在大眾中，則多怖畏。",
        "translation": "If they were born in one of these countries, they'd be very frightened if they were among the masses.",
        "source": "T25n1509_025:0243a10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在迦毘羅婆中國生，故無所畏。",
        "translation": "The Buddha was born in Kapilavastu, so he has nothing to fear.",
        "source": "T25n1509_025:0243a11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡色者，有人身色枯乾羸瘦，人不喜見；若在大眾，則亦有畏。",
        "translation": "A person with bad form has a withered, dry, and thin appearance that people don't like to see, and if they were in the general public, they'd also have fear.",
        "source": "T25n1509_025:0243a12_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛金色光潤，如火照赤金山，有如是色故無所畏。",
        "translation": "The Buddha's golden radiance is moistened like fire shining on a red-gold mountain, and because he has such form, he has nothing to fear.",
        "source": "T25n1509_025:0243a13_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無威儀者，進止行步坐起，無有人儀，則有怖畏。",
        "translation": "Someone without decorum who walks, sits, and rises without human decorum would be frightened.",
        "source": "T25n1509_025:0243a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛無是事。",
        "translation": "The Buddha has no such thing.",
        "source": "T25n1509_025:0243a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麁惡語者，有人惡音聲，蹇吃重語，無有次第，人所不喜，則多怖畏。",
        "translation": "Debilitating speech: When someone makes harsh sounds or speaks loudly and repeatedly, without any order, and people dislike it, it's frightening.",
        "source": "T25n1509_025:0243a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛無是畏，所以者何？",
        "translation": "The Buddha has no such fears, so why is that?",
        "source": "T25n1509_025:0243a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語真實柔軟，次第易了，不疾不遲，不少不多，不沒不垢，不調戲，勝於迦陵毘伽鳥音；辭義分明，不中傷物。",
        "translation": "Truly soft and gentle, easy to understand in sequence, not too fast or too slow, not too little or too much, not too dirty or undefiled, and not disruptive, these words of the Buddha are superior to the sounds of the Kālôdayinīya bird, and their words are clear and don't malign anything.",
        "source": "T25n1509_025:0243a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離欲故無染，滅瞋故無礙，除愚故易解，法喜增長故可愛，遮罪故安隱。",
        "translation": "It's undefiled because it's free of desire, unimpeded because it stops anger, easy to understand because it removes foolishness, desirable because it produces joy in the Dharma, and peaceful because it covers sins.",
        "source": "T25n1509_025:0243a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨他心、隨解脫、義深語妙、有因緣故言有理，譬喻故善顯示，事訖故善會事；觀種種眾生心故雜說，久久皆入涅槃故一味。",
        "translation": "He follows the minds of others, follows liberation, speaks deeply and delicately, speaks rationally because there are causes and conditions, speaks well in metaphors because they well illustrate, meets things well because they are accomplished, speaks in a variety of ways because he observes the minds of various sentient beings, and tastes the same because they all enter nirvāṇa over time.",
        "source": "T25n1509_025:0243a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等種種無量莊嚴語故，佛於語中無所畏。",
        "translation": "Because of these kinds of measureless and adorned words, the Buddha has no fear in what he says.",
        "source": "T25n1509_025:0243a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛但以如是等世間法，尚無所畏，何況出世間法！",
        "translation": "The Buddha has nothing to fear when it comes to such mundane dharmas, so why wouldn't he fear supramundane dharmas?",
        "source": "T25n1509_025:0243a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故說佛有四無所畏。",
        "translation": "That's why it's said that the Buddha has four forms of fearlessness.",
        "source": "T25n1509_025:0243a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：佛十力中有無所畏不？",
        "translation": "Q: Is there fearlessness among the Buddha's ten powers?",
        "source": "T25n1509_025:0243a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有無所畏，不應但言四；若有所畏，云何言無畏成就？",
        "translation": "If there were fearlessness, it wouldn't be called just four; if there were fearlessness, why would it be called fearless accomplishment?",
        "source": "T25n1509_025:0243a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：一智在十處，名為佛成就十力；如一人知十事，隨事受名。",
        "translation": "Answer: \"One piece of cognition in ten places is called the Buddha's accomplishment of ten powers; just as a person who knows ten things is given a name according to that thing.",
        "source": "T25n1509_025:0243b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是十力，四處出用，是無所畏：是處不是處力、漏盡力，即是初、二無畏；八力雖廣說，是第三、第四無畏。",
        "translation": "These ten powers, which are exerted in four places, are fearless: these are not the first two fearlessnesses, which are the power of the sense-fields and the power of contaminants, and the third and fourth fearlessnesses, although the eight powers are explained in detail.",
        "source": "T25n1509_025:0243b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，十力中雖有無畏，別說亦無失。",
        "translation": "Therefore, although there's fearlessness among the ten powers, there's nothing wrong with speaking of them separately.",
        "source": "T25n1509_025:0243b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正遍知者，知一切法不顛倒，正、不邪，如餘過去諸佛，是名三藐三佛陀。",
        "translation": "Correct and pervasive knowledge is the knowledge that all things are not mistaken, correct, and not wrong, just like the other buddhas of the past, which is called the samyak-saṃbuddha.",
        "source": "T25n1509_025:0243b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛告阿難：「一切世間天及人所不能知，佛能遍知故，名三藐三佛陀。」",
        "translation": "As the Buddha told Ānanda, \"The Buddha's ability to know everything that gods and humans in the world can't know is called the samyak-saṃbuddha.\"",
        "source": "T25n1509_025:0243b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人言：「是法不知。」",
        "translation": "Suppose someone says, \"I don't know this teaching.\"",
        "source": "T25n1509_025:0243b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：是何人？",
        "translation": "They ask, 'Who is it?'",
        "source": "T25n1509_025:0243b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：是中佛說：「若沙門、婆羅門，若天、若魔、若梵，乃至欲與佛論者。」",
        "translation": "Answer: The Buddha said, \"Suppose an ascetic or a brāhmaṇa, a god, a demon, or a Brahmā, or even someone who wants to talk to the Buddha.\"",
        "source": "T25n1509_025:0243b10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論何等法？",
        "translation": "What kinds of things does he discuss?",
        "source": "T25n1509_025:0243b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「佛所不說外諸經書，弊迦蘭那、僧佉、韋陀等十八種大經書。」",
        "translation": "Some people say, \"The Buddha doesn't explain the external scriptures, except for the eighteen kinds of great scriptures like Kalanna, Saṃkhya, and Veda.\"",
        "source": "T25n1509_025:0243b12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「須彌山斤兩，大地深淺，一切草木頭數。」",
        "translation": "Some people say, \"They say, 'The weight of Mount Sumeru, the depth of the earth, and the number of heads of all the grass and trees.'\"",
        "source": "T25n1509_025:0243b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「是常無常、有邊無邊十四難，佛不能答。」",
        "translation": "Some people say, \"These are the fourteen difficult questions about permanence and impermanence, and about existence and limitlessness, which the Buddha can't answer.\"",
        "source": "T25n1509_025:0243b15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「是法色法、無色法，可見、不可見，有對、無對，有漏、無漏，有為、無為等；佛但知一種道事因緣，是異法種種因緣，佛或不悉知。」",
        "translation": "Some people say, \"Regarding these things that are form and formless, visible and invisible, opposable and non- opposable, contaminated and uncontaminated, and created and uncreated, the Buddha only knows the causes and conditions of one path, and he may not know all of the causes and conditions of these different things.\"",
        "source": "T25n1509_025:0243b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「沙門」者，說出家人；「婆羅門」者，說在家有智人；「天」者，說地天、虛空天；魔者，說六欲天；「梵」者，說梵天王為首，及一切色界；「餘」者，除此更有餘人。",
        "translation": "\"Ascetic\" refers to renunciant practitioners; \"brāhmaṇa\" refers to wise people at home; \"heaven\" refers to the earthly gods and sky gods; \"Māra\" refers to the six heavens of desire; \"Brahmā\" refers to Brahmā as the head of the gods and all the form realms; and \"other\" refers to anyone else besides these.",
        "source": "T25n1509_025:0243b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如實」者，若以現事，若以因緣難。",
        "translation": "\"True\" means it's difficult to tell whether it's based on present events or on causes and conditions.",
        "source": "T25n1509_025:0243b22_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「乃至不見是微畏相」者，「相」名因緣。",
        "translation": "\"The expression 'even if I don't see this subtly fearful mark' means 'mark' as cause and condition.",
        "source": "T25n1509_025:0243b23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我不見小小因緣如法能來破我者，以不見故，至誠言「安立阿梨沙(秦言聖主)住處」。",
        "translation": "I don't see how tiny causes and conditions can break me according to the teaching, and because I don't see them, I wholeheartedly say, \"Establish a place for noble lords to abide.\"",
        "source": "T25n1509_025:0243b23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛至誠言：「我一切漏盡。」",
        "translation": "The Buddha said wholeheartedly, \"All of my contaminants have ended.\"",
        "source": "T25n1509_025:0243b25_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人言「是漏不盡」者，無有畏也。",
        "translation": "If someone says, \"These are contaminants that aren't ended,\" they have no fear.",
        "source": "T25n1509_025:0243b26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等是漏？",
        "translation": "What are the contaminants?",
        "source": "T25n1509_025:0243b27_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漏名三漏：欲漏、有漏、無明漏。",
        "translation": "The contaminants are called the three contaminants: contaminants of desire, contaminants of existence, and contaminants of ignorance.",
        "source": "T25n1509_025:0243b27_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，漏名六情中出垢心相應心數法。",
        "translation": "Furthermore, the contaminants are called the mental factors associated with the mind emerging from defilement in the six senses.",
        "source": "T25n1509_025:0243b28_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，如《一切漏障經》中，分別說七漏。",
        "translation": "Furthermore, as the Sutra on All the Contaminants and Hindrances explains, it discerns seven contaminants.",
        "source": "T25n1509_025:0243b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "障道法，名諸有漏業，及一切煩惱、惡道報障；為世間故布施、持戒、修十善道、受諸味禪；略說若能障涅槃，若善、若不善、若無記，是名障道法。",
        "translation": "The obstructions to the path are called the contaminated actions, all the afflictions, and the hindrances of the retribution of bad destinies; if they are generous, observe precepts, cultivate the ten good paths, and accept flavors and meditations for worldly reasons, and if they are capable of obstructing nirvāṇa, whether good, unskillful, or indeterminate, they are called obstructions to the path.",
        "source": "T25n1509_025:0243b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「道名二法：聖定、聖慧。",
        "translation": "Some people say, \"The path is called the two things: noble concentration and noble wisdom.",
        "source": "T25n1509_025:0243c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二事等，達到涅槃。」",
        "translation": "These are the two things and so forth that lead to nirvāṇa.\"",
        "source": "T25n1509_025:0243c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「三聚道：無漏戒、定、慧。」",
        "translation": "Some people say, \"The three categories of the path are uncontaminated morality, concentration, and wisdom.\"",
        "source": "T25n1509_025:0243c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「四法，所謂四聖諦。」",
        "translation": "Some people say, \"The four dharmas are called the four noble truths.\"",
        "source": "T25n1509_025:0243c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人言：「出世間五根。」",
        "translation": "Some say, 'The five supramundane faculties.'",
        "source": "T25n1509_025:0243c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有言：「六出性。」",
        "translation": "Some say, \"The six transcendent natures.\"",
        "source": "T25n1509_025:0243c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有言：「七覺意。」",
        "translation": "Some say, \"The seven factors of awakening and consciousness.\"",
        "source": "T25n1509_025:0243c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有言：「八聖道，達到涅槃。」",
        "translation": "Some say, \"The eight noble paths lead to nirvāṇa.\"",
        "source": "T25n1509_025:0243c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論議師等言：「一切無漏道，達到涅槃。」",
        "translation": "Discursive scholars and others say, \"All uncontaminated paths lead to nirvāṇa.\"",
        "source": "T25n1509_025:0243c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中若有沙門、婆羅門等來，如實言：「是事不爾。」",
        "translation": "Here, suppose an ascetic or brāhmaṇa comes along and says, as it really is, \"That's not the case.\"",
        "source": "T25n1509_025:0243c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至不見是微畏相；以不見故，至誠言：「安立阿梨沙住處。」",
        "translation": "They don't even see this characteristic of subtle fear; because they don't see it, they say with all sincerity, 'Establish an abode for ārṣa.'\"",
        "source": "T25n1509_025:0243c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：何以故佛至誠言「安立阿梨沙住處」？",
        "translation": "Q: Why did the Buddha say sincerely, \"Establish an ārṣa's dwelling place\"?",
        "source": "T25n1509_025:0243c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：自功德具足，亦令眾生得安樂利益。",
        "translation": "Answer: When his own virtues are complete, he also causes sentient beings to attain happiness and benefit.",
        "source": "T25n1509_025:0243c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛自得安樂住處，不能利益眾生，不名「阿梨沙住處」；若但利益眾生，不自具足功德，亦不名「阿梨沙住處」；若自有功德亦利益眾生，以是故至誠言：「我安立阿梨沙住處。」",
        "translation": "If a Buddha attains a comfortable abode for himself but doesn't benefit sentient beings, it wouldn't be called an \"abode of ārṣa\"; if he only benefits sentient beings but doesn't possess his own merits, it wouldn't be called an \"abode of ārṣa\"; if he possesses his own merits and also benefits sentient beings, therefore he sincerely says, \"I have established an abode of ārṣa.\"",
        "source": "T25n1509_025:0243c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛自滅惡，亦滅眾生惡，滅二惡故，第一清淨，妙說法故，安立阿梨沙住處。",
        "translation": "Furthermore, since the Buddha ceases evil in himself and ceases evil in sentient beings, he is the first to be pure because he ceases both evils, and he establishes an ārṣa-abode because he explains the teaching so well.",
        "source": "T25n1509_025:0243c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，四聖諦，三轉十二行，能轉、能分別、顯示、敷演故，至誠言：「我安立阿梨沙住處。」",
        "translation": "Furthermore, because he can transform, discern, reveal, and expound the four noble truths and the three turnings and twelve practices, he sincerely says, \"I have established the abode of ārṣa.\"",
        "source": "T25n1509_025:0243c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，一切疑悔、邪見能除却故，一切甚深問難悉能解釋故，名安立阿梨沙住處(「阿梨沙」：第一、最上、極高、不退、不却、不沒、具足功德，無所減少，是名「阿梨沙住處」)。",
        "translation": "Furthermore, because he can remove all doubt and remorse and mistaken views, and because he can explain all of his profound questions and problems, this is called establishing the abode of ārṣa (\"ārṣa\": the first, highest, most elevated, nonretrogressing, nonreturning, nonperishing, nonperishing, and fully meritorious, with nothing to lose is called the \"abode of ārṣa\").",
        "source": "T25n1509_025:0243c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等因緣功德力故，至誠言：「我安立阿梨沙住處。」",
        "translation": "Because of the merit of such causes and conditions, he says sincerely, \"I have established the abode of ārṣa.\"",
        "source": "T25n1509_025:0243c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「眾中師子吼」者，眾名八眾：沙門眾、婆羅門眾、剎利眾、天眾、四天王眾、三十三天眾、魔眾、梵眾。",
        "translation": "The \"lion's roar of the multitude\" refers to the eight multitudes: the ascetics, the brāhmaṇas, the bhadras, the gods, the four heavenly kings, the Trāyastriṃśa gods, the Māras, and the Brahmās.",
        "source": "T25n1509_025:0243c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生於此八眾，悕望智慧，是故經中但說是八眾。",
        "translation": "Because sentient beings long for wisdom from these eight congregations, the sūtras simply describe them as eight congregations.",
        "source": "T25n1509_025:0243c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中佛師子吼，亦在一切眾中；以是故，此經中言「若復餘眾」。",
        "translation": "Among them, the Buddha's lion's roar is also among all of them; therefore, the sūtra says, \"If it were any other congregation,\" why is that?",
        "source": "T25n1509_025:0243c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0243c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞佛音聲者，盡皆是眾。",
        "translation": "Those who hear the Buddha's voice are all multitudes.",
        "source": "T25n1509_025:0243c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，有人言：「佛獨屏處說法。」",
        "translation": "Furthermore, some people say, \"The Buddha speaks from a solitary, isolated place.\"",
        "source": "T25n1509_025:0244a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故說在眾中作是至誠言：「我有十力、四無所畏。」",
        "translation": "Therefore, he explains that he makes this sincere statement among the multitude, saying, \"I have the ten powers and four forms of fearlessness.\"",
        "source": "T25n1509_025:0244a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名眾中師子吼。",
        "translation": "This is called the lion's roar among the multitude.",
        "source": "T25n1509_025:0244a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛示我是至誠言：「我為一切世間師，一切智人；諸有疑、不信者悉來，我當解釋。」",
        "translation": "Furthermore, the Buddha showed me this utmost sincerity and said, \"I'm the teacher of all the world, the person of all cognition, and I'll explain to all those who have doubts or are unbelieving.\"",
        "source": "T25n1509_025:0244a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故言眾中師子吼。",
        "translation": "That's why it's called the lion's roar among the people.",
        "source": "T25n1509_025:0244a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「師子吼」者，如師子王，清淨種中生，深山、大谷中住，方頰大骨，身肉肥滿，頭大眼長，光澤明淨，眉高而廣，牙利白淨，口鼻方大，厚實堅滿，齒密齊利，吐赤白舌，雙耳高上，髦髮光潤，上身廣大，膚肉堅著，修脊細腰，其腹不現，長尾利爪，其足安立，巨身大力。",
        "translation": "\"Shizi roars\" means a lion king who's born from a pure seed, lives deep in a mountain or a large valley, has large square cheeks and bones, has a full-bodied body, has a big head and long, glossy, pure eyes, high, broad eyebrows, sharp white teeth, a square mouth and nose that are substantial and full, has close-packed teeth, exhales a red-white tongue, has high ears, glossy hair, a large upper body, strong flesh, a slender back, a ridged, slender waist, a belly that doesn't show, a long tail and sharp claws, legs that stand tall, and a large, powerful body.",
        "source": "T25n1509_025:0244a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從住處出，偃脊頻伸，以口扣地，現大威勢；食不過時，顯晨朝相；表師子王力，以威麞鹿、熊羆、虎豹、野猪之屬；覺諸久睡，降伏高強有力勢者，自開行路而大哮吼。",
        "translation": "He emerges from his dwelling place, stretches out his back, snaps his mouth to the ground, and displays great authority; when he doesn't finish his meal, he shows his morning appearance, demonstrates the power of lion king, and uses it to intimidate deer, bears, tigers, panthers, and wild boars; awakens those who have been asleep for a long time, subdues those who are strong and powerful, and opens his own path with a loud roar.",
        "source": "T25n1509_025:0244a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是吼時，其有聞者，或喜或怖；穴處者隱縮，水居者深入，山藏者潛伏，厩象振鎖狂逸而去，鳥飛空中高翔遠逝。",
        "translation": "When he thus roars, those who hear him are either delighted or frightened; those who live in caves retreat, those who live in water dive deep, those who live in mountain retreats, stable elephants scatter wildly with their chains, and birds fly high into the air and depart.",
        "source": "T25n1509_025:0244a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛師子亦如是，從六波羅蜜、古四聖種大姓中生，寂滅大山、深濬禪定谷中住，得一切種智頭，集諸善根頰，無漏正見修目光澤，定慧等行高廣眉，四無所畏牙白利，無礙解脫具足口，四正懃堅滿頤，三十七品齒密齊利，修不淨觀吐赤白舌，念慧耳高上，十八不共法髦髮光潤鮮白，三解脫門上身肉堅著，三示現修脊，明行具足腹不現，忍辱腰纖細，遠離行尾長，四如意足安立，無學五根爪利，十種力勢無量，無漏法眾具足身；諸佛三昧王等住處出，四無礙智頻申諸法地中，著無礙解脫口。",
        "translation": "Thus, the lion of the Buddha is born from among the six perfections, the four ancient holy lineages, the great mountain of cessation, and the valley of profound meditation.",
        "source": "T25n1509_025:0244a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依是十力廣度眾生時不過，示一切世間天及人晨朝相；顯諸法王德，威諸外道論議師黨邪見之屬；覺諸眾生四諦中睡，降伏吾我著五眾者憍慢力，開異學論議諸邪見道。",
        "translation": "Relying on these ten powers, he widely liberates sentient beings without fail, shows the morning appearances of all worldly gods and humans, demonstrates the virtues of Dharma kings, dignifies the mistaken views of non-Buddhists who discuss teachers, parties, and awakens sentient beings to drowsiness in the four truths, subdues our own power to become attached to the arrogance of the five aggregates, and opens the path to heresy by discussing the views of non-Buddhists.",
        "source": "T25n1509_025:0244b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行邪者怖畏，信正者歡喜，鈍者令利；安慰弟子，破壞外道；長壽諸天久受天樂，則知無常。",
        "translation": "He frightens those who act wrongly, pleases those who believe rightly, and gives benefit to the dull; he comforts his disciples and destroys the non-Buddhists; and the long-lived gods, who have long enjoyed the pleasures of heaven, then know that they're impermanent.",
        "source": "T25n1509_025:0244b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是眾生聞四諦師子吼，皆生厭心；厭心故得離，得離故入涅槃。",
        "translation": "Thus, when sentient beings hear the lion's roar of the four truths, they all become disillusioned, and because they're disillusioned, they can part with it, and because they can part with it, they enter nirvāṇa.",
        "source": "T25n1509_025:0244b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名「眾中如師子吼」。",
        "translation": "This is called \"roaring like a lion among many.\"",
        "source": "T25n1509_025:0244b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛師子吼及師子吼有差別：師子吼者，眾獸驚怖，若死、若近死苦；佛師子吼，得免死畏。",
        "translation": "Furthermore, there's a difference between the lion's roar of the Buddha and the lion's roar: the lion's roar terrifies animals that are about to die or experience the pain of death, but the lion's roar of the Buddha frees them from the fear of death.",
        "source": "T25n1509_025:0244b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師子吼怖，世世死苦；佛師子吼但今世死，更無後苦。",
        "translation": "The lion's roar terrifies and causes the suffering of eternal death, but the lion's roar of the Buddha only causes death in this life and no more suffering in the next.",
        "source": "T25n1509_025:0244b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師子吼者，其聲麁惡，物不喜聞，生死怖畏；佛師子吼，其聲柔軟，聞者無厭心，皆深樂，普遍遠聞，能與二種樂：生天樂、涅槃樂。",
        "translation": "The lion's roar has a coarse, unpleasant sound that's displeasing to things and terrifying in terms of birth-and-death, but the lion's roar of the Buddha has a gentle sound that's unwearying, deeply pleasing, and universally heard from afar, and can bring two kinds of happiness: the happiness of birth in heaven and the happiness of nirvāṇa.",
        "source": "T25n1509_025:0244b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為差別。",
        "translation": "These are the differences.",
        "source": "T25n1509_025:0244b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：佛師子吼亦令聞者生怖，與師子吼有何等異？",
        "translation": "Q: The lion's roar of the Buddha also causes fear in those who hear it, so how is it different from the lion's roar?",
        "source": "T25n1509_025:0244b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：聞佛師子吼，當時小怖，後大利益。",
        "translation": "Answer: \"When I heard the Buddha's lion's roar, it was a minor fear at the time and a major benefit later.",
        "source": "T25n1509_025:0244b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著吾我心者，渴愛世間樂人，常顛倒所縛，邪見心者生怖畏。",
        "translation": "That person's mind is attached to self, longs for worldly pleasures, is always mistakenly bound, and has a wrong view of mind that gives rise to fear.",
        "source": "T25n1509_025:0244b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如《經》中言：佛說四諦，乃至上諸天悉皆怖畏，作是念：「我等無常相、苦相、無我相、空相。",
        "translation": "As the Sutra says, \"When the Buddha teaches the Four Truths, even the upper gods are all terrified and think, 'We have no characteristics of permanence, suffering, selflessness, or emptiness.'",
        "source": "T25n1509_025:0244b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0244b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為顛倒心故，著常、樂相。」",
        "translation": "It's because of a mistaken mind that it's attached to the characteristics of permanence and happiness.\"",
        "source": "T25n1509_025:0244b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為差別。",
        "translation": "This is a distinction.",
        "source": "T25n1509_025:0244b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，聞師子吼者，除離欲人，餘者皆怖畏；佛師子吼，求涅槃、離欲人皆怖。",
        "translation": "Furthermore, when someone hears the lion's roar, they're afraid except for those who are free of desire, and when the Buddha's lion roars, those who seek nirvāṇa and those who are free of desire are afraid.",
        "source": "T25n1509_025:0244b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師子吼者，善人、不善人皆怖；佛師子吼者，但善人怖。",
        "translation": "When the lion roars, both good and unskillful people are frightened, but when the Buddha roars, only good people are frightened.",
        "source": "T25n1509_025:0244b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，師子吼，一切時怖畏。",
        "translation": "Furthermore, the lion's roar is feared at all times.",
        "source": "T25n1509_025:0244b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛師子吼雖小怖畏眾生，示世間惡罪，令不樂世間生；觀涅槃功德利益，能除世間種種怖畏；閉惡趣，開善道，能令人到涅槃城。",
        "translation": "Although the lion's roar of the Buddha is a small fear for sentient beings, it shows them the world's bad qualities and causes them to become unhappy with worldly life; it observes the merits and benefits of nirvāṇa, which removes all kinds of worldly fears; it closes bad destinies and opens good paths, which leads them to the city of nirvāṇa.",
        "source": "T25n1509_025:0244b25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，二十事故，佛語名師子吼，所謂依止十力故，不縮故，不展故，梵音故，未曾有故，能引大眾故，惡魔驚怖故，擾亂魔民故，諸天歡喜故，得出魔網故，斷魔縛故，破魔鉤故，過魔界故，自法增長故，減損他法故，果報不誑故，說法不空故，凡夫人入聖道故，入聖道者得具足漏盡故，隨所應得三乘故。",
        "translation": "Furthermore, the words of the Buddha, which are called the lion's roar, describe the ten powers that he relies on, that don't shrink, that don't expand, that are the voice of Brahmā, that are unprecedented, that lead the masses, that terrify demons, that disturb demon folk, that delight the gods, that escape the demon's net, that sever the demon's fetters, that break the demon's hook, that transcend the demon's realm, that increase one's own qualities, that diminish other qualities, that the results aren't deceiving, that the teaching isn't empty, that enter the noble path for ordinary people, that fully end the contaminants for those who enter the noble path, and that attain the three vehicles as they see fit.",
        "source": "T25n1509_025:0244b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，佛語名師子吼。",
        "translation": "For this reason, the Buddha's words are called the lion's roar.",
        "source": "T25n1509_025:0244c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名師子吼總相、別相義。",
        "translation": "This is called the lion's roar in the sense of its general and specific aspects.",
        "source": "T25n1509_025:0244c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「轉梵輪」者，清淨故名「梵」；佛智慧及智慧相應法，是名「輪」；佛之所說，受者隨法行，是名「轉」。",
        "translation": "\"Turning the wheel of Brahmā\" is called \"Brahmā\" because it's pure; Buddha's wisdom and the teaching that goes along with that wisdom are called \"wheel,\" and what the Buddha teaches and what recipients do according to the teaching is called \"turning.\"",
        "source": "T25n1509_025:0244c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是輪以具足四念處為轂，五根、五力為輻，四如意足為堅牢輞，而正懃為密合輪，三解脫為榍，禪定、智慧為調適，無漏戒為塗輪香，七覺意為雜華瓔珞，正見為隨右轉輪，信心清淨為可愛喜，正精進為疾去，無畏師子吼為妙聲。",
        "translation": "This wheel has the four abodes of mindfulness as its hub, the five faculties and five powers as its spokes, the four basis of supernormal power as its solid rim, right endeavor as the closed wheel, the three liberations as their titan, meditation and wisdom as their adaptations, the uncontaminated precepts as their perfume, the seven factors of awakening as their mixed flowers and jewelry, right view as the wheel that turns to the right, pure faith as its desirable joy, right effort as its swift departure, and the fearless lion's roar as its marvelous sound.",
        "source": "T25n1509_025:0244c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能怖魔輪，破十二因緣節解輪，壞生死輪，離煩惱輪，斷業輪，障世間輪，破苦輪；能令行者歡喜，天人敬慕。",
        "translation": "They can terrify the demon wheel, break the wheel of understanding of the 12 factors of dependent arising, destroy the wheel of birth-and-death, escape the wheel of affliction, end the wheel of karma, hinder the worldly wheel, and break the wheel of suffering, which makes practitioners rejoice and gods adore them.",
        "source": "T25n1509_025:0244c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是輪無能轉者，是輪持佛法，以是故名「轉梵輪」。",
        "translation": "There's no one who can turn this wheel, and it's the wheel that maintains the Buddha's teaching; therefore, it's called \"turning the brahma wheel.\"",
        "source": "T25n1509_025:0244c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛轉法輪，如轉輪聖王轉寶輪。",
        "translation": "Furthermore, the Buddha turns the wheel of the Dharma just as the wheel-turning sage king turns the wheel of treasures.",
        "source": "T25n1509_025:0244c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：佛與轉輪聖王有何相似？",
        "translation": "Q: How are the Buddha and the wheel-turning sage king alike?",
        "source": "T25n1509_025:0244c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如王清淨不雜種中生，隨姓家業成就，眾相莊嚴身；王德具足，能轉寶輪，香湯灌頂，受王位於四天下之首，壞除一切賊法，令無敢違。",
        "translation": "Answer: \"Suppose the king is pure and unadulterated, born from a variety of seeds, follows his family's karma, and has a body adorned with many features; he has perfect virtue, turns the jeweled wheel, is consecrated with incense and hot water, takes the king's position at the head of the four worlds, and destroys all the thuggish dharmas so that no one dares to disobey.",
        "source": "T25n1509_025:0244c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶藏豐溢，軍容七寶以為校飾，以四攝法攝取眾生，善用王法，委任貴姓主兵大臣以治國政妙上珍寶樂以布施，有所知念終始無異。",
        "translation": "His treasure house is overflowing, his army is decorated with seven treasures, he takes sentient beings in by the four methods of collecting them, makes good use of the king's teaching, appoints noble lords and ministers of war to govern his country, and delights in giving gifts of the highest treasures, knowing that mindfulness is never different from the beginning.",
        "source": "T25n1509_025:0244c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛法王亦如是。",
        "translation": "So it is with the Buddha, the king of the Dharma.",
        "source": "T25n1509_025:0244c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦牟尼、然燈、寶華等佛，諸佛清淨姓中生，先佛威儀行業，具足三十二相以自莊嚴；聖主威德備具，轉真法輪，智慧甘露味灌智首，於三界中尊，破壞一切煩惱賊，學、無學眾歡喜，所結禁戒無敢違者。",
        "translation": "The Śākyamuni, Rāntō, and Prabhūtaratna buddhas, all born from among the Buddha's pure lineage, were preceded by the Buddha's dignified conduct, fully adorned with the thirty-two marks, were endowed with the noble lord's authority and virtue, turned the true Dharma wheel, were endowed with the taste of the nectar of wisdom, were venerable in the three realms, destroyed all the afflictive thieves, delighted the learned and the untrained, and bound by the precepts that no one would dare to violate.",
        "source": "T25n1509_025:0244c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量法寶藏具足，七覺分寶莊嚴，八萬四千法聚軍，出世間四攝法以攝眾生，知方便說四聖諦法為法王儀，舍利弗、彌勒等大將善治佛國法，諸無漏根、力、覺種種妙寶樂以布施，深求一切眾生善事為所念堅固，是為相似。",
        "translation": "They are replete with an immeasurable store of Dharma treasures, adorned with the seven treasures of the factors of awakening, armed with 84,000 dharmas, collected with the four supramundane dharmas to gather sentient beings, knowing how to skillfully expound the teaching of the four noble truths as the Dharma king's manner, great generals like Śāriputra and Maitreya who skillfully govern the Dharma of the Buddha's land, untainted faculties, powers, and perceptions that are filled with marvelous treasures to be donated, and profoundly seeking the good deeds of all sentient beings to be resolute in their mindfulness, which are similar.",
        "source": "T25n1509_025:0245a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛於轉輪聖王有殊勝：轉輪聖王不離諸煩惱，佛已永離諸煩惱。",
        "translation": "Furthermore, the Buddha is superior to the wheel-turning sage king: The wheel-turning sage king isn't free of the afflictions, but the Buddha is permanently free of the afflictions.",
        "source": "T25n1509_025:0245a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王沒在老死泥，佛已出離。",
        "translation": "The wheel-turning sage king is immersed in the mire of old age and death, but the Buddha has escaped.",
        "source": "T25n1509_025:0245a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王為恩愛僕，佛已過出。",
        "translation": "The wheel-turning sage king is a servant of kindness, but the Buddha has surpassed and escaped.",
        "source": "T25n1509_025:0245a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王行生死險道中，佛已過度。",
        "translation": "The wheel-turning sage king travels through the perilous path of birth-and-death, and the Buddha has crossed it.",
        "source": "T25n1509_025:0245a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王在愚癡闇中，佛住第一光明中。",
        "translation": "The wheel-turning sage king was in the darkness of delusion, but the Buddha abides in the first light.",
        "source": "T25n1509_025:0245a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王極自在四天下，佛自在無量無邊世界。",
        "translation": "The wheel-turning sage king is perfectly at ease in the four worlds, but the Buddha is at ease in measureless and limitless worlds.",
        "source": "T25n1509_025:0245a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王財寶自在，佛心寶自在。",
        "translation": "The wheel-turning sage king is at ease with his wealth and possessions, but the Buddha is at ease with the treasures of his mind.",
        "source": "T25n1509_025:0245a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王渴樂天樂，佛乃至有頂樂已離。",
        "translation": "The wheel-turning sage king longs for the happiness of gods, but the Buddha has parted with even the highest happiness.",
        "source": "T25n1509_025:0245a15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "轉輪聖王從他求樂，佛自心生樂。",
        "translation": "The turn-turning sage king seeks happiness from others, but the Buddha creates happiness in his own mind.",
        "source": "T25n1509_025:0245a16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故，佛於轉輪聖王為最殊勝。",
        "translation": "Because of this, the Buddha is most excellent for wheel-turning sage kings.",
        "source": "T25n1509_025:0245a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，轉輪聖王手轉寶輪，空中無礙；佛轉法輪，一切世間天及人中無礙、無遮。",
        "translation": "Furthermore, when the wheel-turning sage king turns the jeweled wheel in his hand, there's no obstruction in the air, and when the Buddha turns the Dharma wheel, there's no obstruction or obstruction among all the world's gods and humans.",
        "source": "T25n1509_025:0245a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其見寶輪者，眾毒皆滅；遇佛法輪，一切煩惱毒皆滅。",
        "translation": "When he sees the jeweled wheel, all the poisons cease, and when he meets the Buddha's Dharma wheel, all the poisons of affliction cease.",
        "source": "T25n1509_025:0245a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見寶輪者，諸災惡害皆滅；遇佛法輪，一切邪見、疑、悔、災害皆悉消滅。",
        "translation": "When they see the jeweled wheel, all disasters and harms cease, and when they meet the Buddha's Dharma wheel, all wrong views, doubts, regrets, and disasters all cease.",
        "source": "T25n1509_025:0245a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王以是輪治四天下；佛以法輪治一切世間天及人，令得法自在。",
        "translation": "The king rules the four worlds with this wheel, and the Buddha rules all worldly gods and humans with the Dharma wheel, causing them to attain mastery over the Dharma.",
        "source": "T25n1509_025:0245a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為相似。",
        "translation": "This is similar.",
        "source": "T25n1509_025:0245a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，法輪於寶輪大有殊勝：寶輪，欺誑；法輪，堅實。",
        "translation": "Furthermore, the Dharma wheel is much superior to the jeweled wheel: the jeweled wheel is deceptive, but the Dharma wheel is resolute.",
        "source": "T25n1509_025:0245a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，長三毒火；法輪，滅三毒火。",
        "translation": "The jeweled wheel proliferates the three toxic fires, while the Dharma wheel extinguishes the three toxic fires.",
        "source": "T25n1509_025:0245a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，有漏；法輪，無漏。",
        "translation": "The jeweled wheel is contaminated; the Dharma wheel is uncontaminated.",
        "source": "T25n1509_025:0245a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，樂五欲樂；法輪，樂法樂。",
        "translation": "The jewel-wheel, delighting in the five desires and pleasures; the Dharma-wheel, delighting in the pleasures of the Dharma.",
        "source": "T25n1509_025:0245a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，結使處；法輪，非結使處。",
        "translation": "The jeweled wheel is a binding place; the dharma-wheel is a non-binding place.",
        "source": "T25n1509_025:0245a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，有量處行；法輪，無量國行。",
        "translation": "The jeweled wheel, there are measureable places of practice; the dharma-wheel, measureless countries of practice.",
        "source": "T25n1509_025:0245a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，以一心清淨布施故世世可得；法輪，無量阿僧祇劫集一切善業因緣及智慧故得。",
        "translation": "The jeweled wheel is attainable from generation to generation because of single-minded pure generosity, and the dharma wheel is attainable because of the accumulation of all the causes and conditions of good actions and wisdom over measureless incalculable eons.",
        "source": "T25n1509_025:0245a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，王死後更不轉；佛滅度後，法輪猶轉。",
        "translation": "The jeweled wheel doesn't turn after the king's death, but the Dharma wheel continues to turn after the Buddha's passing away.",
        "source": "T25n1509_025:0245b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶輪，在一人；法輪，在一切可度者。",
        "translation": "The jeweled wheel is in one person, and the Dharma wheel is in all those who can be saved.",
        "source": "T25n1509_025:0245b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，「梵」名廣，佛轉法輪十方無不遍故名廣。",
        "translation": "Furthermore, \"Brahma\" is called vast because the Buddha's turning of the wheel of the Dharma in ten directions is not imperishable.",
        "source": "T25n1509_025:0245b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，四梵行心說故名「梵輪」。",
        "translation": "Furthermore, the four Brahma practices are explained in the mind and are therefore called the \"Brahma wheel.\"",
        "source": "T25n1509_025:0245b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛初得道時，梵天王請轉法輪，故名「梵輪」。",
        "translation": "Furthermore, when the Buddha first attained enlightenment, the Brahma gods invited him to turn the wheel of the Dharma, which is why it's called the \"Brahma wheel.\"",
        "source": "T25n1509_025:0245b05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，佛在波羅柰轉法輪，阿若憍陳如得道，聲徹梵天，故名「梵輪」。",
        "translation": "Furthermore, when the Buddha turned the wheel of the Dharma in Vārāṇasī, Ājñāta-kauṇḍinya attained the way and his voice penetrated the Brahma heavens, so he was called the \"Brahma wheel.\"",
        "source": "T25n1509_025:0245b06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，有人貴梵天，欲令歡喜，故名「梵輪」。",
        "translation": "Furthermore, when someone prizes the Brahma gods and wants to make them rejoice, they are therefore called \"brahma wheels.\"",
        "source": "T25n1509_025:0245b08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是故名「梵輪」。",
        "translation": "Because of this, it's called the \"brahma wheel.\"",
        "source": "T25n1509_025:0245b09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：佛或時名「法輪」，或時名「梵輪」，有何等異？",
        "translation": "Q: Sometimes a Buddha is called the \"wheel of the Dharma\" and sometimes he's called the \"wheel of Brahma,\" but what's the difference?",
        "source": "T25n1509_025:0245b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：說梵輪、法輪無異。",
        "translation": "They replied, 'There's no difference between teaching the noble truth and the Dharma wheel.'",
        "source": "T25n1509_025:0245b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，有人言：「說梵輪者，現四無量心；說法輪者，示四諦法。」",
        "translation": "Furthermore, some people say, \"Someone who teaches the Brahma wheel shows the four immeasurable states of mind, and someone who teaches the Dharma wheel shows the teaching of the four truths.\"",
        "source": "T25n1509_025:0245b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，梵輪因四無量心得道是名「梵輪」，依餘法得道是名「法輪」。",
        "translation": "Furthermore, the Brahma wheel's attainment of the path because of the four immeasurable states of mind is called the \"Brahma wheel,\" and attaining the path based on other states is called the \"Dharma wheel.\"",
        "source": "T25n1509_025:0245b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵輪示四禪，法輪示三十七品。",
        "translation": "The brahma wheel shows the four meditations, and the dharma wheel shows the thirty-seven factors.",
        "source": "T25n1509_025:0245b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵輪示修禪定聖道，法輪示修智慧聖道。",
        "translation": "The brahma wheel shows the noble path of cultivating meditation, and the dharma wheel shows the noble path of cultivating wisdom.",
        "source": "T25n1509_025:0245b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等分別梵輪、法輪差別。",
        "translation": "Such is the distinction between the brahma wheel and the dharma wheel.",
        "source": "T25n1509_025:0245b16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：何法是無畏性？",
        "translation": "He asked, \"What's the fearlessness of dharmas?",
        "source": "T25n1509_025:0245b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：佛初得道時，得一切佛法，十力、四無所畏等。",
        "translation": "Answer: When the Buddha first attained the way, he attained all the Buddha's teachings, including the ten powers and the four forms of fearlessness.",
        "source": "T25n1509_025:0245b17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中未來世得四無所畏智相應法，名無所畏。",
        "translation": "Of these, the four associated dharmas of fearless cognition that will be attained in the future is called fearlessness.",
        "source": "T25n1509_025:0245b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如布施時，心中思相應捨法生；又如四無量心相應名慈法門。",
        "translation": "When he gives alms, it's called the Dharma-gate of compassion when his mind associates equanimity with thought, and it's called the concomitant of the four immeasurable states of mind.",
        "source": "T25n1509_025:0245b19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：是四無所畏中有何次第？",
        "translation": "Q: What's the order of these four forms of fearlessness?",
        "source": "T25n1509_025:0245b21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：初無畏中，示人知一切法，知一切法故我漏盡，漏盡故知障漏盡法，斷是障法故說道。",
        "translation": "Answer: \"First, fearlessness shows a person that he knows all things, that he knows all things so that his contaminants will end, that he knows the contaminants that are hindrances will end because the contaminants have ended, and that he explains the path because he has ended these hindrances.",
        "source": "T25n1509_025:0245b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，初無畏如示藥師一切藥草，第二示一切病滅，第三知禁忌，第四示所應食。",
        "translation": "Furthermore, first fearlessness is like showing a pharmacist all the medicinal herbs, second showing the cessation of all illnesses, third knowing the contraindications, and fourth showing what to eat.",
        "source": "T25n1509_025:0245b24_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，初無畏中說一切種智，第二無畏中說無一切煩惱、習，第三無畏中說法無謬失，第四無畏中所說事辦得至涅槃。",
        "translation": "Furthermore, the first fearlessness teaches about all kinds of cognition, the second fearlessness teaches about the absence of all afflictions and accumulations, the third fearlessness teaches that the teaching is without error, and the fourth fearlessness accomplishes what's taught to attain nirvāṇa.",
        "source": "T25n1509_025:0245b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：如般若波羅蜜中說五眾乃至十力、四無所畏、十八不共法皆空，今云何分別說其相？",
        "translation": "Q: If it's said in the perfection of wisdom that the five groups ... the ten powers ... the four fearlessnesses ... the 18 distinctive qualities are empty, how would you now explain their characteristics separately?",
        "source": "T25n1509_025:0245b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：佛法中不可得空，於諸法無所礙；因是不可得空，說一切佛法、十二部經。",
        "translation": "Answer: \"The Buddha's teaching is inaccessibly empty, and there's nothing that obstructs the teachings; because of this inaccessible emptiness, he teaches about all the Buddha's teachings and 12 scriptures.",
        "source": "T25n1509_025:0245c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如虛空無所有，而一切物皆依以長成。",
        "translation": "It's like space, which has nothing, and everything grows from it.",
        "source": "T25n1509_025:0245c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，是十力、四無所畏，不以取相著心分別故，但為度眾生，知眾生從是因緣得解脫。",
        "translation": "Furthermore, these ten powers and four forms of fearlessness are not discriminated by attachment to characteristics, but rather are for the purpose of liberating sentient beings, knowing that sentient beings attain liberation by these causes and conditions.",
        "source": "T25n1509_025:0245c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如藥草，但為差病，不為求藥草相。",
        "translation": "They're like medicinal herbs that only treat illnesses but don't seek the characteristics of medicinal herbs.",
        "source": "T25n1509_025:0245c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如《中論》中說：　「若信諸法空，　　是則順於理；　　若不信法空，　　一切皆違失。",
        "translation": "As the Mādhyamika-śāstra explains, \"If you believe in the emptiness of dharmas, you're following the principle; if you don't believe in the emptiness of dharmas, everything is wrong.",
        "source": "T25n1509_025:0245c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　若以無是空，　　無所應造作，　　未作已有業，　　不作有作者。",
        "translation": "If you believe that this is emptiness, there's nothing to be done, karma that exists before it's done, and authorship that doesn't exist.",
        "source": "T25n1509_025:0245c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如是諸法相，　　誰能思量者？",
        "translation": "Who can fathom such characteristics of dharmas?",
        "source": "T25n1509_025:0245c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　唯有淨直心，　　所說無依止，　　離於有無見，　　心自然內滅。」",
        "translation": "Only with a pure and straight mind that has no support for what's taught and is free of views of existence and nonexistence will the mind naturally cease internally.\"",
        "source": "T25n1509_025:0245c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：聲聞法說十力、四無所畏如是，摩訶衍分別十力、四無所畏復云何？",
        "translation": "Q: If this is how the śrāvaka teachings describe the ten powers and four forms of fearlessness, what about the Mahāyāna discernment of the ten powers and four forms of fearlessness?",
        "source": "T25n1509_025:0245c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：是十力、四無所畏中，盡知、遍知，是摩訶衍中說十力、四無所畏。",
        "translation": "Answer: Of the ten powers and four forms of fearlessness, full knowledge and omniscience are explained in the Mahāyāna as the ten powers and four forms of fearlessness.",
        "source": "T25n1509_025:0245c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：聲聞法中亦說盡知、遍知，云何言摩訶衍中說盡知、遍知？",
        "translation": "Q: It's also said among the śrāvaka teachings to know them completely and omnisciently, so why do you say in Mahāyāna it's said to know them completely and omnisciently?",
        "source": "T25n1509_025:0245c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸論議師說佛盡知、遍知，非佛自說；今說摩訶衍中十力、四無所畏故，佛自說：「我盡知、遍知。」",
        "translation": "Answer: \"The masters of the treatises say that the Buddha knows everything and has full comprehension, but they aren't the Buddha himself who says that; now, when he teaches about the ten powers and four fearlessnesses in Mahāyāna, the Buddha himself says, 'I know everything and have full comprehension.'\"",
        "source": "T25n1509_025:0245c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，為聲聞人說十力、四無所畏，合說四諦、十二因緣等諸聲聞法，皆為到涅槃；今說摩訶衍中十力、四無所畏，合大悲、諸法實相不生不滅說。",
        "translation": "Furthermore, when the ten powers and four fearlessnesses were taught to śrāvakas, it was combined with the explanation of the four truths, the twelve causes and conditions, and other śrāvaka teachings, all of which lead to nirvāṇa; now, the ten powers and four fearlessnesses in the teachings of the Mahāyāna are combined with the explanation of great compassion and the true characteristics of dharmas that neither arise nor cease.",
        "source": "T25n1509_025:0245c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：佛有十力、四無所畏，菩薩有不？",
        "translation": "Q: Do buddhas have the ten powers and four forms of fearlessness, and do bodhisattvas have them?",
        "source": "T25n1509_025:0245c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有。",
        "translation": "Answer: \"Yes.",
        "source": "T25n1509_025:0245c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是？",
        "translation": "What is it?",
        "source": "T25n1509_025:0245c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、發一切智心，堅深牢固力；二者、具足大慈故，不捨一切眾生力；三者、不須一切供養恭敬利故，具足大悲力；四者、信一切佛法，具足生一切佛法及心不厭故，大精進力；五者、一心惠行威儀不壞故，禪定力；六者、除二邊故，隨十二因緣行故，斷一切邪見故，滅一切憶想分別戲論故，具足智慧力；七者、成就一切眾生故，受無量生死故，集諸善根無厭足故，知一切世間如夢故，不厭生死力；八者、觀諸法實相故，知無吾我、無眾生故，信解諸法不出不生故，無生法忍力；九者、入空無相無作解脫門觀故，知見聲聞辟支佛解脫故，得解脫力；十者、深法自在故，知一切眾生心行所趣故，具足無礙智力。",
        "translation": "一者、發一切智心，堅深牢固力；二者、具足大慈故，不捨一切眾生力；三者、不須一切供養恭敬利故，具足大悲力；四者、信一切佛法，具足生一切佛法及心不厭故，大精進力；五者、一心惠行威儀不壞故，禪定力；六者、除二邊故，隨十二因緣行故，斷一切邪見故，滅一切憶想分別戲論故，具足智慧力；七者、成就一切眾生故，受無量生死故，集諸善根無厭足故，知一切世間如夢故，不厭生死力；八者、觀諸法實相故，知無吾我、無眾生故，信解諸法不出不生故，無生法忍力；九者、入空無相無作解脫門觀故，知見聲聞辟支佛解脫故，得解脫力；十者、深法自在故，知一切眾生心行所趣故，具足無礙智力。",
        "source": "T25n1509_025:0245c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩十力。",
        "translation": "These are the ten powers of a bodhisattva.",
        "source": "T25n1509_025:0246a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為菩薩四無所畏？",
        "translation": "What are the bodhisattvas' four powers of fearlessness?",
        "source": "T25n1509_025:0246a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者、一切聞持故，諸陀羅尼得故，憶念不忘故，在眾說法無所畏。",
        "translation": "1. because he hears and retains everything, attains the dhāraṇīs, recollects them without forgetting them, and has no fear when speaking the Dharma in the congregation.",
        "source": "T25n1509_025:0246a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者、一切法中得解脫故，一切法藥分別知用故，知一切眾生根故，在大眾中隨應說法無所畏。",
        "translation": "2. because he attains liberation in all dharmas, discerns the uses of all medicines, and knows the faculties of all sentient beings, he has no fear when teaching the Dharma as it should be taught in the assembly.",
        "source": "T25n1509_025:0246a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者、菩薩常離一切眾畏，不作是念：「十方有來難我者，我不能答。」",
        "translation": "Third, the bodhisattva is always free of all fears and doesn't think, \"There are people in the ten directions who come to me with difficult questions, but I can't answer them.\"",
        "source": "T25n1509_025:0246a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見是相，在大眾中說法無所畏。",
        "translation": "Not seeing such a sign, he has no fear when speaking the Dharma in the midst of the great multitude.",
        "source": "T25n1509_025:0246a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、恣一切人來問難者，一一皆答，能斷疑惑，在大眾中說法無所畏。",
        "translation": "Fourth, he freely answers all those who come to ask questions, answers them all, and is able to cut off doubt and confusion, so he has no fear when teaching the Dharma to the masses.",
        "source": "T25n1509_025:0246a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩四無所畏。",
        "translation": "These are the bodhisattvas' four forms of fearlessness.",
        "source": "T25n1509_025:0246a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「四無礙智」者：義無礙智、法無礙智、辭無礙智、樂說無礙智。",
        "translation": "\"Four kinds of unhindered cognition\" are: unhindered cognition of meaning, unhindered cognition of principles, unhindered cognition of words, and unhindered cognition of delight in explanation.",
        "source": "T25n1509_025:0246a22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「義無礙智」者，用名字、言語所說事，各各諸法相。",
        "translation": "\"Unhindered cognition of meaning\" is the cognition of the characteristics of each dharma that's explained in terms of names and words.",
        "source": "T25n1509_025:0246a23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂堅相，此中地堅相是「義」，地名字是「法」，以言語說地是「辭」，於三種智中樂說自在是「樂說」；於此四事中通達無滯，是名「無礙智」。",
        "translation": "Of these, the solid characteristic of the ground is \"meaning,\" the name of the ground is \"dharma,\" speaking of the ground in words is \"discourse,\" and the ease with which one speaks of the three kinds of cognition is \"pleasant speech.\" To comprehend these four things without obstruction is called \"unhindered cognition.\"",
        "source": "T25n1509_025:0246a24_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濕相水，熱相火，動相風，心思相，五眾無常相，五受眾無常、苦、空相，一切法無我相。",
        "translation": "It's the characteristic of moisture, the characteristic of heat, the characteristic of fire, the characteristic of movement, the characteristic of mind and thought, the characteristic of impermanence of the five aggregates, the characteristic of impermanence, suffering, and emptiness of the five sensations, and the characteristic of the selflessness of all dharmas.",
        "source": "T25n1509_025:0246a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等總相、別相，分別諸法亦如是，是名「義無礙智」。",
        "translation": "Such general and specific characteristics and the discernment of dharmas are likewise called \"unhindered cognition of meaning.\"",
        "source": "T25n1509_025:0246a29_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「法無礙智」者，知是義名字，堅相名為地，如是等一切名字分別中無滯，是名為「法無礙智」。",
        "translation": "\"Unhindered knowledge of principles\" is called \"unhindered knowledge of principles\" when one knows that these are principles in name, that their firmness is called ground, and that there's no obstruction in the discrimination of such and such names.",
        "source": "T25n1509_025:0246b01_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0246b03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離名字，義不可得，知義必由於名，以是故次義有法。",
        "translation": "Apart from names, meaning can't be obtained, knowing that meaning must come from names; therefore, second, meaning has a method.",
        "source": "T25n1509_025:0246b04_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：義之與名為合耶？",
        "translation": "He asked, \"Is meaning combined with names?",
        "source": "T25n1509_025:0246b05_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為離耶？",
        "translation": "Why is it free?",
        "source": "T25n1509_025:0246b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若合名，說火時應燒口；若離，說火時應得水！",
        "translation": "If you combine names, you should burn your mouth when you say fire; if you separate, you should get water when you say fire!",
        "source": "T25n1509_025:0246b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：亦不合，亦不離，古人假為立名以名諸法，後人因是名字識是事，如是各各有名字，是為法。",
        "translation": "Answer: Neither do they fit, nor are they separate from the fact that in the past people nominally established names to name things, and later people knew these things by those names, so each has a name, which is a dharma.",
        "source": "T25n1509_025:0246b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名字及義，云何令眾生得解？",
        "translation": "How can these names and meanings be understood by sentient beings?",
        "source": "T25n1509_025:0246b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當以言辭分別莊嚴，能令人解，通達無滯，是名「辭無礙智」。",
        "translation": "This is called \"wisdom unimpeded in discourse\" when words are used to discern adornment, enabling people to understand it and comprehend it without being obstructed.",
        "source": "T25n1509_025:0246b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說有道理，開演無盡，亦於諸禪定中得自在無滯，是名「樂說無礙智」。",
        "translation": "Explaining the truth and explaining it without end, and attaining ease and freedom in the meditative concentrations, is called \"knowledge unhindered by delightful explanation.\"",
        "source": "T25n1509_025:0246b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一、第四無礙智，在九地中；第二、第三無礙智，在欲界及梵天上。",
        "translation": "The first and fourth unhindered cognitions are found in the nine stages, and the second and third unhindered cognitions are found in the desire realm and the upper Brahma heavens.",
        "source": "T25n1509_025:0246b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二、第三無礙：世智。",
        "translation": "The second and third unhindered: worldly cognition.",
        "source": "T25n1509_025:0246b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一：十智。",
        "translation": "First: ten kinds of cognition.",
        "source": "T25n1509_025:0246b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四：九智。",
        "translation": "The fourth: nine kinds of cognition.",
        "source": "T25n1509_025:0246b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是無礙三種：上、中、下；上諸佛，中大菩薩，下大阿羅漢。",
        "translation": "These are the three kinds of unhindered cognition: higher, middle, and lower; higher buddhas, middle great bodhisattvas, and lower great arhats.",
        "source": "T25n1509_025:0246b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：力、無所畏、無礙，皆是智慧。",
        "translation": "Q: Power, fearlessness, and unhinderedness are all wisdom.",
        "source": "T25n1509_025:0246b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內有力，外無所畏則具足，何以復說無礙？",
        "translation": "When internal power and external fearlessness are present, why is it said to be unimpeded?",
        "source": "T25n1509_025:0246b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：力、無畏已分別。",
        "translation": "Answer: \"Power and fearlessness have been discerned.",
        "source": "T25n1509_025:0246b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人雖無所畏，在大眾中說法而有礙，以是故說四無礙智。",
        "translation": "Although someone has no fear, they're still hindered when they explain the teaching in public, so that's why they explain the four kinds of unhindered cognition.",
        "source": "T25n1509_025:0246b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得是無礙智莊嚴四無所畏，四無所畏莊嚴十力。",
        "translation": "Attaining this unhindered knowledge adorns the four forms of fearlessness, and the four forms of fearlessness adorn the ten powers.",
        "source": "T25n1509_025:0246b20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，說無所畏，或有疑者言：「云何一人於大眾中得無所畏？」",
        "translation": "Furthermore, when fearlessness is explained, some doubters say, \"How does a person attain fearlessness in the midst of a large crowd?\"",
        "source": "T25n1509_025:0246b21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以前有十力，後有四無礙智，是故在大眾中說法無所畏。",
        "translation": "Before the Buddha had the ten powers, and afterward he had the four unhindered cognitions, so he had no fear when speaking the Dharma among the masses.",
        "source": "T25n1509_025:0246b23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等，分別四無礙智。",
        "translation": "This is the kind of explanation that discerns the four kinds of unhindered cognition.",
        "source": "T25n1509_025:0246b24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：摩訶衍中有菩薩四無礙智不？",
        "translation": "Q: Is there the bodhisattva's four kinds of unhindered cognition in Mahāyāna?",
        "source": "T25n1509_025:0246b25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有。",
        "translation": "Answer: \"Yes.",
        "source": "T25n1509_025:0246b26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是？",
        "translation": "What is it?",
        "source": "T25n1509_025:0246b26_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「義無礙智」者，義名諸法實相，不可言說。",
        "translation": "\"Unhindered knowledge of meaning\" means the names of things as they really are, which cannot be explained.",
        "source": "T25n1509_025:0246b26_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "義、名字、語言，不別異，前、後、中亦如是，是名義。",
        "translation": "Meaning, names, and words are not distinct, and the former, latter, and middle are likewise, which are names.",
        "source": "T25n1509_025:0246b27_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不應離名字、語言別有義，三事等故名為義。",
        "translation": "There should be no separate meaning from names and words, and the three things and so forth are therefore called meaning.",
        "source": "T25n1509_025:0246b28_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，一切諸法義了了知，通達無滯。",
        "translation": "Furthermore, he fully understands the meanings of all dharmas and comprehends them without obstruction.",
        "source": "T25n1509_025:0246b29_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名「義無礙智」。",
        "translation": "This is called \"unhindered knowledge of meanings.\"",
        "source": "T25n1509_025:0246c01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「法無礙智」者，法名一切義名字，為知義故。",
        "translation": "\"Unhindered knowledge of dharmas\" is the name of a dharma that has all its meanings in order to know its meaning.",
        "source": "T25n1509_025:0246c01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩入是法無礙智中，常信法，不信人；常依法，不依非法。",
        "translation": "Furthermore, when a bodhisattva enters into this unhindered knowledge of principles, he always believes principles and doesn't believe people, and he always follows principles and doesn't rely on what's not principles.",
        "source": "T25n1509_025:0246c02_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依法者，無非法事。",
        "translation": "When someone relies on the Dharma, there are no things that are not the Dharma.",
        "source": "T25n1509_025:0246c04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0246c04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人一切諸名字及語言知自相離故。",
        "translation": "That person knows the distinctive characteristics of all names and words, so they're free of them.",
        "source": "T25n1509_025:0246c04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，以是法無礙智分別三乘，雖分別三乘而不壞法性。",
        "translation": "Furthermore, with this kind of knowledge of the Dharma that's unhindered, he discerns the three vehicles, but even though he discerns the three vehicles, it doesn't destroy the Dharma nature.",
        "source": "T25n1509_025:0246c05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0246c07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性一相，所謂無相。",
        "translation": "\"The Dharma nature is one aspect, which is called signless.",
        "source": "T25n1509_025:0246c07_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩用是語言說法，知語言空，如響相，所說法示眾生，令信知同法性。",
        "translation": "When a bodhisattva speaks in this language, he knows that language is empty, resounds like a mark, and shows sentient beings the teaching that he's teaching, causing them to believe and know that it's the same Dharma nature.",
        "source": "T25n1509_025:0246c07_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說名字、言語通達無滯。",
        "translation": "The names and words that are spoken are comprehensible and without obstruction.",
        "source": "T25n1509_025:0246c09_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名「法無礙智」。",
        "translation": "This is called \"wisdom unimpeded in regard to the Dharma.\"",
        "source": "T25n1509_025:0246c10_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「辭無礙智」者，以語言說名字義，種種莊嚴語言，隨其所應，能令得解。",
        "translation": "\"Unhindered knowledge of language\" is the ability to understand the meaning of names and various ornate languages by speaking them as they are appropriate.",
        "source": "T25n1509_025:0246c10_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂天語、龍、夜叉、揵闥婆、阿脩羅、迦樓羅、摩睺羅伽等非人語；釋、梵、四天王等世主語，人語；一語、二語、多語；略語、廣語；女語、男語；過去、未來、現在語——如是等語言，能令各各得解。",
        "translation": "They are the words of gods, dragons, yakṣas, gandharvas, asuras, garuḍas, mahoragas, and other nonhumans, the words of lords of the world like Śākyamuni, Brahmā, and the four heavenly kings, and the words of humans, one, two, and many words, brief and extensive words, the words of women and men, and past, future, and present words-such languages are each capable of causing understanding.",
        "source": "T25n1509_025:0246c12_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自語、他語，無所毀譽。",
        "translation": "Their own words and the words of others are not discredited.",
        "source": "T25n1509_025:0246c16_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0246c16_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是一切法不在語中，語是非實義；若語是實義，不可以善語說不善。",
        "translation": "\"These things are not in speech, and speech is not the real meaning; if speech were the real meaning, it wouldn't be possible to speak well and explain what's unwholesome.",
        "source": "T25n1509_025:0246c16_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但為入涅槃故說令解，莫著語言！",
        "translation": "They simply explain and cause understanding for the sake of entering nirvāṇa, so don't get attached to words!",
        "source": "T25n1509_025:0246c18_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，用是語言，能令眾生隨法義行。",
        "translation": "\"Furthermore, using this kind of language can cause sentient beings to act according to the meaning of the teaching.",
        "source": "T25n1509_025:0246c19_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T25n1509_025:0246c20_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言語皆入諸法實相中。",
        "translation": "Both words and speech enter the true characteristics of dharmas.",
        "source": "T25n1509_025:0246c20_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名「辭無礙智」。",
        "translation": "This is called \"knowledge of unhindered speech.\"",
        "source": "T25n1509_025:0246c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「樂說無礙智」者，菩薩於一字中能說一切字，一語中能說一切語，一法中能說一切法。",
        "translation": "\"Wisdom of unhindered delight in explanation\" means that a bodhisattva can explain all words in a single word, all words in a single word, and all dharmas in a single dharma.",
        "source": "T25n1509_025:0246c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是中所說皆是法、皆是實、皆是真，皆隨可度者而有所益。",
        "translation": "Whatever is explained here is a teaching, it's real, and it's true, and it's beneficial to those who can be saved.",
        "source": "T25n1509_025:0246c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂樂修妬路者為說修妬路，樂祇夜者為說祇夜，樂弊迦蘭陀者為說弊迦蘭陀，樂伽陀、優陀那、阿波陀那，一筑多、闍陀、為頭離、頞浮陀達摩、優波提舍，皆為說是經。",
        "translation": "所謂樂修妬路者為說修妬路，樂祇夜者為說祇夜，樂弊迦蘭陀者為說弊迦蘭陀，樂伽陀、優陀那、阿波陀那，一筑多、闍陀、為頭離、頞浮陀達摩、優波提舍，皆為說是經。",
        "source": "T25n1509_025:0246c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨一切眾生根樂說：若好信者為說信根，好精進者為說精進根，好懃念者為說念根，好攝心者為說定根，好智慧者為說慧根。",
        "translation": "They explain it according to the faculties of all sentient beings: those who are good at faith as the faculty of faith, those who are good at effort as the faculty of effort, those who are good at mindfulness as the faculty of mindfulness, those who are good at collecting the mind as the faculty of concentration, and those who are good at wisdom as the faculty of wisdom.",
        "source": "T25n1509_025:0246c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如五根等，一切善根亦如是。",
        "translation": "Such as the five faculties, so too are all the good faculties.",
        "source": "T25n1509_025:0247a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，二萬一千婬欲人根，為是根故，佛說八萬四千治法根，隨是諸根，樂說治法次第，菩薩樂說。",
        "translation": "Furthermore, for the root of 21,000 people who lust, the Buddha teaches 84,000 faculties of correcting the Dharma, and according to those faculties, he's happy to explain the order of the correcting Dharma, which the bodhisattvas are happy to teach.",
        "source": "T25n1509_025:0247a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二萬一千瞋恚人根，為是根故，佛說八萬四千治法根，隨是諸根，樂說治法次第，菩薩樂說。",
        "translation": "For the root of 21,000 people with anger, the Buddha teaches 84,000 remedying faculties that follow these faculties, and he happily explains the order of the remedying faculties, which the bodhisattvas then explain.",
        "source": "T25n1509_025:0247a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二萬一千愚癡人根。",
        "translation": "\"Twenty-one thousand of them are the faculty of foolish people.",
        "source": "T25n1509_025:0247a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是根故。",
        "translation": "It's for these faculties that the Buddha teaches 84,000 faculties of correcting the Dharma, and the bodhisattvas are happy to teach them in order.",
        "source": "T25n1509_025:0247a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說八萬四千治法根，隨是諸根，樂說治法次第，菩薩樂說。",
        "translation": "The Buddha teaches 84,000 faculties that correct the Dharma, and according to those faculties, he's pleased to teach the sequence of the corrective dharmas, which the bodhisattvas are pleased to teach.",
        "source": "T25n1509_025:0247a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二萬一千等分人根，為是根故，佛說八萬四千治法根，隨是諸根，樂說治法次第，菩薩樂說。",
        "translation": "For the root of 21,000 equally-valued human beings, the Buddha teaches 84,000 faculties of remedying the Dharma according to those faculties, and he happily explains the order of the remedying Dharma, which the bodhisattva happily explains.",
        "source": "T25n1509_025:0247a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名「樂說無礙智」。",
        "translation": "This is called \"unhindered knowledge that's comfortable in explaining.\"",
        "source": "T25n1509_025:0247a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，菩薩用是無礙智，若一劫、若半劫，各各莊嚴說法，亦不壞諸法性相。",
        "translation": "Furthermore, with this unhindered knowledge, if a bodhisattva ordains the teaching for an eon or half an eon, it doesn't destroy the nature and characteristics of the dharmas.",
        "source": "T25n1509_025:0247a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩或隱身不現，而為眾生用一切毛孔說法，隨其所應，不失本行。",
        "translation": "This is a bodhisattva who hides his body and doesn't show up, but speaks for sentient beings in all their pores, following what's appropriate and not losing sight of his practice.",
        "source": "T25n1509_025:0247a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩智慧無量，一切論議師不能窮盡，亦不能壞。",
        "translation": "This bodhisattva's wisdom is so limitless that it can't be exhausted by all the advocates of the theory, nor can it be destroyed.",
        "source": "T25n1509_025:0247a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩得是無礙智，轉身受生時，一切五通仙人所有經書、呪術、智慧、技能，自然悉知，所謂四韋陀，六鴦伽呪術，知日月五星經，原夢經，地動，鬼語、鳥語、獸語，四足獸，鬼著人語，國王相占豐儉，日月五星鬪相，醫藥，章，算數，卜，歌舞，伎樂——如是等工巧、技術、諸經盡知，明達過一切人及諸外道；亦不自高，亦不惱他；知是俗事，不為涅槃。",
        "translation": "When he attains this unhindered wisdom and is reborn, the bodhisattva naturally knows all the sūtras, spells, wisdom, and skills of the five magicians, such as the Four Vedas, the Six Aṅga Spells, the Sutra on the Sun, Moon, and Five Stars, the Sutra on the Origin of Dreams, the Sutra on Earth Movement, the speech of ghosts, birds, animals, four-legged animals, the speech of ghosts attached to humans, the king's charts, fortune, the sign of the sun, moon, five stars, medicine, rules, calculations, divination, song, dance, and music-such craftsmanship, skill, and scriptures are all fully known, and their knowledge surpasses that of all people and non-Buddhists; they don't elevate themselves or trouble others; they know these things as mundane and don't attain nirvāṇa.",
        "source": "T25n1509_025:0247a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩成就四無礙智故，色力光明殊於諸梵，諸梵恭敬愛樂尊重，心無所著；為如是等一切諸天所尊重恭敬，亦無所著，但生無常、苦、空、無我心。",
        "translation": "Because this bodhisattva has accomplished the four kinds of unhindered cognition, his form and strength shine brightly above those of the Brahmā, and the Brahmās respect, love, and venerate him, without any attachment at heart; he's respected and venerated by all the gods like this, without any attachment either, but gives rise to the minds of impermanence, suffering, emptiness, and selflessness.",
        "source": "T25n1509_025:0247a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦以神通發起諸天，令心渴仰而為說法，無盡無壞，斷除疑悔，令住阿耨多羅三藐三菩提。",
        "translation": "He also uses his supernormal powers to arouse the gods, cause their hearts to yearn for him, deliver discourses that are inexhaustible and non-destructive, end doubt and remorse, and cause them to abide in unsurpassed, correct, and complete enlightenment.",
        "source": "T25n1509_025:0247a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名摩訶衍中菩薩四無礙智力，能度眾生。",
        "translation": "These are called the four powers of unhindered cognition of the bodhisattvas in Mahāyāna, which are able to save sentient beings.",
        "source": "T25n1509_025:0247b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名四無礙智義。",
        "translation": "This is called the meaning of the four kinds of unhindered cognition.",
        "source": "T25n1509_025:0247b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大智度論卷第二十五",
        "translation": "Dazhidharma-śāstra, Vol. 25",
        "source": "T25n1509_025:0247b03_0",
        "is_bad_quality": false
    }
]