[
    {
        "source_sentence": "聖佛母般若波羅蜜多九頌精義",
        "translation": "Essence of the Nine Verses on the Perfection of Wisdom of the Sacred Buddha-Mothers",
        "source": "T25n1516_002:0899b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論卷下",
        "translation": "second part of the treatise",
        "source": "T25n1516_002:0899b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝德赤衣菩薩造",
        "translation": "created by the victorious red-clothed bodhisattva",
        "source": "T25n1516_002:0899b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試",
        "translation": "Examination of the Tripiṭaka of the Western Paradise Translation Sutra, Chaoshandaifu",
        "source": "T25n1516_002:0899b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鴻臚卿傳梵大師賜紫沙門",
        "translation": "The Great Master Brahmā bestowed the purple brāhmaṇa, as transmitted by the Minister of Education",
        "source": "T25n1516_002:0899b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臣法護等奉　詔譯",
        "translation": "Translated by imperial decree by ministers Fahou and others",
        "source": "T25n1516_002:0899b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中應問：彼勝義諦中云何自性？",
        "translation": "Here, the question should be asked, \"What is its own nature in this ultimate truth?",
        "source": "T25n1516_002:0899b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：頌自喻言「與陽焰等」。",
        "translation": "A: The verse refers to itself as \"the same as a mirage.\"",
        "source": "T25n1516_002:0899b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其「陽焰」者，謂地塵日光三事假合，如陽焰聚，前見後壞，是故頌言「見即壞無相」。",
        "translation": "The term 'mirage' refers to the provisional combination of three things, such as dust on the ground and sunlight, which is like a mirage that breaks up after being seen, which is why the verse says, 'Seeing immediately destroys the marklessness.'",
        "source": "T25n1516_002:0899b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有所得別別境界，其義亦然，雖各表了皆無自性。",
        "translation": "The meaning of the distinct objects that are attained is likewise, even though each is expressed and understood to be without an own-nature.",
        "source": "T25n1516_002:0899b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1516_002:0899b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼等自性前後不和合故，性不相等故。",
        "translation": "Their own natures are not combined before and after, and their natures are not equal.",
        "source": "T25n1516_002:0899b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚者取著，於一性轉，是故此等皆墮世俗有情趣故。",
        "translation": "A foolish person's attachment to that single nature leads them to change, so they all fall into the worldly destiny of sentient beings.",
        "source": "T25n1516_002:0899b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此中若能取、所取對礙性空，即自性明亮本來不生，心法發現猶如影像。",
        "translation": "Furthermore, if the oppositely-obstructed nature of subjective and objective grasping is empty, then the brightness of the self-nature originally doesn't arise, and mental states are discovered to be like images.",
        "source": "T25n1516_002:0899b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為釋此義故，第七頌言：「所取如影像，　　無始從心生，　即彼相及識，　　互相如影像。」",
        "translation": "To explain this meaning, the seventh verse says, \"What's grasped is like an image, which arises from the mind since beginningless time, that is, their marks and consciousness are like images of each other.\"",
        "source": "T25n1516_002:0899b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此言「所取如影像」者，謂此與彼而相似故。",
        "translation": "This expression 'grasped like an image' means that this and that are similar.",
        "source": "T25n1516_002:0899b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所似云何？",
        "translation": "What's the resemblance?",
        "source": "T25n1516_002:0899b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如鏡等中見面等像。",
        "translation": "\"It's like seeing a face and other images in a mirror.",
        "source": "T25n1516_002:0899b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此復云何？",
        "translation": "What does this furthermore mean?",
        "source": "T25n1516_002:0899b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂從心生，以彼唯心有所生故，心即繫屬有其所取外境相等不捨為性。",
        "translation": "It's produced from the mind because it's produced only by the mind, which is bound to the external objects that it grasps equally and doesn't abandon as its nature.",
        "source": "T25n1516_002:0899b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此義終竟。",
        "translation": "This is the end of the definition.",
        "source": "T25n1516_002:0899b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如外所取鏡中面像，即彼諸法以慣習種子領納於心，於無二中取其有二對礙之相。",
        "translation": "\"Furthermore, as an image of a face in a mirror that's grasped from the outside, those things are collected in the mind by the seeds of habituation, and their dualistic counterpart is grasped in the nonduality of their characteristics.",
        "source": "T25n1516_002:0899b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由無始來從心所生如彼影像，或同時異時所緣伺察，彼皆無性非唯心法，亦由所緣之相而能引生能緣識心，是故有相。",
        "translation": "Since beginningless time, images like these have arisen from the mind, or they've been examined in reference to different times at the same time, and they're all without nature and not just mental dharmas, but they also give rise to the consciousness mind that's able to refer to them because of their referential aspects; therefore, they have characteristics.",
        "source": "T25n1516_002:0899c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡言相者，攝集為義。",
        "translation": "Whatever is called a characteristic, it's the meaning of gathering.",
        "source": "T25n1516_002:0899c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非唯一法由彼所取如是有相，能取亦然。",
        "translation": "They aren't the only things that are grasped and thus have form, and the same goes for grasping.",
        "source": "T25n1516_002:0899c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中意者，所取無性、能取不實。",
        "translation": "The idea here is that what's grasped is devoid of nature and what's grasped by the agent is not real.",
        "source": "T25n1516_002:0899c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌言「互相」。",
        "translation": "The verse says, \"mutual.\"",
        "source": "T25n1516_002:0899c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「互相」者，即和合義，互相和合皆如影像。",
        "translation": "\"Mutual\" means combined, and they are all combined with each other like images.",
        "source": "T25n1516_002:0899c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如影像故，能取、所取彼二互相不相離性，即彼二法於無所得中互相從彼心法出現有所得相。",
        "translation": "Because they are like images, the grasper and the grasper are not separate from each other, meaning that these two things appear as something attained from each other's mind and mental factors in the absence of attainment.",
        "source": "T25n1516_002:0899c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此總意者，彼心自性本來明亮，無能取、所取二種之相，本離貪等無明垢染，清淨潔白離諸取著。",
        "translation": "The general idea is that the mind's intrinsic nature is originally bright, free of the two kinds of grasping and appropriation, originally free of the stain of ignorance like greed, and pure and white, free of attachments.",
        "source": "T25n1516_002:0899c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故下頌云「如水中月」。",
        "translation": "That's why the following verse says, \"Like the moon in the water,\"",
        "source": "T25n1516_002:0899c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為釋此義故，第八頌言：「觀自淨種中，　　若智月出現，　彼如水中月，　　現前無所有。」",
        "translation": "To explain this meaning, the eighth verse says, \"If the moon of knowledge were to appear in its own pure form, it would be like the moon in water, with nothing in its present state.\"",
        "source": "T25n1516_002:0899c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「觀」者定義，定謂心一境性相。",
        "translation": "\"Contemplation\" is defined as the one-pointed nature and marks of the mind in concentration.",
        "source": "T25n1516_002:0899c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼定中有所觀想，心自在故。",
        "translation": "When something is contemplated in that concentration, the mind is self-contained.",
        "source": "T25n1516_002:0899c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌言「自」者，謂自種子淨即清淨。",
        "translation": "The verse that says \"own\" means that the own seeds are pure, which is to say that they're purified.",
        "source": "T25n1516_002:0899c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "清淨者，離濁之義。",
        "translation": "Pure is free from the meaning of impurity.",
        "source": "T25n1516_002:0899c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從自身語心種子所成，等無間緣出生想。",
        "translation": "It's formed from the seeds of his own speech and mind, and it's produced by equally and uninterruptedly conditioned conceptions.",
        "source": "T25n1516_002:0899c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "紇哩字變成普遍熾焰光明，於是光中從心種子出甘露光廣大照耀，其光復成極大火輪，乘彼火輪出慧方便。",
        "translation": "The character Uḍri becomes a universally blazing bright light, and in that light, from the mind's seeds comes a vast radiance of ambrosia that shines brightly, and that light then becomes a very large fire wheel, on which wisdom and skillful means emerge.",
        "source": "T25n1516_002:0899c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復從是生彼訶字門。",
        "translation": "From that light also arises the Sanskrit letter ha.",
        "source": "T25n1516_002:0899c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其字振發大聲，於中出現八葉蓮華，訶字處中，內外想布十六分位。",
        "translation": "That character vibrates with a loud sound, in which eight-leaf lotus flowers appear, and the character ha is conceived internally and externally to spread out over 16 parts of the body.",
        "source": "T25n1516_002:0899c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復想迦字成，星宿眾周匝圍繞。",
        "translation": "Again, he conceives of the character ka as being formed and surrounded by a constellation of stars.",
        "source": "T25n1516_002:0899c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復於相應方位想佛蓮華，彼十六分皆成月輪。",
        "translation": "Again, in the corresponding direction, he imagines a lotus of the Buddha, and the sixteen parts of the lotus form a moon wheel.",
        "source": "T25n1516_002:0899c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀已，復於其上自淨種中想現吽字具熾盛光，於其光中出現大火熾盛光焰。",
        "translation": "After observing this, he then also imagines the character un appearing with a blazing light in the self-purifying seeds above it, and a great fire blazing brightly appears in that light.",
        "source": "T25n1516_002:0899c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當觀自身從智月中生菩提心，復從是生金剛智月。",
        "translation": "He should observe that his own mind of enlightenment arises from the wisdom moon, and from that also arises the vajra wisdom moon.",
        "source": "T25n1516_002:0900a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知月者即金剛智普遍世間，智光照耀一切色相。",
        "translation": "You should know that the moon is adamantine wisdom that pervades the world, and its wisdom light shines through all forms and shapes.",
        "source": "T25n1516_002:0900a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故頌言「若智月出現」。",
        "translation": "That's why the verse says, 'If the moon of wisdom were to appear.'",
        "source": "T25n1516_002:0900a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼智金剛成就出生慧及方便無喻涅槃之相，復從慧生金剛界中摩摩枳菩薩相，觀想甚深最上微密三摩鉢底密雲彌布普現光明。",
        "translation": "That vajra of wisdom accomplishes the marks of birth by wisdom and the method of metaphorical nirvāṇa, and from that wisdom comes the mark of Māmakī Bodhisattva in the vajradhātu realm, who contemplates the profound, subtlest, most subtle, and dense samāpatti cloud that spreads out and shines brightly.",
        "source": "T25n1516_002:0900a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其菩薩者，身相青色，八臂三面：正面青色、右面黃色、左面白色；右第一手執劍、第二手執箭、第三手執鉤、第四手執金剛杵；左第一手執輪、第二手執弓、第三手執羂索、第四手執鈴。",
        "translation": "That bodhisattva has a bluish body with eight arms and three faces: bluish on the front, yellow on the right, and white on the left; a sword in the first hand on the right, an arrow in the second, a hook in the third, and a vajra in the fourth; and a wheel in the first hand on the left, a bow in the second, a noose in the third, and a bell in the fourth.",
        "source": "T25n1516_002:0900a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼菩薩理智相合，諸所施作皆順方便。",
        "translation": "That bodhisattva's principle and wisdom converge, and whatever he does, he does it skillfully.",
        "source": "T25n1516_002:0900a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾相莊嚴，頂戴阿閦佛冠，現於熙怡可愛之相，加趺而坐。",
        "translation": "Adorned with a multitude of features, he wears the crown of Akṣobhya, displays a pleasant and lovely appearance, and sits cross-legged.",
        "source": "T25n1516_002:0900a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如阿多西清淨之華具有日輪最勝圓光，復如大樂自性金剛薩埵之相，灑諸甘露遍於一切。",
        "translation": "He resembles the pure flower of Akṣobhya with the sun's most brilliantly brilliant rays and the great bliss of the self-nature of Vajrasattva, who sprinkles sweet dew all over.",
        "source": "T25n1516_002:0900a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此菩薩身即如來身，從慧方便之所出生。",
        "translation": "This bodhisattva's body is the Tathāgata's body, which is born from the wisdom and skillful means.",
        "source": "T25n1516_002:0900a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故頌言「如水中月」。",
        "translation": "That's why the verse says, \"Like the moon in the water.\"",
        "source": "T25n1516_002:0900a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌言「若」者，即是如義，如水月故。",
        "translation": "The verse says \"if\" because it means thus, like the moon in water.",
        "source": "T25n1516_002:0900a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即是空，從是空法之中出生諸法，其所出生即本來不生性，所以喻言如水中月。",
        "translation": "This is emptiness, and out of this empty dharma come dharmas that are originally unarisen, which is why it's called like the moon in the water.",
        "source": "T25n1516_002:0900a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中如是，若於法界自性中取著有性者而實無性。",
        "translation": "In this way, if someone were to attach to the existence of a nature in the self-nature of the Dharma realm, they would really have no nature.",
        "source": "T25n1516_002:0900a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1516_002:0900a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌言「現前無所有」故。",
        "translation": "The verse says, \"Nothing exists in the present.\"",
        "source": "T25n1516_002:0900a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼如是於一切法無所得真如中有所作所證而實不能，若有作有證者皆是方便建立諸法，與虛空等。",
        "translation": "Because they thus create and realize something in the ungraspable true nature of all things that really can't be, if they create and realize anything, it's a method of establishing all things, just like space.",
        "source": "T25n1516_002:0900a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為證成此義故，第九頌言：「若相應者智，　　彼即虛空相，　是故智所知，　　皆如虛空相。」",
        "translation": "To realize this meaning, the ninth verse says, \"If someone has knowledge that's associated with them, they are the marks of space; therefore, knowledge that's known is like the marks of space.\"",
        "source": "T25n1516_002:0900a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言「相應」，當知即是智之與定二法相應。",
        "translation": "By \"associated with,\" it should be understood to mean that cognition corresponds to both concentration and dharmas.",
        "source": "T25n1516_002:0900a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼之相應即是金剛，有彼相應法，故名相應者。",
        "translation": "Their concomitant is the vajra, and because there's a concomitant of that, it's called a concomitant.",
        "source": "T25n1516_002:0900a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼相應者所有之智，於一切法無所取無二相中，以慧方便生如來身，非如前說蘊處界等戲論自性。",
        "translation": "From that knowledge that's associated with that, the Tathāgata's body is produced by the skillful means of wisdom in the absence of grasping anything and the absence of two characteristics of all things, not by conceptualizing the own-nature of the aggregates, fields, and so forth as explained earlier.",
        "source": "T25n1516_002:0900a30_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此義終竟。",
        "translation": "This is the end of the explanation.",
        "source": "T25n1516_002:0900b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然如來身，不動法界自性所成，本來不生。",
        "translation": "Still, the Tathāgata's body, which is formed from the intrinsic nature of the immovable Dharma realm, doesn't arise in the first place.",
        "source": "T25n1516_002:0900b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T25n1516_002:0900b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以如來等自性離故。",
        "translation": "It's because the tathāgatas and so forth are free of their own nature.",
        "source": "T25n1516_002:0900b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即無性，止不可說。",
        "translation": "This is called the absence of nature, which stops short of being completely inexplicable.",
        "source": "T25n1516_002:0900b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無性」者，謂本來不生，故名無性。",
        "translation": "\"Without nature\" means that it doesn't arise in the first place, so it's called having no nature.",
        "source": "T25n1516_002:0900b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故頌言「如虛空相」。",
        "translation": "That's why the verse says, \"Like the marks of space.\"",
        "source": "T25n1516_002:0900b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此復云何？",
        "translation": "What does this furthermore mean?",
        "source": "T25n1516_002:0900b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂離一切戲論之性故如虛空，以彼虛空如是相故，而虛空相應當如是如理伺察。",
        "translation": "It means that they are like space because they are free of all conceptual proliferation, and the form of space should be investigated in this way according to reality because it thus has form.",
        "source": "T25n1516_002:0900b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「相」者，標表義。",
        "translation": "The word \"marks\" refers to the denotation.",
        "source": "T25n1516_002:0900b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次當知，於一切法無障礙自性中有所作用者，謂由智入三界心、心所相。",
        "translation": "\"Furthermore, you should know that someone who has an effect in the unobstructed nature of all things is someone who enters the three realms by knowing the characteristics of mind and mind as objects.",
        "source": "T25n1516_002:0900b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如虛空相」，顯示所知無明隨現有情及器二世間相蘊處界等戲論自性，是即所知為智境界。",
        "translation": "\"Like the marks of space\" shows the conceptual nature of the knowables and ignorance that follows the conceptualization of sentient beings and the two worldly forms, aggregates, fields, and realms, which is the knowable as the cognitive realm.",
        "source": "T25n1516_002:0900b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所作性，此所知境隨有繫屬，覺了所知遍計諸境，是故此說名為所知。",
        "translation": "Because of its contrivance nature, this object of knowing is bound up with whatever it is, and awareness of knowing pervades all objects, which is why it's called knowing.",
        "source": "T25n1516_002:0900b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以一切智、一切智智此之二種皆如虛空，應如是觀。",
        "translation": "Therefore, these two kinds of cognition of everything and cognition of everything are like space and should be observed as such.",
        "source": "T25n1516_002:0900b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為總攝此義故，頌言「皆」。",
        "translation": "To summarize this meaning, the verse says \"all.\"",
        "source": "T25n1516_002:0900b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「皆」者無餘義，無餘少分故。",
        "translation": "\"The meaning of 'all' is without remainder, because there's no other little part.",
        "source": "T25n1516_002:0900b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中除彼聲聞人中樂欲取證有餘依涅槃者，彼雖證得人無我理，謂於蘊事取為有故，餘證無餘依涅槃解脫相者今此所攝。",
        "translation": "Except for those śrāvakas who delight in grasping to the realization of nirvāṇa with remainder, even though they realize the principle that humans lack self, which is to say that they grasp the things in the aggregates as existent, the rest realize the liberating aspect of nirvāṇa without remainder, which is now included here.",
        "source": "T25n1516_002:0900b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所言一切種一切一切有皆空，此中又除一分外道所說之空。",
        "translation": "As the Buddha said, all kinds of all existences are empty, except for a part of them that's explained as empty by non-Buddhists.",
        "source": "T25n1516_002:0900b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，此中應知世間無復少法可有，一切如彼虛空之相。",
        "translation": "Because of this, it should be known that there's no more little dharma in the world that can exist, and everything is like the marks of space.",
        "source": "T25n1516_002:0900b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言「如虛空相」者，當知即是虛空自性如是真實。",
        "translation": "The expression \"like the marks of space\" should be understood to mean that the own-nature of space is just as it really is.",
        "source": "T25n1516_002:0900b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之九頌如所說已，復為顯示諸菩薩等種智果故，總說頌曰：　如理思惟此實性，　　彼一切性無所依，　所有菩提勝願心，　　大智莊嚴當獲得。",
        "translation": "After these nine verses have been spoken, the verse is then summarized to show the results of various kinds of wisdom of the bodhisattvas, saying, \"Thus contemplate this true nature, which has no basis in any of its natures, and with the mind of superior aspiration for enlightenment, the great adornment of wisdom will be attained.",
        "source": "T25n1516_002:0900b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖佛母般若波羅蜜多九頌精義論卷下",
        "translation": "The Essence of the Nine Verses of the Holy Buddha Mother's Treatise on the Perfection of Wisdom, Volume 2",
        "source": "T25n1516_002:0900b30_0",
        "is_bad_quality": false
    }
]