[
    {
        "source_sentence": "阿毘達磨集異門足論卷第二十",
        "translation": "Collection of Different Aspects of the Abhidharma Path, Volume XX",
        "source": "T26n1536_020:0449c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者舍利子說",
        "translation": "Venerable Śāriputra said",
        "source": "T26n1536_020:0449c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T26n1536_020:0449c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十法品第十一之二",
        "translation": "Eleventh and Second of the Ten Dharma Stages",
        "source": "T26n1536_020:0449c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：青遍處定加行云何？",
        "translation": "Q: What is the application of the meditative practice of the pervasive blue zone?",
        "source": "T26n1536_020:0449c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便而能證入青遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the blue-permeable zone concentration?",
        "source": "T26n1536_020:0449c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：初修業者創修觀時，於此世界或取青樹、或取青葉、或取青花、或取青果、或取青衣、或取種種青莊嚴具、或取青雲、或取青水、或取種種諸餘青物。",
        "translation": "A: When someone first cultivates karma and creates an observation, they might take a blue tree, a blue leaf, a blue flower, a blue fruit, a blue robe, various kinds of blue adornments, a blue cloud, blue water, or various other blue things from this world.",
        "source": "T26n1536_020:0449c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於如是隨取一相，以勝解力繫念思惟假想觀察安立信解是某青相。",
        "translation": "Taking any one of these things, he fixes his thoughts, considers, hypothesizes, observes, and establishes his belief that it's a certain blue color with the power of resolute understanding.",
        "source": "T26n1536_020:0449c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由於此以勝解力繫念思惟假想觀察安立信解是某青故，心便散動馳流諸相，不能一趣繫念一境，思惟此境是青非餘。",
        "translation": "As a result of this fixation, contemplation, and imagination with the power of resolute understanding, he imagines that he's observing a certain blue color with certainty and confidence, and his mind then distracts and flows through the various forms, unable to fixate on a single object with a single purpose and contemplate that this object is blue and not some other thing.",
        "source": "T26n1536_020:0449c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境定是青故，未能證入青遍處定。",
        "translation": "That person's mind is distracted by distracting and fleeting forms, and they can't fix their thoughts on one object and contemplate that this object is definitely blue, so they fail to realize the pervasive concentration of blue.",
        "source": "T26n1536_020:0449c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於一青相繫念思惟，謂此是青非為黃等。",
        "translation": "In order to manage the mind's distractions and tendencies, they fix their thoughts on a single cyan form, saying, 'This is cyan, not yellow,' and so forth.",
        "source": "T26n1536_020:0449c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行能入青定。",
        "translation": "He diligently and vigorously contemplates this aspect, even to the point of causing his mind to continue to abide for a long time, and because of this applied practice, he's able to enter the concentration of blue.",
        "source": "T26n1536_020:0449c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of production that's induced by applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0449c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境定是青相。",
        "translation": "Once he has repeatedly cultivated and cultivated the numerous actions that arise in the path that's led by applied practices, his mind then abides equally abiding and near abiding, continuously fixes his attention on one object, and contemplates that this object is definitely a blue shape.",
        "source": "T26n1536_020:0449c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境定是青相，無二無轉能入青定，而未能入青遍處定。",
        "translation": "Because the mind is stably abiding near the abode, continuously fixing its attention on one object, and contemplating that this object is certainly the blue phase, it's without duality or change able to enter the blue concentration but unable to enter the blue-permeating concentration.",
        "source": "T26n1536_020:0449c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若此未能入青遍處定者，青遍處定加行云何？",
        "translation": "Q: If he can't enter the pervasive blue concentration, what are the preparatory practices for the pervasive blue concentration?",
        "source": "T26n1536_020:0450a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便乃能證入青遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the concentration of the blue perimeter?",
        "source": "T26n1536_020:0450a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：即依如前所入青定，令心隨順調伏趣向，漸次柔和周遍柔和。",
        "translation": "A: That is, he relies on the blue concentration he's entered as before, causing his mind to conform, tame, and head toward it, gradually becoming softer and more gentle all around.",
        "source": "T26n1536_020:0450a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一趣定已，復想此青漸次增廣，東南西北遍皆是青。",
        "translation": "After one point of concentration, he also thinks of this blue color gradually increasing in breadth, and the southeast and northwest are all blue.",
        "source": "T26n1536_020:0450a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼想此青漸次增廣，東南西北遍是青故，心便散動馳流諸相，不能一趣繫念一境，思惟此境遍皆是青。",
        "translation": "As he conceives of this blue color gradually increasing in breadth, the southeast and northwest are all blue, so his mind is distracted by various appearances, unable to fix its attention on a single object, and he contemplates that this object is all blue.",
        "source": "T26n1536_020:0450a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境遍是青故，未能證入青遍處定。",
        "translation": "Because their mind is distracted by distracting and fleeting forms, it can't fix its attention on one object and contemplate that this object is all blue, so it's not possible to realize the concentration of the pervasive range of blue.",
        "source": "T26n1536_020:0450a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於遍青相繫念思惟，此遍是青非遍黃等。",
        "translation": "In order to gather the mind that's distracted and washes about, he fixes his thoughts on the pervasive shape of blue, contemplating that it's pervasively blue and not pervasively yellow.",
        "source": "T26n1536_020:0450a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯如行乃漸能入青遍處定。",
        "translation": "He diligently and boldly contemplates this aspect ... causes his mind to persist for a long time, and as a result of this kind of practice, he can gradually enter the pervasive blue concentration.",
        "source": "T26n1536_020:0450a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已。",
        "translation": "After diligently and repeatedly cultivating this applied practice, he then further cultivates the method of this concentration.",
        "source": "T26n1536_020:0450a13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復進修行此定方便。",
        "translation": "then he'll further cultivate the method of practicing this concentration.",
        "source": "T26n1536_020:0450a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂於加行所引生道。",
        "translation": "This is called the path of birth that's induced by applied practices.",
        "source": "T26n1536_020:0450a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數習數修數多所作。",
        "translation": "It's repeatedly cultivated, repeatedly cultivated, and repeatedly created.",
        "source": "T26n1536_020:0450a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道。",
        "translation": "Since it's the path of birth that's brought about by applied practices, he repeatedly cultivates it and cultivates the numerous things that are created.",
        "source": "T26n1536_020:0450a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數習數修數多所作。",
        "translation": "It's repeatedly cultivated, repeatedly cultivated, and repeatedly performed.",
        "source": "T26n1536_020:0450a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心便安住等住近住。",
        "translation": "The mind then remains equally abiding and nearly abiding.",
        "source": "T26n1536_020:0450a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相續一趣繫念一境。",
        "translation": "It's continuously fixing its attention on one object in a single path.",
        "source": "T26n1536_020:0450a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此境遍皆是青。",
        "translation": "He thinks, 'This object is entirely blue.'",
        "source": "T26n1536_020:0450a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住。",
        "translation": "Because the mind is stably abiding, it's equally abiding and nearly abiding.",
        "source": "T26n1536_020:0450a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相續一趣繫念一境。",
        "translation": "It's continuously fixated on one object and is mindful of that object.",
        "source": "T26n1536_020:0450a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此境遍皆是青。",
        "translation": "He contemplates that this object is entirely blue.",
        "source": "T26n1536_020:0450a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無二無轉從此乃入青遍處定。",
        "translation": "From this point on, there's no duality or change, and he enters the concentration of the pervasive blue color.",
        "source": "T26n1536_020:0450a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言上下者，謂上下方。",
        "translation": "When he says \"above and below,\" he means above and below.",
        "source": "T26n1536_020:0450a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言傍布者，謂東南等。",
        "translation": "By adjacent, I mean southeast and so forth.",
        "source": "T26n1536_020:0450a20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無二者，謂無間雜。",
        "translation": "By no duality, it means there's no intermingling.",
        "source": "T26n1536_020:0450a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊無際者，謂邊際難測。",
        "translation": "'Unlimited and limitless' means the limit is unfathomable.",
        "source": "T26n1536_020:0450a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第五者，謂諸定中漸次順次相續次第數為第五。",
        "translation": "\"This is the fifth, which refers to the fifth of these concentrations in terms of the number of progressive, sequential, and successive orderings.",
        "source": "T26n1536_020:0450a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遍處者，謂此定中所有善色受想行識，皆名遍處。",
        "translation": "The term \"pervasive range\" refers to the fact that all the good forms, feelings, perceptions, volitions, and consciousnesses in this concentration are called pervasive ranges.",
        "source": "T26n1536_020:0450a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：黃遍處定加行云何？",
        "translation": "Q: \"What are the preparatory practices of the yellow pervasive concentration?",
        "source": "T26n1536_020:0450a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便而能證入黃遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the concentration of the yellow perceptual field?",
        "source": "T26n1536_020:0450a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：初修業者創修觀時，於此世界或取黃樹、或取黃葉、或取黃花、或取黃果、或取黃衣、或取種種黃莊嚴具、或取黃雲、或取黃水、或取種種諸餘黃物。",
        "translation": "A: When someone first cultivates karma and creates an observation, they might take a yellow tree, yellow leaves, yellow flowers, yellow fruit, yellow clothing, various kinds of yellow adornments, yellow clouds, yellow water, or various other yellow things from this world.",
        "source": "T26n1536_020:0450a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於如是隨取一相，以勝解力繫念思惟假想觀察安立信解是某黃相。",
        "translation": "Taking any one of these things, he fixes his thoughts, considers, hypothesizes, observes, and establishes his belief that it's a certain yellow shape with the power of resolute understanding.",
        "source": "T26n1536_020:0450a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由於此以勝解力繫念思惟假想觀察安立信解是某黃故，心便散動馳流諸相，不能一趣繫念一境，思惟此境是黃非餘。",
        "translation": "As a result of that fixation, contemplation, and imagination with the power of resolute understanding, he imagines that he's observing a certain yellow color with certainty and confidence, and his mind then distracts and flows through the various forms, unable to fixate on a single object with a single purpose and contemplate that this object is yellow and not some other thing.",
        "source": "T26n1536_020:0450b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境定是黃故，未能證入黃遍處定。",
        "translation": "That person's mind is distracted by distracting and fleeting forms, can't fix its attention on a single object, and doesn't realize the pervasive yellow concentration because it contemplates that this object is definitely yellow.",
        "source": "T26n1536_020:0450b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於一黃相繫念思惟，謂此是黃非為青等。",
        "translation": "In order to manage the mind's distracted, fleeting forms, he fixes his thoughts on one yellow form, saying, 'This is yellow, not blue.'",
        "source": "T26n1536_020:0450b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行能入黃定。",
        "translation": "He diligently and vigorously contemplates this aspect, even to the point of causing his mind to continuously abide, and because of this applied practice, he's able to enter the yellow concentration.",
        "source": "T26n1536_020:0450b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of production that's induced by the applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0450b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境定是黃相。",
        "translation": "Once he has repeatedly accumulated, cultivated, and performed numerous actions in the path of production that's led by applied practices, his mind then abides equally abiding and near abiding, continuously fixes his attention on one object, and contemplates that this object is definitely the yellow form.",
        "source": "T26n1536_020:0450b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境定是黃相，無二無轉能入黃定，而未能入黃遍處定。",
        "translation": "As the mind is stably abiding near abiding, continuously fixing its attention on one object, and contemplating that this object is definitely the yellow phase, it's without duality or change able to enter the yellow concentration but unable to enter the yellow pervasive concentration.",
        "source": "T26n1536_020:0450b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若此未能入黃遍處定者，黃遍處定加行云何？",
        "translation": "Q: If he can't enter yellow-permeating concentration, what are the preparatory practices for yellow-permeating concentration?",
        "source": "T26n1536_020:0450b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便乃能證入黃遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the concentration of the yellow perceptual field?",
        "source": "T26n1536_020:0450b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：即依如前所入黃定，令心隨順調伏趣向，漸次柔和周遍柔和。",
        "translation": "A: That is, based on the yellow concentration that he entered as before, he causes his mind to conform, tame, and head toward it, gradually becoming softer and more pervasive.",
        "source": "T26n1536_020:0450b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一趣定已，復想此黃漸次增廣，東南西北遍皆是黃，彼想此黃漸次增廣，東南西北遍是黃故，心便散動馳流諸相，不能一趣繫念一境，思惟此境遍皆是黃。",
        "translation": "After one point of concentration, he also thinks that this yellow color gradually increases in breadth, and that the southeast and northwest are all yellow. As he thinks that this yellow color gradually increases in breadth, and that the southeast and northwest are all yellow, his mind then distracts himself with various characteristics, and he can't fix his attention on one object and contemplate that this object is yellow everywhere.",
        "source": "T26n1536_020:0450b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境遍是黃故，未能證入黃遍處定。",
        "translation": "Because their mind is distracted by distracting and fleeting forms, it can't fix its attention on one object and contemplate that this object is yellow everywhere, so it's not able to realize the concentration of the pervasive yellow place.",
        "source": "T26n1536_020:0450b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於遍黃相繫念思惟，此遍是黃非遍青等。",
        "translation": "In order to gather the mind that's distracted and washes about, he fixes his thoughts on the pervasive yellow form and contemplates that it's pervasively yellow and not pervasively blue.",
        "source": "T26n1536_020:0450b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行乃漸能入黃遍處定。",
        "translation": "He diligently and vigorously contemplates this aspect until he causes his mind to continue to abide for a long time, and as a result of this applied practice, he'll gradually be able to enter the yellow pervasive concentration.",
        "source": "T26n1536_020:0450b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of birth that's brought about by applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0450b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境遍皆是黃。",
        "translation": "Once he has repeatedly cultivated and cultivated the numerous actions that arise in the path that's led by applied practices, his mind then abides equally abiding and near abiding, continuously fixes his attention on one object, and contemplates that this object is yellow everywhere.",
        "source": "T26n1536_020:0450c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境遍皆是黃，無二無轉從此乃入黃遍處定。",
        "translation": "As the mind settles into equipoise and near-abiding, continues to fix its attention on one object, and contemplates that this object is yellow throughout, there's no duality or change, and from there it enters the concentration of the yellow perceptual field.",
        "source": "T26n1536_020:0450c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言上下者，謂上下方。",
        "translation": "When he says \"above and below,\" he means above and below.",
        "source": "T26n1536_020:0450c05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言傍布者，謂東南等。",
        "translation": "By \"adjacent,\" I mean southeast and so forth.",
        "source": "T26n1536_020:0450c06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無二者，謂無間雜。",
        "translation": "By no duality, it means there's no intermingling.",
        "source": "T26n1536_020:0450c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊無際者，謂邊際難測。",
        "translation": "'\"Limitless and endless\" means the limit is unfathomable.",
        "source": "T26n1536_020:0450c07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第六者，謂諸定中漸次順次相續次第數為第六。",
        "translation": "\"This is the sixth, which refers to the sixth of the gradual sequential order of successive numbers of concentrations.",
        "source": "T26n1536_020:0450c07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遍處者，謂此定中所有善色受想行識，皆名遍處。",
        "translation": "When it says pervasive, it means that all the good forms, feelings, perceptions, volitions, and consciousnesses in this concentration are called pervasive.",
        "source": "T26n1536_020:0450c09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：赤遍處定加行云何？",
        "translation": "Q: \"What are the preparatory practices of the red-pervasive concentration?",
        "source": "T26n1536_020:0450c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便而能證入赤遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the red-field concentration?",
        "source": "T26n1536_020:0450c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：初修業者創修觀時，於此世界或取赤樹、或取赤葉、或取赤花、或取赤果、或取赤衣、或取種種赤莊嚴具、或取赤雲、或取赤水、或取種種諸餘赤物。",
        "translation": "A: When someone first cultivates karma and creates an observation, they might take a red tree, red leaves, red flowers, red fruit, red clothing, various red adornments, red clouds, red water, or various other red things from this world.",
        "source": "T26n1536_020:0450c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於如是隨取一相，以勝解力繫念思惟假想觀察安立信解是某赤相。",
        "translation": "Taking any one of these things, he fixes his thoughts, considers, hypothesizes, observes, and establishes his belief that it's some kind of red mark with the power of resolute understanding.",
        "source": "T26n1536_020:0450c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由於此以勝解力繫念思惟假想觀察安立信解是某赤故，心便散動馳流諸相，不能一趣繫念一境，思惟此境是赤非餘。",
        "translation": "As a result of that fixation, contemplation, and imagination with the power of resolute understanding, they falsely observe that the certain redness is established with confidence, and their mind then scatters and flows through the various forms, unable to fixate on a single object with a single purpose and contemplate that this object is red and not some other.",
        "source": "T26n1536_020:0450c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境定是赤故，未能證入赤遍處定。",
        "translation": "That person's mind is distracted by distracting and chasing after various appearances, and they can't fix their attention on one object and contemplate that this object is definitely red, so they fail to realize the concentration of the red perceptual field.",
        "source": "T26n1536_020:0450c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於一赤相繫念思惟，謂此是赤非為黃等。",
        "translation": "In order to gather the mind that's distracted and washes about, he fixes his thoughts on a red object, thinking, \"This is red, not yellow,\" and so forth.",
        "source": "T26n1536_020:0450c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行能入赤定。",
        "translation": "He diligently and vigorously contemplates this aspect, even to the point of causing his mind to continuously abide, and because of this applied practice, he's able to enter red concentration.",
        "source": "T26n1536_020:0450c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of production that's induced by applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0450c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境定是赤相。",
        "translation": "Once he has repeatedly accumulated, cultivated, and performed numerous actions in the path of production that's led by applied practices, his mind then abides equally abiding and near abiding, continuously fixes its attention on one object, and contemplates that this object is definitely red in color.",
        "source": "T26n1536_020:0450c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境定是赤相，無二無轉能入赤定，而未能入赤遍處定。",
        "translation": "Because the mind is stably abiding near the abode, continuously fixing its attention on one object, and contemplating that this object must be red, it's without duality or change able to enter red concentration but unable to enter red-permeating concentration.",
        "source": "T26n1536_020:0450c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若此未能入赤遍處定者，赤遍處定加行云何？",
        "translation": "Q: If he can't enter the red-permeating-place concentration, what are the preparatory practices for the red-permeating-place concentration?",
        "source": "T26n1536_020:0451a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便乃能證入赤遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the red-field concentration?",
        "source": "T26n1536_020:0451a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：即依如前所入赤定，令心隨順調伏趣向，漸次柔和周遍柔和。",
        "translation": "A: That is, he relies on the red concentration he's entered as before, causing his mind to conform, tame, and head toward it, gradually softening it and making it gentle all around.",
        "source": "T26n1536_020:0451a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一趣定已，復想此赤漸次增廣，東南西北遍皆是赤。",
        "translation": "After one point of concentration, he also thinks that this redness gradually increases and widens, and the southeast and northwest are red everywhere.",
        "source": "T26n1536_020:0451a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼想此赤漸次增廣，東南西北遍是赤故，心便散動馳流諸相，不能一趣繫念一境，思惟此境遍皆是赤。",
        "translation": "As he conceives of this redness gradually increasing in size, the southeast and northwest are red everywhere, so his mind scatters and chases after various appearances, and he can't fix his attention on a single object and contemplate that this object is red everywhere.",
        "source": "T26n1536_020:0451a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境遍是赤故，未能證入赤遍處定。",
        "translation": "Because their mind is distracted by distracting, fast-moving forms, it can't fix its attention on a single object and contemplate that this object is red everywhere, so it's not able to realize the concentration of the red everywhere.",
        "source": "T26n1536_020:0451a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於遍赤相繫念思惟，此遍是赤非遍黃等。",
        "translation": "In order to gather the mind that's distracted and driven about, he fixes his thoughts on the pervasive redness of this object, contemplating that it's pervasively red and not pervasively yellow.",
        "source": "T26n1536_020:0451a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行乃漸能入赤遍處定。",
        "translation": "He diligently and vigorously contemplates this aspect until he causes his mind to continuously abide, and as a result of this applied practice, he'll gradually be able to enter the red-permeating-place concentration.",
        "source": "T26n1536_020:0451a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of birth that's brought about by applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0451a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境遍皆是赤。",
        "translation": "Once the path of production that's brought about by applied practices is repeatedly cultivated, cultivated, and numerous in number, the mind then abides equally abiding and near abiding, continuously fixes its attention on one object, and contemplates that this object is red everywhere.",
        "source": "T26n1536_020:0451a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境思惟此境遍皆是赤，無二無轉從此乃入赤遍處定。",
        "translation": "As the mind settles into equipoise and near-abiding, it continuously fixes its attention on one object and contemplates that this object is red all over, without duality or change.",
        "source": "T26n1536_020:0451a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言上下者，謂上下方。",
        "translation": "When he says \"above and below,\" he means above and below.",
        "source": "T26n1536_020:0451a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言傍布者，謂東南等。",
        "translation": "By \"adjacent,\" I mean southeast and so forth.",
        "source": "T26n1536_020:0451a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無二者，謂無間雜。",
        "translation": "By no duality, it means there's no intermingling.",
        "source": "T26n1536_020:0451a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊無際者，謂邊際難測。",
        "translation": "'Limitless and endless' means the limit is unfathomable.",
        "source": "T26n1536_020:0451a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第七者，謂諸定中漸次順次相續次第數為第七。",
        "translation": "\"This is the seventh, which refers to the gradual, sequential, and sequential order of the seventh of these concentrations.",
        "source": "T26n1536_020:0451a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遍處者，謂此定中所有善色受想行識，皆名遍處。",
        "translation": "When it says pervasive, it means that all the good forms, feelings, perceptions, volitions, and consciousnesses in this concentration are called pervasive.",
        "source": "T26n1536_020:0451a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：白遍處定加行云何？",
        "translation": "Q: \"What are the preparatory practices of the white pervasive concentration?",
        "source": "T26n1536_020:0451a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便而能證入白遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the white-open-field concentration?",
        "source": "T26n1536_020:0451a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：初修業者創修觀時，於此世界或取白樹、或取白葉、或取白花、或取白菓、或取白衣、或取種種白莊嚴具、或取白雲、或取白水、或取種種諸餘白物。",
        "translation": "A: When someone first cultivates karma and creates an observation, they might take a white tree, white leaves, white flowers, white fruit, white clothing, various white adornments, white clouds, white water, or various other white things from this world.",
        "source": "T26n1536_020:0451a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於如是隨取一相，以勝解力繫念思惟假想觀察安立信解是某白相。",
        "translation": "Taking any one of these things, he fixes his thoughts, imagines, and observes them with the power of resolute understanding, establishing his belief that they are a certain white mark.",
        "source": "T26n1536_020:0451b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由於此以勝解力繫念思惟假想觀察安立信解是某白故，心便散動馳流諸相，不能一趣繫念一境，思惟此境是白非餘。",
        "translation": "As a result of that fixation, contemplation, and imagination with the power of resolute understanding, they falsely observe that the well-established confidence is somehow white, and their mind then distracts and flows through the various forms, unable to fixate on a single object with a single purpose and contemplate that this object is white and not some other thing.",
        "source": "T26n1536_020:0451b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境定是白故，未能證入白遍處定。",
        "translation": "Because their mind is distracted by distracting and fleeting forms, it can't fix its attention on a single object and contemplate that this object is definitely white, and it's not possible to realize the concentration of the white pervasive realm.",
        "source": "T26n1536_020:0451b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於一白相繫念思惟，謂此是白非為赤等。",
        "translation": "In order to gather the mind that's distracted and washes about, he fixes his thoughts on a white object, thinking, \"This is white, not red,\" and so forth.",
        "source": "T26n1536_020:0451b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行能入白定。",
        "translation": "He diligently and vigorously contemplates this aspect, so that his mind continues to abide for a long time, and because of this applied practice, he's able to enter the white-colored concentration.",
        "source": "T26n1536_020:0451b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of production that's induced by applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0451b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境定是白相。",
        "translation": "Once he has repeatedly accumulated, cultivated, and performed numerous actions in the path of production that's led by applied practices, his mind then abides equally abiding and near abiding, continuously fixes its attention on one object, and contemplates that this object is definitely a white mark.",
        "source": "T26n1536_020:0451b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境定是白相，無二無轉能入白定，而未能入白遍處定。",
        "translation": "Because the mind is stably abiding near the abode, continuously fixing its attention on one object, and contemplating that this object is certainly a white mark, it's without duality or change able to enter white concentration but unable to enter the concentration of the white pervasive realm.",
        "source": "T26n1536_020:0451b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若此未能入白遍處定者，白遍處定加行云何？",
        "translation": "Q: If he can't enter the white-open-field concentration, what are the preparatory practices for the white-open-field concentration?",
        "source": "T26n1536_020:0451b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便乃能證入白遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the white-open-field concentration?",
        "source": "T26n1536_020:0451b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：即依如前所入白定，令心隨順調伏趣向，漸次柔和周遍柔和。",
        "translation": "A: That is, he relies on the white concentration he entered as before to cause his mind to conform, tame, and head toward it, gradually becoming softer and more gentle all around.",
        "source": "T26n1536_020:0451b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一趣定已，復想此白漸次增廣，東南西北遍皆是白。",
        "translation": "After one point of concentration, it's also thought that this white color gradually increases and expands, and that the southeast and northwest are all white.",
        "source": "T26n1536_020:0451b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼想此白漸次增廣，東南西北遍是白故，心便散動馳流諸相，不能一趣繫念一境，思惟此境遍皆是白。",
        "translation": "As he conceives that this white color gradually increases and expands, and that the southeast and northwest are white everywhere, his mind then distracts and chases after various appearances, and he can't fix his attention on a single object and contemplate that this object is white everywhere.",
        "source": "T26n1536_020:0451b22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境遍是白故，未能證入白遍處定。",
        "translation": "Because their mind is distracted by distracting and fleeting forms, it can't fix its attention on a single object and contemplate that this object is entirely white, so it doesn't realize the concentration of the pervasive range of whiteness.",
        "source": "T26n1536_020:0451b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於遍白相繫念思惟，此遍是白非遍赤等。",
        "translation": "In order to gather the mind that's distracted and washes about, he fixes his thoughts on the pervasive white aspect, which is white and not red pervasively.",
        "source": "T26n1536_020:0451b26_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行乃漸能入白遍處定。",
        "translation": "He diligently and vigorously contemplates this aspect until he causes his mind to continue to abide for a long time, and as a result of this applied practice, he can gradually enter the concentration of the pervasive white space.",
        "source": "T26n1536_020:0451b27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of birth that's brought about by applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0451b29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境遍皆是白。",
        "translation": "Once he has repeatedly cultivated and cultivated the numerous actions that are induced by applied practices, his mind then abides equally abiding and near abiding, continuously fixes his attention on one object, and contemplates that this object is completely white.",
        "source": "T26n1536_020:0451c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境遍皆是白，無二無轉從此乃入白遍處定。",
        "translation": "As the mind settles into equipoise and near-abiding, it continuously fixes its attention on one object, contemplating that this object is white throughout, and there's no duality or change from there, then it enters the concentration of the white pervasive field.",
        "source": "T26n1536_020:0451c04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言上下者，謂上下方。",
        "translation": "When he says \"above and below,\" he means above and below.",
        "source": "T26n1536_020:0451c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言傍布者，謂東南等。",
        "translation": "By \"adjacent,\" I mean southeast and so forth.",
        "source": "T26n1536_020:0451c07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無二者，謂無間雜。",
        "translation": "By no duality, it means there's no intermingling.",
        "source": "T26n1536_020:0451c07_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊無際者，謂邊際難測。",
        "translation": "'Limitless and endless' means the limit is unfathomable.",
        "source": "T26n1536_020:0451c08_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第八者，謂諸定中漸次順次相續次第數為第八。",
        "translation": "\"This is the eighth, which refers to the eighth of the gradual sequential order of successive numbers of concentrations.",
        "source": "T26n1536_020:0451c08_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遍處者，謂此定中所有善色受想行識，皆名遍處。",
        "translation": "When it says pervasive, it means that all the good forms, feelings, perceptions, volitions, and consciousnesses in this concentration are called pervasive.",
        "source": "T26n1536_020:0451c10_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：空遍處定加行云何？",
        "translation": "Q: What are the preparatory practices of the concentration of emptiness and pervasiveness?",
        "source": "T26n1536_020:0451c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便而能證入空遍處定？",
        "translation": "By what means can a practitioner of contemplation realize the concentration of emptiness and pervasiveness?",
        "source": "T26n1536_020:0451c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：初修業者創修觀時，於此世界取舍上空、或地上空、或樹上空、或巖上空、或山上空、或川中空、或谷中空。",
        "translation": "A: When a beginner practitioner creates a practice of contemplation, he takes the sky above this world, or above the earth, or above a tree, or above a mountain, or above a river or valley.",
        "source": "T26n1536_020:0451c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此等空隨取一相，以勝解力繫念思惟假想觀察安立信解是某空相。",
        "translation": "Taking one of these forms of emptiness at a time, he fixes his thoughts, contemplates, imagines, and observes them with the power of resolute understanding, establishing confidence that they are a certain form of emptiness.",
        "source": "T26n1536_020:0451c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由於此以勝解力繫念思惟假想觀察安立信解是某空故，心便散動馳流諸相，不能一趣繫念一境，思惟此境是空非餘。",
        "translation": "As a result of this fixation, contemplation, and hypothesis with the power of resolute understanding to observe that a certain emptiness is established with confidence, their mind then distracts itself from chasing after various forms, and they can't fix their attention on a single object with a single aim, contemplating that this object is empty and not something else.",
        "source": "T26n1536_020:0451c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境定是空故，未能證入空遍處定。",
        "translation": "Because their mind is distracted by distracting and fleeting forms, it can't fix its attention on a single object and contemplate that this object is definitely empty, and it's not possible to realize the concentration of the pervasive sphere of emptiness.",
        "source": "T26n1536_020:0451c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於一空相繫念思惟，謂此是空非為識等。",
        "translation": "In order to gather the mind that's distracted and driven about, he fixes his thoughts on the single aspect of emptiness, saying that it's empty and not consciousness.",
        "source": "T26n1536_020:0451c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行能入空定。",
        "translation": "He diligently and vigorously contemplates this aspect, so that his mind continues to abide for a long time, and as a result of this applied practice, he's able to enter the concentration of emptiness.",
        "source": "T26n1536_020:0451c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of production that's induced by the applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0451c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境定是空相。",
        "translation": "Once he has repeatedly accumulated, cultivated, and performed numerous actions in the path of production that's led by applied practices, his mind then abides equally abiding and near abiding, continuously fixes his attention on one object, and contemplates that this object is definitely the mark of emptiness.",
        "source": "T26n1536_020:0451c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境定是空相，無二無轉能入空定，而未證入空遍處定。",
        "translation": "Because the mind is stably abiding in equipoise and near-abiding, continuously fixing its attention on one object, and contemplating that this object is definitely the mark of emptiness, it's without duality or change and can enter the concentration of emptiness, but it hasn't yet realized the concentration of the pervasive sense of emptiness.",
        "source": "T26n1536_020:0451c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若此未能入空遍處定者，空遍處定加行云何？",
        "translation": "Q: If this is the case, what are the preparatory practices for the concentration of emptiness and the pervasive sense of emptiness?",
        "source": "T26n1536_020:0452a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便乃能證入空遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the concentration of emptiness and pervasiveness?",
        "source": "T26n1536_020:0452a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：即依如前所入空定，令心隨順調伏趣向，漸次柔和周遍柔和。",
        "translation": "A: That is, he relies on the concentration of emptiness that he's entered as before, causing his mind to conform, tame, and head toward it, gradually becoming softer and more pervasive.",
        "source": "T26n1536_020:0452a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一趣定已，復想此空漸次增廣，東南西北遍皆是空。",
        "translation": "After one point of concentration, it's also thought that this emptiness gradually increases and expands, and that the southeast and northwest are empty everywhere.",
        "source": "T26n1536_020:0452a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼想此空漸次增廣，東南西北遍是空故，心便散動馳流諸相，不能一趣繫念一境，思惟此境遍皆是空。",
        "translation": "As he conceives that this emptiness gradually increases and expands, and that the southeast and northwest are empty everywhere, his mind then distracts and chases after various appearances, and he can't fix his attention on a single object and contemplate that this object is empty everywhere.",
        "source": "T26n1536_020:0452a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境遍是空故，未能證入空遍處定。",
        "translation": "Because their mind is distracted by distracting and fleeting forms, it can't fix its attention on a single object and contemplate that this object is completely empty, so it doesn't realize the concentration of the pervasive sphere of emptiness.",
        "source": "T26n1536_020:0452a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於遍空相繫念思惟，此遍是空非遍識等。",
        "translation": "In order to gather the mind that's distracted and driven about, he fixes his thoughts on the aspect of pervasive emptiness, thinking that this pervasive aspect is empty and not pervasive consciousness.",
        "source": "T26n1536_020:0452a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行乃漸能入空遍處定。",
        "translation": "He diligently and vigorously contemplates this aspect until he causes his mind to continue to abide for a long time, and as a result of this applied practice, he's gradually able to enter the concentration of emptiness everywhere.",
        "source": "T26n1536_020:0452a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of production that's induced by applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0452a14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境遍皆是空。",
        "translation": "Once he has repeatedly accumulated and cultivated the numerous actions that arise in the path induced by applied practices, his mind then abides equally abiding and near abiding, continuously fixes his attention on one object, and contemplates that this object is completely empty.",
        "source": "T26n1536_020:0452a16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境遍皆是空，無二無轉從此乃入空遍處定。",
        "translation": "As the mind settles into equipoise and near-abiding, it continuously fixes its attention on one object, contemplates that this object is entirely empty, and has no duality or transformation.",
        "source": "T26n1536_020:0452a18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言上下者，謂上下方。",
        "translation": "When he says \"above and below,\" he means above and below.",
        "source": "T26n1536_020:0452a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言傍布者，謂東南等。",
        "translation": "By \"adjacent,\" I mean southeast and so forth.",
        "source": "T26n1536_020:0452a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無二者，謂無間雜。",
        "translation": "By no duality, it means there's no intermingling.",
        "source": "T26n1536_020:0452a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊無際者，謂邊際難測。",
        "translation": "'Boundless and limitless' means the limit is unfathomable.",
        "source": "T26n1536_020:0452a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第九者，謂諸定中漸次順次相續次第數為第九。",
        "translation": "This is the ninth, which refers to the gradual, sequential, and sequential order of the ninth of these concentrations.",
        "source": "T26n1536_020:0452a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遍處者，謂此空無邊處定中所有善色受想行識，皆名遍處。",
        "translation": "When it says pervasive, it means that all the good forms, feelings, perceptions, volitions, and consciousnesses in this concentration of the infinity of emptiness are called pervasive.",
        "source": "T26n1536_020:0452a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：識遍處定加行云何？",
        "translation": "Q: What are the preparatory practices in the concentration of the pervasive sense-organs?",
        "source": "T26n1536_020:0452a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便而能證入識遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the pervasive concentration of consciousness?",
        "source": "T26n1536_020:0452a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：初修業者創修觀時，於此身中或取清淨眼識相、或取清淨耳識相、或取清淨鼻識相、或取清淨舌識相、或取清淨身識相、或取清淨意識相。",
        "translation": "A: When someone first starts cultivating karma and creates an observation, they might take the form of the pure eye consciousness, the form of the pure ear consciousness, the form of the pure nose consciousness, the form of the pure tongue consciousness, the form of the pure body consciousness, or the form of the pure consciousness in this body.",
        "source": "T26n1536_020:0452a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此諸識隨取一相，以勝解力繫念思惟假想觀察安立信解是某識相。",
        "translation": "Taking any one of these consciousnesses as a mark, he fixes his thoughts, considers, hypothesizes, observes, and establishes confidence that it's a certain mark of consciousness with the power of resolute understanding.",
        "source": "T26n1536_020:0452b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由於此以勝解力繫念思惟假想觀察安立信解是某識故，心便散動馳流諸相，不能一趣繫念一境，思惟此境是識非餘。",
        "translation": "As a result of this fixation, contemplation, and imagination with the power of resolute understanding, they falsely observe that the certain consciousness is established with confidence and understanding, so their mind scatters and flows through the various aspects, and they can't fixate on one object in a single destination and contemplate that this object is consciousness and not something else.",
        "source": "T26n1536_020:0452b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境定是識故，未能證入識遍處定。",
        "translation": "That person's mind is distracted by distracting and fleeting forms, can't fix its attention on a single object, and doesn't realize the pervasive concentration of consciousness because it contemplates that this object is definitely consciousness.",
        "source": "T26n1536_020:0452b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於一識相繫念思惟，謂此是識非為空等。",
        "translation": "In order to gather the mind that's distracted and driven about, he fixes his thoughts on the aspect of a single consciousness, saying, 'This is consciousness, not emptiness.'",
        "source": "T26n1536_020:0452b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行能入識定。",
        "translation": "He diligently and vigorously contemplates this aspect, even to the point of causing the mind to continuously abide, and because of this applied practice, he's able to enter the concentration of consciousness.",
        "source": "T26n1536_020:0452b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path of production that's induced by the applied practice and repeatedly work on it.",
        "source": "T26n1536_020:0452b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行所引生道，數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境定是識相。",
        "translation": "Since it's the path of production that's induced by applied practices and numerous undertakings that are repeatedly cultivated, the mind then abides equally abiding and near abiding, continuously fixes its attention on one object, and contemplates that this object is definitely the mark of consciousness.",
        "source": "T26n1536_020:0452b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境定是識相，無二無轉能入識定，而未能入識遍處定。",
        "translation": "Because the mind is stably abiding in equipoise and near-abiding, continuously fixing its attention on one object, and contemplating that this object is definitely the characteristic of consciousness, it's without duality or change able to enter the concentration of consciousness but unable to enter the concentration of the pervasive range of consciousness.",
        "source": "T26n1536_020:0452b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若此未能入識遍處定者，識遍處定加行云何？",
        "translation": "Q: If he can't enter the pervasive concentration of consciousness, what are the preparatory practices for the pervasive concentration of consciousness?",
        "source": "T26n1536_020:0452b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀行者由何方便乃能證入識遍處定？",
        "translation": "What method does a practitioner of contemplation use to realize the pervasive concentration of consciousness?",
        "source": "T26n1536_020:0452b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：即依如前所入識定，令心隨順調伏趣向，漸次柔和周遍柔和。",
        "translation": "A: That is, they rely on the concentration of consciousness entered as before to cause the mind to conform, control, and direct itself to gradual, gentle, and pervasive gentleness.",
        "source": "T26n1536_020:0452b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一趣定已，復想此識漸次增廣，東南西北遍皆是識，彼想此識漸次增廣，東南西北遍是識故，心便散動馳流諸相，不能一趣繫念一境，思惟此境遍皆是識。",
        "translation": "After one point of concentration, he also thinks that this consciousness gradually increases and expands, and that the southeast and northwest are all consciousnesses. Because he thinks that this consciousness gradually increases and expands, and that the southeast and northwest are all consciousnesses, his mind then distractedly chases after various appearances, can't fix its attention on one object, and contemplates that this object is all consciousnesses.",
        "source": "T26n1536_020:0452b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼心散動馳流諸相，不能一趣繫念一境，思惟此境遍皆識故，未能證入識遍處定。",
        "translation": "Because their mind is distracted by distracting and fleeting forms, it can't fix its attention on one object and contemplate that this object is pervaded by consciousness, so it's not able to realize the concentration of the pervasive range of consciousness.",
        "source": "T26n1536_020:0452b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為攝散動馳流心故，於遍識相繫念思惟，此遍是識非遍空等。",
        "translation": "In order to gather the mind that's distracted and driven about, they fix their thoughts on the characteristic of pervasive consciousness, which is pervasive consciousness and not pervasive emptiness.",
        "source": "T26n1536_020:0452b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟此相精勤勇猛，乃至令心相續久住，由斯加行乃漸能入識遍處定。",
        "translation": "He diligently and vigorously contemplates this aspect ... causes his mind to persist for a long time, and as a result of this applied practice, he can gradually enter the concentration of the pervasive range of consciousness.",
        "source": "T26n1536_020:0452b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤數習此加行已，復進修行此定方便，謂於加行所引生道，數習數修數多所作。",
        "translation": "After diligently repeatedly cultivating this applied practice, he then further cultivates the method of this concentration, which is to repeatedly cultivate the path that's produced by applied practices and repeatedly work on it.",
        "source": "T26n1536_020:0452b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既於加行數習數修數多所作，心便安住等住近住，相續一趣繫念一境，思惟此境遍皆是識。",
        "translation": "Since the application of these practices is repeatedly cultivated, cultivated, and numerous in number, the mind then abides equally abiding and near abiding, continuously fixes its attention on one object, and contemplates that this object is pervasively composed of consciousness.",
        "source": "T26n1536_020:0452c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由心安住等住近住，相續一趣繫念一境，思惟此境遍皆是識，無二無轉從此乃入識遍處定。",
        "translation": "As the mind settles into equipoise and near-abiding, continues to fix its attention on one object, and contemplates that this object is pervasively conscious, there's no duality or change.",
        "source": "T26n1536_020:0452c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言上下者，謂上下方。",
        "translation": "By up and down, I mean above and below.",
        "source": "T26n1536_020:0452c06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言傍布者，謂東南等。",
        "translation": "By \"adjacent,\" I mean southeast and so forth.",
        "source": "T26n1536_020:0452c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無二者，謂無間雜。",
        "translation": "By no duality, it means there's no intermingling.",
        "source": "T26n1536_020:0452c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊無際者，謂邊際難測。",
        "translation": "'Boundless and limitless' means the limit is unfathomable.",
        "source": "T26n1536_020:0452c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是第十者，謂諸定中漸次順次相續次第數為第十。",
        "translation": "\"This is the tenth, which refers to the gradual, sequential, and sequential order of the tenth of these concentrations.",
        "source": "T26n1536_020:0452c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遍處者，謂此識無邊處定中所有善受想行識，皆名遍處。",
        "translation": "\"Pervasive,\" it means that all the good feelings, perceptions, volitions, and consciousnesses in this concentration of the infinite abode of consciousness are called pervasive.",
        "source": "T26n1536_020:0452c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十無學法者，云何為十？",
        "translation": "\"What are the ten unlearned principles?",
        "source": "T26n1536_020:0452c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：一、無學正見；二、無學正思惟；三、無學正語；四、無學正業；五、無學正命；六、無學正勤；七、無學正念；八、無學正定；九、無學正解脫；十、無學正智。",
        "translation": "A: 1. right view of post-learners; 2. right contemplation of post-learners; 3. right speech of post-learners; 4. right action of post-learners; 5. right livelihood of post-learners; 6. right effort of post-learners; 7. right mindfulness of post-learners; 8. right concentration of post-learners; 9. right liberation of post-learners; and 10. right knowledge of post-learners.",
        "source": "T26n1536_020:0452c11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正見？",
        "translation": "What is right view of post-learners?",
        "source": "T26n1536_020:0452c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：盡智、無生智，盡所不攝無學慧，是名無學正見。",
        "translation": "A: The cognition of extinction, the cognition of nonarising, and the wisdom of training in what's not included in extinction are called right view of post-learners.",
        "source": "T26n1536_020:0452c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正思惟？",
        "translation": "What is right contemplation of post-learners?",
        "source": "T26n1536_020:0452c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應所有思惟、等思惟、近思惟，尋求、等尋求、近尋求，推覓、等推覓、近推覓，令心於法麁動而轉，是名無學正思惟。",
        "translation": "A: Noble disciples who contemplate suffering, contemplate accumulation, contemplate cessation, and contemplate the path contemplate the path with post-learning contemplations that are associated with contemplations, equiprobable contemplations, and near contemplations, that seek, equiprobable seek, and near seek, and that seek, equiprobable seek, and near seek, causing the mind to be disturbed and transformed by things, this is called post-learning correct contemplation.",
        "source": "T26n1536_020:0452c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正語？",
        "translation": "What is right speech without training?",
        "source": "T26n1536_020:0452c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子，於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應簡擇力故，除趣邪命語四惡行，於餘語惡行所得無學遠離、勝遠離、近遠離、極遠離，寂靜律儀無作無造，棄捨防護不行不犯，船筏橋樑堤塘牆塹，於所制約不踰不踰性、不越不越性無表語業，是名無學正語。",
        "translation": "Answer: Noble disciples who contemplate suffering, contemplate accumulation, contemplate cessation, and contemplate the path, based on the power of the scrutiny associated with post-learned contemplation, remove the four bad actions of wrong livelihood and speech, acquire post-learned seclusion, superior seclusion, near seclusion, and extreme seclusion from the bad actions of other speech, observe tranquility and restraint, make no effort to abstain, refrain from violating or abstain from guarding, and build boats, bridges, ponds, and moats, and conduct unexpressed speech that's neither excessive nor transgressive in terms of its restraints, are called post-learned right speech.",
        "source": "T26n1536_020:0452c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正業？",
        "translation": "What is right action of post-learners?",
        "source": "T26n1536_020:0452c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子，於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應簡擇力故，除趣邪命身三惡行，於餘身惡行所得無學遠離、勝遠離、近遠離、極遠離，寂靜律儀無作無造，棄捨防護不行不犯，船筏橋梁隄塘牆塹，於所制約不踰不踰性、不越不越性無表身業，是名無學正業。",
        "translation": "Answer: Noble disciples who contemplate suffering, contemplate accumulation, contemplate cessation, and contemplate the path, based on the power of discernment associated with post-learning contemplation, remove the three bad physical actions that lead to wrong livelihood, acquire post-learning detachment, superior detachment, near detachment, and extreme detachment from the other bad physical actions, observe tranquility and restraint, make no effort, abstain from taking precautions, don't act or transgress, and build boats, bridges, levees, ponds, and moats, and don't exceed or transcend the limitations of unexpressed physical actions, are called post-learning right action.",
        "source": "T26n1536_020:0452c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正命？",
        "translation": "What is right livelihood of the post-learner?",
        "source": "T26n1536_020:0453a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子，於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應簡擇力故，於趣邪命身語惡行所得無學遠離、勝遠離、近遠離、極遠離，寂靜律儀無作無造，棄捨防護不行不犯，船筏橋梁隄塘牆塹，於所制約不踰不踰性、不越不越性無表身語業、是名無學正命。",
        "translation": "A: Noble disciples, when they contemplate suffering, contemplate accumulation, contemplate cessation, and contemplate the path, the power of the associative scrutiny of post-learners' attentions makes them post-learners who are headed for wrong livelihood, whose bad physical and verbal actions obtain post-learners' separation, superior separation, near separation, and ultimate separation, whose quiet deportment is uncreated and uncreated, whose abandonment and protection are not practiced or transgressed, and whose boats, bridges, levees, ponds, walls, and moats are restrained by conventions that don't exceed or transcend their nature and don't transgress their nature without manifest physical and verbal actions, this is called post-learners' right livelihood.",
        "source": "T26n1536_020:0453a05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正勤？",
        "translation": "What is right effort of post-learners?",
        "source": "T26n1536_020:0453a12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子，於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應所有勤精進勇健勢猛熾盛難制勵意不息，是名無學正勤。",
        "translation": "A: Noble disciples who contemplate suffering, contemplate accumulation, contemplate cessation, and contemplate the path as the path, and who associate their post-training efforts with diligence, effort, vigor, intensity, fierceness, and the difficulty of controlling motivation, don't stop is called post-training right mindfulness.",
        "source": "T26n1536_020:0453a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正念？",
        "translation": "What is right effort of post-learners?",
        "source": "T26n1536_020:0453a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子，於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應所有念、隨念、專念、憶念，不忘不失、不遺不漏、不失法性、心明記性，是名無學正念。",
        "translation": "A: Noble disciples, when they contemplate suffering, contemplate the arising, contemplate cessation, and contemplate the path, their post-training contemplation is associated with mindfulness, following mindfulness, focused mindfulness, and recollection that aren't forgotten or lost, aren't lost or contaminated, and don't lose the nature of the Dharma and the mind's clear assurance, which is called post-training right concentration.",
        "source": "T26n1536_020:0453a16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正定？",
        "translation": "What is right concentration of post-learners?",
        "source": "T26n1536_020:0453a19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子，於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應所有心住、等住、近住、安住，不散不亂攝止等持心一境性，是名無學正定。",
        "translation": "A: Noble disciples, when they contemplate suffering, contemplate accumulation, contemplate cessation, and contemplate the path, their mental abiding, equipoise, near-abiding, and settled abiding associated with post-learning contemplation that's not distracted or confused, and which collects, stabilizes, and equipoises the mind's single object nature, is called post-learning right concentration.",
        "source": "T26n1536_020:0453a20_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正解脫？",
        "translation": "What is right liberation through post-learners' training?",
        "source": "T26n1536_020:0453a23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸聖弟子，於苦思惟苦、於集思惟集、於滅思惟滅、於道思惟道，無學作意相應所有心勝解、已勝解、當勝解，是名無學正解脫。",
        "translation": "A: Noble disciples who contemplate suffering, contemplate the arising of suffering, contemplate the arising of arising, contemplate the cessation of cessation, and contemplate the path of the path, and whose mental resolve is matched by post-learning contemplation, have resolved, and will resolve, are called post-learning right liberation.",
        "source": "T26n1536_020:0453a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學正智？",
        "translation": "What is right cognition of post-learners?",
        "source": "T26n1536_020:0453a26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：盡智、無生智、是名無學正智。",
        "translation": "Answer: The cognition of extinction and the cognition of nonarising is called the right cognition of post-learners.",
        "source": "T26n1536_020:0453a27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利子告苾芻眾言：「具壽當知，佛於一法乃至十法，現等覺已，為諸弟子宣說開示。",
        "translation": "It was then that Śāriputra addressed the crowd of monks, \"Kauśāmbī, you should know that the Buddha has taught and revealed one teaching up to the ten teachings for his disciples after they've become equally enlightened.",
        "source": "T26n1536_020:0453a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我與大眾皆共和合，親對世尊已結集竟，諸苾芻眾皆應受持，為他演說廣令流布。",
        "translation": "After we and the others have come together and gathered this in person with the Bhagavān, the congregation of monks should accept it, expound it for others, and spread it.",
        "source": "T26n1536_020:0453b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛滅度後勿有乖違，當令隨順梵行法律久住，利樂無量有情，哀愍世間諸天人眾，令獲殊勝義利安樂。」",
        "translation": "After the Buddha's passing, don't deviate from it; cause the Dharma of the religious practice to be followed for a long time, for the benefit and welfare of measureless sentient beings, and pity for the gods and humans of the world, so that they may attain excellent benefit and well-being.\"",
        "source": "T26n1536_020:0453b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讚勸品第十二",
        "translation": "The Twelfth Chapter of Praise and Exhortation",
        "source": "T26n1536_020:0453b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知舍利子為苾芻眾說法已訖，從臥而起身心調暢，整理衣服結加趺坐，讚舍利子：「善哉善哉！",
        "translation": "Knowing that Śāriputra had finished preaching to the crowd of monks, the Bhagavān then rose from his bed and composed himself, adjusted his robes, sat cross-legged, and praised Śāriputra, \"Good, good!",
        "source": "T26n1536_020:0453b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今善能於此臺觀與苾芻眾和合，結集如來所說增一法門。",
        "translation": "Now, you're well able to combine this dais and observation with a congregation of monks to assemble the incremental dharma-gate taught by the Tathāgata.",
        "source": "T26n1536_020:0453b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可從今為諸大眾數復宣說如是法門，此法能令諸天人等長夜證會義利安樂。」",
        "translation": "From now on, you can repeatedly explain this teaching to the masses, for it will cause gods and humans to realize the meaning, benefit, and happiness of this teaching for a long time.\"",
        "source": "T26n1536_020:0453b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊復告苾芻眾言：「汝等皆應受持讀誦舍利子說集異法門。",
        "translation": "The Bhagavān again addressed the monks, \"You should all accept, read, and recite the different dharma-gates that Śāriputra teaches.",
        "source": "T26n1536_020:0453b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是法門，能引大善大義大法清白梵行，復證通慧菩提涅槃。",
        "translation": "Such a teaching leads to the pure and purely religious practice of great goodness, great meaning, and great dharma, and also to the realization of the enlightenment and nirvāṇa of penetrating wisdom.",
        "source": "T26n1536_020:0453b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨信出家諸善男子，受持讀誦如是法門，不久定當辦所辦事。」",
        "translation": "Good sons who are pure believers and renunciant monks should accept, read, and recite such a teaching, and they will surely accomplish what they set out to do in the near future.\"",
        "source": "T26n1536_020:0453b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時薄伽梵說是語已，諸苾芻眾歡喜踊躍，頂禮佛足信受奉行。",
        "translation": "After the Bhagavān spoke these words, the multitude of monks rejoiced and jumped for joy, bowed their heads at the Buddha's feet, and faithfully accepted and approved of them.",
        "source": "T26n1536_020:0453b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一切有部集異門足論卷第二十",
        "translation": "Sutra on the Collection of Different Aspects of the Sarvâstivāda Tradition, Volume 20",
        "source": "T26n1536_020:0453b19_0",
        "is_bad_quality": false
    }
]