[
    {
        "source_sentence": "阿毘達磨集異門足論卷第七",
        "translation": "Collection of Different Aspects of the Abhidharma Path, Volume 7",
        "source": "T26n1536_007:0393c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者舍利子說",
        "translation": "Venerable Śāriputra said",
        "source": "T26n1536_007:0393c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T26n1536_007:0393c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四法品第五之二",
        "translation": "Four Dharmas, Fifth and Second Levels",
        "source": "T26n1536_007:0393c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四智者，謂法智、類智、他心智、世俗智。",
        "translation": "The four kinds of cognition are cognition of things as they are, cognition of things as they are, cognition of other minds, and cognition of things as they are.",
        "source": "T26n1536_007:0393c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法智云何？",
        "translation": "What's dharma cognition?",
        "source": "T26n1536_007:0393c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：緣欲界行諸無漏智、緣欲界行因諸無漏智、緣欲界行滅諸無漏智、緣欲界行能斷道諸無漏智。",
        "translation": "Answer: Cognition that's uncontaminated in terms of the formative forces in the desire realm, cognition that's uncontaminated in terms of the causes of formative forces in the desire realm, cognition that's uncontaminated in terms of the cessation of formative forces in the desire realm, and cognition that's uncontaminated in terms of the path that can be ended by formative forces in the desire realm.",
        "source": "T26n1536_007:0393c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次緣法智及緣法智地諸無漏智，是名法智。",
        "translation": "Furthermore, the untainted cognition of conditioned phenomena and the untainted cognition of the ground of conditioned phenomena is called dharma-cognition.",
        "source": "T26n1536_007:0393c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "類智云何？",
        "translation": "What's this type of cognition?",
        "source": "T26n1536_007:0393c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：緣色無色界行諸無漏智、緣色無色界行因諸無漏智、緣色無色界行滅諸無漏智、緣色無色界行能斷道諸無漏智。",
        "translation": "Answer: Cognition of the uncontaminated conditioned form and formless realm formations, cognition of the uncontaminated conditioned form and formless realm formations as cause, cognition of the uncontaminated conditioned form and formless realm formations as cessation, and cognition of the uncontaminated conditioned form and formless realm formations as the path to ending.",
        "source": "T26n1536_007:0393c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次緣類智及緣類智地諸無漏智，是名類智。",
        "translation": "Furthermore, the untainted cognitions that take cognition of types and the untainted cognitions that take the ground of cognition of types are called cognitions of types.",
        "source": "T26n1536_007:0393c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他心智云何？",
        "translation": "What's cognition of other minds?",
        "source": "T26n1536_007:0393c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：若智修所成是修果，依止修已得不失，能知欲色界和合現前他心心所及一分無漏他心心所，是名他心智。",
        "translation": "A: If the result of the cultivation of knowledge is cultivation, and if it's based on cultivation that's attained and not lost, the ability to know the desire realm, the coincidental manifest other mind and mental factors, and the part of the mind that's uncontaminated that's other than the mind is called knowledge of other minds.",
        "source": "T26n1536_007:0393c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世俗智云何？",
        "translation": "What is worldly cognition?",
        "source": "T26n1536_007:0393c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸有漏慧，是名世俗智。",
        "translation": "A: The contaminated wisdoms are called worldly cognition.",
        "source": "T26n1536_007:0393c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四智，謂苦智、集智、滅智、道智。",
        "translation": "There are also four kinds of cognition, which are the cognition of suffering, the cognition of arising, the cognition of cessation, and the cognition of the path.",
        "source": "T26n1536_007:0393c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦智云何？",
        "translation": "What's the cognition of suffering?",
        "source": "T26n1536_007:0393c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答於五取蘊思惟非常、苦、空、非我所起無漏智，是名苦智。",
        "translation": "Answer: The untainted knowledge that arises from contemplating the five appropriated aggregates as impermanent, painful, empty, and not self is called the knowledge of suffering.",
        "source": "T26n1536_007:0393c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智云何？",
        "translation": "What is the cognition of accumulation?",
        "source": "T26n1536_007:0393c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於有漏因思惟因、集、生、緣所起無漏智，是名集智。",
        "translation": "A: The uncontaminated knowledge that arises from contaminated causes and contemplates causes, collections, births, and conditions is called the knowledge of collections.",
        "source": "T26n1536_007:0393c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智云何？",
        "translation": "What is the cognition of cessation?",
        "source": "T26n1536_007:0394a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於諸擇滅思惟滅、靜、妙、離所起無漏智，是名滅智。",
        "translation": "A: The uncontaminated knowledge that arises from contemplating cessation, quiescence, subtlety, and freedom from all types of cessation is called the knowledge of cessation.",
        "source": "T26n1536_007:0394a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道智云何？",
        "translation": "What is the cognition of the path?",
        "source": "T26n1536_007:0394a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於無漏道思惟道、如、行、出所起無漏智，是名道智。",
        "translation": "A: The uncontaminated knowledge that arises from contemplating the path, thusness, practices, and emancipation in the uncontaminated path is called knowledge of the path.",
        "source": "T26n1536_007:0394a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四力者，一、信力；二、精進力；三、定力；四、慧力。",
        "translation": "The four powers are, first, the power of faith; second, the power of effort; third, the power of concentration; and fourth, the power of wisdom.",
        "source": "T26n1536_007:0394a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信力云何？",
        "translation": "What's the power of faith?",
        "source": "T26n1536_007:0394a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：依諸如來、應、正等覺所殖淨信，是有根生安立堅固，一切沙門及婆羅門諸天魔梵若餘世間皆無有能如法牽奪，是名信力。",
        "translation": "A: Relying on the pure faith cultivated by tathāgatas, arhats, and virtually all enlightened ones, these faculties are so well-established and resolute that no ascetic, brāhmaṇa, god, Māra, or Brahmā, or any other worldly being can thus snatch them away, which is called the power of faith.",
        "source": "T26n1536_007:0394a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精進力云何？",
        "translation": "What's the power of effort?",
        "source": "T26n1536_007:0394a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：為令已生惡不善法斷故，起欲發勤精進策心持心；為令未生惡不善法不生故，起欲發勤精進策心持心；為令未生善法生故，起欲發勤精進策心持心；為令已生善法堅住不忘修滿倍增廣大智作證故，起欲發勤精進策心持心，是名精進力。",
        "translation": "Answer: To stop bad and unskillful qualities that have arisen, the desire arises to intensify, intensify, curate, and maintain the mind; to keep bad and unskillful qualities that have yet to arise from not arising, the desire arises to intensify, intensify, curate, and maintain the mind; and to make good qualities that have arisen firmly abide, not forget, and cultivate, multiply, and increase knowledge and realization, the desire arises to intensify, intensify, curate, and maintain the mind, which is called the power of effort.",
        "source": "T26n1536_007:0394a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "定力云何？",
        "translation": "What's the power of concentration?",
        "source": "T26n1536_007:0394a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：離欲惡不善法，有尋有伺離生喜樂入初靜慮具足住，廣說乃至入第四靜慮具足住，是名定力。",
        "translation": "A: Being free of desire for bad and unskillful things, free of discursive thought and discursive expectation, and free of the joy and pleasure that arises from entering the first full abode of meditation and, as explained in detail, even entering the fourth full abode of meditation, is called the power of concentration.",
        "source": "T26n1536_007:0394a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧力云何？",
        "translation": "What's the power of wisdom?",
        "source": "T26n1536_007:0394a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如實了知是苦聖諦、如實了知是苦集聖諦、如實了知是苦滅聖諦、如實了知是趣苦滅道聖諦，是名慧力。",
        "translation": "A: To truly know what is the noble truth of suffering, truly know what is the noble truth of suffering's accumulation, truly know what is the noble truth of suffering's cessation, and truly know what is the noble truth of the path to suffering's cessation is called the power of wisdom.",
        "source": "T26n1536_007:0394a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：何故名力？",
        "translation": "Q: What is called the power of wisdom?",
        "source": "T26n1536_007:0394a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：以因此力、依此力、住此力，能斷能碎能破一切結縛隨眠隨煩惱纏，故名為力。",
        "translation": "Answer: It's because of this power, relying on this power, and abiding in this power that it can cut, break, and demolish all the bonds, dormancies, and afflictive tendencies that it's called power.",
        "source": "T26n1536_007:0394a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四處者，一、慧處；二、諦處；三、捨處；四、寂靜處。",
        "translation": "The four abodes are, first, the abode of wisdom; second, the abode of truth; third, the abode of equanimity; and fourth, the abode of quiescence.",
        "source": "T26n1536_007:0394a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧處云何？",
        "translation": "What's the bases of wisdom?",
        "source": "T26n1536_007:0394a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯六界記別經》中為具壽池堅說：苾芻當知，最勝慧處謂漏盡智，是故苾芻應成就漏盡智。",
        "translation": "A: As the Bhagavān explained for Kauśāmbī in the Sutra of Defining the Six Elements, the Bhagavān said, \"The most excellent place of wisdom, as the monks should know, is knowledge of the end of contamination, so the monks should achieve knowledge of the end of contamination.",
        "source": "T26n1536_007:0394a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就漏盡智，說名成就最勝慧處。",
        "translation": "If they achieve knowledge of the end of the contaminants, it's called achieving the most excellent seat of wisdom.",
        "source": "T26n1536_007:0394a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名慧處。",
        "translation": "This is called the abode of wisdom.",
        "source": "T26n1536_007:0394a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦處云何？",
        "translation": "What's the locus of the truth?",
        "source": "T26n1536_007:0394a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯六界記別經》中為具壽池堅說：苾芻當知，最勝諦處謂不動解脫。",
        "translation": "Answer: As the Bhagavān explained for Kauśāmbī Prakaraṇa in the Sutra of Defining the Six Elements, monks should know that the most excellent truth is immovable liberation.",
        "source": "T26n1536_007:0394a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦者謂如實法，誑者謂虛妄法。",
        "translation": "An 'truth' is a true dharma, and a deceit is a false dharma.",
        "source": "T26n1536_007:0394a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故苾芻應成就不動解脫。",
        "translation": "Therefore, bhikṣus should achieve immovable liberation.",
        "source": "T26n1536_007:0394b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就不動解脫，說名成就最勝諦處。",
        "translation": "If they achieve immovable liberation, that's said to be the accomplishment of the most excellent truth abode.",
        "source": "T26n1536_007:0394b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名諦處。",
        "translation": "This is called the noble truth abode.",
        "source": "T26n1536_007:0394b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨處云何？",
        "translation": "What's the abode of equanimity?",
        "source": "T26n1536_007:0394b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯六界記別經》中為具壽池堅說：苾芻當知，先所執受無智無明越正路法，今時應捨應變、吐應除棄。",
        "translation": "Answer: As the Bhagavān explained to Kauśāmbī: \"You should know, monks, that your prior appropriation of the lack of knowledge and ignorance that transgresses the correct path should now be abandoned and discarded.",
        "source": "T26n1536_007:0394b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻當知，最勝捨處謂棄捨一切依愛盡離染永滅涅槃，是故苾芻應成就此涅槃。",
        "translation": "Bhikṣu should know that the most excellent place of equanimity is abandoning all attachments, ending craving and defilement, and permanently extinguishing nirvāṇa; therefore, bhikṣu should achieve this nirvāṇa.",
        "source": "T26n1536_007:0394b06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就此涅槃，說名成就最勝捨處。",
        "translation": "If they achieve this nirvāṇa, it's called achieving the most excellent place of equanimity.",
        "source": "T26n1536_007:0394b08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名捨處。",
        "translation": "This is called the abode of equanimity.",
        "source": "T26n1536_007:0394b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂靜處云何？",
        "translation": "What's the abode of quiescence?",
        "source": "T26n1536_007:0394b09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯六界記別經》中為具壽池堅說：苾芻當知，貪染惱心令不解脫、瞋染惱心令不解脫、癡染惱心令不解脫。",
        "translation": "Answer: As the Bhagavān explained to Kauśāmbī for Kauśāmbī, \"You should know, monks, that the mind tainted with greed and tormented by anger is not liberated, and the mind tainted with delusion is not liberated.",
        "source": "T26n1536_007:0394b09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苾芻當知，此貪瞋癡無餘永斷變吐除棄愛盡離染永滅靜沒名真寂靜，是故苾芻應成就真寂靜。",
        "translation": "You should know, monks, that this greed, anger, and delusion without remainder are permanently stopped, transformed, abandoned, and defiled by the end of craving, permanently ceased, and tranquilized is called true tranquility; therefore, monks should achieve true tranquility.",
        "source": "T26n1536_007:0394b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若成就真寂靜，說名成就最勝寂靜處。",
        "translation": "If they achieve true quiescence, it's called achieving the most excellent state of quiescence.",
        "source": "T26n1536_007:0394b14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名寂靜處。",
        "translation": "This is called the abode of quiescence.",
        "source": "T26n1536_007:0394b15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四蘊者，一、戒蘊；二、定蘊；三、慧蘊；四、解脫蘊。",
        "translation": "The four aggregates are, first, the aggregate of precepts; second, the aggregate of concentration; third, the aggregate of wisdom; and fourth, the aggregate of liberation.",
        "source": "T26n1536_007:0394b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒蘊云何？",
        "translation": "What's the aggregate of precepts?",
        "source": "T26n1536_007:0394b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯三蘊記別經》中作如是說：苾芻當知，我說學戒、若無學戒、若一切善非學非無學戒，皆是戒蘊。",
        "translation": "A: Thus did the Bhagavān explain in the Fenbie sangyun ji bing: \"You should know, monks, that I say that the precepts of training, the precepts of no-training, and all the good precepts of neither training nor no-training are all the aggregate of precepts.",
        "source": "T26n1536_007:0394b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名戒蘊。",
        "translation": "This is called the aggregate of precepts.",
        "source": "T26n1536_007:0394b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "定蘊云何？",
        "translation": "What's the aggregate of concentration?",
        "source": "T26n1536_007:0394b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯三蘊記別經》中作如是說：苾芻當知，我說學定、若無學定、若一切善非學非無學定，皆是定蘊。",
        "translation": "A: Thus did the Bhagavān explain in the Commentary on the Exposition of the Three Aggregates, \"Bhikṣu should know that I say that concentration of training, concentration of no training, and concentration of all that's good, not training, and not training are all aggregates of concentration.",
        "source": "T26n1536_007:0394b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名定蘊。",
        "translation": "These are called the aggregate of concentration.",
        "source": "T26n1536_007:0394b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧蘊云何？",
        "translation": "What's the aggregate of wisdom?",
        "source": "T26n1536_007:0394b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯三蘊記別經》中作如是說：苾芻當知，我說學慧、若無學慧、若一切善非學非無學慧，皆是慧蘊。",
        "translation": "A: Thus did the Bhagavān explain in the Commentary on the Separation of the Three Aggregates: \"Bhikṣus, you should know that I say that learned wisdom, whether it's acquired or not, and whether it's all good, not acquired or not, are all the aggregate of wisdom.",
        "source": "T26n1536_007:0394b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名慧蘊。",
        "translation": "These are called the aggregate of wisdom.",
        "source": "T26n1536_007:0394b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解脫蘊云何？",
        "translation": "What's the aggregate of liberation?",
        "source": "T26n1536_007:0394b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《辯三蘊記別經》中作如是說：苾芻當知，我說學解脫、若無學解脫、若一切善非學非無學解脫，皆是解脫蘊。",
        "translation": "A: Thus did the Bhagavān explain in the Commentary on the Separation of the Three Aggregates: \"Bhikṣus, you should know that I say that liberation by training, liberation without training, and liberation that's neither training nor no-training of all that's good are all the aggregate of liberation.",
        "source": "T26n1536_007:0394b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名解脫蘊。",
        "translation": "These are called the aggregate of liberation.",
        "source": "T26n1536_007:0394b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四依者，一、思擇一法應遠避；二、思擇一法應受用；三、思擇一法應除遣；四、思擇一法應忍受。",
        "translation": "The four supports are, first, the contemplation of a thing to be avoided, second, the contemplation of a thing to be enjoyed, third, the contemplation of a thing to be removed, and fourth, the contemplation of a thing to be endured.",
        "source": "T26n1536_007:0394c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思擇一法應遠避？",
        "translation": "What is the one thing to be avoided when contemplating?",
        "source": "T26n1536_007:0394c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《防諸漏記別經》中作如是說：汝等苾芻，應審思擇，惡象惡馬惡牛惡狗惡水牛等當遠避之。",
        "translation": "A: Thus did the Blessed One say in the Vimalakīrti-nirdeśa-sūtra, \"You monks, carefully consider which of the bad elephants, horses, cattle, dogs, and buffaloes you should avoid.",
        "source": "T26n1536_007:0394c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應審思擇，株杌毒刺坑塹崖谷井廁河等當遠避之。",
        "translation": "You should carefully discriminate between stumps, poisonous thorns, pits, ditches, valleys, wells, toilets, rivers, and so forth, and keep them far away.",
        "source": "T26n1536_007:0394c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應審思擇，惡行惡威儀、惡友惡伴侶、惡行處惡臥具等當遠避之。",
        "translation": "You should carefully consider and avoid bad behavior, bad manners, bad friends, bad companions, bad places of activity, and bad bedding.",
        "source": "T26n1536_007:0394c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡臥具者，謂若受用如是臥具，為諸有智同梵行者，不應分別處而生分別、不應測量處而生測量、不應猜疑處而生猜疑，如是臥具我說為惡，汝等苾芻應當遠避。",
        "translation": "A bad bedding is defined as a bedding that's accepted by those who have knowledge and who practice the same celibacy, that discriminates where it shouldn't be discriminated, measures where it shouldn't be measured, and becomes suspicious where it shouldn't be doubted; such bedding I'd call bad, and you monks should avoid it.",
        "source": "T26n1536_007:0394c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名思擇一法應遠避。",
        "translation": "This is called considering a single thing to be avoided.",
        "source": "T26n1536_007:0394c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思擇一法應受用？",
        "translation": "What is contemplating a single thing that should be enjoyed?",
        "source": "T26n1536_007:0394c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《防諸漏記別經》中作如是說：汝等苾芻，應審思擇，如法衣服當受用之，不為勇健、不為傲逸、不為顏貌、不為端嚴，但為遮防蚊虻寒熱蛇蠍等觸，及為覆蔽深可羞恥醜陋身形。",
        "translation": "Answer: Thus did the Bhagavān explain in the Vimalakīrti-nirdeśa-sūtra: \"You monks, you should carefully consider and select clothing that is according to the teaching and which you will accept, not for courage, not for pride, not for appearance, and not for dignity but only to protect against insects, cold, heat, snakes, scorpions, and other tactile objects and to cover a body that's deeply ashamed and ugly.",
        "source": "T26n1536_007:0394c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應審思擇，如法飲食當受用之，不為勇健、不為傲逸、不為顏貌、不為端嚴，但為此身暫住存濟、止息飢渴攝受梵行，為斷故受不起新受，無罪存濟力樂安住。",
        "translation": "You should examine and select the food that you should eat and drink according to the teaching, not for courage, not for pride, not for appearance, and not for dignity, but only for the sake of this body, which temporarily remains in relief, stops hunger and thirst, collects the religious practice, stops the former feeling and doesn't give rise to new feelings, and abides comfortably without fault in the strength of relief.",
        "source": "T26n1536_007:0394c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應審思擇，如法臥具當受用之，不為勇健、不為傲逸、不為顏貌、不為端嚴，但為遮防寒熱風雨，及得最勝安隱寂靜。",
        "translation": "You should examine and select the right bedding to be used, not for courage, not for pride, not for appearance, and not for dignity, but only to protect against cold and heat, wind and rain, and to attain the most excellent peace and quiet.",
        "source": "T26n1536_007:0394c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應審思擇，如法醫藥當受用之，不為勇健、不為傲逸、不為顏貌、不為端嚴，但為止息未起已起所有疾病得修善業。",
        "translation": "You should examine and select the right medicine to use, not for courage, not for conceit, not for appearance, and not for dignity, but to stop all illnesses that have yet to arise and to cultivate good actions.",
        "source": "T26n1536_007:0394c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名思擇一法應受用。",
        "translation": "This is called contemplating a single thing to be used.",
        "source": "T26n1536_007:0394c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思擇一法應除遣？",
        "translation": "How does contemplating a single thing to be removed describe it?",
        "source": "T26n1536_007:0394c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《防諸漏記別經》中作如是說：汝等苾芻，已起欲尋恚尋害尋，不應韞畜，應速斷滅變吐除遣。",
        "translation": "答：如薄伽梵於《防諸漏記別經》中作如是說：汝等苾芻，已起欲尋恚尋害尋，不應韞畜，應速斷滅變吐除遣。",
        "source": "T26n1536_007:0394c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名思擇一法應除遣。",
        "translation": "This is called deliberating on a single thing to be gotten rid of.",
        "source": "T26n1536_007:0395a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思擇一法應忍受？",
        "translation": "How should we tolerate the contemplation of a single dharma?",
        "source": "T26n1536_007:0395a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如薄伽梵於《防諸漏記別經》中作如是說：汝等苾芻應起精進，有勢有勤、勇悍堅猛不捨善軛。",
        "translation": "A: Thus did the Bhagavān explain in the Vimalakīrti-nirdeśa-sūtra: \"You monks should exert yourselves, be vigorous and diligent, be courageous and resolute, and not abandon the good yoke.",
        "source": "T26n1536_007:0395a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使我身血肉枯竭，唯皮筋骨連拄而存，若本所求勝法未獲，終不止息所起精進。",
        "translation": "Even if my flesh and blood dried up and only skin and bones remained, if I hadn't attained the excellent teaching I was seeking, I would never have stopped the exertion I'd initiated.",
        "source": "T26n1536_007:0395a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又精進時身心疲惓，終不由斯而生懈怠。",
        "translation": "I'd be physically and mentally exhausted when I exerted myself, but I'd never let that cause me to become lazy.",
        "source": "T26n1536_007:0395a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應深忍受寒熱飢渴蛇蠍蚊虻風雨等觸，又應忍受他人所發能生身中猛利辛楚奪命苦受毀辱語言。",
        "translation": "They should deeply endure cold, heat, hunger, thirst, snakes, scorpions, mosquitoes, wind, rain, and other tactile sensations, and they should endure the violent, painful, life-threatening, painful, and degrading words in their bodies that are produced by others.",
        "source": "T26n1536_007:0395a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名思擇一法應忍受。",
        "translation": "This is called deliberating on a single thing to endure.",
        "source": "T26n1536_007:0395a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四法迹者，一、無貪法迹；二、無瞋法迹；三、正念法迹；四、正定法迹。",
        "translation": "The four traces of a dharma are 1. the trace of the dharma of no craving, 2. the trace of the dharma of no anger, 3. the trace of right mindfulness, and 4. the trace of the dharma of right concentration.",
        "source": "T26n1536_007:0395a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無貪法迹？",
        "translation": "What are the traces of the dharma of no craving?",
        "source": "T26n1536_007:0395a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：無貪者，謂於欲境諸不貪不等貪，廣說乃至非貪類非貪生，是名無貪。",
        "translation": "A: \"Non-craving\" is defined as the absence of craving for objects of desire, which are not cravings or equal cravings, and which are explained in detail up to the point where non-craving types and non-cravings arise.",
        "source": "T26n1536_007:0395a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法迹者，謂即無貪亦名為法、亦名為迹、亦名法迹，是故名為無貪法迹。",
        "translation": "A trace of a dharma means that the absence of craving is also called a dharma, a trace of a name, and a trace of a dharma; therefore, it's called the trace of the dharma of absence of craving.",
        "source": "T26n1536_007:0395a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無瞋法迹？",
        "translation": "What are the traces of the Dharma of no anger?",
        "source": "T26n1536_007:0395a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：無瞋者，謂於有情不欲損害、不懷栽杌、不欲擾惱，廣說乃至非已為過患、非當為過患、非現為過患，是名無瞋。",
        "translation": "A: \"Without anger\" means that it doesn't want to harm, plant, or disturb sentient beings, and it's broadly explained that it's not a past misdeed, not a future misdeed, and not a present misdeed.",
        "source": "T26n1536_007:0395a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法迹者，謂即無瞋亦名為法、亦名為迹、亦名法迹，是故名為無瞋法迹。",
        "translation": "A trace of a teaching means that the absence of anger is also called a teaching, a trace, and a trace of a teaching, and therefore it's called a trace of the teaching of the absence of anger.",
        "source": "T26n1536_007:0395a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何正念法迹？",
        "translation": "What are the traces of right mindfulness of qualities?",
        "source": "T26n1536_007:0395a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：正念者，謂依出離遠離所生善法，諸念隨念，廣說乃至心明記性，是名正念。",
        "translation": "A: Right mindfulness is called right concentration that relies on the good qualities that arise from seclusion and seclusion, which are mindful and follow, and which are explained in detail up to the mind's clear assurance of its nature.",
        "source": "T26n1536_007:0395a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法迹者，謂即正念亦名為法、亦名為迹、亦名法迹，是故名為正念法迹。",
        "translation": "\"Dharma traces\" means that right mindfulness is also called dharmas, traces, and traces of dharmas, and therefore it's called right mindfulness and the traces of dharmas.",
        "source": "T26n1536_007:0395a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何正定法迹？",
        "translation": "What are the traces of right concentration and dharmas?",
        "source": "T26n1536_007:0395a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：正定者，謂依出離遠離所生善法，諸定令心住，廣說乃至心一境性，是名正定。",
        "translation": "A: Right concentration is defined as the good qualities that arise from seclusion and seclusion, and these concentrations cause the mind to abide and are explained in detail up to the single-realm nature of the mind, which is called right concentration.",
        "source": "T26n1536_007:0395a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法迹者，謂即正定亦名為法、亦名為迹、亦名法迹，是故名為正定法迹。",
        "translation": "\"Dharma traces\" means that right concentration is also called dharmas, traces, and traces of dharmas, and therefore it's called right concentration and dharma traces.",
        "source": "T26n1536_007:0395a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四應證法者，謂或有法是身應證、或復有法是念應證、或復有法是眼應證、或復有法是慧應證。",
        "translation": "The four things that should be realized are that there might be things that should be realized by the body, things that should be realized by mindfulness, things that should be realized by the eye, and things that should be realized by wisdom.",
        "source": "T26n1536_007:0395a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有法是身應證？",
        "translation": "How are there things that should be realized in the body?",
        "source": "T26n1536_007:0395b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂八解脫，是身應證。",
        "translation": "A: The eight kinds of liberation are supposed to be realized in the body.",
        "source": "T26n1536_007:0395b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有法是念應證？",
        "translation": "How is there a dharma that should be realized by mindfulness?",
        "source": "T26n1536_007:0395b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂宿住事，是念應證。",
        "translation": "A: This is called a condition of past lives that should be realized by mindfulness.",
        "source": "T26n1536_007:0395b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有法是眼應證？",
        "translation": "How is there a dharma that the eye should realize?",
        "source": "T26n1536_007:0395b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂死生事，是眼應證。",
        "translation": "A: It means that the cause of death is something that the eye should realize.",
        "source": "T26n1536_007:0395b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有法是慧應證？",
        "translation": "How is there a teaching that wisdom should realize?",
        "source": "T26n1536_007:0395b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂諸漏盡，是慧應證。",
        "translation": "A: This is called the end of the contaminants, which wisdom should realize.",
        "source": "T26n1536_007:0395b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三嗢拕南曰：　三四法有九，　　行修業受軛，　離繫與瀑流，　　取繫各四種。",
        "translation": "The third uddāna says, \"There are nine of the three or four qualities, which are practice, cultivation, karma, feeling, freeing oneself from fetters and cascades, and four kinds of fetters of appropriation.",
        "source": "T26n1536_007:0395b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四行、四修定、四業、四法受、四軛、四離繫、四瀑流、四取、四身繫。",
        "translation": "There are four practices, four cultivations, four actions, four feelings, four yokes, four freeing bonds, four waterfalls, four appropriations, and four bindings of the body.",
        "source": "T26n1536_007:0395b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四行者，一、苦遲通行；二、苦速通行；三、樂遲通行；四、樂速通行。",
        "translation": "The four practices are 1. slow passage of suffering, 2. rapid passage of suffering, 3. slow passage of pleasure, and 4. rapid passage of pleasure.",
        "source": "T26n1536_007:0395b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何苦遲通行？",
        "translation": "What are the four practices that are painful and slow to pass?",
        "source": "T26n1536_007:0395b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：靜慮不攝下品五根，是名苦遲通行。",
        "translation": "A: When meditation doesn't include the five lower-level faculties, it's called the slow passage of suffering.",
        "source": "T26n1536_007:0395b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何苦速通行？",
        "translation": "How does it pass quickly through suffering?",
        "source": "T26n1536_007:0395b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：靜慮不攝上品五根，是名苦速通行。",
        "translation": "A: When meditation doesn't include the five higher faculties, it's called the rapid passage of suffering.",
        "source": "T26n1536_007:0395b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何樂遲通行？",
        "translation": "How do they pass quickly with pleasure?",
        "source": "T26n1536_007:0395b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：靜慮所攝下品五根，是名樂遲通行。",
        "translation": "A: The five lower-level faculties included in meditation are called the five faculties that are comfortable with slow passage.",
        "source": "T26n1536_007:0395b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何樂速通行？",
        "translation": "How do they happily and quickly pass through?",
        "source": "T26n1536_007:0395b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：靜慮所攝上品五根，是名樂速通行。",
        "translation": "A: The five higher qualities of the faculties included in meditation are called the five faculties that are enjoyed and quickly passed.",
        "source": "T26n1536_007:0395b16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有四行：一、不堪忍行；二、堪忍行；三、調伏行；四、寂靜行。",
        "translation": "There are also four practices: 1. the practice of unbearable patience, 2. the practice of tolerability, 3. the practice of restraint, and 4. the practice of quiescence.",
        "source": "T26n1536_007:0395b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不堪忍行？",
        "translation": "What are the practices of unbearable patience?",
        "source": "T26n1536_007:0395b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂不堪忍寒熱飢渴蛇蠍蚊虻風雨等觸，又不堪忍他人所發能生身中辛楚猛利奪命苦受罵辱語言，如是種類，是名不堪忍行。",
        "translation": "Answer: Being unable to tolerate cold, heat, hunger, thirst, snakes, scorpions, mosquitoes, wind, rain, and other tactile sensations, or being unable to tolerate the painful, violent, life-threatening, painful, abusive, and insulting words that others can inflict on their bodies, such as these, are called practices that are intolerable.",
        "source": "T26n1536_007:0395b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何堪忍行？",
        "translation": "What is the practice of being unbearable?",
        "source": "T26n1536_007:0395b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂能堪忍寒熱飢渴蛇蠍蚊虻風雨等觸，又能堪忍他人所發能生身中辛楚猛利奪命苦受罵辱語言，如是種類，是名堪忍行。",
        "translation": "Answer: Being able to tolerate cold, heat, hunger, thirst, snakes, scorpions, mosquitoes, wind, rain, and other tactile sensations, and being able to tolerate the pain, suffering, violence, and life-threatening pain, abuse, and words in the body that are produced by others are called the practice of tolerating.",
        "source": "T26n1536_007:0395b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何調伏行？",
        "translation": "What's the practice of restraint?",
        "source": "T26n1536_007:0395b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：眼見色時，專意繫念，防護眼根、調伏其心，不令發起煩惱惡業。",
        "translation": "A: When the eyes see things, they concentrate their thoughts, guard their eye faculties, and tame their minds so that afflictions and bad karma don't arise.",
        "source": "T26n1536_007:0395b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳聞聲時、鼻嗅香時、舌嘗味時、身覺觸時、意了法時，專意繫念防護耳根廣說乃至防護意根，調伏其心，不令發起煩惱惡業，是名調伏行。",
        "translation": "When the ear hears sounds, the nose smells fragrances, the tongue tastes flavors, the body feels tactile sensations, and the mind perceives dharmas, focusing attention on mindfulness protects the ear faculty, explains in detail up to protecting the mind faculty, and regulates the mind so that it doesn't give rise to afflictive and bad actions is called the practice of tranquility.",
        "source": "T26n1536_007:0395b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何寂靜行？",
        "translation": "What is the practice of stilling the mind?",
        "source": "T26n1536_007:0395c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂四念住、四正斷、四神足、五根五力、七等覺支、八聖道支、四通行、四法迹、奢摩他、毘鉢舍那，是名寂靜行。",
        "translation": "A: The four abodes of mindfulness, four correct eliminations, four miraculous abilities, five faculties, five powers, seven factors of virtual enlightenment, eight noble factors of the path, four pathways, four traces of the Dharma, calm abiding, and vipaśyanā are called the practice of quiescence.",
        "source": "T26n1536_007:0395c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：何故說此名寂靜行？",
        "translation": "Q: Why do you say this is called the practice of quiescence?",
        "source": "T26n1536_007:0395c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：以於此行若習若修若多所作，能令已生貪欲瞋恚愚癡慢等，寂靜、等寂靜、最極寂靜，是故說此名寂靜行。",
        "translation": "Answer: It's because this practice, if cultivated, cultivated, or often done, can cause craving, anger, ill-will, delusion, and conceit that have arisen to become tranquil, equally tranquil, and most tranquil; therefore, it's called the practice of tranquility.",
        "source": "T26n1536_007:0395c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四修定者，一、有修定若習若修若多所作，為能獲得現法樂住；二、有修定若習若修若多所作，為能獲得最勝知見；三、有修定若習若修若多所作，為能獲得勝分別慧；四、有修定若習若修若多所作，為能獲得諸漏永盡。",
        "translation": "The four cultivations of concentration are: 1. if there's cultivation of concentration and cultivation and many of them are undertaken, it's possible to attain a happy abiding in the present life; 2. if there's cultivation of concentration and cultivation and many of them are undertaken, it's possible to attain the most excellent knowledge and vision; 3. if there's cultivation of concentration and cultivation and many of them are undertaken, it's possible to attain excellent discriminating wisdom; and 4. if there's cultivation of concentration and cultivation and many of them are undertaken, it's possible to attain the permanent end of the contaminants.",
        "source": "T26n1536_007:0395c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修定若習若修若多所作為能獲得現法樂住？",
        "translation": "How can the cultivation of concentration, accumulation, cultivation, and numerous actions obtain a happy abiding in the present life?",
        "source": "T26n1536_007:0395c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於初靜慮所攝離生喜樂俱行心一境性，若習若修堅作常作精勤修習，是名修定若習若修若多所作為能獲得現法樂住。",
        "translation": "A: If someone cultivates and cultivates the one-pointedness of the mind that's free from the joy and pleasure that accompany the arising of the first concentration, and if they resolutely and constantly work and diligently cultivate it, this is called cultivating concentration, and if they cultivate and cultivate and do many actions, they can attain a happy abiding in the present life.",
        "source": "T26n1536_007:0395c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修定若習若修若多所作為能獲得最勝知見？",
        "translation": "How can cultivating concentration, accumulating, cultivating, and performing many actions attain the most excellent knowledge and vision?",
        "source": "T26n1536_007:0395c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於光明想俱行心一境性，若習若修堅作常作精勤修習，是名修定若習若修若多所作為能獲得最勝知見。",
        "translation": "A: If someone cultivates and cultivates the single-realm nature of the mind that's associated with light and perception, and if they resolutely and constantly work and diligently cultivate it, this is called cultivating concentration, and if they cultivate and cultivate and do many actions, they can attain the most excellent knowledge and vision.",
        "source": "T26n1536_007:0395c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修定若習若修若多所作為能獲得勝分別慧？",
        "translation": "How can cultivating concentration, accumulating, cultivating, and performing numerous actions attain superior discriminating insight?",
        "source": "T26n1536_007:0395c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於受想尋觀俱行心一境性，若習若修堅作常作精勤修習，是名修定若習若修若多所作為能獲得勝分別慧。",
        "translation": "Answer: If someone cultivates and cultivates the single-realm nature of the mind that's associated with feeling, perception, discursive examination, and insight, and if they resolutely and constantly work and diligently cultivate it, this is called cultivating concentration, and if they cultivate and cultivate it and do many actions, they can attain superior discriminating wisdom.",
        "source": "T26n1536_007:0395c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何修定若習若修若多所作為能獲得諸漏永盡？",
        "translation": "How can cultivating concentration, accumulating, cultivating, and performing numerous actions permanently end the contaminants?",
        "source": "T26n1536_007:0395c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於第四靜慮所攝清淨捨念俱行阿羅漢果無間道攝心一境性，若習若修堅作常作精勤修習，是名修定若習若修若多所作為能獲得諸漏永盡。",
        "translation": "A: If he cultivates and cultivates the single-realm nature of the mind that collects for the arhat fruit of the indirect path of pure equanimity and mindfulness, if he cultivates and cultivates it, resolutely undertakes it, and diligently cultivates it, this is called cultivating concentration.",
        "source": "T26n1536_007:0395c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如薄伽梵於波羅衍拏起問中說：「斷欲想憂怖，　　離惛沈睡眠，　及惡作掉舉，　　得捨念清淨。",
        "translation": "As the Bhagavān explains in the question arising from the bhāraṇya, \"He stops desire, perception, grief, and fear, rids himself of torpor and drowsiness, and attains the purity of mindfulness of equanimity.",
        "source": "T26n1536_007:0395c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　法輪為上首，　　得正智解脫，　我說斷無明，　　得勝分別慧。」",
        "translation": "Being the leader of the Dharma wheel and attaining the liberation of right knowledge, I say cut ignorance and attain superior discriminating wisdom.\"",
        "source": "T26n1536_007:0396a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四業者，一、黑黑異熟業；二、白白異熟業；三、黑白黑白異熟業；四、非黑非白無異熟業能盡諸業。",
        "translation": "The four karmas are 1. black and white ripening karma, 2. white and white ripening karma, 3. black and white black and white ripening karma, and 4. non-black and white non-ripening karma that ends all karmas.",
        "source": "T26n1536_007:0396a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何黑黑異熟業？",
        "translation": "What's black and black iso-maturation karma?",
        "source": "T26n1536_007:0396a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊為持俱胝牛戒布剌拏說：圓滿當知，世有一類補特伽羅，造有損害身語意行。",
        "translation": "A: Just as the Bhagavān explained for the purpose of observing the kūṭa cow precepts, \"Perfectly know that there's a type of person in the world who does physical, verbal, and mental actions that are harmful.",
        "source": "T26n1536_007:0396a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼造有損害身語意行已，積集增長有損害法。",
        "translation": "After they create damaging physical, verbal, and mental conduct, they accumulate and grow damaging qualities.",
        "source": "T26n1536_007:0396a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼積集增長有損害法已，感得有損害自體。",
        "translation": "After accumulating and growing damaging qualities, they will then sense the self that's damaging.",
        "source": "T26n1536_007:0396a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼感得有損害自體已，生有損害世間。",
        "translation": "After he attains a damaging essence, he'll be born into a damaging world.",
        "source": "T26n1536_007:0396a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼生有損害世間已，觸有損害觸。",
        "translation": "After he gives rise to a world that's damaging, he comes in contact with a damaging touch.",
        "source": "T26n1536_007:0396a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼觸有損害觸已，受有損害受，一向不可愛、一向不可樂、一向不可喜、一向不可意，如那落伽諸有情類。",
        "translation": "After touching a damaging touch, they experience a damaging sensation that's never desirable, never pleasant, never pleasing, and never agreeable, like the types of sentient beings in the Nāroṇa.",
        "source": "T26n1536_007:0396a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由此類有此類生，生已復觸如是類觸，是故我說彼諸有情隨自造業。",
        "translation": "From this type, they have this type of birth, and after birth, they again come into contact with this type of contact; therefore, I say that these sentient beings create their own karma.",
        "source": "T26n1536_007:0396a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓滿當知，是名黑黑異熟業。",
        "translation": "This, you should perfectly understand, is called black-on-black ripening karma.",
        "source": "T26n1536_007:0396a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造有損害身語意行者，謂造不善身語意行，於此義中意說不善身語意行，名有損害身語意行。",
        "translation": "Someone who creates harmful physical, verbal, and mental actions is someone who creates unskillful physical, verbal, and mental actions, and in this sense they mean to say that unskillful physical, verbal, and mental actions are called harmful physical, verbal, and mental actions.",
        "source": "T26n1536_007:0396a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼造有損害身語意行已，積集增長有損害法者。",
        "translation": "After creating damaging physical and verbal mental actions, they accumulate and grow damaging qualities.",
        "source": "T26n1536_007:0396a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂造不善身語意行已，造作增長不遠離法，於此義中意說造作增長不遠離法，名積集增長有損害法。",
        "translation": "It means that after creating unskillful bodily actions of speech and intent, they create things that grow and aren't free from, and in this sense they mean to say that they create things that grow and aren't free from, which is called accumulating things that grow and are damaging.",
        "source": "T26n1536_007:0396a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼積集增長有損害法已，感得有損害自體者，謂造作增長不遠離法已，感得地獄中有，於此義中意說地獄中有，名有損害自體。",
        "translation": "Someone who has accumulated growth of harmful qualities and has attained the essence of harmfulness after accumulating growth of harmful qualities means that after creating growth of things that aren't far from the truth, they will attain existence in hell, and in this sense they mean to say that existence in hell is called the essence of harmfulness.",
        "source": "T26n1536_007:0396a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T26n1536_007:0396a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂住彼中有中，眼所見色、耳所聞聲、鼻所嗅香、舌所嘗味、身所覺觸、意所了法，一切不可意非可意、不悅意非悅意、不可意相非可意相、不平等相非平等相，彼由此緣純受憂苦。",
        "translation": "It means that someone who abides in that intermediate existence and sees form with the eyes, hears sound with the ears, smells odor with the nose, tastes with the tongue, experiences touch with the body, and perceives things with the mind that are not agreeable or agreeable, disagreeable or not agreeable, have unlikeable or agreeable characteristics, and have unequal or not equal characteristics will experience pure misery and suffering as a result.",
        "source": "T26n1536_007:0396a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼感得有損害自體已生有損害世間者，謂感得地獄中有已生地獄趣，於此義中意說地獄趣，名有損害世間。",
        "translation": "They experience a damaging world in which their own body has been produced, which is to say that they experience an existence in hell and an existence in hell, and in this sense they mean to say that the hell destiny is called a damaging world.",
        "source": "T26n1536_007:0396b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T26n1536_007:0396b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂生地獄趣已，眼所見色乃至意所了法，一切不可意非可意，廣說乃至不平等相非平等相，彼由此緣純受憂苦。",
        "translation": "It means that after being born in a hellish rebirth, whatever form the eye sees and whatever the mind perceives are both unmeanable and unmeanable, and they are explained in detail up to unequal and non-equal characteristics, and they purely experience grief and suffering as a result.",
        "source": "T26n1536_007:0396b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼生有損害世間已觸有損害觸者，謂生地獄趣已觸地獄觸，於此義中意說地獄觸，名有損害觸。",
        "translation": "Someone who has touched a damaging touch after being born in the damaging world is said to have touched a hellish touch after being born in a hellish rebirth, and in this sense it means that a hellish touch is called a damaging touch.",
        "source": "T26n1536_007:0396b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼觸有損害觸已受有損害受者，謂觸如是類觸，定受如是類受，觸順苦受觸時必受苦受，由此故說觸有損害觸已受有損害受。",
        "translation": "He who touches something damaging and then experiences a damaging sensation is someone who touches such kinds of sensations, is bound to experience such kinds of sensations, and will definitely experience painful sensations when he touches something that's pleasant to touch; therefore, it's said that touching something damaging and then experiencing a damaging sensation is damaging.",
        "source": "T26n1536_007:0396b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一向不可愛、一向不可樂、一向不可喜、一向不可意者，謂彼苦受，一切有情皆共不愛不樂不憙亦不可意，由此故說一向不可愛乃至不可意。",
        "translation": "One who is unattractive, unpleasing, disagreeable, and unattractive means that these painful feelings are shared by all sentient beings who don't love, enjoy, or feel them, and they're also unattractive; therefore, it's said that they're unattractive and unattractive.",
        "source": "T26n1536_007:0396b12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如那落迦諸有情類者，謂顯趣向地獄世間諸有情類，由此故說如那落迦諸有情類。",
        "translation": "\"Such as the species of sentient beings in Nāroka\" refers to the species of sentient beings who are headed for the hellish world, which is why it's called such a species of sentient beings in Nāroka.",
        "source": "T26n1536_007:0396b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由此類有此類生者，謂彼有情有所依事有因有緣而生於彼，由此故說彼由此類有此類生。",
        "translation": "This kind of birth from this kind means that some sentient being has something to rely on, a cause, and a condition to be born there, and therefore it's said that this kind of birth from this kind exists.",
        "source": "T26n1536_007:0396b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生已復觸如是類觸者，謂生地獄已復觸地獄觸，由此故說生已復觸如是類觸。",
        "translation": "This type of contact after birth means that after being born in hell, they also touch hell, and therefore it's said that this is the type of contact after birth.",
        "source": "T26n1536_007:0396b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我說彼諸有情隨自造業者，謂設若造有損害身語意行、若不造有損害身語意行，俱積集增長有損害法、或俱不積集增長有損害法；若積集增長有損害法、若不積集增長有損害法，俱感得有損害自體、或俱不感得有損害自體；若感得有損害自體、若不感得有損害自體，俱生有損害世間、或俱不生有損害世間；若生有損害世間、若不生有損害世間，俱觸有損害觸、或俱不觸有損害觸；若觸有損害觸、若不觸有損害觸，俱受有損害受、或俱不受有損害受，則不應言是故我說彼諸有情隨自造業，以若造有損害身語意行，則積集增長有損害法；若不造有損害身語意行，則不積集增長有損害法。",
        "translation": "是故我說彼諸有情隨自造業者，謂設若造有損害身語意行、若不造有損害身語意行，俱積集增長有損害法、或俱不積集增長有損害法；若積集增長有損害法、若不積集增長有損害法，俱感得有損害自體、或俱不感得有損害自體；若感得有損害自體、若不感得有損害自體，俱生有損害世間、或俱不生有損害世間；若生有損害世間、若不生有損害世間，俱觸有損害觸、或俱不觸有損害觸；若觸有損害觸、若不觸有損害觸，俱受有損害受、或俱不受有損害受，則不應言是故我說彼諸有情隨自造業，以若造有損害身語意行，則積集增長有損害法；若不造有損害身語意行，則不積集增長有損害法。",
        "source": "T26n1536_007:0396b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若積集增長有損害法，則感得有損害自體；若不積集增長有損害法，則不感得有損害自體。",
        "translation": "If they accumulate and grow damaging qualities, then they will sense the self as damaging, and if they don't accumulate and grow damaging qualities, then they won't sense the self as damaging.",
        "source": "T26n1536_007:0396c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若感得有損害自體，則生有損害世間；若不感得有損害自體，則不生有損害世間。",
        "translation": "If they experience a self that's harmful, then they'll give rise to a world that's harmful, and if they don't experience a self that's harmful, then they won't give rise to a world that's harmful.",
        "source": "T26n1536_007:0396c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生有損害世間，則觸有損害觸；若不生有損害世間，則不觸有損害觸。",
        "translation": "If a damaging world arises, then one comes into contact with a damaging touch; if a damaging world doesn't arise, then one doesn't come into contact with a damaging touch.",
        "source": "T26n1536_007:0396c10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觸有損害觸，則受有損害受；若不觸有損害觸，則不受有損害受。",
        "translation": "If one touches a damaging touch, then one experiences a damaging sensation; if one doesn't touch a damaging touch, then one doesn't experience a damaging sensation.",
        "source": "T26n1536_007:0396c12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此應言，是故我說彼諸有情隨自造業。",
        "translation": "Accordingly, I say that sentient beings therefore create their own karma.",
        "source": "T26n1536_007:0396c13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名黑黑異熟業者，謂此業是不善感非愛異熟。",
        "translation": "This is called black and black ripening karma, which is defined as karma that's unwholesome, non-attractive, and ripe.",
        "source": "T26n1536_007:0396c14_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何白白異熟業？",
        "translation": "What is white-white ripening karma?",
        "source": "T26n1536_007:0396c15_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊為持俱胝牛戒補剌拏說：圓滿當知，世有一類補特伽羅，造無損害身語意行。",
        "translation": "A: Just as the Bhagavān explained to Prāṇṇa for the purpose of upholding the kūṭa cow precepts, \"Perfectly know that there's a type of person in the world who creates harmless physical, verbal, and mental conduct.",
        "source": "T26n1536_007:0396c16_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼造無損害身語意行已，積集增長無損害法。",
        "translation": "After they create harmless physical, verbal, and mental conduct, they accumulate and grow harmless dharmas.",
        "source": "T26n1536_007:0396c18_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼積集增長無損害法已，感得無損害自體。",
        "translation": "After accumulating and growing non-harming qualities, they then attain a non-harming essence.",
        "source": "T26n1536_007:0396c19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼感得無損害自體已，生無損害世間。",
        "translation": "After he attains a non-harming essence, he'll be born in a non-harming world.",
        "source": "T26n1536_007:0396c20_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼生無損害世間已，觸無損害觸。",
        "translation": "After it gives rise to the world without harm, it touches the world without harmful contact.",
        "source": "T26n1536_007:0396c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼觸無損害觸已，受無損害受，一向可愛、一向可樂、一向可喜、一向可意，如超段食天諸有情類，彼由此類有此類生，生已復觸如是類觸。",
        "translation": "After touching a non-harming touch, they experience a non-harming sensation that's always desirable, always pleasant, always pleasing, and always agreeable, like the types of sentient beings in the super-eating heaven who are born from this type and then touch such types of sensations after being born.",
        "source": "T26n1536_007:0396c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我說，彼諸有情隨自造業。",
        "translation": "I therefore say that these sentient beings create their own karma accordingly.",
        "source": "T26n1536_007:0396c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓滿當知，是名白白異熟業。",
        "translation": "This, you should perfectly understand, is called white-out ripening karma.",
        "source": "T26n1536_007:0396c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造無損害身語意行者，謂造善身語意行，於此義中意說善身語意行，名無損害身語意行。",
        "translation": "Those who create harmless physical, verbal, and mental conduct are those who create good physical, verbal, and mental conduct, and in this sense they mean to say that good physical, verbal, and mental conduct is called harmless physical, verbal, and mental conduct.",
        "source": "T26n1536_007:0396c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼造無損害身語意行已，積集增長無損害法者，謂造善身語意行已，造作增長遠離法，於此義中意說造作增長遠離法，名積集增長無損害法。",
        "translation": "Someone who creates the non-harming physical, verbal, and mental conduct and then accumulates the growth of non-harming qualities means that after creating good physical, verbal, and mental conduct, they create factors that are free from growth, and in this sense they mean to explain that they create factors that are free from growth, which are called accumulating the growth of non-harming qualities.",
        "source": "T26n1536_007:0396c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼積集增長無損害法已，感得無損害自體者，謂造作增長遠離法已，感得色界中有，於此義中意說色界中有，名無損害自體。",
        "translation": "He who, after accumulating growth and growth of non-harming qualities, attains a non-harming essence, meaning that after creating growth and growth of isolated qualities, he attains existence in the form realm, and in this sense he means to say that existence in the form realm is called a non-harming essence.",
        "source": "T26n1536_007:0397a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T26n1536_007:0397a05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂住彼中有中，眼所見色、耳所聞聲、身所覺觸、意所了法，一切可意非不可意、悅意非不悅意、可意相非不可意相、平等相非不平等相，彼由此緣純受喜樂。",
        "translation": "\"It means that someone abiding in that intermediate state sees form with the eyes, hears sound with the ears, experiences touch with the body, and perceives things with the mind that are agreeable and not unlike, pleasing and not unpleasing, agreeable and not unlike, and equal and not unequal, and they purely experience joy and happiness as a result.",
        "source": "T26n1536_007:0397a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼感得無損害自體已，生無損害世間者，謂感得色界中有已，生色界天趣，於此義中意說色界天趣，名無損害世間。",
        "translation": "He who has sensed a harmless essence and is born in the harmless world means that after sensing existence in the form realm, he's born in a heavenly existence in the form realm, and in this sense he means to say that the heavenly existence in the form realm is called the harmless world.",
        "source": "T26n1536_007:0397a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T26n1536_007:0397a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生色界天趣已，眼所見色乃至意所了法，一切可意非不可意，廣說乃至平等相非不平等相，彼由此緣純受喜樂。",
        "translation": "\"After being born in the destiny of the form realm gods, whatever form they see with the eye and whatever they perceive with the mind are both agreeable and not agreeable, and they are explained in detail up to their equality and not their inequality, for which reason they purely experience joy and happiness.",
        "source": "T26n1536_007:0397a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼生無損害世間已，觸無損害觸者，謂生色界天趣已，觸色界天觸，於此義中意說色界天觸，名無損害觸。",
        "translation": "\"He who touches non-harming touch after being born in the non-harming world means that after being born in the destiny of the form realm gods, he touches the touch of the form realm gods, and in this sense he means to say that the touch of the form realm gods is called non-harming touch.",
        "source": "T26n1536_007:0397a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼觸無損害觸已，受無損害受者，謂觸如是類觸，定受如是類受。",
        "translation": "It means that someone who has touched a harmless touch and received a harmless touch will touch such kinds of touch and experience such kinds of sensation with certainty.",
        "source": "T26n1536_007:0397a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸順樂受觸時必受樂受，由此故說觸無損害觸已，受無損害受。",
        "translation": "When contact is followed by pleasant sensation, it's bound to be pleasant sensation, and therefore it's said that after touching without detrimental contact, one experiences non-destructive sensation.",
        "source": "T26n1536_007:0397a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一向可愛、一向可樂、一向可喜、一向可意者，謂彼樂受，無量有情皆共可愛可樂可喜可意，由此故說一向可愛乃至可意。",
        "translation": "'Always desirable, always pleasant, always delightful, and always agreeable' means that these pleasant feelings are shared by measureless sentient beings who are desirable, delightful, joyous, and agreeable, which is why it's said to be always desirable and even agreeable.",
        "source": "T26n1536_007:0397a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如超段食天諸有情類者，謂顯趣向色界世間，由此故說如超段食天諸有情類。",
        "translation": "\"Such as the types of beings in the supramundane food heaven, which are those who are clearly headed toward the form realm world, it's therefore said to be like the types of beings in the supramundane food heaven.",
        "source": "T26n1536_007:0397a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由此類有此類生者，謂彼有情有所依事、有因有緣而生於彼，由此故說彼由此類有此類生。",
        "translation": "This type of birth from this type means that some sentient being has something to rely on, a cause, and a condition to be born there, and therefore it's said that this type of birth from this type exists.",
        "source": "T26n1536_007:0397a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生已復觸如是類觸者，謂生色界已復觸色界觸，由此故說生已復觸如是類觸。",
        "translation": "This type of contact after birth means that after being born in the form realm, they also touch the form realm, and it's because of this that they're said to have this type of contact after birth.",
        "source": "T26n1536_007:0397a26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我說彼諸有情隨自造業者，謂設若造無損害身語意行、若不造無損害身語意行，俱積集增長無損害法、或俱不積集增長無損害法。",
        "translation": "Therefore, I say that those sentient beings create their own actions, which are suppose that if they create harmless physical, verbal, and mental actions, or if they don't create harmless physical, verbal, and mental actions, they both accumulate things that grow and are harmless, or they both don't accumulate things that grow and are harmless.",
        "source": "T26n1536_007:0397a28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若積集增長無損害法、若不積集增長無損害法，俱感得無損害自體、或俱不感得無損害自體。",
        "translation": "If they accumulate growth of non-harming qualities and if they don't accumulate growth of non-harming qualities, both will attain the essence of non-harming, or both won't attain the essence of non-harming.",
        "source": "T26n1536_007:0397b02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若感得無損害自體、若不感得無損害自體，俱生無損害世間、或俱不生無損害世間。",
        "translation": "If they both experience a non-harming essence and if they don't experience a non-harming essence, both will be born in a non-harming world, or neither will be born in a non-harming world.",
        "source": "T26n1536_007:0397b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生無損害世間、若不生無損害世間，俱觸無損害觸、或俱不觸無損害觸。",
        "translation": "If a world without harm is produced, and if a world without harm isn't produced, both are touched without damaging contact, or both aren't touched without damaging contact.",
        "source": "T26n1536_007:0397b06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觸無損害觸、若不觸無損害觸，俱受無損害受、或俱不受無損害受。",
        "translation": "If touch is harmless and touch is not harmless, both experience harmless sensation and neither experience harmless sensation.",
        "source": "T26n1536_007:0397b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則不應言，是故我說彼諸有情隨自造業，以若造無損害身語意行，則積集增長無損害法；若不造無損害身語意行，則不積集增長無損害法。",
        "translation": "Then you shouldn't say, \"Therefore, I say that sentient beings create their own actions because if they do harmless physical, verbal, and mental actions, they will accumulate growth of harmless dharmas, and if they don't create harmless physical, verbal, and mental actions, they won't accumulate growth of harmless dharmas.",
        "source": "T26n1536_007:0397b10_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若積集增長無損害法，則感得無損害自體；若不積集增長無損害法，則不感得無損害自體；若感得無損害自體，則生無損害世間；若不感得無損害自體，則不生無損害世間。",
        "translation": "If he accumulates growth of non-harming qualities, then he'll attain non-harming identity; if he doesn't accumulate growth of non-harming qualities, then he won't attain non-harming identity; if he attains non-harming identity, then he'll be born in a non-harming world; and if he doesn't attain non-harming identity, then he won't be born in a non-harming world.",
        "source": "T26n1536_007:0397b13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若生無損害世間，則觸無損害觸；若不生無損害世間，則不觸無損害觸。",
        "translation": "If a world without harm is produced, then touch is harmless; if a world without harm doesn't arise, then touch is not harmless.",
        "source": "T26n1536_007:0397b17_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觸無損害觸，則受無損害受；若不觸無損害觸，則不受無損害受。",
        "translation": "If one touches a non-harming touch, then one experiences a non-harming sensation; if one doesn't touch a non-harming touch, then one doesn't experience a non-harming sensation.",
        "source": "T26n1536_007:0397b19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此應言，是故我說彼諸有情隨自造業。",
        "translation": "Accordingly, I say that sentient beings therefore create their own actions.",
        "source": "T26n1536_007:0397b20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名白白異熟業者，謂此業是善感可愛異熟。",
        "translation": "This is called white-and-white ripening karma, which is defined as karma that's well-intended and desirable ripening.",
        "source": "T26n1536_007:0397b21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何黑白黑白異熟業？",
        "translation": "What is black and white, and what is black and white, ripening karma?",
        "source": "T26n1536_007:0397b22_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊為持俱胝牛戒補剌拏說：圓滿當知，世有一類補特伽羅，造有損害無損害身語意行。",
        "translation": "A: Just as the Bhagavān explained to Prāṇṇa for the purpose of upholding the kūṭa cow precepts, it's perfectly clear that there's a type of person in the world who creates harmful and non-harming physical, verbal, and mental actions.",
        "source": "T26n1536_007:0397b23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼造有損害無損害身語意行已，積集增長有損害無損害法。",
        "translation": "After they create damaging and non-damaging physical, verbal, and mental conduct, they accumulate and grow damaging and non-harming qualities.",
        "source": "T26n1536_007:0397b25_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼積集增長有損害無損害法已，感得有損害無損害自體。",
        "translation": "After accumulating and growing damaging and non-degrading qualities, they sense the self that's damaging and non-degrading.",
        "source": "T26n1536_007:0397b26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼感得有損害無損害自體已，生有損害無損害世間。",
        "translation": "After feeling that there's harm and no harm in its own body, it gives rise to a world that's harmful and non-harming.",
        "source": "T26n1536_007:0397b28_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼生有損害無損害世間已，觸有損害無損害觸。",
        "translation": "After he gives rise to a world that's harmful and non-harming, he comes in contact with harmful and non-harming sensations.",
        "source": "T26n1536_007:0397b29_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼觸有損害無損害觸已，受有損害無損害受相間相雜，如人及一分天諸有情類。",
        "translation": "After they touch a damaging and non-damaging touch, they experience a mutual mixture of damaging and non-damaging feelings, such as humans and a portion of the heavenly sentient beings.",
        "source": "T26n1536_007:0397c01_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由此類有此類生，生已復觸如是類觸。",
        "translation": "From this type, they have this type of birth, and after birth, they also touch this type of touch.",
        "source": "T26n1536_007:0397c03_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我說，彼諸有情隨自造業。",
        "translation": "I therefore say that these sentient beings create their own actions.",
        "source": "T26n1536_007:0397c04_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓滿當知，是名黑白黑白異熟業。",
        "translation": "As you should perfectly understand, these are called black-and-white and black-and-white ripening karma.",
        "source": "T26n1536_007:0397c04_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造有損害無損害身語意行者，謂造善不善身語意行，於此義中意說善不善身語意行，名有損害無損害身語意行。",
        "translation": "Those who create damaging and non-damaging bodily, verbal, and mental actions are those who create good and unskillful bodily, verbal, and mental actions, and in this sense they mean to say that good and unskillful bodily, verbal, and mental actions are called damaging and non-damaging bodily, verbal, and mental actions.",
        "source": "T26n1536_007:0397c05_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼造有損害無損害身語意行已，積集增長有損害無損害法者，謂造善不善身語意行已，造作增長遠離不遠離法，於此義中意說造作增長遠離不遠離法，名積集增長有損害無損害法。",
        "translation": "\"He who, after creating harmful and non-harming physical and verbal actions, accumulates and increases harmful and non-harming qualities, meaning that after creating good and unskillful physical and verbal actions, he creates and increases those things that are remote and not remote, and in this sense he intends to explain that he creates and increases those things that are remote and not remote, which are called accumulating and increasing harmful and non-harming qualities.",
        "source": "T26n1536_007:0397c08_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼積集增長有損害無損害法已，感得有損害無損害自體者，謂造作增長遠離不遠離法已，感得人及欲界天中有，於此義中意說人及欲界天中有，名有損害無損害自體。",
        "translation": "\"After accumulating and growing harmful and non-harming qualities, he attains a self that's harmful and non-harming, which means that after creating and growing things that are remote and not remote, he attains existence among humans and gods of the desire realm, and in this sense he means to say that existence among humans and gods of the desire realm is called a self that's harmful and non-harming.",
        "source": "T26n1536_007:0397c12_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T26n1536_007:0397c16_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂住彼中有中，眼所見色、耳所聞聲、鼻所嗅香、舌所甞味、身所覺觸、意所了法，一切可意亦不可意、悅意亦不悅意、可意相亦不可意相、平等相亦不平等相，彼由此緣雜受苦樂。",
        "translation": "It means that someone who abides in that intermediate existence and sees form with the eyes, hears sound with the ears, smells odors with the nose, tastes flavors with the tongue, experiences sensations and tactile sensations with the body, and perceives things with the mind that are agreeable and unlikeable, pleasing and displeasing, agreeable and unlikeable in their characteristics, and equal and unequal in their characteristics will experience mixed pain and pleasure as a result.",
        "source": "T26n1536_007:0397c16_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼感得有損害無損害自體已，生有損害無損害世間者，謂感得人及欲界天中有已，生人及欲界天趣，於此義中意說人及欲界天趣，名有損害無損害世間。",
        "translation": "He who gives rise to the damaging and non-damaging world after sensing a damaging and non-damaging self is said to have sensed existence among humans and the desire realm gods and to have been born in humans and the desire realm gods as his destiny, and in this sense he means to say that the destinies of humans and the desire realm gods are called the damaging and non-damaging world.",
        "source": "T26n1536_007:0397c20_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T26n1536_007:0397c24_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂生人及欲界天趣已，眼所見色乃至意所了法，一切可意亦不可意，廣說乃至平等相亦不平等相，彼由此緣雜受苦樂。",
        "translation": "It means that after a person is born in the desire realm and the destinies of gods, whatever forms are seen by the eye and whatever is perceived by the mind can be perceived or not perceived, and it's explained in detail up to the extent that they have equal or unequal characteristics, and they experience mixed pain and pleasure as a result.",
        "source": "T26n1536_007:0397c24_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼生有損害無損害世間已，觸有損害無損害觸者，謂生人及欲界天趣已，觸人及欲界天觸，於此義中意說人及欲界天觸，名有損害無損害觸。",
        "translation": "Their contact that's damaging and non-damaging after being born in the damaging and non-damaging world refers to contact with humans and the desire realm gods after they've been born in the human and desire realm, and in this sense it means that human and desire realm gods' contact is called damaging and non-damaging contact.",
        "source": "T26n1536_007:0397c27_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼觸有損害無損害觸已，受有損害無損害受者，謂觸如是類觸，定受如是類受。",
        "translation": "It means that someone who has touched a damaging and non-damaging touch will experience a damaging and non-damaging feeling, which is to touch such kinds of touches and definitely experience such kinds of feelings.",
        "source": "T26n1536_007:0398a01_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觸順苦樂觸時，必受苦樂受，由此故說觸有損害無損害觸已，受有損害無損害受。",
        "translation": "When contact is followed by painful and pleasant contact, it's bound to be experienced as painful and pleasant, and therefore it's said that after contact that's damaging and non-destructive, one experiences feelings that are damaging and non-destructive.",
        "source": "T26n1536_007:0398a03_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相間相雜者，謂苦樂受相間相雜而現在前，由此故說相間相雜。",
        "translation": "The term \"mutual intermingling\" refers to the mutual intermingling of painful and pleasant feelings that occurs in the present, which is why it's called the mutual intermingling of feelings.",
        "source": "T26n1536_007:0398a05_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由此類有此類生者，謂彼有情有所依事、有因有緣而生於彼，由此故說彼由此類有此類生。",
        "translation": "'This kind of birth from this kind' means that some sentient being has something to rely on, a cause, and a condition to be born there, and it's therefore said that this kind of birth from this kind exists.",
        "source": "T26n1536_007:0398a06_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生已復觸如是類觸者，謂生人及欲界天已，復觸人及欲界天觸，由此故說生已復觸如是類觸。",
        "translation": "Those who also touch such kinds of contact after being born mean that after being born in the human realm or the desire realm heaven, they also touch the human realm or the desire realm heaven, which is why it's said that they also touch such kinds of contact after being born.",
        "source": "T26n1536_007:0398a09_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故我說彼諸有情隨自造業者，謂設若造有損害無損害身語意行、若不造有損害無損害身語意行，俱積集增長有損害無損害法、或俱不積集增長有損害無損害法；若積集增長有損害無損害法、若不積集有損害無損害法，俱感得有損害無損害自體、或俱不感得有損害無損害自體；若感得有損害無損害自體、若不感得有損害無損害自體，俱生有損害無損害世間、或俱不生有損害無損害世間；若生有損害無損害世間、若不生有損害無損害世間，俱觸有損害無損害觸、或俱不觸有損害無損害觸；若觸有損害無損害觸、若不觸有損害無損害觸，俱受有損害無損害受、或俱不受有損害無損害受，則不應言，是故我說彼諸有情隨自造業。",
        "translation": "是故我說彼諸有情隨自造業者，謂設若造有損害無損害身語意行、若不造有損害無損害身語意行，俱積集增長有損害無損害法、或俱不積集增長有損害無損害法；若積集增長有損害無損害法、若不積集有損害無損害法，俱感得有損害無損害自體、或俱不感得有損害無損害自體；若感得有損害無損害自體、若不感得有損害無損害自體，俱生有損害無損害世間、或俱不生有損害無損害世間；若生有損害無損害世間、若不生有損害無損害世間，俱觸有損害無損害觸、或俱不觸有損害無損害觸；若觸有損害無損害觸、若不觸有損害無損害觸，俱受有損害無損害受、或俱不受有損害無損害受，則不應言，是故我說彼諸有情隨自造業。",
        "source": "T26n1536_007:0398a11_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一切有部集異門足論卷第七",
        "translation": "Sutra on the Collection of Different Aspects of the Sarvâstivāda Path, Vol. 7",
        "source": "T26n1536_007:0398a27_0",
        "is_bad_quality": false
    }
]