[
    {
        "source_sentence": "阿毘達磨識身足論卷第五",
        "translation": "Abhidharma Consciousness Body and Legs Treatise, Volume 5",
        "source": "T26n1539_005:0553b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆設摩阿羅漢造",
        "translation": "created by the Devakṣema arhat",
        "source": "T26n1539_005:0553b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T26n1539_005:0553b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因緣蘊第三之二",
        "translation": "third and second in the set of causes and conditions",
        "source": "T26n1539_005:0553b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十種心，謂欲界繫善心、不善心、有覆無記心、無覆無記心，色界繫善心、有覆無記心、無覆無記心，無色界繫善心、有覆無記心、無覆無記心？",
        "translation": "Are there ten kinds of mind, namely, mind tethered to the desire realm that is good, unskillful, covered, and undefiled, mind tethered to the form realm that is good, covered, and undefiled, and mind tethered to the formless realm that is good, covered, and undefiled, and mind tethered to the formless realm that is good, covered, and undefiled, and mind tethered to the formless realm that is undefiled?",
        "source": "T26n1539_005:0553b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫善心，若體已斷，已斷為因耶？",
        "translation": "\"What about the good mental states bound to the desire realm that have been stopped in essence and have been stopped as a cause?",
        "source": "T26n1539_005:0553b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0553b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至無色界繫無覆無記心，若體已斷，已斷為因耶？",
        "translation": "What if the formless realm is fettered, unobstructed, and indeterminate, and if the essence has been stopped, has it been stopped as a cause?",
        "source": "T26n1539_005:0553b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0553b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫善心，若體已斷，已斷為因耶？",
        "translation": "\"What about the good mental states bound to the desire realm that have been stopped in essence and have been stopped as a cause?",
        "source": "T26n1539_005:0553b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0553b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0553b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0553b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸不善心，若體已斷，已斷為因耶？",
        "translation": "If the essence of unwholesome thoughts has been stopped, will stopping them be the cause?",
        "source": "T26n1539_005:0553b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷，已斷為因；或體已斷，已斷為因及未斷為因。",
        "translation": "Either the essence has been stopped and stopped as the cause, or the essence has been stopped, stopped as the cause, and not yet stopped as the cause.",
        "source": "T26n1539_005:0553b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷已斷為因者，謂未離欲界貪，集智已生、滅智未生，見苦集所斷不善心；滅智已生、道智未生，見苦集滅所斷不善心。",
        "translation": "Those whose essence has been stopped and stopped as a cause mean that they haven't yet parted with desire, and when knowledge of arising has arisen and knowledge of cessation has yet to arise, they see the unwholesome mind that's stopped by suffering and arising, and when knowledge of cessation has arisen and knowledge of the path has yet to arise, they see the unwholesome mind that's stopped by suffering and arising and cessation.",
        "source": "T26n1539_005:0553b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，見所斷不善心；已離欲界貪，未離色界貪諸不善心；已離色界貪，未離無色界貪諸不善心、已離無色界貪諸不善心，是名體已斷已斷為因。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees an unwholesome mind that's stopped before he parts with desire realm greed, an unwholesome mind that's parted with desire realm greed and parted with form realm greed, an unwholesome mind that's parted with form realm greed and parted with formless realm greed, and an unwholesome mind that's parted with formless realm greed, this is called a cause whose essence has been stopped and which has been stopped.",
        "source": "T26n1539_005:0553b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷，已斷為因及未斷為因者，謂未離欲界貪，苦智已生、集智未生，見苦所斷諸不善心。",
        "translation": "Those whose bodies have been stopped, stopped as a cause, and not yet stopped as a cause are unwholesome states of mind that have not yet parted with desire realm greed, whose knowledge of suffering has arisen and whose knowledge of the arising of suffering has yet to arise, and whose views are stopped by suffering.",
        "source": "T26n1539_005:0553c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been stopped?",
        "source": "T26n1539_005:0553c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "It means that these are all concomitant with each other.",
        "source": "T26n1539_005:0553c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0553c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫見集所斷遍行隨眠及彼相應等法。",
        "translation": "It's the pervasive tendencies and latent dormancies that are stopped by the fetters of the desire realm and the arising of those dependencies.",
        "source": "T26n1539_005:0553c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷，已斷為因及未斷為因。",
        "translation": "These are called things whose essence has been stopped, which have been stopped as a cause, and which have not been stopped as a cause.",
        "source": "T26n1539_005:0553c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose something that has been stopped is the cause, has its essence been stopped?",
        "source": "T26n1539_005:0553c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或已斷為因其體已斷，或已斷為因及未斷為因其體已斷，或已斷為因及未斷為因其體未斷。",
        "translation": "Either the essence of the cause that has been stopped has been stopped, the essence of the cause that has been stopped and the cause that has not been stopped has been stopped, or the essence of the cause that has been stopped and the cause that has not been stopped has not been stopped.",
        "source": "T26n1539_005:0553c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因其體已斷者，謂未離欲界貪，集智已生、滅智未生，見苦集所斷諸不善心；滅智已生、道智未生，見苦集滅所斷諸不善心。",
        "translation": "A person whose essence has been stopped as a cause that has been stopped means they haven't yet parted with desire, and they see unwholesome thoughts that are stopped by suffering and arising, once knowledge of arising has arisen and knowledge of cessation has yet to arise, or they see unwholesome thoughts that are stopped by suffering, arising, and cessation, once knowledge of the path has arisen and knowledge of the path has yet to arise.",
        "source": "T26n1539_005:0553c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，見所斷諸不善心；已離欲界貪，未離色界貪諸不善心；已離色界貪，未離無色界貪諸不善心、已離無色界貪諸不善心，是名已斷為因其體已斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees unwholesome states of mind that are stopped before they become free of desire realm greed, has become free of desire realm greed and hasn't yet become free of unwholesome states of mind in the form realm greed, has become free of form realm greed and hasn't yet become free of unwholesome states of mind in the formless realm greed, and has become free of unwholesome states of mind in the formless realm greed, this is called a person who has stopped as a cause and whose essence has been stopped.",
        "source": "T26n1539_005:0553c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因及未斷為因其體已斷者，謂未離欲界貪，苦智已生、集智未生，見苦所斷諸不善心。",
        "translation": "Those who have stopped being causes and those who haven't stopped being causes whose essence has been stopped mean that they haven't yet parted with desire realm greed, have arisen knowledge of suffering and haven't yet arisen knowledge of the arising of suffering, and have seen the unwholesome thoughts stopped by suffering.",
        "source": "T26n1539_005:0553c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been stopped?",
        "source": "T26n1539_005:0553c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "It means that these are all concomitant with each other.",
        "source": "T26n1539_005:0553c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0553c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫見集所斷遍行隨眠及彼相應等法。",
        "translation": "It's the set of fetters in the desire realm, the pervasive tendencies and latencies that are eliminated and the associated dharmas.",
        "source": "T26n1539_005:0553c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名已斷為因及未斷為因其體已斷。",
        "translation": "These are called causes that have been stopped and causes that have yet to be stopped whose essence has been stopped.",
        "source": "T26n1539_005:0553c21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因及未斷為因其體未斷者，謂未離欲界貪，苦智已生、集智未生，見集滅道及修所斷諸不善心。",
        "translation": "Those who have ended it as a cause and those who have yet to end it as a cause whose essence has yet to be ended are those who have yet to part with desire, whose knowledge of suffering has arisen and whose knowledge of the arising of that knowledge has yet to arise, and who see the path to the cessation of arising and the unwholesome thoughts that are ended by cultivation.",
        "source": "T26n1539_005:0553c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0553c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0553c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0553c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫見苦所斷遍行隨眠及彼相應等法。",
        "translation": "It's the fetters of the desire realm that see the pervasive tendencies and latent dormancies that are stopped by suffering and their concomitants.",
        "source": "T26n1539_005:0553c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，見滅道修所斷諸不善心。",
        "translation": "After knowledge of accumulation arises and knowledge of cessation doesn't arise, he sees the unwholesome mental states that are stopped by cultivating the path to cessation.",
        "source": "T26n1539_005:0553c26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0553c27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0553c27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0553c28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫遍行隨眠及彼相應等法。",
        "translation": "It's the fetters of the desire realm, their pervasive tendencies, latencies, and concomitant dharmas.",
        "source": "T26n1539_005:0553c28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，見道修所斷諸不善心。",
        "translation": "After knowledge of cessation arises and knowledge of the path yet to arise, they see the unwholesome mental states that are stopped by cultivating the path.",
        "source": "T26n1539_005:0553c29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0554a01_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0554a01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0554a02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫遍行隨眠及彼相應等法。",
        "translation": "It's the fetters of the desire realm, their pervasive tendencies, latencies, and other concomitant dharmas.",
        "source": "T26n1539_005:0554a02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，修所斷諸不善心。",
        "translation": "If a disciple of the Bhagavān sees that he's perfect, he hasn't yet parted with desire for the desire realm and cultivates unwholesome thoughts that are stopped.",
        "source": "T26n1539_005:0554a03_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0554a04_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0554a04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0554a05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫遍行隨眠及彼相應等法，是名已斷為因及未斷為因其體未斷。",
        "translation": "The pervasive tendencies and latencies in the fetters of the desire realm and their concomitants are called something that has been stopped as a cause and something that hasn't been stopped as a cause but whose body has yet to be stopped.",
        "source": "T26n1539_005:0554a05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫有覆無記心，若體已斷，已斷為因耶？",
        "translation": "If the obscured and indeterminate mental states of the fetters of desire have been stopped in essence, has that been stopped as a cause?",
        "source": "T26n1539_005:0554a07_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷已斷為因，或體已斷已斷為因及未斷為因。",
        "translation": "Either the essence has been stopped and stopped as a cause, or the essence has been stopped and stopped as a cause and not yet stopped as a cause.",
        "source": "T26n1539_005:0554a08_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷已斷為因者，謂未離欲界貪，集智已生、滅智未生，諸欲界繫有覆無記心；滅智已生、道智未生，諸欲界繫有覆無記心。",
        "translation": "Those whose essence has been stopped and stopped as a cause mean that they haven't yet parted with desire, the cognition of accumulation has arisen and the cognition of cessation has yet to arise, and the desire realms are fettered with obscured indeterminate states of mind; the cognition of cessation has arisen and the cognition of the path has yet to arise, and the desire realms are fettered with obscured indeterminate states of mind.",
        "source": "T26n1539_005:0554a09_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫有覆無記心；已離欲界貪，未離色界貪，諸欲界繫有覆無記心；已離色界貪，未離無色界貪，諸欲界繫有覆無記心；已離無色界貪，諸欲界繫有覆無記心，是名其體已斷已斷為因。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees that he's not free of desire realm greed and the desire realm is fettered with obscurations and indeterminate states of mind; that he's free of desire realm greed and not free of form realm greed and the desire realm is fettered with obscurations and indeterminate states of mind; that he's free of form realm greed and not free of form realm greed and the desire realm is fettered with obscurations and indeterminate states of mind after he's free of colorless realm greed, this is called a cause whose body has been stopped and stopped.",
        "source": "T26n1539_005:0554a12_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷已斷為因及未斷為因者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫見苦所斷有覆無記心。",
        "translation": "Those whose essence has been stopped and stopped as a cause and those whose essence has not been stopped as a cause mean that they haven't yet parted with desire realm greed, knowledge of suffering has arisen and knowledge of the arising of suffering has yet to arise, and the obscured indeterminate mind of the desire realm's fetters that see suffering has been stopped.",
        "source": "T26n1539_005:0554a17_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been stopped?",
        "source": "T26n1539_005:0554a20_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "It means that these are all concomitant with each other.",
        "source": "T26n1539_005:0554a20_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0554a20_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫見集所斷遍行隨眠及彼相應等法，是名體已斷已斷為因及未斷為因。",
        "translation": "These are called things whose essence has been stopped, which have been stopped as cause, and things that have yet to be stopped as cause, such as the pervasive tendencies and latencies that are eliminated in the form of the aggregate of views in the desire realm and their concomitants.",
        "source": "T26n1539_005:0554a21_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose something that has been stopped is the cause, has its essence been stopped?",
        "source": "T26n1539_005:0554a23_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0554a23_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫無覆無記心，若體已斷，已斷為因耶？",
        "translation": "If the tethers of the desire realm and the unclouded, indeterminate mind have been stopped, will stopping them be the cause?",
        "source": "T26n1539_005:0554a23_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0554a24_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0554a25_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂除隨眠所感異熟，餘欲界繫無覆無記心。",
        "translation": "It's the unobstructed indeterminate mind that's bound to the desire realm except for the retribution caused by latencies.",
        "source": "T26n1539_005:0554a25_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因，其體已斷耶？",
        "translation": "Has it been stopped as a cause, and has its essence been stopped?",
        "source": "T26n1539_005:0554a26_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0554a27_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨眠所感諸異熟心，或已斷為因其體已斷，或已斷為因及未斷為因其體未斷。",
        "translation": "The ripening mind that's brought on by latencies may have been stopped as a cause whose body has been stopped, or it may have been stopped as a cause and not yet stopped as a cause whose body has not yet been stopped.",
        "source": "T26n1539_005:0554a27_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因其體已斷者，謂已離欲界貪，未離色界貪，隨眠所感諸異熟心；已離色界貪，未離無色界貪，隨眠所感諸異熟心；已離無色界貪，隨眠所感諸異熟心，是名已斷為因其體已斷。",
        "translation": "A person whose essence has been stopped as a cause that has been stopped means that he has parted with desire realm greed and hasn't parted with form realm greed, and the mind subject to retribution by latency has parted with form realm greed and hasn't parted with form realm greed, and the mind subject to retribution by latency has parted with form realm greed, which is called a cause whose essence has been stopped when it has been stopped as a cause that has been stopped.",
        "source": "T26n1539_005:0554a29_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因及未斷為因其體未斷者，謂未離欲界貪，苦智已生、集智未生，見苦所斷隨眠所感諸異熟心。",
        "translation": "Those who have stopped being causes and those who haven't stopped being causes whose essence has yet to be stopped are those who haven't yet parted with desire realm greed, whose knowledge of suffering has arisen and whose knowledge of the arising of suffering has yet to arise, and who see the ripening mind that's caused by stopping suffering and the resultant tendencies of drowsiness.",
        "source": "T26n1539_005:0554b04_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0554b06_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0554b07_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0554b07_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂見苦所斷諸隨眠等，能感如是諸異熟心。",
        "translation": "Seeing the latent hindrances that are stopped by suffering can bring about such ripening states of mind.",
        "source": "T26n1539_005:0554b07_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，見苦集所斷隨眠所感諸異熟心。",
        "translation": "After knowledge of accumulation arises and knowledge of cessation doesn't arise, the view of the latent dormancy that is ended by suffering and accumulation can bring about ripening states of mind.",
        "source": "T26n1539_005:0554b08_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0554b10_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0554b10_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0554b10_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂見苦集所斷諸隨眠等，能感如是諸異熟心。",
        "translation": "It means that seeing the latent hindrances that are stopped by suffering and arising can bring about such kinds of ripening mind.",
        "source": "T26n1539_005:0554b11_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，見苦集滅所斷隨眠所感諸異熟心，何等未斷因？",
        "translation": "After knowledge of cessation has arisen and knowledge of the path has yet to arise, what are the causes of the ripening mind that are brought about by seeing the latent hindrances that are ended by suffering, arising, and cessation that have yet to be ended?",
        "source": "T26n1539_005:0554b12_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0554b13_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0554b14_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂見苦集滅所斷諸隨眠等，能感如是諸異熟心。",
        "translation": "Seeing the latent tendencies and so forth that are ended by suffering, arising, and cessation can bring about such ripening states of mind.",
        "source": "T26n1539_005:0554b14_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸見所斷隨眠所感諸異熟心。",
        "translation": "If a disciple of the Bhagavān sees the perfection of views and isn't free of desire, those views will stop the [retributive] mind that's brought on by latencies.",
        "source": "T26n1539_005:0554b15_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0554b17_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0554b17_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0554b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂見所斷諸隨眠等，能感如是諸異熟心，是名已斷為因及未斷為因其體未斷。",
        "translation": "Seeing that these kinds of latencies that are stopped can bring about such ripening states of mind is called having stopped as a cause and not yet stopped as a cause whose essence has not yet been stopped.",
        "source": "T26n1539_005:0554b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸色界繫善心，若體已斷，已斷為因耶？",
        "translation": "If the tethers in the form realm are good, then has their essence been stopped, or has it been stopped as a cause?",
        "source": "T26n1539_005:0554b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0554b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0554b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0554b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸色界繫有覆無記心，若體已斷，已斷為因耶？",
        "translation": "If the tethers in the form realm are covered and indeterminate, then what if the essence has been stopped and the stopped is the cause?",
        "source": "T26n1539_005:0554b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷已斷為因，或體已斷已斷為因及未斷為因。",
        "translation": "Either the essence has been stopped and stopped as a cause, or the essence has been stopped and stopped as a cause and not yet stopped as a cause.",
        "source": "T26n1539_005:0554b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷已斷為因者，謂未離色界貪，集類智已生、滅類智未生，諸色界繫見苦集所斷有覆無記心；滅類智已生、道類智未生，諸色界繫見苦集滅所斷有覆無記心。",
        "translation": "Those whose essence has been stopped and stopped as a cause mean that they haven't yet parted with greed in the form realm, when cognition of types of arising has arisen and cognition of types of cessation has yet to arise, and the fetters of the form realm see the obscuring and indeterminate mind that's ended by suffering and arising, and the fetters of the form realm see the obscuring and indeterminate mind that's ended by suffering and arising and the cognition of the path has yet to arise.",
        "source": "T26n1539_005:0554b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見所斷有覆無記心；已離色界貪，未離無色界貪，諸色界繫有覆無記心；已離無色界貪，諸色界繫有覆無記心，是名體已斷已斷為因。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees that the fetters of the form realm are closed, covered, and indeterminate in view before they become free of desire in the form realm, that they've become free of desire in the form realm and haven't yet become free of desire in the formless realm, and that the fetters of the form realm are covered, covered, and indeterminate in view after they become free of desire in the formless realm, this is called a cause whose essence has been cut off and stopped.",
        "source": "T26n1539_005:0554b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷已斷為因及未斷為因者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見苦所斷有覆無記心。",
        "translation": "Those whose essence has been stopped and stopped as a cause and those who haven't stopped as a cause are those who haven't parted with desire in the form realm, whose knowledge of suffering has arisen and whose knowledge of the formation realm has yet to arise, and whose covered and indeterminate mind is based on seeing suffering in the form realm's fetters.",
        "source": "T26n1539_005:0554c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been stopped?",
        "source": "T26n1539_005:0554c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "It means that these are all concomitant with each other.",
        "source": "T26n1539_005:0554c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0554c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色界繫見集所斷遍行隨眠及彼相應等法，是名體已斷已斷為因及未斷為因。",
        "translation": "These are called things whose essence has been stopped, which have been stopped as cause, and things that have not been stopped as cause, such as the pervasive concomitant with dormancy that's stopped by the set of views in the form realm.",
        "source": "T26n1539_005:0554c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose something that has been stopped is the cause, has its essence been stopped?",
        "source": "T26n1539_005:0554c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或已斷為因其體已斷，或已斷為因及未斷為因其體已斷，或已斷為因及未斷為因其體未斷。",
        "translation": "It may have been stopped as a cause whose body has been stopped, or it may have been stopped as a cause that has been stopped and a cause that has yet to be stopped whose body has been stopped, or it may have been stopped as a cause that has been stopped and a cause that has yet to be stopped whose body has yet to be stopped.",
        "source": "T26n1539_005:0554c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因其體已斷者，謂未離色界貪，集類智已生、滅類智未生，諸色界繫見苦集所斷有覆無記心。",
        "translation": "A person whose essence has been stopped as a cause that has been stopped means that he hasn't yet parted with desire in the form realm, knowledge of types of arising has arisen and knowledge of types of cessation has yet to arise, and the obscured, indeterminate mind in the form realm is tethered to views that are cut off by suffering and arising.",
        "source": "T26n1539_005:0554c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫見苦集滅所斷有覆無記心。",
        "translation": "After cognition of cessation has arisen and cognition of the path has yet to arise, the fetters of the form realm see the obscuring indeterminate mind that's ended by suffering and the arising of cessation.",
        "source": "T26n1539_005:0554c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見所斷有覆無記心；已離色界貪，未離無色界貪，諸色界繫有覆無記心；已離無色界貪，諸色界繫有覆無記心，是名已斷為因其體已斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees that the fetters of the form realm see what's stopped, covered, and indeterminate mind when they're not free of desire in the form realm, that they've parted with desire in the form realm and haven't parted with desire in the form realm, and that they've parted with desire in the form realm and have covered, indeterminate mind when they're free of the fetters of the form realm, this is called having ended it as a cause and having ended its essence.",
        "source": "T26n1539_005:0554c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因及未斷為因其體已斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見苦所斷有覆無記心。",
        "translation": "Those who have stopped being causes and those who haven't stopped being causes whose essence has been stopped mean that they haven't yet parted with desire in the form realm, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the covering indeterminate mind of the form realm's fetters that are stopped by seeing suffering.",
        "source": "T26n1539_005:0554c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been stopped?",
        "source": "T26n1539_005:0554c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "It means that these are all concomitant with each other.",
        "source": "T26n1539_005:0554c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0554c22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色界繫見集所斷遍行隨眠及彼相應等法，是名已斷為因及未斷為因其體已斷。",
        "translation": "The fetters of the form realm that see the pervasive tendencies and latencies eliminated by accumulation and their concomitants are called those that have been stopped as cause and those that have not been stopped as cause and whose essence has been stopped.",
        "source": "T26n1539_005:0554c23_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因及未斷為因其體未斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見集滅道及修所斷有覆無記心。",
        "translation": "Those who have ended it as a cause and those who have yet to end it as a cause whose essence has yet to be ended are those who have yet to part with desire in the form realm, whose knowledge of suffering has arisen and whose knowledge of accumulation has yet to arise, and whose fetters in the form realm see the path to accumulation and cessation and the obscuring indeterminate mind that's ended by cultivation.",
        "source": "T26n1539_005:0554c25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0554c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0554c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0554c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色界繫見苦所斷遍行隨眠及彼相應等法。",
        "translation": "\"The fetters of the form realm see pervasive tendencies, latencies, and concomitant dharmas that are eliminated by suffering.",
        "source": "T26n1539_005:0554c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫見滅道修所斷有覆無記心。",
        "translation": "After the knowledge of types of accumulation arises and the knowledge of types of cessation doesn't arise, the fetters of the form realm see obscurations and indeterminate states of mind that are ended by cultivating the path to cessation.",
        "source": "T26n1539_005:0555a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0555a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0555a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色界繫遍行隨眠及彼相應等法。",
        "translation": "\"It means the form realm fetters are pervasively conditioned by latencies and their concomitants.",
        "source": "T26n1539_005:0555a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫見道修所斷有覆無記心。",
        "translation": "After knowledge of cessation has arisen and knowledge of the path has yet to arise, the fetters of the form realm see the obscuring and indeterminate mind that's ended by cultivating the path.",
        "source": "T26n1539_005:0555a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0555a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色界繫遍行隨眠及彼相應等法。",
        "translation": "\"It's the form fetters, pervasive tendencies, latencies, and other concomitant dharmas.",
        "source": "T26n1539_005:0555a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫修所斷有覆無記心。",
        "translation": "If a disciple of the Bhagavān sees that he's perfect, he hasn't yet parted with desire in the form realm, and he cultivates the obscuring and indeterminate mental states that are the fetters of the form realm.",
        "source": "T26n1539_005:0555a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that haven't been stopped?",
        "source": "T26n1539_005:0555a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0555a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂色界繫遍行隨眠及彼相應等法。",
        "translation": "These are the form realm fetters, their pervasive tendencies, latencies, and concomitant dharmas.",
        "source": "T26n1539_005:0555a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名已斷為因及未斷為因其體未斷。",
        "translation": "These are called [the afflictions] that have been stopped as cause and those that have yet to be stopped as cause whose bodies have yet to be stopped.",
        "source": "T26n1539_005:0555a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸色界繫無覆無記心，若體已斷，已斷為因耶？",
        "translation": "If the fetters of the form realm and the unobstructed indeterminate mind have been stopped in essence, has that been stopped as a cause?",
        "source": "T26n1539_005:0555a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0555a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0555a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0555a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無色界繫善心，若體已斷，已斷為因耶？",
        "translation": "If the binds of wholesome mind in the formless realm have been stopped, will stopping them be the cause?",
        "source": "T26n1539_005:0555a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0555a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0555a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0555a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無色界繫有覆無記心，若體已斷，已斷為因耶？",
        "translation": "If the covered, indeterminate mind that's tied up in the formless realm has been stopped, is that stopped the cause?",
        "source": "T26n1539_005:0555a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷已斷為因，或體已斷已斷為因及未斷為因。",
        "translation": "Either the essence has been stopped and stopped as a cause, or the essence has been stopped and stopped as a cause and not yet stopped as a cause.",
        "source": "T26n1539_005:0555a17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷已斷為因者，謂集類智已生、滅類智未生，諸無色界繫見苦集所斷有覆無記心；滅類智已生、道類智未生，諸無色界繫見苦集滅所斷無覆無記心。",
        "translation": "Those whose essence has been stopped and stopped as a cause mean that the formless fetters see obscurations and indeterminate states of mind that are cut off by suffering and accumulation when knowledge of the arising type has arisen and knowledge of the cessation type has yet to arise, and the formless fetters see unobscured indeterminate states of mind that are cut off by suffering, accumulation, and cessation when knowledge of the path has arisen and knowledge of the path has yet to arise.",
        "source": "T26n1539_005:0555a18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離無色界貪，諸無色界繫見所斷有覆無記心；已離無色界貪，諸無色界繫有覆無記心。",
        "translation": "If a disciple of the Bhagavān sees the formless realm binding sees what's stopped, covered, and indeterminate mind when he's not free of desire for the formless realm, and the formless realm binding sees what's covered and indeterminate mind when he's free of desire for the formless realm.",
        "source": "T26n1539_005:0555a22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷已斷為因。",
        "translation": "This is called a cause whose essence has been stopped and stopped.",
        "source": "T26n1539_005:0555a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷已斷為因及未斷為因者，謂苦類智已生、集類智未生，諸無色界繫見苦所斷有覆無記心。",
        "translation": "Those whose essence has been stopped and stopped as a cause and those who haven't stopped as a cause are those whose cognition of suffering has arisen, whose cognition of the arising of suffering has yet to arise, and whose covering indeterminate mind is that of the formless fetters that see suffering.",
        "source": "T26n1539_005:0555a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been stopped?",
        "source": "T26n1539_005:0555a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "It means that these are all concomitant with each other.",
        "source": "T26n1539_005:0555a27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0555a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無色界繫見集所斷遍行隨眠及彼相應等法。",
        "translation": "It's the formless realm that's fettered, seen, collected, eliminated, pervasive, and consequential dormancy and other things associated with it.",
        "source": "T26n1539_005:0555a28_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷已斷為因及未斷為因。",
        "translation": "These are called causes whose essence has been stopped, causes that have been stopped, and causes that have yet to be stopped.",
        "source": "T26n1539_005:0555a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose something that has been stopped is the cause, has its essence been stopped?",
        "source": "T26n1539_005:0555b01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或已斷為因其體已斷，或已斷為因及未斷為因其體已斷，或已斷為因及未斷為因其體未斷。",
        "translation": "Either the essence of the cause that has been stopped has been stopped, the essence of the cause that has been stopped and the cause that has not been stopped has been stopped, or the essence of the cause that has been stopped and the cause that has not been stopped has not been stopped.",
        "source": "T26n1539_005:0555b02_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因其體已斷者，謂集類智已生、滅類智未生，諸無色界繫見苦集所斷有覆無記心；滅類智已生、道類智未生，諸無色界繫見苦集滅所斷有覆無記心。",
        "translation": "When the essence of the cause that has been stopped has been stopped, it means that the cognition of types of arising has arisen and the cognition of types of cessation has yet to arise, and the fetters of the formless realm see the obscuring and indeterminate mind that is cut off by suffering and arising, while the cognition of types of cessation has arisen and the cognition of the path has yet to arise, and the fetters of the formless realm see the obscuring and indeterminate mind that is cut off by suffering and arising and cessation.",
        "source": "T26n1539_005:0555b04_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離無色界貪，諸無色界繫見所斷有覆無記心；已離無色界貪，諸無色界繫有覆無記心。",
        "translation": "If a disciple of the Bhagavān sees the formless realm binding sees what's stopped, covered, and indeterminate mind when he's not free of desire for the formless realm, and the formless realm binding sees what's stopped, covered, and indeterminate mind when he's free of desire for the formless realm.",
        "source": "T26n1539_005:0555b07_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名已斷為因其體已斷。",
        "translation": "This is called having ended it as a cause and having ended its essence.",
        "source": "T26n1539_005:0555b10_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因及未斷為因其體已斷者，謂苦類智已生、集類智未生，諸無色界繫見苦所斷有覆無記心。",
        "translation": "Those whose essence has been stopped as a cause and those whose essence has not been stopped as a cause mean that knowledge of suffering has arisen, knowledge of the arising of suffering has yet to arise, and the formless fetters see obscurations and indeterminate states of mind that are stopped by suffering.",
        "source": "T26n1539_005:0555b11_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been stopped?",
        "source": "T26n1539_005:0555b13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "It means that these are all concomitant with each other.",
        "source": "T26n1539_005:0555b13_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0555b14_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無色界繫見集所斷遍行隨眠及彼相應等法。",
        "translation": "It's the formless realm that's fettered, sees, collects, eliminates, pervades, follows sleep, and corresponds to it.",
        "source": "T26n1539_005:0555b14_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名已斷為因及未斷為因其體已斷。",
        "translation": "These are called causes that have been stopped and causes that have yet to be stopped whose essence has been stopped.",
        "source": "T26n1539_005:0555b15_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已斷為因及未斷為因其體未斷者，謂苦類智已生、集類智未生，諸無色界繫見集滅道及修所斷有覆無記心。",
        "translation": "Those who have ended as cause and those who have yet to end as cause whose essence has yet to be ended are those whose cognition of suffering has arisen, whose cognition of accumulation has yet to arise, and whose formless fetters see the path to accumulation and cessation and the obscuring indeterminate mind that's ended by cultivation.",
        "source": "T26n1539_005:0555b16_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have not yet been stopped?",
        "source": "T26n1539_005:0555b19_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無俱有相應等法。",
        "translation": "It's a teaching that's not associated with both.",
        "source": "T26n1539_005:0555b19_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555b19_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無色界繫見苦所斷遍行隨眠及彼相應等法。",
        "translation": "\"It means the formless realm's fetters see pervasive tendencies and latencies that are eliminated by suffering and the associated dharmas.",
        "source": "T26n1539_005:0555b20_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸無色界繫見滅道修所斷有覆無記心。",
        "translation": "After the knowledge of types of accumulation arises and the knowledge of types of cessation doesn't arise, the formless fetters see obscurations and indeterminate states of mind that are eliminated by cultivation in the path to cessation.",
        "source": "T26n1539_005:0555b21_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be eliminated?",
        "source": "T26n1539_005:0555b22_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0555b23_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555b23_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無色界繫遍行隨眠及彼相應等法。",
        "translation": "\"It's the pervasive latencies of the formless fetters and their concomitant dharmas.",
        "source": "T26n1539_005:0555b23_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸無色界繫見道修所斷有覆無記心。",
        "translation": "After cognition of cessation has arisen and cognition of the path has yet to arise, the formless fetters see the obscuring indeterminate mind that's ended by cultivating the path.",
        "source": "T26n1539_005:0555b24_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that have yet to be stopped?",
        "source": "T26n1539_005:0555b26_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0555b26_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無色界繫遍行隨眠及彼相應等法。",
        "translation": "\"It's the formless fetters, pervasive tendencies, latencies, and other concomitant dharmas.",
        "source": "T26n1539_005:0555b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離無色界貪，諸無色界繫修所斷有覆無記心。",
        "translation": "If a disciple of the Bhagavān sees that he's perfect, he hasn't yet parted with desire in the formless realm, and he cultivates obscuring and indeterminate states of mind that are the fetters of the formless realm.",
        "source": "T26n1539_005:0555b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等未斷因？",
        "translation": "What are the causes that haven't been stopped?",
        "source": "T26n1539_005:0555b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂此俱有相應等法。",
        "translation": "This is a teaching that's associated with both.",
        "source": "T26n1539_005:0555c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等已斷因？",
        "translation": "What are the causes that have been eliminated?",
        "source": "T26n1539_005:0555c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無色界繫遍行隨眠及彼相應等法。",
        "translation": "These are the formless realm's fetters, pervasive tendencies, latencies, and concomitants thereof.",
        "source": "T26n1539_005:0555c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名已斷為因及未斷為因其體未斷。",
        "translation": "These are called [these] things that have been stopped as cause and those that have yet to be stopped as cause and whose bodies have yet to be stopped.",
        "source": "T26n1539_005:0555c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無色界繫無覆無記心，若體已斷，已斷為因耶？",
        "translation": "If the formless fetters, the unobstructed, indeterminate mind, and that which has been stopped are the cause, then has that been stopped as the cause?",
        "source": "T26n1539_005:0555c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0555c04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設已斷為因，其體已斷耶？",
        "translation": "Suppose it has been stopped as a cause, has its essence been stopped?",
        "source": "T26n1539_005:0555c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_005:0555c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十五心，謂欲界繫有五心、色界繫有五心、無色界繫有五心。",
        "translation": "There are 15 minds, which are five minds tied to the desire realm, five minds tied to the form realm, and five minds tied to the formless realm.",
        "source": "T26n1539_005:0555c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十五心，或過去或未來或現在。",
        "translation": "These are the fifteen minds that were, will be, will be, or are present.",
        "source": "T26n1539_005:0555c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何欲界繫有五心？",
        "translation": "What are the five mental states that bind the desire realm?",
        "source": "T26n1539_005:0555c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫見苦所斷心、見集滅道修所斷心。",
        "translation": "It's the mind bound to the desire realm that sees what's stopped by suffering and the mind that's stopped by the cultivation of the path to accumulation and cessation.",
        "source": "T26n1539_005:0555c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如欲界繫，色界繫、無色界繫亦爾。",
        "translation": "So are the fetters of the desire realm, the fetters of the form realm, and the fetters of the formless realm.",
        "source": "T26n1539_005:0555c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去欲界繫見苦所斷心，所有隨眠，彼於此心若所隨增亦為因耶？",
        "translation": "Regarding the mind bound to the desire realm that saw what was stopped by suffering and the mind that saw what was stopped by accumulation and cessation, would it also be a cause for that mind to increase in consequence?",
        "source": "T26n1539_005:0555c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設為因者亦隨增耶？",
        "translation": "Suppose this is the cause, and it increases accordingly?",
        "source": "T26n1539_005:0555c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至於過去無色界繫修所斷心，所有隨眠，彼於此心若所隨增亦為因耶？",
        "translation": "Even in the mind that was cultivated and eliminated in the formless realm in the past, would it be a cause if it were to increase in consequence of that mind?",
        "source": "T26n1539_005:0555c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設為因者亦隨增耶？",
        "translation": "Suppose this is the cause, and it increases accordingly?",
        "source": "T26n1539_005:0555c14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去欲界繫見苦所斷心，所有隨眠，彼於此心若所隨增亦為因耶？",
        "translation": "Regarding the mind that was bound to the desire realm in the past and which was eliminated by seeing suffering, would it also be a cause if it were to be followed by this mind?",
        "source": "T26n1539_005:0555c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或能為因非所隨增，或所隨增不能為因，或能為因亦所隨增，或不能為因亦非所隨增。",
        "translation": "Either it's a cause that doesn't follow, or it's a cause that doesn't follow and can't be a cause, or it's a cause that follows and can't be a cause that doesn't follow.",
        "source": "T26n1539_005:0555c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且能為因非所隨增者，謂諸隨眠在此心前同類遍行，即彼隨眠若不緣此、設緣已斷，及此相應隨眠已斷。",
        "translation": "Those who can be causes and aren't followed by causes are those whose latent dormancies are similarly pervasive in front of this mind, namely, those latent dormancies that don't have this condition, whose suppose conditions have been stopped, and those latent dormancies that are associated with this condition that have been stopped.",
        "source": "T26n1539_005:0555c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是所隨增不能為因者，謂諸隨眠在此心後同類遍行，即彼隨眠緣此未斷。",
        "translation": "They can't be the cause of that which follows, which is the similar pervasive condition of latent dormancy in this mind, that is, latent dormancy that's not yet stopped by its condition.",
        "source": "T26n1539_005:0555c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦能為因亦所隨增者，謂諸隨眠在此心前同類遍行，即彼隨眠緣此未斷，及此相應隨眠未斷。",
        "translation": "Those who can also be causes and increase as a result mean that latent dormancies of the same type are pervasive in front of this mind, that is, latent dormancies whose causes and conditions have not yet been stopped, and that latent dormancies associated with them have not yet been stopped.",
        "source": "T26n1539_005:0555c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能為因非所隨增者，謂諸隨眠在此心後同類遍行，即彼隨眠若不緣此、設緣已斷、若所餘緣、若他隨眠、若不同界遍行隨眠。",
        "translation": "Those who can't be causes and aren't increased by what follows mean that latent dormancy of the same type pervades this mind, that is, latent dormancy that isn't conditioned by this, conditioned by what's ended, conditioned by what's left, latent by others, or pervasively active latent dormancy in a different realm.",
        "source": "T26n1539_005:0555c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如過去欲界繫見苦所斷心，未來欲界繫見苦所斷心亦爾。",
        "translation": "As in the mind bound to the desire realm in the past and seeing what's stopped as painful, so in the mind bound to the desire realm in the future and seeing what's stopped as painful.",
        "source": "T26n1539_005:0555c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現在欲界繫見苦所斷心，所有隨眠，彼於此心，若所隨增亦為因耶？",
        "translation": "Regarding the mind that's bound to the present desire realm and sees what's stopped as painful, what would be the cause of its subsequent increase in that mind?",
        "source": "T26n1539_005:0555c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或能為因非所隨增，或所隨增不能為因，或能為因亦所隨增，或不能為因亦非所隨增。",
        "translation": "Either it's a cause that doesn't follow, or it's a cause that doesn't follow and can't be a cause, or it's a cause that follows and can't be a cause that doesn't follow.",
        "source": "T26n1539_005:0556a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且能為因非所隨增者，謂諸隨眠在此心前同類遍行，即彼隨眠若不緣此、設緣已斷。",
        "translation": "Those who can be causes and aren't followed by causes are those whose latent dormancies are similarly pervasive in front of this mind, that is, those latent dormancies that don't have this condition and whose suppose conditions have been stopped.",
        "source": "T26n1539_005:0556a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是所隨增不能為因者，謂諸隨眠在此心後同類遍行，即彼隨眠緣此未斷。",
        "translation": "It's an increase that can't be the cause, meaning that latent dormancy of the same type is pervasive in the mind after this, meaning that latent dormancy has not yet been stopped depending on this.",
        "source": "T26n1539_005:0556a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦能為因亦所隨增者，謂諸隨眠在此心前同類遍行，即彼隨眠緣此未斷，及此相應所有隨眠。",
        "translation": "Those who can also be causes and increase as a consequence are those whose latent dormancies are similarly pervasive in front of this mind, whose latent dormancies are contingent on this and have not yet been stopped, and all the latent dormancies that go along with this.",
        "source": "T26n1539_005:0556a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能為因非所隨增者，謂諸隨眠在此心後同類遍行，即彼隨眠若不緣此、設緣已斷、若所餘緣、若他隨眠、若不同界遍行隨眠。",
        "translation": "Those who can't be causes and aren't increased by them refer to latent dormancies that are similarly pervasive after this mind, namely, latent dormancies that aren't conditioned here, suppose the condition has been stopped, have residual conditions, are followed by others, or are pervasively followed by different realms.",
        "source": "T26n1539_005:0556a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見苦所斷心，見集滅道及修所斷染污心亦爾。",
        "translation": "As the mind that sees what's stopped by suffering, so are the defiled minds that see the path to the cessation of suffering and the defilement that's stopped by cultivation.",
        "source": "T26n1539_005:0556a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去欲界繫修所斷不染污心，所有隨眠，彼於此心，若所隨增亦為因耶？",
        "translation": "If there was latent dormancy in the undefiled mind that was bound to the desire realm and cultivated in the past, would that mind be a cause for any increase in latency?",
        "source": "T26n1539_005:0556a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂除隨眠所感異熟，餘過去欲界繫修所斷不染污心，所有隨眠，彼於此心若所隨增即不為因。",
        "translation": "That is, except for the ripening caused by latent dormancy, whatever latent dormancy is present in the undefiled mind that's ended by cultivation of the tethers of the desire realm in the past won't be the cause if it's followed by this mind.",
        "source": "T26n1539_005:0556a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於此心能為因者，即非隨眠亦不隨增。",
        "translation": "If this mind could be the cause, then it wouldn't be latent and wouldn't increase latently.",
        "source": "T26n1539_005:0556a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於隨眠所感異熟心，或能為因非所隨增，或所隨增不能為因，或能為因亦所隨增，或不能為因亦非所隨增。",
        "translation": "The mind subject to retribution from latent dormancy may be able to cause what's not followed by an increase, may be unable to cause what's followed by an increase, may be able to cause what's followed by an increase, or may not be able to cause what's not followed by an increase.",
        "source": "T26n1539_005:0556a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且能為因非所隨增者，謂諸隨眠為因能感此心異熟，即彼隨眠若不緣此、設緣已斷。",
        "translation": "Those who can be causes and those who aren't followers are those whose latent dormancy is the cause that brings about the mind's ripening, even if that latent dormancy isn't a cause for it and assumes the cause has been eliminated.",
        "source": "T26n1539_005:0556a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是所隨增不能為因者，謂諸隨眠不為因感此心異熟，即彼隨眠緣此未斷。",
        "translation": "It can't be a cause that's followed by an increase, meaning that those latent dormancies aren't causes that bring about the mind's retribution, that is, those latent dormancies have not been stopped because of this condition.",
        "source": "T26n1539_005:0556a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦能為因亦所隨增者，謂諸隨眠為因能感此心異熟，即彼隨眠緣此未斷。",
        "translation": "Those who can also be causes and increase as a consequence mean that those latent dormancies are causes that bring about the mind's retribution, which is a condition of that latent dormancy that has yet to be stopped.",
        "source": "T26n1539_005:0556a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能為因非所隨增者，謂諸隨眠不為因感此心異熟，即彼隨眠若不緣此、設緣已斷、若所餘緣、若他隨眠、若不同界遍行隨眠。",
        "translation": "Those who can't be causes and aren't followed by increases mean that those latent dormancies aren't causes that bring about the mind's retribution, that is, those latent dormancies that aren't contingent here, that have ended contingencies, that have residual contingencies, that are contingent on other latent dormancies, and that are pervasively contingent on different realms.",
        "source": "T26n1539_005:0556a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如過去，未來、現在亦爾。",
        "translation": "As in the past, so in the future and present.",
        "source": "T26n1539_005:0556a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如欲界繫，色界繫、無色界繫亦爾。",
        "translation": "So are the fetters of the desire realm, the fetters of the form realm, and the fetters of the formless realm.",
        "source": "T26n1539_005:0556a29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中差別有色界繫心、無色界繫心不應說有隨眠異熟。",
        "translation": "This distinction suggests that the mind tethered to the form realm and the mind tethered to the formless realm shouldn't be said to have the ripening of latent dormancy.",
        "source": "T26n1539_005:0556b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十五心，謂欲界繫有五心、色界繫有五心、無色界繫有五心。",
        "translation": "There are fifteen minds, meaning there are five minds bound to the desire realm, five minds bound to the form realm, and five minds bound to the formless realm.",
        "source": "T26n1539_005:0556b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是十五心，或過去、或未來、或現在。",
        "translation": "These fifteen mental states may have been in the past, future, or present.",
        "source": "T26n1539_005:0556b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何欲界繫有五心？",
        "translation": "What are the five mental states that bind the desire realm?",
        "source": "T26n1539_005:0556b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂欲界繫見苦所斷心、見集滅道修所斷心。",
        "translation": "It's the mind bound to the desire realm that sees what's stopped by suffering and the mind that's stopped by the cultivation of the path to accumulation and cessation.",
        "source": "T26n1539_005:0556b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如欲界繫，色界繫、無色界繫亦爾。",
        "translation": "It's the same for the fetters of the desire realm, the fetters of the form realm, and the fetters of the formless realm.",
        "source": "T26n1539_005:0556b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去欲界繫見苦所斷心，所有隨眠，彼於此心若不隨增，亦不為因耶？",
        "translation": "Regarding the mind bound to the desire realm that sees what's stopped by suffering and the mind that's stopped by accumulating, would it not have been a cause if it hadn't been followed by this mind?",
        "source": "T26n1539_005:0556b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設不為因，亦不隨增耶？",
        "translation": "Suppose it's not a cause, and it doesn't increase accordingly?",
        "source": "T26n1539_005:0556b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至於現在無色界繫修所斷心，所有隨眠，彼於此心若不隨增，亦不為因耶？",
        "translation": "Even in the mind that's cultivated and eliminated in the present formless realm, what if it's not followed by an increase in that mind, and it's not a cause?",
        "source": "T26n1539_005:0556b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設不為因，亦不隨增耶？",
        "translation": "Suppose it's not a cause, and it doesn't increase accordingly?",
        "source": "T26n1539_005:0556b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去欲界繫見苦所斷心，所有隨眠，彼於此心若不隨增，亦不為因耶？",
        "translation": "Regarding the mind that was bound to the desire realm in the past and that was eliminated by seeing suffering, would it not have been a cause if it hadn't been followed by an increase in that mind?",
        "source": "T26n1539_005:0556b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或不為因非不隨增，或不隨增非不為因，或不為因亦不隨增，或非不為因非不隨增。",
        "translation": "It may not be a cause that isn't followed by increase, or it may not be followed by increase that isn't a cause, or it may not be a cause that isn't followed by increase, or it may not be a cause that isn't followed by increase.",
        "source": "T26n1539_005:0556b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且不為因非不隨增者，謂諸隨眠在此心後同類遍行，即彼隨眠緣此未斷。",
        "translation": "What's not a cause and what's not a consequence means that these latent dormancies are similarly pervasive after this mind, meaning that their latent dormancies are conditioned by this and haven't been stopped.",
        "source": "T26n1539_005:0556b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非所隨增非不為因者，謂諸隨眠在此心前同類遍行，即彼隨眠若不緣此、設緣已斷，及此相應隨眠已斷。",
        "translation": "What's not followed by and what's not a cause refers to latent dormancy that's similarly pervasive in front of this mind, namely, latent dormancy that's not conditioned here, suppose the condition has been stopped, and latent dormancy associated with that has been stopped.",
        "source": "T26n1539_005:0556b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能為因非所隨增者，謂諸隨眠在此心後同類遍行，即彼隨眠，若不緣此、設緣已斷、若所餘緣、若他隨眠、若不同界遍行隨眠。",
        "translation": "What's not a cause that isn't increased by what's followed refers to latent dormancy that's similarly pervasive after this mind, namely, latent dormancy that isn't conditioned by this, that has been stopped by supposed conditions, that has residual conditions, that's followed by others, and that's followed by pervasive dormancy in a different realm.",
        "source": "T26n1539_005:0556b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非不為因非不隨增者，謂諸隨眠在此心前同類遍行，即彼隨眠緣此未斷，及此相應隨眠未斷。",
        "translation": "Those who aren't non-causes and aren't followed by increase refer to latent dormancy that's similarly pervasive in front of this mind, namely, latent dormancy that's contingent on this that hasn't been stopped, and latent dormancy that's associated with this that hasn't been stopped.",
        "source": "T26n1539_005:0556b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如過去欲界繫見苦所斷心，未來亦爾。",
        "translation": "As in the past, the mind that's stopped by the affliction of fetters in the desire realm, so will it be in the future.",
        "source": "T26n1539_005:0556b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於現在欲界繫見苦所斷心，所有隨眠，彼於此心若不隨增，亦不為因耶？",
        "translation": "In the mind that's bound to the present desire realm and sees what's stopped by suffering, if these latent dormancies don't increase in that mind, wouldn't that be a cause?",
        "source": "T26n1539_005:0556b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或不為因非不隨增，或不隨增非不為因，或不為因亦不隨增，或非不為因非不隨增。",
        "translation": "It may not be a cause that isn't followed by increase, or it may not be followed by increase that isn't a cause, or it may not be a cause that isn't followed by increase, or it may not be a cause that isn't followed by increase.",
        "source": "T26n1539_005:0556b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且不為因非不隨增者，謂諸隨眠在此心後同類遍行，即彼隨眠緣此未斷。",
        "translation": "What's not a cause and what's not a consequence means that these latent dormancies are similarly pervasive after this mind, meaning that their latent dormancies are conditioned by this and haven't been stopped.",
        "source": "T26n1539_005:0556b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非所隨增非不為因者，為諸隨眠在此心前同類遍行，即彼隨眠若不緣此、設緣已斷。",
        "translation": "What's not followed and what's not a cause is the similar pervasive presence of latent dormancy in front of this mind, that is, latent dormancy that's not conditioned here if the condition has been stopped.",
        "source": "T26n1539_005:0556c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能為因非所隨眠者，謂諸隨眠在此心後同類遍行，即彼隨眠若不緣此、設緣已斷、若所餘緣、若他隨眠、若不同界遍行隨眠。",
        "translation": "What's not a cause and what's not followed is the same kind of latent dormancy that's pervasive after this mind, namely, latent dormancy that isn't conditioned here, conditioned by assumptions that have been stopped, conditioned by remainder, latent in others, or pervasive latent in different realms.",
        "source": "T26n1539_005:0556c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非不為因非不隨增者，謂諸隨眠在此心前同類遍行，即彼隨眠緣此未斷，及此相應所有隨眠。",
        "translation": "Those who don't cause or don't follow are those whose latent dormancies are similarly pervasive in front of this mind, namely, those latent dormancies that are contingent on this one but haven't been stopped, and all the latent dormancies that go along with it.",
        "source": "T26n1539_005:0556c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見苦所斷心，見集滅道及修所斷染污心亦爾。",
        "translation": "As the mind that sees what's stopped by suffering, so are the defiled minds that see what's collected and the path to cessation and what's cultivated and stopped.",
        "source": "T26n1539_005:0556c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去欲界繫修所斷不染污心，所有隨眠，彼於此心若不隨增，亦不為因耶？",
        "translation": "If there was latent dormancy in the undefiled mind that was bound to the desire realm and cultivated, wouldn't that be a cause if it wasn't followed by more latent dormancy in that mind?",
        "source": "T26n1539_005:0556c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂除隨眠所感異熟，於餘欲界繫修所斷不染污心，所有隨眠，彼於此心若不隨增亦不為因，或不為因非不隨增，謂諸隨眠緣此未斷。",
        "translation": "It means that except for the retribution caused by latent dormancy, the rest of the undefiled mind that's bound to the desire realm and cultivated is latent, and if it doesn't increase or cause, or if it doesn't cause or doesn't increase, it means that the latent dormancy is conditioned by that which has yet to be stopped.",
        "source": "T26n1539_005:0556c12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若諸隨眠所感異熟，或不為因非不隨增，或不隨增非不為因，或不為因亦不隨增，或非不為因非不隨增。",
        "translation": "If the results of latent dormancy are ripening, either they aren't causes and don't increase, or they aren't causes and don't increase, or they aren't causes and don't increase, or they aren't causes and don't increase.",
        "source": "T26n1539_005:0556c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能為因非不隨增者，謂諸隨眠不為因感此心異熟，即彼隨眠緣此未斷。",
        "translation": "Those who can't be causes and aren't followed by causes mean that the mind's retribution is brought about by latent dormancy that isn't a cause, which is a condition of that latent dormancy that hasn't been stopped.",
        "source": "T26n1539_005:0556c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非所隨增非不為因者，謂諸隨眠為因能感此心異熟，即彼隨眠若不緣此、設緣已斷。",
        "translation": "It's not something that increases and isn't a cause, which means that those latent dormancies are causes that bring about the mind's retribution, that is, if those latent dormancies aren't contingent on this, then the contingency has been stopped.",
        "source": "T26n1539_005:0556c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不能為因不隨增者，謂諸隨眠不為因感此心異熟，即彼隨眠若不緣此、設緣已斷、若所餘緣、若他隨眠、若不同界遍行隨眠。",
        "translation": "Those who can't be causes and don't increase following are those whose latent dormancy isn't a cause that brings about the mind's retribution, namely, latent dormancy that isn't conditioned here, conditioned by assumptions that have been stopped, conditioned by remainder, latent in others, or pervasively active latent in different realms.",
        "source": "T26n1539_005:0556c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非不為因非不隨增者，謂諸隨眠為因能感此心異熟，即彼隨眠緣此未斷。",
        "translation": "When it's not a cause that doesn't follow, it's a cause that's capable of bringing about the mind's retribution, that is, when it's a condition that hasn't yet been ended.",
        "source": "T26n1539_005:0556c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如過去欲界繫修所斷不染污心，未來、現在亦爾。",
        "translation": "As the undefiled mind that was fettered in the desire realm and that was cultivated in the past, so will it be in the future and present.",
        "source": "T26n1539_005:0556c26_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如欲界繫心，色界繫心、無色界繫心亦爾。",
        "translation": "The mind that was fettered in the desire realm, the mind that was fettered in the form realm, and the mind that was fettered in the formless realm are likewise.",
        "source": "T26n1539_005:0556c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中差別者，色界繫心、無色界繫心不應說有隨眠異熟。",
        "translation": "Of these distinctions, the mind that's fettered in the form realm and the mind that's fettered in the formless realm shouldn't be said to have the maturation of latencies.",
        "source": "T26n1539_005:0556c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有六識身，謂眼識耳鼻舌身意識。",
        "translation": "There are the six consciousness bodies, which are the visual consciousness, the ear, nose, tongue, and body consciousness.",
        "source": "T26n1539_005:0557a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是六識身，或善、或不善、或有覆無記、或無覆無記。",
        "translation": "These six consciousness bodies are either good, unskillful, covered and indeterminate, or uncovered and indeterminate.",
        "source": "T26n1539_005:0557a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善眼識所有結、縛、隨眠、隨煩惱、纏，幾當言為因當言為緣、幾當言為緣而不為因？",
        "translation": "Regarding the bonds, fetters, latencies, and afflictions and entanglements of the good visual consciousness, how often should they be said to be causes and how often should they be said to be conditions and not be causes?",
        "source": "T26n1539_005:0557a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於不善有覆無記無覆無記眼識，所有結、縛、隨眠、隨煩惱、纏，幾當言為因當言為緣、幾當言為緣而不為因？",
        "translation": "With regard to the unwholesome, obstructive, indeterminate, and indeterminate visual consciousness, how many of the bonds, fetters, latencies, and afflictions and entanglements should be said to be causes and how many should be said to be conditions but not causes?",
        "source": "T26n1539_005:0557a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如眼識，耳鼻舌身意識亦爾。",
        "translation": "As with the visual consciousness, so it is with the ear, nose, tongue, and body consciousnesses.",
        "source": "T26n1539_005:0557a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善眼識，一切結、縛、隨眠、隨煩惱、纏，皆當言為緣而不為因。",
        "translation": "With the good eye consciousness, all the bonds, fetters, latencies, and afflictive tendencies should be called causes and not conditions.",
        "source": "T26n1539_005:0557a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於不善眼識，有七結、七縛、十五隨眠、二十隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the unwholesome visual consciousness, there are seven bonds, seven fetters, 15 latent tendencies, and 20 afflictive tendencies that should be called causes and that should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於有覆無記眼識，有六結、六縛、十四隨眠、十六隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the obstructed indeterminate visual consciousness, there are six bonds, six fetters, 14 latent tendencies, and 16 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無覆無記眼識中，除隨眠異熟，於餘無覆無記眼識，一切結、縛、隨眠、隨煩惱、纏，皆當言為緣而不為因。",
        "translation": "In the unobstructed indeterminate visual consciousness, except for the retribution of latencies, all the other unobstructed indeterminate visual consciousnesses that have bonds, fetters, latencies, afflictions, and entanglements should be called causes and not conditions.",
        "source": "T26n1539_005:0557a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於隨眠異熟眼識，有七結、七縛、三十四隨眠、三十九隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the latently ripening visual consciousness, there are seven bonds, seven fetters, 34 latent tendencies, and 39 afflictive tendencies that should be called causes and should be called conditions, but all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0557a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心耶？",
        "translation": "Is it a single mind?",
        "source": "T26n1539_005:0557a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：不爾。",
        "translation": "He said, \"No.",
        "source": "T26n1539_005:0557a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見苦所斷邪見隨眠異熟眼識，有二結、二縛、二隨眠、七隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the eye consciousness that's ripe for mistaken views and latencies that are stopped by seeing suffering, there are two bonds, two fetters, two latencies, and seven binding afflictions that should be called causes and should be called conditions, and everything else should be called a condition but not a cause.",
        "source": "T26n1539_005:0557a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見苦所斷邪見隨眠異熟眼識，見取、戒禁取、疑、貪、恚、慢隨眠異熟眼識亦爾。",
        "translation": "As the eye consciousness that's ripe with dormancy following wrong views that are stopped by seeing suffering, so is the eye consciousness that's ripe with dormancy following adherence to views, adherence to precepts, doubt, greed, anger, and conceit.",
        "source": "T26n1539_005:0557a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見苦所斷不共無明隨眠異熟眼識，有一結、一縛、一隨眠、六隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the eye consciousness that's ripe with drowsiness following uncommon ignorance that's stopped by seeing suffering, there's one bond, one fetter, one latent tendency, and six binding afflictions that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見集所斷邪見隨眠異熟眼識，有二結、二縛、二隨眠、七隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "The retentive visual consciousness that has two bonds, two fetters, two latent tendencies, and seven afflictive tendencies that are eliminated in the wrong view of the arising of views should be called causes and conditions, and all the rest should be called causes and conditions but not reasons.",
        "source": "T26n1539_005:0557a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見集所斷邪見隨眠異熟眼識，見取、疑、貪、恚、慢隨眠異熟眼識亦爾。",
        "translation": "As the eye consciousness that's ripe with dormancy following wrong views that are stopped by the view set, so is the eye consciousness that's ripe with dormancy following attachment, doubt, greed, anger, and conceit.",
        "source": "T26n1539_005:0557a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見集所斷不共無明隨眠異熟眼識，有一結、一縛、一隨眠、六隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the eye consciousness that's ripe with drowsiness following unshared ignorance that's stopped by the view of origination, there's one bond, one fetter, one latent tendency, and six binding afflictions that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見滅所斷邪見隨眠異熟眼識，有二結、二縛、二隨眠、七隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the retentive visual consciousness that has two bonds, two fetters, two latent tendencies, and seven afflictive tendencies that are eliminated by insight, that should be called causes and conditions, and all the rest should be called causes and conditions but not reasons.",
        "source": "T26n1539_005:0557b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見滅所斷邪見隨眠異熟眼識，見取、疑、貪、恚、慢隨眠異熟眼識亦爾。",
        "translation": "As the mistaken view followed by dormancy and the immature visual consciousness that's stopped by the cessation of views, so is the view, grasping, doubt, greed, anger, and conceit followed by dormancy and the immature visual consciousness.",
        "source": "T26n1539_005:0557b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見滅所斷不共無明隨眠異熟眼識，有一結、一縛、一隨眠、六隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the eye consciousness that's ripe with drowsiness following uncommon ignorance that's stopped by the cessation of views, there's one bond, one fetter, one latent tendency, and six binding afflictions that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557b09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見道所斷邪見隨眠異熟眼識，有二結、二縛、二隨眠、七隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the retractive eye consciousness that's the result of mistaken views and latencies stopped in the path of seeing, there are two bonds, two fetters, two latencies, and seven tethers of affliction that should be called causes and should be called conditions, and all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0557b12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見道所斷邪見隨眠異熟眼識，見取、戒禁取、疑、貪、恚、慢隨眠異熟眼識亦爾。",
        "translation": "As the eye consciousness that's ripe with dormancy following wrong views that are stopped in the path of seeing, so is the eye consciousness that's ripe with dormancy following adherence to views, adherence to precepts, doubt, greed, anger, and conceit.",
        "source": "T26n1539_005:0557b15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見道所斷不共無明隨眠異熟眼識，有一結、一縛、一隨眠、六隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the eye consciousness that's ripe with drowsiness following uncommon ignorance that's stopped in the path of seeing, there's one bond, one fetter, one latent tendency, and six derivative afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於修所斷貪隨眠異熟眼識，有二結、二縛、二隨眠、七隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the case of the retentive, latent, and immature visual consciousness that's cultivated and eliminated, there are two bonds, two fetters, two latencies, and seven afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0557b20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如修所斷貪隨眠異熟眼識，恚、慢隨眠異熟眼識亦爾。",
        "translation": "As the eye consciousness that's ripe with the latent tendencies of greed that are eliminated by cultivation, so are the eye consciousnesses that are ripe with the latent tendencies of anger and conceit.",
        "source": "T26n1539_005:0557b22_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於修所斷不共無明隨眠異熟眼識，有一結、一縛、一隨眠、六隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the eye consciousness that's cultivated to eliminate the tendency toward the followings of uncommon ignorance, there's one bond, one fetter, one latency, and six tendencies of affliction that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如眼識，耳鼻舌身識亦爾。",
        "translation": "As with the visual consciousness, so it is with the ear, nose, tongue, and body consciousnesses.",
        "source": "T26n1539_005:0557b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中差別者，鼻識舌識不應說有有覆無記。",
        "translation": "Of these distinctions, the nasal consciousness and tongue consciousness shouldn't be said to have obscuration or indeterminacy.",
        "source": "T26n1539_005:0557b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善意識，一切結、縛、隨眠、隨煩惱、纏，皆當言為緣而不為因。",
        "translation": "With the mind consciousness that's good, all the bonds, fetters, latencies, and afflictions and entanglements should be described as causes and not as conditions.",
        "source": "T26n1539_005:0557b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於不善意識，有七結、七縛、三十六隨眠、四十一隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "With regard to the unwholesome mental consciousness, there are seven bonds, seven fetters, 36 latent tendencies, and 41 afflictive tendencies that should be called causes and that should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心耶？",
        "translation": "Is it a single mind?",
        "source": "T26n1539_005:0557c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：不爾。",
        "translation": "He said, \"No.",
        "source": "T26n1539_005:0557c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見苦所斷不善意識，有七結、七縛、十四隨眠、十九隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "Regarding the unwholesome mental consciousness that's ended by seeing suffering, there are seven bonds, seven fetters, 14 latent afflictive tendencies, and 19 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見集所斷不善意識，有七結、七縛、十四隨眠、十九隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "The unwholesome mental consciousness that's ended in the path of seeing accumulation has seven bonds, seven fetters, 14 latencies, and 19 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0557c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見滅所斷不善意識，有七結、七縛、十八隨眠、二十三隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "The unwholesome mental consciousness that's ended in the path of seeing has seven bonds, seven fetters, 18 latent afflictive tendencies, and 23 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0557c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見道所斷不善意識，有七結、七縛、十九隨眠、二十四隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "The unwholesome mental consciousness that's ended in the path of seeing has seven bonds, seven fetters, 19 latencies, and 24 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0557c11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於修所斷不善意識，有七結、七縛、十五隨眠、二十隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the cultivation of the unwholesome mental consciousness that's ended, there are seven bonds, seven fetters, fifteen latencies, and twenty afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0557c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於有覆無記意識，有七結、七縛、七十六隨眠、八十一隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the obscured indeterminate consciousness, there are seven bonds, seven fetters, 76 latencies, and 81 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557c16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心耶？",
        "translation": "Is it a single mind?",
        "source": "T26n1539_005:0557c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：不爾。",
        "translation": "He said, \"No.",
        "source": "T26n1539_005:0557c19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於欲界繫有覆無記意識，有七結、七縛、十四隨眠、十九隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the desire realm, the fetters of the covered, indeterminate consciousness has seven bonds, seven fetters, 14 latent afflictive tendencies, and 19 afflictive tendencies, which should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557c19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見苦所斷有覆無記意識，有六結、六縛、十三隨眠、十五隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the form realm binding, the covered, indeterminate consciousness that sees the elimination of suffering has six bonds, six fetters, 13 latent afflictions, and 15 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見集所斷有覆無記意識，有六結、六縛、十三隨眠、十五隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the form realm, the covering and indeterminate mental consciousness that's ended by the fetters of views, there are six bonds, six fetters, 13 latent afflictions, and 15 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557c25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見滅所斷有覆無記意識，有六結、六縛、十七隨眠、十九隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "The covered, indeterminate mental consciousness that's ended by the fetters of the form realm and sees cessation has six bonds, six fetters, 17 latent tendencies, and 19 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0557c28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見道所斷有覆無記意識，有六結、六縛、十八隨眠、二十隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the covering and indeterminate mental consciousness that's ended in the form realm fetters of the path of seeing, there are six bonds, six fetters, 18 latent tendencies, and 20 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions and not causes.",
        "source": "T26n1539_005:0558a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫修所斷有覆無記意識，有六結、六縛、十四隨眠、十六隨煩惱纏，當言為因當言為緣，所餘一切當言為緣而不為因。",
        "translation": "In the covered indeterminate consciousness that's cultivated and eliminated in the form realm, there are six bonds, six fetters, 14 latent afflictive tendencies, and 16 afflictive tendencies that should be called causes and should be called conditions, and all the rest should be called conditions but not causes.",
        "source": "T26n1539_005:0558a05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無覆無記意識，一切結、縛、隨眠、隨煩惱、纏，當言為緣而不為因。",
        "translation": "In the unobstructed, indeterminate consciousness, all the bonds, fetters, latent tendencies, and afflictive tendencies should be called causes and not conditions.",
        "source": "T26n1539_005:0558a08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有六識身，謂眼識耳鼻舌身意識。",
        "translation": "There are the six consciousness bodies, which are the visual consciousness, the ear, nose, tongue, and body consciousnesses.",
        "source": "T26n1539_005:0558a09_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是六識身，或善、或不善、或有覆無記、或無覆無記。",
        "translation": "Thus, the body of these six consciousnesses is either good, unskillful, covered, or uncovered by indeterminate consciousness.",
        "source": "T26n1539_005:0558a10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善眼識所有結、縛、隨眠、隨煩惱、纏，當言與幾相應、幾不相應？",
        "translation": "With regard to the bonds, fetters, latencies, and afflictions and entanglements of the good visual consciousness, how many should you say are associated with it and how many are not?",
        "source": "T26n1539_005:0558a11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於不善有覆無記無覆無記眼識，所有結、縛、隨眠、隨煩惱、纏，當言與幾相應、幾不相應？",
        "translation": "With regard to the unwholesome, obstructive, indeterminate, and indeterminate visual consciousness, what kinds of bonds, fetters, latencies, and afflictions and entanglements should you say are associated and what kinds are not associated with it?",
        "source": "T26n1539_005:0558a13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如眼識，耳鼻舌身意識亦爾。",
        "translation": "As with the eye-consciousness, so too with the ear, nose, tongue, and body consciousnesses.",
        "source": "T26n1539_005:0558a15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善眼識，一切結、縛、隨眠、隨煩惱、纏，當言皆不相應。",
        "translation": "With the good eye consciousness, all the bonds, fetters, latencies, and afflictive tendencies should be said not to be associated with it.",
        "source": "T26n1539_005:0558a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於不善眼識，有三結、三縛、三隨眠、七隨煩惱纏，當言相應。",
        "translation": "With the unwholesome eye consciousness, there are three bonds, three fetters, three latent tendencies, and seven afflictive tendencies, which should be said to be associated.",
        "source": "T26n1539_005:0558a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心耶？",
        "translation": "What's one mind?",
        "source": "T26n1539_005:0558a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：不爾。",
        "translation": "He said, \"No.",
        "source": "T26n1539_005:0558a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於貪相應不善眼識，有二結、二縛、二隨眠、六隨煩惱纏，當言相應。",
        "translation": "The unwholesome eye consciousness associated with greed has two bonds, two fetters, two latent tendencies, and six binding afflictions, which should be described as associated.",
        "source": "T26n1539_005:0558a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如貪相應不善眼識，瞋相應不善眼識亦爾。",
        "translation": "As the eye consciousness that's unwholesome associated with greed, so is the eye consciousness that's unwholesome associated with anger.",
        "source": "T26n1539_005:0558a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於有覆無記眼識，有二結、二縛、二隨眠、四隨煩惱纏，當言相應。",
        "translation": "In the obstructed indeterminate visual consciousness, there are two bonds, two fetters, two latencies, and four afflictive tendencies, which should be described as concomitant.",
        "source": "T26n1539_005:0558a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無覆無記眼識，一切結、縛、隨眠、隨煩惱、纏，當言皆不相應。",
        "translation": "In the unobstructed, indeterminate visual consciousness, all the bonds, fetters, latent dormancies, and afflictive tendencies should be said not to correspond.",
        "source": "T26n1539_005:0558a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如眼識，耳鼻舌身識亦爾。",
        "translation": "As with the eye consciousness, so too with the ear, nose, tongue, and body consciousnesses.",
        "source": "T26n1539_005:0558a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中差別者，鼻識舌識不應說有有覆無記。",
        "translation": "Of these distinctions, the nasal consciousness and tongue consciousness shouldn't be said to have obscuration and indeterminacy.",
        "source": "T26n1539_005:0558a24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善意識，一切結、縛、隨眠、隨煩惱、纏，當言皆不相應。",
        "translation": "With the mind consciousness that's good, all the bonds, fetters, latencies, and afflictions and entanglements should be said to be unassociated.",
        "source": "T26n1539_005:0558a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於不善意識，有七結、七縛、三十四隨眠、三十九隨煩惱纏，當言相應。",
        "translation": "With the consciousness of unwholesome thoughts, there are seven bonds, seven fetters, 34 latent tendencies, and 39 afflictive tendencies, which should be said to be associated.",
        "source": "T26n1539_005:0558a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心耶？",
        "translation": "Is it one mind?",
        "source": "T26n1539_005:0558a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：不爾。",
        "translation": "He said, \"No.",
        "source": "T26n1539_005:0558a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見苦所斷邪見隨眠相應不善意識，有二結、二縛、二隨眠；若覺悟位，六隨煩惱纏當言相應；若睡眠位，增第七眠。",
        "translation": "Regarding the unwholesome mental consciousness associated with mistaken views and latencies that are stopped by seeing suffering, there are two bonds, two fetters, and two latencies; if one were at the stage of awakening, the six binding afflictions would be said to be associated, and if one were at the stage of drowsiness, the seventh latency would be added.",
        "source": "T26n1539_005:0558a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見苦所斷邪見隨眠相應不善意識，見取、戒禁取、疑、貪、恚、慢隨眠相應不善意識亦爾。",
        "translation": "As the unwholesome mental consciousness associated with the mistaken view of dormancy that's stopped by seeing suffering, so is the unwholesome mental consciousness associated with the adherence to views, adherence to precepts, doubt, greed, anger, and conceit.",
        "source": "T26n1539_005:0558b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見苦所斷不共無明隨眠相應不善意識，有一結、一縛、一隨眠；若覺悟位，五隨煩惱纏當言相應；若睡眠位，增第六眠。",
        "translation": "In the unwholesome mental consciousness associated with the latent tendencies of ignorance that are stopped by seeing suffering, there's one bond, one fetter, and one latent tendency; if one were at the stage of awakening, the five binding tendencies of affliction would be said to be associated, and if one were at the stage of drowsiness, the sixth latency would be added.",
        "source": "T26n1539_005:0558b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見集所斷邪見隨眠相應不善意識，有二結、二縛、二隨眠；若覺悟位，六隨煩惱纏當言相應；若睡眠位，增第七眠。",
        "translation": "The unwholesome mental consciousness associated with the mistaken view of dormancy that's eliminated in the view of accumulation has two bonds, two fetters, and two latent tendencies; if one is at the stage of awakening, the six latent tendencies are said to be associated with it; if one is at the stage of drowsiness, the seventh latency is added.",
        "source": "T26n1539_005:0558b07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見集所斷邪見隨眠相應不善意識，見取、疑、貪、恚、慢隨眠相應不善意識亦爾。",
        "translation": "As the unwholesome mental consciousness associated with the latent tendencies of wrong views that are eliminated in the arising of views, so too are the unwholesome mental consciousnesses associated with the latent tendencies of views, doubts, greed, anger, and conceit.",
        "source": "T26n1539_005:0558b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見集所斷不共無明隨眠相應不善意識，有一結、一縛、一隨眠；若覺悟位，五隨煩惱纏當言相應；若睡眠位，增第六眠。",
        "translation": "As for the unwholesome mental consciousness associated with the latent tendencies of ignorance that are stopped by the arising of views, there's one bond, one fetter, and one latent tendency; if one is at the stage of awakening, the five binding tendencies of affliction will be said to be associated with it; if one is at the stage of drowsiness, the sixth latency will be added.",
        "source": "T26n1539_005:0558b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見滅所斷邪見隨眠相應不善意識，有二結、二縛、二隨眠；若覺悟位，六隨煩惱纏當言相應；若睡眠位，增第七眠。",
        "translation": "For the unwholesome mental consciousness associated with the mistaken view of dormancy that's stopped by seeing, there are two bonds, two fetters, and two latent tendencies; if one is at the stage of awakening, six latent tendencies should be described as associated with it; if one is at the stage of drowsiness, the seventh latency should be added.",
        "source": "T26n1539_005:0558b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見滅所斷邪見隨眠相應不善意識，見取、疑、貪、恚、慢隨眠相應不善意識亦爾。",
        "translation": "As the unwholesome mental consciousness associated with the latent tendencies of wrong views that are stopped by seeing, so too are the unwholesome mental consciousnesses associated with the latent tendencies of views, doubt, greed, anger, and conceit.",
        "source": "T26n1539_005:0558b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見滅所斷不共無明隨眠相應不善意識，有一結、一縛、一隨眠；若覺悟位，五隨煩惱纏當言相應；若睡眠位，增第六眠。",
        "translation": "In the unwholesome mental consciousness associated with the latent tendencies of uncommon ignorance that are stopped by seeing, there's one bond, one fetter, and one latent tendency; if one is at the stage of awakening, the five binding tendencies of affliction will be said to be associated, and if one is at the stage of drowsiness, the sixth latency will be added.",
        "source": "T26n1539_005:0558b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見道所斷邪見隨眠相應不善意識，有二結、二縛、二隨眠；若覺悟位，六隨煩惱纏當言相應；若睡眠位，增第七眠。",
        "translation": "An unwholesome mental consciousness associated with mistaken views and latencies that are eliminated in the path of seeing has two bonds, two fetters, and two latencies; if one is at the stage of awakening, six latencies associated with afflictive tendencies should be described as corresponding; if one is at the stage of drowsiness, the seventh latency should be added.",
        "source": "T26n1539_005:0558b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如見道所斷邪見隨眠相應不善意識，見取、戒禁取、疑、貪、恚、慢隨眠相應不善意識亦爾。",
        "translation": "As the unwholesome mental consciousness associated with the latent tendencies of wrong views that are stopped in the path of seeing, so too are the unwholesome mental consciousnesses associated with the latent tendencies of mistaken views, adherence to precepts, adherence to prohibitions, doubt, greed, anger, and conceit.",
        "source": "T26n1539_005:0558b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於見道所斷不共無明隨眠相應不善意識，有一結、一縛、一隨眠；若覺悟位，五隨煩惱纏當言相應；若睡眠位，增第六眠。",
        "translation": "As for the unwholesome mental consciousness associated with the latent tendencies of unshared ignorance that are eliminated in the path of seeing, there's one bond, one fetter, and one latent tendency; if one is at the stage of awakening, the five binding tendencies of affliction should be said to be associated, and if one is at the stage of drowsiness, the sixth latency should be added.",
        "source": "T26n1539_005:0558b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於修所斷貪隨眠相應不善意識，有二結、二縛、二隨眠；若覺悟位，六隨煩惱纏當言相應；若睡眠位，增第七眠。",
        "translation": "The unwholesome mental consciousness associated with the cultivation of the desire for latencies that's stopped has two bonds, two fetters, and two latencies; if one is at the stage of awakening, the six afflictive tendencies that follow should be said to correspond, and if one is at the stage of drowsiness, the seventh latency should be added.",
        "source": "T26n1539_005:0558b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如修所斷貪隨眠相應不善意識，恚、慢隨眠相應不善意識亦爾。",
        "translation": "As the unwholesome mental consciousness associated with the latent tendencies of greed that are eliminated by cultivation, so are the unwholesome mental consciousnesses associated with the latent tendencies of anger and conceit.",
        "source": "T26n1539_005:0558c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於修所斷不共無明隨眠相應不善意識，有一結、一縛、一隨眠；若覺悟位，五隨煩惱纏當言相應；若睡眠位，增第六眠。",
        "translation": "In the unwholesome mental consciousness associated with the latent tendencies of ignorance that are cultivated and eliminated, there's one bond, one fetter, and one latent tendency; if one is at the stage of awakening, the five binding tendencies of affliction should be said to correspond, and if one is at the stage of drowsiness, the sixth latency should be added.",
        "source": "T26n1539_005:0558c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於有覆無記意識，有六結、六縛、六十五隨眠、六十八隨煩惱纏當言相應。",
        "translation": "In the covered indeterminate consciousness, there are six bonds, six fetters, 65 latent afflictive tendencies, and 68 latent afflictive tendencies that should be described as associated.",
        "source": "T26n1539_005:0558c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一心耶？",
        "translation": "What's one mind?",
        "source": "T26n1539_005:0558c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：不爾。",
        "translation": "He said, \"No.",
        "source": "T26n1539_005:0558c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於欲界繫薩迦耶見相應有覆無記意識，有二結、二縛、二隨眠；若覺悟位，四隨煩惱纏當言相應；若睡眠位，增第五眠。",
        "translation": "In the desire realm, the covered, indeterminate consciousness associated with the view of bound sākāya has two bonds, two fetters, and two latencies; if one is in the stage of awakening, the four binding afflictions will be said to be associated with it; if one is in the stage of drowsiness, the fifth latency will be added.",
        "source": "T26n1539_005:0558c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如欲界繫薩迦耶見相應有覆無記意識，邊執見相應有覆無記意識亦爾。",
        "translation": "If a fettered view of identity in the desire realm corresponds to a covering indeterminate consciousness, so does a fettered view of extreme attachment correspond to a covering indeterminate consciousness.",
        "source": "T26n1539_005:0558c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫薩迦耶見隨眠相應有覆無記意識，有二結、二縛、二隨眠、四隨煩惱纏，當言相應。",
        "translation": "In the form realm, the covered indeterminate consciousness associated with the view of bound saṃkāya and subsequent dormancy has two bonds, two fetters, two latent afflictive tendencies, and four derivative afflictive tendencies, which should be described as concomitant.",
        "source": "T26n1539_005:0558c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色界繫薩迦耶見隨眠相應有覆無記意識，邊執見見苦所斷邪見、見取、戒禁取、疑、貪、慢隨眠相應有覆無記意識亦爾。",
        "translation": "As the covering indeterminate consciousness associated with the view of affliction and subsequent dormancy in the form realm, so does the covering indeterminate consciousness associated with the view of suffering that's eliminated by extreme attachment, mistaken views, adherence to views, adherence to precepts, and the followings of doubt, greed, and conceit.",
        "source": "T26n1539_005:0558c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見苦所斷不共無明隨眠相應有覆無記意識，有一結、一縛、一隨眠、三隨煩惱纏，當言相應。",
        "translation": "In the form realm, the covering indeterminate consciousness associated with the latent dormancy of unshared ignorance that's eliminated by the fetters of form, there's a bond, a fetter, a latent dormancy, and three binding afflictions, which should be described as associated.",
        "source": "T26n1539_005:0558c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見集所斷邪見隨眠相應有覆無記意識，有二結、二縛、二隨眠、四隨煩惱纏，當言相應。",
        "translation": "The indeterminate consciousness that concomitantly covers the latent tendencies of mistaken views that are eliminated by the fetters of the form realm and has two bonds, two fetters, two latencies, and four afflictive tendencies should be described as concomitant.",
        "source": "T26n1539_005:0558c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色界繫見集所斷邪見隨眠相應有覆無記意識，見取、疑、貪、慢隨眠相應有覆無記意識亦爾。",
        "translation": "As the obscuring indeterminate consciousness associated with mistaken views and latencies that are eliminated in the form realm, so is the obscuring indeterminate consciousness associated with latencies that are attached to views, doubt, greed, and conceit.",
        "source": "T26n1539_005:0558c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見集所斷不共無明隨眠相應有覆無記意識，有一結、一縛、一隨眠、三隨煩惱纏，當言相應。",
        "translation": "If the indeterminate nescience that's eliminated by the collection of views in the form realm is associated with a covering indeterminate consciousness that has one bond, one fetter, one latent tendency, and three derivative afflictive tendencies, it should be said to be associated with that.",
        "source": "T26n1539_005:0558c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見滅所斷邪見隨眠相應有覆無記意識，有二結、二縛、二隨眠、四隨煩惱纏，當言相應。",
        "translation": "The indeterminate consciousness that concomitantly covers the latent tendencies of mistaken views that are eliminated by the fetters of the form realm and has two bonds, two fetters, two latencies, and four afflictive tendencies should be described as concomitant.",
        "source": "T26n1539_005:0558c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色界繫見滅所斷邪見隨眠相應有覆無記意識，見取、疑、貪、慢隨眠相應有覆無記意識亦爾。",
        "translation": "If the mistaken views and latencies that are stopped by the fetters of the form realm are associated with a covering, indeterminate consciousness, so are the covering, indeterminate consciousnesses associated with latencies that are attached to views, doubt, greed, and conceit.",
        "source": "T26n1539_005:0558c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見滅所斷不共無明隨眠相應有覆無記意識，有一結、一縛、一隨眠、三隨煩惱纏，當言相應。",
        "translation": "If there's a covering indeterminate consciousness associated with the latent tendencies of unshared ignorance that are ended by the fetters of the form realm, there's a bond, a fetter, a latent tendency, and three binding afflictions, which should be described as concomitant.",
        "source": "T26n1539_005:0559a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見道所斷邪見隨眠相應有覆無記意識，有二結、二縛、二隨眠、四隨煩惱纏，當言相應。",
        "translation": "The indeterminate consciousness that concomitantly covers the latent tendencies of mistaken views that are eliminated in the form realm and are tethered by two bonds, two fetters, two latencies, and four afflictive tendencies should be described as concomitant with this.",
        "source": "T26n1539_005:0559a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色界繫見道所斷邪見隨眠相應有覆無記意識，見取、戒禁取、疑、貪、慢隨眠相應有覆無記意識亦爾。",
        "translation": "As the obscuring indeterminate consciousness associated with mistaken views and latent dormancy that are stopped in the form realm, so is the obscuring indeterminate consciousness associated with attachment to views, attachment to precepts, doubt, greed, and latent dormancy that are concomitant with conceit.",
        "source": "T26n1539_005:0559a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫見道所斷不共無明隨眠相應有覆無記意識，有一結、一縛、一隨眠、三隨煩惱纏，當言相應。",
        "translation": "The obscuring indeterminate consciousness associated with the latent dormancy of uncommon ignorance that's eliminated in the form realm fetters, which has one bond, one fetter, one latent, and three derivative afflictive tendencies, should be described as associated.",
        "source": "T26n1539_005:0559a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫修所斷貪隨眠相應有覆無記意識，有二結、二縛、二隨眠、四隨煩惱纏，當言相應。",
        "translation": "The indeterminate consciousness that concomitantly covers the latent tendencies of craving and drowsiness that are ended in the form realm should be described as corresponding to two bonds, two fetters, two latent tendencies, and four afflictive tendencies.",
        "source": "T26n1539_005:0559a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色界繫修所斷貪隨眠相應有覆無記意識，慢隨眠相應有覆無記意識亦爾。",
        "translation": "As the obscuring indeterminate consciousness associated with craving and latencies that are fettered and cultivated in the form realm, so is the obscuring indeterminate consciousness associated with conceit and latencies.",
        "source": "T26n1539_005:0559a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色界繫修所斷不共無明隨眠相應有覆無記意識，有一結、一縛、一隨眠、三隨煩惱纏，當言相應。",
        "translation": "In the form realm, the covering indeterminate consciousness associated with the latent dormancy of uncommon ignorance that's fettered by cultivation has one bond, one fetter, one latent dormancy, and three binding afflictions, which should be described as concomitant.",
        "source": "T26n1539_005:0559a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如色界繫有覆無記意識，無色界繫有覆無記意識亦爾。",
        "translation": "As the form realm is fettered with a covering, indeterminate consciousness, so is the formless realm fettered with a covering, indeterminate consciousness.",
        "source": "T26n1539_005:0559a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無覆無記意識，一切結、縛、隨眠、隨煩惱、纏，當言皆不相應。",
        "translation": "In the unobstructed indeterminate consciousness, all the bonds, fetters, latent dormancies, derivative afflictions, and entanglements should be said to be nonassociative.",
        "source": "T26n1539_005:0559a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一切有部識身足論卷第五",
        "translation": "Saṃyuktâgama-saṃbodhisattva-vibhāga-śāstra, vol. 5",
        "source": "T26n1539_005:0559a21_0",
        "is_bad_quality": false
    }
]