[
    {
        "source_sentence": "阿毘達磨識身足論卷第九",
        "translation": "Abhidharma Consciousness Body and Legs Treatise, Volume 9",
        "source": "T26n1539_009:0572b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆設摩阿羅漢造",
        "translation": "created by the Devakṣema arhat",
        "source": "T26n1539_009:0572b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T26n1539_009:0572b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣緣蘊第四之四",
        "translation": "Fourth Fourth of the Aggregates as Condition",
        "source": "T26n1539_009:0572b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有十種心，謂欲界繫善心，不善心，有覆無記心，無覆無記心，色界繫善心、有覆無記心、無覆無記心，無色界繫善心、有覆無記心、無覆無記心。",
        "translation": "There are ten kinds of mind, which are mind tied to goodness, unwholesomeness, covered indeterminate mind, and uncovered indeterminate mind in the desire realm, mind tied to goodness, covered indeterminate mind, and uncovered indeterminate mind in the form realm, and mind tied to goodness, covered indeterminate mind, and uncovered indeterminate mind in the formless realm.",
        "source": "T26n1539_009:0572b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫善心，若體已斷，所緣已斷耶？",
        "translation": "If the mind that's tethered to goodness in the desire realm has been stopped in essence, have the perceptual objects been stopped?",
        "source": "T26n1539_009:0572b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose the perceptual object has been eliminated and its essence has been eliminated?",
        "source": "T26n1539_009:0572b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至諸無色界繫無覆無記心，若體已斷，所緣已斷耶？",
        "translation": "What if the tethers in the formless realm are uncovered and indeterminate, and the perceptual objects have been eliminated?",
        "source": "T26n1539_009:0572b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose the perceptual object has been eliminated and its essence has been eliminated?",
        "source": "T26n1539_009:0572c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫善心，若體已斷，所緣已斷耶？",
        "translation": "\"Are the mental states bound to goodness in the desire realm that have been eliminated in essence and whose perceptual objects have been eliminated?",
        "source": "T26n1539_009:0572c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷所緣已斷，或體已斷所緣未斷，或體已斷所緣已斷及所緣未斷，或體已斷不可分別此心所緣已斷未斷。",
        "translation": "Either the body has been stopped and the perceptual objects have been stopped, or the body has been stopped and the perceptual objects have not been stopped, or the body has been stopped and the perceptual objects have been stopped and the perceptual objects have not been stopped, or the body has been stopped and it's not possible to discern which perceptual objects have been stopped and which have not been stopped in this mind.",
        "source": "T26n1539_009:0572c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷者，謂已離欲界貪，未離色界貪，諸欲界繫善心，緣欲界繫。",
        "translation": "Those whose bodies have been stopped and whose perceptual objects have been stopped mean that they have parted with desire realm greed and haven't parted with form realm greed, and they are mindful of the good tethers of the desire realm and the tethers of the desire realm.",
        "source": "T26n1539_009:0572c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸欲界繫善心，緣欲界繫、緣色界繫、緣欲界繫色界繫。",
        "translation": "They've parted with greed in the form realm and haven't parted with greed in the formless realm, and their mind is tied to the ties of the desire realm, the ties of the form realm, and the ties of the form realm that are contingent on the desire realm.",
        "source": "T26n1539_009:0572c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸欲界繫善心，緣欲界繫、緣色界繫、緣無色界繫、緣欲界繫色界繫、緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Having parted with desire for the formless realm, their mind is conditioned by good ties to the desire realm, conditioned by ties to the form realm, conditioned by ties to the form realm, conditioned by ties to the desire realm, conditioned by ties to the form realm, conditioned by ties to the form realm, and conditioned by ties to the form realm.",
        "source": "T26n1539_009:0572c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷。",
        "translation": "This is called having ended the body and having ended the perceptual objects.",
        "source": "T26n1539_009:0572c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣未斷者，謂已離欲界貪，未離色界貪，苦類智未生，諸欲界繫善心，緣色界繫、緣無色界繫、緣色界繫無色界繫。",
        "translation": "Those whose bodies have been stopped and whose conditions have not been stopped mean that they've parted with desire realm greed, haven't parted with form realm greed, and knowledge of the types of suffering that have yet to arise, and they're good mental states that are tied to the desire realm, conditioned by the ties to the form realm, conditioned by the ties to the form realm, and conditioned by the ties to the form realm and the ties to the formless realm.",
        "source": "T26n1539_009:0572c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，苦類智未生，諸欲界繫善心，緣無色界繫。",
        "translation": "Those who have parted with greed in the form realm and whose knowledge of the types of suffering has yet to arise have good thoughts that are tied to the desire realm and conditioned to the ties of the formless realm.",
        "source": "T26n1539_009:0572c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣未斷。",
        "translation": "This is called a mind whose body has been stopped and whose perceptual objects have yet to be stopped.",
        "source": "T26n1539_009:0572c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷及所緣未斷者，謂已離欲界貪，未離色界貪，諸欲界繫善心，緣欲界繫色界繫、緣欲界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Those whose bodies have been stopped, whose conditions have been stopped, and whose conditions have not been stopped mean that they have parted with desire realm greed, haven't parted with form realm greed, and have good minds that are tied to the desire realm that are tied to the form realm, tied to the desire realm that are tied to the form realm, and tied to the desire realm that are tied to the form realm that are tied to the form realm.",
        "source": "T26n1539_009:0572c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸欲界繫善心，緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Good minds that have parted with greed in the form realm and haven't parted with greed in the formless realm, which are bound to the desire realm, bound to the form realm, which is bound to the form realm, and bound to the form realm, which is bound to the formless realm, are conditioned by the desire realm.",
        "source": "T26n1539_009:0572c22_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷及所緣未斷。",
        "translation": "This is called a mind whose essence has been stopped, whose perceptual objects have been stopped, and whose perceptual objects have yet to be stopped.",
        "source": "T26n1539_009:0572c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷不可分別此心所緣已斷未斷者，謂已離欲界貪，未離色界貪，諸欲界繫善心，緣非所斷。",
        "translation": "Those whose bodies have been stopped cannot discern which mental objects have been stopped and which are not stopped, meaning that they have parted with desire realm greed, haven't parted with form realm greed, and are good mental states that are tied to the desire realm, and their conditions are not stopped.",
        "source": "T26n1539_009:0572c25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸欲界繫善心，緣非所斷。",
        "translation": "They've parted with desire in the form realm and haven't parted with desire in the formless realm, and the mental states that are tethers to goodness in the desire realm have conditions that aren't cut off.",
        "source": "T26n1539_009:0572c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸欲界繫善心，緣非所斷。",
        "translation": "Having parted with desire in the formless realm, the mental states that are tied to goodness in the desire realm have conditions that aren't cut off.",
        "source": "T26n1539_009:0572c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷不可分別此心所緣已斷未斷。",
        "translation": "This is called a mind whose essence has been stopped and can't discriminate between a mind whose perceptual objects have been stopped and those that haven't been stopped.",
        "source": "T26n1539_009:0573a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose the perceptual objects have been stopped, and their essence has been stopped?",
        "source": "T26n1539_009:0573a02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷其體已斷，或所緣已斷其體未斷，或所緣已斷及所緣未斷其體已斷，或所緣已斷及所緣未斷其體未斷。",
        "translation": "Either their bodies have been stopped after the perceptual objects have been stopped, their bodies have been stopped after the perceptual objects have been stopped but not yet stopped, their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not yet been stopped, or their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not yet been stopped.",
        "source": "T26n1539_009:0573a02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體已斷者，謂已離欲界貪，未離色界貪，諸欲界繫善心，緣欲界繫。",
        "translation": "Those whose cognition has been stopped and whose body has been stopped mean they've parted with desire realm greed and haven't parted with form realm greed, and their minds are conditioned by the goodness of their desire realm bonds.",
        "source": "T26n1539_009:0573a05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸欲界繫善心，緣欲界繫、緣色界繫、緣欲界繫色界繫。",
        "translation": "They've parted with greed in the form realm and haven't parted with greed in the formless realm, and their mind is tied to the ties of the desire realm, the ties of the form realm, and the ties of the form realm that are contingent on the desire realm.",
        "source": "T26n1539_009:0573a07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸欲界繫善心，緣欲界繫、緣色界繫、緣無色界繫、緣欲界繫色界繫、緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Having parted with desire for the formless realm, their mind is conditioned by good ties to the desire realm, conditioned by ties to the form realm, conditioned by ties to the form realm, conditioned by ties to the desire realm, conditioned by ties to the form realm, conditioned by ties to the form realm, and conditioned by ties to the form realm.",
        "source": "T26n1539_009:0573a08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體已斷。",
        "translation": "This is called having ended the perceptual object and having ended its body.",
        "source": "T26n1539_009:0573a12_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體未斷者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫善心，緣見苦所斷。",
        "translation": "Those whose objects have been stopped and whose bodies have not been stopped mean that they haven't yet parted with desire, knowledge of suffering has arisen and knowledge of the arising of suffering has yet to arise, and the mind that's tied to the desire realm is good, depending on the view that suffering is stopped.",
        "source": "T26n1539_009:0573a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸欲界繫善心，緣見苦集所斷。",
        "translation": "Once knowledge of suffering has arisen and knowledge of cessation has yet to arise, the condition of seeing what's stopped by suffering and accumulation is that the mental states that are tied to the desire realm are good.",
        "source": "T26n1539_009:0573a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸欲界繫善心，緣見苦集滅所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the desire realm binds good minds, which are conditioned to see what's stopped by suffering's accumulation ...",
        "source": "T26n1539_009:0573a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫善心，緣見所斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān has yet to part with desire, his mind is tethered to goodness in the desire realm, which is the condition for seeing what's stopped.",
        "source": "T26n1539_009:0573a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體未斷。",
        "translation": "This is called having ended the perceptual objects and not yet ending their essence.",
        "source": "T26n1539_009:0573a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體已斷者，謂已離欲界貪，未離色界貪，諸欲界繫善心，緣欲界繫色界繫、緣欲界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Those whose perceptual objects have been stopped and whose perceptual objects have not been stopped and whose bodies have been stopped mean that they have parted with desire realm greed and haven't parted with form realm greed, and their mind is good in terms of their ties to the desire realm and ties to the form realm, their ties to the desire realm and ties to the form realm, and their ties to the desire realm and ties to the form realm.",
        "source": "T26n1539_009:0573a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸欲界繫善心，緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Good minds that have parted with greed in the form realm and haven't parted with greed in the formless realm are conditioned by the desire realm that's bound to the form realm, conditioned by the form realm that's bound to the form realm, and conditioned by the desire realm that's bound to the formless realm.",
        "source": "T26n1539_009:0573a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended the perceptual objects but not yet ended their bodies.",
        "source": "T26n1539_009:0573a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體未斷者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫善心，緣見苦集滅道及修所斷。",
        "translation": "Those whose perceptual objects have been stopped and whose perceptual objects have not yet been stopped and whose bodies have not yet been stopped are those who have yet to part with desire realm greed, whose knowledge of suffering has arisen and whose knowledge of accumulation has yet to arise, and whose good mind is conditioned by the desire realm's tethers to see the path to suffering, accumulation, cessation, and cultivation that are stopped.",
        "source": "T26n1539_009:0573a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸欲界繫善心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of accumulation has arisen and knowledge of cessation has yet to arise, the mental states that are tied to the desire realm are good, conditioned by the view of suffering, accumulation, cessation, the path, and what's cut off by cultivation.",
        "source": "T26n1539_009:0573a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸欲界繫善心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the mental states that are tied to the desire realm are good, depending on the view of the path to suffering's accumulation and cessation and the path to cultivation's cessation.",
        "source": "T26n1539_009:0573b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫善心，緣見修所斷。",
        "translation": "If they see that the perfect disciple of the Bhagavān has yet to part with desire, their mind is tethered to the desire realm, which is good, depending on the view of what's cultivated and stopped.",
        "source": "T26n1539_009:0573b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體未斷。",
        "translation": "These are called those whose perceptual objects have been stopped and those whose perceptual objects have yet to be stopped and whose bodies have yet to be stopped.",
        "source": "T26n1539_009:0573b04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸不善心，若體已斷，所緣已斷耶？",
        "translation": "If the essence of unwholesome thoughts has been stopped and the perceptual objects have been stopped, then what are the perceptual objects that have been stopped?",
        "source": "T26n1539_009:0573b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷所緣已斷，或體已斷所緣未斷，或體已斷所緣已斷及所緣未斷，或體已斷不可分別此心所緣已斷未斷。",
        "translation": "Either the essence has been stopped and the perceptual objects have been stopped, the essence has been stopped and the perceptual objects have not been stopped, the essence has been stopped and the perceptual objects have been stopped and the perceptual objects have not been stopped, or the essence has been stopped and the perceptual objects of this mind cannot be discerned as stopped or unstopped.",
        "source": "T26n1539_009:0573b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷者，謂未離欲界貪，苦智已生、集智未生，諸見苦所斷不善心，緣見苦所斷。",
        "translation": "Those whose bodies have been stopped and whose perceptual objects have been stopped mean that they haven't yet parted with desire, knowledge of suffering has arisen and knowledge of the arising of suffering has yet to arise, and the unwholesome minds that see what's stopped by suffering have perceptual objects stopped by suffering.",
        "source": "T26n1539_009:0573b08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸見苦集所斷不善心，緣見苦集所斷。",
        "translation": "When the knowledge of accumulation has arisen and the knowledge of cessation has yet to arise, those unwholesome minds that see what's stopped by suffering and accumulation are conditioned by seeing what's stopped by suffering.",
        "source": "T26n1539_009:0573b10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷不善心，緣見苦所斷。",
        "translation": "They are unwholesome in their views of what's stopped by suffering, depending on their views of what's stopped by suffering.",
        "source": "T26n1539_009:0573b11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷不善心，緣見集所斷。",
        "translation": "They see what's stopped by suffering and what's stopped by accumulation as a condition of seeing what's stopped by accumulation.",
        "source": "T26n1539_009:0573b12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸見苦集所斷不善心，緣見苦集滅所斷。",
        "translation": "Those who see what's stopped by suffering and what's stopped by the path after knowledge of cessation has arisen and knowledge of the path has yet to arise have unwholesome states of mind that are contingent on seeing what's stopped by suffering and by the cessation of suffering.",
        "source": "T26n1539_009:0573b13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷不善心，緣見苦所斷。",
        "translation": "They see what's stopped by suffering as unwholesome, depending on seeing what's stopped by suffering.",
        "source": "T26n1539_009:0573b14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷不善心，緣見集所斷。",
        "translation": "They see what's stopped by suffering and what's stopped by cessation, and it's a condition for seeing what's stopped by suffering.",
        "source": "T26n1539_009:0573b15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見滅所斷不善心，緣見滅所斷。",
        "translation": "He sees a mind that's unwholesome and which is stopped by cessation, and the condition is seeing what's stopped by cessation.",
        "source": "T26n1539_009:0573b16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸見所斷不善心，緣見所斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees something that's stopped and is unwholesome before he's free of desire, the condition is seeing what's stopped.",
        "source": "T26n1539_009:0573b16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離欲界貪，未離色界貪，諸不善心，緣欲界繫。",
        "translation": "They've parted with desire realm greed and haven't parted with form realm greed, and those unwholesome thoughts are conditioned by the tethers in the desire realm.",
        "source": "T26n1539_009:0573b18_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸不善心，緣欲界繫、緣色界繫。",
        "translation": "They've parted with greed in the form realm and haven't parted with greed in the formless realm, and their unwholesome thoughts are conditioned by the tethers of the desire realm and the tethers of the form realm.",
        "source": "T26n1539_009:0573b19_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸不善心，緣欲界繫、緣色界繫、緣無色界繫、緣色界繫無色界繫。",
        "translation": "Those who have parted with desire for the formless realm and are unwholesome will condition themselves to the tethers of the desire realm, the tethers of the form realm, the tethers of the formless realm, and the tethers of the form realm and the tethers of the formless realm.",
        "source": "T26n1539_009:0573b20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷。",
        "translation": "This is called having ended the body and having ended the perceptual objects.",
        "source": "T26n1539_009:0573b22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣未斷者，謂未離欲界貪，苦智已生、集智未生，諸見苦所斷不善心，緣見集滅道及修所斷。",
        "translation": "Those whose essences have been stopped and whose conditions have not been stopped mean that they haven't yet parted with desire, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the unwholesome thoughts that are stopped by seeing suffering are conditioned by seeing the path to accumulation and cessation and by cultivating what's stopped.",
        "source": "T26n1539_009:0573b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸見苦集所斷不善心，緣見滅道及修所斷。",
        "translation": "When knowledge of accumulation has arisen and knowledge of cessation has yet to arise, the views are unwholesome, which are cut off by suffering and accumulation, and the conditions are views of the path to cessation and the cultivation of what's cut off.",
        "source": "T26n1539_009:0573b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸見苦集所斷不善心，緣見道及修所斷。",
        "translation": "When knowledge of cessation has arisen and knowledge of the path has yet to arise, the views are not good that are cut off by suffering and accumulation, which are contingent on views of the path and what's cut off by cultivation.",
        "source": "T26n1539_009:0573b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸見所斷不善心，緣修所斷。",
        "translation": "If they see the perfect disciple of the Bhagavān, they haven't yet parted with desire for the desire realm, and they see what's stopped as unwholesome, depending on what's stopped by cultivation.",
        "source": "T26n1539_009:0573b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離欲界貪，未離色界貪，苦類智未生，諸不善心，緣色界繫、緣無色界繫、緣色界繫無色界繫。",
        "translation": "They've parted with desire realm greed, haven't parted with form realm greed, and knowledge of the types of suffering that have yet to arise, and those unwholesome mental states are conditioned by the fetters of the form realm, conditioned by the fetters of the form realm, and conditioned by the fetters of the form realm and the formless realm.",
        "source": "T26n1539_009:0573b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，苦類智未生，諸不善心，緣無色界繫。",
        "translation": "Those who have parted with desire in the form realm and haven't yet developed knowledge of the types of suffering have unwholesome states of mind that are conditioned by the fetters of the formless realm.",
        "source": "T26n1539_009:0573c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣未斷。",
        "translation": "This is called having ended the body and having perceived the perceptual objects that have yet to be ended.",
        "source": "T26n1539_009:0573c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷及所緣未斷者，謂未離欲界貪，苦智已生、集智未生，諸見苦所斷不善心，緣見苦集滅道及修所斷。",
        "translation": "Those whose essence has been stopped, whose conditions have been stopped, and whose conditions have not been stopped mean that they haven't yet parted with desire realm greed, knowledge of suffering has arisen and knowledge of arising has yet to arise, and their unwholesome thoughts that are stopped by seeing suffering are conditioned by seeing the path to suffering's accumulation and cessation and by cultivating what's stopped.",
        "source": "T26n1539_009:0573c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸見苦集所斷不善心，緣見苦集滅道及修所斷。",
        "translation": "When knowledge of accumulation has arisen and knowledge of cessation has yet to arise, those unwholesome states of mind that see what is cut off by suffering and accumulation are conditioned by views of the path to suffering's accumulation and cessation and by cultivation's cutting off.",
        "source": "T26n1539_009:0573c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸見苦集所斷不善心，緣見苦集滅道及修所斷。",
        "translation": "After knowledge of cessation arises and knowledge of the path yet to arise, those who see what's stopped by suffering and accumulation as unwholesome have the condition of seeing what's stopped by suffering, accumulation, the path of cessation, and cultivation.",
        "source": "T26n1539_009:0573c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸見所斷不善心，緣見修所斷。",
        "translation": "If they see a disciple of the Bhagavān who's perfected, hasn't yet parted with desire realm greed, they see what's stopped as unwholesome, and they condition themselves to see what's stopped by cultivation.",
        "source": "T26n1539_009:0573c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸不善心，緣色界繫無色界繫。",
        "translation": "They've parted with desire in the form realm but haven't parted with desire in the formless realm, and their unwholesome thoughts are conditioned by the fetters of the form realm and the fetters of the formless realm.",
        "source": "T26n1539_009:0573c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷及所緣未斷。",
        "translation": "This is called a mind whose essence has been stopped, whose perceptual objects have been stopped, and whose perceptual objects have not yet been stopped.",
        "source": "T26n1539_009:0573c13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷不可分別此心所緣已斷未斷者，謂未離欲界貪，滅智已生、道智未生，諸見滅所斷不善心，緣非所斷。",
        "translation": "Those whose bodies have been stopped cannot discern which mental conditions have been stopped and which haven't been stopped, meaning they haven't parted with desire realm greed, knowledge of cessation has arisen and knowledge of the path has yet to arise, and the unwholesome mind whose views have been stopped by cessation has conditions that have not been stopped.",
        "source": "T26n1539_009:0573c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸見所斷不善心，緣非所斷。",
        "translation": "If a disciple of the Bhagavān sees that he's perfect, he's not free of desire, and the unwholesome mental states that are stopped by those views are not stopped by those conditions.",
        "source": "T26n1539_009:0573c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離欲界貪，未離色界貪，諸不善心，緣非所斷。",
        "translation": "They've parted with desire realm greed and haven't parted with form realm greed, and those unwholesome thoughts are not stopped by the conditions.",
        "source": "T26n1539_009:0573c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸不善心，緣非所斷。",
        "translation": "They've parted with desire in the form realm and haven't parted with desire in the formless realm, and their unwholesome thoughts are conditioned by what's not cut off.",
        "source": "T26n1539_009:0573c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸不善心，緣非所斷。",
        "translation": "Having parted with desire in the formless realm, these unwholesome mental states have conditions that are not cut off.",
        "source": "T26n1539_009:0573c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷不可分別此心所緣已斷未斷。",
        "translation": "This is called a mind whose essence has been stopped, and it's not possible to discern which of the mind's perceptual objects have been stopped and which haven't been stopped.",
        "source": "T26n1539_009:0573c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose the perceptual objects have been stopped, and their essence has been stopped?",
        "source": "T26n1539_009:0573c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷其體已斷，或所緣已斷其體未斷，或所緣已斷及所緣未斷其體已斷，或所緣已斷及所緣未斷其體未斷。",
        "translation": "Either their bodies have been stopped after the perceptual objects have been stopped, their bodies have been stopped after the perceptual objects have been stopped but not yet stopped, their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not yet been stopped, or their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not yet been stopped.",
        "source": "T26n1539_009:0573c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體已斷者，謂未離欲界貪，苦智已生、集智未生，諸見苦所斷不善心，緣見苦所斷。",
        "translation": "Those whose objects have been stopped and whose bodies have been stopped mean that they haven't yet parted with desire, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the unwholesome minds that see what's stopped by suffering are contingent on seeing what's stopped by suffering.",
        "source": "T26n1539_009:0573c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸見苦集所斷不善心，緣見苦集所斷。",
        "translation": "When the knowledge of accumulation has arisen and the knowledge of cessation has yet to arise, those unwholesome minds that see what's stopped by suffering and accumulation are conditioned by seeing what's stopped by suffering.",
        "source": "T26n1539_009:0573c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷不善心，緣見苦所斷。",
        "translation": "They are unwholesome in their views of what's stopped by suffering, depending on their views of what's stopped by suffering.",
        "source": "T26n1539_009:0573c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷不善心，緣見集所斷。",
        "translation": "They see what's stopped by suffering and what's stopped by accumulation as a condition of seeing what's stopped by accumulation.",
        "source": "T26n1539_009:0573c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸見苦集所斷不善心，緣見苦集滅所斷。",
        "translation": "Those who see what's stopped by suffering and what's stopped by the path after knowledge of cessation has arisen and knowledge of the path has yet to arise have unwholesome states of mind that are contingent on seeing what's stopped by suffering and by the cessation of suffering.",
        "source": "T26n1539_009:0574a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷不善心，緣見苦所斷。",
        "translation": "They see what's stopped by suffering as unwholesome, depending on seeing what's stopped by suffering.",
        "source": "T26n1539_009:0574a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷不善心，緣見集所斷。",
        "translation": "They see what's stopped by suffering and what's stopped by cessation, and it's a condition for seeing what's stopped by suffering.",
        "source": "T26n1539_009:0574a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見滅所斷不善心，緣見滅所斷。",
        "translation": "He sees a mind that's unwholesome and which is stopped by cessation, and the condition is seeing what's stopped by cessation.",
        "source": "T26n1539_009:0574a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸見所斷不善心，緣見所斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees something that's stopped and is unwholesome before he's free of desire, the condition is seeing what's stopped.",
        "source": "T26n1539_009:0574a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離欲界貪，未離色界貪，諸不善心，緣欲界繫。",
        "translation": "They've parted with desire realm greed and haven't parted with form realm greed, and those unwholesome thoughts are conditioned by the tethers in the desire realm.",
        "source": "T26n1539_009:0574a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸不善心，緣欲界繫、緣色界繫。",
        "translation": "They've parted with greed in the form realm and haven't parted with greed in the formless realm, and their unwholesome thoughts are conditioned by the tethers of the desire realm and the tethers of the form realm.",
        "source": "T26n1539_009:0574a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸不善心，緣欲界繫、緣色界繫、緣無色界繫、緣色界繫無色界繫。",
        "translation": "Those unwholesome minds that have parted with desire for the formless realm and are free of desire for the form realm are conditioned by the fetters of the desire realm, the fetters of the form realm, the fetters of the formless realm, and the fetters of the form realm and the formless realm.",
        "source": "T26n1539_009:0574a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended their bodies.",
        "source": "T26n1539_009:0574a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體未斷者，謂未離欲界貪，苦智已生、集智未生，諸見集所斷不善心，緣見苦所斷。",
        "translation": "Those whose bodies have been stopped and whose objects have not been stopped mean that they haven't yet parted with desire, knowledge of suffering has arisen and knowledge of the arising of suffering has yet to arise, and the unwholesome minds that see what's stopped by the arising of suffering are conditioned by seeing what's stopped by suffering.",
        "source": "T26n1539_009:0574a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體未斷。",
        "translation": "This is called a condition that has been stopped and whose essence has yet to be stopped.",
        "source": "T26n1539_009:0574a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體已斷者，謂未離欲界貪，苦智已生、集智未生，諸見苦所斷不善心，緣見苦集滅道及修所斷。",
        "translation": "Those whose objects have been stopped and whose bodies have been stopped before the objects are stopped mean that they haven't yet parted with desire, knowledge of suffering has arisen and knowledge of the arising of suffering has yet to arise, and the unwholesome minds that see what's stopped by suffering are conditioned to see what's stopped by the path to suffering's accumulation and cessation and what's stopped by cultivation.",
        "source": "T26n1539_009:0574a13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸見苦集所斷不善心，緣見苦集滅道及修所斷。",
        "translation": "After the knowledge of accumulation has arisen and the knowledge of cessation has yet to arise, those unwholesome states of mind that see what is cut by suffering and accumulation are conditioned by the views of the path to suffering's accumulation and cessation and the path to cultivation's cessation.",
        "source": "T26n1539_009:0574a16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸見苦集所斷不善心，緣見苦集滅道及修所斷。",
        "translation": "After knowledge of cessation arises and knowledge of the path yet to arise, those who see what's stopped by suffering and accumulation as unwholesome have the condition of seeing what's stopped by suffering, accumulation, the path of cessation, and cultivation.",
        "source": "T26n1539_009:0574a18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸見所斷不善心，緣見修所斷。",
        "translation": "If they see a disciple of the Bhagavān who's perfected, hasn't yet parted with desire realm greed, they see what's stopped as unwholesome, and they condition themselves to see what's stopped by cultivation.",
        "source": "T26n1539_009:0574a19_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸不善心，緣色界繫無色界繫。",
        "translation": "They've parted with desire in the form realm, haven't parted with desire in the formless realm, and have unwholesome states of mind that are contingent on the fetters of the form realm and the fetters of the formless realm.",
        "source": "T26n1539_009:0574a21_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended the perceptual objects that have yet to be ended, and their bodies have been ended.",
        "source": "T26n1539_009:0574a22_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體未斷者，謂未離欲界貪，苦智已生、集智未生，諸見集所斷不善心，緣見苦集滅道及修所斷。",
        "translation": "Those whose perceptual objects have been stopped and whose perceptual objects have not yet been stopped and whose bodies have not yet been stopped are those who have yet to part with desire realm greed, whose knowledge of suffering has arisen and whose knowledge of the arising of suffering has yet to arise, and whose unwholesome minds are conditioned by views of the arising of suffering, the path to cessation, and the cultivation of what's stopped.",
        "source": "T26n1539_009:0574a23_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體未斷。",
        "translation": "This is called a condition that has been stopped and a condition that has yet to be stopped whose essence has yet to be stopped.",
        "source": "T26n1539_009:0574a26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫有覆無記心，若體已斷，所緣已斷耶？",
        "translation": "If the obscured and indeterminate mind that's tied to the desire realm has been stopped in essence, have the perceptual objects been stopped?",
        "source": "T26n1539_009:0574a27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷所緣已斷，或體已斷所緣未斷，或體已斷所緣已斷及所緣未斷。",
        "translation": "Either the body has been stopped and the perceptual objects have been stopped, the body has been stopped and the perceptual objects have not been stopped, or the body has been stopped and the perceptual objects have been stopped and the perceptual objects have not been stopped.",
        "source": "T26n1539_009:0574a28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫有覆無記心，緣見苦所斷。",
        "translation": "Those whose bodies have been stopped and whose perceptual objects have been stopped mean that they haven't yet parted with desire, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the mind is tied to the desire realm that's covered and indeterminate, depending on the view that suffering has been stopped.",
        "source": "T26n1539_009:0574b01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸欲界繫有覆無記心，緣見苦集所斷。",
        "translation": "Once knowledge of the arising of suffering and knowledge of cessation have arisen, the mental states of the desire realm that are tied up with obscurations and indeterminacy are conditioned by the view that suffering is stopped by the arising of suffering.",
        "source": "T26n1539_009:0574b04_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸欲界繫有覆無記心，緣見苦集滅所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the desire realm is fettered with obscured indeterminate states of mind, which are conditioned by seeing what's stopped by suffering accumulation ...",
        "source": "T26n1539_009:0574b05_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫有覆無記心，緣見所斷。",
        "translation": "If a disciple of the perfect Bhagavān sees that he's not free of desire, the desire realm is fettered with obscuring indeterminate states of mind, which are the condition for seeing what's stopped.",
        "source": "T26n1539_009:0574b06_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離欲界貪，未離色界貪，諸欲界繫有覆無記心，緣欲界繫。",
        "translation": "He has parted with desire realm greed and hasn't parted with form realm greed, and his mind is obscured and indeterminate by the bonds of the desire realm, depending on the bonds of the desire realm.",
        "source": "T26n1539_009:0574b08_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸欲界繫有覆無記心，緣欲界繫。",
        "translation": "Having parted with greed in the form realm and not yet parted with greed in the formless realm, the mind is obscured and indeterminate by the bonds of desire, depending on the bonds of the desire realm.",
        "source": "T26n1539_009:0574b09_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸欲界繫有覆無記心，緣欲界繫。",
        "translation": "Having parted with desire for the formless realm, their fetters of desire are covered and indeterminate, depending on their fetters of the desire realm.",
        "source": "T26n1539_009:0574b11_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷。",
        "translation": "This is called having ended the body and having ended the perceptual objects.",
        "source": "T26n1539_009:0574b12_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣未斷者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫有覆無記心，緣見集滅道及修所斷。",
        "translation": "Those whose essence has been stopped and whose conditions have not been stopped mean that they haven't yet parted with desire realm greed, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the tethers of the desire realm are covered and indeterminate in their mind, depending on the path to seeing arising and cessation and the cultivation of what's stopped.",
        "source": "T26n1539_009:0574b12_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸欲界繫有覆無記心，緣見滅道及修所斷。",
        "translation": "Once knowledge of accumulation has arisen and knowledge of cessation has yet to arise, the mental states of the desire realm that are fetters of obscuration and indeterminacy have the condition of seeing the path to cessation and the cultivation that is cut off.",
        "source": "T26n1539_009:0574b15_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸欲界繫有覆無記心，緣見道及修所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the desire realm is fettered with obscuring indeterminate states of mind, which are the condition for seeing the path and what's cut off by cultivation.",
        "source": "T26n1539_009:0574b16_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫有覆無記心，緣修所斷。",
        "translation": "If a disciple of the Bhagavān sees the consummation, he hasn't yet parted with desire, and his obscured and indeterminate mind is tied to the desire realm, which is the condition for stopping what's cultivated.",
        "source": "T26n1539_009:0574b18_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣未斷。",
        "translation": "This is called a mind whose essence has been stopped and whose perceptual objects have not yet been stopped.",
        "source": "T26n1539_009:0574b19_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷及所緣未斷者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Those whose essence has been stopped, whose conditions have been stopped, and whose conditions have not been stopped mean they haven't yet parted with desire, whose knowledge of suffering has arisen and whose knowledge of arising has yet to arise, whose tethers to the desire realm are obscured and indeterminate, and whose condition is seeing the path to suffering, arising, and cessation and cultivation that are stopped.",
        "source": "T26n1539_009:0574b20_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸欲界繫有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of accumulation has arisen and knowledge of cessation has yet to arise, the mental states of the desire realm that are fetters of obscuration and indeterminacy are conditioned by the views of suffering, accumulation, cessation, the path, and what's cut off by cultivation.",
        "source": "T26n1539_009:0574b22_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸欲界繫有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the desire realm is fettered with obscured indeterminate states of mind, which are the condition for seeing the path to suffering's accumulation and cessation and the path to cultivation's cessation.",
        "source": "T26n1539_009:0574b24_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫有覆無記心，緣修所斷。",
        "translation": "If he sees that the perfect disciple of the Bhagavān has yet to part with desire, his covered and indeterminate mind is tied to the desire realm, which is the condition for stopping what's cultivated.",
        "source": "T26n1539_009:0574b26_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷及所緣未斷。",
        "translation": "This is called having ended the body, having ended the perceptual objects, and having ended the perceptual objects that have yet to be ended.",
        "source": "T26n1539_009:0574b27_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose someone has stopped the perceptual objects and their body has been stopped?",
        "source": "T26n1539_009:0574b28_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_009:0574c01_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸欲界繫無覆無記心，若體已斷，所緣已斷耶？",
        "translation": "If the mind tethered to the desire realm and without obstructions or indeterminate states of mind has been stopped, has the perceptual object been stopped?",
        "source": "T26n1539_009:0574c01_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_009:0574c02_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose the perceptual object has been eliminated and its body has been eliminated?",
        "source": "T26n1539_009:0574c02_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷其體已斷，或所緣已斷其體未斷，或所緣已斷及所緣未斷其體未斷。",
        "translation": "Either their bodies have been stopped after the perceptual objects have been stopped, or their bodies have been stopped after the perceptual objects have been stopped but not yet stopped, or their bodies have been stopped after the perceptual objects have been stopped and before the perceptual objects have been stopped.",
        "source": "T26n1539_009:0574c03_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體已斷者，謂已離欲界貪，未離色界貪，諸欲界繫無覆無記心，緣欲界繫。",
        "translation": "Those whose perceptual objects have been stopped and whose bodies have been stopped mean that they have parted with desire realm greed and haven't parted with form realm greed, and the unobstructed, indeterminate mind that's tied to the desire realm is tied to the desire realm.",
        "source": "T26n1539_009:0574c05_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸欲界繫無覆無記心，緣欲界繫。",
        "translation": "Those who have parted with greed in the form realm and haven't parted with greed in the formless realm, and whose minds are tied to the desire realm without obscurations or indeterminacy, are conditioned by the ties to the desire realm.",
        "source": "T26n1539_009:0574c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸欲界繫無覆無記心，緣欲界繫。",
        "translation": "They've parted with desire for the formless realm and haven't parted with desire for the formless realm, and the mind is conditioned by the ties to the desire realm that are uncovered and indeterminate.",
        "source": "T26n1539_009:0574c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended their bodies.",
        "source": "T26n1539_009:0574c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體未斷者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫無覆無記心，緣見苦所斷。",
        "translation": "Those whose objects have been stopped and whose bodies have not been stopped mean that they haven't yet parted with desire realm greed, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the tethers of the desire realm are conditioned by the indeterminate and indeterminate mind that sees what's stopped by suffering.",
        "source": "T26n1539_009:0574c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸欲界繫無覆無記心，緣見苦集所斷。",
        "translation": "Once knowledge of the arising of suffering and knowledge of cessation have arisen, the mental states of the desire realm that are tied up in unhindered indeterminacy have the condition of seeing the cessation of suffering and the arising of suffering.",
        "source": "T26n1539_009:0574c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸欲界繫無覆無記心，緣見苦集滅所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the desire realm is fettered with an unobstructed, indeterminate mind, which is the condition for seeing what's stopped by suffering accumulation ...",
        "source": "T26n1539_009:0574c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫無覆無記心，緣見所斷。",
        "translation": "If he sees that the perfect disciple of the Bhagavān is not free of desire, the tethers, unhindered, indeterminate mind of the desire realm has the condition of seeing what's stopped.",
        "source": "T26n1539_009:0574c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體未斷。",
        "translation": "This is called having ended the perceptual objects and not yet ending their essence.",
        "source": "T26n1539_009:0574c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體未斷者，謂未離欲界貪，苦智已生、集智未生，諸欲界繫無覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Those whose perceptual objects have been stopped and whose perceptual objects have not yet been stopped and whose bodies have not yet been stopped are those who haven't yet parted with desire, whose knowledge of suffering has arisen and whose knowledge of arising has yet to arise, and whose mental states are tied to the desire realm and are unobstructed and indeterminate, depending on the view of the path to suffering, arising, cessation, and cultivation.",
        "source": "T26n1539_009:0574c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集智已生、滅智未生，諸欲界繫無覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of accumulation has arisen and knowledge of cessation has yet to arise, the tethers in the desire realm are unobstructed, indeterminate, and conditioned by seeing suffering, accumulation, the path to cessation, and what's cut off by cultivation.",
        "source": "T26n1539_009:0574c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅智已生、道智未生，諸欲界繫無覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the desire realm is fettered with unobstructed indeterminate mind, which is the condition for seeing the path to suffering's accumulation and cessation and the path to its cultivation that's stopped.",
        "source": "T26n1539_009:0574c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離欲界貪，諸欲界繫無覆無記心，緣見修所斷。",
        "translation": "If he sees that the perfect disciple of the Bhagavān is not free of desire, his fetters in the desire realm are unobstructed and indeterminate, and he has the condition of seeing what's stopped by cultivation.",
        "source": "T26n1539_009:0574c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體未斷。",
        "translation": "These are called those whose perceptual objects have been stopped and those whose perceptual objects have yet to be stopped and whose essence has yet to be stopped.",
        "source": "T26n1539_009:0574c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸色界繫善心，若體已斷，所緣已斷耶？",
        "translation": "If the mind that's tethered to goodness in the form realm has been stopped in essence, have the perceptual objects been stopped?",
        "source": "T26n1539_009:0574c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷所緣已斷，或體已斷所緣未斷，或體已斷所緣已斷及所緣未斷，或體已斷不可分別此心所緣已斷未斷。",
        "translation": "Either the body has been stopped and the perceptual objects have been stopped, or the body has been stopped and the perceptual objects have not been stopped, or the body has been stopped and the perceptual objects have been stopped and the perceptual objects have not been stopped, or the body has been stopped and it's not possible to discern which perceptual objects have been stopped and which have not been stopped in this mind.",
        "source": "T26n1539_009:0574c26_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷者，謂已離色界貪，未離無色界貪，諸色界繫善心，緣欲界繫、緣色界繫、緣無色界繫。",
        "translation": "Those whose bodies have been stopped and whose perceptual objects have been stopped mean that they've parted with greed in the form realm and haven't parted with greed in the formless realm, and their minds are conditioned by the bonds of the desire realm, conditioned by the bonds of the form realm, and conditioned by the bonds of the formless realm.",
        "source": "T26n1539_009:0575a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸色界繫善心，緣欲界繫、緣色界繫、緣無色界繫、緣欲界繫色界繫、緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Those who have parted with desire for the formless realm and are mindful of the ties to the form realm are mindfully tied to the desire realm, tied to the form realm, tied to the formless realm, tied to the desire realm, tied to the form realm, tied to the form realm, tied to the form realm, and tied to the desire realm, tied to the form realm, and tied to the form realm.",
        "source": "T26n1539_009:0575a03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷。",
        "translation": "This is called having ended the body and having ended the perceptual objects.",
        "source": "T26n1539_009:0575a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣未斷者，謂已離色界貪，苦類智未生，諸色界繫善心，緣無色界繫。",
        "translation": "Those whose bodies have been stopped and whose conditions have not been stopped mean they've parted with desire in the form realm, knowledge of the types of suffering that have yet to arise, and good thoughts that are tied to the form realm and conditioned to the ties of the formless realm.",
        "source": "T26n1539_009:0575a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣未斷。",
        "translation": "This is called a body that has been stopped and whose perceptual objects have yet to be stopped.",
        "source": "T26n1539_009:0575a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷及所緣未斷者，謂已離色界貪，未離無色界貪，諸色界繫善心，緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Those whose bodies have been stopped, whose conditions have been stopped, and whose conditions have not been stopped mean that they have parted with greed in the form realm, haven't parted with greed in the formless realm, and have good minds that are tied to the form realm and are tied to the form realm, are tied to the form realm and are tied to the form realm, and are tied to the desire realm and are tied to the form realm and are tied to the formless realm.",
        "source": "T26n1539_009:0575a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷及所緣未斷。",
        "translation": "This is called a mind whose essence has been stopped, whose perceptual objects have been stopped, and whose perceptual objects have yet to be stopped.",
        "source": "T26n1539_009:0575a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷不可分別此心所緣已斷未斷者，謂已離色界貪，未離無色界貪，諸色界繫善心，緣非所斷。",
        "translation": "Those whose bodies have been stopped and can't discern which mental objects have been stopped and which are not stopped mean that they've parted with greed in the form realm and haven't parted with greed in the formless realm, and the mental objects that are tethers to the form realm are good, and their conditions are not stopped.",
        "source": "T26n1539_009:0575a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸色界繫善心，緣非所斷。",
        "translation": "Having parted with desire in the formless realm, the mind is tethered to goodness in the form realm, and the condition is not something that's stopped.",
        "source": "T26n1539_009:0575a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷不可分別此心所緣已斷未斷。",
        "translation": "This is called a mind whose essence has been stopped and can't discriminate between a mind whose perceptual objects have been stopped and those that haven't been stopped.",
        "source": "T26n1539_009:0575a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶。",
        "translation": "Suppose the perceptual objects have been stopped and their bodies have been stopped.",
        "source": "T26n1539_009:0575a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷其體已斷。",
        "translation": "Maybe the perceptual objects have been stopped and their bodies have been stopped ...",
        "source": "T26n1539_009:0575a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷其體未斷？",
        "translation": "Or have the perceptual objects been stopped and their bodies have not been stopped?",
        "source": "T26n1539_009:0575a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷及所緣未斷其體已斷，或所緣已斷及所緣未斷其體未斷。",
        "translation": "Either their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not been stopped, or their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not been stopped.",
        "source": "T26n1539_009:0575a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體已斷者，謂已離色界貪，未離無色界貪，諸色界繫善心，緣欲界繫、緣色界繫、緣欲界繫色界繫。",
        "translation": "Those whose objects have been stopped and whose bodies have been stopped mean that they have parted with greed in the form realm and haven't parted with greed in the formless realm, and their minds are good in terms of their ties to the desire realm, their ties to the form realm, and their ties to the form realm.",
        "source": "T26n1539_009:0575a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸色界繫善心，緣欲界繫、緣色界繫、緣無色界繫、緣欲界繫色界繫、緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Those who have parted with desire for the formless realm and are mindful of the tethers in the form realm are mindful of the tethers in the desire realm, the tethers in the form realm, the tethers in the formless realm, the tethers in the desire realm, the tethers in the form realm, the tethers in the form realm, and the tethers in the form realm that are tethers in the desire realm.",
        "source": "T26n1539_009:0575a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體已斷。",
        "translation": "This is called having ended the perceptual object and having ended its body.",
        "source": "T26n1539_009:0575a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體未斷者，謂已離欲界貪，未離色界貪，苦類智未生，諸色界繫善心，緣欲界繫。",
        "translation": "Someone who has ended the condition and whose body has yet to be ended means they've parted with desire realm greed, haven't parted with form realm greed, and knowledge of the types of suffering that have yet to arise, and they're minded by the goodness of the form realm's tethers and conditioned by the desire realm's tethers.",
        "source": "T26n1539_009:0575a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未離色界貪，苦類智已生、集類智未生，諸色界繫善心，緣見苦所斷。",
        "translation": "Before becoming free of desire in the form realm, knowledge of suffering has arisen, knowledge of the arising realm has yet to arise, and the tethers of the form realm are conditioned by the good mind that sees what's stopped by suffering.",
        "source": "T26n1539_009:0575b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫善心，緣見苦集所斷。",
        "translation": "When knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the fetters of the form realm are good mental states that have the condition of seeing what's stopped by suffering and accumulation.",
        "source": "T26n1539_009:0575b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫善心，緣見苦集滅所斷。",
        "translation": "Once cessation cognition has arisen and path cognition has yet to arise, the form realm binds good minds, which are conditioned by seeing what's stopped by suffering's accumulation ...",
        "source": "T26n1539_009:0575b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫善心，緣見所斷。",
        "translation": "If he sees that the perfect disciple of the Bhagavān is not free of desire in the form realm, his mind is bound to goodness in the form realm, which is the condition for seeing what's stopped.",
        "source": "T26n1539_009:0575b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體未斷。",
        "translation": "This is called having ended the perceptual objects and not yet ending the perceptual object.",
        "source": "T26n1539_009:0575b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體已斷者，謂已離色界貪，未離無色界貪，諸色界繫善心，緣欲界繫無色界繫、緣色界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Those who have ended the perceptual objects and those whose perceptual objects have not been ended and whose bodies have been ended mean they have parted with greed in the form realm and haven't parted with greed in the form realm, and their mind is good in regard to the perceptual objects bound to the form realm, the perceptual objects bound to the form realm, the perceptual objects bound to the form realm, and the perceptual objects bound to the form realm and the perceptual objects bound to the form realm.",
        "source": "T26n1539_009:0575b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended the perceptual objects but not yet ended their bodies.",
        "source": "T26n1539_009:0575b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體未斷者，謂已離欲界貪，未離色界貪，諸色界繫善心，緣欲界繫色界繫、緣欲界繫無色界繫、緣欲界繫色界繫無色界繫。",
        "translation": "Those who have ended the perceptual objects and those whose perceptual objects have yet to be ended and whose bodies have yet to be ended are those who have parted with desire realm greed and haven't parted with form realm greed, and whose good mind is tied to the form realm tied to the desire realm, tied to the form realm tied to the desire realm, and tied to the form realm tied to the form realm tied to the desire realm.",
        "source": "T26n1539_009:0575b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未離色界貪，苦類智已生、集類智未生，諸色界繫善心，緣見苦集滅道及修所斷。",
        "translation": "Before they become free of desire in the form realm, cognition of suffering has arisen and cognition of arising has yet to arise, and the mind is conditioned by the tethers in the form realm to see the path to suffering, arising and cessation, and the cultivation of what's stopped.",
        "source": "T26n1539_009:0575b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫善心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the tethers in the form realm are good mental states that are conditioned to see the path to suffering's accumulation and cessation and the path to cultivation's cessation.",
        "source": "T26n1539_009:0575b17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生，道類智未生，諸色界繫善心，緣見苦集滅道及修所斷。",
        "translation": "Once cognition of cessation has arisen and cognition of the path has yet to arise, the form realm is tied up with good minds, which are conditioned to see the path of suffering that arises and ceases and the path that's cultivated and stopped.",
        "source": "T26n1539_009:0575b19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫善心，緣見修所斷。",
        "translation": "If he sees that the perfect disciple of the Bhagavān is not free of desire in the form realm, his mind is tethered to goodness in the form realm, which is the condition for seeing what's cultivated and eliminated.",
        "source": "T26n1539_009:0575b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體未斷。",
        "translation": "These are called those whose perceptual objects have been stopped and those whose perceptual objects have yet to be stopped and whose essence has yet to be stopped.",
        "source": "T26n1539_009:0575b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸色界繫有覆無記心，若體已斷，所緣已斷耶？",
        "translation": "If the mind tethered to obscuration and indeterminacy in the form realm has been stopped in essence, have the perceptual objects been stopped?",
        "source": "T26n1539_009:0575b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或體已斷所緣已斷，或體已斷所緣未斷，或體已斷所緣已斷及所緣未斷，或體已斷不可分別此心所緣已斷未斷。",
        "translation": "Either the essence has been stopped and the perceptual objects have been stopped, the essence has been stopped and the perceptual objects have not been stopped, the essence has been stopped and the perceptual objects have been stopped and the perceptual objects have not been stopped, or the essence has been stopped and the perceptual objects of this mind cannot be discerned as stopped or unstopped.",
        "source": "T26n1539_009:0575b24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見苦所斷有覆無記心，緣見苦所斷。",
        "translation": "Those whose bodies have been stopped and whose perceptual objects have been stopped mean that they haven't yet parted with desire in the form realm, knowledge of suffering has arisen and knowledge of accumulation has yet to arise, and the obscured indeterminate mind that's tied to the form realm sees what's stopped by suffering and whose perceptual objects are stopped by suffering.",
        "source": "T26n1539_009:0575b26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集所斷。",
        "translation": "When knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the fetters of the form realm see the obscuring and indeterminate mind that is cut off by suffering and accumulation, which is the condition for seeing the cutting off of suffering.",
        "source": "T26n1539_009:0575b29_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷有覆無記心，緣見苦所斷。",
        "translation": "Seeing what's cut off by suffering and covered by indeterminate states of mind, the condition is seeing what's cut off by suffering.",
        "source": "T26n1539_009:0575c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷有覆無記心，緣見集所斷。",
        "translation": "He sees the obscuring and indeterminate mind that's cut off by accumulation, and the condition is seeing the cutting off of accumulation.",
        "source": "T26n1539_009:0575c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集滅所斷。",
        "translation": "After cognition of cessation has arisen and cognition of the path has yet to arise, the fetters of the form realm see what's stopped by suffering and what's set, covered by indeterminate states of mind, and the condition is seeing what's stopped by suffering and what's stopped by cessation.",
        "source": "T26n1539_009:0575c03_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷有覆無記心，緣見苦所斷。",
        "translation": "Seeing what's stopped by suffering and covered by indeterminate states of mind, the condition is seeing what's stopped by suffering.",
        "source": "T26n1539_009:0575c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷有覆無記心，緣見集所斷。",
        "translation": "He sees what's stopped by suffering and what's covered by indeterminate states of mind, and the condition is seeing what's stopped by suffering ...",
        "source": "T26n1539_009:0575c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見滅所斷有覆無記心，緣見滅所斷。",
        "translation": "He sees what's stopped by cessation and has an obscured, indeterminate mind, and that's the condition for seeing what's stopped by cessation.",
        "source": "T26n1539_009:0575c07_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見所斷有覆無記心，緣見所斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees a covered, indeterminate mind that's stopped by views that are tied to the form realm but hasn't yet parted with desire for the form realm, the condition is seeing what's stopped.",
        "source": "T26n1539_009:0575c08_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸色界繫有覆無記心，緣色界繫。",
        "translation": "He has parted with greed in the form realm and hasn't parted with greed in the formless realm, and the fetters of the form realm are covered and indeterminate, depending on the fetters of the form realm.",
        "source": "T26n1539_009:0575c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸色界繫有覆無記心，緣色界繫、緣無色界繫、緣色界繫無色界繫。",
        "translation": "Having parted with desire for the formless realm, the mind is obscured and indeterminate in regard to the fetters of the form realm, the fetters of the formless realm, and the fetters of the form realm and the formless realm.",
        "source": "T26n1539_009:0575c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷。",
        "translation": "This is called having ended the body and having ended the perceptual objects.",
        "source": "T26n1539_009:0575c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣未斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見苦所斷有覆無記心，緣見集滅道及修所斷。",
        "translation": "Those whose essence has been stopped and whose conditions have not been stopped mean that they haven't yet parted with desire in the form realm, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the fetters of the form realm see the obscuring indeterminate mind that's stopped by suffering and the conditions that are stopped by the path to accumulation and cessation and by cultivation.",
        "source": "T26n1539_009:0575c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫見苦集所斷有覆無記心，緣見滅道及修所斷。",
        "translation": "Once knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the fetters of the form realm see the obscuring and indeterminate mind that is cut off by suffering and accumulation, which are the conditions for seeing the path to cessation and the path to cultivation that is cut off.",
        "source": "T26n1539_009:0575c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫見苦集所斷有覆無記心，緣見道及修所斷。",
        "translation": "Once cessation cognition has arisen and path cognition has yet to arise, the fetters of the form realm see the obscuring indeterminate mind that is cut off by suffering and arising, which are the conditions for seeing the path and the cultivation that is cut off.",
        "source": "T26n1539_009:0575c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見所斷有覆無記心，緣修所斷。",
        "translation": "If a disciple of the Bhagavān sees the perfection of views and hasn't yet parted with desire in the form realm, the fetters of the form realm see what's stopped, which is a covered, indeterminate mind, and the condition is cultivation that's stopped.",
        "source": "T26n1539_009:0575c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，苦類智未生，諸色界繫有覆無記心，緣無色界繫。",
        "translation": "Once they've parted with desire in the form realm, knowledge of the varieties of suffering that have yet to arise, the covering and indeterminate mind of the fetters of the form realm has the condition of the fetters of the formless realm.",
        "source": "T26n1539_009:0575c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣未斷。",
        "translation": "This is called a mind whose essence has been stopped and whose perceptual objects have yet to be stopped.",
        "source": "T26n1539_009:0575c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷所緣已斷及所緣未斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見苦所斷有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Those whose essence has been stopped, whose conditions have been stopped, and whose conditions have not been stopped mean that they haven't yet parted with desire in the form realm, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the fetters of the form realm see the obscuring indeterminate mind that is stopped by suffering and the path to suffering, arising, cessation, and the path to cultivation that is stopped.",
        "source": "T26n1539_009:0575c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the fetters of the form realm see the obscuring indeterminate mind that is cut off by suffering and accumulation, which is the condition for seeing the path to suffering accumulation and cessation and the path to cultivation that is cut off.",
        "source": "T26n1539_009:0575c27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "After knowledge of cessation has arisen and knowledge of the path has yet to arise, the fetters of the form realm see the obscuring indeterminate mind that is cut off by suffering and arising, which is the condition for seeing the path to suffering and arising and the path to cultivation that is cut off.",
        "source": "T26n1539_009:0575c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見所斷有覆無記心，緣見修所斷。",
        "translation": "If he sees a disciple of the Bhagavān who's perfected, hasn't yet parted with greed in the form realm, his fetters in the form realm are viewed as being cut off, covered and indeterminate, and his condition is seeing what's cut off in cultivation.",
        "source": "T26n1539_009:0576a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸色界繫有覆無記心，緣色界繫無色界繫。",
        "translation": "He's free of desire in the form realm but not yet free of desire in the formless realm, and his mind is obscured and indeterminate depending on the fetters of the form realm and the fetters of the formless realm.",
        "source": "T26n1539_009:0576a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷所緣已斷及所緣未斷。",
        "translation": "This is called a mind whose body has been stopped, whose perceptual objects have been stopped, and whose perceptual objects have yet to be stopped.",
        "source": "T26n1539_009:0576a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其體已斷不可分別此心所緣已斷未斷者，謂未離色界貪，滅類智已生、道類智未生，諸色界繫見滅所斷有覆無記心，緣非所斷。",
        "translation": "Those whose essence has been stopped can't discern which mental objects have been stopped and which haven't been stopped, meaning they haven't parted with desire in the form realm, cognition of types of cessation has arisen and cognition of types of the path has yet to arise, and the covered and indeterminate mind has seen the cessation of the bonds of the form realm and has conditions that are not stopped.",
        "source": "T26n1539_009:0576a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見滅道所斷有覆無記心，緣非所斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān has yet to part with desire in the form realm, the fetters of the form realm see obscurations and indeterminate states of mind that are eliminated by the path to cessation, and the condition is not eliminated by that.",
        "source": "T26n1539_009:0576a09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸色界繫有覆無記心，緣非所斷。",
        "translation": "If he's free of desire in the form realm and not yet free of desire in the formless realm, the covering and indeterminate mind of the fetters of the form realm has conditions that aren't cut off.",
        "source": "T26n1539_009:0576a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸色界繫有覆無記心，緣非所斷。",
        "translation": "Having parted with desire in the formless realm, the mind that's tethered to the form realm and has obscurations and indeterminate states of mind, the condition is not something that's stopped.",
        "source": "T26n1539_009:0576a13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名體已斷不可分別此心所緣已斷未斷。",
        "translation": "This is called a mind whose essence has been stopped and can't discriminate between a mind whose perceptual objects have been stopped and those that haven't been stopped.",
        "source": "T26n1539_009:0576a14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose the perceptual objects have been stopped, and their essence has been stopped?",
        "source": "T26n1539_009:0576a15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷其體已斷，或所緣已斷其體未斷，或所緣已斷及所緣未斷其體已斷，或所緣已斷及所緣未斷其體未斷。",
        "translation": "Either their bodies have been stopped after the perceptual objects have been stopped, their bodies have been stopped after the perceptual objects have been stopped but not yet stopped, their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not yet been stopped, or their bodies have been stopped after the perceptual objects have been stopped and the perceptual objects have not yet been stopped.",
        "source": "T26n1539_009:0576a15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體已斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見苦所斷有覆無記心，緣見苦所斷。",
        "translation": "Those whose objects have been stopped and whose bodies have been stopped mean that they haven't yet parted with greed in the form realm, knowledge of suffering has arisen and knowledge of arising has yet to arise, and the covered, indeterminate mind that's bound to the form realm sees what's stopped by suffering and is contingent on seeing what's stopped by suffering.",
        "source": "T26n1539_009:0576a18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集所斷。",
        "translation": "When knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the fetters of the form realm see the obscuring and indeterminate mind that is cut off by suffering and accumulation, which is the condition for seeing the cutting off of suffering.",
        "source": "T26n1539_009:0576a21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷有覆無記心，緣見苦所斷。",
        "translation": "Seeing what's cut off by suffering and covered by indeterminate states of mind, the condition is seeing what's cut off by suffering.",
        "source": "T26n1539_009:0576a23_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷有覆無記心，緣見集所斷。",
        "translation": "They see what's stopped by accumulation, which is covered by indeterminate states of mind, and the condition is seeing what's stopped by accumulation.",
        "source": "T26n1539_009:0576a23_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集滅所斷。",
        "translation": "After cognition of cessation has arisen and cognition of the path has yet to arise, the fetters of the form realm see what's stopped by suffering and what's set, covered by indeterminate states of mind, and the condition is seeing what's stopped by suffering and what's stopped by cessation.",
        "source": "T26n1539_009:0576a24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見苦所斷有覆無記心，緣見苦所斷。",
        "translation": "Seeing what's stopped by suffering and covered by indeterminate states of mind, the condition is seeing what's stopped by suffering.",
        "source": "T26n1539_009:0576a26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見集所斷有覆無記心，緣見集所斷。",
        "translation": "He sees what's stopped by suffering and what's covered by indeterminate states of mind, and the condition is seeing what's stopped by suffering ...",
        "source": "T26n1539_009:0576a27_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見滅所斷有覆無記心，緣見滅所斷。",
        "translation": "He sees what's stopped by cessation and has an obscured, indeterminate mind, and that's the condition for seeing what's stopped by cessation.",
        "source": "T26n1539_009:0576a28_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見所斷有覆無記心，緣見所斷。",
        "translation": "If a disciple of the perfectly accomplished Bhagavān sees a covered, indeterminate mind that's stopped by views that are tied to the form realm but hasn't yet parted with desire for the form realm, the condition is seeing what's stopped.",
        "source": "T26n1539_009:0576a29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離色界貪，未離無色界貪，諸色界繫有覆無記心，緣色界繫。",
        "translation": "He has parted with greed in the form realm and hasn't parted with greed in the formless realm, and the fetters of the form realm are covered and indeterminate, depending on the fetters of the form realm.",
        "source": "T26n1539_009:0576b01_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸色界繫有覆無記心，緣色界繫、緣無色界繫、緣色界繫無色界繫。",
        "translation": "Having parted with desire for the formless realm, the mind with obscured indeterminacy in the form realm's fetters has dependence on the fetters of the form realm, dependence on the fetters of the formless realm, and dependence on the fetters of the form realm and the formless realm.",
        "source": "T26n1539_009:0576b03_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended their bodies.",
        "source": "T26n1539_009:0576b05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體未斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見集所斷有覆無記心，緣見苦所斷。",
        "translation": "Someone whose body has been stopped and whose perceptual objects have not been stopped means that they haven't yet parted with desire in the form realm, knowledge of suffering has arisen and knowledge of the arising realm has yet to arise, and the covering indeterminate mind in the form realm's fetters sees what's stopped by the arising realm and is conditioned to see what's stopped by suffering.",
        "source": "T26n1539_009:0576b05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體未斷。",
        "translation": "This is called having ended the perceptual object and not yet ending its essence.",
        "source": "T26n1539_009:0576b08_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體已斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見苦所斷有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Those whose perceptual objects have been stopped and whose perceptual objects have not been stopped and whose bodies have been stopped mean that they haven't yet parted with desire in the form realm, knowledge of suffering has arisen and knowledge of the arising realm has yet to arise, and the fetters of the form realm see the obscuring indeterminate mind that's stopped by suffering and the path to suffering, arising and cessation and the path to cultivation that's stopped.",
        "source": "T26n1539_009:0576b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the fetters of the form realm see the obscuring indeterminate mind that is cut off by suffering and accumulation, which is the condition for seeing the path to suffering accumulation and cessation and the path to cultivation that is cut off.",
        "source": "T26n1539_009:0576b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫見苦集所斷有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "After knowledge of cessation has arisen and knowledge of the path has yet to arise, the fetters of the form realm see the obscuring indeterminate mind that is cut off by suffering and arising, which is the condition for seeing the path to suffering and arising and the path to cultivation that is cut off.",
        "source": "T26n1539_009:0576b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫見所斷有覆無記心，緣見修所斷已離色界貪。",
        "translation": "If they see that the perfect disciple of the Bhagavān has yet to part with desire in the form realm, the fetters of the form realm see what's stopped, covered and indeterminate mind, and the conditioned view is that what's cultivated and stopped has parted with desire in the form realm.",
        "source": "T26n1539_009:0576b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未離無色界貪，諸色界繫有覆無記心，緣色界繫無色界繫。",
        "translation": "They haven't yet parted with greed in the form realm, and their fetters in the form realm are covered and indeterminate, depending on their fetters in the form realm and fetters in the form realm.",
        "source": "T26n1539_009:0576b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended the perceptual objects that have yet to be ended, and their bodies have been ended.",
        "source": "T26n1539_009:0576b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體未斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫見集所斷有覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Those whose perceptual objects have been stopped and whose perceptual objects have not yet been stopped and whose bodies have not yet been stopped are those who have yet to part with desire in the form realm, whose knowledge of suffering has arisen and whose knowledge of arising has yet to arise, whose covered and indeterminate mind sees the fetters of the form realm that are cut off by accumulation, and whose perceptual objects are cut off by suffering, accumulation, cessation, and cultivation.",
        "source": "T26n1539_009:0576b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體未斷。",
        "translation": "This is called having ended the perceptual object and having unended the perceptual object but not yet ended its essence.",
        "source": "T26n1539_009:0576b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸色界繫無覆無記心，若體已斷，所緣已斷耶？",
        "translation": "If the tethers in the form realm are unobstructed and indeterminate, has their essence been stopped and their perceptual objects stopped?",
        "source": "T26n1539_009:0576b24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：如是。",
        "translation": "He said, \"So it is.",
        "source": "T26n1539_009:0576b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設所緣已斷，其體已斷耶？",
        "translation": "Suppose the perceptual object has been eliminated and its body has been eliminated?",
        "source": "T26n1539_009:0576b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或所緣已斷其體已斷，或所緣已斷其體未斷，或所緣已斷及所緣未斷其體未斷。",
        "translation": "Either their bodies have been stopped after the perceptual objects have been stopped, or their bodies have been stopped after the perceptual objects have been stopped but not yet stopped, or their bodies have been stopped after the perceptual objects have been stopped and before the perceptual objects have been stopped.",
        "source": "T26n1539_009:0576b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體已斷者，謂已離色界貪，未離無色界貪，諸色界繫無覆無記心，緣欲界繫、緣色界繫。",
        "translation": "Those whose perceptual objects have been stopped and whose bodies have been stopped mean that they have parted with greed in the form realm and haven't parted with greed in the form realm, and the unobstructed, indeterminate mind in the form realm fetters is conditioned by the fetters of the desire realm and the fetters of the form realm.",
        "source": "T26n1539_009:0576b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已離無色界貪，諸色界繫無覆無記心，緣欲界繫、緣色界繫。",
        "translation": "Those who have parted with desire for the formless realm and haven't parted with desire for the formless realm, the tethers in the form realm are uncovered and indeterminate, depending on the tethers in the desire realm and the tethers in the form realm.",
        "source": "T26n1539_009:0576c01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體已斷。",
        "translation": "This is called having ended the perceptual objects and having ended their bodies.",
        "source": "T26n1539_009:0576c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷其體未斷者，謂已離欲界貪，未離色界貪，諸色界繫無覆無記心，緣欲界繫，未離色界貪，苦類智已生、集類智未生，諸色界繫無覆無記心，緣見苦所斷。",
        "translation": "Those whose objects have been stopped and whose bodies have not been stopped mean that they have parted with desire realm greed, haven't parted with form realm greed, have uncovered the tethers of the form realm without obscurations or indeterminate states of mind, are conditioned by the tethers of the desire realm, haven't parted with form realm greed, have arisen with knowledge of suffering and haven't yet arisen with knowledge of arising, and have ended with the tethers of the form realm without obscurations or indeterminate states of mind, and are conditioned by seeing what's painful.",
        "source": "T26n1539_009:0576c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫無覆無記心，緣見苦集所斷。",
        "translation": "Once knowledge of the arising type has arisen and knowledge of the cessation type has yet to arise, the tethers in the form realm are unobstructed and indeterminate, which are contingent on seeing what's stopped by suffering and accumulation.",
        "source": "T26n1539_009:0576c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫無覆無記心，緣見苦集滅所斷。",
        "translation": "Once cessation cognition has arisen and path cognition has yet to arise, the form realm is fettered with an unhindered, indeterminate mind, which is the condition for seeing the cessation of suffering that arises.",
        "source": "T26n1539_009:0576c08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫無覆無記心，緣見所斷。",
        "translation": "If he sees that the perfect disciple of the Bhagavān has yet to part with desire in the form realm, his fettered, unhindered, and indeterminate mind in the form realm has the condition of seeing what's stopped.",
        "source": "T26n1539_009:0576c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷其體未斷。",
        "translation": "This is called having ended the perceptual objects and not yet ending their essence.",
        "source": "T26n1539_009:0576c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所緣已斷及所緣未斷其體未斷者，謂未離色界貪，苦類智已生、集類智未生，諸色界繫無覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Those whose perceptual objects have been stopped and whose perceptual objects have yet to be stopped and whose bodies have yet to be stopped are those who haven't parted with greed in the form realm, whose knowledge of suffering has arisen and whose knowledge of arising has yet to arise, and whose tethers in the form realm are unobstructed and indeterminate, depending on views of suffering, arising, cessation, and the path that are cultivated.",
        "source": "T26n1539_009:0576c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "集類智已生、滅類智未生，諸色界繫無覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of types of accumulation has arisen and knowledge of types of cessation has yet to arise, the fettered, unhindered, and indeterminate minds of the form realm are conditioned to see the path to suffering's accumulation and cessation and the path that's cultivated and stopped.",
        "source": "T26n1539_009:0576c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅類智已生、道類智未生，諸色界繫無覆無記心，緣見苦集滅道及修所斷。",
        "translation": "Once knowledge of cessation has arisen and knowledge of the path has yet to arise, the form realm is fettered with an unobstructed, indeterminate mind, which is the condition for seeing the path of suffering that arises and ceases and the path that's cultivated and stopped.",
        "source": "T26n1539_009:0576c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見圓滿世尊弟子，未離色界貪，諸色界繫無覆無記心，緣見修所斷。",
        "translation": "If he sees that the perfect disciple of the Bhagavān has yet to part with desire in the form realm, his fetters in the form realm are unobstructed and indeterminate, and he has the condition of seeing what's stopped by cultivation.",
        "source": "T26n1539_009:0576c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名所緣已斷及所緣未斷其體未斷。",
        "translation": "These are called those whose perceptual objects have been stopped and those whose perceptual objects have yet to be stopped and whose essence has yet to be stopped.",
        "source": "T26n1539_009:0576c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一切有部識身足論卷第九",
        "translation": "Saṃyuktâgama-prakaraṇa-kauśalya-śāstra, vol. 9",
        "source": "T26n1539_009:0576c22_0",
        "is_bad_quality": false
    }
]