[
    {
        "source_sentence": "妙法蓮華經憂波提舍卷下",
        "translation": "Miaofa lianhua jing youboti she rolls down",
        "source": "T26n1519_002:0005b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘論師婆藪槃豆釋",
        "translation": "Vasubandhu's Commentary to the Great Vehicle Treatise",
        "source": "T26n1519_002:0005b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後魏北天竺三藏菩提留支",
        "translation": "Latter Wei Northern India Tripiṭaka Bodhiruci",
        "source": "T26n1519_002:0005b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共沙門曇林等譯",
        "translation": "Shared with the translation by the ascetic Tanlin and others",
        "source": "T26n1519_002:0005b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方便品之餘",
        "translation": "the end of the category of skillful means",
        "source": "T26n1519_002:0005b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是已說妙法功德具足，次說如來法師功德成就應知。",
        "translation": "After thus explaining that the marvelous qualities of the Dharma are complete, the next thing I'll say is that the Tathāgata's teacher should be known for his accomplishments.",
        "source": "T26n1519_002:0005b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「何以故？",
        "translation": "As the sūtra explains, \"Why is that?",
        "source": "T26n1519_002:0005b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T26n1519_002:0005b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來自在說因成就」故。",
        "translation": "It's because the buddha-tathāgatas freely explain the accomplishment of causes.\"",
        "source": "T26n1519_002:0005b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來成就四種功德，故能度眾生。",
        "translation": "The Tathāgata has accomplished four kinds of virtues, so he can save sentient beings.",
        "source": "T26n1519_002:0005b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T26n1519_002:0005b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者住成就，如經「舍利弗！",
        "translation": "One abode is accomplished, as in the sutra, \"Śāriputra!",
        "source": "T26n1519_002:0005b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來成就種種方便」故。",
        "translation": "The Tathāgata accomplishes various skillful means.\"",
        "source": "T26n1519_002:0005b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種方便者，謂從兜率天中退沒乃至示現入涅槃故。",
        "translation": "The various methods are defined as those that led from his retreat from Tuṣita Heaven to his manifestation into nirvāṇa.",
        "source": "T26n1519_002:0005b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者教化成就，如經「種種知見」故。",
        "translation": "Second, it's because the teaching is accomplished according to the sūtra, \"Various ways of knowing and seeing.\"",
        "source": "T26n1519_002:0005b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種知見者，示現染淨諸因故。",
        "translation": "Those who have various ways of knowing and seeing are shown the causes of defilement and purity.",
        "source": "T26n1519_002:0005b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者功德畢竟成就，如經「種種念觀」故。",
        "translation": "Third, it's the ultimate accomplishment of merit, as the sūtra says, \"Various kinds of mindfulness and contemplation.\"",
        "source": "T26n1519_002:0005b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種念觀者，以說彼法成就因緣，如法相應故。",
        "translation": "Those who observe various kinds of mindfulness are accomplished because they explain the causes and conditions for the accomplishment of those qualities as they correspond to the principles.",
        "source": "T26n1519_002:0005b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者說成就，如經「種種言辭」故。",
        "translation": "Fourth, it's accomplished because it's explained as in the sūtra \"Various Words.\"",
        "source": "T26n1519_002:0005b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種言辭者，以四無礙智依何等何等名字章句、隨何等何等眾生能受而為說故。",
        "translation": "Various kinds of words\" is because the four kinds of unhindered knowledge are explained based on what kinds of names and phrases and according to what kinds of sentient beings can receive them.",
        "source": "T26n1519_002:0005b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復有義，種種方便者，種種方便示現外道所有邪法如是如是種種過失故，種種方便示現諸佛所有正法如是如是種種功德故。",
        "translation": "There's also the sense that \"various means\" means variously demonstrating the various faults of the wrong teachings of non-Buddhists and variously demonstrating the various merits of the right teachings of the Buddhas.",
        "source": "T26n1519_002:0005c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「舍利弗！",
        "translation": "As the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0005c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾從成佛已來，廣演言教，無數方便引導眾生於諸著處令得解脫」故。",
        "translation": "Ever since I became a buddha, I've spoken and taught extensively, using countless methods to guide sentient beings into the places of attachment and cause them to attain liberation.\"",
        "source": "T26n1519_002:0005c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無數方便者，方便令入諸善法故。",
        "translation": "Countless skillful means are those that skillfully lead to the entry of good qualities.",
        "source": "T26n1519_002:0005c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又方便者，斷諸疑故。",
        "translation": "Also, these are skillful means for ending doubts.",
        "source": "T26n1519_002:0005c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又方便者，令入增上勝智中故。",
        "translation": "Also, it's a method for bringing sentient beings into superior cognition.",
        "source": "T26n1519_002:0005c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又方便者，依四攝法攝取眾生令得解脫故。",
        "translation": "Also, this is because it's based on the four methods of collecting sentient beings and causing them to attain liberation.",
        "source": "T26n1519_002:0005c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸著處者，彼處處著，或著諸界、或著諸地、或著諸分、或著諸乘。",
        "translation": "\"The abodes of attachment are those who are attached to each place, whether to the elements, the stages, the divisions, or the vehicles.",
        "source": "T26n1519_002:0005c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著諸界者，謂著欲、色、無色界故。",
        "translation": "An attachment to the realms is defined as an attachment to the desire, form, and formless realms.",
        "source": "T26n1519_002:0005c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著諸地者，謂著界故，依於三昧取禪定地，謂初禪地乃至非想非非想地，及取滅盡定地等故。",
        "translation": "An attachment to the stages refers to an attachment to the realms, which is based on samādhi and the stages of meditative concentration, namely, the stage of first dhyāna, the stage of neither perception nor non-perception, and the stage of the concentration of cessation.",
        "source": "T26n1519_002:0005c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著諸分者，謂著在家、出家分故。",
        "translation": "Attachment to the factors refers to attachment to the householder and renunciant factors.",
        "source": "T26n1519_002:0005c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著在家分者，著己同類作種種業邪見等故。",
        "translation": "An attachment to the householder's part is because he's attached to his own kind, which creates various kinds of wrong views of action and so forth.",
        "source": "T26n1519_002:0005c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著出家分者，著名聞利養種種覺煩惱等故。",
        "translation": "Those attached to the renunciant part are attached because they know the various awarenesses and afflictions that bring profit and gain.",
        "source": "T26n1519_002:0005c15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著諸乘者，著聲聞乘、菩薩乘故。",
        "translation": "Those attached to the vehicle part are attached to the śrāvaka vehicle and the bodhisattva vehicle.",
        "source": "T26n1519_002:0005c16_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著聲聞乘者，樂持小乘戒，求須陀洹、斯陀含、阿那含、阿羅漢等故。",
        "translation": "Those who are attached to the śrāvaka vehicle are happy to uphold the lesser vehicle precepts and pursue stream entry, sakṛd-āgāmin, non-returner, arhat, etc.",
        "source": "T26n1519_002:0005c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著大乘者，謂著利養供養恭敬等故，著分別觀種種法相乃至佛地故。",
        "translation": "Those who are attached to the great vehicle are attached to making profit, making offerings, paying respect, and so forth, and they're attached to discriminating and observing the characteristics of various things up to the buddha stage.",
        "source": "T26n1519_002:0005c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復種種知見者，自身成就不可思議勝妙境界，與諸聲聞菩薩等故。",
        "translation": "Furthermore, those who have various kinds of knowledge and views accomplish unfathomably wonderful things in themselves, such as śrāvakas and bodhisattvas.",
        "source": "T26n1519_002:0005c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「舍利弗！",
        "translation": "As the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0005c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來知見方便到於彼岸」故。",
        "translation": "Because the Tathāgata knows and sees how to reach the other shore with skillful means,\" that's why.",
        "source": "T26n1519_002:0005c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到彼岸者，勝餘一切諸菩薩故。",
        "translation": "He reaches the other shore because he's superior to all the other bodhisattvas.",
        "source": "T26n1519_002:0005c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復種種念觀者，如經「舍利弗！",
        "translation": "He also observes various kinds of mindfulness, just as the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0005c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來知見廣大深遠無障無礙，力、無所畏、不共法、根、力、菩提分、禪定、解脫三昧三摩跋提皆已具足」故。",
        "translation": "The Tathāgata's vision is vast and deep, without obstruction or impediment, because his powers, fearlessness, qualities not in common with dharmas, faculties, strengths, factors of enlightenment, meditation, and the samāpatti of liberation are all complete.\"",
        "source": "T26n1519_002:0005c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又第一、成就可化眾生，依善知識而成就故；第二、成就根熟眾生，令得解脫故；第三、成就力家自在，淨降伏故。",
        "translation": "First, it's accomplished because it's possible to teach sentient beings and rely on good friends to accomplish it; second, it's accomplished because it's accomplished because sentient beings with ripened faculties are liberated; and third, it's accomplished because it's accomplished because of its power and family's mastery over pure subjugation.",
        "source": "T26n1519_002:0005c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四、成就復有七種：一者種種成就，如經「舍利弗！",
        "translation": "Fourth, there are seven more kinds of accomplishment: first, various kinds of accomplishment, as described in the sūtra, \"Śāriputra!",
        "source": "T26n1519_002:0006a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來深入無際，成就一切未曾有法」故。",
        "translation": "It's because the buddha-tathāgatas penetrate without limit and accomplish all the unprecedented things.\"",
        "source": "T26n1519_002:0006a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者言語成就，謂得五種美妙音聲言語說法，如經「如來能種種分別巧說諸法，言辭柔軟悅可眾心」故。",
        "translation": "Second, accomplishment of speech, which is the attainment of five beautiful sounds and words that are spoken, as in the sūtra, \"The Tathāgata is able to skillfully explain the teachings in a variety of ways, speaking softly and pleasingly to the minds of all people.\"",
        "source": "T26n1519_002:0006a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者相成就，如經「止。",
        "translation": "The third is the accomplishment of characteristics, as in the sūtra, \"Stop!",
        "source": "T26n1519_002:0006a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T26n1519_002:0006a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不須復說」故，有法器眾生心已滿足故。",
        "translation": "It's \"not necessary to explain again\" because the minds of sentient beings who have the Dharma vessel have been fulfilled.",
        "source": "T26n1519_002:0006a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者堪成就，所有一切可化眾生皆知如來成就希有勝功德能說法故。",
        "translation": "Fourth, it's accomplished because all teachable sentient beings know that the Tathāgata has accomplished rare and excellent qualities and is able to explain the teaching.",
        "source": "T26n1519_002:0006a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「舍利弗！",
        "translation": "As the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0006a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所成就第一希有難解之法」故。",
        "translation": "It's because it's the most rare and difficult-to-understand teaching accomplished by the Buddha.\"",
        "source": "T26n1519_002:0006a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者無量種成就，說不可盡。",
        "translation": "Five, there are measureless accomplishments that cannot be explained in detail.",
        "source": "T26n1519_002:0006a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「舍利弗！",
        "translation": "As the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0006a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛與佛說法，諸佛如來能知彼法究竟實相」故。",
        "translation": "Only buddhas and buddha-teachers can know the ultimate true characteristics of these things.\"",
        "source": "T26n1519_002:0006a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言實相者，謂如來藏法身之體不變義故。",
        "translation": "The term \"true characteristics\" refers to the meaning that the essence of the Tathāgatagarbha's Dharma body doesn't change.",
        "source": "T26n1519_002:0006a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者覺體成就，如來所說一切諸法，唯佛如來自證得故。",
        "translation": "Sixth, the essence of awakening is accomplished, and all the things the Tathāgata teaches are realized only by the buddha-tathāgata himself.",
        "source": "T26n1519_002:0006a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「舍利弗！",
        "translation": "As the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0006a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛如來知一切法」故。",
        "translation": "It's because the Buddha Tathāgata alone knows all dharmas.\"",
        "source": "T26n1519_002:0006a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者隨順眾生意為說修行法成就，彼法何等如是等故。",
        "translation": "Seven, it's because they teach the accomplishment of the cultivation of the Dharma according to the business of many people, and how that Dharma is such and such.",
        "source": "T26n1519_002:0006a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「舍利弗！",
        "translation": "As the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0006a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛如來能說一切法」故。",
        "translation": "It's because the Buddha Tathāgata is the only one who can explain all the teachings.",
        "source": "T26n1519_002:0006a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一種種法門攝取眾生故；第二令不散亂住故；第三令取故；第四令得解脫故；第五令彼修行成就得對治法故；第六令彼修行進趣成就故；第七令得修行不退失故。",
        "translation": "First, these various dharmas are collected from sentient beings; second, they cause them not to be scattered and abide; third, they cause them to be grasped; fourth, they cause them to attain liberation; fifth, they cause the accomplishment of their practice to attain the antidotes; sixth, they cause the accomplishment of their advancement in practice; and seventh, they cause the attainment of nonretrogression in their practice.",
        "source": "T26n1519_002:0006a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此七種法，為諸眾生自身所作善成就故。",
        "translation": "These seven kinds of things are accomplished for the good of sentient beings in their own actions.",
        "source": "T26n1519_002:0006a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又與教化令成就者，與二種法令彼成就。",
        "translation": "They also cause their accomplishment by teaching and transforming, and they cause them to accomplish two kinds of actions.",
        "source": "T26n1519_002:0006a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are the two?",
        "source": "T26n1519_002:0006a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、與證法；二、與說法。",
        "translation": "1. teaching the Dharma with realization; 2. teaching the Dharma with exposition.",
        "source": "T26n1519_002:0006a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一與證法令成就者，謂依證法而授與故；二與說法令成就者，謂依說法而說與故。",
        "translation": "The first is accomplished by the teaching to actualize the teaching, which is based on the teaching to actualize the teaching, and the second is accomplished by the teaching to expound the teaching.",
        "source": "T26n1519_002:0006a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二種法如向前說。",
        "translation": "These two kinds of teaching are explained as before.",
        "source": "T26n1519_002:0006a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依此二法有何次第而得修行？",
        "translation": "What is the sequence of practice that's attained based on these two things?",
        "source": "T26n1519_002:0006a27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即彼前文重說應知。",
        "translation": "This is what should be explained again from the previous section.",
        "source": "T26n1519_002:0006a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又依證法復有五種：一者何等法；二者云何法；三者何似法；四者何相法；五者何體法故。",
        "translation": "There are five more kinds of principles to realize: 1. what principles are they, 2. what principles are they, 3. what seeming principles, 4. what characteristics are they, and 5. what are their essence principles?",
        "source": "T26n1519_002:0006a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等法者，謂聲聞法、辟支佛法、諸佛法故。",
        "translation": "\"What kind of dharma?\" This refers to the dharmas of the śrāvakas, the dharmas of the solitary realizers, and the dharmas of the buddhas.",
        "source": "T26n1519_002:0006b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何法者，謂起種種諸事說故。",
        "translation": "What's the teaching that refers to the various things that are produced.",
        "source": "T26n1519_002:0006b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何似法者，依三種門得清淨故。",
        "translation": "\"What's like a dharma?\" It's because it's purified by relying on three kinds of teachings.",
        "source": "T26n1519_002:0006b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何相法者，謂三種義一相法故。",
        "translation": "\"What's the characteristic dharma? It's the dharma that refers to the unity of the three kinds of meaning.",
        "source": "T26n1519_002:0006b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何體法者，無二體故。",
        "translation": "\"What's the essence of a dharma? It's because there are no two essences.",
        "source": "T26n1519_002:0006b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無二體者，謂無量乘唯一佛乘，無二乘故。",
        "translation": "The one with no two bodies refers to the immeasurable vehicle, the only Buddha vehicle, and no two vehicles.",
        "source": "T26n1519_002:0006b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復有義：何等法者，所謂有為、無為法等。",
        "translation": "There's also another meaning: \"What's the dharma that refers to existent and nonexistent dharmas?",
        "source": "T26n1519_002:0006b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何法者，謂因緣法、非因緣法等。",
        "translation": "What are the dharmas that are considered to be causal dharmas and non-causal dharmas?",
        "source": "T26n1519_002:0006b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何似法者，所謂常法、無常法等。",
        "translation": "\"What's a seeming dharma, which is called a permanent dharma, an impermanent dharma, and so forth?",
        "source": "T26n1519_002:0006b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何相法者、謂生等三相法、不生等三相法。",
        "translation": "\"What are the characteristic dharmas, which are the three characteristic dharmas such as arising and the three characteristic dharmas such as not arising?",
        "source": "T26n1519_002:0006b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何體法者，謂五陰體、非五陰體故。",
        "translation": "\"What's an essence-dharma? This refers to the essence of the five aggregates and what's not the essence of the five aggregates.",
        "source": "T26n1519_002:0006b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又何似法者，謂無常法、有為法、因緣法。",
        "translation": "\"What's another seeming dharma that refers to impermanent dharmas, existential dharmas, and causal dharmas?",
        "source": "T26n1519_002:0006b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又何相法者，謂可見相等法。",
        "translation": "\"What's another seeming dharma?\" This refers to visible and equivalent dharmas.",
        "source": "T26n1519_002:0006b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又何體法者，所謂五陰能取可取，以五陰是苦集體故，又五陰者是道諦體故。",
        "translation": "\"What's another entity that's called the five aggregates that can be grasped and obtained because the five aggregates are collective in suffering and because the five aggregates are the essence of the truth of the path?",
        "source": "T26n1519_002:0006b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有異義依說法說：何等法者，所謂名、句、字身等故。",
        "translation": "There are also different meanings depending on the teaching: \"What's the teaching that refers to names, phrases, word bodies, and so forth?",
        "source": "T26n1519_002:0006b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何法者，謂依如來所說法故。",
        "translation": "What's a dharma? It's a dharma that relies on what the Tathāgata teaches.",
        "source": "T26n1519_002:0006b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何似法者，謂能教化可化者故。",
        "translation": "\"What's like a dharma? It's that which teaches and converts those who can be converted.",
        "source": "T26n1519_002:0006b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何相法者，依音聲取，以依音聲取彼法故。",
        "translation": "\"What's the characteristic dharma? It's taken according to sound, because that dharma is taken according to sound.",
        "source": "T26n1519_002:0006b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何體法者，謂假名體，法相義故。",
        "translation": "\"What's the essence of the teaching?\" refers to the essence of a nominal name and the meaning of the characteristics of a teaching.",
        "source": "T26n1519_002:0006b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此已下，次依示現三種義說：一者決定義；二者疑義；三者依何事疑義，應當善知。",
        "translation": "From here on, the next three kinds of meaning are explained in terms of their manifestation: first, the meaning of certainty; second, the meaning of doubt; and third, the meaning of doubt based on what should be well understood.",
        "source": "T26n1519_002:0006b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "決定義者，有聲聞方便得證深法作決定心，於聲聞道中得方便涅槃證故。",
        "translation": "The meaning of being certain is because there are śrāvakas who skillfully realize the profound Dharma with a mind of determination and who skillfully realize nirvāṇa in the śrāvaka path.",
        "source": "T26n1519_002:0006b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二種證法，示現有為、無為法故。",
        "translation": "These two kinds of realization show the manifestation of existent and nonexistent dharmas.",
        "source": "T26n1519_002:0006b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「爾時大眾中有諸聲聞漏盡阿羅漢，次第乃至亦得此法到於涅槃」故。",
        "translation": "As the sūtra explains, \"At the time, there were śrāvaka arhats among the masses who had ended the contaminants and had reached nirvāṇa in this way in order up to the end of the path.\"",
        "source": "T26n1519_002:0006b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言疑義者，謂諸聲聞、辟支佛等不能得知，是故生疑。",
        "translation": "By the meaning of doubt, I mean that the śrāvakas and pratyekabuddhas couldn't know it, so they had doubts.",
        "source": "T26n1519_002:0006b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「而今不知是義所趣」故。",
        "translation": "It's because they don't know what this means,\" as the sūtra says.",
        "source": "T26n1519_002:0006b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依何事疑義者，聞如來說聲聞解脫與我解脫不異不別是故生疑，謂生疑者生因中疑：此事云何？",
        "translation": "The meaning of doubt based on what?\" When he hears the Tathāgata say that the liberation of the disciples and my liberation are not different or distinct, doubt arises because those who give rise to doubt have doubt in the cause: \"What is this?",
        "source": "T26n1519_002:0006b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此事云何？",
        "translation": "What is this matter?",
        "source": "T26n1519_002:0006b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以如來數數為說甚深境界，前說甚深、後說甚深，不同聲聞，以如是故生疑。",
        "translation": "This is because the Tathāgata repeatedly explains the profound realm, saying that it's profound in the first place and profound in the second, unlike the śrāvakas, and it's because of this that doubts arise.",
        "source": "T26n1519_002:0006c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「爾時舍利弗知四眾心疑，次第乃至而說偈言」。",
        "translation": "As the sūtra explains, \"At the time, Śāriputra knew that the minds of the four people had doubts and spoke the verse in sequence up to and including them.",
        "source": "T26n1519_002:0006c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此以下，次依示現四種事說：一者決定心；二者因授記；三者取授記；四者與授記，應當善知。",
        "translation": "From here on out, he explains the following four things in order of their manifestation: first, a mind that's determined; second, a causal prediction; third, taking a prediction; and fourth, giving a prediction, which should be well understood.",
        "source": "T26n1519_002:0006c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何決定心？",
        "translation": "What is the mind of resolute concentration?",
        "source": "T26n1519_002:0006c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已生驚怖者令斷驚怖，以為利益二種人故，是故如來有決定心。",
        "translation": "\"He causes those who have become frightened to stop being frightened in order to benefit two kinds of people; therefore, the Tathāgata has a mind of resolute concentration.",
        "source": "T26n1519_002:0006c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此驚怖者五種應知：一者損驚怖，謂小乘眾生如所聞聲取以為實，謗無大乘起如是心：如來說言阿羅漢果究竟涅槃。",
        "translation": "There are five kinds of fears that should be known: first, the fear of harming those lesser vehicle sentient beings who take what they hear as sound to be true and denigrate the lack of the great vehicle by thinking, \"The Tathāgata says that the fruit of the arhat is final nirvāṇa.",
        "source": "T26n1519_002:0006c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我畢竟取如是涅槃，是故羅漢不入涅槃。",
        "translation": "After all, I will attain such nirvāṇa, so the arhat won't enter nirvāṇa.'",
        "source": "T26n1519_002:0006c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是驚怖。",
        "translation": "Thus, he's frightened.",
        "source": "T26n1519_002:0006c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者多事驚怖，謂大乘眾生聞菩薩道劫數長遠種種苦行，起如是心：佛道長遠，我於無量無邊劫中行菩薩行久受勤苦。",
        "translation": "Second, fear about many things means that a great vehicle sentient being who hears about the long and varied ascetic practices of the bodhisattva path will have this thought: \"The Buddha path is long, and I've had to endure the long and arduous suffering of practicing the bodhisattva path for measureless and limitless eons.",
        "source": "T26n1519_002:0006c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是念故生驚怖心，以是故起取異乘心。",
        "translation": "This thought gives rise to a fearful mind, and it's because of this that the mind of attaching to a different vehicle arises.",
        "source": "T26n1519_002:0006c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是驚怖。",
        "translation": "Thus, they're frightened.",
        "source": "T26n1519_002:0006c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者顛倒驚怖，謂心分別有我我所種種身見諸不善法。",
        "translation": "Third, the fear of being mistaken means that the mind discerns that there's a self and what's mine, various kinds of bodies, and views of unwholesome things.",
        "source": "T26n1519_002:0006c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是驚怖。",
        "translation": "Thus, he's frightened.",
        "source": "T26n1519_002:0006c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者心悔驚怖，謂大德舍利弗等起如是心言：我不應修證如是小乘之法。",
        "translation": "The fourth fear of repentance, which is when the mind of the great virtuous Śāriputra and others arises and says, \"I shouldn't have cultivated such a lesser vehicle teaching.",
        "source": "T26n1519_002:0006c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是悔已心即自止，即此心悔名為驚怖。",
        "translation": "After thus repenting, their minds then stop themselves, which is called fearfulness when they repent.",
        "source": "T26n1519_002:0006c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此義應知。",
        "translation": "This meaning should be known.",
        "source": "T26n1519_002:0006c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者誑驚怖，謂增上慢聲聞之人起如是心：云何如來誑於我等？",
        "translation": "Fifth, deception and fear, which is when an arrogant śrāvaka arouses this thought, \"How has the Tathāgata deceived us?",
        "source": "T26n1519_002:0006c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是驚怖。",
        "translation": "Thus terrified,\" he said.",
        "source": "T26n1519_002:0006c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因授記者，如經「止止舍利弗！",
        "translation": "The reporter was instructed, as in the sutra, \"Stop it, Śāriputra!",
        "source": "T26n1519_002:0006c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不須復說。",
        "translation": "It doesn't need to be said again.",
        "source": "T26n1519_002:0006c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說是事，一切世間諸天人等皆生驚怖」故。",
        "translation": "If I were to say this, all the gods and humans of the world would become frightened.\"",
        "source": "T26n1519_002:0006c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此因授記皆生驚怖者有三種義：一者欲令彼諸大眾推求甚深妙境界故；二者欲令彼諸大眾生尊重心，畢竟欲聞如來說故；三者欲令諸增上慢聲聞之人捨離法座而起去故。",
        "translation": "There are three meanings of \"frightened by the prediction\": first, it's to cause those masses to inquire about the profound and marvelous state; second, it's to cause those masses to develop a respectful attitude and ultimately want to hear the Tathāgata speak; and third, it's to cause arrogant śrāvakas to abandon their Dharma seats and depart.",
        "source": "T26n1519_002:0006c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二請者，示現過去無量諸佛教化眾生。",
        "translation": "The second invitation is to reveal the countless ways Buddhas taught sentient beings in the past.",
        "source": "T26n1519_002:0007a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「是會無數次第，乃至聞佛所說則生敬信」故。",
        "translation": "It's because the sūtras say, \"This is the kind of meeting that takes place in countless steps, until you hear what the Buddha teaches and then become respectful and faithful.\"",
        "source": "T26n1519_002:0007a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三請者，示現今佛教化眾生。",
        "translation": "The third invitation is to show that there are many Buddhists teaching sentient beings in the present.",
        "source": "T26n1519_002:0007a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「今此會中如我等比，次第乃至長夜安隱多所饒益」故。",
        "translation": "It's because the sūtras say, \"Now, in this assembly, just like us, we will successively and for a long time peacefully and abundantly benefit them.\"",
        "source": "T26n1519_002:0007a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取授記者，以舍利弗等欲得授記。",
        "translation": "Those who obtain the conferral want to receive the assurance of Buddhahood because Śāriputra and the others want to receive the assurance of Buddhahood.",
        "source": "T26n1519_002:0007a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「佛告舍利弗：汝已三請，豈得不說？",
        "translation": "As the sūtra says, \"The Buddha told Śāriputra, 'You've asked him three times, how could you not tell him?'",
        "source": "T26n1519_002:0007a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今諦聽」如是等故。",
        "translation": "'Now listen closely,' and so forth.",
        "source": "T26n1519_002:0007a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與授記者，六種應知：一者未聞令聞；二者說；三者依何等義；四者令住；五者依法；六者遮。",
        "translation": "There are six things you should know about the reporter who gives you the teaching: one, makes you hear it if you haven't heard it yet; two, teaches it; three, relies on what meaning; four, makes you stay; five, follows the rules; and six, refuses to listen.",
        "source": "T26n1519_002:0007a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未聞者令聞，如經「舍利弗！",
        "translation": "Those who have yet to hear are made to hear, as in the sūtra, \"Śāriputra!",
        "source": "T26n1519_002:0007a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是妙法，諸佛如來時乃說之，如優曇鉢華」如是等故。",
        "translation": "Such wonderful things are taught by buddha-tathāgatas at the same time as the udumbara flower,\" and so forth.",
        "source": "T26n1519_002:0007a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說者，如經「舍利弗！",
        "translation": "He teaches it, as the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0007a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以無數方便，種種因緣譬喻言辭演說諸法」如是等故。",
        "translation": "I explain the teachings by means of countless skillful means and various causes and conditions, metaphors, words, and explanations,\" and so forth.",
        "source": "T26n1519_002:0007a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣者，所謂三乘。",
        "translation": "Those with various kinds of causes and conditions are called the three vehicles.",
        "source": "T26n1519_002:0007a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼三乘者，唯有名字章句言說，非有實義，以彼實義不可說故。",
        "translation": "The three vehicles are only names, words, and phrases, not their true meaning, because their true meaning can't be explained.",
        "source": "T26n1519_002:0007a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依何等義者，如經「舍利弗！",
        "translation": "What do they mean by relying on?\" as the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0007a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊唯以一大事因緣故出現於世」如是等故。",
        "translation": "The only reason the world-honored buddhas appear in the world is because of one great cause\" is because of this and other reasons.",
        "source": "T26n1519_002:0007a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一大事者，依四種義應當善知。",
        "translation": "One great matter is something that should be well understood based on four kinds of meaning.",
        "source": "T26n1519_002:0007a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T26n1519_002:0007a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者無上義，唯除如來一切智知，更無餘事。",
        "translation": "One has the unsurpassed meaning of nothing other than the Tathāgata's omniscience knowing that nothing else exists.",
        "source": "T26n1519_002:0007a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「欲開佛知見令眾生知得清淨故出現於世」故。",
        "translation": "It's because the sūtra says, \"I want to reveal the Buddha's knowledge and views so that sentient beings' knowledge can be purified and therefore appear in the world.\"",
        "source": "T26n1519_002:0007a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知見者，如來能證以如實知彼深義故二者同義，謂諸聲聞、辟支佛、佛法身平等。",
        "translation": "Buddha-knowledge and vision\" means that the Tathāgata can realize the profound meaning of these two things as they really are, meaning that śrāvakas, pratyekbuddhas, and the Buddha's Dharma body are equal.",
        "source": "T26n1519_002:0007a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「欲示眾生佛知見故出現於世」故。",
        "translation": "It's because the sūtras say, \"I want to show sentient beings the Buddha's knowledge and vision so I can appear in the world.\"",
        "source": "T26n1519_002:0007a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法身平等者，佛性、法身無差別故。",
        "translation": "The Dharma body is equal because there's no difference between the buddha-nature and the Dharma body.",
        "source": "T26n1519_002:0007a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者不知義，謂諸聲聞、辟支佛等，不能知彼真實處故。",
        "translation": "The third doesn't know the meaning, which is that śrāvakas and pratyekabuddhas can't know the true and real place of those things.",
        "source": "T26n1519_002:0007a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此言不知真實處者，不知究竟唯一佛乘故。",
        "translation": "This expression doesn't know the true place because they don't know the ultimate, only Buddha vehicle.",
        "source": "T26n1519_002:0007a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「欲令眾生悟佛知見故出現於世」故。",
        "translation": "It's because the sūtras say, \"I want to cause sentient beings to awaken to the Buddha's vision and therefore appear in the world.\"",
        "source": "T26n1519_002:0007b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者令證不退轉地，示現欲與無量智業故。",
        "translation": "Four, it's because they want to realize the stage of nonretrogression and show their desire and measureless wisdom activities.",
        "source": "T26n1519_002:0007b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「欲令眾生入佛知見故出現於世」故。",
        "translation": "That's because the sūtra says, \"I want to cause sentient beings to enter the Buddha's wisdom and vision and therefore appear in the world.\"",
        "source": "T26n1519_002:0007b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復示者，為諸菩薩有疑心者，令知如實修行故。",
        "translation": "It's also shown because it's for bodhisattvas who have doubts to make them know to cultivate their practice as it is.",
        "source": "T26n1519_002:0007b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又悟入者，未發心者令發心故，已發心者令入法故。",
        "translation": "It's also enlightening because it causes those who have yet to develop their minds to develop their minds and those who have developed their minds to enter the Dharma.",
        "source": "T26n1519_002:0007b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復悟者，令外道眾生生覺悟故。",
        "translation": "\"Further enlightenment\" is to cause sentient beings from non-Buddhist paths to become enlightened.",
        "source": "T26n1519_002:0007b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復入者，令得聲聞小乘果者入菩提故。",
        "translation": "Further enlightenment causes those who have attained the fruit of the śrāvaka lesser vehicle to enter bodhi.",
        "source": "T26n1519_002:0007b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令住者，如經「舍利弗！",
        "translation": "Those who are made to stay, as the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0007b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以一佛乘故為眾生說法」故。",
        "translation": "It's because they speak the Dharma for sentient beings based on the One Buddha Vehicle.\"",
        "source": "T26n1519_002:0007b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依法者，如經「舍利弗！",
        "translation": "Relying on the Dharma, as the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0007b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去諸佛以無量無數方便，種種譬喻因緣念觀方便說法，是法皆為一佛乘故」如是等故。",
        "translation": "The buddhas of the past taught through measureless and countless skillful means, using various metaphors, causes, conditions, and mindfulness as a means of contemplation, and these teachings were all for the sake of the one Buddha vehicle.\"",
        "source": "T26n1519_002:0007b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言譬喻者，如依牛故得有乳、酪、生酥、熟酥及以醍醐。",
        "translation": "When we say metaphors, it's like relying on cows to make milk, cream, butter, refined butter, and ghee.",
        "source": "T26n1519_002:0007b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此五味中醍醐第一，小乘不如，其猶如乳；大乘為最，猶如醍醐。",
        "translation": "Of these five flavors, ghee is the best, not as good as the lesser vehicle, which is like milk, and the greater vehicle is the best, which is like ghee.",
        "source": "T26n1519_002:0007b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此喻所明大乘無上，諸聲聞等亦同大乘無上義故。",
        "translation": "This metaphor shows that the great vehicle is unsurpassed, so it's important for śrāvakas and others to share the same meaning of the great vehicle as unsurpassed.",
        "source": "T26n1519_002:0007b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞同者，此中示現諸佛如來法身之性，同諸凡夫、聲聞之人、辟支佛等，法身平等無差別故。",
        "translation": "śrāvakas are the same because it shows that the nature of the Dharma body of the Tathāgatas is the same as that of ordinary people, śrāvakas, and pratyekabuddhas, and that the Dharma body is equal without distinctions.",
        "source": "T26n1519_002:0007b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此義皆是譬喻示現因緣之義，如前所說。",
        "translation": "These are all metaphors that reveal the meaning of causes and conditions, as explained above.",
        "source": "T26n1519_002:0007b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言念觀者，小乘諦中人無我等；大乘諦中真如、實際、法界、法性，及人無我、法無我等種種觀故。",
        "translation": "When it comes to mindfulness and contemplation, it's because in the lesser vehicle truth there's selflessness of persons and so forth, and in the greater vehicle truth there are various ways to contemplate true reality, actuality, the Dharma realm, and the nature of things, as well as selflessness of persons and selflessness of things.",
        "source": "T26n1519_002:0007b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言方便者，於小乘中觀陰界入，厭苦離苦得解脫故；於大乘中諸波羅蜜，以四攝法攝取自身他身，利益對治法故。",
        "translation": "When it comes to skillful means, it's because in the lesser vehicle they observe the aggregates, elements, and fields as they enter, and they become free of suffering and attain liberation; in the greater vehicle, the perfections use the four methods of gathering in themselves and others to benefit the antidotes.",
        "source": "T26n1519_002:0007b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮者，如經「舍利弗！",
        "translation": "He refers to the sutra, \"Śāriputra!",
        "source": "T26n1519_002:0007b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方世界中尚無二乘，何況有三」如是等故。",
        "translation": "There are still no two vehicles in the worlds of the ten directions, so why would there be three?\"",
        "source": "T26n1519_002:0007b25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無二乘者，謂無二乘所得涅槃，唯有如來證大菩提，究竟滿足一切智慧名大涅槃，非諸聲聞、辟支佛等有涅槃法，唯一佛乘故。",
        "translation": "The term \"no two vehicles\" means that there are no two vehicles that attain nirvāṇa; only the Tathāgata realizes great enlightenment and the ultimate fulfillment of all wisdom, which is called great nirvāṇa, and there are no śrāvakas or pratyekabuddhas who have the Dharma of nirvāṇa, so there's only the Buddha vehicle.",
        "source": "T26n1519_002:0007b26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一佛乘者，依四種義說，應當善知。",
        "translation": "The One Buddha Vehicle is explained according to four meanings, which should be well understood.",
        "source": "T26n1519_002:0007b29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來依此六種授記，是故前說何等法、云何法、何似法、何相法、何體法，如是示現。",
        "translation": "The Tathāgata relies on these six kinds of assurance, which is why he explained what teaching, what teaching, what resemblance teaching, what characteristics teaching, and what essence teaching are thus shown.",
        "source": "T26n1519_002:0007c01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等法者，謂未曾聞故。",
        "translation": "\"What kind of dharma is this because it's never been heard before?",
        "source": "T26n1519_002:0007c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何法者，謂種種言辭譬喻顯說故。",
        "translation": "What teaching is this because it's explained in various words and metaphors?",
        "source": "T26n1519_002:0007c03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何似法者，所謂唯為一大事故。",
        "translation": "\"What's a seeming dharma? It's called just one big event.",
        "source": "T26n1519_002:0007c04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何相法者，為隨眾生器說諸佛法故。",
        "translation": "\"What's the characteristic dharma?\" It's because the Buddha's teachings are explained according to the capacities of sentient beings.",
        "source": "T26n1519_002:0007c05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何體法者，所謂唯有一乘體故。",
        "translation": "\"What's the essence of the Dharma?\" It's called the One Vehicle essence only.",
        "source": "T26n1519_002:0007c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一乘體者，所謂諸佛如來平等法身；彼諸聲聞、辟支佛乘非彼平等法身之體，以因果行觀不同故。",
        "translation": "The One Vehicle's body is called the equal Dharma body of the buddha-tathāgatas, but the vehicle of the śrāvakas and pratyekabuddhas isn't the body of that equal Dharma body because the contemplation of cause and effect in practice is different.",
        "source": "T26n1519_002:0007c07_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此以下，如來說法為斷四種疑心應知。",
        "translation": "From here on out, the Tathāgata explains the teaching in order to end four kinds of doubt that should be known.",
        "source": "T26n1519_002:0007c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等四疑？",
        "translation": "What are the four kinds of doubt?",
        "source": "T26n1519_002:0007c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、疑何時說；二、疑云何知是增上慢人；三、疑云何堪說；四、疑云何如來不成妄語。",
        "translation": "1. doubts when it's said; 2. doubts how he knows he's being arrogant; 3. doubts how he can say it; and 4. doubts how the Tathāgata doesn't speak falsely.",
        "source": "T26n1519_002:0007c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何時說者，諸佛如來於何等時起種種方便說法為斷此疑。",
        "translation": "\"When was it said? When did the Tathāgatas give various teaching methods to end this doubt?",
        "source": "T26n1519_002:0007c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「舍利弗！",
        "translation": "As the sūtra says, \"Śāriputra!",
        "source": "T26n1519_002:0007c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛出於五濁惡世，所謂劫濁」如是等故。",
        "translation": "The buddhas emerged from the five turbid and evil worlds, which are called the eons of turbidity,\" and so forth.",
        "source": "T26n1519_002:0007c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何知是增上慢人者，如來不為增上慢人而說諸法，云何知彼是增上慢？",
        "translation": "How does the Tathāgata know that he's being arrogant? The Tathāgata doesn't teach the Dharma for people who are arrogant, so how does he know that they're arrogant?",
        "source": "T26n1519_002:0007c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為斷此疑，如經「若有比丘實得阿羅漢者，若不信是法無有是處」如是等故。",
        "translation": "To end this doubt, it's like the sūtra, \"If a monk really has attained arhatship, there's no place for him to go if he doesn't believe this teaching.\"",
        "source": "T26n1519_002:0007c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何堪說者，從佛聞法而起謗心：如來應是不堪說人，云何不成不堪說人？",
        "translation": "How can someone who hears the Buddha's teaching give rise to a defamatory thought: 'The Tathāgata is someone who can't be described, so why wouldn't he be someone who can't be described?'",
        "source": "T26n1519_002:0007c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為斷此疑，如經「除佛滅度後現前無佛」如是等故。",
        "translation": "To put an end to this doubt, it's because the sūtras say, \"Except for the fact that there is no Buddha in the present after he has ceased to exist,\" and so forth.",
        "source": "T26n1519_002:0007c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何如來不成妄語者，此以如來先說法異、今說法異，云何如來不成妄語？",
        "translation": "How does the Tathāgata not formulate false speech? This is because the Tathāgata first explained that the teaching was different and now he's explaining that the teaching is different, so how does the Tathāgata not formulate false speech?",
        "source": "T26n1519_002:0007c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為斷此疑，如經「舍利弗！",
        "translation": "To dispel this doubt, see the sutra, \"Śāriputra!",
        "source": "T26n1519_002:0007c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等應當一心信解受持佛語，諸佛如來言無虛妄，無有餘乘唯一佛乘」故。",
        "translation": "You must all wholeheartedly believe and accept the Buddha's words, for the words of the buddha-tathāgatas are not false, and there are no other vehicles but the Buddha vehicle.\"",
        "source": "T26n1519_002:0007c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「乃至童子戲聚沙為佛塔，如是諸人等皆已成佛道」者，謂發菩提心行菩薩行者，所作善根能證菩提，非諸凡夫及決定聲聞本來未發菩提心者之所能得。",
        "translation": "The expression \"even a boy who plays with sand to make a stūpa for the Buddha, such as these have all accomplished the Buddha Way\" means that someone who arouses the aspiration for enlightenment and practices the bodhisattva path will create good roots that lead to the realization of enlightenment, which is beyond the ability of ordinary people and determined śrāvakas who haven't yet aroused the aspiration for enlightenment in the first place.",
        "source": "T26n1519_002:0007c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是乃至小低頭等，皆亦如是。",
        "translation": "So it is with the little bowed heads and so forth.",
        "source": "T26n1519_002:0008a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬喻品第三",
        "translation": "The Third Chapter of the Parables",
        "source": "T26n1519_002:0008a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者舍利弗所說偈言：「金色三十二，　　十力諸解脫，　同共一法中，　　而不得此事。",
        "translation": "Venerable Śāriputra spoke this verse, \"Thirty-two golden colors and ten powers of liberation are shared in a single dharma, but they aren't attainable.",
        "source": "T26n1519_002:0008a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八十種妙好，　　十八不共法，　如是等功德，　　而我皆已失。」",
        "translation": "The eighty wonderful features and eighteen unique qualities are such that I've lost them all.\"",
        "source": "T26n1519_002:0008a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰：此偈示現何義？",
        "translation": "Explanation: What does this verse mean when it's spoken?",
        "source": "T26n1519_002:0008a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者舍利弗自呵責身言：我不見諸佛、不往諸佛所及聞佛說法，不供養恭敬諸佛，無利益眾生事，於未得法退。",
        "translation": "Venerable Śāriputra himself rebuked himself, saying, \"I don't see the buddhas, don't go to the buddhas and hear them teach, don't make offerings to and venerate the buddhas, don't create problems for the benefit of many, and retrogress from the teaching that I haven't yet attained.",
        "source": "T26n1519_002:0008a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者舍利弗作如是等呵責自身。",
        "translation": "Venerable Śāriputra rebuked himself in this way.",
        "source": "T26n1519_002:0008a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見佛者，示現不見諸佛如來大人之相，不生恭敬供養心故。",
        "translation": "Someone who doesn't see the buddhas shows that they don't see the lordship of the buddhas and don't give rise to the attitude of respect and offerings.",
        "source": "T26n1519_002:0008a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往佛所者，示現教化眾生力故。",
        "translation": "He who goes to the Buddha's place shows his power to teach sentient beings.",
        "source": "T26n1519_002:0008a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "放金色光明者，示現見佛自身異身獲得無量諸功德故。",
        "translation": "He who radiates golden light shows that seeing the Buddha's own different body has obtained measureless merits.",
        "source": "T26n1519_002:0008a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞說法者，示現能作一切眾生之利益故。",
        "translation": "Whoever hears the teaching of the Dharma shows that he can work for the benefit of all sentient beings.",
        "source": "T26n1519_002:0008a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "力者，示現眾生有疑，依十種力斷彼疑故。",
        "translation": "Strength\" shows that sentient beings have doubts, and it's because of the ten powers that cut off their doubts.",
        "source": "T26n1519_002:0008a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養者，示現能教化眾生力故。",
        "translation": "\"Offerings\" is because it shows the power to teach sentient beings.",
        "source": "T26n1519_002:0008a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八不共法者，示現遠離諸障礙故。",
        "translation": "18 Uncommon Dharmas\" shows that he's free of obstacles.",
        "source": "T26n1519_002:0008a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恭敬者，示現出生無量福德，依如來教得解脫故。",
        "translation": "Respectful, it shows that measureless merit is produced, and relying on the Tathāgata's teaching attains liberation.",
        "source": "T26n1519_002:0008a20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以人無我及法無我，一切諸法悉皆平等，是故尊者舍利弗自呵責身言：我未得如是法故。",
        "translation": "Because selflessness of person and selflessness of dharmas make all dharmas equal, Venerable Śāriputra therefore rebuked himself and said, \"I haven't attained this teaching.",
        "source": "T26n1519_002:0008a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於未得中退故。",
        "translation": "It's because I've retrogressed from what I haven't yet attained.",
        "source": "T26n1519_002:0008a23_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此以下，次為七種具足煩惱染性眾生說七種喻，對治七種增上慢心，此義應知。",
        "translation": "From here on, he next explains seven metaphors for seven kinds of sentient beings with defiled natures that are full of affliction to counteract seven kinds of overweening pride, which should be understood.",
        "source": "T26n1519_002:0008a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復次為三種染慢無煩惱人三昧解脫身等染慢，對治此故說三種平等。",
        "translation": "Furthermore, he next explains the three kinds of equality for the three kinds of defiled conceit, such as the body of samādhi and liberation of untroubled people, to counteract this defiled conceit.",
        "source": "T26n1519_002:0008a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此義應知。",
        "translation": "This meaning should be known.",
        "source": "T26n1519_002:0008a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(身下丹本有見字)",
        "translation": "(The word 'view' appears in the Dan edition under 'body.')",
        "source": "T26n1519_002:0008a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者七種具足煩惱染性眾生？",
        "translation": "What are the seven kinds of sentient beings with defiled natures that are full of affliction?",
        "source": "T26n1519_002:0008b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者求勢力人；二者求聲聞解脫人；三者大乘人；四者有定人；五者無定人；六者集功德人；七者不集功德人。",
        "translation": "1. those who seek power, 2. those who seek the liberation of the śrāvakas, 3. those who are great vehicle practitioners, 4. those with concentration, 5. those without concentration, 6. those who gather merit, and 7. those who don't gather merit.",
        "source": "T26n1519_002:0008b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等七種增上慢心？",
        "translation": "What are the seven kinds of arrogance?",
        "source": "T26n1519_002:0008b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何七種譬喻對治？",
        "translation": "What are the seven metaphors for antidotes?",
        "source": "T26n1519_002:0008b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者顛倒求諸功德增上慢心，謂世間中諸煩惱染熾然增上，而求天人勝妙境界有漏果報；對治此故，為說火宅譬喻應知。",
        "translation": "One is the mental state of the mistaken pursuit of merit and increased pride, which refers to the world in which the defilements of affliction blaze up and increase, and the pursuit of the contaminated results of the superior and marvelous realms of gods and humans; to counteract this, we'll explain the parable of the burning house, which should be known.",
        "source": "T26n1519_002:0008b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者聲聞一向決定增上慢心，自言我乘與如來乘等無差別，如是倒取；對治此故，為說窮子譬喻應知。",
        "translation": "Second, the śrāvakas' mind is determined to become more arrogant, claiming that there's no difference between my vehicle and the Tathāgata's vehicle, and they mistakenly take it that way; to counteract this, we explain the parable of the prodigal son.",
        "source": "T26n1519_002:0008b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者大乘一向決定增上慢心，起如是意：無別聲聞、辟支佛乘，如是倒取；對治此故，為說雲雨譬喻應知。",
        "translation": "Third, the mind of the great vehicle that's always been determined to be arrogant and conceited gives rise to the idea that there's no distinction between the vehicle of śrāvakas and pratyekbuddhas, which is mistakenly taken; to counteract this, he explains the parable of the clouds and rain, which should be known.",
        "source": "T26n1519_002:0008b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者實無謂有增上慢心，以有世間三昧三摩跋提，實無涅槃生涅槃想，如是倒取；對治此故，為說化城譬喻應知。",
        "translation": "Fourth, there's really no such thing as an overweening pride that's based on the samādhi of worldly samādhi and the conception of nirvāṇa that arises from the absence of nirvāṇa, which is mistakenly grasped; to counteract this, he should explain the metaphor of the transformation city.",
        "source": "T26n1519_002:0008b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者散亂增上慢心，實無有定，過去雖有大乘善根而不覺知，不覺知故不求大乘，狹劣心中生虛妄解謂第一乘，如是倒取；對治此故，為說繫寶珠譬喻應知。",
        "translation": "Fifth, a distracted, arrogant, and conceited mind really has no concentration, and even though it had great vehicle good roots in the past but didn't realize it, it doesn't pursue the great vehicle because it doesn't realize it, and in a narrow mind it gives rise to the false notion that it's the first vehicle, which is mistakenly grasped; to counteract this, he explains the parable of the tethered jewel.",
        "source": "T26n1519_002:0008b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者實有功德增上慢心，聞大乘法取非大乘，如是倒取；對治此故，為說輪王解自髻中明珠與之譬喻應知。",
        "translation": "Sixth, there really is a mind with superior merit and pride that hears the great vehicle teaching and assumes it's not the great vehicle, which is mistakenly taken; to counteract this, he teaches the parable of the wheel-turning king who understands the bright pearl in his own topknot and gives it to him.",
        "source": "T26n1519_002:0008b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者實無功德增上慢心，於第一乘不曾修集諸善根本，聞第一乘心中不取以為第一，如是倒取；對治此故，為說醫師譬喻應知。",
        "translation": "Seven, he has a mind that's really lacking in the attribute of superiority and arrogance, hasn't cultivated the good roots of the first vehicle, and doesn't regard what he hears about the first vehicle as the best in his mind; therefore, he mistakenly takes it; to counteract this, he teaches the parable of the physician.",
        "source": "T26n1519_002:0008b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一人者，示世間中種種善根三昧功德方便令喜，然後令入大涅槃故。",
        "translation": "The first person shows the various worldly merits of the samādhi of good roots in a way that causes delight, and then causes entry into great nirvāṇa.",
        "source": "T26n1519_002:0008b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二人者，以三為一，令入大乘故。",
        "translation": "The second person uses three as one to cause entry into the great vehicle.",
        "source": "T26n1519_002:0008b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三人者，令知種種乘諸佛如來平等說法，隨諸眾生善根種子而生芽故。",
        "translation": "The third person is someone who causes the knowledge that the buddha-tathāgatas of various vehicles teach equally and follow the seeds of the good roots of sentient beings as they sprout.",
        "source": "T26n1519_002:0008c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四人者，方便令入涅槃城故。",
        "translation": "The fourth person is someone who skillfully causes people to enter the city of nirvāṇa.",
        "source": "T26n1519_002:0008c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃城者，所謂諸禪三昧城故。",
        "translation": "A city of nirvāṇa is called a city of meditation and concentration.",
        "source": "T26n1519_002:0008c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過彼城已，然後令入大涅槃城故。",
        "translation": "After passing through that city, he then causes them to enter the great city of nirvāṇa.",
        "source": "T26n1519_002:0008c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五人者，示其過去所有善根令憶念已，然後教令入三昧故。",
        "translation": "The fifth person shows them all the good roots of the past, causes them to remember them, and then teaches them to enter samādhi.",
        "source": "T26n1519_002:0008c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六人者，說大乘法，以此法門同十地行滿，諸佛如來密與授記故。",
        "translation": "The sixth person teaches the great vehicle teaching because this teaching is the same as the completion of the ten stages of practice, and the buddhas and tathāgatas give it a secret prediction.",
        "source": "T26n1519_002:0008c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七人者，根未淳熟為令熟故，如是示現得涅槃量。",
        "translation": "The seventh person, because his faculties are not yet fully matured and he wants them to become mature, thus shows the amount of nirvāṇa that he'll attain.",
        "source": "T26n1519_002:0008c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是義故，如來說七種譬喻。",
        "translation": "For this reason, the Tathāgata explains seven kinds of parables.",
        "source": "T26n1519_002:0008c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者三種無煩惱人三種染慢？",
        "translation": "What are the three kinds of untroubled people and the three kinds of defiled conceit?",
        "source": "T26n1519_002:0008c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂三種顛倒信故。",
        "translation": "They are called the three kinds of mistaken faith.",
        "source": "T26n1519_002:0008c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are the three?",
        "source": "T26n1519_002:0008c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者信種種乘異；二者信世間涅槃異；三者信彼此身異。",
        "translation": "One believes that the various vehicles are different, two believe that mundane nirvāṇa is different, and three believe that each other's bodies are different.",
        "source": "T26n1519_002:0008c12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為對治此三種染慢，故說三種平等應知。",
        "translation": "To counteract these three kinds of defiled pride, these three kinds of equality are said to be knowable.",
        "source": "T26n1519_002:0008c13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者名為三種平等？",
        "translation": "What are the three kinds of equality?",
        "source": "T26n1519_002:0008c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何對治？",
        "translation": "What is the antidote?",
        "source": "T26n1519_002:0008c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者乘平等，謂與聲聞授菩提記，唯一大乘無二乘故，是乘平等無差別故。",
        "translation": "One, equality of vehicles, which means that when a direct disciple is given the mark of enlightenment, the only great vehicle is one in which there are no two vehicles, and this vehicle is equal without distinctions.",
        "source": "T26n1519_002:0008c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者世間涅槃平等，以多寶如來入於涅槃，世間、涅槃彼此平等無差別故。",
        "translation": "Second, equality of the world and nirvāṇa means that the Tathāgata Abundant Treasures Tathāgata enters nirvāṇa because the world and nirvāṇa are equal without distinction between them.",
        "source": "T26n1519_002:0008c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者身平等，多寶如來已入涅槃復示現身，自身他身法身平等無差別故。",
        "translation": "Third, equality of body, because the Tathāgata Abundant Treasures has entered nirvāṇa and again shows his body, so his own body and the bodies of others are equal without distinction from the Dharma body.",
        "source": "T26n1519_002:0008c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是三種無煩惱人染慢之心，見彼此身所作差別，不知彼此佛性法身悉平等故，謂即此人我證此法故，彼人不得此對治故，與諸聲聞授記應知。",
        "translation": "These three kinds of defiled, conceited minds of untroubled people see distinctions in each other's bodies and don't know that the Buddha-nature and Dharma-body are all equal, which means this person realizes this teaching, and that person doesn't obtain this antidote.",
        "source": "T26n1519_002:0008c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：彼聲聞等，為實成佛故與授記？",
        "translation": "Q: Are those śrāvakas given a prediction because they've actually become buddhas?",
        "source": "T26n1519_002:0008c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為不成佛與授記耶？",
        "translation": "Why don't they become buddhas and grant buddha precepts?",
        "source": "T26n1519_002:0008c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若實成佛，菩薩何故於無量劫修集無量種種功德？",
        "translation": "If it were true that they had become buddhas, why would a bodhisattva have cultivated measureless amounts of various merits over an immeasurable number of eons?",
        "source": "T26n1519_002:0008c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不成佛，云何與之虛妄授記？",
        "translation": "If they don't become buddhas, how could they be given a false prediction?",
        "source": "T26n1519_002:0008c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：彼聲聞等得授記者，得決定心，非謂聲聞成就法性如來。",
        "translation": "Answer: It doesn't mean that those śrāvakas have accomplished the Dharma-nature of the Tathāgata when they attain the journalist's prediction and attain the mind of certainty.",
        "source": "T26n1519_002:0008c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依彼三種平等說一乘法，以佛法身、聲聞法身平等無異故與授記，非即具足修行功德。",
        "translation": "Relying on the equality of those three kinds of explanation of the One Vehicle teaching, they are granted a reporter because the Buddha's Dharma body and the śrāvaka Dharma body are equal and not different, which doesn't mean they've perfected the virtues of cultivation.",
        "source": "T26n1519_002:0008c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩功德具足，諸聲聞人功德未足。",
        "translation": "Therefore, the bodhisattvas' virtues are complete, and the śrāvakas' virtues are not yet complete.",
        "source": "T26n1519_002:0009a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言授記者，六處示現，五是佛記、一菩薩記。",
        "translation": "It's called a reporter of the conferral, which is shown in six places, five by the Buddha and one by the bodhisattvas.",
        "source": "T26n1519_002:0009a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來記者，謂舍利弗大迦葉等眾所知識，名號不同故別與記。",
        "translation": "The tathāgata reporters are the well-known consciousnesses of Śāriputra, Mahākāśyapa, and others, whose names are different so they are given separate reports.",
        "source": "T26n1519_002:0009a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富樓那等五百人千二百等同一名故，俱時與記。",
        "translation": "Pūrṇa and the other 500 people have 1,200 names that are the same as one, so they're both given the same record.",
        "source": "T26n1519_002:0009a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學無學等皆同一號，又復非是眾所知識，故同與記。",
        "translation": "Those who are training and those who are not training are all given the same name, and they aren't all knowables, so they're both given the same record.",
        "source": "T26n1519_002:0009a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來與彼提婆達多授別記者，示現如來無怨惡故。",
        "translation": "The Tathāgata and that Devadatta were given separate reporters who showed that the Tathāgata had no enmity.",
        "source": "T26n1519_002:0009a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與比丘尼及諸天女授佛記者，示現女人在家出家修菩薩行皆證佛果，故與授記。",
        "translation": "He gave the bhikṣuṇīs and goddesses a reporter on the Buddha to show that women at home and at home who cultivate the bodhisattva practice have all realized the Buddhahood, and so he gave them a prediction.",
        "source": "T26n1519_002:0009a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩記者，如下〈不輕菩薩品〉中示現應知。",
        "translation": "The bodhisattva reporters are shown in the following section of the chapter on the not-so-disdainful bodhisattva, which should be understood.",
        "source": "T26n1519_002:0009a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「禮拜讚歎作如是言：我不輕汝，汝等皆當得作佛」者，示現眾生皆有佛性故。",
        "translation": "The one who \"venerates and praises you, saying, 'I don't despise you, you will all become buddhas'\" shows that all sentient beings have buddha-nature.",
        "source": "T26n1519_002:0009a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言聲聞人得授記者，聲聞有四種：一者決定聲聞；二者增上慢聲聞；三者退菩提心聲聞；四者應化聲聞。",
        "translation": "When it comes to śrāvakas who are authorized to report, there are four kinds of śrāvakas: first, those who are determined śrāvakas, second, those who are arrogant śrāvakas, third, those who have withdrawn from the mind of enlightenment, and fourth, those who are transformed śrāvakas.",
        "source": "T26n1519_002:0009a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二種聲聞如來授記，謂應化者、退已還發菩提心者。",
        "translation": "The two kinds of śrāvakas the Tathāgata grants are those who are teachable and those who have returned to the mind of enlightenment after retreating.",
        "source": "T26n1519_002:0009a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若決定者、增上慢者二種聲聞，根未熟故不與授記。",
        "translation": "If there are two kinds of śrāvakas, those who are determined and those who are arrogant, then they won't be given a prediction because their faculties aren't ripe.",
        "source": "T26n1519_002:0009a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩與授記者，方便令發菩提心故。",
        "translation": "A bodhisattva gives a prediction to a reporter because it's a way to make them give rise to the mind of enlightenment.",
        "source": "T26n1519_002:0009a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又依何義，佛說三乘名為一乘？",
        "translation": "What does it mean that the Buddha declared the three vehicles to be the One Vehicle?",
        "source": "T26n1519_002:0009a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依同義故，授諸聲聞大菩提記。",
        "translation": "\"It's because they have the same meaning that they are granted the śrāvakas' great assurance of enlightenment.",
        "source": "T26n1519_002:0009a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言同義者，以佛法身、聲聞法身彼此平等無差別故。",
        "translation": "It means the same thing because the Buddha's Dharma body and the śrāvakas' Dharma body are equal and have no distinctions between them.",
        "source": "T26n1519_002:0009a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以諸聲聞辟支佛等乘不同故有差別，以彼二乘非大乘故，如來說言不離我身是無上義，一切聲聞辟支佛等二乘法中不說此義，以其不能如實解故。",
        "translation": "It's because the vehicles of śrāvakas and pratyekabuddhas are different and therefore have distinctions, and because those two vehicles aren't the great vehicle, the Tathāgata says that not parting from self is the unsurpassed meaning, but this meaning isn't explained in the teachings of all the two vehicles of śrāvakas and pratyekabuddhas because they don't truly understand it.",
        "source": "T26n1519_002:0009a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故，諸菩薩等行菩薩行非為虛妄。",
        "translation": "Because of this meaning, it's not false for bodhisattvas and others to practice the bodhisattva path.",
        "source": "T26n1519_002:0009a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無上義者，自餘經文明無上義，無上義者略有十種，此義應知。",
        "translation": "\"The unsurpassed meaning is the same as the unsurpassed meaning civilized in other scriptures, and there are slightly more than ten kinds of unsurpassed meaning, which should be understood.",
        "source": "T26n1519_002:0009a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are the ten?",
        "source": "T26n1519_002:0009a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者示現種子無上故，說雨譬喻。",
        "translation": "One shows that the seeds are unsurpassed, so he explains the rain metaphor.",
        "source": "T26n1519_002:0009b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等所行是菩薩道」者，謂發菩提心退已還發者，前所修行善根不滅、同後得果故。",
        "translation": "The expression \"what you do is the bodhisattva path\" refers to someone who has returned from arousing the intention to achieve enlightenment and whose good roots from previous practices haven't ceased and are the same as the subsequently attained fruit.",
        "source": "T26n1519_002:0009b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者示現行無上故，說大通智勝如來本事等。",
        "translation": "Second, it shows that practice is unsurpassed, explaining that the great penetrating wisdom is superior to the Tathāgata's abilities and so forth.",
        "source": "T26n1519_002:0009b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者示現增長力無上故，說商主譬喻。",
        "translation": "Third, it shows that the power of growth is unsurpassed, so he explains the merchant metaphor.",
        "source": "T26n1519_002:0009b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者示現令解無上故，說繫寶珠譬喻。",
        "translation": "Four, to show that the power of making people understand is unsurpassed, he teaches the parable of the tethered jewel.",
        "source": "T26n1519_002:0009b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者示現清淨國土無上故，示現多寶如來塔。",
        "translation": "Five, he showed the unsurpassed power of a pure land and described the tower of the many-jeweled Tathāgata.",
        "source": "T26n1519_002:0009b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六者示現說無上故，說解髻中明珠譬喻。",
        "translation": "Sixth, he showed that explanation was unsurpassed and therefore explained the parable of the pearl in the topknot.",
        "source": "T26n1519_002:0009b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七者示現教化眾生無上故，地中踊出無量菩薩摩訶薩等。",
        "translation": "Seven, it shows that teaching sentient beings is unsurpassed, and therefore measureless bodhisattvas, mahāsattvas, and so forth spring up from the ground.",
        "source": "T26n1519_002:0009b08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者示現成大菩提無上故，示現三種佛菩提故：一者示現應佛菩提，隨所應見而為示現，如經「皆謂如來出釋氏宮，去伽耶城不遠，坐於道場得成阿耨多羅三藐三菩提」故；二者示現報佛菩提，十地行滿足得常涅槃證故，如經「善男子！",
        "translation": "The eighth manifests the unsurpassed accomplishment of great bodhi because it shows three kinds of buddha-bodhi: the first manifests the buddha-bodhi of response, which is manifested according to what should be seen, as in the sutra, \"It's called the Tathāgata leaving the palace of Śākyamuni, going to Gayā, sitting in the site of enlightenment and achieving supreme bodhi; the second manifests the buddha-bodhi of retribution because the fulfillment of the ten stages of practice leads to the realization of eternal nirvāṇa, as in the sutra, 'Good sons!'",
        "source": "T26n1519_002:0009b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我實成佛已來無量無邊百千萬億那由他劫」故；三者示現法佛菩提，謂如來藏性淨涅槃常恒清涼不變等義，如經「如來如實知見三界之相，次第乃至不如三界見於三界」故。",
        "translation": "Third, it's the manifestation of the Dharma-body buddha's enlightenment, which is the meaning of the tathāgatagarbha's nature being pure and nirvāṇa being eternally cool and unchanging, just as the sūtra says, \"The Tathāgata truly knows and sees the characteristics of the three realms and sees the three realms in sequence and even when he doesn't see the three realms.",
        "source": "T26n1519_002:0009b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三界相者，謂眾生界即涅槃界，不離眾生界有如來藏故。",
        "translation": "The characteristic of the three realms refers to the fact that the sentient being realm is the nirvāṇa realm, and it's because the tathāgatagarbha doesn't exist apart from the sentient being realm.",
        "source": "T26n1519_002:0009b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無有生死若退若出」者，謂常恒清涼不變義故。",
        "translation": "The expression \"absence of birth and death, whether regressive or emergent\" means that it's always constant and cool, and its meaning doesn't change.",
        "source": "T26n1519_002:0009b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「亦無在世及滅度」者，謂如來藏真如之體，不即眾生界、不離眾生界故。",
        "translation": "\"Nor is there any ongoing or extinction\" means the true nature of the Tathāgatagarbha doesn't immediately pertain to the sentient being realm and doesn't separate from the sentient being realm.",
        "source": "T26n1519_002:0009b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「非實非虛非如非異」者，謂離四種相，有四種相者是無常故。",
        "translation": "\"The expression 'neither real nor unreal, neither such nor different' means that it's free of the four kinds of characteristics, and those with the four kinds of characteristics are impermanent.",
        "source": "T26n1519_002:0009b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不如三界見於三界」者，謂佛如來能見能證真如法身，凡夫不見故。",
        "translation": "\"Not like the three realms and seeing the three realms\" means that a Buddha-tathāgata can see and realize the true reality of the Dharma body, but ordinary people can't see it.",
        "source": "T26n1519_002:0009b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故經言「如來明見無有錯謬」故。",
        "translation": "That's why the sūtra says, \"The Tathāgata's clear vision is without error.\"",
        "source": "T26n1519_002:0009b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我本行菩薩道今猶未滿」者，以本願故，眾生界未盡，願非究竟故。",
        "translation": "\"The reason it says, 'My past life as a bodhisattva is still not complete' is because the original vow was not exhausted in the realm of sentient beings, and that vow wasn't final.",
        "source": "T26n1519_002:0009b27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言未滿，非謂菩提不滿足也。",
        "translation": "When he says it's not yet complete, he doesn't mean that enlightenment isn't fulfilled.",
        "source": "T26n1519_002:0009b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所成壽命復倍上數」者，此文示現如來命常，善巧方便顯多數故，過上數量不可數知。",
        "translation": "The phrase \"the life that's been attained is more than twice as long\" means that this text shows that the Tathāgata's life is eternal, and it's because of the skillful means by which it's manifested that it's greater than an incalculable amount.",
        "source": "T26n1519_002:0009c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我淨土不毀而眾見燒盡」者，報佛如來真實淨土第一義諦之所攝故。",
        "translation": "The phrase \"my pure land won't be disfigured while all views are burned up\" means that it's the reward for the Tathāgata's true and pure land that's included in the cardinal truth.",
        "source": "T26n1519_002:0009c03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九者示現涅槃無上故，說醫師譬喻。",
        "translation": "Nine, it's because it demonstrates the unsurpassed nature of nirvāṇa and explains the physician's parable.",
        "source": "T26n1519_002:0009c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十者示現勝妙力無上故，自餘經文示現應知。",
        "translation": "Ten, it's because it demonstrates the unsurpassed power of excellence, which should be known from the other sūtras that show it.",
        "source": "T26n1519_002:0009c05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多寶如來塔示現一切佛土清淨者，示現諸佛實相境界中種種諸寶間錯莊嚴故。",
        "translation": "\"The Tathāgata Tower of Prabhūtaratna reveals that all the Buddha-lands are pure because it shows the various kinds of treasures interspersed throughout the realms of the buddhas' true features.",
        "source": "T26n1519_002:0009c06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現有八：一者塔；二者量；三者略；四者住持；五者示現無量佛；六者離穢；七者多寶；八者同一塔坐。",
        "translation": "There are eight kinds of manifestations: first, a stūpa; second, a measure; third, an abbreviation; fourth, an abbot; fifth, a manifestation of measureless buddhas; sixth, free from defilement; seven, abundant treasures; and eighth, sitting in the same stūpa.",
        "source": "T26n1519_002:0009c08_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "塔者，示現如來舍利住持故。",
        "translation": "The stūpa is a manifestation of the Tathāgata's relics as they abide.",
        "source": "T26n1519_002:0009c10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "量者，方便示現一切佛土清淨莊嚴，是出世間清淨無漏善根所生，非是世間有漏善根之所生也。",
        "translation": "Measureable is a method of showing that all the Buddha-lands are pure and adorned, produced by pure and uncontaminated wholesome roots that transcend the world and aren't produced by contaminated wholesome roots in the world.",
        "source": "T26n1519_002:0009c11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略者，示現多寶佛身一體攝取一切諸佛真法身故。",
        "translation": "Largely, it's because the Buddha's many treasures are shown to be one body that encompasses the true Dharma bodies of all buddhas.",
        "source": "T26n1519_002:0009c13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住持者，示現諸佛如來法身自在力故。",
        "translation": "Sustainer, it's because it shows the self-power of the Dharma bodies of the buddha-tathāgatas.",
        "source": "T26n1519_002:0009c14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現無量佛者，示現彼此所作諸業無差別故。",
        "translation": "He who shows measureless buddhas shows that there's no distinction between the actions performed by one another.",
        "source": "T26n1519_002:0009c15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離穢者，示現一切諸佛國土平等清淨故。",
        "translation": "\"Free from defilement\" is because it demonstrates the equal purity of all the buddha-lands.",
        "source": "T26n1519_002:0009c16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多寶者，示現一切諸佛國土同實性故。",
        "translation": "\"Many treasures\" is because it shows that all the buddha-lands are of the same true nature.",
        "source": "T26n1519_002:0009c17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同一塔坐者，示現化佛非化佛，法佛報佛等皆為成大事故。",
        "translation": "The one who sits on the same stūpa shows that transformation buddhas and non-transformation buddhas, as well as Dharma buddhas and reward buddhas, are all accomplishing great deeds.",
        "source": "T26n1519_002:0009c18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此已下，示現法力、持力、修行力應知。",
        "translation": "From here on out, the power of the Dharma, the power of maintaining, and the power of cultivating should be revealed.",
        "source": "T26n1519_002:0009c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法力者，五門示現：一者證門；二者信門；三者供養門；四者聞法門；五者讀誦持說門。",
        "translation": "\"The power of the Dharma is demonstrated through five approaches: the approach of realizing, the approach of believing, the approach of making offerings, the approach of hearing the Dharma, and the approach of reciting, maintaining, and teaching.",
        "source": "T26n1519_002:0009c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〈彌勒菩薩品〉中示現四門，〈常精進菩薩品〉中示現一門。",
        "translation": "The four approaches are shown in the Chapter of Maitreya, and the one approach is shown in the Chapter of the Bodhisattva of Constant Exertion.",
        "source": "T26n1519_002:0009c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〈彌勒菩薩品〉中四法門者：一是證門，如經「我說是如來壽命長遠，時六百八十萬億那由他恒河沙等眾生得無生法忍」故。",
        "translation": "The four approaches in the [Chapter of the Bodhisattva Maitreya] are, first, the approach of realization, as described in the sūtra, \"I say that when the Tathāgata had a long life, six hundred and eighty thousand million nayutas of sands of the Ganges River and other sentient beings attained the patience of the nonarising of the Dharma.\"",
        "source": "T26n1519_002:0009c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此言無生法忍者，所謂初地證智應知。",
        "translation": "This is called the ninja of the cognition of the unborn Dharma, which is called the first ground of realization and should be known.",
        "source": "T26n1519_002:0009c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八生乃至一生得阿耨多羅三藐三菩提者，謂證初地菩提法故。",
        "translation": "The expression \"eight births and even a lifetime of attaining supreme perfect enlightenment\" refers to the realization of the first ground's bodhi teaching.",
        "source": "T26n1519_002:0009c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八生一生者，謂諸凡夫決定能證初地故。",
        "translation": "Eight births in a lifetime means that mortals are definitely capable of realizing the first ground.",
        "source": "T26n1519_002:0010a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨力隨分，八生乃至一生皆證初地故。",
        "translation": "According to their powers and according to their ability, eight births and even a lifetime will lead to the realization of the first ground.",
        "source": "T26n1519_002:0010a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此言阿耨多羅三藐三菩提者，以離三界分段生死，隨分能見真如法性名得菩提，非謂究竟滿足如來方便涅槃也。",
        "translation": "This expression anuttarasamyak-saṃbodhi refers to attaining bodhi because one is free of segmented birth and death in the three realms and can see the true nature of reality in accordance with its parts, not the ultimate fulfillment of the Tathāgata's expedient nirvāṇa.",
        "source": "T26n1519_002:0010a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二是信門，如經「復有八世界微塵數眾生皆發阿耨多羅三藐三菩提心」故。",
        "translation": "Second, it's the approach of faith, as shown in the sūtras, because \"there are another eight worlds and a tiny number of sentient beings who have aroused the mind of unsurpassed, correct, and complete enlightenment.\"",
        "source": "T26n1519_002:0010a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三、供養門，如經「是諸菩薩摩訶薩得大法利，時於虛空中雨曼陀羅華如是等」故。",
        "translation": "The gate of making offerings, as the sūtra says, \"When these bodhisattvas, mahāsattvas, and gods attain great benefit from the Dharma, the sky is filled with mandāra flowers like these.\"",
        "source": "T26n1519_002:0010a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四、聞法門，如〈隨喜品〉所說應知。",
        "translation": "The gate of hearing the Dharma is as explained in the Following the Joyful Teaching and should be understood.",
        "source": "T26n1519_002:0010a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〈常精進菩薩品〉中一法門者，謂讀誦解說書寫等，得六根清淨。",
        "translation": "The one dharma-gate in the Chapter of the Bodhisattva of Constant Effort refers to reading, reciting, explaining, writing, and so forth, to attain the purity of the six faculties.",
        "source": "T26n1519_002:0010a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「若善男子善女人受持《法華經》，若讀若誦若解說若書寫，是人當得八百眼功德，次第乃至得千二百意功德」故。",
        "translation": "As the sūtra says, \"If good sons and good women memorize the Lotus Sutra and read, recite, expound, and write it, this person will attain the merit of 800 eyes and, in order, 1,200 mental attributes.",
        "source": "T26n1519_002:0010a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此得六根清淨者，謂諸凡夫以經力故得勝根用，未入初地菩薩正位，此義應知。",
        "translation": "This attainment of the purity of the six faculties means that ordinary people attain superior faculties and functions because of the power of the sūtras, and they haven't yet entered the first bodhisattva's proper stage, which should be understood.",
        "source": "T26n1519_002:0010a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如經「以父母所生清淨肉眼見于三千大千世界」如是等故。",
        "translation": "As the sūtras say, \"With the pure physical eye born from my parents, I can see the 3,000 great thousand worlds\" and so forth.",
        "source": "T26n1519_002:0010a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又六根清淨者，於一一根中悉能具足見色、聞聲、辨香、別味、覺觸、知法，諸根互用此義應知。",
        "translation": "Furthermore, someone with six pure senses can fully perceive form, hear sound, discern fragrance, discern taste, sense touch, and know dharmas in a single root, and this should be understood in terms of the mutual use of the senses.",
        "source": "T26n1519_002:0010a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼所見者聞香能知，如經「釋提桓因在勝殿上五欲娛樂乃至說法」故。",
        "translation": "He can know what the eye sees when it hears fragrance, as shown in the sūtra, \"Śakrodevānām Indra was entertaining the five desires in the palace of Victory and even expounding the Dharma.\"",
        "source": "T26n1519_002:0010a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞香知者，此是知境，以鼻根知故。",
        "translation": "Knowing by smelling an odor, this is the cognition of objects, which is known by the olfactory faculty.",
        "source": "T26n1519_002:0010a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持力者，有三法門示現持力，如〈法師品〉、〈安樂行品〉等廣說。",
        "translation": "\"The power of holding,\" there are three ways to demonstrate the power of holding, as explained in detail in the Dharma Teacher Chapter and the Stirring Up Peace Chapter.",
        "source": "T26n1519_002:0010a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法力，如經應知。",
        "translation": "The power of the Dharma should be known as the sūtras explain.",
        "source": "T26n1519_002:0010a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其心決定知水必近」者，受持此經得佛性水成阿耨多羅三藐三菩提故。",
        "translation": "He who \"knows with certainty in his mind that water will surely come near\" is the recipient of this sūtra because he'll attain the buddha-nature of water and become an unsurpassed, correct, and complete bodhi.",
        "source": "T26n1519_002:0010a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行力者，五門示現：一者說力；二者行苦行力；三者護眾生諸難力；四者功德勝力；五者護法力。",
        "translation": "The power of practice is demonstrated in five ways: first, the power of explanation; second, the power of practicing austerities; third, the power of protecting the difficulties of sentient beings; fourth, the superior power of merit; and fifth, the power of protecting the Dharma.",
        "source": "T26n1519_002:0010a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說力者，有三法門〈神力品〉示現：一者出廣長舌令憶念故；二者謂謦欬聲說偈令聞故，令聞聲已如實修行不放逸故；三者彈指覺悟眾生，令修行者得覺悟故。",
        "translation": "For the power of explanation, there are three ways (the Chapter on Spiritual Powers) that are demonstrated: first, by producing a broad and long tongue that causes recollection; second, by speaking a verse in clear voice that causes hearing, so that after hearing the sound, one will truly cultivate and not become careless; and third, by snapping his fingers and awakening sentient beings, so that those who practice will attain awakening.",
        "source": "T26n1519_002:0010a29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行苦行力者，〈藥王菩薩品〉示現。",
        "translation": "Those who practice the power of austerities are shown in the Yama King Bodhisattva Chapter.",
        "source": "T26n1519_002:0010b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又行苦行力者，〈妙音菩薩品〉示現教化眾生故。",
        "translation": "\"The power of practicing ascetic practices\" is demonstrated in the Chapter of the Bodhisattva Maitreya because it teaches and transforms sentient beings.",
        "source": "T26n1519_002:0010b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護眾生諸難力者，〈觀世自在菩薩品〉、〈陀羅尼品〉示現。",
        "translation": "\"Protecting sentient beings from difficulties\" is demonstrated in the Avalokitêśvara-vimala-bodhisattva Chapter and the Dhāraṇī Chapter.",
        "source": "T26n1519_002:0010b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "功德勝力者，〈妙莊嚴王品〉示現，二童子依過去世功德善根有如是力故。",
        "translation": "The superior power of merit is demonstrated in the Chapter of the King of Marvelous Adornment, because the two boys had such power based on the merit and good roots of past lives.",
        "source": "T26n1519_002:0010b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護法力者，〈普賢菩薩品〉及後品示現。",
        "translation": "The power to protect the Dharma is shown in the Chapter of Samantabhadra and the subsequent Chapter.",
        "source": "T26n1519_002:0010b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言「受持觀世自在菩薩名號，若人受持六十二億恒河沙等諸佛名號福德等」者，有二種義：一者信力故；二者畢竟知故。",
        "translation": "It also says, \"Accepting and upholding the name of the Bodhisattva who observes the world's self-perfection and the merit of accepting the names of six billion Ganges River Sands buddhas\" has two meanings: first, it's because of the power of faith; second, it's because of ultimate knowledge.",
        "source": "T26n1519_002:0010b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信力者有二種：一者我身如彼觀世自在無異，畢竟信故；二者謂於彼生恭敬心，如彼功德我亦如是畢竟得故。",
        "translation": "There are two kinds of power of faith: first, because I observe the world as they do with unimpededness and final faith, and second, because I give rise to respect for them and thus attain their merits after all.",
        "source": "T26n1519_002:0010b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畢竟知者，謂能決定知法界故。",
        "translation": "To know it after all means to be able to know the Dharma realm with certainty.",
        "source": "T26n1519_002:0010b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言法界者，名為法性。",
        "translation": "That expression, \"realm of reality,\" is called the nature of reality.",
        "source": "T26n1519_002:0010b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼法性者，名為一切諸佛菩薩平等法身。",
        "translation": "That Dharma nature is called the equal Dharma body of all buddhas and bodhisattvas.",
        "source": "T26n1519_002:0010b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "平等身者，真如法身，初地菩薩乃能證入。",
        "translation": "The equal body is the true reality reality body, which first-stage bodhisattvas can then realize.",
        "source": "T26n1519_002:0010b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故受持六十二億恒河沙等諸佛名號，有能受持觀世自在菩薩名號，所得功德無差別。",
        "translation": "Therefore, there's no difference between those who bear the names of 6,200,000,000,000 rhesus sands buddhas and those who can bear the name of the bodhisattva Avalokitêśvara and the merit attained.",
        "source": "T26n1519_002:0010b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一〈序品〉示現七種功德成就，第二〈方便品〉有五分示現破二明一，餘品如向處分易解。",
        "translation": "The first (Preface Chapter) demonstrates seven kinds of merit accomplishment, and the second (Expedient Chapter) has five sections that demonstrate the breakdown of two and the clarification of one, while the remaining sections are easy to understand as they proceed.",
        "source": "T26n1519_002:0010b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經憂波提舍卷下",
        "translation": "Miaofa lianhua jing youboti she vol. 2",
        "source": "T26n1519_002:0010b25_0",
        "is_bad_quality": false
    }
]