[
    {
        "source_sentence": "阿毘曇八犍度論卷第二十一",
        "translation": "Abhidharma-jñānaprasthāna-śāstra, Vol. 21",
        "source": "T26n1543_021:0867a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦旃延子造",
        "translation": "created by Kātyāyanīputra",
        "source": "T26n1543_021:0867a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "符秦罽賓三藏僧伽提婆",
        "translation": "Fuqin Kapphiṇa Tripiṭaka Saṃghadeva",
        "source": "T26n1543_021:0867a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共竺佛念譯",
        "translation": "Shared Zhufo Nian Translation",
        "source": "T26n1543_021:0867a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根犍度第六",
        "translation": "Root Gandhāra, sixth",
        "source": "T26n1543_021:0867a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　　二十二根有，　　更樂始心等，　始發魚因緣。",
        "translation": "\"Twenty-two faculties exist, and they begin to develop causes and conditions like the mind that begins to enjoy life.",
        "source": "T26n1543_021:0867a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿毘曇根跋渠第一",
        "translation": "*Abhidharma-gun-vṛkṣa-principle.",
        "source": "T26n1543_021:0867a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二根：眼根耳根鼻根舌根身根意根、男根女根命根、樂根苦根喜根憂根護根、信根精進根念根定根慧根、未知根已知根無知根。",
        "translation": "\"The twenty-two faculties are the eye faculty, ear faculty, nose faculty, tongue faculty, body faculty, mind faculty, male faculty, female faculty, life faculty, pleasure faculty, pain faculty, joy faculty, grief faculty, protect faculty, faith faculty, effort faculty, mindfulness faculty, concentration faculty, wisdom faculty, unknown faculty, and known faculty and ignorant faculty.",
        "source": "T26n1543_021:0867a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二十二根，幾學、幾無學、幾非學非無學？",
        "translation": "Of these twenty-two faculties, how much are they learned, how much are they unlearned, and how much are they neither learned nor unlearned?",
        "source": "T26n1543_021:0867a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根學，彼根學人乎？",
        "translation": "\"What are the faculties that train, and what are the faculties that train people?",
        "source": "T26n1543_021:0867a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設學人根，彼學根乎？",
        "translation": "Suppose you want to train someone's faculties, will they train their faculties?",
        "source": "T26n1543_021:0867a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根無學，彼無學人根乎？",
        "translation": "\"What about the faculties of the adepts and the trainees?",
        "source": "T26n1543_021:0867a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設無學人根，彼無學根乎？",
        "translation": "If there are no trainees, does he have no faculty of training?",
        "source": "T26n1543_021:0867a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根非學非無學，彼根非學非無學人根乎？",
        "translation": "\"What are the faculties that are not training and not training, and what are those faculties that are not training and not the faculty of a person who is not training?",
        "source": "T26n1543_021:0867a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設根非學非無學人，彼根非學非無學乎？",
        "translation": "Suppose a person's faculties are not trainees and he's not an apprentice; are his faculties not trainees and he's not an apprentice?",
        "source": "T26n1543_021:0867a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二十二根，幾善幾不善乎？",
        "translation": "Of these twenty-two faculties, how good and how unwholesome are they?",
        "source": "T26n1543_021:0867a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾無記、幾有報、幾無報耶？",
        "translation": "How much is indeterminate, how much is rewarding, and how much is unrewarding?",
        "source": "T26n1543_021:0867a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾見諦斷、幾思惟斷、幾不斷？",
        "translation": "How much of the truth of seeing is stopped, how much of contemplation is stopped, and how much of it is not stopped?",
        "source": "T26n1543_021:0867a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾見苦斷幾見習見盡見道、思惟斷、幾不斷。",
        "translation": "\"How many views are afflicted, how many views are ended, how many accumulated views are ended, how much contemplation is ended, and how much non-interruption is there?",
        "source": "T26n1543_021:0867b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾見幾不見？",
        "translation": "How many views are there, and how many aren't seen?",
        "source": "T26n1543_021:0867b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾有覺有觀、幾無覺有觀、幾無覺無觀？",
        "translation": "How many perceptions are there that are contemplated, how many perceptions are there that are not perceived, and how many perceptions are there that are not perceived?",
        "source": "T26n1543_021:0867b02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾樂根相應、幾苦根幾喜根幾憂根幾護根？",
        "translation": "\"How many faculties of pleasure are associated with each other, how many faculties of suffering, how many faculties of joy, how many faculties of sorrow, and how many faculties of protection?",
        "source": "T26n1543_021:0867b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾欲界繫、幾色界繫、幾無色界繫、幾不繫？",
        "translation": "How many fetters are there in the desire realm, how many fetters in the form realm, how many fetters in the formless realm, and how many fetters not?",
        "source": "T26n1543_021:0867b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾因相應、幾因不相應、幾因相應因不相應耶、幾不因相應非因不相應？",
        "translation": "How many causes are associated, how many are not associated, how many are associated with causes that are not associated, and how many are not associated with causes that are not associated with causes?",
        "source": "T26n1543_021:0867b05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾共緣相緣、幾不共緣相緣、幾共緣相緣不共緣相緣乎、幾不共緣相緣非不共緣相緣耶？",
        "translation": "How many common conditions are associated with each other, how many different conditions are associated with each other, how many common conditions are associated with each other and different conditions are associated with each other, and how many different conditions are associated with each other and not different conditions are associated with each other?",
        "source": "T26n1543_021:0867b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根此法，彼根凡夫人耶？",
        "translation": "What are the faculties of this dharma and the faculties of mortals?",
        "source": "T26n1543_021:0867b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設根凡夫人，彼根此法耶？",
        "translation": "Suppose a person with ordinary faculties is this person and this dharma has their faculties?",
        "source": "T26n1543_021:0867b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色陰攝幾根、痛想行識陰攝幾根？",
        "translation": "How many faculties are included in the form aggregate, and how many faculties are included in the aggregates of pain, perception, volition, and consciousness?",
        "source": "T26n1543_021:0867b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善根攝幾持幾入幾陰、不善根攝幾持幾入幾陰、隱沒無記根攝幾持幾入幾陰、不隱沒無記根攝幾持幾入幾陰？",
        "translation": "\"How many aggregates are included in the wholesome faculties, how many aggregates are included in the unwholesome faculties, how many aggregates are included in the withdrawn indeterminate faculties, how many aggregates are included in the withdrawn indeterminate faculties, and how many aggregates are included in the withdrawn indeterminate faculties?",
        "source": "T26n1543_021:0867b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根法攝幾持幾入幾陰、無根法攝幾持幾入幾陰、根無根法攝幾持幾入幾陰？",
        "translation": "\"How much of the faculties are collected, maintained, and entered, how much of the aggregates are collected, maintained, and entered, and how much of the aggregates are collected and maintained by faculties and faceless dharmas, and how much of the aggregates are collected, maintained, and entered by faculties and faceless dharmas?",
        "source": "T26n1543_021:0867b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根生根耶、頗緣根生不根耶、頗緣根生根不根耶？",
        "translation": "What kind of conditions does a faculty produce faculties, what kind of conditions does a faculty produce that are not faculties, and what kind of conditions does a faculty produce that are not faculties?",
        "source": "T26n1543_021:0867b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣不根生不根耶、頗緣不根生根耶？",
        "translation": "\"What are the conditions that do not give rise to [non-]faculties and what are the conditions that do not give rise to [non-]faculties?",
        "source": "T26n1543_021:0867b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣不根生根不根耶？",
        "translation": "How could it be that a condition does not give rise to faculties and not faculties?",
        "source": "T26n1543_021:0867b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根不根生根耶、頗緣根不根生不根耶、頗緣根不根生根不根耶？",
        "translation": "\"What kind of conditions does a faculty produce faculties that are not faculties, what kind of conditions does a faculty produce faculties that are not faculties, and what kind of conditions does a faculty produce faculties that are not faculties?",
        "source": "T26n1543_021:0867b17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣眼根生眼根耶、頗緣眼根乃至生無知根耶？",
        "translation": "\"How will the eye faculty produce the eye faculty, or how will the eye faculty and even the faculty of nescience be produced by those faculties?",
        "source": "T26n1543_021:0867b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣無知根生無知根耶、頗緣無知根生眼根乃至已知根耶？",
        "translation": "Does the nescience faculty give rise to the nescience faculty, or does the nescience faculty give rise to the visual faculty or even the known faculty?",
        "source": "T26n1543_021:0867b20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根，彼眼根幾緣緣？",
        "translation": "What are the perceptual objects of the visual faculty and what are the perceptual objects of the visual faculty?",
        "source": "T26n1543_021:0867b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根乃至無知根幾緣緣？",
        "translation": "What are the perceptual faculties and even the faculty of nescience as objects of perception?",
        "source": "T26n1543_021:0867b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無知根，彼無知根幾緣緣？",
        "translation": "\"Gnostic faculties, what are the conditions and objects of those gnostic faculties?",
        "source": "T26n1543_021:0867b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無知根，眼根乃至已知根幾緣緣？",
        "translation": "What are the perceptual objects of the faculty of nescience, the visual faculty, and even the faculty of knowing?",
        "source": "T26n1543_021:0867b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此章義願具演說。",
        "translation": "This chapter's meaning is explained in detail in the vow.",
        "source": "T26n1543_021:0867b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二根：眼根耳鼻舌身根意根、男根女根命根、樂根苦根喜根憂根護根、信根精進念定慧根、未知根已知根無知根。",
        "translation": "The twenty-two faculties are the eye faculty, ear, nose, tongue, body, and mind faculties, the male faculty, the female faculty, the life faculty, the pleasure faculty, the pain faculty, the joy faculty, the sorrow faculty, the guard faculty, the faculty of faith, effort, mindfulness, concentration, and wisdom faculty, and the unknown faculty, the known faculty, and the ignorant faculty.",
        "source": "T26n1543_021:0867b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾學、幾無學、幾非學非無學？",
        "translation": "Of these twenty-two faculties, how much are they learned, how much are they unlearned, and how much are they not learned or unlearned?",
        "source": "T26n1543_021:0867b27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：二學、一無學、十非學非無學、九當分別。",
        "translation": "Answer: Two are learned, one is unlearned, ten are not learned and not unlearned, and nine should be discerned.",
        "source": "T26n1543_021:0867b28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根，或學、或無學、或非學非無學。",
        "translation": "The faculty of thought may be training, no-training, or neither training nor no-training.",
        "source": "T26n1543_021:0867b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何學？",
        "translation": "What is training?",
        "source": "T26n1543_021:0867c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：學意所念諸意根相應，是謂學。",
        "translation": "Answer: This is called training that's associated with the mindfulness of the faculty of thought.",
        "source": "T26n1543_021:0867c01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學？",
        "translation": "How is it no training?",
        "source": "T26n1543_021:0867c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無學意所念諸意根相應，是謂無學也。",
        "translation": "Answer: \"Being associated with the mindfulness of the faculty of thought by a trainee mind is called being trainee.",
        "source": "T26n1543_021:0867c02_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非學非無學？",
        "translation": "How is it neither training nor no-training?",
        "source": "T26n1543_021:0867c03_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有漏意所念諸意根相應，是謂非學非無學也。",
        "translation": "Answer: \"The faculties of mindfulness that are associated with contaminated thoughts are not training or no-training.",
        "source": "T26n1543_021:0867c03_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根喜根護根、信根精進念定慧根亦復如是。",
        "translation": "The faculty of joy, the faculty of happiness, the faculty of protection, the faculty of faith, the faculty of effort, the faculty of concentration, and the faculty of wisdom are likewise.",
        "source": "T26n1543_021:0867c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根學，彼學家根耶？",
        "translation": "Of all the faculties that are trained, which are the faculties of scholars?",
        "source": "T26n1543_021:0867c06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或學根彼根非學家。",
        "translation": "Answer: \"Perhaps a trainer or someone with other faculties isn't a scholar.",
        "source": "T26n1543_021:0867c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何學根彼根非學家耶？",
        "translation": "How are they trainees and non-trainers of their own faculties?",
        "source": "T26n1543_021:0867c07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸根學學家不成就，是謂根學彼根非學家也。",
        "translation": "Answer: \"Trainers of the faculties don't achieve it, which is called trainers of the faculties and not trainers of the other faculties.",
        "source": "T26n1543_021:0867c07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何學家根彼根非學？",
        "translation": "How are the faculties of the scholars and the other faculties not scholars?",
        "source": "T26n1543_021:0867c08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸非學非無學根學家成就，是謂學家根彼根非學。",
        "translation": "Answer: \"Accomplished scholars who aren't trainees or who don't have the root of training are called scholars whose root is not training.",
        "source": "T26n1543_021:0867c09_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何學根？",
        "translation": "What are the training faculties?",
        "source": "T26n1543_021:0867c10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼根學家乎？",
        "translation": "Do they have good roots?",
        "source": "T26n1543_021:0867c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學根學家成就，是謂學根彼根學家。",
        "translation": "Answer: \"Accomplished scholars of the faculties of training are scholars of the faculties of training and the faculties of others.",
        "source": "T26n1543_021:0867c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非學根彼根非學家乎？",
        "translation": "How are they not scholars of the training faculties and not scholars of the other faculties?",
        "source": "T26n1543_021:0867c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無學根、諸非學非無學根學家不成就，是謂非學根彼根非學家也。",
        "translation": "Answer: \"Trainee faculties, those who aren't trainee and those who aren't trainee faculties aren't accomplished, which are called non-training faculties and those whose faculties aren't trainee faculties.",
        "source": "T26n1543_021:0867c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無學根，無學家彼根乎？",
        "translation": "What are the roots of no-training and the roots of no-training and the roots of no-schoolers?",
        "source": "T26n1543_021:0867c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或無學根彼根非無學家。",
        "translation": "Answer: \"Perhaps there are trainees and their faculties aren't trainees.",
        "source": "T26n1543_021:0867c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學根彼根非無學家？",
        "translation": "How are the root of no more training and the root of another not an ignorant scholar?",
        "source": "T26n1543_021:0867c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸無學根無學家不成就，是謂無學根彼根非無學家。",
        "translation": "Answer: \"The roots of post-learners and the roots of non-academics don't accomplish anything, which is to say that the roots of post-learners and their roots are not post-learners.",
        "source": "T26n1543_021:0867c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無學家根彼根非無學？",
        "translation": "How are the faculty of the unscholarly and the other faculties not unscholarly?",
        "source": "T26n1543_021:0867c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸非學非無學根無學家成就，是謂無學家根。",
        "translation": "Answer: \"The accomplishment of unschooling and unschooled roots by an unschooler is called the root of the unschooler.",
        "source": "T26n1543_021:0867c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼根非無學，云何無學根無學家彼根乎？",
        "translation": "If their faculties aren't post-learning, then how can they be post-learning faculties and post-learning faculties of scholars?",
        "source": "T26n1543_021:0867c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸無學根無學家成就，是謂無學根無學家彼根也。",
        "translation": "Answer: \"The accomplishment of the root of post-learners and the lack of scholars is called the root of post-learners and the lack of scholars in that root.",
        "source": "T26n1543_021:0867c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非無學根彼根非無學家？",
        "translation": "How are these not traineeship faculties and these not traineeship faculties?",
        "source": "T26n1543_021:0867c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：學根、諸非學非無學根無學家不成就，是謂非無學根彼根非無學家。",
        "translation": "Answer: \"The faculty of training, the faculties that are not training, the faculties that are not training, and the faculties that are not unschooled and the faculties that are not unschooled are not accomplished by an unschooler.",
        "source": "T26n1543_021:0867c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根非學非無學，彼根非學非無學家根乎？",
        "translation": "Are the faculties not trainees and not trainees, and are those faculties not trainees and not the faculty of the unscholarly?",
        "source": "T26n1543_021:0867c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是，諸根非學非無學家，非學非無學彼根也。",
        "translation": "Answer: \"So it is, the faculties are not trainees or non-academics, and they are not trainees or non-academics of those faculties.",
        "source": "T26n1543_021:0867c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼根非學非無學，彼根非學非無學家？",
        "translation": "Are those faculties not learned and not without training, and are those faculties not learned and not without scholarship?",
        "source": "T26n1543_021:0868a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有諸非學非無學根，非學非無學家不成就。",
        "translation": "Answer: \"There are faculties that are neither learned nor unlearned, and those that are neither learned nor unlearned aren't fulfilled.",
        "source": "T26n1543_021:0868a02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾善、幾不善、幾無記乎？",
        "translation": "Of these twenty-two faculties, how good, how unskillful, and how indeterminate are they?",
        "source": "T26n1543_021:0868a03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：八善、八無記、六當分別。",
        "translation": "Answer: \"There are eight good, eight indeterminate, and six that should be discerned.",
        "source": "T26n1543_021:0868a04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根，或善、或不善、或無記。",
        "translation": "The faculty of thought is either good, unskillful, or indeterminate.",
        "source": "T26n1543_021:0868a05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何善乎？",
        "translation": "How are they good?",
        "source": "T26n1543_021:0868a06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：善心所念諸意根相應，是謂善。",
        "translation": "Answer: This is called good when it's associated with the faculty of mindfulness of good thoughts.",
        "source": "T26n1543_021:0868a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不善？",
        "translation": "How is it not good?",
        "source": "T26n1543_021:0868a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不善心所念諸意根相應，是謂不善也。",
        "translation": "Answer: This is called unwholesome when it's associated with the mental faculty that's mindful of unwholesome thoughts.",
        "source": "T26n1543_021:0868a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無記？",
        "translation": "How is it indeterminate?",
        "source": "T26n1543_021:0868a08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無記心所念諸意根相應，是謂無記也。",
        "translation": "Answer: This is called indeterminate mind when it's associated with the faculty of thought.",
        "source": "T26n1543_021:0868a08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根苦根喜根護根亦復如是。",
        "translation": "The faculty of pleasure, faculty of suffering, faculty of joy, and faculty of protection are likewise.",
        "source": "T26n1543_021:0868a09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憂根，或善或不善。",
        "translation": "The faculty of grief may be good or not good.",
        "source": "T26n1543_021:0868a10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何善？",
        "translation": "What's good?",
        "source": "T26n1543_021:0868a10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：善心所念諸憂根相應，是謂善。",
        "translation": "Answer: \"Good mindfulness that's associated with the faculty of sorrow is called good.",
        "source": "T26n1543_021:0868a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不善？",
        "translation": "How is it not good?",
        "source": "T26n1543_021:0868a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不善心所念諸憂根相應，是謂不善也。",
        "translation": "Answer: \"An unwholesome mind is mindful of the faculty of grief, which is called unwholesome.",
        "source": "T26n1543_021:0868a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾有報、幾無報乎？",
        "translation": "Regarding these twenty-two faculties, how much does it bring about as retribution and how much does it bring about as no retribution?",
        "source": "T26n1543_021:0868a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：一有報、十一無報、十當分別。",
        "translation": "Answer: \"One has retribution, eleven have no retribution, and ten should be discerned.",
        "source": "T26n1543_021:0868a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根、或有報或無報。",
        "translation": "The faculty of thought may have retribution or no retribution.",
        "source": "T26n1543_021:0868a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有報？",
        "translation": "How are there rewards?",
        "source": "T26n1543_021:0868a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不善、善有漏意根，是謂有報也。",
        "translation": "Answer: The contaminated mental faculty that's unwholesome and wholesome is called having retribution.",
        "source": "T26n1543_021:0868a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無報？",
        "translation": "How is it unrewarding?",
        "source": "T26n1543_021:0868a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無記無漏意根：是謂無報。",
        "translation": "Answer: The faculty of mind that's indeterminate and uncontaminated is called unrewarding.",
        "source": "T26n1543_021:0868a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根喜根護根亦復如是。",
        "translation": "*The pleasant faculty, joy faculty, and guard faculty are likewise.",
        "source": "T26n1543_021:0868a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦根，或有報或無報。",
        "translation": "The faculty of suffering may have retribution or no retribution.",
        "source": "T26n1543_021:0868a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有報？",
        "translation": "What is the reward?",
        "source": "T26n1543_021:0868a18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不善、善苦根，是謂有報。",
        "translation": "Answer: The root of unwholesome and wholesome suffering is called having retribution.",
        "source": "T26n1543_021:0868a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無報？",
        "translation": "How is it no retribution?",
        "source": "T26n1543_021:0868a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無記苦根，是謂無報。",
        "translation": "Answer: \"The faculty of indeterminate suffering is called unrewarding.",
        "source": "T26n1543_021:0868a19_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信根精進根念根定根慧根，諸有漏，彼有報；諸無漏，是謂無報。",
        "translation": "The faculty of faith, the faculty of effort, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom, which are contaminated, have rewards, and the uncontaminated ones are unrewarding.",
        "source": "T26n1543_021:0868a19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾見諦斷、幾思惟斷、幾無斷？",
        "translation": "Of these twenty-two faculties, how many are stopped by seeing the truth, how many are stopped by contemplating, and how many are not stopped?",
        "source": "T26n1543_021:0868a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：九思惟斷、三不斷、十當分別。",
        "translation": "Answer: \"Nine are stopped by contemplation, three are not stopped, and ten should be discerned.",
        "source": "T26n1543_021:0868a22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根，或見諦斷、或思惟斷、或不斷。",
        "translation": "The faculty of thought may see the truth and stop, contemplate and stop, or not stop.",
        "source": "T26n1543_021:0868a23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見諦斷乎？",
        "translation": "How are they stopped in the view of the truth?",
        "source": "T26n1543_021:0868a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸意根堅信堅法行忍斷。",
        "translation": "He answered, \"The faculty of the mind firmly believes in the Dharma and practices patience in stopping it.",
        "source": "T26n1543_021:0868a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見諦斷？",
        "translation": "What is it that is stopped by seeing the truth?",
        "source": "T26n1543_021:0868a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八十八使諸意根相應，是謂見諦斷也。",
        "translation": "These 88 causes are associated with the faculty of thought, which is called stopping the truth of views.",
        "source": "T26n1543_021:0868a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷？",
        "translation": "How is it stopped by contemplation?",
        "source": "T26n1543_021:0868a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學見迹思惟斷。",
        "translation": "The answer is: \"Students see the traces and stop thinking about them.",
        "source": "T26n1543_021:0868a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplated cessation?",
        "source": "T26n1543_021:0868a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十使諸意根相應，亦無染意根有漏，是謂思惟斷。",
        "translation": "These ten causes are associated with the mind faculty, and there are no contaminants in the mind faculty that are defiled, which is called stopping contemplation.",
        "source": "T26n1543_021:0868a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不斷？",
        "translation": "How is it not stopped?",
        "source": "T26n1543_021:0868a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏意根，是謂無斷。",
        "translation": "Answer: The uncontaminated mind faculty is uninterrupted.",
        "source": "T26n1543_021:0868a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護根亦如是。",
        "translation": "The guard faculty is likewise.",
        "source": "T26n1543_021:0868a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根，或見諦斷、或思惟斷、或不斷。",
        "translation": "The sense faculty of pleasure may be stopped in the seeing of truth, stopped in deliberation, or not stopped.",
        "source": "T26n1543_021:0868a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見諦斷耶？",
        "translation": "How is it stopped in the view of truth?",
        "source": "T26n1543_021:0868b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸樂根堅信堅法行忍斷。",
        "translation": "Answer: \"The faculties of pleasure are stopped by resolute faith, resolute practice, and forbearance of the Dharma.",
        "source": "T26n1543_021:0868b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見諦斷？",
        "translation": "What is it that is stopped by seeing the truth?",
        "source": "T26n1543_021:0868b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：二十八使諸樂根相應，是謂見諦斷也。",
        "translation": "Answer: The twenty-eight sense faculties that are associated with pleasure are called stopped by the truth of views.",
        "source": "T26n1543_021:0868b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷？",
        "translation": "How are they stopped by contemplation?",
        "source": "T26n1543_021:0868b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學見迹思惟斷。",
        "translation": "The answer is: \"Students see the traces and stop thinking about them.",
        "source": "T26n1543_021:0868b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplated cessation?",
        "source": "T26n1543_021:0868b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五使諸樂根相應，亦無染有漏樂根，是謂思惟斷。",
        "translation": "The five sense faculties that are associated with the sense faculties of pleasure and the absence of defiled, contaminated, and pleasurable faculties are termed stopped by contemplation.",
        "source": "T26n1543_021:0868b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不斷？",
        "translation": "How is it not stopped?",
        "source": "T26n1543_021:0868b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏樂根，是謂不斷也。",
        "translation": "Answer: The uncontaminated joyful faculty is said to be unceasing.",
        "source": "T26n1543_021:0868b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根，或見諦斷、或思惟斷、或不斷。",
        "translation": "The joy root is either stopped in the seeing truth, stopped in deliberation, or not stopped.",
        "source": "T26n1543_021:0868b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見諦斷？",
        "translation": "How is it stopped in the view of truth?",
        "source": "T26n1543_021:0868b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸喜根堅信堅法行忍斷。",
        "translation": "Answer: \"The faculty of joy is stopped by resolute faith, resolute practice, and forbearance in regard to the Dharma.",
        "source": "T26n1543_021:0868b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見諦斷？",
        "translation": "What is it that is stopped by seeing the truth?",
        "source": "T26n1543_021:0868b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十二使諸喜根相應，是謂見諦斷。",
        "translation": "These fifty-two causes are associated with the joy faculty, which is called stopping the truth of views.",
        "source": "T26n1543_021:0868b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷？",
        "translation": "How is it stopped by contemplation?",
        "source": "T26n1543_021:0868b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學見迹思惟斷。",
        "translation": "The answer is: \"Students see the traces and stop thinking about them.",
        "source": "T26n1543_021:0868b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplated cessation?",
        "source": "T26n1543_021:0868b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六使諸喜根相應，亦無染有漏喜根，是謂思惟斷。",
        "translation": "The six tendencies associated with the joy faculty and the absence of defiled, contaminated joy faculties are termed stopped by contemplation.",
        "source": "T26n1543_021:0868b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不斷乎？",
        "translation": "How is it not stopped?",
        "source": "T26n1543_021:0868b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏喜根，是謂不斷也。",
        "translation": "Answer: The uncontaminated joy faculty is said to be unceasing.",
        "source": "T26n1543_021:0868b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憂根，或見諦斷、或思惟斷。",
        "translation": "The grievance faculty is either stopped by seeing the truth or stopped by contemplation.",
        "source": "T26n1543_021:0868b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見諦斷、答曰：諸憂根堅信堅法行忍斷。",
        "translation": "How are they stopped in the view of the truth? Answer: The faculty of grief is stopped by resolute faith, resolute practice, and forbearance.",
        "source": "T26n1543_021:0868b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見諦斷？",
        "translation": "What is stopping in the view of truth?",
        "source": "T26n1543_021:0868b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六使諸憂根相應，是謂見諦斷。",
        "translation": "These sixteen causes are associated with the faculty of grief, which is called stopping the truth of views.",
        "source": "T26n1543_021:0868b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷乎？",
        "translation": "How is it stopped by contemplation?",
        "source": "T26n1543_021:0868b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學見迹思惟斷。",
        "translation": "The answer is: \"Students see the traces and stop thinking about them.",
        "source": "T26n1543_021:0868b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplated cessation?",
        "source": "T26n1543_021:0868b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二使諸憂根相應，亦無染憂根，是謂思惟斷。",
        "translation": "\"The two causes that are associated with the grievous faculties and the lack of defiled grievous faculties are stopped by contemplation.",
        "source": "T26n1543_021:0868b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信精進念定慧根，諸有漏，彼思惟斷；諸無漏，彼不斷。",
        "translation": "For the faculty of faith, effort, mindfulness, concentration, and wisdom, those are contaminants that are stopped by contemplation, and those are uncontaminated that aren't stopped by contemplation.",
        "source": "T26n1543_021:0868b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾見苦斷、幾見習盡道思惟斷、幾不斷？",
        "translation": "Of these twenty-two faculties, how many have seen suffering stopped, how many have seen the path to the end of accumulation stopped by contemplation, and how many have not stopped?",
        "source": "T26n1543_021:0868b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：九思惟斷、三不斷、十當分別。",
        "translation": "Answer: \"Nine are stopped by contemplation, three are not stopped, and ten should be discriminated.",
        "source": "T26n1543_021:0868b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根，或見苦斷、或見習盡道思惟斷、或不斷。",
        "translation": "The faculty of thought either sees suffering stopped, sees the path to the end of accumulation stopped by contemplation, or doesn't stop.",
        "source": "T26n1543_021:0868b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見苦斷？",
        "translation": "How is the view of suffering stopped?",
        "source": "T26n1543_021:0868b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸意根堅信堅法行忍斷。",
        "translation": "Answer: \"The faculty of mind firmly believes in the Dharma and practices patience in order to stop it.",
        "source": "T26n1543_021:0868b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見苦斷？",
        "translation": "What is it that stops seeing suffering?",
        "source": "T26n1543_021:0868b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十八使諸意根相應見習斷、十九使見盡斷、十九使見道斷、二十二使諸意根相應，是謂見諦斷也。",
        "translation": "The cessation of twenty-eight causes associated with the sense faculties, the cessation of nineteen causes that lead to the completion of views, the cessation of nineteen causes that lead to the path, and the cessation of twenty-two causes associated with the sense faculties are called the cessation of the truth of views.",
        "source": "T26n1543_021:0868b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷？",
        "translation": "What is cessation by contemplation?",
        "source": "T26n1543_021:0868b25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸意根學見迹思惟斷。",
        "translation": "Answer: \"The thinking faculty trains in the contemplation of traces of views and stops them.",
        "source": "T26n1543_021:0868b26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplation eliminated?",
        "source": "T26n1543_021:0868b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十使諸意根相應，亦無染有漏意根，是謂思惟斷也。",
        "translation": "These ten causes are associated with the mind faculty, and they are not tainted with contaminated mind faculties, which is called stopping contemplation.",
        "source": "T26n1543_021:0868b27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不斷？",
        "translation": "How is it not stopped?",
        "source": "T26n1543_021:0868b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏意根，是謂不斷。",
        "translation": "Answer: The uncontaminated mind faculty is said to be unceasing.",
        "source": "T26n1543_021:0868b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護根亦如是。",
        "translation": "The faculty of protection is likewise.",
        "source": "T26n1543_021:0868b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根，或見苦斷、或見習盡道思惟斷、或不斷。",
        "translation": "The pleasant faculty may see suffering stopped, or it may see the contemplation of the path to the end of accumulation stopped, or it may not stop.",
        "source": "T26n1543_021:0868b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見苦斷？",
        "translation": "How is the stopping of suffering viewed?",
        "source": "T26n1543_021:0868c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸樂根堅信堅法行忍斷。",
        "translation": "Answer: \"The faculty of pleasure is stopped by resolute faith, resolute practice, and forbearance of the Dharma.",
        "source": "T26n1543_021:0868c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見苦斷？",
        "translation": "What is it that stops seeing suffering?",
        "source": "T26n1543_021:0868c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九使諸樂根相應見習斷、六使見盡斷、六使見道斷、七使諸樂根相應，是謂見諦斷。",
        "translation": "Stopping nine causes associated with the sense faculties of pleasure, stopping six causes of seeing, stopping six causes of seeing the path, and stopping seven causes associated with the sense faculties of pleasure is called stopping the truth of views.",
        "source": "T26n1543_021:0868c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷乎？",
        "translation": "How is it stopped by contemplating?",
        "source": "T26n1543_021:0868c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學見迹思惟斷。",
        "translation": "The answer is: \"Students see the traces and stop thinking about them.",
        "source": "T26n1543_021:0868c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplated cessation?",
        "source": "T26n1543_021:0868c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五使諸樂根相應，亦無染有漏樂根，是謂思惟斷。",
        "translation": "The five sense faculties that are associated with the sense faculties of pleasure and the absence of defiled, contaminated, and pleasurable faculties are termed stopped by contemplation.",
        "source": "T26n1543_021:0868c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不斷？",
        "translation": "How is it not stopped?",
        "source": "T26n1543_021:0868c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏樂根，是謂不斷。",
        "translation": "Answer: The untainted faculty of pleasure is said to be incessant.",
        "source": "T26n1543_021:0868c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根，或見苦斷、或見習盡道思惟斷、或不斷。",
        "translation": "The joy root either sees the cessation of suffering, sees the cessation of contemplation of the path to the end of accumulation, or doesn't persist.",
        "source": "T26n1543_021:0868c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見苦斷耶？",
        "translation": "How is it stopping when you see suffering?",
        "source": "T26n1543_021:0868c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸喜根堅信堅法行忍斷。",
        "translation": "Answer: \"The faculty of joy is stopped by resolute faith, resolute practice, and forbearance in regard to the Dharma.",
        "source": "T26n1543_021:0868c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見苦斷？",
        "translation": "What is it that stops seeing suffering?",
        "source": "T26n1543_021:0868c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七使諸喜根相應見習斷、十一見盡斷、十一見道斷、十三使諸喜根相應，是謂見諦斷。",
        "translation": "The cessation of the seventeen tendencies associated with the joy faculty, the cessation of 11 views, the cessation of 11 paths of seeing, and the cessation of 13 tendencies associated with the joy faculty are called the cessation of the truth of seeing.",
        "source": "T26n1543_021:0868c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷？",
        "translation": "What is stopping by contemplation?",
        "source": "T26n1543_021:0868c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學見迹思惟斷。",
        "translation": "The answer is: \"Students see the traces and stop thinking about them.",
        "source": "T26n1543_021:0868c12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplated cessation?",
        "source": "T26n1543_021:0868c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六使諸喜根相應，亦無染有漏喜根，是謂思惟斷。",
        "translation": "The six tendencies associated with the joy faculty and the absence of defiled, contaminated joy faculties are termed stopped by contemplation.",
        "source": "T26n1543_021:0868c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不斷？",
        "translation": "How is it not stopped?",
        "source": "T26n1543_021:0868c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏喜根，是謂不斷。",
        "translation": "Answer: The uncontaminated joy faculty is said to be unceasing.",
        "source": "T26n1543_021:0868c14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憂根，或見苦斷、或見習盡道思惟斷。",
        "translation": "The grief root either sees the cessation of suffering or the cessation of contemplation of the path to the end of accumulation.",
        "source": "T26n1543_021:0868c15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見苦斷？",
        "translation": "How is the stopping of suffering viewed?",
        "source": "T26n1543_021:0868c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸憂根堅信堅法行忍斷。",
        "translation": "Answer: \"The faculty of sorrow is stopped by resolute faith and resolute practice of forbearance in regard to the Dharma.",
        "source": "T26n1543_021:0868c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者見苦斷？",
        "translation": "What is it that stops seeing suffering?",
        "source": "T26n1543_021:0868c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四使諸憂根相應見習斷、四見盡斷、四見道斷、四使憂根相應，是謂見諦斷。",
        "translation": "The four causes associated with the grievous faculties are the cessation of habituated views, the cessation of the four views that are ended, the cessation of the four paths of views, and the cessation of the four causes associated with the grievous faculties, which are called the cessation of the truth of views.",
        "source": "T26n1543_021:0868c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何思惟斷乎？",
        "translation": "How are they stopped by contemplation?",
        "source": "T26n1543_021:0868c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸學見迹思惟斷。",
        "translation": "The answer is: \"Students see the traces and stop thinking about them.",
        "source": "T26n1543_021:0868c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者思惟斷？",
        "translation": "What is contemplation of cessation?",
        "source": "T26n1543_021:0868c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二使諸憂根相應，亦無染憂根，是謂思惟斷。",
        "translation": "\"The two causes that are associated with the grievous faculties and the lack of defiled grievous faculties are stopped by contemplation.",
        "source": "T26n1543_021:0868c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信精進念定慧根，諸有漏，彼思惟斷；諸無漏，彼不斷。",
        "translation": "For the faculty of faith, effort, mindfulness, concentration, and wisdom, those are contaminants that are stopped by contemplation, and those are uncontaminated that aren't stopped.",
        "source": "T26n1543_021:0868c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾見、幾不見乎？",
        "translation": "How many of these twenty-two faculties are seen and how many are not seen?",
        "source": "T26n1543_021:0868c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：一見、十七不見、四當分別。",
        "translation": "Answer: One is seen, seventeen aren't seen, and four should be discerned.",
        "source": "T26n1543_021:0868c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧根，或見或不見。",
        "translation": "The faculty of wisdom either sees or doesn't see.",
        "source": "T26n1543_021:0868c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見？",
        "translation": "How do they see?",
        "source": "T26n1543_021:0868c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：盡智、無生智不攝意識身相應善慧是謂見。",
        "translation": "Answer: This is called views that are associated with good wisdom that doesn't include the body of consciousness from exhaustive knowledge and unborn knowledge.",
        "source": "T26n1543_021:0868c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不見耶？",
        "translation": "How can it not be seen?",
        "source": "T26n1543_021:0868c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：五識身相應善慧、盡智、無生智是謂不見。",
        "translation": "Answer: The good wisdom, exhaustive knowledge, and unborn knowledge associated with the five consciousness bodies are called not seen.",
        "source": "T26n1543_021:0868c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知根，或見或不見。",
        "translation": "When you don't know the faculties, they may be seen or not seen.",
        "source": "T26n1543_021:0868c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見？",
        "translation": "How are they seen?",
        "source": "T26n1543_021:0868c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：未知根攝慧是謂見。",
        "translation": "He replied, \"This is called seeing when you don't know the faculties that bring in wisdom.",
        "source": "T26n1543_021:0868c27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不見？",
        "translation": "How can it not be seen?",
        "source": "T26n1543_021:0868c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：未知根攝八根是謂不見。",
        "translation": "Answer: This is called not seeing the eight faculties when they're included in the unknown faculties.",
        "source": "T26n1543_021:0868c28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已知根亦如是。",
        "translation": "The faculty of knowing is likewise.",
        "source": "T26n1543_021:0868c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無知根，或見或不見。",
        "translation": "The faculty of no-knowledge may be seen or not seen.",
        "source": "T26n1543_021:0868c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見乎？",
        "translation": "How is it seen?",
        "source": "T26n1543_021:0868c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：盡智、無生智不攝無知根攝慧是謂見。",
        "translation": "He replied, \"Endowed wisdom and unborn wisdom that don't include the faculty of ignorance and collected wisdom are called views.",
        "source": "T26n1543_021:0869a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不見乎？",
        "translation": "How can it not be seen?",
        "source": "T26n1543_021:0869a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無知根攝八根、盡智、無生智是謂不見。",
        "translation": "Answer: The eight faculties included in the faculty of nescience, exhaustive knowledge, and unarisen knowledge are called not seeing.",
        "source": "T26n1543_021:0869a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾有覺有觀、幾無覺有觀、幾無覺無觀？",
        "translation": "Of these twenty-two faculties, how many have perception and contemplation, how many have no perception and contemplation, and how many have no perception and no contemplation?",
        "source": "T26n1543_021:0869a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：二有覺有觀、八無覺無觀、十二當分別。",
        "translation": "Answer: \"There are two ways to perceive with contemplation, eight ways to perceive without contemplation, and twelve ways to discern.",
        "source": "T26n1543_021:0869a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根，或有覺有觀、或無覺有觀、或無覺無觀。",
        "translation": "The mind faculty may have perception with contemplation, no perception with contemplation, or no perception without contemplation.",
        "source": "T26n1543_021:0869a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有覺有觀？",
        "translation": "How do they have perception and contemplation?",
        "source": "T26n1543_021:0869a06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有覺有觀心所念諸意根相應，是謂有覺有觀。",
        "translation": "Answer: When there's perception and contemplation, the mindfulness of the mind's faculties is associated with perception and contemplation.",
        "source": "T26n1543_021:0869a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無覺有觀？",
        "translation": "How is there contemplation without perception?",
        "source": "T26n1543_021:0869a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無覺有觀心所念諸意根相應，是謂無覺有觀。",
        "translation": "Answer: The mindfulness of the mental faculty that's associated with contemplation without perception is called contemplation without perception.",
        "source": "T26n1543_021:0869a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無覺無觀？",
        "translation": "How is there no perception and no contemplation?",
        "source": "T26n1543_021:0869a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無覺無觀心所念諸意根相應，是謂無覺無觀。",
        "translation": "Answer: \"The absence of perception and contemplation is associated with the mindfulness of the mental faculties, which is called the absence of perception and contemplation.",
        "source": "T26n1543_021:0869a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護根、信精進念定慧根、未知根已知根無知根亦復如是。",
        "translation": "The faculty of protection, the faculty of faith, effort, mindfulness, concentration, wisdom, the faculty of the unknowing, and the faculty of the known and the faculty of ignorance are likewise.",
        "source": "T26n1543_021:0869a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根，或有覺有觀、或無覺無觀。",
        "translation": "The sense faculty of pleasure may have perception and contemplation, or it may have no perception and no contemplation.",
        "source": "T26n1543_021:0869a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有覺有觀乎？",
        "translation": "How are there perception and contemplation?",
        "source": "T26n1543_021:0869a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有覺有觀心所念諸樂根相應，是謂有覺有觀。",
        "translation": "Answer: \"When there's perception and contemplation, the mind is mindful of the sense faculties of pleasure, which is called perception and contemplation.",
        "source": "T26n1543_021:0869a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無覺無觀？",
        "translation": "How is there no perception and no contemplation?",
        "source": "T26n1543_021:0869a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無覺無觀心所念樂根相應，是謂無覺無觀。",
        "translation": "Answer: The absence of perception and contemplation is associated with the mindfulness of the pleasure faculty, which is called the absence of perception and contemplation.",
        "source": "T26n1543_021:0869a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根亦如是。",
        "translation": "The joy faculty is likewise.",
        "source": "T26n1543_021:0869a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根喜根護根九根少入相應，苦根憂根六根少入相應。",
        "translation": "The pleasant faculty, joy faculty, guardian faculty, and nine faculties are associated with few entrances, and the painful faculty and six grievous faculties are associated with few entrances.",
        "source": "T26n1543_021:0869a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾欲界繫、幾色界繫、幾無色界繫、幾不繫乎？",
        "translation": "Of these 22 faculties, how many are bound to the desire realm, how many are bound to the form realm, how many are bound to the formless realm, and how many are not bound?",
        "source": "T26n1543_021:0869a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：四欲界繫、三不繫、十五當分別。",
        "translation": "Answer: \"There are four fetters of desire, three unfetters, and 15 that should be discerned.",
        "source": "T26n1543_021:0869a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根，或欲界繫或色界繫。",
        "translation": "The eye faculty is either bound to the desire realm or bound to the form realm.",
        "source": "T26n1543_021:0869a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何欲界繫？",
        "translation": "What's the fettering in the desire realm?",
        "source": "T26n1543_021:0869a20_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：欲界繫四大造諸眼根，是謂欲界繫。",
        "translation": "Answer: The four major eye-generating faculties that are bound to the desire realm are called bound to the desire realm.",
        "source": "T26n1543_021:0869a21_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何色界繫乎？",
        "translation": "What is the fettering of the form realm?",
        "source": "T26n1543_021:0869a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：色界繫四大造諸眼根，是謂色界繫。",
        "translation": "Answer: The four major eye faculties that are bound to the form realm create what's called the form realm binding.",
        "source": "T26n1543_021:0869a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻舌身根亦復如是。",
        "translation": "The auditory, nasal, lingual, and physical faculties are likewise.",
        "source": "T26n1543_021:0869a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根，或欲界繫、或色界繫、或無色界繫、或不繫。",
        "translation": "The sense faculty may be bound to the desire realm, bound to the form realm, bound to the formless realm, or not bound at all.",
        "source": "T26n1543_021:0869a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何欲界繫乎？",
        "translation": "What's the fettering in the desire realm?",
        "source": "T26n1543_021:0869a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：欲界繫心所念諸意根相應，是謂欲界繫。",
        "translation": "Answer: This is called the fetters of the desire realm that are associated with the mental faculties that are mindful of the fetters of the desire realm.",
        "source": "T26n1543_021:0869a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何色界繫乎？",
        "translation": "What is the fettering in the form realm?",
        "source": "T26n1543_021:0869a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：色界繫心所念諸意根相應，是謂色界繫。",
        "translation": "Answer: The mindfulness of the mental faculties that corresponds to the mind bound to the form realm is called the form realm binding.",
        "source": "T26n1543_021:0869a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無色界繫乎？",
        "translation": "How are they fetters in the formless realm?",
        "source": "T26n1543_021:0869a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無色界繫心所念諸意根相應，是謂無色界繫。",
        "translation": "Answer: \"The mindfulness of the mind faculties that corresponds to the mind that's bound to the formless realm is called being bound to the formless realm.",
        "source": "T26n1543_021:0869a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不繫乎？",
        "translation": "How is it not bound?",
        "source": "T26n1543_021:0869a29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏心所念諸意根相應，是謂不繫。",
        "translation": "Answer: \"The faculty of mindfulness of the uncontaminated mind that's associated with the mental faculty is called not tethered.",
        "source": "T26n1543_021:0869a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護根、信精進念定慧根亦復如是。",
        "translation": "The faculty of protection, faith, effort, mindfulness, concentration, and wisdom faculty are likewise.",
        "source": "T26n1543_021:0869b01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命根，或欲界繫、或色界繫、或無色界繫。",
        "translation": "Regarding the life root, it might be bound to the desire realm, the form realm, or the formless realm.",
        "source": "T26n1543_021:0869b02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何欲界繫乎？",
        "translation": "What's the fettering in the desire realm?",
        "source": "T26n1543_021:0869b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：欲界繫壽是謂欲界繫也。",
        "translation": "Answer: \"A life span bound to the desire realm is also bound to the desire realm.",
        "source": "T26n1543_021:0869b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何色界繫乎？",
        "translation": "What is the fettering in the form realm?",
        "source": "T26n1543_021:0869b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：色界繫壽是謂色界繫。",
        "translation": "Answer: A life span that's bound to the form realm is called a form-bound life span.",
        "source": "T26n1543_021:0869b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無色界繫？",
        "translation": "What is the fetter of the formless realm?",
        "source": "T26n1543_021:0869b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無色界繫壽是謂無色界繫。",
        "translation": "Answer: \"A life span that's bound to the formless realm is defined as bound to the formless realm.",
        "source": "T26n1543_021:0869b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根，或欲界繫、或色界繫、或不繫。",
        "translation": "The sense faculty of pleasure is either bound to the desire realm, bound to the form realm, or not bound at all.",
        "source": "T26n1543_021:0869b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何欲界繫？",
        "translation": "What is the fettering in the desire realm?",
        "source": "T26n1543_021:0869b07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：欲界繫心所念諸樂根相應，是謂欲界繫。",
        "translation": "Answer: This is called the fetters of the desire realm that are associated with the sense faculties of pleasure that are mindful of the fetters of the desire realm.",
        "source": "T26n1543_021:0869b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何色界繫乎？",
        "translation": "What is the fettering in the form realm?",
        "source": "T26n1543_021:0869b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：色界繫心所念諸樂根相應，是謂色界繫。",
        "translation": "Answer: \"Fettering in the form realm is associated with the mindfulness of the sense faculties of pleasure.",
        "source": "T26n1543_021:0869b09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何不繫乎？",
        "translation": "How is it not bound?",
        "source": "T26n1543_021:0869b10_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏心所念諸樂根相應，是謂不繫。",
        "translation": "Answer: The faculty of pleasure associated with mindfulness in the uncontaminated mind is called not tethered.",
        "source": "T26n1543_021:0869b10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根亦如是。",
        "translation": "The faculty of joy is likewise.",
        "source": "T26n1543_021:0869b11_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾因相應？",
        "translation": "Of these twenty-two faculties, how many causes are associated with them?",
        "source": "T26n1543_021:0869b11_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：十四。",
        "translation": "He answered, \"Fourteen.",
        "source": "T26n1543_021:0869b12_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾因不相應乎？",
        "translation": "How many causes are not associated with this?",
        "source": "T26n1543_021:0869b12_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：八。",
        "translation": "Answer: Eight.",
        "source": "T26n1543_021:0869b13_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾因相應、幾因不相應乎？",
        "translation": "How many causes are associated and how many are not associated?",
        "source": "T26n1543_021:0869b13_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：彼十四少因相應少因不相應。",
        "translation": "Answer: Those 14 are associated with few causes and few are not associated with causes.",
        "source": "T26n1543_021:0869b13_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾因不相應非不因相應？",
        "translation": "How many causes are not associated with each other and not associated with non-causes?",
        "source": "T26n1543_021:0869b14_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：彼十四少因不相應少因非不相應。",
        "translation": "Answer: \"Those 14 lesser causes are not associated with lesser causes, and the lesser causes are not unassociated.",
        "source": "T26n1543_021:0869b15_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此二十二根，幾共緣相緣乎？",
        "translation": "How many of these twenty-two faculties share the same cognitive object and associative object?",
        "source": "T26n1543_021:0869b16_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：十三少入。",
        "translation": "He answered, \"Thirteen are less likely to enter.",
        "source": "T26n1543_021:0869b17_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾不共緣相緣？",
        "translation": "How many distinctive cognitive connections do they share?",
        "source": "T26n1543_021:0869b17_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：一，十三少入。",
        "translation": "Answer: One, the thirteen lesser sense bases.",
        "source": "T26n1543_021:0869b17_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾共緣相緣不共緣相緣？",
        "translation": "How many shared cognitive and objective connections and distinct cognitive and objective connections?",
        "source": "T26n1543_021:0869b18_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：十三也。",
        "translation": "Answer: Thirteen.",
        "source": "T26n1543_021:0869b18_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾不共緣相緣非不共緣相緣？",
        "translation": "How many distinctive cognitive connections are distinctive and not distinctive cognitive connections?",
        "source": "T26n1543_021:0869b19_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：八也。",
        "translation": "Answer: \"Eight, too.",
        "source": "T26n1543_021:0869b19_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根此法，彼根非凡夫。",
        "translation": "The faculties are this way, and the other faculties are not ordinary people.",
        "source": "T26n1543_021:0869b20_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根凡夫，彼根非此法。",
        "translation": "The faculties are worldlings, and those faculties are not this thing.",
        "source": "T26n1543_021:0869b20_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色陰攝七根。",
        "translation": "The form aggregate incorporates seven faculties.",
        "source": "T26n1543_021:0869b21_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痛陰攝五根，三根少入。",
        "translation": "The aggregate of pain includes the five faculties, and the three faculties are little involved.",
        "source": "T26n1543_021:0869b21_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "想陰不攝根。",
        "translation": "The aggregate of perception doesn't include the faculties.",
        "source": "T26n1543_021:0869b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行陰攝六根，三根少入。",
        "translation": "The aggregate of volition collects the six faculties, and the three faculties enter sparingly.",
        "source": "T26n1543_021:0869b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識陰攝一根，三根少入。",
        "translation": "The aggregate of consciousness takes in one faculty, and the three faculties enter sparingly.",
        "source": "T26n1543_021:0869b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善根攝八持二入三陰。",
        "translation": "The good faculty takes in the eight faculties that support two entries into the three aggregates.",
        "source": "T26n1543_021:0869b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不善根攝八持二入二陰。",
        "translation": "The unwholesome faculty collects eight faculties, which enter two, and the two aggregates.",
        "source": "T26n1543_021:0869b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隱沒無記根攝六持二入二陰。",
        "translation": "The withdrawn indeterminate faculty takes in six faculties and two entries into the two aggregates.",
        "source": "T26n1543_021:0869b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不隱沒無記根攝十三持七入四陰。",
        "translation": "The root that's not hidden from indeterminate faculties takes in thirteen preparations and seven entries into the four aggregates.",
        "source": "T26n1543_021:0869b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根法攝十三持七入四陰。",
        "translation": "The faculties and dharmas that are withdrawn are the thirteenfold and sevenfold aggregates and the four aggregates.",
        "source": "T26n1543_021:0869b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無根法攝六持六入三陰。",
        "translation": "Rootless dharmas gather six faculties and six sense-fields that enter the three aggregates.",
        "source": "T26n1543_021:0869b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根無根法攝十八持十二入五陰。",
        "translation": "Rootless faculties gather eighteen faculties that enter the five aggregates and twelve faculties that enter the five aggregates.",
        "source": "T26n1543_021:0869b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根生根耶？",
        "translation": "How could it be that the faculties produce faculties?",
        "source": "T26n1543_021:0869b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It's produced.",
        "source": "T26n1543_021:0869b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根生不根？",
        "translation": "How could it be that the faculties are produced and not produced?",
        "source": "T26n1543_021:0869b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生。",
        "translation": "The answer is: \"Grown.",
        "source": "T26n1543_021:0869b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根生根不根？",
        "translation": "\"What are the causes, the faculties that arise, and the faculties that don't arise?",
        "source": "T26n1543_021:0869b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It's produced.",
        "source": "T26n1543_021:0869b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣不根生不根？",
        "translation": "How could it be that the root of non-generation is not produced?",
        "source": "T26n1543_021:0869b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It's produced.",
        "source": "T26n1543_021:0869c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣不根生根？",
        "translation": "How could it be that the faculties do not give rise to faculties?",
        "source": "T26n1543_021:0869c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It's produced.",
        "source": "T26n1543_021:0869c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣不根生根不根？",
        "translation": "How could it be that the faculties are not produced and the roots are not?",
        "source": "T26n1543_021:0869c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It also gives rise to.",
        "source": "T26n1543_021:0869c02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根不根生根？",
        "translation": "Why are the faculties produced and not the faculties produced?",
        "source": "T26n1543_021:0869c02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It's produced.",
        "source": "T26n1543_021:0869c03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根不根生不根？",
        "translation": "Could it be that the faculties are not faculties that are produced and not faculties?",
        "source": "T26n1543_021:0869c03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It's produced.",
        "source": "T26n1543_021:0869c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣根不根生根不根乎？",
        "translation": "Could it be that the faculties are not faculties, and the faculties are not faculties?",
        "source": "T26n1543_021:0869c04_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It also gives rise to...",
        "source": "T26n1543_021:0869c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣眼根生眼根？",
        "translation": "What is the reason the eye faculty gives rise to the eye faculty?",
        "source": "T26n1543_021:0869c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It also gives rise to...",
        "source": "T26n1543_021:0869c05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣眼根乃至生無知根？",
        "translation": "How could it be contingent on the eye faculty or even the faculty of nescience being produced?",
        "source": "T26n1543_021:0869c05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It's produced.",
        "source": "T26n1543_021:0869c06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣無知根生無知根乎？",
        "translation": "How could it be that the root of ignorance gives rise to the root of ignorance?",
        "source": "T26n1543_021:0869c06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生也。",
        "translation": "The answer is: \"It also gives rise to...",
        "source": "T26n1543_021:0869c07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗緣無知根生眼根乃至已知根？",
        "translation": "How could the faculty of ignorance give rise to the visual faculty or even the faculty of knowing?",
        "source": "T26n1543_021:0869c07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生(生竟)。",
        "translation": "Answer: birth (after birth).",
        "source": "T26n1543_021:0869c08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根，彼眼根因、增上；耳鼻舌身根、男根女根命根、苦根一增上；餘，緣、增上。",
        "translation": "Regarding the eye faculty, it's the cause and contributor of the eye faculty; the ear, nose, tongue, body faculty, male faculty, female faculty, life faculty, and pain faculty are all contributors; the others are conditions and contributors.",
        "source": "T26n1543_021:0869c08_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻舌根亦復如是。",
        "translation": "*The ear, nose, and tongue faculties are likewise.",
        "source": "T26n1543_021:0869c10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身根，彼身根因、增上；男根女根亦因、增上；命根、苦根、眼根耳鼻舌根一增上；餘，緣、增上(身竟)。",
        "translation": "For the body faculty, the body faculty causes and increases; the male and female faculties also cause and increase; the life faculty, the pain faculty, and the sense faculties of the eye and ear, nose, and tongue increase as one; the rest, conditions, and increase (after the body).",
        "source": "T26n1543_021:0869c10_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根，彼意根因、次第、緣、增上；命根八(五情男女命)因、增上；苦根，因、次第、增上，無緣；餘，因、次第、緣、增上。",
        "translation": "For the mind faculty, these faculties cause, sequence, condition, and increase; for the life faculty, the eight (five emotions and the lives of men and women) cause and increase; for the pain faculty, the cause, sequence, and increase have no condition; for the rest, the cause, sequence, condition, and increase.",
        "source": "T26n1543_021:0869c12_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根喜根護根、信精進念定慧根亦復如是。",
        "translation": "*The pleasant root, the joy root, the guard root, the faith, effort, mindfulness, concentration, and wisdom root are likewise.",
        "source": "T26n1543_021:0869c14_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女根，彼女根因、增上；男根、命根苦根、眼耳鼻舌根一增上；身根，因、增上；餘，緣、增上。",
        "translation": "For the female faculty, these female faculties are increased by cause; the male faculty, the life faculty, the pain faculty, and the sense faculties of the eyes, ears, nose, and tongue are increased by one; the body faculty is increased by cause and condition; and the remaining faculties are increased by condition.",
        "source": "T26n1543_021:0869c15_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "男根亦如是。",
        "translation": "The male faculty is likewise.",
        "source": "T26n1543_021:0869c17_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命根，彼命根因、增上；苦根、眼根耳鼻舌身根、男根女根一增上；餘，緣、增上。",
        "translation": "Regarding the vital root, it causes and increases the vital root; the painful root, the eye root, the ear, nose, tongue, and body root, and the male and female roots increase as one; the rest, they cause and increase.",
        "source": "T26n1543_021:0869c17_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦根，彼苦根因、增上，無緣、無次第；命根八，因、增上，無漏，緣、增上；樂根，因、緣、增上，無次第；餘，因、次第、緣、增上。",
        "translation": "The painful faculty has causes and contributes, without conditions or sequencing; the eight vital faculties have causes and contributors, are uncontaminated, and have conditions and contributors; the pleasure faculty has causes, contributors, and contributors, without sequencing; the rest have causes, sequencing, conditions, and contributors.",
        "source": "T26n1543_021:0869c19_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憂根，彼憂根因次第緣增上；命根八因、增上；苦根，因、次第、增上，無緣，無漏，緣、增上；餘，因、次第、緣、增上。",
        "translation": "The faculty of sorrow, which has causes, conditions, and increase in sequence; the eight life faculties, which have causes and increase in sequence; and the faculty of suffering, which has causes, conditions, increase in sequence, unconditioned, uncontaminated, conditioned, and increased in sequence; and the remaining, causes, conditions, increase in sequence.",
        "source": "T26n1543_021:0869c21_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知根，彼未知根因、次第、緣、增上；已知根，亦因、次第、緣、增上；無知根，因、緣、增上，無次第；命根八及苦根一增上；憂根，緣、增上；餘，因、次第、緣、增上。",
        "translation": "The unknown faculties have causes, causes, conditions, and conditions that increase; the known faculties also have causes, causes, conditions, and conditions that increase; the ignorant faculties have causes, conditions, and conditions that increase without precedence; the eight life faculties and the one painful faculty increase; the grievous faculty has conditions and conditions that increase; and the remaining faculties have causes, causes, conditions, and conditions that increase.",
        "source": "T26n1543_021:0869c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已知根，彼已知根因、次第、緣、增上；無知根，亦因、次第、緣、增上；命根八及苦根一增上；憂根未知根，緣、增上；餘，因、次第、緣、增上。",
        "translation": "The known faculty has causes, conditions, causes, and augmentations for the known faculty; the ignorant faculty also has causes, conditions, causes, and augmentations for the eight vital and painful faculties; the grief faculty has causes, conditions, and augmentations for the unknown faculty; and the remainder has causes, conditions, causes, and augmentations for the unknown faculty.",
        "source": "T26n1543_021:0869c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無知根，彼無知根因次第緣增上；命根八及苦根一增上；憂根未知根已知根，緣、增上；餘，因、次第、緣、增上。",
        "translation": "For the ignorant faculty, their ignorant faculty increases in cause and condition in sequence; the eight vital faculties and the one painful faculty increase; the unknown faculty of grief increases in condition and condition; and the remaining faculties increase in cause and condition in sequence.",
        "source": "T26n1543_021:0869c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二十二根品第二十七竟(梵本三百一十四首盧，秦四千四十二言)。",
        "translation": "End of the Twenty-two Stages Chapter 27 (Sanskrit text, 314 śloka; Qin, 4,442 verse).",
        "source": "T26n1543_021:0870a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿毘曇根犍度有跋渠第二",
        "translation": "Second Abhidharma-Gandhātu-Abhidharma-Varuṇa",
        "source": "T26n1543_021:0870a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受欲界有，幾根最初得行？",
        "translation": "How many faculties first attain activity when they experience existence in the desire realm?",
        "source": "T26n1543_021:0870a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受色無色界有，幾根最初得行？",
        "translation": "Which faculties first attain activity in the form and formless realms of sensation?",
        "source": "T26n1543_021:0870a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗欲界繫意所念法，曉了欲界曉了色無色界耶？",
        "translation": "\"Could it be that he's aware of the mental factors that bind the desire realm, and he's aware of the desire realm and the form and formless realms?",
        "source": "T26n1543_021:0870a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗色界繫意所念法，曉了色界曉了欲界無色界乎？",
        "translation": "\"How could he have known the form realm and the mental factors that bind the mind, and how could he have known the form realm and the desire realm and the formless realm?",
        "source": "T26n1543_021:0870a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗無色界繫意所念法，曉了無色界曉了欲界色界耶？",
        "translation": "\"Could it be that the mind is fixated on the dharmas of the formless realm, and knowing the formless realm, he knows the form realm of the desire realm?",
        "source": "T26n1543_021:0870a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了欲界，曉了幾根乎？",
        "translation": "Having understood the desire realm, how many faculties have you understood?",
        "source": "T26n1543_021:0870a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了色界無色界，曉了幾根耶？",
        "translation": "How many faculties have you learned about the form realm and the formless realm?",
        "source": "T26n1543_021:0870a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根曉了欲界？",
        "translation": "How many faculties have penetrated the desire realm?",
        "source": "T26n1543_021:0870a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根曉了色界無色界？",
        "translation": "\"How many faculties understand the form realm and the formless realm?",
        "source": "T26n1543_021:0870a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根取須陀洹果？",
        "translation": "How many faculties are necessary to attain the fruit of stream entry?",
        "source": "T26n1543_021:0870a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根取斯陀含、阿那含、阿羅漢果耶？",
        "translation": "How many faculties are there in taking the fruit of the once-returner, the once-returner, and the once-arhat?",
        "source": "T26n1543_021:0870a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取須陀洹果，已得須陀洹果，此根當言成就、當言不成就？",
        "translation": "\"When the faculties grasp the fruit of stream entry and have attained the fruit of stream entry, will these faculties be said to be accomplished or not accomplished?",
        "source": "T26n1543_021:0870a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取斯陀含、阿那含、阿羅漢果，已得阿羅漢果，此根當言成就、當言不成就？",
        "translation": "When the faculties attain the fruit of the once-returning, once-returning, and once-returning, will these faculties be called accomplished or not accomplished?",
        "source": "T26n1543_021:0870a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取須陀洹果，彼根為何繫結滅、彼根何果攝？",
        "translation": "\"When the faculties grasp the fruit of stream entry, what binding bonds do they eliminate and what fruit do they bring in?",
        "source": "T26n1543_021:0870a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取斯陀含、阿那含、阿羅漢果，彼根為何繫結滅、此根為何果攝？",
        "translation": "What are the fetters that cease for those faculties and what are the fruits that are included in this faculty?",
        "source": "T26n1543_021:0870a18_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取須陀洹果諸根棄，彼根為何繫結滅、此根何果攝？",
        "translation": "\"When the faculties that are the fruit of stream entry are abandoned, what binding bonds are extinguished in those faculties, and what fruit is included in these faculties?",
        "source": "T26n1543_021:0870a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取斯陀含、阿那含、阿羅漢果棄諸根，彼根為何繫結滅、此根何果攝？",
        "translation": "\"When one discards the faculties of taking the fruit of once-returning, non-returning, and arhatship, what binding does that faculty end and what fruit does it bring in?",
        "source": "T26n1543_021:0870a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取須陀洹果得諸根，彼根為何繫結滅、此根為何果攝？",
        "translation": "\"What are the faculties attained by apprehending the fruit of stream entry, what are the bonds that are bound to those faculties that are extinguished, and what are the fruits that are included in those faculties?",
        "source": "T26n1543_021:0870a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取斯陀含、阿那含、阿羅漢果得諸根，彼根為何繫結滅、此根為何果攝？",
        "translation": "Regarding the faculties attained by taking the fruit of the once-returner, non-returner, or arhat, what are the bonds that those faculties are bound to cease and what are the fruits that these faculties bring about?",
        "source": "T26n1543_021:0870a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根成就須陀洹，彼根為何繫結滅、此根為何果攝？",
        "translation": "\"When the faculties accomplish stream entry, what are the fetters that cease in those faculties and what are the fruits that are included in this faculty?",
        "source": "T26n1543_021:0870a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根成就斯陀含、阿那含、阿羅漢，彼根為何繫結滅、此根為何果攝？",
        "translation": "What binding bonds do those faculties accomplish in the once-returner, non-returner, and arhat, and what fruit does this faculty bring in?",
        "source": "T26n1543_021:0870a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根須陀洹結滅，此根為何繫結滅、此根為何果攝耶？",
        "translation": "\"What are the bonds that tie these faculties to the cessation of the stream, and what are the fruits that are included in these faculties?",
        "source": "T26n1543_021:0870a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根斯陀含、阿那含結滅，此根為何繫結滅、此根為何果攝？",
        "translation": "What are the fetters that cease in the sense organs of once-returner and once-returner, and what are the fruits that are included in those organs?",
        "source": "T26n1543_021:0870a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根須陀洹果攝，此根為何繫結滅耶？",
        "translation": "\"What are the roots that are included in the fruit of stream entry, and why are these roots tied up in bondage and ceased?",
        "source": "T26n1543_021:0870b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根斯陀含、阿那含、阿羅漢果攝，此根為何繫結滅？",
        "translation": "What are the roots that are included in the fruit of the once-returner, once-returner, and once-arhat, and why do these roots cease to be bound?",
        "source": "T26n1543_021:0870b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苦智，彼苦無漏智耶？",
        "translation": "\"What is the cognition of suffering that is untainted by suffering?",
        "source": "T26n1543_021:0870b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設苦無漏智，是苦智乎？",
        "translation": "Suppose there is untainted cognition of suffering, is this cognition of suffering?",
        "source": "T26n1543_021:0870b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸習智、盡智、道智是道無漏智耶？",
        "translation": "Is the knowledge of accumulation, the knowledge of extinction, and the knowledge of the path the uncontaminated knowledge of the path?",
        "source": "T26n1543_021:0870b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設是道無漏智，是道智耶？",
        "translation": "Suppose this is the untainted cognition of the path, is it the cognition of the path?",
        "source": "T26n1543_021:0870b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無漏根欲界繫緣，此根法智相應耶？",
        "translation": "What are the tethers of the desire realm for the uncontaminated faculties that are associated with this faculty's knowledge of phenomena?",
        "source": "T26n1543_021:0870b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設無漏根法智相應，彼根欲界繫緣？",
        "translation": "Suppose the untainted faculties are associated with the knowledge of phenomena, and their faculties are tied to the desire realm?",
        "source": "T26n1543_021:0870b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無漏根色無色界繫緣，此根未知智相應耶？",
        "translation": "Are the uncontaminated faculties connected to the form and formless realms, and this faculty is not associated with knowledge?",
        "source": "T26n1543_021:0870b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設諸無漏根未知智相應，彼根色無色界繫緣？",
        "translation": "Suppose there are uncontaminated faculties that are not associated with knowledge, and their faculties are tied to the form and formless realms?",
        "source": "T26n1543_021:0870b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法智，當言法智耶？",
        "translation": "\"Dharma cognition,\" should we say \"dharma cognition\"?",
        "source": "T26n1543_021:0870b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知智、知他人心智、等智、苦智習智盡智道智，當言有覺有觀耶、無覺有觀耶、無覺無觀耶？",
        "translation": "knowledge of the unknowing, knowledge of the minds of others, knowledge of equivalence, knowledge of the accumulation of suffering, and knowledge of the path to its completion, should you say that you have perception and contemplation, perception without perception and contemplation, or perception without perception and contemplation?",
        "source": "T26n1543_021:0870b10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當言樂根憙根護根、空無相無願相應耶？",
        "translation": "Should you say that it's associated with the pleasure faculty, the jury faculty, the guard faculty, emptiness, signlessness, and wishlessness?",
        "source": "T26n1543_021:0870b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當言欲界繫緣、當言色界無色界繫緣、當言不繫緣？",
        "translation": "Should it be said that it binds to the desire realm, should it be said that it binds to the form realm and formless realm, and should it be said that it doesn't bind?",
        "source": "T26n1543_021:0870b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知智亦復如是。",
        "translation": "This is also true of the cognition of the unknown.",
        "source": "T26n1543_021:0870b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等意解脫，當言得學根、得無學根耶？",
        "translation": "Is this the same kind of liberation that's described as attaining the faculty of training or the faculty of no-training?",
        "source": "T26n1543_021:0870b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無疑意解脫，當言得學根、得無學根乎？",
        "translation": "When there is no doubt about liberation, should we say that we have attained the faculty of training or the faculty of no-training?",
        "source": "T26n1543_021:0870b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切結盡，當言得學根、得無學根耶？",
        "translation": "When all the bonds are ended, should we say that we have attained the faculty of training or the faculty of no-training?",
        "source": "T26n1543_021:0870b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無礙道取須陀洹果證，此道當言法智相應？",
        "translation": "What is the path associated with the realization of stream entry by means of the unobstructed path, which should be called the knowledge of phenomena?",
        "source": "T26n1543_021:0870b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知智、知他人心智、等智、苦智習智盡智道智，當言有覺有觀耶、無覺有觀耶、無覺無觀耶？",
        "translation": "knowledge of the unknowing, knowledge of the minds of others, knowledge of equivalence, knowledge of the accumulation of suffering, and knowledge of the path to its completion, should you say that you have perception and contemplation, perception without perception and contemplation, or perception without perception and contemplation?",
        "source": "T26n1543_021:0870b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當言樂根相應？",
        "translation": "Should I say that it is associated with the faculty of pleasure?",
        "source": "T26n1543_021:0870b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根護根、空無相無願，當言欲界繫緣、當言色無色界繫緣、當言不繫緣？",
        "translation": "\"The faculty of joy, the faculty of protection, emptiness, signlessness, and wishlessness, should you say that they are conditioned by the desire realm, should you say that they are conditioned by the form and formless realms, and should you say that they are not conditioned by them?",
        "source": "T26n1543_021:0870b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無礙道取斯陀含、阿那含、阿羅漢果證，此道當言法智相應？",
        "translation": "In order to realize the fruit of the once-returner, non-returner, or arhat by following the unobstructed path, should this path be said to be associated with the knowledge of phenomena?",
        "source": "T26n1543_021:0870b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知智、知他人心智、等智、苦智習智盡智道智，當言有覺有觀耶、無覺有觀耶、無覺無觀耶？",
        "translation": "knowledge of the unknowing, knowledge of the minds of others, knowledge of equivalence, knowledge of the accumulation of suffering, and knowledge of the path to its completion, should you say that you have perception and contemplation, perception without perception and contemplation, or perception without perception and contemplation?",
        "source": "T26n1543_021:0870b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當言樂根相應耶？",
        "translation": "Should I say that it's associated with the faculty of pleasure?",
        "source": "T26n1543_021:0870b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根護根、空無相無願，當言欲界繫緣耶、當言色無色界繫緣、當言不繫緣？",
        "translation": "\"The faculty of joy, the faculty of protection, emptiness, signlessness, and wishlessness, should you say that they are conditioned by the desire realm, should you say that they are conditioned by the form and formless realms, or should you say that they are not conditioned by them?",
        "source": "T26n1543_021:0870b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根斷盡起，當言得須陀洹果耶？",
        "translation": "How many faculties have been completely eliminated and produced, and how would you say you have attained the fruit of stream entry?",
        "source": "T26n1543_021:0870b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根斷盡起，當言得斯陀含、阿那含、阿羅漢果耶？",
        "translation": "How many faculties are eliminated and produced, which are said to attain the fruit of once-returning, non-returning, or arhatship?",
        "source": "T26n1543_021:0870b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此章義願具演說。",
        "translation": "I would like to explain the full meaning of this chapter.",
        "source": "T26n1543_021:0870c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受欲界有，幾根最初得行？",
        "translation": "\"How many faculties first attain fulfillment when they experience existence in the desire realm?",
        "source": "T26n1543_021:0870c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：卵生胎生合會生二：身根、命根也，化生或六七八，無形六，一形七，二形八。",
        "translation": "Answer: Eggs are born, womb is born, and two things are produced together: the body root and life root, and birth by transformation, which can be six, seven, or eight, six formless, seven in one form, or eight in two forms.",
        "source": "T26n1543_021:0870c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受色界有，幾根最初得行？",
        "translation": "Which faculties first attain activity in the form realm of sensation?",
        "source": "T26n1543_021:0870c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：六。",
        "translation": "Answer: Six.",
        "source": "T26n1543_021:0870c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受無色界有，幾根最初得行耶？",
        "translation": "Regarding sensation in the formless realm, how many faculties first attain volitional activity?",
        "source": "T26n1543_021:0870c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：一。",
        "translation": "Answer: One.",
        "source": "T26n1543_021:0870c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗欲界繫心所念法，曉了欲界乎？",
        "translation": "How would you understand the mental factors that bind the mind to the desire realm?",
        "source": "T26n1543_021:0870c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不曉了。",
        "translation": "Answer: \"I don't understand it.",
        "source": "T26n1543_021:0870c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了色界無色界耶？",
        "translation": "Have you understood the form realm and the formless realm?",
        "source": "T26n1543_021:0870c08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不曉了。",
        "translation": "Answer: \"I don't understand.",
        "source": "T26n1543_021:0870c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗色界繫心所念法，曉了色界乎？",
        "translation": "How would you understand the mindfulness of the mind that's tethered to the form realm?",
        "source": "T26n1543_021:0870c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：曉了。",
        "translation": "Answer: \"I've understood it.",
        "source": "T26n1543_021:0870c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了欲界耶？",
        "translation": "Have you understood the desire realm?",
        "source": "T26n1543_021:0870c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：曉了。",
        "translation": "The answer was, \"I see.",
        "source": "T26n1543_021:0870c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了無色界乎？",
        "translation": "Have you understood the formless realm?",
        "source": "T26n1543_021:0870c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不曉了。",
        "translation": "Answer: \"I don't understand it.",
        "source": "T26n1543_021:0870c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗無色界繫心所念法，曉了無色界乎？",
        "translation": "How could it be that the mind is tethered to the mind in the formless realm, and how well do you understand the formless realm?",
        "source": "T26n1543_021:0870c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：曉了。",
        "translation": "He replied, \"I see.",
        "source": "T26n1543_021:0870c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了欲界乎？",
        "translation": "Have you understood the desire realm?",
        "source": "T26n1543_021:0870c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不曉了。",
        "translation": "The answer is: \"I don't understand.",
        "source": "T26n1543_021:0870c12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了色界乎？",
        "translation": "Have you understood the form realm?",
        "source": "T26n1543_021:0870c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：曉了。",
        "translation": "The answer is: \"I've understood it.",
        "source": "T26n1543_021:0870c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了欲界，為曉了幾根乎？",
        "translation": "Having understood the desire realm, how many faculties does it mean to understand?",
        "source": "T26n1543_021:0870c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：四(男女憂苦)。",
        "translation": "Answer: Four (grieves and sufferings of men and women).",
        "source": "T26n1543_021:0870c14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了色界，為曉了幾根耶？",
        "translation": "How many faculties does knowing the form realm mean knowing?",
        "source": "T26n1543_021:0870c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：五(五情)。",
        "translation": "Answer: The five (five emotions).",
        "source": "T26n1543_021:0870c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了無色界，為曉了幾根乎？",
        "translation": "Having understood the formless realm, how many faculties does it mean to understand?",
        "source": "T26n1543_021:0870c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：八(五根意命護也)。",
        "translation": "Answer: Eight (the five faculties guard life as well as mind).",
        "source": "T26n1543_021:0870c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根曉了欲界乎？",
        "translation": "How many faculties understand the desire realm?",
        "source": "T26n1543_021:0870c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：凡夫人七(五根意護)，無垢人八(加已知也)。",
        "translation": "Answer: Seven for ordinary people (five faculties of mindfulness) and eight for the unsullied (plus known).",
        "source": "T26n1543_021:0870c16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根曉了色界乎？",
        "translation": "How many faculties do you know about the form realm?",
        "source": "T26n1543_021:0870c17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：凡夫人七，無垢人十(加樂喜也)。",
        "translation": "Answer: Seven for ordinary people and ten for the unsullied (plus joy).",
        "source": "T26n1543_021:0870c18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根曉了無色界耶？",
        "translation": "How many faculties do you know about the formless realm?",
        "source": "T26n1543_021:0870c18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：十一(加無知)。",
        "translation": "Answer: Eleven (plus ignorance).",
        "source": "T26n1543_021:0870c19_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根取須陀洹果乎？",
        "translation": "How many faculties will attain the fruit of stream entry?",
        "source": "T26n1543_021:0870c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：九(意護未知已知五根)。",
        "translation": "Answer: Nine (the five faculties of known intention and unknown protection).",
        "source": "T26n1543_021:0870c20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根取斯陀含果乎？",
        "translation": "How many faculties will attain the fruit of once-returning?",
        "source": "T26n1543_021:0870c20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若倍欲盡越次取證九；若得須陀洹果，以世俗道取斯陀含果七，無漏八。",
        "translation": "Answer: If he doubles his desire and goes beyond the next, he'll realize nine; if he attains the fruit of stream entry, he'll take the fruit of once-returning by way of the secular path, seven, and the uncontaminated eight.",
        "source": "T26n1543_021:0870c20_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根取阿那含果？",
        "translation": "To what faculties is the fruit of non-returning obtained?",
        "source": "T26n1543_021:0870c22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若欲愛盡越次取證九；若得斯陀含果，以世俗道取阿那含果七，無漏八。",
        "translation": "Answer: \"If they want to end craving, they'll go on to realize nine; if they attain the fruit of once-returning, they'll take the fruit of non-returning by way of the secular path, seven, and the uncontaminated eight.",
        "source": "T26n1543_021:0870c23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根取阿羅漢果乎？",
        "translation": "To what faculties would the fruit of the arhat be attained?",
        "source": "T26n1543_021:0870c24_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：十一(數皆如上)。",
        "translation": "Answer: Eleven (the numbers are as above).",
        "source": "T26n1543_021:0870c25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取須陀洹果，已得須陀洹果，當言成就此根不成就乎？",
        "translation": "After realizing the fruit of stream entry and attaining the fruit of stream entry, should you say that this root is accomplished and not accomplished?",
        "source": "T26n1543_021:0870c25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無礙道不成就，解脫道成就也。",
        "translation": "Answer: \"The unobstructed path isn't accomplished, but the path to liberation is accomplished.",
        "source": "T26n1543_021:0870c27_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取斯陀含阿那含阿羅漢果，已得阿羅漢果，當言成就此根不成就乎？",
        "translation": "Should it be said that the faculties that attain the fruit of the arhat in once-returning and non-returning have accomplished the fruit of the arhat?",
        "source": "T26n1543_021:0870c27_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無礙道不成就，解脫道成就。",
        "translation": "Answer: The unobstructed path isn't accomplished, but the path to liberation is accomplished.",
        "source": "T26n1543_021:0870c29_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取須陀洹果，此根為何繫結滅乎？",
        "translation": "When the faculties attain the fruit of stream entry, why do these faculties become untied and cease?",
        "source": "T26n1543_021:0871a01_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或色界繫、或無色界繫、或無處所。",
        "translation": "Answer: Either they are fettered in the form realm, or they are fettered in the formless realm, or they have no place.",
        "source": "T26n1543_021:0871a02_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取斯陀含果、阿那含果，此根為何繫結滅？",
        "translation": "When the faculties grasp the fruit of once-returning or the fruit of non-returning, what are the fetters of these faculties destroyed?",
        "source": "T26n1543_021:0871a03_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或欲界繫、或色無色界繫、或無處所。",
        "translation": "Answer: Either they are bound to the desire realm, the form and formless realms, or nowhere.",
        "source": "T26n1543_021:0871a04_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取阿羅漢果，此根何繫結滅耶？",
        "translation": "Which of these faculties will cause the fetters to end when they attain the fruit of the arhat?",
        "source": "T26n1543_021:0871a05_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或無色界繫、或無處所。",
        "translation": "Answer: Either they are bound to the formless realm or they have no place.",
        "source": "T26n1543_021:0871a06_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取須陀洹果，此根何果攝乎？",
        "translation": "What fruit is included in the faculties that take on the fruit of stream entry?",
        "source": "T26n1543_021:0871a06_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：須陀洹果或無處所。",
        "translation": "Answer: \"The fruit of stream entry may have no place.",
        "source": "T26n1543_021:0871a07_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取斯陀含果，此根何果攝耶？",
        "translation": "The faculties take on the fruit of once-returning, so what fruit does this faculty take on?",
        "source": "T26n1543_021:0871a08_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：斯陀含果或無處所。",
        "translation": "Answer: \"The fruit of once-returning may have no place.",
        "source": "T26n1543_021:0871a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取阿那含果，此根何果攝？",
        "translation": "The faculties take on the fruit of non-returning, so what fruit does this faculty take on?",
        "source": "T26n1543_021:0871a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：阿那含果或無處所。",
        "translation": "Answer: The fruit of non-returning may have no place.",
        "source": "T26n1543_021:0871a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根取阿羅漢果，此根何果攝？",
        "translation": "The faculties take on the fruit of arhatship, so what fruit is included in this faculty?",
        "source": "T26n1543_021:0871a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：阿羅漢果或無處所。",
        "translation": "Answer: \"The fruit of the arhat may not have a place.",
        "source": "T26n1543_021:0871a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取須陀洹果棄諸根，此根為何繫結滅乎？",
        "translation": "When he takes the fruit of stream entry and discards his faculties, what are the bonds that tie him to these faculties and why do they cease?",
        "source": "T26n1543_021:0871a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或欲界繫、或色無色界繫、或無處所。",
        "translation": "Answer: Either they are bound to the desire realm, the form and formless realms, or nowhere.",
        "source": "T26n1543_021:0871a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取斯陀含阿那含果棄諸根，此根為何繫結滅？",
        "translation": "When he discards the faculties as the fruit of the once-returning nonreturning, what are the fetters of these faculties that are destroyed?",
        "source": "T26n1543_021:0871a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或欲界繫、或色無色界繫、或無處所。",
        "translation": "Answer: Either they're fetters in the desire realm, form and formless realms, or nowhere.",
        "source": "T26n1543_021:0871a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取阿羅漢果棄諸根，此根為何繫結滅？",
        "translation": "When he discards his faculties in order to attain the fruit of the arhat, what are the bonds that bind these faculties to extinction?",
        "source": "T26n1543_021:0871a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或色界繫、或無色界繫、或無處所。",
        "translation": "Answer: Either they're bound to the form realm, the formless realm, or nowhere.",
        "source": "T26n1543_021:0871a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取須陀洹果棄諸根，此根為何果攝？",
        "translation": "What is the fruit of taking streams and discarding the faculties, and what fruit are these faculties included in?",
        "source": "T26n1543_021:0871a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無處所。",
        "translation": "The answer is: \"There's no place.",
        "source": "T26n1543_021:0871a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取斯陀含果棄諸根，此根為何果攝？",
        "translation": "What is the result of taking the fruit of once-returning and discarding the faculties, and what is the result of taking these faculties?",
        "source": "T26n1543_021:0871a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：須陀洹果或無處所。",
        "translation": "Answer: \"There may be no place for the fruit of stream entry.",
        "source": "T26n1543_021:0871a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取阿那含果棄諸根，此根為何果攝？",
        "translation": "What is the result of taking the fruit of non-returning and discarding the faculties, and what is the result of taking these faculties in?",
        "source": "T26n1543_021:0871a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：斯陀含果或無處所。",
        "translation": "Answer: \"The fruit of once-returning may have no place.",
        "source": "T26n1543_021:0871a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取阿羅漢果棄諸根，此根為何果攝？",
        "translation": "What is the result of taking the arhatship and discarding the faculties, and what is the result of taking these faculties?",
        "source": "T26n1543_021:0871a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：阿那含果或無處所。",
        "translation": "Answer: \"The fruit of non-returning may have no place.",
        "source": "T26n1543_021:0871a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取須陀洹果獲諸根，此根為何繫結滅？",
        "translation": "What are the faculties obtained by apprehending the fruit of stream entry, and what are the bonds that bind these faculties to extinction?",
        "source": "T26n1543_021:0871a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無處所。",
        "translation": "The answer is: \"There's no place.",
        "source": "T26n1543_021:0871a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取斯陀含、阿那含、阿羅漢果獲諸根，此根為何繫結滅？",
        "translation": "What are the faculties obtained by taking the fruit of the once-returner, non-returner, and arhat, and what are the bonds that tie them together and cease?",
        "source": "T26n1543_021:0871a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無處所。",
        "translation": "The answer is: There's no place.",
        "source": "T26n1543_021:0871a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取須陀洹果獲諸根，此根為何果攝？",
        "translation": "What are the faculties obtained by apprehending the fruit of stream entry, and what fruit are these faculties included?",
        "source": "T26n1543_021:0871a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：須陀洹果。",
        "translation": "Answer: \"The fruit of stream entry.",
        "source": "T26n1543_021:0871a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取斯陀含、阿那含、阿羅漢果獲諸根，此根為何果攝？",
        "translation": "What are the faculties obtained by taking the fruit of the once-returner, non-returner, or arhat, and what fruit does this faculty incorporate?",
        "source": "T26n1543_021:0871a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：阿羅漢果。",
        "translation": "Answer: \"The fruit of the arhat.",
        "source": "T26n1543_021:0871a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須陀洹成就諸根，此根為何繫結滅？",
        "translation": "What are the roots accomplished by the stream-winner, and what are the bonds that tie him to the cessation of these roots?",
        "source": "T26n1543_021:0871a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或欲界繫或無處所。",
        "translation": "Answer: Either they're bound to the desire realm or they have no place.",
        "source": "T26n1543_021:0871a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯陀含成就諸根，此根為何繫結滅？",
        "translation": "What are the roots that are accomplished in the sakṛd-āgāmin, and what are the roots that are bound to extinction?",
        "source": "T26n1543_021:0871b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或欲界繫或無處所。",
        "translation": "Answer: Either they're bound to the desire realm or to nowhere.",
        "source": "T26n1543_021:0871b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿那含成就諸根，此根為何繫結滅？",
        "translation": "What are the faculties accomplished in the nonreturner, and why are these faculties bound to extinction?",
        "source": "T26n1543_021:0871b02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或色界繫、或無色界繫、或無處所。",
        "translation": "Answer: Either it's a fetter in the form realm, a fetter in the formless realm, or nowhere.",
        "source": "T26n1543_021:0871b03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿羅漢成就諸根，此根為何繫結滅？",
        "translation": "What are the tethers of the faculties accomplished by the arhat, and what are the tethers of these faculties that are extinguished?",
        "source": "T26n1543_021:0871b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無處所也。",
        "translation": "The answer is: There's no place for it.",
        "source": "T26n1543_021:0871b05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須陀洹成就諸根，此根為何果攝？",
        "translation": "What are the fruits of the faculties accomplished by the stream-winner?",
        "source": "T26n1543_021:0871b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或須陀洹果或無處所。",
        "translation": "Answer: Either the fruit of stream entry or nowhere.",
        "source": "T26n1543_021:0871b06_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯陀含、阿那含、阿羅漢成就諸根，此根為何果攝？",
        "translation": "What are the fruits of the faculties accomplished by the sakṛdhas, nonreturners, and arhats that are included in this result?",
        "source": "T26n1543_021:0871b06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：阿羅漢果或無處所。",
        "translation": "Answer: The fruit of the arhat may not have a place.",
        "source": "T26n1543_021:0871b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根須陀洹結滅，此根為何繫結滅？",
        "translation": "What are the bonds that bind this faculty to the cessation of the stream of streams?",
        "source": "T26n1543_021:0871b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：欲界繫也。",
        "translation": "Answer: \"They're also bound to the desire realm.",
        "source": "T26n1543_021:0871b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根斯陀含結滅，此根為何繫結滅？",
        "translation": "What are the fetters of the sense faculties that are bound to the sthāgatas and why are the fetters of this faculty terminated?",
        "source": "T26n1543_021:0871b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：欲界繫也。",
        "translation": "Answer: \"They're also bound to the desire realm.",
        "source": "T26n1543_021:0871b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根阿那含結滅，此根為何繫結滅？",
        "translation": "What are the tethers of the sense faculties that are bound to the nonreturner, and why are the tethers of this faculty terminated?",
        "source": "T26n1543_021:0871b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或色無色界繫也。",
        "translation": "Answer: Perhaps they're bound to the form and formless realms.",
        "source": "T26n1543_021:0871b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根須陀洹結滅，此根為何果攝？",
        "translation": "What is the result of the cessation of the stream of streams and what is the result of the cessation of the streams?",
        "source": "T26n1543_021:0871b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無處所也。",
        "translation": "Answer: There's no place for it.",
        "source": "T26n1543_021:0871b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根斯陀含、阿那含結滅，此根為何果攝？",
        "translation": "What is the fruit of the cessation of the bonds of once-returner and once-returner in the sense that these faculties are included?",
        "source": "T26n1543_021:0871b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無處所也。",
        "translation": "Answer: There's no place for it.",
        "source": "T26n1543_021:0871b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根須陀洹果攝，此根為何繫結滅？",
        "translation": "What are the senses that are included in the fruit of stream entry, and why are these senses bound to extinction?",
        "source": "T26n1543_021:0871b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無處所也。",
        "translation": "Answer: There's no place for it.",
        "source": "T26n1543_021:0871b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根斯陀含、阿那含、阿羅漢果攝，此根為何繫結滅？",
        "translation": "What are the sense faculties that are included in the fruit of the once-returner, once-returner, and once-arhat, and why are these faculties bound to extinction?",
        "source": "T26n1543_021:0871b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰。",
        "translation": "They replied.",
        "source": "T26n1543_021:0871b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無處所也。",
        "translation": "\"There's no place for it.",
        "source": "T26n1543_021:0871b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸苦智是苦無漏智乎？",
        "translation": "Is the knowledge of suffering the untainted knowledge of suffering?",
        "source": "T26n1543_021:0871b17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是，諸苦智是苦無漏智也。",
        "translation": "Answer: \"So it is, the knowledge of suffering is the uncontaminated knowledge of suffering.",
        "source": "T26n1543_021:0871b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗苦無漏智非苦智乎？",
        "translation": "Could it be that untainted cognition of suffering is not cognition of suffering?",
        "source": "T26n1543_021:0871b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有，諸苦習智也。",
        "translation": "Answer: \"Yes, there is the knowledge of the accumulation of suffering.",
        "source": "T26n1543_021:0871b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸習智彼是習無漏智乎？",
        "translation": "Is this knowledge of accumulation the untainted knowledge of accumulation?",
        "source": "T26n1543_021:0871b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是，諸習智彼是習無漏智也。",
        "translation": "Answer: \"So it is, the knowledge of accumulation and this is the knowledge of accumulation and the uncontaminated knowledge.",
        "source": "T26n1543_021:0871b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗習無漏智彼非習智乎？",
        "translation": "Could it be that this is cultivated uncontaminated cognition and that it's not cultivated cognition?",
        "source": "T26n1543_021:0871b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有，諸習苦智也。",
        "translation": "Answer: \"Yes, there is the cognition of accumulated suffering.",
        "source": "T26n1543_021:0871b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸盡智彼是盡無漏智乎？",
        "translation": "Is this cognition of the end of all accumulation the untainted cognition?",
        "source": "T26n1543_021:0871b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是。",
        "translation": "Answer: So it is.",
        "source": "T26n1543_021:0871b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設盡無漏智，彼是盡智？",
        "translation": "Suppose someone has full and uncontaminated cognition, is this full cognition?",
        "source": "T26n1543_021:0871b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是。",
        "translation": "Answer: So it is.",
        "source": "T26n1543_021:0871b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸道智，彼是道無漏智乎？",
        "translation": "Is this untainted cognition of the path, knowledge of the paths?",
        "source": "T26n1543_021:0871b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是。",
        "translation": "Answer: So it is.",
        "source": "T26n1543_021:0871b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設道無漏智，彼是道智？",
        "translation": "Suppose there's untainted cognition of the path, and this is cognition of the path?",
        "source": "T26n1543_021:0871b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是。",
        "translation": "Answer: \"So it is.",
        "source": "T26n1543_021:0871b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏諸根欲界繫緣，此根法智相應乎？",
        "translation": "What are the tethers of the untainted faculties in the desire realm that are associated with this faculty's knowledge of phenomena?",
        "source": "T26n1543_021:0871b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或無漏根欲界繫緣，此根非法智相應。",
        "translation": "Answer: \"Perhaps the uncontaminated faculties are tethered to the desire realm, and this faculty isn't associated with unintelligence.",
        "source": "T26n1543_021:0871b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根欲界繫緣此根非法智相應乎？",
        "translation": "How are these uncontaminated roots tethered to the desire realm and these roots associated with unlawful cognition?",
        "source": "T26n1543_021:0871b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：苦法忍彼相應根，苦法智、習法忍彼相應根，習法智，是謂無漏根欲界繫緣此根非法智相應也。",
        "translation": "Answer: \"The faculties associated with the tolerance of painful qualities, the cognition of painful qualities, the faculties associated with the tolerance of accumulated qualities, and the cognition of accumulated qualities are the uncontaminated faculties that are tied to the desire realm and are not associated with noncognition.",
        "source": "T26n1543_021:0871b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根法智相應此根非欲界繫緣？",
        "translation": "How is this faculty associated with knowledge of the Dharma of the uncontaminated faculties not a condition tied to the desire realm?",
        "source": "T26n1543_021:0871c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸根緣盡、緣道法智相應，是謂無漏根法智相應此根非欲界繫緣。",
        "translation": "Answer: \"When the conditions of the faculties are ended and the cognition of the path is associated with them, this is called the correspondence of the uncontaminated faculties and the cognition of the Dharma that's not the fettering condition of the desire realm.",
        "source": "T26n1543_021:0871c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根欲界繫緣彼根法智相應？",
        "translation": "How are the untainted faculties tethered to the desire realm and associated with the cognition of the Dharma of those faculties?",
        "source": "T26n1543_021:0871c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸根緣苦、緣習法智相應，是謂無漏根欲界繫緣彼根法智相應。",
        "translation": "Answer: \"The faculties conditioned by suffering and conditioned by the cognition of principles are associated with the uncontaminated faculties that are fettered in the desire realm and are associated with the cognition of principles in that realm.",
        "source": "T26n1543_021:0871c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根非欲界繫緣非法智相應乎？",
        "translation": "How are the untainted faculties not tied to the desire realm and associated with noncognition of what's not the case?",
        "source": "T26n1543_021:0871c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：苦未知忍、苦未知智彼相應根，習未知忍、習未知智彼相應根，盡法忍彼相應根，盡法智、盡未知忍、盡未知智彼相應根，道法忍彼相應根，道法智、道未知忍、道未知智彼相應根，是謂無漏根此根非欲界繫緣彼根非法智相應。",
        "translation": "Answer: \"The faculties that are associated with the tolerance of suffering as unknown and the knowledge of suffering as unknown, the faculties that are associated with the tolerance of accumulation as unknown and the knowledge of accumulation as unknown, the faculties that are associated with the tolerance of ending dharmas, the faculties that are associated with the knowledge of ending dharmas, the tolerance of ending the unknown, the knowledge of ending the unknown, the faculties that are associated with the tolerance of the path as unknown, and the faculties that are associated with the knowledge of the path as unknown are the uncontaminated faculties that aren't tied to the desire realm and are associated with the faculties that aren't cognition.",
        "source": "T26n1543_021:0871c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無漏根色無色界繫緣，彼根未知智相應乎？",
        "translation": "Are the uncontaminated faculties connected to the form and formless realms and the faculties associated with cognition unknown to those faculties?",
        "source": "T26n1543_021:0871c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或無漏根色無色界繫緣，彼根非未知智相應。",
        "translation": "Answer: \"Perhaps an uncontaminated root is tethered to the form and formless realms, and that root is not associated with an unknown cognition.",
        "source": "T26n1543_021:0871c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根色無色界繫緣彼根非未知智相應乎？",
        "translation": "How are those uncontaminated faculties tethered to the form and formless realms and those faculties not associated with unknown cognition?",
        "source": "T26n1543_021:0871c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：苦未知忍彼相應根，苦未知智、習未知忍彼相應根，習未知智，是謂無漏根色無色界繫緣彼根非未知智相應也。",
        "translation": "Answer: \"The faculties associated with the tolerance of what's unknown, the cognition of what's unknown to suffering, the faculty associated with the tolerance of what's unknown to suffering, and the cognition of what's unknown to accumulation are the uncontaminated faculties that are tied to the form and formless realms and their faculties are not associated with unknown cognition.",
        "source": "T26n1543_021:0871c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根未知智相應彼根非色無色界繫緣？",
        "translation": "How are those faculties associated with untainted faculties and unknown cognition not the connecting conditions of the form and formless realms?",
        "source": "T26n1543_021:0871c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸根緣盡、緣道未知智相應，是謂無漏根未知智相應彼根非色無色界繫緣。",
        "translation": "Answer: \"When the faculties are associated with knowledge of the end of conditions and the path, it means the uncontaminated faculties are associated with knowledge of the unknown and their faculties aren't tethers in the form and formless realms.",
        "source": "T26n1543_021:0871c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根色無色界繫緣彼根未知智相應乎？",
        "translation": "How are the uncontaminated faculties connected to the form and formless realms and the faculties associated with cognition unknown to them?",
        "source": "T26n1543_021:0871c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：諸根緣苦、緣習未知智相應，是謂無漏根色無色界繫緣彼根未知智相應。",
        "translation": "Answer: \"The faculties conditioned by suffering and conditioned by accumulation are not associated with knowledge of what's unknown, which is the uncontaminated faculties that are conditioned by the form and formless realms and are not associated with knowledge of those faculties.",
        "source": "T26n1543_021:0871c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無漏根非色無色界繫緣彼根非未知智相應？",
        "translation": "How are the uncontaminated faculties that aren't tied to the form and formless realms contingent on that faculty and not contingent on unknown cognition?",
        "source": "T26n1543_021:0871c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：苦法忍、苦法智彼相應根，習法忍、習法智彼相應根，盡法忍、盡法智、盡未知忍彼相應根，盡未知智、道法忍、道法智彼相應根，道未知忍彼相應根，道未知智，是謂無漏根彼根非色無色界繫緣彼根非未知智相應。",
        "translation": "Answer: \"The faculties associated with forbearance of painful qualities and knowledge of painful qualities, the faculties associated with forbearance of accumulated qualities and knowledge of accumulated qualities, the faculties associated with forbearance of ending qualities, knowledge of ending qualities, and forbearance of ending the unknown, the faculties associated with forbearance of ending the unknown, the faculties associated with forbearance of the path and knowledge of the path, the faculties associated with forbearance of the unknown, and the knowledge of the unknown path are the uncontaminated faculties and their faculties that aren't tied to the form and formless realms and their faculties that aren't associated with the unknown.",
        "source": "T26n1543_021:0871c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法智當言法智？",
        "translation": "Dharma cognitionWould you say dharma cognition?",
        "source": "T26n1543_021:0872a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：法智當言法智，或彼知他人心智、苦智習智盡智道智，或有覺有觀或無覺有觀或無覺無觀，或樂根相應或喜根護根空無相無願，或欲界繫緣或不繫緣(法智盡)。",
        "translation": "Answer: \"Would it be called knowledge of the teaching of the teaching, or knowledge of the minds of others, knowledge of suffering and accumulation, knowledge of the path to its end, knowledge with perception and contemplation, knowledge without perception and contemplation, knowledge with perception and contemplation without perception, knowledge associated with the pleasure faculty or the joy faculty, knowledge of emptiness, signlessness, and wishlessness, or knowledge of the desire realm that's tied to conditions or not (knowledge of the ending of the teaching)?",
        "source": "T26n1543_021:0872a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未知智當言未知智？",
        "translation": "Should you say \"cognition of the unknown\" when you don't know the cognition of the unknown?",
        "source": "T26n1543_021:0872a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：未知智當言未知智，或知他人心智、苦智習智盡智道智，或有覺有觀或無覺有觀或無覺無觀，或樂根相應喜根護根空無相無願，或色無色界繫緣不繫緣(未知智盡)。",
        "translation": "Answer: \"What's the unknown knowledge that should be called unknown knowledge, or knowledge of the minds of others, knowledge of the accumulation of suffering, knowledge of the path to its end, knowledge with perception and contemplation, knowledge without perception and contemplation, knowledge with perception and contemplation without perception, knowledge of the joyful faculties associated with the joyful faculties, knowledge of the protection faculties, knowledge of emptiness, signlessness, and wishlessness, or knowledge of the form and formless realms that are contingent and unfettered (knowledge of the end of the unknown)?",
        "source": "T26n1543_021:0872a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等意解脫，當言得學根、得無學根？",
        "translation": "For liberation with equal intent, should you say that you've attained the faculty of training or the faculty of no-training?",
        "source": "T26n1543_021:0872a10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：等意解脫當言得學根、得無學根。",
        "translation": "Answer: \"Equanimous liberation should be described as acquiring the faculty of training and acquiring the faculty of no-training.",
        "source": "T26n1543_021:0872a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無疑意解脫，當言得學根、得無學根？",
        "translation": "For liberation without doubt, should it be said that one has attained the faculty of training and the faculty of no-training?",
        "source": "T26n1543_021:0872a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若始得無疑，當言得學根、得無學根；若等意解脫阿羅漢得無疑，當言得無學根。",
        "translation": "Answer: \"If someone first attains freedom from doubt, they should say they've attained the faculty of training and the faculty of no-training; if an arhat of equal intentional liberation attains freedom from doubt, they should say they've attained the faculty of no-training.",
        "source": "T26n1543_021:0872a13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切結盡，當言得學根、得無學根乎？",
        "translation": "When all the bonds are ended, should you say that you have attained the faculty of training and the faculty of no-training?",
        "source": "T26n1543_021:0872a15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：一切結盡，當言得學根、得無學根。",
        "translation": "Answer: When all the bonds have ended, it should be said that they have attained the faculty of training and the faculty of no-training.",
        "source": "T26n1543_021:0872a15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無礙道取須陀洹果證，此道當言忍相應，當言有覺有觀，當言護根相應無願相應，當言不繫緣(道迹竟)。",
        "translation": "When the fruit of stream entry is realized through the unobstructed path, this path should be described as associated with forbearance, as having perception and contemplation, as guarding the faculties associated with wishlessness, and as not being tied to conditions (the end of the path's steps).",
        "source": "T26n1543_021:0872a16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無礙道取斯陀含果證，若倍欲盡越次取證，此道當言忍相應，當言有覺有觀，當言護根相應無願相應，當言不繫緣。",
        "translation": "If he attains the realization of the fruit of stream entry by virtue of the unobstructed path, and if he doubles his desire to end it and attains it in order, this path should be described as associated with forbearance, as having perceptions and contemplations, as being associated with guarded faculties and having no wishes, and as not being tied to conditions.",
        "source": "T26n1543_021:0872a19_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得須陀洹果，以世俗道取斯陀含果，此道當言等智相應，當言有覺有觀護根相應，當言欲界繫緣。",
        "translation": "If someone attains the fruit of stream entry and then attains the fruit of once-returning by following a secular path, this path should be described as associated with equanimous knowledge, as having perception and contemplation, as being associated with guarded faculties, and as being tied to the desire realm.",
        "source": "T26n1543_021:0872a21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得須陀洹果，以無漏道取斯陀含果，此道當言法智相應或苦智習智盡智道智，當言有覺有觀，當言護根相應或空無相無願，或欲界繫緣或不繫緣(往還竟)。",
        "translation": "If he attains the fruit of stream entry and takes the fruit of once-returning by way of the uncontaminated path, this path should be described as associated with knowledge of principles, knowledge of suffering and accumulation, knowledge of the path to its end, knowledge with perception and contemplation, knowledge that's associated with guarded faculties, knowledge of emptiness, signlessness, and wishlessness, or knowledge that's tied to the desire realm or that's not tied to conditions (after returning).",
        "source": "T26n1543_021:0872a24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無礙道取阿那含果證，若欲愛盡越次取證，此道當言忍相應，或有覺有觀或無覺有觀或無覺無觀，或樂根喜根護根相應無願相應。",
        "translation": "If he realizes the fruit of non-returning by following the path of unhindered attainment of nonreturning, then he'll say that this path is associated with forbearance, either with perception and contemplation, without perception and contemplation, without perception and contemplation, or with the faculty of joy, the faculty of protection, and without vow.",
        "source": "T26n1543_021:0872a27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得斯陀含果，以世俗道取阿那含果，此道當言等智相應，當言有覺有觀，當言護根相應，當言欲界繫緣。",
        "translation": "If someone attains the fruit of once-returning and takes the fruit of non-returning by way of the conventional path, this path should be described as associated with equanimous knowledge, as having perceptions and contemplations, as being associated with the guarded faculties, and as being tied to the desire realm.",
        "source": "T26n1543_021:0872b01_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得斯陀含果，以無漏道取阿那含果，此道當言法智相應或苦智習盡道智，當言有覺有觀，當言護根相應或空無相無願相應，或欲界繫緣或不繫緣(不還竟)。",
        "translation": "If someone attains the fruit of once-returning and takes the fruit of non-returning by way of the uncontaminated path, this path should be described as associated with knowledge of principles, or knowledge of the path to the end of suffering and accumulation, associated with perception and contemplation, associated with guarded faculties, associated with emptiness, signlessness, and wishlessness, or tied to the desire realm or unfettered ties (not returning to the end).",
        "source": "T26n1543_021:0872b04_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無礙道取阿羅漢果證，若依未來有覺有觀三昧取阿羅漢果，此道或法智相應或未知智或苦智習盡道智，當言有覺有觀，當言護根相應或空無相願，或無色界繫緣或不繫緣。",
        "translation": "If someone takes the realization of the arhatship based on the unobstructed path and takes the arhatship based on the future samādhi of perception and contemplation, this path is either associated with knowledge of things, unknown knowledge, or knowledge of the path to the end of suffering, which should be called perception and contemplation, associated with guarded faculties, or associated with emptiness, signlessness, and vows, or tied to the form realm or not tied to conditions.",
        "source": "T26n1543_021:0872b07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依初禪取阿羅漢果，此道或法智相應或未知智或苦智習盡道智，當言有覺有觀，當言喜根相應或空無相無願，或無色界繫緣或不繫緣。",
        "translation": "If someone takes the arhatship based on the first dhyāna, this path, which is associated with knowledge of things, unknown knowledge, or knowledge of the path to the end of suffering's accumulation, should be called having perception and contemplation, associated with the joy faculty, empty, signless, and vowing, or tethered to the formless realm or not tethered to perception.",
        "source": "T26n1543_021:0872b11_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依禪中間取阿羅漢果，此道或法智相應或未知智或苦智習盡道智，當言無覺有觀，當言護根相應或空無相願，或無色界繫緣或不繫緣。",
        "translation": "If someone takes the fruit of the arhat based on the middle of meditation, this path, which is associated with knowledge of things unknown or knowledge of the path to the end of accumulation of knowledge of suffering, should be called having perceptions and contemplations, should be called associated with the faculty of protection or the wish for emptiness without marks, or should be connected to the formless realm or not connected to conditions.",
        "source": "T26n1543_021:0872b15_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依二禪取阿羅漢果，此道或法智相應或未知智或苦智習盡道智，當言無覺無觀，當言喜根相應或空無相無願，或無色界繫緣或不繫緣。",
        "translation": "If someone takes the fruit of the arhat based on the second dhyāna, this path or cognition associated with knowledge of things unknown or cognition of the path to the end of accumulation of painful cognition should be called having no perceptions or contemplations, being associated with the joy faculty or wishing for emptiness without marks, or being tied to the formless realm or not tied to conditions.",
        "source": "T26n1543_021:0872b18_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依三禪取阿羅漢果，此道或法智相應或未知智或苦智習盡道智，當言無覺無觀，當言樂根相應或空無相願，或無色界繫緣或不繫緣。",
        "translation": "If someone takes the arhatship based on the third dhyāna, this path or cognition associated with knowledge of things unknown or cognition of the path to the end of accumulation of painful cognition should be called having no perceptions or contemplations, and it should be called being associated with the joy faculty or vowing for emptiness without marks, or being tied to the formless realm or not tied to conditions.",
        "source": "T26n1543_021:0872b21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依四禪取阿羅漢果，此道或法智相應或未知智或苦智習盡道智，當言無覺無觀，當言護根相應或空無相願，或無色界繫緣或不繫緣。",
        "translation": "If someone relies on the fourth meditation to attain the arhatship, this path or cognition associated with knowledge of things unknown or cognition of the path to the end of suffering should be called having no perceptions or contemplations, being associated with the guard faculty or vowing for emptiness without characteristics, or being tied to the formless realm or not tied to characteristics.",
        "source": "T26n1543_021:0872b24_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依無色定取阿羅漢果，此道當言未知智相應或苦智習盡道智，當言無覺無觀，當言護根相應或空無相願，或無色界繫緣或不繫緣(真人竟)。",
        "translation": "If someone relies on formless concentration to attain the fruit of the arhat, this path should be described as associated with the cognition of the unknown or the cognition of the path to the end of suffering's accumulation, as having no perceptions or contemplations, as being associated with the guarded faculties or the vow to emptiness without characteristics, or as being tied to the formless realm or not tied to conditions (after the real person has finished).",
        "source": "T26n1543_021:0872b27_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根滅盡起得須陀洹果乎？",
        "translation": "How many faculties are completely extinguished and produced to attain the fruit of stream entry?",
        "source": "T26n1543_021:0872c02_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：根不悉滅，七盡起、一滅不起(未知)、一起不盡(已知)，當言得須陀洹果也。",
        "translation": "Answer: When the faculties aren't all extinguished, when seven arise in extinction, one doesn't arise in extinction (unknown), and one doesn't come to an end (known), it's said that they will attain the fruit of stream entry.",
        "source": "T26n1543_021:0872c02_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根滅盡起當言得斯陀含果耶？",
        "translation": "How many faculties are completely extinguished and arisen that should be said to attain the fruit of once-returning?",
        "source": "T26n1543_021:0872c04_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若倍欲盡越次取證，根不悉滅，七盡起、一滅不起、一起不盡，當言得斯陀含果也。",
        "translation": "Answer: \"If times when desires are exhausted and realization is taken in order, their faculties aren't completely extinguished, and seven things that arise from cessation, one thing that ceases, and one thing that doesn't end, it would be called attaining the fruit of once-returning.",
        "source": "T26n1543_021:0872c05_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得須陀洹果，以世俗道取斯陀含果，根不悉滅七盡起，當言得斯陀含果。",
        "translation": "If someone attains the fruit of stream entry and takes the fruit of once-returning by way of the conventional path, and their faculties aren't all extinguished and seven things arise in full, they would be said to have attained the fruit of once-returning.",
        "source": "T26n1543_021:0872c07_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得須陀洹果，以無漏道取斯陀含果，根不悉滅八盡起(如已知)，當言得斯陀含果也。",
        "translation": "If someone attains the fruit of stream entry and takes the fruit of once-returning by way of the uncontaminated path, and their faculties don't all cease and eight arise in full (as is known), they'll be said to have attained the fruit of once-returning.",
        "source": "T26n1543_021:0872c08_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根滅盡起當言得阿那含果乎？",
        "translation": "How many arising from the cessation of the faculties should be said to attain the fruit of non-returning?",
        "source": "T26n1543_021:0872c10_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若欲愛盡越次取證，根不悉滅，七盡起、一滅不起、一起不盡，當言得阿那含果也。",
        "translation": "Answer: \"If desiring to end craving and realize it in order, their faculties aren't all extinguished, and the seven [sense] faculties are completely extinguished, one is extinguished, and one isn't completely extinguished, then they'll be said to have attained the fruit of non-returning.",
        "source": "T26n1543_021:0872c11_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得斯陀含果，以世俗道取阿那含果，禪不現在前，四根悉滅(憂苦男女)，七盡起當言得阿那含果。",
        "translation": "If someone attains the fruit of once-returning and attains the fruit of non-returning by following a secular path, meditation won't appear in front of them, the four faculties will all cease (grief and pain for both men and women), and the seven will all arise, which is said to be the fruit of non-returning.",
        "source": "T26n1543_021:0872c13_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若禪現在前，四根悉滅也、六盡起(五根竟)、一滅不起、一起不盡，當言得阿那含果也。",
        "translation": "If meditation is present, the four faculties are completely extinguished, the six are completely arisen (the five faculties are terminated), the one is extinguished and not arisen, and the one is not exhausted, it's said to be the fruit of non-returning.",
        "source": "T26n1543_021:0872c15_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得斯陀含果，以無漏道取阿那含果，禪不現在前，四根悉滅、八盡起，當言得阿那含果也。",
        "translation": "If he were to attain the fruit of once-returning and grasp the fruit of non-returning by means of the uncontaminated path, then meditation wouldn't be present, and the four faculties would be completely extinguished and the eight would be completely arisen, which would be called the fruit of non-returning.",
        "source": "T26n1543_021:0872c17_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若禪現在前，四根悉滅、七盡起(五根意已知)、一滅不起(護根)、一起不盡(或樂喜)，當言得阿那含果也。",
        "translation": "If meditation is present, the four faculties are completely extinguished, seven are completely arisen (the five faculties are known), one is extinguished and not arisen (the guarding faculty), and one is not completely arisen (either happiness or joy), it would be said that he has attained the fruit of non-returning.",
        "source": "T26n1543_021:0872c19_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾根滅盡起當言得阿羅漢果乎？",
        "translation": "How many faculties are completely extinguished and arisen, and how many are not (known), one is extinguished and arisen (protected), and one is not exhausted (or joyful)?",
        "source": "T26n1543_021:0872c21_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若依未來有覺有觀三昧取阿羅漢果，一根悉滅(命也)、七滅盡起、一滅不起(已知)、一起不盡(無知)，當言得阿羅漢果。",
        "translation": "Answer: If someone were to attain the fruit of the arhat based on the future samādhi of perception and contemplation, one root will completely cease (life), seven will cease and become extinct, one will cease and become nonexistent (known), and one will come together and not be exhausted (ignorant), they would be said to have attained the fruit of the arhat.",
        "source": "T26n1543_021:0872c22_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初禪、中間、第四禪、無色定亦復如是。",
        "translation": "The first, middle, fourth, and formless meditations are likewise.",
        "source": "T26n1543_021:0872c24_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依初禪取阿羅漢果，二根悉滅(命護)、六滅盡起、一滅不起、一起不盡、一盡起，當言得阿羅漢果也。",
        "translation": "If someone relies on the first dhyāna to attain the fruit of the arhat, then they should be said to have attained the fruit of the arhat when the two faculties are completely extinguished (life guarded), the six cessations are completely produced, one cessation is not produced, one is not completely produced, and one is completely produced.",
        "source": "T26n1543_021:0872c25_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二禪三禪亦復如是(三禪樂根)。",
        "translation": "The second and third meditations are likewise (the pleasure faculty of the three meditations).",
        "source": "T26n1543_021:0872c27_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有品第二十八竟(梵本三百二十八首盧，秦言四千二百七十二言)。",
        "translation": "The twenty-eighth stage of existence is complete (Sanskrit text 328 śloka; Qin says 4,272 śloka).",
        "source": "T26n1543_021:0872c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿毘曇根犍度更樂跋渠第三",
        "translation": "The Third Abhidharma Root Treatise (Gandhāra-sūtra) and the Third Lakṣmī Vākṣu (Tantra-sūtra)",
        "source": "T26n1543_021:0873a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六更樂：有對更、增語更、明更、無明更、非明非無明更、愛更、恚更、樂痛更、苦痛更、不苦不樂痛更、眼更、耳更、鼻更、舌更、身更、意更。",
        "translation": "\"The sixteen regimens of pleasure are oppositional regimens, verbal regimens, insight regimens, nescience regimens, neither insight nor nescience regimens, attachment regimens, anger regimens, pleasant pain regimens, painful pain regimens, painful regimens that aren't painful or pleasant, eye regimens, ear regimens, nose regimens, tongue regimens, body regimens, and mind regimens.",
        "source": "T26n1543_021:0873a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等有對更，乃至意更為何等耶？",
        "translation": "What is the right kind of regression, and what is the right kind of regression of the mind?",
        "source": "T26n1543_021:0873a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有對更攝幾更，乃至意更攝幾更乎？",
        "translation": "How many rounds of confrontation are there, and how many rounds of thought are there?",
        "source": "T26n1543_021:0873a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有對更幾根相應，乃至意更幾根相應耶？",
        "translation": "\"How many faculties are associated with the oppositional faculties, and how many faculties are associated with the mental faculties?",
        "source": "T26n1543_021:0873a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根有對更因，有對更此根相應乎？",
        "translation": "Are there causes that oppose the faculties, and are there causes that oppose the faculties that are associated with them?",
        "source": "T26n1543_021:0873a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設根有對更相應，彼根有對更因乃至意更因亦復如是？",
        "translation": "Suppose there are antagonistic causes associated with the faculties, how would it be if there were antagonistic causes associated with those faculties or even if there were mental causes associated with those faculties?",
        "source": "T26n1543_021:0873a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸此種成就眼根，彼成就此種身根乎？",
        "translation": "Which of these has accomplished the visual faculty, and which of these has accomplished the physical faculty?",
        "source": "T26n1543_021:0873a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設成就此種身根，彼成就此種眼根乎？",
        "translation": "If he has accomplished this physical faculty, will he accomplish this visual faculty?",
        "source": "T26n1543_021:0873a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻舌根亦復如是。",
        "translation": "\"So it is with the auditory, nasal, and lingual faculties.",
        "source": "T26n1543_021:0873a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄幾根成就？",
        "translation": "How many faculties are complete in hell?",
        "source": "T26n1543_021:0873a11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畜生、餓鬼、斷善本、邪定、等定、不定、閻浮提、拘耶尼、弗于逮、欝單曰、四天王身、三十三天、炎摩、兜術、化自在、他化自在天、梵加夷天、光音、遍淨、果實天、中陰、無色、堅信、堅法、信解脫、見到、身證、慧解脫、俱解脫成就幾根乎？",
        "translation": "How many faculties have been attained by animals, hungry ghosts, those who have cut off the roots of goodness, wrong concentration, equal concentration, uncertainty, Jambudvīpa, Kauṇḍinya, Pūrṇa, Uttaraka, the four heavenly bodies, the Trāyastriṃśa Heaven, Yamântaka, Tuṣita, Paranirmitavaśavartin, Paranirmitavaśavartin, Brahmakāyika, Prabhākaramitra, Pervasive Purity, the Realm of Fruition, the Intermediate Aggregate, the Formless, Firm Faith, Firm Dharma, Liberation through Faith, Attainment of Vision, Physical Realization, Liberation through Wisdom, and Liberation through Union?",
        "source": "T26n1543_021:0873a12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根得斷智時，幾根得斷智？",
        "translation": "When the visual faculty attains knowledge of severing, how many faculties attain knowledge of severing?",
        "source": "T26n1543_021:0873a17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至慧根得斷智時，幾根得斷智？",
        "translation": "Even when the faculty of wisdom attains knowledge of severing, how many faculties attain knowledge of severing?",
        "source": "T26n1543_021:0873a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根得盡證時，幾根得盡證？",
        "translation": "When the eye faculty is fully realized, how many faculties are fully realized?",
        "source": "T26n1543_021:0873a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至慧根得盡證時，幾根得盡證？",
        "translation": "Up to the point when the faculty of wisdom has been fully realized, how many faculties have been fully realized?",
        "source": "T26n1543_021:0873a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此章義願具演說。",
        "translation": "I would like to explain the full meaning of this chapter.",
        "source": "T26n1543_021:0873a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六更樂：有對更樂、增語更樂、明更樂、無明更樂、非明非無明更樂、愛更樂、恚更樂、樂痛更樂、苦痛更樂、不苦不樂痛更樂、眼更樂、耳更樂、鼻更樂、舌更樂、身更樂、意更樂。",
        "translation": "The sixteen retreats are: the retreat of opposition, the retreat of increased speech, the retreat of insight, the retreat of ignorance, the retreat of neither insight nor ignorance, the retreat of craving, the retreat of anger, the retreat of pleasant pain, the retreat of painful pain, the retreat of pain that's neither pleasant nor painful, the retreat of the eye, the retreat of the ear, the retreat of the nose, the retreat of the tongue, the retreat of the body, and the retreat of the mind.",
        "source": "T26n1543_021:0873a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有對更樂乎？",
        "translation": "How are there opposites that are more pleasant?",
        "source": "T26n1543_021:0873a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：五識身相應更樂。",
        "translation": "Answer: \"The five consciousnesses are associated with the body and are more enjoyable.",
        "source": "T26n1543_021:0873a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何增語更樂乎？",
        "translation": "How does it increase the happiness of speech?",
        "source": "T26n1543_021:0873a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：意識身相應更樂。",
        "translation": "Answer: \"The body of consciousness is associated with greater pleasure.",
        "source": "T26n1543_021:0873a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何明更樂？",
        "translation": "How do you explain what further enjoyment there is?",
        "source": "T26n1543_021:0873a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無漏更樂。",
        "translation": "Answer: \"The untainted are more comfortable.",
        "source": "T26n1543_021:0873a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無明更樂乎？",
        "translation": "How does nescience become more enjoyable?",
        "source": "T26n1543_021:0873a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：染污更樂。",
        "translation": "Answer: \"Defilement is more pleasant.",
        "source": "T26n1543_021:0873a27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非明非無明更樂？",
        "translation": "How are they not illumination and not ignorance, and what are their further pleasures?",
        "source": "T26n1543_021:0873a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：無染污有漏更樂。",
        "translation": "Answer: \"There's no defiled, contaminated, or contaminated going back to pleasure.",
        "source": "T26n1543_021:0873a28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何愛更樂乎？",
        "translation": "How does craving and further pleasure exist?",
        "source": "T26n1543_021:0873a29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：欲相應更樂。",
        "translation": "He answered, \"A desire is associated with greater pleasure.",
        "source": "T26n1543_021:0873a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何恚更樂？",
        "translation": "How are these aberrations and further pleasures?",
        "source": "T26n1543_021:0873b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：瞋恚相應更樂。",
        "translation": "Answer: \"Anger is associated with greater pleasure.",
        "source": "T26n1543_021:0873b01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂樂痛更樂？",
        "translation": "What's meant by delighting in pain and being more delighted?",
        "source": "T26n1543_021:0873b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：樂痛相應更樂。",
        "translation": "They replied, \"Pleasant pain is associated with greater pleasure.",
        "source": "T26n1543_021:0873b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂苦痛更樂？",
        "translation": "What's meant by painful pain that's more pleasant?",
        "source": "T26n1543_021:0873b02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：苦痛相應更樂。",
        "translation": "He answered, \"Pain is associated with suffering and pain, and it's even more pleasant.",
        "source": "T26n1543_021:0873b03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂不苦不樂痛更樂乎？",
        "translation": "What does it mean when it's not painful and painful and more pleasant?",
        "source": "T26n1543_021:0873b03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：不苦不樂痛相應更樂。",
        "translation": "He replied, \"Pain associated with neither suffering nor pleasure is more pleasant.",
        "source": "T26n1543_021:0873b04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂眼更樂耶？",
        "translation": "What does it mean for the eye to be more delighted?",
        "source": "T26n1543_021:0873b04_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：眼識身相應更樂。",
        "translation": "Answer: \"The body of the eye consciousness is associated with greater pleasure.",
        "source": "T26n1543_021:0873b05_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻舌身更樂亦如是。",
        "translation": "The ears, nose, tongue, and body are likewise replete.",
        "source": "T26n1543_021:0873b05_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂意更樂乎？",
        "translation": "What's meant by the greater delight of the mind?",
        "source": "T26n1543_021:0873b06_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：意識身相應更樂。",
        "translation": "Answer: \"The body of consciousness is associated with more pleasures.",
        "source": "T26n1543_021:0873b06_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有對更樂，攝六更樂，七更樂少入。",
        "translation": "It's a relative bliss that incorporates six blisses and a lesser entry of seven blisses.",
        "source": "T26n1543_021:0873b07_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增語更樂，攝三更樂，七更樂少入。",
        "translation": "It's a measure of the bliss of speech that takes in the bliss of the third watch and the lesser entry of the seventh watch.",
        "source": "T26n1543_021:0873b07_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明更樂，攝明更樂，四更樂少入。",
        "translation": "The more pleasurable aspect of insight takes in the more pleasurable aspect of insight and the less pleasurable aspect of the fourth watch.",
        "source": "T26n1543_021:0873b08_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明更樂，攝三更樂，十一更樂少入。",
        "translation": "The more bliss of nescience takes in the bliss of the third watch and the lesser entry of the eleventh watch.",
        "source": "T26n1543_021:0873b09_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非明非無明，攝非明非無明更樂，十一更樂少入。",
        "translation": "What's not light and what's not light takes in what's not light and what's not light's further pleasure, and these eleven further pleasures are seldom entered.",
        "source": "T26n1543_021:0873b10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛更樂，攝愛更樂，十一更樂少入。",
        "translation": "He takes delight in what's loved and takes delight in what's loved, and he enters into 11 more and less delightful moments.",
        "source": "T26n1543_021:0873b11_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恚更樂，攝恚更樂，十一更樂少入。",
        "translation": "They are more delighted with anger and more delighted with anger, and they enter 11 times more and less delightfully.",
        "source": "T26n1543_021:0873b12_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂痛更樂，攝樂痛更樂，十二更樂少入。",
        "translation": "They are more delighted with pain and more delighted with pain, and they experience twelve more and less delightful entrances.",
        "source": "T26n1543_021:0873b12_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦痛更樂，攝苦痛更樂，十一更樂少入。",
        "translation": "Suffering and pain are more pleasant, bringing in suffering and pain and more pleasant, and the eleven more pleasant moments are few and far between.",
        "source": "T26n1543_021:0873b13_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不苦不樂痛更樂，攝不苦不樂痛更樂，十三更樂少入。",
        "translation": "Pain that's neither pleasant nor painful is more pleasant, and it's collected into pain that's neither pleasant nor painful, and it's less pleasant to enter for the thirteenth time.",
        "source": "T26n1543_021:0873b14_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼更樂，攝眼更樂，八更樂少入。",
        "translation": "What's more pleasant about the eyes is that it takes in what's more pleasant about the eyes, and it takes in what's less pleasant about the ears, nose, tongue, and body.",
        "source": "T26n1543_021:0873b15_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻舌身更樂亦復如是。",
        "translation": "The same goes for the aural, nose, tongue, and body sense-perfections.",
        "source": "T26n1543_021:0873b16_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意更樂，攝三更樂，七更樂少入。",
        "translation": "The mind's more pleasurable, which brings in the three more pleasures and the seven more pleasures that enter sparingly.",
        "source": "T26n1543_021:0873b17_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有對更樂，一根相應，八根少入。",
        "translation": "There's a counterpart's more delight, which is associated with one faculty and has few entrances from the eight faculties.",
        "source": "T26n1543_021:0873b17_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增語更樂，五根相應，八根少入。",
        "translation": "It's heightened by the more pleasant aspect of speech, which is associated with five faculties and has few entrances from eight faculties.",
        "source": "T26n1543_021:0873b18_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明更樂，三根相應，九根少入。",
        "translation": "The more pleasurable aspect of insight is associated with three faculties, and the nine faculties are less involved.",
        "source": "T26n1543_021:0873b19_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明更樂，六根少入相應。",
        "translation": "When nescience changes its bliss, it's associated with six faculties and few sense-fields.",
        "source": "T26n1543_021:0873b19_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非明非無明更樂，十一根少入相應。",
        "translation": "What's lacking in insight and lacking in ignorance is associated with the eleven faculties and little entry.",
        "source": "T26n1543_021:0873b20_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛更樂，四根少入相應。",
        "translation": "They're more delighted by desire, which is associated with the four faculties having few sense sense-fields.",
        "source": "T26n1543_021:0873b21_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恚更樂，四根少入相應。",
        "translation": "anger is more pleasant, associated with four faculties that have little entry.",
        "source": "T26n1543_021:0873b21_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂痛更樂，二根相應，九根少入。",
        "translation": "Delighted by pain and more delighted by it, it's associated with the two faculties and has few sense-entries for the nine faculties.",
        "source": "T26n1543_021:0873b22_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦痛更樂，二根相應，六根少入。",
        "translation": "Suffering and pain are more pleasant, associated with the two faculties, and the six faculties have less entry.",
        "source": "T26n1543_021:0873b23_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不苦不樂痛更樂，一根相應，九根少入。",
        "translation": "Pain that's neither pleasant nor painful is more pleasant, associated with one faculty, and the nine faculties have few sense faculties.",
        "source": "T26n1543_021:0873b23_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼更樂，九根少入相應。",
        "translation": "The eyes are more pleasant, corresponding to the nine faculties, and the nine faculties have few inputs.",
        "source": "T26n1543_021:0873b24_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳更樂鼻更樂舌更樂身更樂亦復如是。",
        "translation": "It's likewise when the ear is more pleasant, the nose is more pleasant, the tongue is more pleasant, and the body is more pleasant.",
        "source": "T26n1543_021:0873b25_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意更樂，五根相應，八根少入。",
        "translation": "When the mind is more delighted, it's associated with five faculties and the eight faculties have few sense faculties.",
        "source": "T26n1543_021:0873b26_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根因有對更樂，有對更樂此根相應乎？",
        "translation": "What are the causes of these faculties that are associated with what's more pleasant, and what are the faculties that are associated with what's more pleasant?",
        "source": "T26n1543_021:0873b26_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是，諸根有對更樂相應，彼根因有對更樂。",
        "translation": "Answer: \"Thus, the faculties are associated with antagonism and pleasure, and the causes of those faculties are associated with antagonism and pleasure.",
        "source": "T26n1543_021:0873b27_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗根因有對更樂，此根非有對更樂相應？",
        "translation": "Could it be that the causes of these faculties have counteractive pleasure, and these faculties don't have counteractive pleasure associated with them?",
        "source": "T26n1543_021:0873b28_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有，諸根因有對更樂，諸餘更樂相應。",
        "translation": "Answer: \"Yes, the causes of the sense faculties have counteractive retribution, and the other retributions are associated with them.",
        "source": "T26n1543_021:0873b29_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若根因有對更樂報生無緣，乃至因意更樂亦復如是。",
        "translation": "If there are causes in the faculties that are counteractive to what's more pleasant, the rewards that arise from those causes are likewise unconditioned, even if the causes are mental what's more pleasant.",
        "source": "T26n1543_021:0873c01_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除二更樂，諸根因明更樂，此根明更樂相應乎？",
        "translation": "Except for the two kinds of more pleasures, what are the causes of the faculties' awareness of more pleasures that are associated with this faculty's awareness of more pleasures?",
        "source": "T26n1543_021:0873c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是。",
        "translation": "Answer: So it is.",
        "source": "T26n1543_021:0873c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根明更樂相應：彼根因明更樂乎？",
        "translation": "What's more pleasant about the clarity of the faculties: Is the clarity of the causes of those faculties more pleasant?",
        "source": "T26n1543_021:0873c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是。",
        "translation": "Answer: So it is.",
        "source": "T26n1543_021:0873c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸根因非明非無明更樂，此根非明非無明更樂相應？",
        "translation": "What causes are not insight and not nescience and more pleasant, and what causes are not insight and not nescience and more pleasant associated with these faculties?",
        "source": "T26n1543_021:0873c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是，諸根非明非無明更樂相應，此根因非明非無明更樂。",
        "translation": "Answer: \"Thus, the faculties are not caused by insight and non-insight and are not associated with greater pleasure, and this faculty is caused by what's not insight and non-insight and is not associated with greater pleasure.",
        "source": "T26n1543_021:0873c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗根因非明非無明更樂，此根非明非無明更樂相應乎？",
        "translation": "Could it be that the causes of these faculties are not insight and not nescience and are not associated with greater pleasure, and these faculties are not insight and not associated with greater pleasure of nescience?",
        "source": "T26n1543_021:0873c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有，諸根因非明非無明更樂報生無緣。",
        "translation": "Answer: \"Yes, the causes of the faculties are not awareness or nescience, and the more pleasant rewards of birth have no object.",
        "source": "T26n1543_021:0873c09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸此種成就眼根，彼成就此種身根乎？",
        "translation": "What about the eye-generating faculty that produces this type, and what about the body-generating faculty that produces this type?",
        "source": "T26n1543_021:0873c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：或此種成就眼根非此種身根。",
        "translation": "Answer: \"Perhaps this kind of accomplished eye faculty is not this kind of body faculty.",
        "source": "T26n1543_021:0873c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此種成就眼根非此種身根乎？",
        "translation": "How is this kind of accomplished eye faculty not this kind of body faculty?",
        "source": "T26n1543_021:0873c12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生欲界不得眼根、設得便失、得天眼，是謂此種成就眼根非此種身也。",
        "translation": "Answer: If someone is born in the desire realm and doesn't attain the eye faculty, then they lose it if they attain it, and they attain the divine eye, which is to say that this accomplished eye faculty is not this kind of body.",
        "source": "T26n1543_021:0873c13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此種成就身根非此種眼根乎？",
        "translation": "How is this accomplished body faculty not this kind of eye faculty?",
        "source": "T26n1543_021:0873c14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生欲界不得眼根、設得便失、不得天眼，是謂此種成就身根非此種眼根也。",
        "translation": "Answer: \"When someone is born in the desire realm and doesn't attain the eye faculty, they lose it after assuming it's attained, and they don't attain the divine eye, which is called this kind of accomplished body faculty and not this kind of eye faculty.",
        "source": "T26n1543_021:0873c15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何此種成就眼根此種身根？",
        "translation": "How are these kinds of accomplished eye faculties and these kinds of body faculties?",
        "source": "T26n1543_021:0873c17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生欲界得眼根不失、若生色界，是謂此種成就眼根此種身根也。",
        "translation": "Answer: If someone is born in the desire realm and attains the eye faculty without losing it, and if they're born in the form realm, this is called the kind of accomplished eye faculty and this kind of body faculty.",
        "source": "T26n1543_021:0873c18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何非此種成就眼根非此種身根乎？",
        "translation": "How is it not this kind of accomplished eye faculty and not this kind of body faculty?",
        "source": "T26n1543_021:0873c19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：生無色界，是謂非此種成就眼根非此種身根也。",
        "translation": "Answer: \"Born in the formless realm, this is called not this kind of accomplishment of the eye faculty and not this kind of body faculty.",
        "source": "T26n1543_021:0873c20_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳根亦如是。",
        "translation": "The ear faculty is likewise.",
        "source": "T26n1543_021:0873c21_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若此種成就鼻根，彼此種成就身根乎？",
        "translation": "If this accomplishes the nasal faculty, will this accomplishes the body faculty of the other faculty?",
        "source": "T26n1543_021:0873c22_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：如是，若此種成就鼻根，彼此種成就身根。",
        "translation": "A: \"Thus, if this kind accomplishes the nasal faculty, that kind accomplishes the body faculty of the other kind.",
        "source": "T26n1543_021:0873c23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗此種成就身根非此種鼻根耶？",
        "translation": "Could it be that this kind accomplishes the body faculty and not this kind accomplishes the nose faculty?",
        "source": "T26n1543_021:0873c24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有，生欲界不得鼻根、設得便失。",
        "translation": "Answer: \"Yes, suppose someone is born in the desire realm and doesn't get the olfactory faculty, then they'll lose it.",
        "source": "T26n1543_021:0873c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舌根亦如是。",
        "translation": "So it is with the tongue faculty.",
        "source": "T26n1543_021:0873c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄成就幾根？",
        "translation": "How many faculties will he attain in hell?",
        "source": "T26n1543_021:0873c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：若極多成就十九，若極少八。",
        "translation": "Answer: If there are very many, they'll accomplish nineteen; if there are very few, eight.",
        "source": "T26n1543_021:0873c26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畜生，若極多十九，若極少十三。",
        "translation": "For animals, if there are very many, nineteen; if there are very few, thirteen.",
        "source": "T26n1543_021:0873c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼亦如是。",
        "translation": "So it is with hungry ghosts.",
        "source": "T26n1543_021:0873c27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斷善根，若極多十三，若極少八。",
        "translation": "If they cut off their good roots, it's as many as thirteen, and as few as eight.",
        "source": "T26n1543_021:0873c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邪定，若極多十九，若極少八。",
        "translation": "If they're wrongly concentrated, it's as many as 19, and as few as 8.",
        "source": "T26n1543_021:0873c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等定，若極多十九，若極少十一。",
        "translation": "If they're equally concentrated, it's very often 19, and rarely 11.",
        "source": "T26n1543_021:0873c29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不定，若極多十九，若極少八。",
        "translation": "Unconcentration, if it's very numerous and nineteen, and if it's very few and eight.",
        "source": "T26n1543_021:0874a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮提、拘耶尼、弗于逮亦復如是。",
        "translation": "So it is with Jambudvīpa, Kauṇḍinya, and Puṇyupati.",
        "source": "T26n1543_021:0874a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欝單曰，若極多十八，若極少十三。",
        "translation": "Uttarakuru is said to be as numerous as eighteen and as few as thirteen.",
        "source": "T26n1543_021:0874a02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天王身，若極多十九，若極少十七。",
        "translation": "The body of the four heavenly kings is as numerous as nineteen and as few as seventeen.",
        "source": "T26n1543_021:0874a03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天、炎天、兜術天、化自在天、他化自在天亦復如是。",
        "translation": "The Trāyastriṃśa Heaven, Yama Heaven, Tuṣita Heaven, Paranirmitavaśavartin Heaven, and Paranirmitavaśavartin Heaven are likewise.",
        "source": "T26n1543_021:0874a04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵、加夷天，若極多十六，若極少十五。",
        "translation": "The Brahmakāyika and Kāśyapa heavens are numerous, if not numerous, and few, if not numerous, and fifteen.",
        "source": "T26n1543_021:0874a05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光音天亦復如是。",
        "translation": "The Luminous Sound Celestial is likewise.",
        "source": "T26n1543_021:0874a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遍淨天，若極多十六，若極少十四。",
        "translation": "The Pervasively Pure Gods are numerous, if sixteen, and few, if fourteen.",
        "source": "T26n1543_021:0874a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "果實天，若極多十六，若極少十三。",
        "translation": "The fruitful gods are numerous, if sixteen, and few, if thirteen.",
        "source": "T26n1543_021:0874a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中陰，若極多十九，若極少十三。",
        "translation": "The intermediate aggregates are numerous, if nineteen, and few, if thirteen.",
        "source": "T26n1543_021:0874a08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無色，若極多十一，若極少八。",
        "translation": "... formless, if very numerous ... 11, and if very few ... 8.",
        "source": "T26n1543_021:0874a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堅信、堅法，若極多十九，若極少十三。",
        "translation": "Steadfast faith and steadfast dharma, if very numerous and nineteen, and if very few and thirteen.",
        "source": "T26n1543_021:0874a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信解脫、見到，若極多十九，若極少十一。",
        "translation": "Their faith and liberation and their views are attained, if they are numerous and nineteen, and if they are few and eleven.",
        "source": "T26n1543_021:0874a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身證、慧解脫、俱解脫，若極多十八，若極少十一。",
        "translation": "Physical realization, liberation by wisdom, and liberation from both, if very many and eighteen, and if very few and eleven.",
        "source": "T26n1543_021:0874a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根得斷智時到色愛盡，五根得斷智。",
        "translation": "When he attains knowledge of the elimination of the eye faculty and reaches the end of craving for form, he attains knowledge of the elimination of the five faculties.",
        "source": "T26n1543_021:0874a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻舌身根亦復如是。",
        "translation": "The auditory, nasal, lingual, and physical faculties are likewise.",
        "source": "T26n1543_021:0874a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根得斷智時到無色愛盡，八根得斷智。",
        "translation": "When he attains knowledge of the elimination of the thinking faculty, he'll reach the end of craving for form, and he'll attain knowledge of the elimination of the eight faculties.",
        "source": "T26n1543_021:0874a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命根護根、信精進念定慧根亦如是。",
        "translation": "The life faculty, guardian faculty, faith, effort, mindfulness, concentration, and wisdom faculties are likewise.",
        "source": "T26n1543_021:0874a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "男根女根得斷智時到欲愛盡，四根得斷智。",
        "translation": "When he attains knowledge of the male and female faculties and reaches the end of craving, he attains knowledge of the four faculties that have been cut.",
        "source": "T26n1543_021:0874a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦根憂根亦復如是。",
        "translation": "*So it is with the faculty of suffering and the faculty of sorrow.",
        "source": "T26n1543_021:0874a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根得斷智時到遍淨愛盡，即彼樂根得斷智。",
        "translation": "When he attains knowledge of the faculty of pleasure and the faculty of equanimity, he'll reach the end of craving for purity, which is when he attains knowledge of the faculty of pleasure.",
        "source": "T26n1543_021:0874a17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根得斷智時到光音愛盡，即彼喜根得斷智。",
        "translation": "When he attains knowledge of the joy faculty and reaches the end of craving for luminous sounds, that's when he attains knowledge of the joy faculty's cessation.",
        "source": "T26n1543_021:0874a18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼根盡作證時到色愛盡，五根盡作證，得阿羅漢十九根盡作證。",
        "translation": "When he realizes the exhaustion of the eye faculty and reaches the end of craving for form, he realizes the exhaustion of the five faculties and attains the realization of the arhat's nineteen faculties.",
        "source": "T26n1543_021:0874a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耳鼻舌身根亦復如是。",
        "translation": "The ear, nose, tongue, and body faculties are likewise.",
        "source": "T26n1543_021:0874a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意根盡作證時，得阿羅漢十九根盡作證。",
        "translation": "When the mental faculty has fully realized, he attains the realization of the full realization of the arhat's nineteen faculties.",
        "source": "T26n1543_021:0874a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命根、護根、信精進念定慧根亦復如是。",
        "translation": "The life root, guard root, faith, effort, mindfulness, concentration, and wisdom root are likewise.",
        "source": "T26n1543_021:0874a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "男根女根盡作證時到欲愛盡，四根盡作證，得阿羅漢十九根盡作證。",
        "translation": "When the male and female faculties are fully realized, he reaches the end of desire and love, and the four faculties are fully realized, and he attains the realization of the full accomplishment of the arhat's nineteen faculties.",
        "source": "T26n1543_021:0874a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦根憂根亦復如是。",
        "translation": "*So it is with the faculty of suffering and the faculty of sorrow.",
        "source": "T26n1543_021:0874a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂根盡作證時到遍淨愛盡，即彼樂根盡作證，得阿羅漢十九根盡作證也。",
        "translation": "When he has fully realized the faculty of pleasure, he reaches the end of craving for purity, which is when he fully realizes the faculty of pleasure and attains the realization of the full accomplishment of the arhat's nineteen faculties.",
        "source": "T26n1543_021:0874a25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喜根盡作證時到光音愛盡，即彼喜根盡作證，得阿羅漢十九根盡作證也。",
        "translation": "When the joy faculty is fully realized, it reaches the end of love for luminous sounds, which is when the joy faculty is fully realized, and the realization of the full accomplishment of the arhat's nineteen faculties is attained.",
        "source": "T26n1543_021:0874a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿毘曇更樂品第二十九竟(梵本一百四十一首盧，秦言一千九百一言)。",
        "translation": "The Twenty-ninth Chapter of the Abhidharma Abhidharma Parable (Sanskrit text, 140 verse; Qin language, 1,901 verse).",
        "source": "T26n1543_021:0874a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿毘曇八犍度論卷第二十一",
        "translation": "*Abhidharma-jñānaprasthāna-śāstra, vol. 21",
        "source": "T26n1543_021:0874b02_0",
        "is_bad_quality": false
    }
]