[
    {
        "source_sentence": "大寶積經論卷第四",
        "translation": "Dabaojixing jinglun, vol. 4",
        "source": "T26n1523_004:0224b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後魏北印度三藏菩提流支譯",
        "translation": "Latter Wei Northern India Tripiṭaka Bodhiruci Translation",
        "source": "T26n1523_004:0224b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "\"Kāśyapa!",
        "source": "T26n1523_004:0224b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有當來比丘如犬逐塊」者，是中向外道如犬者，色等五種境界如塊，擲者如畏色聲香味觸示現畏諸境界。",
        "translation": "The monk \"There's a future monk who's like a dog chasing a lump\" shows that this is a non-Buddhist who's like a dog, who's like a lump of form and other five kinds of objects, and who's like a man who's afraid of form, sound, smells, tastes, and tactile objects and shows fear of those objects.",
        "source": "T26n1523_004:0224b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼畏境界，不證知畏因故，示現有四種相故唯逐境界。",
        "translation": "He fears the objective realm and doesn't realize the cause of that fear, so he shows that there are four kinds of characteristics and therefore only chases after the objective realm.",
        "source": "T26n1523_004:0224b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住空閑處者，為欲轉得勝境界，取空閑處。",
        "translation": "Someone who abides in a lonely place will want to change into a superior realm and take a lonely place.",
        "source": "T26n1523_004:0224b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼住獨無等侶，除彼雜染，永住無二，以身離五欲而心不捨。",
        "translation": "They abide alone without equal partners, remove defilements, and permanently abide without duality because they're physically free of the five desires but their mind doesn't abandon them.",
        "source": "T26n1523_004:0224b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人有時或念好聲香味觸，貪心微著而不觀內，不知不覺故。",
        "translation": "Sometimes, a person might think about the pleasures of sound, smells, tastes, and tactile objects, and become subtly attached to them in their mind without looking inside, not knowing or realizing it.",
        "source": "T26n1523_004:0224b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憶念諸境界，忍故彼不知。",
        "translation": "He recollects the objects and tolerates them so that he doesn't know them.",
        "source": "T26n1523_004:0224b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何當得離色聲香味觸？",
        "translation": "How will they become free of form, sound, smells, tastes, and tactile objects?",
        "source": "T26n1523_004:0224b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼以不知不覺故，後時來入城邑聚落王都等在人眾中，還復為好色聲香味觸五欲所縛，故還復退。",
        "translation": "Because they don't know and don't realize it, when they later enter a town, a village, a king's capital, or another crowd of people, they're still bound by their desire for the five desires of form, sound, odor, taste, and touch, and so they retreat again.",
        "source": "T26n1523_004:0224b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若空閑處死者，持俗戒故，便得生天有，為上天五欲所愛縛。",
        "translation": "If someone dies in a lonely place and observes the secular precepts, they'll be born in a heavenly existence and be bound by the five desires of higher gods.",
        "source": "T26n1523_004:0224b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復彼從天上滅，亦不離四惡道。",
        "translation": "Even if they perish up in heaven, they won't escape the four evil destinies.",
        "source": "T26n1523_004:0224b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are the four?",
        "source": "T26n1523_004:0224b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂地獄、餓鬼、畜生、阿修羅道。",
        "translation": "They're called hell, hungry ghosts, animals, and the asura path.",
        "source": "T26n1523_004:0224b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天中生墮，盡依貪欲行故黑朋應知，依見行故說白朋應知。",
        "translation": "Among the gods, birth and descent are based entirely on the practice of desire, so black associates should be known, and based on the practice of views, it's said that white associates should be known.",
        "source": "T26n1523_004:0224b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以見人無我故，彼對治釋成二種黑白朋等應知。",
        "translation": "Because they see that humans lack self, their antidotes are explained as two kinds of black and white peers, which should be known.",
        "source": "T26n1523_004:0224b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是修諸行已，有散心令使攝取，已攝者令得解脫。",
        "translation": "After cultivating these practices in this way, the distracted mind is made to appropriate them, and those who have been included are made to attain liberation.",
        "source": "T26n1523_004:0224b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中修多羅句喻，以不入定心為得解脫故，說諸方便舍摩他，取捨諸煩惱舍摩他等相錯心，治故顯說咽喉喻及縛人喻等。",
        "translation": "In this case, the phrase \"the parable of the sūtra\" refers to the mistaken minds of those who don't enter a concentrated state of mind in order to attain liberation, which explains the parable of the throat and the parable of the fettered person.",
        "source": "T26n1523_004:0224b24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一心定心中說解脫方便，示現見修相，煩惱中說方便令滅故，彼障身見愛樂三昧故，如咽喉及縛喻等識故。",
        "translation": "He explains the method of liberation in a single-minded concentrated state of mind, demonstrates the cultivated aspects of views, explains the method in the midst of affliction so that it will cease, and explains the hindrances to the body in terms of the desire for samādhi, such as the throat metaphor and the fettered person metaphor.",
        "source": "T26n1523_004:0224b27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證諦時以出世間智作令難故，身見如咽喉處病應知。",
        "translation": "When realizing the truth, he makes it difficult with transmundane knowledge, so he should know that his body views are like illnesses of the throat.",
        "source": "T26n1523_004:0224c01_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是行行已防有防等法故，說二種空喻不淨心：一者讀誦世間外道經書諸論等；二者多畜好衣鉢依業及依身故。",
        "translation": "After thus practicing such things, they guard against such things as defenses, and they explain two kinds of empty metaphors for an impure mind: one is to read and recite scriptures, books, and treatises from secular non-Buddhists, and the other is to store many nice clothes and bowls depending on actions and bodies.",
        "source": "T26n1523_004:0224c02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸二法能令得二種縛，如次：一見縛；二利養名聞等縛。",
        "translation": "These two things can cause two kinds of fetters, in this order: a fetter of views and a fetter of profit and fame.",
        "source": "T26n1523_004:0224c05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此二種能縛，以未生善法為令不生作障，當得二種法：一者聖種朋；二者親近諸檀越。",
        "translation": "However, these two kinds of fetters can cause unarisen good qualities to not become hindrances, which should lead to two kinds of things: one is the noble seed friend, and the other is getting close to the patrons.",
        "source": "T26n1523_004:0224c06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已生善法能滅及作污染故，令得二種垢：一者忍諸煩惱垢；二者貪諸檀越知識等。",
        "translation": "Because the good dharmas that have arisen can cease and create pollution, they'll attain two kinds of defilement: one is the defilement of tolerating the afflictions, and the other is craving for the knowledge of the donor community.",
        "source": "T26n1523_004:0224c08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "永斷拔諸善根法故，令助得二種雨雹壞法：一者毀謗正法；二者破戒受人信施。",
        "translation": "Because they permanently eliminate and uproot good qualities, it helps them attain two kinds of hailstorm defilement: one that denigrates the right teaching and two that break the precepts and accept faithful gifts from others.",
        "source": "T26n1523_004:0224c10_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現法中彼不可治故，令得二種癰瘡：一者求見他過；二者自覆諸罪。",
        "translation": "Because they're untreatable in the present life, they cause two kinds of abscesses: one that seeks to see the faults of others, and the other that covers their own sins.",
        "source": "T26n1523_004:0224c12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現法中苦惡行故，令得二種燒法：一者有垢身心受著袈裟；二者受他持戒有功德人所禮拜供養等。",
        "translation": "As a result of their painful and unwholesome actions in the present life, they'll attain two kinds of burning: one, wearing the reddish-brown robes with a defiled body and mind; and two, accepting the veneration and offerings of others who uphold the precepts and have merit.",
        "source": "T26n1523_004:0224c13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來喻者，為得不得不能生故，令得二種不可治病：一者懷增上慢而自伏心；二者壞他發大乘心。",
        "translation": "A future metaphor is one that causes two kinds of incurable illnesses in order to get what has to be produced: one is harboring pride and subduing one's own mind, and the other is destroying the minds of others who have aroused the great vehicle.",
        "source": "T26n1523_004:0224c16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謗菩薩故，依聲聞戒，未來更有漸次應知。",
        "translation": "Because they denigrate the bodhisattvas, they'll rely on the śrāvaka precepts, and there will be further gradual advancements in the future that should be known.",
        "source": "T26n1523_004:0224c18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "\"Kāśyapa!",
        "source": "T26n1523_004:0224c19_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當自觀內」者，如是乃至「中有誰黠慧」，調伏貪惱等故，說增上戒行多聞喻。",
        "translation": "Those who \"should look within\" themselves thus and up to \"Who is there, wisely?\" explain the well-versed parable of the practice of superior morality because it tames craving and so forth.",
        "source": "T26n1523_004:0224c19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生厭悔意故，明增上心戒行。",
        "translation": "Because they become disillusioned, they explain the practice of increasing moral discipline.",
        "source": "T26n1523_004:0224c21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咽喉喻及繫縛人喻者，以人無我及法無我故，增上智戒行。",
        "translation": "The throat metaphor and the fettered man metaphor are based on the assumption that humans are without self and things are without self, which increases the practice of the precepts with knowledge.",
        "source": "T26n1523_004:0224c21_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以調伏貪惱等增上心戒行經所說者，何故此中說增上戒行？",
        "translation": "If the sutra explains the moral practice of increasing mental discipline based on disciplining craving and other things, why is the practice of increasing discipline discussed here?",
        "source": "T26n1523_004:0224c23_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：能發起貪惱行故。",
        "translation": "Answer: It's because it gives rise to the practice of greed and affliction.",
        "source": "T26n1523_004:0224c24_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪多因貪瞋癡等相發起，是故說調伏貪惱等是增上戒行。",
        "translation": "Most sins arise from things like craving and delusion, so it's said that disciplining craving and other things is a superior practice of precepts.",
        "source": "T26n1523_004:0224c25_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：云何貪惱等令能發起罪？",
        "translation": "Q: How do things like greed and affliction cause the initiation of sins?",
        "source": "T26n1523_004:0224c26_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：有二種相故。",
        "translation": "Answer: It's because there are two kinds of characteristics.",
        "source": "T26n1523_004:0224c27_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼不能懺悔；如彼懺悔而不成懺悔。",
        "translation": "It's because they can't repent, and it's because they repent but don't repent.",
        "source": "T26n1523_004:0224c27_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻若有諸沙門及婆羅門不知煩惱因故，怖畏色等境界。",
        "translation": "It's an example of how ascetics and priests fear such things as form because they don't know the causes of their afflictions.",
        "source": "T26n1523_004:0224c28_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住閑空處，自心發起不善思惟故，亦起貪惱我慢境界。",
        "translation": "They also become greedy, distressed, and proud of the realm of self because they live in a quiet place and give rise to unwholesome contemplations in their own minds.",
        "source": "T26n1523_004:0224c29_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或餘處念見貪等，隨逐如犬逐土塊，以塊打故唯逐塊。",
        "translation": "In other places, mindfulness and views of craving and so forth follow them like a dog chasing a clod of dirt, and they only chase clods because they beat them.",
        "source": "T26n1523_004:0225a02_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是不除貪等故，若以聚落等所有親近事作現念，是名未除。",
        "translation": "If someone doesn't remove craving and so forth in this way, then they'll be mindful of all the things they're close to, such as villages and so forth, in the present, which is called not removing.",
        "source": "T26n1523_004:0225a03_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "順義故名除及以除竟。",
        "translation": "Accordingly, it's called removing and finishing with removal.",
        "source": "T26n1523_004:0225a04_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故黑朋中說貪調伏不說於惱，白朋中說惱調伏不說於貪？",
        "translation": "Why is it that among black friends, greed is said to be tempered and not affliction, and among white friends, affliction is said to be tempered and not greed?",
        "source": "T26n1523_004:0225a05_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：二俱欲界中故，示現有餘調、有餘不調。",
        "translation": "Answer: Because they are both in the desire realm, they show some remaining adjustment and some remaining dis-adjustment.",
        "source": "T26n1523_004:0225a06_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現有餘調、有餘不調者，若在空閑處而命終，如是未調故，住戒者亦壞，成增上戒故；況復不住戒者，如馬下道或錯。",
        "translation": "If someone shows some remaining adjustment and some remaining disagreement, then if their life ends while they're in a lonely place, then because they haven't adjusted, those who abide in the precepts will also be destroyed and become subject to the higher precepts, so why wouldn't someone who doesn't abide in the precepts, like a horse descending a path or making a mistake?",
        "source": "T26n1523_004:0225a07_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是行者行增上戒，以錯諸念亦名亂，如咽喉病能斷命根。",
        "translation": "Such a practitioner who practices the higher precepts because of mistaken thoughts is also called disordered, like a throat condition that cuts off the life root.",
        "source": "T26n1523_004:0225a10_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是依人無我行增上智，以身見能斷法命根，如有人隨所縛處而求解脫。",
        "translation": "Thus, based on the knowledge that the practice of selflessness is superior, a person's view of the body can cut off the life root of the Dharma, like a person who follows a binding place and seeks liberation.",
        "source": "T26n1523_004:0225a11_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是依法無我行增上智，隨所性脫妄念中令計心。",
        "translation": "Thus, based on the superior knowledge of practicing selflessness according to law, he causes the mind to speculate in deluded thoughts about the nature of what's being liberated.",
        "source": "T26n1523_004:0225a13_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三修戒中，有八種戒相違法、有八種隨順不淨心，讀誦世間外道經書諸論等、多好衣鉢等，無所用故。",
        "translation": "Of these three cultivated precepts, there are eight ways in which their characteristics are unlawful and eight ways in which they conform to an impure mind, which are useless when reciting scriptures, books, treatises, and other secular non-Buddhist scriptures, or when they have many fine clothes and bowls.",
        "source": "T26n1523_004:0225a14_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如空橫染，橫染是縛因，故漸次說二種縛：一者見縛；二者名聞利養縛。",
        "translation": "As emptiness and undefiledness are the causes of fetters, so they gradually explain the two kinds of fetters: the first is the bond of views, and the second is the bond of fame and profit.",
        "source": "T26n1523_004:0225a17_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於縛作因故說此漸次。",
        "translation": "These gradual steps are explained because they serve as causes for the fetters.",
        "source": "T26n1523_004:0225a18_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以見縛故，憎謗聖種朋。",
        "translation": "Because they are bound by views, they hate and disparage the noble ones.",
        "source": "T26n1523_004:0225a19_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以利養名聞故，親近白衣。",
        "translation": "Because they are fettered by profit and fame, they draw near to the white robed man.",
        "source": "T26n1523_004:0225a19_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如垢障因故，漸次說二種垢：一憎怨謗聖朋，忍受諸煩惱；二親近白衣故，貪諸檀越知識等。",
        "translation": "As a result of these defiling hindrances, two kinds of defilements are gradually explained in order: one, hating and disparaging noble friends and enduring the afflictions; and two, getting close to white clothing and craving for knowledge of the sandalwoods and so forth.",
        "source": "T26n1523_004:0225a20_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是垢如雨雹因故，次說雨雹。",
        "translation": "This defilement is like the cause of rain and hail, which is then described as rain and hail.",
        "source": "T26n1523_004:0225a22_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忍受諸煩惱故，毀謗正法。",
        "translation": "Because they endure various afflictions, they denigrate the right teaching.",
        "source": "T26n1523_004:0225a23_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪諸檀越，以親近破戒緣故，說破戒受人信施。",
        "translation": "They crave the religious leaders who, because they're close to the causes of violating the precepts, say that they violate the precepts and accept faithful gifts from others.",
        "source": "T26n1523_004:0225a23_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於雨雹因故，次有癰瘡，以毀謗正法及破戒受人信施故、自覆諸罪故。",
        "translation": "As a result of the hailstorm, there's then an abscess that covers his own sins because he disparages the right teaching and breaks the precepts to accept faithful gifts from others.",
        "source": "T26n1523_004:0225a24_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燒煮癰瘡因故，次說燒法，求見他過，說有垢身心受著袈裟，以自覆罪故，受他持戒有功德人所禮拜供養等。",
        "translation": "As a result of boiling abscesses, he then explains the burning dharma, seeks to see the faults of others, explains that he's wearing a monk's robe because of his own covering sins, and accepts veneration and offerings from others who uphold the precepts and have merit.",
        "source": "T26n1523_004:0225a26_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於燒成病因故，次說不可治病，故言有垢身心受著袈裟，而懷增上慢而集戒心故，受他持戒有功德人所作禮拜供養等故，壞他住發大乘心。",
        "translation": "Because burning causes illness, it's then said to be an incurable disease, which is why it's said to be covered with the reddish-brown robes of a defiled body and mind, to harbor arrogance and collect precepts, to accept the veneration and offerings of others who uphold the precepts, and to disrupt other abodes and develop the great vehicle intention.",
        "source": "T26n1523_004:0225a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對此故說白朋應知。",
        "translation": "For this reason, he explains that Baekpun should know.",
        "source": "T26n1523_004:0225b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二人中初是見行人，第二貪愛行人應知。",
        "translation": "Of these two, the first is a practitioner who sees, and the second is a practitioner who craves, which should be known.",
        "source": "T26n1523_004:0225b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四種沙門者，以何漸次示現？",
        "translation": "What are the four kinds of ascetics and how are they gradually manifested?",
        "source": "T26n1523_004:0225b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如彼違戒法患，或親近或捨，得人患或得人功德已，所有於念中成障。",
        "translation": "\"If they are afflicted by a violation of the precepts or by closeness or indifference, or if they have acquired the afflictions of others or the merits of others, they will become an obstruction in their mindfulness.",
        "source": "T26n1523_004:0225b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或非障者，彼示現是中人患有三種，依三種人故說應知。",
        "translation": "Those who are not hindered may show that there are three kinds of people suffering, and they say you should know based on the three kinds of people.",
        "source": "T26n1523_004:0225b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形服相沙門者，心行俱壞，依喜惡故說依義。",
        "translation": "An ascetic who dresses himself in form and appearance, his mind and actions are both broken, and he relies on what's liked and disliked to explain the meaning.",
        "source": "T26n1523_004:0225b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誑詐沙門及名聞沙門，行成就而壞心，依二種喜欲大及有喜欲。",
        "translation": "Shameless ascetics and well-known ascetics who have accomplished their deeds and whose minds are broken rely on two kinds of people who have great joy and desire and who have joyful desires.",
        "source": "T26n1523_004:0225b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中喜欲惡者，若言沙門而非沙門。",
        "translation": "Of these, those who delight in desires that are bad are not ascetics if they're called ascetics.",
        "source": "T26n1523_004:0225b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "怖大者，若有諸德，而自意過有自德，恒作是念。",
        "translation": "The fear of greatness is when there are virtues and he thinks more of himself than of his own virtues, and he always thinks that.",
        "source": "T26n1523_004:0225b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有喜欲者，若有德而與德等生心。",
        "translation": "A person with joyful desires wants virtue, but if there's virtue, then the same thought arises as virtue.",
        "source": "T26n1523_004:0225b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初者有二種壞行：一者有餘；二者無餘。",
        "translation": "First, there are two kinds of bad behavior: those with remainder and those without remainder.",
        "source": "T26n1523_004:0225b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有餘者；依四沙門故說應知。",
        "translation": "Those with remainder should be known based on the explanation of the four ascetics.",
        "source": "T26n1523_004:0225b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依於受戒有漏乃至行不淨意業；就此三不善調伏等如次示現。",
        "translation": "It's based on the contaminated acceptance of precepts up to the practice of impure mental activity, which are shown in this order as three unskillful disciplines.",
        "source": "T26n1523_004:0225b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依乞食故，說不淨命。",
        "translation": "It's called impure livelihood because it relies on begging for food.",
        "source": "T26n1523_004:0225b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依受用故，說慳事受用畜聚[卄/積]宿等。",
        "translation": "Depending on the use, it's called stinginess and the use of [twenty/generous] lodging for animals.",
        "source": "T26n1523_004:0225b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依修業故，說不淨命。",
        "translation": "Based on cultivating karma, it's called impure life.",
        "source": "T26n1523_004:0225b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依受用故，說慳事受用畜[卄/積]宿等。",
        "translation": "It's because of karma that it's said to be stingy and accept [twenty/plenty of] lodging in barnyards and so forth.",
        "source": "T26n1523_004:0225b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依修業故，說懈怠。",
        "translation": "Based on cultivated activity, it's called laziness.",
        "source": "T26n1523_004:0225b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無餘者，以破戒故，教犯根本戒故。",
        "translation": "Without remainder, it's because of breaking the precepts and teaching violations of the fundamental precepts.",
        "source": "T26n1523_004:0225b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壞心者，以惡法故，及覆藏彼故。",
        "translation": "Destruction of mind is because of bad qualities and because they are concealed.",
        "source": "T26n1523_004:0225b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二成就行故，依行命戒受用及修道應知。",
        "translation": "The second accomplishment of practice is based on the practice, livelihood, enjoyment of the precepts, and cultivation of the path, which should be understood.",
        "source": "T26n1523_004:0225b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中成就行者，依行故。",
        "translation": "Here, he accomplishes practice because he relies on practice.",
        "source": "T26n1523_004:0225b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就境界者，依命故。",
        "translation": "Those who accomplish the objective realm rely on their livelihood.",
        "source": "T26n1523_004:0225b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就威儀者，以染心四行故。",
        "translation": "Accomplishing comportment depends on the four defiled mental activities.",
        "source": "T26n1523_004:0225b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依戒者，受用麁澁食，故少欲。",
        "translation": "Those who rely on precepts receive crude food, so they have few desires.",
        "source": "T26n1523_004:0225b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四聖種性者，依受用故，言不親近諸道俗等故，依修道故。",
        "translation": "The four holy seed natures are based on enjoyment, because they say they won't associate with the conventional and other paths, and because they rely on cultivation.",
        "source": "T26n1523_004:0225b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少言少語故，樂寂靜。",
        "translation": "Because they speak little and say little, they enjoy quiescence.",
        "source": "T26n1523_004:0225b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依論說慰喻等應知。",
        "translation": "This should be known based on the explanation in the commentary, such as the comforting metaphors.",
        "source": "T26n1523_004:0225b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖行如是等法皆為誑詐不為善淨心者，以壞心故。",
        "translation": "Even though such things are practiced, they are deceptive and don't serve a good and pure mind because they destroy the mind.",
        "source": "T26n1523_004:0225b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依修行行故，誑詐應知。",
        "translation": "He should know that he deceives people based on his cultivation of practices.",
        "source": "T26n1523_004:0225b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常有我見者，依人無我，不滅我見行行故。",
        "translation": "Someone who always has a view of self relies on the fact that people are without self and don't cease to hold that view in practice.",
        "source": "T26n1523_004:0225b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於空法中而生怖畏難，如臨深坑。",
        "translation": "He becomes frightened and embarrassed by the idea of emptiness, like facing a deep pit.",
        "source": "T26n1523_004:0225b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依法無我不分別空，及彼說者生怨家等想。",
        "translation": "Relying on the fact that things are without self and don't discriminate between emptiness and those who say they are, they give rise to thoughts like resentful enemies.",
        "source": "T26n1523_004:0225c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三者成就行順住念，依止及依行，隨順諸法應知。",
        "translation": "The third accomplishes the mindfulness of abiding in accordance with practice, relying on support and practice, and following the teachings should be known.",
        "source": "T26n1523_004:0225c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中住者持戒，念者多聞，念彼故得順諸事。",
        "translation": "Of these, abiding is observing precepts, mindfulness is being well-versed, and mindfulness of these enables him to conform to various things.",
        "source": "T26n1523_004:0225c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依止者，空閑處坐，以空閑坐故順諸功德。",
        "translation": "Those who rely on restraint are those who sit in a leisurely place, and it's because they sit in a leisurely place that they conform to the virtues.",
        "source": "T26n1523_004:0225c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨順諸法者，少知足少欲等。",
        "translation": "Someone who conforms to qualities is satisfied with little knowledge and few desires.",
        "source": "T26n1523_004:0225c05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "違心於親親中應知。",
        "translation": "He should know that he's disobeying his relatives.",
        "source": "T26n1523_004:0225c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中不滅諸念者，示現有厭離欲。",
        "translation": "This doesn't eliminate mindfulness, which shows disillusionment with desire.",
        "source": "T26n1523_004:0225c06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼對治故，滅熾然等，欲三菩提故。",
        "translation": "As a result of their antidote, they cease blazing and so forth, desiring the three bodhisattvas' enlightenment.",
        "source": "T26n1523_004:0225c07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅三菩提，以道行果故。",
        "translation": "Cessation of the three bodhisattvas' enlightenment is the result of the path's practice.",
        "source": "T26n1523_004:0225c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四人二俱成就，以九種成就勢應知。",
        "translation": "The fourth accomplishment of both human beings should be known by nine kinds of accomplishment of potency.",
        "source": "T26n1523_004:0225c08_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一、常行勢；二、多聞勢；三、欲勢；四、寂靜思惟勢；五、正見勢；六、證勢；七、滅勢；八、修勢；九、正證勢。",
        "translation": "1. the power of constant practice, 2. the power of being well-versed, 3. the power of desire, 4. the power of quiescent contemplation, 5. the power of right view, 6. the power of realization, 7. the power of cessation, 8. the power of cultivation, and 9. the power of right realization.",
        "source": "T26n1523_004:0225c09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不求身命者，以不惜身命故，是名常行勢應知。",
        "translation": "Someone who doesn't seek his own life because he doesn't value it is called the momentum of constancy that should be known.",
        "source": "T26n1523_004:0225c11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂聞空等法意喜者，明第二多聞勢。",
        "translation": "\"He's delighted with hearing about emptiness and other things, which explains the second momentum of hearing a lot.",
        "source": "T26n1523_004:0225c12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦不喜空見等，復不喜涅槃修諸梵行，何況悕求三界。",
        "translation": "He doesn't delight in views of emptiness and so forth, and he doesn't delight in nirvāṇa and cultivate the religious practice, so why would he long for the three realms?",
        "source": "T26n1523_004:0225c13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不悕求諸見法，亦應滅法故。",
        "translation": "Not longing for views and things like that, they should also cease to be things.",
        "source": "T26n1523_004:0225c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼果彼道得涅槃意故，說第三欲勢。",
        "translation": "Because he intends to attain nirvāṇa as the result of that path, he explains the third momentum of desire.",
        "source": "T26n1523_004:0225c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常依止於法、不依止文字章句者，諸煩惱求內解脫，不向外逃走。",
        "translation": "Someone who always relies on the Dharma and doesn't rely on words and phrases will seek internal liberation from the afflictions and won't flee outward.",
        "source": "T26n1523_004:0225c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以依止法故，求禪解脫思心世間智等。",
        "translation": "Because they rely on the Dharma, they seek liberation in meditation, contemplate the mind's mundane cognition, and so forth.",
        "source": "T26n1523_004:0225c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四寂靜思惟勢，於一切煩惱常求解脫，不向外求，見一法本來性無垢畢竟清淨，而自依止亦不依他者，性不染故。",
        "translation": "The fourth force of quiescent contemplation is that person who always seeks liberation from all afflictions and doesn't look outward, sees the original nature of a single dharma as unsullied and ultimately pure, and relies on himself and doesn't rely on others, so his nature isn't defiled.",
        "source": "T26n1523_004:0225c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有學出世間法自內知見。",
        "translation": "He trains in the knowing and seeing of transmundane dharmas from within.",
        "source": "T26n1523_004:0225c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五正見勢，以正法身尚不見佛，何況色身者，以不見三寶故。",
        "translation": "The fifth strength of right view is that it's because the right Dharma body still doesn't see the Buddha, so why wouldn't someone see the physical body?",
        "source": "T26n1523_004:0225c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真實三寶，亦以出世間智分別念故。",
        "translation": "The true and real Three Treasures are also discriminated and thought of with transmundane cognition.",
        "source": "T26n1523_004:0225c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六證勢，以空患離上不見法，何況貪著音聲言說，以滅除所應除者故。",
        "translation": "The sixth momentum of realization is because he's free from the affliction of emptiness and doesn't see the Dharma above, so why wouldn't he be addicted to sounds and words, in order to eliminate what should be eliminated?",
        "source": "T26n1523_004:0225c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七滅勢，無所修應修者，以修故。",
        "translation": "The seventh momentum of cessation is that there's nothing to cultivate that should be cultivated because of cultivation.",
        "source": "T26n1523_004:0225c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第八修勢，不生生死不著涅槃，知一切法本來寂滅，不見有縛不求解脫。",
        "translation": "The eighth momentum of cultivation is not being born in birth-and-death and not being attached to nirvāṇa, knowing that all things are originally tranquil, not seeing the fetters of existence, and not seeking liberation.",
        "source": "T26n1523_004:0225c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不捨世間不證涅槃者，以滅世間因故。",
        "translation": "Therefore, he doesn't abandon the world and doesn't realize nirvāṇa because he's ceasing the causes of the world.",
        "source": "T26n1523_004:0225c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及以得涅槃故，不生世間不求涅槃，不悕求死及壽命，不求解不求縛，已滅故。",
        "translation": "Because they have attained nirvāṇa, they aren't born in the world and don't seek nirvāṇa, don't long for death and life, and don't seek liberation or bondage, which have already ceased.",
        "source": "T26n1523_004:0225c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及有餘分故，不行亦不滅。",
        "translation": "Because there are other parts, they don't practice and don't cease.",
        "source": "T26n1523_004:0226a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中性滅盡無生智等所攝諸無學法應知，是名第九正證勢。",
        "translation": "These are the ninth correctly realized power of the cognition of neutrality, the cessation of nonarising, and the other acquired teachings that should be known.",
        "source": "T26n1523_004:0226a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有彼三種沙門立沙門名，彼名無義，及不相似示現，以名所伐故，說貧窮喻。",
        "translation": "Those three kinds of ascetics who establish the name ascetic, whose name has no meaning and doesn't resemble its manifestation, are called poor because they are defeated by their names.",
        "source": "T26n1523_004:0226a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何以名所伐？",
        "translation": "What is it that's felled by names?",
        "source": "T26n1523_004:0226a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異沙門名形服故，妄受信施利養，自此已後非真實行沙門，及識知起我慢真實行沙門故，并持戒識知顛倒說似如持戒故。",
        "translation": "He takes on the form and clothing of a different ascetic's name, falsely accepts faith, gifts, and benefits, and from then on he's not really an ascetic, and he knows that consciousness gives rise to pride and really is an ascetic, and he knows that he's upholding the precepts mistakenly and says it's like upholding the precepts.",
        "source": "T26n1523_004:0226a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞思修等智，依彼慢故說二喻譬。",
        "translation": "That knowledge of hearing, contemplating, cultivating, and so forth relies on that pride to explain the two metaphors and parables.",
        "source": "T26n1523_004:0226a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有人漂沒大水渴乏而死。",
        "translation": "It's like a person who drowns in a great river and dies of thirst.",
        "source": "T26n1523_004:0226a10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此喻示現以有聞慧故生我慢。",
        "translation": "This metaphor shows that self-conceit arises because of the wisdom of hearing.",
        "source": "T26n1523_004:0226a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥師喻，以有思慧故，樂著三摩拔提。",
        "translation": "The parable of the Healing Buddha shows that it's because of the wisdom of contemplation that he's delighted with the samāpatti.",
        "source": "T26n1523_004:0226a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫離欲者，樂著利養恭敬故。",
        "translation": "Ordinary people who are free of desire are delighted with gain and respect.",
        "source": "T26n1523_004:0226a12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有學者起悔修三摩拔提者，修慧邪行故。",
        "translation": "Those who are motivated by regret cultivate the samāpatti because they cultivate the mistaken practice of wisdom.",
        "source": "T26n1523_004:0226a13_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現行正行中起我慢故，說餘三喻。",
        "translation": "To show that conceit arises in the midst of right practice, he explains the other three metaphors.",
        "source": "T26n1523_004:0226a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初名病人喻；第二者寶喻；第三者死人喻，依戒起彼慢故，示現有四種破戒比丘。",
        "translation": "The first is the parable of the sick person, the second is the parable of the jewel, and the third is the parable of the dead person, which shows that there are four kinds of monks who break the precepts because their arrogance arises from the precepts.",
        "source": "T26n1523_004:0226a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自善持戒等喻，是中初者假受戒；第二者說不善持律明了懈怠；三者以行似彼故，於破戒障壞故，說壞障戒；第四者說具受十二頭陀功德，是假名持戒。",
        "translation": "Of these metaphors, the first is the parable of the well-maintained precepts, the second is the parable of clear laziness in observing the precepts poorly, the third is the parable of the dead man, which shows that there are four kinds of monks who break the precepts because the hindrances to breaking the precepts have been destroyed based on their conduct, and the fourth is the parable of the 12 virtues of the ascetic who nominally observes the precepts.",
        "source": "T26n1523_004:0226a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中初者，見患滅破戒對治障故，名為破戒應知。",
        "translation": "The first of these is called the knowledge of the violation of the precepts because of the counteractive hindrances of seeing the afflictions and eliminating the violation of the precepts.",
        "source": "T26n1523_004:0226a20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有者以破戒故，不可持彼中一，於涅槃中生恐怖，不能滅破戒障故，修行對治。",
        "translation": "There are those who, because they have broken the precepts, can't uphold either of them, become frightened in nirvāṇa, and cultivate antidotes because they can't remove the hindrance of breaking the precepts.",
        "source": "T26n1523_004:0226a21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二以我慢故，生得解脫相，對治彼故說諸真實持戒功德。",
        "translation": "Second, because of self-conceit, the mark of attaining liberation arises, and to counteract that, he explains the merits of truly upholding the precepts.",
        "source": "T26n1523_004:0226a23_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然破戒惡所顯及修道行所顯，是中初持戒者，說內入非外入故。",
        "translation": "Although the evils of breaking the precepts are revealed and the practices of cultivating the precepts are revealed, this is the first one who observes the precepts because he's speaking of internal entry and not external entry.",
        "source": "T26n1523_004:0226a24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二說作染業無作，善無作非是身等作，染業亦無非作，是能作善無行無非行，依雜染不雜染，依乞食無所行亦無不行，依雜染不雜染受用故，無名無色無餘涅槃，無想無非想無相行中離念一切想故。",
        "translation": "The second explains that the doing of defiled actions is not done, that good actions are not done by the body and so forth, that defiled actions are not not done, that they're capable of doing good actions, that there are no wrong actions, that they're based on defilement and non-defilement, that there's nothing to do or not to do based on begging for food, that they're based on defiled and non-defiled sensations, that there's no name, no form, and nirvāṇa without remainder, that there's no perception, no non-perception, and no formless action in which all perceptions are abandoned.",
        "source": "T26n1523_004:0226a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及念無想戒無滅無非滅，無學行於涅槃有餘故，煩惱無餘故。",
        "translation": "Because mindfulness of the absence of perception and morality has neither cessation nor non-cessation, post-learners' practice has residue in nirvāṇa with residue, and afflictions have no residue.",
        "source": "T26n1523_004:0226b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無取無捨，常行離喜憂故，及捨念同生有故。",
        "translation": "There's no taking and no equanimity, so he's always practicing free of joy and sorrow, and he's mindful of equanimity because it's produced in the same existence.",
        "source": "T26n1523_004:0226b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無可取無可捨，還彼初境界，不取憂喜及取捨念同生故。",
        "translation": "Nothing is acquired, nothing can be abandoned, and it's because they return to their original state, don't acquire grief and happiness, and acquire the mindfulness of equanimity that arises together.",
        "source": "T26n1523_004:0226b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無眾生無眾生名，乃至無心。",
        "translation": "There are no sentient beings, no names of sentient beings, and even no mind.",
        "source": "T26n1523_004:0226b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無心名依解釋喻。",
        "translation": "The absence of the name mind relies on the parable of the interpretation.",
        "source": "T26n1523_004:0226b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既滅隨所能記及隨所記隨所者，無世間無非世間，依器世間雜不雜行人行故。",
        "translation": "Since it ceases what can be remembered and what's remembered, there's nothing mundane and nothing that's not mundane, depending on the container world as a mixture of unadulterated human behavior.",
        "source": "T26n1523_004:0226b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無依止無非依止，依雜染及不雜染，依六識村田境界故。",
        "translation": "It's lacking support and lacking neither support, depending on what's defiled and what's not defiled, and depending on the realm of the six villages of consciousness.",
        "source": "T26n1523_004:0226b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言不以戒自高不謗下他戒，依親近家故。",
        "translation": "It's called not elevating oneself above the precepts and not denigrating others' precepts, depending on closeness to home.",
        "source": "T26n1523_004:0226b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦不憶想分別彼戒，不分別我是持戒、我有如是持戒，不分別彼性故。",
        "translation": "They also don't conceive of or discriminate between their precepts, don't discriminate that I uphold the precepts or that I have such upholding of the precepts, and don't discriminate between their natures.",
        "source": "T26n1523_004:0226b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏亦有世間共可滅，尋即顯故說不共。",
        "translation": "There are also uncontaminated things that are commonly extinguished in the world, which are discerned to be immediately apparent and therefore said not to be common.",
        "source": "T26n1523_004:0226b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼若三界非果、非求三界因，是二句示現，是名以漸次。",
        "translation": "However, if they aren't the result of the three realms and don't seek the causes of the three realms, these two statements will show that this is called gradual advancement.",
        "source": "T26n1523_004:0226b13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依於戒有順不順諸法故，說善學不善學沙門差別事。",
        "translation": "Because the precepts are agreeable and disagreeable to various things, it's said that there's a difference between a well-learned and a poorly trained ascetic.",
        "source": "T26n1523_004:0226b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者不善學沙門？",
        "translation": "What's a monk who's not well-trained?",
        "source": "T26n1523_004:0226b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有三種應知。",
        "translation": "\"There are three kinds of people who should know this.",
        "source": "T26n1523_004:0226b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形服相似沙門。",
        "translation": "An ascetic who behaves like an ascetic in body and clothing.",
        "source": "T26n1523_004:0226b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不惜沙門戒，唯形服同不同者，形命受用與命戒見心不相似等。",
        "translation": "An ascetic who doesn't scorn the ascetic precepts but differs only in form and clothing is one whose form, life, enjoyment, and life and precepts are not similar in view and mind.",
        "source": "T26n1523_004:0226b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中形處及服處故，名形服處相似。",
        "translation": "This is called similarity of form and dress because of their physical appearance and place of dress.",
        "source": "T26n1523_004:0226b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中服處者，以彼僧伽梨等故名服同。",
        "translation": "Here, the place of dress is called the same because it's the same as the saṃghârāma.",
        "source": "T26n1523_004:0226b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形處者，以剃鬚髮執持鉢故名為形同。",
        "translation": "The place of form is called similar in form because he shaves his hair and carries a bowl.",
        "source": "T26n1523_004:0226b20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不淨身等業行故，名行不相似。",
        "translation": "It's called dissimilarity of conduct because of the conduct of impure bodies and so forth.",
        "source": "T26n1523_004:0226b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不淨命故，命不相似。",
        "translation": "Because their lives are impure, their lives aren't similar.",
        "source": "T26n1523_004:0226b21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慳故，於受用中不相似。",
        "translation": "Because of stinginess, it's not similar in feeling and effort.",
        "source": "T26n1523_004:0226b22_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懈怠故，用行不相似。",
        "translation": "Because of laziness, their uses and deeds aren't similar.",
        "source": "T26n1523_004:0226b22_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破戒故，於持戒中不相似。",
        "translation": "Because they violate the precepts, they're not similar in their observance of the precepts.",
        "source": "T26n1523_004:0226b23_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以惡法故，於見不相似。",
        "translation": "Because of bad qualities, it's not similar in views.",
        "source": "T26n1523_004:0226b24_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不調不伏不隱諸根故，於心不相似。",
        "translation": "It's not similar in mind because it doesn't tame or subdue the unhidden faculties.",
        "source": "T26n1523_004:0226b24_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二威儀誑詐沙門者，乞資用精進用等應知。",
        "translation": "Those whose two kinds of deportment deceive ascetics should know that they're requisites, exertions, and functions.",
        "source": "T26n1523_004:0226b25_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增上心、增上慧同彼行及心不相似，成就用意等故。",
        "translation": "Superior mind and superior wisdom are not similar to their actions and minds, and they accomplish their intentions and so forth.",
        "source": "T26n1523_004:0226b26_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增上戒同，一心安詳故，乃至不樂雜亂故。",
        "translation": "The superior morality is the same, which is because the single mind is peaceful and even disaffection is disliked.",
        "source": "T26n1523_004:0226b27_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增上心行同，少言少語故。",
        "translation": "The practice of superior mind is the same, so it's less verbal and less verbal.",
        "source": "T26n1523_004:0226b28_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增上智行同，誑詐等彼行心不同故。",
        "translation": "Their superior knowledge and conduct are the same, which is why their conduct and minds are different when they deceive others.",
        "source": "T26n1523_004:0226b29_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三名聞沙門者，唯求名聞應知。",
        "translation": "The three ascetics of renown and learning are those who seek only renown and learning and should know it.",
        "source": "T26n1523_004:0226b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍摩他分同、毘婆舍那分同，彼二分修同，還彼二助行同，心性不同。",
        "translation": "The parts of śamatha and the parts of vipaśyanā are the same, and their two parts of cultivation are the same; furthermore, their two supporting practices are the same, but their mental natures are different.",
        "source": "T26n1523_004:0226c01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中以戒故、有戒分故，舍摩他分同，戒是三昧因故。",
        "translation": "It's because of the precepts and the precepts aspect that the precepts aspect is the same, and it's because the precepts are the cause of samādhi.",
        "source": "T26n1523_004:0226c03_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以多聞故，於毘婆舍那分同，聞能領得無漏智故。",
        "translation": "Because they're well-versed, the part of vipaśyanā is the same, and hearing enables them to attain untainted cognition.",
        "source": "T26n1523_004:0226c04_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以住空閑阿蘭若故，彼二修分相似同，於空閑處住修因故。",
        "translation": "Because they abide in the forested forest araṇya, their two factors of cultivation are similar, and it's because they abide in a forested place that they're the cause of cultivation.",
        "source": "T26n1523_004:0226c05_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少欲等彼二助道行同，彼少欲等是助習行等故。",
        "translation": "Those two practices that aid in the path, such as having few desires, are the same, because those few desires and so forth are practices that aid in cultivation.",
        "source": "T26n1523_004:0226c06_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親近他故，心不相似應知。",
        "translation": "Because they're close to others, their minds aren't similar, as you should know.",
        "source": "T26n1523_004:0226c08_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者善學沙門？",
        "translation": "\"What's a well-versed ascetic?",
        "source": "T26n1523_004:0226c08_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四種相應知：行故、心故、證故及盡至故。",
        "translation": "There are four ways to know this: by doing, by mind, by realization, and by reaching the end.",
        "source": "T26n1523_004:0226c09_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不惜身命故，於現法中得厭悔行故。",
        "translation": "It's because they don't spare their own lives and because they attain repentant behavior in the present life.",
        "source": "T26n1523_004:0226c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空等沙門意喜故，未來生教化身行故。",
        "translation": "It's because an ascetic's intention is to rejoice in emptiness and so forth, and it's because he'll conduct himself in the body of teaching and transformation in future lives.",
        "source": "T26n1523_004:0226c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名行勢應知。",
        "translation": "These are called the strengths of practice that should be known.",
        "source": "T26n1523_004:0226c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以依真如行故，信法無我意故，不喜涅槃故，及不喜空故，所應得及所能得，彼亦離假名性相不正執故。",
        "translation": "Because they rely on the practice of true reality, believe in the idea that dharmas are without self, don't delight in nirvāṇa and don't delight in emptiness, and attain what should and can be attained, they're also free of incorrect attachment to the nature and marks of nominal names.",
        "source": "T26n1523_004:0226c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常依了義不依文字者，悕求所須義故。",
        "translation": "Those who always rely on the full understanding of meaning and don't rely on words long for the desired meaning.",
        "source": "T26n1523_004:0226c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於煩惱中而求解脫，不向外逃走，不如隨聲性故。",
        "translation": "They seek liberation in the midst of affliction and don't flee outward, so they don't follow the nature of sound.",
        "source": "T26n1523_004:0226c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名心勢應知。",
        "translation": "This is called mental power that should be understood.",
        "source": "T26n1523_004:0226c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見一切法體永清淨不染，以真如法故，作助己形及他，不緣他智性，不染證故。",
        "translation": "Seeing the essence of all dharmas as permanently pure and undefiled because they are truly true dharmas, they create forms that are helpful to themselves and others, don't take the nature of other's knowledge as object, and don't defile their realization.",
        "source": "T26n1523_004:0226c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中諸報等盡見解脫，不見假名性相故。",
        "translation": "Because he sees the full extent of these rewards and so forth as liberation, he doesn't see the nature and marks of nominal names.",
        "source": "T26n1523_004:0226c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名證勢應知。",
        "translation": "This is called the force of realization and should be known.",
        "source": "T26n1523_004:0226c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生自性滅故，不行善修一切煩惱染等對治故。",
        "translation": "It's because the self-nature of all sentient beings ceases and because they don't practice the good cultivation of all afflictions, defilements, and other antidotes.",
        "source": "T26n1523_004:0226c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不取滅度，真如不斷故，及不觀非事。",
        "translation": "They don't attain extinction, so the true nature doesn't persist, and they don't contemplate what's not true.",
        "source": "T26n1523_004:0226c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名盡至勢應知。",
        "translation": "This is called the momentum of complete attainment that should be known.",
        "source": "T26n1523_004:0226c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中貧人喻，與不善學沙門，以三種相故，於名不如義應知。",
        "translation": "This is a metaphor of a poor person and an unskilled ascetic who, because of three characteristics, should be known as not having the right meaning.",
        "source": "T26n1523_004:0226c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壞心成就行，成就心而壞行，亦壞心及壞行。",
        "translation": "It's a corrupt mind that accomplishes actions, a corrupt mind that accomplishes actions, and a corrupt mind and corrupt actions.",
        "source": "T26n1523_004:0226c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中壞心成就行有三種應知。",
        "translation": "Of these, there are three ways to know about the accomplishment of bad mental states.",
        "source": "T26n1523_004:0226c24_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聞及所聞心為知足，能說彼中而為知足，得世間三昧故，及得彼功德以為樂著。",
        "translation": "They are the mind that's satisfied with what's heard and what's heard, the mind that's satisfied with what's said, the mind that's attained worldly samādhi, and the mind that's attained that merit and becomes attached to it with pleasure.",
        "source": "T26n1523_004:0226c25_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中漂墮河喻，說壞心成就行，唯有聞等事應知。",
        "translation": "Here's the parable of the plunging river, which teaches that the mind is destroyed by accomplishing actions, and that there are only things like hearing that should be known.",
        "source": "T26n1523_004:0226c27_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醫師喻，還彼唯有說事應知。",
        "translation": "The parable of the doctor who returns to the knowledge that there are only things to be said.",
        "source": "T26n1523_004:0226c28_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幻喻，得彼世間三昧，唯樂著彼事應知。",
        "translation": "The parable of the illusion, which is the attainment of worldly samādhi, should be known only for the things to which one is delightfully attached.",
        "source": "T26n1523_004:0226c29_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩尼寶喻，成就心而壞行應知。",
        "translation": "The parable of the maṇi-jewel, which accomplishes the mind and destroys its practice, should be known.",
        "source": "T26n1523_004:0227a01_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "死喻，說壞心及壞行應知。",
        "translation": "Death is a metaphor for a mind that's described as broken and actions that are broken should be known.",
        "source": "T26n1523_004:0227a01_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者子喻，成就心及成就行應知。",
        "translation": "The parable of the elder son, \"Accomplished mind and accomplished actions\" should be known.",
        "source": "T26n1523_004:0227a02_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一相義故，善學沙門應知。",
        "translation": "Because of the meaning of \"one characteristic,\" the well-versed monk should know this.",
        "source": "T26n1523_004:0227a03_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說有四種破戒比丘似善持戒，有何漸次？",
        "translation": "What is the gradual progression of the four ways a monk who breaks the precepts seems to observe them well?",
        "source": "T26n1523_004:0227a03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以真實沙門，示受真實行。",
        "translation": "\"It's a true ascetic who demonstrates the true practice of the precepts.",
        "source": "T26n1523_004:0227a04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以示現如戒相似住假名戒，示現假名戒。",
        "translation": "He demonstrates the nominal precepts by showing that they resemble the precepts and abides in the nominal precepts by demonstrating the nominal precepts.",
        "source": "T26n1523_004:0227a05_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現假名戒何者？",
        "translation": "What are the precepts that are shown in a nominal sense?",
        "source": "T26n1523_004:0227a06_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住假名戒行有四種應知。",
        "translation": "\"There are four ways to understand the practice of abiding in nominal precepts.",
        "source": "T26n1523_004:0227a06_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼復以我慢等壞身故，名為住假名戒行。",
        "translation": "They are called abiding in nominal moral behavior because they are also corrupted by self-conceit and so forth.",
        "source": "T26n1523_004:0227a07_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初者成就六種戒，以二種障壞戒。",
        "translation": "First, they've accomplished six kinds of precepts, but they've destroyed the precepts because of two kinds of hindrances.",
        "source": "T26n1523_004:0227a08_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者六種行分戒持成？",
        "translation": "What are the six kinds of practices that accomplish the observance of the precepts?",
        "source": "T26n1523_004:0227a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依波羅提木叉所說而行成就，行成就壞境界成就，於微罪中而見怖畏，受而修行。",
        "translation": "He accomplishes practice based on what the prātimokṣa teaches, accomplishes the objective accomplishment of destruction by practice, sees fear in the midst of subtle crimes, and receives and cultivates practice.",
        "source": "T26n1523_004:0227a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸戒中有二種障。",
        "translation": "Among the precepts, there are two kinds of hindrances.",
        "source": "T26n1523_004:0227a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者二種？",
        "translation": "What are the two kinds?",
        "source": "T26n1523_004:0227a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身見熾盛令戒中起及命知。",
        "translation": "The blazing view of the body causes it to arise in the precepts and to be aware of its fate.",
        "source": "T26n1523_004:0227a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二捨彼二患，離身見熾然處故。",
        "translation": "The second reason for abandoning those two hindrances is to get rid of the place where the view of the body is blazing.",
        "source": "T26n1523_004:0227a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以律師故，於諸犯戒善能發起。",
        "translation": "Because he's a master of the precepts, he's able to skillfully arouse those who violate the precepts.",
        "source": "T26n1523_004:0227a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然以等世間淨故，諸利養不能動，同生身見。",
        "translation": "However, because they are equally pure in the world, they can't be moved by the benefits, and the same view of the body arises.",
        "source": "T26n1523_004:0227a14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三此同法得世間淨戒，復同生身見，不解法無我，聞生恐怖懈怠。",
        "translation": "Third, these same people attain worldly purity of the precepts, and they also share the view of the body, don't understand that things are without self, and become fearful and lazy when they hear about them.",
        "source": "T26n1523_004:0227a15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四離一切與患，然以信邪法無我故，壞我慢戒，住四種不正戒。",
        "translation": "Fourth, he's free of all [afflictions] but because he believes that wrong things are without self, he breaks the precept for conceit and abides in the four incorrect kinds of precepts.",
        "source": "T26n1523_004:0227a16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覺知謗等法戒，彼相彼無漏應知。",
        "translation": "He perceives the precept for denigrating such things, and he should know their characteristics without contamination.",
        "source": "T26n1523_004:0227a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者謗等法？",
        "translation": "What's such a denigration of the Dharma?",
        "source": "T26n1523_004:0227a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初住假名戒者，亦見有我，亦言有我所，對治彼故，言無我無我所故。",
        "translation": "Those who first abide in the nominal precepts also see a self and say 'I have what belongs to me,' and the remedy is to say 'I have no self and nothing that belongs to me.'",
        "source": "T26n1523_004:0227a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所作犯戒者是名不作，對治彼故，言無作無非作故。",
        "translation": "A person who violates the precepts by doing something is called someone who doesn't do it, and the remedy is to say that there's nothing done and nothing that isn't done.",
        "source": "T26n1523_004:0227a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作行彼亦非行，對治彼故，言無有所作亦無作者故。",
        "translation": "An action that's taken is also not an action, but it's counteracted by saying that there's nothing to do and nothing to be done.",
        "source": "T26n1523_004:0227a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安詳行亦名非行，對治彼故，言無行無非行故。",
        "translation": "A practice of tranquility is also called not a practice, and it's counteracted by saying that there's no practice and no non-practice.",
        "source": "T26n1523_004:0227a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄念行者是名非行，對治彼故，言無有所行亦無不行故。",
        "translation": "The practice of false mindfulness is called not a practice, and it's the remedy for that, which says there's nothing to do and nothing not to do.",
        "source": "T26n1523_004:0227a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二住假名戒行，身見朋煩惱隨順，亦見名及見色，對治彼故，言無名無色故。",
        "translation": "The second abode is called the practice of precepts in name only, which is followed by the afflictions of personal views and peers, as well as views of names and forms, and which are countered by the statement, 'There are no names and no forms.'",
        "source": "T26n1523_004:0227a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來生想定有及彼想，對治彼故，言無想無非想故。",
        "translation": "He's preoccupied with the contemplation of future birth and the contemplation of that, and to counteract that, he says 'there's no contemplation, and there's no non-contemplation.'",
        "source": "T26n1523_004:0227a27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼熾然滅使者亦名不滅，對治彼故，言無滅無非滅故。",
        "translation": "The messengers of their fiery cessation are also called non-ceasing, and the remedy is to say that they lack cessation and lack neither cessation.",
        "source": "T26n1523_004:0227a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "執人無我及捨取人，對治彼故，言無取無捨故。",
        "translation": "He remedies this by claiming that there's no taking and no equanimity because he clings to the selflessness of humans and the appropriation of humans.",
        "source": "T26n1523_004:0227a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還彼眾生無我執中亦可取亦不可取，對治彼故，言無可取無可捨故。",
        "translation": "He corrects them by saying that there's nothing to apprehend and nothing to discard when he returns to his attachment to the selflessness of sentient beings.",
        "source": "T26n1523_004:0227b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以色等執眾生相，彼說取善哉，對治彼故，言無眾生無眾生名。",
        "translation": "He doesn't attach to the characteristics of sentient beings based on form and so forth, but he says he takes what's good, and to counteract that, he says there are no sentient beings and no names of sentient beings.",
        "source": "T26n1523_004:0227b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語亦說彼取善哉分別，對治彼故，言無身無身名，無口無口名故。",
        "translation": "They also say that they grasp to the discrimination of what's good, and they counteract this by saying that there's no body and no body name, and there's no mouth and no mouth name.",
        "source": "T26n1523_004:0227b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼分別是心，及彼取分別善哉，對治彼故，言無心無心分別名。",
        "translation": "Their discrimination is mind, and they grasp the goodness of discrimination, and to counteract that, they say there's no mind and no name of mental discrimination.",
        "source": "T26n1523_004:0227b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三住戒行者，上生世間亦向捨下故非世間，對治彼故，言無世間無非世間。",
        "translation": "The third abode of moral discipline is that which is produced in the upper realms and which is directed toward equanimity and therefore not the realms, and the remedy for that is to say that there's nothing worldly and nothing that isn't worldly.",
        "source": "T26n1523_004:0227b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依三昧亦依不貪欲，對治彼故，言無依止無非依止。",
        "translation": "He relies on samādhi and also on non-craving, and to counteract this, he says, \"There's no support, and there's nothing that isn't support.",
        "source": "T26n1523_004:0227b09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝取自戒不毀他戒，對治彼故，言不以戒自高、不毀下他戒。",
        "translation": "He takes his own precepts and doesn't disparage others' precepts, and to counteract this, he says he doesn't elevate himself by his precepts and doesn't disparage others' precepts.",
        "source": "T26n1523_004:0227b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四住假名戒，言我是能持戒，生分別念，對治彼故，言亦不分別戒故。",
        "translation": "The fourth abode of the nominal precepts, which says, \"I am able to uphold the precepts, and give rise to discriminating thoughts, counteracts that by saying that they don't discriminate between the precepts either.",
        "source": "T26n1523_004:0227b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝性念等戒分別念，對治彼故，言不分別戒及不念此戒故，是名謗法。",
        "translation": "Being mindful of the precepts, such as mindfulness of their superiority, and having discriminating thoughts about them to counteract them, saying they don't discriminate between them and not being mindful of them is called denigrating the Dharma.",
        "source": "T26n1523_004:0227b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏戒中盡能滅盡，是名諸聖持戒無漏足句。",
        "translation": "The uncontaminated precepts that are completely extinguished are called the uncontaminated fulfillment of the noble observance of precepts.",
        "source": "T26n1523_004:0227b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所著者，出世間故，不至三界理、不順一切煩惱故。",
        "translation": "Being unattached, it's transcendent, so it doesn't reach the principle of the three realms and doesn't conform to all afflictions.",
        "source": "T26n1523_004:0227b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離一切依止，對治離三界故。",
        "translation": "Being free of all attachments, it's a remedy for being free of the three realms.",
        "source": "T26n1523_004:0227b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故於有還淨示現勝，彼持戒故。",
        "translation": "Therefore, their return to purity in the present shows their superiority, which is due to their observance of the precepts.",
        "source": "T26n1523_004:0227b18_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說諸偈應知：「具足持戒者，　　無垢無所有。」",
        "translation": "These verses should be interpreted to mean, \"A person who fully upholds the precepts is spotless and lacks possessions.\"",
        "source": "T26n1523_004:0227b18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初偈第一句，離垢故說性清淨。",
        "translation": "In the first line of the first verse, it's said to be inherently pure because it's free of defilement.",
        "source": "T26n1523_004:0227b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪欲等有餘離已，彼因淨故得戒性淨，示現同因等淨。",
        "translation": "After parting with desire and other things, the nature of the precepts is purified because their causes are purified, which demonstrates that they're equally purified as causes.",
        "source": "T26n1523_004:0227b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘三句者，還彼持戒，示現同伴等因淨。",
        "translation": "The other three phrases return those who uphold the precepts, showing that fellow practitioners and so forth are purified by their causes.",
        "source": "T26n1523_004:0227b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中破戒同伴及諸同因，對治故，於戒同伴及諸同因者有三種差別應知。",
        "translation": "Here, fellow practitioners of the precepts and their fellow causes are counteracted, so there are three kinds of distinctions between fellow practitioners of the precepts and their fellow causes that should be known.",
        "source": "T26n1523_004:0227b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中破戒同伴有三種，慢同色等，依止因故，迷惑意故，見如愚癡，同樂三摩拔提，屈復同伴取念。",
        "translation": "There are three kinds of companions who break the precepts, including those who are conceited, similar in appearance, dependent on the cause, deluded in their thinking, deluded in their views, enjoying samāpatti together, and mindful of the companions they're working with.",
        "source": "T26n1523_004:0227b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同事念者，如鹿處同身樂愛喜伴，是名第一偈義。",
        "translation": "Being mindful of fellow practitioners, like a deer in the same body that's a joyful, loving, and joyful companion, is called the first meaning of the verse.",
        "source": "T26n1523_004:0227b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還彼持戒中一切相，明依清淨戒故，說第二偈應知。",
        "translation": "Returning to all the characteristics of their observance of the precepts, he explains the second verse as being well-known because it clearly relies on the pure precepts.",
        "source": "T26n1523_004:0227b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寂滅常畢竟如是等，是中有四種性同患，對治故，說波羅提木叉戒清淨應知，以不闕故。",
        "translation": "Such is the case when the eternal character of cessation is finally such that there are four kinds of similar afflictions that are counteracted by teaching that the prātimokṣa precepts are pure and should be known because they aren't lacking.",
        "source": "T26n1523_004:0227c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於受戒禪淨、餘者無漏戒淨，還依彼持戒，無諸患淨，故說第三偈。",
        "translation": "Since the receiving of the precepts and the remaining uncontaminated precepts are purified, and since it's based on their observance that the precepts are purified and free from hardships, he explains the third verse.",
        "source": "T26n1523_004:0227c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不貪惜身命。」",
        "translation": "\"Don't be stingy with your life.\"",
        "source": "T26n1523_004:0227c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等有五種患。",
        "translation": "Thus, there are five kinds of hardships.",
        "source": "T26n1523_004:0227c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者彼五患？",
        "translation": "What are these five hindrances?",
        "source": "T26n1523_004:0227c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者利養恭敬患，以惜身故。",
        "translation": "The first is the worry of nurturing and respecting because they cherish their bodies.",
        "source": "T26n1523_004:0227c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者懈怠患，繼念莫死起樂命故。",
        "translation": "Two, the affliction of laziness, which is the result of continuing to think about avoiding death and starting to enjoy life.",
        "source": "T26n1523_004:0227c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者起願持梵行患，希求一切有生故。",
        "translation": "Three, the danger of initiating the vow to maintain the religious practice because he wants all sentient beings to arise.",
        "source": "T26n1523_004:0227c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者唯戒為足患，不正至故。",
        "translation": "The fourth is the worry of having only the precepts as their fulfillment, because they don't correctly attain them.",
        "source": "T26n1523_004:0227c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五者不出至患，如諸外道說成不正理故。",
        "translation": "The fifth is the danger of not attaining it, because it's incorrect as some non-Buddhists say.",
        "source": "T26n1523_004:0227c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠離此五種患故，釋成清淨無諸患應知。",
        "translation": "Being free of these five kinds of afflictions, the explanation becomes pure and free of afflictions as should be understood.",
        "source": "T26n1523_004:0227c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依無煩惱淨故，說第四偈：「持戒不染世。」",
        "translation": "Because the absence of affliction purifies it, he says the fourth verse, \"Observing the precepts doesn't defile the world.\"",
        "source": "T26n1523_004:0227c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世法不能染故。",
        "translation": "It's because worldly phenomena can't be defiled.",
        "source": "T26n1523_004:0227c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依集諦所攝染，同至熾染起欲處，二識著諸愛染，故言不依世法耳。",
        "translation": "Depending on the defilements that are included in the noble truth of arising, the two consciousnesses become addicted to desires and defilements, so it's said that they don't rely on worldly dharmas.",
        "source": "T26n1523_004:0227c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不依世者，滅前復有愛故滅。",
        "translation": "Someone who doesn't rely on the world will cease because there are further attachments before they cease.",
        "source": "T26n1523_004:0227c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「速得智慧明，　　以得光明故，　於見諦道中。」",
        "translation": "\"He quickly attains the insight of wisdom, and it's because he attains light that he's in the path of the seeing truth.\"",
        "source": "T26n1523_004:0227c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無礙無所有。",
        "translation": "It's unobstructed and ungraspable.",
        "source": "T26n1523_004:0227c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無礙無所有事，以修道無明等及餘對治彼故言。",
        "translation": "Being unobstructed and lacking possessions is said to be the result of cultivating ignorance and so forth and other antidotes to it.",
        "source": "T26n1523_004:0227c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無我無彼相，離我他相故。",
        "translation": "Being without a self and without marks from that, it's because they're free of marks from self and other.",
        "source": "T26n1523_004:0227c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依無學道離我慢清淨故，說第五偈。",
        "translation": "Because the path of post-learners is purified by freedom from self-conceit, he says the fifth verse.",
        "source": "T26n1523_004:0227c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「無此無彼岸，　　亦無有中間。」",
        "translation": "\"There's no here, no there, and nothing in between.\"",
        "source": "T26n1523_004:0227c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無相行中不著內外入故。",
        "translation": "In markless practice, they don't cling to internal or external sense-fields.",
        "source": "T26n1523_004:0227c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無著縛無漏，滅煩惱及使熾然滅故。",
        "translation": "Without attachment or bondage, he's uncontaminated, which ceases affliction and causes feverishness to cease.",
        "source": "T26n1523_004:0227c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諂及無漏，無我慢差別。",
        "translation": "Without guile or contamination, there's no distinction between self and conceit.",
        "source": "T26n1523_004:0227c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明依永淨故，說第六偈：「心不著名色。」",
        "translation": "Because the basis of clarity is permanently purified, he says the sixth verse, \"The mind doesn't recognize name-and-form.\"",
        "source": "T26n1523_004:0227c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於有不起願故，不離寂滅法。",
        "translation": "Because it doesn't give rise to vows, it doesn't part with the Dharma of cessation.",
        "source": "T26n1523_004:0227c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼者以持戒不足故，諸根調伏故，於三昧中不足故。",
        "translation": "That's because observance of the precepts is insufficient, the faculties are tamed, and there's not enough in samādhi.",
        "source": "T26n1523_004:0227c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不生我我所乃至有頂世間，知足故，住持戒故。",
        "translation": "They don't give rise to self or what belongs to self or even the highest level of existence in the world, and they maintain the precepts because they're satisfied.",
        "source": "T26n1523_004:0228a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說於戒中永示現依世間淨故，說第七偈應知。",
        "translation": "It's said that the precepts are based on the worldly purity of the permanent manifestation of the precepts, which should be known when the seventh verse is spoken.",
        "source": "T26n1523_004:0228a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「雖行持諸戒，　　其心不自高。」",
        "translation": "\"Even though they practice the precepts, their minds aren't self-exalted.\"",
        "source": "T26n1523_004:0228a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現以持戒故心不生高下，無厭足故。",
        "translation": "This shows that it's because of upholding the precepts that his mind doesn't become superior or inferior, and he's not disillusioned with them.",
        "source": "T26n1523_004:0228a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「亦不以為上，　　過是求聖道。」",
        "translation": "\"Nor does he think of himself as superior, which is excessive in seeking the noble path.\"",
        "source": "T26n1523_004:0228a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨持戒者，此相以三昧不足故，求出世間道。",
        "translation": "This is the mark of someone who purifies the observance of precepts and seeks the transmundane path because samādhi is insufficient.",
        "source": "T26n1523_004:0228a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依出世間淨故，說第八偈：「不以戒為最。」",
        "translation": "Relying on the purity of the transmundane, he says the eighth verse, \"I don't regard the precepts as the best.\"",
        "source": "T26n1523_004:0228a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不以戒為足故。",
        "translation": "It's because he doesn't regard the precepts as sufficient.",
        "source": "T26n1523_004:0228a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「亦不貴三昧。」",
        "translation": "\"Nor is samādhi valuable.\"",
        "source": "T26n1523_004:0228a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不樂著三昧故。",
        "translation": "It's because they don't delight in samādhi.",
        "source": "T26n1523_004:0228a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「過此二事已，　　修習上智慧。」",
        "translation": "\"After going through these two things, he cultivates superior wisdom.\"",
        "source": "T26n1523_004:0228a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無分別是聖性。",
        "translation": "nondiscrimination is the noble nature.",
        "source": "T26n1523_004:0228a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無分別是修，攝取增上智，諸佛所稱歎。",
        "translation": "Without discrimination, it's cultivated, and it gathers superior wisdom, which is praised by the buddhas.",
        "source": "T26n1523_004:0228a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故知餘者勝歎事故。",
        "translation": "Therefore, you know that the others are superior in terms of praise.",
        "source": "T26n1523_004:0228a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依有學無學非有學非無學淨故，說第九偈：「心解脫身見。」",
        "translation": "Relying on the purification of both training and no-training, and neither training nor no-training, he says the ninth verse, \"The mind liberates the body from views.\"",
        "source": "T26n1523_004:0228a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅有分別身見，示現學戒淨故。",
        "translation": "Ceasing the discriminated view of the body shows that training and discipline are purified.",
        "source": "T26n1523_004:0228a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「滅除我我所。」",
        "translation": "\"To cease the view of self and what belongs to self.\"",
        "source": "T26n1523_004:0228a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以滅同生身見故，示現無學戒淨。",
        "translation": "because it ceases the view of the body of same-born beings, it demonstrates the purity of the post-learned precepts.",
        "source": "T26n1523_004:0228a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「信空佛境界。」",
        "translation": "\"Believing in the emptiness of the Buddha's realm.\"",
        "source": "T26n1523_004:0228a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以信空故，示現非學非無學淨事。",
        "translation": "Because of that faith in emptiness, it demonstrates the purity of what's neither learned nor post-trained.",
        "source": "T26n1523_004:0228a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依悋著淨故，說第十偈：「依戒得三昧，　　三昧能修慧。」",
        "translation": "Relying on the purity of attachment to stinginess, he spoke the tenth verse, \"Relying on precepts, we attain concentration, and concentration cultivates wisdom.\"",
        "source": "T26n1523_004:0228a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現未得八聖道戒故，說不持戒淨。",
        "translation": "Because it shows that he hasn't attained the precepts of the eight noble paths, he explains that the purity of not upholding the precepts.",
        "source": "T26n1523_004:0228a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「依因所修慧，　　速得於淨智；　以得淨智故，　　具足清淨戒。」",
        "translation": "\"Relying on the wisdom cultivated by causes, they quickly attain pure cognition; because they have attained pure cognition, they possess pure precepts.\"",
        "source": "T26n1523_004:0228a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現以得聖智故，後得戒清淨，說此偈。",
        "translation": "Showing that it's because of attaining noble wisdom that the precepts are subsequently purified, he spoke this verse.",
        "source": "T26n1523_004:0228a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時八百比丘，不受諸漏心得解脫。",
        "translation": "\"At the time, 800 monks didn't become free of the contaminants and attained liberation.",
        "source": "T26n1523_004:0228a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三萬二千人遠塵離垢得法眼淨」，示現此教誨中有如是等大利益，亦復示現現即得大果，於化者有學無學等得故。",
        "translation": "Thirty-two thousand people became dustless and spotless and attained purification of the Dharma eye,\" demonstrating that this teaching contains such great benefits and also demonstrates the immediate attainment of great results, which are attained equally by those who are trained and those who are not trained.",
        "source": "T26n1523_004:0228a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「及五百比丘得禪定者，聞此深法，心不信解不能通達，從座而起去」者，示現彼難調伏能調伏已，不能信解、不能通達入深法故。",
        "translation": "The words \"and the five hundred monks who have attained meditation hear this profound teaching, but their minds don't believe it or understand it, so they get up from their seats and depart\" show that they are difficult to subdue and are able to subdue, but they aren't able to believe it or understand it and can't penetrate it.",
        "source": "T26n1523_004:0228a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二種相不能通達諸法：以不信故、以信不樂故，智慧不能通達諸義故。",
        "translation": "There are two ways they can't understand the teaching: because they don't believe it, because they don't believe it and don't enjoy it, and because their wisdom can't understand its meaning.",
        "source": "T26n1523_004:0228b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是偈甚深者，難知故。",
        "translation": "This verse is profound because it's difficult to know.",
        "source": "T26n1523_004:0228b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來菩提甚深者，意難測量故。",
        "translation": "The buddhas' tathāgatas' enlightenment is so profound that it's difficult to fathom its meaning.",
        "source": "T26n1523_004:0228b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼若不淳種諸善根，惡知識所攝，自信力少難得信受。",
        "translation": "If they don't simply cultivate good roots, they're included by bad friends, and their confidence is small, making it difficult to believe and accept them.",
        "source": "T26n1523_004:0228b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以惡知識所攝故，不淳修諸善根，以不信多故應知。",
        "translation": "Because they are included by bad friends, they don't cultivate good roots in a pure way, and you should know it because they don't believe in many things.",
        "source": "T26n1523_004:0228b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時世尊語尊者須菩提」，顯菩提時諸聲聞是如來作，堪能化度勝義故。",
        "translation": "\"At the time, the Bhagavān spoke to Venerable Subhūti,\" showing that the śrāvakas at the time of enlightenment were Tathāgatas who were capable of bringing about supernormal transformation.",
        "source": "T26n1523_004:0228b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故乃至假名真實差別應知。",
        "translation": "Therefore, even nominal and real distinctions should be known.",
        "source": "T26n1523_004:0228b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「爾時世尊即時化作二比丘」者，示現如來方便應度故。",
        "translation": "The phrase \"the Bhagavān then instantly created two monks\" shows that the Tathāgata is capable of guiding and liberating them.",
        "source": "T26n1523_004:0228b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現化者有二種相故，示現信於同服及見同法事故。",
        "translation": "This manifestation has two kinds of characteristics, showing faith in the same robe and the occurrence of seeing the same teaching.",
        "source": "T26n1523_004:0228b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸比丘攝取，為已說正教誨故。",
        "translation": "Those monks took them in order to teach the right lessons after they taught them.",
        "source": "T26n1523_004:0228b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼以妄執取涅槃，生我慢故生怖畏，為信故說如實涅槃無有眾生。",
        "translation": "They falsely attach to nirvāṇa and become frightened because they've developed self-conceit, but for the sake of faith they say that nirvāṇa as it really is has no sentient beings.",
        "source": "T26n1523_004:0228b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若入涅槃者，非諸貪欲等有故而有盡滅。",
        "translation": "If someone enters nirvāṇa, it's not because of the existence of cravings and so forth that there's cessation.",
        "source": "T26n1523_004:0228b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼者，如不生故。",
        "translation": "It's just like that, because it doesn't arise.",
        "source": "T26n1523_004:0228b14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示現涅槃者，唯滅不生故。",
        "translation": "He who demonstrates nirvāṇa only ceases and isn't born.",
        "source": "T26n1523_004:0228b15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言「汝等莫作憶想、莫作分別」者，於內外入中是我我所。",
        "translation": "Someone who says, \"Don't make memories and don't make distinctions\" means that in internal and external sense, entry is self and what belongs to self.",
        "source": "T26n1523_004:0228b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如次。",
        "translation": "It's just like that.",
        "source": "T26n1523_004:0228b17_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於諸法無著者，以貪瞋本來無生故。",
        "translation": "That is, someone who's unattached to things because craving and anger are originally unarisen.",
        "source": "T26n1523_004:0228b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無離者，未來不離故。",
        "translation": "He's not free from it because he won't be free from it in the future.",
        "source": "T26n1523_004:0228b18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名寂滅者，防護此執，本非寂滅而有寂滅，所有戒等品，彼亦不住不來。",
        "translation": "This is called cessation. It's a guard against this attachment, which is not cessation in the first place but is cessation in the first place, and it doesn't stop or come from such things as the precepts.",
        "source": "T26n1523_004:0228b18_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復不滅盡者，以眾生名永寂滅故。",
        "translation": "\"Again, it doesn't cease, because the names of sentient beings are permanently tranquilized.",
        "source": "T26n1523_004:0228b20_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不住不來者，以不染故。",
        "translation": "He who doesn't abide and doesn't come because he's not defiled.",
        "source": "T26n1523_004:0228b21_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復不滅盡者，性自滅盡故。",
        "translation": "'Again, it doesn't cease,' because its nature is naturally ceased.",
        "source": "T26n1523_004:0228b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼者亦無餘，若本不寂滅已於後成寂滅，汝等可捨離是相。",
        "translation": "There's nothing more to it than that, and if it becomes tranquil after having been originally not tranquil, you can part with that characteristic.",
        "source": "T26n1523_004:0228b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂涅槃，無彼事故。",
        "translation": "This is called nirvāṇa, and there's no such event.",
        "source": "T26n1523_004:0228b23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言勿我入涅槃，以相向涅槃故作涅槃相。",
        "translation": "They say 'don't let me enter nirvāṇa,' because they're looking toward nirvāṇa and therefore making the mark of nirvāṇa.",
        "source": "T26n1523_004:0228b24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿以貪欲等相故識為涅槃相，非貪欲等無故名為涅槃，是名彼者相。",
        "translation": "Don't think of the mark of nirvāṇa because of desires and other marks, and call it nirvāṇa because it's not because of desires and other marks, which are called those marks.",
        "source": "T26n1523_004:0228b25_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復無相行中方便。",
        "translation": "\"Furthermore, it's the method in the practice of marklessness.",
        "source": "T26n1523_004:0228b26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設無漏已，次後說現法樂行方便，入滅盡定行起故。",
        "translation": "Suppose that after he's uncontaminated, he then explains the method of performing pleasant actions in the present life and enters into the initiation of the practice of the concentration of cessation.",
        "source": "T26n1523_004:0228b27_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復此是異義。",
        "translation": "Again, this is a different meaning.",
        "source": "T26n1523_004:0228b28_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經言「彼若不淳種諸善根」者，智慧功德助道行乏少故。",
        "translation": "The sūtra says, \"If they don't simply plant good roots,\" it's because the merits of wisdom and virtue that aid the practice of the path are lacking.",
        "source": "T26n1523_004:0228b28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "增上煩惱塵是義非惡知識所攝者，以善知識所不攝故。",
        "translation": "This is the meaning of the dust of increased affliction that's not included by bad teachers because it's not included by good teachers.",
        "source": "T26n1523_004:0228b29_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壞是義不能信解者，離智助道行故。",
        "translation": "It's a meaning that can't be believed and understood because it's free from the practices of wisdom that aid the path.",
        "source": "T26n1523_004:0228c02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能信甚深處是義不能信解者，是故總不能通達者，不能測量知法體智住故。",
        "translation": "Those who can believe in the profundity of this meaning but can't believe and understand it therefore can't comprehend it in general, because they can't measure the abode of knowledge about the substance of phenomena.",
        "source": "T26n1523_004:0228c02_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復不能信解，已不能正決真智故。",
        "translation": "Again, he can't believe and understand it, so he can't correctly determine true knowledge afterward.",
        "source": "T26n1523_004:0228c04_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來化度方便事有二種應知。",
        "translation": "There are two kinds of skillful means by which the Tathāgata transforms and liberates people that should be understood.",
        "source": "T26n1523_004:0228c05_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化者以我慢共體故，示現同共事故。",
        "translation": "Those who teach are shown to be in common with each other because they share the same essence of self-conceit.",
        "source": "T26n1523_004:0228c06_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說能順行教故，及得教誨有出世因故，說正淨教方便教授故。",
        "translation": "It's because what's taught is consistent with the practice of the teaching, because the teaching has supramundane causes, and because it's a methodical teaching of the right and pure teaching.",
        "source": "T26n1523_004:0228c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼復有四種相應知。",
        "translation": "They also have four kinds of knowledge associated with them.",
        "source": "T26n1523_004:0228c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "染淨中恐怖故；依順說故，離授煩惱因；於淨法中教授，捨恐怖因故；及教授現法，見最樂行方便故。",
        "translation": "It's because of fear in the midst of defilement and purity, because of compliant teaching, which parts with the causes of affliction, because of teaching in pure things, which parts with the causes of fear, and because of teaching in present things, which sees the most pleasant way to conduct oneself.",
        "source": "T26n1523_004:0228c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此身復有我見，以我正證故，依於淨染中順空教授故。",
        "translation": "This body also has a view of self because I correctly realized it, and it's based on teaching conformity to emptiness in the midst of purity and defilement.",
        "source": "T26n1523_004:0228c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言我當無辜生怖染，以染故。",
        "translation": "He says, 'I will be innocent of the fear and defilement that arises from defilement.'",
        "source": "T26n1523_004:0228c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間行是名初相。",
        "translation": "This worldly practice is called the first aspect.",
        "source": "T26n1523_004:0228c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等莫作憶想莫作分別者，煩惱因示現有二種假名性：慢執煩惱分別性故，及執彼功德患勝分別故，是名第二相。",
        "translation": "Those of you who don't make conceptions and don't make discriminations show that there are two kinds of nominal natures of the causes of affliction: those that are based on conceit and attachment to the discriminated nature of afflictions and those that are based on the discrimination of merit and distress, which is called the second aspect.",
        "source": "T26n1523_004:0228c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨略有二種應知：一者淨道行；二者涅槃淨。",
        "translation": "There are two kinds of purity that should be understood: the first is the practice of the pure path, and the second is the purity of nirvāṇa.",
        "source": "T26n1523_004:0228c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有二種相故，淨道行是怖畏因應知。",
        "translation": "Because there are these two kinds of aspects, the practice of the pure path is something to be feared and known.",
        "source": "T26n1523_004:0228c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「汝等比丘！",
        "translation": "\"You monks!",
        "source": "T26n1523_004:0228c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有戒品彼不往來復不滅盡」者，計是真如中永淨故。",
        "translation": "The phrase 'all moral qualities that don't come and go and don't perish' means that they are permanently purified in their true nature.",
        "source": "T26n1523_004:0228c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前者釋有煩惱分別，及離煩惱分別亦不成。",
        "translation": "The aforementioned explanation explains that the existence of afflicted discernment and freedom from afflicted discernment aren't established either.",
        "source": "T26n1523_004:0228c19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼淨道行中煩惱及離煩惱彼分別已，於淨道行中而生恐怖，有二種相故，於淨涅槃因中生恐怖應知。",
        "translation": "After they discriminate between those who are afflicted and those who are free from affliction in the pure path of practice, terror arises in the pure path of practice, and because there are two kinds of characteristics, terror should be known to arise in the cause of pure nirvāṇa.",
        "source": "T26n1523_004:0228c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等可捨離是想，所謂涅槃不異假名性想執故。",
        "translation": "You may abandon this kind of perception, which is called nirvāṇa because it's not different from the perception and attachment to the nature of nominal names.",
        "source": "T26n1523_004:0228c22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫隨於想莫隨非想者，是名涅槃異想，憶作心想故。",
        "translation": "Someone who doesn't follow conceptions and doesn't follow non-conceptions is called having dissimilar conceptions of nirvāṇa and recollects conceptions of mind.",
        "source": "T26n1523_004:0228c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫異想，識想；莫異想，觀名，是名寂滅內心之想。",
        "translation": "Don't think differently about consciousness, and don't think differently about observing names, which is called the extinction of internal mental conceptions.",
        "source": "T26n1523_004:0228c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復莫以想觀想者，此二無因故。",
        "translation": "Again, don't contemplate with thoughts, for these two are without cause.",
        "source": "T26n1523_004:0228c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於涅槃中不生恐怖，是名第三想應知。",
        "translation": "Not to become frightened in nirvāṇa is called the third conception that should be known.",
        "source": "T26n1523_004:0228c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨彼二因故，教授最上行諸方便等應知。",
        "translation": "Abandoning these two causes, he teaches the supreme practice of methods and so forth, which should be known.",
        "source": "T26n1523_004:0228c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨彼二因事及捨煩惱因，於淨法中捨恐怖因，是名第四相應知。",
        "translation": "Abandoning these two causes and abandoning the causes of affliction and abandoning the causes of fear in a pure dharma is called the fourth thing to know.",
        "source": "T26n1523_004:0228c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中乃至如來化度方便應知。",
        "translation": "From there, the Tathāgata's methods of transforming and liberating should be known.",
        "source": "T26n1523_004:0229a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此已後說正智作大益應知。",
        "translation": "From here on, it's said that right knowledge produces great benefit and should be known.",
        "source": "T26n1523_004:0229a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依六事故說：一者為因事；二者依事；三者響音事；四者寂靜思惟事；五者訓誨事；六者證法及順法事故。",
        "translation": "It's explained in terms of six things: first, the thing that serves as a cause; second, the thing that depends on it; third, the thing that resounds with sound; fourth, the thing that's quietly contemplated; fifth, the thing that's instructed; and sixth, the thing that realizes the teaching and goes along with the teaching.",
        "source": "T26n1523_004:0229a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言「爾時尊者須菩提問彼比丘言：汝等比丘！",
        "translation": "He said, \"Venerable Subhūti then asked those monks, 'You monks!",
        "source": "T26n1523_004:0229a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去至何所今何從來？",
        "translation": "Where have we been and where have we come from?",
        "source": "T26n1523_004:0229a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘言：須菩提！",
        "translation": "The monks said, \"Subhūti!",
        "source": "T26n1523_004:0229a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所說法，無所從來、去無所至」。",
        "translation": "There's no place from which a teaching by the Buddha comes or goes, and there's no place to which it arrives.\"",
        "source": "T26n1523_004:0229a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何義故作如是說？",
        "translation": "What does it mean to say this?",
        "source": "T26n1523_004:0229a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初依樂因故。",
        "translation": "The first relies on a pleasant cause.",
        "source": "T26n1523_004:0229a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何義故，彼處無有來往？",
        "translation": "What does it mean that there's no coming or going from that place?",
        "source": "T26n1523_004:0229a08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喻若世間。",
        "translation": "It's like the metaphor for the world.",
        "source": "T26n1523_004:0229a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問誰為汝師？",
        "translation": "\"Again, I'd like to ask, 'Who's your teacher?'",
        "source": "T26n1523_004:0229a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言我等師者，若先來不生亦無有滅」。",
        "translation": "He replied, 'We, the teachers, would have said, 'If in the past nothing was produced, there would be no cessation.'",
        "source": "T26n1523_004:0229a09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何義故作如是說？",
        "translation": "What does it mean to say that?",
        "source": "T26n1523_004:0229a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依第二因事。",
        "translation": "\"It depends on the second causal circumstance.",
        "source": "T26n1523_004:0229a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依非色身世尊故，彼無生亦無滅，是涅槃性故。",
        "translation": "Because they're not the Bhagavān of the form body, they lack birth and cessation and are nirvāṇa in nature.",
        "source": "T26n1523_004:0229a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等云何？",
        "translation": "\"Again, I'd like to ask you, what is it?",
        "source": "T26n1523_004:0229a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從誰聞法？",
        "translation": "From whom did you hear the teaching?",
        "source": "T26n1523_004:0229a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言不為縛、不為解」。",
        "translation": "They replied, 'Not for bonding, not for liberation.'",
        "source": "T26n1523_004:0229a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有何義故作如是說？",
        "translation": "What does it mean to say this?",
        "source": "T26n1523_004:0229a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三依響音因事為說法，彼不為縛。",
        "translation": "\"Third, he speaks the Dharma based on the causal events of resonant sounds, but he isn't bound.",
        "source": "T26n1523_004:0229a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依上等生愛對治故不為解，彼已得脫故。",
        "translation": "They don't become liberated because they're counteracted by craving that arises from above, and they've attained liberation.",
        "source": "T26n1523_004:0229a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等習行何法？",
        "translation": "\"Again, may I ask what things you've been practicing?",
        "source": "T26n1523_004:0229a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰不為滅無明、不為生明」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer, 'Not to extinguish ignorance and not to produce insight'?",
        "source": "T26n1523_004:0229a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四依寂靜思惟事故，不為滅無明故。",
        "translation": "\"The fourth activity of quiet contemplation doesn't cease ignorance for the sake of ceasing ignorance.",
        "source": "T26n1523_004:0229a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為依雜無明，諸聖聞有彼行故。",
        "translation": "It's not for the sake of relying on ignorance that's mixed, or because the noble ones hear about its activity.",
        "source": "T26n1523_004:0229a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為生明者，已生故。",
        "translation": "It's not for the sake of generating insight, but because it has already arisen.",
        "source": "T26n1523_004:0229a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等師是誰？",
        "translation": "\"Again, I'd like to ask you, who are your teachers?",
        "source": "T26n1523_004:0229a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言若無得無知者是」。",
        "translation": "They replied, 'If someone has not attained and doesn't know, they are.'",
        "source": "T26n1523_004:0229a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼弟子若未得及未證者，以何義故作如是說？",
        "translation": "If that disciple has yet to attain or realize it, what does it mean to say that?",
        "source": "T26n1523_004:0229a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依第五訓誨事故。",
        "translation": "\"It's based on the fifth incident of instruction.",
        "source": "T26n1523_004:0229a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有化比丘身勸彼，故第六證法及順法行事，依十事故說應知。",
        "translation": "He encourages them to transform the body of the monk, so the sixth realization of the teaching and conduct in accordance with the teaching are based on ten incidents that should be known.",
        "source": "T26n1523_004:0229a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依有餘涅槃無餘涅槃，滅見諦行煩惱，滅修道行煩惱，滅苦，供養尊者，行布施行過凡夫地，入住聖人地，及同得至解脫故。",
        "translation": "It relies on nirvāṇa with or without remainder, ceases the afflictions of the practice of seeing, ceases the afflictions of the practice of cultivation, ceases suffering, makes offerings to venerable persons, practices administration past the stage of worldlings, enters the stage of sages, and attains liberation together.",
        "source": "T26n1523_004:0229a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等是誰同習梵行？",
        "translation": "\"Again, I'd like to ask who among you is practicing the religious life together.",
        "source": "T26n1523_004:0229a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言若於三界不行亦非不行」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer that says, 'If it's not OK or not OK in the three realms,' then what is the reason for saying that?",
        "source": "T26n1523_004:0229a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無餘涅槃有餘事故，爾時共諸同法者住故。",
        "translation": "There are other circumstances of nirvāṇa without remainder, so at that point they're living together with others who are in the same dharma.",
        "source": "T26n1523_004:0229a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等幾何當得涅槃也？",
        "translation": "\"Again, I'd like to ask how many of you will attain nirvāṇa?",
        "source": "T26n1523_004:0229a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言如若如來所化人入涅槃者，我等亦當得入」，有何義故作如是說？",
        "translation": "What is the point of saying, 'Suppose someone the Tathāgata has converted enters nirvāṇa, we will also enter it'?",
        "source": "T26n1523_004:0229b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依有餘涅槃，彼本起滅故，他力相似法本業應故，爾時共餘者住故。",
        "translation": "Relying on nirvāṇa with remainder, it's because they originally arise and cease, because other powers are similar to the original actions of the Dharma, and because they're abiding with the rest at that point.",
        "source": "T26n1523_004:0229b02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等煩惱盡耶？",
        "translation": "\"Again, may I ask, 'Have you ended your afflictions?'",
        "source": "T26n1523_004:0229b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言一切諸法畢竟盡相」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer that says, 'The ultimate extinction of all phenomena'?",
        "source": "T26n1523_004:0229b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以滅見諦惑故。",
        "translation": "It's because it ceases the delusion of the seeing truth.",
        "source": "T26n1523_004:0229b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切法永滅者，諸趣惡處故。",
        "translation": "The permanent extinction of all dharmas is the result of going to bad places.",
        "source": "T26n1523_004:0229b06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等已得己利耶？",
        "translation": "\"Again, I'd like to ask, have you already attained your own benefit?",
        "source": "T26n1523_004:0229b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言知斷無我無我所」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer that says, 'Knowing that I have ended selflessness and no object of self,' and why does it say so?",
        "source": "T26n1523_004:0229b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依滅修想煩惱故，及滅同生身見故。",
        "translation": "It's because they cease the afflictions of cultivation and perception and because they cease the view of the body of those who are born together.",
        "source": "T26n1523_004:0229b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等破於魔耶？",
        "translation": "\"Again, I'd like to ask, 'Have you refuted Māra?'",
        "source": "T26n1523_004:0229b09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言陰魔不可得」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer, 'The aggregates and Māra are unobtainable', which makes it so?",
        "source": "T26n1523_004:0229b09_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅苦故，及陰魔不可得故，未來生彼不可見故。",
        "translation": "It's because suffering is ended, the aggregates and demons are unobtainable, and future births are invisible to them.",
        "source": "T26n1523_004:0229b10_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故於中降伏一切魔怨應知。",
        "translation": "Therefore, you should know that you're subduing all the demons and resentments within them.",
        "source": "T26n1523_004:0229b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以陰無故，餘魔不行。",
        "translation": "It's because the aggregates are absent that the other Māras can't escape.",
        "source": "T26n1523_004:0229b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等奉如來耶？",
        "translation": "\"Again, I'd like to ask, 'Do you revere the Tathāgata?'",
        "source": "T26n1523_004:0229b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言不以身口心」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer that says, 'Not with body, speech, and mind,' that makes it sound this way?",
        "source": "T26n1523_004:0229b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恭敬尊者不以身等，得涅槃中得親敬故。",
        "translation": "Venerable Maitreya doesn't rely on his body and so forth to attain affection and respect in nirvāṇa.",
        "source": "T26n1523_004:0229b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等作福田耶？",
        "translation": "\"Again, I'd like to ask, 'Are you making a field of merit?'",
        "source": "T26n1523_004:0229b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言無取無有作者」。",
        "translation": "He replied, 'There's no grasping, and there's no author.'",
        "source": "T26n1523_004:0229b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等故作如是說？",
        "translation": "What makes you say this?",
        "source": "T26n1523_004:0229b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "檀越作敬不可取及不可作，離見動惡等故。",
        "translation": "It's undesirable and unacceptable for a donor to pay respect, for it's free of views that move evil and so forth.",
        "source": "T26n1523_004:0229b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如次「復問汝等斷於生死往來也？",
        "translation": "In the next breath, \"Again, may I ask, 'Have you ended birth-and-death and past lives?'",
        "source": "T26n1523_004:0229b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言無常無斷」者，何義故作如是說？",
        "translation": "What does it mean to say, 'impermanent and uninterrupted'?",
        "source": "T26n1523_004:0229b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過非聖人地故。",
        "translation": "It's because he's gone beyond the stage of the unholy.",
        "source": "T26n1523_004:0229b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不斷世間令作少方便非上者，以有涅槃故，此示現不斷等事故。",
        "translation": "Those who don't stop the world and make it work with little skill are not superior because there's nirvāṇa, which shows such things as incessant performance.",
        "source": "T26n1523_004:0229b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等隨順聖人地行耶？",
        "translation": "\"Again, I'd like to ask, 'Do you practice according to the stage of the noble ones?'",
        "source": "T26n1523_004:0229b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言離一切取有得無礙解脫」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer that says, 'Being free of all grasping beings, I attain unhindered liberation'?",
        "source": "T26n1523_004:0229b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住聖人地故，離一切取解脫故，不橫執離不正取故。",
        "translation": "It's because they abide in the stage of sages, are free of all grasping, and are liberated from improper grasping because they don't hold to it sideways.",
        "source": "T26n1523_004:0229b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復問汝等究竟當依止何所？",
        "translation": "\"Again, I'd like to ask, 'Where exactly will you stand?'",
        "source": "T26n1523_004:0229b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言隨於如來化人所至」者，有何義故作如是說？",
        "translation": "What is the meaning of the answer, \"According to the Tathāgata's transformation of people,\" in order to make this statement?",
        "source": "T26n1523_004:0229b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解脫同至，於如來無異勝相似法故，示現解脫同至。",
        "translation": "\"They have the same arrival of liberation, and it's because the Tathāgata has no different or superior resemblance that they show the same arrival of liberation.",
        "source": "T26n1523_004:0229b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復以心得自在諸善男子，是能隨時以能受於正記，為如是尊者故，為次說正記，能作大利益應知。",
        "translation": "Furthermore, these good sons who are comfortable in their minds can readily accept right knowledge and, for the sake of such a venerable person, explain right knowledge in order, which can produce great benefits that should be known.",
        "source": "T26n1523_004:0229b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者密語？",
        "translation": "What's esoteric speech?",
        "source": "T26n1523_004:0229b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不二相智。",
        "translation": "\"He has knowledge of the characteristics of nonduality.",
        "source": "T26n1523_004:0229c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及一切密語入相不二相。",
        "translation": "It's the cognition of all esoteric speech, entry, and characteristics that are not two.",
        "source": "T26n1523_004:0229c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是？",
        "translation": "What's that?",
        "source": "T26n1523_004:0229c01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說句處事，然是彼性無故。",
        "translation": "\"The phrase that's explained refers to a situation, but it's because their nature is nonexistent.",
        "source": "T26n1523_004:0229c02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說性熏一相，境界性相有故不二。",
        "translation": "The nature that's described perfumes a single characteristic, and the nature and characteristics of the objective world are existent and therefore not two.",
        "source": "T26n1523_004:0229c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼不二中生執，二相是染，不執二故名淨。",
        "translation": "In that nonduality, attachment arises, and the two characteristics are defiled; because they don't attach to two, they're called pure.",
        "source": "T26n1523_004:0229c03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖說所有說一切句處有事者，彼亦假名言熏相，境界性無故。",
        "translation": "Even though it's said that there's something in all places where sentences are spoken, it's also called nominally the permeating aspect of language, which is the absence of the nature of the objective realm.",
        "source": "T26n1523_004:0229c04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼二熏相，境界性有故彼二。",
        "translation": "Those two permeating characteristics are two because the nature of the real world exists.",
        "source": "T26n1523_004:0229c06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於彼不二執二相故有染，不執盡故淨。",
        "translation": "Their nonduality is tainted because they attach to two aspects, but they're pure because they don't attach to them completely.",
        "source": "T26n1523_004:0229c06_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一切諸佛入彼密語，是不二相應知。",
        "translation": "Thus, all buddhas enter into their esoteric speech, which is the knowledge associated with nonduality.",
        "source": "T26n1523_004:0229c07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中五種相者，於尊處及彼教授中有五種果事，及有五種果益事，成就持故說諸密事應知。",
        "translation": "Among these five kinds of aspects, there are five kinds of fruition in the honored place and in their teachings, and there are five kinds of fruition that are beneficial and accomplished, so you should know the esoteric things that are explained.",
        "source": "T26n1523_004:0229c08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五種相。",
        "translation": "There are five kinds of characteristics.",
        "source": "T26n1523_004:0229c10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者五種尊？",
        "translation": "What are the five kinds of honored ones?",
        "source": "T26n1523_004:0229c11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有想說彼成就故，成就尊事應知。",
        "translation": "If there's a conception that speaks of their accomplishment, the accomplishment of the honored thing should be known.",
        "source": "T26n1523_004:0229c11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有何義？",
        "translation": "What else does it mean?",
        "source": "T26n1523_004:0229c12_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂涅槃永證彼故。",
        "translation": "It's called nirvāṇa because it's permanently realized.",
        "source": "T26n1523_004:0229c12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所說法無所從來去無所至，離六種入滅故。",
        "translation": "Because there's no place to come from, no place to go, and no place to reach when a Buddha teaches, it's because they're free of the six kinds of entry and cessation.",
        "source": "T26n1523_004:0229c12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼界中諸有等，謗不能謗故，及無分別覺故。",
        "translation": "It's because all beings in that realm are denigrated and can't be denigrated, and because there's no discriminating awakening.",
        "source": "T26n1523_004:0229c13_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法，何者是彼尊而能說法？",
        "translation": "Of all the things that exist, which is the one who honors and can teach?",
        "source": "T26n1523_004:0229c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有何相？",
        "translation": "What are their characteristics?",
        "source": "T26n1523_004:0229c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先來未生亦無有滅，依法身無生滅故。",
        "translation": "\"Before there was birth, there was no cessation, so according to the Dharma body there was no birth or cessation.",
        "source": "T26n1523_004:0229c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說何等法？",
        "translation": "What kind of dharma is being explained?",
        "source": "T26n1523_004:0229c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不為縛不為解。",
        "translation": "\"If it's not binding, then it's not freeing.",
        "source": "T26n1523_004:0229c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縛解者，性相無故。",
        "translation": "When someone is bound and freed, the nature and characteristics are absent.",
        "source": "T26n1523_004:0229c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為令覺知諸行故，以幾種性相說？",
        "translation": "How many kinds of nature and characteristics are explained for the purpose of awakening the awareness of conditioned phenomena?",
        "source": "T26n1523_004:0229c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不斷滅無明、不生明故。",
        "translation": "It's because ignorance is not destroyed and ignorance doesn't arise.",
        "source": "T26n1523_004:0229c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明與無明假名性，不可得見覺故。",
        "translation": "The nominal natures of light and nescience can't be seen and awakened to.",
        "source": "T26n1523_004:0229c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為誰說？",
        "translation": "For whom do they speak?",
        "source": "T26n1523_004:0229c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若未得及未正覺。",
        "translation": "\"If someone has yet to attain and hasn't yet correctly awakened, then they won't.",
        "source": "T26n1523_004:0229c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正覺不已彼無故。",
        "translation": "It's because they haven't attained right awakening and haven't yet attained it.",
        "source": "T26n1523_004:0229c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者成就果勝事？",
        "translation": "What are the excellent things that accomplish the fruit?",
        "source": "T26n1523_004:0229c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂無餘涅槃界故。",
        "translation": "It's because of the nirvāṇa without remainder realm.",
        "source": "T26n1523_004:0229c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於三界不行，依無餘涅槃界處，唯淨真如住處故，作如是說有餘涅槃界。",
        "translation": "If someone doesn't practice in the three realms and relies on the state of the nirvāṇa without remainder, they say this is the state of nirvāṇa with remainder because it's only the abode of pure true thusness.",
        "source": "T26n1523_004:0229c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如來化者，而入涅槃真實處，唯有性涅槃。",
        "translation": "If the Tathāgata transforms someone and they enter the true state of nirvāṇa, it's only nirvāṇa with a nature.",
        "source": "T26n1523_004:0229c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法依世諦涅槃故作如是說，能滿聖道行，所作已辦故。",
        "translation": "He thus explains that all things rely on nirvāṇa in the conventional truth, which fulfills the practice of the noble path because he has accomplished what he's doing.",
        "source": "T26n1523_004:0229c24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言我作已辦，於有我無我我所，依證法無我故作如是說。",
        "translation": "When they say 'accomplished what I did,' they say this based on the realization that things are selfless when they are selfless and selfless in nature.",
        "source": "T26n1523_004:0229c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伐內怨以內力故，諸煩惱怨以證法無我故，永滅說故作如是言。",
        "translation": "He says this because he fights internal enemies because of internal power, and he explains the permanent extinction of afflictive enmity because he's realized the selflessness of principles.",
        "source": "T26n1523_004:0229c27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伐外怨不覺見陰魔故，所有外陰所攝。",
        "translation": "It's because external enemies don't perceive aggregates and demons, and they're included in external aggregates.",
        "source": "T26n1523_004:0229c28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陰者，外怨聲說應知。",
        "translation": "'Aggregates' are external enemies that should be known by voice and speech.",
        "source": "T26n1523_004:0229c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝彼者，離分別念，陰性不覺故應知。",
        "translation": "He's superior to them because he's free of discriminating thoughts and doesn't perceive the nature of the aggregates.",
        "source": "T26n1523_004:0230a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中成就果利益事者，已恭敬於尊，非身等耳，以順行法故。",
        "translation": "This is a person who has accomplished the beneficial deeds of fruition and has paid respect to the venerable, not physically, because he follows the practice of the Dharma.",
        "source": "T26n1523_004:0230a02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善淨受信施所施故，以了福田不取一切法故，度世間苦海。",
        "translation": "He well and purely accepts the gift of faith and that which is given, and he crosses the ocean of worldly suffering because he understands the field of merit and doesn't grasp all dharmas.",
        "source": "T26n1523_004:0230a03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "度世間者，以法無我，不斷及常故，不退於福田處故。",
        "translation": "Those who pass through the world will not retreat from the field of merit because things are without self and are neither continuous nor permanent.",
        "source": "T26n1523_004:0230a04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行福田地，捨取法慢故。",
        "translation": "He practices in the field of merit and abandons pride in the Dharma.",
        "source": "T26n1523_004:0230a06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及法化者名成佛子，依如來故。",
        "translation": "Those who are transformed by the Dharma are called becoming the children of the Buddha because they rely on the Tathāgata.",
        "source": "T26n1523_004:0230a06_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言汝等何行去無所至者，如如來所化者來故。",
        "translation": "Those of you who say, 'What are your ways that lead to nowhere?' It's because those converted by the Tathāgata come.",
        "source": "T26n1523_004:0230a07_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「須菩提如是問答諸比丘，時有八百比丘不受諸法心得解脫，三萬二千人遠塵離垢得法眼淨」者，此正授記中有此大利益事。",
        "translation": "\"When Subhūti thus questioned and answered the monks, 800 monks didn't accept the teachings and attained liberation, and 32,000 people became dustless and spotless and attained purification of the Dharma eye,\" this was a great benefit in the correct prediction.",
        "source": "T26n1523_004:0230a08_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有學者得無學，成熟凡夫得有學地。",
        "translation": "If there are scholars who attain the stage of no-training, then matured worldlings will attain the stage of training.",
        "source": "T26n1523_004:0230a11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T26n1523_004:0230a12_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此寶積法門是希有，能與住大乘善男子善女人作大利益」者，自此已後顯此法門說大利益事，以有益故。",
        "translation": "The phrase \"this jeweled dharma-gate is rare and can provide great benefit to good men and good women who abide in the great vehicle\" shows that from here on out, this dharma-gate explains things that are of great benefit because they are beneficial.",
        "source": "T26n1523_004:0230a12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸菩薩成佛法，及化眾生故，以中道義訓誨等如次。",
        "translation": "It's because the bodhisattvas become buddhas and teach sentient beings with the teaching of the middle way, and so forth.",
        "source": "T26n1523_004:0230a14_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼善男子善女人得幾功德者，示現聞菩薩藏中有教誨信益事。",
        "translation": "How many virtues will those good sons and good women attain who demonstrate the faithful benefit of hearing about the teachings in the bodhisattva canon?",
        "source": "T26n1523_004:0230a15_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "\"Kāśyapa!",
        "source": "T26n1523_004:0230a17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子善女人」如是等，示現有五種相現利益信事。",
        "translation": "\"If there are good men and good women\" and so forth, they show five ways to present themselves as a benefit and faith.",
        "source": "T26n1523_004:0230a17_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一世界持時大德；二自在成就退因故；三轉身故；四彼處故，成就說堪作器故；五聽者作器故，及捨身時得見淨業故。",
        "translation": "One is the great virtue of the world when it's maintained, two is because it freely accomplishes the cause of regression, three is because it transforms the body, four is because it's there, accomplishes the teaching that it's worthy of being a vessel, five is because it's a vessel for those who hear it, and it's because it's possible to see pure activities when it's time to abandon the body.",
        "source": "T26n1523_004:0230a18_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中世界大者，佛及彼聲聞并諸塔等。",
        "translation": "The world in question is large because of the buddhas, their direct disciples, and the stūpas.",
        "source": "T26n1523_004:0230a21_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持者，諸寶滿諸世界衣服等，是時無量阿僧祇劫故。",
        "translation": "Those who hold them are the jewels that fill the worlds with clothing and so forth for measureless incalculably long eons.",
        "source": "T26n1523_004:0230a22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中有五種相，得大自在因退事應知：以有量悕無量果因故，以有盡無盡法故，以非上得上樂故，助知道彼行性故，及以彼引取故。",
        "translation": "Here are five ways to attain great freedom because of regression: because there are measureable names and immeasurable causes of retreat, because there are endless and inexhaustible qualities, because it's not the highest attaining the highest happiness, because it helps to know their nature of action, and because it leads to their apprehension.",
        "source": "T26n1523_004:0230a23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五種相，令得成就大自在退因事應知：一微惡樂因故；二不定一向樂因故；三不永樂因故；四顛倒意受樂因故；五依苦身受樂因故，是名彼者。",
        "translation": "You should also know that there are five further ways to achieve great freedom as a cause: first, because it's a cause of subtle bad pleasure; second, because it's uncertain and always a cause of pleasure; third, because it's not a cause of permanent pleasure; fourth, because it's a cause of pleasure to mistaken thought; and fifth, because it's a cause of pleasure to rely on the body of suffering, which is called that.",
        "source": "T26n1523_004:0230a26_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最後受女身轉身故，及彼地處所敬如聖塔故，彼處所以為作器故。",
        "translation": "It's because they finally receive the transformation body of a woman, and because they venerate that place as a sacred stūpa, which is why it's a vessel for them.",
        "source": "T26n1523_004:0230a29_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨彼法法所讀誦受持等者，明說者，為作器故。",
        "translation": "Those who recite and memorize the Dharma according to that Dharma explain that it's for making a vessel.",
        "source": "T26n1523_004:0230b02_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼人命終時得見如來，得身口意業清淨，捨身時得見淨故。",
        "translation": "When his life ends, he'll see the Tathāgata and attain purity of body, speech, and thought, and when he abandons his body, he'll see purity.",
        "source": "T26n1523_004:0230b03_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及得淨業故，無有諸患，而令命終離諸苦受故。",
        "translation": "As a result of attaining purified actions, there are no sufferings, and he's freed from painful feelings at the end of his life.",
        "source": "T26n1523_004:0230b04_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及以離憂惱因故，憂惱心不能降伏故。",
        "translation": "And because they're free of the causes of grief, their grieving mind can't be subdued.",
        "source": "T26n1523_004:0230b05_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不動眴諸目，識諦知諸意有故。",
        "translation": "He doesn't disturb or dazzle his eyes, so he consciously knows that thoughts exist.",
        "source": "T26n1523_004:0230b06_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不動搖手足，成就威儀故。",
        "translation": "He doesn't move his hands and feet because he's accomplished in demeanor.",
        "source": "T26n1523_004:0230b07_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不失大小便胸分無汗，以無畏故。",
        "translation": "He doesn't lose his bowels and doesn't sweat at his chest because he has no fear.",
        "source": "T26n1523_004:0230b08_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不作捲不摸空，無諸惡相故。",
        "translation": "He doesn't roll or touch emptiness because he has no bad appearances.",
        "source": "T26n1523_004:0230b08_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨坐而捨受命者，以身調伏故。",
        "translation": "Someone who takes orders as they sit is disciplined because they are physically disciplined.",
        "source": "T26n1523_004:0230b09_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善正言音者，以離諸畏難故。",
        "translation": "He speaks and sounds well and correctly because he's free of fear and difficulty.",
        "source": "T26n1523_004:0230b10_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滑利言音者，以離澁惡言故。",
        "translation": "\"Smooth speech and voice\" is because it's free of harsh speech.",
        "source": "T26n1523_004:0230b11_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上妙言音者，以上妙言說諸佛如來妙法語故。",
        "translation": "\"Excellent speech and voice\": That's because he speaks the wonderful words of the Tathāgatas' wonderful teachings in the above wonderful words.",
        "source": "T26n1523_004:0230b11_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛樂言音者，讚歎說諸如來故。",
        "translation": "\"A voice that loves words and sounds is because it praises and speaks praises of the Tathāgatas.",
        "source": "T26n1523_004:0230b12_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天人所樂擁護言音及柔軟言音者，同法者以理施答對故。",
        "translation": "Those among gods and humans who delight in defending speech and soft speech respond to those who share the same principles with a rational response.",
        "source": "T26n1523_004:0230b13_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不背說言音者，以無諸妄故。",
        "translation": "Those who don't speak or make sounds contrary to the truth because there are no falsehoods.",
        "source": "T26n1523_004:0230b14_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快說言音者，前後言不相違故。",
        "translation": "Those who are quick to speak and make sounds are not contradictory to what's said before and after.",
        "source": "T26n1523_004:0230b15_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可取言音者，不違順理語故。",
        "translation": "Desirable speech and voice is because it doesn't contradict logical speech.",
        "source": "T26n1523_004:0230b16_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天擁護言音者，信佛法諸天擁護故。",
        "translation": "\"The gods uphold speech and sounds because faith in the Buddha's teaching is upheld by the gods.",
        "source": "T26n1523_004:0230b16_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛所擁護言音者，諸佛攝取故，不瞋現得惡能忍故。",
        "translation": "Those whose speech and voice are guarded by the buddhas are taken in by the buddhas because they don't get angry and can tolerate present evil.",
        "source": "T26n1523_004:0230b17_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不恨者，能忍過去惡故。",
        "translation": "Someone who doesn't hate is able to tolerate past evils.",
        "source": "T26n1523_004:0230b18_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不忿惱者，不覆諸惡故。",
        "translation": "Those who aren't angered don't cover up evil.",
        "source": "T26n1523_004:0230b19_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不懷報者，憂悔等熱不能燒故。",
        "translation": "Someone who doesn't harbor retribution won't be able to burn the fever of regret and so forth.",
        "source": "T26n1523_004:0230b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不計過患者，不悕求貪欲等故。",
        "translation": "He doesn't impute faults because he doesn't long for desires and so forth.",
        "source": "T26n1523_004:0230b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不懷者，以不悕求保故。",
        "translation": "He doesn't harbor because he doesn't long for security.",
        "source": "T26n1523_004:0230b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有異相不怯弱心於戒法中者，不取異見故。",
        "translation": "He has no different characteristics and doesn't falter in mind when it comes to the precepts, so he doesn't hold different views.",
        "source": "T26n1523_004:0230b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常不放逸勤心精進者，不亂寂靜心故。",
        "translation": "He's always nonfrivolous and diligent in his mental effort because he doesn't disturb the stillness of mind.",
        "source": "T26n1523_004:0230b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不怯弱心取佛世界清淨者，以不喜自身諸佛菩薩所持而取上妙佛世界故。",
        "translation": "Whoever takes the Buddha world for its purity with a mind that isn't fainthearted, it's because he doesn't like what the buddhas and bodhisattvas themselves hold and takes the higher, more marvelous Buddha world.",
        "source": "T26n1523_004:0230b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離慢及增上慢者，得一切佛法現氣故。",
        "translation": "Whoever is free of conceit and increased conceit will attain the present energy of all the buddha-teachings.",
        "source": "T26n1523_004:0230b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離慢及增上慢者，世間三昧三摩拔提，微細深心分別以不求，以用一切佛法現氣因，得不以勝。",
        "translation": "Those who are free of conceit and increased conceit are those whose worldly samādhi and subtle, deep mind discriminates and doesn't seek, and who use the apparent energy of all buddha-dharmas as a cause to attain something that's not based on superiority.",
        "source": "T26n1523_004:0230b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸佛三昧為菩薩藏，得教誨中正信利益事。",
        "translation": "All the buddha samādhis are the bodhisattva canon, and they attain the benefits of right faith in the teachings.",
        "source": "T26n1523_004:0230b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量阿僧祇，彼分別從本差別，信益轉無量無邊阿僧祇應知耳。",
        "translation": "Thus, there are measureless incalculable differences in their discernment from the beginning, and the benefits of faith are boundless and limitless, as you should know.",
        "source": "T26n1523_004:0230c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　作此寶積論，　　我所得功德，　以勇意淨故，　　願世得究竟。",
        "translation": "I've gained the merit of making this jeweled accumulation of treatises, and because of the purity of my courageous intentions, I wish to attain the ultimate in the world.",
        "source": "T26n1523_004:0230c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　妙法寶積經，　　無垢大智明，　此論除翳障，　　造寫所得福。",
        "translation": "The Sutra on the Accumulation of Treasures of the Wonderful Dharma, the great luminosity of undefiled cognition, this treatise removes the cataracts and creates the merits that result from its writing.",
        "source": "T26n1523_004:0230c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所有著諸見，　　及墮無智網，　無障礙佛眼，　　願世速令得。",
        "translation": "All those who are attached to views and fall into the net of nescience, the unobstructed Buddha-eye, may the world quickly attain it.",
        "source": "T26n1523_004:0230c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大寶積經論卷第四",
        "translation": "Treatise on the Sutra of the Great Collection of Jewels, Volume 4",
        "source": "T26n1523_004:0230c09_0",
        "is_bad_quality": false
    }
]