[
    {
        "source_sentence": "阿毘達磨集異門足論卷第二",
        "translation": "Collection of Different Aspects of the Abhidharma Path, Vol. 2",
        "source": "T26n1536_002:0370c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尊者舍利子說",
        "translation": "Venerable Śāriputra said",
        "source": "T26n1536_002:0370c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T26n1536_002:0370c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二法品第三之二",
        "translation": "Third of the Two Categories of Practices",
        "source": "T26n1536_002:0370c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂入定善巧、出定善巧者，入定善巧云何？",
        "translation": "\"Again, there are two things, which are the skillful entry into concentration and the skillful exit from concentration.",
        "source": "T26n1536_002:0370c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：定謂八部八蘊定，即四靜慮、四無色定。",
        "translation": "A: Concentration refers to the eight divisions and eight aggregates of concentration, which are the four meditations and the four formless concentrations.",
        "source": "T26n1536_002:0370c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入定善巧，謂如實知見如是補特伽羅入初靜慮定，如是補特伽羅乃至入非想非非想處定。",
        "translation": "Entering concentration skillfully means truly knowing and seeing that such a person enters the concentration of first concentration, and thus that person enters the concentration of neither perception nor non-perception up to and including the abode of non-perception.",
        "source": "T26n1536_002:0370c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見如是補特伽羅，於初靜慮定有善巧作意，如是補特伽羅乃至於非想非非想處定有善巧作意。",
        "translation": "Furthermore, he truly knows and sees that such a person has skillful contemplation in the concentration of first concentration, and that such a person has skillful contemplation even in the concentration of neither perception nor non-perception.",
        "source": "T26n1536_002:0370c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見如是補特伽羅入初靜慮道，如是補特伽羅乃至入非想非非想處道。",
        "translation": "Furthermore, he truly knows and sees that such a person enters the path of first meditation, and such a person enters the path of neither perception nor non-perception up to the point of entering the abode of non-perception.",
        "source": "T26n1536_002:0370c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見如是補特伽羅，於入初靜慮道有善巧作意，如是補特伽羅乃至於入非想非非想處道有善巧作意。",
        "translation": "\"Furthermore, he truly knows and sees that such a person has skillful contemplation when entering the path of first concentration, and such a person has skillful contemplation even when entering the path of neither perception nor non-perception.",
        "source": "T26n1536_002:0370c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其事云何？",
        "translation": "What are these things?",
        "source": "T26n1536_002:0370c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有說言：我如是作意、如此作意，於入初靜慮定乃至入非想非非想處定，善等了、善近了、善分別、善思惟、善通達。",
        "translation": "\"As it's said, 'Thus I contemplate and thus I contemplate, and in the concentration of entering the first concentration and even the concentration of entering the abode of neither perception nor non-perception, I well equipoise, well approximate, well discern, well contemplate, and well comprehend.'",
        "source": "T26n1536_002:0370c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是想、如是觀、如是勝解、如是任持、如是分別，於入初靜慮定乃至入非想非非想處定，善等了乃至善通達。",
        "translation": "As I thus conceptualize, thus observe, thus resolve, thus maintain, and thus discern, I well equipoise and well penetrate the concentration of entering the first concentration of meditation ... [and] the concentration of entering the abode of neither perception nor non-perception.",
        "source": "T26n1536_002:0370c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是攝心、策心、伏心、持心、舉心、捨心、制心、縱心，於入初靜慮定乃至入非想非非想處定，善等了乃至善通達。",
        "translation": "Thus do I collect the mind, stimulate the mind, control the mind, maintain the mind, uplift the mind, equip the mind, control the mind, and connive at the concentration of entering the first concentration and even the concentration of entering the abode of neither perception nor non-perception, which are well comprehended and well-understood.",
        "source": "T26n1536_002:0370c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是法於入定及入定善巧，無作用、無利益，無多所作但為障礙，我於此法善等了乃至善通達。",
        "translation": "Thus, I have no effect or benefit from entering concentration and the skillful means for entering concentration, and I don't do much but obstruct, and I well equally comprehend and well understand this teaching.",
        "source": "T26n1536_002:0370c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是法於入定及入定善巧，有作用、有利益，有多所作不為障礙，我於此法善等了乃至善通達。",
        "translation": "I thus have an effect and benefit from entering concentration and the skillful means for entering concentration, and there's much to do that isn't an obstruction, and I well equally comprehend and well understand this teaching.",
        "source": "T26n1536_002:0370c28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於如是入種種定中，解了、等了、近了、遍了，機黠通達審察聰叡，覺明慧行毘鉢舍那，是謂入定善巧。",
        "translation": "In thus entering various kinds of concentration, I understand, equally understand, nearly understand, and completely understand them, have intelligence and comprehension, examine and wisely observe them, and practice vipaśyanā with awareness and insight, which is called skillfulness in entering concentration.",
        "source": "T26n1536_002:0371a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出定善巧云何？",
        "translation": "What's the skillful way of exiting concentration?",
        "source": "T26n1536_002:0371a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：定謂八部八蘊定，即四靜慮、四無色定。",
        "translation": "A: Concentration refers to the eight divisions and eight aggregates of concentration, which are the four meditations and the four formless concentrations.",
        "source": "T26n1536_002:0371a04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出定善巧，謂如實知見如是補特伽羅出初靜慮定，如是補特伽羅乃至出非想非非想處定。",
        "translation": "Skillful egress from concentration means truly knowing and seeing that such a person is egressing from the concentration of initial meditation, and such a person is egressing from the concentration of neither perception nor non-perception up to and including the abode of non-perception.",
        "source": "T26n1536_002:0371a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見如是補特伽羅於出初靜慮定有善巧作意，如是補特伽羅乃至於出非想非非想處定有善巧作意。",
        "translation": "Furthermore, he truly knows and sees that such a person has skillful contemplation when emerging from the concentration of first concentration, and he truly knows and sees that such a person has skillful contemplation even when emerging from the concentration of neither perception nor non-perception.",
        "source": "T26n1536_002:0371a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見如是補特伽羅出初靜慮道，如是補特伽羅乃至出非想非非想處道。",
        "translation": "Furthermore, he truly knows and sees that such a person is emerging from the path of first meditation, and such a person is emerging from the path of neither perception nor non-perception up to the point of non-perception.",
        "source": "T26n1536_002:0371a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見如是補特伽羅於出初靜慮道有善巧作意，如是補特伽羅乃至於出非想非非想處道有善巧作意。",
        "translation": "Furthermore, he truly knows and sees that such a person has skillful contemplation when emerging from the path of first meditation, and such a person has skillful contemplation even when emerging from the path of neither perception nor non-perception.",
        "source": "T26n1536_002:0371a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其事云何？",
        "translation": "What are these things?",
        "source": "T26n1536_002:0371a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如有說言：我如是作意、如此作意，於出初靜慮定乃至出非想非非想處定，善等了、善近了、善分別、善思惟、善通達。",
        "translation": "\"As it's said, 'Thus I contemplate and thus I contemplate, and in the concentration of emerging from the first concentration and even the concentration of emerging from the abode of neither perception nor non-perception, I well equip myself, well approximate, well discern, well contemplate, and well comprehend.'",
        "source": "T26n1536_002:0371a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是想、如是觀、如是勝解、如是任持、如是分別，於出初靜慮定乃至出非想非非想處定，善等了乃至善通達。",
        "translation": "As I thus conceptualize, thus observe, thus resolve, thus maintain, and thus discern, I well equipoise and well penetrate the concentration of emerging from the first concentration and even the concentration of emerging from the abode of neither perception nor non-perception.",
        "source": "T26n1536_002:0371a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是攝心、策心、伏心、持心、舉心、捨心、制心、縱心，於出初靜慮定乃至出非想非非想處定，善等了乃至善通達。",
        "translation": "Thus do I collect the mind, stimulate the mind, control the mind, maintain the mind, uplift the mind, equip the mind, control the mind, and connive at the concentration of emerging from the first concentration up to the concentration of emerging from the abode of neither perception nor non-perception, which are well comprehended and well penetrated.",
        "source": "T26n1536_002:0371a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是法，於出定乃至出定善巧，無作用、無利益，無多所作但為障礙，我於此法善等了乃至善通達。",
        "translation": "Thus, I have this method of emerging from concentration ... even the skillful means of emerging from concentration that have no effect and no benefit and don't do much but serve as obstacles, and I well equally comprehend and well understand this method.",
        "source": "T26n1536_002:0371a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我如是法，於出定乃至出定善巧，有作用、有利益，有多所作不為障礙，我於此法善等了乃至善通達。",
        "translation": "I thus have a method that has effect and benefit in the concentration of emancipation and even the skillful means of emancipation, and there's much to do that isn't an obstruction, and I well comprehend and well understand that method.",
        "source": "T26n1536_002:0371a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於如是出種種定中，解了乃至毘鉢舍那，是謂出定善巧。",
        "translation": "In thus emerging from various kinds of concentration, this is called skillfulness in emerging from concentration that's understood up to vipaśyanā.",
        "source": "T26n1536_002:0371a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂界善巧、作意善巧者，界善巧云何？",
        "translation": "There are also two things, which are skillful in the objective world and skillful in contemplation, but what's skillful in the objective world?",
        "source": "T26n1536_002:0371a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如有苾芻如實知見十八界，謂眼界、色界、眼識界，耳界、聲界、耳識界，鼻界、香界、鼻識界，舌界、味界、舌識界，身界、觸界、身識界，意界、法界、意識界。",
        "translation": "Answer: If a monk truly knows and sees the 18 elements, that is, the element of vision, form, and visual consciousness, the element of ear, sound, and ear consciousness, the element of nose, odor, and nose consciousness, the element of tongue, taste, and tongue consciousness, the element of body, touch, and body consciousness, and the element of mind, dharmas, and consciousness.",
        "source": "T26n1536_002:0371a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見六界，謂地界、水界、火界、風界、空界、識界。",
        "translation": "Furthermore, he truly knows and sees the six elements, which are the element of earth, element of water, element of fire, element of wind, element of air, and element of consciousness.",
        "source": "T26n1536_002:0371b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見六界，謂欲界、恚界、害界、出離界、無恚界、無害界。",
        "translation": "Furthermore, he truly knows and sees the six elements, which are the desire element, the anger element, the harmful element, the element of emancipation, the element without anger, and the element without harmfulness.",
        "source": "T26n1536_002:0371b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見六界，謂樂界、苦界、喜界、憂界、捨界、無明界。",
        "translation": "Furthermore, he truly knows and sees the six elements, which are the element of pleasure, the element of suffering, the element of joy, the element of sorrow, the element of equanimity, and the element of ignorance.",
        "source": "T26n1536_002:0371b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見四界，謂受界、想界、行界、識界。",
        "translation": "Furthermore, he truly knows and sees the four elements, which are the element of feeling, the element of perception, the element of volition, and the element of consciousness.",
        "source": "T26n1536_002:0371b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見三界，謂欲界、色界、無色界。",
        "translation": "Furthermore, he truly knows and sees the three realms, which are the desire realm, the form realm, and the formless realm.",
        "source": "T26n1536_002:0371b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見三界，謂色界、無色界、滅界。",
        "translation": "Furthermore, he truly knows and sees the three elements, which are the form realm, the formless realm, and the cessation realm.",
        "source": "T26n1536_002:0371b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見三界，謂過去界、未來界、現在界。",
        "translation": "Furthermore, he truly knows and sees the three elements, which are the past element, the future element, and the present element.",
        "source": "T26n1536_002:0371b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見三界，謂劣界、中界、妙界。",
        "translation": "Furthermore, he truly knows and sees the three elements, which are the inferior element, the middle element, and the marvelous element.",
        "source": "T26n1536_002:0371b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見三界，謂善界、不善界、無記界。",
        "translation": "Furthermore, he truly knows and sees the three elements, which are the good element, the unskillful element, and the indeterminate element.",
        "source": "T26n1536_002:0371b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見三界，謂學界、無學界、非學非無學界。",
        "translation": "Furthermore, he truly knows and sees the three elements, which are the element of training, the element of no-training, and the element of neither training nor no-training.",
        "source": "T26n1536_002:0371b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見二界，謂有漏界、無漏界。",
        "translation": "Furthermore, he truly knows and sees the two realms, which are the contaminated realm and the uncontaminated realm.",
        "source": "T26n1536_002:0371b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次如實知見二界、謂有為界、無為界。",
        "translation": "Furthermore, he truly knows and sees the two elements, which are the realm of existence and the realm of nothingness.",
        "source": "T26n1536_002:0371b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於如是種種界，解了、等了、近了、遍了，機黠通達審察聰叡，覺明慧行毘鉢舍那，是謂界善巧。",
        "translation": "In these various elements, their understanding, equipoise, nearness, and pervasiveness are comprehended, their intelligence is penetrated, and they perceive, understand, and conduct themselves with insight and vipaśyanā, which is called skillful means of contemplating the elements.",
        "source": "T26n1536_002:0371b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作意善巧云何？",
        "translation": "What's the skillfulness of contemplation?",
        "source": "T26n1536_002:0371b18_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如有苾芻，或受持素呾纜、或受持毘奈耶、或受持阿毘達磨，或聞親教師說、或聞軌範師說、或聞展轉傳授藏說、或聞隨一如理者說，依止如是如理所引聞所成慧，於眼界乃至意識界有善巧作意，思惟非常、苦、空、非我。",
        "translation": "A: If a monk is trained in the practice of sūtra, the practice of vinaya, or the practice of abhidharma, or he hears his teacher teach, he hears a model teacher teach, he hears a transmission collection teach, or he hears a teacher who follows the principle, and he relies on the wisdom that results from hearing such things as the principle, then he has skillful contemplation in the eye realm ... the consciousness realm, contemplating what's impermanent, painful, empty, and not self.",
        "source": "T26n1536_002:0371b18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於地界乃至識界有善巧作意，思惟非常苦空非我。",
        "translation": "In the element of earth and up to the element of consciousness, he has skillful contemplation, contemplating that it's neither permanent nor painful, empty or not self.",
        "source": "T26n1536_002:0371b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於欲、恚、害界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the desire, hate, and harmfulness realms, he contemplates that it's neither permanent nor painful, empty, or not self.",
        "source": "T26n1536_002:0371b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於出離、無恚、無害界有善巧作意，思惟非常空非我。",
        "translation": "With skillful contemplation in the realms of emancipation, absence of anger, and absence of harmfulness, he contemplates that what's neither permanent nor empty is not self.",
        "source": "T26n1536_002:0371b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於樂、苦、喜、憂、捨、無明界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the realms of pleasure, pain, joy, sorrow, equanimity, and ignorance, he contemplates that what's very painful is empty and not self.",
        "source": "T26n1536_002:0371b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於受、想、行、識界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the feeling, perception, volition, and consciousness realms, he contemplates that what's very painful is empty and not self.",
        "source": "T26n1536_002:0371b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於欲、色、無色界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the realms of desire, form, and formlessness, he contemplates that it's neither painful nor empty and that it's not self.",
        "source": "T26n1536_002:0371b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於色、無色界有善巧作意，思惟非常苦空非我；於滅界有善巧作意，思惟空非我。",
        "translation": "In the form and formless realms, he has skillful contemplation and contemplates that it's not self and that it's not self when it's very painful, and in the cessation realm he has skillful contemplation and contemplates that it's not self when it's empty.",
        "source": "T26n1536_002:0371c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於過去、未來、現在界有善巧作意，思惟非常苦空非我。",
        "translation": "In the realms of past, future, and present, he has skillful contemplation and contemplates that it's neither permanent nor painful emptiness nor self.",
        "source": "T26n1536_002:0371c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於劣、中界有善巧作意，思惟非常苦空非我；於妙界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the lesser and middle realms, he contemplates that it's neither painful nor empty and that it's not self; and with skillful contemplation in the marvelous realm, he contemplates that it's neither painful nor empty nor self.",
        "source": "T26n1536_002:0371c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善、不善、無記界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the good, unskillful, and indeterminate realms, he contemplates that it's not self and not very painful emptiness.",
        "source": "T26n1536_002:0371c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於學、無學界有善巧作意，思惟非常空非我；於非學非無學界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the realms of training and post-training, he contemplates that it's not self and that it's not self because of non-emptiness, and with skillful contemplation in the realms of neither training nor post-training, he contemplates that it's not self because of non-emptiness because of non-suffering.",
        "source": "T26n1536_002:0371c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於有漏界有善巧作意，思惟非常苦空非我；於無漏界有善巧作意，思惟非常苦空非我。",
        "translation": "With skillful contemplation in the contaminated realm, he contemplates that it's neither very painful nor empty and not self; with skillful contemplation in the uncontaminated realm, he contemplates that it's neither very painful nor empty nor self.",
        "source": "T26n1536_002:0371c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於有為界有善巧作意，思惟非常苦空非我；於無為界有善巧作意，思惟空非我。",
        "translation": "With skillful contemplation in the realm of the existent, they contemplate that impermanent suffering is empty and not self, and with skillful contemplation in the realm of the impermanent, they contemplate that emptiness is not self.",
        "source": "T26n1536_002:0371c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，如有苾芻如實知見過去未來現在作意、善不善無記作意、欲界繫色界繫無色界繫作意、學無學非學非無學作意、見所斷修所斷非所斷作意，於如是等種種作意，解了乃至毘鉢舍那，是謂作意善巧。",
        "translation": "Furthermore, if a monk truly knows and sees past, future, and present contemplations, good, unskillful, and indeterminate contemplations, contemplations bound to the desire realm, contemplations bound to the form realm and the formless realm, contemplations that are learned, unlearned, and undisciplined, and contemplations that are cut off by views, cultivated, and uncut, and understands these various contemplations up to Vipaśyanā, this is called skillful contemplation.",
        "source": "T26n1536_002:0371c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂質直、柔和者，質直云何？",
        "translation": "There are also two things, namely, directness and gentleness, and what's directness?",
        "source": "T26n1536_002:0371c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：心不剛性、心不強性、心不硬性、心純質性、心正直性、心潤滑性、心柔軟性、心調順性，是謂質直。",
        "translation": "Answer: A mind that's not rigid, a mind that's not strong, a mind that's not hard, a mind that's pure, a mind that's upright, a mind that's smooth, a mind that's flexible, and a mind that's compliant is called quality and straightness.",
        "source": "T26n1536_002:0371c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "柔和云何？",
        "translation": "What is softness?",
        "source": "T26n1536_002:0371c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：身不剛性、身不強性、身不硬性、身純質性、身正直性、身潤滑性、身柔軟性、身調順性，是謂柔和。",
        "translation": "Answer: A body that's not rigid, not strong, not hard, pure, straight, smooth, flexible, and compliant is called gentle.",
        "source": "T26n1536_002:0371c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂堪忍、可樂者，堪忍云何？",
        "translation": "There are also two things that are tolerable and enjoyable: what's tolerable?",
        "source": "T26n1536_002:0371c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂能忍受寒熱飢渴風日蚊虻蛇蠍等觸，又能忍受他麁惡語，能起身中猛利切心奪命苦受，是謂堪忍。",
        "translation": "Answer: It's tolerating cold, heat, hunger, thirst, wind, sun, mosquitoes, snakes, scorpions, and other tactile objects, tolerating harsh words from others, and generating sharp, heart-crushing, life-threatening pain in the body is called tolerable.",
        "source": "T26n1536_002:0371c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可樂云何？",
        "translation": "What's enjoyable about that?",
        "source": "T26n1536_002:0371c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：設有事至，不可容納、不可矜持、不可迴轉、不可忍耐，而能於彼不暴不惡、不麁不獷，堪忍可樂易可共住，止息眾惡。",
        "translation": "A: Suppose something comes along that's impossible to tolerate, impossible to hold, impossible to turn around, and impossible to endure, and yet you're able to abide there without violence or evil, neither crude nor harsh, tolerant, enjoyable, and easy to live with, and to calm the many evils.",
        "source": "T26n1536_002:0371c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有事至，可能容納、可能矜持、可能迴轉、可能忍耐、亦能於彼不暴不惡、不麁不獷，堪忍可樂易可共住，止息眾惡，是謂可樂。",
        "translation": "If something comes along that might be tolerated, held back, turned around, or tolerated, and it's tolerable, enjoyable, and easy to dwell together with them, and it stops all the evils, this is called enjoyable.",
        "source": "T26n1536_002:0372a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂和順、供養者，和順云何？",
        "translation": "There are also two things that are agreeable and supportive.",
        "source": "T26n1536_002:0372a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：若有樂作、可憙樂語、可愛味語，容貌熙怡遠離頻蹙，先言慰問：「具壽善來。",
        "translation": "A: If there's something pleasant to do, something pleasant to say, or something pleasant to taste, and his appearance is pleasant and he's far from frowning, he first says, \"Gosho, good boy!",
        "source": "T26n1536_002:0372a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "事可忍不？",
        "translation": "Are these things tolerable?",
        "source": "T26n1536_002:0372a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可存濟不？",
        "translation": "Is it possible to save it?",
        "source": "T26n1536_002:0372a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安樂住不？",
        "translation": "Do you live in comfort?",
        "source": "T26n1536_002:0372a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食易得不？」",
        "translation": "Is it easy to obtain food?\"",
        "source": "T26n1536_002:0372a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂作如是可憙語等諸悅豫事，是謂和順。",
        "translation": "Being willing to do such pleasing things as speak admirably is called being agreeable.",
        "source": "T26n1536_002:0372a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養云何？",
        "translation": "What are the offerings?",
        "source": "T26n1536_002:0372a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：供養有二種：一、財供養；二、法供養。",
        "translation": "A: There are two kinds of offerings: 1. financial offerings and 2. Dharma offerings.",
        "source": "T26n1536_002:0372a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "財供養云何？",
        "translation": "What are the offerings of material goods?",
        "source": "T26n1536_002:0372a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：以可意色聲香味觸、衣服飲食臥具醫藥及餘資具，於他有情能惠能施能隨惠施、能棄能捨能遍棄捨，是謂財供養。",
        "translation": "A: Being able to bestow and bestow following bestowal, discarding and discarding, and generally discarding and discarding with agreeable form, sound, smells, tastes, tactile objects, clothing, food, bedding, medicine, and other necessities to other sentient beings is called making offerings of goods.",
        "source": "T26n1536_002:0372a10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法供養云何？",
        "translation": "What are the offerings of the Dharma?",
        "source": "T26n1536_002:0372a13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：以素呾纜或毘奈耶或阿毘達磨，或親教語或軌範語或傳授藏，或餘隨一可信者語，於他有情能惠能施能隨惠施、能棄能捨能遍棄捨，是謂法供養。",
        "translation": "A: Using the words of a sūtra or a piṇaya or an abhidharma, or the words of a relative teacher or a model teacher or a transmission canon, or the words of any other trusted person, to give kindness and generosity to other sentient beings, to follow kindness and generosity, and to discard, discard, and discard completely is called making offerings of the Dharma.",
        "source": "T26n1536_002:0372a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二種，總名供養。",
        "translation": "These two kinds of offerings are collectively called offerings.",
        "source": "T26n1536_002:0372a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂具念、正知者，具念云何？",
        "translation": "There are also two other things, namely, those who are fully mindful and those who correctly know, but what are they?",
        "source": "T26n1536_002:0372a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：若依出離、遠離、善法，諸念隨念、專念、憶念，不忘不失、不遺不漏，不失法性、心明記性，是謂具念。",
        "translation": "A: Suppose someone relies on seclusion, detachment, and good qualities, and their mindfulness follows, focuses, and recollects them without forgetting or losing them, without loss or contamination, and without losing the nature of the Dharma or the mind's clear memory, this is called being fully mindful.",
        "source": "T26n1536_002:0372a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正知云何？",
        "translation": "What's rightly known about it?",
        "source": "T26n1536_002:0372a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：若依出離、遠、善法，於法揀擇、極揀擇、最極揀擇，解了、等了、近了、遍了，機黠通達審察聰叡，覺明慧行毘鉢舍那，是謂正知。",
        "translation": "A: If someone relies on liberating, distant, and good qualities, discriminates, discriminates in detail, discriminates in detail, discriminates in detail, understands, comprehends, nearens, and fully comprehends, has intelligence and penetrating insight, and perceives, discerns, and practices vipaśyanā, this is called correct knowledge.",
        "source": "T26n1536_002:0372a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂思擇力、修習力者，思擇力云何？",
        "translation": "There are also two things, which are the power of discernment and the power of cultivation.",
        "source": "T26n1536_002:0372a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊說：苾芻當知，諸多聞聖弟子應如是學，諸身惡行，現法當來招惡異熟，謂我若行身惡行者，現自厭毀，亦復為他天神諸佛之所訶責，亦為有智同梵行者以法譏嫌，一切世界惡名流布，身壞命終墮嶮惡趣生於地獄。",
        "translation": "A: Just as the Bhagavān said, \"You should know, well-versed noble disciples should train in this way, for bad physical conduct will bring about bad maturation in the present life, meaning that if I engage in bad physical conduct, I'll disgust myself and be reprimanded by other gods and buddhas, and I'll be ridiculed by wise people who practice the same celibacy with the Dharma, spread a bad reputation in all the world, and fall into a dangerous destiny or be born in hell when my body breaks up and my life ends.",
        "source": "T26n1536_002:0372a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由正了知諸身惡行，現法當來招惡異熟，故能勤斷諸身惡行，亦能勤修諸身妙行。",
        "translation": "Because they correctly understand that bad physical actions will bring about bad retribution in the present life, they can diligently stop bad physical actions and diligently cultivate good physical actions.",
        "source": "T26n1536_002:0372b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於語惡行及意惡行廣說亦爾，乃至勤修語意妙行。",
        "translation": "The same is explained in detail about the bad deeds of speech and the bad deeds of thought, up to the point of diligently cultivating the good deeds of speech and thought.",
        "source": "T26n1536_002:0372b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是因思擇，依思擇、住思擇，斷不善法、修諸善法，說名思擇亦名為力，是謂思擇力。",
        "translation": "If someone can thus cause deliberation, rely on deliberation, and abide in deliberation, stop unskillful qualities and cultivate good qualities, this is called deliberation and is also called the power of deliberation.",
        "source": "T26n1536_002:0372b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修習力云何？",
        "translation": "What's the power of cultivation?",
        "source": "T26n1536_002:0372b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊說：苾芻當知，諸多聞聖弟子修念等覺支，依止厭、依止離、依止滅，迴向於捨；修擇法、精進、喜、輕安、定、捨等覺支。",
        "translation": "A: Just as the Bhagavān said, \"Precious monks, you should know that well-versed noble disciples cultivate the awakening factor of mindfulness, which depends on loathing, depends on seclusion, and depends on cessation and leads back to equanimity, and they cultivate the awakening factors of discriminating qualities, effort, joy, light ease, concentration, and equanimity.",
        "source": "T26n1536_002:0372b07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依止厭、依止離、依止滅，迴向於捨。",
        "translation": "Relying on disillusionment, reliance on seclusion, and reliance on cessation, it leads back to equanimity.",
        "source": "T26n1536_002:0372b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能如是因修習、依修習、住修習，斷不善法、修諸善法，說名修習亦名為力，是謂修習力。",
        "translation": "If someone can thus cause cultivation, rely on cultivation, and abide in cultivation, stop unskillful things and cultivate good things, this is called cultivation and power.",
        "source": "T26n1536_002:0372b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：何故名力？",
        "translation": "Q: What is called power?",
        "source": "T26n1536_002:0372b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：以因此力、依此力、住此力，能斷能碎能破一切結縛、隨眠、隨煩惱纏，故名為力。",
        "translation": "Answer: It's because of this power, relying on this power, and abiding in this power that it can break and dismantle all the bonds, latencies, and afflictive tendencies that it's called power.",
        "source": "T26n1536_002:0372b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂不護根門、食不知量者，不護根門云何？",
        "translation": "There are also two things, which are not guarding the gate of the faculties and not knowing the amount of food that's consumed.",
        "source": "T26n1536_002:0372b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊說：苾芻當知，無聞異生眼見色已，由眼根故取相隨好，即於是處不護眼根，由住不護起世貪憂，惡不善法隨心生長。",
        "translation": "Answer: The Bhagavān said, \"You should know, bhikṣu, that after an unheard alien's eyes see form, he takes on characteristics and follows goodness because of his eye faculty, which is to say that he doesn't guard the eye faculty in this place, and because he doesn't guard it, worldly cravings and sorrow arise, and bad and unskillful things grow in his mind.",
        "source": "T26n1536_002:0372b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於眼根不防不守，由斯故說不護眼根。",
        "translation": "They don't guard or protect the eye faculty, and for this reason they say they don't guard the eye faculty.",
        "source": "T26n1536_002:0372b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不護眼根貪瞋癡生長，耳鼻舌身意根亦爾。",
        "translation": "Because they don't guard the eye faculty, greed and folly grow, so does the ear, nose, tongue, body, and mind faculties.",
        "source": "T26n1536_002:0372b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且說意根者，謂意了法已，由意根故取相隨好，即於是處不護意根，由住不護起世貪憂，惡不善法隨心生長。",
        "translation": "It's also said of the mind faculty that after the mind perceives things, it's because of the mind faculty that it takes on characteristics and follows goodness, which is to say that it doesn't guard the mind faculty in this place, and because it doesn't guard it, worldly cravings and sadness arise, and bad and unskillful things grow in the mind accordingly.",
        "source": "T26n1536_002:0372b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於意根不防不守，由斯故說不護意根，以不護意根貪瞋癡生長，彼由發起非理思擇。",
        "translation": "They don't guard or guard the mind faculty, and for this reason they say they don't guard the mind faculty, and because they don't guard the mind faculty, greed, anger, and delusion develop, and they give rise to irrational deliberation.",
        "source": "T26n1536_002:0372b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼見諸色、耳聞諸聲、鼻嗅諸香、舌嘗諸味、身覺諸觸、意了諸法，於六根門不防、不等防、不遍防、不藏、不覆、不蔽、不寂靜、不調伏、不守護，是謂不護根門。",
        "translation": "When the eye sees forms, the ear hears sounds, the nose smells smells fragrances, the tongue tastes flavors, the body feels tactile sensations, and the mind perceives dharmas, these six sense-gates are not guarded, not equally guarded, not pervasively guarded, not hidden, not covered, not shielded, not quiescent, not disciplined, and not guarded, which is called the gate of not guarding the sense-gates.",
        "source": "T26n1536_002:0372b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食不知量云何答：如世尊說：苾芻當知，無聞異生不思擇而食，為勇健故、為傲逸故、為顏貌故、為端嚴故而食所食。",
        "translation": "What is the amount of food that's not known? A: As the Bhagavān explains, \"You should know, monks, that unheard sentient beings eat without thinking, and they eat what they eat for reasons of courage, pride, appearance, and dignity.",
        "source": "T26n1536_002:0372b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不思擇而食者，謂住非理所引思擇而食所食。",
        "translation": "Someone who feeds without thinking means someone who abides in a state of thought that's not led by principle and feeds on what's being eaten.",
        "source": "T26n1536_002:0372c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為勇健故食所食者，謂如一類食所食時起如是心：我食此食，必使飽滿，令身勇健，能作重業能荷重擔，資益壽量久住世間，能摧怨敵、能越車乘、能遠跳擲、能作種種世間掉戲。",
        "translation": "Someone who feeds on food for the sake of courageousness refers to a person who, when he feeds on food, produces this thought: \"When I eat this food, I'll be satisfied, made physically robust, capable of performing heavy tasks and carrying heavy burdens, able to increase my life span and live in the world for a long time, able to destroy enemies, surpass chariots and vehicles, jump and toss from a distance, and perform various worldly tricks.",
        "source": "T26n1536_002:0372c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為傲逸故食所食者，謂如一類食所食時，起如是心：我食此食，必使飽滿，令我傲逸憍醉之心起等起、生等生，相續引發[夌*欠]蔑一切，隨情所樂作縱逸業。",
        "translation": "Someone who feeds on food for the sake of conceit refers to a person who, when he feeds on food, produces this thought: \"When I eat this food, I'll surely be satisfied, which will cause my conceited, proud, and intoxicated mind to arise and give rise to equal birth, which will continuously give rise to [dawdle*dawdle] and disdain for all of them and create careless actions as the emotions desire.",
        "source": "T26n1536_002:0372c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為顏貌故食所食者，謂如一類食所食時，起如是心：我食此食，必使飽滿，當令我身容貌光鮮膚體潤滑。",
        "translation": "Someone who eats what they eat for appearance's sake means that when one type of person eats what they eat, they think, \"When I eat this food, I'll surely be satisfied, and it will make my body's appearance shiny and my skin and body smooth.",
        "source": "T26n1536_002:0372c11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為端嚴故食所食者，謂如一類食所食時，起如是心：我食此食，必使飽滿，當令我身成就第一美妙形色，眾所愛敬。",
        "translation": "Those who eat what they eat for the sake of dignity mean that when they eat what one type of food, they think, \"When I eat this food, I'll make sure it fills me up, and it will give my body the most beautiful appearance that's loved by everyone.",
        "source": "T26n1536_002:0372c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有如是愛重飲食，於諸飲食不平等性、不知量性、不黠慧性，不了其相，不了相已不自裁量，我今但應食爾所食，是謂食不知量。",
        "translation": "For those who thus value food and drink, and who don't understand the unequal nature, don't know the amount, and aren't wise about the food and drink, and don't understand its characteristics and don't evaluate it after not understanding its characteristics, I should only eat that food now, which is called not knowing the amount of food.",
        "source": "T26n1536_002:0372c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂能護根門、於食知量者，能護根門云何？",
        "translation": "Again, there are two things, which are the gate that protects the faculties and the gate that knows the amount of food that's eaten.",
        "source": "T26n1536_002:0372c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊說：苾芻當知，諸多聞聖弟子，眼見色已，由眼根故，不取其相、不取隨好，即於是處能護眼根，由住能護不起世貪憂，惡不善法不隨心生長。",
        "translation": "Answer: Just as the Bhagavān said, \"You should know, monks, that well-versed noble disciples who see form with their eyes and, because of their eye faculty, don't grasp its appearance and don't grasp its desirability, are able to guard the eye faculty in this place, and because they abide in that guard and don't become worldly-desiring and gloomy, bad and unskillful things don't arise in their minds.",
        "source": "T26n1536_002:0372c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於眼根能防能守，由斯故說能護眼根，以能護眼根貪瞋癡不起，耳鼻舌身意根亦爾。",
        "translation": "They can defend and guard the eye faculty, and for this reason they say they can guard the eye faculty because they can guard the eye faculty against greed, anger, and delusion, and so can the ear, nose, tongue, body, and mind faculties.",
        "source": "T26n1536_002:0372c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且說意根者，謂意了法已，由意根故，不取其相、不取隨好，即於是處能護意根，由住能護不起世貪憂，惡不善法不隨心生長。",
        "translation": "It's also said of the mind faculty that once the mind has comprehended a thing, it's because of the mind faculty that it doesn't grasp its characteristics and doesn't grasp its desirousness that it's able to protect the mind faculty in this place, and because it's able to guard against worldly cravings and grief, bad and unskillful things don't grow in the mind.",
        "source": "T26n1536_002:0372c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於意根能防能守，由斯故說能護意根，以能護意根貪瞋癡不起，彼由發起如理思擇。",
        "translation": "They can defend and guard the mind faculty, and for this reason they say they can protect the mind faculty because they can protect the mind faculty from craving, ill-will, and delusion, which causes them to correctly discriminate.",
        "source": "T26n1536_002:0372c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼見諸色、耳聞諸聲、鼻嗅諸香、舌嘗諸味、身覺諸觸、意了諸法，於六根門能防、能等防、能遍防、能藏、能覆、能蔽、能寂靜、能調伏、能守護，是謂能護根門。",
        "translation": "When the eye sees forms, the ear hears sounds, the nose smells smells smells, the tongue tastes smells smells, the body feels smells smells, and the mind perceives dharmas, these six sense-gates can be guarded, equally guarded, pervasively guarded, hidden, covered, shielded, quiescent, disciplined, and guarded, which is called the sense-gate that's able to guard the sense-gates.",
        "source": "T26n1536_002:0373a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於食知量云何？",
        "translation": "What's the knowledge and understanding of food?",
        "source": "T26n1536_002:0373a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如世尊說：苾芻當知，諸多聞聖弟子能思擇而食，不為勇健、不為傲逸、不為顏貌、不為端嚴而食所食，但為此身暫住存濟止息飢渴、攝受梵行而食所食，為斷故受不起新受，無罪存濟力樂安住而食所食。",
        "translation": "Answer: Just as the Bhagavān said, \"You should know, monks, that well-versed noble disciples are able to eat deliberately, not for courage, not for pride, not for appearance, and not for dignity, but for the sake of this body, they store up relief, quell hunger and thirst, collect the religious practice, and eat, don't cultivate new sensations in order to stop the former, and eat without fault, store up relief, and live in power and happiness.",
        "source": "T26n1536_002:0373a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能思擇而食者，謂住如理所引思擇而食所食。",
        "translation": "Someone who feeds based on deliberation means they abide in deliberation that's led by principle and feed on what's eaten.",
        "source": "T26n1536_002:0373a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為勇健食所食者，非如一類食所食時起如是心：我食此食，必使飽滿，令身勇健，能作重業能荷重擔，資益壽量久住世間，能摧怨敵、能越車乘、能遠跳擲、能作種種世間掉戲。",
        "translation": "Someone who doesn't feed on food that's courageous and robust doesn't eat like this when they eat, thinking, \"When I eat this food, I'll be satisfied, made physically robust, capable of performing heavy tasks and carrying heavy burdens, prolonging my life span and abiding in the world, destroying enemies, overtaking chariots and vehicles, jumping and throwing from a distance, and performing various worldly tricks.",
        "source": "T26n1536_002:0373a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為傲逸食所食者，非如一類食所食時起如是心：我食此食，必使飽滿，令我傲逸憍醉之心起等起、生等生，相續引發[夌*欠]蔑一切，隨情所樂作縱逸業。",
        "translation": "Someone who doesn't feed on conceited food doesn't eat food like this, thinking, \"When I eat this food, I'll surely be satisfied, which will cause my conceited, proud, and intoxicated mind to arise and give rise to equal birth, which will continuously give rise to [dawdle*dawdle] and disdain for all of them, and which will create conceited actions as the emotions desire.",
        "source": "T26n1536_002:0373a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為顏貌食所食者，非如一類食所食時起如是心，我食此食，必使飽滿，當令我身容貌光鮮膚體潤滑。",
        "translation": "Someone who doesn't eat food for appearance doesn't eat food like this when they think, \"When I eat this food, I'll surely be satisfied, and it will make my body's appearance shiny and my skin smooth.",
        "source": "T26n1536_002:0373a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不為端嚴食所食者，非如一類食所食時起如是心：我食此食，必使飽滿，當令我身成就第一美妙形色眾所愛敬。",
        "translation": "Someone who doesn't eat for the sake of ornamentation doesn't eat as one type of food when they think, \"When I eat this food, I'll be satisfied, and it will make my body achieve the most beautiful appearance that people adore.",
        "source": "T26n1536_002:0373a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但為此身暫住存濟食所食者，謂身亦名身、身根亦名身、五色根亦名身、四大種所造聚亦名身，於此義中說四大種所造聚身。",
        "translation": "But someone who temporarily abides for this body to help what they eat means that the body is also called body, the body root is also called body, the five color faculties are also called body, and the four major kinds of aggregates created are also called body, and in this sense, it's called the four major kinds of aggregates created by the body.",
        "source": "T26n1536_002:0373a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聖弟子食所食時但起是心：我食此食，令四大種所造聚身，暫住等住近住安住，故名暫住。",
        "translation": "When the noble disciple eats the food he's eating, he only arouses this thought: \"When I eat this food, I cause the four aggregates of food created by the four elements to temporarily abide, equally abide, and proximally abide, so I'm called temporarily abiding.",
        "source": "T26n1536_002:0373a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聖弟子食所食時但起是心：我食此食，令四大種所造聚身存隨存、濟隨濟、護隨護、轉隨轉，故名存濟。",
        "translation": "Noble disciples only give rise to this thought when they eat what they eat: \"When I eat this food, I cause the four kinds of masses of body that are made to exist and subsequently exist, to be helped and helped, to be protected and protected, and to be turned and turned, so I'm called existing and helping.",
        "source": "T26n1536_002:0373a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但為止息飢渴食所食者，此中飢渴所起苦受說名飢渴。",
        "translation": "Whoever feeds on this food only to quell hunger and thirst, the painful feelings caused by hunger and thirst are said to be hunger and thirst.",
        "source": "T26n1536_002:0373b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聖弟子食所食時但起是心：我食此食，當令飢渴所起苦受暫時止息不為惱害。",
        "translation": "When the noble disciple eats this food, he only arouses this thought: 'When I eat this food, I will cause the painful feelings that arise from hunger and thirst to be temporarily stopped and not become distressed.'",
        "source": "T26n1536_002:0373b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但為攝受梵行食所食者，謂離婬欲亦名梵行、八支聖道亦名梵行，於此義中八支聖道說名梵行。",
        "translation": "That food that's taken for the purpose of gathering in the practice of celibacy is also called the practice of celibacy when one is free of sexual desire, and the eight noble paths are also called the practice of celibacy, in which sense the eight noble paths are said to be called the practice of celibacy.",
        "source": "T26n1536_002:0373b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聖弟子食所食時但起是心：我食此食，為欲攝受隨順增益八支聖道。",
        "translation": "When the noble disciple eats the food he's eating, he only arouses this thought: \"I'm eating this food because I want to gather in [sentient beings] and follow and enhance the eight noble paths.",
        "source": "T26n1536_002:0373b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為斷故受不起新受食所食者，不食為緣所起苦受說名故受，飽食為緣所起苦受說名新受。",
        "translation": "When someone eats food that's intended to stop the painful feelings that arise from not eating, they say it's called the former feeling, and when they eat, they say it's called the new feeling that arises from the painful feelings that arise from eating.",
        "source": "T26n1536_002:0373b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聖弟子食所食時但起是心：我食此食，為斷故受不起新受，非為充悅。",
        "translation": "When the noble disciple eats what he eats, he only arouses this thought: 'When I eat this food, I'll receive it for the sake of ending it and won't receive new feelings, not for its satisfaction.'",
        "source": "T26n1536_002:0373b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為無罪存濟而食所食者，存濟有二種：一有罪存濟；二無罪存濟。",
        "translation": "Those who eat the food they eat for the sake of guiltless salvation have two kinds of salvation: guilty salvation and guiltless salvation.",
        "source": "T26n1536_002:0373b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何有罪存濟？",
        "translation": "What is sinful subsistence?",
        "source": "T26n1536_002:0373b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：如有一類矯妄詭詐現相激磨，以利求利而求飲食。",
        "translation": "A: Suppose there's a type of person who falsely and deceitfully shows signs of agitation and seeks food and drink for profit.",
        "source": "T26n1536_002:0373b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是方便得飲食已，歡喜受用，貪愛迷悶耽著不捨，不見過患不知出離，如是名為有罪存濟。",
        "translation": "After obtaining food and drink in this way, they rejoice in its use, become addicted and confused, don't abandon it, and don't see the faults and problems and don't know how to escape from them, and this is called a person who exists to save from a sin.",
        "source": "T26n1536_002:0373b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何無罪存濟？",
        "translation": "What's faultless subsistence?",
        "source": "T26n1536_002:0373b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：非如一類矯妄詭詐現相激磨，以利求利而求飲食。",
        "translation": "A: They aren't like a group of people who falsely and deceptively present themselves as agitators, seeking food and drink for profit.",
        "source": "T26n1536_002:0373b17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如實方便得飲食已，如法受用，不貪不愛不迷不悶不耽不著，能見過患善知出離，如是名為無罪存濟。",
        "translation": "After obtaining food and drink with true skill, he takes it according to the teaching, doesn't crave it or love it, doesn't become confused or attached, and is able to see danger and well understand escape, which is called faultless maintenance.",
        "source": "T26n1536_002:0373b19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聖弟子但為如是無罪存濟而食所食。",
        "translation": "Noble disciples simply eat what they eat for the sake of such faultless maintenance.",
        "source": "T26n1536_002:0373b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為力樂故食所食者，謂聖弟子食所食時但起是心：我食此食，欲令身力得不衰退，心受喜樂能辦善事。",
        "translation": "Those who eat what they eat for the sake of strength and pleasure mean that when the noble disciple eats what he eats, he only arouses this thought: \"I want to eat this food so that my physical strength won't fade and my mind will experience joy and happiness, and I'll be able to perform good works.",
        "source": "T26n1536_002:0373b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為安住故食所食者，謂聖弟子食所食時但起是心：我食此食，欲令行立坐臥讀誦修定等時身心安隱。",
        "translation": "Someone who takes what he eats for reasons of stability means that when the noble disciple takes what he eats, he simply arouses the thought, \"I want to eat this food so that I'll be physically and mentally stable when I walk, sit, lay, read, recite, cultivate, and meditate.",
        "source": "T26n1536_002:0373b24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有如是不重飲食，於諸飲食有平等性、有知量性、有黠慧性，能了其相，既了相已，能自裁量，我今但應食爾所食，是謂於食知量。",
        "translation": "For those who thus don't value food and drink, and who have equality, knowledge, and wisdom about food and drink and can understand its characteristics and, having understood its characteristics, can judge for themselves, I should only eat what I eat, which is called knowing the amount of food that's available.",
        "source": "T26n1536_002:0373b27_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂匱戒、匱見者，匱戒云何？",
        "translation": "\"Again, there are two things, which are deficient in precepts and deficient in views.",
        "source": "T26n1536_002:0373c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：斷生命、不與取、欲邪行、虛誑語、離間語、麁惡語、雜穢語。",
        "translation": "A: It's cutting off life, withholding attachment, desiring wrong behavior, false speech, deviant speech, harsh speech, and defiled speech.",
        "source": "T26n1536_002:0373c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次若斷生命、若不與取、若非梵行。",
        "translation": "Furthermore, if they cut off life, if they don't take what's given, and if they don't engage in the religious practice, then those precepts are unwholesome, those precepts that are not based on reason, and those precepts that obstruct concentration.",
        "source": "T26n1536_002:0373c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次諸所有不善戒、諸所有非理所引戒、諸所有障礙定戒，是謂匱戒。",
        "translation": "Furthermore, those precepts that are unwholesome, those that are not based on reason, and those that obstruct concentration are called deficient precepts.",
        "source": "T26n1536_002:0373c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：何故名匱戒？",
        "translation": "Q: What are these called deficient precepts?",
        "source": "T26n1536_002:0373c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：此法自性不可愛、不可樂、不可憙、不可意、不安隱、不正直、不可欣、不悅意、違正理。",
        "translation": "A: The self-nature of this dharma is unattractive, unpleasing, unjogging, unintentional, uncontainable, unrighteous, unpleasing, disagreeable, and contrary to the right principle.",
        "source": "T26n1536_002:0373c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能得不可愛果、不可樂果、不可憙果、不可意果、不安隱果、不正直果、不可欣果、不悅意果、違正理果。",
        "translation": "Furthermore, this dharma can produce the results of being unattractive, unpleasing, unjogging, unintentional, unsettling, unrighteous, unpleasing, and disagreeable, and contrary to the right principle.",
        "source": "T26n1536_002:0373c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能感不可愛異熟、不可樂異熟、不可憙異熟、不可意異熟、不安隱異熟、不正直異熟、不可欣異熟、不悅意異熟、違正理異熟，故名匱戒。",
        "translation": "Furthermore, this thing can bring about unattractive retribution, unpleasing retribution, unjoyful retribution, unattractive retribution, unintentional retribution, inconceivable retribution, incorrect retribution, undesirable retribution, displeasing retribution, and retribution contrary to right principles, which is why it's called deficient in morality.",
        "source": "T26n1536_002:0373c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "匱見云何？",
        "translation": "What's the deficient view?",
        "source": "T26n1536_002:0373c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸所有見，無惠施、無親愛、無祠祀、無妙行無惡行、無妙行惡行業果異熟、無此世無他世、無母無父無化生有情，無世間阿羅漢正至正行，謂於此世他世自通達作證證知，我生已盡、梵行已立、所作已辦、不受後有。",
        "translation": "A: Regarding all views, there's no generosity, no affection, no sacrifice, no good actions or bad actions, no fruition of bad actions, no present world or other worlds, no mother or father, no sentient beings born by transformation, and no arhat in the world who correctly attains right practice, which is to say that in this or other worlds he personally comprehends, realizes, and realizes that his births have been ended, his religious practice has been established, his actions have been accomplished, and he's not subject to a later existence.",
        "source": "T26n1536_002:0373c13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次諸所有不善見、諸所有非理所引見、諸所有障礙定見，是謂匱見。",
        "translation": "Furthermore, all unwholesome views, all views not led by reason, and all views that obstruct concentration are called deficient views.",
        "source": "T26n1536_002:0373c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：何故名匱見？",
        "translation": "Q: What is called a deficient view?",
        "source": "T26n1536_002:0373c20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：此法自性不可愛乃至違正理。",
        "translation": "A: The intrinsic nature of this thing is unattractive ... and even at odds with the right principle.",
        "source": "T26n1536_002:0373c20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能得不可愛果乃至違正理果。",
        "translation": "Furthermore, this thing can produce an undesirable result and even a result that's contrary to the correct principle.",
        "source": "T26n1536_002:0373c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能感不可愛異熟乃至違正理異熟，故名匱見。",
        "translation": "Furthermore, this thing can bring about undesirable retribution and even retribution contrary to the right principle, so it's called deficient views.",
        "source": "T26n1536_002:0373c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如匱戒、匱見，應知破戒破見亦爾。",
        "translation": "As deficiency in precepts and deficiency in views, you should know that the same is true of breaking precepts and going against views.",
        "source": "T26n1536_002:0373c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂具戒、具見者。",
        "translation": "There are also two things, namely, those who are endowed with precepts and those who are endowed with views.",
        "source": "T26n1536_002:0373c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具戒云何？",
        "translation": "What are the replete precepts?",
        "source": "T26n1536_002:0373c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：離斷生命、離不與取、離欲邪行、離虛誑語、離離間語、離麁惡語、離雜穢語。",
        "translation": "A: He parts with cutting off life, parts with taking what's not given, parts with wrong sexual behavior, parts with false speech, parts with in-between speech, parts with harsh speech, and parts with impure speech.",
        "source": "T26n1536_002:0373c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次離斷生命、離不與取、離非梵行。",
        "translation": "Furthermore, they part with cutting off life, part with taking what's not given, and part with conduct that's not the religious life.",
        "source": "T26n1536_002:0373c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次諸所有學戒、諸所無學戒、諸所有善非學非無學戒，是謂具戒。",
        "translation": "Furthermore, these are the full set of precepts that are acquired, those that are acquired without training, and those that are good, not acquired, and not acquired.",
        "source": "T26n1536_002:0373c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：何故名具戒？",
        "translation": "Q: What is called the full set of precepts?",
        "source": "T26n1536_002:0373c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：此法自性可愛、可樂、可憙、可意、安隱、正直、可欣、悅意、隨順正理。",
        "translation": "A: The self-nature of this Dharma is desirable, enjoyable, pleasurable, agreeable, peaceful, upright, pleasing, pleasing, and following the right principle.",
        "source": "T26n1536_002:0374a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能得可愛果、可樂果、可憙果、可意果、安隱果、正直果、可欣果、悅意果、順正理果。",
        "translation": "Furthermore, this Dharma can produce pleasing results, pleasant results, jealous results, agreeable results, peaceful results, upright results, pleasing results, pleasing results, and results that accord with the right principle.",
        "source": "T26n1536_002:0374a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能感可愛異熟、可樂異熟、可憙異熟、可意異熟、安隱異熟、正直異熟、可欣異熟、悅意異熟、順正理異熟，故名具戒。",
        "translation": "Furthermore, this teaching can lead to desirable retribution, pleasant retribution, jealous retribution, agreeable retribution, peaceful retribution, upright retribution, pleasing retribution, agreeable retribution, and retribution according to right principles, which is why it's called the perfect set of precepts.",
        "source": "T26n1536_002:0374a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具見云何？",
        "translation": "What's the full view?",
        "source": "T26n1536_002:0374a07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸所有見，有惠施、有親愛、有祠祀、有妙行、有惡行、有妙行惡行業果異熟、有此世有他世、有母有父、有化生有情，有世間阿羅漢正至正行，謂於此世他世自通達作證具足住，如實證知，我生已盡、梵行已立、所作已辦、不受後有。",
        "translation": "A: Regarding all views, there's generosity, affection, sacrifice, good conduct, bad conduct, variation in the results of bad conduct, this world and the other world, mother and father, sentient beings born by transformation, and the right ascendancy and right conduct of arhats in the world, which is to say that in this world and the other world they fully abide in the realization of their own penetration, truly realizing that their births have been ended, the religious practice has been established, the task has been accomplished, and they're not subject to a later existence.",
        "source": "T26n1536_002:0374a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次諸所有學見、諸所有無學見、諸所有善非學非無學見，是謂具見。",
        "translation": "Furthermore, this is called a perfect view when there's a view of training, a view of no-training, and a view of all that's good, not training, and not-training.",
        "source": "T26n1536_002:0374a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：何故名具見？",
        "translation": "Q: What is called an impartial view?",
        "source": "T26n1536_002:0374a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答此法自性可愛乃至隨順正理。",
        "translation": "\"A This is a teaching that's desirable in its own nature ... that follows the right principle.",
        "source": "T26n1536_002:0374a14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能得可愛果乃至順正理果。",
        "translation": "Furthermore, this thing can produce desirable results ... and even the results of conforming to the right principle.",
        "source": "T26n1536_002:0374a15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次此法能感可愛異熟乃至順正理異熟，故名具見。",
        "translation": "Furthermore, this thing can bring about desirable retribution and even retribution according to right principles, which is why it's called possessive views.",
        "source": "T26n1536_002:0374a16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如具戒、具見，應知淨戒、淨見亦爾。",
        "translation": "As perfect precepts and perfect views are, you should know that the same is true of pure precepts and pure views.",
        "source": "T26n1536_002:0374a17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂見、如理勝者，見云何？",
        "translation": "What are the two other things that are viewed and that are superior in principle, and what are they viewed as?",
        "source": "T26n1536_002:0374a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂依出離、遠離、善法，於法揀擇、極揀擇、最極揀擇，解了、等了、近了、遍了，機黠通達審察聰叡，覺明慧行毘鉢舍那，是謂見。",
        "translation": "Answer: This is called a view that relies on emancipation, seclusion, and good qualities, discriminates, fully discriminates, and most fully discriminates qualities, understands, equipoises, approximates, and fully comprehends them, is resourceful and penetrating, scrutinizes and inspects them, and perceives, illuminates, and practices Vipaśyanā.",
        "source": "T26n1536_002:0374a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如理勝云何？",
        "translation": "How is this principle superior?",
        "source": "T26n1536_002:0374a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂有苾芻如其所見，若由如是諸行相狀，世間正見未生而生，彼便如理思惟如是諸行相狀。",
        "translation": "Answer: It means a monk sees as he sees, and if it's because of such defining activities that right views in the world have yet to arise, he then correctly contemplates such defining activities.",
        "source": "T26n1536_002:0374a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由如理思惟如是諸行相狀，便令聖道起等起、生等生、轉現轉，修集出現，是名道如理勝。",
        "translation": "As a result of correctly contemplating such defining characteristics of actions, they cause the noble path to arise and produce equally, to develop and manifest itself, and to cultivate and gather appearances, which is called the excellence of the path as a principle.",
        "source": "T26n1536_002:0374a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次若有苾芻如其所見，若由如是諸行相狀隨一出離、遠離、善法未生而生，彼便如理思惟如是諸行相狀。",
        "translation": "Furthermore, if a monk sees as he sees, if these features of conduct are followed by an emancipation, seclusion, or the arising of good qualities that have yet to arise, then he correctly contemplates such features of conduct.",
        "source": "T26n1536_002:0374a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由如理思惟如是諸行相狀，便令聖道起等起、生等生、轉現轉，修集出現，是名道如理勝。",
        "translation": "As a result of correctly contemplating such defining characteristics of actions, they cause the noble path to arise and produce equally, to develop and manifest itself, and to cultivate and gather itself, which is called the excellence of the path as a principle.",
        "source": "T26n1536_002:0374a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是二種，總名如理勝。",
        "translation": "These two things are collectively called superior in principle.",
        "source": "T26n1536_002:0374b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂厭、如理勝者。",
        "translation": "There are also two things that are disliked and that are superior in principle.",
        "source": "T26n1536_002:0374b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "厭云何？",
        "translation": "What's disillusioned with?",
        "source": "T26n1536_002:0374b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂依四種順厭處法而生於厭。",
        "translation": "A: It means disillusionment arises based on four kinds of circumstances that are agreeable to disillusionment.",
        "source": "T26n1536_002:0374b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如理勝云何？",
        "translation": "How is this principle superior?",
        "source": "T26n1536_002:0374b05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：謂正思惟引生聖道。",
        "translation": "A: This refers to right contemplation that leads to birth in the noble path.",
        "source": "T26n1536_002:0374b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等為四順厭處法？",
        "translation": "What are the four obedient and disagreeable states?",
        "source": "T26n1536_002:0374b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一自衰損順厭處法；二他衰損順厭處法；三自興盛順厭處法；四他興盛順厭處法。",
        "translation": "1. the state of being disillusioned with self-decline, 2. the state of being disillusioned with other-decline, 3. the state of being disillusioned with self-prosperity, and 4. the state of being disillusioned with other-prosperity.",
        "source": "T26n1536_002:0374b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依自衰損順厭處法而生於厭如理勝者，如有一類等隨觀見自身惡行、語惡行、意惡行究竟圓滿增上淳熟，便作是念：「我因放逸、依放逸、住放逸、由放逸故造斯惡事。",
        "translation": "Those who rely on the state of self-deprecation and the state of disillusionment and become disillusioned with the truth will then think, \"I caused this bad deed to be careless, relied on carelessness, lived in carelessness, and created this bad deed as a result of carelessness.",
        "source": "T26n1536_002:0374b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當令惡不善法未生者不生、已生者永斷。」",
        "translation": "Now, I will cause the bad and unskillful qualities that have yet to arise to stop, and those that have already arisen to be permanently stopped.\"",
        "source": "T26n1536_002:0374b12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由如是出離勇猛所引生厭，是名為厭。",
        "translation": "Becoming disillusioned with the courage to part with them in this way is called disillusionment.",
        "source": "T26n1536_002:0374b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既生厭已如理思惟，復令聖道起等起、生等生、轉現轉，修集出現，是名道如理勝，如是名為依自衰損厭如理勝。",
        "translation": "Once disillusionment has arisen, considering it according to principle, it also causes the noble path to arise, produce, and manifest itself, and cultivate its accumulation and emergence, which is called the path that excels according to principle and is thus called the path that depends on its own debilitation and disillusionment that excels according to principle.",
        "source": "T26n1536_002:0374b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依他衰損順厭處法而生於厭如理勝者，如有一類等隨觀見自他身惡行、語惡行、意惡行究竟圓滿增上淳熟，便作是念：「彼因放逸、依放逸、住放逸、由放逸故造斯惡事。",
        "translation": "When someone produces the overcoming of disillusionment as principle based on the disillusionment with the deterioration of others, if a certain type of person follows and observes that their own bad physical actions, bad verbal actions, and bad mental actions are ultimately completed, increased, and fully ripened, then they think, \"That person causes dissipation, relies on dissipation, abides in dissipation, and creates these bad deeds as a result of dissipation.",
        "source": "T26n1536_002:0374b17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當令惡不善法，未生者不生、已生者永斷。」",
        "translation": "Now, I will cause bad and unskillful qualities to stop those that have yet to arise and to permanently end those that have already arisen.\"",
        "source": "T26n1536_002:0374b20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由如是出離勇猛所引生厭，是名為厭。",
        "translation": "Becoming disillusioned with the courage to part with them in this way is called disillusionment.",
        "source": "T26n1536_002:0374b21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既生厭已如理思惟，復令聖道起等起、生等生、轉現轉，修集出現，是名道如理勝，如是名為依他衰損厭如理勝。",
        "translation": "Once disillusionment has arisen, considering it according to principle, furthermore, causing the noble path to arise, produce, and manifest itself, and cultivate its accumulation and emergence is called the path that excels according to principle, and thus is called the path that depends on the others to weaken and become disillusioned according to principle.",
        "source": "T26n1536_002:0374b22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依自興盛順厭處法而生於厭如理勝者，如有一類等隨觀見自身妙行、語妙行、意妙行究竟圓滿增上淳熟，便作是念：「我因不放逸、依不放逸、住不放逸、由不放逸故作斯善事。",
        "translation": "When someone produces the overcoming of disillusionment with principle based on their own prosperity and compliance with the disillusioned state, if there's a certain type of person who follows and observes the ultimate consummation of their own subtle actions, subtle actions of speech, and subtle actions of thought, then they think, \"This is a good deed that I've done because I'm not careless, rely on not being careless, abide in not being careless, and result from not being careless.",
        "source": "T26n1536_002:0374b25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當令諸勝善法未生者生、已生者倍復增廣。」",
        "translation": "Now, I will cause those excellent good qualities that have yet to arise to arise, and those that have already arisen to multiply and expand.\"",
        "source": "T26n1536_002:0374b29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由如是出離勇猛所引生厭，是名為厭。",
        "translation": "Becoming disillusioned with the courage to part with them in this way is called disillusionment.",
        "source": "T26n1536_002:0374c01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既生厭已如理思惟，復令聖道起等起、生等生、轉現轉，修集出現，是名道如理勝，如是名為依自興盛厭如理勝。",
        "translation": "Once disillusionment has arisen, considering it according to principle, further causing the noble path to arise, produce, and manifest itself, and cultivate its accumulation and appearance is called the path that excels according to principle, and thus is called the self-prosperity of disillusionment that excels according to principle.",
        "source": "T26n1536_002:0374c02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依他興盛順厭處法而生於厭如理勝者，如有一類等隨觀見他身妙行、語妙行、意妙行究竟圓滿增上淳熟，便作是念：「彼因不放逸、依不放逸、住不放逸、由不放逸故作斯善事。",
        "translation": "When someone who relies on the prosperity of others to follow the state of disillusionment and become disillusioned with the principle of superiority, if a certain type of person then observes the others' subtle physical actions, subtle verbal actions, and subtle mental actions as perfectly complete, increasing, and pure, they think, \"That person causes non-frivolity, relies on non-frivolity, abides in non-frivolity, and does this good deed because of non-frivolity.",
        "source": "T26n1536_002:0374c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今當令諸勝善法，未生者生、已生者倍復增廣。」",
        "translation": "Now, I will cause those excellent good qualities to arise in those who have yet to arise and to multiply and expand in those who have already arisen.\"",
        "source": "T26n1536_002:0374c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼由如是出離勇猛所引生厭，是名為厭。",
        "translation": "Becoming disillusioned with the courage to part with them in this way is called disillusionment.",
        "source": "T26n1536_002:0374c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既生厭已如理思惟，復令聖道起等起、生等生、轉現轉，修集出現，是名道如理勝，如是名為依他興盛厭如理勝。",
        "translation": "Once disillusionment has arisen, considering it according to principle, it also causes the noble path to arise, produce, and manifest itself, and cultivate its accumulation and emergence, which is called the path that excels according to principle, and thus is called the other-than-thriving disillusionment that excels according to principle.",
        "source": "T26n1536_002:0374c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二法，謂於善不喜足、於斷不遮止者，於善不喜足云何？",
        "translation": "There are also two things, which are not delighting in goodness and not restraining in cessation.",
        "source": "T26n1536_002:0374c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於善喜足者，如有一類唯得少戒便生喜足、唯得少禁便生喜足、唯得離欲便生喜足、唯得不淨觀便生喜足、唯得持息念等便生喜足、或唯得初靜慮乃至第四靜慮便生喜足、或唯得慈無量乃至捨無量便生喜足、或唯得空無邊處定乃至非想非非想處定便生喜足，或唯得預流果、一來果、不還果便生喜足，或唯得神境智證通、天耳智證通、他心智證通、宿住隨念智證通、死生智證通便生喜足，此等名為於善喜足。",
        "translation": "A: If there's a certain type of person who becomes happy simply by attaining a few precepts, happy simply by attaining a few prohibitions, happy simply by attaining freedom from desire, happy simply by attaining contemplation of impurity, happy simply by attaining mindfulness of breathing, etc., happy simply by attaining the first and fourth states of meditation, happy simply by attaining immeasurable kindness and immeasurable equanimity, happy simply by attaining the concentration of the infinity of emptiness and the concentration of neither perception nor non-perception, happy simply by attaining the fruit of pre-flow, the fruit of once-returning, and the fruit of nonreturning, or happy simply by attaining the realization of the knowledge of the divine objects, the realization of the knowledge of the divine ear, the realization of the knowledge of other minds, the realization of the knowledge of mindfulness of past lives, and the realization of the knowledge of birth at death, these are called those who are happy and fulfilled in goodness.",
        "source": "T26n1536_002:0374c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於善不喜足者，如有一類非唯得少戒便生喜足，廣說乃至非唯得死生智證通便生喜足。",
        "translation": "Those who aren't satisfied with goodness are those who become satisfied when a certain type of person attains not just a few precepts, but, as explained in detail, becomes satisfied when they realize not just knowledge of deathbed life.",
        "source": "T26n1536_002:0374c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼作是念：「我修諸善，乃至未得阿羅漢果，於其中間終不喜足。」",
        "translation": "They think, \"I've cultivated goodness up to the point where I haven't yet attained the fruit of the arhat, but I'll never be satisfied with it.\"",
        "source": "T26n1536_002:0374c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名於善不喜足。",
        "translation": "This is called not being satisfied with goodness.",
        "source": "T26n1536_002:0374c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於斷不遮止云何？",
        "translation": "What's the absence of restraint in regard to stopping?",
        "source": "T26n1536_002:0374c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：於斷遮止者，如有一類為斷不善法、為圓滿善法，勇猛精進熾然愛樂勤修不息，作是念言：「云何令我速疾證得如理善法？」",
        "translation": "A: Regarding the suppression of restraint, if there's a certain type of person who diligently undertakes to end unskillful qualities and cultivate the perfection of good qualities with fervent zeal and ardor, they think, \"How can I quickly realize good qualities in their own right?\"",
        "source": "T26n1536_002:0374c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於如是勇猛精進熾然愛樂勤修習時，未能證得如理善法，便作是念：「我所修斷，空虛無果、無利無義、無味無益。」",
        "translation": "When they diligently cultivate such vigorous effort and burning desire, they fail to realize the good qualities as they are, and then they think, \"What I've cultivated to end [suffering] is empty and fruitless, devoid of benefit and meaning, and tasteless and useless.\"",
        "source": "T26n1536_002:0375a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼於斷謂無勝利，便生厭患誹謗毀呰，如是名為於斷遮止。",
        "translation": "Because they perceive no advantage in stopping, they become disillusioned and denigrate it, which is called stopping and refraining from stopping.",
        "source": "T26n1536_002:0375a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有一類為斷不善法、為圓滿善法，勇猛精進熾然愛樂勤修不息，作是念言：「云何令我速疾證得如理善法？」",
        "translation": "There's another type of person who, in order to end unskillful qualities and perfect good qualities, vigorously and energetically loves and diligently cultivates them without stopping, thinking, \"How can I quickly realize good qualities in their own right?\"",
        "source": "T26n1536_002:0375a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼於如是勇猛精進熾然愛樂勤修習時，未能證得如理善法，或雖證得而不了知，便作是念：「我所修斷，空虛無果、無利無義、無味無益。」",
        "translation": "When they diligently cultivate such vigorous effort and burning desire, they fail to realize the good teaching as it is, or they realize it but don't understand it, and then they think, \"What I've cultivated to end [suffering] is empty and fruitless, devoid of benefit and meaning, and tasteless and useless.\"",
        "source": "T26n1536_002:0375a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼於斷謂無勝利，便生厭患誹謗毀呰，如是亦名於斷遮止。",
        "translation": "Because they perceive no advantage in stopping, they become disillusioned and denigrate it, which is also called stopping and refuting it.",
        "source": "T26n1536_002:0375a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說一切有部集異門足論卷第二",
        "translation": "Saṃyuktâgama-gīthāvatāra-śāstra, vol. 2",
        "source": "T26n1536_002:0375a14_0",
        "is_bad_quality": false
    }
]