[
    {
        "source_sentence": "法華玄義釋籤卷第二",
        "translation": "Fahua xuanyi shiqibao roll 2",
        "source": "T33n1717_002:0822c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天台沙門湛然述",
        "translation": "Tendai śramaṇa Zhanran's Commentary",
        "source": "T33n1717_002:0822c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文「云何」下至「出乳味相」者，此文以華嚴說大，未遊鹿苑，詺之為頓。",
        "translation": "The first part of the text, from \"Why?\" down to \"The Appearance of Milk Taste,\" refers to Huayan's explanation of the greatness of things before traveling to Deer Park, which is called sudden.",
        "source": "T33n1717_002:0822c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是頓部，非是頓教，以彼部中兼一別故，人不見者便謂華嚴頓於法華者誤矣。",
        "translation": "This is the sudden group, not the sudden teaching, because it's a group that includes a specific part, so people who don't see it say that Huayan is sudden compared to Fahua, which is a mistake.",
        "source": "T33n1717_002:0822c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下去準說。",
        "translation": "The following is a summary explanation.",
        "source": "T33n1717_002:0822c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文牒譬，「厚殖」下以感應合譬，一往總以別圓為厚。",
        "translation": "The first part of the text introduces the metaphor, and under \"thick proliferation\" we combine the metaphor with induction, saying that once there's always a distinct circle, there's a thick circle.",
        "source": "T33n1717_002:0822c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「頓說」下明說頓意，良由下說頓之由由相隔故。",
        "translation": "Under \"sudden teaching,\" he explains the meaning of suddenness, which is due to the fact that the following explanation of suddenness is based on the fact that they are separated from each other.",
        "source": "T33n1717_002:0822c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言「大隔小」者，小人未轉，為大所隔。",
        "translation": "He says, \"The great is separated from the small\" because the lesser person has yet to change and is separated by the greater.",
        "source": "T33n1717_002:0822c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「此如華嚴」下結《華嚴》譬以同涅槃，故云「如」也。",
        "translation": "\"This is like Huayan\" is the reason we conclude that the Huayan parable is the same as nirvāṇa, so it's called \"like.\"",
        "source": "T33n1717_002:0822c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下去例爾。",
        "translation": "The following is an example.",
        "source": "T33n1717_002:0822c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「約法」去明機感相應得益以結部名。",
        "translation": "\"According to the teaching,\" he goes on to explain the benefits associated with feelings in order to conclude the section's name.",
        "source": "T33n1717_002:0822c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「約說」下結說，次第同《涅槃》譬。",
        "translation": "The following section \"About Explaining\" concludes with the explanation that the sequence is the same as the Nirvana parable.",
        "source": "T33n1717_002:0822c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次照幽谷，亦先提《華嚴》譬，「淺行」下亦舉感應以合譬，乃至《法華》文中皆有結譬同法得益。",
        "translation": "Next, he illuminates the valley, first mentioning the Huayan parable, and then under \"Shallow Practices,\" he also mentions the synergy of sensations with the parable, even though the Fahua text contains a conclusion that the parable is the same as the Dharma benefit.",
        "source": "T33n1717_002:0822c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結名結說次第，尋初頓教意以對下四味，比說可知。",
        "translation": "The order of the concluding names, the concluding explanations, and the investigation of the meaning of the first sudden teaching in order to match the next four flavors are all explained inferenceally.",
        "source": "T33n1717_002:0822c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯三藏結部名在前，餘文或闕說意等，尋之可見。",
        "translation": "Only the names of the tripiṭaka's councils are given earlier; the rest of the text may lack explanations of meaning, and so forth, which can be seen by looking into them.",
        "source": "T33n1717_002:0822c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「大雖在座」等者，大人示迹隱在小中，「多跢」是學行之相，「嘙啝」是習語之聲，示為三藏始行初教，而三藏實行者謂之為實，故云「不識」。",
        "translation": "\"Although the great man is present\" and so forth, the great man shows the traces of his hidden self in the lesser, and \"tākṣā\" is the characteristic of training and practice, and \"khaṇḍa\" is the sound of accustomed speech, which indicates that the Tripiṭaka is beginning to practice the initial teaching, but those who actually practice the Tripiṭaka regard it as real, so it's called \"unaware.\"",
        "source": "T33n1717_002:0822c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「影臨萬水」至「方等」者，至方等中具說四教，以未融故，故見不同。",
        "translation": "The phrase \"images facing myriad rivers\" and \"vaipulya\" refers to the fact that the four teachings are explained in detail in the vaipulya, which is different because they haven't been integrated.",
        "source": "T33n1717_002:0822c28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：華嚴鹿苑大小永融，纔說方等，則同座並聞者何？",
        "translation": "Q: After the Huayan Deer Park's size and scale were permanently fused, what was it that was only explained in a few words, and then was heard in the same seat?",
        "source": "T33n1717_002:0822c29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：若以祕密橫被無時不遍，若約橫論豎則隱顯在機，佛本意在大故遂本居初，然由一分漸機致使聖慈未暢，前已專大、次復專小，今雖同座大小仍隔，但小被大彈為成生蘇，以此為次耳。",
        "translation": "A: If we take the horizontal comprehension of the esoteric as not being pervasive at all times, and if we talk about the vertical as being hidden and apparent, then the original intention of the Buddha was to be great, so he originally took the first place, but because of a gradual capacity, holy compassion was not yet forthcoming, and the former was focused on the great, and the latter on the small.",
        "source": "T33n1717_002:0823a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知於創稟者，仍互不相知，故有此諸喻意不同。",
        "translation": "Therefore, it's clear that those who create and present still don't know each other, which is why these metaphors have different meanings.",
        "source": "T33n1717_002:0823a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「影臨萬水」譬現身不同，「逐器方圓」譬示土不同，「隨波動靜」譬說法不同，「示一佛土」至「不共」合譬也。",
        "translation": "\"Shadows bordering ten thousand rivers\" refers to different manifest bodies, \"each vessel is square and round\" refers to different lands being shown, \"fluctuating and quiescent\" refers to different teachings, and \"showing one Buddha land\" to \"not in common\" combines the metaphors.",
        "source": "T33n1717_002:0823a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從「故見有」下明機見不同，對前三相，初見淨如梵王、見穢如身子，開彼三相，總引經文，兼約六根明斥小也。",
        "translation": "From \"So we see existence\" down here, we'll explain the difference in perspective between the first three aspects, beginning with seeing pure as Brahmā and defiled as a son of the body, and beginning with those three aspects, which summarize the sūtras and explain the rejection of the lesser in terms of the six faculties.",
        "source": "T33n1717_002:0823a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「見有淨穢」對前現土眼根也。",
        "translation": "\"Seeing something pure and defiled\" also refers to the eye faculty of the prior present life.",
        "source": "T33n1717_002:0823a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦應更云覩相優劣，已舉見土身必稱土，故不繁文。",
        "translation": "It should also be called the superiority and inferiority of the features of the eyes, because the body of the land that's seen has already been described as the land, so it won't be elaborated.",
        "source": "T33n1717_002:0823a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「聞有褒貶」，耳根也。",
        "translation": "\"Hearing praise and blame\" refers to the auditory faculty.",
        "source": "T33n1717_002:0823a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「嗅有薝蔔」，鼻根也。",
        "translation": "\"Smelling is accompanied by campaka,\" which is the olfactory faculty.",
        "source": "T33n1717_002:0823a15_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「華有著身」，身根也。",
        "translation": "\"There's attachment to the body with flowers,\" which is also the bodily faculty.",
        "source": "T33n1717_002:0823a15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「慧有若干」，意根也。",
        "translation": "\"Wisdom has variety,\" which is the mind faculty.",
        "source": "T33n1717_002:0823a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯闕舌根，以褒貶兼之。",
        "translation": "The only thing missing is the tongue faculty, which is both praiseworthy and derogatory.",
        "source": "T33n1717_002:0823a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若語身者，應云如須彌山巨身也；始坐佛樹，細身也。",
        "translation": "If there's a body of speech, it should be called something like the huge body of Mount Sumeru, or the small body of the first sitting buddha tree.",
        "source": "T33n1717_002:0823a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一根中並一褒一貶，尋之可見。",
        "translation": "The combination of praise and blame in a single faculty can be seen by looking into it.",
        "source": "T33n1717_002:0823a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又佛歎文殊、淨名，褒也。",
        "translation": "The Buddha's praise of Mañjuśrī and Jōnō is both positive and negative.",
        "source": "T33n1717_002:0823a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞菩薩被折，貶也。",
        "translation": "When the śrāvakas and bodhisattvas are criticized, it's derogatory.",
        "source": "T33n1717_002:0823a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其例蓋多不能具記。",
        "translation": "These examples are too numerous to list.",
        "source": "T33n1717_002:0823a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨其心淨即佛土淨，入此室者不嗅餘香，結習盡者華不著也。",
        "translation": "As their minds are purified, the Buddha's land is purified, and those who enter this room won't smell the other fragrances; the flowers won't stick when their bonding habits are ended.",
        "source": "T33n1717_002:0823a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞有若干，其無礙慧無若干也。",
        "translation": "There are a number of śrāvakas, but there aren't a number of their unimpeded wisdom.",
        "source": "T33n1717_002:0823a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即是褒貶之意。",
        "translation": "This is the meaning of praise and blame.",
        "source": "T33n1717_002:0823a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世人判《楞伽》，或同《華嚴》，或同《法華》，具如《止觀》記已有二處引《楞伽》文判屬方等，以彼經文具四教故、有彈訶故。",
        "translation": "Some people in the world judge the Laṅkâvatāra to be the same as the Huayan or the Fahua, for example, the Zhiguan ji has quoted the text of the Laṅkâvatāra in two places and judged it to be equal in number because that sūtra contains the four teachings and because there's a rejection of them.",
        "source": "T33n1717_002:0823a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中闕說意，應云方等本折小彈偏，圓無所間。",
        "translation": "The missing point here is that it should be explained that the vaipulya scriptures originally folded in a small way, bounced off the sides, and had no interruptions in their perfection.",
        "source": "T33n1717_002:0823a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又闕說由，應云良由小未全轉，致使五百聞大成斥。",
        "translation": "The reason for the lack of explanation should be that it's because the scriptures are minor and not fully developed, which causes the five hundred hearers to reject the greatness of the teaching.",
        "source": "T33n1717_002:0823a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復有義」者，《華嚴經》譬但云平地，今離彼平地，以譬方等般若法華，方等如食時，般若如禺中，法華如正中，於彼義上更加二義，故云「復有」。",
        "translation": "The phrase \"furthermore, there's a meaning\" refers to the Huayan jing's metaphor of a flat ground, but now it's separated from that flat ground and compared to the paranirmita-vaipulya and the dharma-flower, which are like the time of eating, the paranirmita-vaipulya as the yojana, and the dharma-flower as the correct middle, and there are two additional meanings to that meaning, so it's called \"furthermore, there's a meaning.\"",
        "source": "T33n1717_002:0823a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言「大人蒙其光用」等者，菩薩大人蒙般若光諸法之用，二乘之人既無此用，是故譬之如七日嬰兒若視日輪令眼失光，故名為「喪」，外人暗證譬如夜遊，菩薩利他譬如作務。",
        "translation": "When it says, \"The great man is enlightened by the function of his light,\" the bodhisattva's great man is enlightened by the function of Prajñā's light on all things, but people of the two vehicles don't have that function; therefore, it's likened to a seven-day baby whose eyes lose their light when it looks at the sun, which is why it's called \"funeral.\"",
        "source": "T33n1717_002:0823b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「務」者運役也。",
        "translation": "The word \"service\" refers to carrying out labor.",
        "source": "T33n1717_002:0823b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故「文云」下引信解聲聞自述以合嬰兒喪其睛明，一切智明於般若光，無明全在義之如喪。",
        "translation": "Therefore, under \"Man-yun,\" we cite the śrāvakas' own explanation of faith and understanding to fit the baby's loss of eye-sight, the clarity of omniscience in the light of prajñāpāramitā, and the totality of ignorance in its meaning as a funeral.",
        "source": "T33n1717_002:0823b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「雖三人俱學」下說意也。",
        "translation": "It's also explained under \"Although three people are studying together,\" the meaning is explained.",
        "source": "T33n1717_002:0823b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仍闕說由，亦應云良由小稍通泰，致使被加令說。",
        "translation": "The reason for this explanation is still missing, but it should also be said that it was because of a little understanding of Tai that he was made to explain it.",
        "source": "T33n1717_002:0823b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次譬法華中「土圭」等者，「圭」者累土也，故字從重土謂之為圭。",
        "translation": "The next metaphor is \"earthenware\" and so forth in the Lotus Sutra, for which reason the word \"earthenware\" is derived from the word \"earth,\" which is called \"earthenware.",
        "source": "T33n1717_002:0823b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如宋嚴觀法師與此太史官何承天，共論此土是邊是中，觀乃引周公測影之法，以一尺二寸土圭用測日影，夏至之日猶有餘陰，天竺此日則無餘陰。",
        "translation": "For example, when the Song master Yanguan and this official He Chengtian discussed whether this land was marginal or intermediate, Yanguan cited the Zhou Gong's method of measuring shadow, using a one-foot-two-inch earthenware gui to measure the shadow of the sun, which was still left over from the summer solstice but was not left over from this day in Tianzhus.",
        "source": "T33n1717_002:0823b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故叡法師云「如日方中無處不南」，此指中方無餘陰處。",
        "translation": "Therefore, Master Eri says, \"As the sun is square, there's nowhere in the middle that isn't south,\" which refers to the middle direction where there's no residual cloudiness.",
        "source": "T33n1717_002:0823b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "準此算法，地上寸影天上萬里。",
        "translation": "According to this calculation, the shadow of an inch on earth is ten thousand miles in heaven.",
        "source": "T33n1717_002:0823b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若低頭若微善」者，總結散亂、小善之類無不開之，以成佛因，以用合譬，同入一實，故無盈縮。",
        "translation": "The phrase \"if you bow your head, even if it's subtle and good\" summarizes the various types of distraction and minor goodness without fail to reveal them as causes for becoming a buddha, and it uses a combination of metaphors to enter the same reality, so there's no increase or decrease.",
        "source": "T33n1717_002:0823b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「不令」下說意。",
        "translation": "He explains his intention below, \"Don't allow.\"",
        "source": "T33n1717_002:0823b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦闕說由，應云良由大機已熟，眾無枝葉，致使一切佛知見開。",
        "translation": "It's also missing a reason that should be explained as the good reason that the great capacity has matured and that there are no branches or leaves, which causes all buddhas to know and see what's revealed.",
        "source": "T33n1717_002:0823b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若約法被緣名漸圓教」者，此文語略，具足應云鹿苑漸後會漸歸圓，故云漸圓。",
        "translation": "\"If the teaching is called gradually perfect in terms of the conditions surrounding the teaching,\" this text is brief, and it's complete in the sense that it should be called gradually perfect after the gradual confluence of the Deer Park.",
        "source": "T33n1717_002:0823b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人不見之，便謂法華為漸圓，華嚴為頓圓，不知華嚴部中有別，乃至般若中方便二教皆從法華一乘開出，故云「於一佛乘分別說三」。",
        "translation": "When people don't see this, they think that Fahua is gradually perfect and Huayan is suddenly perfect, not knowing that there are distinctions in the Huayan school and that the two teachings of skillful means in Prajñā follow from the one vehicle of Fahua, which is why it's called \"three discriminating teachings in one Buddha vehicle.\"",
        "source": "T33n1717_002:0823b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故疏云「於一佛乘開出，帶二帶三」。",
        "translation": "That's why the commentary says, \"From the One Buddha Vehicle, two are brought along with three.\"",
        "source": "T33n1717_002:0823b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今法華部無彼二三，故云無二亦無三。",
        "translation": "Now, there are no two or three of them in the Lotus School, so it's said that there are neither two nor three.",
        "source": "T33n1717_002:0823b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又上結云華嚴兼等，此經無復兼但對帶，此非難見，如何固迷？",
        "translation": "The above statement says that the Huayan has both, but this sūtra has neither, so how can it be fixedly misleading?",
        "source": "T33n1717_002:0823b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又今文諸義凡一一科皆先約四教，以約麁妙，則前三為麁、後一為妙。",
        "translation": "Furthermore, in the present text, each of these categories refers first to the four teachings and then to the crude and the marvelous, with the first three being crude and the last one being marvelous.",
        "source": "T33n1717_002:0823b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次約五味以判麁妙，則前四味為麁、醍醐為妙，全不推求上下文意，直指一語便謂法華劣於華嚴，幾許誤哉！",
        "translation": "Next, when the five flavors are used to judge the crude and the subtle, the first four flavors are crude and the ghee is sublime.",
        "source": "T33n1717_002:0823c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幾許誤哉！",
        "translation": "How wrong it may be!",
        "source": "T33n1717_002:0823c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「約說次第名醍醐味相」者，此五味教相生之文，在第十三〈聖行品〉末，佛印無垢藏王菩薩竟，云譬如從牛出乳乃至醍醐，譬從佛出十二部經乃至涅槃。",
        "translation": "\"The text that describes the sequential production of the five flavors of the teaching is found at the end of the thirteenth Chapter of Noble Conduct, where the Buddha seals the completion of the speech of the Bodhisattva King of the Stainless Store, saying, \"It's like milk from the cow up to ghee, and it's like the twelve sutras from the Buddha up to nirvāṇa.",
        "source": "T33n1717_002:0823c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：彼經自以醍醐譬於涅槃，今何得以譬於法華？",
        "translation": "Q: That sūtra itself uses the expression ghee to simulate nirvāṇa, so why can it now be used to simulate the Lotus?",
        "source": "T33n1717_002:0823c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：一家義意謂二部同味，然《涅槃》尚劣。",
        "translation": "A: One school says that the two schools are of the same flavor, but the Nirvana is inferior.",
        "source": "T33n1717_002:0823c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "Why is that?",
        "source": "T33n1717_002:0823c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《法華》開權如已破大陣，餘機至彼如殘黨不難，故以《法華》為大收，《涅槃》為捃拾。",
        "translation": "The Lotus opens up rights as if it has already broken through a great battlefield, and the remaining abilities reach them as if they were the remnants of a party, so it's not difficult to take the Lotus as the great harvest and the Nirvana as the vintage.",
        "source": "T33n1717_002:0823c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不爾者，《涅槃》不應遙指八千聲聞於法華中得授記莂，見如來性，如秋收冬藏更無所作。",
        "translation": "If that weren't the case, the Nirvana wouldn't have pointed distantly to the 8,000 śrāvakas who were granted assurance of future enlightenment in the Lotus and saw the Tathāgata's nature like an autumn harvest or a winter retreat with nothing more to do.",
        "source": "T33n1717_002:0823c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引同中二：初總結同，次引文別釋。",
        "translation": "There are two ways to cite similarities: first, we summarize the similarities, and second, we cite the text to explain them separately.",
        "source": "T33n1717_002:0823c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初言「當知華嚴之譬與涅槃義同」者，《華嚴》日出等譬與《涅槃》五味義同，但有廣略之殊，故廣開平地以為三譬，譬三味也。",
        "translation": "The first one says, \"You should know that the metaphors of Huayan and Nirvana have the same meaning\" because the metaphors of Huayan's sunrise and Nirvana's five flavors have the same meaning, but there's a difference in their breadth and depth, so they're divided into three metaphors, which are metaphors for the three flavors.",
        "source": "T33n1717_002:0823c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引文證同中言「三子三田三馬」等者，《涅槃》「迦葉白佛：如來憐愍一切眾生，不調能調、未脫能脫，善星是佛菩薩時子，斷欲界結，證得四禪，如來何故記說是一闡提，地獄劫住不可治人？",
        "translation": "The next quote proves the same thing when it says, \"Three sons, three fields, three horses,\" etc. The Nirvana text says, \"Kāśyapa said to the Buddha, 'Tathāgata has compassion on all sentient beings who are capable of being disciplined and liberated before being liberated, and Sun Xing is the bodhisattva's time-honored son who has cut the bond of desire and realized the four meditations.",
        "source": "T33n1717_002:0823c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何不先為演說正法後為菩薩？",
        "translation": "Why not first expound the correct dharma and then become a bodhisattva?",
        "source": "T33n1717_002:0823c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不能救善星比丘，云何得名有大慈悲有大方便？",
        "translation": "If he can't save the Star of Goodness monk, how can he be called having great compassion and great skillful means?",
        "source": "T33n1717_002:0823c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T33n1717_002:0823c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如有人唯有三子，一者有信順心，恭敬父母；利根智慧，於世間事能悉了知。",
        "translation": "Suppose there's a person with only three sons, one of whom is faithful and obedient, respects his father and mother, and has sharp faculties and wisdom that enable him to fully understand worldly affairs.",
        "source": "T33n1717_002:0823c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第二子無信順心，不敬父母；利根智慧，於世間事能悉了知。",
        "translation": "The second son lacks faith and obedience, doesn't honor his parents, and has sharp faculties and wisdom that enable him to fully comprehend worldly affairs.",
        "source": "T33n1717_002:0823c27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第三子不敬父母，無信順心；鈍根無智。",
        "translation": "His third son doesn't honor his parents, lacks faith and obedience, and has dull faculties and no wisdom.",
        "source": "T33n1717_002:0823c28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "父母教告應先教誰？",
        "translation": "Who should parents teach first?",
        "source": "T33n1717_002:0823c29_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛：應先初、次及第二、後及第三。",
        "translation": "Kāśyapa said to the Buddha, \"First, the first, second, and third should come first.",
        "source": "T33n1717_002:0824a01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼二子雖無信順恭敬之心，以慈念故次復教之。",
        "translation": "Although those two sons don't have the mental attitude of faith, obedience, and respect, they are taught again in order because of kindness and mindfulness.",
        "source": "T33n1717_002:0824a02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾，其三子者先譬菩薩、次譬聲聞、後譬闡提，如脩多羅中微細之義，我先已為諸菩薩說，淺近之義為聲聞說，世間之義為闡提說。",
        "translation": "Tathāgata too, those three sons are likened first to bodhisattvas, then to śrāvakas, and then to icchantikas, just as I've explained the subtle meaning of sūtra for bodhisattvas, the more prosaic meaning for śrāvakas, and the worldly meaning for icchantikas.",
        "source": "T33n1717_002:0824a03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今雖無益，作後世因。",
        "translation": "Although it's not helpful now, it will serve as a cause in later lifetimes.",
        "source": "T33n1717_002:0824a06_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T33n1717_002:0824a07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如三田：一者渠流便易，無諸沙鹵瓦石棘刺，種一得百；二者雖無沙鹵瓦石棘刺，渠流嶮難，收實減半；三者渠流嶮難，多諸沙鹵，種一得一。",
        "translation": "It's like three fields: first, a drainage stream is easy, and there's no sand, salt, tiles, rocks, or thorns, so you can plant one and get a hundred; second, even though there's no sand, salt, tiles, rocks, or thorns, the stream is dangerous, and the harvest is really reduced by half; and third, the stream is dangerous and there's lots of sand and salt, so you can plant one and get one.",
        "source": "T33n1717_002:0824a07_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有三器：一者完，二者漏，三者破。",
        "translation": "There are also three vessels: one that's complete, two that's leaky, and three that's broken.",
        "source": "T33n1717_002:0824a10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若受用時先用何器？",
        "translation": "When you use them, which container do you use first?",
        "source": "T33n1717_002:0824a11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有三病人，一者易治，二者難治，三者不可治。",
        "translation": "\"There are three patients, one who is easy to treat, two who are difficult to treat, and three who are untreatable.",
        "source": "T33n1717_002:0824a11_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醫師若治先治何者？",
        "translation": "If a doctor treats them, which one should he treat first?",
        "source": "T33n1717_002:0824a12_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有三馬，一者調壯大力，二者不調大力，三者不調羸老。",
        "translation": "\"There are three horses, one that is strong and powerful, two that aren't powerful, and three that aren't weak and old.",
        "source": "T33n1717_002:0824a13_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王若行時先乘何馬？",
        "translation": "When the king travels, which horse will he ride first?",
        "source": "T33n1717_002:0824a14_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合譬如前。",
        "translation": "\"It's like the prior.",
        "source": "T33n1717_002:0824a15_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T33n1717_002:0824a15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大師子，若殺香象，則盡其力，乃至殺兔亦盡其力。",
        "translation": "Suppose a great teacher kills an incense elephant, then he exhausts his powers, and even kills a rabbit, he also exhausts his powers.",
        "source": "T33n1717_002:0824a15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾，為諸菩薩及一闡提，功用無二。」",
        "translation": "So it is with the Tathāgata, for whom the bodhisattvas and icchantika have no dual usefulness.\"",
        "source": "T33n1717_002:0824a16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故今文中，初說華嚴如先為菩薩，次在鹿苑如為聲聞，方等已後大小普被，乃至涅槃名為平等。",
        "translation": "In the present text, therefore, the first thing we say is that Huayan is like a bodhisattva who first becomes a buddha, the next thing we say is that he's a śrāvaka in the Deer Park, and after that, both large and small are universally included, up to the point where nirvāṇa is called equality.",
        "source": "T33n1717_002:0824a17_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《涅槃》云「功用無二」。",
        "translation": "That's why the Nirvana Sutra says, \"There are no two kinds of exertion.\"",
        "source": "T33n1717_002:0824a20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經文雖列多種三譬，譬意不別，重列來耳。",
        "translation": "Although the sūtras list a variety of three metaphors, their meanings are not distinct, so we'll list them again.",
        "source": "T33n1717_002:0824a20_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日光無私，高者先照，後及平地非不照高，從後為言故云平地。",
        "translation": "When the sun's rays are selfless, the taller one first shines, and then it reaches the level ground not because it doesn't shine on the taller one, but because it's spoken of from behind, it's called the level ground.",
        "source": "T33n1717_002:0824a21_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃亦爾，佛智無偏，大機先被，後及闡提，通前後說故云平等。",
        "translation": "Similarly, in the case of nirvāṇa, the Buddha's wisdom is unbiased, and the great capacity is first applied, followed by icchantika, which is explained from the front and back, so it's called equality.",
        "source": "T33n1717_002:0824a23_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三料簡中，初問「既以五味那同稱漸」者，問前五味教相味既有五，何故中間三味皆名為漸？",
        "translation": "Of the three qualifications, the first question is, \"Since the five flavors are all called gradual,\" which asks why the first five flavors are called gradual when the five flavors of the teaching have five distinctive characteristics?",
        "source": "T33n1717_002:0824a24_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，秖以漸入故有中間，更加前後故得有五。",
        "translation": "The answer is that it's because of gradual entry that there's an interval, and because of further advance and subsequent advance, there can be five.",
        "source": "T33n1717_002:0824a26_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從「又若」去重以五句分別漸頓，且約一期五味相生，則漸頓一向，若當部橫辨則漸頓互通，雖曰互通各有其意，故須更以五句分別。",
        "translation": "If we go from \"furthermore,\" we'll use five phrases to repeatedly discriminate gradual entry, and if the five flavors arise together in one period, then gradual entry will be the same, and if the current group discerns them horizontally, then gradual entry will be interchangeable, although it's said that interchangeability has its own meaning, so we must use five more phrases to discriminate.",
        "source": "T33n1717_002:0824a27_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初二句可解，然仍存略，且以大小相對得作此說，若以別教當教之漸相對說者，應云頓中兼漸、漸不妨頓，且為成五句顯五味故也。",
        "translation": "The first two phrases can be interpreted, but they are still abbreviated, and they are explained in terms of the relative relationship between major and minor. If we were to explain it in terms of the gradual relationship between the distinct teaching and the contemporary teaching, we would say that there is gradualness in suddenness and gradualness may be suddenness, and it's for the sake of forming five phrases to express the five flavors.",
        "source": "T33n1717_002:0824b02_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言漸中有頓則下方等句同，故略不列且云一向。",
        "translation": "If it's said that there's gradualness in gradualness, then the following phrases are the same, so they're omitted and declared to be the same.",
        "source": "T33n1717_002:0824b05_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初句華嚴也。",
        "translation": "The first phrase is \"Huayan.",
        "source": "T33n1717_002:0824b06_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次句鹿苑也。",
        "translation": "The second phrase is \"Deer Park.",
        "source": "T33n1717_002:0824b06_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次句方等也。",
        "translation": "The next phrase is \"in the direction of equality.",
        "source": "T33n1717_002:0824b07_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以大破小，具如〈弟子品〉以三教訶小，且據調熟小乘邊說。",
        "translation": "If we use the greater to refute the lesser, it's as in the Disciple's Chapter, which relies on the three teachings to reprimand the lesser and is based on the ripening of the lesser vehicle's conclusions.",
        "source": "T33n1717_002:0824b07_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有以圓訶偏，如〈菩薩品〉，復有漸中初入小行，如見土復穢得法眼淨，及俗眾室外為說無常，以小對大故云「並陳」。",
        "translation": "There's also the use of the perfect to rebuke the partial, as in the Bodhisattva Chapter, and there's the gradual middle way of first entering the lesser path, such as seeing the land and defiling it to attain purification of the Dharma eye and teaching impermanence for the sake of the secular masses outdoors, which uses the lesser to confront the greater.",
        "source": "T33n1717_002:0824b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「陳」猶列也。",
        "translation": "To \"explain\" is like to list.",
        "source": "T33n1717_002:0824b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「相資」即般若也。",
        "translation": "\"Xiangqi\" is also known as prajñā.",
        "source": "T33n1717_002:0824b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相資之義後更料簡。",
        "translation": "The meaning of \"mutual support\" is further summarized later.",
        "source": "T33n1717_002:0824b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若會」等者法華也。",
        "translation": "\"Will\" and so forth is also called the Lotus.",
        "source": "T33n1717_002:0824b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初句略出，次句引證。",
        "translation": "The first phrase outlines this, and the second phrase introduces it.",
        "source": "T33n1717_002:0824b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初云「合」者，秖是會之別名。",
        "translation": "The first phrase, \"combined,\" is a different name for what's assembled.",
        "source": "T33n1717_002:0824b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引證中引不合以證合者，如疏云開為合序，無量義既重序前開不久必合。",
        "translation": "The next quote is to prove that it doesn't fit, because as the commentary says, \"The beginning is the order of the fit, and since the meaning of immeasurable is repeatedly ordered, the beginning will soon be joined.",
        "source": "T33n1717_002:0824b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如算者下已必除，今時合者，今文更以法華意結。",
        "translation": "For example, if the calculator has been removed from the following, then the present text will be closed with the meaning of the Lotus.",
        "source": "T33n1717_002:0824b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「問」下料簡中間般若，可解。",
        "translation": "The next \"question\" is about the intermediate wisdom of simplicity, which can be understood.",
        "source": "T33n1717_002:0824b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，義兼方等，方等則大資於小，般若會中聞加二人，為菩薩說名小資大。",
        "translation": "The answer is that the meaning is both equal in kind and greater in number, and when equal in number is greater than lesser, the two people heard and added in the assembly of prajñā say for the bodhisattvas that the lesser supplements the greater.",
        "source": "T33n1717_002:0824b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦應云頓資漸，互出無在。",
        "translation": "They should also be called sudden, gradual, and mutually exclusive.",
        "source": "T33n1717_002:0824b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明不定文三：初結前生後，次「雖」下釋相，三「味味中」下結。",
        "translation": "Next, he explains the three indeterminate texts: first, he concludes with the former and latter, second, he explains the characteristics under \"although,\" and third, he concludes under \"in the taste.\"",
        "source": "T33n1717_002:0824b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文者，為對祕密須安顯露之言，故知通論顯露俱攝漸頓。",
        "translation": "The first is that in order to address the esoteric, it's necessary to set forth the words of disclosure, so it's known that the general theory of disclosure includes both gradual and sudden.",
        "source": "T33n1717_002:0824b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今於五味義後，欲別明不定亦是顯露，故初標之以冠不定。",
        "translation": "Now, after the meaning of the five flavors, we want to make it clear that uncertainty is also manifestation, so we first labeled it with a crown of uncertainty.",
        "source": "T33n1717_002:0824b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相異漸頓，故曰「不然」。",
        "translation": "Since the differences are gradual and sudden, it's called \"otherwise.\"",
        "source": "T33n1717_002:0824b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「雖高山頓說」等者，正釋也。",
        "translation": "The phrase \"although it's explained suddenly in the high mountains\" refers to the correct explanation.",
        "source": "T33n1717_002:0824b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又三：初正釋，次「大經」下引證，三「一時」下破古。",
        "translation": "There are three more: the first is a correct explanation, the second is a citation under \"Great Sutra,\" and the third is a refutation of the ancient under \"One Time.\"",
        "source": "T33n1717_002:0824b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文者，此指華嚴不動不離而升而遊者，此指頓後漸初不動於頓而施漸化。",
        "translation": "The first refers to the Huayan who rises and wanders without moving or parting, and the second refers to the gradual transformation after a sudden, gradual beginning that doesn't move during the sudden and gives.",
        "source": "T33n1717_002:0824b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中古人多有異釋，有云本釋迦不動而化身升天；有云法身不動而化用升天；有云不往而往、往而不往故升故往。",
        "translation": "The ancients had many different interpretations of this, some saying that the original Śākyamuni was motionless but the transformation body ascended to heaven, some saying that the Dharma body was motionless but the transformation function ascended to heaven, and some saying that it didn't go but went, went but didn't go so it ascended and therefore went.",
        "source": "T33n1717_002:0824b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近代藏法師四釋：一約處，一處中有一切處，則天宮本來在樹王下，但先未用此天宮處。",
        "translation": "Recent tripiṭaka masters have made four explanations: one is about the location, for in one location there are all locations, and then the palace of heaven was originally under the king of trees, but it wasn't used as a location for the palace of heaven in the first place.",
        "source": "T33n1717_002:0824c02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二者約佛，樹王下佛遍一切處，故樹王佛本在天宮，先未用彼天宮佛耳。",
        "translation": "The second refers to the Buddha, since the Buddha under the tree king pervades all places, the tree king Buddha was originally in the celestial palace, but he hadn't yet used that celestial palace Buddha.",
        "source": "T33n1717_002:0824c04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三者約時，樹王下時即天宮時。",
        "translation": "Third, it's about the time, which is when the tree king descends from the palace of heaven.",
        "source": "T33n1717_002:0824c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者約法界，謂無自性。",
        "translation": "The fourth refers to the Dharma realm, which is devoid of self-nature.",
        "source": "T33n1717_002:0824c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此未必全爾。",
        "translation": "This may not be entirely true.",
        "source": "T33n1717_002:0824c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前之三義何不論機而但約佛，後約法界何故但云無自性耶？",
        "translation": "Why isn't the first three meanings discussed in terms of the capacity but discussed in terms of the Buddha, and why is the latter discussed in terms of the Dharma realm but said to be devoid of self-nature?",
        "source": "T33n1717_002:0824c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而不云無他乃至無無因耶？",
        "translation": "But doesn't it say that there is no other, or even no cause?",
        "source": "T33n1717_002:0824c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無謀而化感應道交，非應而應非感而感，何論時處身土性等耶？",
        "translation": "When there is no plan but the transformation of the sense-organs and the interaction of the path, how can one discuss the time, place, body, land, and nature and so forth when it's not something that should be responded to and not felt?",
        "source": "T33n1717_002:0824c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖轉四諦指鹿苑，此指雖施漸化而不起於頓，此二味既然，諸味準此。",
        "translation": "Although he refers to the Deer Park in the turn of the four truths, and although he gives gradual transformation, it doesn't start suddenly, and since these two flavors are present, the flavors are standardized here.",
        "source": "T33n1717_002:0824c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖為菩薩指方等般若彼二時中俱有小果，新得舊得如常所明。",
        "translation": "Although this refers to the bodhisattva's pointing to the two times when there's a lesser realization, the new attains and the old attains as explained in the usual.",
        "source": "T33n1717_002:0824c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖五人證果，不妨八萬諸天獲無生忍，此重指漸初對般若說。",
        "translation": "Even though five people realize the fruit, it might not be possible for 80,000 gods to attain the patient acceptance of nonarising, which is again referred to in the gradual beginning when Prajñāparipṛcchā is explained.",
        "source": "T33n1717_002:0824c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前文約法，此中約人，得果不同、證法不定，應引《大論》顯密法輪義釋此中意，故《大論》六十五云「於閻浮提，見第二法輪轉，初轉法輪八萬諸天得無生忍，陳如得初果。",
        "translation": "The preceding paragraph was about the Dharma, but this one is about people, and the fruits they attain are different, and the Dharma they realize is uncertain.",
        "source": "T33n1717_002:0824c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今轉法輪無量諸天得無生忍，今轉似初轉。」",
        "translation": "The present turning of the wheel of the Dharma, in which measureless gods attain the patient acceptance of nonarising, is like the first turning.\"",
        "source": "T33n1717_002:0824c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：初轉少、今轉多，云何以大喻小而言似耶？",
        "translation": "Q: How do you say that the first turning is less and the present turning is more, and how do you use the greater to describe the lesser to make it seem like that?",
        "source": "T33n1717_002:0824c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：諸佛有二種法輪：一者顯、二者密。",
        "translation": "A: The buddhas have two kinds of dharma-wheels: the first is manifest, and the second is esoteric.",
        "source": "T33n1717_002:0824c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初轉聲聞見八萬及一人，諸菩薩見無量阿僧祇人得二乘，無量阿僧祇人得無生忍，無量阿僧祇人發無上道心行六波羅蜜，阿僧祇人得初地乃至十地一生補處坐道場，是名為密。",
        "translation": "The first transformation in which śrāvakas see 80,000 and one person, bodhisattvas see measureless incalculable people who attain the two vehicles, measureless incalculable people who attain the patient acceptance of nonarising, measureless incalculable people who arouse the mind for the unsurpassed path and practice the six perfections, and incalculable people who attain the first ground and up to the tenth ground and sit in the enlightenment site during their lifetime is called esoteric.",
        "source": "T33n1717_002:0824c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知初見八萬一人屬顯露攝，祕密者如次明之。",
        "translation": "Therefore, it's known that the first 80,000 people who see are included in the manifest, and those who are esoteric are explained in the following order.",
        "source": "T33n1717_002:0824c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又《大論》三十一云：「欲得一音遍十方恒沙世界，當學般若。",
        "translation": "Also, according to the 31st edition of the Mahāprajñāpāramitā, \"If you want to attain a single voice that pervades the world of sands in ten directions, you should train in prajñā.",
        "source": "T33n1717_002:0824c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論問：若爾與佛一音何別？",
        "translation": "The question was, 'What's the difference between this and the Buddha's one voice?'",
        "source": "T33n1717_002:0824c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：有限無限。",
        "translation": "A: Finite and infinite.",
        "source": "T33n1717_002:0825a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若爾何故閻浮提人來佛邊聽法？",
        "translation": "Q: If that's the case, why do people from Jambudvīpa come to the Buddha to hear the teaching?",
        "source": "T33n1717_002:0825a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：佛有二種音聲，一者密，如向所說；二者不密，須來佛邊。」",
        "translation": "A: There are two kinds of sounds of the Buddha: one is esoteric, as explained above, and the other is not esoteric; you must come to the Buddha.\"",
        "source": "T33n1717_002:0825a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此據別說。",
        "translation": "This is based on a different explanation.",
        "source": "T33n1717_002:0825a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約體而論二義俱時，故今文中相即而說。",
        "translation": "It's discussed in terms of the essence of both meanings at the same time, so they're explained together in the present text.",
        "source": "T33n1717_002:0825a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引大經證中云「或時說深、或時說淺等名不定」者，以由彼此互相知故。",
        "translation": "The next quote from the great sūtra proves that the words \"sometimes they're said to be profound, sometimes they're said to be shallow, and so on, and the names are indeterminate\" because they're known to be mutually beneficial.",
        "source": "T33n1717_002:0825a05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若祕密者，即如下文互不相知，是故名密。",
        "translation": "If something is esoteric, that's because they don't know each other as described below, and that's why it's called esoteric.",
        "source": "T33n1717_002:0825a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不定與祕並皆不出同聽異聞，故名為即。",
        "translation": "Both indeterminate and esoteric don't involve hearing each other and hearing each other differently, so they're called that.",
        "source": "T33n1717_002:0825a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今亦淺深同席，故著「或」言。",
        "translation": "Now, they're also both shallow and deep, so they're referred to as \"maybe.\"",
        "source": "T33n1717_002:0825a08_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「應問」謂開其問端，「應遮」謂置其所問，亦開置同席故成不定。",
        "translation": "\"Should ask\" means to open the end of a question, and \"should refute\" means to place the question, which also opens and places the same seat and therefore becomes indeterminate.",
        "source": "T33n1717_002:0825a09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三示相破古中，先示相，次破古。",
        "translation": "Of the three ways to show characteristics and refute the past, the first is to show characteristics, and the second is to refute the past.",
        "source": "T33n1717_002:0825a10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示相中云「一時」等者，從廣之狹。",
        "translation": "The expression \"one time\" in demonstrating characteristics follows a broad definition.",
        "source": "T33n1717_002:0825a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「時」謂五味之一，亦是一部一會，「說」謂一句一言，「念」謂一剎那頃，具如前文不定教相，此顯如來不共之力。",
        "translation": "\"Time\" refers to one of the five flavors, which is also a single assembly, \"teaching\" refers to a single sentence, and \"mindfulness\" refers to a split second, as in the preceding sentence, which is the indeterminate aspect of the teaching, and which shows the Tathāgata's uncommon power.",
        "source": "T33n1717_002:0825a12_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：此與方等恐畏歡喜等，為有何別？",
        "translation": "Q: What's the difference between this and such things as fear and rejoicing in different directions?",
        "source": "T33n1717_002:0825a14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：不定遍前四味，若直語方等，但彈斥而已。",
        "translation": "A: Indeterminate pervades the first four flavors, and if we were to speak directly about them, we would simply rebuke them.",
        "source": "T33n1717_002:0825a15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既以身土令物殊途，正當不定；般若亦然，思之可見。",
        "translation": "Since the body and land make things different paths, they should be indeterminate; so does Prajñā, as can be seen when you consider it.",
        "source": "T33n1717_002:0825a16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次破古中云「不同舊義專判一部」者，如第十卷判教中云「南北通用漸頓不定」，不定者即指《勝鬘》及《金光明》，故今家判義，味味之中皆有不定，故不同舊專指二經。",
        "translation": "The second refutation of the ancient saying, \"Unlike the old teaching that focused on one particular scripture,\" is that in the tenth volume of the doctrine, it says, \"The teachings of the north and south are generally gradual, sudden, and indeterminate,\" and the indeterminate refers to the Śrīmālādevī and the Golden Light, so the present doctrine refers to flavors and tastes that are both indeterminate, so it's different from the old teaching that focused on two scriptures.",
        "source": "T33n1717_002:0825a18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言「味味」者，乳中則約圓別相對以辨不定；酪中教門雖無二別，乃與八萬對辨不定；生熟二蘇三四對辨其意可見。",
        "translation": "When it comes to \"taste and flavor,\" the contrast between the perfect and distinctive in milk is used to discern indeterminacy; although there are no two distinct teaching approaches in cheese, the contrast with the 80,000 is used to discern indeterminacy; the contrast between the raw and ripe, the two sugars, the three and four is evident in their meaning.",
        "source": "T33n1717_002:0825a21_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「此乃」下祕密，為四：初結前生後，次「如來」下略歎，三「此座」下釋相，四「雖復」下結歎。",
        "translation": "Next, under \"this is,\" there are four mysteries: the first concludes with the former and the latter, the second briefly praises the Tathāgata, the third explains the characteristics under \"this seat,\" and the fourth concludes with a praise under \"although it's furthermore.\"",
        "source": "T33n1717_002:0825a24_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文可見。",
        "translation": "The first part of the sentence shows this.",
        "source": "T33n1717_002:0825a26_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次略歎中云「若智若機」等者，智謂大聖權謀，機謂不同次第，不擇時處，身口意密隨何四門無礙自在，適時稱會皆無虛設。",
        "translation": "In the second summary, it says, \"If there's wisdom or opportunity,\" etc., wisdom refers to the authority of great sages, opportunity refers to a different order, doesn't discriminate time and place, and follows the four approaches of body, speech, and thought with unhindered freedom, and timely appointments are not falsely imagined.",
        "source": "T33n1717_002:0825a26_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三正釋相中且寄三法以出其相。",
        "translation": "In the three correct explanations of characteristics, we'll also refer to three things that reveal their characteristics.",
        "source": "T33n1717_002:0825a29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "What are they?",
        "source": "T33n1717_002:0825b01_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此三法對祕密故，則化儀四教文義整足，任運攝得三藏等四。",
        "translation": "Because these three things are concomitant with the esoteric, the four modes of teaching are complete in terms of text and meaning, and the three collections and four others can be gathered at will.",
        "source": "T33n1717_002:0825b01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中復二：先約三說相對，次約說默相對。",
        "translation": "There are two more: first, they are discussed in terms of the contrast between the three teachings, and second, they are discussed in terms of the contrast between silence.",
        "source": "T33n1717_002:0825b03_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初三說中二：先約十方相對，次「或為」下於一方中多人相對，一方既爾十方亦然。",
        "translation": "The first two of the three explanations are first about the contrast of the ten directions, and the second is about the contrast of multiple people in one direction, which is true of one direction and true of the ten directions.",
        "source": "T33n1717_002:0825b04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二文各先正釋，次「各各」下結。",
        "translation": "Each of the two texts is first explained correctly, and then it's concluded under \"each.\"",
        "source": "T33n1717_002:0825b05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次約說默相對中，亦應具有十方及人二義不同，無人相對者文略。",
        "translation": "Next, in the discussion of the contrast of silence, the two meanings of contrast in ten directions and contrast in person should also be different, and the text is abbreviated if there's no one to face each other.",
        "source": "T33n1717_002:0825b06_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而言「俱默俱說」者，理合如之。",
        "translation": "He says, \"both speaking and being silent,\" which is consistent with the principle.",
        "source": "T33n1717_002:0825b08_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前三法相對，準此亦應云俱頓、俱漸、俱不定，文無者亦略。",
        "translation": "Regarding the previous three oppositions, the term should also be both sudden, gradual, and indeterminate, but the absence of such a term is also abbreviated.",
        "source": "T33n1717_002:0825b08_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既云俱默俱說互不相知名之為密，何妨俱頓互不相知？",
        "translation": "Since it's said that both silence and explanation are mutually unknown as esoteric, why wouldn't both suddenness and mutuality be unknown?",
        "source": "T33n1717_002:0825b10_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「各各」下亦結也。",
        "translation": "It's also concluded under \"each.\"",
        "source": "T33n1717_002:0825b11_37",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云「互不相知」者，前文但云於此於彼者亦應互說，舉一以例，驗知不定與祕密，但有互知與互不知以辨兩異。",
        "translation": "The expression \"don't know each other\" means that the prior statement only says that here and there should be mutually explained, so we'll take one example to test whether it's uncertain or esoteric, but there's mutual knowledge and mutual lack of knowledge to discern the two differences.",
        "source": "T33n1717_002:0825b11_38",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中顯露亦義通餘七，以祕不出此七故也。",
        "translation": "Here, revealing also has the same meaning as the other seven, because it's not esoteric and doesn't come from these seven.",
        "source": "T33n1717_002:0825b14_39",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故前文云顯露漸頓及顯露不定，故七並是顯露意也。",
        "translation": "That's why the preceding sentence says that the manifestation is gradual and sudden, and the manifestation is uncertain, so the seven are both meant to be manifest.",
        "source": "T33n1717_002:0825b15_40",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾，何妨法華亦與諸教十方一席互為顯祕，而云法華是顯非祕密耶？",
        "translation": "If that's the case, why wouldn't the Lotus and the teachings in the ten directions and one seat be mutually revealing and esoteric, and then it's said that the Lotus is revealing and not esoteric?",
        "source": "T33n1717_002:0825b16_41",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：十方容有一席定無。",
        "translation": "A: \"There's room in ten directions, and one seat is definitely not available.",
        "source": "T33n1717_002:0825b18_42",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言容有者，何妨餘方未宜開權廢近等說，則彼不知此。",
        "translation": "When they say there's room, what's the harm in saying that it's not appropriate to open the seats in other directions, such as in expediting the abolition of the near-by teaching, and then they don't know this.",
        "source": "T33n1717_002:0825b19_43",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若此間法華席中初發心者及人天被開，豈可盡知十方世界開與不開？",
        "translation": "If this seat of the Lotus is opened to those who have just begun to awaken the mind and to humans and gods, how can we fully know whether the world in the ten directions is opened or not?",
        "source": "T33n1717_002:0825b20_44",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然已聞法華本門施化非適一世，縱不現見亦可比知開不開相，義當於知。",
        "translation": "However, having heard that the original teaching of the Lotus doesn't apply to one lifetime, even if it's not seen in person, it's comparable to knowing whether it opens or doesn't open up a form, which should be understood.",
        "source": "T33n1717_002:0825b22_45",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況同居分身寂光地涌，覩已咸信一道無偏，不同華嚴云是眷屬大集亦無分身之言，般若但云問者加說名字咸同，故知此經與餘經異。",
        "translation": "Furthermore, since the part-bodies that reside together are silent, luminous, and well-springing up after seeing them are all convinced that there's no partiality to one single body, unlike Huayan's claim that it's a great collection of followers and there's no part-body, and Prajñā's claim that the names of those who ask are the same, it follows that this sūtra differs from the others.",
        "source": "T33n1717_002:0825b23_46",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯密意別，思之可知。",
        "translation": "The obvious and the esoteric are distinct, which can be understood when you consider them.",
        "source": "T33n1717_002:0825b27_47",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四「雖復」下結歎，中三：初舉廣以歎，次「但可」下許證附理故可知、言說依事故莫辨，故知證一照極略得大猷，言不累施卒何可具？",
        "translation": "The fourth concluding remark is \"although\", of which there are three: the first is to praise by citing the broad, the second is \"only possible\", which allows for the realization that it's understandable because it's accompanied by principle and that it's indistinguishable based on language, so it's clear that the realization of a single illumination is extremely brief and attains greatness, and it's not exhaustive in terms of what can be said?",
        "source": "T33n1717_002:0825b27_48",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「雖復」下覽言說，以從意故意不出漸等。",
        "translation": "\"Although\" follows, it's explained in order to follow the intention not to go beyond gradual equality.",
        "source": "T33n1717_002:0825c01_49",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明今經為二：初總明教顯勝，次明約迹顯勝。",
        "translation": "The next section explains that the present sūtra is divided into two: the first generally explains the manifest superiority of the teaching, and the second explains the manifest superiority in terms of traces.",
        "source": "T33n1717_002:0825c02_50",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文云「今法華是顯露」等者，對非祕密，故云顯露。",
        "translation": "The first one says, \"Now, the Lotus is revealed,\" and so forth, because it's not esoteric, it's called revealed.",
        "source": "T33n1717_002:0825c03_51",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於顯露七中，通奪而言之，並非七也。",
        "translation": "Of the seven things that are revealed, this is not seven when spoken of generically.",
        "source": "T33n1717_002:0825c04_52",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別與而言之，但非前六。",
        "translation": "They are separately mentioned, but they aren't the first six.",
        "source": "T33n1717_002:0825c05_53",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "Why is that?",
        "source": "T33n1717_002:0825c06_54",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七中雖有圓教，以兼帶故是故不同，此約部說也。",
        "translation": "Although there are seven elements of the perfect teaching, they're different because they're combined, which is explained in terms of a particular order.",
        "source": "T33n1717_002:0825c06_55",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼七中圓與法華圓，其體不別故但簡六，此約教說也。",
        "translation": "Although there are seven intermediate perfections and Lotus perfections, their essences aren't distinct, so they're simply six, which is explained in terms of the teaching.",
        "source": "T33n1717_002:0825c07_56",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次言「是漸頓非漸漸」者，具如前判。",
        "translation": "The next point, \"gradual and sudden, not gradual,\" is explained as before.",
        "source": "T33n1717_002:0825c08_57",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今《法華經》是漸後之頓，謂開漸顯頓，故云漸頓，非法華前漸中之漸。",
        "translation": "Now, the Lotus Sutra refers to gradual and subsequent suddenness, which is to say that it begins with gradualness and reveals suddenness, so it's called gradual and sudden, not gradual within gradualness as in the case of the Lotus.",
        "source": "T33n1717_002:0825c09_58",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "Why is that?",
        "source": "T33n1717_002:0825c11_59",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前判生熟二蘇同名為漸，此二經中亦有圓頓；今法華圓與彼二經圓頓不殊，但不同彼方等中三、般若中二，此之二三名漸中漸，法華異彼，故云「非漸漸」耳。",
        "translation": "The previous judgment is that the two sutras of birth and maturation are both called gradual, and there's also a perfect and sudden in these two sutras; now, the Lotus Perfection is not different from the perfect and sudden in those two sutras, but it's different from the three in Equanimity and the two in Prajñā.",
        "source": "T33n1717_002:0825c11_60",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人不見之，便謂法華為漸頓，華嚴為頓頓，恐未可也。",
        "translation": "I'm afraid it's not true for people to say that the Lotus is gradual and sudden and the Flower Ornament is sudden and sudden when they don't see them.",
        "source": "T33n1717_002:0825c15_61",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是合」等者，是開權之圓，故云「是合」，不同諸部中圓，故云「非不合」，合者秖是會之別名，此即已當約藏等四以簡權實，故不復云是圓非三。",
        "translation": "The term \"is combined\" and so forth refers to the perfection of the opening right, so it's called \"combined,\" which is different from the perfection in other schools, so it's called \"not non-conforming.\" The term \"combined\" is just a different name for the assembly, which is already about the tripiṭaka and the other four in order to define the right and the real, so it's no longer called perfect and not three.",
        "source": "T33n1717_002:0825c16_62",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既知非是法華之前顯露已竟，則了法華俱非七教，此即對於八教簡也。",
        "translation": "Since we've finished revealing that it's not the Lotus before, we understand that the Lotus is not seven teachings at all, and this is a brief explanation of the eight teachings.",
        "source": "T33n1717_002:0825c19_63",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如此」下顯迹，可知。",
        "translation": "The traces are revealed under \"thus,\" which can be understood.",
        "source": "T33n1717_002:0825c21_64",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次約化道中二：初正辨異，次指教誠證。",
        "translation": "Next, we'll discuss the two aspects of the path of transformation: first, we'll correctly identify the differences, and second, we'll point out the sincere realization of the teaching.",
        "source": "T33n1717_002:0825c21_65",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文為五：初重舉餘經以對辨。",
        "translation": "The first is composed of five passages: first, we repeatedly cite other sūtras to contrast with each other.",
        "source": "T33n1717_002:0825c22_66",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「此經」下正明今經意，且指迹中大通為首，雖寄漸及不定，不以餘教為種，故云「巧為」。",
        "translation": "Next, under \"this sūtra,\" he correctly explains the meaning of the present sūtra and refers to the great penetration in the manifestation as the leader, even though it's based on gradual and indeterminate practice and doesn't take the other teachings as seeds, so it's called \"skillful effort.\"",
        "source": "T33n1717_002:0825c23_67",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結緣已後退大迷初，故復更於七教之中下調停種，復云「巧為」。",
        "translation": "After the conclusion of the condition, he regresses from the beginning of the great misconstrual, so he again makes a downward adjustment among the seven teachings, which is again called \"skillful effort.\"",
        "source": "T33n1717_002:0825c25_68",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以中間得受七教長養調伏，因調而熟名為調熟，調實未熟因中說果是故云也。",
        "translation": "Therefore, the intermediate attainer is nurtured and disciplined by the seven teachings, and maturation as a result of conditioning is called ripening, and the result is explained within the cause of conditioning that's really unripe.",
        "source": "T33n1717_002:0825c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又以」下明今世復以七教調伏令至法華得度，故云「度脫」也。",
        "translation": "Under \"also by\", it's explained that in this life he'll again be disciplined by the seven teachings so that he'll attain salvation at the Lotus, which is why it's called \"liberation.\"",
        "source": "T33n1717_002:0825c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「並脫」等者，約多人說，於彼是種、於此是熟，互說可知，是故云「並」及「番番不息」，此即結初及以中間今日等相，故更引涌出，助顯迹文，故云「大勢威猛」等也。",
        "translation": "\"Parallel liberation\" and so forth are explained in terms of many people, and it's understood that this is the seed and this is the ripening, so it's called \"parallel\" and \"repeatedly uninterrupted.\" This is the first stage of the conclusion and the present day in between, so it's called \"great power and might\" and so forth as it also brings out the springs to help reveal the manifestation text.",
        "source": "T33n1717_002:0826a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此〈涌出品〉中三世益物之文，大勢威猛即未來，師子奮迅即現在，自在神通即過去，此中略舉未來一文而總通三世，故世時念，世時念皆有種等三相故也。",
        "translation": "In this text of the Ābhāsvara Chapter, the three worlds are beneficial, with Mahāsthāmaprāpta being the future, Shizi's ardor being the present, and Īśvara's supernormal power being the past, which briefly refers to one future text but generally comprehends the three times, so mindfulness of the world and mindfulness of the world have three characteristics, such as type.",
        "source": "T33n1717_002:0826a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次指「信解」者，即〈信解〉中云「又以他日於牕牖中」，即指法身地鑒機久矣。",
        "translation": "The next one refers to \"faith and understanding,\" which is the statement in \"Faith and Understanding\" that says, \"And in another day, in a window or window,\" which refers to the stage of the Dharma body and the ability to see it for a long time.",
        "source": "T33n1717_002:0826a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故此一語即兼三世益物之相。",
        "translation": "Therefore, this one statement combines the three worlds and the characteristics of things that benefit them.",
        "source": "T33n1717_002:0826a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又信解具領一代五味，則知三世五味並然，義須兼於述成之文，以述成中先直述所解，次明領所不及，則十法界七方便等皆得五味之益，即其意也。",
        "translation": "Furthermore, since the Explanation of Faith fully comprehends the five flavors of one generation, it's important to understand that the five flavors of the three times are the same, and the meaning must be found in the Explanation of Formation, which first directly describes what's understood and then clearly comprehends what's not, so the seven skillful means of the ten realms of reality will all attain the benefit of the five flavors, which is what it means.",
        "source": "T33n1717_002:0826a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘教無此，故不同之。",
        "translation": "The other teachings don't have this, so they're different.",
        "source": "T33n1717_002:0826a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「又眾經」下本門，為五：初正明本地長遠，次「補處」下舉不知之人以顯長遠，三「經云」下引壽量證因聞方知，四「慇勤」下引迹門歎意以證長遠難聞，五「當知」下結。",
        "translation": "Next, under \"And there are many sūtras,\" there are five aspects of the main teaching: first, we correctly explain the longevity of the teaching; second, we cite those who don't know it under \"The supplementary place\" to show its longevity; third, we cite longevity under \"The sūtras say\" to confirm that it's only because of hearing that we know it; fourth, we cite the admiration of the profound approach under \"Attentiveness\" to confirm that it's difficult to hear about the longevity of the teaching; and fifth, we conclude under \"You should know\".",
        "source": "T33n1717_002:0826a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文又二：初正明，次「眾經尚不」下泛引眾經況出遠相。",
        "translation": "First, there are two main points: the first is a direct explanation, and the second is a general reference to the sutras' circumstances that go beyond the distant perspective under \"Not yet in many scriptures.\"",
        "source": "T33n1717_002:0826a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初又二：初師，次弟子。",
        "translation": "First, there are two more: the first is the teacher, and the second is the disciple.",
        "source": "T33n1717_002:0826a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初師中二：先引昔經，以自證為實、化他為權。",
        "translation": "The first is the teacher, of which there are two: first, he cites a scripture from the past that used self-authentication as the truth and teaching others as the right.",
        "source": "T33n1717_002:0826a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「今經」下明今經一體權實久久已滿，迹中三千界墨點尚已為久，今本中五百億塵界故云「久久」。",
        "translation": "Next, under \"present sūtra,\" he explains that the present sūtra's unity of expediency and reality has been fulfilled for a long time, and that the 3,000 worlds in the manifestation have been ink spots for a long time, but the 50 billion dusty realms in the present sūtra are therefore called \"a long time.\"",
        "source": "T33n1717_002:0826a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又一節已久，況節節相望，故云「久久」。",
        "translation": "It's also been a long time since one section was written, so it's called \"a long time\" since each section is connected to the other.",
        "source": "T33n1717_002:0826a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「諸經」下弟子中亦先引昔二乘猶住小果，故云不入，豈能化他？",
        "translation": "Next, under \"Sutras,\" the disciples also first cited that in the past, the two vehicles still lived in a lesser state, so they said they didn't enter, so how could they teach others?",
        "source": "T33n1717_002:0826a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故不施權。",
        "translation": "Therefore, it doesn't confer rights.",
        "source": "T33n1717_002:0826a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明今經，如滿願等先已入實，說法第一故先解行權。",
        "translation": "Next, he explains that in the present sūtra, such things as the fulfillment of a vow have already been entered into the truth, and he explains the right to practice first because he preaches the Dharma first.",
        "source": "T33n1717_002:0826a26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次況中亦先舉昔，不說道樹之前一節兩節，故云「近近」。",
        "translation": "Next, it first refers to the past and doesn't discuss the two sections before the bodhi tree, so it's called \"near and distant.\"",
        "source": "T33n1717_002:0826a27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾前一節兩節望今尚近，況無中間遠中之近？",
        "translation": "Those two sections before that look close to the present, so why wouldn't there be a middle section that's nearer than the middle?",
        "source": "T33n1717_002:0826a28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故云「近近」。",
        "translation": "That's why it's called \"near and far.\"",
        "source": "T33n1717_002:0826b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次況出今經，言「遠遠」者，秖是久久。",
        "translation": "Next, referring to the present sūtra, the expression \"distant and far\" means it's been a long time.",
        "source": "T33n1717_002:0826b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言異者，約時長短為久近，約所行處為遠近，成已化迹為所行處，俱有二意，故互說之。",
        "translation": "It also says different, referring to the length of time as long and short, the place where it's practiced as near and far, and the traces of formation that have been accomplished as the place where it's practiced, both have two meanings, so they're explained together.",
        "source": "T33n1717_002:0826b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次不知之人中云「補處數世界不知」者，如〈壽量〉中五百億那由他阿僧祇三千大千世界盡抹為塵，復過爾所世界乃下一塵，塵數已多，況下塵不下塵界寧當可數？",
        "translation": "For those who don't know, the expression \"I don't know the number of supplementary worlds\" means that, as in the book \"Longevity,\" 50 billion incalculable, incalculable, 3,000 great thousand worlds are completely obliterated into dust, and there's only one dust in the lower part of that world, which is already a lot of dust, so how could it be counted if the lower part of the dust didn't descend into the dust realm?",
        "source": "T33n1717_002:0826b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下塵不下塵界尚不可知，況界中塵寧當可數？",
        "translation": "It's still unknown whether the lower realms are dust or not, so how could the dust in the realms be counted?",
        "source": "T33n1717_002:0826b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況如塵數，以一塵為一劫，佛成道來復過是數億阿僧祇，未發迹來彌勒不知，雖發迹竟補處智力不知界數，況知塵耶？",
        "translation": "How much more so when a particle of dust is counted as an eon, which is billions of incalculable eons since the Buddha's attainment of enlightenment, which Maitreya didn't know before he started, even though he didn't know the number of realms even after starting his career, how could he know the number of dusts?",
        "source": "T33n1717_002:0826b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以開迹顯本皆入初住，故云作佛。",
        "translation": "That's why they all enter the first abode when the manifestation begins and the original appears, so it's called becoming a buddha.",
        "source": "T33n1717_002:0826b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本門發迹於果不疑，故皆發願求此實果，故云「願我於未來說壽亦如是」。",
        "translation": "Since the origin gives rise to the traces and has no doubt about the fruit, they all give rise to the vow to pursue this true fruit, which is why it's called, \"May my life span in the future be likewise.\"",
        "source": "T33n1717_002:0826b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三引證者，近以迹門尚得為昔，況伽耶已前？",
        "translation": "These three references are for the realization that it's recently been possible for the directive aspect to be considered past, so why wouldn't it be possible for it to be prior to the Gayā?",
        "source": "T33n1717_002:0826b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已被開者自是一邊，若據未曾開會者，自退大已來小起已後，皆名為昔。",
        "translation": "Those who have been initiated are considered one side, and those who have yet to be initiated are called former since their retreat from the great, since their minor initiation, and afterward.",
        "source": "T33n1717_002:0826b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四引迹門歎者，〈方便品〉初雖近歎五佛權實，意實密歎師弟長遠。",
        "translation": "Although the first part of the Lotus Sutra praises the authority and reality of the five buddhas, the fourth part praises the longevity of the teacher and disciple.",
        "source": "T33n1717_002:0826b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五「當知」下結一向異。",
        "translation": "The fifth \"you should know\" concludes with a single difference.",
        "source": "T33n1717_002:0826b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七番共解中初標五章竟。",
        "translation": "The first of the seven common understandings indicates the end of the five chapters.",
        "source": "T33n1717_002:0826b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第二引教證五章者，又為二：初引二文通證五章，次引〈藥王〉別證教相。",
        "translation": "The second one introduces the teaching to confirm the five chapters, and there are two more: the first introduces two texts that confirm the five chapters in general, and the second introduces the Yakṣa King to confirm the teaching in particular.",
        "source": "T33n1717_002:0826b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文又二：初正引二文，次「所以」下明引二文意。",
        "translation": "There are two preliminary passages: the first correctly introduces the two passages, and the second, \"Therefore,\" explains the meaning of the two passages.",
        "source": "T33n1717_002:0826b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文二：先明〈序品〉，次明〈神力〉。",
        "translation": "The first two texts begin with the introduction, followed by the second, which explains the miraculous powers.",
        "source": "T33n1717_002:0826b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文自為四：初證名中二：初證正名，次「何但」下略引同。",
        "translation": "The first text is divided into four: the first proves the proper name of the text, and the second briefly cites the same text under \"Why?\"",
        "source": "T33n1717_002:0826b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文者，彌勒初以伏疑潛難，文殊因以潛釋伏疑。",
        "translation": "In the first section, Maitreya began by quelling doubts and resolving difficulties, and Mañjuśrī explained by quelling doubts.",
        "source": "T33n1717_002:0826b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難云：四眾忻仰瞻仁及我，世尊何故放斯光明？",
        "translation": "The question was, \"Why does the Bhagavān emit such a radiant light when the four groups of people admire Tsering and me?",
        "source": "T33n1717_002:0826b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊釋云我見等也。",
        "translation": "Mañjuśrī explained that this is also called \"self-view.",
        "source": "T33n1717_002:0826b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引同中言「何但」者，何但如文殊引二萬燈明同爾，大通及五佛其名咸同。",
        "translation": "When it says, \"Why is it just like that?\" in the next quote, why is it just like that in Wenshu's quote about the twenty-thousand lamps and the five buddhas, whose names are all the same?",
        "source": "T33n1717_002:0826b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：大通名同，在文可見，五佛章中未聞其同。",
        "translation": "Q: The names of the Datong are the same, as shown in the text, but we haven't heard that the names of the five buddhas are the same in the chapter on the five buddhas.",
        "source": "T33n1717_002:0826c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：釋迦既名法華，餘之四佛並云「亦以」，故知同也。",
        "translation": "A: Since Śākyamuni is called the Lotus, the other four Buddhas are also called \"also by\", so we know they're the same.",
        "source": "T33n1717_002:0826c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況妙法秖權實一體，四佛皆云「為令眾生得一切種智及開示悟入佛之知見」，故下釋云「開示悟入即其文也」，名同義同其意在此。",
        "translation": "Furthermore, since the wonderful Dharma is now the essence of expedient and real, the four Buddhas all say, \"In order to enable sentient beings to attain all kinds of cognition and to reveal and awaken to the Buddha's vision,\" so the following explanation says, \"To reveal and awaken to it is the text.\" Herein lies the meaning of \"the same name\" and \"the same meaning.",
        "source": "T33n1717_002:0826c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次文云引證經體中總引三文，引今文者，亦是文殊釋伏疑中釋體疑也。",
        "translation": "The next verse says that the three texts are summarized in the introduction to the essence of the sūtra, and the reference to the present text is also an explanation of the essence of doubt in Mañjuśrī's explanation of the suppression of doubt.",
        "source": "T33n1717_002:0826c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「今」是今佛之文，餘二並是燈明之文，故云「古」也。",
        "translation": "The \"present\" text is the text of the present Buddha, and the other two are the texts of the Lamp, so they're called \"ancient.\"",
        "source": "T33n1717_002:0826c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次文證宗中二：先引，次「即是」下釋。",
        "translation": "The second text proves the thesis in two ways: first, by citing it, and second, by explaining it under \"this is.\"",
        "source": "T33n1717_002:0826c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文亦是文殊釋伏疑文也。",
        "translation": "The first text is also Wenshu's explanation of the text for quelling doubt.",
        "source": "T33n1717_002:0826c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋中先約迹、次約本。",
        "translation": "In the next explanation, the first refers to the traces, and the second refers to the source.",
        "source": "T33n1717_002:0826c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迹門約弟子因，本門約佛果也。",
        "translation": "The directive approach focuses on the cause of the disciple, and the original approach focuses on the result of the Buddha.",
        "source": "T33n1717_002:0826c11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師非無因、弟子有果，且互舉耳。",
        "translation": "It's not that the teacher lacks a cause and the disciple has an effect, but they're mutually enumerated.",
        "source": "T33n1717_002:0826c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「文云」下證用，中亦二：初引、次釋。",
        "translation": "Next, under \"Wenyun,\" we'll discuss application, of which there are also two: first, we'll cite and second, we'll explain.",
        "source": "T33n1717_002:0826c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文二：初引釋伏疑文正證，次引〈方便品〉略開權文以助成，即化終為久。",
        "translation": "The first two are: the first quotes the explanation of the text of quelling doubt as direct proof, and the second quotes the Expedient Chapter, which briefly opens the text of the expedient in order to help make it possible, namely, that the transformation ends with a long period of time.",
        "source": "T33n1717_002:0826c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋中前引經文但云三乘，以三乘義含故今釋出。",
        "translation": "In the second explanation, the passage quoted earlier only refers to the three vehicles, which are included in the meaning of the three vehicles and are therefore explained here.",
        "source": "T33n1717_002:0826c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若五若七但是開合異耳。",
        "translation": "Whether it's the fifth or seventh, it's just an opening and closing.",
        "source": "T33n1717_002:0826c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「五」開人天，「七」開菩薩，「九」合菩薩復開四趣，若不開人天四趣，斷九法界上佛法界疑不盡。",
        "translation": "If the \"five\" open the human and divine realms, the \"seven\" open the bodhisattvas, and the \"nine\" combine with the bodhisattvas to open the four destinies, then it wouldn't be enough to end doubt about the Buddha's Dharma realm above the nine Dharma realms.",
        "source": "T33n1717_002:0826c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若爾，經何不說？",
        "translation": "Q: If that's the case, why doesn't the sūtra explain it?",
        "source": "T33n1717_002:0826c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：餘趣會實諸經或有，二乘全無，故合菩薩對於二乘，從難而說，釋據盡理故須論九，斷此等疑，生一乘信。",
        "translation": "A: The other destinies may actually exist in some scriptures but are completely absent in the two vehicles, so the combined bodhisattvas spoke to the two vehicles from a position of difficulty, and the explanation based on the exhaustive principle necessitated the discussion of the nine, which cut off these doubts and gave rise to One Vehicle faith.",
        "source": "T33n1717_002:0826c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引〈神力品〉，先列經，次釋。",
        "translation": "Next, he cites the Chapter on Spiritual Powers, listing the sutras first and explaining them second.",
        "source": "T33n1717_002:0826c22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切之言即權實相攝，相攝故妙。",
        "translation": "Everything that's said is a combination of expedient and real, and because the characteristics are included, it's marvelous.",
        "source": "T33n1717_002:0826c23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內用自在，故除疑、等方遍即「自在神力」，具含三千、通攝三德，故名為「藏」。",
        "translation": "Because they function freely within, they remove doubt and pervade equally, which is called \"the store of supernormal powers\" that contains all 3,000 and fully integrates the three virtues.",
        "source": "T33n1717_002:0826c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾前非器，不授斯要。",
        "translation": "Since he's not a vessel for the above, he won't be given this teaching.",
        "source": "T33n1717_002:0826c25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「甚深之事」者，因果名「事」，實相名「深」，是實相家之因果名「甚深事」，若非此因果則非今經宗也。",
        "translation": "The term \"profound matter\" refers to the fact that causes and effects are called \"matters,\" and the real characteristic is called \"profound,\" which is the real characteristic's cause and effect called \"profound matter,\" and if it weren't for this cause and effect, then it wouldn't be the present doctrine of the sūtras.",
        "source": "T33n1717_002:0826c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次重引〈法師品〉者，助成二文耳。",
        "translation": "The next reason we repeatedly cite the Dharma Teachers' Chapter is to help complete the two texts.",
        "source": "T33n1717_002:0826c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非無餘文，所以但引宗文助釋者，聖人垂教意在脩行，故名體用。",
        "translation": "It's not that there aren't any other texts, but the reason we cite the texts of the school to help explain them is because the noble person's intention in presenting the teaching is to cultivate practice, so it's called essence and function.",
        "source": "T33n1717_002:0826c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教以宗為主，脩行莫過因果故也。",
        "translation": "The doctrine is dominated by the tenets, and nothing is more important than cause and effect for cultivating practice.",
        "source": "T33n1717_002:0827a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明引文意中「所以引二文」等者，序及流通。",
        "translation": "The next explanation of the meaning of the quoted text, such as \"so quoting two texts,\" is the introduction and the circulation.",
        "source": "T33n1717_002:0827a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中又二：先正明引用所以，次明不引所以。",
        "translation": "There are two more: the first correctly explains the reason for citing them, and the second explains the reason for not citing them.",
        "source": "T33n1717_002:0827a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初二文之中引其要意，燈明佛事謝在過去其事已定，故文殊引來釋彌勒之疑。",
        "translation": "In the first two passages, the main idea is cited because the Buddha's ministry was acknowledged to have been determined in the past, so Mañjuśrī cites it to explain Maitreya's doubts.",
        "source": "T33n1717_002:0827a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今釋迦佛說本迹竟，總撮樞要付諸菩薩。",
        "translation": "Now, after Śākyamuni Buddha had finished speaking about his past lives, he summarized the essentials and handed them over to the bodhisattvas.",
        "source": "T33n1717_002:0827a06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「中間」下明不引意，又二：初正明不引之意，次「若引者」下釋疑。",
        "translation": "Next, there are two explanations of the meaning of not citing under \"in between,\" the first correctly explaining the meaning of not citing, and the second explaining the doubt under \"if you cite.\"",
        "source": "T33n1717_002:0827a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文者，當機廣說一部之文，居於序及流通之中，故云「中間」。",
        "translation": "The first is a text that's explained in detail at the appropriate time, and it's placed in the middle of the introduction and circulation, so it's called \"in between.\"",
        "source": "T33n1717_002:0827a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡有所說，豈過能詮名及所詮體，并依體起用耶？",
        "translation": "Whenever something is explained, is it more than the name that can be explained and the essence that is explained, and it relies on the essence to produce an effect?",
        "source": "T33n1717_002:0827a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故不俟引之。",
        "translation": "Therefore, it's unnecessary to cite it.",
        "source": "T33n1717_002:0827a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋疑者，恐人疑云：廣說雖爾，豈無略要？",
        "translation": "The next explanation of doubt lest anyone doubt, \"Even though it's explained in detail, isn't there a summary?",
        "source": "T33n1717_002:0827a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故引顯實四一而為釋之。",
        "translation": "Therefore, it's explained by citing the four real ones.",
        "source": "T33n1717_002:0827a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先引，次釋。",
        "translation": "First, it's cited, and then it's explained.",
        "source": "T33n1717_002:0827a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中云言「大事」者，諸佛出世本在開權，故名妙法，佛所知見即是體也。",
        "translation": "The explanation says, \"great matter\" because the buddhas originally appeared in the world at the opening of rights, so it's called the marvelous Dharma, and what the Buddha knows and sees is the essence.",
        "source": "T33n1717_002:0827a13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開示等四，疏文四釋，今且用約位一釋，開即十住，真因也；入即十地，真果也。",
        "translation": "There are four ways to reveal and so forth, which are explained in the commentary, but now we'll explain them in terms of one stage, namely, initiation, which is the ten abodes, and entry, which is the ten stages, which is the true result.",
        "source": "T33n1717_002:0827a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又開等四位，真因也；直至道場，真果也。",
        "translation": "The four stages of initiation and so forth are the true cause and the true result of reaching the site of enlightenment.",
        "source": "T33n1717_002:0827a17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為令眾生至七方便，非今經用；開佛知見方屬今經。",
        "translation": "If it's for the sake of bringing sentient beings to the seven skillful means, it's not for the present sūtra; only when the Buddha's vision is revealed does it belong to the present sūtra.",
        "source": "T33n1717_002:0827a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又「為大事因緣故證名」者，上文「無數方便、種種因緣」是權，「是法非思量分別之所能知」是實。",
        "translation": "The words \"to realize the name because of the great causes and conditions\" mean that the above phrase \"countless skillful means and various causes and conditions\" is provisional, and \"this is a teaching that can't be known by discriminating\" is real.",
        "source": "T33n1717_002:0827a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「所以者何」去，釋云「諸佛世尊唯以一大事因緣故出現於世」，故知出世本意意在佛乘，佛乘方得名為大事，當知佛乘秖是妙法，故可證名。",
        "translation": "Next, under \"Why is that?\", the explanation says, \"The world-honored buddhas appear in the world only because of one great cause,\" so it's clear that the original intention of appearing in the world is the Buddha vehicle, and only then can the Buddha vehicle be called a great cause.",
        "source": "T33n1717_002:0827a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次又釋云「云何名為至佛之知見？」",
        "translation": "Next, he explains, \"What is called the ultimate Buddha's insight?\"",
        "source": "T33n1717_002:0827a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知大事是能詮名，佛所知見即是實相，證理明矣。",
        "translation": "You should know that the great matter is a name that can be interpreted, and the Buddha's view of what is known is the true character, which clearly demonstrates the principle.",
        "source": "T33n1717_002:0827a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取能知見開示悟入，始從初住終至後心，證宗甚便。",
        "translation": "Taking the view that enables knowing and reveals awakening and entry, beginning with the first abode and ending with the mind at the end, this is a very convenient way to actualize the teaching.",
        "source": "T33n1717_002:0827a26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引〈藥王〉中為二：初正引證，次「引諸」下以四例教。",
        "translation": "The second quote from The Medicine King consists of two: the first correctly introduces the realization, and the second \"introduces them\" with four examples of the teaching.",
        "source": "T33n1717_002:0827a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文二：先引、次釋。",
        "translation": "The first two are introductory and second are explanations.",
        "source": "T33n1717_002:0827a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初又二：先總舉數去取，次列。",
        "translation": "The first is composed of two parts: first, a general list of the various things to be considered, and then a list.",
        "source": "T33n1717_002:0827a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文者，〈藥王品〉佛為宿王華說十喻，今但引六者，餘四望六猶成分喻，是故合四在此六中。",
        "translation": "In the first, the Yakṣa King Chapter says that the Buddha spoke ten parables for the Constellation King Flower, but he only cites six of them now because the other four seem to be just like component parables, so he combines the four in these six.",
        "source": "T33n1717_002:0827b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "What are they?",
        "source": "T33n1717_002:0827b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以輪王釋王，不及梵王，故合入梵王喻中；五佛子及菩薩不及於佛，故合在法王喻中。",
        "translation": "Because the wheel-turning king and the Śākyamuni king aren't as good as the Brahmā king, they're included in the Brahmā king metaphor; the five sons of the Buddha and the bodhisattvas aren't as good as the Buddha, so they're included in the Dharma king metaphor.",
        "source": "T33n1717_002:0827b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次列中，經中一一皆云此《法華經》，故知歎教。",
        "translation": "In the next list, each of these is mentioned in the sūtras as being from the Lotus Sutra, so it's known as the praise and admiration teaching.",
        "source": "T33n1717_002:0827b05_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此列文略出名耳。",
        "translation": "This list of texts is now briefly referred to as the famous one.",
        "source": "T33n1717_002:0827b06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋中一一文，皆先舉譬，次釋譬。",
        "translation": "In the next explanation, each text first cites an example and then explains the explanation.",
        "source": "T33n1717_002:0827b07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經中譬文廣、合文略，但云法華亦爾最大最上最明等耳。",
        "translation": "In the sūtras, the explanations are broad and the combined text is brief, except for the claim that the Lotus is also the greatest, most excellent, and most luminous.",
        "source": "T33n1717_002:0827b07_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今出譬則略、合文稍廣，準經望之可以意得。",
        "translation": "Now, the metaphors are presented briefly, and the combined text is slightly broader, so you can get the idea by looking at the sūtras.",
        "source": "T33n1717_002:0827b09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海言德者，德者得也，得眾水故。",
        "translation": "\"He who speaks of virtue in the ocean, 'virtue' means to obtain, because it obtains many rivers.",
        "source": "T33n1717_002:0827b10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "萬善合萬流，佛乘合一鹹，不合江河川流流通三處，應云三教各有所歸而不及法華也。",
        "translation": "All goodness combines with myriad streams, and the Buddha vehicle combines with salt, so it doesn't fit into the three places where rivers and streams flow, so it should be said that each of the three teachings has something to return to but not as much as the Lotus.",
        "source": "T33n1717_002:0827b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次山譬者，經中具列土山黑山小大鐵圍及十寶山，以比須彌。",
        "translation": "Second, the sūtra lists Mount Sumeru as an earthen mountain, the Black Mountain, the Small and Great Iron Walls, and the Ten Treasures.",
        "source": "T33n1717_002:0827b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今文略無，但云四寶者，從所比說，餘山並無四寶故也。",
        "translation": "The present text omits them but refers to the four treasures because the other mountains don't have the four treasures according to the comparison.",
        "source": "T33n1717_002:0827b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天居四寶頂如醍醐在四味上，反以四寶譬四誹謗，天居其上如教離謗也。",
        "translation": "The gods live on top of the four treasures like ghee on top of the four flavors, but they use the metaphor of the four treasures to describe the four denigrations, and the gods live on top of them like they're taught to be free of denigrations.",
        "source": "T33n1717_002:0827b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四謗如前《金剛藏》意。",
        "translation": "The four denigrations are as explained in the preceding Jingangzang.",
        "source": "T33n1717_002:0827b17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又更却以四寶譬位，一根緣等以譬諸天，諸天不離四寶山故。",
        "translation": "Furthermore, he uses the four treasures to simulate stages and a single condition to simulate the gods, since the gods aren't free of the four jeweled mountains.",
        "source": "T33n1717_002:0827b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若盡消經者，應以土等四山如四味，須彌在十山之內而最高，如佛界在十界之內而最勝。",
        "translation": "If we exhaust the sutra, we should use the four mountains of earth and so forth as the four flavors, and Sumeru is the tallest within the ten mountains, just as the Buddha realm is the most prominent within the ten realms.",
        "source": "T33n1717_002:0827b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次月譬者，實如盈、權如虧，同體權實如月輪無缺，會漸入頓如月明相漸圓。",
        "translation": "The next metaphor is that of the moon, which is real as full and provisional as deficient, and which has the same essence and provisional reality as the moon's flawlessness and will gradually enter into suddenness like the moon's waxing and waning phase.",
        "source": "T33n1717_002:0827b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知前標教相中云「是漸頓」者，與月譬意同。",
        "translation": "Therefore, you know that the preceding statement \"this is gradual and sudden\" means the same thing as the moon metaphor.",
        "source": "T33n1717_002:0827b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經中以星比月天子，雖舉天子，經合既云此法華經最為照明，故今但取圓亦兼以明為譬。",
        "translation": "Although the sūtras compare the stars to the moon and the celestials, the sūtras together say that the Lotus Sutra is the most illuminating, so now we'll just take the metaphor of perfection and use light as well.",
        "source": "T33n1717_002:0827b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次日譬中復加燈炬星，今合日譬中但云破化城故，但取日明能映諸明故耳。",
        "translation": "In the next sun metaphor, the star of the lamp and torch is also added, but now it's combined with the sun metaphor because it's called the destruction of the city of transformation and because the sun's brightness can reflect all the brightness.",
        "source": "T33n1717_002:0827b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若更合者，亦可以燈等四，譬二乘及通別菩薩，並與無明共住故也。",
        "translation": "If we further combine them, we can also use the four metaphors of a lamp and so forth to refer to the two vehicles and the bodhisattvas with special abilities who dwell together with ignorance.",
        "source": "T33n1717_002:0827b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故次重引中略舉星月而除方便，故知方便所收復廣。",
        "translation": "Therefore, the next reintroduction briefly mentions the stars and moon in addition to the method, so it's clear that what's included in the method is furthermore extensive.",
        "source": "T33n1717_002:0827c01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次梵王譬中，經云「如梵王為一切眾生之父」，今亦能生一切諸教故也。",
        "translation": "Next, in the Brahmā metaphor, the sūtra says, \"Just as the Brahmā king is the father of all sentient beings,\" so now he can give rise to all teachings.",
        "source": "T33n1717_002:0827c02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今文但云自在者，以對簡二王非自在故耳。",
        "translation": "The reason it's only called 'self-perfected' is because it's not self-perfected when compared to the two profound kings.",
        "source": "T33n1717_002:0827c04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輪王地居如俗，釋王居天如真，梵於三界如中，若真俗自在、中未必自在，若中自在、真俗必自在，故以今經譬於梵王。",
        "translation": "The wheel-turning king lives on earth as mundane, the Śākyamuni king lives in heaven as true, and Brahmā is in the three realms as middle, so if true and mundane are self-perfected, middle may not be self-perfected, and if middle is self-perfected, true and mundane will be self-perfected, so we use this sūtra as an analogy for the Brahma king.",
        "source": "T33n1717_002:0827c05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文中便簡歷別中道亦非自在，且約教道，故知梵王兼譬二中，今譬圓融故云「最」也。",
        "translation": "The text then briefly describes how the middle way is not self-contained, and it's also about the path of teaching, so it's clear that Brahmā is a metaphor for both the middle and the middle, and the present metaphor is a perfect blend.",
        "source": "T33n1717_002:0827c08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次法王譬中五佛子，經文自列四果支佛，此等所說不及佛故。",
        "translation": "Next, in the Dharma king's example, there are five children of the Buddha, but the sūtras themselves list four fruit-branching buddhas, so what's explained here isn't as good as the Buddha.",
        "source": "T33n1717_002:0827c10_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次例又二：先例四可見，次「非但」下結。",
        "translation": "There are two further examples: the first is a clear example of the four, and the second is a conclusion under \"not only.\"",
        "source": "T33n1717_002:0827c11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三生起中為五：初釋名，次明生起意，三「肇師」下正明生起，次「神力」下明生起所依不同，五「今之」下正明能依所從。",
        "translation": "Of the three kinds of arising, there are five: first, an explanation of the name, second, an explanation of the meaning of arising, third, a correct explanation of arising under \"Zhaoshi,\" second, an explanation of the different bases of arising under \"Shenli,\" and fifth, a correct explanation of the able bases and subordinates under \"Now.\"",
        "source": "T33n1717_002:0827c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初如文。",
        "translation": "The first is as explained above.",
        "source": "T33n1717_002:0827c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次言「麁細」者，明五章次第也。",
        "translation": "The next word, \"crude and fine,\" explains the order of the five chapters.",
        "source": "T33n1717_002:0827c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡生起者，或從麁至細，或從細至麁，但使不亂皆名生起。",
        "translation": "Whatever arises, either from the crude to the fine or from the fine to the crude, but nothing is allowed to disrupt it, it's called arising.",
        "source": "T33n1717_002:0827c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今之五章是從麁至細，能詮之名於中最麁，是故居首。",
        "translation": "The five chapters now range from the crude to the subtle, and the name that can be explained is the crudest of these, so it takes the lead.",
        "source": "T33n1717_002:0827c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所詮之體次細於名，是故居次。",
        "translation": "The essence of what's explained is inferior to the names, and so it comes second.",
        "source": "T33n1717_002:0827c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "體但是理，取理之行莫過因果，是故居次。",
        "translation": "The essence is only principle, and the practice of grasping principle is no better than cause and effect; therefore, it takes second place.",
        "source": "T33n1717_002:0827c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因果之宗雖細於理，自行因果猶是總略，用是益他，兼於權實，逗會眾生久遠根性，故細於宗，教相既是分別前四，故細於四，所以居後。",
        "translation": "Although the principle of cause and effect is subtle in principle, its own cause and effect are still general in nature, beneficial to others, combined with expedient and real, and teasing sentient beings about their long-standing capacities, so it's subtle in principle, and the characteristics of the teaching are discriminated from the first four, so it's subtle from the fourth, which is why it comes last.",
        "source": "T33n1717_002:0827c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則展轉遞為生起。",
        "translation": "This is called birth and arising in a series of transitions.",
        "source": "T33n1717_002:0827c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三正明生起者，既言展轉，名既居初復從何生？",
        "translation": "Third, it's correctly explained that since it's called successive, where does it come from since it's called the beginning?",
        "source": "T33n1717_002:0827c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則名從理出。",
        "translation": "Then names arise from principles.",
        "source": "T33n1717_002:0827c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初引肇公意者，法本無名、名假無實，故云「名無召物之功」，物體性空、無應假名之實，名實俱無但真諦意耳。",
        "translation": "The first quote from Zhaogong's comment is that dharmas are originally without names and names are nominal without substance, so it's said that \"names don't have the power to summon things,\" that the nature of things is empty, and there's no reality that should be nominally named.",
        "source": "T33n1717_002:0827c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今論世諦，故須辨名。",
        "translation": "In this discussion of the conventional truth, it's therefore necessary to identify names.",
        "source": "T33n1717_002:0827c28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理雖無名假名顯實，是故須立妙法之名，以顯本迹妙法之實。",
        "translation": "Although principles lack names, nominal names reveal their reality; therefore, it's necessary to create the names of marvelous things to reveal the reality of the original and marvelous things.",
        "source": "T33n1717_002:0827c29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：名既依理，理復依誰？",
        "translation": "Q: After relying on principles for names, who do principles rely on?",
        "source": "T33n1717_002:0828a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：理性無體全依無明，無明無體全依法性，理遍一切而無所依，是則名之與體互為因依，名即是體，文字解脫、色為法界等(云云)。",
        "translation": "Answer: \"Reason has no essence and entirely depends on ignorance, ignorance has no essence and entirely depends on the nature of the Dharma, and principle pervades everything without any basis.",
        "source": "T33n1717_002:0828a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四所依中三謂神力等，言約教及行者，但以用居第二第四為異耳，餘次第同。",
        "translation": "Of the four bases, three are spiritual powers and so forth, and those who refer to the teaching and practice in general are different in that their function is the second and fourth, but the rest are in the same order.",
        "source": "T33n1717_002:0828a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然約教中以妙法為在纏之法，故云「欲說此法」。",
        "translation": "However, in terms of the teaching, the marvelous Dharma is the Dharma that's in bondage, so it's called \"wanting to explain this Dharma.\"",
        "source": "T33n1717_002:0828a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若約行中以妙法為能詮之名，故云「聞名故推理」。",
        "translation": "If we consider the practice of the wondrous Dharma as the name by which it can be explained, it's called \"hearing the name and therefore reasoning about it.\"",
        "source": "T33n1717_002:0828a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖譚經玄義，而前四章屬行，故且從行說。",
        "translation": "Although the profound meaning of the sūtras is described, the first four chapters belong to practice, so we'll discuss them from the perspective of practice.",
        "source": "T33n1717_002:0828a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若教若行俱須判教方顯妙旨，故教行二途並判教居後。",
        "translation": "Whether it's the teaching or the practice, it's necessary to judge the teaching in order to reveal the marvelous meaning, so the two paths of teaching and practice are judged together, with the teaching taking the back seat.",
        "source": "T33n1717_002:0828a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教行並以體前而宗後者，若說若行並須先知體而方辨因果故也。",
        "translation": "The reason why the doctrine and practice are described in terms of essence before and doctrine after is because both the teaching and practice must be explained in terms of essence before the cause and effect can be discerned.",
        "source": "T33n1717_002:0828a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開示亦約行，準序可知。",
        "translation": "To reveal also refers to practice, which is understandable given the precise order.",
        "source": "T33n1717_002:0828a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不開權，妙名不立，餘如文。",
        "translation": "If it doesn't reveal the provisional, the subtle name won't be established, and the rest is as explained in the text.",
        "source": "T33n1717_002:0828a13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以〈神力品〉已去判前引證各有所以，〈神力〉約教故先名、次用、次體、次宗；〈序品〉約行，故如文中所立次第。",
        "translation": "Therefore, since the Śrīgupta Chapter has already been translated into the previous passage, there's a reason why the Śrīgupta Chapter focuses on the teaching, so it starts with the name, then the application, then the essence, then the doctrine; the Preface Chapter focuses on the practice, so it's in the order established in the text.",
        "source": "T33n1717_002:0828a14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又更重引開示悟入助成〈序品〉。",
        "translation": "Again, the preface to the chapter on enlightenment is a reintroduction.",
        "source": "T33n1717_002:0828a16_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下去凡言「云云」者，如《止觀》第一記中。",
        "translation": "Whatever is mentioned below as \"so many,\" it's as in the first entry of Zhiguan.",
        "source": "T33n1717_002:0828a17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次開合中為四：先標，次明開合意，三「凡三」下列，四「初釋」下釋。",
        "translation": "There are four subsections in the next section: the first labels, the second explains the meaning of the section, the third follows \"where there are three,\" and the fourth follows \"the first explanation.\"",
        "source": "T33n1717_002:0828a18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中文自為三：初「五種」者，始從事理終至說默，秖是自行化他之事理耳。",
        "translation": "There are three explanations of the Chinese: the first \"five kinds\" begins with phenomena and principles and ends with silence, which are phenomena and principles that begin with self-reliance and teach others.",
        "source": "T33n1717_002:0828a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然五章玄義亦不出自他事理，今更以此事理等五雙橫判五章，以一一雙皆攝五章故也。",
        "translation": "However, the profound meaning of the five chapters doesn't come from other matters and principles, so we'll now judge the five chapters horizontally according to these five matters and principles, because each of them contains five chapters.",
        "source": "T33n1717_002:0828a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖自他事理稍同，而一一章則不攝五雙，故知法相文義各別；雖並攝五章，而五雙生起次第宛別，由有事理故有教行，由教行為因故感於果，由因果滿故能化他，由他機異故宜說宜默。",
        "translation": "Although the principles and matters of self and other are slightly the same, each chapter doesn't contain five pairs, so it's clear that the texts and meanings of the teachings are distinct; although the five chapters are collected together, the five pairs arise in a sequence that's distinct, because there are principles and matters, there are teachings and practices, because the teachings and practices are the cause, the result is brought about, because the cause and result are complete, it's possible to teach others, and because the abilities of others are different, it's appropriate to speak and be silent.",
        "source": "T33n1717_002:0828a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而釋名恒通教相分別，體遍無遍，秪由宗用對五雙殊，因茲成異。",
        "translation": "The explanation of the name is based on the constant discrimination of doctrinal aspects, which are pervasive and non-pervasive in essence because of the distinction between the five categories and the five applications, which make them different.",
        "source": "T33n1717_002:0828a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十種者，謂道、識、性、般若、菩提、大乘、身、涅槃、三寶、德，如下三法妙中釋。",
        "translation": "The ten kinds are the path, consciousness, nature, prajñā, bodhi, great vehicle, body, nirvāṇa, three treasures, and virtue, as explained in the following three marvels of the Dharma.",
        "source": "T33n1717_002:0828a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若以蓮華喻三軌者，蓮譬真性，華譬觀照，鬚譬資成，乃至九三，例應可見。",
        "translation": "If he uses the lotus metaphor to describe the three ways, the lotus metaphor is true nature, the flower metaphor is contemplation, the beard metaphor is completion, and the nine or three examples should be seen.",
        "source": "T33n1717_002:0828b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾，前五雙中，釋名總於五雙，當知亦可以蓮華鬚三對彼體等一一釋之，可見。",
        "translation": "If that's the case, then the explanation of the names of the previous five pairs is summarized in five pairs, and it should be clear that they can also be explained one by one, such as the lotus-flower-whiskers triad against their essence.",
        "source": "T33n1717_002:0828b04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次料簡中合十二重問答，初三重料簡名，次一重料簡體，次一重料簡宗，次五重宗用對簡，次二重都簡五章。",
        "translation": "In the second section, there are twelve questions and answers, the first three of which are about the names of the skandhas, the next one about the essence of the skandhas, the next one about the tenets of the skandhas, the next five about the contrastive nature of the tenets, and the next two about the five chapters of the duo's skandhas.",
        "source": "T33n1717_002:0828b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初問意者，為實施權，權不離實，乃至開權顯實，實不離權；廢權顯實，權若廢已，權實不二，豈不墮因中有果耶？",
        "translation": "The first question is, \"In order to implement provisional, provisional doesn't separate from real, and even to reveal the real by revealing the provisional, the real doesn't separate from the provisional; if the provisional is abolished and the real is revealed, then the provisional and real aren't two, so wouldn't they fall into the category of cause and effect?",
        "source": "T33n1717_002:0828b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，因果名同，時異教異。",
        "translation": "The answer is that cause and effect are called the same, but the time is different and the teaching is different.",
        "source": "T33n1717_002:0828b11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外人因果既為初教所破，尚非三藏麁因麁果，況復通別？",
        "translation": "Since the causes and effects of outsiders are rejected by the early teaching, they are not yet the crude causes and crude effects of the Tripiṭaka, so how could they be shared with each other?",
        "source": "T33n1717_002:0828b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況妙因果耶？",
        "translation": "What is the true state of subtle cause and effect?",
        "source": "T33n1717_002:0828b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新舊醫如餘文說。",
        "translation": "The new and old doctors are as explained in the rest of the text.",
        "source": "T33n1717_002:0828b13_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次問者，此問依前答生，前答妙因妙果因果俱時，華果體即，小乘屬權，權亦即實；菴城亦小，何不即耶？",
        "translation": "The next question is, according to the previous answer, when the cause and effect are both wonderful and miraculous, the flower and effect are the same in essence, the lesser vehicle is provisional, and the provisional also means the real; since An Cheng is also small, why isn't it the same?",
        "source": "T33n1717_002:0828b14_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若破菴城則無華唯蓮，破權方實即義安在？",
        "translation": "If we destroy the city of amplitude, then there are no flowers but lotuses, and if we destroy the provisional, then where is the real meaning?",
        "source": "T33n1717_002:0828b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答「小乘是化他」乃至「喻耳」者，且約初說小隔於大，是故云破，以大破之，故云「須破」。",
        "translation": "The answer, \"The lesser vehicle teaches others,\" and even the phrase \"metaphorically speaking,\" refers to the fact that the lesser is separated from the greater, which is why it's called refutation, and it's called \"refutation\" because it refutes the greater.",
        "source": "T33n1717_002:0828b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行即是體內之權故以華喻，然化他之權據佛本意並屬自行。",
        "translation": "While the right to practice oneself is the right to be endowed with the essence, the right to teach others is, according to the Buddha's original intention, part of the right to practice oneself.",
        "source": "T33n1717_002:0828b19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又初約施權故屬化他，今論開權故屬自行，施開被緣其理不二。",
        "translation": "In the beginning, it was the right to bestow that belonged to transforming others, and now it's the right to reveal that belongs to self, for which the principle of bestowing and being conditioned is not two.",
        "source": "T33n1717_002:0828b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七譬者，一火宅、二窮子、三藥草、四化城、五繫珠、六頂珠、七醫子，須以七譬各對蓮華權實之義，方得顯於總別意耳。",
        "translation": "The seven metaphors - one for a burning house, two for a poor child, three for medicinal plants, four for a city of transformation, five for a pearl tied to a hair, six for a pearl on the head, and seven for a healing child - each must be used to describe the true meaning of the lotus' provisional power before the general and specific intent can be expressed.",
        "source": "T33n1717_002:0828b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "What's the point?",
        "source": "T33n1717_002:0828b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓮華秖是為實施權、開權顯實，七譬皆然，故得名別。",
        "translation": "The lotus has begun to bestow power and reveal the truth for the sake of the truth, as is the case with all seven metaphors, which is why they're called distinct.",
        "source": "T33n1717_002:0828b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如譬喻中，初設三車是施權，後賜大車是顯實。",
        "translation": "In the parable, the first setting up of three chariots is the right to bestow, and the giving of a large chariot later is the manifestation of the real.",
        "source": "T33n1717_002:0828b26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "窮子中，雇作已前是施權，體業已後是顯實。",
        "translation": "Among the poor sons, the first is the right to bestow after hiring, and the second is the manifestation of the truth after the physical act.",
        "source": "T33n1717_002:0828b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥草中，三草二木是施權，一地一雨是顯實。",
        "translation": "Among medicinal herbs, three herbs and two trees are the right to bestow, and one ground and one rainfall are the manifestation of the truth.",
        "source": "T33n1717_002:0828b28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化城中，為疲設化是施權，引至寶所是顯實。",
        "translation": "Among the magical cities, setting up a transformation for the weary is a charitable right, and leading them to a place of treasure is a manifestation of the truth.",
        "source": "T33n1717_002:0828b29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫珠中，得少為足是稟權，後示衣珠是顯實。",
        "translation": "Among the tied-up beads, obtaining a small amount is a claim, and subsequently showing the robe and pearl is a manifestation of the truth.",
        "source": "T33n1717_002:0828b30_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頂珠中，隨功賞賜是施權，解髻與珠是顯實。",
        "translation": "Among the pearls on the head, bestowing rewards according to merit is the right to bestow, and unfastening the topknot and the pearls is the manifestation of the truth.",
        "source": "T33n1717_002:0828c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "醫子中，非生現生、非滅現滅，各有形聲權實二益，生滅迹也，非生非滅本也。",
        "translation": "Among the healing seeds, what's not produced is manifested as production, what's not ceased is manifested as cessation, and each has the benefit of both form and sound, right and substance, which are the manifestation of production and cessation and the original of what's not produced and not ceased.",
        "source": "T33n1717_002:0828c02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故前六約迹、後一約本，故知蓮華總譬本迹權實，本迹同異之相具如後簡，故知但語蓮華則兼別矣。",
        "translation": "Therefore, the first six refer to the manifestation and the last to the original, so you know that the lotus generally metaphorizes the original, manifestation, expedient, and real, and the similarities and differences between the original and manifestation are as outlined later, so you know that it's both distinct when you just say lotus.",
        "source": "T33n1717_002:0828c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次問體者，此問準文及理為問，一切諸法皆是法界無非實相，則諸法皆體，何意簡權？",
        "translation": "The next question is about substance, which asks, in light of the text and principle, whether all dharmas are the real characteristics of the Dharma realm and nothing but the real characteristics, then all dharmas are substances, so why do you mean to simplify the provisional?",
        "source": "T33n1717_002:0828c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，若為實施權未識經體，開權顯實實如所問。",
        "translation": "Those who answered this question meant that if they hadn't realized the essence of the sūtra in order to implement the provisional, the provisional would reveal the real as it really is.",
        "source": "T33n1717_002:0828c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「廢權顯實如前所用」者，謂約廢說則簡權取實，以為經體。",
        "translation": "The phrase \"abrogating the provisional and revealing the real as used previously\" means that by abrogating the teaching, the provisional is summarized and the real is taken as the body of the sūtra.",
        "source": "T33n1717_002:0828c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T33n1717_002:0828c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廢已無權，簡於為實施權之權，如前標體中簡於自行化他及化他體，故云「如前所用」。",
        "translation": "After abolishing right, it's simply the right to carry out right, as in the previous title, which is simply the right to practice oneself and teach others and the right to teach others, so it's called \"as used previously.\"",
        "source": "T33n1717_002:0828c11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次問宗者，宗猶尊也主也。",
        "translation": "The next question is, 'School': school is like an honor and a lord.",
        "source": "T33n1717_002:0828c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如國無二王，何以用二法為宗耶？",
        "translation": "If a country doesn't have two kings, how could it use two things as a doctrine?",
        "source": "T33n1717_002:0828c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，因果雖二而不二也。",
        "translation": "The answer is that although cause and effect are two, they aren't two.",
        "source": "T33n1717_002:0828c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以單因單果不獨成故，有果可取因為果因，果若有因果為因果。",
        "translation": "It's because a single cause and a single effect aren't independently formed, so there's an effect that's desirable as a cause of the effect, and if the effect has a cause, the result is the cause and effect.",
        "source": "T33n1717_002:0828c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知能辦藉所為期、所辦藉能而顯，如臣辦王事、王能理臣，君臣相藉共經一國，異類為譬其理亦成。",
        "translation": "Therefore, it's known that the effect is sustained by the agent and manifested by the agent, just as a minister conducts the king's business and the king can manage his ministers, and the ruler and ministers work together through the same kingdom by using each other, so the principle is accomplished even when different kinds of metaphors are used.",
        "source": "T33n1717_002:0828c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況下文日月綱天等譬，文意可知。",
        "translation": "Furthermore, the following metaphors of the sun and moon outlining the heavens make the meaning of the text clear.",
        "source": "T33n1717_002:0828c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又引本迹文證，具如下引。",
        "translation": "It's also evidenced by the text of the original traces, as quoted below.",
        "source": "T33n1717_002:0828c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「問論宗」去以用難宗，「論」字平聲。",
        "translation": "\"The school of inquiry and discussion removes the use of the difficult school, and the word 'discussion' is used in a flat voice.",
        "source": "T33n1717_002:0828c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論宗既取自行，論用何故俱取自他？",
        "translation": "Since the thesis takes self as its own, why does the application of the thesis take both self and other?",
        "source": "T33n1717_002:0828c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答如文。",
        "translation": "The answer is as explained.",
        "source": "T33n1717_002:0828c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此下諸問對簡者，正為簡用兼為顯宗。",
        "translation": "The following questions are intended to be brief, precisely because they briefly use and reveal the thesis.",
        "source": "T33n1717_002:0828c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「問用是化他」等者，牒答重徵，宗是自行，既不取化他，用是益他，應簡自行。",
        "translation": "\"Those who say, 'Use is to teach others' and so forth, are simply answering the question by repeating the qualification that the thesis is self, and since it doesn't focus on teaching others and use is to benefit others, it should be shortened to self.",
        "source": "T33n1717_002:0828c24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答中意者，若自破惑但用實道，名為自用，自必簡他。",
        "translation": "The answer's point is that if someone breaks their own mental disturbances but uses the true path, that's called self-application, and they must simplify it for others.",
        "source": "T33n1717_002:0828c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若破他惑，他宜用大亦名為用，是故化他不可純小，是故亦用自行權實，若用於實，即以此實自利利他。",
        "translation": "If it destroys the afflictions of others, it's appropriate for others to use the greater path, which is also called using it; therefore, teaching others can't be purely minor; therefore, it's also using its own expedient and real, and if it's used in the real, it's this real that benefits itself and others.",
        "source": "T33n1717_002:0828c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「並」意者，宗是因果，亦可示他名化他，宗亦應俱取化他因果自利利他，何故簡他唯取於自？",
        "translation": "The second \"parallel\" idea is that while the subject is cause and effect, it can also be shown to be called transforming others, and the subject should be taken to be both the cause and effect of transforming others for their own benefit and for the benefit of others, so why is the simplification of others taken only from the self?",
        "source": "T33n1717_002:0829a01_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，化他因果非一乘宗，是故不取。",
        "translation": "Those who answer this question mean that the teaching of the causes and effects of transforming others isn't the One Vehicle school, so they don't take it.",
        "source": "T33n1717_002:0829a03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "並意者，因果屬宗，何不亦以化他因果，共為經宗而利於他？",
        "translation": "He also asked, \"Since the principle of cause and effect belongs to the principle, why don't we also use the principle of the transformation of other causes and effects as a shared principle of the sūtras for the benefit of others?",
        "source": "T33n1717_002:0829a04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，宗屬自行唯求佛果，尚不取自行化他，況以化他因果而自行耶？",
        "translation": "The answer is, if a Buddhist who follows the tenets of the school seeks only the Buddha's fruition on his own, and doesn't yet seek to convert others on his own, how can he convert others as a result of the causes and effects on his own?",
        "source": "T33n1717_002:0829a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以化他邊即屬用故。",
        "translation": "It's because the aspect of teaching others is function.",
        "source": "T33n1717_002:0829a07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「並」者，用中亦不應俱取？",
        "translation": "What about the second \"concurrent\" part, which should not be taken together with the applied part?",
        "source": "T33n1717_002:0829a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意者，化他漸誘，事不獲已，是故取之。",
        "translation": "He answers this question because it's a gradual enticement to teach others and because it doesn't obtain the task.",
        "source": "T33n1717_002:0829a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「問宗用俱明智斷」等者，正由向文或以宗難用、或以用難宗，恐法雜亂，故須此問。",
        "translation": "The question, \"Are both the teaching and the application wisely eliminated\" and so forth, is necessary precisely because the previous passage sometimes suggested that the teaching was difficult for the application and sometimes suggested that the application was difficult for the teaching, lest the teaching become confusing.",
        "source": "T33n1717_002:0829a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宗是自行，用是化他，各有智斷，為同異耶？",
        "translation": "'Is it the same or different that the thesis is to help oneself and the application is to teach others, and that each is wisely eliminated?'",
        "source": "T33n1717_002:0829a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此文正問宗用智斷，然下答中於自於他各有智斷，宗是自行，用是化他故也。",
        "translation": "This text asks precisely about the cognition and elimination of doctrine and application, but the following answer contains the cognition and elimination of self and other, since doctrine is to help oneself and application is to teach others.",
        "source": "T33n1717_002:0829a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故以宗用釋於自他智斷不同，得名各別。",
        "translation": "Therefore, the difference between the cognition and cutting of self and others is explained by the fact that the doctrine and the function are different, which gives each a different name.",
        "source": "T33n1717_002:0829a14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前文既以自行為宗，化他為用，今此自他各有智斷，乃成自他各有宗用。",
        "translation": "Whereas the prior section used self as the subject and transforming others as the function, now that self and others have their own cognition and cutting, it becomes that self and others have their own subject and function.",
        "source": "T33n1717_002:0829a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宗雖有用，用屬於斷，此乃名為宗家之用。",
        "translation": "Although the tenet is useful, the function belongs to the elimination, and this is called the tenet's function.",
        "source": "T33n1717_002:0829a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「自他智斷俱為宗」者，自行以智德為宗，化他以斷德為宗。",
        "translation": "The phrase \"the doctrine of both self and others in terms of knowledge and elimination\" means that self is the doctrine of the virtue of knowledge, and transforming others is the doctrine of the virtue of elimination.",
        "source": "T33n1717_002:0829a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「化他智斷俱為用」者，以自望他智斷俱為智，以他望自智斷俱為斷，文從以他望自而說，是故單云「化他智斷俱為用」也。",
        "translation": "The phrase \"transforming others with wisdom and cutting off both as function\" refers to the fact that self-viewing others with wisdom and cutting off both as wisdom and others with self-viewing wisdom and cutting off both as cutting off, and the text is explained by viewing self with others, which is why it's simply called \"transforming others with wisdom and cutting off both as function.\"",
        "source": "T33n1717_002:0829a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次總料簡五章者，前是料簡四章已竟。",
        "translation": "The next section summarizes the five chapters, after the previous four chapters had been summarized.",
        "source": "T33n1717_002:0829a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初問答可見。",
        "translation": "The first one asks and answers questions, which can be seen.",
        "source": "T33n1717_002:0829a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從「問經經」去復似料簡教相，教相秖是分別四章，四章若異教相亦異，故云「經經各異」。",
        "translation": "From the \"question to the sūtras\" we also seem to be summarizing the shape of the teaching, which is first distinguished into four chapters, and if the four chapters are different, the shape of the teaching is also different, so it's called \"the sūtras and the sūtras are different.\"",
        "source": "T33n1717_002:0829a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以教對四即是料簡五章故也。",
        "translation": "The reason is that the four pairs of teachings are a summary of the five chapters.",
        "source": "T33n1717_002:0829a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若經經各立則名義俱別，故云得別失同；今名同義別，故云「得同不失別」。",
        "translation": "If the sūtras and sūtras were established separately, then their names would be distinct, so it would be said that they would be distinct and lose their identity; now, their names are the same, but their meanings are distinct, so it's said that they are the same and don't lose their identity.",
        "source": "T33n1717_002:0829a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀心者，初示用觀處，七番共解已釋五章，會異居後今所未論，故總將第六觀心一章以消前五，令一一文俱入觀門。",
        "translation": "This is called \"contemplation of mind,\" which first shows the place of using contemplation, and the sevenfold explanation of the five chapters together has already explained five chapters that have not been discussed since the meeting of the differences.",
        "source": "T33n1717_002:0829a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然須細釋令成妙觀。",
        "translation": "However, it must be explained in detail so that it becomes a marvelous contemplation.",
        "source": "T33n1717_002:0829b01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：若爾，何不以此觀心之文居於第七，以消前六？",
        "translation": "Q: If that's the case, why isn't this text on contemplating the mind placed in the seventh to eliminate the first six?",
        "source": "T33n1717_002:0829b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：會異文廣，故不越之。",
        "translation": "A: The summary of the text is extensive, so it doesn't go beyond it.",
        "source": "T33n1717_002:0829b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以會異文中自立起觀一門，則全悉檀體是於觀，不假附事而為理觀。",
        "translation": "Therefore, when the text of the assembly differs and establishes its own gate of initiating contemplation, then the whole entity of the perfection of giving is contemplation, and it's not contingent on phenomena but rather on the contemplation of principle.",
        "source": "T33n1717_002:0829b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依前文起自為五段，初約標章者，復為五章。",
        "translation": "Relying on the preceding paragraph, the arising of contemplation is divided into five paragraphs, and the first one is divided into five chapters.",
        "source": "T33n1717_002:0829b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初約標名中言「幻焰」者，幻焰之名通於偏圓，如二十五三昧中有如幻三昧，仍義通圓別，今從圓說一心三幻破一心三惑，理惑體一境智如如。",
        "translation": "The first one is called \"illusory flame\" because the name \"illusory flame\" refers to the partial and the perfect, just as among the twenty-five samādhis there's the concentration of Ruifan, which still refers to the perfect and the distinction, and now it's explained from the perfect that the three illusions of one mind break the three disturbances of one mind, and the essence of the principle of disturbance is the wisdom of the single object as it is.",
        "source": "T33n1717_002:0829b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「適言」下觀法，心性觀之但有名字，言有則一念都無，況有十界質像也；言無則復起三千慮想，況一界念慮耶？",
        "translation": "\"When they say it's there, then even a single thought is absent, so why would there be quality images of the ten elements? When they say it's not there, then another 3,000 thoughts arise, so why would there be thoughts of the one element?",
        "source": "T33n1717_002:0829b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可以此有無思故，則一念心中道冷然，故知心是妙也。",
        "translation": "Because it's not possible to think about this as existence or nonexistence, then the path in a single moment of thought is cool, so he knows that his mind is marvelous.",
        "source": "T33n1717_002:0829b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙即三千，三千即法，法故三軌，故云「可軌」。",
        "translation": "The marvelous is the 3,000, the 3,000 is the Dharma, and the Dharma therefore has three guidelines, so it's called \"guidelines that can be followed.\"",
        "source": "T33n1717_002:0829b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之心法非因非果，此舉因果所依之體。",
        "translation": "This mind and dharmas are not causes or effects, and this is the essence on which cause and effect are based.",
        "source": "T33n1717_002:0829b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「能如理觀」此語能取因果之觀，故得名為體家之宗。",
        "translation": "The phrase \"able to observe correctly\" takes the observation of cause and effect, which is why it's called the essence of the school.",
        "source": "T33n1717_002:0829b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用者但是宗體功能，因華果蓮可以意得，是故名中本含三義。",
        "translation": "Its use is merely the function of the essence of the school, and the cause, flower, and fruit can be mentally apprehended; therefore, the name originally contained three meanings.",
        "source": "T33n1717_002:0829b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「由一心」等者，研一剎那既成觀已，即以此觀復觀後心，後心成觀所復成能，後後相續名「教餘心」。",
        "translation": "\"From a single mind\" and so forth means that after studying a moment and observing it, that moment is used to further observe a subsequent mind, which becomes what's observed and then becomes what's possible, and the sequel is called the \"residual mind of the teaching.\"",
        "source": "T33n1717_002:0829b18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經是被下之教，故觀下惑名「經」。",
        "translation": "The sūtras are the teachings that are given below, so the mental disturbances below contemplation are called \"sūtras.\"",
        "source": "T33n1717_002:0829b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次別約體中「心本」等者，秖是實相雙非有無，雙非生滅，轉釋有無。",
        "translation": "Next, it's specifically about the essence of \"mind as it is\" and so forth that begins with the reality that neither is existence nor nonexistence, and neither is arising or ceasing, which explains existence or nonexistence in turn.",
        "source": "T33n1717_002:0829b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「初觀」下宗也。",
        "translation": "It's the subject under \"first contemplation.\"",
        "source": "T33n1717_002:0829b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以觀」下用也。",
        "translation": "It's also applied under \"by observing.\"",
        "source": "T33n1717_002:0829b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡覺之名不局於淺，不起之相意實在深，故得觀心為今經用。",
        "translation": "The term \"awakening to evil\" isn't limited to the superficial, but the meaning of the aspect of nonarising is really profound, so we can observe the mind for the present use of the sūtra.",
        "source": "T33n1717_002:0829b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「心數」下教相，教相分別，故云「同異」。",
        "translation": "Under \"mental factors,\" it's the aspect of the teaching, and the aspect of the teaching is discriminated, so it's called \"similar and different.\"",
        "source": "T33n1717_002:0829b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別此教無不會實，故云「而轉」。",
        "translation": "Discriminating the absence and nonexistence of reality in this teaching, it's called \"transforming.\"",
        "source": "T33n1717_002:0829b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引證五章。",
        "translation": "Next, he introduces five chapters of the Sutra of Realization.",
        "source": "T33n1717_002:0829b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不得率爾從近而解。",
        "translation": "They shouldn't be interpreted in a general way from the near future.",
        "source": "T33n1717_002:0829b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次約生起中「以心觀心」名也。",
        "translation": "Next, it's called \"observing mind with mind\" in the context of arising.",
        "source": "T33n1717_002:0829b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「境」體也。",
        "translation": "The term \"object\" refers to its essence.",
        "source": "T33n1717_002:0829b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「觀契」因也。",
        "translation": "It's also the cause of \"observing and understanding.\"",
        "source": "T33n1717_002:0829b28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「得脫」果也。",
        "translation": "The result of \"attaining liberation\" is also the result.",
        "source": "T33n1717_002:0829b28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此因果宗也。",
        "translation": "This is the principle of cause and effect.",
        "source": "T33n1717_002:0829b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令餘亦脫，用也。",
        "translation": "Causing the others to also be liberated is also its function.",
        "source": "T33n1717_002:0829b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「分別王數是教相」者，心既是妙，王數亦妙，妙而分別，故屬教相。",
        "translation": "\"Discriminating royal numbers is the aspect of the teaching\" means that since the mind is marvelous, the royal numbers are also marvelous, and since they're marvelous and discriminated, they belong to the aspect of the teaching.",
        "source": "T33n1717_002:0829b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次約開合中約十二緣，一念為總、別即三道者，即十界三道，以下文分別約十界故。",
        "translation": "Next, regarding the opening and closing, we'll consider the twelve conditions, with one thought being the general and the distinct being the three paths, which are the ten elements and three paths, and the following section discerns them with respect to the ten elements.",
        "source": "T33n1717_002:0829c02_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別文中言「教相兼於開合」者，秖此教相一文兼前開合，約分別邊名為教相，秖一生滅名之為合，離為十界名之為開。",
        "translation": "The statement in the discernment text that \"the character of the teaching is both opening and closing\" means that this text on the character of the teaching is both opening and closing, and it's called the character of the teaching in terms of the discernment of extremes, which is called closing once it's born and ceased, and opening when it's free of the ten realms.",
        "source": "T33n1717_002:0829c04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次料簡中不復料簡五章，但簡用觀之意，又為二：初約根性不同，次「又論」下理須具足。",
        "translation": "The second summary doesn't contain another summary of the five chapters, but rather a summary of the meaning of application and contemplation, which is divided into two: the first focuses on the differences in nature of the faculties, and the second discusses the need for completeness in principle under \"Also Treatise.\"",
        "source": "T33n1717_002:0829c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文中云「為信行人」等者，如樹一根開眾枝葉，於一實相開無量名；若為法行以身喻身，能喻所喻皆生觀解。",
        "translation": "In the first section, it says, \"For faithful practitioners,\" etc., like a tree with one leaf opening up many branches and leaves, and in a single reality opening up measureless names, if someone practicing for the Dharma uses the body as a metaphor for the body, both the metaphor and the metaphor will give rise to contemplation and understanding.",
        "source": "T33n1717_002:0829c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次文又四：先引三論，次引兩經，三「何者」下責失，四「若欲」下示得。",
        "translation": "The next section contains four more: the first cites the three treatises, the second cites two sūtras, the third rebukes mistakes under \"Why?\", and the fourth shows attainments under \"If I want to.\"",
        "source": "T33n1717_002:0829c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文《大論》四句評聞慧者，具如《止觀》第一記。",
        "translation": "The first four sentences of the Mahāprajñāpāramitā comment on the wisdom of hearing, as described in the first entry of Zhiguan.",
        "source": "T33n1717_002:0829c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四句中具舉得失，第三句得，餘三並失。",
        "translation": "These four sentences contain a list of gains and losses, with the third sentence containing a gain and the other three a loss.",
        "source": "T33n1717_002:0829c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引《百論》單引兩失。",
        "translation": "The next quote from the Hundred Treatises simply cites two failures.",
        "source": "T33n1717_002:0829c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云「百論有盲跛」等者，《百論》「外人計云：若神無觸身不能到，如盲跛二人相假能到。",
        "translation": "When it says, \"The Bailun has the blind and lame,\" the Bailun says, \"Outsiders say, 'If the soul can't reach the body without touch, it's like the blind and lame who are nominally able to reach each other.'",
        "source": "T33n1717_002:0829c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內破曰：盲跛二觸二思惟故是故能到，身神無二故不能到。」",
        "translation": "They refute this by saying that because the blind and lame touch and contemplate each other, they can reach them, and because the body and spirit are not two, they can't.\"",
        "source": "T33n1717_002:0829c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今借喻邊相假能到，不取所計神我及身。",
        "translation": "Now, we're using a metaphor to falsely describe the two aspects as being able to reach, without taking the imagined soul, self, and body.",
        "source": "T33n1717_002:0829c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今言盲而不跛如有行無解，跛而不盲如有解無行，若解行具足猶如二全。",
        "translation": "We're saying that being blind but not lame is like having practice without understanding, and being lame but not blind is like having understanding without practice, or if understanding and practice are complete, it's like having both.",
        "source": "T33n1717_002:0829c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引牟子雙失顯得，云「牟子有說行之義」者，如《止觀》第一記。",
        "translation": "The next quote from Muzi, which shows the attainment of both faults, says, \"Muzi has the meaning of explaining practice,\" as recorded in the first entry of Zhiguan.",
        "source": "T33n1717_002:0829c21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此二喻例釋《大論》四句，可知。",
        "translation": "Using these two metaphors as examples, we can understand the four sentences of the Mahāyāna-saṃgraha.",
        "source": "T33n1717_002:0829c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引《華嚴》及今經，可知。",
        "translation": "Next, he cites the Huayan and the present-day sūtras, as can be seen.",
        "source": "T33n1717_002:0829c23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「何者」下責失中以言教之風吹無室之燈，室如定也。",
        "translation": "Next, under \"why is it\", he blames the wind of the teaching for blowing the lamp of a non-room, which is like a concentration.",
        "source": "T33n1717_002:0829c24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "照於理境諸法不了，且略舉一慢應具足諸惑，執妙教之刃、傷智照之手。",
        "translation": "He doesn't understand the principle and objects of things, so he briefly cites one conceit that should be replete with mental disturbances, which hold the edge of the fine teaching and injure the hand of wisdom and illumination.",
        "source": "T33n1717_002:0829c25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若但暗證觀心之人起增上慢，前是我慢與此中別，抱暗證之炬、燒勝定之手。",
        "translation": "If someone who only observes the mind in a dark way gives rise to pride of superiority, the former is self-conceit that's distinct from the latter, holding the torch of dark realization and burning the hand of superior concentration.",
        "source": "T33n1717_002:0829c27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若欲」下示得，為二：先示，次結。",
        "translation": "\"If you want to,\" he says, \"show how to attain it,\" which is divided into two: first, showing, and then concluding.",
        "source": "T33n1717_002:0829c29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文先略示，次釋六即。",
        "translation": "The first briefly describes the six attainments, and the second explains their significance.",
        "source": "T33n1717_002:0829c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「脩心」下結，又二：初結、次益。",
        "translation": "The conclusion under \"cultivating the mind\" is composed of two more: the first is a conclusion, and the second is a benefit.",
        "source": "T33n1717_002:0830a01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼明慧聞隔字為對，所益蓋廣，何得不以觀解五章之文，令眼智具耶？",
        "translation": "Since the eye's insight and wisdom are matched by the words separated, how could it not be possible to contemplate and understand the text of the five chapters so that the eye's knowledge would be complete?",
        "source": "T33n1717_002:0830a02_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋會異中二：先問起，次答出。",
        "translation": "There are two explanations of the differences in the explanation of the teaching: first, the question is raised, and then the answer is given.",
        "source": "T33n1717_002:0830a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答中自分二：前對五章，次解四悉。",
        "translation": "The answer is divided into two: the first deals with the five chapters, and the second explains the four siddhântas.",
        "source": "T33n1717_002:0830a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文又二：先對五章，云「名該一部世界亦冠於三」者，如五重玄義名最居初冠於一部，部內不出體宗用三，世界亦在四悉之初，生善等三不出世界，是故同也。",
        "translation": "First, there are two responses: first, to the five chapters, it says, \"The name is the first part of the world, and the world is crowned with three.\" This is because, for example, the fivefold profound meaning of the name most resides at the beginning of the part, the essence, the tenets, and the functions of the three parts of the part don't exit, and the world is at the beginning of the four siddhântas, and the three aspects of producing goodness don't exit the world; therefore, they're the same.",
        "source": "T33n1717_002:0830a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此並須以圓妙四悉方同此經五章意也。",
        "translation": "This is the same as the five chapters of the sutra in terms of the four perfect siddhântas.",
        "source": "T33n1717_002:0830a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次問答料簡中二：初一問答，明四悉五章次第不同，次一問答明經論不同。",
        "translation": "The second question and answer is limited to two: the first question and answer explains the differences in the order of the four siddhântas and five chapters, and the second question and answer explains the differences between the sūtras and the treatises.",
        "source": "T33n1717_002:0830a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初問可解。",
        "translation": "The first question is understandable.",
        "source": "T33n1717_002:0830a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次答中四：初雙標兩根，次釋對利鈍，三「五重」下判不同，四「對義」下結酬。",
        "translation": "The next answer contains four: first, a dual designation of the two faculties, second, an explanation of the relative benefits and dullnesses, third, a judgment of the differences under \"Five Levels,\" and fourth, a conclusion of the reward under \"Contrary Meaning.\"",
        "source": "T33n1717_002:0830a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次問者，若以《大論》四悉通《大品經》五章可爾，何得將通《法華經》耶？",
        "translation": "The second question is, if it's possible to say that the four lemmas of the Mahāprajñāpāramitā teach five chapters of the Mahāprajñāpāramitā, then how could they teach five chapters of the Lotus Sutra?",
        "source": "T33n1717_002:0830a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麁妙既殊通義安在？",
        "translation": "What is the general meaning of debilitation and subtlety?",
        "source": "T33n1717_002:0830a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《中論》通申，用之即是，何不用耶？",
        "translation": "The Mādhyamika-śāstra explains that this is what is used, so why not use it?",
        "source": "T33n1717_002:0830a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答中先申四悉意，次還用通申以申今意。",
        "translation": "In the answer, he first explained the meaning of the four siddhântas, and then he also used the generic explanation to explain the present meaning.",
        "source": "T33n1717_002:0830a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言「中觀」者，謂觀中之觀，名為中觀，故用所觀以申於體，能觀因果以申於宗，所以引《纓珞》助申論者，破立之義與用義同，利益眾生具須破立復同用也。",
        "translation": "The expression \"contemplation of the middle\" refers to the contemplation within contemplation, which is called the middle contemplation, and therefore uses what is contemplated to explain the essence and what can be contemplated as cause and effect to explain the thesis, so the introduction of \"Yingluo\" helps explain the meaning of the treatise, which is the same as the meaning of refutation and application, and the benefit of sentient beings requires both refutation and application.",
        "source": "T33n1717_002:0830a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「論有」下次引論意同經，別以三字申三章竟。",
        "translation": "The next section, \"Discourse on Existence,\" introduces the same meaning as the sūtras, using three separate words to explain the three chapters.",
        "source": "T33n1717_002:0830a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次「中觀」下總以三字共申於名，文闕教相。",
        "translation": "Next, under \"Contemplation on the Middle Way,\" he uses three words to summarize the term together, leaving out the didactic aspect of the text.",
        "source": "T33n1717_002:0830a22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教相秖是分別前四意，思之可知，故不別釋。",
        "translation": "The aspect of the teaching is simply a distinction between the first four ideas, which is understandable when considered, so it's not explained separately.",
        "source": "T33n1717_002:0830a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更復以論四句申者，論題是總，故總題中含於三觀，具如《止觀》第五卷破古師中意。",
        "translation": "This is further explained by the four sentences of the treatise, the title of which is general, so the three contemplations are included in the general title, just as they are in the fifth volume of Zhiguan zhiguan, which refutes the meaning of the ancient masters.",
        "source": "T33n1717_002:0830a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩論正申五章也，經但助成。",
        "translation": "These two treatises are a summary of the five chapters, which the sūtras merely help to complete.",
        "source": "T33n1717_002:0830a26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法華玄義釋籤卷第二",
        "translation": "Fahua xuanyi shiqibao roll 2",
        "source": "T33n1717_002:0830a27_0",
        "is_bad_quality": false
    }
]