[
    {
        "source_sentence": "阿彌陀經通贊疏卷中",
        "translation": "Amitâbha-sūtra Tongzan shou, vol.",
        "source": "T37n1758_002:0337b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大慈恩寺沙門窺基撰",
        "translation": "By Kuiji, the monk of Dacien Temple",
        "source": "T37n1758_002:0337b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「爾時，佛告長老舍利弗：『從是西方過十萬億佛土，有世界名曰極樂』」。",
        "translation": "The sūtra says, \"At the time, the Buddha told the elder Śāriputra, 'From this, in the west, there are a hundred thousand million Buddha-lands, and the name of the world is paradise.'\"",
        "source": "T37n1758_002:0337b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二正宗分也。",
        "translation": "Zan'an said, \"The second part of the main teaching is also true.",
        "source": "T37n1758_002:0337c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大文分六：第一、標淨土之宗果，經「爾時佛告長老舍利弗，乃至得與如是諸上善人俱會一處」；第二、明極樂之因殊，經「舍利弗！",
        "translation": "The main text is divided into six parts: first, it identifies the doctrinal fruit of the Pure Land when the sūtra says, \"At that point, the Buddha told the elder Śāriputra, 'I can even meet with such excellent people in one place.'\" Second, it explains the causal difference of paradise when the sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0337c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可以少善根，乃至若有眾生聞是說者，應當發願生彼國土」；第三、諸佛證明，經「舍利弗如我今者讚歎阿彌陀佛，乃至舍利弗汝等皆當信受我語及諸佛所說」；第四、三生發願，經「舍利弗！",
        "translation": "Not a little bit of good roots is allowed, even if sentient beings hear this teaching, they should make the vow to be born in that land\"; third, the testimony of the buddhas, as expressed in the sutra \"Śāriputra, I now praise Amitâbha Buddha, and you, Śāriputra, should all believe and accept my words and the teachings of the buddhas\"; and fourth, the vow of the three sentient beings, as expressed in the sutra \"Śāriputra!",
        "source": "T37n1758_002:0337c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人已發願今發願當乃至若有信者，應當發願生彼國土」；第五、彼尊讚歎咸曰希奇，經「舍利弗！",
        "translation": "If someone has made a vow and now makes a vow, then even if they have faith, they should make a vow to be born in that land.\" Fifth, the Bhagavān praises them all as amazing, saying, \"Śāriputra!",
        "source": "T37n1758_002:0337c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今者稱讚諸佛乃至一切世間難信之法」；第六、我佛敘陳獨稱難事，經「舍利弗！",
        "translation": "I now praise the buddhas and even all the teachings of the world that are difficult to believe in\"; and sixth, we buddhas describe the difficulty of claiming independence, as described in the sutra, \"Śāriputra!",
        "source": "T37n1758_002:0337c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知我於」乃至經終五行來是。",
        "translation": "You should know that I came to this point, right up to the five practices at the end of the sūtra.",
        "source": "T37n1758_002:0337c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文分二：初略明淨土、二廣明淨土。",
        "translation": "The first text is divided into two: the first briefly describes the Pure Land, and the second explains the Pure Land in detail.",
        "source": "T37n1758_002:0337c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文有七：一、指方所；二、明數量；三、顯國名；四、明化主；五、辨說法；六、徵國名號；七、結成極樂。",
        "translation": "The first has seven parts: 1. designating places; 2. specifying numbers; 3. revealing the names of countries; 4. specifying the transformation leaders; 5. identifying the teachings; 6. naming countries; and 7. concluding with the ultimate bliss.",
        "source": "T37n1758_002:0337c14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初三也。",
        "translation": "These are the first three.",
        "source": "T37n1758_002:0337c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告，告語也。",
        "translation": "\"The Buddha tells,\" he says.",
        "source": "T37n1758_002:0337c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是西方，從，是指方所，此土遠指西方。",
        "translation": "From this to the West, from this refers to a place, and this land refers far to the West.",
        "source": "T37n1758_002:0337c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過十萬億佛，明數量也。",
        "translation": "More than a hundred thousand million buddhas indicates quantity.",
        "source": "T37n1758_002:0337c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有世界名曰極樂，顯國名也。",
        "translation": "There's a world called paradise, which reveals the name of the country.",
        "source": "T37n1758_002:0337c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土正是經宗。",
        "translation": "The land of ultimate bliss is exactly the sūtra's teaching.",
        "source": "T37n1758_002:0337c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告鶖子以令知，誘含生而忻慕，不能廣敘，聊述七門：第一、釋名；第二、出體；第三、辨假實；第四、漏無漏料揀；第五、五位分別；第六、三科收攝；第七、釋其妨難。",
        "translation": "I'll tell Śāriputra so he'll know it and entice sentient beings to admire it, but I can't give an extensive account, so I'll just describe seven aspects: first, explaining names; second, getting to the essence; third, discerning the provisional and the real; fourth, contaminated and uncontaminated discernment; fifth, distinguishing the five categories; sixth, collecting the three categories; and seventh, explaining the difficulties.",
        "source": "T37n1758_002:0337c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且釋名者，世者可破壞義，界者境分劑也，即所居土。",
        "translation": "To explain the name, worldly means destructible, and realm is the object-specific agent, which is the land in which he lives.",
        "source": "T37n1758_002:0337c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名曰極樂者。",
        "translation": "It's called paradise.",
        "source": "T37n1758_002:0337c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樂即能居者，第六識相應樂受也。",
        "translation": "'Bliss' means 'abiding,' and the sixth consciousness is associated with pleasant feelings.",
        "source": "T37n1758_002:0337c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世即界，持業釋也。",
        "translation": "The world is the element, which is an explanation of the activity that's maintained.",
        "source": "T37n1758_002:0337c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極者至極樂受，世界者即是無情，相違釋也。",
        "translation": "The ultimate is the experience of ultimate bliss, and the world is insentient, which is contradictory to the explanation.",
        "source": "T37n1758_002:0337c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出體者，極樂者，即至極樂受也。",
        "translation": "Whatever comes out of the body, that's the ultimate bliss, which is the experience of ultimate bliss.",
        "source": "T37n1758_002:0337c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世者，即有情無情法上不堅可破壞而立世名，即色心上假立。",
        "translation": "The world is that which is insubstantial and destructible in sentient and insentient beings, which is nominally established in form and mind.",
        "source": "T37n1758_002:0337c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "界者，四塵五塵為體，雖聖境無坌惡義，是塵之類故亦呼為塵。",
        "translation": "The world is the body of the four and five dust motes, which are also called dust because they're types of dust even though the noble realm has no physical or mistaken meaning.",
        "source": "T37n1758_002:0337c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "細四相遷亦名世界。",
        "translation": "The four subtle ways of changing things are also called worlds.",
        "source": "T37n1758_002:0338a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辨假實者，若是化淨土而但是假，是定果色去者，有情未除穢種，未能變得淨土，但是變心如三變土田等，不乖唯識。",
        "translation": "Discerning the provisional and the real, if this is the transformation of the pure land but it's provisional, it's the form of the determined result that goes away, because sentient beings haven't removed the defiled seeds and can't become pure, but they can change their minds like the three transformations of the earth and fields, which doesn't deviate from consciousness-only.",
        "source": "T37n1758_002:0338a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漏無漏料揀者，若是佛本質淨土唯無漏攝，若往生有情及菩薩所變淨土唯是有漏，謂第八識果轉非因故。",
        "translation": "The contaminated and uncontaminated discrimination means that if this is the pure land of the Buddha's original essence, only the uncontaminated will be included, and if the pure land of sentient beings and bodhisattvas who are reborn in the Pure Land is only contaminated, it means that the eighth consciousness' fruition is not the cause.",
        "source": "T37n1758_002:0338a04_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五位分別者，極樂者心所收，世界者即色法攝。",
        "translation": "Regarding the discrimination of the five categories, the paramount one is collected by the mind, and the world is collected by form and dharmas.",
        "source": "T37n1758_002:0338a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三科收攝者，極樂者即行蘊收，世界者即色蘊攝，十二處中極樂法處收，世界即色處攝，十八界中法界及六境中攝。",
        "translation": "Of the three categories of inclusion, the paramount enjoyer is included in the aggregate of form, the world is included in the aggregate of form, the paramount enjoyer in the twelve sense-fields is included in the Dharma sense-field, the world is included in the sense-field, and the Dharma sense-field and the six objects in the eighteen sense-fields are included in the Pure Land.",
        "source": "T37n1758_002:0338a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋妨難者，問：十方佛國快樂皆同，何故偏指西方勸人生彼？",
        "translation": "Those who interpret the obstruction ask, \"Since the happiness of the Buddha-lands in the ten directions is the same, why do you point to the West and encourage people to live there?",
        "source": "T37n1758_002:0338a10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：良為凡夫業重處處生貪，若不偏指一方即不繫心專注。",
        "translation": "A: It's because ordinary people are heavy with activity and craving arises everywhere, and if they don't point to one side or another, they won't be tied down and focused.",
        "source": "T37n1758_002:0338a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以《法華經》云：眾生處處著，引之令得出。",
        "translation": "That's why the Lotus Sutra says, \"All sentient beings are attached to one side or another, so we lead them to escape.",
        "source": "T37n1758_002:0338a13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又西方淨土主勝願強，偏勸往生疾成聖果，所以偏指也。",
        "translation": "Also, the Western Pure Land is strong in terms of the Lord's superior vows, and it's because of this partial pointing that rebirth in the Pure Land is quickly accomplished as a noble result is discouraged.",
        "source": "T37n1758_002:0338a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「其土有佛號阿彌陀，今現在說法」。",
        "translation": "The sūtra says, \"In that land there's a Buddha named Amitâbha who's now teaching.\"",
        "source": "T37n1758_002:0338a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：此第四明化主、第五辨說法也。",
        "translation": "He said, \"This is the fourth explanation of the master of transformation and the fifth that identifies the teaching method.",
        "source": "T37n1758_002:0338a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀上已解，自下經亦有自說處。",
        "translation": "Amitâbha has been explained above, and there's a place in the following sūtras where he speaks for himself.",
        "source": "T37n1758_002:0338a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在者揀於過未，說者演說，法者執持名號之法，即是教法也。",
        "translation": "The present is chosen from the past and future, the preaching is expounding, and the teaching is the method of holding to the name, which is the teaching method.",
        "source": "T37n1758_002:0338a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀佛長為眾生演說妙法轉令精進，故慈悲廣大利物弘深，現初地之報身、化無邊之根器，故云今現在說法。",
        "translation": "Amitâbha has long taught the wonderful Dharma for sentient beings and caused them to make effort, so his compassion is vast and his benefits are great and deep, and he manifests the first ground's reward body and transforms limitless faculties and vessels, so he says he's now teaching the Dharma.",
        "source": "T37n1758_002:0338a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「何故不告菩薩只告聲聞？」",
        "translation": "Q: \"Why aren't you telling the bodhisattvas but only the śrāvakas?\"",
        "source": "T37n1758_002:0338a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「菩薩已無穢種，居淨國而皆同；聲聞分別未除穢方之各異，令生忻慕，只告聲聞。」",
        "translation": "A: \"The bodhisattvas are free of defiled seeds and all live in the same pure country; the śrāvakas have yet to remove the differences between defiled places and give rise to admiration, so they only tell the śrāvakas.\"",
        "source": "T37n1758_002:0338a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「聲聞數廣，頓悟者頗多，何故不告餘人獨告鶖子？」",
        "translation": "Q: \"There are so many śrāvakas and so many people who have suddenly become enlightened, why don't you tell the others and only tell the Śākyamunis?\"",
        "source": "T37n1758_002:0338a25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「只如任家長子、國付賢臣，鶖子智辨不群，偏告一，何爽理乎！」",
        "translation": "He answered, \"Suppose you were to ask a man of great age to entrust his country to a wise minister, but the wisdom and discernment of the man is not shared by many, so he would prefer to report to one, how could it be reasonable?\"",
        "source": "T37n1758_002:0338a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The scripture says, \"Śāriputra!",
        "source": "T37n1758_002:0338a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼土何故名為極樂」。",
        "translation": "What is the reason that land is called paradise?\"",
        "source": "T37n1758_002:0338a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第六徵國名號。",
        "translation": "He said, \"The sixth reason is to assign the name of the country.",
        "source": "T37n1758_002:0338a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故者所以義，前標極樂之名，未彰極樂之相，不覩勝妙難為發心，將欲顯示淨方，故乃自徵國號也。",
        "translation": "Therefore, it means that the name of that land was previously labeled paradise but didn't reveal the characteristics of paradise, so it's difficult to arouse the aspiration without seeing something wonderful, and it's because they want to show the pure land that they've designated themselves as a country.",
        "source": "T37n1758_002:0338a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「其國眾生無有眾苦，但受諸樂，故名極樂」。",
        "translation": "The sūtras say, \"The sentient beings in that country don't experience many sufferings but only pleasures, so it's called the ultimate bliss.\"",
        "source": "T37n1758_002:0338b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第七結成極樂之名。",
        "translation": "They say, 'The seventh rebirth is called paradise.'",
        "source": "T37n1758_002:0338b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國眾生者，眾生具十種名，眾生即十名中之一名也。",
        "translation": "The name of that country's sentient beings refers to the ten kinds of names for sentient beings, and sentient beings is one of the ten names.",
        "source": "T37n1758_002:0338b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓮華化生無其生苦，四序不能遷故無老苦，非分段無病苦，壽命無盡無死苦，無父母親疎故無怨憎會苦，所欲如意無求不得苦，顏貌端嚴無諸根缺陋之苦，又四時一等故無寒暑等苦，故云其國眾生無有眾苦，謂處絕三途、人無眾苦。",
        "translation": "Because lotus-transformed beings experience no suffering of birth, no suffering of old age because they can't move in four orders, no suffering of illness that's not segmented, no suffering of death because their life span is endless, no suffering of association with parents and relatives, no suffering of not getting what they want, no suffering of not getting what they want, no suffering of deficiencies of the faculties because their appearance is dignified, and no suffering of cold and heat because the four seasons are the same, it's said that the sentient beings of that country don't experience any suffering, which is to say that their places are cut off from the three paths and their people don't experience any suffering.",
        "source": "T37n1758_002:0338b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "只如娑婆世界，有漏形軀四蛇迴身三龍害命，乖張病惱報盡死侵，有愛必離無怨不會，竪迷至理橫受陰纏。",
        "translation": "It's just like the sahā world, where contaminated bodies have four snakes that turn their bodies around, three dragons that harm their lives, perverse illnesses and disorders that bring the results of death, lovers who must part with no enemies and won't, and those who are confused about the ultimate truth and are tethered by aggregates.",
        "source": "T37n1758_002:0338b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今茲眾人永無此也，且積修白業生處紅蓮，相好常身蠲除四相，已情絕慮誰為愛憎，隨念即來無求不得，五香佛體眾德嚴身，故云無有眾苦也。",
        "translation": "Now, all people will never experience this, but they'll accumulate white karma and be born among the red lotuses, their good and permanent bodies will be freed from the four marks, their emotions will be cut off, who will love and hate them, and their thoughts will immediately come without wanting or not getting anything, and their bodies will be adorned with the five fragrant buddha bodies and many virtues, so they'll be said to lack all suffering.",
        "source": "T37n1758_002:0338b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但受諸樂者，纔歸淨土聖眾隨迎，蓮華倏開覩金容之相好，徵風暫扇聽寶樹而搖聲，加以飄渺仙雲近浮神足，輕盈衣裓遠供祥華，晨謁慈顏得法印而旋國，暮遊金殿聽寶偈而經行，然大慈願廣利鈍普霑，且舊蓮欲發為遣殘殃，新學化生行成不退，豈唯近已麁苦，抑亦妙果非遠者哉！",
        "translation": "But those who experience these pleasures are those who have just returned to the Pure Land and are greeted by a multitude of noble people, who suddenly see the beautiful features of the golden lotus, who hear the sound of a jeweled tree shaking when the wind blows, who float close to the gods' feet on wispy clouds, who offer auspicious flowers from afar on light robes, who obtain the seal of the Dharma and revolve around the country in the morning with a kind face, who wander through the golden palace at sunset and hear the precious verses and scriptures, who nevertheless have a great compassionate vow to extensively benefit and dull the whole world, who want to rid themselves of the remaining calamities with the desire of the old lotus, and who have newly trained in the practice of transformation and birth, who are nonretrogressors, are they not only those who have recently suffered, but also those whose marvelous fruit is not far away?",
        "source": "T37n1758_002:0338b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故云但受諸樂，故名極樂。",
        "translation": "That's why it's called paradise because it only experiences pleasures.",
        "source": "T37n1758_002:0338b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「彼土屬三界否？」",
        "translation": "He asked, \"Does that land belong to the three realms?\"",
        "source": "T37n1758_002:0338b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「無欲故非欲界，地居故非色界，有形相故非無色界，內無穢種外感淨方，迴出四流水超三界，故非界繫也。」",
        "translation": "Answer: \"It's not the desire realm because there's no desire, it's not the form realm because it lives on the earth, it's not the formless realm because it has form, it has no defiled seeds on the inside and experiences pure regions on the outside, and it flows back out of the four rivers and transcends the three realms; therefore, it's not bound to a realm.\"",
        "source": "T37n1758_002:0338b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「又，舍利弗！",
        "translation": "The sūtra says, \"Furthermore, Śāriputra!",
        "source": "T37n1758_002:0338b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土，七重欄楯、七重羅網、七重行樹，皆是四寶周匝圍繞」。",
        "translation": "The land of ultimate bliss is surrounded by seven layers of railing, seven layers of netting, and seven layers of rows of trees, all surrounded by the four treasures.\"",
        "source": "T37n1758_002:0338b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二廣明淨土。",
        "translation": "Zan'an said, \"Second, we'll explain the Pure Land in detail.",
        "source": "T37n1758_002:0338b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為二：初明國土莊嚴、二辨佛身功德。",
        "translation": "The text is divided into two: the first describes the land's adornment, and the second identifies the merits of the Buddha's body.",
        "source": "T37n1758_002:0338b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文分八：第一、樹飾四珍；第二、池嚴眾寶；第三、空盈天樂；第四、地布黃金；第五、華雨長天；第六、人遊諸國；第七、鳥吟妙法；第八、風吹樂音。",
        "translation": "The first text is divided into eight parts: first, the trees are adorned with four treasures; second, the ponds are adorned with treasures; third, the sky is filled with sky-bliss; fourth, the earth is covered with gold; fifth, flowers rain down from the long sky; sixth, people travel to the countries; seventh, birds chant the wonderful Dharma; and eighth, the wind blows musical sounds.",
        "source": "T37n1758_002:0338c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文分二：初正辨莊嚴、二結成極樂。",
        "translation": "The first text is divided into two: the first correctly describes adornment, and the second concludes with the ultimate bliss.",
        "source": "T37n1758_002:0338c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即初也。",
        "translation": "This is the first.",
        "source": "T37n1758_002:0338c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又者，復也重也。",
        "translation": "'Again, it's also repeated.'",
        "source": "T37n1758_002:0338c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂前來已告舍利弗，彼國無有眾苦，名曰極樂。",
        "translation": "The previous speaker had already told Śāriputra that his country was without suffering and was called paradise.",
        "source": "T37n1758_002:0338c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此欲廣明淨土境物殊常，又告鶖子，故云：「又，舍利弗！」",
        "translation": "Now, he wants to explain in detail the extraordinary nature of the Pure Land and also tell Śāriputra, so he says, \"Again, Śāriputra!\"",
        "source": "T37n1758_002:0338c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土七重欄楯者，寶樹周圍有七重欄楯也。",
        "translation": "\"The Land of Ultimate Bliss has seven rails and shields around the jeweled tree.",
        "source": "T37n1758_002:0338c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "橫曰欄，竪曰楯，欄檻也。",
        "translation": "A horizontal railing is called a railing, and a vertical railing is called a shield, which is also a fence.",
        "source": "T37n1758_002:0338c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莊嚴眾寶圍繞華叢，何獨偏舉樹嚴？",
        "translation": "Why is the ornamented mass of treasures surrounding the flowering bush singled out for its tree's splendor?",
        "source": "T37n1758_002:0338c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼土處處皆有也。",
        "translation": "It's found everywhere in that land.",
        "source": "T37n1758_002:0338c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七重羅網者，嚴顯國土羅覆樹林，金縷結成眾寶飾。",
        "translation": "\"The seven-fold net is a forest of covered trees that adorned with gold threads and numerous treasures.",
        "source": "T37n1758_002:0338c10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《觀經》云：一一樹上有七重網，皆是真珠，一一網間有五百億妙華宮殿，如梵王宮。",
        "translation": "The Avalokitêśvara Sutra says, \"On each tree there are seven rings of nets, all of which are genuine pearls, and between each ring of nets there are 50 billion wonderfully decorated palaces and halls like the palace of Brahmā.",
        "source": "T37n1758_002:0338c11_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天童子自然在中，以摩尼寶而為瓔珞，其光照曜一百由旬。",
        "translation": "The gods and children are naturally present in them, and they're decorated with a necklace of maṇi jewels whose light shines for a hundred leagues.",
        "source": "T37n1758_002:0338c13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦准於前處處皆有，故《瑞相經》云：無量寶網皆以金縷真珠百千雜寶奇妙珍異莊嚴校飾，周匝四面垂以寶鈴，光色晃曜盡極嚴麗，祥風微起吹眾網羅，聲演法音振聞一[囗@(夕/方)]，耳聽心悅更增快樂也。",
        "translation": "They're also like the ones that exist everywhere before, so the Ruisheng jing says, \"Measureless nets of treasures are decorated with gold threaded real pearls and a hundred thousand mixed jewels, wonderfully rare and adorned, surrounded by four sides draped with jeweled bells, their colors shining and shining in the greatest splendor, and an auspicious breeze subtly rises and blows the many nets, making the sound of the Dharma to be heard, which pleases the ear and adds happiness to the mind.",
        "source": "T37n1758_002:0338c15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七重行樹者，七重寶樹行列[囗@(夕/方)]中，長開異華更無凋變，靈禽棲上眾聖遊從也，故云七重行樹。",
        "translation": "The seven rows of trees are rows of [囗@(夕/方)] in which seven layers of treasures bloom in a variety of flowers that never wither, and spiritual birds roost on them, making them the seven rows of trees for the sages to follow.",
        "source": "T37n1758_002:0338c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆是四寶者，皆由咸也，咸是四寶也。",
        "translation": "\"They are all the four treasures, which are all made of salt, and salt is the four treasures.",
        "source": "T37n1758_002:0338c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四寶者，或是金銀珊瑚琥珀也。",
        "translation": "The four treasures are either gold, silver, coral, or amber.",
        "source": "T37n1758_002:0338c22_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《瑞相經》云：其國有七寶諸樹周滿世界，謂有二寶乃至眾寶所共合成，如金樹則以銀為枝葉華菓，銀樹以金為枝葉華菓，乃至有紫金為本，白銀為莖、琉璃為枝、水精為條、珊瑚為葉、瑪瑙為華、車璩為實。",
        "translation": "The Rui xiang jing says, \"In that country, there are seven-jeweled trees that circumambulate the world, which are a composite of two or even many treasures, such as a gold tree with silver as its branches, leaves, flowers, and fruits, a silver tree with gold as its branches, leaves, flowers, and fruits, and even a purple-gold tree as its base, white silver as its stem, lapis lazuli as its branches, water essence as its strips, coral as its leaves, agate as its flowers, and a chariot as its substance.",
        "source": "T37n1758_002:0338c23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白銀為本等一一例此，行行相對枝枝相映，葉葉相顯榮色光曜，不可勝視，清風時時發出五音聲，微妙宮商自然相振。",
        "translation": "Each of these things, such as white silver as the base, are exemplified by the way they line up against each other, the way their branches reflect each other, and the way their leaves display each other in glorious splendor is unsurpassed, and the crisp breeze regularly produces the five sounds of a subtle palace merchant naturally vibrating against each other.",
        "source": "T37n1758_002:0338c27_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又《觀經》云：一一樹高八千由旬，一一樹葉縱廣二十五由旬，而作異色。",
        "translation": "The Avalokitêśvara Sutra also says, \"Each tree is 8,000 leagues tall, and each tree's leaves are 25 leagues wide across and are variegated.",
        "source": "T37n1758_002:0339a01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一華葉之中，皆有七寶光也。",
        "translation": "Within each flower and leaf, there's a light from seven treasures.",
        "source": "T37n1758_002:0339a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四寶皆是者，即據此經。",
        "translation": "This is the sutra according to which the four treasures are all these.",
        "source": "T37n1758_002:0339a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欄楯、羅網、行樹此之三種，咸是四寶所成也。",
        "translation": "These three things, a railing, a net, and a walking tree, are all made of the four treasures.",
        "source": "T37n1758_002:0339a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四寶者，金、銀、瑠璃、頗胝迦也。",
        "translation": "The four treasures are gold, silver, lapis lazuli, and pāṭika.",
        "source": "T37n1758_002:0339a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通貫上文，故云皆是四寶也。",
        "translation": "They all go together as above, so it's called the Four Treasures.",
        "source": "T37n1758_002:0339a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "周匝者，古申多解：一云、欄楯圍繞寶樹故云圍繞；二云、欄楯羅網行樹圍繞國土處處莊嚴故。",
        "translation": "To circumambulate, there are many ancient interpretations: one says that a railing surrounds a jeweled tree, so it's called circumambulation; the other says that a railing, a net, and a walking tree surround the land and adorn it in various places.",
        "source": "T37n1758_002:0339a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「欄楯羅網行樹，何故各有七重，更無增減？」",
        "translation": "Q: \"Why are there seven layers of railing and netting and rows of trees, and nothing more or less?\"",
        "source": "T37n1758_002:0339a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「表生歸彼國得七覺支故，身口七支無諸過故，有七聖財。」",
        "translation": "Answer: \"It's because the table sentient beings return to that country and attain the seven factors of awakening, and because the seven factors of body and speech have no faults, they have the seven noble possessions.\"",
        "source": "T37n1758_002:0339a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「是故彼國名曰極樂」。",
        "translation": "The sūtra says, \"Therefore, that country is called paradise.\"",
        "source": "T37n1758_002:0339a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二結成極樂。",
        "translation": "They say, 'The second condition is the completion of ultimate bliss.'",
        "source": "T37n1758_002:0339a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「又，舍利弗！",
        "translation": "The sūtra says, \"Furthermore, Śāriputra!",
        "source": "T37n1758_002:0339a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土有七寶池」。",
        "translation": "The land of ultimate bliss has sevenjeweled ponds.\"",
        "source": "T37n1758_002:0339a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二池嚴眾寶。",
        "translation": "They say, 'The second pond is adorned with all kinds of treasures.'",
        "source": "T37n1758_002:0339a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為七：第一、七寶池深；第二、八德水滿；第三、金砂作地；第四、玉砌成階；第五、朱閣凌空；第六、寶蓮覆水；第七、結成極樂。",
        "translation": "The text is divided into seven: first, the seven-jewel pond is deep; second, the eight virtues are filled with water; third, gold sand forms the floor; fourth, jade masonry forms the steps; fifth, a vermilion pavilion rises above the sky; sixth, jeweled lotuses cover the water; and seventh, the paradise is formed.",
        "source": "T37n1758_002:0339a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即初也。",
        "translation": "This is the beginning.",
        "source": "T37n1758_002:0339a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又者，如前解。",
        "translation": "It's also explained as before.",
        "source": "T37n1758_002:0339a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七寶者：一金，金有五種，黃者為上，久埋不失，百鍊不輕，從草不違，生於土左右，所以金字象金在土中形。",
        "translation": "The seven treasures are: 1. gold; there are five kinds of gold, and yellow is the best; it's not buried for a long time, doesn't lose its shape, isn't lightened by a hundred refinements, doesn't fall apart from the grass, and is born around the earth, so the word gold resembles the shape of gold in the earth.",
        "source": "T37n1758_002:0339a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二、銀，易知。",
        "translation": "Silver is easy to understand.",
        "source": "T37n1758_002:0339a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三、瑠璃者，梵云吠瑠璃，有五種色，略云瑠璃。",
        "translation": "3. lapis lazuli is the Sanskrit word for vaiḍūrya, which has five colors and is roughly called lapis lazuli.",
        "source": "T37n1758_002:0339a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四者、玻[王*梨]者，《智度論》云：出山石窟中，過千年氷化為玻[王*梨]。",
        "translation": "Fourth, glass [king*li], as the Zhidu lun says, \"Out of a mountain cave, ice turns into glass [king*li] after a thousand years.",
        "source": "T37n1758_002:0339a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨國無其寒暑，土地無氷，何物化焉？",
        "translation": "In a pure country where there's no heat or cold and no ice on the land, what could possibly be turned into that?",
        "source": "T37n1758_002:0339a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但是石類，非實石也，謂淨土故亦云胝迦。",
        "translation": "It's just a type of stone, not a real stone. It's called the Pure Land and therefore is also called a coral.",
        "source": "T37n1758_002:0339a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五、車璩者，梵云牟娑洛揭拉婆，青白間色也。",
        "translation": "5. chequ, a Sanskrit word for musāragarbha, is also blue and white in color.",
        "source": "T37n1758_002:0339a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六、赤真珠者，珠體赤也。",
        "translation": "Red real pearl, the body of a pearl is red.",
        "source": "T37n1758_002:0339a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七、瑪瑙者，梵云遏濕摩揭婆，此云杵藏，下辨七寶亦依此處。",
        "translation": "Agate is the Sanskrit word śiśumagarbha, which is the storehouse of the pounder, and the following discussion of the seven treasures also relies on this place.",
        "source": "T37n1758_002:0339a25_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "池者，池沼。",
        "translation": "\"Pond\" refers to a pond.",
        "source": "T37n1758_002:0339a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嚴寶瓔珞砌墁池潭，異種光曜自然嚴顯。",
        "translation": "A pond lined with ornamented jewels and diaphanous stones, its various luminous shades are naturally brilliant.",
        "source": "T37n1758_002:0339a27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《瑞應經》云：其池縱廣深淺或十由旬乃至百千由旬，其池岸上有栴檀樹，華葉垂布香氣馥薰也。",
        "translation": "The Ruiying jing says, \"The pond's length and breadth, depth, and shallowness may range from ten leagues to a hundred thousand leagues, and on its shore there's a sandalwood tree with flowers and leaves draped over it, perfuming it with fragrance.",
        "source": "T37n1758_002:0339a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「八功德水充滿其中」。",
        "translation": "The sūtra says, \"Eight meritorious waters fill it up.\"",
        "source": "T37n1758_002:0339b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二八德水滿也。",
        "translation": "They say, 'The second eight virtues are filled with water.'",
        "source": "T37n1758_002:0339b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八功德水充滿於池，淨土福勝水異凡間，含八德之殊功、益五常之妙體。",
        "translation": "The water of the eight virtues fills the pond, and the blessed and excellent water of the Pure Land is different from that of ordinary people, containing the special qualities of the eight virtues and benefiting the marvelous essence of the five constants.",
        "source": "T37n1758_002:0339b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八德者：一、澄淨；二、清冷；三、甘美；四、輕軟；五、潤澤；六、安和；七、飲時除飢渴；八、飲已長養諸根。",
        "translation": "The eight virtues are: 1. clarity; 2. coolness; 3. sweetness; 4. lightness; 5. moistness; 6. peacefulness; 7. removal of hunger and thirst when drinking; and 8. nourishment of the faculties after drinking.",
        "source": "T37n1758_002:0339b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《清淨覺經》云：其池中水淺深隨念、上下逐心。",
        "translation": "The Sutra of Pure Enlightenment says, \"The shallowness of the water in that pond follows mindfulness and goes up and down according to the mind.",
        "source": "T37n1758_002:0339b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《觀經》云：水隨蓮華枝葉上下，水流之音或聞三寶、空無我等、諸波羅蜜之聲也。",
        "translation": "The Avalokitêśvara Sutra says, \"As the water follows the lotus's branches and leaves up and down, the sound of the water flowing may be heard as the sounds of the Three Treasures, emptiness, selflessness, and other pāramitās.",
        "source": "T37n1758_002:0339b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「池底純以金沙布地」。",
        "translation": "The sūtra says, \"The bottom of the pond is covered entirely with gold sand.\"",
        "source": "T37n1758_002:0339b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三金砂作地也。",
        "translation": "He said, \"The third layer of gold sand forms the ground.",
        "source": "T37n1758_002:0339b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "綠水金沙重重顯映。",
        "translation": "The green water and golden sand are repeatedly reflected.",
        "source": "T37n1758_002:0339b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《無量壽經》云：更迓相映，金池白銀砂等。",
        "translation": "The Sutra of Immeasurable Life says: \"Also greet each other, gold pools of white and silver sand and so on.",
        "source": "T37n1758_002:0339b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「四邊階道，金、銀、瑠璃、玻[王*梨]合成」。",
        "translation": "The sūtra says, \"The four sides of the stairway are made of gold, silver, lapis lazuli, and glass [king*li].\"",
        "source": "T37n1758_002:0339b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第四玉砌成階。",
        "translation": "They say, 'The fourth jade masonry step.'",
        "source": "T37n1758_002:0339b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邊者周圍四圻邊也，階即砌，道者路也，上堦之道也。",
        "translation": "The border is the four sides around it, and the steps are the masonry; the path is the road, the path up the congregation.",
        "source": "T37n1758_002:0339b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金、銀、瑠璃、玻[王*梨]已如上解。",
        "translation": "Gold, silver, lapis lazuli, and glass [king*ri] have been explained as above.",
        "source": "T37n1758_002:0339b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合成者，四寶共合成故。",
        "translation": "'Composite' means the four treasures are made together.",
        "source": "T37n1758_002:0339b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「上有樓閣，亦以金、銀、瑠璃、玻[王*梨]、[王*車]璖、赤珠、瑪瑙而嚴飾之」。",
        "translation": "The sūtra says, \"There's a tower up there that's also adorned with gold, silver, lapis lazuli, glass [king*li], [king*car] model, red beads, and agate.\"",
        "source": "T37n1758_002:0339b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第五朱閣凌空也。",
        "translation": "He said, 'The fifth jeweled tower is high in the sky.'",
        "source": "T37n1758_002:0339b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上有樓閣者，七寶池上鬪空起樓閣也。",
        "translation": "Up there is a tower, too, because the fighters on top of the seven-jewel pond have raised a tower in the sky.",
        "source": "T37n1758_002:0339b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦以者，七寶池上樓閣凌空還用寶成，故云亦也。",
        "translation": "It's also because the tower above the Lake of the Seven Treasures is made of jewels that are still in the air, so it's called also.",
        "source": "T37n1758_002:0339b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金、銀、瑠璃、玻[王*梨]、[王*車]璖、赤珠、瑪瑙，七寶如前解也。",
        "translation": "The seven treasures of gold, silver, lapis lazuli, glass [king*li], [king*chelsea] model, red pearl, and agate are explained above.",
        "source": "T37n1758_002:0339b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嚴飾之者，莊嚴麗華飾也。",
        "translation": "The one who adorned, adorned with beautiful flowers.",
        "source": "T37n1758_002:0339b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《無量壽論》云：為地莊嚴也。",
        "translation": "The Treatise on Immeasurable Life says, \"Adorn the ground.",
        "source": "T37n1758_002:0339b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《觀經》云：處處皆有眾寶樓閣莊嚴池上也。",
        "translation": "The Contemplation Sutra says, \"Everywhere, there are mansions of many treasures adorning the pond.",
        "source": "T37n1758_002:0339b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時時遊賞、往往登攀，眺望淨土，適悅情思也。",
        "translation": "It's a pleasure to visit and often climb, and it's a pleasure to look out over the Pure Land.",
        "source": "T37n1758_002:0339b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「池中蓮華大如車輪」。",
        "translation": "The sūtras say, \"The lotus in the pond is as big as a chariot wheel.\"",
        "source": "T37n1758_002:0339b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第六寶蓮覆水也。",
        "translation": "He said, \"The sixth lotus is a jewel covering the water.",
        "source": "T37n1758_002:0339b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此文分四：一、顯華名；二、辨形量；三、釋顏色；四、明香潔。",
        "translation": "This text is divided into four parts: 1. revealing the names of the flowers; 2. identifying their shape and size; 3. explaining their color; and 4. explaining their fragrance.",
        "source": "T37n1758_002:0339b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初二文也。",
        "translation": "These are the first two phrases.",
        "source": "T37n1758_002:0339b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓮者，芙渠之實，華美曰華，大而復圓狀若車輪。",
        "translation": "The lotus is the fruit of the floral tree, called the flower, which is large and round like a chariot wheel.",
        "source": "T37n1758_002:0339b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《觀經》及《平等覺經》云：大者或二十里乃至六百萬里。",
        "translation": "The Contemplation Sutra and the Sutra of Immeasurable Life say that it can be as large as 20 miles or as large as 6 million miles.",
        "source": "T37n1758_002:0339b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然今大小亦無定准，此中約小者說也。",
        "translation": "However, there's no set standard for size nowadays, so we're talking about the smallest one here.",
        "source": "T37n1758_002:0339b29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「青色青光、黃色黃光、赤色赤光、白色白光，微妙香潔」。",
        "translation": "The sūtras say, \"A blue-hued blue light, a yellow-hued yellow light, a red-hued red light, and a white white light are delicately fragrant and clean.\"",
        "source": "T37n1758_002:0339c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：此後二文，第三顏色、四香潔。",
        "translation": "He said, \"The last two paragraphs here are about the third color and the four fragrances.",
        "source": "T37n1758_002:0339c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四色各有異光也。",
        "translation": "Each of the four colors has a different radiance.",
        "source": "T37n1758_002:0339c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光即光彩各異。",
        "translation": "Light is luster that varies from one glow to another.",
        "source": "T37n1758_002:0339c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "微妙者，深細殊常。",
        "translation": "Subtle refers to the depth and subtlety of their differences.",
        "source": "T37n1758_002:0339c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香者香氣，潔者體無塵垢，故云微妙香潔。",
        "translation": "Fragrance is odor, and purity is the absence of dirt in the body; therefore, it's called subtle and fragrant purity.",
        "source": "T37n1758_002:0339c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《清淨經》云：一一華葉皆作異寶色。",
        "translation": "The Jingjing jing says, \"Each of the lotus leaves is made with a different precious color.",
        "source": "T37n1758_002:0339c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何獨青色光等也？",
        "translation": "Why is it only blue-colored light and so forth?",
        "source": "T37n1758_002:0339c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經據純色者說。",
        "translation": "The sutra says according to Pure Color.",
        "source": "T37n1758_002:0339c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「何故只有四色？」",
        "translation": "It asks, \"Why are there only four forms?\"",
        "source": "T37n1758_002:0339c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「表四色是實而無假者，表生居淨土，心無諂曲、語不虛詞，證四涅槃、得四智故。」",
        "translation": "Answer: \"It means that the four forms are real and not false, which means that one is born and lives in the Pure Land, has a mind free of deceit and speaks freely, and realizes the four nirvāṇas and attains the four kinds of wisdom.\"",
        "source": "T37n1758_002:0339c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra said, \"Śāriputra!",
        "source": "T37n1758_002:0339c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土成就如是功德莊嚴」。",
        "translation": "The land of ultimate bliss accomplishes such adornments of merit.\"",
        "source": "T37n1758_002:0339c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第七結成極樂，可知。",
        "translation": "He said, \"The seventh rebirth as paradise is understandable.",
        "source": "T37n1758_002:0339c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「又，舍利弗！",
        "translation": "The sūtra says, \"And, Śāriputra!",
        "source": "T37n1758_002:0339c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛國土常作天樂」。",
        "translation": "That Buddha's land always produces celestial bliss.\"",
        "source": "T37n1758_002:0339c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三空盈天樂。",
        "translation": "They say, \"The third heavenly music is filled with emptiness.",
        "source": "T37n1758_002:0339c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空中奏樂聲演法音，彼國人聞咸生善念。",
        "translation": "The music in the sky sounds like the music of the Dharma, and the people of that country hear it, and they all become well-intentioned.",
        "source": "T37n1758_002:0339c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《觀經》云：無量樂器懸處虛空，不鼓自鳴，或林或幢皆懸樂器，悉自和鳴，隨眾生意皆奏法音，人天聞者俱發道意，或謌六度，或讚三乘。",
        "translation": "As the Avalokitêśvara Sutra explains, measureless musical instruments hang in the sky and sound spontaneously without drumming, while musical instruments hang in forests and banners, all sounding in harmony with each other and following the activities of the people, and those among humans and gods who hear them all arouse the aspiration for enlightenment, either by playing the six perfections or praising the three vehicles.",
        "source": "T37n1758_002:0339c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「黃金為地」。",
        "translation": "The sūtras say, \"Gold is the ground.\"",
        "source": "T37n1758_002:0339c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第四地布黃金。",
        "translation": "They say, 'The fourth ground spreads gold.'",
        "source": "T37n1758_002:0339c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心無穢種，地感黃金，柔軟自然高低隨步。",
        "translation": "When the mind is without defiled seeds, the ground feels gold, and its suppleness and naturalness follow its height.",
        "source": "T37n1758_002:0339c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《觀經》云：其地由如日宮懸處虛空，其地柔軟，下足即凹、舉足便起。",
        "translation": "The Contemplation Sutra says, \"The ground is like a sun palace suspended in the sky, and it's so soft that it's concave when you step down and rises when you lift your foot.",
        "source": "T37n1758_002:0339c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又彼國無須彌山及諸山等，《瑞相經》亦說：其佛國土，自然七寶合成其地，不可限量殊特妙好，逾諸十方一切世界。",
        "translation": "In addition, that country doesn't need Mount Sumeru and the other mountains, and the Rui xiang jing also says, \"In that Buddha's land, seven natural treasures combine to form a ground that's incalculably special and wonderful, surpassing all the worlds in the ten directions.",
        "source": "T37n1758_002:0339c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此唯金者，亦文略也。",
        "translation": "This is only gold, which is also an abbreviation of the text.",
        "source": "T37n1758_002:0339c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又眾寶妙衣遍有其地，一切人天踐之而行，種種莊嚴以顯殊特也。",
        "translation": "There are also many precious and marvelous garments that pervade the land, which all humans and gods trample upon and walk around in, adorned in various ways to show their specialness.",
        "source": "T37n1758_002:0339c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「晝夜六時而雨曼陀羅華」。",
        "translation": "The sūtras say, \"During the six periods of the day and night, it rains mandāra flowers.\"",
        "source": "T37n1758_002:0339c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第五華雨長天也。",
        "translation": "He says, 'The fifth flower rains down in the Nāgasena Heaven.'",
        "source": "T37n1758_002:0339c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晝夜六時者，晝夜各有六時，共十二時也。",
        "translation": "The six hours of the day and six hours of the night are six hours of the day and twelve hours of the night.",
        "source": "T37n1758_002:0339c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「西方淨土境勝地殊，人絕無明、國無昏曉，何言晝夜？」",
        "translation": "He asked, \"The Pure Land of the West is an extraordinary place, where people are free from ignorance and the country is free from dusk, so why do you say day and night?\"",
        "source": "T37n1758_002:0339c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「華開金浦化生為天曙之情，鳥宿瓊林菩薩作時昏之相，不同此界昏昧各殊。」",
        "translation": "Answer: \"The flower that opens the golden river and transforms beings into the gods' dawning emotions, and the bird that stays in the agalactic forest and the bodhisattva's appearance at sunset, are not the same as the differences in obscurity in this realm.\"",
        "source": "T37n1758_002:0339c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而者助句也。",
        "translation": "And is an auxiliary phrase.",
        "source": "T37n1758_002:0340a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雨者，從空飄落謂之雨也。",
        "translation": "'Rain' is called rain that falls from the sky.",
        "source": "T37n1758_002:0340a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曼陀羅華者是梵語，此云適意華也。",
        "translation": "'Mandāra flower' is Sanskrit for 'agreeable flower.'",
        "source": "T37n1758_002:0340a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光潔異香，聞者見者身心適悅長道情故。",
        "translation": "Its bright, clean, and unusual fragrance causes listeners and viewers to experience feelings of comfort in body and mind on the long road.",
        "source": "T37n1758_002:0340a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風飄萎者，地裂受之，更雨新華莊嚴金地故。",
        "translation": "When it blows in the wind and withers, the ground is split and receives it, and it rains new flowers to adorn the golden ground.",
        "source": "T37n1758_002:0340a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《法華經》云：香風吹萎華，更雨新好者。",
        "translation": "The Lotus Sutra says, \"The fragrant wind blows away the withered flowers, and then it rains new goodness.",
        "source": "T37n1758_002:0340a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "華有四德：一、嚴淨國土，表生彼國善法飾身故；二、敷榮見臺，表勝二乘真實法故；三、先華後果，表生彼國先因後果故；四、香氣遠騰聞者歡悅，表生歸彼者德業馨香名振十方故，故雨華也。",
        "translation": "The flowers have four virtues: 1. they adorn the pure land, which shows that they've been born there to adorn themselves with the good Dharma; 2. they spread out a glorious platform, which shows that they're superior to the true and real Dharma of the two vehicles; 3. they are first flowers and then fruit, which shows that they've been born there to bring about the cause first and the result later; and 4. their fragrance sends out joy to those who hear them, which shows that they've been born there to bring the fragrance of their virtuous actions to the ten directions, which is why they're raining flowers.",
        "source": "T37n1758_002:0340a06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「淨土雨白華者表於何事？」",
        "translation": "Q: \"What does the pure land's rain of white flowers signify?\"",
        "source": "T37n1758_002:0340a10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「表生淨土唯白業故。」",
        "translation": "Answer: \"The only thing that appears to be produced in the Pure Land is white karma.\"",
        "source": "T37n1758_002:0340a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有云赤圓華者，不善其理也。",
        "translation": "Those who say the red lotus is not good at its principle.",
        "source": "T37n1758_002:0340a12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《法華經》云：唯白蓮華、放白毫光、白牛馱駕、手執白拂等，表白是眾色之本，一乘是諸法之源，若云赤圓者，此為未可。",
        "translation": "The Lotus Sutra says, 'Only the white lotus, the white ray of light, the white ox-driver, and the white whisk in the hand represent the white color as the root of all forms and the One Vehicle as the source of all dharmas.'",
        "source": "T37n1758_002:0340a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「其國眾生，常以清旦各以衣裓盛眾妙華供養他方十萬億佛」。",
        "translation": "The sūtras say, \"The sentient beings of that country always make offerings to the ten thousand million buddhas in other directions with a towel full of marvelous flowers on a clear sunrise.\"",
        "source": "T37n1758_002:0340a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第六人遊諸國。",
        "translation": "They say, 'The sixth person travels to various countries.'",
        "source": "T37n1758_002:0340a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為三：初將華供佛；二、還國經行；三、結成極樂。",
        "translation": "The text is divided into three parts: first, offering flowers to the Buddha; second, returning to one's country for practice; and third, forming the bonds of ultimate bliss.",
        "source": "T37n1758_002:0340a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即初也，經文易見。",
        "translation": "This is the first, and the text of the sūtra is easy to see.",
        "source": "T37n1758_002:0340a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各以衣裓者，衣襟也。",
        "translation": "\"Each person carries a towel, which is a lapel.",
        "source": "T37n1758_002:0340a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "盛諸妙華者，易見。",
        "translation": "Those who carry marvelous flowers are easy to see.",
        "source": "T37n1758_002:0340a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養者，進財行曰供，有所攝資為養，故云供養。",
        "translation": "\"Making offerings\" is called making offerings when one advances wealth and conducts business, and making offerings when one has the resources to support oneself.",
        "source": "T37n1758_002:0340a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他方者，即十萬億佛，顯所供養佛數也。",
        "translation": "Those in other directions are the ten thousand million buddhas, which shows the number of buddhas that are offered.",
        "source": "T37n1758_002:0340a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "准諸經等，或乘七寶宮殿、白寶蓮華，承佛威神騰空，往彼十方世界，將諸妙華及諸異物隨心供養，聽聞妙法及受記別等事。",
        "translation": "According to the sutras, some travel in a palace of seven jewels or a white lotus, take refuge in the Buddha's authoritative spirit, ascend into the sky, and go to one of the ten worlds, offering up marvelous flowers and other things as they see fit, listening to the wonderful Dharma and receiving specific assurances.",
        "source": "T37n1758_002:0340a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「即以食時還到本國飯食經行」。",
        "translation": "The sūtra says, \"That's when I returned to my original country for a meal and sūtra.\"",
        "source": "T37n1758_002:0340a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二還國經行也。",
        "translation": "He replied, \"The second thing is to return to one's country for a meal.",
        "source": "T37n1758_002:0340a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以食時還歸本國，飯了經行，經行或繞寶殿，或繞瓊林，或往或來，如絹經來往，故云經行。",
        "translation": "That is, when he eats, he returns to his home country, and after he eats, he goes on a journey that sometimes takes him around a jeweled palace or around a jade grove, either going or coming like a silk scripture, and so he's on a journey of scripture.",
        "source": "T37n1758_002:0340a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "足行寶地，口念金經，故云經行也。",
        "translation": "They walk with their feet on a jeweled ground and recite a golden sūtra with their mouth, so they say they're walking through the sūtra.",
        "source": "T37n1758_002:0340a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《瑞相經》云：諸往生者若欲食時，七寶應器自然在前，如是眾鉢隨意而至，百味飲食自然盈滿。",
        "translation": "The Rui xiang jing says, \"When those reborn wish to eat, the seven precious vessels naturally precede them, and as they wish, the bowls naturally fill up with a hundred flavors of food and drink.",
        "source": "T37n1758_002:0340b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖有是食實無食者，但見色聞香以之為食，自然飽足身心柔軟無所味著，事已化去，時至復現。",
        "translation": "Even though there's really no food, someone who sees form and hears fragrance and takes it as food will be naturally satisfied, have a soft body and mind, and have no taste or attachment; after that happens, he'll disappear and reappear.",
        "source": "T37n1758_002:0340b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣經云食，如何相違？",
        "translation": "How is this contradicted by the extensive sūtras that talk about food?",
        "source": "T37n1758_002:0340b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼約示現食，亦有何失。",
        "translation": "What's wrong with their agreement to reveal the present eclipse?",
        "source": "T37n1758_002:0340b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「西方人勝自有身光，既無日月暉，寧辨辰齊之候？」",
        "translation": "He asked, \"A person in the West is superior in terms of his own body's radiance; how could he discern the time and place when there's no sun or moonlight?\"",
        "source": "T37n1758_002:0340b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「金鐘自振、玉磬搖聲，聖眾雲來自然赴會也。」",
        "translation": "Answer: \"When a golden bell strikes itself and a jade chime shakes, clouds of sages naturally come to the assembly.\"",
        "source": "T37n1758_002:0340b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「所言食者資益為義，淨土之中是何食也？」",
        "translation": "Q: \"This food that's mentioned is for the purpose of providing benefit, but what kind of food is it in the Pure Land?\"",
        "source": "T37n1758_002:0340b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「若約實報淨土即禪悅為味，若以化淨土即假食資身也。」",
        "translation": "Answer: \"If we take the Pure Land of Real Reward as the taste, then meditative bliss is the flavor, and if we take the Pure Land of Transformation as the qualification body for fake food.\"",
        "source": "T37n1758_002:0340b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0340b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土成就如是功德莊嚴」。",
        "translation": "The land of ultimate bliss accomplishes such a sublime array of merits.\"",
        "source": "T37n1758_002:0340b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三結成極樂。",
        "translation": "He said, \"The third rebirth is in the land of ultimate bliss.",
        "source": "T37n1758_002:0340b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「復次，舍利弗！",
        "translation": "The sūtra says, \"Furthermore, Śāriputra!",
        "source": "T37n1758_002:0340b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國常有種種奇妙雜色之鳥」。",
        "translation": "That country always has a variety of wonderfully variegated birds.\"",
        "source": "T37n1758_002:0340b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第七鳥吟妙法。",
        "translation": "They say, 'The seventh bird recites the wonderful teaching.'",
        "source": "T37n1758_002:0340b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分文為二：一、敘靈禽；二、去疑執。",
        "translation": "The text is divided into two parts: 1. describing the spiritual bird; and 2. dispelling doubt and attachment.",
        "source": "T37n1758_002:0340b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文有五：第一、總敘靈禽；第二、分別名字；三、傳和雅韻；四、詮顯法音；第五、聞興善念。",
        "translation": "The first has five parts: first, a general description of the spiritual bird; second, a discernment of its name; third, a transmission of the elegant sounds; fourth, an explanation of the sounds of the teaching; and fifth, a hearing that produces good thoughts.",
        "source": "T37n1758_002:0340b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即初也。",
        "translation": "This is the first.",
        "source": "T37n1758_002:0340b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次者，復重也，次以次反復徵問，故云復次。",
        "translation": "\"Furthermore\" means \"repeatedly,\" and it's called \"repeatedly\" because it asks the question repeatedly.",
        "source": "T37n1758_002:0340b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國者，即西方常有恒有也。",
        "translation": "\"That country\" means the West is permanent and eternal.",
        "source": "T37n1758_002:0340b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種者，不一故云種種。",
        "translation": "Variety\" means not the same, so it's called various.",
        "source": "T37n1758_002:0340b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奇妙者，奇異也。",
        "translation": "Wonderful\" refers to the bizarre.",
        "source": "T37n1758_002:0340b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙，殊妙希奇也。",
        "translation": "Marvelous, too, is exquisite and rare.",
        "source": "T37n1758_002:0340b20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雜色者，毛色異也。",
        "translation": "Variety refers to differences in hair color.",
        "source": "T37n1758_002:0340b21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「淨土殊勝尚無凡夫，何故飛禽亦生彼國？」",
        "translation": "He asked, \"There are no ordinary people in the distinctive Pure Land, so why are flying creatures born in that country?\"",
        "source": "T37n1758_002:0340b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「彌陀變化而有靈禽，讚利法音莊嚴國界。",
        "translation": "A: \"Amitâbha transforms into a spiritual bird that praises the benefit of the Dharma voice and adorns the country's realm.",
        "source": "T37n1758_002:0340b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故下經云：欲令法音宣流變化所作。」",
        "translation": "That's why the following sūtra says, 'I want the Dharma voice to be proclaimed and produced by transformation.'",
        "source": "T37n1758_002:0340b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「白鶴、孔雀、鸚鵡、舍利、迦陵頻伽、共命之鳥」。",
        "translation": "The sūtra says, \"A crane, a peacock, a parrot, a Śāriputra, a kalaviṅka, and a bird of common life.\"",
        "source": "T37n1758_002:0340b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二別列名字也。",
        "translation": "He said, \"The second one is a bird with a separate name.",
        "source": "T37n1758_002:0340b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白鶴者，丹朱作頂、霜雪為毛，鳴之則聲振九皋、舞之則雅和八節，逈異諸鳥，故云白鶴。",
        "translation": "The white crane, with its dainty vermilion head and frost and snow for its fur, sings, making a noise that rattles the nine heights, dances, and harmonizes with the eight rhythms, is quite different from other birds, so it's called a white crane.",
        "source": "T37n1758_002:0340b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孔雀者，天生靈鳥逈異凡禽，頂戴綠冠身嚴眾彩，故云孔雀。",
        "translation": "The peacock is a naturally born spiritual bird that's quite different from ordinary birds and wears a green crown on its head and adorns its body with many colors, so it's called a peacock.",
        "source": "T37n1758_002:0340b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鸚鵡者，毛嚴翡翠觜飾朱紅，羽輕俊以能飛，舌纖長而解語，故云鸚鵡。",
        "translation": "The parrot has emerald hair and vermilion colored noses, handsome feathers that enable it to fly, and a long, slender tongue that makes it understand speech; therefore, it's called a parrot.",
        "source": "T37n1758_002:0340b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利者梵語，此云鶖鷺鳥也，幼而且俊，俊而又靈，斯項而萬里飛騰、增妙而千般音韻。",
        "translation": "Śāriputra is the Sanskrit word for a bird like the heron, which is young and handsome, handsome and nimble, with a head that soars for miles and a tongue that makes a thousand sounds.",
        "source": "T37n1758_002:0340c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦陵頻伽者，此云妙音鳥，音聲美妙身體殊常，聞之者側耳傾心，見之者怡神悅思，妙音鳥也。",
        "translation": "Kaliṅga, also known as the marvelous-sounding bird, has a wonderful voice and an extraordinary body that inclines the ears of those who hear it and delights the mind of those who see it.",
        "source": "T37n1758_002:0340c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共命者亦云命命，美音演法迅羽輕飛，人面禽形一身兩首，故云共命也。",
        "translation": "Shared life is also called life, because it's a beautiful voice that performs Dharma, flies swiftly with feathers, and has a human-faced bird form with two heads, so it's called shared life.",
        "source": "T37n1758_002:0340c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「是諸眾鳥晝夜六時出和雅音」。",
        "translation": "The sūtras say, \"These birds emit harmonious sounds at six times of the day and night.\"",
        "source": "T37n1758_002:0340c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三傳和雅韻也。",
        "translation": "They say, 'The third transmission also harmonizes with the elegant sounds.'",
        "source": "T37n1758_002:0340c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晝夜六時者，晝夜各有六時，共十二時也。",
        "translation": "The six hours of the day and six hours of the night refer to the six hours of the day and the twelve hours of the night.",
        "source": "T37n1758_002:0340c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出和雅音者，和即柔和，雅妙音韻。",
        "translation": "That produces a harmonious sound, which is a gentle, elegant sound.",
        "source": "T37n1758_002:0340c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西方靈鳥不並凡禽，音韻柔和言詞雅妙，故云出和雅音也。",
        "translation": "The spiritual birds of the West are not like ordinary birds, but their sounds and sounds are gentle and their words are elegant, so they produce harmonious sounds.",
        "source": "T37n1758_002:0340c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「其音演暢五根、五力、七菩提、八聖道分如是等法」。",
        "translation": "The sūtras say, \"Their sounds convey the five faculties, five powers, seven bodhisattvas, and eight noble factors of the path, such as these.\"",
        "source": "T37n1758_002:0340c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第四詮顯法音也。",
        "translation": "He said, \"The fourth expression also reveals the sound of the Dharma.",
        "source": "T37n1758_002:0340c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "演暢者，演者水流不絕之貌，暢者宣暢。",
        "translation": "'Emitting' means to emit in the form of an uninterrupted flow of water, and 'emitting' means to proclaim smoothly.",
        "source": "T37n1758_002:0340c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五根等者，三十七菩提分法，經中闕四念住、四正勤、四神足也；下有等言，等此三位。",
        "translation": "The five faculties and so forth refers to the thirty-seven factors of enlightenment, but the sūtras lack the four abodes of mindfulness, the four correct endeavors, and the four miraculous abilities; the following three are equal in number.",
        "source": "T37n1758_002:0340c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今釋此法略為七位：一、四念住，謂身、受、心、法，以慧為體，謂由念力慧於境住。",
        "translation": "We'll now explain these teachings by summarizing them into seven stages: 1. The four abodes of mindfulness, which are the body, feelings, mind, and principles, are embodied in wisdom, which is the abiding in objects by the power of mindfulness and wisdom.",
        "source": "T37n1758_002:0340c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二、四正斷，謂律儀斷、斷斷、防護斷、修習斷，以精進為體，精進起用能修斷故。",
        "translation": "The four abodes of mindfulness, which are the abiding of discipline, the abiding of cessation, the abiding of protection, and the abiding of cultivation, are embodied in effort, which produces the function of cultivating cessation.",
        "source": "T37n1758_002:0340c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三、四神足，謂欲、勤、心、觀，以定為體，為此四種而修定故。",
        "translation": "The four spiritual abilities, which are desire, effort, mind, and contemplation, are embodied in concentration, and it's for these four kinds of concentration that they're cultivated.",
        "source": "T37n1758_002:0340c21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四、五根，謂信、進、念、定、慧，如名以為五體，出生善故。",
        "translation": "The five faculties, which are faith, effort, mindfulness, concentration, and wisdom, are named as the five essences, which produce goodness.",
        "source": "T37n1758_002:0340c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五、五力，體即五根，難屈伏故，離根別立。",
        "translation": "The five powers, the essence of which are the five faculties, are established separately from the faculties because they are difficult to subdue.",
        "source": "T37n1758_002:0340c24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六、七覺支，謂擇法覺支、精進、喜、念、定、捨、輕安。",
        "translation": "The seven factors of awakening are the factors of awakening to discriminate qualities, effort, joy, mindfulness, concentration, equanimity, and pliancy.",
        "source": "T37n1758_002:0340c25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三是別境：擇法、念、定；三是善數：勤、捨、輕安；一是遍行，謂喜。",
        "translation": "Three are specific objects: discriminating qualities, mindfulness, and concentration; three are good factors: effort, equanimity, and pliancy; and one is the pervasive practice of joy.",
        "source": "T37n1758_002:0340c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七、八聖道分，謂正見、正思惟、正語、正業、正定、正命、正念、正精進。",
        "translation": "The eightfold noble path is defined as right view, right contemplation, right speech, right action, right concentration, right livelihood, right mindfulness, and right effort.",
        "source": "T37n1758_002:0340c27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其正思惟體以慧為性，能發語言通佛有故。",
        "translation": "The essence of right contemplation is based on wisdom as its nature, which can give rise to speech that communicates the Buddha's existence.",
        "source": "T37n1758_002:0340c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正語、正業以無瞋癡所發身語為體，無貪所發名為正命，離五邪命俱以無表色思為體，餘如自名。",
        "translation": "Right speech and right action have as their essence the physical speech that arises from the absence of anger and delusion, and the life that arises from the absence of craving is called right livelihood, which is free of the five wrong kinds of livelihood and has as its essence the contemplation of form without expression, and the rest are as they're called.",
        "source": "T37n1758_002:0340c29_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十七種合體有九：一慧、二精進、三定、四信、五念、六喜、七捨、八輕安、九無表色。",
        "translation": "There are nine of the thirty-seven combined essences: one wisdom, two effort, three concentration, four faith, five mindfulness, six joy, seven equanimity, eight pliancy, and nine unexpressed form.",
        "source": "T37n1758_002:0341a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遍行有一，謂喜；別境有三，謂念、定、慧；善有四，謂信、勤、捨、輕安；色法有一，謂無表色。",
        "translation": "There's one pervasive practice, which is joy; three specific objects, which are mindfulness, concentration, and wisdom; four good qualities, which are faith, diligence, equanimity, and pliancy; and one form, which is unexpressed form.",
        "source": "T37n1758_002:0341a04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提所修與聲聞異，故菩提分名菩薩法。",
        "translation": "What's cultivated in bodhi is different from what's cultivated by the śrāvakas, so the factors of bodhi are called bodhisattva dharmas.",
        "source": "T37n1758_002:0341a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等法者，上等根、力、覺、道，下等念、斷、神足，故云如是等法。",
        "translation": "Such-and-such are the higher qualities of faculties, powers, awakening, and the path, and the lower qualities of mindfulness, cessation, and spiritual abilities.",
        "source": "T37n1758_002:0341a07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或可等者謂六度萬行等法；不爾，餘法何故不演也？",
        "translation": "Those who may be equal are those who practice the six perfections and myriad practices; if that's not the case, why aren't the other teachings explained?",
        "source": "T37n1758_002:0341a09_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「其土眾生聞是音已，皆悉念佛、念法、念僧」。",
        "translation": "The sūtra says, \"After the sentient beings in their land hear this sound, they all become mindful of the Buddha, Dharma, and Saṃgha.\"",
        "source": "T37n1758_002:0341a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第五聞興善念念三寶也。",
        "translation": "They say, 'The fifth one hears and produces a good mindfulness of the Three Treasures.'",
        "source": "T37n1758_002:0341a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛義如前。",
        "translation": "The Buddha's meaning is as before.",
        "source": "T37n1758_002:0341a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法者梵語達摩，此翻云法，法即執持物解也，謂即四諦、十二因緣、六度。",
        "translation": "Dharma is the Sanskrit word dharma, which is translated as dharma, and dharma is the understanding of things that are held, which are the four truths, the twelve causes and conditions, and the six perfections.",
        "source": "T37n1758_002:0341a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧者梵云僧伽，此名為眾，和合義也，謂身和共住、語和無諍、意和無違、戒和同修、見和同止、利和同均，具此六和故名僧也。",
        "translation": "\"Saṃgha\" is the Sanskrit word saṃgha, which is called the congregation, meaning it's harmonious in body and dwelling together, peaceful in speech and no disputation, peaceful in thought and no disagreement, harmonious in cultivation of precepts, harmonious in stilling views, and harmonious in sharing benefits.",
        "source": "T37n1758_002:0341a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆可重故名為三寶。",
        "translation": "Because they can all be revered, they're called the Three Treasures.",
        "source": "T37n1758_002:0341a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鳥傳妙法、人發勝心，念三寶之芳名、消百生之障累。",
        "translation": "The birds transmit the wonderful Dharma, and people arouse a superior mind that recalls the names of the Three Treasures and removes the hindrances and burdens of a hundred lifetimes.",
        "source": "T37n1758_002:0341a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「靈禽演法數目頗多，眾念名一何微妙尠？」",
        "translation": "Q: \"There are quite a few spiritual birds that teach the Dharma, but what's the subtlety of chanting one name?\"",
        "source": "T37n1758_002:0341a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「禽傳廣法表詞說之無窮，人念三名綰眾善而俱盡。」",
        "translation": "Answer: \"A bird transmits a broad statement of the Dharma that has no limit, and people remember that the three scriptures are extensive and exhaust all goodness.\"",
        "source": "T37n1758_002:0341a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0341a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝勿謂此鳥實是罪報所生」。",
        "translation": "Don't say that this bird is really born from the retribution of sins.\"",
        "source": "T37n1758_002:0341a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二去疑執。",
        "translation": "Zan'an: The second removes the attachment to doubt.",
        "source": "T37n1758_002:0341a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為五：一、遮非實報；二、徵問因由；三、答無三趣之名；四、通無惡道之字；五、正辨化現之情。",
        "translation": "The text is divided into five parts: 1. denying the true reward; 2. confronting the cause; 3. answering the question about the absence of the names of the three destinies; 4. using the words for the absence of evil destinies; and 5. correctly identifying the feelings that are manifested by transformation.",
        "source": "T37n1758_002:0341a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初也。",
        "translation": "This is the first.",
        "source": "T37n1758_002:0341a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝者，呼於弟子故云汝。",
        "translation": "You, it's called you because you're calling on a disciple.",
        "source": "T37n1758_002:0341a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿，由莫也，莫謂此等靈鳥等實是罪報惡業所生。",
        "translation": "'Don't,' it means 'don't,' because don't say that these spiritual birds and so forth are really born from the results of bad actions.",
        "source": "T37n1758_002:0341a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞說靈禽恐生滯惑，謂淨土之惡緣未息，令一會而勝意不生，所以遮云勿謂此鳥實是罪報所生。",
        "translation": "When you hear that a spiritual bird is afraid of getting stuck in delusion, you say that the evil conditions of the Pure Land haven't stopped yet, so your resolve to meet them once won't arise, which is why you say, \"Don't say this bird is really born from the results of sin.",
        "source": "T37n1758_002:0341a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「所以者何」。",
        "translation": "The sūtra says, \"Why is that?\"",
        "source": "T37n1758_002:0341b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二徵問因由。",
        "translation": "He said, \"The second question asks about the cause.",
        "source": "T37n1758_002:0341b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者，何由義非是實報？",
        "translation": "Why, then, is the meaning not real retribution?",
        "source": "T37n1758_002:0341b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因由者，何謂也。",
        "translation": "\"Cause? What's the meaning of this?",
        "source": "T37n1758_002:0341b02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「彼佛國土無三惡趣」。",
        "translation": "The sūtras say, 'There are no three bad destinies in that Buddha's land.'",
        "source": "T37n1758_002:0341b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三答無三惡之名。",
        "translation": "He replied, \"The third answer is that there are no names for the three evil destinies.",
        "source": "T37n1758_002:0341b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三惡趣者，即地獄、餓鬼、畜生也。",
        "translation": "The three evil destinies are hell, hungry ghosts, and animals.",
        "source": "T37n1758_002:0341b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄者，梵云那落迦，此云苦器，受苦眾生所居器物。",
        "translation": "Hell is the Sanskrit word naraka, which means vessel of suffering, a container in which suffering beings reside.",
        "source": "T37n1758_002:0341b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餓鬼者，多諸恐怕，久受飢虛，故名飢鬼也。",
        "translation": "A hungry ghost is feared to be full of people who have suffered from hunger and deficiency for a long time, so he's called a hungry ghost.",
        "source": "T37n1758_002:0341b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畜生者，或云刃六反、或云希六反，人之畜養故。",
        "translation": "'Animal being' is sometimes called the six counter-arguments to the sword or the six counter-arguments to the hope that it'll become a human animal.",
        "source": "T37n1758_002:0341b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或云傍生，造業傍故，受報亦傍，因便令辨六趣，廣有章門，如別處說。",
        "translation": "Some say it's an animal birth, which is the result of creating karma that's external and receiving retribution that's also external, which makes it possible to discern the six destinies and has extensive categories as explained elsewhere.",
        "source": "T37n1758_002:0341b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「有何所以惡道俱無？」",
        "translation": "Q: \"What is the reason why the evil destinies are both nonexistent?\"",
        "source": "T37n1758_002:0341b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「生居淨土善業緣深，永除異類之身，盡是同生之眾，只如天宮勝境，尚須善業所招，極樂殊方，豈有惡因能往也。",
        "translation": "Answer: \"When they're born and reside in the Pure Land, the conditions of good actions are so deep that they permanently remove bodies of different kinds and exhaust the multitude of people who are born together, just as in the heavenly palace, which is a wonderful place, yet good actions are required to bring about the ultimate bliss, so how could there be bad causes to go there?",
        "source": "T37n1758_002:0341b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況彼尊發願言：『設我得佛，國中有三惡趣者，不取正覺。』",
        "translation": "That's even more so when the venerable gives rise to the vow, saying, 'Suppose I were to become a buddha and there were people in the three bad destinies in my country who wouldn't attain right awakening.'",
        "source": "T37n1758_002:0341b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知無也。」",
        "translation": "Therefore, you know there are none.\"",
        "source": "T37n1758_002:0341b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0341b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛國土尚無三惡趣之名，何況有實」。",
        "translation": "The Buddha's land doesn't yet have the names of the three evil destinies, so how could there be any real ones?\"",
        "source": "T37n1758_002:0341b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第四通無惡道之名字。",
        "translation": "They say, 'The fourth has no names for the evil destinies.",
        "source": "T37n1758_002:0341b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名字猶無，何況實有禽類之質！",
        "translation": "Their names are still nonexistent, so how could there really be the substance of animals?",
        "source": "T37n1758_002:0341b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「是諸眾鳥，皆是阿彌陀佛欲令法音宣流，變化所作」。",
        "translation": "The sūtra says, \"All these birds are created by Amitâbha's desire to make the Dharma voice flow and change.\"",
        "source": "T37n1758_002:0341b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第五正辨化現之情。",
        "translation": "Zan'an said, \"The fifth correctly identifies the feelings of the manifestation.",
        "source": "T37n1758_002:0341b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當初眾會各有疑心，既非實報之身，此等因何而有引？",
        "translation": "In the beginning, the congregation had doubts about what caused these to come into existence since they weren't really the body of Buddha's retribution.",
        "source": "T37n1758_002:0341b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一段經文答也。",
        "translation": "This passage of the sūtra also answers that question.",
        "source": "T37n1758_002:0341b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「彌陀神力廣變佛身，覩相好以發心、聽梵音而悟道，何故作諸禽類顯發教門？」",
        "translation": "Q: \"Amitâbha's miraculous power transforms the Buddha's body in a wide range of ways; seeing his appearance gives rise to his mind; hearing the voice of the Brahma makes him awaken to the Way; why do you create all these birds and men to reveal the teaching?\"",
        "source": "T37n1758_002:0341b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「化身為佛未是希奇，乃現靈禽，令生窂遇，發難遭之勝想、生殊特之信心，化現多途何足為難？",
        "translation": "Answer: \"It's not rare to see a transformation body become a buddha, but to manifest a spiritual bird and cause it to give rise to the superior notion of being difficult to encounter and to give rise to exceptional faith, so why should it be difficult to manifest many paths?",
        "source": "T37n1758_002:0341b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況隨類化身處處皆說，瓊林寶網皆演法音，流水清風盡談真教，有斯所以乃現靈禽也！」",
        "translation": "Furthermore, following the various transformation bodies, the Dharma voice is heard everywhere, the jeweled net of the jeweled forest is pronounced, and the true teaching is discussed in detail in the clear flowing water, which is why this is the appearance of the spiritual bird!\"",
        "source": "T37n1758_002:0341b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The scripture says, \"Śāriputra!",
        "source": "T37n1758_002:0341b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛國微風吹動諸寶行樹及寶羅網，出微妙音，譬如百千種樂同時俱作」。",
        "translation": "A gentle breeze blows the jeweled rows of trees and the jeweled crow's nets in that Buddha land, producing a subtle sound like a hundred thousand kinds of music at the same time.\"",
        "source": "T37n1758_002:0341b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第八風吹樂音也。",
        "translation": "He said, \"The eighth breeze blows musical sounds.",
        "source": "T37n1758_002:0341b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為四：一、風搖寶樹；二、聲似樂音；三、聞興善念；四、結成莊嚴。",
        "translation": "The text is divided into four parts: 1. the wind shakes the jeweled trees; 2. the sound resembles musical music; 3. the hearing produces good thoughts; and 4. the formation of adornments.",
        "source": "T37n1758_002:0341c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初二文也。",
        "translation": "These are the first two phrases.",
        "source": "T37n1758_002:0341c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "微風者，細風也，非猝暴風也，吹樹及網羅即發微妙音韻。",
        "translation": "A gentle breeze is a fine breeze, not a sudden violent breeze, that blows on a tree or a net to produce a subtle sound.",
        "source": "T37n1758_002:0341c03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如者，譬者況也，如由似也，況似於百千種音樂同時俱奏也。",
        "translation": "It's like, 'Like,' which is an example, and it's like what's caused by seeming, which is like a hundred thousand kinds of music playing at the same time.",
        "source": "T37n1758_002:0341c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "細風徐起吹樹網羅，音韻而遍滿十方，雅妙而便同眾樂，故云譬如百千種樂同時俱作也。",
        "translation": "When a gentle breeze rises and blows a tree or a net, the sound fills the ten directions, and it's elegant and effective in creating a multitude of music, so it's like a hundred thousand kinds of music being played at the same time.",
        "source": "T37n1758_002:0341c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「聞是音者，皆自然生念佛、念法、念僧之心」。",
        "translation": "The sūtra says, \"When people hear this sound, they'll naturally become mindful of the Buddha, Dharma, and Saṃgha.\"",
        "source": "T37n1758_002:0341c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三聞興善念也。",
        "translation": "He says, 'The third thing he hears is that it produces good mindfulness.'",
        "source": "T37n1758_002:0341c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自然者，慣習任運名曰自然，非無因緣名自然也。",
        "translation": "Naturally, habituation and freedom of action are called natural, not spontaneous without causes and conditions.",
        "source": "T37n1758_002:0341c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生念佛念法念僧者，三寶之名如前釋也。",
        "translation": "He who gives rise to mindfulness of the Buddha, mindfulness of the Dharma, and mindfulness of the saṃgha is called the name of the Three Treasures as explained above.",
        "source": "T37n1758_002:0341c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛有三：一、心念，心中繫念；二、輕聲念，自耳聞故；三、高聲念，有十種功德：一、能排睡眠；二、天魔驚怖；三、聲遍十方；四三、塗息苦；五、外聲不入；六、心不散亂；七、勇猛精進；八、諸佛歡喜；九、三昧現前；十、往生淨土。",
        "translation": "There are three kinds of mindfulness of the Buddha: 1. mindfulness of the mind, which is bound up in the mind; 2. soft-voice mindfulness, which is heard by the ear; and 3. loud-voice mindfulness, which has ten attributes: 1. it displaces drowsiness; 2. it terrifies Māra; 3. it spreads its sound throughout the ten directions; 4. it stifles suffering; 5. external sounds don't enter; 6. the mind isn't distracted; 7. it's vigorous and diligent; 8. the buddhas are delighted; 9. samādhi is manifested; and 10. one is reborn in the Pure Land.",
        "source": "T37n1758_002:0341c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作四句分別：一、心念口不念；二、口念心不念；三、心口俱念；四、心口俱不念。",
        "translation": "These four phrases should be distinguished: 1. mindfulness of the mind and non-mindfulness of the mouth; 2. mindfulness of the mouth and non-mindfulness of the mind; 3. mindfulness of both the mind and mouth; and 4. non-mindfulness of both the mind and mouth.",
        "source": "T37n1758_002:0341c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四句中第一句、第三句是。",
        "translation": "These four phrases include the first and third phrases.",
        "source": "T37n1758_002:0341c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《瑞相經》云：清風徐起不寒不暑，吹諸羅網及眾寶樹，演發無上微妙法音，其有聞者塵垢不起，自然快樂如得三昧。",
        "translation": "The Ruisheng jing says, \"A brisk breeze rises up, doesn't get cold or hot, and blows on the crow's nets and the many precious trees, producing the unsurpassed, subtle sound of the Dharma, which causes the dust and dirt to rise and naturally makes them happy as if they've attained samādhi.",
        "source": "T37n1758_002:0341c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0341c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛國土成就如是功德莊嚴」。",
        "translation": "Their buddha-lands accomplish such adornments of merit.\"",
        "source": "T37n1758_002:0341c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第四結成極樂莊嚴。",
        "translation": "They say, \"The fourth accomplishment is the adornment of ultimate bliss.",
        "source": "T37n1758_002:0341c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "易知！",
        "translation": "It's easy to know!",
        "source": "T37n1758_002:0341c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The scripture says, \"Śāriputra!",
        "source": "T37n1758_002:0341c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T37n1758_002:0341c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛何故號阿彌陀」。",
        "translation": "Why is that Buddha called Amitâbha?\"",
        "source": "T37n1758_002:0341c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：下第二辨佛身功德也。",
        "translation": "Zan'an said, \"The second below describes the merits of the Buddha's body.",
        "source": "T37n1758_002:0341c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為二：初明化主功德；二辨聽眾功德。",
        "translation": "The text is divided into two: the first describes the merits of the master of transformation; the second identifies the merits of the listening audience.",
        "source": "T37n1758_002:0341c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文分三：初、徵問佛號；二、正辨得名；三、明成佛劫數。",
        "translation": "The first text is divided into three: first, a question about the Buddha's name; second, a correct identification of the name by which he attained it; and third, an explanation of the number of eons since he became Buddha.",
        "source": "T37n1758_002:0341c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初文也，佛自徵也。",
        "translation": "This is the first text, which the Buddha himself used to name.",
        "source": "T37n1758_002:0341c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0341c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛光明無量，照十方國無所障礙，是故號為阿彌陀」。",
        "translation": "That Buddha's light is immeasurable, and it shines without obstruction in ten directions; therefore, it's called Amitâbha.\"",
        "source": "T37n1758_002:0341c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二正辨得名。",
        "translation": "Zan'an: The second correctly describes the attainment of the name.",
        "source": "T37n1758_002:0342a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有二義：一、約光明得名；二、約慧命得名。",
        "translation": "It has two meanings: first, it's called by reference to light; second, it's called by reference to wisdom and life.",
        "source": "T37n1758_002:0342a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即初。",
        "translation": "This is the first.",
        "source": "T37n1758_002:0342a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光有二種：一、內光，即智內照理；二、外光，即身光外照也。",
        "translation": "There are two kinds of light: 1. internal light, which is the principle illuminated by wisdom from within; and 2. external light, which is the external illumination of the body.",
        "source": "T37n1758_002:0342a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即身光也。",
        "translation": "This is the body's radiance.",
        "source": "T37n1758_002:0342a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛不壞之體、無礙解脫之身，如淨瑠璃表裹瑩徹，彼方境物悉現光中，羽之只有一尋，展之動論無量也。",
        "translation": "The indestructible body of the Vajrasamādhi and the body of unhindered liberation are like pure lapis lazuli that's coated and permeated, and all objects in the other direction appear in the light, with only a single discerning feather, and an infinite number of moving discussions when extended.",
        "source": "T37n1758_002:0342a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《無量壽佛經》云：身多光故乃至無量等光，眾生遇彼光者三垢消滅。",
        "translation": "The Sutra of Immeasurable Life says, \"Because his body is so luminous, it has measureless and equal light, and when sentient beings encounter that light, the three defilements are removed.",
        "source": "T37n1758_002:0342a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在三塗見光息苦，壽終之後皆得解脫。",
        "translation": "If they see the light and stop suffering in the three destinies, they'll all attain liberation after their life span ends.",
        "source": "T37n1758_002:0342a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《大論》云：阿彌陀國諸菩薩眾，身之常光照十萬由旬，若是佛光遍照十方世界。",
        "translation": "The Mahāprajñāpāramitā says, \"The constant light of the bodhisattvas of Amitâbha shines for 100,000 leagues, and if this is the Buddha's light, it will shine throughout the world in ten directions.",
        "source": "T37n1758_002:0342a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又《觀經》云：彼佛身如百千萬億夜魔天閻浮檀金色，其身六十萬億那由他恒河沙由旬，眉間白毫右旋宛轉如五須彌山，佛眼如四大海水清白分明，身諸毛孔演出光明如須彌山，其佛圓光如百億三千大千世界，於圓光中有五百萬億那由他恒河沙化佛，一一化佛亦有眾無數化菩薩而為侍者。",
        "translation": "The Avalokitêśvara Sutra also says, \"The Buddha's body is like the golden color of a hundred thousand million Yama heavens and Jambudvīpa, with a body of 60,000,000 nayutas of constant light, white tuft of hair between his eyebrows that twists and turns like five Sumeru mountains, the Buddha's eyes like four large rivers of water that are clear and white, and the pores of his body emitting light like Sumeru mountains, the Buddha's perfect light like ten billion trillion great one-thousand worlds, and in that perfect light there are five hundred thousand million nayutas of constant light that transform into buddhas, each of which also has an infinite number of transformed bodhisattvas serving as attendants.",
        "source": "T37n1758_002:0342a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛有八萬四千相，一一相有八萬四千好，一一好有八萬四千光明，遍照十方無量世界，有此光明故號阿彌陀也。",
        "translation": "That Buddha has 84,000,000 characteristics, each characteristic has 84,000,000 features, and each feature has 84,000,000 lights that illuminate measureless worlds in ten directions, and because of this light he's called Amitâbha.",
        "source": "T37n1758_002:0342a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「光照十方無量世界者，此土人民何以不覩？」",
        "translation": "He asks, \"Why don't the people of this land see that light shining in measureless worlds in ten directions?\"",
        "source": "T37n1758_002:0342a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「道合即千里懸應，世乖則肝膽梵越，如翳者不覩於曦光，豈曦光之有咎！",
        "translation": "Answer: \"When the way is united, a thousand leagues hang in the balance; when the world is divided, liver and liver are transgressed; like a man with a blind spot who doesn't see the light of day, is there anything wrong with the light of day?",
        "source": "T37n1758_002:0342a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "似聾者不聞於雷震，非雷震之有愆！",
        "translation": "It seems that the deaf do not hear the thunderclap, not that the thunderclap is faulty!",
        "source": "T37n1758_002:0342a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生業累增強，佛有光而不見。」",
        "translation": "The accumulation of karma in sentient beings intensifies, and the Buddha has light but doesn't see it.\"",
        "source": "T37n1758_002:0342a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：「又，舍利弗！",
        "translation": "The sūtra says, \"Furthermore, Śāriputra!",
        "source": "T37n1758_002:0342a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛壽命及其人民無量無邊阿僧祇劫，故名阿彌陀」。",
        "translation": "The life of that Buddha and his people is measureless and unlimited for incalculably long eons, so he's called Amitâbha.\"",
        "source": "T37n1758_002:0342a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二答壽命得名。",
        "translation": "He said, \"The second answer is that the life span gets its name.",
        "source": "T37n1758_002:0342a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽命者，第八識上連持功德也，即是不相應行中攝也。",
        "translation": "'Life span' refers to the virtue of the eighth consciousness that's associated with maintenance, which is included in unassociated practices.",
        "source": "T37n1758_002:0342a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量者，無其限量。",
        "translation": "Measureless, there's no limit to it.",
        "source": "T37n1758_002:0342a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無邊者，無彼邊際。",
        "translation": "Limitless, there's no limit to it.",
        "source": "T37n1758_002:0342a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿僧祇劫者，此云無央數劫也。",
        "translation": "incalculable\" means there are countless eons.",
        "source": "T37n1758_002:0342a29_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「彼尊彼眾身屬有為，未逃四相遷移，爭免一期磨滅？」",
        "translation": "Q: \"Are those honored ones or others who are part of the category of sentient beings and haven't escaped the four phases of migration, fighting to avoid one phase of annihilation?\"",
        "source": "T37n1758_002:0342a29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「捨兩重生死、獲五蘊常身，悲願無邊，身命何盡？",
        "translation": "Answer: \"What is the end of body and life when you abandon the two layers of birth and death and attain the eternal body of the five aggregates, for which your compassionate vows know no bounds?",
        "source": "T37n1758_002:0342b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況又殺業久已、壽命延遠也！」",
        "translation": "How much more so when the act of killing is prolonged over a long period of time!\"",
        "source": "T37n1758_002:0342b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「彌陀已居果位，壽命無量可然；人民見處因中，何故亦同彼佛？」",
        "translation": "The question is, \"Amitâbha has already reached the stage of fruition, and his life expectancy is countless; why are the people in the midst of the causes they see, so they are also like that Buddha?\"",
        "source": "T37n1758_002:0342b03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「業累輕尠、善種增強，既非分段之身，永離去來之質，與佛齊等，於理無違。",
        "translation": "Answer: \"Since their karmic accumulation is light and their good seeds are strong, they aren't segmented bodies and are permanently freed from the essence of past and future, so they're on par with the Buddha, which is not inconsistent with the principle.",
        "source": "T37n1758_002:0342b05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《無量壽經》曰：彼佛壽命長遠不可稱計，假使十方世界無量眾生皆成羅漢，共盡思惟百千萬劫不知壽限，菩薩天人壽命亦爾。",
        "translation": "Therefore, the Sutra of Limitless Life says, 'The Buddha's lifespan is so long and indescribable that even if measureless sentient beings in the worlds of the ten directions were to become arhats and contemplate together a hundred million eons without knowing their lifespan, the same would be true for the lifespan of bodhisattvas and gods.'",
        "source": "T37n1758_002:0342b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又《清淨覺經》云：阿彌陀佛欲令十方一切有情之類生其國悉至泥洹，若菩薩者皆令作物，作物已更展轉教化十方之類亦復作佛，作佛已更轉教化一切眾生悉至泥洹，然後涅槃。",
        "translation": "Also, as the Sutra of Pure Enlightenment says, \"Amitâbha wants to cause all sentient beings in ten directions to be born in his country and all reach nirvāṇa, and if a bodhisattva makes them all crop, then after they crop, he'll continue to teach and transform all sentient beings in ten directions to become buddhas as well, and after becoming buddhas, he'll continue to teach and transform all sentient beings to reach nirvāṇa and then nirvāṇa.",
        "source": "T37n1758_002:0342b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是知壽命無量也。」",
        "translation": "This is known to have an immeasurable life span.\"",
        "source": "T37n1758_002:0342b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「彼國人民者，為是分段、為是變易？」",
        "translation": "Q: \"Are the people of that country segmented or changing?\"",
        "source": "T37n1758_002:0342b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「若論報土即便變易之身，若說化淨國中分段尚猶未捨。」",
        "translation": "A: \"If we talk about the reward land, even though it's a body that changes, we can say that the segments in the transformation and purification countries have yet to be abandoned.\"",
        "source": "T37n1758_002:0342b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「彼佛壽命長遠，此經自明，未審成作佛已來至此於今幾劫？」",
        "translation": "Q: \"The long lifespan of that Buddha is explained in this sūtra, but how many eons have passed since he became a buddha and how long has he been here?\"",
        "source": "T37n1758_002:0342b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The scripture says, \"Śāriputra!",
        "source": "T37n1758_002:0342b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀佛成佛已來於今十劫」。",
        "translation": "It's been ten eons since Amitâbha became buddha.\"",
        "source": "T37n1758_002:0342b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三明成佛劫數。",
        "translation": "Zan'an said, \"Third, we'll explain the number of eons since the Buddha's attainment of Buddhahood.",
        "source": "T37n1758_002:0342b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「又，舍利弗！",
        "translation": "The sūtra says, \"Furthermore, Śāriputra!",
        "source": "T37n1758_002:0342b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛有無量無邊聲聞弟子，皆是阿羅漢，非是算數之所能知；諸菩薩眾亦復如是」。",
        "translation": "Those buddhas have measureless and limitless disciples of śrāvakas who are arhats and can't be known by calculation, and so do the bodhisattva congregations.\"",
        "source": "T37n1758_002:0342b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二辨聽眾功德。",
        "translation": "Zan'an: Second, we'll discuss the merits of listening to the multitude.",
        "source": "T37n1758_002:0342b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為四：初、小大兩眾算數無邊；二、新舊二徒因行有異；三、勸生彼國；四、勸生利益。",
        "translation": "The text is divided into four parts: first, the small and large crowds are counted as limitless; second, there are differences in the causal practices of the old and new disciples; third, they are encouraged to be born in that country; and fourth, they are encouraged to produce benefits.",
        "source": "T37n1758_002:0342b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初分二：初辨眾多少、二結成莊嚴。",
        "translation": "The first of these is divided into two: the first identifies the number of multitudes, and the second concludes with adornment.",
        "source": "T37n1758_002:0342b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初也。",
        "translation": "This is the first.",
        "source": "T37n1758_002:0342b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞弟子者，因聲悟道，故曰聲聞。",
        "translation": "A śrāvaka disciple is someone who awakens to the path because of sound, so he's called a śrāvaka.",
        "source": "T37n1758_002:0342b25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子者，長在我後名弟，解從我生名子。",
        "translation": "A disciple is called a disciple because he's long after me, and a son because he understands that he's born from me.",
        "source": "T37n1758_002:0342b26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆阿羅漢者，揀前三果故也。",
        "translation": "They're all arhats, which is why they choose the first three fruits.",
        "source": "T37n1758_002:0342b27_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非算數之所知者，算數之不及故。",
        "translation": "They aren't known by arithmetic, because arithmetic doesn't reach them.",
        "source": "T37n1758_002:0342b27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩亦如是者，亦同聲聞算之不及。",
        "translation": "A bodhisattva who does the same is the same as a śrāvaka who doesn't measure up.",
        "source": "T37n1758_002:0342b28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「濁世眾生業重難化，教說三乘；淨土人眾信深易勸，何言四果？」",
        "translation": "Q: \"It's difficult to teach the three vehicles because of the heavy karma of sentient beings in the turbid world, but the faith of the Pure Land people is profound and easy to encourage, so why do you talk about the four fruits?\"",
        "source": "T37n1758_002:0342b29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「有二意：一、欲明化澤被淺深故，五逆十念亦生其國；二、顯莊嚴眷屬故、多眾圍繞故，雖是淨土亦有聲聞也。",
        "translation": "Answer: \"There are two meanings: first, to show that the five heinous crimes and ten invocations are born in a country because the transformation swamp is so shallow and deep, and second, to show that there are śrāvakas who are surrounded by ornate retinues and many people even though it's a pure land.",
        "source": "T37n1758_002:0342c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《法華經》云：彼佛出時雖非惡世，以本願故亦說三乘。",
        "translation": "Therefore, the Lotus Sutra says, \"Even though that Buddha wasn't of a bad world when he left, he taught the three vehicles because of his original vows.",
        "source": "T37n1758_002:0342c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《觀經》云：小乘根者生到彼土得四果也。」",
        "translation": "Therefore, the Contemplation Sutra says, 'Those of lesser vehicle roots who are born in that land will attain the four fruits.'\"",
        "source": "T37n1758_002:0342c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「若論真淨報土，二乘不令得居；若論化現，淨方四果盡皆得往。",
        "translation": "Q: \"If we talk about the truly pure land of reward, the two vehicles aren't allowed to stay there; if we talk about manifestation, all four fruits of the pure land can go there.",
        "source": "T37n1758_002:0342c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故云皆阿羅漢，不說餘三果耶？」",
        "translation": "Why is it said to be all arhats and not the other three realms?\"",
        "source": "T37n1758_002:0342c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「報淨土中聲聞權化，約其殊勝，不說化淨土中四果，皆有加行位中能伏分別得居淨土。",
        "translation": "Answer: \"Regarding the śrāvaka expedient transformation in the Pure Land of Retribution, we don't talk about the four fruits of the Pure Land of Transformation, but rather about the ability to subdue discrimination in the stage of applied practices and attain residence in the Pure Land.",
        "source": "T37n1758_002:0342c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《無量壽經》云：二乘種不生。",
        "translation": "The Sutra of Immeasurable Life says, 'The seeds of the two vehicles aren't produced.",
        "source": "T37n1758_002:0342c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約報土。」",
        "translation": "It's called the land of retribution.\"",
        "source": "T37n1758_002:0342c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0342c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛國土成就如是功德莊嚴」。",
        "translation": "Their buddha land accomplishes such adornments of merit.\"",
        "source": "T37n1758_002:0342c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二結成莊嚴也。",
        "translation": "He said, \"So is the second accomplishment of adornment.",
        "source": "T37n1758_002:0342c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「又，舍利弗！",
        "translation": "The sūtra says, \"Furthermore, Śāriputra!",
        "source": "T37n1758_002:0342c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土眾生生者皆是阿鞞跋致」。",
        "translation": "All the sentient beings in the land of ultimate bliss who are born are avaivartika.\"",
        "source": "T37n1758_002:0342c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二新舊二徒因行有異。",
        "translation": "He said, \"Second, there are differences in the causes and practices of the old and new disciples.",
        "source": "T37n1758_002:0342c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分為二：初新生不退眾、二補處位高眾。",
        "translation": "The text is divided into two: the first is a group of newborn nonretrogressors, and the second is a group of people in a higher position of remediation.",
        "source": "T37n1758_002:0342c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此初也。",
        "translation": "This is the first.",
        "source": "T37n1758_002:0342c16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿鞞跋致，或云阿惟越致，是梵語，此云不退轉。",
        "translation": "\"Abhidharma, or abhidharma, is a Sanskrit word that's called nonretrogression.",
        "source": "T37n1758_002:0342c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不退有五：一、信不退；二、位不退；三、證不退；四、行不退；五、煩惱不退，不被煩惱所退轉故。",
        "translation": "There are five kinds of nonretrogression: 1. nonretrogression in faith; 2. nonretrogression in status; 3. nonretrogression in realization; 4. nonretrogression in practice; and 5. nonretrogression in affliction, because they aren't held back by affliction.",
        "source": "T37n1758_002:0342c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「生居淨土何故不退？」",
        "translation": "Q: \"How is it that you don't regress when you're born and stay in the Pure Land?\"",
        "source": "T37n1758_002:0342c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「無五退緣故：一、無病苦纏故；二、無違行故；三、常誦經法；四、常營善事；五、長和順無諸違諍事，所以不退。",
        "translation": "Answer: \"There are no five causes for regression: 1. because they aren't tethered by illness or pain; 2. because they have no contrary behavior; 3. because they always recite the sūtras and teachings; 4. because they always perform good works; and 5. because they are long and harmonious without any disagreements, they don't regress.",
        "source": "T37n1758_002:0342c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此界人多退，反此應知。",
        "translation": "People in this realm often regress, and this should be understood in reverse.",
        "source": "T37n1758_002:0342c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又有欲境所牽，多諸退屈也。」",
        "translation": "They're also pulled by objects of desire, which often cause them to regress.\"",
        "source": "T37n1758_002:0342c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「其中多有一處補處其數甚多，非是算數所能知之，但可以無量無邊阿僧祇劫說」。",
        "translation": "The sūtras say, \"Among them, there's often one remedial place, which is too numerous to be known by calculation but can be explained in terms of measureless and limitless incalculable eons.\"",
        "source": "T37n1758_002:0342c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第二補處位高眾。",
        "translation": "They say, 'The second place of remediation is a place of great variety.'",
        "source": "T37n1758_002:0342c25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一生補處者，補者補闕，處者處所，此等菩薩因圓十地、劫滿三祇，盡此一生便成正覺，故云一生補處也，餘經文易見故。",
        "translation": "These bodhisattvas complete the ten stages and fill three eons, and then they become perfectly enlightened after finishing this lifetime, so it's called a lifetime in a position of redundancy.",
        "source": "T37n1758_002:0342c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "只如彌勒現居天界當來果成，一生補大覺之尊、三會度無量之眾，即是此類。",
        "translation": "It's just like Maitreya, who now resides in the heavenly realm and will attain future fruition in his lifetime, making up for the honored one of great awakening and taming measureless multitudes in his three assemblies, which is the same sort of thing.",
        "source": "T37n1758_002:0342c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《無量壽經》云：設我得佛，他方國土諸菩薩眾來生我國，究竟各到一生補處。",
        "translation": "That's why the Sutra of Limitless Life says, \"Suppose I were to become a buddha and a multitude of bodhisattvas from lands in other directions were to be born in our country, and each would ultimately arrive at the place of a lifetime's compensation.",
        "source": "T37n1758_002:0343a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以本願力故，生彼即入補處之位。",
        "translation": "Because of the power of their original vow, birth there will be entry into the position of the complementary place.",
        "source": "T37n1758_002:0343a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0343a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生聞者應當發願願生彼國」。",
        "translation": "All sentient beings who hear this should make the vow to be born in that country.\"",
        "source": "T37n1758_002:0343a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第三勸生彼國。",
        "translation": "He said, \"Third, I encourage them to be born in that country.",
        "source": "T37n1758_002:0343a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現在未來一切眾生聞我向來說者，應當發願願生彼國。",
        "translation": "Now, all future sentient beings who hear what I've told them should make the vow to be born in that country.",
        "source": "T37n1758_002:0343a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「慈氏天宮快樂不少、勝侶頗多，何須堅勸往彼西方？」",
        "translation": "He asked, \"Why is it necessary to insist on being encouraged to go to the West when there's so much joy and so many wonderful companions in the palace of Maitreya?\"",
        "source": "T37n1758_002:0343a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「若論兜率即勝人間，乃並西方全成微劣，勝劣既異，彼此各殊，勸生西方捨劣求勝也。",
        "translation": "Answer: \"If we say that Tuṣita is superior to the human race, then the West is completely inferior, and since superior and inferior are different and distinct from each other, we encourage birth in the West to abandon the inferior and seek superiority.",
        "source": "T37n1758_002:0343a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝劣有異者，淨土十勝、天宮十劣。",
        "translation": "When there's a difference between superior and inferior, there are ten superior Pure Land [lands] and ten inferior Heavenly Palaces.",
        "source": "T37n1758_002:0343a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨土十勝者：一、化主所居勝；二、所化命長勝；三、國非界繫勝；四、淨方無欲勝；五、女子不居勝；六、修行不退勝；七、淨方非穢勝；八、國土莊嚴勝；九、念佛攝情勝；十、十念往生勝。",
        "translation": "The ten superiorities of the Pure Land are: 1. superior in the abode of the master of transformation; 2. superior in the long life of the transformation; 3. superior in the state not being bound to a border; 4. superior in the lack of desire in the pure land; 5. superior in the non-abode of women; 6. superior in the cultivation of nonretrogression; 7. superior in the lack of defilement in the pure land; 8. superior in the adornment of the land; 9. superior in the mindfulness of the Buddha and the gathering of sentient beings; and 10. superior in the ten recollections of rebirth in the Pure Land.",
        "source": "T37n1758_002:0343a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天宮十劣者：一、所居國土劣；二、所化壽役劣；三、界繫攝屬劣；四、彼天有欲劣；五、男女雜居劣；六、修行有退劣；七、穢方非淨劣；八、國土莊嚴劣；九、善念攝情劣；十、修行勞苦劣。",
        "translation": "The ten inferiorities of the celestial palace are: 1. inferior in the land they live in; 2. inferior in the life span they're trained to lead; 3. inferior in the subordination to the realms; 4. inferior in the desires of those gods; 5. inferior in the mixed dwelling of men and women; 6. inferior in the retreat from cultivation; 7. inferior in the defiled and impure lands; 8. inferior in the adornment of the land; 9. inferior in the mindfulness of sentient beings; and 10. inferior in the suffering of cultivation.",
        "source": "T37n1758_002:0343a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有斯十勝十劣，所以勸生彼國。」",
        "translation": "Because these are the ten superior and ten inferior qualities, they're encouraged to be born in another country.\"",
        "source": "T37n1758_002:0343a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「所以者何？",
        "translation": "The sūtra says, \"Why is that?",
        "source": "T37n1758_002:0343a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得與如是諸上善人俱會一處」。",
        "translation": "He'll be able to meet with such excellent people in one place.\"",
        "source": "T37n1758_002:0343a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：第四勸生利益。",
        "translation": "He said, \"Fourth, we encourage the growth of benefits.",
        "source": "T37n1758_002:0343a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸上善人者，善者過現益物謂之善，人即前聲聞、不退及補處等菩薩也，俱在西方一會處也。",
        "translation": "'Superior good people' means good people who benefit things in excess of what's present, and they're the former śrāvakas, nonretrogressing bodhisattvas, and those in the patchwork, who are all together in the West in one place.",
        "source": "T37n1758_002:0343a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同師進業必假良緣，朋家作仇事資惡黨，孟母移居於勝處、宣尼不飲於盜泉，蓋恥惡而慕善也。",
        "translation": "Those who further their karma with the same teacher must rely on good causes, while those who go to feud with friends finance evil associates.",
        "source": "T37n1758_002:0343a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慕善則芳蘭襲慶，朋惡則鮑肆葷風也，勸生西方，親之勝侶也。",
        "translation": "When they admire goodness, fragrant orchids will inherit their prosperity, and when they associate with evil, abalones will become a foul wind.",
        "source": "T37n1758_002:0343a26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰：「舍利弗！",
        "translation": "The sūtra says, \"Śāriputra!",
        "source": "T37n1758_002:0343a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可以少善根福德因緣得生彼國」。",
        "translation": "It's not possible to be born in another country with few causes and conditions of good roots and merit.\"",
        "source": "T37n1758_002:0343a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "贊曰：自下第二舉極樂之因殊。",
        "translation": "Zan'an: From the second, we'll discuss the special characteristics of the causes of paradise.",
        "source": "T37n1758_002:0343b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文分五段：一、遮少善；二、說多因；三、聖眾來迎；四、眾生生往；五、結勸往生。",
        "translation": "The text is divided into five sections: 1. covering few good roots; 2. explaining many causes; 3. welcoming the noble multitude; 4. the birth and rebirth of sentient beings; and 5. concluding with an encouragement to be born there.",
        "source": "T37n1758_002:0343b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即初也，不可以微少善根得往殊常淨土。",
        "translation": "This is the first one, which says that it's not possible to go to the extraordinary Pure Land with few good roots.",
        "source": "T37n1758_002:0343b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「十念彌陀頓生淨土，據斯所說果著因微，何故少善因緣不生彼土？」",
        "translation": "Q: \"When the ten invocations of Amitâbha are suddenly born in the Pure Land, according to this explanation the result is attached to a subtle cause, so why aren't the few good causes and conditions born in that land?\"",
        "source": "T37n1758_002:0343b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「十念得生淨土，接引懈怠眾生；却談多善因緣，乃被精進勸學者。",
        "translation": "A: \"Ten invocations of mindfulness obtain birth in the Pure Land and lead lazy sentient beings, but they talk about many good causes and conditions and are encouraged by those who make effort.",
        "source": "T37n1758_002:0343b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或廣或略，理不相違。」",
        "translation": "Whether it's extensive or brief, the principle is not contradictory.\"",
        "source": "T37n1758_002:0343b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說阿彌陀經通贊疏卷中",
        "translation": "Foshuo Amitâbha jing tongzan shou, middle of the volume",
        "source": "T37n1758_002:0343b08_0",
        "is_bad_quality": false
    }
]