[
    {
        "source_sentence": "阿彌陀經義記",
        "translation": "Notes on the Amitâbha Sutra",
        "source": "T37n1755_001:0306a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天台智者大師記",
        "translation": "Record of the Great Master Zhizhe of Tiantai",
        "source": "T37n1755_001:0306a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫至聖垂慈照機應迹，開導六道普濟十方，逐境昇沈隨緣淨穢，斯則善權攝誘引趣菩提。",
        "translation": "\"When the supreme sage bestows compassion, illuminates abilities and responds to manifestations, guides the six destinies to universal relief in ten directions, ascends and descends from object to object, and follows conditions to purify and defile, this is a good way to gather guidance and lead people to bodhi.",
        "source": "T37n1755_001:0306a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故，大覺彌陀昔弘誓力應形極樂現處道場，三輩願生皆入定聚，色像殊勝壽量難思，寶樹天華咸能演法，清風流水俱說妙音，聞唱苦空證無生忍。",
        "translation": "Therefore, when the great enlightened Amitâbha fulfilled his great vow, he was able to respond to the forms and paradise of the present enlightenment, the three groups of vowers all entered the concentration class, his appearance was outstanding, his life span was unfathomable, the jeweled trees and celestial flowers were all capable of expounding the Dharma, and the clear breezes and flowing waters all spoke wonderful sounds, so he heard the singing of suffering and emptiness and realized the patient acceptance of nonarising.",
        "source": "T37n1755_001:0306a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦聖主本願弘深，不捨慈悲，化茲穢境五痛燒然八苦煎逼，廣明誡勸遍洽群品，示其妙術十念往生，四眾奉行依教修觀，說有廣略時處不同，靈鷲宣揚三種淨業，舍衛敷演六方護念。",
        "translation": "The noble lord Śākyamuni's original vows are profound, and he doesn't let go of his compassion to create this defiled environment where the five pains burn and the eight sufferings are severe, to explain in detail and exhort, to universally address all the various categories, to show his marvelous technique of ten mindfulnesses that lead to rebirth, to have the four groups of people follow the teaching and cultivate contemplation, to explain that there are broad and simple teachings that differ from place to place, to have the three pure activities proclaimed by Vulture, and to have six directions safeguarded by Śrīvastī.",
        "source": "T37n1755_001:0306a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「阿彌陀」，天竺梵音，震旦譯言為無量壽，化主極號以立嘉名。",
        "translation": "\"Amitâbha\" is a Sanskrit word from India that's translated from the Zhendan language as \"immeasurable life,\" and the transformation master's epithet is used to establish a commendable name.",
        "source": "T37n1755_001:0306a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「經」者訓常，由聖人口，此即釋尊所說，語西方事，故言經也。",
        "translation": "\"This is called a sūtra because it teaches constancy and comes from the mouth of a sage, which is what the Śākyamuni taught and what he said about the West.",
        "source": "T37n1755_001:0306a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即斯一教，在文雖約、明義實繁，總語西方安養國界。",
        "translation": "This is the single teaching that, though its text is brief, its explanations are really detailed, and it speaks generally of the Western realm of paradise.",
        "source": "T37n1755_001:0306a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一釋名，從人標稱，依教修習往生彼國。",
        "translation": "The first is to explain the name, which is a designation from a person who cultivates according to the teaching to be reborn in that country.",
        "source": "T37n1755_001:0306a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二辨體，法性真如諦心觀察證常樂果。",
        "translation": "The second discerns the essence, which is to examine the true nature of reality with the mind and realize the fruit of permanence and bliss.",
        "source": "T37n1755_001:0306a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三宗致，淨土機緣妙樂莊嚴化像迎攝。",
        "translation": "The third denominator is the objective conditions of the Pure Land, which are beautifully blessed, adorned, and welcomed by images of transformation.",
        "source": "T37n1755_001:0306a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四力用，破除愛見五住塵勞正習俱盡。",
        "translation": "The fourth power and function is to remove the five abodes of craving and views, and to end both the dust and the labor of right habituation.",
        "source": "T37n1755_001:0306a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五教相，帶別挾通生熟醍醐總為教相也。",
        "translation": "The fifth aspect of the teaching is that it brings together the distinctive, raw, ripe, and pure dharmas that are the general aspect of the teaching.",
        "source": "T37n1755_001:0306a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分文三段，序、正、流通。",
        "translation": "The text is divided into three sections: preface, main text, and circulation.",
        "source": "T37n1755_001:0306a24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略無別序，通中具六。",
        "translation": "There's no separate preface, but the general text contains six.",
        "source": "T37n1755_001:0306a24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一「如是」者，決定之辭，大聖觀機，為多瞋者略說深妙，為多貪人廣開祕密，為多無明者處中而說，言不虛發應物逗緣。",
        "translation": "The first one, \"Thus,\" is a determined expression that describes the profundity of a great sage's contemplation of an opportunity, explains the depths and subtleties of much anger, opens up the mysteries of much greed, and explains the middle way for much ignorance, saying that it's not false to respond to things and tease out perceptual objects.",
        "source": "T37n1755_001:0306a25_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我聞」者，如來正法無量無邊，我所得聞猶如微渧；所不聞者，喻大海水。",
        "translation": "\"I've heard\" means that the Tathāgata's right teaching is immeasurable and limitless, and what I've heard is like a tiny drop; what I haven't heard is a metaphor for vast ocean water.",
        "source": "T37n1755_001:0306a28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一時」者，有感斯應，機悟之辰即於會革凡成聖。",
        "translation": "\"One time\" means there's a feeling that's responded to, and the moment of organic enlightenment is when the worldling is liberated and becomes a sage.",
        "source": "T37n1755_001:0306a29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛」者，正標化主，應供遍知，四辯、六通、三明、八解，一音演說隨類聞曉。",
        "translation": "A \"buddha\" is a person who correctly identifies a transformation master, makes offerings, and has omniscience, four eloquence, six supernormal powers, three insights, and eight understandings, and speaks with a single voice to follow types of listeners.",
        "source": "T37n1755_001:0306b01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「在舍衛國」者，名聞物，多有名賢，又饒珍寶，覺徒商侶諸國共臻，復名為無物不有。",
        "translation": "\"In Śrāvastī,\" he's known and heard for many famous and virtuous things, and he produces treasures that are shared by the Buddhists, merchants, and other countries, and he's also known as having nothing that doesn't exist.",
        "source": "T37n1755_001:0306b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「祇樹給孤獨園」者，祇陀捨樹創起門坊，須達賑貧金布地共立精舍也。",
        "translation": "\"The monk Jeta gives Anāthapiṇḍada's Park,\" which is the Jetavana tree that creates a gatehouse, and Sudarśana gives poor people gold to spread out on the ground to build a monastery together.",
        "source": "T37n1755_001:0306b05_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「與大比丘僧」者，大義三種，天王大人所敬故言為大，遍知內外經教是故言多，超九十五上故名為勝。",
        "translation": "The expression \"with a large assembly of monks\" has three meanings: great because it's honored by the king of gods and lords, numerous because it has thorough knowledge of internal and external sūtras and teachings, and superior because it transcends the 95 superiors.",
        "source": "T37n1755_001:0306b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘者此言除饉，在因三義：乞士、怖魔、破惡，果地三德：應供、殺賊、不生。",
        "translation": "A monk is said to be free of want, which has three meanings in the cause: begging a man, fearing Māra, and refuting evil, and three virtues in the result realm: worthy of offerings, killing thieves, and not being born.",
        "source": "T37n1755_001:0306b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧者，四人已上和合羯磨，事理無隔匡維正教。",
        "translation": "A monk is a group of four or more people who harmonize, perform tasks and maintain the correct teaching without distinctions in principle.",
        "source": "T37n1755_001:0306b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「千二百五十人俱」者，三迦葉眾共有一千，舍利、目連二百五十，常隨聖尊為證信眾，長老舍利弗智慧上首，翻鶖鷺子；大目揵連神力標名，此翻讀誦；摩訶迦葉亦言鉢羅，此翻龜氏，又曰光波；摩訶迦旃延善能清論，此翻扇繩；摩訶俱絺羅辯才無滯，此翻大膝；離波多翻為室宿，亦曰常作聲；周梨槃陀伽此土翻譯曰小路邊生。",
        "translation": "The \"1,250 [members of the assembly]\" refers to the three Kāśyapa groups, which total 1,000, and the 250 from Śāriputra and Maudgalyāyana, who always follow the noble one as a witness and faithful follower.",
        "source": "T37n1755_001:0306b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難陀尊者此翻欣樂，阿難陀者翻善欣悅，羅睺羅者此言障持，憍梵波提譯曰牛跡，賓頭盧頗羅墮翻走閉門，迦留陀夷翻大麁黑，劫賓那翻為房宿，薄拘羅者翻曰善容，阿[少/兔]樓馱翻為如意。",
        "translation": "This is translated as delight by Venerable Nanda, good delight by Ananta, obstruction by Rāhula, cow tracks by Gavāṃpati, shutting the door by Piṇḍolabbaradvāja, great darkness by Kālodāyin, lodging by Kapphiṇa, good bearing by Pokkhara, and wishful thinking by A[less/rabbit] Rudra.",
        "source": "T37n1755_001:0306b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利此翻妙德，阿逸多者翻無三毒，乾陀訶提翻為香意，常精進者此土方言。",
        "translation": "Mañjuśrī translates it as marvelous virtue, Ajita translates it as no three poisons, Gandhahastin translates it as fragrant intent, and Ever Striving is the term used here in this land.",
        "source": "T37n1755_001:0306b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等者，結菩薩眾。",
        "translation": "Such and such are the constituent bodhisattva groups.",
        "source": "T37n1755_001:0306b25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋提桓因翻能天主。",
        "translation": "Śakrodevānām translates it as lord of the gods.",
        "source": "T37n1755_001:0306b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等諸天眾，總結同聞，列眾序竟。",
        "translation": "He summarizes the multitude of gods who have heard the same thing and lists the preface of the multitude.",
        "source": "T37n1755_001:0306b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正說為二：初明彼佛依正二果，次勸物往生。",
        "translation": "The main teaching is divided into two: first, it explains the twofold realization of the Buddha's reliance and directness, and second, it encourages the reborn of all living beings.",
        "source": "T37n1755_001:0306b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初復為二：前標、次釋。",
        "translation": "The first is further divided into two: the first describes the buddha's kingdom and the second explains it.",
        "source": "T37n1755_001:0306b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前標國界，後明化主。",
        "translation": "The first identifies the country and the second explains the transformation master.",
        "source": "T37n1755_001:0306b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經命章對舍利弗，餘經皆有諸主，此經無問自說，十二部中亦不具足無兩種偈，其餘諸部亦不全有。",
        "translation": "This chapter of the sutra's life chapter is addressed to Śāriputra, while the other sutras all have lords.",
        "source": "T37n1755_001:0306b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不對菩薩者，適化無方，欲令凡夫小乘厭此欣彼也。",
        "translation": "It's not addressed to bodhisattvas because it's appropriate for teaching in a variety of ways and is intended to make ordinary adherents of the lesser vehicle disillusioned with this and delight in that.",
        "source": "T37n1755_001:0306c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "標依果中前明近遠。",
        "translation": "The preceding section describes the near and distant in terms of the fruits of reliance.",
        "source": "T37n1755_001:0306c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「從是西方過十萬億佛土有國名極樂」，望賢首猶是下品，但比娑婆故言極樂。",
        "translation": "\"From this, there's a country in the west a hundred thousand million Buddha-lands called 'paradise,' which is called paradise because it looks like Xianshou is still of a lower class but is comparable to sahāsāra.",
        "source": "T37n1755_001:0306c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有三名：極樂對苦，安養從用，無量壽者逐人名國。",
        "translation": "There are three of them: paradise that counteracts suffering, well-being that follows usage, and a land named after a person with an immeasurable life span.",
        "source": "T37n1755_001:0306c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次出正果號阿彌陀，其實有量，以餘人不能稱數，既云觀音補處，下地不知，說無量耳。",
        "translation": "The next one produces the name Amitâbha, which is actually immeasurable because the rest of us can't count it.",
        "source": "T37n1755_001:0306c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼土何故」下，解釋前明依果。",
        "translation": "Under \"Why is it in that land?\" he explains the previously explained result of reliance.",
        "source": "T37n1755_001:0306c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三：初總、次別、後結。",
        "translation": "There are three: the first summarizes, the second differentiates, and the second concludes.",
        "source": "T37n1755_001:0306c10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初總如文。",
        "translation": "The first is summarized as explained.",
        "source": "T37n1755_001:0306c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「七重行樹」下，別釋。",
        "translation": "Under \"seven rows of trees,\" he explains them separately.",
        "source": "T37n1755_001:0306c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有四：一明寶樹池樓閣奇麗；二明天華天樂映顯莊飾；三明為宣道品；四樹奏樂音。",
        "translation": "There are four: first, it shows the wondrous beauty of the jeweled pond and tower; second, the ornamentation reflected in the heavenly music of tomorrow; third, it shows that it's for proclaiming the qualities of the Way; and fourth, it plays the musical sounds of the tree.",
        "source": "T37n1755_001:0306c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其樹七重皆是四寶金銀瑠璃玻瓈等寶，七重羅網七重行樹，微風徐動暢發和音，聞此聲時即入正位。",
        "translation": "Each of the seven layers of trees is made of the four precious metals, such as gold, silver, beryl, and glass, and seven rocaillettes, and the seven rows of trees are moved by a gentle breeze to produce a harmonious sound that's heard and then they enter the right state.",
        "source": "T37n1755_001:0306c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八功德水充滿盈溢，輕清冷軟美而不臭，飲時調適飲已無患。",
        "translation": "Overflowing with the water of the eight excellent qualities, it's light, clear, cold, and soft, beautiful, and doesn't smell, so when you drink it, you'll be comfortable and have no trouble drinking it.",
        "source": "T37n1755_001:0306c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "底布金沙，四面階道四寶合成。",
        "translation": "The bottom is covered with golden sand, and the four sides of the stairway are composed of four treasures.",
        "source": "T37n1755_001:0306c17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "池中蓮華大如車輪，光色炫燿微妙香潔。",
        "translation": "In the pond are lotus flowers as large as chariots and wheels, whose radiance is brilliant and subtle, and their fragrance is clean.",
        "source": "T37n1755_001:0306c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上有樓閣，亦以四寶而嚴飾之。",
        "translation": "Above it is a tower, which is also adorned with the four treasures.",
        "source": "T37n1755_001:0306c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明天樂不撫而韻，絃出無量法化之聲，聽發慈心，聞便悟道。",
        "translation": "The two masters harmonize music without touching, and their strings produce measureless sounds of teaching, which arouse compassion in those who hear them and awaken them to the way.",
        "source": "T37n1755_001:0306c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晝夜六時雨曼陀羅，天華至妙名曼陀羅，色妙無比香氣芬馥。",
        "translation": "During the six hours of the day and night, it rains maṇḍalas, the most marvelous of the celestial flowers called maṇḍalas, which have a marvelous color and a fragrant odor.",
        "source": "T37n1755_001:0306c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常以清旦衣裓盛華，供養他方十萬億佛，即以食時還到本國。",
        "translation": "They always carry flowers in a towel at sunrise to offer to the ten thousand million buddhas in other directions, and then they return to their home country when they eat.",
        "source": "T37n1755_001:0306c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣裓是盛華器，形如函而有一足，手擎供養。",
        "translation": "The towel is a flower-bearing container shaped like a letter with one foot that he carries in his hand to make offerings.",
        "source": "T37n1755_001:0306c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三雜色鳥，白鶴孔雀鸚鵡鴝鵒，亦如此聞水禽之類。",
        "translation": "The three birds of various colors are white cranes, peacocks, parrots, and robins, which are also heard as waterfowl.",
        "source": "T37n1755_001:0306c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦陵頻伽，妙音清高，可譬佛聲。",
        "translation": "The kalaviṅka has a beautiful, high-pitched voice that's comparable to the Buddha's voice.",
        "source": "T37n1755_001:0306c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共命，兩頭而同一體，生死齊等，故曰共命。",
        "translation": "They share the same body with two heads, and birth and death are the same, so they're called sharing the same life.",
        "source": "T37n1755_001:0306c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此等眾鳥晝夜六時演暢五根五力七覺八道，妙音和雅，即道品中法門名義。",
        "translation": "These birds perform the five faculties, five powers, seven awarenesses, and eight paths at six times of the day and night with a marvelous, elegant sound, which is the name of the dharma-gate in the factors of the path.",
        "source": "T37n1755_001:0306c27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初五根者，信、進、念、定、慧。",
        "translation": "The first five faculties are faith, effort, mindfulness, concentration, and wisdom.",
        "source": "T37n1755_001:0306c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明五力，名不異前，根生有力別更號。",
        "translation": "The next explains the five powers, which are not named differently than the previous ones, and the faculties produce distinct names for the powers.",
        "source": "T37n1755_001:0307a01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七菩提分，念、擇、進、喜、捨、定等。",
        "translation": "The seven factors of enlightenment are mindfulness, discernment, perseverance, joy, equanimity, and concentration.",
        "source": "T37n1755_001:0307a01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八正道分，正見、正思、正語、正業、正命、正進、正念、正定。",
        "translation": "The eightfold correct path consists of right view, right thought, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.",
        "source": "T37n1755_001:0307a02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善修道品即得見諦至於無學。",
        "translation": "The section of the path of skillful cultivation is attained by seeing the truth and reaching the stage of post-learners.",
        "source": "T37n1755_001:0307a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勿謂此鳥罪報所生，皆是彼佛欲令法音宣流變化所作。",
        "translation": "Don't say that this bird's retribution for sin is produced by the transformation of that Buddha's desire to make the Dharma voice flow.",
        "source": "T37n1755_001:0307a04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四明七重行樹及寶羅網，妙音譬如百千種樂同時俱作。",
        "translation": "The four illustrations show that there are seven rows of trees and a jeweled woven net, and their marvelous sounds are like a hundred thousand kinds of music created at the same time.",
        "source": "T37n1755_001:0307a05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自然皆生念佛念法念僧之心，悟無生忍，怡然快樂。",
        "translation": "Naturally, they all give rise to mindfulness of the Buddha, mindfulness of the Dharma, and mindfulness of the saṃgha, and they awaken to the patience of nonproduction and happiness.",
        "source": "T37n1755_001:0307a07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次辯正果。",
        "translation": "Next, they'll explain the proper outcome.",
        "source": "T37n1755_001:0307a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文復有二：前明化主、次辨徒眾。",
        "translation": "There are two further texts: the first describes the master of transformation, and the second identifies the disciples.",
        "source": "T37n1755_001:0307a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化主又二：初辨光明無量、次述壽命無限。",
        "translation": "There are two more ways to define the master of transformation: first, he describes the limitlessness of his light, and second, he explains the limitlessness of his life.",
        "source": "T37n1755_001:0307a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《大品》云，欲得光明無量壽命無極，當學般若。",
        "translation": "The Mahāprajñāpāramitā says, \"If you want to attain limitless light and limitless life, you must train in prajñā.",
        "source": "T37n1755_001:0307a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就此徒眾，前辨聲聞、次明菩薩。",
        "translation": "Regarding the disciples, the first identifies the śrāvakas, and the second explains the bodhisattvas.",
        "source": "T37n1755_001:0307a11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前問：前云有無數聲聞，後何得云眾生生彼國者皆是阿鞞跋致？",
        "translation": "The previous question asked, \"Where did the claim that there are countless śrāvakas come from that it can be said that all sentient beings born in that country are abhidharma?",
        "source": "T37n1755_001:0307a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解云：彼土二乘亦皆不退，二乘不退為凡夫，菩薩不退為小乘也。",
        "translation": "It's explained that in that land, the two vehicles also don't regress, but the two vehicles don't regress as worldlings, and the bodhisattvas don't regress as lesser vehicle adherents.",
        "source": "T37n1755_001:0307a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從「眾生聞者」下，第二勸物往生。",
        "translation": "From the words \"sentient beings who hear this,\" the second exhortation is to be reborn in the Pure Land.",
        "source": "T37n1755_001:0307a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有三：初正勸往生；次引證勸；三結勸又二，初正勸、次示往生方法。",
        "translation": "There are three: the first is a direct exhortation to rebirth; the second is an exhortation that leads to realization; and the third concludes with two more exhortations, the first a direct exhortation and the second an indication of how to be reborn.",
        "source": "T37n1755_001:0307a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就初又二：初正勸、次釋勸意。",
        "translation": "There are two initial ones: the first correctly exhorts, and the second explains the meaning of the exhortation.",
        "source": "T37n1755_001:0307a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗以少善」下，次示方法。",
        "translation": "Under \"Śāriputra takes little merit,\" he next shows the method.",
        "source": "T37n1755_001:0307a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：前云不可以少善，後那云一日七日心不散亂皆得生？",
        "translation": "Q: The first says you can't be less wholesome, but what about the last says that one day or seven days when the mind isn't distracted will result in birth?",
        "source": "T37n1755_001:0307a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：今不以時日多少，特由用心厚薄耳。",
        "translation": "A: Now, it doesn't depend on the number of hours or days, but rather on the thickness of the mind.",
        "source": "T37n1755_001:0307a20_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能七日一心不亂，其人命終，阿彌陀佛以宿願力化佛迎接，心不顛倒即得往生。",
        "translation": "If someone can remain unconfused with one mind for seven days, then when their life ends, Amitâbha Buddha will greet them with the power of a past vow to transform them into buddhas, and they'll be reborn without mental confusion.",
        "source": "T37n1755_001:0307a21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T37n1755_001:0307a23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臨終一念用心懇切即當得去也。",
        "translation": "At the end of their lives, one thought of mindfulness and sincerity will surely lead to their departure.",
        "source": "T37n1755_001:0307a23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我見是利」即是釋意，應當發願一心修行，發願莊嚴，行願相扶，必當得往生也。",
        "translation": "\"I see this benefit,\" which is the explanation, means you should vow to whole-heartedly cultivate, adorn, and practice the vows, and you'll surely be reborn.",
        "source": "T37n1755_001:0307a24_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如我今者」下，引證勸。",
        "translation": "Under \"like me now,\" he cites the exhortation to actualize it.",
        "source": "T37n1755_001:0307a25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非我獨歎彼佛，正勸物往生，六方諸佛皆悉勸發稱揚讚歎恒河沙數各於其土往生彼國。",
        "translation": "I'm not the only one who praises that Buddha and is encouraging people to be reborn; the buddhas of the six directions all encourage, praise, and extol the number of buddhas in the Ganges River to be reborn in their respective lands in that other country.",
        "source": "T37n1755_001:0307a26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若男女聞是經名，皆為諸佛共所護念，皆得不退無上菩提心。",
        "translation": "If men and women hear the name of this sūtra, they'll all be jointly guarded by the buddhas and will attain the mind of unsurpassed nonretrogression and enlightenment.",
        "source": "T37n1755_001:0307a28_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故汝等當信我語及諸佛說，發願欲生皆不退轉往生彼國。",
        "translation": "Therefore, you must believe my words and the teachings of the buddhas, and make the vow that you'll be born in that land and never retrogress.",
        "source": "T37n1755_001:0307a29_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸佛等亦稱釋迦能為難事，於娑婆雜惡五濁境界，為諸眾生說難信之法，當得菩提。",
        "translation": "Those buddhas also praise Śākyamuni for doing difficult things and teaching sentient beings difficult-to-believe teachings in the harsh, five-contaminated realm of Sāma that will lead to enlightenment.",
        "source": "T37n1755_001:0307b02_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "穢國障深五濁垢重，貪瞋是煩惱濁，五見為見濁，二為本，攬此作因，得有連持之命，於五陰假立眾生，此四經時名為劫濁。",
        "translation": "The hindrances in the defiled country are deep and heavy with the five pollutions, and greed and anger are the pollutions of affliction, the five views are the pollutions of views, and these two are the root cause for taking a continuous life and nominally creating sentient beings in the five aggregates, which are called the kalpas and pollutions at the time of these four sūtras.",
        "source": "T37n1755_001:0307b04_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "穢國苦多其濁極重，同居淨土其濁即輕，因順餘方有其名字，無此迫惱號極樂耳。",
        "translation": "In the filthy country where suffering is abundant, the turbidity is extremely heavy, but when they live together in the pure land, the turbidity is less severe, so they follow the other directions and have their names, and they aren't so troubled as to be called extremely happy.",
        "source": "T37n1755_001:0307b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛說經已」下，即流通段。",
        "translation": "The section below \"After the Buddha Explains the Sutra\" refers to the section on transmission.",
        "source": "T37n1755_001:0307b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說經既竟，四眾天人修羅等類歡喜信受。",
        "translation": "After he finished speaking the sūtra, the four groups of gods, humans, sūtras, and others rejoiced and believed in it.",
        "source": "T37n1755_001:0307b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖主難遇若優曇華慶今得見，正法難聞而今聞，昔所未悟而今得悟，具此三喜是故欣悅，得之於懷踊躍無量也。",
        "translation": "It's difficult to meet the noble lord, but now we've seen him, it's difficult to hear the right teaching and now we've heard it, and it's difficult to understand what was not understood in the past and now we've realized it.",
        "source": "T37n1755_001:0307b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀經義記一卷",
        "translation": "Commentary on the Amitâbha Sutra (1 volume)",
        "source": "T37n1755_001:0307b14_0",
        "is_bad_quality": false
    }
]