[
    {
        "source_sentence": "阿彌陀經義述",
        "translation": "Explanation of the Meaning of the Amitâbha Sutra",
        "source": "T37n1756_001:0307b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧淨述",
        "translation": "Huijing shu",
        "source": "T37n1756_001:0307b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀經(此云無量壽，後秦羅什師元譯小無量壽，元壽求那䟦陀法師重譯)竊以，法身無像，像因有像之機；淨土無方，方因有方之感。",
        "translation": "The Amitâbha Sutra (here called Immeasurable Life, a translation of the lesser version of Immeasurable Life by the Lashi master of the late Qin Dynasty and a retranslation by the Ven. Kunashata of the Yuan Dynasty) secretly states that the Dharma body has no image, but images are the result of the opportunity to have images; the Pure Land has no direction, but directions are the result of the feeling of directions.",
        "source": "T37n1756_001:0307b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復至理凝寂、道絕名言，大悲善巧隨□□□□□□□□□□□□□□□□三轉醍醐塵沙出俗，契之者必同其本，化之者或異其流，是以彌陀種覺居妙剎以弘道，釋迦能仁處娑婆以接物，淨土之內根就易調，穢國之中剛強難化，開三因以運四生，布九品而摧五痛。",
        "translation": "雖復至理凝寂、道絕名言，大悲善巧隨□□□□□□□□□□□□□□□□三轉醍醐塵沙出俗，契之者必同其本，化之者或異其流，是以彌陀種覺居妙剎以弘道，釋迦能仁處娑婆以接物，淨土之內根就易調，穢國之中剛強難化，開三因以運四生，布九品而摧五痛。",
        "source": "T37n1756_001:0307b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六方諸佛現於三千，證得往生，言無虛妄，緣眾生空而不捨大悲，觀如來寂而不失敬養。",
        "translation": "The buddhas of the six directions appear in the 3,000, realize rebirth, speak falsely, condition sentient beings to be empty but don't abandon great compassion, and contemplate the tathāgata's quiescence but don't lose their respect.",
        "source": "T37n1756_001:0307b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖知佛□□寂如空而現種種清淨佛土，可謂不壞假名而說諸法實相，不動□□而建立諸法者。",
        "translation": "Although he knows that the Buddha is as quiescent as emptiness and yet he produces various pure buddha-lands, he can be described as someone who doesn't destroy nominal names but explains the true characteristics of dharmas and establishes dharmas without moving them.",
        "source": "T37n1756_001:0307c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說阿彌陀經者，乃勸生淨土不退菩提者也。",
        "translation": "He who teaches the Amitâbha Sutra is someone who encourages birth in the Pure Land and doesn't retrogress from enlightenment.",
        "source": "T37n1756_001:0307c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皎三明以像秋月，振四辨而類春雷，讚淨境以示西方，美勝因而指東土，班自我口，暢之彼心，以覺合機，故稱佛說。",
        "translation": "It shines like the three luminaries in the autumn moon, vibrates like the four discourses in the spring thunder, praises the pure land to show the West, refers to the Eastern Land because of its beauty, and presents itself orally and smoothly to the minds of others in order to awaken and unite them, so it's called the Buddha's teaching.",
        "source": "T37n1756_001:0307c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀，此云無量壽，光明、說法、徒眾皆悉無量，為引物情，偏標壽名，故名無量。",
        "translation": "Amitâbha, here called Amitâbha, has an immeasurable life span, and his light, teaching, and disciples are all immeasurable.",
        "source": "T37n1756_001:0307c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經有二義，訓經、訓常，眾聖所遊，曰經古經今，恒定曰常，故名佛說阿彌陀經。",
        "translation": "The sūtras have two meanings, teaching sūtras and teaching constancy, and the travels of the sages are called sūtras, ancient and modern, and constant and determined, which is why they're called the Amitâbha Sutra taught by the Buddha.",
        "source": "T37n1756_001:0307c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是(至)給孤獨園」者。",
        "translation": "He said, \"Thus (it is) given to Anāthapiṇḍada Park.\"",
        "source": "T37n1756_001:0307c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：經開三分：一由序、二正體、三流通。",
        "translation": "He said, \"The sūtra begins with three parts: one from the introduction, two from the main body, and three from the circulation.",
        "source": "T37n1756_001:0307c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三分例各二，由序二者：一者通序證信、二者別序發起。",
        "translation": "There are two examples of each of the three divisions, two from the introduction: one is a general introduction that confirms faith, and the other is a specific introduction that initiates it.",
        "source": "T37n1756_001:0307c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正體二者：一安樂淨土因果、二彌陀法身因果。",
        "translation": "The two proper essences are: one, the causes and effects of the Pure Land of Peace and Bliss, and two, the causes and effects of Amitâbha's Dharma body.",
        "source": "T37n1756_001:0307c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "流通二者：一如來說此經已、二大眾歡喜信受。",
        "translation": "The two that flow together are: one, that the Tathāgata has explained this sūtra, and two, that the public rejoices and believes in it.",
        "source": "T37n1756_001:0307c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通別二序，例各有六。",
        "translation": "The two prefaces, general and distinct, each have six examples.",
        "source": "T37n1756_001:0307c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通序六者：一信成、二聞成、三時成、四主成、五處成、六眾成。",
        "translation": "The six in the general order are: one, faith accomplished, two, hearing accomplished, three, time accomplished, four, lord accomplished, five, and six, multitude accomplished.",
        "source": "T37n1756_001:0307c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別序六者，至下文當釋。",
        "translation": "The six in the distinct order will be explained below.",
        "source": "T37n1756_001:0307c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今通序六中，五成就也。",
        "translation": "Of the six in the general order, the five are accomplished.",
        "source": "T37n1756_001:0307c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是則信成也。",
        "translation": "Thus, faith is accomplished.",
        "source": "T37n1756_001:0307c19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「如是」者，信順之辭，信則所言之理順，順則師資之道成，經無豐約非信不傳，故名如是。",
        "translation": "\"Thus,\" which is the word for faith and conformity, faith makes the principle spoken by it conform, conformity makes the path accomplished by the teacher's guidance, and the sūtras are not abundant or detailed unless they are transmitted by faith, so they're called thus.",
        "source": "T37n1756_001:0307c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如則指法，是則定辭，如佛所說一切皆是，故名如是，故如是。",
        "translation": "Also, thus refers to the teaching, and thus is the word for definite, such that everything the Buddha teaches is thus, hence the name thus, and thus is thus.",
        "source": "T37n1756_001:0307c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又信則信此經，下文云六方諸佛恒沙種覺現相證成念阿彌陀佛定生淨土。",
        "translation": "Also, faith then is faith in this sūtra, and what follows is the realization that the buddhas of the six directions and the constant variety of awakenings in their manifest forms are mindful that Amitâbha is certainly born in the Pure Land.",
        "source": "T37n1756_001:0307c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經初如是示信，經後歡喜示智，信為能入，智為能度，進念定三，網羅始終，五根具足，堪受堪傳，故云如是。",
        "translation": "At the beginning of the sūtra, faith is thus expressed, and at the end of the sūtra, rejoicing in wisdom, faith is able to enter, wisdom is able to save, further mindfulness, concentration, and the three nets are always present, the five faculties are complete, and it's possible to receive and transmit them, so it's called thus.",
        "source": "T37n1756_001:0307c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我聞」者，聞成也。",
        "translation": "\"I've heard\" means to hear it accomplished.",
        "source": "T37n1756_001:0307c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親承曰我聞，傳授曰所聞，此則親承音旨，謂阿難親從佛邊聞說阿彌陀佛極樂國土，若有專念定得生生，無傳聞之謬。",
        "translation": "Being personally acknowledged is called \"I have heard,\" and transmission is called \"heard,\" which is to say that Ānanda personally heard from the Buddha's side that Amitâbha's paradise would definitely be born if he concentrated on mindfulness, and there's no mistake about transmission.",
        "source": "T37n1756_001:0307c27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難未為侍者前非親承，而言我聞者，佛臨涅槃時，更為略說，故得稱我聞也。",
        "translation": "When Ānanda wasn't personally acknowledged before he became an attendant, he said, \"I've heard it.\" When the Buddha was approaching nirvāṇa, he gave a brief explanation, so he could be called \"I've heard it.",
        "source": "T37n1756_001:0308a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「一時」者，時成也。",
        "translation": "The phrase \"one time\" refers to a time of completion.",
        "source": "T37n1756_001:0308a03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此阿彌陀經時，舍利弗、阿難等聽受時，又法王啟運嘉集之時，故曰一時。",
        "translation": "When the Buddha taught this Amitâbha Sutra and when Śāriputra and Ānanda listened to it, it was also the time when the Dharma king revealed the auspicious gathering, so it's called the same time.",
        "source": "T37n1756_001:0308a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛」者，此云覺，則主成也。",
        "translation": "The term \"Buddha\" refers to this word, \"awakening,\" which means the Lord completed it.",
        "source": "T37n1756_001:0308a05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說法五人：一佛說、二弟子說、三諸天說、四神仙說、五變化說，今是佛說，故名主成就。",
        "translation": "There are five people who preach the Dharma: one who preaches, two who are disciples, three who are gods, four who are sages, and five who are transformers.",
        "source": "T37n1756_001:0308a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛是大師之名，以覺為義。",
        "translation": "Buddha is the name of a great teacher, which takes awakening as its meaning.",
        "source": "T37n1756_001:0308a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覺有二：一覺察、二覺悟，悟則智障盡，察則煩惱障除。",
        "translation": "There are two kinds of awakening: one is perception, and the other is enlightenment, which ends the cognitive hindrances and removes the afflictive hindrances.",
        "source": "T37n1756_001:0308a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於二覺而有三異，自覺異凡夫、覺他異二乘、覺滿異菩薩，三者備矣，爰佛名焉。",
        "translation": "Of these two kinds of awakening, there are three differences: self-awareness differs from worldlings, other-awareness differs from the two vehicles, and perfect-awareness differs from bodhisattvas, and all three are complete, which is why I've named this Buddha.",
        "source": "T37n1756_001:0308a09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「在」者，處成也。",
        "translation": "The term \"abiding\" refers to the completion of a situation.",
        "source": "T37n1756_001:0308a11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在亦云住，住有八，今略有二：一境界住、二依止住。",
        "translation": "Being\" also means abiding, and there are eight abodes, of which there are two in the present: one is the abode of the objective realm and the other is the abode of the basis.",
        "source": "T37n1756_001:0308a11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在舍衛國祇樹給孤獨園者，出二住境界，為化在俗之徒，園是依止之處，為接出家眾。",
        "translation": "The one in Anāthapiṇḍada's Park in Jeta's Grove in Śrāvastī is out of the realm of the two abodes for the conversion of laypeople, and the park is a place of support for the renunciant community.",
        "source": "T37n1756_001:0308a12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "祇陀太子云戰勝，太子載誕之時，王破敵軍之賊，宮人聞奏因以為名。",
        "translation": "When Prince Jeta was born, the king defeated the enemy's bandits, and the palace people heard about it and gave it its name.",
        "source": "T37n1756_001:0308a14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "給孤獨本須達，此云善慈，內外慈而富，賑貧而恤寡，鄉人美之，因以號焉。",
        "translation": "Giving the name Gupta, originally Sudatta, is like Good Charity, which is kind inside and out and rich, relieving the poor and pitying the widow, and which is why the villagers praise him.",
        "source": "T37n1756_001:0308a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有上下，不可先稱獨園，園總樹別，不可俱言祇樹，二人同心共造精舍，含為名，故云祇樹給孤獨園。",
        "translation": "Since there are two people up and down, they can't first be called Anāthapiṇḍada's Park, and since the park is divided into trees, they can't both be called Jeta's Tree.",
        "source": "T37n1756_001:0308a18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法身實無棲詑，示化有方，假住此處，說阿彌陀五門修行定得往生。",
        "translation": "The Dharma body really has no perch, but it shows that there's a way to transform people, so if they stay here, it's said that Amitâbha's five approaches to cultivation will surely lead to rebirth.",
        "source": "T37n1756_001:0308a20_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五門者，故《往生論》云：一禮拜門、二讚歎門、三作願門、四觀察門、五迴向門。",
        "translation": "The five gates are, therefore, described in the Treatise on Rebirth: 1) the gate of veneration, 2) the gate of praise, 3) the gate of making vows, 4) the gate of observation, and 5) the gate of dedication of merit.",
        "source": "T37n1756_001:0308a21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「與大比丘眾(至)諸大弟子」。",
        "translation": "\"With the great assembly of monks (to) the great disciples.\"",
        "source": "T37n1756_001:0308a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：眾成也。",
        "translation": "It says, \"The multitude is also formed.",
        "source": "T37n1756_001:0308a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾有三：一聲聞眾、二菩薩眾、三諸天眾。",
        "translation": "There are three kinds of multitudes: 1. the śrāvaka multitude, 2. the bodhisattva multitude, and 3. the celestial multitude.",
        "source": "T37n1756_001:0308a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此聲聞眾有五：一標類、二唱數、三贊德、四列名、五結定。",
        "translation": "This śrāvaka congregation has five: one that labels categories, two that cites numbers, three that praises virtue, four that lists names, and five that seals the deal.",
        "source": "T37n1756_001:0308a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「與大比丘」者，標類也。",
        "translation": "This expression, \"with the great monks,\" refers to their type.",
        "source": "T37n1756_001:0308a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與者，亦名共，四□□乳身自兼彼，目之為共。",
        "translation": "Being with them is also called being in common with the four milk bodies, which are considered to be in common with each other.",
        "source": "T37n1756_001:0308a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《智度論》云：共一戒一見一處□□□□□□□□□□□□等名共。",
        "translation": "The Zhidu lun says, \"To share one precept, one view, one place, and so forth is called sharing.",
        "source": "T37n1756_001:0308a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大者，梵云摩訶，此有三義：一大、二多、三斷，故人天王等人所恭敬故。",
        "translation": "\"Great\" is the Sanskrit word mahā, which has three meanings: great, numerous, and eliminated, so people like the gods and kings respect them.",
        "source": "T37n1756_001:0308b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何多？",
        "translation": "What's many?",
        "source": "T37n1756_001:0308b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數至千二百五十人，□□十六外道論議能破故。",
        "translation": "There are as many as 1,250 people who can be refuted by the discussions of the 16 non-Buddhist schools.",
        "source": "T37n1756_001:0308b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘略有三義：一怖魔、二乞士、三破惡，此三即初中後也。",
        "translation": "There are three minor meanings of a monk: 1) to fear the devil, 2) to seek refuge, and 3) to refute evil, which are the first and second.",
        "source": "T37n1756_001:0308b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "怖魔者，夫創軌玄門，即建降魔之志，故前剃髮染衣時，天魔宮動而魔怖也。",
        "translation": "Terrorizing Māra, when he created the profound way, he established the intention to subdue Māra; therefore, when he shaved his hair and dyed his clothes, Māra's palace was disturbed and Māra became frightened.",
        "source": "T37n1756_001:0308b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乞士者，身為道器，身安即道隆故，已沽法服乞食以資身也。",
        "translation": "\"Beggar, since the body is a vessel for the path and its physical well-being is the prosperity of the path, he would have put on the Dharma robe and begged for food to support himself.",
        "source": "T37n1756_001:0308b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破惡者，然聖人道長、凡夫道消，所修已滿，破惡以證果也。",
        "translation": "Destroying evil, however, is when the path of sages grows and the path of worldlings disappears, and their cultivation has been completed, so they destroy evil to realize the fruit.",
        "source": "T37n1756_001:0308b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本覺地三名，為至果地，轉怖魔為殺賊、改乞士為應供、說破惡為不生。",
        "translation": "There are three stages in the originally enlightened stage, and they reach the stage of realization by transforming the fearful demon into a killer, changing the beggar into an offering, and explaining the destruction of evil as nonarising.",
        "source": "T37n1756_001:0308b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧者，此云眾也，多比丘一處和合故，名為眾也。",
        "translation": "\"Saṃgha\" means congregation, which is called a congregation because many monks are united in one place.",
        "source": "T37n1756_001:0308b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「千二百五十人俱」者，唱數也。",
        "translation": "The phrase \"twelve hundred and fifty people, all together\" refers to the number called.",
        "source": "T37n1756_001:0308b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「皆是大阿羅漢」者，贊德也。",
        "translation": "\"All are great arhats\" is a praise of virtue.",
        "source": "T37n1756_001:0308b12_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅漢三義，如上比丘果地三名應知。",
        "translation": "The three meanings of arhat should be known as the three bhikṣus in the fruit ground above.",
        "source": "T37n1756_001:0308b13_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「眾所知識」者，人天大眾所共知其內德、識外形也。",
        "translation": "\"Consciousnesses known to all\" is the internal virtues and consciousness forms that are known by the great multitude of humans and gods.",
        "source": "T37n1756_001:0308b14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「長老舍利弗至阿[少/兔]樓馱」者，列名也，明列聲聞眾中十七人。",
        "translation": "\"elders Śāriputra and Ā[lesser/rabbit] Rudra\" is a list of names, which specifies the seventeen people in the śrāvaka community.",
        "source": "T37n1756_001:0308b15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長老、慧命、淨命等並稱贊之謂。",
        "translation": "It's called the elders, the life of wisdom, and the pure life, and so forth, all praised together.",
        "source": "T37n1756_001:0308b16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗，此云身子，鈍若有邊則段陀，利若有邊則身子，告往知來，雄才隼夾，神慧□悟。",
        "translation": "\"Śāriputra, this is called the body-son, which is dull if there's a limit, and sharp if there's a limit, which is the body-son, who tells of the past and knows the future, is an eloquent falcon, and has spiritual wisdom and understanding.",
        "source": "T37n1756_001:0308b17_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連此云讚誦，迦葉此云飲光，俱絺羅此云大膝，周利槃陀迦此云蛇奴，難陀此云慶喜，阿難此云歡喜，羅睺此云覆障，憍梵波提此云牛王，賓頭盧此云上座，頗羅墮此云利根，迦留陀夷此云黑色，劫賓那此云房宿，薄俱羅此云善容，阿[少/兔]樓馱此云如意，如是等諸大弟子，結定也。",
        "translation": "Mucilin here is praise, Kāśyapa here is drinking light, Kauṣṭhila here is the great knee, Cūḍapanthaka here is the serpent slave, Nandha here is rejoicing, Ānanda here is rejoicing, Rāhu here is covering obstacles, Kauṣṭrapati here is the king of cattle, Piṇḍola here is the superior seat, Bāladhara here is the sharp faculties, Kālôdayin here is the black color, Kapphiṇa here is the householder, Pokkhula here is the good bearing, and A[less/rabbit] Rudra here is the wish, such are the great disciples who have formed this concentration.",
        "source": "T37n1756_001:0308b19_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「并諸菩薩(至)如是等諸大菩薩」者。",
        "translation": "He said, \"And the bodhisattvas (to) such-and-such great bodhisattvas.\"",
        "source": "T37n1756_001:0308b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：菩薩眾也，有三：初標類、次列名、後結定。",
        "translation": "It says, \"There are three kinds of bodhisattvas: first, they're labeled, second, they're listed, and finally, they're defined.",
        "source": "T37n1756_001:0308b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩名覺士，覺義有四：一應覺、二正覺、三覺分、四全覺。",
        "translation": "The bodhisattvas are called awakened persons, and there are four meanings of awakening: first, awakening that should be, second, correct awakening, third, and fourth, complete awakening.",
        "source": "T37n1756_001:0308b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "土有二訓：一治、二事。",
        "translation": "There are two teachings of enlightenment: one about healing and two about service.",
        "source": "T37n1756_001:0308b29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此覺事，治化眾生，故云覺士、摩訶大覺士。",
        "translation": "Because this awakening is a condition for governing and transforming sentient beings, it's called an awakened person or a mahāgahādhara awakened person.",
        "source": "T37n1756_001:0308b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真諦云：為約位言之，地前十信、十解、十行，名菩薩自利，□□迴向名摩訶薩利他也，登地已上七地已還名菩薩，八地已上名摩訶薩。",
        "translation": "The true truth says, in terms of stages, that the ten stages of faith, ten stages of understanding, and ten stages of practice before the ground are called bodhisattva self-benefiting, and the stage of turning back to the others is called mahāsattva benefiting others; those above the stage of ascending are called bodhisattvas after the seventh stage, and those above the eighth stage are called mahāsattvas.",
        "source": "T37n1756_001:0308c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《地論》云：大義有三：一、願大；二、行大；三、利益大。",
        "translation": "The Dilun says, \"There are three meanings of great: 1. greatness of vow; 2. greatness of practice; and 3. greatness of benefit.",
        "source": "T37n1756_001:0308c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「文殊」下，列名也。",
        "translation": "Under \"Mañjuśrī,\" this is a list of names.",
        "source": "T37n1756_001:0308c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利此云妙德，法王子當繼尊位。",
        "translation": "Mañjuśrī is called Mañjuśrī, the Dharma prince who will inherit the position of venerable.",
        "source": "T37n1756_001:0308c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿逸多此云無能勝也，乾陀訶提此云赤色，常精進身心修道如救頭燃也。",
        "translation": "This is Ajita, who's invincible, and this is Gandhahastin, who's red-colored and always makes effort to cultivate body and mind like saving his head from burning.",
        "source": "T37n1756_001:0308c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「與如是等菩薩」者，結定也。",
        "translation": "This expression, \"with such bodhisattvas,\" refers to the state of concentration.",
        "source": "T37n1756_001:0308c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「及釋提桓因(至)諸天大眾俱」者。",
        "translation": "He said, \"And Śakrodevānām-Indra (to) the great multitude of gods.\"",
        "source": "T37n1756_001:0308c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：下列諸天眾，具足應云釋提桓因陀羅。",
        "translation": "It says, \"The following heavenly hosts should all be called Śakra Devānām-Indra.",
        "source": "T37n1756_001:0308c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因陀羅此云主，提桓此云天，釋迦此云能，總名能天主。",
        "translation": "Indra here is called the lord, Deva here is called the gods, and Śākyamuni here is called the able lord, which is the general term for the able lords of the gods.",
        "source": "T37n1756_001:0308c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等者等餘。",
        "translation": "Equals are equal to the rest.",
        "source": "T37n1756_001:0308c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通序下明發起，別序有六：一、扣機；二、指處；三、數量；四、依報；五、正果；六、弘化。",
        "translation": "Following the general introduction, we'll explain the initiation, which has six distinct introductions: 1. Deducting the opportunity; 2. Pointing to the location; 3. Quantity; 4. Dependent retribution; 5. Correct result; and 6. Increasing the teaching.",
        "source": "T37n1756_001:0308c13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "扣機，即佛告舍利弗。",
        "translation": "\"To grasp the opportunity, the Buddha told Śāriputra.",
        "source": "T37n1756_001:0308c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "指處，則示在西方。",
        "translation": "He points to a place, which is shown in the West.",
        "source": "T37n1756_001:0308c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數量，則過十萬億佛土。",
        "translation": "In terms of quantity, it's more than a hundred thousand million Buddha-lands.",
        "source": "T37n1756_001:0308c15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依報，則極樂世界。",
        "translation": "For dependent retribution, it's the paradise world.",
        "source": "T37n1756_001:0308c16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正果，即有佛號阿彌陀。",
        "translation": "For its true realization, there's the Buddha's name Amitâbha.",
        "source": "T37n1756_001:0308c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弘化，則現在說法。",
        "translation": "For propagation, he's now teaching the Dharma.",
        "source": "T37n1756_001:0308c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0308c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼土何故名極樂」者。",
        "translation": "Why is that land called paradise?\"",
        "source": "T37n1756_001:0308c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：下明正宗，略二、中五、廣十。",
        "translation": "It says, 'The following explains the correct thesis, which is briefly described as two, middling as five, and broad as ten.'",
        "source": "T37n1756_001:0308c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略二者：一、淨土因果；二、法身因果。",
        "translation": "The two briefly mentioned are: 1. the causes and effects of the Pure Land; and 2. the causes and effects of the Dharma body.",
        "source": "T37n1756_001:0308c19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中五者：一明極樂彌陀不退之果；二明發願起行勸修其因；三明六方諸佛現相證成；四明諸佛既證令修獎樂；五明二土世尊現相贊德。",
        "translation": "The middle five: 1. the realization of the nonretrogression of Amitâbha, the causes of arousing the vow to undertake the practice and encouraging its cultivation; 3. the realization of the manifestation of the buddhas in the six directions; 4. the cultivation of happiness based on the realization of the buddhas; and 5. the virtue of the manifestation of the world-honored ones in the two lands.",
        "source": "T37n1756_001:0308c20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣十者：一、安樂依報；二者、彌陀正果；三、發願往生；四、往生之行；五、諸佛現相；六、釋相所由；七、三時願因；八、三生行果；九、此佛贊彼；十、彼佛贊此。",
        "translation": "There are ten broad categories: 1. the basis for happiness; 2. the direct result of Amitâbha; 3. the vow to be reborn; 4. the practice of being reborn; 5. the manifestation of the buddhas; 6. the reasons for the explanation of the manifestation; 7. the causes of the three periods of the vow; 8. the results of the three lives; 9. this Buddha's praise of that; and 10. that Buddha's praise of this.",
        "source": "T37n1756_001:0308c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今依後判，即為十章。",
        "translation": "Now, based on the latter judgment, these are the ten chapters.",
        "source": "T37n1756_001:0308c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一明極樂依報，有二：一、問；二、答，此問也。",
        "translation": "The first explains the rewards of ultimate bliss, which are twofold: 1. a question; and 2. an answer, which is a question.",
        "source": "T37n1756_001:0308c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其國眾生無有眾苦(至)故名極樂」者，答也，有二：初標宗略答、後開宗廣釋。",
        "translation": "The answer, \"The sentient beings of that country don't have many sufferings (up to) that's why they're called extremely happy,\" has two answers: first, a brief answer that identifies the thesis, and then an extensive explanation that begins with the thesis.",
        "source": "T37n1756_001:0308c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此標宗略答也。",
        "translation": "This is a brief answer based on the denomination.",
        "source": "T37n1756_001:0308c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼阿彌陀國，無有眾苦，唯有樂事，一生彼土，橫截五道，超出三界，至不退轉，當初僧祇萬劫修行。",
        "translation": "'In that Amitâbha land, there are not many sufferings but only pleasant things, and once they are born there, they traverse the five paths, transcend the three realms, and reach nonretrogression when they first practice for ten thousand incalculable eons.'",
        "source": "T37n1756_001:0309a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《十住毘婆沙論》云：修道有二：一、難行；二、易行。",
        "translation": "The Shizhu vibhāṣā-śāstra says, \"There are two kinds of cultivation: 1. difficult and 2. easy.",
        "source": "T37n1756_001:0309a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此土修道名曰難行，西方修道名曰易行，如跛人步行陸路即苦，跛人乘船水路即樂。",
        "translation": "Cultivation in this land is called difficult practice, and cultivation in the West is called easy practice, like the land path taken by a lame person on foot, which is painful, and the water path taken by a lame person in a boat, which is pleasant.",
        "source": "T37n1756_001:0309a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "\"Again, Śāriputra!",
        "source": "T37n1756_001:0309a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土七重欄楯(至)名為極樂」者。",
        "translation": "He said, \"The land of ultimate bliss has seven layers of railing (to) be called ultimate bliss.",
        "source": "T37n1756_001:0309a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：下明開宗，廣釋有五：一明寶欄楯林嚴、二明寶池華光嚴、三明寶樂神通嚴、四明寶鳥法音嚴、五明寶樹搖風嚴。",
        "translation": "Stated below is an introduction that explains five things in detail: first, the Śrīgupta-railed forest Śrīgupta, second, the Śrīgupta-pond flower radiance Śrīgupta, third, the Śrīgupta-sarvâstivāda Śrīgupta, fourth, the Śrīgupta-bird Dharma voice Śrīgupta, and fifth, the Śrīgupta-tree shaking wind Śrīgupta.",
        "source": "T37n1756_001:0309a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是第一寶欄楯林嚴，有六：一寶欄、二寶楯、三寶羅林、六寶樹嚴。",
        "translation": "This is the first of the six jeweled railing and tattoo grove grasms: the first is a jeweled railing, the second is a jeweled tattoo, the third is a jeweled grove, and the sixth is a jeweled tree grasps.",
        "source": "T37n1756_001:0309a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欄持內德，楯防外，羅網誓以珠繩無漏法，芝林□西方功德法莊嚴國界也。",
        "translation": "The railing holds inner virtue, the shield protects against outer virtue, the lapis lazuli vows to preserve the untainted Dharma with beads and ropes, and the lazuli forest is a land of western merit and Dharma adornment.",
        "source": "T37n1756_001:0309a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又舍利弗極樂國(至)功德莊嚴」者。",
        "translation": "He said, \"Furthermore, Śāriputra's paradise (arrives) adorned with merits.\"",
        "source": "T37n1756_001:0309a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：第二寶池華光嚴，有八：一寶池、二寶水、三寶階、四寶道、五寶樓、六寶閣、七寶華、八寶光嚴等。",
        "translation": "He said, \"The second jeweled lake, the lotus-shaped adornment, has eight parts: a jeweled lake, two jeweled waters, three jeweled steps, four jeweled paths, five jeweled buildings, six jeweled pavilions, seven jeweled flowers, and eight jeweled luminous adornments.",
        "source": "T37n1756_001:0309a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "池則八解之浴池，水則八德之香水，樓則八定之高樓，閣則三空之重閣，華則七淨之覺華，光則智慧之光明，能破疑生之愚闇。",
        "translation": "The pond is a bath of eight liberations, the water is perfume of eight virtues, the tower is a high building of eight concentrations, the pavilion is a heavy pavilion of three emptinesses, the flowers are flowers of seven pure awakenings, and the light is the radiance of wisdom that refutes the folly of doubters.",
        "source": "T37n1756_001:0309a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "\"And, Śāriputra!",
        "source": "T37n1756_001:0309a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常作天樂(至)功德莊嚴」者。",
        "translation": "He who \"always creates celestial music\" (to) adorned with merits.",
        "source": "T37n1756_001:0309a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：第三寶樂神通嚴，有三：一明作樂雨華、二明應供諸佛、三明結嚴成就。",
        "translation": "Discussed below are three aspects of the third one, namely, the creation of music and the rain of flowers, the making of offerings to the buddhas, and the accomplishment of adornment.",
        "source": "T37n1756_001:0309a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天即六時而雨四華，人即十方而供萬佛，旭旦則□□彼供養，食時即從彼到此經行。",
        "translation": "The gods rain down four flowers at six times, people make offerings to ten thousand buddhas in ten directions, they make offerings to others on the rising sun, and they come from there to this place to practice during meal times.",
        "source": "T37n1756_001:0309a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "\"Furthermore, Śāriputra!",
        "source": "T37n1756_001:0309a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼國常有種種之鳥(至)變化所作」者。",
        "translation": "There are always various kinds of birds in that country that [arrive] in response to changes.\"",
        "source": "T37n1756_001:0309a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：第四寶眾鳥□法音嚴，有六：一總標瑞鳥、二別指其名、三歌詠法音、四聞念三寶、五破除疑執、六顯不思議。",
        "translation": "It says, \"The fourth jeweled bird, the sound and dignity of the Dharma, has six parts: the first describes the auspicious bird in general, the second refers to it by name, the third sings the Dharma sound, the fourth hears and remembers the Three Treasures, the fifth dispels doubt and attachment, and the sixth reveals the inconceivable.",
        "source": "T37n1756_001:0309a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種奇妙雜色鳥者，總標祥瑞異色之鳥也。",
        "translation": "\"The bird of various wonderful colors is a general designation of a bird of auspiciousness and different colors.",
        "source": "T37n1756_001:0309a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白鵠孔雀共命之鳥者，別指其名，略敘七鳥之名也。",
        "translation": "The bird with the common life of the white swan and the peacock is a separate name that briefly describes the names of the seven birds.",
        "source": "T37n1756_001:0309a29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六時演暢根力覺道等法者，歌詠法佛常六時觀六道眾生，鳥亦六時歌詠道品也。",
        "translation": "This bird sings the Dharma song, saying that the Buddha always observes the sentient beings of the six destinies at six times, and the bird also sings the Dharma text at six times.",
        "source": "T37n1756_001:0309b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「其土眾生聞是音已皆念佛法僧」者，明聞者利益也。",
        "translation": "The phrase \"all the sentient beings in his land remember the Buddha, Dharma, and Saṃgha after hearing this sound\" shows the benefit to those who hear it.",
        "source": "T37n1756_001:0309b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝勿謂此鳥實是罪報所生至何況有實」者，此破遣情疑，初牒疑意。",
        "translation": "Don't say, 'This bird is really born from the retribution of sins, so why should it be real?' This is to dispel emotional doubt and first to explain the meaning of doubt.",
        "source": "T37n1756_001:0309b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所以」下釋，彼土尚無三惡之名，況有三惡之義也。",
        "translation": "Under \"therefore,\" he explains that the other land doesn't yet have the name of the three evils, so how could there be a meaning of the three evils?",
        "source": "T37n1756_001:0309b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是諸至變化所作」者，此顯不思議。",
        "translation": "The phrase \"these are the most transformative things\" shows that it's inconceivable.",
        "source": "T37n1756_001:0309b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸鳥者，乃是彌陀化作令宣法音，莊嚴國界，利益眾生也。",
        "translation": "Those are the birds that Maitreya transforms into to proclaim the Dharma voice, adorn the land, and benefit sentient beings.",
        "source": "T37n1756_001:0309b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛國土微風吹動(至)如是莊嚴」者。",
        "translation": "He said, \"That buddha land's breezes blow (to) such adornment.",
        "source": "T37n1756_001:0309b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：第五寶樹搖風嚴，有四：一風搖樹響、二如天樂音、三聞念三歸、四結嚴成就。",
        "translation": "It says, \"The fifth jeweled tree shaking the wind adorns four things: first, the wind shakes the tree, second, the sound of music like that of the gods, third, the three refuges of hearing and mindfulness, and fourth, the accomplishment of the discipline of adornment.",
        "source": "T37n1756_001:0309b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "微風吹動諸寶行樹者，風搖寶樹，即法說妙音也。",
        "translation": "A gentle breeze blows the jeweled rows of trees, and that breeze shakes the jeweled trees, which is the marvelous sound of the teaching of the Dharma.",
        "source": "T37n1756_001:0309b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如百千種樂，音如天樂音，則譬說妙音也。",
        "translation": "It's like a hundred thousand kinds of music that sound like the music of the gods, which is a metaphor for explaining marvelous sounds.",
        "source": "T37n1756_001:0309b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞者同時念佛法僧者，明聞念三歸，則聞者利益也。",
        "translation": "\"He who hears and is mindful of the Buddha, Dharma, and Saṃgha at the same time shows that he hears and is mindful of the three refuges, which benefits those who hear.",
        "source": "T37n1756_001:0309b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就如是功德者，結嚴成就也。",
        "translation": "This is the accomplishment of such virtue, which is the accomplishment of the bonds and adornments.",
        "source": "T37n1756_001:0309b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意(至)阿彌陀」者。",
        "translation": "He said, \"Here are the four categories of the second Amitâbha's true reward.",
        "source": "T37n1756_001:0309b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「述曰：下明第二彌陀正報□有四：一問、二答、三結、四判位。",
        "translation": "\"Commentator, the following explains the second aspect of Amitâbha's true reward: a question, an answer, a conclusion, and a judgment of rank.",
        "source": "T37n1756_001:0309b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此問，何故名阿彌陀也。",
        "translation": "This question asks why he's called Amitâbha.",
        "source": "T37n1756_001:0309b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛光明」者。",
        "translation": "He said, \"That Buddha's radiance.",
        "source": "T37n1756_001:0309b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：此答也。",
        "translation": "Commentator: This is the answer.",
        "source": "T37n1756_001:0309b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答有三：一光明、二壽命、三徒眾，此光明無量也。",
        "translation": "The answer is threefold: one is his radiance, two is his life span, and three is his disciples, and this radiance is immeasurable.",
        "source": "T37n1756_001:0309b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "\"And, Śāriputra!",
        "source": "T37n1756_001:0309b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽命(至)於今十劫」者。",
        "translation": "The phrase 'a lifespan (up to) now ten eons' ...",
        "source": "T37n1756_001:0309b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：此明壽命無量，初通，次別。",
        "translation": "It says, \"This explains that life span is immeasurable, first in general terms and then in particular terms.",
        "source": "T37n1756_001:0309b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通則其眾壽命無量，別則唯論彌陀壽命，壽雖十劫，然世間不可數知，故名無量壽。",
        "translation": "While the generic approach is that the lifespan of many people is limitless, the specific approach is to focus on the lifespan of Maitreya, whose life span, though ten eons, is incalculable in the world; therefore, it's called a limitless life span.",
        "source": "T37n1756_001:0309b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "\"Again, Śāriputra!",
        "source": "T37n1756_001:0309b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛有無量無邊(至)諸菩薩亦如是」者。",
        "translation": "'There are measureless and limitless buddhas, and so are the bodhisattvas.'",
        "source": "T37n1756_001:0309b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：明徒眾。",
        "translation": "It says, \"Explain the disciples.",
        "source": "T37n1756_001:0309b27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "徒眾有二：一聲聞眾，則四向四果；二菩薩眾，則五十二賢，俱雨權實之威，齊柄乘之理。",
        "translation": "There are two kinds of disciples: first, the śrāvaka community, which has four orientations and four realizations, and second, the bodhisattva community, which has fifty-two wise men, all of whom rain down the authority and authority of the real thing and align with the principle of the authoritative vehicle.",
        "source": "T37n1756_001:0309b27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(至)成就如是功德莊嚴」者。",
        "translation": "(Up to) Accomplishing the adornment of such merits.\"",
        "source": "T37n1756_001:0309c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：此略結也。",
        "translation": "Explanation: This is a brief summary.",
        "source": "T37n1756_001:0309c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光明壽命、菩薩聲聞人法雖殊，皆算數所不能及，故名無量；從本為名，故無量壽。",
        "translation": "Although the life of a buddha, a bodhisattva, a direct disciple, and a human being are all different, they are beyond calculation; therefore, they're called immeasurable; from the beginning, they're called immeasurable life.",
        "source": "T37n1756_001:0309c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "\"And, Śāriputra!",
        "source": "T37n1756_001:0309c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "極樂國土眾生生者(至)阿僧祇劫說」者。",
        "translation": "He said, \"The land of ultimate bliss is a land where sentient beings are born (up to) incalculably long eons.",
        "source": "T37n1756_001:0309c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：次明判位，有三意：一彼土即阿鞞跋致，此明因強；二多有補處大士，此明緣勝；三阿僧祇劫說，此明眾大。",
        "translation": "It says, \"This next explanation describes the three levels of discernment: first, the land is Abhidharma, which shows the strength of the cause; second, there are many great men who fill in the gap, which shows the superiority of the conditions; and third, it's explained in an incalculably long eon, which shows the greatness of the multitude.",
        "source": "T37n1756_001:0309c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生聞者應當發願(至)俱會一處」者。",
        "translation": "Those sentient beings who hear this should make the vow (to) meet at the same place.\"",
        "source": "T37n1756_001:0309c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：下明第三發願往生，初標、次釋。",
        "translation": "It says, \"The following explains the third vow to be reborn, first indicating and then explaining it.",
        "source": "T37n1756_001:0309c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "情無勝期，半路取證，標心極果，中不牽生。",
        "translation": "There's no definite time for sentient beings to reach the goal halfway through their lives, so they mark the mind's ultimate realization and aren't drawn into birth in the middle.",
        "source": "T37n1756_001:0309c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可以少善福德因緣得生彼國」者。",
        "translation": "He said, 'It's not possible to be born in another country with few good or meritorious causes and conditions.'",
        "source": "T37n1756_001:0309c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：下明第四往生之行，初標、次釋、後結。",
        "translation": "It says, \"The following explains the fourth practice of going to be born, beginning with an indication, followed by an explanation, and then a conclusion.",
        "source": "T37n1756_001:0309c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此標行也。",
        "translation": "This is the labeling of the practice.",
        "source": "T37n1756_001:0309c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將明久種善根生，故言不少。",
        "translation": "It's about clarifying that the good roots that have been planted over time are produced, so it's called not few.",
        "source": "T37n1756_001:0309c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人聞阿彌陀佛名(至)極樂國土生」者。",
        "translation": "Suppose good sons and good women hear Amitâbha's name and are born in the land of paradise.\"",
        "source": "T37n1756_001:0309c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：釋行也，有五：一條機、二名本、三時分、四彼佛此迎、五此生彼。",
        "translation": "It says, \"There are five ways to explain practice: one is opportunistic, two are name-based, three are time-divisional, four are welcomed by this Buddha, and five are born here and there.",
        "source": "T37n1756_001:0309c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "條機，則男子女人；名本，則阿彌陀佛；時分，則七日一心；彼佛此迎，則彌陀聖眾垂終迎接；此生生彼，則心不顛倒即得往生也。",
        "translation": "The first is a man and a woman, the second is the name basis, which is Amitâbha Buddha, the second is seven days of unified mind, the second is being greeted by this Buddha, which is the final greeting from the noble congregation of Amitâbha, and the third is being born here, which is attaining rebirth without mental confusion.",
        "source": "T37n1756_001:0309c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我見此利(至)發不可思議功德」者。",
        "translation": "I've seen this benefit (to) give rise to unfathomable virtue.\"",
        "source": "T37n1756_001:0309c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：結也，初結前願，次結後行。",
        "translation": "It says, \"This is the first knot, the first knot of the former vows, and the second knot of the latter practices.",
        "source": "T37n1756_001:0309c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一生彼土，必登不退，橫截五道，直超三界，生死之河雖闇不久超度，涅槃之道雖遠且亦可登，故云見是利也。",
        "translation": "Once born in that land, they'll surely attain nonretrogression, cut across the five paths, and directly transcend the three realms. Although the river of birth-and-death is dark, it won't be long before they cross it, and although the path to nirvāṇa is distant, they can still attain it.",
        "source": "T37n1756_001:0309c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0309c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今者讚嘆不可思議功德之利」者，此結後行，亦是調前起後相證成也。",
        "translation": "This latter practice of \"Thus I now praise the unfathomable benefits of merit\" is also the realization of the former and latter stages of regulation.",
        "source": "T37n1756_001:0309c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「東方亦有阿閦毘佛，乃至上方佛所護念經」者。",
        "translation": "He said, \"In the east, there's also Akṣobhya Buddha and the scripture on how the Buddha above protects and recites [the Buddha's name].\"",
        "source": "T37n1756_001:0309c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：第五明六方諸佛現相證誠。",
        "translation": "It says, 'Fifth, we'll explain the manifestation of the buddhas in the six directions and realize their sincerity.'",
        "source": "T37n1756_001:0309c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六方即四方上下，示證佛處也。",
        "translation": "The six directions are the four directions up and down, which show where the buddhas are realized.",
        "source": "T37n1756_001:0309c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛則三世三身恒沙種覺，明證佛人也。",
        "translation": "The buddhas are the three worlds, three bodies, and the myriad realizations, which shows who's realizing the Buddha.",
        "source": "T37n1756_001:0309c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現相則舒舌遍滿三千，明證相也。",
        "translation": "In terms of manifesting characteristics, they stretch their tongues to fill the 3,000, which explains the realization of characteristics.",
        "source": "T37n1756_001:0310a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證誠則說誠實言者，即證成教也。",
        "translation": "To actualize sincerity, he speaks honestly, which is to actualize the teaching.",
        "source": "T37n1756_001:0310a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文有六方則為六重，一一方中例皆有四。",
        "translation": "When the text has six sides, then there are six layers, and in each side there are four examples.",
        "source": "T37n1756_001:0310a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方四者，一證處則東方，二證人則阿閦毘等恒沙諸佛，三證相舌遍三千，四證教則□當信是經。",
        "translation": "The four in the east are, first, to realize the place, then the east; second, to realize the people, then Akṣobhya and the other buddhas of the sands; third, to realize the characteristics and tongue pervading the 3,000; and fourth, to realize the teaching, then□you should believe in this sūtra.",
        "source": "T37n1756_001:0310a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子說經引弟子為證，諸佛說經以□□諸佛為證，故引六方恒沙諸佛舒舌實語，念彌陀一生定得往彼極樂世界至不退轉，餘五方四門類可知。",
        "translation": "The disciple who teaches the sūtra cites the disciple as proof, and the buddhas who teach the sūtra use the buddhas of the **** as proof, so they cite the true words of the buddhas of the six directions, saying that mindfulness of Maitreya's life will surely lead to the paradise world and lead to irreversibility, and the other five directions and four categories can be understood.",
        "source": "T37n1756_001:0310a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0310a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝意云何(至)護念經」者。",
        "translation": "What do you think (about) the Sutra on Mindfulness?\"",
        "source": "T37n1756_001:0310a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：下明第六釋相所由，初問，後答。",
        "translation": "Stated below is the sixth explanation of the reason for the appearance of the sutra, which begins with a question and ends with an answer.",
        "source": "T37n1756_001:0310a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此問也。",
        "translation": "This is also a question.",
        "source": "T37n1756_001:0310a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0310a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人(至)三菩提」者。",
        "translation": "He said, \"If good men and good women (arrive at) the three bodhisattvas.",
        "source": "T37n1756_001:0310a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：答也。",
        "translation": "It says, \"Reply, too.",
        "source": "T37n1756_001:0310a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但聞此經名彌陀及諸佛號，能持不忘者，一切佛護，不退轉菩提。",
        "translation": "'Only those who hear this sūtra called Maitreya and the names of the buddhas and can retain them and not forget them will be protected by all the buddhas and won't retrogress to enlightenment.'",
        "source": "T37n1756_001:0310a13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「是故，舍利弗！",
        "translation": "\"Therefore, Śāriputra!",
        "source": "T37n1756_001:0310a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當信受我語，及諸佛所說」者。",
        "translation": "You will all believe and accept my words and the teachings of the buddhas.\"",
        "source": "T37n1756_001:0310a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：明第七三時願因。",
        "translation": "Explanation: This explains the seventh cause of the three times of vowing.",
        "source": "T37n1756_001:0310a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文有二：一勅聽信受、二正明三時願因，此勅聽信受也。",
        "translation": "There are two texts: one that commands you to listen and believe in me, and two that correctly explain the causes of the three times of vowing.",
        "source": "T37n1756_001:0310a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「我語」者，釋迦勸生淨土也。",
        "translation": "\"My words\" refers to the Śākyamuni's encouragement to be born in the Pure Land.",
        "source": "T37n1756_001:0310a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「諸佛說」者，六方恒沙諸佛勸證往生。",
        "translation": "\"The buddhas taught\": the buddhas of the six directions exhorting [others] to realize rebirth in the Pure Land.",
        "source": "T37n1756_001:0310a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0310a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有人已發願(至)三菩提」者。",
        "translation": "He said, \"If someone has made the vow (to) achieve the three times of enlightenment.",
        "source": "T37n1756_001:0310a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：正明三時願也。",
        "translation": "It says, \"This is precisely the statement that describes the three times of vowing.",
        "source": "T37n1756_001:0310a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已發願者，觀音、勢至、龍樹之流。",
        "translation": "Those who have given rise to the vow are those in the tradition of Avalokitêśvara, Śīji, and Nāgârjuna.",
        "source": "T37n1756_001:0310a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今發願者，現今信受之輩。",
        "translation": "Those who have given rise to the vow now are those who believe and accept it now.",
        "source": "T37n1756_001:0310a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當發願者，未來信生之類。",
        "translation": "Those who will give rise to the vow in the future are those whose faith will be born in the future.",
        "source": "T37n1756_001:0310a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲生阿彌陀佛國者，三時願所生處也。",
        "translation": "Those who want to be born in Amitâbha's kingdom are born in the place of the three seasonal vows.",
        "source": "T37n1756_001:0310a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得不退菩提者，一生彼處，地勝緣強，必階不退無上菩提也。",
        "translation": "Those who attain irreversible enlightenment will surely attain irreversible, unsurpassed enlightenment once they're born there, where the ground is so great and the conditions so strong that they'll attain it.",
        "source": "T37n1756_001:0310a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「於彼國土(至)生彼國土」者。",
        "translation": "He said, \"In that land (to) be born in that land.\"",
        "source": "T37n1756_001:0310a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述云：下明第八三生行果也。",
        "translation": "It says, 'The following explains the eighth realization of the three births.'",
        "source": "T37n1756_001:0310a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已生者，觀音、勢至之流。",
        "translation": "Those who have been born are those in the streams of Avalokitêśvara and Śrīgarbha.",
        "source": "T37n1756_001:0310a27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今生者，現今信受之輩。",
        "translation": "Those born now are those who believe and accept in the present.",
        "source": "T37n1756_001:0310a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當生者，未來信受生之類也。",
        "translation": "Those who will be born in the future are those whose faith will be recipient of birth in the future.",
        "source": "T37n1756_001:0310a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既前賢後聖皆願生彼，見賢思齊，故有信者應當發願生彼國也。",
        "translation": "Since the former good men and the latter sages all wished to be born there, and since they see the good men and think of their peers, those who have faith should make the vow to be born in that country.",
        "source": "T37n1756_001:0310a28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛所以慇懃只勸歸西方，定獲不退。",
        "translation": "That's why the buddhas are so eager to encourage only those who go to the West, who are certain to attain nonretrogression.",
        "source": "T37n1756_001:0310b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0310b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我今者(至)不思議功德」者。",
        "translation": "I now (arrive at) inconceivable merit.\"",
        "source": "T37n1756_001:0310b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：下明第九此佛讚彼，謂釋迦如來讚阿彌陀諸佛淨土之果。",
        "translation": "Discussant: The following explains that the ninth Buddha praises them, meaning the Śākyamuni Tathāgata praises the fruit of Amitâbha's pure land.",
        "source": "T37n1756_001:0310b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「彼諸佛等(至)甚難希有之事」。",
        "translation": "\"Those buddhas and so forth (arrive) at things that are difficult and rare.\"",
        "source": "T37n1756_001:0310b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：下次第十明彼佛讚此釋迦穢土道成能為難事。",
        "translation": "Discourse: Next, the tenth time, we'll explain that the buddhas praised this Buddha for making the path to the defiled land possible, which is a difficult thing.",
        "source": "T37n1756_001:0310b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難事即五濁惡世教化眾生、信歸淨土，定證不退。",
        "translation": "The difficult thing is teaching sentient beings in the five turbid bad states, believing in the Pure Land, and definitely realizing nonretrogression.",
        "source": "T37n1756_001:0310b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文有三重：一標、二釋、三結。",
        "translation": "The text has three parts: a label, an explanation, and a conclusion.",
        "source": "T37n1756_001:0310b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "標即甚難希有之事，甚難則三章。",
        "translation": "The label is a rare and extremely difficult matter, and the three chapters are about extremely difficult matters.",
        "source": "T37n1756_001:0310b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二釋則五濁菩提之事。",
        "translation": "The second is an explanation of the five matters that defile enlightenment.",
        "source": "T37n1756_001:0310b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三結則還結此三義。",
        "translation": "The third conclusion concludes with these three meanings.",
        "source": "T37n1756_001:0310b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此則標也，初總，次別。",
        "translation": "This is the introduction, which is general in the first place and specific in the second.",
        "source": "T37n1756_001:0310b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總即明彼佛禪我功德，別則甚難希有之事。",
        "translation": "The general one explains the merits of the Buddha's meditation on himself, and the specific one refers to things that are extremely difficult and rare.",
        "source": "T37n1756_001:0310b11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚難則五濁惡世，希有之事則無上菩提之事，即為眾說。",
        "translation": "The very difficult is the five turbid bad states, and the rare thing is the thing of unsurpassed enlightenment, which is explained for the masses.",
        "source": "T37n1756_001:0310b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾說即穢土修因、得淨土果，此是難證之法。",
        "translation": "Explaining it for the crowd means cultivating the causes of the defiled land and attaining the fruit of the pure land, which is a difficult thing to realize.",
        "source": "T37n1756_001:0310b14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「能於娑婆國土(至)難信之法」者。",
        "translation": "He said, \"In the land of Sāva (to) a teaching that's difficult to believe.\"",
        "source": "T37n1756_001:0310b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：釋三章，五濁者釋甚難章門。",
        "translation": "He explained that he would explain the three chapters and the five turbidities, which are very difficult chapters.",
        "source": "T37n1756_001:0310b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得菩提者，釋希有章門。",
        "translation": "Those who have attained bodhi explain the chapter on rare things.",
        "source": "T37n1756_001:0310b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾生說者，釋之事章門也。",
        "translation": "He who teaches them for sentient beings explains the chapter on phenomena.",
        "source": "T37n1756_001:0310b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "\"Śāriputra!",
        "source": "T37n1756_001:0310b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知我於(至)是為甚難」。",
        "translation": "You should know that this is (up to) a very difficult situation for me.\"",
        "source": "T37n1756_001:0310b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：結三章也。",
        "translation": "He said, \"This concludes the three chapters.",
        "source": "T37n1756_001:0310b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五濁得菩提者，二門結自利也；為一切世間說者，一門結利他也。",
        "translation": "He who attains enlightenment through five turbidities binds the self-benefiting aspect in two ways, and he who teaches it for the benefit of all the world binds the benefit of others in one way.",
        "source": "T37n1756_001:0310b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「佛說此經已(至)歡喜信受」者。",
        "translation": "He said, \"After the Buddha taught this sūtra, they rejoiced and believed in it.\"",
        "source": "T37n1756_001:0310b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述曰：明流通。",
        "translation": "Explanation: It explains its circulation.",
        "source": "T37n1756_001:0310b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩聖對揚，四部蒙益，深心歡喜，信受奉行。",
        "translation": "The two sages have spoken together, and the four groups have been enriched, deeply rejoiced, and faithfully accepted and handed down the teaching.",
        "source": "T37n1756_001:0310b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀經義述(終)",
        "translation": "Explanation of the Meaning of the Amitâbha Sutra (Final)",
        "source": "T37n1756_001:0310b24_0",
        "is_bad_quality": false
    }
]