[
    {
        "source_sentence": "五方便念佛門",
        "translation": "five skillful means of recitation of the Buddha's name",
        "source": "T47n1962_001:0081c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天台智者大師撰",
        "translation": "written by Great Master Tiantai Zhizhe",
        "source": "T47n1962_001:0081c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一凝心禪、二制心禪、三體真禪、四方便隨緣禪、五息二邊分別禪。",
        "translation": "1. concentration meditation, 2. restraint meditation, 3. essential true meditation, 4. expedient according with conditions meditation, and 5. breath-two-limits discrimination meditation.",
        "source": "T47n1962_001:0081c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡住心一境，名曰凝心。",
        "translation": "Anyone who abides in the single object of the mind is said to be concentrating the mind.",
        "source": "T47n1962_001:0081c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且如行者，念佛之時諦觀如來玉毫金相，凝然寂靜了亮洞徹，名凝心禪。",
        "translation": "Suppose a practitioner mindfully observes the Tathāgata's jade hair and gold form when he's mindful of the Buddha, and that concentration, stillness, clarity, and insight are called concentrated-mind meditation.",
        "source": "T47n1962_001:0081c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次，前雖凝心，所習慣馳散，令制之，令還諦緣金相，名制心禪。",
        "translation": "Next, although he previously concentrated his mind, what he was accustomed to doing was distracting, so he restrained it and caused it to return to mindfulness of the golden features, which is called mind-control meditation.",
        "source": "T47n1962_001:0081c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，前雖制心，得住定境，既非理觀，皆屬事修，今體本空，誰制？",
        "translation": "Furthermore, although he previously restrained his mind, he was able to abide in the object of concentration, which is not a principle to contemplate but a thing to cultivate.",
        "source": "T47n1962_001:0082a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無佛、無念，名體真禪。",
        "translation": "The absence of buddha and the absence of mindfulness is called true meditation in essence.",
        "source": "T47n1962_001:0082a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，前雖謂體真，猶滯空寂，無量名相昧然不知。",
        "translation": "Furthermore, although it was called true in essence in the past, it was still stuck in emptiness and quiescence, and its innumerable names and forms were obscured.",
        "source": "T47n1962_001:0082a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今以無所得而為方便，從空入假，萬相洞明，不為空塵之所惑亂，名方便禪。",
        "translation": "Now, using ungraspable effort as method, he enters the conventional from emptiness and clearly understands all characteristics, not being confused by emptiness and dust, which is called methodical meditation.",
        "source": "T47n1962_001:0082a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次，體真及以方便各據空有，不離二邊，令諦觀靜亂本無相貌，名言路斷，思想亦絕，名息二邊禪。",
        "translation": "Furthermore, the essence and the method each rely on emptiness and existence and don't part from the two extremes, so that when they truly observe quiescence and confusion, the original form is nonexistent, the path of words is cut, and thoughts are eliminated, which is called the meditation of calming the two extremes.",
        "source": "T47n1962_001:0082a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從淺至深，如是分別，原夫圓觀亦無淺深，而淺深宛然。",
        "translation": "From the shallow to the deep, they are thus discriminated, for the original perfect contemplation also has no shallowness or depth, and the shallowness and depth are just the same.",
        "source": "T47n1962_001:0082a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敘開念佛五門：第一稱名往生念佛三昧門、第二觀相滅罪念佛三昧門、第三諸境唯心念佛三昧門、第四心境俱離念佛三昧門、第五性起圓通念佛三昧門。",
        "translation": "He describes the five approaches to mindfulness of the Buddha: first, the approach of mindfulness of the Buddha's name as he's reborn, second, the approach of mindfulness of the Buddha's appearance as he ceases sins, third, the approach of mindfulness of the Buddha's object only, fourth, the approach of mindfulness of the Buddha's absence from both mind and object, and fifth, the approach of mindfulness of the Buddha's nature as it arises in perfect harmony.",
        "source": "T47n1962_001:0082a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛大慈悲常教勅說法。",
        "translation": "The buddhas are always teaching and preaching with great compassion.",
        "source": "T47n1962_001:0082a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸菩薩等以種種方便，令眾生易解；又自以種種方便，開示般若波羅蜜。",
        "translation": "By using various means, those bodhisattvas make it easy for sentient beings to understand, and by using various means, they reveal the perfection of prajñā.",
        "source": "T47n1962_001:0082a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何義故說是般若波羅蜜？",
        "translation": "What does it mean to say this is the perfection of prajñā?",
        "source": "T47n1962_001:0082a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「欲令諸菩薩等增長念佛三昧故。」",
        "translation": "The Buddha said, \"It's because I want to cause all bodhisattvas to increase their mindfulness of the buddha samādhi.\"",
        "source": "T47n1962_001:0082a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何因緣令念諸佛？",
        "translation": "What are the causes and conditions that make them mindful of the buddhas?",
        "source": "T47n1962_001:0082a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「若念佛者，當知是人即與文殊師利等無有異。」",
        "translation": "The Buddha said, \"If someone is mindful of the Buddha, they should know that they're no different from Mañjuśrī and others.\"",
        "source": "T47n1962_001:0082a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以何故？",
        "translation": "Why is that?",
        "source": "T47n1962_001:0082a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三昧者，諸佛世尊之所遊戲，首楞嚴等諸大三昧始出生處，是知將入諸佛法，方便誠多。",
        "translation": "\"This is the first place where great samādhis like Śūraṃgama and others first arise, so you know you'll enter the Buddha's teachings with sincerity and skillfulness.",
        "source": "T47n1962_001:0082a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以一言而具眾門，無過念佛。",
        "translation": "If a single word were to embrace many approaches, it would be no better than recollection of the Buddha.",
        "source": "T47n1962_001:0082a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T47n1962_001:0082a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切賢聖皆從念佛而生，一切智慧皆從念佛而有。",
        "translation": "All the noble and virtuous arise from mindfulness of the Buddha, and all wisdom comes from mindfulness of the Buddha.",
        "source": "T47n1962_001:0082a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假如十信菩薩及三賢菩薩，皆不離念佛、念法、念僧，乃至不離念一切種智；初地菩薩乃至八、九、十地菩薩亦不離念佛、念法、念僧，乃至不離念一切種智。",
        "translation": "Suppose the ten faithful bodhisattvas and the three good bodhisattvas are not free from mindfulness of the Buddha, mindfulness of the Dharma, mindfulness of the saṃgha, and even mindfulness of all kinds of wisdom; the first-stage bodhisattvas and even the eighth, ninth, and tenth-stage bodhisattvas are also not free from mindfulness of the Buddha, mindfulness of the Dharma, mindfulness of the saṃgha, and even mindfulness of all kinds of wisdom.",
        "source": "T47n1962_001:0082a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以念知差別，隨義立名，眾生迷名，妄生異解，漂墜魔界，遂輕念佛之名，仍謂已修別為勝業。",
        "translation": "However, because mindfulness knows distinctions and creates names according to their meanings, sentient beings are confused about names, deludedly come to different understandings, and drift into the demonic realm, so they despise the name of the mindfulness of the Buddha and still claim to have cultivated distinctive and superior actions.",
        "source": "T47n1962_001:0082a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為愍此故，今略言之。",
        "translation": "For this reason, I'll explain it briefly.",
        "source": "T47n1962_001:0082a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若論修因之人，不離三賢十聖；若論證果之者，即是諸佛如來。",
        "translation": "If we talk about people who cultivate causes, they can't be free from the three good men and ten sages, and if we talk about people who realize the fruit, they are the buddha-tathāgatas.",
        "source": "T47n1962_001:0082a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修因之人，繫心常思念十方一切佛；證果之者又特啟此，以為微妙清淨第一禪。",
        "translation": "Those who cultivate causes always think of all the buddhas of the ten directions with their minds tethered, and those who realize the fruit especially reveal it as the subtly pure first dhyāna.",
        "source": "T47n1962_001:0082b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是知易入而證深，無過念佛。",
        "translation": "This is known to be easier to enter and more profound to realize than mindfulness of the buddhas.",
        "source": "T47n1962_001:0082b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嗟呼！",
        "translation": "What a pity!",
        "source": "T47n1962_001:0082b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "末學之流，輕其易入，失其證深，為見所縛，良可悲矣！",
        "translation": "It's sad that a group of trainees who despise their ease of entry and lose the depth of their realization are bound by their views!",
        "source": "T47n1962_001:0082b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸佛以眾生樂稱諸佛名，生彼國者，則示以稱名往生門；眾生有樂覩諸佛身，懼障不見者，則示以觀相滅罪門；眾生有迷心執境者，則示以諸境唯心門；眾生有計實有者，則示以心境俱離門；眾生樂深寂定，趣無生滅者，則示以性起圓通門。",
        "translation": "Furthermore, the buddhas show sentient beings who delight in calling on the names of the buddhas and being born in that country the gate of going to be born there by calling on the names; sentient beings who delight in seeing the bodies of the buddhas but fear the hindrances of not seeing them the gate of observing appearances to end sins; sentient beings who are deluded in their minds and attach to objects the gate of showing that objects are only mind; sentient beings who imagine that they really exist the gate of showing that both mind and object are free; and sentient beings who delight in deep tranquility and concentration and are headed toward the absence of birth and cessation the gate of the perfect penetration of nature arisen.",
        "source": "T47n1962_001:0082b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大哉！",
        "translation": "How great!",
        "source": "T47n1962_001:0082b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊，善拔我等，開示一道，直至菩提，甚深法門——所謂念佛。",
        "translation": "Bhagavān, you've kindly removed us and shown us a profound teaching that leads to enlightenment, the so-called nembutsu.",
        "source": "T47n1962_001:0082b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有大智度者，生而知之者，深修定慧者，善經論者，請撿此門，與了義大乘等經，有收義不盡處，請試言之。",
        "translation": "Only those of great wisdom and liberty, those who are born knowing it, those who deeply cultivate concentration and wisdom, and those who are good at sūtras and discussions are invited to examine this approach and try to explain it, along with the scriptures that contain the full meaning of the great vehicle and other scriptures that don't exhaust the meaning.",
        "source": "T47n1962_001:0082b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是知稱一佛名，智深則深，一言而具眾門，信有徵矣。",
        "translation": "This shows that calling a buddha by name has profound wisdom, and that to include many aspects in a single statement is a sign of faith.",
        "source": "T47n1962_001:0082b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既敘五門來意竟，更敘入方便次第。",
        "translation": "After we've described the five aspects of the Buddha's coming, we'll go on to describe the order of entry into the method.",
        "source": "T47n1962_001:0082b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假如行人，口稱南無阿彌陀佛時，心必願生彼國土，即是稱名往生門；行者想像佛身，專注不已，遂得見佛，光明赫奕，照觸行者，爾時所有罪障，皆悉消滅，即是觀相滅罪門；又觀此佛，從自心起，無別境界，即是諸境唯心門；又觀此心，亦無自相可得，即是心境俱離門；行者爾時趣深寂定，放捨一切心意意識，將入涅槃，緣十方佛加被護念，興起智門，行者爾時於一念頃，淨佛國土，成就眾生。",
        "translation": "Suppose a practitioner says, \"Namu Amitâbha,\" and his mind definitely wishes to be born in that land, which is the gate of calling names and going to be born; the practitioner imagines the Buddha's body and doesn't stop concentrating on it, then he sees the Buddha with a brilliant light that shines brightly and touches the practitioner, and at that point all the hindrances of sins are completely extinguished, which is the gate of observing characteristics to extinguish sins; he also observes that this Buddha arises from his own mind and has no separate objects, which is the gate of objects being only mind; he also observes that this mind also has no own characteristics to attain, which is the gate of both mind and object being free; the practitioner then goes to a deep, tranquil concentration, lets go of all mental and consciousnesses, and is about to enter nirvāṇa when the buddhas of the ten directions bless and protect him and give rise to the gate of wisdom.",
        "source": "T47n1962_001:0082b16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如何前四門所有功德，百千萬分不及其一。",
        "translation": "How could all the merits of the previous four approaches not be equal to one in a hundred thousand million?",
        "source": "T47n1962_001:0082b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T47n1962_001:0082b26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無功用位，能以一身為無量身，任運修習故，佛觀護故，諸佛法源盡窮底故，普賢願因悉圓滿故，本願力故，法如是故，即是性起圓通門。",
        "translation": "The stage of effortlessness, the ability to make one person without any limitations, the ability to cultivate freely, the ability to observe and protect the buddhas, the ability to exhaust the sources of the buddhas' teachings, the ability to fully complete the causes of the vows of Samantabhadra, the ability to make the original vows, and the ability to realize the teaching as it is, is the gate of perfect penetration of innate arising.",
        "source": "T47n1962_001:0082b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已上五門竟。",
        "translation": "Having completed the above five approaches, he asked.",
        "source": "T47n1962_001:0082b29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「云何為一行三昧？」",
        "translation": "He asked, \"What is the practice of samādhi?\"",
        "source": "T47n1962_001:0082b29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「《大寶積經》第一百一十六云：『文殊師利白佛言：「世尊！",
        "translation": "Answer: \"In the 116th edition of the Mahāprajñāpāramitā-sūtra, it says, 'Mañjuśrī said to the Buddha, \"Bhagavān!",
        "source": "T47n1962_001:0082c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當云何修行能速得阿耨菩提？」",
        "translation": "How will this practice quickly lead to supreme enlightenment?\"",
        "source": "T47n1962_001:0082c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「一行三昧。",
        "translation": "The Buddha said, \"One line of samādhi.",
        "source": "T47n1962_001:0082c03_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子、善女人修是三昧者，速得阿耨多羅三藐三菩提。」",
        "translation": "Good sons and good women who cultivate this concentration will quickly attain unsurpassed, correct enlightenment.\"",
        "source": "T47n1962_001:0082c03_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言：「云何名一行三昧？」",
        "translation": "Mañjuśrī said, \"What's the name of this samādhi of one practice?\"",
        "source": "T47n1962_001:0082c04_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「法界一相，繫緣法界，是名一行三昧。",
        "translation": "The Buddha said, \"The single aspect of the Dharma realm and the binding to the Dharma realm are called one-line concentration.",
        "source": "T47n1962_001:0082c05_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人欲入一行三昧，當先聞般若波羅蜜，如說修行，然後能入一行三昧。",
        "translation": "If good sons and good women want to enter the concentration of one practice, they must first hear prajñā-pāramitā and practice it as described, and then they'll be able to enter the concentration of one practice.",
        "source": "T47n1962_001:0082c06_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如法界緣，不退、不壞、不思議、無礙、無相。",
        "translation": "Like the Dharma realm as objective, it's nonretrogressing, nonperishing, inconceivable, unobstructed, and markless.",
        "source": "T47n1962_001:0082c08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子、善女人欲入一行三昧，應處空閑，捨諸亂意，不取相貌，繫心一佛，專稱佛名字，隨佛方所，端身正向，能於一佛念念相續，即是念中能見三世諸佛。",
        "translation": "Good sons and good women who want to enter the concentration of one practice should be in a state of emptiness, abandon distracting thoughts, stop grasping appearances, fix their minds on a single Buddha, exclusively call on the Buddha's name, follow the Buddha's direction, straighten their bodies, and correctly face each other, which is to say that they can see the buddhas of the three times in their mindfulness.",
        "source": "T47n1962_001:0082c09_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T47n1962_001:0082c12_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念一佛功德無量無邊，亦與無量諸佛功德無量辯才。",
        "translation": "The merit of mindfulness of a single Buddha is measureless and limitless, and it's also associated with the measureless merit of measureless buddhas and their measureless eloquence.",
        "source": "T47n1962_001:0082c12_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是入一行三昧者，盡知恒沙諸佛法界無差別相。」』",
        "translation": "Thus, when he enters the concentration of one practice, he fully knows the Dharma realm of the buddhas of the sands of the Ganges without distinctions.\"",
        "source": "T47n1962_001:0082c14_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此文良證。」",
        "translation": "This text is a good proof.\"",
        "source": "T47n1962_001:0082c15_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「人多畫像而以觀禮，有何聖教？」",
        "translation": "He asked, \"What's the noble teaching for people to paint images and worship them?\"",
        "source": "T47n1962_001:0082c15_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「《大寶積經》第八十九云：『爾時大精進菩薩持畫佛[疊*毛]像，入於深山，寂靜無人、禽獸之間。",
        "translation": "Answer: \"The 89th entry of the Mahābherīgha-sūtra says, 'At the time, the Great Essence Bodhisattva took a painted [stacked*hair] image of the Buddha and went into a deep mountain area where there was no human or animal life in the silence.",
        "source": "T47n1962_001:0082c16_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開現畫像，取草為座，在畫像前，結跏趺坐，正身正念，觀於如來。",
        "translation": "He opened the painted image, took some grass for a seat, sat cross-legged in front of the painted image, correctly positioned himself with correct mindfulness, and observed the Tathāgata.",
        "source": "T47n1962_001:0082c18_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀察已，作如是念：「如來是希有微妙，畫像尚爾，端坐微妙，況復如來正遍知身？」",
        "translation": "After carefully observing it, he thinks, \"The Tathāgata is rare and marvelous, and even this painted image is sitting upright and marvelous, so why wouldn't the Tathāgata's body of correct omniscience?\"",
        "source": "T47n1962_001:0082c19_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「云何觀佛？」",
        "translation": "Again, he thought, \"How do I contemplate the Buddha?\"",
        "source": "T47n1962_001:0082c21_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，林神知彼菩薩心之所念，白菩薩言：「善男子！",
        "translation": "Knowing what the bodhisattva was thinking in his mind, the forest spirit then said to the bodhisattva, \"Good man!",
        "source": "T47n1962_001:0082c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝念：『云何觀佛？』」",
        "translation": "You think, 'How do I contemplate the Buddha?'\"",
        "source": "T47n1962_001:0082c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答言：「若欲觀佛，當觀畫像，觀此畫像，不異如來，是名觀佛？",
        "translation": "They replied, \"If you want to look at the Buddha, you must look at a painted image.",
        "source": "T47n1962_001:0082c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀佛，如是觀者，是為善觀。」",
        "translation": "Such observation of the Buddha and such observation is good observation.\"",
        "source": "T47n1962_001:0082c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時大精進作如是念：「我今云何觀此畫像與如來等？」",
        "translation": "The great zealous one then had this thought, \"Now, how do I look at this image and the Tathāgata and so forth?\"",
        "source": "T47n1962_001:0082c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念：「如是畫像者，非覺、非知，一切諸法亦復如是，但有名字。",
        "translation": "Again, he thinks, \"Such a picture is not perceived or known, and so are all dharmas that merely have names.",
        "source": "T47n1962_001:0082c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是名字自性空寂，本無所有，如來之身其相如是。",
        "translation": "Such names are empty of their own nature and originally lack existence, and the Tathāgata's body has this appearance.",
        "source": "T47n1962_001:0082c28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "畫像非證、非果，非證者、非得者，非住者、非去來，非生、非滅，非淨、非色，非貪、瞋、痴，畫像非陰、界、入，非初、中、後，一切諸法亦復如是，如來身相亦復如是。",
        "translation": "The portraits are not realized, not fruition, not realized, not attained, not abiding, not departing, not arising, not ceasing, not pure, not form, not greedy, angry, or deluded, and the portraits are not of aggregates, elements, or formations, not first, middle, or last, and all things are likewise, so are the Tathāgata's body and its characteristics.",
        "source": "T47n1962_001:0082c29_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此畫像，非覺、非知、非作，一切諸佛亦復如是，觀如來身相亦復如是，乃至六根亦復如是。」",
        "translation": "Such a picture is not perceived, not known, and not created, and so are all the buddhas, and so is the observation of the Tathāgata's bodily appearance, even down to the six faculties.\"",
        "source": "T47n1962_001:0083a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是觀如來身，結跏趺坐，於三七日中，成就五通，供養諸佛。",
        "translation": "The bodhisattva thus observes the Tathāgata's body, sits cross-legged, achieves the five powers, and makes offerings to the buddhas during the course of three or seven days.",
        "source": "T47n1962_001:0083a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天散華以為供養，為佛所讚，會中二萬人住阿耨多羅三藐三菩提，無量阿僧祇人住二乘功德，大精進者，釋迦牟尼佛是也。』",
        "translation": "The gods scatter flowers as an offering, and they are praised by the Buddha as the abode of 20,000 people in the assembly who abide in unsurpassed, perfect enlightenment, and countless incalculable people who abide in the merit of the two vehicles, the great energetic one, that's Śākyamuni Buddha.'",
        "source": "T47n1962_001:0083a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此文明矣。」",
        "translation": "This civilization is complete.\"",
        "source": "T47n1962_001:0083a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約四教者，夫心不獨生，必詫緣起。",
        "translation": "According to the four teachings, a person's mind doesn't arise independently; it must be augmented by dependent arising.",
        "source": "T47n1962_001:0083a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者念佛之時，意想為因，如來毫光為緣，亦名法塵，以對意根故。",
        "translation": "When a practitioner is mindful of the Buddha, mental images are the cause, and the Tathāgata's radiance is the condition, also called the Dharma dust, because it's directed at the mental faculty.",
        "source": "T47n1962_001:0083a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所起之念，即是所生法，觀此根塵能所，三相遷動，新新生滅，念念不住，分折方空，無佛無念，藏教小乘也；即觀念佛心，起能生所生，無不即空，妄謂心起，心實不起，起無自性，體之即空，所觀佛相如鏡中像、虛空華，無佛無念，通教大乘也；即觀念佛心，起即假名之法，淺深洞鑒，無量名相，如觀掌中，了知此心，有如來藏，歷劫斷惑，方證真常，離邊顯中，無佛無念，別教大乘也；即觀念佛心，起即空假即中，若根若塵，並是法界起，一念亦爾，塵剎諸佛，一念照明，六道眾生，剎那普應，初即是後，今始覺知，如大福人執石成寶，必無捨念，別求離念，即邊而中，無佛無念，圓教大乘也，《瓔珞經》明頓悟如來，此之謂也。",
        "translation": "所起之念，即是所生法，觀此根塵能所，三相遷動，新新生滅，念念不住，分折方空，無佛無念，藏教小乘也；即觀念佛心，起能生所生，無不即空，妄謂心起，心實不起，起無自性，體之即空，所觀佛相如鏡中像、虛空華，無佛無念，通教大乘也；即觀念佛心，起即假名之法，淺深洞鑒，無量名相，如觀掌中，了知此心，有如來藏，歷劫斷惑，方證真常，離邊顯中，無佛無念，別教大乘也；即觀念佛心，起即空假即中，若根若塵，並是法界起，一念亦爾，塵剎諸佛，一念照明，六道眾生，剎那普應，初即是後，今始覺知，如大福人執石成寶，必無捨念，別求離念，即邊而中，無佛無念，圓教大乘也，《瓔珞經》明頓悟如來，此之謂也。",
        "source": "T47n1962_001:0083a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五方便念佛觀門一卷",
        "translation": "Five Expedient Contemplations on Mindfulness of the Buddha in One Volume",
        "source": "T47n1962_001:0083a27_0",
        "is_bad_quality": false
    }
]