[
    {
        "source_sentence": "念佛三昧寶王論卷上(并序)",
        "translation": "Nianfo sanmei baowang lun shou (and preface)",
        "source": "T47n1967_001:0134a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐紫閣山草堂寺沙門飛錫撰",
        "translation": "By Shaomen Feixi of Caochang Temple, Ziji Shan, Tang Dynasty",
        "source": "T47n1967_001:0134a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "客有高信，至吾禪居，前禮致問，辭甚清逸。",
        "translation": "A visitor of high faith came to my Chan abode and saluted me with a very elegant speech.",
        "source": "T47n1967_001:0134a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問吾曰：「修心之人成道捷徑，法華三昧不輕之行，念佛三昧般舟之宗，僉為無上深妙禪門者，願聞其致。」",
        "translation": "He asked me, \"I would like to hear about the shortcut to enlightenment for those who cultivate the mind, the not-so-subtle practice of Lotus Absorption, and the school of Nianfo Samadhi, which are all unsurpassed and profound approaches to meditation.\"",
        "source": "T47n1967_001:0134a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「吾拱默九峯，與世異營，天書曲臨，自紫閣山草堂寺，令典千福法華勝場，向三十年矣。",
        "translation": "He said, \"I have been silent for nine peaks, apart from the world, and I have been instructed by the gods to curl up at the Caochang Temple on Mount Ziji for thirty years now to conduct the thousandfold merit ceremony of the Lotus Sutra.",
        "source": "T47n1967_001:0134a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "希高扣寂，未有若君之所問者也。",
        "translation": "I've never had anyone ask about it as much as you do,\" he said.",
        "source": "T47n1967_001:0134a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子將涉無生之龍津，欲圖南以鵬舉，吾不敏也，甞試論之。",
        "translation": "He's about to wade through the unproduced dragon river and wants to map out the southern route to Pengju. I'm not so smart, but I've tried to discuss it before.",
        "source": "T47n1967_001:0134a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今則略開二十門，以明斯旨耳。」",
        "translation": "Now, I'll briefly lay out twenty approaches to clarify this point.\"",
        "source": "T47n1967_001:0134a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上卷、七門　念未來佛。",
        "translation": "First, there are seven categories of mindfulness of future buddhas.",
        "source": "T47n1967_001:0134a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中卷、六門　念現在佛。",
        "translation": "The middle volume contains six entries on mindfulness of present buddhas.",
        "source": "T47n1967_001:0134a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下卷、七門　(通念三世，無不是佛)。",
        "translation": "The second volume contains seven aspects (shared mindfulness of the three worlds, none of which are not buddhas).",
        "source": "T47n1967_001:0134a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念未來佛速成三昧門第一",
        "translation": "The first is the approach of quickly accomplishing samādhi while mindful of future buddhas.",
        "source": "T47n1967_001:0134a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫心之二也，生於群妄，群妄雖虛，惑者猶滯之。",
        "translation": "\"When there are two minds, they arise from a mass of delusion, and although the mass of delusion is empty, those who are confused are still stuck in it.",
        "source": "T47n1967_001:0134a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不釋，聖以之憂，玄韻暢而無說，法身空而具相，相之不明，說之不圓，一味之旨，絕言之路，誰可知其所歸歟？",
        "translation": "When they aren't explained, the noble ones take pity on them, the profound sounds are unimpeded without explanation, the Dharma body is empty but full of characteristics, the characteristics are unclear, the explanation is incomplete, and the meaning of a single taste is cut off from the path of language, so who can know where it leads?",
        "source": "T47n1967_001:0134a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三昧之宗者，欲令弱喪知不二法門存乎語、默，匪唯淨名杜口、文殊興讚而已矣！",
        "translation": "The doctrine of samādhi wants to make the weak know that the gate of the principle of nonduality exists in speech and silence, not just in words or in praise from Mañjuśrī!",
        "source": "T47n1967_001:0134a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何則？",
        "translation": "What then?",
        "source": "T47n1967_001:0134a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫帝網未張，千瓔焉覿？",
        "translation": "Before the net of Indra is opened, how can a thousand yarns be installed?",
        "source": "T47n1967_001:0134a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宏網忽舉，萬目齊開。",
        "translation": "A vast net is suddenly raised, and all eyes are opened.",
        "source": "T47n1967_001:0134a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "浴大海者，已用於百川；念佛名者，必成於三昧。",
        "translation": "He who bathes in the ocean has already used a hundred rivers, and he who recites the Buddha's name will surely achieve samādhi.",
        "source": "T47n1967_001:0134a25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一言以蔽，其在茲焉。",
        "translation": "In a nutshell, here it is.",
        "source": "T47n1967_001:0134a26_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦猶清珠下於濁水，濁水不得不清；佛想投於亂心，亂心不得不佛。",
        "translation": "It's like when a clear pearl is dropped into muddy water, the muddy water can't help but be clear; when a Buddha's contemplation is cast into a disturbed mind, the disturbed mind can't help but be a Buddha.",
        "source": "T47n1967_001:0134a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既契之後，心、佛雙亡，雙亡定也，雙照慧也，即定慧齊均，亦何心而不佛？",
        "translation": "After this realization, both mind and Buddha disappear, and both concentration and wisdom are illuminated, meaning that both concentration and wisdom are equal, so why wouldn't the mind be Buddha?",
        "source": "T47n1967_001:0134a28_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何佛而不心？",
        "translation": "What Buddha is it that is not mindful?",
        "source": "T47n1967_001:0134b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心、佛既然，則萬境、萬緣無非三昧者也。",
        "translation": "Since it's the mind and the Buddha, then all objects and all conditions are nothing but samādhi.",
        "source": "T47n1967_001:0134b01_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而世上之人，多念過去釋迦之月面，想現在彌陀之海目，如拔毒箭矣！",
        "translation": "But people in the world are often mindful of the moon face of the Śākyas in the past and think of the ocean eye of Amitâbha in the present, which is like pulling out a poisoned arrow!",
        "source": "T47n1967_001:0134b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如登快樂宮矣！",
        "translation": "It's like ascending to the palace of joy!",
        "source": "T47n1967_001:0134b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾亦以之為至教矣！",
        "translation": "I also regard this as the supreme teaching!",
        "source": "T47n1967_001:0134b04_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶未聞念未來諸佛之聚日者。",
        "translation": "\"They haven't yet heard of the mindfulness of the future Buddha's coming group of days.",
        "source": "T47n1967_001:0134b04_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何耶？",
        "translation": "Why is that?",
        "source": "T47n1967_001:0134b05_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓋謂不了如來對眾生之麁，說諸佛之妙，遂隔眾生於諸佛之外，故不聞焉，孰肯念焉？",
        "translation": "It means that when the Tathāgata doesn't explain the crude aspects of the sentient beings and the marvelous aspects of the buddhas, it isolates the sentient beings from the buddhas, so they don't hear it and who would be willing to think about it?",
        "source": "T47n1967_001:0134b05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《淨名經》中，有嗅薝蔔，不嗅餘香，花有著身、不著身者，此是抑揚大乘也。",
        "translation": "In the Jingming jing, there's a person who smells campaka and doesn't smell other fragrances, and there are flowers that stick to the body and those that don't. This is suppressing and praising the great vehicle.",
        "source": "T47n1967_001:0134b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "抑小則置鉢茫然，揚大則同遊不二。",
        "translation": "If they suppress the lesser, they'll place their bowls in a daze; if they praise the greater, they'll travel together without distinction.",
        "source": "T47n1967_001:0134b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《法華經》決了聲聞法，是諸經之王，一切薝蔔不著之旨明矣。",
        "translation": "The Lotus Sutra firmly understands the śrāvaka teaching, which is the king of all the sutras, and the goal of not clinging to all the campaka beads is clear.",
        "source": "T47n1967_001:0134b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苟非其人，則以諸佛為至尊也，眾生為至卑也，高下出焉，群妄興矣，敬傲立焉，一真隱矣！",
        "translation": "If it weren't for these people, then they would regard the buddhas as most honored and sentient beings as most inferior, and when the superior and inferior arise, a multitude of delusions will arise, respect and pride will stand, and the single truth will be hidden!",
        "source": "T47n1967_001:0134b11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫如是必草芥萬有，錙銖天下，幔幢已設，高倨稜層，目送飛鴻，心遊青漢，不可屈也，則阻維摩一切見敬為供養中最之文矣！",
        "translation": "Thus, there must be straw and litter everywhere, pennies in the world, a curtain and banner erected, a high, arrogant, and arrogant layer, eyes sending off flying fliers, and a mind wandering through the blue sky that cannot be bent, which would prevent Vimalakīrti from making all his offerings the most respectful of texts!",
        "source": "T47n1967_001:0134b13_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又不信《楞伽經》說，如來藏自性清淨，轉三十二相，入於一切眾生心中。",
        "translation": "They also don't believe the Laṅkâvatāra Sutra when it says that the Tathāgatagarbha's self-nature is pure, and it transforms into thirty-two marks and enters the minds of all sentient beings.",
        "source": "T47n1967_001:0134b16_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如大無價寶珠，垢衣所纏，豈觀城中最下乞人與難勝如來，等無有異？",
        "translation": "Like a large priceless jewel tied up in a dirty robe, does it mean that the lowest beggar in the city is no different from the Tathāgata who is difficult to win?",
        "source": "T47n1967_001:0134b17_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若圓念三世佛、普觀十方尊，則合夫理趣般若，一切有情皆如來藏，普賢菩薩自體遍故之文矣！",
        "translation": "If one is fully mindful of the buddhas of the three times and universally observes the honored ones in the ten directions, then this is consistent with the statement that all sentient beings are tathāgatas and that the self-nature of the Bodhisattva of Universal Worthy pervades them.",
        "source": "T47n1967_001:0134b19_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貧女懷王，米在穅[禾*會]之旨，鏡然可觀，豈可罹此八慢之責哉？",
        "translation": "How could a poor woman who harbored the king and whose purpose was to get rid of [grain*assembly] in a mirror be blamed for these eight kinds of conceit?",
        "source": "T47n1967_001:0134b21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人皆侮未來玉毫，不敢侮過、現金色。",
        "translation": "People often disparage future buddhas and dare not disparage present gold.",
        "source": "T47n1967_001:0134b22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殊不知起罪之源，皆在於當來佛上，非已、今佛上也。",
        "translation": "They don't realize that the source of the crimes that arise are all in the future Buddha, not in the past or present Buddha.",
        "source": "T47n1967_001:0134b23_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生苟非，當佛焉在？",
        "translation": "If sentient beings are not, how can the future Buddha be?",
        "source": "T47n1967_001:0134b24_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知母因子貴，米以穅全，有協《法華》不輕之心，則念佛三昧不速而成矣！",
        "translation": "If one knows that a mother's factor is valuable, that rice is made complete by insulating it, and that one's intention to aid the Lotus is not despised, then nianfo samādhi will not be achieved quickly!",
        "source": "T47n1967_001:0134b25_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「法華者，法也；念佛者，佛也。",
        "translation": "He asked, \"This is the Lotus, which is the teaching, and this is the Nembutsu, which is the Buddha.",
        "source": "T47n1967_001:0134b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安得以法為佛，以佛為法，浩浩亂哉？」",
        "translation": "How can you think of the Dharma as the Buddha and the Buddha as the Dharma, which is so vast and confusing?\"",
        "source": "T47n1967_001:0134b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「不亂也！",
        "translation": "They replied, \"It's not confusing!",
        "source": "T47n1967_001:0134b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元是一門，而誰為亂？",
        "translation": "The origin is one school, but who is it that is in disorder?",
        "source": "T47n1967_001:0134b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫芝木之藥，列仙之子，昔各在天涯，則都無仙號。",
        "translation": "\"Zhizhi Mu's medicine and the sons of Lixian were each at the end of the earth in the past, but they didn't have the name of immortal.",
        "source": "T47n1967_001:0134b29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為人服其藥，羽化雲行，故藥受仙藥之名，人得仙人之稱，人、藥異也，其仙一也。",
        "translation": "When people took their medicine, they were transformed into clouds and traveled, so the medicine received the name Immortal Medicine and people received the name Immortal Man.",
        "source": "T47n1967_001:0134c01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無聖人，誰與道游？",
        "translation": "If there were no sages, who would travel with the Way?",
        "source": "T47n1967_001:0134c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法無佛悟，豈令自悟？",
        "translation": "How can one make oneself realize the Dharma without the Buddha realizing it?",
        "source": "T47n1967_001:0134c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法非佛不悟，念佛三昧生焉；佛非法不明，法華三昧起矣。",
        "translation": "If the Dharma isn't Buddha-unaware, then nianfo sanmei will arise; if the Buddha and the Dharma aren't known, then dharma-flower sanmei will arise.",
        "source": "T47n1967_001:0134c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一仙兩稱，俱得仙名，念佛、法華同名佛慧，佛慧既同，則不輕般舟，無上深妙禪門，於茲悟矣！",
        "translation": "When one sage and two sages are called the same thing, both Nianfo and Fahua are called Buddha's wisdom, and since Buddha's wisdom is the same, then the parboat is not despised, and the unsurpassed profound and subtle approach to meditation is now realized!",
        "source": "T47n1967_001:0134c05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未始異也，復何亂哉？」",
        "translation": "It's not different yet, so what's the confusion?\"",
        "source": "T47n1967_001:0134c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嬖女群盜皆不可輕門第二",
        "translation": "Secondly, a woman who is a thief is not to be taken lightly",
        "source": "T47n1967_001:0134c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「一切眾生，即未來諸佛，謹聞命矣。",
        "translation": "He asked, \"All sentient beings, that is, future buddhas, should hear about their lives.",
        "source": "T47n1967_001:0134c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嬖女、群盜，惡之至者，安得求敬於念佛之賓歟？」",
        "translation": "How can a woman or a gang of thieves, the worst of evils, seek reverence from a guest who is mindful of the Buddha?\"",
        "source": "T47n1967_001:0134c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「如佛所演，有其二種：一、對待門；二、澤了門。",
        "translation": "They replied, \"As the Buddha teaches it, there are two kinds: one is the approach of treating people with respect; the other is the approach of seeing clearly.",
        "source": "T47n1967_001:0134c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言對待門者，謂女子之虛偽，說如來之至真，則佛可尊崇，女可厭離。",
        "translation": "The treating approach refers to a woman's hypocrisy and the Tathāgata's ultimate truth, so the Buddha can be honored and the woman can be disillusioned.",
        "source": "T47n1967_001:0134c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "厭離有二：一者、訶欲；二者、放心。",
        "translation": "There are two kinds of disillusionment: first, rejection of desire; and second, reassurance.",
        "source": "T47n1967_001:0134c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初訶欲者，如菩薩訶色欲，經云：『女色者，世間之枷鎖，凡夫戀著不能自拔；女色者，世間之重患，凡夫困之至死不免；女色者，世間之衰禍，凡夫遭之無厄不至。",
        "translation": "The first is rejection of desire, like the bodhisattva's rejection of the desire for form. The sūtra says, 'Female form is a worldly fetter that mortals cling to and can't extricate themselves from; female form is a worldly misfortune that mortals are trapped by until death and can't escape; female form is a worldly misfortune that mortals encounter without fail.'",
        "source": "T47n1967_001:0134c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者既得捨之，若復顧念，是為從獄得出，還思入；從狂得止，而復樂之；從病得差，復思得病。",
        "translation": "Once a practitioner has abandoned it, if he continues to think about it, he'll escape from prison and think about entering it again; he'll stop his madness and enjoy it again; and he'll get rid of his illness and think about getting sick again.",
        "source": "T47n1967_001:0134c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者愍之，知其狂而顛蹶，死無日矣！",
        "translation": "A wise person takes pity on them and knows that they're crazy and confused, and there's no day to die!",
        "source": "T47n1967_001:0134c20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫重女甘為僕使，終身馳驟為之辛苦，雖復鈇鑕千刃鋒鏑交至，甘心受之不以為患，狂人樂狂不啻過也！",
        "translation": "An ordinary man who willingly serves as a servant to a valuable woman and labors over her whole life, even though he's faced with a thousand blades and a sharp point, willingly accepts it without being troubled, is a madman who enjoys madness no less than madness!",
        "source": "T47n1967_001:0134c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者若能棄之不顧，是則破枷脫鎖，惡狂厭病，離於衰禍，既安且吉，得出牢獄，永無患難。",
        "translation": "If a practitioner can abandon them, he'll break the chains, become insane and sick, part with misfortune, become comfortable and fortunate, and escape prison, never in trouble.",
        "source": "T47n1967_001:0134c24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女人之相，其言如蜜，其心如毒。",
        "translation": "A woman's features are like her words being as honey and her heart being as poison.",
        "source": "T47n1967_001:0134c26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如停泉澄波，而蛟龍居之；金山寶窟，而師子處之。",
        "translation": "They're like a dragon living in a still spring or a lion living in a jeweled cave with a gold mountain.",
        "source": "T47n1967_001:0134c26_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知，此害不可近也！",
        "translation": "You should know that this harm shouldn't be approached!",
        "source": "T47n1967_001:0134c28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "室家不和，婦人之由；毀宗敗族，婦人之罪。",
        "translation": "Discord in the home is the cause of a woman's disharmony, and disparagement of the clan is a woman's crime.",
        "source": "T47n1967_001:0134c28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實為陰賊，滅人慧明，亦如獵圍，鮮得出者。",
        "translation": "They are really traitors who annihilate people's wisdom and insight, just like a hunting ring that rarely escapes.",
        "source": "T47n1967_001:0134c29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如高羅，群鳥落之，不能奮飛；又如密網，眾魚投之則刳腸俎肌，亦如暗坑；無目之如蛾赴火。",
        "translation": "It's like a high net into which a flock of birds falls, but they can't fly; it's like a dense net into which many fish throw their intestines and muscles, or a dark pit; a blind man is like a moth going into the fire.",
        "source": "T47n1967_001:0135a01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是以智者知而遠之，不受其害；惡而穢之，不為此物之所感也。』",
        "translation": "Therefore, a wise person who knows and keeps away from it won't be harmed by it; a person who does evil and defiles it won't be touched by it.'",
        "source": "T47n1967_001:0135a03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《大寶積經》佛為優陀延王說是偈曰：「『鋒刃刀山，　　毒箭諸苦，　　女人能集，　　眾多苦事。",
        "translation": "In the Mahābherīgha-sūtra, the Buddha spoke this verse for King Udayana, saying, 'A mountain of sharp blades and swords, poisonous arrows and suffering, and a woman's ability to gather in a multitude of painful situations.",
        "source": "T47n1967_001:0135a05_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　假以香華，　　而為嚴好，　　愚人於此，　　妄起貪求。",
        "translation": "They pretend to be adorned with flowers and fragrances, but foolish people here falsely become greedy for them.",
        "source": "T47n1967_001:0135a07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　如海疲鳥，　　迷於彼岸，　　死必當墮，　　阿鼻地獄。",
        "translation": "Like a weary bird in the ocean that's lost on the other side, he'll surely fall into the avīci hell when he dies.",
        "source": "T47n1967_001:0135a08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　現見眾苦，　　皆來集身，　　善友乖離，　　天宮永失。",
        "translation": "Seeing all the suffering that comes from gathering bodies, their good friends are parted, and their heavenly palace is lost forever.",
        "source": "T47n1967_001:0135a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　寧投鐵獄，　　馳走刀山，　　眠臥炎爐，　　不親女色。』",
        "translation": "They'd rather throw themselves into an iron hell, march across a mountain of swords, sleep in a hot stove, and not be intimate with women.'",
        "source": "T47n1967_001:0135a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「『如鳥為求食，　　不知避網羅，　　貪愛於女人，　　被害亦如是；　　譬如水中魚，　　游泳網者前，　　便為他所執，　　豈非自傷損？",
        "translation": "\"'Like a bird seeking food that doesn't know how to avoid a net, so is it when it lusts after a woman and is harmed; like a fish in the water that swims in front of a net, it becomes attached to others, so isn't it just its own injury?'",
        "source": "T47n1967_001:0135a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　女若捕魚人，　　諂誑猶如網，　　男子同於魚，　　被網亦如是。』",
        "translation": "A woman is like a fisherman who flatters just like a net, and a man is like a fish and is caught in a net just like that.'",
        "source": "T47n1967_001:0135a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「次放心者，如《大寶積經》云：『文殊師利告善住天子言：「若人一心專精自守，貪欲心發，即應覺知、方便散除，還令寂靜。",
        "translation": "\"Furthermore, it's reassuring to know that, as the Mahābherī Sutra says, 'Mañjuśrī told the well-abiding Prince of Heaven, \"If someone focuses their mind intently and keeps it to themselves and becomes desirous, then they should perceive and skillfully remove it and return it to quiescence.",
        "source": "T47n1967_001:0135a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何散除？",
        "translation": "How is it dispersed?",
        "source": "T47n1967_001:0135a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作是念：『此是空，此是不淨。",
        "translation": "You should think, 'This is emptiness, and this is impurity.",
        "source": "T47n1967_001:0135a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "求此欲心，生處、滅處，從何所來？",
        "translation": "Seeking this mind of desire, where will it arise and cease, and where will it come from?'",
        "source": "T47n1967_001:0135a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去至何所？",
        "translation": "Where will it go?",
        "source": "T47n1967_001:0135a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是中誰染？",
        "translation": "Who is this defiled middle?",
        "source": "T47n1967_001:0135a23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰受染者？",
        "translation": "Who is the defiled one?",
        "source": "T47n1967_001:0135a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰為染法？",
        "translation": "Who are the defiled dharmas?",
        "source": "T47n1967_001:0135a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是觀時，不見能染，不見所染，不見染事。",
        "translation": "When they observe it this way, they don't see what's defiled, don't see what's defiled, and don't see defiled things.",
        "source": "T47n1967_001:0135a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以不見故，則無有取；以不取故，則無有捨；以不捨故，則無有愛。",
        "translation": "Because they don't see, there's no grasping, and because there's no grasping, there's no equanimity, and because there's no equanimity, there's no craving.",
        "source": "T47n1967_001:0135a25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不捨、不愛，則名離欲，寂靜涅槃也。』",
        "translation": "When there's no equanimity and no craving, it's called freedom from desire and tranquil nirvāṇa.'",
        "source": "T47n1967_001:0135a26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若又恣心入諸塵勞、生死之內，而亦不患貪、恚、癡等煩惱過患，是謂放心。」』」",
        "translation": "If someone also enters into the world of defilements and birth-and-death with abandon, and doesn't suffer from the afflictive faults of craving, anger, and delusion, this is called being at ease.\"'\"",
        "source": "T47n1967_001:0135a27_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已上明第一對待門竟。",
        "translation": "I've finished explaining the first aspect of confrontation.",
        "source": "T47n1967_001:0135a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二決了門者，若究竟離諸妄，無染如虛空，則為過、現諸佛也，非未來佛也。",
        "translation": "The second gate of definitive understanding is that if someone is ultimately free of delusion and is undefiled like space, they're past and present buddhas, not future buddhas.",
        "source": "T47n1967_001:0135a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝不聞，夫求無價寶，必下於滄海；采智慧寶，必先於煩惱中求。",
        "translation": "Haven't you heard that someone seeking priceless treasure must go down to the vast ocean, and someone gathering the treasure of wisdom must first seek it in the midst of affliction?",
        "source": "T47n1967_001:0135b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五逆相即解脫相，魔界如即佛界如。",
        "translation": "The five phases of reversal are the phases of liberation, and thusness of the demonic realm is thusness of the Buddha's realm.",
        "source": "T47n1967_001:0135b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聆佛音而喜，聞魔聲恚，不入音聲法門，不住音聲實際，不覺於諸法者，斯乃北轅適越之士也，安得與之而論道哉？",
        "translation": "If someone is delighted when they hear the Buddha's voice and becomes angry when they hear the devil's voice, doesn't enter the Dharma aspect of sound and sound, doesn't live in the reality of sound and sound, and doesn't realize the Dharma, then they're a person who's poles apart and appropriate, so how can they discuss the path with them?",
        "source": "T47n1967_001:0135b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更為子明之。",
        "translation": "He further explained it for his son.",
        "source": "T47n1967_001:0135b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經不云：「夫昔列仙名鹿蹄，地滑倒仆，以仙呪令旱。",
        "translation": "Doesn't the sūtra say, \"Once upon a time, the sage Lingshan was called Deerfoot, and he fell down when the ground was slippery and he used a magic spell to bring drought.",
        "source": "T47n1967_001:0135b07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國人患之，王募嬖女，誘而得之，騎頸入城，油雲四起，霈然洪霔。",
        "translation": "When the country was troubled by this, the king recruited a favorite girl, enticed her, rode her neck into the city, and oil clouds rose in all directions, flooding the city with water.",
        "source": "T47n1967_001:0135b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼仙雖有御長風之通，凌太清之術，無能施也。",
        "translation": "Although that immortal had the ability to counteract long winds and the skill to overcome Taiqing, he couldn't do it.",
        "source": "T47n1967_001:0135b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仙人者釋迦，爾女者耶輸也。",
        "translation": "That immortal is Śākyamuni, and that woman is Yaśodhar.",
        "source": "T47n1967_001:0135b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法華會上，未來成佛，號具足千萬光相如來。」",
        "translation": "At the Lotus assembly, he'll become a future Buddha and be called the Tathāgata with a thousand thousand luminous marks.\"",
        "source": "T47n1967_001:0135b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而又念佛之人，但覩嬖女之玉容，不念光相之金好，而失不輕之旨也。",
        "translation": "Also, people who are mindful of the Buddha only see the jeweled features of the courtesan and don't think about the golden beauty of the luminous features, and they lose the idea that they're not despised.",
        "source": "T47n1967_001:0135b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛三昧安得不誣哉？",
        "translation": "How can the samādhi of mindfulness of the Buddha not be misconstrued?",
        "source": "T47n1967_001:0135b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又阿那律昔為盜首，入寺盜佛額珠，箭挑佛燈，令清光不滅。",
        "translation": "Aniruddha also used to be the head thief who entered a temple, stole the Buddha's forehead pearl, and picked the Buddha's lamp with an arrow so that its clear light wouldn't go out.",
        "source": "T47n1967_001:0135b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿那律者此翻無滅，良在茲焉，當來作佛號普明如來，皆此例也。",
        "translation": "This is a good example of what Aniruddha means by not ceasing, and this is an example of the future making of the Buddha's name, Prabhūtaratna.",
        "source": "T47n1967_001:0135b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛之人，尚不輕於群盜，況於不盜者乎？",
        "translation": "A person who is mindful of the Buddha doesn't despise a group of thieves, so why wouldn't he despise someone who doesn't steal?",
        "source": "T47n1967_001:0135b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來兩佛，猶如皎日，何慮三昧而不成焉？",
        "translation": "The next two buddhas will be like bright suns, so why wouldn't samādhi be unattained?",
        "source": "T47n1967_001:0135b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持戒、破戒但生佛想門第三問曰：「兩難釋矣，《梵網經》曰：『若人受佛戒，即入諸佛位。』",
        "translation": "The third question of the approach of observing and violating the precepts but giving rise to thoughts of the Buddha says, \"The two difficulties are well explained. The Sutra of Brahmā's Net says, 'If a person accepts the Buddha's precepts, they will enter the Buddhahood.'",
        "source": "T47n1967_001:0135b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而緇服之流，佩明月之戒，懸瓔珞之珠，參位三尊，範圍七眾，宜其敬矣！",
        "translation": "It's fitting that a black-robed monk wearing the moon-colored precepts and dangling a bead of diadem should sit at the head of the three honored ones and range over seven congregations.",
        "source": "T47n1967_001:0135b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苟非精持，動行顛沛，慢何過焉？",
        "translation": "If someone doesn't maintain vigorously, what's wrong with being arrogant when their actions are turbulent?",
        "source": "T47n1967_001:0135b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "垂何罪焉？",
        "translation": "What crime does he commit?",
        "source": "T47n1967_001:0135b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "望為剖之。」",
        "translation": "I hope you'll dissect it for me.\"",
        "source": "T47n1967_001:0135b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「如來甞於《三昧海經》為父王說：『昔有四比丘，犯律為恥，將無所怙。",
        "translation": "He replied, \"The Tathāgata once told his father in the Samādhi Sea Sutra, 'Once there were four monks who were ashamed of violating the precepts and would have no one to turn to.'",
        "source": "T47n1967_001:0135b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忽聞空中聲曰：「汝之所犯，謂無救者，不然也。",
        "translation": "Suddenly, he heard a voice in the air saying, 'Your violation was said to be hopeless, but it wasn't.'",
        "source": "T47n1967_001:0135b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空王如來雖復涅槃，形像尚在，汝可入塔，一觀寶像眉間白毫。」",
        "translation": "Although the Tathāgata Emptiness King has since passed away, his image is still there; go inside the stūpa and take a look at the white tuft between the precious image's eyebrows.\"",
        "source": "T47n1967_001:0135b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘隨之，泣淚言曰：「佛像尚爾，況佛真容乎！」",
        "translation": "The monk followed him, weeping and saying, \"Even so, the Buddha's image is still there, so why wouldn't you want to see the Buddha's true face?\"",
        "source": "T47n1967_001:0135b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉身投地，如大山崩。",
        "translation": "Lifting his body, he threw it to the ground like a great mountain crumbling.",
        "source": "T47n1967_001:0135c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今於四方，皆成正覺。",
        "translation": "Now, in the four directions, they've all become perfectly enlightened.",
        "source": "T47n1967_001:0135c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方阿閦佛，南方寶相佛，西方無量壽佛，北方微妙聲佛，是四破戒比丘也。』",
        "translation": "Akṣobhya in the east, Baoshya in the south, Limitless Life Buddha in the west, and Sublime Sound Buddha in the north are the four monks who have broken the precepts.'",
        "source": "T47n1967_001:0135c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以如來名此觀佛三昧，為大寶王戒品海者，可以滌破戒之罪垢，得塵累之清淨也。",
        "translation": "That's why the Tathāgata calls this meditation on the Buddha an ocean of the great jeweled king's precepts, which purifies the stain of breaking the precepts and obtains the purity of worldly accumulation.",
        "source": "T47n1967_001:0135c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四比丘，一觀寶像僉為世雄，念佛之人，豈得惑於破戒之僧歟？",
        "translation": "These four monks are heroes of the world when they contemplate a jeweled image, so how could someone who recites the Buddha be confused by a monk who breaks the precepts?",
        "source": "T47n1967_001:0135c05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《大集經》云：『若諸王臣，打罵出家持戒、破戒，罪同出百億佛身血。』",
        "translation": "That's why the Mahāsaṃgha-sūtra says, 'If kings and ministers ridicule laymen for upholding or violating the precepts, the crime is the same as spilling ten billion buddhas' blood.'",
        "source": "T47n1967_001:0135c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見被袈裟者，無論持、犯，但生佛想。",
        "translation": "If someone wearing the reddish-brown robes sees them, no matter how much they uphold or violate the precepts, they'll only give rise to the contemplation of a buddha.",
        "source": "T47n1967_001:0135c08_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛想者，念佛三昧也。",
        "translation": "Buddha-association is the samādhi of mindfulness of the Buddha.",
        "source": "T47n1967_001:0135c09_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯之金口，明不輕之深旨也。",
        "translation": "This is the profound meaning of this golden mouth that shows that it's not to be despised.",
        "source": "T47n1967_001:0135c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安得恣行打罵而不懼哉？",
        "translation": "How can they wantonly scold and not be afraid?'",
        "source": "T47n1967_001:0135c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：『寧為心師，不師於心。』",
        "translation": "The sūtra says, 'It's better to be a teacher of the mind than to be a teacher of the mind.'",
        "source": "T47n1967_001:0135c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見慳貪人，作施想；見破戒人，作持戒想。",
        "translation": "Seeing someone who's stingy and greedy, they conceptualize generosity; seeing someone who's broken the precepts, they conceptualize upholding the precepts.",
        "source": "T47n1967_001:0135c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫然則不為六蔽境界所纏，蓋成六度彼岸之觀門焉！",
        "translation": "If this is the case, then he won't be tethered by the six obscurations, but rather he'll achieve the sixth perfection of contemplation.",
        "source": "T47n1967_001:0135c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若住分別之心，自取冥司之罰，不亦哀哉！",
        "translation": "Wouldn't it be sad if someone abides in a discriminating mind and takes the punishment of the underworld upon themselves?",
        "source": "T47n1967_001:0135c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能翻此見心，則念佛三昧如川之流矣。」",
        "translation": "If he can turn this view around, then nianfo samādhi will flow like a river.\"",
        "source": "T47n1967_001:0135c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現處湯獄不妨受記門第四",
        "translation": "The Fourth Gate of Not Being Able to Receive Knowledge of the Present Place of Soup and Hell",
        "source": "T47n1967_001:0135c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「若破戒觀佛皆成正覺，固不可輕，可信矣。",
        "translation": "He asked, \"If people who violate the precepts and contemplate the Buddha have all become fully awakened, they certainly shouldn't be taken lightly, and it's reliable.",
        "source": "T47n1967_001:0135c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如現處湯獄或嬰鬼趣，菩提難發，河清未期，安得來敬同於念佛之士歟？」",
        "translation": "If they are now in a hell of boiling water or in the destiny of infants and ghosts, where bodhi is difficult to achieve and the river is not yet clear, how can they come to honor someone who is mindful of the Buddha?\"",
        "source": "T47n1967_001:0135c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「豈不聞夫采良藥者，必在山險，非華堂所出；集法藥者，必在於險有，非無為自出。",
        "translation": "They replied, \"Haven't you heard that someone who picks good medicine must be in a mountainous region and not out of a flowery hall, and someone who gathers medicine for the Dharma must be in a dangerous place and not out of nothing?",
        "source": "T47n1967_001:0135c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則《首楞嚴經》說四種記：一、未發心記，二、初發心記，三、密與授記，四、現前授記。",
        "translation": "The Śūraṃgama-sūtra explains four kinds of assurance: 1. assurance of having yet to awaken the mind, 2. assurance of having first awakened the mind, 3. assurance of being given the secret formula, and 4. assurance of being given the present formula.",
        "source": "T47n1967_001:0135c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今雖現處鬼、獄，即未發心，佛記當來必發大志，遇真善友，行菩薩行，還成正覺。",
        "translation": "Even though he's now in a ghost or prison, which means he hasn't yet arisen his mind, the Buddha remembers that in the future he'll have a great intention, meet a true friend, practice bodhisattva actions, and return to become perfectly enlightened.",
        "source": "T47n1967_001:0135c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故不可輕，即是未發心之記也。",
        "translation": "Therefore, it's not to be taken lightly, which is to say that it's a prediction of a mind that has yet to be aroused.",
        "source": "T47n1967_001:0135c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說四種記時，迦葉白佛：『我等從今，當於一切眾生，生世尊想，若生輕心則為自傷。』",
        "translation": "When the Buddha spoke about the four kinds of remembrance, Kāśyapa said to the Buddha, 'From now on, we will give rise to the idea of the world-honored one for all sentient beings, and if we give rise to a despising mind, then we'll harm ourselves.'",
        "source": "T47n1967_001:0135c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：『善哉！",
        "translation": "The Buddha said, 'Good!",
        "source": "T47n1967_001:0135c27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "快說！",
        "translation": "Speak up!",
        "source": "T47n1967_001:0135c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人皆不應稱量眾生，唯有如來乃能量爾。",
        "translation": "'No one should measure sentient beings, but the Tathāgata alone does.",
        "source": "T47n1967_001:0135c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是因緣故，我勅諸聲聞及餘菩薩，於諸眾生，應生佛想。』",
        "translation": "Because of this reason, I've commanded śrāvakas and other bodhisattvas to give rise to the idea that all sentient beings should be buddhas.'",
        "source": "T47n1967_001:0135c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《華嚴經．普賢行願品》破百萬障門亦用此想。",
        "translation": "The Flower Ornament Sutra: Chapter of the Vows of Samantabhadra also uses this conception to break down the one million hindrances.",
        "source": "T47n1967_001:0136a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫如是則現居惡趣，蒙與記者，亦猶宅寶未開，不妨寶在於宅內，額珠鬪沒，何廢珠隱於額中。",
        "translation": "If someone thus lives in a bad destiny and is given a reporter, they're like a jewel in a house that's yet to be opened, or a jewel in a forehead that's been lost in a fight, why is the pearl hidden in the forehead?",
        "source": "T47n1967_001:0136a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不念眾生為當來佛，必以六塵為寇賊，則猶防魔軍自壞其壁壘，存敵國常起於怨仇，金革所以未寧，鼙鼓於焉尚振，安得高枕於其間哉？",
        "translation": "If they don't think of sentient beings as future buddhas and must regard the six dust motes as enemies and thieves, then they're like guarding against the demonic army destroying their own strongholds, keeping enemies in hostile countries where enmity always arises, and how can they rest high in the midst of a golden revolution that's still unsettled and a drum that's still beating?",
        "source": "T47n1967_001:0136a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若使不降者來降，不服者咸服，則使天下一統矣！",
        "translation": "If we make those who don't surrender come to surrender and those who don't submit submit to us, then the whole world will be unified!",
        "source": "T47n1967_001:0136a07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獵獵旌旗而焉用？",
        "translation": "What is the use of hunting flags?",
        "source": "T47n1967_001:0136a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "翩翩飛將而奚適？",
        "translation": "What is the fit of a flying general?",
        "source": "T47n1967_001:0136a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾將却馬以糞田，日出而作，日入而息，雖帝堯之聖，於我何力哉？",
        "translation": "I will leave my horse and dredge the fields, working at sunrise and retiring at sunset, even though it's the sage Emperor Yao, what power do I have?",
        "source": "T47n1967_001:0136a09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百姓日用而不知，方明聖化之廣被矣！",
        "translation": "When people use it every day but don't know it, it's clear that the noble teaching has been widely applied!",
        "source": "T47n1967_001:0136a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能悟色、聲而為佛者，念眾生為當來佛者，必不立心前之凡境也，或想自身為本尊也，瑜伽真言深妙觀門，不謀而會。",
        "translation": "If someone can awaken to form and sound and become a buddha, and if they are mindful of sentient beings as future buddhas, they certainly won't establish the worldly objects in front of their minds or conceive of themselves as the original Buddha, which are profound and subtle contemplations of the true words of yoga that are not mutually agreed upon.",
        "source": "T47n1967_001:0136a11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫因想而有者，豈得不空哉？",
        "translation": "When something exists because of conception, how can it not be empty?",
        "source": "T47n1967_001:0136a14_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則大鵬將尺鷃以齊，太山與秋毫而一，無夷岳之僻，續鳧之憂矣。」",
        "translation": "Then Dapeng will be equal in size to a bird, and Taishan will be the same as an autumnal hair, so he won't have the isolation of Yishan and the worry of continued ducks.\"",
        "source": "T47n1967_001:0136a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「湯獄之子殊未發心，如來法王宥過與記，千光散射，十號圓明。",
        "translation": "He asked, \"Even though the sons of Tang and Hell have yet to develop their minds, the Tathāgata, the king of the Dharma, excuses mistakes and gives assurances, scattering a thousand lights and ten epithets with perfect clarity.",
        "source": "T47n1967_001:0136a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誠如弗言，孰敢不信？",
        "translation": "Who would dare to disbelieve it if it were truly so?",
        "source": "T47n1967_001:0136a18_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "原夫未悟，從何得醒耶？」",
        "translation": "How did the original man awaken before he realized it?\"",
        "source": "T47n1967_001:0136a18_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「言未悟者，亦有義焉。",
        "translation": "They replied, \"There's meaning in saying that someone has yet to awaken.",
        "source": "T47n1967_001:0136a19_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫長江之源濫乎一觴，大迷之本存乎二見。",
        "translation": "The source of the Yangzi River is confined to one single dip, and the root of great delusion exists in two views.",
        "source": "T47n1967_001:0136a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若謂念外立無念，生外立無生，則生死異於涅槃也。",
        "translation": "If mindfulness is posited as the absence of mindfulness outside of mindfulness and birth as the absence of birth outside of birth, then birth and death are different from nirvāṇa.",
        "source": "T47n1967_001:0136a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "萬佛洪音，莫之能訓矣！",
        "translation": "There's no one else who can teach this, except the torrential voice of myriad buddhas!",
        "source": "T47n1967_001:0136a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若了念而無念，觀生而不生，煩惱即菩提也。",
        "translation": "If he perceives mindfulness and has no mindfulness, and observes birth and non-birth, then affliction is enlightenment.",
        "source": "T47n1967_001:0136a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一相莊嚴，斯之能悟矣！",
        "translation": "Adorned by one characteristic, this is how one can be enlightened!",
        "source": "T47n1967_001:0136a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦猶巖上群蜂已房純蜜，井中七寶何廢稱珍，皆本有之，非適今也。",
        "translation": "They're like the swarm of bees on the cliff that has produced pure honey, or the seven treasures in the well that aren't precious, for they all existed in the past and don't apply to the present.",
        "source": "T47n1967_001:0136a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念未來佛，罪從何生，吾放其心，遍一切所緣之處，皆見如來，道從恚等生。",
        "translation": "Remembering the Buddha of the future and where sins will arise, I release my mind to see the Tathāgata in all places of reference, and the path is born from anger and so forth.",
        "source": "T47n1967_001:0136a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是乎，在《如來藏經》，佛告金剛慧菩薩言：『善男子，我以佛眼，觀一切眾生貪欲、恚、癡諸煩惱中，有如來智、如來眼、如來身，結加趺坐，儼然不動。",
        "translation": "Thus, in the Tathāgatagarbha Sutra, the Buddha addressed the bodhisattva Vajra Wisdom, saying, 'Good sons, with the Buddha's eye, I observe that among the afflictions of desire, anger, and delusion in all sentient beings, there's the Tathāgata's wisdom, the Tathāgata's eye, and the Tathāgata's body, sitting cross-legged and motionless.",
        "source": "T47n1967_001:0136a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至德相備足，如我無異。』",
        "translation": "Up to the point where their virtues are complete, they're no different than I am.'",
        "source": "T47n1967_001:0136b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣說一切眾生，有如來藏，以九喻況之。",
        "translation": "It's explained in detail that all sentient beings have the tathāgatagarbha, and nine metaphors are used to describe it.",
        "source": "T47n1967_001:0136b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《寶性論》釋而結頌言：「『萎華中諸佛，　　糞穢中真金，　　地中珍寶藏，　　諸果子中牙，　　朽故弊壞衣，　　纏裹真金像，　　貧賤醜陋女，　　懷轉輪聖王，　　焦黑泥模中，　　有上妙寶像。",
        "translation": "The Jeweled Nature Treatise explains and concludes with this verse, \"The buddhas are among the withered flowers, true gold among the excrement, a store of precious treasures in the earth, teeth among the fruits, rotted and tattered clothing, a true gold image wrapped in a cloth, a poor and ugly woman harboring a wheel-turning sage king, and a wonderfully jeweled image in a charred black clay mold.",
        "source": "T47n1967_001:0136b03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　眾生貪瞋癡，　　妄想煩惱等，　　塵勞諸境中，　　皆有如來藏。",
        "translation": "In the objects of dust and trouble of sentient beings' greed, anger, delusion, and affliction, there's the Tathāgata's storehouse.",
        "source": "T47n1967_001:0136b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　下至阿鼻獄，　　皆有如來身，　　真如清淨法，　　名為如來體。』",
        "translation": "Down to the avīci hell, there's the Tathāgata's body, which is truly pure and called the Tathāgata's body.'",
        "source": "T47n1967_001:0136b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以此文證湯獄之記，頓覺明焉。",
        "translation": "\"Using this text to confirm the account of the hot-water hell, I suddenly realized how clear it was.",
        "source": "T47n1967_001:0136b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三昧門自然洞啟。」",
        "translation": "The gate of samādhi is naturally revealed through insight.\"",
        "source": "T47n1967_001:0136b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「至人用心，澹然清淨，攀緣永絕。",
        "translation": "He asked, \"The mind of the supreme person is calm and pure, and attachments are permanently eliminated.",
        "source": "T47n1967_001:0136b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今說放心遍緣一切所緣之處皆見如來，教何在焉？」",
        "translation": "Now, when he says he's assured that he'll see the Tathāgata in all places of reference, what's the teaching?\"",
        "source": "T47n1967_001:0136b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「亦有教說，起心遍緣六塵三業仍發妙願，入佛境界，一一緣起不離如來，名悉皆見矣。",
        "translation": "They replied, \"There's also a teaching that says when you arouse the mind to pervasively observe the six dust motes and three activities and still give rise to the marvelous vow, you'll enter the Buddha's realm, and each one of those conditions arises without departing from the Tathāgata, which is called seeing them all.",
        "source": "T47n1967_001:0136b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是圓見，非由眼也。",
        "translation": "This is a perfect view, not from the eye.",
        "source": "T47n1967_001:0136b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《涅槃經》云：『聲聞人雖有天眼，名為肉眼；學大乘者雖有肉眼，名為佛眼。",
        "translation": "That's why the Nirvana Sutra says, 'Although a direct disciple has the divine eye, he's called the physical eye; a trainee in the great vehicle has the physical eye, but he's called the Buddha's eye.",
        "source": "T47n1967_001:0136b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is that?",
        "source": "T47n1967_001:0136b20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曉了己身，有佛性故。』",
        "translation": "It's because they understand their own body and have the buddha-nature.'",
        "source": "T47n1967_001:0136b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如《勝天王經》中，佛告天王菩薩摩訶薩：『以方便力行般若波羅蜜，於一切法，心緣自在。",
        "translation": "In the Sutra of King of Victory, the Buddha told the king of gods, the bodhisattva Mahāsattva, 'Practice the perfection of wisdom with the power of skillful means, and in regard to all things, your mind is unimpeded in regard to perceiving them.",
        "source": "T47n1967_001:0136b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣一切色，願得佛色，無所得故；心緣眾聲，願得如來微妙音聲；心緣眾香，願得如來清淨戒香；心緣諸味，願得如來味中第一大丈夫相；心緣諸觸，願得如來柔軟手掌；心緣諸法，願得如來寂靜之心；心緣自身，願得佛身；心緣自口，願得佛口；心緣自意，願得如來平等之意。』",
        "translation": "He focuses his mind on all forms and wishes to attain the Buddha's form, which is unobtainable; he focuses his mind on sounds and wishes to attain the Tathāgata's subtle sounds; he focuses his mind on fragrances and wishes to attain the Tathāgata's pure moral fragrance; he focuses his mind on flavors and wishes to attain the Tathāgata's most powerful characteristic among flavors; he focuses his mind on tactile objects and wishes to attain the Tathāgata's gentle palms; he focuses his mind on dharmas and wishes to attain the Tathāgata's quiescent mind; he focuses his mind on himself and wishes to attain the Buddha's body; he focuses his mind on his own mouth and wishes to attain the Buddha's mouth; and he focuses his mind on his own thoughts and wishes to attain the Tathāgata's equal thoughts.'",
        "source": "T47n1967_001:0136b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天王菩薩摩訶薩行般若波羅蜜，無有一心、一行空過不向薩婆若者，遍緣諸法而能不著，觀見諸法，無不趣向菩提之道。",
        "translation": "When the god king bodhisattva Mahāsattva practices prajñāpāramit, there's not a single thought or line of conduct that's more than empty and doesn't lead to sarvajña, which pervades all dharmas and yet allows him not to be attached to them, and he observes all dharmas and doesn't fail to reach the path to enlightenment.",
        "source": "T47n1967_001:0136b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩修習諸行，皆因外緣而得成立。",
        "translation": "The practices that bodhisattvas cultivate are all established by external conditions.",
        "source": "T47n1967_001:0136c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如大地住在水上，若鑿池井，即得水用；其不鑿者，無由見之。",
        "translation": "It's also like the earth that lives on water; if you dig a well, you'll get the use of the water; if you don't dig it, there's no way to see it.",
        "source": "T47n1967_001:0136c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是聖智境界遍一切法，若有勤修般若方便，則便得之；其不修者，云何能得心緣之理？",
        "translation": "Thus, the realm of noble cognition pervades all dharmas, and if someone diligently cultivates the method of prajñā, they'll attain it; if they don't cultivate it, how can they attain the principle of mental conditioning?",
        "source": "T47n1967_001:0136c05_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈不大哉！」",
        "translation": "How could it not be great?\"",
        "source": "T47n1967_001:0136c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀空、無我擇善而從門第五問曰：「即動而靜，靜為躁君，即凡而聖，聖隱凡內，謹聞遐旨。",
        "translation": "The fifth question of the approach of observing emptiness and selflessness and selecting the good and following it asked, \"That is, when there's movement, there's stillness, and stillness is the ruler of agitation; that is, when there are worldlings, there are sages, and sages hide within worldlings, so I've heard about the distant goal.",
        "source": "T47n1967_001:0136c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又三教無我，理既不殊，擇善而從，其義焉在？」",
        "translation": "Since the three teachings are without self and the principles are not different, what is the meaning of selecting the good and following it?\"",
        "source": "T47n1967_001:0136c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「三教之理也，名未始異，理未始同。",
        "translation": "He replied, \"The principles of the three teachings are not yet different in name but not yet the same in principle.",
        "source": "T47n1967_001:0136c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且夫子四絕中：一無我者，謙光之義，為無我也；道無我者，長而不宰，為無我也；佛無我者，觀五蘊空，為無我也。",
        "translation": "Furthermore, among the four fetters of Fuzi, one is selfless, which is the meaning of humble illumination and is selfless; the Way is selfless, which is long and not stifling, and is selfless; and the Buddha is selfless, which is the contemplation of the emptiness of the five aggregates and is selfless.",
        "source": "T47n1967_001:0136c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上二教門都不明五蘊，孰辨其四諦、六度萬行、賢聖階級？",
        "translation": "If the above two teachings don't understand the five aggregates, who will discern the four truths, the six perfections, myriad practices, and the stages of goodness and nobility?",
        "source": "T47n1967_001:0136c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蔑然無聞，但和光同塵，保雌守靜，既慈且儉，不敢為天下先，各一聖也，安用商摧其淺深歟？",
        "translation": "They scorn to be unheard of, but they harmonize their light with the dust, preserve the feminine and keep quiet, are both kind and frugal, and don't dare to be the first in the world; they are each noble, so how can they be destroyed by business in terms of their shallowness and depth?",
        "source": "T47n1967_001:0136c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三教無我明矣。",
        "translation": "\"The three teachings are clear in their lack of self.",
        "source": "T47n1967_001:0136c18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "擇善而從者，謂三性之理，理無不在，修心之士，擇善而從，蓋謂不善無益於至真，無記雙亡於善惡，妨亂佛理，何莫由斯？",
        "translation": "Those who choose the good and follow it mean that the principle of the three natures is not absent in principle, and those who cultivate the mind choose the good and follow it, because it means that what's unskillful is not beneficial to the ultimate truth, and what's indeterminate is the loss of both good and evil, which disturbs the Buddha's principle, and why is there no way to do so?",
        "source": "T47n1967_001:0136c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故聖人簡之而不取也，故《涅槃經》云：『一闡提者，心不攀緣一切善法，乃至不生一念之善。』",
        "translation": "Therefore, the noble person simply does not take it, so the Nirvana Sutra says, 'Yicchanti is a person whose mind doesn't cling to all good qualities, even to the point of not producing a single thought of goodness.'",
        "source": "T47n1967_001:0136c21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是知，念佛三昧，善之最上，萬行元首，故曰三昧王焉。」",
        "translation": "This is why it's called the king of samādhi, because it's the highest of all good qualities and the head of all conditioned things.\"",
        "source": "T47n1967_001:0136c23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無善可擇，無惡可棄門第六問曰：「若擇善而從者，何不擇諸佛之善，棄眾生之惡，乃念未來諸佛，而同過、現正覺耶？」",
        "translation": "The sixth question of the gate of no good to choose and no evil to discard was, \"If you choose the good and follow it, why don't you choose the good of the buddhas and discard the evil of sentient beings, mindful of future buddhas and equally faulty and currently enlightened?\"",
        "source": "T47n1967_001:0136c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「不易來問，自成我答。",
        "translation": "He said, \"It's not easy to ask a question and have it answered by me.",
        "source": "T47n1967_001:0136c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "What is it?",
        "source": "T47n1967_001:0136c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "擇善而從者，蓋不得已而言之，為力微任重，不能即惡而善、即妄而真，故以明之。",
        "translation": "\"He chooses the good and follows it because he has no choice but to say so, because his strength is slight and his responsibilities are heavy, and he can't make what's bad good and what's false true, so he explains it.",
        "source": "T47n1967_001:0136c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苟能念未來之佛，叶不輕之行，天地一指，萬物一馬，眾生皆佛，此土常淨，異鶖子之土石砂礫，同梵王之珍寶莊嚴，擇善之至矣！",
        "translation": "If someone can remember the buddhas of the future and conduct themselves in a way that's not despised, then with one finger on heaven and earth and one horse on everything, all sentient beings will be buddhas, and this land will always be pure, unlike the lackluster sons' dirt and gravel and the Brahma kings' precious treasures and adornments, that's the ultimate in choosing what's good!",
        "source": "T47n1967_001:0137a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無惡可棄矣！",
        "translation": "There is no evil to be cast off!",
        "source": "T47n1967_001:0137a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即天台智者，釋《法華經》明絕待之妙，引證曰：「『眾生見劫盡，　　大火所燒時，　　我此土安隱，　　天人常充滿，　　園林諸堂閣，　　種種寶莊嚴。』",
        "translation": "That is, Tendai Zhizhe explained the Lotus Sutra's explanation of the wonders of cutting off expectations, citing the proof, \"'When sentient beings see the end of the eon and are burned by the great fire, my land is peaceful, filled with gods and humans, and adorned with various treasures in its parks and halls.'",
        "source": "T47n1967_001:0137a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又《勝天王經》曰：『佛所住處，實無穢土，眾生薄福，而見不淨。』",
        "translation": "\"Also, the Pravara-deva-rāja-sūtra says, 'Where the Buddha lives, there's really no defiled land, but sentient beings are weak in merit and see impurity.'",
        "source": "T47n1967_001:0137a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "良在此焉。",
        "translation": "Here's where it's good.",
        "source": "T47n1967_001:0137a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵云南無，唐言歸命；梵云阿彌陀，唐言無量壽。",
        "translation": "The Sanskrit word yun is 無, which is Tang for taking refuge in the life of the Buddha, and the Sanskrit word amida is 無限壽.",
        "source": "T47n1967_001:0137a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三世諸佛，豈祇一佛而有壽量耶？",
        "translation": "Of all the buddhas of the three times, isn't there just one that has a lifespan?",
        "source": "T47n1967_001:0137a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今與子同念于三世彌陀，同生于十方極樂，有何不可？",
        "translation": "Now, why shouldn't we and our son be mindful of the three times of Amitâbha and be born together in the paradise of the ten directions?",
        "source": "T47n1967_001:0137a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而欲鷁路退飛哉？",
        "translation": "What about the desire to fly backwards in the road?",
        "source": "T47n1967_001:0137a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫然則烈三昧之猛焰也，不居於纖妄蚊蜹，鏗十念之洪鐘也，不間於散亂稱佛，明矣。",
        "translation": "If that's the case, then the fierce flame of samādhi doesn't reside in a tiny, deluded mosquito, and the flooding bell of the ten invocations doesn't interfere with the distracting praise of the Buddha, clearly.",
        "source": "T47n1967_001:0137a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念彌陀通三世既爾，念諸佛菩薩，不亦然歟？」",
        "translation": "If it's true that mindfulness of Amitâbha penetrates the three times, wouldn't it also be true of mindfulness of the buddhas and bodhisattvas?\"",
        "source": "T47n1967_001:0137a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「念未來佛，即與過、現諸佛等者，願聞其理也。」",
        "translation": "He asked, \"That mindfulness of future buddhas is the same as past and present buddhas, and I'd like to hear about their principle.\"",
        "source": "T47n1967_001:0137a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「《華嚴經》云：『一切諸如來，同共一法身，一身一智慧，力、無畏亦然。』",
        "translation": "He replied, \"The Huayan Sutra says, 'All tathāgatas share the same single Dharma body and the same single body of wisdom, as do their powers and fearlessness.'",
        "source": "T47n1967_001:0137a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《楞伽》偈云：『迦葉、拘留孫、拘那含我是，以此四種等，我為佛子說。』",
        "translation": "The verse from the Laṅkâvatāra says, 'Kāśyapa, Kauṣṭhila, and Kanakam are I. These are the four kinds of equality that I teach for the Buddha's children.'",
        "source": "T47n1967_001:0137a19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言四等者，一、字等，同名佛也，二、語等，皆具迦陵頻伽梵音聲相，三、法等，盡得菩提分法無障礙智也，四、身等，法身、色身相好無差也。",
        "translation": "The four kinds of equality are: 1. equality in word, which is the same name as the Buddha; 2. equality in speech, which is the combination of the sound of the Kaliṅkāra sound; 3. equality in teaching, which is the attainment of the full range of the factors of enlightenment without obstructive cognition; and 4. equality in body, which is the absence of distinctions in the appearance of the Dharma body and the form body.",
        "source": "T47n1967_001:0137a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《起信論》云：『依方故迷，方實不轉。』",
        "translation": "The Awakening of Faith says, 'It's because of this direction that one is confused, and this direction really isn't changing.'",
        "source": "T47n1967_001:0137a24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫如是則悟者悟於一方，群方自正；念者念於一佛，諸佛現前。",
        "translation": "In this way, those who are enlightened will be enlightened in one direction, and all directions will be corrected on their own; those who are mindful will be mindful of a single Buddha, and the Buddhas will appear before them.",
        "source": "T47n1967_001:0137a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經所謂：『水不上升，月不下降。』",
        "translation": "As the sūtras say, 'Water doesn't rise, and the moon doesn't fall.'",
        "source": "T47n1967_001:0137a26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光淨因緣，虛空皓月，現於清水；彼佛不來，我身不往，念佛因緣，如來寶月，現於心水。",
        "translation": "For reasons of purity and light, the white moon of the sky appears in clear water; when that Buddha doesn't come, my body doesn't go, and for reasons of mindfulness of the Buddha, the Tathāgata's precious moon appears in the water of the mind.",
        "source": "T47n1967_001:0137a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如說頌曰：『菩薩清涼月，遊於畢竟空，眾生心水淨，菩提影現中。』」",
        "translation": "As the verse goes, 'The bodhisattva's cool moon travels through the ultimate emptiness, the minds of sentient beings are purified, and the shadow of enlightenment appears in it.'",
        "source": "T47n1967_001:0137a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生肉不可食門第七",
        "translation": "Gate 7: The Inedible Meat of All Sentient Beings",
        "source": "T47n1967_001:0137b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「肉者人之所食，而念佛之家，絕之何耶？」",
        "translation": "He asked, \"Meat is what people eat, but what does a house of mindfulness of the Buddha reject?\"",
        "source": "T47n1967_001:0137b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「夫尸毘救鴿，上稱方平者，王禽異也，保命一也。",
        "translation": "He said, \"Suppose Śivi rescues a pigeon and the king calls it Fangping, for it's a different bird and it's the same as preserving life.",
        "source": "T47n1967_001:0137b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安得固食其肉，用資敗軀，而兀兀然，不知其懼哉？",
        "translation": "How could he not eat his flesh and use it to defeat his body while standing tall, not knowing his fear?",
        "source": "T47n1967_001:0137b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苟能悟之，為未來諸佛者，孰肯飛白刃於赤鱗，放蒼鷹於狡兔，如夕蛾投火自取其斃歟！",
        "translation": "If someone can awaken to this, then who among the buddhas of the future would be willing to fly a white blade over a red scales, release a blue eagle over a cunning rabbit, or take their own life like a moth throwing itself into a fire at sunset?",
        "source": "T47n1967_001:0137b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《楞伽》、《寶積經》、〈佛語心品〉偈云：「『為利殺眾生，　　以財網諸肉，　　二俱是惡業，　　死墮叫喚獄。』",
        "translation": "That's why the verse from the Laṅkâvatāra and Śākyamuni sūtras and the Chapter on the Buddha's Discourse on Mind says, \"To profit from the killing of sentient beings, we use our wealth to net meat, both of which are bad actions that bring death and fall into the hell of wailing.\"",
        "source": "T47n1967_001:0137b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「以斯聖旨，若不施此財，則網者、屠者自息矣。",
        "translation": "\"Based on this noble teaching, if we didn't give this wealth, then the netters and butchers would stop themselves.",
        "source": "T47n1967_001:0137b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且龍樹不輕於鴿雀，高僧不跨於蟲蟻。",
        "translation": "Moreover, a nāga tree doesn't despise a pigeon or a bird, and a high-ranking monk doesn't straddle a bug or an ant.",
        "source": "T47n1967_001:0137b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或問其故，答曰：『斯之與吾，同在生死，彼或將先成正覺，安可妄輕耶？』",
        "translation": "When asked about the reason, they replied, 'They and I are both in birth and death, and they may become perfectly enlightened first; how could they presume to despise them?'",
        "source": "T47n1967_001:0137b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "輕尚不可，豈得專食其血肉哉？",
        "translation": "How can we eat only their flesh and blood when we can't even take it lightly?",
        "source": "T47n1967_001:0137b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《寶性論》云：『《如來藏經》中告舍利弗言：「眾生者，即是第一義諦，即是如來藏，即是法身，即是菩提。」』",
        "translation": "The Jewel-Nature Treatise says, 'The Tathāgatagarbha Sutra tells Śāriputra, 'That's the sentient being, which is the cardinal truth, which is the Tathāgatagarbha, which is the Dharma body, and which is bodhi.'",
        "source": "T47n1967_001:0137b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾謂，太唯逐塊，不知逐人，塊終不息；唯念過、現不念未來，慢終不息。",
        "translation": "I say that if someone merely chases after lumps and doesn't know how to chase after people, the lumps will never stop, and if they only think about the past and present and don't think about the future, their conceit will never stop.",
        "source": "T47n1967_001:0137b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如師子而逐於人，其塊自息。",
        "translation": "If someone like the lion chases after people, the clumps will stop on their own.",
        "source": "T47n1967_001:0137b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞夫敬、慢之道，一以貫之，則移敬就慢，均父母於平人，逆之甚也！",
        "translation": "If you hear the way of reverence and pride and follow it consistently, then you'll be shifting reverence and pride, and you'll be like an ordinary person with equal parents.",
        "source": "T47n1967_001:0137b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "移慢就敬，均平人於父母，孝之大也！",
        "translation": "To remove pride and give respect, and to equalize people with their parents, is the height of filial piety!",
        "source": "T47n1967_001:0137b22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《梵網經》云：『六道眾生，皆是我父母，孝名為戒。』",
        "translation": "That's why the Sutra of Brahmā's Net says, 'All beings in the six destinies are my parents, and filial piety is called morality.'",
        "source": "T47n1967_001:0137b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "良在茲焉。",
        "translation": "Here's where it really comes in.",
        "source": "T47n1967_001:0137b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀六道為當來佛者，父母之談，猶近言耳。",
        "translation": "When we look at the six destinies as future buddhas, we're talking about parents as if they were close to our words.",
        "source": "T47n1967_001:0137b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能等沙彌之救蟻，促壽更延；同流水之濟魚，天華雨[卄/積]。",
        "translation": "If we can equal the śramaṇas who save the ants, we'll promote a longer life, and like the running water that helps the fish, the heavenly flowers will rain down [20/gather].",
        "source": "T47n1967_001:0137b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "革曠劫眾生之見，念未來善逝之身，糞穢之內，知有真金；重雲之間，信有明月。",
        "translation": "Overcoming the views of sentient beings in the vast past, they'll remember the body of the well-deceased in the future, knowing there's real gold in the dung, and believing there's a bright moon between heavy clouds.",
        "source": "T47n1967_001:0137b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則食肉之昏霧，生死之煙霾，慧風掃之，於三昧長空矣！",
        "translation": "Then the fog of meat-eating and the haze of birth-and-death are swept away by the wind of wisdom, and they're always empty in samādhi!",
        "source": "T47n1967_001:0137b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《梵網經》云：『我是已成佛，汝是當成佛，常作如是信，戒品已具足。』",
        "translation": "The Sutra of Brahmā's Net says, 'I am a buddha who has become a buddha, and you are a buddha who will become a buddha; always make this kind of faith, and the precepts will have been fulfilled.'",
        "source": "T47n1967_001:0137b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈得不念之哉？」",
        "translation": "How could you not be mindful of that?\"",
        "source": "T47n1967_001:0137c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「肉不可食，信之矣。",
        "translation": "The question was, \"Meat is inedible, so I believe it.",
        "source": "T47n1967_001:0137c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五辛如何？」",
        "translation": "What about the five spices?\"",
        "source": "T47n1967_001:0137c02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「聖教明之。",
        "translation": "They replied, \"The noble teaching makes it clear.",
        "source": "T47n1967_001:0137c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《大佛頂經》云：『佛告阿難：「是五種辛，熟食發淫，生噉增恚。",
        "translation": "The Mahābodhisattva Sutra says, 'The Buddha told Ānanda, \"These are five kinds of spices that ripened food causes lust and raw food increases anger.",
        "source": "T47n1967_001:0137c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是世界食辛之人，縱能宣說十二部經，十方天仙嫌其臭穢，咸皆遠離；諸餓鬼等，因彼食次，舐其脣吻，常與鬼住。",
        "translation": "Even if a person in this world who eats spices can preach twelve sutras, gods and sages in ten directions dislike their stench and keep away from them, while hungry ghosts and others lick their lips and kisses as a result of their eating, and they always live with the ghosts.",
        "source": "T47n1967_001:0137c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "福德日消，長無利益。",
        "translation": "Their virtue wanes day by day, and they'll never receive any benefit.",
        "source": "T47n1967_001:0137c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是食辛人，修三摩地，菩薩天仙十方善神不來守護，大力魔王得其方便。」",
        "translation": "When this person who eats spices cultivates samādhi, the bodhisattvas, gods, and sages in ten directions are not guarded by good spirits, and powerful demon kings are given access to their skillful means.\"",
        "source": "T47n1967_001:0137c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難：「修菩提者，永斷五辛，是則名為第一增進修行漸次。」』",
        "translation": "The Buddha told Ānanda, \"He who cultivates enlightenment and permanently stops the five spices is called the first to advance gradually in his cultivation.\"",
        "source": "T47n1967_001:0137c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯金口也，不亦誠哉？",
        "translation": "Isn't it true that this is the golden mouth of the buddhas?",
        "source": "T47n1967_001:0137c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "酒固不可言耳，《百喻經》云：『昔有貧人，在路而行，遇得一囊金錢，心大喜躍，即便數之，數未能周，錢主忽至，盡還奪去。",
        "translation": "While wine is certainly inexpressible, the Sutra of the One Hundred Parables says, 'Once there was a poor man walking along a road who came across a bag of money and was so elated that he counted it, but when he couldn't count it all, the money-lender suddenly arrived and took it away from him.",
        "source": "T47n1967_001:0137c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人當時，悔不疾去，懊惱之情，甚為苦極。",
        "translation": "At the time, that person regretted that they hadn't left quickly, and their feelings of remorse were so great that they were extremely distressed.",
        "source": "T47n1967_001:0137c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遇佛法者，亦復如是，雖得值遇三寶福田，不勤方便修行，而好多聞，忽爾命終，墮三惡道，如彼愚人，還為其主，奪錢而去。",
        "translation": "It's likewise with someone who encounters the Buddha's teaching. Even though they've met the blessed field of the Three Treasures and haven't diligently cultivated it with skillful means and heard much about it, suddenly their life ends and they fall into the three evil destinies, just like that foolish man who goes back to his master, takes the money, and leaves.",
        "source": "T47n1967_001:0137c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰：「『今日營此事，　　明自營彼事，　　樂著不觀苦，　　不覺死賊至，　　怱怱營眾務，　　凡人無不爾，　　如彼數錢人，　　其事亦如是。』」",
        "translation": "The verse says, 'Today I do this task, tomorrow I'll do that task, I'm attracted to it and don't contemplate suffering, I don't realize the approach of death as a thief, and I hurriedly go about my many tasks; no ordinary person is like that, just like that man who counts his money and does the same thing.'",
        "source": "T47n1967_001:0137c17_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已上七門，盡是念未來諸佛，以通三世之意也。",
        "translation": "The above seven categories are all about mindfulness of future buddhas in order to convey the meaning of the three times.",
        "source": "T47n1967_001:0137c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲念於彌勒佛者，必得上生兜率天宮，見慈氏之尊，則彌天釋道安，為其首唱耳。",
        "translation": "If someone wants to call to mind Maitreya Buddha, they must be born in the palace of Tuṣita Heaven and meet the Venerable Tzuśi, for whom Maitreya Daōan is the chief singer.",
        "source": "T47n1967_001:0137c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛三昧寶王論卷上",
        "translation": "Nianfo sanmei baowang lun shou",
        "source": "T47n1967_001:0137c25_0",
        "is_bad_quality": false
    }
]