[
    {
        "source_sentence": "念佛三昧寶王論卷中",
        "translation": "Nianfo sanmei baowang lun shou zhong",
        "source": "T47n1967_002:0138a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐、紫閣山草堂寺沙門飛錫撰念現在佛專注一境門第八問：「念未來佛即眾生是，已聞玄義，事廣理幽也。",
        "translation": "Tang, the ascetic Fei Xi of Cao Tang Temple on Mount Ziji wrote, \"The eighth question of the approach of concentrating on the single object of mindfulness of the present Buddha: 'Mindfulness of the future Buddha is that of sentient beings.' I've heard the profound meaning, which is both extensive in deed and esoteric in principle.",
        "source": "T47n1967_002:0138a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又恐心散難檢，今欲一以貫之，專西方念一佛，踐不退地，祛有漏心，乘扁舟於黃金之池，禮彌陀於白玉之殿，以通三世，希沾九品，不亦可乎？」",
        "translation": "I'm afraid it's difficult to examine a scattered mind, so now I want to stick to it, concentrate on the Western mindfulness of the one Buddha, practice irreversibility, rid the mind of contaminants, ride in a flat boat on a gold pond, worship Maitreya in a white jade hall, and penetrate the three times and hope to reach the nine levels, isn't that possible?\"",
        "source": "T47n1967_002:0138a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「《十住婆沙論》并龍樹菩薩造《釋華嚴經論》，〈易行行品〉云：『菩薩道有難行行，如陸地乘舟也；有易行行，如水路乘舟也。』",
        "translation": "He replied, \"In the Treatise on the Ten Abodes (Vasubandhu) and the Treatise on the Translation of the Flower Ornament Sutra by Long Shu Bodhisattva, the chapter on easy practices says, 'There are difficult practices in the bodhisattva path, like riding a boat on dry land, and there are easy practices, like riding a boat on a waterway.'",
        "source": "T47n1967_002:0138a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿彌陀佛本願之力，若人聞名稱念，自歸彼國，如舟得水，又遇便風，一舉千里，不亦易哉？",
        "translation": "By the power of Amitâbha's original vow, if a person hears his name and calls to mind, he can return to that country on his own, just like a boat that has gained water and met with a favorable breeze, and it's a thousand miles in one fell swoop, isn't that easy?",
        "source": "T47n1967_002:0138a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則釋迦如來父王眷屬，六萬釋種，皆生極樂土，蓋佛與此界眾生緣深也，專注一境，圓通三世，不亦良哉？」",
        "translation": "Then the Śākyamuni Tathāgata's father's retinue and 60,000 members of the Śākyamuni lineage were all born in the paradise land, because the Buddha's connection to sentient beings in this realm is so profound that he focuses on one object and perfectly penetrates the three worlds, isn't that wonderful?\"",
        "source": "T47n1967_002:0138a14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「專注一境，圓通三世，誠哉！",
        "translation": "The question was, \"Is it true that concentrating on one object can completely penetrate the three times?",
        "source": "T47n1967_002:0138a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然稱念自歸，往生彼國者，有為虛偽，風多浪鼓，曷若不馳想於外，但攝心於內，協無為之旨乎？」",
        "translation": "Still, someone who invokes mindfulness of self-retrogression and rebirth in another country has false ideas about what exists and many turbulent winds, so why not stop chasing after external ideas and focus the mind inward to help achieve the goal of nonproductivity?\"",
        "source": "T47n1967_002:0138a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「有為雖偽，捨之則道業不成；無為雖實，取之則慧心不朗。",
        "translation": "They replied, \"Although the existent is counterfeit, if you abandon it, the activity of the path won't be accomplished; although the nonexistent is real, if you acquire it, the mind of wisdom won't be clear.",
        "source": "T47n1967_002:0138a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：『厭離有為功德，是為魔業；樂著無為功德，亦為魔業。』",
        "translation": "The sūtra says, 'To be disillusioned with the merits of the existent is demonic activity; to be happily attached to the merits of the lack of activity is also demonic activity.'",
        "source": "T47n1967_002:0138a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子今厭樂交爭，得不入於魔骨也？",
        "translation": "Now, if you're disillusioned with interactions and disputes, will you not enter the demon's bones?'",
        "source": "T47n1967_002:0138a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又若聖賢攝心謂之內；凡夫馳想謂之外。",
        "translation": "\"Also, suppose a noble man collects his mind and calls it internal, while a worldling chases after concepts and calls it external.",
        "source": "T47n1967_002:0138a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苟以馳外為亂，住內為定，復是內外所馳，非所以念佛三昧攝心之意也。",
        "translation": "If we think that chasing outside is confusion and staying inside is concentration, we're again chasing inside and outside, which is not the point of collecting the mind for this nirvāṇa samādhi.",
        "source": "T47n1967_002:0138a24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《注維摩經》羅什法師云：『外國有一女，身體金色。",
        "translation": "In the Commentary on the Vimalakīrti Sutra, the teacher Rāṣṭrapāla said, 'In a foreign country, there was a woman whose body was golden.",
        "source": "T47n1967_002:0138a26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有長者子，名達暮多羅，以千兩金，邀入竹林，同載而去。",
        "translation": "An elderly man named Dharmatrāta invited her into a bamboo grove with a thousand taels of gold, and he carried her away with him.",
        "source": "T47n1967_002:0138a27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊於道中，變身為白衣士身，著寶衣，衣甚嚴好，女人見之，貪心內發。",
        "translation": "While on the path, Mañjuśrī transformed himself into a man in white wearing a jeweled robe that was so beautiful that when the woman saw it, her desire arose within her.",
        "source": "T47n1967_002:0138a28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊言：「汝欲得衣者，當發菩提心。」",
        "translation": "Mañjuśrī said, \"Those of you who want to be clothed should arouse the mind of bodhi.\"",
        "source": "T47n1967_002:0138b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "女曰：「何等為菩提心？」",
        "translation": "The woman said, \"What's the mind of enlightenment?\"",
        "source": "T47n1967_002:0138b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊言：「汝身是。」",
        "translation": "Mañjuśrī said, \"Your body is.\"",
        "source": "T47n1967_002:0138b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「云何是？」",
        "translation": "He asked, \"How is it?\"",
        "source": "T47n1967_002:0138b02_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「菩提性空，汝身亦空，是故。」",
        "translation": "She replied, \"The nature of bodhi is empty, and your body is also empty; therefore.\"",
        "source": "T47n1967_002:0138b03_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此女曾於迦葉佛所，多植善本，廣修智慧，聞是說已，即得無生法忍。",
        "translation": "That woman had planted much good roots and cultivated extensive wisdom at Kāśyapa Buddha's place, and after hearing this teaching, she attained the patience of the nonarising of the Dharma.",
        "source": "T47n1967_002:0138b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得是忍已，而將示欲之過，還與長者子入林。",
        "translation": "After attaining this forbearance, she showed him the error of her desires and returned to the elder son to enter the forest.",
        "source": "T47n1967_002:0138b05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既入林已，自現身死胮脹爛臭。",
        "translation": "After entering the forest, he revealed to himself that his body was dead, bloated, and smelly.",
        "source": "T47n1967_002:0138b06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者子見已，甚大怖畏，往詣佛所，佛為說法，亦得法忍。』",
        "translation": "When he saw that, the elder son was terrified and went to the Buddha, who taught him the Dharma and also attained the patience of the Dharma.'",
        "source": "T47n1967_002:0138b07_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大覺未成，未暇閑任，故名為忍。",
        "translation": "Since the great enlightenment has yet to be accomplished and he doesn't have time to be at ease, this is called forbearance.",
        "source": "T47n1967_002:0138b08_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如自觀身實相，觀佛亦然，女身空，佛身空，未始異也。",
        "translation": "Just as he observes the true characteristics of his body, he observes the same thing about the Buddha, which is that the woman's body is empty and the Buddha's body is empty, which is not always different.",
        "source": "T47n1967_002:0138b09_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提之義，豈得異乎？",
        "translation": "How could the meaning of enlightenment be different?",
        "source": "T47n1967_002:0138b10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫如是則一切有為即無為矣！",
        "translation": "If this is the case, then all existent activity is nothing!",
        "source": "T47n1967_002:0138b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切內外非內外矣！",
        "translation": "Everything inside and outside is not inside and outside!",
        "source": "T47n1967_002:0138b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然在有而未甞有，有而常無，居無而未甞無，無而恒有，何患之於佛有相心有念哉？」",
        "translation": "Still, if something exists but never comes to exist and remains nonexistent, and if nothing exists but never comes to nothing and remains nonexistent, why should it matter if the Buddha has marks and mindfulness?\"",
        "source": "T47n1967_002:0138b11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此生他生一念十念門第九",
        "translation": "ninth in the sequence of ten thoughts in this life and the other lives",
        "source": "T47n1967_002:0138b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「易行、難行之談，身即菩提之觀，其旨鏡焉。",
        "translation": "He asked, \"The discussion of easy and difficult practices and the contemplation that the body is enlightenment are the mirror of its meaning.",
        "source": "T47n1967_002:0138b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人生在世，石火電火，失念蹉跎，悔無所及。",
        "translation": "In this world, life is like flint and lightning, and when we lose our mindfulness and waste time, there's nothing we can do to regret it.",
        "source": "T47n1967_002:0138b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修道之人，尚不親心，況親於身，尚不親於身，況身外歟？",
        "translation": "A practitioner of the Way is not yet intimate with his mind, so why should he be intimate with his body?",
        "source": "T47n1967_002:0138b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常恐出息不還，屬於後世，狂風飄蓬，茫茫何之？",
        "translation": "I'm always afraid that if I don't return from my escape, I'll belong to a later generation, tossed about by the fierce wind, and left in the dark.",
        "source": "T47n1967_002:0138b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願示一念、十念之門，此生、他生之計。」",
        "translation": "May you show us the gate of one and ten kinds of mindfulness, and the plan for this life and other lives.\"",
        "source": "T47n1967_002:0138b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「夫淨土之會，功業之大者，二乘乃澄神虛無、耽空怖相，不念眾生，故無淨土；而大乘有之。",
        "translation": "He answered, \"Regarding the Pure Land assembly and the great work it accomplishes, the two vehicles are indifferent to the mind's voidness and fearfulness of emptiness and don't think about sentient beings, so there's no Pure Land; the great vehicle has it.",
        "source": "T47n1967_002:0138b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "按《悲華經》云：『阿彌陀佛，昔為轉輪王，名無諍念，七寶千子，悉皆具足。",
        "translation": "According to the Compassionate Flower Sutra, 'Amitâbha Buddha, who used to be the wheel-turning king and was called without critical thought, was fully endowed with a thousand sons of the seven jewels.",
        "source": "T47n1967_002:0138b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因寶海大臣為善知識，於寶藏佛所發菩提心，取於西方極樂淨土，則諸經中知名諸佛、菩薩、聲聞等，皆昔之千子也。",
        "translation": "Because the minister of the precious ocean was a good teacher, he aroused the mind of enlightenment in the jeweled store of buddhas and took refuge in the pure land of paradise in the West, then the well-known buddhas, bodhisattvas, śrāvakas, and so forth in the scriptures were all the thousand sons of yore.",
        "source": "T47n1967_002:0138b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其長太子，名不瞬，觀世音也；次子名摩尼，大勢至也；次子名王眾，文殊師利也；次子名能伽奴，即金剛智慧光明菩薩；次子名無畏，即蓮華尊如來；次子名菴婆羅，即虛空光明菩薩；次子名善臂，即師子香菩薩；次子名泯圖，即普賢也；次子名蜜蘇，即阿閦佛也。",
        "translation": "The eldest prince, named Buṣṭhila, was Avalokitêśvara; the second son, named Mani, was Mahāsthāmaprāpta; the second son, named Wangzong, was Mañjuśrī; the second son, named Nengganu, was Vajraśekhara; the second son, named Fearless, was the Lotus Tathāgata; the second son, named Ambala, was Sky Light Bodhisattva; the second son, named Shanban, was Shizi Xiang Bodhisattva; the second son, named Mantra, was Samantabhadra; and the second son, named Mimzo, was Akṣobhya.",
        "source": "T47n1967_002:0138b26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蜜蘇王子，一自發心已來，行時步步，心心數法，常念諸佛，今登正覺，生妙樂剎焉。』",
        "translation": "Since he first aroused his aspiration, Prince Miso has taken each step in his practice, counted the teachings in his mind, and always been mindful of the buddhas, and now he has attained perfect enlightenment and been born in the Serenity of Wonderful Bliss.'",
        "source": "T47n1967_002:0138c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾謂經行廣陌，從步幽林，則不異蜜蘇之見。",
        "translation": "I think it's no different than Miso's view when he walks through a wide road or follows a path through a secluded forest.",
        "source": "T47n1967_002:0138c05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若鳴珂入伏，動珮翰天，肅肅羽儀，駸駸車馬，安得不用心於步步之間哉？",
        "translation": "Suppose you were to sound a coral and enter a cave, move a robe and wreath a celestial, solemnly dress yourself in feathers, and drive a cart and horse, how could you not pay attention between each step?",
        "source": "T47n1967_002:0138c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今則例之，亦不移於前操矣！",
        "translation": "In this case, it is no different from the former practice!",
        "source": "T47n1967_002:0138c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫含齒戴髮，死生交際，未有無出、入息焉。",
        "translation": "When a person wears their teeth and hair on their head, there's nothing between death and birth that doesn't have an outgoing and incoming breath.",
        "source": "T47n1967_002:0138c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又一息不還，即屬後世者，亦誠如所問。",
        "translation": "It's also true that when one breath doesn't return, that person belongs to the afterlife.",
        "source": "T47n1967_002:0138c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世上之人，多以寶玉、水精、金剛、菩提木槵，為數珠矣；吾則以出、入息為念珠焉。",
        "translation": "Most people in the world use precious jade, aqua, adamant, or bodhi-wooden ring as several beads, but I use exhalation and inhalation as rosary beads.",
        "source": "T47n1967_002:0138c10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱佛名號，隨之於息，有大恃怙，安懼於息不還，屬後世者哉？",
        "translation": "They call on the Buddha's name, follow it with their breath, and have great reliance on it; why would they fear that their breath won't return and that they'll belong to a later life?",
        "source": "T47n1967_002:0138c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "余行、住、坐、臥常用此珠，縱今昏寐含佛而寢，覺即續之，必於夢中得見彼佛，如鑽燧煙飛火之前相。",
        "translation": "I often use this pearl when walking, standing, sitting, and lying down. Even now, when I'm asleep and sleep with the Buddha in my mouth, I'll continue to use it when I feel it, and I'll surely see the Buddha in my dream, like the shape of a flame flying from a flame of smoke.",
        "source": "T47n1967_002:0138c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夢之不已，三昧成焉，面覩玉毫，親蒙授記，則萬無一失也。",
        "translation": "When the dream doesn't end, samādhi will be complete, and I'll see the jade [hair] on my face and be personally given a prediction, so there won't be a single thing wrong with me.",
        "source": "T47n1967_002:0138c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子宜勉之。」",
        "translation": "You should strive for it, son.\"",
        "source": "T47n1967_002:0138c17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問：「一念、十念往生淨土，何者為正？」",
        "translation": "He also asked, \"Which is correct, one thought or ten thoughts of rebirth in the Pure Land?\"",
        "source": "T47n1967_002:0138c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「但一念往生，住不退地，此為正也。",
        "translation": "They replied, \"Only one thought of rebirth and abiding in the stage of nonretrogression is right.",
        "source": "T47n1967_002:0138c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如佛所說，謗佛、毀經，打僧、罵尊，五逆、四重，皆一念惡業成，墮無間獄猶如箭射。",
        "translation": "As the Buddha taught, denigrating the Buddha, disparaging sūtras, beating up monks, cursing the venerable, and committing the five heinous crimes and four grave offenses are all formed by a single thought of bad action, and falling into an unremitting hell is like being shot by an arrow.",
        "source": "T47n1967_002:0138c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今之念佛生于淨土，亦一念善業成即登極樂。",
        "translation": "Now, when mindfulness of the Buddha is born in the Pure Land, it's also the result of one thought of good action that ascends to paradise.",
        "source": "T47n1967_002:0138c20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如屈臂，前一念五陰滅，後一念五陰生，如蠟印印泥，印壞文成，尚不須兩念，豈要至十念哉？",
        "translation": "It's like flexing your arm, with the first thought of the five aggregates ceasing and the last thought of the five aggregates arising, like when you stamp clay with wax, and the stamp breaks down and the text is completed, it doesn't even take two thoughts, so how could it take ten?",
        "source": "T47n1967_002:0138c21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "打僧、罵尊，雖非正逆，是五逆之類也。",
        "translation": "Although beating up a saṃgha or cursing a venerable is not a righteous vice, it's one of the five kinds of transgressions.",
        "source": "T47n1967_002:0138c24_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又一念者，如經云：『愛酪沙彌，生一念愛心，後生酪中作蟲。』",
        "translation": "Also, that single thought is like the sūtra that says, 'A monk who loves cheese and gives rise to a single thought of love will later be born as a bug in cheese.'",
        "source": "T47n1967_002:0138c24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又大薩婆長者妻，坐對明鏡，自愛其身，海風破船，生故屍中作蟲，嬉戲往來，不離其所。",
        "translation": "Another great sahāva, the wife of an elder, was sitting facing a bright mirror and loved her body.",
        "source": "T47n1967_002:0138c26_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯皆一念，非十念也。",
        "translation": "These are all single thoughts, not the ten thoughts.",
        "source": "T47n1967_002:0138c28_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又《大無量壽經》明一念念佛皆得往生。",
        "translation": "The Sutra of Immeasurable Life also explains that one recitation of the Buddha's name will lead to rebirth.",
        "source": "T47n1967_002:0138c28_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《觀經》十念，良有以也。",
        "translation": "The Sutra of Contemplation's ten invocations is a good reason for that.",
        "source": "T47n1967_002:0138c29_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓋為遘疾尫羸力微心劣故，須十稱彌陀以助其念；若心盛不昧，一念生焉，亦猶栽植絲髮，其茂百圍也。」",
        "translation": "It's because of my illness, my weakness, and my weakness of mind that I need to give ten invocations to Maitreya to aid my mindfulness; if my mind is strong and unobstructed, then one thought will be born, which is like planting a silken hair that will grow a hundred strands.\"",
        "source": "T47n1967_002:0139a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心是佛，是心作佛門第十問曰：「經明是心是佛，是心作佛。",
        "translation": "The tenth question in the teaching, \"This mind is the Buddha, and this mind makes the Buddha,\" asked the sūtra, \"It's clear from the sūtras that this mind is the Buddha, and this mind makes the Buddha.",
        "source": "T47n1967_002:0139a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何用遠稱彌陀，存想於極樂之國；近念諸佛，興敬於未來之尊。",
        "translation": "Why do we call Amitâbha from afar and keep our thoughts in the paradise land and think of the buddhas from up close and raise our respects to the honored ones of the future?",
        "source": "T47n1967_002:0139a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此皆自外而求，豈曰是心是佛耶？」",
        "translation": "These are all sought from the outside, but is it said that this mind is the Buddha?\"",
        "source": "T47n1967_002:0139a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「子問非也。",
        "translation": "He replied, \"You're wrong to ask.",
        "source": "T47n1967_002:0139a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子但引經，不知經之所趣。",
        "translation": "You only cite the sūtras but don't know what they're about.",
        "source": "T47n1967_002:0139a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經者，《觀無量壽經》也，正明念阿彌陀之文矣。",
        "translation": "The sūtra is the Sutra of Contemplation on the Buddha of Immeasurable Life, which correctly explains the text of mindfulness of Amitâbha.",
        "source": "T47n1967_002:0139a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『以念佛故，佛從想生』，故云是心是佛。",
        "translation": "'It's because of mindfulness of the Buddha that the Buddha arises from perception,' so it's called 'this mind is the Buddha.'",
        "source": "T47n1967_002:0139a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安得竊取彌陀之觀，反噬彌陀之心者哉？",
        "translation": "How could someone steal Amitâbha's contemplation and devour Amitâbha's mind?",
        "source": "T47n1967_002:0139a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾，都不念佛，而言是心是佛者，亦應都不想惡，而言是心是惡耶？",
        "translation": "If so, should someone who doesn't think of the Buddha and says this mind is the Buddha also not think of evil and say this mind is evil?",
        "source": "T47n1967_002:0139a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼既不然，此亦焉可？",
        "translation": "If it's not like that, how can it be like this?",
        "source": "T47n1967_002:0139a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況彼極樂之國，彌陀至尊，十萬億之須彌山王，不與眼根為障礙，恒河沙之光明相好，由佛願力而想成，屈臂即得往生，寧計彼方之遠近也？」",
        "translation": "How much more so in that paradise, where Maitreya, the supreme one, the king of Sumeru mountains numbering a hundred thousand million, is not obstructed by the faculty of vision, where the radiant features of the Ganges River are created by the power of the Buddha's vow, and where rebirth is possible with the flexing of the arm, how could one count the distance to another place?\"",
        "source": "T47n1967_002:0139a13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "。",
        "translation": "...",
        "source": "T47n1967_002:0139a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「是心是佛，敬聞其理也。",
        "translation": "He asked, \"This mind is the Buddha, and I respectfully hear its principle.",
        "source": "T47n1967_002:0139a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此經所明十六妙觀，韋提得之，則氷日可想，金山晃然，魔光、佛光，自觀、他觀，邪正混雜，若為澄渟？",
        "translation": "However, when the sixteen subtle contemplations explained in this sūtra are attained by Vaidehī, then the ice-sun can be imagined, the gold mountain is shaken, the Māra's light and the Buddha's light, self-contemplation and other contemplations, and right and wrong are mixed, so how can we clarify them?",
        "source": "T47n1967_002:0139a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願一一示之，令念佛人離師獨坐心安若海也。」",
        "translation": "May I show them one by one so that people who are mindful of the Buddha and sit alone apart from the teacher will have peace of mind like an ocean.\"",
        "source": "T47n1967_002:0139a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「氷想者，為琉璃地之張本也；日想者，作白毫光之由漸也。",
        "translation": "He said, \"Ice perception is the basis for the emergence of the beryl ground, and sun perception is the cause for the gradual production of a white tuft of light.",
        "source": "T47n1967_002:0139a20_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依想而現，曰自、曰正；不依想現，則曰他、曰邪。",
        "translation": "When it's manifested based on perception, it's called self and right; when it's not manifested based on perception, it's called other and wrong.",
        "source": "T47n1967_002:0139a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本則想白毫，白毫不現，而未想紺目，紺目現，此乖其本心，豈不邪也？",
        "translation": "If someone originally conceived of a white tuft of hair and it doesn't appear, but they haven't conceived of the myriad eyes and they appear, this is a deviation from their original mind, isn't it wrong?",
        "source": "T47n1967_002:0139a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況諸想歟？",
        "translation": "how much more so in the case of concepts?",
        "source": "T47n1967_002:0139a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又魔光乃有影耀眼，佛光乃無影耀眼，故《楞伽》偈云：「『佛地名最勝，　　清淨妙莊嚴，　　照耀如盛火，　　光明悉遍至，　　熾焰不壞目，　　周輪化三有。』」",
        "translation": "Furthermore, demonic light has shadows that dazzle the eyes, but Buddha light has no shadows that dazzle the eyes. That's why the verse from the Laṅkâvatāra says, \"The Buddha-stage is called the most excellent, pure and exquisitely adorned, shining like a raging fire, its brilliance is universal, its blazing fire doesn't destroy the eyes, and it circumambulates the three realms.\"",
        "source": "T47n1967_002:0139a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問：「今之光現者，熾焰壞目，非魔如何？",
        "translation": "Q: \"Now, when that light appears, the blazing fire destroys the eyes, so what if it's not Māra?",
        "source": "T47n1967_002:0139b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光而不耀，非佛如何？」",
        "translation": "How is it not the Buddha who shines but does not shine?\"",
        "source": "T47n1967_002:0139b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答：「又光之真也，令念佛人身心澄渟清淨；光之偽也，令念佛人心躁動恍惚。",
        "translation": "Answer: \"Also, genuine light causes a mindfulness of the Buddha to be clear and pure in body and mind; counterfeit light causes a mindfulness of the Buddha to be agitated and in a trance.",
        "source": "T47n1967_002:0139b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《涅槃經》云：『澄渟清淨，即真解脫。",
        "translation": "That's why the Nirvana Sutra says, 'When it's clear and pure, that's true liberation.",
        "source": "T47n1967_002:0139b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真解脫者，即是如來。』",
        "translation": "To be truly liberated is to be a tathāgata.'",
        "source": "T47n1967_002:0139b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明矣！」",
        "translation": "It's clear!\"",
        "source": "T47n1967_002:0139b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問曰：「至人無思，而今用想，豈不謬哉？」",
        "translation": "He also asked, \"Isn't it wrong that the most excellent person has no thought, but now he uses thought?\"",
        "source": "T47n1967_002:0139b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「不謬也！",
        "translation": "They replied, \"It's not wrong!",
        "source": "T47n1967_002:0139b06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如《大威德陀羅尼經》云：『超過有結，應發欲心，想無欲事。』",
        "translation": "As the Dhāraṇī of the Greatly Powerful One says, 'Going beyond the bond of existence, one should arouse the mind of desire and conceive of things that have no desire.'",
        "source": "T47n1967_002:0139b06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今則例之，欲修念佛，應發想心，想無想事。",
        "translation": "Now, for example, if you want to cultivate mindfulness of the Buddha, you should arouse the mind of desire and conceive of things without desire.",
        "source": "T47n1967_002:0139b07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故《方等賢護經》云：『惡欲想女，夢見於女；善欲想佛，夢見於佛。』",
        "translation": "That's why the Sutra of Bhadrapāla says, 'When you think of a woman with bad desires, you'll see a woman in a dream; when you think of a Buddha with good desires, you'll see a Buddha in a dream.'",
        "source": "T47n1967_002:0139b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾謂二想名同，善、惡天隔，不可聞想，一概厭之。",
        "translation": "I think the two conceptions are the same in name, separated by the good and bad heavens, and are unheard of, so we should all dislike them.",
        "source": "T47n1967_002:0139b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若苟厭之，雖不毀經、不謗佛，則必生於無想天宮矣！",
        "translation": "If they are disliked, even though they don't disparage the sūtras or denigrate the Buddha, they'll surely be born in the palace of the nonconceptualized gods!",
        "source": "T47n1967_002:0139b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若固執無想而噬想佛者，則名謗法，以謗法故，遽入十方無擇之囹圄，未知出日，豈有天宮之望乎？",
        "translation": "If someone clings to nonconceptualization and devours the idea of the Buddha, then they are denigrating the Dharma, and because they denigrate the Dharma, they are rushed into the prison of nonselectivity in the ten directions without knowing the day of their release, so how could they ever hope to enter the heavenly palace?",
        "source": "T47n1967_002:0139b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縱令得生，名外道天，非解脫路。",
        "translation": "Even if they could be born, they'd be called a non-Buddhist heaven, not a path to liberation.",
        "source": "T47n1967_002:0139b14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《涅槃經》云：『隨聞毒鼓，遠近俱死。』",
        "translation": "The Nirvana Sutra says, 'After hearing a poisonous drum, they'll both die near and far.'",
        "source": "T47n1967_002:0139b15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此亦如是，隨其撥想，遠近俱墮。",
        "translation": "This is likewise, following the contemplation of setting it off, one falls both near and far.",
        "source": "T47n1967_002:0139b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經所謂：『或時離地一尺、二尺，往返遊行。』",
        "translation": "The sūtra says, 'Sometimes they stand a foot or two feet off the ground and march back and forth.'",
        "source": "T47n1967_002:0139b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯之謂矣！",
        "translation": "This is really the case!",
        "source": "T47n1967_002:0139b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈同於三界之流轉焉？",
        "translation": "Are they not the same as the transmigration of the three realms?",
        "source": "T47n1967_002:0139b17_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈同於九品往生焉？",
        "translation": "Are they not the same as the nine levels of rebirth?",
        "source": "T47n1967_002:0139b18_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況覆舟、載舟，水也；因倒、因起，地也。",
        "translation": "How much more so when the boat is covered and carried by water, and when the cause is inverted and the cause arises, it's also the ground?",
        "source": "T47n1967_002:0139b18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "想妄即眾生，想真即諸佛，離想之外，更用何焉？」",
        "translation": "When conception is false, it's sentient beings; conception is true, it's the buddhas; apart from conception, what else is there to use?\"",
        "source": "T47n1967_002:0139b19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「事解已竟，理何在耶？",
        "translation": "The question was, \"After understanding the facts, where are the principles?",
        "source": "T47n1967_002:0139b20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如《般舟三昧經》云：『心起想即癡，無想即涅槃。』",
        "translation": "As the Banzhou sanmei jing says, 'When the mind gives rise to conceptions, it's delusion; the absence of conceptions is nirvāṇa.'",
        "source": "T47n1967_002:0139b21_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今之用想，不亦然乎？」",
        "translation": "Isn't it also true that we now use conceptions?\"",
        "source": "T47n1967_002:0139b22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「不也！",
        "translation": "They replied, \"No!",
        "source": "T47n1967_002:0139b22_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若存所想之佛、能想之心，或避想佛，則以惡取空為無想者，則癡之甚也！",
        "translation": "If one maintains a mind that conceives buddhas, a mind that conceives, or avoids conceiving buddhas, then one takes the mistaken view of emptiness as no conception at all, which is the height of delusion!",
        "source": "T47n1967_002:0139b23_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今了佛皆從想生，無佛、無想，何癡之有？",
        "translation": "Now, I understand that buddhas all arise from perceptions; without buddhas and perceptions, what's the point of being deluded?",
        "source": "T47n1967_002:0139b24_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此乃觀空三昧，非邪見也。",
        "translation": "This is the samādhi of observing emptiness, not wrong views.",
        "source": "T47n1967_002:0139b25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子又問：『理何在者？』",
        "translation": "Again, the son asked, 'Where does the principle lie?'",
        "source": "T47n1967_002:0139b26_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫至人冥真體寂，虛空其懷，雖復萬法並照，而心未甞有，則真智無緣，故無念為名；俗智有緣，故念想以生。",
        "translation": "\"When the ultimate person's true essence is tranquil and his mind is empty, even though all things are illuminated together, the mind has never existed before, so true cognition has no cognition, so absence of mindfulness is called, and mundane cognition has cognition, so mindfulness and perception arise.",
        "source": "T47n1967_002:0139b26_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又想不異空，空不異想，名第一義中道之理也，此顯法身矣；空即是想，名俗諦之理也，恒沙萬德，皆依俗諦，此顯報身矣；想即是空，名真諦之理也，破二十五有，得二十五三昧，常空常化，和光利物，此顯化身矣。",
        "translation": "Also, conception is not different from emptiness, and emptiness is not different from conception, which is called the principle of the middle way of the first truth, and this shows the Dharma body; conception is emptiness, which is called the principle of the conventional truth, and all the myriad virtues of the eternal universe depend on the conventional truth, which shows the reward body; conception is emptiness, which is called the principle of the true truth, and which destroys the twenty-five existences and attains the twenty-five samādhis, which are always empty and always transforming, and which harmonize light and benefit things, which shows the transformation body.",
        "source": "T47n1967_002:0139b29_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則以三觀，觀三諦、證三德、成三身，乃至十種三法，有何不可？",
        "translation": "What's wrong with using these three contemplations to contemplate the three truths, realize the three virtues, and achieve the three bodies, up to the ten kinds of the three dharmas?",
        "source": "T47n1967_002:0139c04_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而欲擯於清淨之想，取無想之想耶？",
        "translation": "Do you want to reject pure perceptions and embrace perceptions of the non-perceptions?",
        "source": "T47n1967_002:0139c06_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "塞於禪定門，而取成佛之閾耶？",
        "translation": "Is it possible to stop at the gate of meditation and obtain the threshold of becoming a buddha?",
        "source": "T47n1967_002:0139c07_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《楞伽》、《密嚴經》皆曰：『寧起有見如須彌』者，謂信有因果，存想念佛，生極樂淨國，故云寧起有也。",
        "translation": "Both the Laṅkâvatāra and the Secret Adornment Sutra say, 'Rather give rise to the view of existence like Sumeru,' which means believing in the existence of cause and effect and keeping the mindfulness of the Buddha to be born in the pure land of paradise, so it's called preferring to give rise to existence.",
        "source": "T47n1967_002:0139c07_36",
        "is_bad_quality": false
    },
    {
        "source_sentence": "『不起空見如芥子』者，謂撥無因果，謗于念佛，生阿鼻地獄，故云不起空也。",
        "translation": "\"He who 'doesn't give rise to the view of emptiness like a mustard seed' means he denies the absence of cause and effect, denies the mindfulness of the Buddha, and is born in the avīci hell, so he says he doesn't give rise to emptiness.",
        "source": "T47n1967_002:0139c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吁可畏者，其在茲焉！」",
        "translation": "Here's what's frightening!\"",
        "source": "T47n1967_002:0139c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高聲念佛，面向西方門第十一問曰：「想即無想，謹聞之矣！",
        "translation": "He raised his voice in recitation and faced the eleventh question at the western gate, saying, \"Perception is the absence of perception; I've heard it!",
        "source": "T47n1967_002:0139c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然《方等經》中，修無上深妙禪定，令繼想白毫兼稱佛號，以祈勝定，既契之後，心佛兩忘，信有之矣！",
        "translation": "However, according to the Mahāprajñāpāramitā-sūtra, when one cultivates the unsurpassed and sublime meditative concentration, he causes the secondary perception of the white tuft to call on the Buddha's name in order to pray for superior concentration.",
        "source": "T47n1967_002:0139c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但默念泉澄，即三昧自至，亦何必聲喧里巷，響震山林，然後為道哉？」",
        "translation": "Simply being silent in mindfulness of Quancheng means that samādhi will come naturally, so why is it necessary to make noise in the alleys and shake the mountains and forests before attaining the Way?\"",
        "source": "T47n1967_002:0139c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「誠如所問，聲亦無爽，試為明之。",
        "translation": "He said, \"It's just as you asked, and the sound is not distorted; try to explain it.",
        "source": "T47n1967_002:0139c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T47n1967_002:0139c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫辟散之要，要存於聲，聲之不厲，心竊竊然，飄飄然無定；聲之厲也，拔茅連茹乘策，其後畢命一對，長謝百憂，其義一也。",
        "translation": "If sound isn't powerful, the mind will steal away and drift about without concentration; when sound is powerful, it'll uproot and rid the world of its enemies, and then it'll end up with one pair of lives and give a long thanks for a hundred sorrows, which has one meaning.",
        "source": "T47n1967_002:0139c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近而取之，聲光所及，萬禍氷消，功德叢林，千山松茂，其義二也。",
        "translation": "When it's taken from close by, the sound and light reach them, and ten thousand calamities and ice disappear, while a forest of merit grows and a thousand mountains and pines flourish, which has two meanings.",
        "source": "T47n1967_002:0139c22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠而說之，金容熒煌以散彩，寶華浙瀝而雨空，若指諸掌，皆聲致焉，其義三也。",
        "translation": "When it's spoken from afar, its gold shines brilliantly, scattering color, and its precious flowers rain down emptiness like a finger in the palm of your hand, all resulting in sound, which has three meanings.",
        "source": "T47n1967_002:0139c23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如牽木石，重而不前，洪音發號，飄然輕舉，其義四也。",
        "translation": "Like pulling a log or stone, it's heavy but doesn't move forward, while a loud voice sounds like a horn that wafts and lifts lightly, which has the fourth meaning.",
        "source": "T47n1967_002:0139c25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與魔軍相戰，旗鼓相望，用聲律於戎軒，以定破於強敵，其義五也。",
        "translation": "When fighting against an army of Māra, they look at each other with banners and drums, using sound and meter at the military cage to determine victory over a strong opponent, which has the fifth meaning.",
        "source": "T47n1967_002:0139c26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具斯眾義，復何厭哉！",
        "translation": "With these various meanings, how could one tire of them?",
        "source": "T47n1967_002:0139c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未若喧靜兩全，止觀雙運，叶夫佛意，不亦可乎？",
        "translation": "Wouldn't it be better to have both the quiescent and the noisy, and to observe both the stillness and the movement of the Buddha's mind?",
        "source": "T47n1967_002:0139c28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "定慧若均，則兼忘心佛誠如所問矣。",
        "translation": "If concentration and wisdom are evenly matched, then he will have forgotten both the mind and the Buddha, just as he had asked.",
        "source": "T47n1967_002:0139c29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故廬山〈遠公念佛三昧序〉曰：『功高易進，念佛為先。』",
        "translation": "That's why Lu Shan's 'Preface to Yuan Gong's Nianfo Samādhi' says, 'When effort is high and easy to advance, mindfulness of the Buddha comes first.'",
        "source": "T47n1967_002:0140a01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "察夫玄音之扣心，聽則塵累每銷，滯情融朗，非天下之至妙，其孰能與於此歟？",
        "translation": "To examine the profound sounds that snap the mind, to listen to them is to remove every dust-weary tendency and to melt the emotions in the mind.",
        "source": "T47n1967_002:0140a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言明證者，未若《華嚴經》偈云：「『寧受無量苦，　　得聞佛音聲，　　不受一切樂，　　而不聞佛名。』",
        "translation": "When it comes to clear realization, it's not like the verse in the Huayan Sutra that says, 'I'd rather suffer measureless suffering than hear the Buddha's voice, and I won't experience all the pleasures but not hear the Buddha's name.'",
        "source": "T47n1967_002:0140a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「夫然則佛聲，遠震開善萌牙，猶春雷之動百草，安得輕誣哉？」",
        "translation": "\"If that's the case, then the Buddha's voice is like a spring thunderbolt moving a hundred grasses, so how could it be misrepresented?\"",
        "source": "T47n1967_002:0140a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「高聲下聲，稱佛名號，敬承其義。",
        "translation": "He asked, \"Raise your voice and lower it to call on the Buddha's name, honoring its meaning.",
        "source": "T47n1967_002:0140a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方淨土皆有如來，面之西方，何滯之甚耶？」",
        "translation": "Why is there so much obstruction between the pure lands of the ten directions, where all tathāgatas exist, and the West?\"",
        "source": "T47n1967_002:0140a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「子問非也。",
        "translation": "He replied, \"You're wrong to ask that.",
        "source": "T47n1967_002:0140a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是方等佛經作如是說，非人師之意也。",
        "translation": "This is what the vaipulya sūtras say, and it's not what human masters mean.",
        "source": "T47n1967_002:0140a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈可謗之於方等經歟？」",
        "translation": "How could you denigrate this scripture?\"",
        "source": "T47n1967_002:0140a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「謹聞教矣，理在何焉？」",
        "translation": "He asked, \"I've heard of the teaching, but what is the principle?\"",
        "source": "T47n1967_002:0140a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「亦有其理。",
        "translation": "They replied, \"There's also a reason for it.",
        "source": "T47n1967_002:0140a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如說癡人見觀世音有十一面，即設難云：『何不安十二面耶？』",
        "translation": "Suppose a deluded person sees that Avalokitêśvara has 11 faces and poses the question, 'What's so disturbing about 12 faces?'",
        "source": "T47n1967_002:0140a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及隨其語，又設難云：『何不安十一面耶？』",
        "translation": "Following his words, he also posed another objection, saying, 'What are the eleven faces of unease?'",
        "source": "T47n1967_002:0140a14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子欲將東難西，其義若此。",
        "translation": "This is the meaning of the son's desire to make it difficult to go east and go west.",
        "source": "T47n1967_002:0140a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶迷未醒者，即以此身，令其安置，不背一方，則其自悟矣。",
        "translation": "He's still deluded and not awake, so he makes this body settle down and doesn't turn away from one side, and then he'll realize it on his own.",
        "source": "T47n1967_002:0140a15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其不悟，誠不可化，但可悲矣！",
        "translation": "If he doesn't awaken, he really can't be converted, but it's sad!",
        "source": "T47n1967_002:0140a17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又《勝天王經．二行品》明如來八十種好，中有一隨好光明功德，名一切向，不背他矣。",
        "translation": "Also, in the Sutra of King Shōtoku, the Two Practices Chapter explains that among the Tathāgata's eighty kinds of good qualities, there's one that's accompanied by the virtue of radiance, which is called \"all-facing,\" and it doesn't turn its back on others.",
        "source": "T47n1967_002:0140a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然佛不可背，常面向於一切眾生，非如冤讎不欲相見，慈之至矣，是其義也。",
        "translation": "However, the Buddha is not to be turned away from, and he always looks toward all sentient beings, not like an enemy who doesn't want to see each other, which is the ultimate in compassion.",
        "source": "T47n1967_002:0140a19_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者大師，爰自撫塵之歲，終于耳順，臥便合掌，坐必面西。",
        "translation": "The great teacher Zhizhe, since his years of dusting, when he finally became deaf and obedient, he would lay down with his palms together and always face west when he sat down.",
        "source": "T47n1967_002:0140a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大漸之際，令讀四十八願，九品往生，光明滿山，天樂遞奏，生于淨土。",
        "translation": "At the time of his great gradual advancement, he ordered the reading of the forty-eight vows, the rebirth in the nine classes, the filling of mountains with light, and the passing of heavenly music, and his birth in the Pure Land.",
        "source": "T47n1967_002:0140a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "面西之義，不亦弘哉？」",
        "translation": "Isn't this a great meaning of facing west?\"",
        "source": "T47n1967_002:0140a24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「面向西方，敬聞教理。",
        "translation": "He asked, \"Facing west, I respectfully hear the teaching.",
        "source": "T47n1967_002:0140a24_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般舟之義，義在何耶？」",
        "translation": "What is the meaning of Banzhou?\"",
        "source": "T47n1967_002:0140a25_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「梵云般舟，此云現前，謂思惟不已，佛現定中。",
        "translation": "They say, \"The Sanskrit word parboat and this word presently means that reflection doesn't end and the Buddha is present in meditation.",
        "source": "T47n1967_002:0140a25_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡九十日常行道者，助般舟之緣，非正釋其義也。」",
        "translation": "Where there are ninety daily practitioners of the path, it's an aid to the conditions of the ark, not a correct explanation of its meaning.\"",
        "source": "T47n1967_002:0140a27_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「淨土妙門，般舟之義，具聞剖析。",
        "translation": "He asked, \"We've heard a lot about the marvelous approach of the Pure Land and the meaning of the parboat.",
        "source": "T47n1967_002:0140a28_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然近代已來，誰得登于安養之國？",
        "translation": "But since recent times, who has been able to enter the Land of Tranquility?",
        "source": "T47n1967_002:0140a29_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既無相報，焉知所詣？",
        "translation": "Since there is no mutual reward, how can we know what to expect?",
        "source": "T47n1967_002:0140a29_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "望為明之。」",
        "translation": "I hope you'll clarify it.\"",
        "source": "T47n1967_002:0140b01_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「晉朝廬山遠法師為其首唱。",
        "translation": "He replied, \"The founder of the school, Master Yuan of Mount Lu in the Jin Dynasty, was the first to recite this teaching.",
        "source": "T47n1967_002:0140b01_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠公從佛陀跋陀羅三藏授念佛三昧，與弟慧持、高僧慧永，朝賢貴士、隱逸清信：宗炳、張野、劉遺民、雷次宗、周續之、謝靈運、闕公則等一百二十三人，鑿山為銘，誓生淨土。",
        "translation": "After he received the samādhi of mindfulness of the Buddha from the Buddha's bhadra tripiṭaka, Yuan Gong, his disciple Huizhi, the senior monk Huiyong, and 123 other distinguished courtiers, hermits, and clear believers, including Zong Bing, Zhang Ye, Liu Jimin, Lei Cizong, Zhou Xuzhi, Xie Lingyun, and Que Gonze, dug out a mountain for his inscription and vowed to be born in the Pure Land.",
        "source": "T47n1967_002:0140b02_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劉遺民著文大略云：『推交臂之灒淪，悟無常之期，切審三報之相，催知險趣之難拔，如其同志諸賢，所以夕惕霄勤，仰思攸濟者也。",
        "translation": "Liu Jimin wrote a short essay, saying, 'They pushed out the spiraling of their arms, realized the duration of impermanence, examined the characteristics of the three retributions, and urged them to know the difficulty of extracting the dangerous destinies, just as their comrades, the good men, had been diligent in the evening and had worked hard in the sky to look up and try to help.'",
        "source": "T47n1967_002:0140b06_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後妙觀大義，啟心正照，識以悟新，形由化革。",
        "translation": "He then delicately observes the great meaning, enlightens his mind and correctly illuminates it, and his consciousness is renewed by enlightenment, while his form is revolutionized by transformation.",
        "source": "T47n1967_002:0140b09_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藉芙蓉於中流，蔭瓊柯以詠言，飄雲衣於八極，泛香風以窮年。",
        "translation": "He uses the hibiscus in the middle stream, shades the pine tree with his words, floats his cloudy robe over the eight extremities, and floods it with fragrant breezes to end his years.",
        "source": "T47n1967_002:0140b10_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "體忘安而彌穆，心超樂以自怡，臨三塗而緬謝，傲天宮以長辭，紹眾靈以繼軌，捐大息以為期。",
        "translation": "He forgets his body's serenity and becomes serene, transcends his mind's pleasure and makes himself comfortable, approaches the three destinies and extends his thanks, takes pride in his heavenly palace and extends his resignation, introduces the many spirits to his successor, and donates his great respite for a long time.",
        "source": "T47n1967_002:0140b11_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究茲道也，豈不弘哉！』",
        "translation": "Wouldn't it be great to examine this path?\"",
        "source": "T47n1967_002:0140b13_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠公製〈念佛三昧序〉六：『夫稱三昧者何？",
        "translation": "Yuan Gong zhi (Preface to Nianfo sanmei) 6: 'What does he call samādhi?",
        "source": "T47n1967_002:0140b14_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思專想寂之謂也，思專則志一不移，想寂則氣虛神朗，氣虛則智恬其照，神朗則無幽不徹，斯二乃是自然之玄符，會一而致用也。",
        "translation": "Concentration of thought is called quiescence, and when thought is concentrated, the mind is unified and unshaken; when thought is quiescent, qi is vacant and the spirit is clear; when qi is vacant, wisdom is serene and illuminating; and when the spirit is clear, there's nothing obscure and not penetrating; these two are naturally profound abilities that unite and bring about application.",
        "source": "T47n1967_002:0140b15_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸三昧，其名甚眾，功高易進，念佛為先，若以匹夫眾定之所緣故，不得語其優劣，居可知也。』",
        "translation": "Furthermore, there are many names for the samādhis, and while it's easy to advance with great effort, mindfulness of the Buddha comes first; if we take the condition of the concentration of ordinary people as the reason, we can't say anything about their superiority or inferiority, but we can know it at home.'",
        "source": "T47n1967_002:0140b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謝靈運〈淨土詠〉云：『法藏長王宮，懷道出國城，願言四十八，弘誓拯群生。",
        "translation": "Xie Lingyun's 'A Song of the Pure Land' says, 'The Dharmâkara Chanakara Palace, the city that left the country with the Way in its heart, vowed forty-eight things, and sang a vow to save all sentient beings.",
        "source": "T47n1967_002:0140b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨土一何妙，來者皆菁英，頹年安可寄？",
        "translation": "What's so wonderful about the Pure Land that all comers are elite, but how can we hope for it in our declining years?'",
        "source": "T47n1967_002:0140b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乘化必晨征。』",
        "translation": "The vehicle of transformation must be a morning expedition.'",
        "source": "T47n1967_002:0140b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子問：『未見往生相報』者，有晉朝闕公則，願生而來報，後同誓友人在東京白馬寺，其夜為公則追忌轉經，于時林殿皆作金色，空中有聲曰：『我是闕公則也！",
        "translation": "Tzu asked, 'I've never seen the reward of being reborn.' There was Que Gonze of the Jin Dynasty who vowed to be reborn and came to be rewarded.",
        "source": "T47n1967_002:0140b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所祈往生極樂寶國，今已果矣，故來相報。』",
        "translation": "Now that my prayer to be reborn in the jeweled land of paradise has been fulfilled, I've come to offer my reward.'",
        "source": "T47n1967_002:0140b26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言訖不現，支道林讚曰：「『大哉闕公！",
        "translation": "When his words were finished, Zhi Daolin praised him, 'Great, Master Ke!'",
        "source": "T47n1967_002:0140b27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　歆虛納靈，　　神化西域，　　跡驗東京。",
        "translation": "XINXU NING, the spirit of the transformation of the western regions, and the traces of Tokyo.",
        "source": "T47n1967_002:0140b28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　徘徊霄虛，　　流響耀形，　　豈欽一贊，　　示以匪冥。』",
        "translation": "He wanders through the heavens and sky, resonating and shining his form, how could he have given a single praise, showing us that it's not mysterious?'",
        "source": "T47n1967_002:0140b29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「又虞孝敬讚曰：「『猗歟公則，　　先甘法味，　　知我者希，　　其道乃貴，　　金光夜朗，　　玉顏朝睟，　　不捨有緣，　　言告其類。』」",
        "translation": "\"Also, Yu Xiaojing praised him, saying, 'Greetings, Gongze, the taste of the Dharma is sweet beforehand; those who know me are rare; his path is valuable; his golden light is bright at night; his jade face is bright in the morning; he doesn't let go of his condition and tells his class.'\"",
        "source": "T47n1967_002:0140c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夢覺一心以明三昧門第十二",
        "translation": "The Dream Awakens One Mind to Understand the Gate of Samādhi No. 12",
        "source": "T47n1967_002:0140c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「闕公往生，金光相報，敬諾之矣。",
        "translation": "He asked, \"Gong Que will be reborn, and I'm honoring him with a golden light as a reward.",
        "source": "T47n1967_002:0140c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說一切法如夢者，未知所念之佛、所生淨土，亦如夢否？",
        "translation": "If the Buddha said that all things are like dreams, I wonder if the Buddha I'm mindful of and the Pure Land I'm born in are also like dreams?",
        "source": "T47n1967_002:0140c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非其夢，則佛在心外；若是其夢，則佛在夢中。",
        "translation": "If it's not his dream, then the Buddha is outside his mind; if it is his dream, then the Buddha is in the dream.",
        "source": "T47n1967_002:0140c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如夢中得金，覺無所獲，誠恐虛念於三身，終歸於一妄。",
        "translation": "Just as gold is obtained in a dream and nothing is perceived to be obtained, I'm afraid that false thoughts about the three bodies will eventually return to the same delusion.",
        "source": "T47n1967_002:0140c10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請為辨之。」",
        "translation": "Please explain this for me.\"",
        "source": "T47n1967_002:0140c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「非妄也！",
        "translation": "He replied, \"It's not a delusion!",
        "source": "T47n1967_002:0140c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以知然？",
        "translation": "How do we know this?",
        "source": "T47n1967_002:0140c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若修念佛三昧之人，如夢得金，覺無所獲者，則同於妄也。",
        "translation": "If someone who cultivates the samādhi of mindfulness of the Buddha feels like they've gotten gold in a dream and have nothing to show for it, then they're the same as being deluded.",
        "source": "T47n1967_002:0140c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究竟因念佛而生淨土，豈曰妄哉？",
        "translation": "Is it a delusion to say that the Pure Land is actually born because of mindfulness of the Buddha?",
        "source": "T47n1967_002:0140c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如習天眼法，先想珠、火等光，想之不已，實發天眼。",
        "translation": "If someone is practicing the eye of god, they first think of pearls, fire, and other lights, and they don't stop thinking about them, which really gives rise to the eye of god.",
        "source": "T47n1967_002:0140c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孰曰妄焉？",
        "translation": "Who says that's false?",
        "source": "T47n1967_002:0140c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈同夢金，畢竟無有。",
        "translation": "\"Is it the same as dream gold, which is ultimately nonexistent?",
        "source": "T47n1967_002:0140c15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莫以遠事近見，舉夢為喻。",
        "translation": "Don't take distant things and near views and cite dreams as a metaphor.",
        "source": "T47n1967_002:0140c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不得將念佛往生，全同於夢明矣！",
        "translation": "You can't think of mindfulness of the Buddha's rebirth as being entirely the same as a dream!",
        "source": "T47n1967_002:0140c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又《華嚴經》云：『心、佛與眾生，是三無差別。』",
        "translation": "The Huayan Sutra also says, 'These three are without distinction: mind, buddha, and sentient beings.'",
        "source": "T47n1967_002:0140c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心迷也如夢，則九法界眾生是矣；心悟也如覺，則一法界即諸佛是也。",
        "translation": "When the mind is confused, it's like a dream, and the nine realms of sentient beings are these; when the mind is awakened, it's like an awakening, and the one realm of reality is the buddhas.",
        "source": "T47n1967_002:0140c18_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迷、悟祇在於一心，夢、覺曾無於兩轍。",
        "translation": "Delusion and awakening are only in the same mind, and dream and awakening have never been two separate things.",
        "source": "T47n1967_002:0140c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經所謂：『了妄本自真，則見盧舍那。』",
        "translation": "As the sūtras say, 'When you understand that delusion is inherently true, then you'll see Rocana.'",
        "source": "T47n1967_002:0140c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縱是夢妄，亦何爽焉？",
        "translation": "Even if it's a dream and a delusion, how could it be different?",
        "source": "T47n1967_002:0140c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯心察之，匪石其志。」",
        "translation": "Only the mind observes it, not the will of a stone.\"",
        "source": "T47n1967_002:0140c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念三身佛破三種障門第十三",
        "translation": "Thirteenth Gate of Breaking Through the Three Hindrances by Mindfulness of the Three Body Buddhas",
        "source": "T47n1967_002:0140c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰：「佛有三身，如何憶念？",
        "translation": "The question was, \"The Buddha has three bodies, how can I recall them?",
        "source": "T47n1967_002:0140c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願示方便，令無所失。」",
        "translation": "May you show me the way to make sure nothing is lost.\"",
        "source": "T47n1967_002:0140c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「夫佛之三身，法、報、化也。",
        "translation": "He replied, \"The three bodies of a Buddha are Dharma, reward, and transformation.",
        "source": "T47n1967_002:0140c25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法身者如月之體，報身者如月之光，化佛者如月之影。",
        "translation": "The Dharma body is like the body of the moon, the reward body is like the light of the moon, and the transformation Buddha is like the shadow of the moon.",
        "source": "T47n1967_002:0140c25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "萬水之內皆有月焉，此月為多、為一耶。",
        "translation": "The moon is present in all the ten thousand rivers, so is this moon many or is it one?",
        "source": "T47n1967_002:0140c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可言一，萬水之月常差矣！",
        "translation": "It can't be called one, for the moons of myriad rivers are always different!",
        "source": "T47n1967_002:0140c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不可言多，虛空之月，常一也！",
        "translation": "It cannot be called many, but the moon of space is always one!",
        "source": "T47n1967_002:0140c28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如梵書伊字、摩醯三目，縱橫並別，皆不可議也！",
        "translation": "For example, the Sanskrit letter i and the Sanskrit letter mohee, both vertically and horizontally, are incomprehensible!",
        "source": "T47n1967_002:0140c29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云：『或現小身，丈六、八尺』者，皆眾生心水中佛也。",
        "translation": "The sūtras say, 'A person who appears with a small body, measuring six or eight feet,' is a Buddha in the water in the minds of sentient beings.",
        "source": "T47n1967_002:0141a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛尚無形，豈有二哉？",
        "translation": "If the Buddha is still formless, how could there be two?",
        "source": "T47n1967_002:0141a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨國、穢土亦自彼耳。",
        "translation": "The pure land and the defiled land are also their own.",
        "source": "T47n1967_002:0141a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲將念三身、破三種障，今試明之爾。",
        "translation": "If you want to bring to mind the three bodies and break through the three kinds of hindrances, let's try to explain it here.",
        "source": "T47n1967_002:0141a03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛身之生，從止觀生，止觀不均，其障必起。",
        "translation": "The birth of a buddha's body arises from calming and insight, and when calming and insight aren't even, the hindrances will surely arise.",
        "source": "T47n1967_002:0141a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛之人，修止心沈，昏闇障起，而障化身佛。",
        "translation": "When a person mindful of the Buddha cultivates calmness of mind and sinks, the hindrances of darkness arise, and they obstruct the transformation-body Buddha.",
        "source": "T47n1967_002:0141a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又須以觀心策之，念白毫光，破昏闇障也。",
        "translation": "He must also use his observing mind to stimulate it, mindful of the white tuft of light, to break through the hindrances of darkness and ignorance.",
        "source": "T47n1967_002:0141a06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修觀心浮，無惡不造，而障報身佛。",
        "translation": "When he cultivates the mind of contemplation, no evil is created that doesn't obstruct the buddha of the reward body.",
        "source": "T47n1967_002:0141a07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還修於止，止一切惡。",
        "translation": "They also cultivate tranquility, which stops all evil.",
        "source": "T47n1967_002:0141a07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念諸佛昔因恒沙功德，智慧圓滿，酬因曰報，破惡念障也。",
        "translation": "Remembering the buddhas' age-old merits and perfected wisdom, which rewarded causes and named rewards, breaks down the hindrance of bad thoughts.",
        "source": "T47n1967_002:0141a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若二邊障動，詭狀殊形，萬相紛綸，兩賊強軟，障法身佛也。",
        "translation": "If the two extreme hindrances are disturbed, their deceitful forms are different, their myriad appearances are mixed, and the two thieves are strong and weak, this hinders the Dharma-body Buddha.",
        "source": "T47n1967_002:0141a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以中道第一義空，破之偈曰：「『無色無形相，　　無根無住處，　　不生不滅故，　　敬禮無所觀。』",
        "translation": "He refutes this with the verse, which states, 'The middle way's cardinal meaning of emptiness is formless, immaterial, and without abiding place; therefore, it neither arises nor ceases.'",
        "source": "T47n1967_002:0141a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「所觀之理，如毘嵐猛風吹散重雲，顯明法身清淨寶月，破逼惱障也。",
        "translation": "\"The principle that's being contemplated is like a fierce wind blowing away heavy clouds, revealing the Dharma body as a pure jeweled moon, and breaking through the hindrances of constraint.",
        "source": "T47n1967_002:0141a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應病與藥，不其然歟！",
        "translation": "It's like a fierce wind that blows away heavy clouds and reveals the pure, precious moon of the Dharma body, which destroys the oppressive hindrances of affliction.",
        "source": "T47n1967_002:0141a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(此是天台智者大師所解，披尋未廣，實未曾見諸師有斯妙釋也。",
        "translation": "(This is the interpretation of the great teacher Tendai Zhizhe, but I've never seen any masters with this kind of subtle interpretation before.",
        "source": "T47n1967_002:0141a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止觀意前已略辨俟，在口釋非文字能徵也)。",
        "translation": "The meaning of calming and insight has been briefly explained before, and the oral explanation is not something that words can define.)",
        "source": "T47n1967_002:0141a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我既化人，人亦化物，物我俱成，三昧彌興，眾生無盡，三昧不絕也。」",
        "translation": "As I transform people, people transform themselves, and things and self become one, samādhi flourishes, and sentient beings are inexhaustible while samādhi doesn't cease.\"",
        "source": "T47n1967_002:0141a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已上六門，盡是念現在阿彌陀佛，以通三世之意也。",
        "translation": "The above six categories are all about mindfulness of the present Amitâbha Buddha in order to convey the meaning of the three times.",
        "source": "T47n1967_002:0141a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣如《安樂集》、《天台十疑論》、咸法師《釋群疑論》、《往生傳》、稠禪師《法寶義論》所解，亦如飛錫先撰《無上深妙禪門傳集法寶》一卷廣明也。",
        "translation": "It's as explained in detail in the Anāthapiṇḍika, the Tendai Treatise on the Ten Doubts, Master Ham's Treatise on the Interpretation of the Qun Doubts, the Record of Rebirth, and Master Chou's Treatise on the Meaning of the Dharma Treasure, and in detail in the one volume of the Dharma Treasure of the Wushangshen miao chanmen zhuanji, written by Fei Xixian.",
        "source": "T47n1967_002:0141a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛三昧寶王論卷中",
        "translation": "In the Nianfo sanmei baowang lun (Treatise on the Jewel King of Mindfulness of the Buddha)",
        "source": "T47n1967_002:0141a24_0",
        "is_bad_quality": false
    }
]