[
    {
        "source_sentence": "大唐西域記卷第八(一國)",
        "translation": "Record of the Western Regions of the Great Tang, Volume 8 (A Country)",
        "source": "T51n2087_008:0910c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial order by Xuanzang, the Tripiṭaka Master",
        "source": "T51n2087_008:0910c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大總持寺沙門辯機撰",
        "translation": "Dazongji si shaman benqi zu",
        "source": "T51n2087_008:0910c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩揭陀國上",
        "translation": "Magadha",
        "source": "T51n2087_008:0910c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩揭陀國，周五千餘里。",
        "translation": "The country of Magadha has a circumference of more than 5,000 miles.",
        "source": "T51n2087_008:0910c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城少居人，邑多編戶。",
        "translation": "Its cities are few inhabited, and its eunuchs are full of families.",
        "source": "T51n2087_008:0910c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地沃壤，滋稼穡，有異稻種，其粒麁大，香味殊越，光色特甚，彼俗謂之供大人米。",
        "translation": "The land is fertile and produces crops, and there's a different kind of rice, whose grains are coarse and large, and its fragrance and color are so extraordinary that the people there call it rice for the lord.",
        "source": "T51n2087_008:0910c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "土地墊濕，邑居高原，孟夏之後，仲秋之前，平居流水，可以泛舟。",
        "translation": "The land is damp, the town is located on a plateau, and after the summer retreat and before mid-autumn, it's flat and flowing, so you can go boating.",
        "source": "T51n2087_008:0910c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "風俗淳質，氣序溫暑。",
        "translation": "The customs are simple, and the air is orderly and warm.",
        "source": "T51n2087_008:0910c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "崇重志學，遵敬佛法。",
        "translation": "They respect their aspirations and study, and they revere the Buddha's teachings.",
        "source": "T51n2087_008:0910c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽藍五十餘所，僧徒萬有餘人，並多宗習大乘法教。",
        "translation": "There were more than fifty kalas and ten thousand monks and disciples, most of whom practiced the great vehicle teaching.",
        "source": "T51n2087_008:0910c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天祠數十，異道寔多。",
        "translation": "There are dozens of shrines in the heavens and many heretics.",
        "source": "T51n2087_008:0910c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殑伽河南有故城，周七十餘里，荒蕪雖久基址尚在。",
        "translation": "There's an old city on the Ganges River that's more than 70 miles in circumference, and although its site has been deserted for a long time, it's still standing.",
        "source": "T51n2087_008:0910c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔者，人壽無量歲時，號拘蘇摩補羅城(唐言香花宮城)。",
        "translation": "In the past, when life was countless years old, it was called Kusumapura (Tang term for fragrant flower palace city).",
        "source": "T51n2087_008:0910c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王宮多花，故以名焉。",
        "translation": "The palace was named for the many flowers in the king's palace.",
        "source": "T51n2087_008:0910c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逮乎人壽數千歲，更名波吒釐子城(舊曰巴連弗邑，訛也)。",
        "translation": "When his life was several thousand years old, he was renamed Pāṭaliputra (formerly known as Pāṭaliputra, which is also a misnomer).",
        "source": "T51n2087_008:0910c17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，有婆羅門，高才博學，門人數千，傳以受業。",
        "translation": "At the beginning, there was a Brāhmaṇa who was highly talented and knowledgeable, and there were thousands of his disciples who taught him the ropes.",
        "source": "T51n2087_008:0910c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸學徒相從遊觀，有一書生俳佪悵望。",
        "translation": "The students gathered to watch him, but there was a scholar who looked around.",
        "source": "T51n2087_008:0910c19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同儔謂曰：「夫何憂乎？」",
        "translation": "His fellow trainees said, \"Why are you so worried?\"",
        "source": "T51n2087_008:0910c20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「盛色方剛，羈遊履影，歲月已積，藝業無成。",
        "translation": "He said, \"He's in full bloom, yet he's just starting out, so he's been traveling around in shadow, and his years have accumulated, but his art has yet to be accomplished.",
        "source": "T51n2087_008:0910c21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顧此為言，憂心彌劇。」",
        "translation": "Considering what I've said, I'm deeply worried.\"",
        "source": "T51n2087_008:0910c22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是學徒戲言之曰：「今將子求娉婚親。」",
        "translation": "The student then jokingly said, \"Now, I'll ask my son to be my bride and groom.\"",
        "source": "T51n2087_008:0910c22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃假立二人為男父母，二人為女父母，遂坐波吒釐樹，謂「女聲樹也。」",
        "translation": "They then nominally designated two people as male parents and two people as female parents, and they sat down at the Pāṭaliputra tree, which is called the \"tree of the voice of the goddess.\"",
        "source": "T51n2087_008:0910c23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "採時果，酌清流，陳婚姻之緒，請好合之期。",
        "translation": "They picked seasonal fruit, drank a refreshing stream, explained their intentions for marriage, and asked for a good match.",
        "source": "T51n2087_008:0910c25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時假女父攀花枝以授書生曰：「斯嘉偶也，幸無辭焉。」",
        "translation": "The fictitious father of the woman climbed a flowering branch and gave it to the scholar, saying, \"This is a wonderful couple; I'm glad you didn't say anything.\"",
        "source": "T51n2087_008:0910c26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "書生之心欣然自得，日暮言歸，懷戀而止。",
        "translation": "The scholar's heart was pleased with itself, and he said he would stop at sunset, wistfully longing for her.",
        "source": "T51n2087_008:0910c27_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學徒曰：「前言戲耳！",
        "translation": "The student said, \"That was a joke!",
        "source": "T51n2087_008:0910c28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸可同歸。",
        "translation": "Fortunately, we can return together.",
        "source": "T51n2087_008:0910c29_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "林中猛獸恐相殘害。」",
        "translation": "The fierce animals in the forest are afraid of harming each other.\"",
        "source": "T51n2087_008:0910c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "書生遂留，往來樹側。",
        "translation": "The scholar then stayed, going to and from the side of the tree.",
        "source": "T51n2087_008:0911a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "景夕之後，異光燭野，管絃清雅，帷帳陳列。",
        "translation": "After the evening of the emperor's birthday, there was a candlelit field with strange lights, elegant music and strings, and a display of curtains and tents.",
        "source": "T51n2087_008:0911a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俄見老翁策杖來慰，復有一嫗携引少女，並賓從盈路，袨服奏樂。",
        "translation": "Then, he saw an old man using a staff to console him, another woman carrying a young girl, and guests filling the road, dressed in robes and playing music.",
        "source": "T51n2087_008:0911a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "翁乃指少女曰：「此君之弱室也。」",
        "translation": "The man then pointed to the maiden and said, \"This is your young lady's weak room.\"",
        "source": "T51n2087_008:0911a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "酣歌樂宴，經七日焉。",
        "translation": "He sang and played music for seven days.",
        "source": "T51n2087_008:0911a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學徒疑為獸害，往而求之，乃見獨坐樹陰，若對上客，告與同歸，辭不從命。",
        "translation": "Suspecting that he was harmed by an animal, the student went to look for her, but he saw her sitting alone in the shade of a tree, as if she were an attendant, and asked her to return with him.",
        "source": "T51n2087_008:0911a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後自入城，拜謁親故，說其始末。",
        "translation": "He then went into the city himself, paid a visit to his relatives, and told them the story.",
        "source": "T51n2087_008:0911a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞者驚駭，與諸友人同往林中，咸見花樹是一大第，僮僕役使驅馳往來，而彼老翁從容接對，陳饌奏樂，賓主禮備。",
        "translation": "They were shocked, so they went with their friends to the forest, where they all saw a large family of flowering trees, servants, and messengers driving up and down, and the old man calmly met them, presented food, played music, and prepared courtesies for both host and guest.",
        "source": "T51n2087_008:0911a07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸友還城，具告遠近。",
        "translation": "The friends returned to the city and told everyone near and far.",
        "source": "T51n2087_008:0911a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "朞歲之後，生一子男。",
        "translation": "A few years later, he gave birth to a son and a boy.",
        "source": "T51n2087_008:0911a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂其妻曰：「吾今欲歸，未忍離阻；適復留止，棲寄飄露。」",
        "translation": "He said to his wife, \"Now, I want to go back, but I can't bear to be separated from him; it's better to stay here again and roost in the dew.\"",
        "source": "T51n2087_008:0911a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妻既聞，具以白父。",
        "translation": "When his wife heard this, she explained it to his father.",
        "source": "T51n2087_008:0911a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "翁謂書生曰：「人生行樂，詎必故鄉？",
        "translation": "The man said to the scholar, \"Why is it so important to go back to one's hometown when one's life is full of activity and pleasure?",
        "source": "T51n2087_008:0911a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今將築室，宜無異志。」",
        "translation": "Now that they're about to build a house, it's appropriate that they have no different intentions.\"",
        "source": "T51n2087_008:0911a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是役使之徒，功成不日。",
        "translation": "So he enlisted his followers, and the work was accomplished in a matter of days.",
        "source": "T51n2087_008:0911a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香花舊城，遷都此邑。",
        "translation": "They moved the old city of Gandhāra to this town.",
        "source": "T51n2087_008:0911a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由彼子故，神為築城，自爾之後，因名波吒釐子城焉。",
        "translation": "Because of that son, the gods built the city, and from then on it was called Pāṭaliputra's City.",
        "source": "T51n2087_008:0911a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王故宮北有石柱，高數十尺，是無憂王作地獄處。",
        "translation": "To the north of the king's former palace was a stone pillar several dozen feet high that was the place where King Aśoka made his hell.",
        "source": "T51n2087_008:0911a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦如來涅槃之後第一百年，有阿輸迦(唐言無憂。",
        "translation": "In the first hundred years after the Śākyamuni Tathāgata's nirvāṇa, there was Aśoka (Tang term for Wuyu.",
        "source": "T51n2087_008:0911a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊曰阿育，訛也)王者，頻毘婆羅(唐言影堅。",
        "translation": "It was formerly called Aśoka, which is a falsification.) That king, Bimbisāra (Tang term for Yingjian.",
        "source": "T51n2087_008:0911a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊曰頻婆娑，訛也)王之曾孫也，自王舍城遷都波吒釐，築外郭，周於故城。",
        "translation": "He was the great-grandson of King Bimbisāra (formerly called Bimbisāra, a falsified term), who moved from Rājagṛha to his capital at Pāṭaliputra and built a outer wall around his old city.",
        "source": "T51n2087_008:0911a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "年代浸遠，唯餘故基。",
        "translation": "It was so old that only the old foundations remained.",
        "source": "T51n2087_008:0911a22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽藍、天祠及窣堵波，餘址數百，存者二三。",
        "translation": "Of the hundreds of remaining sites, two or three remain, including the Kālāma, the Temple of God, and the Surūpa.",
        "source": "T51n2087_008:0911a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯故宮北，臨殑伽河，小城中有千餘家。",
        "translation": "Only to the north of the old palace, near the Ganges River, there were more than a thousand houses in the small city.",
        "source": "T51n2087_008:0911a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，無憂王嗣位之後，舉措苛暴，乃立地獄，作害生靈。",
        "translation": "At first, after King Wuzu assumed the throne, he was so harsh and violent that he established a hell to harm living beings.",
        "source": "T51n2087_008:0911a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "周垣峻峙，隅樓特起，猛焰洪鑪，銛鋒利刃，備諸苦具，擬像幽塗，招募凶人，立為獄主。",
        "translation": "Surrounded by steep walls and a special corner tower, it had a fierce, fiery, and powerful platter, sharp blades, and implements of suffering, it was designed to resemble an apparition, recruit fierce people, and make them lords of the hell.",
        "source": "T51n2087_008:0911a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初以國中犯法罪人，無挍輕重，總入塗炭。",
        "translation": "At first, the offenders in the country who violated the law, regardless of their level, were always plunged into the coals.",
        "source": "T51n2087_008:0911a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後以行經獄次，擒以誅戮，至者皆死，遂滅口焉。",
        "translation": "Later, they would pass through the prison, be captured and executed, and everyone who came to them would die, so they would silence their mouths.",
        "source": "T51n2087_008:0911a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有沙門，初入法眾，巡里乞食，遇至獄門，獄吏凶人擒欲殘害。",
        "translation": "At the time, there was an ascetic who had first joined the Dharma community and was going from village to village begging for food when he came upon the prison gate and was approached by a fierce man who wanted to kill him.",
        "source": "T51n2087_008:0911b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門惶怖，請得禮懺。",
        "translation": "The ascetic was terrified and asked to be allowed to worship and repent.",
        "source": "T51n2087_008:0911b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俄見一人，縛來入獄，斬截手足，磔裂形骸，俯仰之間，支體糜散。",
        "translation": "He then saw a man bound up and taken into the prison, chopping off his hands and feet, cutting off his body, and scattering his limbs and body as he looked up and down.",
        "source": "T51n2087_008:0911b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門見已，深增悲悼，成無常觀，證無學果。",
        "translation": "After he saw this, the ascetic was deeply saddened, became observant of impermanence, and realized the fruit of no more training.",
        "source": "T51n2087_008:0911b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄卒曰：「可以死矣。」",
        "translation": "The jailer said, \"It's time to die.\"",
        "source": "T51n2087_008:0911b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門既證聖果，心夷生死，雖入鑊湯，若在清池，有大蓮花而為之座。",
        "translation": "Having realized the noble fruit, the ascetic's mind was so detached from birth and death that even though he had entered the caldron, he was like being in a clear pond with a large lotus flower on its seat.",
        "source": "T51n2087_008:0911b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄主驚駭，馳使白王，王遂躬觀，深讚靈祐。",
        "translation": "The jailer was shocked and rushed to the king to tell him, so the king personally observed it and profusely praised its spiritual blessings.",
        "source": "T51n2087_008:0911b07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄主曰：「大王當死。」",
        "translation": "The jailer said, \"The king will die!\"",
        "source": "T51n2087_008:0911b08_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「何。」",
        "translation": "The king said, \"Why?\"",
        "source": "T51n2087_008:0911b09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對曰：「王先垂命，令監刑獄，凡至獄垣皆從殺害，不云王入而獨免死。」",
        "translation": "He replied, \"The king had previously decreed that he would be put under guard in a penal colony, and everyone who goes to the prison walls is subject to killing and injury; it's not like the king entered and was spared death alone.\"",
        "source": "T51n2087_008:0911b09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「法已一定，理無再變。",
        "translation": "The king said, \"The Dharma has been set, and the principle won't change again.",
        "source": "T51n2087_008:0911b11_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先垂令，豈除汝身？",
        "translation": "Did I first decree that you be removed from this?",
        "source": "T51n2087_008:0911b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝久濫生，我之咎也。」",
        "translation": "It's my fault that you've been born indolent for so long.\"",
        "source": "T51n2087_008:0911b12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即命獄卒，投之洪鑪。",
        "translation": "He then ordered the jailer to throw the coffin into the floodplain.",
        "source": "T51n2087_008:0911b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獄主既死，王乃得出，於是頹牆堙塹，廢獄寬刑。",
        "translation": "After the jailer died, the king was freed, and the walls were then covered with moats, and the jail was abolished and the punishment was lenient.",
        "source": "T51n2087_008:0911b13_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地獄南不遠有窣堵波，基址傾陷，唯餘覆鉢之勢，寶為廁飾，石作欄檻，即八萬四千之一也。",
        "translation": "Not far south of hell was a stūpa whose foundation had crumbled and only a bowl remained to cover it, a jeweled toilet, and a stone railing, which was one of the 84,000.",
        "source": "T51n2087_008:0911b14_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王以人功建於宮焉，中有如來舍利一斗，靈鑒間起，神光時燭。",
        "translation": "King Aśoka had built this palace with human merit, and in it was a bucket of the Tathāgata's relics, which were occasionally raised in a spiritual mirror and candled with a divine light.",
        "source": "T51n2087_008:0911b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王廢獄之後，遇近護大阿羅漢，方便善誘，隨機導化。",
        "translation": "After he had abolished prison, King Wuzu met a great arhat who was close to him, who skillfully and nicely induced him to guide and transform him at random.",
        "source": "T51n2087_008:0911b18_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王謂羅漢曰：「幸以宿福，位據人尊，慨茲障累，不遭佛化。",
        "translation": "The king told the arhat, \"Fortunately, because of past merits, I'm revered as a human being, but I'm sorry for the hindrances that prevented me from being transformed by the Buddha.",
        "source": "T51n2087_008:0911b19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今者如來遺身舍利，欲重修建諸窣堵波。」",
        "translation": "Now, the Tathāgata wants to rebuild the stūpa with the relics of his body.\"",
        "source": "T51n2087_008:0911b21_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅漢曰：「大王以福德力，役使百靈，以弘誓心匡護三寶，是所願也，今其時矣。」",
        "translation": "The arhat said, \"Now is the time, Your Majesty, to use the power of good fortune to ensnare a hundred spirits and protect the Three Treasures with a great vow.\"",
        "source": "T51n2087_008:0911b22_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因為廣說獻土之因，如來懸記興建之功。",
        "translation": "Because he spoke so eloquently about the causes of the dedication of the land, the Tathāgata gave an intimate account of the merits of its construction.",
        "source": "T51n2087_008:0911b23_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王聞以慶悅，召集鬼神而令之曰：「法王導利，含靈有慶，我資宿善，尊極人中。",
        "translation": "Rejoicing at what he heard, King Aśoka summoned the spirits and commanded them, \"The king of the Dharma guides and benefits, contains the spirits with joy, and I've been honored among people for my long-standing goodness.",
        "source": "T51n2087_008:0911b24_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來遺身重修供養，今爾鬼神勠力同心！",
        "translation": "Now, as the Tathāgata's remains are being re-cultivated for offerings, the ghosts and spirits are working together!",
        "source": "T51n2087_008:0911b26_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "境極贍部，戶滿拘胝，以佛舍利起窣堵波。",
        "translation": "The object is extremely rare, the door is full of cordials, and a stūpa is raised with the Buddha's relics.",
        "source": "T51n2087_008:0911b27_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心發於我，功成於汝。",
        "translation": "It was my intention to give rise to it, and the accomplishment will be yours.",
        "source": "T51n2087_008:0911b28_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝福之利，非欲獨有。",
        "translation": "The benefits of this great merit are not something you want to have alone.",
        "source": "T51n2087_008:0911b29_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜各營搆，待後告命。」",
        "translation": "It's better to make preparations for a later announcement.\"",
        "source": "T51n2087_008:0911b29_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬼神受旨，在所興功，功既成已，咸來請命。",
        "translation": "The ghosts and spirits were instructed to work wherever they were, and after they had accomplished their work, they all came to ask for orders.",
        "source": "T51n2087_008:0911c01_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王既開八國所建諸窣堵波，分其舍利，付鬼神已，謂羅漢曰：「我心所欲，諸處同時藏下舍利。",
        "translation": "After opening the stūpas built in the eight countries and distributing the relics to the ghosts, King Aśoka said to the arhats, \"My heart desires that the relics be hidden in all places at the same time.",
        "source": "T51n2087_008:0911c02_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心雖此冀，事未從欲。」",
        "translation": "Although my heart desires this, I haven't yet done what I desire.\"",
        "source": "T51n2087_008:0911c04_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅漢曰：「王命神鬼至所期日，日有隱蔽，其狀如手，此時也，宜下舍利。」",
        "translation": "The arhat said, \"The king ordered the spirits to come to the appointed day when the sun is hidden and its shape is like a hand; this would be a good time to put down the relics.\"",
        "source": "T51n2087_008:0911c05_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王承此旨，宣告鬼神。",
        "translation": "The king obeyed this order and announced it to the spirits.",
        "source": "T51n2087_008:0911c06_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逮乎期日，無憂王觀候光景，日正中時，羅漢以神通力，申手蔽日，營建之所咸皆瞻仰，同於此時功績咸畢。",
        "translation": "When the sun was exactly at midday on the appointed day, the arhat used his supernormal powers to cover the sun with his hand, and all the places that had been built there were venerated, and all their achievements were accomplished at that time.",
        "source": "T51n2087_008:0911c07_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "窣堵波側不遠，精舍中有大石，如來所履，雙迹猶存，其長尺有八寸，廣餘六寸矣。",
        "translation": "Not far from the side of the stūpa, there's a large stone in the monastery that the Tathāgata walked on, and both traces of it still exist, measuring a foot or eight inches in length and another six inches in width.",
        "source": "T51n2087_008:0911c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩迹俱有輪相，十指皆帶花文，魚形映起，光明時照。",
        "translation": "Both tracks have wheel marks, and each of their ten fingers is covered with a flowery inscription that reflects the shape of a fish and shines brightly at times.",
        "source": "T51n2087_008:0911c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔者如來將取寂滅，北趣拘尸那城，南顧摩揭陀國，蹈此石上，告阿難曰：「吾今最後留此足迹，將入寂滅，顧摩揭陀也。",
        "translation": "Once, when the Tathāgata was about to attain extinction, he went north to the city of Kuśinagara and looked south at the country of Magadha, and he walked up on this stone and told Ānanda, \"Now, I've left these last tracks, and I'm about to enter extinction and look after Magadha.",
        "source": "T51n2087_008:0911c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百歲之後，有無憂王命世君臨，建都此地，匡護三寶，役使百神。」",
        "translation": "A hundred years from now, there will be a King Aśoka who will be appointed ruler of the world, build his capital here, protect the Three Treasures, and serve a hundred gods.\"",
        "source": "T51n2087_008:0911c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及無憂王之嗣位也，遷都築邑，掩周迹石，既近宮城，恒親供養。",
        "translation": "When King Wuzu succeeded to the throne, he moved his capital, built a town, covered his traces and stones, and stayed close to the palace to make offerings.",
        "source": "T51n2087_008:0911c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後諸國王競欲舉歸，石雖不大，眾莫能轉。",
        "translation": "Later, the kings of various countries competed to take the stone back, but even though it wasn't large, no one could turn it.",
        "source": "T51n2087_008:0911c19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近者設賞迦王毀壞佛法，遂即石所，欲滅聖迹，鑿已還平，文彩如故，於是捐棄殑伽河流，尋復本處。",
        "translation": "When King Keshanga recently destroyed the Buddha's teachings, he went to the stone to extinguish the traces of the sage, and after he had drilled it back to the level, the text and color remained the same, so he abandoned the Ganges River and returned to its original location.",
        "source": "T51n2087_008:0911c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側窣堵波，即過去四佛坐及經行遺迹之所。",
        "translation": "On the side of it is a stūpa, which is the place where the four buddhas used to sit and the remains of their sūtras.",
        "source": "T51n2087_008:0911c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛迹精舍側不遠，有大石柱，高三十餘尺，書記殘缺，其大略曰：「無憂王信根貞固，三以贍部洲施佛、法、僧，三以諸珍寶重自酬贖。」",
        "translation": "Not far from the ruins of the Buddha's temple, there's a large stone pillar more than 30 feet high with a fragmentary inscription that reads, \"King Wuzu's faithful roots were so resolute that he gave three offerings to the Buddha, Dharma, and Saṃgha from Jambudvīpa and three offerings of treasures to redeem himself.\"",
        "source": "T51n2087_008:0911c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其辭云，大略斯在。",
        "translation": "The text reads, \"The outline is here.",
        "source": "T51n2087_008:0911c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故宮北有大石室，外若崇山，內廣數丈，是無憂王為出家弟役使神鬼之所建也。",
        "translation": "To the north of the old palace there was a large stone room that looked like a lofty mountain on the outside and was several zhang wide on the inside, which King Aśoka had built to serve the spirits of his renunciant disciples.",
        "source": "T51n2087_008:0911c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，無憂王有同母弟，名摩醯因陀羅(唐言大帝)。",
        "translation": "At first, King Wuzu had a younger brother from the same mother named Mahêndra (Tang term for Mahêndra).",
        "source": "T51n2087_008:0911c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生自貴族，服僣王制，奢侈縱暴，眾庶懷怨。",
        "translation": "He was born into a noble family, overstepped the king's rules, and became extravagant and violent, causing the common people to harbor resentment.",
        "source": "T51n2087_008:0912a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國輔老臣進諫王曰：「驕弟作威，亦已太甚。",
        "translation": "The king was advised by senior ministers who served him, \"It's too much to be proud of your younger brother and make him an authority.",
        "source": "T51n2087_008:0912a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫政平則國治，人和則主安，古之則訓，由來久矣。",
        "translation": "It's an ancient rule that when the government is level, the country will be governed, and when people are peaceful, the lord will be at peace, and it's been taught for a long time.",
        "source": "T51n2087_008:0912a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願存國典，收付執法。」",
        "translation": "May the national code be preserved and the law enforced.\"",
        "source": "T51n2087_008:0912a05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王泣謂弟曰：「吾承基緒，覆燾生靈，況爾同胞，豈忘惠愛！",
        "translation": "Weeping, the king said to his younger brother, \"I inherited our foundations and succumbed to the spirits of living beings, so how could you, my fellow countrymen, forget your love!",
        "source": "T51n2087_008:0912a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不先匡導，已陷刑法。",
        "translation": "If they don't first guide, they'll already be caught by the criminal law.",
        "source": "T51n2087_008:0912a07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上懼先靈，下迫眾議。」",
        "translation": "The higher ups fear the former spirits, and the lower downs are forced to discuss it with the people.\"",
        "source": "T51n2087_008:0912a07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩醯因陀羅稽首謝曰：「不自謹行，敢干國憲，願賜再生，更寬七日。」",
        "translation": "Mahêndra bowed his head and thanked him, \"I dare interfere with the state's constitution because I'm not careful about what I do, so I hope you'll grant me rebirth and a further seven days of leniency.\"",
        "source": "T51n2087_008:0912a08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是置諸幽室，嚴加守衛，珍羞上饌，進奉無虧。",
        "translation": "He then placed them in a secluded room, guarded them closely, offered rare and humble foods, and served them without fail.",
        "source": "T51n2087_008:0912a09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "守者唱曰：「已過一日，餘有六日。」",
        "translation": "The guards called out, \"One day has passed, and there are six remaining days.\"",
        "source": "T51n2087_008:0912a10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至第六日已，既深憂懼，更勵身心，便獲果證，昇虛空，示神迹，尋出塵俗，遠棲巖谷。",
        "translation": "After the sixth day, he was deeply troubled and fearful, and having strengthened his body and mind, he then realized the fruit of his efforts, ascended into space, showed his miracles, sought escape from the worldly world, and withdrew to roost in a valley.",
        "source": "T51n2087_008:0912a11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王躬往謂曰：「昔拘國制，欲致嚴刑。",
        "translation": "King Wuzu personally went to him and said, \"In the past, I was bound by state regulations and wanted to inflict harsh punishment.",
        "source": "T51n2087_008:0912a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈意清昇，取證聖果。",
        "translation": "How could I have expected to ascend so purely that I would realize the noble fruit?",
        "source": "T51n2087_008:0912a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既無滯累，可以還國。」",
        "translation": "Now that he's not encumbered, he can return to the country.\"",
        "source": "T51n2087_008:0912a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟曰：「昔羈愛網，心馳聲色，今出危城，志悅山谷。",
        "translation": "The disciple said, \"In the past, I was trapped in the web of desire, and my mind was driven by sound and form; now, I've left the city in danger, and my intention is to enjoy the valley.",
        "source": "T51n2087_008:0912a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願棄人間，長從丘壑。」",
        "translation": "I wish to abandon the world and remain in the valleys.\"",
        "source": "T51n2087_008:0912a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「欲靜心慮，豈必幽巖？",
        "translation": "The king said, \"If you want to quiet your mind and deliberate, how could it be a secluded mountain?",
        "source": "T51n2087_008:0912a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾從爾志，當為崇樹。」",
        "translation": "I'll obey your wish and make a venerable tree.\"",
        "source": "T51n2087_008:0912a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂召命鬼神而告之曰：「吾於後日廣備珍羞，爾曹相率來集我會，各持大石，自為床座。」",
        "translation": "He then summoned the spirits and told them, \"On the following day, I'll prepare a large collection of treasures, and you will each gather here with a large stone and make your own seat.\"",
        "source": "T51n2087_008:0912a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸神受命，至期畢萃。",
        "translation": "The spirits accepted the order and assembled by the end of the day.",
        "source": "T51n2087_008:0912a20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾會既已，王告神曰：「石座從橫，宜自積聚。",
        "translation": "After the assembly was complete, the king told the gods, \"The stone seats are placed sideways, so it's better to gather them up yourself.",
        "source": "T51n2087_008:0912a20_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因功不勞，壘為虛室。」",
        "translation": "Because of this effort, the fortress will become an empty chamber.\"",
        "source": "T51n2087_008:0912a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸神受命，不日而成。",
        "translation": "The gods were commissioned, and it wasn't long before it was built.",
        "source": "T51n2087_008:0912a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王躬往迎請，止此山廬。",
        "translation": "King Aśoka personally went to meet them and invited them to stop at this mountain retreat.",
        "source": "T51n2087_008:0912a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故宮北，地獄南，有大石槽，是無憂王匠役神功，作為此器，飯僧之時，以儲食也。",
        "translation": "To the north of the old palace and south of hell, there's a large stone cistern that King Aśoka made from the work of his craftsmen and gods to store food for the monks when they were eating.",
        "source": "T51n2087_008:0912a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故宮西南有小石山，周巖谷間，數十石室，無憂王為近護等諸阿羅漢，役使鬼神之所建立。",
        "translation": "Southwest of the old palace there's a small stone mountain surrounded by a valley with dozens of stone rooms that King Aśoka built for arhats like Konko and others who were enslaved by ghosts and spirits.",
        "source": "T51n2087_008:0912a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傍有故臺，餘基積石；池沼漣漪，清瀾澄鑒，隣國遠人謂之聖水，若有飲濯，罪垢消滅。",
        "translation": "Nearby, there's an old terrace with a rock pile at its base, and a rippling pond with a clear, crisp water that's called holy water by people far away in neighboring countries.",
        "source": "T51n2087_008:0912a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山西南有五窣堵波，崇基已陷，餘址尚高，遠而望之，欝若山阜，面各數百步，後人於上重更修建小窣堵波。",
        "translation": "To the southwest of the mountain are five stūpas, the foundations of which have fallen in, but the rest of the site is still high, and when viewed from a distance, it looks like a mountain mound with a face of several hundred paces each.",
        "source": "T51n2087_008:0912b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "《印度記》曰：「昔無憂王建八萬四千窣堵波已，尚餘五斗舍利，故別崇建五窣堵波，制奇諸處，靈異間起，以表如來五分法身。",
        "translation": "The Record of India says, \"In the past, after King Wuyu built 84,000 stūpas, he still had five remaining relics, so he reverently built five separate stūpas, making them in strange places and producing them from time to time to represent the five parts of the Tathāgata's Dharma body.",
        "source": "T51n2087_008:0912b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薄信之徒竊相評議，云是昔者難陀王建此藏，以儲七寶。",
        "translation": "Disciples of weak faith secretly commented that King Nandanavana had built this repository in the past to store the seven treasures.",
        "source": "T51n2087_008:0912b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後有王，不甚淳信，聞先疑議，肆其貪求，興動軍師，躬臨發掘，地震山傾，雲昏日翳，窣堵波中大聲雷震，士卒僵仆，象馬驚奔。",
        "translation": "When a later king, not quite faithful, heard of the prior doubts and unbridled his craving, he mobilized his army and personally went out to dig for it, causing an earthquake that tipped the mountains, darkened the clouds and covered the sun, and sent a loud thunderclap through the stūpa, leaving his soldiers frozen and falling down, and terrified elephants and horses running.",
        "source": "T51n2087_008:0912b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自茲已降，無敢覬覦。」",
        "translation": "Since then, no one has dared to covet them.\"",
        "source": "T51n2087_008:0912b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或曰：「眾議雖多，未為確論；循古所記，信得其實。」",
        "translation": "Some people say, \"Although there are many theories, they aren't definite; following what's recorded in ancient times is believed to be true.\"",
        "source": "T51n2087_008:0912b12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故城東南有屈(居勿反)吒阿濫摩(唐言鷄園)僧伽藍，無憂王之所建焉。",
        "translation": "Southeast of the old city was the monastery of Kukku (Kubetsu) Tcha'ayumo (Tang Dynasty), which King Wuzu had built.",
        "source": "T51n2087_008:0912b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王初信佛法也，式遵崇建，修殖善種，召集千僧，凡、聖兩眾，四事供養，什物周給。",
        "translation": "When he first believed in the Buddha's teachings, King Wuzu revered their establishment, cultivated good seeds, gathered a thousand monks, and made offerings to both worldly and holy people in four ways, providing them with everything.",
        "source": "T51n2087_008:0912b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頹毀已久，基址尚在。",
        "translation": "It has been decayed for a long time, but the foundation is still standing.",
        "source": "T51n2087_008:0912b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽藍側有大窣堵波，名阿摩落伽者。",
        "translation": "On the side of the Kālāma there's a large stūpa named Amalāga.",
        "source": "T51n2087_008:0912b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "印度藥果之名也。",
        "translation": "It's the name of a medicine fruit in India.",
        "source": "T51n2087_008:0912b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王搆疾彌留，知命不濟，欲捨珍寶，崇樹福田。",
        "translation": "King Aśoka was dying of illness and knew that his life would not be helped, so he wanted to abandon his treasures and venerate the field of merit.",
        "source": "T51n2087_008:0912b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "權臣執政，誡勿從欲。",
        "translation": "He was ruled by a minister who warned against following his desires.",
        "source": "T51n2087_008:0912b20_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後因食，留阿摩落果，玩之半爛，握果長息，問諸臣曰：「贍部洲主今是何人？」",
        "translation": "Later, when he had eaten, he left the fruit of amalāga, played with it half rotted, held it for a long time, and asked the ministers, \"Who is the lord of Jambudvīpa now?\"",
        "source": "T51n2087_008:0912b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸臣對曰：「唯獨大王。」",
        "translation": "The ministers said to each other, \"Only the king!\"",
        "source": "T51n2087_008:0912b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「不然。",
        "translation": "The king said, \"No.",
        "source": "T51n2087_008:0912b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今非主。",
        "translation": "Now, I'm not the king.",
        "source": "T51n2087_008:0912b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯此半果，而得自在。",
        "translation": "Only this half-fruit makes me attain freedom.",
        "source": "T51n2087_008:0912b23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嗟乎！",
        "translation": "Oh, my!",
        "source": "T51n2087_008:0912b24_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間富貴，危甚風燭。",
        "translation": "The world's wealth and power are at risk, even as the wind catches a candle.",
        "source": "T51n2087_008:0912b24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "位據區宇，名高稱謂，臨終匱乏，見逼強臣，天下非己，半果斯在！」",
        "translation": "Their position is based on a district, their reputation is high, they are destitute at the end, and they see themselves forced to serve powerful ministers.",
        "source": "T51n2087_008:0912b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃命侍臣而告之曰：「持此半果，詣彼雞園，施諸眾僧，作如是說：『昔一贍部洲主，今半阿摩落王，稽首大德僧前，願受最後之施。",
        "translation": "He ordered his attendants to tell them, \"Take this half-fruit, go to that chicken park, give it to the monks, and tell them, 'Once upon a time, the lord of Jambudvīpa was half a king of Amalā, and now he presents himself to the great virtuous monks and wishes to accept the final gift.",
        "source": "T51n2087_008:0912b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡諸所有，皆已喪失，唯斯半果，得少自在。",
        "translation": "All of his possessions have been lost, and only this half-fruit has gained a modicum of freedom.",
        "source": "T51n2087_008:0912b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哀愍貧乏，增長福種。』」",
        "translation": "Pitying the poor, it will increase the seeds of merit.'\"",
        "source": "T51n2087_008:0912c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧中上座作如是言：「無憂大王宿期弘濟，瘧疾在躬，姦臣擅命，積寶非己，半果為施。",
        "translation": "The superior among the saṃgha said, \"The great King Aśoka has long been a great helper, has malaria in his body, and has been led by treacherous ministers to accumulate treasures other than his own, so he has given half a fruit as alms.",
        "source": "T51n2087_008:0912c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "承王來命，普施眾僧。」",
        "translation": "I've been instructed by the king to give generosity to all the saṃgha.\"",
        "source": "T51n2087_008:0912c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即召典事，羹中總煮。",
        "translation": "He summoned the superintendent and prepared a large portion of the soup.",
        "source": "T51n2087_008:0912c04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "收其果核，起窣堵波。",
        "translation": "He collected the kernels of the fruit and raised a stūpa.",
        "source": "T51n2087_008:0912c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既荷厚恩，遂旌顧命。",
        "translation": "Having received this generous gift, he then gave it his respectful order.",
        "source": "T51n2087_008:0912c05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿摩落伽窣堵波西北，故伽藍中有窣堵波，謂建揵稚聲。",
        "translation": "To the northwest of the Amalāga's stūpa, there's a stūpa in the kalāma that's called a gandharva.",
        "source": "T51n2087_008:0912c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，此城內伽藍百數，僧徒肅穆，學業清高，外道學人，銷聲緘口。",
        "translation": "At first, there were a hundred kalas in the city, and the monks and their followers were so dignified and their training so noble that non-Buddhists who studied there would silence their voices.",
        "source": "T51n2087_008:0912c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後僧徒相次徂落，而諸後進莫繼前修。",
        "translation": "Later, the monks and their followers left one after the other, and those who advanced later didn't continue their training.",
        "source": "T51n2087_008:0912c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道師資傅訓成藝，於是命儔召侶，千計萬數，來集僧坊，揚言唱曰：「夫擊揵稚，招集學人！」",
        "translation": "When the non-Buddhist masters had trained them in the art of training, they ordered thousands of their companions to gather at the monastery, saying, \"Let's hit the gandharva to gather the trainees!\"",
        "source": "T51n2087_008:0912c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "群愚同止，謬有扣擊。",
        "translation": "The group of fools all stopped together, but there was a mistake in suppressing it.",
        "source": "T51n2087_008:0912c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂白王，請挍優劣。",
        "translation": "They then told the king to evaluate their superiority and inferiority.",
        "source": "T51n2087_008:0912c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道諸師高才達學，僧徒雖眾，辭論膚淺。",
        "translation": "The non-Buddhist teachers were highly talented and well-versed, but even though the monks and their followers were numerous, their explanations were shallow.",
        "source": "T51n2087_008:0912c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道曰：「我論勝。",
        "translation": "The non-Buddhists said, \"I'm superior in my discourse.",
        "source": "T51n2087_008:0912c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自今已後，諸僧伽藍不得擊揵稚以集眾也。」",
        "translation": "From now on, the saṃgha kalaviṅka won't be able to assemble the crowd by striking the gandharva.\"",
        "source": "T51n2087_008:0912c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王允其請，依先論制。",
        "translation": "The king granted his request and followed the rules of the previous treatise.",
        "source": "T51n2087_008:0912c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧徒受恥，忍詬而退，十二年間不擊揵稚。",
        "translation": "The monks were humiliated, tolerated the criticism, and withdrew, refraining from striking ghaṇṭās for twelve years.",
        "source": "T51n2087_008:0912c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時南印度那伽閼剌樹那菩薩(唐言龍猛。",
        "translation": "It was then that the bodhisattva Nāgârjuna of South India (Tang term for Nāgârjuna.",
        "source": "T51n2087_008:0912c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊譯曰龍樹，非也)，幼傳雅譽，長擅高名，捨離欲愛，出家修學，深究妙理，位登初地。",
        "translation": "He abandoned his desires, left home, cultivated, and deeply investigated the marvelous principle, and rose to the first ground.",
        "source": "T51n2087_008:0912c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有大弟子提婆者，智慧明敏，機神警悟，白其師曰：「波吒釐城諸學人等辭屈外道，不擊揵稚，日月驟移，十二年矣。",
        "translation": "A great disciple named Deva, who was wise, bright, and alert, said to his teacher, \"It's been twelve years since the trainees in Pāṭaliputra resisted and yielded to the heretics and didn't strike the gandharva, and the sun and moon have suddenly moved on.",
        "source": "T51n2087_008:0912c19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敢欲摧邪見山，然正法炬。」",
        "translation": "I dare you to destroy the mountain of wrong views and proclaim the torch of the true teaching.\"",
        "source": "T51n2087_008:0912c22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍猛曰：「波吒釐城外道博學，爾非其儔，吾今行矣。」",
        "translation": "Longmeng said, \"You're not among the trainees from Pāṭaliputra who are well-versed, but I'll do it now.\"",
        "source": "T51n2087_008:0912c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆曰：「欲摧腐草，詎必傾山？",
        "translation": "Deva said, \"If you want to destroy rotten grass, why don't you dump the mountain?",
        "source": "T51n2087_008:0912c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敢承指誨，黜諸異學。",
        "translation": "I dare to accept your instruction and dismiss those who study elsewhere.",
        "source": "T51n2087_008:0912c24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大師立外道義，而我隨文破析，詳其優劣，然後圖行。」",
        "translation": "The great master established a non-Buddhist doctrine, and I will analyze the text accordingly, detail its strengths and weaknesses, and then attempt to practice it.\"",
        "source": "T51n2087_008:0912c25_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍猛乃扶立外義，提婆隨破其理，七日之後，龍猛失宗，已而歎曰：「謬辭易失，邪義難扶。",
        "translation": "Long Meng then helped establish the non-Buddhist doctrine, and Dīpa followed, refuting its principle. After seven days, Long Meng lost his school and praised him, saying, \"Fallacious words are easy to lose, and mistaken doctrine is difficult to support.",
        "source": "T51n2087_008:0912c26_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾其行矣，摧彼必矣！」",
        "translation": "Now that you've done it, you'll surely destroy them!\"",
        "source": "T51n2087_008:0912c28_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆菩薩夙擅高名，波吒釐城外道之聞也，即相召集，馳白王曰：「大王昔紆聽覽，制諸沙門不擊揵稚。",
        "translation": "Deva Bodhisattva, who had long been renowned, was heard by the non-Buddhists of Pāṭaliputra, so he rallied together and rushed to the king, saying, \"The great king, the demon heard about it in the past, and he restrained the ascetics from striking the gandharvas.",
        "source": "T51n2087_008:0912c29_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂告命。",
        "translation": "May it please you to give him an order.",
        "source": "T51n2087_008:0913a02_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "令諸門候，隣境異僧勿使入城，恐相黨援，輕改先制。」",
        "translation": "Tell the gatekeepers not to allow foreign monks from the neighboring lands to enter the city, lest they be supported by one another and lightly change the prior rule.\"",
        "source": "T51n2087_008:0913a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王允其言，嚴加伺候。",
        "translation": "The king agreed with his words and kept a close watch over them.",
        "source": "T51n2087_008:0913a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆既至，不得入城。",
        "translation": "After he arrived, Dīpa wasn't allowed to enter the city.",
        "source": "T51n2087_008:0913a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞其制令，便易衣服，疊僧加胝，置草束中，褰裳疾驅，負戴而入。",
        "translation": "Hearing his order, he changed his clothes, piled up his monks' coats, put them in a bundle of straw, lowered his robes, and drove quickly, carrying his robes with him as he entered the city.",
        "source": "T51n2087_008:0913a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既至城中，棄草披衣，至此伽藍，欲求止息。",
        "translation": "Once he reached the city, he threw away his straw and put on his robe, went to this kalaviṅka, and wanted to get some rest.",
        "source": "T51n2087_008:0913a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知人既寡，莫有相舍，遂宿揵稚臺上。",
        "translation": "Since he knew there were few people, there was no one else to turn to, so he stayed on the gandharva's dais.",
        "source": "T51n2087_008:0913a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於晨朝時，便大振擊。",
        "translation": "In the morning, he would make a big bang.",
        "source": "T51n2087_008:0913a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾聞伺察，乃客遊比丘。",
        "translation": "The people who heard and observed him were visiting monks.",
        "source": "T51n2087_008:0913a09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸僧伽藍傳聲響應。",
        "translation": "The saṃgha kalaviṅka sent out a response with sound.",
        "source": "T51n2087_008:0913a09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞究問，莫得其先，至此伽藍，咸推提婆。",
        "translation": "When the king heard about it, he asked about it, but no one could find out who was the first, and when they arrived at the monastery, they all asked Dīpa.",
        "source": "T51n2087_008:0913a10_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆曰：「夫揵稚者，擊以集眾。",
        "translation": "Deva said, \"A gandharva is meant to be struck to gather people.",
        "source": "T51n2087_008:0913a11_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有而不用，懸之何為？」",
        "translation": "If he has one but doesn't use it, why is it hanging?\"",
        "source": "T51n2087_008:0913a12_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王人報曰：「先時僧眾論議墮負，制之不擊，已十二年。」",
        "translation": "The king's people reported, \"It's been twelve years since the saṃgha first debated falling into error and suppressed it without striking.\"",
        "source": "T51n2087_008:0913a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆曰：「有是乎？",
        "translation": "Deva said, \"Is that true?",
        "source": "T51n2087_008:0913a13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾於今日，重聲法鼓。」",
        "translation": "Today, I'm going to sound the Dharma drum again.\"",
        "source": "T51n2087_008:0913a14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使報王曰：「有異沙門欲雪前恥。」",
        "translation": "The envoy reported to the king, \"Some esoteric monk wants to clear his past shame.\"",
        "source": "T51n2087_008:0913a14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王乃召集學人，而定制曰：「論失本宗，殺身以謝。」",
        "translation": "The king then summoned the trainees and ordered them to \"discuss the loss of the original teaching and kill themselves to thank them.\"",
        "source": "T51n2087_008:0913a15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是外道競陳旗鼓，諠談異義，各曜辭鋒。",
        "translation": "The non-Buddhists then competed with each other in presenting banners and drums, discussing different meanings and expressing their rhetorical prowess.",
        "source": "T51n2087_008:0913a16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆菩薩既昇論座，聽其先說，隨義析破，曾不浹辰，摧諸異道。",
        "translation": "After ascending to the debate seat, Devabodhisattva listened to his earlier teaching, analyzing and refuting the meaning as it was presented, without ever missing a beat, and destroying the non-Buddhist doctrines.",
        "source": "T51n2087_008:0913a17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王大臣莫不慶悅，建此靈基，以旌至德。",
        "translation": "The king and his ministers were all delighted and built this spiritual foundation to honor his supreme virtue.",
        "source": "T51n2087_008:0913a19_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "建擊揵稚窣堵波北有故基，昔鬼辯婆羅門所居處也。",
        "translation": "There's an old foundation to the north of Krakucchanda's stūpa that used to be the residence of a Brahmin who defended demons.",
        "source": "T51n2087_008:0913a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，此城中有婆羅門，葺宇荒藪，不交世路，祠鬼求福，魍魎相依。",
        "translation": "At first, there was a Brāhmaṇa in this city who built a building in a deserted area that didn't interfere with the ways of the world, and he worshipped ghosts and sought good fortune, and monsters and ghosts relied on him.",
        "source": "T51n2087_008:0913a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高論劇談，雅辭響應，人或激難，垂帷以對。",
        "translation": "He would engage in lofty discussions and elegant speech, and when people were agitated, he would hang down his curtain and respond.",
        "source": "T51n2087_008:0913a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊學高才，無出其右，士庶翕然，仰之猶聖。",
        "translation": "There was no one of his peers who was more learned and talented than he was in the past, and the people of his community looked up to him as a sage.",
        "source": "T51n2087_008:0913a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有阿濕縛窶沙(唐言馬鳴)菩薩者，智周萬物，道播三乘，每謂人曰：「此婆羅門學不師受，藝無稽古，屏居幽寂，獨擅高名，將非神鬼相依，妖魅所附，何能若是者乎？",
        "translation": "There was Aśvaghoṣa (Tang word for horse song), a bodhisattva whose wisdom permeated all things and whose path spread to the three vehicles, who used to tell people, \"This Brāhmaṇa doesn't have teachers or trainees, his art has no precedent, he lives in seclusion, and he alone commands a high reputation.",
        "source": "T51n2087_008:0913a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫辯資鬼授，言不對人，辭說一聞，莫能再述，吾今往彼，觀其舉措。」",
        "translation": "An eloquent teacher is not one who speaks to others, and there's nothing I can say or hear that can be repeated.",
        "source": "T51n2087_008:0913a29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂即其廬，而謂之曰：「仰欽盛德，為日已久。",
        "translation": "He then went to his house and said, \"It's been a long time since I've admired your great virtue.",
        "source": "T51n2087_008:0913b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸願褰帷，敢申宿志。」",
        "translation": "I'm glad to lower my curtain and dare to express my long-cherished wish.\"",
        "source": "T51n2087_008:0913b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而婆羅門居然簡傲，垂帷以對，終不面談。",
        "translation": "The Brāhmaṇa was actually quite proud of him, hanging down his curtain to face him and never talking to him face to face.",
        "source": "T51n2087_008:0913b03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬鳴心知鬼魅，情甚自負，辭畢而退，謂諸人曰：「吾已知矣，摧彼必矣。」",
        "translation": "Knowing in his heart that he was a demon, Ming Ma was very proud of himself, so he withdrew after resigning and said to the others, \"I've known it, and I'm sure I can destroy them.\"",
        "source": "T51n2087_008:0913b04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋往白王：「唯願垂許，與彼居士較論劇談。」",
        "translation": "He went to the king and said, \"Please allow me to have a discussion with that householder.\"",
        "source": "T51n2087_008:0913b06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞駭曰：「斯何人哉！",
        "translation": "The king was shocked to hear this, saying, \"What kind of person is that?",
        "source": "T51n2087_008:0913b07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不證三明，具六通，何能與彼論乎？」",
        "translation": "If someone doesn't realize the three kinds of insight and possess the six supernormal powers, how can they talk to them?\"",
        "source": "T51n2087_008:0913b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "命駕躬臨，詳鑒辯論。",
        "translation": "He was ordered to come personally to the site and discuss the topic in detail.",
        "source": "T51n2087_008:0913b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時馬鳴論三藏微言，述五明大義，妙辯縱橫，高論清遠。",
        "translation": "It was then that Ming Ma discussed the subtle words of the Tripiṭaka and described the great meaning of the five sciences with subtle eloquence and lofty discussions.",
        "source": "T51n2087_008:0913b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而婆羅門既述辭已，馬鳴重曰：「失吾旨矣，宜重述之。」",
        "translation": "When Brāhmaṇa had finished speaking, Ma Ming repeated, \"My point has been lost; it would be better to restate it.\"",
        "source": "T51n2087_008:0913b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時婆羅門默然杜口，馬鳴叱曰：「何不釋難？",
        "translation": "When Brāhmaṇa remained silent and shut up, Ma Ming shouted, \"Why don't you explain the difficulty?",
        "source": "T51n2087_008:0913b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所事鬼魅宜速授辭！」",
        "translation": "It is advisable to quickly give a discourse on the subject of demons!\"",
        "source": "T51n2087_008:0913b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疾褰其帷，視占其怪。",
        "translation": "He quickly lowered his curtain and looked at his strange features.",
        "source": "T51n2087_008:0913b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門惶遽而曰：「止！",
        "translation": "The Brāhmaṇa panicked and said, \"Stop!",
        "source": "T51n2087_008:0913b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止！」",
        "translation": "Stop!\"",
        "source": "T51n2087_008:0913b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "馬鳴退而言曰：「此子今晨聲問失墜，虛名非久，斯之謂也。」",
        "translation": "The horse retired and said, \"This son's voice and questioning this morning have fallen through, and his reputation hasn't been false for a long time.",
        "source": "T51n2087_008:0913b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「非夫盛德，誰鑒左道？",
        "translation": "The king said, \"If it isn't someone of great virtue, who will examine the left path?",
        "source": "T51n2087_008:0913b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知人之哲，絕後光前，國有常典，宜旌茂實。」",
        "translation": "The philosophers who know people are absolutely brilliant, and the country has a constant code that should be honored as genuine.\"",
        "source": "T51n2087_008:0913b16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城西南隅二百餘里，有伽藍餘跡。",
        "translation": "About 200 miles southwest of the city, there's the remnants of the Kālāma.",
        "source": "T51n2087_008:0913b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其傍有窣堵波，神光時燭，靈瑞間發，近遠眾庶莫不祈請，是過去四佛坐及經行遺迹之所。",
        "translation": "Nearby, there's a stūpa, which is a place where the four buddhas used to sit and the remains of their sūtras used to burn brightly and occasionally produce spiritual gifts that are invoked by people near and far.",
        "source": "T51n2087_008:0913b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故伽藍西南行百餘里，至鞮羅釋迦伽藍。",
        "translation": "A little more than a hundred miles southwest of the old Kālāma, it reaches the Di Rājagṛha Kālāma.",
        "source": "T51n2087_008:0913b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "庭宇四院，觀閣三層，崇臺累仞，重門洞啟，頻毘娑羅王末孫之所建也。",
        "translation": "It has four courtyards, a three-story observation tower, a high dais that's tall and taller, and multiple entrances that are open, which were built by the late descendants of King Bimbisāra.",
        "source": "T51n2087_008:0913b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "旌召高才，廣延俊德，異域學人，遠方髦彥，同類相趨，肩隨戾止。",
        "translation": "It fostered high caliber, extended excellence, and encouraged trainees from foreign lands and eminent persons from distant lands to follow in the same footsteps and stop at the same place.",
        "source": "T51n2087_008:0913b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧徒千數，並學大乘。",
        "translation": "There were thousands of monks and disciples who were all studying the great vehicle.",
        "source": "T51n2087_008:0913b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中門當塗，有三精舍，上置輪相，鈴鐸虛懸，下建層基，軒檻周列，戶牖棟梁，壖垣階陛，金銅隱起，廁間莊嚴。",
        "translation": "In the middle gate, facing the paint, there are three fine buildings, with a wheel sign on top, a bell hanging in the air, a storeyed foundation below, a row of highways and ladders, windows and staircases, a waterfront, and a staircase, with gold and copper hidden away and ornamented lavatories.",
        "source": "T51n2087_008:0913b25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中精舍佛立像高三丈，左多羅菩薩像，右觀自在菩薩像。",
        "translation": "In the central monastery, the Buddha's statue stood three feet tall, with the image of Tārā on the left and the image of Avalokitêśvara on the right.",
        "source": "T51n2087_008:0913b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡斯三像，鍮石鑄成，威神肅然，冥鑒遠矣。",
        "translation": "These three images, cast in copper, are dignified and dignified, and their vision is far-reaching.",
        "source": "T51n2087_008:0913b29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精舍中各有舍利一升，靈光或照，奇瑞間起。",
        "translation": "In each of the monasteries there is a liter of relics, which sometimes shine brightly and produce strange gifts.",
        "source": "T51n2087_008:0913c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鞮羅釋迦伽藍西南九十餘里，至大山，雲石幽蔚，靈僊攸舍，毒蛇、暴龍窟穴其藪，猛獸、鷙鳥棲伏其林。",
        "translation": "Ninety-odd miles southwest of the Dīrāśaka Kālāma, there's a large mountain with a mysterious array of clouds and rocks, a forest where vipers and dragons cave in and fierce animals and ferocious birds roost.",
        "source": "T51n2087_008:0913c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山頂有大盤石，上建窣堵波，其高十餘尺，是佛入定處也。",
        "translation": "At the top of the mountain is a large rock on which a stūpa is built, more than ten feet high, which is where the Buddha enters into meditation.",
        "source": "T51n2087_008:0913c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔者如來降神止此，坐斯磐石，入滅盡定，時經宿焉。",
        "translation": "In the past, the Tathāgata descended from this place, sat on this rock, and entered into the concentration of total cessation while passing through the night.",
        "source": "T51n2087_008:0913c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天靈聖供養如來，鼓天樂，雨天花。",
        "translation": "The gods, spirits, and sages made offerings to the Tathāgata, performed celestial music, and rained smallpox.",
        "source": "T51n2087_008:0913c07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來出定，諸天感慕，以寶金銀起窣堵波。",
        "translation": "When the Tathāgata emerged from that concentration, the gods were so impressed that they raised a stūpa of precious gold and silver.",
        "source": "T51n2087_008:0913c08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去聖逾邈，寶變為石。",
        "translation": "After the sages departed for a long time, the treasure was transformed into stone.",
        "source": "T51n2087_008:0913c09_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自古迄今，人未有至。",
        "translation": "Since ancient times, no one has ever reached it.",
        "source": "T51n2087_008:0913c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遙望高山，乃見異類，長蛇、猛獸群從右旋，天仙靈聖肩隨讚禮。",
        "translation": "Looking out over the high mountains, I see an extraordinary creature, a long snake, a herd of fierce animals circling from the right, and gods, sages, spirits, and sages following and praising them.",
        "source": "T51n2087_008:0913c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山東岡有窣堵波，在昔如來佇觀摩揭陀國所履之處也。",
        "translation": "On the eastern side of the mountain there's a stūpa, which is where the Tathāgata used to stand and look around to see the country of Magadha.",
        "source": "T51n2087_008:0913c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山西北三十餘里，山阿有伽藍，負嶺崇基，疎崖峙閣。",
        "translation": "About thirty miles northwest of the mountain, there's a kalāma on Mt. A, with a lofty base on a hill and a pavilion on a cliff.",
        "source": "T51n2087_008:0913c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧徒五十餘人，並習大乘法教。",
        "translation": "There are more than fifty monks and their followers, all of whom practice the teachings of the great vehicle.",
        "source": "T51n2087_008:0913c14_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞿那末底(唐言德慧)菩薩伏外道之處。",
        "translation": "It's where the bodhisattva Guṇamati (Tang word for virtue and wisdom) subdued the heretics.",
        "source": "T51n2087_008:0913c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，此山中有外道摩沓婆者，祖僧佉之法而習道焉。",
        "translation": "At first, there was a heretic named Mathurva on this mountain who practiced the teachings of the ancestor Saṃskha.",
        "source": "T51n2087_008:0913c15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學窮內外，言極空有，名高前列，德重當時。",
        "translation": "His training was limited to internal and external, his words were completely empty and existent, and he was known as a man of high rank and whose virtue was respected at the time.",
        "source": "T51n2087_008:0913c17_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "君王珍敬，謂之國寶，臣庶宗仰，咸曰家師。",
        "translation": "The king treasured him as a national treasure, and his subjects revered him as a family teacher.",
        "source": "T51n2087_008:0913c18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隣國學人承風仰德，儔之先進，誠博達也。",
        "translation": "The scholars of neighboring countries looked up to him for his virtue as a fellow trainee, and he was truly a man of extensive learning.",
        "source": "T51n2087_008:0913c19_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "食邑二城，環居封建。",
        "translation": "He was living in two cities, surrounded by feudal cities.",
        "source": "T51n2087_008:0913c20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時南印度德慧菩薩幼而敏達，早擅精微，學通三藏，理窮四諦。",
        "translation": "At the time, the South Indian Bodhisattva Deśī was a young and perceptive man who had early mastered the subtleties, learned the three collections, and comprehended the four truths.",
        "source": "T51n2087_008:0913c20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞摩沓婆論極幽微，有懷挫銳，命一門人裁書謂曰：「敬問摩沓婆善安樂也。",
        "translation": "Hearing that Mathurva's treatises were extremely subtle and that he had a sense of frustration, he ordered one of his disciples to cut a letter, saying, \"Respectfully, ask Mathurva about his good fortune.",
        "source": "T51n2087_008:0913c22_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜忘勞弊，精習舊學，三年之後，摧汝嘉聲。」",
        "translation": "It's better to forget your troubles and concentrate on your old studies; after three years, I'll destroy your good reputation.\"",
        "source": "T51n2087_008:0913c24_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是第二、第三年中，每發使報。",
        "translation": "Thus, in the second and third years, he sent an envoy every time he received a reward.",
        "source": "T51n2087_008:0913c25_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及將發迹，重裁書曰：「年期已極，學業何如？",
        "translation": "When he was about to start his career, he repeatedly wrote, \"It's the end of your life; what about your training?",
        "source": "T51n2087_008:0913c25_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今至矣，汝宜知之。」",
        "translation": "Now that I've arrived, you should know about it.\"",
        "source": "T51n2087_008:0913c26_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩沓婆甚懷惶懼，誡諸門人及以邑戶：「自今之後，不得居止沙門異道，遞相宣告，勿有犯違。」",
        "translation": "Being very frightened, he instructed the disciples and the residents of the town, \"From now on, you mustn't stay at the house of an ascetic or heretic, and you must tell each other not to violate this rule.\"",
        "source": "T51n2087_008:0913c27_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時德慧菩薩杖錫而來，至摩沓婆邑，人守約，莫有相舍。",
        "translation": "When the Bodhisattva of Virtue and Wisdom arrived with his staff and arrived at the town of Mathāmba, the people kept their promise, and none of them gave up.",
        "source": "T51n2087_008:0913c29_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸婆羅門更詈之曰：「斷髮殊服，何異人乎？",
        "translation": "The brāhmaṇas even ridiculed him, saying, \"What difference does it make to someone who has cut off their hair and dresses differently?",
        "source": "T51n2087_008:0914a01_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜時速去，勿此止也！」",
        "translation": "It's better to go quickly than to stop here!\"",
        "source": "T51n2087_008:0914a02_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧菩薩欲摧異道，冀宿其邑，因以慈心，卑辭謝曰：「爾曹世諦之淨行，我又勝義諦之淨行，淨行既同，何為見拒？」",
        "translation": "Desiring to destroy those of another path and hoping to stay at their capital, the Bodhisattva of Virtue and Wisdom, with kindness, gave a humble apology, saying, \"Since you carry out a pure practice in the conventional truth and I carry out a pure practice in the ultimate truth, why do you reject it when the pure practices are the same?\"",
        "source": "T51n2087_008:0914a03_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門因不與言，但事驅逐。",
        "translation": "Because of this, the Brāhmaṇa didn't talk to him but simply chased him away.",
        "source": "T51n2087_008:0914a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逐出邑外，入大林中。",
        "translation": "They drove them out of the town and into a large forest.",
        "source": "T51n2087_008:0914a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "林中猛獸群行為暴，有淨信者恐為獸害，乃束蘊持仗，謂菩薩曰：「南印度有德慧菩薩者，遠傳聲問，欲來論議，故此邑主懼墜嘉聲，重垂嚴制，勿止沙門。",
        "translation": "When a herd of fierce animals roamed the forest, a man of pure faith feared that they might harm him. He gathered his armor and carried his baton and said to the bodhisattva, \"There's a Bodhisattva of Virtue and Wisdom in South India who has sent a message from afar and wants to come here to discuss it.",
        "source": "T51n2087_008:0914a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐為物害，故來相援。",
        "translation": "He was afraid of being harmed by something, so he came to offer support.",
        "source": "T51n2087_008:0914a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行矣自安，勿有他慮。」",
        "translation": "Do as you wish, and don't have other concerns.\"",
        "source": "T51n2087_008:0914a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧曰：「良告淨信，德慧者，我是也。」",
        "translation": "Dehui said, \"Ryo told Jingshin, 'Dehui, this is me.'\"",
        "source": "T51n2087_008:0914a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨信聞已，更深恭敬，謂德慧曰：「誠如所告，宜可速行。」",
        "translation": "After Jing Xin heard this, he paid deeper respect and said to Dehui, \"As you've been told, it's advisable to do it quickly.\"",
        "source": "T51n2087_008:0914a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即出深林，止息空澤。",
        "translation": "He then left the deep forest and stopped at a vacant swamp.",
        "source": "T51n2087_008:0914a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨信縱火持弓，周旋左右，夜分已盡，謂德慧曰：「可以行矣，恐人知聞，來相圖害。」",
        "translation": "Jing Xin built a fire and held a bow, circled around, and after the night was over, he said to Dehui, \"It's ready to go, but I'm afraid people will know and hear about it and come to try to harm us.\"",
        "source": "T51n2087_008:0914a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧謝曰：「不敢忘德。」",
        "translation": "Dehui thanked him, saying, \"I dare not forget my virtue.\"",
        "source": "T51n2087_008:0914a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是遂行。",
        "translation": "He then went on his way.",
        "source": "T51n2087_008:0914a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至王宮，謂門者曰：「今有沙門，自遠而至，願王垂許，與摩沓婆論。」",
        "translation": "When he arrived at the king's palace, he said to the monk at the gate, \"Now, there's an ascetic who's come from afar. May the king grant permission to discuss this with Mathurva.\"",
        "source": "T51n2087_008:0914a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞驚曰：「此妄人耳。」",
        "translation": "The king was surprised to hear that, saying, \"This is a false person.\"",
        "source": "T51n2087_008:0914a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即命使臣往摩沓婆所，宣王旨曰：「有異沙門來求談論，今已瑩灑論場，宣告遠近，佇望來儀，願垂降趾。」",
        "translation": "He then ordered his envoy to go to Mathurva and tell him the king's order, \"A different ascetic has come to talk about the topic, and now he has spread out his lecture site, announced its proximity, and asked the king to grant permission for him to come.\"",
        "source": "T51n2087_008:0914a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩沓婆問王使曰：「豈非南印度德慧論師乎？」",
        "translation": "Madhurā asked the king's envoy, \"Could it be the South Indian treatise master Takṣaśī?\"",
        "source": "T51n2087_008:0914a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「然。」",
        "translation": "He said, \"Yes.\"",
        "source": "T51n2087_008:0914a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩沓婆聞，心甚不悅，事難辭免，遂至論場。",
        "translation": "When Madhurā heard this, he was very unhappy at heart, but it was difficult to excuse him, so he went to the discussion site.",
        "source": "T51n2087_008:0914a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國王、大臣、士、庶、豪族，咸皆集會，欲聽高談。",
        "translation": "The king, ministers, scholars, commoners, and powerful people all gathered there, wanting to hear the eloquent discourse.",
        "source": "T51n2087_008:0914a24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧先立宗義，洎乎景落，摩沓婆辭以年衰，智惛捷對，請歸靜思，方酬來難。",
        "translation": "Dehui first established the doctrine, and when Michael Jing fell, Madhupati resigned because he was old and had difficulty in responding to wisdom and asked him to return to meditation before he could respond to the difficulties that had arisen.",
        "source": "T51n2087_008:0914a25_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每事言歸，及旦昇座，竟無異論。",
        "translation": "He said he would return to every matter, and when he ascended to his seat at sunrise, there was no dissenting opinion.",
        "source": "T51n2087_008:0914a26_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至第六日，歐血而死。",
        "translation": "On the sixth day, he bled out and died.",
        "source": "T51n2087_008:0914a27_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其將終也，顧命妻曰：「爾有高才，無忘所恥！」",
        "translation": "When he was about to die, he ordered his wife to say, \"You have great ability; don't forget what you're ashamed of!\"",
        "source": "T51n2087_008:0914a28_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩沓婆死，匿不發喪，更服鮮綺，來至論會。",
        "translation": "When he died, Madhurā didn't give his funeral, but dressed himself in fresh robes and came to the discussion.",
        "source": "T51n2087_008:0914a29_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾咸諠譁，更相謂曰：「摩沓婆自負才高，恥對德慧，故遣婦來，優劣明矣。」",
        "translation": "The crowd was in an uproar, and they all said to each other, \"That Madhūpa thinks he's brilliant and is ashamed to confront Deok-hui, so he sends his wife here, which makes it clear that she's superior and inferior.\"",
        "source": "T51n2087_008:0914b01_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧菩薩謂其妻曰：「能制汝者，我已制之。」",
        "translation": "Dehui addressed his wife, saying, \"I've already restrained those who can restrain you.\"",
        "source": "T51n2087_008:0914b02_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩沓婆妻知難而退。",
        "translation": "Knowing her difficulty, Madhupati's wife withdrew.",
        "source": "T51n2087_008:0914b03_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「何言之密，彼便默然？」",
        "translation": "The king said, \"What was so eloquent about it that she was silent?\"",
        "source": "T51n2087_008:0914b04_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧曰：「惜哉，摩沓婆死矣！",
        "translation": "Dehui said, \"It's a pity that Madhurā is dead!",
        "source": "T51n2087_008:0914b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其妻欲來與我論耳。」",
        "translation": "His wife wanted to come to talk to me about it.\"",
        "source": "T51n2087_008:0914b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「何以知之？",
        "translation": "The king said, \"How do you know that?",
        "source": "T51n2087_008:0914b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願垂指告。」",
        "translation": "Please let us know.\"",
        "source": "T51n2087_008:0914b06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧曰：「其妻之來也，面有死喪之色，言含哀怨之聲，以故知之，沓婆死矣。",
        "translation": "Dehui said, \"When his wife arrived, she had a deathly pallor on her face and a sad, resentful voice, so you know that Dumba is dead.",
        "source": "T51n2087_008:0914b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能制汝者，謂其夫也。」",
        "translation": "That person who can control you is her husband.\"",
        "source": "T51n2087_008:0914b08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王命使往觀，果如所議。",
        "translation": "The king ordered his messenger to go and look at him, and he did as he had said.",
        "source": "T51n2087_008:0914b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王乃謝曰：「佛法玄妙，英賢繼軌，無為守道，含識霑化，依先國典，褒德有常。」",
        "translation": "The king then thanked him, \"The Buddha's teaching is mysterious and marvelous, and the wise men inherited it, did nothing to guard the way, included consciousness in their transformation, and relied on the scriptures of the previous country to praise virtue and constancy.\"",
        "source": "T51n2087_008:0914b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧曰：「苟以愚昧，體道居貞，存正足，論濟物，將弘汲引，先摧傲慢，方便攝化，今其時矣。",
        "translation": "Dehui said, \"If you're foolish enough to stay true to the essence of the way, maintain correct legs, discuss helping people, promote attraction, destroy pride, and skillfully gather in guidance, now is the time to do so.",
        "source": "T51n2087_008:0914b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願大王以摩沓婆邑戶子孫千代常充僧伽藍人，則垂誡來葉，流美無窮。",
        "translation": "May the great king grant that the descendants of the householder at Mathurāśaprāpta for a thousand generations will always be Saṃghârāma people, then he will admonish the leaves of the future and spread beauty without limit.",
        "source": "T51n2087_008:0914b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯彼淨信見匡護者福延于世，食用同僧，以勸清信，以褒厚德。」",
        "translation": "Only those pure believers who see the need to protect them will have their fortune prolonged in the world and will be consumed by the same saṃgha to encourage pure faith and praise their virtue.\"",
        "source": "T51n2087_008:0914b15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是建此伽藍，式旌勝迹。",
        "translation": "So he built this kalāma to honor its achievements.",
        "source": "T51n2087_008:0914b16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，摩沓婆論敗之後，十數淨行逃難隣國，告諸外道恥辱之事，招募英俊，來雪前恥。",
        "translation": "At first, after the defeat of the Mathurva debate, a dozen pure practitioners fled to a neighboring country, told the foreigners about the disgraceful events, and recruited handsome men to come and wipe out their former shame.",
        "source": "T51n2087_008:0914b17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王既珍敬德慧，躬往請曰：「今諸外道不自量力，結黨連群，敢聲論鼓，唯願大師摧諸異道。」",
        "translation": "The king treasured Dehui and went to him personally to ask him, \"Now, those non-Buddhists don't measure up to their own strength, and they've banded together in cliques and dared to shout arguments and drums; may I ask the great master to destroy the non-Buddhists?\"",
        "source": "T51n2087_008:0914b19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧曰：「宜集論者。」",
        "translation": "Dehui said, \"It's advisable to gather commentators.\"",
        "source": "T51n2087_008:0914b21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是外道學人欣然相慰：「我曹今日，勝其必矣。」",
        "translation": "Then the heretics who were learning rejoiced and reassured each other, \"Today, we will surely prevail over them.\"",
        "source": "T51n2087_008:0914b21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸外道闡揚義理，德慧菩薩曰：「今諸外道逃難遠遊，如王先制，皆是賤人，我今如何與彼對論？」",
        "translation": "When those non-Buddhists expounded their doctrine, the Bodhisattva Dehui said, \"Now, these non-Buddhists have fled into difficulty and traveled far away, just like the king's previous regulations, and they're all lowly people; how can I argue with them now?\"",
        "source": "T51n2087_008:0914b22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧有負座竪，素聞餘論，頗閑微旨，侍立於側，聽諸高談。",
        "translation": "Dehui had a seat holder who had heard the rest of the lecture and had quite a bit of subtle understanding, so he stood by his side and listened to the great discourse.",
        "source": "T51n2087_008:0914b25_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧拊其座而言曰：「床，汝可論。」",
        "translation": "Dehui patted his seat and said, \"Bed, you can talk about it.\"",
        "source": "T51n2087_008:0914b26_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾咸驚駭，異其所命。",
        "translation": "The crowd was shocked and disagreed with his order.",
        "source": "T51n2087_008:0914b27_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時負座竪便即發難，深義泉涌，清辯響應。",
        "translation": "The layman then took the chair and immediately raised an objection, which welled up with profound meaning and resonated with clear eloquence.",
        "source": "T51n2087_008:0914b27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三復之後，外道失宗，重挫其銳，再折其翮。",
        "translation": "After three repetitions, the non-Buddhists lost their teaching, and their resolve was severely thwarted and broken again.",
        "source": "T51n2087_008:0914b28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自伏論已來，立為伽藍邑戶。",
        "translation": "Since the Fulun era, he had been established as a monk at Kālāma.",
        "source": "T51n2087_008:0914b29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德慧伽藍西南二十餘里，至孤山，有伽藍，尸羅跋陀羅(唐言戒賢)論師論義得勝，捨邑建焉。",
        "translation": "About twenty miles southwest of Dehui's Kālāma, there's a Kālāma up on Gushan where the Śīlabhadra (Tang term for Śīlabhadra) advocate won victory in his explanation of the doctrine and abandoned his town to build it.",
        "source": "T51n2087_008:0914c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竦一危峯，如窣堵波，置佛舍利。",
        "translation": "It stands on a dangerous peak like a stūpa, where the Buddha's relics are placed.",
        "source": "T51n2087_008:0914c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論師，三摩呾吒國之王族，婆羅門之種也。",
        "translation": "The philosopher was a member of the royal family of Samantabhadra, a Brahmin by birth.",
        "source": "T51n2087_008:0914c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少好學，有風操，遊諸印度，詢求明哲。",
        "translation": "He was a young man of great learning and style who traveled to India and sought out wise teachers.",
        "source": "T51n2087_008:0914c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至此國那爛陀僧伽藍，遇護法菩薩，聞法信悟。",
        "translation": "When he arrived at the monastery in Nālandā, he met a bodhisattva who protected the Dharma and was convinced and enlightened by what he heard.",
        "source": "T51n2087_008:0914c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請服染衣，諮以究竟之致，問以解脫之路，既窮至理，亦究微言，名擅當時，聲高異域。",
        "translation": "He was asked to put on dyed robes, consulted about the ultimate truth, and asked about the path to liberation.",
        "source": "T51n2087_008:0914c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南印度有外道，探賾索隱，窮幽洞微，聞護法高名，起我慢深嫉，不阻山川，擊鼓求論，曰：「我，南印度之人也。",
        "translation": "In South India, there was a non-Buddhist who explored the land of radiotherapy, searched for the hidden, delved into the subtle and the profound, heard about the high reputation of Dharma protection, became deeply jealous of selfishness, and beat the drum to seek a discourse, saying, \"I, too, am a man from South India.",
        "source": "T51n2087_008:0914c09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "承王國內有大論師，我雖不敏，願與詳議。」",
        "translation": "I know there are great masters in my kingdom, but even though I'm not sharp, I'd like to discuss it in detail.\"",
        "source": "T51n2087_008:0914c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「有之，誠如議也。」",
        "translation": "The king said, \"Yes, as you've suggested.\"",
        "source": "T51n2087_008:0914c13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃命使臣請護法曰：「南印度有外道，不遠千里，來求較論，唯願降跡，赴集論場。」",
        "translation": "He then ordered his envoy to invite the Dharma protector, saying, \"There's a non-Buddhist in South India who has traveled thousands of miles to seek a comparison of the treatises, so I'd like to descend upon him and go to the assembly site.\"",
        "source": "T51n2087_008:0914c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護法聞已，攝衣將往。",
        "translation": "After hearing this, the Dharma protector gathered his robe and headed there.",
        "source": "T51n2087_008:0914c15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門人戒賢者，後進之翹楚也，前進請曰：「何遽行乎？」",
        "translation": "A disciple named Xianxian, a leader of latecomers, went forward and asked, \"Why are you going so quickly?\"",
        "source": "T51n2087_008:0914c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護法曰：「自慧日潛暉，傳燈寂照，外道蟻聚，異學蜂飛，故我今者，將摧彼論。」",
        "translation": "The Dharma protector said, \"Since the sun of wisdom has shone brightly and the transmission of the lamp has been silent and illuminating, ants from outside the tradition have gathered, and heretics have flown, so now I will destroy their theories.\"",
        "source": "T51n2087_008:0914c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒賢曰：「恭聞餘論，敢摧異道。」",
        "translation": "Xian said, \"I've heard the rest of the lecture respectfully, and I dare to destroy the heretics.\"",
        "source": "T51n2087_008:0914c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護法知其俊也，因而允焉。",
        "translation": "Knowing how handsome he was, Dharmapālita agreed.",
        "source": "T51n2087_008:0914c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時戒賢年甫三十，眾輕其少，恐難獨任。",
        "translation": "At the time, he was barely thirty years old, and the crowd despised his youth, fearing that it would be difficult for him to take on the job alone.",
        "source": "T51n2087_008:0914c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "護法知眾心之不平，乃解之曰：「有貴高明，無云齒歲，以今觀之，破彼必矣。」",
        "translation": "Knowing the discontent of the crowd, the Dharma protector explained, \"There's noble and brilliant, and there are no clouds of teeth that are years old; if we look at it now, we'll surely refute them.\"",
        "source": "T51n2087_008:0914c21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逮乎集論之日，遠近相趨，少長咸萃。",
        "translation": "It was then that on the day the council gathered its discussions, distant and near converged, and young and old alike gathered together.",
        "source": "T51n2087_008:0914c23_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道弘闡大猷，盡其幽致；戒賢循理責實，深極幽玄。",
        "translation": "The non-Buddhists expounded the great doctrines and exhausted their subtleties, while the Bhagavān followed the principles and criticized the truth, which was profound and extremely mysterious.",
        "source": "T51n2087_008:0914c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外道辭窮，蒙恥而退。",
        "translation": "The non-Buddhists' resignations were exhausted, and they were shamed into retreating.",
        "source": "T51n2087_008:0914c25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王用酬德，封此邑城。",
        "translation": "The king rewarded them for their virtue by granting them the city.",
        "source": "T51n2087_008:0914c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論師辭曰：「染衣之士，事資知足，清淨自守，何以邑為？」",
        "translation": "The philosopher replied, \"Why would a man in dyed robes who knows he has enough to serve and is pure and self-controlled use the euphemism?\"",
        "source": "T51n2087_008:0914c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「法王晦迹，智舟淪湑，不有旌別，無勵後學。",
        "translation": "The king said, \"The king of the Dharma is obscured, the ship of wisdom is strained, and there's no encouragement for those who come after him to make a distinction.",
        "source": "T51n2087_008:0914c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為弘正法，願垂哀納。」",
        "translation": "In order to promote the right teaching, I beg your pardon.\"",
        "source": "T51n2087_008:0914c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論師辭不獲已，受此邑焉，便建伽藍，窮諸規矩，捨其邑戶，式修供養。",
        "translation": "The philosopher refused to accept the offerings, so he built a kalāna, fulfilled all the rules, abandoned his household, and made offerings in style.",
        "source": "T51n2087_008:0914c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒賢伽藍西南行四五十里，渡尼連禪河，至伽耶城。",
        "translation": "Forty or fifty miles southwest of the Śīlabhadra kalāma, he crossed the Nairañjāna River and reached the city of Gayā.",
        "source": "T51n2087_008:0915a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚險固，少居人，唯婆羅門有千餘家，大仙人祚胤也，王所不臣，眾咸宗敬。",
        "translation": "It was very dangerous and rugged, with few inhabitants, except for a thousand houses in Brāhmaṇa, which were owned by a great sage, whom the king didn't serve and whom all people respected.",
        "source": "T51n2087_008:0915a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城北三十餘里，有清泉，印度相傳謂之聖水，凡有飲濯，罪垢消除。",
        "translation": "About 30 miles north of the city, there's a clear spring, which is called holy water according to Indian tradition, and anyone who drinks it will have their sins and defilements removed.",
        "source": "T51n2087_008:0915a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "城西南五六里至伽耶山。",
        "translation": "Five or six miles southwest of the city is Gayā Mountain.",
        "source": "T51n2087_008:0915a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "谿谷杳冥，峯巖危險，印度國俗稱曰靈山，自昔君王馭宇承統，化洽遠人，德隆前代，莫不登封而告成功。",
        "translation": "The valleys are misty and the peaks are dangerous, and it's commonly known in India as Ling Shan. In the past, kings ruled the cosmos and inherited it, teaching people from afar and making virtues known to previous generations, and none of them ascended to the throne and reported success.",
        "source": "T51n2087_008:0915a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山頂上有石窣堵波，高百餘尺，無憂王之所建也，靈鑒潛被，神光時燭，昔如來於此演說《寶雲》等經。",
        "translation": "On the summit of the mountain is a stone stūpa more than a hundred feet high, which was built by King Wuyu. The spiritual mirror is latent, and the divine light candles at times.",
        "source": "T51n2087_008:0915a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽耶山東南有窣堵波，迦葉波本生邑也。",
        "translation": "Southeast of Gayā, there's a stūpa, which is Kāśyapa's native town.",
        "source": "T51n2087_008:0915a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其南有二窣堵波，則伽耶迦葉波、捺地迦葉波(舊曰那提迦葉，訛也。",
        "translation": "To the south of it are two stūpas, Gayā-Kāśyapa and Nadī-Kāśyapa (formerly called Nadī-Kāśyapa, which is also a misnomer.)",
        "source": "T51n2087_008:0915a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "洎諸迦葉，例無波字，略也)事火之處。",
        "translation": "In the case of Michael Kāśyapa, the word \"wave\" is missing, so it's omitted.) That's where they work the fire.",
        "source": "T51n2087_008:0915a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽耶迦葉波事火東，渡大河，至鉢羅笈菩提山(唐言前正覺山，如來將證正覺，先登此山，故云前正覺也)。",
        "translation": "To the east of Gayā-Kāśyapa's work in the fire, he crossed the great river and went to Mount Prāgbodhi (Tang term for the mountain of former right awakening, because the Tathāgata was about to realize right awakening and had first climbed this mountain, so it's called the mountain of former right awakening).",
        "source": "T51n2087_008:0915a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來勤求六歲，未成正覺，後捨苦行，示受乳糜，行自東北，遊目此山，有懷幽寂，欲證正覺。",
        "translation": "After six years of diligent pursuit, the Tathāgata had yet to achieve perfect enlightenment, then he abandoned his ascetic practices, showed himself accepting milk and milk, traveled to the northeast, visited this mountain, had a vision of seclusion, and wanted to realize perfect enlightenment.",
        "source": "T51n2087_008:0915a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自東北岡登以至頂，地既震動，山又傾搖。",
        "translation": "As he ascended from the northeastern heights to the very top, the ground shook and the mountain tilted.",
        "source": "T51n2087_008:0915a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "山神惶懼，告菩薩曰：「此山者，非成正覺之福地也。",
        "translation": "Fearful, the mountain spirit told the bodhisattva, \"This mountain is not a blessed place for realizing right awakening.",
        "source": "T51n2087_008:0915a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若止於此，入金剛定，地當震陷，山亦傾覆。」",
        "translation": "If we stop here and enter the adamantine concentration, the ground will shake and sink, and the mountain will be tilted over.\"",
        "source": "T51n2087_008:0915a22_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩下自西南，山半崖中，背巖面澗，有大石室，菩薩即之，加趺坐焉，地又震動，山復傾搖。",
        "translation": "The bodhisattva went down to the southwest and found a large stone room halfway up the mountain, halfway up the cliff with a rock at its back and a stream at its face.",
        "source": "T51n2087_008:0915a23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時淨居天空中唱曰：「此非如來成正覺處。",
        "translation": "The Pure Land gods then called out from the sky, \"This is not the place where the Tathāgata became perfectly enlightened.",
        "source": "T51n2087_008:0915a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自此西南十四五里，去苦行處不遠，有卑鉢羅樹，下有金剛座，去來諸佛咸於此座而成正覺，願當就彼。」",
        "translation": "Fourteen or fifteen miles southwest of here, not far from the place of asceticism, there's the Peppala tree with the adamantine throne beneath it, where all the buddhas of the past and future have become perfectly enlightened.",
        "source": "T51n2087_008:0915a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩方起，室中龍曰：「斯室清勝，可以證聖，唯願慈悲，勿有遺棄。」",
        "translation": "When the bodhisattva first got up, the dragon in the room said, \"This room is so clear and beautiful that it's possible to realize saints; please have mercy and don't abandon it.\"",
        "source": "T51n2087_008:0915a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩既知非取證所，為遂龍意，留影而去(影在昔日，賢愚咸覩：洎於今時，或有得見)。",
        "translation": "Knowing that it wasn't the right place to realize, the bodhisattva left his shadow behind to suit the dragon's wishes (in the past, the shadows were visible to both wise and foolish people; in the present, some may see them).",
        "source": "T51n2087_008:0915b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天前導，往菩提樹。",
        "translation": "The gods led him to the bodhi tree.",
        "source": "T51n2087_008:0915b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "逮乎無憂王之興也，菩薩登山上下之迹，皆樹旌表，建窣堵波，度量雖殊，靈應莫異，或天花雨空中，或光照幽谷。",
        "translation": "When King Wuzu was raised, the traces of the bodhisattva's ascents and descents were marked by banners and stūpas, and although their measures were different, their spiritual responses were not, and sometimes the sky rained down from the ceiling or the light shone in a dark valley.",
        "source": "T51n2087_008:0915b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每歲罷安居日，異方法俗，登修供養，信宿乃還。",
        "translation": "Every year, on the day after the retreat, people from different backgrounds make offerings to the buddhas, and faithful residents return.",
        "source": "T51n2087_008:0915b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前正覺山西南行十四五里，至菩提樹。",
        "translation": "The former Zhengjue Shanshan traveled 14 or 15 miles southwest to the Bodhi Tree.",
        "source": "T51n2087_008:0915b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "周垣壘甎，崇峻險固。",
        "translation": "The surrounding walls and palisades are high, steep, and solid.",
        "source": "T51n2087_008:0915b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東西長，南北狹，周五百餘步。",
        "translation": "It's long from east to west and narrow from north to south, with a circumference of more than 500 paces.",
        "source": "T51n2087_008:0915b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奇樹名花，連陰接影；細沙異草，彌漫綠被。",
        "translation": "Wonderful trees and famous flowers link the shadows; fine sand and strange grasses fill the greenery.",
        "source": "T51n2087_008:0915b09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正門東闢，對尼連禪河，南門接大花池，西阨險固，北門通大伽藍。",
        "translation": "The main gate is set out to the east, facing the Nairañjanā River, the south gate connects to the Great Flower Pond, the west perfumes the fortress, and the north gate leads to the Great Kālāma.",
        "source": "T51n2087_008:0915b10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壖垣內地，聖迹相隣，或窣堵波，或復精舍，並贍部洲諸國君王、大臣、豪族欽承遺教，建以記焉。",
        "translation": "On the inside of the waterfront, there are sacred sites close to each other, including a stūpa and another shrine, and the legacy of the kings, ministers, and powerful families of the Jambudvīpa countries who have inherited the temple and built it for their records.",
        "source": "T51n2087_008:0915b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣正中，有金剛座。",
        "translation": "In the middle of the wall of the bodhi tree is the adamantine throne.",
        "source": "T51n2087_008:0915b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔賢劫初成，與大地俱起，據三千大千世界中，下極金輪，上侵地際，金剛所成，周百餘步，賢劫千佛坐之而入金剛定，故曰金剛座焉。",
        "translation": "In the past, when the Bhadrayāna Kālāmas were first formed, it rose up with the great earth and was situated in the middle of a world of 3,000 great one-thousand worlds, with its lower limit a golden wheel and its upper limit encroaching on the earth, and it was made of adamant, with a circumference of more than a hundred paces, and a thousand buddhas of the Bhadrayāna Kālāmas sat on it and entered adamantine concentration, so it was called the adamantine throne.",
        "source": "T51n2087_008:0915b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "證聖道所，亦曰道場，大地震動，獨無傾搖。",
        "translation": "It's also called the site of the path to realize holiness, and it's alone, unshaken, when a great earthquake shakes it.",
        "source": "T51n2087_008:0915b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故如來將證正覺也，歷此四隅，地皆傾動，後至此處，安靜不傾。",
        "translation": "Therefore, when the Tathāgata was about to realize perfect enlightenment, he would pass through these four corners, where the ground would tilt, and then he would arrive at this place and it would be peaceful and not tilted.",
        "source": "T51n2087_008:0915b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自入末劫，正法浸微，沙土彌覆，無復得見。",
        "translation": "Since the end of the eon, the true teaching has been so attenuated that it's covered by sand and dirt, and there's no longer any way to see it.",
        "source": "T51n2087_008:0915b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛涅槃後，諸國君王傳聞佛說金剛座量，遂以兩軀觀自在菩薩像，南北標界，東面而坐。",
        "translation": "After the Buddha's nirvāṇa, the rulers of various countries heard that the Buddha taught the amount of the adamantine seat, so they took two images of the Bodhisattva Avalokitêśvara, marked the north and south boundaries, and sat down facing east.",
        "source": "T51n2087_008:0915b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞諸耆舊曰：「此菩薩像身沒不見，佛法當盡。」",
        "translation": "They heard from some elders, \"When this bodhisattva image's body disappears, the Buddha's teaching will surely come to an end.\"",
        "source": "T51n2087_008:0915b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今南隅菩薩沒過胸臆矣。",
        "translation": "Now, the bodhisattva at the south corner has disappeared beyond his chest.",
        "source": "T51n2087_008:0915b25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛座上菩提樹者，即畢鉢羅之樹也。",
        "translation": "The bodhi tree on the adamantine throne is also known as the pippala tree.",
        "source": "T51n2087_008:0915b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔佛在世，高數百尺，屢經殘伐，猶高四五丈。",
        "translation": "In the past, when the Buddha was alive, it was hundreds of feet tall, and after being cut down repeatedly, it's still four or five feet tall.",
        "source": "T51n2087_008:0915b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛坐其下成等正覺，因而謂之菩提樹焉。",
        "translation": "The Buddha sat under it and became perfectly enlightened, which is why it's called the bodhi tree.",
        "source": "T51n2087_008:0915b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莖幹黃白，枝葉青翠，冬夏不凋，光鮮無變。",
        "translation": "Its stem is yellow and white, its branches and leaves are verdant, and it doesn't wither in winter or summer; its appearance is fresh and unchanging.",
        "source": "T51n2087_008:0915c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每至如來涅槃之日，葉皆凋落，頃之復故。",
        "translation": "Every day on the day of the Tathāgata's nirvāṇa, the leaves wither away, and in a short while they remain the same.",
        "source": "T51n2087_008:0915c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是日也，諸國君王，異方法俗，數千萬眾，不召而集，香水香乳，以溉以洗，於是奏音樂，列香花，燈炬繼日，競修供養。",
        "translation": "On that day, rulers of different countries, worldlings, and tens of millions of people gather without being summoned, perfume, scent, and milk are used to wash the place, and music is played, flowers are arranged, and lamps and torches follow the sun, competing for offerings.",
        "source": "T51n2087_008:0915c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來寂滅之後，無憂王之初嗣位也，信受邪道，毀佛遺迹，興發兵徒，躬臨剪伐。",
        "translation": "After the Tathāgata's death, when King Wuzu first assumed the throne, he believed in the mistaken way, disparaged the Buddha's legacy, and mobilized his troops to cut it down.",
        "source": "T51n2087_008:0915c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "根莖枝葉，分寸斬截，次西數十步而積聚焉，令事火婆羅門燒以祠天，煙焰未靜，忽生兩樹，猛火之中，茂葉含翠，因而謂之灰菩提樹。",
        "translation": "Their roots, stems, branches, and leaves were cut off inch by inch, and they were gathered together dozens of steps to the west and made to serve as a fire-worshipping Brahman to burn as a sacrifice to the gods. Before the smoke and flames quieted, two trees suddenly sprouted up, and in the midst of the fierce fire, their leaves were lush and emerald, which was called the ash-bodhi tree.",
        "source": "T51n2087_008:0915c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王覩異悔過，以香乳溉餘根，洎乎將旦，樹生如本。",
        "translation": "The king of Wuzu saw how different they were and repented, so he watered the remaining roots with incense and milk until sunrise, when the trees grew as before.",
        "source": "T51n2087_008:0915c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王見靈怪，重深欣慶，躬修供養，樂以忘歸。",
        "translation": "The king was deeply delighted at the sight of the spirits and monsters, so he made offerings and was happy to forget about it.",
        "source": "T51n2087_008:0915c12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王妃素信外道，密遣使人，夜分之後，重伐其樹。",
        "translation": "The king's consort, who had long believed in non-Buddhism, secretly sent an envoy to cut down the tree again after the evening divide.",
        "source": "T51n2087_008:0915c13_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無憂王旦將禮敬，唯見櫱株，深增悲慨，至誠祈請，香乳溉灌，不日還生。",
        "translation": "When King Wuzu was about to pay his respects, he saw only a small plant and was deeply saddened.",
        "source": "T51n2087_008:0915c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王深敬異，壘石周垣，其高十餘尺，今猶見在。",
        "translation": "The king was so impressed that he built a stone wall around it, and it's more than ten feet tall, and it's still there today.",
        "source": "T51n2087_008:0915c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "近設賞迦王者，信受外道，毀嫉佛法，壞僧伽藍，伐菩提樹，掘至泉水，不盡根柢，乃縱火焚燒，以甘蔗汁沃之，欲其燋爛，絕滅遺萌。",
        "translation": "Recently, King Suppose Xānaka, a devout non-Buddhist, became jealous of the Buddha's teachings, destroyed the Saṃghârāma, cut down the bodhi tree, dug it up to the spring, and didn't finish the roots; he set it on fire, burned it, and watered it with sugarcane juice to scorch it and eliminate its sprouts.",
        "source": "T51n2087_008:0915c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "數月後，摩揭陀國補剌拏伐摩王(唐言滿胄)，無憂王之末孫也，聞而歎曰：「慧日已隱，唯餘佛樹，今復摧殘，生靈何覩！」",
        "translation": "A few months later, King Pūraṇavarman (Manchu in Tang) of Magadha, the last grandchild of King Wuzu, heard about it and lamented, \"The sun of wisdom has been hidden, and the only thing left is the bodhi tree; now that it's been destroyed, what will the living souls see?\"",
        "source": "T51n2087_008:0915c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉身投地，哀感動物。",
        "translation": "He threw himself to the ground and felt compassion for the animals.",
        "source": "T51n2087_008:0915c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以數千牛搆乳而溉，經夜樹生，其高丈餘。",
        "translation": "He watered it with the milk of thousands of cows, and after a long night the tree grew more than ten feet tall.",
        "source": "T51n2087_008:0915c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐後剪伐，周峙石垣，高二丈四尺。",
        "translation": "Lest it be cut down later, it was surrounded by a stone wall that was two feet by four feet high.",
        "source": "T51n2087_008:0915c24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故今菩提樹隱於石壁，出一丈餘。",
        "translation": "Therefore, the present-day Bodhi tree is hidden by a stone wall that rises more than a zhang out.",
        "source": "T51n2087_008:0915c25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹東有精舍，高百六七十尺，下基面廣二十餘步，壘以青甎，塗以石灰，層龕皆有金像，四壁鏤作奇製，或連珠形，或天仙像，上置金銅阿摩落迦果(亦謂寶瓶，又稱寶臺)。",
        "translation": "To the east of the bodhi tree was a fine hall, 160 or 70 feet high, with a base area some 20 paces wide, bedded in blue tile and coated with lime, with gold statues on each floor and four walls chased with exotic designs, either in the shape of a string of beads or images of celestials, on which were placed gold and bronze amalākā fruits (also called jeweled vases and also known as jeweled platforms).",
        "source": "T51n2087_008:0915c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東面接為重閣，檐宇特起三層，榱柱棟梁，戶扉寮牖，金銀彫鏤以飾之，珠玉廁錯以填之，奧室邃宇，洞戶三重。",
        "translation": "The east side is connected to a double-storied pavilion with a special three-story eave, rafters, pillars, beams, doors, and windows, decorated with gold and silver sculptures, filled with pearls and jade toilets, and a triple cave of profound rooms and windows.",
        "source": "T51n2087_008:0915c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外門左右各有龕室，左則觀自在菩薩像，右則慈氏菩薩像，白銀鑄成，高十餘尺。",
        "translation": "On the left is an image of the Bodhisattva Avalokitêśvara, and on the right is an image of the Bodhisattva Maitreya, cast in white silver and more than ten feet high.",
        "source": "T51n2087_008:0916a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精舍故地，無憂王先建小精舍，後有婆羅門更廣建焉。",
        "translation": "At the site of the former monastery, King Wuzu first built a small monastery, but then a brāhmaṇa gate was built further away.",
        "source": "T51n2087_008:0916a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，有婆羅門，不信佛法，事大自在天，傳聞天神在雪山中，遂與其弟往求願焉。",
        "translation": "At first, there was a Brāhmaṇa who didn't believe in the Buddha's teachings and worked for the Mahêśvara Heaven. He heard that the god of the gods was in the snowy mountains, so he and his disciples went there to ask for a vow.",
        "source": "T51n2087_008:0916a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天曰：「凡諸願求，有福方果。",
        "translation": "The god said, \"Whenever you ask for something, it will only come true if there's merit.",
        "source": "T51n2087_008:0916a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非汝所祈，非我能遂。」",
        "translation": "It's not for you to pray, and it's not for me to grant it.\"",
        "source": "T51n2087_008:0916a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門曰：「修何福可以遂心？」",
        "translation": "The Brāhmaṇa said, \"What merit can I cultivate to fulfill my wish?\"",
        "source": "T51n2087_008:0916a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天曰：「欲植善種，求勝福田，菩提樹者，證佛果處也。",
        "translation": "The gods said, \"If you want to plant good seeds and pursue a superior field of merit, the bodhi tree is the place where you'll realize the Buddha's fruit.",
        "source": "T51n2087_008:0916a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜時速反，往菩提樹，建大精舍，穿大水池，興諸供養，所願當遂。」",
        "translation": "It's time to quickly turn around, go to the bodhi tree, build a large monastery, put in a large pond, and make offerings; your wishes will be fulfilled.\"",
        "source": "T51n2087_008:0916a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婆羅門受天命，發大信心，相率而返，兄建精舍，弟鑿水池，於是廣修供養，勤求心願，後皆果遂，為王大臣，凡得祿賞，皆入檀捨。",
        "translation": "Accepting the order from Heaven, the Brāhmaṇas had great faith and returned together in groups, with their brother building a monastery and their brother digging a pond.",
        "source": "T51n2087_008:0916a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精舍既成，招募工人，欲圖如來初成佛像。",
        "translation": "After the completion of the monastery, workers were recruited to create the first image of the Tathāgata as a Buddha.",
        "source": "T51n2087_008:0916a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曠以歲月，無人應召。",
        "translation": "After years of inactivity, no one answered the call.",
        "source": "T51n2087_008:0916a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "久之，有婆羅門來告眾曰：「我善圖寫如來妙相。」",
        "translation": "After a long time, a Brāhmaṇa came to the crowd and told them, \"I'm good at drawing the Tathāgata's marvelous features.\"",
        "source": "T51n2087_008:0916a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾曰：「今將造像，夫何所須？」",
        "translation": "The crowd said, \"Now that I'm about to make an image, what do I need?\"",
        "source": "T51n2087_008:0916a18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「香泥耳。",
        "translation": "He said, \"It's a scented mud.",
        "source": "T51n2087_008:0916a19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜置精舍之中，并一燈照，我入已，堅閉其戶，六月後乃可開門。」",
        "translation": "It would be better to put it in a monastery with a lamp shining in it; after I enter, I'll firmly close the door, and you can open it only after six months.\"",
        "source": "T51n2087_008:0916a19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸僧眾皆如其命。",
        "translation": "The saṃgha then all did as he instructed.",
        "source": "T51n2087_008:0916a21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尚餘四日，未滿六月，眾咸駭異，開以觀之。",
        "translation": "With four days left and less than six months completed, the crowd was startled and surprised, so they opened the door and looked around.",
        "source": "T51n2087_008:0916a21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見精舍內佛像儼然，結加趺坐，右足居上，左手斂，右手垂，東面而坐，肅然如在。",
        "translation": "They saw a statue of the Buddha sitting cross-legged inside the monastery, with his right foot on top, his left hand averted, and his right hand hanging down as he sat facing east, as solemn as if he were there.",
        "source": "T51n2087_008:0916a22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "座高四尺二寸，廣丈二尺五寸，像高丈一尺五寸，兩膝相去八尺八寸，兩肩六尺二寸，相好具足，慈顏若真，唯右乳上圖瑩未周。",
        "translation": "The seat was 4 feet 2 inches high, 2 feet 5 inches wide, the statue was 1 foot 5 inches high, his knees were 8 feet 8 inches apart, and his shoulders were 6 feet 2 inches apart.",
        "source": "T51n2087_008:0916a24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既不見人，方驗神鑒，眾咸悲歎，慇懃請知。",
        "translation": "Since he hadn't seen anyone, he was examined by a spiritual examiner, and the crowd was saddened and asked to know more about him.",
        "source": "T51n2087_008:0916a27_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有一沙門，宿心淳質，乃感夢見往婆羅門而告曰：「我是慈氏菩薩，恐工人之思不測聖容，故我躬來圖寫佛像。",
        "translation": "An ascetic with a simple, long-standing mind told the monk in a dream, \"I'm Maitreya, the bodhisattva, and I'm afraid workers' thoughts won't reveal the noble features, so I've come to draw a picture of the Buddha.",
        "source": "T51n2087_008:0916a28_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "垂右手者，昔如來之將證佛果，天魔來嬈，地神告至，其一先出，助佛降魔，如來告曰：『汝勿憂怖，吾以忍力，降彼必矣。』",
        "translation": "The Tathāgata on his right hand was about to realize the Buddhahood when a demon from heaven came to haunt him and the earth spirit told him that one of them had gone before him to help the Buddha subdue the demon, and the Tathāgata told him, 'Don't be worried and afraid, for with the power of patience I can surely subdue them.'",
        "source": "T51n2087_008:0916b01_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王曰：『誰為明證？』",
        "translation": "The demon king said, 'Who will be the one to clearly witness this?'",
        "source": "T51n2087_008:0916b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來乃垂手指地，言：『此有證。』",
        "translation": "The Tathāgata then pointed his hand down to the ground and said, 'This has realization.'",
        "source": "T51n2087_008:0916b05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時第二地神踊出作證，故今像手倣昔下垂。」",
        "translation": "The second spirit of the ground then rises up and testifies, so now the image hangs down like it used to.\"",
        "source": "T51n2087_008:0916b05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾知靈鑒，莫不悲感。",
        "translation": "Everyone who knew the Tathāgata's spiritual vision was moved with compassion.",
        "source": "T51n2087_008:0916b06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是乳上未周，填廁眾寶，珠瓔寶冠，奇珍交飾。",
        "translation": "Then, before the breasts were covered, they filled a latrine with a multitude of treasures, beads, and jewelry, and crowns of rare treasures.",
        "source": "T51n2087_008:0916b07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設賞迦王伐菩提樹已，欲毀此像，既覩慈顏，心不安忍，迴駕將返，命宰臣曰：「宜除此佛像，置大自在天形。」",
        "translation": "Suppose King Śākyamuni had cut down the bodhi tree and wanted to destroy the image. After seeing his compassionate face, he was uncomfortable in his mind and ordered his ministers to return, saying, \"It would be better to remove this image of the Buddha and place it in the form of a great self-perfecting god.\"",
        "source": "T51n2087_008:0916b08_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宰臣受旨，懼而歎曰：「毀佛像則歷劫招殃，違王命乃喪身滅族，進退若此，何所宜行！」",
        "translation": "When the minister accepted the order, he was afraid and praised, \"Destroying the Buddha image would bring disaster through the eons, and disobeying the king's order would mean losing one's body and family.",
        "source": "T51n2087_008:0916b11_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃召信心以為役使，遂於像前橫壘甎壁，心慚冥闇，又置明燈，甎壁之前畫自在天。",
        "translation": "He summoned faith to be his servant, so he placed a wall across the front of the image, consciously placed a bright lamp in the dark, and painted the Śivaites before the wall.",
        "source": "T51n2087_008:0916b13_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "功成報命，王聞心懼，舉身生皰，肌膚攫裂，居未久之，便喪沒矣。",
        "translation": "When he had accomplished his mission, the king was terrified when he heard about it, and his body became blistered and his skin was torn.",
        "source": "T51n2087_008:0916b15_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宰臣馳返，毀除障壁，時經多日，燈猶不滅。",
        "translation": "The prime minister rushed back and destroyed the barricaded wall, but after many days, the lamp remained in place.",
        "source": "T51n2087_008:0916b16_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "像今尚在，神工不虧。",
        "translation": "The image is still there, and the spiritual work isn't lost.",
        "source": "T51n2087_008:0916b17_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既處奧室，燈炬相繼，欲覩慈顏，莫由審察，必於晨朝持大明鏡，引光內照，乃覩靈相。",
        "translation": "Now that they're in the mysterious room, the lamps and torches continue, and there's no way to examine their faces in order to see them, so they must hold a large mirror in the morning and direct its light to shine inside before they can see their spiritual features.",
        "source": "T51n2087_008:0916b18_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫有見者，自增悲感。",
        "translation": "Anyone who sees it will have a heightened sense of compassion for it.",
        "source": "T51n2087_008:0916b20_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來以印度吠舍佉月後半八日成等正覺，當此三月八日也。",
        "translation": "The Tathāgata used the eighth day of the second half of the Indian month of Vaiśākha to become perfectly enlightened, which would be the eighth day of March.",
        "source": "T51n2087_008:0916b20_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上座部則吠舍佉月後半十五日成等正覺，當此三月十五日也。",
        "translation": "For the Theravada school, he became perfectly enlightened on the fifteenth day of the second half of the month of Vaiśākha, which would have been the fifteenth day of March.",
        "source": "T51n2087_008:0916b22_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時如來年三十矣。",
        "translation": "At that point, the Tathāgata was thirty years old.",
        "source": "T51n2087_008:0916b23_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或曰年三十五矣。",
        "translation": "Some say he was thirty-five years old.",
        "source": "T51n2087_008:0916b24_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹北有佛經行之處。",
        "translation": "To the north of the bodhi tree is where the Buddha's sūtras are practiced.",
        "source": "T51n2087_008:0916b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來成正覺已，不起于座，七日寂定。",
        "translation": "After the Tathāgata became perfectly enlightened, he didn't rise from his seat and remained calm and concentrated for seven days.",
        "source": "T51n2087_008:0916b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其起也，至菩提樹北，七日經行，東西往來，行十餘步，異華隨迹十有八文。",
        "translation": "When he rose, he went to the north of the Bodhi tree and spent seven days sūtra-walking, going back and forth east and west for more than ten steps, following the traces of the different flowers for ten or eight letters.",
        "source": "T51n2087_008:0916b26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後人於此壘甎為基，高餘三尺。",
        "translation": "Later, someone built a stone foundation here, which was more than three feet high.",
        "source": "T51n2087_008:0916b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞諸先志曰：此聖迹基，表人命之脩短也，先發誠願，後乃度量，隨壽脩短，數有增減。",
        "translation": "I heard from some of our ancestors that this foundation of sacred traces indicates the length of a person's life, which is measured after they first make a sincere vow, and that the number increases or decreases depending on the length of life.",
        "source": "T51n2087_008:0916b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經行基北，道右，盤石上，大精舍中，有佛像，舉目上望。",
        "translation": "To the north of the base of the sūtra, to the right of the road, on a large rock, in a large monastery, there's an image of the Buddha, and I raise my eyes to look up.",
        "source": "T51n2087_008:0916c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔者，如來於此七日觀菩提樹，目不暫捨。",
        "translation": "In the past, the Tathāgata looked at the bodhi tree for seven days here, and his eyes didn't let go for a moment.",
        "source": "T51n2087_008:0916c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為報樹恩，故此瞻望。",
        "translation": "That's why he looked up because he wanted to repay the tree's kindness.",
        "source": "T51n2087_008:0916c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹西不遠，大精舍中，有鍮石佛像，飾以奇珍，東面而立。",
        "translation": "Not far to the west of the bodhi tree, in a large monastery, there's a statue of a buddha made of copper and adorned with exquisite jewels, standing to the east.",
        "source": "T51n2087_008:0916c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前有青石，奇文異采，是昔如來初成正覺，梵王起七寶堂，帝釋建七寶座，佛於其上七日思惟，放異光明，照菩提樹。",
        "translation": "In front of it is a lapis lazuli stone with a strange and colorful design from a time when the Tathāgata first became perfectly enlightened and King Brahmā built a hall of seven treasures and Tissa built a throne of seven treasures on which the Buddha spent seven days in deliberation and emitted a different kind of light that shone brightly on the bodhi tree.",
        "source": "T51n2087_008:0916c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去聖悠遠，寶變為石。",
        "translation": "It was a long way from the sage, and the treasure was transformed into stone.",
        "source": "T51n2087_008:0916c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹南不遠，有窣堵波，高百餘尺，無憂王之所建也。",
        "translation": "Not far south of the bodhi tree was a stūpa more than a hundred feet high that King Aśoka had built.",
        "source": "T51n2087_008:0916c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩既濯尼連河，將趣菩提樹，竊自思念何以為座？",
        "translation": "After washing the Nairañjanā River, the bodhisattva was about to head for the bodhi tree, but he secretly thought, \"What would be the seat?",
        "source": "T51n2087_008:0916c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋自發明當須淨草。",
        "translation": "\"He searches for his own inventions, which will require pure grass.",
        "source": "T51n2087_008:0916c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天帝釋化其身為刈草人，荷而逐路。",
        "translation": "Tendai transformed himself into a weed mower, carrying the load and following the road.",
        "source": "T51n2087_008:0916c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩謂曰：「所荷之草頗能惠耶？」",
        "translation": "The bodhisattva said, \"Would the grass he's carrying be helpful?\"",
        "source": "T51n2087_008:0916c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化人聞命，恭以草奉，菩薩受已，執而前進。",
        "translation": "After the transformation monk heard the order, he respectfully offered the grass, and the bodhisattva accepted it and carried it forward.",
        "source": "T51n2087_008:0916c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受草東北不遠，有窣堵波，是菩薩將證佛果，青雀、群鹿呈祥之處。",
        "translation": "Not far to the northeast of where he accepted the grass, there was a stūpa where the bodhisattva was about to realize the Buddhahood and where blue deer and herd deer would present their good fortune.",
        "source": "T51n2087_008:0916c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "印度休徵，斯為嘉應，故淨居天隨順世間，群從飛繞，効靈顯聖。",
        "translation": "This is a commendable response from India, so the Pure Land gods follow the world and fly around in droves to serve their spirits and reveal their sages.",
        "source": "T51n2087_008:0916c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹東，大路左右，各一窣堵波，是魔王嬈菩薩處也。",
        "translation": "To the east of the bodhi tree, there's a stūpa to the left and right of the main road, which is where Māra King will disturb the bodhisattvas.",
        "source": "T51n2087_008:0916c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩將證佛果，魔王勸受輪王，策說不行，殷憂而返。",
        "translation": "When the bodhisattva was about to realize the Buddhahood, the Māra King persuaded the wheel-turning king to accept him, but his advice didn't work, so he returned with great anxiety.",
        "source": "T51n2087_008:0916c21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔王之女請往誘焉，菩薩威神，衰變冶容，扶羸策杖，相携而退。",
        "translation": "When the demon king's daughter invited him to go and entice her, the bodhisattva's dignified demeanor changed, and he helped her to withdraw with his weak stick.",
        "source": "T51n2087_008:0916c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹西北，精舍中，有迦葉波佛像，既稱靈聖，時燭光明。",
        "translation": "In the monastery to the northwest of the bodhi tree was an image of Kāśyapa Buddha, who was known as a spiritual sage and whose candle lit up at times.",
        "source": "T51n2087_008:0916c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞諸先記曰：若人至誠，旋繞七周，在所生處，得宿命智。",
        "translation": "He heard the predecessors' records say, \"If a person is sincere and circles around seven times, he'll attain knowledge of past lives where he's born.",
        "source": "T51n2087_008:0916c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉波佛精舍西北二甎室，各有地神之像。",
        "translation": "In the two upper rooms to the northwest of Kāśyapa Buddha's abode, there are images of earth spirits.",
        "source": "T51n2087_008:0916c28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔者如來將成正覺，一報魔至，一為佛證。",
        "translation": "In the past, when the Tathāgata was about to become perfectly enlightened, one was rewarded by the arrival of Māra, and the other was realized by the Buddha.",
        "source": "T51n2087_008:0916c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後人念功，圖形旌德。",
        "translation": "Later generations remembered the merit of the images and showed their virtue.",
        "source": "T51n2087_008:0917a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣西不遠，有窣堵波，謂欝金香，高四十餘尺，漕炬吒國商主之所建也。",
        "translation": "Not far west of the wall of the bodhi tree is a stūpa, called a golden incense stick, which is more than 40 feet high and was built by the merchant lord of Caolóngcha.",
        "source": "T51n2087_008:0917a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔漕炬吒國有大商主，宗事天神，祠求福利，輕蔑佛法，不信因果。",
        "translation": "In the past, there was a great merchant lord in Caolōṭa who served the gods, worshipped for welfare, despised the Buddha's teachings, and didn't believe in cause and effect.",
        "source": "T51n2087_008:0917a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後將諸商侶，貿遷有無，泛舟南海，遭風失路，波濤飄浪，時經三歲，資糧罄竭，糊口不充。",
        "translation": "Later, he sent his merchant companions on a voyage through the South China Sea, where they lost their way in the wind and were buffeted by waves.",
        "source": "T51n2087_008:0917a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同舟之人，朝不謀夕，勠力同志，念所事天，心慮已勞，冥功不濟。",
        "translation": "The people in the same boat were working hard as comrades, but they were mindful of the gods they were serving, and their thoughts were already labored, so their efforts were not helpful.",
        "source": "T51n2087_008:0917a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俄見大山，崇崖峻嶺，兩日聯暉，重明照朗。",
        "translation": "Then we saw a great mountain, a high cliff and a steep mountain, and the two suns were shining brightly together.",
        "source": "T51n2087_008:0917a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸商侶更相慰曰：「我曹有福，過此大山，宜於中止，得安樂。」",
        "translation": "The merchant companions then reassured each other, \"We are fortunate, Cao, to have passed over this great mountain; it's time to stop and attain peace and happiness.\"",
        "source": "T51n2087_008:0917a10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主曰：「非山也，乃摩竭魚耳。",
        "translation": "The merchant owner said, \"It's not a mountain, it's a makara fish.",
        "source": "T51n2087_008:0917a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "崇崖峻嶺，鬚鬣也；兩日聯暉，眼光也。」",
        "translation": "The high cliffs and steep mountains are like bearded ferns, and the two suns are like the gaze of the eyes.\"",
        "source": "T51n2087_008:0917a12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言聲未靜，舟帆飄湊。",
        "translation": "Before the sound of his words was quelled, the sails of the boat were sailing along.",
        "source": "T51n2087_008:0917a13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是商主告諸侶曰：「我聞觀自在菩薩於諸危厄能施安樂，宜各至誠，稱其名字。」",
        "translation": "The merchant then addressed his companions, \"I've heard that the Bodhisattva Avalokitêśvara can give comfort and happiness in times of trouble and distress, so it's appropriate for each of you to sincerely invoke his name.\"",
        "source": "T51n2087_008:0917a13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂即同聲，歸命稱念。",
        "translation": "They then all said the same thing and gave their assent and called on him.",
        "source": "T51n2087_008:0917a15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "崇山既隱，兩日亦沒。",
        "translation": "After the lofty mountain retreated, it disappeared in a couple of days.",
        "source": "T51n2087_008:0917a16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俄見沙門，威儀庠序，杖錫凌虛，而來拯溺，不踰時而至本國矣。",
        "translation": "Then he saw a monk with an elegant and dignified demeanor, a staff and a stick, who came to save him from drowning and arrived at his home country not more than a few days later.",
        "source": "T51n2087_008:0917a16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因即信心貞固，求福不回，建窣堵波，式修供養，以欝金香泥而周塗上下。",
        "translation": "He then had faith and determination, sought merit and didn't turn back, built a stūpa, made offerings in the usual way, and smeared the ground with gold scented clay.",
        "source": "T51n2087_008:0917a18_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既發信心，率其同志，躬禮聖迹，觀菩提樹。",
        "translation": "Once his faith was aroused, he led his comrades to pay homage to the holy sites and contemplate the bodhi tree.",
        "source": "T51n2087_008:0917a20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未暇言歸，已淹晦朔。",
        "translation": "Before he could say he was returning, it was already late in the afternoon and early evening.",
        "source": "T51n2087_008:0917a21_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商侶同遊，更相謂曰：「山川悠間，鄉國遼遠，昔所建立窣堵波者，我曹在此，誰其灑掃？」",
        "translation": "When the merchants traveled together, they also said, \"The mountains and rivers are vast, and our country is far away; who would clean up after us here, Tso?\"",
        "source": "T51n2087_008:0917a21_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言訖，旋繞至此，忽見窣堵波，駭其由致，即前瞻察，乃本國所建窣堵波也。",
        "translation": "After he finished speaking, he circled around and suddenly saw a stūpa. He was shocked at its origin and looked ahead to examine it.",
        "source": "T51n2087_008:0917a23_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故今印度因以欝金為名。",
        "translation": "That's why it's called Ujjain in modern India.",
        "source": "T51n2087_008:0917a25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣東南隅，尼拘律樹側，窣堵波傍有精舍，中作佛坐像。",
        "translation": "On the southeast corner of the Bodhidharma wall, next to the nyagrodha tree, there's a monastery near the stūpa where a sitting image of the Buddha is made.",
        "source": "T51n2087_008:0917a26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔如來初證佛果，大梵天王於此勸請轉妙法輪。",
        "translation": "In the past, when the Tathāgata first realized Buddhahood, the king of the Brahmā gods came here to encourage him to turn the wonderful wheel of the Dharma.",
        "source": "T51n2087_008:0917a27_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣內，四隅皆有大窣堵波。",
        "translation": "Inside the wall of the bodhi tree, there are large stūpas on each corner.",
        "source": "T51n2087_008:0917a28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在昔如來受吉祥草已，趣菩提樹，先歷四隅，大地震動，至金剛座，方得安靜。",
        "translation": "In the past, after accepting the auspicious grass, the Tathāgata went to the bodhi tree, first passing through the four corners, which were greatly shaken, and then he reached the vajra throne and attained peace.",
        "source": "T51n2087_008:0917a29_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "樹垣之內，聖迹鱗次，差難遍舉。",
        "translation": "Inside the wall of the tree, the traces of the sages were scattered in such a close proximity that it was difficult to enumerate them.",
        "source": "T51n2087_008:0917b02_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣外，西南窣堵波，奉乳糜二牧女故宅。",
        "translation": "Outside the wall of the bodhi tree, there's a southwestern stūpa that serves as the former residence of two shepherdesses of milk.",
        "source": "T51n2087_008:0917b03_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側窣堵波，牧女於此煮糜。",
        "translation": "There's a stūpa on the side where the cowherd girls cook milk.",
        "source": "T51n2087_008:0917b04_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次此窣堵波，如來受糜處也。",
        "translation": "Next, this stūpa is where the Tathāgata receives the milk.",
        "source": "T51n2087_008:0917b04_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣南門外有大池，周七百餘步，清瀾澄鏡，龍魚潛宅，婆羅門兄弟承大自在天命之所鑿也。",
        "translation": "Outside the south gate of the Bodhidharma wall is a large pond, more than 700 paces in circumference, with a clear, crisp water and a clear mirror, where dragons and fish dive into, and where the Brahman brothers were hewn by the order of the Mahêśvara gods.",
        "source": "T51n2087_008:0917b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次南一池，在昔如來初成正覺，方欲浣濯，天帝釋為佛化成池。",
        "translation": "The next south a pond, in the past the Tathāgata first became perfectly enlightened, before wanting to wash, the gods Indra for the Buddha transformed into a pond.",
        "source": "T51n2087_008:0917b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西有大石，佛浣衣已，方欲曝曬，天帝釋自大雪山持來也。",
        "translation": "In the west, there is a large stone, the Buddha was washing his clothes, before wanting to expose them to the sun, the gods Indra from the great snowy mountains to carry also.",
        "source": "T51n2087_008:0917b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側窣堵波，如來於此納故衣。",
        "translation": "It's flanked by a stūpa where the Tathāgata deposited his old robes.",
        "source": "T51n2087_008:0917b11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次南林中窣堵波，如來受貧老母施故衣處。",
        "translation": "Next, there's a stūpa in the forest to the south, where the Tathāgata accepts the old, poor mother's donation of her old robes.",
        "source": "T51n2087_008:0917b11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "帝釋化池東，林中有目支隣陀龍王池，其水清黑，其味甘美。",
        "translation": "To the east of Indra's transformation pond, there's the Mucilinda-nāga-rāja pond in the forest, whose water is clear and black and whose flavor is sweet.",
        "source": "T51n2087_008:0917b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西岸有小精舍，中作佛像。",
        "translation": "On the west bank there's a small monastery with an image of the Buddha in it.",
        "source": "T51n2087_008:0917b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔如來初成正覺，於此宴坐，七日入定。",
        "translation": "Once, when the Tathāgata first became perfectly enlightened, he sat here in repose for seven days and then fell into meditation.",
        "source": "T51n2087_008:0917b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時此龍王警衛如來，即以其身繞佛七匝，化出多頭，俯垂為蓋，故池東岸有其室焉。",
        "translation": "When this dragon king was guarding the Tathāgata, he surrounded the Buddha with his body seven times and turned out many heads that hung down as lids, so there was a room on the east bank of the pond.",
        "source": "T51n2087_008:0917b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目支隣陀龍池東，林中精舍有佛羸瘦之像。",
        "translation": "To the east of the Mucilinda-nāga-nāga pond, there's a leaning image of the Buddha in a woodland retreat.",
        "source": "T51n2087_008:0917b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側有經行之所，長七十餘步，南北各有卑鉢羅樹。",
        "translation": "On its side there is a place for walking through the scriptures, more than 70 steps long, north and south there are vaipulya trees.",
        "source": "T51n2087_008:0917b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故今土俗，諸有嬰疾，香油塗像，多蒙除差。",
        "translation": "Therefore, in the customs of the land today, infants with illnesses are often anointed with scented oil and the image is removed.",
        "source": "T51n2087_008:0917b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩修苦行處。",
        "translation": "This is a place for bodhisattvas to practice austerities.",
        "source": "T51n2087_008:0917b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來為伏外道，又受魔請，於是苦行六年，日食一麻一麥，形容憔悴，膚體羸瘠，經行往來，攀樹後起。",
        "translation": "In order to subdue the heretics and accept Māra's invitation, the Tathāgata practiced austerities for six years, eating a hempseed and a grain of wheat every day, becoming emaciated and barren, walking back and forth, and climbing up a tree to get up from behind.",
        "source": "T51n2087_008:0917b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩苦行卑鉢羅樹側有窣堵波，是阿若憍陳如等五人住處。",
        "translation": "Near the Peppala tree where the bodhisattva did his asceticism was a stūpa where five people, including Ājñāta Kauṇḍinya, lived.",
        "source": "T51n2087_008:0917b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，太子之捨家也，彷徨山澤，棲息林泉，時淨飯王乃命五人隨瞻侍焉。",
        "translation": "At first, when the prince left home and wandered into a mountain swamp or rested in a forest spring, King Jīvaka ordered five people to come along and wait on him.",
        "source": "T51n2087_008:0917b26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "太子既修苦行，憍陳如等亦即勤求。",
        "translation": "As the prince cultivated austerities, Kauṇḍinya and the others also diligently sought them out.",
        "source": "T51n2087_008:0917b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍陳如等住處東南有窣堵波，菩薩入尼連禪那河沐浴之處。",
        "translation": "Southeast of where Kauṇḍinya and the others were staying was a stūpa where the bodhisattva entered the Nairañjana River to bathe.",
        "source": "T51n2087_008:0917b28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "河側不遠，菩薩於此受食乳糜。",
        "translation": "Not far from the river's side, the bodhisattva receives a meal of milk and milk powder there.",
        "source": "T51n2087_008:0917c01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側窣堵波，二長者獻麨蜜處。",
        "translation": "On its side is a stūpa where two elders offered up grain and honey.",
        "source": "T51n2087_008:0917c02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛在樹下結加趺坐，寂然宴默，受解脫樂，過七日後，方從定起。",
        "translation": "The Buddha sat cross-legged under a tree, calmly and quietly enjoying the bliss of liberation, and then rose from his meditation only after seven days had passed.",
        "source": "T51n2087_008:0917c02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二商主行次林外，而彼林神告商主曰：「釋種太子今在此中，初證佛果，心凝寂定，四十九日未有所食，隨有奉上，獲大善利。」",
        "translation": "The two merchant masters then walked next to each other outside the forest, and the forest spirit told the merchant master, \"Now, the prince of the Śākyas is here, having first realized the Buddhahood, his mind is calm and concentrated, and he hasn't had anything to eat for 49 days; whatever he offers, he'll receive a great deal of good benefit.\"",
        "source": "T51n2087_008:0917c04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時二商主各持行資麨蜜奉上，世尊納受。",
        "translation": "Each of the two merchants then offered up a quantity of rice and honey as a means of livelihood, and the Bhagavān accepted it.",
        "source": "T51n2087_008:0917c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長者獻麨側有窣堵波，四天奉鉢處。",
        "translation": "Next to the elder's offering of the flour, there was a stūpa where the four gods served their bowls.",
        "source": "T51n2087_008:0917c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "商主既獻麨蜜，世尊思以何器受之。",
        "translation": "After the merchants offered the flour and honey, the Bhagavān considered what container to accept it with.",
        "source": "T51n2087_008:0917c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時四天從四方來，各持金鉢，而以奉上。",
        "translation": "The four celestials then came from the four directions, each carrying a golden bowl, and presented it to him.",
        "source": "T51n2087_008:0917c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊默然，而不納受，以為出家不宜此器。",
        "translation": "The Bhagavān was silent and didn't accept them, thinking that it wouldn't be appropriate for a renunciant to use this container.",
        "source": "T51n2087_008:0917c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天王捨金鉢，奉銀鉢，乃至頗胝、琉璃、馬腦、車渠、真珠等鉢，世尊如是皆不為受。",
        "translation": "The four celestial kings relinquished their gold bowls and presented them with silver bowls, even bowls made of bāṭī, lapis lazuli, mañjarī, chakra, and real beads, which the Bhagavān thus refused to accept.",
        "source": "T51n2087_008:0917c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天王各還宮，奉持石鉢，紺青映徹，重以進獻。",
        "translation": "Each of the four heavenly kings returned to the palace, presented a stone bowl that was deep blue in color, and offered it up again.",
        "source": "T51n2087_008:0917c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊斷彼此故，而總受之，次第重疊，按為一鉢，故其外則有四隆焉。",
        "translation": "The Bhagavān cut them off from each other and accepted them in general, overlapping them in order and pressing them together into one bowl, so there were four rumbles outside of it.",
        "source": "T51n2087_008:0917c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四天王獻鉢側不遠，有窣堵波，如來為母說法處也。",
        "translation": "Not far from where the four heavenly kings presented the bowl, there was a stūpa, which was where the Tathāgata taught the Dharma for his mother.",
        "source": "T51n2087_008:0917c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來既成正覺，稱天人師，其母摩耶自天宮降於此處，世尊隨機示教利喜。",
        "translation": "After the Tathāgata had become perfectly enlightened and was called the teacher of gods and humans, his mother, Māya, descended from the palace of Heaven to this place, and the Bhagavān randomly showed him the benefits of the teachings.",
        "source": "T51n2087_008:0917c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側涸池岸有窣堵波，在昔如來見諸神變化有緣處。",
        "translation": "There's a stūpa on the bank of a dried-up pond beside it, which is where the Tathāgata used to see the transformations of the spirits that had a purpose.",
        "source": "T51n2087_008:0917c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現神變側有窣堵波，如來度優樓頻螺迦葉波三兄弟及千門人處。",
        "translation": "On the side of the present miracle there's a stūpa where the Tathāgata redeemed the three Uruvilvā-Kāśyapa brothers and a thousand disciples.",
        "source": "T51n2087_008:0917c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來方垂善道，隨應降伏，時優樓頻螺迦葉波五百門人請受佛教，迦葉波曰：「吾亦與爾俱返迷途。」",
        "translation": "When the Tathāgata had shown them the good way and had subdued them accordingly, five hundred of Uruvilvā-Kāśyapa's disciples asked them to accept the Buddha's teaching, and Kāśyapa said, \"I, too, have returned with you to the path of delusion.\"",
        "source": "T51n2087_008:0917c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是相從來至佛所。",
        "translation": "They then followed each other to the Buddha.",
        "source": "T51n2087_008:0917c26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來告曰：「棄鹿皮衣，捨祭火具。」",
        "translation": "The Tathāgata told them, \"Discard the deerskin robe and put away the fire altar.\"",
        "source": "T51n2087_008:0917c26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸梵志恭承聖教，以其服用投尼連河。",
        "translation": "The priests then, in deference to the noble teaching, threw their belongings into the Nairañjanā River.",
        "source": "T51n2087_008:0917c27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捺地迦葉波見諸祭器隨流漂泛，與其門人候兄動靜，既見改轍，亦隨染衣。",
        "translation": "Nadī-Kāśyapa saw the sacrificial vessels floating down the river with the current, so he and his disciples waited for their brother to move, and when they saw that the current had changed, they also dyed their robes.",
        "source": "T51n2087_008:0917c28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽耶迦葉波二百門人。",
        "translation": "Gayā-Kāśyapa had 200 disciples.",
        "source": "T51n2087_008:0918a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞其兄之捨法也，亦至佛所，願修梵行。",
        "translation": "Hearing that their brother had renounced the Dharma, they also went to the Buddha and vowed to cultivate the religious practice.",
        "source": "T51n2087_008:0918a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "度迦葉波兄弟西北窣堵波，是如來伏迦葉波所事火龍處。",
        "translation": "The stūpa to the northwest of Gayā-Kāśyapa's brother was where the Tathāgata subdued the fiery dragons that Gayā-Kāśyapa served.",
        "source": "T51n2087_008:0918a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來將化其人，克伏所宗，乃止梵志火龍之室。",
        "translation": "When the Tathāgata was about to teach them and subdue their school, he stopped at the room of the fire dragon of Brahmā.",
        "source": "T51n2087_008:0918a04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夜分已後，龍吐煙焰，佛既入定，亦起火光，其室洞然，猛焰炎熾。",
        "translation": "After nightfall, the dragon exhaled smoke and flames, and after the Buddha had calmed down, a firelight also arose, and the room was cavernous and blazing hot.",
        "source": "T51n2087_008:0918a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸梵志師恐火害佛，莫不奔赴，悲號愍惜。",
        "translation": "The priest masters, fearing that the fire would harm the Buddha, rushed to the room, wailing with pity.",
        "source": "T51n2087_008:0918a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優樓頻螺迦葉波謂其徒曰：「以今觀之，未必火也，當是沙門伏火龍耳。」",
        "translation": "Uruvilvā-Kāśyapa told his disciples, \"Judging from what we've seen, it's not necessarily fire; it must be an ascetic trying to quell a fire dragon.\"",
        "source": "T51n2087_008:0918a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來乃以火龍盛置鉢中，清旦持示外道門人。",
        "translation": "The Tathāgata then put the fire dragon in a bowl and showed it to the laymen on the clear day.",
        "source": "T51n2087_008:0918a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側窣堵波，五百獨覺同入涅槃處也。",
        "translation": "On its side was a stūpa where 500 pratyekabuddhas had all entered nirvāṇa together.",
        "source": "T51n2087_008:0918a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目支隣陀龍池南窣堵波，迦葉波救如來溺水處也。",
        "translation": "The Mucilinda dragon pond south of the stūpa was where Kāśyapa saved the Tathāgata from drowning in the water.",
        "source": "T51n2087_008:0918a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉兄弟時推神通，遠近仰德，黎庶歸心。",
        "translation": "The Kāśyapa brothers then promoted their supernormal powers, revered their virtue from near and far, and had the hearts and minds of the people.",
        "source": "T51n2087_008:0918a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊方導迷徒，大權攝化，興布密雲，降澍暴雨，周佛所居，令獨無水。",
        "translation": "The Bhagavān then guided the misguided disciples, had great authority to gather them in, spread a dense cloud, and sent down torrential rain to surround the Buddha's abode, leaving it alone without water.",
        "source": "T51n2087_008:0918a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉是時見此雲雨，謂門人曰：「沙門住處將不漂溺？」",
        "translation": "Seeing these clouds of rain, Kāśyapa then said to his disciples, \"Will the ascetic's abode not be submerged in water?\"",
        "source": "T51n2087_008:0918a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泛舟來救，乃見世尊履水如地，蹈河中流，水分沙現。",
        "translation": "When he came to his rescue in a boat, he saw the Bhagavān treading water like the ground, stepping into the river's current, and water appearing as sand.",
        "source": "T51n2087_008:0918a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉見已，心伏而退。",
        "translation": "After seeing this, Kāśyapa's mind subdued and he retreated.",
        "source": "T51n2087_008:0918a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣東門外二三里，有盲龍室。",
        "translation": "Two or three miles outside the eastern gate of Bodhidharma's wall, there's a room for a blind dragon.",
        "source": "T51n2087_008:0918a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此龍者，殃累宿積，報受生盲。",
        "translation": "That dragon has accumulated bad fortune over the years and has been rewarded with birth into blindness.",
        "source": "T51n2087_008:0918a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來自前正覺山欲趣菩提樹，途次室側，龍眼忽明，乃見菩薩將趣佛樹，謂菩薩曰：「仁今不久當成正覺。",
        "translation": "When the Tathāgata was about to head for the bodhi tree on the mountain of perfect enlightenment and was passing by the side of the room, the dragon's eyes suddenly became clear and he saw the bodhisattva about to head for the buddha tree and said to him, \"Sir, it won't be long before you'll become perfectly enlightened.",
        "source": "T51n2087_008:0918a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我眼盲冥，于茲已久，有佛興世，我眼輒明。",
        "translation": "I've been blind for a long time, but when a buddha arises in the world, my eyes will suddenly become clear.",
        "source": "T51n2087_008:0918a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢劫之中，過去三佛出興世時，已得明視。",
        "translation": "During the good eons, when three buddhas of the past appeared in the world, I was able to see clearly.",
        "source": "T51n2087_008:0918a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁今至此，我眼忽開，以故知之，當成佛矣。」",
        "translation": "Now, you've come to this point, and my eyes have suddenly been opened, so I know that I will become a buddha.\"",
        "source": "T51n2087_008:0918a25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹垣東門側有窣堵波，魔王怖菩薩之處。",
        "translation": "On the east side of Bodhidharma's wall is a stūpa where Māra King was afraid of the Bodhisattva.",
        "source": "T51n2087_008:0918a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初，魔王知菩薩將成正覺也，誘亂不遂，憂惶無賴，集諸神眾，齊整魔軍，治兵振旅，將脅菩薩。",
        "translation": "At first, the demon king knew that the bodhisattva was about to become perfectly enlightened, so he invited a multitude of spirits, organized his demon army, trained his troops, and raised his brigade to threaten the bodhisattva.",
        "source": "T51n2087_008:0918a28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是風雨飄注，雷電晦冥，縱火飛煙，揚沙激石，備矛楯之具，極弦矢之用。",
        "translation": "As a result, winds and rain poured down, thunder and lightning were obscure, smoke flew from the fires, sand was raised and rocks were stirred, spears and shields were prepared, and strings and arrows were used.",
        "source": "T51n2087_008:0918b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於是入大慈定，凡厥兵杖變為蓮華。",
        "translation": "The bodhisattva then entered the concentration of great compassion, and the weapons and staves of his army were transformed into lotus flowers.",
        "source": "T51n2087_008:0918b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔軍怖駭，奔馳退散。",
        "translation": "Terrified, the army of Māra rushed back and retreated.",
        "source": "T51n2087_008:0918b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其側不遠有二窣堵波，帝釋、梵王之所建也。",
        "translation": "Not far from them were two stūpas built by Indra and King Brahmā.",
        "source": "T51n2087_008:0918b04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹北門外摩訶菩提僧伽藍，其先僧伽羅國王之所建也。",
        "translation": "Outside the northern gate of the Bodhi tree is the Mahābodhi Saṃghârāma, built by his predecessor, the king of Saṃghāra.",
        "source": "T51n2087_008:0918b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "庭宇六院，觀閣三層，周堵垣牆高三四丈，極工人之妙，窮丹青之飾。",
        "translation": "It has six courtyards, a three-story observation tower, and a wall three or four feet high that's surrounded by the finest workmanship and decorated with richly colored paint.",
        "source": "T51n2087_008:0918b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於佛像，鑄以金銀，凡厥莊嚴，廁以珍寶。",
        "translation": "As for the Buddha's image, it was cast in gold and silver, and all of its adornments were lined with treasures.",
        "source": "T51n2087_008:0918b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸窣堵波高廣妙飾，中有如來舍利，其骨舍利大如手指節。",
        "translation": "The stūpas were highly and broadly decorated, and within them was the Tathāgata's relic, whose bones were as large as the knuckles of his fingers.",
        "source": "T51n2087_008:0918b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光潤鮮白皎徹中外。",
        "translation": "Its bones are as large as the knuckles of a finger, and their luster is as bright and vivid as a bright white color that penetrates both inside and outside.",
        "source": "T51n2087_008:0918b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其肉舍利如大真珠，色帶紅縹。",
        "translation": "Its flesh relics are like large, genuine pearls with a reddish-hued color.",
        "source": "T51n2087_008:0918b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每歲至如來大神變月滿之日，出示眾(即印度十二月三十日，當此正月十五日也)。",
        "translation": "Every year, on the day the Tathāgata's great miraculous moon is full, it's presented to the people (that's December 30 in India, which is also the fifteenth day of the first month).",
        "source": "T51n2087_008:0918b12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此時也，或放光，或雨花。",
        "translation": "At that time, some of them emit light, and some rain flowers.",
        "source": "T51n2087_008:0918b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧徒減千人，習學大乘、上座部法，律儀清肅，戒行貞明。",
        "translation": "The monks, numbering fewer than a thousand, train in the teachings of the Mahāyāna and Theravādin schools, are serious about discipline, and their moral conduct is well defined.",
        "source": "T51n2087_008:0918b14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔者，南海僧伽羅國，其王淳信佛法，發自天然。",
        "translation": "Once upon a time, in the South China Sea country of Siṃhala, the king of that country believed in the Buddha's teachings so deeply that it came from his natural mind.",
        "source": "T51n2087_008:0918b15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有族弟出家，想佛聖迹，遠遊印度，寓諸伽藍，咸輕邊鄙。",
        "translation": "When a member of his clan left home and conceived of the Buddha's noble traces, he traveled to India and stayed at one of the Kālāma schools, where they all despised the poor.",
        "source": "T51n2087_008:0918b16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是返迹本國，王躬遠迎，沙門悲耿，似若不能言。",
        "translation": "When he returned to his native land, the king greeted him personally, and the ascetic was so compassionate that he seemed unable to speak.",
        "source": "T51n2087_008:0918b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「將何所負，若此殷憂？」",
        "translation": "The king said, \"What would be the burden of such anxious concern?\"",
        "source": "T51n2087_008:0918b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門曰：「憑恃國威，遊方問道，羈旅異域，載罹寒暑，動遭凌辱，語見譏誚。",
        "translation": "The ascetic said, \"Relying on the country's authority, I traveled to different lands to inquire about the way, was detained in a foreign land, suffered through cold and heat, was subjected to abuse, and had my words castigated.",
        "source": "T51n2087_008:0918b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "負斯憂恥，詎得歡心？」",
        "translation": "Bearing this kind of grief and shame, how could I be happy?\"",
        "source": "T51n2087_008:0918b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「若是者何謂也？」",
        "translation": "He said, \"If this is the case, what does it mean?\"",
        "source": "T51n2087_008:0918b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「誠願大王福田為意，於諸印度建立伽藍，既旌聖迹，又擅高名，福資先王，恩及後嗣。」",
        "translation": "He said, \"May the great king's field of merit be his intention, and may he establish a kalāna in India that will both glorify holy traces and boast a high reputation, which will benefit his predecessor and extend kindness to his successors.\"",
        "source": "T51n2087_008:0918b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰：「斯事甚美，聞之何晚？」",
        "translation": "He said, \"This is a beautiful thing; why is it so late to hear about it?\"",
        "source": "T51n2087_008:0918b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是以國中寶獻印度王。",
        "translation": "He then presented the king of India with the country's treasures.",
        "source": "T51n2087_008:0918b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王既納貢，義存懷遠，謂使臣曰：「我今將何持報來命？」",
        "translation": "After he accepted the tribute, the king kept his intentions distant and said to his envoy, \"What will I do now to repay my commandment?\"",
        "source": "T51n2087_008:0918b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使臣曰：「僧伽羅王稽首印度大吉祥王！",
        "translation": "The ambassador said, \"The king of Sinhala salutes the great Indian king of good fortune!",
        "source": "T51n2087_008:0918b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "威德遠振，惠澤遐被，下土沙門，欽風慕化，敢遊上國，展敬聖迹，寓諸伽藍，莫之見館，艱辛已極，蒙恥而歸。",
        "translation": "With his virtue so far-reaching and his beneficence so widely extended, ascetics from the lower lands admired the transformation, dared to travel to higher lands, showed their respect for the holy traces, stayed at one of the kalams, but there was no one to see the temple, and returned home in disgrace after having gone through great hardship.",
        "source": "T51n2087_008:0918b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竊圖遠謀，貽範來葉，於諸印度建此伽藍，使客遊乞士，息肩有所，兩國交歡，行人無替。」",
        "translation": "I secretly planned from afar to model this Kālāma for the visitors to India, so that they would have something to rest their shoulders, and the two countries would rejoice together, with no replacement for pedestrians.\"",
        "source": "T51n2087_008:0918c01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王曰：「如來潛化，遺風斯在，聖迹之所，任取一焉。」",
        "translation": "The king said, \"The legacy of the Tathāgata's latent transformation is here, so let's take one of these places as a sacred site.\"",
        "source": "T51n2087_008:0918c03_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使者奉辭報命，群臣拜賀，遂乃集諸沙門，評議建立。",
        "translation": "The envoy returned with a message, and the ministers paid homage and congratulated him.",
        "source": "T51n2087_008:0918c04_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門曰：「菩提樹者，去來諸佛咸此證聖，考之異議，無出此謀。」",
        "translation": "The ascetics said, \"The bodhi tree is a place where all the buddhas of the past and future have realized their sagacity, and there's nothing different than this plan.\"",
        "source": "T51n2087_008:0918c06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是捨國珍寶，建此伽藍，以其國僧而修供養，乃刻銅為記曰：「夫周給無私，諸佛至教；慧濟有緣，先聖明訓。",
        "translation": "He then gave up his country's treasures to build this kalāma, made offerings to the monks of his country, and carved bronze to mark the occasion, saying, \"Zhou gives selflessness, the ultimate teaching of the buddhas, and Huiji has the conditions for it, as the sages of yore have instructed.",
        "source": "T51n2087_008:0918c07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我小子，丕承王業，式建伽藍，用旌聖迹，福資祖考，惠被黎元。",
        "translation": "Now, my son, who has inherited the king's business, built the kalāma in such a way as to honor the traces of the sages, bestow blessings on our ancestors, and bestow benefits on the people of Lebanon.",
        "source": "T51n2087_008:0918c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯我國僧而得自在，及有國人亦同僧例。",
        "translation": "Only our national saṃgha has attained mastery, and there are national citizens who share the saṃgha's example.",
        "source": "T51n2087_008:0918c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "傳之後嗣，永永無窮。」",
        "translation": "Their lineage will continue forever and ever.\"",
        "source": "T51n2087_008:0918c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故此伽藍多執師子國僧也。",
        "translation": "That's why so many monks from this Kālāma adhered to the state of Shizi.",
        "source": "T51n2087_008:0918c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩提樹南十餘里，聖迹相隣，難以備舉。",
        "translation": "For more than ten miles south of the bodhi tree, there are so many sacred sites close together that it's hard to enumerate them.",
        "source": "T51n2087_008:0918c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "每歲比丘解安居，四方法俗百千萬眾，七日七夜，持香花，鼓音樂，遍遊林中，禮拜供養。",
        "translation": "Every year, when the monks are settled, a million people from the four methods and the secular world wander through the forest for seven days and nights, carrying incense and flowers and playing music, venerating and making offerings.",
        "source": "T51n2087_008:0918c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "印度僧徒依佛聖教，皆以室羅伐拏月前半一日入兩安居，當此五月十六日；以頞濕縛庾闍月後半十五日解兩安居，當此八月十五日。",
        "translation": "According to the Buddha's noble teaching, monks in India enter the two retreats one day before the month of Śrāvastī, which is the sixteenth day of the fifth month, and one day after the month of Aśvayuja, which is the fifteenth day of the eighth month.",
        "source": "T51n2087_008:0918c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "印度月名，依星而建，古今不易，諸部無差。",
        "translation": "The names of the Indian months are based on the stars, which are not easily understood in ancient or modern times, and there are no differences among the various schools.",
        "source": "T51n2087_008:0918c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "良以方言未融，傳譯有謬，分時計月，致斯乖異，故以四月十六日入安居，七月十五日解安居也。",
        "translation": "It's because the dialects have not yet been fused, and there are errors in the transmission and translation, so the time division and calculation of the moon have led to this discrepancy.",
        "source": "T51n2087_008:0918c21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大唐西域記卷第八",
        "translation": "Great Tang Record of Travels to the Western Regions, Volume 8",
        "source": "T51n2087_008:0918c24_0",
        "is_bad_quality": false
    }
]