[
    {
        "source_sentence": "續一切經音義卷第三",
        "translation": "Continuation of the Pronunciations and Meanings of all the Sutras, Volume 3",
        "source": "T54n2129_003:0943a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燕京崇仁寺沙門希麟集",
        "translation": "Yanjing Chongrensi shaman xilin ji",
        "source": "T54n2129_003:0943a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "續新音大方廣佛花嚴經從第十六盡四十新譯十地經九卷迴向輪經一卷十力經一卷右四經三十六卷同此卷續音。",
        "translation": "Continuation of the New Sound of the Dafangguangfo huayan jing from the sixteenth to the fortieth rolls of the New Translation of the Shidi jing, nine rolls of the Huixiang lun jing, one roll of the Shili jing, and thirty-six rolls of the right four sūtras are the same as this roll of the Continuation Sound.",
        "source": "T54n2129_003:0943a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第十六",
        "translation": "New Flower Ornament Sutra, Vol. 16",
        "source": "T54n2129_003:0943b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "補陁落迦(亦云補怛洛迦舊云寶陀羅皆梵語楚夏也此云小花樹山謂此山中多有此花樹其花甚香即南海此岸孤絕山觀自在菩薩所居宮也)。",
        "translation": "Potalaka (also called Potalaka, and formerly called Baudhara, which is Sanskrit for Chuxia as well as this one, Small Flowering Tree Mountain, which is a mountain where there are many of these flowering trees and their flowers are very fragrant, namely, the palace where Avalokitêśvara resides on Anāthapiṇḍada Mountain on the coast of the South China Sea).",
        "source": "T54n2129_003:0943b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓊鬱(上烏孔反玉篇云蓊欝謂草木茂盛)。",
        "translation": "(Skt. *Mahāmegha).",
        "source": "T54n2129_003:0943b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "[月*庸]圓(上丑容反爾雅曰[月*庸]均也郭注云謂齊等也爾雅作[月*庸]字)。",
        "translation": "[Yue*you]yuan (上丑容反爾雅曰[月*庸]均 均也郭注云謂齊等也爾雅作[月*庸]字).",
        "source": "T54n2129_003:0943b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弓矢(上居戎反釋名云弓穹也謂穹穹然說文云像形字也下又作矢笑皆音式是反世本云黃帝夷牟作矢也)。",
        "translation": "Bow and Yageo (上久戎反釋名云弓穹也謂穹穹穹然說文云像形字也下又作矢笑皆音式是反世本云黃帝夷牟作矢也).",
        "source": "T54n2129_003:0943b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶璫(上博抱反眾珍之總名也亦作珤從玉缶聲下都郎反說文云穿耳施珠也韻英云耳飾也從玉當聲)。",
        "translation": "Jewels in disguise (Shangbo boluo 反众珍之總名也作 了 了 了 了由玉缶聲 下都郎反說文云穿耳施珠也韻英云耳飾也從玉当聲).",
        "source": "T54n2129_003:0943b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "髑髏(上同祿反下勒候反埤蒼云頭骨也說文云頂骨也並從骨獨樓省聲字經文有作[蜀*頁][婁*頁]俗字非正體)。",
        "translation": "Calvary (上同祿反下勒候反 BeiCang云头骨也說文云頂骨 也並從骨獨樓省聲字經文有作[蜀*頁][婁*頁]俗字非正體).",
        "source": "T54n2129_003:0943b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依怙(胡古反爾雅曰怙恃也詩云無母何怙也)。",
        "translation": "Dependence (Huguo's opponent, Erya, says father and mother, and the poet says, \"Without a mother, why would we depend on her?\").",
        "source": "T54n2129_003:0943b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慞惶(上諸良反切韻云懼也下胡光反考聲云慞惶恐懼也韻英遽也悚懼失次也)。",
        "translation": "Perplexity (上諸良反切韻云懼也下胡光反考聲云慞怕怕怕 也韻英急也悚懼失次 也).",
        "source": "T54n2129_003:0943b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "驚駭(上舉卿反怖也下候揩反切韻云駭亦驚也說文云從馬亥聲孫然注爾雅云禹疏九河北河功難眾懼不成因名徒駭也)。",
        "translation": "Frightened (上舉卿反害怕也下候揩反切韻云駭亦惊 也說文云從馬亥聲孫然注爾雅云禹疏九河北河功難眾懼不成因名徒駭也).",
        "source": "T54n2129_003:0943b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捔力(上古岳反合單作角考聲云競也切韻云角牴戲也今作捔說文云掎捔也有經作捔椓又作斠平斗斛槩也皆非角力義掎音居綺反)。",
        "translation": "Jhāli (上古岳反合單作角考聲云競也切韻云角牴戲也今作 冀 标說文云手 Jhāli 也有經作 jhāli 寶叉又作 斠平斗斛 hold both are not the meaning of \"jhāli\" 捍音居綺反).",
        "source": "T54n2129_003:0943b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第十七(無可音訓)",
        "translation": "New Flower Ornament Sutra, Vol. 17 (Wuxue yin xun)",
        "source": "T54n2129_003:0943b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第十八",
        "translation": "New Flower Ornament Sutra, Vol. 18",
        "source": "T54n2129_003:0943b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捶楚(上隹蘂反說文云以杖擊也從手垂聲或從竹作箠策也從木作棰棓也下瘡所反切韻云榎楚也楸木名亦荊從林疋聲疋音踈榎音賈)。",
        "translation": "Pounding Chu (above Trojan Anti-Speaking, the cloud hitting with a staff, from the sound of hand-tied or from the bamboo for a leather strap, from the wood for a whip and gall bladder, below the sores, and the refrain Enoch Chu, the name of the rowan tree also from the forest, from the sound of bolt, bolt sound, Enoch sound, Jia).",
        "source": "T54n2129_003:0943b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開闡(下昌演反韓康伯注周易云闡明也廣雅云闢也聲類云大開也說文云從門單聲也單音善)。",
        "translation": "Open and explain (Han Kangbo notes Zhouyi Yun elucidate also Guangya Yun open also sound class Yun Da open also Shuowen Yun from the door single sound also single sound good).",
        "source": "T54n2129_003:0943b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "揀擇(上姦眼反文字集略云擇也從手東聲說文作東分別也從束八下音澤韻英云擇亦揀也從手澤省聲也)。",
        "translation": "Select (上姦眼反文字集略云擇也從手东聲說文作東分別也從束八下音澤韻英云擇亦揀也從手澤省聲也).",
        "source": "T54n2129_003:0943b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "主稼(爾雅曰師職主也廣雅云主守也字從王[必-心]聲[必-心]音竹句反下加暇反馬融注論語云樹五穀曰稼即苗稼也此神守之不令有損也)。",
        "translation": "The main crop (Ersa said the teacher occupies the main also Guangya cloud main guard also word from the king [must - heart] sound [must - heart] sound bamboo sentence counter lower Garshang counter Ma Rong commentary on the Analects of Confucius cloud tree five grains said crop namely seedling crop also this god guards it does not let there be damage also).",
        "source": "T54n2129_003:0943b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第十九",
        "translation": "(New Flower Ornament Sutra, Vol. 19)",
        "source": "T54n2129_003:0943c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覺寤(上音教蒼頡篇寤覺也經文作[寤-吾+告]俗字下吾故反考聲云寤中有所見覺而有信謂之寤從[寐-未+夢]省吾聲也)。",
        "translation": "awake (on the sound of teaching Cangjie chapter awake awake also scriptures for [awake - we + tell] the vulgar word under the Ou故 anti KaoSheng cloud awake in the view of awareness and have faith is called awake from [sleep - not + dream] province OuSheng also).",
        "source": "T54n2129_003:0943c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "號泣(上胡刀反切韻哭也爾雅曰舞號雩也郭璞注云雩祭吁嗟請雨也說文作唬下去急反切韻哭泣也考聲云無聲出涕曰泣從水立聲也)。",
        "translation": "(on the knife counter rhyme weep also Ersa said dance horn summer also Guo Pu note Yun summer sacrifice to appeal for rain also Shuowen made bluff down urgent counter rhyme weep also Kao sound cloud no sound out of tears said weep from the sound of water standing also).",
        "source": "T54n2129_003:0943c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稻梁(上徒皓反切韻云秔稻也本草云秔米主益氣止煩泄稻米主溫中令人多熱字林云秔稻不黏糯稻黏說文云糯即稻也下音良或作梁切韻云稻梁也廣志云遼東有赤梁米也)。",
        "translation": "Ināliang (上徒皓反切韻云富生稻也本草云丰米主益氣止煩泄稻米主溫中令人多熱字林云蓬稻不粘糯稻粘說文云糯即稻也下音良或作梁切韻云稻梁也廣志云遼東有赤梁米也).",
        "source": "T54n2129_003:0943c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嬉戲(上許其反聲類云美也遊也從女喜聲下香義反切韻云弄也謔也郭注爾雅云謂調戲也謔音虛虐反)。",
        "translation": "Play (上許其反聲類云美也遊也從女喜聲下香義反切韻云弄也弄也謔也郭注爾雅云謂調戲也謔音虛虐反).",
        "source": "T54n2129_003:0943c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十",
        "translation": "New Flower Ornament Sutra, Volume 20",
        "source": "T54n2129_003:0943c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淳熟(上時倫反正作[泳-永+(高/羊)]說文清也下常六反考聲云熟成也方言云爛也)。",
        "translation": "Chunsu (上時倫反正作[泳-Yong+(高/羊)]說文清也下常六反考聲云熟成也方言云熟成也云爛也).",
        "source": "T54n2129_003:0943c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "際畔(上子例反玉篇邊也切韻云畔也下蒲半反說文云田界也從田半聲也)。",
        "translation": "Jibian (上子例反玉篇邊也切韻云畔也下蒲半反說文云田界也從田半聲也).",
        "source": "T54n2129_003:0943c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十一",
        "translation": "New Flower Ornament Sutra, Volume 21",
        "source": "T54n2129_003:0943c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廛里(上直連反考聲云市空地也又居也經作[堐-圭+(里/八/土)][土*厘]皆俗字下良史反周禮云五家為隣五隣為里也風俗通云里止也謂五十家共止為里也)。",
        "translation": "Śāriputra (Shanglian's anti-Kaosheng word for \"market place\" and \"dwelling place\"; the sūtras make it [ditch - gui + (li/eight/earth)][tu*c], a colloquialism; below, Liang-shih's anti-Zhouli's word for \"five families as neighbors\" and \"five neighbors as li\"; Fengxu Tong's word for \"li\", meaning \"fifty families sharing a common stop\").",
        "source": "T54n2129_003:0943c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十二",
        "translation": "(New Flower Ornament Sutra, Vol. 22)",
        "source": "T54n2129_003:0943c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惽寐(上呼昆反考聲云不明也字林又音呼困反昧也經文單作昬爾雅云昬強也切韻曰暮也非此用下民致反玉篇寢臥也孝經曰夙興夜寐說文從[寐-未+夢]省聲也)。",
        "translation": "(上呼昆反考聲云不知道也字林又音呼困反昧 也經文單作空頤爾雅云空強也切韻曰暮也非此用下民致反玉篇寢臥也孝經曰夙興夜睡說文從[寐-未+夢]省聲也).",
        "source": "T54n2129_003:0943c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "檢策(上錦儼反爾雅曰檢同也釋名云撿禁也說文云從木僉聲下楚革反或作筴賈注國語云策計也字書云策謀筭也說文從竹朿音此志反經文從宋作榮誤書字也宋音送)。",
        "translation": "The first thing that I want to do is to make sure that I'm not going to be in the same position as the others.",
        "source": "T54n2129_003:0943c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十三",
        "translation": "New Flower Ornament Sutra, Volume 23",
        "source": "T54n2129_003:0943c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "旋澓(上似泉反爾雅曰旋澓返也謂[廷-壬+(同-(一/口)+巳)]還也下音復爾雅釋水云逆流而上曰泝洄即澓也三蒼云澓深也謂河海中旋流處)。",
        "translation": "convoluted (上似泉反尔雅曰旋遏返也謂[Ting-non+(同-(一/口)+巳)] 還 也下音復尔雅釋水云逆流而上曰喀徙即 撐撐也三蒼云謠謠謠深也謂河海中旋流處).",
        "source": "T54n2129_003:0943c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "枯槁(上苦姑反切韻云朽也考聲云木乾死也下苦皓反切韻云槁亦枯也說文云從木高聲)。",
        "translation": "槁 (上苦姑反切韻云朽也考聲云木乾死也下苦皓反切韻云槁亦枯 也說文云從木高聲).",
        "source": "T54n2129_003:0943c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "船筏(上食川反方言云關東曰船關西曰舟說文云從舟沿省聲也沿與專反鉛錫之銘沿流之沿皆同經文作船或作舡皆非本字下又作橃亦作[舟*發]同扶月反方言云[簿-尃+卑]也編竹木浮於河運物也[簿-尃+卑]音蒲住反)。",
        "translation": "Boat (上食川反方言云关東曰船关西曰舟說文云從舟沿省聲也沿与專反铅錫之銘沿流之沿皆同經文作船或作船皆不是本字下又作 boat亦作 [boat*发] 同扶月反方言云[簿-尃+卑] 也編竹木浮於河運物也[簿-尃+卑] 音蒲住反).",
        "source": "T54n2129_003:0943c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞖瞙(上於計反目病也下音莫字統云目不明也二字皆從目殹莫聲也經作膜謂皮內肉外也)。",
        "translation": "(1) cataracts (2) the disease of the eyes (3) the inferior sound of the word mo (2) both words are derived from the sound of mo (3) which is also used in the scriptures as a membrane meaning inside the skin and outside the flesh (4).",
        "source": "T54n2129_003:0944a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶繩(下食蠅反世本曰涶作準繩尚書曰繩[保/言]糺謬格其非心也又曰木從繩則正說文索也從糸蠅省聲也)。",
        "translation": "Jeweled rope (lower meaning \"food and fly\" is translated as \"standard rope\"; Shang shu says \"rope\" [po/yan] is a misnomer that's not mental; it also means \"wood\" and \"rope\" are correct; Shuowen says \"rope\" and \"it's the sound of \"fly\").",
        "source": "T54n2129_003:0944a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妃嬪(上芳非反韻英云喜偶也郭璞注爾雅云相偶[女*((奐-大)/比)][女*((奐-大)/比)]音疋閉反案毛詩傳云關鴠后妃之德也下符真反爾雅釋親云嬪婦也禮記云生曰父母妻死曰考妣嬪也堯典曰降二女於媯汭嬪于虞孔傳曰使行婦道於虞氏也)。",
        "translation": "The female consort (上芳非反韻英云喜偶也郭璞注爾雅云相偶[女*((奐-大)/比)][女*((奐-大)/比)] 音疋閉反案毛詩傳云关点儿香香後妃之德也下符真反爾雅釋親云怀孕怀孕也禮記云生曰父母妻死曰考婆婆婆 也禮記云生曰父母妻死曰考婆婆 也堯典曰降二女在 汭拇拇拇 于嬪子孔傳曰使行婦道于虞氏也).",
        "source": "T54n2129_003:0944a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十四",
        "translation": "New Flower Ornament Sutra, Volume 24",
        "source": "T54n2129_003:0944a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "煢獨(渠營反尚書云無虐[煢-(冗-几)]獨孔安國曰[煢-(冗-几)]單也謂無兩依也無子曰獨也亦作惸字)。",
        "translation": "(Qianying 反尚書云無虐[郴-(冗-几)]獨孔安國曰[郴-(冗-几)]单 也謂無兩依也無子曰獨 也 也作 ॐ字).",
        "source": "T54n2129_003:0944a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溝阬(上苟侯反考工記云井間廣四尺深四尺謂之溝鄭注周禮云十夫二隣之田所以通於川也說文云水瀆也從水冓聲也下客庚反爾雅云阬虛也蒼頡篇云阬壑也陷也塹也古今正字從阜亢聲經作坑俗字也)。",
        "translation": "ditch (上苟侯反考工記云井間广四尺千千深四尺謂之溝鄭注周禮云十夫二隣之田所以通於川也說文云水瀆也從水冓聲也下客庚反爾雅云 洞虛也蒼頡篇云 洞壑也陷也陷也塹也古今正字从阜亢聲經作坑俗字也).",
        "source": "T54n2129_003:0944a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "堆阜(上當雷反考聲云堆土之高也說文云小阜也從土隹聲也經文作塠俗字非也下房務反爾雅曰大陸曰阜考聲云丘類也釋名云阜厚也從[阜-十]土省聲古文作[阜-(口/十)+(耜-耒)]大篆作隹經文作阜埠皆非也)。",
        "translation": "Pile of mounds (上当雷反考聲云堆土之高也說文云小阜也從土隹聲也經文作 徊徊俗字非也下房務反爾雅曰大陸曰阜考聲云丘類也釋名云阜厚也從[fu - 10]土省聲古文作[fu - (mouth / 10)+(耜 - Lei)] 大篆作隹經文作阜埠皆不是也).",
        "source": "T54n2129_003:0944a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "荊棘(上舉卿反切韻荊木名可以染也從草刑聲也下紀力反考聲云酸棗木名也切韻云箴也從二朿也朿音[利-禾+夾]也)。",
        "translation": "Thorny (up Juqing's opponent's syllable, the name of the thorn tree can be dyed, from the sound of the grass punishment, down Kili's opponent's syllable, the name of the sour jujube tree, from the sound of the two harvests, and from the sound of the two harvests [li-ho + chu]).",
        "source": "T54n2129_003:0944a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬚蘂(上相俞反切韻小髻也下如捶反廣雅云花也謂花鬚頭點也說文云從三心作蘂云花外曰萼花內曰蘂經從三止或從木作蘃皆非)。",
        "translation": "The beard (above, Xiang Yu's opponent's verse, Xiaoyun's chignon, below, Ruemo's opponent's verse, Guangya's flower, the beard of the flower, is also called the beard of the flower, which is made from the three hearts, and outside the flower is called the calyx, and inside the flower is called the spring.)",
        "source": "T54n2129_003:0944a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十五",
        "translation": "New Flower Ornament Sutra, Volume 25",
        "source": "T54n2129_003:0944a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婬佚(上余針反切韻云邪也蕩也說文云貪也從女[婬-女]聲也[婬-女]字從爪壬音同上下寅質反切韻云佚樂也說文云從人失聲也)。",
        "translation": "淫佚(上余針反切韻云邪也蕩也說文云貪也從女[淫 -女]声也[淫 -女]字從爪壬音同上下寅質反切韻云佚樂也說文云從人失聲也).",
        "source": "T54n2129_003:0944a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "囹圄(上歷丁反下魚舉反獄名周禮三王始有獄釋名云囹領也圄禦也謂領錄囚徒御禁之說文云囹獄也圄守也外形內聲字)。",
        "translation": "prison (on the Liding anti lower Yuju anti prison name Zhouli three kings began to have prison ShiMing Yungui lead also prison guard also said to lead the record of prisoners to the Royal Palace of the Shuowen Yun prison also prison guard also shape internal sound word).",
        "source": "T54n2129_003:0944a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "搒笞(上白忙反顧野王云搒擊也字書云捶也說文從手旁聲下恥持反說文云苦擊也從竹台音怡聲也)。",
        "translation": "搒hoot (上白忙反 顧野王云 搒hoot 也字書云捶 也說文從手旁聲 下恥持反說文云苦擊 也從竹台音怡聲 也).",
        "source": "T54n2129_003:0944a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "臏割(上蒲忍反大戴禮云人生暮而臏生然後行也說文云臏膝骨也尚書傳曰决關梁踰城郭略而盜者其刑臏顧野王曰斷足之刑也即呂刑[跳-兆+非]刑之類也或從骨作[骨*(實-毌+(眉-目))]下古達反爾雅曰割裂也切韻云剝截也從刀害聲也)。",
        "translation": "(Upper Pūrṇa opposed to Dadai Li Yunsheng and then Jizi born and then walk, Shuowen Yun Jizi knee bones also Shangshu Chuan said decided Guanliang over the city and Guo slightly and theft of its punishment Jizi Guo Wang said the punishment of cutting off the feet, that is, the punishment of Lu [jump - zhao + non] punishment of the type, or from the bone for [bone * (real - not + (eyebrow - eye))], the lower Guda opposed to Ersa said cut also cut off the sound of the vowel also from the sound of harm).",
        "source": "T54n2129_003:0944a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宮闈(上居戎反世本云禹作宮室爾雅曰宮謂之室禮記云由命氏以立火子皆異宮案古者貴賤同稱宮自秦漢以來唯王者所居之稱下雨非反爾雅曰宮中之門謂之闈郭璞注云謂相通小門也其小者謂之闈也)。",
        "translation": "The palace and the close (on the Jurong anti Shi Ben Yun Yu made the palace room, Ershiya said the palace is called the room, Ritual Records Yun by the life of the family to establish the fire son are different palace case in ancient times, the noble and the poor are called the same palace since the Qin and Han, only the king's residence is called raining non-retrogression Ershiya said the door in the palace is called the close Guo Pu Note Yun said that the small door that interconnects also its small is called the close also).",
        "source": "T54n2129_003:0944a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "犀牛(上音西爾雅曰犀似豕郭璞注云似水牛豬頭大腹庳脚脚有三蹄色黑三角一角頂上一角額上一角鼻上鼻上者即食角也小而不橢好食棘亦有一角者從牛尾省聲經文作[尸@丰]誤也橢音他果反)。",
        "translation": "Rhinoceros (up sound west Ershiya said rhinoceros like a boar Guo Pu note cloud like a buffalo pig head big belly low-built feet feet have three hooves color black triangle a horn on the top of a horn on the forehead a horn on the nose nose on the one that is eating horns also small and not oval good food thorns also have a horn from the tail of the cow save the sound of the scriptures as [尸@丰] mistaken also oval sound other fruit anti).",
        "source": "T54n2129_003:0944b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十六",
        "translation": "(New Flower Ornament Sutra, Volume 26)",
        "source": "T54n2129_003:0944b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "肝膽(上古安反木之精也白虎通云像木有葉王叔和云肝與膽為府其候目故肝實熱則目赤暗也下答敢反白虎通云膽者肝之府脈經云膽病則神不守是也二字並從肉干詹聲也詹音占形聲字也)。",
        "translation": "liver and gallbladder (on the Gouan anti wood essence also Baihu Tong Yun like wood has leaves Wang Shuhe Yun liver and gallbladder for the House of its waiting eyes so the liver is really hot then the eyes red and dark also under the answer dare anti Baihu Tong Yun bile the liver of the House of the pulse scriptures Yun bile sick then the spirit does not keep is also the two words and from the sound of the flesh Gan Zhan also Zhan sound accounted for the form of the word also).",
        "source": "T54n2129_003:0944b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "膓胃(上除良反釋名云膓腹內暢氣之府也下或作[月*胃]正作[鬯-匕+((氘-气)@二)]白虎通云脾之府色黑說文云穀府也從肉作[鬯-匕+((氘-气)@二)]像形字)。",
        "translation": "Śāriputra (上除良反釋名云 匪腹內暢氣之府 也 下或者作[月*胃]正作[鬯 -匕+((氘 - 气)@二)]白虎通云脾之府色黑說文云穀府也從肉作[鬯 -匕+((氘 - 气)@二)]像形字).",
        "source": "T54n2129_003:0944b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "環珮(上戶關反切韻玉環也爾雅曰肉好若一謂之環郭注云謂邊孔適等也下蒲妹反切韻云玉佩也禮記云古之君子珮以比德也)。",
        "translation": "Ring and Pei (上戶关反切韻玉環也爾雅曰肉好若一 如謂之環郭注云謂邊孔適等也下蒲妹反切韻云玉佩也禮記云古之君子珮以比德也).",
        "source": "T54n2129_003:0944b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "母脇(上莫厚反爾雅曰父為考母為妣父之妣為王母郭注云加王者尊之也蒼頡云字從女雨點像婦人乳形也下香業反或作脅亦同說文云肚兩傍也從肉劦聲劦音叶從三力也)。",
        "translation": "mother (on the Mo Hou anti Ershiya said father for the examination mother for the mother father's mother for the mother of the king Guo notes cloud plus the king honored it Cangjie Yun word from the female rain dots like a woman's breast shape also lower Xiangye anti or made threat is also the same as the Shuowen cloud belly two sides also from the sound of flesh Jie Jie sound leaves from three force also).",
        "source": "T54n2129_003:0944b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慙愧(上徂含反下軌位反說文愧亦慙也禮記云君子不以所能者而病於人不以所不能者而愧於人廣雅曰慚恥也爾雅云愧慙也二字互相訓也說文作愧亦作謉聭二形皆古字也)。",
        "translation": "慙愧(上徂含反下軌位反說文愧亦慙也禮記云君子不以所能者而病於人不以所不能者而愧於人廣雅曰慚恥也爾雅云愧慙也二字互相訓也說文作愧亦作謉聭二形皆古字也)。",
        "source": "T54n2129_003:0944b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十七",
        "translation": "(New Flower Ornament Sutra, Vol. 27)",
        "source": "T54n2129_003:0944b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沮壞(上慈與反毛詩傳云沮猶壞也廣雅溼也說文云從水且聲也且音子余反下懷聵反考聲云崩摧也說文從土褱聲古文作[(褱-衣)*土])。",
        "translation": "Destruction (上慈与反毛詩傳云沮猶壞也廣雅湿也說文云從水且聲也且音子余反下懷聵反考聲云崩摧也說文從土褱聲古文作[(wrap-衣服)*土]).",
        "source": "T54n2129_003:0944b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "焚爇(上符分反切韻燒也下又作焫同如雪反韻英放火也亦燒也)。",
        "translation": "Burning (上符分反切韻烧也下又作報名同如雪反韻英放火也亦燒也).",
        "source": "T54n2129_003:0944b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十八",
        "translation": "New Flower Ornament Sutra, Volume 28",
        "source": "T54n2129_003:0944b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "翼從(上與職反切韻恭也助也爾雅云翼敬也論語云趨進翼如也孔注云言端謹也下疾用反切韻云後也侍也經文或作翊俗用亦通)。",
        "translation": "翼從(上与職反切韻恭也助也爾雅云翼敬也論語云趨進翼如也孔注云言端謹 也下疾用反切韻云後也侍也經文或者作翊俗用亦通).",
        "source": "T54n2129_003:0944b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "延袤(上以然反下莫候反延長也袤廣也如前第七卷經已釋訖)。",
        "translation": "Extending (上以然反下莫候反延長 也繁多 也如前第七卷經已釋完).",
        "source": "T54n2129_003:0944b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殞滅(上為敏反聲類云殞沒也爾雅云落也亦作隕左傳星隕如雨是也下亾烈反說文作威解云火從十月亥受氣至九月戌乃死故從火戌也蔡邕加水作滅)。",
        "translation": "(上為敏反聲類云相相喪沒也爾雅云落 也作 隕 也作 隕 左傳星隕如雨是也下 寨烈反說文作威解云火從十月亥 受氣至九月戌乃死故從火戌 也 蔡邕加水作滅).",
        "source": "T54n2129_003:0944b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佞媚(上乃定反切韻云諂也論語云雍也仁而不伎郭註爾雅云佞人似信者也下明祕反考聲云悅也美也切韻云姿媚也論語云王孫賈問曰與其媚於奧寧媚於竈也)。",
        "translation": "sycophantic and flattering (上乃定反切韻云投訴也論語云雍也仁而不伎郭註爾雅云 sycophantic people who seem to believe also 下明祕反考聲云悅也美也切韻云姿媚也論語云王孫賈問曰与其媚於奧寧媚於竈也).",
        "source": "T54n2129_003:0944c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愆違(上去乾反又作[保/言][億-音+(天*天)][奸/心]三形皆同爾雅曰逸[保/言]過也書云監於先王其永無愆孔注云過也下雨非反字林背也切韻違逆也拒也)。",
        "translation": "Transgressions (going up to the level of [bao/yan][yi-yin+(tian*tian)][adulterous/xin], all three forms are the same: Ershiya says yi [bao/yan] transgressions, and the writing says that he supervised the former king, and he never transgressed.)",
        "source": "T54n2129_003:0944c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乞匃(下垓艾反顧野王云匃亦乞也考聲云求也古今正字云人亾財則匃也說文云從人亾會意字也古作勹几二形並音人)。",
        "translation": "Begging (Ha Gaiaiai anti Guoyao Yun Zhuo also begs, Kao Sheng Yun seeks, and Ancient and Modern Orthographic Syllables say that people's wealth and possessions are begged for, and Shuowen Yun follows the word for people's livelihood, and the ancient word for philosophy is translated into two forms and sounds like people).",
        "source": "T54n2129_003:0944c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猨[狂-王+冘](上雨元反爾雅曰猱猨善援也下余救反山海經云鬲山多蜼音同上郭璞注云似獼猴而大蒼黑色尾長四五尺似獺尾頭有兩歧天雨則倒懸於樹以尾塞鼻江東養之捕鼠切韻云虫名也亦作[(白/虫)*虫][豸*冘]狖古字有作[狂-王+由]非)。",
        "translation": "Assorted [crazy - Wang + move on] (on the Yu Yuan anti Ersa said that the brisk assault dog is good at helping, also under the Yu save anti Shanhai jing Yun Lishan Duo Л sound the same as the above Guo Pu commentary cloud resembles a monkey and large pale black tail is four or five feet long resembles the tail of the otter head has two manifolds when it rains, then hanging upside down in a tree with its tail plugged nose Jiangdong foster the rat catcher rhyme cloud insect name also as [(white / worm)*worm] [zirch * move on] the ancient word for lava has [crazy - Wang + by] not).",
        "source": "T54n2129_003:0944c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "袨服(上玄絹反文字集略云盛服也考聲云袨美服字書云袨衣服鮮者也從衣玄聲)。",
        "translation": "The name of the dress (上玄絹反文字集略云盛服也考聲云袨美服字書云袨衣服鮮者也從衣玄聲).",
        "source": "T54n2129_003:0944c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第二十九",
        "translation": "New Flower Ornament Sutra, Volume 29",
        "source": "T54n2129_003:0944c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慳悋(上苦間反切韻云恡也爾雅曰慳固也郭璞云慳然牢固也下良刃反切韻云鄙財曰悋考聲云惜也或作恡吝[希-巾+ㄙ]皆俗字)。",
        "translation": "Stingy (上苦間反切韻云逃也爾雅曰 慳固也郭璞云慳然牢固 也下良刃反切韻云鄙財曰 悋 考聲云惜 也 或作 呪 [希-巾+游]皆俗字).",
        "source": "T54n2129_003:0944c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繒纊(上疾綾反下苦謗反說文曰繒帛也纊綿也小雅曰絮之細者曰纊也)。",
        "translation": "Silk and floss (上疾綾反下苦謗反說文曰繒帛也 ぬ帛也 ぬ霖綿也小雅曰之絮之細者曰 ぬ霖 也).",
        "source": "T54n2129_003:0944c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迫窄(上博陌反切韻逼近也考聲附急也古文作皈下又作迮側伯反切韻陿也亦迫也)。",
        "translation": "迫窄(上婆陌反切韻逼近 也考聲附急 也古文作皈 下又作 迮側伯反切韻小额 也穴也迫 也).",
        "source": "T54n2129_003:0944c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "洗滌(上先禮反古文亦作洒切韻云盡也浴洗亦肅敬皃下徒歷反玉篇除也韻英淨也毛詩曰十月滌場傳云滌掃也)。",
        "translation": "Washing (上先禮反古文亦作洒切韻云也 洗洗亦肅敬皃下徒歷反玉篇除 也韻英淨 也毛詩曰十月滌場傳云滌掃 也).",
        "source": "T54n2129_003:0944c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十",
        "translation": "New Flower Ornament Sutra, Volume 30",
        "source": "T54n2129_003:0944c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開闢(上苦哀反韻集云解也張也字從門幵聲幵音牽下房皃反切韻開也舜曲曰闢四門孔傳云開闢四方之門說文云從門辟聲也)。",
        "translation": "開闢(上苦哀反韻集云解也張也字從門幵聲幵平 下房皃反切韻開也舜曲曰闢四門孔傳云開闢四方之門說文云從門辟聲也).",
        "source": "T54n2129_003:0944c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瑩徹(上烏定反蒼頡云瑩治也賈注國語云徹明也或作鎣撤二字亦通)。",
        "translation": "Ying Che (上烏定反蒼頡云瑩治也賈注国語云徹明也或者作 Ying撤二字亦通).",
        "source": "T54n2129_003:0944c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "禦捍(上魚舉反爾雅曰禦圉禁也韻英云當也切韻示敵也說文亦禁也從示御聲也下胡幹反切韻云抵也又拒也從手旱聲也)。",
        "translation": "Defend (上魚舉反爾雅曰御圉禁也韻英云当也切韻示敵也說文亦禁也從示御聲也下胡幹反切韻云抵也又拒也從手旱聲也).",
        "source": "T54n2129_003:0944c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十一",
        "translation": "(New Flower Ornament Sutra, Vol. 31)",
        "source": "T54n2129_003:0944c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "婀字(阿可反)　攞字(盧可反)。",
        "translation": "The Sanskrit words śar (akṣa) and śa (lokṣa).",
        "source": "T54n2129_003:0944c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哆字(多可反已上三字皆梵語作觀祕門不求字義)。",
        "translation": "The Sanskrit phoneme d (多可反已上三字都了旧金山語作觀祕門不求字義).",
        "source": "T54n2129_003:0945a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "咸綜(上胡嵒反切韻云皆也同也下宗送反說文云機縷持交絲者也從糸宗聲糸音覓)。",
        "translation": "Ṛamgar (上胡 ヤ反切韻云都也同 也 下宗送反說文云機縷持交絲者也從糸宗聲糸音尋找).",
        "source": "T54n2129_003:0945a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癲癎(上丁堅反廣雅云癲狂也聲類云大風疾說文作瘨下限姦反聲類云小兒病也說文云癎風病也從疒間聲疒音女厄反姦音間)。",
        "translation": "Epilepsy (上丁堅反廣雅云癲狂也聲類云大风疾說文作瘨下限姦反聲類云小兒病也說文云 epilepsy 风病也從疒間聲疒音女 厄反姦音間).",
        "source": "T54n2129_003:0945a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鉛錫(上與專反說文云青金也尚書云青州貢鉛錫下先戚反爾雅曰錫謂之鈏郭璞注云白鑞也鈏音余刃反)。",
        "translation": "鉛錫(上與專反說文云青金也尚書云青州貢鉛錫下先戚反爾雅曰錫謂之鈏郭璞注云白鑞也鈏音余刃反)。",
        "source": "T54n2129_003:0945a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讖緯(上楚[讚-貝+日]反釋名云讖纖也謂其義纖微也下緯字前已釋)。",
        "translation": "(Skt. kuṇḍinya, sūtra, and sūtra).",
        "source": "T54n2129_003:0945a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "該練(上古哀反廣雅云咸也包也切韻云備也古文作眩字下練字桂苑珠叢云煮絲令熟曰練鎔金作鍊字)。",
        "translation": "The Lian (上古哀反廣雅云咸也包也切韻云備也古文作眩字下練字 桂苑珠叢云煮絲令熟曰練鎔金作鍊字).",
        "source": "T54n2129_003:0945a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十二",
        "translation": "New Flower Ornament Sutra, Volume 32",
        "source": "T54n2129_003:0945a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沃田(上烏酷反切韻云地肥美曰沃顏注漢書云沃謂溉灌也)。",
        "translation": "Wotian (上乌酷反切韻云地肥美曰沃顏注漢書云沃謂irrigate 也).",
        "source": "T54n2129_003:0945a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬻金(上余六反切韻云賣也說文作鬻從毓聲也毓音與上同)。",
        "translation": "(Skt. yuk, yuk sounds the same as above.)",
        "source": "T54n2129_003:0945a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "補特伽羅(舊經云富伽羅亦云弗伽羅舊翻為數取趣謂諸有情數造集因數取苦果又云或翻為入言捨天陰入人陰等)。",
        "translation": "Pudgala (the old sūtras say fuqala and also pudgala, which are old translations of the term \"taking destinies,\" meaning that sentient beings repeatedly create causes of accumulation and repeatedly take the results of suffering, or they may be translated as entry, saying that they abandon the heavenly aggregates and enter the human aggregates, etc.).",
        "source": "T54n2129_003:0945a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奢摩他(梵語也案慧苑法師花嚴音義云此云止息亦曰寂靜謂正定離沈掉等也)。",
        "translation": "śamatha (Sanskrit: Huiyuan Fashi Huayan yinyi yinyi yi yi yi yi, this is called stilling, which refers to right concentration and freedom from sinking and falling, etc.).",
        "source": "T54n2129_003:0945a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毘鉢舍那(或云毗婆設那此云觀察謂正慧決擇也即止觀二名也)。",
        "translation": "Vipaśyanā (also known as vipaśyanā, which is the observation of correct wisdom and decision making, or the two names of stilling and insight).",
        "source": "T54n2129_003:0945a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十三",
        "translation": "New Flower Ornament Sutra, Vol. 33",
        "source": "T54n2129_003:0945a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "關鑰(上古還反說文曰以橫木持門曰關從門[聯-耳]聲也經文作閞音弁爾雅曰閞謂之槉非此用下羊斫反說文作[門@龠]謂關之鎻也或作籥非也)。",
        "translation": "The key (上古還反说文曰以橫木持門曰关從門[聯-耳]声也經文作閞音弁爾雅曰閞謂之 ໃ不是此用下羊砍反說文作[門@]指关之鎻也或作 籥非也).",
        "source": "T54n2129_003:0945a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "搏噬(上補各反切韻云手聲也爾雅曰暴虎徒搏也郭注云謂空手執也下時制反切韻齧噬也又建也從口筮聲也)。",
        "translation": "(上補各反切韻云手聲也爾雅曰暴虎徒搏也郭注云謂空手執也下時制反切韻齧噬也又建也從口筮聲也).",
        "source": "T54n2129_003:0945a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "犗牛(上古邁反切韻牛去勢曰犗即犍牛也從牛從害聲也)。",
        "translation": "Bull (上古迈反切韻牛去勢曰牛即犍牛也從牛從害聲也).",
        "source": "T54n2129_003:0945a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "紹繼(下古詣反爾雅曰紹胤嗣續係繼也說文從糸[斷-斤]會意字[斷-斤]古文絕字經文作繼或作継皆不成字也)。",
        "translation": "Shaoji (lower Gouyong anti Ershiya said Shao Yin he continued to be the successor also Shuowen from the word it [cut - catty] the word [cut - catty] the ancient word for cutting off the word scriptures as a successor or as a successor are not the word also).",
        "source": "T54n2129_003:0945a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "浣染(上洹管反公羊傳注云去舊垢曰浣鄭箋毛詩云浣謂洗滌也說文云澣濯從水幹聲下如琰反廣雅云染污也說文云以繒染為綵也從水杂聲杂音同上)。",
        "translation": "Raccoon and dye (上 洹管反公羊傳注云去旧污曰浣鄭箋毛詩云謂洗滌也說文云 盪盪從水干聲下 如琰反廣雅云染污也說文云以繒染為綵也從水杂聲杂音同上).",
        "source": "T54n2129_003:0945a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佷戾(上胡懇反切韶佷亦戾也下郎計反切韻云乖也尚書云罪也爾雅云辜辞戾辜也說文云曲也從犬出戶下也)。",
        "translation": "Kauśāmbī (上胡懇反切韶 Kauśāmbī also hostile, 下郎計反切韻云乖也尚書云罪也爾雅云辜辞戾辜也說文云曲也從犬出戶下也).",
        "source": "T54n2129_003:0945a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十四",
        "translation": "New Flower Ornament Sutra, Volume 34",
        "source": "T54n2129_003:0945b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "草積(下子賜反切韻云委積也說文云聚也正作[禾*(朿/貝)]從朿音[利-禾+夾]聲也字書相承肄省作積亦音子惜反經文從草作[卄/積]俗字)。",
        "translation": "(Skt. stūpa) (Ha zizi 反切韻云委積也說文云聚 也正作[wo*(wo/be)] 從朿音[li-wo+夾] 声也字書相承肄省作積亦音子惜反經文從草作[twenty/jum]俗字).",
        "source": "T54n2129_003:0945b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "青瘀(下於據反考聲云謂皮肉中凝血也文字典說云積聚血也)。",
        "translation": "Blue bruise (below, it's called \"clotted blood in the flesh,\" which is also called \"pooled blood\" according to the sūtras.)",
        "source": "T54n2129_003:0945b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "[月*夆]脹(上疋江反又作肨切韻云[月*夆]亦脹也下知亮反說文云滿也壯脹也或作痮亦同經文作膖俗字)。",
        "translation": "[Yue*Fo] swelling (上作香江反又作 薊切韻云[Yue*Fo] 也脹 也下知亮反說文云滿也壯脹 也或作痮亦同經文作 喪 vulgar字).",
        "source": "T54n2129_003:0945b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十五",
        "translation": "(New Flower Ornament Sutra, Vol. 35)",
        "source": "T54n2129_003:0945b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尒燄(下又作焰梵語也此云所知謂智所知境非預識境故云過尒燄也)。",
        "translation": "In this case, the word \"knowledge\" refers to the cognitive object of knowing, not the object of pre-consciousness, so the word \"excessive\" refers to the flames.",
        "source": "T54n2129_003:0945b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "哽噎(上加杏反說文曰食肉有骨噎在喉內悲憂噎塞者故借為喻言)。",
        "translation": "Choking (above and below is the verse that says, \"Eating meat has bones that choke on the inside of the throat, so we borrow it as a metaphor.\")",
        "source": "T54n2129_003:0945b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "擐甲(胡串反杜注左傳曰擐貫也賈注國語云衣甲也衣音意案五經文字擐亦音古患反)。",
        "translation": "Home (Hu string anti Du note ZuoZhuan said home through also Jia note national language cloud clothes and armor also clothes sound meaning case five scriptures text home also sound ancient suffering anti).",
        "source": "T54n2129_003:0945b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "穽陷(上疾政反古文作阱阮也書云敜乃穽字書云陷獸曰穽下戶蘸反切韻云入也隤沒也考聲云墮也說文作臽小阮也蘸音[病-丙+土]陷反臽字從[色-巴]在臼上也[色-巴]音人諂燄之類皆從此或從爪作舀音羊小反韜蹈之字於此敜音躡)。",
        "translation": "ï¿½ trap (上疾政反古文作阱阮也書云敜乃 ï¿½ 書云陷獸曰 ï¿½ 下戶蘸反切韻云入也隤没也考聲云墮也說文作 trap小阮也蘸音[病-丙+土]陷反陷阱字從[颜色-巴]在臼上也[颜色-巴]音人投訴焰之類皆從此或從爪作舀音羊小反韜蹈之字在此 瞞 音 躡).",
        "source": "T54n2129_003:0945b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "利鐮(下力炎反切韻刈刀也釋名云鐮廉也取其廉薄也從金廉形聲字也經從兼作鎌俗用字也)。",
        "translation": "利鐮(下力炎反切韻刈刀也釋名云鐮廉也取其廉薄也從金廉形聲字也經從兼作鎌俗用字也)。",
        "source": "T54n2129_003:0945b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金錍(下府移反切韻云錍鏃之薄者也又音疋迷反今按金鎞合作釵鎞之鎞也)。",
        "translation": "金錍(下府移反切韻云錍鏃之薄者也又音疋迷反今按金鎞合作釵鎞之鎞也)。",
        "source": "T54n2129_003:0945b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鉗鑷(上儉嚴反合作鈷說文云[金*截]夾也鉆取物者也經文作鉗乃小兒[金*截]枷也下黏輙反合作銸說文云銸亦小鉆也從金耴聲耴音同上經文從聶作鑷車下[金*截]纂也二字皆非經義)。",
        "translation": "Forceps (上儉嚴反合作鈷說文云[金*截]夾也钻孔取物者也經文作鉗乃小兒[金*截]枷也下黏閏反合作蛛說文云 999078戍戍亦小小小 型也從金高等聲掌掌聲 ﺇ聲 冗 音同上經文從聶作鑷車下[金*截]纂也 Both words are not the meaning of the scriptures).",
        "source": "T54n2129_003:0945b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貿易(上莫候反爾雅曰[夗/貝]賈市也切韻交易也考聲云賣也下羊益反變也)。",
        "translation": "trade (上莫候反爾雅曰[夗/貝]贾市也切韻交易也考聲云卖也下羊益反變 也).",
        "source": "T54n2129_003:0945b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "支提(梵語也或云制底或云制多皆訛略應云制底耶此翻為積聚謂於如來涅盤及說法經行等處起塔廟臺閣令無量人天積集福善之所此義翻也舊亦翻為高墳或云靈廟)。",
        "translation": "Cedi (Sanskrit: also called caitya or caitya, which are both incorrect and abbreviated as caitya, is translated as accumulation, which means to erect a stūpa, a temple, a tower, or a pavilion at the place where the Tathāgata's nirvāṇa and sermons on the Dharma are practiced, so that measureless humans and gods may accumulate merit and goodness.)",
        "source": "T54n2129_003:0945b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十六",
        "translation": "New Flower Ornament Sutra, Volume 36",
        "source": "T54n2129_003:0945b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瘢痕(上薄宮反切韻云瘡瘢也下戶恩反隱也即瘢痕隱也)。",
        "translation": "scar (上薄宮反切韻云瘡瘢也下戶恩反隱也即瘢痕隱也).",
        "source": "T54n2129_003:0945b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沈溺(上直林反切韻云沈沒也濁也爾雅曰祭川曰浮沈下乃歷反古文作[仁-二+水]說文云人沒水也)。",
        "translation": "Śubha (上直林反切韻云沈没也濁也爾雅曰祭川曰浮 沈下乃歷反古文作[仁-二+水]說文云人没水也).",
        "source": "T54n2129_003:0945b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鎧仗(上苦亥反切韻云甲之別名也字書從金皚省聲下直兩反字書云儀仗也)。",
        "translation": "Armor (Up苦亥反切韻云甲之别名也字書從金皚省聲下直兩反字書云儀仗也).",
        "source": "T54n2129_003:0945b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "銷秏(上相焦反切韻云鑠金也亦冶金也作消盡也滅也下呼倒反玉篇減也又損也或云秏亦稻屬今不取)。",
        "translation": "The first thing that I would like to say is that I'm not sure how to say it.",
        "source": "T54n2129_003:0945b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竄伏(上倉乱反玉篇曰竄謂逃藏也廣雅云隱匿也說文云從鼠在穴中則竄矣下伏字按說文從犬從人云犬見人則伏矣)。",
        "translation": "The word \"flee\" (上倉乱反玉篇曰竄謂逃藏也廣雅云隱藏也說文云從鼠在穴中則竄矣下伏字按說文從犬從人云犬見人則伏矣).",
        "source": "T54n2129_003:0945b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卵[穀-禾+卵](上落管反玉篇鳥卵也說文云無乳生[穀-禾+卵]者曰卵也下苦角反切韻云鳥卵[穀-禾+卵]也說文云從卵[穀-禾]聲[穀-禾]音同上有本作聲甚乖於義)。",
        "translation": "Eggs (上落管反玉篇鳥卵也說文云無乳生[grain-禾+卵] 者曰卵 也下苦角反切韻云鳥卵[grain-禾+卵] 也說文云從卵[grain-禾]声[grain-禾] 音[grain-禾] 上有本作聲甚不於義).",
        "source": "T54n2129_003:0945c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貓貍(上莫交反詩云有貓似虎切韻云捕鼠獸也下力之反切韻云野貍也爾雅曰貙似貍郭注云貙虎類也大如猫文如貍也二字皆從豸經文從犬作猫狸非正字也)。",
        "translation": "貓貍 (上莫交反詩云有貓似虎切韻云捕鼠獸也下力之反切韻云野貍也爾雅曰 貙似貍郭注云 貙虎類也大如猫文如貍也两字皆從豸經文從犬作猫狸非正字也).",
        "source": "T54n2129_003:0945c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "[石*慈]石(上疾之反切韻[石*慈]石可以引針也)。",
        "translation": "[Shi * Ci] Shi (上疾之反切韻[石*慈]石可以引針也).",
        "source": "T54n2129_003:0945c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "延齡(上似然反爾雅曰永承引延長也下歷丁反廣雅曰齡年也禮記云古者謂年為齡)。",
        "translation": "Yanling (上似然反尔雅曰永承引延長也下歷丁反廣雅曰齡年也禮記云古者謂年为齡).",
        "source": "T54n2129_003:0945c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滲漏(上所禁反水潛沒也下盧候反字書云漏落也又刻漏以銅盤盛水滴漏百刻以定晝夜也)。",
        "translation": "Leakage (Up śramaṇa, water submerges; down śramaṇa, water leaks down; and a copper dish containing water that drips and leaks for a hundred moments to determine day and night).",
        "source": "T54n2129_003:0945c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十七",
        "translation": "New Flower Ornament Sutra, Vol. 37",
        "source": "T54n2129_003:0945c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金屑(上金字說文曰五色金也黃為長久薶不生百鍊不輕從革不違西方之行生於土從土今左右注像金在土中形今聲下先結反切韻盡也清也不安皃按經意合作糏粖之糏)。",
        "translation": "Gold dust (the Sanskrit phoneme gold, which means five-colored gold, is also yellow and long-lasting, making it unproductive, not light, and not contrary to the practices of the West; it's made from earth, and now it's noted as gold in the shape of earth.)",
        "source": "T54n2129_003:0945c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三摩鉢底(梵語也此云等至琳菀二法師云謂由加行伏沈掉力至其受位身心安和也亦云等持謂平等持心也)。",
        "translation": "Samāpatti (Sanskrit: Equipoise, which is the teaching of the two masters that the power of applied practices to quell sinking and fall into a state of mental and physical well-being is also called equipoise, which refers to the equal maintenance of mind).",
        "source": "T54n2129_003:0945c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法螺(下盧和反俗字也正作蠃說文介蟲也經作[豕/虫]音禮皆非法蠃字)。",
        "translation": "\"The conch of the Dharma (lower Luhe's opponent's colloquialism, orthograph, is also called the wine-worm, which is also used in the scriptures as [boar/worm] and is not a legal word for wine-worm).",
        "source": "T54n2129_003:0945c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "平坦(他袒反說文云坦安也廣雅云亦平也論語云君子坦蕩蕩是)。",
        "translation": "Flat (Tataban 反說文云坦安 也 廣雅云亦平 也論言云君子坦蕩是).",
        "source": "T54n2129_003:0945c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陿劣(上咸甲反顧野王曰陿迫隘下廣大也說文曰從阝匚夾聲也經文從犬作狹乃習犬馬也非經意下戀惙反考聲云弱也少力也會意字也古文作乎阝音[阜-(口/十)+(耜-耒)]匚音方夾音田)。",
        "translation": "Poor (on the Ham A anti Guo Wang said poor forced narrow under the broad also said from the 阝 匚 folder sound also scriptures from the dog for narrow is not the meaning of the scriptures under the Lian mang anti Kao sound cloud is weak also less power also the word meaning also the ancient text for Hu Semi sound [F - (mouth / 10) + (ñê - Lei)] sound square folder sound field).",
        "source": "T54n2129_003:0945c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十八",
        "translation": "New Flower Ornament Sutra, Volume 38",
        "source": "T54n2129_003:0945c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "霈然(上普蓋反雨盛皃切韻云霶霈也說文從雨沛聲沛音同上)。",
        "translation": "Sangran (上普蓋反雨盛皃切韻云蘊蘊婆 也說文從雨沛聲沛聲沛音同上).",
        "source": "T54n2129_003:0945c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第三十九",
        "translation": "New Flower Ornament Sutra, Vol. 39",
        "source": "T54n2129_003:0945c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沮壞(上慈與反下懷瞶反前經第二十七卷已釋)。",
        "translation": "Destruction (Explained in the preceding sūtra, vol. 27, by Caiwai and Lü and Huaiyi).",
        "source": "T54n2129_003:0945c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新花嚴經卷第四十",
        "translation": "New Flower Ornament Sutra, Vol. 40",
        "source": "T54n2129_003:0945c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "啗肉(上徒濫反又作啖切韻食[口*舀]也或作噉音徒敢反下肉字說文作肉像筋肉之形)。",
        "translation": "啗肉 (上徒濫反又作啖切韻食[口*舀]也或作 噉音徒敢反下肉字說文作肉像筋肉之形).",
        "source": "T54n2129_003:0945c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卉木(上輝貴反說文云百草總名從三屮作芔屮音丑列反屮如草初生之形並二屮為艸音草四中為茻音莾今變芔從三十也)。",
        "translation": "Huimu (上輝貴反说文云百草总名從三屮作 屮音丑列反屮如草初生之形並二屮为艸音草 四中为茻音赓今變 屮從三十也).",
        "source": "T54n2129_003:0945c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燈炷(下朱遇反近代字也案陸氏釋文切韻許慎說文玉篇字林古今正字並無唯孫緬廣韻收在注字內)。",
        "translation": "The word \"candle\" is a recent word that was also used in the case of Lu's Shiowen Cheyun, Xu Shen's Shuowen, Yujian's Zilin, ancient and modern orthography, but Sun's extensive vowels are included in the commentary).",
        "source": "T54n2129_003:0946a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第一(并經前記)",
        "translation": "The New Translation of the Ten Stages Sutra, Volume 1 (and the Notes on the Preface to the Sutra)",
        "source": "T54n2129_003:0946a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天竺(相承音竹准梵聲合音篤古云身毒或云賢豆新云印度皆訛轉也正云印特伽羅此翻為月也月有千名斯乃一稱西域記云良以彼土佛日既隱賢聖誕生相繼開悟導利群生如月照臨故以為名也)。",
        "translation": "Tianzhu (Xiangcheng's sound Zhusheng's sound Tuk's ancient cloud body poison or cloud Xianzu's new cloud India are all falsely also Zhengyun Indra this is translated as the moon also the moon has a thousand names this is a name of the western region records say Liang because that land Buddha day both hidden, the birth of sages, successive enlightenment to guide the benefit of all beings as the moon shines before it so it is named also).",
        "source": "T54n2129_003:0946a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "踈勒國(梵語訛略也正云佉路數怛勒此翻為惡性國以其國人性多獷戾故或云彼國有佉路數怛勒山因山立稱也在北印度境也)。",
        "translation": "The land of Kashgar (Sanskrit: Ṛṣipatana, Sanskrit: Ṛṣipatana, Sanskrit: Ṛṣipatana, Sanskrit: Ṛṣipatana, Sanskrit: Ṛṣipatana, Sanskrit: Ṛṣipatana).",
        "source": "T54n2129_003:0946a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乾陁羅(上音[虔-文+ㄆ]舊云健[馬*犬]羅此云持地昔此國多有得道聖賢住持其境不為他國侵害故也又云香氣邏謂此國多生香氣之花遍其國內以為名也其國在中印度北北印度南境也)。",
        "translation": "乾陁羅(上音[虔-文+ㄆ]舊云健[馬*犬]羅此云持地昔此國多有得道聖賢住持其境不為他國侵害故也又云香氣邏謂此國多生香氣之花遍其國內以為名也其國在中印度北北印度南境也)。",
        "source": "T54n2129_003:0946a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦濕彌羅(或云迦葉蜜羅舊云罽賓訛略也此翻為阿誰入謂此國未建時有大龍池人莫敢近其後有羅漢見地形勝宜人居止從龍乞容一膝地時龍許之羅漢變身漸大膝滿龍池龍以言信捨之而去羅漢復以神力乾竭其水遂建城郭眾人咸言我等不因聖師阿誰得入故因此語乃立國名其國北印度境也)。",
        "translation": "Kāśmīra (also Kāśmīra, formerly Kāśmīra, a shortened version of the old Kāśmīra verse, which translates as \"who entered\") means that when this country was first built, there was a large dragon pond that no one dared to approach.",
        "source": "T54n2129_003:0946a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "披緇(上敷羈反說文云開也散也或作帔襜也巾也又作被音平義反服也加也衣也今合從後作下側持反說文云緇黑色繒也論語云涅乎不緇注云涅謂黑泥可以染皂者也涅音奴結反從水日炙土也)。",
        "translation": "black (上敷羈反說文云开也散也或者作帔襜也巾也又作被音平義反服 也加 也加也衣也今合從後作下側持反說文云緇黑繒也論言云涅乎不緇 注云謂黑泥可以染皂者也涅音奴結反從水日炙土也).",
        "source": "T54n2129_003:0946a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鄔波[亭*也]耶(鄔烏古反[亭*也]亭也反正梵語也舊云郁波弟耶此云近誦謂以弟子年小不離於師常近隨逐受經而誦也或翻為親教龜茲于闐等國訛云和闍或云鶻社今云和上本非梵語亦非唐言蓋[卄/公/心]右諸國訛轉音耳也)。",
        "translation": "(Upa[ting*ya]ye (Uwugu Anti [ting*ya]ting also anyway, Sanskrit also old cloud Upaodiye this cloud near recitation means that the disciple is young not separate from the teacher always near and follow the acceptance of the scriptures and recitation also translated as pro-teaching Guzi Yutan and other national falsely Yun and Jia or Yun Ursa now Yun and on this is not Sanskrit nor Tang language is [20 / Gong / Xin] right countries, the inflection of the sound also).",
        "source": "T54n2129_003:0946a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蒙鞮(下都奚反非正梵語蓋罽賓國寺名也未詳翻對案鞮字履屬也)。",
        "translation": "Meng (lower Du Xi'an is not correct Sanskrit, but the name of the temple in Kāśmīra is also unknown, and the word di is also used in the translation of the text).",
        "source": "T54n2129_003:0946a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "拗怒(上於六反博雅云止也說文云從手幼聲又音於綾反今不取下乃故反字書恚也切韻嗔也又音弩亦嗔目皃也)。",
        "translation": "The word \"anger\" (上於六反博雅云停止也說文云從手幼聲又音於綾反今不取下乃故反字書怒也切韻嗔也又音弩 也也嗔目皃也).",
        "source": "T54n2129_003:0946a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僅全(上渠靳反切韻云能也少也顧野王云僅纔也下正作全音疾緣反韻英云完也說文云具也從工亼會意字也亼才入反三合之形也)。",
        "translation": "Shanquan (上渠靳反切韻云能也少也 顧野王云只纔也下正作全音疾緣反韻英云完也說文云所具也從工亼合意字也爪才入反三合之形也).",
        "source": "T54n2129_003:0946a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "那爛陀(或云娜那爛多西域寺名也此云施無猒西域記云歷代帝王共建合為一寺東闢其門常供千僧自興建已來未有一人犯間疑者故五印度境捨施無猒因以為名也在中印度境)。",
        "translation": "Nālandā (also called Nālandā, the name of a temple in the western regions; here, it's called 'Shishuang wugai'. It's said in the Chronicle of the Western Regions that the emperors built this temple together and combined it into a single temple, which was built in the east and whose gates were always used for a thousand monks.)",
        "source": "T54n2129_003:0946a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "泠泠(郎丁反序中人名不求字義)。",
        "translation": "Lengling (the name of a person in the preface does not seek the meaning of the word Langding).",
        "source": "T54n2129_003:0946a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提堤犀魚(次都奚反三音西非印度言龜茲語也此云蓮花精進彼國三藏法師名也)。",
        "translation": "Diti rhinoceros fish (the second Du Xi anti-Sanyin West African Indian language Guzi language also this cloud lotus flower zeal other countries Sanzang Fashi name).",
        "source": "T54n2129_003:0946b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "郭昕(下許斤反人名也案字日欲出也釋名云昕者忻也言皎日將出万物忻然也)。",
        "translation": "Guo Xin (lower Xuqin anti-personal name also case the word sun wants to come out also the explanation of the name of the Xin people Xin also said bright sun will come out all things Xin also).",
        "source": "T54n2129_003:0946b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滴霤(上都歷反切韻云水滴也說文云涯也從水滴省聲也下力救反案滴霤合作溜說文云水溜也字書云小流也今作霤說文云霤神名也非此用)。",
        "translation": "Dripping Dew (上都歷反切韻云水滴也說文云涯也從水滴省聲 也 下力救反案滴霤合作溜說文云水溜也字書云小流也今作霤說文云霤神名也不是此用).",
        "source": "T54n2129_003:0946b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "程鍔(上直貞反人姓也本自顓頊重黎之後周宣王時程伯休甫入為大司馬封于程後以為氏也下五各反人名也案字劒口端也說文云從金咢聲也咢音同上)。",
        "translation": "The name Cheng Ngok (Shang Zizhen反人姓, originally from the family of Cheng Bo Xiufu, who became the Grand Secretary of State during the reign of King Xuanzeng of Zhou after the death of Chongli.)",
        "source": "T54n2129_003:0946b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所齎(下祖西反考聲云持物行也韻英云送也切韻云付也遺也說文從貝齊聲也俗作賷訓同非正字也)。",
        "translation": "The word \"carry\" (lower Zuxi反考聲云持物行也韻英云送也切韻云付也遺也說文從貝齊聲也俗作賷訓同非正字也).",
        "source": "T54n2129_003:0946b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鍊冶(上音郎甸反又作煉說文云銷金也從金柬聲柬音揀從束八下羊者反切韻銷金也尹子曰[山/虫]尤作冶說文從仌音氷台音怡考聲云氷熱則冶遇寒則疑也)。",
        "translation": "(上音郎甸反又作煉說文云銷金也從金柬聲柬音揀從束八下羊者反切韻銷金也尹子曰[山/虫]尤作冶說文從仌音氷台音怡 考聲云 冰熱則冶遇寒則疑也).",
        "source": "T54n2129_003:0946b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悅豫(上余雪反爾雅曰悅懌服也切韻喜樂也說文云從心說省聲下羊恕反爾雅曰愉豫愷康樂也又曰豫安也玉篇逸豫也說文云從象予聲也)。",
        "translation": "YUE YU (上余雪反爾雅曰悦懌服也切韻喜樂也說文云從心說省聲下羊恕反爾雅曰愉豫愷康樂也又曰豫安也玉篇逸豫也說文云從象予聲也).",
        "source": "T54n2129_003:0946b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第二",
        "translation": "(The New Translation of the Ten Stages Sutra, Volume 2).",
        "source": "T54n2129_003:0946b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "珂貝(上恪何反玉篇珂螺屬也出於海者其白如雪所以纓馬膺也下博蓋反亦珂類也爾雅曰貝居陸[貝*焱]在水者蜬郭注云水陸異名貝中肉如科斗但有頭尾耳說文貝像形案貝古者用以市物也故財貨買賣之流皆從貝也[貝*焱]音標蜬音含也)。",
        "translation": "Kebei (on the scattered He anti jade book Kebei belong to also out of the sea its white like snow so the sabotage also under the Pokai anti also Kebei type also Ershiya said shells live on land [shells * Yan] in the water of those who verse Guo commentary cloud water and land synonymous shells in the meat such as Ketu but have a head and tail ear Shuowen shells like shape case shells ancient used to market goods also so the flow of buying and selling of goods are from shells also [shells * Yan] phonemes marked ketu sound contained also).",
        "source": "T54n2129_003:0946b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "璧玉(上必益反爾雅云肉倍好謂之璧璧大六寸謂之瑄郭注云肉邊也好孔也白虎通曰外圓像天內孔方法地君執為信以祭天也下語欲反爾雅曰以玉者謂之珪禮記曰執玉不趨舜典曰修五禮五玉孔注云五等諸[仁-二+戾]各執其玉白虎通云玉像君子之德燥不輕溼不重也說文云玉有五德)。",
        "translation": "璧玉(上必益反爾雅云肉倍好謂之璧璧大六寸謂之瑄郭注云肉邊也好孔也白虎通曰外圓像天內孔方法地君執為信以祭天也下語欲反爾雅曰以玉者謂之珪禮記曰執玉不趨舜典曰修五禮五玉孔注云五等諸[仁-二+戾]各執其玉白虎通云玉像君子之德燥不輕溼不重也說文云玉有五德)。",
        "source": "T54n2129_003:0946b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "資糧(上即夷反玉篇助也考聲取也切韻資亦貨財也說文從貝次聲也下呂張反亦作糧說文云糧儲也切韻云倉糧也爾雅曰粻糧也郭注今江東通呼粮為粻)。",
        "translation": "Śrīgupta (上即夷反玉篇助也考聲取也切韻資亦貨財也說文從貝次聲也下呂張反亦作糧說文云糧儲也切韻云倉糧 也爾雅曰粻糧也郭注今江東通呼粮為粻).",
        "source": "T54n2129_003:0946b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麤獷(上倉孤反切韻疏也大也字統云鹿之性相背而食虞人獸害之故從三鹿俗省作麁義同下古猛反切韻大也字書云猛也說文云從犬廣聲又音俱永反)。",
        "translation": "Gritty (上倉孤反切韻疏也大也字統云之性相背而食虞人獸害之故從三鹿俗省作 蛛義同下古猛反切韻大也字書云猛也說文云從犬廣聲又又音俱永反).",
        "source": "T54n2129_003:0946b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蜇螫(上陟列反字書云蠍蜇蜂蠆毒也古文作虻下商隻反切韻蟲行毒也云地有螫毒不可觸其尾考聲云螫噬也嚙也古文作蠚)。",
        "translation": "Sting (上陟列反字書云蠍蜇蜂洗手毒也古文作虻下商隻反切韻虫行毒 也云地有 螫毒不可触其尾考聲云 螫噬也古文作 내).",
        "source": "T54n2129_003:0946b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "磣剌(上楚錦反又作墋說文云土石砂參也經文作磣非下郎遏反上言磣下剌令作糲切韻云[夕/鹿]也米之脫粟者也作此剌字[石*辛]也戾也非磣糲義也)。",
        "translation": "Spanking (up Chujin anti and also as a lazy boy, Shuowen Yun earth, stone, sand, also scriptures for spanking non-down Lang curb anti spanking in the upper language, under the rattling for the laguang cut rhyme clouds [yi / deer] also rice of the desiccated corn also made this rattling word [Shi * Xin] also hostile also non-spanking meaning).",
        "source": "T54n2129_003:0946c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捺落迦(梵語也或云那落迦此云苦器或云苦具即治罰罪人之器具地獄總名也故俱舍論云此下過二万無間深廣同上七捺落迦八增皆十六)。",
        "translation": "(Sanskrit word also or Nāroka this cloud is painful container or the tool of suffering that is the punishment of sinners the general name of the hell, so the Kushya śāstra cloud this under more than 20,000 depths of infinity the same as the above seven Nāroka eight increase are sixteen).",
        "source": "T54n2129_003:0946c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "湍馳(上他端反說文云淺水流沙上也字書云疾瀨也音落大反下直离反玉篇云馳逐也字書云馳騖也說文疾也從馬池省聲也)。",
        "translation": "Turbulent chase (上他端反說文云浅水流沙上也字書云疾瀨也音落大反下直离反玉篇云馳赶也字書云馳馳也說文快也從馬池省聲也).",
        "source": "T54n2129_003:0946c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淪溺(上力迍反字書沈也沒也爾雅曰小波為淪郭注云謂薀淪也下乃曆反切韻云溺水也說文沒也從水弱聲也古文作[仁-二+水]云人墮水也)。",
        "translation": "淪溺 (上力迍反字書沈也没 也爾雅曰小波為淪郭注云謂渺浪為淪 也下乃曆反切韻云溺水 也說文没 也從水弱聲 也古文作[仁-二+水]云人墮水也).",
        "source": "T54n2129_003:0946c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "灘渚(上他單反玉篇云河灘也爾雅曰太歲在申曰涒灘下章與反爾雅云水中可居者曰洲小洲日渚小渚曰沚又作陼音同上沚音止)。",
        "translation": "Tanzhu (上他單反玉篇云河灘也爾雅曰太歲在申曰涒灘下章与反爾雅云水可居者曰洲小洲日渚小渚曰 沚又作 綽 音同上 沚 音停止).",
        "source": "T54n2129_003:0946c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第三",
        "translation": "New Translation of the Ten Stages Sutra, Volume 3",
        "source": "T54n2129_003:0946c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捫摸(上莫盆反毛詩傳曰捫持也韻詮云捫搎也下音莫說文云摸[打-丁+索]也案捫搎摸[打-丁+索]猶摩挲也搎音孫[打-丁+索]音索挲音娑)。",
        "translation": "The first is the name of a group of people who are trained in the art of gnats and mosquitoes, and the second is the name of a group of people who are trained in the art of gnats and mosquitoes.",
        "source": "T54n2129_003:0946c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蚊蚋(上音文莊子云蟭螟巢於蚊眉下而稅反小蚊蚋說文云秦人謂之蚋楚人謂之蚊通俗文云蜎化為蚋也蜎音血緣反又作蚉蜹二形)。",
        "translation": "The mosquito (above sounding text Zhuangzi cloud mantis nests in the mosquito under the eyebrows and tax counter small mosquitoes Shuowen cloud Qin people called the mosquito Chu people called the mosquito Tongjian text cloud larvae transformed into mosquitoes also larvae sound blood edge counter also made the two forms of iggle).",
        "source": "T54n2129_003:0946c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "[蜣-儿+(鬼-(白-日+田))]蜋(上去羊反下呂張反爾雅釋蟲云蛣[蜣-儿+(鬼-(白-日+田))][蜣-儿+(鬼-(白-日+田))]蜋郭璞注云黑甲蟲也噉糞土者)。",
        "translation": "[蜣-儿+(鬼-(白-日+田))]蜋(上去羊反下呂張反爾雅釋蟲云蛣[蜣-儿+(鬼-(白-日+田))][蜣-儿+(鬼-(白-日+田))]蜋郭璞注云黑甲蟲也噉糞土者)。",
        "source": "T54n2129_003:0946c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策勵(上楚革反韻集云謀也籌也顧野王云馬撾也釋名曰策者教令於上駈策諸下也下力制反字書云兔也廣雅云勸勵也說文云力也從力厲形聲字厲音同上猛也列也又嚴整也)。",
        "translation": "Zaili (Shang chuge 反韻集云谋也籌也顧野王云马撾也釋名曰策者教令於上向上向上枷枷諸下也下力制反字書云兔也廣雅云勸勵也說文云力也從力厲形聲字厲聲同上猛 也列 也又又嚴整 也).",
        "source": "T54n2129_003:0946c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慍暴(上於問反切韻云怒也論語云人不知而不慍何晏注云慍怒也凡人有所不知君子不怒下蒲報反五經音義云謂侵暴說文云從日共音拱水音別作暴經文從田恭作暴甚乖字義也)。",
        "translation": "This is the first time I've ever heard of the word 慍暴 (上於問反切韻云怒也論言云人們不知而不慍何晏注云慍怒也凡人有所不知某君子不怒下蒲報反五經音義云謂侵暴說文云從日共音拱水音別作暴經文從田恭作暴甚乖字義也).",
        "source": "T54n2129_003:0946c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第四",
        "translation": "(The New Translation of the Ten Stages Sutra, Volume 4)",
        "source": "T54n2129_003:0946c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "箭鏃(上子賤反郭璞注爾雅云竹箭篠也字書云竹高一丈節間三尺可為矢也下作屋反爾雅曰金鏃翦羽謂鍭郭注云今之錍箭是也篠音蘇鳥反錍音普兮反)。",
        "translation": "The arrow (上子賤反郭璞注爾雅云竹箭篠也字書云竹高一丈節間三脚可矢也下作屋反爾雅曰金鏃翦羽謂鍭郭注云今之剪箭是也篠音蘇鳥反香剪音普兮反).",
        "source": "T54n2129_003:0946c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溟渤(上莫經反考聲云深也山海經云北海謂之溟說文云從水冥聲下蒲沒反玉篇渤澥也字書云海水渤渤然也)。",
        "translation": "Mingbo (上莫經反考聲云考声云深也山海經云北海謂之溟說文云從水冥聲下蒲沒反玉篇渤渤溪也字書云海水渤然也).",
        "source": "T54n2129_003:0946c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "厚膜(上胡口反切韻云重也廣也下音莫字統云皮內肉外謂之膜說文肉間[目*亥]膜也[目*亥]音古衰反)。",
        "translation": "Thick film (on the mouth of the mouth of the cut rhyme cloud heavy also broad also lower sound Mo word tally cloud skin inside the flesh outside is called the film Shuowen flesh between [eyes * hai] film also [eyes * hai] sound ancient failure).",
        "source": "T54n2129_003:0947a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "纏裹(上直連反考聲云繞也束也說文云纏約也從糸廛聲下光火反考聲云包也說文云裹纏也從衣果聲也俗作畏訛略字也)。",
        "translation": "(上直連反考聲云绕也束也說文云纏約也從糸糸聲下光火反考聲云包也說文云包纏也從衣果聲也俗作畏訛略字也).",
        "source": "T54n2129_003:0947a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "印璽(上正作[爪*(ㄗ@、)]釋名曰印信也因也封物因付信也下斯氏反蔡雍獨斷曰天子之璽以玉[螘-豆+虫]虎劒古者諸侯共之月令曰秦以前諸侯鄉大夫皆曰璽自茲以降天子獨稱璽諸侯不敢用也傳璽譜云秦王子嬰上高祖傳國璽李斯所篆其文曰受命於天帝壽永昌也[螘-豆+虫]音勅支反)。",
        "translation": "Seal (上正作[爪*(ㄗ@,)]釋名曰印信也因也封物因付信也下斯氏反蔡雍獨斷曰天子之璽以玉[螘-豆+虫]虎虎之古者諸侯共之月令曰秦以前諸侯鄉大夫皆称璽自在此降天子獨稱璽諸侯不敢用也傳璽譜云秦王子嬰上高祖傳國璽李斯所印其文曰受命於天帝壽永昌也[螘-豆+虫]音勅支反).",
        "source": "T54n2129_003:0947a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "癲癎(上丁堅反廣雅云癲狂也毛詩箋云癲病也聲類云癲風病也或作瘨下音閑集訓云小兒癲病說文云風病也從疒間聲或作[癇-月+木]亦通)。",
        "translation": "Epilepsy (上丁堅反廣雅云癲狂也毛詩箋云癲病也聲類云癲风病也或作瘨下音閑集訓云小兒癲病說文云风病也從疒間聲或作[癇-月+木]也通).",
        "source": "T54n2129_003:0947a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蟲[屮/工/毋](上直躬反說文從三虫音許鬼反並二虫為[虫*虫]音昆爾雅曰有足謂之蟲無足謂之豸音文爾反今俗借虫為蟲下徒沃反切韻痛也害也考聲云苦也說文云從屮作[屮/工/毋]屮音母列反)。",
        "translation": "The bug [sprouts/work/no] (上直躬反說文從三虫音許鬼反並二虫為[bug*虫] 音昆爾雅曰有足謂之蟲 无腳謂之豸 音文爾反今俗借虫为蟲下徒沃反切韻也痛也害也考聲云苦也說文云從屮作[sprouts/work/no] sprouts 音母列反).",
        "source": "T54n2129_003:0947a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "呪詛(上又作祝詶二形音之受反說文云詶亦詛也下側據反古文作[樝-木+示]釋名云祝屬也以善惡之辭相屬著也詛謂使人行事阻限於言也說文云從言且聲音子余反經文從口作咀音才與反非)。",
        "translation": "The curse (also cited above as a wish, a reply, a sound, and a response.",
        "source": "T54n2129_003:0947a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眩瞖(上玄絹反賈注國語眩惑也蒼頡篇示之不明也說文云目無常主下於計反郭璞云瞖掩覆也考聲云目中瞖也說文云從目殹聲也音一奚反經文從羽作翳非眩瞖義也)。",
        "translation": "Dazzling cataracts (上玄絹反賈注國語眩惑也蒼頡篇示之不知道也說文云目無常主下於計反郭璞云蘊掩覆也考聲云目中提胡胡 也說文云從目中提生也音一奚反經文從羽作翳非眩淑儀義也).",
        "source": "T54n2129_003:0947a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "溉灌(上基懿反韻英云澆灌也說文溉示灌也顧野王云溉猶灌注也下古玩反切韻云漬也亦澆灌也二並形聲字)。",
        "translation": "Irrigate (上基懿反韻英云灌水也說文灌水示灌也 顧野王云灌水猶灌注也下古玩反切韻云漬也宁波灌也二並形聲字).",
        "source": "T54n2129_003:0947a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "號嘷(二字同音胡刀反上號爾雅曰舞號雩也說文哭也作唬同下嘷玉篇叫也說文作獋虎怒聲也亦作[囉-維+(((嘹-口)-小)-日+干)]字也)。",
        "translation": "Horn (two words with the same sound Hu knife counter on the horn Ersa said dance horn summer also Shuowen cried also made bluff with the lower 鈥淚u chapter shout also Shuowen for the sound of the tiger anger also made [Lo-vi + (((loud - mouth) - small) - day + dry)] word also).",
        "source": "T54n2129_003:0947a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "喟歎(上口愧反說文大息歎聲又作[(扁-戶+├)*又]爾雅曰息也又音口恠反下他旦反切韻云歎息也又作嘆傷也)。",
        "translation": "Twangs (上口愧反說文大息歎聲又作[(扁-戶+├)*又]爾雅曰息 也又音口恠反下他旦反切韻云歎息 也 也作嘆傷 也).",
        "source": "T54n2129_003:0947a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吁嗞(上況于反切韻疑恠之詞也下子之反切韻云嗞嗟憂聲也爾雅作咨云嗟咨[肆-聿+差]也郭注云今河北人云嗟歎[肆-聿+差]音嗟)。",
        "translation": "(The upper case is inversion, the lower case is doubtful, and the lower case is doubtful, the sound of sighing is also inversion, and the lower case is sighing.",
        "source": "T54n2129_003:0947a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第五",
        "translation": "(The New Translation of the Ten Stages Sutra, Volume 5)",
        "source": "T54n2129_003:0947a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廁填(上初史反切韻廁間也下唐賢反宜作瑱字漢書訓纂云謂珠玉[猒/土]坐為飾也又音唐見反今經作填乃是填塞之填非間飾義)。",
        "translation": "廁填 (上初史反切韻廁間也下唐賢反宜作瑱字漢書訓纂云謂珠玉[拄/土] 坐為飾 也又音唐見反今經作填乃是填塞之填 不是間飾義).",
        "source": "T54n2129_003:0947a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瞬息(上式[門@壬]反說文云目動睫也考聲云目搖動也謂眸子轉也又作瞚眴義同下相即反藥證病源云凡人晝夜共一萬三千三百息一息有差即為病矣梵云阿那鉢那此云出息入息也)。",
        "translation": "The momentary respiration (上式[門@壬]反說文云目動睫也考聲云目搖動 也謂眼子轉 也作 讠悶義同 下相即反藥證病源云凡人晝夜共一千三千300息一息有差即是病矣上架云云Anapāna 此云出息入息也).",
        "source": "T54n2129_003:0947b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第六",
        "translation": "(The New Translation of the Ten Stages Sutra, Volume 6)",
        "source": "T54n2129_003:0947b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "[寤-吾+告]寤(上音教正作覺蒼頡篇云寐起也下吾故反說文覺而有信也寤亦晤也經文二字從穴作窹窹非也說文從[寐-未+夢]晤省)。",
        "translation": "[wake-go + tell] waking (the upper phonetic teaching is correctly made Jue Cangjie Psalm cloud sleep arises, the lower Ou therefore anti-Speaking text Jue and have faith also waking also meet the two words of the scriptures from the cave for the open and not from [sleep - not + dream] Thames, the Shuowen from [sleep - not + dream] province).",
        "source": "T54n2129_003:0947b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開闡(上可哀反韻集云開闢也說文啟也從門幵聲從井作開俗用非正下昌善反玉篇亦開也揚也韻英明也教也)。",
        "translation": "Kai Chanshi (上可哀反韻集云開開開也說文啟也從門幵聲從井作開俗用非正下昌善反玉篇亦開也揚也韻英也教也).",
        "source": "T54n2129_003:0947b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遽務(上渠預反賈注國語云遽疾也玉篇云遽急也下亾遇反切韻事務也爾雅云騖務強也郭注云馳騖事務皆自免強也)。",
        "translation": "hurrying (上渠預反賈注国語云 hurrying 也玉篇云 hurrying 也下 寨遇反切韻事務也爾雅云務強也郭注云馳事務皆自免強也).",
        "source": "T54n2129_003:0947b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "駛流(上所吏反蒼頡篇云駛速疾也從馬史聲也經文作駛音古穴反駃騠馬名非駛疾義下流字說文從水從[梳-木]音他忽反倒[巢-果+子]也[巢-果+子]音子經文作流非也古文又作[泳-永+不]騠音柱奚反良馬也生走乃母)。",
        "translation": "The word 駛流 (上所吏反蒼頡篇云駛速疾也從馬史聲也經文作駛音古穴反騠駃馬名非駛疾義下流字說文從水從[comb-wood] 音他忽反倒[巢-果+子] 也[巢-fruit+子] 音子經文作流非也古文又作[泳-yong+不]騠音柱奚反良馬也生走乃母).",
        "source": "T54n2129_003:0947b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第七",
        "translation": "(The New Translation of the Ten Stages Sutra, Volume 7)",
        "source": "T54n2129_003:0947b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "那庾多(中羊主反梵語也或云那由他西域數名也案黃帝筭經有二十三數自萬已去皆有上中下三等數也謂萬億兆京姟秭壤溝[澗-日+月]正載也下數十十變之中數百百變之上數億億變之案慧苑音義花嚴經阿僧祇品云一百洛叉為俱胝即當此億也俱胝俱胝為阿庾多即當此兆也阿庾多阿庾多為那由他即當此京也餘皆准知配之)。",
        "translation": "Nayuta (Sanskrit, or Nayuta as the Western name for the number of people in the Yellow Emperor's Prātimokṣa Sutra, there are twenty-three numbers, and since then there have been three higher, middle, and lower numbers, which are ten thousand million trillion kings, ten changes, middle, and ten hundred changes, and the number above the hundred hundred hundred changes, billion billion changes, and Huiyuan's Sounds and Meanings, Huayan's Sutra of the Asaṅgata Chapter, one hundred lokas are kuṭa, which is equivalent to this billion, and kuṭa and kuṭa are ayuta, which is equivalent to this trillion, and ayuta and ayuta are Nayuta, which is equivalent to this king, and the rest are known together.",
        "source": "T54n2129_003:0947b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幽邃(上於虬反切韻深也隱也爾雅曰幽深也說文從山[茲-卄]聲[茲-卄]音同上說文云微也下私醉反說文云邃深遠也古文又作[怡-台+(隊-(阿-可))]音訓同)。",
        "translation": "Profound (上於虬反切韻深也隱也爾雅曰幽深也說文從山[茲-20]声[茲-20]音同上說文云微也下私醉反說文云深厚深远也古文又作[怡-台+(隊-(阿-可))]音訓同).",
        "source": "T54n2129_003:0947b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羈繫(上居宜反釋名云絡馬頭曰羈縻馬足曰絆下古詣反玉篇云繫縛也又閇也)。",
        "translation": "Detain (上居宜反釋名云絡馬頭曰羈 tie 馬足曰絆 下古詣反玉篇云繫縛也又入入入 也).",
        "source": "T54n2129_003:0947b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誨誘(上荒外反韻英云訓也教也論語云誨人不倦也下與久論語云循循善誘人也玉篇云引導也切韻該也音古泫反泫胡詃反又教也說文從言秀形聲也)。",
        "translation": "To teach and induce (Up Araowai opposing the rhyme, Yinying teaches, and Analects says, \"Teach people not to tire,\" down with long, Analects says, \"Follow and skillfully induce people,\" and Yuxiao says, \"Guide,\" and Chyun should sound like Gohan opposing Hyun Huo opposing the rhyme, and also teaches, Shuowen following the words, \"Show,\" and the form sounds).",
        "source": "T54n2129_003:0947b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第八",
        "translation": "(New Translation of the Ten Stages Sutra, Vol. 8)",
        "source": "T54n2129_003:0947b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "暉昱(上許歸反切韻曰光也又作輝輝皆同下余六反爾雅云昱明也切韻云光也說文從日立聲)。",
        "translation": "The name of the building is a reference to the building that was built in the early 20th century.",
        "source": "T54n2129_003:0947b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "靉靆(上音愛下音逮廣雅曰靉靆翳薈也薈音烏外反謂雲興盛也通俗文云雲覆曰為靉靆也)。",
        "translation": "The first thing you need to do is to get a copy of the book.",
        "source": "T54n2129_003:0947b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "駭蹙(上閑揩反廣雅曰駭起也夫驚者其心必舉舉即起也說文從馬亥聲下子六反切韻云促近也說文云迫急也從戚足聲也)。",
        "translation": "The first thing he did was to get up, and the second thing he did was to get up, and the second thing he did was to get up, and the second thing he did was to get up, and the second thing he did was to get up, and the second thing he did was to get up.",
        "source": "T54n2129_003:0947b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新譯十地經卷第九",
        "translation": "(New Translation of the Ten Stages Sutra, Volume 9)",
        "source": "T54n2129_003:0947c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棽儷(上勅林反玉篇曰木枝而儷也說文木長儷也從林今聲下郎計反字統云伉儷也亦宏壯也棽又音森林二音今並不取)。",
        "translation": "Woolly (Upper Imahirin Anti-Yuqie said the wood branch and the lily also Shuowen wood long lily also from the sound of the forest now lower Langqi Anti-Zigong Yun couple also woolly and also sound forest two sounds now is not taken).",
        "source": "T54n2129_003:0947c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩[醠-央+兮](下又作醯同呼鷄反梵語也具足應云摩醯首羅此云大自在也即色界主大自在天王是也)。",
        "translation": "Mahêśvara (Śākyamuni) (Sanskrit: Mahêśvara, the lord of the form realm, is also the king of the Mahêśvara gods).",
        "source": "T54n2129_003:0947c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鈿廁(上徒年反玉篇金花鈿也下初吏反切韻云閒下也說文云雜廁也)。",
        "translation": "(1) Ṛdanīya (2) Ṛdanīya (2) Śrīlabdha (3)",
        "source": "T54n2129_003:0947c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十力經一卷",
        "translation": "Shili jing (Ten Powers Sutra) 1 vol.",
        "source": "T54n2129_003:0947c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎別(上案玉篇音初八反案經合作差字故經云種種欲樂勝解差別今云剎別恐因聲誤寫請諸高識再詳經意)。",
        "translation": "*Jaebie (the above case is a case of the first eight repetitions of the sound of the Jade Volumes, a case of sūtras cooperating with different words, so the sūtras say various kinds of desires, pleasures, and resolve differences.)",
        "source": "T54n2129_003:0947c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迴向輪經一卷",
        "translation": "Sutra of the Revolving Wheel (1 volume)",
        "source": "T54n2129_003:0947c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "資糧(上即夷反玉篇助也切韻云資亦貨財也下呂張反亦作糧案資糧謂諸大士欲趣菩提涅盤二轉依果先修福德智慧二種資粮也)。",
        "translation": "accumulation (上即夷反玉篇助也切韻云資亦貨財 也 下呂張反亦作糧案資糧指諸大士欲 destination菩提涅盤二轉依果先修福智二種資粮也).",
        "source": "T54n2129_003:0947c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無怙(上亾夫反古文奇字作无像天屈西北角也有本作旡音既非无字也下胡古反爾雅曰怙恃也詩云無父何怙無母何恃)。",
        "translation": "fatherless (above, the ancient word śaofu is rendered as 無像, and there are texts that render it as おおお (choke), which is not a word for fatherless (below, Hugu), which is rendered as 怙 (father) and 卍 (mother)).",
        "source": "T54n2129_003:0947c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忿恨(上正作忿音[敷-方+寸]粉反切韻怒也亦音[敷-方+寸]問反下胡艮反切韻恨怨也恚也)。",
        "translation": "Wrath (上正作怒音[敷-方+寸]粉反切韻怒也音[敷-方+寸]問反下胡冠反切韻恨怨 也怒也恚).",
        "source": "T54n2129_003:0947c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竝將(上音滿逈反正體並字也切篇比也說文云二人同立也下即羊反爾雅曰將送也考聲將大也助也說文云從[炙-火]寸爿聲也[炙-火]音肉爿音牆經文作捋俗字非正)。",
        "translation": "Together (the upper sound is full of large in anyway the essence and the word also cut than also Shuowen Yun two people together to establish also the lower that is sheep anti Ershiya said will send also Kao sound will be large also help also Shuowen Yun from [roasting - fire] inch valve sound also [roasting - fire] sound meat valve sound wall scriptures for stroking vulgar word is not correct).",
        "source": "T54n2129_003:0947c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "續一切經音義卷三",
        "translation": "(Continuation of the Pronunciations of all the Scriptures, Volume 3",
        "source": "T54n2129_003:0947c17_0",
        "is_bad_quality": false
    }
]