[
    {
        "source_sentence": "南海寄歸內法傳卷第二",
        "translation": "Nanhai yigui neifa zhuan, vol. 2",
        "source": "T54n2125_002:0212a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "翻經三藏沙門義淨撰",
        "translation": "By Yijing, the Tripiṭaka monk who translated the scriptures",
        "source": "T54n2125_002:0212a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十衣食所須十一著衣法式",
        "translation": "ten necessities for food and clothing, and eleven requirements for dressing in the Dharma",
        "source": "T54n2125_002:0212a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二尼衣喪制十三結淨地法",
        "translation": "twelve rules for the confiscation of nuns' robes and thirteen rules for the purification of the grounds",
        "source": "T54n2125_002:0212a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四五眾安居十五隨意成規",
        "translation": "fourteen and five groups of people living in peace, and fifteen who follow the rules",
        "source": "T54n2125_002:0212a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六匙筋合否十七知時而禮",
        "translation": "sixteen spoonfuls of tendons, seventeen spoonfuls of reverence for the time",
        "source": "T54n2125_002:0212a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八便利之事",
        "translation": "eighteen expedient circumstances",
        "source": "T54n2125_002:0212a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十衣食所須",
        "translation": "ten necessities of food and clothing",
        "source": "T54n2125_002:0212a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "原夫有待累形，假衣食而始濟；無生妙智，託滅理而方興。",
        "translation": "It turns out that there's still a lot of form to be accumulated, which is first helped by clothing and food, and unborn marvelous wisdom, which is only produced by relying on the principle of cessation.",
        "source": "T54n2125_002:0212a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其受用乖儀，便招步步之罪；澄心失軌，遂致念念之迷。",
        "translation": "If someone deviates from the rules of sensation, it will cause a step-by-step sin, and if they lose the way to clarify their mind, it will cause a delusion in their mindfulness.",
        "source": "T54n2125_002:0212a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為此於受用中求脫者，順聖言而受用；在澄心處習理者，符先教以澄心。",
        "translation": "For this reason, those who seek liberation in the midst of experience should follow the noble words and experience them, and those who train in the principle at the level of the clarified mind should follow the prior teaching to clarify the mind.",
        "source": "T54n2125_002:0212a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即須俯視生涯是迷生之牢獄，仰晞寂岸為悟寂之虛關，方可艤法舟於苦津，秉慧炬於長夜矣。",
        "translation": "That is, they must look down on their career as the prison of delusion and birth and look up at the shore of quiescence as the virtual barrier of awakening and quiescence before they can sail their boat of the Dharma through the bitter waters and hold the torch of wisdom through the long night.",
        "source": "T54n2125_002:0212b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然於所著衣服之製、飲食之儀，若持犯昞然律有成則，初學之輩亦識重輕。",
        "translation": "However, if there are established rules for observing and violating the xiaoliang precepts regarding the clothing you wear and the manner in which you eat and drink, even those who are beginning to learn will know the relative seriousness.",
        "source": "T54n2125_002:0212b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此則得失局在別人，固乃無煩商搉。",
        "translation": "Here, the gains and losses are limited to others, so there's certainly no need to discuss them.",
        "source": "T54n2125_002:0212b05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自有現違律檢而將為指南，或可習俗生常謂其無過；或道佛生西國，彼出家者依西國之形儀，我住東川，離俗者習東川之軌則，詎能移神州之雅服，受印度之殊風者。",
        "translation": "If someone were to violate the precepts and become a guide, they might become accustomed to the ways and means of the secular world and say there's nothing wrong with them; or if they say that the Buddha was born in the West and that renunciant follows the ways and means of the West, and that I live in the Eastern River and that renunciant follows the ways and means of the Eastern River, how could they have moved from the elegant clothing of Shenzhou and accepted the distinctive customs of India?",
        "source": "T54n2125_002:0212b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聊為此徒，粗銓衡也。",
        "translation": "I'd like to make a rough judgment for these disciples.",
        "source": "T54n2125_002:0212b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡是衣服之儀，斯乃出家綱要，理須具題其製，豈得輕而略諸。",
        "translation": "These rituals of clothing are the essentials for renunciant monks, and they must be specifically tailored to fit the situation, so how could they be taken lightly and omitted?",
        "source": "T54n2125_002:0212b11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且如法眾三衣，五天並皆刺葉，獨唯東夏開而不縫。",
        "translation": "Furthermore, suppose the three garments of the Dharma community are all pierced with leaves in the five heavens, except in the eastern summer, when they are opened and not sewn.",
        "source": "T54n2125_002:0212b12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "親問北方諸國行四分律處，俱同刺葉，全無開者；西方若得神州法服，縫合乃披。",
        "translation": "I've personally asked about the places in the north where the four parts of the Vinaya are practiced, and they are all pierced with leaves and completely unbuttoned; in the west, if we were to obtain the Dharma robe of Shenzhou, it would be sewn shut before being worn.",
        "source": "T54n2125_002:0212b13_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸部律文皆云刺合。",
        "translation": "The texts of the various vinaya schools all say that it's pierced and closed.",
        "source": "T54n2125_002:0212b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然而充身六物，自有嚴條；十三資具，廣如律說。",
        "translation": "However, the six items that fill the body have their own strict rules, and the thirteen necessities are as explained in detail in the vinaya.",
        "source": "T54n2125_002:0212b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言六物者：一僧伽胝(譯為複衣也)、二嗢呾囉僧伽(譯為上衣也)、三安呾婆娑(譯為內衣也。",
        "translation": "The six items are: 1. a saṃghāṭī (translated as a double robe), 2. a saṃghāṭī (translated as an upper robe), and 3. anavāsa (translated as an inner robe).",
        "source": "T54n2125_002:0212b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之三衣皆名支伐羅。",
        "translation": "These three garments are all called cīvara.",
        "source": "T54n2125_002:0212b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方諸國多名法衣為袈裟，乃是赤色之義，非律文典語)、四波呾囉(鉢也)、五尼師但那(坐臥具也)、六鉢里薩囉伐拏(濾水羅也。",
        "translation": "In the northern countries, the vowel is called the reddish-colored robe, which is not a scriptural term), the fourth pārāvaṇa (bowl), the fifth nidāna (sitting and lying cloth), and the sixth pārṣaṇa (filtered water).",
        "source": "T54n2125_002:0212b20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受戒之時要須具斯六物也)。",
        "translation": "These six items should be available at the time of ordination).",
        "source": "T54n2125_002:0212b22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三資具者：一僧伽胝、二嗢呾囉僧伽、三安呾婆娑、四尼師但那、五裙、六副裙、七僧脚崎(掩腋衣也)、八副僧脚崎、九拭身巾、十拭面巾、十一剃髮衣、十二覆瘡疥衣、十三藥資具衣。",
        "translation": "The thirteen necessities are: 1. a saṃghāṭī, 2. a saṃghāṭī, 3. anavāsa, 4. a niṣīdana, 5. a skirt, 6. a secondary skirt, 7. a saṃghāṭī (armpit-covering robe), 8. a saṃghāṭī, 9. a body cloth, 10. a face cloth, 11. a hair-shaving robe, 12. a sore-and-scabies robe, and 13. a medicinal-supply robe.",
        "source": "T54n2125_002:0212b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌曰：「三衣并坐具，　　裙二帔有兩，　身面巾剃髮，　　遮瘡藥直衣。」",
        "translation": "The verse says, \"Three garments, a sitting cloth, a skirt and two capes, a body cloth and shaved hair, and a straight jacket for covering sores and scabies.\"",
        "source": "T54n2125_002:0212b29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三種衣，出家開畜。",
        "translation": "These thirteen kinds of clothing are for renunciant monks to lay claim to.",
        "source": "T54n2125_002:0212c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既有定格，即須順教用之，不比自餘所有長物。",
        "translation": "Since they have a set designation, they must be used in accordance with the teaching and not compared to other things that grow in their own possessions.",
        "source": "T54n2125_002:0212c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之十三，咸須別牒其事、點淨守持，隨得隨持無勞總足。",
        "translation": "Of these thirteen, each must be individually defined, ordered, purified, and maintained, so that whatever you can get and maintain without difficulty is sufficient.",
        "source": "T54n2125_002:0212c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘外長衣量事分別，若氈褥毯席之流，但須作其委付他心而受用也。",
        "translation": "The other long outer garments are discriminated according to their purpose, such as blankets, mats, and seats, but they must be entrusted to other minds for their use.",
        "source": "T54n2125_002:0212c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有云「三衣十物」者，蓋是譯者之意離為二處，不依梵本，別道三衣、析開十物。",
        "translation": "The expression \"three garments and ten things\" means that the translator's intention was to separate them into two places and not rely on the Sanskrit text, which separately describes the three garments and discerns the ten things.",
        "source": "T54n2125_002:0212c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其十數不能的委，致使猜卜皆悉憑虛，訓什為雜未符先旨。",
        "translation": "However, the ten items cannot be clearly identified, which causes guesses and divinations to be based on nothing, and the lectures are mixed, which doesn't match the prior intention.",
        "source": "T54n2125_002:0212c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其藥直衣，佛制畜者，計當用絹，可二丈許或可一疋。",
        "translation": "His medicinal robe, which the Buddha had made for use as an animal, should be made of silk, which could be two zhang or a bolt.",
        "source": "T54n2125_002:0212c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既而病起無恒，卒求難濟；為此制畜，可豫備之。",
        "translation": "Since illnesses arise indefinitely, it's difficult to get help after an attack; make animals for this purpose, so you can prepare for them.",
        "source": "T54n2125_002:0212c12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "病時所須，無宜輒用。",
        "translation": "It's not appropriate to use it lightly when you need it when you're ill.",
        "source": "T54n2125_002:0212c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然修行利生之門，義在存乎通濟。",
        "translation": "Still, the goal of cultivating the practice of improving sentient beings is to maintain the principle of universal relief.",
        "source": "T54n2125_002:0212c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既而根有三等，不可局為一途。",
        "translation": "Since there are three levels of faculties, they can't be confined to one path.",
        "source": "T54n2125_002:0212c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四依四作十二杜多，制唯上行；畜房受施十三資具，益兼中下。",
        "translation": "The four supports and four works and twelve dhūtas restrict only the upper practices, while the thirteen necessities of accepting gifts in the monk's quarters benefit both the middle and lower classes.",
        "source": "T54n2125_002:0212c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂使少欲者無盈長之過，多求者亡闕事之咎。",
        "translation": "As a result, those who desire little will have no fault of excess and growth, and those who seek much will lose the blame of lacking work.",
        "source": "T54n2125_002:0212c17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大哉慈父！",
        "translation": "Great is the father of loving-kindness!",
        "source": "T54n2125_002:0212c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "巧應根機，善誘人天，稱調御者。",
        "translation": "He skillfully responds to faculties and abilities, skillfully entices humans and gods, and is called a tamer.",
        "source": "T54n2125_002:0212c18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而云供身百一，四部未見律文。",
        "translation": "He says he makes offerings to the body of the hundred and one, but there are four divisions of the text that aren't found in the Vinaya.",
        "source": "T54n2125_002:0212c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復經有其言，故是別時之意。",
        "translation": "Although the sūtras again say this, it's the meaning of a different time.",
        "source": "T54n2125_002:0212c19_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且如多事俗徒家具尚不盈五十，豈容省緣釋子翻乃過其百數？",
        "translation": "Moreover, if the furniture of a lay audience doesn't exceed fifty, how could the Śākyamuni, a man of provincial conditions, have turned over more than a hundred of them?",
        "source": "T54n2125_002:0212c20_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "准驗道理，通塞可知。",
        "translation": "By examining the principle, we can see that it's completely obstructed.",
        "source": "T54n2125_002:0212c22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡論絁絹，乃是聖開，何事強遮徒為節目，斷之以意欲省招繁。",
        "translation": "When it comes to rough silk, it's a holy opening, so why is it forced to cover up a vain show and cut it off with the intention of saving trouble?",
        "source": "T54n2125_002:0212c22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五天四部並皆著用，詎可棄易求之絹絁，覓難得之細布。",
        "translation": "Since the five celestials and four divisions of the Buddhist canon are all attached to each other, how could we abandon easily found silk and linen and seek out a difficult-to-obtain fine cloth?",
        "source": "T54n2125_002:0212c24_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妨道之極，其在斯乎。",
        "translation": "Herein lies the ultimate obstruction to the way.",
        "source": "T54n2125_002:0212c25_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非制強制，即其類也。",
        "translation": "It's not compulsory, that is, it's similar.",
        "source": "T54n2125_002:0212c26_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遂使好事持律之者，增己慢而輕餘；無求省欲之賓，內起慚而外恧。",
        "translation": "As a result, those who are good disciplinarians will become more conceited and despise the rest, and those who have no desire to save themselves will become internally conscience-stricken and outwardly defiant.",
        "source": "T54n2125_002:0212c26_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯乃遮身長道，亦復何事云云。",
        "translation": "This is what will prevent them from pursuing the long road, and what else will it do?",
        "source": "T54n2125_002:0212c28_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而彼意者，將為害命處來，傷慈之極。",
        "translation": "Their intentions are to harm life and come to the point of harming kindness.",
        "source": "T54n2125_002:0212c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悲愍含識，理可絕之。",
        "translation": "It's reasonable to cut off compassionate inclusion of consciousness.",
        "source": "T54n2125_002:0212c29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾者，著衣噉食緣多損生，螻蚓曾不寄心，蛹蠶一何見念？",
        "translation": "If that's the case, wearing clothes and devouring food are conditions that often harm life, and there's never a time when an earthworm didn't attach its mind to a silkworm's chrysalis.",
        "source": "T54n2125_002:0213a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其總護者，遂使存身靡託、投命何因！",
        "translation": "If he had protected them, what would have been the reason for leaving his body and throwing his life away?",
        "source": "T54n2125_002:0213a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以理推徵，此不然也。",
        "translation": "By inference, this is not the case.",
        "source": "T54n2125_002:0213a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有不噉酥酪、不履皮鞋、不著絲綿，同斯類矣。",
        "translation": "Not gnawing butter and cheese, not wearing leather shoes, and not wearing silken fabrics are the same sort.",
        "source": "T54n2125_002:0213a04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡論殺者，先以故意，斷彼命根，方成業道；必匪故思，佛言無犯。",
        "translation": "Whenever someone discusses killing, they first do it intentionally, cutting off their life root before they can achieve the path of karma; it must not be deliberate, but the Buddha says there's no transgression.",
        "source": "T54n2125_002:0213a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三處清淨制在亡愆，設乖斯旨但招輕過，無殺心故因乃極成。",
        "translation": "The three places of purity are limited to deadly transgressions, so if we go against this intention, we'll only incur minor transgressions, and the lack of a killing mind makes the cause perfectly valid.",
        "source": "T54n2125_002:0213a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶若受餘喻便彰著。",
        "translation": "It's like accepting another metaphor and then making it clear.",
        "source": "T54n2125_002:0213a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因喻既其明白無過，依宗自顯。",
        "translation": "Since the reason and the parable are so clear and without error, they are self-evident based on the doctrine.",
        "source": "T54n2125_002:0213a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三支道理且已皎然，況復金口自言！",
        "translation": "How could Chrysostom say this on his own when the principle of the three parts is already clear?",
        "source": "T54n2125_002:0213a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何勞更為穿鑿，遂使五日之疑出於作者之筆，三豕之謬傳乎信受之言。",
        "translation": "Why bother to further drill, so that the five days of doubt will come out of the author's pen, and the three boars' error will be transmitted through the words of those who believe and accept them?",
        "source": "T54n2125_002:0213a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其自乞生繭、目驗損蟲，斯則俗士尚不應行，何況情希出離。",
        "translation": "If they were to beg for their own cocoon and examine the worms with their eyes, then secular people still shouldn't do it, let alone those who wish to leave.",
        "source": "T54n2125_002:0213a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引斯為證，深成未可。",
        "translation": "To cite this as proof is profoundly unacceptable.",
        "source": "T54n2125_002:0213a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有施主淨意持來，即須唱導隨喜以受之，用資身而育德，實無過也。",
        "translation": "If a donor comes with pure intention to accept it, then he must sing, guide, and follow along with joy, using it to support himself and cultivate virtue, which is really not wrong.",
        "source": "T54n2125_002:0213a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五天法服，任刺任縫。",
        "translation": "The five heavenly ceremonial garments are pierced and sewn at will.",
        "source": "T54n2125_002:0213a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣縷不問縱橫，為日無過三五。",
        "translation": "The strands of clothing are made regardless of length or breadth, and there are no more than three or five days in which they are worn.",
        "source": "T54n2125_002:0213a16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "計絹一疋作得七條五條，內葉三指、外緣一寸，外緣有刺三道，內葉悉皆縫合。",
        "translation": "A bolt of silk is made into seven strips of five, with the inner leaves three fingers and the outer edge an inch, and the outer edge has three thorns; the inner leaves are all sewn together.",
        "source": "T54n2125_002:0213a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "充事表儀，亦何假精妙？",
        "translation": "How could it be considered subtle to fill out a situation with respect to appearance?",
        "source": "T54n2125_002:0213a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若著納衣者，意存省事，或拾遺於糞聚、或取棄於屍林，隨得隨縫，用祛寒暑耳。",
        "translation": "Those who wear robes made of nappies want to save themselves trouble, so they might scavenge a rubbish heap or pick up and discard a corpse in the forest, sewing as they go along to help ward off cold and heat.",
        "source": "T54n2125_002:0213a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有說云「律中臥具，即是三衣。」",
        "translation": "It's also said, \"The bedding in the Vinaya is the three garments.\"",
        "source": "T54n2125_002:0213a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見制野蠶便生異意，剩謂法衣非絹，遂即覓布慇懃。",
        "translation": "Seeing the silkworm being made, they then became disillusioned, saying that the Dharma robe was not made of silk, and so they sought out cloth and courted it.",
        "source": "T54n2125_002:0213a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧委本文元來是褥，高世耶乃是蠶名，作絹還受斯號，體是貴物，制不聽用。",
        "translation": "Rather, this is the original text, which is a mattress, and Goshya is the name of a silkworm, which is made of silk and still receives this name, because it's a valuable thing that's made and not listened to.",
        "source": "T54n2125_002:0213a23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作褥之法有其兩種：或縫之作袋貯毛在中，或可用絲織成，即是氍毺之類。",
        "translation": "There were two ways of making a mattress: either it was sewn together and made into a bag to store wool in, or it could be woven from silk, which was a type of wool.",
        "source": "T54n2125_002:0213a25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其褥樣闊二肘長四肘，厚薄隨時。",
        "translation": "The mattress is about two elbows wide and four elbows long, and it's as thick or as thin as you like.",
        "source": "T54n2125_002:0213a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自乞乃遮，他施無罪。",
        "translation": "He himself begs for it to be covered, but it's not a crime for others to give it to him.",
        "source": "T54n2125_002:0213a28_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "全不許用者，大事嚴科。",
        "translation": "Those who don't permit their use at all are subject to great rigor.",
        "source": "T54n2125_002:0213a28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸敷具，非三衣也。",
        "translation": "These spreads are not the three garments.",
        "source": "T54n2125_002:0213a29_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復律云正命，謂是口腹為先。",
        "translation": "Furthermore, the compound precept says that right livelihood is the priority of food and drink.",
        "source": "T54n2125_002:0213a29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耕墾須得其宜、種植無違教網，應法食用不生其罪，始曰立身能長其福。",
        "translation": "Plowing must be appropriate, planting must not contradict the web of the teaching, and eating according to the teaching doesn't give rise to sins; it's then said that establishing oneself will grow one's fortune.",
        "source": "T54n2125_002:0213b01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依如律教，僧家作田須共淨人為其分數，或可共餘人戶，咸並六分抽一。",
        "translation": "According to the Vinaya's teaching, a monk's family must work a plot of land with a pure person as its portion, or they may work with another household and draw one out of six.",
        "source": "T54n2125_002:0213b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧但給牛與地，諸事皆悉不知。",
        "translation": "The saṃgha simply gives the ox and the land, not knowing anything about it.",
        "source": "T54n2125_002:0213b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或可分數量時斟酌，西方諸寺多並如是。",
        "translation": "They might consider the amount of land to be given at a certain time, as many western monasteries do.",
        "source": "T54n2125_002:0213b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有貪婪不為分數，自使奴婢躬撿營農，護戒苾芻不噉其食。",
        "translation": "Some monks may be greedy and don't consider their share, so they send their own slaves and maids to gather food for the farm, while the monks protecting the precepts don't eat their food.",
        "source": "T54n2125_002:0213b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意者以其僧自經理邪命養身、驅使傭人非瞋不可、壞種墾地蟲蟻多傷；日食不過一升，誰復能當百罪？",
        "translation": "They think it's because their monks themselves manage to support themselves with evil livelihoods, drive their servants around without anger, and destroy seeds and plow fields where insects and ants are often injured; their daily diet is only a liter, so who could possibly take on a hundred sins?",
        "source": "T54n2125_002:0213b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是以耿介之士疾其事繁，携瓶挾鉢棄之長鶩，獨坐靜林之野、歡與鳥鹿為儔，絕名利之諠囂、修涅槃之寂滅。",
        "translation": "That's why a determined person hates the hustle and bustle of their work, so they carry their flasks and bowls and discard them as long-shot picks, sit alone in a quiet forest field, enjoy the company of birds and deer, cut off the clamor of fame and profit, and cultivate the tranquility of nirvāṇa.",
        "source": "T54n2125_002:0213b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若為眾家經求取利，是律所聽，墾土害命教門不許。",
        "translation": "If he were to seek profit for the scriptures of many families, this is what the Vinaya hears, and the doctrinal approach of plowing up land and harming life doesn't approve of it.",
        "source": "T54n2125_002:0213b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "損蟲妨業，寧復過此！",
        "translation": "How could it be more harmful to insects and hinder their activities?",
        "source": "T54n2125_002:0213b14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有罪邪生之十頃，著作則不見為疎條；無過正行之三衣，還復幾勞於文墨？",
        "translation": "How much more labor is there in writing and calligraphy when there are ten hectares of wrong livelihoods and writings that don't reveal the paucity of the three garments of right practice?",
        "source": "T54n2125_002:0213b15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嗚呼！",
        "translation": "Whoo-hoo!",
        "source": "T54n2125_002:0213b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可為信者說，難與疑者言，由恐傳法之家尚懷固執耳。",
        "translation": "It's explicable for the believer but difficult to discuss with the doubter, for fear that the house that transmits the teaching will still harbor stubbornness.",
        "source": "T54n2125_002:0213b17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初至耽摩立底國，寺院之外有一方地，忽見家人取菜，分為三分：與僧一分：自取兩歸。",
        "translation": "When I first arrived in Tāmralipti, I saw a family member outside the monastery grounds taking vegetables and dividing them into three parts: one for the saṃgha and two for himself.",
        "source": "T54n2125_002:0213b18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未解其故：問大乘燈法師曰：「斯何意焉？」",
        "translation": "Not understanding the reason, he asked the Dasheng Deng fashion master, \"What does this mean?\"",
        "source": "T54n2125_002:0213b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「此寺僧徒並多戒行，自為種植大聖所遮。",
        "translation": "They replied, \"The monks and their followers at this temple often practice precepts, which are obscured by the great sage who planted them himself.",
        "source": "T54n2125_002:0213b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是以租地與他、分苗而食，方為正命省緣自活，無其耕墾溉灌殺生之罪矣。」",
        "translation": "That's why they rent land to others and share the seedlings for food, so they can live by right livelihood and save themselves from the sin of plowing, irrigating, and killing people.\"",
        "source": "T54n2125_002:0213b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見知事苾芻，晨旦井邊觀水，無蟲得用；一日有命，即須羅濾。",
        "translation": "They also see a monk who knows the duties of the monk's office and observes the water at the well in the morning, saying, 'No worms can use it; one day there's life, that's when it's filtered.'",
        "source": "T54n2125_002:0213b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見但是外人取與，下至一莖之菜，並須問眾方用。",
        "translation": "I also saw that outsiders would only take and give vegetables down to a single stalk, and they would have to ask the people about their use.",
        "source": "T54n2125_002:0213b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見寺內不立綱維，但有事來合眾量許。",
        "translation": "It's also seen that there's no monastic code inside the temple, but only that something comes to be accepted by the people.",
        "source": "T54n2125_002:0213b27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若緣獨意處斷隨情、損益僧徒不遵眾望者，此名俱羅鉢底，眾共驅之。",
        "translation": "If a monk or nun stops following their own thoughts or gains and losses and doesn't follow the expectations of the crowd, this is called a kula-pati, and the crowd drives it out together.",
        "source": "T54n2125_002:0213b28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見尼入僧寺，白乃方前。",
        "translation": "He also saw a nun enter the saṃgha's temple and tell him to come forward.",
        "source": "T54n2125_002:0213c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧向尼坊，問而後進。",
        "translation": "The saṃgha goes to the nun's quarters, asks questions, and then enters.",
        "source": "T54n2125_002:0213c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若出寺外，兩人方去。",
        "translation": "If he goes outside the temple, the two of them will then leave.",
        "source": "T54n2125_002:0213c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必有緣事須至俗舍者，白眾許已，四人共去。",
        "translation": "If there must be a reason why they need to go to a secular home, they tell the crowd that they approve, and then four of them go together.",
        "source": "T54n2125_002:0213c02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見每月四齋之日，合寺大眾晡後咸集俱聽寺制，遵而奉行深生敬仰。",
        "translation": "I also saw that on the fourth day of the month when he observed the four days of fasting, the whole temple community gathered after the afternoon to listen to the temple's rules, and they respected them deeply as they were observed and practiced them.",
        "source": "T54n2125_002:0213c03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見有一小師，遣其童子將米二升送與家人婦女，情涉曲私。",
        "translation": "I also saw a young master who sent his boy to give two liters of rice to the women of his family, which was a misdeed.",
        "source": "T54n2125_002:0213c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人告眾，喚來對勘。",
        "translation": "Someone told the crowd about it and summoned them for a comparison.",
        "source": "T54n2125_002:0213c06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三皆承引。",
        "translation": "All three of them accepted the offer.",
        "source": "T54n2125_002:0213c07_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖無惡事，而自負慚心，即出寺門棄名長去，師遣餘人送彼衣物。",
        "translation": "Although he had done nothing wrong, he was so ashamed of himself that he left the temple gate, abandoned his name, and left.",
        "source": "T54n2125_002:0213c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但是眾法共遵，未勞官制。",
        "translation": "However, they all followed the rules together and didn't bother to follow the official's rules.",
        "source": "T54n2125_002:0213c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見婦人入寺，不進房中，廊下共語，暫時便去。",
        "translation": "He also saw a woman enter the temple, but she didn't go into her room; she talked to him in the hallway and left for a while.",
        "source": "T54n2125_002:0213c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見寺內有一苾蒭，名曷羅戶羅蜜呾羅，于時年可三十，操行不群，名稱高遠。",
        "translation": "I also saw a monk inside the temple named Hārodhūrāmilā, who was about thirty years old at the time and had an attitude and conduct that was not typical of his peers and his name was lofty.",
        "source": "T54n2125_002:0213c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一日誦《寶積經》有七百頌。",
        "translation": "One day, he recited 700 verses from the Baoge Translation of the Sutra.",
        "source": "T54n2125_002:0213c12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閑內典之三藏，洞俗言之四明，東聖方處推為上首。",
        "translation": "He recited the three collections of the internal scriptures and the four tomes of the secular language, and he was esteemed as the best by the sages of the east and the directions.",
        "source": "T54n2125_002:0213c13_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自從受具，女人曾不面言，母姊設來出觀而已。",
        "translation": "Ever since he was ordained, the woman had never spoken to him face to face, except when his mother and sister asked him to come out and look around.",
        "source": "T54n2125_002:0213c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當時問曰：「斯非聖教，何為然乎？」",
        "translation": "She asked, \"Isn't this the noble teaching, why is it so?\"",
        "source": "T54n2125_002:0213c15_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰：「我性多染，非此不杜其源。」",
        "translation": "He replied, \"I'm defiled by nature, and I won't eliminate its source unless it's like this.\"",
        "source": "T54n2125_002:0213c16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復不是聖遮，防邪亦復何爽。",
        "translation": "Even though he's not a noble admonition, how could he be cool in preventing evil?",
        "source": "T54n2125_002:0213c17_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見多聞大德，或可一藏精研。",
        "translation": "They also see well-versed great virtues who might study one collection intensely.",
        "source": "T54n2125_002:0213c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾給上房，亦與淨人供使，講說尋常、放免僧事，出多乘輿，鞍畜不騎。",
        "translation": "They give them up to the monastery, make offerings to purified people, lecture about normalcy, relieve them of monastic duties, and send out many carts and mounts, not riding them.",
        "source": "T54n2125_002:0213c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見客僧創來入寺，於五日內，和眾與其好食，冀令解息，後乃僧常。",
        "translation": "When he sees a visiting monk who has recently entered the temple, the monks give him a nice meal within five days, hoping to make him calm down, and then he becomes a permanent member of the saṃgha.",
        "source": "T54n2125_002:0213c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是好人，和僧請住，准其夏歲，臥具是資。",
        "translation": "If he's a good person and the monk asks him to stay, he's allowed to spend the summer months there with this equipment for sleeping.",
        "source": "T54n2125_002:0213c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無學識，則一體常僧，具多聞乃准前，安置名掛僧籍同舊住人矣。",
        "translation": "If he has no training, then he'll become a monk in the same monastic community, and if he's well-versed, he'll be allowed to be installed as a named and registered monk, just like the people who used to live there.",
        "source": "T54n2125_002:0213c23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又見好心來至，具問因由。",
        "translation": "When he sees a well-meaning person come, he asks about the reason.",
        "source": "T54n2125_002:0213c24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如求出家，和僧剃髮。",
        "translation": "If they seek to leave home, they will shave their hair with the saṃgha.",
        "source": "T54n2125_002:0213c25_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名字不干王籍，眾僧自有部書。",
        "translation": "Their names didn't belong to the king's registry, and the saṃgha had their own writings.",
        "source": "T54n2125_002:0213c25_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後若破戒行非，鳴揵稚而驅遣。",
        "translation": "If they later violate the precepts and act wrongly, they'll sound a gandharva and drive them away.",
        "source": "T54n2125_002:0213c26_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為此眾僧自相撿察，起過難為萌漸。",
        "translation": "For this reason, the monks themselves examined each other, and it was difficult for mistakes to arise gradually.",
        "source": "T54n2125_002:0213c27_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "于時歎曰：「昔在神州自言明律，寧知到此反作迷人。",
        "translation": "They then praised him, saying, \"In the past, I said I understood the vinaya in Shenzhou, but I didn't know I'd become a charmer here.",
        "source": "T54n2125_002:0213c28_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "向若不移步西方，何能鑒斯正則！」",
        "translation": "If we hadn't moved to the West, how could we have discerned this right principle?\"",
        "source": "T54n2125_002:0213c29_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此乃或是寺家眾制，或是別行要心，餘並著在律文，末代住持極要。",
        "translation": "These are either the rules of the temple family or the essentials of a particular practice, the rest of which are written in the Vinaya, and the very essentials of the last abbot.",
        "source": "T54n2125_002:0214a01_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此皆是耽摩立底跋羅訶寺之法式也。",
        "translation": "These were all the rules of the Tāmraliptivārāha monastery.",
        "source": "T54n2125_002:0214a02_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其那爛陀寺，法乃更嚴，遂使僧徒數出三千、封邑則村餘二百，並是積代君王之所奉施。",
        "translation": "At Nālandā Temple, the Dharma became even more stringent, and it led to the creation of 3,000 monks and 200 villages, which were consecrated by numerous generations of kings.",
        "source": "T54n2125_002:0214a03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "紹隆不絕，非律而論者哉。",
        "translation": "It's not prescriptive to say that it's been proliferating unceasingly.",
        "source": "T54n2125_002:0214a05_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦未見有俗官乃當衙正坐，僧徒則為行側立，欺輕呼喚不異凡流，送故迎新幾倦途路；若點撿不到，則走赴公門、求命曹司，無問寒暑。",
        "translation": "I've never seen a lay official sitting squarely in office and a monk standing sideways, deceiving and calling out to ordinary people, sending away the old and welcoming the new, and almost tiring of the road; if they fail to find something, they go to the public office and seek orders from the superintendent, regardless of whether it's hot or cold.",
        "source": "T54n2125_002:0214a06_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫出家之人，本為情希離俗，捨五畏之危道、遵八正之平衢。",
        "translation": "A renunciant originally wants to leave the secular world in order to abandon the dangerous path of the five fears and follow the level streets of the eightfold path.",
        "source": "T54n2125_002:0214a09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈有反更驅馳重嬰羅網，欲求簡寂寧能遂意？",
        "translation": "How could he have gone further than to chase away the web of babies and seek peace and quiet and not have gotten what he wanted?",
        "source": "T54n2125_002:0214a11_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可謂全乖解脫、不順蕭然者乎。",
        "translation": "They can be called completely deviant and liberated, yet disobedient and indifferent.",
        "source": "T54n2125_002:0214a12_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理須二六杜多十三資具，隨緣濟命盪除舊習，報師僧父母之鴻澤，酬天龍帝主之深慈。",
        "translation": "In principle, they must have two or six dhūtas and thirteen necessities, follow the conditions for their lives, and clean up old habits to repay the greatness of their teachers, monks, and parents and the profound kindness of the gods, dragons, and emperors.",
        "source": "T54n2125_002:0214a13_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯則雅順調御之儀、善愜策修之路。",
        "translation": "This is the way to conduct yourself in an elegant and disciplined manner and to cultivate good discipline.",
        "source": "T54n2125_002:0214a15_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因論護命之事，且復言其現行。",
        "translation": "I'll discuss the matter of protecting life and return to its present state.",
        "source": "T54n2125_002:0214a16_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願諸大德勿嫌煩重耳。",
        "translation": "May I ask the great virtues not to take too much trouble with it.",
        "source": "T54n2125_002:0214a16_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然四部之殊，以著裙表異：一切有部則兩邊向外雙襵；大眾部則右裾，蹙在左邊向內插之不令其墮，西方婦女著裙與大眾部無別；上座正量製亦同斯，但以向外直翻傍插為異。",
        "translation": "The difference between the four schools, however, is expressed by the difference in the way they wear their skirts: in the Sarvâstivāda school, the two sides are turned outward and double-clad; in the Mahāyāna school, the right train is knitted on the left side and inserted inward so that it doesn't fall, and there's no difference between the skirts worn by Western women and the Mahāyāna school; the upper seat proper is made in the same way, but with the difference that it's turned outward and inserted at the side.",
        "source": "T54n2125_002:0214a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "腰絛之製亦復不同，尼則准部如僧，全無別體。",
        "translation": "The waistband is also made differently, while the nuns wear it similarly to the saṃgha, without any distinction between the two.",
        "source": "T54n2125_002:0214a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且如神州祇支偏袒覆膊，方裙禪袴袍襦，咸乖本製，何但同袖及以連脊。",
        "translation": "Furthermore, as in the case of the Shenzhou branch of the saṃgha, the bared shoulders and the square skirt, the meditation hakama, and the robe and jacket all deviate from the original production, why is it just the same sleeve and with the spine attached?",
        "source": "T54n2125_002:0214a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至於披著不稱律儀，服用並皆得罪。",
        "translation": "As for wearing robes that don't match the restraints, it's a crime to wear them together.",
        "source": "T54n2125_002:0214a25_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗有著至西方，人皆共笑，懷慚內恥，裂充雜用。",
        "translation": "It's not uncommon for someone to wear it to the West, have people laugh at it, feel ashamed and embarrassed, and then split it for mixed use.",
        "source": "T54n2125_002:0214a26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此即皆是非法衣服也。",
        "translation": "These are all unlawful clothes.",
        "source": "T54n2125_002:0214a27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若默而不說，知者無由；如欲直言，復恐聞者見怨。",
        "translation": "If they remain silent but don't speak, there's no reason for those who know; if they want to speak directly, they're afraid that those who hear them will see it as a sin.",
        "source": "T54n2125_002:0214a27_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是以杼軸於短懷、沈吟於進退，願智者詳察識衣服之本儀也。",
        "translation": "Therefore, I hope wise men will scrutinize the original propriety of the clothing of consciousness as they loom and wrap their loops around their short bosoms and recite their inspirations.",
        "source": "T54n2125_002:0214a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又西方俗侶官人貴勝所著衣服，唯有白[疊*毛]一雙，貧賤之流只有一布。",
        "translation": "Furthermore, the only clothing worn by Western laypeople who are noble and superior is a pair of white [heaped*hair] robes, while poor people have only a single piece of cloth.",
        "source": "T54n2125_002:0214b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家法眾但畜三衣六物，樂盈長者方用十三資具。",
        "translation": "The religious community only has three garments and six things to wear, and only the comfortable elderly use thirteen necessities.",
        "source": "T54n2125_002:0214b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東夏不許同袖及連脊衣者，蓋是自習東川妄談西國耳。",
        "translation": "Those in the Eastern Xia region who don't permit robes with the same sleeves and ridges are simply accustomed to the Eastern River and falsely talk about the Western countries.",
        "source": "T54n2125_002:0214b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即如贍部洲中及諸邊海人物衣服，可略言之。",
        "translation": "This is like the clothing of people on Jambudvīpa and at the other seas, which can be mentioned briefly.",
        "source": "T54n2125_002:0214b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且從莫訶菩提東至臨邑，有二十餘國，正當驩州南界也。",
        "translation": "Furthermore, from Mahābodhi east to Linyi, there are more than twenty countries, which are precisely the southern boundary of Mineralogy.",
        "source": "T54n2125_002:0214b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西南至海北，齊羯濕彌羅，并南海中有十餘國及師子洲，並著二敢曼矣。",
        "translation": "From southwest to the north of the sea, there's Kashmir, and there are more than ten countries in the South China Sea and the island of Shizi, where they all wear two kinds of daring robes.",
        "source": "T54n2125_002:0214b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既無腰帶亦不裁縫，直是闊布兩尋繞腰下抹。",
        "translation": "There's no belt, and it's not sewn; it's simply a broadcloth wrapped around the waist.",
        "source": "T54n2125_002:0214b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西天之外大海邊隅，有波刺斯及多底國，並著衫袴。",
        "translation": "Beyond the western heavens, at the edge of the ocean, there are the countries of Pārśva and Dhṛtarāṣṭra, which also wear robes and hakama.",
        "source": "T54n2125_002:0214b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "裸國則逈無衣服，男女咸皆赤體。",
        "translation": "In the naked countries, there's a vast absence of clothing, and both men and women are naked.",
        "source": "T54n2125_002:0214b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從羯濕彌羅已去，及速利諸胡吐蕃、突厥，大途相似，不著敢曼，氈裘是務，少有劫貝。",
        "translation": "From Kashmir onward, the great route of the Sāli Hu, Turfan, and Turkic nations is similar; they don't wear hats or robes, and blankets and fur are the order of the day.",
        "source": "T54n2125_002:0214b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時存著者，以其寒地，衫袴是常。",
        "translation": "Those who still wore them at the time did so because it was cold, and robes and hakamas were the norm.",
        "source": "T54n2125_002:0214b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即此諸國之中，唯波刺斯及裸國、吐蕃、突厥元無佛法，餘皆遵奉。",
        "translation": "Of these countries, only Bojangis, Naked, Turfan, and Turkic had no Buddhist teachings; the others all followed them.",
        "source": "T54n2125_002:0214b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而於衫袴之鄉，咸不洗淨，由是五天之地自恃清高也。",
        "translation": "In the land of the five celestials, they are proud of their nobility because they don't wash their robes and hakamas.",
        "source": "T54n2125_002:0214b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其風流儒雅、禮節逢迎、食噉淳濃、仁義豐贍，其唯東夏餘莫能加，但以食不護淨、便利不洗、不嚼楊枝，事殊西域。",
        "translation": "However, their style is refined, their manners are courteous, their food is simple and thick, and their kindness and generosity are abundant, unlike anything else in Eastern Xia, except for the fact that they don't guard their food, don't wash their hands, and don't chew poplar sticks, unlike in Western China.",
        "source": "T54n2125_002:0214b18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而有現著非法衣服將為無過，引彼略教文云「此方不淨、餘方清淨，得行無罪」者，斯乃譯者之謬，意不然矣！",
        "translation": "Some people, however, wear illegal clothing and think it's without fault, citing the text of the short teaching, which says, \"This place is impure; other places are pure, and one can practice without fault.\" This is a mistake on the part of the translator, and the idea is not true!",
        "source": "T54n2125_002:0214b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具如別處。",
        "translation": "It's like any other place.",
        "source": "T54n2125_002:0214b24_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾，神州苾芻除三衣外，並非聖儀。",
        "translation": "If so, apart from the three garments, the monks of Shenzhou aren't bound by holy observances.",
        "source": "T54n2125_002:0214b24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既其有犯、理難服用者，且如西方煖地，單布自可終年；雪嶺寒鄉欲遣，若為存濟身安業進？",
        "translation": "Since they have violated them, it's reasonably difficult for them to take them, and they're like those in the warm regions of the West, where a single cloth can last a lifetime, or those in the cold villages of the snowy mountains who want to get rid of them, but what if they want to save their bodies and advance in peaceful behavior?",
        "source": "T54n2125_002:0214b25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖有誠言，苦體勞勤乃外道教。",
        "translation": "The noble ones have honestly said that suffering, body, and exertion are non-Buddhist teachings.",
        "source": "T54n2125_002:0214b27_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "去取之理其欲如何？",
        "translation": "What do you want to do with the principle of removal?",
        "source": "T54n2125_002:0214b28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然聖開立播之服通被寒鄉，斯乃足得養身，亦復何成妨道？",
        "translation": "However, the noble preacher's robe is worn throughout the cold countryside, which is sufficient to nourish the body, so why should it be a hindrance to the path?",
        "source": "T54n2125_002:0214b28_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵云立播者，譯為裹腹衣。",
        "translation": "The Sanskrit word risbang translates to \"belly-covering robe.",
        "source": "T54n2125_002:0214c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所製儀，略陳形樣，即是去其正背、直取偏袒，一邊不應著袖，唯須一幅纔穿得手。",
        "translation": "It's made with a sketchy outline, which is to remove the front back and straighten it to the side, so that the sleeves aren't worn on one side but only one piece fits the hand.",
        "source": "T54n2125_002:0214c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "肩袖不寬，著在左邊，無宜闊大，右邊交帶勿使風侵，多貯綿絮事須厚煖；亦有右邊刺合貫頭紐腋，斯其本製。",
        "translation": "The shoulder sleeves are not wide; they are worn on the left side, which should not be wide; the right side is interlaced so that the wind doesn't get into it; there is a cotton wool stockpile that should be thick and warm; and there is a right side that is pierced through the head and into the armpit, which is originally made.",
        "source": "T54n2125_002:0214c03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目驗西方，有胡地僧來，多見携著；那爛陀處不覩斯衣，良由國熱，人咸不用。",
        "translation": "When I look to the west, there are monks from the Huti who come and are often seen wearing them; I don't see these robes in Nālandā, but it's because of the heat in that country that people don't use them.",
        "source": "T54n2125_002:0214c06_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "准斯開意，直為寒鄉老者，其偏袒正背，無是踵斯而作，剩加右畔失本威儀，非製自為定招越法。",
        "translation": "According to this explanation, it's straightforward for an elderly man in a cold country to bare his back and correctly carry it, without following this, and then adding a right side that misses the original manner and isn't made to be self-conscious and definitely transgressive.",
        "source": "T54n2125_002:0214c08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至如立播抱腹，自免嚴寒；厚帔通披，足遮隆凍。",
        "translation": "Suppose he were to stand up and wrap his arms around his belly to protect himself from the bitter cold, and he were to wear a thick cape to cover his feet from the cold.",
        "source": "T54n2125_002:0214c10_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形像之處禮佛對尊，露髆是恒、掩便獲罪。",
        "translation": "At the place where the Buddha's form is worshipped, it's always a sin to reveal the shoulder blade and cover it up.",
        "source": "T54n2125_002:0214c11_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然則出家省事，冬月居房炭火隨時，詎勞多服？",
        "translation": "However, leaving home saves trouble, and in winter months when we live in a room with a charcoal fire, we don't need to wear much clothing.",
        "source": "T54n2125_002:0214c12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必有病緣要須著者，臨時處斷勿使乖儀。",
        "translation": "Those who must have a medical condition that requires attachment must be temporarily removed from the situation so that they don't misbehave.",
        "source": "T54n2125_002:0214c13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然而東夏寒嚴劈裂身體，若不煗服交見羸亡。",
        "translation": "However, the cold and harshness of the eastern summer split the body, and if someone doesn't wear robes, they'll lose their strength and die.",
        "source": "T54n2125_002:0214c14_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既為難緣，理須弘濟。",
        "translation": "Since this is a difficult condition, it's logical to promote relief.",
        "source": "T54n2125_002:0214c15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方裙偏袒形簡俗流，唯立播衣寒冬暫著，知非本製為命權開，如車置油內生慚厚。",
        "translation": "A bare-skinned man with a simple, conventional appearance who only wears a monk's robe in the cold and winter knows that it's not originally made for the purpose of opening up the right to life, like a carriage with oil inside that produces a sense of shame.",
        "source": "T54n2125_002:0214c16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必其不著，極是佳事。",
        "translation": "It's a good thing that they mustn't wear them.",
        "source": "T54n2125_002:0214c18_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自餘袍袴褌衫之類，咸悉決須遮斷。",
        "translation": "For the rest of the world, robes, hakamas, and shirts are all absolutely necessary to cover up.",
        "source": "T54n2125_002:0214c18_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嚴寒既謝，即是不合擐身，而復更著偏衫，實非開限。",
        "translation": "After the severe cold has passed, that is, they don't fit into the home body, and further wearing a partial robe is really not an open restriction.",
        "source": "T54n2125_002:0214c19_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯則去繁得要，仰順聖情。",
        "translation": "In this way, he removed the complexity and got the essentials, reverting to the noble mind.",
        "source": "T54n2125_002:0214c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自墮乍可，一身傳授，恐為誤眾。",
        "translation": "While it's fine to fall on one's own, I'm afraid it would be a mistake to pass it on to the crowd.",
        "source": "T54n2125_002:0214c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如能改斯故轍務軌新蹤者，即可謂蟬聯少室，架鷲峯而並峻；櫛批王舍，通帝鄉而共圍。",
        "translation": "If someone can change these old ways and follow new trails, they can be called a cicada that joins the Shaoshi room, raises Vulture Peak and is high, and a gang that batches the king's house, passes through the Dixiang village and is surrounded by it.",
        "source": "T54n2125_002:0214c22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鴻河則合泚於文池，細柳乃同暉於覺樹；變桑田而騰茂，盡劫石而揚輝。",
        "translation": "The Honghe River will then merge and brighten into the Wenchi River, and the thin willows will share the same radiance with the Juejie tree; the mulberry fields will grow luxuriant, and the kalpas will spread their glory.",
        "source": "T54n2125_002:0214c24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誠可嗟矣！",
        "translation": "It's really worthy of contempt!",
        "source": "T54n2125_002:0214c26_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誠可務哉！",
        "translation": "How serviceable!",
        "source": "T54n2125_002:0214c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但佛日既沈、教留後季，行之則大師對面，背教則眾過現前。",
        "translation": "However, since the Buddha's day has passed and the teaching has been left for a later season, practicing it will bring the great teacher face to face, and deviating from the teaching will bring the multitude of faults before us.",
        "source": "T54n2125_002:0214c26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故經云「若能奉戒，則我存無異」。",
        "translation": "That's why the sūtra says, \"If I can observe the precepts, then I'll remain unchanged.\"",
        "source": "T54n2125_002:0214c28_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或云：「舊來上德並悉不言，今日後人何事移則？」",
        "translation": "Some people say, 'The great virtues of the past were all silent, so why would anyone from a later generation today want to change their position?'\"",
        "source": "T54n2125_002:0214c29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "固不然矣。",
        "translation": "That's certainly not true.",
        "source": "T54n2125_002:0215a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依法匪人教有弘說，考之律藏，衣食無罪者方可取也。",
        "translation": "Relying on the teachings of the Dharma bandits, there's a vast teaching, which is examined in the vinaya, that only those who are clothed and fed without sin can obtain it.",
        "source": "T54n2125_002:0215a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非知之艱，行之為難。",
        "translation": "It's not difficult to know it, but difficult to practice it.",
        "source": "T54n2125_002:0215a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞若不行，導者寧過？",
        "translation": "If you hear it but don't do it, how could a guide fault it?",
        "source": "T54n2125_002:0215a03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重曰：含生之類衣食是先，斯為枷鎖控制生田。",
        "translation": "\"They say again, 'Food and clothing come first for those who contain life, and this is a field of chains that control birth.'",
        "source": "T54n2125_002:0215a03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉聖言則蕭然出離，任自意乃罪累相牽。",
        "translation": "Following the noble words, they are released unmolested, but allowing themselves to do as they wish is a burden of sin.",
        "source": "T54n2125_002:0215a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智者須鑒，事在目前。",
        "translation": "A wise person must examine this, for it's happening now.",
        "source": "T54n2125_002:0215a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如玉處泥、若水居蓮，八風既離，五怖寧纏。",
        "translation": "Like jade in the mud or water on a lotus, once the eight winds are removed, the five fears are less likely to entangle it.",
        "source": "T54n2125_002:0215a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣纔蔽體、食但支懸，專求解脫、不願人天。",
        "translation": "Their robes scarcely cover their bodies, their food merely lasts, and they focus on seeking liberation rather than wishing for humans and gods.",
        "source": "T54n2125_002:0215a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "杜多畢命，拯物窮年，棄九門之虛偽、希十地之圓堅，合受施於五百，為福利於三千。",
        "translation": "They spare many lives, save things in their infinite years, abandon the hypocrisy of the nine disciplines, hope for the perfect stability of the tenth ground, and combine to accept 500 gifts for the welfare of 3,000.",
        "source": "T54n2125_002:0215a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一著衣法式",
        "translation": "Eleven ways to observe the rules for putting on robes",
        "source": "T54n2125_002:0215a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其著三衣及施[巾*句]紐法式，依律陳之。",
        "translation": "The rules for wearing the three garments and putting [a scarf*cupboard] on the head are explained in accordance with the Vinaya.",
        "source": "T54n2125_002:0215a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可取五肘之衣疊作三襵，其肩頭疊處去緣四五指許安其方帖，可方五指。",
        "translation": "He may take a five-elbow robe and fold it into three wrists, placing a square patch about four or five fingers from the edge of the fold at the shoulder, which may be five fingers square.",
        "source": "T54n2125_002:0215a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "周刺四邊，當中以錐穿為小孔用安衣[巾*句]。",
        "translation": "It's pierced around the four edges, and an awl is threaded through it to make a small hole for the robe [scarf*sentence].",
        "source": "T54n2125_002:0215a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其[巾*句]或絛或帛，麁細如衫[巾*句]相似，長可兩指結作同心，餘者截却。",
        "translation": "The [napkin*sentence] is either tapestry or silk, coarse and fine like a shirt [napkin*sentence], and its length can be knotted together with two fingers, while the rest is cut off.",
        "source": "T54n2125_002:0215a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將[巾*句]穿孔向外牽出十字反繫，便成兩[巾*句]，內紐此中。",
        "translation": "When the [scarf*clause] is pulled out through a hole and tied back across it, two [scarf*clauses] are formed, and the inner one is tied here.",
        "source": "T54n2125_002:0215a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其胸前疊處緣邊安紐亦如衫紐。",
        "translation": "The front of his chest is folded over, and the edges are tied like a shirt and button.",
        "source": "T54n2125_002:0215a18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即其法也。",
        "translation": "That's the same method.",
        "source": "T54n2125_002:0215a19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先呈本製略准大綱，若欲妙體其法，終須對面而授。",
        "translation": "The first presentation of the original outline was roughly in line with the main outline, but if you want to get the essence of the teaching right, you'll have to teach it to each other eventually.",
        "source": "T54n2125_002:0215a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "衣之下畔[巾*句]紐亦施，隨意到披，是聖開許。",
        "translation": "The [scarf*clause] button under the robe is also made to fit as one wishes, which is approved by the sage.",
        "source": "T54n2125_002:0215a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兩頭去角可八指許各施一[巾*句]一紐，此為食時所須。",
        "translation": "A [napkin*phrase] and a button may be placed at each end, eight fingers or so removed from the horns, which is necessary when eating.",
        "source": "T54n2125_002:0215a21_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "反襵胸前紐使相合，此成要也。",
        "translation": "Covering the front of the chest with a wrinkled bandage so that it fits together is an essential accomplishment.",
        "source": "T54n2125_002:0215a23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡在寺內或時對眾，必無帶紐及籠肩披法，若向外遊行并入俗舍方須帶紐，餘時但可搭肩而已。",
        "translation": "Whenever he's inside the temple or in public, he must not carry a button or cage over his shoulder; if he goes out into the community or enters a secular dwelling, then he must carry a button; otherwise, he can simply put it over his shoulder.",
        "source": "T54n2125_002:0215a23_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "屏私執務隨意反抄，若對尊容事須齊整，以衣右角寬搭左肩，垂之背後勿安肘上。",
        "translation": "If he's facing the audience, he should put the right corner of his robe wide over his left shoulder and hang it behind his back, not on his elbow.",
        "source": "T54n2125_002:0215a26_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲帶紐，即須通肩披已，將紐內[巾*句]迴向肩後勿令其脫。",
        "translation": "If he wants to carry a button, he must drape it over his shoulder and put the [scarf*line] inside the button back over his shoulder so that it doesn't fall off.",
        "source": "T54n2125_002:0215a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以角搭肩衣便繞頸，雙手下出，一角向前，阿育王像正當其式。",
        "translation": "Putting the horns on his shoulder, he wraps the robe around his neck, puts his hands under his head, and puts one horn forward, just as the image of King Aśoka should be.",
        "source": "T54n2125_002:0215a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出行執傘形儀可愛，即是依教齊整著上衣也。",
        "translation": "Carrying an umbrella when traveling is a lovely form and manner, which is to wear the upper robe neatly according to the teaching.",
        "source": "T54n2125_002:0215b02_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其傘可用竹織之，薄如竹簟一重便得，大小隨情寬二三尺。",
        "translation": "The umbrella can be woven of bamboo, as thin as a single weight of bamboo woven mat, and is two or three feet wide as appropriate for its size.",
        "source": "T54n2125_002:0215b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頂中複作，擬施其柄，其柄長短量如蓋闊，或可薄拂以漆、或可織[竺-二+韋]為之，或如藤帽之流，夾紙亦成牢矣。",
        "translation": "It can be made again with a handle the length of which is measured like the width of a canopy, or it can be made of thin lacquer or woven [Zhu-ji+Wei], or it can be made like a stream of rattan hats, and it can be made secure by attaching paper to it.",
        "source": "T54n2125_002:0215b04_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "神州雖不先行，為之亦是其要，驟雨則不霑衣服、赫熱則實可招涼。",
        "translation": "Although it doesn't precede it, it's essential for Shenzhou to make it so that sudden rain doesn't cover your clothes, and it's really cool when it's hot.",
        "source": "T54n2125_002:0215b07_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既依律而益身，擎之固亦無損。",
        "translation": "Since it benefits the body by following the precepts, there's certainly no harm in carrying it up.",
        "source": "T54n2125_002:0215b08_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯等所論要事，多並神州不行。",
        "translation": "Most of the important things discussed here aren't applicable to Shenzhou.",
        "source": "T54n2125_002:0215b09_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "袈裟角垂正當象鼻，梵僧縱至皆亦雷同，良為絹滑墮肩，遂令正則訛替。",
        "translation": "The horns of the monk's robe hang down just like the trunk of an elephant, and even though the Brahmā saṃgha arrived, they all did the same thing; it was because the silk slipped and fell off the shoulder that the correct principle was violated.",
        "source": "T54n2125_002:0215b10_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後唐三藏來傳搭肩法，然而古德嫌者尚多，黨舊之迷在處皆有。",
        "translation": "Later, the Tang Tripiṭaka transmitted the method of latching the shoulders, but there were still many ancient scholars who disliked it, and there were misconceptions about the old ways of doing things.",
        "source": "T54n2125_002:0215b12_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其三衣，若安短紐而截長絛，則違教之愆現免；著橫裙而去腰緣，乃針線之勞交息。",
        "translation": "If he had placed a short button and cut off a long pectoral, the offense of disobeying the teaching would have been avoided; if he had worn a horizontal skirt and removed the waistline, the labor of needlework would have been stopped.",
        "source": "T54n2125_002:0215b13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有瓶鉢各挂兩肩，纔至腋下不合交絡，其襻不長但容穿髆而已，若交絡胸前令人氣急。",
        "translation": "Hanging a bottle and bowl on each shoulder, they rarely reach the armpits without interlocking, and their loops aren't long enough to carry a shoulder blade; if they interlock in front of the chest, it makes people feel anxious.",
        "source": "T54n2125_002:0215b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元非本製，即不可行。",
        "translation": "If the loops are not originally made, it's not feasible.",
        "source": "T54n2125_002:0215b17_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鉢袋之儀如下當辯。",
        "translation": "The following should be said about the manner of carrying a bowl bag.",
        "source": "T54n2125_002:0215b18_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北方速利諸人多行交絡，隨方變改實非佛制。",
        "translation": "In the north, the quick-witted often practice interlacing, and changing it according to the region is not really a Buddhist rule.",
        "source": "T54n2125_002:0215b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設有餘衣長搭肩上，然後通披覆其衣鉢，若其向寺及詣俗家，要至房舍安置傘蓋，方始解紐掛其衣鉢。",
        "translation": "If there are other robes that are worn long and over the shoulders, then the robe and bowl are covered with a common cloth.",
        "source": "T54n2125_002:0215b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "房前壁上多置象牙，勿使臨時安物無處。",
        "translation": "The walls in front of the house should be covered with ivory, so that there's no place to put your things when they're about to be put away.",
        "source": "T54n2125_002:0215b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘同第二十六客舊相遇章說也。",
        "translation": "The rest is the same as that explained in the chapter on the twenty-sixth guest's encounter with the past.",
        "source": "T54n2125_002:0215b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其薄絹為袈裟者多滑，不肯著肩，禮拜之時遂便落地。",
        "translation": "However, the thin silk monks' robes are often slippery and won't fit over their shoulders, so they fall to the ground when they worship.",
        "source": "T54n2125_002:0215b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "任取不墮物為之，絁紬白[疊*毛]即其要也。",
        "translation": "Whatever you choose, you can make it out of something that won't fall, and that's the essential thing, which is made of rough and white [pile*hair].",
        "source": "T54n2125_002:0215b25_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其僧脚崎衣即是覆膊，更加一肘始合本儀。",
        "translation": "The monk's footwear robe is a shoulder covering, and it's only fitting the original manner when it's extended by an elbow.",
        "source": "T54n2125_002:0215b26_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其披著法，應出右肩交搭左膊，房中恒著。",
        "translation": "He should wear it over his right shoulder and over his left shoulder, and always wear it in the monk's quarters.",
        "source": "T54n2125_002:0215b27_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯此與裙，出外禮尊任加餘服。",
        "translation": "Only this and the skirt are allowed to be worn over the rest of the garment when going out to pay homage to the venerable.",
        "source": "T54n2125_002:0215b28_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其著裙法式聊陳大況。",
        "translation": "This is a general statement of the way he wears the skirt.",
        "source": "T54n2125_002:0215b29_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即如有部裙製，橫五肘竪兩肘，絁絹及布隨有作之。",
        "translation": "It's just like the dresses made by the Arhat School, which are five elbows across and two elbows up, and made from silk and cloth as they fit.",
        "source": "T54n2125_002:0215c01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西國並悉單為，神州任情複作。",
        "translation": "In the western countries, they are all made alone, and in Shenzhou, they are made as often as they like.",
        "source": "T54n2125_002:0215c02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "橫竪隨意，繞身既訖擡使過臍，右手牽其左邊上角，在內牽向腰之右邊。",
        "translation": "After wrapping it around his body and lifting it past his navel, he takes the upper left corner with his right hand and pulls it inward toward the right side of his waist.",
        "source": "T54n2125_002:0215c03_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "左邊上裙取外邊而掩左畔(近右手邊為右裾，近左手邊為左裾)，兩手二畔舉使正平，中間矗(勅六反)直即成三襵。",
        "translation": "He takes the outer edge of the upper left skirt and covers the left side (the right train near the right hand side and the left train near the left hand side), holding up the two sides of the skirt with both hands so that it's level, and then he straightens the middle (Imazumi 6) to form three wrinkles.",
        "source": "T54n2125_002:0215c04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後以兩手各蹙至腰，俱將三疊向後掩之，兩角各擡三指俱插向脊使下，入腰間可三指許。",
        "translation": "Later, he takes each hand and knits it to the waist, covering the three folds backward with each of the two horns and holding up three fingers to the ridge to bring it down, so that it enters the waist by about three fingers.",
        "source": "T54n2125_002:0215c07_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯則縱未繫絛，亦乃著身不落。",
        "translation": "In this way, even if the waistband is not tied, it will stick to the body and not fall off.",
        "source": "T54n2125_002:0215c09_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後以腰絛長五肘許，鉤取正中舉向臍下，抹裙上緣向後雙排，交度前抽傍牽左右，各以一手牢擪兩邊，纏彼兩絛可令三度，有長割却、少則更添。",
        "translation": "Later, he takes a waistband that's about five elbows long, hooks it right in the middle and raises it toward his lower umbilicus, wipes the upper edge of his skirt and lays it back in a double row, pulls it to the side and pulls it to the left and right with one hand, securely wraps it around both sides, and makes it possible to wrap it around both tapestries three times; if it's long, cut it off, or add more if it's short.",
        "source": "T54n2125_002:0215c10_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "絛帶之頭不合緝綵。",
        "translation": "The heads of the waistbands don't fit into the ribbon.",
        "source": "T54n2125_002:0215c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯為圓整著裙。",
        "translation": "This is done by wearing a skirt that's perfectly proportioned.",
        "source": "T54n2125_002:0215c14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或薩婆多之部別，鉢履曼荼羅著泥婆娑，即其真也。",
        "translation": "Perhaps the sarvâstivāda group, the Pārśva maṇḍala, wears a nirvāṇa, which is the true one.",
        "source": "T54n2125_002:0215c14_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譯為圓整著裙矣。",
        "translation": "It's translated as a fully clothed skirt.",
        "source": "T54n2125_002:0215c15_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其絛闊如指面，則靴絛襪帶之流，或方或圓，雙亦無損；麻繩之流，律文不許。",
        "translation": "If its tap is as wide as the surface of a finger, then the flow of the boot-tape and sock-strap, whether square or round, is not impaired; the Vinaya does not permit the flow of hemp cords.",
        "source": "T54n2125_002:0215c16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡踞坐小床及拈之時，牽裙上裾下角，急抹裙緣擪於胯下，但掩雙膝露脛無傷。",
        "translation": "When sitting on a cot or at a flick of the wrist, he pulls the upper part of the skirt by the lower corner of the train and hastily wipes the edge of the skirt to pluck it below his crotch, but covers his knees and exposes his shins without harm.",
        "source": "T54n2125_002:0215c18_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "高須上蓋臍輪，下至踝上四指。",
        "translation": "The skirt must be raised above the navel and lowered to four fingers above the ankles.",
        "source": "T54n2125_002:0215c20_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯乃俗舍之儀。",
        "translation": "This is the manner of a secular home.",
        "source": "T54n2125_002:0215c20_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在寺中，半踹亦得。",
        "translation": "If you were in a temple, you could also do so with a half-kick.",
        "source": "T54n2125_002:0215c21_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之齊限佛自親製，非是人意輒為高下。",
        "translation": "This is a standard that the Buddha himself made, not something that people might easily assign to a higher or lower level.",
        "source": "T54n2125_002:0215c21_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寧合故違教旨、自順凡情，所著裙衣長申拂地，一則損信心之淨施，二乃慢大師之格言。",
        "translation": "Rather, it's contrary to the teaching's intent and suits ordinary people's desires to wear a skirt that's long and smooth, which on the one hand undermines the pure gift of faith and on the other hates the great teacher's maxim.",
        "source": "T54n2125_002:0215c22_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設告慇懃，誰能見用？",
        "translation": "Even if we were to ask for your kindness, who would be able to see its usefulness?",
        "source": "T54n2125_002:0215c24_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "萬人之內頗有一二存心？",
        "translation": "Are there one or two subtle intentions within a million people?",
        "source": "T54n2125_002:0215c25_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西國裙衣並皆橫著，彼方白[疊*毛]幅寬二肘，若其半故貧者難求，即須縫兩頭令相合，割內開以充事。",
        "translation": "In the western countries, the skirts and robes are all worn horizontally, and the white [folding*hair] waistband there is two elbows wide; if it's difficult for a poor person to find half of it, then he must sew the two ends together and cut it open inside to make it work.",
        "source": "T54n2125_002:0215c26_30",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此著衣儀，律文具有其制，但且略陳大綱要，細論非面不可。",
        "translation": "The Vinaya has a system for this kind of dress code, but we'll just outline the essentials and discuss them in detail.",
        "source": "T54n2125_002:0215c28_31",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又凡是出家衣服，皆可染作乾陀，或為地黃黃屑或復荊蘖黃等，此皆宜以赤土赤石研汁和之，量色淺深要而省事。",
        "translation": "Furthermore, whenever a renunciant's clothing is worn, it can be dyed dry, either with yellow dust from the earth or with yellow dust from the thorn tree.",
        "source": "T54n2125_002:0215c29_32",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或復單用棘心、或赤土赤石、或棠梨土紫，一染至破，亦何事求餘。",
        "translation": "If one were to use thorns alone, red clay, red stone, or pearly clay and purple, and dye it until it breaks, there would be nothing left to seek.",
        "source": "T54n2125_002:0216a03_33",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而桑皴青綠正是遮條，真紫褐色西方不著。",
        "translation": "The mulberry-blue and green are precisely what's needed to cover the stripes, and the true purple and brown are not adhered to in the West.",
        "source": "T54n2125_002:0216a05_34",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鞋履之屬自有成教，長靴線鞋全為非法，彩繡文章之物佛皆制斷，如皮革事中具說。",
        "translation": "Footwear has its own established teaching, but boots and shoes made of thread are all illegal, and things made of colorful embroidery and paper are all suppressed by the Buddha, as explained in the case of leather.",
        "source": "T54n2125_002:0216a06_35",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二尼衣喪制",
        "translation": "The twelve nuns' robes are confiscated.",
        "source": "T54n2125_002:0216a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東夏諸尼衣皆涉俗，所有著用多並乖儀。",
        "translation": "The nuns of the Eastern Xia region are all clothed in secular clothing, and much of what they wear is inconsistent with propriety.",
        "source": "T54n2125_002:0216a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "准如律說，尼有五衣：一僧伽知、二嗢呾羅僧伽、三安呾婆娑、四僧脚崎、五裙。",
        "translation": "According to the Vinaya, nuns have five garments: a monk's coat, a two-tongued monk's coat, a three-tongued monk's coat, a four-tongued monk's footlocker, and a five-tongued skirt.",
        "source": "T54n2125_002:0216a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四衣儀軌與大僧不殊，唯裙片有別處。",
        "translation": "The manner of the four garments isn't different from that of a large monk, except for the skirt, which has a different place.",
        "source": "T54n2125_002:0216a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵云俱蘇洛迦，譯為篅衣。",
        "translation": "The Sanskrit word kuśūlaka translates to garment of the calabash.",
        "source": "T54n2125_002:0216a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以其兩頭縫合形如小篅也，長四肘寬二肘，上可蓋臍下至踝上四指。",
        "translation": "It's sewn together at both ends and shaped like a small halter, four elbows long and two elbows wide, and it covers the navel at the top and reaches four fingers above the ankle at the bottom.",
        "source": "T54n2125_002:0216a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "著時入內擡使過臍，各蹙兩邊雙排擪(於協反)脊。",
        "translation": "When it's worn, it's carried inside and over the navel, and each side is knitted in a double row to form a hem.",
        "source": "T54n2125_002:0216a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫絛之法，量與僧同。",
        "translation": "The monks' monk's monkhood is the same in terms of the amount of money spent on the monk's robe.",
        "source": "T54n2125_002:0216a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "胸腋之間逈無繫抹，假令少壯或復衰年，乳高肉起誠在無過。",
        "translation": "The area between the breasts and armpits is rarely covered, so even if one is young and strong or in advanced years, there's really nothing wrong with having breasts that are high and flesh that rises.",
        "source": "T54n2125_002:0216a17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈得羞人不窺教檢，漫為儀飾著脫招愆；臨終之時罪如濛雨，萬中有一時復能改？",
        "translation": "How could a person be ashamed and not scrutinize the teaching, and rashly wear ornamentation that brings offense; at the time of death, a sin is like a drizzle, and there's only one time in a million that it can be corrected?",
        "source": "T54n2125_002:0216a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其出外及在僧前，并向俗家受他請食，袈裟繞頸覆身，不合解其肩紐，不露胸臆下出手飡。",
        "translation": "However, when they go out into the world or are in the presence of the saṃgha, and when they accept food from others in the secular world, the monks wrap their robes around their necks and cover their bodies, don't untie their shoulders, and don't eat from their hands without exposing their chests and hearts.",
        "source": "T54n2125_002:0216a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "祇支偏袒衫袴之流，大聖親遮，無宜服用。",
        "translation": "It's not appropriate for a monk to wear a bare-skinned robe and hakama that's personally covered by a great sage.",
        "source": "T54n2125_002:0216a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南海諸國，尼眾別著一衣，雖復制匪西方，共名僧脚崎服。",
        "translation": "In the Southern Sea countries, the nuns wear a separate robe, although it's no longer customary in the West, and is collectively called the monk's foot-towel robe.",
        "source": "T54n2125_002:0216a24_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長二肘寬二肘，兩頭縫合留一尺許，角頭刺著一寸，舉上穿膊貫頭拔出右肩，更無腰帶掩腋蓋乳，下齊過膝。",
        "translation": "It's two elbows long and two elbows wide, with the two ends sewn together to leave a foot or so, the horns pierced to an inch, and it's lifted up through the shoulders and pulled out over the right shoulder, without a waistband to cover the armpits and breasts, and it falls completely below the knees.",
        "source": "T54n2125_002:0216a25_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲此服，著亦無傷。",
        "translation": "If one wants to wear this garment, there's no harm in wearing it.",
        "source": "T54n2125_002:0216a28_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "線則唯費兩條，彌堪掩障形醜。",
        "translation": "The thread only costs two pieces, which are sufficient to cover up an ugly appearance.",
        "source": "T54n2125_002:0216a28_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不樂者，即可還須同大苾芻著僧脚崎服。",
        "translation": "If he doesn't like it, he can simply return to the monk's footwear with the great monk.",
        "source": "T54n2125_002:0216a29_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其寺內房中俱蘇洛迦及僧脚崎，兩事便足(准撿梵本，無覆肩衣名，即是僧脚崎衣。",
        "translation": "In the monastery's inner sanctum, the kuśālaka and the saṃgha's footwear are sufficient for both (according to the Sanskrit edition of the Qanaka, there is no shoulder-covering robe, which is the saṃgha's footwear.",
        "source": "T54n2125_002:0216b01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此乃祇支之本號，既不道裙，多是傳譯參差)。",
        "translation": "This is the original name of the Gezi sect, and since it doesn't have a preceptor, it's mostly a variation in translation.)",
        "source": "T54n2125_002:0216b03_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應捨違法之服，著順教之衣。",
        "translation": "You should abandon unlawful clothing and put on clothing that conforms to the teaching.",
        "source": "T54n2125_002:0216b03_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧脚崎取一幅半，或絹或布，可長四肘五肘，如披五條反搭肩上，即其儀也。",
        "translation": "Take one and a half pieces of monk's footwear, either silk or cloth, that's four or five elbows long, and put them over your shoulder like a five-panel robe, which is the appropriate form.",
        "source": "T54n2125_002:0216b04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若向餘處須好覆形，如在屏房袒膊非事。",
        "translation": "If he goes to another place, he must cover his shoulders well, as in the screened-in room, where baring one's shoulders is not an option.",
        "source": "T54n2125_002:0216b06_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "春夏之節此可充軀，秋冬之時任情煖著，擎鉢乞食足得養身。",
        "translation": "In spring and summer, this will fill your body; in autumn and winter, you can wear it as you like; and carrying a bowl to beg for food will nourish your body.",
        "source": "T54n2125_002:0216b07_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖曰女人有丈夫志，豈容恒營機杼作諸雜業，廣為衣服十重五重，禪誦曾不致心，驅驅鎮惱情志，同俗粧飾不顧戒經。",
        "translation": "Even though it's said that women have the aspirations of husbands, how can they be constantly engaged in the loom and create various occupations, make ten layers of clothing five times over, meditate and recite without ever concentrating their minds, drive away their feelings of distress, and dress like ordinary people without regard for the precepts?",
        "source": "T54n2125_002:0216b08_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宜可門徒共相撿察，西國尼眾斯事全無，並皆乞食資身居貧守素而已。",
        "translation": "It's advisable for the disciples to examine this together, for the nuns of the western countries do nothing of the sort, and they all beg for food to support themselves and live in poverty and observe vegetarianism.",
        "source": "T54n2125_002:0216b11_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾出家尼眾利養全稀，所在居寺多無眾食，若不隨分經求活命無路，輒違律教便爽聖心。",
        "translation": "If the renunciant nuns' altruistic support is entirely scarce, and they live in a temple where there's often no food for them, then if they don't follow the sūtras for a living, they'll often violate the vinaya and then lose their noble minds.",
        "source": "T54n2125_002:0216b13_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "進退兩途，如何折中？",
        "translation": "How can we compromise between the two paths of advance and retreat?",
        "source": "T54n2125_002:0216b15_24",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身安道盛可不詳聞。",
        "translation": "\"The body is comfortable, and the path flourishes; you may not hear more about it.",
        "source": "T54n2125_002:0216b15_25",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答本契出家情希解脫，絕三株之害種、偃四瀑之洪流，宜應畢志杜多，除苦樂之邪徑；敦心少欲，務閑寂之真途。",
        "translation": "A Protégé renunciant who wants to be liberated, cutting off the harmful seeds of the three plants and quelling the torrents of the four waterfalls, should set his mind free to avoid the mistaken path of suffering and pleasure and his heart free to pursue the true path of leisure and tranquility with few desires.",
        "source": "T54n2125_002:0216b16_26",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奉戒昏旦斯即道隆，豈念身安將為稱理。",
        "translation": "To observe precepts at sunset is to make the path flourish, so why wouldn't mindfulness of body and tranquility be the principle to be praised?",
        "source": "T54n2125_002:0216b19_27",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能守律決鍊真疎，則龍鬼天人自然遵敬，何憂不活徒事辛苦？",
        "translation": "If he can observe the precepts and resolutely train his true selves, then dragons, ghosts, gods, and humans will naturally respect him, so why should he worry about not living and working hard in vain?",
        "source": "T54n2125_002:0216b20_28",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至如五衣瓶鉢足得全軀，一口小房彌堪養命，簡人事、省門徒，若玉處泥、如蓮在水，雖云下眾，實智等上人矣。",
        "translation": "Until such time as five garments, a bottle, or bowl are sufficient to complete a body, a small dwelling is sufficient to support a life, and a simple person is saved from disciples, like jade in the mud or a lotus in the water, though they may be called an inferior group, they are really superior in wisdom.",
        "source": "T54n2125_002:0216b21_29",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復死喪之際，僧尼漫設禮儀，或復與俗同哀將為孝子，或房設靈、机用作供養，或披黲布而乖恒式，或留長髮而異則，或拄哭杖、或寢苦廬，斯等咸非教儀，不行無過。",
        "translation": "Furthermore, at the time of death and funeral, the saṃgha and nuns often establish rituals, or they may share the commonplace's sympathy and become filial sons, or they may set up a room for their spirits or make offerings, or they may wear a cloth that deviates from the usual pattern, or they may wear their hair long and differ from the norm, or they may lean on a weeping stick, or they may sleep in a house of suffering.",
        "source": "T54n2125_002:0216b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理應為其亡者淨飾一房，或可隨時權施蓋幔，讀經念佛具設香花，冀使亡魂託生善處，方成孝子、始是報恩。",
        "translation": "They should purify and decorate a room for the deceased, or they might offer a covering and curtain at any time, read the scriptures and recite the Buddha's name, and set out flowers and incense, hoping that the soul of the deceased will be reborn in a good place.",
        "source": "T54n2125_002:0216b29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈可泣血三年將為賽德，不飡七日始符酬恩者乎？",
        "translation": "Shouldn't someone weep blood for three years in order to praise virtue, but not wait for seven days before repaying kindness?",
        "source": "T54n2125_002:0216c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯乃重結塵勞、更嬰枷鎖，從闇入闇，不悟緣起之三節，欲死趣死，詎證圓成之十地歟！",
        "translation": "Thus, they are re-bound in the bonds of defilement and further chains, going from darkness into darkness, not understanding the three sections of dependent arising, desiring death and heading for death, and then failing to realize the accomplishment of the tenth ground!",
        "source": "T54n2125_002:0216c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然依佛教，苾芻亡者觀知決死，當日[臼/丌]向燒處，尋即以火焚之。",
        "translation": "According to Buddhism, however, when a monk dies and observes that he's definitely dead, he [utes/knots] heads to a place where he'll be burned, and he immediately sets fire to it.",
        "source": "T54n2125_002:0216c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當燒之時，親友咸萃在一邊坐，或結草為座、或聚土作臺、或置甎石以充坐物，令一能者誦無常經半紙一紙，勿令疲久(其經別錄附上)，然後各念無常，還歸住處。",
        "translation": "While it's burning, his friends and relatives gather to sit at one side, either making a straw seat, a dirt platform, or a pile of stones to make something to sit on, and tell one person who can to recite the Sutra on Impermanence half a sheet of paper and not to tire of it for a long time (a separate record of the sutra is appended), then each person is mindful of impermanence and returns to his place of residence.",
        "source": "T54n2125_002:0216c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寺外池內連衣並浴，其無池處就井洗身，皆用故衣不損新服，別著乾者然後歸房。",
        "translation": "Outside the temple, they bathe with their robes in a pond; where there's no pond, they wash their bodies in a well, using their old robes and not damaging their new ones, and then they put on something dry and return to their rooms.",
        "source": "T54n2125_002:0216c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地以牛糞淨塗，餘事並皆如故，衣服之儀曾無片別。",
        "translation": "The ground is smeared with cow-dung, and the rest of the things remain the same, with no distinction in clothing or manner.",
        "source": "T54n2125_002:0216c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有收其設利羅為亡人作塔，名為俱攞，形如小塔上無輪蓋。",
        "translation": "Some people may accept a pagoda made by their gods for the deceased, which is called a kula, shaped like a small stūpa without a lid on top.",
        "source": "T54n2125_002:0216c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然塔有凡聖之別，如律中廣論。",
        "translation": "Still, the stūpa has distinctions between worldlings and sages, as discussed in detail in the Vinaya.",
        "source": "T54n2125_002:0216c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈容棄釋父之聖教、逐周公之俗禮，號咷數月、布服三年者哉！",
        "translation": "How could someone abandon the noble teaching of Śākyamuni and follow the secular rituals of the Duke of Zhou, wailing for months and laying out robes for three years?",
        "source": "T54n2125_002:0216c16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曾聞有靈裕法師，不為舉發、不著孝衣，追念先亡為修福業。",
        "translation": "I once heard that there was a teacher named Lingyu who didn't raise or wear mourning clothes but memorialized his ancestors in order to cultivate good karma.",
        "source": "T54n2125_002:0216c18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "京洛諸師亦有遵斯轍者。",
        "translation": "Some masters in Beijing and Luo also followed this path.",
        "source": "T54n2125_002:0216c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或人以為非孝，寧知更符律旨。",
        "translation": "Some people might think that this is not filial, but they would rather know that it's more in line with the meaning of the Vinaya.",
        "source": "T54n2125_002:0216c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三結淨地法",
        "translation": "Thirteen Sets of Pure Land Practices",
        "source": "T54n2125_002:0216c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有五種淨地：一起心作、二共印持、三如牛臥、四故廢處、五秉法作。",
        "translation": "There are five kinds of pure places: those made with the first mind, those held with a common seal, those lying like an ox, those formerly abandoned places, and those made with the fifth principle.",
        "source": "T54n2125_002:0216c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起心作者，初造寺時定基石已，若一苾芻為撿校人者，應起如是心：「於此一寺或可一房，為僧當作淨厨也。」",
        "translation": "When he first builds a temple, if one monk is the inspector, he should give rise to this thought: \"Perhaps this monastery could be used as a purification kitchen for the saṃgha in one room.\"",
        "source": "T54n2125_002:0216c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共印持者，定寺基時若但三人者，應一苾芻告餘苾芻言：「諸具壽！",
        "translation": "A person who shares the precepts should tell one monk to the other monks when the foundation of the temple is being laid, if there are only three of them, \"Fellow monks!",
        "source": "T54n2125_002:0216c27_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆可用心印定此處。",
        "translation": "\"They can all set their minds on this place.",
        "source": "T54n2125_002:0216c28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此一寺或可一房。",
        "translation": "In this one temple, perhaps there's one room.",
        "source": "T54n2125_002:0216c29_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為僧作淨厨。」",
        "translation": "Make it a clean kitchen for the saṃgha.\"",
        "source": "T54n2125_002:0216c29_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二第三應如是說。",
        "translation": "The second and third should be explained like this.",
        "source": "T54n2125_002:0217a01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言如牛臥者，其寺屋舍猶如牛臥，房門無有定所。",
        "translation": "He says it's like a cow lying down, for which the monastery's dwelling is like a cow lying down, with no set place for the entrance to the dwelling.",
        "source": "T54n2125_002:0217a01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縱使無不作法，此處即成其淨。",
        "translation": "Even if there's no dharma that isn't created, this place will become clean.",
        "source": "T54n2125_002:0217a02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言故廢處者，謂是經久僧捨廢處，如重來者至舊觸處便為淨也。",
        "translation": "It's called a deserted place, meaning it's a deserted place that's been used for a long time as a monk's residence, so if someone comes back again and touches it, it's purified.",
        "source": "T54n2125_002:0217a03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此不得經宿，即須作法也。",
        "translation": "However, it's not allowed to pass through the years, which means it's necessary to do the Dharma.",
        "source": "T54n2125_002:0217a05_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言秉法作者，謂秉白二羯磨結界也，文如百一羯磨中說。",
        "translation": "This refers to the two karmic bonds of holding and whitening, the text of which is explained in the hundred and one kalpas.",
        "source": "T54n2125_002:0217a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如前五種作淨法已，佛言令諸苾芻得二種安樂：一在內煮、在外貯；二在外煮、在內貯，並無過也。",
        "translation": "After performing the five purifying activities as described above, the Buddha said that it would give the monks two kinds of comfort: one boiled inside and stored outside, and two boiled outside and stored inside, which is not wrong.",
        "source": "T54n2125_002:0217a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "撿驗四部眾僧，目見當今行事，并復詳觀律旨，大同如此立淨。",
        "translation": "Examining the four groups of monks and nuns, seeing what they're doing now, and carefully examining the Vinaya's teaching, the great congregation has thus established purity.",
        "source": "T54n2125_002:0217a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但未作淨之前，若共飲食同界宿者，咸有煮宿之過。",
        "translation": "However, before they purified it, if they shared the same food and drink and stayed overnight in the same place, they all had the mistake of boiling it overnight.",
        "source": "T54n2125_002:0217a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既其加法，雖共界宿無煮宿之罪，斯其教也。",
        "translation": "Now that the teaching has been added, although they share the same realm of lodging there's no offense of boiling the lodging.",
        "source": "T54n2125_002:0217a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言一寺者，總唱住處以為淨厨，房房之內生熟皆貯。",
        "translation": "When it comes to a monastery, it's called a general dwelling that's considered a clean kitchen, and both raw and cooked food are stored in the monastery's interior.",
        "source": "T54n2125_002:0217a13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其不聽內宿，豈可遣僧出外而住？",
        "translation": "If it doesn't listen to lodging inside, how can it send monks out to live there?",
        "source": "T54n2125_002:0217a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一則僧不護宿，二乃貯畜無愆。",
        "translation": "One, the saṃgha doesn't guard their lodging, and the other is that they store animals without fault.",
        "source": "T54n2125_002:0217a15_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西國相承，皆總結一寺為淨厨也。",
        "translation": "In the western countries, this is a tradition that summarizes one temple as a pure kitchen.",
        "source": "T54n2125_002:0217a16_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲局取一邊，並在開限，不同神州律師見矣。",
        "translation": "If they want to restrict themselves to one side and set limits, that's different from the view of lawyers in Shenzhou.",
        "source": "T54n2125_002:0217a17_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且如未結衣界，離宿招愆；僧若結已，離便無失。",
        "translation": "Furthermore, if a monk has not yet tied the robe border, leaving the lodging will incur a transgression; if he has tied it, then he can leave it without loss.",
        "source": "T54n2125_002:0217a18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨厨亦爾。",
        "translation": "So it is with the pure kitchen.",
        "source": "T54n2125_002:0217a19_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既其聖許，勿滯凡情。",
        "translation": "Since it's approved by the noble ones, don't hinder ordinary people.",
        "source": "T54n2125_002:0217a19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復護衣之法，界有樹等不同，但護界分，意非防女。",
        "translation": "Furthermore, when it comes to guarding one's robe, the boundary is different for trees and so forth, but it's only to guard the boundary part, not to protect the woman.",
        "source": "T54n2125_002:0217a20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨人來入厨內，豈得即是村收？",
        "translation": "When a pure person comes into the kitchen, does that mean he's taking in the village?",
        "source": "T54n2125_002:0217a21_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假令身入村坊，持衣無不護女。",
        "translation": "\"Suppose he enters a village, and there's a woman carrying a robe who doesn't protect him.",
        "source": "T54n2125_002:0217a22_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維那持衣撿校，斯亦漫為傷急矣。",
        "translation": "If Vairocana were to carry her robe and inspect it, that would be a great disservice.",
        "source": "T54n2125_002:0217a22_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四五眾安居",
        "translation": "Fourteen or five groups of people live in comfort.",
        "source": "T54n2125_002:0217a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若前安居，謂五月黑月一日。",
        "translation": "If someone had settled down earlier, it would have been the first day of the fifth month of darkness.",
        "source": "T54n2125_002:0217a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後安居，則六月黑月一日。",
        "translation": "If he retreats later, it's the first day of the dark moon of June.",
        "source": "T54n2125_002:0217a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯斯兩日合作安居，於此中間文無許處。",
        "translation": "Only these two days cooperate in the retreat, and there's no place for the text in between.",
        "source": "T54n2125_002:0217a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至八月半是前夏了，至九月半是後夏了，此時法俗盛興供養。",
        "translation": "It's the first half of the eighth month, which is the end of summer, and the second half of the ninth month, which is the end of summer, when offerings are made in abundance by the Dharma and secular world.",
        "source": "T54n2125_002:0217a27_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從八月半已後名歌栗底迦月，江南迦提設會，正是前夏了時。",
        "translation": "From the eighth and a half month onward, it's called the month of Kārttika, and Jiangnan Kārttika sets up a meeting just before the end of the summer retreat.",
        "source": "T54n2125_002:0217a28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八月十六日即是張羯絺那衣日，斯其古法。",
        "translation": "The sixteenth day of the eighth month is the day when the kārttika robe is opened, which is an ancient custom.",
        "source": "T54n2125_002:0217b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又律文云，凡在夏內有如法緣須受日者，隨有多少緣來，即須准日而受。",
        "translation": "The Vinaya also says that whenever there are conditions that necessitate accepting a day during the summer according to the rules, the day must be accepted according to the number of conditions that come along.",
        "source": "T54n2125_002:0217b02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一宿事至，受其一日；如是至七，皆對別人。",
        "translation": "When one night's business arrives, he'll accept one day, and so on up to seven, all of them against others.",
        "source": "T54n2125_002:0217b03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更有緣來，律遣重請而去。",
        "translation": "If further conditions come, the monk will be sent back with a repeated invitation and leave.",
        "source": "T54n2125_002:0217b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如過七日齊八日已去，乃至四十夜中間羯磨受八日等去，然不得過半夏在外而宿，為此但聽四十夜矣。",
        "translation": "If he leaves after seven days or eight days in a row, or if he accepts eight days or so during the forty-night interval, then he mustn't stay outside for more than half the summer; for this reason, he'll only listen to forty nights.",
        "source": "T54n2125_002:0217b05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必有病緣及諸難事須向餘處，雖不受日不破安居。",
        "translation": "They must go to another place for reasons of illness or difficulty, even though they won't receive a day off and won't violate their retreat.",
        "source": "T54n2125_002:0217b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家五眾既作安居，下眾有緣囑授而去。",
        "translation": "After the five groups of renunciant monks had made their retreat, the lower group was instructed to leave for a reason.",
        "source": "T54n2125_002:0217b09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未至夏前豫分房舍，上坐取其好者，以次分使至終。",
        "translation": "Before the summer solstice, they'll share their quarters, sit up and take the good ones, and then they'll share them in order until the end of the day.",
        "source": "T54n2125_002:0217b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "那爛陀寺現行斯法，大眾年年每分房舍。",
        "translation": "This was the current practice at Nālandā Temple, and every year the community was given a dwelling.",
        "source": "T54n2125_002:0217b11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊親教深為利益：一則除其我執，二乃普護僧房，出家之眾理宜須作。",
        "translation": "The Bhagavān himself taught it, teaching it to be profoundly beneficial: first, it removes their attachment to self, and second, it protects the saṃgha's dormitory generally, which is appropriate for laypeople to do.",
        "source": "T54n2125_002:0217b12_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然江左諸寺時有分者，斯乃古德相傳，尚行其法。",
        "translation": "However, there are times when the temples on the left side of the river are divided up, and this is a tradition of ancient virtue that still practices the Dharma.",
        "source": "T54n2125_002:0217b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈容住得一院將為己有，不觀合不遂至盡形？",
        "translation": "How could they live in a monastery that they would take for themselves and not observe the combination of things that don't lead to the completion of their form?",
        "source": "T54n2125_002:0217b15_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "良由上代不行，致使後人失法。",
        "translation": "It's a good reason why the previous generation didn't do it, which caused the later generations to lose the teaching.",
        "source": "T54n2125_002:0217b16_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能准教分者，誠有深益矣。",
        "translation": "If someone can follow the tenets of the teaching, it will be of profound benefit.",
        "source": "T54n2125_002:0217b17_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五隨意成規",
        "translation": "Fifteen Rules of Casual Formation",
        "source": "T54n2125_002:0217b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夏罷歲終之時，此日應名隨意，即是隨他於三事之中任意舉發說罪除愆之義。",
        "translation": "Whenever summer ends and the year ends, this day should be called \"at will,\" which means following others' lead in the three matters and explaining the meaning of removing sins and offenses at will.",
        "source": "T54n2125_002:0217b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊云自恣者，是義翻也。",
        "translation": "The old saying \"self-restraint\" is a corruption of that meaning.",
        "source": "T54n2125_002:0217b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必須於十四日夜請一經師昇高座誦佛經，于時俗士雲奔、法徒霧集，燃燈續明、香花供養。",
        "translation": "On the night of the fourteenth day, a sūtra master must be invited to ascend to a high seat and recite the Buddha's sūtras, at which time clouds of laypeople and wisps of Dharma disciples gather, lighting lamps and renewing the brightness, and making offerings with incense and flowers.",
        "source": "T54n2125_002:0217b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明朝總出旋繞村城，各並虔心禮諸制底，棚車輿像鼓樂張天，幡蓋縈羅飄揚蔽日，名為三摩近離，譯為和集，凡大齋日悉皆如是。",
        "translation": "In the morning, they all leave and circulate around the village, each devoutly worshipping the caitya, with carts, mules, images, drums, music, and banners and shrouds wreathing the sun, which is called samāpatti, which is translated as a harmonious gathering, and this is how it is on all the days of the great fast.",
        "source": "T54n2125_002:0217b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即是神州行城法也，禺中始還入寺，日午方為大齋。",
        "translation": "This is the method of Shenzhou Xingcheng, who first returns to the temple at midday and then observes the great fast at noon.",
        "source": "T54n2125_002:0217b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過午咸集，各取鮮茅可一把許，手執足蹈作隨意事，先乃苾芻、後方尼眾、次下三眾。",
        "translation": "After noon, they all gather together, each taking a handful of fresh grass, holding it in their hands and feet, and performing whatever they want, starting with the monks, then the nuns, and then the three lower crowds.",
        "source": "T54n2125_002:0217b28_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其眾大恐延時者，應差多人分受隨意，被他舉罪則准法說除。",
        "translation": "If there's a large crowd that's afraid of delaying the ceremony, they should send more than one person to accept the ceremony as it is, and then they should follow the teaching to remove the offense raised by others.",
        "source": "T54n2125_002:0217c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當此時也，或俗人行施、或眾僧自為，所有施物將至眾前。",
        "translation": "At that point, some laypeople may make a gift, or some monks may make it themselves, and it may be given to the congregation.",
        "source": "T54n2125_002:0217c03_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其五德應問上坐云：「此物得與眾僧為隨意物不？」",
        "translation": "The five virtues of that person should ask the superior sitter, \"Can this be given to the saṃgha as a voluntary gift?\"",
        "source": "T54n2125_002:0217c04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上坐答云：「得。」",
        "translation": "The superior monk replied, \"Yes!\"",
        "source": "T54n2125_002:0217c06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所有衣服刀子針錐之流，受已均分，斯其教也。",
        "translation": "'All the clothes, knives, needles, and pins are shared equally after they're accepted,' he said.",
        "source": "T54n2125_002:0217c06_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此日所以奉刀針者，意求聰明利智也。",
        "translation": "That's why he serves knives and needles on this day, because he wants to pursue intelligence and wisdom.",
        "source": "T54n2125_002:0217c07_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨意既訖任各東西，即是坐夏已周，無勞更經一宿。",
        "translation": "After he has finished following his heart, he can go from place to place, which means he's been sitting there all summer and hasn't had to go through another night.",
        "source": "T54n2125_002:0217c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣如餘處，此不詳言。",
        "translation": "It's as extensive as the rest, but I won't go into detail here.",
        "source": "T54n2125_002:0217c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言說罪者，意欲陳罪說己先愆，改往修來至誠懇責。",
        "translation": "When he says \"speaking of faults,\" he means to present his faults and explain his prior offenses, to make changes in the past and cultivate sincere responsibility.",
        "source": "T54n2125_002:0217c10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "半月半月為褒灑陀，朝暮朝暮憶所犯罪(褒灑是長養義，陀是淨義。",
        "translation": "He gives half a month and half a month to prajñāta, remembering the sins he's committed day after day (prajñāta means to nurture, and dhāraṇī means to purify.",
        "source": "T54n2125_002:0217c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意明長善淨除破戒之過。",
        "translation": "It means to be long and good, purifying the transgressions that break the precepts.",
        "source": "T54n2125_002:0217c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "昔云布薩者，訛略也)。",
        "translation": "(The expression poṣadha in the past was an abbreviation of a falsehood.)",
        "source": "T54n2125_002:0217c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初篇若犯，事不可治。",
        "translation": "If the first article is violated, the matter is untreatable.",
        "source": "T54n2125_002:0217c13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二有違，人須二十。",
        "translation": "If there's a violation of the second, a person must go against it.",
        "source": "T54n2125_002:0217c13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若作輕過，對不同者而除悔之。",
        "translation": "If he commits a minor infraction, he'll remove it and repent for the difference.",
        "source": "T54n2125_002:0217c14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵云痾鉢底鉢喇底提舍那。",
        "translation": "The Sanskrit word is \"utpati,\" or \"pratide,\" and it's called \"pratideśanā.",
        "source": "T54n2125_002:0217c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "痾鉢底者，罪過也。",
        "translation": "\"Upati\" is a sin.",
        "source": "T54n2125_002:0217c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鉢喇底提舍那，即對他說也。",
        "translation": "Pratideśanā, that is, speaking to others.",
        "source": "T54n2125_002:0217c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說己之非冀令清淨。",
        "translation": "He teaches his own faults in hopes of making them pure.",
        "source": "T54n2125_002:0217c16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自須各依局分，則罪滅可期；若總相談愆，非律所許。",
        "translation": "If they each follow the rules, then the sins can be expected to cease; if they discuss the transgressions in general, it's not permitted by the precepts.",
        "source": "T54n2125_002:0217c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊云懺悔，非關說罪。",
        "translation": "The old saying is repentance, not speaking of sins.",
        "source": "T54n2125_002:0217c18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者？",
        "translation": "Why is that?",
        "source": "T54n2125_002:0217c19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懺摩乃是西音，自當忍義。",
        "translation": "\"Kama is a Western sound that takes on the meaning of forbearance.",
        "source": "T54n2125_002:0217c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悔乃東夏之字，追悔為目。",
        "translation": "Repentance is an Eastern Xia phoneme, and the aim is to pursue repentance.",
        "source": "T54n2125_002:0217c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悔之與忍逈不相干。",
        "translation": "Repentance is completely unrelated to forbearance.",
        "source": "T54n2125_002:0217c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若的依梵本，諸除罪時應云至心說罪。",
        "translation": "If we were to rely on the Sanskrit text, the words used to remove sins would be \"to explain sins with utmost care.",
        "source": "T54n2125_002:0217c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以斯詳察，翻懺摩為追悔，似罕由來。",
        "translation": "Based on this detailed examination, it seems rare that the word censure is translated as repentance.",
        "source": "T54n2125_002:0217c21_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西國之人但有觸誤及身錯相觸著，無問大小，大者垂手相向，小者合掌虔恭。",
        "translation": "Whenever a person in a western country mistakenly touches or mistakenly touches his body, regardless of its size, a large person will bow their hands to each other, and a small person will put their palms together in reverence.",
        "source": "T54n2125_002:0217c22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或可撫身、或時執膞、口云懺摩，意是請恕願勿瞋責，律中云提舍那矣，恐懷後滯、就他致謝，即說懺摩之言。",
        "translation": "They may touch their bodies, sometimes hold their bases, and verbally say \"repentance,\" meaning they ask for forgiveness and hope they won't be blamed.",
        "source": "T54n2125_002:0217c24_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必若自己陳罪，乃云提舍那矣，恐懷後滯、用啟先迷。",
        "translation": "Suppose someone presents their own faults and then says, \"It's over, Tishana!\" lest they be lagging behind and use it to enlighten those who were previously confused.",
        "source": "T54n2125_002:0217c27_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖可習俗久成，而事須依本。",
        "translation": "Although it's possible to become accustomed to convention over time, the task must be based on the source.",
        "source": "T54n2125_002:0217c28_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵云鉢刺婆刺拏，譯為隨意，亦是飽足義，亦是隨他人意舉其所犯。",
        "translation": "The Sanskrit word prasenda means as one wishes, which also means to be satisfied, and it also means to lift up another person's offense according to his or her wishes.",
        "source": "T54n2125_002:0217c29_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六匙筯合否",
        "translation": "Are the sixteen spoons together?",
        "source": "T54n2125_002:0218a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西方食法唯用右手，必有病故開聽畜匙。",
        "translation": "In the West, the only way to eat is with the right hand, and there must be some illness that causes one to turn on the animal spoon.",
        "source": "T54n2125_002:0218a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其筯則五天所不聞、四部亦未見，而獨東夏共有斯事。",
        "translation": "Its key is unheard of in the five celestials and unseen in the four divisions, but it's shared only in Eastern Xia.",
        "source": "T54n2125_002:0218a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俗徒自是舊法，僧侶隨情用否。",
        "translation": "Laypeople use this as an old practice, and monks use it as they see fit.",
        "source": "T54n2125_002:0218a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "筯既不聽不遮，即是當乎略教。",
        "translation": "Since they don't listen to or refrain from using the key, it's appropriate to teach it briefly.",
        "source": "T54n2125_002:0218a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用時眾無譏議，東夏即可行焉；若執俗有嗤嫌，西土元不合捉。",
        "translation": "When it's used, the multitude has no criticism, and it can be practiced in Eastern Xia; if adherents of the secular world have objections to it, the Western land won't catch it.",
        "source": "T54n2125_002:0218a06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略教之旨，斯其事焉。",
        "translation": "This is the aim of abridging the teaching.",
        "source": "T54n2125_002:0218a08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七知時而禮",
        "translation": "XVII. Knowing the Time and Paying Homage",
        "source": "T54n2125_002:0218a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫禮敬之法須合其儀，若不順教則平地顛蹶。",
        "translation": "A person's method of worship must be in accord with his or her manner, and if he or she doesn't follow the teaching, the ground will be leveled and disturbed.",
        "source": "T54n2125_002:0218a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故佛言：「有二種污觸，不應受禮亦不禮他。」",
        "translation": "That's why the Buddha said, \"There are two kinds of defiled contact, which prevent a person from being worshipped and from worshipping others.\"",
        "source": "T54n2125_002:0218a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若違教者，拜拜皆招惡作之罪。",
        "translation": "If someone disagrees with the teaching, making prostrations will incur the sin of misdeeds.",
        "source": "T54n2125_002:0218a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂二污？",
        "translation": "What are the two defilements?",
        "source": "T54n2125_002:0218a12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一是飲食污，謂若食噉一切諸物，下至吞嚼一片之藥，若不漱口洗手已來，並不合受禮禮他。",
        "translation": "First, defiled eating means that if someone eats and devours anything down to chewing a piece of medicine, they won't be saluted unless they rinse their mouth and wash their hands afterward.",
        "source": "T54n2125_002:0218a13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若飲漿或水，乃至茶蜜等湯及酥糖之類，若未漱口洗手，禮同前犯。",
        "translation": "If someone drinks milk or water, or even tea, honey, other types of soup, or sugar, and doesn't rinse their mouth and wash their hands, the prostration is the same as the previous offense.",
        "source": "T54n2125_002:0218a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二是不淨污，謂大小行來身未洗淨，及未洗手漱口；或身或衣被便利不淨洟唾等污，未淨已來；若旦起未嚼齒木，禮同前犯。",
        "translation": "The second is impure defilement, meaning that large and small practitioners haven't washed their bodies and washed their hands and mouths, or their bodies or clothing are soiled by impure mucus and saliva that they haven't purified themselves; if they get up at dawn and haven't chewed wood, the prostration is the same as the previous offense.",
        "source": "T54n2125_002:0218a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於大眾聚集齋會之次，合掌即是致敬，故亦不勞全禮，禮便違教。",
        "translation": "Also, at the time when the assembly gathers for the meal, joining one's palms is salutation, so it's not necessary to pay full homage; therefore, paying homage would be contrary to the teaching.",
        "source": "T54n2125_002:0218a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或迮鬧處、或不淨地、或途路中，禮亦同犯。",
        "translation": "It's also the same offense to pay homage in a noisy place, on an impure spot, or on a road.",
        "source": "T54n2125_002:0218a21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯等諸事並有律文，但為日久相承、地居寒國，欲求順教事亦難為，莫不引同多以自慰，詎肯留心於小罪耳！",
        "translation": "These things are all written in the Vinaya, but because they've been passed down from day to day and live in a cold country, it's difficult to seek to conform to the teaching.",
        "source": "T54n2125_002:0218a22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八便利之事",
        "translation": "eighteen expedient circumstances",
        "source": "T54n2125_002:0218a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便利之事，略出其儀。",
        "translation": "These are brief outlines of the appropriate behavior for a person's convenience.",
        "source": "T54n2125_002:0218a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下著洗浴之裙，上披僧脚崎服，次取觸瓶添水令滿持將上廁，閉戶遮身。",
        "translation": "Putting on his bathing robe at the bottom and his monk's foot-towel robe at the top, he next fills a tumbler with water, takes it to the toilet, closes his door, and covers himself.",
        "source": "T54n2125_002:0218a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "土須二七塊，在其廁外，於甎石上或小版上而安置之。",
        "translation": "Two or seven pieces of dirt must be placed outside the latrine on a pile of stones or a small plate.",
        "source": "T54n2125_002:0218a28_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其甎版量，長一肘闊半肘。",
        "translation": "The measure of the upright plate is one elbow long and half an elbow wide.",
        "source": "T54n2125_002:0218a29_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其土碎之為末，列作兩行，一一別聚。",
        "translation": "The clay is broken up into powdered pieces and arranged in two rows, one grouped separately from the other.",
        "source": "T54n2125_002:0218b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更安一塊，復將三丸入於廁內安在一邊，一將拭體、一用洗身。",
        "translation": "Putting another piece in place, he puts three more pills into the toilet and places them on one side, one to wipe his body, and the other to wash it.",
        "source": "T54n2125_002:0218b02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "洗身之法，須將左手先以水洗，後兼土淨。",
        "translation": "To wash his body, he must first wash his left hand with water, and then he purifies it with clay.",
        "source": "T54n2125_002:0218b03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘有一丸麁，且一遍洗其左手。",
        "translation": "The other pill is soiled, and he washes his left hand once.",
        "source": "T54n2125_002:0218b04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有籌片，持入亦佳，如其用罷須擲廁外；必用故紙，可棄廁中。",
        "translation": "If there's a piece of paper, it's good to carry it in, but after using it, he must toss it out of the toilet; he must use the old paper, so he can throw it in the toilet.",
        "source": "T54n2125_002:0218b05_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既洗淨了，方以右手牽下其衣，瓶安一邊，右手撥開傍戶，還將右手提瓶而出。",
        "translation": "Once it's been washed, he then pulls off his robe with his right hand, places the vial to one side, pries open the side with his right hand, and carries the vial out with his right hand.",
        "source": "T54n2125_002:0218b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或以左臂抱瓶，拳其左手，可用右手閉戶而去。",
        "translation": "He might take the flask in his left arm, punch it with his left hand, and use his right hand to close the door and leave.",
        "source": "T54n2125_002:0218b08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就彼土處蹲坐一邊，若須坐物隨時量處。",
        "translation": "He squats down and sits to one side in that place, or if he needs to sit down, he can measure his belongings at any time.",
        "source": "T54n2125_002:0218b10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "置瓶左髀之上，可以左臂向下壓之，先取近身一七塊土，別別洗其左手，後用餘七，一一兩手俱洗，其塼木上必須淨洗。",
        "translation": "Putting the flask on his left thigh, he presses his left arm down on it, first taking one or seven pieces of dirt close to his body and washing his left hand separately, then using the other seven, washing both hands one by one, and making sure to cleanse the wood from the stūpa.",
        "source": "T54n2125_002:0218b11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "餘有一丸，將洗瓶器，次洗臂踹及足並令清潔，然後隨情而去。",
        "translation": "With the remaining one, he washes the vial, then washes his arms, legs, and feet to make them clean, and then leaves them as he sees fit.",
        "source": "T54n2125_002:0218b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此瓶之水不合入口脣。",
        "translation": "The water from this clay pot doesn't fit into your mouth or lips.",
        "source": "T54n2125_002:0218b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重至房中，以淨瓶水漱口。",
        "translation": "He goes back to his room and rinses his mouth with the pure water from the flask.",
        "source": "T54n2125_002:0218b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若其事至觸此瓶者，還須洗手漱口方可執餘器具。",
        "translation": "If he touches this clay pot, he must wash his hands and rinse his mouth before he can carry the rest of the utensils.",
        "source": "T54n2125_002:0218b16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯乃大便之儀，麁說如此。",
        "translation": "This is the ritual for taking a dump, which is crudely described like this.",
        "source": "T54n2125_002:0218b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必其省事，咸任自為；幸有供人，使澆非過。",
        "translation": "It must be done sparingly, so everyone is left to their own devices; fortunately, there are people who provide for it, so it's not a mistake to pour it out.",
        "source": "T54n2125_002:0218b18_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小便則一二之土可用洗手洗身，此即清淨之先為敬基本。",
        "translation": "For urination, one or two soils may be used to wash hands and body, which is the first and purest way to honor the fundamentals.",
        "source": "T54n2125_002:0218b19_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或人將為小事，律教乃有大呵。",
        "translation": "Some people may think it's a trifling matter, but the Vinaya teaches that it's a great heckle.",
        "source": "T54n2125_002:0218b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不洗淨，不合坐僧床，亦不應禮三寶。",
        "translation": "If someone doesn't wash their hands, they won't sit on a monk's bed, and they shouldn't worship the Three Treasures.",
        "source": "T54n2125_002:0218b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是身子伏外道法，佛因總制苾芻。",
        "translation": "This is the body's son's method of subduing non-Buddhists, which is the Buddha's general rule for monks.",
        "source": "T54n2125_002:0218b23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修之則奉律福生，不作乃違教招罪。",
        "translation": "If they cultivate it, then the virtue of following the precepts will arise, and if they don't do it, they'll incur a sin by disobeying the teaching.",
        "source": "T54n2125_002:0218b23_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯則東夏不傳，其來尚矣；設令啟示，遂起嫌心。",
        "translation": "Thus, it hadn't been transmitted in the Eastern Xia region since long ago, but if he had asked to reveal it, he would have become disliked.",
        "source": "T54n2125_002:0218b24_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即道：「大乘虛通，何淨何穢？",
        "translation": "He then said, \"What's pure and what's defiled about the great vehicle's virtual ability?",
        "source": "T54n2125_002:0218b25_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "腹中恒滿，外洗寧益？」",
        "translation": "How can external cleansing be beneficial when the belly is constantly full?\"",
        "source": "T54n2125_002:0218b26_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "詎知輕欺教撿、誣罔聖心，受禮禮他俱招罪過，著衣噉食天神共嫌。",
        "translation": "\"Inadvertently, they deceive the authorities and falsely deceive the noble mind, incurring the transgressions of worshiping others and wearing robes and eating food that are disliked by gods and goddesses alike.",
        "source": "T54n2125_002:0218b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不洗淨，五天同笑，所至之處人皆見譏。",
        "translation": "If they don't cleanse themselves, the five heavens will laugh with them, and people will see and criticize them wherever they go.",
        "source": "T54n2125_002:0218b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弘紹之賓，特宜傳教。",
        "translation": "It's especially appropriate for a guest of Vaiśravaṇa to transmit his teaching.",
        "source": "T54n2125_002:0218b29_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既而厭離塵俗、捨家趣非家，即須慇懃用釋父之言，何得睚眥於毘尼之說！",
        "translation": "Now that they've become disillusioned with the worldly and abandoned their homes for non-homes, they must diligently follow the words of their father, so why should they hesitate to discuss the teachings of Vairocana?",
        "source": "T54n2125_002:0218c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其不信，幸可依此洗之五六日間，便知不洗之過。",
        "translation": "If you don't believe it, you can fortunately follow this for five or six days, and then you'll know the error of not washing.",
        "source": "T54n2125_002:0218c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然而寒冬之月須作煖湯，自外三時事便隨意。",
        "translation": "However, in the cold months of winter, warm baths must be made, so you can do as you like during the three external seasons.",
        "source": "T54n2125_002:0218c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然有筒槽帛拂，非本律文。",
        "translation": "However, there's a tube, a trough, and a whisk, which are not the text of the Vinaya.",
        "source": "T54n2125_002:0218c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有含水將去，亦乖淨法。",
        "translation": "Perhaps there's water in it that's about to be removed, which is also contrary to the pure precepts.",
        "source": "T54n2125_002:0218c05_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡是僧坊，先須淨治廁處，若自無力，教化為之供十方僧。",
        "translation": "In every monk's residence, the toilet must first be purified, and if he lacks the strength to do so, he must be taught to make offerings to the saṃgha in the ten directions.",
        "source": "T54n2125_002:0218c06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理通凡聖，無多所費，斯其要焉。",
        "translation": "This is essential because the principle is shared with both worldlings and sages, and there's no need for much expense.",
        "source": "T54n2125_002:0218c07_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是淨方業，固非虛矣。",
        "translation": "This purification of the monks' quarters is certainly not in vain.",
        "source": "T54n2125_002:0218c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理須大槽可受一兩石，貯土令滿置在圊邊，大眾必無私房可畜。",
        "translation": "The principle requires a large trough that accepts one or two stones, stocking it with dirt so that it's full and placing it near the toilet, so the public surely won't have a private room to store it in.",
        "source": "T54n2125_002:0218c09_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若卒無水瓶，許用瓷瓦等鉢，盛水將入安在一邊，右手澆洗亦無傷也。",
        "translation": "If there is no water jar, perhaps a ceramic tile bowl can be used, filled with water and placed on one side, so that the right hand can wash it without harm.",
        "source": "T54n2125_002:0218c10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "江淮地下瓫廁者多，不可於斯即為洗淨，宜應別作洗處，水流通出為善。",
        "translation": "There are many toilets in the underground jars of Jiangxi and Huai, so it's not appropriate to cleanse them right there; rather, it's better to make a separate place for washing where water can flow out.",
        "source": "T54n2125_002:0218c12_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且如汾州抱腹、岱岳靈巖、荊府玉泉、楊州白塔，圊廁之所頗傳其法，然而安置水土片有闕如。",
        "translation": "For example, there are toilet places such as the one at Fenzhou's Embracing the Belly, Dayue's Spiritual Rock, Jingfu's Yuquan, and Yangzhou's White Pagoda, where the Dharma has been quite often transmitted, but there are shortcomings in the placement of pieces of water and soil.",
        "source": "T54n2125_002:0218c14_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "向使早有人教，行法亦不殊王舍。",
        "translation": "If someone had taught them earlier, their practice would not have been different from that of the king's quarters.",
        "source": "T54n2125_002:0218c16_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯乃先賢之落漠，豈是後進之蒙籠者哉。",
        "translation": "This is the indifference of our predecessors, isn't it the obscuration of those who advanced later?",
        "source": "T54n2125_002:0218c17_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然其廁內貯土置瓶，並須安穩勿令闕事。",
        "translation": "Still, they must store soil and vases in their latrines, and they must be stable so that nothing is left undone.",
        "source": "T54n2125_002:0218c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "添瓶之罐著[此/朿]為佳，如畜君持准前為矣。",
        "translation": "It's better to put [this/that] on a jar to fill it, as the monk in charge of the animal's quarters did before.",
        "source": "T54n2125_002:0218c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "銅瓶插蓋而口寬，元來不中洗淨，若其腹邊斲為一孔、頂上以錫固之，高出尖臺中安小孔，此亦權用，當時須也。",
        "translation": "A copper vase with a wide lid and a wide mouth that's not washed in the first place should be carved with a hole in the belly, fastened with tin at the top, and raised above the steeple to put a small hole in it.",
        "source": "T54n2125_002:0218c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "重曰：載勞紙筆幾致慇懃，順流從諫冀有其人？",
        "translation": "Again, he said, \"How many times have I been so kind as to go along with the paper and pencil, and I hope there's someone who follows the advice?",
        "source": "T54n2125_002:0218c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大聖既雙林而寂體，羅漢亦五印而灰身，遺餘法教影響斯晨，行寄捐生之侶、興由棄俗之賓，捨渾渾之煩濁、慕皎皎之清塵，外垢與內惑而俱喪、上結共下縛而同湮，蕭條其跡、爽亮其神，四儀無累、三尊是親，既不被生人之所笑，豈復怖死王之見瞋？",
        "translation": "As the great sage has become tranquil in both forests, the arhat has become ashes in five seals, and the remaining teachings of the Dharma resonate in the morning, the practice is entrusted to the companion who donates his life, the rise is due to the guest who abandons the secular world, the turbidity of the turbid is abandoned, the clarity of the bright is adored, the external defilements and internal afflictions are both removed, the upper bonds and lower fetters are both annihilated, the traces are desolate, the spirit is crisp and bright, the four manners are unencumbered, the three honored ones are dear, and he is not laughed at by the living, how could he fear the wrath of the king of death in his eyes?",
        "source": "T54n2125_002:0218c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "利九居而軫念，成三代之芳因。",
        "translation": "The nine abodes of the Buddha's life have been profitable and inconceivable, and the cause of his fragrance has been established for three generations.",
        "source": "T54n2125_002:0219a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幸希萬一而能改，亦寧辭二紀之艱辛。",
        "translation": "It's fortunate that it's possible to change in the hope of attaining unity, and I would rather resign from the hardships of two centuries.",
        "source": "T54n2125_002:0219a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南海寄歸內法傳卷第二",
        "translation": "Nanhai yigui neifa zhuan, vol. 2",
        "source": "T54n2125_002:0219a04_0",
        "is_bad_quality": false
    }
]