[
    {
        "source_sentence": "貞元新定釋教目錄卷第二十九",
        "translation": "Zhenyan Revised List of Canonical Buddhist Texts, Volume 29",
        "source": "T55n2157_029:1024a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(入藏錄上)",
        "translation": "(on the Record of Entering the Canon)",
        "source": "T55n2157_029:1024a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "西京西明寺沙門圓照撰",
        "translation": "Xijings Ximing Temple, written by the monk Yuanzhao",
        "source": "T55n2157_029:1024a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合大小乘經律論及聖賢集傳兼貞元新入藏經。",
        "translation": "It combines the scriptures, vinaya, and treatises of the great and small vehicles, the biographies of the Śrīgupta Collection, and the new scriptures of the Zhenyan Canon.",
        "source": "T55n2157_029:1024a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總一千二百五十八部。",
        "translation": "There are 1,258 sūtras in total.",
        "source": "T55n2157_029:1024a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合五千三百九十卷。",
        "translation": "It's 5,390 volumes in total.",
        "source": "T55n2157_029:1024a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百一十帙。",
        "translation": "Five hundred and ten volumes.",
        "source": "T55n2157_029:1024a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘入藏錄上",
        "translation": "On the Record of the Mahāyāna Entry into the Canon",
        "source": "T55n2157_029:1024a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘經六百八十二部。",
        "translation": "There are six hundred and eighty-two great vehicle scriptures.",
        "source": "T55n2157_029:1024a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二千四百一十三卷。",
        "translation": "Two thousand four hundred and thirteen volumes.",
        "source": "T55n2157_029:1024a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二百二十一帙。",
        "translation": "Two hundred and twenty-one books.",
        "source": "T55n2157_029:1024a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘律二十七部。",
        "translation": "The twenty-seven great vehicle vinaya texts.",
        "source": "T55n2157_029:1024a25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五十五卷五帙。",
        "translation": "There are fifty-five volumes and five treatises.",
        "source": "T55n2157_029:1024a25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘論九十九部。",
        "translation": "There are ninety-nine great vehicle treatises.",
        "source": "T55n2157_029:1024a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百二十卷五十帙。",
        "translation": "Five hundred and twenty volumes and fifty books.",
        "source": "T55n2157_029:1024a26_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘經重單合譯四百九十一部二千四十卷大般若波羅蜜多經六百卷(十六會說六十帙)一萬三百三十一紙放光般若波羅蜜經三十卷(亦云放光摩訶般若經亦云摩訶般若放光經三帙或二十卷)四百六十六紙摩訶般若波羅蜜經四十卷(亦云大品般若經僧祐錄云新大品經四帙或二十四卷或二十七卷或三十卷)六百二十三紙光讚般若波羅蜜經十五卷(亦云光讚摩訶般若經或十卷二十七品)二百二十一紙摩訶般若波羅蜜鈔經五卷(或無鈔字亦名長安品經一名須菩提品經或七卷)九十紙金剛頂瑜伽般若理趣經一卷(經題內云大樂金剛不空真實三摩耶經般若波羅蜜多理趣品大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)八紙般若理趣經釋二卷(經內題云大樂金剛不空真實三昧耶經般若波羅蜜多理趣釋大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)二十三紙上四經二十三卷二帙。",
        "translation": "The four hundred and ninety-one parts of the Mahāyāna scriptures were translated into two thousand forty volumes. The six hundred volumes of the Mahāprajñāpāramitā-sūtra (sixteen sessions of sixty volumes) were thirteen thousand three hundred and thirty-one pages.",
        "source": "T55n2157_029:1024a27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道行般若波羅蜜經十卷(一帙題云摩訶般若波羅蜜道行經或八卷或云般若道行經)一百六十七紙小品般若波羅蜜經十卷(一帙題云摩訶般若波羅蜜或無小品字僧祐錄云新小品經或八卷)一百五十紙大明度無極經四卷(亦直云大明度經或六卷)九十四紙勝天王般若波羅蜜經七卷一百二十二紙上二經十一卷同帙。",
        "translation": "The Daoxing banruo boluomi jing in ten volumes (one volume is titled the mohe boruo boluomi daoxing jing or eight volumes, or the banruo daoxing jing), the one hundred and sixty-seven paper xiaopin banruo boluomi jing in ten volumes (one volume is titled the mohe boruo boluomi or no xiaopin characters, and the sengyou lu yunxin xiaopin jing or eight volumes), the one hundred and fifty paper damingdu jing in four volumes (also directly titled the damingdu jing or six volumes), the ninety-four paper shengtianwang banruo boluomi jing in seven volumes, and the one hundred and twenty-two paper sūtra in two volumes and eleven volumes in the same volume.",
        "source": "T55n2157_029:1024b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利所說摩訶般若波羅蜜經二卷(或直云文殊般若波羅蜜經或一卷)二十一紙文殊師利所說般若波羅蜜經一卷二十紙濡首菩薩無上清淨分衛經二卷(一名決了請法幻化三昧)二十八紙金剛般若波羅蜜經一卷(舍衛)一十一紙金剛般若波羅蜜經一卷(婆伽婆)一十四紙金剛般若波羅蜜經一卷(祇樹林)一十四紙能斷金剛般若波羅蜜多經一卷(室羅筏)一十九紙能斷金剛般若波羅蜜多經一卷(名稱城)一十二紙實相般若波羅蜜經一卷八紙上九經十一卷同帙。",
        "translation": "Wenshushili suoshuo mohebore boluomi jing 2 rolls (also directly called wenshu boruo boluomi jing or one roll) 21 pages Wenshushili suoshuo boruo boluomi jing 1 roll 20 pages Mochou pusa wushan chingfang fenwei jing 2 rolls (a samādhi that decisively requests the illusory transformation of the Dharma) 28 pages Jingang boruo boluomi jing 1 roll (shayai) 11 pages Jingang boruo boluomi jing 1 roll (bhagavat) 14 pages Jingang boruo boluomi jing 1 roll (jilin) 14 pages Nengjian jiangbore boluomi tuo 1 roll (śrāvastī) 19 pages Nengjian jiangbore boluomi tuo 1 roll (name city) 12 pages The true character of the prajñāpāramitā jing 1 roll 8 pages 上九經十一卷 同帙。",
        "source": "T55n2157_029:1024b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁王護國般若波羅蜜經二卷(亦云仁王般若經或一卷)二十八紙新譯仁王經二卷(內題云仁王護國般若波羅蜜多經御製序)三十五紙(大興善寺沙門大廣智不空奉詔譯)仁王般若陀羅尼釋一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)七紙仁王般若念誦法經一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)六紙仁王念誦儀軌一卷(經內題云仁王護國般若波羅蜜多經陀羅尼念誦儀永泰元年大興善寺三藏沙門大廣智不空奉詔譯)十九紙摩訶般若波羅蜜大明呪經一卷(亦云摩訶大明呪經)一紙般若波羅蜜多心經一卷(亦云般若心經)一紙普遍智藏般若波羅蜜多心經一卷(東天竺國三藏沙門法月譯貞元新入目錄)二紙新譯般若波羅蜜多心經一卷(罽賓國三藏賜紫沙門般若奉詔譯貞元新入目錄)二紙修習般若波羅蜜菩薩觀行念誦儀軌一卷七紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄七紙)大曼茶羅十七尊釋一卷(經內題云般若波羅蜜多理趣經大安樂不空三昧耶真實金剛菩薩等一十七尊大曼茶羅義述大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)三紙上十一經十三卷同帙。",
        "translation": "仁王護國般若波羅蜜經二卷(亦云仁王般若經或一卷)二十八紙新譯仁王經二卷(內題云仁王護國般若波羅蜜多經御製序)三十五紙(大興善寺沙門大廣智不空奉詔譯)仁王般若陀羅尼釋一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)七紙仁王般若念誦法經一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)六紙仁王念誦儀軌一卷(經內題云仁王護國般若波羅蜜多經陀羅尼念誦儀永泰元年大興善寺三藏沙門大廣智不空奉詔譯)十九紙摩訶般若波羅蜜大明呪經一卷(亦云摩訶大明呪經)一紙般若波羅蜜多心經一卷(亦云般若心經)一紙普遍智藏般若波羅蜜多心經一卷(東天竺國三藏沙門法月譯貞元新入目錄)二紙新譯般若波羅蜜多心經一卷(罽賓國三藏賜紫沙門般若奉詔譯貞元新入目錄)二紙修習般若波羅蜜菩薩觀行念誦儀軌一卷七紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄七紙)大曼茶羅十七尊釋一卷(經內題云般若波羅蜜多理趣經大安樂不空三昧耶真實金剛菩薩等一十七尊大曼茶羅義述大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)三紙上十一經十三卷同帙。",
        "source": "T55n2157_029:1024c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "守護國界主陀羅尼經一部十卷(一帙罽賓國三藏沙門般若共牟尼室利於貞元六年譯)一百五十五紙大寶積經一百二十卷(四十九會合成一部一十二帙)一千九百九十一紙大方廣三戒經三卷四十六紙無量清淨平等覺經二卷(亦直云無量清淨)六十一紙阿彌陀經二卷(上卷題云佛說阿彌陀三耶三佛薩樓佛檀過度人道經亦名無量壽經)五十五紙無量壽經二卷三十九紙上四經九卷同帙。",
        "translation": "守護國界主陀羅尼經一部十卷(一帙罽賓國三藏沙門般若共牟尼室利於貞元六年譯)一百五十五紙大寶積經一百二十卷(四十九會合成一部一十二帙)一千九百九十一紙大方廣三戒經三卷四十六紙無量清淨平等覺經二卷(亦直云無量清淨)六十一紙阿彌陀經二卷(上卷題云佛說阿彌陀三耶三佛薩樓佛檀過度人道經亦名無量壽經)五十五紙無量壽經二卷三十九紙上四經九卷同帙。",
        "source": "T55n2157_029:1025a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿閦佛國經二卷(一名阿閦佛剎諸菩薩學成品經或一卷)四十紙阿閦如來念誦法一卷(經內題云念誦供養法)二十紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)大乘十法經一卷(佛住王舍城者)二十紙普門品經一卷(亦云普門經)一十二紙胞胎經一卷(一名胞胎受身經)一十五紙文殊師利佛土嚴淨經二卷(或直云嚴淨佛土經亦直云佛土嚴淨經)三十四紙大聖文殊師利菩薩佛剎功德莊嚴經三卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)五十一紙法鏡經二卷(或一卷)二十五紙上八經十三卷同帙。",
        "translation": "阿閦佛國經二卷(一名阿閦佛剎諸菩薩學成品經或一卷)四十紙阿閦如來念誦法一卷(經內題云念誦供養法)二十紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)大乘十法經一卷(佛住王舍城者)二十紙普門品經一卷(亦云普門經)一十二紙胞胎經一卷(一名胞胎受身經)一十五紙文殊師利佛土嚴淨經二卷(或直云嚴淨佛土經亦直云佛土嚴淨經)三十四紙大聖文殊師利菩薩佛剎功德莊嚴經三卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)五十一紙法鏡經二卷(或一卷)二十五紙上八經十三卷同帙。",
        "source": "T55n2157_029:1025a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "郁迦羅越問菩薩行經一卷(或云郁迦長者問居家菩薩行經或二卷)二十五紙幻士仁賢經一卷(或云仁賢幻士經)一十八紙決定毘尼經一卷(一名破壞一切心識)一十七紙發覺淨心經一卷二十八紙優填王經一卷五紙須摩提經一卷(有加菩薩字亦云須摩經)八紙須摩提菩薩經一卷九紙阿闍貰王女阿術達菩薩經一卷(亦云阿闍貰女經亦直云阿述達經)二十三紙離垢施女經一卷三十三紙上九經十卷同帙。",
        "translation": "郁迦羅越問菩薩行經一卷(或云郁迦長者問居家菩薩行經或二卷)二十五紙幻士仁賢經一卷(或云仁賢幻士經)一十八紙決定毘尼經一卷(一名破壞一切心識)一十七紙發覺淨心經一卷二十八紙優填王經一卷五紙須摩提經一卷(有加菩薩字亦云須摩經)八紙須摩提菩薩經一卷九紙阿闍貰王女阿術達菩薩經一卷(亦云阿闍貰女經亦直云阿述達經)二十三紙離垢施女經一卷三十三紙上九經十卷同帙。",
        "source": "T55n2157_029:1025b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得無垢女經一卷(一名論議辯才門經或云無垢女經)二十五紙文殊師利所說不思議佛境界經二卷(或一卷又有一本乃是為經性悔題為文殊所說應當審觀)二十四紙如幻三昧經二卷(或三卷或四卷)五十七紙聖善住意天子所問經三卷(或四卷)五十七紙太子刷護經一卷五紙太子和休經一卷(或云私休)四紙上六經十卷同帙。",
        "translation": "One volume of the Attaining the Lady of Immaculate Conception sūtra (a sūtra on the eloquence of argumentation or the Lady of Immaculate Conception sūtra); two volumes of the 25-page Mañjuśrī's Teaching on the Inconceivable Buddha's Realm sūtra (or one volume and one copy of the sūtra on the repentance of the nature of the scriptures as taught by Mañjuśrī, which should be examined); two volumes of the 24-page Ruifan sanmei sūtra (or three or four volumes); three (or four) volumes of the 57-page Sutra on the Questions of the Son of the Sacred and Well-Adorned Mind; one volume of the 57-page Sutra on the Crown Prince's Brush Guard; one volume of the five-page Sutra on the Crown Prince's Harmonizing and Resting; and ten volumes of the four-page and six sūtras on the same page.",
        "source": "T55n2157_029:1025b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧上菩薩問大善權經二卷(或一卷或直云大善權經或云惠上菩薩經或云善權方便經或云方便所度無極經)三十二紙大乘顯識經二卷二十五紙大乘方等要慧經一卷一紙彌勒菩薩所問本願經一卷(或無所問字一名彌勒難經亦云彌勒本願經)八紙佛遺目摩尼寶經一卷(一名古品遺日說般若經一名大寶積經一名摩訶衍寶嚴經)一十六紙摩訶衍寶嚴經一卷(一名大迦葉品)二十紙勝鬘師子吼一乘大方便方廣經一卷(亦直名勝鬘或二卷)一十九紙毘耶娑問經二卷三十四紙上八經十一卷同帙。",
        "translation": "Thirty-two pages of the Mahāyāna Sutra of Revealing Consciousness, two volumes, twenty-five pages of the Mahāyāna Sutra of Essentials of Wisdom, one volume, one paper of the Maitreya Sutra of Questions, one volume of the Maitreya Sutra of Difficulties, and eight papers of the Maitreya Sutra of Past Vows.",
        "source": "T55n2157_029:1025b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方等大集經三十卷(三帙或二十九卷或三十一卷或三十二卷或四十卷)六百二十一紙大方等大集日藏經十卷(一帙題云大乘大方等日藏分經或十二卷或十五卷)二百六紙大集月藏經十卷(一帙題云大集經月藏分第十二或十二卷或十三卷)一百一十九紙地藏菩薩問法身讚一卷(經內題云百千頌大集經地藏菩薩請問法身讚貞元新入目錄)五紙大乘大集地藏十輪經十卷一百六十五紙上二經十一卷同帙。",
        "translation": "大方等大集經三十卷(三帙或二十九卷或三十一卷或三十二卷或四十卷)六百二十一紙大方等大集日藏經十卷(一帙題云大乘大方等日藏分經或十二卷或十五卷)二百六紙大集月藏經十卷(一帙題云大集經月藏分第十二或十二卷或十三卷)一百一十九紙地藏菩薩問法身讚一卷(經內題云百千頌大集經地藏菩薩請問法身讚貞元新入目錄)五紙大乘大集地藏十輪經十卷一百六十五紙上二經十一卷同帙。",
        "source": "T55n2157_029:1025c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大方廣十輪經八卷一百九紙",
        "translation": "Daśacakra-kṣitigarbha-sūtra, eight volumes, one hundred and nine pages.",
        "source": "T55n2157_029:1025c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大集須彌藏經二卷(內題云大集經須彌藏分第五)三十八紙上二經十卷同帙。",
        "translation": "Daji shumizang jing (Daji jing shumizang fen fifth) 38 pages; the above two sūtras in ten volumes are the same.",
        "source": "T55n2157_029:1025c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏菩薩經一卷二十七紙",
        "translation": "Xukongzang pusa jing 1 roll of 27 pages",
        "source": "T55n2157_029:1025c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空藏菩薩神呪經一卷一十七紙",
        "translation": "Xukongzang pusa shenzhou jing (Xukongzang pusa shenzhou jing), one roll, one seventeen pages",
        "source": "T55n2157_029:1025c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "虛空孕菩薩經二卷三十一紙",
        "translation": "Ākāśagarbha-sūtra, 2 volumes, 31 pages",
        "source": "T55n2157_029:1025c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀虛空藏菩薩經一卷(亦名虛觀經或無觀字)三紙(貞元新入目錄)大虛空藏菩薩念誦法一卷五紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)上六經十四卷同一帙。",
        "translation": "The Ākāśagarbha-sūtra in one volume (also called the Ākāśagarbha-sūtra or without the word Ākāśagarbha) of three pages (newly entered into the catalogue during the Zhenyan period), and the Ākāśagarbha-nirdeśa-sūtra in one volume of five pages (translated by the imperial edict of the Tripiṭaka Master of the Daxingshan Temple, Dagong Zhi Bukong, into the catalogue during the Zhenyan period).",
        "source": "T55n2157_029:1025c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩念佛三昧經六卷(或無菩薩字或五卷)九十八紙大方等大集菩薩念佛三昧經十卷(一帙題云大方等大集經菩薩念佛三昧分)一百三十四紙般舟三昧經三卷(一名十方見在佛悉在前立定經或云大般舟三昧經或二卷)五十紙拔陂菩薩經一卷(亦云拔波安錄云颰拔陀)一十四紙大方等大集賢護經五卷(或六卷題云大方等大集經賢護菩薩經亦直云賢護經)上五經二十五卷分三帙。",
        "translation": "菩薩念佛三昧經六卷(或無菩薩字或五卷)九十八紙大方等大集菩薩念佛三昧經十卷(一帙題云大方等大集經菩薩念佛三昧分)一百三十四紙般舟三昧經三卷(一名十方見在佛悉在前立定經或云大般舟三昧經或二卷)五十紙拔陂菩薩經一卷(亦云拔波安錄云颰拔陀)一十四紙大方等大集賢護經五卷(或六卷題云大方等大集經賢護菩薩經亦直云賢護經)上五經二十五卷分三帙。",
        "source": "T55n2157_029:1025c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿差末經七卷(晉曰無盡意或四卷或五卷或云阿差末菩薩經)九十二紙無盡意菩薩經六卷(初題云大集經中無盡意所說不可盡義品第三十二或云阿差末經或直云無盡意經)八十九紙上二經十三卷同帙。",
        "translation": "The Sutra of Ajātaśatru in seven volumes (Jin called the Sutra of Endless Meaning, or four volumes, or five volumes, or Ajātaśatru) in ninety-two pages, and the Sutra of the Bodhisattva of Endless Meaning in six volumes (first titled the Thirty-second Chapter of the Inexhaustible Meaning Explained in the Sutra of the Great Collection, or Ajātaśatru, or simply the Sutra of Endless Meaning) in eighty-nine pages, and the above two sūtras in thirteen volumes.",
        "source": "T55n2157_029:1026a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大集譬喻王經二卷(或無大集字)三十四紙大哀經八卷(或云如來大哀經或六卷七卷)一百一十七紙上二經十卷同帙。",
        "translation": "Daji mieyao wang jing 2 rolls (or without the word Daji) 34 pages Daji jing 8 rolls (or as the Tathāgata daji jing or 6 rolls and 7 rolls) 117 pages on top of 2 sūtras in 10 rolls of the same book.",
        "source": "T55n2157_029:1026a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶女所問經三卷(或直云寶女經亦云寶女問惠經或云寶女三昧經或四卷)六十四紙無言童子經二卷(或云無言菩薩經或一卷)四十紙自在王菩薩經二卷(或無菩薩字)三十四紙奮迅王問經二卷四十一紙上四經九卷同帙。",
        "translation": "The Jeweled Maiden's Questions Sutra in three rolls (or just the Jeweled Maiden Sutra, the Jeweled Maiden's Questions Sutra, or the Jeweled Maiden's Samādhi Sutra in four rolls), the Boy Without Words Sutra in two rolls (or the Bodhisattva Without Words Sutra in one roll), the Zizaiwang Bodhisattva Sutra in two rolls (or without the word bodhisattva), the Fenxun Wang's Questions Sutra in two rolls, the Fenxun Wang's Questions Sutra in four rolls, the upper four sūtras in nine rolls, and the upper four sūtras in nine rolls of the same volume.",
        "source": "T55n2157_029:1026a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶星陀羅尼經十卷(一帙或八卷)一百三十三紙大方廣佛華嚴經六十卷(八會說舊譯六帙或五十卷)一千七十九紙大方廣佛花嚴經八十卷(九會說新譯八帙)一千三百二十七紙新譯大方廣佛花嚴經四十卷六百一十二紙(四帙罽賓國三藏賜紫沙門般若奉詔譯貞元新入目錄)普賢行願讚一卷(貞元新入目錄)五紙(大興善寺三藏沙門大廣智不空奉詔譯)文殊問字母品經一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)瑜伽金剛頂經釋字母品一卷(貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)花嚴入法界四十二字觀門一卷(內題大方廣佛華嚴經貞元新入目錄)六紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂經瑜伽文殊師利菩薩儀軌供養法一品十四紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)金剛頂文殊菩薩經一卷(貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)曼殊室唎童子菩薩五字瑜伽法一卷(并梵字貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)五字陀羅尼頌一卷(并梵字貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂超勝三界經說文殊五字真言勝相一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)三紙文殊讚法身禮一卷(經內題云文殊師利菩薩讚法身并序)三紙(大興善寺三藏沙門大廣智不空奉詔譯)信力入印法門經五卷九十五紙上十一經十五卷同一帙。",
        "translation": "寶星陀羅尼經十卷(一帙或八卷)一百三十三紙大方廣佛華嚴經六十卷(八會說舊譯六帙或五十卷)一千七十九紙大方廣佛花嚴經八十卷(九會說新譯八帙)一千三百二十七紙新譯大方廣佛花嚴經四十卷六百一十二紙(四帙罽賓國三藏賜紫沙門般若奉詔譯貞元新入目錄)普賢行願讚一卷(貞元新入目錄)五紙(大興善寺三藏沙門大廣智不空奉詔譯)文殊問字母品經一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)瑜伽金剛頂經釋字母品一卷(貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)花嚴入法界四十二字觀門一卷(內題大方廣佛華嚴經貞元新入目錄)六紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂經瑜伽文殊師利菩薩儀軌供養法一品十四紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)金剛頂文殊菩薩經一卷(貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)曼殊室唎童子菩薩五字瑜伽法一卷(并梵字貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)五字陀羅尼頌一卷(并梵字貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂超勝三界經說文殊五字真言勝相一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)三紙文殊讚法身禮一卷(經內題云文殊師利菩薩讚法身并序)三紙(大興善寺三藏沙門大廣智不空奉詔譯)信力入印法門經五卷九十五紙上十一經十五卷同一帙。",
        "source": "T55n2157_029:1026a21_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "度諸佛境界智光嚴經一卷(或二卷)一十七紙大方廣入如來智德不思議經一卷一十四紙佛花嚴入如來智德不思議境界經三卷二十二紙大方廣佛華嚴經不思議佛境界一卷(或二卷)一十二紙大方廣如來不思議境界經一卷一十一紙大乘金剛髻珠菩薩修行分一卷(亦名金剛鬘菩薩加行品)十八紙大方廣佛花嚴經修慈分一卷七紙大方廣普賢菩薩所說經一卷(別有一本向三十紙非是本經應須簡)五紙莊嚴菩提心經一卷七紙上九經十一卷同一帙。",
        "translation": "The Sutra of the Radiant Adornment of the Buddha's Realm of Knowledge (or two volumes) is one volume (or two volumes) and one seventeen pages (one volume) and one fourteen pages (three volumes) of the Sutra of the Inconceivable Realm of the Tathāgata's Flower Adornment and the Inconceivable Realm of the Tathāgata's Knowledge (or two volumes) and one twelve pages (one volume) of the Sutra of the Inconceivable Realm of the Tathāgata's Knowledge (or two volumes).",
        "source": "T55n2157_029:1026b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說十力經一卷(安西三藏勿提提犀魚於蓮花寺譯貞元新入目錄)三紙佛說迴向輪經一卷(貞元新入目錄)三紙半(于闐三藏沙門尸羅達摩於北庭龍興寺譯)佛說十地經九卷(于闐三藏沙門尸羅達摩於北庭龍興寺譯安西北庭進入貞元新入目錄)一百二十一紙大方廣菩薩十地經一卷七紙上四經十二卷同一帙。",
        "translation": "The Sutra of the Ten Powers One Roll (translated by the Anzai Tripiṭaka Bhadrika at Lianhuasi), the Sutra of the Revolving Wheel One Roll (translated by the Anzai Tripiṭaka at Lianhuasi), the Sutra of the Ten Stages Three and a Half Pages (translated by the Yutan Tripiṭaka Śrāmaṇer Dharma at Yongxing Temple in North India), the Sutra of the Ten Stages Nine Rolls (translated by the Yutan Tripiṭaka Śrāmaṇer Dharma at Yongxing Temple in North India), and the Anzai North India entry in the Zhenyuan New Catalog One Hundred and Twenty-One Pages (translated by the Anzai North India at Yongxing Temple in North India), the Sutra of the Ten Stages of the Great and Wide Bodhisattva One Roll Seven Pages, and the Upper Four Sutras Twelve Rolls in the same volume.",
        "source": "T55n2157_029:1026c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兜沙經一卷五紙",
        "translation": "The Daśabhūmika-sūtra is one volume and five pages long.",
        "source": "T55n2157_029:1026c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩本業經一卷(亦直名本業經亦名淨行品經)一十二紙諸菩薩求佛本業經一卷(或無諸字)一十一紙菩薩十住行道品一卷(或直云菩薩十住)八紙菩薩十住經一卷五紙漸備一切智德經五卷(或十卷一名十住又名大慧光三昧)一百五紙上六經十卷同一帙。",
        "translation": "The Sutra of the Ten Stages of Bodhisattva Practice in One Volume (also directly called the Sutra of Original Actions and the Sutra of the Chapter on Pure Conduct) is twelve pages long, and the Sutra of the Ten Stages of Bodhisattva Practice in One Volume (or none of the words) is eleven pages long.",
        "source": "T55n2157_029:1026c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十住經四卷(或五卷)九十七紙",
        "translation": "The Sutra of the Ten Abodes is four (or five) rolls of ninety-seven pages.",
        "source": "T55n2157_029:1026c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等目菩薩所問三昧經二卷(或名普賢菩薩定意或直云等目菩薩經)五十二紙顯無邊佛土功德經一卷二紙如來興顯經四卷(一名興顯如幻經)六十二紙上四經十一卷同帙。",
        "translation": "The Samādhi Sutra of the Questions of the Samantabhadra Bodhisattva (also known as the Samantabhadra Sutra of the Samantabhadra Bodhisattva of Universal Worthy or simply as the Samantabhadra Sutra of the Samantabhadra Bodhisattva of the Samantabhadra Bodhisattva of the Samantabhadra) is fifty-two pages long and reveals the merits of the infinite Buddha-lands in one volume and two pages Tathāgata Rising and Shining Sutra in four volumes (a Rising and Shining Rājñāpāramitā Sutra) is sixty-two pages long and the above four sūtras are eleven volumes long.",
        "source": "T55n2157_029:1026c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "度世品經六卷(或五卷或無品字)一百二十紙羅摩伽經三卷(或四卷)七十二紙大方廣佛花嚴經續入法界品一卷(或無續字)八紙上三經十卷同帙。",
        "translation": "Six Fascicle Sutra of the Gaṇḍavyūha Chapter (or five fascicles, or no chapter), One Hundred and Twenty Pages, Three Fascicle Sutra of the Lāmaka Chapter (or four fascicles), and Seventy-two Pages, One Fascicle of the Flower Ornament Sutra of the Great and Wide Buddha Continues to Enter the Realm of Reality (or no continuation), Eight Pages, and Ten Fascicles of the Three Sutras (or no continuation) are in the same volume.",
        "source": "T55n2157_029:1027a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般涅槃經四十卷(或三十六卷四帙)七百二十紙大般涅槃經後譯茶毘分二卷(亦云闍維分亦云後分)三十九紙大般泥洹經六卷(記云方等大般泥洹經)一百四十一紙上二經八卷同帙。",
        "translation": "The Mahāparinirvāṇa-sūtra is forty volumes (or thirty-six volumes in four parts), seven hundred and twenty pages, the Latter Portion of the Mahāparinirvāṇa-sūtra is two volumes (also called the Jāvive Portion and the Latter Portion), and thirty-nine pages, the Mahāparinirvāṇa-sūtra is six volumes (also called the Vaipulya Mahāparinirvāṇa-sūtra), one hundred and forty-one pages, the upper two sūtras, and eight volumes in the same book.",
        "source": "T55n2157_029:1027a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方等般泥洹經二卷(亦名大般泥洹經或三卷)四十五紙四童子三昧經三卷(或無三昧字)四十四紙大悲經五卷八十七紙上三經十卷同帙。",
        "translation": "The two-fascicle Mahāparinirvāṇa-sūtra (also called the Mahāparinirvāṇa-sūtra or three fascicles), the forty-five-page Four Children's Samādhi-sūtra in three fascicles (or without the word samādhi), the forty-four-page Great Compassion-sūtra in five fascicles, and the upper three sūtras in ten fascicles on eighty-seven pages are all in the same book.",
        "source": "T55n2157_029:1027a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方廣大莊嚴經十二卷(一名神通遊戲或云大方廣)二百一十四紙普曜經八卷(一名方等本起)一百四十三紙上二經二十卷二帙。",
        "translation": "The Sutra of Extensive Adornment (a sūtra of supernormal powers or called Extensive in Extensive Form) is twelve rolls long, two hundred and fourteen pages long, and the Sutra of Universal Luminosity is eight rolls long (a scripture that originated in the Vairocana school), one hundred and forty-three pages long, and the upper two scriptures are twenty rolls and two books long.",
        "source": "T55n2157_029:1027a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法華三昧經一卷一十一紙",
        "translation": "Fahua sanmei jing (Fahua sanmei jing) 1 roll, 11 pages",
        "source": "T55n2157_029:1027a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量義經一卷一十七紙",
        "translation": "Wuliangyi jing (Wuliangyi jing) 1 roll, 17 pages",
        "source": "T55n2157_029:1027a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經八卷(或七卷二十八品僧祐錄云新法華經)一百五十二紙薩曇分陀利經一卷(舊錄云薩芸芬陀利經亦直云分陀利經)三紙成就妙法蓮華經王瑜伽觀智儀軌一卷二十五紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)上五經十二卷同一帙。",
        "translation": "The Sutra of the Lotus of the Wonderful Dharma in eight rolls (or seven rolls of the twenty-eight class Saṃyuktâgama records as the New Lotus Sutra) is one hundred and fifty-two pages, the Saddharma-puṇḍarīka in one roll (the old records as the Saṃyuktâgama-puṇḍarīka also directly as the Puṇḍarīka-puṇḍarīka) is three pages, and the Sutra of the Lotus of the Wonderful Dharma, the King's Yoga, Contemplation, and Wisdom Ritual Procedure in one roll of twenty-five pages (the Tripiṭaka of the Temple of Prosperity, the monk Dagong Zhifukong, was commissioned to translate the new catalogue of the Zhenyuan period).",
        "source": "T55n2157_029:1027a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正法華經十卷(或云等正法華或七卷一帙)一百九十紙添品妙法蓮華經七卷(二十七品寶塔天受連之為一或八卷)一百五十八紙維摩詰所說經三卷(一名不可思議解脫或直云維摩詰經僧祐錄云新維摩詰經)六十一紙上二經十卷同帙。",
        "translation": "Ten Fascicle Sutra of the True Dharma Flower (also called the Equal True Dharma Flower or seven fascicles in one) One Hundred and Ninety Paper Seven Fascicle Sutra of the Lotus of the Wonderful Dharma (Twenty-seven Fascicle Sutra of the Jeweled Pagoda Heaven Accepted as One or Eight Fascicles) One Hundred and Fifty-Eight Paper Three Fascicle Sutra Explained by Vimalakīrti (an Inconceivable Liberation or simply called the New Vimalakīrti Sutra as recorded in the Saṃyuktâgama-sūtra) Sixty-One Paper The last two sūtras are in ten fascicles and the same book.",
        "source": "T55n2157_029:1027b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰經二卷(維摩詰說不可思議法門之稱一名佛法普入道門三昧經或三卷)五十五紙說無垢稱經六卷九十七紙大方等頂王經一卷(一名維摩詰子問經亦名善思童子經亦直云頂王經)二十紙大乘頂王經一卷(亦名維摩兜經)一十六紙上四經十卷同帙。",
        "translation": "Vimalakīrti-nirdeśa-sūtra 2 vols. (Vimalakīrti-nirdeśa-sūtra or Vimalakīrti-nirdeśa-sūtra); Vimalakīrti-nirdeśa-sūtra 6 vols. (a Vimalakīrti-nirdeśa-sūtra also known as the Sutra of the Boy of Good Thinking, also directly called the Sutra of the King of the Crown); Mahāyāna Sutra of the King of the Crown 1 vol. (also known as the Vimalakīrti-nirdeśa-sūtra); 16 pages; the above 4 sūtras in 10 volumes.",
        "source": "T55n2157_029:1027b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思童子經二卷二十一紙",
        "translation": "Sutra of the Boy of Good Thinking (2 volumes, 21 pages)",
        "source": "T55n2157_029:1027b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大悲分陀利經八卷(亦云大乘悲分陀利經)一百六十八紙上二經十卷同帙。",
        "translation": "Dabeifentuoli jing (also called Dasheng bei fentuoli jing) 8 scrolls (also called Dasheng bei fentuoli jing) 168 pages The above two sūtras are in 10 scrolls.",
        "source": "T55n2157_029:1027b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悲華經十卷(一帙)一百九十九紙",
        "translation": "Compassionate Flower Scripture, 10 volumes (one volume), one hundred and ninety-nine pages.",
        "source": "T55n2157_029:1027b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金光明最勝王經十卷(一帙)一百四十九紙合部金光明經八卷(二十四品)一百二十紙伅真陀羅所問經二卷(初云伅真陀羅所問如來三昧經或云伅真陀羅尼王或三卷)五十八紙上二經十卷同帙。",
        "translation": "Jin guangming zuishengwang jing ten rolls (one volume) one hundred and forty-nine pages (eight volumes (twenty-four chapters) of the combined Jin guangming jing) one hundred and twenty pages (two volumes) of the Xizhendra suowen jing (first, Xizhendra suowen ruler of the tathāgatas samādhi jing or Xizhendranīwang or three volumes) fifty-eight pages of the above two sūtras in ten volumes.",
        "source": "T55n2157_029:1027b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大樹緊那羅王所問經四卷(亦云說不可思議品或直云大樹緊那羅經)六十七紙佛昇忉利天為母說法經二卷(亦云佛昇忉利天品經或三卷)三十七紙道神足無極變化經四卷(一名合道神足經或二卷或三卷)四十九紙上三經十卷同帙。",
        "translation": "Four Fascicle Sutra of the Questions of King Mahādruma Kiṃnara (also called the Unfathomable Chapter of the Exposition or simply the Mahādruma Kiṃnara Sutra); Sixty-seven Fascicle Sutra of the Ascension of the Buddha to the Heaven of the Thirty-three (also called the Chapter of the Ascension of the Buddha to the Thirty-three); Thirty-seven Fascicle Sutra of the Spiritual Feet of the Path and the Limitless Transformations (a combined Sutra of the Spiritual Feet of the Path or two or three fascicles); Forty-nine Fascicle Sutra; Ten Fascicle Sutra; Ten Fascicle Sutra.",
        "source": "T55n2157_029:1027b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶雨經十卷(一帙)一百四十一紙",
        "translation": "Jewel Rain Sutra, ten volumes (one volume), one hundred and forty-one sheets of paper.",
        "source": "T55n2157_029:1027c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寶雲經七卷一百二紙",
        "translation": "Jewel Cloud Sutra in Seven Fascicles and One Hundred and Two Sheets",
        "source": "T55n2157_029:1027c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿惟越致遮經三卷(或無遮字或四卷)六十六紙上二經十卷同帙。",
        "translation": "*Abhidharma-jñānaprasthāna-sūtra in three volumes (or without the word jñānaprasthāna-sūtra, or in four volumes) of sixty-six pages and ten volumes of the above two sūtras in one volume.",
        "source": "T55n2157_029:1027c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不退轉法輪經四卷(一名不退轉經)七十三紙廣博嚴淨不退轉輪經四卷(或云三卷或直云廣博嚴淨經亦直云不退轉法輪經)七十八紙不必定入定入印經一卷二十一紙入定不定印經一卷一十六紙上四經十卷同帙。",
        "translation": "Four Fascicle Sutra on the Nonretrogression of the Dharma Wheel (a nonretrogression sutra), seventy-three pages, four fascicles of the Guangbo yanjing nonretrogression wheel sutra (some say three fascicles, some say straightforward Guangbo yanjing sutra, and some say straightforward nonretrogression wheel sutra), seventy-eight pages, one fascicle of the Sutra on the Entry into Concentration and the Seal of the Nonretrogression, twenty-one pages, and one fascicle of the Sutra on the Entry into Concentration and the Seal of the Nonretrogression, sixteen pages, and four sūtras and ten fascicles on the same page.",
        "source": "T55n2157_029:1027c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等集眾德三昧經三卷(或二卷或無三昧字或直云等集經)五十紙集一切福德三昧經三卷五十紙持心梵天經四卷(亦云持心梵天所問經一名莊嚴佛法經又名御諸經十七品或六)九十一紙上三經十卷同帙。",
        "translation": "The Samādhi Sutra of the Collection of All Virtues (either two volumes or no word for samādhi, or just the Sutra of the Collection of All Virtues), a fifty-page Samādhi Sutra of the Collection of All Virtues (three volumes), a fifty-page Brahmā Sutra of the Mindfulness of Brahmā (also called the Sutra of the Questions of the Mindfulness of Brahmā, a scripture that adorns the Buddha's teachings, and also known as the Sutra of the Royalty of All Saints (seventeen or six), ninety-one pages, and the three scriptures on top, ten volumes, all in one volume.",
        "source": "T55n2157_029:1027c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思益梵天所問經四卷(或直云思益經僧祐錄云思益義經)八十三紙勝思惟梵天所問經六卷上二經十卷同帙。",
        "translation": "Sutra of the Questions of Viśeṣa-cinti-brahma in Four Fascicles (also known as the Sutra of the Questions of Viśeṣa-cinti-brahma, or simply as the Sutra of the Questions of Viśeṣa-cinti-brahma) in Eighty-three Pages, Six Fascicles, and Ten Fascicles of the Two Sutras above.",
        "source": "T55n2157_029:1027c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持人菩薩經四卷(初云持人菩薩所問陰種諸入以了道德經或三卷)五十四紙持世經四卷(一名印經或三卷)七十八紙濟諸方等學經一卷(天竺薩和鞞曰僧加或無學字)一十五紙大乘方廣總持經一卷(或無乘字)一十四紙上四經十卷同帙。",
        "translation": "The four-fascicle Sutra of the Bodhisattva Who Holds People (first, the Sutra of the Virtues of the Aggregates and the Aggregates That He Enters, or three fascicles), the four-fascicle Sutra of the World-holding Bodhisattva (first, the Sutra of the Seal, or three fascicles), the seventy-eight-page Sutra of the Study of the Various Directions, or one fascicle (the Tianzhu Sahassaka and the Saṃgha, or without the word study), and the fifteen-page Dhāraṇī Sutra of the Extensive Zongchi (or without the word vehicle), or fourteen-page Sutra of the Four Teachings, or ten fascicles, are all in the same volume.",
        "source": "T55n2157_029:1027c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利現寶藏經三卷(或二卷或無現字或直云寶藏經)四十二紙大方廣寶篋經三卷(或二卷)四十三紙寶篋經一卷(經內題云一切如來心祕密全身舍利寶篋印陀羅尼經)六紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)大乘同性經二卷(亦名一切佛行入智毘盧遮那藏說經一名佛十地經或四卷)二十八紙證契大乘經二卷(亦名入一切佛境智陪盧遮那藏)三十二紙上五經十一卷同一帙。",
        "translation": "文殊師利現寶藏經三卷(或二卷或無現字或直云寶藏經)四十二紙大方廣寶篋經三卷(或二卷)四十三紙寶篋經一卷(經內題云一切如來心祕密全身舍利寶篋印陀羅尼經)六紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)大乘同性經二卷(亦名一切佛行入智毘盧遮那藏說經一名佛十地經或四卷)二十八紙證契大乘經二卷(亦名入一切佛境智陪盧遮那藏)三十二紙上五經十一卷同一帙。",
        "source": "T55n2157_029:1028a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深密解脫經五卷七十一紙",
        "translation": "The Sutra of Profound Liberation is five volumes and seventy-one pages in length.",
        "source": "T55n2157_029:1028a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解深密經五卷七十五紙",
        "translation": "Jie shenmi jing wuqie qifu xieyi jing",
        "source": "T55n2157_029:1028a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上二經十卷同帙。",
        "translation": "The above two sūtras are in ten volumes and one book.",
        "source": "T55n2157_029:1028a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解節經一卷一十紙",
        "translation": "The Jiejie jing (Jiejie jing) is one volume and ten pages long.",
        "source": "T55n2157_029:1028a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相續解脫地波羅蜜了義經一卷(或二卷亦名解脫了義亦直云相續解脫經)一十八紙緣生初勝分法本經二卷(亦直云緣生經)二十三紙分別緣起初勝法門經二卷(亦直云分別緣起經)二十二紙楞伽阿跋多羅寶經四卷九十二紙上五經十卷同帙。",
        "translation": "Xiangxu jietuodi poluomi liaoyi jing one volume (or two volumes, also called jietu jietu liaoyi and directly called Xiangxu jietu jing) one eighteen-page scripture on the primacy of dependently arisen phenomena two volumes (also directly called dependently arisen scriptures) twenty-three pages of the primacy of dependently arisen phenomena two volumes (also directly called dependently arisen scriptures) twenty-two pages of the Laṅkâvatāra gem scripture four volumes ninety-two pages of the preceding five scriptures ten volumes in the same book.",
        "source": "T55n2157_029:1028a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入楞伽經十卷(一帙)一百七十四紙大乘入楞伽經七卷一百二十七紙菩薩行方便境界神通變化經三卷四十七紙上二經十卷同帙。",
        "translation": "Laṅkâvatāra-sūtra, ten rolls (one volume), one hundred and seventy-four pages, seven rolls, one hundred and twenty-seven pages, seven rolls, one hundred and twenty-seven pages, three rolls, forty-seven pages, and ten rolls of the two scriptures above.",
        "source": "T55n2157_029:1028a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大薩遮尼乾子所說經十卷(一帙或加受記無所說字或七卷或八卷一名菩薩境界奮迅法門經)一百三十九紙大方等大雲經六卷(一名大方等無相大雲經一名大雲相經一名大雲蜜藏經或四卷或五卷)九十紙大雲請雨經一卷(內題云大雲經請雨品第六十四)二十三紙大雲輪請雨經二卷二十七紙大方等大雲請雨經一卷(內題云大方等大雲經請雨品第六十四)二十紙大雲請雨經二卷(經內題云大雲輪請雨經貞元新入目錄)三十四紙(大興善寺三藏沙門大廣智不空奉詔譯)上五經十二卷同一帙。",
        "translation": "大薩遮尼乾子所說經十卷(一帙或加受記無所說字或七卷或八卷一名菩薩境界奮迅法門經)一百三十九紙大方等大雲經六卷(一名大方等無相大雲經一名大雲相經一名大雲蜜藏經或四卷或五卷)九十紙大雲請雨經一卷(內題云大雲經請雨品第六十四)二十三紙大雲輪請雨經二卷二十七紙大方等大雲請雨經一卷(內題云大方等大雲經請雨品第六十四)二十紙大雲請雨經二卷(經內題云大雲輪請雨經貞元新入目錄)三十四紙(大興善寺三藏沙門大廣智不空奉詔譯)上五經十二卷同一帙。",
        "source": "T55n2157_029:1028a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法無行經二卷(或一卷)三十一紙諸法本無經三卷三十九紙無極寶三昧經一卷(或無三昧字)三十紙寶如來三昧經二卷(一名無極寶三昧經或一卷)三十八紙慧印三昧經一卷(一名寶田慧印三昧經亦直云慧印經)二十紙如來智印經一卷(一名諸佛法身)一十九紙上六經十卷同帙。",
        "translation": "The Sutra on the Non-Harmonizing of the Dharmas in Two Volumes (or one volume), the Thirty-One Sheet Sutra on the Non-Harmonizing of the Dharmas in Three Volumes, the Thirty-Nine Sheet Sutra on the Samādhi of the Treasures in One Volume (or without the word samādhi), the Thirty-Six Sheet Sutra on the Samādhi of the Tathāgatas in Two Volumes (or one volume for the Samādhi of the Treasures in One Volume), the Thirty-Eight Sheet Sutra on the Seal of Wisdom in One Volume (or one volume for the Samādhi of the Treasures in One Volume), the Twenty Sheet Sutra on the Seal of Wisdom of the Tathāgatas in One Volume (or one volume for the Dharma-body of the Buddhas in One Volume), and the Nineteen Sheet Sutra on the Six Sutras in Ten Volumes.",
        "source": "T55n2157_029:1028b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大灌頂經一十二卷(一帙或無大字錄云九卷未詳)一百一十八紙藥師如來本願經一卷(隋笈多譯)一十二紙藥師瑠璃光如來本願功德經一卷一十一紙藥師瑠璃光七佛本願功德經二卷三十一紙阿闍世王經二卷五十五紙普超三昧經三卷(或四卷上加文殊師利字云普起經一名阿闍世王品安公錄云更出阿闍世王經)六十八紙放鉢經一卷七紙上六經十卷同帙。",
        "translation": "One hundred and eighteen pages: the Yakushi Rulai Benyuan jing (a Sui translation of the Sutra of Śākyamuni's Past Vows), one volume: the Yakushi Rulikara Rulai Benyuan gongde jing, one volume: the Yakushi Rulikara Seven Buddhas Benyuan gongde jing, two volumes: the King of Ajātaśatru jing, two volumes: the King of Ajātaśatru jing, five volumes: the Samādhi jing, three volumes: the King of Ajātaśatru jing, four volumes: the King of Ajātaśatru jing, the King of Ajātaśatru jing, and the King of Ajātaśatru jing.",
        "source": "T55n2157_029:1028b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月燈三昧經十卷(或七卷一帙)一百九十八紙月燈三昧經一卷(一名文殊師利菩薩十一事行經一名建惠三昧經)一十紙無所悕望經一卷(一名象步經)二十紙象腋經一卷一十六紙大淨法門經一卷(題云大淨門品上金光首女所問溥首童真所開化經)二十四紙太莊嚴法門經二卷(亦名文殊師利神通力經又名勝金色明德女經)二十六紙如來莊嚴智慧光明入一切佛境界經二卷(亦云如來入一切佛境界經)三十四紙度一切諸佛境界智嚴經一卷一十二紙後出阿彌陀佛偈經一卷(或無偈字)一紙觀無量壽佛經一卷(亦云無量壽觀經)一十六紙無量壽如來念誦儀軌一卷(經內云修觀行供養儀軌貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)一十二紙阿彌陀經一卷(亦名無量壽經)五紙稱讚淨土佛攝受經一卷(亦直云稱讚佛土經)一十紙上十二經十四卷同帙。",
        "translation": "月燈三昧經十卷(或七卷一帙)一百九十八紙月燈三昧經一卷(一名文殊師利菩薩十一事行經一名建惠三昧經)一十紙無所悕望經一卷(一名象步經)二十紙象腋經一卷一十六紙大淨法門經一卷(題云大淨門品上金光首女所問溥首童真所開化經)二十四紙太莊嚴法門經二卷(亦名文殊師利神通力經又名勝金色明德女經)二十六紙如來莊嚴智慧光明入一切佛境界經二卷(亦云如來入一切佛境界經)三十四紙度一切諸佛境界智嚴經一卷一十二紙後出阿彌陀佛偈經一卷(或無偈字)一紙觀無量壽佛經一卷(亦云無量壽觀經)一十六紙無量壽如來念誦儀軌一卷(經內云修觀行供養儀軌貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)一十二紙阿彌陀經一卷(亦名無量壽經)五紙稱讚淨土佛攝受經一卷(亦直云稱讚佛土經)一十紙上十二經十四卷同帙。",
        "source": "T55n2157_029:1028c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀彌勒菩薩上生兜率天經一卷(亦云彌勒上生經)八紙彌勒成佛經一卷一十七紙彌勒來時經一卷三紙彌勒下生經一卷(一名彌勒受決經亦云彌勒佛經亦云當下成佛經亦云下生成佛經初云大智舍利弗)七紙彌勒下生成佛經一卷(義淨三藏新譯)五紙諸法勇王經一卷(一名一切法義王經)一十八紙一切法高王經一卷(一名一切法義王經)二十紙第一義法勝經一卷一十四紙大威燈光仙人問疑經一卷一十五紙順權方便經二卷(一名轉女身菩薩經亦云惟權方便經亦云順權女經亦云隨權女經或一卷)二十八紙樂瓔珞莊嚴方便品經一卷(亦云轉女身菩薩問答經)二十六紙上十一經十二卷同帙。",
        "translation": "觀彌勒菩薩上生兜率天經一卷(亦云彌勒上生經)八紙彌勒成佛經一卷一十七紙彌勒來時經一卷三紙彌勒下生經一卷(一名彌勒受決經亦云彌勒佛經亦云當下成佛經亦云下生成佛經初云大智舍利弗)七紙彌勒下生成佛經一卷(義淨三藏新譯)五紙諸法勇王經一卷(一名一切法義王經)一十八紙一切法高王經一卷(一名一切法義王經)二十紙第一義法勝經一卷一十四紙大威燈光仙人問疑經一卷一十五紙順權方便經二卷(一名轉女身菩薩經亦云惟權方便經亦云順權女經亦云隨權女經或一卷)二十八紙樂瓔珞莊嚴方便品經一卷(亦云轉女身菩薩問答經)二十六紙上十一經十二卷同帙。",
        "source": "T55n2157_029:1028c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六度集經八卷(亦名六度無極經亦云度無極集亦云新無極經或九卷)一百四十七紙太子須大拏經一卷(或云須達拏)六紙菩薩睒子經一卷(亦云孝子睒經亦云睒經)七紙睒子經一卷(一名孝子睒經一名菩薩睒經一名佛說睒經一名睒本經一名孝子隱經)六紙太子慕魄經一卷六紙大子沐魄經一卷(或作慕魄)六紙九色鹿經一卷三紙上七經十四卷同帙。",
        "translation": "六度集經八卷(亦名六度無極經亦云度無極集亦云新無極經或九卷)一百四十七紙太子須大拏經一卷(或云須達拏)六紙菩薩睒子經一卷(亦云孝子睒經亦云睒經)七紙睒子經一卷(一名孝子睒經一名菩薩睒經一名佛說睒經一名睒本經一名孝子隱經)六紙太子慕魄經一卷六紙大子沐魄經一卷(或作慕魄)六紙九色鹿經一卷三紙上七經十四卷同帙。",
        "source": "T55n2157_029:1029a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無字寶篋經一卷六紙",
        "translation": "The Wuzi baoqie jing (Wuzi baoqie jing) is one volume of six pages.",
        "source": "T55n2157_029:1029a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘離文字普光明藏經一卷五紙",
        "translation": "Dasheng liwenzi puguang mingzang jing 1 roll 5 pages",
        "source": "T55n2157_029:1029a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘遍照光明藏無字法門經一卷(亦直云大乘遍照光明藏經)六紙老女人經一卷(亦云老母經亦云老女經)二紙老母經一卷二紙老母女六英經一卷(亦云老母經)一紙月光童子經一卷(一名月光明童子經或名申日經)九紙申日兒本經一卷(或云申兒本經錄作兜本誤也)一紙德護長者經二卷(一名尸利崛多長者經)二十八紙文殊師利問菩提經一卷(一名伽耶山頂經一名菩提無行經一本直云菩提經)七紙伽耶山頂經一卷(一云伽耶頂經)一十七紙象頭精舍經一卷九紙大乘伽耶山頂經一卷九紙長者子制經一卷(亦直名制經)四紙菩薩逝經一卷(亦云逝童子經或直云逝經)四紙逝童子經一卷(亦云長者制經亦直云制經亦名菩薩逝經亦直云逝經)三紙犢子經一卷二紙乳光佛經一卷(亦名乳光經)六紙無垢賢女經一卷(或名胎藏經)三紙腹中女聽經一卷(一名不莊校女經北涼天竺三藏曇無讖譯第四譯)三紙轉女身經一卷二十九紙上二十一經二十二卷同帙。",
        "translation": "Six-page Old Woman Sutra in One Volume (also called Old Mother Sutra and Old Woman Sutra).",
        "source": "T55n2157_029:1029a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無上依經二卷三十一紙",
        "translation": "The Wushangyi jing is two volumes and thirty-one pages long.",
        "source": "T55n2157_029:1029b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無曾有經一卷三紙",
        "translation": "Wuzengyou jing (Wuzengyou jing) 1 roll 3 sheets",
        "source": "T55n2157_029:1029b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "甚希有經一卷五紙",
        "translation": "Sutra of the Most Rarified Existence in One Volume and Five Sheets",
        "source": "T55n2157_029:1029b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "決定總持經一卷(或云決總持經)八紙謗佛經一卷七紙寶積三昧文殊問法身經一卷(一名遺日寶積三昧文殊師利菩薩問法身法)六紙入法界體性經一卷(或云入法界)十紙如來師子吼經一卷六紙大方廣師子吼經一卷五紙大乘百福相經一卷七紙大乘百福莊嚴相經一卷九紙大乘四法經(與單本中實叉難陀譯者二名雖同多少全異)一紙菩薩修行四法經一卷一紙希有希有校量功德經一卷(或直云希有校量功德經)六紙最無比經一卷十二紙前世三轉經一卷六紙銀色女經一卷七紙阿闍世王受決經一卷四紙採蓮違王上佛授決號妙蓮華經一卷(亦直云採蓮違王經)二紙正恭敬經一卷(一名威德陀羅尼中說經或云正法恭敬經)五紙善敬經一卷(亦名善恭敬經一名恭敬師經)七紙稱讚大乘功德經一卷五紙說妙法決定業障經一卷三紙上二十三經二十四卷同帙。",
        "translation": "決定總持經一卷(或云決總持經)八紙謗佛經一卷七紙寶積三昧文殊問法身經一卷(一名遺日寶積三昧文殊師利菩薩問法身法)六紙入法界體性經一卷(或云入法界)十紙如來師子吼經一卷六紙大方廣師子吼經一卷五紙大乘百福相經一卷七紙大乘百福莊嚴相經一卷九紙大乘四法經(與單本中實叉難陀譯者二名雖同多少全異)一紙菩薩修行四法經一卷一紙希有希有校量功德經一卷(或直云希有校量功德經)六紙最無比經一卷十二紙前世三轉經一卷六紙銀色女經一卷七紙阿闍世王受決經一卷四紙採蓮違王上佛授決號妙蓮華經一卷(亦直云採蓮違王經)二紙正恭敬經一卷(一名威德陀羅尼中說經或云正法恭敬經)五紙善敬經一卷(亦名善恭敬經一名恭敬師經)七紙稱讚大乘功德經一卷五紙說妙法決定業障經一卷三紙上二十三經二十四卷同帙。",
        "source": "T55n2157_029:1029b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諫王經一卷(亦云大小諫王經)四紙如來示教勝軍王經一卷(亦直云勝軍王經)七紙佛為勝光天子說王法經一卷(亦直云勝光天子經)七紙大方等修多羅王經一卷(或無王字)二紙轉有經一卷二紙文殊師利巡行經一卷五紙文殊尸利行經一卷八紙文殊師利菩薩根本大教王金翅鳥王品一卷(貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)一十一紙文殊師利菩薩及諸仙所說吉凶時曰善惡宿曜經二卷(下卷有序貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)共四十紙貝多樹下思惟十二因緣經一卷(或云聞城十二因緣經)四紙緣起聖道經一卷八紙稻芉經一卷七紙稻[卄/幹]喻經一卷(經內題云慈氏菩薩所說大乘緣生稻[卄/幹]經)八紙(大興善寺三藏沙門大廣智不空奉詔譯)了本生死經一卷五紙自誓三昧經一卷(題下注云獨證品第四出比丘淨行中)八紙如來獨證自誓三昧經一卷(亦云獨證自誓三昧經亦云如來自誓三昧經)七紙灌洗佛形像經一卷(亦云四月八日灌經亦直云灌經)二紙摩訶剎頭經一卷(亦云灌佛形像經)三紙造立形像福報經一卷三紙作佛形像經一卷(亦云優填王作佛形像經一名作像因緣經)四紙龍施女經一卷(或無女字)二紙龍施菩薩本起經一卷(或云龍施女經亦云龍施本經)四紙都部陀羅尼目一卷(經內題云陀羅尼門諸部貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)八吉祥神呪經一卷(或無神字)三紙八陽神呪經一卷(亦云直八陽經別有一本亦云八陽神呪呵半紙許初有七佛名號者非也)四紙八吉祥經一卷(亦云八世界八佛名號經)二紙八佛名號經一卷四紙八大菩薩曼茶羅經一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)盂蘭盆經一卷(亦云盂蘭)二紙報恩奉盆經一卷一紙浴像功德經一卷(三藏義淨譯)四紙浴像功德經一卷(三藏寶思惟譯)三紙校量數珠功德經一卷二紙瑜伽念珠經一卷(經內題云金剛頂瑜伽念珠經於十方廣頌中略出貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)二紙新譯木槵經一卷(貞元新入目錄)一紙(大興善寺三藏沙門大廣智不空奉詔譯)數珠功德經一卷(內云曼殊室利呪藏中校量數珠功德法)二紙上三十六經同帙。",
        "translation": "諫王經一卷(亦云大小諫王經)四紙如來示教勝軍王經一卷(亦直云勝軍王經)七紙佛為勝光天子說王法經一卷(亦直云勝光天子經)七紙大方等修多羅王經一卷(或無王字)二紙轉有經一卷二紙文殊師利巡行經一卷五紙文殊尸利行經一卷八紙文殊師利菩薩根本大教王金翅鳥王品一卷(貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)一十一紙文殊師利菩薩及諸仙所說吉凶時曰善惡宿曜經二卷(下卷有序貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)共四十紙貝多樹下思惟十二因緣經一卷(或云聞城十二因緣經)四紙緣起聖道經一卷八紙稻芉經一卷七紙稻[卄/幹]喻經一卷(經內題云慈氏菩薩所說大乘緣生稻[卄/幹]經)八紙(大興善寺三藏沙門大廣智不空奉詔譯)了本生死經一卷五紙自誓三昧經一卷(題下注云獨證品第四出比丘淨行中)八紙如來獨證自誓三昧經一卷(亦云獨證自誓三昧經亦云如來自誓三昧經)七紙灌洗佛形像經一卷(亦云四月八日灌經亦直云灌經)二紙摩訶剎頭經一卷(亦云灌佛形像經)三紙造立形像福報經一卷三紙作佛形像經一卷(亦云優填王作佛形像經一名作像因緣經)四紙龍施女經一卷(或無女字)二紙龍施菩薩本起經一卷(或云龍施女經亦云龍施本經)四紙都部陀羅尼目一卷(經內題云陀羅尼門諸部貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)八吉祥神呪經一卷(或無神字)三紙八陽神呪經一卷(亦云直八陽經別有一本亦云八陽神呪呵半紙許初有七佛名號者非也)四紙八吉祥經一卷(亦云八世界八佛名號經)二紙八佛名號經一卷四紙八大菩薩曼茶羅經一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)盂蘭盆經一卷(亦云盂蘭)二紙報恩奉盆經一卷一紙浴像功德經一卷(三藏義淨譯)四紙浴像功德經一卷(三藏寶思惟譯)三紙校量數珠功德經一卷二紙瑜伽念珠經一卷(經內題云金剛頂瑜伽念珠經於十方廣頌中略出貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)二紙新譯木槵經一卷(貞元新入目錄)一紙(大興善寺三藏沙門大廣智不空奉詔譯)數珠功德經一卷(內云曼殊室利呪藏中校量數珠功德法)二紙上三十六經同帙。",
        "source": "T55n2157_029:1029c13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "不空羂索神變真言經三十卷(三帙)五百二十　六紙不空羂索呪經一卷(亦云不空羂索觀世音心呪經)一十一紙不空羂索神呪心經一卷一十三紙不空羂索陀羅尼自在王經呪三卷(亦名不空羂索心呪王經)三十四紙不空羂索陀羅尼經一卷(一名普門)三十七紙千眼千臂觀世音菩薩陀羅尼神呪經二卷(或一卷)一十九紙千手千眼觀世音菩薩姥陀羅尼身經一卷(或云千臂千眼)二十二紙千手千眼觀世音菩薩大身呪本一卷二紙(南天竺國三藏沙門金剛智譯貞元新入目錄)千手千眼觀世音菩薩廣大圓滿無礙大悲心陀羅尼經一卷一十九紙千手千眼觀世音菩薩廣大圓滿無礙大悲陀羅尼本一卷(南天竺國三藏沙門金剛智譯貞元新入目錄)三紙觀世音菩薩祕密藏神呪經一卷八紙觀世音菩薩如意摩尼陀羅尼經一卷七紙金剛頂瑜伽千手千眼觀自在念誦法一卷二十八紙(經內云菩薩修行儀軌貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)上十二經十五卷同帙。",
        "translation": "One volume of the Dhāraṇī of the Thousand Eyes and Thousand Arms Avalokitêśvara Dhāraṇī Sutra (also called the Avalokitêśvara Avalokitêśvara Dhāraṇī Sutra), one volume of five hundred and twenty-six pages.",
        "source": "T55n2157_029:1030b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀自在菩薩如意心陀羅尼呪經一卷四紙如意輪陀羅尼經一卷(此經出大蓮華金剛三昧耶加持祕密無障礙經)二十四紙觀自在菩薩說普賢陀羅尼經一卷(貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)七紙文殊師利根本一字陀羅尼經一卷(題云大方廣菩薩中文殊師利根本一字陀羅尼法亦名一字呪經)三紙曼殊室利菩薩呪藏中一字呪王經一卷三紙十二佛名神呪經一卷(題云十二佛名神呪校量功德除障滅罪經)六紙稱讚如來功德神呪經一卷三紙三十五佛名經一卷(經內題云佛說三十五佛名禮懺文出鄔波離所問經貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)二紙孔雀王呪經一卷(亦名大金色孔雀王經并結界場法具)八紙大金色孔雀王呪經一卷五紙佛說大金色孔雀王呪經一卷八紙孔雀王呪經二卷(亦云孔雀王陀羅尼經)四十三紙大孔雀呪王經三卷六十紙大孔雀明王經三卷(經內題云佛母孔雀明王經初有啟請法在上卷貞元新入目錄)五十紙(大興善寺三藏沙門大廣智不空奉詔譯)佛說大孔雀明王畫像壇場儀軌一卷(貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)上十五經二十卷同帙。",
        "translation": "The Dhāraṇī Spell of the Wishful Mind of the Bodhisattva of Spontaneous Contemplation in One Volume: Dhāraṇī of the Wishful Wheel in Four Papers (This sūtra is from the Vajrasamaya of the Great Lotus and the Secret and Unobstructed Empowerment Sutra).",
        "source": "T55n2157_029:1030c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陀羅尼集經十二卷三百四十三紙",
        "translation": "Dhāraṇī Collection Sutra, 12 fascicles, 343 pages.",
        "source": "T55n2157_029:1031a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一面觀世音神呪經一卷(周宇文氏耶舍崛多等譯第一譯)十一紙十一面神呪心經一卷(大唐三藏玄奘譯出內典錄第二譯)一十紙十一面觀自在菩薩經三卷(經內題云十一面觀自在菩薩心密儀軌貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)二十四紙摩利支天經一卷(或上加小字)一紙佛說摩利支天經一卷(貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)末利支提婆華鬘經一卷(貞元新入目錄)一十四紙(大興善寺三藏沙門大廣智不空奉詔譯)訶利帝母經一卷(經內題云訶利帝母真言法貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)大藥叉女歡喜母并愛子成就法一卷(亦云訶哩底母法)一十二紙(大興善寺三藏沙門大廣智不空奉詔譯)呪五首經一卷(或無經字)二紙千轉陀羅尼觀世音菩薩呪經一卷(或無經字)三紙六字神呪經一卷(或云六字呪經)二紙七俱胝佛大心准提陀羅尼經一卷(亦直云七俱胝佛母心經)五紙七俱胝佛母准泥大明陀羅尼經一卷十六紙七俱胝佛母陀羅尼經一卷(經內題云七俱胝佛母所說准提陀羅尼經貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)上十五經二十八卷三帙(上帙七卷中帙七卷下帙十四卷)。",
        "translation": "十一面觀世音神呪經一卷(周宇文氏耶舍崛多等譯第一譯)十一紙十一面神呪心經一卷(大唐三藏玄奘譯出內典錄第二譯)一十紙十一面觀自在菩薩經三卷(經內題云十一面觀自在菩薩心密儀軌貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)二十四紙摩利支天經一卷(或上加小字)一紙佛說摩利支天經一卷(貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)末利支提婆華鬘經一卷(貞元新入目錄)一十四紙(大興善寺三藏沙門大廣智不空奉詔譯)訶利帝母經一卷(經內題云訶利帝母真言法貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)大藥叉女歡喜母并愛子成就法一卷(亦云訶哩底母法)一十二紙(大興善寺三藏沙門大廣智不空奉詔譯)呪五首經一卷(或無經字)二紙千轉陀羅尼觀世音菩薩呪經一卷(或無經字)三紙六字神呪經一卷(或云六字呪經)二紙七俱胝佛大心准提陀羅尼經一卷(亦直云七俱胝佛母心經)五紙七俱胝佛母准泥大明陀羅尼經一卷十六紙七俱胝佛母陀羅尼經一卷(經內題云七俱胝佛母所說准提陀羅尼經貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)上十五經二十八卷三帙(上帙七卷中帙七卷下帙十四卷)。",
        "source": "T55n2157_029:1031a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀自在菩薩隨心呪經一卷(亦名多唎心經)一十九紙金剛頂經觀自在王如來修行法一卷(貞元新入目錄)六紙(大興善寺三藏沙門不空奉詔譯)種種雜呪經一卷(或無經字)六紙佛頂勝陀羅尼經一卷(杜行顗奉詔譯)七紙佛頂最勝陀羅尼經一卷(日照三藏譯梵名地婆訶羅)八紙佛頂尊勝陀羅尼經一卷(佛陀婆利譯)七紙最勝佛頂陀羅尼淨除業障經一卷(日照三藏再譯)十三紙佛頂尊勝陀羅尼經一卷(義淨三藏譯或加呪字)八紙佛頂尊勝念誦法一卷(經內題云佛頂尊勝陀羅尼念誦儀軌貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)八紙無量門微密持經一卷(一名成道降魔得一切智經)六紙出生無量門持經一卷(或云新微密持經)七紙阿難陀目佉尼呵離陀經一卷(或云出生無量門持經)十一紙無量門破魔陀羅尼經一卷(或直云破魔陀羅尼經)一十一紙阿難陀目佉尼訶離陀隣尼經一卷一十紙毘沙門天王經一卷(貞元新入目錄)五紙半舍利弗陀羅尼經一卷八紙一向出生菩薩經一卷一十二紙出生無邊門陀羅尼經一卷一十四紙出生無邊門經一卷(經內題云出生無邊門陀羅尼經貞元新入目錄)一十紙(大興善寺三藏沙門大廣智不空奉詔譯)勝幢臂印陀羅尼經一卷二紙妙臂印幢陀羅尼一卷(別有一本十六七紙非是本經不可流布)二紙上二十一經二十一卷同帙。",
        "translation": "觀自在菩薩隨心呪經一卷(亦名多唎心經)一十九紙金剛頂經觀自在王如來修行法一卷(貞元新入目錄)六紙(大興善寺三藏沙門不空奉詔譯)種種雜呪經一卷(或無經字)六紙佛頂勝陀羅尼經一卷(杜行顗奉詔譯)七紙佛頂最勝陀羅尼經一卷(日照三藏譯梵名地婆訶羅)八紙佛頂尊勝陀羅尼經一卷(佛陀婆利譯)七紙最勝佛頂陀羅尼淨除業障經一卷(日照三藏再譯)十三紙佛頂尊勝陀羅尼經一卷(義淨三藏譯或加呪字)八紙佛頂尊勝念誦法一卷(經內題云佛頂尊勝陀羅尼念誦儀軌貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)八紙無量門微密持經一卷(一名成道降魔得一切智經)六紙出生無量門持經一卷(或云新微密持經)七紙阿難陀目佉尼呵離陀經一卷(或云出生無量門持經)十一紙無量門破魔陀羅尼經一卷(或直云破魔陀羅尼經)一十一紙阿難陀目佉尼訶離陀隣尼經一卷一十紙毘沙門天王經一卷(貞元新入目錄)五紙半舍利弗陀羅尼經一卷八紙一向出生菩薩經一卷一十二紙出生無邊門陀羅尼經一卷一十四紙出生無邊門經一卷(經內題云出生無邊門陀羅尼經貞元新入目錄)一十紙(大興善寺三藏沙門大廣智不空奉詔譯)勝幢臂印陀羅尼經一卷二紙妙臂印幢陀羅尼一卷(別有一本十六七紙非是本經不可流布)二紙上二十一經二十一卷同帙。",
        "source": "T55n2157_029:1031b02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "無崕際持法門經一卷(一名無際經)一十五紙尊勝菩薩所問一切諸法入無量門陀羅尼經一卷(或直云尊勝菩薩所問經亦直云入無量門陀羅尼經)一十七紙金剛壽命陀羅尼經一卷(經內題云一切如來金剛壽命陀羅尼經貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)二紙金剛壽命念誦法一卷(經內題云陀羅尼念誦法貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛上味陀羅尼經一卷一十四紙金剛場陀羅尼經一卷一十四紙菩提場莊嚴經一卷(經內題云菩提莊嚴陀羅尼經貞元新入目錄)二十二紙(大興善寺三藏沙門大廣智不空奉詔譯)菩提場所說一字頂輪王經五卷(貞元新入目錄)七十八紙(大興善寺三藏沙門大廣智不空奉詔譯)上八經十二卷一帙。",
        "translation": "無崕際持法門經一卷(一名無際經)一十五紙尊勝菩薩所問一切諸法入無量門陀羅尼經一卷(或直云尊勝菩薩所問經亦直云入無量門陀羅尼經)一十七紙金剛壽命陀羅尼經一卷(經內題云一切如來金剛壽命陀羅尼經貞元新入目錄大興善寺三藏沙門大廣智不空奉詔譯)二紙金剛壽命念誦法一卷(經內題云陀羅尼念誦法貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛上味陀羅尼經一卷一十四紙金剛場陀羅尼經一卷一十四紙菩提場莊嚴經一卷(經內題云菩提莊嚴陀羅尼經貞元新入目錄)二十二紙(大興善寺三藏沙門大廣智不空奉詔譯)菩提場所說一字頂輪王經五卷(貞元新入目錄)七十八紙(大興善寺三藏沙門大廣智不空奉詔譯)上八經十二卷一帙。",
        "source": "T55n2157_029:1031c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奇特佛頂經三卷(經內題云一字奇特佛頂經現威德品貞元新入目錄)六十八紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂經一字頂輪王瑜伽一切時處念誦成佛儀軌一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)八紙師子奮迅菩薩所問經一卷三紙華聚陀羅尼呪經一卷三紙華積陀羅尼神呪經一卷三紙六字呪王經一卷五紙六字神呪王經一卷六紙虛空藏菩薩問佛經一卷(亦云虛空藏菩薩問七佛陀羅尼呪經亦云七佛神呪經)十二紙如來方便善巧呪經一卷一十紙持句神呪經一卷(亦云陀羅尼句)三紙陀隣尼鉢經一卷三紙(亦云陀羅隣鉢呪)東方最勝王如來經一卷(題云東方最勝燈王如來遣二菩薩送呪奉釋迦如來助護持世間經)一十三紙善法方便陀羅尼呪經一卷六紙金剛祕密善問陀羅尼經一卷五紙護命法門神呪經一卷一十一紙無垢淨光大陀羅尼經一卷一十二紙上十六經十八卷同一帙。",
        "translation": "The Sutra of the Peculiar Buddha-Corona, three volumes (the title of the sutra is Yizi yizi foding zhenye de pin), sixty-eight pages (translated by the director of the Sanzang monastery, Grand Guangzhi Bukong), the Ritual Procedure for Becoming Buddha through Recitation at All Times in the Yoga of the One-Syllable Wheel-Turning King, one volume (translated by the director of the Sanzang monastery, Grand Guangzhi Bukong), and the Sutra of the Dhāraṇī Spell of the Flower Aggregate, one volume, three pages, and the Dhāraṇī Spell of the Flower Aggregate, one volume, three pages, and the Dhāraṇī Spell of the Six-Syllable King of Spells, one volume, six volumes, and the Dhāraṇī Spell of the Seven Buddhas, one volume, by the Bodhisattva Xukongzang.",
        "source": "T55n2157_029:1031c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請觀世音菩薩消伏毒害陀羅尼經一卷(亦直云請觀世音經)一十二紙蘘麌梨童女經一卷(經內題中亦加佛說貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)除一切疾病陀羅尼經一卷(貞元新入目錄)一紙(大興善寺三藏沙門大廣智不空奉詔譯)能淨一切眼陀羅尼經一卷(經內題云能淨一切眼疾病陀羅尼經貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)阿唎多羅阿嚕力經一卷(經內題云阿唎多羅尼阿嚕力品第十四貞元新入目錄)二十一紙(大興善寺三藏沙門大廣智不空奉詔譯)雨寶陀羅尼經一卷(經內題云加佛說兩字貞元新入目錄)五紙(大興善寺三藏沙門大廣智不空奉詔譯)甘露軍吒利瑜迦念誦法一卷(經內題云甘露軍吒利菩薩供養念誦成就儀軌)(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十八紙佛說一髻尊陀羅尼經一卷(貞元新入目錄)一十四紙(大興善寺三藏沙門大廣智不空奉詔譯)聖閻曼德迦威怒王立成大神驗念誦法一卷(貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)速疾立驗摩醯首羅天說迦婁羅阿尾奢法一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)六紙大聖天歡喜雙身毘那夜迦法一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)上十一經十一卷同帙。",
        "translation": "請觀世音菩薩消伏毒害陀羅尼經一卷(亦直云請觀世音經)一十二紙蘘麌梨童女經一卷(經內題中亦加佛說貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)除一切疾病陀羅尼經一卷(貞元新入目錄)一紙(大興善寺三藏沙門大廣智不空奉詔譯)能淨一切眼陀羅尼經一卷(經內題云能淨一切眼疾病陀羅尼經貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)阿唎多羅阿嚕力經一卷(經內題云阿唎多羅尼阿嚕力品第十四貞元新入目錄)二十一紙(大興善寺三藏沙門大廣智不空奉詔譯)雨寶陀羅尼經一卷(經內題云加佛說兩字貞元新入目錄)五紙(大興善寺三藏沙門大廣智不空奉詔譯)甘露軍吒利瑜迦念誦法一卷(經內題云甘露軍吒利菩薩供養念誦成就儀軌)(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十八紙佛說一髻尊陀羅尼經一卷(貞元新入目錄)一十四紙(大興善寺三藏沙門大廣智不空奉詔譯)聖閻曼德迦威怒王立成大神驗念誦法一卷(貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)速疾立驗摩醯首羅天說迦婁羅阿尾奢法一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)六紙大聖天歡喜雙身毘那夜迦法一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)上十一經十一卷同帙。",
        "source": "T55n2157_029:1032a12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "內藏百寶經一卷(亦云內藏百品經)八紙溫室洗浴眾僧經一卷(亦直云溫室經)三紙須賴經一卷一十八紙私訶昧經一卷(或云私阿未經一名菩薩道樹經亦名道樹三昧經)一十一紙菩薩生地經一卷(一名差摩竭經)三紙四不可得經一卷五紙梵女首意經一卷(一名意女經)五紙成具光明定意經一卷(或云成具光明三昧經或直云成具光明經)二十一紙寶網經一卷(亦云寶網童子經)二十三紙菩薩行五十緣身經一卷(亦云菩薩緣身五十事經亦云五十緣身行經)六紙菩薩修行經一卷(亦云威施長者問觀身行經亦云長者修行經)七紙諸德福田經一卷(或直云福田經或云諸福田經)五紙大方等如來藏經一卷(或直云如來藏)九紙大方廣如來藏經一卷(貞元新入目錄)一十八紙佛語經一卷四紙金色王經一卷九紙演道俗業經一卷九紙百佛名經一卷六紙上十八經十八卷同一帙。",
        "translation": "內藏百寶經一卷(亦云內藏百品經)八紙溫室洗浴眾僧經一卷(亦直云溫室經)三紙須賴經一卷一十八紙私訶昧經一卷(或云私阿未經一名菩薩道樹經亦名道樹三昧經)一十一紙菩薩生地經一卷(一名差摩竭經)三紙四不可得經一卷五紙梵女首意經一卷(一名意女經)五紙成具光明定意經一卷(或云成具光明三昧經或直云成具光明經)二十一紙寶網經一卷(亦云寶網童子經)二十三紙菩薩行五十緣身經一卷(亦云菩薩緣身五十事經亦云五十緣身行經)六紙菩薩修行經一卷(亦云威施長者問觀身行經亦云長者修行經)七紙諸德福田經一卷(或直云福田經或云諸福田經)五紙大方等如來藏經一卷(或直云如來藏)九紙大方廣如來藏經一卷(貞元新入目錄)一十八紙佛語經一卷四紙金色王經一卷九紙演道俗業經一卷九紙百佛名經一卷六紙上十八經十八卷同一帙。",
        "source": "T55n2157_029:1032b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱揚諸佛功德經三卷(亦云集諸佛花經一名集花經一名現在佛名經或四卷)五十七紙須真天子經三卷(亦云須真天子所問經亦云問四事經或二卷)四十六紙摩訶摩耶經一卷(一名佛昇忉利天為母說法經亦直云摩耶經或二卷)二十六紙除恐災患經一卷一十七紙孛經一卷(或云孛經鈔)一十八紙觀世音菩薩受記經一卷(一名觀世音受決經)一十三紙觀自在菩薩授記經一卷(經內題云佛說大方廣曼殊室利經觀自在菩薩授記品第三十大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十二紙上七經十一卷同帙。",
        "translation": "稱揚諸佛功德經三卷(亦云集諸佛花經一名集花經一名現在佛名經或四卷)五十七紙須真天子經三卷(亦云須真天子所問經亦云問四事經或二卷)四十六紙摩訶摩耶經一卷(一名佛昇忉利天為母說法經亦直云摩耶經或二卷)二十六紙除恐災患經一卷一十七紙孛經一卷(或云孛經鈔)一十八紙觀世音菩薩受記經一卷(一名觀世音受決經)一十三紙觀自在菩薩授記經一卷(經內題云佛說大方廣曼殊室利經觀自在菩薩授記品第三十大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十二紙上七經十一卷同帙。",
        "source": "T55n2157_029:1032c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "海龍王經四卷(或三卷)七十三紙",
        "translation": "Sutra of the Sea Dragon King, four (or three) volumes of seventy-three sheets of paper",
        "source": "T55n2157_029:1032c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "首楞嚴三昧經三卷(或二卷亦直云首楞嚴經僧祐錄云新首楞)五十二紙觀普賢菩薩行法經一卷(云出深功德經中或無行法字亦云普賢經)一十六紙觀藥王藥上二菩薩經一卷一十九紙不思議光菩薩所問經一卷(亦云不思光菩薩所說經亦云無思光孩童菩薩經)一十二紙上五經十卷同帙。",
        "translation": "首楞嚴三昧經三卷(或二卷亦直云首楞嚴經僧祐錄云新首楞)五十二紙觀普賢菩薩行法經一卷(云出深功德經中或無行法字亦云普賢經)一十六紙觀藥王藥上二菩薩經一卷一十九紙不思議光菩薩所問經一卷(亦云不思光菩薩所說經亦云無思光孩童菩薩經)一十二紙上五經十卷同帙。",
        "source": "T55n2157_029:1032c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十住斷結經十卷(最勝問菩薩十住除垢亦名十千日光二百五十三昧定亦云十千地斷經十一卷或十四卷四紙經本只四紙只依經寫也)諸佛要集經二卷(亦直云要集經天竺日佛陀僧祇提)四十三紙未曾有因緣經二卷(或無因緣字度羅睺羅沙彌序)四十紙上三經十四卷二帙。",
        "translation": "Ten Fascicle Sutra on Cutting the Knot of Ten Abodes (also known as Ten Thousand Suns, Two Hundred and Fifty Samādhis, or Ten Thousand Stages of Cutting the Knot of Ten Thousand Suns); Two Fascicle Sutra on the Essentials of the Buddhas (also known as the Essentials of the Buddhas, a scripture written on four pages only); Forty-three Fascicle Sutra on the Causes and Conditions of the Unprecedented (or without the preface to the Sutra on the Causes and Conditions of the Tuṣitaśāmbī); and Fourteen Fascicle Sutra on Forty Pages.",
        "source": "T55n2157_029:1032c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞經十二卷(一名現在報或十四卷或十六卷或十三卷)三百三十七紙超日明三昧經二卷(或直云超日明經或三卷)四十八紙上二經十四卷二帙。",
        "translation": "The twelve-fascicle Pusa yingluo jing (a present retribution scripture or fourteen or sixteen or thirteen fascicles), three-hundred-and-thirty-seven-page Chaosi ming sanmei jing, two fascicles (or just the Chaosi ming jing or three fascicles), forty-eight pages on two scriptures, fourteen fascicles, and two books.",
        "source": "T55n2157_029:1033a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "賢劫經十三卷(題云颰陀劫三昧晉曰賢劫定意舊錄云賢劫三昧經或十卷一帙)一百九十二紙大乘經單譯一百九十一部三百七十二卷三十帙大法炬陀羅尼經二十卷二帙二百九十八紙大威德陀羅尼經二十卷二帙二百六十八紙佛名經十二卷(或十三卷或分為二十卷)二百五十三紙三劫三千佛名經三卷(莊嚴劫上賢劫中星宿劫下)五十九紙上二經十五卷二帙(上帙七下帙八)。",
        "translation": "The 13-fascicle Good eon Sutra (titled Bhadra-kalpa Samādhi and Jin called Good eon Samādhi, or Good eon Samādhi, in the old records, or ten fascicles in one) is 192 pages, and the single translation of the Mahāyāna Sutra is 191 parts, 372 fascicles, and 30 books. The 20-fascicle Dhāraṇī of the Dharma Torch is 298 pages, and the 20-fascicle Dhāraṇī of the Great Majestic Power is 298 pages, and the 12-fascicle Sutra of the Buddha's Names (or 13 fascicles, or divided into 20 fascicles) is 253 pages.",
        "source": "T55n2157_029:1033a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五千五百佛名經八卷一百三十一紙",
        "translation": "Sutra of the Names of Five Thousand Five Hundred Buddhas (Eight Fascicle, One Hundred Thirty-One Sheet)",
        "source": "T55n2157_029:1033a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不思議功德諸佛所護念經二卷(或直云不思議功德經或四卷)三十七紙上二經十卷同帙。",
        "translation": "The Sutra of the Inconceivable Merit of All Buddhas Protecting Their Minds in Two Volumes (also known as the Sutra of the Inconceivable Merit of All Buddhas or four volumes) is thirty-seven pages and ten volumes of the two scriptures together.",
        "source": "T55n2157_029:1033a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "華手經十三卷(一名攝諸善根經亦名攝諸功德經或十一卷或十二卷或十卷一帙)二百二十九紙大方等陀羅尼經四卷(一名方等檀特陀羅尼經或無大字)六十三紙僧伽吒經四卷五十一紙力莊嚴三昧經三卷三十八紙大方廣圓覺修多羅了義經一卷二十七紙上四經十二卷同帙。",
        "translation": "Thirteen Fascicle Sutra of the Flower Hand (a scripture on the collection of good roots, also known as the scripture on the collection of merit, or eleven, twelve, or ten fascicles in one), two hundred and twenty-nine pages, four fascicles of the Dhammapada Dhāraṇī (a dhammapada without large letters), sixty-three pages, four fascicles of the Saṃghāṭa Sutra, fifty-one pages, three fascicles of the Samādhi Sutra of the Adorned Power, thirty-eight pages, one volume of the Dhammapada Sutra of the Perfect Enlightenment, twelve volumes, and twelve fascicles of the four scriptures on the twenty-seven pages.",
        "source": "T55n2157_029:1033a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀佛三昧海經十卷(或云觀佛三昧經或八卷一帙)一百五十六紙大方便佛報恩經七卷一百二十六紙菩薩本行經三卷四十七紙上二經十卷同帙。",
        "translation": "The ten-fascicle Guanfo sanmei hai jing (or Guanfo sanmei jing or eight fascicles in one) is one hundred and fifty-six pages, and the seven-fascicle, one hundred and twenty-six-page bodhisattva practice jing is three fascicles and forty-seven pages, while the upper two scriptures are ten fascicles in one.",
        "source": "T55n2157_029:1033b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法集經六卷(或七卷或八卷)一百二十七紙觀察諸法行經四卷六十三紙上二經十卷同帙。",
        "translation": "The Dharma Collection Sutra is six (or seven or eight) volumes and one hundred and twenty-seven pages in length, and the Sutra of the Observation of the Practices of the Dharma is four volumes and sixty-three pages in length, and the upper two scriptures are ten volumes in length.",
        "source": "T55n2157_029:1033b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩處胎經五卷(初云菩薩從兜術天降神母胎廣普經亦云胎經或八卷或四卷)一百一十五紙弘道廣顯三昧經四卷(一名阿耨達龍王所問決諸狐疑清淨品亦名金剛問定意經九十二品或二卷)五十五紙施燈功德經一卷(一名燈經)一十五紙上三經十卷同帙。",
        "translation": "The Sutra of the Bodhisattva's Handling of the Womb (first, the Sutra of the Bodhisattva's Descent from the Tuṣita Heaven into the Mother's Womb: Extensive and Universal, also known as the Womb Sutra or eight or four volumes), one hundred and fifteen pages, four volumes of the Samādhi Sutra of the Vast Exposition of the Way (one title, Anavatapta-nāga-rāja's Inquiry into the Purification of Doubts, also known as the Sutra of the Jingang Questions and Concentrations, ninety-two titles or two volumes), one volume of the Sutra of the Merit of Giving Lanterns (one title, the Lantern Sutra), one hundred and fifteen pages, the preceding three sūtras, and ten volumes are in the same volume.",
        "source": "T55n2157_029:1033b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "央崛魔羅經四卷七十八紙",
        "translation": "Aṇgulimālīya-sūtra (A lamp sūtra) of fifteen pages and the three sūtras of ten pages in the same volume.",
        "source": "T55n2157_029:1033b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無所有菩薩經四卷六十二紙",
        "translation": "Sutra of the Ubiquitous Bodhisattva in Four Fascicles of Sixty-two Sheets",
        "source": "T55n2157_029:1033b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明度五十校計經二卷(或無明度字或無五十字)四十紙上三經十卷同帙。",
        "translation": "Mingdu wu-shih xianji jing (either without the word Mingdu or without the word fifty) in two fascicles (or without the word wu-shih) of forty pages, and the three sūtras in ten fascicles of the same text.",
        "source": "T55n2157_029:1033b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中陰經二卷三十八紙",
        "translation": "Two fascicles of the Sutra of the Intermediate Aggregates on thirty-eight sheets of paper.",
        "source": "T55n2157_029:1033b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大法鼓經二卷三十一紙",
        "translation": "Dharma Drum Sutra, 2 volumes and 31 sheets",
        "source": "T55n2157_029:1033b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利問經二卷(亦直云文殊問經)五十一紙月上女經二卷(維摩詰之女)二十九紙大方廣如來祕密藏經二卷二十四紙上五經十卷同帙。",
        "translation": "Mañjuśrī's Questions Sūtra, 2 volumes (also called Mañjuśrī's Questions Sūtra), 51 pages (The Lady Above the Moon Sūtra, 2 volumes) (The Lady of Vimalakīrti), 29 pages (The Tathāgatagarbha Secret Vault Sūtra, 2 volumes), and 24 pages (The five scriptures above, 10 volumes) are in the same volume.",
        "source": "T55n2157_029:1033b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘密嚴經三卷(中天竺三藏地婆訶羅譯御製序)五十六紙新譯密嚴經三卷(經內題云大乘密嚴經御製序貞元新入目錄)五十一紙(大興善寺三藏沙門大廣智不空奉詔譯)占察善惡業報經二卷(亦云大乘實義經出大根聚經亦直云占察經亦名地藏菩薩經亦云地藏菩薩業報經)二十八紙蓮華面經二卷二十三紙上四經十卷同帙。",
        "translation": "大乘密嚴經三卷(中天竺三藏地婆訶羅譯御製序)五十六紙新譯密嚴經三卷(經內題云大乘密嚴經御製序貞元新入目錄)五十一紙(大興善寺三藏沙門大廣智不空奉詔譯)占察善惡業報經二卷(亦云大乘實義經出大根聚經亦直云占察經亦名地藏菩薩經亦云地藏菩薩業報經)二十八紙蓮華面經二卷二十三紙上四經十卷同帙。",
        "source": "T55n2157_029:1033b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利即菩薩經一卷(後漢月支三藏支婁迦讖譯)二十紙廣大寶樓閣善住祕密陀羅尼經三卷四十一紙大寶廣博樓閣經三卷(經內題云大寶廣博樓閣善住祕密陀羅尼經大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)四十五紙上四經九卷同帙。",
        "translation": "Wenshushili i.e., the Bodhisattva Sutra 1 volume (translated by the Latter Han Yuezhi trident, Zhilukakan) 20 pages, the Vast Jeweled Tower Well-Established Esoteric Dhāraṇī Sutra 3 volumes, 41 pages, the Vast Jeweled Tower Well-Established Esoteric Dhāraṇī Sutra 3 volumes (the title of the sutra is Vast Jeweled Tower Well-Established Esoteric Dhāraṇī Sutra, translated by the imperial order of the Tripiṭaka Master of Daxingshan Temple, Dagong Zhi Bhikong, into the Catalogue of New Entries of the Zhenyuan period) 45 pages, the above four sūtras, and nine volumes in the same book.",
        "source": "T55n2157_029:1033c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一字佛頂輪王經五卷(亦云五佛頂經或四卷)一百二十一紙一字頂輪王瑜伽經一卷(經內題云瑜伽毉迦說沙沙羅烏瑟尼沙斫訖羅直言安但那儀則一卷)六紙一字頂輪王念誦儀軌一卷(貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)金輪王佛頂略念誦法一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)大陀羅尼末法中一字心呪經一卷一十四紙上五經九卷同帙。",
        "translation": "一字佛頂輪王經五卷(亦云五佛頂經或四卷)一百二十一紙一字頂輪王瑜伽經一卷(經內題云瑜伽毉迦說沙沙羅烏瑟尼沙斫訖羅直言安但那儀則一卷)六紙一字頂輪王念誦儀軌一卷(貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)金輪王佛頂略念誦法一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)大陀羅尼末法中一字心呪經一卷一十四紙上五經九卷同帙。",
        "source": "T55n2157_029:1033c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經十卷(一帙)一百四十三紙大毘盧遮那成佛神變加持經七卷(亦云大毘盧遮那成佛經)一百三十五紙金剛頂經瑜伽修習毘盧遮那三麼地法一卷(南天竺國三藏沙門金剛智譯貞元新入目錄)一十五紙大毘盧遮那成佛神變加持經略示七支念誦隨行法一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)三紙大日經略攝念誦隨行法一卷(亦名五支略念誦要行法大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)二紙不空羂索毘盧遮那佛大灌頂光真言一卷(出不空羂索經二十八大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)二紙上五經十一卷同帙。",
        "translation": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經十卷(一帙)一百四十三紙大毘盧遮那成佛神變加持經七卷(亦云大毘盧遮那成佛經)一百三十五紙金剛頂經瑜伽修習毘盧遮那三麼地法一卷(南天竺國三藏沙門金剛智譯貞元新入目錄)一十五紙大毘盧遮那成佛神變加持經略示七支念誦隨行法一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)三紙大日經略攝念誦隨行法一卷(亦名五支略念誦要行法大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)二紙不空羂索毘盧遮那佛大灌頂光真言一卷(出不空羂索經二十八大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)二紙上五經十一卷同帙。",
        "source": "T55n2157_029:1033c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蘇婆呼童子經三卷(或云蘇婆呼請問經或云蘇婆呼律或云蘇麼呼或二卷)四十九紙蘇悉地羯羅經三卷九十一紙牟梨曼陀羅呪經一卷(或無經字)三十三紙大威力烏樞瑟摩明王經二卷(北天竺國三藏沙門無能勝譯貞元新入目錄)三十五紙穢跡金剛說神通大滿陀羅尼法術靈要門一卷(北天竺國三藏沙門無能勝譯貞元新入目錄)五紙穢跡金剛法禁百變法一卷(北天竺國三藏沙門無能勝譯貞元新入目錄)三紙上六經十一卷同帙。",
        "translation": "蘇婆呼童子經三卷(或云蘇婆呼請問經或云蘇婆呼律或云蘇麼呼或二卷)四十九紙蘇悉地羯羅經三卷九十一紙牟梨曼陀羅呪經一卷(或無經字)三十三紙大威力烏樞瑟摩明王經二卷(北天竺國三藏沙門無能勝譯貞元新入目錄)三十五紙穢跡金剛說神通大滿陀羅尼法術靈要門一卷(北天竺國三藏沙門無能勝譯貞元新入目錄)五紙穢跡金剛法禁百變法一卷(北天竺國三藏沙門無能勝譯貞元新入目錄)三紙上六經十一卷同帙。",
        "source": "T55n2157_029:1034a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大威怒烏芻澁摩儀軌一卷(貞元新入目錄)一十紙(大興善寺三藏沙門大廣智不空奉詔譯)聖迦抳忿怒金剛童子菩薩成就儀軌經三卷(貞元新入目錄)四十八紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽中略出念誦法四卷(亦云經)八十一紙(南天竺大弘教三藏金剛智奉詔譯)金剛頂瑜伽真實大教王經三卷(經內題云金剛頂一切如來真實攝大乘現證大教王經大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)四十三紙上四經十一卷同帙。",
        "translation": "大威怒烏芻澁摩儀軌一卷(貞元新入目錄)一十紙(大興善寺三藏沙門大廣智不空奉詔譯)聖迦抳忿怒金剛童子菩薩成就儀軌經三卷(貞元新入目錄)四十八紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽中略出念誦法四卷(亦云經)八十一紙(南天竺大弘教三藏金剛智奉詔譯)金剛頂瑜伽真實大教王經三卷(經內題云金剛頂一切如來真實攝大乘現證大教王經大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)四十三紙上四經十一卷同帙。",
        "source": "T55n2157_029:1034a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "千臂千鉢曼殊室利經十卷(內題云大乘瑜伽金剛性曼殊室利千臂千鉢大教王經并序記大唐贈開府儀同三司諡大弘教三藏金剛智奉詔譯)一百五十紙上一經十卷同帙。",
        "translation": "The Sutra of Mañjuśrī with a Thousand Arms and Thousand Bowls in Ten Fascicles (Titled, \"The Mahāyāna Yoga of Mañjuśrī with a Thousand Arms and Thousand Bowls, the Great King of Tantras,\" and Preface Notes to the Sutra, translated by Vajrajñjiputta Jingangzhi, the Grand Tripiṭaka of the Great Tang Temple, in honor of the opening of the office, with the same three offices.",
        "source": "T55n2157_029:1034b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛頂瑜伽三十七尊分別聖位法門一卷(并序經中修證法門序大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十三紙金剛頂瑜伽三十七尊禮一卷(經內題云金剛頂經金剛界大道場毘盧遮那如來自受用身內證智眷屬法身異名佛最上乘三摩地禮懺文貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽五祕密修行儀軌一卷(經內題云金剛薩埵五祕密修行念誦儀軌大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)十二紙金剛頂勝初瑜伽經中略出大樂金剛薩埵念誦儀一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十一紙金剛頂勝初瑜伽普賢菩薩念誦法一卷(貞元新入目錄)六紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽護摩儀一卷(經內云儀軌貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽十八會指歸一卷(經內略無十八會字貞元新入目錄)九紙(大興善寺三藏沙門大廣智不空奉詔譯)普賢金剛薩埵念誦法一卷(經內云瑜伽念誦儀軌貞元新入目錄)一十五紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂降三世大儀軌一卷(經內題云金剛頂降三世大儀軌法王教中觀自在菩薩心真言一切如來蓮花大曼陀羅品貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛瑜伽降三世成就極深密門一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)大樂金剛薩埵修行成就儀軌一卷(出吉祥勝初教王瑜伽經)十五紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛手光明灌頂經一卷(最勝五印聖無動尊大威怒王念誦儀軌)一十一紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)上十三經十三卷同帙。",
        "translation": "金剛頂瑜伽三十七尊分別聖位法門一卷(并序經中修證法門序大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十三紙金剛頂瑜伽三十七尊禮一卷(經內題云金剛頂經金剛界大道場毘盧遮那如來自受用身內證智眷屬法身異名佛最上乘三摩地禮懺文貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽五祕密修行儀軌一卷(經內題云金剛薩埵五祕密修行念誦儀軌大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)十二紙金剛頂勝初瑜伽經中略出大樂金剛薩埵念誦儀一卷(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)一十一紙金剛頂勝初瑜伽普賢菩薩念誦法一卷(貞元新入目錄)六紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽護摩儀一卷(經內云儀軌貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂瑜伽十八會指歸一卷(經內略無十八會字貞元新入目錄)九紙(大興善寺三藏沙門大廣智不空奉詔譯)普賢金剛薩埵念誦法一卷(經內云瑜伽念誦儀軌貞元新入目錄)一十五紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂降三世大儀軌一卷(經內題云金剛頂降三世大儀軌法王教中觀自在菩薩心真言一切如來蓮花大曼陀羅品貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛瑜伽降三世成就極深密門一卷(貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)大樂金剛薩埵修行成就儀軌一卷(出吉祥勝初教王瑜伽經)十五紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛手光明灌頂經一卷(最勝五印聖無動尊大威怒王念誦儀軌)一十一紙(大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)上十三經十三卷同帙。",
        "source": "T55n2157_029:1034b05_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "七佛所說神呪經四卷(初卷云七佛十一菩薩說大陀羅尼神呪經)七十三紙大吉義神呪經二卷(或四卷)三十九紙文殊師利法寶藏陀羅尼經一卷三十二紙金剛光焰止風雨陀羅尼經一卷二十一紙阿吒婆拘鬼神大將上佛陀羅尼經一卷(亦直云阿吒婆拘呪經)五紙阿彌陀鼓音聲王陀羅尼經一卷四紙大普賢陀羅尼經一卷三紙大七寶陀羅尼經一卷一紙六字陀羅尼呪經一卷二紙安宅神呪經一卷(亦云安宅呪經)四紙摩尼羅亶經一卷(亦云摩尼羅亶神呪經)四紙玄師颰陀所說神呪經一卷二紙(錄云幻師無所說字或作跋字亦云跋陀吉錄云幻王跋陀經)護諸童子陀羅尼呪經一卷(亦云諸童子請求男女陀羅尼經)四紙諸佛心陀羅尼經一卷三紙拔濟苦難陀羅尼經一卷二紙八名普密陀羅尼經一卷二紙持世陀羅尼經一卷四紙六門陀羅尼經一卷一紙清淨觀世音普賢陀羅尼經一卷(此經有一錯本應須審定)五紙上十九經二十三卷同帙。",
        "translation": "七佛所說神呪經四卷(初卷云七佛十一菩薩說大陀羅尼神呪經)七十三紙大吉義神呪經二卷(或四卷)三十九紙文殊師利法寶藏陀羅尼經一卷三十二紙金剛光焰止風雨陀羅尼經一卷二十一紙阿吒婆拘鬼神大將上佛陀羅尼經一卷(亦直云阿吒婆拘呪經)五紙阿彌陀鼓音聲王陀羅尼經一卷四紙大普賢陀羅尼經一卷三紙大七寶陀羅尼經一卷一紙六字陀羅尼呪經一卷二紙安宅神呪經一卷(亦云安宅呪經)四紙摩尼羅亶經一卷(亦云摩尼羅亶神呪經)四紙玄師颰陀所說神呪經一卷二紙(錄云幻師無所說字或作跋字亦云跋陀吉錄云幻王跋陀經)護諸童子陀羅尼呪經一卷(亦云諸童子請求男女陀羅尼經)四紙諸佛心陀羅尼經一卷三紙拔濟苦難陀羅尼經一卷二紙八名普密陀羅尼經一卷二紙持世陀羅尼經一卷四紙六門陀羅尼經一卷一紙清淨觀世音普賢陀羅尼經一卷(此經有一錯本應須審定)五紙上十九經二十三卷同帙。",
        "source": "T55n2157_029:1034c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀自在菩薩最勝明王心經一卷(經內題云金剛恐怖集會方廣儀軌觀自在菩薩三世最勝心明王經序品第一貞元新入目錄)十二紙(大興善寺三藏沙門大廣智不空奉詔譯)聖觀自在菩薩心真言觀行儀軌一卷(經內云瑜伽觀行軌儀大興善寺三藏沙門大廣智不空奉詔譯貞元新入目錄)六紙觀自在大悲成就瑜伽蓮花部念誦法門一卷(亦名成就大悲觀自在貞元新入目錄)十二紙(大興善寺三藏沙門大廣智不空奉詔譯)觀自在多羅瑜伽念誦法一卷(經內題云金剛頂經多羅菩薩念誦法貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)葉衣觀自在菩薩陀羅尼經一卷(經內略無陀羅尼字貞元新入目錄)八紙(大興善寺三藏沙門大廣智不空奉詔譯)瑜伽蓮華部念誦法一卷(貞元新入目錄)七紙(大興善寺三藏沙門大廣智不空奉詔譯)金剛頂蓮華部心念誦法一卷(經內云念誦儀軌貞元新入目錄)二十三紙(大興善寺三藏沙門大廣智不空奉詔譯)不動使者陀羅尼祕密法一卷(貞元新入目錄)十一紙(南天竺國三藏沙門金剛智譯)底哩三昧耶經一卷(經內題云底哩三昧耶不動使者念誦法貞元新入目錄)十四紙(大興善寺三藏沙門大廣智不空奉詔譯)智炬陀羅尼經一卷三紙諸佛集會陀羅尼經一卷四紙隨求即得大自在陀羅尼神呪經一卷(亦云隨求所得)一十四紙普遍光明大隨求陀羅尼經二卷(經內題云普遍光明清淨熾盛如意寶印心無能勝大明王大隨求陀羅尼經貞元新入目錄)三十三紙(大興善寺三藏沙門大廣智不空奉詔譯)百千印陀羅尼經一卷二紙上十四經十五卷同帙。",
        "translation": "Avalokitêśvara Bodhisattva's Mind Most Excellent King of Wisdom Dhāraṇī Sutra One Roll (the title of the sutra is Jingang Terrorist Assembly, Fangguang Ritual Guide Avalokitêśvara Bodhisattva's Threefold Most Excellent Mind King of Wisdom Sutra, Preface Chapter No. 1, Zhenyuan New Entry List) on twelve pages (translated by the imperial order of the Sanzang Shaman of Daxingshan Temple, Dazhong Zhigong Fukong).",
        "source": "T55n2157_029:1035a05_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "救面然餓鬼陀羅尼神呪經一卷(亦云施餓鬼食呪經後兼有施水呪)四紙施焰口餓鬼陀羅尼經一卷(經內題云佛說救拔焰口餓鬼陀羅尼經貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)莊嚴王陀羅尼呪經一卷四紙香王菩薩陀羅尼呪經一卷二紙一切法功德莊嚴王經一卷十四紙拔除罪障呪王經一卷三紙善夜經一卷三紙虛空藏菩薩能滿諸願最勝心陀羅尼求聞持法一卷四紙金剛頂經曼殊室利菩薩五字心陀羅尼品一卷十一紙金剛王菩薩念誦法一卷(經內題云念誦儀軌貞元新入目錄)十　二紙(大興善寺三藏沙門大廣智不空奉詔譯)觀自在如意輪菩薩瑜伽法要一卷九紙觀自在菩薩如意輪瑜伽一卷(貞元新入目錄)九紙(大興善寺三藏沙門大廣智不空奉詔譯)如意輪念誦法一卷(貞元新入目錄)八紙佛地經一卷十三紙佛垂般涅槃略說教誡經一卷(亦云佛臨般一名遺教經)六紙出生菩提心經一卷十一紙佛印三昧經一卷三紙文殊師利般涅槃經一卷四紙異出菩薩本起經一卷(或無起字)十一紙千佛因緣經一卷十八紙賢首經一卷(一名賢首夫人經)三紙月明菩薩經一卷(或加三昧字或云月明童子經亦云月明童男經)三紙心明經一卷(一名心明女梵志婦飯汁施經)三紙滅十方冥經一卷(或云十方滅冥經)六紙鹿母經一卷(別有鹿子經一卷與此全別)三紙魔逆經一卷一十九紙上二十六經二十六卷同帙。",
        "translation": "救面然餓鬼陀羅尼神呪經一卷(亦云施餓鬼食呪經後兼有施水呪)四紙施焰口餓鬼陀羅尼經一卷(經內題云佛說救拔焰口餓鬼陀羅尼經貞元新入目錄)四紙(大興善寺三藏沙門大廣智不空奉詔譯)莊嚴王陀羅尼呪經一卷四紙香王菩薩陀羅尼呪經一卷二紙一切法功德莊嚴王經一卷十四紙拔除罪障呪王經一卷三紙善夜經一卷三紙虛空藏菩薩能滿諸願最勝心陀羅尼求聞持法一卷四紙金剛頂經曼殊室利菩薩五字心陀羅尼品一卷十一紙金剛王菩薩念誦法一卷(經內題云念誦儀軌貞元新入目錄)十　二紙(大興善寺三藏沙門大廣智不空奉詔譯)觀自在如意輪菩薩瑜伽法要一卷九紙觀自在菩薩如意輪瑜伽一卷(貞元新入目錄)九紙(大興善寺三藏沙門大廣智不空奉詔譯)如意輪念誦法一卷(貞元新入目錄)八紙佛地經一卷十三紙佛垂般涅槃略說教誡經一卷(亦云佛臨般一名遺教經)六紙出生菩提心經一卷十一紙佛印三昧經一卷三紙文殊師利般涅槃經一卷四紙異出菩薩本起經一卷(或無起字)十一紙千佛因緣經一卷十八紙賢首經一卷(一名賢首夫人經)三紙月明菩薩經一卷(或加三昧字或云月明童子經亦云月明童男經)三紙心明經一卷(一名心明女梵志婦飯汁施經)三紙滅十方冥經一卷(或云十方滅冥經)六紙鹿母經一卷(別有鹿子經一卷與此全別)三紙魔逆經一卷一十九紙上二十六經二十六卷同帙。",
        "source": "T55n2157_029:1035b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "德光太子經一卷(一名賴吒羅所問光德太子經)一十九紙大意經一卷五紙堅固女經一卷(一名牢固女)六紙商主天子所問經一卷(或無所問字)一十七紙諸法最上王經一卷二十三紙師子莊嚴王菩薩請問經一卷(一名八曼茶羅)五紙佛為優填王說王法政論經一卷(貞元新入目錄)九紙(大興善寺三藏沙門大廣智不空奉詔譯)離垢慧菩薩所問禮佛法經一卷六紙受持七佛名號所生功德經一卷四紙佛臨涅槃記法住經一卷(或加般字)五紙寂照神變三摩地經一卷一十六紙差摩婆帝受記經一卷三紙不增不減經一卷(或云二卷者誤)七紙造塔功德經一卷二紙右遶佛塔功德經一卷(亦云遶塔功德經)三紙大乘四法經一卷(與重譯中日照名者字雖同經體全異)八紙有德女問大乘經一卷四紙(時有一本可八九紙文錯不勘)大乘流轉諸有經一卷三紙妙色王因緣經一卷四紙佛為海龍王說法經一卷一紙師子素駄娑王斷肉經一卷四紙般泥洹後灌蠟經一卷(一名般泥洹後四輩灌蠟經亦直名灌臘經)二紙八部佛名經一卷三紙上二十三經二十三卷同帙。",
        "translation": "德光太子經一卷(一名賴吒羅所問光德太子經)一十九紙大意經一卷五紙堅固女經一卷(一名牢固女)六紙商主天子所問經一卷(或無所問字)一十七紙諸法最上王經一卷二十三紙師子莊嚴王菩薩請問經一卷(一名八曼茶羅)五紙佛為優填王說王法政論經一卷(貞元新入目錄)九紙(大興善寺三藏沙門大廣智不空奉詔譯)離垢慧菩薩所問禮佛法經一卷六紙受持七佛名號所生功德經一卷四紙佛臨涅槃記法住經一卷(或加般字)五紙寂照神變三摩地經一卷一十六紙差摩婆帝受記經一卷三紙不增不減經一卷(或云二卷者誤)七紙造塔功德經一卷二紙右遶佛塔功德經一卷(亦云遶塔功德經)三紙大乘四法經一卷(與重譯中日照名者字雖同經體全異)八紙有德女問大乘經一卷四紙(時有一本可八九紙文錯不勘)大乘流轉諸有經一卷三紙妙色王因緣經一卷四紙佛為海龍王說法經一卷一紙師子素駄娑王斷肉經一卷四紙般泥洹後灌蠟經一卷(一名般泥洹後四輩灌蠟經亦直名灌臘經)二紙八部佛名經一卷三紙上二十三經二十三卷同帙。",
        "source": "T55n2157_029:1035c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩內習六波羅蜜經一卷(或云內六波羅蜜經安云方等部)三紙大乘理趣六波羅蜜多經十卷(貞元新入目錄一百六十紙御製序罽賓國三藏沙門般若奉詔譯)大花嚴長者問佛那羅延力經一卷(貞元新入目錄一紙御製序)(罽賓國三藏沙門般若奉詔譯)般若波羅蜜多心經一卷(貞元新入目錄)一紙(罽賓國三藏沙門般若譯)上四經十三卷同帙。",
        "translation": "One volume of the Sutra on the Six Perfections of Internal Cultivation for Bodhisattvas (also called the Sutra on the Six Perfections of Internal Cultivation for Bodhisattvas), three pages of the Sutra on the Six Perfections of the Mahāyāna Path, ten volumes (Zhenyan's New Catalogue of One Hundred and Sixty Pages, Preface by the Imperial Secretariat, translated by the imperial command of the Tripiṭaka School of Prajñāpāramitā, Kāśyapa), one volume of the Sutra on the Power of the Flower Ornament, one page of the Imperial Secretariat, translated by the imperial command of the Tripiṭaka School of Prajñpāramitā, Kāśyapa, and one volume of the Heart Sutra (Zhenyan's New Catalogue of One Hundred and Sixty Pages, translated by the Imperial Secretariat of the Tripiṭaka School of Prajñpāramitā, Kāśyapa).",
        "source": "T55n2157_029:1036a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本生心地觀經八卷(大唐罽賓國三藏沙門般若譯奉勅編入貞元錄中)上一經八卷一帙。",
        "translation": "Eight Fascicle Sutra of Contemplation on the Mind Ground in the Buddha's Life (Translated and Incorporated into the Zhenyuan Catalogue by Samzang Salmon Prajñā by the Great Tang Dynasty's Krakucchanate) Previously, eight fascicles in one sūtra.",
        "source": "T55n2157_029:1036a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薩埵投身餓虎起塔因緣經一卷(僧祐錄云以身施餓虎經)一十二紙金剛三昧本性清淨不壞不滅經一卷(亦名金剛清淨經)八紙師子月佛本生經一卷七紙長者法志妻經一卷三紙薩羅國經一卷(或云薩國王經)四紙十吉祥經一卷二紙吉祥天女十二名號經一卷(貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)大吉祥天女經一卷(經內題云佛說大吉祥天女十二契一百八名無垢大乘經貞元新入目錄)六紙(大興善寺三藏沙門大廣智不空奉詔譯)長者女菴提遮師子吼了義經一卷五紙一切智光明仙人慈心因緣不食肉經一卷五紙金剛三昧經二卷(或一卷)二十七紙法滅盡經一卷三紙甚深大迴向經一卷四紙天王太子辟羅經一卷(亦云太子辟羅經或無天王字)三紙優婆夷淨行法門經二卷(亦直云淨行經或無經字)三十二紙八大人覺經一卷一紙三品弟子經一卷(亦云弟子覺有三輩經)三紙四輩經一卷(或云四輩弟子經或云四輩學經)三紙當來變經一卷(或云當來變識經)二紙過去佛分衛經一卷(或云過世)二紙十二頭陀經一卷(一名沙門頭)五紙樹提伽經一卷三紙長壽王經一卷六紙法常住經一卷二紙上二十四經二十四卷同帙。",
        "translation": "薩埵投身餓虎起塔因緣經一卷(僧祐錄云以身施餓虎經)一十二紙金剛三昧本性清淨不壞不滅經一卷(亦名金剛清淨經)八紙師子月佛本生經一卷七紙長者法志妻經一卷三紙薩羅國經一卷(或云薩國王經)四紙十吉祥經一卷二紙吉祥天女十二名號經一卷(貞元新入目錄)二紙(大興善寺三藏沙門大廣智不空奉詔譯)大吉祥天女經一卷(經內題云佛說大吉祥天女十二契一百八名無垢大乘經貞元新入目錄)六紙(大興善寺三藏沙門大廣智不空奉詔譯)長者女菴提遮師子吼了義經一卷五紙一切智光明仙人慈心因緣不食肉經一卷五紙金剛三昧經二卷(或一卷)二十七紙法滅盡經一卷三紙甚深大迴向經一卷四紙天王太子辟羅經一卷(亦云太子辟羅經或無天王字)三紙優婆夷淨行法門經二卷(亦直云淨行經或無經字)三十二紙八大人覺經一卷一紙三品弟子經一卷(亦云弟子覺有三輩經)三紙四輩經一卷(或云四輩弟子經或云四輩學經)三紙當來變經一卷(或云當來變識經)二紙過去佛分衛經一卷(或云過世)二紙十二頭陀經一卷(一名沙門頭)五紙樹提伽經一卷三紙長壽王經一卷六紙法常住經一卷二紙上二十四經二十四卷同帙。",
        "source": "T55n2157_029:1036a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘律二十七部五十五卷五帙",
        "translation": "Twenty-seven Mahāyāna Vinaya texts in fifty-five volumes and five books",
        "source": "T55n2157_029:1036b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩地持經十卷(或無經字亦云論亦云菩薩戒經又名菩薩地經或八卷一帙)一百八十六紙菩薩善戒經九卷(一名菩薩地或十卷)一百八十紙淨業障經一卷一十五紙上二經十卷同帙。",
        "translation": "Ten Fascicle Sutra of the Bodhisattva Ground Observance (either without the word sūtra or as a treatise or as a sutra of the bodhisattva precepts, also known as the Bodhisattva Ground Sutra or eight fascicles in one), one hundred and eighty-six paper Sutra of the Bodhisattva Good Morality, nine fascicles (one of the Bodhisattva Ground or ten fascicles), one hundred and eighty paper Sutra of the Purification of Karmic Hindrances, one volume, one fifteen paper, and ten fascicles of the above two sutras in one volume.",
        "source": "T55n2157_029:1036b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優婆塞戒經七卷(或五卷或六卷或十卷是在家菩薩戒)一百三十一紙梵網經二卷三十六紙受十善戒經一卷一十六紙受菩提心戒儀一卷(經內題云最上乘教受戒懺悔文普賢瑜伽阿闍利集貞元新入目錄)三紙(大興善寺三藏沙門大廣智不空奉詔譯)上四經十一卷同帙。",
        "translation": "The seven-fascicle Sutra of the Upāsaka Precepts (either five, six, or ten fascicles of the lay practitioners of the bodhisattva precepts), the 131-page Sutra of Brahmā's Net, two fascicles, 36 pages, the 16-page Sutra of the Ten Good Moral Practices, one volume, and the 16-page Sutra of the Regulations for Receiving the Bodhisattva Precepts (titled in the sutra as the most excellent vehicle for receiving the precepts and repenting the text, the new entry in the Catalogue of the Ajñātaśatru Collection, Zhenyan Yoga), three pages (translated by imperial order from the Tripiṭaka of the Daxingshan Temple by the monk Dagong Zhifukong), and the eleven fascicles of the four preceding sutras are in the same volume.",
        "source": "T55n2157_029:1036c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩瓔珞本業經二卷三十九紙",
        "translation": "Pusa yingluo benye jing (The Bodhisattva Yingluo benye jing) 2 vols. 39 sheets (Daesang sanzang shaman Dagong zhi bukong yi)",
        "source": "T55n2157_029:1036c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛藏經四卷(一名選擇諸法經或三卷或二卷)七十紙菩薩戒本一卷(曇無讖譯)十一紙菩薩戒本一卷(三藏玄奘譯)十八紙菩薩戒羯摩文一卷六紙菩薩善戒經一卷(優婆離問菩薩受戒法)十五紙上六經十卷同帙。",
        "translation": "Four Foshuzang jing (a scripture on the selection of dharmas, or three or two volumes), seventy pages, one volume of the text of the bodhisattva precepts (translated by Dharmakṣema), eleven pages, one volume of the text of the bodhisattva precepts (translated by Xuanzang of the Tripiṭaka), eighteen pages, one volume of the karma text of the bodhisattva precepts, six pages, one volume of the bodhisattva good morality scripture (Upāli asked the bodhisattva about the rules for receiving the precepts), fifteen pages, and ten volumes of the above six scriptures in the same volume.",
        "source": "T55n2157_029:1036c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩內戒經一卷十八紙",
        "translation": "Sutra of the Bodhisattva's Inner Precepts, one volume, eighteen pages",
        "source": "T55n2157_029:1036c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優婆塞五戒威儀經一卷十五紙",
        "translation": "Sutra on the Regulations of the Five Precepts in One Volume and Fifteen Sheets",
        "source": "T55n2157_029:1036c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利淨律經一卷(或直名淨律經)十三紙清淨毘尼方廣經一卷十七紙寂調音所問經一卷(一名如來所說清涼調伏經)十八紙大乘三聚懺悔經一卷十三紙菩薩五法懺悔文一卷(亦名菩薩五法懺悔經)二紙菩薩藏經一卷十紙三曼陀颰陀羅菩薩經一卷七紙菩薩受齋經一卷三紙文殊悔過經一卷(一名文殊五體悔經)二十一紙舍利弗悔過經一卷(亦直名悔過經)五紙法律三昧經一卷(亦直名法律)七紙十善業道經一卷六紙上十四經十四卷同帙　計一百七十二紙。",
        "translation": "文殊師利淨律經一卷(或直名淨律經)十三紙清淨毘尼方廣經一卷十七紙寂調音所問經一卷(一名如來所說清涼調伏經)十八紙大乘三聚懺悔經一卷十三紙菩薩五法懺悔文一卷(亦名菩薩五法懺悔經)二紙菩薩藏經一卷十紙三曼陀颰陀羅菩薩經一卷七紙菩薩受齋經一卷三紙文殊悔過經一卷(一名文殊五體悔經)二十一紙舍利弗悔過經一卷(亦直名悔過經)五紙法律三昧經一卷(亦直名法律)七紙十善業道經一卷六紙上十四經十四卷同帙　計一百七十二紙。",
        "source": "T55n2157_029:1036c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘論九十九部五百二十卷五十帙二十一部一百五十五卷釋論　七十八部三百六十五卷集義論。",
        "translation": "There are ninety-nine great vehicle treatises, five hundred and twenty volumes, fifty books, twenty-one divisions, one hundred and fifty-five volumes of treatises, seventy-eight divisions, three hundred and sixty-five volumes of collected teachings, and one hundred and seventy-two volumes of treatises.",
        "source": "T55n2157_029:1037a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大智度論一百卷(或云大智度經論亦云摩訶般若釋論或一百一十卷或七十卷)十帙二千八十五紙十地經論十二卷(或十五卷一帙)二百四十六紙彌勒菩薩所問經論五卷(或六卷或七卷或十卷)一百二十八紙大乘寶積經論四卷八十四紙寶髻菩薩四法經論一卷(題云寶髻經四法優婆提舍)一十二紙上三論十卷同帙　計二千五百五十五紙。",
        "translation": "The Mahāprajñāpāramitā-sūtra-śāstra in one hundred volumes (or the Mahāprajñāpāramitā-sūtra-śāstra in one hundred and one volumes or seventy volumes) is two thousand eight hundred and fifty-five pages in ten volumes, and the Ten Stages Sutra-śāstra in twelve volumes (or fifteen volumes in one volume) is two hundred and forty-six pages, and the Maitreya-bodhisattva's Questions Sutra-śāstra in five volumes (or six volumes, seven volumes, or ten volumes) is one hundred and twenty-eight pages.",
        "source": "T55n2157_029:1037a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛地經論七卷一百一十七紙",
        "translation": "The seven volumes of the Treatise on the Buddha-stage Sutra are 117 pages long.",
        "source": "T55n2157_029:1037a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛般若論二卷(無著菩薩造)三十紙能斷金剛般若波羅蜜多經論頌一卷(亦云能斷金剛論頌)四紙上三論十卷同帙　計一百五十一紙。",
        "translation": "Treatise on the Diamond Sutra (2 volumes) (also called Verses on the Diamond Sutra), 30 pages; Verses on the Diamond Sutra (1 volume), 4 pages; and the preceding three treatises (10 volumes), all in one volume.",
        "source": "T55n2157_029:1037a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛般若波羅蜜論三卷(天親菩薩造)四十八紙能斷金剛般若波羅蜜多經論釋三卷(亦云能斷金剛論釋)三十三紙金剛般若波羅蜜經破取著不壞假名論二卷(亦名功德施論)三十三紙文殊師利菩薩問菩提經論二卷(亦云文殊問菩提經論一名伽耶山頂經論)三十紙妙法蓮華經論一卷(題云妙法蓮花經優婆提舍)二十五紙上五論十一卷同帙　計一百六十九紙。",
        "translation": "Treatise on the Diamond Sutra, Three Volumes (also called the Treatise on the Diamond Sutra), forty-eight pages; Treatise on the Diamond Sutra, Three Volumes (also called the Treatise on the Diamond Sutra), thirty-three pages; Treatise on the Diamond Sutra, Two Volumes (also called the Treatise on the Giving of Merit), thirty-three pages; Treatise on the Sutra of Mañjuśrī's Questions to the Bodhisattva, Two Volumes (also called the Treatise on the Sutra of Mañjuśrī's Questions to the Bodhisattva, One Treatise on the Gayāśanīputra), thirty pages; Treatise on the Lotus Sutra, One Volume (also called the Treatise on the Lotus Sutra, Upadeśa), twenty-five pages; and Five Treatises, Eleven Volumes (also called the Treatise on the Giving of Merit), One Hundred and Sixty-nine Pages.",
        "source": "T55n2157_029:1037a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法華經論二卷(初有歸敬頌者是或一卷亦云妙法蓮花經優婆提舍)三十紙勝思惟梵天所問經論四卷(或三卷)五十九紙涅槃論一卷(或云大涅槃經論)一十紙涅槃經本有今無偈論一卷(亦直云本有今無)六紙遺教經論一卷二十六紙無量壽經論一卷(題云無量壽經優波提舍願生偈)七紙三具足經論一卷(題云三具足經優婆提舍)一十八紙轉法輪經論一卷(題云轉法輪經優波提舍)一十紙上八論十一卷同帙　計一百六十六紙。",
        "translation": "法華經論二卷(初有歸敬頌者是或一卷亦云妙法蓮花經優婆提舍)三十紙勝思惟梵天所問經論四卷(或三卷)五十九紙涅槃論一卷(或云大涅槃經論)一十紙涅槃經本有今無偈論一卷(亦直云本有今無)六紙遺教經論一卷二十六紙無量壽經論一卷(題云無量壽經優波提舍願生偈)七紙三具足經論一卷(題云三具足經優婆提舍)一十八紙轉法輪經論一卷(題云轉法輪經優波提舍)一十紙上八論十一卷同帙　計一百六十六紙。",
        "source": "T55n2157_029:1037b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瑜伽師地論一百卷(十帙)一千八百一十七紙顯揚聖教論二十卷(二帙)三百二十七紙瑜伽師地論釋一卷一十九紙顯揚聖教論頌一卷一十三紙王法正理論一卷二十紙大乘阿毘達磨集論七卷一百三紙上四論十卷同帙　計二千二百九十九紙。",
        "translation": "Yogâcārabhūmi-śāstra One Hundred Volumes (Ten Books) One Thousand Eight Hundred and One Seventeen Papers Revealing the Holy Teaching Twenty Volumes (Two Books) Three Hundred and Twenty-seven Papers Explanation of the Yogâcrabhūmi-śāstra One Nineteen Papers Revealing the Holy Teaching Verses One Thirteen Papers King Dharma Correct Principles Treatise One Twenty Papers Mahāyāna Abhidharma Collected Treatises Seven Volumes One Hundred and Three Papers Up Four Treatises Ten Papers in One Book Total Two Thousand Two Hundred and Ninety-nine Papers",
        "source": "T55n2157_029:1037b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘阿毘達磨雜集論十六卷二百五十五紙中論四卷(亦云中觀論或八卷)九十八紙上二論二十卷同帙　計三百五十三紙。",
        "translation": "The Dasheng abhidharma zajilun is sixteen volumes of 255 pages, and the middle-level treatise is four volumes (also called the middle-level contemplation treatise or eight volumes) of 98 pages and the upper-level two treatises of 20 pages in the same volume, totaling 353 pages.",
        "source": "T55n2157_029:1037b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若燈論釋十五卷二百五十二紙",
        "translation": "Prajñāpradīpa-mūlamadhyamaka-vṛtti-śāstra, fifteen volumes, 252 pages.",
        "source": "T55n2157_029:1037b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二門論一卷二十四紙",
        "translation": "Dvādaśanikāya-śāstra (Twelve Treatises) in One Volume and Twenty-Four Sheets",
        "source": "T55n2157_029:1037b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八空論一卷二十紙",
        "translation": "Shiba honglun 1 vol. 20 papyri",
        "source": "T55n2157_029:1037b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百論二卷四十三紙",
        "translation": "Hundred Treatises, Two Volumes, Forty-three Sheets",
        "source": "T55n2157_029:1037b26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣百論本一卷八紙",
        "translation": "Guangbailun ben 1 vol. 8 pag.",
        "source": "T55n2157_029:1037b27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上五論二十卷(二帙)　計三百四十七紙。",
        "translation": "The above five treatises comprise twenty volumes (two books) and total three hundred and forty-seven pages.",
        "source": "T55n2157_029:1037b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘廣百論釋論十卷(一帙)一百九十七紙十住毘婆沙論十四卷(或無論字或十二卷或十五卷)二百七十六紙菩提資糧論六卷六十七紙上二論二十卷(二帙)　計五百四十紙。",
        "translation": "Dasheng guang bai lun shi lun 10 volumes (one book), 197 pages, and Shizhu pibalsa lun 14 volumes (or whatever the title is, 12 volumes, or 15 volumes), 276 pages, and Bodhisambhāraṇa lun 6 volumes, 67 pages, and Shang Er lun 20 volumes (two books), totaling 540 pages.",
        "source": "T55n2157_029:1037c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘莊嚴經論十三卷(或十五卷一帙)二百五紙順中論二卷(題云順中論義入大般若波羅蜜經)三十二紙攝大乘論三卷(真諦三藏譯)五十九紙上三論二十卷(二帙)計五百五紙。",
        "translation": "Thirteen volumes of the Treatise on the Scripture of Adorning the Great Vehicle (or fifteen volumes in one), two hundred and five pages of the Shunzong lun, two volumes (titled Shunzong lun yi into the Great Perfection of Wisdom Sutra), thirty-two pages of the Compendium of the Great Vehicle, three volumes (translated by the True Truth Tripiṭaka), fifty-nine pages of the superior three treatises, twenty volumes (two books), and five hundred and five pages in total.",
        "source": "T55n2157_029:1037c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝大乘論二卷(佛陀扇多譯)四十四紙攝大乘論本三卷(三藏玄奘譯)六十六紙攝大乘論釋十五卷(世親釋真諦譯或十二卷亦云釋論)三百二十七紙上三論二十卷(二帙)計四百三十二紙。",
        "translation": "The two volumes of the Compendium of the Great Vehicle (translated by Buddhacarita) are 44 pages long, and the three volumes of the Compendium of the Great Vehicle (translated by Xuanzang of the Tripiṭaka) are 66 pages long. The fifteen volumes of the Compendium of the Great Vehicle (translated by Vasubandhu of the True Truth or twelve volumes, also called the Compendium of the Great Vehicle) are 327 pages long, and the twenty volumes of the above three treatises (two books) total 432 pages.",
        "source": "T55n2157_029:1037c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝大乘論釋論十卷(世親釋笈多譯)一百五十六紙攝大乘釋論十卷一帙(世親釋玄奘譯)一百七十六紙攝大乘論釋十卷一帙(無性釋玄奘譯)二百一十六紙佛性論四卷八十三紙決定藏論三卷五十三紙辯中邊論頌一卷五紙中邊分別論二卷(或三卷)三十八紙上四論十卷同帙　計七百二十七紙。",
        "translation": "The ten volumes of the Compendium of the Great Vehicle (translated by Śrīgarbha) are one hundred and fifty-six pages, and the ten volumes of the Compendium of the Great Vehicle are one book (translated by Śrīgarbha Xuanzang) are one hundred and seventy-six pages, and the ten volumes of the Compendium of the Great Vehicle are one book (translated by Wuxiang Shi Xuanzang) are two hundred and sixteen pages, and the four volumes of the Treatise on Buddha-nature are eighty-three pages, and the three volumes of the Treatise on the Determination of the Canon are fifty-three pages, and the one volume of the Verses of the Madhyânta-vibhāga is five pages, and the two (or three) volumes of the Madhyânta-vibhāga are thirty-eight pages, and the upper four volumes of the Treatise are ten volumes in length.",
        "source": "T55n2157_029:1037c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辯中邊論三卷三十九紙",
        "translation": "The three volumes of the Madhyânta-vibhāga are thirty-nine pages long.",
        "source": "T55n2157_029:1037c25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "究竟一乘寶性論四卷(亦云寶性分別七乘增上論或三卷或五卷)八十紙業成就論一卷一十二紙大乘成業論一卷一十七紙因明正理門論本一卷(三藏玄奘譯)一十五紙上五論十卷同帙　計一百六十三紙。",
        "translation": "The Four-fascicle Jewel-Nature Treatise on the Final One Vehicle (also known as the Jewel-Nature Discrimination of the Seven Vehicles, or three or five fascicles) is eighty pages, and the One-fascicle Treatise on the Accomplishment of Karma is twelve pages, and the One-fascicle Mahāyāna Treatise on the Accomplishment of Karma is seventeen pages, and the One-fascicle Nyāyāna Treatise on the Correct Gate of Logic is fifteen pages, and the ten fascicles of the five treatises above are one hundred and sixty-three pages in length.",
        "source": "T55n2157_029:1037c26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因明正理門論一卷(三藏義淨譯)一十六紙因明入正理論一卷六紙顯識論一卷(題云顯識品從無相論出)一十九紙轉識論一卷三紙唯識論一卷(一名破色心初云唯識無境界或云唯識無境界論)一十九紙唯識論一卷(初云修道不共他或云乘唯識論)一十紙唯識二十論一卷一十紙成唯識寶生論五卷(一名三十唯識順釋論)六十五紙唯識三十論一卷二紙上九論十三卷同帙　計一百三十四紙。",
        "translation": "因明正理門論一卷(三藏義淨譯)一十六紙因明入正理論一卷六紙顯識論一卷(題云顯識品從無相論出)一十九紙轉識論一卷三紙唯識論一卷(一名破色心初云唯識無境界或云唯識無境界論)一十九紙唯識論一卷(初云修道不共他或云乘唯識論)一十紙唯識二十論一卷一十紙成唯識寶生論五卷(一名三十唯識順釋論)六十五紙唯識三十論一卷二紙上九論十三卷同帙　計一百三十四紙。",
        "source": "T55n2157_029:1038a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成唯識論十卷(一帙)一百七十五紙大丈夫論二卷三十四紙入大乘論二卷四十一紙大乘掌珍論二卷三十二紙大乘五蘊論一卷(世親造玄奘譯)八紙大乘廣五蘊論一卷(與前論異本或無廣字安惠造日照譯)一十三紙寶行王正論一卷一十九紙大乘起信論一卷(真諦三藏譯)二十五紙上七論十卷同帙　計三百四十八紙。",
        "translation": "Cheng weishi lun 10 rolls (one volume) 175 pages Da hua lun 2 rolls 34 pages Entering the great vehicle lun 2 rolls 41 pages Dasheng pinzhen lun 2 rolls 32 pages Dasheng wuzun lun 1 roll (Shijin zong xuanzang translator) 8 pages Dasheng guang wuzun lun 1 roll (different from the previous one or without the word guang) 13 pages Bao xingwang zheng lun 1 rolls 19 pages Dasheng qixin lun 1 roll (Zhenti sanzang translator) 25 pages Shang qi lun 10 rolls same volume Total 348 pages.",
        "source": "T55n2157_029:1038a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘起信論二卷(實叉難陀譯)二十四紙發菩提心論二卷(或法菩提心經亦云經論)二十八紙金剛頂瑜伽中發阿耨多羅三藐三菩提心論一卷(亦云瑜伽總持教門說菩提心觀行修持義貞元新入目錄)七紙三無性論二卷(題云三無性論品出無相論或一卷)四十五紙方便心論一卷(或二卷凡四品)一十七紙如實論一卷(題云如實反質難品)三十三紙無相思塵論一卷(或直云思塵論)三紙觀所緣緣論釋一卷一十三紙上九論十二卷同帙　計一百四十六紙。",
        "translation": "大乘起信論二卷(實叉難陀譯)二十四紙發菩提心論二卷(或法菩提心經亦云經論)二十八紙金剛頂瑜伽中發阿耨多羅三藐三菩提心論一卷(亦云瑜伽總持教門說菩提心觀行修持義貞元新入目錄)七紙三無性論二卷(題云三無性論品出無相論或一卷)四十五紙方便心論一卷(或二卷凡四品)一十七紙如實論一卷(題云如實反質難品)三十三紙無相思塵論一卷(或直云思塵論)三紙觀所緣緣論釋一卷一十三紙上九論十二卷同帙　計一百四十六紙。",
        "source": "T55n2157_029:1038a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迴諍論一卷二十五紙",
        "translation": "The Treatise on the Refutation of Controversies is one volume of twenty-five pages.",
        "source": "T55n2157_029:1038b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣生論一卷一十一紙",
        "translation": "Yisheng lun (緣生論) 1 vol. 11 pp.",
        "source": "T55n2157_029:1038b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘緣生論一卷(經中云聖者鬱楞迦造貞元新入目錄)一十紙(大興善寺三藏沙門大廣智不空奉詔譯)十二因緣論一卷四紙一輸盧迦論一卷(或云一書)三紙大乘百法明門論一卷(題云大乘百法明門論本事分中略錄名數)二紙百字論一卷八紙解捲論一卷三紙掌中論一卷三紙取因假設論一卷九紙觀總相論頌一卷一紙止觀門論頌一卷四紙手杖論一卷七紙六門教授習定論一卷九紙大乘法界無差別論一卷六紙破外道小乘四宗論一卷六紙破外道小乘涅槃論一卷五紙上十七論十七卷同帙都計大乘經律論。",
        "translation": "大乘緣生論一卷(經中云聖者鬱楞迦造貞元新入目錄)一十紙(大興善寺三藏沙門大廣智不空奉詔譯)十二因緣論一卷四紙一輸盧迦論一卷(或云一書)三紙大乘百法明門論一卷(題云大乘百法明門論本事分中略錄名數)二紙百字論一卷八紙解捲論一卷三紙掌中論一卷三紙取因假設論一卷九紙觀總相論頌一卷一紙止觀門論頌一卷四紙手杖論一卷七紙六門教授習定論一卷九紙大乘法界無差別論一卷六紙破外道小乘四宗論一卷六紙破外道小乘涅槃論一卷五紙上十七論十七卷同帙都計大乘經律論。",
        "source": "T55n2157_029:1038b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見入藏者。",
        "translation": "See those who have entered the canon.",
        "source": "T55n2157_029:1038b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總八百八部。",
        "translation": "It's eight hundred and eighty-eight books in total.",
        "source": "T55n2157_029:1038b25_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二千九百八十八卷。",
        "translation": "Two thousand nine hundred and eighty-eight volumes.",
        "source": "T55n2157_029:1038b25_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三百七十六帙　與前廣錄部數不同者。",
        "translation": "These 376 books are different from the number of books in the previous extensive record.",
        "source": "T55n2157_029:1038b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前廣錄中以大寶積經。",
        "translation": "In the previous extensive record, the Mahāprajñāpāramitā-sūtra was used.",
        "source": "T55n2157_029:1038b27_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸部合成分為四十九部上錄。",
        "translation": "The sections were combined into forty-nine sections in the above record.",
        "source": "T55n2157_029:1038b27_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此合為一部故欠四十八。",
        "translation": "This is combined into one, so it's owed forty-eight.",
        "source": "T55n2157_029:1038c01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不同。",
        "translation": "It's different.",
        "source": "T55n2157_029:1038c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貞元新定釋教目錄卷第二十九",
        "translation": "Zhenyan Revised List of Canonical Buddhist Texts, Volume 29",
        "source": "T55n2157_029:1038c03_0",
        "is_bad_quality": false
    }
]