[
    {
        "source_sentence": "佛說天地八陽神呪經",
        "translation": "Sutra on the Eight Yang Spells of Heaven and Earth",
        "source": "T85n2897_001:1422b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐三藏法師義淨奉詔譯",
        "translation": "Translated by imperial order by the Tang Tripiṭaka Master Yijing",
        "source": "T85n2897_001:1422b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞如是：一時，佛在毘耶達摩城寥廓宅中，十方相隨四眾圍繞。",
        "translation": "Thus I heard: One time, the Buddha was in the spacious mansion of Vaiśravaṇa, surrounded by a multitude of people in ten directions.",
        "source": "T85n2897_001:1422b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，無礙菩薩在大眾中，即從座起而白佛言：「世尊！",
        "translation": "At the time, the Bodhisattva of Unhinderedness rose from his seat in the midst of the crowd and said to the Buddha, \"Bhagavān!",
        "source": "T85n2897_001:1422b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此閻浮提眾生遞代相生，無始已來相續不斷，有識者少，無識者多；念佛者少，不念佛者多；神通者少，不神通者多；持戒者少，破戒者多；精進者少，懈怠者多；智慧者少，愚癡者多；長壽者少，短命者多；禪定者少，散亂者多；富貴者少，貧賤者多；柔軟者少，剛強者多；布施者少，慳貪者多；信實者少，虛妄者多。",
        "translation": "These sentient beings in Jambudvīpa are produced from generation to generation, continuously since beginningless time, with few who have consciousness and many who don't have consciousness; few who are mindful of the Buddha and many who aren't; few who have supernormal powers and many who don't; few who observe precepts and many who break them; few who are diligent and many who are lazy; few who are wise and many who are foolish; few who have long lives and many who have short lives; few who are meditated and many who are distracted; few who are wealthy and few who are poor; few who are gentle and many who are strong; few who are generous and many who are stingy and greedy; few who are faithful and many who are false.",
        "source": "T85n2897_001:1422b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "被使世俗淺薄，官法荼毒賊役煩重，百姓窮苦取求難得，良由信邪倒見獲如是苦。",
        "translation": "They cause worldly people to be shallow, officials and laws to poison them, thieves to ensnare them, and people to suffer in poverty and obtain what they want because of their belief in wrong views and mistaken views.",
        "source": "T85n2897_001:1422b26_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊為諸邪見眾生說其正見之法，令得悟解免於眾苦。」",
        "translation": "Please let the Bhagavān teach the Dharma of right view to sentient beings with wrong views, so that they may attain awakening and understanding and be spared the many sufferings.\"",
        "source": "T85n2897_001:1422b28_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T85n2897_001:1422c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無礙菩薩！",
        "translation": "Unobstructed Bodhisattva!",
        "source": "T85n2897_001:1422c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝大慈悲，為諸邪見眾生問於如來正見之法，不可思議。",
        "translation": "With great compassion, you asked the Tathāgata about the inconceivable teaching of right view for sentient beings with wrong views.",
        "source": "T85n2897_001:1422c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "All of you, listen closely!",
        "source": "T85n2897_001:1422c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Think of it well!",
        "source": "T85n2897_001:1422c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝分別演說天地八陽之經。",
        "translation": "\"I will explain for you the scriptures of heaven and earth and the eight suns.",
        "source": "T85n2897_001:1422c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經過去諸佛已說，未來諸佛當說，現在諸佛今說。",
        "translation": "It's been taught by past Buddhas, will be taught by future Buddhas, and is being taught by present Buddhas.",
        "source": "T85n2897_001:1422c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫天地之間為人最勝、最上者，貴於一切萬物。",
        "translation": "Between heaven and earth, he's the most superior and the highest of humans, and he's superior to all living things.",
        "source": "T85n2897_001:1422c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人者，真也，正也，心無虛妄身行正真。",
        "translation": "A person is true and correct, and his mind is without falsity; his body's actions are correct and true.",
        "source": "T85n2897_001:1422c07_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "左[必-心]為真，右乀為正，常行正真故名為人。",
        "translation": "The left [must - mind] is true, the right hand side is correct, and always practicing rightly and truly is called being human.",
        "source": "T85n2897_001:1422c08_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是知人能弘道以潤身，依道依人皆成聖道。",
        "translation": "This is because they know that people can spread the path to nourish themselves, and they all achieve the noble path based on the path and people.",
        "source": "T85n2897_001:1422c09_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，無礙菩薩！",
        "translation": "\"Furthermore, the unhindered bodhisattva!",
        "source": "T85n2897_001:1422c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生既得人身，不能修福，背真向偽，造種種惡業，命將欲終必沈苦海受種種罪。",
        "translation": "\"All sentient beings who obtain a human life but aren't able to cultivate goodness and turn their backs on the truth create various bad actions, and when their lives are about to end, they'll surely sink into the ocean of suffering and suffer various kinds of sins.",
        "source": "T85n2897_001:1422c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若聞此經信受不逆，即得解脫諸罪之難出於苦海，善神加護無諸障礙，延年益壽而無橫夭；以信力故獲如是福，何況有人盡能書寫、受持、讀誦，如法修行；說其功德不可稱、不可量，無有邊際，壽終之後並得成佛。」",
        "translation": "If someone hears this sūtra and accepts it without rebellion, they'll be freed from the difficulty of committing all kinds of sins and escape from the ocean of suffering, be protected by good spirits without any obstacles, prolong their lives without dying suddenly, and attain such fortune because of the power of faith, let alone someone who can write, memorize, recite, and practice according to the teaching; their merits are said to be incalculable and immeasurable, without limit, and they'll attain Buddhahood after their life ends.\"",
        "source": "T85n2897_001:1422c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告無礙菩薩摩訶薩：「若有眾生信邪倒見，即被邪魔外道、魑魅魍魎、鳥鳴百怪、諸惡鬼神競來惱亂，與其橫病、惡種、惡注，受其苦痛無有休息。",
        "translation": "The Buddha told the Unhindered Bodhisattva Mahāsattva, \"If sentient beings believe in wrong mistaken views, they'll be disturbed by evil demons and non-Buddhists, spirits of spirits and monsters, birds and monsters, and all kinds of bad spirits, and they'll suffer pain without rest from their unwholesome illnesses, bad seeds, and bad bonds.",
        "source": "T85n2897_001:1422c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遇善知識為讀此經三遍，是諸惡鬼皆悉消滅，病即除愈身強力足，讀經功德獲如是福。",
        "translation": "When a good teacher reads this sūtra three times for them, those bad spirits all go away, and their illnesses are healed, and their bodies become strong and powerful.",
        "source": "T85n2897_001:1422c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生多於婬欲、瞋恚、愚癡、慳貪、嫉妬，若見此經信敬供養，即讀三遍，愚癡等惡並皆除滅，慈悲喜捨得佛法分。",
        "translation": "If sentient beings with lots of lust, anger, folly, stinginess, greed, and jealousy see this sūtra and read it three times with faith, respect, and offerings, that folly and other evils will all cease, and compassion, joy, and equanimity will obtain a share of the Buddha's teaching.",
        "source": "T85n2897_001:1422c23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，無礙菩薩！",
        "translation": "\"Furthermore, the unhindered bodhisattva!",
        "source": "T85n2897_001:1422c27_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若善男子、善女人等興有為法，先讀此經三遍，築牆動土、安立家宅，南堂北堂、東廂西廂、厨舍密屋、門戶井竈、碓磑庫藏、六畜欄圂，日遊月殺、大將軍太歲、黃幡豹尾、五土地神、青龍白虎朱雀玄武、六甲禁諱、十二諸神、土府伏龍、一切鬼魅皆悉隱藏遠屏四方，影銷影滅不敢為害，甚大吉利得德無量。",
        "translation": "If good sons and good women who are motivated to do things for themselves first read this sūtra three times, they'll build walls and move earth, set up homes and families, build south halls, north halls, east rooms and west rooms, kitchen halls and halls of secrecy, doorways, wells and grills, pestles and storages, pens and ditches for six animals, kill the sun and moon, make great generals and taizas, yellow banners and leopards, five earth deities, blue dragons, white tigers, vermilion finches and xuanwu, six armor and taboo deities, 12 deities, the earth office and dragons, and all demons and ghosts will hide and distance themselves from the four directions, vanishing their shadows and ghosts and not daring to harm them, which is very auspicious and obtains immeasurable virtue.",
        "source": "T85n2897_001:1422c27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "興功之後，堂舍永安屋宅牢固，富貴吉昌不求自得。",
        "translation": "After they achieve success, their halls and homes will be permanently secure, and their fortunes and prosperity will be self-fulfilled.",
        "source": "T85n2897_001:1423a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若遠行從軍，仕官興生甚得宜利，門興人貴百子千孫，父慈子孝男忠女貞，兄恭弟順夫妻和睦，信義篤親所願成就。",
        "translation": "If they travel far and join the army, their officers will prosper, their family will prosper, their people will have hundreds of sons and thousands of grandchildren, their fathers will be kind and filial, their sons will be faithful and chaste, their brothers will be obedient, their husbands will be harmonious, and their faith, righteousness, and good kin will have their wishes fulfilled.",
        "source": "T85n2897_001:1423a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生忽被縣官拘執、盜賊牽挽，暫讀此經三遍即得解脫。",
        "translation": "If there are sentient beings who are suddenly taken into custody by a magistrate or led by a thief, read this sūtra three times and they'll be liberated.",
        "source": "T85n2897_001:1423a09_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有善男子、善女人受持讀誦、為他書寫八陽經者，設入水火不被焚漂，或在山澤，虎狼猛獸屏跡不敢，善神衛護成無上道。",
        "translation": "If a good man or woman accepts, recites, and writes the Sutra of the Eight Suns for others, they won't be burned or floated in a fire or in a mountain swamp, where tigers, wolves, and fierce animals won't dare to hold their traces, and good spirits will guard them as they achieve the unsurpassed path.",
        "source": "T85n2897_001:1423a11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若復有人多於妄語、綺語、惡口、兩舌，若能受持讀誦此經，永除四惡過得四無礙辯而成佛道。",
        "translation": "\"Suppose another person who often speaks falsehood, fancy speech, harsh words, and duplicity were to accept and recite this sūtra, that person would permanently remove the four bad errors and attain the four unhindered abilities to achieve the Buddha Way.",
        "source": "T85n2897_001:1423a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「若善男子、善女人等父母有罪，臨終之日當墮地獄受無量苦，其子即為讀此經七遍，父母即離地獄而生天上，見佛聞法悟無生忍以成佛道。」",
        "translation": "\"If good sons and good women whose parents are guilty and will fall into hell and undergo measureless suffering on the day they die, their sons will read this sūtra seven times for them, and their parents will leave hell and be born up in heaven, where they'll see the Buddha and hear the Dharma and realize the patient acceptance of nonarising and thus become buddhas.\"",
        "source": "T85n2897_001:1423a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告無礙菩薩：「毘婆尸佛時，有優婆塞、優婆夷心不信邪敬崇佛法，書寫此經受持讀誦，所作所為須作即作一無所問，以正信故，兼行布施、平等供養，得無漏身成菩提道，號曰普光，如來、應、正等覺，劫名大漏，國名無邊。",
        "translation": "The Buddha told the unhindered bodhisattva, \"When Vipaśyin Buddha was born, there were laymen and laywomen who didn't believe in evil and respected the Buddha's teachings, wrote this sūtra, memorized, read, and recited it, did whatever was necessary, and did nothing without question.",
        "source": "T85n2897_001:1423a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但是人民行菩薩道，無所得法，以是經威德獲如是報。",
        "translation": "But these people practice the bodhisattva path without acquiring the Dharma, and they obtain this reward because of the sūtra's authoritative power.",
        "source": "T85n2897_001:1423a27_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，無礙菩薩！",
        "translation": "\"Furthermore, the unhindered bodhisattva!",
        "source": "T85n2897_001:1423a29_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此八陽經行在閻浮提，在在處處有八菩薩、諸梵天王、一切明靈圍繞此經，香華供養如佛無異。」",
        "translation": "This eight-period sūtra is performed in Jambudvīpa, and everywhere there are eight bodhisattvas, Brahmakāyika gods, and all the bright spirits surrounding this sūtra, scattering incense and flowers and making offerings just like the buddhas.\"",
        "source": "T85n2897_001:1423a29_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告無礙菩薩摩訶薩言：「若善男子、善女人等為諸眾生講說此經，深達實相得甚深理，即知身心佛身法心，所以能知即是智慧。",
        "translation": "The Buddha told the unhindered bodhisattva Mahāsattva, \"If good sons and good women explain this sūtra to sentient beings and deeply understand its true characteristics and attain its profound principle, they will know body and mind, the Buddha's body and Dharma mind, and so being able to know is wisdom.",
        "source": "T85n2897_001:1423b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼常見種種無盡色，色即是空，空即是色，受、想、行、識亦空，即是妙色身如來；耳常聞種種無盡聲，聲即是空，空即是聲，即是妙音聲如來；鼻常嗅種種無盡香，香即是空，空即是香，即是香積如來；舌常了種種無盡味，味即是空，空即是味，即是法喜如來；身常覺種種無盡觸，觸即是空，空即是觸，即是智明如來；意常思想，能分別種種無盡法，法即是空，空即是法，即是法明如來。",
        "translation": "眼常見種種無盡色，色即是空，空即是色，受、想、行、識亦空，即是妙色身如來；耳常聞種種無盡聲，聲即是空，空即是聲，即是妙音聲如來；鼻常嗅種種無盡香，香即是空，空即是香，即是香積如來；舌常了種種無盡味，味即是空，空即是味，即是法喜如來；身常覺種種無盡觸，觸即是空，空即是觸，即是智明如來；意常思想，能分別種種無盡法，法即是空，空即是法，即是法明如來。",
        "source": "T85n2897_001:1423b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「善男子！",
        "translation": "\"Good sons!",
        "source": "T85n2897_001:1423b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀此六根顯現，人皆空口常說之。",
        "translation": "\"When they contemplate the manifestation of these six faculties, people always speak about them with their mouths empty.",
        "source": "T85n2897_001:1423b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說善語，善法常轉，即成聖道；若說邪語，惡法常轉，即墮地獄。",
        "translation": "If someone speaks good words, the good qualities will always turn, and they'll achieve the noble path; if they speak wrong words, the bad qualities will always turn, and they'll fall into hell.",
        "source": "T85n2897_001:1423b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡之理，不得不信。",
        "translation": "You can't help but believe in good and bad principles.",
        "source": "T85n2897_001:1423b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人之身心是佛法器，亦是十二部大經卷也，無始已來轉讀不盡不損毫毛。",
        "translation": "A person's body and mind are the Buddha's Dharma vessel and the twelve great sūtra scrolls, which have been read continuously since beginningless time without losing a single hair.",
        "source": "T85n2897_001:1423b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來藏經、唯識心，見性者之所能知，非諸聲聞凡夫所能知。",
        "translation": "The scripture of the Tathāgatagarbha and the mind of consciousness-only are knowable by those who see their true nature, not by śrāvakas and worldlings.",
        "source": "T85n2897_001:1423b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讀誦此經，深解真理，即知身心是佛法器。",
        "translation": "When you recite this sūtra and deeply understand the truth, you'll know that your body and mind are the Buddha's Dharma vessel.",
        "source": "T85n2897_001:1423b21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若醉迷不醒，不了自心是佛法根本，流轉諸趣墮於惡道永沈苦海，不聞佛法名字。」",
        "translation": "If they are drunk and don't awaken, not realizing that their own mind is the root of the Buddha's teaching, they'll be led into various destinies, fall into a bad path, sink forever into the ocean of suffering, and not hear the name of the Buddha's teaching.\"",
        "source": "T85n2897_001:1423b22_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，五百天子在大眾中聞佛所說，得法眼淨，皆大歡喜，即發無等等阿耨多羅三藐三菩提心。",
        "translation": "At the time, the five hundred celestials in the crowd who heard what the Buddha taught attained purification of the Dharma eye, and they were all greatly elated and immediately aroused the unsurpassed, correct, and complete mind of enlightenment.",
        "source": "T85n2897_001:1423b25_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無礙菩薩復白佛言：「世尊！",
        "translation": "Again, the Unhindered Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T85n2897_001:1423b28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人之在世生死為重，生不擇日，時至即生；死不擇日，時至即死。",
        "translation": "When a person lives in the world, birth and death are important; if he doesn't choose a day, then he'll be born; if he doesn't choose a day for his death, then he'll die.",
        "source": "T85n2897_001:1423b28_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因殯葬即問良辰吉日然始殯葬？",
        "translation": "Why does a funeral mean asking about a good day and an auspicious day and then starting the funeral?",
        "source": "T85n2897_001:1423c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殯葬之後還有妨害，貧窮者多，滅門者不少。",
        "translation": "After the funeral, there are still hindrances, many poor people, and many people who go into extinction.",
        "source": "T85n2897_001:1423c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊為諸邪見無智眾生說其因緣，令得正道除其顛倒。」",
        "translation": "Please let the Bhagavān explain the causes and conditions for these sentient beings with wrong views and no wisdom, so that they can attain the right path and be freed from their mistakenness.\"",
        "source": "T85n2897_001:1423c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T85n2897_001:1423c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝實甚能問於眾生生死之事、殯葬之法。",
        "translation": "\"You really are quite capable of asking about the matters of birth and death of sentient beings and the rules for funerals.",
        "source": "T85n2897_001:1423c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "All of you, listen closely!",
        "source": "T85n2897_001:1423c06_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾當為汝說智慧之理、大道之法。",
        "translation": "I will explain for you the principle of wisdom and the teaching of the great way.",
        "source": "T85n2897_001:1423c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫天地廣大清，日月廣長明，時年善美實無有異。",
        "translation": "As the heavens and earth become vast and clear, the sun and moon become vast and luminous, and there's really no difference between good and beautiful seasons.",
        "source": "T85n2897_001:1423c07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423c08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人王菩薩甚大慈悲，愍念眾生皆如赤子，下為人主作蓬民父母，順於俗人教於俗法，造作曆日頒下天下，令知時節為有平、滿、成、收、開、閉、建、除、定、執、破、危之文，愚人依字信用無不免其凶禍。",
        "translation": "With great compassion, the King of Men Bodhisattva, pitying for sentient beings like red sons, descended to become the lord of men and the parents of the Peng people, complied with laypeople and taught them the secular Dharma, created a calendar and handed it down to the world so that it would know the seasons and seasons as the texts for peace, completion, accomplishment, harvest, opening, shutting, building, removing, fixing, attaching, refuting, and endangering, so that foolish people who rely on the words and trust them won't be spared any misfortune.",
        "source": "T85n2897_001:1423c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又使邪師厭鎮說是道非，謾求邪神拜餓鬼，却福招殃自受苦。",
        "translation": "They also make mistaken teachers disillusioned with the town say what's right and wrong on the road, and they lobby mistaken spirits and worship hungry ghosts, only to bring misfortune and suffering on their own.",
        "source": "T85n2897_001:1423c13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如斯人皆返天時逆地理，背日月之光明沒闇室，違正道之廣路，恒尋邪徑顛倒之甚也。",
        "translation": "Such people go back to the heavens, oppose geography, turn away from the light of the sun and moon, go into a dark room, disobey the broad path of the right way, and constantly pursue wrong paths, which is very mistaken.",
        "source": "T85n2897_001:1423c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423c16_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "產生時讀此經三遍，兒即易生，甚大吉利聰明智慧，福德具足而不中夭；死時讀此經三遍，一無妨害得福無量。",
        "translation": "When you read this sūtra three times at birth, your child will be easily born, have great fortune and wisdom, and be fully endowed with fortune without dying young; read this sūtra three times at death, and you'll attain measureless fortune without harm.",
        "source": "T85n2897_001:1423c17_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423c19_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日日大好日，月月大好月，年年大好年，實無間隔，但辨即須殯葬。",
        "translation": "Every day is a great day, every month is a great month, and every year is a great year; there's really no gap, but it's necessary to identify the day of the funeral.",
        "source": "T85n2897_001:1423c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殯葬之日讀此經七遍，甚大吉利獲福無量，門榮人貴延年益壽，命終之日並得成聖道。",
        "translation": "Reading this sūtra seven times on the day of the funeral will be very auspicious and obtain immeasurable fortune, prolong life and prosperity for your family, and lead to the noble path on the day your life ends.",
        "source": "T85n2897_001:1423c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1423c23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殯葬之地莫問東西南北，安穩之處，諸人愛樂，鬼神愛樂。",
        "translation": "Don't ask about the east or west, north or south, or about a stable place where people like to be buried and spirits like to be buried.",
        "source": "T85n2897_001:1423c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即讀此經三遍便以修榮，安置墓內永無災障，家富人興甚大吉利。」",
        "translation": "That's how you can read this sūtra three times and then cultivate its prosperity, placing it inside the grave without calamity and making your family rich and prosperous.\"",
        "source": "T85n2897_001:1423c25_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，世尊欲重宣此義而說偈言：「營生善善日，　　休殯好好時，　生死讀誦經，　　甚得大利益。",
        "translation": "At the time, the Bhagavān wanted to reiterate this teaching and spoke the verse, \"During the good and bright days of rebirth and the good times of funeral, reciting the sūtra during birth and death will be quite beneficial.",
        "source": "T85n2897_001:1423c26_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　月月善明月，　　年年大好年，　讀經即殯葬，　　榮花萬代昌。」",
        "translation": "Every month is a good, bright month, and every year is a good year; when the sūtras are read and the funeral takes place, their flowers will flourish for generations to come.\"",
        "source": "T85n2897_001:1424a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，眾中七萬七千人聞佛所說，心開意解捨邪歸正，得佛法分永斷疑惑，皆發阿耨多羅三藐三菩提心。",
        "translation": "At the time, 77,000 people in the congregation who heard what the Buddha taught were enlightened in their minds and hearts, abandoned the wrong and returned to the right, attained the Buddha's portion of the Dharma, permanently ended their doubts, and all arouse the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T85n2897_001:1424a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無礙菩薩復白佛言：「世尊！",
        "translation": "Again, the Unhindered Bodhisattva said to the Buddha, \"Bhagavān!",
        "source": "T85n2897_001:1424a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫皆以婚媾為親，先問相宜後取吉日然始成親。",
        "translation": "All ordinary people take marriage and coitus as intimacy, first asking about compatibility and then choosing an auspicious day before they become intimate.",
        "source": "T85n2897_001:1424a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成親之後，富貴偕老者少，貧窮生離死別者多。",
        "translation": "After they become intimate, few become rich and prosperous and grow old together, and many become poor and are separated by birth and death.",
        "source": "T85n2897_001:1424a07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一種信邪如何而有差別？",
        "translation": "How does a single kind of faith and error make a difference?",
        "source": "T85n2897_001:1424a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊為決眾疑。」",
        "translation": "Please let the Bhagavān help resolve the many doubts.\"",
        "source": "T85n2897_001:1424a09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, \"Good sons!",
        "source": "T85n2897_001:1424a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "All of you, listen closely!",
        "source": "T85n2897_001:1424a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T85n2897_001:1424a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫天陽地陰，月陰日陽，水陰火陽，女陰男陽。",
        "translation": "\"The gods are yang and the earth are yin, the moon is yin and the sun is yang, water is yin and fire is yang, and women are yin and men are yang.",
        "source": "T85n2897_001:1424a11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天地氣合，一切草木生焉；日月交通，四時八節明焉；水火相承，一切萬物熟焉；男女允諧，子孫興焉。",
        "translation": "When the energy of heaven and earth combine, all plants and trees grow; when the sun and moon flow together, the four seasons and eight periods become clear; when water and fire are in harmony, all things ripen; and when men and women are in harmony, children and grandchildren flourish.",
        "source": "T85n2897_001:1424a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆是天之常道、自然之理、世諦之法。",
        "translation": "These are all the eternal principles of heaven, the principles of nature, and the teachings of the conventional truth.",
        "source": "T85n2897_001:1424a15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1424a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愚人無智，信其邪師卜問望吉，而不修善、造種種惡業，命終之後復得人身者如指甲上土，墮於地獄、作畜餓鬼者如大地土。",
        "translation": "A foolish man without wisdom who trusts a mistaken teacher to divine and look for good fortune and doesn't cultivate goodness and create various bad actions will end up like dirt on his fingernails when he's reborn as a human being or like dirt on the ground when he falls into hell or becomes an animal or hungry ghost.",
        "source": "T85n2897_001:1424a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1424a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復得人身正信修善者如指甲上土，信邪造惡業者如大地土。",
        "translation": "\"Again, the person who attains right faith and cultivates goodness is like the dirt on their fingernails, and the person who believes wrongly and creates bad actions is like the dirt on the ground.",
        "source": "T85n2897_001:1424a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1424a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲結婚親莫問水火相剋、胎胞相厭、年紀不同，唯看祿命書，知福德多少以為眷屬。",
        "translation": "If you want to get married, don't ask about mutuality of water and fire, disgust with the womb, or differences in age; just read the book of fortune and life to find out how much fortune there is for your dependents.",
        "source": "T85n2897_001:1424a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "呼迎之日即讀此經三遍而以成禮，此乃善善相因、明明相屬，門高人貴子孫興盛，聰明利智孝敬相承，甚大吉利而無中夭，福德具足皆成佛道。」",
        "translation": "On the day of the invocation, read this sūtra three times and make obeisance to it; this will be the cause of good and honorable deeds, and it will clearly define their dependents; their gates will be noble, their descendants will prosper, their intelligence and wisdom will be honored, their filial piety will be sustained, they will have great fortune and no death in the interim, and their fortune will be complete, and they will all attain the Buddha Way.\"",
        "source": "T85n2897_001:1424a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時有八菩薩，承佛威神得大總持，常處人間和光同塵，破邪立正。",
        "translation": "At the time, there were eight bodhisattvas who inherited the Buddha's authoritative power and attained great supernormal power, always abiding among human beings in harmony with the light and dust, refuting the wrong and establishing the right.",
        "source": "T85n2897_001:1424a26_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰：　跋陀羅菩薩漏盡和、　　羅隣竭菩薩漏盡和、　憍曰兜菩薩漏盡和、　　那羅達菩薩漏盡和、　須彌深菩薩漏盡和、　　因桓達菩薩漏盡和、　和輪調菩薩漏盡和、　　無緣觀菩薩漏盡和。",
        "translation": "Their names were Bhadrapāla, Lorengdha, Kauṇḍinya, Nārada, Sumeru, Indwandha, Wheel-taming, and Wandering.",
        "source": "T85n2897_001:1424a28_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是八菩薩俱白佛言：「世尊！",
        "translation": "Those eight bodhisattvas all said to the Buddha, \"Bhagavān!",
        "source": "T85n2897_001:1424b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等於諸佛所，受持得陀羅尼神呪而今說之，擁護受持讀誦八陽經者永無恐怖，使一切不善之物不得侵損讀經法師。」",
        "translation": "We have received a supernatural dhāraṇī spell from the buddhas and are now reciting it to protect those who memorize and recite the Sutra of the Eight Suns from fear and to prevent all unwholesome things from harming those who recite the sūtras.\"",
        "source": "T85n2897_001:1424b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即於佛前而說呪曰：「阿佉尼(一)　尼佉尼(二)　阿毘羅(三)　曼隸(四)　曼多隸(五)　娑婆訶。」",
        "translation": "He then spoke the mantra before the Buddha, saying, \"Ākani(i) Niṣkani(ii) Abhira(iii) Manlī(iv) Mandālī(v) Sāvāhā.\"",
        "source": "T85n2897_001:1424b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「世尊！",
        "translation": "\"Bhagavān!",
        "source": "T85n2897_001:1424b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有不善者欲來惱法師，聞我說此呪，頭破作七分如阿梨樹枝。」",
        "translation": "If an unwholesome person wants to come and trouble the teacher of the Dharma and hears me recite this dhāraṇī, his head will be split seven ways like a branch of the āli tree.\"",
        "source": "T85n2897_001:1424b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，無邊身菩薩即從座起前白佛言：「世尊！",
        "translation": "At that point, the infinite-bodied bodhisattva rose from his seat and went to the Buddha, saying, \"Bhagavān!",
        "source": "T85n2897_001:1424b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為八陽經？",
        "translation": "What are the eight yang sūtras called?",
        "source": "T85n2897_001:1424b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊為諸聽眾解說其義，令得覺悟速達本心，入佛知見永斷疑悔。」",
        "translation": "May the Bhagavān explain its meaning for all those who hear it, so that they may attain enlightenment and quickly reach their original mind and enter into the Buddha's knowledge and views to permanently end doubt and remorse.\"",
        "source": "T85n2897_001:1424b15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, \"Good, good!",
        "source": "T85n2897_001:1424b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1424b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "All of you, listen closely!",
        "source": "T85n2897_001:1424b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今為汝解說。",
        "translation": "\"Now, I'll explain it for you.",
        "source": "T85n2897_001:1424b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八陽之經者，八者分別也，陽者明解也，明解大乘空無之理，了能分別八識因緣空無所得。",
        "translation": "\"The sutra of the eight yang [consciousnesses] refers to the discrimination of the eight and the understanding of the yang, which is the understanding of the great vehicle principle of emptiness and nothingness and the ability to discern the emptiness and ungraspability of the causes and conditions of the eight consciousnesses.",
        "source": "T85n2897_001:1424b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何八識名為經，八陽名為緯？",
        "translation": "Why are the eight consciousnesses called sūtras and the eight yang [consciousnesses] called wefts?",
        "source": "T85n2897_001:1424b21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經緯相交以成經教，故名八陽經。",
        "translation": "The intersection of scripture and latitude creates a sūtra teaching, so it's called the Sutra of the Eight Yang [consciousnesses].",
        "source": "T85n2897_001:1424b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八者八識，云何名八識？",
        "translation": "What are the eight consciousnesses and what do they call the eight consciousnesses?",
        "source": "T85n2897_001:1424b23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼是色識，耳是聲識，鼻是香識，舌者是味識，身是觸識，意是分別識。",
        "translation": "The eye is the form consciousness, the ear is the sound consciousness, the nose is the fragrance consciousness, the tongue is the taste consciousness, the body is the contact consciousness, and the mind is the discrimination consciousness.",
        "source": "T85n2897_001:1424b23_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六根是六識，含藏識、阿賴耶識，是名曰八識。",
        "translation": "The six faculties are the six consciousnesses, which contain the store consciousness and the store consciousness, and are called the eight consciousnesses.",
        "source": "T85n2897_001:1424b25_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明了分別八識根源空無所得，即知兩眼是光明天，光明天中即現日月光明世尊；兩耳是聲聞天，聲聞天中即現無量聲如來；兩鼻是佛香天，佛香天中即現香積如來；口是法味天，法味天中即現法喜如來；身是盧舍那天，盧舍那天中即現成就盧舍那佛、盧舍那鏡像佛、盧舍那光明佛；意是無分別天，無分別天中即現不動如來、大光明佛；心是法界天，法界天中即現空王如來。",
        "translation": "明了分別八識根源空無所得，即知兩眼是光明天，光明天中即現日月光明世尊；兩耳是聲聞天，聲聞天中即現無量聲如來；兩鼻是佛香天，佛香天中即現香積如來；口是法味天，法味天中即現法喜如來；身是盧舍那天，盧舍那天中即現成就盧舍那佛、盧舍那鏡像佛、盧舍那光明佛；意是無分別天，無分別天中即現不動如來、大光明佛；心是法界天，法界天中即現空王如來。",
        "source": "T85n2897_001:1424b26_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "含藏識天，演出《阿含經》、《大般涅槃經》；阿賴耶識天，演出《大智度論》經、《瑜伽論》經。",
        "translation": "In the Containing Consciousness Heaven, the Āgama Sutra and the Mahāparinirvāṇa Sutra are performed, and in the ālayavijñāna Heaven, the Mahāprajñāpāramitā Sūtra and the Yogâcārabhūmi Sūtra are performed.",
        "source": "T85n2897_001:1424c06_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1424c08_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即是法，法即是佛，合為一相，即現大通智勝如來。」",
        "translation": "The Buddha is the Dharma and the Dharma is the Buddha, and when combined into a single aspect, it reveals the Tathāgata of great supernormal cognition.\"",
        "source": "T85n2897_001:1424c08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經時，一切大地六種震動，光照天地無有邊際，浩浩蕩蕩而無所名，一切幽冥悉皆明朗，一切地獄竝皆消滅，一切罪人俱得離苦，皆發無上菩提心。",
        "translation": "When the Buddha spoke this sūtra, the whole earth shook in six ways, the light shone without limit on heaven and earth, it was vast and without name, all darkness and obscurity were made clear, all hells ceased, all sinners were freed from suffering, and all arouse the unsurpassed mind of enlightenment.",
        "source": "T85n2897_001:1424c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時，大眾之中八萬八千菩薩一時成佛，號曰空王如來、應、正等覺，劫名離苦，國號無邊。",
        "translation": "At that point, 88,000 bodhisattvas in the mass suddenly became buddhas, and they were called Tathāgatas, Arhats, and Perfectly Enlightened Ones, the names of the eons were Free From Suffering, and the names of the countries were limitless.",
        "source": "T85n2897_001:1424c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切人民皆行菩薩六波羅蜜，逮無所得法。",
        "translation": "All the people practiced the six perfections of a bodhisattva and acquired the unobtainable Dharma.",
        "source": "T85n2897_001:1425a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六萬六千比丘、比丘尼、優婆塞、優婆夷，得大總持入不二法門。",
        "translation": "Sixty-six thousand monks, nuns, laymen, and barbarians attain the great dhāraṇī and enter the gate of the principle of nonduality.",
        "source": "T85n2897_001:1425a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無數天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人、非人等，得法眼淨行菩薩道。",
        "translation": "Countless gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and nonhumans attain purification of the Dharma eye and practice the bodhisattva path.",
        "source": "T85n2897_001:1425a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "\"Furthermore, good sons!",
        "source": "T85n2897_001:1425a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人得官登位日，及入新宅之時，暫讀此經三遍，甚大吉利善神加護，延年益壽福德具足。",
        "translation": "If someone were to read this sūtra three times on the day they attain office or ascend to the top of the hierarchy or when they enter their new home, it would be extremely auspicious and protected by a good deity, prolonging their life and producing an abundance of fortune.",
        "source": "T85n2897_001:1425a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T85n2897_001:1425a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若讀此經一遍，如讀一切經一部；若書寫一卷，如書寫一切經一部。",
        "translation": "If he reads this sūtra once, it's like reading one of all the sūtras, and if he writes one scroll, it's like writing one of all the sūtras.",
        "source": "T85n2897_001:1425a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其功德不可稱、不可量，等空無有邊際，如斯人等即成就聖道。",
        "translation": "Their merit is indescribable, immeasurable, and equally empty without limit, and such a person will achieve the noble path.",
        "source": "T85n2897_001:1425a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "「復次，無邊身菩薩摩訶薩！",
        "translation": "\"Furthermore, infinitely-bodied bodhisattva-mahāsattva!",
        "source": "T85n2897_001:1425a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生不信正法、常生邪見，忽聞此經即生誹謗，言非佛說，是人現世得白癩病，惡瘡膿血遍體交流，腥臊臭穢人皆憎嫉，命終之日即墮阿鼻無間地獄，上火徹下下火徹上，鐵槍鐵叉遍體穿穴，融銅灌口筋骨爛壞，一日一夜萬死萬生，受大苦痛無有休息。",
        "translation": "If a sentient being doesn't believe the right teaching and always has wrong views and suddenly hears this sūtra and denigrates it, saying that it's not what the Buddha taught, that person's present life will be marked by leprosy, foul sores and pus and blood everywhere, a foul, smelly odor that people hate, and on the day they die they'll fall into the avīci hell, where fire will pierce the upper and lower parts and fire will pierce the upper part, iron spears and forks will pierce their bodies, molten copper will pour into their mouths, their tendons and bones will rot, and they'll die and be born thousands of times a day and night, suffering great pain with no rest.",
        "source": "T85n2897_001:1425a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謗斯經故獲罪如是。」",
        "translation": "This is the kind of punishment you get for denigrating these sūtras.\"",
        "source": "T85n2897_001:1425a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛為罪人而說偈言：「身是自然身，　　五體自然足，　長乃自然長，　　老乃自然老，　生乃自然生，　　死乃自然死，　求長不得長，　　求短不得短，　苦樂汝自當，　　邪正由汝己。",
        "translation": "The Buddha spoke a verse for the offender, saying, \"The body is a natural body, the five bodies are naturally sufficient, growth occurs naturally, old age occurs naturally, birth occurs naturally, death occurs naturally, seeking longevity doesn't lead to growth, seeking shortness doesn't lead to shortness, suffering and pleasure are yours, and right and wrong are yours.",
        "source": "T85n2897_001:1425a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　欲作有為功，　　讀經莫問師，　千千萬萬世，　　得道轉法輪。」",
        "translation": "If you want to achieve productive work, read the sūtras and don't ask your teacher; in a thousand million generations, you'll attain the path and turn the wheel of the Dharma.\"",
        "source": "T85n2897_001:1425a26_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已，一切大眾得未曾有，心明意淨歡喜踊躍，皆見諸相非相，入佛知見、悟佛知見，無入無悟、無知無見，不得一法即涅槃樂故。",
        "translation": "After the Buddha spoke this sūtra, all the people attained unprecedented mental clarity and rejoiced, seeing both marks and non-marks, entering into Buddha-knowledge and Buddha-wisdom, and realizing neither entry nor realization, knowing neither and seeing neither, so that they wouldn't attain the happiness of a single dharma that is nirvāṇa.",
        "source": "T85n2897_001:1425a28_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩聖眾、天神地祇皆悉歡喜奉行。",
        "translation": "These bodhisattvas, sages, gods, and goddesses all rejoice and hand down the Dhāraṇī.",
        "source": "T85n2897_001:1425b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說天地八陽神呪經終",
        "translation": "End of the Sutra on the Eight Yang Spells of Heaven and Earth",
        "source": "T85n2897_001:1425b03_0",
        "is_bad_quality": false
    }
]