[
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第十八",
        "translation": "Dafangguang fo xin Huayan jing haplodiscipline vol. 18",
        "source": "X04n0223_018:0123a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐于闐國三藏沙門實叉難陀譯經",
        "translation": "Translation of the Sutra of Śikṣānanda, the Tripiṭaka Master of Yutan, Tang Dynasty",
        "source": "X04n0223_018:0123a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐太原方山長者李通玄造論",
        "translation": "Li Tongxuan's Exposition of the Master of Fangshan in Taiyuan, Tang",
        "source": "X04n0223_018:0123a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐福州開元寺沙門志寧釐經合論",
        "translation": "Tang Fuzhou Kaiyuansi shaman Zhining librating the combined treatises of the scriptures",
        "source": "X04n0223_018:0123a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來現相品第二",
        "translation": "The Second Chapter of the Tathāgata's Appearance",
        "source": "X04n0223_018:0123a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【論】釋此一品義分為三一釋品名目二釋品來意三隨文釋義一釋品名目者此品何故名現相品為諸菩薩神天眾皆悉已集嘿思心念請法問有三十七問如來知念即於面門舒光現相及集十方眾答前所問此品之內如來兩度放光齒光告眾令集毫光示法令信佛境界及所行因果行門又諸來菩薩毛孔放光通為三度放光故又集十方眾海佛境界相菩薩境界相答前眾所問故名現相品此經表法及集眾如來放光前後總十度放光故一面門齒光集他方之眾二眉間毫光示果成因三足下輪中放光成十信四帝釋宮中足指端放光集眾入道成十住位五夜摩天宮足趺上放光成十行門六兜率天宮膝上放光成十迴向七他化天宮眉間毫相放光成十地八如來出現品眉間放光入文殊頂九口中放光入普賢口令此二人問答如來出現始終因果道理十法界品中放眉間光名普照三世法界門是為十如隨好光明功德品常放光明隨根普照此光非獨緣五位進修表法也是常依根攝化光也二釋品來意者此品為前世間主等默念三十七問此品放光集眾示其法相答前眾所問三十七法此品故來三隨文釋義者復分為二一長科經意二科其當品一長科經意者自此現相品乃至普賢三昧品世界成就品華藏世界品毗盧遮那品此五品經總是答前三十七問明舉果勸修分二科其當品者於此當品其意有四。",
        "translation": "[Commentary] The explanation of the meaning of this section is divided into three parts: 1) the title of the section; 2) the meaning of the section; 3) the meaning of the accompanying text. 1) The title of the section: Why is this section called the chapter on presenting appearances? It's because all the bodhisattvas, gods, and goddesses have gathered their minds, thoughts, and requests for teaching. 37 questions were asked, \"Does the Tathāgata know and remember that he's shining his face in front of the gate, showing his form, and gathering the multitude in ten directions?\" In response to the previous question, the Tathāgata emits light twice in this section, emits light from his teeth, and tells the multitude to gather a ray of light that shows faith in the Buddha's realm and the causal practices he's practicing. 2) The Tathāgata emits light from his pores, emits light in three degrees, and gathers the multitude in ten directions.",
        "source": "X04n0223_018:0123a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】爾時諸菩薩及一切世間主作是思惟云何是諸佛地云何是諸佛境界云何是諸佛加持云何是諸佛所行云何是諸佛力云何是諸佛無所畏云何是諸佛三昧云何是諸佛無能攝取云何是諸佛眼云何是諸佛耳云何是諸佛鼻云何是諸佛舌云何是諸佛身云何是諸佛意云何是諸佛身光云何是諸佛光明云何是諸佛聲云何是諸佛智唯願世尊哀愍我等開示演說又十方世界海一切諸佛皆為諸菩薩說世界海眾生海佛海佛波羅蜜海佛解脫海佛變化海佛演說海佛名號海佛壽量海及一切菩薩誓願海一切菩薩發趣海一切菩薩助道海一切菩薩乘海一切菩薩行海一切菩薩出離海一切菩薩神通海一切菩薩波羅蜜海一切菩薩地海一切菩薩智海願佛世尊亦為我等如是而說爾時諸菩薩威神力故於一切供養具雲中自然出音而說頌言。",
        "translation": "[Sutra] At the time, the bodhisattvas and all worldly lords were thinking, \"What is the buddha-stage, what is the buddha-realm, what is the buddha-support, what is the buddha-activities, what is the buddha-power, what is the buddha-fearlessness, what is the buddha-samādhi, what is the buddha-incapacity, what is the buddha-eye, what is the buddha-ear, what is the buddha-nose, what is the buddha-tongue, what is the buddha-body, what is the buddha-thoughts, what is the buddha-body-light, what is the buddha-brightness, what is the buddha-sound, and what is the buddha-wisdom.",
        "source": "X04n0223_018:0123b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量劫中修行滿　　菩提樹下成正覺　為度眾生普現身　　如雲充徧盡未來　眾生有疑皆使斷　　廣大信解悉令發　無邊際苦普使除　　諸佛安樂咸令證　菩薩無數等剎塵　　俱來此會同瞻仰　願隨其意所應受　　演說妙法除疑惑　云何了知諸佛地　　云何觀察如來境　佛所加持無有邊　　願示此法令清淨　云何是佛所行處　　而以智慧能明入　佛力清淨廣無邊　　為諸菩薩應開示　云何廣大諸三昧　　云何淨治無畏法　神通力用不可量　　願隨眾生心樂說　諸佛法王如世主　　所行自在無能制　及餘一切廣大法　　為利益故當開演　佛眼云何無有量　　耳鼻舌身亦復然　意無有量復云何　　願示能知此方便　如諸剎海眾生海　　法界所有安立海　及諸佛海亦無邊　　願為佛子咸開暢　永出思議眾度海　　普入解脫方便海　所有一切法門海　　此道場中願宣說【論】第一從爾時諸菩薩及一切世間主已下一段長行并偈頌是世主請法分義分為三一從爾時已下至唯願世尊哀愍我等於中長行有八行半經純請十八種佛法二又十方世界海已下有六行半經問佛海菩薩海有十九問通為三十七問三願佛世尊已下可兩行經明菩薩神力故一切供具放光光中說頌請佛斷疑分第一從初爾時諸菩薩及一切世間主作是思惟明心念嘿請云何是諸佛地法界不思議地是佛地故下文云法性如虗空諸佛於中住此為如來地也云何是諸佛境界如下經云如來處此菩提座一毛示現多剎海一一毛現悉亦然此是如來之境界又法界是如來境界云何是諸佛加持下如來加普賢菩薩入於三昧說佛持故云何是諸佛所行經云無礙行是如來行又普賢行是一切諸佛共所行行故云何是諸佛力經云如來有處非處十種力是云何是諸佛無所畏如來無五怖畏及四無畏是云何是諸佛無能攝取如來無性妙智是無能攝取云何是諸佛眼知一切法智知一切眾生根智名一切種智是佛眼故又此經下文說十眼等是又如十身相海云如來眼有大人相名自在普見雲云何是諸佛耳如法界品云一切諸佛有無障礙耳悉能解了一切音聲云何是諸佛鼻如來鼻有大人相名一切神通智慧於中出現無量化佛坐寶蓮華往諸世界云何是諸佛舌如下經云如來舌有大人相名示現音聲影像雲云何是諸佛身下文云諸佛同法身無依無差別又佛身充滿於法界普現一切眾生前云何是諸佛意如來出現品云云何知如來應正等覺心佛子如來心意識無量俱不可得但智無量故知如來心云何是諸佛身光如來隨好常光隨根照物普周法界云何是諸佛光明光有二種一教光二如此經光明覺品是及前後十度表法光明是云何是諸佛智一切智一切種種分別智是又如下文如來甚深智普入於法界能隨三世轉與世為明導此已上問十八種法竟第二經云唯願世尊哀愍我等有三句經文結請佛說十九種海經云一切諸佛皆為諸菩薩說世界海總舉問竟眾生海釋曰如世間眾生廣多如海故佛海經云如來安處菩提座一毛示現多剎海一一毛現悉亦然如是普周於法界佛波羅蜜海十波羅蜜徧一切菩薩行故佛解脫海如來法身是佛解脫又智慧解脫乃至五分法身戒定慧解脫解脫知見等是佛變化海如下文無體無住處亦無生可得無相亦無形所現皆如影又一切剎土微塵數常現身雲悉充滿又云於一佛身上化為無量身佛演說海下文一一毛孔中光網徧十方演佛妙音聲調彼難調者又一音徧諸根故然如來音聲不從心出不從身出佛名號海如下名號品是如來名號等一切眾生心也佛壽量海如下文佛身如影現生滅不可得是佛壽量海又下文壽量品是及一切菩薩誓願海淨行品等是又十迴向品中大願是一切菩薩發趣海如下文云此會諸佛子善修眾智慧其人已能入如斯方便門又下文云從地而得地住於力地中億劫勤修行所獲法如是明從地而得地者不離真法界自體清淨性地而行進修十住十行等法故云從地而得地又十行品是十發趣加行成就令菩提心智悲純熟故一切菩薩助道海三十七助道品是觀身受心法為首一切菩薩乘海乘如來乘不思議乘法界乘是乃至八萬四千乘等一切菩薩行海普賢行是如下經云如是分身智境界普賢行中能建立一切菩薩出離海如五位中加行方便是如下經云此會諸菩薩入佛難思地一一皆能見一切佛神力又下文云普賢諸行願修治已明潔能於一切剎普見佛神變身住一切處一切皆平等智能如是行入佛之境界一切菩薩神通海如下十方佛剎來集菩薩眾及毛孔出眾隨行利生等事是又下十通品亦是又下文一一佛剎中往詣悉無餘見佛神通力入佛所行處一切菩薩波羅蜜海如下經中十方來集大眾身諸毛孔各出十佛世界微塵數光一一光出十佛世界微塵數菩薩悉能徧入一切法界諸安立海教化眾生廣如經具說是波羅蜜海也此是與發心者作普賢樣一切菩薩地海如下經云從地而得地是也又十地品是答又如來地是菩薩地如下經云此會諸菩薩入佛難思地一切菩薩智海根本智是如來智於根本智起差別智教化眾生是菩薩智海乃至十無盡智是也唯願世尊已下三句總結勸請准例十方諸佛既說今佛世尊亦合同說又爾時已下四句明供具說頌已上三十七問向下至毗盧遮那品已來有三種答前所問一如下齒間放光集眾現相神通答二如下眉間毫光出眾現相及十菩薩偈頌答三普賢入定出定以言詮示佛業眾生業因果古今相襲答如世界成就品菩薩眾生染淨報業答前三十七問佛海菩薩行海不離其中又說華藏莊嚴世界海說佛報得所居之土答前三十七問佛境界海眾生海菩薩行海波羅蜜海總不離其中又說古往毗盧遮那品是引古印今令眾生信承襲不斷法不虗來若古無舊跡今從何得以是義故引古佛用印今時成信從此初會一會至毗盧遮那品六品經總明舉果勸修信他已成佛者果德悲智境界行普賢行及報得莊嚴身土分從佛名號品重問二十八問即是舉古佛果門令今世及未來發心者自信自心佛果與古佛果不異及菩薩十信十住十行十迴向十地十一地佛眼耳鼻舌身意不異故信自今修不異古法有此二十八種不異之法具如佛名號品所問二十八問之法今古不異令初發心者應如是依古證修使令道不謬故直至法界品總是其答所問之法故若依五位法上有一百一十重佛果菩薩行古今不異若通信位即一百二十重古今佛因果不異至位方明三從供具雲中出音說二十行頌於中義分為四初兩行頌歎佛行滿成佛行徧三世次兩行頌明勸佛為眾除疑得證次兩行頌明大眾已集勸請除疑次云何已下十四行頌明重頌前三十七問問曰大眾何不以言自問因何嘿念致疑何不自以言讚勸請云何供具雲出音請佛答曰明佛得法界心與一切眾生同心故以心不異故知彼心疑供具說頌者明一切法總法界體也法界不思議一切法不思議故明聖眾心境無二故凡夫迷法界自見心境有二故顛倒生也。",
        "translation": "　無量劫中修行滿　　菩提樹下成正覺　為度眾生普現身　　如雲充徧盡未來　眾生有疑皆使斷　　廣大信解悉令發　無邊際苦普使除　　諸佛安樂咸令證　菩薩無數等剎塵　　俱來此會同瞻仰　願隨其意所應受　　演說妙法除疑惑　云何了知諸佛地　　云何觀察如來境　佛所加持無有邊　　願示此法令清淨　云何是佛所行處　　而以智慧能明入　佛力清淨廣無邊　　為諸菩薩應開示　云何廣大諸三昧　　云何淨治無畏法　神通力用不可量　　願隨眾生心樂說　諸佛法王如世主　　所行自在無能制　及餘一切廣大法　　為利益故當開演　佛眼云何無有量　　耳鼻舌身亦復然　意無有量復云何　　願示能知此方便　如諸剎海眾生海　　法界所有安立海　及諸佛海亦無邊　　願為佛子咸開暢　永出思議眾度海　　普入解脫方便海　所有一切法門海　　此道場中願宣說【論】第一從爾時諸菩薩及一切世間主已下一段長行并偈頌是世主請法分義分為三一從爾時已下至唯願世尊哀愍我等於中長行有八行半經純請十八種佛法二又十方世界海已下有六行半經問佛海菩薩海有十九問通為三十七問三願佛世尊已下可兩行經明菩薩神力故一切供具放光光中說頌請佛斷疑分第一從初爾時諸菩薩及一切世間主作是思惟明心念嘿請云何是諸佛地法界不思議地是佛地故下文云法性如虗空諸佛於中住此為如來地也云何是諸佛境界如下經云如來處此菩提座一毛示現多剎海一一毛現悉亦然此是如來之境界又法界是如來境界云何是諸佛加持下如來加普賢菩薩入於三昧說佛持故云何是諸佛所行經云無礙行是如來行又普賢行是一切諸佛共所行行故云何是諸佛力經云如來有處非處十種力是云何是諸佛無所畏如來無五怖畏及四無畏是云何是諸佛無能攝取如來無性妙智是無能攝取云何是諸佛眼知一切法智知一切眾生根智名一切種智是佛眼故又此經下文說十眼等是又如十身相海云如來眼有大人相名自在普見雲云何是諸佛耳如法界品云一切諸佛有無障礙耳悉能解了一切音聲云何是諸佛鼻如來鼻有大人相名一切神通智慧於中出現無量化佛坐寶蓮華往諸世界云何是諸佛舌如下經云如來舌有大人相名示現音聲影像雲云何是諸佛身下文云諸佛同法身無依無差別又佛身充滿於法界普現一切眾生前云何是諸佛意如來出現品云云何知如來應正等覺心佛子如來心意識無量俱不可得但智無量故知如來心云何是諸佛身光如來隨好常光隨根照物普周法界云何是諸佛光明光有二種一教光二如此經光明覺品是及前後十度表法光明是云何是諸佛智一切智一切種種分別智是又如下文如來甚深智普入於法界能隨三世轉與世為明導此已上問十八種法竟第二經云唯願世尊哀愍我等有三句經文結請佛說十九種海經云一切諸佛皆為諸菩薩說世界海總舉問竟眾生海釋曰如世間眾生廣多如海故佛海經云如來安處菩提座一毛示現多剎海一一毛現悉亦然如是普周於法界佛波羅蜜海十波羅蜜徧一切菩薩行故佛解脫海如來法身是佛解脫又智慧解脫乃至五分法身戒定慧解脫解脫知見等是佛變化海如下文無體無住處亦無生可得無相亦無形所現皆如影又一切剎土微塵數常現身雲悉充滿又云於一佛身上化為無量身佛演說海下文一一毛孔中光網徧十方演佛妙音聲調彼難調者又一音徧諸根故然如來音聲不從心出不從身出佛名號海如下名號品是如來名號等一切眾生心也佛壽量海如下文佛身如影現生滅不可得是佛壽量海又下文壽量品是及一切菩薩誓願海淨行品等是又十迴向品中大願是一切菩薩發趣海如下文云此會諸佛子善修眾智慧其人已能入如斯方便門又下文云從地而得地住於力地中億劫勤修行所獲法如是明從地而得地者不離真法界自體清淨性地而行進修十住十行等法故云從地而得地又十行品是十發趣加行成就令菩提心智悲純熟故一切菩薩助道海三十七助道品是觀身受心法為首一切菩薩乘海乘如來乘不思議乘法界乘是乃至八萬四千乘等一切菩薩行海普賢行是如下經云如是分身智境界普賢行中能建立一切菩薩出離海如五位中加行方便是如下經云此會諸菩薩入佛難思地一一皆能見一切佛神力又下文云普賢諸行願修治已明潔能於一切剎普見佛神變身住一切處一切皆平等智能如是行入佛之境界一切菩薩神通海如下十方佛剎來集菩薩眾及毛孔出眾隨行利生等事是又下十通品亦是又下文一一佛剎中往詣悉無餘見佛神通力入佛所行處一切菩薩波羅蜜海如下經中十方來集大眾身諸毛孔各出十佛世界微塵數光一一光出十佛世界微塵數菩薩悉能徧入一切法界諸安立海教化眾生廣如經具說是波羅蜜海也此是與發心者作普賢樣一切菩薩地海如下經云從地而得地是也又十地品是答又如來地是菩薩地如下經云此會諸菩薩入佛難思地一切菩薩智海根本智是如來智於根本智起差別智教化眾生是菩薩智海乃至十無盡智是也唯願世尊已下三句總結勸請准例十方諸佛既說今佛世尊亦合同說又爾時已下四句明供具說頌已上三十七問向下至毗盧遮那品已來有三種答前所問一如下齒間放光集眾現相神通答二如下眉間毫光出眾現相及十菩薩偈頌答三普賢入定出定以言詮示佛業眾生業因果古今相襲答如世界成就品菩薩眾生染淨報業答前三十七問佛海菩薩行海不離其中又說華藏莊嚴世界海說佛報得所居之土答前三十七問佛境界海眾生海菩薩行海波羅蜜海總不離其中又說古往毗盧遮那品是引古印今令眾生信承襲不斷法不虗來若古無舊跡今從何得以是義故引古佛用印今時成信從此初會一會至毗盧遮那品六品經總明舉果勸修信他已成佛者果德悲智境界行普賢行及報得莊嚴身土分從佛名號品重問二十八問即是舉古佛果門令今世及未來發心者自信自心佛果與古佛果不異及菩薩十信十住十行十迴向十地十一地佛眼耳鼻舌身意不異故信自今修不異古法有此二十八種不異之法具如佛名號品所問二十八問之法今古不異令初發心者應如是依古證修使令道不謬故直至法界品總是其答所問之法故若依五位法上有一百一十重佛果菩薩行古今不異若通信位即一百二十重古今佛因果不異至位方明三從供具雲中出音說二十行頌於中義分為四初兩行頌歎佛行滿成佛行徧三世次兩行頌明勸佛為眾除疑得證次兩行頌明大眾已集勸請除疑次云何已下十四行頌明重頌前三十七問問曰大眾何不以言自問因何嘿念致疑何不自以言讚勸請云何供具雲出音請佛答曰明佛得法界心與一切眾生同心故以心不異故知彼心疑供具說頌者明一切法總法界體也法界不思議一切法不思議故明聖眾心境無二故凡夫迷法界自見心境有二故顛倒生也。",
        "source": "X04n0223_018:0123c10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "【經】爾時世尊知諸菩薩心之所念即於面門眾齒之間放佛剎微塵數光明所謂眾寶華徧照光明出種種音莊嚴法界光明垂布微妙雲光明十方佛坐道場現神變光明一切寶燄雲蓋光明充滿法界無礙光明徧莊嚴一切佛剎光明迥建立清淨金剛寶幢光明普莊嚴菩薩眾會道場光明妙音稱揚一切佛名號光明如是等佛剎微塵數一一復有佛剎微塵數光明以為眷屬其光悉具眾妙寶色普照十方各一億佛剎微塵數世界海彼世界海諸菩薩眾於光明中各得見此華藏莊嚴世界海以佛神力其光於彼一切菩薩眾會之前而說頌言。",
        "translation": "[Sutra] Knowing what the minds of the bodhisattvas were thinking, the Bhagavān then released between the teeth of the many buddha bases at the entrance of his face a multitude of dusty lights, which are called multitudes of precious flowers that universally illuminate, emit various sounds that adorn the Dharma realm, spread subtle clouds of light, and present miraculous lights at the site where buddhas sit on the path in ten directions, and all the precious flaming clouds that cover the light that fills the Dharma realm without obstruction, universally adorn all the buddha bases, and establish a perfectly pure adamantine jeweled banner, universally adorn the site where bodhisattvas congregate on the path, and brightly praise the names of all the buddhas with their subtle sounds.",
        "source": "X04n0223_018:0125b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　無量劫中修行海　　供養十方諸佛海　化度一切眾生海　　今成妙覺徧照尊　毛孔之中出化雲　　光明普照於十方　應受化者咸開覺　　令趣菩提淨無礙　佛昔往來諸趣中　　教化成熟諸羣生　神通自在無邊量　　一念皆令得解脫　摩尼妙寶菩提樹　　種種莊嚴悉殊特　佛於其下成正覺　　放大光明普威耀　大音震吼徧十方　　普為弘宣寂滅法　隨諸眾生心所樂　　種種方便令開曉　往修諸度皆圓滿　　等於千剎微塵數　一切諸力悉已成　　汝等應往同瞻禮　十方佛子等剎塵　　悉共歡喜而來集　已雨諸雲為供養　　今在佛前專覲仰　如來一音無有量　　能演契經深大海　普雨妙法應羣心　　彼兩足尊宜往見　三世諸佛所有願　　菩提樹下皆宣說　一剎那中悉現前　　汝可速詣如來所　毗盧遮那大智海　　面門舒光無不見　今待眾集將演音　　汝可往觀聞所說【論】第二從爾時世尊知諸菩薩心之所念已下有一段長行并一偈頌是如來放齒光十方告眾令眾咸集現法答前所問分於此分中大意有十一如來知眾心念有疑二齒光普照三其光有十名四明光具眷屬五陳光色相六明光照遠近七明大眾蒙光彼此相見八明光徧他方眾會九明光能出聲告眾十明十方之眾聞告咸來問曰何故如來面門齒間出光告眾答曰面門及齒明言音出於中故於中出光今欲答眾所疑普告十方佛土大眾來集示法答前三十七問中云何是諸佛地佛境界佛加持佛行佛力等故須口中齒間放光光者除暗義又答前云何是佛光明除現在未來眾心疑暗故口齒者吐納言音說法表告之所由也故於中出光於此光明說其二十行頌於中大意歎如來道滿利生光明出音告眾令集聞法。",
        "translation": "\"Throughout the countless eons, this ocean of cultivated practice has supported the buddhas of the ten directions, has educated and liberated all sentient beings, and has become the honored one. Clouds of transformation have arisen from the hair pores, and their light has shone universally in the ten directions. Those who should be educated have all been enlightened, and their destinies have been purified and unobstructed. In all the destinies of the past, the Buddha has taught and educated sentient beings to maturity, and his supernormal power is unlimited.",
        "source": "X04n0223_018:0125c09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "【經】爾時十方世界海一切眾會蒙佛光明所開覺已各共來詣毗盧遮那如來所親近供養所謂此華藏莊嚴世界海東次有世界海名清淨光蓮華莊嚴彼世界種中有國土名摩尼纓珞金剛藏佛號法水覺虗空無邊王於彼如來大眾海中有菩薩摩訶薩名觀察勝法蓮華幢與世界海微塵數諸菩薩俱來詣佛所各現十種菩薩身相雲徧滿虗空而不散滅復現十種雨一切寶蓮華光明雲復現十種須彌寶峯雲復現十種日輪光雲復現十種寶華纓珞雲復現十種一切音樂雲復現十種粖香樹雲復現十種塗香燒香眾色相雲復現十種一切香樹雲如是等世界海微塵數諸供養雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於東方各化作種種華光明藏師子之座於其座上結跏趺坐此華藏世界海南次有世界海名一切寶月光明莊嚴藏彼世界種中有國土名無邊光圓滿莊嚴佛號普智光明德須彌王於彼如來大眾海中有菩薩摩訶薩名普照法海慧與世界海微塵數諸菩薩俱來詣佛所各現十種一切莊嚴光明藏摩尼王雲徧滿虗空而不散滅復現十種雨一切寶莊嚴具普照耀摩尼王雲復現十種寶燄熾然稱揚佛名號摩尼王雲復現十種說一切佛法摩尼王雲復現十種眾妙樹莊嚴道場摩尼王雲復現十種寶光普照現眾化佛摩尼王雲復現十種普現一切道場莊嚴像摩尼王雲復現十種密燄燈說諸佛境界摩尼王雲復現十種不思議佛剎宮殿像摩尼王雲復現十種普現三世佛身像摩尼王雲如是等世界海微塵數摩尼王雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於南方各化作帝青寶閻浮檀金蓮華藏師子之座於其座上結跏趺坐此華藏世界海西次有世界海名可愛樂寶光明彼世界種中有國土名出生上妙資身具佛號香燄功德寶莊嚴於彼如來大眾海中有菩薩摩訶薩名月光香燄普莊嚴與世界海微塵數諸菩薩俱來詣佛所各現十種一切寶香眾妙華樓閣雲徧滿虗空而不散滅復現十種無邊色相眾寶王樓閣雲復現十種寶燈香燄樓閣雲復現十種一切真珠樓閣雲復現十種一切寶華樓閣雲復現十種寶纓珞莊嚴樓閣雲復現十種普現十方一切莊嚴光明藏樓閣雲復現十種眾寶粖間錯莊嚴樓閣雲復現十種眾寶周徧十方一切莊嚴樓閣雲復現十種華門鐸網樓閣雲如是等世界海微塵數樓閣雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於西方各化作真金葉大寶藏師子之座於其座上結跏趺坐此華藏世界海北次有世界海名毗琉璃蓮華光圓滿藏彼世界種中有國土名優鉢羅華莊嚴佛號普智幢音王於彼如來大眾海中有菩薩摩訶薩名師子奮迅光明與世界海微塵數諸菩薩俱來詣佛所各現十種一切香摩尼眾妙樹雲徧滿虗空而不散滅復現十種密葉妙香莊嚴樹雲復現十種化現一切無邊色相樹莊嚴樹雲復現十種一切華周布莊嚴樹雲復現十種一切寶燄圓滿光莊嚴樹雲復現十種現一切旃檀香菩薩身莊嚴樹雲復現十種現往昔道場處不思議莊嚴樹雲復現十種眾寶衣服藏如日光明樹雲復現十種普發一切悅意音聲樹雲如是等世界海微塵數樹雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於北方各化作摩尼燈蓮華藏師子之座於其座上結跏趺坐此華藏世界海東北方次有世界海名閻浮檀金頗棃色幢彼世界種中有國土名眾寶莊嚴佛號一切法無畏燈於彼如來大眾海中有菩薩摩訶薩名最勝光明燈無盡功德藏與世界海微塵數諸菩薩俱來詣佛所各現十種無邊色相寶蓮華藏師子座雲徧滿虗空而不散滅復現十種摩尼王光明藏師子座雲復現十種一切莊嚴具種種校飾師子座雲復現十種眾寶鬘燈燄藏師子座雲復現十種普雨寶纓珞師子座雲復現十種一切香華寶纓珞藏師子座雲復現十種示現一切佛座莊嚴摩尼王藏師子座雲復現十種戶牖階砌及諸纓珞一切莊嚴師子座雲復現十種一切摩尼樹寶枝莖藏師子座雲復現十種寶香間飾日光明藏師子座雲如是等世界海微塵數師子座雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於東北方各化作寶蓮華摩尼光幢師子之座於其座上結跏趺坐此華藏世界海東南方次有世界海名金莊嚴瑠璃光普照彼世界種中有國土名清淨香光明佛號普喜深信王於彼如來大眾海中有菩薩摩訶薩名慧燈普明與世界海微塵數諸菩薩俱來詣佛所各現十種一切如意王摩尼帳雲徧滿虗空而不散滅復現十種帝青寶一切華莊嚴帳雲復現十種一切香摩尼帳雲復現十種寶燄燈帳雲復現十種示現佛神通說法摩尼王帳雲復現十種現一切衣服莊嚴色像摩尼帳雲復現十種一切寶華叢光明帳雲復現十種寶網鈴鐸音帳雲復現十種摩尼為臺蓮華為網帳雲復現十種現一切不思議莊嚴具色像帳雲如是等世界海微塵數眾寶帳雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於東南方各化作寶蓮華藏師子之座於其座上結跏趺坐此華藏世界海西南方次有世界海名日光徧照彼世界種中有國土名師子日光明佛號普智光明音於彼如來大眾海中有菩薩摩訶薩名普華光燄髻與世界海微塵數諸菩薩俱來詣佛所各現十種眾妙莊嚴寶蓋雲徧滿虗空而不散滅復現十種光明莊嚴華蓋雲復現十種無邊色真珠藏蓋雲復現十種出一切菩薩悲愍音摩尼王蓋雲復現十種眾妙寶燄鬘蓋雲復現十種妙寶嚴飾垂網鐸蓋雲復現十種摩尼樹枝莊嚴蓋雲復現十種日光普照摩尼王蓋雲復現十種一切塗香燒香蓋雲復現十種栴檀藏蓋雲復現十種廣大佛境界普光明莊嚴蓋雲如是等世界海微塵數眾寶蓋雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於西南方各化作帝青寶光燄莊嚴藏師子之座於其座上結跏趺坐此華藏世界海西北方次有世界海名寶光照耀彼世界種中有國土名眾香莊嚴佛號無量功德海光明於彼如來大眾海中有菩薩摩訶薩名無盡光摩尼王與世界海微塵數諸菩薩俱來詣佛所各現十種一切寶圓滿光雲徧滿虗空而不散滅復現十種一切寶燄圓滿光雲復現十種一切妙華圓滿光雲復現十種一切化佛圓滿光雲復現十種十方佛土圓滿光雲復現十種佛境界雷聲寶樹圓滿光雲復現十種一切瑠璃寶摩尼王圓滿光雲復現十種一念中現無邊眾生相圓滿光雲復現十種演一切如來大願音圓滿光雲復現十種演化一切眾生音摩尼王圓滿光雲如是等世界海微塵數圓滿光雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於西北方各化作無盡光明威德藏師子之座於其座上結跏趺坐此華藏世界海下方次有世界海名蓮華香妙德藏彼世界種中有國土名寶師子光明照耀佛號法界光明於彼如來大眾海中有菩薩摩訶薩名法界光燄慧與世界海微塵數諸菩薩俱來詣佛所各現十種一切摩尼藏光明雲徧滿虗空而不散滅復現十種一切香光明雲復現十種一切寶燄光明雲復現十種出一切佛說法音光明雲復現十種現一切佛土莊嚴光明雲復現十種一切妙華樓閣光明雲復現十種現一切劫中諸佛教化眾生事光明雲復現十種一切無盡寶華蘂光明雲復現十種一切莊嚴座光明雲如是等世界海微塵數光明雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於下方各化作寶燄燈蓮華藏師子之座於其座上結跏趺坐此華藏世界海上方次有世界海名摩尼寶照耀莊嚴彼世界種中有國土名無相妙光明佛號無礙功德光明王於彼如來大眾海中有菩薩摩訶薩名無礙力精進慧與世界海微塵數諸菩薩俱來詣佛所各現十種無邊色相寶光燄雲徧滿虗空而不散滅復現十種摩尼寶網光燄雲復現十種一切廣大佛土莊嚴光燄雲復現十種一切妙香光燄雲復現十種一切莊嚴光燄雲復現十種諸佛變化光燄雲復現十種眾妙樹華光燄雲復現十種一切金剛光燄雲復現十種說無邊菩薩行摩尼光燄雲復現十種一切真珠燈光燄雲如是等世界海微塵數光燄雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於上方各化作演佛音聲光明蓮華藏師子之座於其座上結跏趺坐如是等十億佛剎微塵數世界海中有十億佛剎微塵數菩薩摩訶薩一一各有世界海微塵數諸菩薩眾前後圍遶而來集會是諸菩薩一一各現世界海微塵數種種莊嚴諸供養雲悉徧虗空而不散滅現是雲已向佛作禮以為供養隨所來力各化作種種寶莊嚴師子之座於其座上結跏趺坐如是坐已其諸菩薩身毛孔中一一各現十世界海微塵數一切寶種種色光明一一光中悉現十世界海微塵數諸菩薩皆坐蓮華藏師子之座此諸菩薩悉能徧入一切法界諸安立海所有微塵彼一一塵中皆有十佛世界微塵數諸廣大剎一一剎中皆有三世諸佛世尊此諸菩薩悉能徧往親近供養於念念中以夢自在示現法門開悟世界海微塵數眾生念念中以示現一切諸天歿生法門開悟世界海微塵數眾生念念中以說一切菩薩行法門開悟世界海微塵數眾生念念中以普震動一切剎歎佛功德神變法門開悟世界海微塵數眾生念念中以嚴淨一切佛國土顯示一切大願海法門開悟世界海微塵數眾生念念中以普攝一切眾生言辭佛音聲法門開悟世界海微塵數眾生念念中以能雨一切佛法雲法門開悟世界海微塵數眾生念念中以光明普照十方國土周徧法界示現神變法門開悟世界海微塵數眾生念念中以普現佛身充徧法界一切如來解脫力法門開悟世界海微塵數眾生念念中以普賢菩薩建立一切眾會道場海法門開悟世界海微塵數眾生如是普徧一切法界隨眾生心悉令開悟念念中一一國土各令如須彌山微塵數眾生墮惡道者永離其苦各令如須彌山微塵數眾生住邪定者入正定聚各令如須彌山微塵數眾生隨其所樂生於天上各令如須彌山微塵數眾生安住聲聞辟支佛地各令如須彌山微塵數眾生事善知識具眾福行各令如須彌山微塵數眾生發於無上菩提之心各令如須彌山微塵數眾生趣於菩薩不退轉地各令如須彌山微塵數眾生得淨智眼見於如來所見一切諸平等法各令如須彌山微塵數眾生安住諸力諸願海中以無盡智而為方便淨諸佛國各令如須彌山微塵數眾生皆得安住毗盧遮那廣大願海生如來家爾時諸菩薩光明中同時發聲說此頌言。",
        "translation": "【經】爾時十方世界海一切眾會蒙佛光明所開覺已各共來詣毗盧遮那如來所親近供養所謂此華藏莊嚴世界海東次有世界海名清淨光蓮華莊嚴彼世界種中有國土名摩尼纓珞金剛藏佛號法水覺虗空無邊王於彼如來大眾海中有菩薩摩訶薩名觀察勝法蓮華幢與世界海微塵數諸菩薩俱來詣佛所各現十種菩薩身相雲徧滿虗空而不散滅復現十種雨一切寶蓮華光明雲復現十種須彌寶峯雲復現十種日輪光雲復現十種寶華纓珞雲復現十種一切音樂雲復現十種粖香樹雲復現十種塗香燒香眾色相雲復現十種一切香樹雲如是等世界海微塵數諸供養雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於東方各化作種種華光明藏師子之座於其座上結跏趺坐此華藏世界海南次有世界海名一切寶月光明莊嚴藏彼世界種中有國土名無邊光圓滿莊嚴佛號普智光明德須彌王於彼如來大眾海中有菩薩摩訶薩名普照法海慧與世界海微塵數諸菩薩俱來詣佛所各現十種一切莊嚴光明藏摩尼王雲徧滿虗空而不散滅復現十種雨一切寶莊嚴具普照耀摩尼王雲復現十種寶燄熾然稱揚佛名號摩尼王雲復現十種說一切佛法摩尼王雲復現十種眾妙樹莊嚴道場摩尼王雲復現十種寶光普照現眾化佛摩尼王雲復現十種普現一切道場莊嚴像摩尼王雲復現十種密燄燈說諸佛境界摩尼王雲復現十種不思議佛剎宮殿像摩尼王雲復現十種普現三世佛身像摩尼王雲如是等世界海微塵數摩尼王雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於南方各化作帝青寶閻浮檀金蓮華藏師子之座於其座上結跏趺坐此華藏世界海西次有世界海名可愛樂寶光明彼世界種中有國土名出生上妙資身具佛號香燄功德寶莊嚴於彼如來大眾海中有菩薩摩訶薩名月光香燄普莊嚴與世界海微塵數諸菩薩俱來詣佛所各現十種一切寶香眾妙華樓閣雲徧滿虗空而不散滅復現十種無邊色相眾寶王樓閣雲復現十種寶燈香燄樓閣雲復現十種一切真珠樓閣雲復現十種一切寶華樓閣雲復現十種寶纓珞莊嚴樓閣雲復現十種普現十方一切莊嚴光明藏樓閣雲復現十種眾寶粖間錯莊嚴樓閣雲復現十種眾寶周徧十方一切莊嚴樓閣雲復現十種華門鐸網樓閣雲如是等世界海微塵數樓閣雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於西方各化作真金葉大寶藏師子之座於其座上結跏趺坐此華藏世界海北次有世界海名毗琉璃蓮華光圓滿藏彼世界種中有國土名優鉢羅華莊嚴佛號普智幢音王於彼如來大眾海中有菩薩摩訶薩名師子奮迅光明與世界海微塵數諸菩薩俱來詣佛所各現十種一切香摩尼眾妙樹雲徧滿虗空而不散滅復現十種密葉妙香莊嚴樹雲復現十種化現一切無邊色相樹莊嚴樹雲復現十種一切華周布莊嚴樹雲復現十種一切寶燄圓滿光莊嚴樹雲復現十種現一切旃檀香菩薩身莊嚴樹雲復現十種現往昔道場處不思議莊嚴樹雲復現十種眾寶衣服藏如日光明樹雲復現十種普發一切悅意音聲樹雲如是等世界海微塵數樹雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於北方各化作摩尼燈蓮華藏師子之座於其座上結跏趺坐此華藏世界海東北方次有世界海名閻浮檀金頗棃色幢彼世界種中有國土名眾寶莊嚴佛號一切法無畏燈於彼如來大眾海中有菩薩摩訶薩名最勝光明燈無盡功德藏與世界海微塵數諸菩薩俱來詣佛所各現十種無邊色相寶蓮華藏師子座雲徧滿虗空而不散滅復現十種摩尼王光明藏師子座雲復現十種一切莊嚴具種種校飾師子座雲復現十種眾寶鬘燈燄藏師子座雲復現十種普雨寶纓珞師子座雲復現十種一切香華寶纓珞藏師子座雲復現十種示現一切佛座莊嚴摩尼王藏師子座雲復現十種戶牖階砌及諸纓珞一切莊嚴師子座雲復現十種一切摩尼樹寶枝莖藏師子座雲復現十種寶香間飾日光明藏師子座雲如是等世界海微塵數師子座雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於東北方各化作寶蓮華摩尼光幢師子之座於其座上結跏趺坐此華藏世界海東南方次有世界海名金莊嚴瑠璃光普照彼世界種中有國土名清淨香光明佛號普喜深信王於彼如來大眾海中有菩薩摩訶薩名慧燈普明與世界海微塵數諸菩薩俱來詣佛所各現十種一切如意王摩尼帳雲徧滿虗空而不散滅復現十種帝青寶一切華莊嚴帳雲復現十種一切香摩尼帳雲復現十種寶燄燈帳雲復現十種示現佛神通說法摩尼王帳雲復現十種現一切衣服莊嚴色像摩尼帳雲復現十種一切寶華叢光明帳雲復現十種寶網鈴鐸音帳雲復現十種摩尼為臺蓮華為網帳雲復現十種現一切不思議莊嚴具色像帳雲如是等世界海微塵數眾寶帳雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於東南方各化作寶蓮華藏師子之座於其座上結跏趺坐此華藏世界海西南方次有世界海名日光徧照彼世界種中有國土名師子日光明佛號普智光明音於彼如來大眾海中有菩薩摩訶薩名普華光燄髻與世界海微塵數諸菩薩俱來詣佛所各現十種眾妙莊嚴寶蓋雲徧滿虗空而不散滅復現十種光明莊嚴華蓋雲復現十種無邊色真珠藏蓋雲復現十種出一切菩薩悲愍音摩尼王蓋雲復現十種眾妙寶燄鬘蓋雲復現十種妙寶嚴飾垂網鐸蓋雲復現十種摩尼樹枝莊嚴蓋雲復現十種日光普照摩尼王蓋雲復現十種一切塗香燒香蓋雲復現十種栴檀藏蓋雲復現十種廣大佛境界普光明莊嚴蓋雲如是等世界海微塵數眾寶蓋雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於西南方各化作帝青寶光燄莊嚴藏師子之座於其座上結跏趺坐此華藏世界海西北方次有世界海名寶光照耀彼世界種中有國土名眾香莊嚴佛號無量功德海光明於彼如來大眾海中有菩薩摩訶薩名無盡光摩尼王與世界海微塵數諸菩薩俱來詣佛所各現十種一切寶圓滿光雲徧滿虗空而不散滅復現十種一切寶燄圓滿光雲復現十種一切妙華圓滿光雲復現十種一切化佛圓滿光雲復現十種十方佛土圓滿光雲復現十種佛境界雷聲寶樹圓滿光雲復現十種一切瑠璃寶摩尼王圓滿光雲復現十種一念中現無邊眾生相圓滿光雲復現十種演一切如來大願音圓滿光雲復現十種演化一切眾生音摩尼王圓滿光雲如是等世界海微塵數圓滿光雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於西北方各化作無盡光明威德藏師子之座於其座上結跏趺坐此華藏世界海下方次有世界海名蓮華香妙德藏彼世界種中有國土名寶師子光明照耀佛號法界光明於彼如來大眾海中有菩薩摩訶薩名法界光燄慧與世界海微塵數諸菩薩俱來詣佛所各現十種一切摩尼藏光明雲徧滿虗空而不散滅復現十種一切香光明雲復現十種一切寶燄光明雲復現十種出一切佛說法音光明雲復現十種現一切佛土莊嚴光明雲復現十種一切妙華樓閣光明雲復現十種現一切劫中諸佛教化眾生事光明雲復現十種一切無盡寶華蘂光明雲復現十種一切莊嚴座光明雲如是等世界海微塵數光明雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於下方各化作寶燄燈蓮華藏師子之座於其座上結跏趺坐此華藏世界海上方次有世界海名摩尼寶照耀莊嚴彼世界種中有國土名無相妙光明佛號無礙功德光明王於彼如來大眾海中有菩薩摩訶薩名無礙力精進慧與世界海微塵數諸菩薩俱來詣佛所各現十種無邊色相寶光燄雲徧滿虗空而不散滅復現十種摩尼寶網光燄雲復現十種一切廣大佛土莊嚴光燄雲復現十種一切妙香光燄雲復現十種一切莊嚴光燄雲復現十種諸佛變化光燄雲復現十種眾妙樹華光燄雲復現十種一切金剛光燄雲復現十種說無邊菩薩行摩尼光燄雲復現十種一切真珠燈光燄雲如是等世界海微塵數光燄雲悉徧虗空而不散滅現是雲已向佛作禮以為供養即於上方各化作演佛音聲光明蓮華藏師子之座於其座上結跏趺坐如是等十億佛剎微塵數世界海中有十億佛剎微塵數菩薩摩訶薩一一各有世界海微塵數諸菩薩眾前後圍遶而來集會是諸菩薩一一各現世界海微塵數種種莊嚴諸供養雲悉徧虗空而不散滅現是雲已向佛作禮以為供養隨所來力各化作種種寶莊嚴師子之座於其座上結跏趺坐如是坐已其諸菩薩身毛孔中一一各現十世界海微塵數一切寶種種色光明一一光中悉現十世界海微塵數諸菩薩皆坐蓮華藏師子之座此諸菩薩悉能徧入一切法界諸安立海所有微塵彼一一塵中皆有十佛世界微塵數諸廣大剎一一剎中皆有三世諸佛世尊此諸菩薩悉能徧往親近供養於念念中以夢自在示現法門開悟世界海微塵數眾生念念中以示現一切諸天歿生法門開悟世界海微塵數眾生念念中以說一切菩薩行法門開悟世界海微塵數眾生念念中以普震動一切剎歎佛功德神變法門開悟世界海微塵數眾生念念中以嚴淨一切佛國土顯示一切大願海法門開悟世界海微塵數眾生念念中以普攝一切眾生言辭佛音聲法門開悟世界海微塵數眾生念念中以能雨一切佛法雲法門開悟世界海微塵數眾生念念中以光明普照十方國土周徧法界示現神變法門開悟世界海微塵數眾生念念中以普現佛身充徧法界一切如來解脫力法門開悟世界海微塵數眾生念念中以普賢菩薩建立一切眾會道場海法門開悟世界海微塵數眾生如是普徧一切法界隨眾生心悉令開悟念念中一一國土各令如須彌山微塵數眾生墮惡道者永離其苦各令如須彌山微塵數眾生住邪定者入正定聚各令如須彌山微塵數眾生隨其所樂生於天上各令如須彌山微塵數眾生安住聲聞辟支佛地各令如須彌山微塵數眾生事善知識具眾福行各令如須彌山微塵數眾生發於無上菩提之心各令如須彌山微塵數眾生趣於菩薩不退轉地各令如須彌山微塵數眾生得淨智眼見於如來所見一切諸平等法各令如須彌山微塵數眾生安住諸力諸願海中以無盡智而為方便淨諸佛國各令如須彌山微塵數眾生皆得安住毗盧遮那廣大願海生如來家爾時諸菩薩光明中同時發聲說此頌言。",
        "source": "X04n0223_018:0126a20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "　諸光明中出妙音　　普徧十方一切國　演說佛子諸功德　　能入菩提之妙道　劫海修行無厭倦　　令苦眾生得解脫　心無下劣及勞疲　　佛子善入斯方便　盡諸劫海修方便　　無量無邊無有餘　一切法門無不入　　而恒說彼性寂滅　三世諸佛所有願　　一切修治悉令盡　即以利益諸眾生　　而為自行清淨業　一切諸佛眾會中　　普徧十方無不往　皆以甚深智慧海　　入彼如來寂滅法　一一光明無有邊　　悉入難思諸國土　清淨智眼普能見　　是諸菩薩所行境　菩薩能住一毛端　　徧動十方諸國土　不令眾生有怖想　　是其清淨方便地　一一塵中無量身　　復現種種莊嚴剎　一念歿生普令見　　獲無礙慧莊嚴者　三世所有一切劫　　一剎那中悉能現　知身如幻無體相　　證明法性無礙者　普賢勝行皆能入　　一切眾生悉樂見　佛子能住此法門　　諸光明中大音吼【論】第三從爾時十方世界海已下一段長行并一偈頌是十方世界海蒙光所照皆來雲集示法分於此段中大意有十一明佛光普照二明十方眾來三明來已興供四明興供不同五明眾海影像相參六明大眾自他同異自在七明大眾毛孔出光八明光出菩薩九明菩薩同事利生十明眾生發心得果此之十事如文可知如毛孔流光眾明法界體性自在不思議自他無礙能同能異眾於中菩薩同行利生即明古今已成正覺者菩薩及行十波羅蜜海佛地佛海等舉其已成佛者悲智境界答前大眾三十七疑用成來世與今同悟身心境界自在無礙如帝網境界門如此一段以佛神力放光集眾答前所問後之一段毫光示法及菩薩偈頌答前所問於此十方來眾光明中同時發聲說二十行頌於此中大意歎佛光明道行已滿身口意耳鼻總徧周剎海滿普賢行答前三十七問如文可知。",
        "translation": "\"Marvelous sounds emanating from all the lights, pervading all the lands in the ten directions, explaining the merits of the Buddha's son, his ability to enter the wondrous path of enlightenment, his unwearying cultivation of the ocean of eons, causing suffering sentient beings to attain liberation, his lack of inferiority and fatigue, the Buddha's skillful entry into this method, his skillful cultivation of the ocean of eons, measureless, limitless, and without remainder, and the unexcelled entry into all the teachings, and his constant teaching of the extinction of their nature.",
        "source": "X04n0223_018:0128c08_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第十八",
        "translation": "Dafangguang fo xin Huayan jing jie lun, vol. 18",
        "source": "X04n0223_018:0129a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "音切",
        "translation": "to sound and cut",
        "source": "X04n0223_018:0129a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頗(滂和切)。",
        "translation": "phā (panghe che).",
        "source": "X04n0223_018:0129b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "棃(力脂切)。",
        "translation": "(Likṣi-cīvara).",
        "source": "X04n0223_018:0129b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "粖(末音)。",
        "translation": "Ṛṣipatana (Māyāna).",
        "source": "X04n0223_018:0129b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "校(古孝切)。",
        "translation": "Śrīgarbha (Guxiao che).",
        "source": "X04n0223_018:0129b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鬘(莫還切)。",
        "translation": "ārāma (mārājñī).",
        "source": "X04n0223_018:0129b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "砌(七異切)。",
        "translation": "masonry (qi yichao).",
        "source": "X04n0223_018:0129b01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莖(戶耕切)。",
        "translation": "Stem (Tukongche).",
        "source": "X04n0223_018:0129b01_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "叢(時紅切)。",
        "translation": "bush (shuiqie).",
        "source": "X04n0223_018:0129b02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蘂(如水切)。",
        "translation": "urchin (Ruoshui chen).",
        "source": "X04n0223_018:0129b02_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "歿(沒音)。",
        "translation": "ı (muṣṭi).",
        "source": "X04n0223_018:0129b02_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "覲(渠吝切)。",
        "translation": "kan (kuṅkakuche).",
        "source": "X04n0223_018:0129b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奮(方問切)。",
        "translation": "נ (fang wenche).",
        "source": "X04n0223_018:0129b02_11",
        "is_bad_quality": false
    }
]