[
    {
        "source_sentence": "圓覺疏鈔隨文要解卷第十(疏二中)(鈔七末)沙門凊遠　述〔經幻滅亦滅〕能推破身心之觀慧即心所中慧數亦即是無對待之法俱滅無智無得是為法空玄文云因起幻智以除諸幻幻盡智泯覺心圓明今即幻盡智泯之謂也。",
        "translation": "Following the Essentials of the Text in the Subcommentary to the Sutra of Perfect Enlightenment, Vol. 10 (2nd in the Commentary) (end of 7th in the Commentary), the ascetic Largely Explains [The Sutra on the Cessation of Illusions and Their Disappearance] that the wisdom of contemplation that can refute body and mind is the number of wisdoms in the mind and its objects, which are without any counterpart, all cease, have no wisdom, and are unobtainable, which is called the emptiness of dharmas.",
        "source": "X10n0250_010:0119a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏法空〕前於身心之中推求無我故名我空但於身心中無我未空身心(我有兩重總別)上約我為總身心為別若約身為總色心為別(初一是色後四蘊是心)但於五蘊中不執主宰為無我未空於五蘊但床上無人猶執心外諸法自有性故謂心外諸法雖是心造果報不無故(權教我空其次法空云)今以觀慧推破身心與境俱空床等亦空故名法空床上無人床亦空也然法空義有多宗所說謂唯識故空情有理無故空析色以明空體色以明空空中無色故空因緣無性故空如次辨之。",
        "translation": "[Commentary on the emptiness of dharmas] The former is to inquire into the absence of self in body and mind; therefore, it's called emptiness of self. But in the body and mind, there's no self; it's not empty of body and mind (there are two general distinctions of self).",
        "source": "X10n0250_010:0119a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔情有理無故空〕謂一切凡夫皆謂離心有定實法是為情有理無情有者論云一切諸法唯依妄念而有差別唯識云唯識無境界以無塵妄見如人目有翳見毛月等事由是名為情有理無者有三義一折色以明空大鈔云以假想慧折至極微則色等空不待刀斧破除也即細末不念二種方便破麤色唯不念方便破細色無著云三千大千世界所有微塵(細末方便)諸微塵即非微塵(不念方便上二竝破麤色即色身)世界即非世界(唯不念方便破細色即名身)然細末不念二方便破色身名身圭山云在此通情器在金剛唯通有情刊定別記等以色身破器界名身方破有情者違圭山意也言折至極微者初折一身為兩段段各為二乃至大如一指節又折為七麥一麥折為七虱一虱折為七蟣乃至七微一微為七極微極微隣虗不可折不名為色故說極微是色邊際諸有對色現有色相以理推究離色尚無況無對耶(況破無對色)是定心中了見細色非肉眼能見即雜集論五種無表色中極略色謂無見無對色也二。",
        "translation": "[Sentient beings exist, principle does not exist therefore emptiness] It means that all mortals say that apart from the mind there is a set real dharma which is sentient beings exist, principle does not exist, and the discourse says that all dharmas are only differentiated by deluded thoughts.",
        "source": "X10n0250_010:0119b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔體色以明空〕謂緣生無性故自他共及無因皆無生理故體之即無不待分折故三。",
        "translation": "(1) [The essence of form is used to explain emptiness] It means that conditioned arising is devoid of nature, so it's self, other, shared, and without cause, all lack substance, and therefore the essence of it is nothing without waiting for a division.",
        "source": "X10n0250_010:0119b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔空中無色故〕空謂虗空具三義故必無色無邊義無壞義無雜義法界觀云會色歸空空中必無色心經云是故空中無色等現見有色者是情有矣道理的無情盡則色空如鏡像無礙問無邊虗空豈得便是真空耶答欲破所執之色故立無物之空今以破色之理成就義勢連環便至真空耳具如大鈔(十三)。",
        "translation": "[because there is no form in the air] emptiness means that space has three meanings, so it must be without form, without limit, without decay, without mixed meanings, because the contemplation of the Dharma realm says that form returns to emptiness, and there must be no form in emptiness.",
        "source": "X10n0250_010:0119c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔因緣無性故空〕大疏無此句者含在體色明空中。",
        "translation": "This phrase [emptiness because of the absence of nature in causes and conditions] is not found in the main commentary, but is included in the space between the essence of form and clarity.",
        "source": "X10n0250_010:0119c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔外道小乘等〕一破邪小二破儒道西域十三家外道小乘二十部宗計。",
        "translation": "One refutes mistaken and lesser [beliefs], and the other refutes the thirteen Confucian schools and twenty non-Buddhist and lesser vehicle schools in the West.",
        "source": "X10n0250_010:0119c09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔所執非實故空〕外道不出自然邪因無因等計此方儒道亦不出邪因無因大鈔廣明竝如大鈔等大疏引唯識云諸心心所依佗起故亦如幻事非真實有為遣執心心所實有外境故說唯有識若執唯識真實有者如執外境亦是法執鈔云二明心空也恐計心等實有故復破之全取破相宗心境俱空之義正約大乘初門所破執情既盡心境皆空故名為法空。",
        "translation": "[What's attached to is not real and therefore empty] Non-Buddhists don't reject the natural mistaken-cause, causeless, and other assumptions, and Confucianism in this direction also doesn't reject mistaken-cause, causeless, and other assumptions. The great commentary cites Consciousness-only as saying that the mind and mental factors are not truly existent because they depend on wisdom and are like illusory things.",
        "source": "X10n0250_010:0119c10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注不執我法一毫之相方堪修法界觀等〕修字恐悞有本大鈔入字為正何者二空觀成覺性圓明無妄可斷寧必修法界觀乎若云入則與二空觀成法界圓觀理不相返耳然依下文觀行無前後則修字理亦可通注權教不說法界觀故無實果問今唯揀權教終教說法界觀否又二空觀是始教法界觀是圓教頓教應不說耶答權實言之法界觀通三教漸頓言之唯後二教圓頓言之唯後一教有此三勢法界觀唯圓教者是華嚴法界故今唯揀權教無實果者權實對論故。",
        "translation": "[Commentary: Not clinging to even the slightest aspect of self or dharmas is necessary to cultivate contemplation of the reality realm, etc.] The word cultivation might lead to an entry in the original Dazhuan. Why is it necessary to cultivate contemplation of the reality realm when the completion of the contemplation of two emptinesses and the perfect clarity of the awakened nature has no delusion to be cut off? If it's called entry, then the principle of contemplation of two emptinesses and the completion of the reality realm in the perfect contemplation is not contradictory.",
        "source": "X10n0250_010:0119c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏真心本覺是明〕今疏是合釋據法言之真心是本覺明是始覺鏡體有明是修成。",
        "translation": "[Commentary: \"Genuine mind and original awakening are the insights\"] The commentary now combines the explanation with the explanation that according to the teaching, genuine mind is original awakening and insight is initial awakening, the mirror's essence is existence, and insight is cultivation.",
        "source": "X10n0250_010:0120a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經當知身心等〕四句標印前顯後上二句標印前二空觀下二句標顯后法界觀前經云如來藏中無起滅故等即開解二空觀今此正修如法界性究竟圓滿遍十方故即開解法界觀今正修也。",
        "translation": "[Sutra should know that body and mind are] four statements that mark the prior and reveal the latter, two statements that mark the prior two contemplations of emptiness, and two statements that mark the latter contemplation of the reality realm. The prior sutra says that there's no arising or ceasing in the tathāgatagarbha, which means it's an enlightening contemplation of the two kinds of emptiness.",
        "source": "X10n0250_010:0120a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經垢相永滅〕相即身心幻相垢即六塵又塵污身心即是垢相。",
        "translation": "[Sutra on the Permanent Cessation of Defiled Characteristics] The characteristics are the illusory characteristics of body and mind, and the defiling of body and mind by dust is the defiled characteristics.",
        "source": "X10n0250_010:0120a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏此由身心〕大疏此字悞也。",
        "translation": "[Commentary: It's from body and mind] The word impure appears in the main commentary.",
        "source": "X10n0250_010:0120a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經諸愚癡者〕通凡夫外道權小并實教地前。",
        "translation": "[Sutra on those who are foolish] It's common to worldlings, non-Buddhists, provisional and lesser, and in front of the ground of the true teaching.",
        "source": "X10n0250_010:0120a10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經見彼摩尼實有五色〕摩尼釋有三義已見前文(二中)大鈔引起信四鏡有四義摩尼亦然若釋論四鏡即是四珠一如實空鏡無法可照摩奢趺娑珠鏡此云種受此珠前安種種物不現像唯安同類珠則現像性淨本覺亦爾遠離諸過患現清淨功德同此摩尼光明照耀不容有色可對執有五色之對者是我法未除直於珠體不見有法可對遍法界是圓明珠法中亦爾遍法界唯此圓頓覺性不容一法也云何是中更容佗物二因熏習鏡能現萬像非但不污明鏡反顯鏡明輪多梨華珠鏡此云明耀能現同類異類物像悉皆明淨性淨本覺亦爾一切法悉於中現無別體性故不能污染反顯具德為內熏因同此摩尼現色隨方各異法中雖現身心無別體性即前種種幻化生於覺心三法出離鏡去垢而明出於二礙離和合相智淳淨故玻璃珠鏡有三德出泥駈濁辟穢性淨本覺亦爾離上三過圓滿三德同此摩尼體性清淨等法中觀成而顯四緣熏習鏡置於高臺隨現萬緣碧中玻[王*梨]珠鏡對異色珠隨應現色性淨本覺亦爾遍照眾生之心令修菩提隨念應現故同此摩尼映於五色隨方各現法中現於身心隨類各應諸愚癡者以為實有前二自性淨后二離垢淨。",
        "translation": "[The sūtras see that the maṇi really has five colors.] The explanation of the maṇi has three meanings as explained in the previous section (Second Intermediate).",
        "source": "X10n0250_010:0120a11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏五色喻五道〕問法中身心喻中何故喻五道耶答身心通五道故一直依本配之依此文勢直以五色配五道不言修羅者人天中各有修羅故攝屬於人天經論多云五道正法念經約別義配六道。",
        "translation": "[Commentary on the Five Colors as a Metaphor for the Five Destinies] Q: What is the metaphor for the five destinies in the metaphor for body and mind in the Dharma? A: Body and mind are connected to the five destinies, so we've been relying on the original to match them.",
        "source": "X10n0250_010:0120b08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔心如畫師手出五色〕大疏(三十一)依正法念經手字之下有畫字有則為優。",
        "translation": "[Mind like a Painter's Hand Producing Five Colors] The great commentary (31) relies on the sutra of recitation of the true teaching to have the word painting underneath the word hand, which is superior.",
        "source": "X10n0250_010:0120b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔餘黃配修羅〕餘字通於后三大鈔云餘則黃配修羅大鈔為優。",
        "translation": "The word \"remaining\" (yellow) is used in the three major commentaries, and the word \"remaining\" (yellow) is used in the three major commentaries.",
        "source": "X10n0250_010:0120b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏若遠即前身心〕大疏云若遠取即前身心大疏為優。",
        "translation": "If the commentary is distant from the prior body and mind, the major commentary says that if it's taken distantly from the prior body and mind, the major commentary is superior.",
        "source": "X10n0250_010:0120b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏但無計執之人〕問今云無計執之人何故至相云前教解行之病邪答今約病盡處說問既云病盡后觀無執何故真空觀云猶有未融通之執邪答彼彰觀行淺深故與此無妨。",
        "translation": "[Commentary: Only those who have no mistaken attachment] Q: Why does it mean that those who have no mistaken attachment arrive at the point where the practice of the prior doctrine and understanding is ill? A: Now, we're talking about the point where the illness ends. Q: Since it says that the illness ends and the subsequent contemplation has no attachment, why is it that the vacuum contemplation cloud still contains attachments that have yet to be fused? A: It shows that the contemplation practice is shallow and deep, so there's no harm in it.",
        "source": "X10n0250_010:0120b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏前之鏡喻但一面明因磨而現〕問若依釋論鏡即是珠今何揀二喻引耶答今依賢首本疏以義揀之故鏡珠之別以配屬經文問摩尼亦有磨義如彼四珠鏡后二離垢淨豈非磨邪答今經二喻義相別故各以一義揀之在彼約通相而說無不可也。",
        "translation": "[The mirror metaphor in the commentary is only one side of the story that shows up because of grinding] Q. If we rely on the interpretation of the treatises, the mirror is the pearl, so why are the two metaphors cited? A. Now, we rely on the Xianshou benshu to select the meaning of the mirror and the pearl, so they are distinguished by the text of the sutra that refers to them.",
        "source": "X10n0250_010:0120b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經圓覺淨性現於身心〕若約自體本淨淨性所現非無淨法鏡中所現非實有故非但不污明鏡抑亦顯圓明德用今約愚癡執情而說故彼愚癡者說彼摩尼實有五色故。",
        "translation": "[The sūtra's perfectly enlightened pure nature manifests in body and mind] If we consider that the originally pure nature of the essence of the self is not manifested by the absence of pure dharmas, then what appears in the mirror isn't really there.",
        "source": "X10n0250_010:0120b24_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經由此不能遠於幻化〕遠(去聲)者離也由此即躡前說有身心自相由此執有身心自相故不能離於幻化即眾生妄執之病也。",
        "translation": "[Thus, the sūtra says, \"We can't be far from illusory transformation.\"] Far (deprecatory case) is free from this, which is to tiptoe around the previous teaching that there's an own-mind aspect of body and mind, and because of this attachment to the own-mind aspect of body and mind, we can't be free from illusory transformation, which is the disease of deluded attachment in sentient beings.",
        "source": "X10n0250_010:0120c03_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經是故我說身心幻垢等〕是故者躡前妄執幻化由是之故我今所說身心幻垢又由此妄執身心為實有故我說身心以為幻垢對所離幻垢之迹說名菩薩問此菩薩是何地位答即上根凡夫當彼終教地上菩薩問對離之智是何智邪答約二空觀言之即地上平等妙觀二智若約唯破我執言之即成所作智。",
        "translation": "[Sutra: \"Therefore, I teach the illusory defilement of body and mind,\" etc.] Therefore, this is the illusory defilement of body and mind that I've taught in the past, and because of this false attachment to body and mind as truly existent, I teach body and mind as illusory defilement.",
        "source": "X10n0250_010:0120c06_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏對機之佛亦不可得方見法身法身說經義在斯矣〕今經能應即佗受用身所對是登地機妄執既無何有對離之智既無對離之智何有對垢之菩薩既無對垢之菩薩何有對機說法之者故云對機之佛亦不可得方見法身問前云是佗受用身說今何故云法身說邪答前約從真起應對登地機即他受用身今約拂迹顯理故云法身雖云法身即法報不分之真身不同權教三身歷別之理法身也具如前說。",
        "translation": "Since there's no wisdom of antidiscipline, why is there a bodhisattva who antidiscipline? Since there's no bodhisattva who antidiscipline, why is there a bodhisattva who antidiscipline? Since there's no bodhisattva who antidiscipline, why is there a bodhisattva who antidiscipline? Therefore, it's said that the buddhas who antidiscipline are also unobtainable in order to see the Dharma body.",
        "source": "X10n0250_010:0120c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "疏二　鈔八　大鈔十三",
        "translation": "Commentary 2: 8: 13: Great Commentary",
        "source": "X10n0250_010:0120c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏一真法界〕問經有一真法界如何不立一真觀邪答法界但是克體指覺未明理事絕諸對待故開而言之但為一真之外別無三重三重不出此一真故。",
        "translation": "[Commentary on the One True Dharma Realm] The question is: How does the sutra not establish the contemplation of the one true reality? The answer is that the Dharma realm is nothing but the grammatical essence, pointing to the awakening of the unexplained, directive principles, and cutting off all kinds of antagonism, so it's opened up to say that beyond the one true reality there's no triple triple that doesn't come from this one true reality.",
        "source": "X10n0250_010:0120c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔強以三諦配者〕強(上聲)勉也如云強詺曰道謂強立名矣皆此之類也謂一真法界逈異餘宗絕諸對待非二諦三諦八諦等與此相對勉強配之而已矣。",
        "translation": "[Those who forcibly match the three truths] forcibly (higher sound) reluctantly includes, as in the case of the saying, \"The strong statement of the path means to forcibly establish a name.\" This is the sort of thing that means the single true reality and the reality realm are distinct from other schools, free from all kinds of antagonism, and not the two truths, three truths, eight truths, etc., which are opposed to this, but which are simply reluctantly matched.",
        "source": "X10n0250_010:0121a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注問天台說一境三諦等〕此問從非二三八諦能配屬而來疑彼一境三諦融攝無礙寧與此別答云不同也以彼不例此第三重故謂事無礙逈異諸宗耳。",
        "translation": "This question follows from the fact that it's not the two, three, and eight truths that can be subordinated to each other. It's because they don't exemplify this third aspect, so they say that things are unobstructed and different from other schools.",
        "source": "X10n0250_010:0121a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經此菩薩及末世眾生〕此菩薩者指法會修證觀行之人也及末世者指未來修觀行之當根也以圓彰法界有異前故躡前功用起後文勢功用者即證得諸幻等諸幻者即前身心客塵及諸幻智證得者即觀行成就究竟證得諸幻影像俱滅不但遍計不存依佗亦泯依計俱泯圓成實性現前由是空消覺顯故云便得。",
        "translation": "[Sutra on this bodhisattva and sentient beings of the latter age] This bodhisattva refers to someone who cultivates the practice of contemplation at the Dharma assembly, and those of the latter age refer to the future faculties that will cultivate the practice of contemplation. Because the perfectly manifest Dharma realm is different from the prior, they tiptoe around the prior effort and give rise to the subsequent text and momentum.",
        "source": "X10n0250_010:0121a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔無方〕者由無我故無有方所。",
        "translation": "[Without a direction] This refers to the fact that because there's no self, there's no direction or location.",
        "source": "X10n0250_010:0121a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔清淨〕者謂破二執顯空理清淨即空故問前文云此經於真性上顯圓成不同般若心經於依計上辨圓成何故今云遍計不存依佗亦泯莫是破依計顯圓成邪答般若教興為破依計未必不顯圓成此經教興為顯圓成未必不破依計具如前說(二初)。",
        "translation": "[Purity] means that the principle of emptiness that's pure is empty because it breaks the two attachments and reveals emptiness.",
        "source": "X10n0250_010:0121a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經無邊虗空覺所顯發〕上句破空下句顯覺然最先破虗空者以虗空是成劫之始故問虗空如何可破答由識變故識破則殞(疏唯答意)第八識相分有二一識所變境是本質二識所緣境是影像六七識執之為實今顯離識無體是故疏云虗空離識亦非實有。",
        "translation": "The first sentence breaks emptiness, and the second sentence reveals enlightenment. However, the first to break emptiness is because emptiness is the beginning of the eons of formation.",
        "source": "X10n0250_010:0121a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔隨分別者有虗空相〕者字多却大鈔於相字上有一等字准上文說虗空等名答有等字又注中隨字之下闕名起二字謂隨名起分別心等大鈔為正。",
        "translation": "The word [following the distinguished one's existence in space] is copious, but the Dasho has the first class word on the word 'shape,' which is the same as the above explanation of space and other names, and the word 'such.' The commentary also lacks the two words for 'arising from names' under the word 'following,' which means that the Dasho is correct in terms of distinguishing the mind from names.",
        "source": "X10n0250_010:0121a24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注聞佛菩薩說名〕此是名言習氣即因也分別心是緣有虗空相是果。",
        "translation": "[Commenting on hearing the Buddha and bodhisattvas speak of names] These are name-calling karmic impressions that are causes, and the mind of discrimination is the condition for having the marks of uncontaminated space as the result.",
        "source": "X10n0250_010:0121b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔依法性假施設有謂空無我所顯真如〕唯識論說虗空有二初義如鈔可見次義法性是所依是法真理故名法性真如是能依離諸障礙故名虗空然相宗所說真如離礙故為空即帶相之空由在六無為之數故然彼六種無為小乘三種俱是虗空皆屬所破若性宗直指真如即是本覺。",
        "translation": "[According to the provisional definition of the nature of things, there's the true reality that's described as empty and without self] Consciousness-only teaches that there are two kinds of emptiness. The first meaning is as discussed in the commentary, and the second meaning is that the nature of things is what's supported by the truth of things, so it's called the nature of things, and true reality is what's capable of being supported by things that are free from obstacles, so it's called emptiness.",
        "source": "X10n0250_010:0121b05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔破和合識相〕問破和合識顯現法身即果位觀智此是登地觀智何得是同邪答與今經觀成同佛理無別也又但引首楞識破空亡證此空銷覺顯鈔引起信合釋首楞取與別耳問前鈔四云二空觀至覺所顯發及三觀終是始覺分齊下文修習此心等是本覺分齊此中何故便指同起信始覺合本及發真歸源邪答今但用彼破空識現義若配經文則今云覺顯但同彼發真義也却以歸源配釋始覺合本耳。",
        "translation": "[The characteristic of the consciousness that destroys union] Q: How can the consciousness that destroys union reveal the Dharma body, which is the observing wisdom of the fruition stage? A: It's the same as the present sūtra's observing the accomplishment of the same buddha principle, which is not different from the present sūtra's observing the formation of the buddha.",
        "source": "X10n0250_010:0121b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏迷情所覆〕是六七識中我癡計執以為實有即遍計也。",
        "translation": "[Commentary: [Covered by delusion] These are the six or seven deluded attachments of consciousness to self and imagination as truly existing, which is pervasive imagination.",
        "source": "X10n0250_010:0121b18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏塵影既銷〕即緣塵之影是前能緣六塵之虗妄心也。",
        "translation": "[Commentary on Dust and Shadow Eliminated] That's the shadow of the conditioned dust, which is the deluded mind that can condition the six dust motes in the past.",
        "source": "X10n0250_010:0121b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔上句慧解脫等〕慧是所知之理慧解脫者覺現也。",
        "translation": "The above phrase [such as wisdom and liberation] refers to wisdom as the principle of knowing, and wisdom and liberation are perceptions of manifestation.",
        "source": "X10n0250_010:0121b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔心解脫〕者謂妄盡真心顯現也唯識云煩惱障障心心不解脫彼是妄心又云所知障障慧慧不解脫彼是慧數屬百法收教章云於所知障心得解脫者彼是定心謂二乘障八解脫定言心得解脫者所知障既遣八解現前故含依佗相空前科破識變之空即遍計情執之空正屬經文空銷覺顯今科正破識變之空兼破能變之識故云含色問無邊虗空覺所顯發空銷覺顯唯破識變之空何故鈔中兼破依佗邪答依佗亦泯之義影在滅影像中疏中已明鈔中亦指經。",
        "translation": "[The mind is liberated] when the delusion is ended and the true mind is manifested. Consciousness-only says that the mind is not liberated from the afflictive hindrances and the cognitive hindrances, and that the wisdom is not liberated from the cognitive hindrances and that the wisdom is classified as one of the one hundred dharmas in the chapter on collecting teachings.",
        "source": "X10n0250_010:0121b22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注旋聞普脫〕若據經文耳根云聲脫當用聲字今取六根成解脫義故云普脫或云悞者非也。",
        "translation": "According to the sūtras, the ear faculty says 'sound liberation.' Now, the six faculties are taken to mean liberation, so it's called universal liberation.",
        "source": "X10n0250_010:0121c07_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏空身雙絕〕大疏真空妙色亦泯謂外道斷空凡夫實色今入觀智斷空成真空實色成妙色此真空妙色亦泯是依佗法故大鈔云然上破空之疏唯識文然今意與彼殊彼破小乘諸部計身外實有三種無為空今即俱對凡愚空相不融色相不泯也問大疏理空俱遣今疏何故唯泯事空邪答今破事空即是理空何者如次前含破依佗相空。",
        "translation": "[Commentary on the Sutra: Emptiness and Body Are Both Annihilated] The great commentary on the vacuum and marvelous form are also extinguished, meaning that non-Buddhists cut off emptiness and mortals' true form, but now that they've entered into the wisdom of contemplation, they cut off emptiness and become vacuum, and true form becomes marvelous form.",
        "source": "X10n0250_010:0121c09_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔鈔云心境皆空方顯真實圓明覺性非空非有絕待中也〕疏於今科克體指覺結上絕待云是知空有雙絕但是覺心此即空有雙非以顯中道空病亦遣豈非理空邪但文言簡略耳問大鈔云前破二執顯空理今又超空理至於覺也若爾二空理亦破也何故前云二空觀成法界圓現二空理即本覺真如邪答前據觀行成就者說今據觀行未成者說由觀行未成故為真空觀前方便也又觀行未成義同權教二空耳以彼破執顯理俱未明根源故科三重法界等辨疑悞云此科悞也應合於牒經釋中分真空理事周徧二科於真空觀分二初略示觀門二對釋經義於中又分二初會義二釋文於中又分二初色相空淨等議曰此說頗有理應傳寫之悞耳。",
        "translation": "[The commentary says that both mind and object are empty in order to show that the true and real nature of awakening is not empty and not existent in the midst of absolute equanimity] The commentary now refers to the essence of karmic bonds in the midst of absolute equanimity, which is to know that emptiness and existence are both absolute but only in the mind of awakening, which is emptiness and existence are both nonexistent in order to show that the middle way is empty and sickness is also rejected, is it not emptiness in principle?",
        "source": "X10n0250_010:0121c15_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏一真空絕相觀〕真空之絕相真空即絕相真空絕相之觀真空絕相即觀此觀即理法界何不直名理法界觀者直觀於理不成觀智故今約破斷空實色故特名真空觀又真空者即靈妙心源約不虗妄故言真非色相故言空也絕相者能觀之智亦不可得故。",
        "translation": "[Commentary 1: Contemplation of Vacuum and Extinction of Form] The extinction of vacuum is the extinction of form, vacuum is the contemplation of extinction, vacuum is the contemplation of extinction of form, and the extinction of form is the contemplation of this contemplation is the principle of the Dharma realm.",
        "source": "X10n0250_010:0122a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏三周遍含容觀〕前理事無礙法界觀如名者理事融即成觀智故此觀何不直名事事無礙觀者直觀事事亦不成觀智故如十門中前三門理如事事如理事含理事正是觀智之境故又由前觀顯理有周遍含容故今觀事隨理亦周遍含容方顯事事無礙故。",
        "translation": "The first three contemplations of pervasive inclusion are like the principle, which is like the matter, which is like the council, and the council, which is the object of the wisdom of contemplation.",
        "source": "X10n0250_010:0122a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏全同華嚴法界觀門三重行相〕問三觀全同華嚴有何優劣耶答但指三觀經文同彼故曰全同若指一經但是分同又觀行儀式全同約義則此經三觀但分圓若一真法界則含圓經依此等說三重義理名三法界也問經說四種法界何故觀唯三重邪答今本注云不言事觀者事不獨立法界宗中無孤單法故若獨觀之即是情計之境問何以玄鏡云一一事法皆可成觀略故不言邪答言似相違而意同也由纔作事觀攝歸真實即是真空觀等故。",
        "translation": "[Commentary: \"All three contemplations are the same as the triple practice of the Huayan school of contemplation\"] Q: What's the superiority or inferiority of the three contemplations being the same as the Huayan school? A: The three contemplations are the same as the sutra, so it's called \"all the same.\" If the three contemplations are the same as the scripture, then the three contemplations of the scripture are only the same in part, and the rituals of contemplation are the same in part.",
        "source": "X10n0250_010:0122a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注定皆清淨絕相是宗法等〕言等者等於定皆理事融通定皆事事無礙是宗法然今性宗雖說宗因不同因明論三事合集成於比量今但唯舉宗因而已具如前說(三初)。",
        "translation": "Although the nature school says that the reason for the proposition is different from the reason for the proposition, the three things in the reliance on logic are integrated into the inference, but the reason for the proposition is only mentioned as explained above (beginning of the third).",
        "source": "X10n0250_010:0122b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注止觀熏習造詣〕或云初止次觀三雙具今謂玄義章云觀觀中具止觀義熏習玄鏡云熏修學習今直注於修字之下今經奢摩佗即止也宴坐靜室等觀也又下文奢摩佗等三俱名觀爾則止觀相須也又前文先依奢摩佗行等然後宴坐靜室即斯意耳。",
        "translation": "Some say that the first is calming, the second is observing, and the third is a combination of both. This is called the profound meaning chapter, which says that observing includes the meaning of calming and observing.",
        "source": "X10n0250_010:0122b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注所依經〕止云華嚴法界觀門清涼云略無經字圭山饒舌乃云意不出文有謂不必加此句者今謂清涼在文外圭山表而出之斯觀之作不下經字以從略故從略之意在所修觀行不在能詮經文。",
        "translation": "[Note that the sūtra relied upon for] calming the clouds, Huayan's approach to contemplation of the Dharma realm, Qingliang's clouds, and the absence of the word sūtra, Guishan's rap sheet, and then the meaning of not going beyond the text, there's no need to add this phrase.",
        "source": "X10n0250_010:0122b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注非餘經所說之法界〕非餘經所說者以是華嚴所說之法界故非是前教羣經所說故然就前教唯此經分說餘經雖有說者唯上一真法界而已。",
        "translation": "The reason it's not explained in other scriptures is because it's the Dharma realm explained in Huayan and it's not explained in the scriptures of the previous teaching.",
        "source": "X10n0250_010:0122b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏彼觀門中有四句謂會色歸空觀等〕后二觀但各直開十門此觀先作四句就四句方開十門諸記各出所以不同今謂正順般若之四謗故。",
        "translation": "The latter two contemplations only directly open ten aspects each, but this one first makes four statements that open ten aspects in terms of four statements, and the records each present a different reason.",
        "source": "X10n0250_010:0122b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏上二皆簡情〕謂會色歸空明空即色此二句各四門皆初三簡情後一顯解初三簡情者觀注云初句揀斷空次句揀實色第三句雙揀斷空實色今第三揀影像者已知斷空實色是真空幻色然猶帶幻色之想故此簡之謂斷空實色兩亡即此假想亦不可得故云簡影像大鈔引經云滅影像故今依圭山(雙揀據觀影像據經)若玄鏡云古有多解都約三種揀之一約簡即離初句簡離色次句簡太即第三句雙簡即離前三以法簡情第四句正顯理釋云顯其正理二簡空亂意即寶性論地前空亂意菩薩有三種一疑空異色取色外空今明色不異空以斷之二疑空滅色取斷滅空今明色即是空以斷之三疑空是物取空為有今明空即是色以斷之三簡形顯斥云但簡前二足顯真空也然心經疏先簡二乘疑次簡空亂意圭山唯用玄鏡初義又緣即離通藥病故改為簡斷空實色以斷空實色唯是病故不簡空亂意者恐煩觀智故但取切當直注之耳大鈔不妨亦簡空亂意而不用心經疏簡二乘疑者連珠亦云此未是經宗并疏主意下第三科便顯正義方是也有謂圭山悖師無禮者何孟浪之太甚乎。",
        "translation": "The first three are brief, and the last one is clear. The first three are brief when the commentary on the contemplation says that the first sentence selects the cutting off of emptiness, the second sentence selects real form, and the third sentence double selects the cutting off of emptiness and real form. The third selects images because it's known that the cutting off of emptiness and real form is vacuum and illusory form, but it still carries the perception of illusory form, so it's brief that the cutting off of emptiness and real form are both dead, which means that this false perception is also unobtainable, so it's called brief images.",
        "source": "X10n0250_010:0122b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏顯解〕觀云顯理諸記皆云顯真空之理或云顯二空之理唯大鈔(十三末)云道理之理具云言顯解者顯真實道理令生解也問此簡情顯解正同二空觀何故三觀不先入二空觀耶答直入觀智故問何故此經先作二空觀耶答初心菩薩曾未斷我故。",
        "translation": "[Commentary on the Explanation of the] Contemplation Cloud Explanation of Principles All the commentaries say that they reveal the principle of vacuum, or they say that they reveal the principle of two kinds of emptiness.",
        "source": "X10n0250_010:0122c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏三空色無礙觀解終起行〕同今經證得諸幻滅影像故解絕彼觀雙簡斷空實色今雙簡真空妙色同前第三句簡影像問前八門同今經二空觀簡情顯解何故玄鏡釋彼第四句顯理云依佗無性真理即是圓成故此真空該徹性相二如邪答文有前後義無前後也。",
        "translation": "[Commentary on the three contemplations of emptiness and form without obstruction, understanding the final arising of practice] is the same as the present sūtra, which realizes the images of illusion and cessation, and therefore understands the cutting off of those contemplations, which are both brief in cutting off emptiness and real form, and the present, which is both brief in vacuum and marvelous form, which is the same as the prior third sentence, which is brief in images.",
        "source": "X10n0250_010:0122c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏四泯絕無寄觀行起解絕〕同今經虗空覺所顯發行起也前八門簡情顯解第三四句解終起行此正成行體行由解成行起解絕解是聞思二慧行是修慧正是定境然大鈔配一心三觀觀注不用者恐生義解有妨觀智故今釋經故不妨配之心經疏用之同此意也。",
        "translation": "[Commentary on the four extinguishers of the unsupported contemplation practice arises and the solution is extinguished] The same as the present scripture, the practice arises from the manifestation of the awakening to space and the previous eight aspects of the manifestation of the third and fourth phrases of the understanding ends and the practice arises and the practice is formed, the practice arises and the solution is extinguished, the understanding is heard, contemplated, and the two kinds of wisdom, the practice is cultivated, and the wisdom is precisely the object of concentration.",
        "source": "X10n0250_010:0123a01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔言真空者即靈妙心源〕此即一真法界亦是圓覺妙心於此作真空絕相等三觀今於一真法界上約真空絕相一義耳。",
        "translation": "This is the single true reality realm, which is also the marvelous mind of perfect enlightenment.",
        "source": "X10n0250_010:0123a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔空中無色有理有文等〕有理者言水中無火其理可知有文者經中俱云是故空中無色無受想等色中無空文理俱絕者不言是故色中無空理亦不然玄鏡觀注亦與此同問何故心經疏約三義一相違義準此應云色中無空以色違空故若以互存必互亡等邪答此約依持義彼約相違義又此約真空義彼約理事無礙義又此約泯情說彼約開解說因同宗異是所依故不即色是所依故即是色皆云是所依故因同也不即色即是色示異也。",
        "translation": "The principle is that there's no fire in the water, and the principle is knowable. The principle is that it's both stated in the sutra that it's because there's no form in the air, no feeling or perception, and so forth, there's no emptiness in form, and the principle is neither stated nor explained in the commentary on the Xuanjing contemplation, which is the same as this.",
        "source": "X10n0250_010:0123a09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注蕩蕩無邊非心色境〕色字悞也大鈔是識字。",
        "translation": "The word 'form' (note: turbulent, limitless, not mind, form, or object) is used indiscriminately, and the Dazhuan is a word for consciousness.",
        "source": "X10n0250_010:0123a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔非言所及非解所到〕展轉拂迹無遣故云非言所及上句不可以識識下句不可以智知是為行境者定心之境也。",
        "translation": "What's not reached by language and what's not understood] is not reached by language because the first phrase can't be recognized and the second phrase can't be known by cognition.",
        "source": "X10n0250_010:0123a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔何以故〕者徵釋以真如自體有真實識知義等別更生心起解悉卒本體。",
        "translation": "This [why] is a syllogism that explains that the essence of the true thusness itself has the true and real meaning of consciousness and knowing and so forth, and that the mind is reborn, arisen, and understood to fully comprehend its essence.",
        "source": "X10n0250_010:0123a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏清淨與空皆絕相義〕會清淨即是空大般若八十餘科皆云清淨大品即直云空科云色相空淨則雙收彼二皆言清淨等大鈔問若此段經文(虗空覺所顯發)但同觀門泯絕無寄中行起之言其前三句簡情顯解解絕自同前段(二空觀垢盡明現至滅影像故若爾真空觀已足)何得以觀門配此段(顯心清淨等)邪答經與觀門拂迹泯絕行起等觀行皆無前後但文不頓彰故約相由之意似有前後耳若大鈔次前云顯心清淨等文已是觀成之相顯示此成相令未成者倣而修之故又修二空觀何得證真空觀者文有前後修之同時故其不體信二空觀成法界圓現者可詳味此義。",
        "translation": "The meaning of [the commentary on] both purity and emptiness is cut off from each other] is that purity is emptiness, and the 80 sections of Mahāprajñāpāramitā are all clouded with purity, and the 80 sections are clouded with emptiness.",
        "source": "X10n0250_010:0123a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔能破一切法中戲論等〕般若離四句謂是損減謗亦有亦無是相違謗非有非無是戲論謗但例義通不例體別義通者心以覺圓明故清淨下根識等法例此皆由覺圓明故清淨體別者唯此云清淨如明鏡之體清淨餘根識等法如青黃等色以空無體故名清淨良由清淨二字義通體別唯例義通不例體別同引般若八十餘科皆談清淨證此根識等無體故清淨應般若無體邪答般若之心萬法之體如前已說今且取清淨一義同此色相空淨又色相空淨非不顯體亦且就空淨一義說之。",
        "translation": "[able to refute conceptual elaborations in all dharmas] Prajñā is free from four phrases that are derogatory, defamatory, both existent and nonexistent, contradictory, non-existent, and non-nonexistent conceptual elaborations, but the examples are general, not specific. The general meaning is that the mind is purified because of the perfect awareness, and the lower faculties and consciousnesses are purified because of the perfect awareness, and the specific meaning is that only this cloud is purified like the body of a bright mirror, and the remaining faculties and consciousnesses and other dharmas like blue and yellow are empty and have no body, so they are called purified.",
        "source": "X10n0250_010:0123b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏心者總相明其我心〕此即大總相阿梨耶識言總者染淨和合故又有漏名賴耶無漏名無垢識通名為心故云總我者是第七執第八為內自我。",
        "translation": "This is the great aggregate of the consciousness called store consciousness, which is the combination of defilement and purity, and the contaminated name Laya, the uncontaminated name unsullied consciousness, which is generally called mind.",
        "source": "X10n0250_010:0123b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔總即本心〕大鈔云疏心者二字即以通名牒起經文偏約第八指其體詳其經文含總別故總即我心別即賴耶然今鈔云本心理亦可通今以我心為正既云以通名牒起即真妄和合之心非本淨耳。",
        "translation": "The two words \"total mind\" and \"original mind\" in the Dasho commentary refer to the eighth consciousness in a generic sense, and the sūtras refer to its essence in detail.",
        "source": "X10n0250_010:0123b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔立種種名〕第八識有多名通三位已如前說(一末)。",
        "translation": "[Establishing various names] The eighth consciousness has multiple generic triads as explained above (one final).",
        "source": "X10n0250_010:0123c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注於有情有成就不成就此名〕孔目八識章第六門約賴耶云成就此名謂住有心位者即異生及有學不成就此名謂羅漢獨覺不退菩薩及與如來。",
        "translation": "[Note that in sentient beings there's accomplishment and non-acquisition of this name] The sixth aspect of the Kongmu chapter on the eight consciousnesses is called accomplishment of this name, which refers to those who abide in the state of having mind, namely, unenlightened sentient beings, trainees, and non-acquisition of this name, which refers to arhats, unenlightened, irreversible bodhisattvas, and tathāgatas.",
        "source": "X10n0250_010:0123c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注梵云質多此名心也〕此即正翻依攝論義翻為集起謂集諸種子起現行故。",
        "translation": "This is correctly translated according to the meaning of the Summary of Discourses as 'accumulation and arising,' meaning the accumulation of seeds that arise and become active.",
        "source": "X10n0250_010:0123c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔積集義是心〕下此依大鈔脫七字彼云集義是心義起義是心義以能集生多種子故。",
        "translation": "The meaning of [accumulating] is mind, and the following is based on the seven words of the Dasheng shuo, which say that the meaning of accumulating is the meaning of mind, and the meaning of arising is the meaning of mind because it's capable of accumulating and producing many seeds.",
        "source": "X10n0250_010:0123c08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔能集生多種子〕者集即積集義生即生起義以彼為優今鈔義亦可通。",
        "translation": "The meaning of 'able to gather and produce many seeds' is to gather, which is the meaning of accumulation, and to produce, which is the meaning of arising.",
        "source": "X10n0250_010:0123c10_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔或能熏習〕習字悞也大鈔用集字謂外境積集於其中餘如前說(一末)。",
        "translation": "The word 'gathering' is also used in the Daxuan to mean the accumulation of external objects in the sense of accumulation, and the rest is as explained above (1:2).",
        "source": "X10n0250_010:0123c11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注心體第三〕本識第一意第二心第三云心意識者從末至本故。",
        "translation": "[Note 3] The original consciousness is the first mind, the second mind, and the third mental consciousness, which is derived from the derivative to the original.",
        "source": "X10n0250_010:0123c12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注凡夫一染義〕當云一分染義鈔脫分字。",
        "translation": "[Note that the meaning of \"one defilement\" for ordinary people] should be called the meaning of \"one defilement\" when the glossary removes the word \"one\".",
        "source": "X10n0250_010:0123c14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔亦能持根依〕根即上諸色根謂浮塵根此識能持諸色根亦能為諸根所依。",
        "translation": "[It can also support the faculties] The faculties are the form faculties up there, which are the floating dust faculties. This consciousness can support the form faculties and can be a support for the faculties.",
        "source": "X10n0250_010:0123c15_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注此所知阿賴耶之別名也〕知字下脫一依字。",
        "translation": "[Note that this is a different name for the store consciousness, which is the store consciousness] The word store consciousness is separated from the word basis.",
        "source": "X10n0250_010:0123c16_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔非無學位不退菩薩有雜染等〕或云不字之上當有及字以無學即二乘無學不退菩薩即大乘八地二宗既別當以及字簡別之然無及字義理極當良由大乘以八地為無學故云無學位不退菩薩今不取前義。",
        "translation": "[It's not that the nondegenerate bodhisattva has defilements and so forth] Some say that above the word not there should be the word and because the nondegenerate is the two vehicles, the nondegenerate bodhisattva is the eight ground of the great vehicle, and the two schools are distinct, there should be a brief distinction between the word and the meaning of the word, but the absence of the word and the principle is extremely appropriate because the great vehicle regards the eight ground as the nondegenerate, so it's called the nondegenerate bodhisattva.",
        "source": "X10n0250_010:0123c17_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔雜染法〕者善惡有漏法也雖具三藏唯取執藏為名餘二是別相此是總相故。",
        "translation": "[defiled dharmas] are good and bad contaminated dharmas, even though they exist in all three stores, and only attach to the store as the name. The other two are distinctive, so this is the general aspect.",
        "source": "X10n0250_010:0123c21_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔或名異熟識〕因通善惡果招無記有漏善惡可記別之法為因能感第八無記之果因果種別故名為異任運酬因故名為熟果異因熟故云異熟謂過去六識中善惡熏習第八識成種招此識果酬引業故亦名總報業所感之身即第八識中相分謂三能變之初也此是善惡業果位即一切凡夫二乘十地菩薩到佛地方捨此名具如要問餘如前說(五半)。",
        "translation": "[Or called ripening consciousness] has causes that are shared with good and bad effects that bring about indeterminate, contaminated good and bad, and which can be remembered as distinct things that are the cause and can bring about the eighth indeterminate effect. Because the cause and effect are distinct, they're called distinct, and the result is called ripening because the cause and effect are ripened.",
        "source": "X10n0250_010:0123c23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔是無記故〕有謂當改故字為法字今謂同次前執藏義故竝是出沒此名之所以豈當改邪此若可改前豈不然。",
        "translation": "[It's because of indeterminate moral indeterminacy] Some say that the word therefore should be changed to the word dharma, but this is the same as the previous meaning of appropriating the store, so it's both renounced. How could this name be changed?",
        "source": "X10n0250_010:0124a06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔與雜染互為緣故有情執為自內我〕正釋三藏義互為緣者釋能所藏義識為能藏雜染法為所藏又為雜染法之所覆藏即雜染法為能藏識為所藏謂能藏是因所藏是緣。",
        "translation": "The correct explanation of the mutual dependence of the three stores' meanings is that consciousness is the store that stores defiled dharmas and is the store that's covered by defiled dharmas, meaning that defiled dharmas are the store that stores and consciousness is the store that stores what's the cause and the condition.",
        "source": "X10n0250_010:0124a08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注有情等者釋執藏義〕為第七染污根所執之以為自內我故此是雜染執藏位即一切凡夫二乘有學及七地菩薩此約相宗八地方捨此名。",
        "translation": "[Note that sentient beings and others interpret the meaning of appropriating store] as the seventh defiled root that appropriates as its own internal self, and therefore is the stage of appropriating store of defilements, which means all worldlings, two-vehicle trainees, and seventh-stage bodhisattvas abandon this name in light of the eight areas of the Xiangzong school.",
        "source": "X10n0250_010:0124a11_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注能持染種〕種字之下脫一種字大鈔有之。",
        "translation": "[Note that it's able to hold the defiled seeds] Under the word seed, it's removed from the word kind, which is found in the Dasho.",
        "source": "X10n0250_010:0124a14_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注為染第七等〕染字上脫一雜字多却等字。",
        "translation": "[Note that it's the seventh word for defilement] Above the word defilement, it's stripped of the word \"many\" and \"many\".",
        "source": "X10n0250_010:0124a15_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注諸有漏法皆名雜染法〕雜染下脫非唯染三字大鈔有之謂有漏善法皆名雜染非法。",
        "translation": "[Note that all contaminated things are called defiled things] Under defiled, there are three words that are not just defiled, which are found in the great commentaries and which mean that all contaminated good things are called defiled and unlawful.",
        "source": "X10n0250_010:0124a16_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注不爾二乘無學八地菩薩應有此名〕大鈔脫無學二字謂小乘至無學捨此名以彼無學唯有所知障無煩惱障故大乘以八地為無學捨此名。",
        "translation": "[Note: If that's not the case, then the two-vehicle post-learner bodhisattvas at the eighth ground should have this name.] The Dasho texts take away the word post-learner, which means that the lesser vehicle arrives at the post-learner stage and abandons this name because that post-learner has only the hindrance of knowledge and no afflictive hindrances.",
        "source": "X10n0250_010:0124a18_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注三闕即不得此名〕正出唯以執藏為名所以意云雖具三藏之義唯取執藏名為賴耶餘二是別別不離總故(反顯云)若云不然者八地菩薩應有此賴耶名耶(若不許執藏為總者如云八地無執藏應不捨賴耶名耶順顯云)大小乘無學不得賴耶名者由無三藏故言三闕者顯無執藏闕則三藏闕然謂三藏俱無故不得賴耶名闕者門觀也廣邪釋名曰闕在門兩旁中央闕然為道也若云三中欠一應用欠缺之缺大鈔云三藏闕一恐后人改之或取大鈔者所見別耳。",
        "translation": "[Note that the three deficiencies are not allowed to be named] The reason is that although the meaning of the tripiṭaka is present, the only thing that's taken from the tripiṭaka is the name Raiye. The other two are distinct and not separate from the sum total (contrary to the statement) If it's not, then the eighth-stage bodhisattva should have the name Raiye.",
        "source": "X10n0250_010:0124a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注因果之外豈更別有乃至故答云〕有謂宜改云豈更無別又餘故答云三字今謂正難能所藏外豈別有執藏之體故答攝能所藏為執藏自體相故答云三字生起次文麤書義勢斷不可除也。",
        "translation": "[Commentary: \"Is there anything other than cause and effect, or even more than that?\"] There's a claim that it's appropriate to change the cloud, saying, \"Is there nothing more than that?\" [Commentary: \"Is there anything other than the essence of the appropriated store outside of the subject and the appropriated store?\"] The answer is, \"The subject and the appropriated store are the self-identity of the appropriated store,\" and the answer is, \"The three words that arise next are written in a coarse sense, and their meaning is cut off and cannot be removed.",
        "source": "X10n0250_010:0124b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注問前說此識有三位何故於三能變中舉異熟等〕三位者即相續執持等三竝屬初能變如要問引唯識三能變云初即異熟次即末那三即前六識然此問意何故唯識三能變中初能變即舉異熟此中初能變却舉賴耶邪故次云三字指示答意云此中不舉異熟而舉賴耶者對觀成同佛顯漏無漏迷悟之別故謂以觀中不執賴耶正是答意此宗觀成覺性圓明沒賴耶之名轉名心故所以科云釋轉名所以良由迷真心而為賴耶但約觀成而顯不同相宗八地方捨此名。",
        "translation": "[Commenting on the previous question that there are three aspects of consciousness, why are they held up as ripening and so forth in the three transformations?] The three aspects are continuity, holding, and so forth, all belonging to the first transformation as the essential question cites the three transformations of consciousness-only, saying that the first aspect is ripening, the second aspect is manas, and the third aspect is the first six consciousnesses.",
        "source": "X10n0250_010:0124b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔若據相宗〕已下竝是對此宗觀成同佛料簡諸宗之別疏文甚明有謂舉字上脫一不字熟字下脫等字意云等所知依等四也辨疑悞云大鈔無此注今既加此問者應更加執藏之過云此識自相分位雖多藏識過重是故偏說注中失記引論今為足之然聖教多含亦各言其志也。",
        "translation": "The following [if based on the Xiangzong] are the distinctions between the contemplations of this school and those of the Buddha's Profile schools. The commentary is very clear, saying that the word \"lifted\" above the word \"not\" and the word \"ripened\" below the word \"liberated\" means \"four\" such as \"faculties of knowing\" and \"relying\".",
        "source": "X10n0250_010:0124b18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔捨賴耶名〕問此云相宗八地方捨此名何故孔目一末云初教十地終心捨阿賴耶邪答或云既云方捨即知未盡也地盡方窮今謂八地捨此名者約麤重盡邊說十地終心者約佛地方究竟清淨故約終教初發心住即捨問何故孔目云終教初地即捨賴耶之名邪答彼約三乘通相而說故。",
        "translation": "[The name śaraya] asked, \"When this is called the eighth ground of the Xiangzong school, why does Kongmu say at the end of the tenth ground of the preliminary teaching that the final mind is śaraya?\" A Some say that since it's called the \"direction of śaraya,\" that means it's known that it's not yet exhausted, and the ground is exhausted in every direction.",
        "source": "X10n0250_010:0124b24_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔此識中煩惱盡〕此識即第八謂第七識執第八為自內我至八地時此識中煩惱麤重究竟盡故不復執藏阿賴耶識為自內我故云捨非捨識體此宗不立地位故但觀行成就沒此名非沒體。",
        "translation": "[The end of afflictions in this consciousness] This consciousness is the eighth consciousness which means the seventh consciousness clings to the eighth as its own internal self until the eighth ground when the debilitating hindrances of afflictions in this consciousness are completely ended so it no longer clings to the store of store consciousness as its own internal self so it's called equanimous and not equanimous consciousness body.",
        "source": "X10n0250_010:0124c05_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏覺性圓明故但云心沒賴耶名〕但取在觀不執云沒不云捨由出觀同凡故問無垢識是佛果位既出觀同凡何故配同耶答由觀成同佛故問佛果位中應云智何故名心耶答由出觀同凡故。",
        "translation": "[Commentary on the Awakening [Abode]: Therefore, it's only called the mind without the name ālayan.] But it's taken from contemplation, not attachment, and it's called absence and not equanimity because it's produced from contemplation and is the same as the worldling.",
        "source": "X10n0250_010:0124c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔無垢識〕演義(二十八)云唐三藏云第九阿摩羅識此翻無垢是第八異熟識至成佛時轉成無垢識無別第九今云。",
        "translation": "The [undefiled consciousness] theory (28) says that the Tang Tripiṭaka says that the ninth amala consciousness, which is translated as undefiled, is the eighth ripening consciousness that transforms into the undefiled consciousness when it becomes a buddha, and there's no distinct ninth.",
        "source": "X10n0250_010:0124c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔慈恩〕者非基師也(門論疏中稱唐奘為慈恩)。",
        "translation": "This [Cien] is not a fundamental teacher (Tang Zang is called Cien in the commentary to the Monks' Treatise).",
        "source": "X10n0250_010:0124c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔今更會之〕下方是圭山之言所釋意同演義。",
        "translation": "The following [now furthermore] explains the meaning of what Guishan said, which is the same as the evangelist's explanation.",
        "source": "X10n0250_010:0124c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔含第七以釋見塵〕大鈔云據見塵之體含我我所通以八含七以六含七二義若據立名意唯約我所即唯以六含七一義若大疏又合本出體即以七合八謂轉相是所執七是能執合為此見不帶我所然非釋名又合末出體以七合六為此見塵見塵意識緣境時必內依末那為染污而得生起故然起信說梨耶三細已便云以有境界緣故生六種相即意識(前六)無別別取六塵故一體成多用也亦名分別事識能分別過現未來種種事相故楞伽亦爾彼經有三種識一真識即自性清淨心二現識即第八現相三分別事識即前六彼經自釋云攀外境界名為事識即知事識不是末那清涼釋云現即第八餘七皆名分別事識今疏依賢首起信疏然賢首謂無體故不克局第七但云分別事識清涼約別義含於七故雖取八識備足而說亦無別第七之體二釋亦不相違或合轉相為見塵謂以七合八合本出體也或以七合六為見塵謂合末出體也正緣義勢含隱故今但約能攀能起義以釋見塵(同清涼)但約所攀所起事識非末那也(同賢首)良由六七非即非離故前後相望少差然彼經起信今經皆不別出末那體者賢首說有二意故一如前說六八必俱(八起必與末那相應六起必內依七)二無明動真心成賴耶現識為因六塵為緣起執染淨第七俱無此義故不別說亦可計我則合轉相(計內為我屬梨耶即以七合八)計我所則合於事識(計外為我所屬六塵即以七合六)第七但是第六細分無別體故不別立末那唯七種識也。",
        "translation": "[Containing the seventh to explain the view-dust] The Dasho says that according to the essence of the view-dust, it contains self, self, and what is shared by the eight containing seven and the six containing seven in two senses.",
        "source": "X10n0250_010:0124c17_2",
        "is_bad_quality": true
    },
    {
        "source_sentence": "〔第七一向內緣〕成唯識但排頭各各分折八箇心識行相故別出第七各別出體六七體六七有異起信前七但第八差別功能然性宗有二意一遮即前說是也二許如本論亦立五末那即三細二麤是也謂業識末那云云后四麤方為分別事識依此不妨還立八種識但別七是第八差別功能無別體也以皆依第八轉故八是本識前七是轉識雖有七八竝是一真心體約分離義約六識各別依根取境故有見聞等名故云約八離義然但是釋見聞等名非是釋見塵等義。",
        "translation": "However, the nature school has two meanings: one is to refute the prior explanation; the other is to acknowledge that the present treatise also establishes five manas, which are three subtle and two coarse, meaning that the manas of karmic consciousness and the subsequent four coarse aspects are discriminated phenomenal consciousnesses.",
        "source": "X10n0250_010:0125a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔我心計執〕能執本是第七計內為自我今取即是第八見分故云帶八以釋見塵即第八是見塵之體非第七也。",
        "translation": "[The imagined attachment of the self] that's originally the seventh imagined self is now grasped as the eighth aspect of views, so it's called the eighth aspect that brings about the interpretation of the view of the dust, which is the eighth view of the essence of the dust and not the seventh.",
        "source": "X10n0250_010:0125b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔見一切色相〕亦是第七計外為我所今取計外即屬六塵是第六細分故云帶六以釋見塵依此則第六見塵之體亦非第七也即見等是塵非別有見塵之體此見等塵之體即是我執之心。",
        "translation": "[Seeing all things in form] is also the seventh thing that's imagined to be external to the self, but now it's imagined to be external to the sixth subpart, so it's called the sixth subpart, which explains that the sixth object of the view is also not the seventh, that is, views and so forth that are objects and not the objects of separate views. The object of such views and so forth is the mind of self-attachment.",
        "source": "X10n0250_010:0125b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏不離根境識三而有別體〕科云收別為總大鈔云根字七為第六根也境字我我所也識字帶六七也謂見塵等體不離此三。",
        "translation": "[Commentary: Not separate from the three and have separate bodies of faculties, objects, and consciousnesses] The text collects the separate into the general, and the Dazhuan says that the word faculties and the seventh are the sixth faculty, the word objects, the word self, and the word consciousnesses, which carries six or seven bodies, meaning that the three are not separate from the bodies of views, dust, and so forth.",
        "source": "X10n0250_010:0125b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏但牒見字〕科云正釋六根有謂當以下餘二字牒科此悞也今謂若爾有二不可一前收別為總科中者不得比文二次科既以根清淨故屬正釋六識今何不以見清淨故屬正釋六根耶前後經文皆以躡前起后竝為正科故。",
        "translation": "[Commentary: Only the word view] The section says that the correct explanation of the six faculties is that the other two words below the section should be taken in this way. Now, if that's the case, there are two things that can't be included in the general section: one is to gather the distinctive aspects into a general section, and the other can't be compared to the second section.",
        "source": "X10n0250_010:0125b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏四大所造淨色為體〕經眼根至身清淨即清淨四大五色根也此即勝義根以四大所造有對不可見淨色為體謂色香味觸合四大總八微為體揀異浮塵根也浮塵根者如蒲萄朵者是色聲香味觸染色為體浮根四塵即見聞覺知今清淨四大所造之四塵即色香味觸問今云眼根等清淨勝義根清淨邪浮塵根邪答即勝義根以勝義根清淨故浮塵根必清淨然浮塵根但是門戶見聞覺知即勝義根如人已死浮塵根離在勝義根不在故不能見聞等雖有勝義根亦假浮塵根為緣故方能見聞等如此根損則不能見聞耳。",
        "translation": "[Commentary on the Sutra on the Purification of Form Created by the Four Great Powers] The sūtra on the purification of the eye faculty and the body is the purification of the five form faculties of the four great powers, which are the purification of the five form faculties. This is the ultimate faculty because the four great powers create oppositely invisible pure form as their essence, which is form, fragrance, touch, and the eight subtle elements of the four great powers. The four objects of the four floating faculties are views, smells, perceptions, and perceptions.",
        "source": "X10n0250_010:0125b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏意根即第七識等〕六七同體故取緣內為第七識(意即識持業釋)攀外境時名第六識(意之識依主釋)雖前六皆依第七轉前五各有所依根故唯第六獨依第七名為意識能依之識依所依根得名問能依依所依名意識即依主釋者眼等何不然邪答意之識言雖依主釋是帶持業之依主亦名帶體依主如金之環等眼等是異類依主如父之子等又所依別故前五起時依眼等根第六起時內依第七染汙根故演義云前五依色根第六依染汙根七八互依即此義。",
        "translation": "[Commentary: The mind faculty is the seventh consciousness, etc.] The sixth and seventh are the same in essence, so when they take the internal object, it's the seventh consciousness (the mind is the consciousness that holds the interpretation of karma), and when they climb to external objects, it's called the sixth consciousness (the mind's consciousness depends on the lord's interpretation).",
        "source": "X10n0250_010:0125c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔眼如蒲萄朵至未詳是否〕蒲萄朵卷樺皮等狀浮塵根有人將此為勝義根者應同時之輩意不許之不欲指名。",
        "translation": "[The eye is like a puṣpadantī; it's not clear whether] a puṣpadantī with birch skin and other forms of floating dust is considered by some to be the ultimate root, and those who think it's the same should not approve of it or wish to designate it.",
        "source": "X10n0250_010:0125c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔準前楞伽起信等意〕大疏鈔在前所引故云準前今當用後字辨疑悞云合云準後或謂次文就本科中唯引起信不引楞伽亦不可云準後今謂在後通妨釋中。",
        "translation": "[Cf. the former Laṅkâvatāra, etc.] The commentary is cited earlier and therefore it's called Cf. the former. Now we should use the word later to clarify doubts and say it's combined with Cf. the latter.",
        "source": "X10n0250_010:0125c14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔初云隨六〕或云多却初云二字今謂不多由初科總標隨根隨境次科釋義唯約隨根得名故曰初云然釋顯心清淨云有八識今唯七者同楞伽起信本識事識之外無別末那故。",
        "translation": "Some say it's more than six, but the first two words are not many. The first part of the explanation generally refers to following faculties and following objects, and the second part only refers to following faculties to get the name.",
        "source": "X10n0250_010:0125c17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔乃至名青等〕脫一識字大鈔云名青等識注基師彼依瑜伽約未自在位說隨根隨境之別青等者色識乃至法識色中又分青黃等應云青識黃識等然大鈔只說色識乃至法識也。",
        "translation": "[even the consciousness named blue and so forth] is taken out of the vocabulary of the one consciousness, and the Dasho says the consciousness named blue and so forth Note: Jijiji relies on the yoga to explain the distinction between following the faculties and following the objects.",
        "source": "X10n0250_010:0125c21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注此第七轉〕即八轉聲中第七補盧鎩(所戒切)是所依聲如客依主謂依根方有識等。",
        "translation": "[Note this seventh turn] That is, the seventh of the eight turns of sound, which is the sound of the dependency, like the guest depending on the subject, which is the dependency of the faculties in order to have consciousness.",
        "source": "X10n0250_010:0125c24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注此第三轉〕三補盧崽(所皆反)拏是能作具聲如由斧破故云具也眼根是眼識之具度故(演義三十四)。",
        "translation": "[Note this third turn] The three pauloścara (socalled) nāna is the sound that produces the full set of sounds like the axe that breaks through, so it's called the full set. The eye faculty is the fulfillment of the eye consciousness (Yanyi 34).",
        "source": "X10n0250_010:0126a02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔迦末羅病〕亦云迦摩羅即今之大風惡病由眼黃故境亦隨根所轉故知境無定色。",
        "translation": "[Kāmalā's disease] is also called kāmalā, which is the present-day bad wind disease caused by the yellow eye, so the object also follows the transformation of the faculty.",
        "source": "X10n0250_010:0126a04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔此謂生依非染汙依及根本依引發依也〕此即第三屬根之識隨逐於根而得生故名為生依次文如次揀異七八及前第二根所發識。",
        "translation": "This is the third consciousness that's dependent on the faculties and doesn't depend on defilement or the faculties that give rise to it.",
        "source": "X10n0250_010:0126a05_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔此如何等〕問答或曰只消釋義而已不必加諸問答今謂此何等者六種子隨七種子生非隨色種子生如何齊等邪次以識託根生例難色依識變答以內外不同不可為例然識是所生故隨能生起得名意識色是所變屬於塵境如何為例難依此則似不當設難但以辨明義理故當然矣。",
        "translation": "[How are these] questions and answers, or they may say that it's just explaining the meaning and there's no need to add more questions.",
        "source": "X10n0250_010:0126a08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔由根含識有所領納令根損益〕損漏故名損成無漏故名益。",
        "translation": "[Because the faculties contain consciousness and have appropriated it, the faculties gain and lose.] Because it's contaminated, it's called loss and because it's uncontaminated, it's called gain.",
        "source": "X10n0250_010:0126a14_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔如第六識俱無漏故第七損有漏成無漏故〕七無漏時必由第六無漏故。",
        "translation": "When the seventh is uncontaminated, it must be because the sixth is uncontaminated [because the sixth consciousness is uncontaminated and the seventh is uncontaminated because it loses contaminants and becomes uncontaminated].",
        "source": "X10n0250_010:0126a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏非彼色法定是有情〕根識唯內攝是有情也簡色法屬外非是有情定者決定謂決定非是有情大疏云非彼色法定是無情者悞也若云色法非是無情應是有情邪又若云非定是無情應亦通有情與根識如何科簡邪或取大疏而非此者不知其可也。",
        "translation": "[Shu not that form is defined as sentient] The faculties and consciousness are only internally included in sentient beings, but form and dharmas that are external are not sentient and determined means they are definitely not sentient.",
        "source": "X10n0250_010:0126a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏依心意意識轉故〕雖帶七八而釋本意唯釋前六也心即第八意即五意餘如疏釋若約次第說者前七依第八轉前六依第七轉前五依第六轉。",
        "translation": "Although it refers to the seventh and eighth [factors of consciousness], the original intention of the explanation is only to explain the first six, which are mind and the eighth factor, and the other five factors of consciousness, as explained in the commentary.",
        "source": "X10n0250_010:0126a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏分別六塵名為意識〕依未自在位六根別別緣境故若自在位佛地論有二義一至初地六根互用自在以初地無漏五識現前故二佛地方至作佛時成所作智方起故又有一義八地已去互用自在以八地已上煩惱不作行純無漏故此五前三合八後二合六。",
        "translation": "If there are two meanings in the Buddha-stage theory, the first one is that the six faculties in the first stage are uncontaminated and the five consciousnesses are present, so the second is that when the buddha stage arrives, the knowledge of what's accomplished only arises, and there's another meaning: the eighth stage and onward are mutually beneficial because the afflictions, non-activities, and pure uncontaminatedness above the eighth stage are the five first three combined with the eight, and the two last with the six.",
        "source": "X10n0250_010:0126a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏云意即五意〕謂依論中標五末那也鈔合五意歸前後依彼牒釋末那無體故具在次前含第七釋見塵處各例於餘四經既牒覺塵猶云餘四者鈔牒聞塵為例故即聞塵耳根耳識各例於餘四也其見等唯四謂見聞覺知已由覺塵攝嗅甞觸三故續次應云覺清淨故鼻根清淨根清淨故鼻識清淨識清淨故覺塵清淨覺清淨故舌根清淨根清淨故舌識清淨乃至知塵清淨知清淨故意根清淨等前科見塵疏云聞覺等例此鈔云以見塵例指餘五今云聞塵例餘四謂三覺一知也或云覺塵清淨是第七識故牒也又云舌云甞身云觸意云知既云聞塵亦例於餘四明知具於六也却不出鼻根不云嗅塵之意又指覺塵為第七識者餘豈不然邪亦非多著覺塵。",
        "translation": "Since the sūtras explain that the five mental states are labeled in the śāstra as the five manas, the commentary combines the five mental states into the prior and subsequent explanations based on their explanation that the manas have no essence and therefore are included in the next seventh explanation of the position of the sense-fields, the other four are examples in the sutra. Since the commentary explains that the sense-fields are examples, the commentary explains that the hearing-fields are examples in the other four, that is, the hearing-fields, the auditory faculty, and the auditory consciousness are examples in the other four.",
        "source": "X10n0250_010:0126b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏故論及此經等〕今以前科出經不立末那之意此科引例義頗隱晦若大疏云此經所例心法無別末那即出經意次云起信楞伽即引例文義顯然。",
        "translation": "Now, the meaning of the preceding section, which refers to the sutra that doesn't establish the meaning of manas, and this section, which refers to examples, is rather obscure.",
        "source": "X10n0250_010:0126b19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔以依心意意識轉故等注云相是六塵也〕然此五字或云多却今謂此句屬意在前復生六種相簡非末那也六種相即是六塵正是前六識所分別之境合於此注如次前疏云意意識轉故鈔云雖帶七八而釋本意唯釋前六即是此義也辨疑悞云當於次前非末那之行相下注之今謂彼是行相恐不敢當此經也。",
        "translation": "However, these five words may be interpreted as many, but now we say that this phrase refers to the six forms that arise again before the mind, which are simply not manas. The six forms are the six dust particles, which are the objects discriminated by the prior six consciousnesses and are combined in this commentary as in the previous commentary, which states that the mind is transformed by the thinking consciousness, and the commentary states that although it contains seven or eight, the original intention of the explanation is to explain only the prior six, which is the meaning.",
        "source": "X10n0250_010:0126b22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注舉麤顯細〕不舉業識而舉現識者釋論云率上達下舉麤顯細也。",
        "translation": "[Commentary: Raising the coarse to reveal the fine] He doesn't raise the karmic consciousness but the present consciousness, as the Śākyamuni says, because he's a leader who reaches up and raises down, he raises the coarse to reveal the fine.",
        "source": "X10n0250_010:0126c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注不克體局第七〕多却體字以第七無體故不配之故云不克體局第七。",
        "translation": "[Note: doesn't grasp the essence of the seventh] It's because the seventh has no essence, so it doesn't match it; therefore, it's called not grasping the essence of the seventh.",
        "source": "X10n0250_010:0126c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注前云〕辨疑悞云合轉相之說大鈔不說不當曰前云應曰次云今謂前云者雙通前文二義以七合八合本出體以七合六合末出體前字斷不可改也。",
        "translation": "[Note Ex-un] It's doubtful that the teaching of combining, changing, and manifesting is not explained in the main text, which says it's improper to say ex-un and should say second-un. Now, this is called ex-un because it's a combination of the two meanings of the previous sentence.",
        "source": "X10n0250_010:0126c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注攀外境界名為事識〕或曰當依大鈔云起前事識今謂若釋名為事識若釋生起之義云起前事識每常多見通用恐是校勘之悞今既釋第六之名揀異第七當以今鈔為正何者如清涼云起前事識第七亦在其中故。",
        "translation": "Some say it should be based on the fact that the Dazhuan says the arising of the prior object consciousness. Now, if the explanation is called the object consciousness, and if the explanation is based on the meaning of arising, then the arising of the prior object consciousness is often seen in common, I'm afraid that's a revisionist's answer.",
        "source": "X10n0250_010:0126c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注以釋見聞等塵〕或曰前唯說見塵多却聞等二字今謂前釋見塵義含具故疏云下聞覺等例此也又指聞塵耳根等云上皆釋竟故知聞等二字不多也。",
        "translation": "[Commenting on the explanation of the dust of seeing and hearing, etc.] Some say that the previous explanation was limited to the dust of seeing but included the two words hear and so forth.",
        "source": "X10n0250_010:0126c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔又說六麤〕或曰當依大鈔云六塵今謂大鈔悞也前云由第六緣外正是六塵此正約起信說合云六麤若曰不然文相重繁也六麤六塵義雖俱通今以文相簡之當云六麤何者今鈔初義出不別立末那之意有三一相應第八故二第六緣六塵依第七故三六麤所起亦依第七故若云第三意亦是六塵既已說意何必重言耶。",
        "translation": "[Also, the six coarse aspects are explained] Some say they should be explained in terms of the six coarse aspects in the earlier commentary, but this commentary refers to the six coarse aspects in the context of the sixth condition, and this commentary refers to the six coarse aspects in the context of the arising of faith.",
        "source": "X10n0250_010:0126c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔今此經論等本不是欲解釋〕釋字下脫諸識二字當依大鈔辨疑悞云大鈔通釋此經楞伽起信順流返流故云今此經論等此鈔唯約當經只合標云今此經本不等多却論等二字謂疏中已具正不多也又疏中相躡生起等八字疏意正約今經楞伽起信相躡生起無第七義故不立末那對簡唯識分折八識行相故立末那也但以今鈔唯就當經觀行躡起而說其楞伽等義影略之耳雖今經約觀行返流說楞伽起信約順流說其生起論經不說第七皆不別故。",
        "translation": "The two words Śākyamuni and others are not intended to be interpreted. Under the word Śākyamuni, the two words Śākyamuni and others are taken out of the context of consciousness, and the two words Śākyamuni and others are used to explain the sūtras, Laṅkâvatāra, faith, following currents, and returning currents.",
        "source": "X10n0250_010:0126c23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經根清淨〕應云識清淨故今云根者必具識也。",
        "translation": "[The sūtra's faculties are purified] It should say that consciousness is purified; therefore, those who say the faculties must have consciousness.",
        "source": "X10n0250_010:0127a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏亦云六境此通凡聖〕塵坌污義坌污心識約凡說今云通凡聖者既云色塵清淨等故通聖境。",
        "translation": "[Commentary also states that the six objects are [here] shared with the worldling and the sage] because the meaning of \"defiled body\" and \"defiled mind\" are discussed in terms of the worldling, it's now stated that they are shared with the worldling and the sage because form and dust are pure.",
        "source": "X10n0250_010:0127a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注聲香味觸〕辨疑悞云合云色香味觸此四微故聲非報分又不恒有故今鈔悞也今謂此即外境六塵合云聲香味觸是無見有對色非色香味觸也良由色法有十一疏中釋眼所取有見有對色已鈔中唯釋無見有對色九種(五根四塵)及法處無見無對色有志詳諸。",
        "translation": "[Note: Sound, Smell, Aroma, and Tactile] [Commentary: Sound, Smell, Aroma, and Tactile] doubtful, it's said that these four subtle elements are combined, so sound is not part of the retribution, and they don't always exist; therefore, this commentary also refers to the six external objects, which are combined as sound, smell, taste, and tactile, which are invisible, have opposable forms, and are not form, smell, and tactile.",
        "source": "X10n0250_010:0127a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注因賴耶執受等〕以賴耶中根身器界分因執受因不執受之別謂內外四大種之異此即根身種子內四大有情之聲也。",
        "translation": "The distinction between the laya in which the faculties, body, organ, and elements are caused, acquired, and not acquired refers to the difference between the four major internal and external varieties, which are the four major sounds of sentient beings within the faculties, body, and seeds.",
        "source": "X10n0250_010:0127a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔唯意所取乃至法處等〕大疏云百法中唯除五塵餘皆是法也(依此取九十五法)大鈔云百法論以餘法各有名位故但舉法處所攝唯八十二以十七界(十八界中除法界)已攝十八故(五根五境及八識此之十八各有名位故唯八十二)今唯以六塵所攝故但除五塵餘皆總取即九十五也若直就第六心境能緣所緣而言之即九十九法皆是意之所緣法(上皆大鈔)然大鈔三意於中第三意正釋大疏今疏云唯意所取法塵一境通於一切謂攝九十五同大鈔第三義以疏中前已配五塵故若詳今鈔牒疏釋義應疏中傳寫脫文今試於疏一切之下補云百法中九十五法皆名法處所攝色然鈔中又順百法論所釋於百法中除十八各有名位唯八十二於中又除八十一有表色法其法處唯攝無表色一法而已良由經說六塵清淨故大小疏唯除五塵皆以意所取法通九十五法以順經文六塵清淨之義辨疑悞云今鈔與大小疏歒體相違應後人將鈔改之也議曰今鈔於大鈔三義中取次義釋疏已又取初義以順百法論復於八十二中唯取無表色也若非疏主自意後人焉敢若此邪。",
        "translation": "The great commentary says that of the one hundred dharmas, only the five dust particles are included, and the rest are all dharmas (ninety-five dharmas are included here). The great commentary says that the one hundred dharmas are included in the seventeen elements (except for the dharma element in the eighteen elements), so the eighteen elements (the five faculties, five objects, and eight consciousnesses have their own names and positions, so only the eighty-two elements) are included in the six dust particles.",
        "source": "X10n0250_010:0127a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經六塵清淨故地大清淨〕上明根識境已今明能造內外四大從麤至細從重至輕以為次第。",
        "translation": "After the above explanation of the faculties, consciousnesses, and objects, we now explain that the four elements inside and outside the body are created in order, from coarse to fine, heavy to light.",
        "source": "X10n0250_010:0127b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經十二處〕古云十二入以根境相入故六根亦稱六入唐三藏恐濫境實能入根故改云十二處即識所入之處今疏云十二處謂此十二是生識處故亦云十二門是心識出入之門故(疏云處具生義門義)。",
        "translation": "The ancient saying is that the twelve sense-fields are the sense-fields, so the six faculties are also called the six sense-fields. The Tang Tripiṭaka was afraid that the sense-fields could actually enter the faculties, so it changed the saying to twelve sense-fields, which are the sense-fields of consciousness.",
        "source": "X10n0250_010:0127b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏意識常昏〕約凡夫位說由根塵相入故。",
        "translation": "The commentary [on the constant darkness of consciousness] states that it's caused by the mutual entry of sense faculties and dust, depending on the level of the worldling.",
        "source": "X10n0250_010:0127b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經十八界〕根與識為界非眼與耳界也問根識境三前已清淨何故重說十二處十八界邪答約所樂所迷等別故如疏前為六二解(十二處)。",
        "translation": "[The eighteen elements of the sutra] are elements of sense and consciousness, not elements of the eye and ear. He asked why the twelve sense-fields and eighteen elements were explained again when the three sense-consciousness elements had been purified previously.",
        "source": "X10n0250_010:0127b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏此是六三觀之治我執兼之五蘊即具三科云中外合成等〕經文即五蘊義故此中略之若諸經別列三科重說者大鈔(十四末)云有二意故一三根所樂不同故二三根所迷不同故初所樂不同者為上根樂略唯說五蘊不假分折頭數即解界處為中根唯說十二處即解蘊界為下根具說十八界方解諸法又上根能廣領解為說十八界中根十二處下根稍鈍不能領解且說五蘊二所迷不同者上根上迷心所(五蘊中三)不迷色心故(五蘊初後)唯說一色一識故說五蘊中根不迷心及心所上迷色法故唯斷將色開作十一說心所一向不說於心唯說一意故說十二處下根不迷心所俱迷色心故開色為十種半(五根五境及法界半分受想行蘊即法界半分含在七心中)開心為七(六識及意)故說十八界。",
        "translation": "The sūtras refer to the meaning of the five aggregates, which are comprised of three categories, such as the external and external compositions, and so forth.",
        "source": "X10n0250_010:0127b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏種族義故〕如色有多種六根六識六塵各為一類等族即類也。",
        "translation": "[Commenting on the meaning of categories] Just as there are various kinds of form, the six faculties, the six consciousnesses, and the six dusts are each classified as a type, so are these families, or categories.",
        "source": "X10n0250_010:0127c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔第四禪中第四天分為二路〕此上脫淨居唯聖者一句此句牒疏大鈔有之第三天分一岐路今云第四者即以無想天為第四(然不若云第三亦通云第二)如楞嚴經云於第二福愛天分二岐路一直法路即至第三廣果天不入第四無想天直入五那含天謂無煩天至色究竟天二迂僻路於第二福愛天即入第四無想天不入廣果五那含便入無色天或入廣果天而不入五那含皆凡夫外道便無色還受流轉又於五那含第五色究竟天分二岐路一出三界路即迴心人履二入無色路即定性人履彼疏九之一。",
        "translation": "The fourth heaven in the fourth dhyāna is divided into two paths, and this sentence refers to the third heaven in the commentary, which is divided into one wrong path. The fourth one is now called the fourth one, which is the fourth one in the formless heaven (though it's not like the third one is also generally called the second one).",
        "source": "X10n0250_010:0127c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔一凡二聖〕此下脫凡即無想天一句大鈔有之。",
        "translation": "The next [one worldling and two sages] are liberated from the worldling, which is the non-conceptual heaven, as discussed in the great commentary.",
        "source": "X10n0250_010:0127c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔若要廣解即檢大鈔〕辨疑悞云大鈔不和會又指在補闕卷中今謂鈔中但云若要廣解即撿大鈔豈當連上文讀之而曰不然邪況大鈔亦釋名辨相具釋其義豈所指不當乎如彼具云諸經論皆先舉所知之境然始以能知智力連之立名或便云智或便云力或具云智力列名者一智諸法是處非處智力二知三世業報智力三知諸禪解脫三昧智力四知諸根勝劣智力五知種種欲樂智力六知種種界智力七知一切智處道智力八知宿命無礙智力九知天眼無礙智力十智永斷習氣智力然彼釋甚廣已見廣解之相。",
        "translation": "[If You Want to Understand Extensively, You Should Review the Taqao] Bianhu doubts that the Taqao doesn't harmonize with it and refers to it in the supplemental volume. Now, we say that the text only says that if you want to understand extensively, you should review the Taqao, how could you read it together with the above text and say otherwise? Besides, the Taqao also interprets names, discerns characteristics, and fully explains their meanings, how could it be that it refers to improper interpretations? For example, it's explained that all sūtras and treatises first cite the cognitive sphere of knowledge, but then they connect it with the power to know it by naming it either as knowledge, or as power, or as the power to list names.",
        "source": "X10n0250_010:0127c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏無因惡因〕無因是自然惡因即雞狗戒等。",
        "translation": "[Commentary on Uncaused Evil Causes] Uncaused are naturally bad causes, such as the precepts for dogs and cocks.",
        "source": "X10n0250_010:0128a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏三昧垢淨〕謂愛見等是世間禪即有漏淨謂不雜愛見等是出世間禪即無漏。",
        "translation": "[Commentary on the Samādhi Defilement and Purity] This refers to worldly meditation that's contaminated and pure, and this refers to unadulterated love and view that's transmundane meditation that's uncontaminated.",
        "source": "X10n0250_010:0128a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏知一切道至處〕善惡漏無漏行所至處名之為道道即善道惡道聖道隨念所趣佛悉知之。",
        "translation": "[Commentary on Knowing All the Places to Which the Path Leads] The places to which good, bad, contaminated, and uncontaminated actions lead are called paths, which are good paths, bad paths, noble paths, and the destinies of mindfulness, which the Buddha fully knows.",
        "source": "X10n0250_010:0128a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔處是建立義是依義然建立果等〕依義下脫起義二字又然字即能字故大鈔云言處者建立義依義起義能建立果與果為依能起果法故知處者具建立依起三義也以大鈔為正。",
        "translation": "[The place is established, the meaning is based on the meaning, and then the result is established, etc.] The word based on the meaning is liberated from the two words that give rise to the meaning, and the word 'cause' means 'effect.' Therefore, the great commentary says that the place is established, the meaning depends on the meaning, the effect is produced, and the result is established, and the result is based on the effect that is produced.",
        "source": "X10n0250_010:0128a16_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔故云處也〕大鈔云故立處名義俱可通。",
        "translation": "[Therefore, it's called a locus.] The Dasho says that therefore the names and meanings of the established locus are both generalizable.",
        "source": "X10n0250_010:0128a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔有漏學無漏學〕大鈔云有漏無漏學無學今鈔以二學字屬在漏無漏言之隨漏無漏之別若大鈔別作學無學言之學無學竝屬無漏出世間禪其義頗優又若以大鈔學無學屬在漏無漏言之與今鈔無別。",
        "translation": "[Contaminated training and uncontaminated training] The great commentary says that there's contaminated, uncontaminated training, and untraining. The present commentary says that the two kinds of training are in contaminated and uncontaminated contexts, following the distinction between contaminated and uncontaminated.",
        "source": "X10n0250_010:0128a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔八解脫〕即小乘定謂空無邊解脫識無邊解脫等。",
        "translation": "The [eight liberations] of lesser vehicle meditation are the liberation of emptiness without limit and the liberation of consciousness without limit.",
        "source": "X10n0250_010:0128a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔如禪中分別相說禪攝一切色界定諸解脫攝一切禪定等〕或云諸字即說字與上文說字義同然若據立名云諸禪解脫三昧智力以疏中諸字貫通禪與解脫竝用諸字亦得不妨又亦宛順若大鈔竝是說字不妨通立名之義亦通銷釋文相不若今鈔為優禪即四禪解脫即一切無漏禪或曰如釋中分別相說者即智論指出處今謂只就禪中別分相說也。",
        "translation": "[As in the discriminated aspects of meditation, it's said that meditation includes all form definitions, liberation includes all meditative concentrations, etc.] Some say that the words are words that are explained, but if the words in the commentary are used to designate the samādhi power of concentration, then the words in the commentary are used to refer to both meditation and liberation, and it's possible that the words are used together, and it's also possible to conform to the fact that the words in the main text are words that are explained, so it's possible to refer to the meaning of the designation and to the elimination of the interpretations.",
        "source": "X10n0250_010:0128b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔而離愛見等〕大疏鈔云不雜此云而義雖俱通不雜為優。",
        "translation": "[And free from craving and so forth] The commentary says it's not mixed, and this says it's superior even though the meanings are both shared and not mixed.",
        "source": "X10n0250_010:0128b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔分別名諸定中〕多一名字辨疑悞點對甚當然此所引直至名於轉治大鈔云竝是佛所知修禪之病亦具引彼論明行者於定應分行是行非行等。",
        "translation": "[Among the meditations that are named differently], there's one more name that discerns doubts and points to points of doubt, and it's quite true that the names cited up to the point of being called \"corrective\" are both known to the Buddha as the disease of meditation practice and are also cited in his treatises to show that practitioners in meditation should delineate what's practice and what's not practice.",
        "source": "X10n0250_010:0128b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔轉治不轉治〕此大鈔此下脫轉治二字若據結云若不爾者名不轉治反顯此即是轉治不須牒轉治二字亦得然若取名義俱備有則為優直銷文者婬欲人慈心觀名轉治婬欲人不淨觀名不轉治等。",
        "translation": "If we take the conclusion that if this is not the case, then it's called not-turning-treatment, which shows that this is turning-treatment and there's no need to include the word turning-treatment, we can also obtain it.",
        "source": "X10n0250_010:0128b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔散心中欲攝一心〕大鈔云沉沒心中欲攝心然沉沒心中欲攝心即轉治今鈔散字悞也又多一字若云散亂心中欲攝心不名轉治以大鈔為正也辨疑悞亦點對。",
        "translation": "[Scattering the mind and collecting desires in one mind] The Dasho says, \"The mind that sinks and submerges the mind and collects desires,\" but the word \"scattering\" in this text is an extra word, and if it's said to scatter the mind and collect desires in one mind, it's not called \"changing the mind.\" The Dasho is correct in terms of clarifying doubts and also clarifying points.",
        "source": "X10n0250_010:0128b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔及知生色界無色界及三乘果〕注云云大鈔問曰前明善惡不動業報(初門)不動即諸禪此何重說答前雖說定唯論業報今雖知垢淨唯明淨之體用謂初門處對非處第二捨非處之邪見唯論是處善惡定散業報之正見第三捨散唯說禪定禪定垢淨唯明淨之體用現神通等。",
        "translation": "[and knows that birth in the form realm, formless realm, and the result of the three vehicles] Commentary: The great commentary asks: \"The previous statement explains the results of good and evil immovable karma (first aspect) and immovable means the meditations.\" Answer: Although the previous statement explained concentration, only the results of karma, now although it's known to be defiled and pure, it only clarifies the essence and function of purity, meaning that the first aspect is to face the wrong place, the second is to abandon the wrong view of the wrong place and only discuss the right view of the results of good and evil concentrations and distractions, and the third is to abandon and distract only the concentration, meditation, and the defiled and pure concentration only clarify the essence and function of purity, such as manifesting psychic powers.",
        "source": "X10n0250_010:0128b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔入見諦道中知集因緣第八無漏心得斷見故〕初果人斷三界見惑十六心至第十五道類忍時名初果向至第十六道類智即入修道得第二果四諦各有四心苦諦四心者苦法忍智類忍類智(此是欲界之二合上二界亦二是為四心)集滅道各四心例之然今云第八無漏心者即當集諦第四心也(說苦諦四心故名八也)然至第十五心斷見道方盡今第八心只合云得斷道今云得斷見悞也(大鈔十七云或十六心俱是見道或已屬修道今取後義)。",
        "translation": "[Entering the path of the truth of knowing the causes and conditions of arising, the eighth uncontaminated mind attains stopping views because] a person in the first realization stops the delusion of views in the three realms with sixteen mental states up to the fifteenth path of type-attainment, which is called the first realization, and then goes on to the sixteenth path of type-wisdom, which is entering cultivation and attaining the second realization. The four mental states of the four truths are each four mental states of the truth of suffering (these are the two in the desire realm combined with the two in the upper two realms, which are also two of the four mental states).",
        "source": "X10n0250_010:0128c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注此後說者多是小乘外道等〕如實言者是佛沙門等作是言謂佛但知一路涅槃餘不知故指現事與因緣以問佛疑佛不知現事即山斤水滴等疑佛不知。",
        "translation": "Those who say this are mostly lesser vehicle non-Buddhists who say this is true are ascetics and others who say that the Buddha only knows the way to nirvāṇa and doesn't know the rest, so they point to present events and causes and conditions and ask the Buddha about them, doubting that he doesn't know the present events, meaning mountains and drops of water, and so forth, doubting that the Buddha doesn't know them.",
        "source": "X10n0250_010:0128c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注種種因緣〕謂種種差別因緣此後疑多是小乘外道之疑者指後乃至之文又此後者對前文正指所疑佛不知現事及差別因緣於中指差別因緣為此後以一路涅槃為佛所知。",
        "translation": "[Note that various causes and conditions] refer to various kinds of specific causes and conditions. This latter doubt is mostly the doubt of non-Buddhists in the lesser vehicle, which refers to the latter and even the following text. This latter text correctly refers to the doubt that the Buddha doesn't know the present things and the specific causes and conditions, and it refers to the specific causes and conditions as the subsequent way to nirvāṇa that the Buddha knows.",
        "source": "X10n0250_010:0128c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注諸天外道有此疑者〕前文是舉疑難乃至已下竝是答難故云佛不見是微畏相豈當此注邪諸天等八字決是傳寫之悞又文云乃至定應超簡其義耳若大鈔云至誠言安立等辨疑悞云當依大鈔。",
        "translation": "The preceding verse raises doubts and the following verse answers them. Therefore, it says that the Buddha doesn't see this characteristic of fearlessness, how could it be that the eight words \"mistakenly\" and so forth in this commentary are definitely a transmission of an evasion.",
        "source": "X10n0250_010:0128c16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注二句各如本文〕第二云我是盡諸漏及習言我漏盡等如疏云云。",
        "translation": "The second [note the two phrases as in this text] says I am the end of the contaminants and the habituation of saying I am the end of the contaminants, etc. as in the commentary.",
        "source": "X10n0250_010:0128c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔名是標舉〕大鈔云法是標舉然二俱可通。",
        "translation": "[The name is a designation] The Dasho says the teaching is a designation, but both can be interpreted together.",
        "source": "X10n0250_010:0128c22_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔法先義後〕禪源詮云先法後義即性宗先義後法即空宗云云然疏中法先義後亦指智論者指教義也若鈔中云智論先義後法以對華嚴等法先義後若爾鈔所釋與禪源詮符契。",
        "translation": "[Dharma First, Meaning Later] The Chan Source Exposition says that the Dharma first and the meaning later are the nature school, the meaning first and the meaning later are the emptiness school, but the commentary on the Dharma First, Meaning Later also refers to the Zhilun who refers to the doctrine.",
        "source": "X10n0250_010:0128c22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注此下不具引經文等〕大鈔於諸法自性注云諸法以法無我性為自性於諸法生滅注云諸有為法同以生滅為相謂同無性同生滅故然今鈔所注辨疑悞云古本無後人妄加大鈔甚當況後三段所引皆是經文與前無別今謂此說頗優或曰當云上下皆不具引簡異大鈔具引經文故今謂此說不然二鈔所引經文無別。",
        "translation": "[Note that the following doesn't contain quotations from the sūtras, etc.] The Dasho says that the self-nature of all dharmas states that dharmas take the self-nature of dharmas as self-nature, and that dharmas arise and cease states that all sentient beings share the same characteristic of arising and ceasing, which is that they are the same in naturelessness and arise and cease.",
        "source": "X10n0250_010:0129a02_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔又一法下三行相〕大經疏先標云此約時辨法三世遷流故云行相辨疑悞云疏中既曰法智此智正當彼第五智相經文今鈔不當云第三行相行字悞也今謂彼疏標第三約三世遷流今鈔中所行經文正是第三行相次經亦云第三豈竝錯邪然若依彼疏只云是則當世而知名法智即法無礙能知過未法差別即義無礙今疏鈔竝云法智此智者蓋轉顯法比二智耳正約三世分法義文中既帶能知故復顯能知之智非錯也或云今鈔法字下多却智字次文多比智二字少一義字者今謂不然豈疏與經皆鈔乎。",
        "translation": "[Also, the three defining activities under a single dharma] The commentary on the great scripture first states that this is a chronological discernment of the transmigration of dharmas over three periods, so it's called defining activities. It's doubtful that since the commentary says Dharma wisdom, this wisdom is precisely the fifth wisdom aspect of the sūtras.",
        "source": "X10n0250_010:0129a08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注一二三六七〕辨疑悞云三字當作五字謂正當三字其義以見次前彼疏十相每一相經文具四知一自相約總別分法義二同相約性相分法義三行相約三世分法義(現在是法過未是義)四說相約本釋分法義五智相約法類分法義六無我慢相約真俗分法義七大小乘相(今云一乘諸乘)約權實分法義八菩薩地相約十地體相分法義九如來地相約真應分法義十作住持相約能所說分法義又前三約所詮第四約能詮又前四約所知第五亦能知九十約果九約果體十約果用(疏六十五鈔四十八)大鈔具引十相今鈔從略故唯引五相以第三兼攝第五無礙智。",
        "translation": "[Note 1, 2, 3, 6, 7] To resolve doubts, the word three is replaced by five, which is precisely the meaning of the three words as shown in the previous commentary. The sūtras present four ways of knowing each of the ten aspects.",
        "source": "X10n0250_010:0129a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔莊嚴四無畏等〕十力是降伏魔軍四無畏是制諸外道四無礙智通而言之。",
        "translation": "The ten powers [of the adornment of the four fearlessnesses and so forth] are to subdue the armies of Māra, and the four fearlessnesses are to restrain the four non-Buddhist wisdoms in general.",
        "source": "X10n0250_010:0129b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏力等二乘有分此無分故〕大經疏云法比等智通大小乘故涅槃說唯菩薩有聲聞設有少故名無若就二智所觀竝通大小乘約能觀智唯局大乘鈔云涅槃第十六云聲聞無四無礙迦葉難佛若聲聞無者何以如來說舍利弗等有四無礙佛言如四河入海皆有無量水而言等海者無有是處即少故乃至得一得二得三不得四名無(疏鈔同前)然此不共因果分異唯佛有之因位俱不共也力等二乘有分等且約敵對二乘說故具如孔目不共法章。",
        "translation": "The Mahāyāna commentary says that the cognition of things like dharmas and so forth is shared by both the greater and lesser vehicles, so the Nirvana teaching is only for bodhisattvas and śrāvakas, and the knowledge of things to be contemplated is only limited to the Mahāyāna commentary says that the sixteenth section of the Nirvana says that śrāvakas have no four kinds of unhinderedness, and it's difficult for Kāśyapa to ask the Buddha if śrāvakas have no such thing.",
        "source": "X10n0250_010:0129b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏無不知已捨〕捨即捨受謂不苦不樂即是捨若云於種種因緣無不知已然後捨即是行蘊中行捨謂善十一之一也亦是七覺支中捨亦是四無量心中捨。",
        "translation": "[Commentary on Equanimous Equanimous] Equanimous means equanimous in feeling, which is neither painful nor pleasant, and equanimous when it's said that equanimous in the aggregate of conditioned phenomena is one of the eleven good equanimous factors, equanimous in the seven factors of awakening, and equanimous in the four immeasurable minds.",
        "source": "X10n0250_010:0129b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔注舍利弗等〕舍利弗演法分有無礙阿那律天眼分有十力弟子有能師子吼者分有無畏。",
        "translation": "[Commenting on Śāriputra and others] Śāriputra's portion of expounding the Dharma had the unhindered Aniruddha's divine eye portion had the ten powers, and his disciples had the fearlessness of the lion's roar portion.",
        "source": "X10n0250_010:0129b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔不退失故〕大鈔失字下有是名無不定心一句却無故字今有故字由是略之或云文脫不然也。",
        "translation": "[Because of this nonretrogression] The great commentary has the word 'loss' under the phrase 'inconclusive mind,' but the word 'therefore' now exists because it's omitted, or maybe the word 'Wenshuo' doesn't apply.",
        "source": "X10n0250_010:0129b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔欲界有定入定可說法故〕大鈔云論云復次欲界中有定入是定中可說云云故云無不定心今鈔從略例前可知然所疑有二謂佛既在定云何遊行云何說法是故答亦有二一佛於諸法實相中定不退失故不妨遊行二如來入定神通自在故不妨說法。",
        "translation": "[It's because there's concentration in the desire realm and entry into concentration that the teaching can be explained] The great commentary says, \"Furthermore, there's concentration in the desire realm and entry into concentration that can be explained in concentration, so it's because there's no indeterminate mind.",
        "source": "X10n0250_010:0129b23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔或捨眾入禪〕大鈔引智論云佛或時捨眾生入甚深禪定一月二月有人疑佛為度眾生故出世何故常入定佛言我種種因緣知故捨非是無知已捨云云。",
        "translation": "[Sometimes he might abandon the multitude and enter meditation.] The Dasho quotes from the Zhilun as saying that sometimes the Buddha abandons sentient beings and enters a very deep meditative concentration for a month or two, and some people wonder why the Buddha always enters meditation for the sake of liberating sentient beings.",
        "source": "X10n0250_010:0129c04_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏無見頂相等亦無與共如何不說〕約小乘不共而問小乘一百四十種不共法無見頂相等亦在其中故大乘不然俱以智慧功德為不共非論自然果。",
        "translation": "[Commentary: \"How is it not explained that there's nothing shared with the peerless equals?\"] The lesser vehicle asks about the 140 distinctive qualities shared by the lesser vehicle, and the peerless equals are among them.",
        "source": "X10n0250_010:0129c07_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔經三十七助道品〕道品因義此三十七當體是因義即助道也又助止觀是因義即正道因品即類也是正道因之流類又道是果義三十七助果故品者因為果類則菩提之流類故次云菩提分分亦因義通是三乘因法故問前云初修曰止觀修成曰定慧三十七中亦有定慧何故云助止觀深豈助淺邪答前是總門乃是正修三十七中雖有定慧是初方便故不同也或云若以義分有正有助約修不分能所三十七便為正道也然三十七總有七類前三資糧次二加行六是見道修道又大經疏約三宗說又地經謂是聲聞所修約寄位故今約通修也必三十七數者對治之法有所表故慈恩彌陀疏云耳。",
        "translation": "[Sutra 37: Chapter of the Way] Chapter of the Way is the causal meaning of the thirty-seven essences that are the causal meaning of the way, and Chapter of the Way is the causal meaning of the right way, and Chapter of the Way is the fruit meaning of the thirty-seven factors that aid in the fruit of the way because the fruit is the type of enlightenment that is the type of enlightenment, and the second part is the causal meaning of the factors of enlightenment that are the causes of the three vehicles.",
        "source": "X10n0250_010:0129c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔四念處〕注慧為體取類近名念不直名慧者以念寬通故謂通於染淨又是約修方便故未名慧也。",
        "translation": "The [four abodes of mindfulness] note that wisdom is the essence of the near-named mindfulness of type and is not directly called wisdom because mindfulness is broad and interpenetrating, which means it's interpenetrating defilement and purity, and it's about cultivating skillful means so it's not called wisdom.",
        "source": "X10n0250_010:0129c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔根等各一〕謂根力覺道之四也戒三者正語正業正命即八聖道中三也疏四念處觀身受心法配五蘊則一是色二是受三是識四是想五行五蘊不次者依所治從淺至深故由我最深故在後也念處次第具如前文。",
        "translation": "The four abodes of mindfulness are observing the five aggregates of body, feeling, mind, and dharmas, one being form, two being sensation, three being consciousness, and four being perception, the five elements, and the five aggregates are not sequential, but are governed by the principle of going from shallow to deep, so the self is most profound and therefore comes last.",
        "source": "X10n0250_010:0129c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏觀身不淨等〕此約相觀世俗通大小乘修等。",
        "translation": "[Commentary on Observing the Body as Impure, etc.] This is a conventional observation of characteristics that applies to the cultivation of both large and small vehicles.",
        "source": "X10n0250_010:0130a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏觀身畢究空至對治二乘四倒〕此約大乘觀性空等通後四教上三段竝如一味。",
        "translation": "[Commentary on Contemplating Body as Pūrva-Void to Counteracting the Four Errors of the Two Vehicles] This refers to the great vehicle's contemplation of emptiness in nature and so forth, which passes through the last four teachings, the three paragraphs above being of the same flavor.",
        "source": "X10n0250_010:0130a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏觀謂慧也〕四神足是定何故云慧此是定中之意。",
        "translation": "[Commentary on Observing Emptiness as Wisdom] The four miraculous powers are concentration, so why is this called wisdom? This is the meaning of concentration within concentration.",
        "source": "X10n0250_010:0130a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏勤過散亂〕四勤散亂大過故須定制正敘此科來意耳。",
        "translation": "[Commentary on Effort, Excess, and Distraction] The four kinds of effort and distraction are so great that they need to be tailored to correctly describe the meaning of this section.",
        "source": "X10n0250_010:0130a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔已識別名〕有云識字悞當云已釋然當用釋字。",
        "translation": "[Having known the distinctive name] There's the word consciousness, which should be interpreted as having understood, but the word interpretation should be used.",
        "source": "X10n0250_010:0130a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏七覺支〕覺謂覺了七種皆是自體而差別者覺為自體餘六皆覺支分覺即擇法一支數有七謂念擇法精進喜輕安定捨捨即行捨是善十一之一非捨受也若瑜伽云已證入正性離生補特伽羅如實覺慧用此為支故名覺支(即見道位具如大鈔)。",
        "translation": "[Commentary on the Seven Branches of Awakening] Awakening means to understand that the seven kinds of awakening are all essences, but the other six are branches of awakening. Awakening is the essence, and the other six are branches of awakening. Awakening is the selection of qualities, and there are seven of them, which are mindfulness, selection of qualities, effort, joy, desirousness, equanimity, and equanimity, which is the practice of equanimity and is one of the eleven good qualities, not the feeling of equanimity.",
        "source": "X10n0250_010:0130a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏八正道〕正即聖也亦名八聖道為斷修道諸煩惱故。",
        "translation": "The eightfold correct path is also called the eightfold noble path because it ends the afflictions of cultivation.",
        "source": "X10n0250_010:0130a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏正止舉相〕止治掉故不容於掉舉舉治沉故不容於惛沉八正道者離於八邪謂邪見邪思惟語業命精進念定是為八也成正見正思惟等開通涅槃是解脫分善在修道位。",
        "translation": "The eightfold right path is free of the eight evils, which are wrong views, wrong contemplations, speech, action, life, effort, mindfulness, and concentration.",
        "source": "X10n0250_010:0130a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "〔疏上之七類〕辨疑悞云科云總明次第悞也合於上文大科中作第四科總明次第庶得文理宛順不當附在第七釋正道中然此所辨不亦有理也今謂附在釋正道科中上下文多有此例。",
        "translation": "The [seven categories in the above commentary] explain doubts and comments, saying that the section is a general explanation of sequence, and that it's also a general explanation of sequence that fits within the major section above, so that the text and principle are in accord with each other and are not appended to the seventh explication of the correct path.",
        "source": "X10n0250_010:0130a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓覺疏鈔隨文要解卷第十",
        "translation": "Subcommentary to the Subcommentary to the Compendium of the Great Commentary on the Sutra of Perfect Enlightenment, Volume 10",
        "source": "X10n0250_010:0130a24_0",
        "is_bad_quality": false
    }
]