[
    {
        "source_sentence": "首楞嚴經集解熏聞記卷第二",
        "translation": "Shoulengyan jing ji jie fumeng ji vol. 2",
        "source": "X11n0269_002:0719b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吳興沙門　仁岳　述",
        "translation": "Wu Xing shaman Rengyue narrates",
        "source": "X11n0269_002:0719b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起第二卷",
        "translation": "to produce a second volume",
        "source": "X11n0269_002:0719b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明性無生滅分三一密請。",
        "translation": "The second aspect of understanding the nature of nonarising and non-cessation is divided into three parts: a. Secret invitation; b. Vowing to hear; c. Silence; d. Not Knowing; e. Not Knowing; f. Not Knowing; g. Not Knowing.",
        "source": "X11n0269_002:0719b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經願聞下孤山云阿難但合掌禮佛而默有斯意故至結集得備敘之所以不發言者以屢扣佛慈亟承指誨內慚暗短未識大方欲更興言未得機便以師嚴道尊理非容易者也後因匿王疑斷滅致問如來以不生滅為答遂承佛語方得陳辭美哉聖人等斯令範。",
        "translation": "Under ▲Vowing to Hear, Gushan said, \"Ānanda simply bowed his palms to the Buddha and was silent about his intention. The reason he didn't speak was because he had repeatedly withheld the Buddha's kindness and had urgently accepted his instructions, feeling a sense of shame and shortness in his heart and not knowing how generous he was wanted to speak further.",
        "source": "X11n0269_002:0719b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二時下顯示為三一匿王陳疑。",
        "translation": "The second time, the following three were shown: 1. King Nain stated his doubts; 2.",
        "source": "X11n0269_002:0719c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注具云下纂要曰迦羅鳩陀此示牛領迦旃延此云翦剃刪闍夜此云正勝毗羅胝此云不作。",
        "translation": "He said, \"We're going to explain this in detail here, and we're going to explain it here.",
        "source": "X11n0269_002:0719c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲自然得道者如於高山轉縷丸縷盡自止。",
        "translation": "He said, \"The one who naturally attains enlightenment is like the one who turns a ball of thread in a high mountain, and the thread stops by itself.",
        "source": "X11n0269_002:0719c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲每渡河氷者述征記曰北風勁河氷合要須狐行云此物善聽氷下無聲然後過河。",
        "translation": "He said, \"Every time he crosses the ice of a river, he remembers the record of the expedition, saying, 'The north wind is strong, and the ice of the river is closed.' He must practice like a fox, saying, 'This thing is good,' and then he crosses the river after hearing no sound under the ice.",
        "source": "X11n0269_002:0719c04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經證知此心者問前言此身今云此心者何耶答外道謂身死斷滅蓋由心滅匿王既聞佛斥生滅遺失真性是知若得真性則無生滅故此間心即是問身下文信知身後捨生趣生必亦信知心無斷滅斯亦善權助發機教耳。",
        "translation": "He said, \"I'm going to tell you about this body, but what about this mind?\" A. Non-Buddhists say that the body dies and ceases only because the mind ceases.",
        "source": "X11n0269_002:0719c05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛告下如來示性又二一示身有遷變二示性無生滅初又二一審肉身變壞二佛言下審顏貌遷移。",
        "translation": "In the beginning, there were two ways to show that the body had change and two ways to show that the nature had no arising or ceasing, and in the beginning there were two ways to examine the change and decay of the physical body and two ways to examine the change of appearance under the words of the Buddha.",
        "source": "X11n0269_002:0719c10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經孩孺者谷響云孩或作咳禮曰子生三月執右手咳而名之釋名云兒始能行曰孺子孺濡也言濡弱也。",
        "translation": "▲經孩孺者谷響云孩或作咳禮曰子生三月執右手咳而名之釋名云兒始能行曰孺子孺濡也言濡弱也。",
        "source": "X11n0269_002:0719c12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲頹齡謂頹毀之年也注古者謂年齡齒亦齡也文出禮記。",
        "translation": "He said, \"I'm not sure if he's a good person.",
        "source": "X11n0269_002:0719c14_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲耄惛忘也者此依禮記注又釋名曰耄頭髮耄耄然也。",
        "translation": "He said, \"I'm sorry, but I'm sorry.",
        "source": "X11n0269_002:0719c15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經剎那至不得停住仁王云一念中有九十剎那一剎那經九百生滅。",
        "translation": "He said, \"I'm not going to stop until the end of the year,\" but he said, \"There are ninety moments in a single thought, and one moment goes through nine hundred births and deaths.",
        "source": "X11n0269_002:0719c16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注時之極少者準俱舍有三極少頌云極微字剎那色名時極少論曰分析諸色至一極微為色極少分析諸名及時至一字一剎那為名時極少如壯士一彈指頃六十五剎那。",
        "translation": "He said, \"When the time is minimal, there are three minimal verse verses that say 'minimal word, moment, form, and name' are minimal, and there are few verse verses that say 'analysis of form up to a minimal amount of form' and 'analysis of names and time up to a word, moment, and name' are minimal, like a strong man who snaps his fingers for 65 moments.",
        "source": "X11n0269_002:0719c18_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛告下示性無生滅為二一示性二斥邪初又二一顯身性不滅上文所觀剎那不停但是小乘生滅細相尚未及偏真之理況圓中之性乎故佛問不滅而王答不知。",
        "translation": "△Two Buddhas told the audience that the absence of arising and ceasing in nature was twofold: one showing the nature and two refuting error.",
        "source": "X11n0269_002:0720a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛言下指見精為證又二一審觀河無異。",
        "translation": "Second, the Buddha's words were evidenced by the following two things: first, he examined the nondifference between the river of contemplation and the river of cessation.",
        "source": "X11n0269_002:0720a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經恒河者應法師云或言恒伽或作殑伽舊譯為天堂來見從高處來故此河從雪山頂無熱惱池東面象口而出流入東海。",
        "translation": "He said, \"The Ganges River is a river that's sometimes called the Ganges River or the Ganges River, which is an old translation of the word paradise and comes from a high place.",
        "source": "X11n0269_002:0720a07_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲擕者廣雅云提挈也。",
        "translation": "▲Ārya: The word Ārya is used to describe the carrying of a litter.",
        "source": "X11n0269_002:0720a10_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲宛然者荊谿云邊高中下邊下中高皆名為宛顯了可見故也。",
        "translation": "It's called \"wan\" because it's called \"wan\" in the Sanskrit language, meaning \"high,\" \"high,\" \"low,\" \"medium,\" and \"high.",
        "source": "X11n0269_002:0720a10_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛言下顯見精無常。",
        "translation": "He said, \"I don't know what to say.",
        "source": "X11n0269_002:0720a11_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注言偏意圓者佛意雖圓機緣未會故匿王所領且存偏解耳。",
        "translation": "He said, \"Although the Buddha's intention is perfect, the opportunity and conditions have not yet come together, so the king of hiding has a partial understanding of what he's led to.",
        "source": "X11n0269_002:0720a12_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲抑語辭也。",
        "translation": "It's a repression of speech.",
        "source": "X11n0269_002:0720a13_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二而猶下斥邪。",
        "translation": "He said, \"I don't want to be a part of it.",
        "source": "X11n0269_002:0720a13_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注具云下珙鈔曰末伽棃此云不見道拘賒棃此云魔彼之三者一富蘭那迦葉二阿耆多翅舍欽婆羅三尼揵陀若提子。",
        "translation": "The three of them were: 1. Pūraṇa-kāśyapa, 2. Ajita-keśa-kambala, and 3. Nirgrantha-jñāniputra.",
        "source": "X11n0269_002:0720a14_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三聞下大眾得解。",
        "translation": "△There were three things that the public heard and then understood.",
        "source": "X11n0269_002:0720a16_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注主伴同置猶止也此且約佛與王俱未顯談生滅即不生滅故曰同置應知王若顯談則無由發起阿難後問秪由王解身有生滅性無生滅與阿難云我頭自動見性不動其理似同是故下文對前為問。",
        "translation": "It should be understood that if the king had talked about it clearly, there would have been no reason to initiate Ānanda's later question because the king understood that the body has birth and death, and that the nature of non-birth and death is seemingly the same as Ānanda's statement that my head automatically sees the nature as motionless.",
        "source": "X11n0269_002:0720a17_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三阿難下辨惑分二一惑問。",
        "translation": "He then asked, \"▲Sūtra, 'Are these people who see and hear?'",
        "source": "X11n0269_002:0720a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經若此見聞者據經現文但應云見又云聞者相帶而來以聞性與見性同故。",
        "translation": "The reason is because the nature of hearing and the nature of seeing are the same.",
        "source": "X11n0269_002:0720a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注私謂下明對機之意也。",
        "translation": "He said, \"I'm not going to tell you about this.",
        "source": "X11n0269_002:0720a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲身境者身謂我頭境即佛手。",
        "translation": "He said, \"The body and its objects are the body that refers to the head of the self and the object that is the hand of the Buddha.",
        "source": "X11n0269_002:0720a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲破當體之妄者如云云何汝等以動為身以動為境等此斥阿難認物為己名為失真也。",
        "translation": "He said, \"I don't want to be a part of the body, but I want to be a part of the object.",
        "source": "X11n0269_002:0720b01_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲顯所依之性者夫當體之與所依猶波之與水必不相離由當體既動難為指示故寄見精以顯所依也當體故不即謂前破當體猶存不即之義所依故不離謂次顯所依欲彰不離之意。",
        "translation": "The reason is that the essence of the present body and its support are like waves and water that must not be separated from each other because the present body is moving and it's difficult to give instructions, so we send the essence of views to show the support.",
        "source": "X11n0269_002:0720b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲應知下明互有得失阿難何甞為失此約性也匿王亦未為得此約解也如云信知身後捨生趣生等。",
        "translation": "▲It should be understood that the following explains that there's mutual gain and loss, and how did Ānanda ever lose this convention?",
        "source": "X11n0269_002:0720b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二即時下辨示又二一現相略示二興慈廣辨初又二一現相表法二就法問名初又二一以輪手審其倒正。",
        "translation": "In the beginning, there were two ways to show the present form and two ways to raise compassion and explain it in detail.",
        "source": "X11n0269_002:0720b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經世間眾生下孤山云阿難以前立義屢遭撿責故今答佛正倒不敢言己唯指眾生。",
        "translation": "Under \"Sutra of Worldly Beings,\" Gushan said, \"Ānanda was often criticized for positing a meaning in the past, so now he answers the Buddha correctly and incorrectly, not daring to speak of himself but referring to sentient beings.",
        "source": "X11n0269_002:0720b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二告下以倒正比於迷悟。",
        "translation": "Under Śrīgupta, he compared being mistaken and correct to being confused and awakened.",
        "source": "X11n0269_002:0720b12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經一倍膽視沇疏云此明垂手是正以順身故竪臂却倒以不順身故世人以倒為正以正為倒故云一倍今謂不然阿難雖指世人其實己見亦爾豈陳正倒雖此反常耶順與不順夫何所據請從孤山釋之則知汝身者前文所斥遺失真性顛倒行事正由以動為身故今所示復言汝身也。",
        "translation": "Although ▲Sūtrâlaṃkāra doubles his bile and looks at Yan's commentary, this statement shows that hanging down his hand is correct because he's obedient to the body, standing up with his arm but inverted because he's not obedient to the body.",
        "source": "X11n0269_002:0720b13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二隨汝下就法問名又二一問名二于時下昧旨。",
        "translation": "He then asked about the name of the teaching, and there were two more questions: one asked about the name, and two obscured the meaning at the time.",
        "source": "X11n0269_002:0720b18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經瞪矒至不瞬谷響云此失措之狀也瞪直正反定目直視也矒莫宜反目不明也瞬亦作眴目動也。",
        "translation": "He said, \"The scriptures show that the scriptures are not transient, but the scriptures show that the scriptures are not transient and the eyes are not clear.",
        "source": "X11n0269_002:0720b19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注認悟中迷為身為心者以經云不知身心顛倒所在故斯蓋阿難雖知見性不動然猶未絕能見之情故今因佛問身顛倒乃與大眾俱昧兩端由是下文皆約身心廣辨真妄。",
        "translation": "The reason is that although Ānanda knew that his views were inherently immovable, he hadn't yet cut off his perceptions.",
        "source": "X11n0269_002:0720b21_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二佛下興慈廣辨為二一顯真心二示倒相初又二一舉昔說。",
        "translation": "In the beginning, there were two ways to explain it: one was to show the true nature and the other was to show the mistaken characteristics.",
        "source": "X11n0269_002:0720c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注喻以海潮者海有八德潮不過限此其一焉。",
        "translation": "In the beginning, there are eight virtues of the ocean, but the tide is only one of them.",
        "source": "X11n0269_002:0720c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲總有五法下一百法也具如彼論今文所列少不次第節疏云八識心王識心王識自相故五十一心所識相應故十一種色識所變故二十四不應識分位故六無為識自性故攝所歸能攝相歸性故言唯心所現此依法相宗釋也若約山家諦境明之所現之法不出十界百如三千世間俗諦之境也能現之心即三千真中之理也然此文意大同初卷云如來常說諸法所生唯心所現前記已備學者思之。",
        "translation": "He said, \"There are five things in general, and one hundred things in particular, as explained in the present document, are not sequential, but the eight consciousnesses, mind, king of consciousness, mind, king of consciousness, their own characteristics, and the fifty-one things associated with mind and consciousness, the eleven things that are changed by consciousness, the twenty-four things that should not be changed by consciousness, the six things that should not be changed by consciousness, the own-nature of consciousness, the gathering of what should be gathered, the ability to gather characteristics, and the ability to gather nature.",
        "source": "X11n0269_002:0720c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二汝身下顯今法。",
        "translation": "△Two: \"Your body\" shows the present reality.",
        "source": "X11n0269_002:0720c12_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二云何下示倒相又三一總訶。",
        "translation": "Second, under \"What is it?\" he shows the fallacy of three generalizations.",
        "source": "X11n0269_002:0720c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注示所迷三諦者理具俗性開成三諦性本無相實唯真中珠具眾寶喻意可識今既不達名悟中迷者眾生不達真心是在諸佛悟中而迷也或指本覺之性名之為悟於覺不覺名悟中迷觀其經意當取前義上文云如來之身名正徧知汝等之身號性顛倒下文云汝等即是迷中倍人如我垂手等無有異故知迷悟約生佛對論耳。",
        "translation": "The commentary shows that those who are confused about the three truths are those whose principle is endowed with the conventional nature and who have awakened to the nature of the three truths, which are originally without marks but are really only true, and whose pearl is endowed with many treasures, a metaphorical meaning that can be recognized.",
        "source": "X11n0269_002:0720c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二晦昧下正示又二一法。",
        "translation": "△二晦昧下正示又二一法。",
        "source": "X11n0269_002:0721a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注又空謂下上約理惑相待變起頑空則以無明為因而生細相也下約心境相由變起色等則兼境界為緣而成麤相也。",
        "translation": "▲注又空謂下上約理惑相待變起頑空則以無明為因而生細相也下約心境相由變起色等則兼境界為緣而成麤相也。",
        "source": "X11n0269_002:0721a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲妄想者即四住煩惱驗前晦昧即根本無明也。",
        "translation": "The first one is deluded perception, which is the four abodes of affliction, and the first one is obscured, which is fundamental ignorance.",
        "source": "X11n0269_002:0721a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲五陰備矣五陰是實法。",
        "translation": "The five aggregates are real dharmas.",
        "source": "X11n0269_002:0721a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲眾生是假名假實相依猶如形影故今言身而不云眾生下云眾生而不言身也。",
        "translation": "He said, \"The five aggregates are real things, and sentient beings are nominally named, nominally real, and mutually dependent, just like form and shadow.",
        "source": "X11n0269_002:0721a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲妄想四心者受等四陰也。",
        "translation": "The four mental states of deluded perception are the four aggregates of sensation and so forth.",
        "source": "X11n0269_002:0721a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲是知下荊谿云自法華前藏通三乘俱未稟性二乘憚教菩薩不行別人初心教權理實以教權故所稟未周故此七人可云無情不云有性孤山據此故通斥言九界妄心豈信草木等。",
        "translation": "He said, \"I'm not sure if I'm going to be able to get a job.",
        "source": "X11n0269_002:0721a08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二譬如下喻。",
        "translation": "△Two: \"It's like the following metaphor.",
        "source": "X11n0269_002:0721a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三汝等下結斥。",
        "translation": "The third is a summary rebuke under \"You.",
        "source": "X11n0269_002:0721a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注迷悟相翻此約一重為倍也迷中更迷即約兩重為倍也若觀前文首尾相換一倍瞻視誠如孤山所說若銷今文迷中倍人如我垂手有似真際之義是故兩存儻如資中云垂手是正世人以正為倒何故如來偏用垂手喻迷中倍人耶當知須將垂手為倒以況於迷並通圓節二師所解縱約兩重為倍不應更難法喻不齊也。",
        "translation": "If you look at the preceding sentence, the first and last are two times as great as each other, which is true as Gushan explained, and if you eliminate the present sentence, it's like doubling a person in delusion, such as when I hang down my hand, which has the meaning of seeming to be the true state, so the two exist in disagreement.",
        "source": "X11n0269_002:0721a12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下徧歷緣塵簡非顯是分二一略簡緣塵之心二廣簡緣塵之見初又二一疑請。",
        "translation": "In the beginning, there were two ways to briefly summarize the minds of the conditioned things and two ways to broadly summarize the views of the conditioned things.",
        "source": "X11n0269_002:0721a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經允所瞻仰允信也所瞻仰即法音也法音由金口而宣故帶瞻視而仰聽焉。",
        "translation": "The sūtras allow for what's looked up to and what's believed, namely, the Dharma voice, which is proclaimed by Chrysostom and therefore brought up for inspection and listening.",
        "source": "X11n0269_002:0721a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛告下簡示又二一簡所緣之法二簡能緣之心初又三一法二如人下喻。",
        "translation": "The first one is the teaching of the Dharma and the second is the mental attitude of those who can relate to it.",
        "source": "X11n0269_002:0721a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經以所標指者若依常塗解能所義能猶此也所猶彼也應以指為能標月為所標今言所標即能標耳如云所生父母不可以常義例之。",
        "translation": "He said, \"If the scriptures explain the meaning of subject and object according to the conventional doctrine, then the subject and object should be understood as the subject and object, and the moon should be the object.",
        "source": "X11n0269_002:0721a24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注引圓覺其意亦爾。",
        "translation": "▲The commentary cites Yuanjue, whose meaning is the same.",
        "source": "X11n0269_002:0721b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三汝亦下合。",
        "translation": "△Three of you are also included below.",
        "source": "X11n0269_002:0721b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二若以下簡能緣之心為二一正破二結斥初又二一破緣聲二例緣色初又三一法。",
        "translation": "The first two are a refutation of the cognitive object and the second is a refutation of the cognitive object of sound and the second is an example of the cognitive object of form.",
        "source": "X11n0269_002:0721b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注私謂下恐人謂前遺所標之指但遺能詮之教今破分別方破緣心故引阿難所疑以明喻意須知前喻意在今法故上文合法從略而辭見於此耳。",
        "translation": "It's important to understand that the meaning of the prior explanation is in the present teaching, so the above explanation is legally abbreviated and reflected in this ear.",
        "source": "X11n0269_002:0721b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二譬如下喻。",
        "translation": "△Two: \"It's like the following metaphor.",
        "source": "X11n0269_002:0721b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三此亦下合。",
        "translation": "△There's also the following example.",
        "source": "X11n0269_002:0721b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二斯則下例緣色。",
        "translation": "The second is the following example of form as a cognitive object.",
        "source": "X11n0269_002:0721b10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經聲分別心謂聲上分別之心也若取義便應云分別聲心。",
        "translation": "He said, \"The discriminating mind of sound refers to the discriminating mind of sound, and if we take its meaning, it should be called the discriminating mind of sound.",
        "source": "X11n0269_002:0721b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲分別我容者以前阿難言現以緣心允所瞻仰故例破之。",
        "translation": "The one who discriminates my features was previously denied by Ānanda's statement that he was now looking up to the mind by focusing on it.",
        "source": "X11n0269_002:0721b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二如是下結斥又二一結屬邪宗。",
        "translation": "He said, \"This is the second time I've denied it, and the first time I denied it, I belong to a mistaken school.",
        "source": "X11n0269_002:0721b12_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注二十五諦谷響云外道迦毗羅此云黃頭頭如金色故說經有十萬偈名僧佉論此云數術用二十五諦明因中有果計一為宗。",
        "translation": "He said, \"The twenty-five truths of the valley, the non-Buddhist Kapila, the yellow head, and the golden head are the reason why there are 100,000 verses in the scriptures called the Saṃkhya Verses, which are numerical in nature and use the twenty-five truths to explain the principle that there is an effect within a cause.",
        "source": "X11n0269_002:0721b13_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲言二十五者一從冥初生覺過八萬劫前冥然不知但見最初中陰初起以宿命力恒憶想之名為冥諦亦云世性謂世間眾生由冥初而有即世間本性也亦曰自然無所從故從此生覺亦名為大即中陰識也次從覺生我心此是我慢之我非神我之我即第三諦也從我心生色聲香味觸從五塵生五大謂四大及空塵細大麤合塵成大故云從塵生大然此大生多少不同從聲生空大從聲觸生風大從色聲觸生火大從色聲觸味生水大五塵生地大地大藉塵多故其力最薄乃至空大藉塵少故其力最強故四輪成世界空輪最下次風次火次水次地從五大生十一根謂眼等根能覺知故名五知根手足口大小遺根能有用故名五業根心能徧緣名平等根若五知根各用一大謂色塵成火大火大成眼根眼根還見色空塵成耳根耳根還聞聲地成鼻水成舌風成身亦如是此二十四諦即是我所皆依神我名為主諦能所合論即二十五也。",
        "translation": "The first one is the awakening that arises from the beginning of ignorance, which was 80,000 eons ago, and which is called the beginning of the intermediate state because of the power of predestination and constant recollection.",
        "source": "X11n0269_002:0721b16_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲數論外道者證真云拘舍離是自然外道今經云昧為冥諦非斯人所談故長水云是彼類耳。",
        "translation": "▲Numerology non-Buddhists who actualize the truth that Kośālī is a natural non-Buddhist and that the sūtras say that the obscure truth is not something these people talk about, so Nagarjuna says it's one of their kinds.",
        "source": "X11n0269_002:0721c08_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二離諸下斥非常義。",
        "translation": "The second is to avoid the non-Buddhist meaning of the lower part.",
        "source": "X11n0269_002:0721c10_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經各有所還者如下文八種還相。",
        "translation": "The sūtras each have some type of return, as described below in the eight types of return.",
        "source": "X11n0269_002:0721c11_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲云何為主者復假前喻斥非亭主常住之義也。",
        "translation": "It's also a metaphor to deny the meaning of not being the lord of the pavilion and being eternally present.",
        "source": "X11n0269_002:0721c11_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下廣簡緣塵之見分二一約緣塵正簡見性二約見性廣破執情初又二一相待簡二絕待簡初又四一明還不還二明物非物三明徧不徧四明是非是初又二一疑請二佛告下簡示又二一總示。",
        "translation": "二阿難下廣簡緣塵之見分二一約緣塵正簡見性二約見性廣破執情初又二一相待簡二絕待簡初又四一明還不還二明物非物三明徧不徧四明是非是初又二一疑請二佛告下簡示又二一總示。",
        "source": "X11n0269_002:0721c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注觀河之見即見無童耄也。",
        "translation": "He said, \"The view of the river of contemplation is the view of the youthless old man.",
        "source": "X11n0269_002:0721c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲雖異緣塵即分別之性也。",
        "translation": "The first part of the lesson is about the nature of discrimination, although it's different from the conditioned dust.",
        "source": "X11n0269_002:0721c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲而猶是妄者以能見未亡故。",
        "translation": "The reason it's still a delusion is because the subjective view hasn't died yet.",
        "source": "X11n0269_002:0721c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲真心無朕者朕兆也郭象注莊子云朕迹也。",
        "translation": "He said, \"I'm not sure if I'm the one who's going to get the sign, but I'm the one who's going to get the sign.",
        "source": "X11n0269_002:0721c18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲應知此見下問此異孤山所說耶答非異也但其言略故重明之諸家並以三義解之者唯疎疏云如人揑目見有二月一是本月二是假月非是月影者不取水中之月為第二月也疎公雖不用三義然解影字之義誤矣。",
        "translation": "The first of these is the first of the five, which is the first of the three, and the second of these is the second of the three.",
        "source": "X11n0269_002:0722a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲唯配法有異者真際云真月似圓成二月如徧計月影則依他長水云第二月揑目所觀全體虗妄堪喻妄見本不可得水中月影從真月降可喻妙應感而遂通今謂以水月喻妙應雖金光明有之用釋此經塗浂遠矣。",
        "translation": "The only difference is that the supporting principles are true, real, and objective, and the true moon appears to be perfect in two months, as in the case of the universal moon shadow, which is based on other things.",
        "source": "X11n0269_002:0722a05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下別簡又二一緣塵可還二見性不還初又二一示塵相。",
        "translation": "In the beginning, there were two ways to show the characteristics of the dust in the first place, and two ways to show the nature of the view without returning it.",
        "source": "X11n0269_002:0722a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經[土*孛]者煙塵之貌或作[火*孛]者非氛孚云切又音焚祥氣也。",
        "translation": "▲The sūtra [Tu*b] is the appearance of smoke and dust, or [Hu*b] is not an atmosphere; Fu Yunche also sounds like burning auspicious air.",
        "source": "X11n0269_002:0722a11_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下還本因。",
        "translation": "He said, \"I'm going to return to the original cause under the second Anan.",
        "source": "X11n0269_002:0722a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經緣還分別者緣是所緣之境分別是能緣之心餘七所還俱還前境唯此所還則還自心良以心非境而不存境非心而不立是故緣謝由分別不生故曰緣還分別應知此緣若於明等起於分別明還日時即緣還分別也暗還黑月等莫不皆爾。",
        "translation": "The other seven things that are returned are all returned to the previous object, except for this one, which is returned to its own mind.",
        "source": "X11n0269_002:0722a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二汝見下見性不還又二一顯性二諸可下警悟。",
        "translation": "There are two more ways to see the nature of the nonreturner under Śākyamuni: one is to reveal the nature and the other is to warn under those who can be awakened.",
        "source": "X11n0269_002:0722a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經不汝還者非汝而誰正示見精元也則知汝心本妙明淨例顯妙精明心也。",
        "translation": "He said, \"The one who doesn't see you returning is not you, but who correctly shows that he sees the essence and then knows that your mind is originally subtle, clear, and pure, which means he shows the subtle, intelligent mind.",
        "source": "X11n0269_002:0722a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注若離業識則無相者因無明故而有業識由業識故乃有轉識轉識即能見相也是知無明若破業轉俱亡。",
        "translation": "If we part with the karmic consciousness, then there are no marks.",
        "source": "X11n0269_002:0722a20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三汝自下斥迷。",
        "translation": "Third, you yourself are next to deny delusion.",
        "source": "X11n0269_002:0722a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下明物非物又二一疑請二佛告下簡示分三一示緣塵二簡見性三破執情初又二一泛明見境廣狹。",
        "translation": "The first two were a general explanation of the breadth and narrowness of the object of views.",
        "source": "X11n0269_002:0722a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經無漏清淨者近謂四果遠謂圓真據理而言唯圓無漏得真天眼。",
        "translation": "The untainted pureness of the scriptures is defined as the four fruits in the near future and the perfect truth in the distant future.",
        "source": "X11n0269_002:0722b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲阿那律如圓通中解。",
        "translation": "He said, \"Aniruddha is like the understanding in perfect understanding.",
        "source": "X11n0269_002:0722b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注舊翻難分別等此依淨名疏釋纂要云菴摩羅舊譯云柰誤也此果華多子少其葉似柳而長尺餘廣三指果形似棃而底鈎曲。",
        "translation": "The fruit has many flowers and few children, and its leaves resemble willows, are about a foot long, and the fruit is three fingers wide, resembling a concept with a curved base.",
        "source": "X11n0269_002:0722b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經諸菩薩等等取緣覺智論明支佛天眼亦見百千世界。",
        "translation": "The bodhisattvas and so forth in the sutra took the wisdom of pratyekabuddhas, and the treatise showed that the divine eye of the buddhas also sees a hundred thousand worlds.",
        "source": "X11n0269_002:0722b06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲不過分寸者沇疏云如隔皮膚不見五藏等孤山云比對聖人言其近也。",
        "translation": "He said, \"It's not more than a fraction of an inch.\" Yan's commentary says it's like not seeing the five collections across the skin, etc. Gushan's commentary says it's closer than the sages.",
        "source": "X11n0269_002:0722b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下正示緣塵留礙。",
        "translation": "△Two: Ānanda shows the proper way to refer to the obstruction of objects.",
        "source": "X11n0269_002:0722b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二汝應下簡見性又二一定自他二阿難下擇物見又二一擇物。",
        "translation": "△二汝應下簡見性又二一定自他二阿難下擇物見又二一擇物。",
        "source": "X11n0269_002:0722b09_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經從日月宮下谷響云日月與四天齊俱在須彌半腹但日月處空耳七金山圍繞須彌其山中間各有香水海高下齊四天。",
        "translation": "He said, \"The sun and moon are at the bottom of the palace, and the sun and moon are at the halfway point of Sumeru, but the sun and moon are empty, and there are seven mountains surrounding Sumeru, and each of the mountains has a perfume sea in between, which is equal in height to the four heavens.",
        "source": "X11n0269_002:0722b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲草芥者楊雄方言云蘇芥草也江淮南楚之間曰蘇自關而西或曰草或曰芥。",
        "translation": "It's also called \"grass\" or \"mustard,\" as Yang Xiong's explanation says, between Jiangsu, Huai, South, and Chu.",
        "source": "X11n0269_002:0722b13_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下擇見性。",
        "translation": "He said, \"We're going to have a lot of fun.",
        "source": "X11n0269_002:0722b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注見性似在於內者性實非內以前來所說皆附能見之性而示故云似內也。",
        "translation": "He said, \"The true nature of the Buddha's life is not internal, but the nature of the Buddha's life is not internal, so it seems to be internal.",
        "source": "X11n0269_002:0722b15_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲真性必因於外者華嚴云法性徧在一切處一切眾生及國土三世悉在無有餘亦無形相而可得肉眼所見者阿難前見初禪雖是天眼蓋承佛力今約自力言之故云肉眼。",
        "translation": "He said, \"The true nature must be due to the external.\"▲ Huayan says the Dharma nature is omnipresent in all places, all sentient beings and lands, and all three worlds are present without remainder or form, but can be seen by the naked eye.",
        "source": "X11n0269_002:0722b16_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲是故下文推而破之者節疏解前文我雖識此見性無還云何得知是我真性謂阿難意望世尊指彼真性同諸物象分別顯現斯乃執真有相矣尋下破意其理可知今謂節公明執意大早觀前文勢且無厥由圓師用之予實不韙。",
        "translation": "Therefore, the following section explains how to reject it even though I've come to know that this is my true nature, because Ānanda's intention was to expect the Bhagavān to refer to this true nature as being the same as all things that are discriminated and shown.",
        "source": "X11n0269_002:0722b20_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二若見下破執情又二一破物見。",
        "translation": "He said, \"Second, if we see this, we'll refute our attachment to feelings and second, we'll refute the view of things.",
        "source": "X11n0269_002:0722b24_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經吾不見時何不見吾不見之處資中兩釋初同孤山次云若同吾見吾見無相名不見之處汝何不見若見不見自然非彼不見之相者資中初釋亦同孤山次云若能見吾無相之處能見已成見相自然非吾不見之相已上二節經文沇疏皆作兩釋彼自判云前解為正證真云前約緣事境而說後約緣真理而談然其前解甚合經旨自然非物者此且一向作真見離物示之至下明是非是中方顯見物非即非離不成安立者約諦言之安立即俗諦也若非安立即真諦也夫俗有差別真無差別今雖欲顯無差之性而約差別破之者以阿難能見所見差別未亡將恐認俗為真是故約俗而破。",
        "translation": "When I don't see, why don't I see what I don't see?\" The first two explanations in the sutra are the same as Gushan's; the second is, \"If you see what I don't see, then why don't you see what I don't see?\" The first explanation in the sutra is the same as Gushan's; the second is, \"If I can see what I don't see, then I have seen what I have seen, and I naturally don't see what I don't see.\" The above two sections of the sūtras and sūtras are interpreted in two ways.",
        "source": "X11n0269_002:0722c01_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下顯真性。",
        "translation": "△Two: Ānanda next shows the true nature.",
        "source": "X11n0269_002:0722c13_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經若汝見時是汝非我指見精也見性周徧非汝而誰示真性也前私謂云此寄見性之徧以顯真性之徧豈不然乎。",
        "translation": "When you see the scriptures, it's you, not me, who sees the essence of the view, and who shows the true nature but not you?",
        "source": "X11n0269_002:0722c13_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲云何自疑下此責阿難言云何得知是我真性。",
        "translation": "Under \"Why do you doubt it yourself,\" he rebuked Ānanda, saying, \"How did you learn that this is my true nature?",
        "source": "X11n0269_002:0722c15_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三阿難下明徧不徧又二一疑請。",
        "translation": "He said, \"Third, Ānanda explained that pervasiveness and non-pervasiveness are two more things: one is a request for doubt.",
        "source": "X11n0269_002:0722c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經娑婆者谷響云亦言索訶此翻堪忍悲華云是諸眾生忍受三毒及諸煩惱故名娑婆。",
        "translation": "He said, \"The scriptures say 'svāhā,' which is also called svāhā because it means 'tolerant,' which is translated as 'compassionate,' and 'compassionate,' which means that sentient beings endure the three poisons and afflictions.",
        "source": "X11n0269_002:0722c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲廡音武說文云堂下周屋也釋名云大屋曰廡。",
        "translation": "The name of the building is a large house called a dwelling.",
        "source": "X11n0269_002:0723a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛告下簡。",
        "translation": "△Two buddhas told the following brief summary.",
        "source": "X11n0269_002:0723a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二譬如下喻。",
        "translation": "△Two are like the following metaphor.",
        "source": "X11n0269_002:0723a02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三若如下難谷響云挽謂牽挽也續迹或作竇迹之誤。",
        "translation": "It's a mistake to say that the word \"pulling\" means \"pulling,\" or \"continuing,\" or \"Dou\" means \"traces.",
        "source": "X11n0269_002:0723a02_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四一切下斥。",
        "translation": "△4. All is denied under Śākyamuni.",
        "source": "X11n0269_002:0723a04_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二若能下示性徧孤山於此約六即明義從名字已上皆能轉物是則有名字如來乃至空竟如來云云。",
        "translation": "△二若能下示性徧孤山於此約六即明義從名字已上皆能轉物是則有名字如來乃至空竟如來云云。",
        "source": "X11n0269_002:0723a04_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注理事雙顯體用備陳者如來藏唯妙覺明即理體也圓照法界即事用也一為無量無量為一等義例可知。",
        "translation": "The Tathāgatagarbha is nothing but the body of marvelous enlightenment, which is the essence of principle and the perfect illumination of the Dharma realm, which is the function of phenomena.",
        "source": "X11n0269_002:0723a06_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四阿難下明是非是又二一疑請。",
        "translation": "He said, \"I'm going to tell you about this.",
        "source": "X11n0269_002:0723a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注前既難破即體性紛雜不成安立等。",
        "translation": "It's difficult to refute the prior objection that the essence is complicated, untenable, and so forth.",
        "source": "X11n0269_002:0723a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛告下簡示又二一如來示性二經家敘相初又二一約見精定其方所二且令下約方所簡其是非又二一約離義簡物是見二約即義簡物非見初又二一歷緣審見請二佛告下如來顯示為二一示菩提本絕緣見二斥妄想令出是非初又四一法。",
        "translation": "In the beginning, there were two ways of seeing the essence of the nature of the Tathāgata, and two ways of seeing what is right and wrong, and two ways of seeing what is right and wrong.",
        "source": "X11n0269_002:0723a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經十方如來下此約果人所證以示眾生所迷上證雖殊見性是一及大菩薩即迷圓住已上也。",
        "translation": "The first one is that the tathāgata in the ten directions realized what sentient beings are deluded about, even though the nature of special views is one, and the great bodhisattva is deluded and has fully abided.",
        "source": "X11n0269_002:0723a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注見謂下兩釋當取次釋為便以根境識三宛如次第故前文云分別之處則復見緣正是以境為緣也十八界如法界次第。",
        "translation": "The first two explanations are based on the fact that the three faculties, objects, and consciousnesses are just like the sequential order, so the previous sentence states that the place of discrimination is the condition of further views, which is the condition of the object.",
        "source": "X11n0269_002:0723a17_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經元是菩提等第四卷云性覺妙明本覺明妙即此中菩提之體焉。",
        "translation": "In the fourth volume of the sutra, the original nature of enlightenment is described as marvelous, and the original enlightenment is described as marvelous, which is the essence of enlightenment.",
        "source": "X11n0269_002:0723a19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明文殊下例又二一問二如是下答。",
        "translation": "He said, \"I'm going to ask a question, and I'm going to answer it like this.",
        "source": "X11n0269_002:0723a21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經若有是者則二文殊節疏云若立二身即有是非之相既唯一體終無對待之名此喻真本無妄也乃至長水亦以是非解二文殊請詳私謂自見藏否。",
        "translation": "If this is the case in the sūtras, then the commentary on the two Mañjuśrī sections says that if we establish two bodies, then there's a mark of right and wrong, and since this is the only essence, there's ultimately no oppositely-associated name.",
        "source": "X11n0269_002:0723a21_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三佛言下合。",
        "translation": "△Three buddha-words are combined under ...",
        "source": "X11n0269_002:0723a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經此見妙明與諸空塵指阿難所迷之境也亦復如是總合前例。",
        "translation": "He also said, \"This is the same as the previous example of seeing subtle light and the dust of emptiness as the objects of Ānanda's delusion.",
        "source": "X11n0269_002:0723b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲本是妙明下別示真妄應以真合文殊妄合是非二相但文隱略耳。",
        "translation": "It's also the case that the true and false are shown separately under ▲Originally, it was the subtle combination of true and Manjushri and the false, but the text is abbreviated.",
        "source": "X11n0269_002:0723b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四如下喻。",
        "translation": "The four following metaphors.",
        "source": "X11n0269_002:0723b03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二是以下斥妄想令出是非。",
        "translation": "The second is the following, which denies false conceptions and makes them out to be right and wrong.",
        "source": "X11n0269_002:0723b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注物為所指者如云但可有形無不指著。",
        "translation": "He said, \"The object of focus is like the cloud that only has form and nothing is pointed to.",
        "source": "X11n0269_002:0723b04_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲見非可指者如云必無見精受汝所指。",
        "translation": "Those who see what's not pointable are as it says, \"There must be no insight into the essence of what you're pointing to.",
        "source": "X11n0269_002:0723b05_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下約見性廣破執情分四一破自然二破因緣三破和合四破非和合初又二一疑請二開示初又二一約濫彼邪外故生疑。",
        "translation": "The first two are a request for doubt and an explanation of the first two are a confusion that arises from abusing the false and external.",
        "source": "X11n0269_002:0723b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經投灰等諸外道種纂要云外道苦行宗計有十三種涅槃云有五百外道在恒河邊常以灰塗身佛往彼浴亦以灰塗身外道見而喜曰瞿曇亦同於我而不全說無我世尊為說真我具八自在外道因而發心。",
        "translation": "The sūtras cast ashes and other kinds of non-Buddhists, and the compendium of the ascetic practices of non-Buddhists says that there are thirteen kinds of non-Buddhists.",
        "source": "X11n0269_002:0723b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二世尊下約違昔因緣故致請經彼外道等常說自然者如末伽棃計眾生苦二隨見破執。",
        "translation": "△Two: The Bhagavān then asked the sūtras to refer to those non-Buddhists who always taught that those who are natural are like the Maskāyan who imagines the suffering of sentient beings and those who follow views and refute attachments.",
        "source": "X11n0269_002:0723b13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初又二一歷緣二若必下審見二阿難下隨見破除執又四一正破二汝可下重詰三阿難下申答經有兩節初答前正破次世尊下答前重詰如佛所說即披剝萬象析出精明等四佛言下印成。",
        "translation": "First, there are two ways to examine the causes and conditions, and second, to examine the views under Ānanda, and second, to break down the attachments according to the views under Ānanda.",
        "source": "X11n0269_002:0723b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲二佛復下約即義簡物非見又二一牒前復問文有四節初牒前答重詰義二則汝所指下牒前答正破義三今復告汝下總案定兩重答意四汝又下正設今問。",
        "translation": "The first is the meaning of the previous answer, which is to critique the second is the meaning of the previous answer, which is to correctly refute the third is to tell you the meaning of the two answers in a general way, and the fourth is to correctly frame the present question.",
        "source": "X11n0269_002:0723b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下據問申答又二一申答二佛言下印成。",
        "translation": "The second was when Ānanda explained the answer based on the question, and the second was when he explained the answer and the second was when the Buddha said it was accomplished.",
        "source": "X11n0269_002:0723b22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注則此見性宛如空華者以阿難妄認物象為見性故。",
        "translation": "The reason Anan falsely identified an object as his own nature was because he saw it as such.",
        "source": "X11n0269_002:0723b23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二於是下經家敘相又二一大眾惶悚。",
        "translation": "The second was that the sūtras described their appearances, and the second was that the multitude was terrified.",
        "source": "X11n0269_002:0723b24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經非無學者擕李云非小乘無學孤山云非圓真無學今謂二說並通若依擕李則三果已還通惑尚在迷中既重故有茫然惶悚之狀此據多分而言也若順孤山則別教已還未破別惑俱有此相然應不無輕重優劣之異此約全分而說也。",
        "translation": "If we rely on Li and Li, then the three fruits have been returned, the afflictions are still in delusion, and they are heavy, so there's a state of confusion and anxiety.",
        "source": "X11n0269_002:0723c01_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二如來安慰。",
        "translation": "△Two Tathāgatas comfort.",
        "source": "X11n0269_002:0723c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經變慴者變易慴也。",
        "translation": "The scriptures change and become frightened, and they change and become frightened.",
        "source": "X11n0269_002:0723c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲如所如說即智論云如法相解如法相說也。",
        "translation": "It's also known as the \"teaching of things as they are,\" which is explained in the Wisdom Discourse as the understanding of the characteristics of the teachings as the characteristics of the teachings.",
        "source": "X11n0269_002:0723c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注如來有五語下引金剛般若釋之彼無不妄此無不異若會通者由不妄故所以不異。",
        "translation": "He said, \"The Tathāgata has five statements, which are explained in the following passage from Diamond Prajñāpāramitā: 'This is not false, this is not different,' and he said, 'It's not different because it's not false.",
        "source": "X11n0269_002:0723c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二是時下絕待簡為二一文殊發起二如來顯示初又二一敘疑。",
        "translation": "二是時下絕待簡為二一文殊發起二如來顯示初又二一敘疑。",
        "source": "X11n0269_002:0723c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經法王子者荊谿問曰經稱文殊為法王子其諸菩薩何人不是法王之子答有二義一於王子中德推文殊二諸經中文殊並為菩薩眾首。",
        "translation": "He asked, \"Did the sūtras call Mañjuśrī the prince of the Dharma and which of the bodhisattvas is not the son of the king of the Dharma?\" He answered that there were two meanings: first, among princes, Mañjuśrī is the most virtuous; second, in the scriptures, Mañjuśrī is the head of the bodhisattvas.",
        "source": "X11n0269_002:0723c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲非是疇昔善根輕鮮者疇語辭也意云大眾驚怖乃是宿植深厚聞佛所說將破無明故有是相耳。",
        "translation": "It's not because they had good roots in the past and were light and fresh, but it's a term that means the people were frightened because they had deep roots from previous lives and heard what the Buddha taught, which would destroy ignorance and therefore had this appearance.",
        "source": "X11n0269_002:0723c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二惟願下致云一空二根三明四境五作意六種子七分別八染淨九根本若加等無間緣則成十也今經云因心即分別緣因眼即根緣也。",
        "translation": "The second thing he wants is for the mind to be the cause, the discriminating cause, the eye to be the cause, and the faculties to be the cause.",
        "source": "X11n0269_002:0723c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛言下隨情正破又四一申昔義二破執情又四一定二阿難下難三阿難下並四若復下結。",
        "translation": "△Two, the Buddha says the following is a correct explanation of the situation and four more.",
        "source": "X11n0269_002:0723c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三是故下顯真性又二一簡緣顯見。",
        "translation": "3. Therefore, the true nature of the Buddha's teaching is revealed in two ways.",
        "source": "X11n0269_002:0723c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經四義成就長水云四境自屬前塵見性未曾生滅雖見四境而非四境成就於見譯人巧略故別列而總結也若欲經文當句中具者應云見明之時見非是明成就等今謂此解非但銷文不便抑又釋義全疎若當句中須云成就者是則下文亦合云見見之時見非是見成就語既相類何無成就之字耶此銷文不便也原夫佛意既破四緣俱非見性欲顯真性亦非能見故先牒能見以離四緣即見明之時見非是明等後約真性以離能見即見之時見非是見若依長水則失兩重倫次之美此釋義全疎也谷響云四義成就是結上之辭請從斯解。",
        "translation": "▲▲The sutra's four accomplishments of meaning is summarized in a separate list because the translator skillfully abbreviated the four accomplishments, even though they're not four objects that have never arisen or ceased before.",
        "source": "X11n0269_002:0723c21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二汝復下簡見顯真。",
        "translation": "He said, \"Secondly, you should also take a brief look at what's true.",
        "source": "X11n0269_002:0724a08_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注映色之性者第四卷云由明暗等二種相形於妙圓中黏湛發見見精映色結色成根今言性者即眼根中能見之性也。",
        "translation": "He said, \"The nature of reflective form is explained in the fourth scroll as a result of the two kinds of characteristics, such as light and darkness, that are found in the marvelous perfection of the viscosity, the vision, and the reflection of form, and the formation of form into faculties.",
        "source": "X11n0269_002:0724a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲性脫于見方名見見者問見見之時為屬何位答沇疏謂前離緣塵是相似位即別教三賢圓教十信也引唯識頌云現前立少物謂是唯識性以有所得故非是住唯識今離能見是見道位即別圓地住已上也引頌云若時於所緣智都無所得離二取相故真實住唯識今謂亦應約圓教六即明之從名字即以解為見乃至究竟即以證為見更有異說謂諸疏鈔或後人所談也集解中非揜彼之長衒己之短甞委尋諸說釋此文相意所未安然而人情不同取捨各異但恐淺昧未曉其深故云余佛能知也。",
        "translation": "The nature of the view is liberated in the direction of the view called the view of the viewer who asks what stage the view belongs to when he sees it.",
        "source": "X11n0269_002:0724a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四云何下垂訶誡。",
        "translation": "△4. Why does he give the following admonition?",
        "source": "X11n0269_002:0724a20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下破眾生顛倒為二一敘迷致請。",
        "translation": "In the second place, Ānanda explained the sentient beings' mistakenness in two ways: first, by describing their delusions and inviting them to come back.",
        "source": "X11n0269_002:0724a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注中真際長水二解不同左右觀之各有其美孤山亦用節公所釋惟後賢擇之。",
        "translation": "In the commentary, the two interpretations of the true state of longitude and water are different, and each is beautiful in its own way.",
        "source": "X11n0269_002:0724a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二爾時下興慈廣說又二一總告二阿難下正說又三一標業示見。",
        "translation": "He said, \"I'm sorry, but I'm sorry.",
        "source": "X11n0269_002:0724a24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注不可以常途二業相配者如云別業屬前六識同業屬第八識或言別業感正報同業感依報等今不取者以下文同別二見皆指現前妄識所見依報之相故。",
        "translation": "It's not possible to match two karmic activities with one another in the usual way, as it's said that distinct karmic activities belong to the first six consciousnesses, while peers belong to the eighth consciousness, or that distinct karmic activities bring about direct retribution and peers bring about dependent retribution.",
        "source": "X11n0269_002:0724b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二云何下方喻合明為二一引喻二合明初又二一喻別業妄見二喻同分妄見初又四一喻二於意下破又二一定二阿難下難又二一難因緣。",
        "translation": "In the beginning, there are two metaphors, one for the deluded view of distinct karma and two for the deluded view of sameness, and in the beginning, there are four metaphors, two under intention, and two under disagreement, and two under difficulty.",
        "source": "X11n0269_002:0724b04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經此若燈色下破因生也若是見色下破緣生也又燈色是自生見色是他生若和合義後文自破故此不論。",
        "translation": "▲There's a reason that's refuted under \"If lamp form,\" a cause that's refuted under \"If it's form,\" a condition that's refuted under \"Seeing form,\" and a reason that's refuted under \"Lamp form is self-generated,\" or \"Seeing form is other-generated,\" and a reason that's refuted under \"Combined,\" so it's not discussed.",
        "source": "X11n0269_002:0724b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二復次下難自然。",
        "translation": "△Two furthermore, the next step is to refute spontaneity.",
        "source": "X11n0269_002:0724b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三是故下結。",
        "translation": "△3. Therefore, it's concluded below.",
        "source": "X11n0269_002:0724b10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注譬圓初心下此約解論也若沇疏云證真之時了知徧計脫體全空故云見眚非病此約證說也真際長水皆作兩釋但筆語有殊耳然孤山引大經為證於義似親故不取他說。",
        "translation": "This is an explanation of the theory that if the Yan commentary says that when he realizes the truth, he knows that pervasiveness, delimitation, and total emptiness are the reason he says that the cataract of views is not a disease, this is an explanation of the theory that the true state of Changshui is the result of two interpretations, but there are differences in the language used.",
        "source": "X11n0269_002:0724b10_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四如下例又二一指揑月。",
        "translation": "The four following examples are two more, one referring to 揑 moon.",
        "source": "X11n0269_002:0724b14_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經第二月非體非影資中云非是月體又非水中月影真際長水等俱同此說前佛釋見精明元如第二月非是月影曾引此文證之謂影即二月也今以向之燈影唯青之觀例同月影揑所成示不由因緣自然而然耳。",
        "translation": "The second moon is not the body, not the shadow, but the moon's shadow in the water, the true limit, and the long water are the same as this.",
        "source": "X11n0269_002:0724b14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注畏無我句者外道所計不出四句謂有無雙亦雙非此屬無句也。",
        "translation": "The phrase \"fear of selflessness\" is a non-Buddhist designation that doesn't include the four phrases that say \"existence and nonexistence are both also both non-existent.",
        "source": "X11n0269_002:0724b18_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二佛告下開示又三一斥前疑二阿難下責自體三阿難下破執情。",
        "translation": "The first is to deny the prior doubt, the second is to rebuke the essence, and the third is to refute the feelings of attachment.",
        "source": "X11n0269_002:0724b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注興福下先設問辭云慶喜所疑唯約真理者此據前文云覺緣徧十方界湛然常住等。",
        "translation": "The first question under ▲Note Xingfu is: \"The only thing that Qingxi doubts is the truth.\" This is based on the previous statement, which says that the perceptual referents of enlightenment pervade the worlds in ten directions, are perfectly eternal, and so forth.",
        "source": "X11n0269_002:0724b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲然一體下答也。",
        "translation": "He also answered under \"Even if it's one in essence,\" he said.",
        "source": "X11n0269_002:0724b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲既興能計必有所緣者識哉是言也當知阿難言雖涉理心未亡緣況疑自然濫於外道豈無所緣之相乎問前疑覺緣濫於冥諦及以真我如來何故但破自然耶答阿難云我今觀此覺性自然即是觀前覺緣之性。",
        "translation": "He said, \"I'm not sure if this is the case, but I think it's important to understand that although he said he was involved in the truth, his mind hadn't lost its cognition, so how could he doubt the naturalness of it and not have the characteristic of cognition?\" He asked why the previous doubt about the cognition of the cognition of the cognition of the underlying truth and the true self of the Tathāgata was only refuted as natural.",
        "source": "X11n0269_002:0724b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲所言徧者亦是自然徧也故知對他相濫雖有三名自己所疑秪是自然自然若破冥諦真我復何濫歟。",
        "translation": "Although there are three doubts about their own nature, if they refute the truth of the conventional truth, how could they be confused?",
        "source": "X11n0269_002:0724c04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下破因緣為二一因緣各破二因緣同破初又三一轉計重詢二佛言下隨情正破又二一破因二破緣初又二一定二阿難下難。",
        "translation": "The first one is to discuss the two causes and conditions together, and the second one is to discuss the two causes and conditions together, and the second one is to discuss the situation correctly, and the second one is to discuss the two causes and conditions together, and the first one is to discuss the two conditions together, and the second one is to discuss the two causes and conditions together.",
        "source": "X11n0269_002:0724c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二復次下破緣又二一定二阿難下難。",
        "translation": "In the beginning, there are two reasons and two conditions, and in the second place, there are two certainties and two difficulties under Ānanda.",
        "source": "X11n0269_002:0724c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注因親緣疎者如因明有見則境親而根疎若緣空有見則根親而境疎因緣皆對境破不對根破者以境有明暗空塞推撿為易根無此相故不論之又則阿難見性未脫前塵由於前塵而生轉計如上文云汝今因見見性現前等是故所破並從境說。",
        "translation": "If the cause is clear and there's a view, then the object is close and the root is distant; if the condition is emptiness and there's a view, then the root is close and the object is distant.",
        "source": "X11n0269_002:0724c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三當知下示性通訶。",
        "translation": "△Three should know that the following shows the nature of Tongha.",
        "source": "X11n0269_002:0724c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經精覺妙明下示性先簡非次顯是。",
        "translation": "He said, \"The essence of the scriptures, the awakening of marvelous clarity, first shows that the nature is simple and not followed by what's apparent.",
        "source": "X11n0269_002:0724c15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲汝今云何下通訶有法有譬戲論名相總合因緣自然二執。",
        "translation": "▲How do you now explain the two attachments to the fact that there are things, and there are metaphors, conceptualizations, names, and characteristics that combine causes and conditions and are natural?",
        "source": "X11n0269_002:0724c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下因緣同破又二一破世間因緣二破眾生顛倒初又二一據昔重疑。",
        "translation": "The first one is to refute the mistakenness of sentient beings, and the second one is based on serious doubts from the past.",
        "source": "X11n0269_002:0724c17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注唯識明九緣谷響故文甚顯着無勞致疑。",
        "translation": "The text is therefore quite clear, and there's no need to cause doubt.",
        "source": "X11n0269_002:0724c19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二此亦下例眚燈。",
        "translation": "△Two: This is also the next example of the cataract lamp.",
        "source": "X11n0269_002:0724c20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二云何下喻同分妄見。",
        "translation": "He said, \"I'm going to tell you about this.",
        "source": "X11n0269_002:0724c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注孟康下谷響云唐賢顏師古注漢書多引先儒孟康張晏皆師古所引今全取彼注以釋經文。",
        "translation": "He said, \"I'm not going to tell you about this.",
        "source": "X11n0269_002:0724c21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲皆曰旁氣者謂暈適等皆氣也如淳曰暈讀曰運適如字或引禮記適見於天日為之食乃作讁音者非也今云適自是黑氣耳。",
        "translation": "The first part of the story is about the role of the Buddha in the life of the world.",
        "source": "X11n0269_002:0724c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲如玉玦者如環而有缺也。",
        "translation": "The word \"jade penannular\" is like a ring with a hole in it.",
        "source": "X11n0269_002:0725a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲除舊布新者此本左傳申須之辭張晏引之也。",
        "translation": "He also said, \"I'm going to give him a chance to get rid of the old and spread the new.",
        "source": "X11n0269_002:0725a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲孛氣似惠者釋名云言其氣孛孛然似掃惠也惠即埽帚妖星之狀似之。",
        "translation": "He said, \"I'm not sure if it's a good idea.",
        "source": "X11n0269_002:0725a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲飛絕跡而去等者此乃星說之文孟康引之耳星說云自上而降曰流自下而升曰飛又云光跡相連曰流絕跡而去曰奔。",
        "translation": "He also said, \"I'm not sure if it's a good idea, but it's a good idea.",
        "source": "X11n0269_002:0725a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲珥形點黑者以其黑點似珠在耳也。",
        "translation": "He said, \"I'm going to tell you about this.",
        "source": "X11n0269_002:0725a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲虹蜺者通占曰陰陽之氣和則為雨怒則為風雷妖氣擊作散為虹蜺。",
        "translation": "He said, \"I'm going to tell you about this.",
        "source": "X11n0269_002:0725a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下合明又二一總標。",
        "translation": "He said, \"I don't want to be a part of it.",
        "source": "X11n0269_002:0725a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注將同例別即進義也以別例同即退義也由前別業光明同分後說故得進退之名。",
        "translation": "It's called \"advancement and retreat\" because the former distinctive karmic light is the same as the latter part of the explanation.",
        "source": "X11n0269_002:0725a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下正明為二一明別業二明同分初又二一法喻對辨二法喻合辨初又二一指喻二例法前私謂目眚見燈之喻正欲引例阿難目觀山河等皆是妄見其文在此。",
        "translation": "In the beginning, there are two ways to explain the difference between the first and the second, and the first two ways to discuss the two ways together.",
        "source": "X11n0269_002:0725a11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二見所下法喻合辨又二一正辨。",
        "translation": "The first one is a metaphor, and the second is an example.",
        "source": "X11n0269_002:0725a14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經此實見見者應有二義一約真見簡非妄見此則通取解證俱名見見二別約真證而見簡非似解而見。",
        "translation": "▲經此實見見者應有二義一約真見簡非妄見此則通取解證俱名見見二別約真證而見簡非似解而見。",
        "source": "X11n0269_002:0725a15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注此即重破因緣自然者如破別業妄見中二科是也。",
        "translation": "This is the second category of those who repeatedly refute the naturalness of causes and conditions, as in refuting the false views of specific actions.",
        "source": "X11n0269_002:0725a17_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二是故下結示。",
        "translation": "△Two: Therefore, the following is a summary.",
        "source": "X11n0269_002:0725a18_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下明同分又二一合例同別二喻。",
        "translation": "The first one is a composite example of two metaphors that are the same and different.",
        "source": "X11n0269_002:0725a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經瘴惡者瘴是惡病之氣。",
        "translation": "The sūtra \"Miasma\" refers to the foul breath of illness.",
        "source": "X11n0269_002:0725a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲俱是無始見妄所生者此非邈無萌始即指現前見妄無其始因也。",
        "translation": "It's not a misconception that there's no beginning, which means there's no beginning cause for the present delusion of views.",
        "source": "X11n0269_002:0725a20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二例下別例同分諸法。",
        "translation": "△Two examples are followed by separate examples of the same part of the teaching.",
        "source": "X11n0269_002:0725a21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三若能下指迷歸悟。",
        "translation": "He said, \"I'm going to return to enlightenment if I can.",
        "source": "X11n0269_002:0725a22_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經諸和合緣及不和合者問此云和合與上文和合之義同耶答同也但上文雖說和合而未破其計故下文破之問不和合應是自然耶答如注文。",
        "translation": "▲The sūtras' conditions of conformity and lack of conformity ask whether this is the same as the meaning of conformity in the preceding paragraph.",
        "source": "X11n0269_002:0725a22_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三阿難下破和合為二一結前生後。",
        "translation": "He said, \"I'm going to tell you that there are two ways to explain this combination.",
        "source": "X11n0269_002:0725b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注中真際長水既於前文兩解有異故今銷文亦復不同。",
        "translation": "In the commentary, the two interpretations of the true aspect of Chos kyi Chang shui differ from each other, so the present explication of the text is also different.",
        "source": "X11n0269_002:0725b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下牒疑正破又二一牒疑。",
        "translation": "The first one is to explain the doubts and the second one is to explain the doubts.",
        "source": "X11n0269_002:0725b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經前塵者即明暗通塞也汝今下正牒所疑證菩提心證猶悟也。",
        "translation": "The first is that the dust in front of the sūtra is clarity and darkness, and the second is that the doubts you have now correctly explain the realization of the bodhi mind and the realization of enlightenment.",
        "source": "X11n0269_002:0725b04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二則汝下正破又二一破和二破合初又二一通定二若明下別難又二一難明緣。",
        "translation": "△二則汝下正破又二一破和二破合初又二一通定二若明下別難又二一難明緣。",
        "source": "X11n0269_002:0725b05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經若非見者下此由上文云見相可辨雜何形像恐計者於可辨處起即離之見成相雜之義故先破離義次破即義。",
        "translation": "He said, \"If the scriptures are not about those who see, then it's because of the above statement that the view that marks are discernible and mixed with what forms and images lest those who speculate on discernible places should give rise to the view that they are free from the meaning of mixed, so he first refutes the meaning of free and then refutes the meaning of namely.",
        "source": "X11n0269_002:0725b07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲必見圓滿下又因上文作即離而破復恐計云非即非離但是見之與明性皆圓滿所以相雜故相對破之。",
        "translation": "The reason for this is because the above statement is based on the belief that what is immediate is not immediate, but that the nature of views and understandings are both complete and therefore mixed, so it's contradicted by the opposite.",
        "source": "X11n0269_002:0725b09_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲見必異明下若更執云雖各圓滿而不妨見異於明共成雜義是故破云雜則失彼性明名字等沇疏云如微塵與水相和但名泥團不名塵水。",
        "translation": "The reason for this is that it's not the same as the original intention, but it's the same as the original intention.",
        "source": "X11n0269_002:0725b11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二彼暗下例餘境。",
        "translation": "△Two, under \"That darkness,\" we'll examine the other objects.",
        "source": "X11n0269_002:0725b14_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二復次下破合又二一通定二若明下別難又二一難明緣二例餘境。",
        "translation": "△Two further steps are to refute the combination of two more, one with the concentration and two with the distinct difficulty under the clarification, and two more, one with the difficulty of clarifying the conditions and two with the examples of the remaining objects.",
        "source": "X11n0269_002:0725b15_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四阿難下破非和合為二一轉計。",
        "translation": "The four Ānanda texts refute non-combination as two and one as a transformation of conceptualization.",
        "source": "X11n0269_002:0725b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注中論破計者彼偈云諸法不自生亦不從他生不共不無因是故知無生初破自然即無因者亦可屬自性次破因緣雖通三性正破於他和合及不和合共成四句若爾則闕無因義應以自然兼之此與注文不同兩取無咎然則非和合義亦從自他開出者蓋其性中離立其義不同自然唯執理體故也。",
        "translation": "The first refutation of natural, or non-causal, can also be attributed to self-nature. The second refutation of causes and conditions, though related to the three natures, correctly refutes the fact that it's the combination of other and non-combination that makes up the four sentences, or else the meaning of non-combination is missing and should be combined with natural, which is different from the commentary.",
        "source": "X11n0269_002:0725b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二佛言下正破又二一破非和二破非合初又二一通定文中總舉和合別定非和二若非下別難又二一難明緣。",
        "translation": "The first two are a general statement, a general statement, a specific statement, and a specific statement that is not a statement.",
        "source": "X11n0269_002:0725b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經必有邊畔者說文云畔田界也左傳云如農之有畔。",
        "translation": "The sūtras must have a border, which is explained in the text as the border of a field, and the left-hand side of the transmission as the farmer's border.",
        "source": "X11n0269_002:0725c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二例餘境。",
        "translation": "He said, \"I'm going to give you two examples of other objects.",
        "source": "X11n0269_002:0725c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二又下破非合又二一通定總別例前二若非下別破又二一難明緣。",
        "translation": "The first two are the general and specific examples of the previous two, and the second is the specific refutation of the second one, which is a difficult condition to understand.",
        "source": "X11n0269_002:0725c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經云何甄明合非合理者此對前合義責今非合也。",
        "translation": "This is a criticism of the former meaning of conjunction and the present meaning of non-conjunction.",
        "source": "X11n0269_002:0725c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注角謂隅者亦可角謂獸角乖是背義如牛二角生則相背。",
        "translation": "He said, \"The term 'corner' also refers to the animal's horns, which are deviated from the meaning of 'back', such as when two horns of a cow are born, then they are backwards.",
        "source": "X11n0269_002:0725c06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二例餘境。",
        "translation": "He said, \"I'm going to give you two examples of other objects.",
        "source": "X11n0269_002:0725c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下會破陰入明法空分二一破四法二破七大初又二一示法本真。",
        "translation": "二阿難下會破陰入明法空分二一破四法二破七大初又二一示法本真。",
        "source": "X11n0269_002:0725c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經諸幻化相智論云譬如幻化象馬及種種諸物雖知無實然可見聞。",
        "translation": "It's like the illusory elephants, horses, and various other things that are visible and audible even though they know they're not real.",
        "source": "X11n0269_002:0725c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注剎那不相到者一剎那間即生即滅無前無後是不相到故楞伽云一切法不生我說剎那義初生即有滅不為愚者說。",
        "translation": "▲注剎那不相到者一剎那間即生即滅無前無後是不相到故楞伽云一切法不生我說剎那義初生即有滅不為愚者說。",
        "source": "X11n0269_002:0725c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲二乘非不破法者藏通二乘修析體觀亦破五陰實法小菩薩義同二乘故不別說。",
        "translation": "He said, \"The two vehicles don't refute the reality of the five aggregates, and the lesser bodhisattvas have the same meaning as the two vehicles, so they don't explain it separately.",
        "source": "X11n0269_002:0725c13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲菩薩非無有我者界外人執也無明未盡但有我見故涅槃中迦葉菩薩云我等今日之前悉名邪見是也。",
        "translation": "He said, \"It's not true that bodhisattvas don't have a self, but people outside the realm hold to it, and ignorance has not yet ended, but there is a view of self.",
        "source": "X11n0269_002:0725c14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲一往分配斯亦可然者以古師並云小破人執大破法執蓋言二乘未得涅槃法空菩薩已得界內人空耳法執例然謂上界外惑亦不可以二乘思惑為類也。",
        "translation": "The first part of the lesson is about the importance of the relationship between the mind and the body.",
        "source": "X11n0269_002:0725c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲對愚根別樂各有三者谷響引俱舍頌云聚生門種族是蘊處界義愚根樂有三故說蘊處界且愚三者一愚心為說五陰則開心為四合色為一二愚色為說十二處則開色為十處半謂五根五塵及法塵少分合心為一處半謂意根及法塵少分三愚心及色為說十八界則更開心為七界半謂六識意根法塵少分皆言愚者迷也根三謂上中下樂三謂略中廣皆如次配三科。",
        "translation": "He said, \"There are three distinctive pleasures of the foolish faculties, which are cited by Guhya as the verse from the club that says the group of beings is the sense of the aggregates and the realms.",
        "source": "X11n0269_002:0725c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲果有三身因理含攝者眾生心因具三佛性即含攝三身也。",
        "translation": "The result has three bodies that are included in the causal principle because the cause of sentient beings' minds has three buddha-natures that are included in the three bodies.",
        "source": "X11n0269_002:0726a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲無二邊相者圓師以去來迷悟生死三雙為二邊相。",
        "translation": "He said, \"There are no two extreme characteristics.\" He said, \"The three pairs of past and future delusion, birth and death are two extreme characteristics.",
        "source": "X11n0269_002:0726a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下依真破妄為四一破五陰二破六入三破十二處四破十八界初又二一總牒二阿難下別破又五一色陰乃至五識陰初又二一以喻顯妄二即喻破執初又二一喻。",
        "translation": "He said, \"I'm going to tell you about the five aggregates, the six sense-fields, the twelve places, and the eighteen realms.\" He said, \"I'm going to tell you about the five aggregates and the five consciousnesses.",
        "source": "X11n0269_002:0726a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經瞪以發勞埤蒼云瞪直視也。",
        "translation": "The first one is a metaphor to show delusion, and the second is a metaphor to refute attachment.",
        "source": "X11n0269_002:0726a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲狂亂非相者長水云或見毛輪第二月等。",
        "translation": "The first one is a metaphor, the second is a metaphor, and the first one is a metaphor that refutes delusion.",
        "source": "X11n0269_002:0726a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注現九界色者且約迷說佛界因果非無色陰以了色唯心故不言之。",
        "translation": "He said, \"The nine realms of manifest form are only delusions, and the causes and effects of the Buddha's realm are not the formless aggregates because form is understood to be only mind.",
        "source": "X11n0269_002:0726a10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二色陰下法。",
        "translation": "It's not a matter of understanding the form only mind.",
        "source": "X11n0269_002:0726a12_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經亦復如是此須兼帶上下文相顯之方見其義上文既以狂華喻於色陰下文云是諸狂華非從空來等正喻色陰不從因緣等生也以能喻之文既委故所喻之法甚略說在中間其語巧妙也後四陰例此可知。",
        "translation": "The above is a metaphor for the form aggregate based on the crazy flowers, and the following is a metaphor for the fact that the form aggregate doesn't arise from causes and conditions other than emptiness, etc. The metaphorical text is also a summary of the metaphorical principle, so the metaphorical principle is explained in the middle, which is a clever way of saying the last four aggregates are examples of this.",
        "source": "X11n0269_002:0726a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下即喻破執又二一破。",
        "translation": "The second is to refute the attachment to metaphors, and the second is to refute the first.",
        "source": "X11n0269_002:0726a16_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經非從空來破他性從非自出破自性約法言之應以心境而分自他餘四陰皆有自他二義蓋四性中存略而破也唯行陰中有離自他義似破無因性問經破人法二執何故須破四性於四性中多破自他二性耶答荊谿云四性為諸見本自他復為共無因本所以然也故龍樹尊者為被末代人根轉鈍廣作觀法造於中論實以推撿四性為本正順今經最後垂範願說經者無忽繁文。",
        "translation": "He said, \"It's not from emptiness that the scripture refutes other natures, but from what's not self that the scripture refutes self-nature.",
        "source": "X11n0269_002:0726a17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲如是阿難者先指定前義再召而破之餘皆放此。",
        "translation": "He said, \"Thus, Ānanda,\" first specifying the previous meaning, then summoning and refuting the rest, all of them were released here.",
        "source": "X11n0269_002:0726a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲翳者廣雅云障也奄也。",
        "translation": "The word \"cataract\" is a general term that means \"obstruction,\" or \"obscuration.",
        "source": "X11n0269_002:0726b01_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二是故下結。",
        "translation": "The second reason is the following conclusion.",
        "source": "X11n0269_002:0726b02_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注則顯色陰本如來藏者以前總牒云何五陰本如來藏故知結意雖則簡非正顯前義。",
        "translation": "He said, \"I'm going to tell you that the five aggregates are originally the tathāgatagarbha, even though it's a simple statement that doesn't precisely show the previous meaning.",
        "source": "X11n0269_002:0726b02_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下受陰乃至識陰科節同前。",
        "translation": "The second section, Ānanda, deals with the acquired aggregates and even the aggregate of consciousness in the same way as the previous section.",
        "source": "X11n0269_002:0726b04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經譬如有人手足宴等竦疏云且以近事以況遠旨亦是法亦是喻譬字即半含喻也今謂若爾豈唯受陰前色陰剩及下想陰等並言譬如皆可云以近況遠應知此中雖帶事說意在比況耳至六入去雖有譬字正約事相而破也。",
        "translation": "He said, \"I don't know if it's a good idea, but I think it's a good idea.",
        "source": "X11n0269_002:0726b05_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲忽如忘生者有作妄生字之誤也證真云忘生猶言忘形也謂百骸調適不與若苦樂憂喜諸受相應恬然靜住似無形命然李陵與蘇武書云每一念至忽然忘生文選注云忽然不知生之有生今譯者蓋用此語但改然作如也。",
        "translation": "He said, \"I'm sorry, but I'm sorry, but I'm sorry.",
        "source": "X11n0269_002:0726b09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲談說酢梅口中水出者世說云魏武帝行失道三軍皆渴帝令日前有大梅林饒子甘酸可以解渴士卒聞之口皆水出。",
        "translation": "He said, \"I'm not sure if it's a good idea, but it's a good idea.\"▲ He said, \"I'm not sure if it's a good idea, but it's a good idea.\"▲ He said, \"I'm not sure if it's a good idea.",
        "source": "X11n0269_002:0726b14_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注二相若殊俱應現在長水云如樹生果果不是樹二俱現在今且不然。",
        "translation": "He said, \"It's like a tree that produces fruit, but the fruit is not a tree, and the two are not present now.",
        "source": "X11n0269_002:0726b16_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經若離空水此似無因也。",
        "translation": "He said, \"If the scriptures were free from empty water, this would seem to be a non-causation.",
        "source": "X11n0269_002:0726b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲用餉他國者餉饋也以鉼擎空如器貯食往饋他國也。",
        "translation": "He said, \"I'm going to give food to other countries by using a plate to hold an empty container to store food for other countries.",
        "source": "X11n0269_002:0726b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注猶業持身識而去者中陰生陰皆有色心並由業力之所任持也問真際謂塞其兩孔喻六七二識我法二執塞二空理長水云死有至時諸根不通如塞兩孔二說然乎答凡立譬喻有全取合法有分取合法今但分取合其大義恐傷曲說吾未敢然。",
        "translation": "He said, \"I'm not sure if it's a good idea, but I think it's a good idea.\"▲Note: \"The intermediate aggregate, the aggregate of birth, and the aggregate of consciousness all have form and mind and are held by the power of karma.\"▲Queue: \"The true state of existence is described as plugging two holes in a metaphor of six or seven consciousnesses, two attachments to self and phenomena, and two attachments to emptiness.",
        "source": "X11n0269_002:0726b19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起第三卷",
        "translation": "(Skt. saṃsāra)",
        "source": "X11n0269_002:0726c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破六入為二一總牒。",
        "translation": "The two refutations of the six sense-fields are two and one is a general introduction.",
        "source": "X11n0269_002:0726c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲夫六入者凡有二義一根境互相涉入二根境俱為識之所入是故諸經名十二入。",
        "translation": "The six sense faculties have two meanings: one is the mutual involvement of objects and the other is the entry of consciousness by both faculties and objects.",
        "source": "X11n0269_002:0726c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲今經唯以六根為六入者蓋根有勝義親能生識又根能受境吸舉前塵故偏名入下文云六為賊媒自劫家寶金光明云六入村落結賊所止皆此義焉。",
        "translation": "He said, \"The only thing the scriptures say is that the six senses are the six sense-fields that give rise to consciousness, and the senses are able to receive objects, absorb and lift preceding objects, and therefore are partially called sense-fields.",
        "source": "X11n0269_002:0726c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下別破分六一眼入乃至六意入初又二一指事喻妄。",
        "translation": "In the beginning, there are two ways to refer to phenomena and metaphors that are false.",
        "source": "X11n0269_002:0726c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注斯取前文能喻之根便為此中所喻之法者問若爾此中以何為能喻耶答同是菩提瞪發勞相即能喻也然此能喻帶法言之菩提即覺從覺生妄如瞪發勞經意云彼色陰中所說目之與勞亦是覺明瞪發勞相勞相即空華也應知前文空華徧喻九界五根之色此中空華但喻九界眼入之相前寬此狹不可混同。",
        "translation": "He said, \"I'm not sure if this is the case.",
        "source": "X11n0269_002:0726c08_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲塞耳聞聲等例亦如是者例如勞目皆易解之妄事也。",
        "translation": "The example of plugging the ears and hearing sounds is also true, for example, when the eyes are strained, which is a false statement that is easy to understand.",
        "source": "X11n0269_002:0726c14_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲沇師所解於義不然者以將所喻作能喻解故。",
        "translation": "It's because the metaphor is interpreted as a referent.",
        "source": "X11n0269_002:0726c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二因于下從妄破執又二一示妄性。",
        "translation": "He said, \"I don't want to be a fool, but I want to be a fool.",
        "source": "X11n0269_002:0726c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經二種妄塵者前指勞目且據明緣示其妄相明必對暗相待而成此見離塵既無實性則一切眼入皆同虗妄耳等諸入義例咸然講者至下須明此意。",
        "translation": "The first one is to show the delusive nature of the eyes of toil, and the second one is to show the delusive aspects of the condition of light, which must be contrasted with darkness.",
        "source": "X11n0269_002:0726c17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二如是下破執情又二一破。",
        "translation": "△Two such things are explained below, and two more are explained in one.",
        "source": "X11n0269_002:0726c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經非於根出證真問曰此中本破其根今何得云不從根生若然者與破識何別答今言根者但指自體以自望自如言諸法不自生即斯義也今謂不然上云見性下云聞性乃至意入名覺知性性即識也若非識者豈可諸根未發識時已有見聞之義耶應知破根而推識者以現前六根生滅難見故從諸識推而破之識各不生根云何立譬如草木之根能生枝葉方名根耳枝葉若死知根已枯以喻觀法大意可見問若爾但破十八界於義即足何須徧破六入十二處耶答蓋隨所計實法有異故分三科至論推破必須三事相兼而說所云以自望自殊無所以長水云亦可勝義望世俗根故云根生更增他味也。",
        "translation": "He said, \"I'm not sure if this is the case, but I'm not sure if it's the case.\" He said, \"I'm not sure if this is the case, but I'm not sure if it's the case.\" He said, \"I'm not sure if this is the case, but I'm sure it's the case.",
        "source": "X11n0269_002:0726c20_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲不於空生者證真以此句破無因生前非於根出破自生非明暗來破他生即成三句若合自他為共性者四句意也問前五陰中記以空為他生今證真何故以空為無因耶答凡四性之義隨文分別不可局定前文空外無別他性之義故得以空為他蓋虗空亦是眼根所對之境今文既有明暗之說可對他生空對無因於義甚便。",
        "translation": "He said, \"It's not in the arising of emptiness that Chengzhen uses this phrase to refute the arising of lacking a cause.\" He said, \"It's not in the arising of self that Chengzhen uses this phrase to refute the arising of lacking a cause, but it's not in the arising of self that Chengzhen uses this phrase to refute the arising of others.",
        "source": "X11n0269_002:0727a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二是故下結。",
        "translation": "△Two, therefore, we'll conclude below.",
        "source": "X11n0269_002:0727a15_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下耳入乃至意入科節同前。",
        "translation": "The section on the second possibility is the same as the previous section.",
        "source": "X11n0269_002:0727a15_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注非取比況之義者然譬喻二字一往分之如法華疏以比況為譬曉訓為喻若通言之如說文中譬即喻也今從通義故不取比況。",
        "translation": "He said, \"We're not taking the meaning of simile, but the word simile is divided into two parts, as in the Fahua Commentary, which uses simile as metaphor and metaphors in a generic sense, as in the explanation of the text.",
        "source": "X11n0269_002:0727a16_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲往人者自興福至長水也。",
        "translation": "He said, \"The person who goes to the people is the one who brings fortune to Changchun.",
        "source": "X11n0269_002:0727a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲乃謂下擕李之說今經了華靜亦名聞等為顯性常故下文云聲於聞中自有生滅非汝聞性為有為無了義著矣。",
        "translation": "He said, \"I'm not sure if this is the case.",
        "source": "X11n0269_002:0727a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經急畜其鼻畜猶縮也。",
        "translation": "He said, \"The scripture urgently requires the nostrils to be held, which is like shrinking.",
        "source": "X11n0269_002:0727a21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲通塞虗實者通塞對塵虗實在根根虗則塵通根實則塵塞。",
        "translation": "He said, \"When the mind is not obstructed, the dust is obstructed, and the real is in the faculties.",
        "source": "X11n0269_002:0727a22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲離合違順二塵者身與境合有違有順順對細滑違對麤澀不與境合故名為離二塵即離合也經非離合來此破共生以離亦對塵故非違順有破他生不於根出破自生又非空生即無因也。",
        "translation": "He said, \"When the body is united with the object, there's a disagreement with the object and a disagreement with the object that's fine and smooth, and a disagreement with the object that's not united with the object, so it's called disagreement with the object, which is disagreement with the object.\" ▲The scripture is not disagreement with the object and comes here to refute co-production because disagreement is also with the object, so it's not disagreement with the object and refutes other-production, doesn't come out of the root and refutes self-production, and is not non-causation.",
        "source": "X11n0269_002:0727a23_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注落謝五塵者阿毗曇名無表色亦云不可見無對色眼等五根但緣現境者百法疏云前五轉識五塵為境是現量故緣實非假實謂青等假謂長等。",
        "translation": "The five faculties of the eye and so forth are only conditioned by the present object.",
        "source": "X11n0269_002:0727b03_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲流入五根不及之地者資中云眼耳取外塵境剎那流入意地從外入內名為迸流至第二念緣之不及故云流不及地。",
        "translation": "He said, \"The five faculties of the five sense organs don't reach the [bodhisattva] ground, but the eye and ear take the external objects and momentarily flow into the mind ground from the external into the internal, which is called bursting forth until the second moment of mindfulness, which is not reaching the [bodhisattva] ground.",
        "source": "X11n0269_002:0727b06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲雖通兩釋者前是孤山新義後即資中所解真際長水意同沇師經非寤寐來破共生非生滅有破他生不於根出破自生空生如前。",
        "translation": "Although it is interpreted from both perspectives, the first is the new meaning of Kushan, and the second is the understanding in the Sutra of the True Meaning of \"Long Water,\" which has the same meaning as the Yan Shi jing, which is not about waking and sleeping, but about refuting co-arising, non-arising and extinction, and refuting other-arising, not about roots emerging, and refuting self-reliance and emptiness as before.",
        "source": "X11n0269_002:0727b08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三復次下破十二處為二一總牒二阿難下別破分六一眼色處乃至六意法處初又二一指處審情二阿難下隨情破執又二一破。",
        "translation": "In the beginning, there are two ways to point to the situation and two ways to follow the situation and refute attachment.",
        "source": "X11n0269_002:0727b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經誰明空質者語似推人意存破法即眼根也然此中破處還復破根者以根如揑目色如空華揑若不生華則隨殞乃至法處例此可知。",
        "translation": "The sūtras that explain the nature of emptiness seem to infer that people's intentions are to destroy the Dharma, which is the eye faculty, but the place of destruction here also destroys the faculties because the faculties are like 揑 eyes and form are like empty flowers.",
        "source": "X11n0269_002:0727b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二是故下結。",
        "translation": "△Two, therefore, we'll conclude below.",
        "source": "X11n0269_002:0727b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下耳聲處乃至意法處科節同前。",
        "translation": "Second, Ānanda continued from the ear and sound sense areas to the mind and method sense areas in the same way as the previous section.",
        "source": "X11n0269_002:0727b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經旃檀者一云此方無故不翻或曰義翻與釋論云一切香木中旃檀為第一。",
        "translation": "The first one is that there's no reason why it shouldn't be translated into Chinese, and the second one is that it's the most important of all fragrant trees.",
        "source": "X11n0269_002:0727b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲一銖者谷響引律歷志云二十四銖為兩今云一銖其少也。",
        "translation": "He said, \"One baht,\" as quoted in Guhyang's Commentary on the Record of Discipline, twenty-four baht is two, and now it's one baht, which is small.",
        "source": "X11n0269_002:0727b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注如法華下引證香有勝力又張華博物志云有西國使獻香者漢制不滿斤不得受使乃私去著香如大豆許在宮門上香聞長安四面十里經月乃歇又任昉述異記云千年松香聞於十里亦謂之十里香。",
        "translation": "He said, \"I'm not sure if it's a good idea, but I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea, but I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.\"▲Note: \"I'm sure it's a good idea.",
        "source": "X11n0269_002:0727b21_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注五塵及以虗空攝一切法者問法有二種一心法謂相應諸心數法二非心法謂過去未來色法等是則五塵等外更有心法今何以云攝一切耶答此中為破法若非知須屬五塵及以虗空故云攝耳若是心法自屬上文所破也。",
        "translation": "He asked, \"Are there two kinds of dharmas, mental dharmas that are associated with mental numbers, and non-mental dharmas that are past, future, and form dharmas?\" ▲Note: \"There are mental dharmas outside of the five dust motes, so why are they all included in the cloud?\" A. This is a refutation of the dharma, and if it's not known, it must be included in the five dust motes and in space, so it's included in the ear, and if it's a mental dharma, it belongs to the refutation in the above paragraph.",
        "source": "X11n0269_002:0727c01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四復次下破十八界為二一總牒二阿難下別破分六一眼色識界乃至六意法識界初又二一指界審情二阿難下隨情破執又二一破。",
        "translation": "The first two are the visual form consciousness realm and the second is the mental factor consciousness realm.",
        "source": "X11n0269_002:0727c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注不可見有對色者非青等色故不可見能照境發識故可對此是勝義根非浮塵根二種根如第四卷解。",
        "translation": "He said, \"It's not visible that there are opposable forms that are not cyan and other forms, so it's not visible that they can illuminate the objects and give rise to consciousnesses that are opposable.",
        "source": "X11n0269_002:0727c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經又一切味下以根從境破識。",
        "translation": "The first one is the mental function of the consciousness.",
        "source": "X11n0269_002:0727c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲體若一下以境從根破。",
        "translation": "He says, \"What's the point of having consciousness?",
        "source": "X11n0269_002:0727c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲又汝識心下長水云識心第八也思量第七也了別第六也七八二識但第六根亦同名意今謂不然經文前後此指阿難現前第六識心破其情執秪可取俱舍小宗釋此三義況將七八同名第六於義甚疎又則七八是住地菩薩境界非今對破阿難之意。",
        "translation": "He said, \"I'm going to tell you that the sixth consciousness is the eighth, the seventh, the sixth, the sixth, and the seventh and eighth consciousnesses, but the sixth root is also the same name.\" ▲There's a difference between the first and second part of the sutra, which refers to Ānanda's present sixth consciousness, which refutes his emotional attachment because it's possible to interpret these three meanings from the lesser school of the clubhouse.",
        "source": "X11n0269_002:0727c11_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注集起名心等天台用此為覺意三昧所觀之境故止觀云對境覺知異乎本石名心次心籌量名意了了別知名識云云婆沙下彼論問曰心意識此三何別答或別不別言不別者心即意識如火名燄亦名為熾亦名燒薪秪是一心有三差別言有別者名即差別或云過去名意未來名心現在名識或云在界名心在入名意在陰名識等上引俱舍釋今經義亦約不別而別分此三名也。",
        "translation": "He said, \"The mind is consciousness, which is called fire, which is called flame, which is called blaze, which is called burning wood, which is only one mind with three distinctions.\" He said, \"There are distinctions in names, which are distinctions in names, or in the past, which are called mind, in the future, which are called mind, in the present, which are called consciousness, or in the realm, which are called mind, in the entry, which are called mind, in the aggregates, which are called consciousness, etc.\" (ibid.)",
        "source": "X11n0269_002:0727c16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經世間諸法不離五塵者問前意法處推所緣法則云此塵非色香味等今何故取五塵為法耶答前文正推法處故對落謝五塵言之此中既破意識須對現前五塵而說以五意識從現境生故非意所攝者此據意法斥之言五塵之法自屬五根所攝非意家法入之分也。",
        "translation": "He said, \"The worldly dharmas are not free from the five dust motes.\"▲ The question was raised about the method of intention and the principle of the referent dharmas, which is that these dust motes are not form, smell, etc. Why is it that the five dust motes are considered to be dharmas?",
        "source": "X11n0269_002:0728a06_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注例前可知者應云若意法共生合則中離則兩合體性雜亂云何成界。",
        "translation": "If the mind and dharmas are produced together, then they are in the middle, free from both, and their natures are confused, so how could they become a realm?",
        "source": "X11n0269_002:0728a11_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下破七大為四一疑請。",
        "translation": "He said, \"I don't know, but I'm not going to tell you.",
        "source": "X11n0269_002:0728a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經皆因四大和合發明者此疑實法和合不同前文覺元和合應知四大有內有外內謂正報外謂依報前五陰中色必具四大一往通內外二往唯在內下七大中地水火風一往通依正二往唯在依空大對四皆屬於境并根與識還是重破三科之法聖言被物各隨所宜得益不同故茲異說耳。",
        "translation": "He said, \"The scriptures are all based on the understanding of the union of the four elements.\"▲This doubt is that the union of real dharmas is different from the union of the first three factors of awakening, and it should be understood that the four elements are internal and external.",
        "source": "X11n0269_002:0728a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲戲論者谷響云謂同兒戲言論而無實理也。",
        "translation": "The term \"parody\" is used by Gu Xiaoyong as meaning the same as children's playful speech without real principles.",
        "source": "X11n0269_002:0728a20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二爾時下訶誡。",
        "translation": "He then admonished the following: ▲Two.",
        "source": "X11n0269_002:0728a21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經如說藥人喻多聞真藥現前喻義諦。",
        "translation": "He said, \"The sūtras are like the metaphor of the medicine man, the metaphor of the truth of well-versed medicine manifesting itself as the truth.",
        "source": "X11n0269_002:0728a21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三阿難下承旨。",
        "translation": "△3. Ānanda next acknowledged the point.",
        "source": "X11n0269_002:0728a22_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四阿難下正說又二一牒疑總非。",
        "translation": "The first one was to explain the doubts and general errors.",
        "source": "X11n0269_002:0728a22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注此破阿難不和合疑即上文云云何如來因緣自然二俱排擯也今所破者體兼真俗即上文云大性是也阿難唯執世諦蓋據小宗如來兼破真俗斯約大義以真如是萬法由隨緣故萬法是真如由不變故。",
        "translation": "▲注此破阿難不和合疑即上文云云何如來因緣自然二俱排擯也今所破者體兼真俗即上文云大性是也阿難唯執世諦蓋據小宗如來兼破真俗斯約大義以真如是萬法由隨緣故萬法是真如由不變故。",
        "source": "X11n0269_002:0728a23_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二汝觀下約性別破分七一地大乃至七識大初又二一破妄二顯真初又二一立析法觀境。",
        "translation": "In the beginning, there were two ways to dispel delusion and two ways to reveal the truth, and in the beginning there were two ways to analyze the phenomena and contemplate their objects.",
        "source": "X11n0269_002:0728b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經汝觀地性者此指析法差別之性也下水火風等皆是俗諦性耳前云若彼大性則指四大之中真諦性也隨文釋義不可混同如地持中有二法性一事法性性差別故二實法性性真實故。",
        "translation": "The first one is to refute delusion and the second one is to reveal the truth.",
        "source": "X11n0269_002:0728b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注有方分微至無方分微者證真云諸瑜伽師作析色明空觀以假想慧刀分析塵色至一微塵此塵猶有東西南北四隅及上下方分但名微塵不名極微更析此塵以為七分即無方分名為極微對法等論呼為極略色至此方名色邊際也以不可析故若更析之即成虗空故名鄰虗經中言析彼極微者乃通相呼微塵為極微也。",
        "translation": "In the sutra, it's said that the analysis of this dust is still east, west, north, south, four corners, up, and down, but it's called fine dust and not extremely fine.",
        "source": "X11n0269_002:0728b09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下破和合妄情。",
        "translation": "Second, Ānanda explained the delusion of confluence.",
        "source": "X11n0269_002:0728b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經若此鄰虗等將欲破之先且立之。",
        "translation": "He said, \"If we want to refute this, we should first establish it.",
        "source": "X11n0269_002:0728b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲汝今問言等重牒前執。",
        "translation": "He said, \"Now, you're asking about this,\" and so forth, to reintroduce the previous attachment.",
        "source": "X11n0269_002:0728b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲汝且觀此下正破妄情以小乘所迷諸法如幻當體無生故遭合色合空等難。",
        "translation": "▲You should also examine the following to correctly refute delusional states of mind because the lesser vehicle is deluded about things that are illusory and whose essence is unarisen, and therefore encounters such difficulties as combining form and space.",
        "source": "X11n0269_002:0728b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二汝元下顯真又二一示真性。",
        "translation": "He said, \"Second, you're the first to show the truth, and second, he shows the true nature.",
        "source": "X11n0269_002:0728b19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注此言理具非關事造谷響云理具如摩尼具寶事造如摩尼雨寶理具如水具波性事造如因風起波若不具寶性餘珠應雨寶若不具波性大地應起波是故一家明圓必談理具深符佛旨妙得自心若說若行皆須了此。",
        "translation": "He said, \"This is not about things that make things happen, but about things that make things happen, such as the fact that a mani is endowed with treasure and things that make things happen, such as the fact that a mani is endowed with treasure and things that make things happen, such as the fact that a wind generates waves.",
        "source": "X11n0269_002:0728b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲隨染淨緣者谷響云九界高下通名妄染五即聖賢總號真淨以圓五即通為佛界故也。",
        "translation": "He said, \"The nine realms are generally called deluded and defiled, the five noble and virtuous, and the general name is true and pure, because the five perfections are generally associated with the Buddha realm.",
        "source": "X11n0269_002:0728b24_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲順差別業者以順釋循漢書云因時循理注曰循順也。",
        "translation": "He said, \"I'm going to explain this in terms of following the Han sūtras and following the principle of the causal period,\" which means following the principle.",
        "source": "X11n0269_002:0728c02_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二世間下斥邪說。",
        "translation": "The second worldly aspect of the teaching is to reject false beliefs.",
        "source": "X11n0269_002:0728c03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注世間通指九界者別而言之多指人天已上別教菩薩已還以謂識心分別計度因緣自然等此如初卷中云諸修行人不能得成無上菩提乃至別成聲聞緣覺及成外道諸天魔王及魔眷屬。",
        "translation": "He said, \"The world refers to the nine realms, which are distinct and mostly refer to the human and divine realms, and beyond that, the differentiation of consciousness, the mind, the discernment, the calculation of causes and conditions, and so forth, as explained in the first scroll, practitioners cannot achieve unsurpassed enlightenment or even separately become śrāvakas, pratyekabuddhas, non-Buddhists, gods, Māra kings, and Māra's followers.",
        "source": "X11n0269_002:0728c03_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難下火大為二一破妄二顯真初又二一立妄境二破執情初又二一示因緣。",
        "translation": "Second, Ānanda's second major conflagration was two: one to refute delusion and two to reveal the truth, and the first was two: one to establish a deluded object and two to refute attached feelings.",
        "source": "X11n0269_002:0728c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經陽燧古文作鐆應法師云五石之銅精也圓以仰日即得火。",
        "translation": "The ancient word for \"fire\" in the scriptures is \"śramaṇa,\" which is the five-stone copper spirit that's used to make fire when the sun is turned up.",
        "source": "X11n0269_002:0728c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注火方諸者出火珠也非今經意。",
        "translation": "He said, \"I'm not sure if this is what the scripture means.",
        "source": "X11n0269_002:0728c10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲窪俞短切器空中也。",
        "translation": "He said, \"I'm not sure if it's a good idea.",
        "source": "X11n0269_002:0728c11_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下例和合。",
        "translation": "He said, \"I don't want to be a part of it.",
        "source": "X11n0269_002:0728c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經婆羅門者應師云此訛略也具云婆囉賀磨拏義云承習梵天法者其人種類自云從梵天口生四姓中勝唯五天竺有餘國即無諸經中言梵志亦此名也。",
        "translation": "▲經婆羅門者應師云此訛略也具云婆囉賀磨拏義云承習梵天法者其人種類自云從梵天口生四姓中勝唯五天竺有餘國即無諸經中言梵志亦此名也。",
        "source": "X11n0269_002:0728c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注例和合義者問破七大中何故唯此火大例和合耶答前地大和合義疎其執易破從火洎識和合義親所計難破且如火性以俗諦觀之灼然因于鏡日艾三和合而生今以眾人和合詰其根本各各不同用顯諸法和合皆是虗假都無真實火大既爾須將此義貫下五大亦復如是所舉舍利弗等三人且欲例同鏡日艾三也水風等三隨義可解。",
        "translation": "He asked, \"Why is this the only example of the conjunction of the seven elements that refutes the meaning of the fire element?\" A. The meaning of the conjunction of the former elementary elements is remote, and its attachment is easy to refute; the meaning of the conjunction of the consciousness of Michael is intimate, difficult to refute, and just like the nature of fire, when viewed in a conventional way, it clearly arises from the conjunction of the mirror, sun, and ae.",
        "source": "X11n0269_002:0728c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲瞿曇星名者此依南山解也若慈恩云釋迦之郡望也應師云此翻為最謂除天外人類中此族最勝故。",
        "translation": "The name Gautama is based on the interpretation of the southern mountain range, and if it's a compassionate cloud, it's the county seat of Śākyamuni, which should be interpreted as the most prominent among humans other than gods.",
        "source": "X11n0269_002:0729a04_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下破執情又二一審二阿難下破。",
        "translation": "He said, \"I'm going to tell you about this.",
        "source": "X11n0269_002:0729a06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經日鏡相違資中云日去人間四萬踰繕那(一踰繕那二十里也)。",
        "translation": "▲The sūtras say that the sun and mirror contradict each other, and the sun travels 40,000 yojanas (one yojana is 20 miles) from the human realm.",
        "source": "X11n0269_002:0729a07_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二汝猶下顯真二科可見三阿難下水大為二一破妄二顯真初又二一舉事審情。",
        "translation": "The first two are: one is to refute the false; the second is to reveal the truth; and the first two are to examine the situation in terms of circumstances.",
        "source": "X11n0269_002:0729a08_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注方諸見月則津而為水論衡云十一月壬子日夜半時於北方鍊五方石為之狀如盃盂向月得津此與高誘注別。",
        "translation": "▲Note: \"When the various directions see the moon, the water becomes a river.\" ▲Note: \"On the eleventh month at midnight on the day of the nonreturner, Heng discussed the northern direction of the river, chaining five rocks together to make it look like a cup and bowl facing the moon to obtain a river of water, which is different from the note on Gao Biao.",
        "source": "X11n0269_002:0729a10_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下隨情破執。",
        "translation": "△Two Ānanda then followed the situation and refuted the attachment.",
        "source": "X11n0269_002:0729a12_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經皆同滔溺者乙咸乙陷二切破水沒也有作滔及陷者字之誤。",
        "translation": "The sūtras are the same as the word \"drowning,\" which is a mistake for the word \"drowning\" and \"drowning.",
        "source": "X11n0269_002:0729a12_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二汝尚下顯真二科可解。",
        "translation": "The two sections under Er you still reveal the truth are explicable.",
        "source": "X11n0269_002:0729a14_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四阿難下風大科節如前。",
        "translation": "The four major sections of the wind under Ānanda are as before.",
        "source": "X11n0269_002:0729a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經僧伽棃此無正翻義云雜碎衣以條數多故若從用為名則曰入王宮時入聚落時衣慧上菩薩經謂之大衣。",
        "translation": "He said, \"When I entered the king's palace, I entered the village, and my clothes were called great clothes according to the Sutra of Saṃghârthas.",
        "source": "X11n0269_002:0729a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注袈裟從色得名者此是不正色亦云壞色南山業疏云本作迦沙至梁葛洪撰字苑下方添衣言道服也。",
        "translation": "The name of the monk's robe is derived from the color of the monk's robe, which is not the correct color, but also the color of the monk's robe.",
        "source": "X11n0269_002:0729a17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五阿難下空大為二一破妄二顯真初又二一舉事審情。",
        "translation": "The first two are: one is to refute the false; the second is to reveal the true.",
        "source": "X11n0269_002:0729a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經空性無形因色顯發沇疏云虗空與色二俱是假亦相因有體不離色故小乘以明暗為體大乘以空一顯色及極逈色為體(上見空名顯色下見空名逈色)孤山云凡夫妄執或謂空是色等如涅槃迦葉品破之或引法相謂空是色全背經宗今為資中救之此經空大先立後破涅槃虗空亦復如是何以明之彼經佛說眾生佛性猶如虗空此即立也迦葉乃以虗空對於四大謂空是有故佛以一十復次而遮其非意恐眾生認所喻之性同能喻之空此即破也今言空性無形者蓋云無依正之形耳而亦因依正之色顯空大之相故云因色顯發斯則正取涅槃能喻之空非無色也故下文鑿井得空乃是逈色之類況前文云縱令虗空亦有名貌下文云見覺空頑等然則頑空豈無色耶應知今經說空為大者以明迷妄有虗空依空立世界又言發真歸元此十方空皆悉銷殞是故次四大後須說空大此先立也至下文作三句推之方是破也孤山用涅槃破義解此中立義仍斥沇師全背經宗者誤矣。",
        "translation": "The scripture states that emptiness is formless because of the manifestation of form, and the scripture states that both space and form are false and the reason for their existence is that they are not separate from form.",
        "source": "X11n0269_002:0729a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注剎帝利等四姓全依西域記釋谷響云剎帝利此云田主如此方之帝王也。",
        "translation": "He said, \"I'm not sure if it's a good idea, but I think it's a good idea.",
        "source": "X11n0269_002:0729b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲奕世猶云繼世也。",
        "translation": "He also said, \"I'm going to give him a break.",
        "source": "X11n0269_002:0729b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲仁恕者以心度物曰恕。",
        "translation": "He said, \"I'm sorry, but I'm sorry.",
        "source": "X11n0269_002:0729b16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲操謂操行。",
        "translation": "He also said, \"I'm going to give him a break.",
        "source": "X11n0269_002:0729b16_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲商賈者行賣曰商坐賣曰賈。",
        "translation": "He said, \"I'm not going to tell you about this.",
        "source": "X11n0269_002:0729b17_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲貿交博也。",
        "translation": "The first of these is the phrase \"to be careful\".",
        "source": "X11n0269_002:0729b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲遷謂遷易以有博無販賤賣貴也遂利遠近唯利是求無擇所在。",
        "translation": "He said, \"I'm not going to be able to tell you what's going on.",
        "source": "X11n0269_002:0729b17_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲肆陳也疇壟田畝也。",
        "translation": "The first thing he did was to buy a large amount of goods.",
        "source": "X11n0269_002:0729b19_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲上穡者種曰稼斂曰穡。",
        "translation": "He said, \"I'm going to buy a large amount of seeds, and I'm going to buy a large amount of seeds.",
        "source": "X11n0269_002:0729b19_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲清濁殊流者剎帝利淨行是貴姓如清流毗舍首陀是賤姓如濁流。",
        "translation": "He said, \"It's a good idea to take a look at the monk's life.",
        "source": "X11n0269_002:0729b20_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲婚不通者貴賤各自婚嫁也。",
        "translation": "He said, \"It's not possible to marry a noble or a base family.",
        "source": "X11n0269_002:0729b21_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲飛伏異路者西土之制貴賤之姓行則各路居則異處。",
        "translation": "▲飛伏異路者西土之制貴賤之姓行則各路居則異處。",
        "source": "X11n0269_002:0729b22_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下隨情破執。",
        "translation": "He said, \"I'm going to go to the hospital, but I'm going to the hospital.",
        "source": "X11n0269_002:0729b23_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經若因土出下破有二義一約空土相異破二若無出入下約空土相即破。",
        "translation": "The first one is to refute the difference between the characteristics of the empty land and the second one is to refute the lack of access to the characteristics of the empty land.",
        "source": "X11n0269_002:0729b23_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二若此下顯真又二一示真性二斥邪說初又三一類通諸大。",
        "translation": "In the beginning, there were three categories, one of which was general to the major ones.",
        "source": "X11n0269_002:0729c01_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注或有下指長水也彼云夫言大者常徧為義常故無生滅動搖徧故時處悉有乃至云本如來藏故名為大。",
        "translation": "It's also called \"great\" because it means permanent and pervasive, permanent in the sense that there's no arising or ceasing, oscillation, and pervasive in the sense that all places and times are present, and even the original tathāgatagarbha is therefore called great.",
        "source": "X11n0269_002:0729c02_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難下反責迷心。",
        "translation": "△Two, Ānanda next rebukes the deluded mind.",
        "source": "X11n0269_002:0729c04_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三汝全下正示真性。",
        "translation": "△Three, under You Quan, he correctly explained the true nature.",
        "source": "X11n0269_002:0729c05_19",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經性覺真空性空真覺上句即真而俗下句即俗而真。",
        "translation": "The first phrase of the sūtra, 'nature awakens,' 'vacuum,' 'emptiness,' and 'true awakening,' means real and conventional, and the second phrase means conventional and real.",
        "source": "X11n0269_002:0729c05_20",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二世間下斥邪說六阿難下根大乃至識大科節如前。",
        "translation": "The second worldly aspect of the teaching denies wrong beliefs, and the sixth section of Ānanda's teaching on the greatness of faculties and even the greatness of consciousness is as described above.",
        "source": "X11n0269_002:0729c06_21",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注覺觸覺知皆意根者謂身根覺觸起分別時則屬意根此解恐非故私謂別釋經可狀成有不相成無珙鈔云上句色也下句空也於前境上復分此二即明暗色空之謂也。",
        "translation": "He said, \"When the body faculty feels and touches and knows that they are all mind faculties, it means that when the body faculty feels and touches discrimination, then it belongs to the mind faculty.",
        "source": "X11n0269_002:0729c07_22",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲識動見澄非和非合者此約根識動靜相違名非和合若望他境還破自生耳若風大中云風空性隔非和非合既對境論仍破他生也若火大中云日鏡相遠非和非合此乃自他相望正是破和合性隨義而說故非一塗。",
        "translation": "If you look at other objects, you're still refuting their own production. If you look at the wind and the sky and the nature of emptiness, you're still refuting their production.",
        "source": "X11n0269_002:0729c11_23",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二爾時下聞法領悟為二一經家敘事二阿難說偈初又二一敘悟心。",
        "translation": "The second time he heard the teaching and realized it, there were two ways: first, the sūtras described the situation, and second, Ānanda said in a verse, and first, he described the mind of enlightenment.",
        "source": "X11n0269_002:0729c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注十方即十界者然法華云深達罪福相徧照於十方以罪福在人故智者釋方以眾生為界今云心徧十方但以方所之方下文一切世間等自攝眾生也況迷妄有空依空立界宛成次第學者審之。",
        "translation": "It's because sentient beings are the boundary of sentient beings that the wise person interprets the direction of sentient beings as the boundary, and now it's said that the mind is pervasive in ten directions, but it's self-contained in sentient beings based on the direction of all the world below.",
        "source": "X11n0269_002:0729c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二禮佛下敘敬相。",
        "translation": "△Two prostrations to the Buddha are followed by a description of the mark of reverence.",
        "source": "X11n0269_002:0730a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二阿難說偈分四一讚德述益讚德二句先讚能說教主次讚所說行法。",
        "translation": "The first was to praise the person who taught, and the second was to praise the practice that was taught.",
        "source": "X11n0269_002:0730a03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注尊者十號之一此依釋論也若涅槃與瓔珞云一者如來乃至十者佛陀具足十號名世中尊以開無上士調御丈夫為兩號也孤山云所讚三德是佛所證乃由因中修乎三止三觀寂照心精而得斯果故阿難前請十方如來得成菩提妙奢摩他三摩禪那蓋請如來自行之因欲依修學既蒙開示已悟常心故還以三觀之因所克三德之果以讚於佛前後鉤鎖其義如是。",
        "translation": "He said, \"This is one of the ten epithets of the Bhagavān, which are based on the explanation of the treatises, and if Nirvana and Yingluo say one is the tathāgata and even ten is the Buddha, the ten epithets are called the honored among the world, and the two epithets are the initiator, the unsurpassed man, and the tamer.",
        "source": "X11n0269_002:0730a05_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲教行理三悉號楞嚴者問理是所冥豈曰楞嚴答例如說智及智處皆名為般若何妨說定及定處皆名為楞嚴。",
        "translation": "He said, \"The three principles of teaching and practice are all called śūraṃgama.\" He asked, \"Is this principle that is being investigated?\" Ans. For example, if we say that wisdom and the locus of wisdom are all called prajñāpāramitā, why would we say that concentration and the locus of concentration are all called śūraṃgama?",
        "source": "X11n0269_002:0730a12_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲乃至如唯識下圓師具引藏通別三教而為校量前引婆沙即藏教也次引大品明七地齊羅漢八地扶習潤生經無數劫然後成佛即通教也後引唯識明別教義今略中間也。",
        "translation": "The first one was the Vibhāṣā council, which is the collection council, and the second one was the great class, which explained the seventh ground, the eight ground, the cultivation, the birth, the passage of incalculable eons, and then the attainment of Buddhahood, which is the transmission council, and the second one was the consciousness-only council, which explained the meaning of the special council.",
        "source": "X11n0269_002:0730a14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲分見如來藏心者沇疏云據此境界合是別教登地圓教初住所證真如。",
        "translation": "The first part of the teaching is to see the mind of the tathāgatagarbha, and the second part is to understand that according to this object, it's the first abode of the differentiated teaching, the ground of the perfect teaching, and the realization of true reality.",
        "source": "X11n0269_002:0730a18_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲又解下必非經意引華嚴為例其事不類須據偈中不歷僧祇等者問此義可通圓人初心否答通說無妨如前文云若能轉物則同如來孤山亦約六即辨之今文所述既是佛世當機之眾須作分證法身而釋。",
        "translation": "He also explained that it must not be the intention of the scriptures to cite Huayan as an example, which is not the same thing, but must be interpreted according to the verse that doesn't go beyond the incipiency of the saṃgha, etc. He asked whether this meaning could be generalized to the first mind of perfect people.",
        "source": "X11n0269_002:0730a19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲阿難雖在眾中等者縱未真證亦應似證何於涅槃為魔所罥者彼經第三十六佛問陳如阿難比丘今何所在陳如曰在娑羅林外為六萬四千億魔之所嬈亂是諸魔眾悉自變身為如來像說種種法乃至示現神通變化阿難見已作是念言如是神變昔來未見誰之所作將非世尊釋迦作耶欲起欲語都不從意爾時文殊師利從佛受陀羅尼至阿難所說呪已魔王等發菩提心捨於魔業即放阿難來至佛所罥古法切係取也。",
        "translation": "Although Ānanda was among the many, even though he hadn't truly realized it, he should have seemed to realize it.",
        "source": "X11n0269_002:0730a23_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二願今下發願報恩長水云即於此身期獲證果故云願今予謂今者指我之辭以妙覺極果非即身可擭故。",
        "translation": "Second, he vowed that this would be the time when he would realize the fruit of his life, so he said, \"I vow that this would be the time when I would realize the fruit of my life because the ultimate fruit of marvelous enlightenment is not something that can be traced in the immediate body.",
        "source": "X11n0269_002:0730b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三伏請下請證求加又二一請證化他。",
        "translation": "He then asked the following three requests to realize his intention to seek rewards and two more requests to realize the transformation of others.",
        "source": "X11n0269_002:0730b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注願取土如釋迦谷響云按法華經授阿難記未來作佛號山海慧自在通王彼既已說故此不云然彼所明乃是淨土故云其國土清淨名常立勝幡而今誓取穢土者何乎且夫證悟常心虗空尚殞唯一本妙淨穢誰論但順物機乃有差別極論其致佛佛道齊故大論三十六云當知釋迦文佛更有清淨國如阿彌陀佛國阿彌陀佛亦有不嚴淨國如釋迦文佛國既彌陀釋迦各有淨穢今阿難取土兩經異說何必致疑況復此云穢土先入後取淨土於義彌通當知却來觀世間猶如夢中事夢土淨穢勝劣誰分庶幾後昆試思此旨。",
        "translation": "The Lotus Sutra granted Ānanda the assurance that he would become a future buddha named Shanhaihui Zizaitongwang, who had already explained this, so it wasn't a cloud.",
        "source": "X11n0269_002:0730b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二大雄下求加自行。",
        "translation": "The second Mahāyāna then sought to apply himself.",
        "source": "X11n0269_002:0730b21_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注法身之用者問法身無相其用若何答法身冥應潛通機感即其用焉備如法華玄義。",
        "translation": "He asked what the function of the markless Dharma body is, and answered that the Dharma body is a mysterious function that responds to potentialities and perceptions, which are its functions, as explained in the profound meaning of the Lotus Sutra.",
        "source": "X11n0269_002:0730b21_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四舜若下取譬結誓。",
        "translation": "He then asked, \"What is the function of the Dharma body without marks?\" and answered, \"The Dharma body is a mysterious function that responds to all sentient beings.",
        "source": "X11n0269_002:0730b23_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注比較音挍不等也。",
        "translation": "It's not the same as comparing sounds and making plans.",
        "source": "X11n0269_002:0730b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起第四卷",
        "translation": "From the Fourth Fascicle",
        "source": "X11n0269_002:0730c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二對滿慈破性相兩疑顯不空如來藏分三一經家敘儀二大威下滿慈述意為四一歎人法二世尊下述自他又二一述自。",
        "translation": "The second one was to refute the two doubts about the nature and characteristics of the Tathāgatagarbha and show that it's not empty.",
        "source": "X11n0269_002:0730c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經說法人中我為第一者據小乘言之。",
        "translation": "He said, \"The scripture says that I am the best among legal persons according to the lesser vehicle.",
        "source": "X11n0269_002:0730c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注本不似見者亦從昔日慧眼言之。",
        "translation": "He also said it from the eyes of wisdom from days gone by.",
        "source": "X11n0269_002:0730c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二世尊下述他。",
        "translation": "△Two world-honored ones are described as other below.",
        "source": "X11n0269_002:0730c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經我等會中登無漏者述同類也其間多是法身大士晦本垂迹引接小機如富樓那已於法華得受記莂當來成佛號曰法明等問若據迹論阿難初果滿慈無學前文阿難尚已開悟何故滿慈等猶紆疑悔耶答非謂前悟而今不疑亦非今疑以前未悟處相起教叩佛宣揚若乃一期觀此二人迷理之心不無輕重何者阿難從初據人法二執迷空如來藏其迷則重滿慈於此懷性相兩疑迷不空如來藏其迷則輕又則空如來藏理猶易明不空如來藏義復難解是故阿難初果發起於前滿慈無學對揚於後孤山云前得悟者是上根利智今未悟者是中下之機今謂不然諸經說法若被中下須有委曲逗會之意如法華譬喻因緣二周開權顯實雖與法說不殊而比況指昔稍成委曲今經所談不空藏義蓋與空藏二義相成文旨愈深未易開解前阿難云希更審除微細惑意在茲矣苟分利鈍恐枉當機予甞議之若於此經欲分三根者從阿難請行已前雖通被三根其得悟者皆上根也請行已後方被中下然於行中有正有助亦可以正為中以助為下云云。",
        "translation": "The first part of the sutra was about the first person to attain enlightenment, and the second part was about the first person to attain enlightenment, and the second part was about the second person to attain enlightenment.",
        "source": "X11n0269_002:0730c06_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三世尊下疑性相又二一疑藏性云何生相。",
        "translation": "△There are two doubts about the nature and characteristics of the tripiṭaka, and one doubt about how the nature of the store came into being.",
        "source": "X11n0269_002:0731a01_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經云何忽生下前文雖曰隨眾生心應所知量循業發現但總略而說且未委明諸法生起之由故今疑問廣談世間性相等義山河大地依報也諸有為相正報也依正各有生住異滅故云次第遷流等。",
        "translation": "Although the previous section says that according to the minds of sentient beings, we should know the amount and follow the discovery of karma, but it's a general statement that doesn't specify the causes of the arising of all phenomena.",
        "source": "X11n0269_002:0731a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲二又下疑大性云何俱徧。",
        "translation": "He also wondered how the great nature of the two is universal.",
        "source": "X11n0269_002:0731a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經陵滅者蒼頡篇云陵侵也或作淩其義亦同。",
        "translation": "▲經陵滅者蒼頡篇云陵侵也或作淩其義亦同。",
        "source": "X11n0269_002:0731a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四惟願下請開示。",
        "translation": "△4. May it please him to reveal it.",
        "source": "X11n0269_002:0731a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三爾時下如來演說為二一總告二正說初又四一許宣二令汝下示蓋。",
        "translation": "The first one was to permit the proclamation of the second one, and the second one was to allow you to reveal the cover.",
        "source": "X11n0269_002:0731a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經未得二空下問佛意欲令未得空者而得於空此與不空如來藏義云何銷會答如說空華元由翳目從有所見知華本空談不空義亦為顯空耳。",
        "translation": "He asked what the Buddha's intention was to make those who hadn't yet attained emptiness attain emptiness, and how did he reconcile this with the meaning of the Tathāgatagarbha as not-empty?",
        "source": "X11n0269_002:0731a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注五性之宗楞伽經云一聲聞性二辟支佛性三如來乘性四不定乘性五無性謂一闡提佛地論莊嚴論瑜伽論皆說五性大同楞伽谷響云五性者三無二有祖於彌勒宗於天親析薪于玄奘克荷于慈恩立言垂範自為極唱今準此經顯知權說(鈔文)問纂要云法華與勝鬘經但迴不定性二乘今經兼迴定性是故最勝也斯義可否答甚不可也且法華中生滅度想者而於彼土求佛智慧豈非迴定性耶勝鬘云羅漢支佛自知當得阿耨菩提此對菩薩說其往昔元發大心後終歸大非對二乘彰灼開顯問今經定性皆獲一乘為現世獲為同法華彼土方獲答二義俱通若爾法華應無現獲者耶此須善會經旨經云若有比丘實得阿羅漢若不信此法無有是處斯乃逼令現世迴心從除佛滅度後方指未來迴心者耳若解此意勿謗法華劣於今經也。",
        "translation": "The five natures of the five schools are described in the Laṅkâvatāra-sūtra as the śrāvaka nature, the two pratyekabuddha natures, the three tathāgata vehicle natures, the four indeterminate vehicle natures, and the five non-natures of the five schools, which are described in the Yajñadatta-bodhisattva-śāstra, the Zong, the Tianxin-analysis-firewood, the Xuanzang-keho, the Compassionate Grace-established speech, the vertical example, and the self-serving, ultimate rendition of the scriptures.",
        "source": "X11n0269_002:0731a12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三汝今下誡聽。",
        "translation": "△3. Now, here's your warning to listen.",
        "source": "X11n0269_002:0731b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四富樓下承旨。",
        "translation": "△Four, Fulu, and below, we'll acknowledge the teaching.",
        "source": "X11n0269_002:0731b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二佛言下正說為二一釋藏性生相疑二釋大性俱徧疑初又四一牒前疑二汝常下舉常說又二一問。",
        "translation": "In the beginning, there were four explanations of the doubts that arose from the nature of the store and two explanations of the doubts that the nature of the great universal.",
        "source": "X11n0269_002:0731b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注興福下彼云性覺妙明者妄覺也發性緣明因明覺生生遂名妄妄明云妙本覺明妙者本真也本源沖寂寂體無迷妙淨常如故云明妙資中下彼云性覺妙明者在纏真如也本性清淨不為煩惱所染名為性覺。",
        "translation": "In this article, we'll talk about the nature of the mind and the awareness of the deluded awareness that arises from the conditioned awareness of the nature, the awareness of the cause, the awareness of the birth, and the resulting name, deluded awareness, and the awareness of the marvelous nature of the awakening.",
        "source": "X11n0269_002:0731b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲本覺明妙者出纏真如也從無分別智覺盡無始妄念名究竟覺始覺即本覺悟本之覺名為本覺。",
        "translation": "The original enlightenment, luminous and marvelous, is that which is free from the tethers of true thusness and which comes from nondiscriminating cognition, and which ends beginning deluded thoughts and is called final enlightenment, the beginning enlightenment that is the original enlightenment, the enlightenment that is the origin, and which is called original enlightenment.",
        "source": "X11n0269_002:0731b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲又解下節疏具云體即用故下文云我以妙明不滅不生合如來藏而如來藏唯妙覺明是故於中一為無量等用即體故下文云觀性元真唯妙覺明妙覺明心先非水火等。",
        "translation": "He also explained that the following section of the commentary says that essence is function, and therefore the following section says that we combine the Tathāgatagarbha with the Tathāgatagarbha because of its marvelous awareness that doesn't cease or arise, and that the Tathāgatagarbha is only the awareness of the marvelous awakening.",
        "source": "X11n0269_002:0731b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲變其文者谷響云變文之例儒釋咸然舜典云流共工于幽州放驩兜于崇山竄三苗于三危極鯀于羽山孔安國曰極竄放流皆誅也異其文述作之體。",
        "translation": "He said, \"I'm not sure if it's a good idea, but I think it's a good idea.",
        "source": "X11n0269_002:0731b15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲能所雙絕者二與一性其體元同故。",
        "translation": "He said, \"The essence of the two is the same as the essence of unity.",
        "source": "X11n0269_002:0731b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲寂照互融者二亦無二其用常合故即寂而照下示互融之相也此性覺妙明本覺明妙有似瓔珞經云等覺照寂妙覺寂照但彼二句分對因果俱約修說今唯顯性是故互融問以妙明為寂照其有證乎答智者云法性寂然名止寂而常照名觀荊谿云止體靜觀體明故知寂照即靜明靜明即妙明也老子曰常無欲以觀其妙明皇注云人生而靜天之性感物而動性之欲若常守清靜解心釋神變照正性則觀乎妙本矣此豈非以妙為靜耶秪是本性之覺妙明互融者荊谿云若知煩惱及以生死本性清淨名之為寂本性如空名之為照。",
        "translation": "▲寂照互融者二亦無二其用常合故即寂而照下示互融之相也此性覺妙明本覺明妙有似瓔珞經云等覺照寂妙覺寂照但彼二句分對因果俱約修說今唯顯性是故互融問以妙明為寂照其有證乎答智者云法性寂然名止寂而常照名觀荊谿云止體靜觀體明故知寂照即靜明靜明即妙明也老子曰常無欲以觀其妙明皇注云人生而靜天之性感物而動性之欲若常守清靜解心釋神變照正性則觀乎妙本矣此豈非以妙為靜耶秪是本性之覺妙明互融者荊谿云若知煩惱及以生死本性清淨名之為寂本性如空名之為照。",
        "source": "X11n0269_002:0731b19_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲髣髴者謂見物未諦相似之貌也夫藏性希微本絕言象非佛智眼莫能究盡如上所解且銷現文未敢言其明了故云髣髴在茲。",
        "translation": "The term \"vaguely resembles\" refers to the appearance of seeing things that are not yet truly resembled, but the hidden nature is extremely subtle and originally cut off from language and images that cannot be fully investigated by the Buddha's wise eye as explained above, and the present context is not yet fully explained.",
        "source": "X11n0269_002:0731c05_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲辭異意同者當以二句次第配之一一句中皆有三義。",
        "translation": "If the words are different but the meaning is the same, then the two phrases should be taken together in sequence, for there are three meanings in one phrase.",
        "source": "X11n0269_002:0731c08_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二富樓下答。",
        "translation": "△Two: \"Fulu replied.",
        "source": "X11n0269_002:0731c09_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三佛言下研現解又二一問。",
        "translation": "The first one is a question, and the second one is a question.",
        "source": "X11n0269_002:0731c09_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注次問則別者且孤山以妄為覺既釋上句云為是覺體不明將何以辨虗妄分別稱為明覺耶長水以他為覺亦釋上句云為復覺自不明又何以知由覺他明明與覺異名為明覺耶若如二師所解並須於經更添句逗方顯其義斯由不曉上句中覺字是修非性故釋故句曲成己意耳。",
        "translation": "Since Gushan interpreted the above sentence as deluded as awakening and explained that the essence of awakening was unclear, how could he discern that the deluded and the unenlightened were separately called luminous awakening?",
        "source": "X11n0269_002:0731c10_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二富樓下答。",
        "translation": "△Two Fulu replied below.",
        "source": "X11n0269_002:0731c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四佛言下顯正義為二一通示真妄二別示迷悟初又二一真覺非妄明。",
        "translation": "In the beginning, there were two ways to show true delusion and two ways to show delusion and awakening.",
        "source": "X11n0269_002:0731c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注無明尚混者從分證已還皆真妄相混故。",
        "translation": "The commentary on ignorance is still confused because it's true and deluded that have been confused since the partial realization.",
        "source": "X11n0269_002:0731c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二性覺下真明生妄覺。",
        "translation": "The first two, true awareness and non-deluded awareness, are not deluded awareness.",
        "source": "X11n0269_002:0731c18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經妄為明覺者明覺二字俱通能所注中為令易解一往分之。",
        "translation": "In order to make it easier to understand, the two words \"true awakening\" and \"non-deluded awakening\" are both used in the explanation of the subject and the object.",
        "source": "X11n0269_002:0731c19_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二覺非下別示迷悟分二一迷真故妄相忽生二悟真故妄相永寂初又二一略示二廣顯初又二一立妄法二示妄相初又二一立能所。",
        "translation": "The first two are the establishment of a false dharma and the second is the establishment of a false mark.",
        "source": "X11n0269_002:0731c20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注然有二義下一約悟二約迷應知迷中未圓修時則無理智悟中未極證時必兼惑。",
        "translation": "It should be understood that when you're in delusion and haven't fully cultivated, then there's no cognition of principle, and when you're in enlightenment and haven't fully realized, there must be confusion as well.",
        "source": "X11n0269_002:0731c23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲相涉於立法立修二義者問不空如來藏為二義俱取為但取立法耶答正取立法旁通立修以修有智行因果亦屬□□不空至因果泯亡方顯本性空如來藏。",
        "translation": "He asked, \"Does the Tathāgatagarbha that's not empty have both meanings and does it only have the legislative meaning?\" A: He correctly takes the legislative meaning and partially establishes the cultivation because the cultivation of wisdom, practice, cause and effect are also part of the Tathāgatagarbha that's not empty until the cause and effect are extinguished, then the Tathāgatagarbha's original nature is revealed as empty.",
        "source": "X11n0269_002:0731c24_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二無同下立境界。",
        "translation": "△Two are not the same, but the following is a definition of the objective realm.",
        "source": "X11n0269_002:0732a03_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲注資中下彼云熾然成異即業相因異立同即轉相無同無異即現相云云孤山下彼云異即六道執有同即二乘執空無同異即菩薩取中此九界執秪是一根本無明冥具此事耳云云。",
        "translation": "He said, \"I'm going to inject money into the middle of the world, and then he said, 'I'm going to become different,' which is the mark of karma, and then he said, 'I'm going to establish sameness,' which is the mark of transformation, and then he said, 'I'm going to establish sameness,' which is the mark of manifestation, and then he said, 'I'm going to establish difference,' which is the mark of karma, and then he said, 'I'm going to establish sameness,' which is the mark of transformation, and then he said, 'I'm going to establish sameness,' which is the mark of manifestation.",
        "source": "X11n0269_002:0732a04_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲不韙者左傳息侯伐鄭犯五不韙杜預云韙是也。",
        "translation": "He said, \"This is the case of the five acts of disloyalty committed by Zuo Zhou against Zheng.",
        "source": "X11n0269_002:0732a07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲若論三細者起信云無明為因生三細一無明業相以依不覺故心動說名為業覺則不動動則有苦果不離因故二能見相以依不覺故能見不動則無見三境界相以依能見故境界妄現離見則無境界。",
        "translation": "He said, \"I'm not sure if this is the right thing to do, but I'm sure it's the right thing to do.",
        "source": "X11n0269_002:0732a08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲斯由下論云依如來藏故有生滅心所謂不生不滅與生滅和合非一非異名阿棃耶識今云而分三相者以三細屬棃耶故藏法師疏引楞伽經以七識染法為生滅以如來藏淨法為不生滅此二和合為阿棃耶識以和合故非一非異。",
        "translation": "In the second half of the book, the mind of arising and ceasing is based on the Tathāgatagarbha, and the combination of nonarising and non-ceasing and arising and ceasing is not one and the same as the concept called ācārya consciousness.",
        "source": "X11n0269_002:0732a12_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲六麤者疏云境界為緣生六麤一知相依於境界心起分別受與不受故二相續相依於智故生其苦樂覺心起念相應不斷故三執取相依於相續緣念境界住持苦樂心起著故四計名字相依於妄執分別假名言相故五起業相依於名字尋名取著造種種業故六業繫苦相以依業受報不自在故藏疏明三細六麤躡前起後略有八重一以一心為本二不覺一心成業相三能見相四境界相五分別相續(法執)六取著計名(人執)七造業八受報今經同異等蓋由人法二執造九界業受依正二報之相故云合是六麤境界。",
        "translation": "The first one is the knowledge that the mind depends on the objective realm to give rise to discrimination of feeling and non-acquisition. The second one is the continuity that depends on the knowledge to give rise to suffering and happiness that is associated with the mind's awareness and continuity of mindfulness of the objective realm and the mind's attachment to suffering and happiness that depends on the attachment to the continuity of the objective realm.",
        "source": "X11n0269_002:0732a17_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲又若以惑性所具等者惑性即根本無明此與法性無始同體故云須在性覺必明等二句中攝淨名云從無住本立一切法今惑性即其本也。",
        "translation": "The reason is that the nature of confusion is the root of ignorance, which is the same as the nature of dharmas from beginningless time, so it's necessary to gather the pure name in two sentences, saying that from the root of nonabidingness all dharmas are established, and the nature of confusion is their root.",
        "source": "X11n0269_002:0732b03_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲其猶下此喻理造未有事造也苟失大塗請從良導者若謂私解失於大塗請從舊師良者之導。",
        "translation": "If you lose the great sorrow, please follow the good guidance of someone who means to privately understand that you've lost the great sorrow, and please follow the guidance of an old teacher who is good.",
        "source": "X11n0269_002:0732b06_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二如是下示妄相又二一示因相。",
        "translation": "He said, \"This is the second time I've shown the false aspect, and the second time I've shown the causal aspect.",
        "source": "X11n0269_002:0732b08_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "▲經自相渾濁者見與見緣似現前境元我覺明故云自也。",
        "translation": "▲The sūtra's own aspect is turbid, because views and perceptions seem to be contingent on the manifest object, which is the original self, awareness, and insight.",
        "source": "X11n0269_002:0732b09_17",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二起為下示果相沇疏云起是動即是風因風動搖積成世界故云起為世界動息之處即名為靜是前同相結成虗空故云虗空為同彼無同異真有為法即前無同異相結成有情含藏識也今難曰起是動相意謂動相即前業相業相起風結成世界且世界之與虗空乃三細中現相此相並由業轉而現豈可業相唯結世界轉相獨成虗空又以無同異相結成含藏識者斯更不可也既將無同異相對於現相現相即是藏識豈可復生藏識耶又若前三結成此三經文秪合云同為虗空異為世界彼無同異成有為法何文義之倒昧乎孤山謂由前性中計異之心外感世界立同之心外感虗空彼無同異心乃但中之妄執非真性無為之無同異也名既濫真故簡示云真有為法今難曰若由性計而感空界其文亦倒且計異之心豈不感空立同之心豈不感界以六道二乘皆迷妄有空依空立界故又則前同異二心既感外相無同異心那無所感乎縱巧銷其文終非經意故集解中斯皆別釋或曰狂簡試為裁之。",
        "translation": "The first one is the result of the formation of the world because the wind moves and shakes it into a world, so it's called the stillness of the world, and it's the same as the previous one, which is the formation of space, so the space is the same as the previous one, which has no similarities and differences, and the true existential law, which is the formation of sentient beings and the store consciousness, is confused in meaning.",
        "source": "X11n0269_002:0732b10_18",
        "is_bad_quality": false
    },
    {
        "source_sentence": "首楞嚴經集解熏聞記卷第二",
        "translation": "Shoulengyan jing ji jie fumeng ji vol. 2",
        "source": "X11n0269_002:0732c05_0",
        "is_bad_quality": false
    }
]