[
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩",
        "translation": "bodhisattvas who have fully realized the meaning of the esoteric cause of the great buddha-tathāgata",
        "source": "X13n0285_001:0220b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "萬行首楞嚴經卷第一文句",
        "translation": "Wansheng shoulengyan jing roll 1 wenju",
        "source": "X13n0285_001:0220b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唐天竺沙門般剌密諦　譯經",
        "translation": "Translation of the Sutra by the Tang Dynasty Indian Master Pāramitā",
        "source": "X13n0285_001:0220b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明菩薩沙彌古吳智旭　文句",
        "translation": "Ming Pusa shami gu Wu Zhixu Wenju",
        "source": "X13n0285_001:0220b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明菩薩比丘溫陵道昉　參訂",
        "translation": "Ming bodhisattva bhikṣu Wenling Daofang Censored",
        "source": "X13n0285_001:0220b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經題具如玄義中說今更略提綱要此經以人法為名謂此大佛頂法非因非果一切因果無不依之如來果人以此為密因故若修若證無非了義而果徹因源諸菩薩因人亦以此具足萬行故根塵識大一切皆得畢竟堅固而因該果海也如來藏妙真如性為體由法法皆如來藏故稱為大佛頂也不生不滅因果為宗因果皆不生滅故稱密因也離愛得脫為用永離諸愛究竟解脫故號首楞嚴也生酥毒發為教相此是方等部中圓頓味也。",
        "translation": "The title of the sūtra is exactly as explained in the Profound Meaning. Now, I'll briefly outline the essentials. This sūtra is called the Dharma of people, which means that this great buddha-peak dharma is neither cause nor effect, and all causes and effects don't depend on it.",
        "source": "X13n0285_001:0220b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將釋經文大分為三初從如是我聞至歸來佛所是序分次從阿難見佛至第十卷知有涅槃不戀三界是正宗分後從阿難若復有人至終是流通分。",
        "translation": "The first is from Thus Have I Heard to Reaching the Buddha, which is the preface; the second is from Ānanda's seeing the Buddha to the tenth roll knowing there's nirvāṇa and not clinging to the three realms, which is the main tenet; and the final is from Ānanda's seeing another person to the end, which is the circulation section.",
        "source": "X13n0285_001:0220b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初序分二初通序二別序。",
        "translation": "The first preface is divided into two parts: the first is a general preface and the second is a specific preface.",
        "source": "X13n0285_001:0220c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初通序者證信序也諸經同有故名為通以此六義證成可信故名證信六義者如是二字顯所信法體成就我聞二字顯能聞成就一時二字顯機感成就佛字顯說法主成就在室羅筏城等顯所依說法處成就與大比丘以下具列常隨雲集兩類顯同聞眾成就今恐割裂經文不便句讀總科為二一標聞說時處二引大眾同聞。",
        "translation": "The first is a generic preface that demonstrates faith; it's called generic because they're all found in the same sūtra. The six meanings are thus called demonstrating faith because they're credible. The two words thus indicate the accomplishment of the teaching that's believed in, the two words I've heard indicate the accomplishment of what can be heard, and the two words at one time indicate the accomplishment of the feelings that are experienced, the word Buddha indicates the accomplishment of the speaker of the teaching, the accomplishment of the place of the teaching that's relied upon, and the following two categories, such as the great bhikṣus, are listed below, which always follow the gathering of clouds and indicate the accomplishment of the multitude of people who hear together.",
        "source": "X13n0285_001:0220c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一標聞說時處所聞即法體能聞即我所說亦即法體能說即佛也時處可知。",
        "translation": "The first is to indicate the time and place of hearing and speaking, where what's heard is the Dharma body, what's heard is the self, which is the Dharma body, and what's spoken is the Buddha.",
        "source": "X13n0285_001:0220c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是我聞一時佛在室羅筏城祇桓精舍。",
        "translation": "Thus, I heard that one time the Buddha was at the Jetavana monastery in Śrāvastī.",
        "source": "X13n0285_001:0220c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是者指法之辭通指下文十卷文義而言亦是信順之義大凡信者則謂是事如是不信者則謂是事不如是今言如是即顯信順也我者阿難自稱此非外道妄計之我亦非凡夫妄執之我乃深達八自在我非我非無我而隨世假名稱為我也聞者耳根發耳識能達音聲現量體性也一時者機應相符說聽終竟總名一時佛者自覺覺他覺行圓滿即是娑婆教主釋迦牟尼在者示迹此間行住坐臥總名為在室羅筏城或云舍衛梵音楚夏之別此翻豐德亦翻聞物亦翻好道即憍薩羅國之城名也祇桓者本是祇陀太子之園梵語祇陀此云戰勝精舍者給孤獨居士為佛及僧所構精修梵行之處也。",
        "translation": "Thus refers to the words of the teaching and generally refers to the meaning of the following ten scrolls, which is also the meaning of faithfulness and conformity.",
        "source": "X13n0285_001:0220c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此五事證信一往雖通而所序各別所謂如是法異我聞聞異一時時異乃至能住所住各異若不稍為發明安知其為此經通序且文旨既泛將何以為隨文入觀之階故今不敢避繁一一皆作約教觀心二釋初約教釋如是者若言俗諦中有文字真諦則無文字阿難傳佛俗諦文字與佛說不異故名為如因此俗諦文字會真諦理故名為是此三藏經初明如是也若言佛明色即是空空即是色色空空色無二無別空色不異為如即事而真為是阿難傳佛文不異為如能詮即所詮為是此通教經初明如是也若言佛明生死是有邊涅槃是無邊出生死有邊入涅槃無邊出涅槃無邊入於中道阿難傳此出有入無出無入中之法與佛說無異名如從淺至深無非曰是此別教經初明如是也若言佛明生死即涅槃亦即中道況復涅槃寧非中道真如法界實性實際徧一切處無非佛法阿難傳此與佛說無異故名為如如如不動故名為是此圓教經初明如是也今經陰入處界皆如來藏性真圓融本無生滅的是圓教如是而三卷中云此法亦緣非得法性者不過因當機迷重聊借三藏中義還破三藏中習正所謂彈偏斥小義也觀心釋如是者觀心惟是生滅審諦不謬為如破除生滅會於真諦名是折空意也觀心生滅無性為如了達當體無生為是體空意也觀心中道不變名如永捨二邊名是次第意也觀心全體法界名如即邊即中名是一心意也次約教釋我者若言凡夫有三種我謂我見我慢及名字我學人無我見惟二種我無學并無我慢惟名字我今阿難是學人無邪我能伏慢我但隨世名字稱我無咎此三藏意也若云四句稱我皆隨邪見佛正法中無我誰聞此通教意也若云阿難多聞士知我無我而不二雙分別我無我此別教意也若云阿難知我無我而不二方便為侍者傳持如來無礙智慧以自在音聲傳權傳實無所不可此圓教意也今經如來藏性三義圓融非我即我離即離非是即非即的是圓教真我意也觀心釋我者觀一念心屬因緣所生是假名我觀心即空是我無我觀心即假是分別我與非我觀心即中是真妙我次約教釋聞者有聞聞有聞不聞有不聞聞有不聞不聞聞聞者耳根不壞聲在可聞處作心欲聞眾緣和合故有聞藏教意也聞不聞者隨世俗說假名為聞第一義中無聲無字安有能聞所聞通教意也不聞聞者妙性本自離名絕相依假名分別則有聞與不聞別教意也不聞不聞者性既離名絕相則一切根塵無不當體離名絕相此經明七大一一清淨本然周徧法界圓教意也觀心釋聞者觀因緣所生法是觀聞聞觀因緣即空是觀聞不聞觀因緣即空即假是觀不聞聞觀因緣即空即假即中是觀不聞不聞次約教釋一時者時無實法依色心相續分位則有長短劫數不同藏教意也一念不生三際叵得通教意也於一無住法性分別世界劫數無量差別別教意也十世古今始終不離當念一念普觀無量劫無去無來亦無住圓教意也又見諦已上無學已下名一時藏教也三乘同入第一義名一時通教也登地已上名一時別教也初發心時便成正覺名一時圓教也今經不歷僧祇獲法身狂心頓歇歇即菩提是圓教一時觀心釋一時者觀心因緣生法是假名時觀心即空是不可得時觀心即假是分別種種時觀心即中是不思議時次約教釋佛者梵語佛陀此云覺者知者若言菩提樹下三十四心斷結正習俱盡既自覺悟生滅四諦亦以生滅四諦覺他即藏教佛相若言正使先斷今機緣熟時於道樹下以一念相應慧斷餘殘習現帶劣勝應身轉無生四諦法輪者即通佛自覺覺他相若言次第斷盡三惑坐蓮華臺藏世界轉無量四諦法輪者即別佛自覺覺他相若言一心圓斷三惑至於究竟證不可思議法身而能示現一切佛身一一身相同於虗空不可思議能轉無作四諦法輪亦能方便轉前三教法輪者即圓佛自覺覺他相今經云我以妙明不滅不生合如來藏而如來藏惟妙覺明圓炤法界是故於中一為無量無量為一小中現大大中現小等當知的是圓教佛相觀心釋佛者觀心因緣生法是藏佛觀心因緣即空是通佛觀心因緣先空次假後中是別佛觀心因緣即空假中是圓佛也次約教釋在者行住坐臥通名為在在即是住住即攝餘三儀今當以住釋在復有兩番能住所住佛為能住天住梵住聖住佛住等法為所住又法為能住精舍為所住也十善名天住是天道因故慈悲喜捨名梵住是梵天因故三三昧名聖住是出世法故首楞嚴三昧名佛住是無上法故若言從折空觀發真無漏住有餘涅槃示迹人間以十善四等應世間機以三三昧應出世機者是藏教佛住若言從體空觀發真無漏住有餘涅槃示迹人間亦以天梵二住應世間機以聖住應出世機者是通佛住若言從次第三觀住三德祕藏示迹人間遍用四種住應世出世機者是別佛住若言從一心三觀住三德祕藏示迹人間亦徧用四住應世出世機而能住四法所住諸處一一無非三德祕藏者即圓佛住今經云於一毛端現寶王剎坐微塵裏轉大法輪的是圓教佛住也觀心釋住者觀住於境或住無常境住即假即中即空等境以無住法住於境中故名為在次約教釋室羅筏城祇恒精舍者若見此處土砂艸木石壁是藏教境若見此處清淨七寶莊嚴是通教境若見此處即華藏世界是別教境若見此處即不可思議諸佛境界是圓教境今經云一切眾生為物所轉故於是中觀大觀小若能轉物則同如來身心圓明不動道場於一毛端徧能含受十方國土當知此處即常寂光而隨機所見自成差別耳觀心釋城舍者涅槃名城慈悲名舍觀思議十二因緣滅住真諦城入生緣慈悲舍藏教也觀思議十二因緣不生不滅住真諦城入生緣法緣慈悲舍通教也觀不思議十二因緣滅住中道涅槃城入生緣法緣無緣次第三慈悲舍別教也觀不思議十二因緣不生不滅住中道涅槃城入一心三緣大慈悲舍圓教也若不約教安知全事即理若不觀心安知全性成修讀者幸深思之。",
        "translation": "然此五事證信一往雖通而所序各別所謂如是法異我聞聞異一時時異乃至能住所住各異若不稍為發明安知其為此經通序且文旨既泛將何以為隨文入觀之階故今不敢避繁一一皆作約教觀心二釋初約教釋如是者若言俗諦中有文字真諦則無文字阿難傳佛俗諦文字與佛說不異故名為如因此俗諦文字會真諦理故名為是此三藏經初明如是也若言佛明色即是空空即是色色空空色無二無別空色不異為如即事而真為是阿難傳佛文不異為如能詮即所詮為是此通教經初明如是也若言佛明生死是有邊涅槃是無邊出生死有邊入涅槃無邊出涅槃無邊入於中道阿難傳此出有入無出無入中之法與佛說無異名如從淺至深無非曰是此別教經初明如是也若言佛明生死即涅槃亦即中道況復涅槃寧非中道真如法界實性實際徧一切處無非佛法阿難傳此與佛說無異故名為如如如不動故名為是此圓教經初明如是也今經陰入處界皆如來藏性真圓融本無生滅的是圓教如是而三卷中云此法亦緣非得法性者不過因當機迷重聊借三藏中義還破三藏中習正所謂彈偏斥小義也觀心釋如是者觀心惟是生滅審諦不謬為如破除生滅會於真諦名是折空意也觀心生滅無性為如了達當體無生為是體空意也觀心中道不變名如永捨二邊名是次第意也觀心全體法界名如即邊即中名是一心意也次約教釋我者若言凡夫有三種我謂我見我慢及名字我學人無我見惟二種我無學并無我慢惟名字我今阿難是學人無邪我能伏慢我但隨世名字稱我無咎此三藏意也若云四句稱我皆隨邪見佛正法中無我誰聞此通教意也若云阿難多聞士知我無我而不二雙分別我無我此別教意也若云阿難知我無我而不二方便為侍者傳持如來無礙智慧以自在音聲傳權傳實無所不可此圓教意也今經如來藏性三義圓融非我即我離即離非是即非即的是圓教真我意也觀心釋我者觀一念心屬因緣所生是假名我觀心即空是我無我觀心即假是分別我與非我觀心即中是真妙我次約教釋聞者有聞聞有聞不聞有不聞聞有不聞不聞聞聞者耳根不壞聲在可聞處作心欲聞眾緣和合故有聞藏教意也聞不聞者隨世俗說假名為聞第一義中無聲無字安有能聞所聞通教意也不聞聞者妙性本自離名絕相依假名分別則有聞與不聞別教意也不聞不聞者性既離名絕相則一切根塵無不當體離名絕相此經明七大一一清淨本然周徧法界圓教意也觀心釋聞者觀因緣所生法是觀聞聞觀因緣即空是觀聞不聞觀因緣即空即假是觀不聞聞觀因緣即空即假即中是觀不聞不聞次約教釋一時者時無實法依色心相續分位則有長短劫數不同藏教意也一念不生三際叵得通教意也於一無住法性分別世界劫數無量差別別教意也十世古今始終不離當念一念普觀無量劫無去無來亦無住圓教意也又見諦已上無學已下名一時藏教也三乘同入第一義名一時通教也登地已上名一時別教也初發心時便成正覺名一時圓教也今經不歷僧祇獲法身狂心頓歇歇即菩提是圓教一時觀心釋一時者觀心因緣生法是假名時觀心即空是不可得時觀心即假是分別種種時觀心即中是不思議時次約教釋佛者梵語佛陀此云覺者知者若言菩提樹下三十四心斷結正習俱盡既自覺悟生滅四諦亦以生滅四諦覺他即藏教佛相若言正使先斷今機緣熟時於道樹下以一念相應慧斷餘殘習現帶劣勝應身轉無生四諦法輪者即通佛自覺覺他相若言次第斷盡三惑坐蓮華臺藏世界轉無量四諦法輪者即別佛自覺覺他相若言一心圓斷三惑至於究竟證不可思議法身而能示現一切佛身一一身相同於虗空不可思議能轉無作四諦法輪亦能方便轉前三教法輪者即圓佛自覺覺他相今經云我以妙明不滅不生合如來藏而如來藏惟妙覺明圓炤法界是故於中一為無量無量為一小中現大大中現小等當知的是圓教佛相觀心釋佛者觀心因緣生法是藏佛觀心因緣即空是通佛觀心因緣先空次假後中是別佛觀心因緣即空假中是圓佛也次約教釋在者行住坐臥通名為在在即是住住即攝餘三儀今當以住釋在復有兩番能住所住佛為能住天住梵住聖住佛住等法為所住又法為能住精舍為所住也十善名天住是天道因故慈悲喜捨名梵住是梵天因故三三昧名聖住是出世法故首楞嚴三昧名佛住是無上法故若言從折空觀發真無漏住有餘涅槃示迹人間以十善四等應世間機以三三昧應出世機者是藏教佛住若言從體空觀發真無漏住有餘涅槃示迹人間亦以天梵二住應世間機以聖住應出世機者是通佛住若言從次第三觀住三德祕藏示迹人間遍用四種住應世出世機者是別佛住若言從一心三觀住三德祕藏示迹人間亦徧用四住應世出世機而能住四法所住諸處一一無非三德祕藏者即圓佛住今經云於一毛端現寶王剎坐微塵裏轉大法輪的是圓教佛住也觀心釋住者觀住於境或住無常境住即假即中即空等境以無住法住於境中故名為在次約教釋室羅筏城祇恒精舍者若見此處土砂艸木石壁是藏教境若見此處清淨七寶莊嚴是通教境若見此處即華藏世界是別教境若見此處即不可思議諸佛境界是圓教境今經云一切眾生為物所轉故於是中觀大觀小若能轉物則同如來身心圓明不動道場於一毛端徧能含受十方國土當知此處即常寂光而隨機所見自成差別耳觀心釋城舍者涅槃名城慈悲名舍觀思議十二因緣滅住真諦城入生緣慈悲舍藏教也觀思議十二因緣不生不滅住真諦城入生緣法緣慈悲舍通教也觀不思議十二因緣滅住中道涅槃城入生緣法緣無緣次第三慈悲舍別教也觀不思議十二因緣不生不滅住中道涅槃城入一心三緣大慈悲舍圓教也若不約教安知全事即理若不觀心安知全性成修讀者幸深思之。",
        "source": "X13n0285_001:0220c23_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "二引大眾同聞復為三初聲聞眾二緣覺眾三菩薩眾聲聞是常隨眾餘二皆雲集眾也。",
        "translation": "The second group of people who are led to hear the same thing is further divided into three groups: first, the śrāvaka group, second, the pratyekabuddha group, and third, the bodhisattva group.",
        "source": "X13n0285_001:0222b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初聲聞眾又為三初示類標數二顯位歎德三列上首名。",
        "translation": "The first śrāvaka congregation is further divided into three: first, it shows the types and numbers, second, it shows the stages and praises the virtues, and third, it lists the names of the leaders.",
        "source": "X13n0285_001:0222b13_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初示類標數大比丘是示類千二百五十人是標數也。",
        "translation": "The first shows the type and indicates the number. The great monks are shown to be a type of twelve hundred and fifty people, which is the indicated number.",
        "source": "X13n0285_001:0222b14_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與大比丘眾千二百五十人俱。",
        "translation": "He's with the great assembly of bhikṣus, which numbers 1,250 people.",
        "source": "X13n0285_001:0222b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與者共義釋論以七一解共謂一時一處一戒一心一見一道一解脫也大者梵語摩訶具大多勝三義器量尊重為天王等大人所敬故言大徧知內外經書故言多超出九十五種外道故言勝今稱為大即攝多勝二義比丘含三義一怖魔二破惡三乞士或翻除饉怖魔者魔王居第六天統攝欲界貪戀塵勞恐人修道出其境界若正法住世時有信心男子六根具足年滿二十無十三重難亦無十六輕遮得三師七證或邊地中得三師二證如法秉受比丘戒法正登壇白四羯磨已竟名為得式成比丘性入僧寶數中爾時地行羅剎高聲唱善此間有善男子如法出家當使諸天增盛修羅減損於是空行夜叉聞之亦出大聲唱善聲至四王天中天復出聲唱善聲傳忉利乃至夜摩兜率化樂他化展轉傳至梵天魔王於宮中聞此唱聲生大愁怖故名怖魔破惡者出家持戒則因戒生定因定發慧破除身口七支破除三界見思諸惡也乞士者既出家已永離四種邪命乞食以資身命永捨一切邪法乞法以資慧命也四種邪命者一仰口食謂仰觀星宿推步盈虗以此求食二下口食謂種植田園三方口謂食于謁四方結交豪貴四維口食謂商賈貨殖此之四事在家人得為之出家所不應為故皆永離也邪法者邪戒邪定邪慧邪戒即牛狗等戒乃至諸天諸仙一切禁戒不能出生死者邪定即凡夫外道依欣厭心所修十二門禪邪慧即有無二見十六知見六十二見百八見等今皆永捨惟求增上戒學增上心學增上慧學故名乞士也除饉者清淨持戒能為人世福田能作清淨法施除一切眾生無福無慧二種饉也眾者梵語僧伽此云和合眾和合有二義一理和謂同證擇滅無為二事和謂戒和同修見和同解利和同均身和同住口和無諍意和同悅眾者四人以上之稱一比丘不名僧二三比丘亦不名僧四比丘同住能作一切如法僧事惟除自恣授具出罪三種羯磨若五比丘同住即可自恣亦可於邊方授具若十比丘同住則五天竺國便可授具乃至二十比丘同住則一切羯磨可作故名和合眾也千二百五十人者佛初成道先度鹿苑五人次度耶舍等五十人次度三迦葉波千人次度舍利弗目連等二百人此千二百五十五人感佛深恩為常隨眾今但舉大數也俱者師資常爾相隨事和無別眾法和無別理也。",
        "translation": "Together with the shared meaning, the Śākyamuni explanation uses the words seven and one to describe a time, a place, a precept, a mind, a view, a path, and a liberation.",
        "source": "X13n0285_001:0222b17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "再作約教觀心二釋初約教釋與者藏教一七一通教二七一別教無量七一圓教一七一大多勝者藏教如前說又大力羅漢所敬故名大徧知生滅即無生滅故名多勝三藏四門故名勝即通教義也又體法大力羅漢所敬故名大恒沙佛法皆知故名多勝二乘人故名勝即別教義也又諸大菩薩所敬故名大法界不可量法悉知故名多勝諸菩薩故名勝即今經圓教義也藏教比丘如前說又乞士者歷緣求真破惡者破障理惑怖魔者以即空觀破四種魔除饉者除析法饉即通教義也又乞士者歷三諦求理破惡者除通別二惑怖魔者破界內界外八魔除饉者除偏空饉即別教義也又乞士者即陰入處界七大求如來藏性破惡者達狂歇即菩提怖魔者當處禪那覺悟無惑知魔界如即佛界如除饉者除但中不具諸法饉即今經圓教義也僧有四種一無漸僧謂破戒者二啞羊僧謂愚癡不解法律三清淨僧謂七方便人四真實僧謂四向四果今非前三種但是真實僧藏教義也又見地以上名真實僧通教義也又歡喜地以上名真實僧別教義也又發心住以上名真實僧圓教義也觀心釋者心王為師諸心心所為弟子眾一念妙觀是名佛諸心心所和合隨成妙觀是名與大比丘眾若干人俱也約四教明觀可知。",
        "translation": "The Tibetan teaching is as explained above, and because it's venerated by the great lohan, it's called great universal knowledge of birth and extinction, which is the absence of birth and extinction, it's called many victories over the three collections and four approaches, so it's called victories, which is the meaning of the general teaching, and because the essence of the Dharma is venerated by the great lohan, it's called great constant knowledge of all the Buddha's teachings, so it's called many victories over the two-vehicle people, so it's called victories, which is the meaning of the specific teaching, and because it's venerated by the great bodhisattvas, it's called great knowledge of the immeasurable Dharma realm, so it's called many victories over the bodhisattvas, so it's called victories, which is the meaning of the perfect teaching of the present sūtra.",
        "source": "X13n0285_001:0223a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二顯位歎德大阿羅漢句是顯位佛子下十二句是歎德也。",
        "translation": "Second, the phrase \"praise the virtues of the great arhat\" refers to the Buddha's son in the manifest stage, and the following twelve phrases praise the virtues of the buddha.",
        "source": "X13n0285_001:0223b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆是無漏大阿羅漢佛子住持善超諸有能於國土成就威儀從佛轉輪妙堪遺囑嚴淨毗尼弘範三界應身無量度脫眾生拔濟未來越諸塵累。",
        "translation": "They are all untainted, great arhats, sons of the Buddha who abide, well transcend, and are capable of accomplishing the demeanor of their land, turning the wheel from the Buddha, and are wonderfully capable of bequeathing adorned and purified vinaya, teaching the three realms, responding to the body, and uncountably liberating sentient beings, rescuing the future, and transcending the tires of the dust.",
        "source": "X13n0285_001:0223b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏者無欲漏無有漏無無明漏諸惑斷盡也大亦具大多勝三義如前說阿羅漢含三義一應供義即乞士果二殺賊義即破惡果三無生義即怖魔果當知比丘三義通於因果此三唯在果也又羅漢有三種修性念處斷見思惑但得漏盡不具諸通名慧解脫人修共念處斷惑證真具足三明六通及八解脫名俱解脫人修緣念處斷惑證真具足通明解脫兼發四無礙辯名無礙解脫人今是無礙解脫故稱大也約教者藏通如上說又無見思漏無塵沙漏無住地無明漏應受人天二乘供養殺見思塵沙無明之賊無分段變易二種生死即別教義又一心中圓盡諸漏應受九界供養煩惱即菩提名殺賊生死即涅槃名無生即圓教義也觀心者觀心即空無見思漏觀心即假無塵沙漏觀心即中無無明漏觀一心具十法界是應供觀心煩惱即菩提是殺賊觀心生死即涅槃是無生也佛子以下有十二句總別歎德佛子住持善超諸有是總歎戒慧二德能於國土下十句是別歎戒慧也佛子者從佛口生從法化生故名佛子若言二乘斷惑證真是佛真子菩薩伏惑未斷子義則疎是藏教義若言三乘皆斷惑而二乘無大悲心子義則弱菩薩大悲增上能紹佛種子義則強是通教義若言菩薩徧行諸佛所有道法名為佛子二乘自度如客作賤人是別教義若言初發菩提之心即是佛種如輪王太子初入胎時即聖王種是圓教義也住者安住不動持者任持不失若言住木叉戒持生滅四諦法輪即藏教義若言住真諦戒持無生四諦法輪即通教義若言住三聚戒持無量四諦法輪即別教義若言住一心無上妙戒持無作四諦法輪即圓教義若言非非想處報盡還墮不名善超出三界獄乃名善超即藏教義若言畏三界為實有雖超不善知三界即空乃名善超即通教義若言不惟超同居三有亦超方便三有亦超實報三有故名為善即別教義若言三土皆即是常寂光非超非不超而論於超故名為善即圓教義也觀心者若觀心因緣所生是藏教佛子住木叉戒持生滅四諦法輪超三界獄若觀心因緣即空是通教佛子住真諦戒持無生法輪即三界而超三界若觀心因緣先空次假後中是別教佛子住三聚戒持無量法輪次第超於三土若觀心因緣即空假中是圓教佛子住無上戒持無作法輪圓超諸有也次能於國土成就威儀是別歎戒德從佛轉輪妙堪遺囑是別歎慧德嚴淨毗尼弘範三界是廣歎成就威儀德謂不惟成一國威儀乃徧為師範於三界也應身無量度脫眾生是廣歎從佛轉輪德謂不惟從一化佛轉輪乃同佛應身無量也拔濟未來越諸塵累是廣歎妙堪遺囑德謂不惟護持正法像法乃悲願盡於未來也約教者若但指五天竺國為國土指別解脫戒為威儀指生滅無生四諦為輪指同居為三界指百億為無量等即藏通義若徧指華藏為國土指三聚為威儀指無量無作四諦為輪指四土為三界指橫徧為無量等即別圓義觀心者若觀心因緣生法成就同居國土威儀從劣應佛轉生滅輪弘範同居三界乃至拔濟未來越同居塵累若觀心因緣即空成就同居方便二種國土威儀從勝劣應佛轉無生輪弘範同居方便二種三界乃至拔濟未來越二土塵累若觀心因緣即空即假成就同居方便實報三種國土威儀從勝應佛轉無量輪弘範三種三界乃至拔濟未來越三土塵累若觀心因緣即空假中成就同居方便實報寂光四種國土威儀從法報佛轉無作輪弘範四種三界乃至拔濟未來越四土塵累問曰寂光安得更有塵累答曰此約分證寂光言也問曰佛子有無量德何意偏歎戒慧二種答曰德雖無量戒定慧三攝無不盡此經首標大定之名曰大佛頂首楞嚴王乃取正因理性以為定體而此定體雖復含靈本具全賴緣了有功正因方顯故第四卷云汝但不隨分別世間業果眾生三種相續三緣斷故三因不生則汝心中演若達多狂性自歇歇即菩提勝淨明心本周法界不從人得夫菩提勝淨明心即是大佛頂首楞嚴王所謂正因理性之體故曰本周法界不從人得也而不隨分別全是了因慧心即今所歎慧德三緣斷故全是緣因善心即今所歎戒德也且此經始自徵心辨見中歷陰入處界後彰七大圓融無非開此圓解以為入流之本次則申之以四種清淨明誨示之以誦呪結壇軌式無非扶此戒法以為正修之助正助合行方成三漸次行方可歷於五十五位真菩提路而登妙覺當知所歷之位從始至終一一無非理性本體能歷之行從淺至深一一無非緣了二功仍恐疎於戒者縱有空解不免沉墜故借善星寶蓮以為問端遂復精研七趣方知若無真戒決無真慧葢無木叉戒不免三惡無禪戒不免欲有無無漏戒不免色無色有安得出世智慧也又恐疎於慧者縱有戒善不免迷惑故借無聞比丘以為言端遂復詳辨五魔方知若無真慧并無真戒葢無真諦慧故木叉戒可破而成魔侶無中諦慧故菩提心戒可破而成聲聞緣覺安得三聚淨戒也故阿含云由戒淨故慧淨由慧淨故戒淨如兩手互洗不容先後寧惟藏教為然當知通別圓教所有修行要法總莫過於此矣又此戒慧即涅槃所謂戒乘若戒乘俱緩永在三塗若戒急乘緩雖在人天無由出世若乘急戒緩雖獲出世要經三惡惟乘戒俱急方可坐進斯道今經首歎戒慧二德深有由也。",
        "translation": "無漏者無欲漏無有漏無無明漏諸惑斷盡也大亦具大多勝三義如前說阿羅漢含三義一應供義即乞士果二殺賊義即破惡果三無生義即怖魔果當知比丘三義通於因果此三唯在果也又羅漢有三種修性念處斷見思惑但得漏盡不具諸通名慧解脫人修共念處斷惑證真具足三明六通及八解脫名俱解脫人修緣念處斷惑證真具足通明解脫兼發四無礙辯名無礙解脫人今是無礙解脫故稱大也約教者藏通如上說又無見思漏無塵沙漏無住地無明漏應受人天二乘供養殺見思塵沙無明之賊無分段變易二種生死即別教義又一心中圓盡諸漏應受九界供養煩惱即菩提名殺賊生死即涅槃名無生即圓教義也觀心者觀心即空無見思漏觀心即假無塵沙漏觀心即中無無明漏觀一心具十法界是應供觀心煩惱即菩提是殺賊觀心生死即涅槃是無生也佛子以下有十二句總別歎德佛子住持善超諸有是總歎戒慧二德能於國土下十句是別歎戒慧也佛子者從佛口生從法化生故名佛子若言二乘斷惑證真是佛真子菩薩伏惑未斷子義則疎是藏教義若言三乘皆斷惑而二乘無大悲心子義則弱菩薩大悲增上能紹佛種子義則強是通教義若言菩薩徧行諸佛所有道法名為佛子二乘自度如客作賤人是別教義若言初發菩提之心即是佛種如輪王太子初入胎時即聖王種是圓教義也住者安住不動持者任持不失若言住木叉戒持生滅四諦法輪即藏教義若言住真諦戒持無生四諦法輪即通教義若言住三聚戒持無量四諦法輪即別教義若言住一心無上妙戒持無作四諦法輪即圓教義若言非非想處報盡還墮不名善超出三界獄乃名善超即藏教義若言畏三界為實有雖超不善知三界即空乃名善超即通教義若言不惟超同居三有亦超方便三有亦超實報三有故名為善即別教義若言三土皆即是常寂光非超非不超而論於超故名為善即圓教義也觀心者若觀心因緣所生是藏教佛子住木叉戒持生滅四諦法輪超三界獄若觀心因緣即空是通教佛子住真諦戒持無生法輪即三界而超三界若觀心因緣先空次假後中是別教佛子住三聚戒持無量法輪次第超於三土若觀心因緣即空假中是圓教佛子住無上戒持無作法輪圓超諸有也次能於國土成就威儀是別歎戒德從佛轉輪妙堪遺囑是別歎慧德嚴淨毗尼弘範三界是廣歎成就威儀德謂不惟成一國威儀乃徧為師範於三界也應身無量度脫眾生是廣歎從佛轉輪德謂不惟從一化佛轉輪乃同佛應身無量也拔濟未來越諸塵累是廣歎妙堪遺囑德謂不惟護持正法像法乃悲願盡於未來也約教者若但指五天竺國為國土指別解脫戒為威儀指生滅無生四諦為輪指同居為三界指百億為無量等即藏通義若徧指華藏為國土指三聚為威儀指無量無作四諦為輪指四土為三界指橫徧為無量等即別圓義觀心者若觀心因緣生法成就同居國土威儀從劣應佛轉生滅輪弘範同居三界乃至拔濟未來越同居塵累若觀心因緣即空成就同居方便二種國土威儀從勝劣應佛轉無生輪弘範同居方便二種三界乃至拔濟未來越二土塵累若觀心因緣即空即假成就同居方便實報三種國土威儀從勝應佛轉無量輪弘範三種三界乃至拔濟未來越三土塵累若觀心因緣即空假中成就同居方便實報寂光四種國土威儀從法報佛轉無作輪弘範四種三界乃至拔濟未來越四土塵累問曰寂光安得更有塵累答曰此約分證寂光言也問曰佛子有無量德何意偏歎戒慧二種答曰德雖無量戒定慧三攝無不盡此經首標大定之名曰大佛頂首楞嚴王乃取正因理性以為定體而此定體雖復含靈本具全賴緣了有功正因方顯故第四卷云汝但不隨分別世間業果眾生三種相續三緣斷故三因不生則汝心中演若達多狂性自歇歇即菩提勝淨明心本周法界不從人得夫菩提勝淨明心即是大佛頂首楞嚴王所謂正因理性之體故曰本周法界不從人得也而不隨分別全是了因慧心即今所歎慧德三緣斷故全是緣因善心即今所歎戒德也且此經始自徵心辨見中歷陰入處界後彰七大圓融無非開此圓解以為入流之本次則申之以四種清淨明誨示之以誦呪結壇軌式無非扶此戒法以為正修之助正助合行方成三漸次行方可歷於五十五位真菩提路而登妙覺當知所歷之位從始至終一一無非理性本體能歷之行從淺至深一一無非緣了二功仍恐疎於戒者縱有空解不免沉墜故借善星寶蓮以為問端遂復精研七趣方知若無真戒決無真慧葢無木叉戒不免三惡無禪戒不免欲有無無漏戒不免色無色有安得出世智慧也又恐疎於慧者縱有戒善不免迷惑故借無聞比丘以為言端遂復詳辨五魔方知若無真慧并無真戒葢無真諦慧故木叉戒可破而成魔侶無中諦慧故菩提心戒可破而成聲聞緣覺安得三聚淨戒也故阿含云由戒淨故慧淨由慧淨故戒淨如兩手互洗不容先後寧惟藏教為然當知通別圓教所有修行要法總莫過於此矣又此戒慧即涅槃所謂戒乘若戒乘俱緩永在三塗若戒急乘緩雖在人天無由出世若乘急戒緩雖獲出世要經三惡惟乘戒俱急方可坐進斯道今經首歎戒慧二德深有由也。",
        "source": "X13n0285_001:0223b15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "三列上首名。",
        "translation": "The three heads of the list are named Śāriputra.",
        "source": "X13n0285_001:0224c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其名曰大智舍利弗摩訶目犍連摩訶拘絺羅富樓那彌多羅尼子須菩提優波尼沙陀等而為上首。",
        "translation": "His name is Mahāknowledge, Śāriputra, Mahāmaudgalyāyana, Mahākauṣṭhila, Pūrṇa, Maitrāyaniputra, Subhūti, Upaniṣad, and others, and he is the foremost.",
        "source": "X13n0285_001:0224c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大智者聲聞眾中智慧第一也舍利此云鶖鷺尊者之母明目似之故以為名弗者子也即是從母立稱正名優波提舍摩訶目犍連此云大采菽氏尊者姓也名拘律陀西域樹名禱此樹神而生故以為名神通第一摩訶拘絺羅此云大膝即舍利弗之母舅亦號長爪梵志論議第一富樓那此云滿是其父名彌多羅尼此云慈是其母名雙標父母以名其子故稱為滿慈子說法第一須菩提此云空生亦云善現亦云善吉解空第一優波尼沙陀此云塵性空為上首者於佛是弟子於千二百五十人則是師表也約教者析法智體法智次第三智一心三智乃至滅色空即色空離二邊空不思議空等觀心者觀心因緣生法是析法智乃至滅色空觀心因緣即空是體法智乃至是即色空觀心因緣先空次假後中是次第三智乃至是離二邊空觀心因緣即空假中是一心三智乃至是不思議空餘可例知不復委說。",
        "translation": "Mahāknowledge is the first among śrāvakas in wisdom, and Śāriputra, the mother of the god Śāriputra, has eyes like his mother's, so he's called the son of Śākyamuni, which is the proper name given to him from his mother. Mahāmaudgalyāyana, the surname of the god Śākyamuni, the name of the tree in the western region, prays to the god of this tree, so he's called the first in supernormal powers.",
        "source": "X13n0285_001:0224c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二緣覺眾。",
        "translation": "Second, there are the pratyekabuddhas.",
        "source": "X13n0285_001:0225a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有無量辟支無學并其初心同來佛所屬諸比丘休夏自恣。",
        "translation": "There are measureless more monks who are pratyekabuddhas and postulants who have come to the Buddha's household for the first time.",
        "source": "X13n0285_001:0225a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辟支有二種一者出無佛世自悟無生名為獨覺二者出有佛世秉因緣教修行得道名為緣覺今即緣覺眾也無學者所作已辦之稱初心者發意修緣生觀即是有學人也約教者悟生滅思議十二因緣即藏教辟支悟不生滅思議十二因緣即通教辟支悟生滅不思議十二因緣即別教辟支悟不生滅不思議十二因緣即圓教辟支也觀心可知屬者遇也休夏者三月夏安居已竟也自恣者僧中作自恣羯磨各各陳白互求說罪悔過也其法在百一羯磨中未受比丘戒者不宜預知已受比丘戒者必應習學茲不具述此二句正明辟支來集之故亦為下文菩薩咨決心疑之由文可兩屬就便屬上。",
        "translation": "There are two kinds of pratyekabuddhas: those who emerge from the Buddha's world and realize for themselves the absence of birth, called solitary realizers, and those who emerge from the Buddha's world and cultivate the path by the teaching of causes and conditions, called pratyekabuddhas. Those who have done so without training are called first-time masters who have the intention to cultivate the contemplation of conditional birth, which is to say that they are trainees.",
        "source": "X13n0285_001:0225a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三菩薩眾為二初夏終時集二聞音遠集。",
        "translation": "The three bodhisattva congregations are two: those who gather at the end of the first summer and those who gather when they hear sounds from afar.",
        "source": "X13n0285_001:0225a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初夏終時集。",
        "translation": "The first gathers at the end of the summer retreat.",
        "source": "X13n0285_001:0225b01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方菩薩咨決心疑欽奉慈嚴將求密義即時如來敷座晏安為諸會中宣示深奧法筵清眾得未曾有。",
        "translation": "When bodhisattvas in the ten directions resolve their doubts and respect Tzu-Yan's admonition to seek the hidden meaning, the Tathāgata prepares his seat, sits down, and announces the profound Dharma lecture for the congregation, clearing it of people like never before.",
        "source": "X13n0285_001:0225b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此正承上屬諸比丘休夏自咨之時故不惟辟支咸集而十方菩薩亦皆乘此咨決心疑也菩薩約教可知不復更出慈嚴者佛之慈悲如母威嚴如父也密義者密妙之義所謂三德祕藏又未經法華開顯且令一類大機密默先得共益即所謂祕密教也深奧即祕密義明非淺露之說此文雖屬通序已與諸經不同大似欲說法華先說無量義也。",
        "translation": "Not only did the bhikṣus gather during the summer retreat, but the bodhisattvas of the ten directions also took advantage of this opportunity to resolve their doubts.",
        "source": "X13n0285_001:0225b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二聞音遠集。",
        "translation": "\"Second, hearing sounds gathered from afar.",
        "source": "X13n0285_001:0225b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦陵仙音徧十方界恒沙菩薩來聚道場文殊師利而為上首。",
        "translation": "The voice of Kaliṅgāra pervades the whole world, and Mañjuśrī is the head of the congregation of bodhisattvas who come to the site of enlightenment.",
        "source": "X13n0285_001:0225b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦陵頻伽鳥名音聲最妙以喻佛說法音更加以仙字者意顯佛之妙音僅用迦陵固不足以喻之僅用仙字亦不足以喻之也又佛名大覺金仙故稱仙音佛之音聲稱性周徧鐵圍諸山所不能障但有緣者皆得共聞今欲覺悟諸菩薩故所以徧至十方界也文殊師利此云妙吉祥亦云妙德正表眾生根本實智故下文將呪往護選擇圓通請結經名莫不由之前舍利弗表於權智權實二智是自利利他之本故並為二處上首也通序竟。",
        "translation": "The name Kaliṅgā is a metaphor for the most wonderful sound of the Buddha's explanation of the Dharma and the word sage, which means that the Buddha's wonderful sound is certainly not a sufficient metaphor for it, nor is the word sage sufficient for it.",
        "source": "X13n0285_001:0225b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二別序者發起序也諸經各各不同故名為別以此因緣深發大教故名發起分文為二初示墮因緣二神呪護攝。",
        "translation": "The second distinctive preface is the initiating preface, which is called distinctive because the sutras are each different. The first shows the causes and conditions for falling into the second is the sūtras and dhāraṇīs for protection.",
        "source": "X13n0285_001:0225b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中三初佛僧應供二阿難等乞三婬室誤墮。",
        "translation": "First, there are three offerings that should be made to the Buddha and saṃgha, two requests from Ānanda, and three mistaken falls from sexual intercourse.",
        "source": "X13n0285_001:0225c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初佛僧應供。",
        "translation": "First, the buddhas and saṃgha should make offerings.",
        "source": "X13n0285_001:0225c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時波斯匿王為其父王諱日營齋請佛宮掖自迎如來廣設珍羞無上妙味兼復親延諸大菩薩城中復有長者居士同時飯僧佇佛來應佛敕文殊分領菩薩及阿羅漢應諸齋主。",
        "translation": "It was then that King Prasenajit invited the Buddha to his palace on the day of his father's death to make offerings to him, welcoming the Tathāgata with a generous spread of treasures and unsurpassed flavors and also personally inviting other great bodhisattvas to the city. There were also elders and householders in the city who were dining, monkifying, and lining up with the Buddha to respond to his order that Mañjuśrī should lead the bodhisattvas and arhats to respond to the masters of the meal.",
        "source": "X13n0285_001:0225c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波斯匿此云月光與佛同時降生父王見諸光明祥瑞謂是其子福力所致故以命名亦翻勝軍即舍衛國王也諱日者父死之日人子所不忍言故名諱日掖者宮中左右名為掖庭餘如文。",
        "translation": "Here in Prasenajit, the moonlight was born at the same time as the Buddha, and the father saw the brightness and auspiciousness, saying that his son's good fortune was the reason for his name.",
        "source": "X13n0285_001:0225c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難等乞。",
        "translation": "Second, Ānanda and the others begged.",
        "source": "X13n0285_001:0225c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯有阿難先受別請遠遊未還不遑僧次既無上座及阿闍梨途中獨歸其日無供即時阿難執持應器於所遊城次第循乞心中初求最後檀越以為齋主無問淨穢剎利尊姓及栴陀羅方行等慈不擇微賤發意圓成一切眾生無量功德阿難已知如來世尊訶須菩提及大迦葉為阿羅漢心不均平欽仰如來開闡無遮度諸疑謗經彼城隍徐步郭門嚴整威儀肅恭齋法。",
        "translation": "Only Ānanda first accepted a special invitation to travel far away and didn't even bother to return to the order of the saṃgha, and since there was no superior seat or ācārya, he returned alone on the way there was no offering for the day.",
        "source": "X13n0285_001:0225c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難此云慶喜白飯王子佛之堂弟成道日生故名慶喜也別請者請有二種一僧次請二別請也大乘律中戒受別請戒別請僧毗尼藏中不一向戒於受別請除病時行時作衣施衣等時無犯於別請僧但令僧次通請一人餘皆別請無犯今時值自恣即是施衣時到故阿難得受別請而遠遊未還也遑及也不遑者但是先已出界今猶未及歸僧伽藍故不預眾僧受供之次或是受一日法乃至受七日法而去皆不可知斷斷不可作破夏解以備考律中阿難無破夏事故也上座者梵名悉替那此有三種一生年上座戒臘最高二福德上座大福大慧眾所推敬三法性上座謂阿羅漢阿闍梨此云軌範師共有五種一出家阿闍梨授沙彌十戒法者是二教授阿闍梨受具時屏處問遮難及教令乞戒者是三羯磨阿闍梨受具時當壇白四羯磨者是四依止阿闍梨所從受依止乃至一夜者是五教讀阿闍梨所從受經若解義乃至一四句偈者是律中比丘五夏未滿不得暫離依止今阿難十夏已滿故得無上座阿闍梨而獨行也應器者梵名鉢多羅以體色量三皆應法故名應器體則或瓦或鐵色則熏如鳩鴿量則隨腹大小極大不過三升極小不過升半也檀越者檀即是施由行施故越貧窮海故稱檀越言最後者以王及長者居士已先發心徧請佛僧今若發心請阿難者即是最後之檀越也剎利此云王種四姓中尊是為最淨栴陀羅此云殺者四姓不齒是為最穢舉此二種以明無簡擇也發意圓成一切眾生無量功德者有二意一謂等心而乞等心而施則於食等者於法亦等故能圓成無量功德二謂王及長者居士如此殷勤設供假使阿難一日失食則功德不全若得最後發心之人獨供阿難則并王臣等一切眾生所有功德皆得圓成也阿難已知下正顯所以方行等慈之繇繇知佛曾訶二尊者故今欽仰而行無遮大道也以須菩提捨貧從富大迦葉捨富從貪雖復各有所見總未合於無遮法門總不免於起人疑謗今恪遵明訓攝護威儀固是乞食常規比丘正式阿難誤墮之過誠不因此後世講解遂欲於此吹毛求疵誣罔尊者亦太酷矣。",
        "translation": "Ānanda here, the cloud of joy, the prince of the almsbowl, the Buddha's younger brother, was born on the day of his attainment of enlightenment, so he's called \"joyful.\" There are two kinds of special invitations: those given to the monks, the first to the saṃgha, and the second to the saṃgha. In the Mahāyāna Vinaya, the acceptance of special invitations to the precepts, the special invitation to the saṃgha, and the special invitation to the saṃgha are not inconsistent with the precepts in the Vinaya.",
        "source": "X13n0285_001:0225c20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "三婬室誤墮。",
        "translation": "Three misdeeds of sexual misconduct in the abodes of prostitution.",
        "source": "X13n0285_001:0226b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難因乞食次經歷婬室遭大幻術摩登伽女以娑毗迦羅先梵天呪攝入婬席婬躬撫摩將毀戒體。",
        "translation": "At the time, Ānanda was begging for food and then went into a house of prostitution when he was confronted by the great conjurer Mātaṅga who used a spell from Sāvikarasin Brahmā to bring him into a house of prostitution and to make him violate the precepts.",
        "source": "X13n0285_001:0226b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩登伽此云本性未蒙呪力性本染汙已蒙呪力性本解脫故始終皆名本性也娑毗迦羅此云黃髮外道所傳幻呪名先梵天亦如此間黃冠羽士動稱太上老君者是也戒體者登壇秉白四羯磨竟所得妙善無漏色法即是無作戒體以一作之後不俟再作故名無作若於四重禁中隨犯一重此體則失今摩登伽女將以婬術而毀阿難之戒體非謂阿難自欲毀也據摩鄧伽經中阿難念云如來大慈寧不救護以此為感佛呪護之機此經亦云心清淨故尚未淪弱又云心雖明了力不自由則阿難始終無過明矣又此誤墮雖繇次第行乞而過誠不在次第行乞但在聞法不觀心未全道力耳夫欲深發大教而以示墮婬室為因緣者正顯生死根本婬為第一不斷婬機永違出要多聞尚自無益況無聞乎除是從聞思修塞源拔本方能脫死超生此勸脩之要旨也。",
        "translation": "The essence of the precepts is that after one act, there's no need to act again; therefore, it's called unacted. If one of the four prohibitions is violated at random, then the essence of the precepts will be lost.",
        "source": "X13n0285_001:0226b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二神呪護攝又三初大悲鑒物恒不忘念二放光說呪表示密因三文殊往救破邪歸正。",
        "translation": "First, he has great compassion for things and never forgets it; second, he emits a light and explains the spell, indicating the hidden cause; and third, Mañjuśrī goes to the rescue and refutes the wrong and returns to the right.",
        "source": "X13n0285_001:0226c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初大悲鑒物恒不忘念。",
        "translation": "First, the great compassionate examination of things is constant and not forgetful.",
        "source": "X13n0285_001:0226c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來知彼婬術所加齋畢旋歸王及大臣長者居士俱來隨佛願聞法要。",
        "translation": "The Tathāgata knew that they were engaged in sexual misconduct, and after observing the precepts, they turned around and returned to the king, his ministers, the elders, and the householders, all of whom came to follow the Buddha and vowed to hear the essentials of the Dharma.",
        "source": "X13n0285_001:0226c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知之一字即是如來寂而常照於一切時得不忘念也據摩登伽經中則繇阿難作念方感於佛今直明佛本了了常知不俟阿難作念方知然知雖不藉阿雖作念而必繇彼作念方成感應又如來不但能知阿雖作念亦知大眾必皆藉此均沾法味亦知盡未來際繇此經呪作得度緣所謂恒沙界外一滴之雨尚知頭數即此大圓鏡智之體所徹照也而此知體即是知見無見斯即涅槃之知即是眾生本具如來藏性大佛頂理所謂盲人見暗熟睡聞舂不動不遷無舒無卷乃至本圓本通本常皆此知也阿難昧此而誤墮如來證此而護他可謂唯此知之一字更無他物矣王等俱來隨佛者以如來常式受齋既畢必為說法今既旋歸知其必有他緣將演大法故皆願聞也。",
        "translation": "The word 'knowledge' means the Tathāgata is still and always shining, and attains unforgetful mindfulness at all times. According to the Sutra of Mātaṅga, it's only when Ānanda is mindful that the Buddha is touched by mindfulness that he directly understands that the Buddha himself is fully and constantly aware, and he doesn't have to wait for Ānanda to be mindful before he knows it.",
        "source": "X13n0285_001:0226c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二放光說呪表示密因。",
        "translation": "Second, he radiated a light and spoke a mantra that indicated the hidden cause.",
        "source": "X13n0285_001:0226c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊頂放百寶無畏光明光中出生千葉寶蓮有佛化身結跏趺坐宣說神呪。",
        "translation": "At the time, the Bhagavān radiated a hundred jewels of fearless light from his crown, and in that light there was a thousand-leaf lotus with a transformation body of the Buddha sitting cross-legged and expounding a divine spell.",
        "source": "X13n0285_001:0227a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百寶無畏光明者表百界中安樂之性本智之明也千葉寶蓮者表一念千如之法也又頂相表諸佛極果蓮華表實相妙因今華從頂出表因心不離果覺佛坐華中表果覺全在真因因該果徹故名表示密因。",
        "translation": "The fearless light of the hundred jewels indicates the wisdom of the original knowledge of the nature of well-being in the hundred realms, and the thousand-leaf lotus indicates the Dharma of a thousand forms of mindfulness.",
        "source": "X13n0285_001:0227a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三文殊往救破邪歸正。",
        "translation": "Third, Mañjuśrī went to his rescue to refute error and return to right.",
        "source": "X13n0285_001:0227a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敕文殊師利將呪往護惡呪銷滅提獎阿難及摩登伽歸來佛所。",
        "translation": "He instructed Mañjuśrī to deliver the spell to protect against bad spells, extinguish Tikhon Ānanda and Mātaṅga, and return to the Buddha.",
        "source": "X13n0285_001:0227a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫五會神呪即是密詮如來藏性藏性威力不可思議何須更藉文殊又文殊既表眾生根本實智用此本有智光無障不破何須更將神呪當知大有所表以神呪所詮藏性即阿難及登伽等正因理性之體文殊妙智即阿難等了因慧性之果五會章句即阿難等緣因善性之用是故能令惡呪銷滅又復應知即彼惡呪本即法界全體能持所持即是惡了惡緣今以稱性所起真善緣了對破迷性所起妄惡緣了緣了既破全歸正因理性故名銷滅又惡呪理體既即全是正因理體則惡緣了性亦復全即善緣了性如空合空如水投水故名銷滅也提者提拔其正因之在纏獎者獎助其緣了之欲發阿難登伽既是有心有心者皆得作佛名為正因阿難一點明了求救之心是善了因所持無作清淨之戒是善緣因登伽一點熾然婬愛之心是惡了因所作婬躬撫摩之事是惡緣因今繇釋迦心內阿難登伽以此善惡兩機而為能感故得阿難登伽心內釋迦以此稱性緣了而為能應也問曰阿難善緣善了以此感佛可矣登伽惡緣惡了胡以能感佛耶答曰觀音別行玄義深明善惡皆得為機今更以喻明之如父母於子善者固所愛念惡者尤所憐愍但眾生捨父逃逝故使機感不成苟能一念向佛無有不蒙提獎者也再以喻明如有一人先有生金欲造佛像喚彼金師具諸爐鞴砧推器物復有一人先有生金欲作殺具亦喚金師具諸爐鞴砧推器物當知若無金師及以器物縱有生金不能成像亦不能成殺具若有金師及以器物只此生金可作殺具亦即可作佛像設彼主人正欲作殺具時旁有智者曉示之曰汝何以此生金工用而作殺具造地獄因甚不可也何不以此轉造佛像即成佛界之因其人聽之即用造佛是時更不須別買生金更不須別喚金師更不須別覓器物即以此金此師此器而成佛像今明即惡緣了成善緣了亦復如是生金喻正因佛性金師喻了因佛性器物喻緣因佛性若其未喚金師未具器物縱有生金終不能作佛像亦不能作殺具今惟有此作殺具之金師器物故即可為作佛像之金師器物耳又若以此主人喻了因者則金師器物皆喻緣因而彼肯作佛像之主人即是初時欲作殺具之主人更非兩人亦可見善了惡了無二性也惟其作刀之金即作佛之金故正因在纏為可提惟其作刀之人作刀之器即作佛之人作佛之器故緣了欲發為可獎知此義者方可以持呪而治習矣閱者尚深思之。",
        "translation": "The five assemblies of the divine spell are the secret explanation of the hidden nature of the Tathāgata, the inconceivable power of the hidden nature, and why should it be necessary to rely on Mañjuśrī? Since Mañjuśrī shows the fundamental true wisdom of sentient beings and uses this innate wisdom to illuminate without obstruction or impediment anything more than the divine spell, you should know that there's a great deal to be said for the fact that the hidden nature of the divine spell is the essence of the rational nature of right causes like Ānanda and Denga, and the marvelous wisdom of Mañjuśrī is the result of the wisdom nature of the accomplished causes like Ānanda and others.",
        "source": "X13n0285_001:0227a11_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "按摩鄧伽經阿難作念感佛佛即說呪救之呪名呪文與此咸別既不從頂現化亦無文殊將呪又登伽來至佛所佛為徧解形中六事令彼欲心銷歇得證聖果次即具說二人夙世因緣當知一席所見條然各別故知大小兩機並行不悖何但初成佛道雙垂兩相謂佛始終皆垂兩相可也然即此一處異聞或時互知或互不知就互知處名不定教互不知處名祕密教隨彼羣機循循善誘判教者何必泥於別五時之一途而苦諍此經之先後哉別序竟。",
        "translation": "The Massage Sutra mentions that Ānanda's mindfulness of the Buddha's action led him to preach a spell, the name of which was distinct from this one, that it didn't manifest from the top, that there was no Wenshu to deliver the spell, that Ānanda came to the Buddha, and that the Buddha universally understood the six things in his form so that his desire for them would cease and he would realize the noble fruit, and that he explained the causes and conditions of their long lives, knowing that their views were distinct, so he knew that the greater and lesser faculties practiced together without contradicting each other.",
        "source": "X13n0285_001:0227c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正宗分分文為六初顯如來藏妙真如性圓三諦理從阿難見佛至第四卷尚留觀聽止舊云見道分此語浮泛不知所見何道又見道之語藏通局在初果別圓局在初地初住今謂此是普為博地凡夫開圓頓解俾利者隨聞隨證鈍者依解起行故須云顯圓諦也二示不生滅為本修因妙三觀門從第四卷阿難請入華屋至第七卷菩薩護呪止舊云修道分此亦浮泛不知所修何道又所言修者是緣修耶是真修耶若是真修何勞更擇耳門若是緣修何意反在見道之後今謂此是躡前圓解以起圓行所謂正助兩行雖云兩行仍以正行為主助行秪是助其正行俾利者一超直入鈍者漸次深入故須云示妙觀也三明正助行所成伏斷圓三德位從七卷阿難請問位次至第八卷名為邪觀止舊云證道分此亦浮泛不知所證何道又所言證者是滿證耶是分證耶若是滿證則等覺以前不得證名收文不盡若是分證何意無修且乾慧十信亦非分證所收今謂此是繇前圓行以成圓伏圓斷從始至終皆顯三德所謂觀行三德相似三德分證三德究竟三德故須云明圓位也四結成經名以彰圓體圓宗圓用即第八卷中文殊問名如來結答止有八行經也五借破戒惡法為問端而廣示七趣差別意顯若無出世妙戒決無出世妙慧從八卷說是語已起至九卷即魔王說止也六借無聞比丘為語端而備明五陰魔境意顯若無中道妙慧并失中道妙戒從九卷即時如來將罷法座起至第十卷不戀三界止也舊合此二文名助道分亦不知所助何道又一是阿難請說一是無問自說各有深致關係正修行路殊非淺小何容混作一利今謂七趣是約助行分於持犯仍須以慧導戒方免輪迴所以警三界之羣迷五陰是約正行辨於迷悟仍須以戒助慧方免魔業所以防修心之誤墮也。",
        "translation": "The second correct doctrinal division is divided into six texts. First, it reveals the principle of the Tathāgatagarbha's marvelous true reality nature and the perfect three truths from the time Ānanda saw the Buddha until the fourth roll, when he remained to scrutinize and listen to the cessation of what was formerly called the path of seeing.",
        "source": "X13n0285_001:0227c17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "初顯如來藏妙真如性圓三諦理為二初三卷文正明理性二富樓那問去有半卷廣破餘疑。",
        "translation": "The first reveals the principle of the Tathāgatagarbha's marvelous true nature and perfection of the three truths in two ways: first, the text of the three fascicles correctly explains the principle; second, Pūrṇa's question is answered in half a fascicle and the remaining doubts are extensively dispelled.",
        "source": "X13n0285_001:0228b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中四初當機悔請二大眾願聞三如來答示四大眾圓悟。",
        "translation": "First, there are four repentances from the audience, two vows from the public, and three answers from the Tathāgata indicating the four elements of perfect enlightenment.",
        "source": "X13n0285_001:0228b03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初當機悔請。",
        "translation": "The first was an opportune repentance request.",
        "source": "X13n0285_001:0228b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難見佛頂禮悲位恨無始來一向多聞未全道力殷勤啟請十方如來得成菩提妙奢摩他三摩禪那最初方便。",
        "translation": "Seeing the Buddha, Ānanda paid homage to his compassionate position, hating himself for having been well-versed since beginningless time and not fully possessing the power of the path, he earnestly invited the Tathāgatas in the ten directions to attain enlightenment by the marvelous method of calming the mind and the initial method of the samādhi.",
        "source": "X13n0285_001:0228b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多聞本是入道之緣只因不能從聞思修故名一向多聞便如說食數寶而未全道力也當知只此聞之一字阿難以多而無救婬室之難四禪以無而自取墮獄之殃觀音以思修而善成圓通之證可謂流轉生死安樂涅槃惟此耳根更非他物矣後世見阿難悔責一向多聞即羣然以多聞為召禍之端更欲一向訶教勸離仍蹈無聞比丘覆轍不知多聞何過過只在一向耳一向者所謂尋聲流轉不知反聞聞自性也若能從聞思修則聞多故思修亦多便是入道要門譬如翻手覆手元無兩手下文特選觀音耳門正示阿難以就路還家法耳倘令多聞決定可廢則乘此殷勤啟請何不直授以一句簡便工夫豈不千了百當而仍費盡老婆舌頭說至三卷之多方使阿難悟法身耶閱此經者亦可以深思矣菩提者有真性菩提有實智菩提有方便菩提正因理心究竟明顯成真性菩提了因慧心究竟明顯成實智菩提緣因善心究竟明顯成方便菩提三非定三亦非定一即一而三即三而一故以妙奢摩他三摩禪那為方便也圓覺經云若諸菩薩悟淨圓覺以淨覺心取靜為行由澄諸念覺識煩動靜慧發生身心客塵從此永滅便能內發寂靜輕安由寂靜故十方世界諸如來心於中顯現如鏡中像此方便者名奢摩他若諸菩薩悟淨圓覺以淨覺心知覺心性及與根塵皆因幻化即起諸幻以除幻者變化諸幻而開幻眾由起幻故便能內發大悲輕安一切菩薩從此起行漸次增進彼觀幻者非同幻故非同幻觀皆是幻故幻相永離是諸菩薩所圓妙行如土長苗此方便者名三摩鉢提若諸菩薩悟淨圓覺以淨覺心不取幻化及諸靜相了知身心皆為罣礙無知覺明不依諸礙永得超過礙無礙境受用世界及與身心相在塵域如器中鍠聲出於外煩惱涅槃不相留礙便能內發寂滅輕安妙覺隨順寂滅境界自他身心所不能及眾生壽命皆為浮想此方便者名為禪那今依此文略出其義夫奢摩他既以取靜為行以寂靜輕安為相當知於三止中即體真止於三觀中即入空觀又可總以三止為奢摩他葢二邊皆屬煩動中道方名寂靜故也三摩鉢提既以起幻為行以大悲輕安為相當知於三止中即方便隨緣止於三觀中即出假觀又可總以三觀為三摩鉢提葢二邊皆屬幻相中道方名永離故也禪那既以不取為行以寂滅輕安為相當知於三止中即是息二邊分別止於三觀中即是中觀又可總以止觀不二而為禪那葢不惟中道寂滅二邊亦本寂滅故也若次第三止三觀則名為麤若一心三止三觀則名為妙若止非即觀觀非即止則名為麤若止觀不二則名為妙又三若定三則不名妙一若定一亦不名妙今三不定三一不定一即一恒三即三恒一非一非三而三而一故名為妙圓覺又云若諸菩薩以圓覺慧圓合一切於諸性相無離覺性此菩薩者名為圓修三種自性清淨隨順此之謂也今阿難所問正惟問此圓頓止觀如來所答亦惟答此圓頓止觀從始至終更無異趣舊解紛紛苦欲以經文分對此處三名皆是支離割裂進退出沒無一可取請觀下文今解藏否自知不俟廣破矣最初方便者若據問意只要求一吃緊下手工夫安敢先有成心若據答意應須的指徵心辨見以開圓解是為最初方便且如圓覺經中一一指云此方便者名奢摩他等則知妙奢摩他三摩禪那乃是得成菩提方便而三章之首一一先標悟淨圓覺四字則知妙悟又是奢摩他等方便所以名為最初也此經則第二大科首明二決定義而結重於耳根圓通方是酬其妙奢摩他三摩禪那之請今於第一大科首明二種根本而備顯夫如來藏性正是酬其最初方便之請急先務也葢如圓覺最初必先悟淨圓覺然後奢摩他不成止病三摩鉢提不成作病禪那不成任滅二病今經亦爾必先徹悟如來藏性然後耳根圓通常境方可稱性而觀是故觀於聞性之圓真實即是妙奢摩他觀於聞性之通真實即妙三摩觀於聞性之常真實即妙禪那以圓則必通必常通則必常必圓常則必圓必通故曰以圓覺慧圓合一切於諸性相無離覺性也問曰阿難首以三法為請安得置此三法直至第二科中方答今科所答更是何法答曰今所答者正是三法之最初方便也以悟如來藏一切俱非義故則妙奢摩他方便得成以悟如來藏一切俱即義故則妙三摩鉢提方便得成以悟如來藏離即離非是即非即義故則妙禪那方便得成既先示此三法所依理體故阿難徑請入華屋門門之一字即是指此三方便也願讀經者玩索本文真正線索莫泥舊見舊聞自當得其旨矣。",
        "translation": "It's only because he can't practice from hearing and contemplating that he's called always well-versed, which is like saying that he's eating several treasures but hasn't fully attained the power of the path. You should know that this word \"well-versed\" is the only thing that Anan uses to save the difficulty of sexual intercourse and the difficulty of falling into hell because he has nothing in the four meditation heavens and yet he takes it upon himself to realize the perfection of Avalokitêśvara because of his lack of contemplation and practice, which can be described as transmigration through birth and death and the realization of well-being and nirvāṇa.",
        "source": "X13n0285_001:0228b09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "二大眾願聞。",
        "translation": "Second, the public vows to hear it.",
        "source": "X13n0285_001:0229b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時復有恒沙菩薩及諸十方大阿羅漢辟支佛等俱願樂聞退坐默然承受聖旨。",
        "translation": "At the time, there were many bodhisattvas, arhats, and pratyekabuddhas in the ten directions who all wished to hear and retired from their seats to quietly accept the holy teaching.",
        "source": "X13n0285_001:0229b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓頓妙法三乘聖眾之所共仰不惟化被凡夫也。",
        "translation": "The perfect and sudden wonderful Dharma was revered by all the sages of the three vehicles, not just by ordinary people.",
        "source": "X13n0285_001:0229b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三如來答示二初從今文至十八界畢是就事以顯理次七大文是明性本具相。",
        "translation": "Third, the Tathāgata's reply showed two things: first, from the present to the end of the eighteen realms, the facts are used to show the principle; second, the seven major texts clarify the nature of the originally possessed characteristics.",
        "source": "X13n0285_001:0229b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中二初逐破妄執密顯真心二顯示妙理兼破餘妄。",
        "translation": "The first two of these are, first, to destroy deluded attachment and reveal genuine mind; second, to reveal the marvelous principle and destroy the other delusions.",
        "source": "X13n0285_001:0229b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中三初徵其發心本因二示以常心直道三廣破七番妄計初又二初如來問二阿難答。",
        "translation": "First, there are three ways to first define the original reason for his arousal of mind, second to show the direct path with a constant mind, and third to extensively refute the seven false imputations. First, the Tathāgata asked and Ānanda answered.",
        "source": "X13n0285_001:0229c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "Now, first.",
        "source": "X13n0285_001:0229c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝我同氣情均天倫當初發心於我法中見何勝相頓捨世間深重恩愛。",
        "translation": "The Buddha told Ānanda, \"You and I are like-minded, but we're all part of the same heavenly family.",
        "source": "X13n0285_001:0229c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難是佛堂弟乃世間骨肉之親故名同氣情均天倫者父子兄弟名為天合之倫今明情與同胞無異故言均也深重之恩莫過父母深重之愛莫過妻子若不見佛法殊勝豈能頓捨但所見佛法雖無三境而能見之心須辨真妄故今欲示菩提果體先問發心初因也。",
        "translation": "Ānanda is a disciple of the Buddha who's a flesh-and-blood relative in the world, so he's called \"same-spirited, even-keeled.\" A father, son, and brother are called \"even-keeled.\" Now, it's clear that their feelings are not different from those of their fellow siblings, so they're said to be even-keeled.",
        "source": "X13n0285_001:0229c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二阿難答。",
        "translation": "Second, Ānanda answered.",
        "source": "X13n0285_001:0229c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛我見如來三十二相勝妙殊絕形體映徹猶如瑠璃常自思惟此相非是欲愛所生何以故欲氣麤濁腥臊交遘膿血雜亂不能發生勝淨妙明紫金光聚是以渴仰從佛剃落。",
        "translation": "Ānanda said to the Buddha, \"I've seen the Tathāgata's thirty-two phases [of enlightenment] excellent, marvelous, and superbly shaped, reflecting, and penetrating like lapis lazuli. I've always thought to myself, 'Why doesn't this phase arise from craving?' Why is it that the desire energy, turbidity, foulness, pus, and blood are so mixed up that it can't produce a purple-gold cluster of light that's superior, pure, and brilliant?",
        "source": "X13n0285_001:0229c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發心之緣本無邪曲但恨其不曾識得自心耳故下文徵云誰為愛樂乃至以何為心當我拳曜只是破其所執之心為非不是說其見相發心為咎也。",
        "translation": "The conditions for arousing the mind are not inherently mistaken, but it's because they don't know their own mind that the following section asks, \"Who are the desires and pleasures?\" and \"What is this mind that will be my fist?\" It's just to refute the mind that it clings to as wrong, not to say that it's blameworthy to see characteristics and arouse the mind.",
        "source": "X13n0285_001:0229c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二示以常心直道又二初點示常心二勸修直道。",
        "translation": "Second, there are two ways to show the straight path with a constant mind. First, we'll point out the constant mind and second, we'll encourage cultivation of the straight path.",
        "source": "X13n0285_001:0229c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "Now, first.",
        "source": "X13n0285_001:0229c20_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善哉阿難汝等當知一切眾生從無始來生死相續皆由不知常住真心性淨明體用諸妄想此想不真故有輪轉。",
        "translation": "The Buddha said, \"Good, Ānanda, you should know that all sentient beings who have been subject to birth-and-death continuity since beginningless time do so because they don't know the nature and purity and luminosity of their eternally abiding true mind and use deluded conceptions that are not true and therefore have transmigration.",
        "source": "X13n0285_001:0229c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將欲破妄顯真故先與一口道破也生死有二種一分段生死惟局同居三界二變易生死通於方便實報二土常住真心性淨明體者本覺之理不知者無始覺智也諸妄想者無明塵沙見思也此想不真者即依常住真心性淨明體而成別無自性如繩外無蛇性杌外無鬼性水外無波性空外無華性也蓋眾生無始以來但有本覺未有始覺所以真如不守自性舉全體而成妄想所謂不變隨緣然只此妄想別無自體即以真如為體所謂隨緣不變今欲奪其妄計故曰此想不真猶云此蛇不真乃至此華不真耳又蛇相既起麻相必隱乃至華相既起空相必隱故曰不真耳實非離真別有妄想設別有妄則妄想反有自性而不可破矣楞伽經云妄想無性二祖云覓心了不可得此宗教之大綱要而斯經之真血脉也今更略加委釋此經所明本覺之理的非迷悟所能增減而所勤勤致意者只是提醒當人始覺之智若有始覺之智則本覺之理本自現成不愁無大受用也故經首云如來知彼婬術所加後文云乃至恒沙界外一滴之雨尚知頭數又云覺明分析微細魔事此等皆明如來始覺智滿也下文云是兵要當知賊所在此勸初心起始覺智也今文云皆由不知常住真心下文阿難自責云當由不知真際所詣乃至七大文中一一責云汝元不知汝宛不知等此皆痛其無始覺也常住真心者本自真實當體絕待豎窮橫徧也性淨者本來離過絕非無染汙也性明者本來虗靈洞徹無昏翳也圓具此三妙義而為其體故名常住真心性淨明體即是首題大佛頂義常住故言大性淨故言頂性明故言佛也又即三如來體常住故成法身如來性淨故成應身如來性明故成報身如來又即三因佛性常住是正因性性淨是緣因性性明是了因性又即萬行之體常住故有天行性淨故有梵行嬰行病行性明故有聖行又即首楞嚴三昧之體由常住義中諦三昧成由性淨義俗諦三昧成由性明義真諦三昧成又即無上三菩提體常住是真性菩提性淨是方便菩提性明是實智菩提又即妙奢摩他等所依之體依常住義有妙禪那依性淨義有三摩鉢提依性明義有奢摩他又即是如來藏性三義常住即離即離非是即非即義性淨即一切俱即義性明即一切俱非義又即圓通常三義常住即常真實性淨即通真實性明即圓真實又即七趣惑業苦體依常住義故有妄苦如依空有華依性淨義故有妄業如依巾有結依性明義故有妄惑如依目有翳也又即三涅槃體由常住義故有性淨涅槃由性淨義故有方便淨涅槃由性明義故有圓淨涅槃也用諸妄想者由不知心體常住故用無明妄想由不知心體性淨故用塵沙妄想由不知心體性明故用見思妄想也此想不真者迷常住為無明故無明不真迷性淨為塵沙故塵沙不真迷性明為見思故見思不真又此三惑皆是於常住中妄見流注於性淨中妄見染汙於性明中妄見昏昧故不真也故有輪轉者無明塵沙不真故有變易輪轉見思不真故有分段輪轉也此中已密示二種根本下特顯言之耳。",
        "translation": "In order to dispel delusion and reveal the truth, we first dispel it with a mouthful of the path. There are two kinds of birth-and-death: one is segmental birth-and-death that's limited to living in the same three realms, and the other is transmigration birth-and-death that's connected to the two lands of expedient and real retribution. The eternally abiding true essence of sincerity, nature, purity, and clarity is the essence of the original awakening.",
        "source": "X13n0285_001:0229c24_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "二勸修直道。",
        "translation": "Second, he encourages the cultivation of the straight path.",
        "source": "X13n0285_001:0230c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今欲研無上菩提真發明性應當直心詶我所問十方如來同一道故出離生死皆以直心心言直故如是乃至終始地位中間永無諸委曲相。",
        "translation": "Now, if you want to study the true enlightened nature of unsurpassed bodhi, you should answer my question with a straight mind.",
        "source": "X13n0285_001:0230c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "研者窮源究本之義真發明性者無上菩提雖是諸佛所證實是含靈本有之性但在纏名為隱覆出纏名為發明今欲其稱真性而發明必須研窮審究而欲研窮審究此性必須直心直心者起信所謂正念真如是也終始地位者始從名字終至究竟中間者即是五十五位真菩提路雖有諸位淺深不同而因果無非實相不似前三教之紆曲故言永無諸委曲相也只此直心二字已將楞嚴大定宗旨和盤托出阿難示同未悟不能薦取故起七處妄計一一無非顛倒戲論心言皆不直矣。",
        "translation": "Although unsurpassed enlightenment is realized by the buddhas, it's really the nature that contains the spirit and originally exists, but it's called concealed in the name of entanglement, and it's called invented when it's out of entanglement. To examine and thoroughly investigate this nature, one must have a straight mind; a straight mind is one that gives rise to faith, which is called right mindfulness of truly being; a beginning position is one that begins with a name and ends with a final position.",
        "source": "X13n0285_001:0230c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三廣破七番妄計即為七初正破計內二破轉計在外三破轉計潛根四破轉計見內五破轉計隨生六破轉計中間七破轉計無著。",
        "translation": "The three broad refutations of the seven false imputations are seven: first, the correct refutation of the internal imputation, second, the refutation of the external imputation, third, the refutation of the potential faculties, fourth, the refutation of the internal imputation, fifth, the refutation of the derivative, sixth, the refutation of the middle, and seventh, the refutation of the unattached imputation.",
        "source": "X13n0285_001:0230c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中五初徵起緣心二喻明降伏三牒其內執四懸示定名五正破非內。",
        "translation": "First, there are five categories: first, the mind that raises dependency, second, metaphors to explain subjugation, third, an explanation of internal attachments, fourth, a suspension to show the name of concentration, and fifth, a correct refutation of what's not internal.",
        "source": "X13n0285_001:0230c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "Now, first.",
        "source": "X13n0285_001:0231a01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難我今問汝當汝發心緣於如來三十二相將何所見誰為愛樂阿難白佛言世尊如是愛樂用我心目出目觀見如來勝想心生愛樂故我發心願捨生死。",
        "translation": "Ānanda, I now ask you, when you arouse your mind to look at the Tathāgata's thirty-two marks, what will you see? Who is it that you love? Ānanda said to the Buddha, \"Bhagavān, this is the kind of love and joy that arises from using the eyes of my mind to look out and see the Tathāgata's superior perceptions and the mind's desire for him.",
        "source": "X13n0285_001:0231a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來徵問中最重將何所見誰為愛樂二句後世宗門問念佛的是誰即是得此作用所謂捉賊要見贓也答中招出心目二字乃是下文徵心辨見張本以妄心難除故須七番廣破而目妄處只須門能見不死皆見物二語帶破便足以真見難顯故須十番細辨而心真處只須如是見性是心非眼一言點明便足。",
        "translation": "The most important of the Tathāgata's questions is the two phrases \"What will I see and who will I love?\" Later generations of Buddhists asked who the mindfulness of the Buddha was, which is what got this effect, the saying \"To catch a thief and see the spoils.\" The answer invokes the two words \"mind and eyes\" because the following section of the essay asks the mind to discern the views of Zhang Ben because it's difficult to remove the deluded mind, so seven extensive refutations are needed, and the deluded part of the eye only needs the two words \"the gate that sees immortality and all things\" to bring about refutation, which is sufficient for the true view to be difficult to reveal, so ten detailed refutations are needed, and the true part of the mind only needs to see the nature as it is, which is the mind and not the eye.",
        "source": "X13n0285_001:0231a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二喻明降伏。",
        "translation": "Second, he explained subjugation by metaphor.",
        "source": "X13n0285_001:0231a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難如汝所說真所愛樂因於心目若不識知心目所在則不能得降伏塵勞譬如國王為賊所侵發兵討除是兵要當知賊所在使汝流轉心目為咎。",
        "translation": "The Buddha told Ānanda that as you've said, true delight comes from the mind and eyes. If you don't know where the mind and eyes are, then you won't be able to subdue the dust and labor.",
        "source": "X13n0285_001:0231a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難妄計之目決不能有所見妄計之心決不能生愛樂以目是浮塵心是緣影故也而阿難則謬以為決能有見決能愛樂所謂認物為己顛倒甚矣國王譬本覺賊譬所妄計之心目兵譬始覺妙觀察智蓋本覺雖被賊侵而真如自性之力法爾能起始覺之智譬以發兵也知賊所在者賊無自己窟宅不過就是王土王民但因失於撫御致成巨寇若能如法招安則依舊王土王民實更無賊可得唯心與目亦復如是若知浮根緣影總屬惟心所現則浮根原不是目緣影原不是心蕩蕩歸於王化何處更有塵勞可得今之使汝流轉者秪因非心妄計為心非目妄計為目故成咎耳。",
        "translation": "Ānanda's deludedly conceived eyes can never see anything, and his deludedly conceived mind can never be delighted because the eyes are floating dust and the mind is cognition. Ānanda mistakenly thinks that he can definitely see and definitely delight in things, and the claim that he considers things to be himself is quite mistaken.",
        "source": "X13n0285_001:0231a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三牒其內執又二初正牒二立例。",
        "translation": "Third, there are two explanations of their internal attachments. First, there's the main explanation and second, there's the example.",
        "source": "X13n0285_001:0231b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0231b04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾今問汝惟心與目今何所在阿難白佛言世尊一切世間十種異生同將識心居在身內縱觀如來青蓮華眼亦在佛面我今觀此浮根四塵秪在我面如是識心實居身內。",
        "translation": "Now, I'd like to ask you, 'Where are the mind and eyes now?' Ānanda said to the Buddha, 'Bhagavān, all the ten kinds of worldly beings similarly locate the consciousness mind inside the body, even when they look at the Tathāgata's blue lotus eyes, which are also on the Buddha's face.",
        "source": "X13n0285_001:0231b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十種異生者於十二類生中但除精神化為土木金石及空散銷沉二種暫同無心之物餘十種皆現有心識也計心在內則廣引十生為證據計眼在面則高引如來為證據確哉凡外邪執阿難示同而克肖之。",
        "translation": "The ten kinds of different beings are the twelve kinds of birth, except for the transformation of spirit into earth, wood, metal, stone, and the two kinds that are empty, scattered, and sunken, which are all temporarily the same as things without mind. The other ten kinds are all manifestations of consciousness with mind.",
        "source": "X13n0285_001:0231b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二立例。",
        "translation": "Second, he posited an example.",
        "source": "X13n0285_001:0231b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝今現坐如來講堂觀祇陀林今何所在世尊此大重閣清淨講堂在給孤園今祇陀林實在堂外阿難汝今堂中先何所見世尊我在堂中先見如來次觀大眾如是外望方矚林園阿難汝矚林園因何有見世尊此大講堂戶牖開豁故我在堂得遠瞻見。",
        "translation": "The Buddha told Ānanda, \"Now, as you sit in the Tathāgata's lecture hall and look at Jeta's Grove, where is it? Bhagavān, this large, double-storied, pure lecture hall is in Anāthapiṇḍada's Park, and Jeta's Grove is really outside the hall.",
        "source": "X13n0285_001:0231b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以阿難自身例心以如來大眾例肝腸脾胃等以戶牖例眼以園林例身外諸物也在文易知。",
        "translation": "This is an example of Ānanda's own mind, an example of the Tathāgata's public, including the liver, intestines, spleen, stomach, and so forth, an example of the windows and doors, an example of the eyes, and an example of the park and groves, including things outside the body.",
        "source": "X13n0285_001:0231b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四懸示定名。",
        "translation": "The four hangings reveal the names of the concentrations.",
        "source": "X13n0285_001:0231b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊在大眾中舒金色臂摩阿難頂告示阿難及諸大眾有三摩提名大佛頂首楞嚴王具足萬行十方如來一門超出妙莊嚴路汝今諦聽阿難頂禮伏受慈旨。",
        "translation": "It was then that the Bhagavān extended his golden arm over Ānanda's head in the midst of the crowd and told Ānanda and the other members of the crowd that there was a samādhi, a great buddha-peak, śūraṃgama-rāja, complete with myriad practices, and that the Tathāgata of the ten directions was one gate beyond the marvelous adornment path. Now, listen closely as Ānanda bows his head and submits to his compassionate commands.",
        "source": "X13n0285_001:0231b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲破妄計先唱大定之名者以妄情破處真性全彰若利根人只須內計一破覓心了不可得便得心安心安即是首楞嚴王三昧鈍根執重故破內必轉計外乃至展轉起於無窮計度阿難示同未悟曲寫迷情俾如來方便破顯究暢至理當知從今文去直至第三卷末第四卷初節節圓彰大定所依理體斷不可以三名割裂分配也三摩提亦云三摩地亦云三昧此翻正定有真諦三昧俗諦三昧中諦三昧又有歷別三諦三昧圓融三諦三昧今是圓融三諦三昧統一切法一切三昧悉入其中故名為王舊解見此三摩提字與阿難所問三摩字同遂進退牽合多至失措不知阿難所問即圓覺中所謂三摩鉢提乃是略去鉢提二字今文所云即是三昧梵音楚夏耳須知真諦三昧即奢摩他所成俗諦三昧即三摩鉢提所成中諦三昧即禪那所成又真諦三昧止見思惑俗諦三昧止塵沙惑中諦三昧止無明惑即奢摩他真諦三昧發明空觀俗諦三昧發明假觀中諦三昧發明中觀即三摩鉢提三諦之體無惑可破無觀可立而破而立即禪那也大佛頂具如玄義中釋乃此三昧所依之真性首楞嚴亦如玄義中釋乃是稱性所起之真修具足萬行者一是本有為具謂此大佛頂理無所不統無所不攝故名具足二是該攝為具謂修此三昧即是修行一切三昧乃至六度五行等無不圓攝故名具足三是積聚為具謂眾生無始以來所有一切諸善知彈指聚沙舉手低頭等種種緣因種子若得此三昧時一齊開發顯現故名具足本具約正因該具約了因積具約緣因又三因皆本有故名本具三因皆該攝故名該具三因皆開發故名積具不縱不橫之義復現於此矣行為入理之門一行一切行一切行一行故名一門圓人頓悟頓修永無諸委曲相故名超出稱性所起福慧二種莊嚴還以莊嚴一性性修不二名妙莊嚴始從乾慧終極妙覺故名為路也五正破非內又二初引例二正破。",
        "translation": "Those who want to dispel false discrimination first sing the name of great concentration because where false feelings are dispelled, the true nature is fully revealed. If a person with sharp faculties only needs to dispel internal discrimination once he searches for a mind that's unobtainable, then he attains mental peace.",
        "source": "X13n0285_001:0231c03_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0232a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難如汝所言身在講堂戶牖開豁遠矚林園亦有眾生在此堂中不見如來(而)見堂外者(乎)阿難答言世尊在堂不見如來能見林泉無有是處。",
        "translation": "The Buddha told Ānanda that as you said, you're in a lecture hall, the windows and doors are open and wide, and you can see the grove from afar. Are there sentient beings in this hall who don't see the Tathāgata (and) see out of the hall?\" Ānanda replied, \"The Bhagavān doesn't see the Tathāgata in the hall, and there's no place where he can see the grove or the spring.",
        "source": "X13n0285_001:0232a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正破。",
        "translation": "Second, he correctly refuted it.",
        "source": "X13n0285_001:0232a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難汝亦如是汝之心靈一切明了若汝現前所明了心實在身內爾時先合了知內身頗有眾生先見身中(而)後觀外物(者乎)縱不能見心肝脾胃(至於)爪生髮長筋轉脉搖誠合明了如何(亦)不知(耶)必不內知云何知外是故應知汝言覺了能知之心住在身內無有是處。",
        "translation": "Ānanda, you too are thus fully aware of your mind. If the mind you've previously understood really lies within the body, then how could you first comprehensively understand the internal body? Could it be that some sentient beings first see inside the body and then look at external things, even though they can't see the heart, liver, spleen, stomach, or even the nails, hair, tendons, and veins that shake, and sincerely comprehend how to (also) not know?",
        "source": "X13n0285_001:0232a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓覺經云妄認六塵緣影為自心相此經云一迷為心決定惑為色身之內此一切眾生之通計也下文六處不過是轉計耳此雖破其妄心無所實即為顯妄心無體惟無體故無所也又無體無所而一切明了正所謂性同虗空亦無虗空相貌可得非即全體真心而何故曰密顯真心也不能於此薦取辜負圓音甚矣。",
        "translation": "Although the Sutra of Perfect Enlightenment says that deludedly identifying the six dust motes and their cognitive images as the characteristics of one's own mind, and this sutra says that a deluded mind is a mind that is determined to be confused within the form body, the following six sense-fields are nothing but transgressions, even though they refute the reality that the deluded mind has no body, but since it has no body, it has no object, and yet everything is clearly understood, which is precisely the so-called nature of the same as space, and there are no appearances of space that can be obtained other than the whole true mind.",
        "source": "X13n0285_001:0232a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破轉計在外二初轉計二破斥。",
        "translation": "Second, it refutes the notion that there are two alternatives, the first being to reject the notion and the second being to refute it.",
        "source": "X13n0285_001:0232b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0232b07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難稽首而白佛言我聞如來如是法音悟知我心實居身外所以者何譬如燈光(設使)然於室中是燈必能先照室內從其室門後及庭際(今)一切眾生不見身中獨見身外(者)亦如燈光居在室外不能照室是義必明將無所惑同佛了義得無妄耶。",
        "translation": "Ānanda bowed his head and said to the Buddha, \"I've heard such a Dharma voice from the Tathāgata and realized that my mind really lives outside of the body. Why is that? Like a lamp (suppose) it's in a room, the lamp must be able to shine inside the room first, and from behind the door of the room and at the edge of the courtyard (now) all sentient beings don't see inside the body and see outside the body alone (he) is also like a lamp that lives outside and can't shine in the room.",
        "source": "X13n0285_001:0232b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破斥又二初立例二正破。",
        "translation": "Second, there are two ways to refute it. First, we'll establish an example, and second, we'll refute it.",
        "source": "X13n0285_001:0232b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, there's the example.",
        "source": "X13n0285_001:0232b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難是諸比丘適來從我室羅筏城循乞摶食歸祇陀林我已宿齋汝觀比丘一人食時諸人飽不阿難答言不也世尊何以故是諸比丘雖阿羅漢軀命不同云何一人能令眾飽。",
        "translation": "The Buddha told Ānanda that these monks had come from my city of Śrāvastī to gather food and return to the Jetavana grove after I had stayed overnight.",
        "source": "X13n0285_001:0232b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摶食即段食有形質分段可摶取者也宿止也宿齋猶言足食即是結齋之義。",
        "translation": "A handful of food is a portion of food that has form and substance and can be handed out in pieces; it's also a nighttime meal, which is the same as a full meal, which is the meaning of purification.",
        "source": "X13n0285_001:0232b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正破。",
        "translation": "Second, he correctly refutes it.",
        "source": "X13n0285_001:0232b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難若汝覺了知見之心實在身外身心相外自不相干則心所知身不能覺覺在身際心不能知我今示汝兜羅綿手汝眼見時心分別不阿難答言如是世尊佛告阿難若相知者云何在外是故應知汝言覺了能知之心住在身外無有是處。",
        "translation": "The Buddha told Ānanda that if your mind that perceives and knows is really outside the body, then the mind knows that the body can't perceive what's outside the body, and the mind can't know what's outside the body.",
        "source": "X13n0285_001:0232b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "兜羅綿白淨柔軟佛手似之故名兜羅綿手。",
        "translation": "The white, pure, and flexible hand of the Buddha is like this, so it's called a palm of Tuoluo cotton.",
        "source": "X13n0285_001:0232c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三破轉計潛根二初轉計二破斥。",
        "translation": "Three refutations of the potential faculties of transmigration, the first being transmigration and the second being refutation.",
        "source": "X13n0285_001:0232c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "Now, first.",
        "source": "X13n0285_001:0232c02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言世尊如佛所言不見內故不居身內身心相知不相離故不在身外我今思惟知在一處佛言處今何在阿難言此了知心既不知內而能見外如我思忖潛伏根裡猶如有人取瑠璃椀合其兩眼雖有物合而不留礙彼根隨見隨即分別然我覺了能知之心不見內者為在根故分明矚外無障礙者潛根內故。",
        "translation": "Ānanda said to the Buddha, \"Bhagavān, as the Buddha said, 'I don't see inside; therefore, I don't live inside the body; my body and mind know each other and aren't separate; therefore, I don't live outside the body.' Now, I think about it and know that it's in one place.\" Buddha said, \"Ānanda, since this mind of knowing doesn't know what's inside, it can see what's outside.",
        "source": "X13n0285_001:0232c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瑠璃寶名內外明徹亦如今之眼鏡相類以眼喻心以瑠璃椀喻眼根淨色故云眼隨見心隨分別。",
        "translation": "The name \"lapis lazuli\" refers to internal and external clarity, and it's also the same as the present eyeglasses.",
        "source": "X13n0285_001:0232c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破斥又二初立例二正破。",
        "translation": "Second, there are two ways to refute it. First, it establishes an example, and second, it correctly refutes it.",
        "source": "X13n0285_001:0232c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "Now, first.",
        "source": "X13n0285_001:0232c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難如汝所言(此心)潛根內者猶如(眼在)瑠璃(之內)彼人當以瑠璃籠眼(之時)當(其外)見山河(亦復)見瑠璃不如是世尊是人當以瑠璃籠眼實見瑠璃。",
        "translation": "The Buddha told Ānanda that as you've said, (this mind) that's hidden inside the faculties is like (the eye inside) a lapis lazuli.",
        "source": "X13n0285_001:0232c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正破。",
        "translation": "Second, he correctly refutes it.",
        "source": "X13n0285_001:0232c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝心若同瑠璃合者當見山河何不見眼若見眼者眼即同境不得成隨若不能見云何說言此了知心潛在根內如瑠璃合是故應知汝言覺了能知之心潛伏根裡如瑠璃合無有是處。",
        "translation": "The Buddha told Ānanda, \"If your mind is united with lapis lazuli, then you will see mountains and rivers. Why don't you see the eye? If you see the eye, then the eye will be united with the object and won't be able to follow it.",
        "source": "X13n0285_001:0232c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設許見眼眼即同於外境無能見用則隨見隨即分別之義不成既不見眼則法喻不齊心非潛在根內明矣。",
        "translation": "If you allow the eye to see, the eye is the same as the external object, and there's no function of seeing, then the meaning of discrimination following seeing and following is not realized.",
        "source": "X13n0285_001:0232c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四破轉計見內二初轉計二破斥。",
        "translation": "The fourth refutation of the view of transference of imagination is the first, the second refutation of imagination.",
        "source": "X13n0285_001:0232c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0232c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言世尊我今又作如是思惟是眾生身腑臟在中竅穴居外有臟則暗有竅則明今我對佛開眼見明名為見外閉眼見暗名為見內是義云何。",
        "translation": "Ānanda said to the Buddha, \"Bhagavān, I now think this: 'The internal organs of the body of sentient beings are viscera in the orifices, and the orifices are external.' What is the meaning of opening my eyes to the Buddha and seeing light, which is called seeing outward, and closing my eyes and seeing darkness, which is called seeing inward?",
        "source": "X13n0285_001:0233a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此復計心在內也初計內時佛以不能見內難之今云見暗即是見內正轉救初難也。",
        "translation": "This further calculates that the mind is within the first calculates that when the Buddha is unable to see within the difficulty of the present cloud seeing darkness is to see within the correct turn to save the first difficulty.",
        "source": "X13n0285_001:0233a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破斥又三初正破二轉破三結破。",
        "translation": "Second, there are three refutations. First, there's the correct refutation, the second is the indirect refutation, and the third is the concluding refutation.",
        "source": "X13n0285_001:0233a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, there's the first.",
        "source": "X13n0285_001:0233a06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝當閉眼見暗之時此暗境界為與眼對為不對眼若與眼對暗在眼前云何成內若成內者居暗室中無日月燈此室暗中皆汝焦腑若不對者云何成見。",
        "translation": "When the Buddha told Ānanda, \"When you close your eyes and see darkness, is this realm of darkness opposed to the eye or not opposed to the eye?\" If it's opposed to the eye and darkness is in front of your eyes, how can it become internal? If it becomes internal, then you live in a dark room with no sun or moon lamp, and the darkness in this room is all inside your gut.",
        "source": "X13n0285_001:0233a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中先以對不對雙牒次雙破也若與眼對下先破對又二意一者既對則非內二者許內則有過若不對下次破不對只須云何成見一句也。",
        "translation": "Here, the first is a dual explanation of opposition and non-opposition, and the second is a rebuttal of both.",
        "source": "X13n0285_001:0233a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二轉破又三初破其轉計內對二破其轉計在空三破其轉計兩覺。",
        "translation": "Second, there are three refutations of the first refutation of the internal opposition, two refutations of the internal opposition to emptiness, and three refutations of the internal opposition to the two views.",
        "source": "X13n0285_001:0233a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first one is this.",
        "source": "X13n0285_001:0233a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離外見內對所成合眼見暗名為身中開眼見明何不見面若不見面內對不成見面若成此了知心及與眼根廼在虗空何成在內。",
        "translation": "If the external view is removed and the internal opposition is formed, then the combined eye seeing darkness is called the body in which the eye is opened and the light is not seen.",
        "source": "X13n0285_001:0233a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐彼又轉救云開眼見外名為外對閉眼見暗名為內對則暗仍與眼對而亦不取室暗為焦腑也今即牒而破之既許內對則開眼時亦可內對而見其面若開眼不能內對而見其面則閉眼亦何能成內對乎又設許內對見面則心眼俱在虗空仍違汝心在身內之計矣。",
        "translation": "I'm afraid they'll say that opening the eyes and seeing outward is called external opposition, and closing the eyes and seeing darkness is called internal opposition, so darkness is still opposed to the eyes and the darkness of the room is not taken to be the charnel ground.",
        "source": "X13n0285_001:0233a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破其轉許在空。",
        "translation": "Second, it refutes the notion that it's in emptiness.",
        "source": "X13n0285_001:0233a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在虗空自非汝體即應如來今見汝面亦是汝身汝眼已知身合非覺。",
        "translation": "If it's in space, then it's not your body, which means the Tathāgata should see your face and your body, and your eyes have known that the body is united with non-awareness.",
        "source": "X13n0285_001:0233b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐彼救云設許心眼俱在虗空亦復何過今更牒而破之若在虗空便非汝體則如來今見汝面即應如來亦是汝身之眼汝眼已知身猶應未覺也。",
        "translation": "If it's in space, then the Tathāgata is not your body, and the Tathāgata now sees your face, which should be the Tathāgata's eye and your body's eye, and your eye has known the body as if it were not yet enlightened.",
        "source": "X13n0285_001:0233b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三破其轉許兩覺。",
        "translation": "Third, it refutes his claim that he's turning to two kinds of awakening.",
        "source": "X13n0285_001:0233b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "必汝執言身眼兩覺應有二知即汝一身應成兩佛。",
        "translation": "You must insist that there should be two knowables in the body and eyes and two knowables, meaning that your whole body should become two buddhas.",
        "source": "X13n0285_001:0233b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "恐彼更轉救云眼雖在空何妨眼知身亦隨覺今更破云若許眼在虗空仍復與身兩處皆覺則現在二知當成兩佛矣夫成佛時雖復化身無數秪如月印千江豈可謂法身有二體耶。",
        "translation": "Although the eye is in space, what's the harm in the eye knowing that the body is also accompanied by perception? Now, I'd like to refute that by saying that if you allow the eye to be in space, and the body to be perceived in both places, then you'll become two buddhas in the present with two kinds of knowing.",
        "source": "X13n0285_001:0233b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三結破。",
        "translation": "He refutes the three limitations.",
        "source": "X13n0285_001:0233b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故應知汝言見暗名見內者無有是處。",
        "translation": "\"Therefore, you should know that there's no place for the term 'seeing darkness' and 'seeing within.'",
        "source": "X13n0285_001:0233b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五破轉計隨生二初轉計二破斥。",
        "translation": "Five refutations of the notion that [the buddha] body is produced according to a set of mistaken notions are first, a set of mistaken notions, and second, a refutation.",
        "source": "X13n0285_001:0233b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0233b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言我常聞佛開示四眾由心生故種種法生由法生故種種心生我今思惟即思惟體實我心性隨所合處心則隨有亦非內外中間三處。",
        "translation": "Ānanda said, \"I've always heard the Buddha instruct the four groups of people that it's because the mind arises that various things arise and because things arise that various minds arise, I now contemplate that this is contemplated as the essence, the true nature of my mind, and where it meets, the mind follows existence, and it's not the three intermediate places between inside and outside.",
        "source": "X13n0285_001:0233b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前之四章俱是自心計度此下三章俱借聖教妄推雖借聖教不解教旨以其誤認緣影不知心之實義故也且如心生法生四句顯示因緣即空假中道理語言雖同義關四教若謂心生法生心滅法滅法生心生法滅心滅心法互為因緣雖生滅宛然而惟是因緣假合別無時方微塵大自在等以為能生亦非無因緣故自然而生此則藏教義也若謂心生法生則心外無法法本無生法生心生則法外無心心亦無生心法當體無生是名因緣即空通教義也若謂無明不覺生於三細是謂心生法生境界風動轉識浪生是謂法生心生心法互為因緣故有十界差別假名無量別教義也若謂心生法生則一切惟心法生心生則一切惟法互奪則心法兩亡雙照則心法宛爾而皆體是法界不可思議所謂因緣即中圓教義也今阿難雖述其文不達其義堅執緣影為自心性而云隨合隨有不定內外中間處所尚非藏教法生心生片義況全義耶。",
        "translation": "Although the previous four chapters were all self-calculations, the next three chapters are all borrowings from the noble teaching and deludedly inferred from it because they misunderstand the conditional images and don't know the true meaning of mind.",
        "source": "X13n0285_001:0233b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破斥三初牒計二正破三結破。",
        "translation": "Second, he refutes three initial assumptions, two correct refutations, and three concluding refutations.",
        "source": "X13n0285_001:0233c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, let's begin with the explanation.",
        "source": "X13n0285_001:0233c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝今說言由法生故種種心生隨所合處心隨有者。",
        "translation": "The Buddha told Ānanda, \"Now, you're saying that because the Dharma arises, various minds arise, and there are various places where minds fit together.",
        "source": "X13n0285_001:0233c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難雖則雙述心生法生之文而意惟在法生故心生且又不知妄心無體計此緣影以為能合種種諸法以為所合故佛牒計中不須更出前之兩句以前兩句非彼妄計張本故也。",
        "translation": "Although Ānanda both stated the text that the mind is produced and dharmas are produced, his only intention was that the mind is produced because dharmas are produced and he didn't know that the deluded mind has no body and considers this conditioned image to be the one that brings together all kinds of dharmas in order to bring them together.",
        "source": "X13n0285_001:0233c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正破又二初破無體二破有體。",
        "translation": "Second, there are two correct refutations. First, it refutes the lack of essence, and second, it refutes the presence of essence.",
        "source": "X13n0285_001:0233c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0233c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是心無體則無所合若無有體而能合者則十九界因七塵合是義不然。",
        "translation": "If the mind has no body, then there's nothing to unite, and if it can unite without having a body, then the nineteen elements are united because of the seven dust motes.",
        "source": "X13n0285_001:0233c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫妄心的確無體但阿難久執有體不達本無故今得以無體難之是心者指彼所執緣影也既不知緣影非心則必妄謂有體斷斷不敢承當無體之義矣六塵十八界全體皆即自心今獨計此緣影以為自心則塵界並為心外之法更欲以此無體之緣心來合諸法何異欲以第七無體之塵合成第十九無體之界乎是義必不然矣。",
        "translation": "The false mind really has no body, but Ānanda's long-held belief that it has a body doesn't reach its original nothingness, so now he can criticize it for having no body. That mind refers to the conditioned images it holds, and since it doesn't know that conditioned images aren't mind, it must falsely claim that they have a body and flatly dare not accept the meaning of no body. The six dust motes and eighteen realms are all self-mind, but if he considers this conditioned image to be self-mind alone, then the dust realm is a dharma outside of mind.",
        "source": "X13n0285_001:0233c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破有體又二初約內外出入破二約一多徧不徧破。",
        "translation": "Second, there are two ways to refute the idea that there are essences. First, we'll refute the idea that there are internal and external aspects, and second, we'll refute the idea that there are many, many, many, and not many.",
        "source": "X13n0285_001:0234a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0234a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有體者如汝以手自挃其體汝所知心為復內出為從外入若復內出還見身中若從外來先合見面阿難言見是其眼心知非眼為見非義佛言若眼能見汝在室中門能見不則諸已死尚有眼存應皆見物若見物者云何名死。",
        "translation": "If there's a body, then suppose you point your hand at its body and you know whether the mind is again exiting from within or entering from without. If it's again exiting from within, then it's still seen in the body, or if it's coming from outside, then it's first combined with seeing the face.",
        "source": "X13n0285_001:0234a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此正破妄心而乘便兼破妄眼也浮塵之眼不能有見緣影之心何能有知噫可以思矣。",
        "translation": "This is to refute the deluded mind and the vehicle will refute the deluded eye as well. The eye of floating dust can't have views that are contingent on the mind of shadow, how can it have knowledge that can be considered.",
        "source": "X13n0285_001:0234a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二約一多徧不徧破。",
        "translation": "The two are approximately one and many, pervasive and not pervasive, and they are refuted.",
        "source": "X13n0285_001:0234a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難又汝覺了能知之心若必有體為復一體為有多體今在汝身為復徧體為不徧體若一體者則汝以手挃一支時四支應覺若咸覺者挃應無在若挃有所則汝一體自不能成若多體者則成多人何體為汝若徧體者同前所挃若不徧者當汝觸頭亦觸其足頭有所覺足應無知今汝不然。",
        "translation": "Ānanda, if you perceive the mind that's capable of knowing, then it must have a body, whether it's more than one body or more than one body. If it's one body, then when you touch one with your hand, the four limbs should perceive it.",
        "source": "X13n0285_001:0234a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先立四句然後一一破之初一體句謂四支共一心體故以咸覺為難設使咸覺則挃無徧在今挃既徧有所在則咸覺義墮而四支共一心體不成矣次多體句即是多心故是多人三徧體句謂一心滿於四支與前四支共一心體是同故亦同前所難四不徧句謂一心不能徧應故宜一處有知一處無知也今汝不然句總結四句皆非。",
        "translation": "First, the phrase \"one body\" means that the four branches share the same mental body, so it's difficult to understand because it's salty. If it were salty, then it wouldn't be omnipresent, but now that it's omnipresent, the meaning of salty understanding has fallen away, and the four branches don't share the same mental body. Second, the phrase \"many bodies\" means that there are many minds, so there are many people.",
        "source": "X13n0285_001:0234a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三結破。",
        "translation": "The three concluding statements refute this.",
        "source": "X13n0285_001:0234b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故應知隨所合處心則隨有無有是處。",
        "translation": "Therefore, you should know that following the place of conjunction, the mind follows existence and there's no such place.",
        "source": "X13n0285_001:0234b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六破轉計中間二初破泛計二破正計。",
        "translation": "Six refutations of the notion of existence in the interim: the first refutes the general notion and the second refutes the correct notion.",
        "source": "X13n0285_001:0234b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中二初泛計二泛破。",
        "translation": "The first two are a general calculation and the second is a general refutation.",
        "source": "X13n0285_001:0234b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "Now, first.",
        "source": "X13n0285_001:0234b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言世尊我亦聞佛與文殊等諸法王子談實相時世尊亦言心不在內亦不在外如我思惟(若言在)內(則)無所見(若言在)外不(應)相知內無知故在內不成身心相知在外非義今相知故復內無見當在中間。",
        "translation": "Ānanda said to the Buddha, \"Bhagavān, when I heard the Buddha talk to Mañjuśrī and other Dharma princes about reality, the Bhagavān also said that the mind isn't inside and isn't outside.",
        "source": "X13n0285_001:0234b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫佛說心不在內亦不在外正即顯示心無體相亦無方隅無相不相故名實相也而阿難方認緣影則宛然有相可得其為幻妄甚矣然未的指何者為中故名泛計。",
        "translation": "The Buddha's teaching that the mind is neither internal nor external precisely shows that the mind has no essence or characteristics, no direction or corner, and no characteristics or non-characteristic aspects; therefore, it's called true characteristics.",
        "source": "X13n0285_001:0234b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二泛破。",
        "translation": "Second, it's a general refutation.",
        "source": "X13n0285_001:0234b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言汝言中間中必不迷非無所在今汝推中中何為在為復在處為當在身若在身者在邊非中在中同內若在處者為有所表為無所表無表同無表則無定何以故如人以表表為中時東看則西南觀成北表體既混心應雜亂。",
        "translation": "The Buddha said, \"When you say the middle is in the middle, you mustn't be confused about where it isn't. Now, when you speculate about the middle, what's in it? Is it again in the place? Should it be in the body? If it's in the body, it's at the edge and not in the middle; if it's in the middle, it's the same as the inside; if it's in the place, then it's either something shown or nothing shown, and there's nothing shown, then there's no concentration.",
        "source": "X13n0285_001:0234b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以阿難但說中字義不分明須以在處在身二義定之故曰中必不迷非無所在也。",
        "translation": "Because Ānanda only explained that the meaning of the word \"middle\" isn't clear, he must use the two meanings of \"in the place\" and \"in the body\" to define it, so he said \"middle\" must not be confused, not \"no place.",
        "source": "X13n0285_001:0234b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破正計二初正計二正破。",
        "translation": "Second, to refute correct conceptualization, there are two ways to begin with correct conceptualization and two ways to begin with correct refutation.",
        "source": "X13n0285_001:0234b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0234b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言我所說中非此二種如世尊言眼色為緣生於眼識眼有分別色塵無知識生其中則為心在。",
        "translation": "Ānanda said, \"What I've described is not these two kinds. As the Bhagavān said, eye form is the condition for arising in the eye and consciousness, and when the eye discerns form and dust and has no knowledge of them, then the mind is present in them.",
        "source": "X13n0285_001:0234b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難本意正計於此但此眼色為緣生於眼識二語義關四教若知正此因緣生識不屬邪因無因而此因緣所生之識無實體性無我我所即藏教義若知能生所生一總無性當體全空即通教義若分別緣生假名無量所謂眼識九緣生耳識惟從八乃至備明八識因轉果轉差別不同即別教義若知識性無源因於六種根塵妄出性識明知覺明真識妙覺湛然徧周法界含吐十虗無有方所但是循業發現說名緣生緣生之性即是實性所謂不變隨緣隨緣不變即圓教義或謂此是相宗不了義說蓋未深求其致故也今阿難所計乃妄指緣影為心謂是根塵之所共生有體可得尚非藏教無實體性之義況通別圓義耶。",
        "translation": "Ānanda's original intention was precisely to impute here that the eye form is a condition arising from the eye consciousness, and the two statements relate to the four teachings. If one knows that consciousness that arises correctly from these causes and conditions doesn't belong to wrong causes and has no cause, then the consciousness that arises from these causes and conditions has no real essence and no self or self, which is the meaning of the conventional teaching.",
        "source": "X13n0285_001:0234c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正破。",
        "translation": "Second, he correctly refutes it.",
        "source": "X13n0285_001:0234c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言汝心若在根塵之中此之心體為復兼二為不兼二若兼二者物體雜亂物非體知成敵兩立云何為中兼二不成非知不知即無體性中何為相是故應知當在中間無有是處。",
        "translation": "The Buddha said, \"If your mind is in the midst of sense-fields and dust, does the essence of this mind have both or neither? If it has both, then things and objects are confused, things aren't essences, and you know that they're formed and opposed to each other.",
        "source": "X13n0285_001:0234c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂汝所計中間之心為復兼用根塵二法以為共體為復不兼根塵二法而另自有體耶此雙牒也破中先破兼二若兼二者則色塵之物與眼根之體互相雜亂而物終非如體之有知則知與無知到底成敵兩立云何可名為中次破不兼若兼二不成者則汝心體既非根之有知又非塵之不知將以何為體性體性尚無中有何相乎。",
        "translation": "That is, do you suppose that the mind in the middle both uses the faculties and the dust as a common body and doesn't also use the faculties and dust as two things and has its own body? This is a double ultimatum that also refutes the middle. First, it refutes the both. If the both is refuted, then the things of form and dust and the body of the eye faculty are mutually confusing, and the things are ultimately not like the essence of knowing.",
        "source": "X13n0285_001:0234c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七破轉計無著二初轉計二破斥。",
        "translation": "The first is to reckon and the second is to refute.",
        "source": "X13n0285_001:0235a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0235a02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言世尊我昔見佛與大目連須菩提富樓那舍利弗四大弟子共轉法輪常言覺知分別心性既不在內亦不在外不在中間俱無所在一切無著名之為心則我無著名為心不。",
        "translation": "Ānanda said to the Buddha, \"Bhagavān, I once saw the Buddha and the four great disciples Mahāmaudgalyāyana, Subhūti, Pūrṇa, and Śāriputra turning the Dharma wheel together, and they always said that they perceived and discerned the nature of mind as neither internal nor external, and neither was there anything in between.",
        "source": "X13n0285_001:0235a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無在無著義亦關於四教若言心惟假名毫無實體故無在無著即藏教義若言假名既空假法亦空心法俱空何在何著即通教義若言心無所在無所不在無所不在故無所著即別圓義今阿難堅執緣影為心而以為不在三處大似獼猴跳躑棲止無恒尚非藏教假名無實之義況別圓耶觀此三章方知語言雖同其旨碩異邪人說正法正法亦成邪末世借了義極談成自己僻解者類若此也。",
        "translation": "If it's said that the mind is only nominal and has no substance, therefore it's neither present nor attached, that's the meaning of the tripiṭaka teaching. If it's said that the nominal is empty and the conventional is empty, then both mind and conventional are empty, what is there and what is attached to it?",
        "source": "X13n0285_001:0235a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二破斥。",
        "translation": "Second, they refute it.",
        "source": "X13n0285_001:0235a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝言覺知分別心性俱無在者世間虗空水陸飛行諸所物象名為一切汝不著者為在為無無則同於龜毛兔角云何不著有不著者不可名無無相則無非無則相相有則在云何無著是故應知一切無著名覺知心無有是處。",
        "translation": "The Buddha told Ānanda, \"You say that perception discerns the nature of mind as both absent and present, but the world is nothing but the sky, water, land, flight, and movement, and all things are called everything that you don't attach to as present or absent, which is the same as a tortoise's hair or a rabbit's horn?",
        "source": "X13n0285_001:0235a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難既認緣影為心則是另有一物但不著在一處耳故佛破云世間虗空水陸飛行諸所物象名為一切收無不盡汝既言一切不著則此不著之心為離一切而另有所在耶為別無所在耶此雙牒也先破無在云若別無所在則此心便同龜毛兔角云何猶得名為無著次破有在云若有一个不著者則便不可名無除是無相則可名無若其非無則便有相相既成有則決有所在又云何可名無著耶結破可知齊此已上是逐破妄執密顯真心即是破徧計執所謂繩上實無蛇也。",
        "translation": "Since Ānanda recognizes that conditioned images are mind, then there's another thing that doesn't stick in one place, the Buddha refutes that by saying that everything doesn't stick, then is this mind that doesn't stick separate from everything and has another presence? Is it a separate absence? This is a double ultimatum.",
        "source": "X13n0285_001:0235a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二顯示妙理兼破餘妄此顯依他起性體即圓成兼破依他非實如顯繩體即麻破其麻上定有繩之見也分文為三初總示萬法惟心二別就見精顯性三徧歷陰入處界會理。",
        "translation": "Second, it shows the marvelous principle and refutes other delusions. This shows that the nature of dependent arising is perfectly formed and refutes the view that other-dependence is not real, such as showing the body of a rope, which is hemp, and refutes the view that there's definitely a rope on the hemp.",
        "source": "X13n0285_001:0235b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初總示萬法惟心此文舊皆判屬破妄謂前是破妄心無所今方破妄心無體不知妄心惟其無體是以無所妄心空處全體即真是故前雖一往破妄已是密顯於真況今瑞表真常明示二本指諸法之惟心唱妙心之有體何非直顯真性至於咄破舊迷秪是破妄之餘陣耳故應以顯真為正破妄為傍也復分為二初正示二本不離一心二委示心體不同妄執。",
        "translation": "First, the general indication that all things are only mind, this text was previously judged to be the destruction of delusion, meaning that the former is the destruction of the deluded mind without a body, and now the direction of the destruction of the deluded mind without a body does not know that the deluded mind only has no body, because there is no body, the deluded mind is empty, and the whole place is really true.",
        "source": "X13n0285_001:0235b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中二初當機申請二如來開示。",
        "translation": "First, there are two applications in the beginning, and second, the Tathāgata's revelation.",
        "source": "X13n0285_001:0235b17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "Now, first.",
        "source": "X13n0285_001:0235b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難在大眾中即從座起偏袒右肩右膝著地合掌恭敬而白佛言我是如來最小之弟蒙佛慈愛雖今出家猶恃嬌憐所以多聞未得無漏不能折伏娑毗羅呪為彼所轉溺於淫舍當由不知真際所詣惟願世尊大慈哀愍開示我等奢摩他路令諸闡提隳彌戾車作是語已五體投地及諸大眾傾渴翹佇欽聞示誨。",
        "translation": "It was then that Ānanda rose from his seat in the midst of the crowd, bared his right shoulder, knelt on his right knee, put his palms together in respect, and said to the Buddha, \"I'm the youngest disciple of the Tathāgata, and I've been loved by the Buddha. Although I've left home now, I still rely on his pity.",
        "source": "X13n0285_001:0235b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未得無漏者不但未至漏盡亦未得初果無漏真明也以初果分證無漏得道共戒則雖未斷欲愛亦非淫呪之所能轉況前文七處妄執皆是見惑所攝舊云阿難先證初果恐未必然當以第三卷末圓悟藏性之時方為迹同初果故至第四卷中方云汝今已得須陀洹果耳真際者三德祕藏極則之理名為真際之家一心三止譬如能詣之路人見但舉奢摩他名便欲割裂分判不知圓名舉一即三也闡提此云斷善根彌戾車此云惡知見不知性具圓宗執定佛性三無二有即是斷佛界之善根總名為惡知見。",
        "translation": "Not only has he not yet attained the end of contamination, but he has also not yet attained the first realization of uncontaminated true insight. The partial realization of the first realization is the uncontaminated attainment of the common path and precepts, even though he hasn't yet stopped craving, it's not something that can be changed by a prostitution spell. The old saying that Ānanda first realized the first realization is probably not inevitable.",
        "source": "X13n0285_001:0235c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二如來開示二初瑞表真常二正示二本。",
        "translation": "Second, the Tathāgata reveals two things. First, the auspicious sign is truly eternal, and second, he correctly shows the two origins.",
        "source": "X13n0285_001:0235c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0235c13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從其面門放種種光其光晃曜如百千日普佛世界六種震動如是十方微塵國土一時開現佛之威神令諸世界合成一界其世界中所有一切諸大菩薩皆住本國合掌承聽。",
        "translation": "At the time, the Bhagavān radiated various lights from the entrance of his face that shone like a hundred thousand suns, causing the six kinds of trembling in the Buddha's world. Thus, the ten directions of tiny lands were suddenly opened up by the Buddha's authority and power, causing the worlds to merge into a single realm, and all the great bodhisattvas in that world lived in their own country and joined their palms together to listen.",
        "source": "X13n0285_001:0235c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將欲正顯常住真心性淨明體故先放光現瑞以表示之面門者六根都聚之處又是向背之所從分於此放光欲令眾生背塵合覺故也蓋眾生背覺合塵起諸妄計所以七處咸非如來背塵合覺妙契真常所以六根皆是如百千日者照萬法以無遺也六種震動者破昏聵而令覺也十方開現合成一界者迷於妄則無同異中熾然成異悟其真則一切差別性無差別也菩薩皆住本國者不動法界也合掌承聽者咸契真源也瑞之所表全彰妙法利根之士觸目會心為不了者再申言辨耳。",
        "translation": "Because they want to correctly reveal the true nature of the eternally abiding mind as pure and luminous, they first emit a ray of light and show an auspicious sign to indicate that this is the place where the six faculties all gather and where they face backwards and forwards, and here they emit a ray of light in order to cause sentient beings to face backwards and merge with the dust and awaken. It's because sentient beings face backwards and awaken with the dust that gives rise to false assumptions, so the seven places are all not the Tathāgata's face backwards and merge with the dust and awaken to the marvelous true eternal, so the six faculties are all like a hundred thousand suns that shine on all things without remainder.",
        "source": "X13n0285_001:0235c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六種震動謂動踊起震吼擊也前三屬形後三屬聲即表諸佛形聲兩益。",
        "translation": "The first three are form, and the last three are sound, which means they represent both the form and sound of the buddhas.",
        "source": "X13n0285_001:0236a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正示二本。",
        "translation": "The second correctly shows the two buddha-bodies.",
        "source": "X13n0285_001:0236a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難一切眾生從無始來種種顛倒業種自然如惡叉聚諸修行人不能得成無上菩提乃至別成聲聞緣覺及成外道諸天魔王及魔眷屬皆由不知二種根本錯亂修習猶如煑沙欲成嘉饌縱經塵劫終不能得云何二種阿難一者無始生死根本則汝今者與諸眾生用攀緣心為自性者二者無始菩提涅槃元清淨體則汝今者識精元明能生諸緣緣所遺者由諸眾生遺此本明雖終日行而不自覺枉入諸趣。",
        "translation": "The Buddha told Ānanda that all sentient beings who have been born from beginningless time with various mistaken karmic seeds naturally resemble a cluster of bad forks, and their practitioners can't attain unsurpassed bodhi or even separately become direct disciples, pratyekabuddhas, or become non-Buddhists, gods, Māra kings, and Māra's followers because they don't know the two kinds of fundamentals and mistakenly cultivate them like a firewood trying to make a delicious meal that never reaches them even after a dusty eon.",
        "source": "X13n0285_001:0236a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前已總明一切眾生生死相續皆由不知常住真心性淨明體用諸妄想此想不真故有輪轉然猶未曾分明說此真心妄想總無二體如麻之與蛇不離一繩今更申明二本不離一心使人不遺真以逐妄須了妄以歸真也一切眾生泛指迷真逐妄之流廣如下文七趣所列諸修行人別指厭妄求真之士廣如下文陰魔所明惡叉西域果名此方所無聚者三必同生共成一聚以喻惑業苦三始終不相離也不成無上菩提指權教菩薩別成聲聞緣覺指藏通二乘餘皆可知此之二流雖復一是任迷一是趨悟賢愚迥然不同而未達真妄源頭無有始覺真智則一而已故總責云皆由不知二種根本也沙喻依他性上所起徧計執性饌喻依他性上所具圓成實性不捨徧計那獲圓成塵劫勤修總為唐喪可不慎哉攀者能緣之心即八種識各有見分緣者所攀之境即八種識各有相分依八種識之自證分起此見相二分是名依他起性不了此之心境惟是八識自證所現橫起我法二執是名用攀緣心為自性者即所謂妄認四大為自身相妄認六塵緣影為自心相等是也以此為無始生死根本者由不達心境悉無自性即是常住真心性淨明體所以凡夫起於貪著攀三界六塵之緣則為分段生死根本二乘起於厭惡別攀真諦涅槃之緣菩薩雙捨二邊別攀但中理性之緣則為變易生死根本也菩提者四種智德之果涅槃者三種斷德之果元清淨體者性本清淨不待修證而後淨也識精通指八識各自精了所謂自證分也元明總指八識所依一心所謂證自證分也然非分剖一心以為八个證自證分亦非八識共只一个證自證分良由心體離過絕非不可思議只此元明之體徧在八識八識各得其全以為證自識分如八人同觀一輪圓月行向八方各有全月隨八人去亦非分為八分亦非共看一月思之思之能生諸緣謂依此自證及證自證能成見相二分也見分具於四緣謂親因緣等無間緣所緣緣增上緣相分具於二緣謂親因緣增上緣也緣所遺者謂此自證證自證分既舉體幻成見相二分則自體便成隱沒如舉麻之全體成繩則人但見其為繩不復以為麻矣然既舉自證而為見相則見相無非自證如舉麻為繩繩即是麻今正指此即見相之自證以為菩提涅槃元清淨體故曰緣所遺者而下文云此見及緣元是菩提妙淨明體亦與此處同也指第八識即大圓鏡智菩提元清淨體指第七識即平等性智菩提元清淨體指第六識即妙觀察智菩提元清淨體指前五識即成所作智菩提元清淨體此則四智菩提亦是本具不同相宗權說謂是生因所生也指徧計本空我法自性了不可得如繩上本無蛇性即圓淨涅槃元清淨體指依他如幻十界假名無量差別如麻可為繩即方便淨涅槃元清淨體指圓成本具法法全真如繩即是麻即性淨涅槃元清淨體所以二種根本不離一心悟見相惟自證譬如了繩即麻則是菩提涅槃迷見相為我法譬如於繩見蛇則成生死根本故曰遺此本明雖終日行而不自覺枉入諸趣此一經最要之關佛祖傳心之訣也舊解以攀緣心偏指六識必欲破除六識令盡則果中將何以為妙觀察智成所作智之體一可痛也以識精偏指第八必欲專用之以為體則是無量劫來生死本癡人認作本來人二可痛也況今文義本自彰灼而紛紛妄解誣罔經宗何為者乎。",
        "translation": "The preceding summary has explained that all sentient beings are born into the continuum of birth and death because they don't know the true nature of the eternally abiding mind, the pure and clear essence of the bodhisattva, and use deluded conceptions that are not true and therefore have transmigration.",
        "source": "X13n0285_001:0236a15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "二委示心體不同妄執四初重斥妄計非心二正示真心有體三委明分別無性四總斥從來誤執。",
        "translation": "Second, it shows that the mind's essence is different from deluded attachments.",
        "source": "X13n0285_001:0237a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, let's begin with this.",
        "source": "X13n0285_001:0237a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難汝今欲知奢摩他路願出生死今復問汝即時如來舉金色臂屈五輪指語阿難言汝今見不阿難言見佛言汝何所見阿難言我見如來舉臂屈指為光明拳曜我心目佛言汝將誰見阿難言我與大眾同將眼見佛告阿難汝今答我如來屈指為光明拳曜汝心目汝目可見以何為心當我拳曜阿難言如來現今徵心所在而我以心推窮尋逐即能推者我將為心佛言咄阿難此非汝心阿難矍然避座合掌起立白佛此非我心當名何等佛告阿難此是前塵虗妄相想惑汝真性由汝無始至於今生認賊為子失汝元常故受輪轉。",
        "translation": "Ānanda, now that you want to know the path of śamatha and wish to escape birth and death, I again ask you, does the Tathāgata lift his golden arm and bend his fingers over the five elements and tell Ānanda, \"Do you see it now?\" Ānanda said, \"Yes.\" Ānanda said, \"What do you see?\" Ānanda said, \"I see the Tathāgata lifting his arm and bending his finger in a bright fist to shine my mind and eyes.\" Ānanda said, \"Who will you see?\" Ānanda said, \"I'll see it with the eyes of the crowd.\" Buddha told Ānanda, \"Now, answer me this: 'The Tathāgata bending his finger in a bright fist to shine your mind and eyes.\" Ānanda said, \"Now, the Tathāgata is trying to find out where the mind is, and I'm pushing it out with my mind.",
        "source": "X13n0285_001:0237a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前塵虗妄相想正圓覺所謂六塵緣影是也六塵是識家相分今此但是六塵之影現於見分中者尚非識之見分況是自證證自證耶而誤認以為心非惟不是真心亦復不是妄心矣故直斥之曰此非汝心也若夫識之見分則靈明昭徹無體無相雖全在妄亦更無此影像可得故下文云含吐十虗寧有方所也是知阿難所計雖曰能推實則僅是所推影子決非真能推者以能推者實無體相可得故也後世不達即指此緣影以為六識其亦不知六識甚矣。",
        "translation": "These six dust particles are the formative elements of consciousness, but the shadows of the six dust particles that appear in the views are not yet the views of consciousness, how could they be self-authenticating and self-realizing?",
        "source": "X13n0285_001:0237a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正示真心有體。",
        "translation": "Second, it correctly shows that true mind has an essence.",
        "source": "X13n0285_001:0237b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言世尊我佛寵弟心愛佛故令我出家我心何獨供養如來乃至徧歷恒沙國土承事諸佛及善知識發大勇猛行諸一切難行法事皆用此心縱令謗法永退善根亦因此心若此發明不是心者我乃無心同諸土木離此覺知更無所有云何如來說此非心我實驚怖兼此大眾無不疑惑惟垂大悲開示未悟爾時世尊開示阿難及諸大眾欲令心入無生法忍於師子座摩阿難頂而告之言如來常說諸法所生唯心所現一切因果世界微塵因心成體阿難若諸世界一切所有其中乃至草葉縷結詰其根元咸有體性縱令虗空亦有名貌何況清淨妙淨明心性一切心而自(豈)無體(乎)。",
        "translation": "Ānanda said to the Buddha, \"Bhagavān, I am the Buddha's favorite disciple who loves the Buddha and therefore made me leave home. Why is my mind alone in making offerings to the Tathāgata and even in traveling to the lands of the sands, serving the buddhas and good teachers, having great courage, performing all the difficult tasks of the Dharma with this mind, even if I denigrate the Dharma and permanently retreat from my good roots, this is also the reason for my mind. If this invention isn't the mind, then I have no mind, just like earth and wood, and apart from this awakening there's nothing left.",
        "source": "X13n0285_001:0237b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此阿難疑心是無而如來答心有體也由其久執緣影故擘頭一奪番疑斷滅詎思只此怖斷滅者還可斷滅得否入無生法忍者入字約脩證言無生法約理性言忍字約地位言無生法性終始無殊約入約忍則始於名字終於究竟也此是第一番徹底顯性之文妙則中道法身淨則解脫俗諦明則般若真諦三德祕藏可謂和盤托出矣性一切心者猶云徧為一切心之本性。",
        "translation": "This Ananda's doubt that the mind is nonexistent and the Tathāgata's answer that the mind has a body is also due to his long-held conditioned images, which breaks his head and snatches away the doubts and extinguishes them.",
        "source": "X13n0285_001:0237b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三委明分別無性。",
        "translation": "The three commandments clarify that discrimination is devoid of nature.",
        "source": "X13n0285_001:0237b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若汝執恡分別覺觀所了知性必為心者此心即應離諸一切色香味觸諸塵事業別有全性如汝今者承聽我法此則因聲而有分別縱滅一切見聞覺知內守幽閑猶為法塵分別影事我非敕汝執為非心但汝於心微細揣摩若離前塵有分別性即真汝心若分別性離塵無體斯則前塵分別影事塵非常住若變滅時此心則同龜毛兔角則汝法身同於斷滅其誰修證無生法忍即時阿難與諸大眾默然自失。",
        "translation": "If you cling to the nature of discrimination, perception, and insight that are perceived must be mind, then this mind should be free of all form, odor, taste, tactile objects, and careers that have separate, entire natures.",
        "source": "X13n0285_001:0237b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兩番縱奪以明分別無自性也初十六字是總牒執恡者固執而不捨也所了知者意顯彼之所執緣影雖自以為是能了知實則但是所了知者非真能了知也此心即應至別有全性是初一番縱如汝今者至分別影事是初一番奪不惟聽法時之分別全因聲有縱令六根不緣外塵內守幽清閒曠境界仍是獨頭意識所緣內法塵境而已此則從未到定至非非想皆是法塵分別影事所攝今時闇證謬謂是本來面目空劫前事威音那畔向上鼻孔亦太癡矣次我非敕汝至即真汝心是第二番縱言我既不許汝謬計為心亦不敕汝執為非心以心外無法則此分別塵影亦是唯心所現因心成體之物故執為心是認賊為子執為非心是離波求水皆不可也若分別性下是第二番奪若決定執此為心則心反成斷滅而法界修證俱不可得矣此大眾所以不知下落而默然自失也。",
        "translation": "The first sixteen words summarize the lack of an essential nature of discrimination. The first is a general statement that clings to what's held and doesn't abandon it; what's known means to show that although he thinks he's able to know the conditioned images, the real thing is that what's known isn't really known. This mind should then come to have a distinct and complete nature, which is the first one that's taken away.",
        "source": "X13n0285_001:0237c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四總斥從來誤執。",
        "translation": "The fourth general refutation is the mistaken attachment from the beginning.",
        "source": "X13n0285_001:0237c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難世間一切諸修學人現前雖成九次第定不得漏盡或阿羅漢皆由執此生死妄想誤為真實是故汝今雖得多聞不成聖果。",
        "translation": "The Buddha told Ānanda that all the people in the world who train in the nine graduated concentrations might not attain the end of contamination or become arhats because they hold to this deluded notion of birth and death and mistake it for reality.",
        "source": "X13n0285_001:0238a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九次第定者四禪四空并滅受想定為第九也前之八定惟是有漏從有頂處遊觀無漏能令染末那相應之受想伏而不行故名滅受想定三果聖人能入此定亦名非學非無學定以其伏第七識俱生我執故名非學以出定時非非想天一分微細我愛猶存故名非無學也由此非非想愛未斷所以不得漏盡成阿羅漢而非非想愛亦即是此生死妄想而已又復應知生死妄想本無真實如繩本非蛇凡夫誤以為真實而堅執之故有三界分段生死如乞丐之喜以為蛇二乘誤以為真實而苦斷之故有出界變易生死如孩孺之怖以為蛇惟圓頓行人了達妄想無性則不生貪著不須斷除而狂心頓歇歇即菩提矣訶云不成聖果明知未證初果舊云證初果者謬也。",
        "translation": "The nine sequential concentrations are the ninth of the four meditations, the four emptiness concentrations, and the concentration of extinction of sensation and perception. The previous eight concentrations were only contaminated, and going from the top to the uncontaminated state caused the defiled manas associated with sensation and perception to subdue and not pass away. The third-fruition sage who enters this concentration is also called non-trained and non-academic because he subdues the coarse attachment to the seventh consciousness and is therefore called non-trained.",
        "source": "X13n0285_001:0238a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二別就見精顯性二初領旨哀請二正垂開示。",
        "translation": "Second, they separately discuss the essence of seeing and the nature of revealing. First, they comprehend the meaning and beg, and second, they correctly explain it.",
        "source": "X13n0285_001:0238a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, there was the first.",
        "source": "X13n0285_001:0238a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難聞已重復悲淚五體投地長跪合掌而白佛言自我從佛發心出家恃佛威神常自思惟無勞我修將謂如來惠我三昧不知身心本不相代失我本心雖身出家心不入道譬如窮子捨父逃逝今日乃知雖有多聞若不修行與不聞等如人說食終不能飽世尊我等今者二障所纏良由不知寂常心性惟願如來哀愍窮露發妙明心開我道眼。",
        "translation": "After hearing this, Ānanda again wept with pity, threw his five bodies to the ground, knelt down with his palms together, and said to the Buddha, \"Since I started out from the Buddha and left home, I've relied on the Buddha's authority and always thought to myself, 'It's no trouble for me to cultivate.' I would say that the Tathāgata honors my samādhi not knowing that body and mind are not originally one and the same, but I've lost my original mind even though I left home and my mind didn't enter the path. Like a poor son who leaves his father and flees, I realized today that even though I'm well-versed, if I don't cultivate it and don't hear it, I'm like a person who says food never fills us, Bhagavān.",
        "source": "X13n0285_001:0238a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子譬始覺父譬本覺迷本覺而起妄覺妄覺從本覺生義之如子只此妄覺就是始覺之性但以背覺合塵譬以捨父逃逝而枉受貧窮若能背塵合覺則客作賤人即長者真子矣二障者一煩惱障即是見思二所知障亦名智障即無明塵沙通而言之二皆可稱煩惱見思是界內煩惱無明塵沙是界外煩惱二皆可名智障見思障一切智塵沙障道種智無明障一切種智別而收之見思招感分段生死煩惱義強塵沙無明覆權實理障智義強也由其不知寂常心性所以妄被二障所纏若達心性寂常則二障亦本寂常矣故今但求顯發其本妙明心則道眼自開也。",
        "translation": "The son is a metaphor for the first awakening, the father is a metaphor for the first awakening, and deluded awakening arises from deluded awakening in the sense that the son's only deluded awakening is the nature of the first awakening.",
        "source": "X13n0285_001:0238b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正垂開示二初現瑞許說二正示見性。",
        "translation": "Second, he correctly presents and reveals two things. First, he shows and permits the explanation, and second, he correctly shows the nature of his views.",
        "source": "X13n0285_001:0238b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, there's the first.",
        "source": "X13n0285_001:0238b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時如來從胸卍字涌出寶光其光晃昱有百千色十方微塵普佛世界一時周徧徧灌十方所有寶剎諸如來頂旋至阿難及諸大眾告阿難言吾今為汝建大法幢亦令十方一切眾生獲妙微密性淨明心得清淨眼。",
        "translation": "Immediately, the Tathāgata's swastika in his chest welled up with a jeweled light that shone brightly with a hundred thousand colors and a hundred dust motes in ten directions, pervading the entire Buddha world at once and filling all the precious buddhas in ten directions with the Tathāgata's head, swirling around to Ānanda and the masses, he told Ānanda, \"Now, I've built a great dharma banner for you, and I'll also cause all sentient beings in ten directions to attain the pure insight of the marvelously subtle and dense nature of the mind and attain the pure eye.",
        "source": "X13n0285_001:0238b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從胸卍字涌出寶光者表示寂常心性本有光明也妙心真體雖不在內而內亦無所不在是故達法界之全體一塵者即一塵而全體法界故得光流無外非妄計之心可擬議也其光晃昱有百千色者表示一念心中具足百界千如實相真明也普佛世界一時周徧者表示此心本自豎窮橫徧也徧灌諸如來頂者表示諸佛所證頂法不過證此心體也旋至阿難及諸大眾者表示阿難大眾同具此心與十方諸佛元平等也妙微密性淨明心者不可思議故曰妙真妄同體故曰微始終一致故曰密垢不能染曰性淨暗不能昏曰性明此之心體雖復人人本有迷時不知名之為失從迷歸悟名之為獲得清淨眼者永離眚翳了了見佛性也由獲此心妙微密義則無明翳障本空佛眼清淨由獲此心性淨之義則塵沙翳障本空法眼清淨由獲此心性明之義則見思翳障本空慧眼清淨又獲此心妙微密義得知能障所障體是法界獲此心性淨之義二障圓消獲此心性明之義五眼圓發也。",
        "translation": "The emergence of a jeweled light from the swastika in his chest indicates that the true essence of the tranquil and eternal mind originally has light, and although the true essence of the marvelous mind isn't inside, there's nothing inside that isn't inside, so it reaches the entirety of the Dharma realm.",
        "source": "X13n0285_001:0238b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正示見性十初直指見性是心非眼二約客塵顯見性不動三約觀河顯見性無遷四約垂手顯見性無減五約標指顯見性無還六約周徧顯見性非物七約無是非是顯見性惟真八約外道世諦對簡顯見性非因緣自然九約二妄合明顯見性非見十破和合不和合餘疑顯見性離過絕非法爾現證問曰十番顯見創自交光今既極破其說何得承用答曰寂音合論謂如來示阿難真見文有九段已啟其端交光巧取用之幽溪亦以十義顯見正是公心不掩他長有何過咎然今十段仍與三家稍別讀者詳之。",
        "translation": "Second, it correctly shows that the nature of views is ten. First, it directly points out that the nature of views is mind and not eye. Second, it shows that the nature of views is immovable according to the objective dust. Third, it shows that the nature of views is not displaced according to the river of contemplation. Fourth, it shows that the nature of views is not diminished according to the dropping hand. Fifth, it shows that the nature of views is not returned according to the pointing finger. Six, it shows that the nature of views is not things according to the circumference. Seven, it shows that right and wrong are only true.",
        "source": "X13n0285_001:0238c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初中二初以拳例見定其常情二引例破執正顯見性。",
        "translation": "First, there are two cases in the beginning. First, we'll use the fist example to see the set of common sense, and second, we'll cite an example to refute attachment and correctly reveal the nature of views.",
        "source": "X13n0285_001:0238c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, there's the first.",
        "source": "X13n0285_001:0239a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難汝先答我見光明拳此拳光明因何所有云何成拳汝將誰見阿難言由佛全體閻浮檀金赩如寶山清淨所生故有光明我實眼觀五輪指端屈握示人故有拳相佛告阿難如來今日實言告汝諸有智者要以譬喻而得開悟阿難譬如我拳若無我手不成我拳若無汝眼不成汝見以汝眼根例我拳理其義均不阿難言唯然世尊既無我眼不成我見以我眼根例如來拳事義相類。",
        "translation": "Ānanda, you first answered, \"I see the luminous fist. What is the cause of this fist's luminosity? How did it become a fist? Who will you see?\" Ānanda said, \"It's because the whole body of the Buddha is filled with gold, gold, and jewels, like mountains of purity, that there's luminosity. I really see with my eyes and look at the five rings, and I bend my fingers and hold them at the ends to show people how my fists look.\" Buddha told Ānanda that the Tathāgata was speaking truly today.",
        "source": "X13n0285_001:0239a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閻浮檀樹名也或云無翻此方所無或翻勝金果汁入水沙石成金此金赩然有光以喻佛身光明清淨也。",
        "translation": "The name of the jambu tree also means nothing; it means nothing in this direction; or it means superior gold juice that's put into water, sand, and gravel that becomes gold, and this gold is resolutely luminous as a metaphor for the Buddha's body, which is luminous and pure.",
        "source": "X13n0285_001:0239a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二引例破執正顯見性。",
        "translation": "Second, he cites examples to dispel attachment and correctly reveal the nature of views.",
        "source": "X13n0285_001:0239a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝言相類是義不然何以故如無手人拳畢竟滅彼無眼者非見全無(猶云非全無見)所以者何汝試於途詢問盲人汝何所見從諸盲人必來答汝我今眼前惟見黑暗更無他矚以是義觀前塵自暗見何虧損阿難言諸盲眼前唯覩黑暗云何成見佛告阿難諸盲無眼惟觀黑暗與有眼人處於暗室二黑有別為無有別如是世尊此暗中人與彼羣盲二黑較量曾無有異阿難若無眼人全見前黑忽得眼光還於前塵見種種色名眼見者彼暗中人全見前黑忽獲燈光亦於前塵見種種色應名燈見若燈見者燈能有見自不名燈又則燈觀何關汝事是故當知燈能顯色如是見者是眼非燈眼能顯色如是見性是心非眼(此中三个前塵皆指浮塵眼根不指色塵)。",
        "translation": "The Buddha told Ānanda that what you say about similarities is not the case. Why is it that, like a man without hands whose fists are finally annihilated, a man without eyes doesn't see everything (as in not seeing everything)? So why is it that you try to ask blind people on the road what you see?",
        "source": "X13n0285_001:0239a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此直指見性以為真心也人妄謂見是肉眼心是緣影孰知肉眼決不能見緣影決不是心人謂眼在面上心在身中判然兩物孰知面上之眼非眼身中之心非心而真心真眼總惟一體哉故前七處破緣影之非心今此一文破肉眼之無見是妄計之心目總無所在也又今明見性即心則前明一切唯心亦可云一切唯見是一體之心目總無所不統也當知此中所指盲而不盲之見性即是下文無動搖無舒卷不皺不變妙明真精不可還不是物無舒縮無斷續無是非是非自然非因緣非見聞覺知非和合非不和合之見性業已徹底道破但因此性久墮依他境中當機不能徹底領會故須更加九番精辨而金沙始了然耳。",
        "translation": "This is a direct reference to the nature of views as true mind. People falsely believe that views are physical eyes and minds are cognitive images. Who knows that the physical eye can never see cognitive images and is never mind? People believe that the eye on the surface and the mind in the body are two separate things? Who knows that the eye on the surface is not the eye, the mind in the body is not the mind, and the true mind and true eye are always only one body? Therefore, the previous seven places destroy the cognitive images as not mind, and this one article destroys the view that the physical eye's lack of views is a deluded conception of the mind and eyes as always having no location? Now, it's clear that the nature of views is mind, so the previous statement that everything is only mind can also be clouded by the view that everything is only one mind and eyes as always having no place that isn't unified.",
        "source": "X13n0285_001:0239b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二約客塵顯見性不動二初默請二正示。",
        "translation": "Second, the view of the nature of immovability is revealed in terms of objective objects, first by silently requesting and second by directly showing.",
        "source": "X13n0285_001:0239b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, there's the first.",
        "source": "X13n0285_001:0239b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難雖復得聞是言與諸大眾口已默然心未開悟猶冀如來慈音宣示合掌清心佇佛悲誨。",
        "translation": "Even though Ānanda had heard those words again, the crowd and his mouth had remained silent, his mind hadn't yet been enlightened, and he was still hoping that the Tathāgata's compassionate voice would declare it and tell him to fold his palms and clear his mind in anticipation of the Buddha's compassionate teaching.",
        "source": "X13n0285_001:0239b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但聞見性是心尚自不知見性寂常妙明之義所以未悟此蓋但聽法音從語生解而不能直下返觀故也。",
        "translation": "He had only heard that seeing one's own nature was mind and didn't yet know the meaning of seeing one's own nature as quiescent, eternal, and perfectly clear.",
        "source": "X13n0285_001:0239b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正示三初徵名騐解二現相證成三結會責失。",
        "translation": "The second is to show three things: first, the names and the understanding, second, the manifestation and the completion, and third, the association and the reproach.",
        "source": "X13n0285_001:0239b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初又三初如來問二陳那答三如來印可。",
        "translation": "First, there are three more. First, the Tathāgata asks a question, second, Kauṇḍinya answers, and third, the Tathāgata approves.",
        "source": "X13n0285_001:0239b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "First, the Bhagavān asked.",
        "source": "X13n0285_001:0239b23_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊舒兜羅綿網相光手開五輪指誨勅阿難及諸大眾我初成道於鹿園中為阿若多五比丘等及汝四眾言一切眾生不成菩提及阿羅漢皆由客塵煩惱所誤汝等當時因何開悟今成聖果。",
        "translation": "It was then that the Bhagavān Shuoduolian mesh net shape light hand opened five wheel fingers instructed Ima Ānanda and the masses that I first became a buddha in the Deer Park for Ajñāta five monks and you four said that all sentient beings who don't attain enlightenment and arhatship are mistaken by the afflictions of guest dust what was the cause for your enlightenment then and what is the holy fruit now.",
        "source": "X13n0285_001:0239b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹿園地名即世尊初轉法輪處也阿若多此云解即佛為憍陳那所印之名也五比丘者一阿濕婆此云馬勝二跋提此云小賢二拘利亦云即摩訶男四憍陳那此云火器五十力迦葉此云飲光前三是佛父族後二是佛母族佛初出家時父王遣此五人侍衛佛先於雪山苦行三人畏苦行者即散去後受牧女乳糜之供二人樂苦行者復散去共在鹿園別修異道佛成道五七後方往度之三轉四諦法輪陳那最初得解故名阿若多等五比丘也客塵煩惱義關四教今言鹿園初唱似屬小乘實則圓音妙詮隨人異解況今借此以顯寂常斷斷不可偏屬三藏請略申之三界依正總名客塵即是苦諦煩惱即焦諦不為所誤即是道諦客塵煩惱永滅所顯涅槃名為主空即是滅諦此藏教義也客是主家之客塵是空中之塵何必滅客塵而後見主空但不為所誤則無煩惱此通教義也客塵無量同居方便實報依正皆名客塵煩惱無量見思塵沙無明皆名煩惱用無量道滅無量客塵煩惱方顯無量主空佛性此別教義也主是客人之主客是主人之客以客歸主則無客非主以主殉客則無主非客空是塵相之空塵是空中之塵隨緣不變則性塵真空不變隨緣則性空真塵此圓教義也今經雖借鹿園證成實惟為顯圓義試於九番一一審玩自得其旨此章以佛手開合為客阿難頭動為塵以見無舒卷動搖為主空然頭手是見家之頭手見性是頭手處之見性此無是非是之一徵也次章以自童至耄面皺為客髮白為塵以見性不皺不變為主空然非於生滅之外另有無生滅性而即此無生滅性又復舉體捨生趣生此無是非是之二徵也次章以色心諸緣及心所使諸所緣法乃至昏擾擾相為客塵以妙明真心譬如澄清百千大海者為主空然心外無法海外無漚此無是非是之三徵也次章以諸可還者為客塵無所還者為主空然由無所還之見性方見諸可還相亦非離於諸可還相之外另有不可還之見性可指此無是非是之四徵也次章以物類差別為客見性無殊為主大小內外為塵見無舒縮為空然因差別方顯無差因於無差方見差別又空體本無方圓方圓不離空體此無是非是之五徵也次章以見與見緣并所想相為客塵以菩提妙淨明體為主空方乃直唱無是非是之言以顯前來五番并初番直指見性是心無非明此菩提妙淨明體也次章以因緣自然不因緣不自然皆為客塵以無非不非無是非是離一切相即一切法為主空又次章以明暗塞空見聞覺知俱為客塵以見不能及者為主空又次章以和合不和合俱為客塵以非和合非不和合而為主空見性既爾法法皆然然後徧歷陰入處界會歸藏性當知但是廣略之殊而主空之性更無二也以生滅去來為客為塵以常住妙明不動周圓為主為空從始至終無非圓頓更不可作前淺後深解釋誣罔經宗願讀經者思之擇之由不達三界依正唯是客塵誤起見思煩惱所以不成阿羅漢果由不達實報方便依正亦是客塵誤起無明塵沙煩惱所以不成無上菩提問曰舊皆以客塵喻見思今何以喻依正答曰依正是依他起性可喻客塵見思是徧計執性毫無自體可得非可以客塵喻也且見思則須斷盡方證涅槃客塵豈須斷盡方顯主空耶。",
        "translation": "The Deer Park is called the place where the Bhagavān first turned the wheel of the Dharma. Ajñāta, which is the word for understanding, is the name given by the Buddha to Vairocana. The five monks are Aśva, which is called Mañjuśrī, which is called Bhadrika, which is called Little Bhagavān, Kauṇḍinya, which is called Mahānāman, which is called Mahānāman, which is called Vairocana, which is called Fire-vessel, and Fifty Mighty Kāśyapa, which is called Drinking Light.",
        "source": "X13n0285_001:0239c04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "二陳那答。",
        "translation": "Second, Kauṇḍinya answered.",
        "source": "X13n0285_001:0240b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時憍陳那起立白佛我今長老於大眾中獨得解名因悟客塵二字成果世尊譬如行客投寄旅亭或宿或食宿食事畢俶裝前途不遑安住若實主人自無攸往如是思惟不住名客住名主人以不住者名為客義又如新霽清晹升天光入隙中發明空中諸有塵相塵質搖動虗空寂然如是思惟澄寂名空搖動名塵以搖動者名義塵義。",
        "translation": "Kauṇḍinya then rose and said to the Buddha, \"Now, I, the elder, am alone among the masses in understanding the name because of the awakening of the two words 'guest' and 'dust'. \"The Bhagavān is like a traveling guest who puts up at a travel pavilion, stays overnight or takes food, finishes his meal, prepares for his future, and doesn't have time to settle down.",
        "source": "X13n0285_001:0240b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三界之中無一法能停住無一法不搖動皆客塵也悟其為客為塵故不起煩惱而成聖果阿難一向妄執緣影為心正是迷客塵而起煩惱耳。",
        "translation": "There's not a single thing in the three realms that stands still, and there's not a single thing that doesn't oscillate. All of them are objective dust, and their realization that they are objective and dust causes them not to become afflicted and achieve the noble fruit.",
        "source": "X13n0285_001:0240b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三如來印可。",
        "translation": "Third, the Tathāgata approves of it.",
        "source": "X13n0285_001:0240b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言如是。",
        "translation": "The Buddha said it was so.",
        "source": "X13n0285_001:0240c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "只此一喻四教俱通所以印成之也。",
        "translation": "This is the only one metaphor that's shared by all four teachings, so it's sealed.",
        "source": "X13n0285_001:0240c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二現相證成又二初開合寶掌證成客與主義二飛光動頭證成塵與空義。",
        "translation": "Second, there are two ways to realize the manifestation: first, opening and closing the jeweled palms to realize the meaning of object and doctrine; and second, flying lights moving the head to realize the meaning of dust and emptiness.",
        "source": "X13n0285_001:0240c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0240c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時如來於大眾中屈五輪指屈已復開開已又屈謂阿難言汝今何見阿難言我見如來百寶輪掌眾中開合佛告阿難汝見我手眾中開合為是我手有開有合為復汝見有開有合阿難言世尊寶手眾中開合我見如來手自開合非我見性有開有合佛言誰動誰靜阿難言佛手不住而我見性尚無有靜誰為無住佛言如是。",
        "translation": "The Tathāgata immediately flexed his five fingers in the crowd, and after flexing and opening them again, he flexed them again and said to Ānanda, \"What do you see now?\" Ānanda said, \"I see the Tathāgata's hand opening and closing in a multitude of hundred-jeweled palms.\" Buddha told Ānanda, \"Do you see my hand opening and closing in a multitude of hands?",
        "source": "X13n0285_001:0240c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對不住方有住名見性既無不住又豈有住住即靜也住與不住雙遣方是主義故佛隨印許之。",
        "translation": "Only when there's no non-abiding is there abiding called seeing nature, and since there's no non-abiding, how could there be abiding? Abiding is stillness, and only when abiding and non-abiding are both rejected is it true. Therefore, the Buddha approves it with his seal.",
        "source": "X13n0285_001:0240c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二飛光動頭證成塵與空義。",
        "translation": "The two flying lights move their heads to realize the meaning of dust and emptiness.",
        "source": "X13n0285_001:0240c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來於是從輪掌中飛一寶光在阿難右即時阿難迴首右盻又放一光在阿難左阿難又則迴首右盻佛告阿難汝頭今日因何搖動阿難言我見如來出妙寶光來我左右故左右觀頭自搖動阿難汝盻佛光左右動頭為汝頭動為復見動世尊我頭自動而我見性尚無有止誰為搖動佛言如是。",
        "translation": "The Tathāgata then flew a precious light from the palm of his wheel to Ānanda's right.",
        "source": "X13n0285_001:0240c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對動說止見既無動又豈有止動止雙遣方是空義故佛亦印許之。",
        "translation": "He spoke of stopping in response to motion. How could there be stopping when there's no motion and stopping when both motion and stop are rejected as the meaning of emptiness?",
        "source": "X13n0285_001:0240c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三結會責失二初結會二責失。",
        "translation": "The three concluding assemblies rebuked the mistake, the first concluding assembly, and the second rebuking the mistake.",
        "source": "X13n0285_001:0240c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今初。",
        "translation": "The first is this.",
        "source": "X13n0285_001:0240c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是如來普告大眾若復眾生以搖動者名之為塵以不住者名之為客汝觀阿難頭自動搖見無所動又汝觀我手自開合見無舒卷。",
        "translation": "The Tathāgata then universally addressed the crowd, \"If another sentient being were to shake his head and call it dust and stop and call it guest, you would observe Ānanda's head automatically shaking and see nothing moving, and you would observe my hands opening and closing on their own and see nothing stretching and rolling.",
        "source": "X13n0285_001:0241a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂眾生若能以一切搖動者皆名為塵以一切不住者皆名為客如頭之動搖塵也見無所動空也手之開合客也見無舒卷主也則不被客塵所誤不起種種煩惱而菩提羅漢皆可成矣問曰此經云頭自動搖見無所動手自開合見無舒卷乃六祖則云不是風動不是幡動仁者心動如何會通答曰此經云見無舒卷動搖者直指真心不墮妄境所謂離一切相為阿難疑心是無而言之也祖云風幡只是心動者直指萬境不離一心所謂即一切法為二僧執境是有而言之也由真心不墮妄境故下文如來藏一切俱非之義善成由萬境不離一心故下文如來藏一切俱即之義善成雖有二義藏性體一惟其離一切相方能即一切法惟其即一切法所以離一切相若達此離即離非是即非即之體依悉檀說則二俱妙藥若不達理體偏執二說則二俱有過矣。",
        "translation": "If sentient beings can name everything that shakes as dust and everything that doesn't stay as an object, then they can be unmistaken by objects and dusts, see nothing moving, open and close their hands, and objects, see nothing scrolling, then they won't be mistaken by objects and dusts, won't have all kinds of afflictions, and the bodhisattva arhat can be realized.",
        "source": "X13n0285_001:0241a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二責失。",
        "translation": "Second, he blames them for their errors.",
        "source": "X13n0285_001:0241a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何汝今以動為身以動為境從始洎終念念生滅遺失真性顛倒行事性心失真認物為己輪迴是中自取流轉。",
        "translation": "How have you now taken motion as body and motion as object from the beginning until the end, mindfully producing and ceasing, losing your true nature, acting mistakenly, losing your true nature, and recognizing things as yourself in the cycle of self-taking and transmigration?",
        "source": "X13n0285_001:0241a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂一切動搖不住之物皆是客塵原非實身實境奈何以動為實有之身以動為實有之境而從始洎終念念隨其生滅遺失如空如主之真性一味顛倒行事辨體性於自心既失其真反認客塵外物以為自己所以於本無輪迴心性之中妄見輪迴乃是自取流轉更無他因也。",
        "translation": "It means that all things that move and don't budge are just objects that are not really bodies or objects, so why is it that you take the body that moves as really existent and the object that moves as really existent, and then from beginning to end, you mindfully follow its arising and ceasing and lose its true nature like emptiness and lordship, and you simply mistakenly act and discern its essence.",
        "source": "X13n0285_001:0241a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經卷第一文句",
        "translation": "Śūraṃgama-sūtra, Volume 1, Verse 1, of the Tathāgata's Secret Cause, Cultivation, and Perfection of Meaning",
        "source": "X13n0285_001:0241b05_0",
        "is_bad_quality": false
    }
]