[
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經截流卷之下天台後學沙門　傳如　述今文躡前密因以起萬行所謂全性起修始為究竟堅固必須起行者若秪譚名理不策修證縱得妙悟但成狂慧故指菩提涅槃之尚遠責多聞薰習之無功阿難領藏心全體喻之如屋求所入之門世尊指常心圓根名決定二義為創修之要然二義汎明全體謂之慧覺圓通諸門獨選耳根始是最初方便至示攝心軌則安立道場通為修道分今第一義門令審因地不生滅心而示之以可作之法皆從變滅見聞覺知五疊渾濁者葢不知其滅無以復常不知其濁無以旋湛故令先擇生死根本依不生滅圓湛性成以湛旋其虗妄滅生復還元覺得圓明覺無生滅性為因地心然後圓成果地修證言不生滅心者即初卷所謂常住真心性淨明體也此之心體既以喻之屋矣而復答其所請之門者葢此一念發覺之心諸惑由是而伏斷果位由是而超入故得為門耳今第二義門令擇不生滅根乃先審煩惱根本者猶不知其結欲解弗能也識能致塵重喻賊媒降伏即前發兵討除之意斥六為賊媒無始纏縛隨舉世為遷流界為方位者將明流變三疊顯凡夫現量功德密啟即結是解庶可進修也言上下無位中無定方者此拂六存四以明流變三疊成千二百之數也如器內有的方之體始有四角之隅中無定方則四隅無寄矣流變三疊一十百千者初以三世四方宛轉相涉數成十二自十變百百變千本乎十二故成千二百也葢眾生不離世界故佛權依世數用顯六根功德之量耳汝復於中克定優劣至汝今欲逆生死欲流當驗此等六受用根誰合誰離等者此顯六根優劣令擇圓根為發行之由也性循生死決之而出曰欲流性合涅槃旋元自歸曰法流聖凡雖異流體不別故得於凡夫之根通稱六湛圓明阿難言云何深入一門能令六根一時清淨問含二疑葢既稱六湛圓明不可謂逆流深入然後稱淨其疑一也若必欲逆流而後稱淨則此六根織妄相背又不可謂一入六淨其疑二也言汝今已滅三界眾生世間見所斷惑然猶未知根中積生無始虗習何況此中生住異滅分齊頭數者此釋初疑由其有如是濁惑務須逆流深入然後為淨也言今汝且觀現前六根為一為六至辯非一非六者此釋次疑由其一六俱非故得一入六淨也更觀太虗元非同異則玅心豈定一多由粘湛以奔逸是為濁流不循塵而伏歸遂發明耀故有證性不因六根可諭合眼猶能一辯達聲銷而聞恒在形寐而性不昏如是則斷滅之慮洒然七常住果復何疑。",
        "translation": "The Bhagavān pointed out that the whole body of the eternal mind and the perfect faculties are called the two essentials of creation and cultivation, but these two essentials are generally explained in the whole body, which is called the wisdom, awareness, and the perfect penetration of the gates.",
        "source": "X14n0296_002:0679a15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "五卷",
        "translation": "Five Fascicles",
        "source": "X14n0296_002:0679c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難詢第二義結解之元世尊摩頂佛光灌頂者表諸佛之道皆悉無上今將開示也六種震動者將解六結瑞兆也諸佛告以安樂妙常輪轉生死皆由六根更非他物者葢離結無解故也言根塵同源縛脫無二者由塵發知則知本是幻因根有相則塵本是幻二種皆空故喻交蘆是得同源是得無二也根境既空識本不有故曰識性虗妄猶如空花如是則本無知見而知見立即無明本了無知見而知見亡斯即涅槃涅槃之體一切圓滿絕待故曰無漏真淨云何是中更容他物偈云真性者即涅槃之體也此體不同有為之空故曰真性有為空緣生故如幻者釋成空義也此體亦不同無為之無起滅故曰無為無起滅不實如空花者釋成無起滅也若以有為為妄無為為真是為言妄顯諸真妄真同二妄斯不得謂之無漏真淨之性今真妄雙遣故曰猶非真非真知無為之真尚遣況有為之妄乎故曰云何見所見見即根所見即塵根塵兩立而中虗故喻之以交蘆識居二者之間是曰交中性根塵兩非識體何在聖人了此是為解凡夫昧此是為結故曰解結同所因聖凡無二路也汝觀交中性者舉喻重令審詳也知交中之性未甞因交而始有不交而後空故曰空有二俱非言迷晦即無明發明便解脫者結成聖凡無二路即知見立知等意也言解結因次第六解一亦亡者即應前一入六淨之義根選入圓通入流成正覺者應前誰為圓通及逆生死欲流之義欲流逆歸便合妙湛故成正覺如觀音因入流相成就菩提也偈指流之所自故云陀那微細識習氣成瀑流陀那此云執持即賴耶所變之初相也由賴耶受薰而起故曰習氣念念代謝其相甚微故曰瀑流後文云由生滅等於妙圓中粘湛發知浮根四塵流逸奔法者本此或疑浮根奔逸其相甚粗焉稱微細經云本自一精明分為六和合葢從妙圓粘湛發流但舉六識而八識斯在矣此之識體言真則外道計為神我言妄則凡夫無從進修故言真非真恐迷我常不開演也世間依正全性轉變本無能所而強生計別是為自心取自心非幻成幻法此頌知見立知即無明本也不取無非幻非幻尚不生幻法云何立此頌知見無見斯即涅槃也蓮華處染而常淨華果以同時經譚結解同所因聖凡無二路故名妙蓮華金剛為堅利之寶諸物莫攖其鋒今經真妄悉破故名金剛王寶覺昔也由迷而結是為生死垢濁今也由悟而解是為涅槃真淨迷悟轉變本於無住故名如幻三摩提能一達此則惑盡而真亦窮故得彈指超無學如是無上之法諸聖莫不由斯故曰此阿毗達磨十方薄伽梵一路涅槃門阿難既曰祇夜伽陀雜糅精瑩偈及長行固多出入耳阿難已知解結之因而復欲知六解一亡舒結倫次佛取劫波羅巾挽結詳問者令審一巾無異妄起六結倫次也初綰結成名為第一此倫次之相已定也吾今能將第六結名成第一否者令知倫次不可亂名則知六根不相為用故合法云畢竟同中成畢竟異汝必嫌此六結不成者嫌前一不成六也既嫌乎彼必樂乎此故曰願樂一成一成者一以成六也對前不成故曰復云何得此結若存是非蜂起而彼此相非者如前不可亂名也欲無彼此莫如解除故言若總解除則無彼此以彼此俱無故言尚不名一六云何成此正答願樂一成之問也尚不名一即一亡六云何成即六解故曰亦復如是言一切世間生死涅槃皆即狂勞顛倒花相者妙淨體中不獨計有為生死之為結計無為涅槃亦即是結也後文云將欲復真欲真已非真真如性者此爾解結當於結心者真妄兩亡中道觀智也我說佛法下此杜阿難之情計使知因根修證也杜計者前云解結因次第又云解結同所因是則因迷而結緣悟而解恐阿難計為世間之因緣故曰我說佛法從因緣生非取世間和合粗相佛法者佛種之法眾生計世間因緣是為凡夫之法今因入流而成正覺是為出世佛法惟得此法故於世出世法知其本因隨所緣出如是故應選擇六根一門深入而銷諸妄也已言此根初解先得人空者由逆欲流之功見思虗習於是銷落故曰人空見思雖落塵沙尚存是為法執進破此惑故曰空性圓明成法解脫塵沙雖亡尚須中觀對破無明無明若盡觀智亦亡故曰解脫法已俱空不生從三摩地得無生忍者即以如幻三昧照破三惑而真常之體於是頓顯即無得而得也既稱妙三摩地此似次第者未達三觀一體則圓亦歷別了無一三用在一時矣阿難大眾已知六解一亡故言慧覺圓通得無疑惑未示一門深入故言然猶未達圓通本根所得密言還同本悟則與未聞無有差別者慧覺雖明了無實證故須別求祕嚴乃可造修也祕嚴即隱密義阿難將謂別有祕嚴故退藏密機冀以冥授然不了前之所示根根塵塵無隱乎爾故世尊普告大眾詢以最初發心悟十八界誰為圓通從何方便入三摩地經自陳那至迦葉悟六塵次那律至空生悟六根自鶖子至目連悟六識自烏蒭瑟摩至大勢至悟七大當知諸聖之所陳陳如來之所宣如來之所宣宣諸聖之所證若別有秘嚴可授非一路涅槃門矣至下觀音所證未越乎此為施對冶悉檀故廣演勝妙之相非諸聖之所不能耳。",
        "translation": "阿難詢第二義結解之元世尊摩頂佛光灌頂者表諸佛之道皆悉無上今將開示也六種震動者將解六結瑞兆也諸佛告以安樂妙常輪轉生死皆由六根更非他物者葢離結無解故也言根塵同源縛脫無二者由塵發知則知本是幻因根有相則塵本是幻二種皆空故喻交蘆是得同源是得無二也根境既空識本不有故曰識性虗妄猶如空花如是則本無知見而知見立即無明本了無知見而知見亡斯即涅槃涅槃之體一切圓滿絕待故曰無漏真淨云何是中更容他物偈云真性者即涅槃之體也此體不同有為之空故曰真性有為空緣生故如幻者釋成空義也此體亦不同無為之無起滅故曰無為無起滅不實如空花者釋成無起滅也若以有為為妄無為為真是為言妄顯諸真妄真同二妄斯不得謂之無漏真淨之性今真妄雙遣故曰猶非真非真知無為之真尚遣況有為之妄乎故曰云何見所見見即根所見即塵根塵兩立而中虗故喻之以交蘆識居二者之間是曰交中性根塵兩非識體何在聖人了此是為解凡夫昧此是為結故曰解結同所因聖凡無二路也汝觀交中性者舉喻重令審詳也知交中之性未甞因交而始有不交而後空故曰空有二俱非言迷晦即無明發明便解脫者結成聖凡無二路即知見立知等意也言解結因次第六解一亦亡者即應前一入六淨之義根選入圓通入流成正覺者應前誰為圓通及逆生死欲流之義欲流逆歸便合妙湛故成正覺如觀音因入流相成就菩提也偈指流之所自故云陀那微細識習氣成瀑流陀那此云執持即賴耶所變之初相也由賴耶受薰而起故曰習氣念念代謝其相甚微故曰瀑流後文云由生滅等於妙圓中粘湛發知浮根四塵流逸奔法者本此或疑浮根奔逸其相甚粗焉稱微細經云本自一精明分為六和合葢從妙圓粘湛發流但舉六識而八識斯在矣此之識體言真則外道計為神我言妄則凡夫無從進修故言真非真恐迷我常不開演也世間依正全性轉變本無能所而強生計別是為自心取自心非幻成幻法此頌知見立知即無明本也不取無非幻非幻尚不生幻法云何立此頌知見無見斯即涅槃也蓮華處染而常淨華果以同時經譚結解同所因聖凡無二路故名妙蓮華金剛為堅利之寶諸物莫攖其鋒今經真妄悉破故名金剛王寶覺昔也由迷而結是為生死垢濁今也由悟而解是為涅槃真淨迷悟轉變本於無住故名如幻三摩提能一達此則惑盡而真亦窮故得彈指超無學如是無上之法諸聖莫不由斯故曰此阿毗達磨十方薄伽梵一路涅槃門阿難既曰祇夜伽陀雜糅精瑩偈及長行固多出入耳阿難已知解結之因而復欲知六解一亡舒結倫次佛取劫波羅巾挽結詳問者令審一巾無異妄起六結倫次也初綰結成名為第一此倫次之相已定也吾今能將第六結名成第一否者令知倫次不可亂名則知六根不相為用故合法云畢竟同中成畢竟異汝必嫌此六結不成者嫌前一不成六也既嫌乎彼必樂乎此故曰願樂一成一成者一以成六也對前不成故曰復云何得此結若存是非蜂起而彼此相非者如前不可亂名也欲無彼此莫如解除故言若總解除則無彼此以彼此俱無故言尚不名一六云何成此正答願樂一成之問也尚不名一即一亡六云何成即六解故曰亦復如是言一切世間生死涅槃皆即狂勞顛倒花相者妙淨體中不獨計有為生死之為結計無為涅槃亦即是結也後文云將欲復真欲真已非真真如性者此爾解結當於結心者真妄兩亡中道觀智也我說佛法下此杜阿難之情計使知因根修證也杜計者前云解結因次第又云解結同所因是則因迷而結緣悟而解恐阿難計為世間之因緣故曰我說佛法從因緣生非取世間和合粗相佛法者佛種之法眾生計世間因緣是為凡夫之法今因入流而成正覺是為出世佛法惟得此法故於世出世法知其本因隨所緣出如是故應選擇六根一門深入而銷諸妄也已言此根初解先得人空者由逆欲流之功見思虗習於是銷落故曰人空見思雖落塵沙尚存是為法執進破此惑故曰空性圓明成法解脫塵沙雖亡尚須中觀對破無明無明若盡觀智亦亡故曰解脫法已俱空不生從三摩地得無生忍者即以如幻三昧照破三惑而真常之體於是頓顯即無得而得也既稱妙三摩地此似次第者未達三觀一體則圓亦歷別了無一三用在一時矣阿難大眾已知六解一亡故言慧覺圓通得無疑惑未示一門深入故言然猶未達圓通本根所得密言還同本悟則與未聞無有差別者慧覺雖明了無實證故須別求祕嚴乃可造修也祕嚴即隱密義阿難將謂別有祕嚴故退藏密機冀以冥授然不了前之所示根根塵塵無隱乎爾故世尊普告大眾詢以最初發心悟十八界誰為圓通從何方便入三摩地經自陳那至迦葉悟六塵次那律至空生悟六根自鶖子至目連悟六識自烏蒭瑟摩至大勢至悟七大當知諸聖之所陳陳如來之所宣如來之所宣宣諸聖之所證若別有秘嚴可授非一路涅槃門矣至下觀音所證未越乎此為施對冶悉檀故廣演勝妙之相非諸聖之所不能耳。",
        "source": "X14n0296_002:0679c14_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "六卷",
        "translation": "Six Fascicles",
        "source": "X14n0296_002:0681a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀音將陳所證追敘於無量恒沙劫前之事者密顯性本圓通且真常也有佛出世名觀世音者所師為圓通之師師資名同古今一道也觀即如幻金剛觀察世音謂十界音聲惟音可觀乃謂圓通從聞思修入三摩地者稟師之教諦審損益故得證入也當機固稱多聞曾未及此特以是啟之初於聞中入流亡所者凡夫耳根發識為聞聞識奔境為流今觀音觀聽反入故曰入流能滅音圓聞故曰亡所上所指聲塵下所指入流以流內伏外塵自銷故曰所入即寂動靜二相了然不生如是漸增聞所聞盡者以獲妙妙聞心心精遺聞故得曰盡即前云此根初解先得人空也覺有盡聞之盡是亦不盡故曰盡聞不住覺所覺空即空性圓明成法解脫也空覺極圓空所空滅者即空覺之空亦空所謂俱空不生也生滅者外塵內根及以識心諸有惑業皆名生滅之法今悉空空故曰既滅以既滅則不復更滅故曰寂滅彌滅彌顯是曰現前彌超彌同故上合十方諸佛本妙覺心與佛如來同一慈力以三十二應入諸國土下合十方一切六道眾生與諸眾生同一悲仰施十四無畏福被眾生及現眾多玅容能說無邊神呪斯皆亡所遺聞朗徹廓照所致結云佛問圓通我從圓照三昧緣心自在因入流相得三摩地成就菩提斯為第一或疑三十二應菩薩却現佛身十四無畏沈迷即離苦惱身心含廣莫之法界作用現眾多之手眼皆為表法曾無實證噫斯非自生障礙蔑彼圓通者耶當知觀音為正法明如來何獨泥對揚之跡眾生能感應道交奚難離幻妄之苦俛仰再撫於四海且為緣慮之知身心互徧於十方始是遺聞之玅魚之成龍頭角遂異人之登聖手眼固神毋自望洋拘墟請事入流亡所仍藉大悲光耀一示本來面目始信聖言聖證未之或欺也然諸聖既陳圓通而釋尊五體放光遠灌微塵如來微塵如來亦於五體同放寶光來灌佛頂者葢表淨極光通極果所同也彼界此土菩薩羅漢光亦灌頂者表因果互融所陳所證一一無上也林木池沼皆演法音寶光相羅如寶絲網者信山河大地無非如來藏無非妙莊嚴也斯為希有之瑞故令一切普獲金剛三昧金剛喻斷惑之速獲即初住真因之位也以踐正位故天亦以諸瑞應之真因智中十界圓彰則成百界故天雨百寶蓮花青黃赤白間雜紛糅者住行向地或超或次遞遞涉入也十方虗空成七寶色者從寂滅體中克七常住果也入圓通常門習漏永除依正不隔是故娑婆山河俱時不現微塵國土合成一界也梵唄歌咏自然敷奏者表證入之人無作法音皆如是也圓通法門止此於是佛告文殊師利汝今觀此諸大菩薩及阿羅漢各說最初成道方便彼等修行實無優劣前後差別者聖性無不通也以無不通故感諸瑞如此我今欲令阿難開悟二十五行誰當其根兼我滅度此界眾生入菩薩乘何方便門得易成就文殊奉勑唯擇耳根者所謂偏為當機也偈稱覺海性澄圓圓澄覺元妙者即前所云性覺妙明本覺明玅是也將擇圓通之根先標圓通之體著一海字便見入流之意下云旋流獲無妄葢本於此元明照生所者元明本妙覺明也從元明而妄發所照故曰所立所照既立真性遂晦故曰照性亡照性者起照之真性也迷妄有虗空因空立世界者即晦昧為空空晦暗中結暗為色也想澄成國土知覺乃眾生者即色雜妄想想相為身也葢一因所妄依正斯分則澄妙之體莫得而圓莫得而通即一迷為身決定惑為色身之內也空生大覺中如海一漚發漚滅空本無況復諸三有者此明覺體本周一不循塵圓通之體本無涯量故淨極光通達寂照含虗空行人得此諸境咸妙故却求觀世間猶如夢中事將聞持佛佛何不自聞聞者佛佛者諸佛所談覺性也此之覺體即吾真聞不能聞聞何知佛佛故策云大眾及阿難旋汝倒聞機反聞聞自性阿難大眾聞是開示觀佛菩提及大涅槃如遠遊人未得歸還明了其家所歸道路者前示慧學圓通及辯圓通本根但明起行之由故曰知路而已若欲還家必須俶裝故請攝心軌則安立道場至示五十五位真菩提路正明萬行修證也戒定慧三通稱無漏者葢眾生覺海本自圓澄以粘湛發識流逸奔境名漏今依清淨律儀制止身心內瑩發光三摩正定圓通妙慧皆具於此佛以婬殺盜妄一一宣其重過劇稱決定明誨復言不如此說即波旬說者葢此戒相本是易知易解之法為難受難持之行輪迴苦本安樂妙常莫不由斯觀佛諄諄切切寧弗愧死懼死。",
        "translation": "Avalokitêśvara will present what has been realized and trace the events leading up to the end of an infinite number of eons, which is a mysterious manifestation of the nature of the original perfection and true eternity.",
        "source": "X14n0296_002:0681a07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "七卷",
        "translation": "Seven Fascicles",
        "source": "X14n0296_002:0682a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "廣明菩薩行相令持四種律儀皎如氷霜自不能生一切枝葉者葢萬行雖多此為根本今人果能不緣色香味觸魔事自銷奈何宿習所牽朝則心齊於諸佛莫則行歉乎下凡聞見愈多惑業愈熾非假神呪之功畢竟無由解脫今明建壇誦呪能克聖果者化佛為不思議佛呪為不思議法壇為不思議境淨戒諸侶為不思議人同如是人發如是心入如是境行如是法獲如是果決定無疑呪有勝益故天龍八部一切鬼神發願擁護受持之者得無魔事末世捨呪心而談楞嚴者徒益多聞耳行者勉之以上理行既備若不開聖位其何以顯證果之相初卷云心言直故如是乃至終始地位中間永無諸委曲相今須詳明是故請云云何名為乾慧之地四十四心至何漸次得修行目詣何方所名入地中云何名為等覺菩薩然問辭列漸次於諸位之中葢先令知三漸次以通含諸位故也佛將示諸聖位次先示眾生世界二顛倒因者性顛倒故轉菩提為煩惱則成十二類生性不顛倒轉生死為涅槃則成六十聖位此為迷悟之源不可不辯指要而言性明元心瞥起妄明能覆所覆皆為無住本此無住建立世界及諸眾生若了無住則知妄本無依真亦不有一欲復真斯為顛倒之本而十二類生肇焉是故世界因動有聲至六亂妄想成業性故十二區分由此輪轉者此明依正妄織為十二類生生起之本也是故世間聲香味觸窮十二變為一旋復者重結依報之中三世四方和合相涉能變有情成十二之數也色聲香味為能變即世界之本世界宛轉相涉為十二數旋復即宛轉義下云乘是輪轉顛倒相故是有世間卵生等如是則不可以窮十二變之能變為所變耳十二類生各各具十二顛倒者以同一理性彼彼互具也天台所明現起之一名事造餘冥伏者為理具具無所具全一覺體若以六即收之所謂理即事也由生類即佛故可進修一聞理即便為名字今三漸次中自除其助因刳其正性此屬觀行相似二即文自父母肉身不須天眼自然觀見十方至宿命清淨得無艱險此屬相似即第三違其現業是又躡前觀行相似二位進明分證耳文云反流全一六用不行者即圓伏五住同前觀行位也十方國土皎然清淨至一切如來密圓淨妙皆現其中者此見思先斷同前相似位也是人即獲無生法忍者此從十信超入初住無明初破為分證位也從是漸修安立聖位指分證位中當位昇進之相非直接乾慧之位也以乾慧之文合前者欲愛乾枯根境不偶同前反流全一六用不行之義執心虗明純是智慧慧性圓明瑩十方界同前十方國土皎然清淨等義若作未破見思即屬觀行將成之相若作見思已破即同十信位中相似之相今乾慧既居十信之前當直作觀行位釋然十卷有云從互用中能入菩薩金剛乾慧乃至云如是乃超十信十住等者斯是經文錯綜非謂六根互用始入信前乾慧耳此後信住行向乃至等覺諸位無不屬此金剛觀察之觀故後文云至等覺已是覺始獲金剛心中初乾慧地不言妙覺之中獲者圓滿菩提歸無所得故也今自乾慧至妙覺重以六即定之者乾慧以前凡夫本具聖位是理即從此得聞為名字即乾慧為觀行即十信為相似即十信至等覺為分證即妙覺為究竟即也經始自乾慧終至妙覺為單複十二者逐位別開為單每位具十曰複故十信十住十行十向十地為五複乾慧煖頂忍世第一等妙為七單以單七複五數為十二解如長水經云是種種地皆以金剛觀察十種深喻奢摩他中用諸毗婆舍那清淨修證漸次深入觀察乃心之異名也更詳皆以二字亦應曰至等覺已是覺始獲金剛心中初信二信乃至十地今云是覺始獲金剛心中初乾慧地者猶云發心究竟二不別非等覺心中別有一乾慧也華嚴明善財童子始謁文殊終會文殊者旨不異此又云漸次深入則知漸次通貫諸位不可以三漸次直接乾慧地也如是皆以三增進故善能成就五十五位真菩提路者以諸位之中遞遞增進由觀行之相似由相似之分證由分證之究竟又非截三漸次居乾慧之前耳單七複五共五十七位今云五十位真菩提路者乾慧非真妙覺非路止五十五解如吳興。",
        "translation": "Although there are many myriad practices, this is the root of them all. Now, if a person can avoid the demonic activities of form, fragrance, and contact, then he will be able to extinguish them on his own, but if he's led by past habits, then his mind will be aligned with the buddhas, and his practice will be incomprehensible to lower worldlings.",
        "source": "X14n0296_002:0682a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "八卷",
        "translation": "Eight Fascicles",
        "source": "X14n0296_002:0683a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明五種經題謂之結經分者前開理解修證文義浩博必須結撮綱要乃便記憶故文殊師利言當何名此經我及眾生云何受持是經名大佛頂悉怛多般怛囉無上寶印十方如來清淨海眼者此全從神呪得名義兼體宗用也悉怛多般怛囉乃神呪之總稱呪從大覺頂中所說故曰無上能別魔外故曰寶印三世諸佛莫不由此破諸妄塵徹照萬象故曰清淨海眼海之一滴即具百川故但舉眼全體斯在亦名救護親因度脫阿難及此會中性比丘尼得菩提心入徧知海者文見四卷之中此用契宗體以得名也亦名如來密因了義者文雖分屬見道其體本徧初後此兼宗體力用及以教相得名也亦名大方廣妙蓮華王十方佛母陀羅尼呪文見五卷之前此兼體用以得名也亦名灌頂章句諸菩薩萬行首楞嚴者此雖分屬修證二分亦徹於前以用兼體宗故也言灌頂者西竺凡方等深經有密語者通灌頂部攝若約當經則諸佛放光交灌其頂及明菩薩受職智水灌頂是故云也天台凡釋題具有五重所謂名體宗用教相名中復有七種謂單三複三及具足一此經首題人法喻三悉皆具足大佛頂兼化佛人也呪心法也寶印喻也餘可例知此經實相為體經云欲令汝等通達實相故微密觀照為宗明妙奢摩他等為十方諸佛成道之法因果圓該故破妄顯真為用經廣明諸法虗幻斷諸惑業顯常住真心故大乘生酥為教相經始於常心終克極果圓類法華其間漸次深入廣顯性真多談相妄且非維摩所談不二法門明天魔勞侶皆為侍者等圓覺所談大光明藏一切障礙即究竟覺得念失念無非解脫等華嚴圓彰法界婆須密女無厭足王勝熱婆羅門諸善知識若逆若順皆為法門等智者大師謂華嚴尚兼一別此經判屬方等不及法華純一無雜斯言當哉說是經題之後阿難大眾得蒙如來開示密印般怛囉義之義者無上寶印十方如來清淨海眼義為佛頂神呪所表曰密經題非一故曰兼聞了義名目頓悟禪那修進聖位增上妙理者此通結見修證三分之益斷除三界修心六品微細煩惱者葢聞深證淺且思惑未盡機教權實可知結經之後將明助道先舉寶蓮香比丘尼之婬瑠璃王之殺善星之妄婬殺妄中義兼於盜四種律儀隨破一種皆致泥犁之苦今示此者務使末世多聞及諸博地因教知非怖果絕因也眾生心念循境下流謂分內之情眾生志慮逆情外慕謂分外之想今寶蓮香等唯順惡業故皆陷入地獄文舉十習六交種種苦報具明地獄相也地獄報盡還為餓鬼鬼報既盡更為畜生畜生報盡乃復為人所謂如汲井輪無有暫已行者窮研佛語不毛豎者真一闡底迦也。",
        "translation": "The five titles of the sutra are called the section on the conclusion of the sutra because the former reveals the vast expanse of the text for understanding and cultivation, which must be summarized in a compendium in order to be memorized.",
        "source": "X14n0296_002:0683a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "九卷",
        "translation": "Nine fascicles.",
        "source": "X14n0296_002:0683c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "躡前十仙廣明天道斯從勝想得昇方乎三惡及以人倫苦樂雖有不同無非生死輪轉結云此等眾生不識本心受此輪迴又云精研七趣無非昏沈諸有為相使悟此有為始獲無漏耳上之七趣葢通明三世因果今詳約當世進修明諸魔境大要務在了達身心本空魔佛一體行人於禪定中所發境界不取則魔亦是佛取著則佛亦是魔如色陰中云斯但功用暫得如是非為聖證不作聖心名善境界若作聖解即受群邪此陰境之要旨也助道大分由初卷云眾生無始種種顛倒業種自然如惡叉聚諸修行人不能得成無上菩提乃至別成聲聞緣覺及成外道諸天魔王及魔眷屬故今杜此多岐正道可階也。",
        "translation": "Although the preceding ten sages' extensive tomorrow path is based on the notion of superiority, they ascend from there to the three evils and the suffering and happiness of people, which are nothing but the cycle of birth-and-death.",
        "source": "X14n0296_002:0683c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十卷",
        "translation": "Ten Fascicles",
        "source": "X14n0296_002:0683c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云如是法門先過去世恒沙劫中微塵如來乘此心開得無上道識陰若盡則汝現前諸根互用從互用中能入菩薩金剛乾慧圓明精心於中發化如淨瑠璃內含寶月如是乃超十信十住十行十迴向四加行心菩薩所行金剛十地等覺圓明入於如來妙莊嚴海圓滿菩提歸無所得知菩提尚不可得何況他物能達斯旨群魔自息矣言從互用能入菩薩金剛乾慧此通指金剛之智不獨指信前為乾慧故言如是乃超十信等位又言菩薩所行金剛十地細研超及行字則知乾慧通徹諸位甚明前云經文錯綜者以此魔境之後重請修斷五陰諸相答文其要云理須頓悟乘悟併銷事非頓除因次第盡故佛責言我已示汝劫波羅巾何所不明再此詢問汝應將此妄想根元心得開通者明自利也傳示將來末法之中令識虗妄者明利他也深厭自生知有涅槃不戀三界者明功用也正宗止此下惟廣明勝益結勸弘持為流通分耳是經始緣阿難不了佛身非色聲亦非聲致登伽婬躬幻呪之所轉佛乃因其發心徵其心因其見相辯其見以致四科七大至於盡經重請五陰盡相曾未外此是故能了頂光化佛色聲本幻如是則摩登在夢受轉者其誰耶噫大佛頂之為教也亦至矣行人當於現量一體形教乃及文言可也又悟象忘言今截流意也。",
        "translation": "If the aggregate of consciousness and the aggregates of consciousness are exhausted, then you will be able to enter the bodhisattva's adamantine dry wisdom from the mutual application of the faculties in the present, and from that mutual application, you will be able to elaborate, develop, and transform it like pure glass containing the precious moon within.",
        "source": "X14n0296_002:0684a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "卷之下(終)戊戌正月二十四日瓦官僧舍校一卷至六卷二月初五日衙齋名理軒對完隨喜者汪仲嘉吳[傝-日]度周彥雲。",
        "translation": "(end) Wuxu, the first month, the 24th day of the first month, the Waguan monk's residence, proofreading one to six rolls, the fifth day of the second month, the Nian zhai, the Mingli xuan, the completion of the pair of followers, Wang Zhongjia, Wu [synopsis - sun], Du, Zhou Yanyun.",
        "source": "X14n0296_002:0684a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夢禎題",
        "translation": "Yunching's title",
        "source": "X14n0296_002:0684b02_2",
        "is_bad_quality": false
    }
]