[
    {
        "source_sentence": "維摩羅詰經文疏卷第二十七",
        "translation": "Commentary on the Passages of the Vimalakīrti Sutra, Volume 27",
        "source": "X18n0338_027:0680c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香積品",
        "translation": "Chapter of Fragrance Collection",
        "source": "X18n0338_027:0680c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "香是離穢之名而有宣芬散馥馨香之用故無量義經道風德香熏一切理中無上戒定慧香芬芳叵竭故名為香積是聚集為義積諸功德集成法身無所積集乃名為藏若就佛題品稱為香積從國以標目應號眾香今依正報勝人以標故稱香積品此品來意正為室內明非真非有之中能道觀雙流淨穢俱顯圓通不礙融會無妨入不二門雙亡二邊正入中道此品雙照二諦淨穢俱融廣上非真非假之文成於道觀雙流之義顯出圓通自在之用今文異上雙照二諦之用上問疾品末廣明雙用結成菩薩行具舉諸行雖知諸佛國土永寂如空而現種種清淨佛土是菩薩行今文還釋上二用明淨穢二土相涉文中處處釋淨土之意故知此經始末竝皆釋成佛國因果其義宛然此文明淨穢二土之行既爾諸行亦然舉此以例諸也故有此品來。",
        "translation": "\"Incense is the name given to that which is free from defilement but has the function of proclaiming fragrances and scents, so there are measureless meanings in the sūtras, paths, winds, virtues, and incense that perfume all things, and the unsurpassed fragrance of morality, meditation, and wisdom is inexhaustible.",
        "source": "X18n0338_027:0680c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是舍利弗心念日時欲至此諸菩薩當於何食。",
        "translation": "Śāriputra then was mindful of what bodhisattvas would eat when he wanted to visit them in the sun.",
        "source": "X18n0338_027:0681a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就此品大為二意一明身子念食二明大士譏呵身子起教之人為兩事故須念食一者古佛道法過中不飡此諸大人食時將到是故須起念二者上文云應以何法起菩薩根上來室內敷說勝法音聲佛事即是音聲起菩薩根次應用香味二法起菩薩根時眾將用鼻舌兩根聞於大乘禪悅法喜機在不久故身子扣此機端而致念也大士呵者明其二乘八解久有禪悅不以自資而外念求食是故譏之。",
        "translation": "The great point of this chapter is twofold: first, it shows that the body is mindful of food, and second, it shows that the person the Tathāgata criticizes must be mindful of food for two reasons: first, the ancient Buddha's path and teaching methods didn't include food in the interim, and the time will come when these adults will eat; therefore, they must be mindful; second, the above passage says, \"What teaching should be used to give rise to the bodhisattva faculties?\" The upshot is that when the room is filled with lectures on the surpassing Dharma and the sound of the Buddha's works, that's the sound that gives rise to the bodhisattva faculties, and then when the two things of application and smell give rise to the bodhisattva faculties, the multitude will use their nostrils and tongues to hear the joy of the Dharma in the great vehicle meditation, and soon the body will clasp the end of that faculty and become mindful of it.",
        "source": "X18n0338_027:0681a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰知其意而語言佛說八解脫仁者受行豈雜欲食而聞法乎。",
        "translation": "Vimalakīrti then knew his intention and spoke to the Buddha, saying, \"Do you accept the practice of the eight liberations as a human being who wants food and wants to hear the Dharma?",
        "source": "X18n0338_027:0681a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二譏呵為五一譏二許食三遣化請四明二土佛行化不同五時眾得益第一呵如文。",
        "translation": "The second criticism is five: one criticism, two accepting food, three rejecting the invitation to teach, four explaining the difference between the two lands and the Buddha's practice and transformation, and five timely benefits to the multitude. The first criticism is as explained in the text.",
        "source": "X18n0338_027:0681a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲食者且待須臾當令汝得未曾有食。",
        "translation": "'If you want to eat, wait a moment and you'll be allowed to eat like you haven't eaten before.'",
        "source": "X18n0338_027:0681a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二許食中云且待者機時不至故未曾有者明身子八解之中無此法喜禪悅也。",
        "translation": "The second promise of food says, \"Wait until the opportune time doesn't arrive; therefore, the unprecedented is an expression of the body's joy and meditative bliss that doesn't exist among the eight liberations.",
        "source": "X18n0338_027:0681a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰即入三昧。",
        "translation": "Vimalakīrti then immediately entered samādhi.",
        "source": "X18n0338_027:0681a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三請食中為四一入三昧二遣請飯三到彼問訊四受飯而還就入三昧為三一入三昧二現請飯之國三大眾皆見。",
        "translation": "The third invitation for food consists of four: one, entering samādhi; two, sending the invitation for food; three, going there to ask about the food; and four, accepting the food and returning to it.",
        "source": "X18n0338_027:0681a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以神通力示諸大眾上方界分過四十二恒河沙佛土有國名眾香佛號香積今現在其國香氣比於十方諸佛世界人天之香最為第一彼土無有聲聞辟支佛名唯有清淨大菩薩眾佛為說法其界一切皆以香作樓閣經行香地苑園皆香其食香氣周流十方無量世界時彼佛與諸菩薩方共坐食有諸天子皆號香嚴悉發阿耨多羅三藐三菩提心供養彼佛及諸菩薩。",
        "translation": "With supernormal powers, he shows the multitude of people that the upper realms are separated into forty-two Ganges River sands Buddha lands, and there's a country named Dsunghyang, which is the most fragrant of all the buddha-worlds in the ten directions, and the fragrance of the buddhas is the greatest of all. There are no śrāvakas or pratyekbuddhas in that land, except for the pure great bodhisattvas who preach the Dharma.",
        "source": "X18n0338_027:0681b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今言彼國以香為佛事用香證理鼻根受道無有聲聞純諸菩薩者此語似如實報之國蓮華藏土然同居之土亦有穢有淨亦有一乘之化無三差別者未知彼土定判屬何文云天子皆號光嚴既有天人之名復似隨緣淨土但天語是通何必如此間之天人或可用菩薩為第一義天人以權者名菩薩實者是天人或應如此然未敢定判。",
        "translation": "This statement seems to be like the lotus treasury land of that country, which is the real reward. However, there are lands that reside together that are defiled, purified, and created by the One Vehicle, and there are no three distinctions. I don't know what the definite judgment of that land is, but the text says that the celestials are all called fragrant adornment, and since they're called celestials, it also seems to follow the pure land.",
        "source": "X18n0338_027:0681b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸大眾莫不目見。",
        "translation": "None of the people here could see it with their eyes.",
        "source": "X18n0338_027:0681b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰問眾菩薩諸仁者誰能致彼佛飯。",
        "translation": "Vimalakīrti then asked the bodhisattvas, \"Which one of these gentlemen can bring the Buddha rice?",
        "source": "X18n0338_027:0681b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二遣請飯為五初覓請飯之人二文殊神力眾無言者三淨名呵四文殊引證為答五化作菩薩設問訊請飯之辭。",
        "translation": "The second invitation for rice consisted of five things: first, finding the person who asked for the rice; second, Mañjuśrī's supernormal power over the multitude of people who had no words; third, the pure name heaped praise on him; fourth, Mañjuśrī's elicitation of evidence as an answer; and fifth, the transformation into a bodhisattva who set up an inquiry to ask for the rice.",
        "source": "X18n0338_027:0681b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以文殊師利威神力故咸皆默然。",
        "translation": "Because of Mañjuśrī's authoritative power, they all remained silent.",
        "source": "X18n0338_027:0681b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二文殊神力咸默然者為二一明賓主之儀設食本是主人何容客為致飯第二為欲顯淨名勝德故令默然。",
        "translation": "The second reason Mañjuśrī's supernormal power commanded silence was twofold: first, it explained the manner of the host and the guest, and second, it was the host who offered the meal, so why would he allow the guest to serve the meal?",
        "source": "X18n0338_027:0681b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言仁此大眾無乃可恥。",
        "translation": "Vimalakīrti said, \"Sir, there's nothing shameful about this crowd.",
        "source": "X18n0338_027:0681c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三淨名呵如文。",
        "translation": "Third, Jōnō heaped praise on them as explained in the text.",
        "source": "X18n0338_027:0681c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利曰如佛所言勿輕未學。",
        "translation": "Mañjuśrī said, \"As the Buddha says, don't despise those who have yet to learn.",
        "source": "X18n0338_027:0681c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四文殊引佛語為答勿輕未學若有得不思議解脫致飯不難其未得亦有得義故不可輕。",
        "translation": "Fourth, Mañjuśrī quoted the Buddha's words in reply, \"Don't despise the unlearned. If there's something to attain, inconceivable liberation that leads to a meal, it's not difficult.",
        "source": "X18n0338_027:0681c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是維摩詰不起于座居眾會前化作菩薩相好光明威德殊勝蔽於眾會而告之曰汝往上方界分度如四十二恒河沙佛土有國名眾香佛號香積與諸菩薩方共坐食汝往到彼如我詞曰維摩詰稽首世尊足下致敬無量問訊起居少病少惱氣力安不願得世尊所食之餘當於娑婆世界施作佛事令此樂小法者得弘大道亦使如來名聲普聞。",
        "translation": "Vimalakīrti then did not get up from his seat and stayed in front of the assembly, transforming himself into a bodhisattva whose appearance was beautiful, radiant, and dignified, and he addressed the assembly, saying, \"Go up to the upper realms and divide them into sections like the forty-two Ganges River Buddha land, where there's a country named Dsunghyang and the Buddha's name is Xiangji and the bodhisattvas are all sitting together for a meal. Go there and eat as I said, 'Vimalakīrti bowed his head at the Bhagavān's feet and paid homage, asking countless questions about his upbringing and residence, suffering few illnesses and few disturbances, and having good stamina, may he not obtain food from the Bhagavān afterward.",
        "source": "X18n0338_027:0681c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其餘如文。",
        "translation": "The rest is as explained above.",
        "source": "X18n0338_027:0681c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時化菩薩即於會前昇于上方舉眾皆見其去到眾香界禮彼佛足。",
        "translation": "The transformed bodhisattva then rose above the assembly, and the multitude of people saw him depart and bow at the Buddha's feet in the congregation's fragrant realm.",
        "source": "X18n0338_027:0681c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三到彼問訊宣旨問訊為二一正宣旨問訊請飯二彼菩薩嗟歎就宣旨中為二一禮敬。",
        "translation": "The third one went there to inquire about the announcement of the order. The two kinds of inquires were the first, the correct announcement, the inquires about the meal, and the second, the bodhisattva's praise.",
        "source": "X18n0338_027:0681c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又聞其言維摩詰稽首世尊足下致敬無量問訊起居少病少惱氣力安不願得世尊所食之餘欲於娑婆世界施作佛事使此樂小法者得弘大道亦使如來名聲普聞。",
        "translation": "After hearing his words, Vimalakīrti bowed his head at the feet of the Bhagavān and paid homage to him, asking him about measureless greetings, getting up and going home, having few illnesses and few disturbances, and having good stamina, he didn't want to be fed by the Bhagavān and then wanted to perform Buddha-works in the Saha world so that those who enjoy the lesser teachings might spread the great way and the Tathāgata's fame might be heard everywhere.",
        "source": "X18n0338_027:0681c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二宣旨。",
        "translation": "Second, he declared his intention.",
        "source": "X18n0338_027:0681c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸大士見化菩薩歎未曾有今此上人從何所來娑婆世界為在何許云何名為樂小法者即以問佛。",
        "translation": "Those great men who saw the transforming bodhisattva praising him as unprecedented, asked the Buddha where this superior person had come from, where he was in the Saha world, and how he was called a person who enjoys the lesser dharma.",
        "source": "X18n0338_027:0681c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就彼諸菩薩嗟歎中為四一歎未曾有二生疑三問佛。",
        "translation": "Among those bodhisattvas' praises, there were four: one praised him as unprecedented, two had doubts, and three asked the Buddha about him.",
        "source": "X18n0338_027:0682a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告之曰下方度如四十二恒河沙佛土有世界名娑婆佛號釋迦牟尼今現在於五濁惡世為樂小法眾生敷演道教彼有菩薩名維摩詰住不可思議解脫為諸菩薩說法故遣化來稱揚我名并讚此土令彼菩薩增益功德。",
        "translation": "The Buddha told them, \"Below, in a land like the forty-two Ganges sands, there's a world named Śākya Muni, and the Buddha is called Śākyamuni. Now, in the five turbid bad states, he preaches the Way for sentient beings who enjoy the lesser dharma. There's a bodhisattva named Vimalakīrti who abides in unfathomable liberation and teaches for bodhisattvas.",
        "source": "X18n0338_027:0682a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四佛答佛答中為三一正答國土近遠化主功德。",
        "translation": "Of the four buddha-answers, the Buddha's answer is three: one is a correct answer about the merits of the land's near and distant transformation leaders.",
        "source": "X18n0338_027:0682a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼菩薩言其人何如乃作是化德力無畏神足若斯。",
        "translation": "The bodhisattva says, \"How did he do this transformation? His virtue, fearlessness, and spiritual abilities are so great.",
        "source": "X18n0338_027:0682a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二重問大士之德。",
        "translation": "Second, he repeatedly asked about the great person's virtue.",
        "source": "X18n0338_027:0682a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言甚大一切十方皆遣化往施作佛事饒益眾生。",
        "translation": "The Buddha said it was very great, for he sends transformation agents in all ten directions to perform Buddha-works for the benefit of sentient beings.",
        "source": "X18n0338_027:0682a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三佛答甚大。",
        "translation": "Third, the Buddha answered, \"It's very great!",
        "source": "X18n0338_027:0682a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是香積如來以眾香鉢盛滿香飯與化菩薩。",
        "translation": "The Xiangji Tathāgata then gave the transformation bodhisattva a multitude of fragrant bowls filled with fragrant rice.",
        "source": "X18n0338_027:0682a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四蒙飯而還為四一佛遣飯二九百萬菩薩俱發心欲來三奉授飯與大士四命大弟子共食。",
        "translation": "The fourth one was given rice and returned because four buddhas had sent rice, two nine million bodhisattvas had all roused their desire to come, three presented the rice to the great man, and four ordered the great disciple to eat with them.",
        "source": "X18n0338_027:0682a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時彼九百萬菩薩俱發聲言我欲詣娑婆世界供養釋迦牟尼佛并欲見維摩詰等諸菩薩眾。",
        "translation": "Nine million of those bodhisattvas then all spoke up and said, \"I want to go to the Śākyamuni world to make offerings to Śākyamuni Buddha and to see Vimalakīrti and the other bodhisattvas.",
        "source": "X18n0338_027:0682a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就九百萬菩薩來為三一陳其欲來二佛誡三與化菩薩俱來。",
        "translation": "There were three ways the nine million bodhisattvas had come: first, they presented their desire to come; second, the Buddha instructed them; and third, they came with the transforming bodhisattvas.",
        "source": "X18n0338_027:0682a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言可往攝汝身香無令彼諸眾生起惑著心又當捨汝本形勿使彼國求菩薩者而自鄙恥又汝於彼莫懷輕賤而作礙想所以者何十方國土皆如虗空又諸佛為欲化諸樂小法者不盡現其清淨土耳。",
        "translation": "The Buddha said, \"You may go and collect your body odor so that sentient beings there won't become addicted to confusion, and you must abandon your original form so that those who seek bodhisattvahood in other countries won't despise themselves.",
        "source": "X18n0338_027:0682a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就佛誡中為三一攝香誡二攝形誡三勿輕心誡心誡中又釋出居穢國之意明諸佛國土皆如虗空有何定淨穢之可取故不應生輕心也如文。",
        "translation": "Of the Buddha's precepts, there are three: the precept for collecting fragrance, the precept for collecting form, and the precept for not despising the mind. The precept for not despising the mind also explains the meaning of leaving and living in a defiled country, explaining that all the buddha lands are like empty space, so why is there any certainty that they're pure and defiled?",
        "source": "X18n0338_027:0682a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時化菩薩既受鉢飯與彼九百萬菩薩俱承佛威神及維摩詰力於彼世界忽然不現須臾之間至維摩詰舍維摩詰即化作九百萬師子之座嚴好如前諸菩薩皆坐其上。",
        "translation": "After receiving the bowl of rice, the transformed bodhisattva and those nine million bodhisattvas suddenly disappeared from that world thanks to the Buddha's authoritative power and Vimalakīrti's strength, and in a moment they arrived at Vimalakīrti's abode.",
        "source": "X18n0338_027:0682b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "俱來為三一俱承力來二淨名化座三菩薩皆坐。",
        "translation": "The three categories of the lion's seat are: one, the lion's seat that receives the power to come, two, the seat that's purely named transformation, and three, the bodhisattvas that are all sitting on it.",
        "source": "X18n0338_027:0682b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化菩薩以滿鉢香飯與維摩詰飯香普熏毗耶離城及三千大千世界。",
        "translation": "The transformed bodhisattva filled his bowl with fragrant rice and Vimalakīrti smoked the city of Vaiśālī and the 3,000 great one-thousand worlds with the scent of rice.",
        "source": "X18n0338_027:0682b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三就授飯中復為二一明飯香熏烈遍此大千。",
        "translation": "The third part of the meal that was given was further divided into two, one explaining that the fragrance of the meal was strong enough to permeate the great chiliocosm.",
        "source": "X18n0338_027:0682b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時毗耶離婆羅門居士等聞是香氣身意快然歎未曾有於是長者主月蓋從八萬四千人來入維摩詰舍見其室中菩薩甚多諸師子座高廣嚴好皆大歡喜禮眾菩薩及大弟子却住一面諸地神虗空神及欲色界諸天聞此香氣亦皆來入維摩詰舍。",
        "translation": "When the monks of Vaiśālī and the Brāhmaṇas heard this fragrance, they were delighted in body and mind and praised it as unprecedented. Then, the elder, the lord of the moon canopy, came from 84,000 people and entered Vimalakīrti's abode. Seeing the large number of bodhisattvas in his abode, the high, wide, and beautiful seats of the lion, they rejoiced and worshipped the bodhisattvas and their great disciples, who were standing to one side.",
        "source": "X18n0338_027:0682b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明有緣應得此食者緣召自來自來中為三初諸居士等來二月蓋來三諸神來。",
        "translation": "Second, it shows that there are conditions that should lead to this meal, and the conditions that summon the self-come are three. First, the householders and others come, the lords come in February, and the gods come in March.",
        "source": "X18n0338_027:0682b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰語舍利弗等諸大聲聞仁者可食如來甘露味飯大悲所熏。",
        "translation": "Vimalakīrti then told Śāriputra and the other great śrāvakas that they could eat the nectar-flavored rice of the Tathāgata, perfumed by great compassion.",
        "source": "X18n0338_027:0682b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四命食中為四一命食二勸捨小心三異聲聞竊念四化菩薩彈。",
        "translation": "In the fourth life food, there are four: 1. life food, 2. encouragement to be careful, 3. secret remembrance by śrāvakas, and 4. training the bodhisattvas.",
        "source": "X18n0338_027:0682b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無以限意食之使不消也。",
        "translation": "There's no limit to what he can eat with his mind that won't make it go away.",
        "source": "X18n0338_027:0682b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初勸莫以小意食者不消此今其若不發心慕大此味勢終自不消如涅槃毒鼓雖無心欲聞遠近皆死諸菩薩食者即悟無生此是近故死二乘雖前未死到法華中皆死捨小發大名為死。",
        "translation": "The first exhortation is not to eat with small intentions so that it won't subside. Now, if someone doesn't arouse the intention to admire the greatness of this taste, it will never subside on its own, like the poisonous drum of nirvāṇa, even though they have no desire to hear it.",
        "source": "X18n0338_027:0682b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有異聲聞念是飯少而此大眾人人當食。",
        "translation": "Some śrāvakas disagree and think, \"This is a small amount of rice, and everyone in this assembly will eat it.",
        "source": "X18n0338_027:0682c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化菩薩曰勿以聲聞小德小智稱量如來無量福慧四海有竭此飯無盡使一切人食搏若須彌乃至一劫猶不能盡所以者何無盡戒定智慧解脫知見功德具足者所食之餘終不可盡。",
        "translation": "The transforming bodhisattva says, \"Don't let the śrāvakas' small virtue and small wisdom measure the Tathāgata's measureless merit and wisdom, for which the four seas are inexhaustible. This rice is inexhaustible, so that all people can eat it, even if it's Sumeru and can't be exhausted in an eon. Why is that? It's inexhaustible, and the rest of it can never be exhausted by those who have perfect morality, meditation, wisdom, liberation, knowledge, and vision.",
        "source": "X18n0338_027:0682c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "化菩薩呵中為二一歎飯功德。",
        "translation": "The transforming bodhisattva praises the merits of the rice in two ways.",
        "source": "X18n0338_027:0682c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是鉢飯悉飽眾會猶故不賜其諸菩薩聲聞天人食此飯者身安快樂譬如一切樂莊嚴國諸菩薩也又諸毛孔皆出妙香亦如眾香國土諸樹之香。",
        "translation": "This bowl of rice completely fills the congregation, yet it's not given to any of the bodhisattvas, śrāvakas, or gods who eat it for physical comfort and happiness like the bodhisattvas in the Land of Immeasurable Bliss, and the wonderful fragrance that comes from their pores like the fragrance of the trees in the Land of Many Fragrances.",
        "source": "X18n0338_027:0682c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二述飯功能。",
        "translation": "Second, he describes the function of the meal.",
        "source": "X18n0338_027:0682c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時維摩詰問眾香菩薩香積如來以何說法。",
        "translation": "Vimalakīrti then asked the multitude of fragrant bodhisattvas what the Tathāgata taught.",
        "source": "X18n0338_027:0682c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四二土菩薩問答明二佛行化不同此正是品之來意為將此證成道觀雙流中道菩薩能淨穢俱遊通達無礙然機悟不同所以諸佛方便隨其根緣以之起教若是此方耳根利用聲詮理化剛強之人名為穢土彼界鼻舌兩根利用香味為教化於純一大乘無三差別名為淨土今但欲明淨穢雙遊故此土屬穢彼土為淨若究尋其義未必全爾何以故至如西方是淨土寶樹池流皆說無生忍生聲又蓮華藏國別教之土純諸菩薩色像無邊音聲無邊此中猶有音聲為佛事何得定判聲屬穢土若耳根起道通淨穢二國鼻根起道亦應如是何以故知若香在彼國純化大乘曲入娑婆遂使三乘同稟香味既三乘蒙香味入道者豈不是香味通於穢國耶例如釋迦寂滅道場聲色無邊尊特之佛名為淨土為罪眾生作三乘化即名垢國土彼淨國之杳來化娑婆亦復如是凡夫食之正位乃消正位服之發心乃消發心服之無生忍乃消即是分純一之香逗於三種豈不香通垢淨今正辨淨穢俱遊據別為語而判淨穢也問佛命菩薩令攝身香何不攝飯香答飯香亦被攝何故爾飯在彼國周流十方得來娑婆止薰三千之界減折一乘之飯逗彼三乘亦是攝義但菩薩辭遊異土彼佛誡之飯是佛遣已自裁量無容佛自命佛令減飯香今以義往推三乘同服止薰大千則知已攝今言令菩薩攝香非是除永盡攝是止節籌量為義契當根機不令過分呼此為攝耳次料簡正傍但香積之上香為正教如菩薩在香樹下即入德藏三昧便得悟道名為利根其有未悟之者即與大眾方共坐食故知味為傍也此正傍兩道逗鈍利兩根今娑婆國人鈍故香味相帶來正助兩門化於鈍者例如此間病有重輕藥有通別受身常病故言為輕四大增動外來內發故名為重以身常飢苦故即用通藥來治食飲補養得食病止不得必死此是通藥以治輕病若增劇兼加諸病者今時此食非復其治不能愈病更加餘味苦澁辛酸大黃巴豆助此食味共治重病病得除愈故言別藥治重病今正助兩道亦復如是若利根之人如快馬見鞭影即馳但用正不須於傍鈍馬加之杖捶苦楚方去是故須正助相成同是一杖而馬有利鈍同是一香而用有正助也此間聲義亦爾利者一聞即悟鈍者假諸方便或眼見神通心思諸境假助方悟也此中二土菩薩互有問答淨名問者欲顯他方起根不同淨穢有異故須問。",
        "translation": "The fourth question and answer from the bodhisattvas of the two lands clarifies that the two buddhas' practice and transformation are different. This is precisely the chapter that comes from the intention to realize the path, contemplate the dual streams, and middle path, so that the bodhisattvas can travel together in purity and defilement, penetrate without obstruction, and yet their faculties and awakenings are different.",
        "source": "X18n0338_027:0682c14_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "彼菩薩曰我土如來無文字說但以眾香令諸天人得入律行菩薩各各坐香樹下聞斯妙香即獲一切德藏三昧得是三昧者菩薩所有功德皆悉具足。",
        "translation": "The bodhisattva says, \"The Tathāgata of our land has no words to teach it but simply causes gods and humans to enter the vinaya practice. Bodhisattvas who each sit under a fragrant tree and hear this wonderful fragrance attain the samādhi of all merits.",
        "source": "X18n0338_027:0683b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二答律行者即大乘波羅提木叉如淨名為優波離教二比丘其如是者真奉律無二邊之非得中道之行名之為律。",
        "translation": "The second answer is that those who practice precepts are the two monks of the great vehicle, the prātimokṣa and the ubāli teachings, who thus truly adhere to precepts, have no duality, and attain the middle way of practice and call it precepts.",
        "source": "X18n0338_027:0683b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸菩薩問維摩詰今世尊釋迦牟尼以何說法。",
        "translation": "Those bodhisattvas asked Vimalakīrti what teaching the Bhagavān Śākyamuni was giving today.",
        "source": "X18n0338_027:0683b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二彼菩薩問淨名為六一問二答三彼菩薩稱歎四淨名述成五更問此土菩薩行六淨名答。",
        "translation": "Second, those bodhisattvas asked about the pure name, which are six: one question, two answers, three praises from those bodhisattvas, four statements of the pure name, and five further questions about the six pure names of bodhisattva practices in this land.",
        "source": "X18n0338_027:0683b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言此土眾生剛強難化故佛為說剛強之語以調伏之言是地獄是畜生是餓鬼是諸難處是愚人生處是身邪行是身邪行報是口邪行是口邪行報是意邪行是意邪行報是殺生是殺生報是不與取是不與取報是邪婬是邪婬報是妄語是妄語報是兩舌是兩舌報是惡口是惡口報是無義語是無義語報是貪嫉是貪嫉報是瞋惱是瞋惱報是邪見是邪見報是慳悋是慳悋報是毀戒是毀戒報是瞋恚是瞋恚報是懈怠是懈怠報是亂意是亂意報是愚癡是愚癡報是結戒是持戒是犯戒是應作是不應作是障礙是不障礙是得罪是離罪是淨是垢是有漏是無漏是正道是邪道是有為是無為是世間是涅槃以難化之人心如猨猴故以若干種法制御其心乃可調伏。",
        "translation": "維摩詰言此土眾生剛強難化故佛為說剛強之語以調伏之言是地獄是畜生是餓鬼是諸難處是愚人生處是身邪行是身邪行報是口邪行是口邪行報是意邪行是意邪行報是殺生是殺生報是不與取是不與取報是邪婬是邪婬報是妄語是妄語報是兩舌是兩舌報是惡口是惡口報是無義語是無義語報是貪嫉是貪嫉報是瞋惱是瞋惱報是邪見是邪見報是慳悋是慳悋報是毀戒是毀戒報是瞋恚是瞋恚報是懈怠是懈怠報是亂意是亂意報是愚癡是愚癡報是結戒是持戒是犯戒是應作是不應作是障礙是不障礙是得罪是離罪是淨是垢是有漏是無漏是正道是邪道是有為是無為是世間是涅槃以難化之人心如猨猴故以若干種法制御其心乃可調伏。",
        "source": "X18n0338_027:0683b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初答復為二一開五乘之教化剛強眾生二譬顯今言六度乘但處中者明初開三藏之時菩薩未斷結但有大心化物行行不在三應供之限非五種佛子故次人天乘屬凡夫數也就人乘中者明初開藏之菩先舉果苦即是說三惡道却論因令知惡果過患即止其因也因者即是三業開為五戒開身業為三戒口四五戒為一妄語即攝得三口過意為一飲酒戒故邪命攝得意之惡是故意口二業不開但身業為三合五戒制人乘也邪行者邪僻之法招得三途邪惡果報愚人者行三惡業智人者行三善業稟五戒人乘也次開五戒為十善具明因果即是天乘從慳去是六蔽治此六蔽明六度即是菩薩乘次從是結戒去是聲聞乘三藏之教結戒者明如來初制此戒故云是結戒順故名持違故為犯不動是毗尼故言是應作動非毗尼故不應作波逸提名煑燒覆障故是障礙或云是事遮為障礙不遮為不障礙犯七聚故是得罪三種羯磨懺故是離罪又作法取相無生三種懺故離罪結戒藏是淨是垢去是定藏言戒是亂心雜法垢法定是寂靜名為淨法欲界中多濁惡名垢四禪中離五蓋等名淨又味著諸禪名垢不貪不味為淨從是有漏是無漏去是慧藏有漏者如從凡夫至燸等也無漏者苦忍真明發即是無漏從此無漏之法即分為二乘修此無漏行六波羅蜜破除六蔽修行之時雖未斷結發無漏而望無漏修行至樹王下發真入無漏道與二乘不異故知同約無漏開菩薩乘破六蔽報者如菩薩戒中說破慳蔽除餓鬼業破梵戒蔽除地獄業破瞋恚蔽除畜生業破懈怠蔽除脩羅業破亂心蔽除人業破愚癡蔽除天業破六道因謝六處苦除名之為道六蔽斷除名滅證有餘無餘時究竟永寂約此無漏開聲聞乘以無漏心修四諦觀知苦斷集證滅修道約此無漏開辟支佛乘以無漏法修十二因緣觀無明滅則老死滅為支佛乘雖約此無漏開於三乘無漏不殊觀法有異故為三乘也是正道是八正也有為者方便道中無為者發真見諦所得斷名無為又從須陀洹至羅漢所得智慧名有為所得斷名無為無為即是有餘涅槃是涅槃者即是無餘涅槃問三乘各有觀法亦各有戒不答戒是和眾若復別立支佛之戒即是二戒二眾不名為和故戒不別立乘是觀法所習不同故須分別菩薩在俗非僧數攝故別開戒二乘若為白衣不入僧名為支佛一世無二佛不許別眾同聲聞眾眾既同不開戒(云云)。",
        "translation": "The first answer is further divided into two: first, opening the five vehicles to teach and transform sentient beings who are strong; second, the metaphors show that when the tripiṭaka was first opened, the bodhisattva hadn't yet cut the bonds but had a great mind, applied practices, and practices that weren't within the limits of the three offerings and weren't part of the five kinds of sentient beings.",
        "source": "X18n0338_027:0683c09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "譬如象馬[怡-台+龍]悷不調加諸楚毒乃至徹骨然後調伏如是剛強難化眾生故以一切苦切之言乃可入律彼諸菩薩聞說是已皆曰未曾有也如世尊釋迦牟尼佛隱其無量自在之力乃以貧所樂法度脫眾生。",
        "translation": "It's like an elephant or horse [yi-tai+dragon] that's sorrowful, uncontrolled, painful, and even penetrating to the bone, and then it's tamed because it's so rigid and difficult to teach sentient beings, so it's possible to enter the precepts with all the painful words.",
        "source": "X18n0338_027:0684b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三彼菩薩稱歎為二一歎佛。",
        "translation": "Third, those bodhisattvas praised two things: one praised the Buddha.",
        "source": "X18n0338_027:0684b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斯諸菩薩亦能勞謙以無量大悲生是佛土。",
        "translation": "\"Such bodhisattvas also labor humbly and with measureless great compassion are born in this Buddha land.",
        "source": "X18n0338_027:0684b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二歎菩薩。",
        "translation": "Second, they praise the bodhisattvas.",
        "source": "X18n0338_027:0684b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言此土菩薩於諸眾生大悲堅固誠如所言然其一世饒益眾生多於彼國百千劫行所以者何此娑婆世界有十事善法諸餘淨土之所無有何等為十以布施攝貧窮以淨戒攝毀禁以忍辱攝瞋恚以精進攝懈怠以禪定攝亂意以智慧攝愚癡說除難法度八難者以大乘法度樂小乘者以諸善根濟無德者常以四攝成就眾生是為十。",
        "translation": "Vimalakīrti said that the bodhisattvas of this land are resolute in their great compassion for sentient beings, just as they say, yet in one life they've done more to benefit sentient beings than in a hundred thousand eons in that country. Why is that? There are ten things that are good in this sahā world that aren't found in other pure lands. What are the ten? Suppressing poverty with generosity, suppressing abuses with pure precepts, suppressing anger with tolerance, suppressing laziness with effort, suppressing disturbed thoughts with meditation, suppressing foolishness with wisdom, liberating sentient beings with difficult teachings, liberating those who enjoy the lesser vehicle with the teachings of the great vehicle, and always accomplishing sentient beings with the four methods of gathering in the virtues.",
        "source": "X18n0338_027:0684b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四淨名述成其歎為二一總歎二歷別十事此中不述歎佛者明如來任運自在故不可思議但諸菩薩未同如來猶有緣累而能如是勞謙故述此也言此國一世為行多淨國百千劫數者但淨國眾生善根純熟易可開曉用功則易此間煩惱稠密度脫為難如釋論中云菩薩成佛時欲令國無三毒之名當學般若即難云佛是毉王出世為治人病國無三毒出世化誰答雖無邪三毒而有正三毒雖有正三毒易可化誨此間娑婆有邪三毒塵勞尤重雖聞佛音不即得悟就此應作三譬往釋如大猛將能退強敵其勳則重靜於小宼勳績不多治難愈病是毉最勝治易差病小復為劣今娑婆眾生煩惱怨賊最為堅靳而能方便使得解脫比之淨土約此論勝此土見思最為尤重而能逗藥設方便令法身慧命不斷故得饒益力多復次如人微賤之時能曲相將接解衣推食損施無幾濟之事深惟此厚恩常思報答比至位在方伯或復高遷之日念其昔恩酬澤則厚若施富貴人物恩報事微娑婆之國最是貧善法處而能施以法財令離困苦遂得發真斷結富七法財是追念昔恩實為重大為發真七財之人說法力用事弱用此二義譬於此國菩薩能化為勝淨國比之為劣若傳望淺深從凡至聖處處有怨賊處處有貧義至如同居之土自有淨穢淨者貧病乃輕於穢國比之方便有餘猶是貧病者方便有餘比別教實報國復是重者實報圓教十信未及初住十住未及十行十行未及十回向十回向未及十地如是傳傳為重今取凡夫最初堅靳須好勇將用妙毉藥是故言勝也用此二義約十法而明一一法中作此二義如以布施攝貧窮者即是破其慳賊治其貧病施其富貴之財如淨戒攝毀禁即是破其犯戒之賊違律之病施其淨戒之財歷十法乃至四教具作(云云)。",
        "translation": "The fourth accomplishment of the pure name is described as its praise, which is twofold: a general praise and two experiences of the ten particulars. This is not described as praising the Buddha because it shows that the Tathāgata is free to do as he wishes, so it's inconceivable. But the bodhisattvas who are not yet the same as the Tathāgata still have a burden of conditions that make them labor thus humbly.",
        "source": "X18n0338_027:0684b19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "彼菩薩曰菩薩成就幾法於此世界行無瘡疣生于淨土。",
        "translation": "The bodhisattva said, \"How many things has the bodhisattva accomplished to practice in this world without warts and be born in the Pure Land?",
        "source": "X18n0338_027:0685a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五彼菩薩問成就幾法無疣之行得生淨土之行者即是觀解大乘之心疣者起餘緣念累此正行行雜故名疣如呵阿難中增謗損謗損謗名行損若起諸妄見即是增謗義約此明乘急戒緩戒急乘緩俱急俱緩明於行疣大乘之行觀解純熟乘急者行淨戒無數犯不起身口之非此明無瘡疣即是乘戒俱急得生於淨土也若是乘急戒緩者大乘之觀乃當真正不能防禁身口毀損於戒此是有行而戒汙故是有瘡疣以其有乘故生輙見佛行有疣故生雜雜同居穢國也若但戒急而無乘是則聲聞緣覺俱緩故是凡夫。",
        "translation": "Fifth, the bodhisattva asked how many things he had accomplished in practice without warts that would lead to birth in the Pure Land, which is the practice of observing and understanding the mind of the great vehicle.",
        "source": "X18n0338_027:0685a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言菩薩成就八法於此世界行無瘡疣生于淨土何等為八饒益眾生而不望報代一切眾生受諸苦惱所作功德盡以施之等心眾生謙下無礙於諸菩薩視之如佛所未聞經聞之不疑不與聲聞而相違背不嫉彼供不高己利而於其中調伏其心常省己過不訟彼短恒以一心求諸功德是為八法。",
        "translation": "Vimalakīrti said there are eight things a bodhisattva accomplishes when he practices in this world without sores and warts and is born in the Pure Land. What are these eight things? Benefiting sentient beings without expecting rewards, generating all the merits of suffering and distress on behalf of all sentient beings, and giving them in full to sentient beings with the same humility and unhinderedness as buddhas who regard them as buddhas and hear the sūtras, don't doubt them, don't contradict the śrāvakas, don't envy their offerings, don't elevate their own interests, and temper their minds to always examine their faults and not litigate against their shortcomings.",
        "source": "X18n0338_027:0685a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上來十行約權化大士以辨難思勝行此中無瘡八法約實行之者行不雜穢剋生淨國也八法在文(云云)。",
        "translation": "The above ten practices are about the great person who authorizes and transforms in order to discern the surpassing practices that are difficult to fathom, and the eight sore-free practices are about those who practice them, conduct themselves in an unadulterated way, and undertake to produce pure countries.",
        "source": "X18n0338_027:0685a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰文殊師利於大眾中說是法時百千天人皆發阿耨多羅三藐三菩提心十千菩薩得無生法忍。",
        "translation": "When Vimalakīrti Mañjuśrī taught this teaching to the great multitude, a hundred thousand gods and humans aroused the mind of unsurpassed, correct enlightenment, and ten thousand bodhisattvas attained the forbearance of the nonarising of the Dharma.",
        "source": "X18n0338_027:0685b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五時眾得益如文。",
        "translation": "The fifth time the multitude of people reaped the benefits was as explained in the text.",
        "source": "X18n0338_027:0685b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩行品",
        "translation": "Chapter on the Conduct of the Bodhisattvas",
        "source": "X18n0338_027:0685b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正說中為三段佛國品是如來當宗演暢第二從方便品去至香積品大士助揚聖化第三從此品至阿閦品還歸佛所印定成經此二品來意有五一大士助佛闡揚有緣之眾緣縛既盡化功已畢須還佛所二佛初明佛國因果大士助宣此義殊辭異辨若不還歸印定物或疑網不除是故須歸佛所復宗明義故師弟相對復宗敷演更明佛國三室內既是別座當機之徒或生疑網為斷此疑還佛所對揚四機宜應在佛所得悟不從餘人故還佛所也五雖室內詮量至道不蒙佛印則不成經為印定故須往佛所品之來意如此也菩薩行品者此中香積來者分別菩薩法門明淨佛國土垢穢之行菩薩依此而行故名菩薩行品。",
        "translation": "The main explanation is that there are three sections in the Buddha Country section, which is the Tathāgata's forthcoming teaching, the second section from the Skillful Means section to the Incense Accumulation section, in which the Tathāgata assists in promoting noble transformation, and the third section from this section to the Akṣobhya section, in which the Tathāgata returns to the Buddha's place to seal the completion of the sūtras. There are five meanings of these two sections.",
        "source": "X18n0338_027:0685b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時佛說法於菴羅樹園其地忽然廣博嚴事一切眾會皆作金色。",
        "translation": "The Buddha then taught in the Āmravana grove, and suddenly the ground there was filled with a vast, ornate array of things, and all the congregations were made gold.",
        "source": "X18n0338_027:0685b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就此二品文為二第一從此品首至阿難歎未曾有淨名為掌擎大眾同入菴園名為歸佛段第二從佛述阿難如是如是去訖阿閦品名為復宗說佛國因果彼有時發始開二品為二初品明佛國之行是復宗明義次見阿閦佛品正明顯果一掌擎大眾俱往菴園二阿難聞香即起疑問就第一掌擎中為六一現相二阿難見相白佛三佛為說四維摩唱欲往五文殊問六用神力擎往菴園同金色者表淨名所化之者緣縛已除皆入性淨常寂之土同一金光。",
        "translation": "From the first of these two classes to Ānanda's praise of the unprecedented purity of the name palm-leading the whole assembly into Āmra's Park, the name is \"returning to the Buddha.\" Second, from the Buddha's account of Ānanda's thus-and-so departure, the name Akṣobhya was then reintroduced as a teaching of the causes and effects of the Buddha's land, and there was a time when it began.",
        "source": "X18n0338_027:0685b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言世尊以何因緣有此瑞應是處忽然廣博嚴事一切眾會皆作金色佛告阿難是維摩詰文殊師利與諸大眾恭敬圍遶發意欲來故先為此瑞應於是維摩詰語文殊師利可共見佛與諸菩薩禮事供養文殊師利言善哉行今正是時。",
        "translation": "Ānanda said to the Buddha, \"Bhagavān, what are the causes for this auspicious response?\" He told Ānanda, \"Vimalakīrti Mañjuśrī and the whole assembly are suddenly surrounded by respectful people and have the intention to come; therefore, this is the first auspicious response.\" Vimalakīrti then said to Mañjuśrī, \"May we see the Buddha together with the bodhisattvas, venerate, serve, and make offerings to Mañjuśrī,\" saying, \"Good, this is the right time to do it.",
        "source": "X18n0338_027:0685c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰即以神力持諸大眾并師子座置於右掌往詣佛所到已著地稽首佛足右遶七帀一心合掌在一面立。",
        "translation": "Vimalakīrti then used his supernormal powers to carry the whole assembly and place the lion's seat in his right palm as he went to the Buddha. When he arrived, he bowed his head at the Buddha's feet, circled him seven times to his right, and stood to one side with his palms together.",
        "source": "X18n0338_027:0685c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六擎大眾中為二一到佛申敬二佛慰問申敬為三一大士申敬。",
        "translation": "Among the six-armed multitude, there were two: one who paid homage to the Buddha on arrival, two who paid homage to the Buddha's greetings, and three: one who paid homage to the great person.",
        "source": "X18n0338_027:0685c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其諸菩薩即皆避座稽首佛足亦遶七帀於一面立。",
        "translation": "The other bodhisattvas then all withdrew from their seats, bowed their heads at the Buddha's feet, and circled around seven times as they stood on one side.",
        "source": "X18n0338_027:0685c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二諸菩薩申敬。",
        "translation": "Second, the bodhisattvas paid their respects.",
        "source": "X18n0338_027:0685c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大弟子釋梵四天王等亦皆避座稽首佛足在一面立。",
        "translation": "The four heavenly kings of Śākyamuni and Brahmā, the great disciples, also took refuge in the Buddha's seat, bowed their heads at his feet, and stood to one side.",
        "source": "X18n0338_027:0685c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三釋梵申敬。",
        "translation": "Three of the Śākyas and Brahmās paid their respects.",
        "source": "X18n0338_027:0685c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是世尊如法慰問諸菩薩已。",
        "translation": "After the Bhagavān had comforted the bodhisattvas according to the teaching, he expressed his sympathy.",
        "source": "X18n0338_027:0685c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二慰問為三一慰問。",
        "translation": "The two consolations were divided into three: one consolation.",
        "source": "X18n0338_027:0685c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各令復坐。",
        "translation": "Each of them was told to resume his seat.",
        "source": "X18n0338_027:0685c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二命復座。",
        "translation": "Second, he ordered them to resume their seats.",
        "source": "X18n0338_027:0686a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即皆受教眾坐已定。",
        "translation": "They were all instructed to resume their seats after sitting down.",
        "source": "X18n0338_027:0686a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三奉命復座。",
        "translation": "Third, they were instructed to resume their seats.",
        "source": "X18n0338_027:0686a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛語舍利弗汝見菩薩大士自在神力之所為乎。",
        "translation": "The Buddha said to Śāriputra, \"Do you see what the Bodhisattva-mahāsattva's sovereign power does?",
        "source": "X18n0338_027:0686a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二阿難疑問中為二一佛問舍利二阿難疑香就問舍利中為四一問汝見大士神力為乎二答三更問何如四答是不思議之法不可以思議心智圖度測量佛所以問者只為印成室內之事亦為室內懷疑未了者若聞佛印即不復有疑無疑故生信印故成經。",
        "translation": "The second question raised by Ānanda was two: first, the Buddha asked Śāriputra; second, Ānanda doubted the incense and asked Śāriputra; and fourth, he asked, \"Do you see the great man's supernormal powers?\" Second, he answered, \"What is the answer to the third further question?\" Fourth, he asked, \"This is an inconceivable teaching that cannot be conjectured or measured by the mind and wisdom of the mind.\" The Buddha's question was simply to seal the matter inside the room and to cause those who had doubts inside the room to not understand it.",
        "source": "X18n0338_027:0686a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然已見汝意云何世尊我覩其為不可思議非意所圖非度所測。",
        "translation": "'Yes, I've seen it. What do you think, Bhagavān? I've seen it as inconceivable, not something imagined or measured by intention, and not something measured by calculation.'",
        "source": "X18n0338_027:0686a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難白佛言世尊今所聞香自昔未有是為何香。",
        "translation": "It was then that Ānanda said to the Buddha, \"Bhagavān, what's this fragrance we hear now that hasn't been heard since the distant past?",
        "source": "X18n0338_027:0686a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從阿難問中為二一問香二問消問香中為五一阿難問。",
        "translation": "From among Ānanda's questions, there are two: one that asks about the fragrance, two that ask about the extinction of the fragrance, and five that Ānanda asks about.",
        "source": "X18n0338_027:0686a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難是彼菩薩毛孔之香。",
        "translation": "The Buddha told Ānanda that it was the fragrance of that bodhisattva's pores.",
        "source": "X18n0338_027:0686a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二佛答。",
        "translation": "Two, the Buddha answered.",
        "source": "X18n0338_027:0686a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是舍利弗語阿難言我等毛孔亦出是香。",
        "translation": "Śāriputra then said to Ānanda, \"This is the fragrance that comes from our pores.",
        "source": "X18n0338_027:0686a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三身子云我身亦香。",
        "translation": "Third, the body of the son said, \"My body also smells good.",
        "source": "X18n0338_027:0686a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難言此所從來。",
        "translation": "Ānanda said, \"Where did this come from?",
        "source": "X18n0338_027:0686a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四阿難問得香之緣。",
        "translation": "Fourth, Ānanda asked about the reason he got the fragrance.",
        "source": "X18n0338_027:0686a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰是長者維摩詰從眾香國取佛餘飯於舍食者一切毛孔皆香若此。",
        "translation": "He said that it was because the elder Vimalakīrti had taken the rest of the Buddha's rice from the land of many fragrances and fed on it at Śāriputra's house, and all of his pores smelled like this.",
        "source": "X18n0338_027:0686a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五身子答從淨名國得飯。",
        "translation": "Fifth, the body replied that he got the rice from the land of pure words.",
        "source": "X18n0338_027:0686b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難問維摩詰是香氣住當久如。",
        "translation": "Ānanda asked Vimalakīrti whether this fragrance would last as long as it did.",
        "source": "X18n0338_027:0686b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就問消中為二一阿難問二淨名答三阿難稱歎。",
        "translation": "In regard to the elimination of questions, there were two: 1) Ānanda asked, 2) Jingming answered, and 3) Ānanda praised.",
        "source": "X18n0338_027:0686b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言至此飯消。",
        "translation": "Vimalakīrti said that the rice had disappeared by now.",
        "source": "X18n0338_027:0686b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就答中為二初總答二別答總答云此香隨於飯飯若消者香亦隨消。",
        "translation": "In terms of the answer, there are two, the first is a general answer and the second is a specific answer. The general answer is, \"This fragrance follows the rice. If the rice goes away, the fragrance will also go away.",
        "source": "X18n0338_027:0686b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曰此飯久如當消曰此飯勢力至于七日然後乃消。",
        "translation": "He said, \"This rice will subside in the future,\" and he said that the power of this rice will last until seven days before it subside.",
        "source": "X18n0338_027:0686b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更重問久如消即別答為二一事二理事者答七日方消譬如世食持身止飢一日乃歇此食七日乃消又譬如服一種藥藥持食七日可消藥勢薰身至其疾愈此是事解。",
        "translation": "He asks again, \"Will it subside for a long time?\" That's a separate answer that answers two questions and two questions that answer seven days before it will subside. It's like taking a medicine that calms the body and stops hunger for a day before the food subside for seven days.",
        "source": "X18n0338_027:0686b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又阿難若聲聞人未入正位食此飯者得入正位然後乃消已入正位食此飯者得心解脫然後乃消若未發大乘意食此飯者至發意乃消已發意食此飯者得無生忍然後乃消已得無生忍食此飯者至一生補處然後乃消譬如有藥名曰上味其有服者身諸毒滅然後乃消此飯如是滅除一切諸煩惱毒然後乃消。",
        "translation": "Ānanda, if a śrāvaka who has not yet entered the right stage takes this meal, he'll attain the right stage and then it will subside. If someone who has not yet arisen the great vehicle intention takes this meal, it will subside until he arouses the intention. Having arisen the intention, he takes this meal and attains the forbearance of nonarising, then it will subside.",
        "source": "X18n0338_027:0686b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若理解不爾約聲說轉法輪中此土有半滿之教若二乘名半字大乘名滿字若半字中三轉法輪一示二勸三證示者示於四諦見諦故發真二勸勸斷思惟惑三證無學道故名三轉今香來詮理亦詮半字三轉法輪此中具其義用前七日為方便五停心總別念處約煗頂四法今言凡夫位食此香飯轉入七方便乃消七方便中食者轉入正位乃消不入即不消要見諦發真乃可消也此名示轉從正位食者不入思惟不消得入思惟乃消此名勸轉若思惟食者不得無學不消得心解脫成無學乃消此名證轉四處辨消即是三轉四諦法輪示勸證義宛然也復次此香詮大乘滿字三轉義者先責半字未入正位食飯入位乃消如身子等已斷三界證心解脫得盡智無生智此飯復進何果若不進果飯則不消若進果即是大乘義也當知羅漢雖證四果三界結斷若未發大乘之心猶是大乘理外未是方便位中故法華云止宿門外住立草菴若能發大乘心即名飯消是住方便位也故云七日乃消從此方便位食者入正位乃消即如身子於法華中入佛知見蒙記別名為入正位約大乘中作三根未知欲知根知根知已根若入發心即是欲知根從發心食飯至無生忍乃消名知根無生中食飯至補處乃消名知已根即是香教詮三無漏根故云轉滿字法輪逗於大乘有緣之者譬如上藥去譬顯明身諸毒滅者何但滅三界分段之毒上通教別教變易別毒實報中無明分分之毒皆能消滅此應將毒鼓為譬釋成此義莫論近遠聞之皆死具如前釋(云云)。",
        "translation": "If that's not the case, then it's a half-complete teaching in this land. If the two vehicles are called half-word, the great vehicle is called full-word. If there are three turns of the Dharma wheel in half-word, then it shows, two exhorts, and three actualizes.",
        "source": "X18n0338_027:0686b19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "阿難白佛言未曾有也世尊如此香飯能作佛事。",
        "translation": "Ānanda said to the Buddha, \"Never has there been a time, Bhagavān, when such a fragrant meal could do Buddha-works.",
        "source": "X18n0338_027:0686c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三阿難嗟未曾有昔但聞聲詮起半滿三轉而今香中具足勸示證等故歎為未曾有。",
        "translation": "Third, Ānanda contested that it had never existed before, except for hearing the sound, explaining the arising of the half-complete triple revolution, and now the fragrance is replete with exhortations, instructions, realization, and so forth.",
        "source": "X18n0338_027:0686c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言如是如是阿難或有佛土以佛光明而作佛事有以諸菩薩而作佛事有以佛所化人而作佛事有以菩提樹而作佛事有以佛衣服臥具而作佛事有以飯食而作佛事有以園林臺觀而作佛事有以三十二相八十隨形好而作佛事有以佛身而作佛事有以虗空而作佛事眾生應以此緣得入律行有以夢幻影響鏡中像水中月熱時燄如是等喻而作佛事有以音聲語言文字而作佛事或有清淨佛土寂寞無言無說無示無識無作無為而作佛事。",
        "translation": "佛言如是如是阿難或有佛土以佛光明而作佛事有以諸菩薩而作佛事有以佛所化人而作佛事有以菩提樹而作佛事有以佛衣服臥具而作佛事有以飯食而作佛事有以園林臺觀而作佛事有以三十二相八十隨形好而作佛事有以佛身而作佛事有以虗空而作佛事眾生應以此緣得入律行有以夢幻影響鏡中像水中月熱時燄如是等喻而作佛事有以音聲語言文字而作佛事或有清淨佛土寂寞無言無說無示無識無作無為而作佛事。",
        "source": "X18n0338_027:0687a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二因阿難問即明復宗就此為二一從此去訖此品末明佛土不同起根各異者此即是品之來意五重中之兩意也若化功已畢即是掌擎大眾入菴羅園是其義也次室中疑情未決或復須印即是佛告舍利弗汝見大士自在神力之所為乎中意即是印定室內所說亦是有疑皆斷也若大士稱揚雖復別論餘法皆為顯於淨國淨國既顯復宗還歸佛所說即此中文意也又眾生機悟在佛意亦今文中上開宗中長者前問果次問因佛前答其果二答其因果中有二一明果二解釋因中亦二一明因二解釋此中復宗亦具二意一復宗說果即是佛國佛事不同二復宗明因即是諸菩薩請菩薩行就果中為二一正明果二釋其意因中亦二一正明菩薩行二釋前後相對義意孱齊故知是復宗明義也上果門明義一者隨所教化眾生而取佛土二調伏眾生取土三隨以何法入佛慧取土四以何法起根取土今此果門亦備四義成上當宗佛國之說宛然是同但不次第前後為異耳良由言不疊出語不重安所以互說欲令行者不定執前後類如法華三周說法名異義同又如涅槃三十六問答中義相對當名字不同義意若正名異非嫌此中雖前後不次而名義孱齊今第一釋上第四雖復名殊其義是一第四釋上第一具列在文此中釋起菩薩根有十三句明諸佛國起根不同同用六塵之法來起六根也若是毗曇明色是質礙不得通於餘塵眼但見色不能兼用大乘明義則異於此根塵之中則能互用圓通諸法如眼對紙墨之色此色能詮一切諸法若空若假若中世間出世一切諸法無不具有只是一墨而已含容之德圓通無礙故大品云一切法趣色是趣不過乃至一切法趣味是趣不過於食等於法亦等當知根塵備一切法故用此根塵起此菩薩根也今將一塵為語者此是從勝為名如鼻根入道最利故用香塵起之如身根利故用光明觸之此間耳根利故用聲塵起之未必但有聲塵便無五塵如此間以聲為佛事亦放光明亦香雲香蓋衣服等為佛事但從勝者為正其餘是傍的判聲為佛事耳餘國若舉一塵者亦復例爾光明為佛事者放光明觸身具詮諸法隨觸得解何但他國以光為佛事此國亦以光明化人如諸大乘經皆放光駭動一切但非此國入道正意佛事正通意耳當知光明中具足一切法如思益所辨又如大品放光眾生遇者即發菩提之心如華嚴明光名無貪滅除諸貪欲蔽等皆是以光為正皆具諸法也但小乘中或言光到觸大乘明不思議而辨到觸化人為佛事者如須扇多佛留化佛度眾生或有佛有所施作利益眾生用化人化菩薩等起眾生根又如說般若化菩薩說般若即是此間以化為佛事也菩薩為佛事者或有佛土純用菩薩為眷屬利他導眾佛但為尊主而已此間亦有此義如說華嚴四大菩薩諸地功德佛但為主當知亦用菩薩為佛事此菩薩語既通不可定判支在化人故屬根塵也菩提樹為佛事佛在其下得道莊嚴此樹放光說法成熟眾生若作覆陰清涼為佛事即是起於身根別作觀樹亦經行即是起眼根如此間亦坐菩提樹得道經中或應有用菩提樹為佛事處即釋此意(云云)園林臺觀此亦有覆陰觀覩兩義不可判定所屬相好者即是色塵起眼根但見相好相好自有所詮能令物悟解如此間說般若時或現尊特身巍巍或現常身斷疑當知亦用相好為佛事虗空者但示空相空相能詮諸法如不二門中云四種空種為二若達四種空與空種不異即入不二法門若見此虗空為空空則無見見則非空豁無障礙因悟諸法但用此為佛事故如阿難欲見佛腹佛言授頭即見腹中空無所有也如虗空藏來至此界一切法空此間亦用空為佛事夢幻十喻作佛事常說此法此法多有所詮或有悟夢幻空乃至悟夢幻非空非有具如通教以十喻被大小乘小乘但取夢幻空菩薩得有若地論師以十喻為誑相者此乃得小乘之空永失大乘之有若言既是誑相般若以此為佛母者母既是誑子亦不實故知夢幻義通不可定執則失大乘之意也若言有佛土用夢幻為佛事此之佛土則誑相不實音聲者如此國起耳根也寂寞者示心輪雖無言說不妨有寂寞之樂若非樂者何得言作佛事耶若佛不示心十地不知若示心者蜫蟲能知當知是示心義此間亦用無說無示為佛事如淨名杜口文殊稱述佛或時默然身子又默然廣說則無量略示有十三種國也齊此是復宗明佛國釋上第四起菩薩根義也。",
        "translation": "The second reason Ānanda asks is to explain that the further teaching is twofold. One is to go from here to the end of this chapter to explain that the different starting roots of the Buddha land differ from each other.",
        "source": "X18n0338_027:0687a11_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如是阿難諸佛威儀進止諸所施為無非佛事阿難有此四魔八萬四千諸煩惱門而諸眾生為之疲勞諸佛即以此法而作佛事是名入一切諸佛法門。",
        "translation": "Thus, Ānanda, the buddhas' deportment, conduct, and actions that they bestow are not non-buddha-works. Ānanda, these four māras, 84,000 gates of affliction, and the sentient beings who are wearied by them, the buddhas work as buddhas with this teaching, which is called entering the gate of all the buddhas' teachings.",
        "source": "X18n0338_027:0688a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二次從如是阿難諸佛威儀施為是佛事去是對上第三明入佛慧義此即為二一明善門二明惡門從進止威儀去明善門即是淨國義明四魔塵勞去是明惡門是垢國義上文明隨眾生用何國入佛慧佛慧者法華名為佛知見此中明入佛法門諸佛現國垢淨不同為令眾生得入佛慧若眾生應見善法威儀進止安詳光相尊特入者即為現之宜用惡入者現為四惡煩惱而令得入如華嚴云女人示貪欲法門若凡夫之人為此墮落善財一觸即悟無量百千法門此則是示欲魔入佛慧如善財滿足王行如幻法門忿咤煞無量人因是得悟即是因恚魔得入如見婆羅門投巖赴火放身一去佛法現前即是用癡魔入佛慧從此三毒起等分四分生八萬四千塵勞諸使眾生入佛慧既善惡兩門入慧不同故諸佛現垢淨二國雖復垢淨之殊入門一種此上第三入於佛慧義。",
        "translation": "The second time, from this, Ānanda, the buddhas' manner and generosity are the Buddha-works, and this is the third point of insight into the Buddha's wisdom, which is twofold: one is to explain the good aspect, and the other is to explain the bad aspect.",
        "source": "X18n0338_027:0688a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩入此門者若見一切淨好佛土不以為喜不貪不高若見一切不淨佛土不以為憂不礙不沒但於諸佛生清淨心歡喜恭敬未曾有也。",
        "translation": "If a bodhisattva enters this gate, then he sees all pure and good buddha-lands and doesn't take delight in them, doesn't crave them, and doesn't become arrogant.",
        "source": "X18n0338_027:0688b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三若入此門見淨不喜見垢不憂此釋上第二調伏眾生而取佛國但諸佛為柔伏一切剛強之人示有垢淨那得見此淨穢而起高下憂喜之心心若憂喜不名調伏無憂無喜是調伏相譬如良毉為差病故授甘苦二藥藥雖有異差病無殊若見此良毉處二種藥為愈病故不於毉所生憎愛心佛亦如是但為調伏眾生不見淨垢為疑也。",
        "translation": "Third, if someone enters this gate and sees purity and doesn't rejoice and sees dirt and doesn't grieve, this explains the second point above about disciplining sentient beings and taking the Buddha's land.",
        "source": "X18n0338_027:0688b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來功德平等為教化眾生故而現佛土不同。",
        "translation": "All buddha-tathāgatas are equal in virtue and present different buddha-lands for the sake of teaching and transforming sentient beings.",
        "source": "X18n0338_027:0688b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四從諸佛平等去是釋上第一諸佛為教化眾生故而取佛土此中明十方如來功德平等一身一智慧力無畏亦等既其等那忽一佛國淨一佛國垢垢淨既殊何謂為等但為教化眾生於平等中而起慈悲作等不等為化眾生致有垢淨不同耳即釋成上為教化眾生也四種土義一無乖僻證知復宗宣說結撮始終成就前後明淨佛國土義。",
        "translation": "Fourth, from the equality of all buddhas, we explain that the first buddha takes on the buddha-lands for the sake of teaching sentient beings, and this explains that the tathāgatas in the ten directions are equal in virtue, one in wisdom, one in power, and one in fearlessness, and so forth.",
        "source": "X18n0338_027:0688c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難汝見諸佛國土地有若干而虗空無若干也。",
        "translation": "\"Ānanda, do you see how many buddha lands there are and how many pieces of space there aren't?",
        "source": "X18n0338_027:0688c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二從諸佛國土去即是釋成四種垢淨之意顯出方便隨緣性淨寂光之土就此為四一就虗空結釋二略明身智三廣明身智四約三號今就虗空結釋對上佛國辨果意即用譬如有人欲於虗空造立宮室終不能成依地即成雖復依地若無虗空即亦不成此言菩薩直就法性真空之理則無萬行功德諸波羅蜜莊嚴法身若依俗諦則有成就眾生淨佛國土雖復萬行功德終是約法性空有所成就若無法性空凡有所作則不能成今此結釋與上立室同明隨緣之土為化眾生欲令調伏使入佛慧起菩薩根雖砂石為地七寶為地乃至方便有餘自性實報種種之國約於眾生而有若干差別之異性淨之土為極智所栖無有垢淨高下優劣之事也故引虗空無若干為譬雖虗空無若干而遍若干之國若干之國不得離無若干之空終不離若干之外別有一無若干空也今四種隨緣之土雖復垢淨不等皆約常寂光土故有隨緣化他常寂光土亦遍方便之國離方便國無別常寂光土故經云其佛住處名常寂光遍一切處無處不有極智所觀觀一切法無非法性故知法性名為常寂經言無明明名畢竟空畢竟空即是無明之性此性明故名為寂光常住不變名之為常是故同虗空無若干釋成垢淨土也。",
        "translation": "The second point of going from the buddha lands is to explain the accomplishment of four kinds of defilement and purity, showing that the land of the tranquil light of the nature of skillful means and directives is divided into four categories: first, an explanation of the bonds of space, second, a brief explanation of body cognition, third, a broad explanation of body cognition, and fourth, a statement of the three names. Now, this explanation of the bonds of space is used to explain the fruit of the above buddha land discernment, which is like a person wanting to build a palace in space, but it's never accomplished depending on the ground, even though it's never accomplished depending on the ground, even though it's never accomplished depending on the ground if there's no space, it's never accomplished.",
        "source": "X18n0338_027:0688c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是見諸佛色身有若干耳其無礙慧無若干也。",
        "translation": "Thus, seeing the buddha's form body as having a number of forms, Turkey's unimpeded wisdom has no number.",
        "source": "X18n0338_027:0689a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二次略舉佛身智釋成二種之國如釋迦丈六彌勒千尺至萬延量此即是應身差別化物大小而有短長若是釋迦三藏之佛所得智斷獲五分法身無礙之慧與彌勒所得無礙之慧正習俱除復有何異十方諸佛一身一智慧力無畏復有何異常寂法性此處無殊或但為應身隨現長短之像隨緣優劣差降不同故有丈六千尺垢淨之異耳故言以身智釋成垢淨之國也。",
        "translation": "In the second instance, I'll briefly cite the buddha's body as wisdom that's interpreted into two kinds of lands, such as the Śākyamuni's sixteen-foot Maitreya's thousand-foot to ten-thousand-yen measure, which is the body that's associated with differentiation, size, and length. If this is the wisdom gained by the Śākyamuni tripiṭaka Buddha that ends the five parts of the Dharma body and obtains the unhindered wisdom and the unhindered wisdom gained by Maitreya that removes both correct habits, then how is it different? The buddhas in the ten directions are all one in their wisdom, power, and fearlessness, so how is there any difference between the quiescent Dharma nature here?",
        "source": "X18n0338_027:0689a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難諸佛色身威相種性戒定智慧解脫解脫知見力無所畏不共之法大慈大悲威儀所行及其壽命說法教化成就眾生淨佛國土具諸佛法悉皆同等。",
        "translation": "Ānanda, the buddhas' physical appearance, dignified features, seed nature, morality, meditation, wisdom, liberation, liberating knowledge, vision, power, fearlessness, and unique qualities, great kindness, great compassion, deportment, conduct, and lifespan, teaching, and transformation, accomplish sentient beings, and purify the buddha-lands with all the buddhas' teachings are all the same.",
        "source": "X18n0338_027:0689a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三廣明身智若作廣略明義此前屬略後屬廣若作思議不思議明義略屬思議二諦三藏佛無礙慧從廣明身智屬不思議二諦明無礙慧非但不思議真諦有異於思議三藏中真不思之俗亦異於三藏若干之俗身相差別亦復如是何以故若三藏中取應生父母之身辨其若干取真諦五分法身辨無若干極智栖託於法性常寂之境此處無有若干若明色身門內長者尊特之身蓮華藏中大相小相現此勝應為若干取極智所栖常寂法身之境為無若干當知真俗永異也今十方佛色等者一者應身之身垢國行化亦皆同等法身妙色堪然安住此處亦等智慧等者應身三藏佛十力無畏慈悲亦等乃至法身勝應十力無畏亦復不殊姓等者應身剎利婆羅門貴姓中生其事一等法身之姓習種性聖種性乃至妙覺法性亦皆同等化眾生等應身是化眾生勝應亦是化實報中眾生此諸處既等垢淨依報亦復是等何但諸佛獨有淨國釋迦亦有淨國名為無勝而在西方何但釋迦獨娑婆行化涅槃云一切諸佛亦於此中現轉法輪故知諸佛皆有隨緣若干之國等有常寂無礙之慧故言廣約身智釋成垢淨之國也此之身智國土互得相釋若是為眾生故而取國土致有淨穢之殊是則依報優劣不等依報既不等為眾生所受正報身智亦復不等此是將國土釋身智為此義故即是以身智釋國土約此即是顯於淨穢(云云)。",
        "translation": "The third extensive explanation of body cognition is that if one makes an extensive explanation, the abbreviated explanation belongs to the abbreviated before and the extensive after, and if one makes a deliberate inconceivable explanation, the abbreviated explanation belongs to the deliberate second truth, the Buddha's unhindered wisdom.",
        "source": "X18n0338_027:0689a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故名為三藐三佛陀名為多陀阿伽度名為佛陀。",
        "translation": "Therefore, it's called the samyak-saṃbuddha who's called the tathāgata and the agada who's called the buddha.",
        "source": "X18n0338_027:0689b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四約三號釋二國名者為二一正釋三號二辨義廣難受一正釋者三藐三佛陀名正遍知若是三藏明正遍知正者對六十二見偏邪得名觀真不觀俗雖名遍知若望大乘終名為偏非究竟正也知者窮真徧俗皆悉明了釋論明知知於數法非數法若常若無常皆知遍知非數法即是真諦其慧無若干也遍知數法即是俗諦深識根緣隨緣方便隨有若干也約此故名遍知自覺者覺真覺他者覺俗覺俗故即是隨緣方便若干不同覺真即是性淨無礙慧無若干也不思議中正者三諦普照名遍知三諦故名知但中道之中非數非非數非常非無常深悟此理名無礙慧雙照二諦俗中差別知病識藥隨緣方便垢淨不同調伏眾生故有若干也真俗自覺覺他例前(云云)故名正遍知也多陀阿伽度名如法相解如法相說若三藏中明如法相解者即是契於真如之理亦稱俗理而知亦名如法相解故是無礙慧無有若干應以何法教化何法調伏何法入佛慧何法起根機感差別而作若干說之雖復異說皆實不虗故言如法相說故名如來釋成垢淨之義也不思議中如是佛陀名覺亦名知例如前釋。",
        "translation": "The fourth interpretation of the names of the two countries according to the three numbers is twofold: one is a correct interpretation of the three numbers, and the other is a detailed explanation of their meanings that's difficult to accept.",
        "source": "X18n0338_027:0689b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難若我廣說此三句義汝以劫壽不能盡受。",
        "translation": "\"Ānanda, if I were to explain in detail the meaning of these three phrases, you wouldn't be able to experience them in their entirety for an eon.",
        "source": "X18n0338_027:0689c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就二辨三句義中為五一明三句義廣阿難所不能持。",
        "translation": "Of the two explanations of the meaning of the three phrases, there are five, one that explains the meaning of the three phrases in detail, and one that Ānanda can't maintain.",
        "source": "X18n0338_027:0689c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使三千大千世界滿中眾生皆如阿難多聞第一得念總持此諸人等以劫之壽亦不能受如是阿難諸佛阿耨多羅三藐三菩提無有限量智慧辯才不可思議。",
        "translation": "Even if the three thousand great one-thousand worlds were filled with sentient beings like Ānanda, who's well-versed, first in attaining mindfulness, and generally maintaining it, these people wouldn't be able to accept it with an eon's worth of life.",
        "source": "X18n0338_027:0689c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明假使多阿難亦不能持。",
        "translation": "Second, he explained that even if there were many of them, Ānanda wouldn't be able to maintain them.",
        "source": "X18n0338_027:0690a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言我從今已往不敢自謂以為多聞。",
        "translation": "Ānanda said to the Buddha, \"From now on, I wouldn't dare to call myself well-versed.",
        "source": "X18n0338_027:0690a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三明阿難悔責。",
        "translation": "Third, it showed that Ānanda repented and rebuked him.",
        "source": "X18n0338_027:0690a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難勿起退意所以者何我說汝於聲聞中為最多聞非謂菩薩。",
        "translation": "The Buddha told Ānanda not to give rise to retrogressive thoughts. Why is that? I said you're the most learned among śrāvakas and not what's called a bodhisattva.",
        "source": "X18n0338_027:0690a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四明佛慰喻。",
        "translation": "Fourth, the Buddha explained the parable of consolation.",
        "source": "X18n0338_027:0690a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且止阿難其有智者不應限度諸菩薩也一切海淵尚可測量菩薩禪定智慧總持辯才一切功德不可量也阿難汝等捨置菩薩所行是維摩詰一時所現神通之力一切聲聞辟支佛於百千劫盡力變化所不能作。",
        "translation": "Still, Ānanda, those who have wisdom shouldn't be limited to bodhisattvas, for all the abysses are still measurable, and the bodhisattvas' meditation, wisdom, and eloquence are immeasurable in their abilities and merits.",
        "source": "X18n0338_027:0690a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五釋不能持之義如文。",
        "translation": "The fifth explanation of the meaning of not being able to maintain is as explained in the text.",
        "source": "X18n0338_027:0690a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾香世界菩薩來者合掌白佛言世尊我等初見此土生下劣想今自悔責捨離是心。",
        "translation": "It was then that the bodhisattvas from the world of many fragrances came and joined their palms and said to the Buddha, \"Bhagavān, when we first saw this land, we had inferior conceptions. Now, we repent and abandon this attitude.",
        "source": "X18n0338_027:0690a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明彼菩薩請菩薩之行即是對上復宗明佛國因即為三一請法二佛為說三稱歎還本請中為三一悔責。",
        "translation": "The second explanation of the bodhisattva's practice of inviting other bodhisattvas is to contradict the above. The second explanation of the causes of the Buddha's land is that there are three: one, inviting the Dharma, two, the Buddha's explanation, and three, praising and returning to the original invitation.",
        "source": "X18n0338_027:0690a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何諸佛方便不可思議為度眾生故隨其所應現佛國異。",
        "translation": "Why is that? Inconceivable are the Buddha's skillful means to save sentient beings and therefore manifest different buddha lands as they see fit.",
        "source": "X18n0338_027:0690a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二領解。",
        "translation": "Second, they understand.",
        "source": "X18n0338_027:0690a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯然世尊願賜少法還於彼土當念如來。",
        "translation": "'Yes, Bhagavān, I wish to grant a small amount of the Dharma and return to the other land.'",
        "source": "X18n0338_027:0690a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三請法請法者明香積之國以香味二法來此度人今欲將此土之法還彼作佛事所以請法也彼菩薩雖是大乘之機得悟中道而於雙照二諦猶未深遠於小乘斷伏俗中未了是故如來為說雙照之義令其於化導無壅譬如王國備有文武兩種隨其靜亂用有興廢無賊之世器鈍人羸有寇之時兵利將勇今明十方佛法具有三諦之義但娑婆多難於權化為明諸菩薩等於雙照純熟彼土善根深厚於中道實慧速得通達權道有疑菩薩欲遊於十方須遍行三諦故須請也。",
        "translation": "Although that bodhisattva is a great vehicle practitioner who has attained enlightenment of the middle way, he's still not profoundly familiar with the two truths of dual illumination and has yet to comprehend the mundane aspects of lesser vehicle tranquility. Therefore, the Tathāgata explains the meaning of dual illumination so that he can guide them through the teachings without congestion.",
        "source": "X18n0338_027:0690b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸菩薩有盡無盡解脫法門汝等當學。",
        "translation": "The Buddha told the bodhisattvas there's an endless and inexhaustible gate of liberation that you should study.",
        "source": "X18n0338_027:0690b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛上答因義有二一橫明二豎明此中亦有二總釋別釋雖與上文名異義同也今就佛答中為三一總標勸學二明釋三結。",
        "translation": "There are two meanings of the Buddha's above reply, one horizontal and two vertical. There are also two general and specific explanations, although they have different names and the same meaning as the above.",
        "source": "X18n0338_027:0690b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂為盡謂有為法何謂無盡謂無為法如菩薩者不盡有為不住無為。",
        "translation": "\"What's meant by 'exhaustive' and 'inexhaustible'? What's meant by 'inexhaustible'? Suppose a bodhisattva doesn't end existence and doesn't abide in inexistence.",
        "source": "X18n0338_027:0690b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋又二一略釋二廣別釋。",
        "translation": "There are two explanations: an abbreviated explanation and a broad, specific explanation.",
        "source": "X18n0338_027:0690b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂不盡有為。",
        "translation": "What's meant by not-ending existent-being?",
        "source": "X18n0338_027:0690b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別釋中為三一先明不盡有為二明不住無為三疊釋二種就明不盡有為中為三一標二釋三結。",
        "translation": "In the separate explanation, there are three: one first explains inexhaustible existent-being; two explains unabiding and inexistent-being; three superfluous explanations of the two kinds of inexhaustible existent-being; three labels, two explanations, and three conclusions.",
        "source": "X18n0338_027:0690b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂不離大慈不捨大悲深發一切智心而不忽忘教化眾生終不厭惓於四攝法常念順行護持正法不惜軀命種諸善根無有疲厭志常安住方便迴向求法不懈說法無悋勤供諸佛故入生死而無所畏於諸榮辱心無憂喜不輕未學敬學如佛墮煩惱者令發正念於遠離樂不以為貴不著己樂慶於彼樂在諸禪定如地獄想於生死中如園觀想見來求者為善師想捨諸所有具一切智想見毀戒人起救護想諸波羅蜜為父母想道品之法為眷屬想發行善根無有齊限以諸淨國嚴飾之事成己佛土行無限施具足相好除一切惡淨身口意生死無數劫意而有勇聞佛無量德志而不倦以智慧劒破煩惱賊出陰界入荷負眾生永使解脫以大精進摧伏魔軍常求無念實相智慧行少欲知足而不捨世法不壞威儀而能隨俗起神通慧引導眾生得念總持所聞不忘善別諸根斷眾生疑以樂說辯演法無礙淨十善道受人天福修四無量開梵天道勸請說法隨喜讚善得佛音聲身口意善得佛威儀深修善法所行轉勝以大乘教成菩薩僧心無放逸不失眾善。",
        "translation": "That is, he doesn't part with great kindness or abandon great compassion, deeply develops omniscience, doesn't neglect it, and teaches sentient beings to never tire of it. He is always mindful of and conducts himself in accordance with the four methods of collecting dharmas, doesn't spare his life, cultivates good roots, doesn't tire of it, always abides in skillful means, dedicates himself to the pursuit of the Dharma, doesn't tire of expounding the teachings, and diligently makes offerings to the buddhas.",
        "source": "X18n0338_027:0690b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中凡歷四十句以明不盡有為今言盡無盡者不盡於俗而廣行萬行不住於無不同灰斷真俗俱照道觀雙遊淨穢融通權實自在俗諦是生死有為可盡之法故名為盡真諦是涅槃無為空法名不可盡故盡無盡門眾生應以此門得度即以此法起菩薩根入佛慧也亦是釋成室內所明如是病者非真非有之意若入此門乃能淨穢雙遊道觀自在則不為淨名所呵私問若香土菩薩方請此法云何能遊此娑婆私答以權引實故有斯問以實隨權故能遊娑婆(云云)文中禪定如獄生死如園者此借子在難父在宅雖有五欲常如受苦若得拔難其心乃悅(云云)。",
        "translation": "In the explanation, there are forty sentences that explain the inexhaustible nature of existence. Now, when it comes to exhausting the inexhaustible, he doesn't end up in the conventional but conducts a wide range of all practices without stopping at nothing different from the real and the conventional, both illuminating the Way and observing the pure and defiled, blending expedient and real, and freely abiding in the conventional truth, which is that birth and death are existential and exhaustible, and the real truth is that nirvāṇa is imperishable and empty, and the name of the Dharma is inexhaustible, so the gate to exhaustion and inexhaustibility is the gate by which sentient beings should be liberated, which is the way to give rise to the bodhisattva's roots and enter the Buddha's wisdom.",
        "source": "X18n0338_027:0690c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行如此法是名菩薩不盡有為。",
        "translation": "To practice such a thing is to be called a bodhisattva who doesn't end existential activity.",
        "source": "X18n0338_027:0691a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂菩薩不住無為。",
        "translation": "What's meant by a bodhisattva not abiding in nonproductivity?",
        "source": "X18n0338_027:0691a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二從不住無為者亦為三一標二別釋三結。",
        "translation": "The second thing is that there are also three ways to define nonabiding and nonproductivity: one is to label, two are to explain separately, and three are to conclude.",
        "source": "X18n0338_027:0691a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂修學空不以空為證修學無相無作不以無相無作為證修學無起不以無起為證觀於無常而不厭善本觀世間苦而不惡生死觀於無我而誨人不倦觀於寂滅而不永寂滅觀於遠離而身心修善觀無所歸而歸趣善法觀於無生而以生法荷負一切觀於無漏而不斷諸漏觀無所行而以行法教化眾生觀於空無而不捨大悲觀正法位而不隨小乘觀諸法虗妄無牢無人無主無相本願未滿而不虗福德禪定智慧。",
        "translation": "謂修學空不以空為證修學無相無作不以無相無作為證修學無起不以無起為證觀於無常而不厭善本觀世間苦而不惡生死觀於無我而誨人不倦觀於寂滅而不永寂滅觀於遠離而身心修善觀無所歸而歸趣善法觀於無生而以生法荷負一切觀於無漏而不斷諸漏觀無所行而以行法教化眾生觀於空無而不捨大悲觀正法位而不隨小乘觀諸法虗妄無牢無人無主無相本願未滿而不虗福德禪定智慧。",
        "source": "X18n0338_027:0691a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就釋中歷十六句廣明不住無為也如文。",
        "translation": "In the explanation, there are 16 consecutive sentences that explain in detail that abiding in noncontrivance is just like the text.",
        "source": "X18n0338_027:0691a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修如此法是名菩薩不住無為。",
        "translation": "Cultivating this kind of dharma is called a bodhisattva not abiding in nonproductivity.",
        "source": "X18n0338_027:0691a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又具福德故不住無為具智慧故不盡有為大慈悲故不住無為滿本願故不盡有為集法藥故不住無為隨授藥故不盡有為知眾生病故不住無為滅眾生病故不盡有為諸正士菩薩已修此法不盡有為不住無為。",
        "translation": "Being endowed with virtue, he doesn't abide in nothingness Being endowed with wisdom, he doesn't abide in nothingness Great compassion, he doesn't abide in nothingness Fulfilling his past vows, he doesn't abide in nothingness Gathering medicines for the Dharma, he doesn't abide in nothingness Following the administration of medicines, he doesn't abide in nothingness Knowing the illness of many, he doesn't abide in nothingness Eliminating the illness of many, he doesn't abide in nothingness The bodhisattvas who correctly cultivate this Dharma don't end up with existence and don't abide in nothingness.",
        "source": "X18n0338_027:0691a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三就疊釋不盡不住即釋成上佛國之中橫豎二意橫則十七句句句之中皆約三藏通別圓等四教四門以明橫相豎則從直心徹至佛果有十三句之淺深亦有結釋橫豎之義今此中先歷別四十句廣辨不盡有為次十六句廣辨不住無為對上橫豎明法相深廣之意次有四雙疊釋三種權實二智自地豎深化他願滿釋成橫豎義前橫豎說之中不盡在前不住在後疊釋中不住在前不盡在後後前互辨者明無前無後前後雙融之意今言不住無為則是於實諦無滯自行事成不盡有為則是於俗諦遍知化他無壅權實雙照自他兼達若三諦圓明自能深徹則是無礙慧無若干若以化他無所壅礙故能垢淨雙遊方便若干也就此疊釋中有四雙初福德智慧為一雙二慈悲誓願為一雙三識藥授藥為一雙四知病識病為一雙約此應明權實二智自有自行權實自行化他權實化他權實自修中道之理為實雙照二諦為權此是自行明權實若是自觀二諦之理為實為他說二諦為權是名自行化他明權實若是化他明權實者此則約緣無定或說權為實或說實為權或於權中而辨權實或於實中而辨權實逗機深淺逐物便宜不可復定約此判思議不思議二種二諦若是自行權實一向判屬不思議二思議若自行化他權實此中亦屬不思議亦屬思議何故爾如通教所明二諦含中道在真諦中故言三乘人同以無言說道斷煩惱入涅槃若是含真入俗者如涅槃云我與彌勒共論世諦五百比丘謂說真諦即是此義也雖不正中道之名而有中道其義兩屬故名為通通者通於二乘見真諦之空若通別教圓教則亦見於空亦見不空能通見空即是思議見空見不空即是不思議見空智慧如螢火見不空智慧如日月日月照用既廣治惑亦大二乘人智慧既小所斷亦小若菩薩自行則見空不空化他利物但見於空不見不空故知自行化他權實亦屬思議亦屬不思議也若是化他權實一向是思議二諦何以故思議二諦無中道體故明真時則永寂如空明有時如石裏有金有異於永寂之空真俗條別是則以永寂之意而測真如石金之心以解俗故言是思議二諦但思議之真有漸頓義譬如石金漸漸融冶銷磨鑛盡金現思議之真亦復如是有三種如一切森羅對目千種萬形原其同是四大名為下如四大雖復遍成諸物俱是無常生滅之法名為中如生滅雖復遷謝同是無生無滅入於真諦此豈非漸頓也不思議則不如是為有中道之本體約體明二諦名不可思議譬如意珠能雨種種七寶珠中畢竟無所有求不可得只言畢竟空而能雨寶不思議理亦如是非真非俗畢竟清淨而能真俗具足圓備一切真俗俱不可圖度故稱不可思議若約此珠以譬通教者如珠雨寶時則無有金銀相貌此與凡珠何異即是於俗破之求寶畢竟空無此空與真諦斷空何異約此明可思議相是三藏思議二諦也若知其功能發願求寶能於空中即出種種資生之物此空不同二乘之人真空也所出之寶異於世間珍玩此不同凡夫俗有如菩薩深見不思議二諦亦是開合真俗具出二種如前今將三種權實釋於不盡權實雙遊之義也復次歷四教明不盡不住今約三藏教明之若觀真斷結以空為證則同二乘灰斷住於無為何由能得三阿僧祇成就佛法故不得住於無為不盡有為者慈悲六度本約有修行教化俗中眾生若入真則無此事今若斷盡諸有之因因盡則果亡云何得處三界廣行佛法今以不盡有為結漏而修佛法能成道轉法輪以三藏化他權實具足也通教不盡不住者若盡有為則同二乘若住無為乖菩薩道是故方便從空出假利益眾生如空中種樹巧妙方便故故不盡有為不取空證故故不住無為別教不盡不住者若但用二觀為方便道得入中道是為住無為盡有為今雖得入中道之理但塵沙佛法悉未現前皆知皆學豈得保此中道應須照俗是故從中反照二諦名不住無為若除二諦之俗更無俗可觀今照此二諦遍行佛道故言不盡有為不保中道故言不住無為圓教中還約別教明義若但觀中即是盡二諦不照二諦即是住無為今三諦同觀一時能了了真不住於真了俗不盡於俗不住不盡一時雙照權實俱明(云云)若是此間多惡故治兵講武多以化他二諦逗之於自行二諦未了故香飯來此使三乘之人近遠皆如身子之流食此飯者至發心乃消於法華中開佛知見即是三種權實而得具足彼土無惡但制禮作樂唯以自行權實於化他權實未了是故慇懃請此方便還香積土施作佛事令彼實行之者三種權實皆悉圓通自在無礙也問彼土菩薩在香樹下得功德藏三昧一切佛法皆在其中云何言於化他權實未了答有二義一者雖具有彼土不行此化則於二乘小道知根知藥不得明了二者彼土雖淨有權有實實者但稟一實之教未稟方便是故請法也復次將福德誓願識藥知病四雙歷四教一一作相分明成就(云云)今且約圓教作之福德莊嚴是五度之法必須遍約有作無作兩種四諦彼土中修行諸度具足塵沙佛法若於分段中修福德滿能坐三藏道場作佛教化眾生故言不盡有為也若方便有餘中行福德滿即其土坐道場乃至別教滿圓教報土福德滿即坐道場作佛今為遍滿此等福德莊嚴故不盡有作無作二種有為為智慧故不盡有為者境能發智若却分段有餘變易等何所觀察既不知分段塵沙境界相貌是則智慧不滿智慧不滿不能得隨緣諸土而坐道場故不盡有為為增智慧故此是用福慧二嚴結成菩薩行也第二雙不盡有為者欲以大慈悲拔苦與樂此之大慈何但拔思議二諦有作之苦與其思議真諦之樂亦拔不思議無作四諦之苦與其中道究竟之樂若分段苦盡即能道樹斷結為三藏佛乃至變易苦盡即為別教之佛以此大慈悲利益一切故言不盡有為也滿本願者則是昔時起四弘誓願廣緣無作有作二種四諦起此誓願願既未滿那得盡有為第三集法藥亦如是塵沙佛法約有而論深淺根機大小性欲善惡對治若色若香一切法悉須遍知未具佛法不應滅受而取證是故不住無為無為之中無病無藥無能授今欲作度老病死大毉王授與眾生治煩惱藥豈得斷盡有為以不盡故作三藏佛知二乘四諦因緣法藥治分段之病乃至能作別教盧舍那佛授與中道法藥若盡有為無此等也第四眾生是有為今住無為則不入有為巨海何得識知其病貪欲瞋癡種種相貌既不識其病差機說法是眾生怨妄授於藥非是明毉為知病故不住無為為滅病故不盡有為所言滅者非是滅無之滅諸佛菩薩隨所調伏眾生處名為解脫自於中無縛能解他縛亦不縛不脫令眾生得不縛不脫名之為滅為調伏故不盡有為得解脫故名為滅病。",
        "translation": "第三就疊釋不盡不住即釋成上佛國之中橫豎二意橫則十七句句句之中皆約三藏通別圓等四教四門以明橫相豎則從直心徹至佛果有十三句之淺深亦有結釋橫豎之義今此中先歷別四十句廣辨不盡有為次十六句廣辨不住無為對上橫豎明法相深廣之意次有四雙疊釋三種權實二智自地豎深化他願滿釋成橫豎義前橫豎說之中不盡在前不住在後疊釋中不住在前不盡在後後前互辨者明無前無後前後雙融之意今言不住無為則是於實諦無滯自行事成不盡有為則是於俗諦遍知化他無壅權實雙照自他兼達若三諦圓明自能深徹則是無礙慧無若干若以化他無所壅礙故能垢淨雙遊方便若干也就此疊釋中有四雙初福德智慧為一雙二慈悲誓願為一雙三識藥授藥為一雙四知病識病為一雙約此應明權實二智自有自行權實自行化他權實化他權實自修中道之理為實雙照二諦為權此是自行明權實若是自觀二諦之理為實為他說二諦為權是名自行化他明權實若是化他明權實者此則約緣無定或說權為實或說實為權或於權中而辨權實或於實中而辨權實逗機深淺逐物便宜不可復定約此判思議不思議二種二諦若是自行權實一向判屬不思議二思議若自行化他權實此中亦屬不思議亦屬思議何故爾如通教所明二諦含中道在真諦中故言三乘人同以無言說道斷煩惱入涅槃若是含真入俗者如涅槃云我與彌勒共論世諦五百比丘謂說真諦即是此義也雖不正中道之名而有中道其義兩屬故名為通通者通於二乘見真諦之空若通別教圓教則亦見於空亦見不空能通見空即是思議見空見不空即是不思議見空智慧如螢火見不空智慧如日月日月照用既廣治惑亦大二乘人智慧既小所斷亦小若菩薩自行則見空不空化他利物但見於空不見不空故知自行化他權實亦屬思議亦屬不思議也若是化他權實一向是思議二諦何以故思議二諦無中道體故明真時則永寂如空明有時如石裏有金有異於永寂之空真俗條別是則以永寂之意而測真如石金之心以解俗故言是思議二諦但思議之真有漸頓義譬如石金漸漸融冶銷磨鑛盡金現思議之真亦復如是有三種如一切森羅對目千種萬形原其同是四大名為下如四大雖復遍成諸物俱是無常生滅之法名為中如生滅雖復遷謝同是無生無滅入於真諦此豈非漸頓也不思議則不如是為有中道之本體約體明二諦名不可思議譬如意珠能雨種種七寶珠中畢竟無所有求不可得只言畢竟空而能雨寶不思議理亦如是非真非俗畢竟清淨而能真俗具足圓備一切真俗俱不可圖度故稱不可思議若約此珠以譬通教者如珠雨寶時則無有金銀相貌此與凡珠何異即是於俗破之求寶畢竟空無此空與真諦斷空何異約此明可思議相是三藏思議二諦也若知其功能發願求寶能於空中即出種種資生之物此空不同二乘之人真空也所出之寶異於世間珍玩此不同凡夫俗有如菩薩深見不思議二諦亦是開合真俗具出二種如前今將三種權實釋於不盡權實雙遊之義也復次歷四教明不盡不住今約三藏教明之若觀真斷結以空為證則同二乘灰斷住於無為何由能得三阿僧祇成就佛法故不得住於無為不盡有為者慈悲六度本約有修行教化俗中眾生若入真則無此事今若斷盡諸有之因因盡則果亡云何得處三界廣行佛法今以不盡有為結漏而修佛法能成道轉法輪以三藏化他權實具足也通教不盡不住者若盡有為則同二乘若住無為乖菩薩道是故方便從空出假利益眾生如空中種樹巧妙方便故故不盡有為不取空證故故不住無為別教不盡不住者若但用二觀為方便道得入中道是為住無為盡有為今雖得入中道之理但塵沙佛法悉未現前皆知皆學豈得保此中道應須照俗是故從中反照二諦名不住無為若除二諦之俗更無俗可觀今照此二諦遍行佛道故言不盡有為不保中道故言不住無為圓教中還約別教明義若但觀中即是盡二諦不照二諦即是住無為今三諦同觀一時能了了真不住於真了俗不盡於俗不住不盡一時雙照權實俱明(云云)若是此間多惡故治兵講武多以化他二諦逗之於自行二諦未了故香飯來此使三乘之人近遠皆如身子之流食此飯者至發心乃消於法華中開佛知見即是三種權實而得具足彼土無惡但制禮作樂唯以自行權實於化他權實未了是故慇懃請此方便還香積土施作佛事令彼實行之者三種權實皆悉圓通自在無礙也問彼土菩薩在香樹下得功德藏三昧一切佛法皆在其中云何言於化他權實未了答有二義一者雖具有彼土不行此化則於二乘小道知根知藥不得明了二者彼土雖淨有權有實實者但稟一實之教未稟方便是故請法也復次將福德誓願識藥知病四雙歷四教一一作相分明成就(云云)今且約圓教作之福德莊嚴是五度之法必須遍約有作無作兩種四諦彼土中修行諸度具足塵沙佛法若於分段中修福德滿能坐三藏道場作佛教化眾生故言不盡有為也若方便有餘中行福德滿即其土坐道場乃至別教滿圓教報土福德滿即坐道場作佛今為遍滿此等福德莊嚴故不盡有作無作二種有為為智慧故不盡有為者境能發智若却分段有餘變易等何所觀察既不知分段塵沙境界相貌是則智慧不滿智慧不滿不能得隨緣諸土而坐道場故不盡有為為增智慧故此是用福慧二嚴結成菩薩行也第二雙不盡有為者欲以大慈悲拔苦與樂此之大慈何但拔思議二諦有作之苦與其思議真諦之樂亦拔不思議無作四諦之苦與其中道究竟之樂若分段苦盡即能道樹斷結為三藏佛乃至變易苦盡即為別教之佛以此大慈悲利益一切故言不盡有為也滿本願者則是昔時起四弘誓願廣緣無作有作二種四諦起此誓願願既未滿那得盡有為第三集法藥亦如是塵沙佛法約有而論深淺根機大小性欲善惡對治若色若香一切法悉須遍知未具佛法不應滅受而取證是故不住無為無為之中無病無藥無能授今欲作度老病死大毉王授與眾生治煩惱藥豈得斷盡有為以不盡故作三藏佛知二乘四諦因緣法藥治分段之病乃至能作別教盧舍那佛授與中道法藥若盡有為無此等也第四眾生是有為今住無為則不入有為巨海何得識知其病貪欲瞋癡種種相貌既不識其病差機說法是眾生怨妄授於藥非是明毉為知病故不住無為為滅病故不盡有為所言滅者非是滅無之滅諸佛菩薩隨所調伏眾生處名為解脫自於中無縛能解他縛亦不縛不脫令眾生得不縛不脫名之為滅為調伏故不盡有為得解脫故名為滅病。",
        "source": "X18n0338_027:0691a23_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "是名盡無盡解脫法門汝等當學。",
        "translation": "This is called the Dharma gate of complete and inexhaustible liberation, which you should study.",
        "source": "X18n0338_027:0692c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三結如文。",
        "translation": "The third conclusion is as explained in the text.",
        "source": "X18n0338_027:0693a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時彼諸菩薩聞說是法皆大歡喜以眾妙華若干種色若干種香散徧三千大千世界供養於佛及此經法并諸菩薩已稽首佛足歎未曾有言釋迦牟尼佛乃能於此善行方便言已忽然不現還到彼國。",
        "translation": "When those bodhisattvas heard this teaching, they all rejoiced greatly and spread a multitude of marvelous flowers of various colors and various fragrances throughout the 3,000 great one-thousand worlds to make offerings to the Buddha, this sūtra, and the Dharma, and the bodhisattvas bowed their heads at the Buddha's feet and praised him for saying, \"Never has it been possible for Śākyamuni Buddha to skillfully practice this method.",
        "source": "X18n0338_027:0693a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三彼菩薩聞此方便化他權實之法歡喜解悟敬禮辭別還於本土上文初請法時慚愧悔過者悔於化他權實未明故懺悔除蓋請於勝法即得開解三種權實具足圓滿此是他土來此得益也若是此土悔過得益者如身子等食香飯已於法華中慚愧尅責自悔過咎只是悔過未見行權實既尅責覆蓋得除於法華中開佛知見入於佛慧受記成道自行化他三種權實宛然圓滿即是此土蒙他得益也二土雙遊垢淨不二成就圓滿雙觀之義究竟在此(云云)。",
        "translation": "The third bodhisattva who hears this method of transforming others into the expedient truth rejoices, understands, honors, and says goodbye and returns to his native land. The above-mentioned person who repents in shame when first requesting the Dharma repents that the expedient truth of transforming others hasn't been explained and therefore repents and removes the obstruction and immediately attains enlightenment about the three expedient truths, which are complete and perfect.",
        "source": "X18n0338_027:0693a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩羅詰經文疏卷第二十七",
        "translation": "Vimalakīrti-nirdeśa-sūtra: Commentary on the Sutra of Vimalakīrti-nirdeśa-sūtra, Volume 27",
        "source": "X18n0338_027:0693a17_0",
        "is_bad_quality": false
    }
]