[
    {
        "source_sentence": "維摩經疏第三",
        "translation": "Third Commentary on the Vimalakīrti Sutra",
        "source": "X19n0343_003:0186a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "胡　吉藏　撰",
        "translation": "Compiled by Hu Jizang",
        "source": "X19n0343_003:0186a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩品第四",
        "translation": "The Fourth Chapter of the Bodhisattva Sutra",
        "source": "X19n0343_003:0186a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩品第四所以有此品來者命問疾凡命兩眾第一命聲聞已竟今即第二命菩薩眾也所以前命聲聞今命菩薩者可有數義一者欲顯淨名文殊二人之德若止命聲聞不堪未足為奇之人法不及菩薩是故聲聞不堪未足顯二人之德今次命菩薩亦不堪始顯二人之德也問何故顯淨名德耶解云欲令人伏其化道故顯其德然此二人竝絕聲聞菩薩此之二聞答竝是不思議文殊不思議之問淨名不思議之答文殊不思議之賓淨名不思議之主此問答賓主皆不思議也然復有四句一者無得問有得答二者有得問無得答三者有得問有得答四者無得問無得答廣作(云云)此之四句三句不成問答唯無得問無得答成問答如中論五陰品云依空問答成問答又大經云無所得者有四無礙有所得者無四無礙故無得成問答也又所以前命聲聞今命菩薩者欲顯釋迦一化方便至論道門未曾三一未曾大小故初成道常樂嘿然不樂說法諸法寂滅相不可以言宣故未曾大小為緣故無名相中假名相說大說小緣聞大小成有得大有得小是故淨名破此大小雖復破大小不失大小方便大小無大小無大小而大小舉佛影譬(云云)又若但命聲聞不命菩薩即不窮淨名權智之方便居士現疾意為是故今命菩薩問聲聞中定有大弟子數菩薩亦有定數不解云聲聞有定數菩薩無定數責何意耶解云聲聞菩薩因緣數無數因緣也難若數無數因緣即應有弟子不弟子因緣解云我就弟子中判大小數無數因緣也難若使此中命問疾有數無數者如前列眾中亦應有數無數因緣解云前列眾不定數今十大弟子是定數故不例責何意菩薩無定數解云聲聞有限菩薩無限故聲聞有定數菩薩無定數難若爾聲聞有位菩薩無位解云例菩薩無量數菩薩無量位難菩薩無量位說有十地菩薩無量應有十數未解(云云)今從所遣菩薩為名故云菩薩品就此中為二第一別遣四菩薩第二總遣八千如前命弟子也今別遣四人者略攝盡何以故此中有道有俗在家出家深行淺行攝盡也此中遣四人即為四今第一命彌勒者彌勒是補處菩薩中極前身子聲聞中[宋-木+取]故前命身子今彌勒是菩薩中極故前命彌勒也。",
        "translation": "The fourth aspect of the bodhisattva chapter is why there's this chapter which orders the questioning and the hastening of the appointment of two congregations. The first order of the śrāvaka and the second order of the bodhisattva congregations is now complete.",
        "source": "X19n0343_003:0186a04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "於是佛告彌勒菩薩汝行詣維摩詰問疾。",
        "translation": "The Buddha then told Maitreya, the bodhisattva, to go to Vimalakīrti and ask about his illness.",
        "source": "X19n0343_003:0186b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就此文為二第一命第二辭今即命也彌勒是南天竺婆羅門種彌勒此云慈氏字阿逸多阿逸多此云無勝亦云莫勝位行莫過之者故云莫勝也。",
        "translation": "In this text, there are two things: the first is life, the second is speech, and the present is life. Maitreya is a Brahmin from the southern India, and Maitreya is the word for compassionate, Ajita is the word for unsurpassed, and Mojita is the word for unsurpassed in terms of status and conduct.",
        "source": "X19n0343_003:0186b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒白佛言世尊我不堪任詣彼問疾。",
        "translation": "Maitreya said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_003:0186b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒白佛下第二辭不堪為三標釋結今即標也。",
        "translation": "Maitreya then said to the Buddha, \"The second expression, 'incapable,' is an explanation of the three labels, which are now the labels.",
        "source": "X19n0343_003:0186c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔為兜率天王及其眷屬說不退轉地之行。",
        "translation": "\"Why is that? Remember when I taught the king of Tuṣita Heaven and his retinue about the practice of the ground of irreversibility?",
        "source": "X19n0343_003:0186c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言彌勒世尊授仁者記一生當得阿耨多羅三藐三菩提。",
        "translation": "Vimalakīrti then came to me and said, \"Bhagavān Maitreya has granted this layman the assurance that he'll attain unsurpassed, correct enlightenment in his lifetime.",
        "source": "X19n0343_003:0186c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為用何生得受記乎過去耶未來耶現在耶。",
        "translation": "For what birth will he receive that assurance, past, future, or present?",
        "source": "X19n0343_003:0186c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若過去生過去生已滅若未來生未來生未至若現在生現在生無住如佛所說比丘汝今即時亦生亦老亦滅。",
        "translation": "If there was past birth, past birth has ceased, future birth, future birth has yet to come, or present birth, present birth has no abiding, as the Buddha explains, monks, now you are also born, aged, and ceased at the same time.",
        "source": "X19n0343_003:0186c05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以無生得受記者無生即是正位於正位中亦無受記亦無得阿耨多羅三藐三菩提云何彌勒受一生記乎為從如生得受記耶為從如滅得受記耶若以如生得受記者如無有生若以如滅得受記者如無有滅一切眾生皆如也一切法亦如也眾聖賢亦如也至於彌勒亦如也。",
        "translation": "If it's because there's no birth that you can receive the reporters, then no birth is the right status, and in the right status there's neither assurance of birth nor attainment of supreme perfect enlightenment.",
        "source": "X19n0343_003:0186c07_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彌勒得受記者一切眾生亦應受記所以者何夫如者不二不異。",
        "translation": "If Maitreya attains reciprocity, all sentient beings should also receive assurance of their attainment. Why is that? A thusness is neither two nor different.",
        "source": "X19n0343_003:0186c13_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彌勒得阿耨多羅三藐三菩提者一切眾生皆亦應得所以者何一切眾生即菩提相。",
        "translation": "If Maitreya attains supreme perfect enlightenment, all sentient beings should attain it, too. Why is that? All sentient beings are the mark of perfect enlightenment.",
        "source": "X19n0343_003:0186c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彌勒得滅度者一切眾生亦當滅度所以者何諸佛知一切眾生畢竟寂滅即涅槃相不復更滅。",
        "translation": "If Maitreya attains extinction, all sentient beings will also be extinguished. Why is that? The buddhas know that all sentient beings are ultimately tranquil and extinct, which is the mark of nirvāṇa and doesn't cease again.",
        "source": "X19n0343_003:0186c16_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故彌勒無以此法誘諸天子實無發阿耨多羅三藐三菩提心者亦無退者。",
        "translation": "Therefore, Maitreya didn't use this teaching to entice gods and sons. There's really no one who arouses the mind of unsurpassed, correct enlightenment, and there's no one who backslides.",
        "source": "X19n0343_003:0186c18_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何下第二釋不堪為二第一出被呵之由第二明能呵之旨今即第一出被呵之由所以被呵者彌勒為兜率天王說不退轉地之行故被呵者諸天已著欲彌勒復為說不退之法明我已得受記當得菩提見有能得之人所得之法此即重增諸天子之倒其本著五欲即是愛到今復為其說有能得人所得法復增其見具足愛見是故被呵也兜率天王餘處云那兜率天王那即其性也不退轉地行者即三不退故云不退也。",
        "translation": "Therefore, why is it that the second explanation of the unbearable is two: first, it gives the reason for being heckled; second, it explains the purpose of being heckled; and now, the first reason for being heckled.",
        "source": "X19n0343_003:0186c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來下第二明能呵之旨為二第一破得受記第二破得菩提彌勒謂始得無生之記終即成無上道是故居士呵此二條也又前破得記即破因欲破菩提即破果因果一雙又前破得記即破人次破得菩提即破法謂有能得記之人菩提所得之法也就初得記中有三門責第一就生門責第二就無生門責第三就如門責。",
        "translation": "The first one is to refute the assurance of receiving assurance, and the second one is to refute the attainment of enlightenment. Maitreya said, \"The first one refutes the assurance of attaining birthlessness, and the final one is the attainment of the unsurpassed way.",
        "source": "X19n0343_003:0187a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今即第一就生門責為二第一前定三開第二結三難今即定三開前牒次定授仁者記一生得菩提即牒也言生者即是三生雖三生只是一生言三生者閻浮提是一生兜率天二生後生人間作佛即三生除今閻浮提生何者此生已過故不取上生天亦不取但取下生人間即作佛取此一生故云一生也為用何生得受記過去耶下第二定開此如中論中論用三時責有得稟教之人今居士用三世責有得彌勒也若過去生過去生已滅下第二結三難若過去過去已滅即無記若未來未來未有亦無記現在不住故無得記也如佛所說者釋現在住所以不釋過未二世者明過未二世麤顯故不須釋現在細蜜謂言有住是故徧釋無有住時纔言彌勒彌勒已滅誰受記者佛亦爾纔授即滅誰授以無住故無受無授也。",
        "translation": "The first one is to assault on the gate of birth, which is twofold. The first one is to define the three opening statements, and the second one is to conclude the three difficulties. The first one is to define the three opening statements, and the second one is to define the granting of the renunciant's assurance of attaining enlightenment in one lifetime, which is to define.",
        "source": "X19n0343_003:0187a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以無生得記者下第二就無生門責彼謂生是有為三世中求不得今無生中應得記所以更就無生中責也明向求三世若得可有無生既無其三世生何處有無生耶又案文破明無生即正位正位中無人無法無記不記豈有得記又案語破既云無生即無得無記故云無生即正位正位無受記等也。",
        "translation": "If the second aspect of attaining the reporter because of nonproduction is that birth is something that can't be attained in the three worlds, then in nonproduction there should be assurance of assurance that there's no birth. The text also refutes the idea that nonproduction is the right condition, that there's no one in the right condition, that there's no assurance of assurance, and that there's no assurance of assurance that there's no assurance of assurance.",
        "source": "X19n0343_003:0187b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為從如生下第三就如門責為二第一難第二竝今即難也問如無有生如無有滅今云何難云為從如生得受記耶解云彼謂體如故法忍生體如故煩惱滅法忍煩惱皆不離如法忍若生即是如生煩惱滅即如滅是故今難明如無生滅如無生故法忍不生如無有滅故煩惱不滅也一切眾生皆如也下第二設竝前定次竝今即定有四句也若彌勒得受記者下第二正設三竝第一就得記竝次就智竝第三就斷竝前一就因竝後二就果竝即因果智斷兩雙也今即就得記竝明彌勒亦如彌勒得記一切眾生得記一切眾生亦如眾生得記及結諸難(云云)若彌勒得阿耨下第二就果竝也若彌勒滅度下第二就斷竝例前可尋是故彌勒無以此法誘諸天子者此即結呵彌勒明菩提之道無得無失無進汝云何為說不退之行即不可以不退誘諸天子也若見退不退即分別見也。",
        "translation": "In order to follow thusness arising, the third aspect of the rebuke is two first difficulties and the second is the present difficulty. The question is, \"If there's no arising and there's no ceasing, then why is it difficult to say that it's from thusness arising that one obtains assurance of assurance?\" He explains that because the essence is thusness, Dharma acceptance is produced, and because the essence is thusness, affliction ceases, and because Dharma acceptance and affliction are not separate from thusness arising, affliction ceases, and thusness ceases.",
        "source": "X19n0343_003:0187b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒當令此諸天子捨於分別菩提之見所以者何菩提者不可以身得不可以心得寂滅是菩提滅諸相故不觀是菩提離諸緣故不行是菩提無憶念故斷是菩提捨諸見故離是菩提離諸妄想故障是菩提障諸願故不入是菩提無貪著故順是菩提順於如故住是菩提住法性故至是菩提至實際故不二是菩提離意法故等是菩提等虗空故無為是菩提無生住滅故知是菩提了眾生心行故不會是菩提諸入不會故不合是菩提離煩惱習故無處是菩提無形色故假名是菩提名字空故如化是菩提無取捨故無亂是菩提常自靜故善寂是菩提性清淨故無取是菩提離攀緣故無異是菩提諸法等故無比是菩提無可喻故微玅是菩提諸法難知故世尊維摩訶說是法時二百天子得無生法忍。",
        "translation": "Maitreya will cause these sons of gods to abandon the discriminating view of enlightenment. Why is that? Bodhi doesn't obtain itself, doesn't acquire itself, and doesn't become tranquil.",
        "source": "X19n0343_003:0187c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I don't presume to go there to ask about their illnesses.",
        "source": "X19n0343_003:0187c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彌勒當令諸天捨下第二破得菩提之見即呵果見也此中讚菩提即是破菩提見然破有二種一者逈破二者申破言逈破者經有一豪有所得之法逈而破之申破者申無所得之法斷常病破經論具此二意論中多逈破經中多申破何者論為鈍根故逈破不得為立立即不洗經中為利根故申因緣法斷常自壞也今此中明正法菩提即是破有所得菩提也言當令捨分別菩提見者明菩提之道無得無失畢竟清淨而彌勒分別有能得人所得法等故今勸捨也所以者何下釋勸捨分別故云不可身心得也寂滅是菩提者寂滅一切見故云寂滅是菩提也鄣是菩提鄣一切願故者明此菩提能遮一切煩惱有所得之見遮一切求願取著之心畢竟不得起故一家讀法華唯有一門而復狹小明一豪不得入故云狹小也所餘諸句可尋次二百天子得無生如文也(云云)。",
        "translation": "Maitreya will cause the gods to abandon the second view of attaining enlightenment, which is to criticize the view of fruition. Here, praising enlightenment is to abandon the view of enlightenment, but there are two kinds of abandonment: first, crude abandonment and second, denunciation abandonment.",
        "source": "X19n0343_003:0187c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次第二命光嚴童子問前聲聞眾中第一命身子次命目連奉左右面弟子禪定智慧次第如前今命菩薩前彌勒今命光嚴有何次第耶解云有次第無次第何得一向責其次第有次第者如前身子目連無次第者如今彌勒次光嚴也無次第而論次第者前命彌勒即是命出家菩薩今命光嚴即命在家今欲以此四菩薩攝一切菩薩不出出家之與在家命彌勒不堪即一切出家墮彌勒不堪中今命光嚴不堪即一切在家墮光嚴不堪中前命彌勒即是出家今命光嚴即是在家道俗次第也又前命彌勒即是補處窮深菩薩今命光嚴即是初行極淺菩薩前彌勒不堪一切深行墮彌勒不堪中今命光嚴不堪一切淺行墮光嚴中括前該後即是淺深次第又前彌勒欲顯破有所得受記今命光嚴欲顯破有所得座道場何故前呵受記今呵道場耶解云要得前記後座道場又是因緣前呵受記今破道場也就道場中凡破二種道場之見一者謂東天竺國摩伽堺元吉樹下如來起道之處謂為道場何但釋迦如此一切諸佛竝然故法華云大通智勝佛十劫座道場耳目之徒莫不言此為道場也二者如即世凡夫誰能至摩伽陀國元吉樹下之道謂寺舍殿堂中縣繒燈明香華供養之處即為道場是故淨名寄光嚴破此二見何者是道場耶道場者成起於道名為場元吉樹下若為成起於道耶上有樹下有地若為成起於道即又縣繒番蓋復若為成起於道如此等皆非道場今云道場者直以無得萬行為道場以此無得萬行能成起於道故名道場也又只此心即是道場行住座臥常與道場俱眾生不知而欲遠求於道場是故被呵也。",
        "translation": "The second order, Guang Yan Shen, asked the śrāvakas, was the first order, the body, the second order, Maudgalyāyana, the disciples on the left and right sides of the body, meditation, wisdom, and sequence as before.",
        "source": "X19n0343_003:0188a10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "佛告光嚴童子汝行詣維摩詰問疾。",
        "translation": "The Buddha told Boy Guang-yen that you should go to Vimalakīrti to ask about his illness.",
        "source": "X19n0343_003:0188b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文段為論如前命如文。",
        "translation": "The passage was discussed as above, and the instructions were as explained above.",
        "source": "X19n0343_003:0188b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "光嚴白佛言世尊我不堪任詣彼問疾。",
        "translation": "Guang-yen said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_003:0188b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白佛言下辭不堪標釋結如文。",
        "translation": "He said to the Buddha, \"The next part of my speech is inappropriate,\" and the conclusion is as explained in the text.",
        "source": "X19n0343_003:0188b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔出毗耶離大城時維摩詰方入城我即為作禮而問言居士從何所來答我言吾從道場來我問道場者何所是。",
        "translation": "\"Why is that? Remembering that I had left the great city of Vaiśālī in the past when Vimalakīrti had just entered the city, I made obeisance and asked, 'Sir, where have you come from?' I was told, 'I've come from the site of the path.' I asked, 'What is the site of the path?'",
        "source": "X19n0343_003:0188b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰直心是道場無虗假故發行是道場能辦事故深心是道場增益功德故菩提心是道場無錯謬故布施是道場不望報故持戒是道場得願具故忍辱是道場於諸眾生心無礙故精進是道場不懈怠故禪定是道場心調柔故智慧是道場現見諸法故慈是道場等眾生故悲是道場忍疲苦故喜是道場悅樂法故捨是道場憎愛斷故神通是道場成就六通故解脫是道場能背捨故方便是道場教化眾生故四攝是道場攝眾生故多聞是道場如聞行故伏心是道場正觀諸法故三十七品是道場捨有為法故四諦是道場不誑世間故緣起是道場無明乃至老死皆無盡故諸煩惱是道場知如實故眾生是道場知無我故一切法是道場知諸法空故降魔是道場不傾動故三界是道場無所趣故師子吼是道場無所畏故力無畏不共法是道場無諸過故三明是道場無餘礙故一念知一切法是道場成就一切智故如是善男子菩薩若應諸波羅蜜教化眾生諸有所作舉足下足當知皆從道場來住於佛法矣說是法時五百天人皆發阿耨多羅三藐三菩提心。",
        "translation": "Answer, \"Straightforward mind is the site of the path, which is neither conventional nor empty. Arising practice is the site of the path, which accomplishes tasks.",
        "source": "X19n0343_003:0188b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I don't presume to visit them to ask about their ailments.",
        "source": "X19n0343_003:0188c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何下第二釋不堪今即出被呵之由明光嚴止出城維摩詰正入城兩人相遇光嚴即作禮問居士從何處來所以作禮者光嚴童子年少故為作禮也其問何所來淨名答我從道場來也光嚴即問何者是道場維摩答曰直心是也問為謟佞之者為曲心朴素質直為直心為不爾耶解云亦不取此為直心又問為取十惡為回心十善為直心不爾耶解云亦非此乃凡中自論曲直於聖道竝回此乃回中回直惡中善惡故亦非直心也又問為毗曇見四諦理成論會一滅諦明三無學人同會滅諦同得無生以為直心為不爾解云此亦非此乃是二乘生滅心故大經云聲聞辟支佛耶回見何故不得菩提即回見寧得菩提又有大乘亦名回見故云有所得者名無明二十五有故是回見今言直心者以無得無依正直之觀名直心離一切有所得見名曰直心此之直心即成佛之由起道之本故云直心是道場也無虗假故者無一切有所得虗妄斷常故云無虗假也發行是道場能辨事故者無所得正觀所起之行乃得成行如般若中所明以般若心行於萬行乃成於行以行成故能辨無上之果故云發行是道場辨事故也深心是道場者上明直心直心有二種一者淺直心二者深直心是故明是深也菩提心是道場者上雖明直深心此心此心未必大是故次明大心即菩提心也次舉六度萬行等為道場可尋言忍辱是道場心無礙故者明心無瞋若有礙即有瞋若有瞋即破一切事故菩薩戒中瞋為重罪也善男子菩薩若應諸波羅蜜教化眾生舉足下足皆從道場者明菩薩以般若心舉足下故舉足下足皆是般若故大品云不見產業之事非般若是故菩薩般若心作一切事故一切皆般若也若顛倒心作一切事故一切事皆顛倒何者見身心能作一切事為所作見有去來等是一切故皆是顛倒若以正觀見者去來等故皆是般若皆是道場也次時眾悟道如文。",
        "translation": "所以者何下第二釋不堪今即出被呵之由明光嚴止出城維摩詰正入城兩人相遇光嚴即作禮問居士從何處來所以作禮者光嚴童子年少故為作禮也其問何所來淨名答我從道場來也光嚴即問何者是道場維摩答曰直心是也問為謟佞之者為曲心朴素質直為直心為不爾耶解云亦不取此為直心又問為取十惡為回心十善為直心不爾耶解云亦非此乃凡中自論曲直於聖道竝回此乃回中回直惡中善惡故亦非直心也又問為毗曇見四諦理成論會一滅諦明三無學人同會滅諦同得無生以為直心為不爾解云此亦非此乃是二乘生滅心故大經云聲聞辟支佛耶回見何故不得菩提即回見寧得菩提又有大乘亦名回見故云有所得者名無明二十五有故是回見今言直心者以無得無依正直之觀名直心離一切有所得見名曰直心此之直心即成佛之由起道之本故云直心是道場也無虗假故者無一切有所得虗妄斷常故云無虗假也發行是道場能辨事故者無所得正觀所起之行乃得成行如般若中所明以般若心行於萬行乃成於行以行成故能辨無上之果故云發行是道場辨事故也深心是道場者上明直心直心有二種一者淺直心二者深直心是故明是深也菩提心是道場者上雖明直深心此心此心未必大是故次明大心即菩提心也次舉六度萬行等為道場可尋言忍辱是道場心無礙故者明心無瞋若有礙即有瞋若有瞋即破一切事故菩薩戒中瞋為重罪也善男子菩薩若應諸波羅蜜教化眾生舉足下足皆從道場者明菩薩以般若心舉足下故舉足下足皆是般若故大品云不見產業之事非般若是故菩薩般若心作一切事故一切皆般若也若顛倒心作一切事故一切事皆顛倒何者見身心能作一切事為所作見有去來等是一切故皆是顛倒若以正觀見者去來等故皆是般若皆是道場也次時眾悟道如文。",
        "source": "X19n0343_003:0188c18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○第三命持世菩薩見出家菩薩前第一彌勒是出家菩薩後善德是在家菩薩所以爾者前彌勒出家光嚴在家雖復攝盡然攝大略是故舉出家兩人在家兩人絓出家菩薩隨彌勒持世攝絓在家菩薩隨光嚴善德中攝前隻攝今即雙攝此之四人道俗相簡即其次也又前呵彌勒顯有所得受記非受記次呵光嚴顯有得道場非道場今呵持世顯有所得降魔非降魔此之三條菩薩極行是故淨名破此三種明有所得記非記道場非道場降魔非降魔何者識魔可降魔既不識魔翻為魔所降以降本降魔同菩薩今菩薩番同魔何以故持世畏魔故所以魔得持世便故經云譬人畏時非人得其便故持世被魔降若無所得菩薩即能降魔何以故以識魔故大品云菩薩見四魔來著實際中只體魔即實際所以仁王云煩惱即菩提也又有所得不能降魔者只有所得是魔何能降魔未見魔能降魔故有所得不能降魔無得乃能降伏耳。",
        "translation": "○第三命持世菩薩見出家菩薩前第一彌勒是出家菩薩後善德是在家菩薩所以爾者前彌勒出家光嚴在家雖復攝盡然攝大略是故舉出家兩人在家兩人絓出家菩薩隨彌勒持世攝絓在家菩薩隨光嚴善德中攝前隻攝今即雙攝此之四人道俗相簡即其次也又前呵彌勒顯有所得受記非受記次呵光嚴顯有得道場非道場今呵持世顯有所得降魔非降魔此之三條菩薩極行是故淨名破此三種明有所得記非記道場非道場降魔非降魔何者識魔可降魔既不識魔翻為魔所降以降本降魔同菩薩今菩薩番同魔何以故持世畏魔故所以魔得持世便故經云譬人畏時非人得其便故持世被魔降若無所得菩薩即能降魔何以故以識魔故大品云菩薩見四魔來著實際中只體魔即實際所以仁王云煩惱即菩提也又有所得不能降魔者只有所得是魔何能降魔未見魔能降魔故有所得不能降魔無得乃能降伏耳。",
        "source": "X19n0343_003:0189b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告持世菩薩汝行詣維摩詰問疾。",
        "translation": "The Buddha told the World Preserver Bodhisattva, \"Do you practice visiting Vimalakīrti to ask about illnesses?",
        "source": "X19n0343_003:0189b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今即第一命持世也。",
        "translation": "Now, this is the first life of Zhi Shi.",
        "source": "X19n0343_003:0189b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世白佛言世尊我不堪任詣彼問疾。",
        "translation": "Zhi Shi said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_003:0189c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔住於靜室時魔波旬從萬二千天女狀如帝釋鼓樂絃歌來詣我所與其眷屬稽首我足合掌恭敬於一面立我意謂是帝釋而語之言善來憍尸迦雖福應有不當自恣當觀五欲無常以求善本於身命財而修堅法即語我言正士受是萬二千天女可備掃灑我言憍尸迦無以此非法之物要我沙門釋子此非我宜。",
        "translation": "Why is that? Remember, when I was staying in that quiet room, Māra Pāpīyān came to me with 12,000 goddesses who looked like Tīrṣa and sang with music and strings, and he and his retinue bowed their heads at my feet, put their palms together in respect, and stood to one side. I said, \"Good, Kauṇḍinya, although there's merit, you shouldn't behave yourself.",
        "source": "X19n0343_003:0189c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "持世白佛下辭不堪即標不堪也所以者何下第二釋不堪今第一被呵之由持世爾時靜室默然或觀無常或思禪定魔即及身為帝釋惱亂持世所以變身為帝釋者帝釋是佛天上檀越得初果人必無惱亂佛法之事故變為帝釋持世謂是帝釋語云善來為其說法言雖福有不當自恣者明汝過去修福今得五欲果報此果報會當破壞會應無常不應五欲自恣也於身命財而修堅法者堅即是三堅明世間身死晚命無常財五家若忘身修行棄捨財寶後身命財堅而不壞故云三堅法也即語我言受萬二千天女者明持世墮於魔胃何者汝親勸我令修三堅法捨於財物我今奉命而捨若不受即違言失若受即便破戒今既勸其捨而不受即違言失也問持世是何位人不識魔解云是完身菩薩未得五通故不識設得五通不入定亦不識也持世所以不受者不能受而無染不能如悉達之受故不受也。",
        "translation": "He said, \"Although there's an improper self-indulgence in merit, the second explanation below is an improper explanation of the reason why he was heckled in the first place.",
        "source": "X19n0343_003:0189c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言未訖時維摩詰來謂我言非帝釋也是為魔來嬈固汝耳即語魔言是諸女等可以與我如我應受魔即驚懼念維摩詰將無惱我欲隱形去而不能隱盡其神力亦不得去即聞空中聲曰波旬以女與之乃可得去魔以畏故俛仰而與爾時維摩詰語諸女言魔以汝等與我今汝皆當發阿耨多羅三藐三菩提心即隨所應而為說法令發道意復言汝等已發道意有法樂可以自娛不應復樂五欲樂也天女即問何謂法樂答言樂常信佛樂欲聽法樂供養眾樂離五欲樂觀五陰如怨賊樂觀四大如毒蛇樂觀內入如空聚樂隨護道意樂饒益眾生樂敬養師樂廣行施樂堅持戒樂忍辱柔和樂勤集善根樂禪定不亂樂離垢明慧樂廣菩提心樂降伏眾魔樂斷諸煩惱樂淨佛國土樂成就相好故修諸功德樂莊嚴道場樂聞深法不畏樂三脫門不樂非時樂近同學樂於非同學中心無恚礙樂將護惡知識樂親近善知識樂心喜清淨樂修無量道品之法是為菩薩法樂於是波旬告諸女言我欲與汝俱還天宮諸女言以我等與此居士有法樂我等甚樂不復樂五欲樂也魔言居士可捨此女一切所有施於彼者是為菩薩維摩詰言我已捨矣汝便將去令一切眾生得法願具足於是諸女問維摩詰我等云何止於魔宮維摩詰言諸姉有法門名無盡燈汝等當學無盡燈者譬如一燈然百千燈冥者皆明明終不盡如是諸姉夫一菩薩開導百千眾生令發阿耨多羅三藐三菩提心於其道意亦不滅盡隨所說法而自增益一切善法是名無盡燈也汝等雖住魔宮以是無盡燈令無數天子天女發阿耨多羅三藐三菩提心者為報佛恩亦大饒益一切眾生爾時天女頭面禮維摩詰足隨魔還宮忽然不現世尊維摩詰有如是自在神力智慧辯才。",
        "translation": "Before he finished speaking, Vimalakīrti addressed me, saying, \"Not Tilde! This is Māra come to bully your ears.\" He then said to Māra, \"You women can accept me as I should accept it.\" Māra then became frightened and thought, \"Vimalakīrti will be unconcerned.\" He wanted to hide his form and go away, but he couldn't hide it, and he couldn't go because of his powers.",
        "source": "X19n0343_003:0190a08_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I didn't presume to go there to ask about his illness.",
        "source": "X19n0343_003:0190b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言未訖下第二維摩呵責持世不受之言未訖淨名即來呵持世有二失一則不識真偽邪正二勸捨而不能受故失也即語魔下前呵持世今伏波旬語魔言汝可與我我宜應受持世是出家不得受我在家人應得受魔進退亦二失若與即失女若不與則違前捨言所以怖懼欲隱形去盡其神力不能得去前則言伏今則威伏前則口伏今則意伏前口屈今意伏意屈何者神力欲去淨名神力制不能得去即意伏也空中聲曰動捨女乃得去魔既神力不及故捨女也魔所以畏者非但失女復恐被五係縛之畏也次維摩受女令其發心為其說法也有法樂者女人之情多存於樂雖發道意恐猶樂五欲樂故法樂代之也天女問何謂法樂請問法樂之相答曰樂常信佛者明三寶眾善之基是故前說所餘如文言樂三脫門不樂非時者三脫即空無相願不樂非時者明二乘非是得果時故不樂也於是波旬語諸女言前既威力不能得去今更誘諸女欲還天宮次諸女不肯去者一則已屬他不得去二則樂法不肯去也魔言居士可捨此女者前來至此二過欲去今第二求首居士令捨女求首者請也汝既是菩薩應捨此女菩薩之體尚不能惜自妻子豈恡佗女故云應捨於彼者為菩薩也維摩言我已捨矣維摩捨女問菩薩既取今何故捨若捨前不應取解云有數意一者欲明菩薩之道威恩竝行前即威取今即恩捨明菩薩不可思議自在之力欲取即取欲捨即捨隨意無礙欲令一切有得菩薩及以聲聞學此不思議自在之道二者所以前取今捨者前明菩薩堪為福田今明能為施主上明一切有得及以二乘竝非福田一豪不得受唯無得菩薩是福田堪受也今亦爾有得二乘不能為施主唯菩薩為施主也又前居士威取者不如世人威通取為五欲樂今菩薩取不為五欲樂菩薩所以取者為化彼天女令得法樂之益故取化意所以捨也問取天女天女得益魔大苦惱何得取耶解云正欲降魔令伏菩薩之道魔常不伏菩薩今則伏於菩薩之道即益也汎解魔為何業所成餘處出云昔日經作一無遮會故得自在天宮果報所以菩薩座道場時魔戲今魔觀過去因汝過去止一無遮施菩薩無量劫施故非類也又前取女今捨女者取即然燈捨即傳燈令其傳化故捨若不捨唯此女得益不能得廣化一切男女今欲廣化於天宮是捨也問何故不玄化而取化耶解云女有三從之義若不取屬己即化道不便以屬己故即從維摩化也又前取今以捨者明菩薩行願具足故取女即是菩薩行當捨時即發願即菩薩願何者魔既失女願女今居士捨還即願滿今菩薩因發願願一切眾生得法願滿足有此等利益故菩薩取而今捨此之取捨皆為利緣開道故前歎云其見聞者無不蒙益諸有所作亦不唐捐也於是諸女問居士云何止魔宮天女本樂五欲今聞法樂今還魔宮以何為業故問也然此天女不復尊敬於魔而反咲魔魔者外道云華箭佛法云殺人慧命故云殺者也今亦名極惡而不復敬彼是故云惡也次居士為說還宮之法即無盡之法亦傳化之意顯此如文可尋也。",
        "translation": "The second Vimalakīrti who rebuked the Lokêśvararāja for not accepting his words before they were fulfilled was the second Vimalakīrti who rebuked the Lokêśvararāja for having two failures: one was not knowing what was true and false, the other was not accepting the admonition to abandon the wrong and the other was not accepting it because it was said to the Māra that the former rebuked the Lokêśvararāja and the second was rebuking the Māra that it was appropriate for the Lokêśvararāja to accept the admonition that the renunciant could not accept the admonition that I, as a member of the family, should be able to accept the Māra's advance and retreat were also two failures.",
        "source": "X19n0343_003:0190b15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○次第四命善德菩薩者第一彌勒是出家次光嚴是在家第三持世是出家今第四善德是在家一切菩薩不可具舉列此四人略攝一切菩薩若出家菩薩隨彌勒持世攝若在家菩薩隨光嚴善德中攝也問何故不兩出家相逐兩在家相逐命彌勒即命持世命光嚴即命善德而簡出者耶解云前命出家不堪恐在家應堪次即命命復不堪恐出家堪即命之故簡出也又所以有此文來者前第一呵彌勒明有得受記非受記次明命光嚴明有所得道場非道場次第三持世明有得不識魔不能降魔今第四命善德有所得布施不成布施此之四條是菩薩要行是故淨名呵此四條顯無所得也又前極深今窮淺始終深淺攝盡也。",
        "translation": "○Subsequently, the fourth life of the good bodhisattva is the first Maitreya who is a renunciant, the second Vairocana who is at home, the third Vairocana who is a renunciant, and the fourth good virtue who is at home, all bodhisattvas cannot be enumerated.",
        "source": "X19n0343_003:0191b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告長者子善德汝行詣維摩詰問疾。",
        "translation": "The Buddha told the elder son, Sunetra, that you should go to Vimalakīrti to ask about his illness.",
        "source": "X19n0343_003:0191b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就文為二今第一命善德問疾也。",
        "translation": "There are two ways of putting this in context, and the first is to ask Shande about his illness.",
        "source": "X19n0343_003:0191b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善德白佛言世尊我不堪任詣彼問疾。",
        "translation": "Sunetra said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_003:0191b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔自於父舍設大施會供養一切沙門婆羅門及諸外道貧窮下賤孤獨乞人期滿七日。",
        "translation": "Why is that? Remember that in the past, I set up a great almsgiving at my father's house to support all the ascetics, priests, and non-Buddhists who were poor, humble, and orphaned, and it lasted seven days.",
        "source": "X19n0343_003:0191b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善德白佛言下第二辭不堪標釋結今標不堪也所以者何下第二釋不堪為二今第一被呵之由所以被呵者於父舍施會是故被呵也言自於父舍施會者有二義一者欲簡淨財自有非法財施今善德父舍施其財此是淨施故云自於父舍施也二者父祖相承作於長會故云自於父舍也此會三年聚財七日布施竪幢玄番四方三田皆集悉平等施之言三田者一悲田二敬田三亦敬亦悲田悲田者一切貧病眾生也敬田者即羅漢父母三寶亦悲亦敬者病羅漢僧老病父母也外國施有二種一者依四違陀謂歌儛施祠祀施等二者直示行施今之善得非外道法施直示而施也又國所以作此施者欲求梵天福自在天福如前明魔作一無遮施得自在天果與菩薩敵也。",
        "translation": "The second reason why he was heckled was because he was heckled at the father's house almsgiving. The first reason why he was heckled was because he was heckled at the father's house almsgiving. The person who says he gave alms to his father's house has two meanings.",
        "source": "X19n0343_003:0191b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來入會中謂我言長者子夫大施會不當如汝所設當為法施之會何用是財施會為我言居士何謂法施之會法施會者無前無後一時供養一切眾生是名法施之會曰何謂也謂以菩提起於慈心以救眾生起大悲心以持正法起於喜心以攝智慧行於捨心以攝慳貪起檀波羅蜜以化犯戒起尸羅波羅蜜以無我法起羼提波羅蜜以離身心相起毗棃耶波羅蜜以菩提相起禪波羅蜜以一切智起般若波羅蜜教化眾生而起於空不捨有為法而起無相示現受生而起無作護持正法起方便力以度眾生起四攝法以敬事一切起除慢法於身命財起三堅法於六念中起思念法於六和敬起質直心正行善法起於淨命心淨歡喜起近賢聖不憎惡人起調伏心以出家法起於深心以如說行起於多聞以無諍法起空閑處趣向佛慧起於宴坐解眾生縛起修行地以具相好及淨佛土起福德業知一切眾生心念如應說法起於智業知一切法不取不捨入一相門起於慧業斷一切煩惱一切障礙一切不善法起一切善業以得一切智慧一切善法起於一切助佛道法如是善男子是為法施之會若菩薩住是法施會者為大施主亦為一切世間福田世尊維摩詰說是法時婆羅門眾中二百人皆發阿耨多羅三藐三菩提心我時心得清淨歎未曾有稽首禮維摩詰足即解瓔珞價直百千以上之不肯取我言居士願必納受隨意所與維摩詰乃受瓔珞分作二分持一分施此會中一最下乞人持一分奉彼難勝如來一切眾會皆見光明國土難勝如來又見珠瓔在彼佛上變成四柱寶臺四面嚴飾不相障蔽時維摩詰現神變已又作是言若施主等心施一最下乞人猶如如來福田之相無所分別等於大悲不求果報是則名曰具足法施城中一最下乞人見是神力聞其所說皆發阿耨多羅三藐三菩提心。",
        "translation": "When Vimalakīrti came into the assembly, he said to me, \"Sir, this great congregation of almsgiving is improper as you've set up it to be a congregation of Dharma giving. What is the purpose of a congregation of Dharma giving?\" I said, \"Sir, what is a congregation of Dharma giving?\" A congregation of Dharma giving is one that provides for all sentient beings at one time without precedent or consequence.",
        "source": "X19n0343_003:0191c13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "Therefore, I wouldn't presume to go to him to ask about his illness.",
        "source": "X19n0343_003:0192b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩來入會中即第二明能呵問維摩是何時來答七日滿來也問維摩知其施非何意第一日不即破七日方來破耶解云此終為相成耳相成有二義一者善得七日財施財施得滿財施既滿欲行法施將欲行於法施前呵財施為法施之由為是義故七日竟方來呵也二者其既三年聚財七日行施福得員滿恐著於此福成有所得若有所得福非是福何者有所得福非常住之福但只得人天果報會當磨滅是故今淨名將無所得法塗善得之福令成無所得福不可破壞故大論仙人藏藥在石室中以金剛塗不可破無得善亦爾亦如丈夫食少金剛終日不消亦如金剛般若中明東方可思量不不也世尊無住相布施等十方空也此中正以無得法施呵有得財施故云不當如汝所設當為法施會也然此中可有四句不可定執自有財法竝無得竝不呵自有財法竝被呵自有呵財不呵法自有呵法不呵財財法竝被呵者有所得六度皆呵不能動出無所得六度能動能出不被呵能動即柔順出即無生也財呵法不呵如此文法呵財不呵即五莖華施此五華勝無量有所得法施也今此中正斥有所得財讚無所得法欲開無所得法故前呵有所得財也次善得問法施次淨名答答云法施無前後一切供養明財法二施差別凡有十種不同已如金剛般若中明也何謂也以菩提起於慈心前明四等何意行施為有大慈悲大憙捨故行施今既明施所以四等為道也此中慈非凡夫二乘之慈雖復有慈不能遍度一切遍與大樂與人天樂小乘非謂大慈設有其心而無其事又非有所得慈今慈者無緣大慈故云以菩提起慈心菩提者道也正道大慈也以攝智慧起行捨心者明苦受後多生瞋樂受多生貪捨後多生癡是故明捨心攝智慧也以離身心相起毗梨耶者若言身心精進非精進若能離身心精進乃為精進也於六和敬起質直心言六和敬者同利同見同戒身慈口慈意慈即三失為六種和同於眾生無有耶回故云於六和敬起質直心也一切智起般若應薩婆若心起般若如大品所明世尊維摩說法二百人得道者上明財施益今明法施益為此兩益故得失交牙也善德既聞未曾之法即脫珠瓔淨名便受分二分一尊一卑等于大悲如如來相福田無別也是即名曰具足法施者上開財法二施異呵財歎法明有得財非法今合財法不異無得之財財即是法故云即名具足法又取珠瓔奉者前示法施今示財施即法也。",
        "translation": "Vimalakīrti then came into the assembly, which was the second time he was told that he could criticize him. He asked Vimalakīrti what time he came, and he answered, \"Seven days have passed since then.\" He asked Vimalakīrti what he knew his gift wasn't. The first thing he meant was that the first day wasn't immediately broken, and then he came to break it. There are two meanings to this final accomplishment: first, the seven days of making a gift of wealth and possessions are complete; second, since he had gathered wealth for three years and seven days of making a gift of merit, he was afraid that he would become attached to this merit and attain it. If there's merit, then it's not merit.",
        "source": "X19n0343_003:0192b04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如是諸菩薩各各向佛說其本緣稱述維摩詰所言皆曰不任詣彼問疾。",
        "translation": "Thus, the bodhisattvas each told the Buddha about their original conditions, reciting what Vimalakīrti had said and saying, \"I don't think I'll go to him to ask about his illness.",
        "source": "X19n0343_003:0193a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸菩薩下第二大段不堪也。",
        "translation": "Thus, the second major section below these bodhisattvas is unsatisfactory.",
        "source": "X19n0343_003:0193a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利問疾品第五",
        "translation": "Chapter 5 of Mañjuśrī's Questions About Ailments",
        "source": "X19n0343_003:0193a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊問疾品第五從來云前四品序說竟今是第二正說今明不然禪已如上此下即是廣嚴城內方丈室中第二重會也所以次弟子菩薩品後有今集者明前之二品是問疾前方便今六品是正問疾又前命覓問疾之人今六品得問疾人正往問疾人意者命問疾人令諸弟子菩薩歎淨名昔日教今此六品歎淨名今日教門歎昔日教說種種法門歎今日教說一法門昔屈五百聲聞伏八千菩薩即八千法門今日但現一疾法門故云昔歎種種法門今歎一法門也又意者要須前之二品彈破有得大小乃得弁不思議之法乃入不思議之室何者此室是無漏業所起若不破有得之心即不能入亦不堪聞不思議之行為是故次前兩品有今文來也問何故前菩薩等不堪今文殊堪耶解云得無得異有得有礙無得無礙故前不堪文殊堪也又前不堪者淨名文殊竝已成佛彌勒等是菩薩當成佛故今堪也又前不堪者眾生正囑在文殊故前陳不堪唯文殊堪又令生希有之心起難遭之想尊人敬法為是故前不堪今文殊堪也就此文中有六品開為二第一此品略明二智第二有五品廣弁二智以不思議之法不可頓明是故前略弁略弁既竟故第二廣明也今第一言文殊品者從能問疾之人為名故云文殊問疾品然文殊遊方菩薩不可思議華嚴善財中明此人是善知識本始自文殊至於彌勒見三千大千微塵數善知識文殊是本何但如之文殊是十方諸佛之母十方諸佛皆從文殊而生故不思議也又鴦掘摩羅經云文殊是歡喜藏摩尼寶積佛鴦掘摩羅是一切眾生樂見精進佛一切眾生聞此二佛者滅四重罪也又華嚴云文殊師利是五十三佛中第七佛名如前今在北方常憙世界又法華云是釋迦第九祖師又首楞嚴云是龍種上佛又華嚴光明覺品云文殊是東方無動智佛金色世界補處菩薩次補此佛處以此而論文殊未曾佛未曾菩薩能佛能菩薩也今言文殊師利者或云滿如師利或云文殊力利此云敬首或云儒首或云玅德從此為名故云文殊品也。",
        "translation": "The fifth chapter of Wenshu's questioning of illness is the second correct teaching from the beginning, as explained in the preface to the previous four chapters. This is the second correct teaching, which is the second meeting in the abbot's quarters within the city of Vairocana, and so the next chapter of the discipleship bodhisattva is followed by the present gathering, which explains that the previous two chapters were the first method of asking about illness, and the current six chapters are the correct questioning of illness.",
        "source": "X19n0343_003:0193a11_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "爾時佛告文殊師利汝行詣維摩詰問疾。",
        "translation": "It was then that the Buddha told Mañjuśrī to go to Vimalakīrti and ask about illnesses.",
        "source": "X19n0343_003:0193b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就此品為二第一命問疾二文殊應命今即如來命問疾也。",
        "translation": "This is the first of two classes, the first to ask about illnesses, and the second, Mañjuśrī's order to ask about illnesses, which is now the Tathāgata's order to ask about illnesses.",
        "source": "X19n0343_003:0193c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○文殊白佛下第二應命就此為三第一問疾前事第二正問疾第三問疾後事亦前問疾緣起第二正問疾第三問疾後益就問疾前事中為二第一文殊來第二文殊至之二章各有四句前四者第一歎淨名德第二受命第三欲去第四正去。",
        "translation": "The first four of these two chapters each contain four phrases: first, praising the virtue of Vimalakīrti; second, accepting the order; third, desiring to leave; and fourth, going directly.",
        "source": "X19n0343_003:0193c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利白佛言世尊彼上人者難為詶對。",
        "translation": "Mañjuśrī said to the Buddha, \"Bhagavān, that superior person is difficult to answer.",
        "source": "X19n0343_003:0193c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深達實相善說法要。",
        "translation": "He deeply understands true characteristics and well explains the essentials of the Dharma.",
        "source": "X19n0343_003:0193c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辯才無滯智慧無礙。",
        "translation": "His eloquence is unimpeded, and his wisdom is unimpeded.",
        "source": "X19n0343_003:0193c09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切菩薩法式悉知諸佛祕藏無不得入。",
        "translation": "He fully understands all the bodhisattvas' ways and knows the Buddha's secret store, which is unobtainable.",
        "source": "X19n0343_003:0193c09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "降伏眾魔遊戲神通。",
        "translation": "They subdue Māra and play with supernormal powers.",
        "source": "X19n0343_003:0193c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其慧方便皆已得度。",
        "translation": "Their wisdom and skillful means have all been accomplished.",
        "source": "X19n0343_003:0193c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今即第一歎所以歎者欲生物敬心起難逢之意故歎淨名德也歎中有三總歎別結歎今總歎亦標歎深達實相第二別歎亦釋歎上直云難詡對未知若為難詡是故今釋就中有四雙歎第一內外一雙即即內悟實相外足辯才也辯才無滯下第二內照無礙外說無滯上雖云內達法相或有可礙故今明無礙無滯也一切菩薩法或悉知第三雙識因知果菩薩法或悉知即知因諸佛祕藏得入即識果也降伏眾魔下第四得離一雙降伏眾魔即離遊戲神通即得其慧方便皆已得度下歎中第三結歎結歸二慧上雖多歎不同只是二智二智了達究無遺故云皆已得度也。",
        "translation": "Now, this is the first praise, so he praises the virtue of the pure name because he wants people to respect his mind and have the intention of meeting the difficulty. There are three general praises and specific praises in this praise, and the general praise is also labeled as the praise of profound understanding of true characteristics, and the second specific praise is also an explanation of the praise of the above direct statement that it's difficult to boast about the unknown, and if it's difficult to boast about this, then this explanation is given in the context of four pairs of praises, the first internal and external pair, that is, the internal understanding of true characteristics and the external eloquence.",
        "source": "X19n0343_003:0193c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖然當承佛聖旨詣彼問疾。",
        "translation": "\"Although he will certainly accept the Buddha's noble teaching and go to him to ask about his illness, the bodhisattvas in the crowd were very pleased.",
        "source": "X19n0343_003:0194a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是眾中諸菩薩大弟子釋梵四天王咸作是念今二大士文殊師利維摩詰共談必說玅法即時八千菩薩五百聲聞百千天人皆欲隨從。",
        "translation": "Then, the great disciples of the bodhisattvas, the four heavenly kings of Śiva, all had this thought: \"Now, these two great personages, Mañjuśrī and Vimalakīrti, will surely explain the fine dharma together.",
        "source": "X19n0343_003:0194a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是文殊師利與諸菩薩大弟子眾及諸天人恭敬圍繞入毗耶離大城。",
        "translation": "Mañjuśrī then went into the great city of Vaiśālī with a large group of disciples of the bodhisattvas and gods to surround them with respect.",
        "source": "X19n0343_003:0194a09_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖然下第三受命淨名雖德行難對今當承佛力詣彼問疾也文殊是往古佛尚稱不堪當承佛力故知淨名不思議為眾生故爾耳是時眾中第三文殊受命欲去文殊問疾正為眾生眾生去故菩薩欲去也文殊與諸菩薩下第四正去如文。",
        "translation": "Although the third one down was commanded, although his virtues and conduct were difficult to match, he would now accept the Buddha's strength and go there to ask about his illness. Mañjuśrī was an ancient Buddha who had yet to be praised, so he knew that the pure name was inconceivable and was for the sake of sentient beings.",
        "source": "X19n0343_003:0194a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長者維摩詰心念今文殊師利與大眾俱來即以神力空其室內除去所有及諸侍者唯置一牀以疾而臥。",
        "translation": "It was then that Vimalakīrti, the elder, thought to himself, \"Now, Mañjuśrī and the whole crowd have come together, so he empties his room with his supernormal powers, removes everything and his attendants, puts down only one bed, and lies down quickly.",
        "source": "X19n0343_003:0194a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時長者下第二文殊至然此不來而來不動而動動無所動如此而來從道場來如此而至至於法界至中亦有四句第一明空室然此及於世情世人賓來即敷牀設廗今維摩悉降一無所有有何意耶解云其意無量一者室無侍者即方便實維一牀而臥即實方便故上歎云其慧方便皆已得度今明此二以空室即一切空故是實未曾疾不疾而現疾臥牀即方便慧此不如從來所見二慧空是實有是方便今指實為方便指方便為實實方便因緣也何故空室欲示空義明室既空我病亦空文殊來亦空問答皆空以問答空問答顯本也又空室欲以此室等十方佛剎此室既空十方佛土皆空又空室者明十方世界天魔皆吾侍者若不空即不問不問即無此答空室為顯此意也又空室為生後諸品無座故得借座燈王無飯故得請飯香積也又無眷屬故有普現色身問眷屬淨名答眷屬等以如此義故所以空室也唯置一牀者前空權今有權前空即有空今有即空有此空有不相礙何者空舍中有牀牀在空舍中空舍中有牀空不礙有牀在空舍中有不礙空此即權中復起權巧中復安巧言權中復起權者明維摩未曾身不身未曾舍不舍而今有身有舍已是權而復權身現疾權舍空舍故是權中復起權也雖復有身有舍菩薩未曾身舍非身非舍顯本也。",
        "translation": "The second Mañjuśrī arrived at the time, sir, but this did not come, did not move, moved, and did not move at all, and so it came from the site of enlightenment, and so it went to the Dharma realm, and there are four phrases in it.",
        "source": "X19n0343_003:0194a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利既入其舍見其室空無諸所有獨寢一牀。",
        "translation": "After entering his abode, Mañjuśrī saw that it was empty and lacked possessions, and he slept alone on a single bed.",
        "source": "X19n0343_003:0194b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利既入其舍第二文殊嘿領前維摩嘿現今文殊嘿領兩神相鑒此即默問默答何者前居士空室即空權心疾而臥即有權上雙現今雙領見其室空即領其空權獨寢一牀即領其有權所以爾者二人相鑒目擊道存也。",
        "translation": "After Mañjuśrī had entered his abode, the second Mañjuśrī hey led the former Vimalakīrti hey, and the present Mañjuśrī hey led the two spirits to examine each other, which was to silently ask and silently answer why? The former householder had an empty room, which was the right to be empty, and his mind was sick and he was lying down, which was the right to be present in both directions.",
        "source": "X19n0343_003:0194b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰言善來文殊師利不來相而來不見相而見。",
        "translation": "Vimalakīrti then said, \"Well come, Mañjuśrī, you come without appearing and see without seeing appearances.",
        "source": "X19n0343_003:0194c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰言善來下第三居士言問前居士嘿現文殊嘿領今居士言問文殊言答若語若默皆為開道利緣也言不來相而來者若古經云不來相而來序來不見相而見得相今是什師所番文巧義畢不來相而來不見相而見也此即世界悉檀賓主更相勞問故是世界悉檀因世界顯第一義也然解此不同有云法身不來應身有來又解云真諦不來世諦有來又云實智不來權智有來又彭城講此經第一梁初莊嚴講此經著名晚彭城講此經亦第一彼解云假名道來實法不來故論文云燒欄去來假名故有實法即無師宗是小乘羅漢何得解大乘無得甚深玅義者即羅漢何如身子目蓮即此等尚被破何得以呵棃義以解此經故不可也次有地論師云法界體無來去法界用來去又有中假師中非去非來假而去而來體非去非來用而去而來也問地解如此今復若為耶大師云今時若更有解乃是足載客耳豈更有別解今直讀經上來諸釋竝破句讀經分文解義其罪不輕今明只不來相而來無所來來無所來而來何意作此語正破時眾之見時眾見文殊從菴園而來來至方丈與居士相見是故發初打破此見明來無所來不來而來非是不來故不來亦非來故來只來無來無來來見亦爾不來來正觀來不動動正觀動何者正觀來動故來動皆正觀若以顛倒心來動皆顛倒是前云舉足下足皆從道場來住於佛法矣故來動皆正觀見亦爾如文。",
        "translation": "When Vimalakīrti said, \"Well come, Mañjuśrī,\" the third monk asked, \"The previous monk, hey, present, Mañjuśrī, hey, led, and the present monk asked, Mañjuśrī said, \"Answer, if you speak or are silent, it's all for the benefit of the opening path.\" He said, \"He comes without coming to marks, comes in sequence, doesn't see marks, and sees marks.\" If the ancient sūtras say, \"He comes without coming to marks, comes in sequence, doesn't see marks, and sees marks, then this is the Shishu's explanation of the skillful meaning of the text, \"He comes without coming to marks, doesn't see marks, and sees marks.\" This is the world's accomplished body, and the guest and host have further labored together to ask questions, so it's the world's accomplished body that causes the world to show the highest meaning.",
        "source": "X19n0343_003:0194c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言如是居士若來已更不來若去已更不去所以者何來者無所從來去者無所至所可見者更不可見。",
        "translation": "Mañjuśrī said, \"Thus, householder, if someone comes and then doesn't come, or goes and then doesn't go, why is it that someone who comes has no place to come from, someone who goes has no place to go, and someone who's visible can't be seen?",
        "source": "X19n0343_003:0195a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊如是下第四文殊語答如是實如所言誠如高旨言來已更不來者三時問略就已門明無來所以就已門明無來者時眾見文殊已至方丈是故今破已來更不來去已更不去也文殊與淨名相成淨名云不來而來今文殊言來不來也所以者何來者無所從來釋來已不來明非是不來故不來只來無所來故肇師云觀方知彼去去者不至方又物不遷論云日月歷天而不周江河競注而不流即其事也見亦爾也。",
        "translation": "Wenshu thus, the fourth answer to Wenshu's speech is thus, it's really as stated, it's sincere, and it's according to the high teaching that those who have come and gone will not come. The three questions were abbreviated to explain the absence of coming from the past, so they explained the absence of coming from the past.",
        "source": "X19n0343_003:0195a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○且置是事下第一明問疾前事竟今即第二正問疾為二第一論淨名疾第二論餘人疾論淨名疾即論菩薩疾論餘人疾即論眾生疾淨名疾疾為眾生故疾眾生疾故疾破此疾同菩薩不疾疾也就初為三第一問疾體第二問空室第三問疾相此三段只有二一者論疾二者論空論此二還論前二事上二事生論端也。",
        "translation": "The first thing that follows is to ask about the previous matter of illness. Now, the second thing is to ask about illness, which is twofold: first, on the illness of pure names; second, on the illness of other people; second, on the illness of pure names, which is the illness of bodhisattvas; third, on the illness of other people, which is the illness of sentient beings; and third, on the illness of sentient beings because of the illness of pure names.",
        "source": "X19n0343_003:0195a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且置是事。",
        "translation": "We'll set this matter aside.",
        "source": "X19n0343_003:0195b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今第一論淨名疾為二第一請置傍論第二正論淨名疾今第一請停傍論不來來等乃是方等深意佛法大宗但聖旨未宣置停傍論故云且置是事。",
        "translation": "The first treatise on the illness of the pure name is twofold: the first asks to stop the evening treatise, the second correctly treats the illness of the pure name, and the first asks to stop the evening treatise and not to come and so forth, which is the profound meaning of the Buddha's teaching, but the noble teaching hasn't declared that it's a good idea to stop the evening treatise.",
        "source": "X19n0343_003:0195b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士是疾寧可忍不。",
        "translation": "\"Cūḷa should tolerate this illness rather than this.",
        "source": "X19n0343_003:0195b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "療治有損不至增乎。",
        "translation": "It's harmful to treat it, but it won't increase.",
        "source": "X19n0343_003:0195b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊殷勤致問無量。",
        "translation": "The Bhagavān was eager to ask immeasurably.",
        "source": "X19n0343_003:0195b12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士是疾寧可忍不下第二正問疾為二第一宣聖旨第二文殊正問疾就此兩各三句今初言居士是疾可忍不者問病之重輕也療治有捐下第二句問疾之增捐亦是問疾之對治也世尊慇懃致問第三正宣聖旨言慇懃者命五百聲聞八十菩薩命一切大小乘問疾故是慇懃又前問今復問故是慇懃也。",
        "translation": "The first one says, \"The householder's illness is tolerable.\" The second one asks whether the illness is serious or minor, and the second one, \"The treatment is limited.\" The second one asks whether the illness is increasing or not, and the Bhagavān diligently asks about the antidote to the illness.",
        "source": "X19n0343_003:0195b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士是疾何所因起。",
        "translation": "\"Cūḷa, what was the cause of this illness?",
        "source": "X19n0343_003:0195b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其生久如。",
        "translation": "How long has it been present?",
        "source": "X19n0343_003:0195b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當云何滅。",
        "translation": "How will it cease?",
        "source": "X19n0343_003:0195b21_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士是疾何所因起下第二文殊正問然此雖是文殊自問還是如來問如大品如來命善吉說還是如來說今亦爾命文殊問文殊問還是如來問也此中亦三句是疾何所因起即問疾之因起世人得病各有因起故今問居士何所因起也其生久如第二句問疾之久近得此病為當幾時為昨日得為先有此病故問云其生久如也當云何滅第三句問疾何當差亦是問對治此疾何治之而差故云當云何滅也。",
        "translation": "Although this is Mañjuśrī's own question or the Tathāgata's question, as in the great teaching, the Tathāgata ordered Shanji to say or the Tathāgata to say, this is also the same order for Mañjuśrī to ask, and Mañjuśrī's question is still the Tathāgata's question. Here, there are three phrases that ask what causes illness to arise, namely, the causes of illness to arise.",
        "source": "X19n0343_003:0195b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○維摩言從癡有愛下第二淨名答有人云六問中但答後三問所以爾者南澗云後三是文殊問故答前三是佛問至佛所方答今問往佛所何處答此問耶又往佛所手擊世界而去何答問病耶又言前三問是佛問者佛前命文殊何處有此三問耶直命其問事事委其問其問即是佛問今答即是答佛云何言見佛方答故不可也今明正答後三問兼答前三問何者前三問上云是疾寧可忍不療治有損不至增乎後答從癡有愛即我病生正答後久近問兼答療治有損不至增乎問何者明眾生病既癡有愛菩薩為眾生故病若眾生病有增損時菩薩病亦增損等故答久近則兼答此前問也故後云眾生瘉菩薩亦瘉也從大悲起則正答後問中病起原兼答前寧可忍不問何者既從大悲而起此則可忍若不可忍不名大悲此意可尋耳(云云)。",
        "translation": "Vimalakīrti said, \"From delusion and craving comes the second pure name answer.\" Some people say that of the six questions, only the last three are answered by Mañjuśrī.",
        "source": "X19n0343_003:0195c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言從癡有愛則我病生。",
        "translation": "Vimalakīrti said that it's from delusion and craving that my illness arises.",
        "source": "X19n0343_003:0196a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就正答後三問復不次第亦答第二久近問第二答第三當云何滅問第三答第一何所因起問今第一答第二久近問此文少隱前問云此病其生久如今答云從癡有愛即我病生作若為答即有人解云從癡有愛故有我人病生今明不然此答極巧何者明眾生無始有癡愛病故是我病我病由眾生病眾生有心病故有我身病眾生久矣我病久矣也問眾生癡愛病前際無始後際無終菩薩病亦爾不解云有數意一者寧知無始無有淨名故前後亦可等也二者後際即等前際即未必等言後際等者眾生癡愛不盡菩薩病亦不盡橫竪皆爾橫即六道竪窮後際也前際未必等者眾生無始有癡愛未必無始有淨名何者淨名有初發心此即有初眾生即無始也若爾眾生無始眾生病久矣淨名有始病即近矣云何前言久耶解云若通就諸菩薩為論即等無始有眾生無始有諸菩薩無有無菩薩時此即等就淨名亦有等義淨名悲無始無始即有悲此言亦等菩薩至壞如此豈不發心故下文云除彼不肖人癡冥無智者也問眾生癡愛故病即過去無明故起愛有愛故有生死所以經云生死本際凡有二種一者無明二者有愛眾生既由癡愛受身菩薩由大悲受身眾生癡愛受身眾生有身病菩薩大悲受身菩薩有身病眾生身病是四大病菩薩身病亦四大病亦應眾生心病是癡愛病菩薩心病亦是癡愛病解云若眾生身身故身為身病眾生癡愛故癡愛為心病菩薩無身身為身病菩薩無癡愛癡愛為心病即例例而不例同而不同同眾生身病不同眾生心病同身病即同眾生不同眾生心病即化眾生以同身病故無無量人來問病不同心病故為人說法也又問何不同其心同其心同其身耶解云同人者之五情異人之神明同人者五情故同其身病異人者神明故不同其心病以是義故為眾生心病所以菩薩身病也。",
        "translation": "In regard to the correct answer to the last three questions, again, not in order, but also in answer to the second question for a long time, the second answer to the third question is, \"What is the cause for the cessation of the question?\" The third answer to the first question is, \"What is the cause for the arising of the first answer to the second question for a long time?\" The answer to this question is, \"From delusion and craving, there is a self-sickness that arises.\" If this answer is given, then there is someone who understands that from delusion and craving it follows that there is a self-sickness, and my illness is caused by the illnesses of sentient beings.",
        "source": "X19n0343_003:0196a06_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "以一切眾生病是故我病若一切眾生得不病者則我病滅。",
        "translation": "Because all sentient beings are sick, therefore I'm sick. If all sentient beings could attain freedom from sickness, then my sickness would cease.",
        "source": "X19n0343_003:0196b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何菩薩為眾生故入生死有生死則有病若眾生得離病者則菩薩無復病。",
        "translation": "Why is that? It's because of sentient beings that the bodhisattva enters birth-and-death. If there's birth-and-death, then there's illness; if sentient beings become free of illness, then the bodhisattva never becomes ill again.",
        "source": "X19n0343_003:0196b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如長者唯有一子其子得病父母亦病若子病愈父母亦愈。",
        "translation": "It's like an elder who has only one child, and when that child becomes ill, his parents also become ill, and if the child heals, the parents also heal.",
        "source": "X19n0343_003:0196b18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩如是於諸眾生愛之若子眾生病則菩薩病眾生病愈菩薩亦愈。",
        "translation": "Thus, the bodhisattva loves all sentient beings, and if his children are sick, then the bodhisattva is sick and the parents are sick, and the bodhisattva is healed.",
        "source": "X19n0343_003:0196b20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以一切眾生病是故我病下第二答第三當云何滅問兼答前療治有捐等問也前問病生之久近答云眾生既無始菩薩病亦無始無始眾生無始有癡愛已來便有病故我病亦無始也今答當云何滅問明若一切眾生得不病者我病乃滅眾生既不盡我病亦不滅也問眾生癡愛故受身菩薩大悲故受身眾生癡愛為病本菩薩以大悲為病本若使如此云何眾生病耶解云何用有大悲為眾生故有大悲眾生即大悲本大悲為未就未中復開本未故大悲為本病為未然作此讀經未足可異他他可不言有眾生可悲有菩薩能悲有眾生癡愛病有菩薩大悲病即今所明者眾生是空眾生[序-予+疑]愛是空癡愛菩薩空菩薩大悲空大悲大悲空眾生從空癡愛有空眾生故經云無明體性本自不有無所有故假名無明無明既空眾生亦空又大品云眾生若有一豪所有菩薩悲之不染不甚只為無一豪所有空自輪轉三有往還五道故菩薩悲之甚深於畢竟空中而起大悲雖起大悲不礙畢竟空若大悲礙畢竟空即常見畢竟空礙大悲即斷見此即為佗之所悲何能悲佗今明無緣大悲悲空眾生雖悲而空雖空而悲也就此文為三第一法說次譬後合今即法說有二第一標第二釋今標正答當云何滅如文所以者何下第二釋可尋譬如長者下第二譬說菩薩如是於諸眾生下第三合譬也。",
        "translation": "The previous question was, \"How long has this illness been present?\" The answer was, \"Since sentient beings are beginningless, the bodhisattva's illness is also beginningless, and since sentient beings have delusions and loves from beginningless, there has been illness, so my illness is also beginningless.\" The answer will be, \"How does it cease?\" The question is, \"If all sentient beings become disease-free, then my illness will cease.",
        "source": "X19n0343_003:0196b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言是疾何所因起菩薩疾者以大悲起。",
        "translation": "He also says, \"What is the cause of this illness?\" A bodhisattva's illness arises from great compassion.",
        "source": "X19n0343_003:0197a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又言是病何所因起下第三答第一是疾何所因起問前問云是云疾何所因起今答云以大悲故起眾生病從癡愛起菩薩病因大悲起此無緣大悲也問若今云病從大悲起者前何意從癡愛有病耶解云由癡愛故有眾生病有眾生病故有大悲也。",
        "translation": "He also said, \"What is the cause of the illness that arises?\" The third answer to the first question is, \"What is the cause of the illness that arises?\" The previous question asked, \"What is the cause of the illness that arises?\" The present answer is, \"It's because of great compassion that the multitude of illnesses that arise from delusion and love arise, and the bodhisattva's illnesses arise because of great compassion.",
        "source": "X19n0343_003:0197a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○文殊師利下第二論空室前論有今辨空即二慧也問上雙現有空前空而後有今雙論何故前有而後空解云前空次現有此依淨名本意而現淨名欲正明空空為有本實為權本淨名作現文殊依淨名而領今前問有次論空者依如來聖旨如來前命聲聞菩薩問疾故前問有然後論空亦是示有為空本權為實本若只得空為有本不得有為空本即便有礙為是故今交終明之辨空有無礙也今第二論空者欲泯上上云從癡有愛即我病生乃至菩薩病以大悲起是故今泯明此空室即一切皆空我病亦空眾生亦空為是故第二論空也。",
        "translation": "The second debate on emptiness is based on the Tathāgata's noble teaching that the Tathāgata previously ordered śrāvakas to ask about illness, so the prior question on existence and then the debate on emptiness also shows that existence is the origin of emptiness and the origin of right is the origin of emptiness, even if there are obstacles to this, the present intersection ultimately clarifies that the debate on emptiness is unobstructed.",
        "source": "X19n0343_003:0197a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言居士此室何以空無侍者。",
        "translation": "Mañjuśrī asked him, \"Bhagavān, why is this room empty without an attendant?",
        "source": "X19n0343_003:0197a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就此文為二第一文殊問第二居士答就問中有二第一論空室第二論侍者空所以明此二者有數義一者就世界悉檀為論世聞病人有二資生有藥食有看病侍疾人問室空問無療疾食藥等問無侍者問無侍疾人是故問此二也二者問此二者即是問於人法問室空即問法無侍即問人也三者欲開後二法門有空空有法門由空室故得明十方佛土空由無侍故明一切皆吾侍也四者問室空欲上有所齊問無侍欲下有所攝上所齊以此室等十方佛剎下有所攝無侍一切皆吾侍也五者問室空即問依果佛土是依果故問無侍即問正果侍者即正果故從來唯得空室無藥食無侍無看病人唯得二意今明如上也。",
        "translation": "In this text, there are two first, Mañjuśrī asks, and the second, the householder answers. In regard to the question, there are two things: first, the debate on the emptiness of the room; second, the debate on the emptiness of the attendant; and third, the desire to unlock the last two dharma gates, existence, emptiness, and dharma gates.",
        "source": "X19n0343_003:0197b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言諸佛國土亦復皆空又問以何為空答曰以空空又問空何用空答曰以無分別空故空又問空可分別耶答曰分別亦空又問空當於何求答曰當於六十二見中求又問六十二見當於何求答曰當於諸佛解脫中求又問諸佛解脫當於何求答曰當於一切眾生心行中求。",
        "translation": "Vimalakīrti said that the buddha lands are also empty. He also asked what constitutes emptiness and answered, \"Emptiness is emptiness.\" He also asked what is the use of emptiness as emptiness and answered, \"Emptiness is empty because there is no discriminated emptiness.\" He also asked where emptiness should be sought and answered, \"It should be sought in the sixty-two views.\" He also asked where the sixty-two views should be sought and answered, \"It should be sought in the liberation of the buddhas.\" He also asked where the liberation of the buddhas should be sought and answered, \"It should be sought in the mental functions of all sentient beings.",
        "source": "X19n0343_003:0197b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩言諸佛國土下第二居士答答上二問即為二第一答空室問第二答無侍問今即第一答空室問凡有數翻問答今即第一所以空室者欲有所表明此室等十方佛土十方佛土即空我室而當不空此室即十方佛土空十方佛土空不異此室空此意復有所以者何此室空即十方佛土空明我身即十方佛身此病即十方佛病此悲即十方佛悲故云諸佛土皆空也又問以何為空者明十方佛土何意空即汝室無物故空十方佛土居然是有那忽空何者我今現見十方佛土不空有能化所化何得言空耶又且汝室虗妄可空十方佛土無漏業感得何得言空耶三者汝無神力持此室故空十方諸佛有神力持何得亦空為是故問云以何為空也答曰以空空者明眾生無正觀空慧故言十方佛土是有菩薩以無依無得正觀觀十方佛土皆空故云以空空前空即觀空後即土空故云空空也又問空何用空者明佛土本性自空何用空即若本性不空途自觀之終不能令空若本性自空何用空為開兩開責之上空則土空下空是能空之觀今空也答曰以無分別空故空者兩開中一開明佛土本性自空但眾生無無分別空觀故不知空要得無分別空觀然後知空故云以無分別空故空也又問空可分別耶者明汝以無分別空觀觀佛土空者未知此空觀可分別不耶觀觀土空未知觀亦空不作如此問也答曰分別亦空者前明所觀之土空今明能觀空觀亦空上所觀土空即無數於外今能觀亦空即無心於內於外無數於內無心彼已寂滅浩然大均亦是緣盡於觀觀盡於緣緣盡於觀即無緣觀盡於緣即無觀無緣無觀無數無心可謂內外竝空緣觀雙寂也又問空當於何求上一周問答竟今更轉問也有此文來者上明土空觀空境知皆空或者便謂若境智二內外二非正悟今內外不二境智皆空即是正悟此之正悟當於何求謂正異耶故作此問也今答當於六十二見中求明空不異有有即是空耶不異正正即是耶迷正故耶體耶即正耶正不二故云當於六十二見中求也又問六十二見當於何求者上來泯耶正竟今次泯縛解不二何者或者謂若有正有邪耶正異故繫縛今了耶即正了正即耶耶正不二為解脫是故今更泯六十二見之縛則諸佛解脫諸佛解脫即六十二見之縛了耶即正亦了縛即脫縛脫畢竟不二故當於諸佛解脫中求也又意前云空六十二見中求正即耶今六十二見佛解脫中求耶即正也又問諸佛解脫當於何求者次泯凡聖見前明見耶異正名縛了耶即正不二名解脫還作縛解異見見解異縛見縛異解即名凡夫若能了縛即解脫不二即名諸佛是故今更泯只凡即聖聖不異凡所以文云當生心行中求也今聖法不異凡人也。",
        "translation": "Vimalakīrti says the buddha lands are the second Guru's reply to the above two questions is the first answer to the question of an empty room, the second answer to the question of no attendant, and now the first answer to the question of an empty room, where there are several repetitions of the question, and now the first answer to the question of an empty room is to show that this room and so forth are the buddha lands of the ten directions, the buddha lands of the ten directions are empty, the buddha lands of the ten directions are empty, the buddha lands of the ten directions are empty, not different from the emptiness of this room, and there is also this reason why this room is empty, that is, the buddha lands of the ten directions are empty.",
        "source": "X19n0343_003:0197b20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "又仁所問何無侍者一切眾魔及諸外道皆吾侍也所以者何眾魔者樂生死菩薩於生死而不捨外道者樂諸見菩薩於諸見而不動。",
        "translation": "Also, Ren asks why there's no attendant? \"All the many Māras and non-Buddhists are my attendants. Why is it that the Māras are happy with birth and death, the bodhisattvas are unmoved by birth and death, and the non-Buddhists are happy with views, the bodhisattvas are unmoved by views.",
        "source": "X19n0343_003:0198b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又仁所問何無待者下第二答無待問前文殊有空兩問答空室竟故今答無侍問去前問遠故更搆起汝前問何無侍者今答云十方羣生皆吾侍也又前現空有二一者現空明空權竟今即第二現空明有權也問空室得辨空權今無侍何竟不辨空耶解云前明空義已足始即明境智及邪正佛眾生空此義已足不復須辨空權已顯有巧未彰正為是因緣所以今明有權也問十方羣生皆吾侍者何故獨舉天魔外道解云略舉此二攝於一切何者天魔即攝天外道即攝人人天勝者既為其侍所餘四趣何足及言又且此二人難伏難伏尚為侍豈況易者當非侍耶又天魔樂生死即攝愛眾生外道樂諸見即攝見眾生以愛見攝一切盡為此故略舉此二人故云一切眾魔及諸外道皆吾侍也問前空室今空侍空室既等十方佛土皆空亦應空侍類十方侍皆空也解云得上空室空十方佛土今空侍十方侍亦空上明土空依果空今侍空即正果空亦上明土空即法空今明侍空即人空也上明室無侍十方皆吾侍亦得上明室無物十方皆吾物如燈王之座香積之飯應念所須而至也以此言故云得也然得又有未得義上即空為空用今即空為有用應有四句今此中略明一句空為空用空為為有此中諸佛菩薩隨意自在無礙之用故前歎云已於諸法得自在是故稽首此法王達諸相法無罣礙稽首如空無所依也就此文中為二第一標十方天魔外道皆吾侍也所以天魔外道為侍者世間侍病雖復無量不出令病差體康今菩薩亦爾由天魔外道故菩薩煩惱盡長法身煩惱盡即病差長法身即體康為是故天魔等為侍也眾魔樂生死歎敬生死菩薩既在生死歎敬生死即歎敬菩薩故眾魔是菩薩侍若菩薩生死外即不得歎敬菩薩以菩薩在生死歎敬生死即歎敬菩薩也外道樂諸見者外道既歎樂諸見菩薩處諸見而正觀正觀而處諸見菩薩處諸見外道歎敬諸見即敬歎菩薩也菩薩何意處諸見只為有諸見故有正觀若無諸見即無菩薩正觀亦猶□弊有六度等也又且菩薩處諸見者不為同諸見令諸見同菩薩故菩薩處諸見也。",
        "translation": "The second answer to the question of no waiting is that Mañjuśrī had two questions about emptiness and the answer to the question of no waiting is that the answer to the question of no serving is far removed from the previous question and therefore it's more important to raise your previous question about no serving. There are two kinds of manifest emptiness: the first is the manifest emptiness and the knowledge of the right to emptiness, and the second is the knowledge of the right to manifest emptiness.",
        "source": "X19n0343_003:0198b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "文殊師利言居士所疾為何等相。",
        "translation": "Mañjuśrī said, \"What's the characteristic of the illness of a householder?",
        "source": "X19n0343_003:0199a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言我病無形不可見。",
        "translation": "Vimalakīrti said, \"My illness has no form and can't be seen.",
        "source": "X19n0343_003:0199a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問此病身合耶心合耶。",
        "translation": "He also asked, \"Is this illness united with the body? Or is it united with the mind?",
        "source": "X19n0343_003:0199a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰非身合身相離故亦非心合心如幻故。",
        "translation": "He answered, \"It's not that the body is united with the body and separated from its characteristics, and it's not that the mind is united with the mind because it's illusory.",
        "source": "X19n0343_003:0199a05_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言下第三重論疾相然好體前問疾竟即應問疾相何故中央論空室無侍耶解云論空室無侍是問疾何者疾病應有藥食及以侍養是故問云何故無於藥食及以侍養之人耶即是問疾方法也為是故前第一問疾體次問空室無侍今第三問疾之相就此為二初明病果第二論病因今則初論病相即是病果故也明世人疾病並有相皂或身或熱或寒或風或氣居士今之所患為同世人為不同耶是故今問云為何等相也維摩言我病無形者第二淨名答前問云所疾為何等相今答云我病無形病宛然無形無形而病此即異凡殊聖無形即異凡而病即殊聖聖入無餘無形不能有病凡夫有病不能無形凡聖不出二條有病即有形無形即無病今有病即異二乘無形即異凡夫也雖異凡夫而復同凡夫病同凡夫病而復異此即異而同同而異同異不異異同不同不同不異能同能異也問此中同眾生病與前同眾生病何異耶解云異前就身心論同異今單就身論同異前身心同異同人者之五情眾生病菩薩病異人者之神明不同眾生癡愛今單就身明同異有病故同無形為異故云我病無形也又問此病身合耶心合耶者的問於病然世人若無形即無病有病有形而淨名答云有病無形若使如此應是病細身□細病與身合故病無形二者若不如此應與心合心無形故病亦無形所以問心合耶身合耶也答曰非身合身相離故者淨名答明都不如汝所問汝言與身合無有身與何物合汝言與心合無有心復與何物合故文云身相離即無身心如幻故即無心既無身心故無有合也。",
        "translation": "Mañjuśrī said the third debate on the characteristics of illness is the result of the previous question on the good body, which is to ask about the characteristics of illness.",
        "source": "X19n0343_003:0199a07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "又問地大水大火大風大於此四大何大之病。",
        "translation": "He also asked what's the disease of the four elements that are greater than earth, greater than water, greater than fire, greater than wind.",
        "source": "X19n0343_003:0199b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰是病非地大亦不離地大水火風大亦復如是而眾生病從四大起以其有病是故我病。",
        "translation": "He answered, \"This illness isn't earth, but it's also not separate from earth, water, fire, wind, or greatness.",
        "source": "X19n0343_003:0199b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又問地大下明上來論病果今次論病因亦上論病末今論病本是故次今文來也所以然者欲破眾生病令畢竟無遺是故二人論於此病文殊騰病淨名即打破文殊同迷請問淨名就悟為答只破眾生此之身心令捨顛倒身得法身為捨癡愛心得玅慧為心此故所以一人騰來一人破也就此為二第一文殊正問病因明眾生之病從四太起菩薩之病何太病耶此問也答曰此病非地下淨名答雙非二見也問何不例前身合耶無身論何物合今問四太起答無四太起答無四大何所起病例耶今轉開雙彈即離明非四大亦不離四大若即四大有病者四各處應有[颱-台+日][颱-台+日]之風湯湯之水應有病而各無病和合四大亦無病者上各處既無病今合那應有何者各沙無油合沙亦無油病亦爾合既無病離云何有若離四大有病出四大外應有病而大外不病故離亦無病雙破即離無病也上明不與身心合無身心故無病今明無病故無四大前無因故無果今明無果故無因斯即無因無果無病無身畢竟清淨離如是無所有於眾生故有既於眾生有菩薩無客捨置眾生眾生既有病是故菩薩病故文云而眾生病從四大起以其有病是故我病亦是釋疑若使云病畢竟無居士何意須枕在牀諸人參耶解云眾生病故我病我未曾病不病為眾生病亦未曾參不參為眾生故參也此之一經極為精要所以開中諸師歎美此經叡師云吾之啟悟始於此經又肇師歎遇此經頂戴受持歎曰吾知所歸矣(云云)。",
        "translation": "It was also asked under the ground level that the cause of illness was discussed above, the cause of illness was discussed this time, and the end of illness was discussed now, and the origin of illness was discussed this time.",
        "source": "X19n0343_003:0199b16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○爾時文殊問維摩菩薩云何慰喻下就此品中大開為二第一序問疾前事第二正明問疾就問疾中更開為二第一明淨名疾已竟此下第二論餘人疾上第一論淨名疾亦得云論菩薩疾今論餘人亦得論云眾生疾所以論此二者明疾之法門不出此二是二人共論此二疾也問今論眾生論何眾生耶解云通論六道別即正論始心菩薩之疾也就此文為二第一論慰喻第二明調伏所以明此二者莫問道俗皆有此身心兩患既有此患應須前慰問曉喻其心既曉喻其心竟次須令其論伏顛倒之心進修於行也亦得慰問約能化調伏就所化眾生既病菩薩故須慰問有愛之人自須調伏其心也好體應慰問在文殊調伏在居士何者淨名既現疾如來遣文殊慰問故慰問應在文殊調伏在居士而今不爾慰問亦是居士調伏亦是居士此之二種並是淨名何者明淨名當今法主故為眾生須慰問為眾生須調伏慰問調伏普屬淨名也。",
        "translation": "At the time, Mañjuśrī asked Vimalakīrti what consolation was in this section, and then he opened it up into two categories: first, he prefaced his question about the illnesses that had occurred in the past, and second, he explained the illnesses that had occurred in the pure name.",
        "source": "X19n0343_003:0200a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利問維摩詰言菩薩應云何慰喻有疾菩薩。",
        "translation": "It was then that Mañjuśrī asked Vimalakīrti, \"What should a bodhisattva say to console a bodhisattva with illness?",
        "source": "X19n0343_003:0200a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言說身無常不說厭離於身說身有苦不說樂於涅槃說身無我而說教導眾生說身空寂不說畢竟寂滅說悔先罪而不說入於過去以己之疾愍於彼疾當識宿世無數劫苦當念饒益一切眾生憶所修福念於淨命勿生憂惱常起精進當作醫王療治眾病菩薩應如是慰喻有疾菩薩令其歡喜。",
        "translation": "Vimalakīrti said, \"He says the body is impermanent, doesn't say he's disillusioned with the body, says the body is painful, doesn't say he's happy in nirvāṇa, says the body is without self, and says he'll teach sentient beings, says the body is empty and quiescent, doesn't say it's ultimately tranquil, says he'll repent of prior sins, and doesn't say he'll enter the past because of his own illness and help others with theirs. He should be mindful of benefiting all sentient beings, remember the merits he cultivates, and remember that his life is pure.",
        "source": "X19n0343_003:0200a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就初為二前問次答今即第一問也然有三人有疾說三種慰問一者具縛凡夫貪生畏死得疾時為此人慰問者即云懃念三寶宜彌用心此病當差勿生愛惱也二者二乘人得病時為須慰問云我從來云此身無常應須厭離今果如此應須懃作觀行厭離此身速求涅槃之樂三者即發菩提心人得為須慰問即須及上二人如文所明三種人今但菩薩慰問故文殊云菩薩云何慰問有疾菩薩也維摩言說身無常正為說慰問也說身無常不說厭離於身者則雙非凡聖明凡夫貪身不說無常二乘說無常而不貪身今菩薩及此二人說身無常故異凡不厭離身故殊聖何者今正以此身行般若觀何得捨棄雖知無常而修正觀故不捨也身無我而說教導眾生者明二乘無我無我所即不能化導眾生是故今明身雖無我而故導眾生也然此四非常法通大小乘小乘四非常者無常不能不厭離身菩薩不爾雖知身無常而不厭離於身餘亦爾故異二乘也說悔先罪者明有人得病時慰喻云汝今生來不作罪無有疾因應不得此疾而今得此疾必是過去世來應須懺悔故云說悔先罪也不入過去者應須識此性畢竟無所有不可得言罪定在過去若定在過去與數論有得者更有何別他明罪從未來來現在現在入過去過去定在作罪未悔在過去今悔即滅此逐是生滅有無等見今明罪本不生今何所滅罪本不有今何論無故大經云空見不有有見不空此即是正觀喻也既知罪本不生今不滅只汝亦本不生今不滅既無滅何所懼耶故言說悔先罪不入過去也有時解云說悔先罪者明今之感疾必由先所作罪來故經云殺生因緣得二種果報一短命二者多病感疾由有罪既有罪故為懺悔如此經文及普賢等也不入過去者向有罪今悔即謝入過去如數入斷或義斷得繩煩惱謝過去今不爾雖悔罪罪不入過去所以爾者前悔即明罪不生今不過去明罪不滅即不生不滅觀以己之疾愍於彼疾者明汝須念三途八難眾生如此苦劇汝身暫病尚苦奈化他長淪地獄畜生等苦耶又且汝是菩薩觀行人尚不能忍況不得觀行人能忍此苦耶故云以己之疾愍於彼疾也當識宿世者明汝無數劫來貪此身已有此苦非只今身始有此苦也當念饒益眾生者明汝應念言我若脫此疾有勢力時當度一切眾生身苦修於正觀救一切眾生心苦也憶所修福者明外國一生作功德即記之臨死時人為讀之云汝在世有如此福當生好處莫生怖也念於淨命者世間多恐殺生祀神乞命故今勸當念淨命念勿得殺戮殺生求生去遠也起進者然病人多生懈[怡-台+怠]故今觀應起精進也當作醫王者上來明於病中修行此即明於病中發願願作醫王治眾生身心兩病也菩薩應如是下結慰問也。",
        "translation": "In the beginning, there are two previous questions, followed by an answer. Now, this is the first question. However, there are three people with illnesses who are told three kinds of consolation. One is a fettered mortal who's greedy for life and fears death when he gets an illness, which is to console this person, which is to say that it's appropriate to be diligent and mindful of the Three Treasures, and this illness should be treated with care and concern. Two, when a two-vehicle person gets an illness, it's necessary to console them, saying, \"I've always said this body is impermanent and should be disillusioned with it.",
        "source": "X19n0343_003:0200b03_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○文殊師利言有疾菩薩云何調伏下第二論調伏前慰問就外今調伏約內既有巧慰問於身故內有善調伏於心也就此為三第一明自行化他調伏第二明自行化他調伏有得有失第三歷法明自行化他調伏就初為三第一明自行調伏即方便實慧第二明化他調伏即實方便慧第三雙明自行化佗調伏今即第一明自行調伏復更為三第一調伏我見即眾生空第二調伏諸見即法空第三調伏空見明空亦空所以有此三種者眾生心終莫出此三是故今調之令伏何者眾生見有我故調令我息見有法故調令法伏此之二種並調眾生見有人見有法故調人見明人見息調法見明法見息若使如此無人無法即便是空作於空解是故調之若復見有空即便是空見所以第三明空病亦空問為將空空此空故空病亦空為不爾耶解云不爾若將空空此空空病不息今以前後破之明空是有空前若有有今可有空本既不有今何所空斯即無空無有畢竟清淨即是般若即是正觀即是佛性也問有不有無不無不有不無名為中道還復著中道若為治解云佛在世人根性利有見不有即知空不空有不有有無若無中道亦淨故華嚴云一切有無法了達非有無不著不二法以無一二故又文云遠離二邊不著中道中論云有無既已無中當云何有故有無若淨中道即捨。",
        "translation": "The first is the first clarification of self-transformation and other-transformation, the second clarification of other-transformation and other-transformation, and the third clarification of self-transformation and other-transformation, and the first is the third clarification of self-transformation and other-transformation, and the third clarification of self-transformation and other-transformation.",
        "source": "X19n0343_003:0201a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言居士有疾菩薩云何調伏其心。",
        "translation": "Mañjuśrī said, \"Cūḷapanthaka, what does the bodhisattva with a disease do to tame his mind?",
        "source": "X19n0343_003:0201b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰言有疾菩薩應作是念今我此病皆從前世妄想顛倒諸煩惱生無有實法誰受病者所以者何四大合故假名為身四大無主身亦無我又此病起皆由著我是故於我不應生著既知病本即除我想及眾生想當起法想應作是念但以眾法合成此身起唯法起滅唯法滅又此法者各不相知起時不言我起滅時不言我滅。",
        "translation": "Vimalakīrti said that the ailing bodhisattva should think this: \"Now, this illness of mine all started with deluded thoughts and mistaken afflictions from previous lives, and there's no real dharma who suffers from the illness. Why is that? The four elements combine to make a body that's nominally called a body, and the four elements have no owner.",
        "source": "X19n0343_003:0201b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三章之中今即第一調我見令我見伏問此中作若為調耶解云此中正調眾生心誰能調眾生心病唯有諸佛菩薩能調眾生心病故佛與耆婆分治耆婆調身如來調心又經唯有諸佛菩薩能調眾生心病降佛菩薩外餘無能調二乘之人自調自度耶回之見被他調何能調他唯佛菩薩能調也賢愚經云調象譬調順竟王乘入山象見野崔象即便奔走倒王於地王便瞋調象師欲殺淨居天縣令憶象師心師即啟王臣唯能調象身不能調象心王云誰能調眾生心臣答唯佛能調眾生心故故知唯佛菩薩能調眾生心也就此章前問如文維摩言菩薩應作是念下淨名答言此病從前世妄想煩惱無有實法者汝今得病皆由過去妄想煩惱有也因既妄想無所有果亦虗妄無所有本皈虗妄無所有末亦虗妄無所有本末因果皆無所有誰病誰苦誰怖誰憂故言無有實法誰受病者也所以者何四大合故假名為身者上就隔世調今就同世調只即世四大求我不可得誰受病耶若言有我自五大而無有五大唯有四大故四大無主四大無主故身無我也又此病皆由著我者釋病之所以釋破之所以言釋病所以者汝何以病只由我故病也釋破所以者今何意破我只為汝著故所以破我也既知病本即除我想當起法想者此中借法以破我若不前起法無由息我為息我故前起法想我想若淨法想亦除也何者法師云如人養怨兩人望自身皆怨兩人復自有怨若殺一怨息養一怨令殺彼怨殺彼怨若竟須復除此怨我之與法爾欲息我怨且養法怨令法怨殺我怨殺我怨意即除法怨又外國騎師子譬亦爾騎師子度虎狼虎狼既度即捨師子我之與法亦爾息我故起法我息即捨法也如成論無十六我世諦中實有界入等法數人云實無有我但有陰界等法如瓶中無水不無有瓶陰中無人不無有陰也今借法破我故云除我想起法想也但以眾法合成此身者明唯四大等合成此身起唯四大起滅唯四大滅無有我起我滅也又各不相知者地大起不喚水大起水大起不喚地大起故云各不相知也。",
        "translation": "Of the three chapters, this is the first one that regulates the view of self and causes the view of self to subdue the question, \"Who can regulate the minds of sentient beings?\" He explained, \"In this case, who can regulate the mental illness of sentient beings? Only the buddhas and bodhisattvas can regulate the mental illness of sentient beings, so the Buddha and Jīvaka can regulate the body of Jīvaka and the Tathāgata can regulate the mind.\" Again, the sutra says only the buddhas and bodhisattvas can regulate the mental illness of sentient beings, and the buddhas and bodhisattvas descend upon the buddhas and bodhisattvas, but there are no others who can regulate the two vehicles and save themselves.",
        "source": "X19n0343_003:0201b14_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "彼有疾菩薩為滅法想當作是念此法想者亦是顛倒顛倒者即是大患我應離之云何為離離我我所云何離我我所謂離二法云何離二法謂不念內外諸法行於平等云何平等謂我等涅槃等所以者何我及涅槃此二皆空以何為空但以名字故空如此二法無決定性。",
        "translation": "That ailing bodhisattva who thinks about the cessation of things should think this way. This kind of thinking about things is also mistaken. mistaken is a great danger.",
        "source": "X19n0343_003:0202a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有疾菩薩為滅法想當作是念下第二調法見令法見伏借法息我我息法即淨顯在於此故有我有我見今有法即法見我見既顛倒法見亦顛倒同顛倒故皆須離既離我即離我所也此不同成論以實過假以空過實假實二空俱是解今明平等皆須離也云何離我我所謂二法不念內外者自身為內佗為外六情為內六塵為外故云不念內外也行於平等又問平等謂我等涅槃等者人是極下之人涅槃最上之法制令平等高下不二何故制令平等為不等故制令等也然制此二即制一切極下舉人即兼法窮上舉法即兼人故制此二故一切皆等也所以者何釋平等何章平等明我及涅槃皆空是故皆等也。",
        "translation": "When there's a feverish bodhisattva who wants to cease the conception of things, he should be mindful of the following second conditioning of views of things so that views of things are subdued by using things to calm self and self to calm things, which are pure and apparent here.",
        "source": "X19n0343_003:0202a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得是平等無有餘病唯有空病空病亦空。",
        "translation": "Attaining this equality, there are no other illnesses but emptiness, and the illness of emptiness is also empty.",
        "source": "X19n0343_003:0202b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有餘病唯有空病空病亦空下第三調空見令空見息上明無人無法無我無涅槃一切平等彼便作平等解作空解是故更洗明空亦空也故論云若有不空法應當有空法不空既已無空當云何有又云大聖說空法為息諸見故若復著於空諸佛所不化為息諸見故說空法諸見既息竟空法即淨何得更著空法今此亦爾有病既空空病更空也。",
        "translation": "There are no more illnesses but only emptiness, and the illness of emptiness is also empty. The third reason is to adjust the view of emptiness so that the view of emptiness stops.",
        "source": "X19n0343_003:0202b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是有疾菩薩以無所受而受諸受未具佛法亦不滅受而取證也。",
        "translation": "This is a bodhisattva with ailment who takes on feelings without having any feelings, and he attains realization without extinguishing the feelings of the Buddha's teachings.",
        "source": "X19n0343_003:0202b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是有疾菩薩應以無受下第二明化佗調伏前自行調伏有三謂眾生空法空空病亦空今明化佗調伏亦有三章第一無受而為眾生受身第二為眾生受苦第三為化導眾生此之三章亦是次第何者菩薩未曾受為眾生故受身為眾生受身何所為為眾生有菩薩同眾生苦同眾生苦不容默然而住同其苦者為欲化導令其離苦也三章之中今即第一無受而受諸受者何故常爾有此即一切不受不受我不受法不受有不受無一切無所受恐作無受解墮二乘地經中何意云墮二乘地耶墮無受空見名二乘地為是義故今明無受而受雙彈二見無受即彈凡夫而受彈二乘凡夫受於受二乘受無受今菩薩雙淨不受受不受無受如大品不行亦不受不受亦不受是名菩薩無受三昧不與二乘共也問菩薩無受受凡夫亦得無受受不解亦得菩薩無受而受凡夫亦無受而受何者故經云眾生與菩薩畢竟無所有而眾生多顛倒如是無所有於眾生如是有本同於眾生成不眾生即不受故菩薩不受受菩薩不受受欲化眾生受故受令同菩薩無受受故云以無所受而諸受也未具佛法亦不滅受而取證者明未具佛法終不滅受自取於證二乘之人不為眾生自滅捨受取證涅槃今菩薩當以二慧化眾生令佛法若未具佛法不滅受而取證也。",
        "translation": "The second thing that the ailing bodhisattva should do is to make himself subdue by having no sensation. There are three ways to make oneself subdue, which are sentient beings are empty, dharmas are empty, and illnesses are empty. There are also three ways to make oneself subdue: first, having no sensation and accepting the body for sentient beings; second, accepting suffering for sentient beings; and third, accepting the body for the sake of guiding sentient beings.",
        "source": "X19n0343_003:0202b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設身有苦念惡趣眾生起大悲心我既調伏亦當調伏一切眾生但除其病而不除法。",
        "translation": "If sentient beings with painful thoughts in their bodies and sentient beings in bad destinies arouse great compassion, then I'll tame them and tame all sentient beings, but I'll remove their illnesses and not their dharmas.",
        "source": "X19n0343_003:0202c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "設身有苦念惡趣眾生者第二同眾生苦眾生受身有苦菩薩亦受身有菩薩有身有苦常念眾生有身有苦菩薩有苦既用空調伏眾生有苦亦應用三空調伏眾生所以爾者此中正為始行菩薩作此法門汝既用上三空自調伏亦應以三空調伏眾生故云既自調亦當調伏眾生也但除其病而不除法者此從上三空自調生何者上破我見破法見破空見或者便謂有三法之可除是故今明除妄見實無三法之可除未曾眾生不眾生病見眾生破病眾生實無眾生可除法及空亦爾故但除其病而無三法可除故云不除其法舉喻如空華眼病見空華但除其眼實無華可除百論亦外人云是破自破明若本自空即不應破論云舉喻答如人見陽炎謂言是水智者告之實非水此即但破想謂無水可破攝大乘論云鹿渴鹿渴故見陽炎謂言是水而走赴之實無水可得令此中亦爾但破其見病實無法可除。",
        "translation": "Suppose the body has suffering and mindfulness of sentient beings in evil destinies, the second suffering of sentient beings is the same as sentient beings who experience body as suffering, bodhisattvas who also experience body as suffering, bodhisattvas who have body as suffering, and bodhisattvas who have suffering.",
        "source": "X19n0343_003:0202c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為斷病本而教導之。",
        "translation": "He teaches it in order to stop the root of the disease.",
        "source": "X19n0343_003:0203a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂病本謂有攀緣從有攀緣則為病本何所攀緣謂之三界。",
        "translation": "\"What's meant by the root of the disease that there's an apprehension, and from that apprehension comes the root of the disease? What apprehension is called the three realms?",
        "source": "X19n0343_003:0203a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何斷攀緣以無所得若無所得則無攀緣何謂無所得謂離二見何謂二見謂內見外見是無所得文殊師利是為有疾菩薩調伏其心。",
        "translation": "How is the clinging condition stopped because there's no gain? If there's no gain, then there's no clinging condition? What's meant by no gain? What's meant by two views? Internal views and external views are unobtainable, Mañjuśrī. This is a troubled bodhisattva who tames his mind.",
        "source": "X19n0343_003:0203a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為斷病本而坂導之下第三明菩薩同病而坂導之同其受苦不可嘿住應須坂化今離病本病本若淨即無病果也就此為二前標病本坂導二章門如文何謂病本謂有攀緣下第二釋二章門即為二今前擇病本章門謂有攀緣者攀緣只是有所得攀人攀法攀有攀無攀凡攀聖有一豪心念即是攀緣故經云動即魔網不動即法印生心動念即攀緣有攀緣故有病故攀緣為病本也何所攀緣謂之三[由/介]者有攀緣故所以輪迴三界不能出離在火宅中[雖-虫+(人/〡)]遭大苦不以為患如此等竝由有所攀緣故不能勉脫二十五有生老病死是故經云有所得者名曰無明二十五有無所得者名曰智慧名大涅槃有所得者無明為目得生二十五有果故云攀緣謂之三界也云何斷攀緣下第二釋教導章門云何斷攀緣以無所得以無所得斷攀緣當知有所得即攀緣有所得攀緣不能離三界故受身受身故有苦以無所得斷攀緣故無三界因無因無果故云云何斷攀緣以無所得也何謂無所得謂二見者明見內見外見有見無即是有所得若能不見內不見外不見有不見無了此二見即無所得即是般若非離此二見外別有無所得正觀今明只了此二見即實相正觀觀身實相觀佛亦然也何謂二見謂內見外見者心為內身為外自身為內佗身為外眾生數為內非眾生[敲-高+安]為外若能打破此內外二見即無所得即斷攀緣故謂內見外見是無所得也。",
        "translation": "In order to cut off the root of illness and to give guidance, the third point is that the bodhisattva is suffering from the same illness and gives guidance to it. If the root of illness is purified, then there will be no result of illness.",
        "source": "X19n0343_003:0203a22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "為斷老病死苦是菩薩菩提若不如是己所修治為無慧利譬如勝怨乃可為勇如是兼除老病死者菩薩之謂也。",
        "translation": "To end the suffering of old age, illness, and death is the bodhisattva's enlightenment, and if one doesn't cultivate it as such, it's lacking in the benefits of wisdom like overcoming enemies to become brave.",
        "source": "X19n0343_003:0203b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為斷老病死苦是菩薩菩提下第三雙就自行化佗明調伏前自行中亦三次就化佗中亦三今雙就自行化佗亦為三第一法說第二譬說第三合譬今即第一法說言為斷老病死是菩薩菩提者明自斷心煩惱身老死復能斷佗心煩惱身老死以能自斷斷佗故名菩薩菩提也問二乘亦能斷老病死亦名菩提解云二乘唯能自斷不能斷佗故非菩提菩薩自斷斷佗故名菩提也問菩薩只應斷三毒等煩惱云何言斷老病死苦耶解云此因中說果明因無故即果無也又老病死即是三毒何者貪欲老瞋恚病愚癡死故斷三毒即斷老病死也若不如是己所修福為無慧利者不能自斷為無利不能斷佗為無慧能自斷即有利能斷佗即有慧故云不如是己所修福為無慧利也譬如勝怨乃可為勇下第二譬說言勝怨乃可勇者明能除自佗兩怨乃可為勇如即世人能破怨敵乃勁勇菩薩亦爾打破自一切煩惱復能破佗故名勁勇故大品譬如勇夫狀將老弱越諸嶮難也如是兼除老病死者菩薩之謂下第三合譬自除老病死復能除佗故云兼除也。",
        "translation": "In order to end the suffering of old age, illness, and death, which is the bodhisattva's enlightenment, the third parable below the self-transforming woos explains that the self-transforming woos are also three times in the previous self-transforming woos, and now the first parable explains that the second parable explains that the third combined parable is the first parable that says, \"To end old age, illness, and death is the bodhisattva's enlightenment.\" He explains that he himself ends mental afflictions, body old age, and death, and he can also end woos, mental afflictions, body old age, and death.",
        "source": "X19n0343_003:0203c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有疾菩薩應復作是念如我此病非真非有眾生病亦非真非有。",
        "translation": "That sick bodhisattva should again think, \"Thus, this illness of mine is not real and not existent, and the numerous illnesses are not real and not existent.",
        "source": "X19n0343_003:0204a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼有疾菩薩應復作是念下調伏章中大段第二明自行化佗得失上唯明自行化佗而自行化佗復有得有失明有方便為得無方便為失為此著故次第二明自行化佗得失亦是簡前自行化佗義也就此亦為三第一明自行得失第二明化佗得失第三雙明自行化佗得失亦是成前三何者第一明自行得失成前第一自行第二化佗得失成前第二化第三成前第三也今即第一明自行唯得無失第二佗及第三竝有得失今第一自行應是得失但略明得不明失者斯乃相兼故耳菩薩應念我病非真非有眾生病亦非真非有此中正教始行菩薩作於此觀汝既知汝病非真非有亦應知眾生病非真非有也問非真與非有何異解云有異有不異不異者只此病非真實有也言異者非真非實有非有非假有知此病非實有亦非假有若言病非實有是假有者還是繫縛何者同是有同是病是故今明此病非實有亦非假有也問菩薩病非實非假眾生病亦非實非假眾生與菩薩更何異解云菩薩與眾生畢竟復更有何異故一家有同源義佛與眾生同共一源義也同源出何處關中云天地與我同根萬物與我一體此中亦是菩薩與眾生同非真非有也。",
        "translation": "The bodhisattva with illness should again make this thought in the next chapter of taming the great section, the second section that explains the gain and loss of self-transforming woos, the first section that only explains the gain and loss of self-transforming woos, and the second section that explains the gain and loss of self-transforming woos again, because of this attachment, the second section that explains the gain and loss of self-transforming woos is also a brief summary of the previous meaning of self-transforming woos.",
        "source": "X19n0343_003:0204a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是觀時於諸眾生若起愛見大悲即應捨離。",
        "translation": "When he observes this, if he gives rise to craving for sentient beings, he should abandon them with great compassion.",
        "source": "X19n0343_003:0204b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何菩薩斷除客塵煩惱而起大悲愛見悲者則於生死有疲厭心若能離此無有疲厭在在所生不為愛見之所覆也所生無縛能為眾生說法解縛如佛所說若自有縛能解彼縛無有是處若自無縛能解彼縛斯有是處是故菩薩不應起縛何謂縛何謂解貪著禪味是菩薩縛以方便生是菩薩解。",
        "translation": "Why is that? A bodhisattva who ends the afflictions of objective objects and arouses great compassion for those who have views of love and pity then becomes weary of birth and death. If he can part with this, there's no weariness in being born, and he's not covered by views of love.",
        "source": "X19n0343_003:0204b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是觀時下第二明化佗有得失就此文為二第一雙標得失次第二釋得失今即第一明失菩薩作是觀時於眾生起愛見大悲是即為失也問前云菩薩知自病非真非有知眾生病亦非真非有了此二皆畢竟空無所有今何故起愛見大悲耶解云此義縛已何者明菩薩自知眾生及菩薩皆非真非有而於眾生成真有作於此解即是菩薩愛見大悲何者自謂言了眾生及自無所有而謂眾生不能知無所有謂有菩薩能了眾生不能了眾生所度菩薩能度見眾生見大悲愛眾生大悲此即愛見二種故云愛見大悲名之為失也即應捨離此即是得若作上來所見即是失若離此解是即為得故云即應捨離也所以者何下第二釋得失就此明得失次舉縛解來釋今前釋失若見有菩薩為能度眾生為所度即為愛見大悲若有一愛見大悲即於生死有疲厭如大品中所明有所得菩薩生死長眾生多何時可度即便退菩薩行亦如身子菩薩行人就乞眼即便與眼婆羅門得眼蹋破身子即退還二乘斯等竝有眾生見有生死即於生死有畏厭心故云愛見悲者即於生死有疲厭心也若能離此無有疲厭弁得也不見菩薩為能度眾生為所度度眾生猶如度虗空故夢誓品云菩薩立誓度眾生如虗空眾生性如虗空性虗空若不可盡菩薩度眾生亦不能盡雖度眾生如度虗空無所度而度亦如金剛波若遍度一切而無所度故云若能離此無有疲厭在於六道不為愛見縛而能解縛也次引佛言勸捨失如文何謂縛何謂解次釋縛解貪著禪味是菩薩縛此非是二乘禪味為縛正是菩薩為禪所縛何者見靜散二棄捨散取靜靜本既散既無散即應捨靜而今捨散著靜即為靜所縛故貪著禪味即菩薩縛也以方便生即釋解方便生者本以靜息散散息靜疲不著靜不著散即解也。",
        "translation": "When making this observation, the second clarification of the gain and loss of the teaching of the existence of sentient beings is the first of two double labels of gain and loss, followed by the second explanation of gain and loss.",
        "source": "X19n0343_003:0204b18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○又無方便慧縛下得失章中有三兩章已章今即第三雙明自行化佗得失就此復為二第一通就二慧明得失第二別就二慧明得失通就二慧明得失為三第一雙標得失二章第二雙釋得失第三結勸今即第一雙標二慧得失然二慧名字不同一方便智二實智此竝出仁王經故彼經云方便智功德實智功德又論番般若有二種一般若道二方便道大品云道慧道種慧一切智一切種智如此等竝一類語也今此中直云方便慧即是二慧之名如肇師云統萬行以權智為主權即權智智即實智此中亦爾方便即方便慧慧即實慧然肇師何故作此語彼云既注此經見此經文巧略故有斯意也問此中約何法為判二慧耶解云此中正照有化佗為方便觀空自行為實慧也然什師解云照空不著空觀有不著有名方便慧直照空名實慧問什師此解出何處解云出大品不證品菩薩學空不證如有翼鳥及善射譬鳥飛空不住空善射亦爾後箭射前箭前箭不得墮方便慧射實慧實慧不墮二乘地也彼師標此意釋佗即難汝若觀空不著照有無礙為方便時亦應直照有為實慧而今直照空為實亦應直照有為方便汝既觀有不著為方便亦應觀空不證為實慧解云何必盡例判二慧多種而今什師所解雖言有難而意大好若直以空有判二慧雖無難而意不好今且依什師所明觀空不著照有無礙為方便直觀空為實也。",
        "translation": "Furthermore, in the chapter on attaining and losing under the bondage of nonconvenient wisdom, there are three chapters and two chapters, and now the third one is a double explanation of the attaining and losing of self-realization of wisdom. The first one is a double explanation of the attaining and losing of two kinds of wisdom, and the second one is a double explanation of the attaining and losing of two kinds of wisdom.",
        "source": "X19n0343_003:0205a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無方便慧縛有方便慧解無慧方便縛有慧方便解。",
        "translation": "Also, without skillful wisdom binding there's skillful wisdom understanding, and without skillful wisdom binding there's skillful wisdom understanding.",
        "source": "X19n0343_003:0205b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今即第一標章門有四句為兩對初明實慧得失次明方便慧得失今即第一明實慧得失無方便慧縛即實慧失明實慧無方便慧故實慧即縛何者此空是有空既無有資此空此空不成空故云無方便慧縛也有方便慧解者即明實慧得此實有方便故實慧為得既有有資空空即成空是故有方便慧解也方便慧得失及此可知也。",
        "translation": "Now, the first section of the chapter has four phrases that are twofold. First, it explains the gain and loss of real wisdom, and then it explains the gain and loss of expedient wisdom. Now, the first one explains the gain and loss of real wisdom.",
        "source": "X19n0343_003:0205b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂無方便慧縛謂菩薩以愛見心莊嚴佛土成就眾生於空無相無作法中而自調伏是名無方便慧縛。",
        "translation": "What's called the bond of wisdom without skillful means that a bodhisattva adorns the Buddha-lands with the mind of love and views, accomplishes the sentient beings in emptiness, signlessness, and unconstructedness, and subdues them on his own is called the bond of wisdom without skillful means.",
        "source": "X19n0343_003:0205b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂有方便慧解謂不以愛見心莊嚴佛土成就眾生於空無相無作法中以自調伏而不疲厭是名有方便慧解。",
        "translation": "What's called having skillful wisdom and understanding that doesn't adorn the Buddha-Lands with a mind attached to views of love and accomplishes sentient beings in the midst of emptiness, signlessness, and unconstructedness with self-control and without weariness is called having skillful wisdom and understanding.",
        "source": "X19n0343_003:0205b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂無方便慧縛下第二雙釋二慧得失為二第一釋實慧得失第二釋方便慧得失前釋實慧得失約深行次釋方便得失約淺行二皆通實既約深方便亦得約深方便既約淺實慧亦應約淺而今實慧約深方便就淺者互其文耳兩章中各有得失雖應兩段合為兩章兩章為論今即第一明實慧得失前明實慧失也問云菩薩淨佛國土成就眾生於空無相而自調伏云何為失耶解云只此是失何者此菩薩巧於空無礙拙於有不動此菩薩觀空不著空故空不礙而出空修行成就眾生淨佛國土即不能無礙見有土可嚴見有人之可度成有所得是故為失也問此是何位人解云關中相承此是六地已下初心已上人耳入空不著礙出空不能無所礙故為失也何謂有方便慧解者第二釋實慧得此菩薩於空無礙於有不動畢竟空不礙有有不礙畢竟空雖嚴土無土可嚴雖度眾生無眾生可度是故得此即七地菩薩大品云等定慧地能空有竝觀觀空不礙有觀有不礙空故有方便慧解也。",
        "translation": "The first explains the gain and loss of real wisdom, the second explains the gain and loss of expedient wisdom, the first explains the gain and loss of real wisdom, the second explains the gain and loss of expedient wisdom, and the second explains the gain and loss of expedient wisdom, and the second explains the gain and loss of expedient wisdom, and the second explains the gain and loss of expedient wisdom, and the two are both shared.",
        "source": "X19n0343_003:0205b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂無慧方便縛謂菩薩住貪欲瞋恚邪見等諸煩惱而植眾德本是名無慧方便縛。",
        "translation": "What's called the skillful binding without wisdom that means a bodhisattva abides in the afflictions of desire, anger, and wrong views and plants merit in the root is called the skillful binding without wisdom.",
        "source": "X19n0343_003:0205c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂有慧方便解謂離諸貪欲瞋恚邪見等諸煩惱而植眾德本迴向阿耨多羅三藐三菩提是名有慧方便解。",
        "translation": "What's called skillful liberation with wisdom that's free of such afflictions as desire, anger, and wrong views and which cultivates the roots of virtue and leads back to unsurpassed, correct enlightenment is called skillful liberation with wisdom.",
        "source": "X19n0343_003:0205c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何謂無慧方便縛下第二明方便慧得失亦二今即第一明方便慧失此是淺行之人不能觀空住諸煩惱而修諸行是故為失也問上實慧失巧於空無礙拙於有不動今方便慧失亦應巧於有無礙拙於空不動解云不得巧於空無礙拙於有不動不得巧於有無礙拙於空不動何者空易有難乍得解易不解難番不解易故也又上不能嚴土不能成就眾生今忽云殖眾德本者明淨土度眾生此是深行今淺行之人作諸行功德尚不成況修於深行為此故直云植諸德本也何謂有慧方便解者第二釋方便慧得雖觀諸法畢竟空而不礙修諸萬行故為得也問實慧失方便失兩失何異實慧得方便得兩得何異解云兩失異何者實慧失即深方便失即淺若兩慧得即齊何者同得二慧故也。",
        "translation": "This is the first explanation of the loss of expedient wisdom. This is the shallow practitioner who can't observe emptiness, abide in afflictions, and cultivate practices; therefore, it's a loss. The above question is about the loss of real wisdom, which is skillful in emptiness, unobstructed, and awkward in existence, and the loss of expedient wisdom, which should also be skillful in existence, unobstructed, and awkward in emptiness, and immovable.",
        "source": "X19n0343_003:0205c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利彼有疾菩薩應如是觀諸法。",
        "translation": "Mañjuśrī, these faltering bodhisattvas should thus contemplate the Dharma.",
        "source": "X19n0343_003:0206a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利應如是觀即第三結觀也。",
        "translation": "Mañjuśrī should thus observe them, which is the third conjugation of observation.",
        "source": "X19n0343_003:0206a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復觀身無常苦空非我是名為慧雖身有疾常在生死饒益一切而不厭倦是名方便又復觀身身不離病病不離身是病是身非新非故是名為慧設身有疾而不永滅是名方便。",
        "translation": "Again, observing that the body is impermanent, painful, empty, and not self is called wisdom, even though the body has illnesses and is always present in birth and death to benefit all without tiring is called skillful means. Again, observing that the body doesn't part from illness and illness doesn't part from the body, and that illness is the body and not new or old is called wisdom.",
        "source": "X19n0343_003:0206a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復觀身無常下第二別明二慧得失此中明二慧異前此用觀身無常等為實慧現身有疾為方便如文又復觀身身不離病復是一種判二慧以觀身不離病病不離身為實慧不滅身為方便慧言身不離離病不離身者明有身即病即病即有身是病是身病身故身不離病身病故病不離身也是病是身非新非故者謂身為故病為新今明身畢竟不可得故非故病畢竟不可得故非新非新故無病非故故無身故云是病是身非新非故也設身有病而不永滅者二乘之人患身即滅身今菩薩不爾眾生未具佛法菩薩終不永滅也。",
        "translation": "Again, observing that the body is impermanent is the second way to separately explain the gains and losses of the two kinds of wisdom. This explains that the two kinds of wisdom are different from the previous one, which uses observing that the body is impermanent and so forth as real wisdom, and that presenting the body with illness is convenient as explained in the text.",
        "source": "X19n0343_003:0206a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利有疾菩薩應如是調伏其心不住其中亦復不住不調伏心所以者何若住不調伏心是愚人法若住調伏心是聲聞法是故菩薩不當住於調伏不調伏心離此二法是菩薩行在於生死不為汙行住於涅槃不永滅度是菩薩行非凡夫行非賢聖行是菩薩行非垢行非淨行是菩薩行雖過魔行而現降伏眾魔是菩薩行求一切智無非時求是菩薩行雖觀諸法不生而不入正位是菩薩行雖觀十二緣起而入諸邪見是菩薩行雖攝一切眾生而不愛著是菩薩行雖樂遠離而不依身心盡是菩薩行雖行三界而不壞法性是菩薩行雖行於空而植眾德本是菩薩行雖行無相而度眾生是菩薩行雖行無作而現受身是菩薩行雖行無起而起一切善行是菩薩行雖行六波羅蜜而徧知眾生心心數法是菩薩行雖行六通而不盡漏是菩薩行雖行四無量心而不貪著生於梵世是菩薩行雖行禪定解脫三昧而不隨禪生是菩薩行雖行四念處不畢竟永離身受心法是菩薩行雖行四正勤而不捨身心精進是菩薩行雖行四如意足而得自在神通是菩薩行雖行五根而分別眾生諸根利鈍是菩薩行雖行五力而樂求佛十力是菩薩行雖行七覺分而分別佛之智慧是菩薩行雖行八正道而樂行無量佛道是菩薩行雖行止觀助道之法而不畢竟墮於寂滅是菩薩行雖行諸法不生不滅而以相好莊嚴其身是菩薩行雖現聲聞辟支佛威儀而不捨佛法是菩薩行雖隨諸法究竟淨相而隨所應為現其身是菩薩行雖觀諸佛國土永寂如空而現種種清淨佛土是菩薩行雖得佛道轉於法輪入於涅槃而不捨於菩薩之道是菩薩行。",
        "translation": "Although the bodhisattva practices are not the practices of ordinary people, they are not the practices of noble people.",
        "source": "X19n0343_003:0206b08_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "文殊師利有病菩薩應如是調伏下大段第二歷法明調伏然從調伏章生至此凡有三節語第一用三空自調伏一者調我今我見息二者調伏法令法見息第三調伏空令空見息既用此三法自調伏亦以三法調伏而生既自悟此三法還令眾生同我所悟此有異二乘何者二乘之人唯能自調不能調佗何故二乘之人被調之人何能調佗菩薩不爾能自調復能令佗調也次第二節菩薩能自調復能佗調義若為若菩薩能自調有眾生可調有菩薩能度眾生所度不是故更簡明有菩薩自調有眾生所調有菩薩能度眾生所度若便如菩薩即成有所得愛見大悲翻被佗調何能調佗若能無所得無菩薩能自調無眾生之可調雖自調無自之可調雖調佗無佗之可調畢竟無所有無所得乃名為調也次第三明若使如此有菩薩能調眾生所調成有所得非是調伏若能無眾生所調無菩薩能調能所不二乃是調伏為此故今更卷亦非有所得非調亦非無所得能調未曾調不調非調非不調是故文言不住調伏心亦不住不調伏心也然有此三節調者只為眾生有此三種故有此三調譬如調馬須[糸*量]須絆馬須[糸*量]須絆馬若調竟不須[糸*量]絆今亦爾也所以者何釋若住不調伏即愚人若住調伏即聲聞法今菩薩非此二非凡夫故不住非調伏非聲聞故不住調伏離此二法是菩薩法也在於生死不為汙行者前即雙捨今即雙用二乘之人斯即偏證不住不調伏即住調伏不住生死而住涅槃今菩薩不爾捨即雙捨用即雙用既住涅槃亦不捨生死雖住生死而不汙行雖處涅槃而不永滅雖處生死實無生死可處雖住涅槃實無涅槃可住故云在生死不為汙行住涅槃不永滅也非凡夫行非賢聖行者明上雙離已竟今何故有此文來解云上雙捨三法今雙捨人法人法為異故有今文也雖過魔行者然此中四句一者雙捨雙用二者雙捨單用三者單捨雙用四者單捨單用上不住調伏不住不調伏即雙捨在生死住涅槃即雙用也今此下即單捨單用也雖觀十二緣起而入諸耶見者問觀十二緣是正觀云何言入耶解云了悟正不礙耶耶不礙正既是無礙人即有無礙法也雖攝一切眾生而不愛著明菩薩雖悲眾生身出於血而實無所悲故言雖攝一切眾生而不愛著也雖樂遠離而不依身心盡者明遠離有二種一小遠離二者大遠離俗人隱亦有二謂小隱隱山林大隱隱朝市佛法亦二隱山林為小隱患此身心暄動滅此身心為大隱菩薩雙非此二雖樂遠離非是小隱不依身心盡非是隱也雖行三界不壞法性者明雖處三界而不動也餘文可尋。",
        "translation": "Mañjuśrī, the sick bodhisattva should thus regulate, but from the chapter on regulating birth up to this point there are three sections of discourse that first use the three qualities to regulate themselves, first to regulate themselves, first to regulate themselves, now I see calm, second to regulate themselves and decree that the Dharma see calm, third to regulate emptiness and cause emptiness to see calm.",
        "source": "X19n0343_003:0206c13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "說是語時文殊師利所將大眾其中八千天子皆發阿耨多羅三藐三菩提心。",
        "translation": "When he spoke these words, Mañjuśrī assembled a large group of 8,000 celestials, all of whom had aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "X19n0343_003:0207b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說是語下第三門疾後利益即後方便也。",
        "translation": "The third aspect below these words is the benefit of hastiness and subsequent skillful means.",
        "source": "X19n0343_003:0207b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(卷三終)",
        "translation": "(End of Vol. 3)",
        "source": "X19n0343_003:0207b20_1",
        "is_bad_quality": false
    }
]