[
    {
        "source_sentence": "維摩經疏第二",
        "translation": "Second Commentary on the Vimalakīrti Sutra",
        "source": "X19n0343_002:0167b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "胡　吉藏　撰",
        "translation": "Compiled by Hu Jizang",
        "source": "X19n0343_002:0167b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方便品第二",
        "translation": "Second Chapter of the Skillful Means Category",
        "source": "X19n0343_002:0167b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方便品第二然此經二處四會方丈二會斯即第一言方便品者方便有通有別言通方便者菩薩無為而無所不為無所不為而無所為故言方便此中不以無所不為為方便以無所為無所不為合此語圓通無礙為方便言別方便者淨名與五百長者為法城等侶出入未曾不同五百俱至而淨名不來即知有疾所以疾者方便疾也故下文云以方便故現身有疾此是方便疾今題稱方便為是通為是別耶解云具此二種菩薩無為無所不為遍作一切故是通而今正現身疾故是別即是一多方便此從為名故方云方便品問大經現疾即名現疾品今淨名現疾何故不名現疾品而云方便品耶解云現疾名局方便名廣何者現病品是方便一友用耳為是故不題現病品問現病是方便一支者大經何故標耶解云大經文中唯有現病事故題現病品此文廣明淨名一切方便故不得題現病品也(更須云云)就此品中開為四第一明方便處第二辨方便人第三標名第四歎德。",
        "translation": "The second aspect of the skillful means is that there are two places in this sutra, four assemblies, and two assemblies in the abbot's quarters, which is the first aspect of the skillful means.",
        "source": "X19n0343_002:0167b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時毗耶離大城中。",
        "translation": "It was then that there was an elder in the great city of Vaiśālī.",
        "source": "X19n0343_002:0167b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有長者。",
        "translation": "There was an elder.",
        "source": "X19n0343_002:0167b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "名維摩詰。",
        "translation": "He was called Vimalakīrti.",
        "source": "X19n0343_002:0167b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今即第一明方便處方便處者即毗耶國方丈之室此處乃是方便之處如法尚香城彌勒樓觀非二乘凡夫所惻故是方便處也有長者即第二明方便人有長仁之德故云長者名維摩詰即第三標名番譯如前玄中三門釋。",
        "translation": "This is the first place that shows the place of convenience. The place of convenience is the abbot's quarters in Vaiśālī. This place is a place of convenience like the fragrant city of Fashang, where Maitreya's mansion is contemplated by worldlings who aren't adherents of the two vehicles.",
        "source": "X19n0343_002:0167b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已曾供養無量諸佛深植善本得無生忍辯才無礙遊戲神通逮諸總持獲無所畏降魔勞怨入深法門善於智度通達方便大願成就明了眾生心之所趣又能分別諸根利鈍久於佛道心已純淑決定大乘諸有所作能善思量住佛威儀心大如海諸佛咨嗟弟子釋梵世主所敬。",
        "translation": "Having made offerings to measureless buddhas, he deeply cultivates good roots, attains the patience of nonproduction, has unimpeded eloquence, plays with supernormal powers, acquires mastery, attains fearlessness, subdues demons, labors, and enters into the profound teaching, is adept at knowing and liberating, comprehends skillful means, fulfills the great vow, understands the destinies of sentient beings' minds, discerns the sharpness and dullness of their faculties, has long been on the Buddha path, and has a mind that's pure, determined, and is capable of making all undertakings, can skillfully contemplate, abides in the Buddha's deportment, and has a mind as large as the ocean, and is venerated by the disciples of Śākyamuni and the lord of the world who searched for him.",
        "source": "X19n0343_002:0167c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已曾供養第四歎德就文為二第一歎本第二歎迹故肇師云幽關難啟聖應不同非本無以乘迹等(云云)今初言已曾供養者歎三多具足也深殖善本者上明雖種三多為淺為深耶是故今明深殖善本不為有得顛倒之所傾動故云深殖者也得無生忍者良由久種三多深殖善本故得無生忍也辯才無礙者上歎內有無生之慧今歎外有無礙之才此之二句相成也遊戲神通者外道二乘一神通即有礙不名遊戲今菩薩無礙故云戲也逮諸總持者上明諸善根等恐經生漏失今明總持不忘持惡不起持善不失獲無所畏者菩薩得無生故無所畏何者無他無自故所無畏也降魔勞怨者若見有無見他見自即為魔為怨若能淨如斯等即是降也善於智度此歎方便實通達方便今歎實方便也大願成就者上歎行此下歎願也又能分別者巧知眾生根性應以人天五乘等得度而度之若無五乘之緣者則大慈心被之終不捨置即隨化也住佛威儀者上菩薩德以歎今舉佛德以歎之諸佛咨嗟弟子釋梵者上來歎德今即歎名也。",
        "translation": "The first is that the person who has made offerings is praising the fulfillment of the three qualities, and the first is that although the three qualities are planted, are they shallow or deep? Therefore, it's clear that the good qualities are deeply planted, and they aren't tilted by the confusion of attaining existence.",
        "source": "X19n0343_002:0167c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○欲度人故下第二歎迹亦前歎實今歎權然佛多作本迹歎菩薩多作實方便歎今以內功德為本外變動為迹亦身居玅憙為本現在方丈為迹也就此為二第一現疾不疾方便第二現不疾疾方便然菩薩非疾不疾能疾能不疾也就初為二第一作多一方便第二作一多方便言多一即淨名一身言一多者作無量身此之一多豈多一所能果非一多能一多耳就一中更為二第一處方便第二出處方便此之出處亦非出處所能非出處能出處耳。",
        "translation": "The desire to save people therefore is followed by the second praise of the traces, which was praised before as real and is praised now as expedient. However, the Buddha often praises the traces originally, and the bodhisattvas often praise the true expedient. Here, there are two first methods of manifesting illness and not being swift, and the second method of manifesting illness and not being swift.",
        "source": "X19n0343_002:0168a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲度人故以善方便居毗耶離資財無量攝諸貧民奉戒清淨攝諸毀禁以忍調行攝諸恚怒以大精進攝諸懈怠一心禪寂攝諸亂意以決定慧攝諸無智雖為白衣奉持沙門清淨律行雖處居家不著三界示有妻子常修梵行現有眷屬常樂遠離雖服寶飾而以相好嚴身雖復飲食而以禪悅為味。",
        "translation": "Although he wants to save people and therefore lives in Vaiśālī with good skill, he possesses an unlimited amount of wealth and possessions, takes in the poor, conforms to the purity of precepts, takes in violations of prohibitions, cultivates patience, regulates conduct, takes in anger, makes great effort, takes in laziness, concentrates his mind on meditation and tranquility, takes in disturbed thoughts, and gathers in the lack of knowledge with determined wisdom.",
        "source": "X19n0343_002:0168a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今即第一然菩薩未曾處不處此處者欲度人故處毗耶離也初以六度化眾生所以菩薩行六度者為化六弊若無六弊菩薩即無六度故文云奉戒清淨攝諸毀禁以決定慧攝無知等也雖處居家不著三界者異凡殊聖何者二乘人得羅漢不得在家在家不得羅漢若佛在世可得出家無佛世何得出家解云無佛世時得羅漢即辟支佛自能出家今菩薩處家不同二乘不著三界不同凡夫不同而同同凡夫處居家不同而同同二乘不著三界此即能同能不同非同不同所能也。",
        "translation": "Now, this is the first place where a bodhisattva has never been before but is not here because he wants to save people, so he's in Vaiśālī. First, he converts sentient beings with the six perfections, so the bodhisattva practices the six perfections to convert the six ills. If there were no six ills, the bodhisattva would have no six perfections; therefore, the text says that although he is at home and not attached to the three realms, he is different from ordinary people and noble people.",
        "source": "X19n0343_002:0168a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若至博奕戲處輙以度人受諸異道不毀正信雖明世典常樂佛法一切見敬為供養中最執持正法攝諸長幼一切治生諧偶雖獲俗利不以喜悅遊諸四衢饒益眾生入治正法救護一切入講論處導以大乘入諸學堂誘開童蒙入諸婬舍示欲之過入諸酒肆能立其志。",
        "translation": "Even though he understands worldly norms and always enjoys the Buddha's teaching, he always pays respect to all who see and make offerings to the most noble of them all. He upholds the right teaching, includes elders and children, and rules all births harmoniously even though he obtains worldly benefits, doesn't travel to the four quarters with joy and pleasure, benefits sentient beings, rules the right teaching, and guides all into the lecture hall, leads them to the great vehicle, entices them to enter the halls of study, initiates their initiation, enters the houses of prostitution, shows them the faults of desire, enters the restaurants, and establishes their aspirations.",
        "source": "X19n0343_002:0168b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若至博奕戲處下第二出方便博即博塞奕即基奕菩薩同耶者欲令耶同菩薩故菩薩同耶耶既同菩薩即無復耶既無復耶豈復有菩薩耶正既然餘句例爾一切見敬者明一切人見維摩者無不共敬頂禮也為供養中最者若供養維摩者供養中之最供養也何以故以因勝故供養最也入諸婬舍示欲之過者如達慕多羅長者與一女人共入林戲文殊師利化為年少嬈此女女心即迴因令發菩提心女聞菩提心即問何者是文殊答曰只女即是云何為是答云菩提畢竟空無所有女身亦無所有即得無生忍女既得無生還化達慕併得道即示欲過也。",
        "translation": "If the second thing that comes next to the place of play is skillful means, bo is Bosai, and yi is Ki-yi, the bodhisattva is the same as the bodhisattva so the bodhisattva is the same as the bodhisattva, and since they are the same as the bodhisattva, there's no more bodhisattva.",
        "source": "X19n0343_002:0168b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在長者長者中尊為說勝法若在居士居士中尊斷其貪著若在剎利剎利中尊教以忍辱若在婆羅門婆羅門中尊除其我慢若在大臣大臣中尊教以正法若在王子王子中尊示以忠孝若在內宮內宮中尊化正官女若在庶民庶民中尊令興福力若在梵天梵天中尊誨以勝慧若在帝釋帝釋中尊示現無常若在護世護世中尊護諸眾生長者維摩詰以如是等無量方便饒益眾生。",
        "translation": "If he's among elders and elders, his teaching is superior; if he's among householders and householders, he stops their craving; if he's among the bhadras and bhadras, he teaches patience; if he's among the brāhmaṇas and brāhmaṇas, he removes their pride; if he's among ministers and ministers, he teaches the right principles; if he's among princes and princes, he shows loyalty and filial piety; if he's among the inner palace and inner court, he converts the right officials and women; if he's among the common people and common people, he causes merit to flourish; if he's among the Brahmā gods and Brahmā gods, he teaches superior wisdom; if he's among the Indra and Indra gods, he shows impermanence; if he's among the guardians of the world and guardians of the world, he protects the growth of sentient beings.",
        "source": "X19n0343_002:0168c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若在長者長者中下第二作一多方便作無量身說無量教也。",
        "translation": "If he's among the elders and the second among the elders, he'll do one more act of skillful means without tailoring it to explain an immeasurable amount of teaching.",
        "source": "X19n0343_002:0168c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○以其方便現身有疾下第二不疾疾方便上來即是現健方便竟此下現病方便所以作此方便者終是為緣所宜故菩薩現此法門如華嚴自有挊沙法門相靨方法門醫方法門提淵赴火法門今作現病法門只此法門攝一切法門一切法門悉在此一法門故華嚴中云一中解無量無量中解一展轉生非實知者無所畏故此一法門攝一切法門一切法門悉在此一法門也問淨名何故作病法門化耶叡師云欲示無常當因三衰三衰者謂老病死也問三衰之中何故作病方便不作老死方便耶叡師云老待年至不可卒加死即言滅無以化人何者老即必待年答今日少明日自老人謂變化世所不信故不現老若死死即言滅無所以說法化人故不現死若是病即可卒加而言不滅昨日揵今日病世人所信我昨日健今日卒病故知世間無常而於病中復說無常教化為是因緣現病方便不現老死二衰也又所以現病方便者明淨名此意極為宏杜遍化大小二乘一切凡聖是故現病此品即是化一切凡夫由居士有病故一切人民等即來至問居士因以身病為其說法二者由其病故命五百聲聞五百聲聞皆辭不堪即毀辱聲聞高推菩薩即化聲聞三者次命八千菩薩亦辭不堪顯淨名之德即化菩薩欲化此等是故現身有疾也又意所以現病者欲以病化病如女化女即便男化女不便男亦爾今以病化即便以健化病即不便正健說病過患即不信受今正病說病過患便信也明居士身本健而今卒病一切眾生雖健亦病以居士病故一切眾生悉病也又及眾生居士不病病病無所病故無病眾生故病不病故不病雖不病即是病為此故所以現病也就文為四第一正現病第二國人問病第三以人來問病故居士為其說法第四為說法故得悟道。",
        "translation": "It's because of this method that the bodhisattva shows this method, just as Huayan has its own such method as the lotus flower gate, the method of companions, the method of doctors, the method of Tiyan going into the fire, and now he shows the method of manifesting illness, which is the only method that includes all the Dharma gates, and all the Dharma gates are all included in this one Dharma gate.",
        "source": "X19n0343_002:0168c12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "其以方便現身有疾。",
        "translation": "He uses skillful means to show that he's physically ill.",
        "source": "X19n0343_002:0169a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以其疾故國王大臣長者居士婆羅門等及諸王子并餘官屬無數千人皆往問疾。",
        "translation": "Because of their illnesses, the king, ministers, elders, householders, brāhmaṇas, princes, and other officials, numbering thousands of people, all went to ask about their illnesses.",
        "source": "X19n0343_002:0169a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以其方便現身有疾即第一正現病也以其疾故國王大臣下第二國人問疾居士德調一切今身有病誰不詣方丈問疾者耶。",
        "translation": "That's the first direct manifestation of illness, and it's because of his illness that the king's ministers and the next king's people asked about his illness, and the householder virtuously trained all of them. Who wouldn't go to the abbot to ask about his illness now that he's physically ill?",
        "source": "X19n0343_002:0169a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○其往者維摩因以身疾為說法下第三為說法就此為二第一說生死無常厭患第二歎說法身功德所以說此二法者略有二義一者化凡斥聖言化凡者凡夫眾生言生死有常有樂可樂是故今破此見明生死無常苦空不淨甚可患厭也斥二乘者二乘見生死無常苦空不淨便欲捨生死入無餘涅槃所以羅漢入無餘者婆沙云羅漢未入無餘之前猶有身有身即有飢寒疾病故修重空三昧入無餘涅槃故今淨名迴於心不得入無餘涅槃生死雖無常厭患復有微玅之身即佛世尊有玅身常樂我淨此可欣樂當樂佛身何得入無餘涅槃耶此即彈凡聖二見故說此二種法門也第二意者即逼引法門前明生死無常即逼門次說佛地功德即引門為化眾生故開此二門至論生死涅槃何曾有二為眾生故不二強說二道生死無常佛地常樂耳不如他生死佛地定二捨生死取佛果等取捨行心也。",
        "translation": "The first is to explain that birth and death are impermanent and painful, and the second is to praise the merits of the Dharma body.",
        "source": "X19n0343_002:0169b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其往者維摩詰因以身疾廣為說法諸仁者是身無常無強無力無堅速朽之法不可信也為苦為惱眾病所集諸仁者如此身明智者所不怙是身如聚沫不可撮摩是身如泡不得久立是身如焰從渴愛生是身如芭蕉中無有堅是身如幻從顛倒起是身如夢為虗妄見是身如影從業緣現是身如響屬諸因緣是身如浮雲須臾變滅是身如電念念不住是身無主為如地是身無我為如火是身無壽為如風是身無人為如水是身不實四大為家是身為空離我我所是身無知如草木瓦礫是身無作風力所轉是身不淨穢惡充滿是身為虗偽雖假以澡浴衣食必歸磨滅是身為災百一病惱是身如丘井為老所逼是身無定為要當死是身如毒蛇如怨賊如空聚陰界諸入所共合成諸仁者此可患厭。",
        "translation": "其往者維摩詰因以身疾廣為說法諸仁者是身無常無強無力無堅速朽之法不可信也為苦為惱眾病所集諸仁者如此身明智者所不怙是身如聚沫不可撮摩是身如泡不得久立是身如焰從渴愛生是身如芭蕉中無有堅是身如幻從顛倒起是身如夢為虗妄見是身如影從業緣現是身如響屬諸因緣是身如浮雲須臾變滅是身如電念念不住是身無主為如地是身無我為如火是身無壽為如風是身無人為如水是身不實四大為家是身為空離我我所是身無知如草木瓦礫是身無作風力所轉是身不淨穢惡充滿是身為虗偽雖假以澡浴衣食必歸磨滅是身為災百一病惱是身如丘井為老所逼是身無定為要當死是身如毒蛇如怨賊如空聚陰界諸入所共合成諸仁者此可患厭。",
        "source": "X19n0343_002:0169b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二章之中今即第一明生死可厭患諸仁者是身無常無強者即事無強向健今病故無常無強也為苦即八苦為總即九總也無力不能排病故無力也是身無主為如地者明內外四大更無有異外大山河樹等內大四支百體更無有二聚外四大成內四大內四大壞還成外四大外大不異內大外大既無主內亦無主也是身無我為如火者上明外地大不異內地大彼謂云外大無情不能造作強為可無主內大有情能有所為去來語嘿等何得無有主耶故今明如火有藪故有無薪即無薪小火小薪大火大燒竹木出諸音聲外大不自在故無我內大亦爾順緣即貪違緣即瞋不自在亦無我也是身無定為要當死者問無定何故復云要當死必死即定何故云不定解云此兩句無定是一句要當死是一句身無定者明是老少中年無定雖復老少長短無定要必當死又不定者死者不同或水火自死他死故不定雖爾定死也諸仁者此可患厭者此即結前。",
        "translation": "In the midst of the two chapters, this is the first one that explains that birth and death can be disgusting and troublesome.",
        "source": "X19n0343_002:0169c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當樂佛身所以者何佛身者即法身也從無量功德智慧生從戒定慧解脫解脫知見生從慈悲喜捨生從布施持戒忍辱柔和勤行精進禪定解脫三昧多聞智慧諸波羅蜜生從方便生從六通生從三明生從三十七道品生從止觀生從十力四無所畏十八不共法生從斷一切不善法集一切善法生從真實生從不放逸生從如是無量清淨法生如來身諸仁者欲得佛身斷一切眾生病者當發阿耨多羅三藐三菩提心。",
        "translation": "The Buddha's body should be enjoyed. Why is the Buddha's body the Dharma body? It arises from measureless merits and wisdom, from morality, meditation, wisdom, liberation, knowledge and vision, from compassion, joy, and equanimity, from generosity, morality, forbearance, humility, gentleness, diligence, effort, meditation, liberation, samādhi, well-versed wisdom, the perfection of wisdom, from the thirty-seven factors of the path, from calmness and contemplation, from the ten powers, the four fearlessnesses, the eighteen distinctive qualities, from ending all unskillful qualities and collecting all good qualities, from true and genuine birth, from nonfrivolity, and from these measureless pure dharmas, the Tathāgata's body should be developed by those who want to attain the Buddha's body and end all ills.",
        "source": "X19n0343_002:0170a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當樂佛身下第二明佛法身功德患厭者可有三種人患厭一者即世凡夫雖知此身不淨患厭厭而不捨也二者即二乘人患厭生死捨生死永入無餘涅槃三者即菩薩厭生死無常不淨而求佛身功德常樂我淨今此正斥二乘當樂佛身也所以者何佛身即法身者釋當樂佛身也然由來人解此不得去何者小乘云佛王宮生八十年住雙林滅此即大期三相其中復有念念三相與羅漢無異但身麤玅為異三相所切更無復殊若使如此何足可樂如此間負人五時教義初教八十年佛第二大品教開善云還是八十年佛但初教色身為佛第二時種智為佛招提云持尊佛為異耳第三維摩思益教還以種智為佛但壽七百阿僧祇劫此解終是無常無常更復何異此即不足可樂故大經云初譬糞穢多小俱臰多小之壽亦爾由來解云此中是序非維摩正說即難正說可是經序說應非經而今序正皆是經故知由來失之大甚也今維摩釋云佛身者即法身也明生死無常可患佛地法身常樂我此欣樂故云佛身即法身也此中明法身者大品法尚所明法身無去無來亦如大經金剛身品百非不非千是不是今法身亦復如此明佛身不生不滅不去不來畢竟清淨故肇師云隨之不得其蹤迎之罔眺其首四趣無以攝其生力負無以化其體此即法身故可樂也從無量功德生者釋得佛之由若欲得此法身當行因等諸仁者欲得佛身斷一切眾生病者當發心總勸發心發心為眾行之本是故勸發勸發令修行取佛身。",
        "translation": "The second one is that worldly mortals who know this body is impure suffer from disillusionment and don't abandon it. The second one is that two-vehicle people suffer from disillusionment with birth and death, abandon birth and death, and permanently enter nirvāṇa without remainder, and the third one is that bodhisattvas hate the impermanence and impurity of birth and death and seek the merit of the Buddha's body, which is always pleasant and purifies me.",
        "source": "X19n0343_002:0170a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如是長者維摩詰為諸問疾者如應說法令無數千人皆發阿耨多羅三藐三菩提心。",
        "translation": "Thus, Gṛhapati Vimalakīrti told those who were sick that countless thousands of people should be instructed to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "X19n0343_002:0170b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是長者諸問疾者下第四時眾聞法得道如文。",
        "translation": "Thus did Gṛhapati Vimalakīrti, the fourth time the multitude of people who heard the teaching attained the path as explained in the text.",
        "source": "X19n0343_002:0170b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子品第三",
        "translation": "The Third Chapter of the Disciple's Discipline",
        "source": "X19n0343_002:0170b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "弟子品第三然此品應次佛國品中間無方便品何以知然如來菴薗說淨土因果此門竟即須命問疾之人何者寶積五百人與淨名是法城等侶每事開道參玄無不同集而今五百皆來淨名不至故知有疾既其有疾即應命問疾人不應有方便品方便品是淨名初會佛未集眾時淨名已疾已為長者居士說法竟故不應在佛國品後而今在後者乃是集經人欲成一部經故作此安之所以作安者佛在菴園大眾雲集說淨土法門五百長者皆至淨名獨不來故知有疾既其有疾無量人問疾淨名因身疾為說法此即是知有疾之由故次佛國安方便品而復即弟子等品者國王長者等皆已問疾如來未問疾今命問疾之人故有弟子等品即是世界悉壇淨名是大長者今既頭枕在牀一切人皆問疾如來未參故今命問疾也又所以次方便品有弟子品者即是對治悉壇前方便破凡夫病今破聖人病就聖中有二小病大病破三種病故有三品前方便破凡夫凡夫謂此身有常樂我淨雖不謂此有嶷然之常謂百年常在五欲自娛為常為樂故菩薩破此病明此身無常為苦為惱甚可患厭當樂佛身破聲聞見者聲聞見生死可捨涅槃可得有四智得二涅槃故今菩薩皆破若禪若慧及與行住四儀悉僻也破菩薩者菩薩謂有萬行可修佛果可得謂有記可得有人能得淨名皆破撿悉無從廣如文說為是故有三品也問諸聲聞菩薩皆弟子何意聲聞云弟子菩薩不稱弟子耶解云通例而不爾者聲聞親侍佛形威如法故云弟子菩薩形無定方反常合道如文殊安劍欲刺佛非弟子之法故不得云弟子也而言弟子者外書云夫子視門人如弟自處如兄弟子親夫子如父自處如子師資合舉故云弟子佛法即通眾生親佛如父自處為子佛亦視眾生如子自處為文故云吾世間之父眾生皆是吾子前悟為兄後悟為弟故云弟子也就此文中為二第一淨名現疾第二如來遣命所以有此二者竝為利緣益物兩聖相鑒淨名古佛釋迦今佛淨名俗釋迦道淨名疾釋迦不疾如此等竝是方便利益眾生故也。",
        "translation": "The third aspect of the disciple's class is that this class should be secondary to the Buddha-nation class because there is no intermediate class of skillful means. Why do you know that? Since the Buddha was in Ām Son and the masses had gathered to teach the causes and effects of the Pure Land, and this gate was completed, it was necessary to order someone to ask about illness.",
        "source": "X19n0343_002:0170b21_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "爾時長者維摩詰自念寢疾於牀世尊大慈寧不垂愍。",
        "translation": "It was then that Vimalakīrti, the elder, thought to himself, \"Would the Bhagavān have great compassion when he's lying on his deathbed with an illness?",
        "source": "X19n0343_002:0171a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今即第一淨名現疾如文。",
        "translation": "Now, that's the first pure name for present illness, as the text explains.",
        "source": "X19n0343_002:0171a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○佛知其意下第二佛命問疾為二初命聲聞次命菩薩聲聞中為二第一別命十人第二總命五百今即第一命十人今束此十人二種三二種二言二種三者第一前四即四大聲聞次三即三大法師富那解修多羅栴延解毗曇波離解毗尼餘三即佛之親屬又三者身子師上品人目連即中品人故經云身子一聞即悟目連再聞乃悟又身子聞一千解目連聞一五百解餘即下品人言二種二者前二即左右侍者後即非侍又後三人是帝王種前即貴賤雜也。",
        "translation": "○Buddha knew his intention, and then the second Buddha's order to ask about illness was twofold: first, the order of the śrāvakas, and second, the order of the bodhisattvas. Among the śrāvakas, there were two orders: the first order of ten people specifically, and the second order of five hundred people in general.",
        "source": "X19n0343_002:0171a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知其意即告舍利弗汝行詣維摩詰問疾。",
        "translation": "Knowing what he meant, the Buddha told Śāriputra, \"Go and ask Vimalakīrti about his illness.",
        "source": "X19n0343_002:0171b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十人之中今即第一命身子問疾然此人是聲聞中智慧第一即是第二轉法輪人故論云一切智慧中唯除佛世尊欲比舍利弗十六分中一外國皆伏其神智以是義故前命也就文為二第一命問疾第二辭不堪今即初命問疾也舍利弗者此云身子從母為名其母大聰明名聞遐遠故從母為名其母即似舍利鳥故云舍利廣如大論辨也。",
        "translation": "Among the ten people, this was the first order, the body-son, to ask about his illness, but this person was the first in wisdom among the śrāvakas, which was the second person to turn the wheel of the Dharma.",
        "source": "X19n0343_002:0171b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗白佛言世尊我不堪任詣彼問疾。",
        "translation": "Śāriputra said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_002:0171b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利白佛言下第二辭不堪為三第一標不堪第二釋不堪第三結不堪今即第一標不堪。",
        "translation": "Śāriputra said to the Buddha, \"The second expression 'incapable' is divided into three, the first labeling it as incapable, the second explaining it as incapable, and the third concluding it as incapable.",
        "source": "X19n0343_002:0171b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔曾於林中宴坐樹下。",
        "translation": "\"Why is that? Remember, I was once sitting under a tree in a forest.",
        "source": "X19n0343_002:0171b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯舍利弗不必是坐為宴坐也夫宴坐者不於三界現身意是為宴坐不起滅定而現諸威儀是為宴坐不捨道法而現凡夫事是為宴坐心不住內亦不在外是為宴坐於諸見不動而修行三十七道品是為宴坐不斷煩惱而入涅槃是為宴坐若能如是坐者佛所印可。",
        "translation": "Vimalakīrti then came to me and said, \"Only Śāriputra, this needn't be called sitting in repose. A person who sits in repose doesn't manifest his body and mind in the three realms. This is sitting in repose not manifesting his body and mind without arising from the concentration of cessation but instead manifesting his manner.",
        "source": "X19n0343_002:0171b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時我世尊聞說是語默然而止不能加報。",
        "translation": "When the Bhagavān heard this teaching, he remained silent and unable to respond.",
        "source": "X19n0343_002:0171b23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何下第二釋不堪復為三第一出被呵之由第二明能呵之旨第三受屈今即第一出被呵之由舍利弗所以被呵者由患身心暄動欲處山澤是故被呵時維摩來謂我言下第二出能呵之旨所以被呵者聲聞之人有三重到一者有身有心已是一到而復見有此身暄動欲安身林澤見有此心馳散欲守心一境此見有散亂之可捨見有禪定亦可安即第二重到見有散見有靜見有生見有滅散不能靜用靜不能散用生不能滅用滅不能生用生滅不能無生滅用如是散靜相礙生滅無生滅相礙有得故有礙有礙故有得即非佛弟子是魔眷屬故被呵也言不必是坐者身子必此坐見身心暄動必須安身山林攝心一境故安此坐淨名呵不必此坐為宴坐也又意必坐者身子此坐為必竟上坐今淨名非第一坐也(宴音燕也)夫宴坐者不於三界現身意者上即總呵此即別呵亦前呵聲聞坐今示菩薩坐也言不於三界現身意者明身子入滅盡定滅心不能滅身患三界心而滅心患三界身不能滅身是故淨名呵既欲滅心亦應滅身既不滅身亦應不滅心而身子徧滅心不能滅身故非宴坐菩薩不爾現即雙現滅即雙滅問曰菩薩為滅心無心滅身無身故言雙滅為不爾耶解云不然關中云菩薩以法身為身遍處而非三界以玅慧為心遍緣而常寂以遍處而非三界遍緣而常寂除此為現即俱現滅即俱滅也然菩薩亦未曾俱不俱為破一現一不現故云菩薩俱現俱不現若無被不俱亦無菩薩俱蕭然清淨也不起滅定而現威儀者前明身心自在今明靜散無礙明二乘入滅定不能現威儀現威儀不能入滅定靜即礙散散即礙靜故非弟子菩薩入滅定而現威儀動能靜用等也不捨道法現凡夫事此下明道俗無礙也心不住內者內外自在不緣內六情不緣外六塵為宴坐也於諸見而不動行道品者聲聞動諸見而行道品行道品動諸見何者行三四二五動諸見使單八斷見諦或單七斷思惟或此即行道品動諸見故非宴坐菩薩不爾只諸見即道品耶正無礙故也不斷煩惱而入涅槃亦爾如文若能如是坐佛所印可明若能如此坐乃是佛弟子不能如此即非弟子佛不印可也時我下第三受屈。",
        "translation": "The second explanation below is that there are three further reasons for being heckled, the first is to explain the purpose of being heckled, and the third is to be condescended to.",
        "source": "X19n0343_002:0171c01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I don't have the authority to go there and ask about illnesses.",
        "source": "X19n0343_002:0172a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不堪第三結不堪也所以身子不堪者可有五義一者大小異故不堪二者此是現在聲聞居士是過去佛現在聲聞豈能問過去之佛三者得無得異有得聲聞何能問無得菩薩兩節校也四者此諸聲聞曾已被居士所呵昔不堪答故今不堪問五者此等皆是體道之人屈申方便各適根緣也。",
        "translation": "Therefore, I'm not fit to go to him to ask about his illness. Therefore, I'm not fit to go to him, and the third reason I'm not fit is that the body of the disciple is not fit.",
        "source": "X19n0343_002:0172a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○佛告目連此下第二命目連所以身子後命目連者明此二人宿有深重誓願共相符契故身子後次命目連又命者此二人是佛左右面弟子若身子右面若是目連是左面此間重左賤右如左僕射即勝右僕射即劣若外國即重右賤左故身子在右目連在左故淨名前呵此人破也又身子即是聖嘿然今目連是聖說法佛勅弟子常行此二今淨名破身子聖嘿然不成聖嘿然破目連聖說法不成聖說法不成聖嘿然不成聖說法非復佛弟子也又上破身子嘿不成嘿今破目連語不成語若嘿若語皆悉不成如大經剃頭乞食皆悉不成也又破聲聞三業皆不清淨上破身子坐禪呵其意業不淨今破目連說法呵其口業不淨次破迦葉乞食呵其身業不淨聲聞三業皆不淨若菩薩皆清淨故大品云菩薩行般若身業清淨乃至意清淨言不淨者見身口意即不淨何者見身口意即身口意見故不淨若不見身口意業即清淨上身子見心故心不淨也今目連見有法可說故口不淨也大師有時復進論上破身子但破性今破目連破性復破假上破性者無不能用有靜不能用散即性義今破性復破假者破性不異上言破假者故文云法無有比無相待故明有無長短高下即相待假義今求有不得撿無無從如是即長短能所不可得有何物待耶故云法無有比無相待也問性可破假義應是那可破耶解云有性故有假既無性何得有假有待故有不待既無待亦無不待如是待不待皆清淨二乘不預菩薩境界故也又上破身子彈其自行今破目連彈其化他坐禪隱處即自行今為諸居士說即化他說何物法說布施等法也又此破聲聞即是教菩薩。",
        "translation": "The Buddha told Maudgalyāyana that the second order below this one was for Maudgalyāyana, so the reason why he ordered Maudgalyāyana after the body showed that these two people had a deep and abiding vow to work together, so he ordered Maudgalyāyana after the body showed that these two people were disciples of the Buddha's left and right sides, and if the body showed that the right side of the body was superior, the right side of the body was inferior, and if the body showed that the right side of the body was inferior to the left side, then the body showed that the right side of the body was superior, and Maudgalyāyana showed that the left side of the body was inferior to the left side of the body, so the body showed that the right side of the body was superior, and Maudgalyāyana showed that the left side of the body was inferior to the left side of the body.",
        "source": "X19n0343_002:0172b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "佛告大目犍連汝行詣維摩詰問疾。",
        "translation": "The Buddha told Mahāmaudgalyāyana, \"Go and ask Vimalakīrti about his illness.",
        "source": "X19n0343_002:0172c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就文亦為二前命次辭不堪今即第一命目連番譯(云云)。",
        "translation": "In terms of the text, there are also two orders: the first is to order, the second is to say something unpleasant, and the present is to order the first one, which is the Mucilinda translation (cloud).",
        "source": "X19n0343_002:0172c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連白佛言世尊我不堪任詣彼問疾。",
        "translation": "Mucilin said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_002:0172c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連白佛言下第二辭不堪文亦為三第一標不堪二釋不堪三結今即標不堪也。",
        "translation": "The second statement, which Maudgalyāyana said to the Buddha, was \"Unable to cope.\" The text is also divided into three, the first indicating unbearable, the second explaining unbearable, and the third concluding, \"Unbearable.",
        "source": "X19n0343_002:0172c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔入毗耶離大城於里巷中為諸居士說法。",
        "translation": "\"Why is that? Remember when I went into the great city of Vaiśālī and taught the Dharma to the householders in the alleyways?",
        "source": "X19n0343_002:0172c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯大目連為白衣居士說法不當如仁者所說。",
        "translation": "Vimalakīrti then told me, \"Only Mahāmaudgalyāyana preached to the white-clothed householders inappropriately, as you, Sir, have explained.",
        "source": "X19n0343_002:0172c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何下第二釋不堪亦三一出被呵之由第二明能呵之旨第三受屈今即第一出被呵之由何意被呵由為居士說法故也大師云此一章正破法師若有所得法師正為淨名所破若言有人為能說法為所說有能被教所被緣有說有聽悉被淨名所破勸化無依無得問說故下文云其說法者無說無示其聽法者無聞無得如幻而說如幻而聽說如幻說說無所說聽如幻聽聽無所聽當建此意也時維摩來謂下第二出能呵之旨前總呵言不當仁者所說者可有數意一者不當之言乃是交怪之語汝作此說即為交怪故云不當又不當者汝有得之心說如來無得之法如來無得之法入有得之心無得之法成有所得之法即壞諸法相故灾怪也又不當者有二種一者不當根緣二者不當法相故云不當也。",
        "translation": "Therefore, why is it that the second explanation of undesirability also has three parts: first, it gives the reason for being heckled; second, it explains the purpose of being heckled; third, it's condescending; now, it's the first reason for being heckled; what does it mean to be heckled because you preached to the householders? The great master said that this chapter correctly refutes the Dharma teacher, and if there's an attained Dharma teacher, it's correctly refuted by the pure name.",
        "source": "X19n0343_002:0172c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫說法者當如法說法無眾生離眾生垢故法無有我離我垢故法無壽命離生死故法無有人前後際斷故。",
        "translation": "When someone teaches the Dharma, they should teach the Dharma according to the Dharma.",
        "source": "X19n0343_002:0173a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法常寂然滅諸相故法離於相無所緣故法無名字言語斷故法無有說離覺觀故法無形相如虗空故法無戲論畢竟空故法無我所離我所故法無分別離諸識故法無有比無相待故法不屬因不在緣故法同法性入諸法故法隨於如無所隨故法住實際諸邊不動故法無動搖不依六塵故法無去來常不住故法順空隨無相應無作法離好醜法無增損法無生滅法無所歸法過眼耳鼻舌身心法無高下法常住不動法離一切觀行。",
        "translation": "The Dharma is always quiescent and ceases all marks, so the Dharma is free of marks and has no object, so the Dharma has no names, words, and explanations, so the Dharma has no form and shape like space, so the Dharma has no conceptual elaborations and is ultimately empty, so the Dharma has no self and nothing but self, so the Dharma has no discrimination and nothing but consciousness, so the Dharma has no inference and no mutual dependence, so the Dharma doesn't belong to causes and isn't in conditions, so the Dharma is the same as the Dharma nature and enters all dharmas.",
        "source": "X19n0343_002:0173a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯大目連法相如是豈可說乎。",
        "translation": "Only the dharma of Mahāmaudgalyāyana is like this, how could it be explained?",
        "source": "X19n0343_002:0173a23_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫說法者當如法說此勸當如法說即是不可就此為二第一破人第二破法人即能為所為人法即教門之法此之二章即攝盡也若見人見法即成二見何謂是羅漢耶為此故破此二種也二章之中今即第一破人見汝言有所被人若箇是人汝言有能說人若箇是能說人若不見所為之人能為之人即是清淨若見能說所為人即是塵垢故法無眾生離眾生垢故也法常寂然下第二破法見言法常寂然者上明無人無壽無能無所非是真諦遣之令無今明諸法本性常如此故云法常寂然也又意汝今說法為說人為說法若說人無人云何說人若說法無法云何說法此即淨人法二見明人法二空也法離於相無所緣故者目連具心為能緣故今明離於相無所緣故既無所緣亦無是能緣也法無名字者上云破法體此即破法名如肇師云名無得物之功物無應名之實無名無物名物安在也法無有說離覺觀者目連有法可說今破由內覺觀故外有說法覺觀尚無何處有說本尚無未焉是有也法無戲論畢竟空故者彼謂有法可說有人能說即成戲論今明無能無所無戲論如空也法無有比無相待者已如前明亦如中論燃可燃也法不屬因不在緣者如就穀中求牙不得水土中求亦不得穀中求不得故不屬因水土求不得故不在緣也法常住不動法離一切觀行最後此兩句結破法常住不動結外法離一切觀行破內亦常住不動緣盡離一切觀行淨內外竝[穴/俱]緣觀雙寂也。",
        "translation": "The speaker of the Dharma will explain the Dharma in accordance with the Dharma. This exhortation will be explained in accordance with the Dharma, which means that it's not possible to say this in two ways: first, to refute the person; second, to refute the person, which is the agent, which is the person; and third, to refute the Dharma, which is the Dharma of the teaching.",
        "source": "X19n0343_002:0173b01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "唯大目連法相如是下總結呵如文。",
        "translation": "Only the great Maudgalyāyana thus characterizes the Dharma,\" he concludes, following the text.",
        "source": "X19n0343_002:0173c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫說法者無說無示其聽法者無聞無得譬如幻士為幻人說法當建是意而為說法當了眾生根有利鈍善於知見無所罣礙以大悲心讚於大乘念報佛恩不斷三寶然後說法。",
        "translation": "\"When someone teaches the Dharma, nothing is explained, nothing is shown, and those who hear the Dharma are not heard and nothing is attained. Like an illusionist who teaches the Dharma for an illusionist, he should establish this intention and teach the Dharma for sentient beings whose faculties are dull and whose views are well known and unobstructed.",
        "source": "X19n0343_002:0173c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫說法者無說無示者勸如此而說也亦是轉節破何者彼聞上呵無人無法無能無所便謂都無能所故今轉節明其說法者無說其聽法者無聽無聽無如幻說聽如幻說只聽如幻聽聽無所聽只說如幻說說無所說何時都無說無聽耶當了眾生根有利鈍此復是轉節上明無說說無聽聽如幻說如幻聽不得漫說應觀人根若直作此說釋迦如來初何故不即說此法而說人天之乘乃至三乘等耶故應須知根性利鈍而為說法不得漫說也作如此轉者良由目連遂教作此解所以淨名遂破也。",
        "translation": "When the preacher of the Dharma has nothing to say and nothing to show, he encourages this kind of explanation, which is also a turning section to refute it. Why is it that he hears that there's no one, no one, nothing, nothing that's able, and nothing that's then said to be nothing that's able and nothing? Therefore, this turning section explains that the preacher of the Dharma has nothing to say, and the listener of the Dharma has nothing to hear and nothing to listen to, just like an illusion, just like an illusion, just like an illusion, just like an illusion, and nothing to listen to.",
        "source": "X19n0343_002:0173c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰說是法時八百居士發阿耨多羅三藐三菩提心我無此辯。",
        "translation": "When Vimalakīrti explained this teaching, the 800 householders aroused the mind of unsurpassed, correct, and complete enlightenment, and I had no such discernment.",
        "source": "X19n0343_002:0174a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩詰說是法時第三目連受屈即八百居士得道也。",
        "translation": "When Vimalakīrti explained this teaching, the third Maudgalyāyana was wronged, meaning that the 800 householders had attained the way.",
        "source": "X19n0343_002:0174a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不任詣彼問疾。",
        "translation": "He therefore didn't allow them to go there and ask about their illnesses.",
        "source": "X19n0343_002:0174a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不任下第三結不堪也。",
        "translation": "The third reason why he didn't allow it was that he was unable to cope with the situation.",
        "source": "X19n0343_002:0174a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次第三命迦葉問迦葉是上座何故在身子目連之後解云迦葉雖復戒臈是大智慧未必勝前二人若是受食行籌即前上座次下座問疾必須智慧辯才之者是故前命身子目連次命迦葉也問迦葉更有上座不解云迦葉上有千餘人今言上座者十大弟子四大聲聞中之上座耳如夫子領徒三千入室七十二英駿八十九今亦爾千二百五十羅漢有五百聲聞復十大弟子四大聲聞也問遣問疾兩人足何故併遣解云欲示慈悲普告又欲遍彈又欲廣益昔日說止是小乘益小乘今日於大眾中重說重益大眾故也呵與前異者三業為論前呵身子即呵聲聞意業次呵目連呵聲聞口業今呵迦葉即呵聲聞身業擎鉢乞食今身業也又前呵目連說法即呵聲聞智慧門今呵迦葉呵聲聞功德門慈悲乞食即功德門明聲聞若智慧若功德皆非也又上目連即呵其施主今呵迦葉呵其福田上目連為化說法即呵其法施今迦葉乞食即是福田故上呵聲聞施主非施主今呵聲聞福田非福田也又上呵目連呵聲聞智慧德今呵迦葉呵聲聞斷德聲聞若智若斷皆非智斷又前呵身子呵一切有得禪師呵目連呵一切有得法師呵迦葉呵一切有得道德師迦葉是行道德不依佛勅耳為此故有今章來也。",
        "translation": "The third order was Kāśyapa. He asked, \"Why is Kāśyapa the superior seat?\" He explained, \"Although Kāśyapa is a monk in charge of discipline, he's a great teacher of wisdom, and he might not necessarily surpass the first two.",
        "source": "X19n0343_002:0174a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大迦葉汝行詣維摩詰問疾。",
        "translation": "The Buddha told Mahākāśyapa that you should go to Vimalakīrti to ask about your illness.",
        "source": "X19n0343_002:0174b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言迦葉者性龜是外國大性如此土河內苟龍西猪故龜是外國大性其名者人家多不知其名必鉢羅也其家大富敵摩[示*加]國千分減一分而無兒父母禱請天神云人無堪汝家為兒者時梵天王慈悲詫生其家身真金色婦亦金色因緣事(云云)章段如前今即第一命問疾。",
        "translation": "He said, \"Kāśyapa, the nature of the tortoise is a foreign great nature like this one, and the tortoise is a foreign great nature whose name is not known by many people, and whose name is Pipalā. His family is wealthy and rivals the country of Mahāsāra by a thousand parts minus one part, and his childless parents pray to the gods, saying, 'There's no one who can be a son in your family.' When Brahmakāyika mercifully surprised the birth of his family with a truly golden body, the wife was golden, and he had golden causes and conditions (clouds), the chapter continued as before.",
        "source": "X19n0343_002:0174b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛言世尊我不堪任詣彼問疾。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, I'm incapable of going there to ask about my illness.",
        "source": "X19n0343_002:0174b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔於貧里而行乞。",
        "translation": "Why is that? Why do you remember that in the past I went begging in a poor village?",
        "source": "X19n0343_002:0174b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛言下第二辭不堪為三標釋結今即標不堪也所以者何下第二釋不堪為二第一出被呵之由第二辨能呵之旨今即第一出被呵之由所以被呵者由昔於貧里行乞食故被呵也迦葉所以入貧里乞者亦有數義一者息世機嫌世人若見迦葉經遊富家就彼乞者恐言稀彼利養為此義故捨富從貧也二者捨富從貪者迦葉有慈悲心齊於貧人無衣無食交即困苦故迦葉從其乞食即令得現在果報也所以故供養滅盡定人得現世報迦葉即得滅盡定人也故大論云迦葉就一家乞不得食亦不得飲唯得一塸水迦葉即用瀨口瀨楪後看併成白殊即現報之事也又事迦葉就一貧老姥乞得一鉢汾澱迦葉受飲之老姥後生忉利天為彼天舌天主欲報恩下化老公姥迦葉來乞公姥即開金瓶香遍一國迦葉不受飛而去三者貧人所以貧者良由昔不施故今貧今若不施後貧恐貧貧不已是故從貧乞也。",
        "translation": "Kāśyapa said to the Buddha, \"The second explanation of unbearable is the conclusion of three labels.\" Now, this is the first explanation of unbearable, and so why is it? The second explanation of unbearable is the two first is to explain the reason for being heckled, and the second is to identify the purpose of being heckled. Kāśyapa's reason for going begging in a poor neighborhood also has several meanings.",
        "source": "X19n0343_002:0174b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯大迦葉有慈悲心而不能普捨豪富從貧乞迦葉住平等法應次行乞食為不食故應行乞食為壞和合相故應取摶食為不受故應受彼食以空聚想入於聚落所見色與盲等所聞聲與響等所齅香與風等所食味不分別受諸觸如智證知諸法如幻相無自性無他性本自不然今則無滅迦葉若能不捨八邪入八解脫以邪相入正法以一食施一切供養諸佛及眾賢聖然後可食如是食者非有煩惱非離煩惱非入定意非起定意非住世間非住涅槃其有施者無大福無小福不為益不為損是為正入佛道不依聲聞迦葉若如是食為不空食人之施也時我世尊聞說是語得未曾有即於一切菩薩深起敬心復作是念斯有家名辯才智慧乃能如是其誰不發阿耨多羅三藐三菩提心我從是來不復勸人以聲聞辟支佛行。",
        "translation": "Vimalakīrti then came to me and said, \"Only Mahākāśyapa has compassion but can't abandon the rich and poor and beg from the poor.",
        "source": "X19n0343_002:0174c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不任詣彼問疾。",
        "translation": "Therefore, I won't allow them to ask about their illnesses.",
        "source": "X19n0343_002:0175a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂下第二出能呵之旨迦葉在貧里乞食維摩即來呵之迦葉有慈悲心而不普捨富從貧耶言不普者有橫有竪言橫不普者即捨富從貧乞也若有慈悲即有大若無大即非慈悲若有大即普從貧富乞而捨富從貧故不普也(云云)竪不普者迦葉唯見貧人過去不行施今貧不見富人今不施來世貧見近不見遠故云不普也又聲聞慈悲大慈故不普何者聲聞慈黃門慈無根慈非菩薩大慈大慈即遍度一切眾生三界內外生死與大涅槃樂迦葉唯欲齊無依無食苦與衣食樂不能究竟度與究竟樂故云不普也平等法者次第行乞不問貧富名為平等乞迦葉捨富從貧即不平等故非慈悲也。",
        "translation": "When Vimalakīrti came to say that the second thing he could do was to criticize Kāśyapa for begging for food in a poor neighborhood, Vimalakīrti came to criticize him for being compassionate and not universally abandoning the rich and following the poor.",
        "source": "X19n0343_002:0175a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為不食故應行乞食者上即責捨富從貧今責其乞食亦前責其化他今責其自行是故今責乞食為不食應行乞食聲聞之人不能不食何者聲聞之心雖無漏身猶有侍是故須食所以今淨名責與凡夫何異凡夫亦為食乞食汝亦為食乞食故與凡無異若異者凡為食乞食汝應不為食乞食為懷和合相者和合即五陰和合也凡夫為長五陰身取食汝今亦為長五陰取食與凡夫無異汝應滅五陰取食也揣食者即揣握之食然飯具四微但三微資身色塵不資身也以空聚想入於聚落者聲聞之人不能如此[穴/俱]真諦空不能入聚落行聚落必是世諦故行聚落行聚落故不能[穴/俱]真諦是故今呵如空聚而入聚落入聚落如空聚只此聚落即畢竟空竟空寂舍舍如此而知可乞食也。",
        "translation": "為不食故應行乞食者上即責捨富從貧今責其乞食亦前責其化他今責其自行是故今責乞食為不食應行乞食聲聞之人不能不食何者聲聞之心雖無漏身猶有侍是故須食所以今淨名責與凡夫何異凡夫亦為食乞食汝亦為食乞食故與凡無異若異者凡為食乞食汝應不為食乞食為懷和合相者和合即五陰和合也凡夫為長五陰身取食汝今亦為長五陰取食與凡夫無異汝應滅五陰取食也揣食者即揣握之食然飯具四微但三微資身色塵不資身也以空聚想入於聚落者聲聞之人不能如此[穴/俱]真諦空不能入聚落行聚落必是世諦故行聚落行聚落故不能[穴/俱]真諦是故今呵如空聚而入聚落入聚落如空聚只此聚落即畢竟空竟空寂舍舍如此而知可乞食也。",
        "source": "X19n0343_002:0175a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所見色與盲等者次呵六根然迦葉至此有三重倒一者域慈悲心捨富從貧二者謂有所履之處見聚落為所履身為能履三者入聚落而復眼見方圓長短好醜等色耳聞聲等是故維摩次第呵之今且第一呵眼所見色與盲等乃可取食聲聞之人不能如此何者入滅定如盲不能見若見不入滅定見不能如盲若使如此與凡何異凡亦作此見汝亦如此見凡夫非福田汝亦非福田豈乞食若能如盲而見見如盲見菀然而無所見無所見而見若能如此乃可取食也受諸觸如智證者明聲聞智證實相之時無觸不觸故云受諸觸如智證也若自性無他性者迦葉謂自為能乞謂他為所乞他為所齊自為能齊故有此二見也。",
        "translation": "He then ridicules the six faculties, but Kāśyapa up to this point had a threefold error: first, he was compassionate and gave up the rich and followed the poor; second, he saw the village as a place to walk, and the body as a place to walk; third, he entered the village and again saw the square, round, long, short, beautiful, ugly, and other forms, and his ears heard sounds, etc. Therefore, Vimalakīrti ridicules them in order. Now, the first ridicule is that when the eye sees form and blindness, food can be taken.",
        "source": "X19n0343_002:0175b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能不捨八部入八解脫者雙彈凡聖不捨八耶彈二乘入八解脫非凡夫凡夫捨八解脫取八耶二乘捨八耶取八解凡夫亦取捨二乘亦取捨同取捨同有煩惱同無智斷菩薩不爾不捨八耶而入八解入八解非凡夫不捨八耶非二乘非凡夫行非賢聖行是菩薩行了達八耶即八解脫如此而行乃可乞食也以一食施一切供養諸佛者聲聞之人不能一食下施一切上供三寶下施一切即下齊四生上供三寶即興隆三寶聲聞之人非俱無其事亦復無此心若菩薩有事有心下香積即是其事一食施無量眾會食也。",
        "translation": "If someone can enter the eight liberations without abandoning the eight parts, they're both playing the mortal and the noble who don't abandon the eight yas and play the two vehicles into the eight liberations, but they're not ordinary people who abandon the eight liberations and take the eight yas, the two vehicles abandon the eight yas and take the eight liberations, the mortal also takes and leaves, the two vehicles also take and leaves, and they both acquire and leave, and they both have afflictions and lack wisdom to end them.",
        "source": "X19n0343_002:0175b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是食者非有煩惱非離煩惱者亦雙彈凡聖凡夫於一食具生三毒二乘雖不生三毒終為不見食非有煩惱非凡非離煩惱非聖若如此乃可是乞食也。",
        "translation": "Thus, a person who eats isn't afflicted or free of affliction, and he's also a critic of both worldlings and sages.",
        "source": "X19n0343_002:0175c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有施者無大福無小福者彼謂施滅盡定者得無量福故成論云入無量定故得無量福此為大福施凡等為小福故今彈云無大福無小福也不為益不為損者今現見乞食食此食得五果為益乞不得食即無五果為損今云何言不為益不為捐耶解云凡夫亦爾不得為捐得為益汝今亦爾與凡無異即非福田若與凡異即不為捐益也若如是食為不空食人之施也迦葉不能如此即空食人之信施迦葉道德如此十二頭陀中最第一尚空食人信施今時人若為是道德耶體道故是道德不體道何得名道德持戒尚非何況破戒可自各省內懷此中非是彈迦葉寄迦葉為語耳若有心路如此即墮此破也。",
        "translation": "Those who have almsgivers don't have great merit and don't have small merit. They say that those who give to the concentration of cessation and extinction attain immeasurable merit, so they enter the concentration of immeasurable merit and attain immeasurable fortune.",
        "source": "X19n0343_002:0175c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時我世尊聞是語歎敬菩薩若從來羅漢輕易菩薩明羅漢沙彌勝補處菩薩何者羅漢沙彌已斷煩惱補處菩薩猶是凡夫故沙彌勝菩薩今日歎菩薩德高聲聞道淺斯有家名者維摩在家菩薩而喜名遠布故云家名也餘文句如文。",
        "translation": "When the Bhagavān heard this, he praised and venerated the bodhisattva, saying, \"If it's ever been easy for a arhat to become a bodhisattva, then why is it better for a arhat to become a novice than for a bodhisattva to become a novice?",
        "source": "X19n0343_002:0176a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○第四命須菩提其人得無諍三昧解空第一四大聲聞中即是第四故今第四命也須菩提所以被呵者從來直云前迦葉捨富從貧今須菩提捨貧從富迦葉所以捨富從貧者欲救交切之苦故從貧今須菩提捨貧從富者明汝雖富貴今若不施來世復貧是故從富此二人竝不平等故皆被呵也今謂未必如此須菩提得無諍三昧轉教說般若何容不知維摩德行而就彼乞耶今明須菩提所以從彼乞者維摩在毗耶離國五百應真無敢窺其庭者須菩提自謂得無諍三昧解空第一內有無依之慧外有無礙之辨自[駽-月+ㄘ]解空第一辨足當時[這-言+至]造其舍是故被呵也須接前者前呵聲聞有今呵聲聞空前呵身子呵聲聞定非定次呵目連說法呵聲聞慧非慧定慧一雙也次呵迦葉頭陀呵其有行今呵須菩提呵其空解即行解一雙聲聞若定若慧若解若行皆悉被呵為此義故被呵也又此四人是大羅漢皆得滅定供養此四人得現在報婆沙云供養五人得大果一滅定二慈心三昧三無諍四初得下果五得上果值此五因供養五人得大果所以者何有二義一者滅定遍入一切定似無為果故得大福也。",
        "translation": "That's why he was heckled. That person had attained the first rank of uncontested samādhi and understanding of emptiness, which is the fourth of the four śrāvakas. That person had been heckled because it had been said that the former Kāśyapa had abandoned the rich and followed the poor, but now Suppository Bodhi has abandoned the rich and followed the rich.",
        "source": "X19n0343_002:0176a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告須菩提汝行詣維摩詰問疾。",
        "translation": "The Buddha told Subhūti, \"Go and visit Vimalakīrti to ask about your illness.",
        "source": "X19n0343_002:0176b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文段如前今即命問疾須菩提者亦云善業善覺善吉與善財生反因緣事(云云)其人德行不可思議或云青龍陀佛或云阿維顏菩薩阿維顏者補處菩薩也。",
        "translation": "The text was as described above, but now he was instructed to ask about illnesses. That man also called himself Good Action, Good Enlightenment, Good Fortune, and the Reverse Condition of Production (cloud).",
        "source": "X19n0343_002:0176b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須菩提白佛言世尊我不堪任詣彼問疾。",
        "translation": "Subhūti said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_002:0176b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白佛言下辭不堪標釋結今即標也。",
        "translation": "He said to the Buddha, \"It's not up to me to explain the ending,\" which is now the title.",
        "source": "X19n0343_002:0176b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔入其舍從乞食。",
        "translation": "\"Why is that? Remember when I went into that house to solicit alms?",
        "source": "X19n0343_002:0176b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰取我鉢盛滿飯謂我言唯須菩提若能於食等者諸法亦等諸法等者於食亦等如是行乞乃可取食若須菩提不斷婬怒癡亦不與俱不壞於身而隨一相不滅癡愛起於解脫以五逆相而得解脫亦不解不縛不見四諦非不見諦非得果非不得果非凡夫非離凡夫法非聖人非不聖人雖成就一切法而離諸法相乃可取食若須菩提不見佛不聞法彼外道六師富蘭那迦葉末伽棃拘賒棃子刪闍夜毗羅胝子阿耆多翅舍欽婆羅迦羅鳩馱迦旃延尼犍陀若提子等是汝之師因其出家彼師所墮汝亦隨墮乃可取食若須菩提入諸邪見不到彼岸住於八難不得無難同於煩惱離清淨法汝得無諍三昧一切眾生亦得是定其施汝者不名福田供養汝者墮三惡道為與眾魔共一手作諸勞侶汝與眾魔及諸塵勞等無有異於一切眾生而有怨心謗諸佛毀於法不入眾數終不得滅度汝若如是乃可取食時我世尊聞此茫然不識是何言不知以何答便置鉢欲出其舍維摩詰言唯須菩提取鉢勿懼於意云何如來所作化人若以是事詰寧有懼不我言不也維摩詰言一切諸法如幻化相汝今不應有所懼也所以者何一切言說不離是相至於智者不著文字故無所懼何以故文字性離無有文字是則解脫解脫相者則諸法也維摩詰說是法時二百天子得法眼淨。",
        "translation": "Vimalakīrti then took my bowl and filled it with rice and said to me, \"Only Subhūti, if he can equal food, then all things will be equal, and if all things are equal, then his food will be equal. If Subhūti doesn't stop lust, anger, and delusion don't go together, doesn't destroy himself, and follows one characteristic that doesn't cease delusion and craving, then liberation arises from liberation with the five undesirable characteristics, and he isn't liberated or bound because he doesn't see the four truths and doesn't not see the truths, doesn't attain the fruit and doesn't not attain the fruit, isn't extraordinary, isn't free from ordinary people, isn't a saint, and isn't a saint, then although he has accomplished all things and is free from the characteristics of all things, then he can take food.",
        "source": "X19n0343_002:0176b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I didn't presume to visit them to ask about their illnesses.",
        "source": "X19n0343_002:0176c12_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何下釋不堪為二此即明被呵之由也。",
        "translation": "Why is that?\" He explained that there were two reasons why he was rebuked.",
        "source": "X19n0343_002:0176c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩取我鉢盛下第二出能呵之旨然維摩謂稽弁智之人取須菩提鉢盛飯而不與可有三意一者盛滿鉢飯而語者為息慳悟之譏若不盛飯而詰謂言居士惜飯而復不與者若須菩提手中恐被難即去不盡言論之勢故不與而呵也又盛飯不與者盛飯明菩薩為施主呵須菩提顯聲聞非福田大論解往生品云初發心堪為羅漢田若爾今羅漢豈堪法身菩薩田耶又盛滿飯示菩薩財施捉鉢而詰示菩薩能法施又捉飯而問云若於食等者諸法亦等此一關責即罔然若等即不應來乞不等亦不應來乞若鉢飯與鉢土等不應棄土取飯等故不應來乞若不等棄土取捨穢取淨即取捨心行淨穢二見則具足煩惱何謂福田故不應取食若能知土即飯淨穢不二乃可取食也。",
        "translation": "When Vimalakīrti took my bowl and filled it, the second thing that came out was the intention to criticize Vimalakīrti. However, Vimalakīrti said that the person with the wisdom of discernment took Supporti's bowl and filled it with rice and didn't give it to him because he was criticized for being stingy and enlightened.",
        "source": "X19n0343_002:0176c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不斷婬怒癡亦不與俱者亦雙破凡聖若凡夫與煩惱俱二乘斷煩惱不俱是故今明不斷煩惱不同二乘亦不與俱不同凡夫二乘不能如此謂凡夫有煩惱即有見二乘無煩惱即無見乃有無二見何謂解空第一耶不壞於身而隨一相者上呵斷煩惱呵其有餘涅槃今呵其壞身相呵其無餘涅槃言不壞於身而隨一相者明二乘之人壞五陰身入無餘涅槃若不壞五陰身即不得入無餘涅槃是故今呵若能不壞身入無餘入無餘不壞身乃可取食而須菩提不能如此又不入無餘即有身有見常見入無餘即無身無見斷見具足斷常有無二見煩惱何謂智斷何謂解空故云不壞於身而隨一相也一相即無餘涅槃此句既然餘句亦爾不滅癡愛起於明脫明即漏盡明脫即悲想第九解脫癡覆漏盡明愛鄣解脫故滅癡得明斷愛得脫故今菩薩呵不滅癡愛起於明脫了此癡愛即明脫了縛不縛即悟解不解故云不縛不解次明五逆即解脫前就煩惱呵今就業呵前明縛解無礙今明善惡無礙只了此五逆即解脫如文殊以釰刺佛只此即是無生無能無所畢竟淨凡夫二乘於解脫為五逆何者解脫不如此而謂如此即傷正法傷正法過五逆也。",
        "translation": "Not stopping lust, anger, and delusion and not with both also refutes the worldling and sage if the worldling and the afflictions are both the two vehicles stopping the afflictions are not both.",
        "source": "X19n0343_002:0177a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若須菩提不見佛不聞法者體然須菩提自言見佛聞法八難眾生不見佛聞法又佛親說其見佛聞法何者佛初從忉利天為母說法竟還閻浮人皆欲見佛有華色尼欲前見佛變為轉輪王人謂輪王皆僻易避路華色尼前至佛所佛言非汝前禮我乃須菩提前禮我何者須菩提在石室中觀佛法身真是禮佛為此故下淨名責汝言見佛聞法為體悟故見不體故見邪若體悟者即無佛無不佛無法無不法即無見無聞如是迷亦不得見佛聞法悟亦不得見佛聞法汝何得言見佛聞法耶若不知此者即無有智無智即無斷無有智斷非佛法弟子故云若須菩提不見佛不聞法乃可取食也外道六師則汝之師者明六師則七佛七佛則六師若能如此了知乃可取食須菩提不能如此聞七佛則正聞六師則邪邪正二內外二故致此呵也彼師所墮汝隨墮者明外道今世墮在邪見當來墮在地獄故云墮也言彼師墮汝墮者彼今墮邪見汝亦應墮邪見彼當墮地獄汝亦當墮地獄汝亦當墮地獄墮邪見即墮正觀墮地獄即墮涅槃何者邪正二因不異地獄涅槃兩果豈殊若能如此了達乃可取食而聲聞不能如此謂邪正二初果之人已離三途羅漢豈當墮地獄耶如是即見耶異正見正異耶見耶即耶見見有正即正見終是二見終非福田何以故經云諸有二者無道無果又華嚴云生死涅槃二迷惑賢聖道若使如此無諍三昧解空何在耶所以作此呵非是呵須菩提乃寄□義耶須菩提是青龍陀佛豈有此二見乃是眾生有此二見須菩提示為之耳眾生病菩薩病即其事也。",
        "translation": "If Subhūti doesn't see the Buddha and doesn't hear the Dharma, then it's true that Subhūti says he sees the Buddha and hears the Dharma, and the Buddha himself explains that he sees the Buddha and hears the Dharma.",
        "source": "X19n0343_002:0177b10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "與眾魔共一手作諸勞侶者與魔一種一手作舉譬如一手作絹須菩提能如此不邪不能不可取食耳也時我世尊聞是罔然者須菩提被呵最劇何者前諸人但有一失今須菩提即有二失言二失者一者不應來而來二者即不應去而去也言不識何言不知何答者上如此而責既及其心故不識是何言進退靡酬罔然無答便欲置鉢而去淨名即捉不得去汝心懼耶汝今誰懼誰能呵誰所呵既無能所有何懼耶故云取鉢勿懼也。",
        "translation": "When the Bhagavān heard this, he was indifferent. He was criticized most severely by those before him, who had only one fault; now, he has two faults.",
        "source": "X19n0343_002:0177c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來所作化人下次引喻曉之如幻化人有何能呵有何所呵有何能說有何能聽幻說何所說幻呵何所呵若爾有何懼耶若不體幻即非佛弟子故云一切諸法如幻化也不應有懼也所餘文句可尋。",
        "translation": "The Tathāgata's work of transforming people is next explained by metaphors, such as the illusory transformation of people who have what can be said and what is said, and what can be said and heard, and what is said, and what is said, and what is said, and if that's the case, what fear is there?",
        "source": "X19n0343_002:0178a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二百天子得法眼者為聞前得為聞後得解云聞後得道何者須菩提不解前豈能得但於後得道也。",
        "translation": "The two hundred celestials who attain the Dharma eye attain it before hearing, or after hearing it, and understand it, saying, \"After hearing it, I'll attain the Way.",
        "source": "X19n0343_002:0178a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○第五次命富樓那所以命四大聲聞竟次更命其人者解云四大聲聞外復有大法師故次命也其人說法第一大論及法華經竝云說法第一什師云解阿毗曇第一問須菩提亦說法第一今富樓那亦云說法第一何異耶然須菩提說法第一者出大品勸學品舍利弗歎須菩提得無諍三昧說法中為最第一龍樹解云須菩提說法第一者於空法第一若富樓那於一切法第一故為異也然富樓那於一切法第一未必勝須菩提解空第一何者自有種種皆能自有人徧精一述今富樓那雖解一切解空未必勝須菩提也問富樓那既於一切法第一何事致呵解云富樓那於聲聞中第一非謂菩薩是故被呵也又富樓那即是菩薩方便為聲聞耳故經云富樓那內祕菩薩行外現為聲聞少欲厭生死而實淨佛土方便為聲聞方便受屈也問富樓那於何處被呵耶解云由不解根故被呵若小乘根性應說小乘法大乘根性應說大乘法小乘根性說小乘法此緣是教緣教是緣教緣教相稱大乘緣亦爾此即緣教相稱竝皆得益如治病逗慈等所以佛與耆婆分治耳而富樓那為大乘緣說小乘法是故致呵也。",
        "translation": "The fifth order, Pūrṇa, therefore ordered the four śrāvakas to finish and then ordered another person. He explained that besides the four śrāvakas, there's also a great teacher of the Dharma, so he was ordered second.",
        "source": "X19n0343_002:0178a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告富樓那彌多羅尼子汝行詣維摩詰問疾。",
        "translation": "The Buddha told Pūrṇa Maitrāyaniputra, \"Vimalakīrti, go and ask Vimalakīrti about his illness.",
        "source": "X19n0343_002:0178b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文亦為二今即第一命問疾富樓那云滿願彌多羅云善知識尼云女是滿願善知識女人之子故云彌多羅尼子此如身子類也。",
        "translation": "The text is also divided into two. Now, the first one is to ask about illness. Pūrṇa said, \"Pūrṇa, this is the son of the woman Pūrṇa and the good friend Maitrāyaniputra.",
        "source": "X19n0343_002:0178b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富樓那白佛言世尊我不堪任詣彼問疾。",
        "translation": "Pūrṇa said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_002:0178b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富樓那白佛下第二辭不堪為三標釋結今即標不堪也。",
        "translation": "Pūrṇa said to the Buddha, \"The second word, 'incapable,' is an explanation of the three labels, which now refers to 'incapable.'",
        "source": "X19n0343_002:0178b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔於大林中在一樹下為諸新學比丘說法。",
        "translation": "\"Why is it that I remembered a time when I was teaching newly trained monks under a tree in a large forest.",
        "source": "X19n0343_002:0178b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯富樓那先當入定觀此人心然後說法無以穢食置於寶器當知是比丘心之所念無以瑠璃同彼水精汝不能知眾生根源無得發起以小乘法彼自無瘡勿傷之也。",
        "translation": "Vimalakīrti then came to me and said, \"Only Pūrṇa, first you must enter into meditation and look into this person's mind, then explain the teaching without using defiled food in a precious container. You should know that this is the mindfulness of a monk's mind, that there's no lapis lazuli like that water essence, and that you can't know the root cause of sentient beings and can't give rise to the lesser vehicle teaching that has no sores of its own.",
        "source": "X19n0343_002:0178b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲行大道莫示小徑無以大海內於牛跡無以日光等彼螢火。",
        "translation": "Don't show him a path if you want to follow it, not a path that's too small, not a great ocean that's like a cow's trail, and not a sunbeam that's like a firefly's flame.",
        "source": "X19n0343_002:0178b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富樓那此比丘久發大乘心中忘此意如何以小乘法而教導之我觀小乘智慧微淺猶如盲人不能分別一切眾生根之利鈍。",
        "translation": "Pūrṇa, this monk has long given rise to the great vehicle and has forgotten this intention in his mind. How can I teach him the teachings of the lesser vehicle? I observe that the lesser vehicle's wisdom is shallow like a blind man who can't discern the sharpness or dullness of the faculties of all sentient beings.",
        "source": "X19n0343_002:0178b24_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰即入三昧令此比丘自識宿命曾於五百佛所植眾德本迴向呵耨多羅三藐三菩提即時豁然還得本心於是諸比丘稽首禮維摩詰足時維摩詰因為說法於阿耨多羅三藐三菩提不復退轉。",
        "translation": "Vimalakīrti then entered into samādhi and caused this monk to realize that he had planted the roots of many virtues in 500 buddhas in his past life and had instantly and enlighteningly returned to his original mind.",
        "source": "X19n0343_002:0178c02_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念聲聞不觀人根不應說法。",
        "translation": "I'm mindful that śrāvakas who don't examine human faculties shouldn't preach.",
        "source": "X19n0343_002:0178c06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何下第二釋不堪為四第一出被呵之由第二明能呵之旨第三時眾悟道第四受屈今即第一出被呵之由所以被呵者昔於大林中為新學說法此比丘竝是大乘根性而說小法故被呵也大林中者是毗耶離城中大林林中有彌猴池精舍富樓那在中說法也。",
        "translation": "Therefore, why is it that the second explanation of discomfort is divided into four: first, it gives the reason for being rebuked; second, it explains the purpose of being rebuked; third, it's the time when the crowd attains enlightenment; and fourth, it's the reason for being rebuked. The reason for being rebuked is that in the past, in the great forest, this monk taught the Dharma for new students.",
        "source": "X19n0343_002:0178c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言下第二明能呵之旨為二第一正明能呵第二釋呵之意今即第一復為二第一明教不稱緣呵不識教第二明緣不稱教呵不識緣今即第一教不稱緣呵不識教有三法三譬即為三章不識三世今即第一不識未來根性富樓那應前入定觀彼人根性所宜而為說法此人應宜聞大法而不觀彼根性慢為說小法故不應也無以穢食置於寶器者譬大乘根性穢食譬小乘之法寶器應[貝*守]香淨之食不應[貝*守]穢食大乘根性應說大乘法不應說小乘也當知是比丘心之所念即第二不知此比丘現在心念也無以瑠璃同彼水精第二譬水精賤瑠璃貴譬大小乘貴賤也汝不能知眾生根源第三呵不知比丘過去世此比丘久發大乘心何得小乘發起彼自無創勿傷之也者即第三譬大乘之身無小乘之創何得小乘之爪裂破大乘之軀耶彼未學有得小乘故未有創今日說小即傷彼身也欲行大道下第二緣不稱教呵其不識緣也例上亦應有三法三譬文略亦有三譬三譬即三第一發菩提心第二遍度眾生第三修一切行菩薩之行不出此三句而富樓那迴令其發二乘心修二乘行自調自度所不應也故肇師云迴龍象於兔徑注大海於牛迹即其事也欲行大道莫示小[這-言+至]即第一發菩提心也無以大海即第二遍度眾生故是大心也無以日光下第三修一切行云何教二乘行即故不可也。",
        "translation": "When Vimalakīrti came and said, \"I say, the second thing that I can say is that there are two first things that I can say, and the second thing that I can say is that there are two more things that I can say.\" The first thing that I can say is that the first thing that I can say is that I don't know the teaching, and the second thing that I can say is that I don't know the teaching, and the first thing that I can say is that there are three things that I can say that I don't know the three times, and the first thing that I can say is that I don't know the future faculties of this person.",
        "source": "X19n0343_002:0178c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富樓那此比丘下第二釋呵之意所以呵者此比丘久發大乘心中忘此意汝應還為說大乘法而汝為說小乘故被呵也久發大乘心中忘此意者此如法華繫寶譬無異也。",
        "translation": "Pūrṇa, this monk secondly explained the meaning of heckling.",
        "source": "X19n0343_002:0179a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰即入三昧下第三時眾得益維摩兩蜜益入三昧即意蜜益因為說法即口蜜益歎菩薩有三業益聲聞無也維摩詰兩蜜益諸比丘亦得兩益一者舊益二者新益自識宿命即還得本心即是舊益因為說法於菩提不退即新益也如文我念聲聞下第四受屈。",
        "translation": "At the time, Vimalakīrti was entering samādhi, and the third benefit to the multitude was the two honey benefits of Vimalakīrti, which were the honey benefits of the mind because he taught, which were the honey benefits of the mouth. He praised the bodhisattvas for having three karmic benefits that the śrāvakas didn't have.",
        "source": "X19n0343_002:0179a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不任詣彼問疾。",
        "translation": "He therefore doesn't allow it and goes there to ask about his illness.",
        "source": "X19n0343_002:0179b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不任即第三結不堪也。",
        "translation": "Therefore, he doesn't want to, which is the third condition of being uncomfortable.",
        "source": "X19n0343_002:0179b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次第六命迦旃延然法華云迦旃延是中根性人富樓那是下根性人何故前命富樓後命旃延耶此亦有所以別當解釋其人解修多羅論義第一造昆勒論言廿萬偈大智論云昆勒論有二門一空門一有門入空門論義無盡若爾佛在世已有經論竹帛也其人所以被呵者不論教故被呵前富樓那雖竝不識緣教正是不識緣故被呵所以前文云無以寶器置之穢食金[胳-口+木]王案本將天上須杝人中甘露忽盛臰糞故不識根性今迦旃延子竝不識緣教正是不識教故文云無以生滅行心說實相法故不識教也問前目連亦說法與今何異前目連語意雙失今旃延得佛語不得佛意故異也。",
        "translation": "○The sixth order Kātyāyana, however, according to the Lotus Sutra, Kātyāyana is a person of middle faculties, and Pūrṇa is a person of lower faculties. Why was he ordered to be Pūrṇa and then Kātyāyana? There's also a reason why this person understood the meaning of the Sutra Treatise and first created the Kunleśa Treatise, which says in 200,000 verses that the Kunleśa Treatise has two aspects, one of emptiness and one of existence.",
        "source": "X19n0343_002:0179b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告摩訶迦旃延汝行詣維摩詰問疾。",
        "translation": "The Buddha told Mahākātyāyana that you should go to Vimalakīrti to ask about his illness.",
        "source": "X19n0343_002:0179b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就文亦為二今即第一命問疾迦旃延即其姓此云好眉。",
        "translation": "There are two ways of putting this in context. Now, the first is to ask about illness. Kātyāyana is his surname, and this is called 'good-looking.'",
        "source": "X19n0343_002:0179b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦旃延白佛言世尊我不堪任詣彼問疾。",
        "translation": "Kātyāyana said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_002:0179b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念昔者佛為諸比丘略說法要我即於後敷演其義謂無常義苦義空義無我義寂滅義。",
        "translation": "Why is that? Remembering how the Buddha taught the essentials of the Dharma for the monks in the past, I'll explain its meaning later, which is the meaning of impermanence, the meaning of suffering, the meaning of emptiness, the meaning of selflessness, and the meaning of cessation.",
        "source": "X19n0343_002:0179b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯迦旃延無以生滅心行說實相法迦旃延諸法畢竟不生不滅是無常義五受陰洞達空無所起是苦義諸法究竟無所有是空義於我無我而不二是無我義法本不然今則無滅是寂滅義說是法時彼諸比丘心得解脫。",
        "translation": "Vimalakīrti then came to me and said, \"Only Kātyāyana doesn't explain the true character of the Dharma in terms of the mind's activity of arising and ceasing. Kātyāyana, the ultimate truth that things don't arise or cease is the meaning of impermanence, and the penetration of the five acquired aggregates into emptiness and nothingness is the meaning of suffering, and the ultimate truth that things lack existence is the meaning of emptiness and the absence of self is the meaning of selflessness.",
        "source": "X19n0343_002:0179b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I don't presume to visit them to ask about their illnesses.",
        "source": "X19n0343_002:0179c03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦旃延白佛下第二辭不堪為三標釋結今即標不堪也所以者何下釋不堪為二今即第一出被呵之由所以被呵者佛昔為諸比丘說法其還覆佛語故被呵也問其誦佛小乘語為誦佛大乘語解云誦佛小乘語不解佛意故失也所以不解小乘意者欲若聲聞人深何者明汝有得小乘非但不解大意亦不解小乘意何以故既不解小大豈識大小若是菩薩識小大即識大小菩薩則兩有聲聞則二無也又非但不得意亦不得語不得語下云意豈得意上之語若大若小若意若語皆失所以爾者欲顯都無有二乘耳故法華云十方佛土中唯一佛乘也問聲聞有得心說無得法既被呵佛無得心說有得法亦應被呵解云不例彼有得心說無得法無得法番成有得是故被呵也若佛無得心說有得法意不在有得說有得為成無得是故不被呵也言佛略說法要我於後敷演其義者佛昔略說二法一生死法二涅槃法生死即有為無常法涅槃無為常法開此二法為三法即三法印涅槃寂滅即寂滅印生死有為法無常即無常印一切法無我無我印通生死涅槃也復廣三法為五生死有四無常苦空等涅槃寂滅佛略說三迦旃延廣說為說廣為五二者佛略說二迦旃延廣說二乃至佛略說五其廣說五如解一無常義流動義生滅義等故云敷演其義也。",
        "translation": "Kātyāyana said to the Buddha that the second reason he spoke was because of the unsuitability of the three explanations, and now he's labeling the unsuitability.",
        "source": "X19n0343_002:0179c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩來下第二明能呵之旨言無以生滅行心說實相法者釋者不同今直解實相即無所得實相之法迦旃延有得生滅心說故云無以生滅心說實相法也諸法畢竟不生不滅是無常義者此句難解且問若不生滅是無常義者亦應生滅是常義及結(云云)今明不生不滅是無常義者只此無常即不生不滅義何者今言無常非謂有無常乃是無有常故言於無常此即破常故說無常既無有常何處有無常如是無常無無常畢竟不生不滅是無常義也此義難行故廣須經論證成關中肇師亦有此說故彼云言其非有者明其非是有非謂是非有無亦爾亦言其非常者明其非是常非謂是非常也大智論云有二無常一者無方便二者有方便無方便無常者乃無有常猶有無常也若有方便無常者無常本治常既無有於常即知無無常兩句既淨下去畢竟無遺故也言經為證者即此文是無常破於常既無有於常亦復無無常故云不生不滅是無常義也問佛何故不雙說無常無無常但一無常耶解云說一無即是一切無若說一切無即鈍根之人耳若說一無了一切無即利根人也言一無即一切無者既無常即知無無常既無常無無常即知無一切故云一無即一切無也而今迦旃延雖知無有常猶見有無常所以被呵一句既然餘句例爾說是法時諸比丘得解脫者明諸比丘雖知無有常猶言有無常猶為無常見縛今破無常脫常見無無常脫無常見無此二見名得解脫不無事得解脫也餘例爾(云云)次一時追簡上不生不滅是無常義若居士云不生不滅是無常佛何意云諸行無常是生滅法若爾旃延得失居士得意居士解云旃延得語又得語經生滅無生滅生滅(云云)。",
        "translation": "When Vimalai came down, the second clarification of the purpose of being able to criticize him was that he didn't explain the true character of things with the mind that arises and ceases, the interpreters were different.",
        "source": "X19n0343_002:0180a10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○次第七命阿那律所以呵者前富樓那不識根性故被呵次迦旃延不識教意被呵今阿那律天眼神通故被呵明聲聞神通非神通也又前旃延說法今阿那律神通說法即智慧神通即福德說法非說法智從何生神通非神通福德因何起故有今呵也。",
        "translation": "○Subsequent to the seventh order, Aniruddha was criticized for not recognizing the nature of the faculties and therefore criticized for not recognizing the teaching; next, Kātyāyana was criticized for not recognizing the teaching's intent; and now, Aniruddha was criticized for having the divine vision and supernormal abilities of the śrāvakas and non-supernormal abilities.",
        "source": "X19n0343_002:0180b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿那律汝行詣維摩詰問疾。",
        "translation": "The Buddha told Aniruddha that you should go to Vimalakīrti to ask about his illness.",
        "source": "X19n0343_002:0180b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文為二今第一如來命問疾阿那律亦阿泥盧豆亦名阿樓駄亦名阿那律異名耳此番無貧亦云如意亦云善意剎利種是佛從弟子天眼第一經中云半頭天眼言半頭天眼者有二釋一者云略半甬頭見若凡夫近珠子見彼人半頭見也二者頭一半能見故云半頭見佛即遍頭見也其所得天眼者其人五百世墮螺蜯中來今生眼常睡諸比丘譏可其即以竹圈圈其眼眼即盲後修禪定得色界四大怡身故能見三千大千世界如觀宰中菓也菴摩勒內外映徹而見然大論云極利根辟支作意見三千大千世界問天眼與完眼為竝用不解云若書日即竝用若夜唯天眼見也問天眼欲見後時為轉不轉解云不轉作意即見所以爾者天眼皮完不能障故也。",
        "translation": "There are two texts in the present, the first one being the Tathāgata's order to ask about illness, the second one being that half of the head can see, so the half-headed view is called the Buddha's omniscient view. The divine eye he attains is that person who has fallen into a conch and a nut in the 500th lifetime and has come to this life with his eyes constantly asleep, which the monks criticize and allow, that is, by circling his eyes with a bamboo ring.",
        "source": "X19n0343_002:0180b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿那律白佛言世尊我不堪任詣彼問疾。",
        "translation": "Aniruddha said to the Buddha, \"Bhagavān, I'm incapable of going there to ask about my illness.",
        "source": "X19n0343_002:0180c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念我昔於一處經行時有梵王名曰嚴淨與萬梵俱放淨光明來詣我所稽首作禮問我言幾何阿那律天眼所見我即答言仁者吾見此釋迦牟尼佛土三千大千世界如觀掌中菴摩勒果。",
        "translation": "Why is that? Remember, I was once in a place where I was traveling when a Brahma king named Yama and Vimalakīrti emitted a pure radiance, came to me, paid homage by prostrating himself, and asked me, \"How much does Aniruddha see with the divine eye?\" I then answered, \"Sir, I see the fruit of Āmogha-mālā in the palm of my hand in this 3,000,000 worlds of the Śākyamuni Buddha land.",
        "source": "X19n0343_002:0180c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯阿那律天眼所見為作相耶無作相耶假使作相則與外道五通等若無作相即是無為不應有見世尊我時默然彼諸梵聞其言得未曾有即為作禮而問曰世孰有真天眼者維摩詰言有佛世尊得真天眼常在三昧悉見諸佛國不以二相於是嚴淨梵王及其眷屬五百梵天皆發阿耨多羅三藐三菩提心禮維摩詰足已忽然不現。",
        "translation": "Vimalakīrti then came to me and said, \"Is it only the vision of the divine eye of Aniruddha that has marks or no marks? If it has marks, then it's the same as the five supernormal powers of non-Buddhists, and if it doesn't have marks, then it's nothing. I was silent. When the Brahmās heard what he said, they saluted Vimalakīrti and asked, \"Who in the world has the true divine eye?\" Vimalakīrti said, \"The Bhagavān has attained the true divine eye, which is always in samādhi and sees all the buddha lands without using two marks.",
        "source": "X19n0343_002:0180c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I didn't presume to go there to ask about their illnesses.",
        "source": "X19n0343_002:0181a07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿那律白佛言下第二辭不堪亦三標釋結今即標所以者何下第二釋不堪為二第一出被呵之由何意被呵由梵王問其眼見其答天眼因此而致呵也。",
        "translation": "Aniruddha said to the Buddha, \"The second part of my speech is 'unbearable,' and I'll mark the conclusion by explaining the reason why. The second part of my explanation is 'unbearable' in two ways.",
        "source": "X19n0343_002:0181a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來下第二明能呵之旨為二初定兩閞次結二難今即雙定兩閞為作相耶為無作相耶言為作相者取方圓色為作相見取青黃色為作相見不取方圓青黃色為無作相見二者有眼為能見色為所見有能有所為作相無眼能見無色所見無能無所為無作相見是故今責為作相見無作相見也假使作相下第二雙結難若作相即與外道五通等何者外道亦作方圓青黃見能所見汝今亦作方圓青黃能所見同見青黃同是外道汝作青黃見既內彼作青黃見亦內等是內等作相等內等外第三到難可尋若無作相第二難若無作相不見青黃方圓即無青黃方圓若爾即是無為不應有見亦具三難汝青黃既見空無青黃空亦應見同見同不見第三到難汝見空不見亦應空見汝不見也次更來難汝若作相即同外道若異外道無作無作相無所見亦無眼云何言天眼見耶此之兩閞嘿然無對故肇師云失對當時受屈二難也又作相即有見不作即無見有無二見耳亦得責梵王梵王是佛弟子故也諸王聞其言得未曾有即作禮者諸梵既聞驚耳之說故有未曾之歎又此諸梵亦得天眼見千世界聞居士此言歎未曾有即問世熟有真天眼者不我與阿那律是偽時世誰是真天眼耶維摩言有者上梵王問有真天眼不今答云也佛世尊得真天眼上標有今出有人也常在三昧見諸佛土不以二相次釋真天眼見諸佛國不以二相者明見諸國土宛然而無所見無所見而見宛然見不礙無見無見不礙見不以二相故不被呵阿那律即不能如此見即不能無見無見不能為見故被呵也餘文句可尋也。",
        "translation": "When Vimalakīrti comes, the second explanation of the purpose of being heckled is two: first, he sets two periods; second, he concludes two difficulties; now, he sets two periods as making a mark or not making a mark. When he says he's making a mark, he takes a square and a round shape as making a mark, takes a blue and yellow shape as making a mark, and doesn't take a square and a round blue and yellow shape as making a mark.",
        "source": "X19n0343_002:0181a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○次第八命優婆離其人所以被呵者為持律故被呵明聲聞人智慧非智慧神通非神通持律非持律懺悔非懺悔何者小乘中五徧七聚五徧初徧不可懺四徧可懺七聚初聚不可懺六聚可懺初徧聚如斷多羅樹頭如針鼻穴畢竟死人不可復治若大乘方等懺悉皆除滅也今除滅也今優婆離作小乘懺此比丘是大乘根性應聞大乘懺而優波離作小乘懺故被呵也。",
        "translation": "○Subsequently, the eighth order of Upāli's life is that he's being heckled because he observes the precepts. śrāvakas' wisdom is not wisdom, their supernormal powers are not supernormal powers, and they don't observe the precepts, but repentance is not repentance.",
        "source": "X19n0343_002:0181b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告優波離汝行詣維摩詰問疾。",
        "translation": "The Buddha told Upāli, \"Sir, you must go to Vimalakīrti to ask about your illness.",
        "source": "X19n0343_002:0181c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就文亦為二今初命問疾也優波離此云上首王舍城賤人今得羅漢人無貴賤道在即尊故今命也。",
        "translation": "There are two ways of putting this in context. The first is to ask about your illness. Upāli is called the first person in the city of Rājagṛha who's now a low-ranking arhat and has attained the status of noble and base.",
        "source": "X19n0343_002:0181c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離白佛言世尊我不堪任詣彼問疾所以者何憶念昔者有二比丘犯律行以為恥不敢問佛來問我言唯優波離我等犯律誠以為恥不敢問佛願解疑悔得免斯咎我即為其如法解說。",
        "translation": "Upāli said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about their illnesses. Why is that? Remembering that there were two monks in the past who violated the vinaya and were too ashamed to ask the Buddha about it, he came to me and asked, 'Upāli, we violated the vinaya, are too ashamed to ask the Buddha about it, and wish to resolve our doubts and repent so that we can be freed from this blame.' I then explained the teaching for them according to the teaching.",
        "source": "X19n0343_002:0181c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波離白下第二辭不堪標釋結今即標也所以者何下第二釋不堪為二今即第一出被呵之由有二比丘犯律行者問此比丘犯何罪耶文中不說輕重從來云犯第二徧罪何者若是第一徧不可懺今既求懺故知第二徧僧殘而復似破初徧故比丘心疑恐屬初徧故問優波離也不敢問佛問波離者有四一者佛威德尊重如龍如火故不可輕輒問也二者從佛受得戒今犯罪違本誓親言能持今既犯罪故不敢問也三者佛精識罪相恐即道是初徧畢竟不可懺四者若往問佛即大眾彰顯今礼問波離故云不敢問佛來問優波離優波離即依五徧七聚方法為其說優波離未及發言居士即來呵之也問波離解律故為滅罪不解為滅罪即不可言波離不解律其實解律也問若其解律波離依律滅罪若使如此呵波離不能滅罪即是呵律不能滅罪即是呵佛不能罪也解此有二義一者明自有宜聞小乘滅罪今此比丘是大乘根性宜聞大乘法除滅而波離為說小乘故被呵何閞世尊耶二者大之與小如來方便方便開大為小波離既不識大亦不識小所以被呵若是菩薩具足解大解小小大竝是如來方便開金竝是如來方便竝大乘故有所以經云毗尼學者即大乘學若爾即都無小乘故波離說小乘法故是波離之過豈是如來之失。",
        "translation": "Upāli said, \"The second untenable expression under Upāli is the conclusion of the explanation, which is now the conclusion.\" So why is it? The second untenable expression under Upāli is two, which is now the first reason for being heckled. A monk who violates the vinaya as a practitioner asks what kind of crime this monk has committed.",
        "source": "X19n0343_002:0181c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯優波離無重增此二比丘罪當直除滅勿擾其心所以者何彼罪性不在內不在外不在中間如佛所說心垢故眾生垢心淨故眾生淨心亦不在內不在外不在中間如其心然罪垢亦然諸法亦然不出於如如優波離以心相得解脫時寧有垢不我言不也維摩詰言一切眾生心相無垢亦復如是唯優波離妄想是垢無妄想是淨顛倒是垢無顛倒是淨取我是垢不取我是淨優波離一切法生滅不住如幻如電諸法不相待乃至一念不住諸法皆妄見如夢如燄如水中月如鏡中像以妄想生其知此者是名奉律其知此者是名善解於是二比丘言上智哉是優波離所不能及持律之上而不能說我答言自捨如來未有聲聞及菩薩能制其樂說之辯其智慧明達為若此也時二比丘疑悔即除發阿耨多羅三藐三菩提心作是願言令一切眾生皆得是辯。",
        "translation": "Vimalakīrti then addressed me, saying, \"Only Upāli has no further crimes. These two monks' sins must be directly removed and extinguished; don't disturb their minds. Why is that? Their sinful natures aren't internal, external, or intermediate as the Buddha taught.",
        "source": "X19n0343_002:0182a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "Therefore, I won't presume to go there to ask about their ailments.",
        "source": "X19n0343_002:0182b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩來下第二明能呵之旨言無重增比丘罪者波離重增此比丘罪是故致呵言重增罪者第一明其已顛倒心作罪見有心能作罪所作竟而波離復更為說於罪相故云重增也二者其前作罪見有罪生今波離為滅罪見有罪滅前見生即有見今見滅即無見故重增也當直除斷者波離即回斷淨名直斷波離回斷即回見淨名直斷即正觀正觀者即方等正觀懺如大經并普賢觀經故大經耆婆云大王若聞如來所說無作無受王之重罪必當消滅王言作罪為心作為身作為人作為法作若心作何者是心若身作何者是身人法亦爾王言當受罪令誰受罪為心受為身受人法受耶若心受若箇是心若身受若箇是身人法亦爾如是無作無受王罪即便清淨也問耆婆亦云無作無受六師亦云無作無受故文云無黑業無黑業報何異解云大異何者且引經答故經云空見之人即為非有有見之人即為非無也然此未足解難今明利根者即便逈悟數節何者若定有見之人不應見空若定空有見之人不應見有若爾故知不定有不定無非是有非是無畢竟清淨也亦如普賢觀云若欲懺悔者端坐念實相實相者一切心行斷無生亦無滅寂滅如涅槃豈同六師無之見耶故云當直除斷也所以者何罪性不在內外中間者釋上無以重增其罪也今明畢竟責罪不可得何得重為說罪相耶言不在內外中間者六根為內六塵為外六識為中六根中無罪故不在內六塵中無罪故不在外六識中無故不在中尚無六根六塵豈復在六識中耶二者自為內他為外自他合為中如一淨境生貪為從內生為從外生為中間耶若從內生無境應生若外生無心應生離內外即無中間故無從也如佛所說心垢故眾生垢下彼謂若無罪那有心心為本本既有寧無末故今更破本如末亦內外中間責也如其心然罪垢亦然諸法亦然者廣類諸法如既無異彼亦無別也波離以心相解脫時寧有垢不者彼謂聖心可爾凡夫豈當然耶是故今及問波離汝得羅漢第九解脫時頗有垢不我言不也得第九解脫豈當有垢即是借所信無喻所信有令所信有同所信無故一切眾生心相亦如是也唯優波離妄相是垢者釋疑疑云若一切眾生無垢今應不見而今現見有垢云何言無垢耶亦不得以解脫為列解云妄想故垢無妄想即是淨也此具三到妄想即想到是垢即心到取我即見到也次舉喻所餘可尋如文。",
        "translation": "When Vimalai came down, the second clarification of the purpose of the objection was that there was no re-increasing the monk's sins, Bo Li re-increased the monk's sins and therefore caused the objection.",
        "source": "X19n0343_002:0182b09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○第九命羅睺羅羅睺羅是佛之子持戒第一何故復呵解云終是有所得顛倒故被呵也問其為何事被呵為出家故被呵問此呵為當羅睺羅出家為不爾耶解云不呵羅睺羅乃是呵其不識出家故被呵何者欲苦聲聞之深也明聲聞之人智慧禪定乞食出家皆非也問羅侯羅孫阿難是叔何故不前命叔次命其孫而前命其孫耶解云離有叔孫之異而羅侯羅若道若俗皆大阿難言俗是大者阿難與羅侯同是得道夜生而羅云大六年何者六年在腹故也二者羅云是君位阿難是臣位何者羅云是佛之子佛應得金輪王也羅云即是金輪皇太子嗣君之位故大阿難止是王故小為此故前列羅云次列阿難也言道大者羅云得上果阿難在學地得初果三者羅云出家早阿難出家晚年二十五始出家又義羅云是本出家持戒是本為此故前命羅云次命阿難也羅侯羅云覆障所以言覆障者六年在胎中為胎所覆故云覆障所以六年在胎者從來言過去經塞鼠孔故六年在胎大論云有仙人入王國輒飲王水取王楊枝犯不與取就王懺悔治罪王見即便入內六日五欲自娛忘外仙人仙人云只應以此治我以六日在內不出看仙人故今生六年在胎也問悉達為與耶輸作世事故有羅云不作世事故有羅云耶有解云不作世事但悉達以指懸點腹即有羅云復有解云佛四月八日夜出家爾日相師語文王云今夜當好備防悉達太子今夜當出家去若不出家明日七寶金輪自然而至父王於是更增妓樂採女悉達太子欲心即動淨居諸天見此事恐苦海長淪無人濟者即下變諸採女猶若死人令太子生厭心然後接菩薩四天王捧馬足踰城而去只因爾夕欲動耶輸即懷羅云身也又羅云亦云宮生所以言宮生者佛六年苦行而耶輸有身諸釋氏恐耶輸陀外情有身後生果似悉達故云宮生也問佛捨轉輪王位捨金輪王位羅云亦捨轉輪王位捨何輪位解云佛不出家得金輪王羅云若不出家得鐵輪王王一天下三藏部執論云鐵輪王出世有白蓋覆一天下十由旬虗空地下神鬼屬也故羅云應得鐵輪王鐵輪亦轉故云捨轉輪王也捨如此富貴出家尚被呵豈況即下凡夫耶而今世人顛倒聰明兒留紹繼家業愚鈍者出家有如此者莫容之也。",
        "translation": "The ninth order is Rāhula. Rāhula is the son of the Buddha who holds the precepts first. Why is he again being criticized? Rāhula is ultimately mistaken in what he has attained.",
        "source": "X19n0343_002:0183a11_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "佛告羅睺羅汝行詣維摩詰問疾。",
        "translation": "The Buddha told Rāhula, \"Go and visit Vimalakīrti to ask about your illness.",
        "source": "X19n0343_002:0183c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文段如前今初命。",
        "translation": "The text was as before, but now he was first instructed.",
        "source": "X19n0343_002:0183c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羅睺羅白佛言世尊我不堪任詣彼問疾。",
        "translation": "Rāhula said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_002:0183c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念昔時毗耶離諸長者子來詣我所稽首作禮問我言唯羅睺羅汝佛之子捨轉輪王位出家為道其出家者有何等利我即如法為說出家功德之利。",
        "translation": "Why is that? Remembering a time when the sons of Vaiśālī came to me, paid homage by prostrating themselves, and asked me, \"Rāhula, your son leaves the position of wheel-turning king and renounces the world as a religious practitioner.",
        "source": "X19n0343_002:0183c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯羅睺羅不應說出家功德之利所以者何無利無功德是為出家有為法者可說有利有功德夫出家者為無為法無為法中無利無功德羅睺羅夫出家者無彼無此亦無中間離六十二見處於涅槃智者所受聖所行處降伏眾魔度五道淨五眼得五力立五根不惱於彼離眾雜惡摧諸外道超越假名出淤泥無繫著無我所無所受無擾亂內懷喜護彼意隨禪定離眾過若能如是是真出家於是維摩詰語諸長者子汝等於正法中宜共出家所以者何佛世難值諸長者子言居士我聞佛言父母不聽不得出家維摩詰言然汝等便發阿耨多羅三藐三菩提心是即出家是即具足爾時三十二長者子皆發阿耨多羅三藐三菩提心。",
        "translation": "Vimalakīrti then addressed me, saying, \"Rāhula, you alone should not explain the benefits of the virtues of renunciation. Why is that? There's no benefit and no virtue. This is renunciation, and those who leave home and live in the present life can be said to have benefit and virtue.",
        "source": "X19n0343_002:0183c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故我不任詣彼問疾。",
        "translation": "That's why I won't presume to go there to ask about their illnesses.",
        "source": "X19n0343_002:0184a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次辭不堪辭不堪為三今即標所以者何釋不堪為二一被呵由如前文時維摩來下第二明能呵之旨也前責羅云汝言出家若箇是出家誰出家耶如大品舍利弗問彌勒隨意迴向彌勒答云汝令我答無我何誰答無人令答誰今亦爾若箇是家若箇是人為言出家耶若言有家為心是家為身是家人是家法是家若心是家若箇是心若身為家若箇是身人法亦爾責出亦爾汝為令心出家無心何所出為令身出無身何所出人法亦爾如是責出家不可得又本自不入今何所出無出出入如中論不來不去也問若無出無入應無出家解云若如此而了不出不入即有出家也然復有兩種出家一者出形家二者出心家形家者即田宅妻子為形家今能割愛辭親被緇入道為出形家而今世雖云出形家非謂出家何者雖捨妻子眷屬復為弟子深房已復為此等縛何謂出家乃是移家耳二者出心家愛見諸煩惱為心家若能斷諸見愛即出心家雖復出此二家復有礙無礙無礙者即是出家人已勉父母之礙即是出於形家應修出心家何者出形家為出心家前方便耳出心家為本今既得出形家應為出心家也言有礙者即是父母不聽不得出家應須為說出心家也而羅云今被呵此諸長者不得形出家應為說出心家不應為說出形家而羅云不應為說出形家而為說應為說出心家而不說是故被呵也所餘文句可尋於是維摩詰長者子汝等於正法中宜共出家問維摩知其不得出形家云何勸出形家耶解云維摩知其不得出形家今勸其出家為出心家前方便既勸其出形家知其應答不得出家因爾即為說出心家之法故前勸也我聞佛言父母不聽不得出家者此出訕訕中有人就諸比丘乞出家諸比丘即為剃頭波家父母眷屬即來呵諸比丘便啟淨飯王王云悉達多偷出家去使我煩惱今去欲出家者父母不聽不得出家佛言如父王勅故云佛言父母不聽不得出家也又侓毗婆沙云佛初成道還羅云覔佛就佛覔法佛即將還寺我有菩提汝用不彼云用佛即度出家父王即立制不聽也。",
        "translation": "Next, the untenable words and the untenable phrases are three. Now, let's label them as such. What are the two untenable phrases? One is being heckled because, as explained above, when Vimalakīrti came, the second is to explain the purpose of heckling. The previous verbal criticism was that you said \"leave home.\" If this is the case, then who leaves home? Who leaves home? As the Mahāprajñāpāramitā asked Maitreya to give his reply, Maitreya replied, \"You told me to reply, 'There's no self.' Who replied, 'Who answered?' Who answered, 'There's no one who told you to reply?' If this is the case, then you say \"leave home.\" If you say \"there's a home,\" or \"there's a person,\" then you say \"leave home.",
        "source": "X19n0343_002:0184a06_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○第十次命阿難問疾其人所以被呵者無由於佛何者由佛疾故命阿難乞乳若使如此佛命阿難乞乳既呵阿難即是呵佛何意爾耶解云佛所以現疾者凡為二事一者為顯如來法身二者為破慳貪梵志為顯法身者有二種迷到之人一者即凡夫之徒取耳目言佛與吾無異何者我有疾病利衰佛亦有八種罪報頭痛金鏘馬麥等我有食即憙無食即愁佛亦爾乞得即飽不得便飢與我何異但智慧身色有勝耳此即凡夫人謂如此二者即小乘羅漢人謂如來亦與吾無異佛有生住滅我亦有生住滅我須衣食佛亦爾我斷三界煩惱盡佛亦爾所以有異者唯長斷習氣身智慧為勝同為三相所遷三者為末世四時五時求如來生劣想謂是無常教此即信五時教毀居士也為有此二迷是故如來現疾使阿難乞乳令維摩呵廣如來法身故云阿難示失彰眾人過居士高呵開法身之唱寄迹乞乳息波慳貪假屈阿難鄙聲聞之劣為眾人有迷阿難同眾人迷呵阿難即呵此迷故廣開如來法身功德二者復欲化彼慳貪梵志是故乞乳阿難受屈即自鄙聲聞高楊菩薩也言化彼慳貪者毗耶國有梵志名梵摩耶利有五百弟子大富大慳作大網覆一宅全飛鳥常侵家中穀米如來欲化彼故命阿難就彼乞乳凡有七聖一者如來現疾二者阿難乞乳三者居士呵四者空中聲告五牛母說偈六牛子說偈七化人來為搆乳阿難來彼乞乳正值其與五百弟子出欲覔國王阿難既捉鉢來其即問來何所索阿難云世尊身小有疾須小乳梵志嘿然思惟我若與即失乳若不與恐諸弟子笑我堅即便指示弊惡之牛令阿難自搆然指其惡牛者欲令牛觸歟阿難恥辱世尊也二者此牛弊惡阿難必不能得汝自不能得我無慳過故指也阿難安徐至牛所牛母即便說偈託慳貪過歎佛功德牛子亦爾阿難既出家人無客自搆即有化人來為阿難搆乳梵志見歎未曾有即便信敬無量人發心此廣出乳光經此經有數紙也。",
        "translation": "The tenth reason why he ordered Ānanda to ask about his illness was because he was being criticized was not due to the Buddha, but because the Buddha was ill, he ordered Ānanda to beg for milk.",
        "source": "X19n0343_002:0184b20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "佛告阿難汝行詣維摩詰問疾。",
        "translation": "The Buddha told Ānanda, \"Do you go to Vimalakīrti to ask about your illness?",
        "source": "X19n0343_002:0185a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難此云歡喜支道林云博父又云無熱何者無也文段如前今即命問疾。",
        "translation": "Ānanda, it's called the Joyful Branch, Daolin, Bofus, and Mugi.",
        "source": "X19n0343_002:0185a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難白佛言世尊我不堪任詣彼問疾。",
        "translation": "Ānanda said to the Buddha, \"Bhagavān, I'm not up to the task of going there to ask about my illness.",
        "source": "X19n0343_002:0185a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何憶念昔時世尊身小有疾當用牛乳我即持鉢詣大婆羅門家門下立。",
        "translation": "Why is that? Remembering that in the past, the Bhagavān had a small illness and should have used cow's milk, I took my bowl and went to the great Brāhmaṇa to stand under his door.",
        "source": "X19n0343_002:0185a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時維摩詰來謂我言唯阿難何為晨朝持鉢住此我言居士世尊身小有疾當用牛乳故來至此維摩詰言止止阿難莫作是語如來身者金剛之體諸惡已斷眾善普會當有何疾當有何惱默往阿難勿謗如來莫使異人聞此麤言無令大威德諸天及他方淨土諸來菩薩得聞斯語阿難轉輪聖王以少福故尚得無病豈況如來無量福會普勝者哉行矣阿難勿使我等受斯恥也外道梵志若聞此語當作是念何名為師自疾不能救而能救諸疾人可密速去勿使人聞當知阿難諸如來身即是法身非思欲身佛為世尊過於三界佛身無漏諸漏已盡佛身無為不墮諸數如此之身當有何疾時我世尊實懷慚愧得無近佛而謬聽耶即聞空中聲曰阿難如居士言但為佛出五濁惡世現行斯法度脫眾生行矣阿難取乳勿慚世尊維摩詰智慧辯才為若此也。",
        "translation": "Vimalakīrti then came to me and said, \"Ānanda, why is it that you carry your bowl in the morning and stay here?\" I said, \"Guru, the Bhagavān has a minor illness that requires cow's milk.\" Vimalakīrti said, \"Stop it, Ānanda. Don't say that. The Tathāgata's body is the adamantine body, and what illnesses and afflictions will there be after all the evil and good [activities] have been stopped and universally assembled.\" Ānanda, don't misrepresent the Tathāgata. Don't let outsiders hear this vulgar speech, for it won't cause the gods of great authority and the bodhisattvas from other pure lands to hear it. Ānanda, the wheel-turning sage king is still free of illness because of a little merit, how could he be the Tathāgata who is the universal winner of measureless merits?",
        "source": "X19n0343_002:0185a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故不任詣彼問疾。",
        "translation": "Therefore, he wouldn't presume to go there to ask about his illness.",
        "source": "X19n0343_002:0185b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次辭不堪為三今即標所以者何釋不堪為二今即第一被呵之由如前所述問佛在何處疾佛爾時音樂樹下去婆羅門家極近也時維摩下第二能呵之旨阿難晨朝持鉢詣婆羅門下淨名問阿難何故此答云世尊身小有疾當用牛乳我來乞乳居士即呵止止莫作此語若使智人聞之知汝不達愚人聞之謂如來實病故云止止也一經本云嘿往一云嘿住皆有其義也轉輪聖王以少福尚無病者舉劣況勝阿難轉輪王下凡尚無病豈況如來極聖而有病如來身即法身者此句由來人義壞招提云此經第二時教開善云第三時教雖第三第二不同同明佛身無常今云即法身非思欲非有漏是無為無為即常身也若言此中云無為是有為者亦應此中云無漏即是有漏及結此中云無漏定是無漏亦應此中云無為定是無為又難此中云如來非思欲如來定非思欲此中云無為定是無為由來同阿難之失也得無近佛而謬聽耶阿難聞此言迴皇無中衛命於彼被呵於此彼此網然進退遺各將非如來無於此言我謬領邪即聞空中聲雙解二人如居士言但為佛出五濁化彼慳貪現行斯事非謬領也此即二人竝得居士得常方便阿難得無常方便故二人得二人俱失如來非常非無常故具四句也餘如文。",
        "translation": "The next word is \"unbearable,\" which is now labeled \"why?\" The explanation is \"unbearable\" in two ways. Now, the first reason for being heckled is as mentioned above, asking where the Buddha is suffering from illness.",
        "source": "X19n0343_002:0185b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是五百大弟子各各向佛說其本緣稱述維摩詰所言皆曰不任詣彼問疾。",
        "translation": "Thus, each of the five hundred great disciples told the Buddha about his original conditions, recounting what Vimalakīrti had said and saying, \"I don't think I'll go to him to ask about his illness.",
        "source": "X19n0343_002:0185c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是五百下大段第二總義五百聲聞也。",
        "translation": "Thus, the second major section below the 500 has the general meaning of 500 śrāvakas.",
        "source": "X19n0343_002:0185c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "維摩經疏第二",
        "translation": "Commentary on the Vimalakīrti-nirdeśa-sūtra, Part II",
        "source": "X19n0343_002:0185c15_0",
        "is_bad_quality": false
    }
]