[
    {
        "source_sentence": "金光明經玄義順正記卷中",
        "translation": "Jin guangming jing xuanyi shunzheng ji roll zhong",
        "source": "X20n0359_002:0323c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "永嘉沙門釋　從義　撰",
        "translation": "By Yongjia śramaṇa Shi Zongyi",
        "source": "X20n0359_002:0323c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三料簡三涅槃文亦為二初簡世人及邪。",
        "translation": "○Three types of nirvāṇa are also summarized in two ways.",
        "source": "X20n0359_002:0323c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三涅槃者若饑得食病得差獄得出獼猴得酒旃遮婆羅門飽食指腹皆是世人暢情為涅槃爾若計非想定無想天為涅槃者此是邪見妄謂涅槃爾。",
        "translation": "If hunger gets food, sickness gets sickness, hell gets monkeys, wine gets wine, candravarman gets food, fingers, and belly are all part of the world, and if one considers the non-thought, concentration, and non-thought heavens to be nirvāṇa, this is wrong view that falsely calls it nirvāṇa.",
        "source": "X20n0359_002:0323c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂暢情為涅槃等者涅槃是安樂之法而安樂名通故此涅槃等非大涅槃也章安云涅槃安樂亘十法界梵行品云寒地獄中若遇熱風以之為樂熱地獄中若遇寒風以之為樂獼猴得酒則能起舞餓鬼飢渴得食則飽亦名涅槃修羅怖畏得歸依處如貧得藏如病得差如是安樂亦名涅槃檀提婆羅門飽食撫腹我今此身即是涅槃此計欲界果報法為涅槃阿羅羅仙得無相定此計色界法為涅槃鬱頭藍弗得非想定此計無色界法為涅槃無想定者留色滅心情謂無想其實想在外人不識計為涅槃若非想定但是不緣前來識處故名非想又不緣於前不用處名非非想此定雖無麤煩惱而有細煩惱十種一受二想三行四觸五思六欲七解八念九定十慧外人不識計為涅槃實是暗證具足苦集垂盡三有還墮三途豈是涅槃畢竟安樂乎。",
        "translation": "This is called \"nirvāṇa when one's emotions are open,\" because nirvāṇa is a state of well-being, and the term \"well-being\" is used to describe it. Chapter 5 states, \"Nirvāṇa and well-being extend across the ten realms of existence.\" The Chapter on the Conduct of Brahmā states, \"In a cold hell, if a hot wind comes across it, it's pleasant.\" In a hot hell, if a cold wind comes across it, it's pleasant.",
        "source": "X20n0359_002:0323c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若多貪下次簡前三教。",
        "translation": "○If there's much craving, the next time around we'll summarize the previous three teachings.",
        "source": "X20n0359_002:0324a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若多貪欲人得不淨觀為涅槃者此乃四善根方便行人涅槃也若三界煩惱盡證有餘涅槃焚身灰智入無餘涅槃菩薩未得此涅槃此即阿含中析法二乘之涅槃若三乘人同盡子果兩縛即是通教中共涅槃若指中道如理為性淨涅槃中道智為圓淨涅槃同緣出世薪盡火滅為方便淨涅槃三種各別互不相關是為別教涅槃若言但有性淨方便淨兩涅槃不明緣因涅槃各別不融者還是別教非今經所譬涅槃也。",
        "translation": "If someone with lots of craving attains the contemplation of impurity as nirvāṇa, this is the nirvāṇa of the practitioner with the four good roots and the method. If the three realms of affliction are ended, he realizes nirvāṇa with remainder, burns his body and enters nirvāṇa without remainder with ashes and wisdom, and the bodhisattva has not yet attained this nirvāṇa, which is the nirvāṇa of the two vehicles that analyze the Dharma in the Āgamas.",
        "source": "X20n0359_002:0324a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偏多貪欲入得不淨觀乃是外凡五停中一準例慈心數息念佛因緣可知故此外凡乃是內凡四善根人方便涅槃良以外凡即是內凡之方便故亦可謂之多貪欲人得不淨觀而為涅槃斯乃可入四善根人內凡涅槃文中語略總而言之應兼七賢方便涅槃故章安云此計二乘方便法為涅槃也三界煩惱即是見思煩惱子縛雖斷有餘果縛尚存焚者燒也焚身即是戒身定身及二解脫灰者死火也滅智亦然故云灰智也灰智即是慧及知見身智俱盡故曰無餘章安云此計二乘果法為涅槃也此約二乘若論菩薩但是伏惑位既同凡是故未得有餘無餘故此乃是阿含三藏二乘耳通教三乘同證安樂名共涅槃別教涅槃中言薪盡火滅者機緣為薪逗應為火眾生機盡聖應亦亡此約大乘若約小乘佛身為薪智慧為火慧依報身身滅智亡故前兩教灰身滅智即此意也若言但有性淨方便兩涅槃等者此舉地人所說故妙玄云地人言但有性淨方便淨今家破云若將修因所成為方便淨者以薪盡火滅為何等邪今以理性為性修因所成為圓淨薪盡火滅為方便淨以三涅槃類通性淨即正因圓淨即了因方便即緣因所言不明緣因涅槃者以由地人錯將圓淨為方便淨是故地人說方便淨但是今家所明圓淨是則地人雖說方便還是不明緣因涅槃以方便淨緣因涅槃乃是薪盡火滅故也彼未說此故云未明耳復次地人雖說性淨及方便淨體非相即故更斥云各別不融還成別教有二無一故非圓妙也。",
        "translation": "In addition, the external worldling is the inner worldling, the four wholesome roots of people's expedient nirvāṇa, and the external worldling is the inner worldling's expedient, so it can also be called the four wholesome roots of people's inner worldling's nirvāṇa.",
        "source": "X20n0359_002:0324a12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○四料簡三身文為三初簡偏文為二初簡藏通又為二初簡三藏次簡通教文為二初正簡藏通二教。",
        "translation": "○4. The summary of the three bodies is divided into three texts, the first one being a summary of the partial texts and the second one being a summary of the tripiṭaka and the second one being a summary of the shared doctrinal texts.",
        "source": "X20n0359_002:0324b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三身者若取樹王下佛為真身神通變化猨猴鹿馬為應身不明三身者此小乘析法意爾若取即事而真為真身化用為應身不明三身者此體法中意爾。",
        "translation": "If we take the buddha under the tree king as the true body, the superknowledge transforming assorted monkeys and deer and horses as the response body, we don't know the meaning of the three bodies.",
        "source": "X20n0359_002:0324b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言體析者三藏名假而法實折實使空如破柱令空大乘名實皆假自相是空如鏡柱本自非柱不待柱滅方見於空即影是空不生不滅不同實柱即事而真為真身者即前文云指空境為法身也化用為應身者亦指神通變化猨猴鹿馬之相為化用耳然三藏教神通變化但是依根本禪定一心作一不得眾多如化主語時化事即語化主默時化事即默語默既爾餘儀亦然以非任運真化故也若通教中化用為應乃是依於無生之理不以二相應諸眾生故使眾生各見不同也次料簡文為二初問意者若如上說即事而真名為真身化用為應者是則通教樹王下得道丈六之身既非即事而真之法又非化用鹿馬之應為是何身所攝邪次答意者通於二身初明從事一往而說樹王下佛丈六之身乃是應同人界之像則屬應身故止觀輔行引大論云現作丈六之形者示同端正人耳或復現作師僧父母猨猴鹿馬一切色像等又一解者前且一往寄事而說判屬應身今此一解則是二往故屬真身於中先例別圓大乘心中智合中理智與體冥函蓋相應為真法身今此通教亦復如是從事而說體是人像雖是應身即事而真還同空境此則豈非亦屬真身是故通教即事而真名為真身例如別圓中智合中理名為法身耳故此法身亦名真身空中為理斯之謂也次若依下簡別教者法身是真實二身不真實奪之雖則乖於圓別與之亦是別教一途故真諦之說非今所用之譬也。",
        "translation": "The words \"analysis of essence\" refer to the fact that the tripiṭaka's name is nominal but the reality of the Dharma is real, making it empty like breaking down a pillar to make it empty. The names and realities of the Mahāyāna are nominal, and their own characteristics are empty like a mirror pillar that is not itself a pillar until the pillar ceases, which is the shadow that is empty, not arisen or ceased, and the different real pillar that is the true body that refers to the realm of emptiness as the Dharma body, and the transformation function as the response body that also refers to the psychic power to transform the characteristics of assorted animals and deer as the transformation function.",
        "source": "X20n0359_002:0324b22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○次若言下顯圓文為二初明三身。",
        "translation": "○Second, if it's said that the text below shows the two aspects of the perfect, the first explains the three bodies.",
        "source": "X20n0359_002:0324c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言三身皆真實至理是法身契理之智是報身起用是應身應身是實佛所化皆實不虗大經云不淨觀亦實亦虗非實不淨作不淨想是為虗能破貪心是為實應身例爾非本體故為虗能利益故為實今取實邊不取虗邊故言三身皆實是今所用。",
        "translation": "If it's said that the three bodies are all real, then the ultimate truth is the Dharma body, and the wisdom that accords with the truth is the reward body, and the arising and functioning of the response body is the response body, and the response body is the real Buddha's transformation of all real things and not barren.",
        "source": "X20n0359_002:0325a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆實者法報屬實此則可解應身是實者以應身是智與體冥能起大用故既是法報實佛所化是故應身及以法報皆實不虗故引大經不淨觀例非實不淨作不淨想此是假想所以為虗雖是假想又能破於貪欲之心復名為實應身例此但是隨機種種假設云云自彼於我何為隨機假設既非本體所以名虗雖則假設又能利益一切眾生故復名實今但取其利益實邊不取種種假設虗邊是故前云三身皆實正是今經所用之譬也。",
        "translation": "The fact that all of them are real is explained by the fact that the response body is real because the response body is wisdom and the essence are mysterious and able to produce great function. Since it's the real Dharma reward and the real Buddha's transformation, the response body and the Dharma reward are real and not barren.",
        "source": "X20n0359_002:0325a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次若復下例。",
        "translation": "○Then again, the following is an example.",
        "source": "X20n0359_002:0325a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復圓論三身皆實皆虗皆亦實亦虗皆非實非虗。",
        "translation": "'Furthermore, the three bodies of the perfect theory are all real, all real, all real, all real, and all non-real and non-graphic.'",
        "source": "X20n0359_002:0325a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通四句孤山云報應即法故三身皆實法即報應故三身皆虗約事則三身相對為雙亦約理則三無三相為雙非四明云圓說三身舉一即三各有四句報身真證故實應身假設故虗法身平等遮照皆雙三身互具四句皆融今謂不然何者別論三身皆真實一句既如上說而三身皆虗等三句準之可解何以故至理本無三身但是隨順世間假施設故豈非三身皆虗雙亦雙非但是俱照俱亡三身之虗實耳。",
        "translation": "As a result, the three bodies are real, and as a matter of principle, the three lacking three characteristics are both nonexistent. As a matter of principle, the three bodies are truly realized, so they're real, and the body that's to be responded to is assumed, so it's barren, and the Dharma body is equally illuminated, so they're both real and nonexistent.",
        "source": "X20n0359_002:0325a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○當約等者結束向意。",
        "translation": "○They should be approximately the same in order to end the dedication of meaning.",
        "source": "X20n0359_002:0325b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當約三身並作四句如別記(云云)。",
        "translation": "It's appropriate to make four statements about the three bodies together, as explained in the separate entry (Yunyun).",
        "source": "X20n0359_002:0325b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知三身既通四句即是三身並四句也言並作者即一一身皆有四句也此意難見今更言之且如法身作四句者至理不變法身實也隨世假立法身虗也雙亦俱照第三句也雙非俱亡第四句也法身四句既爾報應四句準知故云當約三身並作四句也何者文中既云應身非本體故虗當知三身皆是假立非本體故虗也人不見之徒事文記(云云)如別記下注云云者例如法華文句云四句詮量其義已顯為未解者更以常等四句料簡先別作次通作別者法身非常非無常也報身常也應身亦常亦無常也自金剛心通至凡夫無常也通者通途圓說一一如來悉備四句應知彼文通途圓說一一如來皆備四句可例今文三身並作四句之義何者實即是常虗即無常雙亦雙非思之可解。",
        "translation": "Therefore, it's known that the three bodies both share four phrases, which means the three bodies both have four phrases, and the author of the phrase both has four phrases. This is an idea that's difficult to see. I'll explain it further, such as when the Dharma body makes four phrases, the ultimate principle is unchanging, the Dharma body is real, the Dharma body is hypothetically established in accordance with the world, the third phrase is both illuminating and extinguishing, and the fourth phrase is neither.",
        "source": "X20n0359_002:0325b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○問三字下三準例用譬文為二初問次答為二初正答又為二初明義。",
        "translation": "○The question is three words, followed by three examples of the use of metaphors, which are two: first, the question, then the answer, which is two: first, the correct answer, and then two: first, the explanation of the meaning.",
        "source": "X20n0359_002:0325b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問三字譬三身亦得譬一身二身四身無身不答佛赴緣以三字名經義家作三身解釋若得意者作四三二一無義亦復何咎。",
        "translation": "Q. The three words refer to the three bodies, but they also refer to one body, two bodies, four bodies, and no body.",
        "source": "X20n0359_002:0325b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通佛赴一類機緣以金光明三字名此經別目義解之家乃以三字作三身譬而解釋之若得譬於三身之意亦可例作四二一無等也復言三者對上兼舉耳言義家者解義之家也亦如下文云上來舉譬多是義推之例也亦復何咎者義推無壅有何過邪。",
        "translation": "The general idea that the Buddha goes to a certain type of opportunity and condition and uses the three words Jin guangming to name the sutra is that the house of interpretation uses the three words to make an explanation of the three body metaphors.",
        "source": "X20n0359_002:0325b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○下經中悉有其文等者次示文通。",
        "translation": "○These are all the passages in the following sūtras that show the passage of the text.",
        "source": "X20n0359_002:0325c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下經中悉有其文若作四身者新本云釋迦牟尼能種種示現此則開出應化是為四身若作三身者即有三身分別品專論其義若作二身者佛真法身猶若虗空應物現形如水中月若作一身者新本云一切諸佛以真法為身若作無身如來行處淨若虗空而復遊入善寂大城虗空中則無三之數此是無身之文。",
        "translation": "If he makes four bodies, the new version says that the Śākyamuni is capable of various manifestations, and this is the four bodies that open up to transformation.",
        "source": "X20n0359_002:0325c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但義通而佛經中悉有其文故真諦譯新本云釋迦牟尼種種示現名為化身亦可於此化身之中開出應身故云開出應化也現同始終名應無而欻有為化若不開者應即是化故新本中謂之化身又云千百億化身亦是此意也故於釋迦種種示現之中開出應化即是四身之文也三身分別品亦指新本也專論其義者三身之義也如前具錄止觀輔行引彼經文二身則指讖譯今經也一身無身其文可解今經天王讚佛既云佛真法身猶如虗空學四明者何得輙云法身理體相相宛然妙玄文句皆判龍女說偈讚佛具相三十二名為應身何不思之問若以具相為應身者化城喻品文句那云具相三十二是法身邪答此約三德消文便故何者以一切智是般若德以真實滅是解脫德故以具名為法身雖以具相而為法身須了其旨其旨云何達三十二即法身故尚非報智之無相況是應化之有相約中邊而說則法身雙非約事理而言則法身無相故約事理說達相即無相若乃直以四八之相便是法身不論達相即無相者金剛般若斥為邪道佛頂楞嚴辨其妄見豈不由斯乎普賢觀云釋迦名為毗盧遮那徧一切處涅槃經云我今此身即是法身淨名疏記云歎於應身即歎法身故三十二名為法身乃是達於應身即法身相即無相耳故云佛眼既為四眼之體當知四眼即法身相故使尋相見無相也況無相之相諸相中上請觀記文無相之語以祛世人有相之談若能深達如斯意已則一家諸部文義咸通誠由一以貫之不待二隅備舉也華嚴云法性本空寂性空即是佛法性本清淨如空無有相一切法無相是則真佛體生法師云法身無色觀經疏云法身無像斯等格言那不思之輒謂法身相相宛然法身若乃相相宛然報應二身如何說邪莫不三身皆有相乎進退俱非無所名也是故須知三身融妙不出四句何者若存三身法身定無相報通二義應化定有相若其相即俱相俱無相若但從理非相非無相若事理相對無相即相相即無相情通妙契諍論咸失身相既爾說默例然(云云)問若引四王讚佛法身如虗空者荊谿那云非謂太虗名為圓佛答斯問甚善能破羣疑具如十六觀經疏往生記亦如今經文句新記釋四王讚偈中明之(云云)。",
        "translation": "Not only is the meaning shared, but the sutras all contain the text; therefore, the new version of the True Truth Translation says that the various manifestations of Śākyamuni are called the transformation body, and within that transformation body, the response body can also be revealed, which is why it's called the response transformation, and the beginning and end are called the response to nothing and the crash is the transformation.",
        "source": "X20n0359_002:0325c12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○問若爾下次簡用譬盈縮文為二初問。",
        "translation": "○Question, if it's the case, the next time we'll briefly use the metaphors to shorten the text into two questions.",
        "source": "X20n0359_002:0326b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問若爾云何以金光明譬四身二身一身無身。",
        "translation": "\"How, then, does the golden radiance metaphorically describe the four bodies, two bodies, and one body without a body?",
        "source": "X20n0359_002:0326b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可解。",
        "translation": "That's understandable.",
        "source": "X20n0359_002:0326b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次答。",
        "translation": "○The next answer.",
        "source": "X20n0359_002:0326b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答若以義名譬盈縮由義爾若譬四身者取光明之上有煜爚之燄文云金光晃曜此是譬四身之文若譬三身如即所用若譬二身金是正體光明只是功能以此為譬若譬一身但舉於金以為正譬光明既是枝末非正所論若譬無身者至寶以無貪為金楊震四知亦以無貪為金今以世之至寶譬出世之至理彌會文義也。",
        "translation": "If he were to use the meaning to name an analogy, the full and shortened one would be based on the meaning. If he were to use the analogy for the four bodies, he would take the bright light above which there's a shining flame, and the text says, \"The golden light shines brightly.\" This is the text that's used to compare the four bodies.",
        "source": "X20n0359_002:0326b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答中云以義名譬者名字去聲即以譬擬法是以義名譬也既以義名譬故譬之盈縮亦由於義爾故云盈縮由義也盈縮者進退增減也煜(余六切)爚(以灼切)者光明之焰也又盛也燄字當為焰字煜爚之焰即晃耀也故引證云金光晃耀煜爚晃耀欻有欻無可譬化身也若譬三身如即所用者此如即今上文所用也若譬二身金是正體等者亦如文句引他人云鑛石中金金體乃非光非明不妨約金論內外用法性非宗非力亦依法性起於宗力故知金體可譬真身光明既是體上功能有內外用可譬應身若譬一身但取正體其義可知譬無身中引楊震四知者後漢書列傳云楊震字伯起弘農華陰人也年五十乃始仕州郡大將軍鄧隲聞其賢舉茂才四遷荊州刺史東萊太守當之郡道經昌邑故所舉荊州茂才王密為昌邑令謁見至夜懷金十斤以遺震震曰故人知君君不知故人何也密曰暮夜無知者震曰天知神知我知子知何謂無知密愧而出後轉涿郡太守性公廉不受私謁子孫常蔬食步行故舊長者或欲令為開產業震不肯曰使後世稱為清白吏子孫以此遺之不亦厚乎故楊震公廉清白乃是國之至寶故以無貪為金也以世間無貪至寶之金喻於出世無相至妙之理彌益會通文之與義也。",
        "translation": "In the answer, it says, \"We name the metaphor after its meaning, which is to say that we use the metaphor to simulate the Dharma.\" Since we name the metaphor after its meaning, the metaphor's increase and decrease also comes from its meaning; the increase and decrease also comes from the increase and decrease of the metaphor's progress and retreat.",
        "source": "X20n0359_002:0326b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○五料簡三大乘。",
        "translation": "○5. The three great vehicles are described in detail.",
        "source": "X20n0359_002:0326c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三大乘者若約因緣六度大乘者此還是三人名別義同也若約三人同用無生斷煩惱三人同乘一乘此則通教中乘也若理隨得三乘體相別異不同者此則別教中乘也三種並為得乘方便所攝也正法華中明象乘足三為四羊鹿牛乘為得乘所攝象乘即是理乘如今之所明三乘也華嚴中明四乘三乘亦為得乘所攝佛乘正是今之三乘義也。",
        "translation": "If we take the causal six perfections and the three persons as the great vehicle, then these three persons are called by different names and have the same meaning. If we take the three persons as the same function, the unborn, and the afflictions are ended, then the three persons are all on the same vehicle, and if the principle follows the distinctive characteristics of the three vehicles, then this is the middle vehicle of the specific teaching.",
        "source": "X20n0359_002:0326c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若約因緣六度至三人名別義同者此簡三藏教也故妙玄云三因大異三果小同釋籤云諦緣度殊故因大異俱斷見思三乘微異故果小同諦緣既是開合之異故今但舉因緣六度則兼四諦法華文句別以聲聞四諦為小支佛因緣名中菩薩六度為大今文通途舉之故云因緣六度大乘意則別以六度為大乘耳三人名別即三因大異也義同即三果小異也又三人名別義同者三人所觀諦緣度等名目雖異其義大同何者諦緣開合義同可知菩薩六度亦何出於四諦因緣是故菩薩最初發心緣四諦境起四弘誓修六度行於四門上治其六蔽且六蔽初即是慳蔽慳蔽乃是煩惱集諦集招餓鬼即是苦諦觀苦集而行布施即道諦也此苦集息即滅諦也治慳既爾治餘亦然故諦緣度皆可通故三人修之故云義同耳不然豈有慳貪破戒等聲聞緣覺邪諦緣度三其義既同但約自行化他而揀則有三乘大小等異也通教中言三人同用無生至同乘一乘等者玅玄云三因大同三果小異釋籤云俱學般若故因大同同坐解脫習盡不等故果小異同一解脫故云三人同一乘也通教中乘者中字但是語助而已別教中乘中字例然別教三乘體相別異者妙玄云以緣修觀照為乘體諸行是資成以此二法為緣修智慧慧能破惑顯理故用智為乘體而攝大乘論明三種乘理乘即是道前真如隨乘則是觀真如慧得乘即是一切行願重習無分別智契無分別境而此三乘前後未融何者九識乃是道後真如真如無事智行根本種子皆在梨邪識中熏習成就得無分別智光成真實性是則理乘本有隨得今有道後真如方能化物豈非縱義三乘悉為梨邪所攝豈非橫義既有縱橫則非涅槃真伊所喻當知此乃界外一途之法門耳不可被於末代重痛眾生也三種並為得乘方便所攝者前三教三種乘並為圓教三乘之中得乘方便所攝也以前三教之乘悉是圓乘方便故也此乃體內之方便耳故妙玄引經云佛自住大乘是理乘也於道場知已是隨乘也導師方便說是得乘也故方便說即前三教三種之乘耳正法華中明象乘足三為四者即妙經中明大白牛車足羊鹿牛車之三為四也故羊鹿牛喻於昔日三乘之異故昔三乘並是圓教得乘方便所攝耳若正法華中明象乘及妙經中明大白牛車即是圓妙理乘故此即如今之所明別題三字以譬三乘圓玅四德也文句記云正法華中亦先云象馬羊後乃各賜大白象車同一梵文誰非誰是(云云)象乘即是理乘者此約乘體而言也體必眾寶莊校白牛引駕則三乘備矣故云如今之所明三乘也文句記云準對三德應車體中分正及緣對牛為了此則義當修二性一一復具三高廣不二故妙玄云圓教以真性軌為乘體只點真性寂而常照便是觀照只點真具性法界包含乃是資成三法不一不異(云云)華嚴中明四乘者釋籤云謂聲聞乘支佛乘菩薩乘佛也若約地相教道四皆未融今從地實證道故取佛乘同今圓妙一乘具三乘也華嚴之大必兼於小故通舉四乘耳況復約菩薩觀知四乘之相故不須以小乘妨於華嚴之大。",
        "translation": "If we take the six perfections as the causal condition, then the three are named separately and their meanings are the same. This is because Miao Xuan's explanation lot says that the three causes are very different and the three fruits are less the same, and because the truths and conditions are different and the degrees are different, the causes are very different and the views and perceptions of the three vehicles are slightly different, then the fruits are less the same.",
        "source": "X20n0359_002:0326c22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○六料簡三菩提。",
        "translation": "○6. He describes the three bodhisattvas' enlightenment in brief.",
        "source": "X20n0359_002:0327c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三菩提者如請觀音云修三種清淨三菩提心此即緣三乘人心而修心也乃是方便菩提所攝若緣真如實理發菩提心者或緣如來智慧說法發菩提心者或緣如來神通變化發菩提心者亦非今所用文殊問般若云無發是發菩提心又若一發一切發是發菩提心又若非一非一切而一而一切是發菩提心如此菩提即一而三並今所用於一而論三於三而論一爾(云云)。",
        "translation": "This refers to cultivating the mind in reference to the minds of the three vehicles and cultivating the mind, which is also included in the skillful bodhi. If someone develops the mind of enlightenment in reference to the true principles of reality, or if someone develops the mind of enlightenment in reference to the Tathāgata's wisdom in teaching the Dharma, or if someone develops the mind of enlightenment in reference to the Tathāgata's miraculous powers and transformations, they are not the same as the one used today, but Mañjuśrī's question to Prajñāpāramitā says that the absence of development is the development of the mind of enlightenment, and if the development of one and all is the development of the mind of enlightenment, and if it's not one and not all, but one and all is the development of the mind of enlightenment.",
        "source": "X20n0359_002:0327c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "請觀音經三乘發心乃是方便菩提心攝準前料簡三種大乘三種並為得乘所攝其義可知若緣真如或緣智慧或緣神變既皆言或即是各各不融之相是故亦非今之所用雖非今用準前文意亦可並為方便菩提之所攝也文殊問般若云無發是發菩提心者即畢竟空也又若一發一切發是發菩提心者即空不定空空必具於不思議假也又若非一非一切而一而一切是發菩提心者即空假不二名為妙中雙遮雙照也是故結云即一而三並今所用也於一論三既爾於三論一亦然注云云者良由於此孤山云文殊問者問字誤也應作說字有文殊問菩提經有文殊說般若經今引文殊說般若經耳然止觀中引文殊問經云破一切發名發菩提心常隨菩提相而發菩提心又無發而發無隨而隨又過一切破過一切隨雙照破隨名發菩提心如此三種不一不異如理如事非事非理輔行云此有三經同為一卷初卷題為文殊問次卷題云伽邪山頂後卷題云象頭山今文所引多是伽邪山頂經三經並是文殊發問義味大同故今引云文殊問經隨即是假破即是空雙非雙照即是中道此約法界無緣大慈而發心也故與今文圓妙發心無二無別。",
        "translation": "Please note that the Avalokitêśvara Sutra's three-vehicle arousal of the mind is a convenient way to bring in the mind of enlightenment, and its meaning can be understood if it's contingent on true thusness, contingent on wisdom, or contingent on miracles, all of which speak or are contingent on each other's incompatible characteristics.",
        "source": "X20n0359_002:0327c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○七料簡三般若。",
        "translation": "○7. Summary of the three prajñāpāramitās.",
        "source": "X20n0359_002:0328a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三般若者問般若至忘至寂云何分別諸法耶若一切智觀慧眼見見法皆非法道種智觀法眼見見非法皆是法一切種智觀佛眼見見法非法非非法雙照法非法若三智三眼一時圓觀一切法寂滅相種種行類相貌皆知五眼具足成菩提汝所問者乃是眇眼所見偏觀所觀與則是曲見奪則墮尼犍也。",
        "translation": "If the three kinds of wisdom and the three eyes observe the tranquil aspect of all things in a single moment, they all know that the five eyes are complete and perfect for bodhi. Your question is whether the vision of the distant eye, the partial vision, and the contemplation are distorted views that would lead to a fall into nirvāṇa.",
        "source": "X20n0359_002:0328a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問般若至忘至寂云何分別諸法者此約但空般若為問也但空般若如頗棃珠不能雨寶亦如得銅不能照面若不但空甚深般若如如意珠雨寶無盡亦如明鏡萬像具彰並由理具方有事用不許心具妙理徒施故不可以但空般若而難甚深妙空般若具於妙有也答中言一切智觀慧眼見見法皆非法者從假入空也道種智觀法眼見見非法皆是法者從空入假也一切種智觀佛眼見法非法非非法雙照法非法者因前二觀為方便得入中道第一義觀雙遮雙照也若三智三眼一時圓觀等者以此驗知三眼智約次第義即是別教非今所用故此所明三智三眼一時圓觀一切法等乃是今文所用之譬也一切法寂滅相等者此文存略止觀具云一相寂滅相種種行類相貌皆知名一切種智此智觀三諦者若言一相寂滅相即是觀於中道若言種種行類相貌皆知即是雙照二諦也三智既圓五眼必具三諦若融能所乃妙諦觀無別方成圓頓如汝所問至忘至寂斯乃小乘眇目偏觀但空斷無之般若耳故與而言之乃是偏小曲見奪而言之乃是外道尼犍斷見非是圓頓行大直道空中之理本具妙假之意也言眇目者說文云一目小也故法華云眇目矬陋言尼犍者此云不繫也出家外道之通稱也然偏空無物妙理本具一家諸部文義雖顯學者猶迷故不獲已更略言之法華文句云體即實相無有分別用則立法差降不同無住無相即無差別立一切法即有差別差別如卉木無差如一地地雖無差而能生於桃李卉木差別等異桃李卉木雖差而同是一堅相若知地具桃李即識實中有權解無差別即是差別若知桃李堅相即識權中有實解差別即是無差別由是明之大師正以地具桃李喻於空中實相本具三千妙假之諸法耳故金錍云若不許心具圓頓之理徒施一家所立不思議境於一念中理具三千故所變處無非三千故至止觀正明觀法並以三千而為指南良由於此以無三千妙假本具而實相空中乃成偏空但中故也圓理徒施蓋由此也四明不曉空中實相本具妙假三千諸法便謂實相相相宛然遂立空中之理自有三千之相此與一家諸文不合何者輔行云一家觀門永異諸說該攝一切十方佛法良由觀具具即是假又云別教已還尚不識具況識空中又云故知具一切法即是於假如此等文皆明性具三千是不思議假與法華文句云若知地具桃李即識實中有權不亦同邪是故當知實相故則三千亡絕矣若謂不然輔行那云假即空中乃達理具即中釋籤那云照故三千恒具遮故法爾空中況釋籤云若以心性觀彼界如界如皆空豈非三千即空亡泯無相乎又云常具諸法豈非三千即假雖亡而存乎又云非空非具豈非三千即中雙遮二邊心性不動乎又云而空而具豈非三千即中雙照空假乎又云非遮非照豈非三千三諦三觀俱不可得乎得斯意已方見今文三種般若圓妙之旨何者約事理而說則是觀照實相般若之理本無諸相而具方便般若之事諸相宛然如地具桃李即識實中有權也若約中邊而說乃是實相般若本非寂照而具寂照兩種般若二邊之相也地具桃李喻意可識若即邊而中即事而理乃是桃李堅相權中有實差即無差耳何有諸法相相宛然邪四明不曉聞說空中亡泯寂絕輙便破云與而言之幻有即空奪而為語外道斷見若爾法華文句云非但光宅不知實智無若干梁代諸師皆不知實智無若干文句記云四教實智皆無若干豈圓實智更有若干又云實智尚無阿鼻等豈是幻有即空外道斷見邪具如金錍不二門記廣辨其謬(云云)。",
        "translation": "The question, \"Prajñāpāramitā, up to the point of forgetfulness and quiescence, how do you discern all dharmas?\" is a question about prajñāpāramitā, but prajñāpāramitā, like the concept that beads can't rain down treasure, or like attaining copper that can't illuminate the face, or not only prajñāpāramitā, like the concept that beads and treasure are inexhaustible, but also like a bright mirror with all its images and the principle that they are complete, so there's something to be done that doesn't allow the mind to be equipped with the marvelous principle in vain.",
        "source": "X20n0359_002:0328a20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○八料簡三佛性。",
        "translation": "○8. \"We should examine the three buddha-natures.",
        "source": "X20n0359_002:0329a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三佛性者真諦師云正性在道前了性在道中緣性在道後此一往別說推理不然華嚴云一中具無量大品云一心具萬行淨名云舉足下足具於佛法矣法華云一切智願猶在不失涅槃云金剛寶藏具足無缺但有淺深明昧之殊爾。",
        "translation": "The summary of the three buddha-natures is explained by the True Truth that the correct nature is before the path, the completed nature is within the path, and the contingent nature is after the path.",
        "source": "X20n0359_002:0329a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破真諦云一往別說者例如玅玄引攝大乘明別教三乘是界外一途之法門耳引華嚴云一中具無量等者通途證於道前道中道後一一圓具三佛性耳但有深淺明昧之殊者以道前道中道後不出六即之位故義開六即名智淺深由淺深故乃論明昧應約六即迭分淺深明昧之相(云云)故妙玄云若知三軌即三佛性是名理佛性五品觀行見佛性六根相似見佛性乃至等覺分真見佛性妙覺究竟見佛性是稱妙也又妙玄中十種三法皆約六即若爾今文淺深明昧亦可例通餘九三法然淨名疏引大品云諸法雖空而能一心具足萬行又止觀中明假觀云但觀空智能令不空於一心中點示萬行即發法眼徧知法藥故名假觀也華嚴云一中具無量無量中一等一多相即而輔行云能了妄念無一異相達此無明具一切心三千具足方能照於一多相即等故知法華一切智願及大經云金剛寶藏具足無缺等皆是真空不礙玅有理必具事意彰三諦不出一心耳人不見之誠堪愍矣。",
        "translation": "For example, Śāriputra's introduction of the Mahāyāna explains that the differentiated teaching of the three vehicles is the Dharma-gate of the one path beyond the realm. Huayan's introduction of the one medium with measureless forms and so forth is the common path to realize the three buddha-natures in the perfect sequence before the path, during the path, and after the path.",
        "source": "X20n0359_002:0329a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○九料簡三識。",
        "translation": "○9. We should examine the three consciousnesses.",
        "source": "X20n0359_002:0329b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三識若分別說者則屬三人此乃別教意非今所用若依攝論如土染金之文即是圓意土即阿陀那染即阿棃耶金即菴摩羅此即圓說也問如經云依智不依識既云三識此那可依答經言不依識者是生死識今則不爾今言依識者是智之異名名清淨識又道前通名識道後轉依即是智慧(未詳)。",
        "translation": "If the three consciousnesses are explained in detail, then they belong to three people. This is the meaning of the separate teachings, not the one used today. If we rely on the Summary of the Treatise, then the text on earth and defiled gold means the perfect meaning of earth as atana, defiled as artanian, and gold as amala, which is the perfect teaching.",
        "source": "X20n0359_002:0329b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言若分別說則屬三人是別教意者如前文中別以三識分對二乘菩薩及佛各別不融乃是別意若約三人一一具三方成圓意是故前文於別對後即便融通三識一一皆具四德常樂我淨與夫三德無二無別也若依攝論如土染金等者以土染金三不相離可喻圓教三識一念也然妙玄中引攝論云如金土染淨染譬六識金譬淨識土譬棃邪識此與今文以譬對法有同有異金譬淨識金同今文金譬菴羅染譬六識土譬棃邪與今全異者以妙玄中取事中染汙故譬六識今取根本染汙故對棃耶耳然玅玄中既以染譬六識應合六七共為緣因故知六七皆喻於染而玅玄以土譬棃邪者此取土有含藏種子之義如棃邪中有生死種子智慧種子也今文以十譬陀那者此取第七識所持諸法以助藏識執持諸法故也是則妙玄及以今文各隨義便所以法譬對當不同耳然攝論云世尊說法有三種一染汙分二清淨分三染汙清淨分依何義故說此三分於依他性中(三無性論云一切諸法不出三性一分別性二依他性三真實性分別性者諸名言所顯諸法自性依他性者謂待因緣顯法自性真實性者謂法如如云云)分別性為染汙分真實性為清淨分依他性為染汙清淨分依如此義故說三分於此義中說何為譬以金藏土為譬譬如於金藏土中見有三法一地界二金三土於地界中土非有而顯現金實有不顯現此土若以火燒煉土則不現金相自現此地界土顯現時由虗妄相顯現金顯現時由真實相顯現是故地界有二分如此本識未為無分別智火所燒煉時此識由虗妄分別性顯現不由真實性顯現若為無分別智火所燒煉時此識由成就真實性顯現不由虗妄分別性顯現是故虗妄分別性識即依他性有二分譬如金藏土中所有地界(云云)然今文云如土染金及妙玄云如金土染淨者此恐大師引彼攝論法喻之文隨義轉用以譬三識耳以論地界不出於土故且置之但取金土兩種之喻及以法中染淨之說共成三識之譬故也亦如玅玄引地論云金藏說佛甚微智空有不二不異不盡然彼論偈但云自體本來空(句)有不二不盡(句)是則彼論但說三句而無第三不異句也今家引之乃是準義增加句法耳具如大部補注中示(云云)經云依智不依識者即涅槃等經也法界次第云照了之心名之為智妄想之心名之為識故今文云識是生死也識是智之異名名清淨識者三識即是一心三智皆具四德也智識籌量無所染著故名清淨故妙玄云菴摩羅識名無分別智光若無分別即分別者當知七八皆名智光又道前通名為識者道前猶屬凡位是故通名為識此生死也道後轉依即是智慧者道後即果證之後此顯識是智慧也言轉依者妙玄云若棃耶中有生死種子熏習增長即成分別識若棃邪中有智慧種子聞熏習增長即轉依成道後真如名為淨識釋籤云轉於染依而依於淨是故在染則種子依棃耶在淨則轉於能依以成第九注云未詳者四明云潛斥之意耳唯識論轉於八識以成四智乃是教道一途之說既是菩薩所造之論不欲顯言其非故但注云未詳如諸文中破古多云此語難解故知未詳不異難解也今謂不然何者今文兩解並是今家所立正義況復道後轉依之義亦與玄籤所明三識即一論三即三論一大旨是同故非潛斥唯識論意若云菩薩造論不欲顯言其非但潛斥之者妙玄那忽彈龍樹云天竺大論尚非其類莫以中論相比等由是言之非潛斥矣應知未詳即章安自謂大師所說道前名識道後轉依即是智慧未暇詳廣委悉明也而妙玄既釋籤又解故今不可得而詳之矣例如妙玄及止觀中皆云若依普賢觀則以五品在十信內而章安觀心論疏乃云普賢觀明五品即十信未詳若謂今文未詳兩字是潛斥者觀心論疏未詳兩字豈亦然邪故寧僧錄撰四分鈔音義指歸云言未詳者辭有詳略言未詳者即不廣述刪古疏也今亦例然故知未詳即未暇廣明轉依之義耳非潛斥之辭也然普賢觀以五品在十信內如大部補注中示(云云)故章安有兩處未詳之文今皆詳之以貽後學。",
        "translation": "If it is said discriminatingly, then the three persons belong to the meaning of the distinct teaching. As in the preceding paragraph, the three consciousnesses are separately opposed to each of the two vehicle bodhisattvas and buddhas, so it is a distinct meaning if it is said that each of the three persons is equipped with the four virtues, eternal bliss, self-purity, and the three virtues are not two or different from each other.",
        "source": "X20n0359_002:0329b19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○十料簡三道。",
        "translation": "○Ten sections outline the three paths.",
        "source": "X20n0359_002:0330b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "料簡三道者問界內可有十二輪轉三道迷惑界外復云何答寶性論云生界外有四種障謂緣相生壞緣即無明為行作緣即煩惱道也相即結業即業道也生即名色等是苦之初壞即老死是苦之終即苦道也有此四障障於四德緣障淨相障我生障樂壞障常四障破四德顯也。",
        "translation": "Ans. The Jewel-Nature Treatise says that there are four kinds of hindrances outside the realm of birth, namely, conditioned forms, birth and decay, conditioned forms, which are ignorance, conditioned forms, which are actions, which are the path of affliction, and form, which are karma, which are the path of action, birth, which are name-and-form, and so forth, which are the beginning of suffering, decay, which are old age and death, which are the end of suffering, and the path of suffering.",
        "source": "X20n0359_002:0330b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引寶性論明界外十二因緣者妙玄止觀皆作是說與今文同但彼又云二乘之人雖有無常苦空無我等對治於佛法身猶是顛倒故有無明等也所以然者降佛已還皆有無明無明潤業那得無苦此十二輪雖不退界墮下不妨從無明輪至老死輪從老死輪至無明障於實理也凡界內之名通於界外者名同體異若不爾者此與二乘所斷何別應知今文四種之障障於四德障德若異猶是教道德障融妙方是今經三字所譬之三道也。",
        "translation": "Although the two vehicles have impermanence, suffering, emptiness, and no-self as their countermeasures, the Buddha's Dharma body is still mistaken, so there's ignorance and so forth.",
        "source": "X20n0359_002:0330c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四附文釋文為二初標。",
        "translation": "○The four explanations accompanying the text are twofold.",
        "source": "X20n0359_002:0330c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四　經文立名者。",
        "translation": "Fourth, the sūtras establish names.",
        "source": "X20n0359_002:0330c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前云附文今云依經文依即附也四明云前作譬釋葢為古師不知三字從法得名謂是譬喻大師見他譬法不周是故同他用譬擬法然而三字是法非譬茲自立附文當體今謂不然何者前既標云今釋名為五何謂之以譬擬法同他用譬從茲自立附文當體若謂三字是法非譬為非以譬擬法之譬為非即法作譬之譬任彼答之矛盾斯現(云云)應知古師但是以譬擬法不周乃為今家之所破耳非謂今家以譬擬法橫豎該羅是同他也若謂今家以譬擬法是同他人從茲自立附文當體捨譬從法者顯違下文非今就文而害於譬是故須知以譬擬法即法非譬但隨利鈍親疎不同現題只是金光明耳非單法也故不可云從茲自立附文當體捨譬從法利根親近尚非捨譬況鈍根以利根親近解即法作譬是即無量甚深法性作金光明之譬故也。",
        "translation": "The previous statement was attached to the text, and the present statement is based on the sūtra text, which is attached to the four explanations of the former making an analogy because the ancient masters didn't know that the three words from the Dharma got their names from the metaphor.",
        "source": "X20n0359_002:0330c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次上來下釋文為四初明來意文為二初略示。",
        "translation": "○There are four explanations of the text below the previous one.",
        "source": "X20n0359_002:0331a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上來舉譬多是義推依文立名顯然可解。",
        "translation": "The above examples are mostly deductions of meaning that rely on the text to create names that are clearly understandable.",
        "source": "X20n0359_002:0331a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上來所舉別題三字橫竪譬法多是大師用於法性融通之旨及以經王統攝之義推究三字所譬法門橫豎無礙若依經文以別題三字之名顯然可解此葢詳究別題三字所出經文故結集家依於經文云金光明而立別題之三字耳是則第三以譬擬法少分可通古來諸師若乃附文當體二釋一向唯是今家發明故知第三第四第五三釋並是今家用於利鈍親疏之義非謂第三以譬擬法是同他也。",
        "translation": "The above-explained, separately titled three words that describe the horizontal and vertical aspects of the teaching are often used by the great masters to infer the purpose of the interpenetration of the nature of things and the meaning of the unified collection of the king of the scriptures.",
        "source": "X20n0359_002:0331a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下徵釋。",
        "translation": "○What then is the next explanation?",
        "source": "X20n0359_002:0331a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者。",
        "translation": "\"What?",
        "source": "X20n0359_002:0331a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者兩字即是徵起解釋之辭又公羊傳云將設事類之辭也。",
        "translation": "The word \"why\" refers to the words that are used to levy an interpretation, and it's also the word used in the Gongsang biography to describe the types of things that will be set up.",
        "source": "X20n0359_002:0331a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次義推下兩句雙判譬喻附文。",
        "translation": "○Second, the following two phrases both define the metaphor and the accompanying text.",
        "source": "X20n0359_002:0331a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "義推疎遠依文親近。",
        "translation": "The derivation of meaning depends on the proximity of the text.",
        "source": "X20n0359_002:0331a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次以已下乃是雙釋疎遠親近。",
        "translation": "○Second, the following is a dual explanation of the distant and close depending on the text.",
        "source": "X20n0359_002:0331a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以己情推度是故言疎彼義例此是故言遠用佛口說是故言親即此經文是故言近豈可棄親近而從疎遠耶。",
        "translation": "They use their own feelings to deduce that it's because of this that they're said to be distant, and they use the Buddha's mouth to teach that it's because of this that they're close.",
        "source": "X20n0359_002:0331a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以己情推用佛口說親疎明矣彼義例此即經文是遠近彰矣彼義例此者謂前文中以譬擬法乃是用於諸大乘經三德等義例此所譬法性融通經王統攝橫豎等也豈可等者此意葢言若苟執於第三譬喻復害第四依文親近故云豈可捐棄第四依文親近而獨從前義推疎遠邪下文既云非今就文而害於譬四明何得獨執附文當體二釋而害前來以譬擬法橫豎該羅況復執於附文當體謂是單法殊乖即法作譬之言又今文云義推疎遠乃是大師自以附文望前以譬擬法橫豎比決親疎非謂斥於古來諸師何者以斥古師即前所謂蹙靈鳳於鳩巢迴神龍於兔窟故也而四明云人師推度是故言疎灼然誤矣。",
        "translation": "The meaning of this example refers to the preceding passage in which the simile is used to draw up a teaching that's based on the three virtues of the great vehicle sūtras and other examples.",
        "source": "X20n0359_002:0331a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○始從序品下次正釋文為三初總示。",
        "translation": "○Beginning with the preface, the next section correctly interprets the text in three ways, beginning with a general introduction.",
        "source": "X20n0359_002:0331b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始從序品終乎讚佛品品之中若不說金光明名即說金光明事或一品說名不說事或一品說事不說名或一品名事兼明或一品名事獨說或一品重說名重說事故知品品不空篇篇悉有為此義故依文立名也。",
        "translation": "Starting with the preface and ending with the praise of the Buddha, if a chapter doesn't say the name of golden light, then it says the thing of golden light, or if a chapter says the thing but not the name, or if a chapter says the thing but not the name, or if a chapter says both the name and the thing, or if a chapter says the name and the thing alone, or if a chapter repeats the name and repeats the thing, then we know that each chapter is not empty, and each chapter is fully named according to the text for this reason.",
        "source": "X20n0359_002:0331b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始從序品終乎讚佛者舉其初後中間可知品品即是十八品也若不說名即說事者此乃通途明品品中之所說也或一品說名不說事或一品說事不說名者此別明於十八品中或單說於名或單說於事也如序品云是金光明即是一品單說於名如壽量品云放大光明等即是一品單說於事兩品既爾餘十六品尋文可知不煩委引或一品名事兼明者兼謂相兼即一品中名事俱說也如空品云故此尊經豈非說名又云金銀瑠璃豈非說事或一品名事獨說者獨即單也故此一句收於上文或一品說名不說事或一品說事不說名兩句也為對名事兼明故更加於名事獨說耳或一品重說名重說事者即一品內兩番三番等說名事也如懺悔品數言金鼓之事頻說別題之名餘諸品中準思可見唯四王品名事重重故下文云重說其名重明其事也品品即是不空篇篇即是悉有既十八品中悉有名事為此義故須用第四依於經文而立別題三字之名也品者類也文句氣類相從者節之為品也篇者編簡也古者殺青為簡以韋編之編簡成篇猶今連紙成卷也故春秋左傳序云大事書之於策小事簡牘而已四明云名是理名事是事用今謂不然何者金光明事既是事用金光明名豈非乃是事上之名而此事名並由法性理體本具方有世間事用之名是故下文引於稻稈斧柯等事指此等事仍即為名請熟思之豈非今經乃指金鼓光明等事仍即為名若不爾者則名無所召之事事無能召之名矣故知經云是金光明此金光明是此兩字皆是指召金光明事以立名耳四明乃將是之一字專指法性若爾別題應云法性何謂之金光明邪四明難云是之一字不指法性為指何物是金光明今為答之指事為名文義炳然何得難云更指何物四明又云故知別題三字直名深廣法性不從譬喻此文最顯故云創首標名彌為可用也今問四明譬之一字準下料簡自有以譬擬法自有即法作譬而言三字直名法性不從譬者為是不從以譬擬法之譬為是不從即法作譬之譬任彼自答乘違愈彰(云云)今謂依附經文中云是金光明以立別題三字之名此名元是事用之名並由理具方有事用故更立於當體仰則真法俯立俗號全法性事用之名乃是即法作譬耳故此利根親近不妨鈍根疎遠所以用於別題三字事用之名而擬無量甚深法性知只一事用金光明名非但以此譬法亦乃即法作譬四明問他是之一字不指法性更指何物今問四明即法作譬即法兩字若指法性作譬兩字若不指於別題三字事用之名未審作譬兩字為指於何若指法性一何可笑若指別題豈非別題三字金法性作金光明是即法依譬乎何得謂之別題三字直指法性不從譬耶。",
        "translation": "This is the beginning, beginning with the preface section, and ending with the praise of the Buddha, which is the first, second, and middle sections of the sutra, which are the eighteen sections.",
        "source": "X20n0359_002:0331b19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○序品云下次別釋文為二初歷舉諸文。",
        "translation": "○The preface says the next time we'll interpret the text separately, there are two ways to begin by reciting the texts.",
        "source": "X20n0359_002:0332a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "序品云是金光明諸經之王創首標名彌為可用次壽量品四佛俱集王舍城放大光明照王舍城及此三千大千世界發起其事懺悔品信相夢見金皷其狀姝大共明溥照過夜至旦向佛說之讚嘆品金龍尊王奉貢金皷發大誓願願我當來夜則夢見晝如實說空品云故此尊經略而說之尊經即金光明也四王品六番問答問問之中重說其名答答之內重明其事又以手擎香爐時香煙變為香蓋金光不但徧此大千亦徧十方佛土(云云)大辨功德已下標名舉事其例甚多。",
        "translation": "The preface section says, \"This is the golden radiance of the kings of the scriptures.\" The first section labels the name Mi as available, followed by the life span section, in which four buddhas gather together in Rājagṛha to shine their great radiance on Rājagṛha and the 3,000 great thousand worlds that give rise to their affairs, and the repentance section, in which the faithful marks dream of seeing the golden kettle and its shape shine brightly and pervasively through the night and into the sun, in which the Buddha is praised.",
        "source": "X20n0359_002:0332a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引序品云是金光明諸經之王者只應但引是金光明下句乃是文勢相帶來耳是故次句但云創首標名也創首者始初也彌者益也彌為可用者用此經文首初標於三字之名立於別題是故謂之依文立名顯然可解也引壽量品四佛放光發起其事者四佛之身咸皆金色於金色身既放光明故知即是發起別題三字名下金光明事耳以由序品創首標名既乃謂之是金光明未知是字為指於何是故四佛從金色身放大光明發起名下所召之事名下必有所召之事事上必有能召之名創首標云是金光明是之一字良由於此如何不見妄生建立懺悔讚歎兩品之中有名有事今且引事故云夢見金鼓等也空品之中亦有名事今且引名故云尊經即金光明為眾寶之上故是尊貴之經也問問之中重說其名者即以白佛名為問耳如來述成即是答也如初問中初白佛云是金光明次乃又云世尊是金光明又云此經能照諸天宮殿乃至云是經能滅苦惱又云持經及是經等初問之中重重說名既乃如此下之五問尋文可知今不煩引又復六番問問之中非但重說其名亦乃重說其事如第四番白佛問中云燒種種香變成香葢其香微妙金色晃耀照我等宮又云聞是妙香及見香葢光明普照又云是香葢光明亦照一切諸天宮殿等豈非重說其事乎又第五番白佛問中云見是種種香煙雲葢等又第一番白佛問中云此經能照諸天宮殿照即光明明能除暗是故又云滅苦惱等又云增益身力心進勇銳等又云以淨天眼過於人眼等皆是事用之文也第二第三白佛問中準此可解今且綺文互現故云問中說名答中明事耳答答之中重明其事者若以能召名下之事是則六番述成答中重明其事其文甚多如第一番述成答中云供養供敬此金光明又云若能護念是經典者又云若能護念此經等若乃單從事用而說者如云種諸善根乃至以法治世為人天王汝等今日長夜利益又云與修羅共戰常得勝利等皆是金光明之事用也初番述成既爾後之五番可知所召之事既乃如此能召之名準斯可見故答答之中亦重說名也然則六番述成答中明事之文最彰顯者莫過第四述成答中所以復云又以手擎香爐時煙變為香蓋金光不但徧此大千亦徧十方佛土也注云云者略有二意一者令更引下文云於諸佛上虗空之中亦成香蓋金光普照亦復如是又云諸佛聞是妙香見是香葢及金色光於十方界作如是等神力變化又云汝已能坐金剛座處等二者應知此香蓋等乃是事用金光明耳恐不了者直作理解故注云云故次文中便約三世而簡辨之此香葢等即是未來金光明事然文句中釋此之事仍分二義初約因緣解云人王心存至典是故香作金光迴施必得是故天宮相現次約觀心解云以智慧火然實相香起戒定慧煙實相是真法故言金光戒慧與理冥故徹照無礙既云戒慧與理冥故徹照無礙當知乃是智與體冥能起大用即理之事耳又云實相是真法故言金光者是法性可尊可貴寂而常照金法性為金光是即法作譬耳若爾戒慧與理冥故徹照無礙豈非法性大悲能多利益名之為明邪是故文句觀心文云實相真法及戒慧等不出法性甚深無量乃即法也又云故言金光及徹照無礙等不出別題三字名事斯乃作譬也故即法作譬是金理之事不其然乎故妙玄中解蓮華云法理而制事即此意也然此乃是下文第五當體章意今預明之是故云耳須知第四依文立名但是詳究別題三字名之與事所出之文耳不可於此附文釋中便談全理成事之意若不爾者何殊下文第五當體四明不知此意乃解是金光明云是之一字即指法性不從譬喻此文最顯又解四佛放大光明云從法性金光明起又解空品尊經云以理為尊經也今謂此說略有二失一者濫於下文當體如向所示二者依文立名名必召事是故乃指事金光明而為所召此事此名至下第五約當體釋並由法性理體本具此名此事方有今日別題三字事之與名即法作譬良由於此如何不見直作法性理名而解若作法性理名而解是則別題應須改云法性經也何故謂之金光明乎以此觀之別題三字事用之名須明二義一者並由理具事名方有今日別體事名即當體章之正意也二者若將今日事名以擬本理三德等法乃是第三譬喻之意也是故只一事用之名利鈍皆通親疎俱暢俱即法作譬利根親近其義為正以譬擬法鈍根疎遠其意屬傍雖有傍正親疎利鈍一不可廢何得於中妄生去取大辨功德已下標名舉事其例甚多者大辨品云若經中有失文字等又云是說法者廣宣流布是妙經典又云復令眾生得聞是經等功德天品云思惟是經又云聽是經已又云金山照明如來又云金銀七寶等又云若有人能稱金光明又云園名功德華光有最勝園名金幢七寶極妙又云寶華瑠璃佛等此之兩品名事既如此多下去諸品讚佛品云從此世界至金寶蓋山王如來國土又云如來之身金色微妙其明照耀如金山王身淨柔輭如金蓮華淨潔無比如紫金山如融真金光明赫弈等故云其例甚多也。",
        "translation": "引序品云是金光明諸經之王者只應但引是金光明下句乃是文勢相帶來耳是故次句但云創首標名也創首者始初也彌者益也彌為可用者用此經文首初標於三字之名立於別題是故謂之依文立名顯然可解也引壽量品四佛放光發起其事者四佛之身咸皆金色於金色身既放光明故知即是發起別題三字名下金光明事耳以由序品創首標名既乃謂之是金光明未知是字為指於何是故四佛從金色身放大光明發起名下所召之事名下必有所召之事事上必有能召之名創首標云是金光明是之一字良由於此如何不見妄生建立懺悔讚歎兩品之中有名有事今且引事故云夢見金鼓等也空品之中亦有名事今且引名故云尊經即金光明為眾寶之上故是尊貴之經也問問之中重說其名者即以白佛名為問耳如來述成即是答也如初問中初白佛云是金光明次乃又云世尊是金光明又云此經能照諸天宮殿乃至云是經能滅苦惱又云持經及是經等初問之中重重說名既乃如此下之五問尋文可知今不煩引又復六番問問之中非但重說其名亦乃重說其事如第四番白佛問中云燒種種香變成香葢其香微妙金色晃耀照我等宮又云聞是妙香及見香葢光明普照又云是香葢光明亦照一切諸天宮殿等豈非重說其事乎又第五番白佛問中云見是種種香煙雲葢等又第一番白佛問中云此經能照諸天宮殿照即光明明能除暗是故又云滅苦惱等又云增益身力心進勇銳等又云以淨天眼過於人眼等皆是事用之文也第二第三白佛問中準此可解今且綺文互現故云問中說名答中明事耳答答之中重明其事者若以能召名下之事是則六番述成答中重明其事其文甚多如第一番述成答中云供養供敬此金光明又云若能護念是經典者又云若能護念此經等若乃單從事用而說者如云種諸善根乃至以法治世為人天王汝等今日長夜利益又云與修羅共戰常得勝利等皆是金光明之事用也初番述成既爾後之五番可知所召之事既乃如此能召之名準斯可見故答答之中亦重說名也然則六番述成答中明事之文最彰顯者莫過第四述成答中所以復云又以手擎香爐時煙變為香蓋金光不但徧此大千亦徧十方佛土也注云云者略有二意一者令更引下文云於諸佛上虗空之中亦成香蓋金光普照亦復如是又云諸佛聞是妙香見是香葢及金色光於十方界作如是等神力變化又云汝已能坐金剛座處等二者應知此香蓋等乃是事用金光明耳恐不了者直作理解故注云云故次文中便約三世而簡辨之此香葢等即是未來金光明事然文句中釋此之事仍分二義初約因緣解云人王心存至典是故香作金光迴施必得是故天宮相現次約觀心解云以智慧火然實相香起戒定慧煙實相是真法故言金光戒慧與理冥故徹照無礙既云戒慧與理冥故徹照無礙當知乃是智與體冥能起大用即理之事耳又云實相是真法故言金光者是法性可尊可貴寂而常照金法性為金光是即法作譬耳若爾戒慧與理冥故徹照無礙豈非法性大悲能多利益名之為明邪是故文句觀心文云實相真法及戒慧等不出法性甚深無量乃即法也又云故言金光及徹照無礙等不出別題三字名事斯乃作譬也故即法作譬是金理之事不其然乎故妙玄中解蓮華云法理而制事即此意也然此乃是下文第五當體章意今預明之是故云耳須知第四依文立名但是詳究別題三字名之與事所出之文耳不可於此附文釋中便談全理成事之意若不爾者何殊下文第五當體四明不知此意乃解是金光明云是之一字即指法性不從譬喻此文最顯又解四佛放大光明云從法性金光明起又解空品尊經云以理為尊經也今謂此說略有二失一者濫於下文當體如向所示二者依文立名名必召事是故乃指事金光明而為所召此事此名至下第五約當體釋並由法性理體本具此名此事方有今日別題三字事之與名即法作譬良由於此如何不見直作法性理名而解若作法性理名而解是則別題應須改云法性經也何故謂之金光明乎以此觀之別題三字事用之名須明二義一者並由理具事名方有今日別體事名即當體章之正意也二者若將今日事名以擬本理三德等法乃是第三譬喻之意也是故只一事用之名利鈍皆通親疎俱暢俱即法作譬利根親近其義為正以譬擬法鈍根疎遠其意屬傍雖有傍正親疎利鈍一不可廢何得於中妄生去取大辨功德已下標名舉事其例甚多者大辨品云若經中有失文字等又云是說法者廣宣流布是妙經典又云復令眾生得聞是經等功德天品云思惟是經又云聽是經已又云金山照明如來又云金銀七寶等又云若有人能稱金光明又云園名功德華光有最勝園名金幢七寶極妙又云寶華瑠璃佛等此之兩品名事既如此多下去諸品讚佛品云從此世界至金寶蓋山王如來國土又云如來之身金色微妙其明照耀如金山王身淨柔輭如金蓮華淨潔無比如紫金山如融真金光明赫弈等故云其例甚多也。",
        "source": "X20n0359_002:0332b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○若信相下次約三世結判。",
        "translation": "○If this is a mark of faith, then we'll discuss the limitations of the three times.",
        "source": "X20n0359_002:0333c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若信相所夢是現在金光明之事龍尊發願是過去金光明之事香葢徧滿是未來金光明之事。",
        "translation": "If the dream of the marks of faith is a matter of present golden light, the vow of the dragon honored one is a matter of past golden light, and the fragrance of the gandharva is a matter of future golden light.",
        "source": "X20n0359_002:0333c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信相夜夢晝對佛說現在可知龍尊發願是過去者經云過去有王名金龍尊讚歎去來現在諸佛讚歎佛已復作如是無量誓願若我來世無量無邊阿僧祇劫在在生處常於夢中見玅金鼓夜則夢見晝如實說香葢是未來者經云若未來世有諸人王作如是等恭敬正法為自利故以己功德施與我等為我等故燒種種香是妙香氣於一念頃變成香蓋金色晃耀照我等宮乃至如來述成文云是諸人王手擎香爐其香一念徧三千界十方國土等金光明事既通三世金光明名亦復如是何者善集品云過去有佛名曰寶勝般涅槃後有一比丘名曰寶冥能持甚深諸佛行處名金光明敷揚宣暢是金光明豈非過去序品中云是金光明是今佛說豈非現在四王品云若未來世有諸人王至心聽受是妙經典豈非未來。",
        "translation": "If the faithful marks dreamed by night and day tell the Buddha that the present can be known, then the vow made by the Venerable Nāgârjuna is past, the sūtras say that in the past there were kings named Venus Gold, and the Venerable Nāgârjuna praised the buddhas of the past and future and the present, and after praising the Buddha, he also made this immeasurable vow that if I were to come to a world of measureless and unlimited incalculable eons and exist in birth places, I'd always see a jeweled gold drum in a dream, and at night I'd dream and see day, and truly explain that the fragrance is future.",
        "source": "X20n0359_002:0333c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○一部下三結示。",
        "translation": "○One of the following three concluding remarks.",
        "source": "X20n0359_002:0333c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一部名事徧十八品一處起煙十方光葢非但現在亘通三世若名事縱橫高廣無量甚深為若此也。",
        "translation": "\"One part of the name and matter pervades 18 classes, and smoke arises from one place and light from ten directions.",
        "source": "X20n0359_002:0333c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中言縱橫者豎通三世故云縱廣徧十方故云橫縱橫即是高廣無量甚深之義也為若此也者若者如也此者十方三世也四明亦云此事乃是即理之事若爾何故不云即理之名是即法作譬之名即理之事是即法作譬之事而一向作法性解於名之與事豈不違於事上之名別題三字是即法作譬乎。",
        "translation": "The one who says vertically and horizontally erects and penetrates the three times so that it's vertically and broadly pervades the ten directions so that it's vertically and horizontally which is the meaning of high and wide, measureless, and profound, and also if this is the case, then this is the three times in the ten directions, and the four sciences also say that this is the thing that is the principle.",
        "source": "X20n0359_002:0333c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○而不用下第三總結。",
        "translation": "○However, the third summary below doesn't use this label.",
        "source": "X20n0359_002:0334a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而不用此標名義推譬喻無有一文無而疆用有而不遵明識者審之無俟多云。",
        "translation": "He doesn't use this to label names, reasoning that metaphors are nonexistent, or that there's a text that's nonexistent and borderline applicable but not complied with by the consciousnesses who examine it without waiting for many clouds.",
        "source": "X20n0359_002:0334a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而不用此依於經文指事上之名立別題三字而獨約於以譬擬法耶故以譬擬法雖則橫豎該羅但是義推而已而經且無文故云義推譬喻無有一文故十八品無一處文以金光明譬三德等橫豎之義故前第三以譬擬法經本無文但是今家推法性之理究經王之義不能緘默而強用耳況別題三字有經文可準而不遵依邪故依文立名具如前文所引明眼識鑑之人必能審諦之也豈更待於煩多委曲言之然前第三譬法橫豎一往雖是無而強用二往亦與經文符合是故下文引空品云為鈍根故起大悲心經但總說今則具明故有第三譬法橫豎人不見之誠堪愍矣。",
        "translation": "Therefore, even though the parable is based on the sūtras and refers to the names of things, the three words of the special title are only limited to the analogy of the teaching, even though the sūtras are devoid of text and the metaphors are devoid of a single text, there's not a single place in the eighteen categories where the meaning of the parable is derived.",
        "source": "X20n0359_002:0334a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○又諸經下四引例。",
        "translation": "○There are also four examples cited below from the sutras.",
        "source": "X20n0359_002:0334a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸經例多如稻稈斧柯象步城經等說其事指所說事仍即為名又如說稻稈事斧柯事象步事等即名為稻稈斧柯象步經事也。",
        "translation": "There are also many examples of sūtras like the Inagao axe ke elephant step sūtra that refer to things that are explained, which are still called things, such as the inagao thing, the axe ke thing, the elephant step thing, and so on, which are called inagao axe ke elephant step sūtra things.",
        "source": "X20n0359_002:0334a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有二義初例指事為名故云如稻稈等也次例以召事故云又如說稻稈事等即為名也總而言之名是事上之名事是名下之事得斯例已方知今經別題三字金光明是事上之名序品謂之是金光明創首標名彌為可用豈非指事而立名乎指事為名經文既云是金光明當知此名必須召事是故別題三字之名乃召金鼓光明等事也請觀此文引例之意豈非今經別題三字乃是指事而立名乎況前文云以金為名名葢眾寶之上何不思之妄生建立稻稈經者彼經云身子至彌勒所問云今日世尊覩見稻稈而作是說汝等比丘見十二因緣即是見法即是見佛(云云)斧柯經等者如成論中引斧柯經象步喻經城喻經等(云云)象步經者即無所希望經也題下注云一名象步西晉竺法護譯經云佛告文殊經名喻象此喻象經若有眾生信樂斯法舉動進止如象遊步信此法者如大象遊亦如龍步又名象腋經宋朝曇摩密多譯問彼經既云經名喻象信此法者如象遊步顯是以譬擬法何得引例附文耶答附文而立事上之名含於兩向正通當體法理而制事傍通譬喻以事而比法今雖是引例附文何妨經云如象遊步經事也孤山云事字剩也今謂象步經是從事立名故云象步經事也。",
        "translation": "此有二義初例指事為名故云如稻稈等也次例以召事故云又如說稻稈事等即為名也總而言之名是事上之名事是名下之事得斯例已方知今經別題三字金光明是事上之名序品謂之是金光明創首標名彌為可用豈非指事而立名乎指事為名經文既云是金光明當知此名必須召事是故別題三字之名乃召金鼓光明等事也請觀此文引例之意豈非今經別題三字乃是指事而立名乎況前文云以金為名名葢眾寶之上何不思之妄生建立稻稈經者彼經云身子至彌勒所問云今日世尊覩見稻稈而作是說汝等比丘見十二因緣即是見法即是見佛(云云)斧柯經等者如成論中引斧柯經象步喻經城喻經等(云云)象步經者即無所希望經也題下注云一名象步西晉竺法護譯經云佛告文殊經名喻象此喻象經若有眾生信樂斯法舉動進止如象遊步信此法者如大象遊亦如龍步又名象腋經宋朝曇摩密多譯問彼經既云經名喻象信此法者如象遊步顯是以譬擬法何得引例附文耶答附文而立事上之名含於兩向正通當體法理而制事傍通譬喻以事而比法今雖是引例附文何妨經云如象遊步經事也孤山云事字剩也今謂象步經是從事立名故云象步經事也。",
        "source": "X20n0359_002:0334b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○第五當體釋文為二初標。",
        "translation": "○The fifth essential text is explained in two ways: first, it's labeled.",
        "source": "X20n0359_002:0334b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五當體得名者。",
        "translation": "\"The fifth [aspect of] the proper body gets its name.",
        "source": "X20n0359_002:0334c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言當體者一家諸文明於當體必對所依故文句記明方便品體云所言體者為取所依為用當體若取所依乃是即權而實為體若取當體乃是即實而權為體此之二義離則不分混亦不雜故所依體即權而實與夫當體即實而權區以別矣是則實相空中之理為事所依名所依體諸法事用由理本具名當體體當者自也本也諸法事上之名並由實相自體本具故也故下文云第一義諦有實名義即此意也第一義諦既乃具有事用名實是故諸法事用之名本非世俗全由理具所以今經別題三字若附經文則序品云是金光明乃是吾佛創首指於金光明事而標別題三字之名若約當體須知指事標立別題三字之名本是法性自體所具而吾佛聖人仰則真實法性本具事用之名而立俗諦別題之號金光明耳應知實相空中之體亡泯寂滅非相無名故文句云體則實相無有分別又妙玄云名無召物之功物無應名之實葢第一義中無相之意耳釋籤解云法本無名名假無實故云名無召物之功物體性空無應假名之實名實俱無但真諦意耳然第一義真諦本體雖則無名而本具於俗諦之名是故聖人乃準真諦本具俗假之名而立事用之號耳故文句云用則立法差降不同又玅玄云世諦為言無名無以顯法故初論釋名也釋籤解云今論世諦故須辨名是則玄籤談第一義真諦本體所以謂之無名無相今文談於真諦本具事用之名是故謂第一義諦有實名義須知理具是金剛錍體德之假無名無相是金剛錍性體性量即空即中是則性空中恒具諸法假事用諸法假常即性空中理事之融通良在於茲矣而今文中但云真諦有實名義不言真諦無名相者由前文中釋於通別已云理無名字故也是則玄籤雖則但云真諦無名理合更云本具諸名以玄籤中上下諸文盛明理具故於釋名文中且略而不言耳又復解於玅法之中雖則不言理具諸名解蓮華中乃云蓮華當體得名法理制事今文雖則但談真諦本具名實而前文中已說理體本無名字是則玄籤及以今文束而言之只是真諦本體無名而常具於俗假諸名聖人仰則真諦無名而具諸名乃隨世間立於諸法事用之名耳是故當知若乃偏執真諦無名但得真諦之本體耳失於體德之本具也又若偏執理具諸名但得體德之本具耳失於真諦之本體也故今文中斥於古師真諦無名乃立真諦有實名者良由於此人不見之但執今文真諦有名不許真諦本無名相輒便難云若謂真諦無名相者何異古師嗚呼哀哉謬之甚矣何者若乃不許真諦無名前文那云理無名字玄籤那云真諦無名葢是前文理無名字及玄籤云真諦無名亦是古師之說不是今家之義乎文句記云性本無名具足諸名無說而說即成教即此意也是故須知今文中云仰則真法俯立俗號必扶前文理無名字名字名理故前理教與今真俗辯異意同若不爾者文句記中何故謂之性本無名具足諸名無說而說說必成教邪故知前文明教別既是別題三字之名今立俗號亦是別題金光明耳故玄籤云世諦辨名即此意也若不爾者豈前文教別非今文俗號邪是故當知若得斯旨消釋下文如觀掌果不見此意任運失趣何但迷於今文之旨亦乃乖於玄籤之意四明云當謂主當三字之名直名法性故云當體今問若乃直名法性名當體者下文那云即法作譬四明又云前附文釋名事雙附今當體釋即理之名直召法性附文但是指事立名當體乃是召理之名今問別題之名但有三字將何以辨事名理名兩種之殊是故須知當體理具事用之名便是附文指事之名但前直附經文所出今乃明於理體本具故分附文當體之異雖分二途意成一轍故下料簡但將附文以對第三譬法問答良由於此非謂附文事用之名異於當體理具之名也。",
        "translation": "The term \"proper\" refers to a family of civilizations in which the proper essence must be the object of support. Therefore, the textual explanation clarifies that the essence of the expedient section says that the term \"essence\" refers to the taking of the object of support and the use of the proper essence. If the object of support is taken, it means that the right and the real are the body, and if the proper essence is taken, it means that the real and the right are the body.",
        "source": "X20n0359_002:0334c02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○有師云下次釋文為二初正釋次料簡初文為二初明來意文又為二初舉他說。",
        "translation": "○There are scholars who say that the next explanation is divided into two, the first correct explanation, the second summary, and the first two clarifications of the meaning of the text.",
        "source": "X20n0359_002:0335b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有師云真諦無名世諦有名寄名名於無名假俗而談真爾成論云無名相中假名相說。",
        "translation": "Some masters say that the true truth is nameless, the world truth is known, and names are derived from nameless, nominal, and mundane discussions of the truth.",
        "source": "X20n0359_002:0335c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須知此文全同玄籤釋妙法中真諦無名世諦有名及教相中初明大意云佛於無名相中假名相說但是古師不知性體雖本無名而具諸法俗假之名故今下文乃破之耳若不爾者何故今文反於古師真諦無名俗諦有名玄籤用於真諦無名世諦有名又用成論名相中假名相說邪是知性具諸法全由理體亡泯如鏡現像皆因鑑明故輔行云能了妄念無一異相達此無相具一切心三千具足方能照於一多相即性具既由性體亡泯性體若不具於諸實俗假事用何異頗棃不能雨寶是故古師但談真諦本體亡泯無名無相不知性具諸法俗假所以今家下文破之耳非謂今家但談性具諸法俗假而不明於性體性量亡泯寂滅邇來學者罔測厥由唯談性具相相宛然謗於性體亡泯無相是則一家諸文所說實相空中亡泯叵得便成虗設矣。",
        "translation": "It should be noted that this text is entirely the same as the explanation in the Explanation of the Profound Meaning in the Explanation of the Marvelous Dharma that the true truth has no name, the world truth has a name, and the characteristics of the teachings are explained in the first section, which states the general idea that the Buddha explains the characteristics of nominal names in the characteristics of no name. However, ancient masters didn't know that although the nature itself is originally nameless, it has the names of the secular and nominal aspects of all things.",
        "source": "X20n0359_002:0335c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○今反下次明今意文為三初總立。",
        "translation": "Now, in contrast, the next section explains the present meaning, which is composed of three generalizations.",
        "source": "X20n0359_002:0335c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今反此義俗本無名隨真立名。",
        "translation": "The present opposing meaning is that the conventional originally had no name, and the true established a name.",
        "source": "X20n0359_002:0335c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "反者違也不順也古師偏執真諦無名俗諦有名不知真諦雖本無名而具諸名故今反違不順古師乃明世俗元本無名皆是隨於真諦本具而立諸名耳。",
        "translation": "To oppose it is to contradict and disagree with the ancient view that the true truth has no name and the conventional truth has name without knowing that the true truth has names even though it's originally nameless.",
        "source": "X20n0359_002:0335c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下別示。",
        "translation": "○Next, what is it that's being shown separately?",
        "source": "X20n0359_002:0335c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者如劫初廓然萬物無字聖人仰則真法俯立俗號如理能通依真以名道如理尊貴依真以名寶如理能該羅依真以名網如理能起應依真以名響。",
        "translation": "Why is it that at the beginning of the eon, everything was so vast and wordless that the noble man looked up and gave the true teaching and looked down and established a secular name, just as the principle can be shared, relying on the true to name the path, relying on the true to name the treasure, relying on the true to name the net, and relying on the true to name the response, the principle can give rise to the true to name the resonance.",
        "source": "X20n0359_002:0336a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言劫初者成劫之始也廓者空也虗也然空虗者即成劫之始物皆無名謂之空廓耳故下句云萬物無字也非謂空劫名廓然也以空劫中無物故也今論成劫之始雖則有物而無名召故云廓然耳聖人上軌真法本具故云仰則下順世情以名召物故云俯立從如理下乃是歷示仰則真法俯立俗號之事皆言如理者並是仰則真法本具也皆言依真以名者並是俯立俗號也仰則真理本具俗諦能通之名依真本具俯順世情以能通名而立於道能通即是道路故也仰則真理本具俗諦尊貴之名依真本具俯順世情以尊貴名而立於寶尊貴即是珍寶故也仰則真理本具俗諦該羅之名依真本具俯順世情以該羅名而立於網該羅即是網罟故也仰則真理本具俗諦起應之名依真本具俯順世情以起應名而立聲響起應即是響答故也文中雖則歷舉四事正以第二如理尊貴依真名寶以明今經別題三字指事立名乃是聖人仰則真諦理體本具事用金寶尊貴之名俯順世情以尊貴名而立別題俗諦之號金光明耳故前文云有因緣故亦可得說以金為名名葢眾寶之上若爾豈非世諦有名故玄籤云今論世諦故須辨名但須了知世諦之名本是真諦之所具耳所具是假可不信乎是則今經別題三字世諦之名全由真諦理體本具依真本具俯順世情而立之耳即法作譬不其然乎玅玄第七解蓮華云蓮華非譬(非以譬擬法也)當體得名類如劫初萬物無名聖人視理準則作名如蛛羅引絲倣之結網蓬飛獨運依而造車浮槎汎流而立舟鳥迹成文而寫字皆法理而制事耳請視法理制事之言可知今經別題三字乃是法理本具制立事用之名矣何得謂之附文但是附事之名當體乃是召理之名邪四明云真諦有名者即是圓教始終二諦以不思議故但名真諦真諦具德故云真諦有名也俗諦無名者即前三教及諸凡夫所有二諦以可思議故但名為俗此俗虗假無實名義故云俗諦無名也今謂不然何者所言俗本無名隨真立名者葢由俗諦本自無名但隨真諦本具諸名以立俗號乃是圓家情智二諦耳何者隨智真諦體本無名而具俗諦事用之名於是隨情俯立俗諦諸法之名既是正明即真而俗何得將前三教凡夫對圓而明情智二諦以解今文仰則真法俯立俗號邪仰則真法尊貴之名以立別題三字之號豈是前之三教凡夫邪前文明於以譬擬法尚委簡偏小今文即法作譬法理制事那忽屬前三教凡夫邪問四明既云真諦具德今何斥之答四明雖談真論具德不知具德即是玅假既與一家諸文相違故今不取耳四明解於如理能通依真以名道等云聖人見於萬物有淺近義乃則真法深遠之義而立世諦淺近之名如世道路有少能通乃則如理究竟之道名於世間淺近之道也今問若爾乃是俗諦先自有名豈是俗諦本無名邪。",
        "translation": "The beginning of the eon is the beginning of the formation of the eon, and it's also empty, barren, and empty. But empty and barren is the beginning of the formation of the eon when everything is without a name, which is called empty and out of the way. The next sentence says that everything is without words, but it's not called empty and the eon is called out of the way because there are no things in the empty eon. The beginning of the formation of the eon, though, has things without names, so it's called out of the way.",
        "source": "X20n0359_002:0336a04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○華嚴下三引證文為四初引華嚴。",
        "translation": "○Below Huayan, there are three references to the text to confirm the four first references to Huayan.",
        "source": "X20n0359_002:0336c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "華嚴中云耕田轉耒衣裳作井皆聖人所為。",
        "translation": "In Huayan, it's said that plowing fields, turning sarves, making robes, and making wells are all the work of sages.",
        "source": "X20n0359_002:0336c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "耒(盧對切)耜(音似)說文云耒手耕曲木也法華文句云一切世間及出世間所有事業皆菩薩所為文句記云如華嚴云若有世界初成時眾生所須資生具菩薩爾時為工匠終不造作殺生器又釋籤云貨狄造舟(黃帝臣也)維父造臼杵(黃帝臣也)蚩尤造兵(火帝臣也)黃帝造冠冕容成造曆(黃帝臣也)歧伯造醫(黃帝臣也)隷首造數(黃帝臣也)皐陶造獄(虞舜臣也)嵆仲造車伯益造井蒙恬造筆蔡倫造紙古人所造皆法理而立也。",
        "translation": "The s Lei (Lu 对切) and the Plowshares (pronounced like) are like the Shuowen clan's Lei hand plowing the curved wood. The Fahua wenju yun yi yi all worldly and transmundane undertakings are undertaken by bodhisattvas.",
        "source": "X20n0359_002:0336c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次引大經文為二初正引。",
        "translation": "○Next, the text of the sutra is cited in two ways: first, it's correctly cited.",
        "source": "X20n0359_002:0336c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大經云世諦但有名無實義第一義諦有名有實義。",
        "translation": "The great sūtra says that the conventional truth has only name and no real meaning, and the supreme truth has name and real meaning.",
        "source": "X20n0359_002:0336c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世諦有名無實等者俗本無名雖則隨真而立俗號而世俗名但是權設名下之義終非究竟何者如理能通依真名道此道豈能徧通一切以世間道亦有阻絕終歸敗壞是故世諦但有虗名而無實義若真無相本具道名此之名義其實徧通一切無礙故云第一義諦有名有實義也此以性具實名實義而奪隨世假名無實耳道名既爾餘可準知。",
        "translation": "The conventional truth has a name and no real meaning, even though the conventional name is created after the true truth, the conventional name is merely a provisional designation of a meaning beneath the name that is ultimately not the ultimate one.",
        "source": "X20n0359_002:0336c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○以此下次反斥。",
        "translation": "○This is the next rebuke.",
        "source": "X20n0359_002:0337a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此而推真諦有名更何所惑。",
        "translation": "'What's the confusion in inferring that the true truth has a name based on this?'",
        "source": "X20n0359_002:0337a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此大經明文推之真諦本具名之與義更何所惑而可不信乎問大經但云真諦有名何得將有作具說邪答具即是假假即是有故輔行引觀音玄文問既有性德善亦有性德惡不答具有況一家諸文皆指性具名之為有故知大經真諦有名有即是具也。",
        "translation": "Based on this clear statement of the great sūtra, what confusion is there that wouldn't lead to belief that the true truth is inherently possessed of both name and meaning?\" He asked, \"The great sūtra only says that the true truth is possessed, but how can there be a claim that it's possessed?\" He answered that possessed is false, and false is existent.",
        "source": "X20n0359_002:0337a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三引龍樹文亦為二初正引。",
        "translation": "○Three quotations from the text of Nāgârjuna are also two. The first is a correct quotation.",
        "source": "X20n0359_002:0337a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "龍樹四依菩薩隨義理為立名字。",
        "translation": "The four Nāgârjuna texts rely on the bodhisattva's positing names according to their meanings and principles.",
        "source": "X20n0359_002:0337a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止觀引釋論云菩薩依隨經教為作名字名為法施立名無咎今文龍樹字下少一箇云字釋論乃是龍樹菩薩所造故知今文與止觀即人法互舉耳言龍樹者初生之時在於樹下由龍成道故云龍樹龍生法身樹生生身亦云龍猛或云龍是華言樹是梵語譯為猛也佛去世後三百年出壽七百歲(云云)言四依者此有二說一者住前名初依初住至五住名第二依六住七住名第三依八住至十住名第四依二者住前名初依十住名二依十行十向名三依十地等覺名四依此之四依亦是師位亦弟子位(云云)。",
        "translation": "Zhiguan quoted from the Explanation of the Treatise, saying that the bodhisattva relies on the teachings of the following sūtras to create names that are called Dharma-giving and establish names without fault.",
        "source": "X20n0359_002:0337a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○義即下次釋意。",
        "translation": "○The meaning is the meaning of the next explanation.",
        "source": "X20n0359_002:0337a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "義即第一義理即如理也。",
        "translation": "The meaning is the ultimate truth, and the principle is thusness.",
        "source": "X20n0359_002:0337a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言隨義理為立名者即是隨於第一義諦真如實理體本無相而具假名故隨世間立種種號故云義即第一義理即如理也問何以得知龍樹談第一義諦本無諸相邪答輔行引釋論云佛法有二諦世諦有相第一義諦無相何但龍樹談第一義諦無相諸佛菩薩經論皆爾故知真諦本無諸相方能具於俗諦名相具即是假不其然哉故不可見真諦具法便謂理體相相宛然文句記云今家依於智論準理準義緣於心性立此二空應知彼文準理準義即今文云義即第一義理即如理也又復準理緣於心性即真如觀理唯達法性更不餘塗準義緣於心性即唯識歷事四性叵得是故謂之故於實道須閑修性本自二空即是性德是故止觀初性德境乃是理觀唯達法性法性任運具於二空不待歷事一一推檢方悟二空若推撿入空即是修德境唯識歷事推撿四性方達二空故知準理即真如觀準義即是唯識觀也故輔行云今文準經以義開拓委作觀法故於四大各以四性推令如空所以然者以由義推四大等法皆非自他等性故也故知若得義例中云從理唯達法性更不餘塗從事專照起心四性叵得則止觀一部十乘妙觀不出真如唯識二觀所收何者諸文若云但觀法即是法性法界實相即真如觀理也若云四運四性推檢方悟二空法性妙理即唯識歷事也事理二觀具如十不二門圓通記辨(云云)。",
        "translation": "When it comes to following the principle of meaning as a designation, it means that following the truth of the ultimate truth, the true principle is originally without marks and has a nominal name, so it follows the world in establishing various designations.",
        "source": "X20n0359_002:0337a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四引淨名文亦為二初正引。",
        "translation": "○The four references to the text of the Vimalakīrti are also two: the first is a correct reference.",
        "source": "X20n0359_002:0337b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨名云從無住本立一切法。",
        "translation": "The Jingming says that the essence of nonabiding establishes all dharmas.",
        "source": "X20n0359_002:0337c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無明法性俱名無住染淨二緣皆名立法今文既明聖人隨智內證真諦外順機緣俯立俗號當知須以法性為本淨緣而為所立法也。",
        "translation": "Since the nescience and Dharma nature are both called nonabiding and the two conditions of defilement and purity are both called enactments, now that it's clear that sages follow their wisdom to internally realize the true truth and externally follow their opportunities and conditions to stoop to secular designations, you should know that the Dharma nature must be the origin, and the pure condition must be the enactment.",
        "source": "X20n0359_002:0337c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○經論下總結勸信。",
        "translation": "○Lower in the sūtras and śāstras, we conclude by encouraging faith.",
        "source": "X20n0359_002:0337c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經論咸然豈可不信。",
        "translation": "Sūtras and treatises are all the same, so why wouldn't they be faithful?",
        "source": "X20n0359_002:0337c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經謂華嚴大經淨名論謂龍樹釋論咸然者咸皆如是也謂經論中皆是談於俗本無名隨真立名今既學佛豈可不信諸佛菩薩經論誠言。",
        "translation": "The sūtras refer to the Huayan Great Sutra as the Pure Names, and the treatises refer to the Longtree Explanation of the Treatise as being all the same, meaning that the sūtras and treatises all talk about how the secular nature has no name and follows the true in creating names.",
        "source": "X20n0359_002:0337c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次今言下正釋文為二初明經題是即法作譬。",
        "translation": "First, he explains that the title of the sūtra is \"Making Metaphors of the Dharma.",
        "source": "X20n0359_002:0337c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今言法性之可尊可貴名法性為金此法性寂而常照名為光此法性大悲能多利益名為明即是金光明之法門也。",
        "translation": "The Dharma nature that's honored and valuable is called the Dharma nature of gold, the Dharma nature that's quiescent and always shining is called light, and the Dharma nature that's greatly compassionate and able to provide many benefits is called light, which is the Dharma aspect of gold and light.",
        "source": "X20n0359_002:0337c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前云如理尊貴即今文云法性之法可尊可貴前云依真以名寶即今文云名法性為金依真名金既乃如此依真以立光明準知當體得名即實之權法理制事即法作譬既金法性作金光明何得謂之三字別題是單法邪若云單法未審指何而為作譬所言即是金光明之法門者當體立號非從他得金是法性本具之名以此為門能通大道故知別題三字乃是金光明之法門耳故下文引即於是典金光明中而得見我釋迦牟尼即此意也故妙玄云蓮華之稱非是假喻(不是假借以譬擬法也)乃是法華法門清淨因果微妙名此法門為蓮華即法華三昧當體之名也今亦例然法性本具尊貴寂照大悲益物故立別題三字之名為能通門令悟法性本具尊貴寂照大悲益物故云法門耳所言法者法即教法良以無說而已說必成教故也此則通指凡有所說皆名為教若於所說更細論者全法性作金寶尊貴乃是即法而作譬耳。",
        "translation": "The previous statement is that the principle is honored, which means the present statement is that the Dharma nature of the Dharma nature is honored and valuable, which means the present statement is that the Dharma nature is called gold based on the truth, which means the present statement is that the Dharma nature is called gold based on the truth, which is called gold, and which is based on the truth in order to establish the light, which is to know that the essence of the Dharma nature is named as the true right, the Dharma principle controls the situation, which is to make an analogy with the Dharma, and the Dharma nature is called gold light.",
        "source": "X20n0359_002:0337c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○菩薩入此下次明眾聖從法門金光明立名文為二初正明。",
        "translation": "○The bodhisattva enters this next section to explain that the sages follow the golden light of the Dharma-gate in establishing the name.",
        "source": "X20n0359_002:0338a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩入此法門從法為名即是金光明菩薩佛究竟此法門即有金燄光明如來金百光明照藏如來等。",
        "translation": "The bodhisattva who enters this Dharma-gate and follows the Dharma as the name is Golden Light, the bodhisattva and the Buddha who actually enter this Dharma-gate are Golden Flame Radiance Tathāgata, Golden Hundred Light Illuminating Tathāgata, and so forth.",
        "source": "X20n0359_002:0338a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入此法門等者入此入此金光明三字性具之名即實之權即法作譬能通之門乃從即實之權即法作譬而為名號故名金光菩薩耳亦如法華經中華德菩薩亦是從於法華三昧即法作譬當體得名耳菩薩分得佛乃究竟故有金燄光明如來等也人見今文云從法得名不看下文即法作譬便謂別題乃是單法殊不思惟若是單法何謂作譬又不思惟若是單法乃是所依何謂當體又不思惟若是單法將何以被鈍根之人以譬擬法又不思惟若是單法則同法華妙法兩字且彼妙法何曾有於當體之談至解蓮華方論二義若以蓮華喻於妙法豈非今文以譬擬法若乃法理而制於事豈非今文即法作譬彼解蓮華既具二義此釋金寶亦復如是若謂今經別題三字是單法者此與玅玄解於妙法如何辨之故知今文從法為名乃是從於即法作譬而為名耳。",
        "translation": "Entering this gate of the Dharma and so forth, the bodhisattva enters this gate of the Golden Light Bodhisattva, which is the name of the three words that are intrinsically possessed by the nature, which is the true right, which is the method of making metaphors, and which penetrates the gate, and it's from the true right, which is the method of making metaphors, that the name is given.",
        "source": "X20n0359_002:0338a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若爾下次釋疑文為二初疑。",
        "translation": "○If this is the case, then we'll explain the text of the doubt in two ways.",
        "source": "X20n0359_002:0338b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾何故名釋迦。",
        "translation": "\"If this is the case, why is it called Śākyamuni?",
        "source": "X20n0359_002:0338b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若謂諸佛菩薩從於法門金光明為名者何故釋迦不名金光明而名為釋迦邪。",
        "translation": "If it's said that the buddhas and bodhisattvas name themselves from the golden light of the Dharma teaching, why isn't Śākyamuni called Śākyamuni instead of golden light?",
        "source": "X20n0359_002:0338b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○釋迦此有通別下釋疑文為二初正釋。",
        "translation": "○Shākyamuni: There are general and specific terms for Śākyamuni, and the explanation of doubt is divided into two.",
        "source": "X20n0359_002:0338b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦此有通別名從通即名金光明允同諸佛從別即受釋迦之稱耳。",
        "translation": "\"Śākyamuni has a generic and a distinctive name, and from the generic that's the name Golden Light, it's the same as the buddhas who receive the title Śākyamuni from the distinctive.",
        "source": "X20n0359_002:0338b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知釋迦此名從別別必具通故云釋迦此有通別名也從通即是名金光明允合符同金百光明照藏佛等從別不妨受釋迦稱若爾釋迦之別既具於通諸佛之通豈不具別。",
        "translation": "It should be understood that the name Śākyamuni follows the distinctive and the specific must be shared; therefore, it's called Śākyamuni, which has the distinctive name of the general, from the general that's the name Golden Light, Yunhei, and the Golden Hundred Lights, which illuminate the storehouse of buddhas, and from the specific that may be called Śākyamuni.",
        "source": "X20n0359_002:0338b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○故讚佛品下次引證即是證於釋迦別號具於通名允同諸佛也於中為三初引讚佛品證別名具通。",
        "translation": "○So the next citation from the section on praising the Buddha verifies that the distinctive name of Śākyamuni is fully in accord with the generic name, and that's the same as the buddhas.",
        "source": "X20n0359_002:0338b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故讚佛品云如來之身金色微玅其明照耀耀即是光此是讚佛法體非讚世金也當佛法性為金非借世金也。",
        "translation": "Therefore, the section on praising the Buddha says that the Tathāgata's body is golden and subtle, and its light shines brightly, which is light. This is praising the Buddha's Dharma body, not the world's gold.",
        "source": "X20n0359_002:0338b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讚佛品中諸菩薩等既讚別名釋迦之身金色微玅其明照耀故知別名雖是釋迦不妨通名金光明也若不爾者釋迦之身金色微妙其明照耀如何會通此是讚佛法體者佛法身體具於事用金光明也非讚世金者既是法體本具金寶而立事用故非讚於世間之金以世間金但有尊貴之名而無真實之義故也當佛法性為金者當字去聲當佛自證法性之體本具尊貴即法作譬名為金耳非借世金者不假世間之金以譬擬法也故下文云非假世金寄況佛法即此意也若知即法作譬隨真而立世間之金有何不可但大經云世諦有名而無實義故且奪之順於性具所以謂之非讚世金耳究而言之性本無名而具諸名無說而已說必成教如理尊貴依真本其俯順世間以名金寶即隨情智二諦所攝當知佛通別之名皆是隨世假立耳故玅玄云法性之理非古非今非本非迹非實非權但約法性而論本迹權實麤妙耳故知但以世俗文字有去來今非謂菩提有去來今也法身理性之名尚是隨世假立豈理體所具即法作譬而非世諦乎。",
        "translation": "In the Chapter on Praising the Buddha, the bodhisattvas praised the distinct name Śākyamuni's body as golden and subtle, and its brightness shone forth. They therefore knew that even though the distinct name was Śākyamuni, they might as well use the generic name golden radiance. If that wasn't the case, then how could the body of the Buddha's Dharma be praised for its subtle golden color and its brightness shone forth? This is praising the Dharma body of the Buddha, which is endowed with the Dharma body's phenomenal function and golden radiance.",
        "source": "X20n0359_002:0338b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次引三身品及華嚴證。",
        "translation": "○The next quote is from the Samyak-saṃbodhi chapter and the realization of Huayan.",
        "source": "X20n0359_002:0338c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三身品云與諸佛同體與諸佛同意與諸佛同事同體者是同法性金也同意者同法性光也同事者同法性明也故華嚴云一切諸如來同共一法身一身一智慧力無畏亦然一身即是同金智慧即是同光力無畏即是同明於一法體三義具足非假世金寄況佛法。",
        "translation": "The Chapter on the Three Bodies says that being in the same body as the buddhas and agreeing with them is the same as the gold of the Dharma nature, and agreeing with them is the same as the light of the Dharma nature, and working with them is the same as the luminosity of the Dharma nature. Therefore, Huayan says that all tathāgatas share the same single Dharma body, one body, one wisdom, one power, and fearlessness, too, and that one body is the same as gold, wisdom is the same as light, and power and fearlessness are the same as luminosity.",
        "source": "X20n0359_002:0338c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別必具通允同諸佛法性之理具金光明佛佛皆同故云同體是同法性金光明也故引華嚴證成同體具金光明次從一身即是已下乃是釋於華嚴經意以明同體金光明耳於一法體三義具足者法體雖一何妨具於金等三義舉一即三良由於此故此非具假借世金寄況比喻佛法性體也。",
        "translation": "The principle that the distinctive qualities must be shared with the Dharma nature of all buddhas is complete with gold light, and all buddhas are the same, so it's said that the same essence is the same Dharma nature with gold light.",
        "source": "X20n0359_002:0338c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三引樹神云證別題。",
        "translation": "○3. He invokes the tree spirit's cloud to realize the separate title.",
        "source": "X20n0359_002:0339a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故樹神云無量大悲宣說如是玅寶經典當體並是妙寶此寶具足光明非借世金以譬法也。",
        "translation": "That's why the tree god said, \"Measureless great compassion proclaims that this is a precious scripture that contains the essence of a wonderful treasure, which is fully luminous and not borrowed from worldly gold to simulate the Dharma.",
        "source": "X20n0359_002:0339a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是即法作譬樹神讚云釋迦牟尼為欲利益諸眾生故宣說如是妙寶經典言玅寶者以金乃是眾寶之上故云妙寶也玅寶具足光明即別題三字也經典兩字即通號也是則妙寶經典四字乃是首題金光明經通別俱舉耳既隨法性當體本具而立世諦金光明教故知但是即法作譬不是以譬擬法故云當體並是妙寶此寶具足光明非借世金以譬擬法也。",
        "translation": "The tree spirit praises Śākyamuni for wanting to benefit all sentient beings and therefore proclaiming such a sūtra of marvelous treasures.",
        "source": "X20n0359_002:0339a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次料簡文為二初問。",
        "translation": "○Second, we'll consider the text in two ways. First, we'll ask a question.",
        "source": "X20n0359_002:0339a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問舊云此經從譬得名云何矯異而依文耶。",
        "translation": "The old question was, \"Did this sūtra get its name from an analogy?\" Why did it correct the difference and rely on the text?",
        "source": "X20n0359_002:0339a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意者前文既標云今釋名為五而第三科謂之譬喻今文乃指舊云此經從譬得名者此有二義一者古今同用譬法舊人譬法不周所以今家破之耳非謂斥於古人不得以譬擬法故今乃指舊云此經從譬得名不妨今家釋名五科之中第三謂之譬喻也二者古今雖同用譬而古人以譬擬法尚自不周何由能解附文當體即法作譬故今乃指舊云此經從譬得名以對今家附文為問是故謂之云何矯異而依文邪非謂今家獨約附文當體兩釋棄於第三以譬擬法也矯者詐也異者不同也不同於古但用譬法而自依文立名者何邪當體一釋但明附文指事之名金是法性理體本具俯順世間假立之金耳故但對於附文為問自然攝得當體之說故下答中仍分二意初約附文對譬法為答次約當體對譬法而明又復應知問中雖指舊云此經從譬得名以對今家附文為問至下答中乃兼今家以譬擬法而對附文當體為答故下文云義推疎遠引空品云為鈍根故起大悲心即此意也是則彌顯以譬擬法古今咸用但是古人譬法不周為今家所破耳。",
        "translation": "The first one is that even though the ancient and modern worlds both use metaphors, the old man's metaphors were incomplete, which is why the modern world refutes them. It doesn't mean that the ancient man was not allowed to use metaphors to draw Dharma; therefore, the present refers to the old saying that this sūtra got its name from metaphors, so it might as well be the third of the five sections of the present interpretation's name, which is called metaphors.",
        "source": "X20n0359_002:0339a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次答文為二初約附文對以譬擬法答又為二初正答。",
        "translation": "○There are two answers in the text of the next section. First, there are two answers in the textual and metaphorical categories.",
        "source": "X20n0359_002:0339b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答非今就文而害於譬若苟執譬復害於文義有二途應須兩存。",
        "translation": "Answer: \"It's not that we are now focusing on the text to the detriment of the parables. If we continue to stick to the parables and harm the text, there are two ways to get at the meaning.",
        "source": "X20n0359_002:0339b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非謂今家就於經文立附文釋而傷害於以譬擬法若乃苟且唯獨執於以譬擬法又復傷害附於經文指事為名詳其所以合有二途途者道也是故當知以譬擬法及以附文應須兩存不可局定偏執一邊四明前云大師順古同他用譬其如經題非譬是法故後文中自立附文當體二釋至今文中又乃解云今釋經題存於二意是故二途不偏廢一汝專執譬則棄親逐疎我今雙存則親疎俱得今謂此說矛盾難解何者前云順古同他用譬其如經題是法非譬至今何故却云今釋經題存於二意邪既云經題非譬是法此則定作單法而解至今何故又云二途不偏廢一邪既云二途不偏廢一那忽定云是法非譬邪文中明說非今就文而害於譬那忽執於附文當體捨前譬法邪後學昏蒙望聲傳習但聞四明之說便謂亞聖之談不能擇善誠可悲哉。",
        "translation": "It doesn't mean that the present advocates are harming the analogy by interpreting the appended text in terms of the sūtras, but if they are lazy and only adhere to the analogy and harm the appended text by referring to things as names, then they should know that the analogy and the appended text should be kept in two ways, not limited to one side or the other.",
        "source": "X20n0359_002:0339b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○故前云下次引前文以證親疎義有二途。",
        "translation": "○That's why the preceding statement next cites the preceding text to prove that there are two paths to the meaning of relative and distant.",
        "source": "X20n0359_002:0339c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故前云義推疎遠依文親近。",
        "translation": "Therefore, the preceding statement deduces that the meaning is distant and relies on the text to be intimate.",
        "source": "X20n0359_002:0339c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖則兩存於中非無親疎之相是故第三以譬擬法義推疎遠第四依文顯然親近復須更云雖有親疎一不可廢若偏廢一乃是就文害譬執譬害文也故前文標云今釋名名為五於茲明矣。",
        "translation": "Although the two exist, there's no aspect of affinity and distancing between them.",
        "source": "X20n0359_002:0339c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若鈍根下次約當體對以譬擬法答文為三初正答。",
        "translation": "○If dull-rooted people next use metaphors to compare qualities, the answer is threefold.",
        "source": "X20n0359_002:0339c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若鈍根人以譬擬法若利根人即法作譬。",
        "translation": "\"If a person with dull faculties uses an example to draw up a teaching, then if a person with sharp faculties makes an example of the teaching, then he'll use it.",
        "source": "X20n0359_002:0339c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若鈍根人以譬擬法即前第三以金光明譬於橫竪一切法門若利根人即法作譬乃是前文第五當體即真諦法本具俗諦事用之名而作三字金光明譬良以別題三字只是事用之名若鈍根人乃以此譬擬於橫竪一切諸法若利根人乃知即法而作此譬三字之名故前但云以金為名不乖今文利鈍之意是故只一別題三字不妨利鈍兩根解之所以文中皆言若也以此明之豈非別題三字只是單譬所攝乎人不見之纔聞此經別題三字是單譬收輒便難云何異古師嗚呼哀哉昧之甚矣古師以譬擬法尚自不周豈知即法而作譬乎四明云利根之人知其能譬世金光明乃是聖人仰則真法而作其名故云利根即法行譬今問若爾既即真法作金光明乃是利根即法作譬豈非別題是單譬乎若云別題是單法者應須改云即法作法況復若定金等是法將何以被鈍根之人以譬擬法邪今定別題三字是譬若鈍根人乃以此譬橫竪等法若利根人乃知即法而作此譬文順理顯炳然易見世人何事固執迷方。",
        "translation": "If a person with dull faculties uses an analogy to draw up a teaching, that is, the third analogy of using golden light to draw up a teaching for both horizontal and vertical dharmas, and if a person with sharp faculties makes an analogy of the teaching, then the fifth in the preceding sentence is to draw up a three-letter golden-light analogy that's the name of the conventional truth and the name of the phenomenal function of the true truth, and it's a good idea to make a three-letter golden-light analogy because the three separately titled words are just the names of the phenomenal function.",
        "source": "X20n0359_002:0339c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○下文云下次引證。",
        "translation": "○The following passage says that the next time we'll cite this as proof.",
        "source": "X20n0359_002:0340a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下文云如深法性安住其中即於是典金光明中而得見我釋迦牟尼又空品云為鈍根故起大悲心。",
        "translation": "The following passage says, \"Such is the profound nature of dharmas in which one abides, which is the golden radiance of this scripture in which one sees me, Śākyamuni, and the class on emptiness, which says that it's for the dull faculties that one gives rise to the mind of great compassion.",
        "source": "X20n0359_002:0340a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今既釋題故指經文為下文也即下文中鬼神品云也如深法性安住其中即於是典金光明中而得見我釋迦牟尼此證利根即法作譬也釋迦之號雖則從別今取別必具通以明作譬之說故前文引讚佛品云如來之身金色微妙其明照耀□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□於橫竪一切諸法故也又復準於文句消經其意雖□□從借用證成而說焉知鈍根以譬擬法不是空品為鈍根故起大悲心邪佛意兼通隨類各解故引空品為鈍之文證今鈍根以譬擬法義亦何爽又第二卷四王品云譬如寶樹在人家中悉能出生一切珍寶是玅經典亦復如是悉能出生諸王功德亦可證今以譬擬法而欲難云經文不云如金光明其可得乎又縱不云如金光明以定別題是法非譬者若即法性作金光明文中顯云即法作譬何可定云是單法邪四明不曉當體章云從法為名乃是從法而作於譬茲訛說耳四明解今鈍根文云此經所被非純利根故空品云為鈍根故起大悲又云佛說茲典既被二根故通經者釋三字題亦須兩說赴其利鈍今問若爾何得謂之順古立譬若云所被非純利根何得定云非譬是法既云佛說茲典被於二根何得鈍根以譬擬法是順古邪順古用譬何關佛說被於鈍根況空品云為鈍根故起大悲心豈亦順古名鈍根邪既通經者釋三字題亦順兩說赴其利鈍何得謂之今家自立附文當體捨譬從法若但自立附文當體將何兩說赴其利鈍若赴利鈍須存兩說驗知以譬擬於橫竪一切諸法定非順古矣願諸上德審而思之。",
        "translation": "Now, since we've explained the title, we're referring to the following text of the sūtra, which is the following section on demons and spirits, which says, \"Such is the profound Dharma nature that abides in it, which is the canonical golden light in which I, Śākyamuni, can be seen.\" This proves that even though the name Śākyamuni is given from a specific perspective, the specific perspective must be shared in order to clarify the explanation of making an example, so the previous section quotes the section on praising the Buddha, which says, \"The Tathāgata's body is golden and subtle, and its light shines brightly.",
        "source": "X20n0359_002:0340a12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○鈍人守指下三舉喻。",
        "translation": "○A dull person guarding his fingers follows the three metaphors listed below.",
        "source": "X20n0359_002:0340b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鈍人守指守株寧知兔月利人懸解不須株指(云云)。",
        "translation": "A dull person guarding the finger and guarding the stump would rather know that the rabbit moon is suspenseful and a sharp person doesn't need a stump for understanding (cloud).",
        "source": "X20n0359_002:0340b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "指月如圓覺經云修多羅教如標月指株兔如輔行引宋有耕者於野有兔觸株而死後遂廢耕恒守此株冀復有兔傍人喻之而不肯止故俗相傳以執迷者謂之守株守株既爾守指例然指本示月而不看月但守於指故但守指則不見月以例守株不見於兔亦復如是故今斥於鈍根苟執以譬擬法如守株指不及利根能解即法而作於譬是故謂之寧知兔月寧者豈也利根超悟即法作譬故云懸解不煩以譬而擬於法是故謂之不須株指註云云者利根懸解即法作譬雖則不須以譬擬法不可將此害於鈍根以譬擬法何者附文對於以譬擬法既乃兩存當體對於以譬擬法亦須俱立恐人不曉雙存之意故注云云耳故妙玄云利根即名解理不假譬喻即今文云利人懸解不須株指也所言利根即名解理者即於事用之名懸解理具即法作譬耳故妙玄云法理而制事也今文既云利人懸解不須株指玅玄又云利根即名解理不假譬喻故知此中一番料簡不可謂之他人擅添也問玅玄中明上根但作法蓮華解中下未悟須假草華故有三周說法逗上中下根今文但分根鈍之異豈有三周上中下別答例亦須有何者文句中引新舊兩文三處明宗上根人聞四佛拂疑既長遠本難窮極中根人聞王子明蚊蚋脚可以作城樓鼠登兔角梯蝕月除修羅法身無舍利下根人聞釋迦論三身共說廣分別之此即三周說法逗上中下根之明文也。",
        "translation": "Pointing to the moon as the Sutra of Perfect Enlightenment says, \"The sūtra teaches that the sūtra is like pointing to the moon, pointing to the plant and the rabbit as an auxiliary practice.\" The Song dynasty has a plowman in the wilderness who has a rabbit that touches the plant and dies, and then he abandons his plowing and always guards the plant, hoping for another rabbit that's near someone else's metaphor and refuses to stop.",
        "source": "X20n0359_002:0340b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次觀心釋名者此觀心文及前料簡并後重明帝王之義昔錢唐諸師皆謂後人擅添非大師親說而四明救之往復數回(云云)今謂觀心存則有益不徒數寶是故玅玄法華文句皆先約教次明觀行今經文句既存觀心豈可玄義但有約教孤山云吾觀其辭繁而寡要質而少文苟留心於翰者讀之則知其言非向者之言筆非向者之筆則真偽可辨矣豈待潛心佛學然後能斷其是非乎今謂不然何者若謂此文繁而寡要蓋亦責前正釋料簡十種三法廣而無味若謂此文質而少文則諸文觀行亦可責之如觀心論等比之今文而彼之辭又成太質矣且法華文句云箇是畢竟空等豈可責其文藻耶今準四明乃存觀釋但分科解義不無同異也於中為二初標。",
        "translation": "○Subsequent to the explanation of the name of the mind, the text of Avalokitêśvara and the preceding material are brief and followed by a reiteration of the emperor's meaning. In the past, the Qian and Tang scholars all said that the latter was an unauthorized addition that was not taught by the great master himself, and the four sciences saved them by going back and forth several times (cloud).",
        "source": "X20n0359_002:0340c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心釋名者。",
        "translation": "The first is the interpretation of the name of the mind.",
        "source": "X20n0359_002:0341a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然前釋名通別等五翻譯只是變梵成華於言中別題三字初約鈍根譬法而釋次附經文指事立名後約利根即法作譬今觀心釋通攝於前何者觀心釋名論金光明豈非是別別必有通以此擬於一切法門豈非譬法原此三字出自經文豈非附文即此事名隨真而立豈非當體通論雖爾而下文中但準前約十種三法論金光明而辨觀心釋名之相以金光明譬法既爾即法作譬思之可知又前先明逆順生起正釋料簡但從三德以至三道今論觀心乃從三道以至三德所以然者前從三德逆而推之以至三道葢約施教推果由因今論觀心始從三道順而推之以至三德葢約自行研因克果故今觀心約於十法論金光明次第與前逆順須辨四明但約觀心論於當體釋名今準十種三法之文元屬於前以譬擬法故今觀心不可違之若謂不然何故文中指上十種三法而論觀心釋名邪復次須知今文觀心自分二意若乃直託別題三字事用之名而論觀心即託事觀此如下文總論觀心釋金光明心即是金心即是光心即是明即其意也次文別約十種三法而論觀心即附法觀釋金光明於附法中三道三識及三大乘既推四運四性叵得豈非占察唯識歷事若觀三佛性乃至三德等豈非占察真如觀理唯達法性更不餘塗況下文中觀三涅槃顯云心性本來寂滅不染不淨一文既然餘六準說以義例中但約推撿及不推撿區分事理二觀之相故茲云爾。",
        "translation": "However, in the previous explanation of the name, the five translations only changed the Brahmā into a flower, and the three words were separately inscribed in the explanation. First, it was explained by referring to the dull faculties as an example of the Dharma, second, it was attached to the sūtras to refer to phenomena and establish names, and finally, it was explained by referring to the sharp faculties as an example of the Dharma.",
        "source": "X20n0359_002:0341a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何故下釋文為二初正釋次斥謬初文為二初明來意又為二初徵起。",
        "translation": "○Second, why are the following two explanations of the text? First, there are two explanations, followed by a rebuke.",
        "source": "X20n0359_002:0341b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故須是。",
        "translation": "\"Why does it have to be like this?",
        "source": "X20n0359_002:0341b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前已廣約五科釋名何故須用是觀心乎玅玄亦云事解已足何煩觀心即今意也況下答中亦與妙玄大意是同今不暇引既同妙玄豈可斥為後人檀添。",
        "translation": "The previous explanation of the five categories in detail explains why it's necessary to use this contemplation mind, which is also the present meaning of Śubha Xuan's explanation that the understanding of substances is sufficient, so why bother to contemplate the mind?",
        "source": "X20n0359_002:0341b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次上來下答釋文為二初正答。",
        "translation": "○Second, the next section of the explanation consists of two main answers.",
        "source": "X20n0359_002:0341b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上來所說專是聖人聖寶非己智分鸚鵡學語似客作數錢不能開發自身寶藏今欲論道前凡夫地之珍寶即聞而脩故明觀心釋也。",
        "translation": "What was explained above was exclusively the holy treasures of sages, not their own intellectual assets.",
        "source": "X20n0359_002:0341b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上來所說五科釋名約教開解但是論於聖人珍寶非是自己珍寶智分如鸚鵡等者前五科釋名說聖人之事何益於己其猶鸚鵡雖學人語不名為人故禮記曲禮篇云鸚鵡能言不離飛鳥猩猩能言不離禽獸今人而無禮不亦禽獸乎似客作等者似亦如也華嚴經云譬如貧窮人日夜數他寶自無半錢分於法不修行多聞亦如是貧窮為他數錢即客作也不能開發自身寶藏即是自無半錢分也今欲論於道前凡夫珍寶故即向所聞五科釋名而論修相故須明於觀心釋名也故玅玄云觀心即聞即行起精進心釋籤云隨聞一句攝事成理不待觀境方名修觀無事間雜故云精進故妙玄云隨諸事釋一一向心為觀觀慧彌成於事無乖如火益薪事理無失即文字無文字不捨文字而別作觀也昔人謂事法二觀不許人修豈非違戾乎。",
        "translation": "The five interpretations of the names of the subjects mentioned above explain the teaching in detail and unpack it, but they're talking about the treasures of sages, not their own treasures or the wisdom portion of such treasures as parrots.",
        "source": "X20n0359_002:0341c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○淨名下次引證。",
        "translation": "○The Jingming next cites the realization.",
        "source": "X20n0359_002:0341c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨名曰諸佛解脫當於眾生心行中求釋論云有聞有智慧是所說應受即此意也。",
        "translation": "Jingming said that the liberation of the buddhas should be sought in the minds and actions of sentient beings, which is what the Śākyamuni said should be accepted when there's wisdom in what's heard.",
        "source": "X20n0359_002:0341c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛解脫者聖人珍寶也當於眾生心行中求者佛法非遠全是我心故觀我心開發自身本有寶藏即是求於佛法解脫故佛解脫須於眾生心中求之釋論等者輔行引大論云有慧無多聞亦不知實相譬如大暗中有目無所見多聞無智慧亦不知實相譬如大明中有燈而無照無聞無智慧譬如人牛如安息國邊地生人雖生中國不可教化根不具支不完不識義理著邪見等皆名人身牛也有聞有智慧是所說應受名字位人是有聞也觀行位人是有智慧也故觀行即乃是第四句也若直聞真此聞非即若直暗證尚未及於有慧無聞當知暗證恐是第三句無聞無慧如人身牛耳。",
        "translation": "The liberation of the buddhas is a treasure of sages that should be sought in the lineage of the minds of sentient beings. The Buddha's teaching is not remote from my mind; therefore, observing my mind and developing the treasures I originally had is seeking the liberation of the Buddha's teaching.",
        "source": "X20n0359_002:0341c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次正明觀心文為二初總約觀心釋名又為二初問。",
        "translation": "○Second, the text correctly explains that there are two ways to contemplate the mind.",
        "source": "X20n0359_002:0342a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問心有四陰何以棄三觀一。",
        "translation": "The first question asks why the mind has four aggregates and why it discards three and contemplates one.",
        "source": "X20n0359_002:0342a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意者前文標云觀心釋名次文又云即聞即修故明觀心心即是識屬第五陰今問五陰不出色心一陰屬色餘四屬心心有四陰何以上來棄於受想行等三心而但觀於識陰心邪孤山不曉此問來由乃云今家三種觀法唯約行觀則有簡境事法二觀全不觀陰故無簡境四明破之引文句記釋耆山觀亦應辨於方便正修簡境及心具如止觀託事既爾附法例然況記文云又諸觀境不出五陰何得謂之事法二觀全不觀陰無簡境邪又妙玄云一心成觀轉教餘心豈非一心即是識陰觀成方能轉教受等三心故事法觀觀陰簡境文義昭然又妙玄中若不觀陰及簡境者何故觀心引釋論證一陰是色四陰是名此與今文心有四陰不亦同邪一心成觀轉教餘心此與今文棄三觀一若為有異是知一家明三種觀皆論簡境而觀識陰矣。",
        "translation": "The first text labels it as observing the mind and explaining its name, and the second text says that it's heard and practiced; therefore, it's clear that observing the mind, which is consciousness, belongs to the fifth aggregate.",
        "source": "X20n0359_002:0342a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次答文為二初正答又為二初明觀心。",
        "translation": "○Second, the text of the answer is divided into two. First, the correct answer is divided into two.",
        "source": "X20n0359_002:0342b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答夫天下萬物唯人為貴七尺形骸唯頭為貴頭有七孔目為貴目雖貴不如靈智為貴。",
        "translation": "A. Of all the things in the world, only people are valued, and seven-foot bodies are valued only by the head.",
        "source": "X20n0359_002:0342b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是金心雖有四心王尊貴是故棄三但觀識陰即是金也從初答下至唯人為貴即去丈就尺之意以由人身具於五陰故也從七尺下至四陰心為貴即去尺就寸之意也於中復有二意初從七尺至靈智為貴即簡色存心也。",
        "translation": "Although the mind of gold has four mind kings that are noble, therefore he discards the three but observes the aggregate of consciousness, which is gold. From the first answer down to the point where only people are noble, that's the idea of removing feet and focusing on the foot because the person has all five aggregates.",
        "source": "X20n0359_002:0342b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次從當知下至心為貴即簡心所而取心王也。",
        "translation": "○Second, from that which should be known down to the mind as valuable, that is, to simplify what's in the mind and grasp the mind as king.",
        "source": "X20n0359_002:0342b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知四陰心為貴貴故所以觀之心貴故心即是金。",
        "translation": "You should know that the mind of the four aggregates is valuable, and it's because of this contemplation that the mind is valuable that the mind is gold.",
        "source": "X20n0359_002:0342b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問中雖則略問棄三觀一答中何妨具明去丈就尺去尺就寸故輔行云從廣至狹正示境體陰界入三並可為境寬漫難示故促指的略二就陰如去丈就尺略四從識如去尺就寸以由界入所攝寬多此如今文天下萬物也五陰既乃具於色心故置色存心心名復含心及心所今且觀心王置於所故初觀識心釋名為金也故前文云以金為名又云唯名為貴即此意也大意雖爾今更消文萬物唯人為貴者尚書泰誓篇云惟天地萬物父母惟人萬物之靈孔安國傳云生之謂父母靈神也天地所生惟人為貴七尺形骸(戶皆切骨也)者如俱舍云瞻部州人量三肘牛四肘唯頭為貴者雖有六分頭最在上是故為貴故大論云一身之中頭貴足賤頭有七孔者兩目兩耳雙鼻面門也雖有七孔目為神候是故為貴孟子云存乎人者莫良於眸子(眸目瞳子也)眸子不能奄其惡胸中正則眸子瞭(音了明也)焉胸中不正則眸子眊(莫報切少精也)焉靈智者心也目為神候外不及內是故內心靈智為貴荀子云相形不如論心此之謂也心名復兼故四陰中三為心所不及心王自在最貴故云四陰心為貴也貴故所以觀之者心王雖貴若不觀之則不能顯本有之寶荀子云論心不如擇術亦此意也心貴故心即是金者利根觀明即見自心法性無名本具諸名而作此金鈍根反此思之可知。",
        "translation": "Although the question is brief, it's abandoned in three ways, and in the answer it's not clear why it's stated that the mind king's name is gold when he goes from square feet to feet and from feet to inches, so the auxiliary practice cloud goes from broad to narrow and shows the object, the aggregates, the sense field, and the three simultaneously can show the breadth and difficulty of the object, so it's brief when it's pointed out that the two aggregates are as broad as the feet, and the four consciousnesses are as broad as the inches when they go from square feet to feet because the sense field is as broad as the many things in the world in this present context.",
        "source": "X20n0359_002:0342b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○夫螢火下次明觀心是光明文為二初正明又為二初釋光。",
        "translation": "○The firefly next time he clearly observes that the mind is light, the text is divided into two, the first correctly explains, and the second explains light.",
        "source": "X20n0359_002:0342c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫螢火自照燈燭珠火雖復照他光不及遠星月之光與暗共住日光能照天下不能照理心智之光能發智照理故心是光。",
        "translation": "Although a firefly shines on its own, a candle or a pearl shines on others, the light doesn't reach as far as the light of the stars and moon, which live together with darkness.",
        "source": "X20n0359_002:0342c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從劣至勝次第校量唯取心貴之智以為光也星月之光與暗共住者法華文句亦云月光與暗共住以星月之夜非全明全暗則是明暗共住也。",
        "translation": "From inferior to superior, it's measured in order by only taking the mind's noble wisdom to be light. The light of the stars and moon co-abiding with darkness is also called the moon's light co-abiding with darkness in the Fahua text sentence because when the stars and moon are not all light and all darkness, then light and darkness co-abide.",
        "source": "X20n0359_002:0342c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若心下次釋明。",
        "translation": "○If the mind is next explained in the explanation, then it's clear.",
        "source": "X20n0359_002:0342c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若心癡暗體則憔悴心有智光膚色充澤故大品云般若大故色大般若淨故色淨亦能充益受想行等心則明也。",
        "translation": "If the mind is deluded and dark, the body is emaciated, and the mind has the light of wisdom, the skin is lustrous, and so the great teaching says that because wisdom is great, form is great, and because wisdom is pure, form is pure.",
        "source": "X20n0359_002:0342c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智光照理故屬於內明多利益故屬於外初先辨於內心愚暗是故外相形則憔悴憔悴羸瘦則無明益次辨內有智光照理是故外見膚色充澤美色豐潤則是明益膚色者皮膚美也充者滿也澤者潤也次引大品般若大淨證於內心有智光也色大色淨證於外相膚色充澤也亦能充益受想行等者非但明益外色亦乃明益心所明兼內外益及色心是故云也。",
        "translation": "First, it's identified that the internal mind is ignorant and dark, so the external form is emaciated and haggard, and when it's emaciated and thin, there's no benefit of insight.",
        "source": "X20n0359_002:0343a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○又知心下次重示。",
        "translation": "○And knowing mind is shown again next.",
        "source": "X20n0359_002:0343a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知心無心名為光知想無想知行無行名為明又知四陰非四陰名為光知色陰非色陰名為明又知五陰非五陰名為光知假人非假人名為明又知正報非正報名為光知依報非依報名為明又知依正非依正名為光知一切法無一切法名為明。",
        "translation": "He also knows that mind and absence of mind is called light, knowing that perception and absence of perception and knowing that volition and absence of volition are called insight, knowing that the four aggregates and not the four aggregates are called light, knowing that the form aggregates and not the form aggregates are called insight, knowing that the five aggregates and not the five aggregates are called light, knowing that a nominal person and not a nominal person are called insight, knowing that right reward and not right reward are called light, knowing that the basis and not the basis of reward are called insight, knowing that the basis and not the basis of right is called light, and knowing that all things and not all things are called insight.",
        "source": "X20n0359_002:0343a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何故重示言無心等為光明邪答初釋光明皆約於有故云心智之光發智照理心有智光膚色充澤今恐滯於有是故蕩之言無心等也問若爾何故但云知心無心等以顯光明而不蕩有以顯於金邪答準例合有但前料簡三身文中已明至寶以無貪為金故茲略耳至寶既以無貪為金故知心無心等名為光明也知心無心名為光者翻前心有智光也知想行無想行者文中略一受字故上文云亦能充益受想行等今既翻此故不可闕但是文略耳又知四陰非四陰名為光者前云心智之光且別語識陰今通論心王心所故知四陰非四陰名為光也知色陰非色陰名為明者前云膚色充澤故今翻此乃云色非色名為明也又知五陰非五陰名為光明者前約去丈就尺去尺就寸從廣之狹但論觀心以釋金名金體必具光明之用故以心智為光色淨為明又以無貪為金知心無心知四陰非四陰等為光明今文又云知五陰非五陰等為光明者以前文云天下萬物唯人為貴乃至目雖貴不如靈智為貴既皆可貴亦皆可觀既皆可觀亦皆是金亦皆是光亦皆是明故輔行云陰界入三並可為境又云三科開合之異欲以識界而為觀初有何不可又如止觀破徧文末亦更例觀餘陰界入輔行謂之欲融諸法示觀境徧非但心攝一切亦乃一切攝心前既從廣之狹今乃從狹之廣故歷五陰假名依正非依非正及一切法名為光明光明既爾金體可知良以無貪即是不著假名實法依等法故也故前文中萬物之言該收依正及一切法前文既云唯人為貴豈不可觀若不可觀何故謂之觀身實相邪天下萬物若不可觀何故謂之託彼依正即空假中故不可以從廣之狹而難從狹之廣徧歷五陰假名等也攬五陰之法成假名之人假實既是正報豈無依報故今文中對翻前文假實依正及一切法是故文中皆云非也然此文中歷觀五陰假名等法非必便同止觀義例內心若淨觀成歷法任運泯合何者彼明觀成歷法泯合今明發軫歷法用觀如止觀中破徧文末例餘四陰及界入等豈是觀成例餘界入邪四明雖則救此觀心及至消釋此一段文殊為疎遠故今不取學者知之。",
        "translation": "Q. Why is it that the explanation of light is reintroduced as saying that absence of mind and so forth is light? A. The initial explanation of light is that it's all limited to existence, so it's called the light of mind-knowledge that arouses wisdom and illuminates principle, and the mind has wisdom and its skin is lustrous.",
        "source": "X20n0359_002:0343a15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○次得此下總結。",
        "translation": "○Second, we'll summarize under \"Attaining this,",
        "source": "X20n0359_002:0343c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得此意者即觀心金光明也。",
        "translation": "This is the idea of attaining this, which is to contemplate the mind's golden radiance.",
        "source": "X20n0359_002:0343c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖則觀心何妨例餘假實依正雖則例餘假實依正何妨結成觀心釋名故總結云得此意者即觀心金光明也。",
        "translation": "Although it's true that contemplating the mind, what's the harm in citing other nominal and real supports as correct? Although it's true that citing other nominal and real supports as correct, what's the harm in forming an explanation of the name of contemplating the mind? Therefore, we summarize by saying that those who have attained this intention are those who are observing the mind's golden light.",
        "source": "X20n0359_002:0343c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金光明經玄義順正記卷中",
        "translation": "Jin guangming jing xuanyi shunzheng ji roll zhong",
        "source": "X20n0359_002:0343c12_0",
        "is_bad_quality": false
    }
]