[
    {
        "source_sentence": "金光明經玄義順正記卷下",
        "translation": "Jin guangming jing xuanyi shunzheng ji, vol. 2",
        "source": "X20n0359_003:0343c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "永嘉沙門釋　從義　撰",
        "translation": "By Yongjia śramaṇa Shi Zongyi",
        "source": "X20n0359_003:0343c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次別約十種三法觀心釋名文為二初總舉上文次別示觀行文為十初觀三道釋名文為二初正明觀法又為二初正示又為二初觀王數為三道釋名次觀假實等為三道釋名以三道之義多途故且約兩意而對耳若不先約王數對三道何謂觀心釋名邪四明約於正助而分此之兩文今所不取初觀王數文自為二初正觀。",
        "translation": "○Subsequent to the explanation of the ten distinct types of the three dharmas, the text of the explanation of the mind's name is twofold. First, the above text is summarized; second, the text of the explanation of the practice of contemplation is tenfold.",
        "source": "X20n0359_003:0343c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上約十種三法論金光明今觀心王即觀苦道觀慧數即煩惱道觀諸數是業道。",
        "translation": "The above discussion of the ten kinds of three dharmas is called golden light. Now, to contemplate the mind as king is to contemplate the path of suffering, and to contemplate the number of wisdom is the path of affliction.",
        "source": "X20n0359_003:0344a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言王數者法華文句中自有二意初列善心數有十能輔心王改惡從善革凡成聖謂信進念定慧喜猗捨覺戒次明通大地十數與心王俱起入善入惡徧通一切謂想欲觸慧念思解脫憶定受文句記云創心修觀莫不皆以第六王數為發觀之始是故今文初觀心王即觀苦道慧即煩惱諸數是業又淨名疏亦以王數對三佛性故彼文云一切眾生皆有王數即三佛性王即正因慧即了因餘數緣因佛性宛然煩惱數覆不能得發況三佛性與夫三道名異理同無二無別故知今文大意與彼淨名疏同。",
        "translation": "First, there are ten good mental factors that aid the mind king in changing evil and following good principles, which are faith, effort, mindfulness, concentration, wisdom, joy, freedom, equanimity, equanimity, enlightenment, morality, and second, ten factors that penetrate the great earth and accompany the mind king to enter good and enter evil, which penetrate all things, including perception, desire, contact, wisdom, mindfulness, liberation, memory, concentration, and feeling.",
        "source": "X20n0359_003:0344a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○心王是金下次釋名。",
        "translation": "○The king of mind is gold. Next, he explains the name.",
        "source": "X20n0359_003:0344a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心王是金慧數是光餘數是明。",
        "translation": "\"The mind-king is gold, the number of insights is light, and the remaining numbers are insights.",
        "source": "X20n0359_003:0344a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文可解。",
        "translation": "The text is explicable.",
        "source": "X20n0359_003:0344a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○如淨名下次觀假實等文為三初觀苦道文為二初正明又為二初正觀假名文為三初牒經文。",
        "translation": "○Like the pure name, the next time we contemplate the provisional and real, the text is divided into three.",
        "source": "X20n0359_003:0344a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如淨名曰觀身實相觀佛亦然者。",
        "translation": "\"Rujing Ming says, 'Observe the true character of the body and observe the Buddha as well.'",
        "source": "X20n0359_003:0344a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若頭等下次正明觀法文為二初正推檢為二初正明又二初約六分橫檢。",
        "translation": "○When the head and so forth next correctly explain the method of contemplation, the two first correct explanations are two, and the first two are about the six parts of a horizontal review.",
        "source": "X20n0359_003:0344a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若頭等六分各各是身此即多身若別有一身則無是處各各非身合時亦無。",
        "translation": "If each of the six parts of the head and so forth is a body, this is multiple bodies, and if there's a separate body, then there's no place where each isn't a body, and neither is there when it's combined.",
        "source": "X20n0359_003:0344a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各各是身即多身者檢自生也別有一身則無是處檢他生也各各非身檢離生也合時亦無檢共生也又各各非身合時亦無者提前各各是叵得以檢共生亦無耳若爾文中亦應更云共既叵得離亦不可也。",
        "translation": "Each is a body that's multiple bodies, which examine their own birth, and if there's a separate body, then there's no place to examine other births, and each is not a body that examines separate births and when they come together, there's no examining co-births.",
        "source": "X20n0359_003:0344a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次若頭等下約三世豎檢。",
        "translation": "○Second, suppose there's a vertical examination of the three times under headship and so forth.",
        "source": "X20n0359_003:0344b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若頭等六分求身叵得現在不住故不可得過去因滅亦不可得未來未至亦不可得。",
        "translation": "If the first six parts of the body sought are unobtainable, the present doesn't last, so it's unobtainable.",
        "source": "X20n0359_003:0344b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文意可見。",
        "translation": "The meaning of the text is clear.",
        "source": "X20n0359_003:0344b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○如是下次總結。",
        "translation": "○So it is next summarized.",
        "source": "X20n0359_003:0344b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是橫竪求身畢竟不可得即是無此無亦不可得亦有亦無亦不可得非有非無亦不可得。",
        "translation": "Thus, the horizontal and vertical body of seeking is ultimately unobtainable, which means it's nothing, here and nowhere, unobtainable, and neither existent nor nonexistent, nor unobtainable.",
        "source": "X20n0359_003:0344b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六分各別名之為橫三世次第名之為竪橫竪求身畢竟不可得者結示推檢有身不可得也此無亦不可得者有身執忘必計無身故茲遣耳雙亦雙非準說可解。",
        "translation": "The six parts of the teaching are each called horizontal, and the three worlds are each called vertical in order. The conclusion that the body of the horizontal search is ultimately unobtainable shows that the examination of the existence of the body is unobtainable, and that the absence of the absence is also unobtainable because the attachment and forgetfulness of the existence of the body must be considered as the absence of the body.",
        "source": "X20n0359_003:0344b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次但有下結成性空文為二初正結成。",
        "translation": "○Second, there are two ways to conclude the text on emptiness in nature: first, by correctly concluding it.",
        "source": "X20n0359_003:0344b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但有名字名之為身如是名字不在內非四陰中故不在外非色陰中故不在中間非色心合故亦不常自有非離色心故。",
        "translation": "\"Only there's a name for it, and it's called body. Such a name isn't internal, isn't in the four aggregates, so it's not external, isn't in the form aggregate, isn't in the middle, isn't combined with form and mind, and doesn't always have a mind that's not free of form.",
        "source": "X20n0359_003:0344b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "撿有無等既皆叵得當知此身但有名字名之為身其實無身然身名字亦不可得不在於內非是受想行識四陰之中故也又不在外非是色陰之中故也不在色心兩中間非是色心共合故也亦不常自有非是離於色心故也然實相理必具二空性空既爾相空準知是故文中略而不說此即假名生空具性相二空也若不爾者豈假名生空無性相二空邪豈性相叵得而假名眾生不空邪生空之中性相叵得既乃知此法空準例思之可知故止觀云復次性相中求陰界入不可得即是法空性相中求我人不得即是生空性相中求法叵得既爾生法中求性相叵得例然人不見之便將生法性相二空抗分而說深不可也。",
        "translation": "Possessing and not having are both unobtainable, you should know that this body only has a name called body, but it really has no body. However, the name body cannot be obtained because it's not inside the four aggregates, not in the four aggregates of feeling, perception, volition, and consciousness, not outside the aggregates of form, not in the middle of form and mind, not in the conjunction of form and mind, and not always existing, not apart from form and mind.",
        "source": "X20n0359_003:0344b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○當知下次引肇論證。",
        "translation": "○You should know that the next time you cite Zhaozhao's treatise, he proves that.",
        "source": "X20n0359_003:0344c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知名無召物之功物無應名之實假實既空名物安在。",
        "translation": "\"You should know that there's no merit in calling things into existence, and there's no reality that should be named.",
        "source": "X20n0359_003:0344c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此文元出肇公四論不真空論今文存略彼文具云夫以名求物物無當名之實以物求名名無得物之功物無當名之實非物也名無得物之功非名也是以名不當實實不當名名實無當萬物安在釋籤云法本無名名假無實故云名無召物之功物體性空無應假名之實名實俱無即真諦意也應知名物即是假實假即能召之名實即所召之質非謂實是五陰實法也。",
        "translation": "This text was originally taken from Zhaogong's four treatises on the nonvacuum of things, but the present text survives and is abbreviated.",
        "source": "X20n0359_003:0344c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三如此下結示文為二初結示觀身實相。",
        "translation": "○3. The following is a summary of the two kinds of explanation. First, it shows the true aspect of contemplating the body.",
        "source": "X20n0359_003:0344c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此觀身是觀實相。",
        "translation": "Such observation of the body is observation of its true aspect.",
        "source": "X20n0359_003:0344c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空中之理具足二空名為實相俗假之事名為諸法諸法實相即是三諦三諦即是事理中邊然則三觀一念中修意明三觀自他不二以由自行唯在空中化他但是三千妙假今從自行唯在空中以明觀身顯於實相自行空中實相若顯化他妙假諸法必彰豈可鑑明而像不現是故一家諸文之意莫不皆爾所以止觀不思議境修德境中從事修觀專照起心四性叵得即是自行唯在空中推於三千一法不存故止觀云第一義中一法尚不可得何況三千世諦之中尚具無量何但三千夫一念三千是性善性惡而性善性惡乃即實之權耳而四明以性惡為實相不亦誤哉又以今文四性推檢但作破於見思而說安能會於四句推檢乃是觀身實相之義是故須知淨名經云觀身實相既約四句推撿二空以例觀佛實相可知故前牒經云佛亦然也良以心佛眾生事用雖異實相之理元無差別故也故云心性無外攝無不周十方諸佛法界有情性體無殊一切咸徧故心性之言其言甚略應須具足佛法生法心性既爾生性佛性豈不然乎故但觀身以明實相任運見於生佛實相三法對簡雖分難易若隨宜樂不必局心是故三法皆可觀心今文雖標觀心釋名何妨明於觀身實相故不可執觀心之言以害觀身假實之說也。",
        "translation": "The principle of emptiness is fully expressed in the name of two kinds of emptiness, which is called the true aspect, and the things that are conventional and provisional are called the things that are the true aspect of the things that are the three truths, which are the middle edge of matter and principle.",
        "source": "X20n0359_003:0344c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次實相即是金下結示釋名。",
        "translation": "○Second, the explanation of the name is summarized under \"real marks are gold.",
        "source": "X20n0359_003:0345a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實相即是金實相觀智即是光緣身諸心心數寂不行者即是明也。",
        "translation": "\"The real character is gold, and the real character of observing wisdom is light.",
        "source": "X20n0359_003:0345a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法實相既通理事及以中邊故前約於空中之理結示實相以由空中屬於寂滅故也今約中邊結示釋名故以中道名實相金照理觀智名之為光緣身心數寂而不行即是明也理明既乃事顯中道亦具二邊故前結示觀身實相與夫今文結示釋名但是理事中邊開合之異耳。",
        "translation": "Since the true characteristics of dharmas are shared with the governing principle and with the middle and extremes, the previous statement shows the true characteristics in terms of the principle of air because air belongs to extinction. The present statement shows the interpretation of the name in terms of the middle and extremes, so the middle way is called the true characteristics, and gold illuminates the principle, and observing wisdom is called the light that takes the body and mind as object and the number of mental states that are quiescent and not active.",
        "source": "X20n0359_003:0345a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次觀身是假名下例觀實法。",
        "translation": "○Second, observing the body as a nominal name is followed by observing the real dharma.",
        "source": "X20n0359_003:0345b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀身是假名假名既如此觀色受想行識亦如是。",
        "translation": "This is true of observing that the body is a nominee, and this is true of observing form, feeling, perception, volition, and consciousness.",
        "source": "X20n0359_003:0345b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五陰即是實法故也實法之觀例前而說故云亦如是也故止觀中明觀色陰四大云若謂地是有有即是堅實若謂地是無是亦有亦無是非有非無是事實皆是堅義今明畢竟不可得亡其堅性也水性不住風性無礙火大不實及受想行識等皆不可得一一皆入如實之際實際之言雖通偏小今正取圓空中妙理以明實相也。",
        "translation": "It's because the five aggregates are real dharmas and the observation of real dharmas is explained in the preceding example that it's called 'also like this.' Therefore, in stopping and observing, it's explained that when you observe the four major aggregates of form, it's said that if the ground is existent and existent, that's solid, and if the ground is nonexistent, then it's also existent and nonexistent, which are both real and solid.",
        "source": "X20n0359_003:0345b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次即為下總結。",
        "translation": "○Second, this is the next summary.",
        "source": "X20n0359_003:0345b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即為苦道觀也。",
        "translation": "That's the contemplation of the path of suffering.",
        "source": "X20n0359_003:0345b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次觀煩惱道文為二初簡示。",
        "translation": "Next, he'll contemplate the path of affliction. The text is divided into two, the first being a brief explanation.",
        "source": "X20n0359_003:0345b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀煩惱道者煩惱與業皆是身因今且取煩惱為身因而起觀也。",
        "translation": "'The path of affliction ... affliction and action are both physical causes.' Now, let's take affliction as the physical cause and begin to contemplate it.",
        "source": "X20n0359_003:0345b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若以三道分於因果則苦道為果惑業為因故云煩惱與業皆是身因也今既開因以為惑業故且置業而取煩惱以為所觀言且取者惑業雖則通是身因今且別取煩惱為因以觀業因在於下文方說故也。",
        "translation": "If the three paths are divided into cause and effect, then the path of suffering is the result, and affliction and karma are the cause.",
        "source": "X20n0359_003:0345b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次淨名下正明觀法文為二初牒經文。",
        "translation": "○Second, under Vimalakīrti, we'll explain the correct way to contemplate the Dharma in two ways. First, we'll explain the sūtras.",
        "source": "X20n0359_003:0345b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨名云不壞身因而隨一相者。",
        "translation": "\"The Jingming yuans don't destroy the body and thus follow one characteristic.",
        "source": "X20n0359_003:0345b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼經但云不壞於身而隨一相而今謂之不壞身因者兼取經中上兩句文不斷淫怒癡亦不與俱也然彼疏釋不斷淫怒癡亦不與俱者集諦也不壞於身而隨一相者苦諦也。",
        "translation": "That sūtra only says that it doesn't destroy the body and follows one characteristic, but now it's called the cause of not destroying the body because it's taken from both the above two sentences of the sūtra and the fact that it doesn't stop lust, anger, and delusion and doesn't go along with them.",
        "source": "X20n0359_003:0345b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次應作下解釋文為三初開為四句。",
        "translation": "○Second, the explanation below should be made that the text is divided into three first, beginning with four phrases.",
        "source": "X20n0359_003:0345c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應作四句分別誰身因果俱壞誰身因果俱不壞誰壞果不壞因誰壞因不壞果。",
        "translation": "The four sentences should be made to discern which body has both cause and effect destroyed, which body has both cause and effect that aren't destroyed, which has both effect and cause destroyed, and which has both cause and effect destroyed.",
        "source": "X20n0359_003:0345c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰者何也即徵問之辭耳例如止觀云十章幾真幾非真非俗等自在作問也。",
        "translation": "Who is it?\" That's a word of inquiry, such as \"Stop and Observe,\" which says in ten chapters how many true and how many not true and not mundane questions are asked freely.",
        "source": "X20n0359_003:0345c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次云何下分別因果文為二初正分別。",
        "translation": "○Second, the text below discerns cause and effect in two ways: first, it correctly discerns.",
        "source": "X20n0359_003:0345c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何是身果父母所生頭等六分是也云何是身因貪恚癡身口意業等是也。",
        "translation": "What are the six physical fruits, such as the head and so forth, that are born from a father and mother? What are the physical causes, such as craving, ill-will, delusion, body, speech, and thought?",
        "source": "X20n0359_003:0345c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次今且下去取。",
        "translation": "○Second, let's go down to the beginning and take it from there.",
        "source": "X20n0359_003:0345c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今且置三業觀貪恚癡等。",
        "translation": "Now, we'll set out to contemplate the three karmic activities of craving, ill-will, delusion, and so forth.",
        "source": "X20n0359_003:0345c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三從四果下正釋四句文為二初約小乘釋。",
        "translation": "The first one is a lesser-vehicle interpretation.",
        "source": "X20n0359_003:0345c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四果以無常苦空觀智破貪恚癡子縛斷名壞身因不受後有名壞身果。",
        "translation": "The fourth realization is the insight of observing impermanence, suffering, and emptiness, which breaks the bonds of craving, ill-will, and delusion and subordinates, and which is called the cause of body destruction and the subsequent result of body destruction.",
        "source": "X20n0359_003:0345c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言四果者第四果也子縛如前釋不受後有者輔行云未來生陰名為後有陰復生陰名後有田若入無餘無生處故名為不生不生即是不受後有此釋初句因果俱壞也。",
        "translation": "The four fruits are the fourth fruit, the son bond as explained above, and not accepting later existence, which is explained by the auxiliary practice of the cloud of future birth called later existent aggregate, and the aggregate of further birth called later existent field.",
        "source": "X20n0359_003:0345c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次凡俗下釋第二句。",
        "translation": "○Then, under worldlings, he explains the second phrase.",
        "source": "X20n0359_003:0345c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡俗之流名衣好食長養五陰縱心適性放逸貪恚癡自惱惱他一身死壞復受一身因果相續無有邊際是名因果俱不壞。",
        "translation": "Ordinary people are famously clothed, well fed, and nourished by the five aggregates, and they are mindfully disposed to indulge in carelessness, greed, anger, delusion, and self-infliction.",
        "source": "X20n0359_003:0345c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文意可見。",
        "translation": "The meaning of the text shows this.",
        "source": "X20n0359_003:0345c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次如犯下釋第三句。",
        "translation": "○Second, as explained in the third sentence of the commentary, \"The king's constitution is violated.",
        "source": "X20n0359_003:0345c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如犯王憲付旃陀羅如怨對者自害其體身既爛壞四陰亦盡是為壞果貪恚癡身因轉更熾盛彌綸生死無得脫期是為第三句也餘三果亦以無常觀智斷五下分因縛五下分果身猶未盡是名壞身因不壞身果。",
        "translation": "As he violates the king's constitution, he pays a visit to Candra like a rival who harms his own body and destroys the four aggregates, which is the result of destroying the body.",
        "source": "X20n0359_003:0346a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憲者法也旃陀羅此云嚴熾又云主殺人即屠殺者之總名耳自害者自殺也彌綸(音倫)者易繫辭云彌綸天地陸德明釋文云彌者徧也終也綸者纏裹也餘三果者前既以第四果釋初句故今以前三果釋第四句也五下分者身見戒取疑貪瞋也此五繫欲故名為下對上五分得下名耳貪雖通上不是唯上瞋一唯下不通於上餘三徧攝一切見惑雖則通上而能牽下故俱舍云由二不超欲由三復還下是故此五俱名下分又身見等三亦名三結此三重故略言三耳廣說乃有八十八使思惑有四亦從重說略言貪瞋諸文謂之初果斷見至第三果又言斷於五下分者以後望前故兼舉耳五上分者掉舉慢無明色染無色染一向唯上掉慢等三雖則通下不能牽下是故此五俱名上分上即色界無色界也以色無色通名為類故合為一耳五下分果身猶未盡者父母所生之形猶在故也。",
        "translation": "The remaining three fruits are the first sentence of the explanation of the fourth fruit, so now the fourth sentence of the explanation of the first three fruits is the fourth sentence of the explanation of the five lower parts of the body, which are tied up in desire, morality, doubt, greed, and anger.",
        "source": "X20n0359_003:0346a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次如此下約大乘釋文為二初斥小。",
        "translation": "○There are two explanations of the great vehicle text below, the first denying the lesser.",
        "source": "X20n0359_003:0346a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此四句存壞不同皆不隨一相。",
        "translation": "These four phrases, which differ in terms of preservation and decay, don't follow a single aspect.",
        "source": "X20n0359_003:0346a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言存壞者存謂第二句因果俱不壞及第三不壞因半句第四不壞果半句也壞謂第一句因果俱壞及第二壞果半句第四不壞果半句也皆不隨一相者縱如初句因果具壞乃是實有因果俱滅滅因果空豈得名為隨順真如一實之相故此小乘及諸凡夫存壞不同皆非隨順一實相也。",
        "translation": "When it comes to storage and decay, storage refers to the second phrase, which refers to the fact that both cause and effect are not decayed, the third half phrase, which refers to the third not decayed cause, and the fourth half phrase, which refers to the first phrase, which refers to the fact that both cause and effect are decayed, the second half phrase, which refers to the second decayed effect, and the fourth half phrase, which refers to the fourth not decayed effect.",
        "source": "X20n0359_003:0346a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次從隨一相者下正約大乘釋大雖通三今正從圓於中為二初釋不壞身因一句又為二初正釋。",
        "translation": "○Subsequently, from following the one characteristic, we'll explain it in terms of the great vehicle. Although the great vehicle explains that there are three, we'll now correctly follow the perfect in which there are two first explanations of the cause of indestructible bodies, and then there are two first explanations.",
        "source": "X20n0359_003:0346b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨一相者所謂脩大乘觀觀一念貪恚癡心心為自起為對塵起為根塵共起為離根塵起皆無此義非自非他非共非無因亦非前念滅故起非生非非生非滅非非滅如是橫竪求心叵得心尚本無何所論壞。",
        "translation": "Following the one characteristic, there's the so-called sūtra, the great vehicle, which observes that a single thought of craving, ill-will, and delusion is self-arisen, counter-arisen, arisen by the faculties, dust, and co-arisen, or arisen by the free faculties and dust, and has no such meaning.",
        "source": "X20n0359_003:0346b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心即意根塵即法塵先約四句定其所起是故謂之為自起等起即生也皆無此義者此文甚略止觀具云法塵對意根生一念心起即因成假觀此一念為從心自生心為對塵生心為根塵共生心為根塵離生心若心自生者前念為根後念為識為從根生心為從識生心若根能生識根為有識故生識根為無識故生識根若有識根識則並又無能所根若無識而能生識諸無識物不能生識根既無識何能生識如是推求畢竟知心不從自生推檢自生既不可得推撿塵生共生離生亦準可解是故今云皆無此義具如止觀(云云)心既名自塵即是他和合名共離即無因既皆叵得是故謂之非自他等準止觀中破因成假即是橫破橫即根塵對檢故也破相續假即是竪破故下結云如是橫竪求心叵得言破相續是竪破者止觀云雖因成四破不得心生今現見心念念生滅相續不斷何謂不生此之念念為當前念滅後念生為前念不滅後念生為前念亦滅亦不滅後念生為前念非滅非不滅後念生若前念不滅後念生者此則念自生念兩生相並亦無能所若前念滅後念生者前不滅生名為自性今由滅生不滅望滅豈非他性他性滅中有生故生無生故生有生是生生生滅相違乃是生生何謂滅生若滅生無何能生若前念亦滅亦不滅後念生非滅非不滅後念生破之具如止觀(云云)今文初破第一句執故云亦非前念滅故起也亦之一字但是因前橫破而來耳後破第四句執故云非滅非非滅也非非滅者非不滅也不即非也文中闕破第二第三句前念不滅後念生前念亦滅亦不滅後念生而於初後兩句中間更加非生非非生者此是兼破相待假中第四句耳此句合在非滅非非滅文後列之今從語勢便故所以先言耳故止觀破相待假云為待無生心生為待有生心生為待亦生亦無生而心生為待非生非不生而心生若待非生非不生而心生者從因緣生尚自不可何況無因緣邪故非生非不生亦不可得也今云非生非非生非生非不生也止觀云破相待假是亦橫亦竪破故今結云如是橫竪求心叵得即是結破因成之橫相續之竪相待之亦橫亦竪耳四明云非生等者生即不滅若爾非生既非不滅如何消於非非生邪心尚本無者本自不生也何所論壞者今則無滅也。",
        "translation": "The mind is the mind faculty, and the dust is the mental faculty. The mind faculty first defines what arises from the four statements.",
        "source": "X20n0359_003:0346b13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○是名下次結示文為二初正結。",
        "translation": "○This is called the next conclusion, which shows that the text is divided into two, the first being the correct conclusion.",
        "source": "X20n0359_003:0347a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名不壞身因而隨一相。",
        "translation": "'This is called the body that doesn't perish and thus follows one characteristic.'",
        "source": "X20n0359_003:0347a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一念惑心不生不滅是則名為不壞身因不生不滅既順妙理是故名為而隨一相。",
        "translation": "When a single moment of mental confusion doesn't arise or cease, this is called a body that doesn't perish because it doesn't arise or cease and follows the marvelous principle; therefore, it's called following the one characteristic.",
        "source": "X20n0359_003:0347a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○隨一相者下釋名。",
        "translation": "○Following the one characteristic, we'll explain the name.",
        "source": "X20n0359_003:0347a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨一相者即是隨金隨相智即是隨光諸數寂滅即是隨明。",
        "translation": "\"Following the one characteristic is following gold, following cognition of characteristics is following light, and the extinction of all numbers is following insight.",
        "source": "X20n0359_003:0347a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "准前思之。",
        "translation": "Consider it in the light of the above.",
        "source": "X20n0359_003:0347a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次既得下例餘三句。",
        "translation": "○Then he attains the following, which are examples of the other three phrases.",
        "source": "X20n0359_003:0347a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得不壞一句而隨一相了壞身因亦隨一相壞身果不壞身果亦隨一相皆亦如是(云云)。",
        "translation": "Since he has attained the phrase not-decaying, following the one characteristic, he'll understand that the cause of decaying body also follows the one characteristic, and the result of decaying body and not-decaying body also follows the one characteristic, and they're all likewise (clouds).",
        "source": "X20n0359_003:0347a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不壞身因一句既然壞因壞果及不壞果三句亦爾何者壞則約斷不壞約不斷因果皆然別但論斷圓具二義教道論斷證道不斷應知斷是離義不斷是即義凡言即者意顯於離如冰雖則不離於水理須融冰義同於離方乃顯即是故即離及斷皆得名為而隨一相所以謂之了壞身因亦隨一相壞果不壞果亦隨一相皆亦如是注云云者令如向說也又復應知亦須於此以論釋名故注云云耳然前四句但以今文壞因不壞因壞果不壞果更互相對而言之耳何者今云壞因壞果即前初句因果俱壞也不壞因不壞果即前第二句因果俱不壞也壞果不壞因壞因不壞果三四兩句如文可見但今因果單說前文因果互說辭有小異耳。",
        "translation": "Since the cause of indestructible body is one sentence, since the cause of indestructible body and the result of indestructible body are also three sentences, why is it true that the cause of indestructible body is about stopping, but not about stopping, but the theory of perfection has two meanings: the doctrine of stopping and the theory of realizing the path of incessantly.",
        "source": "X20n0359_003:0347a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次觀業道文為三初牒經文。",
        "translation": "○Second, the text of contemplating the path of karma is divided into three. First, it introduces the text of the sutra.",
        "source": "X20n0359_003:0347b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀業道者如淨名云舉足下足無非道場具足一切佛法矣。",
        "translation": "The second is to contemplate the path of karma, as the Pure Land says, \"Raising one's feet and lowering them is not a non-downtown site complete with all the Buddha's teachings.",
        "source": "X20n0359_003:0347b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止觀中明歷緣對境觀陰界入初觀行緣亦引此文但彼與今用觀乃有理事之殊何者彼觀行緣無明陰入即是法界豈非從理唯達法性更不餘塗今文約於四性推檢豈非從事專照叵得理事離分本末相映是故止觀隨自意中復以四運推於行緣彼文既爾今亦例之故今觀於舉足下足一切諸業亦可謂之陰界入等即是法界能了此者可與論道。",
        "translation": "In the explanation of calming and insight, the object of contemplation is the aggregates, the elements, and the sense-fields. The first contemplation of the condition of practice also refers to this text, but there's a difference between that and the present contemplation of principle and principle.",
        "source": "X20n0359_003:0347b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次觀舉足下正明觀法文為二初觀行緣。",
        "translation": "○Second, he correctly explains that there are two ways to contemplate the Dharma while holding up his feet.",
        "source": "X20n0359_003:0347b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀舉足時為是業舉為是業者舉為業業者共舉為離業業者舉若業舉不關業者業者舉不關於業各既無舉合亦無舉合既無舉離那得舉舉足既無下足亦無。",
        "translation": "When he observes lifting his feet, it's when he's lifting actions, when he's lifting actions, when he's lifting actions, when he's lifting actions, when he's lifting actions, when he's lifting actions, when he's lifting actions that aren't related to actions, when he's lifting actions that aren't related to actions, when there's neither lifting together nor lifting together, when there's neither lifting nor freeing, then he can lift his feet, when there's neither lower feet nor nothing.",
        "source": "X20n0359_003:0347b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前觀煩惱簡身口意屬於業道今於行緣既觀業道須以意三名之為業身口等七名為業者故十不善名為業道意三是業不名為道身口等七亦業亦道意即是業於中行故名為業道故知業道即是業者業舉屬自生業者是他生業與業者和合名共離業業者即無因生四皆不然性相叵得舉足既爾下足亦然如是方名無非道場實相妙理具足一切佛無量佛法矣。",
        "translation": "As he was observing the afflictions, his body, speech, and mind belong to the path of karma. Now, when he observes the path of karma as a condition for practice, he must use his mind to declare three of them as karma, his body, speech, and other seven names as karma.",
        "source": "X20n0359_003:0347b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○觀行既然下次例。",
        "translation": "○Since he's observing and practicing, he'll follow the next example.",
        "source": "X20n0359_003:0347c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀行既然住坐臥言語執作亦復如是。",
        "translation": "Since he's observing practice, standing, sitting, lying, speaking, and grasping actions, it's likewise.",
        "source": "X20n0359_003:0347c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀於餘緣亦然故下結云亦復如是故止觀云若有諸塵須捨六受若無財物須運六作捨運共論有十二事然今文云行住坐臥四緣與彼止觀名同但彼第五謂之語默第六謂之作作耳(作作兩字並祖餓切)作所作事名作作也。",
        "translation": "Therefore, it's also true that in the following conclusion of stilling and insight, it's said that if there are objects, the six sensations must be abandoned, and if there are no possessions, the six actions must be carried out, and the common theory of abandonment has twelve things.",
        "source": "X20n0359_003:0347c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○是為觀業下三釋名。",
        "translation": "○These are the three explanations of the name below contemplative activity.",
        "source": "X20n0359_003:0347c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為觀業實相名為金此觀智名為光諸威儀中心數悉寂名為明。",
        "translation": "This is the name of the real aspect of contemplative activity, which is called gold, and this is the name of the wisdom of contemplation, which is called light, and these are the words for the number of centers of deportment that are completely quiescent, which is called light.",
        "source": "X20n0359_003:0347c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為三道辯金光明。",
        "translation": "This is the golden radiance of the three paths of discernment.",
        "source": "X20n0359_003:0347c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○夫有心下次約六即判位。",
        "translation": "○The person who has mind next discerns the level of the six immediate categories.",
        "source": "X20n0359_003:0347c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫有心者即具法界法性金光明能如此解了但是名字金光明常依此觀念念不休心心相續即是觀行金光明若蒙籠如羅縠中視未得分明閉目則見開眼則失此是相似金光明若了了分明閉目開目俱見者是分證金光明若妙覺果圓究竟明了名究竟金光明也。",
        "translation": "If someone has mind, that is, the Dharma realm and Dharma nature are fully endowed with golden light, and they can understand it this way but name it golden light, they always rely on this observation, mindfulness, and non-stop continuity of mind and heart, which is the golden light of contemplation practice.",
        "source": "X20n0359_003:0347c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有心本具理即位也蒙籠者奄覆也若作朦字月下不分明也羅縠者羅綺紗縠也閉目則見喻入觀則相似見中道妙理也開目則失翻此可知若至初住方能出入任運分明故此相似入觀雖見出觀猶失此語元出普賢觀經故彼經云雖見諸佛猶未了了閉目則見開目則失妙玄判云普賢觀明無生忍前有十境界即十信也無生忍位乃指經云六根淨已諸如來摩頂授記授記即是入於初住故初住前有十境界而閉目則見開目則失正是住前十境界中七信所收故今相似閉目即見開目則失正與普賢觀經意同(以十境界對十信位具如補注)孤山乃據十六觀疏觀行即云開眼閉目若明若闇常得不離見佛世尊以斥今文相似即云閉見開失然則孤山甞撰疏解普賢觀經全迷住前有十境界屬十信位致茲妄斥耳若斥今文違觀經疏何不斥於觀經疏違普賢觀經況諸文中準普賢觀以五品位在十信中何不疑之而獨惑此四明謂彼十六觀疏開閉俱見乃是想彼色身事境而修三觀故觀行即開閉常見今論理性金光明顯在初住故相似即閉見開失四明此說非無其致但觀經疏觀行即中亦乃觀於一體三身然雖如此其如開閉常得見佛按文次第正屬色身應佛相好故彼疏云心緣妙色與眼作對開眼閉目常得不離見佛世尊。",
        "translation": "The originally possessed mind is the principle that is the stage, and the cage is an amplifying cover, and if it's made hazy, it's not clearly delineated under the moon, and the coral is a silk gauze, and the closed eyes are seen as a metaphor for entering and observing, then similarly seeing the middle way and the marvelous principle, and opening the eyes and losing them.",
        "source": "X20n0359_003:0347c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次觀三識釋名文為二初標次釋文為二初正明觀法文為三初總示。",
        "translation": "The first is to label the text and the second is to explain the text in two ways.",
        "source": "X20n0359_003:0348a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心明三識論金光明者諦觀一念心即空即假即中即是觀心識於三識。",
        "translation": "The first is a general statement. wisdom mind, clarification of the three consciousnesses, and the second is a golden light that observes a single mindfulness of mind as empty, provisional, and intermediate, which is the three consciousnesses of the observing mind.",
        "source": "X20n0359_003:0348a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下別釋文為二初正釋文為三初釋空觀。",
        "translation": "The first correct explanation of the text is threefold, beginning with an explanation of the contemplation of emptiness.",
        "source": "X20n0359_003:0348a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者意識託緣發意本無識緣何所發又緣中為有識為無識若有識緣即是識何謂為緣若無識那能發識若意緣合發二俱無故合不能發離最不可當知此識不在一處從眾緣生從緣生法我說即是空。",
        "translation": "What is the cognition that arises from consciousness depending on cognition? What cognition arises from cognition that's existent and what's not? If there's cognition, then what's the cognition that arises? If there's no cognition, then consciousness can be arisen.",
        "source": "X20n0359_003:0348b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言眾緣者輔行云今此虗假賴眾緣成非從空出設權利物。",
        "translation": "When we say many conditions, the auxiliary practice says that this simple hypothesis depends on many conditions to become something other than emptiness and sets forth expedient things.",
        "source": "X20n0359_003:0348b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次於此下釋假觀。",
        "translation": "○Thereupon, we'll explain the contemplation of the nominal.",
        "source": "X20n0359_003:0348b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此空中假作分別是惡識是善識是非惡非善識種種推畫強謂是非。",
        "translation": "Here in space, they falsely discriminate whether consciousness that's bad or good is right or wrong, and variously project what's right or wrong.",
        "source": "X20n0359_003:0348b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善惡等者四趣為惡人天為善四聖乃是非惡非善又止觀云善惡無定二乘無漏雖名為善不能兼濟三教菩薩迭論善惡唯圓名善又輔行中亦以十界互為善惡今文既云種種推畫必約十界以明善惡何者三界皆惡二乘菩薩俱名為善佛界乃是非善非惡又復分別生死有邊名之為惡涅槃空邊名之為善非有非無乃是非善非惡也言強謂者猶假設也言是非者即善惡等也。",
        "translation": "The four destinies are evil, humans and gods are good, and the four noble ones are neither evil nor good.",
        "source": "X20n0359_003:0348b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○識若定空下三釋中觀。",
        "translation": "○If consciousness is determined to be empty, the following three explanations of the middle way are given.",
        "source": "X20n0359_003:0348b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識若定空不可作假識若定假不可作空當知空非空假非假非空非假雙亡二邊正顯中道一念識中三觀具足。",
        "translation": "If consciousness is determined to be empty, it can't be made false; if consciousness is determined to be false, it can't be made empty. You should know that empty is not empty, false is not false, and neither empty nor false are the two extremes that correctly reveal the middle way.",
        "source": "X20n0359_003:0348b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次一念下融通文為二初明即照而亡又為二初正明三觀具足。",
        "translation": "○Second, the text of the integration of the single moment of consciousness is divided into two, the first clarifying that it's illuminating and extinguishing, and the second clarifying that the three contemplations are complete.",
        "source": "X20n0359_003:0348b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識於三識亦不得三識觀。",
        "translation": "Consciousness in the three consciousnesses also doesn't allow the three contemplations of consciousness.",
        "source": "X20n0359_003:0348b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識於三識是即照也亦不得於三識三觀是而亡也即三識三觀俱照俱亡矣。",
        "translation": "Consciousness in the three consciousnesses is immediate illumination, but it's also not possible to observe the three consciousnesses and the three contemplations are extinguished, which means that the three consciousnesses and three contemplations are both illuminated and extinguished.",
        "source": "X20n0359_003:0348b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○故淨名下次引證。",
        "translation": "○So the Pure Names will next cite this as proof.",
        "source": "X20n0359_003:0348c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故淨名云不觀色不觀色如不觀色性乃至不觀識不觀識如不觀識性。",
        "translation": "Therefore, the Pure Names say that they don't contemplate form and don't contemplate form as they don't contemplate the nature of form, and they don't contemplate consciousness and don't contemplate consciousness as they don't contemplate the nature of consciousness.",
        "source": "X20n0359_003:0348c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五陰雖則但舉初後正取最後不觀識等以證今文耳。",
        "translation": "Although the five aggregates are only mentioned in the beginning and end, the right way to take the end is not to contemplate consciousness and so forth to confirm the present statement.",
        "source": "X20n0359_003:0348c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次雖不得下明即亡而照文為二初正明。",
        "translation": "○Second, even though it's not possible, the following explanation is lost and the text is illuminated in two ways.",
        "source": "X20n0359_003:0348c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖不得識不得識如不得識性雙照識識如識性宛然無濫。",
        "translation": "Although consciousness can't be obtained, consciousness can't be obtained as the nature of consciousness can't be obtained, and both illuminate consciousness and consciousness as the nature of consciousness just like that without confusion.",
        "source": "X20n0359_003:0348c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從雖不得下至不得識性是即亡也從雙照下是而照也言雙照者識有也識如空也識性中也中道雙照識及識如也又中邊叵得名為雙亡中邊宛然名為雙照宛然無濫者即三相不混也如鏡明像雖不相離而三相炳然邊高中下邊下中高名之為宛宛然即是顯了可見不參雜也。",
        "translation": "From although it's not possible to get down to not getting the nature of consciousness, it's namely extinction, and from double illumination down it's illumination, which means that consciousness exists, consciousness as emptiness, consciousness as nature, the middle way, and double illumination of consciousness and consciousness as such.",
        "source": "X20n0359_003:0348c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○以照識性下次對識。",
        "translation": "○Its illumination of the nature of consciousness is the next step in confronting consciousness.",
        "source": "X20n0359_003:0348c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以照識性故是菴摩羅識照識如故是阿黎耶識亦照亦滅故是阿陀那識。",
        "translation": "Because the nature of consciousness is illuminated, it's the āmāra consciousness, which illuminates consciousness as it is, and because it also illuminates and ceases, it's the ādana consciousness.",
        "source": "X20n0359_003:0348c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "識性屬中故對菴摩羅識如屬空故對棃邪亦照亦滅是陀那者亦照即是七識所持一切諸法以助第八藏識盛持智種不失亦滅正是第七識體訶惡生死欣羨涅槃四明云能生第六故名亦照常緣第八故名亦滅(云云)。",
        "translation": "The nature of consciousness is neutral, so it's directed at the consciousness of āmrā, which is empty, so it's directed at the concept of wrong and also illuminating and extinguishing.",
        "source": "X20n0359_003:0348c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○是名下三釋名。",
        "translation": "○This is called the next three explanations of the name.",
        "source": "X20n0359_003:0348c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名觀心中三識金光明。",
        "translation": "\"This is called the golden radiance of the three consciousnesses in the mind of contemplation.",
        "source": "X20n0359_003:0348c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約六即判位。",
        "translation": "○Second, we'll discuss the six immediate stages.",
        "source": "X20n0359_003:0348c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即位如上說。",
        "translation": "The six immediate stages are as explained above.",
        "source": "X20n0359_003:0348c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆可見。",
        "translation": "They can all be seen.",
        "source": "X20n0359_003:0349a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三觀三佛性釋名文為二初標。",
        "translation": "○Three contemplations on the three buddha-natures are explained in the text of the name with two initial labels.",
        "source": "X20n0359_003:0349a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心明三佛性金光明者。",
        "translation": "\"The golden radiance of the three buddha-natures in the mind of contemplation.",
        "source": "X20n0359_003:0349a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次觀一念下釋文為二初正釋又為二初正明觀法文為四初正釋。",
        "translation": "The first two are the correct explanation, and the first two are the correct explanation of the method of contemplating the four first correct explanations.",
        "source": "X20n0359_003:0349a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀一念心起即空即假即中是見三佛性何者心從緣起是故即空強謂有心是故即假不出法性是故即中。",
        "translation": "\"He observes that a single moment of mindfulness arises, which is empty, which is provisional, which is middle, and which is seeing the three buddha-natures.",
        "source": "X20n0359_003:0349a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此與止觀文意大同故止觀云根塵相對一念心起即空假中云何即空並從緣生緣生即無主無主即空云何即假無主而生即是假云何即中不出法性並皆即中輔行釋云並緣生者謂一念心並具百界千如等法如是緣生悉皆無主無主故空即此千如名為妙假即是法性名為妙中。",
        "translation": "This is similar to the text of Zhiguan, so Zhiguan clouds the contrast between root and dust, a single moment of mind arises, that is, emptiness, falsehood, and in what way is it empty and arises from conditions, that is, without a subject, without a subject, that is, emptiness, that is, falsehood, without a subject and arises, that is, falsehood, that is, in what way is it not out of the Dharma nature and all of them, that is, in the auxiliary practice.",
        "source": "X20n0359_003:0349a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○此釋下次引證文為二初引淨名華嚴。",
        "translation": "○The next part of this explanation refers to two texts for proof. The first refers to the pure name Huayan.",
        "source": "X20n0359_003:0349a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此釋已顯更引經證之淨名云何謂病本所謂攀緣何謂攀緣謂緣三界證其假也何謂息攀緣謂心無所得此證即空我及眾生病皆非真非有此證即中華嚴云心佛及眾生是三無差別此證觀心即三佛性也。",
        "translation": "This explanation already shows that the sūtras are used to confirm the pure name, which refers to the root of the illness, the so-called climbing condition, the so-called climbing condition, which refers to the condition of the three realms, and the falsehood, which refers to the cessation of climbing condition, which means the mind has nothing to gain, which confirms emptiness, that neither I nor sentient beings are real or existent, which confirms that the mind, Buddha, and sentient beings are three without distinction, which confirms that the contemplation mind is the nature of the three buddhas.",
        "source": "X20n0359_003:0349a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然止觀中亦引華嚴淨名為證引華嚴文與今全同引淨名文其文雖異其意亦同何者彼引淨名諸佛解脫當於眾生心行中求解脫既乃具於三種故今所引攀緣等三證空假中亦何乖異況前觀心明中已引淨名諸佛解脫當於眾生心行中求故此不煩所以但引攀緣等義以證三觀耳然三觀次第必先即空今先證假者此約觀心具法而說點此具法即空即中是故先假次空次中如義例云觀此一運即具十界百界千如即空即中又如不二門云照故三千恒具遮故法爾空中然則妙假兼於能所能化雖多不出十界物機無量不出三千今且從於所化機說故引病本攀緣三界以證即假故止觀明假有三意一者知病二者識藥三者應病授藥今文雖舉第一知病義必須兼第二第三識藥授藥方成玅假自他機應也玅假百界一法叵得故息攀緣心無所得以證即空故釋籤云言有則一念都無言無復起三千慮想故無三千慮想即是息於攀緣矣我及眾生病有權實既病非真有當知此證中道雙遮其義明矣引華嚴者心佛眾生迷悟雖殊三觀三諦理體何別是故引此及以淨名證於觀心即空假中即三佛性故輔行云引華嚴者證理齊也彼止觀中又引普賢觀經毗慮遮那徧一切處輔行釋云煩惱體淨眾德悉備身土相稱徧一切處顯前兩經眾生理徧不了之者尚隔無情故知金錍立無情佛性乃是有情性徧不隔瓦石即是無情有佛性耳人不見之尤多妄說具如金錍寓言記辨(云云)又止觀云根塵相對一念心起並畢竟空並如來藏並中道輔行釋云如此三諦在根在塵如來藏者即當假(此是不空如來藏耳)豈如來藏而無佛性(此是緣因佛性耳)故知今文引於淨名華嚴等文證三佛性既與止觀輔行文同不可斥為後人檀添矣。",
        "translation": "However, in stopping and observing, the pure name of Huayan is also cited as proof that the text of Huayan is the same as the present one. Although the text of the pure name is different, its meaning is the same. Why is it that they cite the pure name of the liberation of the buddhas when seeking liberation in the mental condition of sentient beings?",
        "source": "X20n0359_003:0349a20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○次引般舟文為二初引文。",
        "translation": "○The second quotation from the Prajñāparinirvāṇa-sūtra is the first of two quotations from the text.",
        "source": "X20n0359_003:0349c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又般舟三昧經云我心如佛心如佛心如我心如不見我心為佛心不見佛心為我心而見阿彌陀佛如琉璃中見像如飢夢食如夢婬從事如觀骨光等喻皆是證即空即假即中之文。",
        "translation": "The scripture of the paranirmita-vaśavartin samādhi says, \"My mind is like the Buddha's mind, and the Buddha's mind is like my mind, and I don't see my mind as the Buddha's mind and don't see the Buddha's mind as my mind, but I see Amitâbha Buddha like an image in a lapis lazuli, like starving, dreaming, eating, dreaming, obeying, observing bone light, and other metaphors are all ways of realizing that the text is empty, provisional, and in the middle.",
        "source": "X20n0359_003:0349c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止觀云般舟此云佛立佛立三義一佛威力二三昧力三行者本功德力能於定中見十方現在佛在其前立如明眼人清夜觀星見十方佛亦如是多故名佛立三昧然今引彼般舟經文與止觀中其意大同故止觀引明空觀云我當從心得佛從身得佛佛不用心得不用身得今文謂之我心如佛心如等者如即空也此乃以意引文耳不可責其文異也(空觀文出無著品)次明假觀引經六譬即三夢一寶一骨一像三夢者初云如夢見七寶親屬歡樂覺已追念不知在何處次云如舍衛有女名須曼那聞之歡喜夜夢從事覺已念之彼不來我不往而樂事宛然第三夢云如人行大澤飢渴夢得美食覺已腹空自念諸法皆如夢第四寶譬云如人以寶倚瑠璃上影現其中第五骨譬云亦如比丘觀骨起種種光(青黃赤白等)此無持來者亦無有是骨是意作耳第六像譬云如鏡中像不外來不中生以鏡淨故自見其形行人色清淨所有者清淨欲見佛即見(云云)今文但舉三夢之中第二第三略其第一夢見七寶又復於其寶骨像三但舉寶骨復略鏡像所以然者輔行云三夢一寶一骨一像其意大同但重說耳是故今文存沒無妨第三中觀乃引經云自念佛從何所來我亦無所至我所念即見心作佛心自見佛心是佛心是我心見佛等即今文云而見阿彌陀佛也(假中二觀文出行品)。",
        "translation": "止觀云般舟此云佛立佛立三義一佛威力二三昧力三行者本功德力能於定中見十方現在佛在其前立如明眼人清夜觀星見十方佛亦如是多故名佛立三昧然今引彼般舟經文與止觀中其意大同故止觀引明空觀云我當從心得佛從身得佛佛不用心得不用身得今文謂之我心如佛心如等者如即空也此乃以意引文耳不可責其文異也(空觀文出無著品)次明假觀引經六譬即三夢一寶一骨一像三夢者初云如夢見七寶親屬歡樂覺已追念不知在何處次云如舍衛有女名須曼那聞之歡喜夜夢從事覺已念之彼不來我不往而樂事宛然第三夢云如人行大澤飢渴夢得美食覺已腹空自念諸法皆如夢第四寶譬云如人以寶倚瑠璃上影現其中第五骨譬云亦如比丘觀骨起種種光(青黃赤白等)此無持來者亦無有是骨是意作耳第六像譬云如鏡中像不外來不中生以鏡淨故自見其形行人色清淨所有者清淨欲見佛即見(云云)今文但舉三夢之中第二第三略其第一夢見七寶又復於其寶骨像三但舉寶骨復略鏡像所以然者輔行云三夢一寶一骨一像其意大同但重說耳是故今文存沒無妨第三中觀乃引經云自念佛從何所來我亦無所至我所念即見心作佛心自見佛心是佛心是我心見佛等即今文云而見阿彌陀佛也(假中二觀文出行品)。",
        "source": "X20n0359_003:0349c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○讀此下次釋義文為二初正釋又為二初釋法。",
        "translation": "○Reading this next explanation of the meaning of the text, there are two first correct explanations and two first explanations of the teaching.",
        "source": "X20n0359_003:0350a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "讀此經文宜須細意若併作如讀是即空也示如許多心紛紜是即假也見阿彌陀是即中也。",
        "translation": "It's appropriate to read the text of this sūtra with care, for if it's read together as it is, it means emptiness; it shows as many different minds as there are, which is false; and seeing Amitâbha, which is in the middle.",
        "source": "X20n0359_003:0350a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文自有兩節初番意者如妙玄中約三轉讀十如是意併者皆也並也既皆云如如即空也示如許多心者我心該於一切迷染佛心又通十方三世束而言之不出十界界界轉現種種相貌故云如許多心是即假也紛紜者眾多也見阿彌陀是即中者如輔行云故此中意但觀自心及所見佛不出法性故見佛心即見己心佛心即是中道不須更置雙非等言。",
        "translation": "The text has two sections. The first section is about the three turns of the mind as in the mysterious mystery, and the ten turns of the mind as in this section.",
        "source": "X20n0359_003:0350a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○從又我心下次番意。",
        "translation": "○Following from this, we will next examine our own mind.",
        "source": "X20n0359_003:0350a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又我心如佛心如者以有我佛如等分別之異所以是即假從不見我心為佛心去是即空也而見阿彌陀是即中也。",
        "translation": "'I mind as the Buddha mind is,' he says, because there's a difference in discriminating self and Buddha as such, that's why it's provisional.",
        "source": "X20n0359_003:0350a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前約所如不異屬空今約能如心佛不同故屬即假故云以有我佛如等是即空者不見即叵得也。",
        "translation": "The former is emptiness in terms of what's thus not different, and the present is hypothesis in terms of the difference between what's thus can be viewed as mind and Buddha.",
        "source": "X20n0359_003:0350a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○又以夢食下次釋喻文。",
        "translation": "○There's also the metaphor of dream food, which is explained next.",
        "source": "X20n0359_003:0350b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以夢食喻之夢食不飽譬即空夢食百味譬即假皆不出法性譬即中餘譬類如此。",
        "translation": "We also use the metaphor of dream food, which is unsatisfied, which is emptiness, and the metaphor of the hundred flavors of dream food, which is false, because they aren't outside of the Dharma nature, which is the middle, and the other metaphors are similar.",
        "source": "X20n0359_003:0350b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然止觀中引於六譬皆喻即假今文乃喻空假中者止觀約合但喻即假今文約離故於即假乃為三夢食不飽喻即空者即覺已腹空也夢食百味喻即假者夢得美食也皆不出法性喻即中者法性即是心法之性也謂夢得百味及覺已腹空此二皆是心性所為耳故云不出法性喻即中也故觀骨中云但是意作也釋籤亦云夢事宛然假也求夢叵得空也夢之心性即中也餘譬類如此者即餘五皆倣此開為三也輔行云夢者心性如境觀如緣想觀成如夢此純約行者合也又法身如境報身如想應身如夢此純約佛境合也又彼佛如境行人如想見佛如夢此約感應合論也三夢皆爾凡起觀想想成見相皆具三想畢竟空中求佛叵得前後二夢明見而不可得中間一夢明不可得而見故初夢云覺已追念不知在何處最後夢云覺已腹空中間夢云不來不往樂事宛然寶等三喻與夢大同寶如能緣心瑠璃如所緣境影現如夢事觀骨鏡像亦復如是若作異者所謂依空而現於假瑠璃如空影現如假無骨如空起光如假淨鏡如空現像如假前三亦具空假二義以帶空心出假故也六喻既皆具於空假豈無即中故今開之以喻三觀良有以也。",
        "translation": "However, the six metaphors cited in stopping and observing are all metaphors that are provisional. The present text is a metaphor for emptiness, provisional, and the middle, which is a combination of stopping and observing, but metaphors that are provisional. The present text is a separation of the three metaphors that are provisional, namely, dream food that is unsatisfied, metaphor that is empty, dream food that has a hundred flavors, metaphor that is provisional, and dream food that has a delicious meal.",
        "source": "X20n0359_003:0350b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次又釋下重釋為二初正釋。",
        "translation": "○Second, we'll explain the following two things: first, we'll explain it directly.",
        "source": "X20n0359_003:0350c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又釋云我心佛心者是假名假名分別我佛之異也我心如佛心如凡聖俱空不得我心不得佛心豈有我心作佛心佛心作我心亡假也不得我心如不得佛心如豈有我心如作佛心如亡空也是為雙亡空假正顯中道而見阿彌陀者雙照二諦也常見佛餘者安不見耶。",
        "translation": "The explanation also says, \"My mind and the Buddha's mind are nominal, nominally discriminated, and the difference between self and Buddha is that my mind is as empty as the Buddha's mind and the minds of mortals and sages alike.",
        "source": "X20n0359_003:0350c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此重釋大意同前但今中觀更加雙亡雙照之言耳假名分別者假也凡聖俱空者空也不得我心下中道雙亡也見阿彌陀是雙照者前雙亡文既云不得故今得見乃是雙照常得見佛既名雙照餘者九界豈可不見而非雙照乎故見我心及我心如等即是見於九界名雙照二諦矣。",
        "translation": "However, this re-explanation has the same general meaning as the previous one, except that nowadays, the middle way is more about the two extinguishing and the two illuminating truths. The nominal discrimination is false, and the emptiness of both worldlings and sages is also the absence of the middle way underneath not getting self-mind. Seeing Amitâbha is a double illumination because the previous statement about double extinction says that it's not possible, so now we can see it's a double illumination.",
        "source": "X20n0359_003:0350c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○此又是下次結示。",
        "translation": "○This is the next conclusion.",
        "source": "X20n0359_003:0350c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此又是證觀心即空即假中之文。",
        "translation": "This is another text that realizes that observing mind is emptiness and the middle of the fake.",
        "source": "X20n0359_003:0350c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結示重釋又是證成觀心三觀之文意也。",
        "translation": "This conclusion and re-explanation is also the realization of the textual meaning of the three contemplations of observing mind.",
        "source": "X20n0359_003:0350c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○觀心即中下三對法類通。",
        "translation": "○Observing the mind as being the middle, the following three pairs of qualities are shared.",
        "source": "X20n0359_003:0350c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀心即中是正因佛性即空是了因佛性即假是緣因佛性。",
        "translation": "The contemplation of mind as middle is the direct cause of buddha-nature, which is emptiness, which is the ultimate cause of buddha-nature, and which is falsehood, which is the conditional cause of buddha-nature.",
        "source": "X20n0359_003:0350c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即是三佛性。",
        "translation": "These are the three buddha-natures.",
        "source": "X20n0359_003:0350c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四是為下釋名。",
        "translation": "○The four are the following explanations of names.",
        "source": "X20n0359_003:0350c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為觀心三佛性是金光明。",
        "translation": "'This is the three buddha-natures of contemplating mind, which are golden light.'",
        "source": "X20n0359_003:0350c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約六即判位。",
        "translation": "○Second, we'll discuss the six immediate stages.",
        "source": "X20n0359_003:0350c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即位如前說。",
        "translation": "The six immediate stages are as explained above.",
        "source": "X20n0359_003:0350c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○復次下重釋文為三初正釋文為四初釋佛性之名。",
        "translation": "The first is a correct explanation of the text, and the first is a fourfold explanation of the name of the buddha-nature.",
        "source": "X20n0359_003:0351a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次佛者覺智也性者理極也能以覺智照其理極境智相稱合而言之名為佛性今觀五陰稱五陰實相名正因佛性觀假名稱假名實相名了因佛性觀諸心數稱心數實相名緣因佛性。",
        "translation": "Furthermore, buddha is the wisdom of awakening, and nature is the ultimate principle that can be illuminated by the wisdom of awakening, and the syllogism of objects and wisdom is called buddha-nature.",
        "source": "X20n0359_003:0351a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孤山破云佛性之名出乎涅槃能仁談之章安疏之荊谿論之皆言因人有果人性故名佛性儻大師於此反經別立章安荊谿亦合指之以申其說既其不爾則後人謬立又何疑哉今謂孤山此破不然四明救此意亦難曉今試辨之涅槃既云一切眾生皆有佛性是故吾祖諸文乃云一切眾生有果人性今文不解一切眾生皆有佛性但是釋於佛性之兩字何得斥為後人謬立況前正釋三佛性云佛名為覺性名不改與今符合那非之淨名疏云言佛道者佛以覺為義道以通達為義所覺之理能通觀智從因達果名之為道以理智雙標故名佛道問若佛是能覺之智道是所覺之理者此非道之理是佛性否答如所問也請詳彼文何得斥此況今雖釋佛性兩字亦不乖於涅槃經云一切眾生皆有佛性何者佛名覺智豈非果人性名理極豈非眾生有果人性果人之性既指生死及以煩惱性名理極豈不然乎故釋籤云理實全指界內生死煩惱是也能以覺智照其理極境智相稱合而言之豈非示令修習名為佛性乎此即次文觀五陰等顯三佛性也次今觀下正明用觀顯三佛性準止觀中正是觀於無記五陰今亦例然觀於五陰契於五陰中道實相名正因性攬於五陰成假名人觀假名人即空叵得名了因性心數非一故名為諸觀諸心數助顯實理名緣因性緣了文中皆言實相者如法華文句云道前真如即是正因道中真如即是緣了文句記云約真之緣了亦名即真之緣了並可云真如緣了今亦例之約實相之緣了亦名即實相之緣了並可云實相緣了故不可見今文三因皆言實相便作三種中道而說(云云)。",
        "translation": "Gushan refutes that the name buddha-nature comes from the Nirvana sūtras, Nengren discusses it, Zhang An comments on it, and Jingqie discusses it.",
        "source": "X20n0359_003:0351a07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○故經云下三引證。",
        "translation": "○Thus, the sūtras say the following three references are proofs.",
        "source": "X20n0359_003:0351b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故經云佛性者不即六法不離六法此之謂也。",
        "translation": "\"Therefore, the sūtra says 'buddha-nature' doesn't refer to the six dharmas and doesn't separate from the six dharmas.",
        "source": "X20n0359_003:0351b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即涅槃經也輔行云此三佛性與計六法不即不離不即故非不離故是理具故是本迷故非言六法者所謂五陰及以神我故大經中引於盲人觸象喻竟即便合云或有說言色是佛性乃至說言我是佛性當知佛性與彼六法不離準止觀意正因不即不離識想緣因不即不離受行及以神我當知六法只是三因故此三因與五陰等不即不離前文觀於五陰實相合為正因今開五陰復加神我以對三因開合雖分意亦何爽。",
        "translation": "That's what the Nirvana Sutra also says in its supplementary text, \"These three buddha-natures and the six imagined dharmas are not immediate, not separate from each other. They are not immediate, therefore not separate from each other, therefore they are complete in principle, therefore they are originally misleading, therefore they don't say the six dharmas are the so-called five aggregates and the soul-self.",
        "source": "X20n0359_003:0351b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀五陰實相故名金觀假名實相故名光觀心數實相故名明。",
        "translation": "He observes the true aspect of the five aggregates and therefore calls it gold, observes the true aspect of nominal names, and therefore calls it light, observes the true aspect of mental numbers, and therefore calls it insight.",
        "source": "X20n0359_003:0351b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約六即判位。",
        "translation": "○Subsequently, we'll discuss the six immediate stages.",
        "source": "X20n0359_003:0351c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即位如前。",
        "translation": "The six immediate stages are as before.",
        "source": "X20n0359_003:0351c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三思得下示重釋意。",
        "translation": "○Trivially, he explains the meaning under \"Thinking about getting it\".",
        "source": "X20n0359_003:0351c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思得此大好故附此後也。",
        "translation": "This is the great merit of thinking about attaining it, so it's appended here.",
        "source": "X20n0359_003:0351c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大師自歎思佛性義得此淵旨深契經意故稱大好所以附此在正釋後故金錍云若是而思之依而觀之(云云)又文句中消文稱大好(云云)。",
        "translation": "The great master praised himself for thinking about the meaning of buddha-nature and attaining this profound meaning that deeply matches the meaning of the sūtras, so he called it great because it's attached to this after the main explanation.",
        "source": "X20n0359_003:0351c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四觀三般若釋名文為二初標。",
        "translation": "○Four contemplations of the three prajñāpāramitā interpretations of the name of the text for the first of two labels.",
        "source": "X20n0359_003:0351c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心三般若金光明者。",
        "translation": "The second is a golden light that observes the three prajñāpāramitās of the mind.",
        "source": "X20n0359_003:0351c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋文為二初正明觀法文為三初總示。",
        "translation": "The next explanation of the text is twofold: the first correctly explains the method of contemplation, and the first three generally show it.",
        "source": "X20n0359_003:0351c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀一念之心即空即假即中即是三般若何者一念心一切心一切心一心非一非一切。",
        "translation": "He observes that a single moment of mindfulness of mind is emptiness, which is provisional, which is the middle, and which is the three prajñāpāramitās: a single moment of mindfulness of mind, all minds, and all minds.",
        "source": "X20n0359_003:0351c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一念心一切心者中也。",
        "translation": "That single moment of mindfulness of mind and all minds is the middle.",
        "source": "X20n0359_003:0351c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次從一念心一切心者下別釋文為三初斥凡夫沈沒有邊。",
        "translation": "○Second, from this single moment of mindfulness of mind, all minds, down to the three separate explanations of the text, the first rebuffs worldlings who sink into the extreme of nonexistence.",
        "source": "X20n0359_003:0351c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一念心一切心者從心生心雜雜沓沓長風駃流不得為喻日夜常生無量百千萬億眾生六道輪迴十二鉤鎻從闇入闇闇無邊際皆心之過也故言一念心一切心是則凡夫所迷沒處。",
        "translation": "A single thought of mind and all minds is a mixed-up, long windy, fast flowing mind that can't be used as a metaphor for the measureless hundreds of thousands of millions of sentient beings who are constantly being reborn day and night in the six destinies, the twelve links of transmigration, darkness, and entering darkness, and the limitlessness of darkness are all faults of the mind.",
        "source": "X20n0359_003:0351c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雜雜者不一也沓沓者眾多也駃(疎吏切)疾也十二鉤鎻者即十二牽連也輔行引增一阿含云佛自看諸比丘病因責諸比丘云汝為何事出家為畏王等為欲捨於十二牽連三世相續故名牽連亦名十二輪展轉不窮如車輪也凡夫沒處者斥於凡夫有生死苦而不見諦故云迷沒若能諦了乃為妙用故屬即假淨名疏云八萬四千煩惱凡夫為之疲勞佛菩薩以為佛事即其例也。",
        "translation": "Mixed\" means not uniform, \"numerous\" means numerous, \"fast\" means fast, and \"twelve hooks and chains\" means twelve tangles, and \"auxiliary practices\" means to quote from the Incremental Āgamas, where the Buddha himself looked at the monks' illnesses and rebuked the monks, saying, \"Why did you leave home, fear the king, etc.?\" In order to abandon the twelve tangles and chains, the continuity of the three worlds is called \"tangles\"; it's also called the twelve wheels that go round and round without exhausting themselves like chariots and wheels.",
        "source": "X20n0359_003:0351c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次從一切心一心下斥二乘沈沒空邊。",
        "translation": "○Second, from the perspective of the single mind of all minds, we reject the two vehicles' sinking into the extreme of emptiness.",
        "source": "X20n0359_003:0352a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切心一心者若能知過生厭皆自持出如小火燒大[卄/積]薪置一小珠澄清巨海能觀心空從心所生一切諸心無不即空故言一切心一心如此一心乃是二乘所迷沒處非究竟道。",
        "translation": "If someone can know that transgressions, births, and disgusts are all self-sustained and produced, they're like a small fire burning a large [twenty/plenty] of wood that holds a small pearl to clarify a huge ocean.",
        "source": "X20n0359_003:0352a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆自持出者此用大經春池之喻故大經中斥三修云汝先修習無常苦等非是真實譬如春時(欲境)有諸人等(放逸者)在大池浴(池喻生死浴喻恚慢)乘船遊戲(乘船諸業也遊戲愛果也)失瑠璃寶沒深水中(失寶無解也入水初教也)是時諸人悉共入水求覓是寶競執瓦礫草木各各自謂得珠歡喜持出乃知非真(求覓如劣三修瓦石如證劣三修各生滅度之想故云歡喜向佛稱歎故云持出乃知非真已去喻其常解意也)已上注文並涅槃疏意(云云)小火小珠皆喻二乘空觀之智也燒大[卄/積](子智切草名也若作積也即委積也)薪澄清巨海並喻二乘知過生厭出三界也二乘沒處非究竟者二乘滯空既是斷無故非究竟若能知此其猶鏡明即妙空也。",
        "translation": "This is because the sutra uses the metaphor of the spring pond to deny the three cultivations, saying, \"Your prior cultivation of impermanence, suffering, and so forth, is not real.\" For example, in the springtime (the desire realm), there are people and so forth (careless people) who bathe in a large lake (the lake is a metaphor for birth-and-death, the bath is a metaphor for anger and conceit), ride in a boat, and play (riding in a boat with all its activities and playing with the fruits of love), lose their lapis lazuli treasures, and are submerged in deep water (losing their treasures and lacking understanding, and entering the water as a preliminary teaching).",
        "source": "X20n0359_003:0352a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三雙亡下顯於中道三一融妙文為三初正明。",
        "translation": "○There are three ways to reveal the middle way under the three and one integration of the mysterious text.",
        "source": "X20n0359_003:0352a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雙亡二邊故煩惱非一非一切大經言依智不依識識但求樂凡夫識妄求樂二乘識求涅槃樂是故雙亡不可依止智則求理如是觀者即是一心三智。",
        "translation": "Because both extinguish the two extremes, affliction is not one and not all, the great scripture says to rely on wisdom, not on consciousness, but to seek happiness.",
        "source": "X20n0359_003:0352a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有無叵得故云雙亡二邊望中皆是煩惱亦如止觀明智障云二智即是中智家障故名智障今亦例然故二邊煩惱體是無明也亡空邊故名為非一亡有邊故名非一切凡夫著有歡喜遊戲名妄求樂二乘知過生厭持出名求涅槃樂是故雙亡則是不可依止兩邊有無二識若依中智則求中理中理融玅三一無妨如是觀者即是一心而達三智也。",
        "translation": "Because existence and nonexistence are illusory, it's called both extinction, and the two extremes are afflictions in the middle of existence and the wisdom hindrance is called the wisdom hindrance because the two kinds of cognition are the middle and the home hindrances.",
        "source": "X20n0359_003:0352a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次即空下對法。",
        "translation": "○Second, that's emptiness and the following is an explanation of the teaching.",
        "source": "X20n0359_003:0352b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即空是觀照般若一切智即假是方便般若道種智即中是實相般若一切種智。",
        "translation": "Namely, emptiness is the omniscience of observing and illuminating prajñā, which is the knowledge of the path of skillful means and the knowledge of the middle way, which is the omniscience of the reality of prajñā.",
        "source": "X20n0359_003:0352b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○是三智下三釋名。",
        "translation": "○These are the three kinds of cognition, and the next three explain their names.",
        "source": "X20n0359_003:0352b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是三智一心中得即空即假即中無前無後不並不後不別甚深微妙最可依止是為觀心三般若金光明。",
        "translation": "These three kinds of wisdom are attained in one mind, namely, emptiness, hypothesis, and middle, without prior or subsequent, not concurrent or subsequent, and not separate, and they are profound, subtle, and most supportable as the three prajñāpāramitās of the contemplating mind.",
        "source": "X20n0359_003:0352b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約六即判位。",
        "translation": "○Subsequently, we'll discuss the six categories.",
        "source": "X20n0359_003:0352b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0352b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○五觀三菩提釋名文為二初標。",
        "translation": "○The five explanations of the name of the meditation on the three bodhisattvas are twofold: first, an indication.",
        "source": "X20n0359_003:0352b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心三菩提金光明者。",
        "translation": "The second is the golden radiance of the three bodhisattvas who contemplate the mind.",
        "source": "X20n0359_003:0352b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋文為二初正明觀法文為三初總示。",
        "translation": "The first one correctly explains the method of contemplation, and the first one generally shows the three.",
        "source": "X20n0359_003:0352b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀一念之心即空即假即中即是三菩提心。",
        "translation": "The first is a general statement that observes that a single moment of mindfulness is the three bodhi mental states of emptiness, hypothesis, and middle.",
        "source": "X20n0359_003:0352b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下別釋文為二初正釋文為三初釋即空發心。",
        "translation": "The first correct explanation of the text is threefold, and the first explains the mind that arouses emptiness.",
        "source": "X20n0359_003:0352b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者一心一切心交橫繚亂如絲如沙如蠶如蛾為苦為惱若知即空真諦菩提心度妄亂心數之眾生通四住之壅是為即空發菩提心即假發菩提心者空雖免妄亂經云空亂意眾生而智亂甚盲闇復是三無為坑是大乘冤鳥未具佛法不應滅愛而取證也若真即假俗諦菩提心度沈空心數之眾生通塵沙之壅分別可不分別時宜分別藥病分別逗會不住無為故言即假發菩提心空是浮心對治假是沈心對治由病故有藥藥存復成病病去藥止宜應兩捨非空非假雙亡二邊即發中道第一義諦菩提心度二邊心數之眾生通無明之壅以不住法住於中道故言即中發菩提心。",
        "translation": "If one knows that the true truth of emptiness is the bodhisattva mind that liberates sentient beings whose minds are deluded and disturbed, and which pass through the congestion of the four abodes, this is the bodhisattva mind that arouses the mind of samādhi even though it's empty and free from deluded confusion.",
        "source": "X20n0359_003:0352b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繚(即鳥切纏繞也又落蕭切諸文或作料字今恐正取落蕭切)絲沙蠶(昨含切)皆喻其多也四住者見為一思為三也心數非一即眾生也次釋即假發心經云空亂意眾生等者止觀引勝鬘經名二乘作空亂意眾生輔行云勝鬘下證二乘人為俗所攝雖謂為空亂故屬俗應知止觀引勝鬘明別教俗諦故斥二乘是俗諦攝故輔行云菩薩之俗二乘謂真今文乃從斥小所證為空亂意為有所亂猶易可化為空智亂最難開示是故名為甚盲暗也故勝鬘云如來藏者身見眾生顛倒眾生空亂意眾生非其境界四明謂空亂意眾生出涅槃經者誤也復是三無為坑者華嚴經云二乘墮於無為深坑又淨名經訶須菩提其施汝者不名福田供養汝者墮三惡道疏云見修無學名三惡道以入無為正位不能發心故也三無為者一虗空二數緣滅三非數緣滅(新云擇滅非擇滅)此三無為一是涅槃二非涅槃今別從涅槃擇滅而說是故斥之耳是大乘冤鳥者輔行引大論云譬如空澤有樹名奢摩棃枝觚廣大眾鳥集宿一鴿後至住一枝上枝觚即時為之而折澤神問言鷳鷲皆能住持何至小鳥便不自勝樹神答言此鳥從我怨家樹來食彼尼俱類樹子來棲我上或當放糞子墮地者惡樹復生為害必大是故懷憂寧捨一枝所全者大菩薩亦爾於諸魔外無如是畏而畏二乘是故二乘於菩薩邊亦如彼鳥壞彼大乘心永滅佛乘心未具佛法不應滅愛而取證者文亦出淨名也分別可不(方久切)世界悉檀也時宜為人藥病對治逗會入理名義照然三釋即中發心有是浮心空是沈心由病故有藥者此喻因於浮沈心故乃有空假之觀也藥存復成病者此喻執於空假復成中觀之障也浮沈之病既去空假之藥應止是故名為宜應兩捨雙亡二邊即不住法也。",
        "translation": "The four abodes are seen as one, thought as three, and the number of minds is not one, that is, sentient beings.",
        "source": "X20n0359_003:0352c10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○次說時下結示。",
        "translation": "○Then it's explained, the following is a concluding statement.",
        "source": "X20n0359_003:0353a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說時如三次第觀即不然一心中三菩提心。",
        "translation": "When it's explained, it's like the three times of sequential contemplation, which is otherwise the three bodhi-mindednesses in one mind.",
        "source": "X20n0359_003:0353a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯圓三。",
        "translation": "It shows the complete three.",
        "source": "X20n0359_003:0353a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若觀下釋名文為二初正釋名。",
        "translation": "First, he correctly explains the name.",
        "source": "X20n0359_003:0353a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀即中是緣金發無上菩提心若觀即空是緣光發清淨菩提心若觀即假是緣明發究竟菩提心。",
        "translation": "If he observes that which is in the middle is contingent on gold and gives rise to the unsurpassed mind of enlightenment, if he observes that which is empty is contingent on light and gives rise to the pure mind of enlightenment, and if he observes that which is provisional is contingent on insight and gives rise to the ultimate mind of enlightenment.",
        "source": "X20n0359_003:0353a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次是為下結示。",
        "translation": "○Second, this is the next section that shows.",
        "source": "X20n0359_003:0353a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為觀心三菩提金光明。",
        "translation": "'This is the golden radiance of the three bodhisattvas who contemplate mind.'",
        "source": "X20n0359_003:0353a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約六即判位。",
        "translation": "○Second, we'll discuss the six immediate categories.",
        "source": "X20n0359_003:0353a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0353b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○六觀三大乘釋名文為二初標。",
        "translation": "○The explanatory text for the six contemplations of the three great vehicles is divided into two, the first indicating.",
        "source": "X20n0359_003:0353b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心三大乘金光明者。",
        "translation": "The second is a golden radiance of the three great vehicles of mindfulness.",
        "source": "X20n0359_003:0353b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋又為二初正明觀法文為三初總示。",
        "translation": "The first correctly explains that the method of contemplation is three-fold: first, it's a general statement.",
        "source": "X20n0359_003:0353b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀一念之心即空即假即中是三大乘。",
        "translation": "The first is a general statement that observes that a single moment of mindfulness of mind as empty, provisional, and intermediate is the three great vehicles.",
        "source": "X20n0359_003:0353b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下別釋文為二初正釋文為三初明所觀之境。",
        "translation": "The first correct explanation of the text is threefold, beginning with an explanation of the object of contemplation.",
        "source": "X20n0359_003:0353b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者雖觀一念心而實有四運此心迴轉不已所謂未念欲念念念已從未念運至欲念從欲念運至念從念運至念已復更起運運運無窮不知休息如閉目在舟不覺其疾。",
        "translation": "Although he observes a mindfulness of mind, there are really four movements of this mind that never end, which are called unmindfulness, desire, mindfulness, and thought.",
        "source": "X20n0359_003:0353b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乘以運載為義故觀三大乘乃以四運為所觀之境也運者動也國語云陸載名運水載名漕(昨到切)止觀云夫心識無形不可見約四相分別謂未念欲念念念已未念名心未起欲念名心欲起念名正緣境住念已名緣境謝若能了達此四即入一相無相(云云)近人不曉定謂觀於四運是唯識觀今謂但是歷境推撿皆是唯識不可一向局於四運豈推自他四性叵得非唯識邪(云云)。",
        "translation": "乘以運載為義故觀三大乘乃以四運為所觀之境也運者動也國語云陸載名運水載名漕(昨到切)止觀云夫心識無形不可見約四相分別謂未念欲念念念已未念名心未起欲念名心欲起念名正緣境住念已名緣境謝若能了達此四即入一相無相(云云)近人不曉定謂觀於四運是唯識觀今謂但是歷境推撿皆是唯識不可一向局於四運豈推自他四性叵得非唯識邪(云云)。",
        "source": "X20n0359_003:0353b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○觀一運心下次明能觀之觀。",
        "translation": "○Observing the one-movement mind next time, we'll explain the contemplation of the contemplation of the contemplation of the contemplation of the contemplation of the contemplation of the contemplation of the contemplation of the contemplation of the contemplation of the one movement.",
        "source": "X20n0359_003:0353b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀一運心即空即假即中一一運心亦復如是從心至心無不即空即假即中是則從三諦運至三諦無不三諦時是名以運運運。",
        "translation": "When contemplating a single transport of mind that's empty, provisional, and middle, each transport of mind is likewise.",
        "source": "X20n0359_003:0353b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀一運心者隨觀一運也觀一運心既然觀餘三運心亦爾故云一一運心亦復如是始從未念終至念已故云從心至心念念三諦故云從三諦運至三諦。",
        "translation": "This is called when the mind is carried from the three truths to the three truths without fail.",
        "source": "X20n0359_003:0353b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若隨下三辨得失。",
        "translation": "○What if the following three statements about gain and loss were made?",
        "source": "X20n0359_003:0353c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若隨四運運入生死若隨三運運入涅槃。",
        "translation": "If he follows the four transports into birth-and-death, or if he follows the three transports into nirvāṇa, then he'll be able to change his name into birth-and-death in sections.",
        "source": "X20n0359_003:0353c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分段變易名為生死寂光妙理即是涅槃言三運者三大乘也。",
        "translation": "Segmental change is called birth-and-death, and the tranquil light and marvelous principle is nirvāṇa.",
        "source": "X20n0359_003:0353c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次即空之觀下對法。",
        "translation": "○Second, this is the contemplation of emptiness followed by the investigation of principles.",
        "source": "X20n0359_003:0353c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即空之觀乘於隨乘運到真諦即假之觀乘於得乘運到俗諦即中之觀乘於理乘運到中諦三乘即一乘是乘微妙清淨第一觀音普賢大人所乘故故名大乘。",
        "translation": "The contemplation vehicle that is emptiness carries the true truth, the contemplation vehicle that is false, the contemplation vehicle that is attained, the contemplation vehicle that is mundane, and the contemplation vehicle that is in the middle, the principle vehicle that carries the middle truth.",
        "source": "X20n0359_003:0353c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三是為下釋名。",
        "translation": "○Three is the next step in explaining the name.",
        "source": "X20n0359_003:0353c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為觀心三大乘金光明。",
        "translation": "\"These are the three great vehicles of contemplation of mind and golden light.",
        "source": "X20n0359_003:0353c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約六即判位。",
        "translation": "○Subsequently, he discerns the stages in terms of the six immediately preceding paragraphs.",
        "source": "X20n0359_003:0353c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0353c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○七觀三身釋名文為二初標次釋文為二初正明觀法文為三初總示。",
        "translation": "The first is to label the seven contemplations of the three bodies, and the second is to explain the names of the two first correct explanations of the contemplations and the three first general explanations of the Dharma.",
        "source": "X20n0359_003:0353c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心三身金光明者諦觀一念心即空即假即中即是三身。",
        "translation": "The next is to observe the mind's three bodies in golden light, which is to truly observe that a single moment of mindfulness is empty, provisional, and intermediate, which are the three bodies.",
        "source": "X20n0359_003:0353c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下別釋文為三初明所觀之境。",
        "translation": "○Next, there are three separate explanations of the text, beginning with a description of the object of contemplation.",
        "source": "X20n0359_003:0353c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者華嚴云心如工畫帥造種種五陰若心緣破戒事即地獄身緣無慚愧憍慢恚怒等即畜生身緣謟曲名聞即餓鬼身緣疾妬諍競即脩羅身緣五戒防五惡即人身緣十善防十惡緣禪定防散亂即天身緣無常苦空空無相願即二乘身緣慈悲六度即菩薩身緣真如實相即佛身登難墜易多緣諸惡身故故知諸身皆由心造譬如大地一能生種種芽。",
        "translation": "If the mind is conditioned by things that break the precepts, that is, the hell body, conditioned by lack of conscience, shame, arrogance, anger, and so forth, that is, the animal body, conditioned by violent fame and reputation, that is, the hungry ghost body, conditioned by feverish competition, that is, the sūla body, conditioned by the five precepts, preventing the five evils, that is, the human body, conditioned by the ten good qualities, preventing the ten evils, conditioned by meditation, preventing distraction, that is, the heavenly body, conditioned by the body of the two vehicles, conditioned by compassion, the six perfections, that is, the bodhisattva body, conditioned by the true reality and characteristics, that is, the Buddha body, which is difficult to fall into and easy to fall into, conditioned by bad bodies.",
        "source": "X20n0359_003:0353c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種五陰不出十界然此十界皆由心造心造有二一理二事具如輔行(云云)緣十善防十惡即欲界天也緣禪定防散亂即色無色界天也緣慈悲六度即菩薩身者須該四教菩薩也登難(平呼)者升出人天難也墜易者沈下四趣易也諸惡身者即四趣身也又登升二乘身難墜下六道身易又登升菩薩身難墜下二乘身易又登升佛身難墜下菩薩身易以諸惡之言通於九界故也四明唯約三界六道而分難易太局促如何消於故知諸身皆由心造空中實相理體無差而常具於俗假諸法方有事用差降不同故云譬如大地一能生種種芽也四明不知空中實相理體無差專談理具俗假差別又復不知諸法事用差降常分同一實相空中理體方乃相即舉一互融遂乃體用混和理事淆亂請有識者微細究尋諸部格言辨其得失。",
        "translation": "The five aggregates of seeds don't exit from the ten realms, but these ten realms are all created by the mind. The mind creates two things, one principle and two things, as shown in the auxiliary practices (clouds), conditioned by the ten good qualities that guard against the ten bad qualities, namely, the desire realm heaven, conditioned by meditation that guard against distraction, namely, the form and formless realm heaven, conditioned by the six perfections of compassion, namely, the bodhisattva body, which is the bodhisattva of the four teachings, ascends the difficult (plaintive) ascending out of the difficulties of humans and gods, and falls into the easy descending into the four lower destinies.",
        "source": "X20n0359_003:0354a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次若觀下明能觀之觀文為三初空觀。",
        "translation": "○Second, if we contemplate, we'll explain the contemplation of the contemplation of the subject.",
        "source": "X20n0359_003:0354a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若觀五受陰洞達空無所有從心所生一切諸身皆空無所有如翻大地草木傾盡故言即空。",
        "translation": "If he observes the five acquired aggregates and penetrates emptiness and nonexistence, then all the bodies that arise from his mind are empty and nonexistent as the earth tumbles down and the grass and trees are tilted out, so he says they are empty.",
        "source": "X20n0359_003:0354a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀五受陰等者語出淨名經訶迦旃延章中彼文具云諸法畢竟不滅是無常義五受陰洞達空無所起是苦義諸法究竟無所有是空義於我無我而不二是無我義法本不然今則無滅是寂義釋籤引疏云約理名五義以智緣理名五行約定名五門禪此五為眾行之旨歸今雖引一文義必兼餘四故此五義結句既乃皆歸四枯故今且引以明空觀枯榮相即非枯非榮空假融妙雙非二邊(云云)言五受者一受有二受無三受雙亦四受雙非五受不受受尚不受況受前四乎洞者通也。",
        "translation": "Contemplating the five acquired aggregates and so forth is a statement from the Sutra of the Pure Names, the chapter on Kātyāyana, and the stationery that says that the ultimate truth that all things don't cease is impermanent, and the five acquired aggregates penetrate emptiness and nothingness, which is the truth of suffering, and the ultimate truth that all things lack existence, which is the truth of emptiness, and the truth that it's not two, which is the truth of selflessness.",
        "source": "X20n0359_003:0354a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若即空下次明假觀。",
        "translation": "○If this is emptiness, the next time he'll explain the contemplation of the provisional.",
        "source": "X20n0359_003:0354b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若即空者永沈灰寂尚不能於一空心能起一身云何能得游戲五道以現其身不能應以佛身得度者為現佛身應以三乘四眾天龍八部種種身得度者皆悉示現同其事業為此失故故言即假同六道身。",
        "translation": "If this is emptiness, then he's permanently sunken into ashes and quiescent, yet he can't give rise to a single body in an empty mind, so how can he attain play in the five destinies to manifest his body? He can't attain salvation with the Buddha's body; he should manifest the Buddha's body with the three vehicles, four multitudes, gods, dragons, and eight kinds of bodies to attain salvation, all of which are manifested in the same way as his career.",
        "source": "X20n0359_003:0354b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遊戲五道以現其身者此用請觀音經意也不能應以佛身等者此用法華經意也不能兩字冠下諸句為此失故等者斥於沈空失於利他也同六道身者四明謂此文誤今謂且約應佛示同人界色身而說佛既同人三乘亦爾是故文中現於佛身及三乘等不乖六道以由四聖同人身故是則普現色身但屬事用所收耳普現色身既是事用性善性惡豈非妙假性惡若斷普現色身自何而立忽都未聞性惡之名安能信有性德之行皆此之謂也言遊戲者神通遊戲也大論問云神通所作何名遊戲答猶如幻師種種變現菩薩亦爾故名為戲又問菩薩但當出生三昧何須遊戲答菩薩心已出生三昧欣樂出入亦名遊戲既不同於結使遊樂欣樂出入即是出假又三三昧中空名為上諸餘行法皆名為下下如兒戲故名遊戲也。",
        "translation": "This is the meaning of the Avalokitêśvara Sutra, which invokes the meaning of the Buddha's body, and this is the meaning of the Lotus Sutra, which rejects the idea that Shen Kong has lost the benefit of others because he can't use the two words to describe the following phrases.",
        "source": "X20n0359_003:0354b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三如此下明中觀。",
        "translation": "○3. This is the next step in understanding the contemplation of the middle.",
        "source": "X20n0359_003:0354c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此觀身墜在二邊非善觀身善觀身者大經云不得身八尺之形也不得身相五胞形也不得身因飲食將養也不得身果酬五戒也不得身聚陰入界也不得身一假實成身不得身二四大成身也不得身此已一身也不得身彼彼遺體也不得身識念念無常也不得身等身中空也六道皆等有身也不得身修依身能脩法也不得脩者即行人也亦不得身如身相如乃至身脩如脩者如亦不得身性身相性乃至身脩性脩者性畢竟清淨為此義故故言即中。",
        "translation": "Such observation of the body falling into two extremes is not good observation of the body.",
        "source": "X20n0359_003:0354c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先斥空假故云如此觀身墜在二邊非善觀身若能觀身達身實相乃名中道即善觀身引大經云不得身等者即非假也次從亦不得身如下即非空也如即是空故也次從亦不得身性下即是亡中也何者對邊說中邊既叵得中亦不存又復今文非但亡於空假二邊亦乃亡於離邊之中方成妙中所引大經云不得身等者師子吼品云善男子第一義中若見身身相身因身果身聚身一身二此身彼身身滅身等身修修者若有如是見者名不修身章安云身者八尺也身相者五包也(今即文作胞胞胎耳)身因者飯食等也身果者過去五戒感身為果也身聚者色陰聚也身一者總彼假實合成一身也身二者四大和合所得也此身者自身也他身者彼身又此身者業力所得也他身者即遺體也身滅者念念不住也身等者有人觀身與虗空等也又言六道各有身故言等也身修者即所修之法也修者者即能修之人也今文之中皆云不得者經中既云第一義中若見見等名不修身當知即是中道亡於有邊方名修身不見即是不得不得即是善觀也今云不得身識者識字誤也應作滅字餘文對消亦應可解亦不得身如等乃是今家約義例說耳何者既不得身等是亡假亦不得身如等是亡空及不得身性等是亡中如是方見三觀圓玅顯秘密藏以明三身耳。",
        "translation": "The first rejects emptiness and falsity, so it says that to observe the body in this way and fall into two extremes is not a good observation of the body. If one can observe the body and reach its true characteristics, then it's called the middle way, which is a good observation of the body.",
        "source": "X20n0359_003:0354c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○言即中下三對法。",
        "translation": "○The words namely, the middle and the following three pairs of dharmas.",
        "source": "X20n0359_003:0355a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言即中者即是法身即空者即是報身即假者即是應身。",
        "translation": "That which is said to be in the middle is the Dharma body, that which is empty is the reward body, and that which is nominal is the response body.",
        "source": "X20n0359_003:0355a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○是名下三釋名。",
        "translation": "○This is called the next three explanations of name.",
        "source": "X20n0359_003:0355a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名觀心三身金光明。",
        "translation": "'This is called the golden radiance of the three bodies of the contemplating mind.'",
        "source": "X20n0359_003:0355a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約六即判位。",
        "translation": "○Second, we'll discuss the six categories.",
        "source": "X20n0359_003:0355a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0355a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○八觀三涅槃釋名文為二初標。",
        "translation": "○The eight explanations of the name of the contemplation of the three nirvāṇas are labeled first by two.",
        "source": "X20n0359_003:0355a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心三涅槃金光明者。",
        "translation": "The second is a golden radiance that observes the three nirvāṇas in the mind.",
        "source": "X20n0359_003:0355a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋文為三初正明觀法。",
        "translation": "○Subsequent to the explanation, the text is divided into three. First, it correctly explains the method of contemplation.",
        "source": "X20n0359_003:0355a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀心性本來寂滅不染不淨染故名生淨故名滅生滅不能毀故常不能染故淨不能礙故我不能受故樂是為性淨涅槃若妄念心起悉以正觀觀之令此正觀與法性相應妄念不能染不能毀不能礙不能受常樂我淨者即是圓淨涅槃又以正觀觀諸心數心數法不行心數法不能染不能礙不能受者名方便淨涅槃。",
        "translation": "If the mind nature is originally quiescent, undefiled, and impure, defiled is called birth, and pure is called cessation.",
        "source": "X20n0359_003:0355a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次是名下釋名。",
        "translation": "○Second, this is called the following, which explains the name.",
        "source": "X20n0359_003:0355b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名觀心三涅槃金光明。",
        "translation": "\"These are called the three contemplations of mind and nirvāṇa in golden light.",
        "source": "X20n0359_003:0355b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三約六即判位。",
        "translation": "○There are about six of the three, which are the judgmental stages.",
        "source": "X20n0359_003:0355b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0355b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○九觀三寶釋名文為二初標。",
        "translation": "○There are two explanations of the name of the nine contemplations of the Three Treasures, the first of which is an indication.",
        "source": "X20n0359_003:0355b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心三寶金光明者。",
        "translation": "The second is to contemplate the mind's three treasures in their golden radiance.",
        "source": "X20n0359_003:0355b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋文為二初正釋次重釋初又為二初正明觀法文為三初總舉。",
        "translation": "The first is a correct explanation, and the second is a re-explanation.",
        "source": "X20n0359_003:0355b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀一念之心即空即假即中即是三寶。",
        "translation": "The first is to truly observe that a single moment of mindfulness is the Three Treasures, which are emptiness, the conventional, and the middle.",
        "source": "X20n0359_003:0355b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下別釋文為二初依經略立。",
        "translation": "The first is a brief explanation based on the sūtras.",
        "source": "X20n0359_003:0355b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者不覺名法寶覺名佛寶和名僧寶。",
        "translation": "\"What is it that's not perceived and called the Dharma treasure, that's perceived and called the Buddha treasure, and that's called the Saṃgha treasure?",
        "source": "X20n0359_003:0355b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃經中迦葉難云涅槃佛性決定如來是一義者云何說言有三歸依佛言有法名一義異名義俱異佛常法常比丘僧常涅槃虗空皆亦如是是名名一義異名義俱異者佛名為覺法名不覺僧名和合涅槃名解脫虗空名非善亦名無礙如來或時說三為一說一為三如是之義是佛境界非二乘所知法據性德不動是故法名彰不覺之義佛約修成智契所以佛名召覺知之義和名僧寶其意可解此三名義雖則暫分而其理體亦何永異差即無差三寶體同佛即是法法即是眾豈可條然故不可見說一為三便謂此三乖於一也。",
        "translation": "In the Nirvana Sutra, Kāśyapa said, \"The Buddha-nature of Nirvana is determined, and the Tathāgata is one in meaning.\" How does he say there are three things to take refuge in when the Buddha says there's a Dharma-name that's one in meaning and different in name and both in name and meaning, and the Buddha is permanent, the Dharma-name is permanent, the monks are permanent, and the Nirvana-name-saṃgata is permanent, and the names are likewise.",
        "source": "X20n0359_003:0355b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次三諦之理下約義正釋文為二初正釋三諦。",
        "translation": "○Second, the principle of the three truths is explained correctly by focusing on the meaning of the text in two ways.",
        "source": "X20n0359_003:0355c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三諦之理不覺故是法寶三諦之智能覺故是佛寶三諦三智相應和故是僧寶無諦智不發。",
        "translation": "Because the principle of the three truths isn't perceived, it's the Dharma treasure, the wisdom of the three truths that's perceived, and because the three wisdoms of the three truths are associated, it's the Saṃgha treasure, and because the wisdom of the lack of truths doesn't arise.",
        "source": "X20n0359_003:0355c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三智及相應者經文從合今釋從離離合融妙方名秘密。",
        "translation": "The three kinds of wisdom and their concomitance are explained in the sūtras from the combination and now from the separation, isolation, and confluence of the three noble truths.",
        "source": "X20n0359_003:0355c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次無諦下明所以智由境起。",
        "translation": "○Subsequently, it's explained below the absence of the truth that knowledge therefore arises from objects.",
        "source": "X20n0359_003:0355c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諦智不發無智諦不顯諦智不和不能大用利益眾生。",
        "translation": "Without knowledge of the truths, it's not arisen, and without knowledge of the truths, they aren't revealed.",
        "source": "X20n0359_003:0355c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故無諦智不能發諦由智明是故無智諦不能顯境智相冥方有大用是故不和則無利益。",
        "translation": "Therefore, cognition of the absence of truth can't arise, and truth is informed by cognition. Therefore, cognition of the absence of truth can't reveal the fact that only when the objects and cognition are in harmony can there be great function.",
        "source": "X20n0359_003:0355c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三種下三結示。",
        "translation": "○There are three kinds of conclusions below.",
        "source": "X20n0359_003:0355c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三種皆可尊可重是故俱稱為寶。",
        "translation": "\"All three kinds can be honored and valued, so they're all called treasures.",
        "source": "X20n0359_003:0355c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○六即下次判位。",
        "translation": "○Six is the next stage of discernment.",
        "source": "X20n0359_003:0355c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0355c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○復次下次重釋者然此重釋與前正釋但是開合何者前云三諦之理不覺是法寶者合三理之理為一法寶也今云中諦不覺名法寶真諦不覺名佛寶俗諦不覺名僧寶者開三諦之理為三寶也即法寶之上自具三寶也三諦法寶開三既然三智佛寶諦智僧寶開三例爾孤山不曉乃以佛陀翻覺致詰且文句云懺者鑑也何不引於梵語懺摩此翻悔過而為難邪況初正釋文中自云覺名佛寶豈非佛陀翻為覺乎又金錍云世人共迷法相名異體一故真如隨緣即佛性隨緣佛之一字即法佛也不聞以華梵致詰況不覺無覺法性不成覺無不覺佛性寧立又淨名疏中初文乃以法身為法寶報身為佛寶應身為僧寶次文又乃各開為三初於法佛開為三者法性是佛之師名法寶法性寂而常照名佛寶照與性和名僧寶此即法身之上辨其三寶也次報佛辨三寶者智照即佛寶圓照之法即法寶此二和即僧寶次於應佛辨三寶者照機不失即佛寶為物之軌即法寶與物和光即僧寶復總結云三寶之上凡十二寶未曾有異此與今文初科正釋次科重釋文意離合那不思之於中為三初正釋又為三初約三諦釋。",
        "translation": "Furthermore, since the principle of the three truths is not perceived as the Dharma treasure, the true truth is not perceived as the Buddha treasure, and the conventional truth is not perceived as the saṃgha treasure, it opens up the principle of the three truths as the three treasures, which are self-contained above the Dharma treasure as the three treasures, and since the Dharma treasure of the three truths opens up the three since the Buddha treasure of the three kinds of wisdom and the saṃgha treasure of the three kinds of wisdom, Gushan doesn't know how to translate Buddha's name into \"perception\" and the text says, \"Repentance\" (kanaka).",
        "source": "X20n0359_003:0355c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次中諦不覺名法寶真諦不覺名佛寶俗諦不覺名僧寶。",
        "translation": "Second, the middle truth is not perceived as the Dharma treasure, and the true truth is not perceived as the Buddha treasure, and the conventional truth is not perceived as the saṃgha treasure.",
        "source": "X20n0359_003:0356a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○知即中下次約三智釋。",
        "translation": "○Knowing that which is in the middle is next interpreted in terms of the three kinds of cognition.",
        "source": "X20n0359_003:0356a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知即中離二邊名法寶知即空名佛寶知即假名僧寶。",
        "translation": "Knowing that is, the middle is free of the two extremes and is called the Dharma treasure Knowing that is, emptiness is called the Buddha treasure Knowing that is, hypothesis is called the saṃgha treasure.",
        "source": "X20n0359_003:0356a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知即是智故也。",
        "translation": "Knowing that is is called wisdom.",
        "source": "X20n0359_003:0356a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○即中事理下三約諦智和合釋。",
        "translation": "○That is, in the middle, things and principles are interpreted in the context of the convergence of the three cognitions of truth.",
        "source": "X20n0359_003:0356a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即中事理和名法寶即空事理和名佛寶即假事理和名僧寶。",
        "translation": "That is, the middle way and principle are harmonized as the treasure of the Dharma, that is, the emptiness way and principle are harmonized as the Buddha's treasure, and that is, the nominal way and principle are harmonized as the Saṃgha's treasure.",
        "source": "X20n0359_003:0356a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦智既得各通三寶是故諦智亦可和合共通三寶何者性德三諦名之為理修德三智名之為事境智既合理事乃和故以境智理事和合而釋三寶。",
        "translation": "Since each of the truths and wisdoms can share the Three Treasures, it follows that the truths and wisdoms can be combined to share the Three Treasures.",
        "source": "X20n0359_003:0356a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次即中名為下釋名文為二初正釋。",
        "translation": "○Second, that is, the middle name is the next explanation of the words of the name.",
        "source": "X20n0359_003:0356b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即中名為金即空名為光即假名為明。",
        "translation": "That's the middle name for gold, that's the name for emptiness, that's the name for light, and that's the name for hypothesis, and that's the name for insight.",
        "source": "X20n0359_003:0356b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次是為下結示。",
        "translation": "○Second, it's the following conclusion.",
        "source": "X20n0359_003:0356b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為觀心三寶金光明。",
        "translation": "'This is the golden radiance of the mind's contemplation of the three treasures.'",
        "source": "X20n0359_003:0356b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三六即下判位。",
        "translation": "○Three, six, and so on, are the next stages of the explanation.",
        "source": "X20n0359_003:0356b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0356b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○十觀三德釋名文為二初標。",
        "translation": "○Ten views of the three virtues are explained in the text of the two first labels.",
        "source": "X20n0359_003:0356b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心三德金光明者。",
        "translation": "\"He who views the mind's three virtues in golden light.",
        "source": "X20n0359_003:0356b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次諦觀下釋文為二初正明觀法文為三初正釋文為二初明三觀即三德文為二初正明。",
        "translation": "The first two are the correct explanation, the first is to explain the text of the three contemplations, and the second is to explain the text of the three virtues.",
        "source": "X20n0359_003:0356b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦觀一念之心即空即假即中即空故一空一切空無假無中而不空空無積聚而名為藏藏具足故名之為德即假故一假一切假無空無中而不假假攝諸法亦名為藏藏具足故名之為德即中故一中一切中無空無假而不中中攝一切法亦名為藏藏具足故稱之為德。",
        "translation": "The mind that observes a single thought is emptiness, which is false, which is in the middle, which is empty, so the one empty, all empty, is without falsehood, without being in the middle, but not empty.",
        "source": "X20n0359_003:0356b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空無積聚名為藏者空如來藏也假攝諸法名為藏者不空如來藏也中攝一切亦名藏者雙照含融無有缺減也。",
        "translation": "That's called the store that's empty and lacks accumulation, and that's called the store that's empty of the Tathāgata's store and that's called the store that's not empty of the Tathāgata's store that collects all things in the middle and is also called the store that's both illuminating and integrating without any loss.",
        "source": "X20n0359_003:0356b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次雖言下融通。",
        "translation": "○Second, although it's said that the following is an integration.",
        "source": "X20n0359_003:0356b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖言一中有無量無量中有一了彼互生起展轉生非實智者無所畏當知一不為少眾不為多非一非多不失一多不可思議不縱不橫不並不別。",
        "translation": "Although it's said that there's an infinite amount in one, there's one in an infinite amount, and it's understood that they are mutually produced, evolve, and arise. Those who don't really know have no fear when they realize that one isn't few, many isn't many, and neither one nor many is lost, and one or more is inconceivable, not vertical, not horizontal, not parallel, and not separate.",
        "source": "X20n0359_003:0356b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉一具三故言一中有無量舉三即一故言無量中有一雖有三一而非三一故言了彼互生起展轉生非實聞立三一而不欣喜聞非三一而不驚怖方名智者無所畏也一具無量故云一不為少無量即一故云眾不為多非一非多不失一多即是非三非一而三而一也如此說者乃得名為不可思議不縱不橫不並不別矣。",
        "translation": "Although there are three and one, it's said that there's one in the immeasurable, and although there are three and one, they aren't three and one, so it's said that understanding their mutual birth, arising, and transmigration, isn't real.",
        "source": "X20n0359_003:0356b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次諸佛下結示。",
        "translation": "○Next, the buddhas are shown in conclusion.",
        "source": "X20n0359_003:0356c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛以即中為體故名法身以即空為命故名般若以即假為力故名解脫一一皆常樂我淨無有缺減故稱三德。",
        "translation": "The buddhas are called Dharma body because they are the essence of the middle, prajñā because they are the life of the emptiness, and liberation because they are the power of the conventional, and each of them is always happy, self-pure, and has nothing missing or minus.",
        "source": "X20n0359_003:0356c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "體同三觀體同三德故也三德圓玅名秘密藏耳。",
        "translation": "Because their essence is the same as the three contemplations, their essence is the same as the three virtues, and the three virtues are perfectly complete, which is called the secret store.",
        "source": "X20n0359_003:0356c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○故淨名下次引證文為二初引文。",
        "translation": "○So the next citation from Jingming proves that there are two texts, the first citing the text.",
        "source": "X20n0359_003:0356c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故淨名云諸佛解脫當於一切眾生心行中求。",
        "translation": "\"Therefore, Jingming says that the liberation of the buddhas should be sought in the minds and actions of all sentient beings.",
        "source": "X20n0359_003:0356c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次當知下明無差別。",
        "translation": "○Second, you should know that the following explains that there are no distinctions.",
        "source": "X20n0359_003:0356c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知我心亦然眾生亦然彼我既然諸佛亦然心佛及眾生是三無差別。",
        "translation": "You should know that my mind is also like that, sentient beings are also like that, and since the buddhas are also like that, the minds of buddhas and sentient beings are three without distinctions.",
        "source": "X20n0359_003:0356c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以華嚴三無差別以通淨名經意耳。",
        "translation": "This is the meaning of the Huayan Sutra on the Three Non-differences in order to explain the meaning of the Pure Land Sutra.",
        "source": "X20n0359_003:0356c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○得此下三釋名文為二初正釋。",
        "translation": "○Obtaining this, the following three explanations of the name are two.",
        "source": "X20n0359_003:0356c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得此意者即中是金即空是光即假是明。",
        "translation": "\"Attaining this meaning means that what's in is gold, what's empty, what's luminous, and what's provisional is clear.",
        "source": "X20n0359_003:0356c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○此為下次結示。",
        "translation": "○This is the next concluding statement.",
        "source": "X20n0359_003:0356c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此為觀心三德金光明。",
        "translation": "'This is the golden light of the three virtues of the contemplative mind.'",
        "source": "X20n0359_003:0356c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○六即下次判位。",
        "translation": "○Six is the next stage of discernment.",
        "source": "X20n0359_003:0356c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六即如前。",
        "translation": "The six are as before.",
        "source": "X20n0359_003:0356c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○世間有行空人下次斥謬方為三初敘謬。",
        "translation": "○There are people in the world who practice emptiness, and the next time they deny the fallacy in order to describe the three first fallacies.",
        "source": "X20n0359_003:0356c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世間有行空人執其癡空不與佛修多羅合聞此觀心而作難言若觀心是法身應觸處平等何故於經像生敬紙木生慢敬慢既異則非平等非平等故法身義不成既無平等平等智不成則無報身不能將此化他應身義不成不如我於經像紙木平等平等皆如如名法身有此平等智是報身將此智化他是應我三身義皆成用汝觀心何為。",
        "translation": "In the world, there are people who practice emptiness who cling to their delusion about emptiness and don't cooperate with the buddhas and sūtra when they hear this contemplation of mind and make difficult statements, saying, \"If this contemplation of mind is the equality of the Dharma body and the range of contact, why is it that respect arises from sūtra images, paper and wood, and conceit arises from conceit?\" Since conceit is different, it's not equal and not equal, so the meaning of the Dharma body isn't realized.",
        "source": "X20n0359_003:0356c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止觀亦云淮河之北有行大乘空人無禁捉蛇者今當說之其先師於善法作觀經久不徹放心向惡法作觀獲少定心薄生空解不識根緣不達佛意純將此法一向教他盲無眼者不別是非根鈍惑重聞其所說皆悉信受乃至云今人只謂捨惡取空是大乘空此空尚不免六十二見單複之惡何能動出設借為乘只是禿乘無法門具度正法大城金剛寶藏具足無缺何所而無豈容禿空而已若但爾者乘邪見乘入險惡道是壞驢車耳。",
        "translation": "Zhiguan also says that there's a practitioner of great vehicle emptiness north of the Huaihe River who can't help but catch snakes. I will now explain that his former teacher observed good qualities for a long time without thoroughly relieving himself, observed bad qualities for a short time, attained little concentration, had little understanding of emptiness, wasn't aware of the faculties and conditions, didn't understand the Buddha's intention, and simply taught this Dharma to others who are blind and have no eyes and don't discern right from wrong.",
        "source": "X20n0359_003:0357a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次若逢下斥非。",
        "translation": "○Second, if he encounters this, he'll deny it.",
        "source": "X20n0359_003:0357a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若逢此難者當以三事反難答之一者汝謂於紙木經像平等為如者何意於七廟敬木像天子符勅而生畏敬於佛經像而生輕慢畏慢既起諸使沸亂何處有平等法身義耶二者汝於同師同學生愛生護於異師異學生慢生恚愛慢從癡生三毒熾然諸惡更甚寧復有智慧報身耶三者汝耽癡空無慧方便尚不悅人情況會至理矜高自著是增上慢人汝師所墮汝亦隨墮毒氣深入若為將此邪氣化他和光應身復在何處。",
        "translation": "If you encounter this difficulty, you should answer it with three counter-objections. First, do you think it's true that the equality of paper and wooden sūtra images is based on what do you mean when you venerate wooden images in seven temples, become fearful and respectful because of the gods' commands, and become arrogant and conceited because of the images of Buddha sūtras? Second, when you love and protect the same teacher and students, and when you love and protect different teachers and students, conceit arises from anger and conceit arises from delusion, and the three poisons are blazing, and the evils are even worse.",
        "source": "X20n0359_003:0357a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三事反難者他人既以法身報身應身三事不成為難而執平等三身皆成故今亦以三事反詰有敬不敬平等不成文皆可解言七廟者禮記王制云天子七廟三昭(常遙切)三穆與太祖之廟七(此周制七者太祖及文王武王之祧與親廟四太祖后稷殷則六廟契及湯與二昭二穆夏則五廟無太祖禹與二昭二穆而已)諸侯五廟二昭二穆與太祖之廟而五大夫三廟一昭一穆與太祖之廟而三(太祖別子始爵者太傅云別子為祖謂此雖非別子始爵者亦然)士一廟(謂諸侯之中士下士名曰官師者上士二廟)庶人祭於寢(寢適寢也)符勑者漢制以竹長六寸分而相合謂之符也符者信也勑者正也王言發下正於羣臣無敢違者沸(方昧切)者涌也耽(亦作耽下含切)樂也癡空者頑空也無智照了故也故下即云無慧方便此借淨名經意斥之耳故彼經云無方便慧縛即愛見大悲成就眾生也無慧方便縛即住三毒而植德本也尚不悅人情者以住貪瞋邪見故也矜(居陵切)者自賢也高者不下於人也自著(陟慮切)者自大也自立也自明也自處也增上慢者三身妙義是增上法汝今未得而便謂得自恃陵他非增上慢更指何邪汝師所墮汝亦隨墮者此用淨名訶須菩提意而斥之耳毒氣深入者用法華經意而斥之耳。",
        "translation": "Since others regard the failure to realize the three things of the Dharma body, the reward body, and the response body as a difficulty, and they hold to equality in the accomplishment of all three bodies, now we also use the three things to counter-question the lack of reverence and irreverence, and the lack of accomplishment of equality in the text, all of which can be interpreted.",
        "source": "X20n0359_003:0357b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三我以下顯今正意。",
        "translation": "○3. Here's what I mean when I explain the present.",
        "source": "X20n0359_003:0357b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以凡夫位中觀如實相爾為欲開顯此實相恭敬經像令慧不縛使無量人崇善去惡令方便不縛豈與汝同耶。",
        "translation": "I observe true characteristics as they are in the state of a worldling, so I want to reveal these true characteristics, venerate sūtras and images so that wisdom isn't fettered, and cause measureless people to revere goodness and abandon evil so that skillful means aren't fettered, aren't I the same as you?",
        "source": "X20n0359_003:0357b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫位中觀如實相等者始從名字內修玅觀入於外凡初隨喜品為欲開顯此實相故外則恭敬經卷聖像內外相應也令慧不縛者即淨名經云有方便慧解也謂不以愛見心莊嚴佛土成就眾生於空無相無作法中以自調伏也使無量人崇善去惡令方便不縛者即淨名經云有慧方便解也謂離三毒而植德本迴向菩提也如此豈可與汝無慧方便縛無方便慧縛是同邪。",
        "translation": "This is the first stage of observing true characteristics in the worldling's stage, which begins with cultivating subtle contemplation within names and enters the outer world. The first stage of following joy is to reveal these true characteristics, so the outer world venerates the image of the scripture scroll as a symbol of holiness that corresponds with the inner and outer worlds.",
        "source": "X20n0359_003:0357c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次更釋帝王二字文為二初標。",
        "translation": "○Second, let's further explain the two words for emperor, which are labeled first of two.",
        "source": "X20n0359_003:0357c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今更釋帝王者。",
        "translation": "\"Now, let's further explain the word emperor.",
        "source": "X20n0359_003:0357c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "孤山破云此文唯釋讖本三字而今反用真諦立題帝王兩字又於帝王兩字之間擅加慧字(云云)今謂不然前文既云漢人好略譯者省之若依經文有經王之義說與不說俱亦無妨故今雖是釋於讖本別題三字而更釋於帝王兩字一則順於翻譯周悉二乃順於經文有經王之義亦何所乖邪若謂於其兩字中間擅加慧字且如文句加人人不信一句釋犯妄戒及法華疏加四伏難等何不責其擅添邪若謂今釋讖本題目而不得用真諦翻者且今玄義及文句中那忽數引新本之文況今所釋帝慧王義與夫義淨重譯此經名最勝王宛然懸合若責今為非則義淨亦失也。",
        "translation": "Gushan refutes the claim that this text only interprets the three words of the Kanben and now uses the true truth to establish the title of the two words emperor and adds the word wisdom between the two words emperor (clouds).",
        "source": "X20n0359_003:0357c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋文為二初約教義釋又為二初敘真諦釋。",
        "translation": "The first one is an interpretation of the doctrine, and the second one is an interpretation of the true truth.",
        "source": "X20n0359_003:0357c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真諦三藏云法身攝華嚴華嚴以法身為體故報身攝般若般若明智慧故應身攝涅槃涅槃明百句解脫四德等故此是彼師明帝王統攝之義。",
        "translation": "The Tripiṭaka of the True Truth says that the Dharma body includes the Huayan and the Huayan takes the Dharma body as its body, so the reward body includes Prajñāparin, Prajñāparin teaches wisdom, so the response body includes Nirvana, and Nirvana teaches the four virtues of liberation in a hundred sentences.",
        "source": "X20n0359_003:0358a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃明百句解脫者章安云相傳有百句招提云就頭首數止有八十四五若大小合數有九十七八極細為言有一百餘但一百是數之圓名故言百句例如大品百波羅蜜唯有九十古來未見釋此百句唯真諦三藏一卷義記略不可解天台大師曾於靈石一夏釋此百句解脫一句之中皆作百句凡萬法門先學自飽而不錄之今無以傳惜哉惜哉後代無聞此是彼師明帝王統攝之義者若準文句斥於真諦解經王義是故此中亦應破云作此偏說無智之人於諸經起慢此義不可何者華嚴豈容單有法身而無報應乃至涅槃豈應單有解脫而無法身及以般若。",
        "translation": "Nirvana clearly has one hundred phrases of liberation,\" Zhang An said, \"It is transmitted that there are one hundred phrases,\" and Zodhi said, \"In terms of the number of heads, there are only eighty-four and five, and if the number of sizes combined is ninety-seven and eight, it is extremely subtle to say that there are one hundred others, but one hundred is the full name of the number, so it is called one hundred phrases.",
        "source": "X20n0359_003:0358a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次明今家釋文為四初正釋。",
        "translation": "○Second, we'll explain the four interpretations of the present teaching.",
        "source": "X20n0359_003:0358a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今明帝王應具三義謂帝慧王也帝則貴極至尊至重慧則神謀聖策王則萬國朝會備此三義稱帝慧王。",
        "translation": "Now, we'll explain that an emperor should have three meanings, namely, emperor and wisdom king. emperor is noble, most honored, most revered, and wisdom is divine counsel, noble strategy, and king is the congregation of myriad countries.",
        "source": "X20n0359_003:0358a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法華疏云一切漸頓諸經無不稱所詮之處為經王當機益物興廢有時部部不同名之為國皆言第一即是王今經既是第三方等故知乃是漸中經王故此經王具帝慧王法性之理更無過上名為貴極至尊至重法性之理寂而常照是故名為神謀聖策稱性而鑑名為神謀神名天心謀謂智略聖亦是神策亦是謀聞聲知情即是神聖籌策謀略法性之理多所利益是故能令萬國朝會朝會良由統王故也是故當知只一性理具足三義所以名為帝慧王也。",
        "translation": "According to the Fahua Commentary, all gradual and sudden sūtras don't fail to call what's explained the king of the scriptures when the situation is beneficial, things arise and fall apart, and each section is called a state.",
        "source": "X20n0359_003:0358a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次此經下舉經義證成。",
        "translation": "○Second, this sūtra presents the meaning of the sūtra to confirm its completion.",
        "source": "X20n0359_003:0358b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經亦爾如來游於無量甚深法性過諸菩薩所行清淨即是至尊極貴義若有聞者則能思惟無上甚深微玅之義開甘露門入甘露城處甘露室令諸眾生食甘露味以智慧刀裂煩惱網即是聖智雄略義諸佛護持莊嚴菩薩諸天恭敬護世讚嘆能令地獄諸河焦乾乃至一切世間未曾有事悉具出現即是萬國朝會多致利益義。",
        "translation": "This sūtra also shows that the Tathāgata travels around measureless and profound dharmas that are purified beyond what the bodhisattvas do, which is the most honored and noble meaning. If anyone hears it, they'll be able to contemplate the unsurpassed, profound, and subtle meaning of opening the ambrosial gate, entering the ambrosial city, and staying in the ambrosial abode so that sentient beings will eat the taste of ambrosia and split the web of affliction with the sword of wisdom, which is the noble and majestic meaning of wisdom.",
        "source": "X20n0359_003:0358b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今經別題雖但三字而新本中更有兩字今既於其新本兩字加其慧字恐人不信故引讖本此經為證令人生信是佛語故故前文云若依經文有經王之義也。",
        "translation": "Although the special title of this sūtra is only three words, the new version has two more. Now, since the word wisdom is added to the two words of the new version, it's feared that people won't believe it, so the sūtra is cited as proof that people will become convinced that it's the words of the Buddha.",
        "source": "X20n0359_003:0358b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三將此下類通十法。",
        "translation": "○3. Here are the next ten categories and ten dharmas.",
        "source": "X20n0359_003:0358b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將此三義歷十種三法門苦道即法身是貴義煩惱即般若是慧義業即解脫是朝會義乃至法身德即貴義般若德即慧義解脫德即朝會義一一法門悉備三義一一法門皆是經王也。",
        "translation": "By combining these three meanings, there are ten kinds of three dharmas in which the path of suffering, which is the Dharma body, is the noble meaning, affliction, which is prajñā, which is the meaning of wisdom, karma, which is liberation, which is the meaning of the assembly, and even the merit of the Dharma body, which is the noble meaning, the merit of prajñā, which is the meaning of wisdom, and the merit of liberation, which is the meaning of the assembly.",
        "source": "X20n0359_003:0358b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四既得下廣論攝法文為三初標列。",
        "translation": "○4. Having attained this, the following discussion of the methods for gathering dharmas is divided into three categories.",
        "source": "X20n0359_003:0358b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得此意即論攝法攝法有三先攝法門次攝經教三攝六即位。",
        "translation": "Having obtained this idea, that is, the discussion of the methods of gathering dharmas, there are three ways to gather dharmas, the second way to gather the teachings of the sutras, and the third way to gather the six immediate stages.",
        "source": "X20n0359_003:0358b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次初攝下解釋文為三初釋攝法門。",
        "translation": "The first is to gather the text and explain it in three ways.",
        "source": "X20n0359_003:0358b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初攝法門者三道攝一切惑三識攝一切解三佛性攝一切因三般若攝一切智三菩提攝一切發心之行三大乘攝一切發趣之位三身攝一切佛果智德三涅槃攝一切佛果斷德三寶攝一切佛恩德三德攝一切理是為橫攝法門。",
        "translation": "The first gathering the Dharma-gate is the three paths that gather all the afflictions, three consciousnesses that gather all the understandings, three buddha-natures that gather all the causes, three prajñā that gather all the cognitions, three bodhisattvas that gather all the practices of the arisen mind, three great vehicles that gather all the stages of the arisen destinies, three bodies that gather all the Buddha-fruit wisdom virtues, three nirvāṇas that gather all the Buddha-fruit cutting virtues, three treasures that gather all the Buddha's beneficent virtues, and three virtues that gather all the principles, which is the horizontal gathering the Dharma-gate.",
        "source": "X20n0359_003:0358c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三道攝惑者苦為所通煩惱之惑必兼於業以為能通能必兼所故一切惑屬三道攝三識既是智之異名故一切解屬三識攝凡有性名既多在凡故一切因屬佛性攝所以因名佛性者眾生實未成佛以煩惱生死是佛之性示令修習是故在因名佛性耳若乃分於二字解者因不名佛果不名性以佛是果人言一切眾生皆有果人之性果人之性者因中煩惱生死是也若不爾者則成佛有眾生之性不名眾生有佛性也般若攝智菩提攝於發心之行其意可解乘攝位者乘此妙乘游於四方直至道場因果之位故也言發趣者進發趣入也由報智故上冥下應是故智德屬三身攝斷德既乃諸惡永亡是故乃屬涅槃所攝三寶出世多所利益是故乃攝一切恩德三德攝理此理非迷以三識等各相主對而論所攝故名為橫若乃一一從始至終方名為豎諸法之門不出解惑因果智斷故云法門。",
        "translation": "The three paths that bring in afflictions are afflictions that are shared by suffering, afflictions that are bound to be accompanied by karma, and as these are shared by what's shared, all afflictions belong to the three paths that bring in the three consciousnesses. Since consciousness is a synonym for wisdom, all solutions belong to the three consciousnesses that bring in the nature of worldlings, and since the nature of worldlings is named after worldlings, all causes belong to the nature of buddha that brings about cultivation, so the cause is called the buddha-nature.",
        "source": "X20n0359_003:0358c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋攝經教。",
        "translation": "○Second, we'll explain the teaching of the sutra of inclusion.",
        "source": "X20n0359_003:0358c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二攝教者三道是三障即三障是三解脫攝不思議解脫淨名教三識攝楞伽地持攝論等三佛性攝涅槃三般若攝大品等五時教三菩提攝諸方等經三大乘攝法華三身攝華嚴三涅槃三寶三德等皆攝涅槃此舉當道諸經絓是八萬法藏皆應攝爾(云云)。",
        "translation": "The second scripture that collects the teachings is the three paths are the three hindrances that are the three hindrances are the three liberations that collect the inconceivable liberation and the pure name that teaches the three consciousnesses that collect the Laṅkâvatāra teachings, the three prajñāpāramitās that collect the great categories, and the five periods that teach the three bodhisattvas that collect the various directions, the three great vehicles that collect the Lotus teachings, the three bodies that collect the Huayan teachings, the three nirvāṇas, the three treasures, the three virtues, and so forth that all collect the nirvāṇas, which are the 80,000 Dharma stores that should be collected.",
        "source": "X20n0359_003:0358c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三道是三障者名異義同展轉互通名之為道能蔽聖道名之為障並從過患功能立名問三道三障但苦與報二名則別業與煩惱二則是同其意何邪答苦是報家之苦亦報即是苦名異義同不須疑也即障而道名為解脫而三解脫攝不思議解脫淨名教者以淨名經題之下注云一名不思議解脫故也既以三種解脫攝淨名教則與真諦單以一德攝於一經不可同年也楞伽及攝論等既多談於八識之義是故乃為三識所攝以經律論通名為教故得攝之既是今家明攝法義故不須以論在如來滅後所造而為妨也又如來在日豈不懸鑑滅後之論邪涅槃經中多談佛性故以佛性攝於涅槃以三般若攝大品等其義可知言五時者釋籤云古判般若總有五時一摩訶二金剛三天王四光讚五仁王此亦未可全用雖然摩訶定在仁王之前何以知然仁王經云如來成道二十九年先已為我說摩訶般若故知仁王在後明矣若光讚經準諸目錄只是大品上帙但在後譯之耳故不可以為別時之義也今雖用於五時之名而不依彼五時次第故妙玄云仁王般若明五十一位恐是結成前四時般若以仁王對於前四即有五時矣三菩提攝諸方等經者亦以諸方等經多明菩提之義故也三大乘等攝法華準思可見然此所攝且從一往若不爾者豈可法華但有大乘而無餘邪是故當知十種三法皆徧諸經以義裁之無勞委示言當道諸經者法華文句云當途王經途者道也即是現今盛行之經耳絓(胡卦切)釋籤云亦挂也謂但挂諸經也淮南子云飛鳥不動不絓網羅楚辭云心絓結而不解絓亦豫也故止觀云絓一切教也八萬法藏者且舉大數具足應云八萬四千輔行云小乘經論如多論云佛為眾生始終說法以為一藏如是至八萬(云云)又報恩經亦有多解一云四十二字以為一藏餘同多論(云云)八萬法藏苦也八萬塵勞集也八萬對治道也八萬波羅蜜滅也廣攝八萬四千法藏可以意知難以文具故注云云耳。",
        "translation": "The three paths are three hindrances that are different in name but the same in meaning, which are interchangeable in turn, are called paths that obscure the noble path and are called hindrances, and are named from the function of faults and distress.",
        "source": "X20n0359_003:0359a04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○三釋攝六即位。",
        "translation": "○Three explanations of the six immediate stages of collecting.",
        "source": "X20n0359_003:0359b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三攝位者苦道有一切五陰煩惱道有五住惑業道有一切業乃至(云云)三道是三障障覆六位若即三種之非道通三種之佛道者六位所顯則攝諸位也乃至三德亦有六位三德既備攝六位寧不備收耶其間則例自可知(云云)。",
        "translation": "The third stage of collecting people is the path of suffering, which has all five aggregates, the path of affliction, which has the five abodes, the path of activity, which has all activities, and even the three paths, which are the three hindrances that cover the six stages.",
        "source": "X20n0359_003:0359b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即是十種三法一一皆攝六位也四明乃將三道三識分對道前本有之位三因乃至三涅槃等對於道後當有之位恐非今文攝位之意一切五陰該於十界兩重生死見為一住思分三住無明一住共成五住一切之業該於有漏無漏非有漏非無漏也乃至字下注云云者三道既乃各有一切餘九三法比說可知不能具記故注云云何者乃至三德而法身德攝一切身般若德攝一切智慧解脫德攝一切解脫三道是三障障覆六位者問理即之位既全在迷將何以明障覆之義答只以理即在迷名障謂之三道若云三道是三德理方名所顯亦以指於三道之事即三德理而為理即之所顯耳六位所顯則攝諸位者諸位亦是六即之位耳乃至三德亦有六位三德既乃徧攝一切六位豈可不該收邪請觀文中三道乃至三德皆有六位何得將於十種三法分對本有現有當有以明攝於六即之位邪注云云者亦以可知不煩文具故注之耳。",
        "translation": "That is, each of the ten kinds of the three dharmas contains six stages, and the fourth clarification is that the three consciousnesses of the three paths are classified as existing in the past, the three causes and even the three nirvāṇas are classified as existing in the future after the path, which is probably not the intention of the present text to collect the stages.",
        "source": "X20n0359_003:0359b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○所以下三結歸。",
        "translation": "○So the next three are grouped together.",
        "source": "X20n0359_003:0359c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以作三番攝者合帝慧王三義攝法門合貴義攝教合慧義攝位合王義又攝法門是橫攝攝位是竪攝攝教是橫竪雙攝統攝之義既明經王之義顯矣。",
        "translation": "Therefore, the three categories of collection are combined with the three meanings of the emperor and the king of wisdom, the dharma-gate, the noble meaning, the teaching, the wisdom meaning, the position, the king meaning, and the dharma-gate is horizontal, the position is vertical, the teaching is horizontal and vertical, the meaning of double collection, the king of the scriptures is clear.",
        "source": "X20n0359_003:0359c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法門可尊故合貴義說教由智故合慧義位是大寶故合王義法門屬橫如前已示六即淺深故名為豎經教所談不出法門及以六即是故名為橫竪雙標即亦橫亦豎也又亦應云理論乃是非橫非竪也雖於帝王兩字之間加於慧字而論攝法大底不出經王之義顯矣故前文云若依經文有經王之義良由此也。",
        "translation": "The Dharma aspect can be honored so it combines with the noble meaning teaching by wisdom so it combines with the meaning of wisdom the position is a great treasure so it combines with the meaning of king the Dharma aspect belongs to the horizontal as shown before six that is shallow and deep so the name is vertical the scriptures and teachings are not discussed without the Dharma aspect and with the six that is so the name is horizontal and vertical double standard that is also horizontal and vertical also should also be clouded the principle theory is not horizontal and not vertical although the word wisdom is added between the two words emperor and the word wisdom and the theory gathering the Dharma great bottom is not not the meaning of the king of the scriptures is clear so the preceding paragraph says if we rely on the text of the scriptures there is the meaning of the king of the scriptures good also from this.",
        "source": "X20n0359_003:0359c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次約觀心釋文為二初正明又為二初明觀心顯於三義。",
        "translation": "○Subsequent to the interpretation of the text of the Avalokitêśvara Sutra, there are two first correct explanations and two first explanations of the Avalokitêśvara Sutra that show the three meanings.",
        "source": "X20n0359_003:0359c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次觀心明經王者觀心即中是貴義觀心即空是慧義觀心即假是朝會義是為觀心中經王也。",
        "translation": "The second is to contemplate the mind and explain the meaning of the sūtra king, which is to contemplate the mind as the middle, which is the noble meaning, and to contemplate the mind as emptiness, which is the meaning of wisdom, and to contemplate the mind as nominal, which is the meaning of the assembly.",
        "source": "X20n0359_003:0360a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經既乃具帝慧王是故觀心明於經王以空假中顯於三字帝慧王也觀心即中是貴義者帝是至尊貴極故也。",
        "translation": "Since the sūtras are fully equipped with the meaning of emperor and king of wisdom, therefore observing the mind reveals the three words emperor and king of wisdom as the king of the scriptures, and observing the mind that's the middle is the noble meaning because emperor is the most honored and noble.",
        "source": "X20n0359_003:0360a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次明觀心顯於六位者。",
        "translation": "○Second, we'll explain that mindfulness of contemplation is evident in the six stages.",
        "source": "X20n0359_003:0360a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀心論位者眾生本有理性金光明心但有名即名字金光明念念修觀即觀行金光明觀心淳厚即相似金光明會入法流即分證金光明盡邊到底即是究竟金光明。",
        "translation": "The stages of the theory of observing the mind are those in which sentient beings originally have rational golden light, but they have names, which are names, and they mindfully cultivate observing the practice of golden light, which is observing the practice of golden light, and they are simple, which is similar to golden light, and they enter the flow of the Dharma, which is the partial realization of golden light, and they reach the end of the limit, which is the ultimate golden light.",
        "source": "X20n0359_003:0360a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "準上亦合明於觀心攝法門及觀心攝經教而今無者以攝法門及攝經教既將十種三法攝之而前已觀十種三法釋金光明故此不煩但明觀心攝位六即之中位位應言帝慧王義而復謂之金光明者以金光明與帝慧王名異理同是故但言金光明耳何者金既尊貴豈非帝義光能常照豈非慧義明能益物豈非王義。",
        "translation": "It's because the method of collecting dharmas and the teaching of the scriptures that collect dharmas and collect scriptures will collect the ten kinds of three dharmas, and the previous ten kinds of three dharmas have already been observed to explain golden light. Therefore, it's not necessary to explain only the six stages of collecting dharmas and scriptures that collect dharmas and scriptures, which are the middle stages.",
        "source": "X20n0359_003:0360a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次若不下結勸。",
        "translation": "○Subsequently, if he doesn't conclude his teaching, then what good will it do if he doesn't cultivate contemplation and hear it in vain?",
        "source": "X20n0359_003:0360a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不修觀徒聞何益如遙羨寶山足不涉路安可得乎為此義故須觀心一番令聞慧具足也。",
        "translation": "If someone doesn't cultivate contemplation, what good will it do to hear in vain, like envying a jeweled mountain whose feet don't wade through the path, then how can they attain it? For this reason, they must contemplate their mind for a while so that hearing and wisdom are complete.",
        "source": "X20n0359_003:0360a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "羨(似面切)貪慕也聞者解也慧者行也聞慧具足解行俱備若不爾者則單輪隻翼不能飛昇遠運矣。",
        "translation": "Envy (似面切) is covetousness, and hearing is understanding, and wisdom is practice. Hearing and wisdom are complete, and both understanding and practice are present.",
        "source": "X20n0359_003:0360a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋通名。",
        "translation": "○Next, we'll explain the generic terms.",
        "source": "X20n0359_003:0360a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋通名者如法華玄義中說。",
        "translation": "The next explanation of the generic name is as explained in the Profound Meaning of the Lotus Sutra.",
        "source": "X20n0359_003:0360a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "注云云者應引法華玄義中云經者外國稱修多羅聖教之通名釋此通名凡有五義一有翻二無翻三和融有無四歷法明經五觀心明經具在彼文(云云)。",
        "translation": "He should cite the scripture called the sūtra in the Profound Meaning of the Lotus as a generic term for the sage teaching in foreign countries.",
        "source": "X20n0359_003:0360a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次辨體文為二初標列。",
        "translation": "○Second, we delineate the essence of the text in two ways. First, we label the list.",
        "source": "X20n0359_003:0360b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二辨體為三一釋名二引證三料簡。",
        "translation": "The second discernment of the essence is threefold: first, an explanation of the title, second, a citation, and third, a summary.",
        "source": "X20n0359_003:0360b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "準玅玄中此亦應云前釋名總說文義浩漫今頓點要理正顯經體直辨真性真性非無二軌欲令易解是故直說後顯宗用非無初軌偏舉當名耳釋籤云名含下三三是總中之別體又三中之別未涉諸義故頓點三軌之中體屬真性也。",
        "translation": "This should also be called the first explanation of the general explanation of the name, which is a vast expanse of text and meaning. Now, the main principle of the sudden point is to show the essence of the sutra and directly identify the true nature.",
        "source": "X20n0359_003:0360b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次解釋文為三初名文為二初正釋文為三初略示。",
        "translation": "○Second, the explanatory text is divided into three initial explanations of the name and two initial explanations of the text, the first of which is briefly described.",
        "source": "X20n0359_003:0360b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋名者體是質質是主質。",
        "translation": "The explanation of the name is that the essence is the substance, and the substance is the main substance.",
        "source": "X20n0359_003:0360b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "體謂形體形體即是主質主亦質也若無形體支分何依將何主質大乘亦爾若無法性教法何依將何主質。",
        "translation": "If there's no physical body, what's the support for the main substance? What's the main substance? The Dasheng is the same.",
        "source": "X20n0359_003:0360b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何為(平呼)下徵釋文為二初正徵釋。",
        "translation": "○Second, what is the (chanting of) the following explanation of the text in two ways: first, a correct explanation.",
        "source": "X20n0359_003:0360b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何為主質之體法身法性是經體質若依義者法身為體質若依文者法性為體質法身法性只是異名更非兩體欲令易解是故雙題爾。",
        "translation": "If we rely on the meaning, the Dharma body is the essence; if we rely on the text, the Dharma nature is the essence; and the Dharma body and Dharma nature are just synonyms, not two bodies.",
        "source": "X20n0359_003:0360b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言依義以法身為體質者良以主質乃是身質故也依文以法性為體質者以由經文云游於無量甚深法性故也問依文若以法性為體而空品云求於如來真實法身捨身品云具足成就微玅法身可非文邪答既云求於真實法身正是因中之所求耳捨身品意準例可知故不可以因中所求法身而濫果上已證法身也法身法性只是異名者法身不遷即是法性法性理聚即是法身其名雖異其體本同。",
        "translation": "If the scripture relies on the meaning to take the Dharma body as its essence, it's because the essence of the subject is the essence of the body; if the text relies on the Dharma nature as its essence, it's because the scripture says that it travels to the innumerable and extremely profound Dharma natures; if the text relies on the Dharma nature as its essence, then the emptiness class says that it seeks the true Dharma body of the Tathāgata, and the equanimity class says that it's fully accomplished in the subtle Dharma body.",
        "source": "X20n0359_003:0360b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次法性語通下簡通從別文為四初正簡法性。",
        "translation": "○Second, Dharma-nature is expressed in words, and then it's explained in brief from the separate text in four ways.",
        "source": "X20n0359_003:0360c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性語通今以佛所游入法性為體質也。",
        "translation": "Now, Dharma nature in speech is taken to be the essence of the Dharma nature into which the Buddha travels.",
        "source": "X20n0359_003:0360c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "語通者於下□□□□□□□□□□□□□□□□□□□□□乃取果佛所游□□□□□□□□華亦爾故法華云唯佛與佛乃能究盡諸法實相問體若在果前文那云三章是因若通因果諸文那云體非因果答中道理體雖非因果不妨約於中道理體而辨因果若附經文則取果佛所證之理而為經體若乃約行生起次第是則經體乃屬因中所以然者雖談經玄義果上法性不妨約行次第因中實相以由因中約行生起尋名得體即果上所證法性因果之事雖分實相理體何別不別而別依文辨體須取果佛所游法性但其果證有分有滿分如法華普門品滿如今經如來所游復次須知體有通別通則徧為諸法等體別則唯在因果所取見於實相名為得體簡通從別厥意昭然是故謂之體非因果(實相理體不同因果之宗也)依之以辨因果(依體立宗也)因果取體(宗成證體取者獲得也)方有用(智與體冥能起大用即經用也)。",
        "translation": "Although the body of the principle in the answer is not cause and effect, it might be possible to discern cause and effect by focusing on the body of the principle in the answer, even though it's not cause and effect.",
        "source": "X20n0359_003:0360c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○文云下次引證。",
        "translation": "○The text says, \"The next time the Tathāgata traveled around, he realized that the essence of the scripture was the essence.",
        "source": "X20n0359_003:0360c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文云是時如來游於無量甚深法性過諸菩薩所行清淨。",
        "translation": "The text says that the Tathāgata then travels around in the innumerable and exceedingly profound nature of reality, which is purified by the practices of the bodhisattvas.",
        "source": "X20n0359_003:0360c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○故知下三結示。",
        "translation": "○So he knew the next three statements.",
        "source": "X20n0359_003:0360c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知此體不與下地菩薩及二乘等共非通法性也但是佛所游入。",
        "translation": "He therefore knows that this essence isn't shared with lower-level bodhisattvas and adherents of the two vehicles, but it's not the common Dharma nature that the Buddha wanders into.",
        "source": "X20n0359_003:0361a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尚非分證中道法性豈是二乘偏真法性乎是故今經之體唯是佛所游入法性耳此且直指經文法性是佛所游明體在於果人所證若乃約教以明體者下文判教此經屬通通教即得帶別明圓妙玄中判眾經之體有傍有正通教乃是帶傍明正傍謂偏真正即中道故文句釋諸經之王名為敘體乃約三種中道明之豈非通教帶別明圓帶傍偏真顯於三種中道之正(云云)。",
        "translation": "Therefore, the essence of the present sūtra is only the Dharma nature that the Buddha wanders into. Here, we're directly pointing out that the grammatical nature of the sūtra is that which the Buddha wanders into, and its essence is that which the realizers realize.",
        "source": "X20n0359_003:0361a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○一切種智下四明體為餘章所依文為二初正明。",
        "translation": "○Below omniscience are the four explanations of its essence that serve as the basis for the rest of the chapter.",
        "source": "X20n0359_003:0361a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切種智以此為根本無量功德共莊嚴之種種眾行而歸趣之言說問答共詮辨之。",
        "translation": "This is the fundamental, immeasurable merit of omniscience, which is the common adornment of various practices and the common explanation of the various paths to which they all belong, in words, in questions, and in answers.",
        "source": "X20n0359_003:0361a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "準下明用中云夫一切種智是果上之德果智由於無量功德之所莊嚴滅除諸苦與無量樂將此勝用莊嚴果智乃至云空品雙導文云種智而為根本即其義也故知一切種智以此法性經體而為根本耳功德為能嚴經體為所嚴何者生善滅惡其體乃彰故知經體必倒經用為□□□是則種智及以功德皆屬經用也觀經疏中其意□□□□不云一切種智耳今文有者以今經云一切種□□□□□無量功德之所莊嚴故也又功德莊嚴之言亦□□□□□文云莊嚴菩薩深妙功德以為宗也種種眾行者宗□□經疏中其意亦爾但彼經宗修心妙觀顯四淨土通於因果而今經宗唯在於果耳種種眾生雖通因果今正取果也所歸所趣即經體也言說問答者釋名教相也言說是教故玅玄明教相中云無名相中假名相說以無說而已說必屬教故也教為能詮體為所詮也問答屬名以諸經中首題名字多從問答方乃顯之如觀經中阿難問云當何名此經如來答云此經名觀極樂國土佛菩薩等亦名淨除業障生諸佛前名為能辨體為所辨故周易云學以聚之問以辨之。",
        "translation": "It's because this excellent function adorns the fruit wisdom and even the scripture on emptiness that it's the root, that is, it's the meaning. Therefore, we know that all kinds of cognition use the essence of the Dharma-nature of the scriptures as their root, that merit is what adorns the essence of the scriptures, that the essence of the scriptures is what adorns, and that the essence of what produces goodness and extinguishes evil is what's made clear.",
        "source": "X20n0359_003:0361a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○類眾星下次舉譬。",
        "translation": "○The class of stars is next cited as an example.",
        "source": "X20n0359_003:0361b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "類眾星之環北辰如萬流之宗東海。",
        "translation": "\"The class of stars that circles the North Star is like the ten thousand streams that cling to the East Sea.",
        "source": "X20n0359_003:0361b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "類者例也亦比也又譬也觀疏中乃云譬也眾星之環北辰者論語云為政以德譬如北辰居其所而眾星共之以北辰常居其所而不移故眾星共尊之今云環者玉篇云遶也爾雅云北極謂之北辰郭璞云北極天之中以正四時極中也辰時也以其居天之中故云北極以正四時故云北辰漢書天文志云中宮天極星其一明者泰一之常居也旁三星三公環之匡衡十二星藩臣皆曰紫宮北斗七星所謂旋璣玉衡以齊七政斗為帝車運於中央臨制四海分陰陽建四時均五行移節度定諸紀皆繫於斗是眾星共之也如者似也萬流之宗東海者尚書禹貢云惟荊州江漢朝宗于海孔氏傳云二水經此州而入海有似於朝百川以海為宗宗者尊也周禮大宗伯諸侯見天子云禮春見曰朝夏見曰宗鄭玄云朝猶朝也欲其來之早也宗尊也欲其尊主也朝宗是人事之名水無識性非有此義以海水大而江漢小以小就大似諸侯歸於天子假人事以言之耳老子云滄海所以能為百谷王者以其善下之是百川以海為宗也眾星萬流譬宗用也北辰東海喻理體也。",
        "translation": "The class is also an example and a comparison and also a simile in the commentary of the Guan, it is also a simile of the ring of stars, like the North Star that lives in its place and the stars together with the North Star that always lives in its place and does not move, so the stars together respect it. The cloud is a ring, the Jade Book, a circle, the Erya cloud, the North Pole is called the North Star, the Guo Pu cloud, the North Pole in the sky to correct the four seasons, the middle of the pole, the time of the hour, also to live in the middle of the sky, so the cloud is the North Pole to correct the four seasons, so the cloud is the North Star.",
        "source": "X20n0359_003:0361b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○故以下三總結。",
        "translation": "○Therefore, the following three summarize the principle.",
        "source": "X20n0359_003:0361c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故以法身法性為此經正體之主質也。",
        "translation": "Therefore, the Dharma body and Dharma nature are the main essence of the main body of this sūtra.",
        "source": "X20n0359_003:0361c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○故書家下次明體有三義然此三義與觀經疏其意大同於中為三初明體是禮義。",
        "translation": "Therefore, the next time a scholar explains that there are three meanings of the essence, but these three meanings are similar to those in the commentary on the Contemplation Sutra.",
        "source": "X20n0359_003:0361c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故書家解禮者體也體有尊卑長幼君父之體尊臣子之體賤當知體禮之釋與經法性意同如來所游佛所護持故知此體是貴極之法也。",
        "translation": "Therefore, the scholars understand that the essence of propriety is also the essence, and that there are noble and base, long and young, the essence of ruler and father, the essence of noble and subordinate, and the essence of inferiority.",
        "source": "X20n0359_003:0361c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言書家者即儒宗也解禮者體也者記禮器(言禮使人成器也)篇云禮也者猶體也體不備君子謂之不成人設之不當猶不備也禮有大有小有顯有微大者不可損小者不可益顯者不可揜微者不可大鄭玄云若人身體也又喪服四制篇云凡禮之大體體天地法四時則陰陽順人情故謂禮也體有尊卑等者周易繫辭云天尊地卑乾坤定矣長幼但在父子也當知體禮之釋乃至云是貴極之法也者簡臣子之體賤取君父之體尊也君父體尊喻於如來所游法性故云與經法性意同釋迦所游四佛所護也應知君臣父子譬於圓位因果高下今文簡於等覺已還因位之下而取妙覺果位之高也今文既與觀經疏同是則彼此不可異轍而四明於此乃云今之經體既是究竟所證法身正同君父體禮之義揀非分證法身已還臣子之體也於彼則云君父譬法身臣子喻宗用孤山於彼乃以君父喻圓實臣子譬偏權於此乃以君父喻極果所證臣子喻菩薩二乘矛盾既彰今所不用(云云)應知儒宗既以禮訓體今家乃以體訓體故玅玄云體字訓禮禮法也若無禮者則非法也出世法體亦復如是善惡凡聖菩薩佛等不出法性乃至云今取佛所見為體彼此通論無間高下若從別說皆取果證而孤山云法華玄義體字訓禮與此稍別深不可也。",
        "translation": "The calligrapher, that is, the Confucian school, also understands the essence of propriety, and he remembers the vessel of propriety (saying that propriety makes a person a vessel), and the article says that propriety is just like the essence, and the body is not complete, which the ruler calls not adult.",
        "source": "X20n0359_003:0361c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○復次下次明禮是底義初一句標。",
        "translation": "Furthermore, the next time he explained that reverence is the ultimate meaning, the first phrase was an indication.",
        "source": "X20n0359_003:0362a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次體是底義。",
        "translation": "\"Furthermore, the essence is the ultimate meaning.",
        "source": "X20n0359_003:0362a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次四句釋。",
        "translation": "○The next four sentences explain it.",
        "source": "X20n0359_003:0362a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "窮源底理盡淵府光揚實際乃名為底。",
        "translation": "\"To know the source and the principle, exhaust the abyss, and radiate the reality is called the bottom.",
        "source": "X20n0359_003:0362a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋論下引證。",
        "translation": "Next, he introduces the explanation under the Śākyamuni śāstra.",
        "source": "X20n0359_003:0362a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋論云智度大海唯佛窮底。",
        "translation": "The Śākyamuni śāstra says, \"The ocean of wisdom and salvation is only the bottom of the Buddha's end.",
        "source": "X20n0359_003:0362a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次此與下會同經意。",
        "translation": "Next, he explains that this and the following are the same as the meaning of the sūtras.",
        "source": "X20n0359_003:0362a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此與今經法性甚深意同。",
        "translation": "This is the same as the profound meaning of the Dharma nature of the present sūtra.",
        "source": "X20n0359_003:0362a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次當知下點示經意與論義同。",
        "translation": "Next, you should know that the following points show that the meaning of the sūtras and the meaning of the śāstra are the same.",
        "source": "X20n0359_003:0362a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知法性高深竪窮佛海。",
        "translation": "'You should know that the Dharma nature is lofty and profound, and the ocean of the Buddha is exhausted.'",
        "source": "X20n0359_003:0362a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次故以下結示。",
        "translation": "○Second, therefore, the following is a concluding statement.",
        "source": "X20n0359_003:0362b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故以底義釋體也。",
        "translation": "He therefore explains the essence of the sutra using its underlying meaning.",
        "source": "X20n0359_003:0362b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文皆可見不煩細釋。",
        "translation": "The text is all visible, so we don't need to explain it in detail.",
        "source": "X20n0359_003:0362b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○復次下三明體是達義準向可知但於釋中有法有喻有合以法性合風以不違背合無障礙又引證中更加又云等文為證耳。",
        "translation": "Furthermore, the following three explanations clarify that the essence is the directive, but in the explanation there are dharmas, metaphors, and combinations in which the Dharma nature is combined with the wind, which is not contradictory to the combination, and which is unobstructed.",
        "source": "X20n0359_003:0362b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次體是達義得此體意通達無壅如風行空中自在無障礙一切異名別說皆與法性不相違背釋論云般若是一法佛說種種名隨諸眾生類為之立異字又云若如法觀佛般若與涅槃是三則一相其實無有異此與今經法性無量意同當知法性廣大無涯橫收法界徧無所隔故以達義釋體也。",
        "translation": "Furthermore, the essence is the realization of the meaning of penetration, which has the same meaning as the present scripture, that the Dharma nature is limitless, like the wind moving through the air with ease and without obstruction, and that all synonyms and special terms are not contradictory to the Dharma nature. The explanation says that Prajñā is the one Dharma, and the Buddha teaches various names to create different words for various types of sentient beings, and it also says that if one observes the Dharma, then Prajñā and Nirvāṇa are three things in one, there's really no difference between them.",
        "source": "X20n0359_003:0362b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然此禮底達等三義諸說不同孤山云體達是橫體底是竪體禮乃是非橫非竪四明云雖論三義但是法身中三未明餘二各三又云空假皆中故三屬體又云體禮是法身體底是實相般若空即中故體達是真性解脫假即中故霅川云禮底達三皆是一性體正是實相之體也體達者用中之體也今謂諸說義皆不然按妙玄借三種喻正顯經體又云此經實相之體如大象得底堅不可壞以譬體玅圓珠普雨以譬用妙巧智成仙以譬宗妙如此三譬即是三德不縱不橫名為大乘於大乘中別指真性以為經體釋籤問云前三譬中皆云經體又復三義本為顯體何得此中乃云三譬以譬三法答義有傍正正顯體已復順此三若爾即是用所體體能成用亦宗所顯體體能成宗故以三譬復對三法(云云)以彼例此故知今文禮底達三雖則正為顯於經體然亦不妨對於三德體禮法身也體底般若也體達解脫也況今文中顯將體禮對於法性豈非法身又將體底對於甚深豈非般若又將體達對於無量豈非解脫理性三德不其然乎若許三義別對三德三德任運離合炳然離則簡出二德克取法身合則空假即中中為經體那忽於皮毛枝葉而興諍論邪(云云)。",
        "translation": "However, the three meanings of this salutation and the three that are explained differently Gushan Yun's body is horizontal, the body is bottom is the body, and the salutation is neither horizontal nor vertical, and Si Ming Yun's theory that although the three meanings are discussed, the Dharma body, the three unexplained, and the other two are each of the three, it's also said that the body is the Dharma body, the body is bottom, and the true nature is liberation, the emptiness is the middle, and the body is the true nature, the falsehood is the middle.",
        "source": "X20n0359_003:0362b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次引證。",
        "translation": "○Subsequent citation and realization.",
        "source": "X20n0359_003:0362c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二引證者序品云如來游於無量甚深法性鬼神品云若入是經即入法性如深法性二文既云深法性即知簡異二乘菩薩所得法性也空品云故此尊經略而說之說於空即如也讚佛品云知有非有本性空寂當達此等皆體之異名悉會入法性法是軌則性是不變不變故常一此常一法性諸佛軌則故云法性為此經體也。",
        "translation": "The two texts both say profound Dharma nature and know that the Dharma nature is simply different from the Dharma nature attained by two-vehicle bodhisattvas. The emptiness text says that this honored sūtra explains it in brief, explaining that emptiness is thusness.",
        "source": "X20n0359_003:0362c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言甚深法性者妙覺窮深也簡異二乘菩薩所得者佛既名深菩薩則淺菩薩尚淺二乘可知空品說空讚佛品云本性空寂即是中道空寂二邊故云皆是體之異名悉會入法性也。",
        "translation": "When it comes to the profound nature of reality, it's called the profundity of marvelous enlightenment and the depth of extinction, which is simply different from what the two-vehicle bodhisattvas attain when the Buddha is called profound and the bodhisattvas are shallow.",
        "source": "X20n0359_003:0362c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三料簡文為二初問。",
        "translation": "○There are two ways to summarize the text. The first is to ask.",
        "source": "X20n0359_003:0362c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三料簡者問法性定是空為非是空。",
        "translation": "The third one asks whether the nature of dharmas is definitely empty or not empty.",
        "source": "X20n0359_003:0362c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可見。",
        "translation": "This can be seen.",
        "source": "X20n0359_003:0362c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次答。",
        "translation": "○Then he answers.",
        "source": "X20n0359_003:0362c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答法性過諸菩薩所行清淨淨於四句不應以空有求之雖非四句或時赴緣作四句說之文云兩足世尊行處亦空新本云是第三身是真實有又云前二種身是假名有又云非有非無此有四句四門意也門乃有四悟理非數佛示人無諍法不應執此相兢舊本明空新本明有以體達義釋之二文不乖即此意也。",
        "translation": "The new version says that the third body is truly existent, and it also says that the previous two kinds of body are nominally existent, and that they are neither existent nor nonexistent.",
        "source": "X20n0359_003:0363a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言新本云第三身等者彼經三身分別品列三身次第初化身次應(平呼)身三法身故第三身即法身也前二種身即化身應身也故彼經云前二種身是假名有第三身是真實有也以第三身為前二身而作本故是第一身依於應身而得顯現是法身者是真實有無依處故非有非無者經云法身二無所有何者以此法身相及相處二皆是無非有非無非一非異然法身是真實有乃是實相本有之有是故須知理非四句隨緣利物假立於四妙契環中定性四句壅蔽正道(云云)。",
        "translation": "The new version of the sutra says the third body is listed in the three identity-specific categories of the three bodies in order, starting with the transformation body, followed by the response body, and ending with the Dharma body.",
        "source": "X20n0359_003:0363a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○第三明宗者若準玅玄及觀經疏此中亦須先簡宗體今文無者但是略耳於中為二初標。",
        "translation": "If we look at the commentaries on Śākyamuni and the Contemplation Sutra, we must first define the essence of the proposition.",
        "source": "X20n0359_003:0363a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三明宗者。",
        "translation": "The third one explains the thesis.",
        "source": "X20n0359_003:0363a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次宗謂下釋文為二初釋名。",
        "translation": "○Subsequent to the explanation of the tenets, there are two explanations of the text, the first of which is to explain the title.",
        "source": "X20n0359_003:0363a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宗謂宗要也。",
        "translation": "\"Doctrine refers to the essentials of a doctrine.",
        "source": "X20n0359_003:0363a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宗謂宗要者今經乃以果為宗要良由所證雖復無量言果則攝如提網維無目不動又似牽衣一角無縷不來故云宗謂宗要也。",
        "translation": "The doctrine refers to the essentials of the school. Now, the sūtra takes the fruit to be the essentials, and it's because although there are countless things to realize, the fruit is collected like a net of dhvajâgra without eyes that don't move, and it's like tugging at a corner of a garment without strands that don't come, so it's called the doctrine referring to the essentials of the school.",
        "source": "X20n0359_003:0363a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○說者下次釋義文為二初敘古說。",
        "translation": "○Teacher, the next explanation of the meaning of the text is divided into two.",
        "source": "X20n0359_003:0363b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說者或以果為宗或以因為宗或雙用因果為宗。",
        "translation": "It's either a teaching that takes the result as the doctrine, a teaching that takes the cause as the doctrine, or a teaching that uses both cause and effect as the doctrine.",
        "source": "X20n0359_003:0363b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次今尋下今家正釋文為二初明佛果為宗又為二初正明宗要又為二初正明。",
        "translation": "The first one explains the Buddha's fruition as the doctrine, and the second one correctly explains the essentials of the doctrine, and the first one correctly explains the two.",
        "source": "X20n0359_003:0363b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今尋壽量品雖明施食不殺之因乃將因擬果果是正意三身分別品雖復問因佛答三身還是果為正意今此意但用佛果為宗。",
        "translation": "Although the present Inquiry into the Longevity Chapter explains the cause of giving food and not killing, it's the correct meaning that the cause is intended to be the result, although the identity-specific Chapter also asks whether the cause and the Buddha answer the three bodies or the result is the correct meaning.",
        "source": "X20n0359_003:0363b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新舊兩本雖則舉因正意顯果是故須用佛果為宗他人專以因為宗及雙用因果等義皆不然也今經壽量品明施食等如經可知三身分別品問因等者虗空藏菩薩白佛言云何菩薩於如來如法修行豈非問因如來答云一切如來有三種身豈非答果。",
        "translation": "Although the old and new versions cite the cause and the correct intention to show the result, it's therefore necessary to use the Buddha's result as the subject. Other people focus on the cause as the subject, or they use both cause and result, and so on.",
        "source": "X20n0359_003:0363b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次何者下釋所以。",
        "translation": "○Then, what is the reason for this?",
        "source": "X20n0359_003:0363b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者法性常體甚深微玅若欲顯之非果不克當知果是顯體之樞要如提綱目整則以果為宗意在此也更附經重顯此義文云釋迦如來所得壽命釋迦是果人壽量是果法果人克果法冥乎法性法性既非有非無非常非無常果人果法亦非常非無常法性既能常能無常果人果法亦能常能無常四佛釋疑舉山斤海滴地塵空界無能算計知其數量明其能常八十滅度是能無常此見八十滅度之無常不能計校其常尚不能知其常焉能知其非常非無常若不約果此羲難明既舉果冥理顯體義彰以果為宗其義如是。",
        "translation": "Why is the Dharma nature and eternal body so profound and subtle that if you want to reveal it, it's not possible to grasp it without the fruit. You should know that the fruit is the pivotal point for revealing the essence, just as the syllabus and the whole thing is based on the fruit as the subject.",
        "source": "X20n0359_003:0363b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "克者獲也證也樞謂戶樞者本也要也以門戶開閉要在於樞故也綱者說文云維紘繩也白虎通云大者為綱小者為綱綱者張也紀者理也謂張理上下整齊人倫若羅網之有綱紀而萬目自張也次附經重顯者法性既非有至果法亦非常非無常者此即文句及觀經疏法報體一雙非長短兩應之意也法性既能常至果法亦能常能無常者此亦文句及觀經疏智與體冥能起大用能為常壽能為無常壽之意也但彼能為常壽是界外法性尊特能為無常壽是界內同居淨穢分段生身長短兩應耳今文且以四佛釋疑舉山斤海渧生身應長以為能常八十滅度生身應短以為無常若望界外尊特常壽則此皆是無常所收以山斤海渧實有限數故也以界外尊特亦名報身故且置之耳。",
        "translation": "This is because the doors and windows open and close, and the key lies in the pivot. The net is explained in the text, the word 紘, the 紘 rope, the word Bai Hu Tong, the great one is the net, the small one is the net, the manuscript, the discipline, the principle, which is to say that the principle is to open up and down to adjust people's morals, just like a net that has a net and all the eyes open themselves.",
        "source": "X20n0359_003:0363c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○又說果義下次明佛果融攝文為二初明諸經智斷。",
        "translation": "The first one explains the elimination of wisdom from the sutras.",
        "source": "X20n0359_003:0363c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又說果義不同或約無上菩提智德明果或約大般涅槃斷德明果若舉智德眾善溥會任運知有斷德若舉斷德諸惡永盡任運知有智德互舉一邊不可偏執也。",
        "translation": "Whether the fruit is explained in terms of the virtue of wisdom from unsurpassed enlightenment or the virtue of cutting off from great parinirvāṇa, the result is explained in terms of the virtue of cutting off if the virtue of wisdom is cited, the many good qualities that Puhui will freely know that there's the virtue of cutting off, or the virtue of cutting off if the virtue of wisdom is cited, the bad qualities that permanently end will freely know that there's the virtue of wisdom.",
        "source": "X20n0359_003:0363c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "互舉諸經中說佛果不同或約菩提智德明果如法華云我智力如是久修業所得慧光照無量壽命無數劫或約涅槃斷德明果如大經云大般涅槃修道得故涅槃是斷菩提是智若舉智德必兼斷德若舉斷德必兼智德若不爾者豈得菩提而惡不盡豈證涅槃而闕照明諸經赴緣互舉一邊不可守語而偏計也。",
        "translation": "They may explain the fruit of the Buddha differently by referring to the virtue of enlightenment as the fruit, as the Lotus says, \"My power is such that the wisdom gained from long-practiced actions shines forth for an immeasurable life span of measureless eons, or they may explain the fruit of nirvāṇa by referring to the virtue of cutting off as the great sūtra says, \"The great parinirvāṇa is attained by cultivating cultivation; therefore, nirvāṇa is cutting off and enlightenment is knowledge.",
        "source": "X20n0359_003:0363c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次明今經果報亦總文為二初正明。",
        "translation": "○Second, we'll explain that the rewards of this sūtra are also summarized in two ways.",
        "source": "X20n0359_003:0364a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今經舉壽量明果壽量是果報果報語總總於智斷智斷亦總果上三身。",
        "translation": "The sūtra now cites life span to explain the fruit. Life span is the fruit of fruit, and the fruit of fruit is summarized in the three bodies above wisdom and elimination.",
        "source": "X20n0359_003:0364a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽量是果報者遂尅為果即習果也酬因為報即報果也果報語總總於智斷者玅玄云習果即是一念相應無上菩提智德果也報果即是大般涅槃諸惡永盡斷德果果也智斷上冥法身下攝應身故也故智斷果報是總三身是別也。",
        "translation": "The lifespan is the fruit of the result, which is the result of resonance, which is the result of accumulation, and the reward is the result of retribution, which is the result of retribution. The fruit of retribution is the result of accumulation, which is the result of unsurpassed enlightenment due to single-mindedness, and the result of retribution, which is the result of the great parinirvāṇa in which all evil is permanently ended and the result of the cutting off of virtue is the result of wisdom and cutting off the fruit of retribution, which is the total of the three bodies and the distinction between them.",
        "source": "X20n0359_003:0364a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○果上三身既與下次明果上三身與法性冥故雙非雙照文為二初正明果報是總三身是別。",
        "translation": "○The three bodies that are the fruit of the fruit are distinct from the next time he explains that the three bodies that are the fruit of the fruit are both non-negative and doubly illuminating because the Dharma nature is mysterious.",
        "source": "X20n0359_003:0364a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "果上三身既與法性冥法性非常非無常三身亦非常非無常法性既能常能無常三身亦能常能無常若能無常即化身壽命也對無常而論常能常即報身壽命也。",
        "translation": "Since the three bodies in fruition are intrinsic to the Dharma nature, the Dharma nature is neither permanent nor impermanent, and the three bodies are neither permanent nor impermanent.",
        "source": "X20n0359_003:0364a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今文舉別以顯於總是故謂之果上三身與法性冥故文句云菩提智慧與法性相應相冥也若乃不知舉別顯總將何以消三身非常非無常能常能無常邪四明約於修九性九以消此文恐未可也若能無常即化身者即分段生身勝劣長短名為化身亦名應身也對無常而論常能常即報身者前文以生身應長名為能常今文以法性尊特他受用報名為能常故總此兩文乃顯文句六能之說也。",
        "translation": "If we don't know how to distinguish and show the total, how can we eliminate the three bodies that are neither permanent nor impermanent, that are permanent and impermanent? The four sciences are based on the cultivation of the nine natures and the nine to eliminate this text, but I'm afraid it's not possible.",
        "source": "X20n0359_003:0364a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○報化與法性冥下次明報化與法性冥故雙非不可算數者前明三身與法性冥雙非雙照是全體起用今明報化與法性冥雙非不可數是舉用明體故前後兩文不可參濫也於中為五初正明。",
        "translation": "○The retribution body and the Dharma nature are mysterious, and the next time he explained that the retribution body and the Dharma nature are mysterious, so they're both incalculable.",
        "source": "X20n0359_003:0364b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "報化與法性冥法性既非常非無常不可算數報化亦非常非無常不可算數。",
        "translation": "Whether it's retribution, transformation, or Dharma nature, Dharma nature is neither impermanent nor impermanent and uncountable.",
        "source": "X20n0359_003:0364b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一塵之身尚與理等豈可報化有算數乎若非舉用明體何得報化雙非。",
        "translation": "How can there be a countable number of retribution and transformation unless the body of a single particle is still equal to the principle? How can retribution and transformation be neither unless we explain their essence by using them?",
        "source": "X20n0359_003:0364b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次云何下拂疑。",
        "translation": "○Second, why does the following brush off doubt?",
        "source": "X20n0359_003:0364b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何見迹短而言佛壽定短此不識果能顯體之意。",
        "translation": "How can you say the Buddha's life span is definitely short when you see that the manifestation is short? This is the meaning of not realizing that the fruit can reveal its essence.",
        "source": "X20n0359_003:0364b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信相但見應化迹短便疑佛壽定八十年是故拂云此不識果能顯體也以果用八十雖則是短欲以此短顯於理體非短故也短既非短長亦非長長短俱亡妙理即顯。",
        "translation": "Believing that the marks of the transformation are only short, they doubt that the Buddha's life span is definitely eighty years.",
        "source": "X20n0359_003:0364b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三又如下引化事例。",
        "translation": "○3 Again, the following is an example of transformation.",
        "source": "X20n0359_003:0364b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又如佛非鹿馬能現鹿馬鹿馬定是佛耶鹿馬是佛化所為非佛身也法性能長短長短非法性也。",
        "translation": "\"Also, suppose a buddha isn't a deer or horse that shows a deer or horse and the deer or horse is definitely a buddha? The deer or horse is a transformation of the buddha that's not the buddha's body, and the Dharma nature is long and short, and the length and shortness are not the Dharma nature.",
        "source": "X20n0359_003:0364b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鹿馬定是佛邪者問也鹿馬是佛化所為非佛身者答也引此以例法性能長短非法性耳。",
        "translation": "The question, 'Is the deer and horse definitely the Buddha?' and the answer, 'Is the deer and horse something created by the Buddha that's not the Buddha's body?' are cited here as examples of the long and short nature of the Dharma and the illegitimacy of the Dharma.",
        "source": "X20n0359_003:0364b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四若見下結成。",
        "translation": "○4. It's concluded under \"If I see...",
        "source": "X20n0359_003:0364b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若見此義果能顯體常義亦成非常非無常義亦成無常義亦成果為宗要義亦成若不爾者諸義皆不成。",
        "translation": "If he sees that the result of this meaning can be expressed in essence, the meaning of permanent will also become true, and the meaning of impermanent will also become true.",
        "source": "X20n0359_003:0364b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能顯之報所顯之法起用之應既互相顯是故皆成故雖無常不妨於常及非常非無常也體用互顯其義既成果為宗要其義亦成以常果為宗必冥法體起用故也常即報身非常非無常即法身無常即應身若不如此則諸義皆不成也。",
        "translation": "Since the rewards that can be revealed and the responses that are revealed are mutually apparent, they're all formed. Therefore, although impermanent, it might as well be permanent and neither impermanent.",
        "source": "X20n0359_003:0364c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○舊用下五破古。",
        "translation": "○The five old uses below refute the ancient.",
        "source": "X20n0359_003:0364c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊用山斤海滴之文是無常謂虗空分界是虗空無為復引捨身品中求常樂住處者是三無為為常無生死故為樂也皆以小意曲解大乘如此解者一切皆不成非宗要也。",
        "translation": "The old use of the text of the mountain catty ocean drops is impermanent, which means that the division of space is space and nothingness, and the introduction of the class of equanimity in which one seeks to abide in permanence and bliss is a result of the three kinds of impermanence, which are permanent and free from birth and death.",
        "source": "X20n0359_003:0364c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文句引舊云四譬皆有齊畔可盡之物據此為無常今釋不爾四佛引四譬者乃是舉量以況無量量物尚非思算所知無量之法寧可圖度縱令知量無量只是化用何關體本僻取之失非但自毀又亦誣經今文斥云皆以小意曲解大乘者以三無為及無常等屬小故也又法華文句亦破舊人云前過恒沙後倍上數神通延壽猶是無常僻取文意大有所失(云云)。",
        "translation": "The text quotes the old saying that the four metaphors all have the same extremes of things that can be exhausted according to which they are impermanent. The explanation is not that the four buddhas quoting the four metaphors are just a measure, given the fact that measureless things are not yet known by calculation.",
        "source": "X20n0359_003:0364c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○第四論用文為二初標。",
        "translation": "○The fourth treatise uses the text in two ways: first, by indicating.",
        "source": "X20n0359_003:0364c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四明用。",
        "translation": "The fourth explains application.",
        "source": "X20n0359_003:0364c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次用謂下釋文為二初釋名。",
        "translation": "○Second, the explanation of function follows, which is divided into two.",
        "source": "X20n0359_003:0364c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "用謂力用也。",
        "translation": "\"Use\" refers to the exertion of effort.",
        "source": "X20n0359_003:0364c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次滅惡下釋義文為六初總立。",
        "translation": "The explanation of the meaning under \"Extinguishing evil\" is divided into six general terms.",
        "source": "X20n0359_003:0364c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅惡生善為經力用。",
        "translation": "'The power and function of the sutra is to extinguish evil and cultivate goodness.'",
        "source": "X20n0359_003:0364c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙玄云用是如來之能此經之勝用如來以權實二智為妙能此經以斷疑生信為勝用釋籤云應言功用亦可言得用可言力用功謂因滿得謂證悟力謂勝能此三並是如來自行用則一向單論益他亦可兼自而說今且置自從他故但云用用復二義謂能及用二義復通自他多屬於他如言能從因至果加功用行等今亦置自從多分說人有善巧利他之能經有斷疑生信之用今亦例之故云滅惡生善為經力用也。",
        "translation": "The profound cloud says that function is the Tathāgata's ability, and the sūtra's superior function is the Tathāgata's ability to use the two kinds of wisdom, expedient and real, as wonderfully effective, and the sūtra's ability to cut off doubt and generate faith as superior function.",
        "source": "X20n0359_003:0364c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次滅惡故言力下略釋。",
        "translation": "○Subsequently, it's explained briefly under \"power of words to extinguish evil.",
        "source": "X20n0359_003:0365a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "滅惡故言力生善故言用滅惡故言功生善故言德此皆偏舉具論畢備也。",
        "translation": "It's called power because of the cessation of evil, good because of its function, and virtue because of the cessation of evil and merit because of its production.",
        "source": "X20n0359_003:0365a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具論畢備者以滅惡生善皆有力用功德故也言功德者釋籤云功謂功用德謂得用也。",
        "translation": "The reason it's fully explained is that cessation of evil produces goodness because of the power and usefulness of virtue.",
        "source": "X20n0359_003:0365a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○夫一切下三正示力用之相。",
        "translation": "○The next three correctly show the characteristics of power and function.",
        "source": "X20n0359_003:0365a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫一切種智是果上之德果智由於無量功德之所莊嚴滅除諸苦與無量樂苦是惡業果貪恚癡是惡因惡因不除果不得謝聖人意先令滅惡因故懺悔品居先樂是善果懺讚是因懺罪讚聖惡滅善生故讚歎品居後亦是互舉爾。",
        "translation": "The cognition of all seeds is the virtue above the fruit, and the fruit knowledge is adorned by measureless virtues that eliminate suffering and measureless pleasures.",
        "source": "X20n0359_003:0365a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文句分經云初三行明能破勝法者謂境法法性也行法懺悔讚歎也導法一切種智也今云一切種智是果上之德者止觀引釋論云因中但有理體名道慧道種慧果上事理皆滿名一切智一切種智導法既是一切種智當知行法懺悔讚歎即是無量功德莊嚴若相資而論行資智智顯理理顯故苦盡苦盡故法身顯智圓故報身顯功德無上故應身顯若圓論者王法不縱橫而修三身不縱橫而顯滅除諸苦等者苦果是報障惡業是業障貪恚癡是煩惱障若分因果則業惑為因苦報為果今云貪恚癡為因必兼於業也業必牽報故云苦是惡業果也餘經對緣云報障難轉因時可救果無如何此經三障皆可轉(云云)三障若除三德必顯德顯則是與無量樂懺罪等者懺罪故惡滅讚聖故善生先滅惡故懺品居先次生善故讚品居後然則懺品滅惡非不生善讚品生善非不滅惡故云亦是互舉爾。",
        "translation": "The textual explanation is that the first three practices clarify the overpowering qualities that can be destroyed, which are the objects, the nature of things, the practices, repentance, praise, and the guiding principle, the omniscience, and the omniscience that is the result.",
        "source": "X20n0359_003:0365a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○將此下四明勝用顯餘四章。",
        "translation": "○There are four explanations of superior function below this one, which reveal the other four chapters.",
        "source": "X20n0359_003:0365b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將此勝用莊嚴果智智備體顯體顯名金果備名光力成名明益他曰教也。",
        "translation": "They will explain the superior function, adorn the fruit, and know the wisdom, prepare the essence, and reveal the name, the golden fruit, prepare the name, and the luminous power, and accomplish the name, and explain the benefits to others as well.",
        "source": "X20n0359_003:0365b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "莊嚴果智者宗也智備體顯者體也體顯果備力成名金光明者釋名也益他曰教者教相也前文明體既為四章所依故今明用亦乃顯於餘四問體用若爾宗意云何答文句釋敘宗文云此一句種種義法性四門法性四德即體義果智顯體即宗義護念斷疑即用義而敘宗為正也亦可例云體義名金等也問一切種智無量功德準經既是力用之文今何故以莊嚴果智屬於經宗答若得向來勝用能顯四章之意又達敘宗種種義等則於此文不須疑也。",
        "translation": "The adorned fruit wisdom is the thesis, and the wisdom that's complete, the essence is manifest, the essence is manifest, the fruit is complete, the strength is manifest, the name is gold, and the light is an explanation of the name, and it's beneficial to others who say it's the teaching.",
        "source": "X20n0359_003:0365b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○但懺品下五歷文示力用不偏。",
        "translation": "○But the five successive texts below the chapter on repentance show that the power and function aren't partial.",
        "source": "X20n0359_003:0365c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但懺品滅惡非不生善讚品生善非不滅惡互說一邊空品雙導懺不得空惡不除滅讚不得空善不清淨文云一切種智而為根本即其義也四王品已下護經使宣還是生善攘災令去還是滅惡。",
        "translation": "However, the chapter on repentance that extinguishes evil and doesn't produce unwholesome goodness and the chapter on praise that produces goodness and doesn't extinguish evil mutually explain the emptiness of one side of the chapter and the dual guidance that repentance doesn't lead to emptiness and evil doesn't lead to cessation and praise that doesn't lead to emptiness and goodness and doesn't clarify the meaning of the text when it says that all kinds of cognition are fundamental. The four kingdoms have been followed by the chapter on protecting the scriptures so that they're proclaimed to be producing goodness, hauling away calamities, and causing them to go away or extinguishing evil.",
        "source": "X20n0359_003:0365c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "懺品滅惡非不生善者經云是大金鼓所出玅音悉能滅除三世諸苦即滅惡也乃至云所得功德定及助道猶如大海即生善也又懺悔品非不讚歎讚歎品中非不懺悔亦是互舉爾故讚歎品云我今尊重敬禮讚歎去來現在十方諸佛清淨寂滅以此金光懺悔因緣使我惡海悉竭無餘(云云)空品雙導者以生法之境通於十界故滅九界生法之惡而生佛界生法之惡而生佛界生法之善良由中道一切種智而為根本雙導之也四王品已下雖則正是敘於教相傍亦通於經用之義護經宣通等者四王品云是金光明微妙經典若在大眾廣宣說時我等四王勤心護王及人民為除衰患令得安隱攘(汝羊切)除也。",
        "translation": "The chapter on repentance is not about not producing goodness, because the sūtras say that the sound of the great golden drum can extinguish the suffering of the three worlds, which is to say that it's extinguishing badness, and it's also said that the merit gained from the concentration and auxiliary paths are like the ocean, which is producing goodness, and the chapter on repentance is not about not praising, and the chapter on praising is not about not repenting, but it's also a mutual example.",
        "source": "X20n0359_003:0365c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○攝此下六總結。",
        "translation": "○Take these next six statements and summarize them.",
        "source": "X20n0359_003:0365c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝此諸文故言以滅惡生善為用也。",
        "translation": "\"To gather these texts together, we say that we use them to extinguish evil and cultivate goodness.",
        "source": "X20n0359_003:0365c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝者兼也。",
        "translation": "The term \"gathering\" refers to both.",
        "source": "X20n0359_003:0365c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○第五判教相文為二初標。",
        "translation": "○The fifth text that discerns the characteristics of the teaching is divided into two, the first being an indication.",
        "source": "X20n0359_003:0365c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五判教相者。",
        "translation": "\"The fifth discernment of the character of the teaching.",
        "source": "X20n0359_003:0365c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "玅玄云教是聖人被下之言相是分別同異文句記云教家之相故云教相五味分別為顯醍醐今教別有顯實之功故名為相釋籤云教相只是分別前之四章使前四章與諸文永異若乃分別今經教相同異下文顯矣。",
        "translation": "The profound teaching is that the sages are underneath the words, and the characteristics are distinguished from the similarities and differences between the text and the phrases, so it's called the characteristics of the teaching and the five flavors are distinguished to show the ghee.",
        "source": "X20n0359_003:0365c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋文為二初破古師文為三初總破舊師文為二初敘。",
        "translation": "○Second, the explanation of the text is divided into two, the first refuting the ancient teacher's text and the third summarizing the old teacher's text and the second describing it.",
        "source": "X20n0359_003:0366a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊明此經非會三非褒貶非無相不列同聞眾不在五時次第而明常住者是偏方不定教。",
        "translation": "The old one explained that this sūtra wasn't a combination of three, wasn't praiseworthy, wasn't markless, wasn't limited to the same audience, wasn't in the order of the five periods, and explained that those who were eternally abiding were partial and indeterminate in their teaching.",
        "source": "X20n0359_003:0366a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙玄云南三北七通用三種教相一頓教指華嚴二漸教始從三藏小乘乃至涅槃常住三偏方不定教非頓非漸別有一經而明佛性常住指勝鬘楞伽央掘金光明之流宗愛法師以法華為會三歸一教柔次二師以淨名思益為褒貶抑揚教岌師以十二年後為無相教又柔次二師及道場觀師於漸開為五時一十二年前為有相教二十二年後為無相教三無相之後同歸之前褒貶抑揚指淨名等經四會三歸一教指法華五常住教指涅槃非是五時次第正道故謂偏方不定也。",
        "translation": "The three northern seven universal teachings of the Profound Yunnan Province are of three kinds: the first is the sudden teaching that refers to Huayan, the second is the gradual teaching that begins with the tripiṭaka and lesser vehicle and ends with the eternal abiding of nirvana, and the third is the partial and indeterminate teaching that's neither sudden nor gradual.",
        "source": "X20n0359_003:0366a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次是義下破文為二初破不在五時次第。",
        "translation": "○Second, this meaning is explained in the following two ways: first, it's explained that it's not in the order of the five periods.",
        "source": "X20n0359_003:0366a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是義不然若不列同聞非次第者列同聞眾應是次第鴦掘摩羅列同聞與眾經不異論褒貶與維摩意同論家何故不預次第若列眾不列眾皆非次第者亦應列眾不列眾俱是次第(云云)。",
        "translation": "If listing the many and not listing the many is not sequential, then listing the many and not listing the many should be sequential.",
        "source": "X20n0359_003:0366a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是義兩字指彼所立不然兩字今家斥非若不列下一十七字以列同聞而為並難若謂不列同聞眾非是五時次第者苟列同聞眾應是次第乎若謂列同聞乃是次第者且央掘列眾與諸經無異又復論褒貶亦與淨名同而汝何以故不以央掘經預五時次第而亦但判為偏方不定邪又復汝若謂央掘經列眾今經不列眾皆次第者亦應判諸經列眾不列眾俱是次第乎注云云者汝既判於今經央掘皆非次第是則央掘列眾今經不列眾既皆非次第何得不許列與不列俱是次第邪次則俱次不次則俱不次何得執不次不許次第邪妙玄云央掘列次第眾委悉諸經彈斥談常分明餘教釋梵四王及十弟子乃至文殊皆悉被訶斥同聞宛然應入次第而今判作偏方淨名亦是彈訶那得引為次第若央掘偏方則淨名非次言褒貶者褒謂褒美貶謂貶挫言論家者釋籤云南謂江南北謂河北自宋朝已來三論(中論百論十二門論)相承其師非一並宗羅什但年代淹久文疏零落至齊朝已來玄網殆絕江南盛弘成實河北偏尚毗曇于時高麗郎公至齊難成實師結舌無對因茲郎公自弘三論故知南宗初弘成實後尚三論而江南虎丘岌師及宗愛師等既弘成實及以三論復用頓漸偏方不定及五時等故云論家也。",
        "translation": "If you say that the multitude of those who are not heard together is not in order in five seasons, then how could you not allow the multitude of those who are heard together to be in order? If you say that the multitude of those who are heard together is in order, then the sutras are no different from the multitude of those who are listed in the central excavation, and furthermore, the praise and derogatory comments are the same as those of the pure name.",
        "source": "X20n0359_003:0366a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次若言下破偏方不定。",
        "translation": "○Second, if we say this, we'll refute the partiality and uncertainty.",
        "source": "X20n0359_003:0366b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言未應明常而明常是偏方不定者。",
        "translation": "If he says it's not yet appropriate to explain the constant, then he'll explain that the constant is partial and indeterminate.",
        "source": "X20n0359_003:0366b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言未應者即未當也他謂佛於涅槃經中方明常住今經既乃在涅槃前是故未應明常而忽明於常者乃是偏方不定耳意謂至涅槃明常即五時次第也今牒此計故云若言等也。",
        "translation": "This is because the Buddha explained eternal abiding only in the sutra on nirvāṇa. Since this sutra is before nirvāṇa, suddenly explaining eternal even though it shouldn't be explained is partial and indeterminate.",
        "source": "X20n0359_003:0366b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次破文中先引方等陀羅尼經並難。",
        "translation": "○Subsequent to the refutation of the text, he first cites the extensive Dhāraṇī sūtra and makes it difficult.",
        "source": "X20n0359_003:0366c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陀羅尼云王舍城波羅柰祇陀林三處與聲聞記此亦是未應會三而會三得為次第未應明常而明常何故不定耶。",
        "translation": "The dhāraṇī says that the three places in the Jeta Grove of Rājagṛha and the śrāvakas' records are also uncertain in that they should not meet three times but meet three times in order, and should not be clearly permanent but are clearly permanent.",
        "source": "X20n0359_003:0366c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙玄引經云先於王城授聲聞記今復於舍衛國授聲聞記昔於波羅柰授聲聞記(云云)會三顯一唯在法華陀羅尼經在法華前是方等部此則亦是未應會三而便會三汝既判於陀羅尼經得為次第今經若乃未應明常而明於常何故却是偏方不定。",
        "translation": "Miao Xuan cites the sūtra that says, \"First, the śrāvaka in Rājagṛha was given the śrāvaka record; now, the śrāvaka record is given in Śrāvastī; and in the past, the śrāvaka record was given in Polāna (cloudy).",
        "source": "X20n0359_003:0366c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○又法華下更引諸經明常例難。",
        "translation": "○Under the Lotus Sutra, we'll cite other sutras that explain the difficulty of constancy.",
        "source": "X20n0359_003:0366c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又法華般若淨名方等咸論常住得是次第此經明常獨居不定何耶。",
        "translation": "\"Furthermore, the Lotus Sutra and the Prajñāparinirvāṇa Sutra and the Vaipulya Sutra all discuss the eternal and the abiding, and this sūtra explains the eternal and the abiding alone, but why is it indeterminate?",
        "source": "X20n0359_003:0366c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法華云世間相常住般若明實際無來去淨名云佛身無為以至諸經是例非一汝既判於法華等經得為次第此經明常何得不然乎。",
        "translation": "Since you've ruled that the Lotus and other scriptures are secondary, how could this scripture's explanation of permanence not be?",
        "source": "X20n0359_003:0366c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次別破一師文為二初敘。",
        "translation": "○Second, the text of one teacher's specific refutation is divided into two, the first being a description.",
        "source": "X20n0359_003:0366c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又一師言此經與法華同是第四時山斤海滴與塵沙義齊故。",
        "translation": "Another teacher said, \"This sūtra and the Lotus are the same in meaning as the fourth period, when mountains and seas drip together with dust and sand.",
        "source": "X20n0359_003:0366c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼判法華於五時中屬第四時故以今經與法華同是第四時以謂今經山斤海渧是可數之法與法華塵沙之義齊等俱是無常故也塵謂微塵沙即恒沙法華但云世界塵數而言恒沙者此亦舉他之言耳非經文也(云云)。",
        "translation": "They say that the Lotus belongs to the fourth of the five periods, so they say that this sūtra and the Lotus are both of the fourth period because it means that the mountains, pounds, and drops of the ocean are countable dharmas, and the Lotus's meaning of dust and sand is the same, and both are impermanent.",
        "source": "X20n0359_003:0366c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次是義下破。",
        "translation": "○Second, this is the meaning of the following refutation.",
        "source": "X20n0359_003:0367a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是義不然新本云舍利繫縛色如來常住身無有舍利事何得山海而翳金光塵沙而蔽寶所。",
        "translation": "Otherwise, the new version says that sheli is fettered in form, and the Tathāgata's eternally abiding body has no such thing as sheli. How could it be that mountains and seas obscure gold and light, and dust and sand obscure jewels?",
        "source": "X20n0359_003:0367a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言舍利繫縛色等者新本具云如來真實身無有舍利事如來解脫身終無繫縛色。",
        "translation": "The new version of the teaching says that the true body of the Tathāgata has no such thing as rewards, and the body of the Tathāgata's liberation never has any such thing as rewards.",
        "source": "X20n0359_003:0367a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三破真諦文為二初敘。",
        "translation": "○The three refutations of the text of the true truth are two, the first being a description.",
        "source": "X20n0359_003:0367a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真諦三藏云此經是法華之後涅槃之前九十日說引涅槃云佛告波旬却後三月吾當涅槃信相聞斯故知八十應滅。",
        "translation": "The Tripiṭaka of the True Truth says that this sūtra was expounded ninety days before nirvāṇa after the Lotus, and quotes Nirvana as saying, \"The Buddha told Pāpīyān that three months after he left, I will become nirvāṇa, and I will hear about it with conviction.",
        "source": "X20n0359_003:0367a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前一師以此經屬第四時今真諦以此經在第四時後第五時前。",
        "translation": "The former teacher said this sūtra belongs to the fourth period, but now Truth says this sūtra comes after the fourth period and before the fifth period.",
        "source": "X20n0359_003:0367a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次是義下破。",
        "translation": "○Next, this meaning is explained below.",
        "source": "X20n0359_003:0367a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是義亦不然唱滅之旨非獨告魔定在三月法華云如來不久當般涅槃普賢觀亦云當般涅槃諸經唱滅非但一文何必九十日耶縱令三月為屬第四時為屬第五時若屬第四時法華已捨方便此中何得更許三乘同懺若屬第五時何得復言在前三月進退無據兩楹不攝(云云)。",
        "translation": "This meaning is also different. The purpose of the sermon is not to tell Māra alone that it's definitely in the third month, but the Lotus says the Tathāgata will soon attain parinirvāṇa, and the Samantabhadra contemplates that the sutras will soon attain parinirvāṇa.",
        "source": "X20n0359_003:0367a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其文可見智昇目錄云觀普賢行法經亦名普賢觀經楹(以成切)柱也注云云者以第四第五時名且舉他所立覈定進退耳非今家所明第四第五時也。",
        "translation": "The text can be seen in Zhisheng's catalog, which says that the Sutra of Contemplating the Practices of Samantabhadra is also called the Pillar of the Sutra of Contemplating Samantabhadra (in order to establish a cut), and the commentary says that it's called the fourth and fifth times and refers to the other established periods of nuclear concentration and advancement and retreat.",
        "source": "X20n0359_003:0367a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○今既不同下次明今意文為二初約時味判文為三初正判。",
        "translation": "Since the present is different, the next time we explain the present meaning, the text is divided into two, the first is about the flavor of the time, and the second is about the three proper judgments.",
        "source": "X20n0359_003:0367a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今既不同舊若為判教若安無相而時異若入會三而味別案下文云曾聞過去空閒之處有一比丘讀誦如是方等大乘既言方等豈非文耶。",
        "translation": "Now that it's different from the old, if it's a judgment teaching, if it's settled in marklessness and the time is different, if it's entered into the three assemblies and the taste is different, the following is a case where it was heard that in a past idle place there was a monk who recited this kind of vaipulya great vehicle, and since it's called vaipulya, isn't it the text?",
        "source": "X20n0359_003:0367a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言若為者即如何也若以此經安在第四般若無相熟酥味攝今經且不廣談空相故云時異若入第五法華會三醍醐所收今經既通三乘懺悔且非純一故云味別案者考也察也驗也下文指於流水品也方等經典雖通約理今正約時故此經方等生酥也。",
        "translation": "If this sūtra is placed in the fourth prajñāpāramitā, the flavor of ripened butter is included in this sūtra, and it doesn't discuss emptiness in detail, so it's called a different time.",
        "source": "X20n0359_003:0367b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次釋難者文有兩番初番為二初難。",
        "translation": "○Subsequent to the explanation of the difficulty, the text has two parts, the first of which is the first of two difficulties.",
        "source": "X20n0359_003:0367b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方等之教通於三乘新本云欲生人天欲得四果支佛欲得佛皆應懺悔滅除業障安處方等其義無疑而難者言新本云法界無異乘此害於通義。",
        "translation": "The new version says that those who want to be born in the heavens and those who want to attain the four fruits of Buddhahood should repent and remove karmic hindrances and be placed in a position similar to that of the three vehicles.",
        "source": "X20n0359_003:0367b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難意者新本既云法界無異乘豈非損害方等教通三乘之義乎。",
        "translation": "It's difficult to understand whether the new version's teaching that there are no different vehicles in the Dharma realm is a disservice to the shared meaning of the three vehicles in various teachings.",
        "source": "X20n0359_003:0367b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○然方等下次釋意。",
        "translation": "○How could this be?\" He explained the meaning of the next section.",
        "source": "X20n0359_003:0367b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然方等滿字通別通圓此旨非妨。",
        "translation": "However, the full set of words in vaipulya is shared with both distinctive and perfect meanings, which is not a detriment.",
        "source": "X20n0359_003:0367b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既通別圓何乖法界無異乘邪故四念處云通教有三義一因果皆通即當教始終者二因通果不通即菩薩中有利根受接者三通別通圓即別圓因果皆與通異藉通開導得入別圓之因成於雙非之果別圓之因雙非之果即是法界無異乘也當教始終即是通於三乘懺悔矣。",
        "translation": "Since it's shared with the distinctive and the perfect, how does it contradict the principle that the Dharma realm is the vehicle of no difference? Therefore, the four abodes of mindfulness say that the shared teaching has three meanings: first, the cause and effect are both shared, which is the beginning and end of the current teaching; second, the cause and effect are not shared, which is the one among bodhisattvas who has the favorable faculties to accept; and third, the shared, distinct, and perfect means that the cause and effect of the distinct and perfect are both different from the shared through the shared initiation and guidance, which leads to the cause of the distinct and perfect becoming the result of the two negations. The cause of the distinct and perfect and the result of the two negations are the Dharma realm's vehicle of no difference, which is the beginning and end of the current teaching, which is the repentance that's shared with the three vehicles.",
        "source": "X20n0359_003:0367b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次番文亦為二初難。",
        "translation": "○The next section of the text also contains two initial difficulties.",
        "source": "X20n0359_003:0367b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難者以不列同聞為疑。",
        "translation": "The difficulty is that it's doubtful not to include people who have heard the same thing.",
        "source": "X20n0359_003:0367b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且以通序不列為妨耳若別序壽量品列天龍等眾何故不言邪。",
        "translation": "Furthermore, if the general order doesn't list them as a hindrance, then why isn't the Longevity Chapter of the Special Order listed with gods, dragons, and others mentioned?",
        "source": "X20n0359_003:0367b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○次胡本下釋。",
        "translation": "○Second, we'll explain under the text of Hu.",
        "source": "X20n0359_003:0367b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "胡本尚多何必止四卷七軸或其文未度爾。",
        "translation": "Why must the Hu text still be limited to four volumes and seven axes? Perhaps the text is not yet complete.",
        "source": "X20n0359_003:0367c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且從前代所稱故云胡本耳應云梵本具如大部補注(云云)四卷者今經也七軸者新本也未度者未至也至唐義淨重譯十卷果有列眾何必疑也。",
        "translation": "The four-fascicle version is the present-day sūtra, and the seven-axis version is the newer version, which has yet to reach the ten-fascicle retranslation by Tang Yijing.",
        "source": "X20n0359_003:0367c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○如此下三結示。",
        "translation": "○These are the next three concluding remarks.",
        "source": "X20n0359_003:0367c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此斟酌五味明義則第三生酥攝。",
        "translation": "\"Thus, we deliberate on the five flavors and clarify their meaning, and then the third is to produce butter.",
        "source": "X20n0359_003:0367c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "斟者計也取也酌者挹也益也五味者大經云譬如從牛出乳從乳出酪從酪出生酥從生酥出熟酥從熟酥出醍醐佛亦如是從佛出十二部經從十二部經出修多羅從修多羅出方等從方等出般若從般若出涅槃以生酥味喻方等宛符經旨。",
        "translation": "Pouring is calculating, grasping, deliberating, pouring, benefiting, and the five flavors, as the great sūtras say, \"From the cow comes milk, from milk comes cream, from cream comes butter, from raw butter comes cooked butter, from cooked butter comes ghee, and from cooked butter comes ghee.",
        "source": "X20n0359_003:0367c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○若四藏下次約藏教判文為二初約雜藏判。",
        "translation": "○When the four collections are next discussed in terms of the canonical texts, there are two ways to discuss them.",
        "source": "X20n0359_003:0367c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若四藏明義則雜藏攝。",
        "translation": "If the four collections clarify the meaning, then the miscellaneous collections are included.",
        "source": "X20n0359_003:0367c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙玄第十章安雜錄云摩得勤伽(此云智母菩薩入此智母三昧作論申經令法久住)有二藏一聲聞二菩薩又諸經有三藏二如上更加雜藏分十一部經是聲聞藏方廣部是菩薩藏合十二部是雜藏又有四藏三如上更加佛藏釋籤云即以一教各對一藏聲聞雜菩薩佛等次第以對四教其意可見故以雜藏對於通教既通三乘則是雜也。",
        "translation": "The tenth chapter of the Miao Xuan An Zaolu says, \"The mātṛkāṅga (here, the wisdom mother bodhisattva enters this wisdom mother samādhi and makes a treatise to explain the sūtras so that the Dharma will last a long time) has two collections, one for the śrāvakas and two for the bodhisattvas, and the sūtras have three collections and two more as above for the miscellaneous collections, which are composed of eleven sūtras, the śrāvaka collection, the extensive collection, the bodhisattva collection, and the twelve collections combined, which are the miscellaneous collections.",
        "source": "X20n0359_003:0367c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四教明義下次約通教判。",
        "translation": "○The four teachings clarify their meaning, and the next time they are judged by the shared teachings.",
        "source": "X20n0359_003:0367c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四教明義則通教攝通教之中即得論帶別明圓也。",
        "translation": "The four teachings clearly define their meaning, and then the Shared Teaching incorporates the Shared Teaching into the Treatise, which is to say that it carries the distinctive, bright, and perfect.",
        "source": "X20n0359_003:0367c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "準前即是通別通圓仍加中道含真入通是故乃有三種中道而四明云就圓釋體判教屬通豈其然乎。",
        "translation": "In line with the preceding, that is, the Shared, Distinct, and Shared teachings are still supplemented by the Middle Way, which contains the true and enters the Shared.",
        "source": "X20n0359_003:0367c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金光明經玄義順正記卷下(終)",
        "translation": "Jin guangming jing xuanyi shunzheng ji rolled up (end)",
        "source": "X20n0359_003:0368a03_0",
        "is_bad_quality": false
    }
]