[
    {
        "source_sentence": "佛說觀無量壽佛經疏玅宗鈔會本卷第三日東　沙門　實觀　分會【鈔】二分文下隨經顯義前取經中名等五義解釋總題總意雖彰別文難顯故須以句節定經文令義顯現總別雖異義無兩塗方知玄義釋此經題復了疏句不顯他義分二初總別科判總科三分別科六章。",
        "translation": "Foshuo guan wuliangshou fo jing shou xuanzong chaohui ben vol. 3 dong shamen shiguan fenhui [chao] bifen xiaowen xi jing shanyi zhou jingzhong general title although the general meaning is clear the specific text is difficult to show therefore it is necessary to set the sūtra text in sections so that the meaning is revealed although the general and specific are different the meaning is not two coated then know the profound meaning explain the title of this sūtra furthermore understand the commentary sentence does not reveal the meaning of others divided into two first general and specific sections judge the general section three sections specific section six chapters.",
        "source": "X22n0407_003:0293a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】分文為三序正流通從如是訖清淨業處序分爾時世尊放眉間光訖諸天發無上道心正說當機益分爾時阿難白佛當何名下訖經流通分序中文二證信發起正說亦二淨業玅觀流通亦二王宮鷲山。",
        "translation": "The Bhagavān then released his eyebrow light, and the gods aroused their minds to the unsurpassed path and correctly explained the benefits of the present opportunity.",
        "source": "X22n0407_003:0293a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二初證下隨科解釋三初序分二初證信序即是通序大論云佛將涅槃阿難問佛一切經首當安何語佛答阿難應云如是我聞一時佛在某處某國土與某大眾非獨我法如是三世諸佛經初亦然故知六義即是通序以諸經同故亦名經前序付囑令安故亦名經後序結集者所置故今言證信者令聞者不疑故論第四問曰何不直說般若而言住王舍城答說時方人令人信故言六句者但以詮義究竟為句如佛但一字亦名句也二初標指六句。",
        "translation": "[Commentary] Second, the first part of the explanation follows the third part of the initial sequence. First, the sequence of the first realization of faith is the general sequence.",
        "source": "X22n0407_003:0293b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初證信序六句如是標於信我聞異外道一時辯息諍佛正明化主王城論住處列眾為同聞。",
        "translation": "[Commentary] The first six phrases that confirm faith are prefaced by six phrases that are thus labeled faith, self, hearing, and non-Buddhist one-time debate, quelling disputes, and the Buddha's correct explanation of the transformation of the lord of the king's castle, the abode of the discussion, and the listing of people as fellow-hearers.",
        "source": "X22n0407_003:0293b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】如是標於信者釋論第二問曰諸佛經何故初稱如是答佛法大海信為能入智為能度如是義者即是信也若人有信能入佛法無信不入不信者言是事不如是信者言是事如是我聞異外道親承於佛故曰我聞不同外道不稟佛也一時辯息諍者謂機熟受道之時故無諍也釋論云不應無一時佛自言一人出世多人得樂是者何人佛世尊也。",
        "translation": "[Commentary] Thus labeled faith, the second question of the Śākyamuni śāstra asked why the sutras first called it thus, answering that the great ocean of the Buddha's teaching is faith that enters, wisdom that saves, and such is the meaning of faith.",
        "source": "X22n0407_003:0293b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是。",
        "translation": "It's like this.",
        "source": "X22n0407_003:0293c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二如是下隨文釋義六初標信。",
        "translation": "[Commentary] Second, thusness follows the explanation of the six meanings of the text.",
        "source": "X22n0407_003:0293c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如是者諸法實相古今不異名如如理而說故為是決定可信故云如是。",
        "translation": "[Commentary] Thusness is the name by which the true characteristics of dharmas in the past and present don't differ, and it's explained as such in principle, so it's definite and trustworthy, therefore it's called thusness.",
        "source": "X22n0407_003:0293c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】信名忍樂理當言善方忍方樂理當則不異名如言善則無非曰是四教言理皆稱如是而有淺深若其三藏唯就世俗論於不異及以無非通雖即理但在二諦別教知中要先破二唯圓初心即了諸法一一中實當處皆如稱此而談無非曰是故圓望三教皆不如是此經所信雖未開廢而所被機不從偏小故但就圓明於如是決定可信也此句既爾下之五句皆以在圓故通序文通其義亦通而其意別今以別意釋其通文故此云也。",
        "translation": "[Crib Notes] Faith is called tolerant and happy, and the principle should be good when it's said that the principle of forbearance and happiness in all directions should not be different when it's called good, and then there's nothing wrong with it.",
        "source": "X22n0407_003:0293c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我聞。",
        "translation": "'I've heard.'",
        "source": "X22n0407_003:0293c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二我聞下異外道二初正釋。",
        "translation": "[Commentary] Second, I've heard of the following two non-Buddhist doctrines, and first, I'll explain them correctly.",
        "source": "X22n0407_003:0293c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】我聞者表異外道親承有在。",
        "translation": "Commentary: 'I've heard' means that he's a non-Buddhist who's personally committed to being present.",
        "source": "X22n0407_003:0293c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】有在者在於佛也雖釋我聞意多明聞次文明我。",
        "translation": "Although the explanation of 'I've heard' implies that it's mostly about hearing, the next step is to explain the self.",
        "source": "X22n0407_003:0293c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二我者下料簡二初立難。",
        "translation": "○Two kinds of I's are summarized below, the first establishing the problem.",
        "source": "X22n0407_003:0293c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】我者自在義一切法空無我何故說我。",
        "translation": "[Commentary] I am the meaning of self-existent, and all things are empty of self.",
        "source": "X22n0407_003:0293c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】我有自在及主宰義凡夫小乘於人法中而著於我今傳圓觀合順二空何得言我。",
        "translation": "[Commentary] I have the meaning of self-existent and dominant. Ordinary people and lesser vehicles attach to self in the context of human beings and dharmas.",
        "source": "X22n0407_003:0293c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二隨俗下通難二初直通。",
        "translation": "○Two, following the conventional, the following are the two first difficulties that are directly addressed.",
        "source": "X22n0407_003:0293c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】隨俗假名說我謂見慢名字若無我則無聞若無聞化道則絕為此義故雖知無我為傳化不絕假名說我。",
        "translation": "[Commentary] Following mundane conventionality, the nominal term 'self' means that if one sees the name of conceit, then there's no hearing, and if there's no hearing, then the path of transformation is cut off.",
        "source": "X22n0407_003:0293c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】畢竟空中雖我叵得此空即俗諸我宛然今且約三分別我相橫計主宰名為見我俱生主宰名為慢我隨世流布即名字我阿難尊者至結集時尚破同體見慢之我豈有界內二種我耶為傳化故故順玅俗立名字我。",
        "translation": "[Commentary] After all, although I am unobtainable in space, this emptiness is the conventional self that exists everywhere. Now, let's look at the three kinds of distinctive self that are horizontally imagined as dominant, which is called the view-self, and the co-arising dominant, which is called the conceited self that spreads along with the world, which is the name-self.",
        "source": "X22n0407_003:0294a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二如人下舉譬。",
        "translation": "○Two examples are given below that of a person.",
        "source": "X22n0407_003:0294a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如人以金錢易銅錢及草木等賣買法爾人無笑者故言我聞。",
        "translation": "[Commentary] Suppose a person trades money for copper, wood, and straw, etc., and sells and buys them because there's no one who laughs at them, so they say 'I've heard.'",
        "source": "X22n0407_003:0294a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】知無我理如用金錢隨俗立我如易銅錢及草木等。",
        "translation": "[Commentary] He knows the principle of selflessness like using money to establish a self according to the conventional like exchanging copper, coins, straw, trees, and so forth.",
        "source": "X22n0407_003:0294a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一時。",
        "translation": "One time.",
        "source": "X22n0407_003:0294a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三一者下辯息諍二初示論釋二初釋一。",
        "translation": "[Commentary] Three, one, the following debate is settled, and the first shows the explanation of the two first explains the one.",
        "source": "X22n0407_003:0294a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一者佛法無有定實之一云何稱一隨俗假說一耳釋論廣破一異也。",
        "translation": "[Commentary] One is that the Buddha's teaching has no set reality, so why would he call it one and follow the conventional hypothesis that it's one?",
        "source": "X22n0407_003:0294a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】先約真破次隨俗立在文可見釋論廣破一異者論云若一與物一一與物異二俱有過問曰若一有何過答曰若一瓶是一義在在有一處處皆應是瓶則無衣等諸物一中之過既然二中之過云何答若一與瓶異瓶則非一若瓶與一異一則非瓶若瓶與一合瓶名一者今一與瓶合何不名一為瓶是故不得言瓶異一彼文極廣蓋瓶顯可見故以瓶喻時也一則是數時則是體若於數體定執一異則諸惑紛然能離執者則於法解脫斯乃寄於數體一文示離著觀令於諸法皆祛定計即知六事及以諸文皆須離於一異之見也。",
        "translation": "[Commentary] First, it's refuted in terms of the truth, then it's posited according to the secular. The text shows that the exposition extensively refutes the difference between one and something. If one and something are the same, then what's wrong with both? Answer: If a bottle is one and the meaning is one, then there's one, and everywhere should be a bottle.",
        "source": "X22n0407_003:0294a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二釋時。",
        "translation": "○Two explanations of timing.",
        "source": "X22n0407_003:0294b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】時者有二種一迦羅即短時亦名實時二三摩耶名長時亦名假時。",
        "translation": "[Commentary] There are two kinds of time: the first is the kalā, which is a short time and is also called a real time, and the second is the samaya, which is called a long time and is also called a fake time.",
        "source": "X22n0407_003:0294b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】此土詮召但直云時天竺二音若云迦羅即是實時云三摩耶即是假時亦如此間心有二稱言智是解心言識是迷心故令依智不依識也外人執時以為實因是故對彼云三摩耶顯時是假若內弟子依時而食護明相等乃言迦羅顯時是實言迦羅短時三摩耶長時者若據論文短時長時並名三摩耶也謂方時離合一異長短等名字出凡人著心是故長短皆假無實今以短長分對二名者恐是大師依建立門巧會論意以依佛制時則生死時短外道執時則生死時長既迴論文必有此意。",
        "translation": "If we say kalā, which is the real time, and samaya, which is the fake time, we also say that there are two ways of referring to the mind in this world, which is to say that knowledge is the mind that understands and consciousness is the mind that's deluded, so we rely on knowledge and not consciousness.",
        "source": "X22n0407_003:0294b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二今不下明今意。",
        "translation": "○Two, now is not the time to explain the present meaning.",
        "source": "X22n0407_003:0294b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今不論長短假實說此經竟總云一時。",
        "translation": "[Commentary] Now, regardless of whether it's long or short, this sūtra is said to finish with a general statement of one time.",
        "source": "X22n0407_003:0294b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】言不論等者今非界內護明相等故不論實時又非破外執時為實故不論假時長短如前但是眾生機熟佛應說經機應合一之時亦是諦智合一之時故云一時文但從應故云說經豈無機感佛空說法故佛說竟韋提悟訖然一時文義本通深淺今意別在圓機感佛故使凡夫頓入法忍。",
        "translation": "[Commentary] When it says regardless, it doesn't matter if it's when the protection of awareness within the [three] realms is equal, so it doesn't matter when it's real, and it's not when external attachments are destroyed, so it doesn't matter if it's a fake time or a short time. As before, it's when sentient beings' abilities are ripe and when the Buddha should teach the sutra, when abilities and responses are unified, and when truths and wisdom are unified, so it's called one time.",
        "source": "X22n0407_003:0294b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛。",
        "translation": "Buddha.",
        "source": "X22n0407_003:0294b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】四佛者下化主三初約異名釋。",
        "translation": "[Commentary] The four buddhas are the next three lords of transformation, and the first is an explanation by synonym.",
        "source": "X22n0407_003:0294b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】佛者亦婆伽婆此云有大名聲亦云能破煩惱。",
        "translation": "[Commentary] A buddha is also called a bhagavān, which means he has great fame and renown and is able to break the afflictions.",
        "source": "X22n0407_003:0294c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】大論第四以四義釋婆伽婆一能破煩惱二有功德三巧分別能分別諸法總相別相故四好名聲無有得聲名如佛者故今文略出二義新云薄伽梵具六義一自在二熾盛三端嚴四名稱五吉祥六尊貴以多含故不翻舊云婆伽婆訛也。",
        "translation": "The new version of the text abbreviates the two meanings, saying that the Bhagavān has six meanings: one is self-permeable, two is exuberant, three is dignified, four is known, five is auspicious, and six is honored.",
        "source": "X22n0407_003:0294c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二佛者下約三覺釋。",
        "translation": "○Two buddhas are explained below in relation to the three awakenings.",
        "source": "X22n0407_003:0294c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】佛者平等開覺故名為佛既能自覺復能覺他覺行備滿。",
        "translation": "[Commentary] A buddha is an equally enlightened person who's called a buddha because he's able to enlighten himself and also enlighten others about the full range of enlightenment and practices.",
        "source": "X22n0407_003:0294c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】佛者下總示既能下別示三覺對迷說自對自說他對因說滿一平等覺對三不同說為三覺。",
        "translation": "[Commentary] The Buddha is shown in general underneath, and the three feelings are shown separately underneath, as being able to explain to the deluded about self, to explain to self about others, and to explain to cause about the fulfillment of one equal feeling and three different explanations of the three feelings.",
        "source": "X22n0407_003:0294c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三一切下約超因釋。",
        "translation": "○Three of them are explained below in terms of transcendent causes.",
        "source": "X22n0407_003:0294c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一切智異外道慈悲異二乘平等異小乘尊極名為佛。",
        "translation": "[Commentary] Omniscience is different from the outsiders, compassion is different from the two vehicles, and equality is different from the lesser vehicle, and the most revered name is Buddha.",
        "source": "X22n0407_003:0294c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】一切智故異外邪癡無緣慈故略小自度三智等故異偏菩薩究竟覺故異諸因位能異不殊對所異故四種分別然釋佛義六即等說其文稍委故今略云。",
        "translation": "[Commentary] All wisdom therefore differs from non-Buddhist delusion, and lacking conditioned compassion, it's a summary of the lesser self-salvation, the three wisdoms, and so forth, which differ from the partially bodhisattva's ultimate awakening, which differs from the causal stages, and the four kinds of distinctions that can be made, even though the explanation of the Buddha's six meanings is a summary of the text.",
        "source": "X22n0407_003:0294c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在王舍城耆闍崛山中。",
        "translation": "He was in the Gṛdhrakūṭa mountains of Rājagṛha.",
        "source": "X22n0407_003:0294c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】五在者下論住處二初釋住二初會在同住。",
        "translation": "[Commentary] Five abodes are discussed below, two abodes are explained in the first, and two abodes are assembled in the same abode in the first place.",
        "source": "X22n0407_003:0294c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】在者暫時曰在久停名住一往語耳。",
        "translation": "Commentary: \"In\" is temporarily called \"staying for a long time,\" and \"staying for a long time\" is called \"going back.",
        "source": "X22n0407_003:0294c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】在暫住久一往分之故非盡理久在暫住有何所妨況靈鷲山如來應身常在其中豈得言暫。",
        "translation": "[Commentary] Being temporarily present for a long time is called staying for a long time, so it's not the end of the truth.",
        "source": "X22n0407_003:0294c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二住者下約論釋住此經云在大品言住其義不別故引彼論住義釋在分二初標列。",
        "translation": "○Two abodes are explained in the following discussion of abiding. This sūtra says that the meaning of abiding is not distinct in the major section, so it's cited in the explanation of the meaning of abiding in the two sections.",
        "source": "X22n0407_003:0294c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】住者四威儀皆為住差別者謂天住梵住聖住佛住也。",
        "translation": "[Commentary] \"Abiding\" refers to the four comportments that are abiding, which are the heavenly abode, the brahma abode, the noble abode, and the Buddha abode.",
        "source": "X22n0407_003:0295a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】四威儀者謂行住坐臥此之身儀皆住靈鷲而能住法則有四差即天梵聖佛也。",
        "translation": "[Commentary] The four comportments are walking, standing, sitting, lying, and lying down, and these bodily actions all abide in Vulture, and there are four distinctions in the way they abide, namely, heaven, Brahma, sage, and Buddha.",
        "source": "X22n0407_003:0295a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二天住下解釋。",
        "translation": "○Two heavenly abodes are explained below.",
        "source": "X22n0407_003:0295a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】天住謂六欲天因即施戒善心也梵住從初禪至非想因即四無量心也聖住三乘人因即三三昧也佛住首標嚴百八三昧十力四無畏十八不共也。",
        "translation": "[Commentary] The heavenly abodes are the six causes of the heaven of desire, which are the virtuous intentions of generosity and morality; the brahma abodes are from the first dhyāna to the cause of nonconception, which are the four immeasurable states of mind; the noble abodes are the causes of the three vehicles, which are the three samādhis; and the buddha abodes are the 108 samādhis, the ten powers, the four fearlessnesses, and the 18 uncommon ones.",
        "source": "X22n0407_003:0295a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】今四住文乃是盡取論釋住義是知四中皆明因果而所住法正在於因所謂如來以攝物故示現施戒及十善心此即佛以欲天之法住王舍城為物示現四無量心示三三昧即梵法聖法住王城等此皆如來隨他意住若隨自意即以楞嚴至不共等住王城也故普賢觀云釋迦牟尼名毗盧遮那此佛住處名常寂光釋迦遮那既是異名王城寂光畢竟無二故云此佛住處名常寂光今之所住是何境界又應了知若以人法分於能所施戒至于首楞嚴等皆所住法佛為能住若以王城為所住處上之人法皆名能住又據經文但云佛住論應唯就首楞嚴釋而明前三者荊谿二解一從通以趣別從廣之狹也二將勝以攝劣佛住王城必攝欲色及以三乘佛住既勝則無法不住非不住惡為引物故且從善說而於善中就世間善略指定散收一切善故言天梵於出世中略指小大攝一切法故言聖佛他人不明能住心法唯云身住王舍城等則抑極聖同凡夫住況復凡聖各各有於能住之法且如比丘修戒定慧乃以天梵及以聖住住於房舍若破戒者則以地獄住於房舍其有能修一心三觀則所住處即空假中豈非楞嚴為能住法初心尚爾如何果佛唯論身住。",
        "translation": "[Commentary] Now, the four abodes are all explained in the explanation of the meaning of abode. This is because the four abodes are all explained as cause and effect, and the abode is in the cause. The Tathāgata manifests the generosity, precepts, and ten good mental states because he wants to gather things. This is the Buddha's abode in Rājagṛha as a thing, and he shows the four immeasurable mental states, the four samādhis, the Brahma teachings, the holy teachings, and the abode in Rājagṛha, and so forth.",
        "source": "X22n0407_003:0295a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二王舍下釋處二初各釋城山二初釋城二初翻梵名。",
        "translation": "○Two, under Rājagṛha, we'll explain the two places, the first explaining the city and the second explaining the city and the first translating the Sanskrit name.",
        "source": "X22n0407_003:0295b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】王舍城者天竺云羅閱祇伽羅。",
        "translation": "[Commentary] The city of Rājagṛha is known as Rājagṛha in India.",
        "source": "X22n0407_003:0295b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】亦名摩竭提此云不害言此國法不行刑戮其有犯死罪者送置寒林。",
        "translation": "It's also called Magadha, which is the word for non-harming. It means that the laws of this country don't punish or kill people who commit capital crimes and send them to the cold forest.",
        "source": "X22n0407_003:0295b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二釋論下解釋三初約諸王治化釋。",
        "translation": "The first three are explained in terms of the kings who govern and convert.",
        "source": "X22n0407_003:0295b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】釋論解摩伽陀國王有夫人生子一頭兩面四臂人謂不祥王即裂其身首棄之曠野羅剎女鬼名闍羅還合其身以乳養之後大成人力能并國王有天下取諸國王萬八千人置此五山以大力勢治閻浮提閻浮提人因此名王舍城也。",
        "translation": "The commentary explains that the king of Magadha had a wife who gave birth to a son with one head and two faces and four arms, which is called unlucky. The king then split his body and threw his head into the wilderness, and the female Rāṣṭrapāla ghost named Jala returned his body and nursed it.",
        "source": "X22n0407_003:0295b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二又先下約移居免火釋。",
        "translation": "[Commentary] Second, it's explained below in terms of moving to a place free of fire.",
        "source": "X22n0407_003:0295b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又先所住城城中失火一燒一作如是至七國人疲役集諸智人宜應易處即求覓地見此五山周匝如城即作宮殿王於中住故名王舍。",
        "translation": "[Commentary] Also, when a fire broke out in the city where he was staying, one was burned, and another was created, so up to seven countries were exhausted, and it was appropriate for wise men to find an easy place to stay.",
        "source": "X22n0407_003:0295b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三又下約畏罪得處釋。",
        "translation": "[Commentary] 3: The following is an explanation of the place where fear of evil obtains.",
        "source": "X22n0407_003:0295c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又古昔國王名婆藪厭世學仙妄云天祀中應殺生噉肉身陷地獄其子廣車次復為王自念我父生入地獄今欲出家復畏地獄欲治天下復恐有罪當何處身作是念時空中語言汝行若見難值希有處當作舍住王出畋獵見一鹿走疾如風王便逐之至此山周匝峻固其地平正生草細輭好華徧地茂林華果溫泉浴池皆悉清淨天雨天香奏天伎樂乾闥婆等適見王來各自還去見此靈奇於中起舍故名王舍城也。",
        "translation": "[Commentary] Also, in ancient times, the king of a country named Vasubandhu was disillusioned with the world and trained immortals, falsely claiming that in the midst of the heavenly sacrifice one should kill and bite meat and fall into hell.",
        "source": "X22n0407_003:0295c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二耆闍下釋山二初翻名。",
        "translation": "[Commentary] Secondly, under Gṛdhrakūṭa, we'll explain the two initial ways of translating the name of the mountain.",
        "source": "X22n0407_003:0295c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】耆闍崛山者翻名靈鷲。",
        "translation": "[Commentary] This is called Mount Gṛdhrakūṭa, which is also called Vulture.",
        "source": "X22n0407_003:0295c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二諸聖下解釋三初約聖靈依就釋。",
        "translation": "[Commentary] Second, the sages explained the three first explanations in terms of the reliance of the sages' spirits on it.",
        "source": "X22n0407_003:0295c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】諸聖仙靈依之而住。",
        "translation": "[Commentary] The noble sages and immortal spirits rely on it.",
        "source": "X22n0407_003:0295c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二又名下約山形似鷲釋。",
        "translation": "[Commentary] Second, under Names, we'll discuss the mountain's resemblance to a vulture.",
        "source": "X22n0407_003:0295c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又名鷲頭峯形似鷲。",
        "translation": "[Commentary] It's also called Vulture Peak, which is shaped like a vulture.",
        "source": "X22n0407_003:0295c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三又山下約鷲鳥棲隱釋。",
        "translation": "[Commentary] 3. Also, there's a mountain below about where eagles roost and hide.",
        "source": "X22n0407_003:0295c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又山南有尸陀林諸鷲食屍竟棲其山。",
        "translation": "[Commentary] Also, south of the mountain there's the Śītā Forest, where the eagles finish eating corpses and roost on the mountain.",
        "source": "X22n0407_003:0295c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二然法下總示法應。",
        "translation": "[Commentary] Second, under Rājñāpāramitā, we'll explain the Dharma response in general.",
        "source": "X22n0407_003:0295c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然法身無像實不假地所居為欲利益故隨化身明化主住處耳。",
        "translation": "[Commentary] However, the Dharma body has no image and really doesn't pretend to be a place where people live, so they follow the transformation body to show where the master of transformation lives.",
        "source": "X22n0407_003:0295c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】不言報者報能冥法復能垂應既言法應報在其中三身融玅言且暫分體常相即。",
        "translation": "Since it doesn't say \"reward,\" the reward can be meditative and the Dharma can also be responsive, since it says the Dharma response is within it, the three bodies are interpenetrated, and the three bodies are transient, the essence is always the same.",
        "source": "X22n0407_003:0295c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○六與大下列同聞二初標科辯次。",
        "translation": "○6. He was heard together with the following large assembly of monks, first by way of explanation and then by way of sequential explanation.",
        "source": "X22n0407_003:0295c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】與大比丘眾下列同聞眾也先聲聞次菩薩顯示教中二乘外相為勝菩薩心雖是勝外相無定是故後說也。",
        "translation": "First, the śrāvakas and then the bodhisattvas show that the external marks of the two vehicles in the teaching are superior to the bodhisattva's mind, even though the external marks are superior and indeterminate.",
        "source": "X22n0407_003:0296a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二聲聞下依次解釋二初聲聞眾二初分科示略。",
        "translation": "[Commentary] Second, the śrāvakas explain the following in order: first, the śrāvaka community; first, they delineate and outline the categories.",
        "source": "X22n0407_003:0296a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】聲聞先標位次列數何不歎德非是無德譯經人略。",
        "translation": "[Commentary] śrāvakas first identify the stages, then list the number of those who don't praise virtue and don't lack virtue.",
        "source": "X22n0407_003:0296a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與大比丘眾。",
        "translation": "He was with the great assembly of monks.",
        "source": "X22n0407_003:0296a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二與若下隨文解釋二初標位四初釋與。",
        "translation": "[Commentary] Second, they explained the following text, first indicating the stages, and then explaining the four first explanations of the meaning of \"with.",
        "source": "X22n0407_003:0296a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】與者共義一處一時一心一戒一道一見一解脫等皆一故名共也今經與阿難諸大眾同聞故云與也。",
        "translation": "Commentary: 'With' means in common, a place, a time, a mind, a precept, a path, a view, and liberation are all one, so it's called 'in common.' Now, the sūtra was heard together with Ānanda and the large crowd, so it's called 'with.'",
        "source": "X22n0407_003:0296a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】與即共義以七一釋七種一故方成共義若據時判已屬生蘇且從本說七在三藏同感佛時同鹿苑處同別脫戒同一切智心同無漏正見同三十七道同有餘脫昔同七者今日同聞然此觀門佛將阿難及以目連入韋提希後宮宣說大眾未聞至迴靈山阿難具述方得同聞。",
        "translation": "[Commentary] To be with means to be in common, and to interpret the seven kinds of oneness in terms of the seven ones.",
        "source": "X22n0407_003:0296a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二大義下釋大。",
        "translation": "○Two great meanings are explained under Greatness.",
        "source": "X22n0407_003:0296a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大義有三謂大多勝天王大人所敬故言大徧解內外經書名曰多出九十五種上號為勝此等皆是無學小乘中極故云大也。",
        "translation": "[Commentary] There are three meanings of great, which are that they are mostly superior, respected by the lord god king, and therefore called great, because they are universally understood, both inside and outside of scriptures and books, and are called many, ninety-five kinds of superiority, which are the very pinnacle of the lesser vehicle of post-learners.",
        "source": "X22n0407_003:0296a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】華言大者梵曰摩訶乃含三義謂大多勝故須就本三義釋之大人所歸德量大故梵王師陳如帝釋師迦葉等通內外典識解多故出九十五知見勝故皆無疑解脫故小中極雖標一大義必具三。",
        "translation": "[Commentary] When the flower says great, the Sanskrit word is mahā, which contains three meanings that is, the great majority is superior, so it must be interpreted in terms of the original three meanings of the great person to whom the virtues of the king of Brahmā, Shia Chen, and Śākyamuni Kāśyapa, etc. are vast in their understanding of internal and external scriptures, so they produce ninety-five kinds of knowledge and views that are superior, so they are liberated without doubt.",
        "source": "X22n0407_003:0296a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三釋比丘二初標列六義。",
        "translation": "○Three explanations of the bhikṣus and two, the first indicating the six meanings.",
        "source": "X22n0407_003:0296b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】比丘者因果六義因名乞士怖魔破惡果號應供殺賊無生。",
        "translation": "[Commentary] A monk has six meanings of cause and effect.",
        "source": "X22n0407_003:0296b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】因三果三一一主對。",
        "translation": "[Commentary] The three causes and three effects are discussed in detail below.",
        "source": "X22n0407_003:0296b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○一釋論下隨要釋三因三若成果三自剋復欲行者効彼修因故釋因三三中初乞士。",
        "translation": "If the three fruits are self-imposed, those who want to practice again will apply themselves to the cultivation of those causes, so they'll explain the first of the three causes.",
        "source": "X22n0407_003:0296b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】釋論淨目問舍利弗乞士者有四種食合藥種植田園名下口食仰觀星宿名仰口食四方巧語名方口食呪術卜算名維口食比丘不作此四名清淨乞士也。",
        "translation": "[Commentary] The Śāriputra's pure title asks Śāriputra: \"There are four kinds of beggars who eat, combine medicine, plant fields, and call down mouths food, look up at the stars and constellations, and call up mouths food, speak skillfully in four directions, and call up directions mouths food, divination, and fortune telling, and call up mouths food.",
        "source": "X22n0407_003:0296b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】今舉身子答彼淨目乞士之義須離上下方維之食常行乞食清淨活命故名乞士至果乃成應供德也。",
        "translation": "[Commentary] Now, I'll raise the body of the monk to answer the question of the pure-eyed beggar's meaning of secluding himself from the food of the upper and lower realms and always practicing begging for food that's pure and provides for life, so he's called a beggar until he reaches fruition and then achieves the virtue of making offerings.",
        "source": "X22n0407_003:0296b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二怖魔。",
        "translation": "○Two fears of Māra.",
        "source": "X22n0407_003:0296b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】怖魔者若發心出家地行夜叉唱飛行空中展轉乃至六天魔王聞之怖畏失人眾也。",
        "translation": "[Commentary] Terrorizing Māra is when a renunciant Yakṣa sings, flies through the air, and is heard by the six heavenly Māra Kings who are terrified of the multitude of people who have lost their lives.",
        "source": "X22n0407_003:0296b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】魔主生死在家受欲增長生死出家離染趣向無生是故魔王聞之生怖染欲破戒魔還快樂勤修三學果證無生。",
        "translation": "[Commentary] Māra lords birth and death, those at home who wish to grow in birth and death, those who leave home, those who leave defilement, and those who head for nonproduction.",
        "source": "X22n0407_003:0296b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三破惡。",
        "translation": "○Three refutations of evil.",
        "source": "X22n0407_003:0296b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】破惡者能破煩惱九十八使悉皆破斷故名破惡。",
        "translation": "[Commentary] Destroying evil is called destroying evil because it destroys all 98 afflictive tendencies.",
        "source": "X22n0407_003:0296b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】見思二使共九十八名惡名賊修觀推窮名為破惡證智斷盡名為殺賊。",
        "translation": "[Commentary] The ninety-eight evils in total of the two afflictive tendencies of views and perceptions are called the thief, and cultivating and observing them to push them to their limit is called destroying evil and realizing the end of knowledge is called killing the thief.",
        "source": "X22n0407_003:0296b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四眾者下釋眾三初釋通名。",
        "translation": "○The four multitudes are explained below, and the first three are explained in general terms.",
        "source": "X22n0407_003:0296b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】眾者四人已上乃至百千無量一處羯磨作法行籌布薩事理二和無有違諍名和合眾也。",
        "translation": "[Commentary] The congregation is composed of four people and upward, up to a hundred thousand and immeasurable one-place karmas, practices, rituals, and buds, and the two truths are harmonized without conflict, which is called the harmonized mass.",
        "source": "X22n0407_003:0296c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二一有下釋別相。",
        "translation": "[Commentary] The following explains the distinctive aspects of the two one-part existence.",
        "source": "X22n0407_003:0296c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一有羞僧持戒無違二無羞僧不持戒不別好惡三無知僧雖不破戒不別輕重二人共諍不能判決默然無言四真實僧謂學無學人。",
        "translation": "First, there are shy monks who observe the precepts without transgression; second, there are shy monks who don't observe the precepts without distinguishing between good and evil; third, there are ignorant monks who don't transgress the precepts without distinguishing between serious and minor, and who are unable to decide a dispute together and remain silent without saying anything; and fourth, there are true monks who are trainees and those who aren't.",
        "source": "X22n0407_003:0296c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三今此下明去取。",
        "translation": "[Commentary] Three, now this is the next step in explaining how to get rid of them.",
        "source": "X22n0407_003:0296c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今此二僧得共羯磨同聞證信唯取無學人也。",
        "translation": "[Commentary] Now, these two saṃgha can share the same karma, hear and realize faith, and only take the person who's an apprentice.",
        "source": "X22n0407_003:0296c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】羯磨通凡故取有羞今此二僧者即有羞真實也論云是中二種僧可共百一羯磨同聞證信尚簡學人前三絕分也。",
        "translation": "[Commentary] Because karma is common to ordinary people, it's taken as shy. Now, these two kinds of saṃgha are shy and true, too.",
        "source": "X22n0407_003:0296c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "千二百五十人俱。",
        "translation": "There are twelve hundred and fifty of them.",
        "source": "X22n0407_003:0296c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二千二下列數二初標人合數二初合一千。",
        "translation": "[Commentary] Two thousand and two are the following two numbers, the first one being the number of people combined, and the first one being the number of thousand.",
        "source": "X22n0407_003:0296c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】千二百五十人者列數也三迦葉兄弟有千弟子優樓此云木瓜林伽耶此云城那提此云江昔共起剎今連枝也。",
        "translation": "[Commentary] The list of 1,250 people also includes the three Kāśyapa brothers who had 1,000 disciples, Uruvilvā, which is called the papaya, Lingaja, which is called the city of Nadī, which is called the river that used to together produce the bases and now connects the branches.",
        "source": "X22n0407_003:0296c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二舍利下合二百五十。",
        "translation": "[Commentary] The two Śāriputra brothers were together two hundred and fifty people.",
        "source": "X22n0407_003:0296c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】舍利弗名翻言珠子亦云身子姓拘栗陀目犍連姓也翻讚頌亦萊茯根或云胡豆二人共有二百五十人。",
        "translation": "[Commentary] Śāriputra's name is translated as Jewel, and his surname is Kuruṭa and Maudgalyāyana's surname is also translated into hymns, and it's also called Porigen or Khotan.",
        "source": "X22n0407_003:0296c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二迦葉下常隨所以。",
        "translation": "[Commentary] Second, Kāśyapa always follows this.",
        "source": "X22n0407_003:0296c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】迦葉舍利弗等先並事火翻邪入正艱苦累載都無所獲一遇見佛便得上果感佛恩深常隨侍佛為同聞眾。",
        "translation": "[Commentary] Kāśyapa, Śāriputra, and the others first served the fire, turned from wrong to right, and suffered many years without attaining anything.",
        "source": "X22n0407_003:0296c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩三萬二千文殊師利法王子而為上首。",
        "translation": "The bodhisattvas, 32,000 Mañjuśrī princes of the Dharma, were the leaders.",
        "source": "X22n0407_003:0297a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二菩薩眾二初料四文。",
        "translation": "[Commentary] There are two kinds of bodhisattva congregations, and the first one contains four texts.",
        "source": "X22n0407_003:0297a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】菩薩位中有四第一明位第二列數三萬二千人第三標名文殊第四結為上首。",
        "translation": "[Commentary] There are four bodhisattva stages, the first specifying the stages, the second listing 32,000 people, the third naming them Mañjuśrī, and the fourth concluding them as the head.",
        "source": "X22n0407_003:0297a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二天竺下釋二義二初釋位。",
        "translation": "[Commentary] Second, Tianzhu explained the two meanings of the two first, he explained the stages.",
        "source": "X22n0407_003:0297a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】天竺云摩訶菩提質帝薩埵此云大道心成眾生。",
        "translation": "Commentary: In India, it's called mahābodhisattva, and here it's called the great way to accomplish the minds of sentient beings.",
        "source": "X22n0407_003:0297a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二文殊下翻名。",
        "translation": "[Commentary] Second, Mañjuśrī translates the name under Śākyamuni.",
        "source": "X22n0407_003:0297a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】文殊此云玅德以法化人名法王子也。",
        "translation": "[Commentary] Wenshu is called the prince of the Dharma after the profound virtue of transforming people with the Dharma.",
        "source": "X22n0407_003:0297a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二發起序二初對辯不同二初泛舉差別。",
        "translation": "[Commentary] Second, the sequence of initiation is twofold, the first one contrastively different, and the second one generically distinguished.",
        "source": "X22n0407_003:0297a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二發起序者諸經不同或放光動地微笑入禪自唱位號勸人令問。",
        "translation": "[Commentary] The preface to the second initiation differs among the sutras, or it might emit light, move the earth, smile, enter meditation, and call itself by its title to encourage people to ask questions.",
        "source": "X22n0407_003:0297a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】放光如法華經放眉間光照東方萬八千土也動地如大品世尊以神通力大千國土六種震動微笑如報恩經爾時如來熙怡微笑也入禪如金光明經是時如來遊於無量甚深法性也自唱位號如梵網經我今盧舍那方坐蓮臺也勸人令問如涅槃經普告眾生大覺世尊將入涅槃若有所疑今悉可問為最後問也然諸經發起事或兼有之今且各舉一端以明發起之相。",
        "translation": "[Commentary] Emitting light as in the Lotus Sutra, emitting a ray of light between the eyebrows that shines on eighteen thousand lands in the east; moving the earth as in the Mahāprajñāpāramitā-sūtra; shaking the six kinds of earthquakes in a thousand lands with his supernormal powers; smiling as in the Repayment of Kindness Sutra; entering meditation as in the Golden Light Sutra; the Tathāgata then wandering about in the innumerable and exceedingly profound Dharma nature; singing his own title as in the Brahmā's Net Sutra; sitting on a lotus platform in the direction of Rocana; encouraging others to ask questions as in the Nirvana Sutra; telling sentient beings that the World Honored One is about to enter Nirvana and that if they have any doubts, they can all ask about it now as the last question; yet there are some things that are initiated by various sutras.",
        "source": "X22n0407_003:0297a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二今經下正顯今經二初正顯。",
        "translation": "○Two. This sūtra then directly shows the two first things that are directly shown in this sutra.",
        "source": "X22n0407_003:0297a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今經正以殺父以為發起。",
        "translation": "[Commentary] The present sūtra precisely refers to the killing of one's father as the initiating circumstance.",
        "source": "X22n0407_003:0297a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二何故下釋疑。",
        "translation": "[Commentary] Second, why is it explained below as a doubt?",
        "source": "X22n0407_003:0297a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】何故舉此逆事為發起耶為彰此界極惡令人厭棄親所生子猶尚危害即欲令人同欣淨土下韋提希願為我說無憂惱處不樂閻浮濁惡之世。",
        "translation": "[Commentary] Why is this heinous act cited as the initiating factor? It's to show that this world is extremely bad and disgusting, that relatives' sons are still endangered, and that we want to make people rejoice in the Pure Land together.",
        "source": "X22n0407_003:0297b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二就中下總科略釋二初分科。",
        "translation": "[Commentary] Second, let's take the middle section and explain the two first sections in brief.",
        "source": "X22n0407_003:0297b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】就中為二初爾時下正明殺父次問守門人下明欲害母。",
        "translation": "First, he asked the gatekeeper about killing his father, and second, he asked about the gatekeeper's desire to harm his mother.",
        "source": "X22n0407_003:0297b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二問頻下釋三初問答釋疑二初問。",
        "translation": "The first three questions were answered and the second question was answered with a doubt.",
        "source": "X22n0407_003:0297b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】問頻婆何故遣人說法韋提何故如來自往。",
        "translation": "[Commentary] He asked why Bimba had sent someone to preach and why Vaideh had come by himself.",
        "source": "X22n0407_003:0297b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】頻婆韋提皆請弟子赴頻婆請何故唯遣目連樓那至赴韋提何故如來躬親而往。",
        "translation": "[Commentary] Why did Bimba and Vaideh all invite their disciples to go to Bimba? Why did he only send Mucilinda to Vaideh? Why did Tathāgata go there himself?",
        "source": "X22n0407_003:0297b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二答。",
        "translation": "○Two answers.",
        "source": "X22n0407_003:0297b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】答父願聞法遣入傳授為化義足母求生淨土非佛不開故須自往。",
        "translation": "[Commentary] A father wishes to hear the teaching, sends it in to impart the meaning of the teaching, and seeks rebirth in the Pure Land unless the Buddha doesn't reveal it.",
        "source": "X22n0407_003:0297b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】頻婆國父願聞戒法可遣人授韋提國母機在玅觀須佛親開父母之稱從闍王得。",
        "translation": "[Commentary] A father in Vipa who wishes to hear about the precepts can send someone to confer the precepts on a mother in Vaidyā who has the capacity to observe the profound meaning and must be personally enlightened by the Buddha, and the parental title must be obtained from the king.",
        "source": "X22n0407_003:0297b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二頻婆下預翻名字。",
        "translation": "○Two: \"Bimbisāra\" is a name that's translated in advance.",
        "source": "X22n0407_003:0297b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】頻婆娑羅此云摸實亦曰影堅韋提希此云思惟阿闍世此云未生怨或婆羅留支此云折指內人將護名為善見也。",
        "translation": "Commentary: \"Bimbisāra is called 'touching the truth,' and it's also called 'shadowing the firm.' Vaidehī is called 'contemplating the Ajātaśatru,' which is called 'unarisen enmity,' or 'Bālāruci,' which is called 'folding the fingers of the inner circle and naming the protection as 'good views.'",
        "source": "X22n0407_003:0297b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三初段下隨科解經初正明殺父二初分科。",
        "translation": "[Commentary] The first of the three preliminary sections follows the explanation of the sūtras, beginning with the correct explanation of killing one's father and the second preliminary section.",
        "source": "X22n0407_003:0297b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初段為四一頻婆為子幽禁二國太夫人密奉王食以濟王命三漱口畢下聖為說法以潤王心四如是時間下明因食兼由聞法多日不死。",
        "translation": "[Commentary] The first section is divided into four: first, Vipa was imprisoned for her son; second, the king's wife secretly served food to the king to help him save his life; third, she rinsed her mouth and then spoke the sage's teaching to nourish the king's mind; and fourth, she explained that this was the cause of the food and the reason she heard the teaching and didn't die for many days.",
        "source": "X22n0407_003:0297b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時王舍大城有一太子名阿闍世隨順調達惡友之教收執父王頻婆娑羅幽閉置於七重室內制諸羣臣一不得往。",
        "translation": "It was then that in the great city of Rājagṛha there was a prince named Ajātaśatru who followed the teaching of a bad friend, took possession of his father, King Bimbisāra, and placed him in a seven-storied room, controlling the ministers so that none of them could go there.",
        "source": "X22n0407_003:0297b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二初爾下隨釋四初為子幽禁二初隨釋經文二初師資現事二初釋時處標人。",
        "translation": "[Commentary] First, there were four explanations following the first one, namely, that the son was secluded, and second, there were two explanations following the explanation of the sūtras, namely, that the master was present, and first, he explained the time and place and referred to the person.",
        "source": "X22n0407_003:0297c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初爾時王舍太子阿闍世者當佛在王舍城時未生怨者未生之日相師占之此兒生已定當害父。",
        "translation": "[Commentary] First, at the time when the Buddha was in Rājagṛha, the prince Ajātaśatru hadn't yet born a grudge; on the day he wasn't born, the Xiangxian master divined that after he was born, this son would surely harm his father.",
        "source": "X22n0407_003:0297c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】經云爾時即當佛在城不遠耆闍山時也前譯阿闍世為未生冤今方釋義處胎之日有冤害相占者預記因以為名。",
        "translation": "[Commentary] The sūtra says that at that time, when the Buddha was in the city not far from Gṛdhrakūṭa, the previous translation of Ajātaśatru was \"unborn enemy.\" Now, this explains the meaning in terms of the day he was born in the womb, there was an enemy, and the fortune teller predicted the cause and named it as such.",
        "source": "X22n0407_003:0297c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二隨順下明順友造逆五初釋惡友名族。",
        "translation": "○Two, \"Conformity\" is the next step in understanding the five heinous friends and the five heinous friends who commit crimes.",
        "source": "X22n0407_003:0297c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】隨順調達惡友教者調達此云天熱亦云天授是斛飯王子是佛堂弟阿難親兄阿難此翻歡喜亦云無染或云欣樂調達有三十相出家誦六萬法聚滿十二韋陀。",
        "translation": "This is called the \"Shunyata Adjustment of Bad Friends,\" which is a teaching that accords with the heavenly fever and the heavenly mandate of Prince Branham who is the Buddha's younger brother, Ānanda, and his older brother, Ānanda, which is translated as \"joyful,\" \"untainted,\" or \"delightful,\" and which has 30 characteristics, leaving home, reciting 60,000 dharmas, and filling 12 Vedas.",
        "source": "X22n0407_003:0297c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二為利下釋惡友謀術二初從人學術。",
        "translation": "[Commentary] Second, he explained the conspiracy of evil friends under \"For the Benefit of Others.\" First, he studied with someone.",
        "source": "X22n0407_003:0297c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】為利養故往詣佛所求學神通佛不為說令觀無常自可得道復至舍利弗目連乃至五百弟子所皆不為說取通之法阿難親弟未得他心授與通法調達入山學得五通。",
        "translation": "[Commentary] Because of the benefits, he went to the Buddha to train in the supernormal powers. The Buddha didn't explain it to him so that he could observe impermanence and attain the path on his own.",
        "source": "X22n0407_003:0297c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】阿難親弟知取通法自未得通不知其心故授與之。",
        "translation": "[Commentary] Ānanda's close disciple knew that he hadn't yet attained the supernormal power and didn't know his own mind, so he granted it to him.",
        "source": "X22n0407_003:0297c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二心念下誘人同謀。",
        "translation": "○Two kinds of mindfulness of mind down there entices others to conspire with them.",
        "source": "X22n0407_003:0297c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】心念誰作檀越闍世太子有大王相或自變身作象馬寶於王子前抱持歍嗽復至天上取天華天食。",
        "translation": "[Commentary] He thinks to himself, \"Who would become a prince of the Jātaka Heaven who has the characteristics of a great king or who would transform himself into an elephant, a horse, or a jewel, embrace and carry the cushion in front of a prince, and then go up to heaven to obtain flowers and food from the gods?",
        "source": "X22n0407_003:0297c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】作象馬寶以輪王事誑惑闍世作抱持等欲其生愛也。",
        "translation": "[Commentary] Making an elephant and horse treasure can deceive a prince by deceiving him with the affairs of a wheel-turning king, such as embracing and so forth, in order to make him desirable.",
        "source": "X22n0407_003:0298a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三語王下明惡友言教。",
        "translation": "○Tridharmaka spoke to the king, explaining the words and teachings of his evil friend.",
        "source": "X22n0407_003:0298a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】語王子言我作新佛汝作新王豈不快耶。",
        "translation": "[Commentary] He said to the prince, \"Wouldn't it be nice if I became the new Buddha and you became the new king?",
        "source": "X22n0407_003:0298a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】正教造逆我殺牟尼以作新佛汝殺頻婆以作新王新王新佛共化世間不亦快哉。",
        "translation": "[Commentary] Wouldn't it be pleasant for me to kill Muni to make you the new Buddha, and for you to kill Bimbisāra to make you the new king, and for the new king and new Buddha to work together to transform the world?",
        "source": "X22n0407_003:0298a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四隨順下明太子造逆。",
        "translation": "○4. Following suit, the next step was to explain the prince's rebellion.",
        "source": "X22n0407_003:0298a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】隨順惡友收執父王。",
        "translation": "[Commentary] He followed his bad friend's acceptance of his father's rebellion.",
        "source": "X22n0407_003:0298a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】闍世受教乃行殺逆。",
        "translation": "[Commentary] The Ajātaśatru was instructed to commit the heinous act.",
        "source": "X22n0407_003:0298a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○五調達下明惡友造逆。",
        "translation": "○5. Under Adjustment, he explained that his bad friend had committed a heinous act.",
        "source": "X22n0407_003:0298a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】調達破僧舍利目連教化還合推山厭佛密迹金剛以杵擬之碎石迸來傷佛足指華色比丘尼呵之拳打眼出作三逆罪生入地獄。",
        "translation": "[Commentary] Tathāgata broke Saṃsāṃghika, Mūlasarvâstivāda, taught and trained him to return to the mountain, disliking the Buddha's hidden traces and vajra, and using a pounder to compare it to a broken stone that burst forth and injured the Buddha's feet and fingers, the flower-colored bhikṣuṇīs, blamed him, punched him in the eye, and committed the three heinous crimes of being born into hell.",
        "source": "X22n0407_003:0298a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】調達自造三逆成就復教闍世殺父成就害母加行自行教他五逆罪故生陷泥黎。",
        "translation": "[Commentary] Tathāgata himself accomplished the three heinous crimes, then taught the Ajātaśatru to kill his father and harm his mother, and then taught himself and others the five heinous crimes, so he was born into hell.",
        "source": "X22n0407_003:0298a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二頻婆下父子前因。",
        "translation": "○II. Bimba then went down to the causes of father and son's past.",
        "source": "X22n0407_003:0298a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】頻婆往日毗富羅山遊行獵鹿空無所獲遇值一仙正坐使人驅逐令去遂勅殺之臨終惡念願我來生還如今日心口害汝。",
        "translation": "[Commentary] One day, Bimba marched up Mount Vipula hunting for deer in the sky with nothing to gain, and then he met an immortal sitting in front of him, had him chased away and told to leave, so he ordered him to be killed.",
        "source": "X22n0407_003:0298a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】被殺仙人生惡念故即來為子胎中已有害父之怨。",
        "translation": "[Commentary] The slain sage was born with bad thoughts, which is why he came to be his son in the womb and harmed his father's grudge.",
        "source": "X22n0407_003:0298a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二如此下總結權化。",
        "translation": "○Two, this is the next step in summarizing the provisional transformation.",
        "source": "X22n0407_003:0298a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如此等事皆是大士善權現化行於非道通達佛道眾生根性不同入道有異一逆一順弘道益物示行無間而無惱恚闍王現逆為息惡人令不起逆。",
        "translation": "[Commentary] Such things are the skillful authoritative manifestation of a great person who practices what's not the path and fully comprehends the Buddha path. Sentient beings have different natures and enter the path differently, one is contrary and the other is compliant, which enhances the path and benefits things and shows that practice is uninterrupted and free from anger.",
        "source": "X22n0407_003:0298a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】調達闍世頻婆韋提皆是大權現逆現順利益眾生。",
        "translation": "[Commentary] Taming the Ajātaśatru and Bhivarāvatī are both great powers that present adversity and present compliance to benefit sentient beings.",
        "source": "X22n0407_003:0298a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二夫人奉食。",
        "translation": "○Two wives serve food.",
        "source": "X22n0407_003:0298b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二明夫人奉食。",
        "translation": "[Commentary] Second, the wife serves food.",
        "source": "X22n0407_003:0298b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "國太夫人名韋提希恭敬大王澡浴清淨以酥蜜和麨用塗其身諸瓔珞中盛蒲蔔漿密以上王爾時大王食麨飲漿求水漱口。",
        "translation": "The king's dowager wife, Vaidehī, paid respect to the great king by bathing him in clean water, rubbing his body with ghee and honey, blending it with rice and coating it with puṣpa syrup, and then he ate the rice and drank the syrup, seeking water to rinse his mouth.",
        "source": "X22n0407_003:0298b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】王食麨飲漿求水漱口合掌遙禮請受八戒澡浴清淨。",
        "translation": "[Commentary] The king ate the bread and drank the juice, seeking water to rinse his mouth. He put his palms together and saluted the king, asking him to accept the eight precepts and to bathe and purify his body.",
        "source": "X22n0407_003:0298b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三二聖為說法。",
        "translation": "The three or two sages then delivered the Dharma discourse for him.",
        "source": "X22n0407_003:0298b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漱口畢已合掌恭敬向耆闍崛山遙禮世尊而作是言大目犍連是吾親友願興慈悲授我八戒時目犍連如鷹隼飛疾至王所日日如是授王八戒世尊亦遣尊者富樓那為王說法。",
        "translation": "When he had finished rinsing his mouth, he joined his palms in respect and paid a distant homage to the Bhagavān on Mount Gṛdhrakūṭa and said, \"Mahāmaudgalyāyana is my friend and relative. May you have compassion and grant me the eight precepts!",
        "source": "X22n0407_003:0298b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三聖為說法二初釋目連授戒二初釋疾至。",
        "translation": "[Commentary] The three sages taught the Dharma for the king, first explaining the granting of the precepts by Maudgalyāyana, and second explaining the speedy arrival.",
        "source": "X22n0407_003:0298b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】目連是佛右面弟子昔為辟支佛剃頭作袈裟願得神通。",
        "translation": "[Commentary] Maudgalyāyana was a disciple to the right of the Buddha who used to shave his head and make robes for Pṛthivī and vowed to attain supernormal powers.",
        "source": "X22n0407_003:0298b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】以其宿世事辟支佛今得神通疾至王所。",
        "translation": "[Commentary] Because of his deeds in prior lives, Pārśva attained supernormal powers and arrived at the king's residence quickly.",
        "source": "X22n0407_003:0298b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二授八下釋戒相。",
        "translation": "○Second, under conferring the eight precepts, he explained the characteristics of the precepts.",
        "source": "X22n0407_003:0298b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】授八戒者不殺不盜不婬不妄語不飲酒不著華香不觀聽伎樂不上高牀此八是戒不過中食是齋毗曇不著香衣不上高牀同是莊嚴處合為一也。",
        "translation": "[Commentary] The eight precepts are not to kill, not to steal, not to commit sexual misconduct, not to speak falsehoods, not to drink alcohol, not to wear flowers and incense, not to listen to music, and not to go up on a high bed.",
        "source": "X22n0407_003:0298b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】初開香衣及上高牀以為八戒齋在八外次合香衣高牀為七不過中食為第八則齋在八內法無增減數有開合皆名為八戒齋也。",
        "translation": "First, he opens the incense robe and goes up on the high bed because the eight precepts are observed outside the eight, and then he closes the incense robe and high bed, which are seven, but the midday meal is the eighth.",
        "source": "X22n0407_003:0298b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二富樓下釋樓那說法。",
        "translation": "○Two, Pūrṇa explains the preaching of the Dharma by Luna.",
        "source": "X22n0407_003:0298b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】富樓那此云滿願子亦滿慈子從父母得名說法第一巧開人心故偏遣之。",
        "translation": "[Commentary] This is called the son of Pūrṇa who fulfills his vows and the son of Pūrṇa who gets his name from his parents and expounds the Dharma first and skillfully opens people's minds so he partially excludes it.",
        "source": "X22n0407_003:0298c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是時間經三七日王食麨蜜得聞法故顏色和悅。",
        "translation": "It took the king thirty-five days of eating coal and honey to hear the teaching, so his countenance was pleasant.",
        "source": "X22n0407_003:0298c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】四頻婆下法食延壽。",
        "translation": "[Commentary] The four Bimbis then ate the Dharma to prolong their lives.",
        "source": "X22n0407_003:0298c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】四頻婆因食聞法遂得多日不死也。",
        "translation": "[Commentary] The four Bimbis then became immortal for many days because they ate and heard the Dharma.",
        "source": "X22n0407_003:0298c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二次害下明欲害母二初分科。",
        "translation": "[Commentary] The second harm is explained below as a desire to harm one's mother in the first of two ways.",
        "source": "X22n0407_003:0298c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次害母中為四一為子幽閉二因禁請佛三佛與弟子因請往赴四見佛傷歎請法初中又三一欲害母二二臣諫不聽害三勅內官幽閉。",
        "translation": "Second, there were four ways to harm his mother: first, by secluding his son; second, by inviting the Buddha because of the ban; third, by going to the Buddha with his disciples because of the invitation; and fourth, by seeing the Buddha and praising him for invoking the Dharma.",
        "source": "X22n0407_003:0298c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二初闍下隨釋四初為子幽閉三初欲害母三初王問在不。",
        "translation": "First, the king asked whether the son was in seclusion.",
        "source": "X22n0407_003:0298c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初闍世問守門者王今在不。",
        "translation": "[Commentary] First, the Ajātaśatru asked the gatekeeper if the king was present.",
        "source": "X22n0407_003:0298c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿闍世問守門者父王今者猶存在耶。",
        "translation": "The Ajātaśatru then asked the gatekeeper if his father, the king, was still there today.",
        "source": "X22n0407_003:0298c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二守門下以事實答。",
        "translation": "[Commentary] Second, the gatekeeper answered with a factual answer.",
        "source": "X22n0407_003:0298c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二守門者以事實答。",
        "translation": "[Commentary] The second gatekeeper answered with a factual answer.",
        "source": "X22n0407_003:0298c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時守門人白言大王國太夫人身塗麨蜜瓔珞盛漿持用上王沙門目連及富樓那從空而來為王說法不可禁制。",
        "translation": "The gatekeeper then said, \"The king's wife, the king's country, spread her body with honey and sandalwood, filled it with juice, and used it to carry the king's ascetics, Mucilin and Pūrṇa, who came from the sky to explain the Dharma to the king, which cannot be restrained.",
        "source": "X22n0407_003:0298c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三王聞瞋怒。",
        "translation": "[Commentary] The three kings were furious when they heard that.",
        "source": "X22n0407_003:0298c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時阿闍世聞此語已怒其母曰我母是賊與賊為伴沙門惡人幻惑呪術令此惡王多日不死即執利劒欲害其母。",
        "translation": "After hearing this, the Ajātaśatru became angry with his mother and said, \"My mother is a thief, and she's accompanied by a thief. That evil ascetic conjured up a spell that kept this evil king from dying for many days.",
        "source": "X22n0407_003:0298c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三王聞瞋怒二初消經文。",
        "translation": "[Commentary] Three times the king heard about the anger and rage, and two times he eliminated the sutra's text.",
        "source": "X22n0407_003:0298c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】名父為賊母為賊伴即執利劍欲害其母。",
        "translation": "[Commentary] He named his father as the thief and his mother as the thief's companion, and then he grabbed a sharp sword and wanted to harm his mother.",
        "source": "X22n0407_003:0298c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二應殺下釋妨難。",
        "translation": "[Commentary] Second, he explained the obstruction under Should Kill.",
        "source": "X22n0407_003:0299a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】應殺守門人而欲害母者守門有辭王先有勅制諸羣臣不言婦女沙門從空飛入非我能禁王雖貪國殺父猶不違法。",
        "translation": "[Commentary] Should I kill the gatekeeper who wants to harm my mother? The gatekeeper has resisted. The king had previously issued a command to the ministers not to say that women and women like the ascetics fly into the sky and can't be restrained by me.",
        "source": "X22n0407_003:0299a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有一臣名曰月光聰明多智及與耆婆為王作禮白言大王臣聞毗陀論經說劫初已來有諸惡王貪國位故殺害其父一萬八千未曾聞有無道害母王今為此殺逆之事汙剎利種臣不忍聞是旃陀羅我等不宜復住於此時二大臣說此語竟以手按劒却行而退時阿闍世驚怖惶懼告耆婆言汝不為我耶耆婆白言大王慎莫害母王聞此語懺悔求救即便捨劒止不害母。",
        "translation": "It was then that a minister named Mochizo, Jñānagupta, Wisdom, and Jīvaka paid homage to the king and said, \"Great king, I've heard the Vedas say that since the beginning of the eon there have been bad kings who have killed their fathers because they were greedy for the state's position. 18,000 times have never been heard of a king who has done harm to his mother because of immorality.",
        "source": "X22n0407_003:0299a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二劫初下二臣諫三初釋勸辭。",
        "translation": "[Commentary] At the beginning of the second eon, the two ministers remonstrated with the three ministers, first explaining their advice.",
        "source": "X22n0407_003:0299a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】劫初已來一萬八千未聞無道害母害母眼見何得言聞謂不忍聞世人傳說不宜住此欲奔他國故云不住有國已來雖有刑罪不加女人況所生母故不住也。",
        "translation": "[Commentary] Since the beginning of the eon, 18,000 people haven't heard of the waywardness that harms mothers and how can they say they've heard it because they can't bear to hear that people say it's not advisable to stay here or run away to another country.",
        "source": "X22n0407_003:0299a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二以手下釋勸相。",
        "translation": "[Commentary] Second, he explained the exhortation aspect with his men.",
        "source": "X22n0407_003:0299a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】以手按劒却行而退者按劒現威以息王忿也。",
        "translation": "[Commentary] This person who presses his hand and retreats with a warning shows his authority to calm the king's anger.",
        "source": "X22n0407_003:0299a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三驚怖下明從勸。",
        "translation": "[Commentary] Third, he was frightened and then explained the importance of following the exhortation.",
        "source": "X22n0407_003:0299a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】驚怖惶懼者畏懼也耆婆此云固活生時一手把藥囊一手把針筒昔誓為醫能治他病從德立號菴羅女子也是國賢臣賢臣去必國亡也汝不為我者耆婆重諫慎莫害母懺悔求救前&#;也即便捨劒止不害母。",
        "translation": "When he was alive, he held a medicine bag in one hand and a syringe in the other, and vowed to be a doctor who could treat other diseases.",
        "source": "X22n0407_003:0299a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勅語內官閉置深宮不令復出。",
        "translation": "Imazammed the inner sanction to close the palace and not allow him to leave again.",
        "source": "X22n0407_003:0299b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三勅語下勅幽閉。",
        "translation": "[Commentary] Three times Ima-mai was told to close the palace.",
        "source": "X22n0407_003:0299b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】勅語內官幽閉深宮。",
        "translation": "Imaḥ said to the inner sanctum to close the deep palace.",
        "source": "X22n0407_003:0299b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二韋提下因禁請佛二初分科。",
        "translation": "[Commentary] 2. Vaidehī was prohibited from inviting the Buddha to the first of two divisions.",
        "source": "X22n0407_003:0299b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】韋提希被幽閉下第二請佛謂請如來令遣弟子與己相見文為二初明請人次明請法。",
        "translation": "The second invitation to the Buddha came after Vaidehī was shut up, which was to ask the Tathāgata to send a disciple to meet with him.",
        "source": "X22n0407_003:0299b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時韋提希被幽閉已愁憂憔悴遙向耆闍崛山為佛作禮而作是言如來世尊在昔之時恒遣阿難來慰問我我今愁憂世尊威重無由得見願遣目連尊者阿難與我相見。",
        "translation": "After Vaidehī was shut up, he became sad and exhausted, went far away to Gṛdhrakūṭa, paid homage to the Buddha, and said, \"The Bhagavān used to send Ānanda to console me. I'm now sad and troubled about the Bhagavān's authority, and there's no way I can see him.",
        "source": "X22n0407_003:0299b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二韋提下隨釋二初請人。",
        "translation": "[Commentary] Second, Vaidehī followed by the explanation of the two first invitations to the person.",
        "source": "X22n0407_003:0299b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】韋提何故請見目連及以阿難目連是門師阿難佛侍者先恒教誡故偏求見居在深宮不敢偏求內厭惡界願生淨土欲令二人傳意請佛。",
        "translation": "[Commentary] Why did Vaideh ask to see Maudgalyāyana and Ānanda? Maudgalyāyana is the gate master, Ānanda is the Buddha's attendant, and so he's always instructed to seek partial views, living in a deep palace, not daring to seek partial views, becoming disillusioned with the bad world, and wishing to be born in the Pure Land.",
        "source": "X22n0407_003:0299b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】一是門師一是佛侍先常教誡故偏請二人既在深宮故請二人不敢偏一欲傳我意請佛宣說生淨土因請人之意也。",
        "translation": "[Commentary] One is a gate master, and the other is a servant of the Buddha. Since they're in a deep palace, they dare not ask for one or the other, wanting to convey my intention to ask the Buddha to preach birth in the Pure Land.",
        "source": "X22n0407_003:0299b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是語已悲泣雨淚遙向佛禮。",
        "translation": "After he said this, he sorrowfully wept and rained tears as he paid homage to the Buddha.",
        "source": "X22n0407_003:0299b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二悲泣下請式科云請法即法式也。",
        "translation": "[Commentary] Second, he wept bitterly and went down to the invitation section, saying that he was inviting the Dharma, which is the Dharma ceremony.",
        "source": "X22n0407_003:0299b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】悲泣雨淚望佛哀憐遙向佛禮前已禮竟今復重禮表已殷勤。",
        "translation": "[Commentary] Weeping with sympathy, raining tears, hoping for the Buddha's compassion, and distantly saluting him after having done so before, he now pays renewed homage to show his earnestness.",
        "source": "X22n0407_003:0299b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三世尊下因請往赴二初分科。",
        "translation": "[Commentary] The third Bhagavān was invited to go to the first of two divisions of the section.",
        "source": "X22n0407_003:0299b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】世尊在耆闍下如來現宮不異勝鬘即生此念時佛於空中現也文為五一神通二色身三坐座四眷屬五雨華。",
        "translation": "[Commentary] The Bhagavān was in Gṛdhrakūṭa, and the Tathāgata's palace was not different from Śrīmālā's when he gave rise to this thought. The text is composed of five parts: one superknowledge, two form bodies, three seats, four retinues, and five rain flowers.",
        "source": "X22n0407_003:0299b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】勝鬘等者勝鬘夫人也即舍衛國波斯匿王女末利夫人所生為踰闍國妃其後父母遣書云佛出我國神通自在普益眾生勝鬘執書對使說偈云仰惟佛世尊普為世間出亦應愍我等速來至此處即說此偈時佛於空中現復說偈讚云如來玅色身世間無與等等今韋提哀請佛即降赴其事相類故云不異。",
        "translation": "When he spoke this verse, the Buddha appeared in the sky and spoke another verse praising the Tathāgata's fine form body as being unequalled in the world and so forth.",
        "source": "X22n0407_003:0299c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未舉頭頃爾時世尊在耆闍崛山知韋提希心之所念即勅大目犍連及以阿難從空而來佛從耆闍崛山沒於王宮出。",
        "translation": "Before he raised his head, the Bhagavān was on Mount Gṛdhrakūṭa and knew what Vaidehī was thinking, so he commanded Mahāmaudgalyāyana and Ānanda to come up from the sky.",
        "source": "X22n0407_003:0299c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二知韋下隨釋五初神通二初消文。",
        "translation": "[Commentary] Second, he knew what Vaidehī was thinking, then he explained the five first powers, and the two first elimination texts.",
        "source": "X22n0407_003:0299c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】知韋提希心念者是知他心從崛山沒王宮出顯神通也。",
        "translation": "[Commentary] Knowing Vaidehī's mindfulness is to know that another's mind emerged from Mount Hori without the king's palace to reveal his supernormal powers.",
        "source": "X22n0407_003:0299c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】如來之心寂而常照無數河沙世界眾生若干種心悉知悉見非同小聖作意方知他心及以身如意通皆無記通也。",
        "translation": "[Commentary] The Tathāgata's mind is still and always illuminating, and there are many kinds of minds of sentient beings in the world that are not shared with lesser sages who contemplate knowing the minds of others and the power of mindfulness of body as mind, which are all indeterminate powers.",
        "source": "X22n0407_003:0299c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二問前下釋妨二初出妨。",
        "translation": "○Two questions preceded by an explanation of the hindrances, and the first was to explain the hindrances.",
        "source": "X22n0407_003:0299c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】問前頻婆請弟子意在如來今夫人亦請弟子意在佛何故前請遣弟子今請自往耶。",
        "translation": "[Commentary] The question was, \"Why did Bimbis invite the disciple with the intention of the Tathāgata and now madams invite the disciple with the intention of the Buddha?",
        "source": "X22n0407_003:0299c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】此難重出問不異前答不同彼。",
        "translation": "[Commentary] This difficulty again arises when the question is not different from the previous one and the answer is different from that one.",
        "source": "X22n0407_003:0299c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】解有二義一闍王與調達殺父如來若躬赴恐世王起怨嫌心為護彼故不得自往二者佛法寄在國王頻婆定死闍世當為國主如來若往者王得國主佛法不行故不得往夫人無此諸事如來自往。",
        "translation": "[Commentary] There are two explanations. One, the king and the tathāgata killed their father. If the tathāgata goes personally, he's afraid the king might become hostile and protect him, so he can't go himself. Two, the Buddha's teaching is entrusted to the king, and the king is determined to die.",
        "source": "X22n0407_003:0299c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】言二解者一滅即今嫌佛之惡二生以後行法之善何以故若佛入彼頻婆之室即令世王謂佛朋父還謀國政怨嫌既重後不行法故不躬往母無斯事故佛親赴。",
        "translation": "[Commentary] When it comes to the two understandings, one is to cease the evil that's now suspected of being the Buddha, and the other is to give rise to the goodness of practicing the Dharma in the future.",
        "source": "X22n0407_003:0300a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二時韋下色身。",
        "translation": "○Two times Vaidehī descended from his physical body.",
        "source": "X22n0407_003:0300a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時韋提希禮已舉頭見世尊釋迦牟尼佛身紫金色。",
        "translation": "Vaidehī then raised his head after paying homage and saw the Bhagavān Śakyamuni Buddha in a purple-gold body.",
        "source": "X22n0407_003:0300a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三坐百下坐座。",
        "translation": "[Commentary] He sat on three seats, one of the hundred lower seats, and then he sat on a lotus.",
        "source": "X22n0407_003:0300a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "坐百寶蓮華。",
        "translation": "He was sitting on a lotus with a hundred jewels.",
        "source": "X22n0407_003:0300a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】四目連下眷屬。",
        "translation": "[Commentary] Four Mucilinda retinues were present.",
        "source": "X22n0407_003:0300a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "目連侍左阿難侍右釋梵護世諸天在虗空中。",
        "translation": "Mucilin was attended by Ānanda on the left, and Śākyamuni was attended by Brahmā on the right, while the gods protecting the world were in the sky.",
        "source": "X22n0407_003:0300a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】五普雨下雨華。",
        "translation": "[Commentary] Five rain down flowers everywhere.",
        "source": "X22n0407_003:0300a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "普雨天華持用供養。",
        "translation": "It's raining flowers from all over the heavens, and they're being held and offered as an offering.",
        "source": "X22n0407_003:0300a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】四傷歎請法二初分科。",
        "translation": "[Commentary] The first of the four categories of praise and invitation to the Dharma is divided into sections.",
        "source": "X22n0407_003:0300a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】傷歎請法中有二意韋提見佛下正明請其生處今向世尊下明請往生之因初明供養問往生因次問生處也。",
        "translation": "[Commentary] There are two meanings in praising the invitation to the Dharma: Weidi sees the Buddha and then correctly explains the invitation to the place of birth, and now he's presenting to the Bhagavān and explaining the cause of the invitation to rebirth, first by making offerings and asking about the cause of rebirth, and then by asking about the place of birth.",
        "source": "X22n0407_003:0300a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】今向世尊下明請往生之因者即二意中第二請示往生淨土之因經云唯願佛日教我觀於清淨處文也初明供養問往生因者即第一意問往昔生中何罪為因生此闍世惡逆之子應知此二語同意別。",
        "translation": "[Commentary] Now, we'll explain the reason for inviting rebirth under the Bhagavān, which is the second of the two meanings of inviting the second cause of rebirth in the Pure Land. The sūtra says, \"May I only hope that the Buddha teaches me to observe the pure place on the day of my birth.\" First, we'll explain the reason for making offerings and asking about rebirth, which is the first meaning of asking what sins in past lives caused the birth of this irresponsible son of the Ajātaśatru, and you should know that these two statements agree on a distinction.",
        "source": "X22n0407_003:0300a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時韋提希見佛世尊自絕瓔珞舉身投地號泣向佛白言世尊我宿何罪生此惡子世尊復有何等因緣與提婆達多共為眷屬。",
        "translation": "Vaidehī then saw the Bhagavān cutting off his own necklace, throwing himself to the ground, weeping, and saying to the Buddha, \"Bhagavān, what sins did I commit in the past that gave rise to this wicked son?\" What further causes and conditions did the Bhagavān have in common with Devadatta as his sibling?",
        "source": "X22n0407_003:0300a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】分二初我有下供養問往生因。",
        "translation": "[Commentary] There are two parts. First, I made offerings to the next person and asked about the causes of his rebirth.",
        "source": "X22n0407_003:0300b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】我有何罪生此惡子世尊復有何等因緣與提婆達多而為眷屬此經不答餘經說之昔於錠光佛時釋迦為摩納就珍寶仙人學學習既成念欲報恩自惟貧乏于時耶若達欲嫁女時有須摩提求為女壻聰明有智而形貌醜摩納遇見論義須摩提屈在言下耶若達歡喜大賜珍寶以女妻之摩提生忿發誓未來世世常惱為此因緣常觸惱也。",
        "translation": "What sins have I committed in the past that gave rise to this bad son, Bhagavān? What other causes and conditions did he have in common with Devadatta as his sibling? This sūtra doesn't answer that; the others say that in the past, when Dīpaṃkara Buddha was born, Śākyamuni gave Manas treasures to sages, and after completing his training, he was mindful of wanting to repay kindness to himself for his poverty.",
        "source": "X22n0407_003:0300b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】經自絕瓔珞舉身投地號泣向佛即三業供養絕瓔投地是身號泣是口以二顯意闍世之因已略如前疏今但出調達之緣。",
        "translation": "[Commentary] The sūtras cut off their own jewelry, threw their bodies to the ground, and called out to the Buddha, which is an offering to the three activities. Cutting off their jewelry and throwing it to the ground is the body, and calling out to the Buddha is the mouth.",
        "source": "X22n0407_003:0300b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯願世尊為我廣說無憂惱處我當往生不樂閻浮提濁惡世也此濁惡處地獄餓鬼畜生盈滿多不善聚願我未來不聞惡聲不見惡人。",
        "translation": "Please let the Bhagavān explain in detail for me the state of no distress. I'll be reborn in the turbid and evil world of Jambudvīpa. This turbid and evil state is hell, hungry ghosts, animals, and humans full of unwholesome beings. May I not hear bad sounds or see bad people in the future.",
        "source": "X22n0407_003:0300b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二濁惡下正問生處。",
        "translation": "[Commentary] Second, under \"turbid and evil,\" he correctly asks about the place of birth.",
        "source": "X22n0407_003:0300b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】濁惡者濁五濁也一見二煩惱三眾生四命五劫惡者十惡也殺盜婬妄語惡口兩舌綺語貪瞋邪見也三途地獄名泥犂譯云不可樂畜生云旁行從主畜養為人驅使食噉餓鬼飢虗怯畏三千剎土同有此惡故曰盈滿多不善聚惡道因也無人不起故名曰多人常現行殺盜婬等違理枉物為不善積集稱聚也願我未來不聞惡聲不見惡人。",
        "translation": "[Commentary] \"Turbid evil\" refers to the five turbidities, which are one view, two afflictions, three sentient beings, four lives, and five eons. The ten evils are killing, stealing, sexual misconduct, false speech, bad speech, duplicity, fancy speech, greed, anger, and wrong views.",
        "source": "X22n0407_003:0300b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今向世尊五體投地求哀懺悔唯願佛日教我觀於清淨業處。",
        "translation": "I now throw myself to the ground with five parts of my body and beg for pity and repentance, hoping that the Buddha will teach me to look at the pure abodes of activity one day.",
        "source": "X22n0407_003:0300c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二今向下請往生因。",
        "translation": "[Commentary] Second, I now turn downward to ask for the cause of rebirth in the Pure Land.",
        "source": "X22n0407_003:0300c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今向世尊五體投地兩肘兩膝頭頂是為五體也懺摩梵言悔過漢語彼此並舉故云懺悔將果驗因知過去有罪恐償未盡當來更受故須懺悔唯願佛日啟告所求佛能破壞眾生癡闇如日除昏故言佛日教我觀於清淨業處序文竟。",
        "translation": "[Commentary] Now, I present five bodies to the Bhagavān, throwing them to the ground with two elbows and two knees at the top of my head, which are the five bodies.",
        "source": "X22n0407_003:0300c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】第二正說分二初泛科懸解二初科三段。",
        "translation": "[Commentary] The second correct explanation is divided into two sections, the first a pan section and the second a section of three paragraphs.",
        "source": "X22n0407_003:0300c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】爾時世尊放眉間光下第二正說文為三初明淨業次辯玅觀三利益。",
        "translation": "At the time, the Bhagavān radiated the light between his eyebrows, and the second correct explanation of the text consisted of three parts: first, he explained pure activities, then he defended the three benefits of meditative observation.",
        "source": "X22n0407_003:0300c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二如來下解初文。",
        "translation": "[Commentary] Second, the Tathāgata explained the initial text below.",
        "source": "X22n0407_003:0300c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如來眉間有白毫相猶如珂雪長一丈五尺毫有八楞周圍五寸其毫中空右旋宛轉如琉璃筒從此發光照無量國還住佛頂變為金臺廣現諸國令韋提希樂生安養。",
        "translation": "[Commentary] Between the Tathāgata's eyebrows there's a white tuft of hair that looks like a snowflake one foot five feet long with a tuft of hair that's eight flutes and five inches around it, and the tuft of hair is hollow and rotates right like a lapis lazuli cylinder.",
        "source": "X22n0407_003:0300c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二初放下重科廣釋二初總別分科。",
        "translation": "[Commentary] First, he lays down the extensive explanation of the two first general and separate sections.",
        "source": "X22n0407_003:0300c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初放光酬前請於生處次世尊微笑下酬前淨業近答思惟正受三種淨業散心思量名曰思惟十六正觀說名正受就初有二第一答其生處唯願下明見淨土更請淨國之因初放光普示諸土次或有下示土差別韋提下示生處。",
        "translation": "First, he radiates his light to reward the previous invitation to the place of birth. Second, the Bhagavān smiles and then rewards the previous pure activities by smiling down and answering the question, \"Are there three kinds of pure activities that are considered, scattered, contemplated, and called contemplated?\" Sixteen correct contemplations are explained and called correct acceptances.",
        "source": "X22n0407_003:0300c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】酬前生處者前韋提請云唯願為我廣說無憂惱處佛今放光照其淨土令彼見之以酬前請酬前淨業者前請云唯願教我觀於清淨業處今示三種淨業十六玅觀即教彼觀淨業處也近答等者以韋提希於酬生處中因光見土乃再請云教我思惟教我正受此在正宗故云近答若酬序中所請即是遠答。",
        "translation": "The previous invitation from Vaidehī said that he only wishes to explain in detail for me the place of no sorrow and distress, and now he radiates his light to illuminate his pure land so that he can see it in order to repay the previous invitation.",
        "source": "X22n0407_003:0301a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二隨科解釋二初酬二問二初酬前生處二初答其生處三初爾時下放光普示。",
        "translation": "○Two explanations follow the text. First, he paid two questions. First, he paid the previous birthplace. Second, he answered the birthplace. Third, at the time, the devolution of light was universally shown.",
        "source": "X22n0407_003:0301a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊放眉間光其光金色徧照十方無量世界還住佛頂化為金臺如須彌山十方諸佛淨玅國土皆於中現。",
        "translation": "At that point, the Bhagavān radiated a radiance between his eyebrows that was golden and shone everywhere in the measureless worlds of the ten directions, and then he stayed at the Buddha's peak and transformed it into a golden platform like Mount Sumeru, in which the pure and precious lands of the buddhas in the ten directions were all manifested.",
        "source": "X22n0407_003:0301a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二或有下示土差別。",
        "translation": "[Commentary] Second, there may be differences in the lands shown below.",
        "source": "X22n0407_003:0301a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有國土七寶合成復有國土純是蓮華復有國土如自在天宮復有國土如玻[王*梨]鏡十方國土皆於中現有如是等無量諸佛國土嚴顯可觀令韋提希見。",
        "translation": "There may be a land where seven treasures are combined, another land that's purely lotus, another land that's like the palace of the Śivaites, another land that's like the [royal*li] mirror, and ten lands in ten directions, all of which are manifested within it.",
        "source": "X22n0407_003:0301a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三時韋下的示生處。",
        "translation": "[Commentary] Three times, Vaidehī showed him the place of birth.",
        "source": "X22n0407_003:0301a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時韋提希白佛言世尊是諸佛土雖復清淨皆有光明我今樂生極樂世界阿彌陀佛所唯願世尊教我思惟教我正受。",
        "translation": "Vaidehī then said to the Buddha, \"Bhagavān, although these buddha-lands are all pure and have light, I'm now delighted to be born in the paradise world under Amitâbha Buddha. May the Bhagavān teach me to contemplate and teach me to correctly accept them.",
        "source": "X22n0407_003:0301a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二思惟下見土更請因。",
        "translation": "[Commentary] Second, contemplate the reason for seeing the land below and further requesting it.",
        "source": "X22n0407_003:0301a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】思惟是願願思是業正問其因正受者非邪曰正領納名受即第二問觀行。",
        "translation": "[Commentary] Contemplation is vow, and vowing is action.",
        "source": "X22n0407_003:0301a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】此請淨土正助二因初教我思惟若不思惟不成願樂有願之思乃成業因唯願世尊教我修於淨土願思令成業因此請事善助道之業也次教我正受離邪倒想領納所緣名為正受此請世尊教我修行淨土觀法即正觀也。",
        "translation": "[Commentary] This invitation to the Pure Land correctly assists two causes. First, it teaches me to contemplate; if I don't contemplate, I won't become happy with the vow.",
        "source": "X22n0407_003:0301a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二微笑下酬前淨業二初總別分科。",
        "translation": "○Two smiles downward to reward the previous pure activities, the first general and specific in section.",
        "source": "X22n0407_003:0301b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】微笑中有二初明三種淨業答思惟汝是凡夫下次明十六玅觀答正受初業共凡夫次共二乘後是大乘不共之法初淨業中有三第一明三種淨業告阿難下第二歎其所問玅契佛心從阿難汝當受持下第三略付阿難令持獲利也就初復三初明光照頻婆獲道次世尊告韋提汝今知不下舉果勸修因三欲生彼國者下明往生之因也。",
        "translation": "First, the three kinds of pure activities are explained to Ānanda, second, they're shared with the two vehicles, and then they're the distinctive qualities of the great vehicle.",
        "source": "X22n0407_003:0301b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】初業共凡夫等者今三種福是圓助道與正觀合皆如來行故云三世諸佛淨業正因但以三種有通有局初孝養等通於大小及以博地故云初業共凡夫次歸戒等唯通大小凡夫無分故云次共二乘若菩提心等專在大乘不通凡小故云不共之法。",
        "translation": "[Commentary] The first three kinds of merit are the direct cause of the pure activities of the buddhas in the three worlds because they are the combination of the perfect path, correct contemplation, and the Tathāgata's practice.",
        "source": "X22n0407_003:0301b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊即便微笑有五色光從佛口出一一光照頻婆娑羅王頂爾時大王雖在幽閉心眼無障遙見世尊頭面作禮自然增進成阿那含。",
        "translation": "Even then, the Bhagavān smiled, and there were five colored lights emanating from the Buddha's mouth, each shining brightly on the peak of King Bimbisāra. At that point, although the king was in seclusion, his mind and eyes were unobstructed, and he saw the Bhagavān head and face from a distance, he paid homage and naturally advanced into non-returnerhood.",
        "source": "X22n0407_003:0301b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二何以下隨科解釋二初三種淨業答思惟三初正明淨業三初光照頻婆得道二初釋微笑二初問。",
        "translation": "[Commentary] Second, why is it explained in the following section, first by the three kinds of pure activities and second by the answer to the reflection, and third by the correct explanation of pure activities.",
        "source": "X22n0407_003:0301b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】何以不直答其土因而復放光微笑耶。",
        "translation": "[Commentary] Why didn't they just answer by saying that their land would then again shine and smile?",
        "source": "X22n0407_003:0301b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二答二初解有下答放光。",
        "translation": "[Commentary] Two answers: First, we explain that there's a second answer to the question, \"Emitting light?",
        "source": "X22n0407_003:0301c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】解有二初為欲增道次欲使王與夫人因光相見王既覩光增道知國非實視死如眠夫人見王無憂觀法成果也。",
        "translation": "[Commentary] There are two kinds of explanation. First, it's for the desire to enhance the path, and second, it's to cause the king and his wife to see each other because of the light. The king sees the light, enhances the path, and knows that the country isn't real.",
        "source": "X22n0407_003:0301c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】觀法得果者無生法忍是圓三觀習果故也。",
        "translation": "[Commentary] The fruit of observing principles is the acceptance of the nonarising of principles as the result of the cultivation of the three perfect contemplations.",
        "source": "X22n0407_003:0301c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二微笑下答微笑。",
        "translation": "○Two smiles down, then he answers the question, \"Smile.",
        "source": "X22n0407_003:0301c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】微笑如釋種被誅如來光色益顯正以如來善達因緣業報無差對至叵避王雖應死而獲前跡夫人幽縶即是現淨土之緣有此多緣所以致笑也。",
        "translation": "[Commentary] Smiling like the Śākya lineage being condemned, the Tathāgata's radiant color becomes more pronounced precisely because the Tathāgata well understands causes and conditions, and there's no difference between karmic retribution and the unavoidable, though the king should die and obtain the former traces, the lady's quiet smile is the result of these many conditions in the present Pure Land.",
        "source": "X22n0407_003:0301c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】惡業之報害命縶身而為獲果及淨土緣如來心了善惡因果交互萬差欲表內心是故微笑。",
        "translation": "The Tathāgata's mind understands the reciprocal nature of good and bad causes and effects, and there are myriad differences in their desire to express their inner mind; therefore, they smile.",
        "source": "X22n0407_003:0301c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二阿那下釋阿那含。",
        "translation": "○Two: Anāthapiṇḍika is explained under Anāthapiṇḍika.",
        "source": "X22n0407_003:0301c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】阿那含者第三不還果也。",
        "translation": "[Commentary] Anāgāmin is the third nonreturner.",
        "source": "X22n0407_003:0301c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告韋提希汝今知不阿彌陀佛去此不遠汝常繫念諦觀彼國淨業成者我今為汝廣說眾譬亦令未來世一切凡夫欲修淨業者得生西方極樂國土。",
        "translation": "It was then that the Bhagavān addressed Vaidehī, \"Do you now know that Amitâbha isn't far away from here?\" I'll explain the many parables in detail for you, so that all worldlings who want to cultivate pure activities in the future will be born in the Western Land of Paradise.",
        "source": "X22n0407_003:0301c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二去此下舉果勸修因二初問。",
        "translation": "[Commentary] Second, we'll go here and then cite the result and encourage cultivation of the cause.",
        "source": "X22n0407_003:0301c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】去此不遠者安樂國土去此十萬億佛剎一一剎恒沙世界何言不遠。",
        "translation": "[Commentary] How could it be said that the land of paradise is not far from this one, from which ten thousand million Buddha-temples each contain a world of sands?",
        "source": "X22n0407_003:0301c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】大本小本俱云極樂去此十萬億剎剎即大千故云河沙何言不遠。",
        "translation": "[Commentary] The major and minor texts both say that paradise is ten thousand million buddhas and one hundred thousand equinoxes, which is a great chiliocosm, so it's called a hemisand.",
        "source": "X22n0407_003:0301c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二解云下答有二意。",
        "translation": "○Two explanations led to the following answer, which had two meanings.",
        "source": "X22n0407_003:0301c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】解云以佛力故欲見即見又光中現土顯於佛頂一念能緣言不遠也。",
        "translation": "[Commentary] It's explained that it's because of the power of the Buddha that one wants to see and immediately sees, and that the land that appears in the light is shown at the Buddha's peak with a single thought that can cause it to be said not to be far away.",
        "source": "X22n0407_003:0301c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】初以佛力故令修觀者欲見即見故此文云汝當繫念諦觀彼國故知佛力加欲見者令觀成見後文云一切眾生觀於西方極樂世界以佛力故當得見彼清淨國土故般舟見佛而論三力一佛威力二三昧力三行者本功德力次意即是光中現土即目覩見也其二種見皆由感應雖遠而近然若心性不具塵剎則佛無應現之理生無感見之功故此經談是心是佛觀迷此意則非玅宗。",
        "translation": "[Commentary] First, because of the power of the Buddha, those who cultivate contemplation should want to see and thus see, so this text says, \"You should fix your mind on the truth and contemplate that country, so you know that the power of the Buddha plus those who want to see will cause contemplation to become visible.\" Later, the text says, \"All sentient beings who contemplate the Western paradise will be able to see that pure land because of the power of the Buddha.\" Therefore, when Prajñāpāramitā sees the Buddha, it discusses three powers: the power of the Buddha's authority, the power of samādhi, and the power of the three practices that are based on merit.",
        "source": "X22n0407_003:0302a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲生彼國者當修三福一者孝養父母奉事師長慈心不殺修十善業二者受持三歸具足眾戒不犯威儀三者發菩提心深信因果讀誦大乘勸進行者如此三事名為淨業佛告韋提希汝今知不此三種業乃是過去未來現在三世諸佛淨業正因。",
        "translation": "Those who want to be born in that country should cultivate three merits: first, filial piety to parents, serving teachers and elders, kindness, not killing, and cultivating ten good actions; second, observing the three refuges, fulfilling all the precepts, and not violating their manners; third, arouse the mind of enlightenment, firmly believing in cause and effect, and reciting the great vehicle to encourage practitioners. These three things are called pure activities, and the Buddha told Vaidehī that you now know whether these three kinds of activities are the proper cause of the pure activities of the buddhas in the past, future, and present.",
        "source": "X22n0407_003:0302a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三第一下正示往生因二初正示三初共凡夫業。",
        "translation": "[Commentary] Three first, the causes of rebirth in the future are directly shown, two first are directly shown, and three first are shared with worldling karma.",
        "source": "X22n0407_003:0302a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第一孝養父母奉事師長敬上接下慈心行也修十善業是其止行身除三邪口離四過意斷三惡也。",
        "translation": "First, he filiates his parents, serves his teachers, respects his superiors, connects with his inferiors, and conducts himself in a compassionate manner. Cultivating the ten good activities is their practice of stopping the three evils in body and ridding himself of the four faults in speech and ending the three evils in thought.",
        "source": "X22n0407_003:0302a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】此經正被頓修之機雖修佛行父母師長豈不孝事輪王十戒豈不止行但能修之心一一稱性何妨所修慈孝之善共於凡夫。",
        "translation": "[Commentary] This sūtra is a tool for sudden cultivation, even though it cultivates the Buddha's practice, how could parents, teachers, and elders not be filial, how could the wheel-turning king's ten precepts not be more than just practices, but how could the mind that cultivates them each claim their nature?",
        "source": "X22n0407_003:0302a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二第二下共二乘業。",
        "translation": "○Two, second, and lower are the karma of the two vehicles together.",
        "source": "X22n0407_003:0302a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第二三歸者佛法僧也在家戒亦即是十戒具足眾戒者道俗備受微細不犯威儀者三千悉皆不缺也。",
        "translation": "The second three refuges are for buddhas, Dharma, and saṃgha, and the householder precepts, which are the ten precepts, are complete, and the moral and secular precepts are fully accepted by those who are subtle and don't violate the three thousand rules of conduct, all of which are not lacking.",
        "source": "X22n0407_003:0302a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】圓頓行者豈違小乘出家之式三歸眾戒威儀等事但受持之心合於一體依於畢竟而所行之法共於二乘。",
        "translation": "[Commentary] Does a practitioner of perfect and sudden practice contradict the lesser vehicle's renunciant style of the three refuges, such as the precepts and regulations, but the mind that receives and upholds them is unified based on their finality, and the principles that are practiced are common to the two vehicles?",
        "source": "X22n0407_003:0302b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三第三下大乘不共業。",
        "translation": "○3. Third, the following are the distinctive karmic activities of the great vehicle.",
        "source": "X22n0407_003:0302b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第三發菩提心是願起意趣向名為發心菩提是道佛果圓通說為菩提讀誦大乘明修解也行能運通說之為乘餘二不及是言大也。",
        "translation": "The third arousal of the mind for enlightenment is the vow to give rise to the intention to proceed to what's called the arousal of the mind for enlightenment, which is the path to the Buddha's fruition that's fully explained as enlightenment, the recitation of the great vehicle, the understanding and cultivation of practice, and the ability to carry it through that's explained as the vehicle, and the other two are not as great as that.",
        "source": "X22n0407_003:0302b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】依無作境起無緣誓名發菩提心實相不二而二立因果殊二而不二始終理一信此因果方名為深讀誦大乘修三智解運圓乘行以此解行教其行者名為勸進此三種業得前前者不得後後得後後者必得前前故今行人能修前二前二不能修於大乘故云餘二不及是言大乘。",
        "translation": "[Commentary] Relying on the unconstructed object to give rise to the unconditioned vow is called arousing the aspiration for enlightenment The reality and characteristics are not two, but two established causes and effects are distinct and not two, and the beginning and end are one in principle.",
        "source": "X22n0407_003:0302b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二佛告下結歎。",
        "translation": "○Two, the Buddha told the following, concluding with praise.",
        "source": "X22n0407_003:0302b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】佛告韋提此三種業三世諸佛淨業正因是歎辭也。",
        "translation": "[Commentary] The Buddha told Vaideh that these three kinds of actions are the proper cause of the pure activities of the three buddhas in the world.",
        "source": "X22n0407_003:0302b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】既是佛業驗是圓修故大經中復有一行名如來行雖云一行而具五行今亦如是雖是佛業而具三種。",
        "translation": "[Commentary] Since this is Buddha's activity and its validation is based on its perfect cultivation, there's another practice in the sutra called the Tathāgata's practice, which is one practice but contains five practices.",
        "source": "X22n0407_003:0302b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難及韋提希諦聽諦聽善思念之如來今者為未來世一切眾生為煩惱賊之所害者說清淨業善哉韋提希快問此事。",
        "translation": "The Buddha told Ānanda and Vaidehī to listen closely and well consider that the Tathāgata was now teaching pure activities to all sentient beings in the future who would be harmed by the afflictions and thieves.",
        "source": "X22n0407_003:0302b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二諦聽下歎其所問。",
        "translation": "[Commentary] Second, he listened intently and then praised his question.",
        "source": "X22n0407_003:0302b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】諦聽諦聽善思念之諦聽令生聞慧善思思慧念之修慧煩惱賊者此能損慧命傷法身故名為賊也。",
        "translation": "[Commentary] Those who listen with care and listen with attention, well-considered, and mindful, so that they may hear wisdom, well-considered wisdom, and mindfulness of cultivating wisdom are called the affliction thieves because they can harm the life of wisdom and harm the Dharma body.",
        "source": "X22n0407_003:0302c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】諦聽等者諸經誡聽皆有此語莫不令人生於三慧而須按教明慧偏圓能聽所聽能思所思能念所念若作生滅解者即三藏三慧無生解者通教三慧無量無作別圓可知今令韋提等生圓三慧若不爾者安能此座即證法忍。",
        "translation": "[Commentary] Truly listening and so forth is a statement found in all the sutras that admonish listening, and it doesn't fail to cause people to give rise to the three kinds of wisdom that need to be partially perfected according to the teachings that explain the wisdom of listening, hearing, thinking, contemplating, mindfulness, and recollection.",
        "source": "X22n0407_003:0302c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難汝當受持廣為多眾宣說佛語如來今者教韋提希及未來世一切眾生觀於西方極樂世界以佛力故當得見彼清淨國土如執明鏡自見面像見彼國土極玅樂事心歡喜故應時即得無生法忍。",
        "translation": "Ānanda, you must accept this and extensively explain the Buddha's words to many people. The Tathāgata now teaches Vaidehī and all sentient beings in future generations to contemplate the western paradise world.",
        "source": "X22n0407_003:0302c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三即得下略付阿難。",
        "translation": "[Commentary] Third, he immediately attains it, and then he briefly explains it to Ānanda.",
        "source": "X22n0407_003:0302c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】即得無生忍是初住初地仁王經說五忍一伏二信三順四無生五寂滅。",
        "translation": "[Commentary] That attainment of the forbearance of nonproductivity is the first abode, first ground, and the five kinds of forbearance explained in the Renwang jing, which are: one subduing, two believing, three conforming, four unborn, and five tranquil.",
        "source": "X22n0407_003:0302c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】經如執明鏡等者觀法如鏡修之如執觀成土現如見面像是知外有三種淨業內備十六玅觀乃得見也此雖略付淨業意說玅觀初住初地者圓住別地俱破無明是無生忍位玅玄一實位云若入初住正破無明是明圓教無生忍位今意在圓引仁王五種忍位者用顯無生居三忍上若依別教十信伏忍十住信忍十行去順忍十地無生忍玅覺寂滅忍若約圓位五品伏忍六根清淨信順二忍初住至等覺名無生忍玅覺名寂滅忍然別初地即圓初住故引仁王以證今位行者應知如來將說十六觀法預彰所說是圓玅觀故云一切眾生觀於極樂觀成即得無生法忍是故韋提聞說十六隨語觀成說說即證此之玅位經示此觀是取初住徑捷之門故不可云想事而已。",
        "translation": "[Commentary] The sutra is like holding a mirror of light, etc. Those who observe things like a mirror and cultivate them like holding an observation to form a land that appears like seeing a face seem to know that there are three kinds of pure activities outside and 16 kinds of subtle contemplations inside before they can be seen. Although this briefly refers to pure activities, the intention is to explain that subtle contemplations in the first abode and first ground are perfect abodes, distinct stages, and the simultaneous breaking down of ignorance is the level of forbearance of nonproductivity, the profound and real level, and the statement that if one enters the first abode and correctly breaks down ignorance, it's clear that the level of forbearance of the perfect teaching is the level of forbearance of nonproductivity.",
        "source": "X22n0407_003:0302c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二初明下明十六玅觀答正受二初分科。",
        "translation": "○Two, first, we'll explain the sixteen meditations below, and then we'll answer the two first sections of the question of correct acceptance.",
        "source": "X22n0407_003:0303a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初明韋提見土之由次一問答明為未來眾生請見土之方法。",
        "translation": "First, he explained the reason Vaidehī saw the land, and then he answered with a question that explained the way to ask future sentient beings to see the land.",
        "source": "X22n0407_003:0303a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告韋提希汝是凡夫心想羸劣未得天眼不能遠觀諸佛如來有異方便令汝得見。",
        "translation": "The Buddha told Vaidehī that you are a worldling with weak mental conceptions who hasn't attained the divine eye and can't see the buddhas and tathāgatas from afar with different methods to enable you to see them.",
        "source": "X22n0407_003:0303a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二汝是下隨釋二初明韋提見土之由。",
        "translation": "[Commentary] Second, you are then explained the following two things: first, he explained the reason Vaidehī saw the land.",
        "source": "X22n0407_003:0303a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】汝是凡夫彰其分齊不能遠觀韋提實大菩薩此會即得無生忍示同在凡夫心想羸劣未得天眼不能遠照見彼國土有異方便令汝得見異方便者即十六觀非直觀名方便以佛力故見彼國者亦是方便也。",
        "translation": "[Commentary] You are a worldling who shows how equally he can't observe Vetī really is a great bodhisattva who will attain the acceptance of nonarising at this meeting, showing that he's the same worldling whose mind is weak in contemplation and who hasn't attained the divine eye and can't see the land from afar.",
        "source": "X22n0407_003:0303a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】經未得天眼等者問阿那律天眼最勝但見大千豈有得天眼者越十萬億土見安養乎答此語未得分真菩薩天眼非二乘也故大經二十二云菩薩所得清淨天眼異於聲聞緣覺所得以是異故一時徧見十方世界現在諸佛大論亦同此說韋提實大菩薩者此顯韋提本住法身為欲發起淨土觀法故示同凡此會即得無生忍者即者方將也此會聞觀將證法忍非謂前文說無生忍是韋提證前文乃是通說未來眾生修十六觀能得無生人見示同凡夫之言便謂前文是韋提證須知即得非已得也既云實大菩薩乃是久證無生如來據迹言是凡夫心想羸劣劣想凡夫修之得忍顯茲玅觀能革下凡頓成圓聖異方便者十六觀法奇異方便也故起信論云修多羅說有勝方便繫念極樂令生彼國非直觀名方便者謂彼依正有二方便能令此土凡夫得見一者修觀正受方便令心眼見二佛神力示現方便能令目擊既得見之由有其二種故云非直觀(去聲)名方便佛力令見亦是方便韋提乃得二種之見一者將有隨文作觀之見二者已蒙佛力示現見也故云韋提見土之由。",
        "translation": "[Commentary] The sutra has not yet attained the divine eye and so forth. He asked, \"Does Aniruddha have the divine eye that's superior but sees a great chiliocosm?\" He replied, \"This statement doesn't imply that the true bodhisattva's divine eye is not that of the two vehicles.\" Therefore, the 22nd section of the sutra says that the pure divine eye attained by a bodhisattva is different from that attained by śrāvakas and pratyekbuddhas, which is why it's possible to see the worlds in ten directions at once.",
        "source": "X22n0407_003:0303a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時韋提希白佛言世尊如我今者以佛力故見彼國土若佛滅後諸眾生等濁惡不善五苦所逼云何當見阿彌陀佛極樂世界。",
        "translation": "Vaidehī then said to the Buddha, \"Bhagavān, now I've seen that land because of the Buddha's power. If sentient beings and others were forced by the five sufferings of what's bad, unwholesome, and impure after the Buddha's death, how would they see Amitâbha's paradise world?",
        "source": "X22n0407_003:0303b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二韋提下為未來請見土之法二初請。",
        "translation": "[Commentary] Second, Vaidehī asked for the future to see the land, and second, he asked.",
        "source": "X22n0407_003:0303b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】韋提白佛如我今者下為佛滅後眾生請也濁者五濁不善者十不善五苦者五道非樂故云五苦或是五惡五痛五燒五惡殺盛邪婬妄語飲酒如大經現遭厄難王法刑罰是五痛也五燒即當來墮三途苦毒名五燒云何當見阿彌陀極樂國土正為啟請。",
        "translation": "[Commentary] Vaidehī said, \"As I am now, we'll ask for the sentient beings after the Buddha's death.\" 'Turbidity' means the five turbidities, 'unwholesomeness' means the ten unwholesome qualities, 'five sufferings' means the five paths are not pleasant, so it's called the five sufferings or the five evils, five pains, five burns, five evils that kill, prosper, are evil, lie, speak falsehoods, drink alcohol, and are punished by the king's laws as in the great scriptures, which are the five pains, and the five burns, which are the pains and poisons of the future descent into the three paths.",
        "source": "X22n0407_003:0303b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】韋提先令示現方便而為請由是故經云如我今者以佛力故見彼國土然復正請觀法方便乃以眾生而為請緣故經云若佛滅後諸眾生等濁惡不善五苦所逼云何當見極樂世界五苦者疏有二釋初以五道非樂釋二以五罪招報釋初釋者地獄燒然苦餓鬼饑虗苦畜生屠割苦人間八種苦天上五衰苦次釋者聖意多含更明五惡招於二報名出大本無量壽經今云大經是也疏文先列三五之名次五惡下釋出三五殺至飲酒五惡因也如大經下釋五痛即華報也五燒下釋五燒即果報也然其二報並無五相各稱五者皆從五種惡因而立故彼五文後皆結云是為一大惡一痛一燒乃至總云五大惡五痛五燒故知二五皆從因立。",
        "translation": "Therefore, the sūtra says, \"Now, I will see that land because of the Buddha's power, but then I will correctly request the method of contemplating the teaching as a reason for requesting it.\" Therefore, the sūtra says, \"If sentient beings are stifled by the five pains of evil and unwholesomeness after the Buddha's death, how will they see the paradise world?\" There are two explanations in the commentary. First, the explanation of the five destinies as unpleasant, and second, the explanation of the five evils that bring retribution.",
        "source": "X22n0407_003:0303b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二答二初列觀分科二初列觀。",
        "translation": "○Two answers, two preliminary lists of contemplations, and two preliminary lists of contemplations.",
        "source": "X22n0407_003:0303c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】答中有十六觀一日觀二水觀三地觀四樹觀五池觀六總觀觀一切樓地池等七華座觀八佛菩薩像觀九佛身觀十觀音觀十一勢至觀十二普往生觀十三雜明佛菩薩觀十四上品生觀十五中品生觀十六下品生觀。",
        "translation": "[Commentary] In the answer, there are sixteen contemplations-one contemplation, two water contemplations, three ground contemplations, four tree contemplations, five pond contemplations, six total contemplations, all floor and pond contemplations, seven flower seat contemplations, eight buddha-bodhisattva image contemplations, nine buddha-body contemplations, ten Avalokitêśvara contemplations, eleven arrival contemplations, twelve universal rebirth contemplations, thirteen 雜明佛菩薩 contemplations, fourteen superior-grade rebirth contemplations, fifteen middle-grade rebirth contemplations, and sixteen lower-grade rebirth contemplations.",
        "source": "X22n0407_003:0303c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】義例云夫三觀者義唯三種一者從行唯於萬境觀一心萬境雖殊妙觀理等如觀陰等即其意也二約法相如約四諦五行之文入一念心以為圓觀三託事如王舍耆闍名從事立借事為觀以導執情如方等普賢其例可識問今十六觀於三種中屬何義耶答既不撮乎法相入心成觀信非附法又非借彼事義立境立觀驗非託事明矣如來直談十六觀行修證之門正當從行也問義例三種皆是理觀今之十六歷依正事何預三種耶答託事附法二種三觀有事有理且置未論從行三觀以何義故不得歷事既言從行必四種行常坐一種縱直觀理餘三三昧豈不兼事如般舟三觀歷念佛事方等三觀歷持呪事法華三觀歷誦經事請觀音三觀歷數息事覺意三觀歷三性事此等歷事若非從行攝屬何耶般舟三昧初觀足下千輻輪相次第逆緣至肉髻相彼觀相時即用三觀彼是從行今那獨非況義例云唯於萬境觀一心豈今依正不唯一心經文具列十六境相大師但於首題示圓三觀令將此觀觀十六境正是萬境雖殊玅觀理等又今三觀并諸歷事三觀若非從行等者那云三觀義唯三種問今經但於像觀示云是心作佛是心是佛諸文皆無觀理之語則知佛外皆是事觀縱將此義例觀十五斯是行人用理觀意據經現文但是事觀答若自依經修觀入證何須四依解說經意製立觀法大師深得佛旨故於首題以玅三觀釋能觀觀以玅三身釋所觀佛而云觀雖十六言佛便周今依大師用三玅觀觀十六境豈是行人自用觀意應知四種三昧無不於事觀三諦理但般舟等依定散善事覺意縱任善惡等事是故偏得歷事之名若常坐等直於三道之事而觀三諦不兼修善及縱惡事故受理名今經觀法豈可異於四三昧耶故知十六正是從行歷事觀理也應知十六皆用三觀為想相之法三觀微故且觀落日及以清水三觀漸著乃觀地樹座像佛身下去諸境皆須三觀。",
        "translation": "[Commentary] The examples of meaning say that the three contemplations have only three kinds of meaning. One is to practice only observing one mind in all objects, although the ten thousand objects are subtle, such as observing the aggregates, etc. That's the idea. Two is to observe the characteristics of things as in the case of the texts of the four truths and five practices, and to enter one mind as a perfect observation. Three is to entrust things as in the case of the name of Rājagṛha and the name of the Jijagṛha, to establish a borrowed thing as an observation to guide attachment as in the case of Samantabhadra.",
        "source": "X22n0407_003:0303c19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○二就十下分科。",
        "translation": "○Two, we'll discuss the ten lower-level sections.",
        "source": "X22n0407_003:0304b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】就十六觀分文為三初六觀觀其依果次七觀觀其正報後三明三輩九品往生也。",
        "translation": "[Commentary] The 16 contemplations are divided into three categories: first, six contemplations on the basis of fruits, second, seven contemplations on the proper retribution, and finally, three explanations of the three groups and nine levels of rebirth.",
        "source": "X22n0407_003:0304b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】以十六觀三類分之六屬依報者日標送想之方氷表琉璃之地雖此土物意顯彼邦是故六觀皆彼依報七屬正報者座為三聖親依像類三聖真體是故七觀皆名正報三輩之人自此之彼修因託質事相不同是故此三自為一類。",
        "translation": "[Commentary] The sixteen contemplations are divided into three categories: six are dependent retribution, the sun indicates the direction of the sending image, the ice shows the place of lapis lazuli, and although the things in this land are intended to show the other state, therefore the six contemplations are all dependent retribution, and the seven are positive retribution, the seats are the three sages' intimate supports, the images are the three sages' true bodies, and therefore the seven contemplations are all called positive retribution.",
        "source": "X22n0407_003:0304b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二第一下隨科解釋三初六觀觀依報六初日觀二初立意分科。",
        "translation": "○Two first, the following section explains the three first six contemplations on the basis of reward, the first six daily contemplations, and the first two establishing the meaning of the section.",
        "source": "X22n0407_003:0304b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第一日觀示令繫心佛告下略明繫念總勸修觀云何下正明作日觀一切有目皆見日沒下舉所觀境當起想下正教觀察是為下結也。",
        "translation": "[Commentary] The first sun contemplation shows that it causes the mind to be tied up, and the Buddha tells the audience to briefly explain how tying up mindfulness generally encourages the cultivation of contemplation.",
        "source": "X22n0407_003:0304b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】先作日觀意令繫心凡心暗散何能明見淨土玅境故令專想落日之形一事繫心想之不已其心則定心若靜細種種觀法皆可造修繫心之法須落日者欲令定想趣於西方是向彌陀所居處故。",
        "translation": "[Commentary] First, making an observation of the setting sun means causing the mind to be tied up, how can the ordinary mind be dark and distracted, and how can it clearly see the noble objects of the Pure Land? Therefore, it causes the mind to concentrate on the shape of the setting sun, and when it's tied up and doesn't stop thinking about it, the mind is concentrated.",
        "source": "X22n0407_003:0304b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二隨解釋二初佛告下總勸修觀。",
        "translation": "○Two explanations follow. First, the Buddha told the audience to generally encourage the cultivation of contemplation.",
        "source": "X22n0407_003:0304b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告韋提希汝及眾生應當專心繫念一處想於西方。",
        "translation": "The Buddha told Vaidehī that you and sentient beings should concentrate your mind, fix it on one place, and contemplate on the West.",
        "source": "X22n0407_003:0304b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】經韋提希汝及眾生者韋提希等是現在機一切眾生是未來機故知修觀不專佛世況復韋提是發起者正為今人請正受法是故我佛勸眾生修修法如何專繫一處所謂西方。",
        "translation": "[Commentary] The sūtra Vaidehī and you and sentient beings are presently motivated, and all sentient beings are future motivated.",
        "source": "X22n0407_003:0304c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二云何下正明日觀三初舉所觀境。",
        "translation": "○Two, what is the next step in correctly understanding daily observation? Three, the first is to cite the object of observation.",
        "source": "X22n0407_003:0304c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何作想凡作想者一切眾生自非生盲有目之徒皆見日沒。",
        "translation": "\"How do we contemplate? Where there's contemplation, all sentient beings who aren't born blind and have eyes see the sun disappear.",
        "source": "X22n0407_003:0304c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】經文意者謂昔曾見者或現前見日欲沒相為所觀境蓋以此觀所被周徧唯除生下雙目俱盲既不識日故莫能想若曾有目即今盲者亦可修之況現有目見日分明修之越易即以所見落日為境想之令起觀中之日。",
        "translation": "[Commentary] The meaning of the sūtras is that those who used to see or those who now see the sun with the intention of disappearing are the objects of contemplation.",
        "source": "X22n0407_003:0304c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二當起下正教觀察。",
        "translation": "○Two should arise, and the following is a correct teaching to observe.",
        "source": "X22n0407_003:0304c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當起想念正坐西向諦觀於日欲沒之處令心堅住專想不移見日欲沒狀如懸鼓既見日已閉目開目皆令明了。",
        "translation": "When he arouses the intention, he sits correctly facing west and observes the place where the sun is about to fall, making his mind resolute, focused, and unwavering.",
        "source": "X22n0407_003:0304c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】釋題觀字明玅三觀題目是總經文是別豈不以總而貫於別今想落日而能想之觀隨解而進三藏事定能想所想無非生滅通教事定能想所想皆如幻化別知能想元是佛性於想能所次第觀中圓人玅解知能想心本具一切依正之法今以具日之心緣於即心之日令本性日顯現其前斯乃以法界心緣法界境起法界日既皆法界豈不即空假中圓人六根常所觸對尚須念念即空假中豈今修觀頓廢此三此猶總示若別論三觀成日功者以根境空寂故心日無礙以緣起假立故累想日生以其心日皆法界故當處顯現此之三觀同在一心非一非三而三而一不可思議以其圓人凡修功行皆悉如是若不爾者非是圓人修事觀也通人必以如幻之心修諸事定以驗圓人用即中心成其事觀既以玅心觀於落日此心堅住能於本性顯現日相不唯閉目能見開目亦皆明了若如此者則日觀成也。",
        "translation": "[Commentary] The title of the explanation of the word contemplation is the general term, and the sūtras are specific. Isn't the general term used to carry through the specific term? Now, when the mind contemplates the setting sun, the contemplation that can be contemplated follows the understanding and advancement of the three tripiṭaka practices, the contemplation that can be contemplated and the contemplation that can be contemplated are nothing other than arising and ceasing, and the shared doctrinal practices, the contemplation that can be contemplated and the contemplation that can be contemplated are both illusory and transformation-like.",
        "source": "X22n0407_003:0304c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○疏出二義二初教令下除疑。",
        "translation": "○The commentary presents two meanings. First, it teaches and instructs the following to remove doubt.",
        "source": "X22n0407_003:0305a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】教令正觀為除疑心大本所明以疑惑心修諸功德生彼國者落在邊地復受胎生故作此觀令除疑惑也。",
        "translation": "[Commentary] The purpose of instructing the correct contemplation is to remove doubt, which is explained in the main text as cultivating merits with a doubtful mind and being born in another country that falls into a border land and is again subject to birth in the womb.",
        "source": "X22n0407_003:0305a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】大本下卷云若有眾生以疑惑心修諸功德願生彼國不了佛智修習善本願生其國此諸眾生生彼宮殿壽五百歲常不見佛不聞法不見僧於彼國土而受胎生此人宿世無有智慧疑惑所致乃至生彼宮殿無有一念惡事但於五百歲中不見三寶故作此觀令除疑惑者經云不了佛智則生疑惑疏云故作此觀令除疑惑即顯此觀能了佛智若其不用一心三觀觀落日者則迷佛智那名此觀能除疑惑日觀既爾餘觀例然故知大師依乎佛智立今觀法然十六觀屬頓教故原始要終皆用佛智若凡小善乃於臨終迴向佛智作眾惡者須依佛智求滅罪障此等亦名了於佛智不生疑惑既有乘種生彼速得見佛聞法預於海眾不生邊地及胎宮也。",
        "translation": "[Commentary] The next volume of the Mahāprajñāpāramitā states that if sentient beings cultivate merit with doubtful minds and wish to be born in another country, they don't know the Buddha's wisdom and cultivate good roots, and wish to be born in that country.",
        "source": "X22n0407_003:0305a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二障者下滅障即五逆重罪也。",
        "translation": "○These two hindrances are the next hindrances to be extinguished, which are the five heinous sins.",
        "source": "X22n0407_003:0305b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】障者大本言唯除五逆誹謗正法故須作觀五逆重罪除六十劫生死罪等下輩自論。",
        "translation": "The great text says that the only thing that removes these hindrances is the five heinous sins that denigrate the true teaching.",
        "source": "X22n0407_003:0305b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】彼經散善力弱故逆謗不生故彼經云若有眾生聞其名字信心歡喜乃至一念至心迴向願生彼國即得往生住不退轉唯除五逆誹謗正法若依今經修正觀者下至日想即能滅除五逆重罪是知逆罪得生必由修觀下輩自論者下品下生觀云除八十億劫生死之罪今言六十者恐六字誤問既用法界以為心境顯法界日令閉目開目常得見日即是觀行見法界理當中三品今何判位在名字初屬下下品答理觀事定相即修者心雖不二事雜凡情故未伏惑事定可成理觀忘情伏惑方發故別惑初伏名觀行位見法界理深伏乃名相似位見分斷方得真見法界今之行者觀日觀氷及觀琉璃雖用法界心境而觀而惑全未伏凡情尚濃方得名字見法界日非觀行位作此判者蓋約鈍根於日等觀且得定心假想之益故在名字也若利根者法界日顯便能圓伏及任運除二種麤惑豈非日觀歷九品耶問今用理解想日現前縱未斷惑事定已成據下經說下下品人以苦逼故不遑念佛但十念頃稱彼佛名心雖相續終不可類見日定心因何同在第九品位答彼由造逆及作眾惡臨終苦逼得遇善友為說玅法雖不能念彼佛三身怖地獄故苦切稱名具足十念既絕後惡即乘此念託彼蓮中名下下品今論始行樂習三昧親善知識聞法了心本具淨土依正諸法標心具修十六觀法故先觀日令心堅住望後諸觀此當末品彼人雖即不成事定而能十念稱佛不散亦為定攝復兼臨終勇決之力故得預於第九品也是故行相雖少不同品位無別。",
        "translation": "[Commentary] The sutra says that because the power of goodness is weak in distraction, rebellion doesn't arise; therefore, the sutra says that if there are sentient beings who hear its name and rejoice in faith and confidence, or even if they are mindful of it and wish to be born in that country, they will be reborn there and abide in nonretrogression.",
        "source": "X22n0407_003:0305b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "○三是為下結。",
        "translation": "○3. This is the next conclusion.",
        "source": "X22n0407_003:0305c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為日想名曰初觀。",
        "translation": "This is called the first contemplation of the day.",
        "source": "X22n0407_003:0305c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二水觀二初分科。",
        "translation": "[Commentary] The first section of the second water contemplation is divided into two.",
        "source": "X22n0407_003:0305c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第二水觀初作水想者舉所觀境界從見水澄清下正起觀行是為水想下結觀也一作水想二變水成冰三變冰為瑠璃四觀瑠璃以成大地內外映徹。",
        "translation": "The second contemplation of water is the first contemplation of water that raises the object of contemplation and correctly initiates the practice of contemplation from the view that water is clarified, which is the lower level of contemplation of water.",
        "source": "X22n0407_003:0305c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二隨釋三初舉所觀境。",
        "translation": "[Commentary] Second, following the explanation, he first cites the object under contemplation.",
        "source": "X22n0407_003:0305c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次作水想。",
        "translation": "The next is to contemplate water.",
        "source": "X22n0407_003:0305c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】即以曾見大陂池水為所緣境。",
        "translation": "[Commentary] That's when he once saw the water of a large, unpolluted lake as the perceptual object.",
        "source": "X22n0407_003:0305c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二見水下正明起觀既稟圓宗知能想心具七大性故以具水之心託彼即心之水觀於本性令水現前并及諸相皆於心性觀令顯現經文為四初作水想。",
        "translation": "○Two views of water correctly clarify the arising of contemplation, and since the school of perfection knows that the mind that's capable of contemplation has seven major natures, it takes the mind with water and entrusts that mind with water to contemplate the original nature, causing the water to appear, and all the other characteristics to be revealed by contemplating the nature of the mind.",
        "source": "X22n0407_003:0305c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見水澄清亦令明了無分散意。",
        "translation": "Seeing the water clarify also makes it clear that there's no distracting thought.",
        "source": "X22n0407_003:0305c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】玅心既運性水即生專想澄清令心不散。",
        "translation": "[Commentary] Once the profound mind carries the nature of water, it immediately gives rise to the focused contemplation of clarifying it so that the mind isn't scattered.",
        "source": "X22n0407_003:0306a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二既見下變水成冰。",
        "translation": "○Two. Having seen the following, he transforms water into ice.",
        "source": "X22n0407_003:0306a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既見水已當起冰想。",
        "translation": "After seeing the water, he'll give rise to the contemplation of ice.'",
        "source": "X22n0407_003:0306a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】性具之法轉變自由故可令水而作堅冰。",
        "translation": "[Commentary] The Dharma that's inherent in nature changes freely, so it can cause water to become solid ice.",
        "source": "X22n0407_003:0306a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○三見冰下變冰為瑠璃。",
        "translation": "○3. Seeing ice down there transforms that ice into lapis lazuli.",
        "source": "X22n0407_003:0306a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見冰映徹作瑠璃想。",
        "translation": "Seeing ice reflected and penetrating, they'll conceptualize it as lapis lazuli.",
        "source": "X22n0407_003:0306a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】水想若成瑠璃可識。",
        "translation": "[Commentary] If this perception of water becomes lapis lazuli, it can be realized.",
        "source": "X22n0407_003:0306a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○四此想下觀瑠璃成地心藏具法有何邊涯無玅觀緣隱而不發今依佛語順性想之寶地光明種種奇相隨心出現此自六段初成地瑩徹。",
        "translation": "○4. Under this conception, he observes the formation of lapis lazuli in the mind's storehouse, which contains the Dharma and has no limit and no hidden or insightful conditions.",
        "source": "X22n0407_003:0306a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此想成已見瑠璃地內外映徹。",
        "translation": "After this perception is formed, he sees the inner and outer reflections of the beryl ground.",
        "source": "X22n0407_003:0306a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二下有下寶幢光明。",
        "translation": "[Commentary] Second, there's the lower jeweled banner of radiance.",
        "source": "X22n0407_003:0306a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下有金剛七寶金幢擎瑠璃地其幢八方八楞具足一一方面百寶所成一一寶珠有千光明一一光明八萬四千色映瑠璃地如億千日不可具見。",
        "translation": "On the ground below, there's a diamond-shaped, seven-jeweled golden banner that holds the lapis lazuli ground in its eight directions and eight flutes, each made of a hundred jewels, each with a thousand lights, and each with 84,000 colors that reflect off the lapis lazuli ground like a billion thousand suns that can't be seen in detail.",
        "source": "X22n0407_003:0306a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三瑠璃下地上莊嚴。",
        "translation": "[Commentary] Three adornments are placed on the ground beneath the lapis lazuli.",
        "source": "X22n0407_003:0306a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "瑠璃地上以黃金繩雜廁間錯以七寶界分齊分明。",
        "translation": "On the ground of the lapis lazuli, there are gold ropes and toilets interspersed with a border of seven treasures that are clearly delineated.",
        "source": "X22n0407_003:0306a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】四一一下寶光樓閤。",
        "translation": "[Exegetical Notes] 4.1.1 A jeweled mansion is illuminated.",
        "source": "X22n0407_003:0306a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一寶中有五百色光其光如華又似星月懸處虗空成光明臺樓閣千萬百寶合成。",
        "translation": "In each one, there are five hundred colored lights that shine like flowers and resemble the stars and moon suspended in the sky, creating a bright tower or mansion made of a thousand hundred treasures.",
        "source": "X22n0407_003:0306a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】五於臺下華幢樂器。",
        "translation": "[Commentary] 5. Underneath the dais are the flowers and banners, which are musical instruments.",
        "source": "X22n0407_003:0306a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於臺兩邊各有百億華幢無量樂器以為莊嚴。",
        "translation": "On each side of the dais are ten billion flower banners with measureless musical instruments to adorn it.",
        "source": "X22n0407_003:0306a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六八種下風樂演法。",
        "translation": "Six, eight kinds of downward-flowing music plays the Dharma.",
        "source": "X22n0407_003:0306a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八種清風從光明出鼓此樂器演說苦空無常無我之音。",
        "translation": "Eight kinds of clear breezes emanate from the light, and this musical instrument plays the sound of suffering, emptiness, impermanence, and no-self.",
        "source": "X22n0407_003:0306a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】地下寶柱承擎地上諸相莊嚴以眾寶間錯其地一一寶出雜色光明光明成諸樓觀樓觀兩邊有華幢幢上多有樂器宣說玅音也八種清風者彼處實無時節若寄此八謂除上下餘四方四維故云八亦可用對八卦也。",
        "translation": "[Commentary] The underground jeweled pillars supporting the ground are adorned with various forms as they are interspersed with various treasures, each of which emits a bright, variegated light that creates the buildings and mansions on either side of the building, and there are many musical instruments on the banners that explain the sound of mysterious things. The eight kinds of clear breezes really don't have a time limit there.",
        "source": "X22n0407_003:0306b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】疏實無時節等者大本云彼無四時不寒不熱及無日月常有光明寄於此土四方四維有八種風故亦順此對有八風然彼八風不同此土令物生長及以衰落但鼓自然之樂演乎玅法之音耳三是為下結。",
        "translation": "The commentary really has no seasons, etc. The Big Book says there are no four seasons, it's not cold or hot, and there's no sun or moon that always has light sent to this land, so there are eight kinds of winds in the four directions and four dimensions.",
        "source": "X22n0407_003:0306b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為水想名第二觀。",
        "translation": "This is called the second contemplation of water.",
        "source": "X22n0407_003:0306b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】三地觀二初分科。",
        "translation": "[Commentary] The first of the two divisions of the third ground of contemplation is this.",
        "source": "X22n0407_003:0306b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第三地觀文有四一漸想觀從若得三昧下第二實觀佛告下明利益作是觀下顯觀邪正。",
        "translation": "[Commentary] The third ground of contemplation has four texts: first, gradual contemplation and second, real contemplation from the perspective of attaining samādhi, and second, the benefits of making this kind of contemplation from the perspective of the Buddha's address, which reveals the correct and wrong contemplations.",
        "source": "X22n0407_003:0306b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】二隨釋四。",
        "translation": "[Commentary] Second, there are four explanations that follow.",
        "source": "X22n0407_003:0306b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此想成時一一觀之極令了了閉目開目不令散失唯除食時恒憶此事如此想者名為麤見極樂國地。",
        "translation": "When these contemplations are formed, they're each observed in detail, making them completely comprehensible, closing the eyes and opening them without causing them to be distracted except for when eating, which is called the stage of the paradise land of coarse views.",
        "source": "X22n0407_003:0306b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】初漸想者轉於冰想用表瑠璃雖復觀地種種莊嚴未稱彼佛勝應所居良以三觀尚微猶兼假想故於彼地名為麤見。",
        "translation": "[Commentary] First, gradual contemplation turns to ice contemplation and uses it to represent lapis lazuli, even though it's a place where various kinds of adornment are observed but not yet described as a place where the Buddha excels and should reside.",
        "source": "X22n0407_003:0306b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○二若得下實觀。",
        "translation": "○Two. If he attains the next level of real contemplation.",
        "source": "X22n0407_003:0306b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若得三昧見彼國地了了分明不可具說是為地想名第三觀。",
        "translation": "If he attains samādhi and sees that the land is perfectly and clearly understood and cannot be specified, this is called the third contemplation of the land.",
        "source": "X22n0407_003:0306b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】玅觀功著三昧有成見彼勝身所依之地莊嚴之相豈可具陳應了同居橫具三土其相非少如諸經說凡小善行迴向求生縱依大乘仍是散善故感安養淨相猶劣若今頓教心觀玅宗所見淨相永異他部如修玅觀於同居穢尚見尊特及實報土豈淨同居身土一槩故今地想玅三昧成見莊嚴事不可具說三佛告下明利益。",
        "translation": "[Exegetical Notes] The meditative contemplation gong-attached to samādhi has the accomplishment of seeing the adornment of the place on which the victorious body rests, how could it be stated in detail? It should be understood that the three lands in the same abode are horizontally complete, and their characteristics are not few. As the sutras say, where small good practices lead back to rebirth, even if one relies on the great vehicle, they're still scattered goodness and are therefore rewarded with a still inferior pure appearance.",
        "source": "X22n0407_003:0306b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告阿難汝持佛語為未來世一切眾生欲脫苦者說是觀地法若觀是地者除八十億劫生死之罪捨身他世必生淨國心得無疑。",
        "translation": "The Buddha told Ānanda, \"You will hold onto the Buddha's words and explain this method of observing the ground for all sentient beings in the future who want to escape suffering. If you observe this ground, you'll remove eight billion eons of birth-and-death sins, abandon your body in another life, and be born in a pure land in the future without doubt.",
        "source": "X22n0407_003:0306c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】前水是想不能滅罪地觀是實故能除斷也。",
        "translation": "[Commentary] Previously, water was a conception that couldn't extinguish sins, and contemplation of the ground was the reality that could remove them.",
        "source": "X22n0407_003:0306c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】疏云前水是想者蓋託此方水成冰事表彼寶地但是假想故名麤見今成三昧實見彼地則名實觀言假想不能滅罪斯是大師順經策進令其行者速成三昧非是假想全不滅罪何以知然日觀尚類下品下生滅罪之數豈麤見地全不除[億-音+(天*天)]四作此下顯邪正。",
        "translation": "[Commentary] The commentary says that conception of the former water is a proxy for the formation of ice in this place, which indicates that the jeweled ground is nothing but a figurative conception. Now that samādhi has been accomplished, the real view of that ground is called the real contemplation.",
        "source": "X22n0407_003:0306c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是觀者名為正觀若他觀者名為邪觀。",
        "translation": "Someone who does this kind of observation is called right observation, and someone who observes others is called wrong observation.",
        "source": "X22n0407_003:0306c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【鈔】觀與經合則稱性見名為正觀見相乖經是發魔事故名邪觀下去皆然。",
        "translation": "[Commentary] When contemplation and sūtra agree, then the view that's called nature is called right contemplation. To see characteristics that deviate from the sūtra is to give rise to demonic incidents that are called wrong contemplation.",
        "source": "X22n0407_003:0306c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說觀無量壽佛經疏玅宗鈔會本卷第三",
        "translation": "Foshuo guan wuliangshou fo jing shou xuanzong xuanhui ben vol. 3",
        "source": "X22n0407_003:0306c21_0",
        "is_bad_quality": false
    }
]