[
    {
        "source_sentence": "佛說阿彌陀經義疏聞持記卷中",
        "translation": "Foshuo amitâbha jing yishu wenchi ji roll zhong",
        "source": "X22n0420_002:0520b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第二正宗分大分三段從初至俱會一處先讚二報莊嚴令生忻慕二不可以少下正示專念持名教修行法三如我今者下後引諸佛同讚勸信受持科分三節曲盡一經有智試觀思過半矣。",
        "translation": "[Commentary] The second main tenet is divided into three major sections from the beginning to the end of the assembly where the two rewards are first praised, adorned, and made desirable, and the two cannot be less than the next direct indication of the cultivation of the teaching of mindfulness of the name, and the third as I am now, followed by the praise of the same buddha to encourage faith and adherence to the three sections of the sutra.",
        "source": "X22n0420_002:0520b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】大科正宗總判中觀今科節一經旨趣皎在目前故曰過半易云智者觀其彖則思過半矣。",
        "translation": "[Commentary] The great section of the Zongzong Zongjian zhongguang observes this section of the sutra, the aim of which is to focus on the present, so it's called \"more than half.\" Yi Yun Zhizhe observes its tuan, then he thinks more than half.",
        "source": "X22n0420_002:0520b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初中又二初總標依正。",
        "translation": "[Commentary] In the middle of the teaching, there were two ways to begin with a general outline that relied on the correct.",
        "source": "X22n0420_002:0520b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告長老舍利弗。",
        "translation": "It was then that the Buddha addressed the elder Śāriputra.",
        "source": "X22n0420_002:0520c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】上二句指對告人眾集即告故云爾時。",
        "translation": "[Commentary] The first two phrases refer to the time when the audience gathered and immediately told him.",
        "source": "X22n0420_002:0520c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】隨釋對告中初釋爾時。",
        "translation": "[Commentary] The first of the two explanations of the counter-adversary was when the Buddha addressed the audience.",
        "source": "X22n0420_002:0520c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】身子大權智慧第一知言解意深契佛懷故諸經便多令對語。",
        "translation": "[Commentary] The body of the Buddha is the greatest in terms of great authority and wisdom, and he knows words and understands ideas deeply enough to understand the Buddha's mind that the sutras often cause him to speak contrastively.",
        "source": "X22n0420_002:0520c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】身下二明多告。",
        "translation": "[Commentary] The second one below the body explains how to tell it often.",
        "source": "X22n0420_002:0520c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】彌勒下生經云大智舍利弗能隨佛轉法輪佛法之大將。",
        "translation": "[Commentary] Maitreya then gave rise to the sūtra saying that Śāriputra of great wisdom could follow the Buddha as he turned the wheel of the Dharma, the Buddha's great general of the Dharma.",
        "source": "X22n0420_002:0520c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】彌下三權智能。",
        "translation": "[Commentary] Maitreya then gave three authorities on wisdom.",
        "source": "X22n0420_002:0520c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】乃知身子才辨超倫及至此經殊無一詞申疑請問從始至末盡是如來呼以告之即向所謂示同不知義見于此。",
        "translation": "[Commentary] Nai knew that the body of the Tathāgata was more talented than the others, and up to this point in the sūtra, there wasn't a single word that raised a question, asking whether the Tathāgata had called out to him from the beginning to the end and told him that the meaning was the same as the so-called showing.",
        "source": "X22n0420_002:0520c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】乃下四顯示權言大權者法身大士覆本垂跡響影嘉會即內秘外現也是淨覺前釋諸大尊者方等聞經亦約權意探點今文對告身子頗符今疏十大弟子各具一德身子智慧最為第一餘文可解孤山云不告菩薩而告聲聞者意令小乘初心忻樂求生迴小入大身子已證上果在方等時菩提心死自謂將入無餘究竟滅度大乘望之不生變易而此二途並不求生淨土今告者寄高訓下耳今謂說此經所被之機若但小乘初心不通後位則顯淨土教門未曰圓頓一不可也又復身子果或菩提心死則應鹿苑便入無餘依界既到方等義當大乘機發豈是心死二不可也又謂二途并不求生對告乃是寄高訓下者今問身子正當對告之時為解不解若言解者豈是寄高若不解者對告何為豈得頑然都無所曉三不可也應知身子菩提大心決定不死冥密在懷故至方等被受彈訶但以從初發心怱怱取證唯期小果未甞聞有他方淨土佛意欲令聞大乘法心生忻慕修菩薩行淨佛國土教化眾生遠希佛道是故特地呼名對告是故淨覺疏云告舍利弗者應有四悉檀意一是左面弟子大小法集多居其首故二由智慧第一四眾八部岡不欽仰故三為令四果聞佛淨土自鄙絕分故四復欲小乘未取證者迴心向大故此說故與孤山懸遠不若今疏釋義最優學者公心試與評論。",
        "translation": "[Commentary] It's the next four words that show the authority of the great bodhisattva who covers the traces of the Dharma body and echoes the images of the Kahui, which are the inner and secret external manifestations of the scriptures explained by Jingjue before, the great honored ones who have heard of the scriptures in the past and have come to hear of the scriptures in the present are quite consistent with the ten major disciples of this commentary who each possess one virtue, the wisdom of the bodhisattva is the greatest, and the rest of the text is open to interpretation.",
        "source": "X22n0420_002:0520c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】從是已下即所告事上四句標依報。",
        "translation": "[Commentary] From here on down, the four phrases above refer to the things that are being told as the basis for the retribution.",
        "source": "X22n0420_002:0521a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】所告事中先節經文分依正兩報初依報中。",
        "translation": "[Commentary] Among the things that are being told, the first section of the sūtra divides the two reliance and direct rewards.",
        "source": "X22n0420_002:0521a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從是西方過十萬億佛土有世界名曰極樂。",
        "translation": "From this, there's a world in the west, one hundred thousand million Buddha-lands, called paradise.",
        "source": "X22n0420_002:0521a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】淨土多種如別所論。",
        "translation": "[Commentary] There are many kinds of pure lands as discussed separately.",
        "source": "X22n0420_002:0521a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】言淨土多種者淨土之名通事通理理如圓覺云地獄天宮皆為淨土仁王云唯佛一人居淨土等事如光明云願我來世得此殊異功德淨土淨名云而常修淨土教化諸眾生等而況西方復有河沙淨土如別委論見觀經疏。",
        "translation": "[Commentary] When it comes to the many kinds of pure lands, the names of the pure lands refer to both phenomena and principles, such as Yuanjue Yun's statement that hells and heavens are all pure lands, Renwang Yun's statement that only one person, the Buddha, resides in a pure land, and other phenomena such as Guangming Yun's statement that he hopes I'll attain this extraordinary merit in the future Pure Land, Jingming Yun's statement that he'll always cultivate the Pure Land and teach and transform sentient beings.",
        "source": "X22n0420_002:0521a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今此所標同居淨土。",
        "translation": "Commentary] Now this is called the Pure Land of the Same Abode.",
        "source": "X22n0420_002:0521b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】今此的指法藏因地發願修成同居土也。",
        "translation": "[Commentary] Now, this refers to the land of co-residence that Fazang had vowed to cultivate as a result of his causal stage.",
        "source": "X22n0420_002:0521b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如世邦國方向遠近二皆是定。",
        "translation": "[Commentary] Suppose the direction of a worldly state or country, both near and far, is determined.",
        "source": "X22n0420_002:0521b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】如下釋經從是西方過十萬億佛土等文舉世邦國為例方向即經從是西方也遠近即經過十萬億也二皆定者即方向遠近也。",
        "translation": "[Commentary] In the following explanation of the sūtras, we'll take the example of the world's states, where the direction is from the west, and the distance is past a hundred thousand million, both of which are determined, meaning the direction is far and near.",
        "source": "X22n0420_002:0521b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】對此極苦故名極樂亦名安樂亦號安養。",
        "translation": "[Commentary] To counteract this extreme suffering is therefore called extreme bliss, which is also called peace and happiness and also called tranquility.",
        "source": "X22n0420_002:0521b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】極苦極樂如下別釋自明。",
        "translation": "[Commentary] Extreme suffering and extreme bliss are explained separately below.",
        "source": "X22n0420_002:0521b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十萬億剎凡情疑遠然彈指屈臂剎那可到。",
        "translation": "[Commentary] Ten thousand million billions of jātas are distant for worldly doubters, but they can reach them in a moment by snapping their fingers and flexing their arms.",
        "source": "X22n0420_002:0521b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】十下決世人疑初四句總示不遠一下四句別示二義。",
        "translation": "[Commentary] Ten lower-level answers to the world's doubts. The first four sentences summarize what's not far away, and the first four sentences show the two meanings separately.",
        "source": "X22n0420_002:0521b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一以十方淨穢同一心故二以心念迅速不思議故。",
        "translation": "[Commentary] One is because the pure and defiled states of mind in the ten directions are the same, and the other is because mindfulness of mind is quick and inconceivable.",
        "source": "X22n0420_002:0521b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】初義約心體包容良以十方微塵剎土皆我心性攝無不周虗空尚在心中十方豈存性外次義約心念速疾世間萬法不出四大地水火風須假色香味觸四微所成地大具足四微其體最重水火第減其體漸輕風但有觸其體稍輕唯有心法不假四微全無色質所以其體速疾於風雖百年之久舉心即在目前縱萬里之遙動念不離足下故心論云心念疾於風是也。",
        "translation": "[Commentary] The first meaning is about the mind's embodied nature, which is good because the ten directions of the tiny dusty bases and lands are all included in our mind's nature, and there's nothing that doesn't circumambulate the space that's still in our mind, how could the ten directions exist outside of our nature? The second meaning is about the mind's mindfulness of speed, which is the result of the four elements that are not present in the world, such as form, water, fire, and wind, which are formed using form, odor, and touch.",
        "source": "X22n0420_002:0521b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十疑論云但使眾生淨業成者臨終在定之心即是淨土受生之心動念即是生淨土時為此觀經云彌陀淨土去此不遠。",
        "translation": "[Commentary] The Treatise on Ten Doubts says that if sentient beings accomplish pure activities, the mind in meditation at the end of their lives is the pure land, and the mind moving with thought is when they are born in the pure land.",
        "source": "X22n0420_002:0521b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又心業力不思議一念即生不須愁遠等。",
        "translation": "[Commentary] Also, the power of mental activity is not considered a single thought that is born, so there is no need to be concerned about the distance.",
        "source": "X22n0420_002:0521c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】十下引文雙證雖則平生修行淨業最要唯在臨終一念眾生所以流浪生死只為臨終無定力故如經中說心識二性躁動不停隨所作業而墮諸有若使一念在定心則不散生死塵勞悉皆消殞淨土境界應念現前乘此正念即得往生故知淨土不離我心為下論自引經下並論文證前次義。",
        "translation": "[Commentary] The ten quotations below both confirm that although the most important thing about cultivating pure activities in ordinary life is only the single thought at the end of life, so wandering through birth and death is only because there's no power of concentration at the end of life.",
        "source": "X22n0420_002:0521c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】下三句標正報。",
        "translation": "[Commentary] The next three sentences are an indication of the correct reward.",
        "source": "X22n0420_002:0521c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其土有佛號阿彌陀今現在說法。",
        "translation": "In that land, there's a Buddha named Amitâbha who's now presently teaching.",
        "source": "X22n0420_002:0521c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】但言化主必兼徒眾簡非過未故云現在。",
        "translation": "[Commentary] But when it says master of transformation, it must also include disciples, which is not superfluous; therefore, it's called present.",
        "source": "X22n0420_002:0521c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次正報中即經其土有佛下三句餘文可解。",
        "translation": "[Commentary] The next three sentences in the main reward are the following three sentences from the sūtra: \"There's a Buddha in his land.\" The rest of the text is open to interpretation.",
        "source": "X22n0420_002:0521c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】舍利下二別釋依正又二從初至莊嚴釋依報舍利弗於汝意下次明正報初中又二初略釋名義又舍利下廣明勝相。",
        "translation": "From the first to the adorned explanation of the direct and circumstantial rewards, Śāriputra explained the direct and circumstantial rewards in the next section.",
        "source": "X22n0420_002:0521c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Middle section.",
        "source": "X22n0420_002:0521c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗彼土何故名為極樂。",
        "translation": "\"Śāriputra, what is it about that land that's called paradise?",
        "source": "X22n0420_002:0521c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】上三句徵問。",
        "translation": "[Commentary] The first three sentences are a question.",
        "source": "X22n0420_002:0521c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】下四句釋通。",
        "translation": "The next four sentences explain it in general terms.",
        "source": "X22n0420_002:0521c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國眾生無有眾苦但受諸樂故名極樂。",
        "translation": "Because the sentient beings in that country don't experience many sufferings but only pleasures, it's called the ultimate bliss.'",
        "source": "X22n0420_002:0521c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】無眾苦者對顯娑婆令生忻厭。",
        "translation": "[Commentary] The absence of many sufferings is a reflection of sahāsāra that causes people to become disillusioned.",
        "source": "X22n0420_002:0522a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三界六道總名苦果。",
        "translation": "[Commentary] The three realms and six destinies are generally called the results of suffering.",
        "source": "X22n0420_002:0522a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】別釋依報明娑婆苦中初二句總標苦果。",
        "translation": "[Commentary] The first two phrases in the Explanation of Specific Dependent Retribution Explanation of the Suffering of Saṃsāra generally refer to the result of suffering.",
        "source": "X22n0420_002:0522a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】於中復有八苦五苦三苦。",
        "translation": "[Commentary] Within that, there are also eight pains, five pains, and three pains.",
        "source": "X22n0420_002:0522a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】於下別示三名。",
        "translation": "[Commentary] Here, the following three are shown separately.",
        "source": "X22n0420_002:0522a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】生老病死貧困愛別怨會求不得為八苦也。",
        "translation": "[Commentary] Birth, old age, illness, death, poverty, craving, specific enmity, and lack of access are the eight sufferings.",
        "source": "X22n0420_002:0522a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】生下細釋三相八苦者諸出不同且據現文於義自顯。",
        "translation": "[Commentary] Under birth, we'll explain in detail the three aspects of the eight sufferings, which are different, and the meaning will be revealed based on the present text.",
        "source": "X22n0420_002:0522a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】殺盜婬妄飲酒五種惡業並是苦因必招苦果名五苦也。",
        "translation": "[Commentary] The five bad activities of killing, stealing, lust, delusion, and drinking alcohol are causes of suffering and will surely bring about the result of suffering, which is called the five kinds of suffering.",
        "source": "X22n0420_002:0522a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】五苦者大本名為五惡五痛五燒由毀五戒結成惡業現受惡報後墮地獄。",
        "translation": "[Commentary] The five kinds of suffering are called the five evils, the five pains, and the five burns, which are the results of bad actions formed by violating the five precepts and are now subject to bad retribution and subsequently fall into hell.",
        "source": "X22n0420_002:0522a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】苦苦壞苦行苦名三苦也。",
        "translation": "[Commentary] Suffering, pain, destruction, and action are called the three kinds of suffering.",
        "source": "X22n0420_002:0522a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三苦者從違順中庸三境而生三受苦受生苦苦樂受生壞苦不苦不樂受生行苦。",
        "translation": "[Commentary] The three kinds of suffering arise from disobeying the middle way and the three objects, and the three feelings of painful feelings give rise to painful feelings, pleasant feelings give rise to bad feelings, and feelings that are neither painful nor pleasant give rise to painful actions.",
        "source": "X22n0420_002:0522a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】諸經論中略示名數。",
        "translation": "[Commentary] The names are abbreviated in the sūtras and śāstras.",
        "source": "X22n0420_002:0522a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】諸下指略。",
        "translation": "[Commentary] The following are abbreviated references.",
        "source": "X22n0420_002:0522a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】諦論忍土一切皆苦無一可樂火宅牢獄未足為喻。",
        "translation": "[Commentary] When we discuss the land of forbearance, everything is painful, and there's no one to be delighted with.",
        "source": "X22n0420_002:0522a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】彌陀淨土。",
        "translation": "[Commentary] The Pure Land of Maitreya.",
        "source": "X22n0420_002:0522a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】總示淨土樂中初科初句總標境。",
        "translation": "[Commentary] The first phrase of the first section in the Summary of the Pure Land's Delights section generally identifies the objective realm.",
        "source": "X22n0420_002:0522a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】境界殊絕。",
        "translation": "[Commentary] The objective realm is quite different.",
        "source": "X22n0420_002:0522a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】下五句第列五相一莊嚴勝【疏】聖賢同會。",
        "translation": "[Commentary] The next five sentences list the five characteristics.",
        "source": "X22n0420_002:0522a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】二主伴勝【疏】聞法悟道。",
        "translation": "[Commentary] Two, the principal and secondary [Commentary] are superior [Commentary] Hearing the teaching and awakening to the path.",
        "source": "X22n0420_002:0522a19_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三法道勝【疏】壽命永劫。",
        "translation": "[Commentary] Three: [Commentary] The Way of the Dharma is superior [Commentary] Longevity is an eternity.",
        "source": "X22n0420_002:0522a19_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】四壽命勝【疏】不退菩提。",
        "translation": "[Note] 4. [Commentary] Longevity is superior [Commentary] Nonretrogression and enlightenment.",
        "source": "X22n0420_002:0522a20_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】五證果勝。",
        "translation": "[Commentary] Five realizations are superior.",
        "source": "X22n0420_002:0522a20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】更有餘樂不能過此秪無諸苦已為可樂況具諸勝事其樂何窮故云極也。",
        "translation": "[Commentary] There are other pleasures that can't surpass this because the absence of suffering is already enjoyable, so how could their pleasures end when they're replete with excellent things?",
        "source": "X22n0420_002:0522a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】更下諸句結顯良由彼土依正二報妙色妙聲皆是法藏無作之功德之所莊嚴稱性契理本無有極今言極者無極也對顯此土三苦四苦五苦八苦種種眾苦沒在其中罔有邊際亦名極也。",
        "translation": "[Commentary] The following sentences conclude by showing that it's because the two rewards of that land's existence and correctness, wonderful form and wonderful sound, are all adorned by the merit of the Dharma treasure that's uncreated, praiseworthy, and in line with the principle that there were originally no ends.",
        "source": "X22n0420_002:0522a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大本云設我得佛國中人天所受快樂不如漏盡比丘不取正覺。",
        "translation": "[Commentary] The main text says, \"Suppose I were to attain the happiness of humans and gods in a buddha land that's not like a monk whose contaminants have ended and who doesn't attain right awakening.",
        "source": "X22n0420_002:0522b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】引示中初引本願正示次引玄義勸修漏盡比丘即四果阿羅漢諸漏已盡無復煩惱也。",
        "translation": "[Commentary] In the introduction, the first quote is a correct indication of the past vows, and the second quote is an esoteric exhortation to cultivate a monk whose contaminants have ended and who has no more afflictions, which is the fourth-fruit arhat.",
        "source": "X22n0420_002:0522b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】善導云願生彼國必須勵心克己畢命為期上在一形似如小苦前念命終後念即生長時永劫受無為法樂直至成佛不逕生死豈不快哉。",
        "translation": "[Commentary] Shandao says that when you vow to be born in that country, you must motivate yourself and save your life for a period of time that's long, resembles minor suffering, and when your life ends, your mindfulness is followed by longevity, and you'll experience the bliss of the noncontaminated dharmas for an eternity until you become a buddha and don't drift through birth and death.",
        "source": "X22n0420_002:0522b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次廣明中依報國土耳目所對不出聲色。",
        "translation": "[Commentary] Next, in broad strokes, the land of rewards is one where sound and form are not objectified by the ear and eye.",
        "source": "X22n0420_002:0522b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次廣明總示中初四句總標聲色。",
        "translation": "[Commentary] The first four phrases of the second broad statement summarize sound and form.",
        "source": "X22n0420_002:0522b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】據經後結成就莊嚴止有三處即為三段初欄網樹池唯是妙色莊嚴二金地華樂則兼色聲莊嚴三鳴禽風樹止是法音莊嚴。",
        "translation": "First, the fences, nets, trees, and ponds are only sublime form adornment; second, the golden ground and flowers and music are both form and sound adornment; and third, the songbird and wind trees are Dharma-sound adornment.",
        "source": "X22n0420_002:0522b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】據下依經科節。",
        "translation": "[Commentary] According to the following section of the sutra, we rely on the section.",
        "source": "X22n0420_002:0522b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】故今科約與昔全殊請考經文無宜執舊。",
        "translation": "[Commentary] Therefore, the present section is completely different from the past. Please examine the sūtras and don't bother to stick to the old.",
        "source": "X22n0420_002:0522b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】故下明今異古孤山云示相為五一欄網行樹二池水樓閣三金地天華四奇妙雜鳥五風樹法音由茲五種莊嚴故名但受諸樂淨覺云莊嚴之相有二一莊嚴事境二演暢法音初又三一欄楯羅網等二水池樓閣等三天樂金池等並由不考經中結文致茲疎謬信知今疏超邁古今聞義不能徙孔子憂之。",
        "translation": "[Note] Therefore, the following explains the difference between the present and the past. Gushan Cloud shows the five phases as one railing, two rows, two pools, two towers, three golden fields, three heavenly flowers, four wonderful birds, and five wind, two trees, and the Dharma voice.",
        "source": "X22n0420_002:0522b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】就初莊嚴分二初至香潔即列相舍利下二結示列相又二初至極樂舉欄網行樹以顯名又舍利下二引池閣寶蓮以示相。",
        "translation": "[Commentary] Regarding the first section of the Sutra of Adornment, the first two arrive at Xiangjie, which is a list of characteristics, and the second below Sheli, which is a list of characteristics, and the second arrives at Jiluo, which rails and nets and rows of trees to show the name, and the second below Sheli, which introduces ponds and mansions of precious lotus seeds to show the characteristics.",
        "source": "X22n0420_002:0522b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Middle section.",
        "source": "X22n0420_002:0522c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗極樂國土七重欄楯七重羅網七重行樹皆是四寶周帀圍繞是故彼國名為極樂。",
        "translation": "Śāriputra's land of paradise is surrounded by seven layers of railing, seven layers of netting, and seven layers of rows of trees, all surrounded by the four treasures.",
        "source": "X22n0420_002:0522c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】上七句示相下二句結名。",
        "translation": "[Commentary] The first seven sentences show the characteristics, and the second concludes with the name.",
        "source": "X22n0420_002:0522c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】隨釋列相中欄楯者縱曰欄橫曰楯切韻云堦際釣欄也。",
        "translation": "[Commentary] Following the explanation of the listed characteristics, the term railing and shield refers to the vertical as railing and the horizontal as shield, which is used in the rhyme scheme to describe the fishing railing at the edge of the jie.",
        "source": "X22n0420_002:0522c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】言行樹者周迴七重一一樹高八千由旬行行相當不參差故其樹枝葉上下七層皆垂珠網狀同佛塔。",
        "translation": "[Commentary] This is called a rows of trees that circle seven times, each one 8,000 yojanas high, and their rows are not distinct, so their branches and leaves hang down and up in seven layers, all draped in a net of beads like a stūpa.",
        "source": "X22n0420_002:0522c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】行樹中初約義釋。",
        "translation": "[Commentary] The first of these is explained in terms of the meaning of the rows of trees.",
        "source": "X22n0420_002:0522c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】觀經云妙真珠網彌覆樹上一一樹上有七重網一一網間有五百億妙華宮殿。",
        "translation": "[Commentary] The Avalokitêśvara Sutra says that a net of marvelous real beads covers the tree, and on each tree there are seven nets, and between each net there are 50 billion wonderful flower palaces.",
        "source": "X22n0420_002:0522c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次引經證。",
        "translation": "[Commentary] The next quote from the sūtras proves it.",
        "source": "X22n0420_002:0522c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一重樹下一重欄楯故亦七重。",
        "translation": "[Commentary] Since there's one railing underneath each tree, there are also seven.",
        "source": "X22n0420_002:0522c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】一重下顯樹欄楯重數。",
        "translation": "[Commentary] Each layer below shows the number of layers of the tree's railing.",
        "source": "X22n0420_002:0522c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】網是珠瓔復依樹上。",
        "translation": "[Commentary] The net is a pearl necklace that also rests on a tree.",
        "source": "X22n0420_002:0522c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】網下點珠網所依。",
        "translation": "[Commentary] The lower part of the net is dotted with the pearls and nets on which it rests.",
        "source": "X22n0420_002:0522c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】則知皆是下二句止顯樹欄之體耳。",
        "translation": "[Commentary] Then he knows that these are the next two phrases that stop short of revealing the body of the tree's railing.",
        "source": "X22n0420_002:0522c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】則下點樹欄體。",
        "translation": "[Commentary] Then the next two phrases merely show the body of the tree's railing.",
        "source": "X22n0420_002:0522c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一金二銀三瑠璃四玻[王*梨]是為四寶。",
        "translation": "[Commentary] One gold, two silver, three lapis lazuli, and four glass [kings*ears] are the four treasures.",
        "source": "X22n0420_002:0522c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次顯四寶局在樹欄四寶中。",
        "translation": "[Commentary] The next item shows that the four treasures are found in the four parts of the tree fence.",
        "source": "X22n0420_002:0522c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初正示。",
        "translation": "△The first one is shown correctly.",
        "source": "X22n0420_002:0522c17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若準觀經七寶華葉無不具足又大本中根莖枝葉七寶間錯。",
        "translation": "[Commentary] If we refer to the contemplation sutra, there are seven precious flowers and leaves that are not incomplete, and there are seven interlaced treasures in the main text, such as roots, stems, branches, and leaves.",
        "source": "X22n0420_002:0522c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】若準下杖異。",
        "translation": "[Commentary] If the sutra is accurate, the following staffs differ.",
        "source": "X22n0420_002:0523a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此中略舉委在他文。",
        "translation": "[Commentary] This is an abbreviated version of the commission in another text.",
        "source": "X22n0420_002:0523a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】此下顯略。",
        "translation": "[Commentary] This is the next section that shows the abbreviation.",
        "source": "X22n0420_002:0523a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】周帀圍繞有云凡佛菩薩居處皆然非謂一國土止有七重耳。",
        "translation": "[Commentary] There's a cloud around the circumference that says that wherever buddhas and bodhisattvas live, it's all the same, not that a single land only has seven layers.",
        "source": "X22n0420_002:0523a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】圍繞中有云者文見大本與新譯經。",
        "translation": "[Commentary] For the text that says there are clouds in the circumference, see the main text and the newly translated sūtras.",
        "source": "X22n0420_002:0523a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】結名可解下諸莊嚴例順此結。",
        "translation": "[Commentary] The following examples of the adornments follow this syllogism.",
        "source": "X22n0420_002:0523a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結名中例順此結者謂下二處莊嚴文後例須結云是故彼國名為極樂但在文略故此點之。",
        "translation": "[Commentary] The example of following this junction in the junction of names means that after the text of the next two places of adornment, the example must be followed by the junction, \"Therefore, that country is called paradise, but the text is abbreviated, so this is a nod to it.",
        "source": "X22n0420_002:0523a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二池閣中分四初明池水二池畔階道三階上樓閣四池中蓮華。",
        "translation": "[Commentary] The two ponds and the pavilion are divided into four, the first clarifying the pond water, the second the pond's shoreline, the third the pavilion on the stairs, and the fourth the lotus in the pond.",
        "source": "X22n0420_002:0523a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Beginning with the middle way.",
        "source": "X22n0420_002:0523a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗極樂國土有七寶池八功德水充滿其中池底純以金沙布地。",
        "translation": "Śāriputra's land of paradise has seven jeweled ponds and eight meritorious waters filling the bottom of them, which are purely covered with gold sand.",
        "source": "X22n0420_002:0523a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】七寶池者彼有八池七寶所成。",
        "translation": "[Commentary] The seven-jewel pond has eight pools made of seven treasures.",
        "source": "X22n0420_002:0523a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】池閣隨釋池水中初示池數。",
        "translation": "[Commentary] The pool pavilion follows the explanation of the pool of water in the first indication of the number of pools.",
        "source": "X22n0420_002:0523a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】池中之水亦七寶色名八功德一澄清二清冷三甘美四輕軟五潤澤六安和七除飢渴八長養諸根。",
        "translation": "[Commentary] The water in the pond is also seven precious colors called eight virtues a clarifying two cool three sweet four soft five moisten six peaceful and seven remove hunger and thirst eight long nourishing the faculties.",
        "source": "X22n0420_002:0523a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次示池體。",
        "translation": "[Commentary] The pond's body is shown next.",
        "source": "X22n0420_002:0523a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】每一池心有如意珠王水從中出流注池中。",
        "translation": "[Commentary] In the center of each pond is the wish-granting pearl king, from which water flows into the pond.",
        "source": "X22n0420_002:0523a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】每下示水源。",
        "translation": "[Commentary] Each of the following shows the source of the water.",
        "source": "X22n0420_002:0523a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】金沙布地者觀經云渠下皆以雜色金剛以為底沙。",
        "translation": "[Commentary] The gold sand spreads out on the ground when you contemplate the sūtras and ditches are all underneath with variegated vajra as the bottom sand.",
        "source": "X22n0420_002:0523a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】金下示池底並見觀經。",
        "translation": "[Ji] gold shows the bottom of the pool and see the sutra of contemplation.",
        "source": "X22n0420_002:0523a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二中。",
        "translation": "[Commentary] In two.",
        "source": "X22n0420_002:0523a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四邊階道金銀琉璃玻[王*梨]合成。",
        "translation": "The four sides of the stairway gold, silver, lapis lazuli glass [Wang * Li] composite.",
        "source": "X22n0420_002:0523a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】階砌亦即四寶。",
        "translation": "[Commentary] The stairway is also known as the four treasures.",
        "source": "X22n0420_002:0523a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三明樓閣乃列七寶。",
        "translation": "[Commentary] The three bright towers are a collection of seven treasures.",
        "source": "X22n0420_002:0523b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上有樓閣亦以金銀琉璃玻[王*梨]硨磲赤珠瑪瑙而嚴飾之。",
        "translation": "The upper part of the tower is also decorated with gold, silver, lapis lazuli, glass, [king*li] giant coral, red pearl, and onyx.",
        "source": "X22n0420_002:0523b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】觀經云眾寶國土一一界上有五百億寶樓。",
        "translation": "[Commentary] The sūtra says that there are 50 billion jeweled towers on each of the many jeweled lands.",
        "source": "X22n0420_002:0523b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】樓閣中經文但云上有樓閣故引觀經示數。",
        "translation": "[Commentary] The sūtras only say that there are towers on top, so they cite the contemplation sūtras to show the number.",
        "source": "X22n0420_002:0523b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】瑠璃梵語此翻不遠去波羅奈城不遠有山出此寶故。",
        "translation": "[Commentary] The Sanskrit word for lapis lazuli is not far from the city of Polonai, but there's a mountain where this treasure comes from.",
        "source": "X22n0420_002:0523b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】琉璃具云吠瑠璃【疏】玻[王*梨]亦云頗胝迦此翻水玉或云水精。",
        "translation": "[Commentary] Lazuli is also called vaiḍūrya, which is translated as water jade or water essence.",
        "source": "X22n0420_002:0523b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】玻[王*梨]正云窣坡致迦其狀少似此方水精然有赤白二色不同【疏】硨磲下並華言如車之磲磲謂車輞。",
        "translation": "[Note] Bo [Wang * Li] is also called sulphoṭika, which is less like the water essence of this region but has two different colors: red and white.",
        "source": "X22n0420_002:0523b08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】車渠梵云牟娑洛拉婆此云青白色寶尚書大傳云太貝如大車之渠輞即輪外之本【疏】赤珠者佛地論云赤蟲所出珠體赤故。",
        "translation": "[Note] The Che Qu (Sanskrit: musālava) is a blue-and-white colored gem, which Shang Shu's great biography says is a large shell like the Qu of the great cart, which is the rim of the wheel [Note] The red pearl is a result of the red body of the pearl produced by the red bug, as stated in the Buddha-stage Commentary.",
        "source": "X22n0420_002:0523b10_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】赤珠梵云鉢摩羅伽此云赤光珠智論云真珠出魚腹中竹中蛇腦中不唯蚌胎也【疏】碼碯應法師云此寶色赤如馬腦焉。",
        "translation": "The red pearl is a pearl that comes out of the belly of a fish, in the bamboo, in the brain of a snake, and not just from a clam's womb.",
        "source": "X22n0420_002:0523b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】馬腦梵云摩婆羅伽隷新經云阿濕摩揭拉婆此云藏杵或翻胎藏取此寶堅實為名。",
        "translation": "[Commentary] The Sanskrit word for horse brain is māva-rāja, and the new sūtra says, \"Aśma-garbha,\" which is a hidden pounder or a translation of the word \"womb-store,\" takes the name of the solidity of this treasure.",
        "source": "X22n0420_002:0523b15_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大本云設我得佛自地至空宮殿樓閣池流華樹皆以無量雜寶百千種香而共合成嚴飾奇妙超諸天人等。",
        "translation": "[Commentary] The main text says, \"Suppose I were to attain Buddhahood from the ground up to the empty palace, tower, pond, stream, and flowering tree, all adorned with an infinite variety of treasures and a hundred thousand kinds of fragrance, surpassing gods and humans in beauty and adornment.",
        "source": "X22n0420_002:0523b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】今經止云七寶復引大本無量雜寶驗非局也。",
        "translation": "[Commentary] Now, the sūtra stops short of saying seven treasures and then cites the Daibun's measureless variety of treasures to confirm that it's not a limitation.",
        "source": "X22n0420_002:0523b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】四示蓮華。",
        "translation": "[Commentary] The fourth lotus is shown.",
        "source": "X22n0420_002:0523b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "池中蓮華大如車輪青色青光黃色黃光赤色赤光白色白光微妙香潔。",
        "translation": "The lotus in the pond is as large as a chariot wheel, blue in color, blue in light, yellow in color, yellow in light, red in light, white in light, and delicately fragrant and clean.",
        "source": "X22n0420_002:0523b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】有五一形量二顯色三光燄四香氣五潔淨對文可見。",
        "translation": "[Commentary] There are five of them: one is shaped and measured, two are visible in color, three are luminous and flaming, four are fragrant, and five are pure.",
        "source": "X22n0420_002:0523c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若準觀經一一池中有六十億七寶蓮華一一蓮華團圓正等十二由旬。",
        "translation": "[Commentary] Suppose you examine the sūtras and see that in each pond there are six billion seven-jewel lotus flowers, each one a perfect mass of twelve yojanas.",
        "source": "X22n0420_002:0523c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】蓮華示異中初正示異。",
        "translation": "[Commentary] The lotus shows the difference, and the first one correctly shows the difference.",
        "source": "X22n0420_002:0523c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】既言七寶非止四色。",
        "translation": "[Commentary] Since it says seven treasures, it's not just four colors.",
        "source": "X22n0420_002:0523c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】有二一者七寶四色異。",
        "translation": "[Commentary] There are two things. One is that the four colors of the seven treasures are different.",
        "source": "X22n0420_002:0523c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十二由旬非止車輪。",
        "translation": "[Commentary] Twelve yojanas doesn't stop at the wheels of a chariot.",
        "source": "X22n0420_002:0523c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】二者十二由旬車輪異。",
        "translation": "[Commentary] Two, the chariot wheel of twelve yojanas is different.",
        "source": "X22n0420_002:0523c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然車有大小難為定準此間極大不過數尺可依輪王車輪為量。",
        "translation": "[Commentary] Still, it's difficult to determine the size of a chariot. Here, the very largest chariot is just a few feet, so you can rely on the wheel of the wheel-turning king's chariot as a measurement.",
        "source": "X22n0420_002:0523c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】然下定車輪初約義定。",
        "translation": "[Commentary] However, the following is a determination of the initial meaning of the chariot wheel.",
        "source": "X22n0420_002:0523c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十住毗婆沙云轉輪聖王千輻金輪種種珍寶莊嚴其輞瑠璃為轂周圓十五里準此未及半由旬亦約小者耳。",
        "translation": "[Commentary] The Daśabhūmika-vibhāṣā says that the wheel of the Wheel-Turning Sage King is adorned with a thousand-spoked gold wheel that's adorned with various treasures, and its rim is made of lapis lazuli and has a circumference of fifteen miles, which is less than half a yojana.",
        "source": "X22n0420_002:0523c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】十下引文示轂車內橫木也書云三十輻共一轂即輻輳之處。",
        "translation": "[Commentary] The ten lower-level quotations show that the hub has a crossbar inside the chariot, and it's written that the thirty spokes share a hub, which is the place where the spokes are positioned.",
        "source": "X22n0420_002:0523c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所以二經不同者慈恩云華有大小彼據極大此約最小。",
        "translation": "[Commentary] The reason the two sutras are different is that Cien said the flower has a large and small size, and he relied on the very large size, and this one is about the smallest.",
        "source": "X22n0420_002:0523c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】推所以中初句標示不同慈下和會彼此慈恩謂觀經十二由旬據大者且欲對簡二經不同然淨土極大非止此數。",
        "translation": "[Commentary] In the first sentence of this reasoning, the words \"different\" and \"great\" are used to describe the twelve yojanas of the Contemplation Sutra and the two scriptures as different.",
        "source": "X22n0420_002:0523c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今準大本池中蓮華或一由旬乃至百千由旬。",
        "translation": "[Commentary] Now, let's refer to the Mahāprajñāpāramitā's lotus in a pond, which can range from one yojana to one hundred thousand yojana.",
        "source": "X22n0420_002:0523c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】復引大本百千由旬驗知不定此云大本乃吳國支謙譯大阿彌陀經兩卷對今小本也。",
        "translation": "[Commentary] Again, he cites the large text of one hundred thousand yojanas to confirm that it's not the same as the large text, which is the Wuguo Zhiqian translation of the two volumes of the Amitâbha Sutra and the present small text.",
        "source": "X22n0420_002:0524a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】則知大小不同經中但是隨宜趣舉。",
        "translation": "[Commentary] Then he knew that the large and small texts were different, but he cited them as appropriate in the sutra.",
        "source": "X22n0420_002:0524a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】則下點示經意。",
        "translation": "[Commentary] The following bullet points show the meaning of the sūtra.",
        "source": "X22n0420_002:0524a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】不必以此較經優劣。",
        "translation": "[Commentary] There's no need to compare the superiority or inferiority of the sūtras in this way.",
        "source": "X22n0420_002:0524a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】不下暗斥古非孤山將二經蓮華大小分定散善遂劣此經而優觀經故也(云云)。",
        "translation": "[Commentary] It's not true that Gushan rebuked Kukku for making the two sūtras lotus-size classifications definitively scatter good, so he inferior to this sūtra and superior to the contemplation sūtra (clouds).",
        "source": "X22n0420_002:0524a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二結示中。",
        "translation": "[Commentary] In the second conclusion, he showed.",
        "source": "X22n0420_002:0524a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗極樂國土成就如是功德莊嚴。",
        "translation": "'Thus has Śāriputra accomplished the adornment of merit in the paradise land.'",
        "source": "X22n0420_002:0524a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如是者指上多種殊妙之相。",
        "translation": "[Commentary] This refers to the above-mentioned variety of marvelous features.",
        "source": "X22n0420_002:0524a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結示中初釋如是指上多種者即前欄網行樹池閣寶蓮等。",
        "translation": "[Commentary] The first explanation in the introduction refers to the many kinds of people on top of this, which are the preceding fences, rows, trees, ponds, mansions, and jeweled lotuses.",
        "source": "X22n0420_002:0524a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】皆是彌陀菩提願行從因至果歷劫熏修之所成就故云功德莊嚴。",
        "translation": "[Commentary] They are all the accomplishments of Amitâbha's enlightening vows and practices that have been perfumed over eons from cause to effect, so they're called the adornment of merit.",
        "source": "X22n0420_002:0524a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】皆下次釋功德莊嚴。",
        "translation": "[Commentary] They're all next explained as the adornment of merit.",
        "source": "X22n0420_002:0524a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】故觀經云如此妙華是本法藏比丘願力所成自餘皆爾豈唯華座乎四十八願結云彼佛於大眾中建此願已一向專志莊嚴妙土等。",
        "translation": "[Commentary] So the contemplation sūtra says that this marvelous flower was made by the vow of the original Dharmâkara monk, and so were all the others, except for the flower throne? The conclusion of the forty-eight vows says that after he made this vow among the masses, the Buddha has always dedicated himself to adorning the marvelous land and so forth.",
        "source": "X22n0420_002:0524a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】觀經但云妙華疏主意欲類通復引大本轉證既云莊嚴妙土何所不該豈唯華座乎。",
        "translation": "[Commentary] The contemplation sūtra simply states that the marvelous land is intended to be shared by all types of people, and then it quotes the main text to confirm that since it says that the marvelous land is adorned, why shouldn't it be anything other than the lotus seat?",
        "source": "X22n0420_002:0524a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】下結諸文並同此釋。",
        "translation": "[Commentary] The following is a summary of the texts and is the same as this explanation.",
        "source": "X22n0420_002:0524a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】下結並同此釋者謂下凡結功德莊嚴皆是彌陀願力所成不復再釋預此點之。",
        "translation": "[Commentary] The following conclusion is the same as this explanation: the following are all the accomplishments of Amitâbha's vows, and there's no need to explain them further in advance of this point.",
        "source": "X22n0420_002:0524a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第二莊嚴二初列相舍利下二結示初中有三一天樂二金地三天華。",
        "translation": "[Commentary] The second adornment is composed of two categories, the first listing the attributes and the second summarizing the three in the middle, the first blissful, the second golden, and the third flower.",
        "source": "X22n0420_002:0524a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初。",
        "translation": "First, there's △.",
        "source": "X22n0420_002:0524a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗彼佛國土常作天樂。",
        "translation": "\"Furthermore, Śāriputra's land is always a source of celestial bliss.",
        "source": "X22n0420_002:0524a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】常作天樂者準觀經作樂有三水觀中云百億華幢無量樂器以為莊嚴八種清風皷此樂器等又樓觀云其樓閣中有無量諸天作天妓樂又有樂器懸處虗空不皷自鳴等。",
        "translation": "It's also said in the contemplation of buildings that there are measureless gods in their mansions making music for celestial courtesans and musical instruments that hang in the sky and don't boom on their own.",
        "source": "X22n0420_002:0524b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】準下經云風吹樹網如百千種樂故知彼土天樂非一。",
        "translation": "[Commentary] It's said in the following sūtra that the wind blows the trees and nets like a hundred thousand kinds of music, so we know that the music of the gods in that land isn't one.",
        "source": "X22n0420_002:0524b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第二莊嚴天樂中欲顯天樂非一故引觀經示相。",
        "translation": "[Commentary] The second section of the Sutra on the Music of the Adorned Heavens wants to show that the music of the gods is not one, so it refers to the contemplation sūtras that show the characteristics.",
        "source": "X22n0420_002:0524b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "黃金為地。",
        "translation": "\"Gold is the ground.",
        "source": "X22n0420_002:0524b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】黃金為地者準觀經彼國皆瑠璃地以黃金繩雜廁間錯兼以七寶界其分齊今言黃金乃地面莊嚴耳。",
        "translation": "[Commentary] Gold is the ground: According to the contemplation sūtras, that country's ground is made of lapis lazuli with a gold rope, a miscellaneous toilet, and a border of seven treasures that are all in alignment.",
        "source": "X22n0420_002:0524b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】金地中彼國純以琉璃為地今言黃金者乃召地面莊嚴非地體也。",
        "translation": "[Commentary] Among the gold grounds, that country's pure lapis lazuli ground is now called gold, which summons the ground to be adorned, not the ground itself.",
        "source": "X22n0420_002:0524b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三天華又三初六時雨華其土下二盛華供養即以下三供已還國。",
        "translation": "[Commentary] There are three more days of flowers, the first six when it rains flowers on the land, and the next two when it's filled with flowers for offerings, which are the following three offerings after they return to the country.",
        "source": "X22n0420_002:0524b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "It's the middle of the third period.",
        "source": "X22n0420_002:0524b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】雨華中雨字去呼字書云自上而下曰雨。",
        "translation": "[Commentary] In the Sanskrit phoneme rain, the word rain is dropped from the list of words and it's called rain when it comes down from above.",
        "source": "X22n0420_002:0524b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晝夜六時而雨曼陀羅華。",
        "translation": "It rains maṇḍala flowers during the six hours of the day and night.",
        "source": "X22n0420_002:0524b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】彼國光明常照既無日月則無晝夜順此方機且言六時。",
        "translation": "[Commentary] That country's light always shines, and since there's no sun or moon, there's no day or night.",
        "source": "X22n0420_002:0524b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】準大本中彼以蓮開鳥鳴為曉蓮合鳥棲為夜。",
        "translation": "[Commentary] According to the Daibun, the lotus opens and the birds sing, and the lotus closes with the birds roosting, and that's night.",
        "source": "X22n0420_002:0524b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】蓮開鳥鳴等者慈恩云華開金沼化生為天曙之情鳥宿瓊林菩薩作時昏之想。",
        "translation": "[Commentary] The lotus opens and the bird crows, and so forth, as Cien says, the lotus opens the golden marsh and is reborn as the dawn of the gods, and the bird stays in the jungle as the bodhisattva's contemplation of time and darkness.",
        "source": "X22n0420_002:0524b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】曼陀羅此翻適意言其美也又翻白華取其色也。",
        "translation": "[Commentary] This translation of maṇḍala means it's beautiful, and this translation of white flower takes its color as well.",
        "source": "X22n0420_002:0524b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二中。",
        "translation": "[Commentary] In two ways.",
        "source": "X22n0420_002:0524b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其土眾生常以清旦各以衣裓盛眾妙華供養他方十萬億佛。",
        "translation": "The sentient beings of that land always make offerings to the ten thousand million buddhas in other directions with a robe full of marvelous flowers on New Year's Day.",
        "source": "X22n0420_002:0524b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】其土眾生通目九品衣裓真諦云外國盛華器也。",
        "translation": "[Commentary] The sentient beings of that land have a common eye for nine kinds of garments, and the true truth is that they're filled with flower vessels from foreign lands.",
        "source": "X22n0420_002:0524c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】供養中衣裓古釋亦云衣襟。",
        "translation": "[Commentary] The ancient explanation for making offerings is also called a sash.",
        "source": "X22n0420_002:0524c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】纔生彼國即獲六通日往他方為聞法故。",
        "translation": "[Commentary] It's because he's just been born in that country and has attained the six supernormal powers to go to other places every day to hear the Dharma.",
        "source": "X22n0420_002:0524c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】觀經云應時即能飛行徧至十方歷事諸佛又遊歷十方供養諸佛於諸佛前聞甚深法等。",
        "translation": "[Commentary] The contemplation sūtra says that at the right time, he can fly around to the ten directions, meet the buddhas, travel to the ten directions, make offerings to the buddhas, and hear the profound Dharma in front of the buddhas.",
        "source": "X22n0420_002:0524c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】即獲通者大本云設我得佛國中人天不得神足於一念頃下至不能超過百千那由他國者不取正覺若據下品下生十二大劫在蓮華中豈能即飛行耶疏云通目九品且約大途為言事佛增福聞法增慧成就二嚴故也。",
        "translation": "[Commentary] That's when one attains supernormal power. The Big Book says, \"Suppose I were to attain supernormal power in a buddha land and humans and gods didn't attain supernormal power in an instant of thought, and I couldn't go down to more than a hundred thousand nayutas without attaining perfect enlightenment.",
        "source": "X22n0420_002:0524c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十萬億者趣舉大數。",
        "translation": "[Commentary] A hundred thousand million is a large number of people who are interested in citing.",
        "source": "X22n0420_002:0524c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三中。",
        "translation": "[Commentary] Among the three.",
        "source": "X22n0420_002:0524c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即以食時還到本國飲食經行。",
        "translation": "That is, when he eats, he returns to his native land to eat, drink, and practice.",
        "source": "X22n0420_002:0524c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】食時謂中前也。",
        "translation": "[Commentary] When he eats, it's the middle and the front.",
        "source": "X22n0420_002:0524c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】食時中初定時節三世諸佛皆中前食不過午故。",
        "translation": "[Commentary] During the time of eating, the buddhas of the three times all eat no more than noon in the middle and before the time of the first concentration.",
        "source": "X22n0420_002:0524c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大本云彼國宮殿衣服飲食猶第六天自然之物若欲食時七寶鉢器自然在前百味飲食自然盈滿雖有此食實無食者但見色聞香意以為食自然飽足事已化去時至復現等。",
        "translation": "[Commentary] The text says that their palaces, clothes, and food are like the natural things of the sixth heaven. If seven-jeweled bowls and containers are naturally present when they want to eat, the hundred flavors of food and drink naturally fill them up, even though there's really no eater, but seeing form and hearing smells and thinking about food naturally fills them up.",
        "source": "X22n0420_002:0524c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】大下明自然第六他化自在天一切受用不假施為從他化現故以為名。",
        "translation": "[Commentary] The next section explains that the sixth naturally self-transforming god is a god who receives all the benefits without relying on charity, so he uses that name for his manifestation from others.",
        "source": "X22n0420_002:0525a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】寄歸傳云五天道俗多作經行直來直去唯遵一路如織之經故曰經行。",
        "translation": "[Commentary] A Record of Regards says that the five celestials and the laity often practice scriptures, coming and going in a straight line like a woven scripture.",
        "source": "X22n0420_002:0525a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】四分律云經行有五益一堪遠行二能思惟三少病四消食五得定久住。",
        "translation": "[Commentary] The Four Part Vinaya says that sūtra practice has five benefits: first, it's able to travel far; second, it's able to contemplate; third, it's less sick; fourth, it eliminates food; and fifth, it attains a long abiding in concentration.",
        "source": "X22n0420_002:0525a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】經行中初引傳示相次引律明益方誌云佛經行石基長五十步高七尺足之所履皆蓮華文又義淨云五天之地道俗多作經行故鷲山覺樹之下鹿苑王城之內及餘聖跡皆有佛經行基闊可二肘長十四五肘高二肘餘累磚作之上以石作蓮華開勢高二寸闊一尺計有十四五表聖足跡也如祇桓寺有經行院是也。",
        "translation": "[Commentary] The first part of the sūtra practice cites the transmission to show the characteristics, and the second part cites the Vinaya's benefits.",
        "source": "X22n0420_002:0525a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗極樂國土成就如是功德莊嚴。",
        "translation": "*Śāriputra's paradise accomplishes such an adornment of merit.",
        "source": "X22n0420_002:0525a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】結示同前。",
        "translation": "[Commentary] The conclusion and explanation are the same as the previous one.",
        "source": "X22n0420_002:0525a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結示中同前有二一者彌陀願行歷劫熏修之所成就故云功德莊嚴乃至引經並同前釋二者皆須結云是故彼國名為極樂也。",
        "translation": "[Commentary] There are two ways to summarize the previous section. One is that the accomplishment of the vows and practices of Maitreya over eons of perfuming and cultivation is called the adornment of merit, and the other is that the sūtras refer to the previous section and explain that the two must be summarized as follows: \"Therefore, that country is called paradise.",
        "source": "X22n0420_002:0525a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第三莊嚴亦二初列相舍利下結示初列相中復有二種初至所作眾鳥演聖法舍利下二風樹出妙音初中又二初正示舍利下釋疑。",
        "translation": "[Commentary] The third adornment also has two kinds of firstly, the list of characteristics and the conclusion under Śāriputra.",
        "source": "X22n0420_002:0525a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△正示有三先列眾禽。",
        "translation": "△There are three correct indications, starting with the listing of the many birds.",
        "source": "X22n0420_002:0525a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次舍利弗彼國常有種種奇妙雜色之鳥白鵠孔雀鸚鵡舍利迦陵頻伽共命之鳥。",
        "translation": "Furthermore, Śāriputra's country is always filled with a variety of wonderfully variegated birds, such as the white bird, peacock, parrot, and Śāriputra's kalaviṅka.",
        "source": "X22n0420_002:0525a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】略舉六種前三易識。",
        "translation": "[Commentary] Six species are briefly mentioned, and the first three are easy to recognize.",
        "source": "X22n0420_002:0525b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第三莊嚴列眾禽中白鶴孤山引相鶴經云體尚潔故其色白聲聞天故其頂赤食於水故其啄長軒於前故後指短捿於陸故足鬲而尾凋翔於雲故毛豐而肉疎大喉以吐故脩頸以納新故生天壽不可量孔雀大好翅鳥聞雷則舞得露則鳴巢萬尋之高食再熟之稻鸚鵡山海經云黃山有鳥如鴞青羽赤啄人舌能言郭璞注云有白色者。",
        "translation": "[Commentary] The third bird in the Zhuangyan list is the white crane, whose color is white, whose voice is heard in the heavens, whose peak is red, whose food is in the water, whose peck is long and high, whose rear finger is short, whose foot is lined, whose tail is withered, whose fly is in the clouds, whose hair is abundant, and whose flesh is loose, whose throat is large in order to spit, whose neck is made to accept new things, whose birth in the heavens is immeasurable, and whose life span is incalculable, whose wings are large, whose dance is when it hears thunder, whose song is when it gets dew, whose nest is high enough to eat rice that's ripe again, and whose parrot is in the Shanhai jing, whose yellow mountains are covered with birds like the owl, whose blue feathers are red, whose peck is human, whose tongue can speak, and whose commentary by Guo Pu says there are white ones.",
        "source": "X22n0420_002:0525b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】舍利此云春鸎或云鶖鷺。",
        "translation": "[Commentary] Śāriputra is a spring chicken or a spring heron.",
        "source": "X22n0420_002:0525b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】迦陵頻伽此翻妙聲在[穀-禾+卵]中鳴已超眾鳥。",
        "translation": "[Commentary] Kaliṅbinga is a wonderful sound that sounds like [grain - grain + egg] in the [grain - grain + egg] and has surpassed all the birds.",
        "source": "X22n0420_002:0525b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】迦陵頻伽翻妙聲即經云迦陵頻伽聲也[穀-禾+卵]苦候反鳥生子須哺曰[穀-禾+卵]自食曰鶵。",
        "translation": "[Commentary] Kaliṅbhiga also refers to the scripture that says Kaliṅbhiga sounds like [grain - grain + egg], a bird that gives birth to a child and must feed is called [grain - grain + egg] and feeds itself is called a chick.",
        "source": "X22n0420_002:0525b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】共命者兩首一身報同識異故法華中翻為命命鳥是也。",
        "translation": "[Commentary] A bird that shares life is one that has two heads and one body with the same retribution and different consciousnesses, so it's called a bird of life.",
        "source": "X22n0420_002:0525b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】勝天王云生生涅槃云耆婆耆婆皆此鳥也。",
        "translation": "[Commentary] The Jetavana, Nirvana, and Jīvaka are all these birds.",
        "source": "X22n0420_002:0525b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】準觀經更有百寶色鳧鴈鴛鴦等。",
        "translation": "[Commentary] *Just like the Avalokitêśvara Sutra, there are also the hundred-jewel colored animals like ducks, rains, and ducks.",
        "source": "X22n0420_002:0525b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】準下指略。",
        "translation": "[Commentary] The quasi-understandings are abbreviated.",
        "source": "X22n0420_002:0525b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】是諸下次明演法。",
        "translation": "[Commentary] These are the next ones that explain the teaching.",
        "source": "X22n0420_002:0525b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾鳥晝夜六時出和雅音其音演暢五根五力七菩提分八正道分如是等法。",
        "translation": "These birds emit harmonious sounds at six times of the day and night, and their sounds convey the five faculties, five powers, seven factors of enlightenment, eight factors of the right path, and so forth.",
        "source": "X22n0420_002:0525b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】和雅謂聲音感人演暢謂說法無滯。",
        "translation": "[Commentary] Harmonious means the sound moves people, and smooth means the teaching of the Dharma isn't stagnant.",
        "source": "X22n0420_002:0525b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】五根者一信二精進三念四定五慧能生聖道故總名根。",
        "translation": "[Commentary] The five faculties are the faculties of faith, effort, mindfulness, concentration, and wisdom that give rise to the noble path.",
        "source": "X22n0420_002:0525b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】即此五法能排業惑故名為力。",
        "translation": "[Commentary] These five things can remove karmic afflictions, so they're called powers.",
        "source": "X22n0420_002:0525b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】演法中根力五法不異但能生曰根排障曰力一信正道助道二行正助道勤求不息三念正助道更無他念四攝心正助相應不散五觀察正明了了分明。",
        "translation": "[Commentary] The five faculties and powers in the explanation of the teaching are not different but are called faculties that produce and powers that remove hindrances.",
        "source": "X22n0420_002:0525b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】七菩提分即七覺支一擇法二精進三喜四除五定六捨七念無學實覺七事能到故名為分。",
        "translation": "[Commentary] The seven factors of enlightenment are the seven factors of awakening-one choosing the Dharma, two making effort, three joy, four removal, five concentration, six equanimity, and seven mindfulness, seven things that can be accomplished by post-learners and true awakening, and therefore they're called factors.",
        "source": "X22n0420_002:0525c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】七覺中一觀諸法時簡別不謬二修道法時一心常在正法中行三得法喜樂心不顛倒四斷除諸見虗偽煩惱五遠離念著永不追憶六發諸禪走不起妄想七定慧均平心不沉沒無學即四果以無漏觀契此七事故曰實覺證真諦理故曰能到。",
        "translation": "[Commentary] Of the seven factors of awakening, one is simply discriminating and not mistaken when observing qualities, two is cultivating qualities with one mind always walking in the right principles, three attains joy and happiness in qualities, and the mind isn't mistaken, four eliminates false views, false afflictions, five is free of mindfulness, never recollects, six arouses meditation, leaves, and doesn't give rise to deluded perceptions, and seven has an even balance of concentration and wisdom, and the mind doesn't sink into nescience.",
        "source": "X22n0420_002:0525c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】八正道分者一正見二正思惟三正語四正業五正命六正精進七正念八正定。",
        "translation": "[Commentary] The eightfold correct path consists of one right view, two right contemplation, three right speech, four right actions, five right livelihood, six right effort, seven right mindfulness, and eight right concentration.",
        "source": "X22n0420_002:0525c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】八正中修無漏觀見諦分明曰正見見四諦時籌量覺知曰思惟遠離四種邪命口業曰正語除身一切邪業曰正業通除三業中五種邪命曰正命勤修涅槃正道曰精進念念常與正助逆法相應曰正念以無漏慧相應入定曰正定。",
        "translation": "[Commentary] Of the eightfold correctness, cultivating uncontaminated contemplation and seeing the noble truths clearly is called right view, and when seeing the four truths, measured awareness is called contemplation, and secluding the four kinds of wrong livelihoods, verbal action is called right speech, and removing all wrong physical actions is called right action.",
        "source": "X22n0420_002:0525c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】前二慧學中三戒學後三定學即是離明三學。",
        "translation": "[Commentary] The first two disciplines of wisdom, the third discipline of precepts, and the last three disciplines of concentration are the three disciplines of free from luminosity.",
        "source": "X22n0420_002:0525c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】前下約義收束三學八正開合異爾。",
        "translation": "[Commentary] The preceding three disciplines are summarized below in terms of their meanings, and the eightfold correctness opens and closes the differences.",
        "source": "X22n0420_002:0526a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初果已去見真諦理皆名正道亦名聖道。",
        "translation": "[Commentary] After the first realization, seeing the true truth and principle is called the right path, and it's also called the noble path.",
        "source": "X22n0420_002:0526a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】初下約人結名。",
        "translation": "[Commentary] The following is a summary of the names of the people in the first place.",
        "source": "X22n0420_002:0526a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】餘如法界次第委明。",
        "translation": "[Commentary] The rest are explained in order according to the Dharma realm.",
        "source": "X22n0420_002:0526a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】准觀經云常讚念佛念法念僧或說苦空無常無我諸波羅蜜故云如是等法。",
        "translation": "[Commentary] According to the sutra of contemplation, they always praise mindfulness of the Buddha, mindfulness of the Dharma, mindfulness of the saṃgha, or they say that suffering, emptiness, impermanence, and selflessness are the pāramitās, so they're called such and such dharmas.",
        "source": "X22n0420_002:0526a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】餘下指廣顯略淨覺云於七科道品則缺前三或云如是等法等前三位不同今疏。",
        "translation": "[Commentary] The rest of the commentary refers to the extensive, clear, and abbreviated Jingjue yun that in the seven categories of the factors of enlightenment, the first three are missing, or it's called thus and so, and the other three are different from the current commentary.",
        "source": "X22n0420_002:0526a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】其土下後顯益物。",
        "translation": "[Commentary] Their land then reveals the beneficial things.",
        "source": "X22n0420_002:0526a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其土眾生聞是音已皆悉念佛念法念僧。",
        "translation": "After hearing this sound, the sentient beings of that land are all mindful of the Buddha, mindful of the Dharma, and mindful of the saṃgha.",
        "source": "X22n0420_002:0526a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】念佛知佛恩重念法知法功深念僧知僧德大。",
        "translation": "[Commentary] Being mindful of the Buddha knows how much kindness he's given, and being mindful of the Dharma knows how much merit the Dharma has.",
        "source": "X22n0420_002:0526a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】顯益中初正明第列三種三寶初即化相六十萬億那由他身佛寶也從因至果為眾生故修菩提道所以恩重佛菩薩等所說法音法寶也隨機設化滅惡生善開示覺藏所以功深聲聞弟子一生補處僧寶也上求下化歷劫修行將臻佛境所以德大此指淨土現在說法一朔施化終皈家滅故屬化相也。",
        "translation": "[Commentary] The first thing that shows the benefits is that there are three kinds of Three Treasures, the first being the transformation aspect, the 60,000,000,000 nayutas body, the buddha treasure, the cause to effect, the cultivation of the bodhi path for the sake of sentient beings, and therefore the beneficence, the Dharma sound, the Dharma treasure, and the teachings of the buddhas and bodhisattvas at random, the transformation that destroys bad beings, the skillful revelation of the store of enlightenment, and therefore the profundity, the lifelong refuge of the śrāvaka disciple, the saṃgha treasure, the upward seeking, the downward transformation, the cultivation through the eons, and the approach to the buddhahood, and therefore the greatness of the virtues.",
        "source": "X22n0420_002:0526a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又念佛願速證誠念法願勤修學念僧願親參預。",
        "translation": "[Commentary] Also, he was mindful of the Buddha's vow to quickly realize his sincerity, mindful of the Dharma's vow to diligently train, and mindful of the saṃgha's vow to personally participate in it.",
        "source": "X22n0420_002:0526a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】二即理體出纏破障究竟修顯契此妙理故曰理體眾生雖具全體在迷今欲起修故證成修學參預。",
        "translation": "[Commentary] The second is the principle's essence, which is to escape the fetters and break through the hindrances to the ultimate cultivation and manifestation of this marvelous principle, so it's called the principle's essence. Although sentient beings have the whole body in delusion, they now want to initiate cultivation, so they realize it and train and participate in its preparation.",
        "source": "X22n0420_002:0526a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又念自心佛體自覺了念自心法軌生聖道念自心僧隨緣和合。",
        "translation": "[Commentary] Also, mindfulness of one's own mind, the Buddha's essence is self-aware, and mindfulness of one's own mind, the Dharma guides the way to birth, the noble path, and mindfulness of one's own mind, the saṃgha, and the combination of conditions.",
        "source": "X22n0420_002:0526a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三即一體於一法界義立三名佛以覺了為義現前一心本具覺體名之為佛法以軌則為義即此覺體能軌凡聖名之為法僧以和合為義即此覺體於一切處和合無二名之為僧即一而三即三而一不離當念皆曰自心然此三種初即外境次即修成三即本具從淺至深因事達理權巧方便無非益物所以文缺住持三寶者蓋由彼土阿彌陀佛現在說法未甞入滅是故不論。",
        "translation": "[Commentary] The three are one in the sense of the single reality realm, which creates three buddhas in the sense of awakening and understanding, which is called the buddha in the sense of the originally existent awakening body of the present single mind, which is called the buddha and the dharma in the sense of the guiding principle, which is the awakening body's ability to guide worldlings and sages, which is called the dharma and the saṃgha in the sense of the convergence, which is the awakening body's ability to converge in all places without duality, which is called the saṃgha, which is one and three, which is three and one, and which is not separate from the mindfulness of what's called self-mind.",
        "source": "X22n0420_002:0526a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三寶多種隨機淺深。",
        "translation": "[Commentary] There are many kinds of the Three Treasures, but they are randomly shallow and deep.",
        "source": "X22n0420_002:0526b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三下結示初二句明對機有異。",
        "translation": "[Commentary] The three lower-level phrases conclude by showing that the first two phrases clarify that there are differences in the way they're presented to the audience.",
        "source": "X22n0420_002:0526b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】當知此界心垢常思五欲彼方心淨專念三寶晨夕所存更無他意兩土昇沈於茲可見。",
        "translation": "[Commentary] You should know that the mind in this realm is defiled by constant contemplation of the five desires, and the mind in the other direction is pure and focused on mindfulness of the Three Treasures, which are present in the morning and evening, with no other intention than that the two lands ascend and descend as seen here.",
        "source": "X22n0420_002:0526b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】當下諸句顯所感不同。",
        "translation": "[Commentary] The following phrases show the differences in what's felt.",
        "source": "X22n0420_002:0526b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次釋疑中二段初至有實遮其疑情是諸下二決所疑事。",
        "translation": "[Commentary] The first two sections in the explanation of doubt arrive at the point where there's a real overcoming of doubtful feelings, and the next two address the matters that are doubted.",
        "source": "X22n0420_002:0526b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中三節先遮疑情。",
        "translation": "The first three sections of the first part begin by refuting the feelings of doubt.",
        "source": "X22n0420_002:0526b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗汝勿謂此鳥實是罪報所生。",
        "translation": "\"Śāriputra, don't say that this bird is really the result of a sin.",
        "source": "X22n0420_002:0526b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】濁世禽畜罪業所招極樂淨土何緣有此。",
        "translation": "[Commentary] What are the causes for the Pure Land of Paradise, which is the result of the sinful actions of defiled animals in the world?",
        "source": "X22n0420_002:0526b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】釋疑中初科初遮疑者點經勿謂兩字也遮止身子勿起此疑。",
        "translation": "[Commentary] The first section of Explaining Doubt begins with the word \"don't say\" in the sūtra, which means \"stopping the body\" and \"preventing the son from having doubts.",
        "source": "X22n0420_002:0526b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所以下次伸意。",
        "translation": "[Commentary] So the next time, he extended his meaning.",
        "source": "X22n0420_002:0526b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何彼佛國土無三惡趣。",
        "translation": "Why is it that there are no three evil destinies in that Buddha's land?",
        "source": "X22n0420_002:0526b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】彼國唯有人天兩道。",
        "translation": "[Commentary] In that country, there are only the two destinies of humans and gods.",
        "source": "X22n0420_002:0526b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】法藏願云設我得佛國有地獄餓鬼畜生者不取正覺。",
        "translation": "[Commentary] The Dharmâkara vows that if I were to attain Buddhahood and there were hells, hungry ghosts, and animals, I wouldn't attain right awakening.",
        "source": "X22n0420_002:0526b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次伸意者申通彼土無實之意經文初句徵起下二句釋此疏文以有顯無引願為證。",
        "translation": "[Commentary] The next one extends the meaning to explain the lack of reality in that land. The first sentence of the sutra symbolizes the arising of the second sentence explains that the commentary uses the existence to reveal the absence of the vow as proof.",
        "source": "X22n0420_002:0526b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】舍利下三舉況。",
        "translation": "[Commentary] Śāriputra then presents three cases.",
        "source": "X22n0420_002:0526c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗其佛國土尚無三惡道之名何況有實。",
        "translation": "Śāriputra's Buddha-lands still don't have the name of the three evil destinies, so why should they have any reality?",
        "source": "X22n0420_002:0526c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大本云彼國無有三塗苦難之名但有自然快樂之音是故其國名曰安樂。",
        "translation": "[Commentary] The main text says that that country doesn't have the name of the three destinies of suffering and distress but only the sound of natural happiness; therefore, its name is Anāthapiṇḍada.",
        "source": "X22n0420_002:0526c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三舉況者以名況實名有召物之功物有應名之實名既叵得實自何有復以大本以證無名。",
        "translation": "[Commentary] These three examples are used to describe the real in terms of names. Names have the merit of calling things into existence, and things have the reality of responding to names.",
        "source": "X22n0420_002:0526c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二決疑中。",
        "translation": "[Commentary] Second, in resolving doubts.",
        "source": "X22n0420_002:0526c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸眾鳥皆是阿彌陀佛欲令法音宣流變化所作。",
        "translation": "\"All these birds are the result of Amitâbha's desire to make the Dharma voice flow and change.",
        "source": "X22n0420_002:0526c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】彌陀變化者準觀經即池水中如意珠王涌出金光其光化為百寶色鳥和鳴哀雅當知眾鳥即是彌陀化身。",
        "translation": "[Commentary] Amitâbha's transformation is measured by the sutra that observes the golden light emerging from the Ruyi pearl king in the pond water, and that light transforms into a hundred jewel-colored birds that sing and wail in harmony and elegance. You should know that the birds are Amitâbha's transformation body.",
        "source": "X22n0420_002:0526c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】決疑中經文初句躡前眾鳥既無名實那有眾鳥此即騰疑也皆下正決經云彌陀變成疏文準此因決觀經以顯珠光化百色鳥莫非彌陀化現。",
        "translation": "[Commentary] In resolving doubts, the first line of the sūtra tiptoes around the fact that the many birds have no names and that there are many birds, which is to rise above doubt.",
        "source": "X22n0420_002:0526c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】欲使法音徧布遠近顯知非是罪報所生也。",
        "translation": "[Commentary] They want to make the sound of the Dharma pervade far and near, so they can clearly see that it's not produced from the retribution of sins.",
        "source": "X22n0420_002:0526c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】欲下出變化意。",
        "translation": "[Commentary] Desire is the next step in conveying the idea of transformation.",
        "source": "X22n0420_002:0526c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二風樹妙音分二初示相。",
        "translation": "[Commentary] The second is the marvelous sound of the wind tree, which is divided into two.",
        "source": "X22n0420_002:0526c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗彼佛國土微風吹動諸寶行樹及寶羅網出微妙音譬如千種樂同時俱作。",
        "translation": "Śāriputra's land is a land where a gentle breeze blows the jeweled rows of trees and jeweled nets, producing subtle sounds like a thousand kinds of music at the same time.",
        "source": "X22n0420_002:0527a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】即前樹網風動成音其音美妙如眾樂焉。",
        "translation": "[Commentary] That's when the wind in the preceding trees and nets creates a sound that's as beautiful as the music of many people.",
        "source": "X22n0420_002:0527a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】聞是下顯益同前。",
        "translation": "[Commentary] Hearing this next shows that the benefits are the same as the previous one.",
        "source": "X22n0420_002:0527a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】風樹妙音示相顯益在文可見。",
        "translation": "[Commentary] The wind and the trees make marvelous sounds, and the manifestation of those sounds benefits can be seen in the text.",
        "source": "X22n0420_002:0527a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是音已皆自然生念佛念法念僧之心。",
        "translation": "After hearing this sound, they all naturally become mindful of the Buddha, mindful of the Dharma, and mindful of the saṃgha.",
        "source": "X22n0420_002:0527a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗其佛國土成就如是功德莊嚴。",
        "translation": "Śāriputra's buddha-lands accomplish such adornment of merit.",
        "source": "X22n0420_002:0527a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】結示可解。",
        "translation": "[Commentary] The conclusion is understandable.",
        "source": "X22n0420_002:0527a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第二明正報中分二初至十劫化主名號舍利下二徒眾莊嚴。",
        "translation": "[Commentary] The second part of the explanation of the proper reward is divided into two: first, the transformation master's name is Śāriputra, and second, the adornment of his followers.",
        "source": "X22n0420_002:0527a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中復二初徵問。",
        "translation": "First, there are two more questions.",
        "source": "X22n0420_002:0527a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】正報總示中復二者即徵問與釋通也並如經文。",
        "translation": "[Commentary] The second two of these general indications of right retribution are the levelling of questions and the explanation of the passage, which is like the sūtras.",
        "source": "X22n0420_002:0527a10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗於汝意云何彼佛何故號阿彌陀。",
        "translation": "\"Śāriputra, what do you think about this Buddha and why is he called Amitâbha?",
        "source": "X22n0420_002:0527a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】汝意云何審其解否。",
        "translation": "[Commentary] What do you think? Will you examine his understanding?",
        "source": "X22n0420_002:0527a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】既無所對故為釋通阿彌陀此翻無量一者光明二者壽命無量是通光壽為別。",
        "translation": "[Commentary] Since there's nothing to oppose, we interpret it as communicating Amitâbha, which is translated as immeasurable, one as light, and the other as immeasurable life.",
        "source": "X22n0420_002:0527a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】阿下總示華梵梵語兼含總該光壽華言兩別光壽乃分。",
        "translation": "[Commentary] *Ahasta generally shows that both the Chinese and Sanskrit languages contain the general idea that light and life are distinct, and the Chinese language has two distinctive aspects of light and life.",
        "source": "X22n0420_002:0527a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初光明無量者。",
        "translation": "[Commentary] First, there's the one whose light is immeasurable.",
        "source": "X22n0420_002:0527a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗彼佛光明無量照十方國無所障礙是故號為阿彌陀。",
        "translation": "Śāriputra's Buddha's light is limitless, and it shines without obstruction in ten lands.",
        "source": "X22n0420_002:0527a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】佛光有二一者常光二者現起光。",
        "translation": "[Commentary] There are two kinds of Buddha's light: the first is constant light, and the second is manifest light.",
        "source": "X22n0420_002:0527a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】別釋光明初科始終一如凡聖皆覩故曰常光隨機隱顯有無不定故曰現起。",
        "translation": "[Commentary] The first section of the special explanation of the Buddha's light is always the same, so it's called constant light, and the second section is called manifesting light because its concealment and manifestation are uncertain.",
        "source": "X22n0420_002:0527a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今此乃是彌陀常光。",
        "translation": "[Commentary] Now, this is the eternal light of Amitâbha.",
        "source": "X22n0420_002:0527a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】文中先定光體。",
        "translation": "[Commentary] The text first defines the body of the light.",
        "source": "X22n0420_002:0527a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大木云無量壽佛威神光明最尊第一諸佛光明所不能及是故號為無量光佛等乃至我說彼佛光明晝夜一劫尚不能盡等又佛觀云身諸毛孔演出光明如須彌山彼佛圓光如百億三千大千世界又云彼佛有八萬四千相一一相有八萬四千好一一好有八萬四千光明遍照十方世界念佛眾生攝取不捨。",
        "translation": "[Commentary] The great wood cloud says that the Buddha of Immeasurable Life's authoritative light is the most honored, the highest, and the brightness of the buddhas is unsurpassed.",
        "source": "X22n0420_002:0527a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次引文證。",
        "translation": "[Commentary] The next quote is from the text to prove it.",
        "source": "X22n0420_002:0527b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】當知我輩處佛光中都不覺知佛光常攝略無厭棄。",
        "translation": "[Commentary] You should know that we're all in the Buddha's light and don't even realize that the Buddha's light is always collected and not discarded.",
        "source": "X22n0420_002:0527b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】猶如盲人居日輪下又如溷蟲樂在穢處。",
        "translation": "[Commentary] They're like a blind person living under the sun, or like a privy worm delighting in a filthy place.",
        "source": "X22n0420_002:0527b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】傷感中初舉二喻一喻盲人不見二喻溷蟲樂著。",
        "translation": "[Commentary] The first of these two metaphors is blindness and the second is a bug's delight in being caught in a filthy place.",
        "source": "X22n0420_002:0527b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】撫膺自責實可悲痛。",
        "translation": "[Commentary] Rubbing his chest and blaming himself is really grievable.",
        "source": "X22n0420_002:0527b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】撫下二句正傷感。",
        "translation": "[Commentary] The next two phrases are really sad and insulting.",
        "source": "X22n0420_002:0527b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二壽命無量又二初明主伴壽量舍利下二示果成劫數。",
        "translation": "First, he explains the lifespan of the chief companion, and second, he shows the number of eons since the fruit of the Buddha's death.",
        "source": "X22n0420_002:0527b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Beginning with the first.",
        "source": "X22n0420_002:0527b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗彼佛壽命及其人民無量無邊阿僧祇劫故名阿彌陀。",
        "translation": "\"Śāriputra's name is Amitâbha because the Buddha's life span and that of his people are measureless and unlimited through incalculably long eons.",
        "source": "X22n0420_002:0527b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】佛壽有二法報二佛一向無量應佛皆具長短二量。",
        "translation": "[Commentary] There are two kinds of life spans of buddhas, the Dharma-reward two buddhas and the immeasurable response buddha, and they all have two measures of length and shortevity.",
        "source": "X22n0420_002:0527b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】壽命中初科言法報無量者法佛壽量非報得命根連持強指不遷不變為壽非長非短無延無促強指法界虗空為量報佛壽量以如如智照如如境境智相冥是故壽量與法身等應佛應同萬物為身連持為壽長短為量釋迦八十唱滅即應短量有量之有量也彌陀即應長量實有期限人天莫數即有量之無量也逐物隨緣皆有二量。",
        "translation": "【記】壽命中初科言法報無量者法佛壽量非報得命根連持強指不遷不變為壽非長非短無延無促強指法界虗空為量報佛壽量以如如智照如如境境智相冥是故壽量與法身等應佛應同萬物為身連持為壽長短為量釋迦八十唱滅即應短量有量之有量也彌陀即應長量實有期限人天莫數即有量之無量也逐物隨緣皆有二量。",
        "source": "X22n0420_002:0527b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今此淨土彌陀應身示其長量。",
        "translation": "[Commentary] Now, this is the Pure Land, and Maitreya's response body shows its long measure.",
        "source": "X22n0420_002:0527c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】今下判定。",
        "translation": "[Commentary] Now, it's time to decide.",
        "source": "X22n0420_002:0527c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大本云彼佛壽命長久不可稱計假使十方無量眾生皆成聲聞緣覺都共集會竭其智力百千萬劫悉共推算計不能窮盡。",
        "translation": "[Commentary] The main text says that the Buddha's life span is long and incalculable. Suppose measureless sentient beings in the ten directions all become śrāvakas and pratyekbuddhas and all assemble together and exhaust their powers for a hundred thousand million eons, all of which can't be exhausted by common reckoning.",
        "source": "X22n0420_002:0527c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】大下引釋初釋化主。",
        "translation": "[Commentary] The following is a summary of the initial explanation of the transformation master.",
        "source": "X22n0420_002:0527c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又云聲聞菩薩天人之眾壽命長短亦復如是故云及人民也。",
        "translation": "[Commentary] It also says that the lifespans of the śrāvakas, bodhisattvas, gods, and humans are likewise long and short, so it's called \"and the people.",
        "source": "X22n0420_002:0527c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次釋人民。",
        "translation": "[Commentary] Next, we'll explain about the people.",
        "source": "X22n0420_002:0527c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】阿僧祇此云無數或云阿僧祇耶翻無央數。",
        "translation": "Commentary: incalculable is the word for incalculable, or incalculable is the word translated as incalculable.",
        "source": "X22n0420_002:0527c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二示劫數。",
        "translation": "[Commentary] Second, it shows the number of eons.",
        "source": "X22n0420_002:0527c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗阿彌陀佛成佛以來於今十劫。",
        "translation": "It's been ten eons since Amitâbha became buddha, Śāriputra.",
        "source": "X22n0420_002:0527c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】言十劫者。",
        "translation": "[Commentary] That's ten eons.",
        "source": "X22n0420_002:0527c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】劫數中初依經標起。",
        "translation": "[Commentary] The first of those eons is marked by the sūtras.",
        "source": "X22n0420_002:0527c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】準法華大通智勝佛時彌陀乃是十六王子之一數釋迦既經塵劫彌陀豈得不然。",
        "translation": "[Commentary] When Amitâbha was one of the sixteen princes according to the Lotus Sutra of Great Access and Wisdom, how could Amitâbha not have gone through a dusty eon?",
        "source": "X22n0420_002:0527c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】準下會同塵劫。",
        "translation": "[Commentary] The paramount would be the same as a dusty eon.",
        "source": "X22n0420_002:0527c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】楞嚴勢至章云我於往昔恒河沙劫有佛出世名無量光十二如來相繼一劫準大本中即阿彌陀也。",
        "translation": "[Commentary] The chapter on Śīlâditya says, \"In the past, there was a Buddha who appeared in the world, who was called the twelve tathāgatas of infinite light and who continued for one eon, which in the standard text was Amitâbha.",
        "source": "X22n0420_002:0527c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】楞下會同名號二經既言塵點恒沙何故今經止云十劫。",
        "translation": "[Commentary] Since the two sutras say the number of dust particles is constant sands, why does the present sūtra stop at ten eons?",
        "source": "X22n0420_002:0527c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今經大本皆言十劫乃是一期赴機之說不足疑矣。",
        "translation": "[Commentary] The present sūtra and the main text both say ten eons, so there's not enough doubt that this is the first period to go to the opportune one.",
        "source": "X22n0420_002:0528a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】今下酌意決疑今疏據經化主名號徵問釋通唯約光壽孤山乃立四義一光明二壽命三大小弟子四者補處等淨覺斥云今取前二不取後二以經中唯光明壽命之下結云故名阿彌陀後二但說聖眾莊嚴化主之事況新譯云其土世尊名無量壽及無量光乃至徵釋二名非不顯了與今疏同。",
        "translation": "The new translation says that the world-honored one's land is called Immeasurable Life and Immeasurable Light, and even the two names in the explanation are not unclear, as in the current commentary.",
        "source": "X22n0420_002:0528a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二徒眾莊嚴分二初至祗劫說正示聖眾舍利下二結勸往生初中又二初至莊嚴通列兩眾又舍利下別顯行功初中又二初正列舍利下結示。",
        "translation": "[Commentary] The two categories of the adornment of the disciples are the first two, the first arriving at the eon and speaking of the direct revelation of the noble multitude, and the second concluding with an exhortation to rebirth in the middle section.",
        "source": "X22n0420_002:0528a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Middle level.",
        "source": "X22n0420_002:0528a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗彼佛有無量無邊聲聞弟子皆阿羅漢非是算數之所能知諸菩薩眾亦復如是。",
        "translation": "\"Śāriputra, the Buddha has measureless and limitless disciples who are arhats, not knowable by calculation, and so do all the bodhisattvas.",
        "source": "X22n0420_002:0528a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】聲聞弟子即中三品諸菩薩眾即上三品總攝。",
        "translation": "[Commentary] The disciples of śrāvakas are the middle three classes, and the bodhisattva congregations are the upper three classes taken together.",
        "source": "X22n0420_002:0528a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初心不退補處(眾總三乘獨無緣覺應以斷證同聲聞攝)。",
        "translation": "They are the first three classes, the middle three classes, and the bodhisattva congregations, the upper three classes, which are collected together with the śrāvakas.",
        "source": "X22n0420_002:0528a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】故大本云彼國聲聞菩薩其數難量不可稱說神智洞達威力自在等。",
        "translation": "[Commentary] Therefore, the main text says that the number of śrāvaka bodhisattvas in that country is incalculable, and their spiritual wisdom, insight, and authority are unimpeded.",
        "source": "X22n0420_002:0528a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】故下引證徒眾正列中初正釋疏據經列故約中上二品收之所以不列下三品者或是經家趣舉又恐釋壽命中已有人民之語故此略之孤山則云今列二眾是其輔佐人爾。",
        "translation": "[Commentary] Therefore, the following quote certifies that the disciples are correctly listed in the first, correct, and explanatory commentary according to the sūtras, so the reason they're not listed in the lower three categories is either because the sūtras are interested in citing them or because they're afraid the explanation of the people's lives is omitted from Gushan's statement that the two groups of people listed here are their assistants.",
        "source": "X22n0420_002:0528a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】往生論說二乘不生蓋是定性取涅槃者今此謂曾發大心求佛菩提示修小行法華獲記真聲聞涅槃知常出家菩薩之類也。",
        "translation": "[Commentary] The Treatise on Rebirth in the Past says that the two vehicles aren't born, but this is the type of person who qualitatively takes nirvāṇa and now refers to a bodhisattva who once had the great intention to seek Buddha's enlightenment and showed that he cultivated minor practices and obtained the knowledge of the true śrāvaka's nirvāṇa and left home permanently.",
        "source": "X22n0420_002:0528a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】往下決疑言聲聞者聞四諦聲教而悟道故真聲聞者如舍利弗等皆受應身之記不捨聲聞之形乃體轉名不轉也涅槃知常者涅槃座中捃拾殘機三乘俱會初後皆知常住佛性外儀雖則削髮染衣內心已修菩薩大行淨土聲聞乃此流類。",
        "translation": "[Notes] Going forward, the next section addresses the doubt that śrāvakas hear the sound teaching of the four truths and awaken to the path. True śrāvakas like Śāriputra and others are all given the record of response body and don't abandon the form of śrāvakas so that their bodies change and are called not changing.",
        "source": "X22n0420_002:0528b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次結示中。",
        "translation": "[Commentary] In the next section, he concluded by saying.",
        "source": "X22n0420_002:0528b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗彼佛國土成就如是功德莊嚴。",
        "translation": "\"Śāriputra's buddha-lands have accomplished this kind of adornment of merit.",
        "source": "X22n0420_002:0528b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此亦彌陀所化來生彼國修因證果威神說法為國莊嚴義同前釋。",
        "translation": "[Commentary] This is also the transformation of Amitâbha who's come to live in that country, cultivating causes and realizing fruits, and whose authoritative power speaks the Dharma and adorns the country with the same meaning as the previous explanation.",
        "source": "X22n0420_002:0528b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結示中菩薩聲聞人民等眾皆是彌陀因地教化結緣成熟至成佛時來生其國而為莊嚴。",
        "translation": "[Commentary] In the conclusion, the bodhisattvas, śrāvakas, people, and other people are all created by Maitreya and matured in terms of causes and conditions until they become buddhas and are born in that country and adorn it.",
        "source": "X22n0420_002:0528b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二別顯中。",
        "translation": "[Commentary] In the second, it's separately expressed.",
        "source": "X22n0420_002:0528b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】不退中初句標起。",
        "translation": "[Commentary] The first phrase in Nonretrogression indicates the beginning.",
        "source": "X22n0420_002:0528b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗極樂國土眾生生者皆是阿毗跋致其中多有一生補處其數甚多非是算數所能知之但可以無量無邊阿僧祗劫說。",
        "translation": "Also, Śāriputra, the sentient beings in the paradise land of paradise are all abhivartizans, and there are many places where their lives are supplemented that are too numerous to be counted but can be explained in terms of incalculable and limitless incalculable eons.",
        "source": "X22n0420_002:0528b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】眾生生者通九品收。",
        "translation": "[Commentary] \"The births of sentient beings are collected through nine classes.",
        "source": "X22n0420_002:0528b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次二句點經。",
        "translation": "[Commentary] The next two sentences punctuate the sutra.",
        "source": "X22n0420_002:0528b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】阿鞞跋致此云不退轉下云是諸人等皆得不退阿耨菩提。",
        "translation": "[Commentary] *Abhidharma is called nonretrogression, and below that, it's said that all people attain irretrogression and perfect enlightenment.",
        "source": "X22n0420_002:0528b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】阿下翻名不退有三如前已示。",
        "translation": "[Commentary] There are three ways to translate the name nonretrogression under abhidharma as was already shown.",
        "source": "X22n0420_002:0528b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】則知生彼國者下至凡夫直至成佛更無退墮。",
        "translation": "[Commentary] Then he knows that those who are born in that country will never fall back, from the level of mortals down to the attainment of Buddhahood.",
        "source": "X22n0420_002:0528b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】則下結顯不退之名攝位最長下至凡夫則指初生近果直至成佛始自初住終至妙覺但取到彼無流轉三界受生畢竟成佛皆名不退是故疏云通收九品迭論淺深不無優劣。",
        "translation": "[Commentary] The following section shows that the name nonretrogression collects the longest stages, down to worldling, from first birth and near fruition up to becoming a buddha, from the first abode up to marvelous awakening, but when it comes to arriving there, there's no transmigration through the three realms, and birth in the final buddhahood is called nonretrogression.",
        "source": "X22n0420_002:0528b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十疑論云彼國有五因緣故不退一彌陀願力攝持二佛光常照三水鳥樹林常說法四純諸菩薩為友無諸惡緣五壽命永劫餘廣如彼。",
        "translation": "[Commentary] The Treatise on Ten Doubts says that there are five reasons for not regressing in that country: first, Maitreya's vow to maintain him, second, the Buddha's light always shines, third, the water, birds, and trees always teach the Dharma, fourth, pure bodhisattvas are friends, and there are no bad causes, fifth, a lifespan of an eternity, and the rest is as vast as the other.",
        "source": "X22n0420_002:0528c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】十下引緣如彼見第六疑。",
        "translation": "[Commentary] Ten lower-level references are like the sixth doubt in that view.",
        "source": "X22n0420_002:0528c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一生補處即等覺菩薩。",
        "translation": "[Commentary] A lifetime in the patchwork is a bodhisattva who's equally enlightened.",
        "source": "X22n0420_002:0528c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】補處中等覺尚有一品無明未破故曰一生此品無明微細難斷唯是等覺後心以金剛智方能斷之即補妙覺之處也。",
        "translation": "[Note] The middle level of enlightenment in the patchwork place still has one level of ignorance that hasn't been broken, so it's called a lifetime in which this level of ignorance is subtle and difficult to cut except in the mind of the late-bodhisattva who can cut it with adamantine wisdom, which is the patchwork place of marvelous enlightenment.",
        "source": "X22n0420_002:0528c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如觀音勢至等。",
        "translation": "[Commentary] Suppose Avalokitêśvara arrives and so forth.",
        "source": "X22n0420_002:0528c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】如下引類。",
        "translation": "[Commentary] These are the categories cited below.",
        "source": "X22n0420_002:0528c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】眾類既多非算所及止可但言阿僧祗耳。",
        "translation": "[Commentary] Since there are so many different kinds of people, it's beyond calculation to stop at just saying asaṅgata.",
        "source": "X22n0420_002:0528c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】眾下點經。",
        "translation": "[Commentary] They're all listed below in the sūtra.",
        "source": "X22n0420_002:0528c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】問得忍補處祗合垂形五道入三塗處救苦眾生何以長居淨土。",
        "translation": "[Commentary] He asked how he could live in the Pure Land for so long after attaining the remedy of forbearance, only after he had been reborn in the five destinies and entered the three destinies to save suffering sentient beings.",
        "source": "X22n0420_002:0528c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】問答中初約菩薩利他為問。",
        "translation": "[Commentary] The first of these questions and answers concerns the bodhisattvas' benefit to others.",
        "source": "X22n0420_002:0528c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】答隨其志願攝化有殊。",
        "translation": "[Commentary] The answer differs according to their aspirations for collecting and transforming others.",
        "source": "X22n0420_002:0528c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次約志願不同以答孤山疏云菩薩法應度眾生何以但求樂國答大論四十三自有此問龍樹答云菩薩有二種一者慈悲多為眾生二者多集諸佛功德樂多集功德者至一乘清淨無量壽國好多為眾生者至無佛法僧處贊歎三寶等疏躡論意以決世疑初二句總答。",
        "translation": "[Commentary] Second, he answers the Gushan commentary, \"Why does the bodhisattva seek only to bring joy to sentient beings when his teaching should be to save sentient beings?\" The Mahāprajñāpāramitā-śāstra's forty-three answers this question, saying that there are two kinds of bodhisattvas: those who are compassionate and devoted to sentient beings and those who gather much merit from the buddhas and those who gather much merit to the One Vehicle, the Pure Land of Immeasurable Life, and those who gather much merit to the absence of the Buddha, Dharma, and Saṃgha and praise the Three Treasures.",
        "source": "X22n0420_002:0528c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】或遊戲十方或往來三界宣揚法化利樂群生。",
        "translation": "[Commentary] Either they play in the ten directions or they travel to the three realms to proclaim the teaching of the Dharma and to bring benefit and joy to sentient beings.",
        "source": "X22n0420_002:0529a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】或下別示。",
        "translation": "[Commentary] Or it might be shown separately below.",
        "source": "X22n0420_002:0529a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】準大本云十方恒沙佛國無量菩薩悉生彼國恭敬供養聽受經法宣布道化又云於此世界有六十七億不退菩薩往生彼國又復授記十方菩薩皆當往生廣如下卷。",
        "translation": "[Commentary] According to the standard text, measureless bodhisattvas from the buddha lands of the ten directions are all born in those countries, respectfully make offerings, listen to the sūtras and teachings, and proclaim the transformation of the way.",
        "source": "X22n0420_002:0529a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】準下別顯。",
        "translation": "[Commentary] It's revealed separately below the level of accuracy.",
        "source": "X22n0420_002:0529a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二結勸中初正勸。",
        "translation": "[Commentary] The first of the two concluding exhortations was a direct exhortation.",
        "source": "X22n0420_002:0529a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗眾生聞者應當發願願生彼國。",
        "translation": "\"Śāriputra, sentient beings who hear this should make the vow to be born in that country.",
        "source": "X22n0420_002:0529a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】眾生聞者通指末代聞上所說。",
        "translation": "[Commentary] \"Hearers of sentient beings generally refer to those who heard the above teaching in the latter age.",
        "source": "X22n0420_002:0529a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】勸令發願願必引行行必感果。",
        "translation": "[Commentary] The exhortation is to cause the vow to be made, and the practice will lead to the result of the practice.",
        "source": "X22n0420_002:0529a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結勸中菩薩修行以願為本若無願力萬行徒施所以經中勸令發願。",
        "translation": "[Commentary] In the concluding exhortation, a bodhisattva's cultivation is rooted in vows. Without the power of vowing, all practices are in vain; therefore, the sūtra exhorts him to give rise to the vow.",
        "source": "X22n0420_002:0529a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所以下伸意。",
        "translation": "[Commentary] So, let's expand on the idea.",
        "source": "X22n0420_002:0529a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何得與如是諸上善人俱會一處。",
        "translation": "\"Why is it possible to be in the same place as such excellent people?",
        "source": "X22n0420_002:0529a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如是者指前所列三乘聖眾皆是善人。",
        "translation": "[Commentary] Such are the sages of the three vehicles listed earlier who are good people.",
        "source": "X22n0420_002:0529a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】伸意可解。",
        "translation": "[Commentary] This is an extension of the meaning that can be understood.",
        "source": "X22n0420_002:0529a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】欲明此界三惡充滿皆不善聚是可厭耳。",
        "translation": "[Commentary] They want to show that the three evils in this realm are filled with unwholesome clusters that can be gotten rid of.",
        "source": "X22n0420_002:0529a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】欲下反顯。",
        "translation": "[Commentary] The opposite of desire is clear.",
        "source": "X22n0420_002:0529a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說阿彌陀經義疏聞持記卷中",
        "translation": "Foshuo amitâbha jing yishu wenchi ji roll zhong",
        "source": "X22n0420_002:0529a21_0",
        "is_bad_quality": false
    }
]