[
    {
        "source_sentence": "佛說阿彌陀經義疏聞持記卷下",
        "translation": "Foshuo amitâbha jing yishu wenchi ji vol. 2",
        "source": "X22n0420_003:0529b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第二正示行法分三段初至彼國簡餘善不生若有下二正示修法我見下三結顯勸意。",
        "translation": "[Commentary] The second section correctly shows the practice of the Dharma in three parts. First, he goes to his country and explains how the rest of the goodness doesn't arise, and if there's any, the next two correctly show the cultivation of the Dharma, and the next three conclude with an exhortation.",
        "source": "X22n0420_003:0529b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "First, there's the first part.",
        "source": "X22n0420_003:0529b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗不可以少善根福德因緣得生彼國。",
        "translation": "Śāriputra couldn't have been born in that country with few good roots and meritorious causes and conditions.",
        "source": "X22n0420_003:0529b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如來欲明持名功勝先貶餘善為少善根。",
        "translation": "[Commentary] The Tathāgata wanted to explain the merits of holding onto the name and first relegate the remaining goodness to being little good roots.",
        "source": "X22n0420_003:0529b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】行法揀餘善正釋中初立義。",
        "translation": "[Commentary] The practice of selecting other good qualities correctly explains the initial position in the explanation.",
        "source": "X22n0420_003:0529b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所謂布施持戒立寺造像禮誦坐禪懺念苦行一切福業。",
        "translation": "[Commentary] It's called generosity, maintaining precepts, erecting temples, building statues, worshiping, chanting, sitting, meditating, repentance, and asceticism, all good actions.",
        "source": "X22n0420_003:0529b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】所下正揀。",
        "translation": "[Commentary] What's below is correctly selected.",
        "source": "X22n0420_003:0529b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若無正信迴向願求皆為少善非往生因。",
        "translation": "[Commentary] If there's no correct faith, dedication, vow, and pursuit, they're all little good and not causes for rebirth in the Pure Land.",
        "source": "X22n0420_003:0529b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】若無下揀非施戒等行皆可莊嚴但無信願為今所揀。",
        "translation": "[Commentary] If there's no inferior selection, then all practices like generosity and morality can be adorned, but the absence of faith and vowing is the selection for now.",
        "source": "X22n0420_003:0529b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若依此經執持名號決定往生即知稱名是多善根多福德也。",
        "translation": "[Commentary] If we rely on this sūtra and hold to the name, we're certain to be reborn, which means we know that calling on the name is blessed with many good roots and many merits.",
        "source": "X22n0420_003:0529b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】若依下顯是既能執持信向願求無不具足故稱多善。",
        "translation": "[Commentary] If we rely on the following, it shows that since we can uphold faith, dedicate ourselves to vowing for rebirth, there's nothing we don't have, so we're called having many good roots.",
        "source": "X22n0420_003:0529b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】昔作此解人尚遲疑。",
        "translation": "[Commentary] In the past, people who made this interpretation were still hesitant.",
        "source": "X22n0420_003:0529b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】引據中初二句敘昔人疑。",
        "translation": "[Commentary] The first two sentences of this citation describe the doubts of people in the past.",
        "source": "X22n0420_003:0529b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】近得襄陽石碑經本文理冥符始懷深信。",
        "translation": "[Commentary] Recently, he got the Xiangyang Shibei jing ben wenli fenbie jing and began to harbor deep faith.",
        "source": "X22n0420_003:0529b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】近下四句敘後生信。",
        "translation": "[Commentary] The next four sentences recently described the faith that arose later.",
        "source": "X22n0420_003:0529b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】彼云善男子善女人聞說阿彌陀佛一心不亂專持名號以稱名故諸罪消滅即是多功德多善根多福德因緣。",
        "translation": "[Commentary] He said that good sons and good women who hear and teach Amitâbha Buddha are unified in mind and aren't distracted by holding to the name because it's called by that name that their sins are extinguished, which is the cause and condition of many merits and many good roots and many virtues.",
        "source": "X22n0420_003:0529b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】彼云下正引文據。",
        "translation": "[Commentary] He said, \"The following is the textual basis for the quotation.",
        "source": "X22n0420_003:0529b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】彼石經本梁陳人書至今六百餘載竊疑今本相傳訛脫。",
        "translation": "[Commentary] This stone sūtra was originally written by the Liang and Chen people more than six hundred years ago, and it's doubtful that the present version has been passed down as being erroneous.",
        "source": "X22n0420_003:0529b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】彼石下較經得失梁陳乃南朝兩國之名朝散郎陳仁稜書碑在襄州龍興寺本朝殿撰李公諱友聞字季益甞守官於彼持此經皈錢唐疏主得之喜不自勝遂復刊石立于靈芝大殿之後續因兵火焚毀悲夫逆推梁陳去晉未遠可驗得真今本既經六百餘載中間傳寫訛脫可知。",
        "translation": "[Commentary] Beneath that stone, we'll compare the sūtra's success or failure with that of the Liang and Chen, two of the Southern Dynasties, whose names were given to the court administrator Chen Renliang, who wrote the stele at Longxing Temple in Xiangzhou, where the court administrator Li Gong, who was a member of the memorial board, and Li Youwen, whose name was Jiyi, used to hold this sūtra and convert it to the Qian and Tang administrators, who were overjoyed and then published the stone and erected it after the great hall at Lingzhi.",
        "source": "X22n0420_003:0529b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二中分三初至不亂專念持名其人下二臨終感聖是人下三正念往生。",
        "translation": "[Commentary] There are three parts to the second part. First, there's the person who's unconfused, focused on mindfulness, and second, there's the person who's overcome the sage at the end of his life, and third, there's the correct mindfulness of rebirth.",
        "source": "X22n0420_003:0529c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Beginning with the first.",
        "source": "X22n0420_003:0529c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗若善男子善女人聞說阿彌陀佛執持名號若一日若二日若三日若四日若五日若六日若七日一心不亂。",
        "translation": "\"Śāriputra, if good sons and good women hear and teach Amitâbha Buddha and retain his name for one, two, three, four, five, six, or seven days, they're unconfused in their minds.",
        "source": "X22n0420_003:0529c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初二句索持機不簡男女。",
        "translation": "[Commentary] The first two phrases seek to uphold the [Buddha's] name without simplifying it for men and women.",
        "source": "X22n0420_003:0529c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】修法持名中初科經云若有等者若乃不定之詞經屬化教開導信解或違或順任彼機緣不同制教必須遵行順則無過違則結犯所以疏科若有男女謂之索機。",
        "translation": "[Commentary] The first section of Cultivating the Dharma by Holding the Name says, \"If there are such things,\" which is an indeterminate term, the sūtras are part of the teaching of transformation, guiding faith and understanding, either contrary or compliant, depending on the opportunity and conditions, and the rules and teachings must be followed, and if they are compliant, there's nothing wrong with them, and if they are contrary, then they form a violation.",
        "source": "X22n0420_003:0529c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次二句勸信受或披經典或遇知識聞必生信信故持名。",
        "translation": "[Commentary] The next two phrases encourage faith, whether it's clasped in a scripture or encountered by a friend who hears it, faith will arise, and so will hold to the name.",
        "source": "X22n0420_003:0529c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】經云聞說執持等者良由一切眾生誰無一毫善種但以宿業障深不能開發是故疏推披教典遇知識以為信受之緣聞即聞慧信則思慧持即修慧從聞思修往生決矣。",
        "translation": "[Commentary] The sūtras say that those who hear, preach, retain, and so forth are fortunate because all sentient beings lack even a tiny bit of good seed but are unable to develop it because of the depth of their past karmic hindrances.",
        "source": "X22n0420_003:0529c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次七句示期限一日七日隨人要約今經制法理必依承若準大本觀經則無日限下至十念皆得往生十念即十聲也。",
        "translation": "[Commentary] The next seven sentences show the duration of a day and seven days, depending on the person's needs.",
        "source": "X22n0420_003:0530a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】今經期限雖至七日亦非定制故皆云若但取成功為要然此制法不延不促疏勸依承大本觀經既無日限下至十念攝機雖寬猶恐下根不成行業後句義見次科。",
        "translation": "[Commentary] Although the duration of this sutra is up to seven days, it's not customary, so it's said that if we just take success as the key, then this system of Dharma doesn't delay or hasten, and the commentary encourages relying on the inheritance of the Daben guan jing, since there's no daily limit down to ten nirvāṇas, even though it's wide enough to gather the capacity, it's still afraid that the lower faculties won't become active.",
        "source": "X22n0420_003:0530a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】後一句教繫想。",
        "translation": "[Commentary] The latter phrase teaches bonding conceptions.",
        "source": "X22n0420_003:0530a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】正明淨業中初句指經文。",
        "translation": "[Commentary] The first phrase of this sutra correctly explains pure activities refers to the text of the sutra.",
        "source": "X22n0420_003:0530a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此一句經正明成業。",
        "translation": "[Commentary] This phrase of the sūtra correctly explains the formation of karma.",
        "source": "X22n0420_003:0530a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次句點經意。",
        "translation": "[Commentary] The next phrase points to the meaning of the sūtras.",
        "source": "X22n0420_003:0530a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】先須斂念面向西方合掌正身。",
        "translation": "[Commentary] First, he must arouse his mind to face west with his palms together and correctly position himself.",
        "source": "X22n0420_003:0530a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】先下教方法初三句示修儀。",
        "translation": "[Commentary] The first three sentences first teach the method and then show the cultivation ritual.",
        "source": "X22n0420_003:0530a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】遙想彼佛現坐道場依正莊嚴光明相好。",
        "translation": "[Commentary] Distantly, he imagines that the Buddha is sitting in the site of enlightenment in an ornate and radiant manner.",
        "source": "X22n0420_003:0530a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】遙下想勝境。",
        "translation": "[Commentary] He remotely envisions the Buddha's excellent appearance from below.",
        "source": "X22n0420_003:0530a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】自慨此身久沈苦海漂流生死孤露無依。",
        "translation": "[Commentary] He laments that this body has long been submerged in an ocean of suffering, adrift in birth and death, and alone and without support.",
        "source": "X22n0420_003:0530a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】自下令慨責。",
        "translation": "[Commentary] He remorsefully orders himself to do so.",
        "source": "X22n0420_003:0530a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】譬如嬰兒墮在坑穽叫呼父母急救危忙。",
        "translation": "[Commentary] It's like a baby who falls into a pit or a hoven, calling out to its parents for help in a crisis.",
        "source": "X22n0420_003:0530a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】譬下舉事顯。",
        "translation": "[Commentary] The next example shows the situation.",
        "source": "X22n0420_003:0530a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一志依投懇求解免聲聲相續念念不移。",
        "translation": "[Commentary] One intention is to rely on the earnest pursuit of liberation, and sound after sound is continuous and mindful.",
        "source": "X22n0420_003:0530a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】一下勸用心聲即口業念即心業心口相應功不虗喪故曰相續不移。",
        "translation": "[Commentary] The first exhortation is that sound is verbal action, mindfulness is mental action, and mind and mouth are aligned in a way that's not lost.",
        "source": "X22n0420_003:0530a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】雖復理事行殊定散機異皆成淨業盡得往生。",
        "translation": "[Commentary] Even though the principle and the practice are different, the concentration is distracted, and the abilities are different, they all accomplish pure activities and are reborn at the end.",
        "source": "X22n0420_003:0530a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】雖下結成業。",
        "translation": "[Commentary] Even though it's below the level of formed karma.",
        "source": "X22n0420_003:0530a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】不然則無記妄緣定成虗福耳。",
        "translation": "[Commentary] Otherwise, indeterminate deluded conditions will definitely lead to incomplete merit.",
        "source": "X22n0420_003:0530a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】不下顯無功孤山判此經屬散善霅川據此句經別立四科廣破略云今經一心不亂新譯經云繫念不亂如說修行等云何散善而解此文且觀音經云聞觀世音菩薩一心稱名皆得解脫疏曰聞即聞慧心無所依即思慧一心稱名即修慧此文雖窄三慧意顯又曰稱名有二一事二理若用心存想相續不間如請觀音繫念數息等名事一心若達此心四性不生無心無念與空慧相應等是理一心況彼無不亂二字智者尚作空慧相應釋之今經顯云一心不亂何苦貶為散善乃至若但事無理則抑大士三昧之心若唯理缺事則絕初心念佛之行云云霅川之說其義頗優雅合今疏故略錄之。",
        "translation": "[Commentary] Even though it doesn't show that there's no merit, Gushan judged that this sūtra belongs to the category of distracting goodness, Zhachuan based this sentence on four separate sections of the sūtra to extensively refute the abbreviated statement that the present sūtra is one mind unconfused, and the new translation of the sūtra shows that fixation and mindfulness are not confused as explained in the practice of cultivation, etc. How is distracting goodness explained in this text and the Avalokitêśvara sūtra shows that hearing is the wisdom of hearing, the mind has no basis, which is the wisdom of thinking, and the name of the one mind is the wisdom of cultivating, even though this text is narrower than the three wisdoms.",
        "source": "X22n0420_003:0530a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】善導問曰何故不令作觀直遣專稱名號有何意耶。",
        "translation": "[Commentary] Shandao asked, \"Why don't you make them contemplate and just send them away to exclusively call on the name of the Buddha?",
        "source": "X22n0420_003:0530b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】答曰乃由眾生障重境細心麤識颺神飛觀難成就是以大聖悲憐直勸專稱名號正由稱名易故相續即生。",
        "translation": "[Commentary] He answered, \"It's because sentient beings have heavy hindrances, small objects, small minds, and coarse consciousnesses that make it difficult for them to contemplate flying spirits.",
        "source": "X22n0420_003:0530b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又云彌陀世尊本發深重誓願以光明名號攝化十方但使信心求念上盡一形下至十聲一聲等以佛願力易得往生。",
        "translation": "[Commentary] It also says that Bhagavān Amitâbha originally made a profound vow to gather people in ten directions with the bright name of the Buddha, but so that faith and mindfulness can easily attain rebirth by the power of the Buddha's vow, from the top of one form down to ten sounds and one voice.",
        "source": "X22n0420_003:0530b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】初問中欲示持名最勝故挾世情而申教意玄義有此問答故今引用初約鈍根障重易修答次約彌陀本願攝受答余今經執持名號但被障重眾生應屬散善麤行耶。",
        "translation": "[Commentary] The first question was intended to show that holding to the name is most excellent, so it takes worldly conditions and explains the profound meaning of the teaching.",
        "source": "X22n0420_003:0530b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】問達法本空心淨土淨何須念佛求生淨土。",
        "translation": "[Commentary] Q: How is it necessary to recite the Buddha's name and seek birth in the Pure Land when the Dharma itself is empty and the mind is pure and the land is purified?",
        "source": "X22n0420_003:0530b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】答若真達理語默皆如不礙修持何妨念佛。",
        "translation": "[Commentary] A. If truly realizing the principle, speech and silence are all as they are, and cultivation isn't hindered, then why is it necessary to recite the Buddha's name?",
        "source": "X22n0420_003:0530b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】二問中達法者達即觀照法即十界依正心境等法觀智一如萬法俱空豈有心土念佛求生之別耶答中對簡偏邪故曰真達良由理無所存徧在於事若或棄事談理則成斷滅之見應知理事一體二名理外無事事外無理畢竟平等無非法界若此妙達何往不通終日修而未甞修終日念而未甞念故曰無礙等語默即事理也。",
        "translation": "[Commentary] The second question is, \"Is the attainment of the Dharma, which is the contemplation of the Dharma, which is the ten realms, depending on the correct mind, objects, and other things, such as the law of contemplation and wisdom, all things are empty, is there a distinction between the mind and the land and seeking birth by mindfulness of the Buddha?\" The answer is simple, partial, and wrong.",
        "source": "X22n0420_003:0530b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若貶念佛未曰達人。",
        "translation": "[Commentary] If he denigrates the mindfulness of the Buddha, he's not yet called an accomplished person.",
        "source": "X22n0420_003:0530c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】若貶下二句疊計交責。",
        "translation": "[Commentary] If you disparage the next two phrases, it's a superfluous calculation and a cross-reference.",
        "source": "X22n0420_003:0530c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】何以然者既達法空則不住於相。",
        "translation": "[Commentary] Why is it so? Since they've realized the emptiness of things, they don't dwell in characteristics.",
        "source": "X22n0420_003:0530c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】何下覆示真達初句徵起既下正示即約三諦以彰妙理初二句了達諸法本性空寂相即非相蕩一切法何甞住相即真諦也。",
        "translation": "[Commentary] Why is it so? The first sentence describes the true attainment, and the second sentence correctly shows that it's the manifestation of the subtle principle in terms of the three truths.",
        "source": "X22n0420_003:0530c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】既常念佛則不滯於空。",
        "translation": "[Commentary] Since he's always mindful of the Buddha, he isn't stuck in emptiness.",
        "source": "X22n0420_003:0530c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次二句雖達法空法法宛然非相即相立一切法何甞滯空即俗諦也。",
        "translation": "[Commentary] The second two phrases, although they understand that things are empty and things are completely nonidentical, that is, the characteristics establish how all things are always stuck in emptiness, which is the conventional truth.",
        "source": "X22n0420_003:0530c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】超越二邊從容中道。",
        "translation": "[Commentary] They transcend the two extremes and follow the middle way.",
        "source": "X22n0420_003:0530c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】非真而真非俗而俗即遮而照即照而遮遮照同時真俗不二故曰從容即中諦也然此三諦說有前後用在一心能知此者可謂真達。",
        "translation": "[Commentary] It's not true but true, not mundane but mundane, which is to obscure and illuminate, which is to illuminate and obscure and illuminate at the same time, so it's called the middle truth of going along with it. However, this explanation of the three truths has a prior and a subsequent use in a single mind, and someone who can know this can be considered truly advanced.",
        "source": "X22n0420_003:0530c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】念念契合彌陀法身聲聲流入薩婆若海。",
        "translation": "[Commentary] Nian Nian fits in with the sound of Maitreya's Dharma body flowing into the ocean of sarvajña.",
        "source": "X22n0420_003:0531a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】念下四句明觀契境彌陀法身即是三德秘藏薩婆若翻一切智即佛智也深廣莫測喻之如海既達三諦任運自與秘藏佛智相冥相即故云契合流入也。",
        "translation": "[Commentary] The four sentences below Nian explain that the mindfulness of the object of contemplation is the secret store of the three virtues, which is the wisdom of the Buddha and is unfathomably deep and wide, like an ocean that has attained the three truths and is naturally associated with the secret store of the Buddha's wisdom.",
        "source": "X22n0420_003:0531a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】臨終決定上品上生。",
        "translation": "[Commentary] He's determined to be born in the upper class and above at the end of his life.",
        "source": "X22n0420_003:0531a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】臨下二句明因趣果所以決定上品上生者以由上品必發三心至誠即今中諦深心即真諦迴向發願即今俗諦與彼三心宛然符合上品上生故無疑矣。",
        "translation": "[Commentary] The reason the proximate two sentences clarify the cause and destination of the result is that they determine the birth of the highest of the three qualities because the highest quality must give rise to the three minds, which are the present middle truth, the profound mind, which is the true truth, the retrogression, the vow, which is the present conventional truth, and those three minds are in perfect accord with the highest of the three qualities, so there's no doubt about it.",
        "source": "X22n0420_003:0531a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】豈非心淨佛土淨乎。",
        "translation": "[Commentary] Isn't it true that the mind is purified and the Buddha-lands are purified?",
        "source": "X22n0420_003:0531a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】豈下二句決前問意。",
        "translation": "[Commentary] The next two phrases resolve the meaning of the previous question.",
        "source": "X22n0420_003:0531a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】故十疑論云智者熾然求生淨土達生體不可得此乃真無生非謂生法外別有無生也淨名云雖知諸佛國及與眾生空而常修淨土教化諸群生即斯謂也。",
        "translation": "[Commentary] Therefore, the Treatise on the Ten Doubts says that the wise man fervently seeks to be born in the Pure Land and understands that the essence of birth is unobtainable. This is truly unborn, not something other than the principle of birth.",
        "source": "X22n0420_003:0531a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】故下引證莫非三諦熾然求生俗諦也生體叵得真諦也真俗無偏中道也此下點示即前真達淨名論中自引準上可解。",
        "translation": "[Commentary] Therefore, the following quote proves that none other than the blazing pursuit of the three truths is the conventional truth of birth, the true truth of the unobtainable nature of birth, and the middle way of the true and the conventional being without bias. The following point shows that the preceding Treatise on the True and Comprehensible Names refers to the above.",
        "source": "X22n0420_003:0531a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】問觀經云是心作佛是心是佛何須念他佛耶。",
        "translation": "[Commentary] The question is, \"Does the sutra of contemplation say that this mind makes buddhas and this mind is buddha, and why is it necessary to think of other buddhas?",
        "source": "X22n0420_003:0531a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三問中世人不知佛有已未妄認經中心是之說遂起上慢更不進修故引觀經而為決破。",
        "translation": "[Commentary] In the three questions, the world doesn't know that the Buddha exists and hasn't falsely recognized the sūtras' teaching that the mind is this, so they become arrogant and don't further pursue further study, so they cite the contemplation sūtras as a way to decisively refute it.",
        "source": "X22n0420_003:0531a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】答祇由心本是佛故令專念彼佛。",
        "translation": "[Commentary] The answer is simply that because the mind is originally a Buddha, it makes them concentrate on mindfulness of that other Buddha.",
        "source": "X22n0420_003:0531a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】答中初二句就問通答。",
        "translation": "[Commentary] The first two phrases of the answer are a general answer to the question.",
        "source": "X22n0420_003:0531a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】梵網戒云常須自知我是未成之佛諸佛是已成之佛。",
        "translation": "Commentary] The Brahmā's Net precepts say to always know for yourself that I am a Buddha who's not yet become a Buddha and the buddhas are the buddhas who have become buddhas.",
        "source": "X22n0420_003:0531a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】汝心佛者未成佛也彌陀佛者已成佛也。",
        "translation": "[Commentary] The Buddha of your mind is an uncompleted Buddha, and the Buddha of Maitreya is a completed Buddha.",
        "source": "X22n0420_003:0531b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】梵下別分已未佛雖是一修性不同汝執心是乃性具佛全體在迷如玉蘊石似金雜鑛豈可下凡濫同上聖故曰汝心未成佛也一切諸佛全性起修修極性顯安住秘藏證大涅槃如無瑕玉似純淨金能施大用攝化眾生故曰彌陀已成佛也。",
        "translation": "[Commentary] Although the Brahmā precepts distinguish between unbuddha and buddha, the nature of your mind is different from that of the cultivation of the one.",
        "source": "X22n0420_003:0531b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】未成之佛久沈欲海具足煩惱杳無出期已成之佛久證菩提具足威神能為物護。",
        "translation": "[Commentary] A Buddha who has yet to become a buddha has long been sunken into the ocean of desire, fully endowed with afflictions, with no prospect of escape, and a Buddha who has accomplished enlightenment for a long time, fully endowed with authority and capable of protecting things.",
        "source": "X22n0420_003:0531b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】未下八句雙顯過德。",
        "translation": "[Commentary] The following eight phrases both show the faults and merits.",
        "source": "X22n0420_003:0531b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】是故諸經勸令念佛即是以己未成佛求他已成佛而為救護耳。",
        "translation": "[Commentary] Therefore, the sutras' exhortation to mindfulness of the Buddha is to seek to rescue others who have already become buddhas because they haven't yet become buddhas themselves.",
        "source": "X22n0420_003:0531b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】是故諸經下正示經意成上由心是佛令念彼佛之語。",
        "translation": "[Commentary] Therefore, the following sūtras correctly show the sūtras' meaning when they say that the mind is the Buddha and causes mindfulness of that Buddha.",
        "source": "X22n0420_003:0531b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】是故眾生若不念佛聖凡永隔父子乖離長處輪迴去佛遠矣。",
        "translation": "[Commentary] Therefore, if sentient beings don't think of the Buddha, sages and mortals are permanently separated, and fathers and sons are estranged from each other and go far away from the Buddha in the long run.",
        "source": "X22n0420_003:0531b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】是故眾生下躡前反顯勸令修進。",
        "translation": "[Commentary] It's for this reason that sentient beings are encouraged to cultivate their minds by stepping forward and showing the opposite.",
        "source": "X22n0420_003:0531b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】問四字名號凡下常聞有何勝能超過眾善。",
        "translation": "[Commentary] They ask what is the excellence of the four-syllable name that's always heard beneath ordinary people that transcends all goodness.",
        "source": "X22n0420_003:0531b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】四問中據前行法屢示稱名是多功德今附淺識再顯勝能初二句牒計次二句詰問。",
        "translation": "[Commentary] Of the four questions, the one based on the previous practice repeatedly shows that calling things by name is a lot of merit. Now, we'll attach the first two sentences to the shallow consciousness and then reveal their superior ability.",
        "source": "X22n0420_003:0531b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】答佛身非相果德深高不立嘉名莫彰妙體。",
        "translation": "[Commentary] Answer: \"The Buddha's body is not a mark, but the fruit of virtue is profound and high, and there's no way to express its marvelous essence without establishing a fancy name.",
        "source": "X22n0420_003:0531b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】答中初四句通示立名所以非相即法身經云佛真法身猶若虗空果德即應身上冥下應即報身三身三德高不可仰深不可測非是凡夫心力所及故立嘉名以召其體是則一稱名號三德全彰豈謂常聞輒生輕慢。",
        "translation": "[Commentary] In the first four sentences of the answer, they show through the establishment of the name so that it's not a mark, which is the Dharma body. The sutra says that the true Dharma body of the Buddha is just like space, and the fruit virtue is the response body, which is the reward body, and the three virtues of the three bodies are too high and unfathomable to be raised, too deep and unfathomable to be reached by the power of ordinary minds.",
        "source": "X22n0420_003:0531b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十方三世皆有異名。",
        "translation": "Commentary] There are different names for each of the three worlds in the ten directions.",
        "source": "X22n0420_003:0531c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】十下二句泛舉諸佛名同。",
        "translation": "[Commentary] The two sentences below ten generally enumerate the names of the buddhas as being the same.",
        "source": "X22n0420_003:0531c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】況我彌陀以名接物。",
        "translation": "[Commentary] How could we, Maitreya, receive things by name?",
        "source": "X22n0420_003:0531c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】況下二句別彰彌陀最勝。",
        "translation": "[Commentary] The next two sentences specifically highlight Amitâbha's supremacy.",
        "source": "X22n0420_003:0531c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】是以耳聞口誦無邊聖德攬入識心永為佛種頓除億劫重罪獲證無上菩提。",
        "translation": "[Commentary] Thus, hearing, speaking, and reciting the name, the infinite noble virtues are gathered into consciousness and mind, and they forever become the seed of the Buddha, which suddenly removes billions of heavy sins and realizes unsurpassed enlightenment.",
        "source": "X22n0420_003:0531c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】是下顯示誦持益大為種除罪現因也獲證菩提來果也。",
        "translation": "[Commentary] This next section shows how chanting greatly benefits the seeds that remove sins as the present cause and the realization of the future fruit of bodhi.",
        "source": "X22n0420_003:0531c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】信知非少善根是多功德也。",
        "translation": "[Commentary] Faith knows that these aren't just a few good roots but also many virtues.",
        "source": "X22n0420_003:0531c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】信下躡意結皈上科。",
        "translation": "[Commentary] Belief is the next step in guiding the mind and converting the above section.",
        "source": "X22n0420_003:0531c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】華嚴云寧受地獄苦得聞諸佛名不受無量樂而不聞佛名。",
        "translation": "[Commentary] The Huayan jing says it's better to suffer the pain of hell and hear the names of the buddhas than to hear the names of the buddhas without experiencing measureless happiness.",
        "source": "X22n0420_003:0531c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】藥師經云若彼佛名入其耳中墮惡道者無有是處阿難諸佛境界誠為難信皆是如來威力非聲聞支佛所能信受唯除補處菩薩耳。",
        "translation": "[Commentary] The Yakṣa Sūtra says that if the Buddha's name enters his ear and he falls into a bad destiny, there's no place for him.",
        "source": "X22n0420_003:0531c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】占察經云欲生他方現在淨土者應當隨彼世界佛名專意念誦一心不亂決定得生彼佛淨土善根增長速獲不退當知一切善根中其業最勝等。",
        "translation": "[Commentary] The divination sūtra says that those who want to be born in a present pure land in another place should follow the names of the buddhas of that world, concentrate on recitation, and concentrate on not being distracted, and they'll surely be born in that buddha's pure land, where their good roots grow and they'll quickly attain nonretrogression.",
        "source": "X22n0420_003:0531c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】華下連引三經證成。",
        "translation": "[Commentary] Three sutras are cited together under Flower to confirm this.",
        "source": "X22n0420_003:0531c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】餘諸佛名聞持尚爾況我彌陀有本誓乎。",
        "translation": "[Commentary] It's still true that other Buddhas' names are heard and upheld, so why wouldn't we, Maitreya, have an original vow?",
        "source": "X22n0420_003:0532a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】餘下舉彼況此。",
        "translation": "[Commentary] The rest of the sutras cite this one, so let's examine this one.",
        "source": "X22n0420_003:0532a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】末俗障重多忽持名故委引聖言想無遲慮也。",
        "translation": "[Commentary] At the end of the day, the hindrances of the secular world are so great that they neglect to uphold the name; therefore, they're entrusted with the conception of the noble words without delay.",
        "source": "X22n0420_003:0532a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】末下斥世申意。",
        "translation": "[Commentary] The bottom part is to deny the world and explain its intent.",
        "source": "X22n0420_003:0532a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二感聖中。",
        "translation": "[Commentary] Of the two kinds of sages, this one is the most noble.",
        "source": "X22n0420_003:0532a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人臨命終時阿彌陀佛與諸聖眾現在其前。",
        "translation": "When that person's life is about to end, Amitâbha Buddha and a multitude of sages appear in front of him.",
        "source": "X22n0420_003:0532a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】其人下是人并指上文執持名者。",
        "translation": "[Commentary] This person refers to the person who holds to the name from above.",
        "source": "X22n0420_003:0532a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】感聖中初科初點經文。",
        "translation": "[Commentary] In the first category of feeling the sage, the first section points to the sūtra's text.",
        "source": "X22n0420_003:0532a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】臨終攝引彌陀本願大經云十方眾生至心發願欲生我國臨壽終時假令不與大眾圍繞現其人前者不取正覺。",
        "translation": "[Commentary] At the end of his life, he quotes the great scripture of Amitâbha's past vows, which says that sentient beings in ten directions wholeheartedly wish to be born in our country, and when he reaches the end of his life, he won't attain right awakening if he isn't surrounded by the masses and appears in front of them.",
        "source": "X22n0420_003:0532a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】臨下引本願可解。",
        "translation": "[Commentary] The introduction to the former vows can be understood.",
        "source": "X22n0420_003:0532a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】聖眾現前亦有多別。",
        "translation": "[Commentary] There are also many distinctions between the manifestation of the noble ones.",
        "source": "X22n0420_003:0532a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次科初二句總標。",
        "translation": "[Commentary] The first two phrases of the second section are a general outline.",
        "source": "X22n0420_003:0532a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】或真佛化佛觀音勢至隨其品位委在觀經。",
        "translation": "[Commentary] Perhaps a true Buddha or a transformation Buddha Avalokitêśvara arrives according to his level and is entrusted with the contemplation of the sūtra.",
        "source": "X22n0420_003:0532a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】或真下別示隨其功行感見不同。",
        "translation": "[Commentary] Whether it's true or not, the following separately shows that there are different views based on their performance and actions.",
        "source": "X22n0420_003:0532a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】或謂臨終見佛以為魔者或云自心業現實無他佛來者。",
        "translation": "[Commentary] It might be called a dying vision of a Buddha who thinks he's a demon, or it might be called the reality of one's own mind's actions and the absence of another Buddha.",
        "source": "X22n0420_003:0532a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】斯蓋不知生佛一體感應道交。",
        "translation": "[Commentary] This is because they don't know that birth and Buddha are one and the same, and they sense the interplay of the path.",
        "source": "X22n0420_003:0532a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】斯下顯正眾生諸佛同一覺源諸佛心內眾生新新造業眾生心內諸佛念念證真全佛是生全生是佛故云一體感則屬生應則屬佛既即一體所以眾生感自心之佛諸佛應自心之生性惡相關感應一際故云道交。",
        "translation": "[Commentary] It's clear from the following that sentient beings and buddhas are of the same awakening source, that sentient beings within the minds of buddhas are newly creating karma, that sentient beings within the minds of buddhas are mindfully realizing the truth, that all buddhas are sentient beings, that all sentient beings are buddhas, that's why they're one in feeling and sentient beings respond to the buddhas of their own minds, that their natures are related to evil, and that's why the path is intersected.",
        "source": "X22n0420_003:0532a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】自障障他為過不淺如別所明。",
        "translation": "[Commentary] Self-impeding hindrances that hinder others are not superfluous as explained separately.",
        "source": "X22n0420_003:0532a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】自下結斥如別明見觀經疏。",
        "translation": "[Commentary] The following is a concluding rebuke, as explained in the Commentary on the Sutra of Clear Realization.",
        "source": "X22n0420_003:0532a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三正念中。",
        "translation": "[Commentary] Among the three kinds of correct mindfulness.",
        "source": "X22n0420_003:0532b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人終時心不顛倒即得往生阿彌陀佛極樂國土。",
        "translation": "When this person's mind isn't mistaken at the time of death, he'll be reborn in Amitâbha's paradise.",
        "source": "X22n0420_003:0532b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】凡人臨終識神無主善惡業種無不發現。",
        "translation": "[Commentary] When a person reaches the end of his life, his consciousness and spirit have no controller, and the seeds of good and bad actions are never discovered.",
        "source": "X22n0420_003:0532b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】正念中初通示善惡古德云過現積集善惡業緣每至臨終咸來嘖報臨終惡念增盛則眾惡皆現牽生惡道臨終善念增盛則眾善皆成牽生善道故云無不發現。",
        "translation": "[Commentary] The first aspect of right mindfulness is to explain the causes of good and evil karma, and as an old virtue says, \"Whenever good and evil karmic conditions are accumulated in the past, they all come to have their retribution at the end of the life.",
        "source": "X22n0420_003:0532b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】或起惡念或起邪見或生繫戀或發猖狂。",
        "translation": "[Commentary] Sometimes evil thoughts arise, sometimes mistaken views arise, sometimes fetters arise, and sometimes craziness arises.",
        "source": "X22n0420_003:0532b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】或下別示惡相一無善種故起惡念二無正信故起邪見三恩愛深重故生繫戀四苦惱逼迫故發猖狂。",
        "translation": "[Commentary] Sometimes the following separately shows the characteristics of evil: 1) lacking good seeds, bad thoughts arise; 2) lacking right faith, wrong views arise; 3) because of deep affection, attachments arise; and 4) because of the persistence of suffering, craziness arises.",
        "source": "X22n0420_003:0532b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】惡相非一皆名顛倒。",
        "translation": "[Commentary] When the characteristics of evil are not one, it's called mistakenness.",
        "source": "X22n0420_003:0532b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】惡下二句總結顛倒顯不顛倒。",
        "translation": "[Commentary] The two sentences below [evil] summarize what's mistaken and show what's not mistaken.",
        "source": "X22n0420_003:0532b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】因前誦佛罪滅障除淨業內熏慈光外攝脫苦得樂一剎那間。",
        "translation": "[Commentary] As a result of the previous recitation, the Buddha's crimes and hindrances are removed, and pure activities are internally perfumed with compassionate light and externally collected, liberating suffering and attaining happiness in a split second.",
        "source": "X22n0420_003:0532b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】因下正釋經文心不顛倒誦佛修因也罪滅障除威惡也淨業內熏生善也上並自力慈下三句即假他力求生淨土雖云他力必由自力方能感他父子相遇啐啄同時切莫專倚他力而失自行勉之勉之。",
        "translation": "[Commentary] As a result, the following is a correct interpretation of the sūtras, the mind isn't mistaken. reciting the Buddha cultivates the cause, it removes sins and hindrances, it removes the authoritative evil, and it creates goodness from the inner perfuming of pure activities.",
        "source": "X22n0420_003:0532b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】下文勸生其利在此。",
        "translation": "[Commentary] Here's the benefit of the following encouragement to be born.",
        "source": "X22n0420_003:0532b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】下文勸生即經我見是利等問所修淨業是有是無在何處所無則枉費精神試垂定當問雖云莊嚴淨土未審如何莊嚴請示其相問臨終往生為識神潛邁為佛來攝持二俱有過問往生之人是何形狀為有為無二俱有過問此土陰壞彼土陰生生彼之陰復與中陰何別聊陳五問擊發同修於此無疑往生決矣。",
        "translation": "[Commentary] The following exhortation to rebirth is based on the sutra, 'I see this benefit,' which asks whether the pure activity being cultivated is present or absent, and where it's absent, then it's a waste of effort to try to set the mind straight.",
        "source": "X22n0420_003:0532b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三結顯中。",
        "translation": "[Commentary] Among the three concluding remarks, he said.",
        "source": "X22n0420_003:0532c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗我見是利故說此言若有眾生聞是說者應當發願生彼國土。",
        "translation": "\"Śāriputra, I see this benefit; therefore, I say this. If sentient beings hear this teaching, they should make the vow to be born in that land.",
        "source": "X22n0420_003:0532c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】我見是利即躡上科故說此言覆示前段正報中文對文可見。",
        "translation": "[Commentary] I see this benefit, which is to tiptoe around the above section and therefore speak these words, covering the previous section's correct retribution as shown in the Chinese text.",
        "source": "X22n0420_003:0532c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結顯中即躡上科者即指行法中專念持號臨終感聖正念往生之文覆示前段者即指化主名號徒眾莊嚴故云正報中文前結勸云眾生聞者應當發願此中又云聞是說者應當發願故云覆示。",
        "translation": "[Commentary] The words that tiptoe upward in the concluding statement refer to the practice of the method of concentrating on mindfulness and holding the name, and then at the end of life, feeling the noble and right mindfulness of going to be born in the land.",
        "source": "X22n0420_003:0532c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大段第三勸信中三節初至佛所說引諸佛同讚勸若有人下二約三時因果勸如我今者下舉諸佛互讚勸初中又二初至之利指前自讚東方下次引諸佛讚。",
        "translation": "[Commentary] The third section of the encouragement of faith has three parts. The first arrives at the Buddha's teaching and introduces the Buddhas to praise each other.",
        "source": "X22n0420_003:0532c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Middle level.",
        "source": "X22n0420_003:0532c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗如我今者讚嘆阿彌陀佛不可思議功德之利。",
        "translation": "Śāriputra, as I am now, praises Amitâbha for the unfathomable benefits of his merits.",
        "source": "X22n0420_003:0532c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如前所說依正殊特持名脫苦。",
        "translation": "[Commentary] As was explained earlier, he relies on the correct and distinctive practice of holding to the name to escape suffering.",
        "source": "X22n0420_003:0532c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第三勸信自贊中依正殊特即二報莊嚴也持名脫苦即正示行法也。",
        "translation": "[Commentary] The third encouragement of faith and self-corroboration relies on what's right and special, which is the adornment of the two rewards and the upholding of the name and escaping suffering, which is the correct explanation of the practice of the Dharma.",
        "source": "X22n0420_003:0532c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】莫非彌陀大悲願行從因至果功德利益殆非心思口議所及。",
        "translation": "[Commentary] Māmakī's greatly compassionate vow to practice from cause to effect brings benefits of merit that are beyond the ability of the mind to contemplate or discuss.",
        "source": "X22n0420_003:0533a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】莫下正釋當科不可思議功德之文也。",
        "translation": "[Commentary] Mo next correctly explains the text of the inconceivable merit of the current subject.",
        "source": "X22n0420_003:0533a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二中又二初盡六方正列於汝意云何下釋經名。",
        "translation": "[Commentary] In the second, there are two more. First, we'll exhaust the six directions and list them precisely as you see fit.",
        "source": "X22n0420_003:0533a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初中但列六方若依唐譯則列十方。",
        "translation": "[Commentary] In the middle section, only the six directions are listed, but if we rely on the Tang translation, then the ten directions are listed.",
        "source": "X22n0420_003:0533a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】佛讚總示中初三句對二經廣略。",
        "translation": "[Commentary] The first three sentences of this general presentation of the Buddha's praise are broad and concise compared to the two sutras.",
        "source": "X22n0420_003:0533a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今謂但舉六方四維自攝但言略耳。",
        "translation": "[Commentary] Now, we're talking about just citing the six directions and the four dimensions themselves, but we're just saying it's abridged.",
        "source": "X22n0420_003:0533a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】今下示今略攝廣。",
        "translation": "[Commentary] Now, the following shows that the present is abbreviated and includes the broad.",
        "source": "X22n0420_003:0533a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】下諸佛名相承不釋。",
        "translation": "[Commentary] The following are the names of the buddhas that are inherited and not explained.",
        "source": "X22n0420_003:0533a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】下下明釋佛名上二句點古不釋。",
        "translation": "[Commentary] The next section explains that the names of the buddhas are not explained in the previous two sentences.",
        "source": "X22n0420_003:0533a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】今以義詳或從色相或取言音或約行業或從譬喻。",
        "translation": "[Commentary] Now, the explanation may be detailed based on form, or it may be based on speech and sound, or it may be based on industry or metaphor.",
        "source": "X22n0420_003:0533a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】今下明今義詳。",
        "translation": "[Commentary] Now, the next section explains the present in detail with respect to meaning.",
        "source": "X22n0420_003:0533a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大略不出果德三身收無不盡文或偏舉義必兼含。",
        "translation": "[Commentary] The summary doesn't include the three bodies of the fruit of merit, but there's nothing incomplete about them, and the text might be partial, and the meaning must be inclusive.",
        "source": "X22n0420_003:0533a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】大下約身總收。",
        "translation": "[Commentary] The next section summarizes the collection of the body.",
        "source": "X22n0420_003:0533a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初東方分二初敘現通二引讚詞餘五例此更不重分。",
        "translation": "[Commentary] First, there are two parts of the east: the first describes the present and the second cites praises, and the other five examples are not repeatedly divided here.",
        "source": "X22n0420_003:0533a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "First, there's Akṣobhya Buddha in the east, and then there's Śubhavyūha.",
        "source": "X22n0420_003:0533a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "東方亦有阿閦鞞佛須彌相佛大須彌佛須彌光佛妙音佛如是等恒河沙數諸佛各於其國出廣長舌相遍覆三千大千世界說誠實言。",
        "translation": "In the east, there's also Akṣobhya, Sumeru, Somisang, Mahāsumeru, Sumeru-brightness, Sumeru-vocal, and so forth, a vast number of buddhas in their countries, each with a broad and long tongue that covers 3,000 great thousand worlds and speaks truly.",
        "source": "X22n0420_003:0533a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】阿閦鞞此云不動法身體寂無遷變故。",
        "translation": "[Commentary] Akṣobhya is called Akṣobhya because the immovable Dharma body is tranquil and immutable.",
        "source": "X22n0420_003:0533a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】東方佛名中初佛初約果釋。",
        "translation": "[Commentary] The first of the Eastern names of the buddhas is explained in terms of their fruition.",
        "source": "X22n0420_003:0533a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若就因行毀譽敬慢同一如故。",
        "translation": "[Commentary] If we take the causes and actions, praise, honor, respect, and pride are the same as before.",
        "source": "X22n0420_003:0533b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次就因釋毀譽口業也敬慢身業也八風不動物我兩忘故曰一如。",
        "translation": "[Commentary] Second, it's interpreted in terms of cause, disparagement, verbal action, esteem, and physical action, and the eight winds don't animalize self and are therefore called unity.",
        "source": "X22n0420_003:0533b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次列三名皆從喻名眾山之中須彌最勝諸佛法身超過諸法初言相者其狀同也次言大者出過喻也三言光者光則表智法兼報也妙音說法稱機即應佛也。",
        "translation": "[Commentary] The next three are all named from metaphors. Among the mountains, Sumeru is the most distinguished, and the Buddha's Dharma body surpasses all dharmas. The first one says characteristics, which are the same in appearance; the second one says great, which is beyond metaphors; and the third one says light, which is an expression of wisdom and the combined rewards of dharmas.",
        "source": "X22n0420_003:0533b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次三莫非法身但從喻別後佛從應可見。",
        "translation": "[Commentary] The next three are not the Dharma body, but they're distinguished by metaphors, and the subsequent Buddha is visible by response.",
        "source": "X22n0420_003:0533b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】河沙佛土略列五名故云如是等。",
        "translation": "[Commentary] The buddha land of Hesha is a brief list of five names, so it's called thus.",
        "source": "X22n0420_003:0533b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】土若河沙佛亦復爾不可備舉故云等也梵語恒伽又云兢伽翻天堂來應法師云此河從無熱惱池東面象口流出入于東海其沙至細與水同流以手掬之則沙隨水去三千大千且據娑婆一化為言一須彌山一日月一四天下并上六欲梵世為一世界如是一千名小千千倍小千名曰中千千倍中千名一大千世謂三世界即界分上下八方也。",
        "translation": "[Commentary] The land of Rājagṛha Buddha is also similar in that it's not possible to enumerate them all, so it's called such. The Sanskrit word hengga also means 'hengga' and 'hengga' translates into 'heaven' when the teacher of the Dharma says that the river flows in and out of the East Sea from the elephant's mouth on the east side of the lake without heat and its sand is so fine that it flows with the water.",
        "source": "X22n0420_003:0533b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】各於其國者正當釋迦說此經時十方諸佛同時勸讚令信是經。",
        "translation": "[Commentary] Each in his own country means that when Śākyamuni taught this sūtra, the buddhas of the ten directions simultaneously praised and made him believe in it.",
        "source": "X22n0420_003:0533b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若據諸佛言無虗妄但由眾生障重信難故現舌相表示誠言。",
        "translation": "[Commentary] Suppose the buddhas' words were not false but it's because it's difficult for sentient beings to believe because of the heavy hindrances that they show their tongues to express their sincerity.",
        "source": "X22n0420_003:0533b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】諸佛常舌上至額際今此現起長廣量等隨宜大小何止大千乎。",
        "translation": "[Commentary] The buddhas always speak with their tongues up to their foreheads, but this is a manifestation of a long, wide, and appropriate size, not to mention a great many things.",
        "source": "X22n0420_003:0533b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】智論問曰世尊大德威重何故出廣長舌似如輕相答今欲口說難信難解之法是故出舌相為證必真實也問各於其國出舌所覆大千屬誰化境答彼佛讚此即知此佛化境也。",
        "translation": "[Commentary] The Zhilun asked, \"Bhagavān, why does the great authority of the Bhagavān give rise to a broad and long tongue that seems to have a light appearance?\" He wanted to orally teach a teaching that's difficult to believe and difficult to understand, so he gave rise to the tongue as evidence that it must be true.",
        "source": "X22n0420_003:0533b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次引讚詞。",
        "translation": "Commentary] Next, he quoted a praise.",
        "source": "X22n0420_003:0533c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等眾生當信是稱讚不可思議功德一切諸佛所護念經。",
        "translation": "\"You sentient beings will believe this praise of the unfathomable virtue of all the buddhas that guard mindfulness of the sūtras.",
        "source": "X22n0420_003:0533c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】當信是句絕。",
        "translation": "[Commentary] You must believe this is the end of the sentence.",
        "source": "X22n0420_003:0533c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次贊詞中初分句。",
        "translation": "[Commentary] The first part of the second verse praises the sutra.",
        "source": "X22n0420_003:0533c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】稱讚下即經本題上句指前釋迦所說下二句如後經文所解。",
        "translation": "[Commentary] Praise is the first two phrases of the main title of the sūtra, which refers to what Śākyamuni said in the previous sentence, as explained in the subsequent verses.",
        "source": "X22n0420_003:0533c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】稱下示本題總三句上句八字釋迦所說者即前經文依正莊嚴持名修法等故名稱讚不可思議功德下二句指後即六方佛後徵示何故名一切諸佛所護念等然此一題六方諸佛所說若其初句猶是釋迦自語經云如我今者讚歎阿彌陀佛不可思議功德。",
        "translation": "The first eight phrases refer to what Śākyamuni said in the previous sūtra, which was to praise the inconceivable virtues of Amitâbha because it relies on the correct adornment, maintains names, cultivates the Dharma, etc. The second phrase refers to the buddhas of the six directions, and then it shows how it's called \"all buddhas' protection and mindfulness.",
        "source": "X22n0420_003:0533c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】餘見題中下五並同此釋。",
        "translation": "[Commentary] The remaining five items in the title are the same as this explanation.",
        "source": "X22n0420_003:0533c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】餘下指前釋題下下例同後不釋故。",
        "translation": "[Commentary] The remainder refers to the preceding explanation of the title and the following example, which is the same as the latter explanation.",
        "source": "X22n0420_003:0533c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二南方中。",
        "translation": "[Commentary] Second, in the south.",
        "source": "X22n0420_003:0533c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗南方世界有日月燈佛名聞光佛大燄肩佛須彌燈佛無量精進佛如是等恒河沙數諸佛各於其國出廣長舌相徧覆三千大千世界說誠實言。",
        "translation": "Śāriputra, in the southern world there's the Sun, Moon, and Lamp Buddha, who's called the Buddha of Hearing Light, the Great Yama Shoulder Buddha, the Sumeru Lamp Buddha, the Buddha of Immeasurable Effort, and so on, each of whom produces a broad and long tongue that covers the 3,000 great one-thousand worlds and speaks honestly.",
        "source": "X22n0420_003:0533c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】日月燈三皆破闇或次對三身次單喻智德。",
        "translation": "[Commentary] The three suns, moons, and lamps all break through darkness or secondarily counter the three bodies, and secondly, they simply describe the virtue of wisdom.",
        "source": "X22n0420_003:0534a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】南方五佛第一從喻二義初對三身日即法身月即報身燈即應身或可配於三智次單喻智德者一即三故。",
        "translation": "[Commentary] The five southern buddhas first follow the metaphor in two senses. First, they contrast the three bodies, the sun being the Dharma body, the moon being the reward body, and the lamp being the response body, or they can be paired with the three kinds of wisdom.",
        "source": "X22n0420_003:0534a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】名聞光者名聞十方如光遍照。",
        "translation": "[Commentary] The one who hears the light of fame is known in ten directions as a light that shines everywhere.",
        "source": "X22n0420_003:0534a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第二法喻雙舉。",
        "translation": "[Commentary] The second dharma metaphor is a double one.",
        "source": "X22n0420_003:0534a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大燄肩者言相則兩肩光燄在智則雙照真俗。",
        "translation": "[Commentary] \"Great flaming shoulders\" means that while it's in form, both shoulders are illuminated, and while it's in wisdom, both true and secular are illuminated.",
        "source": "X22n0420_003:0534a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第三兩肩光燄表顯真俗二智。",
        "translation": "[Commentary] The third expression, 'two shoulders of light and flames,' shows the two kinds of cognition, real and mundane.",
        "source": "X22n0420_003:0534a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】須彌燈者山燈即喻法報二身。",
        "translation": "[Commentary] The Sumeru lamp is a mountain lamp that's a metaphor for the two bodies of Dharma and reward.",
        "source": "X22n0420_003:0534a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第四山燈雙喻須彌高出法身德也燈能破暗智慧也。",
        "translation": "[Commentary] The fourth mountain lamp is a metaphor for Sumeru's surpassing the Dharma body's virtue and the lamp's ability to dispel darkness and wisdom.",
        "source": "X22n0420_003:0534a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】無量精進從行為名方便度生未嘗暫懈眾生無量悲智亦然。",
        "translation": "[Commentary] Measureless effort is called the method of doing things to save sentient beings without ever temporarily neglecting them, and so is measureless compassion and wisdom.",
        "source": "X22n0420_003:0534a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第五無量精進對機顯行解脫用也。",
        "translation": "[Commentary] The fifth measureless exertion is the manifestation of the practice of liberating function to the spiritual capacities of sentient beings.",
        "source": "X22n0420_003:0534a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等眾生當信是稱贊不可思議功德一切諸佛所護念經。",
        "translation": "You sentient beings should believe this sūtra praising the unfathomable virtues of all the buddhas that guard mindfulness.",
        "source": "X22n0420_003:0534a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三西方中。",
        "translation": "[Commentary] Among the three western [realms].",
        "source": "X22n0420_003:0534a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗西方世界有無量壽佛無量相佛無量幢佛大光佛大明佛寶相佛淨光佛如是等恒河沙數諸佛各於其國出廣長舌相徧覆三千大千世界說誠實言。",
        "translation": "In the western world, there's the Buddha of Immeasurable Life, the Buddha of Immeasurable Appearance, the Buddha of Immeasurable Banners, the Buddha of Great Light, the Buddha of Great Luminosity, the Buddha of Jeweled Appearance, the Buddha of Pure Light, and so forth, a vast number of buddhas each in their own country with a broad and long tongue that covers the 3,000 great thousand worlds and speaks honestly.",
        "source": "X22n0420_003:0534a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】前三皆名無量初即壽命二即相好三即所證法身無上故喻如幢。",
        "translation": "[Commentary] The first three are all called immeasurable, first, their life span, second, their appearance, and third, the Dharma body they've realized is unsurpassed, so they're likened to a banner.",
        "source": "X22n0420_003:0534a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】西方七佛一二壽命與相皆從報德第三幢喻高顯法身最上故。",
        "translation": "[Commentary] One, two, life span, and characteristics of the seven buddhas of the West are derived from the merit of retribution, and the third, the banner, is a metaphor for the supreme manifestation of the Dharma body.",
        "source": "X22n0420_003:0534a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大光大明並喻佛智自行化他破障除惑。",
        "translation": "[Commentary] The great luminosity and great radiance also metaphorically represent the Buddha's knowledge to self-treat others and break down obstacles and remove mental disturbances.",
        "source": "X22n0420_003:0534a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】大光大明二皆以光顯智光能破暗智能斷惑。",
        "translation": "[Commentary] Both great luminosity and great radiance are used to show wisdom by means of light.",
        "source": "X22n0420_003:0534a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】寶相者應佛相好如寶可貴。",
        "translation": "[Commentary] \"Jeweled features are the Buddha's features that are valuable like jewels.",
        "source": "X22n0420_003:0534b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】寶相法喻雙舉其相端嚴如寶尊貴。",
        "translation": "[Commentary] Jeweled features and Dharma metaphors both present their features in an ornate way like a precious jewel.",
        "source": "X22n0420_003:0534b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】淨光者亦即法報。",
        "translation": "[Commentary] Jingguang is also known as the Dharma reward.",
        "source": "X22n0420_003:0534b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】淨光者智光純淨惑暗無餘故。",
        "translation": "[Commentary] Pure radiance is the pure radiance of wisdom that purifies affliction and darkness without remainder.",
        "source": "X22n0420_003:0534b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】問初無量壽即是彌陀若自勸讚於義非便答同名甚多必非極樂法藏所成之彌陀。",
        "translation": "[Commentary] First, he asks if immeasurable life is Maitreya, and if he praises himself for what he means, then he doesn't answer that there are many names that are the same, but they must not be Maitreya, who is the store of the Dharma of paradise.",
        "source": "X22n0420_003:0534b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次決疑不應自讚故答中且如彌陀對問顯意須知諸佛皆有同名同號如法華二方同名日月燈明壇[紇-乙+(暴-(日/共))]有八百億同名釋迦等。",
        "translation": "[Commentary] Second, they resolved their doubts and shouldn't praise themselves; therefore, in the answer, they should respond to the question as Maitreya did, showing their intention.",
        "source": "X22n0420_003:0534b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等眾生當信是稱贊不可思議功德一切諸佛所護念經。",
        "translation": "You sentient beings should believe this scripture that praises the unfathomable merit of all the buddhas who guard and think about it.",
        "source": "X22n0420_003:0534b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】四北方中。",
        "translation": "[Commentary] In the four northern directions.",
        "source": "X22n0420_003:0534b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗北方世界有燄肩佛最勝音佛難沮佛日生佛綱明佛如是等恒河沙數諸佛各於其國出廣長舌相徧覆三千大千世界說誠實言。",
        "translation": "In the northern world of Śāriputra, there's Yama-shoulders Buddha, Most Excellent Sound Buddha, Nanbu Buddha, Nāgabodhi Buddha, Nirmāṇarati Buddha, and so on, each of whom in his or her country produces a broad and long tongue that covers 3,000 great thousand worlds and speaks truly.",
        "source": "X22n0420_003:0534b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】燄肩同前但無大字最勝音同上妙音。",
        "translation": "[Commentary] Their flaming shoulders are the same as the previous one but without the big word 最勝音, which is the same as the above wonderful sound.",
        "source": "X22n0420_003:0534b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】北方五佛初二指同。",
        "translation": "[Commentary] The first two representations of the five northern buddhas are the same.",
        "source": "X22n0420_003:0534b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】難殂者法身堅密不可壞故殂音敘又音疽壞也。",
        "translation": "[Commentary] It's difficult to demise because the Dharma body is resolute and indestructible, so demise sounds, syllables, and sounds gangrene.",
        "source": "X22n0420_003:0534b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三即法身不可壞者遮那法體眾魔一切不能沮壞故。",
        "translation": "[Commentary] The three that is, the Dharma body is indestructible because the Dharma body of Caina and all the Māras can't be destroyed.",
        "source": "X22n0420_003:0534b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】日生者如世晨曦破晦暝故。",
        "translation": "[Commentary] The sun arises like the world's morning sun breaking through the darkness.",
        "source": "X22n0420_003:0534b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】四中如日照世應身德也。",
        "translation": "[Commentary] Four of them are like the sun shining in the world and the response body's virtue.",
        "source": "X22n0420_003:0534b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】網明者法門交暎如帝網故。",
        "translation": "[Commentary] A net of illumination is because the Dharma aspects intermingle like the net of Indra.",
        "source": "X22n0420_003:0534b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第五網明三昧法門如帝珠網互相交暎。",
        "translation": "[Commentary] The fifth samādhi of net awareness is like the Tejorā net interconnecting with each other.",
        "source": "X22n0420_003:0534b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等眾生當信是稱贊不可思議功德一切諸佛所護念經。",
        "translation": "You sentient beings should believe this sūtra praising the unfathomable virtues of all the buddhas who guard and recall them.",
        "source": "X22n0420_003:0534c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】五下方中。",
        "translation": "[Commentary] Among the five lower realms.",
        "source": "X22n0420_003:0534c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗下方世界有師子佛名聞佛名光佛達磨佛法幢佛持法佛如是等恒河沙數諸佛各於其國出廣長舌相徧覆三千大千世界說誠實言。",
        "translation": "In the world below Śāriputra, there are lion buddhas, buddhas of renown, buddhas of light, buddhas of dharma, buddhas of Dharma, buddhas who maintain the Dharma, and so on, a great number of buddhas each in their own country, each with a broad and long tongue that covers 3,000 great thousand worlds and speaks honest words.",
        "source": "X22n0420_003:0534c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】獅子者眾聖中尊故以獸王比焉又獅子一吼獸聞皆死喻佛說法魔外消亡。",
        "translation": "[Commentary] The lion is the most venerable of the sages, so he's compared to the king of animals, and when the lion roars, the animals that hear it all die, which is a metaphor for the Buddha's teaching of the Dharma and the demons' extinction.",
        "source": "X22n0420_003:0534c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】下佛六今第一從喻二義一以法身無上故諭如王次以應身說法利機魔外消伏。",
        "translation": "[Commentary] The next six buddhas are now the first to follow the metaphor in two senses: first, because the Dharma body is unsurpassed, the teaching is like a king, and second, because the response body is a teaching that benefits the spiritual capacities of people outside of Māra and subdues them.",
        "source": "X22n0420_003:0534c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】名聞名光義同前釋。",
        "translation": "[Commentary] The meaning of \"reputation and fame\" is the same as the previous explanation.",
        "source": "X22n0420_003:0534c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】二三同前南方一佛今分二號。",
        "translation": "[Commentary] The second and third are the same as the previous explanation of the southern one, which is now divided into two names.",
        "source": "X22n0420_003:0534c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】達磨翻法單云法者所證法身軌持萬化故次云幢者高出物表故三云持者任持常住故。",
        "translation": "Second, it's because the banner rises above the surface of things, and third, it's because the holder can maintain eternal abiding.",
        "source": "X22n0420_003:0534c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】四與六華梵雖異無非法身五即法喻雙舉亦法身德也。",
        "translation": "[Commentary] Although the fourth and sixth are different from the Huayan and Brahmā, there's no nonbuddha body, and the fifth is the Dharma metaphor that combines the virtues of the Dharma body.",
        "source": "X22n0420_003:0534c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等眾生當信是稱贊不可思議功德一切諸佛所護念經。",
        "translation": "All you sentient beings should believe this scripture that praises the unfathomable virtues of all the buddhas and protects their minds.",
        "source": "X22n0420_003:0534c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】六上方中。",
        "translation": "[Commentary] Among the six above.",
        "source": "X22n0420_003:0535a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗上方世界有梵音佛宿王佛香上佛香光佛大燄肩佛雜色寶華嚴身佛娑羅樹王佛寶華德佛見一切義佛如須彌山佛如是等恒河沙數諸佛各於其國出廣長舌相徧覆三千大千世界說誠實言。",
        "translation": "In the world above Śāriputra, there's Brahmā, the King of Constellations, the Buddha of Incense, the Buddha of Fragrant Light, the Buddha of Great Flame, the Buddha of Variegated Jewels and Adorned Bodies, the King of the Sala Trees, the Buddha of Jeweled Flowers, the Buddha of Virtue, the Buddha who Sees All Meaning, Mount Sumeru, and so on, each of the buddhas of the Gaṅgāsaka realm produces a broad and long tongue that covers the 3,000 great thousand worlds and speaks honestly.",
        "source": "X22n0420_003:0535a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】梵音者梵即淨法音清朗眾樂聞故。",
        "translation": "[Commentary] Brahmā's voice is Brahmā, which is the pure Dharma sound that's clear and pleasant for all to hear.",
        "source": "X22n0420_003:0535a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】上方十佛第一音聲五六據色相第九從智解餘六並從喻梵音清朗應身德也。",
        "translation": "[Commentary] The ten buddhas above are the first in sound, the fifth and sixth in form, and the ninth in wisdom and understanding. The other six are also metaphors for the clarity of Brahmā's voice and the virtue of the response body.",
        "source": "X22n0420_003:0535a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】宿王者宿音秀星宿中王所謂月也經云眾星之中月天子為第一。",
        "translation": "[Commentary] Sukhāvatī is the king of the Sukhāvatī constellations, the king of the stars called the moon, and the sūtra says that among the stars, the moon goddess is the first.",
        "source": "X22n0420_003:0535a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】第二以月星釋義莫非居尊並喻法身德初義見法華經亦如律序云眾星月為最【疏】或可北辰居天中而眾星拱之而辰星為宿中王亦喻法身出過諸法也。",
        "translation": "[Note] The second explanation of the meaning of the moon and stars is that Mo Fei Juezun is the most venerable and a metaphor for the virtue of the Dharma body.",
        "source": "X22n0420_003:0535a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次義即論語云譬如北辰居其所而眾星拱之。",
        "translation": "[Commentary] The next meaning is the discourse that says, \"It's like the North Star living in its place and being overshadowed by the stars.",
        "source": "X22n0420_003:0535a14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】香上者眾德如香超諸菩薩更兼智德故云香光。",
        "translation": "[Commentary] He's superior in fragrance because his many virtues are like incense that transcends the bodhisattvas and is combined with the virtue of wisdom, so it's called fragrant radiance.",
        "source": "X22n0420_003:0535a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】香上獨喻法身香光更兼般若。",
        "translation": "[Commentary] Incense above is a metaphor for the Dharma body alone, and incense and light are also prajñāpāramitā.",
        "source": "X22n0420_003:0535a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】燄肩須彌同前故不釋。",
        "translation": "[Commentary] The flaming shoulder of Sumeru is the same as the previous one, so it's not explained.",
        "source": "X22n0420_003:0535a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】雜色寶華者以萬行因華嚴法身果德下寶華德義亦同之娑羅此翻堅固冬夏不凋即喻法身無變易故見一切義者洞達諸法甚深義趣。",
        "translation": "[Commentary] The colorful jeweled lotus is the result of myriad practices, the cause and effect of the Dharma body, and the meaning of the lower jeweled lotus is the same as that of the śāla, which is a metaphor for the Dharma body that doesn't change in winter and summer.",
        "source": "X22n0420_003:0535a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】六與八並以華喻六即萬行莊嚴法身八顯內德勝妙第九即般若智報身德也餘名可曉。",
        "translation": "[Commentary] The six and eight are used together as a metaphor for the flower, which is the Dharma body adorned by myriad practices and the eight that shows the excellence of internal virtues and the ninth that's the reward body of prajñāpāramitā and the other names can be understood.",
        "source": "X22n0420_003:0535a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】諸佛果海德量何窮三世道同理無差異。",
        "translation": "[Commentary] How could the ocean of Buddha-reward virtues be exhausted? There's no difference in the principle that the three worlds and the path are the same.",
        "source": "X22n0420_003:0535a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結誥中上四句歎諸佛果德高深佛佛皆同以海為喻深廣無邊故。",
        "translation": "[Commentary] The previous four sentences in the Letters Patent praise the profundity of the fruit of the buddhas, for the reason that all buddhas are the same, using the ocean as a metaphor for profundity and limitlessness.",
        "source": "X22n0420_003:0535a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】隨機順物一相為名。",
        "translation": "[Commentary] They follow the names of things in their single aspect at random.",
        "source": "X22n0420_003:0535b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】隨下言各偏一相立名有異。",
        "translation": "[Commentary] The following phrases each state that there's a difference in the way one character is designated.",
        "source": "X22n0420_003:0535b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】以意裁量略如上解後賢披閱更試講磨。",
        "translation": "[Commentary] We'll use the above explanation as a rough guide for future generations of sages to read and discuss further.",
        "source": "X22n0420_003:0535b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】以下示今釋隨相略顯示謙囑後。",
        "translation": "[Commentary] The following shows that the present explanation follows a brief indication of the characteristics, after which it's humbly instructed.",
        "source": "X22n0420_003:0535b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等眾生當信是稱贊不可思議功德一切諸佛所護念經。",
        "translation": "'You sentient beings will believe this sūtra praising the unfathomable virtue of all the buddhas who guard and recall.'",
        "source": "X22n0420_003:0535b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次釋名中分三初至念經徵前經名。",
        "translation": "[Commentary] The next section of the explanation of the title is divided into three. First, the sutra on mindfulness collects the names of the previous sutras.",
        "source": "X22n0420_003:0535b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗於汝意云何何故名為一切諸佛所護念經。",
        "translation": "\"Śāriputra, what do you think it is that you call it the Sutra on the Inconceivable Merit of All Buddhas' Protection and Remembrance?",
        "source": "X22n0420_003:0535b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】上句已見前文故但問下二句恐未曉故問釋之。",
        "translation": "[Commentary] The first sentence has already been explained in the previous section, so we only asked about the next two sentences in case we didn't understand them, so we asked for an explanation.",
        "source": "X22n0420_003:0535b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】經名隨釋徵名中本題三句經文前後自明上句稱讚不可思議功德已於前經見義下二未明故茲徵顯。",
        "translation": "[Commentary] The sūtra's title follows the explanation of the lemmas in the three sentences of the original title, which are self-explanatory before and after the sūtra.",
        "source": "X22n0420_003:0535b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】舍利下二示義又二先敘聞持是諸下次明得益。",
        "translation": "[Commentary] The next two below Śāriputra show the meaning of two more, first describing the benefits of hearing and maintaining these things, and then explaining the next.",
        "source": "X22n0420_003:0535b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "△Beginning with the first.",
        "source": "X22n0420_003:0535b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗若有善男子善女人聞是經受持者及聞諸佛名者。",
        "translation": "\"Śāriputra, if there are good men and good women who hear and retain this sūtra and hear the names of the buddhas, then we'll discuss their merits.",
        "source": "X22n0420_003:0535b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】聞經受持者牒上二報莊嚴正明行法二大章也及諸佛名者牒上引佛勸信第三一章初科所引六方名也。",
        "translation": "[Commentary] Hearing the sūtras and accepting their maintenance refers to the two major chapters on the two rewards and adornments, the two major chapters on precisely clarifying the practice of the Dharma, and the names of the buddhas refers to the six names cited in the first section of the third chapter on encouraging faith in the Buddha.",
        "source": "X22n0420_003:0535b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】示義聞持中聞即耳根受即意識持即奉行總聞思修三慧也文中指前三大章其義易領。",
        "translation": "[Commentary] This shows the meaning of 'hearing and retaining,' in which hearing is the auditory faculty, receiving is the consciousness, retaining is the practice of the three kinds of wisdom of hearing, contemplating, and cultivating. The text refers to the first three major chapters, the meaning of which is easy to grasp.",
        "source": "X22n0420_003:0535b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次得益中。",
        "translation": "Commentary] Next, in \"Benefits.",
        "source": "X22n0420_003:0535b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸善男子善女人皆為一切諸佛共所護念皆得不退轉於阿耨多羅三藐三菩提。",
        "translation": "These good sons and good women are all jointly guarded by all the buddhas, and they all attain irreversibility and unsurpassed perfect enlightenment.'",
        "source": "X22n0420_003:0535c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】諸佛護念直至菩提。",
        "translation": "[Commentary] The buddhas guard and think about them until they reach enlightenment.",
        "source": "X22n0420_003:0535c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】得益中初至果號正釋護念薄下推護念之因初中初句標文諸下疊釋。",
        "translation": "[Commentary] The first part of the benefit is to explain the reason for the weakness of mindfulness under mindfulness of protection, and the first part is to label the text and explain it superfluously under them.",
        "source": "X22n0420_003:0535c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】護謂覆護不使魔嬈念謂記念不令退失。",
        "translation": "[Commentary] To guard means to cover and protect against harmful influences, and to be mindful means to remember and not let it slip away.",
        "source": "X22n0420_003:0535c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】勢至章云十方如來憐念眾生如母憶子。",
        "translation": "[Commentary] The chapter on Sizi says that the tathāgatas in the ten directions have compassion for sentient beings like a mother remembering her child.",
        "source": "X22n0420_003:0535c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】大論云譬如魚母若不念子子即壞爛等。",
        "translation": "[Commentary] The great treatise says, \"It's like the mother of a fish who doesn't think of her child, and the child will spoil and rot.",
        "source": "X22n0420_003:0535c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】言護念者不出慈悲二心護故不令魔嬈大悲也念故不令退失大慈也魔有四種五蘊魔煩惱魔死魔天魔今言嬈者且指天魔引經論二喻雖異其義一也。",
        "translation": "[Commentary] He who says he's mindful doesn't stop at the two minds of compassion and pity. He protects so he doesn't cause Māra to be sullied, and he's mindful so he doesn't cause Māra to regress from his great compassion. There are four kinds of Māra, the five aggregates, the Māra of affliction, the Māra of death, the Māra of heaven, and he says he's sullied because he's referring to the Māra of heaven.",
        "source": "X22n0420_003:0535c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】阿耨多羅此翻無上三藐云正等三菩提云正覺即佛果號。",
        "translation": "[Commentary] *Anavatapta translates this as unsurpassed samyak-saṃbodhi cloud correct enlightenment cloud correct awakening which is the Buddha's fruit title.",
        "source": "X22n0420_003:0535c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】阿下翻梵莫非果上三德無上即法身超出一切故正等即般若之智不偏空有故正覺即解脫之用覺圓滿故。",
        "translation": "[Commentary] *Ahasta translates Brahmā as the fruit of the unsurpassed three virtues, which is the Dharma body, transcends all things, so correct equivalence is the wisdom of prajñā, which isn't biased toward emptiness and existence, so correct awakening is the fulfillment of the awakening that is the function of liberation.",
        "source": "X22n0420_003:0535c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】薄地凡夫業惑纏縛流轉五道百千萬劫。",
        "translation": "[Commentary] Weakly grounded mortals are bound by karma and delusion and roam the five destinies for a hundred million eons.",
        "source": "X22n0420_003:0535c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】推因中初四句敘昔迷即三道流轉薄音博逼也。",
        "translation": "[Commentary] The first four phrases in the deduction of cause describe past misunderstandings, namely, the three destinies of transmigration, and the thin sound of the harshness of oppression.",
        "source": "X22n0420_003:0535c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】忽聞淨土志願求生一日稱名即超彼國諸佛護念直趣菩提。",
        "translation": "[Commentary] Suddenly, when he hears about the Pure Land and wishes to be born there, he calls it by its name one day, and that's when he transcends the buddhas of that country, protects his mind, and goes straight to enlightenment.",
        "source": "X22n0420_003:0535c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】忽下今修感佛正顯護念之意。",
        "translation": "[Commentary] Suddenly, the following present practice inspires the buddhas to precisely show the meaning of mindfulness.",
        "source": "X22n0420_003:0536a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】可謂萬劫難逢千生一遇誓從今日終盡未來在處稱揚多方勸誘。",
        "translation": "[Commentary] It can be called a rare occurrence of a thousand eons and a once-in-a-thousand lifetimes, and he vows to praise and encourage them everywhere from this day until the end of the future.",
        "source": "X22n0420_003:0536a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】可下疏主慶願初六句立願修因在處讚揚自行也多方勸誘化他也。",
        "translation": "[Commentary] It's possible that the first six phrases of the commentary's main vow of celebration establish the cause for cultivating the vow, praise oneself here, and encourage and induce others in many ways.",
        "source": "X22n0420_003:0536a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所感身土所化機緣與阿彌陀等無有異。",
        "translation": "[Commentary] There's nothing different about the body that's sensed, the land that's transformed, and the abilities and conditions of Amitâbha and so forth.",
        "source": "X22n0420_003:0536a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】所感下四句祈果。",
        "translation": "[Commentary] The next four sentences pray for the result of that which is felt.",
        "source": "X22n0420_003:0536a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此心罔極唯佛證知。",
        "translation": "[Commentary] This mind is inexhaustible; only the Buddha knows it.",
        "source": "X22n0420_003:0536a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】此下二句結願求證。",
        "translation": "[Commentary] The next two sentences here conclude the vow to realize it.",
        "source": "X22n0420_003:0536a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】是故下三勸信。",
        "translation": "[Commentary] Therefore, the next three encourage faith.",
        "source": "X22n0420_003:0536a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故舍利弗汝等皆當信受我語及諸佛所說。",
        "translation": "Therefore, Śāriputra, you must all believe and accept my words and the teachings of the buddhas.",
        "source": "X22n0420_003:0536a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】信我語者謂信教也如不信我十方諸佛豈虗妄乎。",
        "translation": "[Commentary] Believing my words means believing the teaching. If you don't believe me, how could the buddhas in the ten directions be false?",
        "source": "X22n0420_003:0536a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】勸信中信即能信之心教即所信之法通指此經正宗行法也經中雙勸一信釋迦自語二信諸佛稱讚。",
        "translation": "[Commentary] The exhortation to believe is to believe in the mind, the teaching is to believe in the Dharma, and it refers to the correct practice of the sutra. The sutra contains a dual exhortation to believe in the words of Śākyamuni and to believe in the praises of the buddhas.",
        "source": "X22n0420_003:0536a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次三時因果中初正示是故下二結勸。",
        "translation": "[Commentary] The next three periods of cause and effect begin with a correct statement that this is the reason, and the next two conclude with an exhortation.",
        "source": "X22n0420_003:0536a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "First, there's the conclusion of the exhortation.",
        "source": "X22n0420_003:0536a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗若有人已發願今發願當發願欲生阿彌陀佛國者是諸人等皆得不退轉於阿耨多羅三藐三菩提於彼國土若已生若今生若當生。",
        "translation": "\"Śāriputra, if someone has made a vow and now makes a vow that they will make a vow to be born in Amitâbha's land, then those people will attain irreversibility and unsurpassed, perfect enlightenment, and will be born in that land if they've been born, are born, or will be born.",
        "source": "X22n0420_003:0536a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】已即過去今即現在當即未來。",
        "translation": "[Commentary] Past is past, present is present, and future is future.",
        "source": "X22n0420_003:0536a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】發願是因生即是果三因三果別對可知。",
        "translation": "[Commentary] The arousal of the vow is the cause, and birth is the effect. The three causes and three effects can be distinguished and understood.",
        "source": "X22n0420_003:0536a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】三時因果中願因生果皆約三世言別對者已願已生今願今生當願當生。",
        "translation": "[Commentary] Among the three periods of cause and effect, the cause of vowing and the result of birth are all discussed in terms of the three worlds, and those who say they've vowed and have been born, vow now and will be born, and vow to be born in the future.",
        "source": "X22n0420_003:0536a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】欲顯淨土唯恐無願有願必生定無漏失。",
        "translation": "[Commentary] In order to show the Pure Land, we must fear that if there's no vow, then a vow will surely give rise to no loss.",
        "source": "X22n0420_003:0536a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】欲下正示經中發願引生之意有願必生者華嚴云唯此願王不相捨難於一切時引導其前一剎那中即得往生極樂世界上示得生。",
        "translation": "[Commentary] Desire is the next step in showing the sutra's intention of arousing the vow to lead to birth.",
        "source": "X22n0420_003:0536a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】十疑論云生彼國已悉得無生未有一人退落三界為生死業縛等。",
        "translation": "[Commentary] The Treatise on the Ten Doubts says that after birth in that country, all attain nonproduction, and no one ever falls back into the three realms bound by the karma of birth-and-death.",
        "source": "X22n0420_003:0536b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】十下引論顯生已不退三界生死業縛者以此土進修有退墮之失而顯淨土惟不退也。",
        "translation": "[Commentary] The ten lower-level treatises show that those who have been born haven't fallen back into the bondage of birth-and-death karma in the three realms because there's a loss in further cultivation in this land and it shows that in the Pure Land there's no falling back.",
        "source": "X22n0420_003:0536b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】次結勸中。",
        "translation": "Commentary] In the next section, he concluded his exhortation.",
        "source": "X22n0420_003:0536b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故舍利弗諸善男子善女人若有信者應當發願生彼國土。",
        "translation": "Therefore, Śāriputra, good men and good women who have faith should make the vow to be born in that land.",
        "source": "X22n0420_003:0536b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若有信者簡彼不信任不發願自甘塗炭是誰之咎。",
        "translation": "[Commentary] If someone has faith, then who's to blame for not trusting them and not making the vow to be left in the dust?",
        "source": "X22n0420_003:0536b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】結勸中佛法大海信為能入智為能度經乃化誘之教信與不信任彼機緣自甘塗炭者以不信之失反顯能信之益泥塗火炭喻三惡道。",
        "translation": "[Commentary] In the concluding exhortation, the great ocean of the Buddha's teaching is faith as an agent of entry, wisdom as an agent of salvation, and the sūtras are teachings that induce faith and distrust of the other's opportunities.",
        "source": "X22n0420_003:0536b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三諸佛互讚中二段初我讚諸佛彼下諸佛贊我。",
        "translation": "First, I praise the buddhas, and second, the buddhas praise me.",
        "source": "X22n0420_003:0536b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初文。",
        "translation": "△In the beginning, the text says.",
        "source": "X22n0420_003:0536b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗如我今者稱讚諸佛不可思議功德。",
        "translation": "\"Śāriputra, I now praise the unfathomable virtues of the buddhas.",
        "source": "X22n0420_003:0536b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如我今者等即指前科六方勸信。",
        "translation": "[Commentary] Thus I am now refers to the previous section's encouragement of faith in six directions.",
        "source": "X22n0420_003:0536b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】諸佛互贊中初我贊諸佛疏指前六方勸信且六方如來乃勸眾生信受釋迦所說經文皆是釋迦贊於彌陀今云稱贊諸佛者蓋諸佛雖各各於國稱贊釋迦此土眾生無有知者仍是釋迦顯示故反為贊諸佛也。",
        "translation": "[Commentary] Among the mutual praise of the buddhas, the first one, I praise the buddhas, refers to the previous six exhortations to faith, and the tathāgatas in the six directions are all exhorting sentient beings to believe and accept the sūtras taught by Śākyamuni, which praise Maitreya.",
        "source": "X22n0420_003:0536b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二中又二初出彼讚詞當知下二顯示誠實。",
        "translation": "[Commentary] There are two more in this series. First, he praises them, and second, he shows their sincerity.",
        "source": "X22n0420_003:0536b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△初中。",
        "translation": "First, there's the praise of the buddhas.",
        "source": "X22n0420_003:0536b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼諸佛等亦稱說我不可思議功德而作是言釋迦牟尼佛能為甚難希有之事能於娑婆國土五濁惡世劫濁見濁煩惱濁眾生濁命濁中得阿耨多羅三藐三菩提為諸眾生說是一切世間難信之法。",
        "translation": "Those buddhas also praised me for my unfathomable virtue and said that Śākyamuni Buddha could do something rare and difficult that would enable sentient beings to attain unsurpassed, correct, and complete enlightenment in the midst of the five turbid and unwholesome eons and turbid views, turbid afflictions, and turbid lives of sentient beings in the sahā land.",
        "source": "X22n0420_003:0536b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】釋迦翻能仁即大慈垂應牟尼翻寂默即妙智冥真合此為佛則三身備矣。",
        "translation": "[Commentary] Śākyamuni translates it as capable of benevolence, which is great kindness, and he translates it as silence, which is marvelous wisdom, insight, and truth.",
        "source": "X22n0420_003:0536c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】贊我佛號中釋迦姓也牟尼名也二皆翻梵成華即顯法報應三身大慈垂應應身也妙智報身世冥真法身也。",
        "translation": "[Commentary] Among the praises of our Buddha name, Śākyamuni's surname and Muni's name are both translated from Brahmā into flower, which reveals the three bodies of Dharma-reward, great compassion, pliancy, and response body, and marvelous wisdom, the reward body, and the worldly, mysterious, and true Dharma body.",
        "source": "X22n0420_003:0536c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】佗不能為故甚難舉世未見故希有。",
        "translation": "[Commentary] It's difficult because it can't be done, and rare because it hasn't been seen in the world.",
        "source": "X22n0420_003:0536c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】下列二難於此惡世修行成佛一難也為諸眾生說此法門二難也。",
        "translation": "[Commentary] The following two difficulties are the first difficulty in cultivating enlightenment in this bad world and the second difficulty in teaching this teaching to sentient beings.",
        "source": "X22n0420_003:0536c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】甚難總示中世間一切智用不為甚難希有於惡世中得道證聖又能開示眾生往生法門可為甚難可為希有。",
        "translation": "[Commentary] It's extremely difficult to explain in a general way that all the uses of wisdom in the world aren't extremely difficult and rare, and it's extremely difficult and rare to reveal to sentient beings the Dharma entry to rebirth in a bad world.",
        "source": "X22n0420_003:0536c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初中娑婆亦云索訶此翻堪忍。",
        "translation": "[Commentary] In the junior high school, svāhā is also called sohā, which is translated as tolerant.",
        "source": "X22n0420_003:0536c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】娑婆梵語二名奢切之異同翻堪忍。",
        "translation": "[Commentary] The difference between the Sanskrit term svāhā and the Sanskrit term sahā is the same as the translation can endure.",
        "source": "X22n0420_003:0536c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】悲華經云是諸眾生忍受三毒及諸煩惱故。",
        "translation": "[Commentary] The Compassionate Flower Sutra says that it's because sentient beings endure the three poisons and various afflictions.",
        "source": "X22n0420_003:0536c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】引二經釋義單複不同初即眾生深著濁惡甘忍眾苦。",
        "translation": "[Commentary] The interpretations of the two sūtras are simply different. The first is that sentient beings are deeply addicted to impurity and evil, and they willingly endure suffering.",
        "source": "X22n0420_003:0536c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】準佛剎經有二義初義同上二云彼有行菩薩乘者成就忍辱將護有情善自調伏若人加害悉能含忍終不放逸故云堪忍。",
        "translation": "First, it means the same as the above; second, it says that there are those who practice the bodhisattva vehicle who accomplish forbearance, protect sentient beings, and skillfully subdue themselves if others inflict harm, and are always able to endure it without ever faltering.",
        "source": "X22n0420_003:0536c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】次即菩薩化他成就忍智或遇違逆大慈悲心終不棄捨。",
        "translation": "[Commentary] Second, it means that the bodhisattva has accomplished the knowledge of forbearance when teaching others, and when faced with disobedience, his mind is filled with great compassion and he never abandons it.",
        "source": "X22n0420_003:0537a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】五濁亦云五滓又言惡者謂能具造十惡業故。",
        "translation": "[Commentary] The term \"five turbidities\" also refers to the five dregs, which are the ten bad activities that can be created together.",
        "source": "X22n0420_003:0537a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】五濁中濁則不清淨滓則雜穢惡則不善以惡業不清淨故名濁滓稜嚴云譬如砂土投於清水土失留礙水亡清潔汩然渾濁。",
        "translation": "[Commentary] Of the five turbidities, turbidity is impurity, dregs are defilement, and bad is unwholesome because bad actions aren't purified, so they're called turbidities.",
        "source": "X22n0420_003:0537a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】劫者梵云劫波此翻時分下四濁聚在此時從減劫人壽二萬歲時即入劫濁。",
        "translation": "[Commentary] Kāśyapa is the Sanskrit word for kalpa, which translates as the time period when the next four turbidities are present, from the time of the decreasing eon to the time of life of 20,000 years, which is when they enter kalpa turbidity.",
        "source": "X22n0420_003:0537a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】見者身見邊見邪見戒取見取五利使也。",
        "translation": "[Commentary] Seeing is the five beneficial tendencies of personal views, extreme views, mistaken views, and views of attachment to precepts.",
        "source": "X22n0420_003:0537a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】煩惱者貪嗔癡慢疑五鈍使也。",
        "translation": "[Commentary] Affliction is the five dull tendencies of greed, anger, delusion, and doubt.",
        "source": "X22n0420_003:0537a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】眾生者攬陰為人假名眾生。",
        "translation": "[Commentary] 'Sentient beings' means to embrace the aggregates as people and nominally name them sentient beings.",
        "source": "X22n0420_003:0537a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】命者剎那生滅催年促壽。",
        "translation": "[Commentary] Life is the moment-to-moment birth and extinction that hastens years and prompts longevity.",
        "source": "X22n0420_003:0537a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】劫波翻時分悲華經云人壽六萬歲百年減一年至三萬未得為濁二萬歲時濁之始也釋迦出世人壽百歲濁可知矣劫濁為總四種為別二三總於利鈍十使身見者於名色陰入界中妄計故邊見者執偏之心不履中故邪見者邪心取理作闡提行故戒取者外道邪戒或雖佛戒偏心堅執故見取者謬見涅槃故引取無厭曰貪忿怒無慈曰嗔迷惑不了曰癡自恃輕他曰慢迷心乖理猶預不決曰疑前五體輕易斷故名利後五重濁難斷故名鈍四即五蘊法聚為眾生假名五中催年促壽者新新生滅報限不久故悲華又云寂意菩薩問佛其餘諸佛所有世界清淨微妙今我世尊何因緣故處斯五濁惡世成等正覺佛言吾以大悲願力故取此弊惡不淨土耳。",
        "translation": "[Commentary] The kalpa is a translation of the time period. The Compassionate Flower Sutra says that life is 60,000 years and a hundred years minus one year to 30,000 unobtainable years as turbidity.",
        "source": "X22n0420_003:0537a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第二難中念佛法門。",
        "translation": "[Commentary] The second difficulty is the mindfulness of the Buddha's teaching.",
        "source": "X22n0420_003:0537b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】二說法難中初至往生顯法妙收機初二句疊法。",
        "translation": "[Commentary] In the second difficulty of teaching the Dharma, the first arriving at rebirth reveals the Dharma's wondrous capacity to receive the first two phrases, which superimpose the Dharma.",
        "source": "X22n0420_003:0537b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】不簡愚智不擇豪賤不論久近不選善惡。",
        "translation": "[Commentary] It's not simply foolish or wise, not choosing the great or the poor, regardless of how long or short it's been, and not choosing the good or bad.",
        "source": "X22n0420_003:0537b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】不下四句所攝之機愚智則性有利鈍貴賤則報有強弱久近則功有淺深善惡則行有好醜。",
        "translation": "[Commentary] Without going down four sentences, the capacity that's included is foolish and wise, favorable and dull, noble and base, and the reward is strength and weakness.",
        "source": "X22n0420_003:0537b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】唯取決誓猛信臨終惡相十念往生。",
        "translation": "[Commentary] The only thing that's taken is the determined vow, fierce faith, and ten recollections of rebirth at the end of the bad phase.",
        "source": "X22n0420_003:0537b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】唯下三句感生行相臨終惡相即觀經下品下生地獄眾火一時俱至等十念往生即下生中具足十念等。",
        "translation": "[Commentary] The only thing that the following three phrases bring about is the conduct of birth, the evil marks at the end of life, which are the result of observing the sutra's lower level, lower birth, hell's many fires, and so forth, and the ten recollections of rebirth, which are the ten recollections that are replete in lower birth.",
        "source": "X22n0420_003:0537b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此乃具縛凡愚屠沽下類剎那超越成佛之法可謂一切世間甚難信也。",
        "translation": "[Commentary] This is the Dharma of transcending all mortals, fools, butchers, and lower classes into Buddhahood in a single moment, which can be considered very difficult for all the world to believe in.",
        "source": "X22n0420_003:0537b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】此則正顯難信之意具縛者三惑全在故屠謂宰殺沽即酤賣如此惡人止由十念便得超往豈非難信。",
        "translation": "[Commentary] This shows precisely what is meant by difficult to believe: \"Fettered\" means the three mental disturbances are all present, so butchering means to slaughter, selling means to sell, and such a bad person can transcend into rebirth simply by being ten mindful.\" Isn't that difficult to believe?",
        "source": "X22n0420_003:0537b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】二顯實中。",
        "translation": "[Commentary] Second, it shows the truth.",
        "source": "X22n0420_003:0537b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知我於五濁惡世行此難事得阿耨多羅三藐三菩提為一切世間說此難信之法是為甚難。",
        "translation": "Śāriputra, you should know that it's very difficult for me to perform this difficult task in the five turbid bad states and attain unsurpassed, correct, and complete enlightenment, and to explain this difficult-to-believe teaching for all the world.",
        "source": "X22n0420_003:0537b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】承前二難則彰諸佛所讚不虗意使眾生聞而信受。",
        "translation": "[Commentary] Following the previous two difficulties, this will make clear that the praises of the buddhas are not inauthentic in their intent to cause sentient beings to hear and believe them.",
        "source": "X22n0420_003:0537b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】顯實中據經二難皆順世情言之後稱甚者以濁惡成佛之難校其念佛少善能生極樂淨土尤為甚也。",
        "translation": "[Commentary] In the manifestation of the truth, according to the sūtras, the two difficulties are all in accord with worldly conditions, and then they're called very difficult because it's difficult to pollute evil and become a buddha, and it's especially difficult to mindfully recite the Buddha's few virtues and be born in the Pure Land of paradise.",
        "source": "X22n0420_003:0537b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】第三流通分正說既終眾喜受持展轉傳布遍於四海垂於萬世故因眾散以為流通。",
        "translation": "[Commentary] The third aspect of circulation is that it's correctly explained that after its completion, the joy of all people accepts it, it's transmitted throughout the four seas and spreads throughout the world, so it's because of the many dispersals that it's circulated.",
        "source": "X22n0420_003:0537b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】大段流通中初文八句正顯流通意一下疊釋經文初中眾喜受持即前序所列之眾徧於四海橫廣也垂於萬世竪深也因眾散為流通者他經或不同故。",
        "translation": "[Commentary] In the first eight sentences of the main circulation section, the meaning of circulation is directly expressed in the first section, followed by an explanation of the sūtra's text.",
        "source": "X22n0420_003:0537b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說此經已長老舍利弗及諸比丘一切世間天人阿修羅等聞佛所說歡喜信受作禮而去。",
        "translation": "After the Buddha taught this sūtra, the elder Śāriputra and the monks, gods, humans, asuras, and others of the world who heard what he taught rejoiced, believed, accepted, paid homage, and departed.",
        "source": "X22n0420_003:0537c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一切世間總收四部別舉三趣以決序文。",
        "translation": "[Commentary] All the worlds is collected into four divisions, and the three destinies are cited separately to determine the preface.",
        "source": "X22n0420_003:0537c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】阿修羅此翻非天受樂如天懷諂同鬼從行為名。",
        "translation": "[Commentary] This is called an asura, which is a non-god who receives pleasure like a god who harbors flattery like a ghost who follows the name of behavior.",
        "source": "X22n0420_003:0537c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】疊釋中四部即天龍神鬼前序總云無量諸天大眾今此別列天人阿修羅三眾故云以決序文前別列聲聞菩薩今此但以等字總之阿修羅翻非天釋義可見或翻無酒由於四天下廣採百華醞于大海覬其成酒以魚龍業力酒不能成因立誓斷酒故又翻無端正以形陋貌疎故大論此一趣徧於五道楞嚴具有胎卵濕化四種不同今此即上品修羅天趣所攝。",
        "translation": "[Commentary] The four divisions of the superfluous explanation are the gods, dragons, spirits, and ghosts, which are summarized in the preceding sentence as an incalculable multitude of gods.",
        "source": "X22n0420_003:0537c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】歡喜則出離有門信受乃憶持修習。",
        "translation": "[Commentary] Rejoicing then, he escapes from the gate of existence, believing and accepting it, and then recollecting and cultivating it.",
        "source": "X22n0420_003:0537c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】聞所未聞故歡喜宜得踐行故信受。",
        "translation": "[Commentary] They rejoice because they've never heard of it before, and they accept it with faith because it's appropriate to carry it out.",
        "source": "X22n0420_003:0537c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】得法閧懷仰恩荷德傾誠展敬志願流通。",
        "translation": "[Commentary] They obtain the teaching, reverently admire the blessings and merits, wholeheartedly present their respect, and vow to circulate it.",
        "source": "X22n0420_003:0537c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【記】得下四句總釋作禮而去。",
        "translation": "[Commentary] The next four sentences generally explain that he made obeisance and departed.",
        "source": "X22n0420_003:0537c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說阿彌陀經義疏聞持記卷下(終)此記足庵宗師淳熙年間撰至東方佛現通一科示疾停筆因而順寂不及全帙聞者無不嗟惜雖圓修超玄二記行世諸方講解病其文理未明罕有承用由此疏亦湮塞(余)寓疏三山慶遠庵因講次二三子有請為續其後誠故為狂簡有玷於前又豈非青蠅附於驥尾亦其一日千里也。",
        "translation": "The Foshuo Amitâbha jing yishu wenchi ji vol. 2 (end) This record was written by Zong Shi Suoan during the Chunxi period until the Dongfang Fo xintong yike showed his illness and stopped writing, thus Shunji didn't have the whole book and everyone who heard it regretted that even though the two records of Enshu Chaoxuan were handed down to the world, the lectures and interpretations in various directions were sick, the text and principle were not clear, and there were few takers.",
        "source": "X22n0420_003:0538a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "嘉定丁丑上春中澣石皷(法久)誌(大宋國慶元府定海縣太丘鄉安期管三山里居住奉佛抲仲瑜妻王氏百二十四娘妙一暨家春等捨官會三十貫命工刊此記文全帙功德保安家眷成就吉祥現生福壽彌高臨終往生安養四恩三有法界冤親俱出輪回同生淨土大歲丁丑嘉定十年四月既望日誌)。",
        "translation": "Jiading Dingchou Shangchun Zhongchuan Shiku (Fajiu) Zhi (Da Song Guo Qing Yuanfu Tinghai County Taichou Township Anqiu Guan Sanshan Lane residence Fengfo Xian Zhongyu wife Wang Shi one hundred twenty-four niang Miaoyi and Jiachun etc. will be 30 kun ordered to publish this record text full book merit security family members achievement of auspicious present life fortune life Miagao approaching the end of life reborn in peace four blessings three existences Dharma realm injustice relatives all out of reincarnation born in the same pure land great year Dingchou Jiading ten years April both hope diary).",
        "source": "X22n0420_003:0538a12_1",
        "is_bad_quality": false
    }
]