[
    {
        "source_sentence": "毗盧遮那成佛神變加持經義釋卷第十一沙門　一行　述記字輪品第十佛復告金剛手者前者金剛手所問佛已次第答之前文有所未周者今更為說故告令諦聽也有法門名遍一切處彼菩薩字位住處住此字一切所作諸事皆得成就者即此字輪法門是遍一切處法門也菩薩若住此字輪法門者始從初發妙菩提心乃至成佛於是中間所有一切自利利佗種種事業由入此法門故一切皆得成就無有罣礙也又上來所說阿闍棃住於佛地者義由未了謂此中字門即是也最初阿字即是菩提之心若觀此字而與相應即是同於毗盧遮那法身之體也謂觀此阿字之輪是猶如孔雀尾輪光明圍繞行者而住其中即是住於佛位也(更問)此字輪當作三重於中而置阿字餘字眷屬在外也又此阿字有五種又每字輪初先有三重歸命三寶真言之心謂阿()字娑(上)()字嚩字即是顯三部義也阿()字是如來部娑()字是蓮華部嚩字是金剛部每三部隨五字輪而轉隨義相應也前言漫荼羅今云輪者即是漫荼羅義前者壇法中心是大日如來即同此中阿字北邊置蓮華及諸眷屬皆在一處即是此中之娑字南邊置執金剛及諸眷屬即是此中之嚩字也今從阿字而更生四字即是大悲胎藏之葉也從一字轉生多字故名為輪也行者已發第一阿字即是菩提心體次有迦佉誐伽仰等五音皆取四字(各除第五聲)次又取也()囉()乃至乞灑(〔二合〕)()皆是男聲悉入阿字輪也行者已發菩提心當進修如來之行故次明阿(去聲)()字輪是行也其三部者謂三字是也次迦字乃至乞叉亦皆傍角加點用為阿(〔去引〕)字輪也既已具足如來之行則成菩提故次明暗字輪也此三部也此阿上有點是大空義由此菩提之心離一切諸相即名諸佛是成菩提也此迦字乃至乞灑皆上加一點為暗字輪也已成菩提當至何所謂大涅槃故次而明噁字輪也三部也如迦乃至乞叉皆傍加二點即涅槃輪也其惡(引)字一字是方便輪所以此中無也此是釋迦佛輪也(羯磨部遍入一切輪故無別壇瑜伽云爾)凡字輪大為三分初阿字即為一分次迦字乃至二十字為第二分也次也字乃至訶字為第三分除去乞叉字由此字已重故也(謂有迦娑二聲故重也)以上皆是智慧字也次有伊(上)伊(〔去〕)鄔(上)烏翳愛惡奧八字加此八字即成就三昧皆是三昧聲也亦隨五輪而轉其義可知次有誐(魚可反)若(而可反)吒囊(上)莫(慕可反)此字遍一切處謂遍於定慧中也然此五字亦隨五輪而轉謂加傍畫加上圓點或加傍二點等此五皆成五字也所謂字輪者從此輪轉而生諸字也輪是生義如从阿字一字即轉生四字謂阿是菩提心阿(長)(引)是行暗是成菩提噁是大寂涅槃噁(引)是方便如阿字者當知迦字亦有五字乃至佉()等凡二十字當知亦爾次有十二字謂伊(上)伊鄔烏嚕留盧留翳(去)愛烏奧十二字即同字上之畫謂三昧也仰壤拏曩莽亦各五字即同上頭之點也其也()囉()等八字即同字傍之點是除義也當知此字輪即遍一切真言之中若見阿字當知說菩提心義若見長阿字當知顯如來行若見暗字當知顯三菩提若見噁字當知顯大涅槃若見長噁字當知顯方便力也若見迦等二十字亦隨義類而演說之當知此諸字等皆是慧也若見囉等八字當知即同傍點亦是隨類相應也(謂囉字是無垢等也)若見伊等當知即顯三昧也若見仰等五字當知即顯大空之點也大空離一切諸相即是成佛義也若行者如是了達即能入一切陀羅尼義旋轉無礙故名為字輪也。",
        "translation": "If a bodhisattva abides in this dharma-gate of the word wheel, then from the very beginning, when he first arouses the marvelous mind of enlightenment until he becomes a buddha, all the various undertakings for self-benefit and wisdom in the interim will be accomplished without any obstruction because he enters this dharma-gate.",
        "source": "X23n0438_011:0441c07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如是祕密主字道門善法真言道住次第諸佛神力加持三藐三佛陀道善菩薩行儛者經云如是即指上字輪也如上來所說定慧空等即是佛道之門能成正覺之道也若了知字義即能住於真言之道其中次第法則證入之相階位差別亦悉曉知明達通塞無有疑滯也然此悉曇字母乃至世間童子亦常修習何能頓辨如是事耶然此諸字皆是如來以加持神力從如來內證體性而流出之故能有是不思議業用若人明解此中意趣方便即是通達三菩提道也若能通者謂達一切眾生諸根性欲當知以何法而得入道當從何門而得曉悟如是等無量無邊皆能了知而隨眾生授與妙法皆令得至如來之地也儛者如世儛兒於大眾中顯種種身業屈申俯仰又出種種微妙巧便之音曲隨眾生之所欲樂令彼大眾或令歡喜或令悲思或令恐怖以一身口所出方便令諸眾生所益不同由彼善知去就能順眾生心故菩薩亦爾現種種威儀無不成印出種種妙法皆是真言圓應無方皆得大利故名菩薩儛也。",
        "translation": "Thus is the secret lord of words, the gate of the path, the good Dharma, the path of true speech, the abiding sequence, the Buddha's supernormal power, the empowerment of Samantabhadra, and the good bodhisattva practice. The sūtras say thus refers to the above word wheel, and as the above explains, concentration, wisdom, emptiness, and so forth are the gate of the Buddha's path, the path to becoming perfectly enlightened.",
        "source": "X23n0438_011:0442c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三世如來皆作此說已說今說當說者如是字門真言淨道十方三世諸佛道同皆如是普現色身以種種門開示佛道同彼儛伎曲順人情也無彼我者我以佛眼遍觀三世一切佛剎同說此門一切佛與我無異一切佛與彼諸如來亦復如是無有異說故云無彼我也此即一切佛教應當如是修之若異此者方便即不具也以是故者是如來結成彼義而告金剛手若告金剛手當知即是告一切大會也謂彼真言行菩薩若欲逮得古佛之法者應當修學如是遍一切處法門勤心聽聞思惟修習由此之故或能一生之中得同一切如來種種儛戲歌詠而悅眾生也初中後相加者謂阿等五字為初迦等二十字為中囉等八字皆是傍點伊等十二字皆是上畵仰等五字皆是上點此諸字皆是助成字義故名後別也凡迦遮吒多波等皆屬阿字門阿字是菩提心此中初中後相加者如阿字單是菩提心若傍角加畫即是行阿(〔去引〕)此是菩提心并也行若上加點者暗即是菩提心并大空離一切相成菩提也若阿字傍加二點即是菩提心并除一切障得涅槃也佗皆倣此而轉相加或但一義或二義或三義可知也或有阿字上雖無點而其次有字是重字有其仰壤拏曩莽等聲以此連前即是暗字也所以爾者此仰等是點用加於前即阿字成暗音也或阿字無點其次有重字有也如迦佉伽伽重加四字用仰字為點遮車闍社字用壤字為點也佗倣此囉等聲以配於前即成噁字所以然者也囉等皆是傍二點令以連前阿字即成噁聲也(更宷問)夫法體無言離諸分別戲論然一切如來以自在加持神力故成此字輪故能作如來事利益群品也迦遮吒哆跛三昧品證菩提心行佛授與并涅槃此等說字等相加有真言教初中後俱(此是經文已釋文竟)。",
        "translation": "The tathāgatas of the three times all make this statement, and it has been stated, it will be stated, that this is the gate of words, the true speech, the pure path, and the path of the buddhas of the ten directions and three times are all the same, that is, they all universally show their bodies, reveal the Buddha's path with various teachings, and conform to the human condition with their personalities, and that there is no self who observes all the buddhas of the three times with the Buddha's eye and shares this statement, that all the buddhas and I are not different, and that all the buddhas and tathāgatas are likewise, and there is no difference between their teachings.",
        "source": "X23n0438_011:0443a05_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如是知隨意持誦者決意一一句用之知覺識授與句無上殊勝者如是知者知即是一切智智名之差別若行者如是了知字輪之義即能隨彼所欲皆得成就以要言之所謂一切皆隨意成者謂成如來一切智智也若成此者即是同於法王於一切法中而得自在亦得隨本所願為一切眾生開淨知見令得佛慧也何人得此利益謂如理具緣善持誦者故次云持誦者也又誰得此決定意耶謂有智慧之人善覺了識知字輪義故隨於阿等諸字一一字門隨所修行決定皆成菩提之果勿生疑惑也此中覺知何法謂如阿字是菩提心加點即是菩提行加於大空即是成佛也若菩提心清淨除一切葢障即是大般涅槃更無佗義也如是等一一通達了知即是受得無上殊勝之句無上句即是成菩提也此無上菩提之心即是諸佛自然之智實無有能授與之者但行者方便具足善知字輪之義自然得之即是授與無上菩提也。",
        "translation": "Those who thus know and recite it at will are those who are determined to use it one by one, knowing that awareness, consciousness, the phrase conferring it, and the unsurpassed superiority. Those who thus know know that this is the difference between the name of the wisdom of all knowables and that if practitioners thus understand the meaning of the word wheel, they can achieve whatever they want.",
        "source": "X23n0438_011:0443b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是一輪輪轉字輪知持誦者常明世間如世尊毗盧遮那轉輪者如世間之輪若旋運之時不可知是終始之際無有邊際不可窮盡當知此一一字輪亦復如是從阿字旋轉出生諸字此字輪即遍一切真言名字之中回轉總持無有邊際不可盡原遍一切處即是百千萬億旋轉陀羅尼也行者若能如是了知字輪之義則能以此常明而照世間常住之明即是大日如來之體同彼毗盧遮那而轉法輪也此中常明即是大慧日也此日即是菩提心阿字之體無生無作無有變易非由造成如是常住實相之慧故名常明也若行者勤功久修無有懈退者決定得之也然如上來所說漫荼羅方軌法用散華灌頂乃至及或授以明鏡如以金錍決其眼瞙如是等皆為創發菩提心者以方便加持次第法用成彼堅固之心作入佛法之階漸然此中祕旨在於字輪也所以者何若行者為人作阿闍棃欲造立漫荼羅者先須住於世尊之位謂以此諸字門而合集成身即是同於佛也謂瑜伽阿闍棃觀行成就隨心所作任運皆成觀此字輪遍布身分猶明見故即同於佛與佛同位也然布字時當分為四分即是四重漫荼羅也頭為初分是阿字菩提心位從迦()佉()伽()殑()仰()等乃至奢()娑()訶()凡是第一聲者皆屬菩提之心也當從行者眉間白毫相處而觀迦字從佉以下當右旋逐日而轉以次一帀布之令環轉相接次從咽以下為第二分屬長阿字門亦當中與白毫上下相直右行布之一帀相接此是菩提行也次從心以下為第三分屬暗字亦從心上布於暗字以次右旋一帀相接次從臍以下屬噁字門是大涅槃亦從中而置噁字以次右旋一帀令遍也頭為上分咽心為中分臍為後分(私謂發菩提心為初行果為中大寂為後也)其第五噁(引)字遍一切處隨意所作皆得也此在身外如佛身光隨意而用不在身內布字之位也迦字亦爾與阿同也師既如是成身已其漫荼羅亦如是布之亦當想弟子令如是作之三事皆成是名祕密漫荼羅也若不了達此中意趣雖依前事法而作不名善作虗費功夫亦無所成也又此布字之法是祕密漫荼羅自非久習真明之行堪傳授者方以意相傳不可以文載也故師以口相授經所不說但云如毗盧遮那輪轉也。",
        "translation": "If he thus understands the meaning of the word wheel, then he can use this constant insight to illuminate the world as the Bhagavān Vairocana does. The turning wheel is like a worldly wheel that when it revolves can't be known to be the beginning or end, has no limit, and can't be exhausted. You should know that this one-by-one word wheel also thus produces words from the revolving word a. This word wheel, which pervades all the names of true words, revolves and is held in total without limit or exhaustion, and pervades all places, which is a hundred thousand million revolving dhāraṇīs. If the practitioner can thus understand the meaning of the word wheel, then he can use this constant insight to illuminate the world's eternally abiding insight, which is the body of the Tathāgata Mahāvairocana, and the turning wheel of the Dharma in the same way as the Bhagavān Vairocana.",
        "source": "X23n0438_011:0443c05_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "復次行者須知諸字之色謂初阿字及迦等二十五字及也囉乃至訶字皆屬於阿作其黃色所謂金剛色也第二阿(去)(引)字轉作黃白色所謂寂靜色也阿字體黃三昧為白二色合故黃白也第三加點者亦作黃白色暗字也阿字黃大空白故黃白也惡()字第四次惡()字輪作黃黑色阿字黃二點涅槃色黑故黃黑也亦可二點是降伏義猶如涅槃壞滅摧破一切障法此亦如是故二點作黑也惡(引)字第五惡(引)字者阿字體黃上角點即白傍即黑當知即有種種雜色也凡布漫荼羅亦為三重第一重迦字乃至訶周帀內重名為金剛輪也此金剛輪持一切法猶如世中金剛之輪持於世界也即是行者最初菩提心輪謂欲堅固菩提心故先作內重也次第二輪謂此是長阿(引)及暗二輪同是中分若用字為輪即不須置字輪若用字為輪即不須用字輪也(私謂是行是因是證是果也)次第三輪用噁字輪亦從中如上布之令環合也其伊等十二字在外散布猶如光焰也此即是三轉法輪之義也如是布已持誦者即成持明之身猶如大日如來神力加持等無有異此輪亦名因緣輪也師及弟子并漫荼羅輪皆作如是祕密之輪又此諸字即是真言之輪故凡有四種輪也又字輪者梵音云噁剎囉輪噁剎囉是不動義不動者所謂是阿字菩提心也如毗盧遮那住於菩提心體性種種示現普門利益種種變現無量無邊雖如是垂迹無窮無盡然實常住不動亦無起滅之相猶如車輪雖復運轉無窮而樞中未甞動搖由不動故能制群動而無窮極也此阿字亦復如是以無生故即無動無退而生一切字輪轉無窮是故名不動輪也若行者能了達如是不動之輪而布諸明以其字體自然身有所表無非密印口有所說皆是真言凡有見聞觸知之者皆必定於無上菩提所成福利真實不虗也若能如是即同毗盧遮那而作佛事常照世間也凡行者持誦時當觀字輪或為句輪所謂句輪者觀本尊心心上有圓明而布真言之字輪轉相接令明了現前持誦時觀此字猶如白乳次第流注入行者口或注其頂相續不絕遍滿其身乃至遍於支分其圓明中字常明了如常流水而無有盡如是持誦疲極已即但住於寂心謂觀種子字也其觀法如上已具說之若得見種子字已即從種子字中而現本尊也如是成已即能遍布字輪轉而成持明之體方堪作諸事業也如阿字是不動義是金剛體凡欲令事堅固不動或令若自若佗道心不動等皆用阿字加之餘一切字亦隨事相應用之也。",
        "translation": "Furthermore, practitioners should know the colors of the words, which are first, the word a, twenty-five words like ka, and also the word rā and even the word ha, which all belong to a. They are made yellow and white, which is called the color of vajra. Second, the word a (departing) (leading) is turned yellow and white, which is called the color of quiescence. Third, the word additive is also made yellow and white, and the word dark is made yellow and white, and the word a is yellow and large and blank, which is why it's yellow and white.",
        "source": "X23n0438_011:0444b01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "祕密漫荼羅品第十一",
        "translation": "The Eleventh Chapter of the Secret Maṇḍala",
        "source": "X23n0438_011:0445a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時毗盧遮那世尊復次入一切法界如來眼界觀法界藏奮迅如來平等莊嚴藏三摩地證(現證也)法界無盡莊嚴現故以是真言行門無餘眾生界度本願滿足故者上來已說字輪品竟由祕密故凡有所說皆是如來加持神力若離如來加持神力則不可表示故名神力加持字輪品也(餘一切品皆如是釋之)已說此字輪品了次欲成就此字輪故復入三昧此中經所云者是出三昧名也一切法界者即是無相法界以佛眼等視如是法界也又祕釋者如上字輪即是諸佛法界以佛眼觀此法界當知此佛眼即是如來加持之力若離加持則不可說也法界藏者此藏梵音云俱舍是鞘義也猶如世間之刀在於鞘中此藏亦爾故以義翻也故此中云法界藏者即是如來所出之處謂一切如來處在其中也奮迅是流出義是流溢義如師子王在深窟中安住不動有時出穴頻申奮動即是其身本不動今則離其常處而動故也佛亦如是安住如來甚深密藏之中若非如來加持神力則微妙寂絕不可得示今乃示現無盡身口意種種形聲遍滿法界即是諸佛奮迅也示現如來平等莊嚴藏者此是胎藏之藏也入此法中十方三世一切如來身口意皆悉平等平等佛佛道同故名等也嚴謂莊嚴其身也即以無量佛道之門而用莊嚴法身以度眾生也即以平等法界莊嚴法身故名嚴也猶如世間眾軍之處有大幢相名之為嚴此三昧亦爾由此三昧能表示如來祕密之事故以為名也此中藏者梵音名揭訶即是流出無盡莊嚴奮迅示現不可窮竭猶如大寶之藏此平等法界藏即是如來藏義也以法界莊嚴不可窮盡猶如字輪旋轉不可窮盡故名無盡莊嚴也如來何故處此三昧然亦非無因緣正謂開示如來甚深祕要之事也故次經云以是真言門度無餘眾生界滿足本願故佛本行菩薩道時立大誓願悉令一切眾生同入如來法界之藏今者所願滿足大悲故奮迅示現而度眾生如法界莊嚴藏不可窮盡眾生界亦爾不可窮盡今欲普以真言行門平等利益咸令開淨知見究竟無餘即是所願而得滿足故云滿本願也。",
        "translation": "At that point, the Bhagavān Vairocana again entered all the realms of reality, the Tathāgata's eye realm, the Dharma realm store, and the Tathāgata's equally adorned store of samādhi realization (present realization as well), the Dharma realm's inexhaustible adornment, and thus the fulfillment of the past vows because this is the true word practice approach to the sentient beings' realms without remainder.",
        "source": "X23n0438_011:0445a04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "復次前法未具猶未具故修真言行者不得速成無上道今更決擇悉令顯現故入此定也次在定者謂佛住于三昧而現希有之事普利群生也於此定中現何等希有之事謂無餘眾生界聲門等如其意業生成就受諸果報色顯形音道果隨心說種種各各一切眾生喜令一切毛孔等法界增身出者此聲梵音亦是吼也猶如大龍出現雷音震吼一切皆悉聞之無所不遍如來吼亦如是遍於無餘有情之界此界無量聲亦普聞非如世龍則有限量也眾生界中上中下品隨以何業而得果報故云業生成熟也猶如世人受得食而未啖猶固未名為受若領受喫已乃名受彼食供也今異熟受報亦爾若稱先因而受彼果形顯色等差別萬殊音說不同意樂信解各復殊異佛以一平等妙音普稱彼心如其志意隨彼語言而示悟之發彼思覺方便開誘咸得歡喜即是三昧中未曾有瑞相也此中說種種者如聲論中義假令三音和合共表一義若義未圓則更加字令滿若四音共表一義令用三音其義已周則除一字如是隨宜加減之今此中亦如是但以一阿字門具一切義於事無不周圓故名為說非同說法之說也梵音有異更問之法界增身出者平等法界究竟寂滅無有出入之相以如來神力加持故而出無盡色身謂從佛一一毛孔中現如前吼聲又出種種形故云法界增身也其實從緣而起無生無性如是實相即同法界之體何有增加生滅耶雖緣起法體常如相然以如來加持力故從一一毛孔各現吼聲或以愞言或以麤語或深或淺稱彼心機如大海潮不過常限其身亦爾或大或小或忿怒形或以行六度或以威伏差別萬差所度有情無有錯謬也前示字輪今從法界輪中而現形聲也。",
        "translation": "Furthermore, since the previous teaching is still incomplete, those who practice the true speech can't quickly achieve the unsurpassed path. Now, he's further determined to make all of them manifest, so he enters this concentration. Next, he's in a concentration where the Buddha abides in samādhi and manifests rare things for the benefit of all sentient beings. What rare things does he manifest in this concentration, namely, the sound aspect of the sentient beings without remainder, the generation of karma according to his intention, the fruition of karma, the manifestation of form, the sound of the path, and the results of the karma, and so forth.",
        "source": "X23n0438_011:0445b16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "出已虗空等同世界中一音聲法界表如來生偈說者如虗空無有邊際此聲亦爾等同於虗空表謂表示也即是如來語表之業謂表現一切眾生皆令解悟平等法界也以此妙音而表示法界故云法界表也一音即是阿字之門輪轉無窮等虗空滿法界也三世諸佛皆從如是妙偈中生故名如來生也今佛從此一音之門而說妙偈普令無餘世界平等聞知隨類得解故以為名也如上所說字輪欲表如來功德也故佛於一一毛孔出妙音聲遍於法界說是字輪甚深之義所謂能生諸佛之偈也若有眾生了知如是字輪之義即成菩提故云一切諸佛從是生也然諸佛法身離於生滅若於如來有生即是著相夫著相者尚不能出離生死況能成大菩提今言生者是真實離相之生也以清淨法身雖離一切相然佛以加持力故用此字輪開示如來祕密內證之德由佛自在神力所加持故因此有相方便能生無相之相也猶彼未覺了時因此字輪以為方便漸能了達觀察阿字之門以入阿字門故即能究竟自在法身也。",
        "translation": "After emerging from a world where space is the same as the sound of a single sound, the Tathāgata gives rise to the verse that says, \"Just as space has no limit, this sound is also the same as the sound of space, which is the expression of the Tathāgata's verbal expression that expresses the equality of the Dharma realm in the understanding of all sentient beings.\" That single sound is the gateway to the letter a, which rotates endlessly and is equivalent to the space that fills the Dharma realm.",
        "source": "X23n0438_011:0446a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈云能生隨類形諸法之法相者謂入阿字門故即是平等法身由此無相法身故即能隨緣感應普現色身隨彼種種類形以所喜見之身而為開示如來智慧也。",
        "translation": "The verse says, \"The Dharma characteristics of dharmas that follow various forms means that they enter the letter a as-gate, which is the equal Dharma body. Because this is the markless Dharma body, it's possible to follow the perception of conditions and universally manifest form bodies, follow various forms, and reveal the Tathāgata's wisdom through the body of the person they like to see.",
        "source": "X23n0438_011:0446a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈云諸佛聲聞及諸緣覺救世菩薩勇進如佛亦然者由此無生無相之身故一切諸佛皆從是生非直諸佛從此而生一切聲聞緣覺菩薩種種行位乃至一生補處之位皆由此阿字之理而生也非直生一切聖賢之果乃至一切有情世間及器世間種種差別次第增長皆亦由此阿字義而生也故此中生者略有三種上品生者謂生如來真淨法身常住之果體次生諸佛菩薩二乘隨在何地而除彼障下品生者即有情及器世間皆亦從此法門而得成立也。",
        "translation": "The verse says, \"The buddhas, śrāvakas, and pratyekabuddhas boldly advance as buddhas also do.\" It's because of this body of no birth and no characteristics that all buddhas are born from this, not directly from this that all buddhas and śrāvakas, pratyekabuddhas, and bodhisattvas are born from this principle of the letter a. It's not directly from this that all the fruits of noble virtue and all the various ways in which the world of sentient beings and the container world grow in sequence are also born from the meaning of the letter a. There are three kinds of birth in this, and the first kind is birth into the fruit body of the Tathāgata's true and pure Dharma body that's always abiding, and the second kind is birth into the buddhas, bodhisattvas, and sentient beings at whatever place they are and remove their hindrances.",
        "source": "X23n0438_011:0446b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生住等法諸所生常者然此中所說不同外道斷常之見諸法雖從因生而生因無相雖從緣生而此緣無相雖從緣起而法本不生雖從緣起滅而無生住之相是故為常非同外道之見故說生滅斷常也。",
        "translation": "Although things that arise and abide and other things that arise are permanent, what's explained here is different from the outsider view of cutting off permanence. Although things arise from causes, they arise from causes without marks, although they arise from conditions, these conditions lack marks, although they arise from conditions, the things themselves don't arise, although they arise and cease from conditions, there's no mark of arising and abiding.",
        "source": "X23n0438_011:0446b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈云具智方便兼離不慧疑者了達阿字之輪義諸法畢竟空無所有寂滅無相之體從本不生是為慧也真言身印瑜伽等能令行人成大利益入於佛慧是方便也若依方便而無慧但有智慧而無方便終不能成不可思議自在之用要用方便及智慧具足方得入於字輪之祕藏也離不慧疑者若離如是二法當知是人為不慧人由不慧故當處處生疑不能進趣也又行者若智慧方便兼具自然離於無慧不生邪疑也。",
        "translation": "The verse \"Equipped with wisdom, skillful means, and free from unwisdom and doubt\" shows that someone who understands the meaning of the wheel of the letter a, dharmas are ultimately empty and lack existence, tranquility, and formlessness are originally unarisen, which is wisdom.",
        "source": "X23n0438_011:0446b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈云觀此道諸佛所說者非但我如是說以一切等正覺皆如是說無有差別也由十方三世佛同於此道孱然無差一相一味無異路也。",
        "translation": "The verse says, \"Those who contemplate this path as taught by the buddhas aren't just thus taught by me; they're thus taught by all the perfectly enlightened ones, with no distinctions, because the buddhas of the three times in the ten directions are united in this path, yet they are without distinctions, have one single aspect and one single taste, and have no different paths.",
        "source": "X23n0438_011:0446c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時法界生如來身一切法界自身表化雲遍滿毗盧遮那心自在諸毛孔中佛生展轉者此中法界生身即是毗盧遮那法身也以從法界真實而生故名為法界生也一切法界自身表者表謂能令一切悉知見也謂於一切法界中自身表化雲皆遍滿也謂如來身表普現色身如彼大雲遍于法界雲是遍滿義也言此化身之雲遍滿法界遍於十方世界不可限量也此中心自在者以義翻也正義云心纔謂纔斂念之頃不用功力即能如是廣大彌滿也此即顯於心得自在也諸毛孔中佛生展轉加持者猶如來纔入三昧即時頓現如是奇希之事即是如來加持神力也展轉者互相涉入也從佛身毛孔流出諸佛復從彼佛身而流出如來本尊身展轉相入一一身皆現如上神力化而復化無有窮盡也此等義當更詳之展轉加持者謂以佛自在神力之所加持此即是如上所說法界性字輪之所加持也從佛自身一一毛孔出種種身雲隨其上中下分謂頭為內胎心已上為第一院臍以上為第二院臍以下為第三院即配前圓壇四位隨彼左右前後上中下分而現本尊之身各依本位而出於世界中施作佛事從一一身展轉出作諸佛事故云展轉也時執金剛亦知佛意今佛世尊現於未曾有事非無因緣必將更說深祕之法謂如上所說有所未了遺闕者必將說之誠心希仰而住故。",
        "translation": "At the time, the Dharma realm gave rise to the Tathāgata's body, and the clouds of his own manifestation in the Dharma realm pervaded the Virocana mind, and the Buddha's birth in his pores was a manifestation of the Dharma body of the Virocana, which is called the birth of the Dharma realm because it truly arises from the Dharma realm.",
        "source": "X23n0438_011:0446c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛即更告言祕密主有造漫荼羅聖尊位分并種子作標記諦聽善哉極善作意思念吾為汝說者時佛為執金剛等現如上分位已時諸尊等既作種種佛事還從本位而入毗盧遮那如來之身亦如出時位次無異故彼經云復入法界宮也尊分位種子者如上諸尊皆是如來內證之德各從一一而表如來所顯法界甚深之趣今若有阿闍棃欲作壇是先須住於瑜伽如彼從佛身出一一位次如其形色觀已於彼心上作圓明於圓明中而觀彼種子如是一一安置方成作法若不如是者終不能加持建立彼諸法弟子亦不得阿闍棃名也如前所言煩惱種子斷已次生法界性種子即是一切有情平等種子也此平等法界性種子即是如來一切智地之所生長如世間種種艸木種種隨其性分各各差別皆依大地而得生長根莖枝葉種種不同增長大小性分各異然皆是大地之性從地而生雖種種差別畢竟皆歸於地但因緣合故而有生長然實無有自性無生無起也若眾生既蒙安立如是種子即是同於如來之位由此種子從法界性生能生法界故名法界生種子法界生者即是如來自性身也標幟者如世間種子各各差別若見小艸種子有智觀之雖未成長然已知彼性分大小所極之勢也若見眾生行如是如是因位種子亦皆如是然今種子乃是法界性之種子當知彼性必定能生如來平等智身是故名為標幟也又此漫荼羅一一分位各有種子用標記彼差別法界之門當知一一入於阿字見於內證之標即知如來內證之德故名標記也隨彼四重分位從佛出者即是佛之標幟或從菩薩分位而出或從二乘分位而出或從天龍八部分位而出當知階降差別各各差次不同也時佛告祕密主已。",
        "translation": "The Buddha then further addressed the Bhagavān, saying, \"Bhagavān, the esoteric master has created a maṇḍala of noble stages and seeds to mark. Listen closely, good, very good. Make your mind aware that I'll explain this for you.\" After the Buddha had performed various Buddha-works for the Vajras and others as described above, the venerables then returned from their original stages and entered the body of the Tathāgata Vairocana, just as they had when they emerged, so there's no difference in the order of their stages when they re-entered the Dharma-realm palace as the sūtras say.",
        "source": "X23n0438_011:0447a10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "金剛手白佛言願樂欲聞者欲為普利益一切眾生故流傳演布普為未來一切眾生亦為利益諸大眾會故請佛演說也上來雖說漫荼羅法尚未說色及種子祕要之藏故一心聽願佛演說也。",
        "translation": "Vajrapāṇi said to the Buddha, \"Those who wish to hear it and are eager to hear it want to transmit it and disseminate it for the benefit of all sentient beings and invite the Buddha to teach it for the benefit of all future sentient beings and for the benefit of the great assembly. Although the king explained the maṇḍala teaching, he hadn't yet explained the secret store of form and seeds, so he wholeheartedly listened and vowed that the Buddha would teach it.",
        "source": "X23n0438_011:0447b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次佛告意者凡阿闍棃欲建立大悲胎藏建立弟子時當先住於瑜伽而觀自身從臍以下當作金剛輪其色黃而堅次從臍以上至心當作水輪其色白次從心以上至咽當作火輪其色赤次從咽以上至頂當作風輪其色黑復次地輪正方水輪圓火輪三角風輪半月輪形最上虗空作一點具種種色在於頂十字縫上置也此是輪形正與身分相稱也此五位者即是前說五字方中置阿字圓中置[金*(离-禸+ㄆ)]字三角中置囕字半月中置憾字點中置欠字當更撿前卷中也師既自觀其身次第如是方色加持自身并觀置種子字已次觀壇地即翻倒置之最上作金剛輪金剛輪下作水輪水輪下作火輪火輪下作風輪風輪下即空輪也所以者何以一切世界皆是五輪之所依持世界成時先從空中而起風輪風上起火火上起水水上起地即是漫荼羅安立次第也壞時地種先壞乃至但有空在即是師自加持次第也(更問)今行人修道亦與此相類最初發信心次菩提心次乃至大空也(更問)其阿闍棃既如是加持已即當安置諸尊如其位次一一以瑜伽觀之如其方色形相於其心上置於圓明圓明中有種子字一一令明了無障能如是作者即是法界胎藏漫荼羅分位能令一切如來同共加持一切尊等皆悉集會共加行人建立弟子畢竟不退於菩提不然虗費功力而無益也又此瑜伽之座其黃金剛方輪即是金剛之座也方是息災圓是增益三角是降伏半月是攝召點是成辦一切事此虗空輪但用心念作之不以形相故也世界壞時亦先從風輪壞地而生於火火竟次風(更問)如是作五輪當知上下皆有虗空輪也以從空輪而生於風火水地又從地輪漸上乃至於空故上下有空也作漫荼羅時師應自觀其身及地又觀所度弟子亦當如是而安立之準於師法若不如是不名如法也。",
        "translation": "When the Buddha next tells him what he wants to do, whenever he wants to establish the womb-store of great compassion and establish disciples, he should first abide in yoga and contemplate himself as a vajra wheel from the navel down, yellow in color and strong, as a water wheel from the navel up to the heart, white in color, as a fire wheel from the heart up to the throat, red in color, as a wind wheel from the throat up to the top of the throat, black in color, as a ground wheel, square, water wheel, round, fire wheel, triangle, wind wheel, and half-moon wheel shapes, and as a dot in the utmost space, a dot in the wind wheel with various colors placed on the top of the cross-seam.",
        "source": "X23n0438_011:0447b20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "時金剛手入毗盧遮那如來身語意地界昇法界平等觀者由此菩薩能知如來身口意密故名祕密主也如來意密之法唯佛與佛乃能究了如意者當知身口亦如是今此菩薩亦能知之當知是位同大覺為欲度眾生故示為菩薩而相起發也此中身密者即是諸印如四重大漫荼羅一一本尊各有身印若觀此身印即知此尊所表祕密之德隨類上中下差別有無量種也語密者即是諸尊所有真言聞此真言即知此尊內證之德也意密者即是本尊瑜伽之觀也亦隨四重方位各各不同與此相應即入如來意密之藏也此中身語意密上從佛菩薩位及二乘諸天八部無量差別廣而論之乃至十世界微塵數各各不同略而言之如此經中所表之位皆表如來身語意祕密之德若能如實了知即同於祕密主也今祕密主菩薩住於法界平等觀為念未來眾生普令一切裂大疑網故即於佛前而說大真言王如文可知也。",
        "translation": "The Vajrapāṇi then enters the Vairocana Tathāgata's body, speech, and mind, and ascends to the earth realm to observe the equality of the Dharma realm. This is a bodhisattva who can know the Tathāgata's body, speech, and mind, so he's called a master of mystery.",
        "source": "X23n0438_011:0448a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真言曰。",
        "translation": "He said, \"This is the true teaching.",
        "source": "X23n0438_011:0448a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南謨三曼多佛陀(引)喃(引)(歸命普遍諸佛也)阿娑摩(引)補多(無盡)達磨駄都(法界)竭帝竭多南(超越〔也〕無盡法界超越者即是歎於如來祕密身語意之德也)薩嚩佗(引)(謂於一切十方三世一〔切〕所超越無盡法界而能普門利益一切也)暗欠暗噁此四字即是如上四輪也第一字為地金剛輪第二字為水輪第三火輪第四風輪也阿此字本體是金剛界體次水輪者長聲是行行即白色故名為水輪也別本文互故記之火輪上有點即空輪以為莊嚴也。",
        "translation": "\"Nanmo samantabuddha (citation needed) (citation needed) (in deference to the universal buddhas as well) asama (citation needed) pudgata (endless) dharmadhātu (the Dharma realm) khadhigatana (beyond [also] the endless Dharma realm, which is to praise the virtue of the Tathāgata's mysterious body, speech, and mind) svātuo (citation needed) (which means to transcend the endless Dharma realm in all ten directions, the three times, and the one [cut] that can universally benefit all of them) dark ow dark ox These four words are the four wheels as above, the first word being the ground vajra wheel, the second word being the water wheel, the third fire wheel, and the fourth wind wheel.",
        "source": "X23n0438_011:0448a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次水輪者佉是空義亦有長聲是行有點為空即大空也次暗字為火者梵音阿竭喃是火也是涅槃性黑即風也此已下文合在水用已下風火水地如上阿字有四字謂長聲有上點及傍二點短聲故亦有上點及傍點二字為四今此娑等當知亦爾皆有四字今但舉其短聲合有長聲二字在於短聲之前準上而說也。",
        "translation": "The next water wheel, kha, is the meaning of emptiness, and there's also a long sound that's a line that's somewhat empty, which is great emptiness. The next dark word is fire, and the Sanskrit sound agan is fire, which is the nature of nirvāṇa, and black, which is wind.",
        "source": "X23n0438_011:0448b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次虗空無色而能含受一切色像今此佉字有行有點即是具一切色像夫大空者亦如虗空具一切色像也此空即是成辦一切事是故欠字得作水用(〔更問餘皆倣此此是也〕)又總而論之阿字是佛部娑字是蓮華部嚩字是金剛部風火遍三部用也(更問)如蓮華部中自有地水火風若息災即須金剛方輪若增益即須水輪降伏即須火輪等隨類用之當知此阿娑訶囉嚩五門即同上之五字輪隨一輪中自有四輪也如金剛部嚩字有四輪隨作息災增益降伏各隨類用也若讀餘真言隨其部類有此等字者即知彼所應用處各有所應最為宗轄也(〔此段未明了更問之〕)。",
        "translation": "Furthermore, while space has no form, it can contain and receive all forms and images, and this word kha has a form that's somewhat formed, which means it has all forms and images. The great emptiness is like space that has all forms and images, and this emptiness is the accomplishment of all things.",
        "source": "X23n0438_011:0448b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更有三道真言。",
        "translation": "There are also three other true words of the path.",
        "source": "X23n0438_011:0448c01_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吽(引)囕[口*落](此身真言也)紇[口*落](二合)郝(此語真言也)藍[口*落](此意真言也)此三道真言即攝如來身語意平等法門然此三真言若著莎訶字亦得若不著亦得行者得意時自著方便也又復此真言由最勝故號之為王如上說雖各有四字然此中相含但名為十二字真言王也此中四種輪合隨彼地水火風輪而加持阿闍棃身即得自在之用其身語意真言亦合加持自身身語意業也此事未明了更問之(〔又云前是布字法今此中用別計合是〕隨五種事相應字即攝彼中之用更問之)。",
        "translation": "These three paths of truth are the Dharma-gate that incorporates the Tathāgata's equality of body, speech, and mind. However, if these three truths are attached to the word sahā, they are also obtained, and if they aren't attached, they are also obtained when the practitioner obtains the intention to attach himself to the method. Furthermore, this truth is called king because it's the most excellent. As explained above, although each of these truths has four words, they are all included here but are called the twelve-syllable king of truths.",
        "source": "X23n0438_011:0448c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時金剛手如是說大真言王竟時一切如來十方世界住舒右手摩執金剛菩薩頂稱歎言善哉善哉善男子佛子汝毗盧遮那身語意地越遍一切真言道平等住為欲作諸菩薩照明故說此真言王者今此中摩頂非是十方佛舒手就此土摩其頂也然此祕密主當於佛前說此真言王時即以真言王故普於十方一切世界一一如來前以平等遍滿聲一時而說是故一切如來各各申手而摩其頂也越者超入之義也如毗盧遮那於阿迦尼吒天坐於道場以此真言王故得身語意畢竟平等自在之用汝今亦得超入如是身口意平等之地等於毗盧遮那即是一切如來歎其實德也言汝已得如是平等之地為欲普門利益一切眾生故為欲照明修真言行菩薩除其暗冥是故說此真言王也此真言王能裂一切法界疑網疑即是暗能斷一切疑惑即是為作照明也何以故毗盧遮那世尊應正等覺坐菩提座觀十二字真言四魔降伏此法界現生三處出罪魔降者謂大日如來坐道場時平等觀於法界而說此十二句真言王即以此力能降四魔除其罪垢也然四種魔中三魔無色是佛於阿迦尼吒天時已降伏之唯天魔有相為欲令世界中知自在力故復於此土而現伏天魔也三處者謂如上所說佛身上分出一切諸如來中分從心至臍出一切菩薩下分從臍至足出一切八部天神等皆從如來平等三業普門示現大漫荼羅胎藏莊嚴之位即是本尊真言及印也當知佛從於內證之德現如是事時即時普伏四魔無有遺餘阿闍棃欲造漫荼羅時亦須想於自身一同毗盧遮那即得自在之力亦同彼佛能伏四魔也。",
        "translation": "When Vajrapāṇi had finished speaking thus about the great king of true words, all the tathāgatas in the ten directions abiding in the world shouted with their right hands, moistened the Vajrapāṇi's head, and praised him, saying, \"Good, good, good man, son of the Buddha, you Virocana, who has transcended the equality of body, speech, and thought in all the paths of true words and abides equally in this land for the purpose of illuminating the bodhisattvas, are not the buddhas in the ten directions who are moistening their heads in this land, but the lord of this esoteric tradition, when he spoke about the king of true words before the Buddha, explained that it was because of the king of true words that he universally addressed all the tathāgatas in the ten directions with an equal and pervasive voice at one time.",
        "source": "X23n0438_011:0448c12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次世尊身語意平等德量同虗空得如是身語意獲如是智一切法得自在者謂佛坐於金剛道場纔念此三道真言謂如所說身語意三真言也當如是念時即得身語意平等之地身及語意皆是法界之體無有邊際猶如虗空即以如是之力而伏四魔也前所云三道者有一釋云此三道真言身語意自在平等之力即是從佛身出也由此身語意三道真言故如來得超入三平等地隨上中下類普門示現種種本尊之身種種真言種種印法等同虗空無有分限普周法界而度群生究竟皆令同得超入如是三平等地也身具無量功德猶如虗空不可知其限量語意亦爾由觀此真言故得如是功德同於如來也由三業無盡故若應以身度人即普現種種色身若應以語度人即普門示現種種語言隨宜導示令得入於佛之知見若應以意度人亦如是種種感通不可窮盡也非直身語意無有限量具足一切功德猶如虗空當知智慧亦復如是無有限量猶如虗空也若得如是無礙妙智即是於一切法中而得自在同於世尊也所云自在者謂於一切不得自在中而得自在也一切眾生之類由未究竟清淨法界故皆為業煩惱之所樊籠繫屬生死不能得自在之力今如來於彼生死大海之中以種種法門宣示如來深密之法要為一大事因緣故種種方便而成就之皆令到於一切智地即是於一切法中得自在義也以證如是法於法自在以自在故即能無礙演說曲成眾機也如來所以得如是自在之用皆由觀此十二字輪法門當知此十二字法門即是法界之體性也時十方佛見金剛手說此真言同於古佛之道我等一切如來亦由觀此十二字門而成究極妙身未來諸世尊亦復當如是是故大歡喜而為摩菩薩頂而告之言一切諸佛以於法自在故為一大事因緣故以身語意平等而說此法門汝今亦復能說之即是亦證此法同於如來也然金剛藏雖未即究竟一切種智同於妙覺世尊但以十方諸佛神力共所加故亦於此會中亦如如來所證相同等若離神力加持即亦未得究竟與如來等也。",
        "translation": "The Bhagavān's equality of body, speech, and mind in terms of virtue and amount is the same as that of space. Attaining such knowledge of all things and attaining mastery over them means that when the Buddha sits in the ritual site of Vajra, he intensely chants these three true words, which are the three true words of body, speech, and mind as they've been taught. When he thus chants them, he attains a place where body, speech, and mind are both the essence of the Dharma realm and have no limit, just like space.",
        "source": "X23n0438_011:0449a22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "汝善男子毗盧遮那身語意平等證一切佛如是知者知是覺之別名由知諸如來普門無盡之行證於如來三種平等謂知如來身密之藏亦知語意微密之藏也若證知此法者即是同於如來也如是歎印竟今復更請如來所以者何如是深密之藏唯佛與佛乃能究了故一切菩薩莫有能發問者今十方佛同以神力加金剛手為利益一切眾生故今乘諸佛神力而問大日如來也此中問何事耶為先所說之事所有深密之義尚未周備故今更問其樞要也一切智成者即是大日如來薄伽梵義如六義中說前已解也毗盧遮那者如日出于世間能除暗冥能成就一切眾生所有事業大地所生之類無不蒙益此實相自然大慧之日亦復如是若有眾生了知自證如猛風吹雲日月出現亦有如是功力普於法界之中而作大利如日光顯而照世間也主者以於諸法得自在故名為主也今諸佛令金剛手問此大日如來真言行句祕密之事也殊勝說自教則廣者由於一字法門達一切法證得十方三世如來平等身語意不可究盡故名為勝也教則者即是法則之別名法是軌則之義也。",
        "translation": "You good sons, Virocana's equality of body, speech, and thought is realized by all the buddhas. Knowing this is the distinctive name of awakening, which is the knowledge of the Tathāgatas' universal and inexhaustible practice and realization of the Tathāgata's equality in three ways. If someone realizes this teaching, they are the same as the Tathāgata. After praising the seal this way, I'll now further request the Tathāgata. What is the reason why such a profound and mysterious store can only be investigated by buddhas and buddhas? Therefore, no bodhisattva can ask this question.",
        "source": "X23n0438_011:0449c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是我往昔發菩提無上菩提宣說我一切法涅槃至現在世界諸佛世尊證知者言我等往昔行菩薩道時亦由如是真言門故成自然智慧復為一切眾生如是演說咸令得至大涅槃也我今此語緣起甚深一切有心者尚不能發問何況能信解唯有十方一切如來同至此法可以為證終不虗也汝今已得我等所行之迹故宜更問如來也。",
        "translation": "Because I aroused the unsurpassed bodhi in the past and declared that I had attained nirvāṇa in all things until the present world, the buddhas and world-honored ones realized that when we practiced the bodhisattva path in the past, we also attained natural wisdom because of this true-word approach and explained it to all sentient beings in this way, so that they would all attain great nirvāṇa.",
        "source": "X23n0438_011:0450a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時執金剛具德者猶手所持如來智印是具足一切諸佛種種功德皆同一味所謂如來解脫之味以彼智印同於如來故言具德者也時彼菩薩由諸如來共所加持心大歡喜即得深知如來之語亦知如來之心先所不逮而未能問者今皆自在能問如來無有疑難也今欲問如來先歎法界之德而說偈言(〔此偈非文有經意〕)。",
        "translation": "The person holding the vajra is fully endowed with the virtue of being like the hand that holds the tathāgata's seal of wisdom, which is full of all the buddhas' various attributes, all of which have the same flavor, which is called the flavor of the tathāgata's liberation.",
        "source": "X23n0438_011:0450a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　是法無盡相　　亦無有自性　　盡為有始終　生滅起盡法　　平等法界性　　本無有盡相　無動無變易　　亦無有住處　　彼阿賴耶藏　即有盛受義　　平等法無受　　故無有住處　一切法無性　　常自寂滅相　　入此不思議　即同諸佛位　　甚深寂滅法　　非名言可喻　佛佛所同證　　故言同正覺　　若非畢竟空　則無有三乘　　無三乘聖眾　　此墮所滅見　證此畢竟空　　不能利一切　　如來大悲者　甚深方便智　　於無相法中　　方便而顯示　能滿一切願　　方便力如是　　此法無人授　亦不由佗悟　　於道場自覺　　證實無師智復次若言法界無盡無始終者即是於斷滅不能為眾生作諸利益何以故已於生死作分限故然是塵勞之儔是如來種若一切無生無生亦無住處何能普應世間作諸佛事耶然諸菩薩有二事故不墮斷滅中謂大悲及方便由有此故能自開發也此中云開發者謂菩提心自然開發也若以言說表示因佗教語而能得如是自然無師之慧者無有是處所以者何但因行者如實自覺如實自觀無盡法界故得如是實相之慧非由佗悟也經意云法相如是故云如是相也既得如是實相之法即以此法大悲方便而為眾生開示顯說然實不由佗悟不從佗傳得也如有盲人問佗乳色何似乃至聞乳色如雪便生冷想聞色如鶴便生動想聞色如貝便生堅想乃至以種種喻方便表示終不能解徒增心數妄計而已何以故由彼自無明目故第一義諦亦爾若不能如實自了知設佗種種開導終無得理若人自不開發如是內證之法而為人說欲令佗悟亦無有是處何以故如有無足之人呼召眾人作如是言我當負汝而登妙高山上當知此人必為智者之所嗤笑何以故若自無足者尚不能自登如是妙高山王少分高處云何能負一切而登彼頂耶又如有人自未能渡大海波浪而謂佗言我當渡汝令達彼岸當知亦如是無有得理也行人亦如是若自未覺無師之慧而欲令佗聞法得悟必無此理也。",
        "translation": "\"This is the inexhaustible character of dharmas, which have no essence and are ultimately existent, the arising and ceasing of dharmas, the equality of the nature of the Dharma realm, which has no end, no marks, no movement, no change, and no abode. The store of ālaya, which has the meaning of full apprehension, the equality of dharmas, which lack apprehension, therefore has no abode, and the absence of nature of all dharmas, which is inconceivable, enters into this, which is the same as the status of buddhas. The profound law of cessation is not metaphorical in words, and is realized equally by buddhas and buddhas.",
        "source": "X23n0438_011:0450b02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "時金剛手祕密主以此偈歎如來已次復說優陀那偈而以問佛烏陀那是總攝義也以一偈之義而攝無盡法界離相之法無量法義故言攝也歎說偈已念彼未來世眾生修真言行者於此大悲藏生漫荼羅有所闕故不得疾成無上菩提故次第問佛祕要方便也斷一切疑者若不能普斷眾生種種疑網則不名一切智人以於一切法中自離疑網方能斷佗也今佛既自斷一切疑網是故我今請問願為斷疑也離熱惱者言以永斷三毒根也今為一切眾生故請問導師以於一切法中而能引導令至佛慧故名大導師也。",
        "translation": "After praising the Tathāgata in this verse, the Vajrapaṇi mystic then spoke the verse udāna and asked the Buddha whether udāna has the general meaning of collecting, which is to gather in the meaning of a single verse the inexhaustible Dharma realm, the dharmas free from characteristics, and the immeasurable meanings of dharmas; therefore, it's called collecting. After praising the verse, he remembered that in the ages to come sentient beings who cultivate the practice of true speech will have a deficiency in this great compassionate store, be born in a maṇḍala, and therefore won't be able to quickly achieve unsurpassed enlightenment.",
        "source": "X23n0438_011:0451a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次即以偈頌次第問佛今次列之未結偈句也漫荼羅何者先作(謂漫荼羅有多種事當先作何者也謂先作何事)阿闍棃有幾種(亦說之也)弟子復有幾種(大牟尼亦說)云何知地勢(謂好地惡地上中下成就所用等也)云何簡擇地既擇已云何作淨(准有三問)作淨已云何安住(雖作淨了恐〔復〕為障者所惱故問云何而得安住也)準有三問(更問)云何為弟子作淨願佛說(前問有幾種弟子今既得弟子已問先為作何事也)淨已之相復云何(此中間師問地問弟子三事為三句問也)結護灑持等有多義問用何護地作護復云何(亦問師自作護及護地護弟子有三問)加持地復云何結護灑持等有多義(亦問三事)云何初作用(謂治地護淨竟緣壇所應作事此中所作事有二種外所作事謂緣造壇眾事內所作事謂師自觀其身如大日如來等種種瑜伽之法也〔用何真言等法也為先作護為先淨除即問前事先後也此二事是作用也〕)線有幾種量地復云何(謂用線〔量〕用線作界分也)供養復有幾云何華香等(此中更有塗香燈等及寶網寶樓樹等種種獻供之物皆準例而作所以言等等者〔多〕聲也)問獻香華為何方法華合奉獻誰(謂華有若干所應獻之尊亦有差別也)獻佛用何華菩薩天等用何也香等亦然(準華而說)奉獻華時復云何(以何法而獻謂須有真言加持等也)以何法用獻也香等亦然(準華而說)云何獻食等(食〔中〕有上中下差別也)護摩云何作(〔問獻佛及護摩有何次第列法則即是次第此是名通也〕)云何奉諸尊座(〔佛菩薩八部等座合坐何物云何獻也法教法則方法次第軌則皆得〕)顯形色等(顯謂諸尊青黃赤白等形謂坐立大小之事色相貌也謂喜笑忿怒寂住之類〔此三問也願次第說不與法則同也〕)諸尊印及以自座(謂自常念誦之座也謂茅席〔等〕願導師說也)印復從何處生說此印復作何用(如世作印為王等令佗信用不疑真偽故今如來印復云何耶)其印名號復云何何故名為印灌頂有幾種(欲得知解也)三昧耶有幾種持誦者劑幾時持誦者勤修真言行得成菩薩道(一切智者願說也)幾時應見諦(謂於真言門得如實知見也義合問〔時〕也)悉地有幾種(欲得解)幾時悉地生及說悉地時云何昇得步虗空云何身祕密云何不捨此身而得成天仙身成就已種種變化云何生(謂一切事隨念皆得成從何處得生此耶從自心耶從佗耶種種諸變化誰〔生〕彼復從何生也)日月火方執曜時分等諸不祥云何除(日月為變成火災或方所有怪宿是二十八宿星〔謂〕眾星也別及生死受苦彼起者云何悉令除滅也不有是除義)云何行者常與諸佛同會一處護摩有幾種(此中問護摩時須用幾種火也欲得知也)火中增威復有幾(是增益法也〔增〕威如華等一切處用也)尊異類諸尊性(謂佛菩薩八部形及性類〔須識本性忿怒寂喜等願導師說也〕)無餘世界及與出世間果量有幾其數如何(出世謂佛菩薩世間謂八部等得成就時量及果及數皆云何有六問也)問世間出世三昧云何也謂有殊勝定并前為八作業成就在何處(〔問成就受果在何方所其未成者亦如是問〕)不成就復云何時能離業生果在何得解脫。",
        "translation": "次即以偈頌次第問佛今次列之未結偈句也漫荼羅何者先作(謂漫荼羅有多種事當先作何者也謂先作何事)阿闍棃有幾種(亦說之也)弟子復有幾種(大牟尼亦說)云何知地勢(謂好地惡地上中下成就所用等也)云何簡擇地既擇已云何作淨(准有三問)作淨已云何安住(雖作淨了恐〔復〕為障者所惱故問云何而得安住也)準有三問(更問)云何為弟子作淨願佛說(前問有幾種弟子今既得弟子已問先為作何事也)淨已之相復云何(此中間師問地問弟子三事為三句問也)結護灑持等有多義問用何護地作護復云何(亦問師自作護及護地護弟子有三問)加持地復云何結護灑持等有多義(亦問三事)云何初作用(謂治地護淨竟緣壇所應作事此中所作事有二種外所作事謂緣造壇眾事內所作事謂師自觀其身如大日如來等種種瑜伽之法也〔用何真言等法也為先作護為先淨除即問前事先後也此二事是作用也〕)線有幾種量地復云何(謂用線〔量〕用線作界分也)供養復有幾云何華香等(此中更有塗香燈等及寶網寶樓樹等種種獻供之物皆準例而作所以言等等者〔多〕聲也)問獻香華為何方法華合奉獻誰(謂華有若干所應獻之尊亦有差別也)獻佛用何華菩薩天等用何也香等亦然(準華而說)奉獻華時復云何(以何法而獻謂須有真言加持等也)以何法用獻也香等亦然(準華而說)云何獻食等(食〔中〕有上中下差別也)護摩云何作(〔問獻佛及護摩有何次第列法則即是次第此是名通也〕)云何奉諸尊座(〔佛菩薩八部等座合坐何物云何獻也法教法則方法次第軌則皆得〕)顯形色等(顯謂諸尊青黃赤白等形謂坐立大小之事色相貌也謂喜笑忿怒寂住之類〔此三問也願次第說不與法則同也〕)諸尊印及以自座(謂自常念誦之座也謂茅席〔等〕願導師說也)印復從何處生說此印復作何用(如世作印為王等令佗信用不疑真偽故今如來印復云何耶)其印名號復云何何故名為印灌頂有幾種(欲得知解也)三昧耶有幾種持誦者劑幾時持誦者勤修真言行得成菩薩道(一切智者願說也)幾時應見諦(謂於真言門得如實知見也義合問〔時〕也)悉地有幾種(欲得解)幾時悉地生及說悉地時云何昇得步虗空云何身祕密云何不捨此身而得成天仙身成就已種種變化云何生(謂一切事隨念皆得成從何處得生此耶從自心耶從佗耶種種諸變化誰〔生〕彼復從何生也)日月火方執曜時分等諸不祥云何除(日月為變成火災或方所有怪宿是二十八宿星〔謂〕眾星也別及生死受苦彼起者云何悉令除滅也不有是除義)云何行者常與諸佛同會一處護摩有幾種(此中問護摩時須用幾種火也欲得知也)火中增威復有幾(是增益法也〔增〕威如華等一切處用也)尊異類諸尊性(謂佛菩薩八部形及性類〔須識本性忿怒寂喜等願導師說也〕)無餘世界及與出世間果量有幾其數如何(出世謂佛菩薩世間謂八部等得成就時量及果及數皆云何有六問也)問世間出世三昧云何也謂有殊勝定并前為八作業成就在何處(〔問成就受果在何方所其未成者亦如是問〕)不成就復云何時能離業生果在何得解脫。",
        "source": "X23n0438_011:0451a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "時金剛藏乘十方佛威神說偈問佛故彼真言行菩薩道有所闕少法要方便未周備故時一切智毗盧遮那世尊離眾惱者聞彼所問祕要之事而歎之言善哉善哉勤勇大心(〔是一切時中大也大心大願大行等〕)祕密曼荼羅配尊位決者(謂決定安列〔諸〕聖者坐位等也)祕密者即是如來祕奧之藏久默斯要如優曇華時乃說之苟非其人則不虗授不同顯露常教也漫荼羅是具種種德義即是如來祕密之德如蓮華開敷而自莊嚴配尊位決决是決擇義也如是蓮華祕密之藏分別種種分位所應作事皆決擇之也(決謂决定說也)大悲根原(從大悲根本生)發大乘無上諸佛最祕者謂此漫荼羅即是無上大乘根原也謂此菩提之心以大悲而為根本亦如胎藏故言根本也謂大乘者謂真言行菩薩由具足方便故行大直道一向無留難得至於真實猶如乘調良之乘行大直道至於大城此即是諸佛最上祕要之法若廣說者盡未來劫亦不可盡今但以方便而略說之今於一言亦具一切義味故名略說也(諸佛密事汝能問之我當略說〔也〕)。",
        "translation": "The Vajrasattva then, riding on the authority of the buddhas in ten directions, spoke a verse asking the Buddha why there was something missing in the path of the true-language practicing bodhisattvas that wasn't fully explained in the Essentials of the Dharma, when the World Honored One of Omniscience Vairocana, who was free from all afflictions, heard his question about the Essentials and praised him, saying, \"Good, good! Good! Good, diligent and courageous!",
        "source": "X23n0438_011:0451c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時佛已先歎法許為略說次即就彼所問次第答之也佛告金剛手諦聽大力漫荼羅十二支句生明王大力(漫荼羅初業先答也)先當作之者此即如上所說十二支句生從十二支持句生此大力明王十二句法界體彼應最初作明王也由此明王悉攝一切世間出世間所有真言悉於中攝盡故(初作壇應先住彼明王三昧王者只是大日也此謂心中置十二字中最初字以持身也)欲作漫荼羅要須先誦也謂將造漫荼羅時要須先誦然後即住瑜伽瑜伽即是此明王應理之行也既住瑜伽當正觀察今此所作宜以何事謂隨五部如上所說五字差別之用或方或圓三角半月等類於上中下壇宜作何用弟子根性云何如是等種種皆知方可作也然此事中於真言王中分別種種差別之事猶未明了更問之復次先知即有二種一者由是見諦之師能於如是真言王中見一切根緣通達無障礙若未見諦師即須依教及於師所所傳旨趣而觀察之亦其次也既觀察知已隨所應作事而為作之故先須此真言王也以本三昧持身已先知識瑜伽道然後隨意作諸事也然以祕釋之此十二真言王即是金剛三昧也必菩薩坐道場入於金剛界故則蒙十方諸佛同時灌頂所共加持得入佛位入佛位者即是成就大悲藏生大漫荼羅究竟義也金剛手由入此真言王故亦於此經中得蒙十方佛同所加持今更決擇大悲之藏若不如是何能得諸佛灌頂同如來法王之位耶然造漫荼羅法先須阿闍棃故次答也應知師有二種凡師位者須具解真言及印本尊之相於中一一了達無疑了知上中下法差別之相然彼復二種(〔二分者〕分為二也)一者解深祕二者通顯略所謂深者能了知深廣也謂得真言行中三昧之行善知理趣廣解大乘堪受付屬此中堪付屬者謂善知時宜了解根性堪受者則為不請之友令其不失大事因緣未堪者則當將護其意更於餘深法中示教利喜由此名為堪委付也當知此即佛長子由見諦故(見法謂見現世果報也)故不取諸法相離於心量分別之境故名離也(謂離現世利慧等求佛道也)當知此師即是蒙十方佛現前各申右手而摩其頂以法灌頂而付法藏也第二師者但得世間成就之益(即現法中利也〔廣〕句中加有緣念〔也〕)為彼而造壇也然亦具解造漫荼羅等種種方便無有錯謬蒙師灌頂得阿闍棃位亦名佛所印可也由彼於漫荼羅中親對諸尊而受灌頂師位故名印可也灌頂已下是重說深行師也當知此中蒙佛灌頂者為深祕之師蒙世間人師之所授者為顯略阿闍棃也金剛藏所問皆是緣漫荼羅所須佛亦次第以偈答之此偈今未斷句後當飾文也。",
        "translation": "The Buddha then told Vajrapāṇi to listen closely to the twelve phrases of the powerful maṇḍala that gave rise to the illustrious king of powerful (the initial action of the maṇḍala was first answered.) This is the twelve phrases as explained above, and from these twelve supporting phrases there arises this powerful luminous king of twelve phrases and the Dharma-realm essence of the Dharma phrases.",
        "source": "X23n0438_011:0452a09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "佛答師已次答弟子之相所以然者雖但有師而無弟子則闕傳法之緣令佛種不得相續故次分別弟子之相有其四種也一者持念誦弟子二者非時三者時非時俱四者時非時俱非此謂四也所謂時者如弟子等求阿闍棃而請真言行法師若是見諦者自當照彼境緣知其堪任某事授其行法令作念誦限若干時當得成就更作成就方便若世間師者雖不見鑒前機但依教而作令弟子念誦祈境界交感之相師亦自念誦若相應者弟子得境界許受法時師亦自當知之既得相應授其法行亦令如上念誦此亦具有方軌也(更問)非時者亦如前法令修真言之行當於其時而得成就也然時法驗不成須作加行故名非時也時非時俱者雖如上受師言教然未得如法依行未至成就之時此不在時亦不在非時如在學地故名俱句也俱非者但發心歸依然都未有次第師雖已攝取之然待時待緣有所未具未得與彼真言法要故名俱非也。",
        "translation": "After the Buddha answered the teacher, he then answered the question about the disciple's characteristics. This is because even though there's only a teacher and no disciple, there are no conditions for transmitting the teaching, so the Buddha lineage can't be continued.",
        "source": "X23n0438_011:0452c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次具足諸相者相有二種一者外相謂支分等無有闕減如前當廣說之二內相者謂具菩提心堪為法器等具有慚愧聞師所教一一能如法修行如佛教敕不敢違逆如是等是內相也(佛敕者當知即是師教以師順佛教作〔故〕)此四人皆在修學之地未滿足也既有弟子最初知地相心地教此教當次說也所謂心地應造漫荼羅造漫荼羅先須擇地故次明擇地也所謂地者即是菩提之心先淨此心即是先淨其地也作淨已先說謂八葉等如前作之也如前所說淨菩提心方便謂觀八葉蓮華於華臺上而觀阿字乃至當頂而置暗字眼亦安囉字而觀其心其咽勿令太低太直之類此等皆是淨其心地之方便也既淨心地次安囕字於其兩目而以觀之即是擇得心地而更除遣諸穢也此方便前已具說當如前作之耳。",
        "translation": "Furthermore, there are two kinds of characteristics of those who are fully endowed with characteristics. One is external characteristics, which are the factors without loss and so forth, as explained in detail earlier. Two are internal characteristics, which are the presence of the mind of enlightenment, being able to be a vessel for the Dharma, having a sense of conscience, hearing the teacher's teaching, and being able to practice according to the Dharma one by one as the teacher instructs, not daring to disobey such as these.",
        "source": "X23n0438_011:0453a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離過心地得無畏者以能淨菩提心心離於相是則能離諸過謂離煩惱隨煩惱等見愛之惑故名離諸過已離如是煩惱險畏惡道種種不安穩故而得安穩之性故言無畏也(〔當得清淨時離一切過也〕)當得一切淨者由離諸過心無所畏故能究竟淨菩提心也若已至如是處當堅住其中謂已得離一切過不為雜染分別所污當守之不動勿令退失必定能至無上菩提也但見如是淨菩提心究竟無餘即是成一切智智也堅固住於淨地即得見三菩提知謂如是知也如是知即見佛也異此非能淨地若分別住非淨地者(〔若異於此者非能淨其地〕)言阿闍棃若不如是而自淨其大悲胎藏漫荼羅地則非名淨擇其地也以不能離於妄想分別故恒時諸過之中未能得免怖畏衰惱云何得名善淨漫荼羅地耶是故經云若持誦者住在分別之中則非淨地也(〔行者住分別若作淨地者非淨祕密主離菩提心故二種師皆須住菩提心也〔法〕師雖治地亦未成仍須少時住菩提心離此不成也〕)如前造壇中說齊一肘以來穿去惡土擇去沙礫毛髮瓦石之類若細微之惡無由能一一遍簡又復一肘之內雖淨然過一肘設有種種穢物是亦不能擇之云何令此漫荼羅而得究竟清淨是故當知若能淨此菩提之心捨離一切分別戲論之糞而淨其自覺之地當知乃名善修其地也若人師如文取解但依前言次第法用隨事而作當知此人在愚夫地不能了達祕密之用也當知作如是解即非一切智人之所說也所以然者若不能淨此心地由有分別妄想則未能捨離苦因是故非是等正覺者之所說也內外由心心淨故地淨是故應捨分別淨除一切地緣地事總答了既淨菩提心竟當以大悲胎藏而長養之所說諸壇我次第廣說(此次第謂依法也)彼不依先所應作事愚癡故不解但問果上中下不知住心地也若不住心而求出世間無上之佛無有是處亦非名為一切智也乃至不能捨是等分別之苦因也為淨菩提心為者是所作事也勸弟子如是發心是住菩提心也恐其退沒故須結護故。",
        "translation": "If the mind is free of faults and attains fearlessness, then the mind that purifies the mind of enlightenment is free of faults, which is to say that it's free of afflictions, following afflictions, and other disturbances of views and emotions, and so forth, it's called free of faults.",
        "source": "X23n0438_011:0453a18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "經次云以不動尊而守護即是不動明王也當取不動真言之心當護弟子謂不動也即是憾字門也訶字是因義言此淨菩提心先住菩提心師弟子俱住之然後以此二尊護之也即是一切智智之因也傍有長阿是行上有圓點是證是大空義以此妙因而起正行行等於空用此三法而護其心令其畢竟不可移奪也若不用不動護者用三世明王亦得世謂三毒猶彼降伏三毒而於世間得大自在故名三世勝也此亦有方便更問若弟子能成此事者非癡所攝癡是執著也有執則不能住離癡即是不動也有所執有所得皆是癡也謂不為妄執之所動也必定成於無上菩提清淨無垢同於虗空無能動搖廣大無際而能含容一切色像當知一切智心亦復如是也。",
        "translation": "The second part of the sutra says, \"Guarded by the Acala,\" which is the Acala luminous king, the Acala luminous king will also take the Acala luminous king's mind and guard the disciple, which is the Acala luminous king, and that's the word regret. The word ha is the cause, which means that this pure bodhi mind first abides in the bodhi mind, the teacher and the disciple both abide in it, and then these two acolytes guard it, which is the cause of omniscience.",
        "source": "X23n0438_011:0453c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次又加持地者謂阿字門當用阿字而加持之此是諸佛之教也一切如來昔因此門而成正覺以此護心或加暗於頂及加囕於眼等是堅固菩提心是故得成自在之業若異於此者不得心自在也故云非餘非餘者言一切如來成佛無有異路唯此一門也初加持地依於佛教佛謂阿字也第二心自在謂安點也此點即是三昧定慧等故一切自在也更不應異此教也初依佛發心即阿字後即成佛等於佛即暗字也菩提心依佛而起是故一切分別除雖未成佛即是無緣之種子也前已問答加持地了既加持地次須用綖而定漫荼羅位綖者梵音名蘇(去)怛囕是連持義連持眾德令其不散故名綖也線說有四種白黃赤黑等更加一種謂虗空色也念此念謂應念持也虗空能含一切色像即是具一切色若但依顯色即是淺青之色如草木葉色也白是信義黃是精進赤是念黑是定定色同於涅槃色也慧者即是大空大空具一切相而無有相故為一切色也凡合線時若一一依法者當別造漫荼羅安置寶缾香華塗香燈等及諸飲食作種種供養(更問方法)然後令童女合之當先為受八戒著新淨衣香水澡浴使內外清淨坐於壇中而合之合線之法先預作細絲令極均調大小緩急皆令得所又不得中間斷續連接之也又合時以帛掩口也每一色絲來去襵牒使成九絲然後合為一縷(其絲但有一頭而屈襵之中間不得接)一縷一色凡五色合為一繩也若合繩緩急麤細不調又不盡心作之則生障法損師亦損弟子或令其發狂亂等不可不慎也私謂童女是三昧也由三昧極均等調停得成五力五根由此根力即能連持眾行也(更問)虗空中等持者別本虗空等持等是普遍也持謂應如是作也作謂知大小也先定空也等位均等也第二以線置漫荼羅地此有二種若是深行阿闍棃欲作壇時既淨菩提心之地竟於瑜伽中為度弟子故正觀胎藏大漫荼羅加持之位作謂知大小也先定之也一切分位宛然明了如對目前空中等持等是普遍也作謂應如是作也等謂均等也第二以線置漫荼羅地然為度人順世諦故以此方位加於壇地然後於上用五色線等而定方位也若是淺行阿闍棃者亦須先用此線而定方位竟當一一用心而布置之亦令所有方位如對目前或可別用紙筆鈔之臨時案用不得臨事疑誤也此云空中等者即是如上所說先共弟子對引其線而定方位且勿令著地先於空中對引各令當心如其次第令得周帀若未有具法弟子未堪共造壇者亦可置橛於弟子處而作也既如是定竟即運心布定位次然後得絣繩畫之若瑜伽阿闍棃者亦於此中而作方位見諸佛菩薩天神等宛然位定方順世間法亦絣線案位案其形色而表出之當知此為最上之位也。",
        "translation": "This is the teaching of the buddhas, and all tathāgatas in the past became fully awakened through this gate. This protects the mind, darkens the crown, darkens the eyes, and so forth, and thus firmly establishes the mind's unimpeded activity. If someone differs from this, they won't attain the mind's unimpededness. Therefore, it's called neither other nor other, which means that there's no different way for all tathāgatas to become buddhas but this one gate. The first stage of the stage of maintenance relies on the Buddha, which is the letter a, and the second stage of the mind's unimpededness is the point where all things are unimpeded because this point is samādhi, concentration, wisdom, and so forth.",
        "source": "X23n0438_011:0453c18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "一切諸佛子諸智者(一切諸〔佛〕智者〔諸佛子歎菩薩具智慧也〕)蓮華悅意勝吉祥世稱者謂世所歎以為吉祥也此次答座位表像也如世人以蓮華為吉祥清淨能悅可眾心今祕藏中亦以大悲胎藏妙法蓮華為最深祕吉祥一切加持法門之身坐此華臺也然世間蓮亦有無量差降所謂大小開合色相淺深各各不同如是心地華臺亦有權實開合等異也故名云智者當知也若是佛位當作八葉芬陀利華(白蓮華)其華令開敷四布若是菩薩亦作此華坐而令華半敷勿令極開也(〔其華或白或黃或作寶蓮華皆得但赤色者是世間華在下也〕)若緣覺聲聞當坐於華葉之上或坐俱勿頭華葉(〔淺識傳謂〔世〕所傳以為一邊之智〕)此是青蓮華也此但是青色之蓮然更別有青蓮華種非此類也坐蓮荷青蓮葉也從蓮所生葉也若淨居諸天乃至初禪梵天等(〔世間立號為梵天〕)皆坐赤蓮華中其色純赤(世稱為坐王)若欲界天及地居等各隨其位而用表之如帝釋像即畫須彌山王山神坐山上水神坐水上樹神坐樹城神坐城如是甚多可以意得耳(〔以下諸天但分地為坐謂欲界等天或坐草或乾葉等也念〔為〕思念〔憶持不忘也〕)三藏說西方蓮華有多種一者鉢頭摩(〔復有二種一者赤色即今此問蓮華也二者白色今此間有白蓮是也非芬陀利也〕)優鉢羅(亦有赤白二色又有不赤不白者形似泥盧鉢羅華也)俱勿頭(有赤及青二種又云俱勿頭是蓮華青色者)泥盧鉢羅(〔此奉從牛糞種生極香是文殊所執者目如青蓮華亦是此也更有蘇健地迦華亦相似而小華〕)分荼利迦(〔華可有百葉許葉葉相承圓整可愛最外葉極白漸向內色漸微黃乃至最在內者與蕊色相近也此華又極香也昔琉璃王害釋女大迦葉於阿耨達池取此華裹八功德水灑之諸女身心得安樂命終生天因女投華於池遂成種至今猶有之華太可徑一尺餘尤可愛也此法華所引申者是是漫荼羅八葉者也〕)。",
        "translation": "The lotus pleases the mind and is more auspicious than the world acclaims it as auspicious. This answer to the question of seating is also expressed in the image of the lotus as an auspicious and pure lotus that pleases the minds of many people. In the esoteric canon, the lotus of the marvelous Dharma of the great compassionate womb-store is the most profound, esoteric, and auspicious lotus, and the body of the Dharma-gate of all blessings sits on this lotus dais. However, in the world, there are also countless differences between the lotus and its descendants, such as its size, its opening and closing, its color, its lightness, and its depth.",
        "source": "X23n0438_011:0454b23_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次答供養義然此中答或不依問次然皆依所問義於理不失也當知供養略有四種一是供養香華(〔及塗香燈等乃至飲食此是世間供養也但以物獻也〕)二者合掌(謂禮敬也此是印也)三慈悲四運心謂想香華滿法界運心已即用合掌印也并合掌慈悲三事皆運心也然經中不言香華等於義必當有之也華手發生(此是却牒合掌印也此華〔從〕手發生也)奉一切佛結一切支分印觀菩提心者華手發生謂作印作印已即運心供養也此一切支分生印者前已有真言而云未有印也當撿之如是以印加持已當念菩提心想見此華從手出也以此為供養也各各一切諸佛生此運心也及彼所生子等殷勤以是無過華美香光顯法界為樹王供養(註)想樹遍法界生華供養也以真言加持勝妙復多大雲法界中生從彼雨華諸佛前等者謂從諸佛菩薩乃至二乘八部各各依本真言及印用加持所供養物而供養之也行者供養香華時當以真言及印加持如供養華即用華真言等也心若不住定何由得然云三昧自在轉也然後運心此華香美無諸過惡願生勝妙其多猶如大雲從法界中生也從彼而雨華(從法界生也)常生種種光明遍諸佛前又以此華等遍周法界為一大樹如天意樹無異雨種種華雲香幡葢等及飲食物無量無邊不可窮盡普遍一切如來之前種種供養令一一周遍如是運心即以真言加持之謂一一尊所供養各以本真言及印加持也次卑於此者謂八部等亦各隨其本類用真言及印也然此諸尊又卑此諸天神今次說諸天或經中有真言如本瑜伽謂各各相應謂與本尊相應也如忿怒用赤等如華者塗香等亦如理相應想念也然此諸尊或經中有真言及印或有闕無者別有一普通吉祥之印當以空水二指頭相捻餘三指皆舒散之用此印加持諸物及其壇中一切供養之具悉用加之皆得成也設本尊自有本印臨時忘者亦用普通印加之亦得也其香華等真言即是以前品中香華燈等真言各隨類用也如般若經所說若欲以一華普供養一切諸佛者當修是般若波羅蜜即是此中但運心以一華香以加持及三昧故即普能供養一切賢聖遍於法界令此善根不可窮盡是也若不作普通吉祥印者更有金剛拳印或蓮華印(〔及觀音印但以右手作也〔唯〕地居天合左手作然恐左手有所執作等右手作用加〔物〕亦得也〕)然供養時先用印加已即當捧之標心奉獻方置諸尊之所若是塗香者或用塗彼尊身香亦隨所應莊嚴處置之或但置其前也其捧華等時亦有高下之別若是佛當高齊其身頭頂菩薩在心已下二乘在臍已上佛菩薩持在心世天當臍此定也淨居等天在臍下結印已引向空中獻佛也已次而下乃至地居等令轉下也如上有四等諸尊從佛身出今獻華高下亦準前齊下以配當漫荼羅位也然有二種師若瑜伽成者但用三昧心自在故已得通達真言門故隨心所作便成不必待於事法亦得成也若第二世間師必須依於事法用真言及印加持之乃可成也。",
        "translation": "Next, when answering the question about the meaning of making offerings, it should be understood that there are four kinds of offerings. One is an offering of incense and flowers ([and coated incense, lamps, and so forth, and even food. These are worldly offerings, but they are offered in kind]), two are palm-clasping (this is a seal), three are compassionate, and four are mindful, which means that after conceiving of the incense and flowers filling the Dharma realm and mindfully applying the palm-clasping seal, the palm-clasping compassionate three things are all mindful. However, the sutra doesn't say incense and flowers, and so forth, but their meaning must be there.",
        "source": "X23n0438_011:0455a07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次答護摩義應知護摩有二種一內二外所謂內外界界即別註也護摩是燒義也由內護摩能燒除諸業以一切眾生皆從業生由生轉業輪迴無已以業除故生亦得除即是得解脫也若能燒業者名曰內護摩也從於何處得解脫耶謂從煩惱業苦而得解脫也既離世間即生種子所謂白淨菩提心也如世間之火若燒物已但成灰燼今則不爾既燒一切煩惱如劫燒火無有遺餘而亦即從此中得有牙生所謂菩提牙也此中能燒即是智也如前所說觀於囕字周帀火鬘今想此周遍其身其身又持刀及索以此囉字門故得盡諸業淨除諸障諸業障淨已得生白淨種子是故次觀菩提之心當知約菩提心得生種子也如此觀時當想嚩字遍於一切身分於毛孔中流出白色甘露周遍十方以灑一切眾生之身以此因緣能令種子漸次滋長故名內護摩也。",
        "translation": "Next, answering the meaning of \"guard mo,\" you should know that there are two kinds of guard mo, one internal and two external. Guard mo means to burn, and because internal guard mo can burn away karma, it means that all sentient beings are born from karma, and because of karma there's no end to the cycle of births and transmigration, so births can be removed as well, which is to attain liberation. If someone can burn karma, that's called internal guard mo. Where does they attain liberation? It means they attain liberation from the affliction and suffering of karma.",
        "source": "X23n0438_011:0455c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋外護摩者有其三種一本尊二真言三印(〔麤本尊也為供養故置之隨所宗之門而置之或可是漫荼羅位也更問麤爐置火處也此即真言也火中有麤印也即是阿闍棃座處也自身即是印〕)當作外護摩時今此三位正相當也此三亦是淨三業義三位謂身鑪本尊三位各有三謂本尊真言印也淨三業成三事也謂息災等也註淨三業者本尊是意業真言是口業師身之印是身業由此因緣能淨三業成三事謂息災增益降伏也三業道者道是會義言與理同同故會也汝等所行是菩薩道即是三道同歸一致也又三事觀字各異若作息災觀囕字當上加點而作白色增益想囉字黃降伏想字或黑或赤如字者本尊及自身色亦如是三事相應即成也就中復有上中下差別謂息災為上增益為中降伏為下也如是作者名外護摩當知此內外護摩皆名殊勝若不與此相應徒作無益也由作外護摩故能令引入內護摩中然內外之理本無差別為求世間成就者作此分別令作外護摩耳若異此者謂不依所說方軌當知此人無所知解唐捐其功無有果報也由離於真言之智隨己無明之心而妄作之終不能得世出世間悉地之果故云不得果也。",
        "translation": "When he takes external guardianship, there are three kinds: one is the honored one, two are the spoken word, and three are the seal ([the GMP honored one is placed there for the sake of making offerings, and it's placed according to the approach of the school, or it might be the maṇḍala stage, or it might be the place where the GMP stove is placed in the fire, which is the spoken word and the GMP seal in the fire, which is the place where the Ajñātaśatru's seat is located, and he himself is the seal]).",
        "source": "X23n0438_011:0456a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次答色及形類然大略有三部毗盧遮那是佛部即是如來法界之身一向白色次觀世音即是阿彌陀佛也其身黃色次金剛藏即是釋迦牟尼其身赤黃色(即雜色也)。",
        "translation": "Next, he answers the question of form and shape. There are three divisions of the Tathāgata family: the Vairocana family, which is the Buddha family, and the Tathāgata's Dharma body, which is always white, the Avalokitêśvara family, which is Amitâbha Buddha, and his body, which is yellow, and the Vajragarbha family, which is Śākyamuni's body, which is red and yellow (i.e., a mixture of colors).",
        "source": "X23n0438_011:0456b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說諸真言及諸佛所說者上言佛是舉佛部下言諸作是佛所說真言謂毗盧遮那所說也如來部中諸真言部謂從佛所生乃至諸神佛所許可皆是佛部也下云諸佛者直是諸佛所說不通菩薩以下也此二種皆具二種色謂白黃也此但云應當知以白黃和合也謂不太黃不太白也雜色謂具五色也。",
        "translation": "The Buddhas who speak the true words and the teachings of the buddhas are those who say, \"The buddhas are the group of buddhas,\" and those who say, \"The works are the teachings of the buddhas,\" and those who say, \"The true words are those that arise from the buddhas and those that are approved by the gods and buddhas,\" and those who say, \"The buddhas are those whose teachings don't reach the bodhisattvas and those who are below.",
        "source": "X23n0438_011:0456b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第應當知金剛手雜類觀自在諸真言自事分者謂隨事分別而用之也佛部一向是息災用其色當白自事業分觀音純白然其部中則隨事業變轉也蓮華部一向是增益用其色黃金剛部一向是降伏用其色雜雜色謂具五色也亦隨一部中自有三事分別如佛部中自有息災增益降伏也若息災即依本法而作白色若佛部作增益時但依此法而作黃色若佛部中降伏者但依此法轉作雜色即是也如佛部者當知蓮華部金剛部類可解也自事分者謂隨色類而分其事也觀自在諸真言者此中諸聲即是舉蓮華以例佛及金剛部也。",
        "translation": "In order, you should know that the Jingang hand and the mixed categories of Avalokitêśvara truly speak their own thing, which is to discriminate and use them according to their situation. The Buddha group has always used its color to calm disasters, but its color should be white.",
        "source": "X23n0438_011:0456b17_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次說漫荼羅形計合息災在前今隨聲便事便增益在前也諸增益事漫荼羅方□而中黃色息災壇圓○而中白色降伏壇三角△其中黑色攝召壇半月其中雜色攝召謂雜取物呼召等也經云四方普者是舉一例諸也如中壇方者乃至外院皆方若中圓者乃至外院次第皆圓壇中方謂方則普皆方若圓亦如是次第也三角等亦然護摩作鑪亦爾若壇方火壇亦方也餘皆例知耳。",
        "translation": "Next, the maṇḍala is a combination of form, calming disaster in the front, and now following the sound, the matter is gained in the front, and the gaining matter maṇḍala is square, and the yellow calming disaster altar is round, and the white subduing altar is triangular, and the black summoning altar is half-moon, and the mixed color summoning means to gather various things and summon them.",
        "source": "X23n0438_011:0456c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明色類謂形像也應以相皃為正義也亦可謂色像也偈云色像初應知初謂我今說也然諸尊色類種種不同大而言之略有二種謂男及女男是智慧故名為首女是三昧為次之也或一切處隨顯形色者如此經中或復餘經尊形或隨一切處顯形色謂應物示形不定故名不思議也各各不同然以類判之若言作白色即是息災用黃色即增益餘可解也見彼男女之殊及色貌即知所用處矣不思議智生者如本尊合作白色然須作增益事隨行者心觀作黃色即有增益之用隨心而轉然所作事皆實不虗由不思議智故得然也今謂法界之色於一色中即是一切色能觀之智亦與境相攝故得如是自在而用也為除無智故有種種智生雖知無量智其實是一智前云智是一切智也以一智現一切智也。",
        "translation": "The next explanation of form refers to appearance, which should be the correct meaning based on the shape of the form, and it can also be referred to as form. The verse says that the first thing you should know about form and appearance is that I'm explaining it now.",
        "source": "X23n0438_011:0456c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前問本尊形量大小今次答之然佛普門示現皆為應赴群機機既萬差當知垂應亦大小無定也至論一一本尊之形莫不量同法界無有邊際及與始終由智有淺深量有大小故所見身各各差別是故當知所觀本尊隨行者心大小無有定量也(當明密迹經三密事)所云證智者即是佛也以無盡之智而證無盡之境如函大葢亦大也。",
        "translation": "The previous question was about the size of the form of the honored one, and this time I'll answer it. However, the universal manifestation of the Buddha is to respond to a multitude of abilities, and since there are myriad differences in abilities, it should be understood that the size of the reciprocal response is also indeterminate.",
        "source": "X23n0438_011:0457a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前問尊形量中兼問坐及印今亦答之身既無有定量當知座及印亦如是(乃至心能廣座亦稱彼量也印亦如是其次第謂隨其大小也〔令〕尊與座相稱)。",
        "translation": "In the previous question about the amount of the honored one's form, he also asked about the seat and seal. Now, he also answers this question. Since there's no amount of the body, you should know that the seat and seal are likewise (even if the mind can expand the seat, it's also called that amount.) The seal is likewise, and it follows in order, meaning that it follows the size [of] the honored one and the seat accordingly).",
        "source": "X23n0438_011:0457a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次答此印從何生者(〔又次第者從佛至天亦是〕)佛言如佛所生處印亦如是從於彼生也所以者何一切如來皆從佛性種子菩提心生當知一切印亦從菩提心生也印從法界生而印弟子如王以印印之一切信受今以一切法界生印印之即法印也即是大人相印也。",
        "translation": "Next, he answered, \"Where did this seal come from?\" ([Also, in order, from the Buddha to the gods]) The Buddha said, \"Such is the place where the Buddha is born, and the seal is thus produced from there. Why is that? All tathāgatas are born from the buddha-nature seed, the bodhi-mind. You should know that all seals are also produced from the bodhi-mind. The seal is produced from the Dharma realm, and it seals the disciple, just as the king uses the seal to seal all those who believe in it. Now, he uses the seal produced from all the Dharma realm to seal it, which is the Dharma seal and the seal of the great personage.",
        "source": "X23n0438_011:0457a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次答此印作何用者以此法界生印印於弟子也印是不可違越義由自及佗皆不違越故謂始從菩提心乃至究極佛慧於是中間不退不轉是故世間號之為菩提薩埵由此印故住菩提心更不退轉故名不違越也當知此印即是印生死門開法界路略而言之此印量同法界由以此法界之印印之即令彼人以有法界之標幟同法界普門之身故名印於弟子也以法界印為略謂以一法印之也若廣不可稱數此即大人之標相也。",
        "translation": "Next, he answered, \"What's the purpose of this seal?\" This is the seal that's produced from the Dharma realm and sealed to the disciple. The seal is the meaning of not being transgressed, because from the beginning, the mind of enlightenment up to the ultimate Buddha's wisdom is not retrogressed or changed in the interim.",
        "source": "X23n0438_011:0457a22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前問灌頂有幾種今次答之佛子善聽者準梵本正語當具言慇懃諦聽何以上來諸問不言善聽至此方說耶然餘法若不善聽致有忘失其過猶小若灌頂不成則不合聞真言及印等是皆不得作此過尤大故殷勤誡之也譬如世間剎利之種謂欲紹其繼嗣令王種不斷子故為其嫡子而作灌頂取四大河水以四寶缾盛之種種嚴飾又嚴飾子身眾物咸備又飾大象於象背上持缾令太子坐於壇中所統畢集於象牙上瀉水令流注太子之頂灌此水已大聲三唱汝等當知太子已受位竟自今已後所有教敕皆當奉行今如來法王亦復如是為令佛種不斷故以甘露法水而灌佛子之頂令佛種永不斷故為順世法故有此方便印持之法從此以後一切聖眾咸所敬仰亦知是人畢竟不退於無上菩提定紹法王之位諸有所作真言身印瑜伽等業皆不敢違越也然灌頂有三種一者但以印法作之離諸作業此是入祕密漫荼羅謂有弟子誠心殷重深樂真言之行志求大乘然資力乏少若令一一具求眾事反當於道有礙如是之人師當深起慈心觀彼心行而攝引之然但得為此一人而作之不得多為人作何以故恐彼資力能辦者生怠慢心而不盡心植眾德本故作時隨力令辦少供供養三寶此第一最勝謂本尊身語意三合為一三俱淨故以此印印之此最勝也師祕受其真言手印之類也(初但以手印二具足法事三在三昧灌頂也)二者以作事業而灌頂者即是師及弟子皆先作事業也謂先令弟子七日以來誠心禮悔之類也師亦於七日以來為其持誦祕求感應及令辦諸供物香華之類緣壇所須一一令作然此之灌頂與前者不殊但以有資力故令盡其所有力於諸佛海會之中而作無盡供養由此因緣福施之果不可窮盡故須灌頂勸彼令具作也三者但以心而作灌頂如是灌頂不擇時不擇方(謂向東設位或向南等皆得也)由此弟子已修真言之行於祕密藏中有所堪任令師心悅此又最勝也師弟俱得瑜伽以心灌頂猶如摩頂授記也又能盡心承奉其師於種種善事無有違越以是因緣令尊歡喜故為作心想灌頂也其灌頂法瑜伽阿闍棃先入淨室而住三昧如前所說以身四分作四重漫荼羅位亦如毗盧遮那所現之方位一一無異如是作已以祕密加持故令彼弟子先在門外而待命者自然而得金剛手威神加持引之令入亦自然而解作印等一一如法既入室已以金剛手所加持故現覩漫荼羅諸尊之位宛然現前一一本尊之形及印字等亦悉明了爾時行者復以加持力故手中自然蒙授妙華而以供養大眾隨所墮本尊之處其尊即起以妙音聲而安慰之為作攝授爾時本尊即取一一大會諸尊處甘露三昧之水而為彼弟子現前灌頂爾時阿闍棃但坐一處而入三昧寂然不動而能成就如是勝事也令尊歡喜相應謂承事本尊本尊歡喜以行者現前而為灌頂以遍數及行具作故也承事念誦令尊歡喜現前說法如所說作之也準前例之如弟子能事師令歡喜師為灌頂教授也。",
        "translation": "The previous question was, \"How many kinds of consecration are there?\" This time, I'll answer it. The Buddha's good listener is someone who according to the Brahmā's text correctly says, \"Listen attentively.\" Why didn't the previous questions say, \"Listen attentively?\" Until now, the questions haven't been answered with good listening, but this is a minor misdeed. If the consecration isn't done, then he won't hear the true words and seals, and so forth.",
        "source": "X23n0438_011:0457b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次答三昧耶有幾種者今世尊答略有五種也三昧耶者如有人於眾多國王大臣所尊重集會之處而自發言作大要誓我今如是之事永當不作如是之事依行之以自對可信之人而發誠言若有所違即得重罪是故三昧耶者即是不可違越義也略而言之即是戒義也此中五種者第一但得遙見漫荼羅謂如造漫荼羅時謂見具足漫荼羅也忽有諸人善心隨喜欲求禮拜供養爾時阿闍棃聽令引入於壇外遙令禮拜以華香等遙散道場而作供養以得見如是法會故無量辠業皆得滅除然未合授彼真言及印是第一也第二見漫荼羅坐位謂引彼入於壇中禮拜供養投華散於本位師告彼汝華墮某尊位上為說本尊名號并得入壇門內悉見諸位也此人說名為第二三昧耶也若請真言及印亦得隨所應者授之第三見漫荼羅及印位并作諸事者謂阿闍棃從首至末為此人而作漫荼羅乃至諸尊及印等一一告示又授真言手印一一行法皆教授之此是第三也第四者已能依隨行法修真言門所有法則一一通解具知緣壇所須方便眾藝堪在師位悅可師意師即為作傳教漫荼羅告言汝自今以後亦如我無異造漫荼羅度諸弟子令法久住佛種不斷故此第四也第五即是祕密三昧耶如教所說印壇配位皆見若不經入此壇祕密智不生也是故當於祕密壇中如法作灌頂是名第五智者應知也若異此者不名三昧耶也即前所說第三灌頂時所入也若異此五事不名善作三昧耶然祕密漫荼羅復自有五種第一謂於師所授得真言印法依教修行與瑜伽相應得於定中見諸尊大會然未蒙引入(此例如第一人)次第二人已蒙引入祕密壇中得巡禮供養而未蒙聖尊現為灌頂等第三既蒙引入大聖眾中從初至末一一祕密之行皆蒙聖者方便告示如第三人也第四者已善修行祕要之道現蒙諸尊為作祕密傳教三昧耶即為如來所使行如來事也第五已具前事又見己身於大會中自作阿闍棃師即是入地人也此人纔入三昧即見一切佛會乃至十世界微塵大會悉能集之而於其中同彼尊位也若觀察於意善住(告金剛也)覺其心不得於三處真言者得菩薩名謂以義得名也由自有覺不著三處謂自身所觀法及成時若著此三不名覺心以於此三無所得名菩薩也前說菩薩義依法相說今此以義得名也。",
        "translation": "How many kinds of samaya are there? The Bhagavān's answer now has five kinds. A samaya is like a person who speaks at a place respected by many kings and ministers and makes a great vow that I will never do such a thing now and acts accordingly, speaking sincerely to a trustworthy person and saying, \"If I do anything contrary to this, I will commit a grave sin.\" Therefore, samaya is the meaning of not transgressing and, in a nutshell, it's the meaning of the precepts. The five kinds are first, simply seeing the maṇḍala from a distance, which is like seeing a fully-equipped maṇḍala when it's being built.",
        "source": "X23n0438_011:0458a16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "金剛手前問劑幾時得菩薩名者今次答之若觀意心覺善住三處不得持誦者說名觀謂始從師處受瑜伽法略有三事謂心觀本尊口有真言身有法印汝當如是觀之既受法已如聞修行得了了明徹猶如鏡中而覩面像是為觀也覺者覺了自心境界真實之法也善住者即指金剛手佛說法次號名而告之也或可同彼修行之人猶覺了自心故得無所住而住故名善住也既得如是與法相應得見本尊無量境界廣博嚴淨不可思議行者爾時以無所得而為方便以智慧觀察如是之法從內生耶從外來耶從內外合生耶行者於自身心即名為內本尊境界是所對境名之為外是二合緣名為中間如是觀察了知此法種種不思議境不從內出不從外來亦非內外和合中間而有當知本來清淨畢竟無所得無所生也(外境內身以心觀〔察〕為中間)此三事悉除即是本來清淨一相平等也所以者何以行者內心外境及心緣和合正觀察時此三事和合即有不思議觀境現前以三事和合從緣起故當知即是無生無性不可得也復次行者身有祕印口有真言心有本尊境界之觀以三事畢竟無生故即是三輪清淨一相平等也由行者離於三執淨於三輪而離四相劑此以來即得菩薩名也(四相謂我人眾生壽者如金剛經中分別也)。",
        "translation": "The Vajrapaṇi asked when the practitioner attained the name bodhisattva and this time he answered, \"If he observes the mind and mental awareness, he well abides in the three places where he can't recite, he says the name observation means he first receives the yoga teaching from the master. There are three things, namely, the mind observes the Bhagavān, speaks truly, the body has the Dharma seal, and you should observe them in this way.",
        "source": "X23n0438_011:0458c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毗盧遮那成佛神變加持經義釋卷第十一",
        "translation": "Commentary on the Sutra of the Spiritual Transformations and Empowerments of Mahāvairocana, Volume 11",
        "source": "X23n0438_011:0459a13_0",
        "is_bad_quality": false
    }
]