[
    {
        "source_sentence": "大毗盧遮那成佛神變加持經義釋演密鈔卷第三燕京圓福寺崇祿大夫撿校太保行崇祿卿總秘大師賜紫沙門　覺菀　撰【疏】例如彌勒菩薩等者即法華序品之意彼云爾時彌勒菩薩欲自決疑又觀四眾比丘比丘尼優婆塞優婆夷及諸天龍鬼神等眾會之心而問文殊師利以何因緣而有此瑞神通之相放大光明照於東方萬八千土悉見彼佛國界莊嚴乃至偈云佛坐道場所得妙法為欲說此為當受記最後文殊答云我見燈明佛本光瑞如此以是知今佛欲說法華經若例此者謂如來將演此平等句法門先現瑞相因彼金剛手疑問而演說之配合易知言憤憤悱悱者子曰不憤不啟不悱不發舉一隅不以三隅反則不復也(鄭曰孔子與人言必待其人心慣憤口悱悱乃後啟發為說之如此則識思之深也說則舉一隅以語之其人不思其類則不復重教也)言文殊發揮者發謂發明揮謂揮揚即文殊發揮為遣彌勒之疑言令動執等者動者隨也徒眾也隨執之徒眾即如來演說為破二乘之執人彼徒經云我本著邪見為諸梵志師世尊知我心拔邪說涅槃我悉除邪見於空法得證爾時心自謂得至於滅度而今乃自覺非是實滅度乃至云其心安如海我聞疑網斷言譬如春陽等者禮記月令云孟春之月天氣下降地氣上騰天地和同草木萌動季春之月生氣漸盛陽氣發洩勾者畢出萌者盡達(注云屈而生者曰勾芒而直者曰萌)又易曰天地解而雷雨作雷雨作而百果草木皆甲坼言雷風鼓動等者雷風者雷者陰陽相激出聲之謂也穀梁傳云陰陽相薄感而為雷風者氣也莊子云大塊噫(依界反)氣其名曰風(注曰言天地噫氣則萬竅怒號而為風)又雷即風也楊泉物理論曰積風成雷鼓動等者易曰雷以鼓之風以動之雨以潤之得離莩殻者莩者苞中白皮殻即甲也油然者生長之皃孟子曰油然作雲霈然作雨謂由雷風鼓動時雨潤洒遂令萌芽離於莩皮甲殻油然出生增長也此上皆喻動執之徒得離疑網言若無機之人等者無機即闡提五千之輩雖遇靈山法華際會由無佛種性故而不能發起深固大菩提願二利之益故涅槃經云無種性人無種性故雖復勤行精進終不能得無上菩提譬如地中宿無根種雖遇春陽雷雨作解終無勾萌甲坼之理故曰若無機之人等。",
        "translation": "For example, Maitreya Bodhisattva and so forth is the meaning of the preface to the Lotus Sutra, which says that at the time Maitreya Bodhisattva wanted to resolve his doubts and was observing the minds of the four groups of monks, nuns, upāsaka, upāsikās and gods, dragons, and demons, and asked Mañjuśrī what causes and conditions led to this visionary superknowledge that radiates light, shines brightly, and illuminates the 18,000 lands in the east, and sees all of the Buddha's realms adorned, and even the verse says that the Buddha sits on the site of enlightenment and obtains the wonderful teaching in order to explain this as a record of future acceptance. Finally, Mañjuśrī answered, \"I saw a lamp, a bright light, and the Buddha's original luminous ray was so brilliant that I knew the Buddha wanted to explain the Lotus Sutra.",
        "source": "X23n0439_003:0547b12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "【疏】汝當諦聽極善作意者深心曰諦屬耳曰聽聆音察理名善作意。",
        "translation": "[Commentary] Those of you who listen closely and are extremely well-contemplated are those whose deep mind says they listen closely, whose ears say they listen, and whose listening to sounds and observing principles is called well-contemplated.",
        "source": "X23n0439_003:0548a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】用心聽法有二十種功德者疏指無盡意經未見其文如智度論云有人若聞若受阿字印教時當得二十種功德何等二十初得強識念者謂菩薩得是陀羅尼常觀諸字相修習憶念故得慚愧者謂集諸善法厭諸惡法生大慚愧心故得堅固者謂集諸福德智慧故心得堅固猶如金剛乃至阿鼻地獄事尚不退於無上菩提何況餘苦耶得經旨趣者謂知佛五種方便說法一者知作種種門說法二者知為何事故說三者知以方便故說四者知示理趣故說五者知以大悲心故說得智慧者謂菩薩因是陀羅尼分別破散諸字言語名義悉皆空故得畢竟空即是般若波羅蜜智慧得樂說者謂既得如是畢竟清淨無礙智慧以本願大悲心廣度眾生故得樂說易得陀羅尼者謂譬如折竹初節既破餘者皆易菩薩亦爾得是文字陀羅尼諸陀羅尼自然而得得無疑悔心者謂入諸法實相中雖未得一切智慧於一切深法中無疑無悔故得聞善不喜聞惡不怒者謂各各分別諸字無讚歎無毀呰故得不高不下住心者謂憎愛斷故得善巧知眾生語者謂得解一切眾生語言三昧故得巧分別蘊處界十二支四緣四諦等法行相頗多不及繁引得巧分別眾生諸根利鈍者謂一切根有同鈍同利有一切根不同根不同利乃至是人欲縛而得解是人欲解而得縛譬如鴦群梨摩羅欲殺母害佛而得解脫如一比丘得四禪增上慢故還入地獄知是人必墮惡道是人難出易出疾出久久出一切眾生上下根相皆悉遍知得巧知他心者謂能知一切有情心行差別故得巧分別日月歲節者謂日名從旦至旦初分中分後分夜亦三分一日一夜有三十時等得巧分別天耳通者謂能聞若遠若近一切聲等得巧分別宿命通者謂宿命有三種有通有明有力凡夫人但得通聲聞人亦通亦明佛全具此三所以者何凡夫人但知宿命所經不知業因緣相續以是故有通無明聲聞人知集諦故了了知業因緣相續生以是故聲聞亦有其明問曰通明之義如是云何名力耶答曰佛用是明知己身及眾生無量無邊世中宿命因緣所更種種之中事悉能遍知是名為力也得巧分別生死通者謂佛用天眼見眾生生死之處凡夫人用是天眼極多者見四天下聲聞人極多傍見小千世界乃至佛入餘三昧天眼不滅是故遍知一切眾生生死所趣得巧說是處非處者謂修善行生人天若造惡業生三塗等因果相當名是處因果不相應名非處又善名為是處不善等名非處故得巧知往來坐起威儀者謂出入去來坐臥行住常念一心舉足下足安隱庠序一心視地而行等是名聞法所獲二十種功德也。",
        "translation": "[Commentary] There are twenty merits in attentively listening to the teaching. The commentary refers to the Sutra on the Endless Mind, the text of which is not yet seen. According to the Discourse on the Wisdom of the Way, if someone hears and accepts the teaching of the letter a, they will attain twenty merits. What are the twenty first attaining strong consciousness and mindfulness? This refers to the bodhisattva attaining this dhāraṇī and always observing the characteristics of words and cultivating their recollection.",
        "source": "X23n0439_003:0548a04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "【疏】得深信力者謂深心淨信此信有力得離疑惑故下疏云且三乘實相無不離於文字而真言者要須口誦梵文心亦觀之或屈申支節猶如戲弄或修三昧乃觀女人之像或忿怒等形或以水灌頂或造作火壇若欲以心識籌量則加持之迹又不可見自非具淨信者安得不疑惑耶即當思惟幻喻如藥物和合而得昇空住壽亦非利根智慧所能思議但能妙解其術無不成者以此深心離疑故又若人聞是經以宿殖善本神情明利知眾生心中決有此理雖不可比量籌度處即能信解故曰深信此信有力故曰信力言離業受生等者謂以無明故造作諸業乘業受生謂離如是業受生故而得真實菩提性生故曰離業受等。",
        "translation": "[Commentary] Attaining the power of conviction means deep, pure faith, which is powerful and freed from doubt and confusion. The following commentary says, \"Furthermore, the true character of the three vehicles is not free from words, and those who speak the true language must recite the Sanskrit text orally and observe it mentally, or they must recite it orally as if it were a joke, or they must practice samādhi, observe a woman's image or an angry form, or they must pour water on their heads or make a fire altar. If one wants to measure it with the mind's consciousness, then the signs of the empowerment cannot be seen.",
        "source": "X23n0439_003:0548c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】即是白淨信心者即前深信離疑垢故故下疏云譬如弊衣垢膩滋甚則不可頓加染色先當教令澣濯然後可以施彩繪之功眾生亦爾若先習垢深(疑也)則不染諸法界之色若以信水澣令噄白則堪受染又根力雖五信為其初色類有五白當其首故曰白淨信心也。",
        "translation": "[Commentary] This is white pure faith, which is the result of the previous conviction that he's free from the stain of doubt.",
        "source": "X23n0439_003:0548c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】方便為究竟等者一言方便而有二種一自利二利他謂萬行圓極不可復增自利也應物之權究盡能事利他也言醍醐妙果三密之源者醍醐即果德之稱從喻為名也醍醐於五味之中極最精者出乎乳中以乳為本謂諸如來因位身中本有大淨心之乳依大悲萬行以三密方便次第鑽搖經歷眾味至於妙覺醍醐不可變異之相自利果滿也依此而起利他加持三密之身故曰醍醐妙果三密之源也故下疏云如從種子生果果還成種即其義也。",
        "translation": "[Commentary] The term \"skillful means\" means there are two kinds of skillful means: one for self-benefit and the other for the benefit of others, which means the completion of all practices and the inability to add to self-benefit, and the right to respond to things by investigating all that can be done to benefit others.",
        "source": "X23n0439_003:0548c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】規製中權者規矩也作也中(去聲)者不失之義權宜也謂如巧藝成就有所造作隨意皆成所有規矩製作不失於權宜爾言得意之妙等者得意者莊子云言者所以在意得意而亡言吾安得夫亡言之人而與之言哉夫言以利人順天下之望雖終日常說即是亡言故知亡言非杜口而不言但在乎得意可謂妙矣今借用之謂阿字菩提有類真金阿(長)字大悲如習藝者暗字方便如權巧之果譬如有真金隨諸工巧方便之意相皆成所有規矩製作盡乎秘密中道深權出過眾乘之淺巧故其即心得意之妙不從於他又豈同手中菴摩勒果轉以授人古人云法向師邊得能從意上生即不可授人之義也。",
        "translation": "[Commentary] The right to regulate and produce is also the rule, the making, and the middle (deprecatory case), which is the meaning of not losing the expediency.",
        "source": "X23n0439_003:0549a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】三昧道品等者謂三三昧乃至百八三昧道即八正道品即三十七品也。",
        "translation": "[Commentary] The category of the path of samādhi refers to the three samādhis and up to the 108 samādhis, which are the eightfold correct path, or the 37 factors.",
        "source": "X23n0439_003:0549a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】故復指言如上等者前標要令生信此間要如實知謂此甚深微妙之法非一切智人則不能解此法從何處得耶即是行者自心耳今疏復指意要信智具足寶藏疾得現前謂信故不謗為無智故如實了知又若無信則高推望境非己智分若無智則起增上慢謂己均佛為此事故兩處安之也。",
        "translation": "[Commentary] Therefore, the commentary further refers to the statement that it's necessary to faithfully know that this is a profound and subtle teaching that cannot be understood by someone who doesn't have omniscience, which is where the practitioner's own mind gets it.",
        "source": "X23n0439_003:0549a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】梵云阿耨等者阿耨之言或云阿拏此云極微言即是七微合成者謂四方上下及於中間各一極微名為七微謂七極微互相觸著不相離散名為合成言彼法等者即彼從緣生也最微小法也謂阿耨多羅三藐三菩提但是自心若離自心之外更無有似彼七微合成微小之法而可得者也。",
        "translation": "The Sanskrit word anu and so forth is the word anu or aṇa, which is the word for the seven subtle compositions, meaning that the four directions, up and down, and one subtle in the middle are called the seven subtleties, meaning that the seven subtleties touch each other and aren't separated from each other is called the composite, which means that the most minute dharma that arises from conditions is the anu, tārā-samyak-saṃbodhi, which is nothing more than the self-mind, and there's nothing more like those seven subtle compositions of minute dharmas that can be attained.",
        "source": "X23n0439_003:0549b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】經中自說因緣云者因緣者所以義也謂次前經說阿耨菩提心外更無一法也次徵釋所以云何以故虗空無相是菩提等此則經中喻顯所以也。",
        "translation": "[Commentary] The sūtras themselves say that the cloud of causes and conditions is the reason for the meaning of \"causes and conditions\" which means that the next sūtras say that there's not a single thing outside of the mind of unsurpassed enlightenment, and the next syllogism explains why it's called \"Why is it that space has no characteristics and this is enlightenment?",
        "source": "X23n0439_003:0549b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】譬如虗空等者疏釋喻也遍一切處者謂無邊際故畢竟故者一切色像無能染污故離一切相者離明暗方圓去來一異等故無動者假使旋嵐等風不能動故無分別者無知解相無開曉相故不可變易者不隨晝夜四時有遷改故不可破壞者世界壞時虗空在故以如是等者謂無相菩提心中有無量無邊秘密等事非世間虗空之所能喻但取其離相不動等少分相似故以為喻耳。",
        "translation": "The commentary explains that this is a metaphor that pervades all places, meaning there's no limit, and so it's ultimately the case that all forms and images are unsullied, so it's free from all characteristics, meaning it's free from light and darkness, square and round, going and coming, uniformity, and so forth.",
        "source": "X23n0439_003:0549b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】唯是心自證心等者謂諸佛自證三菩提在一切眾生相續中法爾成就無有缺減要由自證自覺非他傳授若從他言語而受得者釋迦佛蒙定光授決即應成佛何故具修萬行要待無師自覺方名佛耶譬如目覩世人為刀杖所傷雖信其受苦不疑然種種令說終不證知苦自觸受乃明了耳。",
        "translation": "[Commentary] Only the mind realizes its own mind and so forth means that the buddhas realize the three bodhisattvas' enlightenment for themselves in the continuity of all sentient beings without any loss based on their own realization and self-realization, not on transmission from others. If they had received it through the words of others, then Śākyamuni would have become a buddha after being given the decision by the light of meditation.",
        "source": "X23n0439_003:0549b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若分別少分等者若於諸佛自證三菩提虗空之上分別少分能所者即是取著法非法等豈得名為金剛慧耶金剛慧者即般若也言不離我人等者執取自體為我計我展轉趣於餘趣為人計我盛衰苦樂種種變異相續為眾生計我一報命根不斷而住為壽者故金剛經云須菩提可以身相見如來不乃至云若心取相若取法相若取非法相即著我人眾生壽者汝等比丘知我說法如筏喻者法尚應捨何況非法等故下轉釋云何以故菩提無相故。",
        "translation": "[Commentary] If someone discerns a small part of what's applicable and what's not above the level of the buddhas' self-realization of the three bodhisattvas, that's attaching to what's legal and what's not legal, how can it be called vajra wisdom? Vajra wisdom is prajñāpāramitā, which says that people who don't part from self and others attach to their own bodies, imagining themselves to be self and going to other destinies, imagining themselves to be prosperous, declining, painful, and pleasant, and the continuity of various transformations, imagining themselves to be the single reward for sentient beings whose life root is uninterrupted and abiding, and so forth.",
        "source": "X23n0439_003:0549b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】雖復離諸至成就者謂如來常說一切智智離諸因緣今言若瑜伽行者正觀三法心虗空菩提與實相等豈非因緣耶然前說離諸因緣即是離執取心外妄想之因緣而非無法界無分別之因緣故云雖復離等。",
        "translation": "Although it's true that the Tathāgata always says that the wisdom of omniscience is free of causes and conditions, is it not true that if a yogic practitioner correctly observes the three dharmas, mind, space, and bodhi are equal in reality, then it's true that the aforementioned freedom from causes and conditions is a freedom from the causes and conditions of deluded conceptions outside of the mind that are attached to the nonexistence of the Dharma realm and the lack of discriminated causes and conditions, so it's said that although it's true, it's true that it's a freedom from causes and conditions.",
        "source": "X23n0439_003:0549c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】開發心明道者開謂開顯發謂發生心即自心明即光明道即遊履之處下疏云以覺心本不生際其心淨住生大慧光明普照無量法性見諸佛所行之道故云開發等。",
        "translation": "[Commentary] 'Develop the mind and luminous path.' 'Develop' means to reveal, 'develop,' means to occur, and that's the mind itself, the luminous path, and that's the place of travel. The following commentary says that because the awakened mind is originally unarisen, the pure abiding of the mind produces great wisdom, which illuminates the innumerable nature of things and sees the path practiced by the buddhas, therefore it's called 'developing,' etc.",
        "source": "X23n0439_003:0549c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】謂非想處即是涅槃者謂一類外道得彼非想非非想處定計此最極清淨處以為涅槃也。",
        "translation": "[Commentary] The expression 'the state of non-conception is nirvāṇa' means that a certain type of non-Buddhist attains the state of neither perception nor non-conception and conceptualizes this most extremely pure state as nirvāṇa.",
        "source": "X23n0439_003:0549c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如犢子阿毗曇者犢子即附佛法外道也此外道以聰明讀佛經書而生一見附佛法起故得此名犢子讀舍利弗毗曇自製別義言我在餘師四句外不可說藏中收云何為四句外道計色即是我離色有我色中有我我中有色四陰亦如是合二十身見今犢子計我異於六師乃是非即非離我復非佛法諸論皆推不受便是附佛法邪人也此師立五法藏謂三世無為及不可說藏也。",
        "translation": "[Commentary] Ru calves abhidharma: Calves are heretics who attach themselves to the Buddha's teaching. This heresy is due to their intelligence and reading of the Buddha's sūtras and books, which gives rise to a single view that's attached to the Buddha's teaching. Calves read Śāriputra's abhidharma and create their own special meaning, saying, \"I'm in the ineffable store outside of the four statements of the other masters.\" What are the four statements? Heretics believe that form is self, that's free from form, that there's self, that there's self in form, and that there's form in self. The four aggregates are likewise.",
        "source": "X23n0439_003:0549c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】非見非顯現者心體向外名能見相變似外境名能現相反此名非見非顯現也。",
        "translation": "[Commentary] Not seen, not shown is called the mind body facing outward, which is called the subjective view and resembles the external object, which is called the subjective view and not shown.",
        "source": "X23n0439_003:0550a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如長爪至是見者言長爪者非本名也本即摩訶俱瑟耻羅此云大膝膝蓋大故是舍利子外舅以舍利子在母腹時俱瑟耻羅論義常不如姉遂往南天竺誓願不剪爪甲不洗身垢學得十八圍陀論已頂戴火盆鐵鍱鍱腹歸來擬攝外甥以為弟子其姉告曰汝外甥已與佛為弟子遂來求佛論義世尊問曰汝宗若何答我不受一切法為宗世尊返問汝還不受一切法不梵志而語佛言瞿曇我一切法不受佛問長爪汝一切法不受是見受不佛所質義汝已飲邪見毒今出是毒氣言一切法不受是見汝受不爾時長爪如好馬見鞭影即覺便著正道長爪得佛語鞭影入心即棄貢高慚愧低頭如是思惟佛置我兩處負門中若我說是見我受是負處門麤故眾人所共知云何自言一切法不受今受是見此現前妄語是麤負處門多人所知第二負處門細我欲受之以少人知故作是念已答佛言瞿曇一切法不受是見受不受佛語梵志汝不受一切法是見亦不受則無所受與眾人無異何用自高而生憍慢長爪不能得答自知墮負處即於佛一切智中起恭敬信心自思惟我墮負處世尊不彰我負不言是非乃至出家作沙門得阿羅漢等出智度論。",
        "translation": "[Commentary] Like Longclaw, he said, \"Longclaw\" is not the original name, but the original is Mahākusumitarāja. This is the word for a large knee and knee cap, so it's Śāriputra's maternal uncle. He vowed not to cut his nails or wash his body when he was in his mother's womb. He then returned to the southern India, vowing not to cut his armor or wash his body dirt.",
        "source": "X23n0439_003:0550a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】猶未能遠離心之影像者謂餘遠離方便菩薩以種種門觀人法二空修對治之道漸除心垢設經多劫未得遠離心之影像今此真言行者直以真言為乘超入淨菩提心門直觀心之實相了知本不生故即是見於初法明道心之影像淨若虗空故下疏云譬如世人以舟車跋涉經險難惡道更有一人直乘神通飛空而度其所經過及所至到之處雖則無異而所乘法有殊耳。",
        "translation": "[Commentary] Still unable to part with the mind's images means that other bodhisattvas who part with the skillful means use various approaches to observe the emptiness of both people and things to cultivate the corrective path to gradually remove the mental pollution if they haven't succeeded in parting with the mind's images after many eons.",
        "source": "X23n0439_003:0550b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】少用功力者少者不假多時多行行多對治即上云如餘遠離方便諸菩薩漸次修習戒定智慧於無量劫以種種門觀人法二空猶未能遠離心之影像又如餘菩薩志求無上菩提種種勤苦不惜身命經無數阿僧祇劫或有成者或不成者今此真言門菩薩若能不虧法則方便修行乃至於此生中逮見無盡莊嚴加持境界非但現前而已若欲超昇佛地同大日如來亦可致也故云少用功力。",
        "translation": "[Commentary] \"Little effort\" means little, which doesn't leave much time and much practice, and many counteracts, which is the above teaching, such as the remaining bodhisattvas who gradually cultivate morality, meditation, and wisdom with various approaches to observing the emptiness of both humans and dharmas over measureless eons still haven't been able to separate from the mental images.",
        "source": "X23n0439_003:0550b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】謂根本煩惱乃至八萬等者根本即貪瞋癡慢疑此五是一切煩惱之根本故下疏云以眾生煩惱心常依二法不得中道故隨事異名輙分為二就此二中復更展轉細分約上中下九品等乃至成八萬塵勞廣則無量言八萬四千者如俱舍云如實行對治所治貪等八萬行別能對治道其數亦然謂貪瞋等十種煩惱一一皆以九為方便足成一百前分一百後分一百合成三百置本一百就前分一百一一皆以九為方便合成一千後分亦然復成一千兼本一百成二千一百已起未起各有二千一百足滿四千二百約彼多貪多瞋多癡著我思覺五人一一皆有四千二百成二萬一千對治三毒等分四人一一皆有二萬一千遂成八萬四千今真言行者由得除蓋障三昧見此八萬四千煩惱真實相成八萬四千功德寶聚矣。",
        "translation": "[Commentary] It means the fundamental afflictions up to 80,000, etc. The fundamental is greed, anger, delusion, and doubt. These five are the root of all afflictions, so the following commentary says that because the afflicted minds of sentient beings always rely on two things and don't attain the middle way, they change their names according to the situation, transiently divide into two, and within those two, furthermore, they are subdivided into the upper, middle, and lower nine classes, etc., up to 80,000 defilements, which are countless in scope. 84,000 means, as Kushya says, that if you practice the corrective, the 80,000 practices that correct greed and so forth are individually corrective to the path, and so are their numbers.",
        "source": "X23n0439_003:0550b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然非究竟等者皆通妨也謂有妨云既言自覺心故便名為佛佛者覺滿義既稱覺滿何不作諸神變普現莊嚴耶通釋云然非究竟妙覺如初日至十四日月光垂圓暗垂盡未能動大海潮從此一轉入於妙覺智光圓滿不復可增如十五日月方能動大海潮不應未得謂得執初心為究竟故云然非究竟等。",
        "translation": "[Commentary] However, those who are not ultimately aware are all generally obstructed, meaning there are obstructions that say since it's called the self-realized mind, it's called the Buddha.",
        "source": "X23n0439_003:0550c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】制止八到者行者得住無為戒故逮見不思議中道甚深緣起即能制止八到八者外道謂世間為常樂我淨為四二乘謂永寂為涅槃則無常樂我淨復為四倒若謂二乘無常樂我淨之四德此約與之若奪二乘既不如實以其漫該如虫食木偶得成字故況不了生死實相即是涅槃安能離於八倒哉。",
        "translation": "[Commentary] Stopping the eight arrivals is a practitioner who attains abiding in the precepts of doing nothing and therefore acquires the view that the middle way of inconceivable and profound dependent arising can stop the eight arrivals.",
        "source": "X23n0439_003:0550c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】迦葉亦云至邪見人者此涅槃經佛告迦葉善男子謂四倒者於非苦中生於苦想苦生樂想無常常想常無常想無我我想我無我想淨不淨想不淨淨想是名顛倒乃至迦葉菩薩白佛言世尊我從今日始得正見世尊自是之前我等悉名邪見之人也。",
        "translation": "[Commentary] Kāśyapa also said, \"Until now, Bhagavān, I've attained right view. Bhagavān, before this we were all called people of wrong view.",
        "source": "X23n0439_003:0550c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】雖無量天魔等者問無量天魔皆悉化作佛身各說相似波羅蜜智度論云一切菩薩皆願欲得薩婆若魔來欲壞作是言是薩婆若空無所有但諸師誑汝耳如虗空無所有無色無形不可知薩婆若亦如是是故說與虗空等諸法者六波羅蜜等趣薩婆若是法亦空薩婆若亦空無所有相是中無得薩婆若者汝唐受辛苦乃至汝今疾悔捨是邪心等天魔既作是說云何不能動其疑網耶故今通曰謂此菩薩照見心明道故於一切法皆悉現前通達無有錯謬故魔不能動故云雖無量天魔等。",
        "translation": "Although there are measureless Devas and Māras, the question is, \"Are there measureless Devas and Māras who all transform into the Buddha's body and each speak similarly to the perfection of wisdom?\" The Wisdom Treatise says that all bodhisattvas wish to attain sarvajña, and when Māra comes and wants to destroy it, he says, \"Sarvajña is empty and lacks existence, but teachers deceive you.\" Just as space is empty and lacks existence, so is form and shape unknowable, so is sarvajña.",
        "source": "X23n0439_003:0551a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】信解力者謂行者明見此中事理必無疑慮猶如鑒井已見濕埿雖未得水知水必近故曰信解轉加精進故名為力也。",
        "translation": "[Commentary] The power of faith and understanding means that practitioners who clearly see these things and principles will have no doubts, just like when you examine a well and see wet water, even though you haven't yet gotten water, you know that the water will come near.",
        "source": "X23n0439_003:0551a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】略有七義故名大乘者此與瑜伽雜集等說或同或異隨教施設不須和會也。",
        "translation": "[Commentary] This is called the great vehicle because it has seven minor meanings. This is the same as the yoga and miscellaneous collections and other teachings, which are either the same or different according to the teaching and don't need to be combined.",
        "source": "X23n0439_003:0551a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】最初開發金剛寶藏等者謂金剛手問佛如是智慧以何為因云何為根云何為究竟世尊答云菩提心為因大悲為根方便為究竟世尊雖如是遂金剛手所問略已答竟然未開示其相次又徵釋云秘密主云何菩提徵也謂如實知自心釋也猶如貧女雖聞家中親有寶藏若不開示無由發取故最初開發顯示自此已後方能發起殊勝加行名為最初言離因業生等者一切眾生由無明等為因造種種業受種種生今離是生而佛樹芽生即是大空生也。",
        "translation": "Although the Bhagavān thus answers Vajrapāṇi's question briefly, he doesn't reveal its aspect.",
        "source": "X23n0439_003:0551a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】八方大風者按易緯曰東北方條風東方明風東南方清明風南方景風西南方涼風西方颼風西北方不周風北方廣莫風是為八方風也。",
        "translation": "[Commentary] The eight directions of the great wind: According to Yi and Wei, the northeastern wind is the eastern bright wind, the southeastern clear wind, the southern scenic breeze, the southwestern cool breeze, the western whistling breeze, the northwestern uncircle breeze, and the northern broad breeze are the eight directions of the wind.",
        "source": "X23n0439_003:0551b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】寂光者寂謂心之實相本自不生永寂無相光者即此心相靈知不昧又寂是三昧光是大慧行者得除一切蓋障三昧生大慧光明即能普照無量法性故曰寂光也。",
        "translation": "[Commentary] Quiescent illumination is quiescent in the sense that the true character of mind is inherently unarisen, eternally quiescent, and markless.",
        "source": "X23n0439_003:0551b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所有說言等者此下十三行疏是形一類執禪者依本智性無作無修鏡本自明不拂不瑩即禪門泯絕無寄宗說凡聖等法皆如夢幻都無所有本來空寂非今始無即此達無之智亦不可得平等法界無佛無眾生法界亦是假名心既不有誰言法界無修不修無佛不佛設有一法勝過涅槃我亦說為如夢幻無法可拘無佛可作凡有所作皆是迷妄如此了達本來無事心無所寄方免顛倒始名解脫石頭牛頭皆示此理便令心行與此相應不令滯情於一法上日久功至塵習自亡則於怨親苦樂一切無礙因此便有一類道士儒生閑僧汎參禪理者皆說此言便為臻極不知至理亡機但是守默癡禪今所破者即其人也。",
        "translation": "[Commentary] All those who say this are the next thirteen lines of the commentary that describe a certain type of adherents to meditation who rely on the original nature of wisdom, have nothing to do, cultivate nothing, and mirror the original insight without whisking or flickering, that is, the Chan school says that worldlings and other dharmas are all dreamy and illusory, have nothing, are originally empty, and are not originally nonexistent, even if this wisdom of attaining nothingness is also unobtainable, the equality of the Dharma realm, the absence of buddhas, and the absence of sentient beings, the Dharma realm is also a nominal name.",
        "source": "X23n0439_003:0551b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】愚童義如先說者上疏云謂六道凡夫不知實諦因果心行邪道修習苦因戀著三界堅執不捨故以為名。",
        "translation": "[Commentary] The meaning of \"foolish boy\" is as explained in the previous commentary, which states that ordinary people in the six destinies don't know the true truth of cause and effect, and their minds cultivate wrong paths, cultivate painful causes, become attached to the three realms, and adhere to them without abandoning them.",
        "source": "X23n0439_003:0551b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如十六知見等者謂外道雖有九十五種大意莫過十六異論故顯揚頌曰執因中有果顯了有去來我常宿作因自在等害法邊無邊矯亂計無因斷空最勝淨吉祥由十六異論次第列者一因中有果宗雨眾外道二從緣顯了宗僧伽論師三去來實有宗勝論四計我實有宗獸主等五諸法皆常宗伊師迦六諸因宿作宗離繫子七自在等因宗不平等因者八害為正法宗諍竟劫起諸婆羅門為欲食肉妄起此計九邊無邊等宗得世間靜慮邊無邊外道十不死矯亂宗矯亂外道十一諸法無因宗無因外道十二七事斷滅宗斷滅外道十三因果皆空宗邪見外道十四妄計最勝宗計婆羅門是最勝種者十五妄計清淨宗現法涅槃者十六妄計吉祥宗曆算外道如是十六種各各自謂大師薄伽梵一切知者一切見者故名如十六知見等。",
        "translation": "[Commentary] Thus, although there are ninety-five kinds of non-Buddhists, their general idea is nothing more than sixteen different theories.",
        "source": "X23n0439_003:0551c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此是那羅延等者此有多說謂圍陀論師計那羅延天能生四姓計梵天能生萬物提婆云從那羅延天臍中生大蓮華蓮華上有梵天祖翁謂此梵天為萬物之祖從梵天口臂髀脚生四姓等又云那羅延天能生梵王梵王為萬物之祖復有安荼論師計本際等不煩具引今此尊貴者即是那羅延天湛然常住如彼人君無為而治輔相造成萬化如有司受令行之更有所尊貴者即指那羅延天也。",
        "translation": "[Commentary] This is Nārāyaṇa and so forth. It's been said that the Vedas school believes that the Nārāyaṇa Heaven can give rise to four castes, that the Brahma Heaven can give rise to all things, and that the Devas say that from the Nārāyaṇa Heaven there arises a great lotus. On top of the lotus there's Brahmā Ancestor, who says that this Brahma Heaven is the progenitor of all things.",
        "source": "X23n0439_003:0551c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】失佛三種法印者義林第一云諸行無常涅槃寂靜諸法無我若加有漏皆苦成四法印今謂波宗計神我三世法為常則失如來諸行無常諸法無我等法印也。",
        "translation": "[Commentary] Losing the Buddha's three seals of the Dharma means that the first one, Yilin, says that conditioned phenomena are impermanent, nirvāṇa is tranquil, and dharmas are without self. If we add contaminants, they're all painful and become the four seals of the Dharma.",
        "source": "X23n0439_003:0552a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】復有計能見者即是真我等者謂有外道計能見者而為真我是一是常復有外道而於六根隨事異名皆生我計故今難云汝言能見我而彼能聞等五為是我不設爾何失二俱有過其過者何若言餘五各是我者我則有六乖是一義汝執見者是一我故此見不可聞覺知故既此六根互不相知是故汝執一見為我不可作六也若言餘五同是一我者我則雖一乖六根故以眼見耳聞各別用故既此六根互不相知是故六根不可作一也若言有非我者故疏難云是亦同疑且徵例云餘五根等既是非我其能見我應亦非我為立量云汝言能見是有法應是非我故宗因云六根之中隨一攝故同喻如五根等反難可知故彼所立是不極成。",
        "translation": "[Commentary] Furthermore, there are those who believe that the one who can see is the true self, which means there are non-Buddhists who believe that the one who can see is the true self, and that it's one and constant. Furthermore, there are non-Buddhists who believe that the six faculties are self according to various names, so it's difficult to say that you claim to be able to see me and that the five faculties that can hear are not self.",
        "source": "X23n0439_003:0552a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】經云若摩奴闍等者問有唐三藏既成譯悞何故今時摩奴闍不云人執摩納婆不云勝我還置意生儒童有何異耶答為順古譯不欲違之其間是非從疏取捨耳。",
        "translation": "[Commentary] The sūtra says, \"If the Tripiṭaka of the Tang Dynasty has already made translations for entertainment, why doesn't the current Manojña say that people hold to Manabha and don't say that it's better than self?\" Answer: Because we follow ancient translations and don't want to contradict them, we'll take the difference between right and wrong from the commentary.",
        "source": "X23n0439_003:0552a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此六齊日等者准智度論云此六齊日惡鬼害人惱亂一切若所在丘聚群國縣邑有持齊受戒行善人者以此因緣惡鬼遠去住處安隱以是故六日持齊受戒得福增多問曰何以故諸惡鬼輩以此六日惱害於人答曰天地本起經說劫初成時有異梵天王子諸鬼神父修梵志行滿天上十二歲於此六日割肉出血以著火中以是故諸惡鬼神於此六日輙有勢力問曰諸鬼神父何以於此六日割身肉血以著火中答曰諸神中摩醯首羅神最大第一諸神皆有日分摩醯首羅天一月有四日分八日二十三日十四日二十九日餘神一月有二日分月一日十六日月二日十七日十五日三十日屬一切神摩醯首羅為諸神主又復得日多故數其四日為齊二日是一切諸神日亦數以為齋是故諸鬼神於此六齊日輙有勢力復次諸鬼神父於此六日割肉出血以著火中過十二歲已天王來下語其子言汝求何願答曰我求有子天王言仙人供養法以燒香甘果諸清淨事汝云何肉血以著火中如罪惡法汝破善法樂為惡事令汝生惡子噉肉飲血當說是時火中有八大鬼出身黑如墨髮黃眼赤有火光明一切鬼神皆從此八鬼生以是故於此六日割肉出血以著火中而得勢力如佛法中日無好惡隨世惡日因緣故教持齋受戒也。",
        "translation": "[Commentary] These six days of alignment, etc., according to the Zhidu lun, these six days of alignment are for evil spirits to harm people and disturb them. If there are good people in the hill ghettos, countries, and towns who observe and receive the precepts in alignment, for this reason evil spirits are kept far away and their dwelling places are peaceful.",
        "source": "X23n0439_003:0552a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】而與六親者一父之親內族也二母之親外族也三身之親兄弟等也四妻之親妻之眷屬也五男之親男兄弟也六男妻之親是他內外族也又菩薩戒抄云兄弟姉妹妻子也。",
        "translation": "[Commentary] And the six relatives are the father's relatives, the mother's relatives, the brothers, the wife's relatives, the male relatives, the male brothers, and the male wife's relatives, the brothers, the sisters, the wives, and the wives.",
        "source": "X23n0439_003:0552b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】無畏依者言無畏者畏是怖畏謂凡夫從無始來以十不善感生惡趣是最怖畏處後遇善友得聞世間三寶歡喜歸依修行十善漸近涅槃更不復怖畏三塗之苦名為無畏言依者依謂依止即十善道是諸凡夫所依止處無畏之依名無畏依。",
        "translation": "[Commentary] \"Fearless support\" means fearlessness, which means that since beginningless time, ordinary people have been born into a bad destiny because of the ten unwholesome causes, which is the most frightening place.",
        "source": "X23n0439_003:0552c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】隨彼所說中至解脫慧生者即於第八生死無畏依中開出也謂此愚童凡夫於彼前來善友所說此是天大天與一切樂者遂於四類天等世間三寶隨於何類之中隨順修行由此生起希求出離解脫之慧此心殊妙勝過已前依之不動故曰隨彼所說至解脫慧生也。",
        "translation": "[Commentary] Following what they've taught, the wisdom of liberation arises, which is the eighth fearless basis of birth-and-death that opens up to this foolish boy and mortal who was taught by a good friend in the past that these are the gods, the great gods, and all the pleasures, and then follows the practice of the three worldly treasures of the four types of gods and so forth, depending on which type they are, and this gives rise to the wisdom of seeking liberation from escape.",
        "source": "X23n0439_003:0552c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然以未知等者此然字義含縱奪縱云雖於隨彼說法中得殊勝住有求解脫慧生奪云然以未知乃至不離斷常謂佛法中以知因緣有故則離無見以觀因緣自性空故不生有見謂彼未知此因緣有無故雖有觀空智慧故不離於斷常又此言智慧但是不正分別非是真實智慧故智度論云問云外道禪定智慧云何答曰外道以我心逐禪故多愛見慢故不捨一切法故無有實智慧問曰汝言外道觀空觀空則捨一切法云何言不捨一切法故無有實智慧答曰外道雖觀空而取空相雖知諸法空而不自知我空愛著觀空智慧故不離常也。",
        "translation": "[Commentary] However, because it's unknown and so forth, the word \"however\" includes the meaning of the word \"however,\" even though it's an excellent abode in the teaching that follows them, the wisdom of seeking liberation arises, even though it's unknown and even though it doesn't separate from nihilism and eternalism, it means that in the Buddha's teaching, knowing that causes and conditions exist, then one parts with nihilism, observing the emptiness of the own-nature of causes and conditions, so nihilism and eternalism don't arise, even though there's the wisdom of observing emptiness.",
        "source": "X23n0439_003:0552c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】非彼能知涅槃者謂外道不了因緣空義設爾一心精進勤求解脫覈其果證只到非想非非想定更無歸處以彼計此為涅槃故非彼能知佛法大涅槃也。",
        "translation": "[Commentary] Not being able to know nirvāṇa means that non-Buddhists don't understand the meaning of emptiness as cause and condition even if they single-mindedly and diligently pursue liberation, the realization only reaches concentration that's neither perceived nor unperceived and has no place to return to.",
        "source": "X23n0439_003:0552c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然其八正心等者謂雖從初種子心乃至第八嬰童心中生起希求解脫之慧若不遇善緣還從斷常空退入邪見然其八種正心種子熏在藏識終不能令破敗消亡若聞佛法為緣即入八正心種子之道又釋八正心種子者即正見正思惟等八聖道支也在於眾生本覺地中未遇善友因緣發起終不敗亡以是堅固性故故曰然其八正心等。",
        "translation": "[Commentary] Rāṣṭraprabha's eightfold correct mind means that even though the wisdom of seeking liberation arises in the mind of the first seedling up to the eighth infant, if it doesn't meet good causes, it still regresses from nihilism into mistaken views, but the eightfold seeds of correct mind that are perfumed into the store consciousness can never be caused to break down and perish.",
        "source": "X23n0439_003:0553a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若無機之人等者謂未至生八心種子無信根之人但說世間苦樂乃至以時為因設為說八齊少分安靜尚不能信何況佛法甚深之事耶。",
        "translation": "[Commentary] If someone without ability and so forth means someone who hasn't yet attained the seeds of the eightfold mind and doesn't have the faculty of faith but explains worldly suffering and happiness or even uses time as a cause to explain the eightfold principle in a way that's minimally peaceful, they still can't believe it, much less the profound things of the Buddha-dharma.",
        "source": "X23n0439_003:0553a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】自心實相熏習者自心者本覺真心此心實相能熏眾生無明染心還成淨用起信論云無明染法實無淨業但以真如而熏習故則有淨用彼疏云淨熏染者此是生滅門中本覺真如故有熏義真如門中則無此義由此本覺內熏不覺令成厭求返流順真故云用也故涅槃經云闡提之人未來佛性力故還生善根彼言佛性力者即此本覺內熏力耳此中明義謂由世間自久遠已來有善法之名即是不空本覺熏令眾生節食自誡生起種子芽等八心及殊勝決定等心厭生死苦求涅槃樂故名自心實相熏習也。",
        "translation": "[Commentary] The fumigation of the true character of the self-mind is the true character of the originally enlightened mind, which can fumigate sentient beings' ignorant and defiled minds back into pure function. The Awakening and Faith Treatise says that ignorant and defiled things really have no pure activity but are pure and useful because they are fumigated by true reality.",
        "source": "X23n0439_003:0553a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】最上大乘句等者此結歎金剛手所問云何世尊說此心菩提生等十句大乘之法於諸教中猶如醍醐醇味第一故名最上大乘句言心續生之相者此心雖畢竟清淨猶如虗空離一切相然亦從因緣生起而有生起之相故曰心續生之相言諸佛大秘密等者諸佛如來秘密之藏而有淺深大小不同今是秘中之秘密中之密故名為大外道不能知者外道謂凡夫及與二乘此二種外道皆未識實相心故且如來藏與生滅和合成阿梨耶識彼等非但不識無生滅心亦復不識生滅之心故名外道不能知法華藥草等者疏主指此意者欲顯權實之設差別無量覈其定趣終歸一實故彼經云如來知是一相一味之法所謂解脫相離相滅相究竟涅槃常寂滅相終歸於空以況此中雖開順世違世八心乃至各各求於解脫究其所歸不出阿字又下疏云乃至三乘一一地皆具十心迄至第十地亦具種子芽疱葉華果等有求佛地智生觀畢竟空得至金剛實際故云法華藥草喻品意在於此也。",
        "translation": "Although this mind is ultimately pure like space and free from all characteristics, it nevertheless arises from causes and conditions and has the characteristic of arising. The Buddha's great secret and so forth are the secret stores of the Tathāgatas, but they differ in depth and shallowness and size.",
        "source": "X23n0439_003:0553a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】觀畢竟空者謂於第十地中次第至八心得最後無畏依時有求佛地智生得此微細慧時畢竟空得到等覺金剛際心故下疏云行者得如是微細慧時觀一切染淨諸法乃至少分猶如隣虗無不從緣生者若從緣生即無自性若無自性即是心本不生心本不生即心之實際心之實際亦復不可得名為畢竟空。",
        "translation": "[Commentary] Observing ultimate emptiness means that in the tenth ground, when he successively reaches the eight insights and the final ground of fearlessness, there are wise sentient beings seeking the buddha ground who attain this subtle wisdom and then attain ultimate emptiness, they attain the mind at the adamantine limit of virtual enlightenment.",
        "source": "X23n0439_003:0553b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【經】說彼心者即指彼六十心也謂上問云心諸相與時願佛廣開演故。",
        "translation": "[Sutra] He who speaks of that mind refers to those 60 minds, meaning the above question asks about the various aspects of mind and wishes the Buddha to explain them in detail.",
        "source": "X23n0439_003:0553c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】多以順修明義者此六十心多分將以隨順修行之者明其心性之義或染汙心或清淨心問云何是清淨貪心答真言行者但觀貪心實相自然貪不染心即是清淨貪心如下經明十六大菩薩第三名金剛貪染菩薩即經云毗盧遮那佛內心證得金剛欲箭大悲三摩地智從此智中流出金剛箭光明遍照十方世界射害一切眾生於無上菩提厭離心者亦是此中貪義。",
        "translation": "[Commentary] Many of these 60 states of mind will be explained by those who practice them in a way that accords with the meaning of the nature of mind, whether it's a defiled mind or a pure mind.",
        "source": "X23n0439_003:0553c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若行者善識真偽等者謂觀貪之實性善能了知或貪為真而不貪為偽或不貪為真而貪為偽猶如農夫務除穢草以輔嘉苗不可一向謂是因緣事相之迹輕忽如來至實之言令心沒在於常教之中耳。",
        "translation": "[Commentary] Suppose a practitioner well recognizes what's true and what's false, which is to say that he well observes the true nature of greed and well understands that either greed is true and not greed is false, or not greed is true and greed is false, just like a farmer who tries to remove the dirty grass to help grow good seedlings. He mustn't always think of these signs of causation and phenomena as despising the most true words of the Tathāgata and allowing his mind to be lost in the constant teaching.",
        "source": "X23n0439_003:0553c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】但觀貪心實相等者如經偈云三界極重罪不過於厭離汝於貪欲處莫生厭離心不應如彼二乘厭離眾生也。",
        "translation": "[Commentary] But to observe that desire is truly equal is like the sutra verse that says the most serious offense in the three realms is not to be disillusioned with it.",
        "source": "X23n0439_003:0553c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】但於此眾緣中者若行者覺知如是瞋心相起之時但當於此眾多緣生句中而觀察之則不為障也。",
        "translation": "[Commentary] But in these many conditions, suppose a practitioner realizes that when the mark of anger arises in this way, he should simply observe it in these many conditions that arise, and then it won't be an obstruction.",
        "source": "X23n0439_003:0553c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】譬如觀岐路等者謂如人求利須審觀岐路利好處應便馳逐若疑惑不進則有所失此好字上聲讀之謂利有好弱好利者逐之弱利者棄之故智度論云如人在岐路疑惑無所趣諸法實相中疑亦復如是乃至在世雖有疑當隨妙善法譬如觀岐道利好者應逐。",
        "translation": "[Commentary] Like examining a noble path, this means that a person seeking profit must examine the noble and good parts of a noble path and then chase them away. If he has doubts and doesn't advance, then he'll lose something. The word \"good\" is pronounced in the upper case, meaning that profit has good and weak points.",
        "source": "X23n0439_003:0553c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】謂於決定法印等者印謂三法印或四法印是決定法若過若不及者過則為增不及為減失於處中之慧也。",
        "translation": "[Commentary] This refers to the seal of the determined Dharma, which is the seal of the three or four factors that determine the Dharma.",
        "source": "X23n0439_003:0554a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】少欲知足者行者一向願求世間果報悉地障於出世淨菩提心應當思惟減省諸欲於資財悉地障道因緣善知止足故老子云知足不辱注云知足之人絕利去欲不辱於身又古人云達人知止足遺榮忽如無抽簪解朝衣散髮歸海隅世俗尚爾況行者乎。",
        "translation": "[Commentary] Those who practice with few desires and know their limits have always desired worldly rewards that are readily obstructed by the pure enlightenment of those who transcend the world, and should consider reducing and saving desires for accumulation of possessions that are readily obstructive to the causes and conditions of the path.",
        "source": "X23n0439_003:0554a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】修此法者等者此法即真言者即行人亦者相似如前外道所事名為自在行者所事即是本尊以此類彼故曰亦常若真言行人數數係念如是本尊及悉地事當知亦是自在之心應當觀察悉地之法悉屬因緣遠離自心本尊之相則無有自在也。",
        "translation": "[Commentary] Those who practice this Dharma and so forth are those who practice this Dharma, that is, those who speak truly, those who practice, and those who are similar to the aforementioned non-Buddhists.",
        "source": "X23n0439_003:0554a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如龜藏六者謂此心守護身心六根等如龜藏護四足頭尾六事不令他損故涅槃經云龜有頭尾四足名為六處若侵惱則藏入殻中眾生六根馳流外境塵賊來侵自守根門如龜藏六也。",
        "translation": "[Commentary] Like a tortoise that hides six means that this mind guards the body and mind, the six faculties, and so forth, like a tortoise that hides its four legs, head, tail, and six things and doesn't allow others to harm it. Therefore, the Nirvana Sutra says that a tortoise has a head and tail, and its four legs are called the six sense-fields.",
        "source": "X23n0439_003:0554a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此人亦爾遇聞種種法等者問此人聞種種法要領受不忘冀望時處因緣和合則勤而行之即為是也何乃為非豈不佛說因緣啐啄俗云待時而動乎答誠如所難此取意別為以時不待人雖當有資糧或無常倐至不得受用又如身被毒箭宜當速拔若問日時通否遂令毒氣深入或致殞斃今取此意故不相違也。",
        "translation": "[Commentary] This person also met someone who heard about various teachings and asked, \"This person heard about various teachings that they should receive and not forget, hoping that the time and place will be right and that the causes and conditions will coincide, then they will diligently practice them.\" Why is that not right? Doesn't the Buddha teach that causes and conditions peck out the secular teaching that one waits for the right time to move?\" [Commentary] It's just as difficult as it seems. This is taken to mean that the time doesn't wait for someone, even though they may have the accumulation or impermanence that arrives suddenly and can't be used.",
        "source": "X23n0439_003:0554a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所有繫屬等者謂行者見他因緣相繫眷屬及他人成辦之事憘好離間當知鼠心使然也此中不說對治若對治者行人或見眷屬不和宜勸令和見他成辦種種善事遞相讚成是所對治下准此釋。",
        "translation": "[Commentary] \"All attachments and so forth\" means that the practitioner sees other causes and conditions that bind attachments, dependents, and others to accomplish things that are skillful, beneficial, and isolated. You should know that this is the result of the mouse mind.",
        "source": "X23n0439_003:0554b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】當念我當得內證等者此則對治一類唯攻言說不修理觀之者也聲聞宿習者以不修自然佛慧故若行者直以淨菩提心為門住此門故覺心本不生際其心淨住生大慧光明普照無量法性故曰我當內證自然之慧當念得此慧已然後普現色身等是彼對治也又下疏云除一切蓋障三昧若得此者則與諸佛菩薩同等住當發五神通獲無量語言陀羅尼乃至滿足一切佛法等即是行者所得之法也。",
        "translation": "[Commentary] He'll be mindful that I'll realize this wisdom internally. This is a corrective for those who only attack what's said and don't cultivate the natural Buddha's wisdom.",
        "source": "X23n0439_003:0554b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】無畏辨戈者無畏四無所畏也此有二種一佛四無畏二菩薩四無畏今取菩薩一聞持無畏於聞持中得自在故二解說無畏三處眾無畏四答難無畏言辨才者七辨才也一據辨須言即言無謇吃故二迅辨懸河[泳-永+疌]泠不遲疏故三應辨應時應根不增減故四無疎謬辨凡說契理不邪錯故五無斷盡辨相續連環無終竭故六凡所演說豐義味辨一一言句多事理故七一切世間最上妙辨具足甚深如雷等故菩薩雖具種種無畏辨才能擊法皷不應滯著妨大事因緣也。",
        "translation": "There are two kinds of fearlessness, the four fearlessness of buddhas and the four fearlessness of bodhisattvas. The bodhisattvas are fearless in hearing and retaining, fearless in explaining and retaining, fearless in handling multitudes, and fearless in answering difficult questions.",
        "source": "X23n0439_003:0554b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】當念救護等者謂當安住慈悲救護一切故法華經如來室者大慈悲是也。",
        "translation": "[Commentary] This refers to those who should abide in compassion and aid all people. Therefore, the Lotus Sutra's great compassion is that of the Tathāgata's roommate.",
        "source": "X23n0439_003:0554c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】云何羅剎心者梵語羅剎此云破壞謂此心好破壞一切功德故名為羅剎心頗見今時寡聞之人隨聞一事便撥餘非或順自慳心如斯等輩世多有之此來佛說蓋寺造像得種種功德而返非之是則謗於如來所說哀哉不曉如來之意或慳心使然自不作功德教人不作功德自懷懷他豈不同於羅剎婆耶賢此文者深宜自誠。",
        "translation": "[Commentary] What is the mind of a rāṣṇa? The Sanskrit word rāṣṇa means to destroy, which means that this mind is good at destroying all merits; therefore, it's called the mind of a rāṣṇa. It's not uncommon to see well-versed people today who follow what they hear and then set aside what's wrong with it, or who follow their own stingy minds.",
        "source": "X23n0439_003:0554c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此中治法等者謂對治上來追悔慚懼若作惡事速務悔除所為善事生慶辛心勿生掉悔掉謂掉舉令心於境不寂靜為性能障行捨奢摩他為業悔為惡作惡所作業追悔為性障止為業尤宜覺察則不障淨心矣言速務懺除者如人身中有刺若不速拔為害斯甚故以為喻也。",
        "translation": "[Commentary] Here, the remedy refers to correcting past regrets and conscience and fears, making quick work of repenting and removing bad deeds, and producing joy and pleasure in doing good deeds.",
        "source": "X23n0439_003:0554c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】石田不毛者謂不生草木不可耕耨之地也。",
        "translation": "[Commentary] A rocky field that's not hairy refers to ground that doesn't produce grass or trees and can't be cultivated.",
        "source": "X23n0439_003:0554c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】但當觀心實相等者謂行者常欲發露懺洗六塵三業垢惡眾罪以見此垢此淨故則障淨心是故應當觀察心之實相以為對治此亦有顯密顯者如中論以種種門推求且如眼見色法若見法無有見者若無見者誰能用見法分別外色見可見無故分別亦無是故眼見色時即是實相若以字門密釋者囉者塵垢義塵是妄情所行處故說眼等六情行色等六塵行者若見此字門時則知一切見聞觸知法皆是塵相猶如遊塵紛動使太虗昏濁日月不明是為字相若以阿字門本不生觀之當知所見聞觸知之法悉是淨法界豈更以淨法界染污淨法界耶如上即是顯密二種觀觀心實相對治心障也。",
        "translation": "[Commentary] But you should examine the mind's true equivalence, which means that practitioners always want to reveal and repent of the filth of the six dusts and three activities, bad sins, and numerous sins, so seeing this filth and this purity will hinder the pure mind.",
        "source": "X23n0439_003:0554c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】當一向安心等者謂此人心於所思事復加思念乃至觀此未決復念此推求之慮有何因緣如是則無窮已是故當念一向安心於四諦之理務令貫穿窮徹所謂生滅無生無量無作從淺之深以盡因果離此之上更生推求則但增心數徒令發狂終無其理故云當一向安心等。",
        "translation": "[Commentary] This person's mind is repeatedly thinking about what's being considered, even when it's unresolved, and again thinking about what causes and conditions are relevant to this inquiring mind.",
        "source": "X23n0439_003:0555a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】無明住地三毒之根者謂三毒從無明住地生增長名三毒根若無明住地壞時彼亦隨壞如世間樹根若壞時枝葉寧存唯識疏云煩惱有二種謂住地煩惱及起煩惱住地有四謂見一處住地欲愛住地色愛住地有愛住地起煩惱者勝鬘經說無明住地名起煩惱謂剎那剎那與心相應是故無明名起煩惱又云世尊於起煩惱剎那心相應等乃至若復過於恒沙如來菩薩智所應斷法一切皆是無明住地所持建立如諸種子皆依地生建立增長若地壞者彼亦隨壞若無明住地斷諸所應斷皆亦隨斷等故云無明住地三毒之根若能剃此是真出家疏不可屈撓(奴教切)者撓字切韻注云曲木也即是不可拗屈令其曲直也。",
        "translation": "[Commentary] The three poisons in the entrenchment of ignorance are the three poisons that arise and grow from the entrenchment of ignorance, which are called the three poisonous roots.",
        "source": "X23n0439_003:0555a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】平治心地等者謂阿闍梨為弟子作漫荼羅擇地之時地中一切惡物一一擇去要令平淨乃至地中毛髮若不擇去不名淨地言毛髮者謂是六十心等與善種八心間雜而生未得出世間心已來雜起紛亂難可條結宜覺察已而揀去之乃名淨地也。",
        "translation": "When the Ajātaśatru prepares a maṇḍala for his disciples to select the ground, he selects away all the bad things in the ground one by one to make it even and purifies them, even the hairs in the ground that wouldn't be called the pure ground if they weren't selected away.",
        "source": "X23n0439_003:0555a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所以不說五見等者此通妨也謂有妨云根本煩惱有六有何所以但言由有無明故生五根本煩惱不說生五見豈五見不從無明生耶故今通云所以不說五見者多在六十心中也。",
        "translation": "[Commentary] So it's not said that five views and so forth are general obstructions, meaning there are six fundamental afflictions that are obstructive, so it's only said that five fundamental afflictions arise from the presence of ignorance, not that five views arise.",
        "source": "X23n0439_003:0555b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】若以淨菩提心等者若者不定之意此有二義謂若以淨菩提心為出世間心即是超越三劫瑜祇之行則出世間心生出世間心生即是淨菩提心生此心出於一切世間故若以佛慧初心為出世間心即是三阿僧祇劫成佛亦名出世間心生今言三僧祇劫即三種妄執行者若一生越此三妄執即一生成佛何見有時分耶故云若以等。",
        "translation": "[Commentary] If the mind of pure enlightenment is the mind that transcends the three eons and the number of practices, then the mind that transcends the world is born, and the mind that transcends the world is born, which is the mind of pure enlightenment that transcends all the world.",
        "source": "X23n0439_003:0555b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】即已度百六十心至一重極細妄執者謂行者初觀聚沫浮泡陽燄芭蕉幻事五種譬喻從無性門達諸法即空得離一重法倒是名越一重麤妄執行者復觀幻事陽燄影響火輪乾城六種譬喻解諸薀唯心照有空不二而人法二空之相亦不當心是越一重細妄執復次行者觀幻燄夢影城響月泡華輪等十喻雖解脫一切業煩惱網而業煩惱具存至此不思議地是越百六十心等極細妄執也若一生度此等者此宗明義但除妄執名為瑜祇若一生度此三重妄執名一生成佛又就第一重內復有三種三妄執謂行者初得出世心時此當信位爾時諦觀陰界入等悉從緣生無常變易是中都無有我如此推求度無量見網即除我倒下貪瞋癡三妄執也問言十信位斷我執者准起信文三賢離執取計名即斷我執云何今說十信乃除答教門施設義有異故又此所斷據一分麤者三賢位滿斷細一分何以故如後三妄執云拔業煩惱根本無明種子煩惱言寬豈無我執故通細者又解出世間心生即當三賢位始離我執則同餘教也然修禪定道品等時亦有法執即三賢位作觀對治尋思名義染已得上定時躭味寂然淹留不進謂根境界三所生過患正障行人勝進之智然以堅固菩提心勢力能於薀等發起其心修不住道以五種喻觀五陰空乃至通達諸法即空之理若拔業煩惱根本無明種子三障盡時名證寂然界即初劫滿也能離三種三執乃名第一阿僧祇劫今此初劫文意兼得藏通二教之意何以故有析法成空之義故有三獸度河之理故由是疏云故以三乘上中下心合論一阿僧祇劫通我法二執是所斷障後二劫中唯斷法執問曰前分障時貪瞋癡慢疑五種分析成百六十心通三劫所治若准相教疑唯分別何故乃通後二劫除答彼據煩惱障頭數作如是說今約所知障故通俱生如言法貪法慢法疑等故不相違但諸煩惱勒為三重麤細極細麤通我法細與極細唯約法執又言妄執不同相教彼執障有殊何以故如前五識雖有二障無執俱故此宗但是染法皆名妄執違背真理強分別故若就第二阿僧祇劫乃當別教分齊謂發平等大誓為法界眾生行菩薩道乃至諸一闡提及二乘入正位者亦當以種種方便折伏其心普令同入是乘前劫雖悟即空之理仍於不可得空中道佛性未能遊入故以幻焰影響旋輪乾城六喻拂前空相雙辨有無故名中道即從初地至八地也廣明此劫之義如勝鬘經寶性佛性論說若就第三劫以十喻觀不思議空故疏云前劫雖宗極炳著轉妙轉深猶是對治心外之垢尚未開此心中秘密不思議事即當圓頓分齊也已下疏文明華嚴初發心時便成正覺復說十心十法門義又此經云秘密主真言門修行菩薩行諸菩薩無量無數百千俱胝那庾多劫積集無量功德智慧俱修諸行無量智慧方便悉皆成就疏釋云如餘菩薩行於方便對治次第漸除心垢經無量阿僧祇劫或有得至菩提或不至者今此教諸菩薩則不如是直以真言為乘超入淨菩提心門若見此心明道時諸菩薩無數劫中所修福慧自然具足即極無自性心生也故華嚴經云餘諸菩薩經無量阿僧祇劫乃能滿足行願乃能化諸眾生今長者子於一生內便能淨佛剎便能化眾生即善財一生圓曠劫之果但與此宗顯密是異圓義無殊幸留鑒爾又前三劫初約藏通次約別教後約圓頓疏意欲顯淺深異故若依三乘通教修時唯當初劫若依別教趣證則當二劫若依圓頓方得三劫前前者淺後後者深前前不具後後後後可具前前不爾豈此圓頓只有第三劫行耶問第三劫滿得成佛不答若越三妄執即得成佛故疏云後越一重極細妄執得至佛慧也然依清涼即以中論一偈配屬諸教或一一教中各成三觀或一偈四句即配四教或離合逐義配於四教今則亦爾謂初劫則因緣所生法我說即是空後二劫則亦為是假名亦是中道義又可初劫因緣所生法帶折法故非即空第二劫我說即是空亦為是假名不著空相故第三劫亦是中道義即不思議空也上來三劫行位粗略而言至文具矣。",
        "translation": "[Commentary] That is, when the one hundred and sixty states of mind have been crossed up to the first level of extremely subtle deluded attachment, the practitioner first observes the five metaphors of the illusion of the foam, the bubble, the sun, the flames, the basil, and the plantain, and from the aspect of nonnature he attains emptiness and is able to escape from a single fallacy of dharmas, which is called transcending a single level of coarse deluded attachment.",
        "source": "X23n0439_003:0555b16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "【疏】然就第一重至越三妄執者然第一重內復有三種三妄執今初出世心生即離初三妄執謂世間眾生從無始不了我之自性唯依諸薀執有實我由執我故起種種惑造種種業受種種報成三毒根今瑜伽行者從初發心依真言門了知心相於諸薀中即離相在內外觀之皆不可得即離我倒所生三毒根本是越世間三妄執也言即是無學至最難斷處者即非想地第九品煩惱最極微細名為難斷處也。",
        "translation": "[Commentary] Still, regarding the first stage up to the point of transcending the three deluded attachments, it's true that within the first stage there are three more kinds of three deluded attachments. The first transcendent mind that arises now is free of the first three deluded attachments, which means that worldly beings from beginningless time don't understand the self-nature of self but only rely on the grasslands to attach to the existence of a real self.",
        "source": "X23n0439_003:0556b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】學摩訶衍人至小乘見道等者謂學大乘之人初得出世初心即是越我倒麤妄執名出世初心此與小乘見道預流果適齊謂上之疏云如聲聞人初觀陰界入時即陰求我離陰求我皆不可得相在亦不可得爾時於八直道中遠塵離垢真法眼生真言門菩薩亦復如是初觀陰界入時即陰求心離陰求心皆不可得相在亦不可得即時懸悟自心本不生際於如來知見大菩提道中遠塵離垢得法眼淨故云與小乘見道適齊今言適齊者但相似名齊也。",
        "translation": "The above commentary says, \"When a student of Mahāyāna first observes the aggregates as realms and enters, that is, when the aggregates seek the mind and the aggregates seek the mind, the aggregates seek the mind, and the aggregates seek the mind, both are unobtainable, and the form is present and unobtainable.\" Bodhisattvas likewise first observe the aggregates as realms and enters, that is, when the aggregates seek the mind and the aggregates seek the mind, both are unobtainable, and the form is present and unobtainable.",
        "source": "X23n0439_003:0556b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然彼行者有法執等者止觀云法愛難斷若有稽留此非小事譬如同帆一去一停停即住著又雖不著沙亦不著岸風息故住不著沙喻無內障不著岸喻無外障而生法愛無住風息不進不退不進不上菩薩位不退不墮二乘地名為頂墮謂煖法由退五根若立上忍發真則不論退頂法若生愛心應入不入既不入位又不墮二乘大論云三三昧是似道位未發真時喜有法愛名為頂墮今人行道萬不至此至此善自防護此位無內外障唯有法愛又智度論云問曰云何頂墮答曰如須菩提語舍利弗若菩薩無方便心行六波羅蜜入空無相無作中不能上菩薩位亦不墮聲聞辟支佛地愛著諸功德乃至是菩薩頂墮何等是住頂如上所說諸法愛斷於愛斷法亦復不取如住頂義中說故曰然彼行者等。",
        "translation": "[Commentary] 'Still, the practitioner has attachment to things' and so forth. Zhiguan says it's difficult to stop attachment to things, and if there's any lingering, it's not a trivial matter. It's like when the same sail goes away and stops, one stops and then abides and clings to it.",
        "source": "X23n0439_003:0556c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然亦稍離下地等者此同二乘無學也謂行者雖有法執當心非是如實巧度然亦稍離下之八地三妄執故復能拔第九地我執家業及煩惱根本無明種子所生十二因緣大樹又解然亦稍離下地三妄執者此同不還果也能拔業煩惱等者此同無學果也行者能知如是甚深實相之法有佛無佛性相常耳證此理時退非二乘折法進非別圓乃是三獸渡河共空意也次云如稻芉等經者彼經云爾時尊者舍利弗問彌勒言今日世尊覩見稻芉而作是說汝等比丘見十二因緣即是見法即是見佛皆以何義作如是說云何是十二因緣云何見因緣即是見法云何見法即是見佛爾時彌勒語舍利弗言世尊常說見十二因緣即是見法見法即是見佛十二因緣者無明緣行乃至憂悲苦惱(已上答問云何是十二因緣)又云能以四緣增長十二因緣何等為四無明愛業識識為種體業為四體無明愛是煩惱體能生長識業為田愛為潤漬無明蓋覆植識種子眾緣和合故生色芽無主無我無造無壽者猶如虗空如幻從眾因緣和合而生(已上是答云何見法)又云如是十二因緣如多羅樹剪滅其首更不得生我見則除乃至舍利弗若有眾生能忍是法此多陀阿伽度阿羅訶三藐三佛馱必為授阿耨多羅三藐三菩提記(已上即答見佛)故云如稻芋經。",
        "translation": "[Commentary] However, he is also slightly free of the three deluded attachments in the lower stages, which are the same as the two vehicles and post-learners. When he realizes this principle, he is not retreating from the two vehicles, folding his mind into the Dharma, and advancing to something other than the distinctive perfection that is the common emptiness of the three animals crossing the river.",
        "source": "X23n0439_003:0556c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】言湛寂等者湛即是喻寂即是法湛寂即是三乘所得但空之理證此空故五根本煩惱等皆畢竟不生故名為寂又此空理湛然甚深如萬仞之清潭(仞七尺也)不測於淺深建立宗等種種諸計非其境界故不能窺度也。",
        "translation": "The principle of emptiness is so profound that it's like a clear lake of 10,000 feet (seven feet) that it's impossible to fathom its shallowness or depth.",
        "source": "X23n0439_003:0557a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】此中有三乘等者此第一劫中說有三乘三乘之人同以空為門入諸法真實之性二乘之人自為已得涅槃生滅度想沉也菩薩能以不住道發起大悲昇也譬如同帆一去一停故昇沉有異也。",
        "translation": "[Commentary] Here there are the three vehicles and so forth. In this first eon, it's said that there are three vehicles, and people of the three vehicles all use emptiness as the gate to enter the true nature of dharmas.",
        "source": "X23n0439_003:0557a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】兩種外道者外道有多略為二種一者離佛法外外道二者附佛法外道名內外道外外道者本源有三一迦毗羅此翻為黃頭計因中有果二漚樓僧伽此云鵂鶹計因中無果三勒沙婆此云苦行計因中亦有果亦無果等二內外道者起自犢子部如前已說。",
        "translation": "[Commentary] There are many kinds of non-Buddhist non-Buddhists, but there are two kinds: those who are outside the Dharma and those who are attached to the Dharma and are called internal non-Buddhists.",
        "source": "X23n0439_003:0557b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】唯有此一門等者過去諸佛無不說此一門即一種權教三乘也故法華云尋念過去佛所行方便力我今所得道亦應說三乘等又一謂實教大乘門謂權教三乘故法華云開方便門示真實相也種種因量等者外道小乘部類不一名為種種其中善解因明比量之師以因喻次第於此理上欲出其過終不能得又上疏云如前所說建立等宗乃至長爪梵志諸大論師等自以智慧利根推求諸法實相皆不能圖度故曰種種因量等。",
        "translation": "[Commentary] Only this one approach and so forth, there's no one past Buddha who didn't explain this one approach, which is a kind of expedient teaching of the three vehicles. Therefore, the Lotus teaching says, \"In order to examine the power of the skillful means practiced by past Buddhas, I should also explain the three vehicles and so forth in the path I've now attained.\" Another approach that refers to the true teaching of the great vehicle is the expedient teaching of the three vehicles.",
        "source": "X23n0439_003:0557b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如夏時暴雨等者謂當夏時自雨水中隨渧大小種種浮泡形類各異然水性一味自為因緣泡起即是水起泡滅即是水滅舉體從緣四句求之無別所生之法此譬受諸苦樂等皆從情塵和合故生苦生即是情生苦滅即是情滅四句推之亦無別法即是受陰本不生也。",
        "translation": "[Commentary] Like a summer rainstorm, this refers to the summertime rain that comes from a variety of floating bubbles of different shapes and sizes depending on the size of the drops, but the watery nature of the water itself is the same flavor, and the bubble that arises is the water that arises, and the bubble that ceases is the water that ceases.",
        "source": "X23n0439_003:0557b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】一微涉於動境等者謂從根本無明一念熏真界時即涉動也展轉能生諸雜染法淪沒生死則無窮已故晉遠法師云一毫涉動境成此頹山勢即其義矣然此諸法皆是緣生既從眾緣則無自性舉體皆空即是行本不生也。",
        "translation": "[Commentary] A tiny bit involved in a moving object means that when a single thought of fundamental nescience perfumes the true realm, it's involved in movement, which in turn can give rise to defiled dharmas that submerge in birth and death, then there's no limit to it.",
        "source": "X23n0439_003:0557c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】如世間呪術等者謂世間以呪術藥力因緣現種種未曾有事所謂昇空隱形履水蹈火雖五情所對明了現前然眾緣中一一諦求都無生處識陰亦爾從無明因緣生無明盡時行識等盡當知蘊性即空也。",
        "translation": "[Commentary] Suppose the world uses a spell or a medicine as a cause and condition to manifest various things that have never existed before, such as rising into the sky, concealing one's form, walking through water, and tripping through fire. Although the five senses are clearly manifested in response to each of these conditions, the consciousness aggregate also follows from the causes and conditions of ignorance, and when ignorance ends, formations and consciousnesses are exhausted.",
        "source": "X23n0439_003:0557c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】初出三界等者非出過也但以無明幻起於識等在於三界究其識體亦本不生也。",
        "translation": "[Commentary] The person who first escapes the three realms and so forth isn't escaping error, but the illusion of nescience that arises from consciousness and so forth is present in the three realms, and the essence of consciousness doesn't arise in the first place when investigated.",
        "source": "X23n0439_003:0557c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】或可就見道等者上疏云乃至三乘一一地皆具十心迄至第十地亦具種子芽疱等有求佛地智生等故云或可等也。",
        "translation": "[Commentary] It might be possible to see the path and so forth. The above commentary says that each stage of the three vehicles is fully endowed with ten states of mind up to the tenth stage, and there are seeds, sprouts, and other things that seek the birth of Buddhahood and wisdom.",
        "source": "X23n0439_003:0557c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】經一大阿僧祇劫等者歷度曰經僧祇云無數劫云時分即是經歷一大無數劫時分也如瑜伽四十八說有二無數大劫一者日夜月等算數時無量故說名無數大劫二如前說超過一切算數名無數大劫若說前劫即經無量無數方證菩提若說後劫但三無數方證菩提不過此量如瓔珞經下卷說八百里石淨居天衣拂盡名一大僧祇劫此時分名劫也。",
        "translation": "[Commentary] After a great incalculable eon and so forth, those who have passed through the scriptures say that the scriptures are incalculable, that is, after a great incalculable eon, the eons are counted as incalculable, as explained in the forty-eight commentaries of the Yoga Sutra, there are two incalculably long eons.",
        "source": "X23n0439_003:0557c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】極無言說處者我蘊俱離故稱為極語路攸絕名無言處也。",
        "translation": "[Commentary] The state of utterance is called the state of utterance because the self and aggregates are both removed.",
        "source": "X23n0439_003:0557c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】發無緣乘心等者此心有二一約真心二約事心今初理運彌載真心名乘謂諸行者解了三界唯心心之外更無一法故名無緣無即一心則是能遣緣為萬法乃目所無既了緣本不生是諸法無我性法無我性為斯乘體發謂發起即無發之發以諸行者乘此真心直至道場故曰發無緣乘心也二事心者萬行濟物事心名乘謂諸行者觀於六道隨緣普利而無自他能所之相名為無緣無即淨心離怨親故緣乃群生有高下故既念平等一緣普令同修萬行是則六度萬行為斯乘體發謂興起進策之義以諸行者乘此無緣乘心上菩提道故曰發無緣乘心也言如彼往昔者即過去古昔修行者也言薀阿賴耶者薀謂諸薀阿賴耶此云巢室即薀之住處也觀此薀處知一切法本自如幻陽燄等更無一法而可得者言即是明第二重等者謂初劫中觀察沫泡燄芭蕉幻等五喻從無性門達諸法即空離一重法倒雖不復心沒薀中然帶拆法故以三乘合論一阿僧祇劫今第二劫以幻陽燄影響旋火輪乾闥婆城六喻正觀不可得空兼以體法空觀賴耶法無我性故云第三重也。",
        "translation": "[Commentary] Arising the mind of the unconditioned vehicle and so forth, there are two kinds of mind: the sincere mind and the transactional mind. The first is the sincere mind that's enriched by the operation of principle, which is called the vehicle because practitioners understand that the three realms are nothing but mind and that there's no other dharma outside of mind.",
        "source": "X23n0439_003:0558a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】梵音莽鉢羅者莽此云無鉢羅云他今欲明無緣他緣異故以梵音甄之也。",
        "translation": "[Commentary] The Sanskrit phoneme mangapura is mang, which means no. Now, in order to clarify that there are no conditions other conditions, we use the Sanskrit phoneme to screen it.",
        "source": "X23n0439_003:0558a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】始能觀察阿陀那深細之識者始謂方始初始謂至此第二劫方始能觀前未能故又舉始攝於末故名為始能言阿陀那者執持義即第八識之別名唯識論云或名阿陀那執持種子及諸色根令不壞故論又引解深密經頌說阿陀那識甚深細一切種子如瀑流我於凡愚不開演恐彼分別執為我次第解云以能執持諸法種子及能執受色根依處亦能執取結生相續故說此識名阿陀那謂具此持受取三種義故無性有情不能窮底故說甚深趣寂種性不能通達故為甚細是一切法真實種子經擊便生轉識波浪恒無間斷猶如瀑流凡即無性愚即趣寂恐彼於此起分別執墮諸惡趣障生聖道故我世尊不為開演唯第八識有如是相下引入楞伽等不能廣示(此通一切位也)故云觀察阿陀那深細之識也又或名無垢識最極清淨諸無漏法所依止故此名唯在如來地有菩薩二乘及異生位持有漏種可受熏習未得善淨故如契經說如來無垢識是淨無漏界解脫一切障圓鏡智相應釋阿賴耶名過失重故最初捨故異熟識體菩薩將得菩提時捨聲聞獨覺入無餘依涅槃時捨無垢識體無有捨時利樂有情無盡時故等今無緣乘心亦應觀此故住心品中云皆以果所住而住其心故亦令觀。",
        "translation": "[Commentary] The first consciousness that can observe the depth and subtlety of atana means the beginning, the beginning, and the beginning, which means that up to this second eon, it's only then that it's possible to observe what was previously not possible, and because the beginning is included in the end, it's called the beginning.",
        "source": "X23n0439_003:0558a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】猶屬對治悉壇等者猶者尚也即四悉壇中尚屬對治非第一義也悉壇者此云義宗而有四種謂佛以四法各立義宗謂一世間悉壇二各各為人悉壇三對治悉壇四第一義諦悉壇初世間者是眾生五薀十二處十八界差別義也總合成人名和合也猶如世間車輪轂輻輞等和合名車二各各為人者佛觀人心隨三乘根說三乘法令得增長名各各為人或宜聞有或宜聞空為說有空又世尊為浣衣子說修不淨觀為鍛金子說修數息觀等三對治者除惡義也為多貪者令修不淨觀散亂者令修數息觀等四第一義諦者一切法皆從緣生緣生即無自性即畢竟空畢竟空者第一義也今此中意行者於前劫中修觀行時心沒薀中故以五喻無性空門觀法無我若望緣生中道猶屬對治悉壇耳言若失般若等者謂前劫修觀行時心沒蘊中以無性空門觀法無我若失般若無所得方便即墮斷滅濫方廣道人方廣道人者即清辨論師等也唯識云清辨計言若論世俗心境俱有若依勝義心境俱空失於中道名惡取空濫方廣道人即濫同彼人也又摩訶止觀云方廣道人自以聰明讀佛十喻自作義云不生不滅如幻如化空幻為體龍樹斥云非佛法方廣亦是邪人法也今濫同彼故云濫方廣等言今大乘等者對前三乘但空故云今大乘不可得空空亦不可得名不可得空言故須等者若不離有無之道即是戲論不能得法無我性也。",
        "translation": "[Commentary] Just like the worldly chariot, the hub, spokes, and rims of the chariot are combined and named chariot.",
        "source": "X23n0439_003:0558b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】智障故者摩訶止觀引達磨鬱多羅釋煩惱是惑心故煩惱是障智是明解云何說智為障智有二種一證智二識智識智分別體違想順想順故說為智體達故說為障也智即是障名為智障又止觀云若以智所知礙名智障者以無明故於智有礙正以無明為智障體入大乘論云出世間無明是智障世間無明賢聖已遠離故無明即是智之惑故是智之障故名智障也。",
        "translation": "[Commentary] Because of the cognitive hindrances, Mahāsthāmaprāpta quotes Dhammacandra's explanation that affliction is mental disturbance, so affliction is an obstruction, and cognition is insight. How is cognition said to be an obstruction? There are two kinds of cognition: one is actualized cognition, and the other is consciousness cognition. Cognition is distinguished from its essence, which is contradictory to conception, which is agreeable to conception, which is agreeable to conception, so it's said to be cognition, which is an obstruction, and is called a cognitive obstruction.",
        "source": "X23n0439_003:0558c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】言知自性等者謂了知八識三性皆如幻等唯是自心故華嚴覺林菩薩云若人欲了知三世一切佛應觀法界性一切唯心造正與此同。",
        "translation": "[Commentary] The expression 'knowing one's own nature' means knowing that the three natures of the eight consciousnesses are illusory and so forth, and that they are only created by one's own mind.",
        "source": "X23n0439_003:0559a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】與前劫五喻等者謂前劫中有通教菩通從無性門達諸法即空此則體法空今則不爾了法緣生故幻有知緣無性故真空此則自性不可得空故云與前無性空意復有殊矣。",
        "translation": "[Commentary] It's the same as the five metaphors of the previous eon, which means that in the previous eon there was a general teaching that bodhisattvas understood from the approach of no-nature that all things are empty, and this makes the essence of things empty.",
        "source": "X23n0439_003:0559a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】然阿賴耶有三等者即是遍計所執性依他起性圓成實性皆不離心故此二俱是真實而有二義一者三性各別論真實二者三性無礙論真實且初義者遍計性真實是分別故依他性真實是因緣故圓成性真實是真實故下疏云如彼可得故通達世諦實第二無礙義者遍計依他皆以圓成而為體故下之疏云如彼無體故得入第一義又華嚴抄云情有即理無緣生即無性皆是真實也。",
        "translation": "[Commentary] Still, there are three kinds of ālayas, namely, the nature of pervasive imagination, the nature of dependent arising, and the nature of completed reality, all of which are not separate from mind.",
        "source": "X23n0439_003:0559a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】迷依者者謂依他性與迷分別為所依故故名迷依由此能起諸分別故。",
        "translation": "[Commentary] A 'basis of delusion' refers to other-dependent nature and deluded discrimination as the basis, so it's called a basis of delusion because of the discrimination that arises from it.",
        "source": "X23n0439_003:0559a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】又如幻者幻事體亦不可得者此中剩箇不字應云如幻者幻事體亦可得故由此亦有可得道理即得通達世諦之實故緣此一段疏文是釋上偈云如彼可得故通達世諦實句以此對之可顯。",
        "translation": "[Commentary] Also, if someone is illusory, then the substance of the illusion cannot be obtained. The remaining word here is not, but it should say that if someone is illusory, then the substance of the illusion can also be obtained.",
        "source": "X23n0439_003:0559a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】能遮建立等者由此有而非有非有而有有無不二故能遮彼二及小乘故言建立者應言建立不建立前敘外計處云建立淨不建立無淨計建立者建立一切依此修行謂之為淨不建立者謂此建立非究竟法若無建立所謂無為乃名真我謂一向都撥為無即名誹謗故云能遮等。",
        "translation": "Therefore, those who say [they] establish should say establish and don't establish. The former form of external calculation says that establishing is pure, not establishing, and no pure calculation establishes, and all those who practice based on it are said to be pure.",
        "source": "X23n0439_003:0559b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】知世諦空者剩此空字以世諦有故不應誹謗也。",
        "translation": "[Commentary] Knowing the emptiness of the world truth leaves this word emptiness because the world truth exists, so it shouldn't be denigrated.",
        "source": "X23n0439_003:0559b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】捨無我心主等者捨者離義無我者謂前劫離我倒時有法執當心故以五喻達諸法即空遣彼法倒雖遣其有仍滯空相今第二劫以六喻對治前劫即空既有去空亡方順不可得空故疏云雖觀諸法無所有然亦於法無所空故須離有離無觀法無我性既能雙離有無之相即得心主自在由是聖教說相為縛令心不得自在今得離時故云心主自在如人被縲紲所拘得解脫時方名自在也。",
        "translation": "The second eon uses six metaphors to counteract the emptiness of the previous eon, namely, that emptiness is removed, and even though it's removed, it's still stuck in the form of emptiness.",
        "source": "X23n0439_003:0559b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】即知釋迦至不識一人者以行者直以真言為乘超入淨菩提心得見心明道故得此心時即知釋迦淨土不毀等此一段疏全引法華經欲顯此劫真實超越二乘之地證不退地兼彰經之秘密故引彼經謂彼經中云他方國土諸來菩薩作禮白佛願聽我等於佛滅後護持此法華經佛即止言不須汝等我娑婆世界自有六萬恒沙菩薩一一菩薩各有六萬恒沙菩薩眷屬我滅度後能護是經佛說是已娑婆世界三千大千國土地皆震裂踊出諸菩薩乃至彌勒菩薩知八千恒沙菩薩心之所念并欲自決所疑以偈問佛乃至我於此眾中乃不識一人願佛決眾疑佛說偈答言是諸大菩薩悉是我所化爾時彌勒菩薩復生疑問如來為太子出於釋宮成佛已來始過四十餘年云何於此少時大作佛事由是世尊為說壽量之事斷除彌勒及眾疑網言自我得佛來所經諸劫數無量百千萬億載阿僧祇常在靈鷲山我淨土不毀等今疏主借法華經意顯此經是神通之乘秘密之藏謂行者直以真言為乘超入淨心見法明道時此即知娑婆世界全是金剛法界之宮釋迦加持之身全是遮那本地之身又與踊出等菩薩同會一處雖迹隣補處不識一人初發心時便得如是功德即是超過彼地豈非神通之乘秘密之藏者也故上疏云此菩提心門名初發明道入此門者即是初入一切如來境界故經云菩薩住此修行不久得一切除蓋障三昧若得此者則與諸佛菩薩同等住又能以方便不動本心遊諸佛剎興種種供養雲乃至云滿足一切佛法。",
        "translation": "[Commentary] That's when he knows that Śākyamuni's pure land is not destroyed because the practitioner directly uses true speech as the vehicle to transcend the pure bodhi mind and attain the insight of the mind. This section of the commentary entirely refers to the Lotus Sutra in order to show that this eon is truly beyond the stage of the two vehicles, realizes the stage of irreversibility, and reveals the secrets of the sutra.",
        "source": "X23n0439_003:0559b18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "【疏】然須菩提等者須菩提是廣慧聲聞等者等舍利弗目連等謂須菩提於般若會中猶能承佛威神說人法俱空若離加持則不能為謂行者於前劫中雖過愚法未能出此廣慧入等至此劫中須菩提等而於此秘密一乘不知所趣故此行者乃名真過二乘地也。",
        "translation": "Commentary: \"Still, Suppositories and so forth are extensive wisdom, śrāvakas and so forth, such as Śāriputra and Maudgalyāyana, who say Suppositories can still accept the Buddha's authority and teach the emptiness of both humans and dharmas if they were free of empowerment, which would not be possible.",
        "source": "X23n0439_003:0559c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】故釋提桓因至親近敬禮者准此經文但言釋提桓因親近供養何故疏言帝釋奉草四王獻鉢梵王請轉法輪今經略故故智度論云佛至樹下時釋提桓因奉上好草執金剛菩薩常執金剛衛護菩薩梵天王請轉法輪如是等各有常法是以疏主引來釋此故云釋提桓因等。",
        "translation": "[Commentary] So Śakra Devānām-Indra came close to venerating him because the sūtras only say that Śakra Devānām-Indra came close to making offerings. Why does the commentary say that Śakra Devām-Indra presented straw, the four kings presented bowls, and the Brahma kings asked to turn the Dharma wheel?",
        "source": "X23n0439_003:0560a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】所謂空性等者言空性者性即實性即是諸法之實性故猶如虗空出過眾相與萬像為依故曰空性經中以九事顯之易見。",
        "translation": "[Commentary] The so-called emptiness and so forth means that emptiness is the nature that's real, that is, the real nature of all dharmas, so it's like space, transcending all characteristics and all images as support.",
        "source": "X23n0439_003:0560a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "【疏】上文等者謂上經文答復以何因緣知發菩提心問經云無量如虗空不染污常住諸法不能動本來寂無相無量智成就正等覺顯現今指彼文蓋喻此心也。",
        "translation": "[Commentary] The above refers to the sūtras that answer the question, \"What are the causes and conditions for knowing that the mind of enlightenment has arisen?\" The sūtras say that it's immeasurable, like space, undefiled, eternally abiding, and that all dharmas can't be moved, originally quiescent, without marks, and with immeasurable wisdom that accomplishes perfect enlightenment.",
        "source": "X23n0439_003:0560a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大毗盧遮那成佛神變加持經義釋演密鈔卷第三",
        "translation": "Da Piluzhena chengfo shenzhiji jing yanmi chao vol. 3",
        "source": "X23n0439_003:0560a17_0",
        "is_bad_quality": false
    }
]