[
    {
        "source_sentence": "佛說仁王護國般若波羅蜜經疏卷中",
        "translation": "Foshuo Renwang huguo banruo boluomi jing shou zhong",
        "source": "X26n0513_002:0154c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姚秦三藏法師鳩摩羅什　譯",
        "translation": "Translated by Kumārajīva, Master of the Yao-Qin Tripiṭaka",
        "source": "X26n0513_002:0154c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陳隋　天台　智者大師　疏",
        "translation": "Chan-Sui Tiantai Zhizhe dashi shou",
        "source": "X26n0513_002:0154c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "閩建州後學沙門　道霈　合",
        "translation": "Daoji, a post-learner monk from Jianzhou, Fujian",
        "source": "X26n0513_002:0154c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁王護國般若波羅蜜經觀空品第二",
        "translation": "Renwang huguo banruo boluomi jing guanjin pin 2",
        "source": "X26n0513_002:0154c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言觀空者謂無相玅慧照無相之境內外竝寂緣觀俱空故言空觀品也又凡夫不識外道妄取二乘耽滯今菩薩以般若正智觀空非空超凡越聖故言觀空也又凡夫著有二乘著空菩薩捨有而後觀空也又觀是能觀空是所觀能所俱空真佛知見故下文云見境見智非聖見也。",
        "translation": "The term \"contemplation of emptiness\" refers to the signless wisdom that illuminates the signless realm and both internal and external are tranquil, the conditions and contemplations are both empty, so the term \"contemplation of emptiness\" also refers to the class of mortals who don't know that outsiders are deludedly attaching to the two vehicles and are obstructed by the true wisdom of prajñāpāramitā, and the bodhisattva's contemplation of emptiness and non-emptyness transcends mortals and transcends sages, so the term \"contemplation of emptiness\" refers to the class of mortals who are attached to existence and the two vehicles are attached to emptiness, and the bodhisattva discards existence and then contemplates emptiness.",
        "source": "X26n0513_002:0154c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此下六品名為正說大分為四前之三品明內護護國一品明外護散華品明報恩供養受持品明弘經相貌初文更二初略開二護次問答廣釋今初。",
        "translation": "The next six lectures here are titled \"Proper Explanation\" and are divided into four major sections. The first three lectures explain internal protection, one lecture explains external protection, the second lecture explains the dissemination of flowers, the lecture explains repaying kindness, making offerings, accepting and maintaining the lecture, and the first text explains the appearance of the scriptures.",
        "source": "X26n0513_002:0154c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告大眾知十六大國王意欲問護國土因緣吾今先為諸菩薩說護佛果因緣護十地行因緣諦聽諦聽善思念之如法脩行時波斯匿王言善大事因緣故即散百億種色華變成百億寶帳葢諸大眾。",
        "translation": "It was then that the Buddha addressed the crowd, knowing that the 16 great kingdoms wanted to ask about the causes and conditions for protecting their lands. I will now first explain for the bodhisattvas the causes and conditions for protecting the buddhahood and the causes and conditions for protecting the ten stages of practice. Listen closely, listen well, consider it, and practice it according to the teaching.",
        "source": "X26n0513_002:0154c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文四一知請意二略正開三勸發三慧四歡喜供養今初爾時佛告大眾者教所被機也十六大國王意欲問護國土因緣者生下外護經文與護國品為本也吾今先為下二正略開二護謂因果也護佛果因緣即生此品也護十地行因緣即生教化品十地行者謂護因也問王但請護國土因緣佛何故先為說護佛因果耶答人情麤淺玅理難知王雖麤情唯請一而佛麤玅俱施又若但為說護國國土安樂增長憍慢今佛說出世因果令其厭俗樂入真也又索少是弟子之禮賜多是為師之法又索少表不貪施多表不慳又索少施多表慈導之志(云云)諦聽諦聽下三勸發三慧諦聽令生聞慧善思念之令生思慧如法脩行令生脩慧(云云)時波斯匿王下四歡喜供養王言善者信順之辭也大事因緣為茲出世顯令眾生開示悟入佛之知見法華以佛知見為大事涅槃以佛性為大事維摩思益以不思議為大事華嚴以法界為大事今此般若以成佛因果為大事名字雖別其義一也故智論佛說般若無央數眾生當續佛種是為大事又大品云須菩提白佛言世尊般若為大事故起龍樹釋云能破眾生諸大煩惱能與諸佛無上大法名為大事散華表行因成帳表得果葢眾表慈悲度物蔭育羣生(云云)。",
        "translation": "First, the Buddha told the multitude that this was the teaching to which the spiritual capacities of the sixteen great kings were geared, and the king of the sixteen great lands wanted to ask about the causes and conditions for protecting the land, namely, the birth of the following external protection sūtras and the section on protecting the land as the origin.",
        "source": "X26n0513_002:0154c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二問答廣釋文二先問次答今初。",
        "translation": "The second question and answer explains the text in detail, beginning with the question and ending with the answer.",
        "source": "X26n0513_002:0155a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大王復起作禮白佛言世尊一切菩薩云何護佛果云何護十地行因緣。",
        "translation": "The great king then rose again, paid homage, and said to the Buddha, \"Bhagavān, what do all the bodhisattvas do to protect the Buddha's fruit? What do they do to protect the causes and conditions of the ten stages of practice?",
        "source": "X26n0513_002:0155a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先脩敬二正發問問中有二一問護果二問護因。",
        "translation": "First, he asked two questions, one about protecting the results and the other about protecting the causes.",
        "source": "X26n0513_002:0155b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次答文大為三一明自利行(即此品答前問)二明利他行(教化品答二問)三明二護所依(二諦品)就答初問文二初正釋觀空二時眾得益初文二初正釋後總結釋中二初標宗正釋後問答重釋初文二一正釋二結行初又二一所化境二能化智今初。",
        "translation": "The text of the second answer is divided into three broad categories: first, an explanation of the practice of self-benefiting (which is the answer to the previous question in this section), second, an explanation of the practice of benefiting others (which is the answer to the two questions in the chapter on teaching and transforming), and third, an explanation of the two bases of protection (in the chapter on the two truths).",
        "source": "X26n0513_002:0155b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言菩薩化四生。",
        "translation": "The Buddha said that bodhisattvas transform four kinds of births.",
        "source": "X26n0513_002:0155b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天及地獄是化生鬼有胎化二生畜生則鳥及龍是四生人中亦四爾時人胎生毗舍佉子從三十二卵生大山小山比丘從鶴卵生菴羅波離婬女從溼生劫初人皆化生也(云云)。",
        "translation": "The gods and hells are created, ghosts are born in the womb, animals are born in the second life, birds and dragons are born in the fourth life, and there are also four human beings born in the womb, the son of Visākhā, from the thirty-two eggs born on mountains and hill monks, from the cranes' eggs born on mountains and hill monks, from the wet births of Ambapālī and women, and from the first birth of the eon, all are created.",
        "source": "X26n0513_002:0155b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明能化之智文三初約法二解釋三結成今初。",
        "translation": "Second, it explains the wisdom that transforms the text.",
        "source": "X26n0513_002:0155b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不觀色如受想行識如眾生我人常樂我淨如知見壽者如菩薩如六度四攝一切行如二諦如。",
        "translation": "Not observing form as feeling, perception, volition, and consciousness as sentient beings, self, persons, eternal happiness, self, and purity as knowing and seeing longevity as bodhisattvas, the six perfections, the four ways to incorporate all practices, and the two truths as such.",
        "source": "X26n0513_002:0155b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約五法一五陰二眾生三佛果四菩薩五真妄五陰是所依眾生是能依佛是果菩薩是因五陰眾生是妄佛菩薩是真也今初五陰是有如是空若見色見如不免斷常如則是斷色則是常若觀色滅方如此三藏見若體色即如此通見若如即色此別見若知一切法性真實空無生滅同真際等法性無二無別此圓見今言不觀色如等是圓見也眾生我人如者五陰眾共生名眾生我者計內五陰為假名人也常樂我淨如者前五陰眾生是顛倒法非常樂我淨今佛果得非顛倒法是常樂我淨隨盡煩惱有殊而性常無異其猶冰水故云如也知見壽者下明菩薩有三一位二人三行位者十信名知十解十行名見向至地名壽者雖有三別而一如也菩薩如者二明人如六度下三明行如問淨名云一切眾生皆如也一切法亦如也眾聖賢亦如也至於彌勒亦如也與今何異答彼是真空此是玅有問真空玅有云何答動即寂真空也寂即動玅有也真空故非常玅有故非斷真空不住生死玅有不住涅槃玅有故能起大悲真空故能生大慈問淨名云一切皆如此云不觀色如何耶答若偏觀一切皆如還是斷若不觀如還是常淨名云如令離常見此云不觀令離斷見二見既離中道自明矣(云云)二諦如者明真妄也世諦是妄出世是真也。",
        "translation": "The five aggregates are the basis, sentient beings are the basis, the Buddha is the result, the bodhisattva is the cause, and the sentient beings of the five aggregates are delusive, and the Buddha and bodhisattva are true.",
        "source": "X26n0513_002:0155b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二解釋。",
        "translation": "The two truths are explained.",
        "source": "X26n0513_002:0155c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故一切法性真實空不來不去無生無滅同真際等法性無二無別如虗空。",
        "translation": "Therefore, the true nature of all dharmas is emptiness, which doesn't come or go, has no arising or ceasing, and has the same true extent as the nature of dharmas without duality or distinction, such as space.",
        "source": "X26n0513_002:0155c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三一釋二會通三舉況今初一切法性是真有真實空是真空真空故不來真有故不去不去則無滅不來則無生無滅無生孰凡孰聖既無聖凡誰論觀與不觀也同真際下二會通真際還是真空法性還是玅有一色一香悉皆如是故云同等也如虗空者三舉況空中豈有五陰眾生菩薩諸佛世諦真諦生滅去來者乎恐昧者不解故舉斯況(云云)。",
        "translation": "The text is composed of three explanations, two interpretations, three cases, and the first is that all dharmas are truly existent, truly empty, and vacuum, so they don't come, truly existent, and therefore don't go away, and if they don't go away, then there's no cessation, and if they don't come away, then there's no birth, no cessation, and no birth.",
        "source": "X26n0513_002:0155c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三結成。",
        "translation": "The three conjugations are formed.",
        "source": "X26n0513_002:0156a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故陰入界無我無所有相。",
        "translation": "Therefore, the aggregates, aggregates, elements, and bases are without self and lack all characteristics.",
        "source": "X26n0513_002:0156a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無我是結陰入界眾生等如無所有相是結佛菩薩及知見壽者等如也。",
        "translation": "The absence of self is a bond with sentient beings in the aggregates, such as this, and the absence of all characteristics is a bond with buddhas, bodhisattvas, knowers, views, and lifers, such as this.",
        "source": "X26n0513_002:0156a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二結行。",
        "translation": "The second condition is practice.",
        "source": "X26n0513_002:0156a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是為菩薩行化十地般若波羅蜜。",
        "translation": "This is the bodhisattva's practice of transforming the ten stages into prajñā-pāramitā.",
        "source": "X26n0513_002:0156a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛云一切賢聖皆以無為法而有差別即同此文也(云云)。",
        "translation": "The vajra cloud says that all good and noble people are differentiated by the teaching of nonexistence, which is the same as this text (cloud).",
        "source": "X26n0513_002:0156a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二問答重釋文二初明三般若教二明依教發觀今初三般若即為三別初明實相般若又二先問後答今初。",
        "translation": "The second question and answer reinterprets the text in two ways. First, it explains the three teachings of prajñā and second, it explains the generation of contemplation based on the teachings.",
        "source": "X26n0513_002:0156a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白佛言若諸法爾者菩薩護化眾生為化眾生耶。",
        "translation": "He said to the Buddha, \"If that's the case with all things, then is the bodhisattva protecting and transforming sentient beings for the sake of transforming sentient beings?",
        "source": "X26n0513_002:0156a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上云不觀色如今問意者若云是為菩薩行化十地令諸法皆空者菩薩為化何等眾生耶。",
        "translation": "If the above saying is that the bodhisattva practices transformation of the ten stages so that all things are empty, what kinds of sentient beings does the bodhisattva transform?",
        "source": "X26n0513_002:0156a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二答文二一明真則無化二明俗則有化今初。",
        "translation": "The second answer is twofold: first, it shows that there's no transformation when it's genuine, and second, it shows that there's transformation when it's conventional.",
        "source": "X26n0513_002:0156a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王法性色受想行識常樂我淨不住色不住非色不住非非色乃至受想行識亦不住非非住何以故非色如非非色如。",
        "translation": "Maharaja, the Dharma nature of form, feeling, perception, volition, and consciousness is eternal, happy, self, and pure, and it doesn't abide in form and doesn't abide in non-form, and even feeling, perception, volition, and consciousness doesn't abide and doesn't abide.",
        "source": "X26n0513_002:0156a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文四一境二觀三徵四釋今初五陰是地前菩薩境常樂我淨是地上菩薩境(云云)不住色下二明觀有人言不住色者遮住色不住非色遮住空不住非非色雙遮住空住有又不住色遮住色陰不住非色遮住四陰不住非非色雙遮住五陰又不住色遮住色法不住非色遮住心法不住非非色遮住非色非心法又不住色不住有不住非色不住空不住非非色不住空空故淨名云空病亦空今解者具足應云不住色不住非色不住亦色亦非色不住非色非非色此中略第三句及四句非色兩字也以色即空故不住色以空即色故不住非色以色空無二而二故不住亦色亦非色以色空二而無二故不住非色非非色次例四陰非非住上言不住今言非不住只以不住為住住無所住金剛亦云應無所住而生其心也何以故者三徵意云何故言住又言不住也非色如下四釋非色如故不可定言住色非非色如故不可定言住非色也。",
        "translation": "The first five aggregates are the realm of the bodhisattvas before the ground, and the eternal bliss, self, and purity are the realms of the bodhisattvas on the ground (clouds) Not abiding in form, the second explanation under contemplation is that someone who says they don't abide in form is covering up form, not abiding in form, covering up emptiness, not abiding in non-form, and not abiding in non-form is covering up the four aggregates, not abiding in non-form, and not abiding in non-form is covering up the five aggregates, and not abiding in form is covering up form, not abiding in non-form is covering up mind, not abiding in non-form is covering up non-form, and not abiding in non-form is covering up non-form is not mind, and not abiding in form is not abiding in existence, not abiding in form is emptiness, and emptiness is form is abiding in non-form.",
        "source": "X26n0513_002:0156a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明俗則有化。",
        "translation": "Second, it explains that the conventional has transformation.",
        "source": "X26n0513_002:0156b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世諦故三假故名見眾生一切法性實故乃至諸佛三乘七賢八聖亦名見六十二見亦名見大王若以名名見一切法乃至諸佛三乘四生者非非見一切法也。",
        "translation": "Because of the conventional truth, the three nominal aspects are called views of the reality of the nature of all dharmas in sentient beings, even the seven virtuous and eight noble aspects of the three vehicles of the buddhas are also called views of the sixty-two views, and they are also called views of the great king.",
        "source": "X26n0513_002:0156b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文四初明二緣故見有眾生可化二結成上無眾生義三明邪正二見俱是見四結成正見今初言世諦者諦有三種一色諦二心諦三空諦也三假者謂法假受假名假也此中三假非成實中所明以無三藏故也名見眾生者以世諦及三假故有眾生可化也一切法性實故者二結成上真諦無眾生義一切眾生即涅槃相不復更滅故云實也乃至諸佛下三明邪正二見俱是見三乘聲聞緣覺菩薩也七賢謂七方便也八聖謂四果四向也六十二見釋者不同且依大論於五陰上皆作四句於色陰云過去色神及世間常是事實餘妄語無常等三句亦然餘陰亦如是成二十現在有邊無邊等歷五陰上有二十死後如去不如去等亦有二十成六十是神與身一神與身異成六十二見(云云)大王若以名名見下四結成正見若知諸法但有假名名之為見非同世人見一切法也(云云)。",
        "translation": "The text first clarifies the two conditions for seeing that there are sentient beings to be created, the second condition for forming the meaning of no sentient beings, the third clarifies that the wrong and right views are both views, and the fourth condition for forming the right view. First, the world truth is that there are three truths, the truth of form, the second truth of mind, and the third truth of emptiness, and the three hypotheses are the truths of dharmas and feelings, the truth of names, and the three hypotheses are not true because there are no three stores.",
        "source": "X26n0513_002:0156b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明觀照般若文二先問後答今初。",
        "translation": "The second explains the text of Prajñāpradīpa by contemplating two things: first, a question, and then an answer.",
        "source": "X26n0513_002:0156c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白佛言般若波羅蜜有法非非法摩訶衍云何照。",
        "translation": "He said to the Buddha, \"Prajñāpradīpa, how does Mahāyāna illuminate what's existent and not existent?",
        "source": "X26n0513_002:0156c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問意云有法既非是大乘云何照此從上非非見一切法文而生此難也。",
        "translation": "The question was, \"Since existent things aren't the great vehicle, how can they be illuminated?\" This difficulty arises from the view that what's above isn't above isn't above all the words in the Dharma.",
        "source": "X26n0513_002:0156c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後答文二先略後廣今初。",
        "translation": "The subsequent answer has two passages, first brief and then extensive.",
        "source": "X26n0513_002:0156c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王摩訶衍見非非法。",
        "translation": "\"The Mahāyāna's view is not non-lawful.",
        "source": "X26n0513_002:0156c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答意云大乘見者見法非法以色等法空故也。",
        "translation": "He answers by saying that the view of the great vehicle is that what's viewed is not valid because form and other things are empty.",
        "source": "X26n0513_002:0156c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二廣答文二初正廣釋二明能觀之智雙照空有初文二先明法空性空次歷法明空今初。",
        "translation": "The second extensive answer is twofold: first, a correct and extensive explanation, and second, an explanation of the cognition that observes and illuminates both emptiness and existence.",
        "source": "X26n0513_002:0156c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法若非非法是名非非法空法性空。",
        "translation": "法若非非法是名非非法空法性空。",
        "source": "X26n0513_002:0156c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法若非非法是名法空也法性空者性本若不空不可令其得空以性本自空故諸法皆空也。",
        "translation": "If a dharma is not non-non-non-natured, it's called the emptiness of the dharma.",
        "source": "X26n0513_002:0156c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二歷法明空文二先正明後釋成空義今初。",
        "translation": "Second, the text lays out the understanding of emptiness in two ways, first by explaining it directly and then by explaining the meaning of emptiness.",
        "source": "X26n0513_002:0157a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色受想行識空十二入十八界空六大法空四諦十二緣空。",
        "translation": "The emptiness of form, feeling, perception, volition, and consciousness, the emptiness of the twelve sense-fields and eighteen elements, the emptiness of the six elements, and the emptiness of the twelve conditions of the four truths.",
        "source": "X26n0513_002:0157a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約六門明空大論云五陰空是果報空十二入空是受用空十八界空是性別空以所病不同說斯三種為疑心數者說於五陰為疑色者說十二入為疑色心等者說十八界六大名遍到空阿含云六王諍大地云我能載水云能漂潤火云能燒照風云能生動空云能容受識云若無我者色則敗壞五雖大而識為主故云四大圍空識居其中也四諦是境空因緣是義空(云云)。",
        "translation": "From the perspective of the six approaches to understanding emptiness, the great treatise says that the emptiness of the five aggregates is the emptiness of retribution, the emptiness of the twelve sense-fields is the emptiness of sensation, and the emptiness of the eighteen elements is the emptiness of gender.",
        "source": "X26n0513_002:0157a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二釋成空義文二初就識陰次例四陰及諸法今初。",
        "translation": "Second, he explains the meaning of emptiness in two ways: first, with respect to the aggregate of consciousness; second, by way of example, with respect to the four aggregates and dharmas.",
        "source": "X26n0513_002:0157a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法即生即住即滅即有即空剎那剎那亦如是法生法住法滅何以故九十剎那為一念一念中一剎那經九百生滅。",
        "translation": "This is the same thing that arises, that abides, that ceases, that is, existence, that is, emptiness, and moment-to-moment, and so it is.",
        "source": "X26n0513_002:0157a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文四一標宗二類釋三徵詰四釋通今初以色法中有五義故空即生即住即滅者諸小乘師或云生前住次滅後或云生住同時皆不免難何者若云生前住次滅後則生時無住以生前故若無住者云何有生以先無住住於此生生不得住則無生也若住前無生則亦無住以無因故若生前有住則生住同時若生滅已方有住者住非生有此計異之過也若生住同時則因果一體生死同相此計一之失今云即生即住即滅者不同二說以諸法體念念遷流無有暫止亦是生時即住時滅時如疾炎過鋒奔緣經刃不已則來無暫住時故淨名云汝今即時亦生亦老亦滅也即有即空者色性自空非色壞故空也剎那剎那下二類釋明念念皆空同上五也剎那者極短時也何以故者三徵詰意云生滅相違云何言即生即住即滅等(云云)九十剎那下四釋通以九十小剎那為一大念一念中一剎那復有九百生滅是故生時即有住滅也又九十剎那為一念一念中一剎那經九百生滅一念有九十剎那合有八萬一千生滅以生滅攝剎那剎那攝一念如是心法不可得此明心空以四大分諸根諸根不可得以四微分四大四大不可得以麤微分四微四微不可得以極微分麤微麤微不可得推色至於極微窮心盡於生滅色盡心窮豁然無住無住之住不可名之強是為空即護三藏佛果也若見色色空見心心空無得無住此護通佛果也若見色心二法而一而異廣大如法界究竟若虗空函葢相稱此護別佛果也若見色心二法本來空寂不動不住不生不滅此護圓佛果也(云云)。",
        "translation": "The first of these four explanations is that there are five aspects of form and dharmas, so emptiness is produced, abiding, and ceasing.",
        "source": "X26n0513_002:0157a17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "第二例釋四陰及諸法。",
        "translation": "The second example explains the four aggregates and dharmas.",
        "source": "X26n0513_002:0157b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至色一切法亦如是。",
        "translation": "It's likewise for all dharmas up to and including form.",
        "source": "X26n0513_002:0157b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂類釋四陰及諸法亦即生即滅即有即空也。",
        "translation": "It's a kind of explanation of the four aggregates and dharmas that is, birth, extinction, existence, and emptiness.",
        "source": "X26n0513_002:0157b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明能觀之智雙照空有文二先明觀照次明得失初更二一照空二照有初則無相後是有相無相者非但無所照亦無能照照無所照也大品經中名為真實般若有相則接別凡聖無量教門大品經中名相似般若也照空文中更為二別。",
        "translation": "The second explains that the knowledge that enables contemplation both illuminates emptiness and existence.",
        "source": "X26n0513_002:0157c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初明照相以般若智中無毫釐實法故照一切法空二明空之分齊今初。",
        "translation": "The first clarifies the illumination of characteristics because there's not a single bit of real dharma in prajñāpāramitā's wisdom, and the second clarifies the division of emptiness into the first.",
        "source": "X26n0513_002:0157c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以般若波羅蜜空故不見緣不見諦乃至一切法空。",
        "translation": "It's because the perfection of wisdom is empty that it doesn't see conditions and doesn't see truths, even if all things are empty.",
        "source": "X26n0513_002:0157c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不見緣者十二因緣空不見諦者四諦法空乃至一切法空者六大法等空也(云云)言不見者觀諸法空故言不見非謂不照名為不見故經云非見及見名一切真實法也(云云)。",
        "translation": "Those who don't see the emptiness of the twelve causes and conditions don't see the emptiness of the truths, and those who don't see the emptiness of the four truths and the emptiness of all dharmas include the emptiness of the six elements (cloud).",
        "source": "X26n0513_002:0157c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明空之分齊。",
        "translation": "Second, it clarifies the distinction between emptiness.",
        "source": "X26n0513_002:0157c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內空外空內外空有為空無為空無始空性空第一義空般若波羅蜜空因空佛果空空空故空。",
        "translation": "Internal emptiness, external emptiness, internal and external emptiness, existent emptiness, and inactivity emptiness, beginningless emptiness, nature emptiness, first truth emptiness, prajñāpāramit emptiness, cause emptiness, Buddha-fruit emptiness, and thus emptiness.",
        "source": "X26n0513_002:0157c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分齊有十二種大論有十八空論問云若少則應一空若多則應無量何乃十八龍樹答云若略則事不周廣則事繁難悟如服藥少則病不差多則更增疾今說空亦如是少說則不能破邪見多說則近滋廣此經隨時治病不多不少唯十二也內空者謂內六入無神我外空者外六塵無我所內外空者根塵合觀無我我所有為空者色心和合生陰界入等皆無所有無為空者虗空數滅非數滅空也無始空者外道以冥初為始破此見故名無始空性空者諸法本無惑者計有乃至執言如來性等決定是有為破此見故言性空故經云眼空無我無我所何以故性自爾故乃至意亦如是又華嚴云觀眼無生無自性識空寂滅無所有也第一義空者本空世諦世諦不有此亦是空般若波羅蜜空者大經云大空者是般若空大論云十方俱空名大空也因空者六度等空果空者菩提涅槃空空空者大論云以諸空破內外等法復以此空破諸空是名空空又以空破有有者云空若執空為是須以此空空破也。",
        "translation": "There are twelve kinds of sameness, and the Mahāprajñāpāramitā has eighteen kinds of emptiness. The question is, if it's little, it should be one emptiness, if it's much, it should be countless. What are the eighteen nāgas? The answer is, if it's little, things aren't complete, if it's wide, things are complicated and difficult to understand.",
        "source": "X26n0513_002:0157c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二照有。",
        "translation": "Second, it illuminates existence.",
        "source": "X26n0513_002:0158a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但法集故有受集故有名集故有因集故有果集故有十行故有佛果故有乃至六道一切有。",
        "translation": "But because there's a collection of things, there's a collection of feelings, there's a collection of names, there's a collection of causes, there's a collection of effects, there are the ten practices, there's the fruit of the Buddha, and therefore there are all existences up to the six destinies.",
        "source": "X26n0513_002:0158a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三初三假門明有如上說因集故有下二四諦門明有因集是生死因即集諦果集是生死果即苦諦十行即道諦從十信心乃至十地各有十種行門也佛果是涅槃即滅諦也乃至六道一切有者三約六道二十五有等明有(云云)。",
        "translation": "The text first explains the three provisional approaches to existence as explained above, that there's existence because of cause and set, and the next explains the two four approaches to existence because of cause and set is the truth of set, that's the truth of suffering, and the ten practices are the truth of the path.",
        "source": "X26n0513_002:0158a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明得失文二初明邪觀(是失也)二明正觀(是得也)今初。",
        "translation": "The second explains the text of gain and loss, first by explaining wrong contemplation (which is loss), and second by explaining right contemplation (which is gain).",
        "source": "X26n0513_002:0158a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子若菩薩見法眾生我人知見者斯人行世間不異於世間。",
        "translation": "\"Good sons, if a bodhisattva sees that sentient beings are self and know and see, then that person's practice is worldly and not different from the world.",
        "source": "X26n0513_002:0158a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩發心行學般若見有法有眾生我人知見者世間凡夫無異也。",
        "translation": "If a bodhisattva develops the intention to practice prajñā and sees that there are dharmas, sentient beings, and self and others who know and see, then worldly mortals are no different.",
        "source": "X26n0513_002:0158a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明正觀二一明行二明位今初。",
        "translation": "Second, he correctly observes two things: first, he explains the practice and second, he explains the level.",
        "source": "X26n0513_002:0158b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸法而不動不到不滅無相無無相一切法亦如也諸佛法僧亦如也。",
        "translation": "'Regarding all dharmas that are immovable and don't reach cessation, marklessness, and marklessness, all dharmas are likewise, and so are the buddhas, Dharmas, and Saṃgha.'",
        "source": "X26n0513_002:0158b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言不動者即色是空非析色也不到者大品云平等之法一切聖人所不能到須菩提白佛言乃可餘聖不到佛何故不到佛言乃至佛亦不到何以故佛即平等平等即佛佛與平等無二故不到也不滅者空即是色也無相者色空空色皆無相也無無相者無相亦無也下例諸法(云云)。",
        "translation": "When it comes to immovability, it means form is emptiness, not analytical form.",
        "source": "X26n0513_002:0158b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明位。",
        "translation": "Second, he clarifies the stages.",
        "source": "X26n0513_002:0158b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是即初地一念心具足八萬四千般若波羅蜜即載名摩訶衍即滅為金剛亦名定亦名一切行如光讚般若波羅蜜中說。",
        "translation": "This is the first ground where a single moment of mindfulness is replete with 84,000 prajñāpāramitā, which is called mahāyāna, which is cessation, which is called vajra, which is also called concentration, which is also called all conditioned things, as explained in the prajñāpāramitā of light and praise.",
        "source": "X26n0513_002:0158b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文二初明正觀後示說處初文三一位二名三用今初也言一念者謂從第十回向以般若慧一念之中即有初地是時具足八萬四千度也依賢劫經始從光耀度終至分布舍利度合有三百五十功德門一一各脩六度即二千一百復將二千一百對十法謂四大六衰又對十善一一皆有二千一百即二萬一千又將二萬一千對四眾生多貪多嗔多癡三毒等分各有二萬一千合之即有八萬四千也(云云)即載名下二就名明正觀有本云即能運名摩訶衍載運義同也約體則是般若約用即是大乘即滅為金剛下三約用能滅煩惱如金剛破物謂第十地末後一念也能離散亂故名定此中一行具無量門也如光讚下二示說處也。",
        "translation": "The first two texts first clarify the correct contemplation and then show the place of explanation. The first text has three parts: one part, two names, and three functions. The first part says \"one thought\" which means that from the tenth dedication of merit to the wisdom of prajñā, in a single thought there is the first ground which is then fully 84,000 perfections.",
        "source": "X26n0513_002:0158b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三讚文字般若文五一名多佛共說二舉喻三格量四舉況五明信解相今初。",
        "translation": "The third praise of the text of Mahāyāna prajñāpāramitā is five: one that's explained by many buddhas together, two that cite metaphors, three that measure, four that cite situations, and five that explain the nature of faith and understanding.",
        "source": "X26n0513_002:0158c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王是經名味句百佛千佛百千萬佛說名味句。",
        "translation": "\"Great king, this is the sūtra's phrase of name and flavor, which is spoken by a hundred buddhas and a thousand buddhas and a hundred thousand million buddhas.",
        "source": "X26n0513_002:0158c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "論云一字曰字二字曰名二字不合不得為名若合說者始得為名四字等名句句下所詮名味。",
        "translation": "The treatise says that a word is a word, two words are names, and two words that don't fit together can't be called names until they're said to be four words and so forth.",
        "source": "X26n0513_002:0158c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二舉喻。",
        "translation": "Second, he cites a metaphor.",
        "source": "X26n0513_002:0158c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於恒河沙三千大千國土中成無量七寶施三千大千國土中眾生皆得七賢四果。",
        "translation": "In the 3,000 great thousand lands of the Ganges River Sands, immeasurable gifts of seven treasures are made, and sentient beings in the 3,000 great thousand lands all attain the seven virtuous stages and four fruits.",
        "source": "X26n0513_002:0158c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百億須彌百億日月鐵圍大海等是一大千界如河中沙一沙是一世界滿中七寶以施眾生及得四果也此中有財法二施意但文似隱也(云云)。",
        "translation": "Ten billion Sumeru, ten billion suns, ten billion moons, iron, and great seas are a great chiliocosm like the sands of a river, and one sand is a world full of seven treasures to give to sentient beings and attain the four fruits. There's an intention to give both possessions and dharmas, but the text seems to be cryptic.",
        "source": "X26n0513_002:0158c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三格量。",
        "translation": "The three categories are significant.",
        "source": "X26n0513_002:0158c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不如於此經中起一念信。",
        "translation": "How could you not give rise to a single thought of faith in this sūtra?",
        "source": "X26n0513_002:0158c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏之心起一念信勝前二施。",
        "translation": "When an untainted mind gives rise to a single thought of faith, it's superior to the previous two kinds of generosity.",
        "source": "X26n0513_002:0158c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四舉況。",
        "translation": "Fourth, he cites the situation.",
        "source": "X26n0513_002:0158c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況解一句者。",
        "translation": "What's more, he understands the phrase.",
        "source": "X26n0513_002:0158c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "信但不謗解能利他則信淺解深此約鈍根說若如法華云汝舍利弗尚於此經以信得入者此乃即信是解約利根說也。",
        "translation": "If faith but not discrediting understanding can benefit others, then faith is shallow and understanding is deep. This is said to be for the dull faculties, and if it's like the Lotus teaching that you, Śāriputra, have yet to enter this sūtra with faith, this is called faith as understanding, which is said to be for the sharp faculties.",
        "source": "X26n0513_002:0158c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五明信解相。",
        "translation": "Fifth, it clarifies the aspect of faith and understanding.",
        "source": "X26n0513_002:0158c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "句非句非非句故般若非句句非般若般若亦非菩薩何以故十地三十生空故始生住生終生不可得地地中三生空故亦非薩婆若非摩訶衍空故。",
        "translation": "The phrase is not a phrase, and the phrase is not a phrase; therefore, prajñā is not a phrase, and the phrase is not prajñā; prajñā is not a bodhisattva; why is it that the thirty births in the tenth ground are empty, so the first birth, abiding birth, and final birth are unobtainable?",
        "source": "X26n0513_002:0158c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三一明文空二明文義俱空三明人法俱空今初也句是有非句是無非非句是非有非無非有非前有句非無非前無句又句即文字也非句即文字之性離也非非句非前文字及性離之見也(云云)般若非句句非般若者二明文義俱空般若非句是義空句非般若是文空以即文非般若即般若非文離文無般若離般若無文文中無般若般若中無文如是互求不可得故即自空也又文及般若自他共離求不可得故空也般若亦非菩薩下三明人法俱空文中亦合明人空但文略故也自為二別一約因位辨法空二約果位辨法空初文三今初標也般若是法菩薩是人般若中求菩薩不可得即是法空何以故者二徵也十地下三釋若約通教即三乘共行十地說始住終若約別教即菩薩十地明始住終也亦非薩婆若下第二約果辨法空梵云薩婆若此翻一切種智一切種智即佛果也佛果亦空故云亦非薩婆若也摩訶衍是乘能乘人既空所乘之法亦空也(云云)初明三般若教竟。",
        "translation": "The first of the three texts clarifies the emptiness of the text, the second clarifies the emptiness of both text and meaning, and the third clarifies the emptiness of both person and dharma.",
        "source": "X26n0513_002:0159a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二依教發觀文二初明邪觀二正觀今初。",
        "translation": "The second relies on the teachings to generate the text of contemplation, first by defining wrong contemplation and second by right contemplation.",
        "source": "X26n0513_002:0159a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王若菩薩見境見智見說見受者非聖見也倒想見法凡夫人也。",
        "translation": "Maharaja, if a bodhisattva sees the object and sees wisdom, then he sees what's explained and receives it, which is not a noble view but also a mistaken conception and views the Dharma, then he's a worldling.",
        "source": "X26n0513_002:0159a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見境者見實相般若也見智者見觀照般若也見說見受見文字般若也如是執見是凡夫顛倒妄想非聖見也又見境謂見塵見智謂見識見說見受謂見人妄執宛然非聖見也。",
        "translation": "Seeing objects means seeing reality as prajñā, seeing wisdom means seeing insight as prajñā, seeing explanations, seeing feelings, seeing words as prajñā, and thus holding to views that are mistaken and deluded conceptions of worldlings and not noble views.",
        "source": "X26n0513_002:0159b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明正觀文二初約染淨因果以明空相二約無聽說以辨空相初文二初明生死空後辨佛果空前更二初正明生死空後釋空所由今初。",
        "translation": "The second clarification of the correct contemplation is twofold: the first clarifies emptiness in terms of defiled and pure causes and effects, and the second clarifies emptiness in terms of the absence of auditory discourse.",
        "source": "X26n0513_002:0159b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見三界者眾生果報之名也六識起無量欲無窮名為欲界藏空或色所起業果名為色界藏空或心所起業果名無色界藏空三界空三界根本無明藏亦空三地九生滅前三界中餘無明習果報空。",
        "translation": "Seeing the three realms is the name given to the results of sentient beings. The six consciousnesses that give rise to measureless desires and endlessness are called the store of desire realm emptiness, or the result of actions that arise from form is called the store of form realm emptiness, or the result of actions that arise from mind is called the store of formless realm emptiness.",
        "source": "X26n0513_002:0159b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文二一明正使空二明習氣空初文二一明分段生死後明變易生死初更三今初明果空也三界是器世間眾生是假名世間果報是五陰世間謂三界依正也六識起下二明業空以六識取六塵起諸煩惱貪著五欲展轉無量蘊集含藏名之為藏無自性故名之為空(云云)三界空下三明煩惱空三界之木一念癡心闇於前境名曰無明有此無明即生三界無明如地能生萬物故名本也三地九生下二明變易生死空有人言三地者一見地從十回向至三地二脩地從四地至七地三究竟地從八地至十地此別接通意也九生滅者前三地中各有始住終云九生滅也又變易生死三界中各有三種意生身三界名三地各有三種意生身生滅名九生滅也從初地至五地名三昧樂意生身六七二地名覺法自性意生身八地已上名無作行意生身此通別教意生也餘無明習者上明五住正使此第二明習氣空也。",
        "translation": "The text is two: one explains the emptiness of the correct causes and two explains the emptiness of karmic impressions. The first text is two: one explains birth and death in segments, the second explains birth and death in transformations, and the third explains the emptiness of the fruits.",
        "source": "X26n0513_002:0159b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二釋空所由。",
        "translation": "Second, he explains the reason for emptiness.",
        "source": "X26n0513_002:0159c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金剛菩薩藏得理盡三昧故惑果生滅空有果空因空故空。",
        "translation": "The vajra bodhisattva's store has attained the samādhi of the exhaustion of principle, so the afflictions that result from birth and extinction are empty, the existences and effects are empty, and the causes are empty, therefore empty.",
        "source": "X26n0513_002:0159c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此菩薩得理盡三昧故一種生死煩惱業等皆空所言惑者謂迷妄之心造生死業不達心源名之為惑即是煩惱果者即正報果有生滅故得名空有果空者即三界依報空故又果空者謂變易生死空因空者謂三界業煩惱等空也理盡三昧者謂菩薩得此三昧達理盡源極無明本故名理盡三昧也(云云)。",
        "translation": "The confusion refers to the deluded mind that creates birth-and-death karma and doesn't reach the mind's origin, which is called confusion. The result is the direct result of retribution, which is birth and extinction, and therefore gets the name emptiness.",
        "source": "X26n0513_002:0159c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明佛果空。",
        "translation": "Second, it clarifies the emptiness of the Buddha's fruit.",
        "source": "X26n0513_002:0159c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "薩婆若亦空滅果空或前已空故佛得三無為果智緣滅非智緣滅虗空薩婆若果空也。",
        "translation": "If sarvajñas are also empty and the fruit of cessation is empty or if the prior is empty, then the Buddha will attain the three fruits of nothingness because cessation of cognition and non-cessation of cognition are empty and the fruit of sarvajñas is empty.",
        "source": "X26n0513_002:0159c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三今初明智斷空薩婆若亦空者是智空滅果空者是斷空或前已空者是正因佛性空佛性本自空非推之使空故言或前已空也佛得三無為下二明無為空智緣滅者觀心佛正觀心滅於煩惱名智緣滅非智緣滅者謂正因佛性性本自淨無煩惱垢不勞觀行而滅惑也虗空者無色現處是也薩婆若下三結果空也(云云)。",
        "translation": "The first of the three wise interpretations of the present is that sarvajña is also empty, which is the cessation of emptiness, and the fruit of emptiness is the cessation of emptiness or the prior emptiness, which is the direct cause of the emptiness of the buddha-nature, which is inherently empty and not made empty by thrusting, so it's said to be empty or the prior emptiness.",
        "source": "X26n0513_002:0159c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二約無聽說以明空相。",
        "translation": "The second is to explain the character of emptiness by referring to the absence of listening and explaining.",
        "source": "X26n0513_002:0160a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子若有脩習聽說無聽無說如虗空法同法性聽同說同一切法皆如也。",
        "translation": "Good sons, if there is cultivation of listening and explaining, there is no listening and explaining as in the case of space, the Dharma nature is the same as listening and explaining the same as in all things.",
        "source": "X26n0513_002:0160a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文中法喻合可見聽說如虗空者大品云聽如幻人聽說如幻人說故無聽說淨名云夫法說者無說無示其聽法者無聞無得法同法性者淨名云法同法性入諸法故以此例諸故皆如也。",
        "translation": "In the text, the Dharma metaphor is combined with the visible hearing and teaching like empty space, which is the great teaching that listens like an illusory person who listens and tells like an illusory person tells, so there's no hearing and teaching.",
        "source": "X26n0513_002:0160a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二總結。",
        "translation": "The second conclusion.",
        "source": "X26n0513_002:0160a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大王菩薩脩護佛果為若此護般若波羅蜜者為護薩婆若十力十八不共法五眼五分法身四無量心一切功德果為若此。",
        "translation": "The great king, the bodhisattva who protects the fruit of the Buddha's life is this protector of the prajñāpāramitā who protects the ten powers and 18 distinctive qualities of the five eyes and five parts of the Dharma body and the four immeasurable minds, and the fruit of all merits is this protector of the prajñāpāramitā.",
        "source": "X26n0513_002:0160a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先結能護體也護般若下二結能護用(云云)。",
        "translation": "First, he concludes that he can protect the essence, and second, he protects the function of Prajñā (clouds).",
        "source": "X26n0513_002:0160a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明時眾得益。",
        "translation": "The second clarifies the benefits to the multitude of people at the time.",
        "source": "X26n0513_002:0160a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說法時無量人眾皆得法眼淨性地信地有百千人皆得大空菩薩大行。",
        "translation": "When the Buddha taught the Dharma, measureless multitudes of people attained the Dharma-eye, the ground of purity, the ground of faith, and a hundred thousand people attained the great practice of the bodhisattva of great emptiness.",
        "source": "X26n0513_002:0160a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文二先時次益法眼淨者謂初地已上見中法非小乘中法眼也性地者謂三乘共行十地略九舉一也信地者即四不壞信十信菩薩是也大空大行即別教初地圓教初住已上皆名大空大行也(云云)問佛說般若何故得益不同答法華經云一地所生一雨所潤根莖大小差別自殊如其種性各得生長今說般若亦復如是雖說一法得益自差也。",
        "translation": "The text is twofold: first, the time and second, the benefit of the purified Dharma eye, which is the middle way of seeing things from the first ground upward, not the middle Dharma eye of the lesser vehicle; the nature ground, which is the common practice of the three vehicles, the ten grounds, the nine abbreviations, and the one mentioned; and the faith ground, which is the four indestructible faiths and the ten faithful bodhisattvas.",
        "source": "X26n0513_002:0160a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "仁王護國般若波羅蜜經菩薩教化品第三初三品明內護中今當第二釋護十地行即是明利他答第二問也言教化品者菩薩以利物為德教諸眾生離一切惡化諸眾生脩一切善又佛將此法教化眾生得成菩薩故云教化品又以此法化諸國王令識般若故也(云云)。",
        "translation": "Renwang huguo banruo boluomi jing pusa jiaocheng pin three the first three pin Ming neixiang now will be the second to explain the protection of the ten ground practices that is to understand the benefit of others answer the second question also said jiaocheng pin the bodhisattva with the virtue of benefiting things to teach sentient beings free from all deterioration sentient beings cultivate all good and the Buddha will teach this method to transform sentient beings to become bodhisattvas so it's called jiaocheng pin and with this method to transform the king of the countries to make them know prajñā (cloud).",
        "source": "X26n0513_002:0160b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "品文二一發問二佛答今初。",
        "translation": "The text of the Chapter consists of two parts: first, a question and second, the Buddha's reply.",
        "source": "X26n0513_002:0160b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白佛言世尊護十地行菩薩云何行可行云何行化眾生一以何相眾生可化。",
        "translation": "He said to the Buddha, \"Bhagavān, what are the ten practices of a bodhisattva, what are the feasible practices, what are the practices that transform sentient beings, and what are the characteristics of sentient beings that can be transformed?",
        "source": "X26n0513_002:0160b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文有二意一揲前品中護十地行菩薩即能護人也次云何行可行等者正是問辭一問菩薩自利行法二問利他行三問所化眾生之相(云云)又初問自利依何脩行故以五忍答之次問利他依何位行故以十地行答之後問何相眾生可化故以幻身見幻化眾生而教化之又此經說通自他而就他說為正故文多利他行故譯者亦以教化標目。",
        "translation": "The text has two meanings: first, it sorted out the previous section in which the bodhisattva guarding the ten practices was able to protect people; second, it asked what practices were feasible and so forth, which were precisely the words of the question that asked first about the bodhisattva's practices for self-benefiting, second about the practices for the benefit of others, and third about the characteristics of the sentient beings that were created (cloudy).",
        "source": "X26n0513_002:0160b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二佛答文二初答前二問次答第三問前文三初正答二問次月光偈讚後如來述成初文更二一正答前問兼利他二正答後問兼自利前文更三初略答二廣答後總結今初。",
        "translation": "Second, the Buddha answered the text with two answers, first to the first two questions, then to the third question, and then with three answers, first to the two questions, then to the verse praising the moonlight, and then to the tathāgata's explanation of the accomplishment of the first question, and then with two answers, first to the first question and for the benefit of others, and second to the second question and for the benefit of self.",
        "source": "X26n0513_002:0160b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言大王五忍是菩薩法伏忍上中下信忍上中下順忍上中下無生忍上中下寂滅忍上下名為諸佛菩薩脩般若波羅蜜。",
        "translation": "The Buddha said, \"Great King, the five kinds of forbearance are the bodhisattvas' patience of subduing dharmas, their higher, middle, and lower levels of faith, their higher, middle, and lower levels of compliance, their higher, middle, and lower levels of forbearance of nonproductivity, their higher, middle, and lower levels of forbearance of cessation, and their upper and lower levels are called the perfection of wisdom cultivated by the buddhas and bodhisattvas.",
        "source": "X26n0513_002:0160b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復為三初標數二列名三總結今初也準下結諸佛菩薩本所脩行今隨問而答故但云是菩薩法耳二伏忍下列名也地前三賢未得無漏未能證但能伏不能斷故為伏忍智也以有智故能伏煩惱初地二地三地得無漏信名信忍四五六地趣向無生名順忍七八九地諸念不生名無生忍十十一二地得菩薩果名寂滅忍以初地得無漏信此別教意也七地得無生忍即別接通意也然此五忍諸經不同若依本業纓絡云六性一習種性二性種性三道種性四聖種性五等覺性六妙覺性即是十住十行十回向十地等覺玅覺也亦名四十二賢聖(云云)名為諸佛下三總結也。",
        "translation": "There are three further categories, the first indicating the number, the second listing the names, and the third summarizing the present, the first being the standard, the second concluding the practices originally cultivated by the buddhas and bodhisattvas, the present answering questions as they arise, and simply saying that they are bodhisattva dharmas. The three stages of patience of submission are also named after the following three stages of goodness who have yet to attain uncontaminated realization but are able to subdue and not eliminate them because they have knowledge that subdues afflictions.",
        "source": "X26n0513_002:0160c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二廣釋五忍即為五別初伏忍中三賢不同即為三別先釋十住。",
        "translation": "The second explains the five kinds of forbearance in detail, which are the five distinctions. The first explains the ten abodes, which are the three distinctions among the three stages of forbearance.",
        "source": "X26n0513_002:0160c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子初發相信恒河沙眾生脩行伏忍於三寶中生習種性十心信心精進心念心慧心定心施心戒心護心願心迴向心是為菩薩能少分化眾生已超過二乘一切善地一切諸佛菩薩長養十心為聖胎也。",
        "translation": "Good sons, the first arouses the belief that a great number of sentient beings cultivate the practice of forbearance and cultivate the seed nature of the ten mental states of faith, diligence, mindfulness, wisdom, concentration, generosity, discipline, protection, vows, and dedication of mind.",
        "source": "X26n0513_002:0160c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文五一明方便二明入位三顯力用四釋超過五成聖因今初言發想信者十信之中未入十住不見道理但能想信想信若成即入十住言恒沙者發心者多也如大經云如菴羅樹華多果少如大魚母胎子雖無量成就者少此言眾生欲求寶渚至於中路咸悉退還也於三寶中下二明入位於三寶田中生此十心也善順故信(不退名進不忘名念)決斷名慧不動名定能捨名施防護名戒不失名護上求曰願至菩提名回向是為菩薩下三明力用以十住菩薩作銅輪王王南西二方名少分化眾生也已超過二乘下四釋超過此圓教大乘十信則與二乘齊十住則斷無明過二乘地也(云云)言一切善者十信名善故下經云十善菩薩發大心長別三界苦輪海言超過二乘即聲聞緣覺一切善地即十信菩薩也一切諸佛下五成聖因十心是因諸佛菩薩是緣因緣和合故成聖胎也即以中道一心三觀為種子斷一品無明即能見佛性故成聖胎也。",
        "translation": "The first five explanations of the text first clarify the method, second clarify the stage of entry, third show the power, and fourth explain the five causes of becoming holy beyond the first one, which is to arouse the conception of faith.",
        "source": "X26n0513_002:0160c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明十行。",
        "translation": "The second explains the ten practices.",
        "source": "X26n0513_002:0161a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第起乾慧性種種行十心所謂四意止身受心法不淨苦無常無我也三意止三善根慈施慧也三意止所謂三世過去因忍現在因果忍未來果忍也是菩薩亦能化一切眾生已能過我人知見眾生等想及外道倒想所不能壞。",
        "translation": "The ten practices that sequentially give rise to the nature of dry wisdom are the four mental stops of the body, feelings, mind, and dharmas that are impure, painful, impermanent, and selfless, the three mental stops of the three good roots, kindness, generosity, and wisdom, and the three mental stops of the three past causal forbearance, present causal forbearance, and future fruition forbearance.",
        "source": "X26n0513_002:0161a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有本云復次善男子今且依次第解也文四一明位二辨體三明化他四釋離患今初明位即三忍中第二忍也前下伏忍即是聞慧今中伏忍即是思慧言乾慧者無定水也故云是思慧耳經千字者非纓絡中有六性亦名六慧言六性者即習種性種道種聖種等覺玅覺等也言六慧者謂聞思脩無相照寂寂照等也習已成性名種性有十心者總標其數也所謂四意止下二辨體文三今初明四念處意止者謂以智慧令心止住意即心王也身受心法者明所觀之境也苦無常等明能觀之體也觀身不淨能除淨倒觀受是苦能除樂倒觀心無常能滅常倒觀法無我能除我倒也三意止下二明三善根以慈故無瞋施故無貪慧故無癡也三意止下三明三世忍心緣過去無明及行名因忍現在五果及現在三因名因果忍未來兩果名為果忍又於一切法皆有此三如種子但因如苽瓠亦因亦果能作果等是因結實成種是果種等但果非因此約一時三世論也是菩薩亦能下三明化他也已能過下四明離患文中先明離內患即我人知見等也及外道下次明離外患也。",
        "translation": "There's a text that says, \"Furthermore, good sons, let's now explain the text in order. First, we'll explain the first four positions, which are the second of the three kinds of forbearance. First, we'll explain the first position, which is the second of the three kinds of forbearance.",
        "source": "X26n0513_002:0161a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三明十回向。",
        "translation": "The third explains the ten dedications of merit.",
        "source": "X26n0513_002:0161b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有十道種性地所謂觀色識想受行得戒忍知見忍定忍慧忍解脫忍觀三界因果空忍無願忍無相忍觀二諦虗實一切法無常名無常忍一切法空得無生忍是菩薩十堅心作轉輪王亦能化四天下生一切眾生善根。",
        "translation": "There are also ten paths in the ground of seed nature, which are called observing form, consciousness, perception, feeling, and volition to attain forbearance of morality, knowledge, vision, forbearance of concentration, forbearance of wisdom, forbearance of liberation, observing the emptiness of causes and effects in the three realms, forbearance of wishlessness, forbearance of signlessness, observing the two truths as they really are, the impermanence of all things is called the forbearance of impermanence, and the emptiness of all things obtains the forbearance of nonarising. These ten resolute states of mind of the bodhisattva become the wheel-turning king who can also transform the four worlds into births of all sentient beings with good roots.",
        "source": "X26n0513_002:0161b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有本云復次善男子脩行上伏忍進入平等道名為道種性地文有四今初標位也謂欲入初地能與聖道為因性故名道種性所謂觀色下二出體文三初明五忍中初列五陰是所觀法得戒下是能觀智由觀色陰便得戒忍以作無作戒皆色陰也準此經文作無作戒皆是色攝觀識陰故得知見忍以了別識與知見文類相似也觀想陰得定忍以從倒想能入於定如無色界天由想故成觀受陰得慧忍以依受故立四禪天由於禪故能發智慧觀行陰得解脫忍以行無常故得解脫忍問何故色下而說識答四陰皆心為主由識分別於色由色故識方能行相生義便如此說(云云)觀三界下二明三忍以觀三界苦果空故得空忍觀三界因空故得無願忍以煩惱業為集諦故也觀三界因果空故得無相忍證因果空成無相觀也二諦虗實下三明二忍以觀俗諦是有為法得無常忍觀真諦是無為法故得無生忍無常忍即小乘藏教無生忍即大乘通教也出體竟是菩薩十堅心下三明攝化以道種性菩薩作金輪王化四天下也又十堅心者即結上五三二忍成十堅也生一切眾生善根者四明勝用也伏忍三品竟(云云)。",
        "translation": "There is a text that says, \"Furthermore, good sons who practice the higher level of suppressive tolerance enter the path of equality and are called the seed nature of the path. There are four levels of the text that are first labeled as the desire to enter the first ground, which is the ability to make the noble path a cause and therefore is called the seed nature of the path.",
        "source": "X26n0513_002:0161b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明信忍。",
        "translation": "The second clarifies the tolerance of faith.",
        "source": "X26n0513_002:0161c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又信忍菩薩所謂善達明中行者斷三界色煩惱縛能化百佛千佛萬佛國中現百身千身萬身神通無量功德常以十五心為首四攝法四無量心四弘願三解脫門是菩薩從善地至於薩婆若以此十五心為一切行根本種子。",
        "translation": "The bodhisattva who tolerates faith is called a well-versed practitioner in the knowledge that he has cut the bonds of form and affliction in the three realms and can transform a hundred buddhas, a thousand buddhas, and ten thousand buddha lands into a hundred bodies, a thousand bodies, and ten thousand bodies with measureless powers, always headed by fifteen states of mind, four methods of gathering, four immeasurable states of mind, four vast vows, and three gates of liberation, which are the bodhisattvas' fundamental seeds of all practices from the good stages up to sarvajña.",
        "source": "X26n0513_002:0161c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文四今初標名配位言信忍者以無漏信三寶等故名信言善達明中行者配位如下經說善覺初地菩薩證人法二空故名善覺也達即離達謂二地菩薩離破戒垢達真俗理故名離達明即明慧謂三地菩薩智慧光明照諸法故故名明慧五陰假人於中脩行名中行者下經云道行人此道成人名行人斷三界下二明離障以色煩惱麤故於此三地而斷(云云)能化百佛下三明攝化三等差別配對三地可解問信有幾種答略有三種一想信輕毛菩薩十信是二久信三賢菩薩是三證信初二三地是也(云云)常以十五心下四明發行種子四攝者布施愛語利益同事四無量者慈悲喜捨四弘誓頥者瓔絡經云願一切眾生度苦斷集證滅脩道名四願也乃至成佛從於初地用此十五心為根本(云云)。",
        "translation": "The text firstly labels the words faith and ninja as the appropriate level because of untainted faith in the Three Treasures and so forth, so it's called faith. The first level bodhisattva realizes the emptiness of both people and things, so it's called good awakening.",
        "source": "X26n0513_002:0162a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三明順忍。",
        "translation": "The third clarifies the subject of forbearance.",
        "source": "X26n0513_002:0162a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又順忍菩薩所謂見勝現法能斷三界心等煩惱縛故現一身於十方佛國中無量不可說神通化眾生。",
        "translation": "The bodhisattva of compliant tolerance is said to see the surpassing present dharma and be able to sever the bonds of affliction in the three realms, mind, and so forth, and therefore manifest himself in measureless, ineffable superknowledges in the Buddha lands of the ten directions to transform sentient beings.",
        "source": "X26n0513_002:0162a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三今初標名位順無生忍觀而未正得故名順忍見勝現法者即是位也見謂順忍下品見理道品分明即第四炎地勝即中品第五難勝地難勝有二義一教化眾生二不從煩惱於二事得勝名難勝地現法即第六現前地因緣觀解現前故也能斷三界心等煩惱縛者二明除障前斷色煩惱此斷心煩惱又前斷見惑此斷思惑故言心也故現一身下三明攝化前信忍明化身故云現百身千身萬身今順忍明實身故云現一身於十方佛土化眾生也問云何一身現於多土答不思議力神通變化令眾見也。",
        "translation": "In the text, the first of the three is labeled the stage of Shunnaramitra, which is the stage of observing the principle of forbearance and not yet correctly attained, so it's called Shunnaramitra. Seeing the superior manifestation is the fourth stage of Shunnaramitra, which is the fifth stage of the middle stage of the difficult stage of the difficult stage of the difficult stage of the difficult stage of the superior has two meanings: first, it teaches and educates sentient beings; second, it doesn't follow afflictions and attains victory in two matters; it's called the difficult stage of the superior manifestation because it's able to cut the bonds of afflictions like the mind in the three realms.",
        "source": "X26n0513_002:0162a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四明無生忍。",
        "translation": "The fourth clarification is the acceptance of nonarising.",
        "source": "X26n0513_002:0162b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又無生忍菩薩所謂遠不動觀慧亦斷三界心色等習煩惱故現不可說不可說功德神通。",
        "translation": "Because the bodhisattva's wisdom of forbearance of nonarising is called the observation of immovability and the cutting off of the three realms, mind, form, and other habituated afflictions, he manifests ineffable and ineffable merits and superknowledges.",
        "source": "X26n0513_002:0162b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三今初標名位謂以自他共無因求色心二法不可得於此得智名無生忍所謂遠不動觀慧者此配位也遠即第七遠行地能至有功用心後邊故不動即第八不動地有相煩惱不能動故觀慧即第九善慧地四無礙解化眾生故亦能斷三界心色等煩惱習者二明除障前各斷二重今雙斷正習也故現不可說下三明攝化分齊(云云)。",
        "translation": "The first of the three texts now labels the level of naming, meaning that the two things of form and mind are unobtainable because of the absence of cause in common with self and others, and here attains the knowledge called the patient acceptance of nonarising. The so-called far immovable contemplation wisdom is also the level of equipoise that's far, meaning the seventh ground of distant practice, and which can reach the end of the mind with effort.",
        "source": "X26n0513_002:0162b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五辨寂滅忍文四初標名位二辨除障三約諦辨異四攝化分齊今初。",
        "translation": "The fifth section describes the four categories of the forbearance of cessation: first, identifying the level of naming, second, identifying the removal of hindrances, third, identifying differences in terms of truth, and fourth, the equalization of the categories of gathering and transformation.",
        "source": "X26n0513_002:0162b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次寂滅忍佛與菩薩同用此忍入金剛三昧下忍中行名為菩薩上忍中行名為薩婆若。",
        "translation": "Furthermore, the buddhas and bodhisattvas use this forbearance together to enter the vajrasamādhi, and the practice in the lower forbearance is called bodhisattvahood, and the practice in the upper forbearance is called sarvajña.",
        "source": "X26n0513_002:0162b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三一標名者前之四忍未盡法源今之一忍寂諸心色滅於想習名寂滅忍(云云)佛與菩薩下二明證用金剛是喻三昧是定有以煩惱如金剛以其堅靳不可即斷非佛智力無能斷者如經中龜甲羊角所能破者是此義也有以智慧如金剛能破煩惱不為彼損亦大經中言金剛寶瓶無嘶破聲是其義也今佛與十地菩薩同用寂滅忍入金剛三昧也(云云)下忍中行下三配位下忍即法雲上忍即佛也薩婆若此云一切智又無礙道因位攝故名下忍解脫道果攝故名上忍又法雲與佛同入金剛三昧前心名菩薩後心名佛無有中間故但上下前之四忍但是因位故有三品問諸經有等覺何故此中不立答若依餘經即合有三品下品十地中品等覺上品玅覺今般若附通不同別教故但論法雲即及佛地故大品云十地菩薩當知如佛如者未是義大經亦云十地菩薩見性未了此皆通教意也(云云)。",
        "translation": "The text contains three apt titles: \"The previous four kinds of forbearance have not yet exhausted the source of the teaching; the present one is the forbearance of tranquility, the cessation of mental form, and the cessation of the habituation of perception, which is called the forbearance of tranquility.\" (cloud) The next two understandings of the Buddha and the bodhisattvas use vajra as a metaphor; concentration is concentration; there are afflictions like vajra that are hard and impregnable, which cannot be cut instantaneously; there are those who cannot be cut by the power of the non-buddha, such as the tortoise, the armor, and the horns, which can be cut by the power of the buddha.",
        "source": "X26n0513_002:0162b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二辨除障。",
        "translation": "The second discernment removes the hindrances.",
        "source": "X26n0513_002:0162c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "共觀第一義諦斷三界心習無明盡相為金剛盡相無相為薩婆若。",
        "translation": "The shared observation of the cardinal truth ends the three realms, mental conditioning, nescience, and marklessness, and the marklessness of the adamantine mark is the sarvajña.",
        "source": "X26n0513_002:0162c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三初明所觀之境同觀真諦而明昧不同如大經云如十地菩薩聞見佛性諸佛如來眼見佛性又十地菩薩名有上士佛名無上士又菩薩如十四夜月佛如十五夜月等(云云)斷三界心習者二正辨除障前無生忍中雙斷心色麤習今此忍中永斷心法細習也無明盡相下三明二道差別之相無明盡相為金剛者此無礙道也言盡相者未盡之義如煙是火相而未是火金剛喻定是盡無明之相而無明未盡問若無明未盡應是煩惱何故前文佛與菩薩同入此定答無明之性即是於明如燈生時即同滅時只以一念無明心變為明微明即菩薩大明即佛也盡相無相為薩婆若者此解脫道前金剛下定但盡色心麤細之相不得名一切智今佛地非但盡相亦盡無相故得名一切智可謂緣觀雙冥境智俱寂也。",
        "translation": "The text first clarifies that the objects of contemplation are the same as contemplating the true truth, but the clarity is different. As the great sūtras say, \"Suppose a tenth-stage bodhisattva hears and sees the buddha-nature, the Buddha-tathāgata's eyes see the buddha-nature, another tenth-stage bodhisattva is called a superior person, another buddha is called an unsurpassed person, another bodhisattva is like the fourteenth moon of the night, another buddha is like the fifteenth moon of the night, etc.\" (cloudy) Stopping mental conditioning in the three realms is the second correct way to discern the removal of hindrances.",
        "source": "X26n0513_002:0162c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三約諦辨異。",
        "translation": "The third is to discern the difference in terms of the truths.",
        "source": "X26n0513_002:0163a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "超度世諦第一義諦之外為第十一地薩云若覺非有非無湛然清淨常住不變同真際等法性。",
        "translation": "Beyond the supramundane truth of the cardinal truth, the eleventh-stage bodhisattva discerns that what's neither existent nor nonexistent is perfectly pure, eternally abiding, unchanging, and identical to the true reality and other dharmas.",
        "source": "X26n0513_002:0163a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三賢多住世諦十地多住真諦真諦即無世諦即有超世諦故非有超真諦故非無非有非無即薩云若問薩婆若薩云若有何差別答有二說一云同二云異同者彼此無殊異者薩婆若是一切智薩云若一切種智今謂說五忍文寂滅忍中既唯分二品不應更有薩婆若薩云若之別復說即有密明等覺之義即於寂滅忍中有上中下下即十地中一切智上一切種智若依經超度二諦外為第十一地薩云若者即依前釋(云云)。",
        "translation": "The three wise men mostly abide in the conventional truth, and the tenth ground mostly abides in the true truth. The true truth is the absence of the conventional truth, which is existence, transcending the conventional truth, and therefore not existing, transcending the true truth, and therefore not nonexistent, not existing, and not nonexistent.",
        "source": "X26n0513_002:0163a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四明攝化分齊文二初略二廣今初。",
        "translation": "The fourth section on gathering in and transforming people is divided into two categories: first, briefly, and second, broadly.",
        "source": "X26n0513_002:0163a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無緣大悲教化一切眾生乘薩婆若乘來化三界。",
        "translation": "Without conditions, great compassion teaches and transforms all sentient beings to come to the three realms on the vehicle of sarvajña.",
        "source": "X26n0513_002:0163a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切眾生在於三界佛以大悲而濟拔之法華云諸子游戲來入此宅長行即云長者驚入火宅淨名云菩薩病者從大悲起皆此意也大悲是能化心眾生是所化境薩婆若是能化體大悲有三一眾生緣悲外道亦有二法緣悲二乘亦有三無緣悲唯佛獨有。",
        "translation": "All sentient beings in the three realms are rescued by the Buddha through great compassion. The Lotus teaching says that sons who play enter this house, and the long practice says that the elder is startled into the burning house.",
        "source": "X26n0513_002:0163a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二依宗廣釋。",
        "translation": "The second is a detailed explanation based on the thesis.",
        "source": "X26n0513_002:0163b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子一切眾生煩惱不出三界藏一切眾生果報二十二根不出三界諸佛應化法身亦不出三界三界外無眾生佛何所化是故我言三界外別有一眾生界藏者外道大有經中說非七佛之所說大王我常說一切眾生斷三界煩惱果報盡者名為佛自性清淨名覺薩云若性。",
        "translation": "\"Good sons, all sentient beings' afflictions don't exit the store of the three realms, all sentient beings' fruition of the twenty-two faculties don't exit the three realms, the Dharma body that's transformed by the buddhas doesn't exit the three realms, and there are no sentient beings outside the three realms that the buddhas don't transform.",
        "source": "X26n0513_002:0163b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三初約正理三界者欲色無色等三也藏者能含六道四生也果者分段報果也報者苦樂等報也二十二根者眼等六根苦樂憂喜捨五成十一根男女命三信進念定慧等五成十九根未知根欲知根知已根成二十二根二十一根不出分段三界知已根不出變易三界諸佛三身亦不出三界者以法身即應化也大經云今我此身即是法身法華云常在靈鷲山及餘諸住處普賢觀云釋迦牟尼名毗盧遮那遍一切處華嚴云亦名釋迦亦名舍那等既知三身即一身亦須知界外即界內也三界外無眾生下二明聽說說云界外有眾生可化者此外道說非佛說也問界外實無眾生耶答聖教不同有無異說此經則云界外無眾生餘經則有法華云餘國作佛三百由旬外權置化城淨名云上方界分度如四十二恒佛土有佛名香積若界外無人豈容三界內上方更有爾許佛土耶故知亦有問此經云無餘經云有如何會通答此經云無無分段眾生餘經云有有變易眾生故大論云聲聞生界外白銀世界無煩惱名只約無煩惱即云無眾生而聲聞無明未斷豈實無耶此文正是通教意偏論界內煩惱眾生也衛世師外道說有六諦大有經是其一諦彼經說云此三界外別有世界若言三界外別有眾生同彼外道說也實理而論若言界外有眾生即同外道若言無即同二乘諸佛菩薩見者即不有不無不有不無即非如非異非如非異即不如三界見於三界如斯等事法華中佛方顯了說也大王我常下第三引昔證今我昔常說斷三界煩惱果報盡名為佛豈於三界外別有眾生耶自性清淨名薩云若性者即正因佛性一切眾生佛及菩薩同共有此豈於三界外而更別有眾生可化也。",
        "translation": "The text first describes the three realms as the right principle, the desire, form, formlessness, and so forth, the store, which contains the four rebirths in the six destinies, the fruition, which is the segmental retribution, the retribution, which is the pain, pleasure, and so forth, and the twenty-two faculties, which are the six faculties of vision and so forth, pain, pleasure, joy, equanimity, and five into eleven, male and female, life, three beliefs, effort, mindfulness, concentration, and wisdom, and five into nineteen, unknown, and unknown faculties, desire, knowledge, and once-known faculties, and twenty-two faculties and twenty-one faculties that don't leave the three segmental realms, and once-known faculties that don't leave the three realms of transformation.",
        "source": "X26n0513_002:0163b10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "第三總結。",
        "translation": "The third conclusion.",
        "source": "X26n0513_002:0163c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生本業是諸佛菩薩本所脩行五忍中十四忍具足。",
        "translation": "The original activities of sentient beings are the fulfillment of 14 of the five kinds of forbearance originally cultivated by the buddhas and bodhisattvas.",
        "source": "X26n0513_002:0163c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文二初總結五忍眾生本業即煩惱諸佛菩薩未成道時亦有煩惱由煩惱故脩諸功德智慧今得成佛佛本煩惱與今眾生無異故名為本五忍中十四忍具足者二結廣略略即五忍廣即十四謂三賢是三十地及佛地成十四也上來答前問兼利他竟。",
        "translation": "The text first summarizes the five tolerances. First, it concludes that the original actions of sentient beings are the afflictions.",
        "source": "X26n0513_002:0163c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(神寶記云疏以五忍與六種性合釋及所斷惑相文義交加頗不易明應先出異相而後得以會之所以異相者據常所釋別教初地證道同圓已破無明即能分身百界作佛而此經所出十地乃分為四謂前三後一以對十地則前二猶是信順二忍後三始破無明若然則與初地證道同圓分果垂迹其異一也又所斷惑信順二忍止斷三界色心麤重煩惱此與常途有異二也於此須知教證二途約證道論固當如向同圓是也今取教道為義不妨十地殊品故所破惑義有進否是應義立無生忍位分上中下如今文是也以其根有利鈍利者于初三品即破無明其次中三始破又其次者後三方破既許初破不妨證與圓同其次未斷猶居信順亦影略互顯爾至于後三斷位方定猶下根受接其位定故是也而所破惑雖分色心麤細之異於其利者即是無明鈍即見思復何固必況復悉檀被物初無定法說有殊途毋以名相為惑有志學者所宜盡心如其不然置之可也)。",
        "translation": "(Shen Baoji Yun's commentary explains the combination of the five tolerances and the six natures, and the confusions that are ended. The reason for the difference is that according to the usual explanation of the differentiation of the teachings, the first ground of the path of realization is the same as the perfection, and ignorance has been destroyed, which means that the body can be divided into a hundred realms and become a buddha.)",
        "source": "X26n0513_002:0164a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(○此經附通故大師以通別圓三教釋五忍但於常途不同處大師亦不會通讀者不勝艱澀今記主會釋之文義周足可謂有益於學者故竝錄于此)。",
        "translation": "(○This sūtra is accompanied by a general explanation, so the great master explained the five kinds of tolerance in terms of the three teachings of Shared, Distinct, and Perfect, but where the conventional path differs, the great master also did not share it with the reader, which is not very difficult.)",
        "source": "X26n0513_002:0164a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二答後問兼自利文二先問後答今初。",
        "translation": "The second answer to the latter question was a self-benefiting text, the first being the question and the second being the answer.",
        "source": "X26n0513_002:0164a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白佛言云何菩薩本業清淨化眾生。",
        "translation": "He said to the Buddha, \"How does a bodhisattva's original act purify and transform sentient beings?",
        "source": "X26n0513_002:0164a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "標前問是故更重申十地是菩薩本業菩薩於生死菩提無染名本業清淨以淨法教化眾生不同凡夫二乘雜煩惱法化眾生也問雜煩惱化眾生有何失答自既有縛豈能化他凡夫則師既墮弟亦隨墮二乘則謗佛敗法於諸眾生而起怨心豈成利益耶。",
        "translation": "In response to the previous question, he reiterated that the ten stages are the bodhisattva's original activity, and that the bodhisattva's lack of defilement in birth-and-death and enlightenment is called the purity of original activity, which teaches and transforms sentient beings with pure dharmas that are different from the teachings of worldlings and two vehicles that are filled with various afflictions.",
        "source": "X26n0513_002:0164a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二答文先略後廣今初。",
        "translation": "Second, the answer is first brief and then extensive.",
        "source": "X26n0513_002:0164b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言從一地乃至後一地自所行處及佛行處一切知見故。",
        "translation": "The Buddha said that from the first ground up to the last ground, he would know and see everything from his own place of practice to the Buddha's place of practice.",
        "source": "X26n0513_002:0164b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三初明淨業所依謂從歡喜乃至法雲問何故但說十地答地前三賢賢而非聖不名本業清淨玅覺一地玅果已圓故於因中舉十地答自所行下簡二行一自行處即十地境二佛行處謂玅覺地境前十地但行自所行處後金剛心通行二處故下文云得理盡三昧同佛行處又纓絡云佛子菩薩爾時住大寂門乃至過十地外與佛同坐也一切知見故者三釋成清淨以佛五眼方能見一切法以佛三智方能知一切法也。",
        "translation": "The text first of the three clarifies the basis of pure activities that is from rejoicing up to the clouds of the Dharma asking why it's only described as the ten stages, answering the three stages before the stage of goodness, goodness, and not saints who aren't called pure in their original activities, profound awakening, and the one stage of profound realization, the results of which have been perfected, so in the cause of the ten stages, the answer is to briefly describe the two stages under the practice of self, which is the realm of the ten stages, and the two stages of the Buddha's practice, which is the realm of profound awakening, before the ten stages, but the practice of self and the two stages of the passage of the adamantine mind afterwards.",
        "source": "X26n0513_002:0164b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二廣答文三初標次釋後結今初。",
        "translation": "The second extensive answer text begins with three labels, followed by an explanation, and then a conclusion.",
        "source": "X26n0513_002:0164b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本業者。",
        "translation": "\"The original karma.",
        "source": "X26n0513_002:0164b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可解。",
        "translation": "It's explicable.",
        "source": "X26n0513_002:0164b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二釋(十地為十)今初善覺地。",
        "translation": "Second, he explains that the ten stages are ten, and first, he explains the stage of good awakening.",
        "source": "X26n0513_002:0164b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住百佛國中作閻浮四天王脩百法門二諦平等心化一切眾生。",
        "translation": "If a bodhisattva lives in one of the 100 buddha lands and becomes one of the four heavenly kings of Jambudvīpa, he trains in the two truths of the 100 dharmas and creates all sentient beings with an equal mind.",
        "source": "X26n0513_002:0164b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文五今初明土寬狹言住百佛國者國土有三一說法土百億日月化小乘二神通土億億日月化中乘三智慧土無量世界化菩薩今言百佛國土者說法土也作閻浮提四天王者二配位於四王中作南方增長天王以閻浮提勝於餘方有佛出此處故又次第作四天王依十地經初地菩薩作閻浮鐵輪王不言四天王纓絡云脩行一劫二劫三劫十信善者有三品上品善鐵輪王化一天下中品善粟散王下品善人中王十住銅輪王十行銀輪王十向金輪王初地已上琉璃輪王十地經初地作鐵輪王此別教意也纓絡及此經十善作鐵輪王圓教意也脩百法門者三顯法門也即自利行於十善中一一更明十善故言百法門二諦平等心者四釋地中別行也即俗即真故言平等化一切眾生者五釋地中通行也地地皆用化生為行已下九地文句類此可解。",
        "translation": "The text first five now clarifies the breadth and narrowness of the land. It's said that there are three lands that abide in the land of the 100 buddhas. There are three lands: the land of the Dharma teachings, the land of the ten billions of suns and moons that convert the lesser vehicle, the land of the supernormal powers, the land of the billions of suns and moons that convert the middle vehicle, and the land of the innumerable worlds that convert bodhisattvas.",
        "source": "X26n0513_002:0164b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二釋離達地。",
        "translation": "Second, he explains the stage of free attainment.",
        "source": "X26n0513_002:0164c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住千佛國中作忉利天王脩千法門十善道化一切眾生。",
        "translation": "If a bodhisattva lives in a thousand buddha lands and becomes the king of the Heaven of Thousand Dharmas, he trains in a thousand teachings and ten good paths to teach all sentient beings.",
        "source": "X26n0513_002:0164c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忉利天此云三十三天也地經云二地作金光王纓絡與此經同千法門者於前十善中一一各行百善也(云云)。",
        "translation": "This is the Heaven of the Thirty-three (Trāyastriṃśa) gods, but the scriptures say that the second ground is the Golden Light King's sleeve, and this scripture is the same as the Thousand Dharma Gates, where each of the previous ten good deeds is accompanied by one of the hundred good deeds (clouds).",
        "source": "X26n0513_002:0164c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三釋發光地。",
        "translation": "Third, it explains the ground of the emission of light.",
        "source": "X26n0513_002:0164c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住十萬佛國中作焰天王脩十萬法門四禪定化一切眾生。",
        "translation": "If a bodhisattva lives in one hundred thousand buddha lands as the king of the burning gods, he trains in one hundred thousand Dharma entries and four meditation concentrations to convert all sentient beings.",
        "source": "X26n0513_002:0164c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地經作忉利天王纓絡同此。",
        "translation": "The Earth Sutra makes the same sermon for the Dharma-gate of the Heaven of the Thirty-three Celestials.",
        "source": "X26n0513_002:0165a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四釋炎慧地。",
        "translation": "The fourth stage of explaining the glow of wisdom.",
        "source": "X26n0513_002:0165a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住百億佛國中作兜率天王脩百億法門行道品化一切眾生。",
        "translation": "If a bodhisattva lives in 10 billion Buddha lands as the king of Tuṣita Heaven, he trains in 10 billion Dharma teachings, practices the factors of the path, and transforms all sentient beings.",
        "source": "X26n0513_002:0165a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地經作炎摩天王纓絡同此作兜率天王道品即三十七道品也。",
        "translation": "The sutra makes the king of the Yama Heaven Ying Luo the same as this one, making the king of Tuṣita Heaven the category of the path, which is the thirty-seven categories of the path.",
        "source": "X26n0513_002:0165a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五釋難勝地。",
        "translation": "Five explanations of the ground of overcoming difficulty.",
        "source": "X26n0513_002:0165a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住千億佛國中作化樂天王脩千億法門二諦四諦八諦化一切眾生。",
        "translation": "If a bodhisattva lives in one hundred billion buddha lands as the king of the gods of transformation and bliss, he will cultivate one hundred billion Dharma entries of the two truths and four truths and eight truths to teach all sentient beings.",
        "source": "X26n0513_002:0165a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二諦者真俗也四諦者苦集滅道也八諦者有作四無作四也又苦空無常無我及常樂我淨為八也地經作兜率天王纓絡同此作化樂天王。",
        "translation": "The two truths are true and conventional, and the four truths are suffering, arising, ceasing, and the path. The eight truths are created, made, and unmade, and the eight truths are suffering, emptiness, impermanence, selflessness, and permanence, bliss, self, and purity.",
        "source": "X26n0513_002:0165a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六釋現前地。",
        "translation": "Sixth, the explanation of the stage of the present.",
        "source": "X26n0513_002:0165a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住十萬億佛國中作他化天王脩十萬億法門十二因緣智化一切眾生。",
        "translation": "If a bodhisattva lives in a hundred thousand million Buddha-lands as a king of the heaven of transformation of others, he trains in a hundred thousand million Dharma teachings and twelve kinds of cognition of causes and conditions to transform all sentient beings.",
        "source": "X26n0513_002:0165a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地經作化樂天王纓絡同此作他化天王。",
        "translation": "The sutra on the ground makes the heavenly king of transformation bliss a mantra that's the same as making the heavenly king of transformation here.",
        "source": "X26n0513_002:0165a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七釋遠行地。",
        "translation": "Seven explains the ground of traveling far.",
        "source": "X26n0513_002:0165a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住百萬億佛國中作初禪王脩百萬億法門方便智願智化一切眾生。",
        "translation": "If a bodhisattva abides in a million billion Buddha-lands as the king of the first dhyāna, he cultivates a million billion dharmas, skillful means, knowledge, and vows to transform all sentient beings.",
        "source": "X26n0513_002:0165a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地經作他化天王纓絡經云梵王常以二智化眾生也。",
        "translation": "The Earth Sutra makes the other-transformed heavenly kings Yingluo Sutra says that Brahmā always transforms sentient beings with the two kinds of wisdom.",
        "source": "X26n0513_002:0165a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八釋等觀地。",
        "translation": "Eight explanations of the ground of equal observation.",
        "source": "X26n0513_002:0165a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住百萬微塵數佛國中作二禪梵王脩百萬微塵數法門雙照方便神通智化一切眾生。",
        "translation": "If a bodhisattva lives in a million dusty buddha lands as a second meditation brahma king, he cultivates a million dusty dharmas of skillful, expedient, and supernormal cognition to teach all sentient beings.",
        "source": "X26n0513_002:0165a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地經作梵天王王一千界纓絡云梵師子纓絡光光天王雙照真俗不相違名為方便智於入觀中能發神通名神通智。",
        "translation": "The sutra on the earth makes Brahmā the king of gods, the king of a thousand realms, Yingluo Brahmā the lion, Yingluo Guangming the king of gods, both illuminating the real and the conventional without contradicting each other, which is called expedient wisdom, and the ability to give rise to supernormal powers in contemplation is called supernormal wisdom.",
        "source": "X26n0513_002:0165b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九釋善慧地。",
        "translation": "The ninth stage of explaining good wisdom.",
        "source": "X26n0513_002:0165b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住百萬億阿僧祇微塵數佛國中作三禪大梵王脩百萬億阿僧祇微塵數法門四無礙智化一切眾生。",
        "translation": "If a bodhisattva lives in a million incalculable and dusty buddha lands, he becomes the great brahma king of the three meditation heavens, cultivates a million incalculable and dusty teachings, and four unhindered cognitions to transform all sentient beings.",
        "source": "X26n0513_002:0165b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地經作梵王王二千界纓絡經作淨天王。",
        "translation": "The Earth Sutra makes him the king of Brahmā, the king of two thousand realms, and the Yingluo Sutra makes him the king of the Pure Land.",
        "source": "X26n0513_002:0165b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十釋法雲地。",
        "translation": "Ten interpretations of the ground of the Dharma-cloud.",
        "source": "X26n0513_002:0165b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩住不可說不可說佛國中作第四禪大淨天王三界主脩不可說不可說法門得理盡三昧同佛行處盡三界原教化一切眾生如佛境界。",
        "translation": "If a bodhisattva abides in the Ineffable and Ineffable Buddha Land, he becomes the fourth meditation great pure heavenly king, lord of the three realms, who trains in the Ineffable and Ineffable Dharma teachings and attains samādhi, the end of principle, and the end of the Buddha's range of practice, teaching all sentient beings in the original three realms as the Buddha's realm.",
        "source": "X26n0513_002:0165b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地經作大自在天王王三千界纓絡作大淨居天王大自在大淨居大淨天皆同也學行已滿名理盡三昧唯有一行是如來行所謂大般涅槃菩薩亦得名同佛行處無明是三界之本此惑已盡即三界原盡也。",
        "translation": "The Earth Sutra makes the Mahêśvara Heavenly King, the king of the three thousand realms, and the Lings make the Mahêśvara Heavenly King, the Mahêśvara Mahêśvara Mahêśvara Mahêśvara Mahêśvara Heavenly King, all the same.",
        "source": "X26n0513_002:0165b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三結。",
        "translation": "The third conclusion.",
        "source": "X26n0513_002:0165b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故一切菩薩本業化行淨若十方諸如來亦脩是業登薩婆若果作三界王化一切無量眾生。",
        "translation": "Therefore, all bodhisattvas' original act of transforming practice is purified, and if the tathāgatas in the ten directions also cultivate this act, they'll ascend to sarvajña as the fruit of the three realms and become the king of all sentient beings without measure.",
        "source": "X26n0513_002:0165b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文二先結菩薩業若十方下二結如來業又是答釋玅覺地也正答二問竟。",
        "translation": "The text first concludes with the second conclusion of bodhisattva actions, and the second conclusion of tathāgata actions below the ten directions is an answer to the explanation of the ground of Śubhajñāgupta, which correctly answers the two questions.",
        "source": "X26n0513_002:0165b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二月光偈讚文三一時眾供養二月光讚佛三大眾得益今初。",
        "translation": "The second verse praises the moonlight in three ways: first, the multitude of people making offerings at the time; second, the moonlight praising the Buddha; and third, the great multitude of people benefiting from it.",
        "source": "X26n0513_002:0165b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時百萬億恒河沙大眾各從座起散無量不可思議華燒無量不可思議香供養釋迦牟尼佛及無量大菩薩合掌聽波斯匿王說般若波羅蜜。",
        "translation": "At the time, a million million Ganges sands of people each got up from their seats and scattered incalculable flowers, burning incalculable incense in honor of Śākyamuni Buddha and measureless great bodhisattvas, and joined their palms to listen to King Prasenajit speaking prajñāpāramitā.",
        "source": "X26n0513_002:0165c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文二初財供養合掌下次法供養(云云)。",
        "translation": "The text is twofold. First, he makes offerings of wealth and joins his palms in making the next offering of the Dharma (clouds).",
        "source": "X26n0513_002:0165c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二月光正讚二一明讚處。",
        "translation": "Second, Moonlight Proper Praises Two: First, it explains the place of praise.",
        "source": "X26n0513_002:0165c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今於佛前以偈歎曰。",
        "translation": "Now, in front of the Buddha, he praised him with a verse.",
        "source": "X26n0513_002:0165c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈者竭也攝義竭盡故名為偈四句為偈句有三四五七等差別若梵天以三十二字為首盧偈即以八字為句也(云云)。",
        "translation": "The verse is exhausted, and the meaning of the verse is exhausted, so it's called a verse. Four phrases are verse, and there are three, four, five, seven, and other distinctions, such as if Brahmā takes thirty-two words as the first verse, that is, eight words as the first phrase.",
        "source": "X26n0513_002:0165c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正發言贊五十九行大分為三初六行總頌上義二四十五行別頌十四忍三八行總結頌五忍初又三前三行歎別相三寶次兩行歎五忍後一行歎一體三寶今初。",
        "translation": "The second correct speech praises the fifty-nine lines, which are divided into three major sections. The first six lines are a general verse on the above meaning, the second forty-five lines are a specific verse on the fourteen tolerances, and the third eight lines are a summary verse on the five tolerances.",
        "source": "X26n0513_002:0165c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊導師金剛體心行寂滅轉法輪八辨洪音為眾說時眾得道百萬億時六天人出家道成比丘眾菩薩行。",
        "translation": "When the Bhagavān's guide, the adamantine-bodied mind, practices extinction, turns the wheel of the Dharma, and makes the eightfold flood of sounds for the multitude, the multitude attains the path by a million billion times, and six celestials leave home and become bhikṣus and the multitude of bodhisattva practices.",
        "source": "X26n0513_002:0165c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文三佛法僧差別也眾生及器二世間俱尊名世尊引導匠成名導師導師不同有世間導師出世導師出世中有拙度巧度次第度一心度等金剛體歎法身也心行下兩句二歎法寶淨名云心靜已度諸禪定此中云寂滅淨名云三轉法輪於大千其輪本來常清淨此中云心行寂滅轉法輪一句包之義理不失又初句嘆佛身業次句嘆心業次句嘆口業又佛五事具足一世尊威德具足二導師智慧具足三金剛體法身具足四心行寂滅解脫具足五轉法輪化他具足(云云)捷疾應機名辯八音者梵摩喻經云一最好聲二易了聲三調和聲四柔軟聲五不悞聲六不女聲七尊重聲八深遠聲洪者大也時眾下三歎僧寶文中總前大眾天無出家法今言出家者約心說也三乘共行十地故云成比丘眾菩薩行也又人身出家成比丘眾天心出家行菩薩行也。",
        "translation": "The text distinguishes three buddhas, Dharma, and saṃgha, sentient beings, and the two worldly beings are all honored as the Bhagavān, guiding craftsmen, and accomplished as the name of the guide. The guide differs from the worldly guide, the supramundane guide, the supramundane guide, the clumsy, the ingenious, the sequential, the single-minded, and so forth, to the Jingang body, the two sentences below the heart's conduct, the two sentences below the Dharma treasure, the pure name, the quiet mind, the tranquil, and the pure name, the three turns of the Dharma wheel, the great chiliocosms, and the original, eternal purity of the wheel, the phrase, the mind's conduct, tranquil, and the turning of the Dharma wheel.",
        "source": "X26n0513_002:0165c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二別嘆五忍。",
        "translation": "Second, he praises the five kinds of forbearance.",
        "source": "X26n0513_002:0166a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五忍功德玅法門十四正士能諦了三賢十聖忍中行惟佛一人能盡源。",
        "translation": "The five tolerances are the merits of the profound dharma-gate, and the fourteen upright gentlemen who understand the practice of the three virtuous and ten noble tolerances are the only ones who can exhaust their source.",
        "source": "X26n0513_002:0166a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三賢十聖是因位名忍中行佛居果地窮原盡理名能盡源又十四皆云正士者即四十一地也十地為十住行向及等覺名為四成十四大士圓教十四聖人皆以一心三觀諦了諸法名忍中行毗盧遮那眾行休息名能盡源(云云)。",
        "translation": "The three virtuous and ten noble stages are called the practice of forbearance in the cause stage, and the Buddha's abode in the fruition stage is called the source of being able to exhaust the principle. The fourteen are all called righteous persons, which are the forty-one stages, the ten stages, the ten abodes, the practices, the dedications, and the virtual enlightenment, which are called the four accomplishments, the fourteen great persons, the fourteen sages of the perfect teaching, all of whom understand all things with the three contemplations of the one mind.",
        "source": "X26n0513_002:0166a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三歎一體三寶。",
        "translation": "The third praises the Three Treasures in One Body.",
        "source": "X26n0513_002:0166a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛眾法海三寶藏無量功德攝在中。",
        "translation": "The Buddha, the congregation, the Dharma ocean, and the treasury of the three treasures contain measureless merits.",
        "source": "X26n0513_002:0166a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛是佛寶眾是僧寶法是法寶包含如海蘊積如藏故無量功德攝在其中也。",
        "translation": "The Buddha is the buddha treasure, the congregation is the saṃgha treasure, and the Dharma is the Dharma treasure that contains like an ocean and accumulates like a storehouse; therefore, measureless merits are collected within it.",
        "source": "X26n0513_002:0166a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二別頌十四忍文五初九行頌伏忍二十行頌信忍三八行頌順忍四十行頌無生忍五八行頌寂滅忍初文二前兩行頌伏忍方便(即十信也)後七行頌伏忍功德(即三賢也)初文二先明離過次明攝位今初。",
        "translation": "The second verse is devoted to the fourteen kinds of forbearance. The first nine lines are devoted to the forbearance of submission, the second 20 to the forbearance of faith, the third eight to the forbearance of conformity, the fourth 40 to the forbearance of nonarising, and the fifth eight to the forbearance of cessation.",
        "source": "X26n0513_002:0166a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十善菩薩發大心長別三界苦輪海。",
        "translation": "The ten good bodhisattvas give rise to the great intention to rid the world of the three realms of the ocean of suffering.",
        "source": "X26n0513_002:0166b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "古人云十信菩薩由發大心求出三界雖未能出已能遠離惡道等苦故言長別今則不然若別教十信是外凡未能暫離豈能長別若圓教十信斷三界惑至十住初即斷界外無明等惑以其但斷三界四住與羅漢齊長別苦海與二乘人同生方便有餘土若羅漢支佛於彼土遇餘佛為說法華經即成菩薩進斷無明若十信菩薩縱未聞法華亦能漸次自斷無明豈以不生惡道便是長別苦海問此十信與別教中何位相似答奪而論之別教地前次第脩證十住脩從假入空觀十行脩從空入假觀十迴向脩中道正觀圓教十信即能圓脩三觀不可論同與而言之即別教十迴向齊問與前二教何位齊答奪而論之藏通二教巧拙雖異但見於空不見不空未識中道圓教十信具脩三觀與前二教不可格量與而為論圓教十信藏通佛與二乘俱斷見思即與藏通等佛地齊也所言大心者謂誓願大度生大說法大慈悲喜捨大也區分各別名界三苦八苦八萬四千名苦迴轉不息如輪沈浮出沒如海(云云)。",
        "translation": "The ancients said that the ten faithful bodhisattvas develop the great intention to escape from the three realms even though they can't escape, so they say it's long distinguished. If the ten faithful of the distinct teaching are external worldlings who can't escape for a while, how can they be long distinguished? If the ten faithful of the distinct teaching cut off the afflictions of the three realms until the beginning of the ten abodes, then they cut off the afflictions of ignorance and so forth outside the realms because they only cut off the three realms in the four abodes, they're on par with the arhats, and they're on par with the two-vehicle people in the long distinguished sea of suffering.",
        "source": "X26n0513_002:0166b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明攝位。",
        "translation": "Second, he explains the stages of taking in.",
        "source": "X26n0513_002:0166b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中下品善粟散王上品十善鐵輪王。",
        "translation": "The middle and lower classes are good, scattered kings, and the upper class is the ten good iron wheel-turning kings.",
        "source": "X26n0513_002:0166b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "脩行十善必具三心中下二心為粟散王小王眾多猶如粟散上品心行十善為鐵輪王王閻浮提其鐵輪寶廣一俱盧舍(云云)若纓絡上品鐵輪中品粟散下品人王(云云)。",
        "translation": "The cultivation of ten good qualities must be accompanied by three qualities of mind, the lower two qualities of mind being the scattered king and the lesser king, as if they were scattered, the higher qualities of mind practicing ten good qualities being the iron wheel king, whose iron wheel treasure is as vast as a kovidāra (cloud).",
        "source": "X26n0513_002:0166b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二頌伏忍上中下功德文二初兩行別歎三品為三輪王次五行總歎三品今初。",
        "translation": "The second verse praises the virtues of the higher, middle, and lower levels of forbearance.",
        "source": "X26n0513_002:0166c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "習種銅輪二天下銀輪三天性種性道種堅德轉輪王七寶金光四天下。",
        "translation": "The cultivated seeds of the bronze wheel, the two worlds, the silver wheel, the three heavens, the nature of the seeds, the principles of the path, and the resolute virtue of the wheel-turning king with his seven treasures and golden light, and the four worlds.",
        "source": "X26n0513_002:0166c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十住菩薩習種性人作銅輪王王二天下其銅輪寶廣二俱盧舍十行菩薩性種性人作銀輪王王三天下其銀輪寶廣三俱盧舍十迴向菩薩道種性人作金輪王王四天下其金輪寶廣四俱盧舍七寶者女寶珠寶輪寶主兵寶主藏臣寶象寶馬寶等也。",
        "translation": "The ten abiding bodhisattvas who have cultivated the seed nature make the copper wheel king two worlds, and their copper wheel treasure is vast, the ten practicing bodhisattvas who have cultivated the seed nature make the silver wheel king three worlds, and their silver wheel treasure is vast, the ten dedicating bodhisattvas who have cultivated the seed nature make the gold wheel king four worlds, and their gold wheel treasure is vast, the seven treasures of the Kuluxa are the women's treasure, the pearl, the wheel, the jewel, the lord of the army, the lord of the treasury, the elephant treasure, the horse treasure, and so forth.",
        "source": "X26n0513_002:0166c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二總歎三品文二初列三十心次正歎功德今初。",
        "translation": "Second, he praises the three qualities of the text in general, first listing the thirty mental states and then praising their merits in detail.",
        "source": "X26n0513_002:0166c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伏忍聖胎三十人十信十止十堅心。",
        "translation": "\"The 30 people who submit to the noble birth have 10 beliefs, 10 tranquilizers, and 10 resolute states of mind.",
        "source": "X26n0513_002:0166c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與十聖作胎故名聖胎三十人總標數十住下別列經作信字有人云信即十信止則十住堅則十行此恐與經文義理相違有人云信即十住止則十行堅則十迴向此得義違文今謂住信相似傳寫者謬應作住字讀之。",
        "translation": "Some people say faith is ten beliefs, stopping then ten abodes, resolute then ten practices, which may contradict the meaning of the scripture. Some people say faith is ten abodes, stopping then ten practices, resolute then ten dedications, which gains meaning and contradicts the text.",
        "source": "X26n0513_002:0166c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二正歎功德。",
        "translation": "Second, they praise their virtue.",
        "source": "X26n0513_002:0166c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三世諸佛於中行無不由此伏忍生一切菩薩行本源是故發心信心難若得信心必不退進入無生初地道教化眾生覺中行是名菩薩初發心。",
        "translation": "The buddhas of the three times invariably produce in their midst the root of all bodhisattva practices from this forbearance.",
        "source": "X26n0513_002:0166c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文四初歎伏忍能生諸佛以伏忍為入道之初門菩提之關鍵誰人出不由戶故三世諸佛由此而生一切菩薩下二歎伏忍能生菩薩大海有本所謂眾流眾流之本必有涓滴菩薩之行本乎伏忍伏忍成立由於信心若能發信心入圓十住即斷無明無明盤礴非一心三觀所不能斷能斷之智從十信生故佛嘆云信心難也若得信心下三明功能若得圓信心必不退轉即得入於初地之道此中經文包含兩教若約別教即從十信漸進不退登於歡喜若是圓教十信心菩薩即不退轉便登初住圓教初住即別教初地故華嚴及下經文亦以十住為十地也必不退者圓教十信必不退墮凡夫二乘及於三界問本業纓絡說十住中第六住正觀現前值佛菩薩善知識所護則出七住常不退轉七住以前名為退分如佛初會有八萬人退如淨目天子法才王子舍利弗等欲入七住值惡因緣退落凡夫不善惡中作大邪見今此經中不言退者何耶答人心如面各各不同大聖隨機故亦差別有說十行菩薩性種性人猶退墮地獄又初阿僧祇劫猶退墮者即入迴向人亦有退墮纓絡第一說十住第七名住不退七住已前即有退義約教而斷初阿僧祇退者三藏意十行退者通意十迴向退者別意十信退者圓意今云信心不退進入初住之地即圓義也教化眾生下四明利他上句明化他之行教化眾生令常覺悟必不退轉下句結歎初心也大經云發心畢竟二不別如是二心前心難般若云能生一念淨信於無量佛而種善根法華云於無量劫行五波羅蜜不如聞佛壽命生信等皆斯義也頌伏忍竟。",
        "translation": "The text first of four praises the ability of forbearance to produce the buddhas with forbearance as the first gate of entry into the path, the key to enlightenment, who does not come from the door, so the buddhas of the three times thus produce all bodhisattvas, the next two praises the ability of forbearance to produce the bodhisattvas, the ocean has its origin, the so-called many streams, the origin of many streams must have a trickle of bodhisattva practices originates from forbearance, forbearance is established by faith, if one can develop faith and enter the ten abodes of perfection, that is, to end ignorance, ignorance is majestic, not the three contemplations of one mind can not be ended, the wisdom that can be ended is produced from the ten faiths, so the Buddha praises the difficulty of faith.",
        "source": "X26n0513_002:0167a02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "第二頌信忍功德文二先頌三品後結歎初文三一四行頌初地下忍次兩行頌二地中忍後兩行頌三地上忍今初。",
        "translation": "The second verse praises the merit of forbearance of faith, starting with three verse forms and ending with a concluding verse.",
        "source": "X26n0513_002:0167b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善覺菩薩四天王雙照二諦平等道權化眾生遊百國始登一乘無相道入理般若名為住住生德行名為地初住一心足德行於第一義而不動。",
        "translation": "The four heavenly kings of the well-aware bodhisattva who both illuminate the two truths and the path of equality authoritatively transform sentient beings to travel to a hundred countries first attain the One Vehicle path without characteristics and enter the principle of prajñā that's called abiding, abiding, producing virtues and conduct that's called the ground, and the virtues and conduct of the first abiding single mind that's unmoving in the ultimate truth.",
        "source": "X26n0513_002:0167b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文二初一行半歎作王功能俗如幻有真如幻無心雖非實不無於幻於幻宛然故云雙照真俗空故故云平等始登一乘下二兩行半明入地功德以一心三智住於諦理名住能生諸德名地地即別教初歡喜地住即圓教初歡喜住也於一心中即脩三觀萬德萬行竝在其中華首經云一切功德竝在初發心中即其義也於第一義而不動者別教則十迴向菩薩脩中道正觀未證故有動至初地證得則無動圓教則十信脩一心三觀猶有動初住證得方無動也。",
        "translation": "The first line and a half of the text praise the king's ability to do what's conventional as illusion, real as illusion, and absence of mind, even though it's not real and not without illusion. The next two lines and a half clarify the merit of entering the ground because the three cognitions of the truths abide in the ground called abiding and the virtues that arise are called the ground, which is the first joyous ground of the differentiation teaching.",
        "source": "X26n0513_002:0167b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二頌信忍中品。",
        "translation": "The second verse is on the middle level of forbearance in faith.",
        "source": "X26n0513_002:0167b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離達開士忉利王現形六道千國土無緣無相第三諦無無無生無二照。",
        "translation": "He parts with the attainment of the initiator, the Tarious King, who manifests himself in a thousand lands of the six destinies, without conditions or characteristics, and the third truth of nonexistence, nonproduction, and nonduality of illumination.",
        "source": "X26n0513_002:0167b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離達者離破戒垢通達三觀別教二地圓教二住開士者開空法道也大士正士開士等竝一義也忉利明王位現形明化無緣等明智世諦無法可緣真諦無法可相無緣無相即是中道第一義諦無無者一無無緣一無無相此二俱無云何有生故云無生既真無生何得有照云何無二照照無所照不二故也。",
        "translation": "Secluded from the stain of violating the precepts, he fully comprehends the three contemplations, the two stages of the distinct teaching, the two abodes of the perfect teaching, and the enlightened one who opens the path to emptiness and dharmas, the great man, the right man, and the enlightened one who shares the same meaning, the position of the King of the Thirty-three, the manifestation, the transformation, the lack of conditions, and so forth. Wisely, the worldly truth is unconditionable, the true truth is unconditionable, and the lack of conditions and the lack of marks is the middle way's first truth.",
        "source": "X26n0513_002:0167c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三頌信忍上品。",
        "translation": "The third verse is \"Faith and Tolerance, Superior Chapter.",
        "source": "X26n0513_002:0167c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明慧空照燄天王應形萬國導羣生忍心無二三諦中出有入無變化生。",
        "translation": "Wisdom, emptiness, illumination, and the knowledge that the heavenly king responds to the forms of myriad countries and guides sentient beings to endure without duality in the three truths, emerging from, entering, and transforming into birth.",
        "source": "X26n0513_002:0167c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別則三地達人法二空得忍成就名空照圓則三住即空即假即中名空照也應形下明化也忍心下明智三諦即一諦三心即一心故云無二即有即空故云出有入無即空即有故云變化生也。",
        "translation": "Distinctly, the three stages are attained by realizing the emptiness of both humans and dharmas, and the accomplishment of forbearance is called emptiness illumination.",
        "source": "X26n0513_002:0167c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二總結信忍。",
        "translation": "Second, he summarizes faith and tolerance.",
        "source": "X26n0513_002:0167c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善覺離明三道人能滅三界色煩惱還觀三界身口色法性第一無遺照。",
        "translation": "Well-aware, free of the three paths of wisdom, he can cease the afflictions of form in the three realms and also observe the body, speech, form, and Dharma nature of the three realms as the first, without remainder, to be illuminated.",
        "source": "X26n0513_002:0167c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能滅三界色煩惱即色是空還觀三界身口色即空是色法性第一無遺照無非中道也有本作唯照非經意也。",
        "translation": "He can cease the affliction of form in the three realms, which is form and emptiness, and then contemplate the body and mouth of the three realms, which is form and emptiness, as the first unsurpassed illumination of the Dharma nature, which is nothing other than the middle way.",
        "source": "X26n0513_002:0167c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三頌順忍文二前六行正頌後兩行總結初文三初兩行頌下品次兩行頌中品後兩行頌上品今初。",
        "translation": "The third verse follows the text of forbearance in two ways: the first six lines are the main verse, the second two lines summarize the initial text, and the first two lines praise the lower level, the second two lines praise the middle level, and the last two lines praise the higher level.",
        "source": "X26n0513_002:0167c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燄慧玅光大精進兜率天王遊億國實智緣寂方便道達無生照空有了。",
        "translation": "\"Yama, wisdom, and insight are the great effort of Tuṣita, the king of gods who travels to hundreds of millions of countries, has true knowledge, conditions, quiescence, and the skillful path, and comprehends nonarising and illuminates emptiness and existence.",
        "source": "X26n0513_002:0168a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燄慧玅光等者即別教四地菩薩得精進波羅蜜成就圓教即四住菩薩於三觀精進緣寂即實智照空有即權智也。",
        "translation": "This is the fourth-stage bodhisattva of the secular teaching who attains the perfection of effort, which is the fourth-stage bodhisattva's effort in the three contemplations, and this is the true wisdom of extinction and the expedient wisdom of illuminating emptiness and existence.",
        "source": "X26n0513_002:0168a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次頌中品。",
        "translation": "The next verse is on the middle level.",
        "source": "X26n0513_002:0168a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勝慧三諦自達明化樂天王百億國空空諦觀無二相變化六道入無間。",
        "translation": "\"The three truths of superior wisdom are self-acquired, and it's clear that the ten billion kingdoms of the gods of pleasure and transformation are empty, and the truth of emptiness observes that there are no two characteristics and that the six destinies of change enter into nonretrogression.",
        "source": "X26n0513_002:0168a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別教五地菩薩入深禪定得於勝慧圓教五住菩薩也空空諦觀無二即動是寂變化六道即寂是動也。",
        "translation": "It's the fifth-stage bodhisattva of the distinct teaching who enters deep meditation and attains superior wisdom, and the fifth-stage bodhisattva of the perfect teaching who observes the nonduality of emptiness as quiescence and the six destinies as quiescence and movement.",
        "source": "X26n0513_002:0168a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三頌上品。",
        "translation": "The three verses are of the highest order.",
        "source": "X26n0513_002:0168a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法現開士自在王無二無照達理空三諦現前大智光照千億土教一切。",
        "translation": "\"The Dharma-presentation revealer is the sovereign king who has no duality or illumination and reaches the principle of emptiness. The three truths are present, and the great wisdom illuminates a thousand billion lands and teaches them all.",
        "source": "X26n0513_002:0168a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別教六地菩薩得般若圓滿故云法現等圓教六住中無二無照等即寂也智光普照即動也。",
        "translation": "Since the bodhisattvas in the sixth ground of the specific teaching have attained the completion of prajñā, it's called the manifestation of dharmas and so forth. In the six abodes of the perfect teaching, there's no duality, no illumination, and so forth, which is quiescent, and the universal illumination of wisdom, which is dynamic.",
        "source": "X26n0513_002:0168a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二總結。",
        "translation": "The second summary.",
        "source": "X26n0513_002:0168a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "焰勝法現無相定能灑三界迷心惑空慧寂然無緣觀還觀心空無量報。",
        "translation": "Flaming excellence is the concentration of the Dharma-presentation without marks that sprinkles the three realms, misconstrues mind, confuses emptiness, and wisdom, tranquility, no conditions, and observes the emptiness of mind without measure of reward.",
        "source": "X26n0513_002:0168a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "燄即前四地勝即五地法現即六地此三菩薩得中道觀不起有無二相以正觀水洗無明垢也空慧等者即色心俱空也還觀等者即色心俱假也。",
        "translation": "Flame is the first four stages, and victory is the fifth stage, dharma-presentation is the sixth stage. These three bodhisattvas attain the middle way of observing that the two characteristics of existence and nonexistence don't arise, and they wash away the stain of ignorance with the water of right observation.",
        "source": "X26n0513_002:0168a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四頌無生忍文三前五行頌七地下忍次三行頌八地中忍後兩行頌九地上忍初文二初釋行相二斷惑分齊今初。",
        "translation": "The fourth verse on the tolerance of nonarising has three prose lines, the first five verse lines on the tolerance of the seven lower levels, the next three verse lines on the tolerance of the eight middle levels, and the last two verse lines on the tolerance of the nine upper levels.",
        "source": "X26n0513_002:0168a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠達無生初禪王常萬億土教眾生未度報身一生在進入等觀法流地始入無緣金剛忍三界報形永不受觀第三義無二照二十一生空寂行。",
        "translation": "Distantly attaining the first state of nonproductivity, the first meditation king's eternal trillionth land teaches sentient beings who haven't yet crossed over to the reward body to live forever in the ground of equanimous contemplation of the Dharma flow and then enter the third state of unconditional vajra forbearance, where the reward form of the three realms is never experienced, and the third state of nonduality illuminates the practice of emptiness and quiescence in twenty-one lifetimes.",
        "source": "X26n0513_002:0168b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遠達無生大品云七地深入無生深入遠達義相似也不同六地證有間斷至法之源故云深入深入即遠行地鄰近第八地故復云遠行遠行地即遠達也常萬億等者明化用略舉大數故云萬億未度下明損生未度報身者分段身是也盡此一身即入變易故智論云七地菩薩未捨肉身又二十一生中未度末後一生也雙觀二諦故云等觀又色心二法無差別相故云等觀別教七地猶有功用進入八地無功用心中道法流至薩婆若海此別接通意也始入無緣金剛忍則不受三界分段身此乃預說八地已上功德以其必能致此勝神不久的得故先說也亦猶教聲聞人先歎當果矣中道第一義諦對真俗即是第三一中一切中故云無二照從初地至七地各有下中上三品三七即二十一生生之中皆觀諸法空寂以此為行也。",
        "translation": "The profound meaning of \"far-reaching, unborn, and far-reaching\" is similar to that of the sixth ground, because it's different from the realization that there's an interruption up to the origin of the Dharma, so it's called \"profound,\" which is the ground of far-reaching, and it's near the eighth ground, so it's also called \"far-reaching,\" which is the ground of far-reaching.",
        "source": "X26n0513_002:0168b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明斷惑分齊。",
        "translation": "Second, it clarifies the delimitation elimination aspect of the equation.",
        "source": "X26n0513_002:0168b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三界愛習順道定遠達正士獨諦了。",
        "translation": "The three realms, where accumulation of craving follows the path, are distantly comprehended by the correct person alone.",
        "source": "X26n0513_002:0168b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六地菩薩斷現行此斷習氣如十地經云此遠行地不名有煩惱者一切煩惱不行故貪求如來智者未滿足故不名有煩惱此經亦爾愛佛智者習未斷故故名順道定諦謂審實以前六地但斷煩惱未斷無明習氣今第七地煩惱麤重早已斷盡故能諦了未斷無明習也愛謂癡愛由癡愛故受生死身故淨名云從癡有愛則我病生今七地中永已斷故。",
        "translation": "The sixth-stage bodhisattva stops this present habituated tendency of stopping as the ten stages sūtra says, \"This distant practice stage isn't called having afflictions because all afflictions don't work and therefore craving for the Tathāgata's wisdom hasn't been fulfilled.\" This sūtra is also true for those who love the Buddha's wisdom because the habituated tendency of loving the Buddha's wisdom hasn't been stopped, so it's called following the path and concentrating.",
        "source": "X26n0513_002:0168b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二頌無生中品忍。",
        "translation": "The second verse is about the acceptance of the middle level of nonarising.",
        "source": "X26n0513_002:0168c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "等觀菩薩二禪王變生法身無量光入百恒土化一切圓照三世恒劫事反照樂虗無盡源於第三諦常寂然。",
        "translation": "This verse describes the bodhisattva's second meditation king transforming the birth of the Dharma body with measureless light into a hundred eternal lands, transforming them all, completely illuminating the events of the three worlds and eons, and reflecting back on the endless source of pleasure, which is always quiescent in the third truth.",
        "source": "X26n0513_002:0168c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即八地菩薩也此句標名舉位變生法身者七地分段報身已捨變彼分段得變易法身故云變生證法性理以成此身故云法身入百恒土下明勝用道前為過去道中為現在道後為未來返照者照過去七地已前事樂虗者緣現在事無盡源者照未來事七地雖得無二之照以其初證不明寂然今至八地心更淳熟故常寂然也。",
        "translation": "This is the eighth-stage bodhisattva, and this phrase is labeled \"raising the level.\" The person who has abandoned the segmented body of retribution at the seventh stage and transformed those segments to attain the transformed Dharma body is therefore called \"transformed\" and \"realizes the principle of Dharma nature in order to realize this body.\" The Dharma body enters the land of 100 constellations, and the following explains the superior function of the path before as the past, the path in the present, the path after as the future.",
        "source": "X26n0513_002:0168c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三頌無生上品忍。",
        "translation": "Three verse phrases describe the higher level of forbearance in nonarising.",
        "source": "X26n0513_002:0168c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧光開士三禪王能於千恒一時現常在無為空寂行恒沙佛藏一念了。",
        "translation": "Huiguang Kaishi, the king of the three meditation heavens, can manifest a thousand eternal moments of eternal, uncontaminated emptiness and quiescence in the practice of the eternal Buddha treasure with a single thought.",
        "source": "X26n0513_002:0168c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即九地善慧菩薩也常在無為等者即動寂齊行也。",
        "translation": "That's the bodhisattva of ninth-stage good wisdom who's always in nonproductivity and so forth, which is the combined practice of movement and quiescence.",
        "source": "X26n0513_002:0168c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五頌寂滅忍文二前五行頌下品後一行頌上品今初。",
        "translation": "The fifth verse on the tolerance of quiescence has two texts, the first five lines praising the lower level and the second line praising the higher level.",
        "source": "X26n0513_002:0168c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "灌頂菩薩四禪王於億恒土化羣生始入金剛一切了二十九生永已度寂滅忍中下忍觀一轉玅覺常湛然等慧灌頂三品士除前餘習無明緣無明習相故煩惱二諦理窮一切盡。",
        "translation": "The bodhisattva who consecrates the four meditation kings and transforms sentient beings in billions of eternal lands first enters the adamantine all-understood twenty-nine lifetimes and has permanently crossed the patience of cessation, the middle and lower levels of patience, the contemplation of the single turning of the profound awakening, the constant, sublime, and so forth, and the three levels of wisdom that consecrates the bodhisattva removes the remaining prior habituated nescience, the condition of nescience, and the characteristic of habituated afflictions and the two truths are exhausted.",
        "source": "X26n0513_002:0169a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言灌頂者在十二法師之上故名頂華嚴二十七云譬如輪王太子成就王相取四大海水灌于頂上即名灌頂大王菩薩亦如是受佛職時諸佛以智水灌是菩薩頂名灌頂法王是名菩薩入智慧職地即法雲地菩薩也為第四禪天王有本云五禪王者即取欲界及四禪也始入金剛等者以此定破無明一切皆了也從初歡喜終竟法雲有三十生今但言二十九生者以第三十生是其現受之身於前二十九生已過故云永已度也下忍觀者結因分齊一轉玅覺者結果分齊雖即未得轉心即得也等即等觀八地菩薩慧即慧光九地菩薩灌頂即十地菩薩此三品大士共除餘習無明之緣無明習相是舊煩惱名之為故即四住客塵是新煩惱也二諦即真俗理窮即中道得此三觀諦現行習氣皆盡也。",
        "translation": "It's called the summit because it's above the twelve Dharma masters. Huayan 27 says, \"Suppose the wheel-turning prince accomplishes the king's characteristics by taking four large bodies of water and pouring them on the summit, which is called the great king who consecrates.\" Bodhisattvas also thus accept the Buddha's position when the buddhas pour water of wisdom on the bodhisattva's summit, which is called the king of the Dharma who consecrates.",
        "source": "X26n0513_002:0169a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二頌玅覺地(即寂滅上忍也)。",
        "translation": "The second verse is on the ground of perfect enlightenment (which is the state of supreme forbearance of cessation).",
        "source": "X26n0513_002:0169a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓智無相三界王三十生盡等大覺大寂無為金剛藏一切報盡無極悲第一義諦常安穩窮源盡性玅智存。",
        "translation": "Perfect wisdom, signlessness, the king of the three realms, the end of the thirty births, and equality of great awareness, great quiescence, the adamantine store of all retribution, and the supreme compassionate truth of eternal stability, the exhaustion of sources, and the survival of innate wisdom.",
        "source": "X26n0513_002:0169a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得一切種智圓滿盡無明之相故云圓智無相得此無相方為三界之主法華亦云今此三界皆是我有喻云是時宅主在門外立等也十地菩薩受第三十生未名為盡今玅覺菩薩不受此生故名盡也前三十生未盡不名大覺佛地生盡故名大覺得涅槃名大寂無餘無為四魔不能破壞如金剛藏前三十生竝有因盡果生今大果圓滿更不復生故云報盡盡未來際拔眾生苦故悲無窮極也第一義諦即涅槃故常安穩即常樂我淨窮無明之原盡煩惱之性不同外道斷見聲聞證空雖無得無成而玅智常照上來頌五忍竟長行偈頌互明五忍而十地玅覺出沒不同是乃大聖隨機轉文顯義者也。",
        "translation": "Attaining the full completion of all kinds of wisdom ends the phase of ignorance, so it's called perfect wisdom without marks. Attaining this marklessness, the Dharma Flower also says that now these three realms are all mine, and there's a metaphor that says the lord of the house is standing outside the gate, etc. The tenth bodhisattva's taking on the thirtieth birth is not yet called exhausted.",
        "source": "X26n0513_002:0169a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三八行總結歎五忍文三一歎淨土果次歎法身果後歎利益果今初。",
        "translation": "The third eight-line summary praises the five kinds of forbearance in three ways: first, praising the fruit of the pure land; second, praising the fruit of the Dharma body; and finally, praising the fruit of benefits.",
        "source": "X26n0513_002:0169b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三賢十聖住果報唯佛一人居淨土一切眾生暫住報登金剛原居淨土。",
        "translation": "The three virtuous ten sages abide in the fruit of the Pure Land, only the Buddha alone abides in the Pure Land, and all sentient beings temporarily abide in the fruit of ascending to the Vajradhara abode in the Pure Land.",
        "source": "X26n0513_002:0169b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "將明其勝先且舉劣三賢即地前三十心十聖即十地菩薩此四十心同生華藏果報之土非藏通教中果報若藏教唯是凡聖同居若論通教唯生有餘化城之土今言果報即是別圓教人得無障礙生無障礙土問此中三賢十聖為是別教為是圓教答正是圓教問圓教即合生常寂光何故生華藏答華藏之中別圓共生以是因非果不得生於寂光之土故華藏土中有別教十地圓教四十心共生也玅覺極果毗盧遮那唯獨一人生於寂光淨土問前三二中亦有淨土何故寂光獨名淨土答凡聖同居聖少凡多是穢非淨方便有餘但除見思未斷無明偏真之淨非是真淨華藏世界帶別方便未為純淨寂光無此故受淨土之名也一切眾生暫住報者有云眾生雖即無始而有終暫時受報佛無始終故居淨土今謂佛登玅覺應在寂光為化眾生暫時應現壽命長短而受果報故云也。",
        "translation": "It will explain its superiority first, and then cite the inferior three good men that is, the first 30 states of mind, ten sages that is, ten bodhisattvas, these forty states of mind are born together in the land of the fruit of Huazang, not in the fruit of the Shared Teaching, if the Shared Teaching is only for mortals and sages living together, if the Shared Teaching is only for those born in the land of the transformation city with remainder.",
        "source": "X26n0513_002:0169b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二嘆法身果。",
        "translation": "Second, he praises the realization of the Dharma body.",
        "source": "X26n0513_002:0169c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來三業德無極我今月光禮三寶。",
        "translation": "The Tathāgata's three activities are limitless in their virtue, and now I'm paying homage to the Three Treasures in the moonlight.",
        "source": "X26n0513_002:0169c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨土即是依報今明法身即是正報上句正歎下句頂禮一體三寶。",
        "translation": "The pure land is the dependent reward, and now I'll explain that the Dharma body is the direct reward. The first phrase correctly praises the second phrase, \"I bow to the Three Treasures in their single essence.",
        "source": "X26n0513_002:0169c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三歎化他界(即前標中利益果是也)。",
        "translation": "The third salutation is to the realm of transforming others (which is the result of the benefits in the previous title).",
        "source": "X26n0513_002:0169c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法王無上人中樹覆葢大眾無量光口常說法非無義心智寂滅無緣照人中師子為眾說大眾歡喜散金華百億萬土六大動含生之生受玅報天尊快說十四王是故我今略歎佛。",
        "translation": "The Dharma king is the unsurpassed tree among men that covers a great multitude of people with measureless light, whose mouth always speaks the Dharma that's not meaningless, whose mind is knowledgeable, tranquil, and unconditioned, and who illuminates the lion among men as he teaches the multitude, scatters golden flowers joyfully, scatters ten billion million lands, and six great causes of birth that contain beings to receive the noble rewards of the gods, the honored ones, and quickly explains the fourteen kings.",
        "source": "X26n0513_002:0169c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文中初一行舉喻歎即是形益次一行法說歎佛口業是聲益外道全無義二乘偏等菩薩未圓唯佛有文義也心智即觀寂滅即緣觀緣寂名無緣照又外色無可緣內心無可照次一行明大眾供養次一行明地動次一行結歎佛在人為人尊在天為天尊又大經云人王即天王也十四王即三賢十聖等也廣說恐時眾受難故略歎也又佛德無量不可歎盡故略歎也。",
        "translation": "The first line of the text presents a metaphor and praises the physical benefits, the second line explains the Dharma and praises the Buddha's verbal activity as a benefit of sound.",
        "source": "X26n0513_002:0170a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說仁王護國般若波羅蜜經疏卷中",
        "translation": "Foshuo Renwang huguo banruo boluomi jing shou zhong",
        "source": "X26n0513_002:0170a10_0",
        "is_bad_quality": false
    }
]