[
    {
        "source_sentence": "妙經文句私志記卷第八",
        "translation": "Miaojing wenju shizhiji vol. 8",
        "source": "X29n0596_008:0326a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "石皷沙門釋　智雲　撰",
        "translation": "Shiqiu shaman Shi Zhiyun Compose",
        "source": "X29n0596_008:0326a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "通序竟下別序疏釋此文大略有二初重舉示章門文為五下次正科釋初言別序者前文已釋而諸先達於此文更廣論雖復廣論至於宗要未可領會故知徒煩無益今亦不能更述直附上下文意聊申其意於中為三初通明五義次明其所以後結以顯今初中所言別者對通之名謂通序通證信諸教別序別在發起當部故也又通序通證一部別序別發起部內之別義又通序名通而體別別序事別而義通且從一邊故云爾也又通序通證一部妙法故別序別發起部中四妙故從此別以為言故云別序又通序通證信二門別序別發起迹門以本門無證信別有發起故初三通約一切經釋次後二番別約此經釋所以爾者義勢應爾故欲簡通顯別故所以別有二番義者正由前科此經有單複之三故初重即單別次重即複別今此言別義雖含五既從要兩三段消文正當後之二義然至第四一對起時前三寶物悉皆歸之無更異體是則一切莫非妙物從此義故名為別也若不如此釋者與前兩科文不相應故不能顯此要妙旨故還同尋常所釋不足顯佛意故此是此經之要義古今諸釋而竟不論一宗雖明而彼所釋乃未融顯故今雖略知爾亦未能全暢且略以為可思之地後學宜善詳而盡之嘉祥云此下第二明開發序亦有六章謂集眾說經入定現瑞疑問答問序六也并前證信之六合十二序由眾集故說經說經故入定入定故現瑞不了瑞故疑問疑問故有答由此六事開發正宗故名開發序今謂談於三義將有勝於光宅至於開合隱沒則甚不如宜委詳而辨之所未暇矣(云云)。",
        "translation": "The first is the explanation of the general sequence, the second is the explanation of the specific sequence. The first is the explanation of the specific sequence because the previous text has already been explained and the prior scholars have given a more extensive explanation of this text, although the extensive explanation is that the essentials of the doctrine cannot be comprehended, so it's useless to know what's the point.",
        "source": "X29n0596_008:0326a19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次下正科釋者於中有三初科文次通釋意後別解釋科文有二初標數次列為名五者前通序有五事今此序亦有五事故也列名可知。",
        "translation": "Next, there are three sections in the correct explanation. First, there are three sections that explain the text, then explain the meaning in detail, and then explain the text in detail. First, there are two sections that label the number and then list the names of the five.",
        "source": "X29n0596_008:0326b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下通釋五之意也於中先述後正釋初中述異辨成異義即有二別初中有標其二述其二之相狀標逆順生起者能生為生所生為起即緣由及次第也由前生後為順由後生前為逆次正述中初是順也次是逆也雖此二物文義無二物若由後後起於前前乃可有別思之下是辨其未了但成異解文有三意先判與奪次總全奪三正釋初且與者翻即逆緣起覆即順緣起又舉喻顯之如鉤鏁等次明其未了此意明明釋此文須具二義初當分次表報表報是正要以是發起正說故也若直述其當分緣由不明表報正意在何名為別發起之序故為未了直是以下是用經正意而全奪之則其當分緣起亦未為了故是全奪之也(云云)何者此一五表於二四須先明五因由次束以明表報之意而今雖有生起之由而無表正之意於因緣四中一尚未了況更餘三以都不言其意故致此失此直論因緣四中一義不成況更能具其四故三四下更著緣字若以二三四為餘三釋者最下緣字況難消會如此所釋則別發起序義都無故結云了無趣向故全不可應知此五之言含於三義謂五發起序五是別為四故發起是功能故序是對正說故對通顯別故五為對證信故云發起為對正說故名為序彼雖逆順生起都無此三之一故不可今只一言即具此三思之。",
        "translation": "The next is to explain the meaning of the five in a general way. In this first explanation and then the correct explanation, the middle way is to explain the difference and discern the different meanings, that is, there are two distinctions. The middle way is to label the two, to describe the characteristics of the two, to label the adversely-advanced as arising, the arising as rising, that is, the conditioned cause and the sequence.",
        "source": "X29n0596_008:0326c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下是正釋具約四緣初因緣中此四即四悉之異名為對光宅無意故直從正意以言也所言一者同也發起正說開會四異皆令歸同故言一也亦名實也亦名妙也但言四者約經通論有三略則四中則十具則一切然就經文多說於四即從要略故也今順文要故云爾矣四中一一皆有能所上三字能也下二字所也能中皆有體用用即敘之一字為能用也眾是所會之異人也是由異故致一人也瑞表理一要而言之現瑞正表開權顯實實即顯本有之理故經為令開佛知見等即理一也疑念即行異由此而致一故問答顯當說妙由此得說妙教故敘教一總言敘者因緣發起義也人即世界以人是世間果報眾多和合之名大論云世界故有人即其義也理是勝義易知行是為人令其進善故若准餘文多以行為對治各隨義便故教即是治疑除正由於此故也此表異四當成一四故也言此因緣者應四妙機感而作令得四種妙之利益故也此從大略通論一一皆具四意亦如玄文一一悉皆具四也應知五即四四即因緣也然因緣是能四一即是所起也此既表一則能所皆妙而更約教者對異以簡顯也且約相待以說故云非圓正即四一也約本迹者若約當時即從密意若約說滅後即從顯說以相即故也即本而迹即迹而本故也如前科文謂雖言從近消文而言皆具四釋文別義通今從義通意也以三世正要不過四一故也次約觀者記云一心三諦理一也一心三觀行一也作是觀者人一也能詮觀境教一也更有多釋不能具述今謂亦可但能修一圓妙觀行即自具於四一何者了諸心法皆一實相所了之境異而無異即理一也能了之心無異即行一也能了之者即人一也能作此觀正會始教之旨即教一也又能體一切果報之心皆同實相故即理一能達一切諸行之心皆同一實相行即行一了一切執宰主之心同一切音聲語言之心皆同一妙語為一段者即人一了言之心即教一前通此別前三發起正說之要此一起證妙道之要宜善思之未備悉。",
        "translation": "The following is the correct explanation of the four conditions that are specified in the first cause and condition. The four that are specified in the first cause and condition are all different names that oppose the intention of Guangzhai, so it's directly from the correct intention that they're said to be one. The one that's mentioned is the same, the initiation, the correct explanation, and the opening assembly of the four differences all lead to the same thing, so it's called one, and it's also called real, and it's also called marvelous.",
        "source": "X29n0596_008:0327a01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "就眾以下是第三別釋五序文也兩文並言眾集又並各有威儀如何取別或言對此前應言集眾今謂不然前為滅後證信略說此正論現在發起廣說又前別能結此經此通無量義也思之。",
        "translation": "Regarding the many, the following is the third explanation of the five preambles, which both say that the many are gathered and that each has its own manner.",
        "source": "X29n0596_008:0327b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若準無量義經於列眾末經云各與眷屬百千萬數而自圍繞來詣佛所頭面禮足遶百千迊燒香散華種種供養供養已退一面坐彼文乃廣初至佛所即是諸眾集也頭面已下即屬威儀而此經兩文並不言集直言威儀論亦直從此以立名名為威儀如法住今疏並言集者從義正應爾也正由集已有此威儀既舉威儀知已集也故經論但明威儀今仍加之以集然眾有二一常隨二因召集而此兩經並直列不明集因集因有二謂顯與密密即感應法爾神通大權接引力如次當明據理應有顯召力即如大經今文略無廣本當有亦如光明新舊可別初經文有四謂時主眾儀文當有但解下兩不釋上二。",
        "translation": "If we refer to the sutra on the meaning of immeasurable, then at the end of the sutra, it says that each person and their retinue are surrounded by a hundred million people who come to the Buddha, bow their heads to his feet, circumambulate a hundred thousand Lecha and burn incense, scatter flowers, make various offerings, and retire to sit on one side after making offerings.",
        "source": "X29n0596_008:0327b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云爾時者下文釋云謂當爾之時也此當無量義經別序之初眾既集已而行威儀供養正當此之時也又丹丘觀音廣釋中云爾說即也謂即眾集已儀供之時更非異時故云即也世尊即發起之主也即十號中第十號薄伽梵六義之中第六尊貴義也應具二義世間最尊故云世尊經云我為世尊無能及者也又舉世凡聖莫不尊奉故名世尊即經下文云一切眾生類無不宗奉者也佛地論云具一切德常能利樂一切有情故名尊貴疏文先引論標名論明此品七成就中第二明眾成就於中有四一數二行三攝功德四威儀如法住成就即是此文故云爾也論於此文中又開為四故論云此中四種示現一眾圍繞二前後三供養恭敬四尊重讚歎並如經所說可知論直如此無更別釋論雖此四義只是二故今束要為論二之科目正當初文攝名歸實故以論通名入初別也雖通是威儀奢而不切故今為此二義為要矣言威儀者威儀容止合度為儀能令他敬畏為威各當來集佛所之軌則故云如法住。",
        "translation": "The cloud er time is explained below as the time when this should be the infinite meaning of the sutra's special preface to the beginning of the congregation has gathered and performed the worship and offerings is exactly the time when this is also Danqiu Avalokitêśvara explained in detail as the time when er is said to be the time when the congregation has gathered and performed the offerings and not another time so the cloud is also the time when the Bhagavān, the tenth of the ten, is the sixth most honored among the six meanings and should have two meanings the world's most honored so it's called the Bhagavān.",
        "source": "X29n0596_008:0327c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋四眾正是所集所被之人眾數亦是威儀之人也於中初述舊解次明未審然後正釋初之四名經中常說故以為也有云由名局故則意不周謂無發起等名必不周其意義此未可會今謂名局者謂比丘等四名只在聲聞不通菩薩雜眾故也意不周者此之四眾之言意在兼該一切若前列三眾此言其四直依此名初一且未稱其實況餘之二故都不可又總立數意兼一切若直此以為四眾得其實不得其權故云意不周縱依餘之四名於文雖通於義亦未周矣祥述他云天有二眾有魔梵舉色欲二天之大者也人有二眾謂沙門婆羅門智論云智慧人開為二分在家曰婆羅門出家為沙門佛是天人師故舉此四眾也今就此經有二種四眾一者聖有二眾謂聲聞菩薩凡有二眾即容客二為四眾也就後文列者即出處各二是也復有云聲聞菩薩二聖眾龍神人主二凡眾雖有如是種種四名要自收義不遍諸經尚未況在於此故於種種四名必須今之四名方盡其義次下正釋於中有五初標數次列名三正解釋四結例五舉往類顯成今義初標不直言今謂四者固有深意蓋欲以一而貫諸眾故此言也亦明意含二四故也非直於此前諸橫竪皆爾故是以一貫諸義次列通有附傍此文謂影響為嚴會指歸(云云)總四義不出於二謂二權兩實也以相待故闕則不可又化主既有權實輔化之眾不得然此是法王治化之安綱此經之極致故於此中明之古今強異於此者良以未曉其深要故也然應知其二意若隨經文如前所述種種諸四若求要義必須此四諸釋唯求其文不論要義此非達其深要況今所釋文義曉然而謂無文註已其矣釋中初釋發起有三謂法譬結釋法中自有三義初二句此眾之體次一句是其義三一句正是功能亦是意也初權謀智鑒總歎美其內體知機知時別明其照外之能權是權能謀是謀度智是其主鑒是深察謂善能謀度計慮始終智用明察事之可不此是總明內體下句別明二能謂善知機知時此眾內具此德故能發發起雖是其德正是言其體也下明義者此是總明內體下別約外以顯其能如何智鑒謂知機知時機謂宿種可發者也時謂可發之時節也然權謀無別物只是智鑒權鑒無別物只是善知機時知機可發在於此時知於此時應發之也此眾如是故能發起雖是其德正明其體以發起是其用故也。",
        "translation": "In the next explanation, the four groups of people are precisely those who are gathered, made known, and are also the people of authoritative power. In this first explanation, the old explanation is followed by an explanation that hasn't yet been examined, but then the correct explanation is that the first four names are often explained in the sutras as such. There's a saying that because of the name bureau, the intention is not circumscribed, meaning that the absence of such names as arousal must not circumscribe the meaning, which can't be understood. Now, this saying that the name bureau means that the four names of monks and so forth are only for the śrāvakas and not for the bodhisattvas or for the mixed multitude of people.",
        "source": "X29n0596_008:0327c22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次名義者記云發機令起故云發起初文釋發成辦以下釋起亦可前四字正釋次四字功能為多重釋已又云扣佛大悲故名擊諮啟聖旨故名揚令聞所未聞故名發動使聞者果遂故言成辦遂必獲悟故云利益今謂此是釋其名義內具如上德體外能如此擊動故名發起言有通別通即通是二字之義發即起也別則擊揚釋發發動釋起發即開發於序起即起於正說能所合言故言發起又擊即發也揚謂舉也擊之令發揚之使動即起也發序正下四字是功能亦是意意在於此利益成當機結緣二也應知發起大要謂發起眾發起佛眾即令集令修供養佛發令現瑞正說等發眾令集修供養即是發起佛也思之譬中具譬法中三也大象正喻前眾體德躃樹喻前名義使象子下喻功能利益大象有大體力喻前有內具大體用躃樹使高從下喻發起極果大悲赴於因也使子得飽喻前利益意也所謂以下皆以為合譬今觀文之與義都非合也何者發起義兼能所問雖釋能未言其所不知發起何物故此釋而出之以此故是釋下是合也正謂發起此五法故也此五是序故今前言擊發於序也若發五序即起四一故今前云起於正說也前言二字義含通別今從通說故皆言發起也又五即是四發即屬五起即屬四將一言以顯二義故通而即別矣結云皆者四文並結此一此獨言皆者以此有能所二義餘文不然故此獨言之矣此義恐無從矣然此一文要有其二一釋成前發起之義二釋眾集之因釋前之義已略如向集之因者諸釋並不言者良以不疑故也今積疑之而不能已聊誡言之且以自遣也何者此經眾集都有七處此中多寶分身龍女下方妙音普賢多寶以本誓願故來分身由召而集龍女由文經命證及赴二土緣感故致下方赴師命以顯本故出妙音為赴召流通而來普賢亦以本願而至則皆有由然矣而此一集居二經之首各但言其集儀並不語其因致者何耶今正為彰此義故舉此五事矣正由大權發起故也雖有機感要似旁發適謂知機知時等也都由此初一而後四因之而起文雖有五要唯感應初一感也次一應餘三共成感應也感中當機結緣即實也正也旁發起影響即權也正助也正以此故立此四名及此次第若得此意無所不可古今諸釋不得此意封文守採傷矣此意豈非甚要者耶若以為合前譬者全失此之二要思之思之。",
        "translation": "The first text explains the initiation of the following explanation of the initiation of the accomplishment of the holy intention, so it's called the initiation of the unheard, so it's called the initiation of the consequence of making the hearers realize the result, so it's called the accomplishment of the accomplishment of the consequence of making the hearers realize the result, so it's called the benefit.",
        "source": "X29n0596_008:0328b15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋當機此正發起之所為故次明之機者主發之要也故易云樞機一發榮辱之主也謂此一眾正當此教之所發故故云當機若纔聞教即便發悟與教會更不異時故即復有當機然次雖用義釋當彰名正從平呼有謬謂當之一字有其二音不可文亦有法譬合今謂初二釋機下釋當也言宿殖等者此中正約此會不得更從通釋即無量諸佛所而行深妙道又二萬億佛所聞無上道又大通佛所聞妙法也植謂種即聞也即下了因種也謂往世曾聞妙道為因世世薰修兼資現在調熟緣合即機會也成就堪可開發如患將潰可決潰時如機有可發之時故是正釋機義不起即得故是經當義矣不起簡異別時聞即簡異思修正以此顯當義不得帶無量義釋此將當義釋當義也即三周領解是也。",
        "translation": "The next explanation of the opportune is that this is the main thing that arises, so the next explanation of the opportune is that the main thing that arises is the main thing that arises, so it's easy to say that the pivotal point is the one that arouses the glorious and humiliating aspect of the teaching, so it's called the opportune. If someone hears the teaching and even arouses it, there's no different time from the church, so it's called the opportune.",
        "source": "X29n0596_008:0329a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次言影響者對形聲以為名以由形聲故有影響見聞影響則知形聲是從助以顯正而為名也於中亦有法譬合今謂初出此眾隱其以下是釋影響有法有譬雖無以下釋成此眾之能不知此眾是何等人故舉二類以顯之也即是圓因圓果二種人也次正明影響諸佛蔽本果示種種因迹之形是隱其極菩薩弊其圓頓示於偏漸是隱其圓此即隱形聲而示影響也正要隱圓極本而示偏因迹也或圓極通說不必別屬二人思之思之匡輔法王正明隱現之意所以隱顯正為於此也此即隱己之形聲而為影響顯發他正形聲之化此即互為主伴之義矣匡正也輔助也儒云將順其美匡救其惡謂以正直之道輔助其主治化於世也今此示居種種迹地而用平等正直之道而助佛法主之化於法界也此從正從義亦兼助餘三也眾星喻隱圓本而示諸要迹也遶即喻匡輔也月即喻法王也雖無為作是簡異於形聲即化主之用也而有大益正明影響之功能也或可雖無為作簡異發起思之思之言大益者能令妙會當機結緣之眾得成就也故仲尼云有顏回則門人益親以為肯附之友等彼且猶然況於此乎故論云化道將行必待於伴此其一也。",
        "translation": "The next thing that's said about influence is that it's called form and sound because there's influence because of form and sound. Seeing and hearing influence then we know that form and sound is called from helping to show what's right. There's also a combination of dharma and metaphors in this, which means that the first thing that comes out of this congregation is the following explanation of influence, dharma and metaphors, although there's no following explanation of the ability to form this congregation.",
        "source": "X29n0596_008:0329a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言結緣者記云結謂結搆立機之始緣即緣助能成之終則為未來修得三德之先萌也今謂結者繫綴亦屬著也此故下文云以無價寶珠繫著內衣裏緣謂因緣望後成就果為名也即以初聞妙法信解屬於經體名為繫結能為後時重一聞得脫之由此結即緣故云結緣此結即種也能為熟脫而作因緣故云結緣是此一類眾多之人故云眾也當機是現是脫結緣是種是當者也具如上文於中初明無前三眾之義後明以無前三但成結緣初言力者應具三力智慧神通音聲此即三密力也前文具含此三今文但合言其二謂形聲也下文身平也二必具三前文智鑒也此用依體其未得體何能此用故云無也引集佛所擊起現瑞等三也德非者前正約用故言力此就體故云德德者得也且得道之用其未得道何有此能故云非也言伏物等者此中應有三義一不能伏物二不能鎮文三不能莊嚴諸惡永盡故能伏眾善普會故能發道顯體周故能鎮惡盡即斷德善會即智德體周法身德此即三德故言德也即前所隱之圓極也今此類之人全無居三道之位何能有此三德之用故云非矣又能令畏也愛也專一無異也此人自未此三焉能令他故云非也有先德講本乃作鎮羅之用便謂是大經中鎮頭加維廿毒二果喻其永生善滅惡二能謂為獨得其要直非直言說亦傳筆墨後學孰謂不然今謂固不然矣如向略明次簡無前當機從釋義便故此次第初明往習因劣不成三慧之機次明以往無三現無四益言根淺者於圓妙道無深信解即影顯前宿植深厚也覆漏以下正明無三慧機即對前緣合時熟是有機也無聞慧機不堪受於正說故覆器無思慧機不能審慮何即告失其猶漏器故云漏下文云而尋渡忘儒典云不思則罔無修慧機不能去非精一猶如汙穢雜惡之器故云汙雜無三機故三慧不生慧者解也聞而不解是聞非慧思修亦爾三慧不生明無當機益也雖得見聞以不解故不名聞慧聞慧既無思修何有三慧既無故無四益若單言三未盡當機之益故更加言四方盡其義記云通即六根五品別即起去之流準此分位四悉俱得名為當機故五品以來世界益也六根以來為治二益初住以去第一義益無聞思修即次第名無三悉益無修故無第一義益故第一義亦有通別通於五品別在初住故得度之言亦有通別即第一義之通別也今觀此意別則三悉在凡一義在聖通則四義俱通凡聖今文含此二義今謂通論名字以去並屬當機別則正定以去名當機益不定之位名為結緣故今從通說故取三慧四悉之益並名當機意在得信解故是下釋心懷悔恨云悔昔不動教令入內凡內凡即正定聚也又觀心文中義正如此是則名字即當聞慧觀行即思慧相似即修慧若言名字非聞慧者何名為即若聞能了皆即是者何故拂廗而退斯則是非之義明矣但作等者正明結緣義也以往所習不成三因現在無其四益但作未來三四因緣故此一類總以此義名結緣眾也。",
        "translation": "Speaking of condition, it's noted that the term \"condition\" refers to the beginning of the bond that establishes the capacity, and the term \"condition\" refers to the end of the condition that helps to bring about the attainment of the three virtues in the future. The term \"condition\" now refers to the tying up of a priceless jewel, the tying up of an inner garment, the term \"condition\" refers to the accomplishment of a cause and condition in the future, and the name of the result.",
        "source": "X29n0596_008:0329b19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次下是結緣釋一例顯餘三及示都數前云約一更開為四則四皆四前已釋一四竟今結例顯故云餘三亦然餘三若今今徵文出其事狀則繁但通知皆有本迹權實意義即足然眾有三此四但在聲聞餘二何故不言或云但言此四餘二攝在其中若爾何故前云名局今謂聲聞既然餘二例爾此意自顯不俟繁文故不言也必欲知者今例而言若略論二眾各四則八并前十六則二十四若雜眾八番各四則三十二并二十四則成五十六眾若更四輪王并諸國王及國大臣長者又是六眾亦各有四則二十四眾并五十六則八十眾此亦大略若委論者其數非限若得此意諸經種種四名終不越此四數之內如此要妙何有智而謂不然必謂不然必得不然無智者矣。",
        "translation": "Next, we'll explain the connection, explain the one example, show the remaining three, and indicate the number of all of them. As explained before, about one more example opens into four, then all four are four.",
        "source": "X29n0596_008:0330a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是五舉昔類況於今於中有二初明彼時有一四類顯今一四次明彼義亦有四四況顯今佛道同故有四四所以不言影響者既有餘三必此有一可以影知不繁文也初應言請說而言覆講者諸本皆爾有先德云文誤今謂此亦影略互顯也此有二義謂化主及機緣若言請說是發起化主若言覆講是發起機緣經有二文今亦不欲繁文但舉發起機緣影顯於化主故云爾也謂覆講發起已有機者今即得妙道未有機者為作有之因緣故是發起眾也此即彼時有今之一四也彼時既有今固不無次況顯者彼時既有聲聞復有向之四眾則一一眾皆有權實各二故即有四下文為四部眾即聲聞四眾也故有一四四故直於一四以明十六此文含有二義一舉劣況勝二明諸佛道同況者彼時時處機三事皆勝尚有十六況今三劣而不有耶二明諸佛道同彼佛既有今佛故不無也寧者安也安者何也若明一義不應言時尚復言道同故知又是影顯應知此中一文有四影略一者通明舉三影顯其一二者初中舉覆講影顯請說三者但舉彼尚即影知況今四者但舉今同即顯彰彼諸皆有故是有四故此一文雖少而有此四異常體也學者不可不知此從既明教等三釋此前故是因緣四義如前已略說如當機結緣中明應知發起此四影響此四當機正得此四利益結緣四是諸四之因緣思之。",
        "translation": "The first is to explain that there were one or four categories at that time, and the second is to explain that there are also four circumstances that reveal that the present Buddha's path is the same, so there are four or four. That's why they don't say \"influence\" because there are three others, and there must be one that can be shadowed without elaborate text. The first should say \"request\" and the second should say \"lecture\" because all the scriptures are the same, and there's a textual error in the prior virtue of the cloud.",
        "source": "X29n0596_008:0330b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上五重釋四眾因緣竟約教直言圓者以向直約此經五序以釋並是發起正妙故言三例亦爾者約昔相待已說若至此會滅後無復餘三即是此經圓義次本迹不釋記云若且約體用即本住尊極或深位法身迹為四教一十六眾今謂亦可准下文明成道久遠常說法華則一一說彼皆有一十六眾過去中間所被一十六眾則是本今日所被一十六眾即是迹此義易知故文不釋直云可解若作餘釋則不可解觀名字者聞其本妙決定知其所以是此位也如理觀照不間斷者觀行位前釋別義正依此也當機之中應知通上且從位始故云此也分真位中既得妙體即具二用故即能為此二應知此位二義一是當機二即是此二位也(云云)之意略爾。",
        "translation": "After the above five explanations of the causes and conditions of the four groups of people are completed, the direct explanation of the five sequences of this sūtra is to explain that they are the direct initiation of the correct subtlety, so the three examples are also explained in the same way as in the past, when the mutual dependence of the past was explained, and if this congregation were to cease, there would be no more three remaining, which would be the complete meaning of this sūtra.",
        "source": "X29n0596_008:0330c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋圍遶者前釋所集之眾此正釋眾之威儀也論釋此文云一眾圍遶二前後他云今經文少前後應云四眾後前圍遶文方具足今謂論經多有不同疑是文闕而義已足何者圍遶不獨二邊即具前後之義況無量義中亦無前後之文故已盡矣不可以加矣文中四釋初但釋其元由次二釋中兼釋其一義初既因緣要四義者記云淨居天下即世界化為人像即為人人以為揩即對治禮已聽法即第一義今恐此乖文義今謂世界總談法之體相天垂像人為揩則世界也右旋表於信順為人也禮敬者慢對治也聽法悟道第一義矣依文次第義又分明不敢異也次約教中初具消文四儀之中此具行坐住三即向云到已旋禮坐此即三也今從初說彰其意義云何旋實通二也迴為圍旋環為遶合於禮度為威儀也方土不同此方重禮彼方貴遶或三或七或復百千故無量義云遶百千迊事儀如此意在何者有引大論云為顯佛德尊人受道如諸天等也今釋意者表圓理也四面故表四門行遶故是動所遶是佛圓妙之身表當聞正說於一一門皆得見妙道也如開示等四句即四門皆會佛知見即圓理也言對偏者約相待說絕則唯一無復更三以待顯絕故云爾也然偏圓皆四何以取異方圓別也思之次觀者為因觀次明本迹故於先也初明遶旋瞻觀之由言周迊即相好圓滿也四旋皆觀妙觀也如下龍女偈說由此故旋遶瞻仰由此旋仰故得深定如般舟三昧正名為行定也此即旋遶之觀也本中意者即相而達性即用而達體也即體用本迹也此是圓觀之力用故在觀後明之。",
        "translation": "The explanation of circumambulation is the previous explanation of the congregation gathered here, which is the correct explanation of the congregation's etiquette. The treatise explains that this text says one congregation is circumambulated, two are preceded and followed by another, which says the text of the present sūtra is less preceding and less following, and it should say that the four congregations are followed by the preceding and following circumambulation, which is the lack of text and the completion of meaning.",
        "source": "X29n0596_008:0331a02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上釋集儀竟下釋既集供養之事此中疏文有三初依文略釋次引無量義經廣明體相三明引彼此之意初者經有四句疏作通別兩釋初言通三等者意通此供養文有此四句不出三業若通論皆是供養則初之一句似但通標無別體也若別論之四句皆各別有體義則通是供養乃不出於三業則初二句是身業也次是意後是口業也以故言通也下別釋者卑謹釋恭虔禮釋敬文中別釋而合結也或云修謹曰恭崇仰曰敬有云謙遜畏難為恭推其智德為敬次言至心等者盡心一意向佛妙境故也有云一切眾中無如佛者曰尊恃怙之心過於覆載名重有云敬甚曰尊尊深曰重發言等者二字之義分別雖有小異通足讚美之詞如次引經但是一義故今直從合說故云爾也有云美其實德為讚讚猶不足又稱揚之曰歎有是理談美曰讚觸事論德曰歎言其依報者向之三句言別而義通此句名義俱通而體有別前已標其通竟今更顯其別體故更於此言之依報之物如次所出施字亦可平呼即行用也謂行用其依報各物以供養也有云天華香等名之為供資養於佛目之為養有云進財行為供有攝資名養有云依地論供養有三一利養謂四事二敬謂香華等三行謂信戒等行今謂通論如前菩薩德中別論如此次文所出亦名事亦二即是法並為法故皆如法故故論名如法住論即具此二種義矣。",
        "translation": "First, the sutra has four sentences, and the commentary makes two interpretations: general and specific. First, the meaning of the four sentences is general and specific, and the meaning of the four sentences is general in nature and not specific in essence. If the general theory is that they are all offerings, then the first sentence seems to be general in nature and not specific in essence.",
        "source": "X29n0596_008:0331b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下引廣顯其體狀初出供具體狀彼文雖廣不出五云天華即色天樂即聲天香即香天百味即味天衣服等即觸故即五也外事供養之物不出此五意之運想即成法塵故具六也今文略舉其二三總等取其五六故云等也此並身業供養之體狀也次是恭敬經但言胡跪合掌無叉手言義必須爾故言之也此是身業恭敬體狀也經但言一心亦無瞻仰之言亦義必須爾故置之也但一心瞻仰即是尊是重也此是意業供養之狀也言七言者即大哉大悟等文有五十一行初偈但成二十五半注家以為五十一偈此即以行為偈義恐不然經云說偈讚言故通是稱美名為讚歎也此即則口業供養之相狀也六塵之資可得是供養別三業事如何得是供養彼供養是別三業如何得然供養者順奉所須佛無世間所須唯要在物從道若能如是三業精誠順奉則是得道因緣稱聖乃懷故當妙供養矣故皆是供養矣五塵皆言天者世間最勝美也眾有權實故得皆言天尚有過天何但等天且順世間也。",
        "translation": "Although the text is broad, it doesn't include the five clouds, the sky, the color, the music, the sound, the fragrance, the odor, the taste, and the clothing, etc., which are tactile, so that's five.",
        "source": "X29n0596_008:0331c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋彼此意者有徵釋結兩經有異有同達者無此微釋或多不達據異生疑故有此釋應知兩經二序有同有異通序五事全同別序五事有異同有眾集一事則與彼同餘之四事則與彼別彼之別序總唯眾集三業供養以為發起則彼別發起序盡此眾集序矣故餘四不同此別初一全與彼別體同故此略而彼廣以彼廣釋此略以理固其然何咎之有據經末云大眾聞佛說已歡喜作禮受持而去既云持去豈云不散今謂此之一會說益有二一說出生益二說收入益雖有其二正意在於收入前說出生益訖勸命流通眾有奉命散演之懷為明一說始終之體又為末代有緣專一部者是結集之士故云持去本為於此經說彼以彼正意未暢故便入其定雨華動地主既不起眾寧有散今從正說故云儼然以是故知彼序復為此序彼正望彼序故為正望此正復為序彼流通對彼序正故為流通望此正通故亦為序故彼當分具三對至此並為序義明矣思之思之。",
        "translation": "The next explanation of the mutual significance of the lemmas and interpretations is that there are differences and similarities between the two scriptures, and those who don't have this subtle explanation or don't have it based on the differences give rise to doubts, so there is this explanation.",
        "source": "X29n0596_008:0331c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下釋現相序者疏文有二一指經分齊標示章門第二科文別釋初所以委示文分齊者以古今或不以此並為現瑞之文今意不同故尅示其起盡以此並是表發之事故也亦名現瑞序經文具有二名亦名表發序文中自當會釋大要而言前是感此明應使感益深也彼之三事共成二也。",
        "translation": "The next explanation of the manifestation sequence is that there are two commentaries, one referring to the sūtras that are delineated and labeled as the second section, and the first explaining the text separately, because in the past and present, this may not be the same as the manifestation text, but the present intention is different, so the resonance is shown to be complete, and this is the manifestation of the incident.",
        "source": "X29n0596_008:0332a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下正科釋者即有二別初科次釋初科中二先述異次評意初意兩家初家示開二土但二土合論故云七也他一只放光餘並因照因見也若後正釋此不當義自顯故文不言次家先述其標數此師開二土各為六此數當也下是述其列釋但且此土之六他土之六在後自見於此六中仍束為三雙一一皆有三義謂名文義且初動是名也說法度人是其文體又即是其義也此即初三也下之五事皆爾準以可破不繁文也次評異中但評光宅初義易知故不繁也於光宅中有可許有不初許其數及文次奪其名義及所表意許其數者謂為二又各為六也文者於二於六之文各得其起盡也此則其當故許之也奪中名即其所立六名也義則其所釋六名下之義也如前所明所明便易謂何便易會表顯於當所說之義報示正說之意並未明也故是不當奪破之也意義既爾正意如何。",
        "translation": "The next correct section is to explain that there are two distinctions in the first section, and the second section is to explain the first two, first by describing the differences, then by commenting on the first two. The first shows that the two lands are combined, but the two lands are discussed together, so the cloud is seven, and the other one emits light, and the other one is caused by illumination and views.",
        "source": "X29n0596_008:0332a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自下是正科釋於中有二先列六名次釋其義文之與數並與光宅是同故不復論名之與義則與其異故直列名釋其義矣即前與奪之意也初列六名與彼六名全不同也可知亦為三雙者並是偶對之名故也應知若直依文立名者可知而不直依文而必立此名者正欲以序六名即表於正六義故也光宅之名全無表正之義既無所表何名為序正又含雙二義故也(云云)。",
        "translation": "From the following is the correct section of the explanation, in which there are two things: first, listing the six names; second, explaining their meanings; and third, explaining that the text and the number are the same as Guangzhai's. Therefore, it's not necessary to discuss the names and their meanings; therefore, it's necessary to list the names directly and explain their meanings, which is the same as the previous meaning of \"snatching.\" The first list of six names is completely different from the other six names, which can be understood to be three pairs of names that are evenly matched.",
        "source": "X29n0596_008:0332b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋義中有三初釋別名義此六以下釋通名義略明以下合釋通別名義亦可但為二意初二釋名義便易對其前奪其名義不便易也後一名所表報之義對前奪其不明表報之意亦可初釋別通二名相何所下釋表報義思之初於六中一一皆具二義謂體義也智言說者正指說經瑞也說是智用故說是智說況指一說多即妙智矣指亦是說謂說從一出多法之義處即前一也專任一體故是妙定也此二相成故為一對因即雨華四既並華又從天降故是四位妙因也四上加二故即是果即妙果也因果相待故為一雙感即眾喜以歡喜故即妙機發起感而摛此光故即妙應也感應即因緣契會故為一雙此六名義聞即了會天表當說六法故是便易不同舊也何不直依文名而必立此名耶為表正宗之意若不爾者何名別序若如光宅都無所以只得當分之文並無起正之義今之所名序今正義二俱了矣應知此之一六須含三義謂此六也此次第也思而出之。",
        "translation": "The first is to explain the meaning of the distinctive names, the following is to explain the generic names, and the following is to explain the generic names together, but there are two meanings.",
        "source": "X29n0596_008:0332b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下是釋其通名者謂瑞相也以經文有此二名古今呼亦不定故須辨之起後表報之釋也於中初明體同次明義異三明異之所以初據經說既言如本則但一物謂六種也次明就義強分別之亦可有其二義言人情者向據聖言實理一也此約世俗人情文字分別故亦強為二也下出二義即一物之上有此二義密是讚報正說之法就功德也奇異就當體即六事體皆非常也奇異之狀能密報故為瑞密報體之奇異故為相此異而常同同而常異也相何所下是釋瑞相之所以有徵釋結準於釋結初徵應云眾既集已便應即說何須更以異相表報而後方說若略而言應云相何所以下約釋之以釋驗之殊不相應若相應者正應在次略明六瑞文之上今謂此徵似含二意一者徵其瑞相所以謂有何所以而用此相而表報之二徵此相何所表報釋中先釋初意略明以下是釋次意似含此意故云爾也釋初意中初二句明瑞相之由初句明所說之道絕於常談非其人不可虗授所受之人尋常等閑不能信受非常之道以是故次二句明須先現異相而駭變之既而因生警仰然後乃可為說以此之故有此二義故以是二為釋妙理是所說之道即妙法道理也玄頤歎妙法道理深遠形聲之外絕常之境易云探頤索隱約深致遠皆深遠至極之稱也說之至難者若但讚佛乘眾生沒罪苦四十餘年未顯真實豈非至難人情等者說難之由也悠悠者於事不切尋常等閑也總此意者其道非常機緣尋常尋常不能受於非常之道故先以非常之事而警發之令其變動有常之志乃可授與非常之道以此故以二義釋之下釋所表報者別論相似警駭物情瑞以表報正說六事發起之表總此二意。",
        "translation": "The following is an explanation of its generic name, which is \"auspicious sign.\" Because the sūtras have these two names, the ancient and modern callings are also indeterminate, so it must be discerned that the interpretation that arises after the manifestation of retribution also begins by explaining that the essence is the same, followed by an explanation of the difference in meaning, and three explanations of the reason for the difference. First, according to the sūtras, since they say that the original is only one thing, which are the six kinds, and second, according to the meaning, they are strongly discriminated, and there can be two meanings.",
        "source": "X29n0596_008:0332c17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "向已釋相今約此所表釋成瑞矣亦標釋結言略明者准下文說廣則一切中則十妙略則四一雖此三別一一皆通一切前對光宅以五表四今於瑞六而表於十則四一一皆具於十亦具一切意明六瑞廣論表一切妙今且略論表十故名為略是對一切廣以為言非對四略名為略也前五表四此瑞當其四中之一謂表第一義此是極略次開為六以表正說之六此是中也今表於十即是廣也欲顯十攝一切是廣故名為略此則成重略中廣義思之正說妙法此是妙瑞表說妙法法有十故表十妙玄義正釋妙中已說相狀廣如彼明故指於彼記云文在神通妙中言更道者猶言也謂更說也多有後學不曉道之一字義改以為通又更加於之字此不應也慎之慎之所以更道者玄文約義次第及通取自他二土長行偈頌之文合論十妙此中直約自土長行次第以論十故二處文義次第不同又彼通取故以十文對於十今此既別直以六事表於十故有兼單之異為通別互現故作此說恐後學不知其由須更言之故云更道其異略爾。",
        "translation": "Although these three kinds of distinctive one-by-one expressions all share the same thing, the previous five expressions of Guangzhai's five expressions of four, and now Rui's six expressions of ten, the four one-by-one expressions are all included in ten, and they also share all the meanings of the expressions.",
        "source": "X29n0596_008:0333a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下正明其相狀說法是序即能表也下二是所表正說也一表二者用必有體二不相離故即表二能表非常故皆妙也定即是行故即表也亦通因果具於能所此能定行非常故亦即表於妙也華有其四故即表於四位雨並自天故皆妙也地動一事而表二者正表破惑顯理約所顯邊故屬境能所破顯俱有其六該於運之自他始終故是乘也然理惑相即始終不異故皆是妙玄文名三法此前名為果此中名為乘所以三者將顯義有多故若依此中文義便易者乘或即是果字也眾即是人權人當成實人所得權法當成妙法二是喜之由也故只一喜是表於二放光是對感而施正是神力而作故一只表此二既是中道故皆是妙或云感屬眾喜此中正應言應相從而來故云感也今謂一體二義不妨兩出結者正由表此十種之義故六俱名等也。",
        "translation": "The following is to explain their characteristics and the state of the teaching is the preface that can be shown and the next two are shown and explained correctly, one shows two things, the use must have a body and two are not separate, so that is shown two things that can be shown very well, the concentration is the practice, so that is shown, and also through the cause and effect is in the energy and the object that can be determined and the practice is very well, so that is also shown in the marvelous, the flower has four of them, so that is shown in the four stages of rain and from the gods, so they are marvelous, the earth moves one thing and shows two things that are shown to be the destruction of confusion and the manifestation of the principle about the extremes that are shown, so they belong to the object, the destruction of the manifestation of both energy and object, and there are six of them that are carried out from the beginning and end of the other, so they are all marvelous.",
        "source": "X29n0596_008:0333b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上是總釋六章意竟自下第二別消六瑞之文即有六別初釋說法序此含二義一為詡前序故即正說二為起後故即為序經文五句初一句所被之人也次四句能被之法此二即感應也文但釋次四不解初一句為人簡異二乘故云菩薩此經具為三乘猶言菩薩諸說不同為何人故簡異二乘故云菩薩不能繁述今謂若從當分正舉其正若為序意雖復說三乘但為教菩薩法華之意含此二意故云爾也次約法有四句者或云體名因果或云初一總次三別今謂次既云名初即是體次三並是體上之名即論十七名中之三名也且初既唱為諸菩薩故須說大乘經大乘語通故便更別既敘一化故有三也疏文有三初引經解次結經要顯名是從後將所釋會經之義初釋大乘然大乘義或經自釋顯論所解經釋即如善戒大集論解即如十二門地持無著般若及對法論大集則廣明名義善戒但約七義以釋十二門論約六義地持等三並得約七義以解諸家皆約論七以解今此約經義以釋今更先述門論龍樹自約六義以解然後正釋今文初六義者一出二乘之上故二者佛最大此乘能至故三者諸佛大人之所乘故四者能滅眾生大苦與大利樂故五觀音彌勒等大士之所乘故六能盡諸法邊底故故名大乘今謂此中束要言之不出人法體用以此大故名為大乘此與經及餘論解有異顯義與方故略述之次疏文者此經七義與地持論全同與餘論七有同有異初法大地持論名同論云大乘經此云十二部以十二部言通故更以毗佛略簡之即方廣亦方等也般若論名同對法論名境大以前大教化之法為所發故其義是同二心大謂因前境法發菩提心也般若論同對論名行大謂具二利故此不同也三解大地持名解行大謂道種性菩薩行成就今文直言解義亦兼行般若名信解大其義全同淨心對治名知大性了二無我故略同四淨大者地持謂淨心大即初地菩薩與此見道是同般若名是同對法名精進大性謂三大無數劫修習難行故此不同五莊嚴大地持名眾具大謂福慧二種具足名少異義全同般若資粮大對法名方便善巧大性由是具悲智不住生死及涅槃故此稍亦異六時大中地持名義並同般若名果大性對法名論得大性謂成就十力四無量等諸功德今謂此兩論是同與經及地論不同也第七具足大中地持名果大謂大菩薩故名異義同般若名時大對法名業大性謂窮生死際建佛事故兩論同與經及地持名異義同地持既與經同且依此二為釋。",
        "translation": "After the above is a general explanation of the meaning of the six chapters, from the second below, the text of the six rituals is divided into six categories. First, it explains the preface to the teaching of the Dharma, which contains two meanings: first, it boasts of the preceding preface, which is the correct explanation; second, it initiates the latter, which is the preface; and second, it explains the five phrases of the sutra. The first phrase is about the person to whom the teaching is given, and the second four phrases are about the Dharma that can be given.",
        "source": "X29n0596_008:0333c09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下是結束經要顯名立之所從也因果之義可知若依餘兩論釋結要甚便易也如經七義要而言之只是因果謂前六後一所以可知若依餘之兩論此結於文次第不便所以先此結束者起後會十妙也應知七之與二並且是其體未彰其義不知何故名大名乘應知此七語因則萬行悉包語果則萬德斯備故名為大自運他故名為乘體用合論故名大乘體說此大乘體用以教菩薩能所合名故云大乘經也下是將自所釋妙義以會經之大義所以然者正明妙大皆有十義故經云說大乘經名妙法華彼雖方等義通今取圓義通名大邊故得將妙釋大言捒經者捒字(所句反)謂莊捒相屬配也雖十以七數意義不出於因果向先束為因果正以此也以後五即果上之用故對法論第七名業大性盡未來際建佛事故即具後五也但順疏文要會即足不繁別對故云可解若此相即序正何別者若從當時序義即取十大以表十妙以大義通妙義別故若至正說已後大妙相即具有二義故無所妨又應知大是體乘是用今涅槃釋體即兼用也若大集即體用別釋如信論疏知之。",
        "translation": "The following is the conclusion of the sūtra that shows the basis for the establishment of the name. The meaning of cause and effect can be understood, and if we rely on the other two treatises to explain the conclusion, it's very easy to understand.",
        "source": "X29n0596_008:0334b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下釋體上之名者然大乘語通無量等名則別故前是總此下三名是別故諸釋皆以為總別也初釋無量義中有二初辨舊釋次引正解初中先別後總初中約人有六就義但五一一皆先述後難明其理有未當於五解中一一要唯有二謂釋經名及為序義此名本為序作釋名若當序義自成如其不當則不為序文中所出或但釋名或但為序正以此矣不得此要徒繁解釋終非宗旨思之思之。",
        "translation": "The next explanation of the name on the body is that although the Dasheng lingua franca is immeasurable and so forth, the names are distinct, so the first is general, the next three are distinct, and the first explanation of the meaning of immeasurable has two meanings. The first is to identify the old explanation, and the second is to introduce the correct explanation.",
        "source": "X29n0596_008:0334c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初師雖直明為序之意而即帶其名義此師正以無相解無量空理釋義字意明此經正說無相空理故名無量義何故先說此然後說法華釋云此無相空理是大乘教行之本將欲會末歸本必先談本然後會歸即以無量義談本故為序法華會末故為正也有人云此非生師之言旨也乃傳述他人述生師之義今謂不然今先具述彼疏本文然後會今之要彼疏云說大經者三乘外順迹與理反執文乖旨則何能可驗一乘之唱將說法華故先導達其情說無量義經其滯迹日久忽聞無三頓乖昔好昔好若乖則望崖望崖而反而反者則大癈焉故須漸也名無量義者是相皆無無有多少淺深也唯說赴佛之行耳言有實謂之義也彼疏所釋文盡於此於中不過二意初釋先說之意即為序之義也須正釋名彼文繁而迂今文直撮其要逕無相空理即撮其次仰名要封三來久即撮其初滯迹以下文也謂彼經明本法華會末將明會有相之末須先明無相之本然後會歸故談本為會末作序此所舉者盡其要旨非全其文故非傳他說也觀與生同師於什義意與生同也次難意者以此等經皆明無相空理故以此責次彼又通意者雖通明無相前二隔遠故非無量義隣接故獨為序言五時者古人初時不定或人天提謂為初或阿含為初餘準可知又難意者則無量義與前諸經皆須有序無量義經復以何經為序又前前起於後後法爾之事不必要以無量義為序理固不爾都由釋名不當故序義不成。",
        "translation": "Although the first teacher directly explained the meaning of preface, that is, to bring its name, this teacher is explaining the principle of emptiness without marks, the word meaning of the explanation means to explain that this sutra is teaching the principle of emptiness without marks, so it's called the immeasurable meaning.",
        "source": "X29n0596_008:0334c09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次基師者即會稽法華寺基法師生師之門人也故其釋義及意並與前同難亦不異其所釋云若是有法則有分限名為有量空義深廣稱為無量舊有難云若爾與第二時大品何異彼答云前教明空為三乘行本不得為序此中明空為大乘行本故得為序雖有此判無以為據此亦以釋名不當序義未立。",
        "translation": "Second, Ji Shi, the disciple of the founder of the Fahua Temple in Huiji, Ji Fashi Sheng, was the same as the previous one, so his interpretation and meaning were the same as the previous one, and the objection was not different from his interpretation, which said, \"If this is a reality, then there is a limit to what is called measured emptiness, and the meaning is profound and extensive, and it's called immeasurable.\" The old objection was, \"If this is the case, how is it different from the second period of the great teaching?\" His answer was, \"The previous teaching states that emptiness is the basis of the practice of the three vehicles, so it can't be the order, but in this case, it states that emptiness is the basis of the practice of the great vehicle, so it can be the order, although there is no basis for this interpretation, because the interpretation is not properly named, and the meaning of order has not been established.",
        "source": "X29n0596_008:0335a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次印師釋初言無相善等者記云意云十二年前是有相教非成佛因指無相善有成佛義意云至法華中一切無不皆成佛道所言義者謂可成也故以成佛義為一乘經序又云等者若爾方等般若亦明無相亦應以方等般若為法華序印師預防此難故更述無量義與大品對辨大品無相猶說有三無三無量義中無相不說三之有無故大品無相非法華中無量義經此無量義未翻譯故此有三失一錯解無量義經不說有無二謬謂其經未譯三妄破古師以大品為無量義初者彼經既說二三從無相出何謂不說有無為異今謂此印師文為二初述次破述其釋中應有四義初釋名次為序三結非四顯是破中略破彼二初云無相者恐相字誤應云無量何以明者以三義知之一者准諸家所引其說皆云無量故二者諸述其執不信舊作無相定理之說故三者光宅親承其門所釋與其義同皆云無量萬善故以此三義言無相者故不相應或抄寫誤或晚人改故致如此也故嘉祥引其釋云印師云此經辨無量萬善也以現在行無量萬善未來成佛故也此但是其情斟酌非有據也又云等者辨異顯成序義初云有無等者謂無量義既說無相故不說有三未破會故不說無三(云云)嘉祥又述云若說萬善成佛與法華何異彼答云此中但覆翔明萬善成佛不言萬善之外無別三乘之義此但是顯實未開權也故與法華為異稱之為序及彼見經本基師覽經便謂解與經符而印師固執不移云明空無量義經者別是餘時說耳非法華前所說者也法華前所說者正明萬善成佛其文未來此土乃至光宅法師猶存印師之解今謂據此文義具有其義初是釋名次三易知從彼答以下乃至稱之為序即今文彼經不說至有異也明為序義從明空無量義下乃至非法華前所辨者也簡非即今文大品非法華法華所指者也從法華前所辨者乃至未來此上是顯是即今文指者不來秦地也據此文義則初名中不應言無相次序義中正應云彼經不說無三為異則剩二字及誤一字謂有三二字及下為之一字誤為有字謂不說無三與法華為異故得為序次簡非中大品二字誤又欠字正應云若明空義別非法華所指以其見經已情執不信謂自是別時無量義經非是法華序中所指故是簡非也前非無相此不應更言大品故知後人加改於次文中自見若是法華所指者正明指萬善有成佛義但文未來故是顯己所釋為是也若不得此意此文終不可會。",
        "translation": "Next, the Indra's explanation begins with the words 'goodness in formlessness,' which means that twelve years ago it was the teaching that had characteristics, not the cause of becoming a buddha, which refers to goodness in formlessness, and the meaning of becoming a buddha.",
        "source": "X29n0596_008:0335a17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次下據經已來略破其後二義雖義印兼破四而前二義未正全破所以然者正以光宅將其二義次破光宅則其二義自壞故不繁也此中所引經來之事即劉氏注彼經序中之所明也南朝初得此經注釋弘宣無其前者故以為憑據彼序云有武當山比丘慧表以齊建元三年於廣州朝亭寺遇天竺沙門曇摩伽陀耶舍受得此本還武當山以今永明三年九月十八日頂戴山見投弘通幸覩真文欣敬兼誠詠歌不足手舞莫宣輙虔訪宿解抽刷庸思謹是序注(云云)文中乃云齊宋建元元嘉三年齊即南齊接於宋朝有元嘉無建元齊有建元無元嘉今乃云齊宋建元元嘉此都不曉時代次第不明年號有無先釋並不言之後學如何取會此皆曉人造次專輙致使如之以此證知前之四義是非益明豈不信哉又文中朝庭寺序中作亭今文或作庭或作廷正應作亭此有因由不能具述今文其字並不依本此亦晚人專輙諸謬例然經既等者責破其謬然此中應為二途若其全不知經已來則直可以此責之據如前說其親見經排棄不受謂自是別經非法華中指者則但應責其順己凡情乖背聖道不應直以此責然正應雙責之一責其順情不信聖說二責其謂別有經未來文略故但一也故嘉祥先明其經已來以此文同次以五義責其謂非此指不肯信受此義應爾五義者一者處同二者眾同三者時同兩經皆云四十餘年故也四者義同前經雖未彰言開顯而旨趣已密開顯一乘五者翻經之人中天沙門自云是法華前說宜應用也理應知此今意如後正釋。",
        "translation": "Next, according to the sutra, it briefly refutes the next two meanings, even though it refutes all four meanings and doesn't refute all of the previous two meanings. The reason for this is that Guangzhai will have its two meanings, and when Guangzhai is refuted secondly, the two meanings will be destroyed on their own, so it won't be complicated. The events cited here are those explained in the preface of the sutra as explained in Liu's commentary.",
        "source": "X29n0596_008:0335c12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次破光宅此即印師親所授者也於中先述其釋次釋其非初中先述其釋兩經所明要義破三以下述其結判故為序正初先牒名以萬善下是釋義以萬善釋無量同歸能成佛道是釋義字之義此即前經之要義也以此故名無量義此二言有微異意義與前印師無別次釋此法華要義此即經云無二亦無三也宗要在此故言正明意明無即破也前經未言今正無言故也言破三與一等者正明兩義異故前為序後為正也言破等者指前無也釋者皆云法華破三權與一實與前直明同歸為異故為序正今謂亦可言法華正明破三歸一與無量義直明同歸一道為異故即為序為正此意明直歸與破顯為異故也思之。",
        "translation": "Second, he explained that Guangzhai was the one personally given by the Indra teacher, and in this explanation, he first explained what he explained, then he explained what he didn't explain, and in the middle explanation, he first explained what he explained, and the two sutras explained the essential meaning of breaking three in order to explain the following conclusion, so it's preface and correct. First, he first explained the name, and then he explained the meaning, using myriad goodness to explain the meaning, using myriad goodness to explain the meaning of measurelessness, which is the meaning of the word meaning.",
        "source": "X29n0596_008:0336a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以下是次難破於中有二初奪後縱亦初直破其前釋次是破其救義亦是更探取其意而破之也今直為三初以其正難其序今序正不成次以其序難其正今其正序不成三難其雙救令義亦不成三文各應三句一並責其令同二結定同三既同序正不成文中初闕中一次具有三初何不同歸例責之也此例者若不同歸乃成有量何謂無量應結云既為無量故並歸無二三也文闕此句下一句明序義不成若並同歸佛道舉體為正何更有序故序義定不成正亦何有故俱不成次難其正初牒例責此責意數者向明二三同為無量萬善之數歸既並同破亦皆等況二三是體勝勝且被破劣豈應存以是定知既破二三則無二三既無二三則是破無萬善也若從要結只應云若破二三故則定破萬文兼顯破是無而略破萬或傳寫誤言無序者同歸全皆被破故也前明無正全是同歸故後明無序全歸被破故夫序正相待得名既無二體何有亦名故為序正俱不成矣思之思之。",
        "translation": "The following are the two difficulties in refuting the first, the second is to directly refute the previous explanation, the second is to refute the meaning of their salvation, and the third is to refute the meaning of their dual salvation, and the third is to refute the meaning of their failure to make the three texts each consist of three phrases, one blaming the other for making the same, the second for concluding the same, and the third for making the same sequence correct, and the third for not refuting the example.",
        "source": "X29n0596_008:0336b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次是破其救者此中道理亦應三句初出其救義謂雖並同歸亦皆是破而各舉一邊故得為異故得為序正也次責云不成異者同歸無可破可破無同歸況已同歸不應更破既須更破何謂同歸又同歸還是破物破物還是同歸都無二物何所論異故異不成三結異義既無序正何有故並不可次難第六注家二先述其解次責其非初中或云此文所引非全其言今謂其注有二一注無量義經所釋二注法華中無量義名合而言之總有五處大意是同言有少異今此所引皆是注彼經中之言先釋既不會通後學不知其由多生僻謬復有人云注中無此言此以不知見也今先總述其釋後明此文所引便後學通會不為偏帶何者其注彼經自有四處初序中云無量義者取其無相一法廣生眾教含義不貲故曰無量次明漸頓中云今無量義亦以無相為本(次亦釋名云)無量義者自道樹初說迄于今唱文辭不二而得名有殊將融差別之在物以非真極之所存無相一法所含之義不貲故曰無量義(次釋經中正釋名之文)經云如是無相(註云)舉無相之本也昔言三乘所登各以有限為源今明萬行所歸乃以無量為極將去對教之迷先融適化之本教雖參差理無別趣欲表三非而一是且說流殊而源合義之所歸不以深淺為厓故名無量義(彼文所釋要盡於此)此前述其所注二處五文三是釋名今文正引其注彼經中兩釋之義正當釋名義以正故然其注中有兩處明無相為本之言其意正爾今取其意彰其不當故合取其釋有人云注無此釋者此人不盡見其文故致謬妄具如前引既以無相一法為其本則知無量是其末即本含於末無相含有相一以含多也從此以為名故云無量義次下責難者此有二過一者違於經說二者自語相違都由含之一言致此兩失何者雖言無相而具含一切豈非相違經云出生而以含為釋豈非違經況都非為序之義何者佛言從一出多密表收多入一故得為序若言其含何以為序又若以一含多為序法華應是從一出多為正由本先含然後出故又若前以一含多而為序者法華應明多含於一為正亦是有含於無未含於本正以為正矣以故都為不當既釋名不當則為序義任自不成故文但破其釋名非即自顯其為序之義不立故不言矣其中貲字音髭與資音相近其義亦同謂財貨也非此中意由來借為玼音而訓為盡此有得失亦未全當學者皆云文字釋中並無此音亦無此義多生疑諍並依本音而收盡二義今謂此見其近未知其遠就近以論則知所言從遠以論古人多借用其字以為玼音而訓為齊(去去)也限也故前漢蜀嚴君平作老子指歸十卷其中數用此字皆取齊限之義又文選中亦時有用此字音義亦同又謝南池傳云靈越名不貲義皆同也又明了論中釋量字義謂齊限也此義切當並非盡義言不者釋無也貲者釋量也其意正言含義無有齊限故言無量若作不盡如何以釋無量故其注云義之所歸不以淺深為厓故云無量以此故知從來謬矣而有迷者難云若如此者其釋已當何以破之今問引文所破者破其何義義已如前後學宜須審思無為雷同謬妄。",
        "translation": "Next, it's a refutation of the reasoning here, which should also be in three sentences. First, it's a refutation of the meaning that even though they are both part of the same refuge, they are both broken and each is given one side, so they can be different, so they can be orderly and correct. Second, it's a criticism that the cloud isn't different because there's nothing to break and nothing to break. What does it mean to be part of the same refuge or part of the same refuge or to break something, or to break something or part of the same refuge that has no two things?",
        "source": "X29n0596_008:0336b22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上來別述破竟下總結判是非有標釋結標言諸師即前六也一種即後三也釋中束前六家只成三義以釋前偏一種義也有相即四五兩家以其但言萬善對前無相言有不分故當此義以此教三六百劫之善並有漏有相故也次無相即初三家以無量為無相故也其言通而不辨故只成此義以此教萬事皆幻化故次家無中含有空中有假有假即是恒沙佛法故當此教之義並他等者結是非也他經或謂即前四時今謂只是前之三教也既只是三不能發起圓妙不是佛意故非此序此序之義如次正釋。",
        "translation": "The above is a specific explanation of what's being refuted, and the following is a summary of what's right and wrong, with a label for the explanation, a label for the explanation, saying that the teachers are the first six, and one type is the last three, and that the explanation binds the first six together into only three meanings in order to explain the former partial one meaning.",
        "source": "X29n0596_008:0337b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上來所述並是舊來極聲名手爾矣然以次嘉祥釋亦先述前諸家解也次自釋云今明無量義者凡有二種一者實相之體不可限量謂體無量二者從實相一法出一切教謂無量此之體用並有深致所以故稱為義如彼經說始從華嚴之會終竟法華前集若大若小世間一切法教皆從無相一法所出生也次釋教菩薩法佛所護念(云云)次明為序之義云問欲說法華何故前說無量義經答法華會一切乘同入一乘今將明收入故前明出生以從一法生一切法故一切法還歸一法所以將辨收入前明出生是故前說出生為收入之序下廣問答料簡極為繁碎非文正要又全不用論釋若慈恩云名無量等三句是所說大乘經之別名正法華中唯有二句論牒經有十七名(云云)次引論釋已後云其論不唯取所生教理名為無量無量之體即真智境體能成就成就彼字義故次依論釋餘十六名後問答料簡前後皆名名蓮華之同異已而結判云彼無量義經唯以二義名為無量一法二義論云成就字義故字者教法義者所詮即經所云說法無量義亦無量即二義也(云云)今謂古今諸釋雖多盛者不過前六及向二者然說彼經本為此經作序故佛自唱名委釋其義勢數永異餘經謂舉一法出生無量義之一字通於能所不然名收體不盡理與文相乖前初三字但得所生之名仍將能義以釋所名之與序義俱不成次二家亦直從所生之義為名仍將正義以釋序故序正二義皆並不成第三一家雖具能所二義而將含義以釋生故當體及序亦不成立嘉祥雖明體用所以名而以能所同名為無量又不能即名而顯序而更標外建立為序之義博而寘要體用安在慈恩雖亦約於體用依論依經廣釋而亦不於此名之上顯為序之義若依論至時成就以明先說之意而於佛先廣釋其名集者牒置此經之首其意終未可會於次正釋之中其義自彰不繁多述而於此宗中有先輩學者引文約義建立此經論所為名謂彼經具說能生之無相理及所生之無量法而約所生之法以立經名約能生之理以彰觀道故經今觀察一切諸法性相空寂等也又云所以從所以為名者顯能生之功也今謂此人順情背義違經乖疏強破古人還為所破覩為不可觀於先釋豈徒其一咸共如此不知其所以然幸宗此者宜熟詳之無為造次舊解竟。",
        "translation": "The above is also a handful of the old terminology, but the next Jiaxiang's interpretation also begins with the previous scholars' interpretations. The next explanation is that there are two kinds of people who now understand the meaning of immeasurable: one, the essence of reality is unlimited, which means the essence is immeasurable; two, from the reality of one thing, all teachings are produced, which means immeasurable.",
        "source": "X29n0596_008:0337b14_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "自下是第二正釋於中有二初正釋後因釋序明舊釋正之謬初正釋中自復有二初會通論解次依經正釋既有經論所釋故須依約今古諸義或依或不不則不可依須會要今文所釋於斯二途取其中適後學宜善詳之於此二文各有其二初文二者先會論釋名次申論為序言法華異名者宗有先達破此文云准論並以為無量義之異名今乃以法華之異名此全乖論文義既然無勞消釋章安之筆誤也今謂此人不達論之深旨又不達疏之遠意此乃是自誤何關於他於次釋之自見初會論中文雖三句義但為二初二句通會次一句別會所以然者無量義經通名大乘別有十七法華亦通名大乘固當有十七二者序尚得有十七況正而不然耶所以更別會者正緣論以法華為彼十七別中之一故無量義任自是法華之別一彼若不然此則不得正以彼然故此自爾勢數自然非人強立不達此數便謂不當何其昧哉所言十七名者論云此大乘修多羅有十七種名顯示甚深功德應知一名無量義二名最勝經三名大方廣四名教菩薩法五名佛所護念六名一切諸佛祕密法七名一切諸佛之藏八名一切諸佛祕密處九名能生一切諸佛十名一切諸佛之道場十一名一切佛所轉法輪十二名一切諸佛堅固舍利十三名一切諸佛大巧方便十四名說一乘十五名第一義住十六名妙法蓮華十七名法門有說云最上法門此十七也論釋云無量義者成就字義故以此法門說彼甚深妙境界者諸佛如來最勝境界故論中所釋直盡於此應知論中此釋與經佛自所釋同異如何古今不明今應辨之(云云)論又約總別判云此十七句法門者是總餘句是別今謂若望大乘句此十七俱是別論意即於別中自論總別故云爾也又應知旁正無量義是其宗主餘是旁義故又若既為宗主正應為總餘是別義思之已不彼略然彼經中但有一名更無餘名應知三義一者義故二者或此本略餘本具故三者准例例如勝鬘經一卷而有十六名亦一總十五是別故古人但呼為十五況此經聚一化教門故義有其十七此經有其三名然釋此通別應以多方乃盡其勢大為二初通次別且初通中應有其五謂何故會何故通何者十七經既不列論據何義知有十七論解彼經有十七名今何以知並為此經之異名此是通中五義次三已如前初二思之思之。",
        "translation": "The first is the second correct interpretation, of which there are two. The first is the correct interpretation, the second is the interpretation based on the sūtras, the second is the correct interpretation based on the sūtras, and the first is the interpretation based on the sūtras.",
        "source": "X29n0596_008:0338a06_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次論別者且明二義何故更此別會論據何義得以正名為序之別名今以何義得以序別為正異名所以更別會者由論以此一名為彼別名故須別會然二名既別為序為正名別體異據何道理彼此互為古今釋會乃有多途不能具述今一宗所明有異於彼然此學中亦自不同既未會文旨亦不能更述今且先明論意者論釋蓮華二義一出水義二華開義出水有二義一出水義以不可盡出離小乘泥濁水故復有義蓮華出水喻諸聲聞入如來大眾中坐如諸菩薩坐蓮華上聞說無上智慧清淨境界得證如來深密藏故二華開者眾生於大乘中其心怯弱不能生信是故開示諸佛如來淨妙法身令生信心故論釋法華盡只如此慈恩釋云論有二釋一出水義以所詮義名華二華開義以能詮教名華即證智甚深阿含甚深也初出水有二義一出水不可盡出離小乘泥濁水故此法華體頓悟菩薩性離泥水法體性常故不可盡此即二乘未迴心前談一乘理性出於二乘故名出水二復有義下乃至深密藏者此意說言菩薩既聞說證入聲聞迴心以者亦得入得聞亦證密藏前解菩薩頓悟體出此解漸悟後時同出正以教理化諸菩薩旁化二乘故作此說華開義者眾生於大乘中起懸崖想心怯弱故不能生信開示如來清淨法身令生信故今謂此若名正以法喻而立而論但解喻以顯法不復更別釋於法今謂妙法既盡一切蓮華喻法義亦如之廣如玄義中釋今且言其極要但取其清淨一義經論皆多爾故而有二種謂性以相性者謂染而不染本性常清淨故論云出水以不可盡即性常清淨也此即經中能生一切相名實相也所言相者謂相清淨即達解性而修證也會於本性事理離染名相清淨要盡於此論中所明不出於此而分為二者初別約三乘釋二義次通約一切釋二義何以知者初有小乘菩薩之言故次直言眾生故所以爾者正明性相平等約緣故有通別謂序正也初是前經密表之意次是後經顯露之意初中更有二者初通明性淨而菩薩聞已即得相淨故云出離小乘小乘即二乘也即前經聞悟圓者也雖菩薩已悟而二乘未得相淨而密表其當得故云聲聞如菩薩此二正是前經當分為益密表為後序之義也次華開者即開權顯實之義正明說彼經已一切性相皆悉清淨正說之義明矣又正顯性常清淨故云出水以不可盡即前所說無相謂無生死涅槃一切空寂無大無小等此是通談本性清淨即夫人性染而不染等也菩薩聞說即得悟證故云出離二乘泥水此即菩薩於彼聞性淨已得相清淨也而二乘未得密以表其當得故云復有義等此二並屬前經正及序義也既有密表序故有正開顯示令一切眾皆得信解悟入性相一切悉皆清淨也彼經有如是義與法華同論從此要故為異名而作是釋諸釋雖廣未契其要今意略爾論為異名義既如是今以何義復以彼為此異名宗中說音不同不能更述今先曲辨次乃直明初應四義一者能生無量之一義二者所生無量中一義三者密表無量當入於一義四者顯會無量已入於一義彼經正及為序有此四義與此不別故得為此之異名矣若直例後曲有四義則前明蓮華亦應有四謂性本常淨故相待相淨故有前所表當得相淨故於後已得顯露清淨故若直而要言只是二淨故直明二義而含於三收一切盡依論合義又會經意即足故不必在於曲矣思之思之然應知兩經皆有同有異各且取其同邊應知更有不同之義不得一向如前出入密顯為序正義矣會論異名之意如是豈造次者能知而云誤者何自誤之甚也到此。",
        "translation": "The second explanation is to explain the two meanings and why this is a different explanation. The explanation is to explain the two meanings of the lotus, one is to emit water, and the other is to emit water. The first meaning is that the lotus emits water because it's inexhaustible, and the other meaning is that the śrāvakas enter the masses of the Tathāgata and sit like bodhisattvas on the lotus and hear and teach about the pure state of unsurpassed wisdom and attain the realization of the Tathāgata's profound and mysterious store.",
        "source": "X29n0596_008:0338b23_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上來是約會論釋名已竟自下是次會論明為序之義彼經要有二義謂立其名義及以為序義向會已論釋名義音故今更論為序之義然論既以此為欲說法華時至成就故即為序之義既互為異名則體是一更有何義而得為序故今申之然應知兩經有同有異同故互為異名異故為序為正不得一向故已向明同今更明異彰其為序之義於中先申論以異名為序義次會經同名亦為序義初云申論意者申通論家為序之意義也如下是也言直說等者宗中先學又破此文云經云佛說此經已而入此定此則具足說經體訖方入此定而云直說此名而入此定違背經文特甚皆章安之筆誤今謂言未及言謂之躁既不能有次知當須困學既不能困學且應初言經文委悉疏文逕廷不能通會又不能自知違經乖疏而輙謂先釋誤違何其躁歟何其謬歟學者於此文能不謬者窂矣宜其宜其慎諸慎諸言直說此名者即對前十七名中直說此一名義也於此一名之中復含二義謂出生收入而佛直說出生之名密表收入之義定名亦爾故云爾也也何故但此名者名便故義足故總攝故(云云)而言說者答釋也謂問答解釋無量義名之義也其經命旨大莊嚴菩薩請問如來何等法門能令菩薩疾成無上菩提佛言有一法門若能修行則能疾得其又請云是法門者號字何等其義云何云何修行此有三問佛具答之先答其名次超答其修後廣答其義初答名云是一法門名無量義次答修云修學無量義者應當觀察一切諸法自本來今性相空寂無大無小無生無滅非動非不動不進不退猶如虗空無有二法而諸眾生悉於此理起種種見造諸惡業輪六迴趣受諸苦毒菩薩諦觀是已生憐愍心將欲救拔又復深入一切諸法又觀諸法性相差別種種不同如是觀已而入眾生諸根性欲性欲無量故說法無量說法無量義亦無量下是廣答其義即正釋其名也無量義者從一法生其一法者即無相也如是無相無相不相不相無相名為實相菩薩安住如是真實相已所發慈悲明諦不虗真能拔苦說法與樂菩薩若能如是修一法門無量義者必得疾成無上菩提以下大莊嚴廣陳疑問佛廣答釋到此乃至得十功德並廣顯成前說無量義名之義則此一經正說始終只是解釋答其所問名義顯勢特異餘經故言直說此經而入此定此人迷此說之一字之義致令不收曉入序正之義哀哉哀哉前明密表及彼顯說收入故為正今取當時顯說出生兼密表義故為序稱為說法華時至即此義矣。",
        "translation": "Since the above was about the completion of the explanation of the name of the Sutra, the next is the second explanation of the meaning of preface. The essence of the Sutra has two meanings, namely, to establish its name and to use it as a preface, to explain the name and its meaning to the assembly, to explain the name and its sound, and now to discuss its meaning as a preface.",
        "source": "X29n0596_008:0339b13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上會論已異名為序義竟下是會經所說同名亦為序義意明異同俱得為序又前初會釋名中有通有別今明為序中亦有別通即前通別之兩意矣思之思之異名為序其意易知如何亦得為序異名則具解釋其義非直名異其義亦異故得同為序同名直標其名而已不論其義故亦得為序故文前則云說後直云唱所以各在一言之中不體斯旨以為文誤何其昧哉於中有二初舉前後三經以為類次舉當經今古以明同初中三經序中唱名具在彼文不能更述言無妨者唱與說異因先唱名後得說義序正之義善成故無妨也次舉當經以明同者復舉無量義者意明同異之名並皆得為序也言與論意同者論意同異俱得為序異說同唱故俱得也。",
        "translation": "After the above explanation of the meaning of synonym as preface, the following is the meaning of synonym as preface as explained in the sutra, which means that both similarities and differences can be regarded as preface.",
        "source": "X29n0596_008:0340a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上是會論釋名及明為序義訖以下是次依經正釋彼名及為序義於中亦二先述經自釋次釋經之義初中有標正述標者謂依案彼經中佛自解釋此名也經中佛自解釋此名其悉論中直略覽要義以釋不消佛自解釋之文故今於前通會論已更別依佛正釋雖有經論兩釋古今機行未見其會今輙先消疏文後更會通論釋欲於二文無偏滯矣於次更述經釋之中初有一句是牒名以標宗次有四句是釋其義初者正緣經中佛先答其名竟次答解釋其義將釋故先牒來也從一法生者正標其義宗然此名既正從二義以得則此標應云謂無量法從一法生如此方與下釋義會而釋出經者從簡直述云爾也言雖偏一義常具二不然則難通會即雙標二章下有四句是別釋二義初二句是釋能生之一義後二句是釋所生之無量義初中經云其一法者即無如是相也必是無相無相不相不相無相名為實相初一句牒上所標能生一法以標出其體次三句牒上標體釋出其義後一句結示其名體矣今文以即字為所謂從釋義便故次釋三中但牒一句從省要故下一句結示名體若例前體勢亦應云如是無相名為實相此亦經文從簡便故從此以下二句是釋其所生之無量也亦有標釋此中文略闕為序義其義如次釋中自見。",
        "translation": "The above is the explanation of the names of the sutras and their meanings as a sequence, and the following is the correct interpretation of the names of the sutras and their meanings as a sequence based on the scriptures. There are two ways to begin with: first, the explanation of the scriptures themselves, and then the explanation of the scriptures' meanings.",
        "source": "X29n0596_008:0340a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今釋以下是次釋經所釋之義文也於中有三釋名為序總結初中有三初釋能生一法義二法以下是所生無量義此等以下是結其義以會其名及釋義字之義向述經釋能生中有標釋結今但釋前釋結二也前經釋中文有三句今文亦有三句但共釋前經中中間一句雖於文但一句於義而即收盡二句之義甚簡便也初正言無也下言不者亦是無也故下釋云涅槃亦無也此經四字即二重能所大經云第一義空者不見空與不空即生死涅槃二邊之相皆無故並言不見無此二邊之相即無一切諸相故名無相故經二句只是二邊之義今釋上一句即收下句之義此由譯者未盡其巧故有二句今盡其要故一備矣結為實相者即是無二之處是本有之真物故名實相即無相之當體也無相對所以得名實相當體以受稱而注者云無相不相者無所不相不相無相者不可而相名為實相者無所不相所謂非無不可而相所謂非有非無而無非有而有此實相之名也今觀其所釋乃是表而非遮及結乃為遮表遞而未善今文直雙遮二邊結明中道則直而盡矣次釋經中所生之無量義即前三科即是無量之法經先明菩薩通達無相一法已觀無量機說無量法名為無量義次明如來自證一無相法隨機說無量法四十餘年未顯真實有此二三四差別故是無量義也於中初標二名次別示二文及義易知次三但標數次四直列名並易知二法通指前之四時四時之化法門雖多總貫而言二而已矣舉二則攝餘六八方盡矣華嚴方等並是經中自言三藏之言經雖無此名而其義實具在文矣文中既明說諦緣度三乘之義明矣又明諦緣度及甚深空理則偏圓之義彰矣又明聞已而得四種利益則四果之證明矣初二並言一切者正明無量義也所生差別雖多不出此二有此二即具有八八攝一切差別故言一切即是無量義矣然初雖言頓而部中具談一切差別之化故攝一切三即約因四即就果雖是菩薩對聞吾證其益故並為果此二並是攝漸中之法故不復更言一切若言並具一切言而無體故不應也若言所中亦具能所者乖宗旨矣故經釋一法云無大小也前云皆為一實而作等或曰經中華嚴之言乃在方等般若之後今何得以為初今謂不然經中說始從昔至今分為三時謂初中後說皆含大小頓漸二法聞已得益亦爾無定前後今為釋其二義故先言頓後言漸非謂局定初時則乖文義嘉祥亦云漸頓二法頓亦指華嚴也或曰經云三法四果二道依注者云三謂三乘之法四謂聲聞四果二謂四果各有向得今之所釋非直名義與彼不同亦乃次第與經顛倒如何會通今謂此正釋無量義通騰今日以前始末三時之化及以得益差別以彰無量義之相狀若直如彼所解乃漸中之微分而已何足以顯無量義之體相是以依經文義謂須作如是名義解釋以是意義復須作是次第如是方盡經之微旨故經云如來說法眾生根性法門解脫三事皆不可思議豈可定作是說乃是思議之解豈不思議幸去恒情以順無方之道乃為無量義矣。",
        "translation": "The following explanation is the second explanation of the meaning of the explanation in the sutra. There are three explanations in the sutra called the summary of the sequence. The first explanation is the meaning of the one dharma that arises, the second dharma that follows is the meaning of the immeasurable that arises, and the following is the conclusion of its meaning in order to meet the meaning of its name and the word meaning of the explanation. The explanation in the previous sutra had three sentences, and the present text also has three sentences.",
        "source": "X29n0596_008:0340b21_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下是第三結義會名兼釋義字之義言此等者結指向所釋所生三科之義歸無量名三科遍該四時橫竪差別化益故是無量此明依此體而立此名實相等者結前所釋能生一法之義會歸義字之名亦指此體上立此名也雖俱體名初是當體後是功用也(云云)正明從合此二為名故云無量義矣問何故義乃先能後所名則先所後能答義則顯談昔日從一出多名則密表後當收多入一名義互彰為序之意於是在矣思之思之於次釋中自顯或曰據經所釋義屬所生無量古今皆爾今乃以為能生之一無乃違經背眾信其可乎宗本此下闕今總觀古今諸釋皆以義字屬所唯嘉祥所解有異諸釋謂義字通於二處此不違經文道理亦通微近此宗但以能所通名無量則為未可而此宗學者莫不皆云義字屬所生無量處字方屬於能生故經名無量處字入定乃言處則此中未應置處言或云取後處字置此中今謂此並乖背文義都為不可今謂義字實通於能所何者前經云說法無量義亦無量後經云諸法實相義又云助發實相義據此二文義固通矣又據論釋義通二就文約義理固通二就立不名意去通從別義字別當能生其故然耶名不盡其實故體則有二名但召一故不可矣佛先唱其名次委釋其義使物知名體出入皆具二義正序但成若但從一失其二義故不可矣滯情日積更類以實之例如常無常皆有其義生滅是無常義不生不滅是常義彼亦能所義通兩向以常義為無常義正謂是無常之義非謂直是無常義矣義者所以也由致也豈生滅而能生滅哉正由不生不滅而能致矣故以不為之矣今此亦爾正謂於昔即是無量所從出處之義密表故當會歸入於一處之義若於已說法華經竟全表顯露已會入一義處故以名矣所以能無量者豈無量而能致哉正由非而能致正明一無能為無量之所以故之義矣若對無量則之義處若於實相則即義處此義即處豈容強分二義者又義者境也正當彼所依之處故義即處此則名實無差今昔相會正序之理盡於是矣何復加於此乎(云云)。",
        "translation": "The following is the third conclusion that combines the meaning of the word meaning with the meaning of the explanation. These are the three sections of the explanation that refers to the three categories of meaning produced by the explanation that are attributed to the immeasurable name, the three sections that pervade the four seasons, the horizontal and vertical distinctions, and the transformation benefits that are therefore immeasurable.",
        "source": "X29n0596_008:0341b02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上來是釋名竟下是第二明為序義釋名本為彰序故前已名竟故下正明為序於中有三謂法喻合名義如是復以何義而得為序故釋之云爾不從一出無由收會故敘從一出為收入之由敘次喻中四句初一喻佛次一喻昔自一而多次一喻後會多歸一後一句喻今無量可知(云云)從一下合有三句合於前三可知謂無量義敘此開合故為序也(云云)。",
        "translation": "After the above explanation of the name, the next is the second explanation of the meaning of preface. The explanation of the name was originally intended to clarify the preface, so the previous name was completed, so the next is the correct explanation of the preface. There are three of them, namely, the combination of words and metaphors.",
        "source": "X29n0596_008:0341c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此等者總結會也謂如前消釋若經若論一一皆有立名為序之義故不乖違又密表顯露故不違前二若純顯露救故合此經注(云云)者意略如是思之上是依經釋竟下次會通論釋上然通談論意則爾而論中別釋無量義名則似全別如何不違古今並不會通今略言之大要而言在語雖異義不別也何者論云一名無量義者成就字義故以此法門說彼甚深妙境界法故甚深妙境界者諸佛如來最勝境界故論釋此名盡只如此今觀論之所釋文有三句義只是二而後傳傳釋之初一句通約教理釋字即教也義即理也謂無量教無量理也此約所生釋也次二句別約能生教理說即教也妙境即理也謂無相一實相也第三句重釋第二所生之理經言妙理不知何者故約此釋比即佛自所證得法即妙智所覺之法故是極甚深也所以先所者順經題也故知經題是從能所為名亦知先所徒能亦知義通兩處明序義故從通所明兩字而別從能以義是境是由是所依故故知義字別囑能生以此故知一切皆合無違背矣思之。",
        "translation": "Such a summary will also be interpreted as the preceding negative interpretation of sūtras and treatises, each of which has the meaning of establishing a name as a sequence, so there's no discrepancy and the dense expression reveals itself, so it doesn't contradict the previous two.",
        "source": "X29n0596_008:0341c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "到此上是正釋無量義名及以為序義竟下是因前序經所說及後流通之義以破舊釋中間正說之謬舊釋即光宅也應知此下盡是破光宅也以其偏計法華無常具如後文所出於中有二初引序通兩說責其釋中正說之非次破其難救所釋義初引前經明身常次引後經明國土常此明依正並常也初即前經序中大莊嚴菩薩歎佛之文於中有四偈半七言頌初三頌廣讚如來法身離一切相即文中所云百非洞遣也次三句讚佛報身文略不言次有三句讚應身即文中應為等也此明三身並常淨也以百非洞遣報智冥於法境感赴無窮故三並常淨也百非之言通語一切不應定其數實知之此即一無相身出無量身亦如一法出無量法也次觀經者彼經是後結要流通此法華經故彼名經云釋迦牟尼名毗盧遮那遍一切處其佛住處名常寂光常波羅蜜所攝成處我波羅蜜所安立處淨波羅蜜所滅有相處樂波羅蜜不住身心相處此明依正不二俱備四德次結責破之也前明從真起應即一身出無量身此明應即法身應無量身同入一身此則前後具皆並常豈得中間正宗而更無常例如首足雖美而身心則惡不名好人此亦如是序及流通既常而正說無常豈得稱為妙法又若況者前後正為中間中間為本方便尚常正而更無常故無此理言中間者對前後兩也言壽量者三世常也經云世間相者且常住況於如來本文自云常住不滅而云無常此乃公然抑毀佛豈謂抑揚至妙者哉此過莫大不可不破下是他難所破以救其宗他即光宅成其在時或後其徒有此難也遮拒於他申己所立也。",
        "translation": "Up to this point, this is the correct explanation of the immeasurable meaning of the name and the meaning of the sequence. The next point is to refute the fallacy of the correct explanation in the middle of the old explanation because of what the previous preface sūtra said and the meaning of the subsequent circulation. The old explanation is Guangzhai, and it should be understood that this is the end of the refutation of Guangzhai.",
        "source": "X29n0596_008:0342a16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "此下並反質勢也此難意者今將序以況正其將序以難正難云云明序已常正無常也次反難者其向將此所立之義以為難今還將其所立義以難之此正是光宅作此判涅槃經如大經疏意謂若爾者汝釋涅槃以初為開宗為序後即是廣談以釋成前宗之義不然不名開宗此有二失一違經文二自違背已義經文二段並明常故此雖難他反成自難此中未用結難次又例難者此亦是光宅判淨名經第一一卷並名為序第二間疾方名為正故也即呵阿難章云佛身無為不墮諸數無為即無始無數即無終此即序中已說常竟正說不復明常不明常者無其言故也此謬更甚不二明中道香積及菩薩明中道妙用此人意者推功唯大涅槃餘皆不然故也如此釋揚未為善矣未通涅槃之例破者其如初難無理遂逐瀁之今[囗@(恙-心+皿)]歛之不受其瀁也而加將淨名以為例便法華同於淨名我將同涅槃使其無逃刑之地其將淨名以瀁避過今專以大經以為固之下是結難若涅槃正猶明常則序正皆常法華亦爾何須迷惑而強為異根莫大之過哉此前兩番義含多勢當委出之(云云)非真法華淨名亦立或曰既三並明常豈有異乎曰可為此問曰若異不應並常不異不應三別曰此義並數已於前何更此或必亦更為分別序中顯明相待常密表絕待常法華正說絕待常後經流通絕待常也此之一釋雙融二或一切皆例之不在詞費。",
        "translation": "This is precisely the reason why Guangzhai made this ruling on the Nirvana Sutra as the commentary on the Mahāyāna Sutra implies that if you interpret the Nirvana Sutra first as opening the school as preface and then as extensive discourse in order to interpret the meaning of the former school, otherwise it is not called opening the school, there are two faults: one is contradicting the sūtras and the other is contradicting the meaning of the sutras that have already been explained; although this is difficult, the other becomes difficult; the next is the example of a difficulty: this is also the reason why Guangzhai's ruling on the Jingming Sutra's first volume is also called preface and the second is fast in order to be called correct; that is, he called the chapter on Ānanda saying that the Buddha's body is inactive and does not fall into the categories of inaction, beginninglessness, and numberlessness, and endlessness.",
        "source": "X29n0596_008:0342b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上釋無量義竟下是釋第二教菩薩法既是說大乘無量義經即是教菩薩之法若依論解即無量義之異名若約義釋只是美成無量義也論云四名教菩薩法者為他根熟菩薩隨順法器善成就故論釋直只如此此約所化簡機從入以得名也觀經文意直顯能被之法故今直從法釋更無別法只是前來名下之物故知別顯美無量出入之義處法也初句標示只是前法次釋有二義何者是義處法何故用此法化菩薩初釋出其法諦即實相至極之理理即主極之分故即義處是其法也此約已開會竟無量入一義處也後重牒來置於經初故作此別釋下釋第二意所以必用此法化菩薩者以本誓故詡本願故所引二文次第即此二意也應知義處此道佛道一也。",
        "translation": "After the above explanation of the meaning of immeasurable, the following is an explanation of the second teaching of the bodhisattva's teaching, since the scripture teaches the immeasurable meaning of the great vehicle, which is the teaching of the bodhisattva's teaching. If we interpret it according to the treatise, it's a synonym for the meaning of immeasurable, and if we interpret it according to its meaning, it's just a beautiful, immeasurable meaning.",
        "source": "X29n0596_008:0342c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下釋第三句依論即前異名依今所釋還是顯美成前名義論云五名佛所護念者以依佛如來有此法故論釋盡此論意明此是諸佛如來所有之法故也今文釋者正明即此無量義處是佛之所護念法也護念二義一者自行自證得故二者化他護念機緣故總此二義故名護念文中約此二義以釋先自次他皆有引證在文易見言久默者謂自證冥體故云久默言斯要者即說無量法所從一義處也若法華即開會義處也一攝無量故名為要務者趣也向也在昔不妄造次輙爾向物說之令其墮苦故上來約十二只共顯美無量義法則知餘之十四名義皆爾義皆通於密顯可以意得不俟更言。",
        "translation": "The next explanation of the third sentence relies on the treatise, which is the previous synonym, and the present explanation or manifestation of the former name. The treatise says that the five names are those that the Buddha guards because the Buddha Tathāgata has this Dharma, so the explanation exhausts the meaning of the treatise and explains that this is the Dharma that all buddha-tathāgatas possess. The present explanation is to explain that this infinite number of meanings is the Dharma that the Buddha guards and is mindful of.",
        "source": "X29n0596_008:0343a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下釋第二入定瑞經有四句謂時儀名狀時即結前是其時也依何方法故明儀也儀有其四其中一坐最勝分故(云云)所入何定故示其名入已何相故明其狀亦功用也疏文有四初意次第疑者以下次為序義身心以下三釋其文問答以下是四釋成瑞相之義今謂辨此中要應有其四五一者何故云入定二者先後三者還入四者於前五者不入於後今初意中釋明前三次為序中兼明後二初中先釋入定意即智以下釋先後意初中有標有釋古今釋此意蓋多今直標云相成者謂二互相資成顯不二也釋云非禪等者不寂不能照不照不能寂故餘文釋云慧無禪無以窮其照禪無慧無以極其寂故淨名以定呵身子慧呵目連即其義矣今為成前慧深復起於後說妙故入定矣今釋入定而言禪者有通有別別而言之則禪通定別圓通言之則互融矣今從圓通故云爾也入意如是先後之意如何即智以下是釋之也初句明體相即不無先無後下句明用自在故能先後無間礙矣以此亦即智體無出無入用能隨緣而言出入即第三意矣統而言之現瑞序中不過二物謂定慧也何者雨華動地眾喜放光皆因定力即定體用也故唯二矣下文自住度物亦以此之二也約法名定慧約喻則名身手誓願則言神力慧力佛之左右則身子目連文殊普賢觀音勢至皆定慧也此二不二即三物矣自利利人盡於此矣故唯論此二遍收一切為宗要矣思之嘉祥以為衣裓几案此違背甚矣思之思之。",
        "translation": "The next explanation of the second Ritual of Entering Concentration has four phrases, namely, the time and manner, the name and form, the time that precedes the conclusion, the method by which the manner is explained, and the manner in which there are four of them, one of which is sitting in the most excellent part, therefore (cloud) what concentration is entered, therefore its name is shown, and what aspect is entered, therefore its form is explained, and its function is also explained.",
        "source": "X29n0596_008:0343a23_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下是次釋為序之義兼釋後之二義初釋更入前定次釋不入後定初先設疑問可知釋中初明先入即為前作序故可解次明正為後經作序故還入矣文有標釋結標可知次反釋後順結皆可解若作以下是釋不言入法華之意若先說義經應須先入義定若次說妙經應次入妙定何故更入義定釋者若論道理次第正應爾也而今何故而不爾者下是釋其義也其義云何正以此定一名含於二義顯為前正密為後序詞不繁而意無不盡真可謂妙矣文中所明即釋密為序之義也仍先反釋後方順結謂若使明言妙定則大眾不甚驚疑眾既不甚驚疑則彌勒亦不慇懃既不慇懃則文殊亦無靳固無此三事則不能彰表於正說之法妙極不能今時眾致妙利益所以能彰能致者正由此名之功以此故知直言此名密為妙序豈不信哉靳固之事在後自見不俟於此繁文。",
        "translation": "The following is the second explanation of the meaning of preface and the two meanings of the latter explanation. The first explanation is to reenter the former concentration, and the second explanation is not to enter the latter concentration.",
        "source": "X29n0596_008:0343c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是第三消其文也文有四句略配如前今但釋後名相二句不釋前之二也所以不釋二者時義易知儀之義相仍在後文出定中釋出後明之於釋次二句中仍先釋相次釋其名後明為序之義初中相謂身心不動義由定力即彰此定之功用也釋此有三初一句總標其二不動之由謂身心與此定境法相應故即一實相也次有六句別釋於中初四句別釋所緣定境之相有釋有證次二句別釋能緣身心之相後一句總結皆由其所故致其能爾也身源即法身也心理即心之天性也同一天真為所住之方無二物也次證二者彼其二時入定此即初時之入定明名當別體狀是同其義亦然故以為證次二能緣相狀如是即身相心用攝相宜性同宜其體故也總結彰其由致可知次釋名者定法既通故須示其名也即體而用是從昔以為名若於今者即照而常寂收皈一也此名有通別文但釋別不釋通名舊云正心行處亦調直定亦云正定新云等持其義可知文中言世間者似剩此二字也又若準文及義次第應先釋此名句次釋不動接以明為序義故而今文似不次第也次明為序義者前約通明入定為序此是別約身心不動之義以明序也言運動分別等者前約所顯能此約能會所又前明已入今約未入之前與前不同又此即照用而寂之義表收諸皈一故當為序之義似從此義故不依前文義次第。",
        "translation": "The following is the third reason for eliminating the text. The text has four sentences that are briefly arranged as before. Now, we'll only explain the phase of the latter name, two sentences that don't explain the former two, so we won't explain the two. The meaning of the time is easy to understand, and the meaning of the manner is still explained later in the text when the concentration is produced.",
        "source": "X29n0596_008:0343c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次料簡說定二瑞是非之義古今所釋皆不以說定眾喜三為瑞相但取餘三唯光宅及今並取六以為瑞今釋二竟對餘不以為者釋之明並皆為瑞也初問先立為瑞之義寄異通是瑞相之義下明二非奇異故不得以為瑞也答中先別明二義後引文說總以顯明並為奇異皆是瑞相固不應言非而不以瑞也爾雅云肅肅敬也謂極恭敬之皃也形恭心敬特希聞後說也言凡情者凡人任情去取乖於聖道故也釋華瑞中前二瑞共通兩經故說法是正是序入定通為二序此下四瑞一向別為此經序矣於中經文六句義有其八句六可知仍有釋時之一餘六具解在文知之嘉祥云正是一雨時二所從三其四別(云云)義有八者一雨時二所從三其數四別位名五其色六所雨七通名華七散佛八及眾又於此八中但不釋時之一餘七具解在文知之嘉祥云正是四眾聞經悟一乘之時今謂此謬之甚矣於前於二俱不可有識者知之不可今謂說義經纔畢即入此定之時故後經文云佛說此經已即於法座上等明文在茲何為謬妄下之七義文自解釋於中有二初辨能表之華舊云以下次釋所表之法前二瑞共通兩經故說法是正是序入定通為二序此下四瑞一向別為此經序矣初有四義初翻名次引異名三總彰體用為妙四別明色數仍多初中古翻如此就色唯二約形故成四別其中二音摩訶故得有大小之別次翻異中亦爾祥云初二是白華後二是赤色又引河西道朗云並天華名也初二赤華次二白華釋初二云其色似赤而黃如青而紫如綠而紅次二白者其色鮮白無白能喻注經云初二如意大如意華次二柔軟華大音華也(今謂此應脫落或誤應云柔軟大柔軟亦音華大音華也)光宅云初二赤圓華小大後二白圓華小大此是嘉祥所述舊如此亦直依之無別判釋新云初二適意小大次二柔軟小大釋云適意者能令見者心適悅故此從用也柔輭者華體柔輭亦令見者三業皆調柔故此從體用為名上來翻名古今如此異者既是天上妙華固含多義各隨所取或取訛殊經辨翻名異初言意者即適意也文略二適字次言博響者博是廣博即響普響即前大音華也適意義也如前博響者謂此華最勝聲名廣聞故也舊本皆作博浦響有改作浦響者非美云妙者天華無量此為最勝無過故也體用無方如前所釋故為妙者非此妙物不能彰其妙法故也次明色數仍多者非直如前赤白二種乃更有其五也若此方尋常之五即五方之色也或以紫代於黑若如前朗師所譯即六色也白仍在後所以引此經者成前從二色開為四也不直言四五六但二而為四者為影所表如後自釋。",
        "translation": "In the next section, the explanation first specifies the meaning of the two rui and the meaning of right and wrong, and then cites the explanation in general to show that the two are not singular and therefore cannot be regarded as rui. In the answer, the first specifies the meaning of the two rui, and then cites the explanation in general to show that the singular are both rui and the characteristic of rui.",
        "source": "X29n0596_008:0344a17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上是釋能表之華名狀已竟下是次釋所表之法於中有三初述舊解今謂以下次辨舊未當今言以下是三正釋初述之中初明二四之所表表其以下一句明並華之所表初意正明約色有二所表故表於出處二名有小大二故表於四合以言之故是二已表於四法也所以二色次第爾者意明初二形服未變染法未深故次二反是初有男女之別故有大小次二亦爾次言因未果者以華之故言此四眾昔雖得果既未實果故但是因故以表之此前即有三義謂二四華所表之三法也。",
        "translation": "After the above explanation of the name and form of the flower that can be expressed, the following is a secondary explanation of the things that are expressed. There are three first explanations of the old understanding of the present meaning, followed by a discussion of the old and inappropriate present meaning, and the following are three correct explanations of the first explanation.",
        "source": "X29n0596_008:0344c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自下是次辨其未當於中有二初標其末次釋所以初標有二末謂狹與不明數所表之法不周故是狹明華所表非表昔是因故是不當即前三所表三義並未當也下釋二義皆各有結在文易見言直論等者謂若直論比丘等四故也言十六者謂四中一一皆有發赴等四彼直云比丘等四而無發赴等四故收不盡就三教權論故有四十八也此以其無約教義故況菩薩雜眾皆可以意達不可言顯次意若言報果等者其無此言言今假縱之設言如此故應雨果又儻言表昔因彰後果則應雙雨華實不應單雨華矣全云未契會正理故不當明矣祥云但雨四華者正表四眾以成佛也前之二華表出家二眾成佛後之二華表在家二眾以成佛為表於此故但雨四華初二是白華表二乘無漏成佛後二赤華表人天有漏苦久亦成佛皆先小後大者表修行從小以至大自淺以入深也今觀此釋正釋四華能表唯一四所表有二四也謂初四眾及次二乘人天也其華直言表成佛者理都未用並在向釋挾而不當云數內非直一二觀多所釋不出於文所責二過之數內矣得前要意無異能感(云云)。",
        "translation": "The following is the second explanation of their impropriety, in which there are two initial labels and two final explanations, the first labeling the two finalities, namely, narrow and unclear, and the fact that the number of things shown is not circumscribed, so it's narrow, and the three meanings shown by the flowers are not shown to have been the cause in the past and therefore improper. The following explanation of the two meanings has its own conclusion, which is easily seen in the text.",
        "source": "X29n0596_008:0344c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是今正釋於中有四初正釋次引證三釋疑四重簡顯初中復自有四初釋四華次釋天雨三釋散佛四釋及四眾初中因前舊義未當顯其正義言正義者正表昔三皆是偏因非是圓因顯今開顯皆同得入一圓因也文即為二初表昔三非中以相待圓因故但三偏言二乘者華極清淨此教菩薩猶未斷惑同於人天故但言二乘通是三乘因同斷故別中歷別次第不同前後故是獨菩薩法故並是偏非圓因也亦非一實妙因也三教若皆得果如前義經中四果義也今何故但言固相形說也如方便門之義也次下正顯是者所以華只一雨而能如此簡顯者鄙由雨此天華妙者故也直雨天華已是非情之表況加妙昔者形兼顯圓數自彰矣初對前非標是佛因者下是釋初言報者謂皆同得也佛是圓人自是同法借以表圓妙也天上妙華故表佛因此且總明天華所表未明別四之義下釋雖帶華義正是解其四所表也釋中總標別釋通結標者既表圓因而有四者因有四位即表四位因也輪即喻於四位謂銅銀金瑠璃輪也不出瓔珞經然有兩本一名菩薩瓔珞經文有十卷一名菩薩本業瓔珞經文有兩卷為其名同古人別之亦呼為小大瓔珞若從簡便直呼小本為本業經文中多用今向下引用直依此名知之今此即出少本是本業經也經中具明六輪於前四上更加摩尼水精二也即次第喻住行向地等妙六位也輪是表前體用之義即六位之體用也即通論因果也淺深不同故有其七六異即圓妙中不異而異矣彼經亦有鐵輪而釋中但明其六仍有多種六義文多未及具述今華雨四表因四位不論其果故但取其四也因中雖自有六為表真因兼顯餘義故不論其前後所以但真因者於昔已斷通惑不更令入似位也於下別釋四中即有四別於一一中皆有五義皆初一牒能表之華下四明所表之位法於所表位法之中皆初三會本業經所明後一會此經後文所說於彼三中皆初一是喻次二所喻法以彼經釋於六位約多種六以釋今略舉其三要應具出之(云云)次言性者性習二性聖教先後互出不定因性而習因習成性以故不定此約因習而成故也次言道者依彼經者能修中道通入聖性故也依此中意於三諦道融通轉深故也言聖性者能以三智三諦平等造極故名聖性開等四義如後委釋不須此論同喻因中四位此前白赤小大次第之義如前已釋但以圓為異也(云云)下通結者如此四輪彼以喻因四位故知今之四華正表於四位因與彼義同故知四華是表因之四位故此約二色四名次第義爾若先亦後白義似不便若依適意等四次第名兼可會之約四位釋四華也下釋從天而雨所表之義先出所表之法天有多種此今用世天表出世中道第一義天能表世天所表可知即圓妙因所依之處為表於此故從天雨中字釋天生字釋雨雨字音通二呼其義可知今正從去是降出義故以生字釋之由是等者相從以重釋也下釋散佛能所表之義散佛是能表趣果是所表佛是極果之人故表其當得也因所起處名義天因之終極義天之體名之為果果即妙覺本業名水精輪表其體用清淨妙極故及散大眾事是能表也此大眾之人感尅因果所表之法也尅者逐致得也然天雨以下三句諸釋雖暷言其所表而多約事解謂諸天為聞法而為供養故雖旁有此義非文正要故今文並所不論但語其要極也今總束之以彰其要者總前諸義不出三雙謂性修也因果也人法也自天而雨表依性以明修也而散於佛表因以趣果也因果是法大眾是人表此因果之法是此眾人之所感致也如此豈非要極此義不辨餘矣以為則古今所釋非要用矣或曰佛是人何得云法此寄妙人以影妙果法也應知散之一字義通二處故文初以趣釋次以感尅釋也如此之旨其為要也豈不信矣思之。",
        "translation": "Next, the present correct explanation has four meanings. First, the correct explanation, second, the introduction of the proof, third, the explanation of doubt, and fourth, the brief explanation of the junior high school, the four flowers, second, the sky rain, third, the scattering of the Buddha, fourth, and the four middle schools because the former old meaning has not yet been revealed as the correct meaning.",
        "source": "X29n0596_008:0345a20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下是次引此經三處文以證成前約四位以釋圓因四義正說之要既爾明知序瑞正表於茲不為是釋何以能會信矣言節節者謂三節也華嚴皆以四方表於四位今言遊於四方及四方踊出皆與彼同故真聖四位也其三文義並至文自顯。",
        "translation": "Next, he introduces three passages of the sutra to confirm the previous explanation of the four perfect causes and four correct explanations of the essence of the teaching. Since he clearly knows that the preface, the rays, and the correct expressions are here, how could this explanation not be interpreted and how could he come to believe in them?",
        "source": "X29n0596_008:0346a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下二番問答是三料簡釋通疑妨初問意者以彼本業經中次第不融餘文皆云明別位義此中開會正明圓位之義而用彼以為釋豈得相應似近而遠必須會釋故為此問答中[台*隹]雖極簡顯而理至幽微此舉劣況勝也言名通者即經所謂真聲聞真羅漢也經文略舉通別二名具足別四總應言也所以名真經文自釋此通前之兩教故云通義獨在圓故云義圓也通名劣而又別尚得會於圓理況別勝而名又同而義不得圓耶此中是序表仍且借名顯義若約開顯已案位即是汝等所行是菩薩道一切人法無不盡妙人天之名尚即是圓況於別名如大經疏所釋一切惡名皆即妙義況於別名者耶次問答者辨圓異別也向用別為圓今明仍有異於別也初舉別有問圓同不正以發同異也答中含二明雖同有而復有異同謂有賢有聖異謂更有四句同異合論則有六句其義相狀如前玄義已辨從來釋此仍三不同(云云)出之釋此應為三先玄義次舊釋後今意雖有此三四至二文並未通會今須略述玄文然後會通此義玄義第九因明因果漸圓之義而有兩重四句料簡初謂漸圓圓漸漸漸圓圓等非此中意不繁述次約六句以明賢聖謂單互重各二故成六句三十心雖同有賢聖之義而稱為賢伏多斷少故十地者名為聖伏少斷多故此單也又十住名賢聖二十心是聖賢此互也十地等覺是聖妙覺是聖聖此重也此是玄義所說不用前四諸釋不如次為六句且以為四會釋今謂若直依玄義文及先諸所釋亦以未能會通此中要旨然玄義既不全同於此而指彼者正令類例彼釋不即為同也若即彼者有二不可一者句數正當而名未便二者義亦不便以此正為用別顯圓也彼義不同於此故也既言今用彼句數轉借義勢顯此中令一切皆通遍無礙也何者一者賢二者聖三者賢聖四者聖賢五者聖聖六者賢賢初即十信次即初住以上至於妙覺三四二句即是三賢五即初地至於妙覺六即還是前初十信所以然者權實教門明位雖多大要不出賢聖二別今圓亦爾但標此二名體大要斯盡而三十心位當分即是賢家之聖又在別雖賢在圓即聖合二以論故名賢聖又體雖即圓名不癈別又對於後此聖亦名賢名體合論故名聖賢自地以上由來皆聖而復對前亦當分對他合論故名聖聖十信亦當分是賢又對彼聖賢合論此賢是彼聖賢之漸故名賢賢既有聖聖須有此句又准玄義既有漸圓圓圓故須有此賢賢句也若直通論唯初二句別彰一家釋圓教義故有彼之四句正由四句以表四句則三賢並名為聖故有中間二句既有中間二句故有後之二句故有四也并前為六此則通別一切文義皆通在此六句故指彼玄義令類例會通不得專因於彼若專用彼則十信不名為賢何殊別之教別教義何能顯於圓義彼玄文為明開顯故與此不全同可以附傍類例以顯於此故指於彼正以未全會此故從來所釋有三亦不全同於彼雖不全同彼又末結會於此故今用彼名數義約開合會顯此中之意則通別文義無所不通會矣思之思之更尋玄義位妙及四念處文。",
        "translation": "The next two questions and answers are three explanations that are brief, explain, and pass through doubts and hindrances. The first question is: is it possible that the rest of the sutra's explanation of the meaning of the distinctive stages is based on the fact that the meaning of the perfect stages is explained in the sequence of the original karma of the sutra, and that the opening and assembly of the sutra is to explain the meaning of the perfect stages, which seems near but must be explained because the answer to this question is [Tai * Troi], which, although extremely brief and obvious, is the most subtle in principle.",
        "source": "X29n0596_008:0346a19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "自下是彼重簡非顯是此由舊來有作此釋故更簡之文中三重一一皆有能所表能所各有二義可尋中復自有二謂出與未於此二中復各有三通中三人同一因故別中以菩薩語通雖簡二乘未簡次第故未出別下總結非以顯是如前說者如前四位因也文並無四釋者非無其義不欲繁文若言之總言能表所表即世界所表圓因果即為人從天而雨表中理即第一義圓位六句無方絕一切執即對治如此能表所表並妙非麤又表麤當成妙即教義本迹義例前後可知。",
        "translation": "The following is a summary of what's concise and what's not manifest here because there were interpretations made in the past that made the text even more concise. Each of the three levels in the text has an agent and a manifestation, and each of the agent and the manifestation has two meanings that can be found.",
        "source": "X29n0596_008:0347a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋天雨中即妙觀義亦例可知故不繁矣。",
        "translation": "The explanation of the meaning of marvelous contemplation in the rain of the gods is also an example that can be understood, so it's not too elaborate.",
        "source": "X29n0596_008:0347a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明地動瑞者准前次第前是表圓因此表當成圓果以是故前四此六若爾只應一二此既通因前亦應果然前云而散佛上故亦通果為雨華故且言為因為對前因故此言果義通意別且從別也經文二句而義有三疏文具釋文亦有三初述舊次辨非三正釋初舊意者正表於此經能所之義並在其中不繁言述也三人各執為實故云決定而實非實故也即述便以當牒故便云三六而言者文從省略仍述即以為牒起下難破之意正謂若如此解者也。",
        "translation": "The next explanation of the ground-shifting auspicious rays follows the preceding sequence. The preceding is indicative of the perfection of the manifestation and therefore indicative of the future perfection of the result.",
        "source": "X29n0596_008:0347a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是與而奪破之也所表之致未當且順其義故云與也與是三藏奪非通別未盡此瑞之意故也初約通中先標次釋標十雙標與奪釋中雖但釋奪義須釋與謂何以是藏而未通以藏人法三執各定異故又其不立更有後之二義故知只是初也次釋未者同謂體法二涅槃也意謂三法正習盡不盡也俱被破者並非真實故破不破者不知此同但言三異故也次以別奪之也初明彼不破次明今須破所以知不破者一者尚不知通況更知有此別方便二者此無三六之名其言三六故知定不破也次明今亦破既無三六將何以表所破之數又何所以而須破釋者雖無三人因果而有三法因果之義故表所破之數不闕以縱橫故違理乖教乖教者經云非縱橫故乖理者既縱既橫是麤非妙物故須破也言縱橫者依儒所釋南北縱東西橫即長廣也依一家義前後次第為縱一時具有為橫法身本有緣修般若福德解脫因時縱也心識之中含藏三法種子因時橫也先有法身次得般若後自為縛能令彼脫此果時縱也既得三物常同一處此果時橫也此亦並通教理非無方妙物並須破顯故動以表報之大經疏(云云)。",
        "translation": "The next is to discuss with and snatch and refute it; the expressed intention is not proper and it follows the meaning; therefore, it's called discussing with. First, it's about the general meaning, first labeling, second explaining, labeling, ten double labels, and snatching, although it's only explaining the meaning of snatching, it's necessary to explain with.",
        "source": "X29n0596_008:0347a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此前與奪破奪異釋竟自下是正釋也準諸聖教六動有三謂六時六處六相也六時謂入胎出生出家成道轉輪涅槃於此六時地為之動則六時事為動之緣也別八相中除其二也若六方者即六方互踊沒也若六相者即動踊等也此即三六動也今言即當時六中一謂轉法輪時也此時動者總明其四悉因緣也餘之二六文略義應具有若依證契大乘經亦有三動而數不同一言六動二言十二動三言十八動此即彼經三種動也但言有此三動而不辨其名相今輙言之若言六者且通言之謂說法時有六動也即彼二也次言十二者即次六方踊沒更互成十二也言十八者即六相中各有三種相也更撿經所表之義隨文自見今文釋中有三初通釋六動次別約六方釋六動三別約六相釋六動初是總後二是別文但言六義舍於二故有總別釋也初中依文有三次二既云本觀初一一文中當不言義即當初二義記云初似約教次似約因緣以文非的當故皆云似今直為二謂初正釋次引證也初有標釋標中初句總牒能表三事次表圓家下總標所表三法六番釋六破是釋動無明釋地非圓無六故云圓家六如彼說開此六番則為四十二位即破四十二品無明故大論云無明重數甚多故處處說破無明三昧舉四十二猶語大綱況直云破十障顯十真如縱加後二亦只十二因為未了故文云大白牛乘寶乘遊四方直至道場據此四文圓義六番明矣此之所釋古今絕矣無明下釋文有三句初別釋動地所以次別釋普佛地動之義後句別釋於六初所以動地表破無明者何也故釋之云爾初言盤薄者廣厚極牢固之皃也然無明之言有通有別若別言之三教昔來已破四住此則別語無明住地通而言之昔未破者全五住在總言無明即如十二緣中初無明是也今此具含五義即表當並開破之也何故而言普佛界動且就事者或云遍動此一佛土或引下文一切諸佛土等今謂不用強論通局但取動與光義可以齊矣文釋意者亦不易會此中結文雖通正意釋佛世界義非釋普與動也何者會此佛土修德究竟明淨如前釋崛山中所明眾崛生本有此明淨體迷之舉體全作無明暗穢之物今將為其開顯令其暗穢全即明淨故先動明淨之境表其當變而皆即是故先動以表之思之下釋其六義已如前可知下引證者此舉生時動地所表之意證今轉法輪時動表之生時尚爾況說法故云煩惱滅故而動故今所動表破無明信矣故云即此義也其中亦有能所能所中自他可知對下此中故當二釋謂初是教次是因緣今謂既是釋文證成道是二義不可別也何者初總標即世界次三別即對治第一義為人次第亦爾可知次證雖但滅惑顯理而亦總別四義即因緣也玄文一悉具四此中正當對治而即具四意也既並圓妙無方亦不定其次第矣此並圓絕待義即約教也次本迹中言密得此意者此謂文殊之意也文殊所引皆顯密二意若直引昔佛如是類以顯今亦然者顯也若昔佛將說表發之事既爾則知釋尊成道久遠往昔將說之時其事亦然此是文殊當時密有此意若能深達文殊此意則知引往顯今密表今往亦爾此是因顯以知密寄他以表本故云爾也前云別序有顯密兩意即此是矣此之一釋通彰六瑞皆爾不獨地動一也然釋六瑞而獨於此明本迹者表報因果破顯之義極於此故文具明三六之事最廣備故又欲寄中類顯前後不繁文故次觀行中文有標釋標文雖略亦含表及所表各三義也謂地六動者表觀行動破六根之執滯也地相下釋準此中義應云六根水執未曾悟入大乘之道猶如地相堅固今動難動等也今文爾者或隨便或不次思之動難動能表也淨未淨所表之義也此仍是事何謂觀行蓋是表當聞已得入真修六根清淨行也其有如上之意故注(云云)。",
        "translation": "The preceding and the refutation of the refutation of the different interpretations are, after all, the following correct interpretations: the standard holy teachings also have three six movements, which are the six times and six places and six phases; the six times are when the buddha enters the womb, is born, leaves home, attains enlightenment, turns the wheel, and nirvāṇa; the six times are when the earth moves, and the six phases are when things move, such as the three six movements; the eighteen are when each of the six phases moves, such as when the scriptures are revised; the present statement is that one of the six is when the wheel of the Dharma is turned; the present statement is that the four complete causes and conditions are explained in a general way; the remaining two six are the abbreviated meanings of the text.",
        "source": "X29n0596_008:0347b18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋六方動者前之一番四釋但是通釋六動未即出其六名體狀故此下二釋方是出也言六方者四方及中邊也出大品及大般若經此六更互則成十二故證契大乘經中呼為十二動也然此有何所表諸釋並皆不明不知序中用之何為縱如餘經所明但是通義未明別義又非此中之意經論雖則無文不可以無其義祥云六表六地當成佛也今謂此但得六十二十八並無義矣今文所釋一一皆明能所表報所中皆約圓妙方是此中之意此中並表時眾當得此益非為約觀行解幸請後學思之釋初六中先釋東西次餘四方初中先釋東西次釋踊沒於二文中復各有能表所表及各有其義在文可尋言生滅者即踊沒二字也既互踊沒故是互生滅也不然虗言何為次餘方者既以東西對眼鼻理以南北對耳舌中央意也四方身也身具四根意遍緣四故以對中邊也四方為能表四根為所表四方能所既爾踊沒如何即通得互生滅矣六方之義雖爾十二之義其復如何能表十二六方踊沒各六也所表十二即通得生滅各六也若准次文既表淨十八界此亦即表淨十二處並表根境當淨妙也亦須約通得互生滅不然無踊沒義也。",
        "translation": "The next explanation of the sixfold movement is that the previous four explanations only explain the six movements in general terms but don't reveal the essence of the six names, so the next two explanations of the sixfold movement are also explanations of the four directions and the middle and extremes that come out of the Mahāprajñāpāramitā-sūtra and the Mahāprajñāpāramitā-sūtra, which call these six mutually inclusive forms twelve.",
        "source": "X29n0596_008:0348b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋六根於中有三初標列六次明十八後合結能彰所初中新云動踊震擊吼爆擊即舊起爆即舊覺四同二異今文依舊釋云搖颺不安為動磷礱凹凸為踊或即六方踊沒名踊自下昇高為起新云有所打搏為擊隱隱出聲為震砰礚發響為吼令眾覺悟為覺新云出聲驚異為爆次十八者謂前六中一一更有三相謂動等也新云動等動等極動乃至覺亦如是次釋三動之義如文新云小動名動諸處遍動名等動遍大傾動名等極動餘皆準知今文極總但名六動準十八中之震動也此即以下是總結能以彰所表之法正以表此故一一中更有三也何為能淨之方即於一一境中皆即三諦三觀故即十八圓妙境觀其理要能盡於此矣彰有此意故注(云云)祥云大品就踊中開六則動等界各六成三十六今文略舉震動二也(云云)。",
        "translation": "Next, there are three interpretations of the six faculties in which the first one is labeled as six, the second one is eighteen, and the second one is a combination of energy, manifestation, and the third one is the new cloud moving, enthusiastic, shocking, roaring, striking, which is the old rising, and the second one is the old awakening, which is four times the same, and the second one is different. The present text relies on the old interpretation of the cloud, which is shaking, faltering, moving, phosphorus, convex, enthusiastic, or that is, the six directions, enthusiastic, which is called enthusiastic, rising, and the new cloud has a beating, which is a strike, a faint sound, which is a shock, a bang, a noise, which is a roar, which makes people awaken, and the new cloud has a startling sound, which is an awakening, and the second one is the explosion.",
        "source": "X29n0596_008:0348c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次眾喜瑞一往準理應在光瑞之後故頌中爾矣蓋有兩意若彰感應次第及通他土不欲繁文故須於此若通彰其由及為瑞之意則宜在後為此二義故二文不同思之思之祥云四眾即前四華所表也八部即動地所表六趣成佛也此意合二王也不言菩薩歡喜者自昔以來已說菩薩作佛故無瑞之所表所以不明菩薩今謂此人情迂碎之甚矣文有兩釋義有三初何者大眾何者心喜何者是瑞經文有二而有三義其中三眾謂四八二仍略菩薩此即大眾也歡喜以下即心喜也仍此心喜即是瑞義合此以為言故云爾或移此文向至此今謂前眾有三今舉初後中自可知矣簡而能備何俟強斯臆度(云云)初四中云優婆等者清信男清信女亦云清信士女言其在家而於佛法有清淨信心簡異前出家者也新云鄔波索迦鄔波近也迦云事也索是男聲斯是女聲以諸男女成就戒者堪可親近承事比丘尼眾故云近事男近事女次八部中前已釋者不論未者略釋夜叉舊云捷疾新云勇健近譯云藥叉此云威猛威力最勇健故亦云盡謂能吞噉盡所食故仍略不言羅剎此並北方所以官理應在故具言羅剎娑此云暴惡亦云可畏其義可知摩睺羅者此云大膓行神即大蠎蛇之類也新云莫呼洛伽所譯名與舊同言人非人等者舊云總結前二四眾是人八部非人也有云八部鬼神本悉非人而變作人形來聽說法故此云也然依舍利弗問經更有別義出之(云云)下明二王者具如前文所敘無量義中數也。",
        "translation": "The second aspect of the joy of the many is that the principle of continuity should be expressed after the light and shine, so the verse should be carried out in two ways. There are two meanings, namely, if the principle of continuity of the sense faculties and the understanding of other lands is not to be complicated, then it should be here, and if the principle of continuity of the sense faculties and the understanding of shine should be later.",
        "source": "X29n0596_008:0348c24_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "正明心喜者祥云合掌表形無異用一心明意無他緣天喜敬交集實含渴仰之情異瑞並興疑有非常之說也今謂得未曾有者總語得值非常瑞也喜之由也合掌者形生非常之恭也一心者心起非常之敬也觀佛者渴仰非常之應也即此表發當於妙說同成一乘三德也何者大眾何者心喜何者是瑞經文有二而有三義其中三眾謂四八二仍略菩薩此即大眾也歡喜以下即心也仍此心喜即是瑞義合此以言故云爾也剩者大眾何者心喜何者是瑞經有二而有三義其中三眾謂四八二仍略菩薩即大眾也歡喜以下即喜也仍此心喜即是瑞義合此以言故云爾也文有兩釋初因緣中有人於此明四悉義初內外異是世界問答除疑是對治非常之喜是為人一心觀佛第一義今問問答是誰便為經家三意此至易而尚爾況於難者而可信耶今謂初是因緣次問答釋成瑞義初明能表有由有結且從別說故云華地甘露即妙教妙理也忻是心踊是形也上能表之喜望下所表仍屬世簡寄世明出世即世界意下所表中雖乃一言即含三義大機發即表大善生大惡滅大理顯此即三德正當三悉義也感勝應即具三德之人能令三大開發者也此即四義何俟謬妄次釋成者以諸家皆不以三為瑞此其一也前已釋破其二非昔此因更釋以明皆是瑞也言人常情者夫瑞固是非常之事此乃世間尋常情事何得之為瑞儒家明情有六或七喜怒乃其中二故云爾也正取其喜怒乃相從來耳答中明喜之由非常喜事非常非常之喜以下結責不得言非以由非常故故喜喜非常喜非常故表當得聞非常之法獲非常之利此固妙當瑞相之義如何反以為非故不應爾言昔雖有者謂昔說三教之前縱有而不為也故文云四眾歡喜身意快然得未曾有也而今等者釋為瑞也即大機將所發也下約教者辨差會也有此四別即差也應知於此四中皆有能所又知今昔若於今經皆動實相心表當同聞一圓妙也既言實相那復言動約心機說非謂證體(云云)本觀並略可以例知。",
        "translation": "The correct explanation is that Xiang Yun joins his palms to show that there is no difference in form, and that one mind clarifies that there are no other conditions for the gods, that joy and respect intersect, that the mind really contains feelings of longing and admiration, that other rays are accompanied by doubts, that there is an extraordinary explanation, and that the reason for joy is that the joining of palms gives rise to extraordinary respect in form, that one mind gives rise to extraordinary respect in mind, and that longing and admiration for the Buddha is an extraordinary response, that is, this statement will lead to the accomplishment of the three virtues of the One Vehicle in the same way as the marvelous explanation.",
        "source": "X29n0596_008:0349b02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋第六放光瑞他云文為三一放光二照境三所見今約文且略為二一放光二所照然所照義雖通此文即屬他土故不得為二於後自見經文有五謂時人放處名此五也要唯在四謂時人放光四也時者祥云放光之時也今謂即正入在定之時也亦即與雨華地動俱時也佛即能放之人也放即適機而舒作也眉間以下即所放之光也文釋有二初釋放光舊云以下次釋其文分齊初中有二初略標大意次正解釋初中記云應機標因緣設教標約教破惑下明二事之意也現光本表斯二具二方除疑惑今謂上牒能表下明所表意應機即放所表之意也設教即光所表之意也下四字是明表教之利用即光之義也光有二義一能破暗二能顯示於物破暗即破惑令物生解也示物實見即令物除疑生信也而意正是破權顯實令物得妙信解盡於是矣機即前感是也。",
        "translation": "The second explanation of the sixth release of light is that the text of the Ritual of the Clouds is three: one releases the light, two illuminates the object, and three is seen. The present explanation of the text is briefly divided into two: one releases the light, two illuminates, but although the meaning of illuminates is shared with this text, it refers to other lands and therefore cannot be two.",
        "source": "X29n0596_008:0349c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "白毫下是次正釋經文除時以外都唯有三義文釋有四初正釋放光次明所放不同三明不收之意若丈六下四釋能放之人差別即兼釋佛字也初中有二初因緣次約教初因緣中有三先釋能表之毫毫在以下次釋所表之法三總明所表之意初中先總標具德次釋出之初具眾德如下所釋而言眉者祥云放光之處也今謂此屬白毫之所在處非關放光之處也言眉間者有云眉者媚也謂面首之媚也表所說勝是大乘之宗媚也今謂眉是二邊今簡邊顯中若便為表宗媚何為更復說於中間宜幸思之次釋略舉三事以明種種也初中諸釋皆云太子時樹下時長一丈四尺五寸成佛已長一丈五尺並不言其所表此蓋通釋其體狀下是別釋其白相也白毫相者簡顯也簡餘顯此此是如來三十二相之中一相故云相也即第三十相也毫者長毛也南山云奇毛也經亦作毫取即英毫之義即毛中最奇異也俱得而本正作毫也云有十楞現中外俱通放之圓卷如秋月滿晈淨分明色映珂雪圓如三寸經中或言右旋宛轉如日正中又如此經下文及以觀經所明(云云)次下一釋是總釋其功德文舉其三即攝一切蓋一乘因果功德也此相之狀如後所釋又初明體狀即釋毫也次即釋其白也三是總釋其德用前標言種種功德此其義矣上是釋能表竟下是別彰其所表也約四德以明之即表當所說教詮四德之義也一一皆先舉其能之義次彰其所表之法也中無始終故常柔軟無不稱適故樂。",
        "translation": "The white tuft of hair is the second correct interpretation of the sūtras except for the time, which has only three meanings. There are four interpretations of the text. First, the correct interpretation is to emit light, then to explain the difference between what's emitted and the third is to explain the meaning of not accepting.",
        "source": "X29n0596_008:0350a06_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上是別釋白毫相竟此下是通釋放此中光及照二土之義於此二中亦各有表及所表也所以放此中光者中簡二邊光能破暗表當說中道之教令物發生中道妙境智慧之光明也然此文有三異一能中但言光所中則言中二者放光二義破暗顯物破暗表破無明顯物表顯智明今文能所各但一者互舉耳又中道二字須通兩處也如向所釋文但舉一亦影略矣此三異須善思之次所照二中以是自他所王之境故表於此即表當說此中道教令物於中覺自他故為此故放此中光照二土也此前既是因緣為四悉者記云初是世界其毫下為人放光對治光照下第一義雖此屬對並未明其義今謂初釋能表亦即具四以望所表故當世界次所表四德並所詮妙德故即為人三正顯中境智故第一義四令破二闇獲於二覺故是對治以是能所自證用利自他故次第微漸異尋常又彰圓妙故也次約教中具明四教而即簡前三有無及具不具以顯成圓義有而具也要而言之所以放此妙正為簡偏顯圓故也初二即前兩教以此二教不詮中道二故皆先約所者明於此能表此正在圓故也別雖詮中而橫竪不融故非所表今特舉此中毫光者正以顯於圓矣準此釋勢數前初釋白毫次是釋此光照後約教是釋眉間不然難會思之。",
        "translation": "The above is a specific explanation of the end of the white tuft of hair, and the following is a general explanation of the meaning of releasing this middle light and illuminating the two lands, where each of the two also has a table and a manifestation.",
        "source": "X29n0596_008:0350b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上釋放光訖次明所放不同只是顯成此中之意舉此三者其意有三一者意表三密之利用也大品即身大經面門是口此經定中又眉間故即意也二者大品表行般若為萬行之本從因至極故放多光又從足以至頂大經表會五時之教故從口放五色之光(云云)此經正表中道實相之理故放眉間毫光三者是表三德教大品般若教大經解脫教此經法身教初以互具三故次下二亦爾故三德亦爾緣亘作此別所表是同也此三意中一一皆有九義以互具故正以此故特舉此三也以下一句釋其異意者既所表皆同何故此異以緣亘故事有此別所表之意同也應知般若約不共說(云云)。",
        "translation": "The above explanation of releasing the light is followed by an explanation of the difference between what is released and what is revealed as the meaning of these three. The meaning of these three is threefold. First, the intention is to express the utilization of the three mysteries, namely, the body, the face of the great scripture, the entrance to the mouth, the concentration in the scripture, and the space between the eyebrows.",
        "source": "X29n0596_008:0350c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下明收光意者放必有收上已釋放故下明收放表說教收表授記所以然者正表一會事始終也然雖表化事始終而化事不同始終亦別故先述餘經後正顯今意初中差別有十三初三通記三世現在一文經闕丹丘義例以加次三是記三惡趣次三是記人及天次四記四聖不言修羅是但言五趣也所言記五趣及三乘者但是記其當分當有如是果報之事非謂記其作佛其中所以可以意得而經以下是釋無收之意於中有二初標是略次釋略意初言略者既放必收而無文者故是略也此是略舉廣必應有又解以下更約義釋所以略之意也現在者序中表開顯也將來者正說已授記也既是傍正舉正知傍不欲繁文故略之也次下一文皆言約教者不知釋此一文何故兩重約教積疑未會況造次者今謂經云佛放等佛即能放之人前已解釋所放之光未解能放之人今此正釋之也然此能人通於一切今即簡通顯別故約教以明之不然不知初教釋等義前已約竟今此復論此中雖似約四教正是約四時也初即四含次即方等四機並見故次即般若不通三藏同見尊特故名為別後即是今義也以開會故無有二相故經云牟尼名遮那故云即也今之能放之人即此尊妙人也近有云神境智證通有十八變一振動二熾然二流布四示現五轉變六往來七卷八舒九眾像入身十同類往趣十一隱十二顯十三所作自在十四制他神通十五能施辨才十六能施憶念十七能施安樂十八放六光明今此雨四華者自在之變振六動者振動之變此放光者流布之變見六道等示現之變下神力品當具顯示今明一家所釋只是從體起於利用若此經者如之妙矣如下方便及玄義感應中說。",
        "translation": "The next clarification of the meaning of collecting light is that releasing must have collecting. The above explanation of releasing has already been explained, so the next clarification of collecting and releasing shows the beginning and end of the events of the sermon, but the events of the sermon are different, and the end is also different.",
        "source": "X29n0596_008:0350c19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上來多義並釋能照之光已竟下是第二釋光照文之分齊也於中初定文之分齊次正消文初中有三(云云)實論此中約義實通二土然古人所以作此判者一者約義尚委照他方豈應舊過於當界又頌云佛放一光見此國界種種殊妙不照何以見於種種以是文義故屬此土今之意者以文既云照東方故即屬他土也但初一句屬於此土光瑞然約義必須通此約文則局在他文義相修不得相離今意實兩在故前文云照二土表自他覺也若從此文即局他土若依頌文即通此土故云大光普照且各許一邊道理從容言之文義雙單去取任適故云由人然若以文從義則屬此土則放光之文有六此即是光之所照也若以義從文則屬他土(云云)言由人者亦未全穩即是總瑞對次六別故亦是能現後是因致所見故即此一文義雖通此文必屬他今且依文即屬他土總相宜須依之釋文便故。",
        "translation": "After the above explanation of the many meanings and the light that illuminates, the next is the second explanation of the illumination of the text, which is also delineated in the first part of the explanation, the second part of the correct elimination of the text, and the third part of the middle part (cloud).",
        "source": "X29n0596_008:0351b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次正消文祥云照東至萬八千是橫下至上天是竪今謂此未為當今謂經文有三初總語東方次方中之數三數中之別於此數差別中經云阿鼻等者此云無間八大獄中此最居下受苦無暫間息故云無間亦云捺洛迦此云苦器亦不可樂亦非法行處在於處處今言地獄從本處為言耳梵阿迦抳瑟搋此云質礙究竟阿迦質礙義抳瑟搋究竟義亦云有頂邊究竟天有形之頂光可至處故不照無色彼無色故詳云照地獄者明苦可愍照有頂者顯樂亦無常既苦樂無常令厭眾生事悟入佛事故有云表有苦而皆拔勸有樂者而求一乘慈悲普廣有緣皆照苦者雖必容易不能至會亦照令其苦息也今謂正明遍照六趣表說此教當遍開一切權顯真實相也文中所釋於經三中釋前二也於中有三初述舊釋次明未當三正釋也初中標通釋別通者據理實合通照而別者正以表此意義故也意者正以東方表一乘萬表因果正以東是諸方之首故以為表一乘為上之義萬八數之盈缺故以為表因果所以次難責者一乘因果收一切盡但別自足何俟更言通照十方二俱不可準其欲無過者正應微言應通照盡十方界何故但東又但言萬八次釋但釋其局而即該通其標與釋相違二俱不成放所不用祥釋仍有三義一明唯照一方表唯一乘法二明照東所以三明萬八千之義後二之義與向是同後有釋者但釋二義亦與向者意同並與今意不同也。",
        "translation": "Second, the correct explanation of the text is that Xiang Yun's illumination of the east to the 108,000 is horizontal, the lower to upper heavens is horizontal, and this is considered not to be the proper interpretation of the sutra.",
        "source": "X29n0596_008:0351b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次正釋中具釋三文仍約三釋初釋但東一方即兼十方之義又但釋方即兼數義初明東方標其能所皆有所以迹門以下正明所表即開顯也方表位東表初位之初如東方之首也下文及華嚴皆爾即真因位也舉初以下次明例初知後及引文成即表能所皆周遍也能謂初與九所即初開四位謂示悟等開即示悟入一位即四位一一皆爾四即是十一一位中皆有十故無不周遍之言密表於二義矣或曰此但照東方之義方八如何下雖別釋但是觀解誰當云表也或曰文闕此義或云下雖觀釋而還是事故文云表也或云向但破他一乘不破因果之義正顯約數所表意同故也今恐未爾何者既是圓缺兩數正表此中是圓因之義所以知者以四皆是因位又並言佛知見豈非是表圓因若非圓因不能初即具後一即一切向云釋方即是釋數意在斯矣故知方之與數只是表圓因之始終矣此中若四意者總言能所初後即世界別言舉始顯終即為人圓妙無方破於定執即對治寄四常以顯無四之理即第一義此是絕侍圓因即教義矣次約本迹者顯成圓因極也初明能表謂將開近顯遠而四方佛集也下明所表即令四位增極可知言佛集者記云集即表增長義迹門約光照本門約人集迹門約一本門約四今謂前是佛光照今亦佛先召集俱是果人之事齊也前明一即四前既會一即四竟故此便得言其四也分身十方今乃言四以能從所故但言四菩薩踊出何故言佛或言正取佛表圓妙義便故不取菩薩或言正取菩薩不取於佛順經四方出故下疏釋云表四位故又云皆是佛故或云既並為發起應雙取之今謂雙取之盡善美矣前言生身此言法身義自現後文也而不明表於果者今謂門即兼此義何者雖並因光前但光照處後以光召果人因集既是中光所召復是果人因集正表圓因增極圓果成就圓光召表圓因能感圓果佛人集表圓果以酬圓因也聲之所召亦爾(云云)如此所釋順經文義不同舊人古今異釋雖多死興於此思而演之下更約觀釋其數者於義便故於中初釋萬八千次釋十法界初中先約一界論數即有以下約十界合數初標即表十八界約此數上以論一一皆具十法界即有一百八界又約此界上天一一皆具十如即成一千八百如一界既有一千八百約十界即有一萬八千照一萬八千界中一皆有如此差別之境也此等下是釋所照之意佛慧者三圓妙境三觀智也此雖觀解猶表當時仍囑於事並所觀境故是觀解佛慧還佛知見故是表圓因果與前義不違既約十何者是耶故約文示此即十界明文也又引證者前證此人位此論此位人只一言而含二義故得兩引用也祥云乘有十義相表之一最上義以頭表之二中道義以眉間表之三顯明義以白表表之四無翳義以毫表之五破義以光表之六不二義以一方表之七根本義以東表之八有果乘具足義以萬表之九因乘未具足義八千表之十說因果理盡義以周遍表之(云云)東破之久雖十義不攝今四德(云云)關淨樂故(云云)次即當其分文如前已論談義必通於此消文必屬他土向既已消文故不應更在於此蓋似文不應也。",
        "translation": "In the next correct explanation, the three texts are explained, and the three explanations are still discussed. The first explanation is only the eastern side, which is both the meaning of the ten directions, and the explanation of the direction, which is also the meaning of the number. The first explanation is that the eastern direction is marked by both its subject and object, so the following explanation is that the manifestation of the direction is the beginning of the first stage, the eastern direction is the beginning of the first stage, and the following explanation is that the Huayan stage is both the true cause of the first instance, the second explanation is that the initial knowledge and the subsequent explanation is that the manifestation of the subject and object are both pervasive, the subject is the beginning and the nine objects, which are the first four stages, which are the manifestation of awakening and so forth, the beginning is the manifestation of awakening, the entry into one stage, which is the four stages, and each of the four is the four, which is the eleven, and each of the ten is therefore the ten.",
        "source": "X29n0596_008:0351c18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次明他土瑞者前既是總此即是別總謂一光所照別謂顯示六種相也即能總而所別也又前是佛放光照此是大眾因光所見故分六章皆云見也又前是能現也此是所現也應知二文合此三名思之疏文釋此大為二別初正科釋六瑞之文若此土下次明六瑞之所報初中有三先標章次科列三明次第言科列者此是科章對上標數又是列名所以為三六者盡其差別之狀故有六更重彰其要義故以三雙前此土六亦爾應知萬八千界一一皆具此之六章矣初六趣經文三句初能見人即此會大眾也故言於此等也次二所見境即總語萬八千及其中差別之數也論以其中四為三寶今明意有義而非正意不主於此故文不約之也六趣名體及開合等如後文釋二即其中化主主是極聖趣中亦有聖迹以對上聖所化故故云下凡說法義有通別通從於始終別且初頓義現於後四眾在文文有修行謂行因得道謂得果人法即能被所被且從通說也人應通後亦且從別行中經文四句於後略釋此略不明祥云菩薩無邊略以二門總攝一切初因緣門過去習因為因外值善友為緣內因不同外緣非一故云種種信解者始名為信終名為解又鈍根名信利根名解上明入道各有由藉今明入道各有始終利鈍故以信解門攝菩薩也相皃者菩薩修行必有相皃表彰身口之行外彰為相意業之行顯明稱皃故以相皃門攝菩薩行菩薩道者總上三事名行菩薩道故論云以四攝法攝取眾生名行菩薩道也其次有云因緣者是所以義謂以求出生死速證佛果度脫眾生為此因緣修菩薩道或為嚴淨佛土成就眾生修菩提分行菩薩道或為修四攝六度行菩薩道如是等種種所以也信解者信而且解住地前位未得聖果相皃者三業相儀行菩薩道貌儀也住於十地已得道果由種種所由行菩薩道故入二位本論云緣者外遇良緣值多善友也善知識者是大因緣故信解相皃是內修行修行之中內心行名信解身語行名相皃心觀妙理名信解捨頭目等名為相皃行菩薩道者論云依四攝法教化眾生方便攝取故言信解相皃是自利行行菩薩道是利他行見佛入滅般即入也亦云般涅槃那肇云無為亦名滅度古亦云寂滅淨影云入滅息新云波利昵[口*傅]喃此云圓寂謂圓滿寂靜也即德圓而累寂也依諸共說即示入無餘一家所明即是息用歸體故止觀名為歸大處也此中二句即令物修道種福也如後所釋亦為能生滅皆是為物應以得度為作得度因緣也諸釋開為二文今合為一同是為物一示現耳而言始終者菩薩初修故是行之始也佛是果人息用故是行之終也合論故云爾矣次是第三次第者此一文合有三意謂何故但言六何故次第如此正謂教化之道不逾於感應初雙即是應是應次雙是正應於感三雙是感從性起修是應惠用歸體亦是能所之意三六也是必此六不可過滅次第爾矣終要而言之不逾感應道交而已。",
        "translation": "The first is a general statement, and this is a specific statement. The general statement is the illumination of a single light, and the specific statement is the display of six kinds of characteristics, which are general and specific. The first is the illumination of the Buddha's emitted light, and this is the view of the masses due to the light.",
        "source": "X29n0596_008:0352b24_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "若此以下是次明表報者既云六瑞上雖明六瑞義未明故為表報表報即是正釋瑞之義矣於中有二謂略次廣略謂表於二別廣則明其五同且初中先總明光照二土之意以能現之光一所現之事有六故也初中二句皆有能所在文易知前正明中此正明覺以放中光故也思之次二別明二土各六之意初標道同者謂教化之道同也諸佛即總語三世十方令物當聞必信故也雖總言同仍有二別謂二同也應有三同但言二者以文中無量義會未彰故闕於今但明於二以起時眾疑問文殊答之以明三同既見已同知當必同故但以事密表之及問答已即知是說此經大事已終化道訖矣妙用難思以致之矣準前此表義中應明四意初表二覺即世界前表中破二邊故屬對治此表二土依正故屬世界(云云)次總表同令物生信即為人已同無惑即對治當同即第一義亦可除通取別已同已信為人當同破顯第二義(云云)。",
        "translation": "Since the meaning of the six rays of light has not been explained, it's a manifest reward. There are two meanings in this explanation: brief, followed by broad, which is manifest in two distinct, and broad, which is to explain the five samenesses.",
        "source": "X29n0596_008:0353b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次廣明中有四先結標次正釋三總結示四更約文初中以文含二及五之義直一不了故須更廣方盡其意文即有五此五並現於後頌中此中所釋皆取後意初者六必五故至理無二二從緣生初從頓緣故無而有次漸亦爾次二味中具有漸頓第五義中開之與收即是開會二義無量即前之漸頓也故前釋漸頓皆言一切故即無量法也下總結中初結彼己以同此次結此當以同彼始謂為而出世終謂收還息化起塔也散頌二文分明故昺然然此意者今眾見已知必當然但仍隱密其二故雖有五猶為二同使其疑請致三明顯妙功之絕其信矣哉此上是廣釋所現表報意竟下是第四更約文顯即前六文之中第五菩薩行行兩句文也以含多義故須更會釋之於中先釋經三句後結明二同初中先單釋因緣之義次合釋二句初中先通次別通者通諸教味然因緣義有通別今約別釋故分今昔一切皆爾不獨今教束云昔王子所聞法華下種為因中間異方便成就助之為疎緣今聞法華教為親緣即得開悟等為所生法名為脫也今謂此人都不思量渾是夢語此文來處此乃泛爾通淡因緣之義以諸教味皆有因緣義皆如是故也此四不可一者化土不涉此間二者通談不應為別三者菩薩不聞二乘四者文云行道而為脫果違文背義殊不可信造次亦何甚哉此意正謂往日曾習為因現在善友教法可能資助發昔為緣由是而得聽聞信解修行是所生法正明聞信修法而作因緣也通語一切故云種種此不違經是疏之意(云云)次言別者對向通意別約親在又別約中間二味三人故云別也此中不言方等但言般若者或云文略今謂既言藏後即兼二味況此共等之言亦全通也下頌中文分明共不共言出自大論有云共即通菩薩不共即別圓今謂若尅實論共即通別不共即圓此即般若度為主為正故為因不得別取為般若教戒定等即五度助成為緣此唯般若中二也上釋因緣下釋種種三人即三菩薩以經文正語菩薩故方等雖通後為顯別故言三人又三藏菩薩行相全別故但言三次下合解二句者雖雙牒二句但釋二種種言不復釋因緣相皃因緣即今昔親疏如前相皃者謂體狀容儀也即三業行行之體狀容儀也二義既然如何是其種種一約四門二三合說即有十二故二就十二中復各內外眾多何者是耶下引經說是也言身因者身是果因即是因言其感此身果之因故云也如大經說五百羅漢各說未悟道時各觀身因或無明為因或煩惱或業等為因以此觀故而得解脫說已問佛佛言無非正說此意皆以得道故皆正也此雖藏教通是一分共義故蹔借以為證此是略舉其共下例以明不共若欲證者淨名入不二門是也文略不引故知下結既言種種故是無量經有三句不釋中間信解者信解之義後文多處明之故不俟論若種種義還例向諸門上皆有信解即是種種易知故略不說下結亦同初一句結前是與此已同次二句結彼當與此同此當與彼同也以隱無量義故但有二同於當同中但以事表仍未即顯故致疑請問何不即現三同而便起說而共隱密令其疑請然後乃說經云最第一最難信解最為難說必須今古道同方乃可說雖現東方現在未知過去皆同故須陰密待其疑謂以後乃可又正說有二門照東是橫乃表於迹未彰竪本將密表於遠本故以令其疑問引往兼以表之然後乃可慇懃之旨豈徒爾哉思之思之然此中所表既是因緣略廣應具四意且略四者照二土表二覺即世界前為承中光所表之後雙照二土表破二邊之暗故屬對治今直為表覺於自他依正故屬世界各有所以次明己同既己物則信而無或即為人當同密表後當破權顯實即治義二意廣中文雖廣只是二同三意後約文中亦爾或以經有三文即當前之三意因緣今昔正助為二所依即世界信解故為人三業行行相皃不同即對治已既具三當唯勝義雖有此義恐意不然今且如前略廣不同復以於此並此經之意非餘教也本觀可以例知之(云云)。",
        "translation": "In the next explanation, there are four first concluding labels, then correct explanations, three general concluding statements, four further contractual teachings, the first one containing the meaning of two and five, and the second one not being directly applicable, the text must be further explained in detail in order to fulfill its meaning.",
        "source": "X29n0596_008:0353b20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "妙經文句私志記卷第八",
        "translation": "Miaojing wenju xiaoshiji, vol. 8",
        "source": "X29n0596_008:0354b18_0",
        "is_bad_quality": false
    }
]