[
    {
        "source_sentence": "妙經文句私志記卷第七(此下盡竪嘆菩薩德從橫歎菩薩德下盡通序)石皷沙門釋　智雲　撰次明數中此無別義又前數明之故直料簡多少此問即大論文也彼以大品對餘經辨其勢是同今以對餘經明此經也初問意者餘經列數亦有乃至塵數者故云甚多此經所說既特殊常眾最合多何故却少其數何耶釋中兩意並大論文也言大數者謂全數也縱有過減皆舉其全故云大數故下文云大數有八萬書云詩三百注云篇之大數並其流也此且汎爾一意亦未顯此中意次意者彼以般若理致深遠名為密事今此以二門開會最為深遠名為密事故下文云深固幽遠是最密事也必須以絕常之人乃可總須是久遠證其極本迹之人也然此並舉宗主之極者也故此云八萬下文乃云八十萬億那由他也又本門地踊菩薩但言六萬恒沙及至神力品初乃言千世界微塵數也他人釋云謂千今三千世界微塵數也本既如是以本例迹雖言八萬故非數量可以意得不俟繁詞此是因緣應有四者數是世法隨順世間即世界也如向所明數既殊常聞生信重為人也密事謂破顯即後二意四義明矣意略如是故注(云云)不約教者例可知故不明本者從此數本垂於迹數即迹知極本也次約觀者明即自心有此八萬數也心具一切豈但八萬但不言不知故明之也於中初約十善以明萬次約八正以明八合而言之故八萬也初中十善者二種隨用皆得初約一善以明千次約十善故成萬且一善十界十界又具十即百界一一皆具十如百界即千如一善既爾十亦如之故即成萬以歷八正一一皆萬故即八萬八正者正語正業正命正見正思惟正精進正念正定也此即圓妙無作八正道也然此八萬無心則以有必具足心具一切豈唯八萬然雖具足不言不知故明之也此是開顯之後妙人之數即妙數也如此妙數即心法也由來不知依此了知名為觀也境觀合言故云觀心以明故也義極於此不得於此外更明三諦三觀此是文外之義非關消釋經文止觀正明修止觀法非釋經文故不應以之為例思之注(云云)者意略如此。",
        "translation": "The first question is about the meaning of the remaining sutras, which list numbers, even the number of dust particles, which is why it's called very numerous.",
        "source": "X29n0596_007:0297a20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次明位者菩薩即大乘因人之通號也因地既通不知是何地分故明其位謂皆是即不退轉之位也於中先舉文標章然後翻釋應知所釋舉之文上句猶是彼言故須翻也舊云阿云無耨多羅云上三云正藐云遍又三云知菩提云道亦云覺總無上正遍知覺道也義者以正等四次第對於理量無分別及彼得等四智如理緣真如故正如量緣俗故遍無分別斷二無知故言知無分別後智出眠夢之表故言覺此四智是菩提之正體也無上義者有二有七略言二者一約他乘二約自乘約他乘者聲聞菩提有二上緣覺菩提有一上如來菩提無有上故名無上約自乘者有五菩提發心有四上伏心有三上明心有二上出到有一上無上更無有上故名無上若具足明有七無上如後文說更有釋云阿云無耨多羅云上三云正藐云等又三云正菩提云覺即無上正等正覺此有四覺一無上覺總也即顯菩提清淨法界二正覺簡異外道邪覺故三等覺簡二乘但了二乘生空偏覺故四又正覺簡菩薩菩提因覺未滿果位非正覺故此顯菩提道即四智正下一覺字貫通上四由具下三一切莫過超遍等喻真理所覺名無上覺然諸經論多說真理名無上菩提體以根本故今此雙取佛果理智俱名無上菩提於此二果俱不退轉今謂古今異釋雖多亦無史出此二然此文都含五義一總四別初家以初一為總後四為別次家以前四為別後一為總以理觀之前不如後又初家以初三為正後三為知且二皆言三何以後即言知此又不可今此疏文直云無上道者但舉初後略中三也具言即是無上正等正道初四是別後一是通謂無上道乃至正道也道即覺也然道從其所覺語其能所必有能智能通故能必有所謂所覺之道也。",
        "translation": "The next clarification is that the bodhisattva is the common name of the Mahāyāna causal agent who also has the commonality of causal stages and doesn't know what stage they are, so it's clarified that their stages are all that is, the stage of nonretrogression. In this explanation, the text is first cited and delineated, but then the explanation is revised to clarify that the previous sentence of the cited text is still the same as the other sentence, so it must be revised.",
        "source": "X29n0596_007:0297c10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "如境妙下是釋義也應知經文初是體是所依所求所修下三字正是位是能顯也今文中三句初一正釋所為之道次二是釋能依之位初句通釋位義下句別釋位文初便言如境妙者謂此無上道之義如玄義十妙之中初境妙之所說也境正是道是位之所依文義既廣此欲繁故指如彼說也師云大境初四菩提是也境咸妙道之所趣以所顯能故須指境有云菩提是所求道法智論云一切諸佛法名之為菩提此為能求之心所依故指彼境為菩提此之所指彌為人無當故彼文云此等並為諸佛所依斯則所求之道也今謂雖如此釋但是通途並未能顯於中應三一定境道指彼之意二約通釋三約別釋一者須定道境是一故得指彼二者此道並是果德故言無上仍通四種然彼明境法雖多一一皆有三義謂辨判開辨則四種差別判則三權一實開則麤皆即妙唯一無上更無二三方是此經之義雖然如此且是通釋無上道義其中四種差別之義並所未論經既如此委曲應不徒爾若但通釋恐未盡所求果德之道也亦未會諸文義如前兩釋雖各有所對於今並非所宗準今一家所宗果德不逾三種亦如玄義三法妙也如前兩家既皆有總別今亦以無上為總次三為別其中等字古今不定謂真遍等等遍之義則可真固不可總謂三身菩提名為無上別謂法身為正報身為等應身正化故復為正也後一道字貫收此三舉此一三乃至其餘三之總別皆可例知此中應有因緣義者約三總別即四義矣若歷四教皆有其義亦皆可以準知如此則於聖教於一家宗門皆可通會不然觸途皆礙思之思之。",
        "translation": "The first three phrases of the sutra should be understood to be the essence of what's supported, what's sought, and what's cultivated. The first three phrases of the text begin with a correct explanation of the path that's pursued, followed by two explanations of the level that's supported. The first phrase is a general explanation of the meaning of the level, and the second phrase is a specific explanation of the level.",
        "source": "X29n0596_007:0298a16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次下二句正釋位義初釋通義謂趣彼無上菩提已至不退轉之地故是明位又即簡別前之位也亦指玄義十中第四釋位妙中說也名義既同不欲繁文故指彼說然彼釋位最廣要而言之不出三意一通辨即四種差別二判權實三開顯唯一圓妙更無偏麤此與彼同彼即此義是其要矣不然徒繁無益。",
        "translation": "The next two sentences correctly explain the meaning of the stages. The first explains the general meaning, which is to go to that place of unsurpassed enlightenment and arrive at the place of nonretrogression; therefore, this is the stage of clarification, which also refers to the fourth stage of explanation in the ten profound meanings, the marvelous middle way, which is the same in name and doesn't want to make things complicated, so it refers to that stage of explanation.",
        "source": "X29n0596_007:0298b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上已釋位義下便消位文即三字也於此釋中仍有四別初因緣中標列其名次約教中釋其體義初中應有數名體義文略但列名也數古今諸家或三或四今此文中但明三也名者如文古今三名多同於此名也若為四者兩家不同初一於前三上加證不退下三名及次第皆與前三是同此即今文地師義也次一家云不退有四一信二位三證四行此一家數同於前名義次第有同有異今謂經論不同各以馮據故有此異雖有此異今文且依三種所以但三者義要便故攝餘二故若得下四釋意則諸異義不融而無不通矣然上聲聞位中一言便定今此亦應別說何為此說致諸義不同然聲聞義別直從極說菩薩義通不可定判然餘經中或云皆補處或云皆十地此豈非別然此欲對通顯別又欲約別明通以此是開會之教無方妙道初後皆即不退轉故也宜善詳之此上並因緣義若四意者三義總別次第即四意也有人問云不退與不轉何異答釋彌勒所問經云得自分功德為不退得分外功德為不轉又得智慧得功德故又得般若得方便故為不退轉也有云云何不退轉由具下十因不退轉故於佛果能不退轉決定當證念念進脩名不退轉退者失也轉者動也不退有四一信不退即十信第六名不退心自後不退生邪見故二位不退十住第七名不退住自後不退入二乘故三證不退初地以上有名不退所證得法不退失故四行不退八地以上名不退地為無為法皆能脩故今菩薩皆八地以上故言於無上覺不退轉定證故故不退者非即不轉又不退有二一已得不退初地即得二未得不退八地方得無上正覺是去得法故八地以上能不退轉情所正覺心進不動法駛流中任運不轉故名不退轉此不退轉此不退者即是不轉如此兩釋及以諸解皆不出於通別故有如此差異若開顯圓道一切無方何此定別故今所不論也。",
        "translation": "After explaining the meaning of status above, we'll eliminate the text of status, which are the three words. In this explanation, there are still four distinctions. First, there's the list of names in the context, then there's the explanation of their essential meaning in the teaching convention.",
        "source": "X29n0596_007:0298c02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次約教者以不退轉之言含於三義復通四種會唯一三故也於中初標四種以經論中說三有此四別順聖教意故應四種初約藏中大論云遠離五事得五功德五事者一三惡趣二貧賤家疏云邊地應有別出或直從義三根缺四女身五喜忘五功德者一常得人天身二生富貴家三諸根完具四恒為男子五常識宿命此意者五事是離不善因修行善因五功德是離不善果得善果也今將得五善果對三不退初一對位離三不善地住於善地永不退為不善故即人天以此菩薩猶同凡夫故次三對行以常行此行不作餘行故知宿命即是念常知故故即不退具此名不退即三不退也有云若準數論聲聞下忍得位不退今玄文判六度菩薩滿三祇後訖坐道場前悉名下忍中忍得行不退上忍得念不退此二忍玄文判菩薩從坐道場方如次得之也此義宜更尋四教中釋記云第三祇時橫得三不退故離五障時三義俱持即第三祇通至百劫通是三不退也至此名為上忍故也次通中言六心者記云此教地前無位可論借別位名以通其位即指別教七信以上入乾慧也故云初地至六地方名位不退或指地前假立七賢即以忍位為第六心依小乘位雖云忍位名位不退望菩薩乘猶名為退有云此教諸位未詳所出都不敢言意以事希未見所出故不敢言也今謂此是古人異釋義當於此教故今引來用對此教故吉云釋三不退凡有四說一云十住前六心假解未立退菩提心為二乘七心以上假解已立名為菩薩獨成性地此免位退二者行退初地至六地此中諸人習行有時不進名為行退七地則無此退第七一地或起愛習猶有功用名為念退八地以上入無功用道永無三退故名不退轉二云外凡六心名為位退七心以上稱位不退餘二不異前釋三云習種性名位不退道種性解行純熟謂行不退初地以上得無生忍不復生心動念名念不退第四一家約四以釋不退即今文中第三別義是也既同不復更述彼出此四家已云今謂經論不同難可詳會後廣出經論中異繁不能述今謂只為經赴緣不同有諸異說諸師隨異而用終莫能會通觀前所引異說雖多終不出通別兩義若得今文四意雖異亦易會通且舊四義初一似別而多是通第二一釋即今文通義三四兩釋即今文別義彼後師以無此四意故云難可詳會若得此意信不難也文云輕毛即外凡十信中前六心若七心以上即是十住第七名不退住所以爾者蓋借十住顯十信義準前他人所述亦應云七心以上名位不退從初地至六地名行退七地名行不退八地以上名念不退今云道觀謂化道空觀亦可道是理即空觀觀是觀機即假觀也然三乘十地第八是支佛地又未名雙流若他云入無功用此即不動地此又是別家名目則兩教之義俱不成就意者正取八地以上即通取菩薩地義則通矣或古人意將乾慧地擬別外凡十信次性及八人二地擬別內凡三賢從見地以上即擬別家登地以上故云初地乃至第八不動無功用等正似有此意矣此是古人不識教門差別強欲會通故作是說彼以為妙會今縱而與之然亦只是三乘共三義耳非此經意乃是用別而成通義故也其中雖有少異從多分說名共也次加證冥真離四住不為凡夫故為證最初現驗故居首也至此地決不為二乘故是位修行中道不行二邊始是行不退已證中道不為二邊所動故念不退結簡者別尚非用況復前二向簡人師之釋下約聖教所明自然流入即不退義即有三義但以位高方致故亦是別非今意用次圓中先引彼經明圓次會此經之妙三結是意所用初即具三身三智境智冥一三身即位不退三智即行不退冥一即無異外可念念不退也此一即三故是不退豈更別有不轉之義於彼如是於此所說即一實事亦名最實事亦名一大事總要而言皆一妙事之異名也即從初住以上盡菩薩位同此義正為顯故不別言思之思之是絕待之義故用判也。",
        "translation": "The first is that the sūtras teach that the words nonretrogression contain three meanings and that the four kinds of nonretrogression are compatible with the noble teaching's intention, so there should be four kinds. The first is that the Tripiṭaka School's great treatise says that the seclusion from five things obtains five virtues. Five things: one, the three evil destinies; two, the poor and the humble; the commentary says that the borderlands should have distinct meanings or be directly derived from the meaning; three root deficiencies; four, the female body; five joyful forgetfulnesses; five virtues: one, always attaining the body of humans and gods; two, birth in a wealthy family; three, the perfection of the faculties; four, being a constant man; and five, constant awareness of past lives.",
        "source": "X29n0596_007:0299a11_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次本迹者明圓不退之久遠也於中初正明本迹次斥諸失初中先標其本即妙覺寂滅忍也非初非後非圓非偏故是寂滅本也別通以下明其迹明迹示偏圓昔通今別唯在圓妙如前次斥不知迹示四別於今唯一圓妙覺作別通之解故言不識尚不知今妙迹數能知其妙本不能顯其圓妙迹本唯歎偏麤之迹故毀在其中記云只此一謬義招二失經既無三教苦欲增之抑圓成偏減豈過此有云本是高位或復極果不知本故減為下位名減謗既以下位加之復名增謗今謂文明本亦偏圓本非偏圓迹示偏圓單約偏圓則失本單約本迹又失偏圓初解只是正迹次釋但在本縱相對釋亦恐不得況專從單今謂從本垂迹意在寄迹顯本今並不知以迹為實是增益謗不言其本是損減謗從實施權寄偏顯圓今並不知執權為實是增益謗不言其實是損減如此方會兩文可單也思之思之經意寄迹以顯本且如序中明文殊化道久遠乃是釋尊九代祖師弟子一人既成久遠況復遠代祖師一人既然餘亦例爾又聲聞尚顯難思之本況諸菩薩故知本皆妙極迹示偏圓來至此會全同一味而專用偏全不言其本迹非增減者更何有乎。",
        "translation": "The first is to explain the original traces, and the second is to deny the errors. The first is to label the original as the patience of tranquility and cessation of marvelous enlightenment, which is not initial or final, not perfect or partial, and therefore the original of tranquility and cessation.",
        "source": "X29n0596_007:0300a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明觀者即約自心明妙三義初且明三未彰其妙故下更約一心方顯其妙數義次第並即可知本來自即而不自知今示令知故此說也本即明性知即明修性一修五合即為六若不知此還成麤總彰有此意故注(云云)。",
        "translation": "Next, he explains that this is a statement of the three subtle aspects of self-consciousness and the three subtle aspects of self-consciousness that weren't made clear in the beginning, so he goes on to explain the subtle aspects of one mind in order of their meanings, which is to say that the original self is known but not known by itself.",
        "source": "X29n0596_007:0300b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次即釋歎德者明此位中所有之功德也佛地論云何故讚說菩薩功德為捨眾生輕慢心故有作是言諸聲聞眾久修梵行諸菩薩眾應當恭敬又令眾生起淨信故菩薩尚有如是功德何況如來此中有善治二義亦應具有四也既歎聲聞復希聞菩薩功德起彼欣樂故因歎而悟道故即具四也他人於此廣明歎意今不能具述文中先對舊科定文分齊次正消釋初中先古次今古人意者文含兩向只得其一不盡文意今為兩向則顯二意自復有二謂是位是歎是總是別則盡經合論又與前文體同方為盡善自下是正消釋於中有三初述舊次辨非三正釋初言十二句者從別置總故也文但略述其科斷意義兼在其中初述大分為四兼顯通別之意藏師大分為四意與此同言有少異改行為因改內為實第四名美名譽故義不異此多是光宅之義其中四名所以應隨文消息易知四意等者以釋疑成前通別之義歎德有此四別以德居初舉初攝後故也吉云初因果兩美後則體名俱歎略攝菩薩功德也次又述其曲開前四為十兼有其義於中亦但可以隨經文消息不繁更述藏師於前四中各開為二都成八段略有同異既非正要不俟更述。",
        "translation": "The next explanation is to praise the virtues of the bodhisattvas, which are explained in detail in the Buddha-stage Discourse.",
        "source": "X29n0596_007:0300b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上已述異竟下是辨非明不用其義云所以也於中先總許而奪次難破許是別許其科文奪是破其意義文通而義別通途科釋其文則可義有差會不知在誰故不可也又與者許其科判當文奪者破其乖於前義言眉眼者面顏之美莫過此二喻其兩重科判其文差為美好窮考其趣殊無所歸言其但有通途之詞而竟無其的實故也言無宗體者記云位之所依名為位本本即是體位即是宗也有云宗謂義之所主此宗即體考其宗體悉乖背於諸教之旨故云無趣向也今謂宗是趣義能趣向也體是所趣向也言其雖能如是科釋其文不知義旨歸趣何處都無的實故言殊也初宗體二字別言能所下一句合言能所合言能所宜善思之自下別歷三教難之釋成殊無之義也初將其三義以顯非此教義次將其二義明於此教義不成三明與其一義相違故不可此義並是其義現於前文釋位義中進退結明不用所以進非圓退非別並無契會即前無宗體也縱通於三亦非此經之意故所不用也。",
        "translation": "After the above explanation of the differences, the following is a discussion of the meaning of not using the non-explanation.",
        "source": "X29n0596_007:0300c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自下是第三正釋於中有四初標所依解釋之方次隨出其所以釋其體義三正消釋四引論解成於前言十三句者前他從別故十二今兼總故言十三作橫竪者正標解釋此文所依之方法也下二句是次釋用上二法解釋之所以也其中含有三義謂何者是竪約十地也何者是橫謂初住也十地何故名竪淺深次第故初住何故名橫一時頓備諸義故何故約如是橫竪而釋各以文義便故如何義便正與文義相當故又舉偏次題圓頓故欲題古今諸釋只是次第之義並非圓頓義故正為題此經開會義故亦為合於論中二義亦可第二義在第三故言義便含有多義宜善詳之為此故約此二方法釋也下是第三正釋即有二別初約竪中自復有二初正釋後總結明其意初正釋中十地即有十別一一皆含三義謂舉文屬對釋其所以結成其義文雖或無義皆具也初正以不退轉三字以對初地初地名下是次釋其所以於中先出其名下明其義新云極喜地義者初獲聖性謂斷凡夫性得聖性故今則正用此經文以彰其義亦不乖違不墮二邊是斷凡夫性得入中道等即得聖性具足而言即初離三過獲三德故極歡喜歡喜正由初得不退轉故以此之義定知此句是歎初地德也次第二地釋中亦先出其名此名新舊同義者新云能離微細毀犯垢故名為離垢地今謂以此地對戒度故爾若例此義則前應云能捨離慳垢以對檀度故前文雖不顯而義亦具有以離二邊三退即捨義矣戒有止作即與總持二義是同故知此句是歎第二地德也次第三名中新云發光地謂能成就勝定大法總持能發無邊妙慧光故今約此文顯義由內有外又引證由外知內此新舊似從內體為名經舉外用正由內體故有外用見外能說知內知明下釋別舉樂說之意用彰內智深明言說有種種等者辨才有四謂法義詞樂說樂說是最後能說於前能所合論故云種種能[紵-丁+死]前三故云最勝應云辨有種種而言說者稍難會如次所明言樂說者二義一者依自得法樂為物說故二者隨機樂聞而為彼說故智論有此二義故名樂說有云辨即四辨而有通別對境辨了四皆稱辨若在眼為明在耳為聰在心為智在四為辨此別辨也速疾應機名辨言含文彩為才有云說時無謇無急為辨中機中理為才有云辨即四辨七辨四者新云四無礙解前三名同第四直云辨說無礙解七辨者一捷辨須言即言無塞吃故二迅辨不遲訥故三應時機不增減故四無疎謬凡說契理無錯誤故五無斷盡相續連環終無竭故六凡所演說豐義味辨一一句言具事理故七一切世間最上妙辨具足甚深如雷清徹遠聞等五種音聲故今謂此七若望前四並第四攝又云說有種種者通指其七樂說最勝別指第七不然此文難消思之思之要而言之辨者明也才者能也彰其辨說明能正當明地之義故知此句正當之也第四地名新云燄慧地謂安住最勝菩提分法燒煩惱薪慧燄增故今文先明此地義有其二次會經文義同是故定知此句是彼地矣法輪義如後釋次第五地新舊名同義者新云以前諸地真俗別觀唯此地中真俗合照照勝前故名極難勝今文釋者此地正當禪度故云得禪定名從用得經言其體亦是出其難勝之事新從觀智之用為名此從定用為稱具有多義互說一邊以此故知此句是此地也供養事義如後次第六地新舊名同義者論云住緣起智引無分別最勝般若今現前故謂觀十二緣有最勝觀無染淨故名無分別今文意者福資智顯故是現前此易會也德本之義在後當釋次第七地新名同音通平去多從去呼論云至無相位功用後邊出過世間二乘道故謂六地向是有相七地是無相又是功用後邊此於功用而得究竟即後邊也今文云出過即出過世間及二乘道也能於空中起於有行故云出過上句釋地名下句會今文義自利利他深稱佛心故為佛稱歎又此地對方便波羅蜜故云方便也而言常者其行常然也以是故知此句是歎此地次第八地新名不異論云無分別智任運相續相用煩惱不能動故相謂有相用謂功用即此相用不能動心故名不動文中初釋地義正智即上無分別也由此故不能動出也但以以下釋會今文以無緣慈動三利物動而不動故即不動之義文但動身即具三義況正具說以是之故定知此句是歎此地也次第九地新名不殊論云成就微妙四無礙解能遍十方善說法故親云此慧妙善故名善慧無性云證無礙解此知最勝智即是慧故云善慧文中深入妙徹釋善入實際本源釋佛慧以二並是佛慧所極之境其亦能爾故云善也言最合者其中二字全同故論中但解善慧故約自他今消入字故且約自證然善入義通自他故其一也徹者通達也以是故知此句歎此地也下釋三句有離有合合總第十地離則後二對等覺且初句者有對有名有義名同義者論云一大法智如雲含眾德水二蔽如空麤重名雲三充滿法身如雲注水故十地論云得大法身具足自在法雲地如雲遍滿如王太子得自在故無性云由得一切智緣一切教不離真如一切法智譬如大雲陀羅尼門三摩地門如清淨水智能藏彼如雲含水又如大雲覆隱虗空智如彼雲覆隱麤障又如大雲注清淨水充滿虗空此智生諸功德充滿法身觀此所釋似具四義名法雲地今此文中但用三義且譬三者雲依虗空故覆蔭故含持雨故以喻法身禪定智慧此三德之義也次會二字世釋此二字多義然有即有異今此一義即證體起用亦自他也言互舉者彰其等也名從三義以立今文舉三中之一即具於三以是故知即是歎第十地也。",
        "translation": "自下是第三正釋於中有四初標所依解釋之方次隨出其所以釋其體義三正消釋四引論解成於前言十三句者前他從別故十二今兼總故言十三作橫竪者正標解釋此文所依之方法也下二句是次釋用上二法解釋之所以也其中含有三義謂何者是竪約十地也何者是橫謂初住也十地何故名竪淺深次第故初住何故名橫一時頓備諸義故何故約如是橫竪而釋各以文義便故如何義便正與文義相當故又舉偏次題圓頓故欲題古今諸釋只是次第之義並非圓頓義故正為題此經開會義故亦為合於論中二義亦可第二義在第三故言義便含有多義宜善詳之為此故約此二方法釋也下是第三正釋即有二別初約竪中自復有二初正釋後總結明其意初正釋中十地即有十別一一皆含三義謂舉文屬對釋其所以結成其義文雖或無義皆具也初正以不退轉三字以對初地初地名下是次釋其所以於中先出其名下明其義新云極喜地義者初獲聖性謂斷凡夫性得聖性故今則正用此經文以彰其義亦不乖違不墮二邊是斷凡夫性得入中道等即得聖性具足而言即初離三過獲三德故極歡喜歡喜正由初得不退轉故以此之義定知此句是歎初地德也次第二地釋中亦先出其名此名新舊同義者新云能離微細毀犯垢故名為離垢地今謂以此地對戒度故爾若例此義則前應云能捨離慳垢以對檀度故前文雖不顯而義亦具有以離二邊三退即捨義矣戒有止作即與總持二義是同故知此句是歎第二地德也次第三名中新云發光地謂能成就勝定大法總持能發無邊妙慧光故今約此文顯義由內有外又引證由外知內此新舊似從內體為名經舉外用正由內體故有外用見外能說知內知明下釋別舉樂說之意用彰內智深明言說有種種等者辨才有四謂法義詞樂說樂說是最後能說於前能所合論故云種種能[紵-丁+死]前三故云最勝應云辨有種種而言說者稍難會如次所明言樂說者二義一者依自得法樂為物說故二者隨機樂聞而為彼說故智論有此二義故名樂說有云辨即四辨而有通別對境辨了四皆稱辨若在眼為明在耳為聰在心為智在四為辨此別辨也速疾應機名辨言含文彩為才有云說時無謇無急為辨中機中理為才有云辨即四辨七辨四者新云四無礙解前三名同第四直云辨說無礙解七辨者一捷辨須言即言無塞吃故二迅辨不遲訥故三應時機不增減故四無疎謬凡說契理無錯誤故五無斷盡相續連環終無竭故六凡所演說豐義味辨一一句言具事理故七一切世間最上妙辨具足甚深如雷清徹遠聞等五種音聲故今謂此七若望前四並第四攝又云說有種種者通指其七樂說最勝別指第七不然此文難消思之思之要而言之辨者明也才者能也彰其辨說明能正當明地之義故知此句正當之也第四地名新云燄慧地謂安住最勝菩提分法燒煩惱薪慧燄增故今文先明此地義有其二次會經文義同是故定知此句是彼地矣法輪義如後釋次第五地新舊名同義者新云以前諸地真俗別觀唯此地中真俗合照照勝前故名極難勝今文釋者此地正當禪度故云得禪定名從用得經言其體亦是出其難勝之事新從觀智之用為名此從定用為稱具有多義互說一邊以此故知此句是此地也供養事義如後次第六地新舊名同義者論云住緣起智引無分別最勝般若今現前故謂觀十二緣有最勝觀無染淨故名無分別今文意者福資智顯故是現前此易會也德本之義在後當釋次第七地新名同音通平去多從去呼論云至無相位功用後邊出過世間二乘道故謂六地向是有相七地是無相又是功用後邊此於功用而得究竟即後邊也今文云出過即出過世間及二乘道也能於空中起於有行故云出過上句釋地名下句會今文義自利利他深稱佛心故為佛稱歎又此地對方便波羅蜜故云方便也而言常者其行常然也以是故知此句是歎此地次第八地新名不異論云無分別智任運相續相用煩惱不能動故相謂有相用謂功用即此相用不能動心故名不動文中初釋地義正智即上無分別也由此故不能動出也但以以下釋會今文以無緣慈動三利物動而不動故即不動之義文但動身即具三義況正具說以是之故定知此句是歎此地也次第九地新名不殊論云成就微妙四無礙解能遍十方善說法故親云此慧妙善故名善慧無性云證無礙解此知最勝智即是慧故云善慧文中深入妙徹釋善入實際本源釋佛慧以二並是佛慧所極之境其亦能爾故云善也言最合者其中二字全同故論中但解善慧故約自他今消入字故且約自證然善入義通自他故其一也徹者通達也以是故知此句歎此地也下釋三句有離有合合總第十地離則後二對等覺且初句者有對有名有義名同義者論云一大法智如雲含眾德水二蔽如空麤重名雲三充滿法身如雲注水故十地論云得大法身具足自在法雲地如雲遍滿如王太子得自在故無性云由得一切智緣一切教不離真如一切法智譬如大雲陀羅尼門三摩地門如清淨水智能藏彼如雲含水又如大雲覆隱虗空智如彼雲覆隱麤障又如大雲注清淨水充滿虗空此智生諸功德充滿法身觀此所釋似具四義名法雲地今此文中但用三義且譬三者雲依虗空故覆蔭故含持雨故以喻法身禪定智慧此三德之義也次會二字世釋此二字多義然有即有異今此一義即證體起用亦自他也言互舉者彰其等也名從三義以立今文舉三中之一即具於三以是故知即是歎第十地也。",
        "source": "X29n0596_007:0300c24_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下二明內外德者向即是總此下別也即以三諦之道名彼岸證極名到猶是菩薩因位而作是歎故下二義釋之今謂此是第十對智波羅蜜初句即智次彼岸即波羅蜜正顯此義故作此言即正當第十地文義分明也言內外相稱者即名實不差也對等覺者以菩薩之名通至等覺亦名無垢地也本業即有仁王不立經既不定今亦進退二途俱可矣言餘地者或九或十以前也為進退兩位故因位利用此位最勝故也此十地義廣如本業經中數番解今略消此文不能委會。",
        "translation": "The next two clarifications are about internal and external virtues, which are general, and the following is specific, which is to say that the path of the three truths is called the other shore, and the realization of the ultimate name is arrived at just as the bodhisattvas praise the causal stage, so the next two meanings are explained.",
        "source": "X29n0596_007:0302a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸地以下重明竪釋之意是此經圓位故皆具眾功德眾德者一一皆具十三句義也然者以中道妙體故也而今所以各出一句義各沒餘十二句義者何耶故知出沒釋中三意好異者謂歷別也古今皆好作此釋今於不異中順人情故亦作此釋亦如十地經中竪對十度此亦順物情也且借妙道隨逐人情一往意耳未是盡理故是順情名便者前云義便意明於文義俱會故也即如文中或名或義與經論釋皆相當故又是舉易顯難故以歷別故易上一為字貫於此三為此三義故作此一種道理消釋其文也次約橫中有四五初雙標次雙釋後雙證四雙料簡五尋之論之錯未合在正釋第四料也他時商議引論所解雙釋前二義初中先標初住次例顯餘位言直約等者橫是圓備之義直就初住一位即具十三句義故例餘位者謂二位已上至等覺也次雙釋中先明初住橫相次釋例餘位橫相初中有二初消現文次明廣義初中即有十三句初中有三義初釋發心住義其心以下釋文不退轉義三結所以先釋此名者以十住中最初名發心住正當此中宗主又是總故須先釋此義下餘句並屬於此故不更論初四字標名下五字釋發義此是真義住真位開發名之為發非謂緣境立志名之為發也一者總言一真心開發之時一切真實功德皆悉開發準例餘文所釋要而言之只是三德即攝一切故也此句正為具下諸句作本先釋其名正為於此出過等釋住義也隔凡超聖釋成上超過二邊義入於中道正明住義經云入理般若名為住即入中道妙理也上是釋發心住義其心以下是會今文不退轉義此位即自能趣入果地一切種智海中以是道理故言不退轉也此名總持亦云遮持明此初住能遮三惑能持三德正顯此位後有此能故言得總持也總持之義廣如後文所釋次舉似况真正顯此位復有此得故也辨才之義略已前次餘經論中有作此說餘文多約初地華嚴則有此文義今會顯圓妙無方故言實處實處處即妙體也妙願也自體無方他緣且爾應知無方也說即轉也所說之法即輪也而言法輪者真諦三藏云輪有其三謂軍財法軍輪謂象馬車步四種兵也財輪謂金銀銅鐵四種輪王之所用也法輪即佛法王之所用也對彼軍財二輪故云法輪也又言不退轉者真諦又云法輪有三謂轉照持轉即鹿苑四含照即諸部般若持即解深密等亦名小乘大乘一乘小為大破故有退轉大為一破破亦有退轉一乘不可破故名不退轉今諸菩薩是轉一乘不退轉法輪故云爾也三法輪名出金光明三時轉出深密解脫經(即新云解深密經是也)真諦別有義章廣釋今謂一家所明不退轉義有其四種如前所釋文義分明今諸菩薩通能轉此四種若至此經唯論圓妙一種既並開會一切絕待自外無法何復更有可退轉地故云轉不退轉故下文云轉無上法輪等又云今復轉最妙無上大法輪即其義也次供養者又具有此德也二句即體用內得禪定妙體外能妙用供養即體用內外理事三雙義也內得此道由佛之力外報恩故而興供養承事即供養謂三業奉順也所以者佛是一切真善知識今已得此妙道是故供養所以能遍供養者由內具大禪定有大禪力故能一時普遍供養一切他云或財或法或復三業總名供養有云供養謂行供養此行有三謂能持能行能說此三能令佛喜故是真供養是故佛臨涅槃人天設供養佛言阿那律此供非第一世有三人能供養我能持者能護正法能行者能護正義能說者能護正法及正義是為第一供養與如來意相應令如來歡喜是名真供養彼更有多說繁不能述更有說云供養有十菩薩地說一現前供養於對現前佛設利羅及制多等一切三寶親面供養二不現前供養於餘佛制多等作佛等想修不現前供養三現前不現前供養現對前時後作是念一佛制多等法性即三世十方諸佛制多等法性故我今者現前供養一佛制多等即是供養三世十方諸佛制多等修現前不現前供養四於如是所準自供養五若起悲心以隨力物施貧苦等願彼安樂令供養六俱供養自既作時復勸教他作此供養七財敬供養以華香等敬問禮拜乃至以珍寶等修財敬供養八廣大供養即以財敬長時多劫乃至淨心迴向菩提自力集財從他求得發願想作為百千身恭敬禮拜一一化佛身出百千手持散華出百千聲歌讚實德復出百千妙莊嚴具而為供養於瞻部洲乃至十方所有供養普生隨喜雖少用功而興無邊廣大供養九無染供養不以輕慢矯詐放逸不淨等物修無染供養十正行供養若有須更修四無量乃至少時信忍離言真如法性起無分別住無相心即為守護菩提淨戒乃至修行四攝事等修正行供養應念此為最上最妙過前供養百千萬倍不可比喻應對會地持論中十義如後藥王品中修供養應念如來是大福田具大恩德難過獨出眾義依止如佛既爾於法僧亦然(如出讚上養中廣說)大論供養供養不出二種一財二法如淨名法供養品事即三業四事六塵等是二法此則有四一者順佛教命弘通佛所說法利益一切名法供養二者作法供養名法供養即如經中結印誦呪想念勝境以為法供養三者如法供養即如前所有供養一一皆如法性不相違背名如法供養此為最勝又復所作供養皆為於法故名法供養此七供養後二最勝諸所未說最要思之三即事而理於一一一事行之中皆即諦理實相即如藥王燒身名真法供養無盡奉寶名為法施是其義矣若事義如後別序初釋若法行義如寶塔品中五種弘經供養一切者是若事即理如藥王品及釋普門中供養諸佛普中釋此為最要妙也後文自顯故此略之次明復能具眾德本前云智慧此云實相若尅實論依境發慧慧屬眾德實相是本植者種也初住實相理顯眾德斯備名之為植非謂初下種也例如前釋發心住義又若供養之時復更聞法智慧增明此又新植德本思之有云德謂三德謂智斷恩本謂三因謂應得等出之又今意云云次稱歎者復有此功德也佛本只令得佛知見今既得之稱佛本心而印可之是故稱歎次明復能三業妙用利益也如前已釋次入秘藏德三德即三般若名為佛慧妙達三惑即三般若故名善入所以秘藏名佛慧者正明佛慧攝一切德故也了非即是故名善入次明復能智境圓滿德初句解大智次句解通達或云一心是境謂境智今謂此是大論文只是總別明智正謂一智即三智也方便品初具釋橫竪照了皆無障礙故名通達次句者前既約智此言事理即當境也前既三智此即三諦前文已言三德並互舉也此事理即不思議權實境智也言分得者分中之首初即後故不思議分也勿任常情次者體既圓備名聲普聞即名聞周遍德也次句明外化德前以慈句且明化他體未論化分齊故此明之十界解無數作依止等釋能度生雖無數類聚群分不逾十界如何能度以大悲智而總與之作依止處大慈與樂故云安立大悲拔苦故云救護以此故云能度又依止即教授也安立即同行也救護即外護也前明自到彼岸此明為他作此三種智善知識令其究竟至大安樂之處故云能度也上十三句依論有別名因今亦可依附今文意立名名之所未暇也上是別釋十三句竟下是總結示於廣略對略明廣故言更有既無邊量故絕言慮以知然者依聖教故準道理故如華嚴等威稱歎美所有功德與諸佛等故理者以是圓妙固其然矣以是固廣多也略言等者對廣彰略既廣若是故知十三是其略矣應知此略是其要略非謂闕略以十三句即攝一切廣多義故。",
        "translation": "諸地以下重明竪釋之意是此經圓位故皆具眾功德眾德者一一皆具十三句義也然者以中道妙體故也而今所以各出一句義各沒餘十二句義者何耶故知出沒釋中三意好異者謂歷別也古今皆好作此釋今於不異中順人情故亦作此釋亦如十地經中竪對十度此亦順物情也且借妙道隨逐人情一往意耳未是盡理故是順情名便者前云義便意明於文義俱會故也即如文中或名或義與經論釋皆相當故又是舉易顯難故以歷別故易上一為字貫於此三為此三義故作此一種道理消釋其文也次約橫中有四五初雙標次雙釋後雙證四雙料簡五尋之論之錯未合在正釋第四料也他時商議引論所解雙釋前二義初中先標初住次例顯餘位言直約等者橫是圓備之義直就初住一位即具十三句義故例餘位者謂二位已上至等覺也次雙釋中先明初住橫相次釋例餘位橫相初中有二初消現文次明廣義初中即有十三句初中有三義初釋發心住義其心以下釋文不退轉義三結所以先釋此名者以十住中最初名發心住正當此中宗主又是總故須先釋此義下餘句並屬於此故不更論初四字標名下五字釋發義此是真義住真位開發名之為發非謂緣境立志名之為發也一者總言一真心開發之時一切真實功德皆悉開發準例餘文所釋要而言之只是三德即攝一切故也此句正為具下諸句作本先釋其名正為於此出過等釋住義也隔凡超聖釋成上超過二邊義入於中道正明住義經云入理般若名為住即入中道妙理也上是釋發心住義其心以下是會今文不退轉義此位即自能趣入果地一切種智海中以是道理故言不退轉也此名總持亦云遮持明此初住能遮三惑能持三德正顯此位後有此能故言得總持也總持之義廣如後文所釋次舉似况真正顯此位復有此得故也辨才之義略已前次餘經論中有作此說餘文多約初地華嚴則有此文義今會顯圓妙無方故言實處實處處即妙體也妙願也自體無方他緣且爾應知無方也說即轉也所說之法即輪也而言法輪者真諦三藏云輪有其三謂軍財法軍輪謂象馬車步四種兵也財輪謂金銀銅鐵四種輪王之所用也法輪即佛法王之所用也對彼軍財二輪故云法輪也又言不退轉者真諦又云法輪有三謂轉照持轉即鹿苑四含照即諸部般若持即解深密等亦名小乘大乘一乘小為大破故有退轉大為一破破亦有退轉一乘不可破故名不退轉今諸菩薩是轉一乘不退轉法輪故云爾也三法輪名出金光明三時轉出深密解脫經(即新云解深密經是也)真諦別有義章廣釋今謂一家所明不退轉義有其四種如前所釋文義分明今諸菩薩通能轉此四種若至此經唯論圓妙一種既並開會一切絕待自外無法何復更有可退轉地故云轉不退轉故下文云轉無上法輪等又云今復轉最妙無上大法輪即其義也次供養者又具有此德也二句即體用內得禪定妙體外能妙用供養即體用內外理事三雙義也內得此道由佛之力外報恩故而興供養承事即供養謂三業奉順也所以者佛是一切真善知識今已得此妙道是故供養所以能遍供養者由內具大禪定有大禪力故能一時普遍供養一切他云或財或法或復三業總名供養有云供養謂行供養此行有三謂能持能行能說此三能令佛喜故是真供養是故佛臨涅槃人天設供養佛言阿那律此供非第一世有三人能供養我能持者能護正法能行者能護正義能說者能護正法及正義是為第一供養與如來意相應令如來歡喜是名真供養彼更有多說繁不能述更有說云供養有十菩薩地說一現前供養於對現前佛設利羅及制多等一切三寶親面供養二不現前供養於餘佛制多等作佛等想修不現前供養三現前不現前供養現對前時後作是念一佛制多等法性即三世十方諸佛制多等法性故我今者現前供養一佛制多等即是供養三世十方諸佛制多等修現前不現前供養四於如是所準自供養五若起悲心以隨力物施貧苦等願彼安樂令供養六俱供養自既作時復勸教他作此供養七財敬供養以華香等敬問禮拜乃至以珍寶等修財敬供養八廣大供養即以財敬長時多劫乃至淨心迴向菩提自力集財從他求得發願想作為百千身恭敬禮拜一一化佛身出百千手持散華出百千聲歌讚實德復出百千妙莊嚴具而為供養於瞻部洲乃至十方所有供養普生隨喜雖少用功而興無邊廣大供養九無染供養不以輕慢矯詐放逸不淨等物修無染供養十正行供養若有須更修四無量乃至少時信忍離言真如法性起無分別住無相心即為守護菩提淨戒乃至修行四攝事等修正行供養應念此為最上最妙過前供養百千萬倍不可比喻應對會地持論中十義如後藥王品中修供養應念如來是大福田具大恩德難過獨出眾義依止如佛既爾於法僧亦然(如出讚上養中廣說)大論供養供養不出二種一財二法如淨名法供養品事即三業四事六塵等是二法此則有四一者順佛教命弘通佛所說法利益一切名法供養二者作法供養名法供養即如經中結印誦呪想念勝境以為法供養三者如法供養即如前所有供養一一皆如法性不相違背名如法供養此為最勝又復所作供養皆為於法故名法供養此七供養後二最勝諸所未說最要思之三即事而理於一一一事行之中皆即諦理實相即如藥王燒身名真法供養無盡奉寶名為法施是其義矣若事義如後別序初釋若法行義如寶塔品中五種弘經供養一切者是若事即理如藥王品及釋普門中供養諸佛普中釋此為最要妙也後文自顯故此略之次明復能具眾德本前云智慧此云實相若尅實論依境發慧慧屬眾德實相是本植者種也初住實相理顯眾德斯備名之為植非謂初下種也例如前釋發心住義又若供養之時復更聞法智慧增明此又新植德本思之有云德謂三德謂智斷恩本謂三因謂應得等出之又今意云云次稱歎者復有此功德也佛本只令得佛知見今既得之稱佛本心而印可之是故稱歎次明復能三業妙用利益也如前已釋次入秘藏德三德即三般若名為佛慧妙達三惑即三般若故名善入所以秘藏名佛慧者正明佛慧攝一切德故也了非即是故名善入次明復能智境圓滿德初句解大智次句解通達或云一心是境謂境智今謂此是大論文只是總別明智正謂一智即三智也方便品初具釋橫竪照了皆無障礙故名通達次句者前既約智此言事理即當境也前既三智此即三諦前文已言三德並互舉也此事理即不思議權實境智也言分得者分中之首初即後故不思議分也勿任常情次者體既圓備名聲普聞即名聞周遍德也次句明外化德前以慈句且明化他體未論化分齊故此明之十界解無數作依止等釋能度生雖無數類聚群分不逾十界如何能度以大悲智而總與之作依止處大慈與樂故云安立大悲拔苦故云救護以此故云能度又依止即教授也安立即同行也救護即外護也前明自到彼岸此明為他作此三種智善知識令其究竟至大安樂之處故云能度也上十三句依論有別名因今亦可依附今文意立名名之所未暇也上是別釋十三句竟下是總結示於廣略對略明廣故言更有既無邊量故絕言慮以知然者依聖教故準道理故如華嚴等威稱歎美所有功德與諸佛等故理者以是圓妙固其然矣以是固廣多也略言等者對廣彰略既廣若是故知十三是其略矣應知此略是其要略非謂闕略以十三句即攝一切廣多義故。",
        "source": "X29n0596_007:0302b10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上釋初住橫義已竟下是釋前第二例顯後位橫具諸句義也初至等覺示後諸位亦復如是例顯具義並如前也明此中間有四十位一一具向之所說廣略之義故言亦復如是所以結者初住尚已如是況復以上故其信矣。",
        "translation": "After the above explanation of the horizontal meaning of the first abode is completed, the next is the explanation of the second preceding example showing that the later stages are horizontally complete in their meanings. The first stage to attain perfect enlightenment shows that the subsequent stages are likewise examples showing the complete meaning and are as before.",
        "source": "X29n0596_007:0304a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是第三引文雙證前二義也阿字短聲呼無也不也有人云文在彼經第五彼第二十二又云一字皆入四十一字四十一字亦入一字此謂字等又云一切語言皆入初字門亦入第二字門乃至第四十二字門此謂語等有云有引止觀記云字等者如金剛藏說十地十方說十地能說之人並名金剛藏名為字等同說十地名為語等功德無差名功德等此橫望也今謂一字一切字名字等如初住名阿字門四十一位俱名阿字名字等如荼字是妙覺名究竟餘四十一位俱名究竟中間亦爾故名字等言語等者皆俱四十二字音聲也功德等者皆具十力四無所畏十八不共名功德等也是約竪望故不同也今謂初但釋二次引記雖具釋三於此未了第三亦具釋三而義亦未可會今謂初三句正明三等義下三結為三等何者於初中復隨一一字皆即具諸字義是字等於此三處隨說一字即說諸字之義是語等隨一一字皆能今聞者悟解諸字義理利益是功德等字即名字語即言說功德是彰字之利用結此三事均齊故云字等等也文中明言諸字功德而釋言皆具十力無畏等者豈非謬之甚哉以此文證知前之二解皆橫具一切明矣應知此中雖橫而竪初具一切而復通至後故雖竪而橫一一皆具一功德故乃至四句難思始謂圓妙義矣前竪雖即具橫為順人情且呼為竪此中雖四句難思對前竪故且名為橫宜善思之。",
        "translation": "Next, the third quote from the sutra is a double-authentication of the first two meanings of the word a. The short sound of the word a is called nonexistent.",
        "source": "X29n0596_007:0304a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是第四料簡於中兩番問答初番雙論橫竪亦是簡偏顯圓次番專論於橫亦是專論於圓觀此義意亦似約教義也以上之兩橫竪之釋即當因緣故此義當約教思之且初問中先定其宗此是問者將欲問難且先審定其宗並是歎真證德故云斷也此中應有結難出盡其勢次正問難縱三藏菩薩舉三藏聲聞以況例迹為以下正難以此二教皆從初即有斷惑故此意齊正應通歎何故橫竪皆但歎圓意在顯成圓義故也而言迹者此並二門之後迹義即有其二可知答中亦先縱其通次奪以彰別圓人即二本謂久近二實也亦應結難可知次問者此義前已釋竟為欲對舊偏以顯今圓故更言也答中初明橫竪無方責其方問次對舊顯今於中初對舊偏以況今圓次以初而況後思之。",
        "translation": "The first two interpretations of horizontal and vertical are causal, so their meaning should be considered in the light of the teaching. In the first question, the proposition is first defined, and this questioner will first examine the question and define the proposition.",
        "source": "X29n0596_007:0304c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次此料合是第一釋第四引證科錯來耳下是第五引論所解雙釋成前二義論於此歎德十三句文總為二釋一上支下支門二攝取事門此二皆各盡歎文也今此先述論釋正上下門次述論釋攝事門初中有三先述論標次述論釋後總結會初中云上支等者有云支者持也謂上下各持其義也今謂此都不可支者分也上下即前後也相待得名分是分齊差別之義明此歎得之文有上下二分之義例如前文有上上起門義也次述釋中文應有三謂雙標其義雙示其文雙釋其義相狀標者何者上下支謂總相別相也以總在前別在後明故云上下以下是示其文準應雙示故論云皆於菩提不退轉是總相餘是別相此即雙示文也今又影略故但單示以不退轉統該下十二句義故言總下十二句分別顯前不退轉有此差別故言別下是釋其總別義之相狀初之一句是釋總義又即是標別釋何者論云不退轉有十種義正言此十是不退轉之所以故是釋總不退轉有十義故即是標起別釋故此一言是標是釋所言義者所以也因緣也所以於無上菩提得不退轉者正由此十所以故立十義也言示現者即顯示也即束十二句顯示十種義謂第四第十各有二句故即十二以為十也。",
        "translation": "The second part of this explanation is the first part of the explanation, the fourth part of the proof that comes from the wrong ear, and the fifth part of the explanation that leads to the double explanation of the two previous interpretations of the thirteen phrases of the Awakening Discourse, the first part of which is the general explanation of the thirteen phrases of the Awakening Discourse, the second part is the explanation of the two aspects of the taking in of things, and the second part is the explanation of the three middle and lower parts of the Discourse, the first part is the explanation of the labeling of the Discourse, the second part is the explanation of the Discourse, and the second part is the general conclusion of the assembly.",
        "source": "X29n0596_007:0304c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞法以下是次述論中別釋其十即有十別論中一一皆先立名次示經文又論中一二乃至九十之言今文略之以易知故也且初由聞法得總持故能於無上道得不退轉此即因果能所之義可知後九勢數例可知矣有云此翻總持持有四種謂法義咒忍法謂名義謂理咒謂詞忍謂智法是門故義謂釋故哭謂護障故忍得解故又有人云總持有二一攝二散攝者持也此是聞持聞於文義任持不忘即所聞之法能持名之為抄聞即總持體是念慧也散者施也此有四種一法二義三能得菩薩忍四明呪施與眾生故此中二種初是能持即聞持是也後是所持餘四種是復名為二一自利聞持等也二利他法義等也因果別故次者應如前皆得字貫於此也樂說之義已於前應置此中應移前文置此中安之辨謂四七等知前由得此故故能樂說由得樂說故故能不退轉也七辨之中第七謂一切世間最上妙辨具足甚深如雷清徹遠聞等五種聲故有人解言有五一甚深如雷二清徹遠聞三聞者悅樂四入深敬受五聽者無厭此即佛五種音聲也三說不退轉者轉即是說故名說不退轉不退轉即所轉所說也有云無生正觀體可揩摸故名為法流演圓通不繁于一人故稱為輪又無生正觀無累不摧亦是輪義一得不喪名為不退自我之彼故稱為轉有云法輪所說常說此不退轉法故謂轉如前四位二種不退轉法名轉不退轉法輪又彌勒所問經云說自分功德名轉不退法輪說分外功德名轉不退法輪又說智不退說福名不轉又說般若說方便名不退不轉又說有為行說無為理名不退不轉法輪輪有三義一圓滿義二不定義自利利他入於聖道展轉無窮故三摧壞義聖道在心能摧煩惱能摧伏能鎮已伏如輪王寶故喻如輪轉者動也顯也運也起也動宣言教顯揚妙理運聖道於聲前起真智於言後圓摧障惱名轉法輪下方便品當具顯示命如前文已說亦可移於此次四義中合兩句文為此一義以二句並言佛佛是最勝善知識故由此依止供養故得不退轉也供養即植本亦可供養又聞法能發智慧故是植德本也已如前釋次五義者由稱歎故自他之疑決定盡故以此故得不退轉此義即如下文述成授記義也前文亦以略釋有云為者使也被也得也此由行與佛會故致之也有云謂斷事理疑煩惱所知二疑分盡所知是俗中二理之障煩惱是空理障又所知是塵沙無事惑煩惱是見思惑合則二障離故三惑理事準思次第六義論云六者為何等何等事說法入彼彼法不退轉如經以大慈悲而修身心故有云經中闕心口論中闕口正經具三業語雖有闕其意皆含互隱顯耳今謂又此經但有慈論經加有大有悲皆文互闕義不闕也若單若復皆等也又云此釋所由諸菩薩為何等事外為他說法內入證諸法故以大慈悲薰身口意現種種形說種種法設種種方便拔種種苦與種種樂顯二利他一自利故內證諸法二利他故外為他說今謂此二即是事也行會此二故名為入以此之故於無上道得不退轉次第七義入即證也智境即佛慧是所證入也入是能證入也不入而入不為善正由此故得不退轉也有云此言顛倒應云入如實境界之一切智不退轉即入觀照智與下第九別若依論文便無異也有云今謂證一切智名為入俗能證人名入也境智俱證為所入也次第八義由證人法二空故得不退轉與前雖俱含能所前意在能此意在所也思之有云法我二空皆見中道方異別教今謂且消論文不在此簡次第九意由證理極故不退轉他云窮如實性故今謂窮理盡性唯佛一人今是隣極故也次下第十依論文應云應作所作住持不退轉疏文闕略矣住持二字論立名有二義示經文但有一義他云此有二句合為一句名稱普聞無量世界故能住持佛法今法不減眾生聞名信而修學能度無數百千眾生故名應作所作菩薩所應作謂利眾生故二義在其中矣論經但二作闕住持也名正與今經文相當也或由不退轉故能此二用正由此二能故永不退轉總此十義是不退轉別相之義矣。",
        "translation": "In the following section of the explanation, the buddhas' personal, verbal, and spiritual abilities are combined with their mutual compassion to express the meaning of the scriptures, such as the external explanation, the various forms, the various methods, the various sufferings, the various pleasures, the two functions, the two abilities, the two functions, the two functions, the two abilities, the two abilities, the afflictions, the afflictions, the two afflictions, the afflictions, the afflictions, the afflictions, and the other hindrances.",
        "source": "X29n0596_007:0305a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下是第三總結會其中二句初結論中二相會於二支次會今文橫釋即同論中總別初不退轉一句對於初住即橫中之總亦即上支次十二句即橫中之別亦即下文支故言同也思之思之。",
        "translation": "The next is the third summary that combines the two statements in the first conclusion, the two aspects in the second conclusion, the two branches, and the second explanation of the text as a whole, the first nonretrogressive statement that's general in the first abode, which is the upper branch, and the second twelve statements that are specific in the second, which is the lower branch, so they're the same.",
        "source": "X29n0596_007:0306a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是第二述論釋第二攝事門此亦盡十三句也於中亦二先述論解後結會今釋初云攝取事者謂攝取諸功德事也論於此中又為二釋於二釋中亦皆各五十三句也且初釋中先總標列次別牒釋論云示現諸菩薩住何等清淨地中因何等方便何等境界中應作所作故此總標也論下牒釋十三句中分之為三於無上覺不退轉一句是住何等清淨地中次有十句是因何等方便後之退轉二句是何等境界中應作所作故論牒釋中唯解初二句標不釋第三句何等境界中應作所作故地清淨者八地已上三地無相行寂靜清淨故此中以無相理名無上正等覺故後三地皆於無相行任運寂靜離障清淨名不退轉非諸垢染有相等之所退轉故也第二句因何等方便者有四種一攝取妙法方便任持妙法以樂說力為人說故此攝三句任持妙法者皆得總持由得聞持任持妙法令不捨離任在自心持之妙法不忘故名任持以樂說力者樂說辨才故為人說者轉不退轉法輪為人說此不退轉故二攝取善知識作所應作故此攝三句以依善知識者供養無量諸佛故作所應作者於諸佛所植眾德本德本即善根是所應作故由此常為諸佛之所稱歎三攝取眾生方便以不捨眾生故此攝一句以慈修身由以大慈悲薰修身心故能不捨一切眾生常能救度四攝取智方便以教化眾生令入彼智故此攝三句善入佛慧通達大智到於彼岸由自有三智能令眾生攝取三智故自成三智者是諸眾生攝取三智之因初智知如實自利智也次智是知事智利他智也後智是真理智實性也有人會云初是一切智次是道智種後是一切種智他云論中唯解此初標二句不釋何等境界中作所應作此攝二句謂名稱等是何等境界能度等是所應作由菩薩具三智等故名聞遠振十方世界能於此無量世界境界中度諸眾生作所應作度眾生者是諸菩薩之所應作故以上是述他人解釋論中標之與釋其義如是今此文中直述論中標不述論中釋論初釋標中唯有三何等今文有四皆云疏誤今觀義釋第三句中實有二義謂何等境界是處所即前二句經文是應作所作是業用後二句經文是疏深見此意欲彰其義今後知之故以加之固非誤也幸深思之論中次變一番解釋非此中要故文所述。",
        "translation": "The next is the second explanation of the second aspect of the second statement, which also contains all thirteen sentences. There are two ways of explaining this, first stating the explanation and then concluding it. In the first explanation, there are two explanations, and in both explanations there are fifty-three sentences each.",
        "source": "X29n0596_007:0306a15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "若縱以下是次結會顯成今初竪釋意也此中意者正取初句以後三地對前七地即十地也又淺深不同正當竪義與論意同故云無妨總其大要引論兩釋正為顯成前之兩釋故前云引論雙釋成前兩義即此意也此前因緣等之義並在前不退轉總句中釋竟故此不更別論觀心持要前文略故此更明之前是約他此是就己前是果此明因前是中後今就初心以此故更明之謂初心能作此觀即能具此諸功德故此歎德不局當時中之與後亦即欲於即時初心矣此中合第十及十一為一故但為十二觀於十二中第二第五此二各有二重餘直單釋於中一一皆須知六即義深須作意無得謬妄然眾皆云此文易並不釋今謂亦不易試略明之初言如前三觀即三不退也次句二番初即當經次即餘經能轉假而即空故無有中能轉即具一切故中道法性雙亡雙存故文義字理皆是所聞所持教聞而能持故心王心所皆是法門即所行所持於是行中能持之故轉有而即空故於無有中能轉即具一切故中道法性雙亡雙存故空觀知一切法但有名字實不可得即而持之故為聞持假立達一切心法皆是法門皆所行用亦即而能持之中觀即能持於實義故此三亦即聞思修也餘經復說四持如前今從義便故但言三此皆任理性修圓便故次以假為首者隨其義便妙觀無方故法即自心一切法上能詮之名字故義即所詮之義理故詞是一切異類言音不同故空是了達一切無有定實但有音聲語言故次者樂說總前三今觀心之三一界之一多皆具多句即法皆實相理即義但有名字即詞旋轉無礙即樂說無礙二字撮貫前四以四皆名無礙故也達有即空故位不退達理即事故行不退達邊即中故無異念。",
        "translation": "If the following is the next conjunction, it will be expressed as the initial meaning of the explanation. This middle meaning is precisely taken from the first sentence, which is the latter three stages against the prior seven stages, which are the ten stages, and it's different in depth and shallow.",
        "source": "X29n0596_007:0306c07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次約觀明供養者先明供養佛義順佛語即奉教命即是順佛意也下正明供養佛是能說三觀之人三觀見所說之極理即佛之極意也依而修行是極承順妙供養也供佛意為顯道即供養法能與三諦理合故即供養僧經但明佛今言三者一即三故所以供佛為破惑故為顯理故供佛之意正在於此故即具三亦即一體三也次重釋者前猶兼事此一句行人心也觀智心即佛眾行心資即供養也即正助為能所也法者即合向能所為能境法界為所供也能令境智心味即供養僧此真觀行之供養經云是真法供養即斯義矣次觀植德本文有三句初二明德本後一釋種植義初以實境為觀智眾德之本次合前能所為眾行德之本後句含前二義依實相修觀智是植觀智眾德本依正智修眾行是植眾行德本得此二本德自成立故云則立儒家亦云務本本立而道生而今得不務乎眾行即福德萬行也次釋佛歎事釋由行與道合為佛所印可今以觀會於境境順印於境觀智即以境為佛順從於觀名為稱歎所言冥稱境而觀非謂證也印者符順義也智有以下是明常為之義即此之觀是常為佛所歎也法緣能得真法樂生緣能為得俗法樂無緣能得中道樂次入佛慧者三佛同一體三觀同一心三智即彼岸三觀為因三智為果若因中說果三觀即三智六即思之約普聞即以三觀為能聞謂名稱普聞也三諦為所聞處謂無量世界也更重言之者向真俗不言普故更通言之次能度中三觀皆有能所可知次結明廣示略開權顯實一切諸法無非三諦能如理觀無非妙德故非歎能盡隨文略說故且此十三句了此即妙法之意善而思之。",
        "translation": "The next step is to explain the meaning of making offerings to the Buddha, first by defining the offerings to the Buddha, which is to follow the Buddha's instructions, and then by defining the offerings to the Buddha as someone who can teach the three contemplations, who sees the ultimate principle explained in the three contemplations, which is the Buddha's ultimate intention, and who cultivates the practice based on that practice, which is the ultimate commitment to making marvelous offerings, to the Buddha's intention to reveal the way, which is to make offerings to the Dharma, which is to make offerings to the saṃgha because the Dharma can be united with the principle of the three truths. The sūtras only explain the Buddha, but now they say that the three are one, which is three, so the offerings to the Buddha are made to destroy confusion and reveal the principle, so the intention to make offerings to the Buddha is based on this, which is to have all three, which is also the three in one.",
        "source": "X29n0596_007:0307a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次列名者雖通美其德未知其人故須列其名也疏文有四初總明名之所從次明名含多義三明釋之方法四正隨文消釋大士人也即前自他求無上大道之人故名大士大名即名備眾義也從三立名法門即初悟入之要德行即所成所行也於三或單或復或具如次所釋即自可知雖是等者即前大名義也謂從前三及以偏圓本迹故備無量此中意謂名偏而義圓也亦如後釋中自見依經謂依諸經中所諸此即略兼三義故但標二方法即兼四也不同聲聞事迹限定菩薩無方故但憑經教略述之也次正釋中卑云諸經列菩薩次第各隨因緣非定一例或以主客為次第如大品先主後客或大小為次第如此經文殊位高餘人位卑今謂各隨當時因緣不可定準今此文殊居初有其二意一事二義事以其菩薩於此經中發起流通皆為初首即如過去二萬燈明因之而說說以付之流通今佛亦因之而說最初入法流通略舉如此餘應更多以此事行之故最初列之義者此經名妙法其人往名妙光現名妙德亦妙吉祥正以表於妙法故以妙人最居初列例如華嚴名大方廣故以普賢居初則彼經亦以二義故列於首或曰何故其人獨具二義以其最初得此妙法故本誓願故顯法妙故以故獨爾思之思之。",
        "translation": "The second is to list the names of those whose virtues are generally praised but whose persons are unknown, so their names must be listed. There are four commentaries, the first summarizing the source of the names, the second explaining the many meanings contained in the names, the third explaining the method of interpretation, and the fourth correctly following the text, explaining that the person who seeks the unsurpassed way from the previous self and others is therefore called a great person, and the great name is the meaning of the preparation of many names.",
        "source": "X29n0596_007:0307b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文殊中文有二義即具四文二即向標云依經依觀也義具四者初依經中即具三釋之義故也初依經中初三句翻名次四經釋義初三中初一是翻名次二是異名言妙德者義如次釋新云曼殊室利此云妙吉祥吉祥即是德義次異名者此二並猶梵語非此方言儒本或作濡或作濡即是文殊略其文字首是師利此是西方二合之音梵唯一字即是師字略其利字人多不曉便作此方解釋謬之甚矣次釋義中初三正釋名第四是本迹所引三釋一一皆釋妙德但初二是德行後一是願又初一自證德次一利他德佛性是性德妙也了了見故是修德妙餘性非妙佛性故是性妙雖見不了了修德未妙了了見故是修德妙又修性相即四句無方故名為妙從此德義以為名故名妙德此從自證德以為名次是利德妙也說法利他即是德不起是非有無二相即是妙從此為名故云妙德此即善能分別諸相於第一義而不動也此且依經若義要而言亦可三德秘藏不縱不橫名妙德也上二德行以為名下一本願以立號於中有發願有佛印記願中有三初願未前所化先成極果次願成已國內所他皆住極圓三願所行之行廣遠此三願即是功德莫非妙也思之思之佛印記中有印有記功德是德甚深是妙德深印其初願妙土印其次二願也思之總此行願為名故名妙德此中既是因緣應具四意者總行願以立名即世界自證妙體即第一義化他破相即對治往願即為人此並圓實非後偏權即是教義故不別論次本迹者體用無方隨緣適化十界差別略舉其二即權實也若首楞嚴久遠成佛號龍種上尊王望今北方此即久近之本迹也觀中三德釋德秘密不縱不橫釋妙心性本爾是性德妙如是觀了即修妙也彼之妙名因此以致今能此習豈遠乎哉正即此經要行矣三攝一功德故言秘一切功德皆歸此三故言要無前後故不縱亦非一時故不橫又即三而一故不縱即一而三故不橫以故妙也。",
        "translation": "In the first place, Mañjuśrī's Chinese has two meanings, namely, it has four texts and two, namely, the Xiangbiao clouds rely on the sūtras and rely on contemplation. The meaning of the four is that the first three statements in the sūtras rely on the meaning of the three interpretations, the first one is to translate the name, the second four sūtras interpret the meaning of the first three, the first one is to translate the name, the second one is to synonymize the meaning of \"marvelous virtue.\" The meaning of \"marvelous virtue\" is as explained in the second explanation, the new one, Mañjuśrī, the cloud, the wonderful auspiciousness, and the auspiciousness, which is the meaning of virtue.",
        "source": "X29n0596_007:0307c16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "觀音中先翻次釋具足梵言應云阿嚩路枳帝濕嚩囉亦直云嚩路枳帝濕嚩囉上嚩字音(房可反)下嚩字音同上但與濕字今呼梵音只是一字路字或作魯或作盧正應作路中間枳字音(吉以反)作吉字呼亦得舊譯極訛略故云爾也嚩此云觀也路枳帝云世也濕嚩囉云自在也具足正云觀世自在菩薩北魏菩提流支以為此譯若言音者應云瞿沙亦云瞿衫此云音也既言濕嚩囉故是自在正由古譯以濕嚩為稅或為輸又略其囉字則稅輸二音與沙衫聲相近便譯為音於下經文自釋得其一義仍闕其二若言自在三義具足若以義隨方一即具三口機義便亦無嫌矣至後自明釋義中初是德行而有二義初是觀世身次是觀世音初是大慈與樂次是大悲拔苦然身中亦含意機別言即三名合言即圓觀世間三種機感而圓應之令一切離苦得樂名觀自在也次明願中但約二論感應拔苦義亦具三與樂本願如此從願授得名今德行皆是植此願也次指下文自釋疏亦廣解然應四要者總行願是世界見得道是第一義拔苦是對治本願是為人此亦皆即圓用非偏所能即教意也本迹易知下文自釋總此諸意故注(云云)約觀中言三智者正應言觀而言智者似求嫌或傳寫誤或且通相以說又以觀釋音義亦難解何者且外事釋音是口機猶屬卅境故後廣釋中世音並屬所觀諦境今約觀論豈非難會意謂心是語本觀智是心舉本攝末以觀觀於諦境即是言語音聲故也記云釋初二字與下不殊而第三字與下稍別下約事釋以所被為音此約能觀以所宣為音由觀故設教故云觀是語本有云由智方有言說故也思之思之。",
        "translation": "In Avalokitêśvara, the first translation and the second explanation are sufficient, the Sanskrit word should be Avalokitêśvara, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, the sound of the word Vaughan, and the sound of the word Vaughan.",
        "source": "X29n0596_007:0308b02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "大勢至者皆此經始終皆言得大勢舊及今文皆云大勢至若會釋者其義是同但諸經多言大勢至義從多故也若分別者得大似約自證於體大勢似約起用文初約兩經即行願也初我投足處釋至也能震動一切依正釋大勢也明其所至到處皆能如是極大威勢從此力用之義以立名故也應知非但魔外道亦爾非但界內界外亦爾宜善思之此由自體依正皆融故能爾也次願者據此願及記之義勢即當世至即志也志願取大世界以為名故也前言一名含於眾義即此類也若會而言之即以大志願勢力而取世大界故也然無量義所作志字故知含二義明矣此中四要者總行願世界也處所依體第一義也震動等即對治也願即為人也次第亦與前同即謂從四要以立名教本可以例前後知也又教門從昔有差別於今唯一妙絕故不多言下去例知次約觀中即約前德行之前以明觀也觀中以何為足謂止也所投之處即諦理也三止如止觀體直止方便隨緣止息二邊分別止也足二地一今並言三者然經但言足處亦不言二之與一今約觀義故須爾也必從事者三只是二謂權實二止事理二地也二三無方不應定執言所依之處謂妙觀隨所觀境然皆轉成妙道故也此既一切皆妙可謂釋大觀矣明此義故注(云云)他人以上三聖者為一對謂大慈悲與樂拔苦也文殊大慈與樂觀音大悲拔苦勢至兼二今謂定慧妙德兼二以從三德名故觀音慧以觀即智用勢至定勢用依定起故約大慈悲者文殊兼二故名妙德次二別對義自可知又約功德智慧初兼二以於此經能答能問故次二別此並為物從別約其實德無不圓備故今文不論後皆例爾。",
        "translation": "The attainment of great power is something that both the beginning and end of this sūtra say is the attainment of great power, and both the old and present texts say it's the attainment of great power. If there's a distinction, then the attainment of greatness seems to be about self-realization in essence, and great power seems to be about the arising and use of words.",
        "source": "X29n0596_007:0308c07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "此下應釋常精進以與不休息大同可以例知故略之也有云眾生無盡恒須救拔故名常精進斷除自惡如救頭然他云此二自利利他對自行常勤利他不倦今謂此兩家皆以二利為對而前後不同在文易見此並人意若據經說初從利他次約自行通別例知且常精進者如大寶積經云是菩薩為一眾生經無量劫隨逐不捨猶不受他而無一念棄捨故名常精進此亦行願兼於其中總別及此意意為令入道故即具四意此是圓見妙理非偏所能二種本迹亦例可知觀者心境無邊妙觀觀之要令盡會於妙道故名常精進也。",
        "translation": "Here, the following should be explained as constant effort because it's the same as not resting and can be understood by example; therefore, it's abbreviated. There's the saying that sentient beings are endless and always need to be rescued, so it's called constant effort to end their own evil like saving the head.",
        "source": "X29n0596_007:0309a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋不休息者前是為物[鉆-口+夗]志決定勤求此明已得為期永無休已故也在文易知梵行即清淨行謂二利也功德即福慧也此中要意但欲慈悲長時下化上報佛恩未欲受他供養故也此中亦兼行願總別兼所依體皆是圓德體用難思三意具足觀中言不住者意明即故於一切心皆爾住即休息以不住故即不休息常作是觀即是其人固非遠矣六即知之次釋寶掌者他釋皆云手出眾寶惠施無竭也此少分義未會聖教圓旨今此文中所引經釋及含二義不與人之所釋同雖含二義宗中釋者要自不知二義者一者掌護珍寶能所合為名也二者持寶惠施於人亦能所合為名也初即守也次即手也二所之寶是一謂是大乘妙法寶也二能之掌義異而體同謂掌護與執持也二俱是智惠也文中初至二乘即注云掌於寶也常以以下即將寶惠施也初即自證次即利他也被去聲呼即服著也字正從手世多借用此字此一字喻自修證也起大誓願也此即依體起大誓願守護大法寶也乃至等者顯誓願堅固無能毀壞也佛尚不能況其餘者故云乃至此掌護也總此一句即前於無上菩提不退轉之義矣爼者此文音阻禮器之名非此中意有改作阻亦非此意正應作沮音咀意謂毀敗也今釋守者記云簡於法寶濫今謂此義釋成上猶屬初義外則佛不能壞內則夢寐之間亦不念於小乘故是成前義而言令釋者有云此是佛佛令菩薩為人說大乘法也不志二乘者以乘人不能說於大乘所以夢中亦不令志於彼此未可會猶是釋彼名義故今恐此二字誤或是守攝字應更撿彼經又志字大或作至字至是至到志是好慕謂守護大乘乃至夢中身心俱不繫至彼也又亦不繫志念於彼也次明持寶惠施於人初以二心即能持之手也為人講宣即正慧施與也珍寶即所施無上法寶也是前所證所掌之寶也言二心即權實二智用此二智為人宣說大乘妙道如以手持寶施與人也只應權何以言實然下文二智皆名方便也此中亦兼行願總別自得令他即具四意皆妙非權前經已說此事則本迹明矣則三釋之義可知次觀中三諦諸佛所師寶之極也一心之三即不思議觀也若不如前釋者焉與此文合故從來所釋並不合此文信矣信矣。",
        "translation": "The second explanation of not resting is that the former is to [drill - mouth + turn over] for things, and the will is determined to pursue it diligently. The text is easy to understand that the religious practice is a pure practice that's twofold beneficial, and merit is virtue and wisdom. The main idea here is to only want to be compassionate and long-lasting, to teach, to repay the Buddha's kindness, and not to accept the offerings of others.",
        "source": "X29n0596_007:0309a23_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋藥王下文廣解此中略解但明以往願記得名願中有四初二是報恩願次二是大悲救生願大慈亦在其中此四願中之要矣言一千四者或言千中別舉其四或言并四並所未詳待檢餘文又此四願初二供養佛次二亦是供養法僧即供養三寶寶最為要勝次佛記言火淨者皆云從燒身以得名今恐義與其願義相乖都難通會若前四義亦似稍難今恐字誤或是大字如前四願並今依正皆得清淨故是大義又前二義是火淨後二義即藥王也思之此文雖略亦具四義總四世界前二報恩為人後二對治最後成佛令物得道第一義矣教義例前本迹如後兩品中說可知觀者一心三觀能除五住因穢如火淨能除二種果苦如藥王下文身心兩病(云云)要意略爾故(云云)。",
        "translation": "The next explanation of the Medicine King is explained in detail below, but this is a brief explanation that only explains the four vows that were previously recorded in the past and named as vows.",
        "source": "X29n0596_007:0309c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下次欠釋七菩薩者未見因緣若直義尋共有故且略也勇施者有云大士了畢竟空捨身命財不生怯弱故也此皆有願行合說故此為利益故為破己妄著故皆為顯道故此即四意皆為法如法而施即教義久住實相無捨不捨為物而說捨矣觀者妙達心性三諦之理肆意而觀也他以此前三聖為濟貧救疾對寶掌為濟貧藥王救疾勇施兼前二一往少分義耳若今所釋一一皆即法界前云一名備無量義寶月者有云智德可珍如月可重也月光者智用斷惑如月破闇也滿月者智相具足如月圓滿地云此三導明破闇對寶月能導智明如月可重月光破諸癡闇猶如月光滿月能為二事今文不釋可以例知能破生死而得涅槃是可珍貴故名寶月又能不住涅槃反照世間為物除闇故名月光雙限兩存智用無方故名滿月總而言之即三智也總三隨世樂欲也別三次第即後三義四要足也其義通至今意別一一皆即具三圓妙意也本住三智迹示偏也觀即三觀即一而三即三而一也大力等者他云此二神通小大對由化神通警覺有緣皆令發意能動百世界名大力能動無數名無量力今謂今文不釋亦可比例自能破邊顯中名大力能化二邊名無量力此二皆有行願總即世界別即為治為令歸不二體即第一義此皆圓實之人皆久成極而示此迹觀者直觀中道雙照二邊之觀也越三界者有云慧踰生滅道跨三有也云三界所除也越者離度義也今謂如此兩釋未足顯其體德今謂超絕二種三界也此且是德亦應有願合離即有要教迹可知觀者即空故越分段三界德即假即中故能越變易三界也上七不釋者諸釋多不近足可取略傍宗門釋之如是。",
        "translation": "Next, the lack of explanation of the seven bodhisattvas who have yet to see the causes and conditions if the direct meaning is sought to be shared, it's also abbreviated.",
        "source": "X29n0596_007:0310a04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋跋陀翻中新直云跋陀囉無婆字陀字輕音與囉字合呼梵唯一字故此云賢護然善與賢義同守與護理一應知善是善能之名非善順義故賢字訓能也諸釋皆謂隣聖曰賢固道曰守此但得自行之義未盡經旨今文引經釋者若聞名能深信者則為聖者善巧守護令其決定至無上道此從善守護他為名故非專自行也宗中有云謂守此善事名為善守謬矣他云前是離染此是進善為一對此極淺而狹闌未足揚經明德德行即兼本願聞名歡喜信受斷疑定得菩提即四要義此皆圓實非餘偏權諸經既盛歎美固非適近觀中初句標觀體於諸下釋名義意明善守觀者即是中道正觀也此觀何故名為善守釋云以此觀於諸善巧守護之中最為上首故也即以上首釋於善也以中道為善巧最能顯護諦理故也。",
        "translation": "Next, the explanation of the translation of the word bhadra in the new direct teaching is that there's no Sanskrit word for bhadra, and the Sanskrit word for bhadra has a lighter sound and the word for bhadra combines to form the only Sanskrit word for this reason, it's called good protection. However, good and good are the same in meaning as guard and guard, and it should be understood that good is the name for being able to do well, not for being good and compliant.",
        "source": "X29n0596_007:0310b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次彌勒者正梵云改帝隸亦云迷帝隸譯者不切變迷為彌帝隸為勒并慈則同下引三經是釋名義初是德行次是往因亦兼發願後是本願初一由於後二由本願力自住令他故也有引一切智光仙人經云昔作仙人名一切智光值慈佛說慈三昧經發願故名慈也華嚴云初得慈心三昧故名慈也見調象者時王乘象因見其類奢奔逸無禁乃責眾象師師云欲心熾盛非身不調却後三日欲心息已便取其象燒七鐵丸使象吞之吞竟身死諸臣問曰如此欲心誰能調者時有大臣告云佛教能調王聞發心願當作佛救度一切從是得名如淨名疏廣釋次明本願與前何別前是對苦境而發心此是對勝境而興願也向之二事皆是拔苦乃是悲何故並名為慈此明圓妙一具一切萬行萬德都在其中不須強為異釋總此願行是世界見而得定是第一義賢愚是對治悲華是為人一行之中具足一切即是圓教諸經盛談德行本迹不知次約觀中大慈有三若舉無緣即攝三種事中住此無緣慈一切無為而無不為諸有緣者皆自從他令修此觀以此妙達一切心法無非妙者故云離諸不善悲義在其中矣次又釋者會通後文說也彌天師云莫能勝即無能也即是慈行最殊勝故也有云此文應移於前因緣文下今謂此是因便而來非正釋名故諸家亦並不言若具而論於此名義即應自具四釋正有此意故注(云云)廣在餘文此未暇也。",
        "translation": "The second is Maitreya, which is the correct Sanskrit word for change, or Maitreya, which is a translation that doesn't cut off the change of Maitreya into Maitreya and Maitreya into Maitreya, and the three sutras cited below explain the meaning of the name.",
        "source": "X29n0596_007:0310b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋寶積未見經說其義可知故諸釋財法二寶積集兼充也今謂修因圓滿法界眾德無不委悉故言寶積既悉備足行願咸在其中既自充足復能總為世間生信去疑悟道四利備矣既已備足圓義自彰迹用自顯能觀三諦諦顯智圓寶積義矣。",
        "translation": "The next explanation is that the accumulation of treasures has not yet been explained in the sutras, so their meaning can be understood. Now, it's called the cultivation of causes that completely fulfill the Dharma realm and the many virtues that are not incomplete, so it's said that the accumulation of treasures is fully replete, the practice and vows are all therein, and it's sufficient for the world in general to give rise to faith, remove doubt, and awaken to the path.",
        "source": "X29n0596_007:0311a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次導師者自能通達正道復能引導一切未通達者皆令通達故名導師文中初一句即所導未達者也大悲心能導之體也令入等正道即智慧故喻之也不求恩報報師之德也正由自己得道無所須故但以愍未而導達之故不求報若求則反彰自己未得非慈悲也以此之義故得名也經釋如此諸釋多皆意作未可此是德行亦應有願總則世間大慈愍物為人也令入正道第一義也不求恩報對治也無緣大悲一切種智皆圓妙也其來久矣今示引物耳三觀能也萬行所也不二所離之有也皆入所會正道也既是妙觀一切本即更何所求也未釋等者八名未釋也以未見緣起故憑經作觀既未見經說故亦無觀解今略附謗消釋已如前也所以前釋皆悲華經者諸菩薩願多在彼經中說故也。",
        "translation": "The first phrase in the text refers to those who are guided and have yet to attain the right path. The first phrase in the text refers to the essence of the mind of great compassion that guides, causing them to enter the right path, which is wisdom, so it's a metaphor.",
        "source": "X29n0596_007:0311a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六總結者如是指前列者等指餘不列者也略知其類不可備陳故等言也例於列數八萬亦標宗主也如前已略明上來眾三類中第二菩薩眾竟下釋第三雜眾於中有四初標起次總釋意三別消文四通料簡初雜眾重標示前別章門也者者是起後總釋義名也於中有二初總對舊略標今意所謂以下次正釋也初中先述三家偏失次正標顯今意以兼言凡夫者藏師觀立此名以對前二為聖故此中有聖者諸經中盛說其聖德故況皆已開顯故俗者曾見舊疏不顯名字作此名也意取對前二是道故也有道者皆得道故如初固來及流通首故云準經現文無出家五眾應章安筆誤今謂疏云其中有得道未得道者等何須論其形服故自誤耳天人意取勝多故有龍鬼者前二違義此一違文皆不便者指前三家所立名也皆非巧要不盡其實故也慈恩此下五類名義外護眾此稍似得但對前為內又以未便不如於前大開為三謂初總名內眾次名內外兼備眾以其中亦有出家菩薩故後直總名為外眾此名稍似得而用者窂惜哉今前文約三諦釋即兼有此意矣。",
        "translation": "In the sixth summary, this refers to those who have come before us and those who have not been mentioned in the rest of the explanation, and it's briefly understood that their categories can't be summarized, so it's also stated as follows: \"For example, in the list of 80,000, we'll also label the patriarch.\" As explained above, we've briefly explained the three categories of the congregation from above, the second category of the bodhisattva congregation, and the third category of the miscellaneous congregation from below.",
        "source": "X29n0596_007:0311a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次正標今意者舉雜一字統收前之三雙文之與義無不畢盡故云兼矣可謂真要便矣亦如毗曇約處中說名為雜心義矣從此向下訖其次第以來少許之文宗中諸釋雖多不同至於宗旨並未可會今亦不能述今以為釋向所標雜兼之義狀也於中為二初約因緣又雜以下是次約教初中明有二義故名為雜謂數類多故不次第故即有二別初中先正釋次會通有無初中類數雖多不出三種謂道界番也以道言之六中唯五無地獄一以界言之三中唯二無無色一就類言之則有八也此中隨舉其一皆即攝其餘二然要必具三方盡其體若單舉其一則顯實不固故備舉此三也既必此三義兼眾多不可單名若隨一為名皆失其實欲一以蔽諸義切於雜故是正釋雜義下會通有無者釋前無一道一界義也將餘經有難此經無世之常心也方等雜道中陰雜界方中事如此文釋中陰經中具明佛以神力至非想非非想天接中陰眾生至彼天中為其說法皆得大小乘道廣如彼說又非但往彼如本業仁王大經後分皆明無色界眾下來聽法則此等諸經具化三界方等具六道有無之義如後料簡然此是略本故闕廣本無量或皆具化亦如大經前分則無後分則有也此皆等者今釋會也隨機有無適時應現彼有此無故不可一例又雖不列至而亦光往照彼則聲化此則光益此亦不可一列也此下明第二雜義非但雜多又復次第不定以雜亂故復名為雜為明更有此義故云又也於中有四初標不次第次破舊人強為其次三出不次第相狀四結以故呼之為雜初不定者如後指闍王也次出舊者意謂佛聲聞菩薩皆是人類次後即合便列人王而今所以最居後者正以此意故其是當處之人耳又是國主故云土主之禮理應權讓總指天龍神並為客也次引經彰其道理非也彼經亦列三眾次第亦與今同於雜眾之中有其四類初天龍八部次比丘尼清信士女三眾三大小金銀等諸輪王四國王王子國臣國民國士國女國大長者各與眷屬百千萬數來詣佛所列此意者正明四輪及諸王等皆是外來皆非地主故文云又諸萬億國也若有相讓則應前列今並在後故非相讓又明矣出自以下略明其意既同是一處時會而事如此者此自出於結集之處趣爾而已非人王自作何論相讓之意故不可強為其次第也或云取求之言恐未為善今謂此言盡善而人不知於次當釋去取今謂此或必以為有別意如諸所釋者今未能詳之此有深意不用諸釋也理既非妙詳之何為有人云但隨當時來集前後次第故如是也今據無量義經亦恐不可彼經尼眾在後此經在前彼有四輪諸王此則唯一人主不可彼已來此猶未集故不然也今觀等者先輩學者以此為科文有三先標次列後結今謂若是科文請觀後結之語何如又若是列者何故但七後釋何故於前別立名目今以為顯出不次第雜義之相狀也八者謂欲天色天龍緊乾修迦人先有直云欲界眾色界眾不以天字間之為先學所破謂通濫故也宜應知之如此八番如何是其雜亂下正辨其相狀如文四句正是出其狀也先輩學者皆通應云梵王文云四者誤也今謂此失宗旨若爾此乃次第何謂不次第耶今謂若從劣向勝論次第者應先人王次初天四王次釋次梵諸龍神等並屬諸王天所管於後列之若以勝向劣為次第者則先梵王次釋次四天次龍神次人若以趣而言之五道優劣兩途次第亦如向說若以界而言之二界優劣兩途次第亦如向說今並不然故為不次第離亂義也初明欲界天下次先上次却下後却上故若色界天文雖略却是次第是故不論人闇此意便謂文誤此乃人誤非文誤也龍鳥同是一趣而復間列又是不次第故云前後又望餘趣此劣於鬼神而前列之故後云前後鬼神三番若望八部常言則乾神在前緊神最後乃緊最居先不同常言又是不次第也總而言之一則界趣相望不次二則當分不次以此不次故呼為雜矣不可強言其次第也舊有師言列俗眾為三先列天眾次列神眾三列人眾勢力次第故天眾兩重先列欲天眾次列色界眾遠近次第故欲天三重一帝釋眾二三光四王眾三二自在眾君臣次第故此望諸家猶且為勝亦且一途未盡其要今明要者應有其四諸並不言次既結為約教此初即當其因緣何為不言而有言之謂八番異是世界天人並為人鬼畜眾生是對治得道第一義今謂如此意豈能顯於雜意今謂雜有二義初約三義眾多聚集名雜即世界也次不次第名雜即具三義不次第者顯一切法皆無定性令物識其道理即為人破迷執於定性即對治彰其開顯皆證妙道第一義諦平等更無高下優劣次第故即第一義也正為顯明此義故不次第名之為雜文云出自經家趣列正意在此趣爾不的定之詞意明皆得此圓妙道故也如是雜事表妙義孰能知之後學請深警察無為尋常見耳有人嫌此趣爾之言此於無方妙道信未會矣。",
        "translation": "Secondly, the correct interpretation of the present meaning is to cite a single word as a general summary of the three preceding pairs of words and meanings that are not without end, so it's called both. Also, as the Vijñapti-mātra explains, it's called the meaning of the mixed mind.",
        "source": "X29n0596_007:0311b16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次約教者前雜意也如別言事猶通故更歷教辨之初即總約凡聖二類人論雜也亦約心也約道就人且有二類相雜約果報形服乃有眾多相雜也此即藏教義也次即通也次菩薩則三別即出假位也次圓即一多相即相入參雜之義名雜初三皆以聚雜即前初義在昔也後一即前不定次第之義即此經開會妙無方故名為雜也次總結前可不不即前初三家也本者已住此妙今為引物同歸迹云此也義通久近可思觀者觀心即空故一切法一法即假故一法一切法等如是無方故即妙不次第觀也有此二義故注(云云)。",
        "translation": "The first one is a general statement of the two kinds of people, namely mortals and sages, and the second is a statement of the mind, the second is a statement of the path, the second is a statement of the two kinds of people and the second is a statement of the form and dress of the rewards of the two kinds of people, and the second is a statement of the Tibetan teaching, the second is a statement of the commonality of the three kinds of bodhisattvas, the third is a statement of the hypothesis, the second is a statement of the perfection of the many kinds of people, the first three are a statement of the mixed meaning of the mutual entry, the first three are a statement of the mixed meaning of the initial meaning of the former, the latter is the statement of the uncertainty of the sequence of the former, the statement of the opening of the wonderful and unfathomable path of this sutra, and the second is a summary of the former, the absence of the former, the first three.",
        "source": "X29n0596_007:0312c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第三正釋其文文有二別初列八番後總結初中八番如前即有八別初列欲天眾文自有三一帝釋眾二三光四王眾三二自在眾初二地居後一空也初文具有四釋初因緣中有二初通釋四義次依經廣釋其名初四義者先正釋其人名次釋其人所生天之名三釋其天依所山之名四釋先列其人之義初名中只應云釋提桓因陀羅文中剩一因字如此梵名翻釋總訛略未可會舊人有云正應言釋迦提桓因陀羅釋迦為能提桓為天因陀羅為主以其在善法堂治化稱會天心故稱能為天主可而未全新云釋迦提婆因達羅釋迦姓也此翻為能提婆天也因達羅帝也正云能天帝言釋提桓因云天帝釋沉而到也若近代尅實言釋迦提嚩印捺囉譯及義與前同有人博對唐梵而云不知桓字其所從來今準嚩字本是婆字梵呼甚輕聲近和和聲又近於桓便變為桓其從此矣例如世觀菩薩梵云伐素盤度舊云婆藪盤豆亦云和和修如此等總其例據實道理亦是姓名合稱謂能天帝也帝即主也不知是何天主故切利天也此切字從心寫者從十只是切字若從七邊即是切入聲呼也既云切利未知是何名義故又翻釋之也言喜見者此是其中帝釋所居之處諸說皆云善見或善現而此文上下皆云喜者或聖者異出或傳寫誤下釋所居山者既云居其山頂又不知此何名義故後翻釋之也深而且廣是其安也高而能著是其明也下釋可知言高廣等者有云準阿叉末此菩薩問佛有此答也然今所用多與俱舍不會者經論不同亦不須會新云蘇迷廬此云妙高四寶所成故妙出眾山故高此是等者是釋先列之意言欲天主者舊有釋云欲界三天帝釋是主餘二是臣今意一往亦同此意故云欲天主也有云非謂六欲主正言第二天主也有人云其本摩伽國舊人故初列之諸先所釋於此廣引俱舍等釋非此中正要故今未暇具述次下依經問答廣顯其諸名義都有九番前八皆有問答初番是前因也前但明果未辨其因故此明之隨其所有一時罄竭無怯故云頓施次名未見翻以因驗之只是數施義也三者本是摩伽國人從本為名也四中亦未見翻應是勝妙衣也五中亦未見翻西國多有此姓從本姓名為也第六第七則可知第八與前何別前從本因此直從現果第九但出異名非釋名義此即大瓔珞經也應法師云物翼即憍尸迦本是憍翅迦譯時此方不曉便謂翅即見翼不如作翼梵者不曉任此方言便改憍為物以翅為翼此是當時不曉便致此謬此義固其然矣此中若四要者初釋名世界次明往因行布施等即為人能破惱蔽即對治能思千義第一義在其中矣所以廣引往因良以此矣有此四種因緣故以名也約教中諸家皆引大論云三藏中云其人得須陀洹衍中說為法身菩薩也今準論言小中但得初果今此引經即得三果又論中法身語亦通即此中難問義通三種且在於通此定名為勇伏亦名健相健行得有通別如前已說內證不同者雖同證位有高下將顯同而有異故合說已後云不同也若約十地為十天王此天即當第二地位今應不從此義又明授記此是前教應用隨一分緣作如是說若於此教開會已同一妙道體用無方況更本迹難思如次說也令知此意故注(云云)本迹中昔教尚已得此定於今開會一切增極故當爾也大經云三十三天上妙甘露不死之藥也寄迹以顯本也迹居此者權引於實同歸本也久近二種可以意得次約觀中約十善者是天因法故若此三十行者世間天因非第一義天之因若皆即空假中則皆成三諦妙境即第一義天因之義也應知皆即空假中之所以勿直誦語此皆天真妙道任照而已是此經三十三天之觀道也。",
        "translation": "Next, the third correct explanation of the text has two distinctions. First, there are the eightfold list and then there are the eightfold summary of the middle school. First, there are the eightfold list of the desire heavens. First, the list of the desire heavens has three kinds of texts, namely, the Śakra Devānām-Indra, the two-three luminous four kings, the two sovereign ones, the first two dwelling in the earth, and the last one in the sky. First, there are the two first explanations of the four meanings of the first four names according to the sūtras. First, the correct explanation of the names of the persons, the second explanation of the names of the heavens born from the persons, the third explanation of the names of the mountains from which the heavens depend, and the fourth explanation of the meanings of the persons listed first, the only thing that should be said is that Śakra Devām-Indra is a word for cause that's left in the text.",
        "source": "X29n0596_007:0312c16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋三光四王初三光因緣中言內臣者初標次列之意對外故名內望主故名臣主即釋也注云帝釋輔臣也內臣近主故次先列之或云以下次會釋先會此三即是三光次會即是三聖應迹諸家並直云星今云明者從別或勝說以照破最勝故有直云有經有云出正法念經諸釋皆云出正法華經名月寶吉祥皆月天子之名也下二例知結是本迹者即此因緣又即本迹之義也此中應辨其體量及因所未暇也他云三光乃是四天王天攝更無別天也若四要者三光通是世間感致即世界通皆照明即為人通能破闇即對治亦通能令物固以悟道即第一義三大聖本也應作此三迹也此極圓能對於餘三若於今經同一圓妙教也易知故略不言此三光因緣度如隨譯起世經說應委尋之觀中即以三智為三光又即三觀為三智通相說也此三觀能破三惑闇顯三諦道故即三光。",
        "translation": "The next explanation of the three lights and four kings is the first three lights in the cause and conditions of the first three ministers who are first labeled as the next in line, so they're called ministers because they're facing outward, or they're called ministers because they're facing inward, or they're listed second, or they're explained as follows: \"The three are the three lights, and the second is the three holy ones that should be traced.",
        "source": "X29n0596_007:0313c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此上釋三光義下是釋天子義初句通出體義次是句別示也此即此經自心三光天子之義明矣明有此義故注(云云)次釋四王中文亦但有三釋約初因緣中先總釋次別釋總中亦先標列次之意次明所居之處三明體量外臣及武三字皆待對以得名義如前也此既云武前云卿相即是文也世云文經天地武定禍亂正從護世以得名也正以此故次後列也四寶山如次別釋中是也高半對上下以居中四面旁出也廣者一一面皆爾應與新譯對會所未及也次下別釋中先別釋四王次別釋護世初四中一一皆先翻名次所居處三所部領此四名出大論並直翻而不釋義又初領二鬼餘說皆云毗舍闍未知定實四王名應如新金光明經四天王品說及舊疏解各二鬼名具如大施鬼神飲食經中翻譯惡眼新云醜目初二鬼名初如次釋亦直云食香鬼共云奇臰鬼其身如燒骨臰薜茘多此云餓鬼鳩槃荼云守宮鬼毗舍闍新云畢舍遮此云守廁鬼言守廁伺人不淨食之也次釋護世世即所護四洲人也惱者即諸鬼神也四王即能護者合論故云護世四王也常說有八部眾皆謂天龍等為八也有云此說非也正以此四王各領二部八非彼天等八也今謂八通於二若諸經中通途所說即以天等為八若諸陀羅尼中所說正別指此以為八也此自於鬼神中論八故不數數天並為四天王所管若更曲開則有二十八部總為僧慎爾耶所統即舊所謂散脂大將是也具如十卷金光明中所說此既因緣應具四要然護有三義遮也存也顯也總三稱護世世界也遮即對治存護即為人顯令得道第一義也闕約教者諸大小乘皆說此四故知通於權實四種若十地為十天王此天即當初地義通別圓此乃昔說若至今經開會一切唯一圓極無不盡妙故下文云我等亦如是必當得作佛即其證也此義易知故略之也次本迹中意者即涅槃經中所說意也寄此迹顯其本也經中初明別護次明通護今此正用經中二意初別約四明本迹次通約四明本迹初別中先略就經意標本迹次正依經以屬對初標其本云為者是也本是住此四德之王也此四自在無德不攝故名為王四人皆具四德今直以四對四故且為別也文具言一四故是略也何以知者以迹故知本爾何者若非此本何能此迹能此迹者正由此本故從此本而垂此迹依於此迹以彰是本又況大經以四樹表四德為四王之所守護故以知矣下明其迹本既如是而今為此四王故是迹也文中直明垂迹所以而不結之應知護字之上有為字義方顯其意佛法者即所護也略言即四德具足即八種盡實而言即三四也於次自見外人妄計世間以為四德非直不令外人取亦不令內人取外取即壞其四枯內取即壞四榮今是略明故且言外取謂妄執也即具三義遮也存也顯發也若如前因緣中所論護者世間而已涫能彰其妙用正為護此法世故示此迹也下依經別屬對者向足所論且是四王本迹之義而四方二鄣之義未顯故此明之向以四德對於四人今以四人對於四方又向且言外今是言內外故一一皆具護二以樹有四雙八雙四枯四榮表於常第八術如來於中而入涅槃表於雙非中道法身即三德也前明護世有三義今破內外謬執即遮護也存此八術即守護也常知其體不二即能顯發中道即法護也今但言二者護二即三依相即顯其性故也即如護世能顯出世義矣此即釋前垂迹護持之義相狀也前略備悉也前雖稍廣要自是別其理未盡是以經文更作此釋以明其通理方盡矣故經云此四雙樹四王典掌即前意也又云娑羅雙樹華果茂盛常能利益無量眾生華者喻我果者喻樂經文略舉初二既有初二理應具足今以義例加後二也拔體喻常者本故德之初故不言根者約修德說根屬幹故我者敷榮自在故樂者受用資適故淨者茂盛鮮明故此則一一皆具四德故是通也所護既爾能護固然以下是對所顯能護此四德令一切未得皆得故也向明雙護今乃偏護榮者何耶為破邪榮故護枯為破枯故護榮今明中道四德利益之大故言之也故十八空論明四德皆是雙非中道體上立其名也例如非麤非妙名為妙也結云故迹為等者中道四德人法為所護之世也思之思之觀中四知即能護四諦之理即所護除二惑即迹護也能修是觀即自護世也。",
        "translation": "The above explanation of the meaning of samyak-saṃgha is followed by an explanation of the meaning of celestial son. The first sentence refers to the meaning of the outgoing essence, and the next sentence refers to the special explanation. This is the meaning of the self-centered, three-luminous celestial son as explained in the sutra.",
        "source": "X29n0596_007:0313c24_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下是第三釋欲界最上二天也於中先釋不列中間二天之意然後正釋無上之二初中有三初略釋二天次釋不列之意三釋成釋初天言善時文不釋義有處釋云隨其時分修行善法故也言妙足者亦不釋其義有處釋此一生補處菩薩所居具修戒定慧勝於上下故云妙足言略耳者正釋不列之意既列上下中自可知不俟繁文故云略也下更釋成下鈍者謂下地居兩天散善而已上樂者欲欣上天天欲境勝故色界諸天著禪樂故以是故知只是略耳次正釋上二天此二名若尋常列則無化樂天化自在天今忽此名致令異釋自他化等者釋兩名義此即尋常二名義也此二天俱是化作樂具受用樂而化樂是樂自變化受樂上是令他變化樂境已受用之故言自他化也有云初天正應言樂變化天而言化樂者非也此上且解二化之名未解二自在義即是於自他二變化各得自在故也上勝於下故加大也注云云者應明因緣約教也今謂即此樂欲含其四義若樂世間即是世界亦樂出世即為人樂出世間即有厭世是對治樂出世真理即第一義諸經皆說此等諸天即通聞權實至於今經並已開會無非圓妙正以彰此圓妙之義故二同立自在之名深有旨矣自下更破異解此師意通自在即欲頂大即是色頂緣此二頂俱名自在又俱是頂故並得大自在名也破者固當無無此理也舊有引注解云自在是帝釋主丘大臣大自在者摩醯首羅是帝釋師或云是欲界後二天今以注解為正真諦亦云毗綱天助帝釋與脩羅戰脩羅吞之諸天愁憂謂失大將案此義故自在大自在並帝釋臣非後二天他人以自在是夜摩兜率兩天以大自在為化樂他化二天故此二天攝欲界空居四天也祥先引注解如前次自釋云上列欲界初天帝釋為主三光四鎮為臣今列欲界化自在他化自在在彼二天也今謂此第三釋與今意同但不得不列中間二天之意義有未盡(此文移餘四悉文前安)次本迹中此兩定名即二十五三昧中能破此二有之定也若依十地即五六二地況並圓妙固其然矣五欲本依非自在今能自在故是寄迹顯本故知然矣觀中入空不為諸有所礙故中能雙云兩在存一切無礙故也為且消二名故不言假又即攝入中道雙照攝故略有此意故注(云云)。",
        "translation": "The next is the third explanation of the two highest heavens of the desire realm. In this explanation, the meaning of not listing the two middle heavens is explained first, and then the meaning of not listing the two middle heavens is explained correctly. There are three explanations of the first two heavens.",
        "source": "X29n0596_007:0315a02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次列色界天者第二番也於中有三初釋尸棄次釋光明三釋等字初中有三初釋娑婆次釋梵王三釋尸棄初有四句名義有二初二釋忍次一釋雜也初惱業並忍耐次單明惱並且言因亦應兼果故經云雖遭大苦不以為患即道也並以正名依故也次言雜者舊云雜惡亦云雜會而並不而釋今釋如文注(云云)者餘文又云淨穢同居凡聖同居皆此義也言九道者只是九界眾生也或云九眾生居新云九有情居謂欲界人天為一色界下三禪為三無色界下三空為三第四禪及非想非非想是為九也此中前七即七識住加兩第四故為九也此攝生界不盡非今意也新云索訶此云堪忍釋云諸菩薩等行利樂時多諸怨嫉眾苦逼惱堪耐勞倦而忍受故因以為名也此乃從求道者以為名也舊有引真諦釋云忍是梵王名由能忍他勝事不生嫉惡妄故言忍也此從主以作名此應有憑義勝前釋今謂應從通別二義以得名通如前通從正報別即於正中別從其主聖故互舉必具二義也次釋梵者文中有翻有釋有異名高淨者即對欲界是下是穢故也還即向者除下上昇是其義也然具足應云婆羅歌摩天亦云梵摩天梵即婆也摩即縻也略舉初後略中二字此為要也古譯極略但云梵也新翻為寂靜亦云清潔不釋義義與前同離欲濁穢故清潔故清潔得禪定故寂靜也此中準例應合有大字故諸家章中皆云大梵天王經意正顯此是尸棄故大字在後安思之思之有引瑜伽正理云廣善所生故名為梵此梵即大故名大梵由彼獲得中間定故最初生故最後沒故威德等勝故名大梵治他所他所領故名梵眾於大梵前行列侍衛故名梵輔次釋尸棄初正釋次會通釋成初中即有二名初不釋義藉有釋云頂上有火光如髻故云頂髻或云頂有大髻故名頂髻次意者即是大梵三也修此定得生此天是從因德以立名也舊有言此王入火光定頂有火光故言火也舊又有言餘梵天皆為火災所燒此王獨免故云火也有云火頂即初禪主火災之最頂故也今謂若準尸棄如來此翻寶髻故知尸棄是頂髻義為正也故新譯皆言頂髻也有云頂肉髻似螺也如前頂有大髻是也淨名螺髻梵王是也然經以下是釋會也緣經論不同古今釋異故須略會通其中六句初明經言似二次明論解為一三今以論會經不二四明住處及得為王所以五辨其因六明舉主以攝臣眾要以為四初三正明尸棄為主是初禪王次明住處及得為主所以三通其同四更別明舉主攝餘二也且初三者祥云有人言梵天王即初禪王尸棄即二禪王光明即三禪王等者第四禪梵王即光宅所用也其又云世界主是摩醯首羅第四禪梵王也尸棄即三禪王光明者即二禪王等者初禪王也其自釋云今依智論娑婆世界主梵王名尸棄世界主此舉處以顯其為主梵天王是出其位尸棄是標其名新翻光明亦作此釋此與今文意同也舊有問云雜阿含說百億梵王阿含又說尸棄是初禪梵王智論又說梵王是千世界主如此參差云何會釋答舊解有二或說百億梵王交通王領或說如輪王四品梵王亦爾謂下中上上上下品為一小千世界主故有百億中品為千世界主上品二千世界主上上品三千世界主如地論說八地作梵王千世界主九地作梵王二千世界主十地作梵王三千世界主此亦爾如大集說三千世界有百億魔王別有魔王名波旬王三千世界此亦爾此王若總若別皆在中間禪住如四輪王皆住閻浮提也舊有云尸棄是禪梵王亦名鳩摩羅伽此云童子天此天顏如童子故以名焉手驚鷄持鈴提赤幡騎孔雀也問十地經言摩醯首羅為三界主今云何言初禪梵王為三千世界主答有四種梵王一者經云百億日月百億梵王百億非想此下品小梵王也二智論云梵王千界主長阿含亦然次品也三云九地菩薩作梵王領二千世界此上品也四者領三千大千世界上上品也魔王轉輪王亦有二種如大集言魔王如前說同大品云他作轉輪王領三千世界故不可一途而判今謂若得今家今迹義諸皆可會也問尸棄為大千之主在何處中間禪住耶答百億間禪今在中央住也例如佛大千中央住也他人釋云初禪大小等於欲界一四天下一千初禪始等二禪為火災頂一千二禪始等三禪三禪為水災頂一千三禪始等四禪四禪為風災頂是三千大千世界號為娑婆世界主大梵天王即第四禪主也尸棄者火災頂即初禪主火災之極頂故光明者二禪主少光無量光極光淨天主故等取三禪主也然般若云堪忍界主持髻梵王故尸棄者頂髻也即持髻梵王是堪忍界主梵王之別名準此釋意世界主即第四禪王尸棄即初禪主光明即二禪主等即三禪主也如上諸釋不同今文依大論即以尸棄為主祥釋同也此中應引論頌及釋顯成前義住中間禪其為主之由言中間者大論如前諸釋要即初上二下名中間也覺觀初禪五支中之二名也新云尋伺由此覺觀故有言說由此內外二故得為主統別即主眾輔二天眾也通即忍界主也單修等者辨其因不同也有處說云於四禪上加此四心得為四王若但單修禪者只為眾也此中即舉通顯別也初禪等者此禪有三天今但舉主即攝餘二也大論第九云初禪三天異者修慈三品不同故也下為梵眾中為梵輔上為梵王以此例餘其可知矣今觀此文似有四悉意初三句共明是主世界也內外得為王者對治辨因不同為人也舉主攝眾第一義也此即初天之因緣也次可例知餘三義在後說也。",
        "translation": "次列色界天者第二番也於中有三初釋尸棄次釋光明三釋等字初中有三初釋娑婆次釋梵王三釋尸棄初有四句名義有二初二釋忍次一釋雜也初惱業並忍耐次單明惱並且言因亦應兼果故經云雖遭大苦不以為患即道也並以正名依故也次言雜者舊云雜惡亦云雜會而並不而釋今釋如文注(云云)者餘文又云淨穢同居凡聖同居皆此義也言九道者只是九界眾生也或云九眾生居新云九有情居謂欲界人天為一色界下三禪為三無色界下三空為三第四禪及非想非非想是為九也此中前七即七識住加兩第四故為九也此攝生界不盡非今意也新云索訶此云堪忍釋云諸菩薩等行利樂時多諸怨嫉眾苦逼惱堪耐勞倦而忍受故因以為名也此乃從求道者以為名也舊有引真諦釋云忍是梵王名由能忍他勝事不生嫉惡妄故言忍也此從主以作名此應有憑義勝前釋今謂應從通別二義以得名通如前通從正報別即於正中別從其主聖故互舉必具二義也次釋梵者文中有翻有釋有異名高淨者即對欲界是下是穢故也還即向者除下上昇是其義也然具足應云婆羅歌摩天亦云梵摩天梵即婆也摩即縻也略舉初後略中二字此為要也古譯極略但云梵也新翻為寂靜亦云清潔不釋義義與前同離欲濁穢故清潔故清潔得禪定故寂靜也此中準例應合有大字故諸家章中皆云大梵天王經意正顯此是尸棄故大字在後安思之思之有引瑜伽正理云廣善所生故名為梵此梵即大故名大梵由彼獲得中間定故最初生故最後沒故威德等勝故名大梵治他所他所領故名梵眾於大梵前行列侍衛故名梵輔次釋尸棄初正釋次會通釋成初中即有二名初不釋義藉有釋云頂上有火光如髻故云頂髻或云頂有大髻故名頂髻次意者即是大梵三也修此定得生此天是從因德以立名也舊有言此王入火光定頂有火光故言火也舊又有言餘梵天皆為火災所燒此王獨免故云火也有云火頂即初禪主火災之最頂故也今謂若準尸棄如來此翻寶髻故知尸棄是頂髻義為正也故新譯皆言頂髻也有云頂肉髻似螺也如前頂有大髻是也淨名螺髻梵王是也然經以下是釋會也緣經論不同古今釋異故須略會通其中六句初明經言似二次明論解為一三今以論會經不二四明住處及得為王所以五辨其因六明舉主以攝臣眾要以為四初三正明尸棄為主是初禪王次明住處及得為主所以三通其同四更別明舉主攝餘二也且初三者祥云有人言梵天王即初禪王尸棄即二禪王光明即三禪王等者第四禪梵王即光宅所用也其又云世界主是摩醯首羅第四禪梵王也尸棄即三禪王光明者即二禪王等者初禪王也其自釋云今依智論娑婆世界主梵王名尸棄世界主此舉處以顯其為主梵天王是出其位尸棄是標其名新翻光明亦作此釋此與今文意同也舊有問云雜阿含說百億梵王阿含又說尸棄是初禪梵王智論又說梵王是千世界主如此參差云何會釋答舊解有二或說百億梵王交通王領或說如輪王四品梵王亦爾謂下中上上上下品為一小千世界主故有百億中品為千世界主上品二千世界主上上品三千世界主如地論說八地作梵王千世界主九地作梵王二千世界主十地作梵王三千世界主此亦爾如大集說三千世界有百億魔王別有魔王名波旬王三千世界此亦爾此王若總若別皆在中間禪住如四輪王皆住閻浮提也舊有云尸棄是禪梵王亦名鳩摩羅伽此云童子天此天顏如童子故以名焉手驚鷄持鈴提赤幡騎孔雀也問十地經言摩醯首羅為三界主今云何言初禪梵王為三千世界主答有四種梵王一者經云百億日月百億梵王百億非想此下品小梵王也二智論云梵王千界主長阿含亦然次品也三云九地菩薩作梵王領二千世界此上品也四者領三千大千世界上上品也魔王轉輪王亦有二種如大集言魔王如前說同大品云他作轉輪王領三千世界故不可一途而判今謂若得今家今迹義諸皆可會也問尸棄為大千之主在何處中間禪住耶答百億間禪今在中央住也例如佛大千中央住也他人釋云初禪大小等於欲界一四天下一千初禪始等二禪為火災頂一千二禪始等三禪三禪為水災頂一千三禪始等四禪四禪為風災頂是三千大千世界號為娑婆世界主大梵天王即第四禪主也尸棄者火災頂即初禪主火災之極頂故光明者二禪主少光無量光極光淨天主故等取三禪主也然般若云堪忍界主持髻梵王故尸棄者頂髻也即持髻梵王是堪忍界主梵王之別名準此釋意世界主即第四禪王尸棄即初禪主光明即二禪主等即三禪主也如上諸釋不同今文依大論即以尸棄為主祥釋同也此中應引論頌及釋顯成前義住中間禪其為主之由言中間者大論如前諸釋要即初上二下名中間也覺觀初禪五支中之二名也新云尋伺由此覺觀故有言說由此內外二故得為主統別即主眾輔二天眾也通即忍界主也單修等者辨其因不同也有處說云於四禪上加此四心得為四王若但單修禪者只為眾也此中即舉通顯別也初禪等者此禪有三天今但舉主即攝餘二也大論第九云初禪三天異者修慈三品不同故也下為梵眾中為梵輔上為梵王以此例餘其可知矣今觀此文似有四悉意初三句共明是主世界也內外得為王者對治辨因不同為人也舉主攝眾第一義也此即初天之因緣也次可例知餘三義在後說也。",
        "source": "X29n0596_007:0315b17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋光明先總標其位次辨差別彰其義但言光明不知是何標是二禪王也何以知之此天有三並稱為光故知光明是二禪也第三舊名光音新云極光淨自地天內光明最小故少光光明轉勝數量難測名無量光遍照自他處故名極淨光亦可二禪光明正從此為名也此中既有三異復稱為王例前義亦可知。",
        "translation": "The second explanation of light first summarizes its position, then discerns the differences to clarify its meaning.",
        "source": "X29n0596_007:0316c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自下釋三四二禪論諸天即釋文中等字義也故舊釋云略舉初二等後二也此中不立通名例前亦可名遍淨大梵究竟大梵皆從極勝為名也若約禪友為名初即覺觀次即喜禪三即樂禪四即捨禪也有云意地樂受說名為淨於自地中此淨最劣故名少淨轉增難測名無量淨此地最周普故名遍淨此三新舊名同此三果既優劣因可例知次第四禪都有九天初言密者新名無雲且言密者有云下空中天所居之地如雲密合故說名雲身居此地故名密身今謂望下地麤此地身細妙名密身既其細妙何所能礙此舊名義應爾言無雲者有云此上諸天更無雲地在無雲首故說無雲次無量等者新云福生有云更有異生勝福方得生彼說名福生今謂此猶未消疏文亦可望前前猶有量此更細妙故名無量明是果勝故受福也次者新直云廣果有云異生果中此最殊勝故名廣果言無想者於無想中最深細故新譯直云無想即外道所計以為涅槃修禪而生之也此前四名並言亦者前後翻譯不同有此二別今具述之故皆云亦次列上五天即五種不還果人所居之處也新云五淨居天也有云離欲諸聖無漏道水濯煩惱垢故名為淨淨身所止故名淨居又云或住於此害生死邊故名為淨居義同前又無異生而雜純聖所止故名淨居不煩惱者煩謂煩雜或謂煩廣無煩雜天此最初故煩廣天中此最劣故說名無煩惱已善伏除雜順修靜慮上中品障意樂調伏離諸熱惱故名無煩或令不生煩惱名無熱此初遠離得無熱名已明上品離雜修靜慮果德易彰故名善現雜修定障餘品至微見極清徹故名善見更無有處於有色中無能過此名色究竟或此以到眾苦所依身最後邊名究竟也今此文中善見次第應在下也色究竟所依處名此方言也即下經文阿迦尼吒天也大自在是能依主名此方言也下四字即彼方言也處既究竟人大自在三界色中最尊勝也下結明是等之義也然下界眷屬尚多此上既勝所將何少或隨有經或是略舉或乃一一禪皆各與若干眷屬文總略也然此諸天具如大小二乘說所未遑也此中一一皆應有四悉義於前世界主中略已明之可以例知故不繁也教門者此諸天眾皆歷諸大小乘會則具聞權實之說來至此會一切開會唯一圓妙此意易知不俟繁文本迹者大小乘經皆盛說其功德故知皆有本也於中有遠有近就遠論者如次第大乘四梵即十地中後四地之迹四地本也四梵迹也此義可知若就圓門不可定其位地皆久得實相清淨之本而垂此清淨之迹居此天以引物同歸此其遠也若至此會二門開顯之後向之所引實者或即位隣極淨一切生死因果穢濁斯盡同一圓淨之道如彼蓮華此其實本也而居此之淨天為令未淨者淨是其迹也此約新近以論即權實之本迹也故此經本迹含此二義可以意得不在繁詞言約觀者有人於一十八天一一皆先作本迹解次約觀心釋此太繁矣疏文令自思之只令隨意斟酌但附家旨非有定量今不欲繁一文並直約略語其宗要教迹已略如向觀者能修三觀即能離三惑穢濁顯三諦清淨之理此即離欲清淨觀也又梵名寂靜三觀能離三惑煩惱喧亂即大寂靜之觀也又通相空觀能出一切諸有之上而得自在即頂髻觀也通相假觀善能照了諸法相即光明觀也通相中觀一切諸邊皆無所著即遍淨觀也又能順道法愛一切不生若觀若境皆悉無方即大自在究竟觀也此又即四梵之觀也梵眾一十有八而但舉此四者欲明上勝兼下劣故舉其要會義備可領何俟繁文然應善議六即此義思之。",
        "translation": "In the following explanation of the three and four second meditation heavens, the meaning of these words in the explanation is the same as the old explanation, so the old explanation says, \"I'll abbreviate the first two and so forth, and the last two.\" In this case, without establishing a general name, the previous example could also be called the pervasively pure Great Brahma, and the ultimate Great Brahma is named from the ultimate excellence.",
        "source": "X29n0596_007:0316c22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下釋龍眾即第三番也舊云龍是畜類劣其餘道次天列者凡有四義一其力最大故五不思議中龍為其力一也二正法念云惡龍助脩羅善龍助帝釋今是善者故婆沙云天與彼鬪龍先與之故其助天也三調適陰陽於天人有恩故四護持千佛經藏故次天列外書說文云龍是有鱗虫中之長能小能大能幽能明春則昇天冬則入泉廣正云有鱗者為蛟龍有翼者為應龍有角者為虬龍無角者為螭龍佛法中明有四生龍與後文同然此方以為王者五靈之首主東方也佛教以為天帝之先鋒下地護法之天首也此最要故居首經文有三初標數類次釋其名後明眷屬以下諸眾皆同此於中合釋初二以兄弟故初翻名次釋義三明其受道之初四明其住處善者多云賢歡喜賢善一也新直云喜賢也喜義者由其有思王賽其澤率土慶悅故得此名此但釋喜賢義如前文無別釋他云初能令人喜後性賢令喜故以為名言所降者信順始於此時故是愛道之初也雖被於此國所報居在海中也此中四意者利益世間皆令歡喜因是得名即世界為人二義降之因得除惡即對治也居海表其住法性大智海中第一義也此下不明教者但識今昔其名麤妙之義自彰例前可知故不繁文也本言地者以地有此名據迹以知本也住此中德用深廣故居以表引物同歸也觀中三觀觀三諦觀稱於境故言即中道境能發觀故生法喜。",
        "translation": "The next explanation of the dragons is the third one. The old saying is that dragons are animals and inferior to the rest of the world, but the second one is that dragons are the most powerful of the five non-considered ones.",
        "source": "X29n0596_007:0317c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "娑伽羅者伽字輕呼此翻為海從其居處為名即下文龍女之父也他云即醎海之龍也言華嚴所稱者謂稱歎也即彼經歎其能興種種雲等橫竪無量利益者也舊云等者舊云此國近仙人而王觸悟於仙仙呪此國成海此龍居中因為名也此應異聞非正義也此中因緣四義者既指華嚴所稱則四義自備指於彼者正以於此可以意得不在繁文教門準知本迹者本非此不能此迹能此迹者知本然矣正為引物歸此本矣不明規者亦可準知以三觀觀三諦境即是觀智住法界大海中也。",
        "translation": "The word svāgara is a diminutive of the word ga, which is translated as \"ocean\" and is named after its abode, which is the father of the dragon-maiden below and the other clouds, which are the dragons of the sea of water. The expression Huayan is called \"praise,\" which means to praise the scriptures that praise their ability to produce various kinds of clouds and other horizontal and vertical benefits.",
        "source": "X29n0596_007:0318a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言多頭者新舊諸釋皆言是九頭龍也言寶稱者異名也應是其多妙寶嚴飾因以立稱也或因寶而稱歎之也言水中者諸說或云水底或云水生而並不言其水處也若四意世間報法故多頭也寶稱美號為人也常居水中少在人間息惡表本即四義也教例可知本迹寄迹以表本也依一身而現多頭表依一定而現多身也爾此迹者令物會此本也觀中無量謂三諦三觀法門也此即通明不思議之假謂即空中之假故此假即空中故注(云云)之意略如是宜善詳之。",
        "translation": "The expression \"many heads\" is a variant of the old and new commentaries that say it's a nine-headed dragon. The expression \"named by jewels\" is a different name for what's adorned with many wonderful treasures that establish a name for it or praise it because of its treasures.",
        "source": "X29n0596_007:0318a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又迦中有三名諸釋但云多舌蓋聖教所出不同而多言此一也言視毒者如餘經說龍有四毒視其一也視能害人故言多舌者他釋云舌有多故或由嗜語故名多舌又言兩舌或舌有兩故或如語業不善中四之一也舊云居在地上四意者視毒世間有之物懼不敢為非世界對治也多舌能隨類意為人也兩舌分別世出世間令歸不二第一義也教例可知本迹但約中間一以明也辨即四也示此迹正令物同會此本也略不明觀言依心起但能明了自心三諦則為一切言說之本也。",
        "translation": "Also, there are three interpretations of the scriptures that say \"many tongues\" because the noble teachings differ and say \"one\" more than the other. Those who say \"many tongues\" because the other interpretations say \"many tongues\" or \"two tongues\" or \"two tongues\" or \"four tongues\" because of their addiction to speech are called \"many tongues.\" The old saying \"four intentions of abiding on the earth\" means \"one who regards as poisonous the things that exist in the world and is afraid to counteract what's not the world.\" Many tongues can distinguish between the two kinds of intentions for people, and the two tongues distinguish between the world and the supramundane so that they return to the nonduality of the supreme meaning.",
        "source": "X29n0596_007:0318b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次阿那中先翻名次釋義初中三句初標名之所從次正翻剩重無熱兩字次明池之所在古來或云香山頂或云雪山頂或云香南雪北近譯皆云香山頂西域傳亦具言之此池出四大河此土黃河即其東面河也古來亦呼為崐崙山池在山頂故郭護爾是圖讚云崐崙三層世號天柱寔河之源水之靈府是也文中亦似剩從池為名四字次下明無三患正釋池名無熱之義初明餘有三患後明此無即舉有以彰無也從無以立名故也初言三患者者即熱惱也此其業報法爾故也此所無者福業所招感此勝處故也舊有釋云此池在香山頂閻浮提北天齊星下其水清涼故稱無熱此即因緣其四義者總無三以為名即世界此由善業之所感致即為人前有是不善之所感即對治因此世界有無以會出世間道即第一義從此四因緣故此名也教者無熱清涼諸教共有此者具聞若於此會唯一妙也本迹中亦以迹彰本也迹處世間清涼引物同歸妙本四德也智論云七住菩薩華嚴云七地菩薩為此池龍於此起大悲雲蔭覆一切眾生令得離苦法門而得自在此並言其本也觀中妙慧即能無之物也五住二死即所無之熱惱也五住如前二死即分段變易因果異也並出夫人經通論三觀即妙慧別論亦可三觀約因妙慧約果三觀能淨五住妙慧能免二死也思之唼字通二音易知煩惱即暴風唼即虫鳥也二死果苦故以熱燒為類有此意義故注(云云)。",
        "translation": "次阿那中先翻名次釋義初中三句初標名之所從次正翻剩重無熱兩字次明池之所在古來或云香山頂或云雪山頂或云香南雪北近譯皆云香山頂西域傳亦具言之此池出四大河此土黃河即其東面河也古來亦呼為崐崙山池在山頂故郭護爾是圖讚云崐崙三層世號天柱寔河之源水之靈府是也文中亦似剩從池為名四字次下明無三患正釋池名無熱之義初明餘有三患後明此無即舉有以彰無也從無以立名故也初言三患者者即熱惱也此其業報法爾故也此所無者福業所招感此勝處故也舊有釋云此池在香山頂閻浮提北天齊星下其水清涼故稱無熱此即因緣其四義者總無三以為名即世界此由善業之所感致即為人前有是不善之所感即對治因此世界有無以會出世間道即第一義從此四因緣故此名也教者無熱清涼諸教共有此者具聞若於此會唯一妙也本迹中亦以迹彰本也迹處世間清涼引物同歸妙本四德也智論云七住菩薩華嚴云七地菩薩為此池龍於此起大悲雲蔭覆一切眾生令得離苦法門而得自在此並言其本也觀中妙慧即能無之物也五住二死即所無之熱惱也五住如前二死即分段變易因果異也並出夫人經通論三觀即妙慧別論亦可三觀約因妙慧約果三觀能淨五住妙慧能免二死也思之唼字通二音易知煩惱即暴風唼即虫鳥也二死果苦故以熱燒為類有此意義故注(云云)。",
        "source": "X29n0596_007:0318b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "摩那斯因緣中先翻名有三緣此三字含此三義翻譯隨出故有此異也大身即形體大大意即慈悲大也力即利益也而言等者亦更有云悅意也行及慈心也下釋其義一往但似釋大身義實即兼三以正及慈力也三大故能爾也以此事驗故知三大義也言縈者迂曲也遏止也謂蟠屈其身繞城以捍止於海水也諸釋皆云慈心龍也華嚴云將欲降雨先興雲七日待諸營作事竟然乃[澍-士+上]雨即慈心之證也此即前文意大之義也應具四義且約所釋總即世界存城止水即為人除害二義也護世天意在第一義天四意也若作慈心義者慈護世間令世間樂即世界也待作事辦不令損害即別二意也意令得出世間涅槃之樂第一義也教門者慈心通大小實論唯圓今則絕待大也本者無邊身如大經無邊身菩薩此總諸報名法也寄迹以表本示世間大令歸法性無比之大也觀者三諦平等名為中其性廣博者大經文也經云其性廣博猶如虗空三諦同一無性以同無故廣如空也此即大體之觀也云云之意略爾言黛色者青綠色彼蓮華四色即是青色也他云紅蓮華居池為名則此池因此華以得名此龍因此華池而受稱故也四意者從居處為名世界也善因感斯美稱為人也能息其餘惡因對治也居此世間美淨之處正為出世清淨之道第一義也教者美淨之道通於權實今唯一實妙淨道也本者此定於權實道橫竪皆無方也迹居此之事處以表其本引物同歸也由其本願深重獨受名觀中妙果如蓮妙因如華三智即妙果三觀即妙因如蓮之華故即其觀也次引正法念經意者通明次天而列之意準次第應在文初如前所引所諸釋四意是也前後亦無在然具足應知四悉之意屬天所管世界也能為天人多所利益為人也有大勢力保護天人對治也能護佛法寶藏令得出世間道第一義也有此四義餘不能具故次天列也。",
        "translation": "摩那斯因緣中先翻名有三緣此三字含此三義翻譯隨出故有此異也大身即形體大大意即慈悲大也力即利益也而言等者亦更有云悅意也行及慈心也下釋其義一往但似釋大身義實即兼三以正及慈力也三大故能爾也以此事驗故知三大義也言縈者迂曲也遏止也謂蟠屈其身繞城以捍止於海水也諸釋皆云慈心龍也華嚴云將欲降雨先興雲七日待諸營作事竟然乃[澍-士+上]雨即慈心之證也此即前文意大之義也應具四義且約所釋總即世界存城止水即為人除害二義也護世天意在第一義天四意也若作慈心義者慈護世間令世間樂即世界也待作事辦不令損害即別二意也意令得出世間涅槃之樂第一義也教門者慈心通大小實論唯圓今則絕待大也本者無邊身如大經無邊身菩薩此總諸報名法也寄迹以表本示世間大令歸法性無比之大也觀者三諦平等名為中其性廣博者大經文也經云其性廣博猶如虗空三諦同一無性以同無故廣如空也此即大體之觀也云云之意略爾言黛色者青綠色彼蓮華四色即是青色也他云紅蓮華居池為名則此池因此華以得名此龍因此華池而受稱故也四意者從居處為名世界也善因感斯美稱為人也能息其餘惡因對治也居此世間美淨之處正為出世清淨之道第一義也教者美淨之道通於權實今唯一實妙淨道也本者此定於權實道橫竪皆無方也迹居此之事處以表其本引物同歸也由其本願深重獨受名觀中妙果如蓮妙因如華三智即妙果三觀即妙因如蓮之華故即其觀也次引正法念經意者通明次天而列之意準次第應在文初如前所引所諸釋四意是也前後亦無在然具足應知四悉之意屬天所管世界也能為天人多所利益為人也有大勢力保護天人對治也能護佛法寶藏令得出世間道第一義也有此四義餘不能具故次天列也。",
        "source": "X29n0596_007:0318c20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次四緊中初因緣中先釋數類舊云以下釋其四也初中雜心云畜生道攝也初述二名亦前後翻譯之異其體一也釋其義中以其形然如此令人生疑故云疑神疑相者此為是人耶為非人耶故亦號之為人非人也準舍弗問經人非人更有別義撿之天帝者明其所屬也顯出次列之意也法謂歌詠佛法之神也龍能守護故先列此能讚揚故次列也次明住處及上奏樂之由言十山者如華嚴一雪二香三柯利羅四仙聖五由乾駝六馬耳七尼民八斫迦羅九宿慧十須彌一一言寶也言異相者天福所感召也次正明奏法樂也先總次別般遮于瑟蓋彼方樂名或瑟之一字即此方言謂如此方琴瑟等即上絃歌也此中應引大樹經音樂之事具如記中次釋別者即解四名也古人意者此四皆是佛法而有勝劣前後次第故如此也持者舊亦總持總持前三也古今諸釋皆爾今意者雖窂能知而其名義實為雅當若如舊義猶未出於藏通也新云緊捺洛此云歌神初歌四諦次歌緣起次歌六度後歌一乘或初三種歌三乘之教行後歌五乘之理果故名持法或歌一乘教理行果如次配之此中四意者疑因世間世界義也法樂簡俗對治也居山上奏為人也頌法門者第一義也文有四句正意在此然疏中向對舊明奏四教法門於昔則可於今此會如何文有四句正意在此也有云且從昔說未論於此今謂此應須論不論未了若云來至法華理應純妙此雖得一妙之義於經四名都未有義如向最後引他一家三釋第三專約一乘論四彼意雖通不失此經意也若依今意即是奏四一法此四亦名四亦名四妙正當讚美之義一部之中唯此四故又亦是奏開等。",
        "translation": "The next four are closely related. The first is to explain the categories, the old one, the following four, and the middle one is to explain the animal rebirth, the first is to explain the two names, the difference between the previous and subsequent translations, and the unity of their essence.",
        "source": "X29n0596_007:0319b05_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "句以是諸佛四智出世大事一經宗要故也如此方盡此經約教之義若直依如所釋未可會也本言不思議者久證妙體也不起以下明其妙用也不起而能為即體而用也不起而現淨名之說約身業也安禪等者此經說也此約口業並依妙定即意業也三業無方而為讚供故不思議即妙本也而今外示此事故是權迹寄以顯本引物同會無方本體佛功德中十力妙極從勝以說故以云也十力義如後說然妙義無方今更助一釋者疑從形體為名樂從聲以受稱本住妙慧斷二疑生二信迹為物斷生故示此形聲也此義甚切思之思之觀者三諦是佛師亦即是佛三觀順此諦理而顯發之即讚揚也以至要妙思之思之然此文應具總別二釋一一皆須四釋方盡其體從省但約總思之思之。",
        "translation": "The phrase \"because these are the four buddha-wisdoms that appear in the world as great events and the doctrinal essentials of a sutra\" is also the way to fulfill the meaning of this sutra's detailed teaching. If we were to rely directly on this explanation, we wouldn't be able to understand its wonderful function, which is not manifest and can be done, that is, its essence and function, and which is not manifest and has a pure name.",
        "source": "X29n0596_007:0319c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋四乾中初釋總類次釋別名初翻釋有兩重初云嗅者嗅即食也故舊云食香也香陰陰即身也以香為食資其身命也既食香故能出香亦如此方麝之類也此其報法爾耳古舊所釋皆同此也新云健達嚩此有二音謂上入也此云尋香行即作樂神也謂尋香氣而往作樂乞求也此是等者簡顯列次第也此是何神謂此神也此明所屬若尋常八部四緊在前此神居後今乃列居四緊之後者以其俗樂故居次也此中法俗一往謂直俗義然更須分別所未暇也然此亦須通各四今亦但通思之次下引消四名者樂字南山經音去呼諸家皆爾有作岳音非也以梵語別故有云今疏文定作入呼者不然文但出其四體非釋音義何有定局舊云第一第三無聲之樂下上第二第四有聲之樂下上也今文不同也新云末奴是若颯嚩羅此云可意音亦名如意音樂者令人愛樂也樂中有二類一非絲竹如皷聲之類二是絲竹簫箏之輩非絲竹之類下者如樂上者名樂音絲竹下者名美上者美音或此同前歌神音曲如次問彼此與今義稍異古人由音字有無故作間釋新作次第故並為有釋亦各有理故兩存之舊云此屬鬼道攝或云屬脩羅道攝此中若為四要者食香報法世界也出香為人俗樂劣法對治也亦能顯真第一義也既並樂神後有四種所表教法今昔如前也前二並稱樂者並對世間所樂故後二並言美者並是稱適大乘機緣過前二故若至此會唯一妙四也文略後三釋例前可知故也又更助明本迹香者淨也樂者樂也本住出世中道常樂我淨四德迹示世間四事引物同得本四故也義勢同前甚具足當也思之思之觀者一義同前更一義者即觀自心若世出世二邊之四皆同中道之四德即其觀也六即撿之。",
        "translation": "In the next explanation of the four skandhas, the first explanation is the general category, and the second explanation is the specific names. The first explanation is a twofold explanation. The first one is olfactory, which is food; therefore, the old one is fragrance-eating, fragrant aggregates, which is the body, and using fragrance as food to support one's body and life; since one eats fragrance, one can produce fragrance.",
        "source": "X29n0596_007:0319c24_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋四修於中先釋通名釋別名通即其類也別即其數也類即阿脩羅數即四也謂四也此中則於經及疏並會若諸所科於經於疏並未可會復宜詳之初中先翻名義次辨其攝屬翻名有三謂無酒不端無質諒但釋二義釋初易知阿字短聲呼舊釋無酒二義一同於此二云過去持不飲酒戒報得此身今謂此義局未必盡然次名文不釋義以易知故謂不端正也以男醜女妍從男為名也安師義者阿之言無脩羅言質諒從質諒下今文釋成其義下應結之故云無質諒也舊引釋云以其多諂曲故為立此令其質直戒信諒即信也有不曉者乃云文誤阿之言無脩羅言質諒名無質諒非不相稱以本此故成誤也先說皆云安師誤或云此是今文破安師翻名不當然其翻正當文妄破之故是誤也今謂此都不曉文義此極淺易尚爾況更深難矣舊來有一翻名為非天義如後龍王經中名無善神言其所作乖理不善故世親舊傳名非善戲諸天以善法戲樂其多作不善戲樂也古來所釋不出上五六義也新云阿素洛此云非云素洛天之異名阿之言非以多諂詐無天行故名曰非天上釋名竟下辨趣攝者出正法念此文含有二義一趣攝二住處準應合為二科今文雖略事義乃廣今為二釋先且趣攝者今古諸釋不同今略述之依佛地論為天趣攝雜心屬鬼趣正法念經是鬼畜趣伽陀經出婆沙論說鬼畜天三趣有云羅睺阿脩羅是師子兒畜生所攝經論所說如是今文略但明二趣攝也諸說不出於此也此是趣攝義也次言住處者此科諸說大體是同今略述者他云此有類十地經說一極弱者居在人間山林中住即今西方有大深石窟多是非天之害(今准陀羅尼皆云開修羅宮清辨菩薩現身入彼待慈尊出者是也)二者以下四類十地經說妙高山北大海之下二萬一千由旬有羅睺脩羅宮三者以下十二萬一千由旬有勇健宮四者次下二萬一千由旬有華鬘宮五者次下二萬一千千由旬有毗磨質多羅宮準此以下八萬四千深於須彌矣(今謂舊說皆云一萬二千由旬四萬八千此云八萬四千不知孰是)與起世經相違彼說須彌東西去山一千由旬外有毗摩質多宮縱廣八萬由旬七重城等是別聚落亦復無失此其住處也今文云海邊即五中初劣者也諸家亦云地上也次言海底即次四類今經中所列四名即海中之四者也準此上下次第列之應先羅睺次婆稚三佉羅四毗磨若從下向上應先質多等今並不然者就當類之中亦自不次第也呼為雜者良亦以此也意義如前若此中為四悉者總從諸義得名及趣攝住處並是世間之報法即世界也並從佛聞法信受破惑得道即具三義也具歷小大諸經今並開會同一第一義一實之道何復更有非天不直信耶本住第一義天非世出世邊之天迹示非天引物同歸本也觀者觀心一切法皆同實相中道第一義諦無二邊也。",
        "translation": "次釋四修於中先釋通名釋別名通即其類也別即其數也類即阿脩羅數即四也謂四也此中則於經及疏並會若諸所科於經於疏並未可會復宜詳之初中先翻名義次辨其攝屬翻名有三謂無酒不端無質諒但釋二義釋初易知阿字短聲呼舊釋無酒二義一同於此二云過去持不飲酒戒報得此身今謂此義局未必盡然次名文不釋義以易知故謂不端正也以男醜女妍從男為名也安師義者阿之言無脩羅言質諒從質諒下今文釋成其義下應結之故云無質諒也舊引釋云以其多諂曲故為立此令其質直戒信諒即信也有不曉者乃云文誤阿之言無脩羅言質諒名無質諒非不相稱以本此故成誤也先說皆云安師誤或云此是今文破安師翻名不當然其翻正當文妄破之故是誤也今謂此都不曉文義此極淺易尚爾況更深難矣舊來有一翻名為非天義如後龍王經中名無善神言其所作乖理不善故世親舊傳名非善戲諸天以善法戲樂其多作不善戲樂也古來所釋不出上五六義也新云阿素洛此云非云素洛天之異名阿之言非以多諂詐無天行故名曰非天上釋名竟下辨趣攝者出正法念此文含有二義一趣攝二住處準應合為二科今文雖略事義乃廣今為二釋先且趣攝者今古諸釋不同今略述之依佛地論為天趣攝雜心屬鬼趣正法念經是鬼畜趣伽陀經出婆沙論說鬼畜天三趣有云羅睺阿脩羅是師子兒畜生所攝經論所說如是今文略但明二趣攝也諸說不出於此也此是趣攝義也次言住處者此科諸說大體是同今略述者他云此有類十地經說一極弱者居在人間山林中住即今西方有大深石窟多是非天之害(今准陀羅尼皆云開修羅宮清辨菩薩現身入彼待慈尊出者是也)二者以下四類十地經說妙高山北大海之下二萬一千由旬有羅睺脩羅宮三者以下十二萬一千由旬有勇健宮四者次下二萬一千由旬有華鬘宮五者次下二萬一千千由旬有毗磨質多羅宮準此以下八萬四千深於須彌矣(今謂舊說皆云一萬二千由旬四萬八千此云八萬四千不知孰是)與起世經相違彼說須彌東西去山一千由旬外有毗摩質多宮縱廣八萬由旬七重城等是別聚落亦復無失此其住處也今文云海邊即五中初劣者也諸家亦云地上也次言海底即次四類今經中所列四名即海中之四者也準此上下次第列之應先羅睺次婆稚三佉羅四毗磨若從下向上應先質多等今並不然者就當類之中亦自不次第也呼為雜者良亦以此也意義如前若此中為四悉者總從諸義得名及趣攝住處並是世間之報法即世界也並從佛聞法信受破惑得道即具三義也具歷小大諸經今並開會同一第一義一實之道何復更有非天不直信耶本住第一義天非世出世邊之天迹示非天引物同歸本也觀者觀心一切法皆同實相中道第一義諦無二邊也。",
        "source": "X29n0596_007:0320b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上已釋通名四義下即釋其別四名也雖知其通未知其別故須釋之然經論中盛說此類事迹彰著故一一名皆應具四義文中但明其三並略約教但得今經之意審其差會即足易故略之初名準其次第合當第二從妙道也初因緣中有二翻釋初翻被縛舊釋其是脩羅前軍與帝釋鬪被縛因誓得脫故以為名今文中釋其義者言五處者只是手足頭頸五惡物若準付法藏傳毱多以死人死蛇死狗繫於魔頸今云五惡物即五屍也有云謂死人死蛇死狗死猪及諸臰骨五也即是以五物繫其五處五處被五物縛能所合名故云被縛並言或云者出處不一故也言有力者即勇健也以其勇力先鋒與帝釋共鬪為釋所縛以有力故從縛得脫且從被縛邊說故不言脫據實正應翻為勇健餘經正得其實新云跋雅迦此云團圓正法華云最勝即是勇健非被縛也今謂團圓或形狀或功能周備義也最勝即力用大也並勇健義此之翻釋最當也正以義故先列之此應四義者世間勇健世界也能從佛聞法能大勇猛發生眾善滅諸惡得聖道即四義也既通一化具聞差會今並於一妙道先踊躍而超悟也故初周之後便有脩羅眾領解即其義矣此即今經之勇健也本有遠近遠通現未近唯未也自得淨妙之體狀故有此能繫魔即五種不淨觀破其五欲亦欲五門觀外即五正觀破其五邪執也只是令離愛見歸於正道也迹隨於本遠近可知今更助一釋者首楞嚴者名勇伏定只健行定此神本住此定彼迹為此名也此義最便觀者三觀能也五住所也實際所置之處也空觀縛四住假縛塵沙中縛無明一心三觀一時縛五住也皆即實際謂或即解煩惱即菩提也又能如是觀者煩惱惑障頓皆消融無可當敵即大勇健觀也佉羅者佉字通上去二呼平呼非也駄字亦爾字從馬邊著大形聲之字非著犬也見寫經者當示之言眉甲者亦云廣眉膊也言惡陰者形皃最奇異也故他釋云形皃更大言湧海水者即前挑海淹喜見城也次勇健復即華鬘是文引正本云實錦者即以種種珍寶莊嚴其身猶如華錦故以名也正當華鬘之義此則正應翻為華鬘也亦云美華鬘也或可字誤正謂寶飾義甚雅便此並世間得名即世界而常從佛聞法即具後三四悉義足教者即圓妙莊嚴顯了性德如寶華鬘飾身體也本中二智能體也眾生所用也運令出生死也明本有此體用故示此迹也又本已能福慧莊嚴法身迹示世間華鬘以嚴體也從此本迹以立名故云爾也觀中皷覆即翻轉彼因果為大涅槃之因果也因果皆深廣故如海也又能修三觀之因能顯發三智之果即華鬘之觀。",
        "translation": "Although it's known that they are general and the distinctive ones are unknown, we must explain them. However, the sūtras and treatises are full of such phenomena and traces that make them distinctive, so each one should have four meanings. The text only explains three of them and briefly describes the teaching.",
        "source": "X29n0596_007:0321a07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋質多因緣中有三初翻略釋觀佛以下次廣釋最後一句更出異名初翻出二名但釋其一準舊諸釋總有三名或復但二三者響高種種疑穴居也二者無種種疑也今文亦有三而一在復然舊並無淨心之名亦是舊有此說而不釋其義故今亦闕然若直云此四字即是淨心緣下猶有呾羅二故非淨心之義以舊出梵言不盡故致如是種種疑者舊雖有此名亦不釋其義今以波海以下釋者謂水出此聲人不了知故呼為疑此亦未明準此正是釋響高之義故舊釋云以其於大水中出大音聲自唱言我是毗摩質多故云響高準此正足釋響高兼釋種種疑義以人聞之不知其意趣令人生種種疑故也準此應先標云響高亦種種疑然合釋之也既有其釋而無其標故是脫也而言波者謂皷繫也言舍脂父者即帝釋婦父寄以稱美之也起次廣釋也次廣釋中先標響義次釋舍脂父義言觀佛經者舊有云阿含經說或是兩經並有隨各舉一言生一女者即女脩羅也身若須彌也言生一男者即質多是也諸釋有云其形四倍母大海水下結其得名所從也雖有其物未有其名因海波濤而出此音因以為名也未有此名之前或見其形未知何神種種疑名以於此矣經中為天趣攝正以於此是寄以稱歎也下釋舍脂因緣緣其本是天種故納之也讒其父者帝釋有多夫人以嫉妬故致如之矣言燕居者諸家並無此名皆言穴居疑字誤也更檢正本言穴居者如前海居四類此最居下於海底故云穴居或即居處最為深遂故云燕居新云吠摩質多呾利此云綺盡以文其身也或云寶飾用冠其服此為最大者也此意謂用珍寶嚴飾其身首也此既因緣其中四要者隨文似即有四意也初略釋世界次美其種類勝即為人讒久交兵呪力無害即對治正本燕居表其任道第一義也穴居義同觀文灼然似爾新釋之義入為人中若例前者其義可知以此中有般若呪力故不例也教者有差有會會已能一妙音遍周法界故云響高也言本淨者此是修德久遠名本非性本也幸勿謬妄本即久淨為物迹示令淨據大經中明於此者功用最大出諸天上故知皆久遠入於蓮華法門明矣觀者即是修顯性也甚妙思之故響高者妙達心性二諦之理即高深也龍女深達即此觀矣若大身者能修妙觀顯出性德法身即大身觀也。",
        "translation": "Next, in the explanation of the causes and conditions of Cunda, there are three first, an abbreviated explanation below the contemplation of the Buddha, then a final sentence in the extensive explanation, and then a different name. First, there are two names, but only one of them is explained, and the old explanation says that there are three in general or two more, namely, resonance high, seed doubt, cave dwelling, and two, no seed doubt.",
        "source": "X29n0596_007:0321c04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋羅睺初因緣中先標釋名義次辨往因三明異名初中先略釋及辨趣類體量次觀天以下廣釋初先翻已略釋障即瞙蔽持即執捉能障持謂其手也所障持謂日月也而言者者言是其人也單言障持不知何物故更出其所謂日月也新云羅怙羅此云執日非天與天鬪時四天王天先與其戰日月天子放盛光明射非天眼此為非天前鋒以手執日月蔽與其光故云執日今為第四應合初列其所以與天鬪者舊有引婆沙云脩羅有美女而無好食諸天有美食而無好女互相憎嫉所以恒鬬今謂以讒其父亦是一緣也是畜種者辨其趣類以此一者是師子兒故也身長等者辨其形量所以能障持諸天日月者正以其體量若是力與天敵故也釋成能障持義觀天以下次廣釋也然障持有二義一者障持於他即日月也二者為他障持即三力也總此二義故名障持與前義一同也故前引真諦釋羅云名從此立今此文如向所釋即障持於他此下明被他障持若不得此二意其如此文何於中有二初明三力後總結初即有三初明為人福力所持二明天力障持三佛力障持初是人之福力所資助也觀天等者羨他勝境戰興之由漸也人能孝順二親供養三寶以此福因當生於彼即雖未往而功已懸資令彼力盛使其非者無以能為故是為人福力之障持也又日以下三事並為天力所障持也初二形也後一聲也既為日月障持嗔怒而發大聲手既不能聲亦無害天福力也因此明世不達其由以為災恠亦不無分理世俗亦不全以為然自是陰陽運數應爾耳雖是彼事不妨人之業力自招亦如向明人修其善本不為天而天自致其福彼自蔽天非害於人自致其禍亦齊公覩霸王之兆而翻為病皇子之說齊公一聞其疾自愈却達不然矣此亦如是不達其由便作一向定說固非全爾若能深達然則無慮矣又如聞鬬戰怕死有聞而更勇彼本不為二而非不為二因今文為破定說故云爾也從日月下明為佛力所障持也文出大論論中有五一來告訴二佛誡勸三甚大怖懼四婆稚來問其由故五其具答所以具在論中不能繁述今文但有前三無後問答二也言訴佛者言其惱亂於己請佛救護也言佛告者具言日月功德除闇照明清涼可愛利益深大令其勿惱害也下是明其大驚怖也下是總結三力因緣不能障持於彼翻為彼障持也此中三力即前三眾生即前初四天下人修善力也餘二可知常說直讀文過不知其文處二文抗行矣下是明其因也知前明其體力身體長大如前力能障持日月倍大其形復好鬪戰皆何因所致今此具明此二因也初是大身大力之因謂於大勝境行大施發大願此三大故得大身力但是世間我慢勝負之心而無出世正信所導故致常好鬪戰此是第二因也又明以歡喜大施之故感其依報勝處而作為主光明即其住處城之名也如前所明然前三皆應有因但經不言故無述也言吸氣者諸家亦引此名而並不釋其義正言被佛誡已怖懼飲氣吞聲不敢復奇日月及出大聲從此以為名也此既因緣四要意者初障持他即世界也人修福善諸天有力為人也天力佛力即對治也飲氣吞聲信佛力大不敢復為第一義也所以文有次第正顯此也教者障惑持解也惑即事理二障解即二智之道如日月也通即諸教共有於今開會無麤唯妙故名障持本迹者本能障持一切為顯三力迹迹為三障持也觀者一心三觀障一切惑持諸妙解也(云云)之意大略如是。",
        "translation": "When the four heavenly kings and gods first fought with them, the sun and moon, the sons of gods, emitted a brilliant light that shot out from the eyes of non-gods.",
        "source": "X29n0596_007:0322a20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋四迦文但因緣無餘三釋於因緣中有二初釋通別名次通辨其果報力用初中有二初通次別初通自二初依聖教正釋次述人師異解初中有翻名釋義居處形量新云迦路荼此名妙翅鳥翅羽色妙不唯金故此義美矣言居處者南洲東西二十四萬里南北二十八萬里如何居此樹上或其神力自在則可未知所出言兩翅等者然古今諸釋皆以此句釋於大身不應在此通名中也或因便相從言耳次下明人師異解莊子云北溟有魚其名為鯤鯤之大知其幾千里他而為鳥名曰鵬鵬之背不知幾千里怒而飛翼若垂天之雲此其事狀微有相近古人因此呼之為鵬鵬行以下釋其鵬義起下亦為鳳皇之說以其飛行之時眾鳥鵬從故名為鵬鳳正爾故此鵬鳥是鳳皇也祥云龍王經翻為鳳皇也意明金翅即鳳皇也即王者五雲中之一南方之雲也亦名為朱雀亦赤雀亦嶽族則族之長故皆隨而翼之王者能備行禮文正此靈應之鳳字[夙-歹]內著鳥形聲之字謂內形外聲也皇字直作帝皇之字不應從[夙-歹]世俗加之疏本並皆從[夙-歹]皆以後人專輙加改學者宜須知之下丹丘不許者明鳳有三德金翅不然故不為也三德俗典盛說歎其所言亦有由矣準梁昭明太子莊子疏云鵬即是鳳別有此鳳是鵬之異名非是來儀之鳳釋如彼以此義故彼即會之以為同也然無正典人情不足為據故不用之(云云)之意大略如是下釋別名初有二義如文威德即勢力慴者(占涉反)怯也懼也伏也又音牒字亦作攝恐怖之皃也具足者諸事皆大故具足也大身即其類中形最大也若諸所釋皆以兩翅相去等釋此義也謂閻浮提止容其一足也不可動者即如意自在義也古今諸釋皆同於此也下是通辨其果報力差別於中初明報資所食有四之差別次明復有三時之別初又有二初明報力雖有權變之能實報要資所食之物次明所食之物差別有其四相初言而報須食龍者標其實報法爾前既變化報力權能此非變化故是實法爾力也此下辨其所食相狀差別如經所說有四生鳥食四生龍此其是也投身於海以翅闢水令兩向分取胎卵等者也他引增一阿含云卵能食卵胎能食胎卵濕能食前三化能具食四與此初二不同如經所明又準長阿含應先卵次胎也四類隨其所應食者即得若非所應而強取之鳥喪亡此某因緣果報法爾也經又云設有龍身能事佛者是鳥不能食噉以佛四等大勢力故文略不出下明仍有三時差別之相即有三也初明所食數量及以時節次明報盡不復能食三明盡後餘勢相狀初是業力法爾次是報盡法爾三是餘力法爾也噉參者上音教謂高聲也嘇音(樒號反)說文鳥群鳴也字正作喿無此嘇字世俗字耳若作譟者謂語聒束人也肉裂以下明其死後之狀心為珠者故知此珠體亦非一今謂若四要者初總別名義並其果報之法世界義耳次通辨中二段即為治二也而能從佛聞法得道即具四矣文無第四映前三自知也此是畜趣類中最威勢力者也能吞噬諸毒惡漸頓諸經皆明其類故亦通權實至於此會一門之後同為一妙體用無復麤物呼為妙翅盡其實矣本者本住大勇健定能慴伏一切魔外眾毒為除諸毒惡故迹示此耳觀者圓妙三觀能令一切煩惱眾毒皆消融即是噉毒之觀也文中不出例略如此未及委悉思之思之。",
        "translation": "The next explanation of the four skandhas is only causal, but there are three other explanations in the causal sense. First, there are two explanations of the generic distinct names, and then there are two explanations of the use of their rewarding power. First, there are two explanations of the generic and second, there are two explanations of the distinct names from the first according to the correct interpretation of the noble teaching, and then there are the different explanations from human masters.",
        "source": "X29n0596_007:0323a08_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次釋列人王眾即第八番摩伽陀國以是地主且以世間勢力次第故於最後列也文具三釋唯無約教初因緣中經文舉母標子正在顯其母也翻者即思惟之子也古今雖同此翻而並不釋其義或如觀經教我思惟等以其能發起此思惟教門故密有此名故賢護經名思惟現前等也有處說云本是毗耶離國人也(云云)新云吠題呬弗羅吠是勝義題呬云身即東毗題訶洲之名訶是男聲中呼呬是女聲中呼此是彼山名亦彼山中神名從彼乞得因以名也次出父名雖翻未見其義或見像知真故云摸實或云影堅其義同也經但舉母今欲令並知故更出之何故不以父標子者祥云爾時已害父竟故不標父舊復有釋云以其害母故以母標之今謂如前以父母標子者多矣豈必總以於此故應不然次正釋王名者有兩翻釋初中具足梵云何社多設咄路此云未生怨阿未也社多生也誤咄路怨也未生之前已有怨故今謂此二義一以宿怨故如觀經疏二約現雖未起怨害已有其相故也言婆留支者或作婆字二字多濫應是娑字言無指者諸家皆云折指謂初生時相師占之有凶逆相父王令於高接上操之不死但損一指故也云其所為怨害者略四因緣宿世故現損傷故貪國位故惡知識故以是故也言將護恐其後時原其事由而為大患故假施此名也又或是善現翻前惡相現也此中如觀經疏及能授雜記中應檢會之此通是世間因果之法世界也示怨有對令人勿為即對治也內人將護即為人也從佛聞法得道即第一義或可初並世界次本迹中即具餘三義也而不明教者約本迹中其義自明不繁文也次下明本迹者初仍前名義標其本迹次約大經明其本次約普超明其迹後約法華涅槃顯成前本迹初言善見名本也者密彰其本久已妙達法性非逆非順故善見是其本也為引惡者示於逆相而致此名故是迹也次本中二重初中有離合合中有反順知之知之阿闍不生如前世即設都[口*路]此云怨家今云世即設也略下二字又略家字但言怨也以下是合釋也有反有順可知次重離合亦可知言八法者記云或八邪八風八倒定以大經所明八不淨財當之今謂八法乃多何以知是此八又此本誡出家人王是俗人何以言此故不可今謂正以八風何以明之此八四逆四順明其本住非逆非順妙淨之道故雖迹為逆順故八不能傷斥其本淨復名不動菩薩故是八風不動之義明矣此是等者結也如經此說是明其已久得真實圓妙之道次明迹者得此忍者有人釋云兩處不同或十迴向或在六地今謂豈有十向仍墮地獄此是前經方便之說前明其本久已見性清淨而後造逆懺悔忍得仍墮地獄等故並是其示迹其迹等者寄以顯本也迹既如逆順廣大信知其本深達不思議矣下引兩經顯成前二也清淨對下逆惡即善順眾也廣如大經十八其本不二而能二用故法華為善順涅槃引逆惡又舉迦葉為例不堪等如長壽品明其人皆悉無常不能發起不堪付屬大涅槃常住之法也據此意明迦葉於二會亦並迹為物也以其並已久入實相故故以類顯世王同也問等是二用何不法華引逆大經清淨次第理應爾故隨感而應適時宜故此經正當一代大事開會後經捃拾殘緣故初為清淨後為曲引先會其善後破其惡各一意各具四義舊多辨說並非正要正要在於本迹故今並不明之即是不知此要故結責云可不迷惑也此則本迹不生怨義明矣本則唯妙迹通權實故明本迹教義自彰故不別約教者意在此矣次明觀中楞伽經中作此說也正與觀義合故引用之如別抄釋為對父母故言此二亦即或業如過去二支也即攝三毒一切煩惱也如理之觀觀之無復此等即是害也言逆順者逆於生死妄情順於涅槃正道也又引淨名證成行非道即逆也達佛道即順也非道即九界惑業苦三道也佛道即佛界三德也三觀觀三道行也從觀以會德通達也此即無怨害之觀也。",
        "translation": "Although the sutra is the same as the present interpretation, it doesn't explain its meaning. Perhaps it's like the Contemplation Sutra that teaches us to contemplate and so forth because it's able to initiate the teaching of contemplation and therefore secretly has this name.",
        "source": "X29n0596_007:0323c17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上明釋雜眾文有四上是第三消文已竟此下第四科簡顯前義也於中初別論人次通辨諸趣類初問應多何故却少言在人說法者此是應多不應少之義人趣受道勝餘趣故當處近故故不應少少者但一王及眷屬故答文四句初明人眾不少文略不具謂此列中文也下引兩文略非少之義初即當文也此是序文猶略而言等者等取後文云又諸萬億國轉輪聖王至此即甚廣次引前經者彼經中先列四輪王次云國王王子國民國女大長者各與眷屬百千萬數來詣佛所以此證知甚廣非少文自略也其文所以略者以前經及當後文自知其廣不在繁文故略之也。",
        "translation": "The above explanation of the mixed multitude of texts has four meanings. The above is the third elimination of the text, and the following is the fourth section that briefly shows the previous meaning.",
        "source": "X29n0596_007:0324c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下通料簡者正經此文所列於三界六趣之中全無上一界下一趣此固有由前文未辨其故今此明之也初問準答中意亦應有四義一通問三界六趣差別之由二通問於此界之趣中有見聞之由三別問上一界下一趣於此全無餘經仍有之由四別問於二五中復有之無之由即兩通兩別也此界處處之見聞不得相離故相帶言之於下答中自見答中有二初許辨次正辨此義持要次須分別故云應辨次正辨中初約三義初因緣中有二初答前通別兩由後總結勸初答通別即有二別初明其兩由且略以下明其體狀初中自復有二初大略次曲辨持則昇毀則沉急則見緩則不見大略如此次委曲者持有麤細略舉兼中故有上三趣持既爾矣毀亦如之故有下三趣大而言之前三總略舉名小大含其中也唯圓名大以是實故其由略爾於下自見次明兩由體狀雖知其名未識體狀故須辨也於中有三初立三品句若通論下次於其體若戒乘下三釋其相初中有標有列初各三品如次易知其一句者四依品中云於戒緩者不名為緩於乘緩者乃名為緩開為四者經之一句具四義不為四句不盡義旨故開為四何者經之本意正在戒緩乘急若但急固是法爾若在四依宜偏乘急若其戒急非經正意不獲已矣若第四句理數自然非在意也故知經文已含二句義通於四意正在一今通盡其理矣今正用通義也次列四句即將乘戒各三更互含為四也即是四釋於三也次下出其體也先通次別通則乘亦名為戒戒亦是乘以並是息惡運出故又引證可知道共等者後四戒也下次約別有二先出體次所以初中此所列出六戒束之是為三品初四是在家戒法未具足果報猶劣故為下次一雖兼於前未及於後法與果報並處其間故名為中後之一者能兼前三故云乃至法之與報勝極故名之為上品之義正以是矣此且約法未論持行故云持品三戒未論三品持戒若就持論三則與乘義不會宜善思之此等所收並名戒者能防以下是釋之也此即別論戒法義也次下別論乘體及義引證文明三四兩體諦緣度是三乘之體此義猶局故更約生滅等四種智慧以顯盡其體也此等所以並名乘者能破以下釋也以能破苦因能出苦果故此因果體須知通局無量無作須約界外論也下以引證簡通以顯別也此是通別二體今意正從別也既識兩釋此下約四識顯二三之相狀也其中四句即有四別釋第一俱急句中三品惑及三種乘一一品戒皆有三乘即有九義第二戒緩乘急句中亦應有九略總為三第三第四兩句各但有一義也於初九中初一具出於三以二各出其一餘三並例於前在文易知初中乘急中言通教者指方等也通被四機故帶方便者即般若教帶二方便也以第二句準理亦應有九文略總戒為一別乘為三釋一指二在文易知以第三句戒報有三乘都無一故但一句此戒乃為後世流轉之因言三億者大論云佛在舍衛二十五年衛有九億家三億見聞三億聞而不見三億不見以無乘種故也經云於乘緩者乃名為緩正在於此豈不習哉第四句未出期前句是現出當役此句現當俱沒豈不勉耶此前總釋答前兩總問竟此下是第二別答此經無二餘經有二之由也即兼答兩別由也思之初答下一趣有無之由次答上一界有無之由其中一一皆出其所以在文易知初餘經即方等後餘經即中陰餘更有者如前釋也若得以下是第二結勸也明有三功能勸後學者勤作意也謂若深得前來所釋之意用以推尋諸眾無不通達其緣由本緣緩急皆通於二果報差別本緣由戒緩急聞法差別本緣由乘緩急故皆可解勸非但識此餘經亦知下指餘文廣釋彼釋雜眾料簡開為七門一乘戒不同二信法信行三大小乘四根性漸頓五應迹六觀心七化他彼文長義廣此中文雖少義甚簡要但熟尋此文領其要會以彼助成可矣又識以下是以功亦即能知權實本迹也向明因緣若通若別明已具約教義故不更論便例以明本迹實有二種緩急權亦從之但得實意則權迹自顯故云轉明以第三結觀自修觀行也行中以他觀己因果二種即世與出世若世果報優劣知由過去戒之緩急若出世因果差別有無知由往之觀習有異以現果驗於往因復以現因驗於當果無所不知故云三世因果洞曉大略如此結委曲思之思之況釋總結之文疏文於前不開亦可於列三眾文前大分為二初列三眾後總結今此即第二也亦可於第二雜眾文初大開為二初列八眾後總結今文即第二也此二俱得無在言眾集即當時聽眾集會爾也佛德尊極盡情致敬故頂禮足聽受妙法之儀故退坐也各隨來方故云一面又一心瞻仰尊顏故云一面此亦結集之儀軌也應云總結集會之儀軌也上來明序文雖有五旨在一言道原德母本立道生得不務乎思之通序竟。",
        "translation": "In the next section of the answer, there are two ways to explain the meaning of the six destinies listed in this text of the true scripture, namely, the absence of the upper one, the absence of the lower one, the inherent reason being that the preceding text doesn't discern them. In the first section of the answer, the meaning should also have four meanings.",
        "source": "X29n0596_007:0325a01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "妙經文句私志記卷第七",
        "translation": "Miaojing wenju xizhiji vol. 7",
        "source": "X29n0596_007:0326a13_0",
        "is_bad_quality": false
    }
]