[
    {
        "source_sentence": "妙經文句私志記卷第十三",
        "translation": "Miaojing wenju shizhiji, vol. 13",
        "source": "X29n0596_013:0453a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "石皷沙門釋　智雲　撰",
        "translation": "Shiqiu shaman Shi Zhiyun Compose",
        "source": "X29n0596_013:0453a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下別消文大分二科言緣了者並善業行故是緣因既云聞法故是了因皆能辨於實果緣因即種子故也了種亦爾初言天乘者有標有釋在文易知經不言天乘亦不言果報但觀其業行以因驗其果故知是天乘文明起塔供養所起塔之種種供具以七寶此非精至傾竭致焉於此故果報不營而自備皆世勝果而行因是天乘也文中即是七寶已如前釋塔者古今釋名不同或塔婆或偷婆或斗藪婆此云方墳亦言[冗-几+豕]亦大聚如前已釋增一阿含云有四事得梵福一無塔立塔二和合聖眾三會謂修持破寺四佛初成道請轉法輪梵福者四天下眾生至六欲天不及一梵天福廟者皃也寺塔供養尊容類如祠宇神靈之狀皃也木密者祥云櫁形似白檀微有香氣長安親自見之也引光明者證前供養為天乘亦是況也甚微尚爾況甚勝耶。",
        "translation": "The following is a summary of the text divided into two sections that speak of the fulfillment of conditions and good karmic actions that are the causes of conditions and the hearing of the Dharma that is the cause of fulfillment, and the fulfillment of seeds as well. First, those who speak of the heavenly vehicle have labels and explanations in the text that are easy to understand; the sutra doesn't speak of the heavenly vehicle, and it doesn't speak of the results.",
        "source": "X29n0596_013:0453a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明人乘者亦有標釋勢數如前此因果最劣故是人也泛爾不專至悠然等閑不急切也果中二事對上二因也後兩句總結開顯同成緣了因也不欲繁文故同一結開顯實也。",
        "translation": "Next, he explains that the human vehicle also has a tendency to explain like the previous one that the cause and effect are least severe, so it's a human being who doesn't concentrate on the two things in the result and doesn't rush into the two causes above. The last two sentences conclude and reveal the same cause that's formed by the same conditions.",
        "source": "X29n0596_013:0453b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次四頌開天乘者亦以精至故精至者體勝故數多故以此故是精至故是天業文既云為佛既言為求作佛此是妙行何名天塵莫不皆作此解今恐似而非何者謂為供養佛故而造形像此造供養為求生天非為求佛而造供也言樹膠者即木膠如下文有膠香是也言得失意罪者不能令人生恭敬故以此不起故致惡果言當堂等者為初隨世故有四儀時俗除涅槃外多為立坐於立坐中多為生像以最生善故經中所明法則甚多非此正意故略而注(云云)然此中正明開權若辨此等相者略有二意一者未開會者即得作緣因開會種故二者若開會有解行者莫非妙業即妙行矣乃至等者此雖極微要是至勝塔上善行故能致於人中之果故雖人中之報萬殊良有以矣言結成者此應總前人天故云如是諸人等也初行自成次半令他成也既開顯已即成圓因趣果故云漸漸即是圓漸非漸漸也。",
        "translation": "The next four verses reveal the vehicle of heaven, which is also based on the fact that the essence of the essence is superior, therefore numerous, therefore this is the reason it's the essence, therefore it's the result of heavenly activities.",
        "source": "X29n0596_013:0453b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既已以下釋後兩句既自成四一復能化他令入四一前自但三後化但一更互相顯故注(云云)化即說妙教化度脫故屬教一此明四一者如前已通明竟次諸塵者謂六塵也文中有色香聲及敬善心即兼法塵唯闕味觸二也文雖闕義意必具他人呼為三業也亦以廣大專至故是天業銅鈸等者記云長安亦無此音或聲轉耳或以傳說隨而書之今謂此音樂之中小事丹丘豈不知之而有此言又準傳中煬帝前後四度勅入長安每去皆經二年前後四度經八年豈有不聞此事固不應爾多是後傳寫誤正應靈鈸聲轉錯為露盤即是鐃亦名為鉦軍中執之以警眾也亦樂中擊之以相參和即八音之中金音也並屬聲塵固應爾次人業中漸見無數佛即得開顯成佛道也次身業言天人者以業中通結成中廣故通二也文釋分明次言結成者結向業所成就利益以此行業之故能致自他皆入實也謂得自實已從體起用息用歸體此義甚廣故注(云云)大略爾也次口業亦云語業其業甚廣若其專廣即屬天業散亂一稱故唯人業功之所致亦並入實亦應略注(云云)次釋南無義先標義廣次釋出其廣相南無亦那謨亦納謨亦那慕亦曩謨曩慕皆通有此諸音若切正應云那慕文中作無必須去聲重呼亦通上聲從麼字中出若直依字音呼不正切也古今釋或云歸命亦云歸敬亦云救度亦云敬禮或云稽首多種不同言大有義者謂此一言經論釋之有多所以故也如下所釋下釋出中雖復大有義要不出於四種初總釋名即世界調達以下明能生信利益即當為人那先以下明能滅罪去邪即對治胎經以下明能得道即第一義初者文有三翻謂度我警怖歸命兩義屬眾生一義屬佛以此一言有其兩向釋言可施者謂可施設於眾生正當此中文義於次下文即不可無此理故次翻為驚怖如後驚入火宅之義也有翻有釋釋中有標釋結證證中復有釋也下文無喜字而是喜義故舊來釋皆謂得諸佛勸慰心喜故稱南無也有云有本作喜稱所未見也次言歸命者以命歸投十方諸佛請救度也起信云歸命盡十方是也謂如此之義悉可施設於眾生處非謂可布施於眾生或多謬誤南山尼抄釋南無佛引提謂經云南者歸也無者命也佛者覺也此云歸命大覺也又云南者禮也無者大也佛者壽也此云禮大壽也此並義兼悉於眾生也。",
        "translation": "Although the text is missing, the meaning must be fully expressed by others as three karmic activities, which are also called heavenly activities such as the cymbals, because they are vast and specialized.",
        "source": "X29n0596_013:0453c08_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次第二事中有三初稱二字後獲勝果次稱全三字天像輪首人咸歸信三結勸精誠前二未知出處稱賊下是結勸賢者即末代歸信佛者十方等正明利益以結勸也此文讀者不定或云十方尊神不敦當但精進下結勸此即謂一切神靈不敢當蔽謂佛力最大能伏破一切也或云應作感字謂十方尊神而不感謂感十方佛而應起也當但下是結勸文中誤作敢字今謂此兩釋雖義俱通後義將勝後宜詳之次釋第三意中言那先者比丘名也因人名經故云爾也經有一卷此比丘有故舊為小國王善能問難因與那先論義有多問答所問皆是邪執那先答之破其邪盡此中所引是其一也其諸問答破邪顯正其美恐繁不述其中有一問云佛有相好不答有王言佛父母有不答無王言佛亦無人生皆似父母故那先言王見蓮華不答言見生淤泥不答言生先言豈以蓮華生淤泥似淤泥耶佛亦如是王言善哉善哉雖非疏文正意亦旁破邪見以故是對治也。",
        "translation": "Second, there are three things. First, there are two words for attaining ultimate enlightenment, and then there are three words for attaining total faith. Third, there's a conclusion that encourages sincerity, which is to say that the last two unknown sources are called \"thief.\" Second, there's a conclusion that encourages the good man, the one who returns to faith in the Buddha in the ten directions, to correctly explain the benefits and exhorts others to conclude the text.",
        "source": "X29n0596_013:0454b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次第四義即於彼佛初教第三會得聖果之人若至第五時悉被開會佛道今謂略明其初也既並當權實之道故即第一義矣言大有義略如是也。",
        "translation": "The next fourth meaning is that in the third meeting of the Buddha's initial teaching, those who attain the noble fruit will be fully initiated into the Buddha Way if they reach the fifth time. This is called a brief explanation of the beginning, which is both the expedient and real paths, so that's the first meaning.",
        "source": "X29n0596_013:0454b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明了因者謂五乘解心也前是開其行今是開其解謂開五乘差別之解心同成一乘妙慧故云了因疏云例上等者以經直云若有聞是法不知何者為是法緣此中正是開權顯實是法須指權教五乘之法直云聞是法若為辨具五果例上只一六度之行而有三教之別天人之行但有至散之異此中亦爾即可知也謂聞有相聞無相聞有相無想非有相非無相別教聞次第三諦之教故須如是為接前之有無故便言無非有也至心聞於戒善散心聞戒善亦如歸戒為天人因爾若之是法謂此妙法恐與此文不相應則五佛章長行偈頌開權顯實之義悉皆可會今直順文前開權行顯緣因今開權解為了因則義易解而文無乖違也經云在世或滅後豈有佛在開妙而更待開縱有其義但有是通途之義非此中意注(云云)略如向也可以思之。",
        "translation": "The next explanation of the cause of understanding refers to the five vehicles' minds of understanding, which were previously opened to their practice and are now opened to their understanding, which is to open the minds of the five vehicles' discriminating understandings into the One Vehicle's marvelous wisdom, hence the term \"cause of understanding.\" The commentary on the examples above says that the sūtras directly say that if there is hearing of this teaching, it's not known what is the condition of this teaching.",
        "source": "X29n0596_013:0454b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次問答料簡釋疑顯意初問者長行五佛章皆略頌中四佛並略不別歷五乘唯此過去歷別廣此固有由故此發明之也答中初明現未二世擊動之功微故略次明過去證發之功成故廣約之又引以類顯虗言即二世也驗實即過去也文出大經雖非佛言理固然矣故引證也。",
        "translation": "The next question is, \"Do the five buddhas of the long practice all abbreviate the four buddhas of the verse and don't separately pass through the five vehicles, except for this past one, which is inherently invented from this.\" The answer begins by explaining that the present and future are two worlds, and the effort to move them is slight, so it's abbreviated; the next explains that the past has accomplished the effort to realize them, so it's broadened, and it's cited to show the type of words that are the two worlds and the reality that is the past.",
        "source": "X29n0596_013:0454c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次頌未來二者上長行只有開顯之二今即頌前二也次頌顯實中必有四上文但二而義兼四今此當分即其四也初行頌人一文最顯初所道道即是行誓令物同妙得此行也後自有理故此道屬行又正取能行也即此名顯也教中既云雖說是故說故是教也百千億要在七方便為一乘即長行是法皆為一佛乘故也初行正明教一次行釋成必為一乘者正顯理次無二故也釋成者前明理無二故一今明必藉能以顯故說一教疏釋第二意中二番初約教次約行又初約能所二法釋次約三因釋初約教中初談理體為說教之由言兩足尊者若就內德即定慧福慧為二足妙極為尊若外形即人中天尊也知法常無性者知謂證照也自證其極而照了一切法體性也法常等者是所知境也法是體也常無性是德也謂有無之間德也疏云實相者標體即釋法也謂法性故云實相常住標德即釋常也上釋所有之德即妙有也何故名常本妙有故又即性德慧命故下釋所無之德即釋無性真空之德也無何等性謂性相二性也性謂四性無此四性名為無性即性空也無亦無者亦無此能無名為相空也若有此無無還成相亦無此無故為相空也無此二性故言無性今謂次既言中道此即無有無無二種性也注者云無空有二性故云無性斯有當矣總知此體德有無三義故云知法常無性大略與前寂滅義同疏文仍有少異照無性有二一破性二顯本今是顯本故云常無也若不此釋豈為佛種即三佛種也若不如此釋者疏文難消疏不如此釋者經文難會。",
        "translation": "次頌未來二者上長行只有開顯之二今即頌前二也次頌顯實中必有四上文但二而義兼四今此當分即其四也初行頌人一文最顯初所道道即是行誓令物同妙得此行也後自有理故此道屬行又正取能行也即此名顯也教中既云雖說是故說故是教也百千億要在七方便為一乘即長行是法皆為一佛乘故也初行正明教一次行釋成必為一乘者正顯理次無二故也釋成者前明理無二故一今明必藉能以顯故說一教疏釋第二意中二番初約教次約行又初約能所二法釋次約三因釋初約教中初談理體為說教之由言兩足尊者若就內德即定慧福慧為二足妙極為尊若外形即人中天尊也知法常無性者知謂證照也自證其極而照了一切法體性也法常等者是所知境也法是體也常無性是德也謂有無之間德也疏云實相者標體即釋法也謂法性故云實相常住標德即釋常也上釋所有之德即妙有也何故名常本妙有故又即性德慧命故下釋所無之德即釋無性真空之德也無何等性謂性相二性也性謂四性無此四性名為無性即性空也無亦無者亦無此能無名為相空也若有此無無還成相亦無此無故為相空也無此二性故言無性今謂次既言中道此即無有無無二種性也注者云無空有二性故云無性斯有當矣總知此體德有無三義故云知法常無性大略與前寂滅義同疏文仍有少異照無性有二一破性二顯本今是顯本故云常無也若不此釋豈為佛種即三佛種也若不如此釋者疏文難消疏不如此釋者經文難會。",
        "source": "X29n0596_013:0454c18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上明由竟下正明緣此妙種說妙教也初釋佛種指前體德是也即此妙境能生妙慧故名佛種故大經云無上菩提種子故名佛性下釋緣起先通談其道理次正消文初先明迷次明解舉迷以顯解也迷即不覺故眾生起通指五住總明無明非別指也由此迷向有無二性空也故即有九界眾生起也次解中既教行二總為由向迷亦指無明行也易故略言一也經雖但言教義必具行正覺即妙智通於始終諸位次釋是故說一乘句正為顯發此一種理故說此一乘教故名教一也上約教竟下約行釋也即能顯理之方也初句正因次句緣了後句結三無性本有故名正因能生修德故名佛性佛種指正因即所起也緣起即緣了能起也緣了即妙正助二行也正種起時三種並起故云一切以性德中具一切故即智斷不二等一切三種諸功德也性德顯名為相也所以更此釋者緣經云法常無性又云佛種故須此釋故前釋云實相常住空無二性即本有三性緣此而修顯本性三以顯修性皆具三德故更約此以釋此三即是一乘所詮為此而說故即一乘教也此即所知見知即能知見略合言之故云知法常無性也為說一乘令修會性故是說之由也雖言教一亦即攝一切義次理一者既言法位常住知已故是理一即顯一切眾生本有此妙理也經文初二句正明理一次二句釋成釋初正中亦有兩番初通亦生佛對釋次單約眾生釋又初約人次約法初中二句同顯理一而初句為下作因謂常住之所以也不同位不常住同故常常故知位同也位謂地分處所也理體也釋云眾生正覺者釋是法也是法謂諸一切法雖多以類分之即佛及眾生亦世間出世間總名是法即十界也一如無二下釋住法位也即以法性真如為位以悉同在其中為位雖修未修隱顯之殊本分無更別也故淨名云眾生彌勒皆如也此即舉其性同為下相常之所以也下釋相常者向明性同今明相等先舉正覺住如性位故相常顯眾生性同故相亦常也下結以故是理一以性相皆同故也或云世間眾生可是常相常何有若信其性知相豈定無淨名云不生不滅是無常義例可知矣此正明理一無以事惑可以思之次下專約世間眾生釋也又前通修性此專約性(云云)但釋世間者前約縱人此約實法即九界實法即是是法也是法全是正因由是正之故故常住也以釋常住謂陰等法常住也其故然正由全是正因佛性先出其體然此以下釋常住義言六法者即五陰及神我也向舉三科今言六法此以大經因破邪計故有此言今從經言不即不離故言也然舉此六亦即攝三諦也文互舉正應云陰等正因不即不離復與修得緣了不即不離記云正因六法理是故不離但理故不即緣了與六亦復如是所以作偏說者以易顯故正本不離今加不即緣了不即今加不離故須各具方名盡理此即大經摸象之喻是故此六亦名正因同屬苦故亦名緣了兼惑業故此中須有通別二對別者六中行及神我是緣因種餘數及色是了因種識是正因種若通對者具如今文六法性得正與緣了一體無殊當知陰等即是常住此並是記中所釋所以更此釋者消文顯成常住義便故約義顯理一故定云說釋餘數及色為了因種恐誤今謂不即不離二義經中象喻佛性若別計六為佛性如盲各執一分為象此不即離六無象故不離各執六法非佛性故不即離六無別佛性故不離此明別非總是合論故云不即不離次約修性性故不離修故不即合論故云不即不離正顯三佛性故必六法總陰界入一切法皆即是於即是中有總有別今從總也須以大疏對會所未及也初釋世間常住世間所以常住只以佛即三性三性常住世間既即性故常住也以性常住故即理一次釋所以更此釋者消文顯成常住義便故約義顯理一故言釋成者舉昔施權釋成今顯實也言朗然者釋知字義即自證了故云朗朗然久暢但取自證於先故云久暢不論本及以昔此是未來佛章即例今懸指於當也物情即根鈍障重即五濁此並約昔四味中三以論不言圓也今古今諸釋皆云無名相中假名相說故云方便嘉祥非前言說及以神二種顯實理之上言說故言方便故知此經方便多種今謂雖云多種只是三種將顯其多塵滴而已注(云云)者意略如向。",
        "translation": "Although the sutra only speaks of the teaching, the twofold teaching and practice is based on the misconception that the twofold teaching and practice also refers to the emptiness of the two natures, and it's easy to say that the one. Although the sutra speaks of the teaching, the twofold teaching and practice must be complete, the twofold teaching and practice is based on the knowledge that the three natures are originally present, and the threefold teaching is based on the realization that the three natures are originally present, and the threefold teaching is based on the realization that the three natures are all present in the three natures.",
        "source": "X29n0596_013:0455a21_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次頌現在中先與長行辨異言上文四者記云上文但三謂出世意開權顯實今既云四則上應云四總結也又有二不同一上先開次顯今先顯次開二者上顯實中但有教行今此理教或理行也不同無妨故不別云初意中亦說如是法專為說妙法而出世也佛乘約說即教約修即屬行只即具三人在其中次開權有照機施化於昔是施於今即是開也。",
        "translation": "Next, in the verse present, we first discuss the differences with the long practice, saying that the four above are recorded as only three above, namely, the intention to appear in the world, the opening authority, and the manifestation of the truth. There are two differences: first, the above first opens up, then reveals, and now the first reveals, then opens up, and second, the above reveals the truth in which there's only teaching and practice.",
        "source": "X29n0596_013:0456a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是解釋迦章頌此文稍長諸釋各明起盡而意各自不同今未能會將從省便即為五別初再舉文標示章門上文無下次與長行略明闕具但舊以下三明古今料屬於此之由古舊為下四述古今料屬之相狀頌略中下五明今之所解釋於此五中各有其次三並有古今第五唯今而有略廣二也如此料目起盡稍易見也初者然法說中都約五佛以明開顯並有長行偈於是二中皆先四佛後明釋迦上來是四佛頌文已訖自下即當第二釋尊頌文故標云爾次闕具者如前所明五佛皆有六義約義雖齊有六就文仍影略互彰就其頌中釋尊具頌其六今語其文故前闕一而此具六所以然者正是當代化主將盡明此開顯方為後二周之本故也於後自顯此不繁述。",
        "translation": "The next is an explanation of the verse in the Kāśyapa school, which is a little longer than the rest, and the explanations are each explained in terms of their own distinct meanings. The first is to cite the text again, label the chapter and teach the absence of the next and long lines, and then summarize the absence of the following three explanations of the mutual dependence of past and present.",
        "source": "X29n0596_013:0456b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次明由者即雙明古今二科於此之所由也有何所以並先述之置於此中故須明之於中有二初明述者之所以次明作者之所以初有五句初四記述之由後一正明述記之意由中上二句作者之勢數下二句學者之艱難以此故須先述記於此也撰齊集也前此中也至文謂至後入文及下譬文處也交加謂法譬文義相參會也問五佛長行偈頌並名法說並應為譬作本何故獨在釋尊頌文而並於此以科屬文之答固有深以何者釋尊當代化主舉餘四以助成故但約主則餘四助無不在矣故直約釋尊在於長行言之則為佛頌文所問若再言之則繁而不便佛意亦爾故長行略而頌文備以此之故古今皆於此中而科屬之(云云)下明作者之由者正由經意如此故不得不先科屬於此亦不得不有艱難也先正明其由頌上為成上根得悟解故本下為中下故此則法譬相因待故也後一句釋所以為本之義也此故是通明古今作釋皆於此先之所由不可獨言為近舊也大略且爾未暇委曲。",
        "translation": "The next reason is to explain the reason for both the ancient and modern branches of the teaching here, and how it's both explained first and placed here, so it must be explained. There are two reasons for the first reason, and the second reason is to explain the author.",
        "source": "X29n0596_013:0456b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下是第四具述古今科屬之相狀即有二別先古後今初又有二先列述五家今謂以下次總結非起後正科屬也初中五家即有五別然五既並未當皆應辨述已非文中但明初後中三可例故略不言於後總結破之故也初家下出其名不知其人述非即有二別述中五譬一一皆須先點出譬文及對法說頌中之文準望後文亦自知所未暇也其所以但約譬者彼應具明但其所立譬名既非法義自懷故偏舉之則法譬但不當也後結明其過非既不爾故用也次瑤師中二先述其科法次述其會譬初中三意初標宗凡有以下是別其判始末以下後結歸宗初言四三只是三乘四法為對下故言四三也初中望於餘家仍有二意何者一者應別約釋迦而通約諸佛二者正應約頌而却從長行故是異於常也意者雖明諸佛同是顯實義故二者長行為本舉本則頌末其可知故以彼不明五佛及六義故次會譬者即明法譬相入故也不譬第三不得者也彼之意者蓋謂譬中文略故也餘義可知彼為極思於今未可在後自彰次述兩家大同少異初一但譬為名次五從法為稱初即今之總譬眾交如下經文長行偈頌所明是也餘五可知龍師數全同前名義小意其中有勝於前一者通勝謂譬法俱有義易會故二者別勝如初同是總譬而名義勝前故餘亦可知並未及悉而亦但為意解者所以總彰於後不欲繁文。",
        "translation": "Next, the fourth section describes the relative characteristics of the ancient and modern categories, which are twofold. First, there are the ancient and then the modern, and first there are two more. First, the five families are listed, which are hereinafter referred to as the following, and then there's the general conclusion that they don't arise after the correct category.",
        "source": "X29n0596_013:0456c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下是第五述光宅中有二初述其科屬有人以下次廣辨其非初中十文一一皆有三意一舉此頌文二明其文所明義三明為下譬作本文十中初二則言頌上餘以但約當文及以頌下其故然者以頌與長行有此兩意故也宜善思之於次辨其非中有二初述他人評其有四失然有無下次今仍之汎明於六義初四失者然評家但明其義失不言其失數今文述已結云四失諸釋皆以評家但有前之二義從又十以下並屬今文並屬今文辨其失也所言四者皆謂前後大小有無引文四也今觀此四失並屬他人所評恐未開今家之意故既述他評有四失矣對之方云今無此四若爾則九與六及次三又為四失後所盡其用文釋成前九句非為四失數也謂不然者三今又字無所從來若其爾者初是文義不應失亦名文義料判次是法譬參差失三是大小相違失四是索單有無失何者初既言句次既言義豈非之義謂若隨經文義只應為九為六不應為十故之文義不應失文既雙標亦應兩釋而但釋六不釋於九其義易見文又自彰於後故也初言有人者謂於其時仍有此達識之人也評者平也亦品量也謂以處中言義而品量之使其所為事得平正故自字從言音通平去義其一也言十九者辨其所應之數相也具如諸釋本文只有一句及釋有過半紙每見說者或能敘致或不能者多矣其能被者從自困苦終無所益非直無益更翻被損由來不然而以為然徒為後學勞弊故也既爾今亦不能更繁紙墨故不述然也此文義皎然而覺者鮮都由不尋經之文義故致如之若細尋經文其失自彰化人評之良以是矣又既雙標不應單釋其一又初多而次少不應釋少而略多又十九全是曲彰其義不名為句此最不可故十九之言其非信矣今謂本正應言應有九句剩於十字蓋以後傳寫之誤故也斯理在足明矣但積滯難拔更以類而顯之即如丹丘大經疏中初標六句及後却指於前乃云十八句正由亦以是矣時之學者曾不思其可不唯以十八之言求其定實竟生穿鑿醉懷經文專務會其言數不知都無其理豈直無益損亦已其每至於此衰不能已今此十九興彼十八勢數一也此既不覺彼就能如然此評之意者謂若且隨當文科節則正應為九品不應為十以其第五第六於經只是一科同為第五免難索車譬也不應離以為二但合此二為一即是九也若開為二雖有其名終無其義故復貴云不體文意都由於此一言蔽諸無勞詞貴非直此文十九簡其倍一亦乃疏十八三分省二如此簡省其可類乎非直自幸亦為後之學者幸矣九句略爾次六義者義謂道理謂若尅實論其理類使上下相通則只應為此之六不得為十故也言自餘攝入等者謂攝向之所明應以九中第七六五八四科同入六中第五還說一乘義中故也此人意謂於文於義正應如此若直為十於文於義並不相當故為文義不應失此言正謂文之與義必雙在而文須除一義須去三則為應既不然故不應也上評其文義之失已竟下是明其仍復更有三失而此三者由初一失即有此三若必以此為今家之義者恐文三今又字無所從來如前略已明矣正以前失之上更有此等三失故加之以又矣不然終不可會宜審詳之若爾前評之言應實於此固其宜矣何更於斯此三失文一一皆有標釋結斥初標言參差者前後不齊之皃也下釋即具出其相狀法譬尚已參差況復領解因緣而能齊等下釋出其相狀及結責之具如記中未暇委論次相違中亦標釋結標者謂其論於譬文互相違也釋中具出三相亦未及曲辨具記中次有無者即約法譬論索車之有無也釋中具出有無之所以在文可知後結斥者文雖兩行義只是一若開為兩二俱不成有言無旨此昧之其故云殊不體也何者初行言志求謂大機發次行言曾聞謂障除由障除方動動由障除合二方成一義故今合為一文若離為二二俱不成焉得為十因文次第故於此結以責之顯成前初不應之義況三文一一皆有標釋結責分明而獨以此為第四失豈有是理幸除體之勿還同於所責總結今無四者由其頓科為十致此四失今為三節科文上下通會故無四失又非直頓科為十招此四過復由十中立名不當故致多失今非真節數不同於彼立名亦多與彼不同故又無其四失應知四夫三由謂為十及名兼又不明總此致四恩之既彰今無自顯彼有非但有四五即有六以其第三相違失中自復有三故即有六且從類聚言其四也然其諸失義之狀但熟尋今復正料其失之理自形未暇具委於此宜知之也。",
        "translation": "The next is the fifth statement of the Guangzhai in which there are two first is to state that the subject belongs to someone and then to explain in detail the four errors in each of the ten texts of the junior high school. Each of the ten texts has three meanings: first, to cite this verse; second, to explain the meaning explained in the text; and third, to explain the reason for making this text for the next example.",
        "source": "X29n0596_013:0457a14_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次下是今對前四失汎明六義者因向他評光宅四失對之明此頌文更有六義是所應明而彼不明明其非其但四失六更有此六失也或曰對四明六豈有以乎此固不無而知窂矣何者以向明其四失具含於六故也以其第三大小相違失中自復有三故即成六故其四共即有六失故今對之明此頌文更有此六種所應明義彼更不言非直有前六失亦更有此六種失也此有二意一者彰其四即是六二者彰其非直前六亦更有此六失合之乃有十二種失故其不可今前結無其四失即是無其六也今更出此六義即是更有六得要而言之對其有十二失今有十二種得其十二失都由其三謂十名不辨今不一時為十名有不同又有此辨由於此三故無十二失而有十二得也直得此要文縱不釋亦已足矣於中差別有三初二直與長行對辨次二法譬對明後二非復前二直約頌文彰其功用深遠則前四論文體後二彰文用此義最好而知者希於中一一皆須出所以所未暇也又應知此六皆對前失顯此正義又明其前六皆有此六名義最初對其第四第二對其第一此二既爾餘可例之未及具委知之且初一中先標同五但長行下正釋有無然前後皆言有六今此但言五者此深有以前約別的語現在二乘故此文通通寄未來凡夫人故言具六約通說無故言無者且約別說各有意故釋五互者以此互文彰其必等文不繁而理自明盡其要矣次次第中且從略頌廣中亦先開也此亦互彰為後譬作本故也易知故不釋也次開合下兩意明經體如是為順經文勢故須爾也言四譬舊本多爾即時多故為三記云四誤正應為三今謂準譬云文四義三今此三文亦含四義並得作三稍將便易次後兩義意最深遠理並彰於前後可以準釋定為應四句總譬合而不開五濁開而不合捨用等物亦開亦合不虗非開非合次又更明為對光宅彰其四之所以今謂四句因固當但正為順經體豈為光宅明其所以是所不用言本迹者此章釋向第五總別之義不得此章第五難解總即體用本迹別即權實以體用通權實故也如前體用漸頓義同思之即是此二非久遠也於中有雙標別釋其一易知可尋此頌少許經文體勢宏遠若是今騰出之豈不盡美意既多含未遑委悉注(云云)者意且略爾也。",
        "translation": "Next, it's now generally explained that the four losses of Guangzhai have six more meanings in this verse that should be explained, but they don't explain that they're not just four losses, but also six losses.",
        "source": "X29n0596_013:0458a21_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上來別述舊來五家科屬及辨非竟今謂以下是次總結不起後必須正科屬也於中有二初明迹門所說之體要若作以下次總結破前來諸師科屬並乖於要實是故皆不用也初中有三先通標初門所說之宗旨前直以下次別明三周所說之要意前法說下例初顯後所說之體則初言今謂者前之所談猶是帶附此正的彰於己意故云今謂大意者大略要意也雖五佛六義三周不同尅要而言唯開顯而已故云爾也何以明之經之明此經開示等也以下別明三周之要意大要雖如向說仍以根性不等故法譬等別以法從人能隨於所故有此之意也以下例初顯中後者前為起後後為顯前稱為本者良由於此不得不約不然之勢既爾料屬顯意一須準則準不可輙意此意正明科屬之所由也下明諸師所說並乖如向經之體勢故不可用於中三句初總舉前五家所說次總彰其乖於要為不用之所由後總結其既然故並不用初言三者皆言略初五也今謂三即初兩家義瑤師所明其法四而譬但三初師雖為五譬奪其兩義不成與之亦但三矣故此言三即初兩家義矣六即次十二其可知下通彰其過失大要有二初句不與三周正說文合次明不與領解文會略舉中周前後例爾故通三也以此之故故不可用大要如此將別屬對有所未及付待他時。",
        "translation": "The above is a specific statement of the old fivefold doctrinal essentials and an explanation of what's not the end of the story, which is called the following summary of the correct doctrinal essentials that don't arise afterwards. There are two of them: first, there's a statement of the essence of the essentials taught by the first approach, which is summarized below, and second, there's a summary that refutes the fact that the doctrinal essentials taught by the previous teachers did not conform to the essentials; therefore, none of them are used.",
        "source": "X29n0596_013:0458c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上來第四章中初述舊科竟自下即是第五正自科屬於中應大為二今便為五初大約二以科屬若廣頌下次約四以科屬細汎更開以下三約十以科屬又一時下四更為三以科屬若承上下五總結束明前科屬之所以初約二者從向所明三周體例中起次為四者從初廣別中起次為十者從向廣別四章中起後更三者即通就前三開合以起皆有所以於後自明初中有三初總標其數二行以下次出其二名體今約以下三釋初總文義於次名相之中所以初名略總次名廣別者謂相待對之言也以對廣別故名總略六義且二故名為略具頌六義故名為廣又略是要義文簡而義備故是要也廣是備義文義二俱足故是廣備義總別有二義一是略廣之異名略廣之義即總別之義也二者總是通義別是異義通謂義通而文局異謂文義俱不同此且一往然此二義不得相離故合言之前釋六義中第五義及此後釋略頌下喻品中釋總喻三處具明於文自見不俟此繁於三別明總義本中有標釋結易見可尋以下第二為四義者即於向第二別中開出有標釋出狀最後總結於名相中於上有六為下有四在文可尋次下第三約為十者於向廣別四中開出文亦有標釋出名狀略不結也於釋出中即有十別於其十中一一皆有其三謂舉文明義為本也唯不虗中略不舉文亦並易見可尋以下第四又更大為三者此是大師說時又更為此一勢以復有此一義故也簡異於前故云又一此意正明略總廣別皆不虗故也以下是第五總結束明前三節科屬之所以也初具騰前三節明其所以後總結並為順經三說體勢故須有此三以科屬非無所以為趣爾也既有四節而言三者全云非通首未盛用故不論也(云云)然科此頌文四節初後則通中間二別唯於廣別文中出故今更依文而通融之初大為二疏文初節是也亦大為三疏文第四節是亦大為五如文總一別四是也亦大為七如文總一別六是也亦大為十一如文總一別十是也亦得大為十二總別各六是也直依疏數文極於此其中文有通局義則遍於三周不然不名周矣然文有三一是正文謂開顯等二是義文文顯於此意密於彼三者亦無義文但於正文而含其義此則唯論義也故疏前二皆言文義第三但言無文即明義不無故也此義亦要於後自見此前諸義綰涉處多大略且爾未及周悉知之。",
        "translation": "In the fourth chapter above, the first one describes the old text, and then from the next one is the fifth one, which correctly describes the subject matter in which there should be two major ones, and now it's five. The first one is about two in terms of subject matter, and if the verse is extensive, the next one is about four in terms of subject matter, and the following three are about ten in terms of subject matter.",
        "source": "X29n0596_013:0459a12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "前四章竟自下即是第五正釋頌文先釋略中長行無略說此頌中有者為欲與不譬作本故也必先實者正為下總作本明昔從實以施權故也初頌實中經文初一句總次三句別文釋先標具四一次正消文顯其四顯實必須有四故文雖窄而有四義次正消文初釋總次釋別以顯四初總中十四句初牒文次略釋次重顯後結示既云同諸佛之是何者是所同之是故重顯之謂同以等是也結示總者對次四別也次別中初安隱二字對理一先牒次釋復結釋中涅槃是安隱法秘藏是安隱義結是究竟所住之處佛自住等顯佛意復結此是無始本有天分故是理佛與眾生皆同非直同有正今同得故是一合而言之故云理一眾生即是有此一理之人故是人一種種與佛道俱是所行故屬行然佛道有通別行亦有通別也(云云)種種本為於佛道故即一上並所宣示此是能宣示故教所既並一能故不異故皆一也釋權中言權智者於佛皆是同體之權也此能知之總也眾生是所知也性欲即三教四悉之機雖略言十義實三方便說即應起施設權能被之權方謂五乘七方便也稱機即各得四悉之利益也總而言之但言觀喜。",
        "translation": "After the first four chapters, the following is the fifth correct explanation of the verse text. First, the explanation is brief, the long practice is not brief, and the verse contains a desire and a non-metaphor for the origin.",
        "source": "X29n0596_013:0459c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上消文竟二偈以下總以結歎兼顯略總之義初四字舉文次四字歎功能次四字出能事下八字結功能故稱下明二義何者一化之能事不出開顯此一而含二義謂但舉今開顯即具昔之施隱一化之事雖廣不出於此不然不盡故無始即初施張要終即復開會聲迦疋云空也謂始終無不盡也本或作源正應作無邇進之始也略是要也總是椀也言此頌義若是此略即總故是兼明於二義矣。",
        "translation": "After the above elimination of the text, the following two verses generally conclude and praise the meaning of both the summary and the manifestation of the summary. First, four words lift the text, followed by four words praise the function, followed by four words out of the able thing, followed by eight words conclude the function, so it is called the following to explain the two meanings.",
        "source": "X29n0596_013:0460a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋廣中有曰初標章次簡顯三科其六四消其文初可知舊以最下述簡不用顯今所用義如前後所明初曰以下正科出其六義科六義中初云頌上五濁開三者有本頌上五濁障開三今應謂不用開三二字次云施方便者有本云頌上為五濁故開三今謂此並不可對下顯實只應云頌上開三皆後傳寫誤。",
        "translation": "In the next explanation, it's explained that first, the title of the verse is delineated, then the three sections are briefly expressed, and the six or four sections are eliminated, the text of which can be understood at first from the following: the oldest is brief, the least expressed, and the meaning used today is as explained later.",
        "source": "X29n0596_013:0460a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初曰行下是曰隨科消釋於中有三初標起上文下次與長行對會此又為下三正科釋標起既但言五濁故前不應云開三又此偈文若望長行正當次第若於總頌中即與次乖次方開顯故次對會中先對會文不齊次對會意平等今觀此二文似不次第初文應在所見五濁文下安之次意應在後起大悲文中安之於此甚不次便或別有意宜審詳之初之三文至文更釋。",
        "translation": "First, it's called \"practice,\" and then it's called \"concomitant with the text.\" There are three ways of interpreting this, the first being to indicate the beginning of the verse, the second being to contrast with the long line, which is the next three correct ways of interpreting the indication.",
        "source": "X29n0596_013:0460a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次會意中初出兩異出世本下會通意明互舉意並同也(云云)次又為三下科三章者聖無不通故云能見能必有所故言所既見已同體弘濟故須應起初釋能中初通次消文次別釋疑初通有三初通明能所寂照能也群機所也下約頓漸以彰差別皆先所次能下總結會經文總前通別也言于時者即前通中所明也別釋疑中先疑問佛有五肉眼見障內亦麤色天眼見障外亦細色慧眼見空理法眼見一切佛眼則圓見今先舉二已次應云今是照機正應用法眼云何言佛眼此疑言說與義理乖故也釋中一明圓勝能兼具故次明四皆即佛故此即待絕兩義也釋此經始末皆言佛眼佛知見不言自餘意者並是向者第二絕待意也然佛眼以妙智為體意眼一切眾生皆同一妙智慧故始末皆言佛眼佛知見也(云云)之意略爾然諸經論或說五或說十五已如前十者華嚴云一是肉眼見一切色二是天眼見諸眾生死此生彼三是慧眼見諸眾生諸根差別四法眼見諸法真實之相五是佛眼見十方六道六是智眼分別了智一切種法七是明眼謂見一切諸佛光明八出生死眼見涅槃法九無礙眼見一切法無有障礙十是普眼謂見法界平等法門有人會云初一是前肉眼亦兼天眼能見麤細遠近是天眼故以次是前天眼三五六八九此六是前法眼亦屬天肉二眼第四法眼是前慧眼見其諦故第十普眼是前佛眼普見平等法界故彼所以如此會者意以經論多說五少說故會十歸五但是略廣異耳所以多說五者意謂為對人天二乘菩薩佛故又約所顯能者初二緣生也次三三諦也大略如此非此中意不在繁廣於次正頌所見濁中應知此法說中通義有十現文且三三者諸佛頌中釋迦長行偈頌三也然此三文非直經文不同疏釋義亦有異何者且經異者釋迦長行標列通別名數頌中二文但有其義並不標列又初釋尊長行有四謂數名體結釋諸佛頌中亦曰謂總明障大別明障三權說少以治濁終為說一令歸大今此釋尊頌中有三謂能所興悲又初釋尊長行有列名體狀諸佛頌中但約眾生以諸釋尊頌中唯約六道以辨此三經之不同也疏釋異者釋初直依法經釋其名體及諸門通料簡釋諸佛頌中初直約其義消其文已然後廣解眾生之義今此頌中即先約文明五義已然後廣解六道之義所以然者以三處文皆有眾生之言初二但言眾生第三則加六之以道初文則以通名當其五中別一次則約初其別通論其五後則通約六道以論五濁人前釋諸佛頌中廣解眾生未明六道今此頌中則廣解六道不復更言眾生此釋義之異也得此諸意乃可略會此文體勢不然不知以何明義疏前文文今但頌數名體三者次第所明何正應於此所見五濁文下安之全云經無唱數但有體相若兼而言之只可及其列名仍又不足現名唯有眾生與邪見故準此只應云今但頌名體二而云三者傳寫之誤故也今謂此中具有三義人自不見而謂文無良由不得向來所明經之與疏之意故致斯惑得則不至於是矣何者所見六道眾生即是總唱其數及以名也故前諸佛章中正以眾生為總明也故疏從貧窮下方名為眾生濁意正指初四字即總標名數明矣又共道眾生是人五濁是人上過患今言六道眾生即數名也下五直是別明其五體狀也不得誤通為別以眾生為其一數則與疏文不相應甚矣故只一言即兼數名總別二種五也故知依文但二約義兼三此是得文之精要信為妙達而謬謂不然者自是不達之甚之矣於釋此文有二初通釋五濁次別釋六道經約六道眾生以五濁五濁是文之宗主故先明之然方便消六道之文即却釋數之釋也又初約體相略釋次都就名數廣釋以六道眾生正是五濁之所依故也又六道總五也下是其別也先釋其別次釋其總也如此諸意可以思之初正釋五中初言眾生濁者眾生名通只為貧無福慧成也濁無福慧是貧窮之由也無福故貧無慧故窮以此故為濁障也只是一句但應牒已判為眾生濁而更言半行者後人誤以加也都有九字為簡上四字是總名數故以下一句別為其一後人不達此意便加半行不知其意又不知無體何者九字非半行並奪上見字乃成此言體則諸無所成縱以為半行何不從六道下牒文故知意如前又例下四唯煩惱向言一行餘並不言數故此只應牒已便即判之不應更言半行令諸義懷宜善思之命濁即眾生之壽命也生死險道有通有別即皆險惡道別即三惡四趣連持不絕故是命以險故是濁也煩惱濁亦是眾生之煩惱也深著即癡愛具五鈍使故是煩惱以深故是濁也劫濁亦是眾生過此時也不求佛法無感佛緣如此之時故是濁也言大勢者佛有十力四無畏十八不共也下文有大力勢也斷苦法即定慧也見濁亦眾生之牒解既云邪見具五利故即是見以深入故是濁合論故云見濁五勢即日中曰大耶過不識心道以此苦因而求樂果次重釋中諸即五見領納執著名為愛愛故有苦然愛有五謂苦槃捨憂喜今為深著故即苦受此是苦因還得苦果非能免因故不可得故大經云因果俱菩謂諸外道也。",
        "translation": "次會意中初出兩異出世本下會通意明互舉意並同也(云云)次又為三下科三章者聖無不通故云能見能必有所故言所既見已同體弘濟故須應起初釋能中初通次消文次別釋疑初通有三初通明能所寂照能也群機所也下約頓漸以彰差別皆先所次能下總結會經文總前通別也言于時者即前通中所明也別釋疑中先疑問佛有五肉眼見障內亦麤色天眼見障外亦細色慧眼見空理法眼見一切佛眼則圓見今先舉二已次應云今是照機正應用法眼云何言佛眼此疑言說與義理乖故也釋中一明圓勝能兼具故次明四皆即佛故此即待絕兩義也釋此經始末皆言佛眼佛知見不言自餘意者並是向者第二絕待意也然佛眼以妙智為體意眼一切眾生皆同一妙智慧故始末皆言佛眼佛知見也(云云)之意略爾然諸經論或說五或說十五已如前十者華嚴云一是肉眼見一切色二是天眼見諸眾生死此生彼三是慧眼見諸眾生諸根差別四法眼見諸法真實之相五是佛眼見十方六道六是智眼分別了智一切種法七是明眼謂見一切諸佛光明八出生死眼見涅槃法九無礙眼見一切法無有障礙十是普眼謂見法界平等法門有人會云初一是前肉眼亦兼天眼能見麤細遠近是天眼故以次是前天眼三五六八九此六是前法眼亦屬天肉二眼第四法眼是前慧眼見其諦故第十普眼是前佛眼普見平等法界故彼所以如此會者意以經論多說五少說故會十歸五但是略廣異耳所以多說五者意謂為對人天二乘菩薩佛故又約所顯能者初二緣生也次三三諦也大略如此非此中意不在繁廣於次正頌所見濁中應知此法說中通義有十現文且三三者諸佛頌中釋迦長行偈頌三也然此三文非直經文不同疏釋義亦有異何者且經異者釋迦長行標列通別名數頌中二文但有其義並不標列又初釋尊長行有四謂數名體結釋諸佛頌中亦曰謂總明障大別明障三權說少以治濁終為說一令歸大今此釋尊頌中有三謂能所興悲又初釋尊長行有列名體狀諸佛頌中但約眾生以諸釋尊頌中唯約六道以辨此三經之不同也疏釋異者釋初直依法經釋其名體及諸門通料簡釋諸佛頌中初直約其義消其文已然後廣解眾生之義今此頌中即先約文明五義已然後廣解六道之義所以然者以三處文皆有眾生之言初二但言眾生第三則加六之以道初文則以通名當其五中別一次則約初其別通論其五後則通約六道以論五濁人前釋諸佛頌中廣解眾生未明六道今此頌中則廣解六道不復更言眾生此釋義之異也得此諸意乃可略會此文體勢不然不知以何明義疏前文文今但頌數名體三者次第所明何正應於此所見五濁文下安之全云經無唱數但有體相若兼而言之只可及其列名仍又不足現名唯有眾生與邪見故準此只應云今但頌名體二而云三者傳寫之誤故也今謂此中具有三義人自不見而謂文無良由不得向來所明經之與疏之意故致斯惑得則不至於是矣何者所見六道眾生即是總唱其數及以名也故前諸佛章中正以眾生為總明也故疏從貧窮下方名為眾生濁意正指初四字即總標名數明矣又共道眾生是人五濁是人上過患今言六道眾生即數名也下五直是別明其五體狀也不得誤通為別以眾生為其一數則與疏文不相應甚矣故只一言即兼數名總別二種五也故知依文但二約義兼三此是得文之精要信為妙達而謬謂不然者自是不達之甚之矣於釋此文有二初通釋五濁次別釋六道經約六道眾生以五濁五濁是文之宗主故先明之然方便消六道之文即却釋數之釋也又初約體相略釋次都就名數廣釋以六道眾生正是五濁之所依故也又六道總五也下是其別也先釋其別次釋其總也如此諸意可以思之初正釋五中初言眾生濁者眾生名通只為貧無福慧成也濁無福慧是貧窮之由也無福故貧無慧故窮以此故為濁障也只是一句但應牒已判為眾生濁而更言半行者後人誤以加也都有九字為簡上四字是總名數故以下一句別為其一後人不達此意便加半行不知其意又不知無體何者九字非半行並奪上見字乃成此言體則諸無所成縱以為半行何不從六道下牒文故知意如前又例下四唯煩惱向言一行餘並不言數故此只應牒已便即判之不應更言半行令諸義懷宜善思之命濁即眾生之壽命也生死險道有通有別即皆險惡道別即三惡四趣連持不絕故是命以險故是濁也煩惱濁亦是眾生之煩惱也深著即癡愛具五鈍使故是煩惱以深故是濁也劫濁亦是眾生過此時也不求佛法無感佛緣如此之時故是濁也言大勢者佛有十力四無畏十八不共也下文有大力勢也斷苦法即定慧也見濁亦眾生之牒解既云邪見具五利故即是見以深入故是濁合論故云見濁五勢即日中曰大耶過不識心道以此苦因而求樂果次重釋中諸即五見領納執著名為愛愛故有苦然愛有五謂苦槃捨憂喜今為深著故即苦受此是苦因還得苦果非能免因故不可得故大經云因果俱菩謂諸外道也。",
        "source": "X29n0596_013:0460b01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上釋五濁竟普曜以下是次釋六道也所以更却釋者以義應故雖通別雙舉前已釋其通竟今但解其別也文雖稍廣義要有五初明六道因緣是約因釋又云以下次明六道果報是果約報釋次翻名釋義三約名義釋阿含以下四明其行是約要行釋亦是對所以顯能前是以下五是總結前四以顯二要初中有二初經說次明論異初中有二初明五道因果次三乘因果應是相從而來亦互相顯亦明世出世開皆從因緣生也初中先舉果徵因言五道者五六趣道大同小異當會釋之(云云)前及此文明六下文或五或六餘經亦爾於後自會道之與趣雖有通別今既舉因已徵因宜從果也源來者因也既有果必有因故舉果以徵因謂從何因緣而來至於五處果也或云五道即因今謂原來方是因也下釋出之如文此皆果因相當也下是次明無此世間五趣因果即是出世三乘因果五是能障三是能治既並緣生故可治滅(云云)亦是舉無以顯有也言五趣者還是五道但通能所前對因道即是果此對果趣應在因五陰果也六衰通於能所能即六塵所即六根既即舉十二界在其中即無三界生死因果故即涅槃次即志求作佛故即得佛果記此亦通於權實(云云)下明論中說異先舉論說次結明前明十惡為地獄因此但明一故是異也若欲會者前明十者通舉其中一一皆是故此更別顯前之意也又明一惡即具於十乃具一切不但十也故皆是因一趣既爾餘趣例然略舉其一餘可準知。",
        "translation": "Although the text is slightly broader, there are five essentials. First, it shows that the causes and conditions of the six paths are interpreted according to the causes, and then it follows that the next explanation of the effects of the six paths is interpreted according to the effects, followed by an interpretation of the names, and then an interpretation of the meanings, followed by an interpretation of the names, followed by an interpretation of the four following Āgamas, which shows that the practices are interpreted according to the essentials, and the interpretation of the practices is also an explanation of the two essentials, so that the first four are summarized below.",
        "source": "X29n0596_013:0461b17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次約果報釋者此復有二一明果報用次明果地性用言又云者應猶是前論釋故也初總標云自爾謂任運而能非使之然故云爾也實猶前因所致直就現果不言往因故云自爾不然便同無因非佛宗旨下次釋出即有五別鬼非直來亦能種種變化人中三事有標釋言人中有如此類非謂盡然言解脫即涅槃也此名則通達分即別記云所脩善根不住生死名為達分得正決定即初果也天中自然如次廣釋故略但注(云云)上是業用竟下明報地性用者報地雖別性中而各互具然並體中功能故是性用文有三句初明最下具上四因果次明最上具下四因果三結上下例明中間皆爾一一皆具三道略言只是因果在文分明既言不現行故是性中種子具足有也小乘不言種子如何此論既作是說亦是諸部不同不可一向然應通於三界而但言欲界者只應是略或別有意此二文前釋不思議中略引已此是小教所明尚爾況復大教正由此性故可修致如此難思豈不信修思之思之。",
        "translation": "The next explanation is that there are two further explanations, one that describes the function of the retribution, the second that describes the function of the nature of the fruit ground, and the second one is that it should still be explained in the previous discussion. The first one is a general statement that the term \"self-reward\" refers to the ability to act freely and not to cause, so it's called \"self-reward\"; the second one is really like the previous cause that results directly from the present and doesn't speak of past causes, so it's called \"self-reward\"; otherwise, it's the same as no cause and not the Buddha's purpose. The next explanation is that there are five distinct ghosts that don't come directly and can undergo various transformations, and the three things in humans are explained with a general statement that such kinds of things in humans aren't meant to be exhausted, but they are said to be liberated, which is nirvāṇa.",
        "source": "X29n0596_013:0461c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次下第三釋名義也前但約五人此一科具釋其六乃是正消經文六道之言也初地獄中先翻名釋義次簡非實數三簡是非四明可不初翻釋中泥梨新云那落迦亦捺落迦亦阿鼻上二名翻釋稍別略如上文若阿鼻者此云無間有五如別(云云)亦無有等文中所釋雖廣更須和會未及也言早下者眾生界中最下劣故言隨落者中陰以下總是釋其義也此言人中生彼之形狀也言無赦者捨也自業所致無能放捨故也次非實數者亦自業感見如是事次簡是非者此就形也初則猶是人形及受苦非復人形類也如此解者全云此四字甚無意旨應傳寫之剩今謂上是辨形聞是辨謂如此罪人言語有可解不可解者釋云初未受罪之時言語皆正可解若當受罪苦之時即不可復解故也可知標中稍脫略此乃不足何謂為剩次釋畜生即此方言出梵名文有三釋皆諸經論中有初言畜生者義取畜養之義類如此方六畜之義此局未盡而以二旁釋者旁非畜義其與名相稱此是舊譯不功故也新云旁生正二旁義相應也行字呼平通去其義可知釋次義中有標有釋有簡顯實化第三義中亦有標釋辨其初後同異言聖語者聖者正也皆能同人間正言語也後因而不能也鬼言闍梨哆者梵言薜茘哆恐本是閇後學誤為闍此云餓鬼然鬼名則通有多別類具如施食經中有三十餘部(云云)今言祖父者舊所譯也次釋義初通次別初為祖文者祖者始也初為後者祖宗後從於初亦受此名例如此方高曾等也若此方者天曰神地曰祇人死曰鬼鬼者歸也從虗無氣上來却歸其處故也從又以下即釋別也以餓簡別餘故也以二因緣故名餓鬼故食經中廣辨其狀未及具述也次釋人中初翻為意釋有三義在文可知初云頂生即金輪王十善化世故三皆云善也若依此方人者忍也能安於道忍耐於情故名為人次釋修羅此應在前何故於此或是趣爾或經論中有此次第或其一分屬天趣攝故也新云阿素落文中翻釋三義言非天者形行皆異於天故也其三義中初言非次言不後言無皆是阿字之義短聲呼也亦如上文已釋天者梵言提嚩(房可反)此翻為天文中所釋稍似難見準義體勢應先雙標謂天者天然自然之義亦名為勝義文脫亦名字樂勝以下釋先以二事釋勝義謂樂身即心身也眾事以下總結心身一切眾事皆勝餘趣故名為勝常以以下次釋自然謂常在有自然光明照曜故名天然從又以下一字恐後傳剩誤應不用也。",
        "translation": "Next, the third explanation of the meaning of the names, which was previously limited to five people, is explained in detail in this section, the six of which are the words of the six destinies in the sutra of correct elimination. First, in hell, the first explanation of the meaning of the names, second, simple and insubstantial, third, simple and false, and fourth, clear and unintelligible.",
        "source": "X29n0596_013:0462a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上釋六道名義已竟下是第四約要行釋初通明六趣心行次別明心行三雙結勸修初雙標假實亦名人法也上既言假名下故是實實法法即色心也而言界者色心差別不同即所依之境也或既蘊處界之義也五趣下明假實和合故得總名為眾生即心行與法合也若眾生下別顯五趣差別之稱仍有四句不善心境亦因果即三惡趣也次句善心行為因感果即人天也次二句者全云勝即人天鄙即餘趣也今謂前善惡二句六趣已盡今更以此二句言之何為固不然矣今謂趣超出三界有漏與無漏界俱鄙心即前善惡有漏窒塞非道故名為鄙鄙亦耻也總結勸者種種界不出善不善出世間也善達如是界以修善除不善修出世除世間此義盡矣不同諸釋可以思之。",
        "translation": "After the above explanation of the names of the six destinies is completed, the fourth explanation of the essential practices is the first one that explains the mental practices of the six destinies in general and the second one that explains the mental practices of the three pairs of encouragements in particular. The first one is a double label that describes the nominal and real, which are also known as the celebrity factors.",
        "source": "X29n0596_013:0462c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下是第五總結彰前所釋要是二義前因緣者指前三段也次言似者且是經中約心以言不同尋常訖前事以明觀故云似也記云前因緣中亦可具有四意五道不同即世界人是所為惡是所破天即第一義後似觀者從心判義義當觀心今謂前長行五濁為三悉所治然後說第一義今此既頌前為四亦難會以能所俱不成故又前諸佛頌五濁中四文即當四義亦以前三是障是治是三悉第四為實第一義也今此文前大科有四義初總明因緣兼舉出世顯於世間即世界次明二用況顯深可信慕即為人次辨名義六趣差別有為有漏深可厭患即對治此三並是所除第四令善觀察善以不善達於勝鄙去鄙從勝證第一義即四竟矣前來總有三處皆約權實合論四意今此一往從權通說四意若以義權亦全通實何者初中既明五道三乘及成佛因緣即十界義也次約二用明不思議即可以況顯大乘十界義也次明六道名義既爾況餘四聖名義難思第四既言善不善勝鄙種種諸界任自通於十界故最初於五三後仍明三乘正以通顯之義明矣故前三處皆約權實合明四意今此寄於權四通明實之四矣前三初一即前二智長行文未釋不思議也前三世間三義第四結況第一義也此文異於尋常正以結撮於前三故有斯異此意深遠宜善思之不得還作尋常知見且略如是未及周備次起悲心即除濁也言能所見者起悲之由也勳是擊發義悲是能發心等即所發也文具三業施設等義雖通三對前二故別當語業今昔開閇一化始終咸在其中標取次文成此中義如此之釋不可更有。",
        "translation": "The following is the fifth summary that highlights the two meanings of the previously explained. The former cause and conditions refers to the previous three paragraphs.",
        "source": "X29n0596_013:0462c22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次言頌施方便者從昔為名此正是開但敘昔施即是今之開也常須此意勿失宗也次明初文又三者文雖二義要唯二義謂初正也次二是息化之由正也言大者即今妙也初即擬此妙也然者大事而出故也言擬宜者即下文云方宜救濟也下正依此義而言今從彼文以立此名必以此者同體法爾諸佛皆故慎本誓願故以無此機故息也此初擬宜之文疏釋稍廣尋聽說釋竟不知說釋何義於經於疏並未能會良以無其宗主故也今先依疏科自以會經次會疏文之所釋初者經初一句即擬宜時處次一行一句即正明擬宜於此正中復二初一句總次一行別約科自入經略爾次就疏文者初是釋時處從感樹恩下是釋正中總擬宜過去因果下是釋正中別所擬宜初釋時處即有二別初釋時事釋者下次釋處初時即釋始之一字初簡理事亦簡自顯他至理如空非三世攝何有其時約事修得故有其時性既無方脩得亦何有定就化他邊故有其時此並約無論有不思議時也為化下結明今意正言化物最初之時故言始也為者施也起也從體起用施為化物大有五時今語其初故云爾也此即為物示成時也。",
        "translation": "Second, the verse says \"giving skillfully\" because it was named from the past and this is the beginning, but the narrative of giving in the past is the beginning of the present, and it's always necessary to have this in mind so as not to lose the thesis. Second, there are three more explanations of the initial text, even though the text has two meanings, the first is correct, and the second is the reason for the correctness of the transformation.",
        "source": "X29n0596_013:0463b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下釋其處即道場也於中有場有樹二俱是處故也言事解者對次觀行約所求法以釋故言事也道即佛知見也脩治即是能得之方謂脩開示悟入之行也得即是正約開示悟入至極也並依於此處得道之場故云道場廣如淨名流中所釋未能具敘可以意道樹者此處有樹處在樹下此樹屬處又對次二能故先合釋二所也並所從能依從於正世後於道為名故也就事以論此處及樹並廣如西域記此未能具知之應知時處通於權實今既以大擬宜故須實即是妙時處也。",
        "translation": "The following is an explanation of the place, which is the site of the path, where there's a site and a tree, both of which are places, and which speak of the understanding of substances, which are interpreted in terms of the secondary practice of contemplating the sought-after principle, and which are substances, the path, which is the Buddha's knowledge and views, and which are purified, which is the way to attain, which is to purify, reveal, and practice of awakening and attain, which is to correctly approximate, reveal, and attain the ultimate level of awakening and also rely on this place to attain the site of the path, so it's called the site of the path that's as extensive as the explanation in the stream of pure names that can't be fully described as meaning the tree of the path.",
        "source": "X29n0596_013:0463b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上時處竟下是釋其正中之初總也文含能所為向已釋其二所竟下直釋其二能謂觀與經行也於中初承向文勢且約事解次約所表釋初中先別釋觀行次合明其意且經意者前表自證於體故言坐此明從體起用利他故言觀行樹有覆蔽之恩地有安止之德並是得道之勝緣故須觀念意在何之道成以下是其意也道成由之將報復也賽即酬報澤即上之恩如何報復欲以以下是也。",
        "translation": "After the above time and place is completed, the following is the first general explanation of its correct middle, the text contains the subject and the object of the explanation to the end of the explanation of the two subjects, and the direct explanation of the two subjects, which are contemplation and sūtra practice.",
        "source": "X29n0596_013:0463c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次約所表釋者雖言觀心正意在表內法故也然向對兩所直釋二能今此通約能所釋也於中有三初釋觀樹次釋經行後合明其三七二意也初中先樹次觀初言樹者即表於此樹也此所以名樹者以有華果無窮故也婆沙云過去二支為根現在五支為質現在三支為華未來二支為果有華有果謂凡夫無華有果謂學人無華無果謂無餘有云義推少華有果謂學人無華有果謂有餘此藏通義耳寶性論云緣相生壞四事俱無方名求緣為根相為質生為華壞為果即界外二種十二因緣謂別圓義今謂如此之樹遍法界亘三世非直為大又極高矣此表所觀境也深觀等者正明觀也以妙觀智窮理盡性而觀故云深也一一緣起莫非三諦境觀宜極成菩提也又十二因緣即是三道觀三道即三德三身菩提之大樹也此三菩提樹體德橫竪周遍一切為高大矣欲以以下總明觀樹所表之意謂表自觀緣起大樹成無上菩提大樹將以被益一切同致故云觀也次釋經行事雖有別表意不殊前初釋表意復更釋成初中言經行者往來之義如世織經之狀故云也廣釋經行處及利益義非此中之意幸勿相效此含三義能行法所行地總此之意修行道法備在七科故佛遺囑念處修道略語一要而言之不過定慧故云定慧莊嚴以自他也此表自他之法自以以下正顯其意正表自得利物故云爾也地是所履即實相也遍一切處故云一切地也前自證體故言坐以表利用故言起行辨此法相故如止觀及記廣釋下釋成者初後疑問以無情故故無分別既無施恩何有於報下引經答釋中彼經即諸天從野干聞法將修上味以報供養以其報劣非當天食故所不受諸天愧謝無以報恩其之但能流傳向所說法普益一切非直報我亦即是報一切諸佛之恩今此所言表意亦爾表自利他下化上報並於一切既普一切樹地之功莫不彰顯方其爾矣即是成前也。",
        "translation": "Although it's said that the correct intention of the mind of contemplation is to express the inner Dharma, this is a direct interpretation of the two capabilities in regard to both. There are three interpretations, the first of which is to explain the contemplation tree, the second is to explain the sūtra practice, and the second is to explain the three and seven meanings of the tree together. The first is to explain the tree, the second is to contemplate the tree, which is called the tree because there are flowers and fruits that know no limit.",
        "source": "X29n0596_013:0463c17_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次過去下是三釋於正擬宜中次別意也前明觀行總表以大擬宜今言三七即表三周等說故是別也於中又有三初沉引餘經所說次小雲疏下次此方舊解三七日以下是三正釋也且初經言三七日者祥云此明思惟時也經論不同或言過七日說即彌沙塞律及十地論律云三昧七日論云本為利他成道何故七日思惟不說答云顯示自受大法樂故為令眾生於如來所增長愛敬心故(云云)此則初七不說此明過三方說律及薩婆多傳過六七四十二日方說興起行經過七七方說十二由經成道竟第二年方度五人則一年不說智論五十七日不說或可只是五十七日或是五十箇七日計近一年與十二由經相應適緣見聞不須和會薩婆多論云何故六七四十二日不說一者梵天未來請故又陳如等善根未熟故又前自安身然後始說故又令眾生生尊重故今明如來久知應不說但為示法深妙眾生鈍根隨從世法故爾三思而後言可七日是數之窮三思是俗中之常法故有三七之言也七是一數之窮者內外七日改異胎內七日即變斷食之人七日不食便死此前經論及人師異說如是今此直列此一經者數問義近故但引也於中有二初明三思之所以即思機理也初一理次二機通別也彼經若小唯約漸論即鹿苑初若是大乘即通頓漸之首即至以下次明通三說法即漸初也文亦有三義初化五人兼明得益次結成三寶義兼三也初中兩說兩得益所為五人之名全云摩男及跋提之異名不合再舉傳寫之誤今謂若準前文所列此文則誤而嘉祥此中所列五人名同於此則前文乃誤或可經論所出不同隨而引之宜知之也婆娑云陳如得初果四人得四善根至夏初方得道經云未得者謂初道果非不得四善也然有八萬天子得道是何天者正法念云是炎摩天子也智度論云八萬天子得無生忍餘經云得法眼淨此云何者釋云小乘法眼淨即小乘無生忍也今大師依智論意即大乘無生忍密教之意也如別文釋。",
        "translation": "Next, in the past, there were three interpretations that were appropriate in the correct preparation, followed by a specific meaning. The previous statement was a general statement of contemplation and practice that was appropriate in the context of the greater preparation.",
        "source": "X29n0596_013:0464b02_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上沉引餘經釋竟次下是述此方人師舊釋於中有三先述舊次明大師意三因釋諸義先述此師意明初時即是說法華經有標結初標意者一者當文二者準後所說當文者經云思惟如是事微妙最第一故三七思惟即是為三根說也何以知其然者更引下文以證釋也以樹處皆同故也結同可知下會今方言說之意何故今於此處方說妙法釋之如文今既為鈍前却即為利也利鈍時處不同說妙則是同也下明大師意者有同不同非一向也同謂佛慧不同開會也彼知其一未知其二但得迹門一分迹門且未全得豈能知本故是未知其二類昔以顯今同今例今以顯昔有同異文有釋例證結可知次五比丘下是雜釋諸義於中可大有二初釋先度五人次兩問答釋轉法輪此文假不次第全云初至尼吒應移於後釋五比丘文下從初轉法輪至三處決定應移於後釋轉法輪文下今謂亦可從問答下便屬釋轉法輪文也思之準理次第從初至尼吒此並合在前陳如章中次第安之後明四處方可於後若總於後義亦通也初明先度五人五人之名如前今正明先度之所以以本願故上陳如中已述其三一是佛二是其自今又是一別各有二四願因緣故也記云惡生王即哥利王也餘四應其眷屬也言比丘者聞法破惡竟方受此名從初但是五人今從後說言比丘也。",
        "translation": "After the above explanation of the sūtras, the next step is to explain the old explanation of the teacher in this direction. There are three things in this explanation: first, the old explanation; second, the explanation of the great teacher's intention; third, the explanation of the various meanings due to the explanation of the teacher's intention; first, the explanation of the teacher's intention that the first time was when he taught the Lotus Sutra; first, the standard conclusion; second, the standard conclusion; third, the standard conclusion; and third, the standard conclusion that the sūtras say that contemplating such things is the most subtle and most first, so the three or seven contemplations are for the three faculties.",
        "source": "X29n0596_013:0464c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是下釋轉法輪之義有三初明先為人之所以輪王出下次明受益聲聞不同之所以初輪以下後明處所有定不定初問意者轉輪即是說法既言初為五人說法即是初為其轉法輪然應普為一切何故但言為人雖舉其五義已如前今正論其人五乃相從來可所以知者以答故知然也答有六義蓋經論之所出也雖有四悉之義而不次第初是勝義次二為人次一隨順世間即世界後二明人勝天即對治也時有諸天得道豈非見諦從人中得即釋此疑非直從人亦因人得以此六四之因緣故先為人次釋初受化者得益聲聞遠近不同之所以也問中初舉三不同次問其所以聲至梵天如前所說首陀會者有云色究竟天人論第二云第四禪天也此亦經論之說也答中初答前三若依以下廣顯佛義此二亦即因緣約教釋也初因緣中初是世界輪王下為人陳如對治佛最勝義記云善業輪王因名譽業陳如因稱讚業佛因今謂此對雖消得三人上中下言猶未能散若云可通者善謂十善也名舉持戒也稱讚供養報恩也父母世間師長通世出行此三業皆有上中下下即輪王中即陳如上即佛以此故得道聲聞其異若是此並且是世間因緣故是世界意也若使下釋疑云佛王三界其聲應至有頂何故但言色界故釋之云爾以有顯無可知大經臨涅槃時出大音聲其聲遍滿乃至有頂丹丘釋云遍滿有頂即聲之橫竪也若三有之頂即非想是也彼至此不至者此就小說彼約極教故有斯異次約教中則不爾也別明三義皆約所表也明有四意故注(云云)次下廣復一義即當約教意指向義即當初教次加百億故當共教次即當後二也此且通談若論今經唯一圓遍復彰有此意故注(云云)次明處者處通四別此中正論轉車別更緣處義通餘三相從而來樹處即成道處也天下具如造像功德經中大神變有通別今簡通顯別故言大即降魔制外事也轉法輪處有通有別簡通不定顯別則定故云初也頓初即場中漸初即鹿苑也下三處皆在摩伽陀國具如大經所說餘處不定即四之外也又言除者除別顯餘一化通記也準大經明說涅槃處亦定應云除初後處又準大經涅槃處亦定則應五處而但言四當時經論猶略故也有引毗婆沙云有五處定謂生處出家處成道處說法處滅度處三世諸佛常於此處說法故云處定何以知處定佛未出世有輪王將丘眾欲從此道過而丘眾即住不行空中云此是古佛說法處王須避之故知處定今謂此五與今對論同異有三一者正應合有此五故文殊問經云生處得道處轉法輪涅槃處二者彼此互無彼無此二此無彼三三者互不了彼三是大要此無故不了此二至勝要彼無亦不了又於說法中彼不言不定是彼有未了此中但言初而不兼言復是此所未了所以然者此葢聖教不同互說如是今總會之彼須更此二此須更彼三彼此各有七仍說法一事不定其餘則常定爾乃方了矣(云云)。",
        "translation": "The first is to explain that the turning of the wheel of the Dharma has three meanings. The first is to explain that the first is a person, the reason why the wheel king comes forth, the next is to explain that the śrāvakas are different, the reason why the first wheel is different, the second is to explain that the first place where there are certainties and uncertainties. The first question is about the meaning of the turning of the wheel, which is to say that the first time five people are taught, which is the first time the wheel is turned for them.",
        "source": "X29n0596_013:0465a13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下是第三正釋於中有三先述舊解次明未當後正釋也初有兩家有兩釋並約此經之意即表思大乘理教行三也次者記云即譬及信解大乘二門各有擬宜無機息化用對此三亦應可爾今準嘉祥述舊又云初七以勸門說大乘不得二七以誡門說大乘不得三七以誡勸令得說不也正應如此以古人不立擬宜等三名故也次師者初通明意次別消文三引文證謂至極大事不可造次一表妙化之方所二以誡勸未至之人故有二至之言七思惟正表此三舉證次第證此三也次下明其非者雙破兩家先明正道理復責其釋乖此故未可也以其皆作定釋故此責之也覽亦作鑒二義俱通作鑒雅矣爾疋云淹留久也次正釋中有二初總明意次別消文初有標釋即寄言以表意非謂適實爾也然說此經必是開顯初未施隱何所開顯此乃談佛出世之本懷故二者物性元來具十界故設初便作是說即開顯矣何有不可正在寄後以明初意了次別釋中初約教次約觀初中初直約此經三周次結前是圓復起後三教釋初中即是圓教因緣釋初中先明三周擬宜次標取無機息化施小以釋成可知次既約教此當因緣亦應有四意諸釋雖不言而四義不無今輙言無者初通明意義既總於三即當世界法說直顯理即當第一義譬說託事引諸子義即當為人因緣說長遠治其多懈怠即是對治意或嫌非常途當觀五重前四次次結前標後既此經三周故即是圓教乃絕偏之圓矣下正約教者教門既有四別擬既不得通擬亦未得然後方說三此並約文自會意皆雅合斯妙達矣或曰三表於三義有可領而言七復言日此何所表然七是彼方要數之一如聖教中或言一七三七七七皆多言之隨順世間故言之也即表大乘入道之要謂道品七科法也於一一說中皆令入此七科法門故言七日者表智七科名菩提分菩提覺也七是顯覺智之支分故皆以日表之又日表知見因七而得開示悟入佛之知見故以表之如此釋於文若別若通皆會無所違也此義古今不言今意略爾(云云)或曰以大擬宜無機息化此正是所思惟事經文自分明義又易會何須異釋若爾此但通意何關今經又尚不得說法豈會三周何者既不得已施小只是通途大乘故不關此雖言三義不知是何等三與而言之雖似法說而棄餘二周脫而言之亦非法說以不言法故法且不得況下二周故非此經之意既非此意用言於此何為故不可也次約觀者教之要旨也中明四觀即四教之觀行也於前三中一一皆有擬宜無機息化三義第四對前無三不得即顯有三得也次無機中言障重者經云著癡淨名云從癡有受則我病生此即五濁故言障重次不堪聞者障重根鈍不能信受故不堪聞知無機故不說者說即發其機也既障重根鈍是無可發故雖請而不說也今謂此文稍似難見何者既云雖請知無而不說經但有請而無知無不說之文若會此科更須進取次息化初文乃可只由無機故息化也或有兩向全云聞而致損只是無機但入無機段中於義甚便更宜思之此三通明無機之義次息化中二者初非直無益而有大損次息雖不有益且無大損此蓋明如來大功方便妙能之事也次正施權四章即翻前明有機而致利也初文既云尋念復言亦應故是擬宜結初二句念諸權化下二句念允同之意文中初釋念方便尋者隨續也何故續前之後便言尋念文應故釋之云爾次釋念諸佛意何不施念已方施如假從來不知施三之事因念方知故釋云爾非是不知為顯道同令易生信故也文應作允而作引者恐傳寫誤允者順也釋佛現之由有二即擬宜中二義是也言慰喻者上同諸佛下愍群生隱實施權屈曲勞謙是以慰也慰者安也苦心為物故須慰也喻者勸也明其理以相勸勉也並順世問也。",
        "translation": "The next is the third correct interpretation in which there are three first, the statement of the old interpretation, the next clarifies the inappropriate correct interpretation. First, there are two interpretations and the meaning of this sūtra, which is to express the three principles, teachings, and practices of the Mahāyāna, and second, the statement that the two approaches of metaphor and belief in the Mahāyāna each have an intention to be appropriate, inorganic calming, and transformative uses, and these three should also be acceptable.",
        "source": "X29n0596_013:0465c16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次正歎者一行一句全是諸佛難之詞也初二句歎也下三句釋上之義也善謂善巧能之極也下句歎利用中最勝也文釋初義能隱而能施之極也次釋下句施而能開是師之最勝也次釋下三句且顯上一義初句明自得實也下推能利他即釋初善能能隱實而用搖也次第一義寄在後釋下明詣佛道同也次雙釋者經文上二句但明隱之由而不結明陰下二句但結以明施而不明其由疏文各具出其二此釋之能矣宜其如知之言雙結者結明隱實施權之意也前釋第一導師之義現於是矣應知此前除初兩句一向是歎餘並兼是勸也次言酬順者諸佛讚勸也對答於讚故言酬敬從所勸故言順釋南無為敬從正明順勸之意也祥云南無歸命也救我也歸命者以命歸投十方佛也諸佛獎勸說於三乘則近眾生慧命便是近釋迦命是故釋迦以命歸投諸佛諸佛勸說三乘既是救濟眾生即是救濟釋迦故稱救我今謂若以義釋亦何不可要是迂迴古人既云敬從言義雅便今直從之不須曲會初言酬中初二句酬也後二句順也聖者正也通也圓通正道自在無畏故云聖師子此即醐前善哉釋迦文也能以善巧施設終令歸圓妙故言深淨微妙音此即酬前第一之導師歎也下一句順從即順前得是第一法以下所勸文也此初一行文唯三句意只是二謂酬順也即此三句二意答前勸大要盡矣次言念順物機即別順前少智樂小法一行文也前明諸佛自得實法為順權機隱實施權今亦順同彼意故云念順物機矣如此所釋善美盡矣。",
        "translation": "The second correct praise is a line of words that are all difficult for the buddhas. The first two lines are praises, and the next three lines explain the meaning of the above, which is good, meaning the ultimate in skillfulness, and the next line praises the most excellent of all uses.",
        "source": "X29n0596_013:0466c09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "下正施化者既有其機當以其教而發起之故云也經初二句明處時言是事者即念同諸佛順物機緣思思已決之時也次句處此云鹿林昔有王以林故鹿故亦云施鹿林亦云鹿苑亦云仙人國昔有仙人在此住故新云波羅痆斯此云江繞城然有通別別謂鹿林是其國中之一處經文從通說處則別古人以別翻義通有未了應知頓初即是道場漸初即在於此今正論漸也下一行正說教初一句明理實不可說次二句明就事方便而有說此亦如大經曰俱不可說以因緣故說疏文三翻以釋此文初番尅體別論次番約權實通論三番又全別約權之事理初中先牒已且出其體釋已如前此即釋諸法寂滅相也此理非下牒上義以明不可說之所以正釋不可以言宣也正以寂滅無形無名故非數非說此即自所修得一實妙體也今以等者對三機感而作三說此即有因緣故作三數說此是自他亦是約義也下是約文又是約別義也文者文云寂滅寂滅即是不生不滅此即不可以言宣以有生滅因緣故即方便作生滅說上對三教故是通此局在初故云別文云為五比丘故須為此別釋次第三番更局專於向生滅中論可不可也真理即真諦理也非示者無四也非說者不可作說也此亦即寂滅相也即不可言宣也故大集云第一義諦無聲字陳如比丘聞悟道正此義也亦以有此因緣故得有四與說又初約圓對偏釋次以衍對藏釋三專約三藏事理釋正有此義故也言無常有門者無常等四初治四例故是有門諸文皆云初說四諦而云無常等耶此不相違無常是苦下四行略言一四餘之三四例知則一一門皆有四諦若言四諦語其總相若言四行語其別相二不相離總別可知五比丘義並前始見前釋之文正應於此文下安之。",
        "translation": "The next one is about giving and transforming people who have their own abilities and should be motivated by their own teachings, so it's called. The first two phrases of the sutra clarify the place and time when they say this is the matter, that is, when they are mindful of the same buddhas' ability to conform to things and the conditions when they have made up their minds. The next phrase is about the place, which is called Deer Park.",
        "source": "X29n0596_013:0467a12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次明受行等上是能化事竟下是受化者得益得益雖多不出於此四故云爾也而言受行等者記云機會則受隨聞觀轉煗法以去名行若準有宗時節節雖促不妨具歷內外凡位至世第一名悟若得初果名之為入今言此且從別若通言初化之益亦可聞慧名受思修名行初果名悟無學為入以是通言初化之益故應爾也(云云)經文曰義疏文具釋初釋轉輪上難菩薩德已略釋竟轉者說也法輪理教即所轉者簡於餘輪故云法也指前說即是故是名也輪義乃多要多要者從此至彼又能權碾自地并空又能達到法者轉化自與他權諸結或顯於空理從因至果略言其四文略釋其初一而即具餘三義在文易知次釋涅槃此云寂滅亦圓寂通於分極及以有無其因既未盡故二俱分而言音者名也亦聲教也謂離生死之名教也次釋羅漢言由此者由向學分故也此則滅諦有餘俱究竟也以此顯前前是學是分此故無學以究竟也下釋法僧即具三寶因此致有三寶淨名經之所云正以此矣此且漸初別體非一體也應知法輪涅槃羅漢三寶四名並始起於此時也前釋轉法輪義正應在此下安之也。",
        "translation": "The next explanation of sensation, practice, and so forth is that the above is the final accomplishment of the task of transformation, and the following is the benefit of those who are transformed, even though it's not limited to these four, so it's called that. The explanation of sensation, practice, and so forth is the result of the opportunity to receive, follow, contemplate, and turn around the beautiful Dharma and go by the name practice.",
        "source": "X29n0596_013:0467b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋疑者前是述昔初化利益之事此是釋今時眾心中之疑疑在眾心釋在佛日疑隱而釋顯疑內而釋外也此疑起之由因向正化及受者得利益而起也於中初正釋次簡非顯正初中二疑初師次資初因前能化次因前利益此明能化受化者皆久遠也然久遠者準下文大通佛後退大權以小接之時名久遠也初師疑中謂初不知機不能用化由前云念已方云同故也釋中先遮非二不能正為允同故次正顯久知久已用也久知樂小是久知機已為讚示明久能用化也而言讚示讚即勸也即三轉義略言二也釋以疑明其亦久曾聞習故也下簡顯者先述舊次明其義可不三顯今意舊人意久遠之言正指後門本地化也次可不者密約佛心不妨微有此義顯露釋時眾故不可也下釋不然所以既無此理故不可也久遠之言雖通疑從因即足首經往往已說即十六王子是也文中將後序以責此玄指下結顯成今意故應爾矣嘉祥云釋疑密開壽量今謂釋則有由開無詮次二義各忽雙言非也其中玄字正應作懸懸遙遠也玄深妙也遠指本地故應作懸。",
        "translation": "The first is to explain the benefit of the first transformation in the past, and the second is to explain the doubt in the minds of the people of the present time, doubt in the minds of the people, doubt in the Buddha's day, doubt hidden and doubt revealed, doubt within and doubt outside, doubt arisen from the cause of the correct transformation and the recipient's attainment of benefit.",
        "source": "X29n0596_013:0467c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次頌顯實者前述昔化即是開權權開既開真實相顯故此是也疏文於中有二初約頌前四一消文更就以下對下喻本以釋初言四者一者前文云唯此一實餘則非真一者實也實必具四故云四一初由。",
        "translation": "The second verse reveals the truth, which is the aforementioned transformation in the past, which was the opening of the provisional and the opening of the true aspect of this being revealed.",
        "source": "X29n0596_013:0468a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛子之言故是人一權則三人實皆佛子子既同故是人一上文有三義兼於人以云如此皆為得等謂皆為令眾生故兼人一上但義兼今文顯頌故示云爾種智為理一者本同有此能所今為顯之故是理一正取但說邊故名教所從於能故即一當作是果果由修因因即行舉果明因故是行同佛果行故是一也故即顯實四義盡矣。",
        "translation": "The words of the Buddha's son therefore are the person and the one right then all three are really the Buddha's son since they are the same the son is the person and the one The above text has three meanings that include the person because it says this is all for attaining and so forth that it's all for causing sentient beings to include the person and the one above but the meaning includes the verse in the present text so it shows that the knowledge of the many kinds is the principle and the one that originally shared this agent and this is the principle and the one that's correctly taken but to explain the extremes so it's called the teaching that follows the agent so that's the one that's taken to be the fruit and the result from cultivating causes that's the practice that's the cause that's the result that's the cause that's the practice that's the same as the Buddha's fruit and the practice that's the one so that's the four meanings that are exhausted.",
        "source": "X29n0596_013:0468a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次對下譬喻以釋者正為譬作本令至下易會故於中初總標次科列三消釋初言四意者非真如向後更有此一四之義只是一文而有二四之義前已明一今顯其二故云更為擬於下故云意也次科列其四名如文二數雖同而有三果謂文名義數同二皆四故文異有離合故名異謂所列四名不同故義異謂由正已入故意雖此別而義恒通故得為兩向釋斯又其一妙矣初名二義然於經文似猶未盡於次自顯次名有標有釋次二義現於後。",
        "translation": "The next one is a metaphorical explanation of the following one, which is an example of making the root cause to the next one easy to understand. The first one is a general statement, the second is a list of three negative interpretations.",
        "source": "X29n0596_013:0468a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明由以下是次消釋即有四別初釋機發索車中初二義相由次更明四句所以有此釋名諸釋並不言其所從或言四句只是廣上二義今恐此有未會何者一者名別義異二者不知其所從來故是不可會也今謂此初經文兩行其義唯二初一行半明機發索車次半行明障除今釋中初明二義即消初一行半文次四句即通釋二行頌文次更別消初文二句後更別釋障除半行之文此明由經故作是釋由此釋故乃會經文不然故俱不會也初明發為索之由索必由於發故也此正由經文志求至乃敬心也故且是初發索二義未涉障除次通釋中言此者此謂指經除發二文即有四句義也初總標次隨列便釋一一皆有三義易知見今經約文且一約義即具三矣初句於昔未發於今即發故具三也下文當釋次更別釋初之二文初釋者求中先會文次釋義志求故是索佛道故是大合言故云索大果此上顯是非求下簡非小也果釋前標名但言索果與光宅言同故此更約文以簡顯也次釋索義有四初總標次別釋三明今昔四問答料簡標言三者三名現於索中所即為義能即為意機是微義可發之義此二復通有二謂理體也習種也對情著故為微對無不可故為可情者心動於中也於勝劣境有愛惡故總名為情聖極方無雖通一切今此別也對前微故為情對後顯故名密言得不得者下文謂般若也非轉此文既言欲以故是情也謂已可得為求不可得故是情也此即其情索之相狀也機則內理情動於中言形於口也初一但理次一意業第三備三業也此三之由者記云有通有別通通前二味皆有機情別則機在聞方等彈行情在般若轉教益親(云云)全云通者機在宜而未著情乃內動於中二味咸然謂之通也別者於方等聞不思議解脫并彼斥為非雖冥有益乃能耻小欣大然自悲敗種絕分求上則但當機索至般若轉教情親漸能成就大志故當情索二時不同謂之別也今謂此都不識機義又乖疏文何者聞勝而能欣耻此情動已甚何謂機宜故是未達釋云為得不得為情却以為機故乖疏今準下文之意亦可謂本有妙理加以宿習之種宜有感發之義為機之索由也聞二味彈斥濤汰心生鄙慕情索之由也今聞歎一為實斥三非真執動疑生慇懃三請言索之由也故後標三名而云機索可解次對二味為情索今經之初三請為口索故知機直就本情通不別思之思之次判今昔可知所以必此三者以出宅之後時長故含此三義不然義不盡故若爾無量義中則無三索雖無三時一中即具三故思之思之次料簡中意初問意者此由前云索大非索小義由未會故舉已引文而後難也答中言出不見者正由出已被斥非真故文云而今不知是義所趣即此義矣途者道理亦意義也謂必別有云意義也已得其三更求此道理故即是索大後文委釋次消初文第二句意述舊顯今證在文可知。",
        "translation": "The following is a summary of the four distinctions in the explanation of the first explanation of the first two meanings in the first explanation of the machine-initiated soso cart, the second two meanings in the explanation of the second explanation of the second explanation of the second explanation of the second explanation of the second explanation of the second explanation of the second explanation of the second explanation of the soso cart, and the second four meanings in the explanation of the second explanation of the second explanation of the second explanation of the second explanation of the soso cart.",
        "source": "X29n0596_013:0468b06_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "此前並大機索果之義竟下釋後半行障除之文經云諸佛者一者亦曾通稟二者舉通顯別諸佛道同皆以法華故也初味受行別舉初味三乘以下通舉二味三乘等即五方便也由此故障除由此障除故機發由此機發故索大也亦度未斷如何云除前云未除機發又以少從多言之後文當更廣釋次釋除喜經文三行一句初行直度今次一行一句對昔顯今疏文障除指向文佛喜即當文但除為喜由故舉以顯然二文各有其二切有發除此有時喜實由前兩致於此二疏文巧略各言其一故云除喜經文雖初直明今次對昔顯疏釋其二各皆對昔以顯今也初中先標出意次二句舉昔初中而不得說初有二由次有一由謂大機未發故最下一句明今正是時故言今正是其時也上句但言障除下句但言機發此亦巧能妙矣次釋喜而無畏亦初舉昔有無故憂顯今無有故喜根鈍是五濁障重智小是無大機恐故是憂而無喜也次翻前三故喜可知次釋無畏畏即憂也喜而無憂故下合說也由鈍小故執小而謗大執小而執謗大故即是起罪業因墮惡道果由障除故根利根利故志大大故不執謗不執謗故無罪業因即無惡道之果故無畏也應知此中三義初對昔非顯今是故次對昔憂顯今喜故三對昔有以顯今無故其中皆有所以並已於前(云云)。",
        "translation": "The sūtras say that the buddhas, one, have also presented in common, two, have presented in common, and the distinctive paths of the buddhas are the same in terms of the Lotus, the first flavor, reception, practice, and the following flavors of the three vehicles are presented in common, such as the two flavors and three vehicles, which are the five expedients.",
        "source": "X29n0596_013:0469a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下言正顯實者此既言正前二即是由也經初一句即所為之人前之志求使道者故今皆云菩薩下二句正為此人而顯實也初句簡非下句顯是文雖二句義乃有三疏釋二句即有三義在文分明初釋正直正直是對偏曲之名故先舉偏曲以釋正直五乘是其物是非是其義者道迂迴故是曲不能即是故非直通別是其物亦以是非為其義並非中道故是偏旁以偏旁故非其正以之非即顯一乘圓道是正直下釋捨方便方便即前偏曲七方便也如是偏曲今並絕棄不復更論故云捨也下釋但說無上道也正直對於前偏曲一謂一乘真實之法對五七方便法也道謂無上道對前是有上也此三名異而實一也總此三義簡顯而言之故云正等也或曰至道無方莫非悉道何捨之有今謂若爾亦應無修曰直了一切即是名之為脩非謂捨非從是名之曰修若了一切非即是何不了捨即非捨又即非捨非非捨而能捨不捨既不能達此妙捨何能了達真修固未足與論於妙道矣或曰法界圓備彌綸無外何法不在而捨權但實斯言未為圓矣今謂餘經可作是說此經意則不然諸佛法久後要當說真實唯為一大事出現於世我本立誓願為令一切眾如我等無異如我昔所願今者已滿足化一切眾生皆令入佛道故知唯一真實其餘方便非佛本懷[紵-丁+死]論佛化雖無量不出於二謂著以會差則權實兩存會則權實雙泯昔經未會可以兩存此經開會固當廢捨今從此義故云捨矣或曰子之此言過而不覺何者捨非開會開會非捨既言開會而復言捨其義可乎此謂不達要旨故致斯惑此經妙用有十要在於二十謂破開廢會等二謂相待絕待前云諸法從本來常自寂滅斯約開會絕待也此文言捨約破廢相待也如是一等義文難異出義未始異無一則已有一則十迹門既爾本開固爾尚未知一世之迹況知久遠之本當未知本迹二安能知不二如此橫竪無方適可謂圓妙道又人又不識同體異體若開會已同一妙體尚具四句何但其二若未會妙若少若多並為麤物迹開既爾本門亦然夫如是乃可謂圓妙矣人多謬妄造次而言故聊述之云爾子尚未知其一何能知二尚不知一二安能知其十信不可妄造次矣。",
        "translation": "The next one says, \"Correctly reveal the truth.\" This is because the first sentence of the sutra refers to the person for whom the former intention is to make the path known, so now they all say that the bodhisattva's next two sentences are precisely for this person and reveal the truth. The first sentence is simply not the next sentence reveals that although the meaning of the two sentences is three, the commentary explains that the two sentences have three meanings, which are delineated in the text. The first explains that correct and straight is the name given to the deviations, so the deviations are first mentioned to explain that the five vehicles are their own things, and right and wrong are their meanings.",
        "source": "X29n0596_013:0469b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次受行者明開顯己物稟得利益也大論既(云云)信力故受可以為聞慧也行即思修悟初真悟位入即深上地此從通說若約別者亦可即當開示悟入義亦可會須具通別不可一向乖上下文疑信受義深者當思信解品題可以無惑文云疑細皆已除豈非信解故並入真信位矣義雖有四文只一行文雖一行要仍有二初半疑除次半授記又初是自受行悟入次是能令他受行悟入也疏先釋文次料簡釋成初先除疑次釋受記三會釋二初中先明疑次釋除三例顯初二菩薩即是疑者初聞等即疑由致新疑即正生疑疑相如後今悉除約二教故(云云)悉此亦有由即廣法說也已字義當此以以者因也皆因而得除也經皆作已承傳如此宜知之次下例顯聲聞菩薩尚疑得除況聲聞而不疑除下釋聲聞獨言授記之意其無成佛利他之義無可記之因故不與記今聲教開之同於菩薩有其因故與之記言今行者有云作行音讀謂今之一行頌文與其授記也此應不爾說者多云此是江鄉之言音可此固不然昔魏文帝與矣質書云與子別未行已數年彼豈江鄉之大古之賢達多用此言未能具述然行字訓往也去也謂從今向去即當次第與其記別故下文云今當次第與授三菩提記即其義也又行者將也今將欲與其記先以此言也此義最便全云行者旋也謂旋總與記也此義則近而言亦未雅便授記豈獨以下會釋二異初明二意均次釋會文異但是綺互其文而彰其義備也。",
        "translation": "Although there are four texts, the text is only one line. Although the text is one line, there are still two things: first, the removal of doubt; second, the half-granting of assurance; and third, the ability to cause others to receive the practice of awakening. The commentary first explains the text and then summarizes the interpretation into form by first removing doubt, then explaining the acceptance of assurance, and then explaining the two middle schools by first clarifying the doubt and then explaining the removal of the three examples.",
        "source": "X29n0596_013:0469c21_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次更料簡釋成前疑除義初問者前雖言疑仍未出其相狀此將明之故此問也答中先明疑之相狀後明除也初明二人昔所稟教是其所執為真實也初聞以下明其疑之由昔真昔成等者正出其疑之相狀也即疑昔所教也又三以下則明通菩薩疑同學一道執昔所教何意有別疑今說此之由者與向是同即略說也一道即真實何處更別有真實而言要說真實前是疑果此是疑理向明疑由及正疑竟下明除也今聞等即除之由謂廣開顯也掃蕩正明除盡也諸疑如向通別也正由開顯昔方便無有真實今方是真實以是故得除盡而言別者教雖未真而有一分實義若據前文顯於信力簡於不退固當生疑及聞廣開固理亦除盡也文云諸疑別義亦在其中矣且從難說故不別出其疑難者既除易者可例故略之也應知此一文二義總指於後如來懸鑒知法說意必悟入必授記別亦擊之令必悟入非謂上根於此之前已得悟入故與授記故不應爾。",
        "translation": "The first question is, \"Although we said we had doubts in the past, we still haven't gotten rid of their appearance.\" In the answer, we first explain the appearance of the doubts, and then we explain their removal. First, we explain that the two people who had received the teaching in the past were the true reality, and then we hear the following, which shows the reason for their doubts.",
        "source": "X29n0596_013:0470a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次頌歎法者釋尊長行文無而義通有故取諸佛章中文此中既頌故知長行義定有故言非正者如前已明言為二者長行有法有喻為二今此亦然今觀此文恐不然長行文極略雖有法譬而無合法說但有兩初舉妙法次舉時乃說之為歎今即頌此兩名之為二於次舉時歎中方乃開於法譬文不列名直隨而釋致後多惑應大開為二初一行頌上先舉妙法次四行半頌上舉時為歎於次歎中亦可便開為三謂法譬合文中似但為法譬二也釋初意中先會長行如三世下次正釋文初會上者正取無分別法名為妙也下出妙體言權實者記云如玄籤釋即指彼釋妙名不可思議法即十界十如權實之法文也若依彼釋亦未可會彼通此別且迹門故全同體之權故云妙法今謂此釋更未可會法且未成妙義安在至此猶然前固未通信矣今謂權實不二無方也前預歎後今却歎前皆開顯之物名妙法也義自彰於次文故此略云爾也次正釋中兩番初約開權顯實通釋四句次約會權入實但釋後二句初中二佛互舉明開顯也昔用是施故是儀式儀式法則也即分別也於今是開開之已無方豈定分別故是顯實經云如是如是順同之義正應作允而文並作引恐聲相近抄寫設也次會二釋者即對分別顯無分別也亦是約相待釋絕待昔是不二而二亦是無分別而分別今會二即不二亦是分別即無分別此即無量義出生收入義也如此者並名為妙法也如是顯妙二佛同爾故通結云諸佛皆爾等也。",
        "translation": "The second verse praises the teaching because the Bhagavān's long practice has no text but the meaning is generally there, so he takes the chapter on the buddhas and says, \"This is not correct.\" As was explained earlier, the verse is two: the long practice has a teaching and a metaphor, but this is also true.",
        "source": "X29n0596_013:0470b16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "以下釋次歎者前言妙法雖即是歎且在於所今方是正歎顯法真是妙也法乃時說喻乃時現合乃過前故並是歎顯成妙法初約人歎佛是妙人法是妙人所得故是至妙之法此正出難以為歎也具如前文委釋次即舉說此法難以為難對為前人故云法耳正在於說難注(云云)者應委明其難之所以以妙為主並具文此前人法是約佛歎此下之二是約眾以難也次聞難者尋常猶難況更從佛言梵音即佛音聲也佛三十二相之中一也準於相好經中三十二中最第一相能遍法界應化作佛事故梵者清淨妙也從妙淨體上而起斯用也又清淨者蓮華之德此即妙蓮華之音聲故云爾也無因在座故云紀廗聽受難者向明暫聞已不可得況既得聞復能始終聽受非妙信解熟致如之故雖言聽正明信解難也此前約四歎以難文有通別義亦如之總彰法妙令物決信解也委已如上釋不欲更繁文也次喻中初一句所歎三句是歎所歎總即妙法別即四也次三稱難亦含總別義亦如是合但聞者以言聞故今謂聞者即合四中之後二也能聽亦是聞故所以但聞二者正為時眾勸生信故又都不知但謂四中之一不可聞法即聞難歡喜讚即信解難若不信解何能喜讚故即二也讚詞多少乃至一言有何功德則為已等又挍量云難得有過於曇華也言一言者有通有別別即一字通於長短別一字者如下文云能隨喜讚善者是也極而言之所謂如是也通者如禮中釋云謂一句之言名為一言後語云齊人陳薩公之請乞一言入云海有大魚此四字即一句之言也語云一言以蔽諸曰思無邪此三字為一言也又以少故名為一言即如一言興喪之流是也非上通別但取少故名一言也今此中且應在通別二也而言供養者乃有眾多如前已說此即法供養亦是如法供養供養中最一切諸佛無餘所須準希令物信解此法能此聞信稱歎稱會聖心故則為妙供養矣此少文義其要相釋者並都不言借哉今且略爾未暇周備。",
        "translation": "In the following explanation, the second part of the verse is to praise the wonderful Dharma, even though it is praised by the Buddha and is in the present, and this is the correct way to praise the wonderful Dharma. The first part of the explanation is to praise the Buddha as a wonderful person, and the Dharma is obtained by a wonderful person, so it's the most wonderful Dharma.",
        "source": "X29n0596_013:0470c18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "次頌不虗者亦是成前妙法也既是妙法無有虗妄真可信也長行自有此章文居最後諸佛章中即相次於前義須必有次第無在分二章者長行有此二文次第亦爾易知不能繁述既言法王故是人既言妙法故是法妙人故人可信妙法故法可信人王不二使天下一法王不虗使法界實故言不虗而可信也前人中舉人顯法不虗此法舉權顯實可信定勿疑或也。",
        "translation": "Next, the verse doesn't praise those who have accomplished the former wonderful teaching, but since it's a wonderful teaching, there's nothing unsubstantial about it, and it's truly believable. The long practice has its own version of this chapter, in which the text is placed last among the buddha chapters, which are sequential in meaning and not in two separate chapters.",
        "source": "X29n0596_013:0471b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋頌第六章先述舊後正釋初中先述其總科次述其別釋初中先簡非頌前次別立科因初言不頌觀簡者文果與前不相應故但是等者既簡非頌前而顯所是故云但是等勸信妙法令其弘宣意之自現於次文其文以下是次述其別科釋其文也初科二章次釋其二三結二意初者只是勸其行因授其常果也先釋初文應更為四文略隨舉便釋四謂勸釋體結也初文諸佛秘要即妙果人法欲得此果當須脩因修因之要必須弘宣此妙經也下釋二字即人法也能所也各復二義自他體用也在文易見福蘊積也即脩得也次釋者即無因而秘藏其要也此前二意但是舉法意在勸其弘也下明體者教其弘宣之體則也此二意一往消文甚會固常爾矣次雙結者初結前二次結第三中之二也此之科釋雖非宗要於文善有心眼故具述而不破但非其正要不然也次述其釋第二授記分別其仍有三義有解即既已知也下二易知又重牒前二為記之由此是總相記也上釋二章文竟下雙結明兩意可知下總結示舊意爾也此三科釋初言簡勸要隨文分折亦差有心眼亦存一分道理觀清所釋未有過者故具述而不破也次直破其失文正意故結云爾次下正釋其文數處不同可知於中有三初標章次責舊三科初言簡勸者簡於偽眾篤勸真眾令必信於真實之法故也言幸有者正合頌故也當文長行偈頌故近授記流通隔越在後故遠近正遠傍棄近正從遠旁其故何耶言互簡互其文顯其義齊言惡人謂不信順道理之人也以無一乘順信之種故不信受以不受故解義難得感而遂通故有值遇具於三義如何所釋既簡釋竟下故敦擊令其必信也若不信等引前文即敦勸之伺也信權謂深信昔說三乘是方便也今日所說決定是真字實也言諸佛世之師者諸佛大事出世利益之師此信實也隨宜方便事此信權也於二分明信解故無疑惑也此即圓妙覺道任自造極自覺覺他故云自知當作佛矣上來雖略廣總別多文總是頌釋尊長行開權顯實文章上束五佛長從行偈頌十番六義不同總是廣開顯中初正法說開顯一妙義竟豈遠乎哉即心是矣能了自心權實無方即心法界皆為妙矣深遠其六則位法妙矣了以意得不俟詞繁耳。",
        "translation": "In the sixth chapter of the second explanation of the verse, the old one is first stated, then the correct one. The first chapter first states that it's a general section, then it's a specific section. First, it's not a verse; second, it's a separate section cause. First, it's not a verse; second, it's a text and result that don't correspond to the previous one; therefore, it's a verse that's not a verse, but it shows what it is, so it's a verse that exhorts belief in the wonderful teaching and promotes its own intention.",
        "source": "X29n0596_013:0471b13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "妙經文句私志記卷第十三",
        "translation": "Miaojing wenju shizhiji, vol. 13",
        "source": "X29n0596_013:0472a05_0",
        "is_bad_quality": false
    }
]