[
    {
        "source_sentence": "科註妙法蓮華經卷第二",
        "translation": "Section Notes on the Sutra of the Lotus of the Wonderful Dharma, Volume 2",
        "source": "X30n0605_002:0666b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋　柯山金谿棲雲沙門　守倫　註",
        "translation": "Song: Qiyun Shaman of Kashan Jinquan, Shoulun's Notes",
        "source": "X30n0605_002:0666b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明　玉谿菩提菴沙門　法濟　參訂",
        "translation": "Ming, Yuquan, Puti'an, Shaman, Faji, Revision",
        "source": "X30n0605_002:0666b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　　吳興瓶城居士　閔夢得　較刻",
        "translation": "Wu Xing Bancheng jushi Min Mengde guiqie",
        "source": "X30n0605_002:0666b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正宗分二初約迹門開權顯實二約本門開近顯遠初文又二初正宗分二流通分初文又八初方便品二譬喻品三信解品四藥草喻品五授記品六化城喻品七五百弟子品八人記品初文又二初釋品題。",
        "translation": "△Two main tenets are divided into two: first, the derivative aspect opens up the expedient and reveals the real; second, the fundamental aspect opens up the near and reveals the distant.",
        "source": "X30n0605_002:0666b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "玅法蓮華經方便品第二",
        "translation": "The Second Expedient Chapter of the Sutra of the Lotus of the Dharma Bhadraka",
        "source": "X30n0605_002:0666b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋此品題有廣有略先略次廣略則三種方便廣則十雙權實且三種方便者謂法用能通祕妙三也言法用者方者法也便者用也法有方圓用有差會三權是矩是方一實是規是圓此義可釋他經非今品意又方便者門也門名能通通於所通方便權略皆是弄引為真實作門真實得顯功由方便此從能顯得名是故以門而釋方便如經云開方便門示真實相此義可釋他經非今品意又方者祕也便者妙也妙達於方即是真祕點衣內無價之珠與王頂上惟有一珠無二無別指客作人即長者子亦無二無別如斯之言是祕是妙如經云唯我知是相十方佛亦然止止不須說我法妙難思故以祕釋方以妙釋便正是今品之意故言方便品也言十雙權實者一事理二理教三教行四縛脫五因果六體用七漸頓八開合九通別十悉檀於此十中復約生起次第權實本迹等八意詳而釋之然亦不出自行因果化他能所之義。",
        "translation": "The title of this section has a broad and a brief introduction, followed by a brief introduction, then three kinds of skillful means, and the broad introduction is the ten pairs of expedient realities. The three kinds of skillful means that the function of the Dharma can be interpreted as the secret and the marvelous.",
        "source": "X30n0605_002:0666b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋經文二初略開三顯一二廣開三顯一初文又二初略開三顯一二動執生疑初文又二初長行二偈頌初文又二初寄言歎二智二絕言歎二智初文又二初歎諸佛權實二歎釋迦權實初文又三初雙歎二初經家敘。",
        "translation": "The first two explanations of the sūtra's text are: first, a brief introduction that reveals the three and the one; second, an extensive introduction that reveals the three and the one; and first, two brief introductions that reveal the three and the one; second, a long line that raises doubts about the two; and first, two long verses that praise the two kinds of wisdom and two absolute praises of the two kinds of wisdom.",
        "source": "X30n0605_002:0666c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊從三昧安詳而起告舍利弗。",
        "translation": "At the time, the Bhagavān rose from his samādhi in well-being and addressed Śāriputra.",
        "source": "X30n0605_002:0666c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時者即指文殊答問竟時也問佛常在定何故言起答此有所示往古諸佛說此經時必先入無量義定今佛亦爾入定緣理安心實相出定令他亦安心實相內安實相方起化他故言安詳而起也告舍利弗者其小乘中智慧第一將欲因其破小智顯大智故先告之以動羣輩耳。",
        "translation": "At that point, he was referring to the time when Mañjuśrī had finished answering questions. He asked why he said \"arise\" when the Buddha was always in meditation. He replied that this was a sign that when the Buddhas of old taught this sūtra, they would first enter meditative concentration with immeasurable meanings.",
        "source": "X30n0605_002:0666c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正歎二智二初歎實智。",
        "translation": "Second, he praised the two kinds of wisdom. First, he praised the true wisdom.",
        "source": "X30n0605_002:0667a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛智慧甚深無量。",
        "translation": "The buddhas' wisdom is so profound and immeasurable.",
        "source": "X30n0605_002:0667a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實智即諸佛智慧非三教化他權實故言諸佛顯自行之實故言智慧此智慧體即一心三智甚深無量即稱歎之辭明佛實智竪徹如理之底故言甚深橫窮法界之邊故言無量無量甚深竪高橫廣譬如根深則條茂源遠則流長實智既然權智例爾。",
        "translation": "This wisdom is the real wisdom of the buddhas, not the expedient reality of the three teachings that transform others, so it's called wisdom because the buddhas express the reality of themselves.",
        "source": "X30n0605_002:0667a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二歎權智。",
        "translation": "△Two, \"Wisdom of expedient devices.",
        "source": "X30n0605_002:0667a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其智慧門難解難入一切聲聞辟支佛所不能知。",
        "translation": "The aspect of wisdom that's difficult to understand and difficult to enter is beyond the ability of all śrāvakas and pratyekabuddhas to know.",
        "source": "X30n0605_002:0667a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其智慧門即是歎權智也蓋是自行道前方便有進趣之力故名為門從門入到道中道中稱實道前謂權難解難入歎權之辭不謀而了無方大用七種方便不能測度十住始解十地為入舉初與後中間難示難悟可知矣別舉聲聞緣覺所不能知以其執重故別破之法身本意元以自行權實擬之無機逃走故言不知華嚴頓照聾啞瞽聵故言不知方等彈斥保住草庵故言不知般若轉教無心悕取一[(歹*又)/食]之意故言不知今大機啟發放光動地彼此今古諸佛道同猶懷疑惑故言不知利根菩薩節節能知鈍同二乘是亦不知。",
        "translation": "The gate of wisdom is the wisdom that praises expedient approaches, which are called gates because they are self-directed and have the power to advance to the middle of the road.",
        "source": "X30n0605_002:0667a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二雙釋二初釋實智。",
        "translation": "△Two explanations are offered, and the first is an explanation of true cognition.",
        "source": "X30n0605_002:0667a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何佛曾親近百千萬億無數諸佛盡行諸佛無量道法。",
        "translation": "\"Why is it that the Buddha has been intimate with hundreds of thousands of trillions of incalculable buddhas who have fully practiced the Buddha's innumerable paths and teachings?",
        "source": "X30n0605_002:0667a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何者是徵起雙冠二智之辭佛曾親近至盡行道法是釋諸佛實智所以外值佛多稟承至要故實智甚深良由內行純厚盡行道法故實智無量無量則釋橫廣甚深則釋竪高。",
        "translation": "This is the explanation of the true wisdom of the buddhas, which is the expression that gives rise to the two kinds of wisdom, that the buddhas have been intimate with each other and have carried out the entire path, that's why the external buddhas are so numerous, that they've inherited the ultimate essentials, and that's why the true wisdom is so profound.",
        "source": "X30n0605_002:0667b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋權智。",
        "translation": "△Two explanations of expedient cognition.",
        "source": "X30n0605_002:0667b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勇猛精進名稱普聞。",
        "translation": "\"Vigorously exerting himself, he's called universally heard.",
        "source": "X30n0605_002:0667b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勇猛精進名稱普聞是釋諸佛權智其智慧門難解難入良由勇猛精進能入難入之門既入門已澤被無彊物欽勝德故名稱普聞亦可分句而釋勇猛精進能入法門即釋權智之深名稱普聞即釋權智之廣雖權文無深廣之語若例實智此義可成。",
        "translation": "The name bold and energetic effort, Puhuen, explains the authoritative wisdom of the buddhas, whose gate of wisdom is difficult to understand and difficult to enter, and which is good because bold and energetic effort can enter a gate that's difficult to enter and which has been penetrated by an uncongenial object that admires excellent qualities.",
        "source": "X30n0605_002:0667b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三雙結初結實智。",
        "translation": "△There are three double bonds. The first bond is real wisdom.",
        "source": "X30n0605_002:0667b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成就甚深未曾有法。",
        "translation": "It accomplishes something profound that has never existed before.",
        "source": "X30n0605_002:0667b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱理究竟故言成就到彼岸底故言甚深此結成實智。",
        "translation": "It's called accomplished because it claims to be the ultimate principle.",
        "source": "X30n0605_002:0667b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二結權智。",
        "translation": "△Twofold knotted wisdom of expedient devices.",
        "source": "X30n0605_002:0667b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨宜所說意趣難解。",
        "translation": "Its meaning is difficult to understand because it's explained appropriately.",
        "source": "X30n0605_002:0667b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "稱機適會故言隨宜非七方便人所知故言難解此結成權智。",
        "translation": "It's called appropriate because it's not known to seven people with skillful means, and therefore it's called difficult to understand.",
        "source": "X30n0605_002:0667b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明釋迦權實三初雙歎二初歎實智。",
        "translation": "△Two explanations of the expedient and real aspects of the Śākyas' wisdom are summarized in three preliminary remarks and two preliminary remarks about the real wisdom.",
        "source": "X30n0605_002:0667b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗吾從成佛已來。",
        "translation": "\"Śāriputra, I've been praising him since he became a buddha.",
        "source": "X30n0605_002:0667b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾從成佛已來歎實智若實智不圓則佛道不成既云成佛一成一切成即是歎實智。",
        "translation": "If real wisdom isn't perfected, then the Buddha Way won't be realized, since it's called becoming a buddha and one becoming all becoming, that's praising real wisdom.",
        "source": "X30n0605_002:0667b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二歎權智。",
        "translation": "△Two, we praise expedient cognition.",
        "source": "X30n0605_002:0667b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣種種譬喻廣演言教無數方便引導眾生令離諸著。",
        "translation": "Various causes and conditions, various metaphors, extensive discourses, and countless methods guide sentient beings and cause them to part with attachments.",
        "source": "X30n0605_002:0667b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "種種因緣下是歎權智四十餘年以三種化他權實逗會眾生故言種種因緣譬喻者小乘以芭蕉水沫為譬大乘以乾城鏡幻為譬依諸經論則小乘譬於乳大乘譬醍醐也廣演者能於一法出無量義無數方便即七種方便也引導眾生令離諸著說散十善離三途著說靜十善離欲界著說三藏法離見思著說菩薩法離涅槃著說佛法離順道法愛著。",
        "translation": "Under \"Various causes and conditions,\" this is praising expedient wisdom that has been used for more than 40 years to amuse sentient beings with three kinds of expedient and real methods for teaching others. \"Various causes and conditions\" means the lesser vehicle uses the metaphor of plantain and foam, and the greater vehicle uses the metaphor of the mirage of the city of Gandhāra. According to the sutras and the treatises, the lesser vehicle metaphor is milk, and the greater vehicle metaphor is ghee.",
        "source": "X30n0605_002:0667b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二雙釋。",
        "translation": "△Two double explanations.",
        "source": "X30n0605_002:0667c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何如來方便知見波羅蜜皆已具足。",
        "translation": "\"Why is it that the Tathāgata has fulfilled the perfection of skillful means of knowing and seeing?",
        "source": "X30n0605_002:0667c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此雙釋二智如來即是釋實智從真如實相中來而得成佛道故名如來方便即是釋權智由於方便善巧故能種種因緣說也知見波羅蜜者即是雙舉權實知見也一切種智名實知佛眼名實見道種智名權知法眼名權見悉到事理邊底故悉名波羅蜜言皆已具足者權實悉究竟也。",
        "translation": "This double explanation of the two kinds of cognition is called the tathāgata, which is the explanation of the real cognition that comes from the true reality and attains the buddha path; therefore, it's called the tathāgata's method, which is the explanation of the expedient cognition that's able to explain various causes and conditions because of the skillful means. The perfection of knowing and seeing is the dual explanation of the expedient and real knowing and seeing, which is called the knowledge of all kinds of cognition, the knowledge of the Buddha's eye, the knowledge of the path, the knowledge of the Dharma's eye, the knowledge of the expedient, and the view of the expedient that reaches the limits of things and principles.",
        "source": "X30n0605_002:0667c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三雙結二初結實智。",
        "translation": "△There are three pairs of conclusions, the first of which is the cognition of reality.",
        "source": "X30n0605_002:0667c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗如來知見廣大深遠。",
        "translation": "\"Śāriputra, the Tathāgata's knowledge and vision are vast and profound.",
        "source": "X30n0605_002:0667c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此雙結二智如來知見前文已明今言廣大明橫深遠明竪如此實智非橫非竪寄言往歎論其橫竪照無限極如函大蓋大也。",
        "translation": "This double-binding of the two kinds of cognition of the Tathāgata's knowing and seeing has already been explained in the previous section. Now, it's called vast and extensive, profound and far-reaching, and straightforward.",
        "source": "X30n0605_002:0667c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二結權智。",
        "translation": "△Two categories of expedient cognition.",
        "source": "X30n0605_002:0667c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無礙力無所畏禪定解脫三昧深入無際成就一切未曾有法。",
        "translation": "Measureless, unhindered power, fearless meditation, liberation, and concentration penetrate without limit to accomplish all unprecedented things.",
        "source": "X30n0605_002:0667c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無礙下即結權智也自行之權道前方便約諸法門故知是結權智明矣當知實智無若干也無量即佛地四等也無礙即佛地四辯也能於一辭一義旋出無量樂說不窮比於別通菩薩如爪上土可方于地力即十力畏即四無所畏禪即禪之實相定即首楞嚴之定三昧即王三昧深入無際者結成竪深成就一切未曾有法者結成橫廣。",
        "translation": "Measureless and unhindered is the cognition of the right to be bound up, which is the right path of self, the prior skillful means, and the various dharma gates, so it's clear that this is the cognition of the right to be bound up.",
        "source": "X30n0605_002:0667c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二絕言歎二智二初舉絕歎之由二初舉絕歎之由。",
        "translation": "△Two ways of praising the two kinds of cognition, the first being to cite the reason for praising the two ways.",
        "source": "X30n0605_002:0668a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗如來能種種分別巧說諸法言辭柔輭悅可眾心。",
        "translation": "Śāriputra is a tathāgata who can skillfully explain the various discriminations of things in words that are gentle and pleasing to the minds of all people.",
        "source": "X30n0605_002:0668a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "再舉權實作絕言之由鄭重者表殷勤也如來能善分別巧說諸法者即舉權也言詞柔輭悅可眾心者舉實也如上文見他土說頓云其聲清淨出柔輭音下文身子領解云聞佛柔輭音深遠甚微妙據前後兩文則知舉實智也問前歎中則前實後權今何意前權後實耶答明前欲寄言故從實舒權今欲絕言須卷權歸實。",
        "translation": "The Tathāgata who is able to skillfully discern and explain things in words that are pleasing to the multitude of people's minds is holding up the truth. As shown above, when he sees another land and speaks suddenly, his voice is pure and produces a gentle sound.",
        "source": "X30n0605_002:0668a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二指絕言之境。",
        "translation": "△Two things refer to the realm of cutting off language.",
        "source": "X30n0605_002:0668a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗取要言之無量無邊未曾有法佛悉成就。",
        "translation": "Śāriputra took the essentials and said, \"Measureless, limitless, unprecedented, and completely accomplished are the buddhas.",
        "source": "X30n0605_002:0668a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "取要言之是指實境要者則莫過于實無量無邊未曾有法是指權境又舉要是剏指之端無量無邊是指權未曾有法是指實言此二法佛悉成就修道得故此那可說若單明一事不應言悉若雙指權實其義明矣。",
        "translation": "If he takes the essentials and says they refer to the real realm, then there's nothing more important than the real. Immeasurable and limitless unprecedented things refer to the expedient realm, and if he raises this to the end of the finger, immeasurable and limitless refers to the expedient.",
        "source": "X30n0605_002:0668a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正絕言歎二初正絕言歎。",
        "translation": "△Two ways of correctly cutting off language and praising them The first way is to correctly cut off language and praise them.",
        "source": "X30n0605_002:0668a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止舍利弗不須復說。",
        "translation": "Stopping Śāriputra doesn't require further explanation.",
        "source": "X30n0605_002:0668a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "印師云欲因止生其疑請之心觀師云實法難知故先抑止驚其常情今明此法深寂言語道斷體不可說故止而歎之設慈悲為說聞不能解傷其善根是故止也。",
        "translation": "The teacher of India said that he wanted to cause the stop to give rise to doubt and request, and the teacher of contemplation said that the true teaching is difficult to know, so he first suppressed the stop and startled his ordinary feelings. Now, he explained that this teaching is profoundly quiescent, that the essence of language and path is cut off, that it can't be explained, so he stopped and praised it.",
        "source": "X30n0605_002:0668a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋止歎意二初明佛是最上人修得最上法故不可說二初明最上人權實橫滿不可說。",
        "translation": "△Two explanations of the meaning of stopping and praising are two: first, it shows that the Buddha is the supreme person who has cultivated the supreme Dharma and therefore cannot be described; and first, it shows that the supreme person's human rights are truly vast and incomplete.",
        "source": "X30n0605_002:0668b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何佛所成就第一希有難解之法。",
        "translation": "Why is that? What's the most rare and difficult-to-understand teaching that the Buddha has accomplished?",
        "source": "X30n0605_002:0668b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此釋止歎之意先明權實橫滿不可說然成就對不成就難解對不難解即是橫明成就修道得故故不可說。",
        "translation": "This explanation stops short of praise and first explains that the expedient and true are horizontally complete and inexplicable, but accomplishing what's difficult to understand and not accomplishing what's not difficult to understand is a horrifying accomplishment of cultivation and attainment, so it can't be explained.",
        "source": "X30n0605_002:0668b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明最上人權實竪深不可說。",
        "translation": "△Two, it shows that the supreme truth of human rights is profoundly ineffable.",
        "source": "X30n0605_002:0668b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛與佛乃能究盡。",
        "translation": "Only buddhas and buddha's can be fully explored.",
        "source": "X30n0605_002:0668b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛與佛乃能究盡初中分獲未盡其源如十四日之月光用未普獨佛與佛究竟邊底如十五日之月體無不圓光無不徧如此豎深修道得故故不可說。",
        "translation": "Only the Buddha and the buddhas can exhaust the middle-level portion of attainment, which hasn't exhausted its source like the light of the fourteenth moon, whose function isn't completely unique to the Buddha and the buddhas' ultimate limit like the fifteenth moon, whose body is never incomplete and whose light is never pervasive.",
        "source": "X30n0605_002:0668b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明甚深境界二初略標權實章。",
        "translation": "△Two Explanations of the Profound Realm Two The first is a brief summary of the chapter entitled \"The Real Characteristics of Things.",
        "source": "X30n0605_002:0668b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法實相。",
        "translation": "\"The true characteristics of dharmas.",
        "source": "X30n0605_002:0668b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸法權也實相實也此一句即是總標權實。",
        "translation": "The expedient aspects of dharmas and the real aspects of reality are also summarized in this sentence, which is a general statement of expedient and real.",
        "source": "X30n0605_002:0668b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二廣釋權實相。",
        "translation": "Second, it explains in detail the true aspect of rights and realities.",
        "source": "X30n0605_002:0668b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂諸法如是相如是性如是體如是力如是作如是因如是緣如是果如是報如是本末究竟等。",
        "translation": "It means that all things are thus in form, thus in nature, thus in essence, thus in force, thus in action, thus in cause, thus in condition, thus in effect, thus in retribution, thus in beginning and end, and so forth.",
        "source": "X30n0605_002:0668b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂諸法如是相等此十句今作四番釋之一約十界二約佛界三約離合四約位經云諸法故用十界釋之又云佛所成就第一希有之法故用佛果釋之又云止止不須說我法妙難思故用離合釋之又云唯佛與佛乃能究盡故用約位釋之初約十界者謂六道四聖之十法也法雖無量數不出十一一界中雖復多派不出十如如地獄界當地自具相性本末亦具畜生界相性本末乃至佛界相性本末無有缺減故毗曇毗婆沙第七云地獄道成就他化天法即是其例餘九法界亦如是當知一一界皆有九界十如若照自位九界十如皆名為權照其自位佛界十如名之為實一中具無量無量中具一所以名不可思議若照六道三聖五如為權若照佛界四如為實當分歷歷此則可說可示何俟止止絕言歎哉所以一中無量凡夫雖具理絕情迷二乘雖具捨離求脫菩薩雖具照則不周名不了了如來洞覽橫豎具足唯獨自明了餘人所不見不可宣示止止絕言其在此耳二約佛界釋者佛界非相非不相而名如是相指萬善緣因故下文云眾寶莊校即其義也佛果非性非不性而名如是性此指智慧了因故下文云有大白牛佛界非體非不體而名如是體此指實相正因故下文云其車高廣佛界非力非不力而名如是力此指菩提道心慈善根力等故下文云又於其上張設幰葢佛界非作非不作而名如是作此指任運無功用道故下文云其疾如風佛界非因非不因而名如是因此指四十一位故下文云乘是寶乘遊於四方佛界非緣非不緣而名如是緣此指一切助菩提道故下文云又多僕從而侍衛之佛界非果非不果而名如是果此指妙覺朗然圓因所剋故下文云直至道場佛界非報非不報而名如是報此指大般涅槃故下文云得無量無漏清淨之果報佛界非本非末而言本末當知本即佛相末即佛報此自行權也佛界非等非不等而言究竟等此指實相故標章云實相也是自行之實即實而權故言本末即權而實故言為等此是如來自行權實最為無上然無上相乃至無上果報橫廣竪深而無有上故標章云諸法實相也例亦應言諸法實性實體實力乃至應言實究竟等但略舉一一以蔽諸如來徧照橫竪悉周如觀掌果只為凡夫如雙盲二乘如眇目菩薩夜視朦朧不曉不可得說所以止止絕言意在此爾三約離合者若佛心中所觀十界十如皆無上相乃至無上果報唯是一佛法界如海總萬流若千車共一轍此即自行權實若隨他意則有九法界十如相性等即是化他權實化他雖復有實皆束為權自行雖復有權皆束為實此即自行化他權實隨他則開隨自則合橫豎周徧開合自在雖開無量無量而一雖合為一一而無量雖無量一而非一非無量雖非一非無量而一而無量唯佛與佛乃能究盡凡夫則誹謗不信二乘則迷悶不受菩薩則塵杭未明為此義故止止絕言四約位者一切眾生皆有實相本自有之乃是如來藏之相貌也如是性即是性德智慧第一義空如是體即是中道法性之理也是為三德通十法界位位皆有若研此三德入於十信則名如是力如是作若入四十一地名如是因如是緣若至佛地名如是果如是報初三名本後三名末初後同是三德故言究竟等初位三德通惡通善通賢通聖通小通大通始通極雖在惡而不沈在善而不升在賢而不下在聖而不高雖在小不窄在大不寬在始非新在極非故故是不可思議不可得說止止絕言耳復次三德究竟等者十界相性權實開合差別若干以平等大慧如實觀之究竟皆等若迷此境即有六界相性名為世諦若解此境即有二乘相性名為真諦達此非迷非解即有菩薩佛果性相中道第一義諦若以此慧等於俗諦俗諦非迷等於真諦真諦非解非解非迷雙非迷解但名平等若雙照者權即是實實即是權雖二而不二亦名究竟等又權實不二之境若七種方便不能以不二之境唯有諸佛以不二智等不二境故言究竟等。",
        "translation": "Although there are countless numbers of these ten phrases, they are not eleven. Although there are many schools in one realm, there are not ten. For example, although the hell realm is locally endowed with the original nature of characteristics, it's also endowed with the original nature of characteristics of the animal realm and even the original nature of characteristics of the Buddha realm without any deficiency.",
        "source": "X30n0605_002:0668b19_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to reiterate this meaning and spoke a verse, saying.",
        "source": "X30n0605_002:0669b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌二初頌長行二初頌寄言歎二初合歎二佛二智二初頌諸佛二智。",
        "translation": "\"△Two verses and two hymns, the first praising the long practice and the second praising the two buddhas and their two kinds of cognition, and the first praising the buddhas and their two kinds of cognition.",
        "source": "X30n0605_002:0669b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世雄不可量諸天及世人一切眾生類無能知佛者。",
        "translation": "'The world's heroes, incalculable gods, humans, and all sentient beings are incapable of knowing the buddhas.'",
        "source": "X30n0605_002:0669b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兩行合歎二佛二智今初一句世雄者頌上諸佛智慧不可量者頌上甚深無量此頌諸佛實智也次三句頌上諸佛權智此有三異一上舉人又標法故云諸佛智慧今頌但頌人葢將人以美法故云世雄二者上文開歎今合歎以法別故須開以人總故須合三者上云一切二乘不知今言一切眾生類不知是則成乎三異。",
        "translation": "These two lines combine to praise the two kinds of wisdom of the two buddhas. The first line, Shixiong, praises the wisdom of the buddhas above, and the second line, Incalculable, praises the profound and immeasurable wisdom of the buddhas above.",
        "source": "X30n0605_002:0669b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌釋迦二智。",
        "translation": "△Two verses on the two kinds of wisdom of the Śākyas.",
        "source": "X30n0605_002:0669c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛力無所畏解脫諸三昧及佛諸餘法無能測量者。",
        "translation": "\"The Buddha's power, fearlessness, liberation, samādhi, and the Buddha's other teachings have no way to be measured.",
        "source": "X30n0605_002:0669c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛力下後一行頌歎釋迦二智佛者頌吾從成佛也此正頌實智力無畏等頌諸功德是頌權智餘法者即指化他之權是實智之餘助正頌上種種因緣也。",
        "translation": "The line after \"Buddha-power\" praises the Śākyamuni and the two buddhas, which praises our progress toward becoming buddhas. This is a verse that praises the true power, knowledge, fearlessness, and other verse virtues, which praises the expedient knowledge and the other dharmas, which refers to the expedient power to teach others and the true knowledge that helps to correctly praise the various causes and conditions above.",
        "source": "X30n0605_002:0669c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二合頌二佛釋歎結歎。",
        "translation": "△Two hymns praise the two buddhas, explaining and concluding the praise.",
        "source": "X30n0605_002:0669c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本從無數佛具足行諸道甚深微玅法難見難可了於無量億劫行此諸道已道場得成果我已悉知見。",
        "translation": "\"From the beginning, countless buddhas have fully practiced these paths, and their profound and subtle dharmas have been difficult to see and difficult to comprehend. I've fully known and seen the fruits of these paths once they were practiced for measureless millions of eons.",
        "source": "X30n0605_002:0669c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兩行合頌釋歎結歎本從無數佛具足行諸道此頌上諸佛釋歎佛曾親近百千諸佛盡行道法之文甚深微妙法頌上結歎實智成就甚深未曾有法難見難可了頌上結歎權智意趣難解也於無量億劫行此諸道已頌上釋釋迦知見波羅蜜皆已得具足之文其上二句舉因具足次下一句舉果具足我已悉知見一句頌上結釋迦二智如來知見廣大之文。",
        "translation": "These two lines together form a verse that explains and concludes, \"Originally, the paths were fully practiced by countless buddhas.\" The verse above explains that the buddhas praised the text, \"The Buddha has been intimate with a hundred thousand buddhas who have fully practiced the path, and the teaching is profound and subtle.\" The verse above concludes that the accomplishment of true wisdom is profound and unprecedented, and the teaching is difficult to see and difficult to comprehend.",
        "source": "X30n0605_002:0669c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌絕言歎五初頌不思議境。",
        "translation": "△Two verses cut off language and praise the five first verses for their inconceivable objects.",
        "source": "X30n0605_002:0669c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是大果報種種性相義。",
        "translation": "\"Thus are the great rewards of various natures and characteristics.",
        "source": "X30n0605_002:0669c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是大果報即頌不思議境但舉初後中間略可知義字兼頌究竟等。",
        "translation": "Thus are the great rewards of verse that praise inconceivable objects but cite the first and last, which are brief, understandable words that also praise the ultimate and so forth.",
        "source": "X30n0605_002:0669c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二追頌指絕言境。",
        "translation": "△Two further verses refer to the realm of absolute language.",
        "source": "X30n0605_002:0669c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我及十方佛乃能知是事。",
        "translation": "'I and the buddhas of the ten directions are able to know this thing.'",
        "source": "X30n0605_002:0670a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我及十方佛乃能知是事追頌取要言之佛悉成就也。",
        "translation": "I and the buddhas of the ten directions would be able to know these things, and the verse that follows takes the essential words from the buddhas and accomplishes them.",
        "source": "X30n0605_002:0670a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三追正頌絕言歎。",
        "translation": "△Three memorial verses refer to the cutting off of language and praise.",
        "source": "X30n0605_002:0670a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法不可示言辭相寂滅。",
        "translation": "This is a teaching that doesn't reveal the extinction of characteristics in words.",
        "source": "X30n0605_002:0670a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法不可示言詞相寂滅追頌止止不須說也實相非方所故不可示非言語道故言辭相寂滅。",
        "translation": "This is a teaching that can't be shown because the verbal aspect of words is tranquil ... chanting, stopping, and stopping needn't be explained; the true characteristic doesn't belong to a certain place; therefore, it can't be shown.",
        "source": "X30n0605_002:0670a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四揀不知之人八初總揀不入。",
        "translation": "△Four kinds of people who don't know are selected, and the first eight are generally selected not to enter.",
        "source": "X30n0605_002:0670a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸餘眾生類無有能得解。",
        "translation": "There are no other kinds of sentient beings who are capable of understanding them.",
        "source": "X30n0605_002:0670a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初總揀不入者即七方便也。",
        "translation": "The first one that generally selects those who don't enter is the seven methods.",
        "source": "X30n0605_002:0670a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二揀能入。",
        "translation": "The second is selecting those who can enter.",
        "source": "X30n0605_002:0670a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除諸菩薩眾信力堅固者。",
        "translation": "It's except for the bodhisattvas who have a strong faith.",
        "source": "X30n0605_002:0670a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除諸菩薩眾信力堅固者此揀能入也即圓教十信故言信力堅固者長行明究竟佛知頌中明初信知互舉耳。",
        "translation": "Except for the bodhisattvas who have a resolute faith, this is a selection of those who can enter, which are the ten beliefs of the perfect teaching. Therefore, when they say their faith is resolute, the long practice explains the ultimate Buddha-knowledge, and the verse explains the mutual enumeration of the first faith and knowledge.",
        "source": "X30n0605_002:0670a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三揀二乘不知。",
        "translation": "△Three kinds of unknowing on the part of the two vehicles.",
        "source": "X30n0605_002:0670a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛弟子眾曾供養諸佛一切漏已盡住是最後身如是諸人等其力所不堪。",
        "translation": "All the disciples of the Buddha who have made offerings to the buddhas and have ended all contaminants abide in this final body, such people are overwhelmed by their power.",
        "source": "X30n0605_002:0670a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛弟子眾乃至其力所不堪揀二乘不知也。",
        "translation": "Those disciples of the Buddha, even those whose powers are beyond their ability, don't know how to choose the two vehicles.",
        "source": "X30n0605_002:0670a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四舉身子不知。",
        "translation": "△Four raised the body of the child and didn't know it.",
        "source": "X30n0605_002:0670a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使滿世間皆如舍利弗盡思共度量不能測佛智。",
        "translation": "Suppose the whole world were like Śāriputra, and they all exhausted their common deliberation and couldn't fathom the Buddha's wisdom.",
        "source": "X30n0605_002:0670a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四行半初假使下一行舉身子不知盡思共度量者即極力竭智之謂。",
        "translation": "These four and a half lines begin with the line that says, \"Suppose the body doesn't know that [the Buddha's] wisdom is fully exhausted by shared deliberation.",
        "source": "X30n0605_002:0670a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五舉諸大弟子不知。",
        "translation": "△5. He raises the words \"the great disciples don't know.",
        "source": "X30n0605_002:0670a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使滿十方皆如舍利弗及餘諸弟子亦滿十方剎盡思共度量亦復不能知。",
        "translation": "It's true that even if the ten directions were filled like Śāriputra's and the other disciples' bases in the ten directions were filled with the shared measure of exhaustive thought, they wouldn't be able to know it.",
        "source": "X30n0605_002:0670a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六舉支佛不知。",
        "translation": "△Sixth, he raises the pratyekabuddhas who don't know.",
        "source": "X30n0605_002:0670a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辟支佛利智無漏最後身亦滿十方界其數如竹林斯等共一心於億無量劫欲思佛實智莫能知少分。",
        "translation": "The pratyekabuddhas' sharp, wise, and uncontaminated final body also fills the realms of the ten directions, and their number is as great as the number of bamboo groves and others who share the same single mind and desire to contemplate the Buddha's true wisdom for billions of immeasurable eons; none of them know even a small part of it.",
        "source": "X30n0605_002:0670a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△七舉發心菩薩不知。",
        "translation": "△Seven bodhisattvas who have raised their aspirations don't know it.",
        "source": "X30n0605_002:0670b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "新發意菩薩供養無數佛了達諸義趣又能善說法如稻麻竹葦充滿十方剎一心以妙智於恒河沙劫咸皆共思量不能知佛智。",
        "translation": "The newly enlightened bodhisattva makes offerings to countless buddhas, fully understands their destinies, and is able to skillfully expound the Dharma like rice, hemp, and bamboo reeds filling buddhas in ten directions with a single mind and marvelous knowledge that can't be known by the Buddha's knowledge when it's all considered together in an eon of incalculable duration.",
        "source": "X30n0605_002:0670b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行半有二意前兩行半舉發心菩薩不入發心語通或可指六度菩薩三僧祇未斷惑者名為發心或可指人天中攝得六度發心之語別擬通別等發心也。",
        "translation": "These three and a half lines have two meanings. The first two and a half lines refer to the arousal of the mind of a bodhisattva who doesn't enter into the arousal of the mind.",
        "source": "X30n0605_002:0670b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△八舉不退菩薩不知。",
        "translation": "△8. I don't know about the nonretrogressing bodhisattvas.",
        "source": "X30n0605_002:0670b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不退諸菩薩其數如恒沙一心共思求亦復不能知。",
        "translation": "The number of nonretrogressing bodhisattvas is like the sands of the Ganges, and even when they are pursued together in one mind, they can't be known.",
        "source": "X30n0605_002:0670b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次一行揀不退菩薩亦不知通教不退斷界內惑是故不知別理別教地前亦有證位不退行不退等亦所不知。",
        "translation": "The next line specifies that the nonretrogressing bodhisattvas also don't know that the liberal doctrine of nonretrogression ends the mental disturbances within the [three] realms and therefore don't know the specific principle that there's also a stage of realization, nonretrogression, practice, and nonretrogression before the differentiation stage.",
        "source": "X30n0605_002:0670b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五頌唯佛能知實相境。",
        "translation": "△With five verses, only the Buddha can know the true character of things.",
        "source": "X30n0605_002:0670b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又告舍利弗無漏不思議甚深微玅法我今已具得唯我知是相十方佛亦然。",
        "translation": "Again, he told Śāriputra, \"I have now fully attained the uncontaminated, inconceivable, and extremely profound dharma, and I alone know this aspect, as do the buddhas in ten directions.",
        "source": "X30n0605_002:0670b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行半頌上難解之法唯佛能知實相之境無漏不思議頌上結要舉權實所止之境甚深微妙法一句頌上第一希有難解之法我今已具得等三句頌上唯佛與佛乃能究盡此明諸佛道同同皆究竟故云唯我知是相十方佛亦然釋不思議者如如意珠無毫釐之有而能雨眾寶譬實相不生能生般若。",
        "translation": "In this line and a half of the verse, the most difficult thing to understand is that only the Buddha can know the sphere of reality, and the uncontaminated, inconceivable verse concludes with the essential point that the sphere of expedient and true containment is extremely profound and subtle, and in this line and a half of the verse, the most rare and difficult thing to understand is that I have now fully attained it.",
        "source": "X30n0605_002:0670b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二略開顯動執生疑二初明諸佛顯實三初明諸佛道同。",
        "translation": "△Two, briefly, we'll explain the manifestation of doubt arising from attachment, and two, first, we'll explain that the buddhas reveal the truth.",
        "source": "X30n0605_002:0670b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知諸佛語無異。",
        "translation": "Śāriputra should know that the words of the buddhas are not different.",
        "source": "X30n0605_002:0670b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行半明諸佛顯實諸佛語無異者此論諸佛化道是同。",
        "translation": "This first line and a half shows that the Buddhas reveal the truth and that the words of the Buddhas are not different.",
        "source": "X30n0605_002:0670c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二勸令生信。",
        "translation": "△Two, he encourages the growth of faith.",
        "source": "X30n0605_002:0670c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於佛所說法當生大信力。",
        "translation": "In the Buddha's teaching, you must give rise to the power of great faith.",
        "source": "X30n0605_002:0670c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三正顯真實。",
        "translation": "△Three is to correctly reveal the truth.",
        "source": "X30n0605_002:0670c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊法久後要當說真實。",
        "translation": "The Bhagavān will explain the reality of the teaching long after it's given.",
        "source": "X30n0605_002:0670c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是正顯實故云世尊法久後要當說真實此即顯真之謂所以動昔之執生今之疑故下文云將非魔作佛正由聞此語也佛既如實語勸信何事翻疑為防因疑起謗故須勸信耳。",
        "translation": "This is the correct way to reveal the truth, so it's said that the Bhagavān's teaching will be explained as true after a long time. This is the meaning of revealing the truth, which is to move past attachments and give rise to present doubts, so the following sentence says that it's precisely because of hearing this that non-Māra will become Buddha.",
        "source": "X30n0605_002:0670c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明釋迦開三三初正明開三。",
        "translation": "△Two, the Śākyamuni Buddha opened three. First, he correctly explained the opening three.",
        "source": "X30n0605_002:0670c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告諸聲聞眾及求緣覺乘我令脫苦縛逮得涅槃者。",
        "translation": "He told the śrāvakas and those seeking the pratyekabuddha vehicle that he would free them from the bonds of suffering and attain nirvāṇa.",
        "source": "X30n0605_002:0670c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兩行明釋迦開三文為三初一行是正明開三將明二乘昔證俱非故言逮得涅槃又解我令脫苦縛逮得涅槃者即擬六度菩薩乘何以知之若修六度行即免四趣縛未能入滅度當知三祇百劫乃得涅槃逮之言遠乃及耳又六度行前是度他故言我令脫苦縛後取無漏故言逮得涅槃此義推之知是六度乘也又下句云佛以方便力示以三乘教若不指此將何為三不應重數二乘為三乘也。",
        "translation": "The first line is a statement that correctly explains the opening three, which will explain that the two vehicles realized in the past were not both, so they said they had attained nirvāṇa and understood that I caused them to be freed from bondage to suffering and had attained nirvāṇa, which is intended to be the bodhisattva vehicle of the six perfections.",
        "source": "X30n0605_002:0670c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正斥三乘。",
        "translation": "△Two is a correct rejection of the three vehicles.",
        "source": "X30n0605_002:0670c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以方便力示以三乘教。",
        "translation": "By the power of skillful means, the Buddha demonstrated the teaching of the three vehicles.",
        "source": "X30n0605_002:0670c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆是虗偽。",
        "translation": "They are all hypocritical.",
        "source": "X30n0605_002:0670c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三出立三意。",
        "translation": "△Three sets forth three ideas.",
        "source": "X30n0605_002:0670c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生處處著引之令得出。",
        "translation": "Everywhere sentient beings are attracted to them, they're led to escape.",
        "source": "X30n0605_002:0670c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意是權引離諸苦故非為真實但是方便門耳。",
        "translation": "The intention is to lead them expediently away from suffering, so it's not true but simply a method.",
        "source": "X30n0605_002:0670c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二騰疑致請二初敘疑二初經家敘二初敘千二百疑。",
        "translation": "△Two rousing doubts and inviting requests, the first to describe doubts, and the second to describe the sūtras and the first to describe the 1,200 doubts.",
        "source": "X30n0605_002:0670c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾中有諸聲聞漏盡阿羅漢阿若憍陳如等千二百人。",
        "translation": "At the time, there were 1,200 śrāvakas, contaminants, arhats, Ājñāta-kauṇḍinya, and others in the crowd.",
        "source": "X30n0605_002:0671a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二敘四眾疑。",
        "translation": "△Two, they described four doubts.",
        "source": "X30n0605_002:0671a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及發聲聞辟支佛心比丘比丘尼優婆塞優婆夷。",
        "translation": "They were śrāvakas, pratyekabuddhas, monks, nuns, upāsaka, and upāsikabuddhas who had arisen the minds of the śrāvakas and pratyekabuddhas.",
        "source": "X30n0605_002:0671a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經家敘也騰疑致請由聞三偽一真故執動疑生然上斥三乘皆是方便今敘疑但在二乘者以其執重疑深是以偏舉若至下陳疑中即云求佛諸菩薩大數有八萬亦皆有疑故知三乘僉疑亦偏舉二乘耳。",
        "translation": "This is a recounting of the sūtras that also raises doubts and invites requests because of the three falsehoods and one truth, so their attachments are motivated by doubts.",
        "source": "X30n0605_002:0671a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正疑二初疑佛二智二初總疑二智。",
        "translation": "△Two kinds of correct doubt, two doubts about the Buddha and two kinds of wisdom, and two general doubts about the two kinds of wisdom in the beginning.",
        "source": "X30n0605_002:0671a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各作是念今者世尊何故慇懃稱歎方便。",
        "translation": "Each of them thinks, \"Why is the Bhagavān so diligent about praising the method?",
        "source": "X30n0605_002:0671a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故殷勤稱歎方便即是總疑權實二智。",
        "translation": "Why does he so earnestly praise skillful means? That's the general doubt about the two cognitions of expedient and true.",
        "source": "X30n0605_002:0671a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二別疑二智二初疑實智。",
        "translation": "△Two kinds of doubts about the two kinds of cognition, the first being doubts about the real cognition.",
        "source": "X30n0605_002:0671a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而作是言佛所得法甚深難解。",
        "translation": "He says, \"The teaching obtained by the Buddha is too profound to understand.",
        "source": "X30n0605_002:0671a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛所得法甚深難解是疑實智。",
        "translation": "This is the cognition of doubting the truth, which is that the teaching obtained by the Buddha is so profound and difficult to understand.",
        "source": "X30n0605_002:0671a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二疑權智。",
        "translation": "△Two doubts expedient cognition.",
        "source": "X30n0605_002:0671a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所言說意趣難知一切聲聞辟支佛所不能及。",
        "translation": "There's something said about the difficulty of knowing intentions that's beyond the reach of all śrāvakas and pratyekabuddhas.",
        "source": "X30n0605_002:0671a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有所言說意趣難知下是疑權智由聞諸佛語無異要當說真實從此生疑何者佛昔說三乘智慧同證不差但餘習有盡不盡耳今忽稱歎如來二智非我所及是故疑佛二智也。",
        "translation": "Here's the doubt about expedient cognition that arises from hearing that the words of the buddhas are not different from what's to be explained as true. Why did the Buddha say in the past that the wisdom of the three vehicles is equally realized, without distinction, but that there's an end to the remaining accumulation and not an end to it?",
        "source": "X30n0605_002:0671a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二疑己所得。",
        "translation": "△Two, they doubt what they've gained.",
        "source": "X30n0605_002:0671a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛說一解脫義我等亦得此法到於涅槃而今不知是義所趣。",
        "translation": "The Buddha teaches the meaning of one liberation, and we've also attained this teaching and arrived at nirvāṇa without knowing what it means.",
        "source": "X30n0605_002:0671a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聲聞人竊自疑念三乘聖道是真出要我修此理亦到涅槃今忽言皆是方便未知何者真實故言不知是義所趣此從上斥三為偽而生是疑。",
        "translation": "śrāvakas secretly doubt that the noble path of the three vehicles is genuine, that I've cultivated this principle and arrived at nirvāṇa, and now they suddenly say it's all a method and don't know what's real, so they say they don't know what it's about.",
        "source": "X30n0605_002:0671b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二請決三初初請二初請二初長行二初陳疑。",
        "translation": "△Two requests for resolution were made in the first instance, two requests in the first instance, two long lines in the first instance, and two statements of doubt in the first instance.",
        "source": "X30n0605_002:0671b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗知四眾心疑自亦未了而白佛言世尊何因何緣慇懃稱歎諸佛第一方便甚深微妙難解之法我自昔來未曾從佛聞如是說今者四眾咸皆有疑。",
        "translation": "Knowing that the minds of the four people had doubts, Śāriputra himself did not understand them and said to the Buddha, \"Bhagavān, what is the reason and cause for this solicitude to praise the first Buddha for his profound, subtle, and difficult-to-understand teaching? I've never heard such a teaching from the Buddha since the distant past, and now the four people all have doubts.",
        "source": "X30n0605_002:0671b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二陳請。",
        "translation": "Second, they asked.",
        "source": "X30n0605_002:0671b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願世尊敷演斯事世尊何故慇懃稱歎甚深微妙難解之法。",
        "translation": "\"May the Bhagavān explain this matter and why does the Bhagavān praise with care the teaching that's so profound, subtle, and difficult to understand?",
        "source": "X30n0605_002:0671b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此正請中有三請二止之文就前為三止瑤龍二師云初止為理深難解故初請為自他求決次止為驚疑不信次請為久植必解後止為必謗墮惡後請為利根得益天台云佛預知三周得益前後不俱是故三抑俟其三請。",
        "translation": "In this proper invitation, there are three requests and two requests in the text. The previous three requests were made by Yulong and the two masters, saying that the first request was for self and others to seek a resolution, the second request was for those who were doubtful and unbelieving, the second request was for those who had planted themselves long ago and would surely understand, the latter request was for those who would denigrate and fall into evil, and the latter request was for those who would benefit their faculties. Tiantai says that the Buddha foreknew that the three circumambulations would benefit both the prior and subsequent ones.",
        "source": "X30n0605_002:0671b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗欲重宣此義而說偈言。",
        "translation": "Śāriputra then wanted to reiterate this teaching and spoke a verse, saying.",
        "source": "X30n0605_002:0671b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌六初頌疑實智。",
        "translation": "\"△Two verses and six hymns begin with a verse about the cognition of doubt as reality.",
        "source": "X30n0605_002:0671b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慧日大聖尊久乃說是法。",
        "translation": "After a long time, the great sage Sun of Wisdom explained this teaching.",
        "source": "X30n0605_002:0671b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此偈有十一行文為六初二句頌疑實智。",
        "translation": "This verse has eleven lines, and there are six first two verses that praise the wisdom of doubts about the truth.",
        "source": "X30n0605_002:0671b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌疑權智。",
        "translation": "△Two verses praise the wisdom of doubts about rights.",
        "source": "X30n0605_002:0671b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自說得如是力無畏三昧禪定解脫等不可思議法道場所得法無能發問者我意難可測亦無能問者無問而自說稱歎所行道智慧甚微妙諸佛之所得。",
        "translation": "He explains that he has attained such powers, fearlessness, concentration, meditation, liberation, and other unfathomable things that are attained in the path, that there's no one who can ask questions, that my thoughts are unfathomable, and that there's no one who can ask questions but explains it himself, praising the subtlety of the wisdom of the path he's practicing and the attainments of the buddhas.",
        "source": "X30n0605_002:0671b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自說得如是下頌疑權智。",
        "translation": "He explains that he has attained this, and then he praises the wisdom of the right to doubt.",
        "source": "X30n0605_002:0671c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明三乘四眾疑。",
        "translation": "△Three explanations of the three vehicles and four groups of doubters.",
        "source": "X30n0605_002:0671c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏諸羅漢及求涅槃者今皆墮疑網佛何故說是其求緣覺者比丘比丘尼諸天龍鬼神及乾闥婆等相視懷猶豫瞻仰兩足尊是事為云何願佛為解說。",
        "translation": "Why do the untainted arhats and seekers of nirvāṇa all fall into the net of doubt? Why does the Buddha say that these seekers of pratyekabuddha, monks, nuns, gods, dragons, ghosts, and gandharvas look at each other with uncertainty and look up to the two-legged honored one? What is this, and may the Buddha explain it for them?",
        "source": "X30n0605_002:0671c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無漏下有三行明三乘四眾有疑初句明聲聞次句稱及求涅槃者即是明六度菩薩何以得知上云逮得涅槃者此中稱及及者此菩薩自求涅槃又能及他故異二乘知是菩薩也後二行明緣覺相視懷猶預者不能果於臧否進退也兩足尊者謂福慧二種莊嚴悉皆滿足為世間尊也。",
        "translation": "The first phrase describes the śrāvakas, the second phrase describes those who seek nirvāṇa, which is to explain how the bodhisattvas who know the six perfections above have attained nirvāṇa, and this one describes those who seek nirvāṇa for themselves and are able to reach others.",
        "source": "X30n0605_002:0671c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四明身子疑。",
        "translation": "△4. He clarifies the body of the son of Dignāga's doubt.",
        "source": "X30n0605_002:0671c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸聲聞眾佛說我第一我今自於智疑惑不能了為是究竟法為是所行道。",
        "translation": "Among the śrāvakas and buddhas who taught that I'm the best, I now have doubts about my own knowledge and can't understand whether this is the ultimate teaching or the path that's being practiced.",
        "source": "X30n0605_002:0671c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五明佛子疑。",
        "translation": "△5. Understanding the doubts of the son of the Buddha.",
        "source": "X30n0605_002:0671c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛口所生子合掌瞻仰待願出微玅音時為如實說。",
        "translation": "The son of the Buddha born from his mouth joins his palms, looks up, and waits until he wishes to make a subtle, eloquent sound to explain it as it really is.",
        "source": "X30n0605_002:0671c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六總明同疑請。",
        "translation": "△Sixth, he summarizes the same doubts and requests.",
        "source": "X30n0605_002:0671c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天龍神等其數如恒沙求佛諸菩薩大數有八萬又諸萬億國轉輪聖王至合掌以敬心欲聞具足道。",
        "translation": "The gods, dragons, and other spirits whose number is like the sands of the Ganges seek the Buddha, and the bodhisattvas, whose number is 80,000 and whose number is the turn-turning sage king of a trillion countries, join their palms in reverence and want to hear about the perfect path.",
        "source": "X30n0605_002:0671c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其數如恒沙即是言恒河沙之多恒河亦云殑伽河此翻天堂來此河從無熱惱池東畔象口流出入于大海其沙細如麵以手掬之則沙隨水走因而喻之。",
        "translation": "Their number is like the sands of the Ganges, which is to say that there's a lot of sand in the Ganges River. The Ganges River is also called the Ganges River, which is translated as the River of the Sands of Heaven.",
        "source": "X30n0605_002:0671c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二第二止。",
        "translation": "△Two, the second stop.",
        "source": "X30n0605_002:0671c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告舍利弗止止不須復說若說是事一切世間諸天及人皆當驚疑。",
        "translation": "It was then that the Buddha told Śāriputra to stop. Stop! It's not necessary to say this again. If he said this, the gods and humans of the world would be astonished.",
        "source": "X30n0605_002:0671c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二第二請二初請。",
        "translation": "△Two, second invitation. Two, first invitation.",
        "source": "X30n0605_002:0672a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗重白佛言世尊惟願說之惟願說之所以者何是會無數百千萬億阿僧祇眾生曾見諸佛諸根猛利智慧明了聞佛所說則能敬信爾時舍利弗欲重宣此義而說偈言。",
        "translation": "Śāriputra repeatedly said to the Buddha, \"Bhagavān, may I explain it? May I explain it? What is the reason why there are countless hundreds of thousands of millions of incalculable sentient beings who have seen the buddhas and whose faculties are sharp, whose wisdom is clear, and whose faith is honored when they hear what the Buddha teaches?\" Śāriputra then wanted to reiterate this meaning and spoke in verse, saying.",
        "source": "X30n0605_002:0672a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法王無上尊唯說願勿慮是會無量眾有能敬信者。",
        "translation": "\"The Dharma king, the unsurpassed one, only teaches this, wishing to spare no thought for the countless multitudes who will be able to respect and believe in what he teaches.",
        "source": "X30n0605_002:0672a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身子再請。",
        "translation": "The body of the prince then repeated his invitation.",
        "source": "X30n0605_002:0672a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二第三止。",
        "translation": "△Two, third, stop.",
        "source": "X30n0605_002:0672a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛復止舍利弗若說是事一切世間天人阿脩羅皆當驚疑增上慢比丘將墜於大坑爾時世尊重說偈言。",
        "translation": "The Buddha further stopped Śāriputra because if he said this, all the gods and humans of the world and the asuras would be alarmed and doubtful, and the arrogant monk would fall into a great pit.",
        "source": "X30n0605_002:0672a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止止不須說我法妙難思諸增上慢者聞必不敬信。",
        "translation": "\"Stop! Stop! There's no need to explain the wonders of my teaching, for those who are conceited and arrogant will hear it and not respect and believe it.",
        "source": "X30n0605_002:0672a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三第三請。",
        "translation": "The third invitation.",
        "source": "X30n0605_002:0672a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時舍利弗重白佛言世尊惟願說之惟願說之今此會中如我等比百千萬億世世已曾從佛受化如此人等必能敬信長夜安隱多所饒益爾時舍利弗欲重宣此義而說偈言。",
        "translation": "Śāriputra then repeatedly said to the Buddha, \"Bhagavān, I wish to teach it. I wish to teach it. Now, in this assembly, there are hundreds of thousands of trillions of people like us who have been trained by the Buddha from generation to generation.",
        "source": "X30n0605_002:0672a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無上兩足尊願說第一法我為佛長子惟垂分別說是會無量眾能敬信此法佛已曾世世教化如是等皆一心合掌欲聽受佛語我等千二百及餘求佛者願為此眾等惟垂分別說是等聞此法則生大歡喜。",
        "translation": "\"The unsurpassed, two-legged one vows to teach the first teaching. I am the eldest son of the Buddha, but I beg you to discern and teach it to this congregation of measureless people who can respect and believe in this teaching. The Buddha has taught and instructed such people from generation to generation, and they all join their palms with one heart and want to hear and accept the Buddha's words. I, the 1,200 and the rest of you who seek the Buddha, wish to discern and teach this teaching for this congregation, so that when they hear it, they'll become very happy.",
        "source": "X30n0605_002:0672a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "願說第一法者融師云由前斥三乘是偽又聞諸佛法久後要當說真實在二乘邊未知法華是實但據斥三非真三外必更有法故云願說第一法且法既深玄理須抑止在身子懇求誠切請至于三然上聖崇法之規而猶若是況下凡而可忽耶。",
        "translation": "Wishing to teach the first dharma, Master Rong said that since the previous denunciation of the three vehicles was counterfeit and after hearing the Buddha's teachings for a long time, he wanted to teach the truth.",
        "source": "X30n0605_002:0672a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二廣開三顯一三初法說二譬說三因緣說初文又五初正明法說二身子領解三如來述成四授記五眾喜初文又二初長行二偈頌初文又三初許說三初順許。",
        "translation": "The first three are explained by the Dharma, the second is explained by an example, and the third is explained by a cause and condition.",
        "source": "X30n0605_002:0672b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊告舍利弗汝已慇懃三請豈得不說。",
        "translation": "It was then that the Bhagavān addressed Śāriputra and asked him three times, \"How could you not explain this after you've so kindly requested it?",
        "source": "X30n0605_002:0672b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二誡許。",
        "translation": "△Two admonitions were given.",
        "source": "X30n0605_002:0672b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今諦聽善思念之吾當為汝分別解說。",
        "translation": "'Now, listen closely, well consider it, and I will explain it to you in detail.'",
        "source": "X30n0605_002:0672b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦聽是聞慧善思是思慧念之是修慧大經明四善法為涅槃因一善知識謂如來餘則可解。",
        "translation": "\"To listen closely is the wisdom of hearing, and to well-consider it is the wisdom of contemplating and mindfulness is the wisdom of cultivating. The great sūtras explain that four good qualities are the causes of nirvāṇa and that one good teacher is the Tathāgata. The rest can be understood.",
        "source": "X30n0605_002:0672b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三揀許。",
        "translation": "△There are three kinds of approval.",
        "source": "X30n0605_002:0672b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "說此語時會中有比丘比丘尼優婆塞優婆夷五千人等即從座起禮佛而退所以者何此輩罪根深重及增上慢未得謂得未證謂證有如此失是以不住世尊默然而不制止爾時佛告舍利弗我今此眾無復枝葉純有貞實舍利弗如是增上慢人退亦佳矣汝今善聽當為汝說。",
        "translation": "When he spoke these words, some monks, nuns, upāsaka, upāsikā, and 5,000 others rose from their seats, paid homage to the Buddha, and withdrew. Why is it that these people have deep roots of sin and arrogance, and they say they have not attained, have not realized, and have realized such a failure? The Bhagavān then remained silent and didn't stop them.",
        "source": "X30n0605_002:0672b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五千在座所以如來三止今將許說密以威神遣去故名揀眾罪根深重者五濁障多名罪重執小翳大名根深未得謂得名上慢以其未得三果未證無學有如此失謂障執慢三種之失也而不制止者上聞開三顯一言略義隱猶未生謗足作繫珠因緣去則有益若聞廣開三顯一乖情起謗住則有損是故不制止也此眾無復枝葉者枝葉細末不任器用此等執方便之方便於大非器如大品云攀拊枝葉棄於根本是人為不黠即是此義退亦佳矣既以小自翳復妨他大光今退無謗法之愆復無障他之過故云佳矣上枝葉未去故如來三止今則貞實願聞故身子四請師弟鑒機非徒靳固問佛大慈悲何不神力使其住而不聞如華嚴聾啞何不增狀毒皷如喜根勝意答各有所以須知華嚴末席始開於漸未破小執故在座而隔今諸佛法久後要當說真實正欲滅化破菴宜須揀遣若去住俱謗宜如喜根強說今去則有益那忽令住住則有損那忽不遣喜根以慈故強說如來以悲故發遣問五千在座尚不蒙益去有何益答此非當機是結緣人耳已如上說昔大通佛時亦有無量眾生心生疑惑世世與師俱生今皆得度此人亦爾說大經時萬五千億人於是經中不生信心是人於未來亦當生信例此益在不久光明云時閻浮提中有二種人一者深信大乘方等二者毀呰不生信樂亦斯例也汝今善聽即是結許。",
        "translation": "The five thousand people present at the lecture were therefore Tathāgata's three cessations and now he will permit the esoteric teaching to be dispelled by authoritative power, so he's called a select group of people with deep and heavy roots of guilt.",
        "source": "X30n0605_002:0672b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二受旨。",
        "translation": "△Two kinds of people receive the teaching.",
        "source": "X30n0605_002:0672c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗言唯然世尊願樂欲聞。",
        "translation": "Śāriputra said, \"Yes, Bhagavān, I'd like to hear about it.",
        "source": "X30n0605_002:0672c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言受旨者即遵承稟命之謂唯然如禮記曲禮篇云父召無諾先生召無諾唯而起鄭玄註云應辭耳唯恭於諾也。",
        "translation": "Accepting the teaching means to obey the order, which is called 'yes,' as in the Book of the Ritual of the Qu Lai, where it says, \"The father summons the promiseless, the sir summons the promiseless, and yes, he rises,\" and Zheng Xuan comments that he should resign his ears and respect the promise.",
        "source": "X30n0605_002:0672c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三正說二初總明諸佛章二釋迦章初文又二初總明諸佛章二列三世佛章初文又四王初歎法希有。",
        "translation": "△Three correct explanations of the first two, the first summarizing the buddhas and the second the initial text of the Śākyamuni chapter, and the first two summarizing the buddhas and the second listing the three worldly buddhas, and the initial text of the four kings, the first praising the rarity of the Dharma.",
        "source": "X30n0605_002:0672c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗如是妙法諸佛如來時乃說之如優曇鉢華時一現耳。",
        "translation": "The Buddha told Śāriputra that such wonderful things are taught by buddhas and tathāgatas as a single appearance of the udumbara flower.",
        "source": "X30n0605_002:0673a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此則法譬雙歎時乃說之者以諸佛同出五濁必前開三後顯一實如今世尊四十餘年始顯真實久久稀疎故言時乃說之久不說者為人不堪故時未至故五千未遣故今人已堪其時已至五千已去故知決定說大乘故言時乃說之優曇華者此言靈瑞三千年一現現則金輪王出此表三乘調熟已後方說玅法授法王記。",
        "translation": "This is an analogy of the Dharma that's both praised and explained at the right time because all buddhas who share the same five turbidities must first unveil three and then reveal one reality. Now, the Bhagavān has only been revealing the reality for more than 40 years, so he says he explains it at the right time because it hasn't been explained for a long time.",
        "source": "X30n0605_002:0673a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二說無虗妄。",
        "translation": "△Two explanations are not false.",
        "source": "X30n0605_002:0673a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗汝等當信佛之所說言不虗妄。",
        "translation": "Śāriputra, you must believe that what the Buddha teaches is not false.",
        "source": "X30n0605_002:0673a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等當信者勸信無虗妄也此理至深理與昔異此言至妙言與昔反此行至普行與昔乖此人至勝勝於昔劣還指客作四種之麤而今皆妙恐物生謗故勸信也。",
        "translation": "Those of you who should believe it are encouraged to believe that it's not false. This principle is the deepest principle that's different from the past, this speech is the most subtle speech that's contrary to the past, this practice is the most universal practice that's at odds with the past, and this person is superior to the former and inferior.",
        "source": "X30n0605_002:0673a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三開方便三初開。",
        "translation": "△Three Explanations of Practice Three First, he explains.",
        "source": "X30n0605_002:0673a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗諸佛隨宜說法意趣難解。",
        "translation": "\"Śāriputra, the buddhas teach according to their abilities, and their intentions are difficult to understand.",
        "source": "X30n0605_002:0673a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初明諸佛隨三種機宜說方便故云隨宜而佛意在實物莫能解故言意趣難解。",
        "translation": "The first explains that the buddhas teach according to the three kinds of skillful means, so it's called according to the appropriate means.",
        "source": "X30n0605_002:0673a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋。",
        "translation": "△Two explanations.",
        "source": "X30n0605_002:0673a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何我以無數方便種種因緣譬喻言辭演說諸法。",
        "translation": "\"Why is it that I explain the teachings with countless skillful means, various causes, conditions, metaphors, words, and explanations of the Dharma?",
        "source": "X30n0605_002:0673a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何即釋出其意舉今佛之權能釋諸佛之方便因巧慧同故故借此釋彼我以無數方便者諸佛開權亦如我也。",
        "translation": "Why is that? It's an explanation that reveals the meaning of the power of the present Buddha to explain the methods of other buddhas because their skills and wisdom are the same, so I use this to explain that I use countless methods and that the buddhas who open their powers are also like me.",
        "source": "X30n0605_002:0673a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三結　四示真實五初標勝人法。",
        "translation": "△There are three conclusions, four indications of the true reality, and five initial indications of the superior human factors.",
        "source": "X30n0605_002:0673a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法非思量分別之所能解唯有諸佛乃能知之。",
        "translation": "'This is a teaching that can't be understood by contemplating and discriminating. Only the buddhas can know it.'",
        "source": "X30n0605_002:0673b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法非思量者此有兩義或作結開權或正作顯實若結開權者佛意難知唯佛與佛乃能解了其稟教者謂三諸佛知唯一耳若作顯實即屬後文標人法者舉無分別法唯是佛所知佛以無分別智解知無分別法即是顯實也。",
        "translation": "If it's a statement that the Buddha's intention is difficult to know, only the Buddha and the buddhas can understand it. If it's a statement that the three buddhas know it, then it belongs to the latter part of the teaching.",
        "source": "X30n0605_002:0673b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二標出世意。",
        "translation": "△Two, it's called the supramundane meaning.",
        "source": "X30n0605_002:0673b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何諸佛世尊唯以一大事因緣故出現於世。",
        "translation": "Why is that? The only reason the world-honored buddhas appeared in the world was because of one great cause.",
        "source": "X30n0605_002:0673b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯以一大事者唯者獨也應知一大有二意初總釋次分字釋初總釋者諸佛覺如實之相乘此實道出應於世秪令眾生得此實相唯為此事出現於世曾無他事除諸法實相外餘皆名魔事次分字釋者一則一實相非五非三非七非九故言一也其性廣博博於五三七九故名為大是諸佛出世之儀式故名為事眾生有機感佛故名為因佛乘機而應故名為緣是為出世之本意也而今開三者為一弄引如人欲取先當與之雖說種種道其實為一乘即此之義記云非五七九等者以三五等皆是方便故皆云非三藏三乘加人天五也加通教二乘七也加通別菩薩九也。",
        "translation": "The first general explanation is that the buddhas realize the true character of things and ride this true path to appear in the world because it causes sentient beings to attain this true character.",
        "source": "X30n0605_002:0673b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三重標。",
        "translation": "△Triple label.",
        "source": "X30n0605_002:0673b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗云何名諸佛世尊唯以一大事因緣故出現於世。",
        "translation": "\"Śāriputra, what do you call the buddhas and world-honored ones who appear in the world only because of one major cause and condition?",
        "source": "X30n0605_002:0673b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言重標者將欲分別更重提起為解釋之端又此大事佛所尊重如釋論中明父王欲多聞太子名數數說之無有厭足應知此法希奇所以如來四十餘年祕而不說今將顯揚豈得率爾於是殷勤再四提撕生眾欽渴使彼誠心肅仰良在斯焉。",
        "translation": "This is an important matter that the Buddha respects, as explained in the Śāriputra-śāstra treatise, in which it's explained repeatedly that the father wants to hear more about the prince's name, and he explains it without tire.",
        "source": "X30n0605_002:0673b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四正釋四初理一二初釋。",
        "translation": "△Four correct explanations, four first principles, and one or two first explanations.",
        "source": "X30n0605_002:0673c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊欲令眾生開佛知見使得清淨故出現於世欲示眾生佛之知見故出現於世欲令眾生悟佛知見故出現於世欲令眾生入佛知見道故出現於世。",
        "translation": "The world-honored buddhas appear in the world because they want to cause sentient beings to awaken to the Buddha's vision and make it pure. They appear in the world because they want to show sentient beings the Buddha's vision.",
        "source": "X30n0605_002:0673c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此釋理一復為四意一約四位二約四智三約四門四約觀心一約四位者四諦境不可知見約於智眼乃能知見應知二智四眼不能知見唯一切種智佛眼則能知見經云欲令眾生開佛知見則不論佛果自知自見若偏語佛果即失眾生若語眾生則無佛知見故不可偏取且三教行人雖是眾生未有佛眼佛智故不能知見實相今圓教四位亦是眾生又分得佛眼佛智則眾生義成智見義亦成故寄此四位以釋理一如瑞相中天雨四華表於萬善同歸得入四位乘四位華以趣佛果故約位顯理也開者即是十住初破無明開如來藏見實相理何者性德之理而為通別兩惑之所染著難可了如故初心能圓信圓伏而未能斷不名為開若內加觀行外藉法雨資助破通別惑藏顯出真修真性知見朗然開發如日出闇滅眼目有用故名為開緣修破惑故名使得清淨仁王云入理般若名為住住於十住小白華位也示者惑障既除知見體顯體備萬德法界眾德顯示分明故名為示即是十行大白華位也悟者障除體顯法界行明事理融通更無二趣攝大乘師云如理智如量智今理量不二故名為悟即十迴向小赤華位也入者事理既融自在無礙自在流注任運從阿到茶入薩婆若海如攝大乘師云如理如量通達自在如量知見能持眾德如理知見能遮諸惑即是十地大赤華位也然圓道玅位一位之中即具四十一地功德祇開即具示悟入等更非異心但如理知見無有分別淺深之相欲顯如量知見故分別四位耳發心畢竟二不別如是二心前心難既云難易即知初心與畢竟心應有明晦淺深之別猶如月體初後俱圓故有朔望之殊須知四位知見皆明照實相而說開入之異次約四智者今欲以圓教四智對於四位不如般若中通教釋也一道慧謂見道實性實性中得開佛知見二道種慧知十法界諸道種別解惑之相一一皆示佛知見三一切智知一切法一相寂滅寂滅即悟佛知見四一切種智知一切法一相寂滅相種種行類相貌皆識即入佛知見又道慧如理名開道慧如量名示一切智理量不二稱悟一切種智理量雙照為入此亦約實理無淺深中而淺深分別也三約圓教四門橫釋四句此如空門一空一切空即開佛知見有門一有一切有即示佛知見亦空亦有門一切亦空亦有即悟佛知見非空非有門一切非空非有即入佛知見能通則四所通則一開示悟入是能通之門所知所見是所通之理四約觀心釋觀於心性三諦之理不可思議此觀明靜名為開雖不可思議而能分別空假中心宛然無濫名為示空假中心即三而一即一而三名為悟又空假中心非空假中而齊照空假中名為入是為一心三觀而分開示悟入之殊也所以四種釋者當知見理由位位立由智智發由門門通由觀觀故則門通門通故智成智成故位立位立故見理見理故名為理一。",
        "translation": "The four stages of the perfect teaching are also sentient beings, and when the Buddha's eyes and Buddha's wisdom are attained, the meaning of sentient beings is formed, and the meaning of wisdom and views is formed. The four stages of the perfect teaching are explained in terms of the principle as it is in the auspicious sign of the heavenly rain of the four flowers, which shows that all good things come together to enter the four stages and ride the four stages of the flowers in order to reach the Buddha's fruition. The opening is the principle of the ten abodes, which first refutes ignorance and opens the tathāgatagarbha to see the true character of the principle.",
        "source": "X30n0605_002:0673c08_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△二結成。",
        "translation": "△Two conclusions are formed.",
        "source": "X30n0605_002:0674b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗是為諸佛唯以一大事因緣故出現於世。",
        "translation": "Śāriputra, these are buddhas who appeared in the world only because of one great cause and condition.",
        "source": "X30n0605_002:0674b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是結成理一。",
        "translation": "This is the accomplishment of the principle of oneness.",
        "source": "X30n0605_002:0674b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二人一。",
        "translation": "△Two are one.",
        "source": "X30n0605_002:0674b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告舍利弗諸佛如來但教化菩薩。",
        "translation": "The Buddha told Śāriputra that the buddhas and tathāgatas only teach and transform bodhisattvas.",
        "source": "X30n0605_002:0674b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但教化菩薩者若就昔方便為教化三乘理實而言但化菩薩如彼窮子自謂客作賤人長者所觀實為己子即是人一也。",
        "translation": "If someone who only teaches bodhisattvas speaks about the principle and reality of the past teaching of the three vehicles with skillful means but only teaches bodhisattvas, then that poor son might call himself a guest, a humble person, and the elder might observe that he's really his own son, which is the oneness of people.",
        "source": "X30n0605_002:0674b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三行一。",
        "translation": "△The three practices are one.",
        "source": "X30n0605_002:0674b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有所作常為一事唯以佛之知見示悟眾生。",
        "translation": "Whatever is created is always one thing, and it's only by the Buddha's knowledge and vision that he shows and enlightens sentient beings.",
        "source": "X30n0605_002:0674b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有所作者諸三乘眾行名之為諸為圓故諸即是一事此行何所至到唯趣佛之知見即是行一意也。",
        "translation": "All the activities of the three vehicles that have been created are called \"activities\" because they are perfect, which is one thing.",
        "source": "X30n0605_002:0674b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四教一。",
        "translation": "△The four teachings are one.",
        "source": "X30n0605_002:0674b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗如來但以一佛乘故為眾生說法無有餘乘若二若三。",
        "translation": "Śāriputra, the Tathāgata teaches the Dharma for sentient beings simply because it's the One Buddha Vehicle; there are no other vehicles, whether two or three.",
        "source": "X30n0605_002:0674b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以一佛乘者圓頓之教名一佛乘故序品云說大乘經即是教義也自別教已去皆名有餘之說即不了義非佛一乘今言但以一佛乘者純說佛法圓教乘也無餘乘者無別教帶方便有餘之說無二者無般若中之帶二無三者無方等中所對之三也如此二三皆無況三藏中之三耶。",
        "translation": "The one-but-one-buddha vehicle is called the one-buddha vehicle because the preface says that teaching the meaning of the scriptures of the great vehicle is called teaching with remainder from the secular teaching onward, which doesn't get the meaning of the one-buddha vehicle.",
        "source": "X30n0605_002:0674b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五總結法同。",
        "translation": "△The five summary teachings are the same.",
        "source": "X30n0605_002:0674c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗一切十方諸佛法亦如是。",
        "translation": "Śāriputra, so are all the buddha-teachings in the ten directions.",
        "source": "X30n0605_002:0674c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二三世佛章三初過去佛二初開權。",
        "translation": "△Two sets of three worldly buddhas are discussed, beginning with the buddhas of the past and beginning with the provisional ones.",
        "source": "X30n0605_002:0674c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗過去諸佛以無量無數方便種種因緣譬喻言辭而為眾生演說諸法。",
        "translation": "Śāriputra, the buddhas of the past explained the Dharma for sentient beings using measureless and countless methods, various causes, metaphors, and words.",
        "source": "X30n0605_002:0674c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二顯實。",
        "translation": "Second, they revealed the truth.",
        "source": "X30n0605_002:0674c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法皆為一佛乘故是諸眾生從諸佛聞法究竟皆得一切種智。",
        "translation": "Because these things are all part of the One Buddha Vehicle, sentient beings who hear the Dharma from the buddhas will ultimately attain omniscience.",
        "source": "X30n0605_002:0674c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法皆為一佛乘故明顯實也例上一佛乘即是教一從諸佛聞法是誰聞於法法被眾生兼得人一究竟皆得一切種智種智所知即是理一能知即是行一雖不次第四一兼足。",
        "translation": "For example, the above example, the one Buddha vehicle is the teaching, and the one who hears the Dharma from the buddhas is the one who hears the Dharma and attains both sentient beings and people, and the one who attains all kinds of cognition in the end.",
        "source": "X30n0605_002:0674c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二未來佛二初開權。",
        "translation": "△Two future buddhas: First, there's the opening right.",
        "source": "X30n0605_002:0674c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗未來諸佛當出於世亦以無量無數方便種種因緣譬喻言詞而為眾生演說諸法。",
        "translation": "Śāriputra, the buddhas of the future will appear in the world and explain the Dharma for sentient beings using measureless and countless methods, various causes, metaphors, and words.",
        "source": "X30n0605_002:0674c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如文可解。",
        "translation": "That's understandable, as the text explains.",
        "source": "X30n0605_002:0674c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二顯實。",
        "translation": "△Two, it shows the truth.",
        "source": "X30n0605_002:0674c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法皆為一佛乘故是諸眾生從佛聞法究竟皆得一切種智。",
        "translation": "Because these things are all part of the one Buddha vehicle, all sentient beings who hear the Dharma from the Buddha will ultimately attain omniscience.'",
        "source": "X30n0605_002:0674c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如文可解。",
        "translation": "This is explained as in the text.",
        "source": "X30n0605_002:0674c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三現在章三初標出世意。",
        "translation": "△Three manifestations chapter three begins by indicating the meaning of world-transcendence.",
        "source": "X30n0605_002:0674c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗現在十方無量百千萬億佛土中諸佛世尊多所饒益安樂眾生。",
        "translation": "Śāriputra is present in measureless hundreds of thousands of millions of Buddha-lands in the ten directions where the buddhas and world-honored ones often enrich and bring happiness to sentient beings.",
        "source": "X30n0605_002:0675a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "例如諸佛章中唯以一大事因緣出現於世此亦如是唯為饒益安樂眾生故而出於世也。",
        "translation": "For example, in the chapter on buddhas, there's only one great cause and condition that makes them appear in the world, and this is likewise the only reason they appear in the world is to benefit and comfort sentient beings.",
        "source": "X30n0605_002:0675a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二開權。",
        "translation": "△Two, it's a statement of authority.",
        "source": "X30n0605_002:0675a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸佛亦以無量無數方便種種因緣譬喻言詞而為眾生演說諸法。",
        "translation": "These buddhas also explain the Dharma for sentient beings using measureless and countless skillful means, various causes, metaphors, and words.",
        "source": "X30n0605_002:0675a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三顯實二初別明現在教一行一。",
        "translation": "△There are two ways to reveal the truth. First, they separately explain that the present teaching is one line.",
        "source": "X30n0605_002:0675a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法皆為一佛乘故是諸眾生從佛聞法究竟皆得一切種智。",
        "translation": "Because these things are all the single Buddha vehicle, all sentient beings who hear the Dharma from the Buddha will ultimately attain omniscience.",
        "source": "X30n0605_002:0675a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二總明三世人一理一。",
        "translation": "△Two, the general explanation is that the three worlds are one in person and one in principle.",
        "source": "X30n0605_002:0675a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗是諸佛但教化菩薩欲以佛之知見示眾生故欲以佛之知見悟眾生故欲令眾生入佛知見故。",
        "translation": "Śāriputra is a buddha who wants to teach bodhisattvas in order to show sentient beings the Buddha's knowledge and views and wants to enlighten sentient beings with the Buddha's knowledge and views in order to cause sentient beings to enter the Buddha's knowledge and views.",
        "source": "X30n0605_002:0675a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是開權顯實之文文具四一其義可見記云現在佛章從初即是開權顯實從舍利弗是諸佛下即當總文故前料揀中云三世佛章各明教行後總明人理凖此應先開章云先別次總今不先開者由下總文中既無開權之總唯有顯實一文故對三世各有權實以故總別不便故也故合在現在佛章中共成文足故云文具也。",
        "translation": "This is the text of opening the provisional and revealing the real stationery, and its meaning can be seen from the explanation that the present Buddha Chapter begins with the opening of the provisional and revealing the real.",
        "source": "X30n0605_002:0675a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋迦章五初開方便權。",
        "translation": "△Two Śākyamuni chapters and five preliminary chapters reveal the expedient power.",
        "source": "X30n0605_002:0675a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗我今亦復如是知諸眾生有種種欲深心所著隨其本性以種種因緣譬喻言詞方便力而為說法。",
        "translation": "\"Śāriputra, I also now thus know that sentient beings have various desires, deep mental attachments, and teach according to their original natures by using various causes and conditions, metaphors, words, and the power of skillful means.",
        "source": "X30n0605_002:0675a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我即現在釋迦佛也先三後一如彼四佛不異故言亦復如是知諸眾生有種種欲者即是五乘根性欲也過去名根現在名欲未來名性深心所著者即是根也方便即是隨宜開三乘權法記云知諸眾生去感也種種因緣去應也。",
        "translation": "I am the Śākyamuni Buddha in the present, who first described the three and then the same as the other four buddhas and didn't differ; therefore, I say I also thus know that sentient beings have various desires that are the desires of the five vehicle faculties, and that what was called faculties in the past was called desires in the present and will be called natures in the future, and that what's deeply attached to the mind is the faculties and expediency is the expedient way to reveal the three-vehicle right, which is described in the explanation of the Dharma as knowing that sentient beings will be moved and will respond to various causes and conditions.",
        "source": "X30n0605_002:0675b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二顯四真實。",
        "translation": "△Two, it shows the four truths.",
        "source": "X30n0605_002:0675b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗如此皆為得一佛乘一切種智故。",
        "translation": "Śāriputra, this is all for the sake of attaining the omniscience of the One Buddha Vehicle.",
        "source": "X30n0605_002:0675b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此等者指權是實也佛乘是教一一切是行一種智所知是理一。",
        "translation": "Such and so forth refer to the expedient as the real, the Buddha vehicle as the teaching that's one, and everything that's practiced as one kind of cognition that's known as the principle that's one.",
        "source": "X30n0605_002:0675b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三舉五濁釋方便。",
        "translation": "△Three examples of the five turbidities explain the method.",
        "source": "X30n0605_002:0675b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗十方世界中尚無二乘何況有三舍利弗諸佛出於五濁惡世所謂劫濁煩惱濁眾生濁見濁命濁如是舍利弗劫濁亂時眾生垢重慳貪嫉妬成就諸不善根故諸佛以方便力於一佛乘分別說三。",
        "translation": "Śāriputra, there are still no two vehicles in the world in ten directions, so why should there be three? Śāriputra, the buddhas emerge from the five turbid bad states, which are called the eon turbidity, affliction turbidity, sentient beings turbidity, views turbidity, and life turbidity. Śāriputra, when the eon is turbid, sentient beings are defiled, stingy, greedy, and jealous, and they develop unwholesome roots.",
        "source": "X30n0605_002:0675b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方世界尚無二乘何況有三將舉五濁先標其意然上已說諸佛開權顯實未明隱實施權其法清淨湛一如空尚無帶二(般若)帶三(方等)之權況有單三(三乘)單五(加人天)之權祇為五濁障重實不得宣須施單五單三之權亦施帶二帶三之權故言於一佛乘分別說三言五濁者自有四別所謂唱數列名體相釋結之四唱數列名如文可解言如是者明五濁體相也但濁體及相不可具說略云如是也劫者梵語劫波此翻時分當知劫濁無別體劫是長時剎那是短時但約四濁立此假名名為劫濁眾生濁亦無別體攬見慢果報三濁立此假名名眾生濁煩惱濁指五鈍使為體見濁指五利使為體命濁指連持色心為體若論五濁相者當知四濁增劇聚在此時所謂瞋恚增劇刀兵起貪欲增劇饑餓起愚癡增劇疾疫起三災起故煩惱倍隆諸見轉熾麤弊色心惡名穢稱摧年減壽眾濁交湊如水奔昏風波皷怒魚龍攪撓無一憀賴時使之然亦如劫初光音天墮地地使有欲亦如忉利諸天入麤澀園園生鬪心是名劫濁相煩惱濁者貪海納流未嘗飽足瞋虺吸毒撓諸世間癡闇頑嚚過於漆墨慢高下視陵忽無度疑網無信不可告實是為煩惱濁相見濁者無人謂有人有道謂無道十六知見六十二等猶如羅網又似稠林纏縛屈曲不能得出此是見濁相眾生濁者攬於色心立一主宰譬如黐膠無物不著流宕六道處處受生如貧如矬名長名富是為眾生濁相命濁者朝生暮殞晝出夕沒波轉烟迴瞬息不住此是命濁相若約次第者煩惱見為根本從此二濁成於眾生從眾生則有連持命此四輕時謂為劫濁也。",
        "translation": "Although the above has already explained that the buddhas open up the provisional and reveal the real, but they haven't explained the hidden reality of giving provisional teachings, the Dharma is pure and perfectly like emptiness. How could there be a single triple (three-vehicle) or single quintet (plus humans and gods) provisional? It's simply because the five turbidities are so hindered that it's really impossible to declare that it's necessary to give a single quintet of single triple provisional teachings and a double triple provisional teachings.",
        "source": "X30n0605_002:0675b13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△四揀偽敦信二初揀真偽二初揀非真弟子。",
        "translation": "△Four kinds of selecting fake and Dunxin, the first selecting true and fake, and the second selecting non-true disciples.",
        "source": "X30n0605_002:0675c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗若我弟子自謂阿羅漢辟支佛者不聞不知諸佛如來但教化菩薩事此非佛弟子非阿羅漢非辟支佛。",
        "translation": "\"Śāriputra, if my disciple calls himself an arhat or a pratyekabuddha, he doesn't know that the buddhas and tathāgatas only teach and transform the works of bodhisattvas, and this is not a disciple of the Buddha, not an arhat or a pratyekabuddha.",
        "source": "X30n0605_002:0675c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此名揀偽敦信若佛弟子自能信解若不信解非真弟子亦非羅漢所以敦逼時眾令信受解於中有兩意初不聞不知非真弟子次聞不信受成增上慢如世弟子隨順師法繼嗣傳燈若不聞不知則無法可順何謂弟子且如來昔說五濁開三汝既隨順而得涅槃得聞得知名為弟子今五濁既除為汝說一何意不聞不知不聞者即不聞教一不知者即不知行一非真即非理一非弟子即非人一也。",
        "translation": "This is called selecting falsehoods and striving for faith. If a disciple of the Buddha can believe and understand for himself, and if he doesn't believe and understand, he's not a true disciple and not a arhat. Therefore, he strives to convince the audience to believe and accept that there are two meanings in this.",
        "source": "X30n0605_002:0675c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二不信成上慢。",
        "translation": "△Two kinds of disbelief lead to conceit.",
        "source": "X30n0605_002:0676a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗是諸比丘比丘尼自謂已得阿羅漢是最後身究竟涅槃便不復志求阿耨多羅三藐三菩提當知此輩皆是增上慢人所以者何若有比丘實得阿羅漢若不信此法無有是處。",
        "translation": "Śāriputra, suppose monks and nuns say they've attained arhatship, which is the final body and final nirvāṇa, and then they no longer aspire to unsurpassed, correct, and complete enlightenment.",
        "source": "X30n0605_002:0676a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又舍利弗下是第二明不信成增上慢此敦其使信何者汝自謂是後身身尚無量實非後身汝自謂究竟猶餘二百由旬實非究意未得謂得豈非增上慢也真羅漢者濁除根利知非究竟信真是法未是後身不起上慢知非究竟信於究竟即信是理一無增上慢即成行一信則信教是為教一是佛弟子則人一也。",
        "translation": "Śāriputra's second point of view is that disbelief becomes arrogant. Why do you claim to be the latter body, which is still immeasurable, but really isn't the latter body? You claim to be the ultimate, which is still 200 yojanas away, but really isn't the ultimate faith, which is belief in the principle and the absence of arrogance, which is the accomplishment of practice.",
        "source": "X30n0605_002:0676a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二開除釋疑二初開除二初除佛滅後。",
        "translation": "△Two: Explanation of Doubts and Explanation of Exclusions Two: Explanation of Exclusions Two: Explanation of Exclusions First, except after the Buddha's extinction.",
        "source": "X30n0605_002:0676a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "除佛滅度後現前無佛。",
        "translation": "The first is to remove the absence of a Buddha in the present after he has ceased to exist.",
        "source": "X30n0605_002:0676a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開除釋疑者先開除謂除佛滅後不成增上慢若佛在世正說此經不信不受非真羅漢成增上慢若佛滅後方得羅漢偏執權經不信圓法聽許非增上慢。",
        "translation": "The first one is to remove doubt, which is to remove the fact that after the Buddha's extinction, it's not considered to be arrogant if the Buddha is alive and correctly teaching this sūtra and doesn't believe and accept that it's not a true arhat who becomes arrogant if the arhat only attains partiality after the Buddha's extinction and doesn't believe the provisional sūtras or listen to the perfect teaching, which is not considered to be arrogant.",
        "source": "X30n0605_002:0676a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二信人難得。",
        "translation": "△Two kinds of believers are difficult to attain.",
        "source": "X30n0605_002:0676a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何佛滅度後如是等經受持讀誦解義者是人難得。",
        "translation": "Therefore, why is it difficult for a person to receive, retain, recite, and understand the meaning of such sūtras after the Buddha's cessation?",
        "source": "X30n0605_002:0676a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何佛滅下明好人難得深經難解亦不成上慢又佛雖入滅此經尚在不信不受應是上慢即得開除佛滅度後雖有此經解其文義此人難遇致令羅漢不信不解亦聽許非增上慢。",
        "translation": "Even though the Buddha has entered into extinction, this sūtra still exists, so disbelief and non-acceptance should be regarded as conceit. Even though this sūtra exists after the Buddha's extinction, understanding its text and meaning is difficult for this person to encounter, causing a arhat to disbelieve and not understand it.",
        "source": "X30n0605_002:0676b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋疑。",
        "translation": "△Two, \"Explain the doubt.",
        "source": "X30n0605_002:0676b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若遇餘佛於此法中便得決了。",
        "translation": "If he meets another Buddha, then he'll be able to understand this teaching definitively.",
        "source": "X30n0605_002:0676b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若佛滅後解經之人難遇至若得羅漢者即永入涅槃耶即釋云是人雖生滅度之想捨命已後便生界外有餘之國值遇餘佛得聞此經即便決了釋論第九十三釋畢定品云羅漢受先世身身必應滅住在何處而具足佛道答羅漢三界有漏因緣既盡更不復生三界出於界外有淨佛土無煩惱名於是國土佛所聞法華經具足佛道即引法華云有羅漢若不聞法華自謂得滅度我於餘國為說是事汝皆作佛論既引經為證今釋經還將論解南嶽師云餘佛者四依也羅漢遇之聞經決了又羅漢修念佛定見十方佛為說此經便得決了又凡夫行人苦到懺悔見十方佛為說亦得決了。",
        "translation": "If it's difficult for someone who understands the sūtras to meet them after the Buddha's death, then if he attains arhatship, he'll enter nirvāṇa permanently? That is, the explanation says that even though this person gives rise to the idea of extinction, after he gives up his life, he'll be born in a country with a remainder outside the realm.",
        "source": "X30n0605_002:0676b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五無虗妄三初勸信釋迦。",
        "translation": "△5. Not Falsely Speaking 3. First, he encourages faith in Śākyamuni.",
        "source": "X30n0605_002:0676b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗汝等當一心信解受持佛語。",
        "translation": "\"Śāriputra, you must all whole-heartedly believe and understand the Buddha's words and retain them.",
        "source": "X30n0605_002:0676b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此明無虗妄為止物機謗心此為三初勸信釋迦實說故云汝等當一心信解受持佛語。",
        "translation": "This explains the absence of falsity as a way to stop the denigration of materialistic objects. Here are three first, encouraging faith in what Śākyamuni really said; therefore, it's said that you should all wholeheartedly believe, understand, and retain the Buddha's words.",
        "source": "X30n0605_002:0676b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二勸信諸佛。",
        "translation": "△Two, we encourage faith in the buddhas.",
        "source": "X30n0605_002:0676b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來言無虗妄。",
        "translation": "The words of the buddha-tathāgatas are not false.",
        "source": "X30n0605_002:0676c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次勸信諸佛故云諸佛言無虗妄由諸佛道同彌加信受。",
        "translation": "The second exhorts faith in the buddhas, so it's said that the words of the buddhas are not false because the path of the buddhas is the same as Maitreya's faith.",
        "source": "X30n0605_002:0676c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三結成不虗。",
        "translation": "△Three formations are not incomplete.",
        "source": "X30n0605_002:0676c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無有餘乘唯一佛乘。",
        "translation": "There are no other vehicles but the Buddha vehicle.",
        "source": "X30n0605_002:0676c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後結成不虗故云無有餘乘唯一佛乘也。",
        "translation": "The final conclusion is unsubtle; therefore, it's called 'there are no remaining vehicles but only the Buddha vehicle.'",
        "source": "X30n0605_002:0676c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to reiterate this meaning and spoke a verse, saying.",
        "source": "X30n0605_002:0676c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌二初頌上許答二初頌揀許二初頌五千退席。",
        "translation": "\"△Two verses and two hymns, the first verse indicating approval and the second verse indicating approval, and the first verse indicating withdrawal of the 5,000 monks and nuns from their seats.",
        "source": "X30n0605_002:0676c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "比丘比丘尼有懷增上慢優婆塞我慢優婆夷不信如是四眾等其數有五千不自見其過於戒有缺漏護惜其瑕疵是小智已出眾中之糟糠佛威德故去斯人尠福德不堪受是法。",
        "translation": "Monks and nuns who harbor pride in their superiority, Upāsaka, conceit, and unbelief in the four groups are five thousand in number who don't see their faults and guard and cherish their defects.",
        "source": "X30n0605_002:0676c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須知上慢我慢不信四眾通有但出家二眾多修道得禪謬謂聖果偏起上慢若在俗矜高多起我慢女人智淺多生邪僻不自見其過者三失覆心藏玼揚德不能自省是無慚人若自見過是有羞僧於戒有缺漏者律儀有失名缺定共道共有失名漏無道定等故內起惡覺如玉含瑕無律儀故外動身口如玉露玼覆罪自得故名護惜小智者不得學無學智而有世間小智妄謂有漏以為無漏則小中之小故言小智也糟糠者以無無漏禪定所潤故如糟以無理慧所滋故如糠是五千等有世間禪如糟有文字解如糠封文失詮如糠而無米也又糟糠譬其無大機。",
        "translation": "You should know that conceit, pride, and disbelief are common to all four groups, but the two groups of renunciant practitioners often cultivate meditation. It's mistaken to say that the noble fruit is partial, conceited, and arrogant, and that women with shallow wisdom often become deviant and don't see their faults, and the three faults cover their minds, store their reputation, and fail to examine themselves.",
        "source": "X30n0605_002:0676c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌眾已清淨。",
        "translation": "△Two verses say, \"The multitude is purified.",
        "source": "X30n0605_002:0676c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此眾無枝葉惟有諸貞實。",
        "translation": "\"This multitude has no branches and leaves but only the true nature of things.",
        "source": "X30n0605_002:0677a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "枝葉譬其非好器悉不任用故須遣之。",
        "translation": "The branches and leaves are an example of a person who isn't a good vessel and doesn't use them all, so they must be rejected.",
        "source": "X30n0605_002:0677a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌誡許。",
        "translation": "△Two verses admonish that.",
        "source": "X30n0605_002:0677a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗善聽。",
        "translation": "Śāriputra listened well.",
        "source": "X30n0605_002:0677a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即頌上誡許誡令善聽也。",
        "translation": "That's the verse that admonishes, approves, and makes them listen well.",
        "source": "X30n0605_002:0677a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌上正答二初頌四佛章二頌釋迦章初文又四初總頌諸佛章二頌過去佛章三頌未來佛章四頌現在佛章初文又五初頌施權二初頌正施權。",
        "translation": "The first verse is a general verse on the buddhas, the second is a verse on the buddhas of the past, the third is a verse on the buddhas of the future, and the fourth is a verse on the buddhas of the present.",
        "source": "X30n0605_002:0677a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛所得法無量方便力而為眾生說眾生心所念種種所行道若干諸欲性先世善惡業佛悉知是已以諸緣譬喻言辭方便力令一切歡喜或說修多羅伽陀及本事本生未曾有亦說於因緣譬喻并祇夜優波提舍經。",
        "translation": "After teaching sentient beings the thoughts of their minds, the various paths they pursue, and the desirous natures of their past lives, the buddhas fully understand them and then cause them to rejoice with the power of various parables, expressions, and skillful means.",
        "source": "X30n0605_002:0677a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此章頌文與上長行有三異一彼此互無二前後間出三開合不同上有歎法希有而無五濁頌有五濁而無歎法上先歎法次明不虗開權顯實今先開權顯實後明不虗上勸信與不虗合說今分勸信隔於不虗章安云上以釋迦方便釋成諸佛之權偈中以釋迦之實釋成諸佛顯一是四異也諸佛所得法者修道得諸權法無量方便力下頌上無數方便種種因緣演說諸法眾生心所念者頌上隨宜說法頌中廣出隨宜之相即是照九界機說七方便總言九七不可定判故言若干隨欲之宜應用世界悉檀隨性之宜應用為人悉檀隨惡業宜應用對治悉檀現起希望名念法門不同名種種過去所習名性現在欣樂名欲或可習欲成性成性生習欲善惡業者七方便傳傳迭為善惡佛悉等佛以權智照諸方便之性欲然後以諸因緣譬喻隨其所宜說九部經十二部如玄義中說。",
        "translation": "The verse in this chapter differs from the long line above in three ways: first, there's no mutuality; second, the prior and subsequent interruptions; and third, the opening and closing are different. The verse above praises the rare existence of the Dharma but not the five turbidities, and the verse above praises the Dharma first, then explains what's not superb, opens up the provisional and reveals the real, and then explains what's not superb.",
        "source": "X30n0605_002:0677a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌結施權意。",
        "translation": "△Two verses conclude with the intention of bestowing expediency.",
        "source": "X30n0605_002:0677b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鈍根樂小法貪著於生死於諸無量佛不行深玅道眾苦所惱亂為是說涅槃。",
        "translation": "Dull-rooted people who enjoy lesser things and are addicted to birth and death don't practice the profound way of the innumerable buddhas, and they are afflicted by suffering and confusion in order to explain nirvāṇa.",
        "source": "X30n0605_002:0677b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行半頌結施權之意當知前世根鈍今世無機不堪聞大故言不行深玅道由前世貪著障重今世眾苦所惱唯可聞小故言為是說涅槃。",
        "translation": "This first line and a half of the verse concludes the meaning of the right to offer. You should know that in the past life, his faculties were dull and in the present life, he had no opportunity to hear the great, so he said he couldn't practice the profound way because in the past life, the hindrance of greed was too great and in the present life, the only thing he could hear was the lesser afflictions.",
        "source": "X30n0605_002:0677b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌顯實四初頌理。",
        "translation": "△Two Verses Revealing the Truth Four Verses First, I'll discuss the principle.",
        "source": "X30n0605_002:0677b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我設是方便令得入佛慧未曾說汝等當得成佛道所以未曾說說時未至故今正是其時決定說大乘我此九部法隨順眾生說入大乘為本以故說是經。",
        "translation": "\"I have set out this method to make sentient beings enter the Buddha's wisdom. I've never said that you will attain the Buddha's path. That's why I haven't said it yet, so now is the right time to definitely explain the great vehicle.",
        "source": "X30n0605_002:0677b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行頌理一令得入佛慧頌上一大事因緣也決定說大乘總頌開示悟佛知見也我此九部或云大乘有十二部小乘但有九部因彼小乘是灰斷教無如意珠身故故無方廣部又無天鼓自然鳴故故無無問自說部雖有授記以其少故故無授記部此且從別作如是說通大為語大小俱有十二部所言十二者一修多羅此云法本二祇夜此云重頌三和伽羅那此云授記四伽陀此云不重頌五優陀那此云無問自說六尼陀那此云因緣七阿波陀那此云譬喻八伊帝目多伽此云本事九闍陀伽此云本生十毗佛略此云方廣十一阿浮達磨此云未曾有十二優波提舍此云論議所言部者別也類也以其十二類別故新譯恐濫部帙之部則謂之十二分教也入大乘為本者頌上入佛知見也。",
        "translation": "These three verse lines explain the principle of the one cause that leads to entry into Buddha's wisdom, the verse on the causes and conditions of the one great matter, the verse on the determination to preach the great vehicle, the general verse on the enlightenment of the Buddha's vision, and the verse on the nine divisions of the lesser vehicle that only has nine divisions because the lesser vehicle is a gray, cut-off teaching that lacks the body of the Tathāgata Pearl and lacks the natural sound of the heavenly drum, and therefore lacks the unasked-for, self-explained division. Although there is an authorized division, it's because it's small that there's no authorized division.",
        "source": "X30n0605_002:0677b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌人一。",
        "translation": "△Two Verses on Humanity 1.",
        "source": "X30n0605_002:0677c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有佛子心淨柔軟亦利根無量諸佛所而行深妙道為此諸佛子說是大乘經我記如是人來世成佛道以深心念佛修持淨戒故此等聞得佛大喜充徧身佛知彼心行故為說大乘聲聞若菩薩聞我所說法乃至於一偈皆成佛無疑。",
        "translation": "\"Suppose a Buddhist son has a pure and flexible mind and sharp faculties, and there are measureless buddhas who practice the profound and wonderful path, and I explain this great vehicle sūtra for these Buddhist sons. I'll record that such a person will become a buddha in the future because he deeply remembers the Buddha and cultivates pure morality. Thus, when they hear it, the Buddha's great joy fills the body, and the Buddha knows their minds and deeds and therefore explains the great vehicle to śrāvakas, and if a bodhisattva hears my teaching, even in a single verse, he becomes a buddha without doubt.",
        "source": "X30n0605_002:0677c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四行半頌上諸佛如來但教化菩薩以明人一上直云教化菩薩頌中廣出諸方便人皆成實人有佛子心淨即別教之人為此佛子說大乘經得記心喜則成乎圓教真實之人聲聞若菩薩者若聲聞則兼得緣覺若菩薩則兼得六度通教等諸菩薩也皆成佛無疑者即是七種方便無非佛子。",
        "translation": "In this four-and-a-half-line verse, the buddhas and tathāgatas only teach and transform bodhisattvas to clarify the person. The verse directly says, \"Teach and transform bodhisattvas,\" and it extensively lists the skillful means by which people all become real people.",
        "source": "X30n0605_002:0677c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌教一。",
        "translation": "△Three verse teachings are one.",
        "source": "X30n0605_002:0677c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十方佛土中唯有一乘法無二亦無三除佛方便說但以假名存引導於眾生說佛智慧故。",
        "translation": "In the Buddha-lands of the ten directions, there's only the Dharma of the One Vehicle, and there are no two or three except for the Buddha's teaching of skillful means, which is to use nominal terms to guide sentient beings and explain the Buddha's wisdom.",
        "source": "X30n0605_002:0677c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行三句頌上如來但以一佛乘為眾生說法無有餘乘若二若三若十方佛唯說一法即是教一假名引導即方便教也無有餘乘無別教中圓入別之餘也無二者無通教中半滿相對之二也無三者無三藏中之三也如此等二三皆是假名字中引導諸眾生今日之法但一佛圓乘耳。",
        "translation": "This line of three verse praises the fact that the Tathāgata teaches the Dharma for sentient beings only in terms of the one Buddha vehicle, and there are no other vehicles, whether two or three, in which the Buddha of the ten directions teaches only the one Dharma, which is the teaching, the guidance by provisional names, which is the teaching by skillful means, and no other vehicle, no other than the two in the distinct teaching that enters fully into the distinct, no two in the shared teaching that's half full, no three in the tripiṭaka that's three, and so on.",
        "source": "X30n0605_002:0677c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌行一。",
        "translation": "△Four Verses on Practice 1.",
        "source": "X30n0605_002:0678a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛出於世唯此一事實餘二則非真終不以小乘濟度於眾生佛自住大乘如其所得法定慧力莊嚴以此度眾生自證無上道大乘平等法若以小乘化乃至於一人我則墮慳貪此事為不可。",
        "translation": "The buddhas who appear in the world are only this one true thing, and the other two are not true. They never save sentient beings with the lesser vehicle. The buddhas themselves abide in the great vehicle as they attain it, and the power of legal wisdom adorns them as they save sentient beings and realize for themselves the unsurpassed way and the great vehicle's equal dharma.",
        "source": "X30n0605_002:0678a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行三句頌上諸有所作常為一事即行一文也事即是行終不以小乘濟度於眾生即是頌上常為一事之意佛自住大乘以此度眾生頌上唯以佛之知見示悟眾生也後一行則釋不以小度之意。",
        "translation": "These three lines and three phrases of the verse say that what's created is always one thing, which is the practice of one thing. That thing is the practice of never using the lesser vehicle to save sentient beings, which is the verse's meaning of always using the lesser vehicle to save sentient beings.",
        "source": "X30n0605_002:0678a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌勸信二初舉果勸信二初舉內心。",
        "translation": "△Three verses encouraging faith, the first raising the result and encouraging faith, and the second raising the internal mind.",
        "source": "X30n0605_002:0678a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人信歸佛如來不欺誑亦無貪嫉意斷諸法中惡故佛於十方而獨無所畏。",
        "translation": "If a person believes and relies on the Buddha as a tathāgata, he won't deceive others, doesn't have craving or jealousy, and stops the evil in all dharmas so the Buddha alone has no fear in the ten directions.",
        "source": "X30n0605_002:0678a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二行半舉果勸信由長行中云舍利弗汝等當信佛之所說故今文頌之若人信歸佛如來不欺誑者明佛心清淨無明慳恡眾惡已斷淨心中說故是可信。",
        "translation": "These two and a half lines encourage faith by referring to the result because the long line says, \"Śāriputra, you must believe what the Buddha teaches.\" This verse therefore explains that if people believe and take refuge in the Buddha, the Tathāgata doesn't deceive them, which shows that the Buddha's mind is pure, ignorant, stingy, and full of evil, then it's believable because it's explained in a pure mind.",
        "source": "X30n0605_002:0678a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二舉外色。",
        "translation": "△Two, \"Let's talk about external appearance.",
        "source": "X30n0605_002:0678a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以相嚴身光明照世間無量眾所尊為說實相印。",
        "translation": "'I shine brightly with my body of characteristic adornment, and there are measureless people who revere it as a seal of the true form of the teaching.'",
        "source": "X30n0605_002:0678a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以相嚴身者下一行明外色也良以身相炳著光色端嚴內無闇惑外有光明則口無欺誑為眾所尊說大乘印則可信受。",
        "translation": "The next line below \"I have a body of dignified appearance\" clarifies external appearance.",
        "source": "X30n0605_002:0678a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二舉因勸信二初舉昔誓願。",
        "translation": "△Two reasons are given to encourage faith, and the first is to cite a past vow.",
        "source": "X30n0605_002:0678a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知我本立誓願欲令一切眾如我等無異。",
        "translation": "\"Śāriputra, you should know that I originally vowed to make all sentient beings like us, without distinction.",
        "source": "X30n0605_002:0678a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知我昔誓願非但自誓取菩提亦誓眾生同入佛慧今酬誓故說是亦可信。",
        "translation": "You should know that my vow in the past wasn't just to obtain enlightenment on my own, but also to have all sentient beings enter the Buddha's wisdom together. Now, in response to that vow, I say this is also a vow that can be believed.",
        "source": "X30n0605_002:0678b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明願滿。",
        "translation": "△Two, I'll explain the fulfillment of that vow.",
        "source": "X30n0605_002:0678b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如我昔所願今者已滿足化一切眾生皆令入佛道。",
        "translation": "As I vowed in the past, I've now fulfilled it by teaching all sentient beings to enter the Buddha Way.",
        "source": "X30n0605_002:0678b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今菩提既滿眾生亦入汝既自證佛慧亦驗我誓不虗此即結成舉因勸信也問本誓既普今眾生尚多云何而言願滿答佛以三世益物今明現在而論願滿。",
        "translation": "Now, since enlightenment has been fulfilled and sentient beings have also entered, you've realized for yourself the Buddha's wisdom and verified that my vow isn't broken. He asked how he could say the vow was fulfilled now that the original vow has spread to so many sentient beings.",
        "source": "X30n0605_002:0678b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌五濁四初總明五濁障大。",
        "translation": "△Four verses on the five turbidities begin with a general explanation of the five major hindrances.",
        "source": "X30n0605_002:0678b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我遇眾生盡教以佛道無智者錯亂迷惑不受教。",
        "translation": "\"If I encounter sentient beings who have exhausted the teaching because of the Buddha Way and lack knowledge, they're mistaken, confused, and don't accept the teaching.",
        "source": "X30n0605_002:0678b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我遇眾生者中阿含十二云劫初光音天下生世間無男女尊卑眾共生世故言眾生此據最初也若攬眾陰而有假名眾生此據一期受報若言處處受生故名眾生者此據業力五道流轉也正法念云有十種眾生所謂長短方圓三角青黃赤白紫云何眾生生死長在地獄時身受不可思議苦心念無量無邊惡在畜生時身迭相吞噉心迭相逼惱在於鬼時身若燒山心如沸鑊邪見熾盛觝突癡兇在於人時身口意常作不饒益事以自勞苦身口意常念不饒益事以自牽纏在天時躭染六塵縱逸嬉戲不聞正法杜塞福源是名眾生生死長也云何眾生生死短在地獄時能一念寂靜心取戒在畜生時能一念靜心依三寶在餓鬼時能一念靜心靜諸根在人時能修六度孝養父母恭敬三寶以茲眾善嚴身口意在天時能捨天樂持戒樂禪教化讀誦梵行少語是為眾生生死短也云何眾生名方生死如鬱單越於一切物無我所捨身必上天從天上又上天唯向升善處是名生死方楞也云何眾生圓生死唯在三途四趣中團欒圓轉如旋火煙迴也云何三角生死謂善業不善業無記等是也云何眾生青生死恒入黑闇地獄常怖怕是也云何眾生黃生死餓鬼饑羸萎黃是也云何眾生赤生死畜生遞相食噉流血赫然是也紫即修羅耳云何眾生白生死即謂人中天中白業善道如諸天臨死時餘天語言汝生人道去若人臨死知識語言汝向天中去當知兩處是白生死又第五云心畫地獄黑色鬼鴿色畜生黃人赤天白問此義云何答下說五道果報今說五道造業以故不同耳又輪迴業報不同如見實三昧經云從地獄來者則聲嘶忽急數數戰慄夢見大火沸鑊等也從畜生來者暗鈍懈怠多食性怯謇訥所為多似諸蟲畜等也從鬼來者髮黃常饑慳貪等餘趣比知經具廣說如是等眾生云何與佛相遇當知眾生以苦惱自煎諸佛以大悲濟物悲與苦相對故言相遇又佛如眾生如一如無二如天性相關故言相遇當知大悲恒愍眾生若以人天教我則墮闇惑只免青黃赤白紫方圓楞角等生死非教佛道若遇眾生令修小乘我則墮慳貪此事為不可祇出二十五有若遇眾生教令修通別我則墮偏僻失佛知見今皆令眾生得實相妙慧體達一切皆是佛法無非正道此則盡教以佛道生死苦永盡我常如是說但眾生根鈍罪重不可如願過去世有佛號住無住發願使己國眾生同日同時成佛即日滅度又賢劫前有佛號平等亦願己國及十方眾生亦同一日成佛即日滅度今日有佛復有眾生何耶佛言止止我前所言凡得人身者頗有發願令五道同日成佛否佛言不可以非器之身成無上道要先化三趣令得人天然後乃可如願三趣非善道何能成佛如人求寶聚不於空中求也。",
        "translation": "If I encounter sentient beings, then according to the twelve sayings of the Middle Length Āgamas, at the beginning of the eon, the world of light and sound is born, and there are no male and female nobles and inferiors in the world, so it's called sentient beings. If we discuss the aggregates and exist under the nominal name sentient beings, this is based on the results of one period.",
        "source": "X30n0605_002:0678b09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△二別明五濁障三五初眾生濁。",
        "translation": "△Two, separately identify the five turbid hindrances, three and five.",
        "source": "X30n0605_002:0679a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我知此眾生未曾修善本堅著於五欲癡愛故生惱以諸欲因緣墜墮三惡道輪向六趣中備受諸苦毒。",
        "translation": "I know that this sentient being has never cultivated goodness and originally was firmly attached to the five desires, delusion, and craving, so that affliction arises.",
        "source": "X30n0605_002:0679a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兩行明眾生濁善本者真如實相也不依此而種善根故不感大也堅著五欲者即諸惡之本如淨名云從癡有愛則我病生此之謂矣。",
        "translation": "These two lines explain that the turbidity of sentient beings' good roots is the true nature and true characteristics of sentient beings who don't rely on them to plant good roots and therefore don't experience greatness. Being firmly attached to the five desires is the root of all badness, as the Pure Names say, and from delusion and craving comes the birth of my illness.",
        "source": "X30n0605_002:0679a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二命濁。",
        "translation": "△Two lives are impure.",
        "source": "X30n0605_002:0679a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受胎之微形世世常增長薄德少福人眾苦所逼迫。",
        "translation": "The diminutive form of the womb that's born always increases from generation to generation, and people with little virtue and little merit are persecuted by suffering.",
        "source": "X30n0605_002:0679a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行別明命濁觀心釋者一念心起即為未來作業業即是胎胎業無窮世世不斷不斷即是增長受胎之微形形即五陰陰亦名世壽命連持而諸陰入世也初從父母交會之後狀如薄酪三七如厚酪四七如凝酥五七如肧六七如肉摶七七於肉摶上生五皰頭手脚等八七又五皰一頭兩膊兩腕九七續生二十四皰四皰作眼耳鼻舌二十皰為二十指十七轉現腹相漸漸皮骨分解作諸異相生七百筋七千脈隨所須相每用一風染之須白相白風染之乃至餘風亦如是香風故安穩端正臭風故不安穩則醜陋邪戾後出胎食五穀則生八萬戶蟲也。",
        "translation": "In this line, the mindfulness of life is separately explained as a turbidity of contemplation. One thought of mind arises that future operation, which is karma, which is the birth-and-womb karma, that is, the growth of the subtle form of the womb, which is the shape of the five aggregates, also known as the worldly life span, and the aggregates enter the world.",
        "source": "X30n0605_002:0679a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三見濁。",
        "translation": "△The three views are turbid.",
        "source": "X30n0605_002:0679b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "入邪見稠林若有若無等依止此諸見具足六十二。",
        "translation": "Entering a thick forest of wrong views, whether present or absent, relies on these views to be complete in sixty-two ways.",
        "source": "X30n0605_002:0679b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行明見濁當知五見交加如稠林密茂若有是常見若無是斷見因此二見生六十二見或云外道計我有四句色即是我離色是我色大我小我住色中我大色小色住我中四陰亦爾是為二十歷三世為六十并根本為六十二也。",
        "translation": "This line of explanation shows the turbidity of views. You should know that the five views intermingle like a thick forest, and if there's a view that's common and if there's no view that's eliminated, the two views give rise to the sixty-two views.",
        "source": "X30n0605_002:0679b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四煩惱。",
        "translation": "△The four afflictions.",
        "source": "X30n0605_002:0679b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深著虗妄法堅受不可捨我慢自矜高諂曲心不實。",
        "translation": "They are deeply attached to false dharmas, firmly accepting what's not abandoned, conceited, proud, arrogant, flattering, and unreal.",
        "source": "X30n0605_002:0679b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如文可解。",
        "translation": "This is explained as above.",
        "source": "X30n0605_002:0679b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五劫濁。",
        "translation": "△The five eons are turbid.",
        "source": "X30n0605_002:0679b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於千萬億劫不聞佛名字亦不聞正法如是人難度。",
        "translation": "During a thousand million eons, they don't hear the Buddha's name or hear the right teaching. Such a person is difficult to save.",
        "source": "X30n0605_002:0679b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "長時無佛法即是劫濁又上來四濁集在時中故名劫濁濁者譬夫少土投之清水水亡清潔土失留礙如是人難度者五濁障故不信一乘則不可度也。",
        "translation": "The absence of the Buddha's teaching for a long time is called kalpa turbidity, and the four turbidities from above are collected during that time, so they're called kalpa turbidity.",
        "source": "X30n0605_002:0679b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三為五濁說小。",
        "translation": "△3 explains the lesser of the five turbidities.",
        "source": "X30n0605_002:0679b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故舍利弗我為設方便說諸盡苦道示之以涅槃。",
        "translation": "Therefore, Śāriputra, I've created a way to explain the path to the end of suffering and show it to him as nirvāṇa.",
        "source": "X30n0605_002:0679b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如文可解。",
        "translation": "That's understandable as the text explains.",
        "source": "X30n0605_002:0679b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四明為大說小。",
        "translation": "△Four explains that it's for the greater good that he teaches the lesser good.",
        "source": "X30n0605_002:0679b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我雖說涅槃是亦非真滅諸法從本來常自寂滅相佛子行道已來世得作佛。",
        "translation": "Even though I say that nirvāṇa is and isn't true, it ceases all dharmas from their original, eternal, and extinct character.",
        "source": "X30n0605_002:0679b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即是終令入大析三界妄盡滅色取空則非真滅若達無明本無常寂即是真滅本無雖寂若不修道無由契會故言佛子行道已來世得作佛。",
        "translation": "That is, it ultimately leads to the great analysis that the delusion in the three realms is ended, and form and grasping emptiness are not truly extinguished if one realizes that nescience is originally impermanent and tranquil, which is true extinction even though it's originally impermanent and tranquil.",
        "source": "X30n0605_002:0679b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五頌不虗三初明釋迦先開三。",
        "translation": "△There are five verses that don't fail to describe the three first, which Shakyamuni first revealed.",
        "source": "X30n0605_002:0679c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我有方便力開示三乘法。",
        "translation": "\"I have the power of skillful means to reveal the teachings of the three vehicles.",
        "source": "X30n0605_002:0679c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明諸佛後顯實。",
        "translation": "Second, he explains that the buddhas then reveal the truth.",
        "source": "X30n0605_002:0679c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸世尊皆說一乘道。",
        "translation": "All the world-honored ones teach the One Vehicle path.",
        "source": "X30n0605_002:0679c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦開三諸佛顯實此互現耳。",
        "translation": "The Śākyamuni opens the three, and the buddhas reveal the reality of this mutual appearance.",
        "source": "X30n0605_002:0679c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三正明不虗除疑。",
        "translation": "△Three correctly explains that it's not indifferent to remove doubt.",
        "source": "X30n0605_002:0679c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此諸大眾皆應除疑惑諸佛語無異唯一無二乘。",
        "translation": "Now, all the masses here should remove their doubts and confusions that the words of the buddhas are not different and are only one and not two vehicles.",
        "source": "X30n0605_002:0679c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前權後實誠言不虗勿生疑也。",
        "translation": "The former is provisional, then the latter is real. It's true that words aren't superfluous, so don't have doubts.",
        "source": "X30n0605_002:0679c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌過去佛章二初頌開三。",
        "translation": "△Two verse verses on past buddhas and two verse chapters begin with three.",
        "source": "X30n0605_002:0679c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過去無數劫無量滅度佛百千萬億種其數不可量如是諸世尊種種緣譬喻無數方便力演說諸法相。",
        "translation": "\"In the past, there were measureless eons and measureless annihilations of buddhas, hundreds of thousands of trillions of them, and their number is incalculable. Thus, the various world-honored ones explained the characteristics of the teachings by the power of countless methods and metaphors.",
        "source": "X30n0605_002:0679c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌顯一二初略頌上三一。",
        "translation": "△Two verses reveal the first two, and the first briefly praises the first three.",
        "source": "X30n0605_002:0679c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸世尊等皆說一乘法化無量眾生令入於佛道。",
        "translation": "\"These world-honored ones all teach the Dharma of the One Vehicle to convert measureless sentient beings into the Buddha Way.",
        "source": "X30n0605_002:0679c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆說一乘法即頌教一化無量眾生是頌人一令入於佛道即頌理一兼得行一。",
        "translation": "They all teach the One Vehicle Dharma, which is a verse that celebrates the teaching of the One Vehicle and transforms measureless sentient beings, which is a verse that celebrates the Ones of People and causes them to enter the Buddha Way, which is a verse that celebrates the Ones of Principle and the Attainment of the Ones of Practice.",
        "source": "X30n0605_002:0679c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二廣頌顯一二初總約五乘顯一。",
        "translation": "△Two Extensive Verses Revealing the One Two The first summarizes the five vehicles and reveals the one.",
        "source": "X30n0605_002:0679c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸大聖主知一切世間天人羣生類深心之所欲更以異方便助顯第一義。",
        "translation": "Knowing the profound desires of the minds of gods, humans, and sentient beings of all types of worlds, the great sages use different methods to help reveal the supreme truth.",
        "source": "X30n0605_002:0679c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天人羣生類是舉諸乘以明人一更以異方便是舉諸行以顯行一兼得教一第一義即是理一正因佛性即第一義理若明圓妙正觀即是實相方便不名為異若用七方便觀助顯第一義者名異方便。",
        "translation": "These categories of gods and humans are the vehicles that are cited to reveal the oneness of people, and the different methods are the practices that are cited to reveal the oneness of practice and the teaching that the oneness of the supreme meaning is the principle and the correct cause of the Buddha-nature that is the supreme principle.",
        "source": "X30n0605_002:0679c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二別約五乘顯一三初開菩薩乘。",
        "translation": "△Two distinct categories of the five vehicles reveal the one and three first opens with the bodhisattva vehicle.",
        "source": "X30n0605_002:0679c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有眾生類值諸過去佛若聞法布施或持戒忍辱精進禪智等種種修福慧如是諸人等皆已成佛道。",
        "translation": "If there are sentient beings who meet the buddhas of the past, hear the Dharma, give alms, observe precepts, tolerate humiliation, make effort, meditate, and know the various ways to cultivate merit and wisdom, such people have all achieved the Buddha Way.",
        "source": "X30n0605_002:0680a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二行開菩薩乘也若作五乘釋者但是六度菩薩乘若作七方便釋者則兼得通別菩薩乘何者因三教大乘皆行六度而運心有異若以相心行六度即三藏菩薩若以無相心即通教也若非相非無相次第行六度即別教也今但列六度未知定判屬誰若尋上文云更以異方便非獨六度菩薩即三教菩薩方便也昔聞法皆已成教一昔六度行皆已成行一也如是諸人等皆已成人一皆已成佛道皆已成理一也。",
        "translation": "If he makes a statement about the five vehicles, then he's only making a statement about the six perfections, and if he makes a statement about the seven expedients, then he's also making a statement about the distinct bodhisattva vehicles. Why is it that the three teachings and the great vehicle all practice the six perfections but have different states of mind? If he practiced the six perfections with a mark mind, that's the tripiṭaka bodhisattva, and if he practiced the six perfections with a markless mind, that's the shared teaching, and if he practiced the six perfections in sequence without marks or without marks, that's the distinct teaching.",
        "source": "X30n0605_002:0680a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二開二乘。",
        "translation": "△Two, \"Let's start with the two vehicles.",
        "source": "X30n0605_002:0680a11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛滅度後若人善軟心如是諸眾生皆已成佛道。",
        "translation": "After the buddhas' extinction, if people have good and gentle hearts, then all sentient beings have become buddhas and have accomplished the path.'",
        "source": "X30n0605_002:0680a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行開聲聞緣覺皆入一乘何以知之如大品歎阿羅漢心調柔輭又淨名云住調伏心是賢聖行是以得知昔善輭心皆成今之行一諸人等者是人一成佛道者是理一。",
        "translation": "This line opens the door for śrāvakas and pratyekbuddhas to enter the One Vehicle. How do you know this? For example, the Mahāprajñāpāramitā praises the arhat's mind as being gentle and pliable, and the Jingming class says that abiding in a mind of control is a noble practice.",
        "source": "X30n0605_002:0680a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三開人天乘二初約緣因顯實十初造塔明天乘。",
        "translation": "△Three ways to reveal the vehicles of humans and gods are two: first, we'll discuss the causes and conditions to show the truth; and first, we'll build a stūpa to reveal the vehicle of tomorrow.",
        "source": "X30n0605_002:0680a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛滅度已供養舍利者起萬億種塔金銀及頗梨硨磲與碼碯玫瑰瑠璃珠清淨廣嚴飾莊校於諸塔或有起石廟旃檀及沈水木樒并餘材甎瓦泥土等若於曠野中積土成佛廟。",
        "translation": "Those who have consecrated the relics of the buddhas since their death erect a trillion kinds of stūpas, such as gold, silver, pāri, trident, agate, and rose-glass beads, that are pure, extensive, and decorated, or they may erect stūpas of stone, sandalwood, sunken water, wood, utensils, tiles, clay, and so forth.",
        "source": "X30n0605_002:0680a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行半約造塔明天乘在因時至心傾財捨寶果時任運自然受樂故是天乘也金光明最勝經云以佛舍利如芥粟許置小塔中三十三天已有自然果報即其義也增一阿含云佛因手擎舍利廣讚歎已令於四衢而起偷婆佛言四人應起塔何等為四謂輪王羅漢支佛佛也輪王無級羅漢四級支佛十一級如來十三級阿難問佛如來出世悲憫眾生滅後起塔獲大功德其餘三塔於諸眾生有何等利佛言支佛悟法因緣入深法性能為人天而作福田羅漢生分已盡能為世間而作福田輪王以十善化物以是因緣應當起塔供養之也如來塔者高十三層辟支佛塔應十一層羅漢四層輪王無級何以故未脫三界諸有故木樒者長安有木名樒亦任造像又廣志云出交州字林云香木玉云其樹似槐而香金銀頗梨硨磲碼碯如向已釋玫瑰者火珠也又石之奇美名玫圓淨曰瑰郭璞云石珠也琅玕也出于崐崙開明山栴檀沈水者栴檀已如前釋沈水者異物志云出日南國凡欲取時先斫委地數年令外朽爛其中貞堅者置水則沈故得其名其次不沈名為機香。",
        "translation": "These three and a half practices are about building stūpas. The Mahāyāna vehicle is the natural outcome of spontaneously enjoying the fruits of abandoning wealth and treasure at the time of cause.",
        "source": "X30n0605_002:0680a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明人業。",
        "translation": "△Two things clarify human behavior.",
        "source": "X30n0605_002:0680b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至童子戲聚沙為佛塔如是諸人等皆已成佛道。",
        "translation": "Even a boy who plays with sand to make a stūpa for a buddha, such people have all accomplished the Buddha Way.",
        "source": "X30n0605_002:0680b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初一行明童子戲沙作塔即是人業因時汎汎悠然作善果時作意勤求得樂故人業也童子者應法師云七八歲已上乃至未娶者之總名釋名曰十五曰童故禮有有陽童牛羊無角曰童山無草木曰童言未巾冠似之也。",
        "translation": "The first line explains that when the boy plays with sand to make a stūpa, that's human action. When it's caused, it's abundant and leisurely done, and when it's accomplished, it's done with intent and diligence to attain happiness, so human action is also child.",
        "source": "X30n0605_002:0680b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明天業。",
        "translation": "△Three are tomorrow's activities.",
        "source": "X30n0605_002:0680b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人為佛故建立諸形像刻彫成眾相皆已成佛道或以七寶成鍮鉐赤白銅白鑞及鉛鍚鐵木及與泥或以膠漆布嚴飾作佛像如是諸人等皆已成佛道彩畫作佛像百福莊嚴相自作若使人皆已成佛道。",
        "translation": "If a person creates images for the sake of the Buddha, carves and sculpts them to create a multitude of appearances, they've all accomplished the Buddha Way.",
        "source": "X30n0605_002:0680c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次四行約至心造像明天業文云刻彫彩畫作佛像者然造像之始各有緣興故增一阿含云佛升忉利以神足力制諸弟子不令知處二王憶佛因成大患大臣白王應當造像供養於是優填王用牛頭栴檀雕佛像高五尺此雕像始也時波斯匿王聞優填王用香雕像彼乃用紫磨黃金鑄佛像亦高五尺此鑄像始也然彼雕像初召工巧與重寶賞無能作者毗首羯磨化為人來為王作之下斧之聲上至忉利聞者解脫內典錄云後漢明帝永平七年使秦景往月支國得優填王雕像尋至洛陽勅圖聖相於西陽城門與眾景仰以為法式即此土畫像始也若準冥祥記此土造像總有一十八處故大唐弘福寺沙門彥悰撰東夏三寶感通錄文有三卷其中卷列靈像垂應之緣乃有五十餘目彼文之初引冥祥記云西晉愍帝建興元年吳郡吳縣松江滬瀆口漁者華焉遙見海中有二人忽現浮游水面漁人疑是海神遂延巫祝備牲牢迎之風濤彌盛時有奉佛居士朱膺者聞而歎曰將非大覺之垂降乎乃齋潔稽首迎之俄頃驚波遽息浮江二人隨潮入浦漸近俞明始知是石像焉像之背銘一曰維衛一曰迦葉莫測帝代而書跡分明舉高七尺有沙門法開者來自西域乃稱經說東方有二石像或供養奉覲者除積劫罪又東晉周[土*已]字宣佩仕至吳興太守家世奉佛其女尤甚精進家僮捕漁忽見金光溢川映流而上尋即投網得一金像高三尺許形相嚴麗浮水而住牽排不動馳往白[土*已][土*已]仍告女乃以人船送女往迎彼女遙見歡喜禮敬除以手挽即得上船歸家供養於後一夕忽夢彼佛稱左膝痛及覺往觀果有穿處即以金釵補之然彼瑞像感騐尤多冥祥記者即南齊太原王琰撰文有十卷鉛鍚者記云鉛青鍚白鉛輭錫堅並名青金又物類志云或以雜草積之數年日就月將草涎入地化成鉛鍚或以膠漆布者優婆塞戒經不許用膠得失意罪而此經用者古師云外國用樹膠光宅言或有處無樹膠必須於像聽許用牛皮膠若有他物即不得用也有言大豆汁可代膠清然牛皮終是不淨物後得不淨果報又不淨錢不任造像可換取如法淨錢造像又地持不許用雌黃臭物不空所譯仁王經念誦法言其畫像不許用皮膠當用香膠也或以糯米汁用調彩色為嘉又戒經不許造半身像得失意罪皆由善相不起墮落生死中無益於事又造像功德經有十一功德一者世世眼目清潔二者生處無惡三者常生貴家四者身如紫磨金色五者豐饒珍玩六者生賢善家七者生得為王八者作金輪王九者生於梵天壽命一劫十者不墮惡道十一者後生還能敬重三寶又云若人臨終發言造像乃至如&#;麥能除三世八十億劫生死之罪。",
        "translation": "The next four practices are about arriving at the mind to create an image. Tomorrow's karma text says that engraving, painting, and decorating Buddha images are the beginnings of the creation of images, but the beginnings of the creation of images have their own conditions, so it's said in the Incremental Āgamas that the Buddha ascended to the ghettos and used his miraculous powers to restrain his disciples from knowing where the two kings had become very troubled because of their recollection of the Buddha.",
        "source": "X30n0605_002:0680c05_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△四明人業。",
        "translation": "△Four things explain human behavior.",
        "source": "X30n0605_002:0681b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乃至童子戲若艸木及筆或以指爪甲而畫作佛像。",
        "translation": "Suppose a child plays with cursive, wood, a brush, or fingernail nails to paint an image of the Buddha.",
        "source": "X30n0605_002:0681b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如文可解。",
        "translation": "That's explained in the text.",
        "source": "X30n0605_002:0681b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五結成顯實。",
        "translation": "△5. He forms bonds that reveal their true nature.",
        "source": "X30n0605_002:0681b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是諸人等漸漸積功德具足大悲心皆已成佛道但化諸菩薩度脫無量眾。",
        "translation": "Thus, these people gradually accumulate merit, fully possess the mind of great compassion, and have all become buddhas and liberated measureless multitudes of bodhisattvas.",
        "source": "X30n0605_002:0681b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次一行半結成顯實如是諸人此成人一漸漸積功德具足大悲心即成行一成佛道即成理一既已成佛復能化他但化菩薩即是教一。",
        "translation": "The next line and a half of the sentence conclude that it's true that these people who have gradually accumulated merit and perfected the mind of great compassion have become one in practice, which is the accomplishment of the Buddha Way, which is the accomplishment of the principle, and that having accomplished Buddhahood, they can then teach others.",
        "source": "X30n0605_002:0681b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六約諸塵供養明天業。",
        "translation": "△Sixth, suppose he makes offerings to the dust of the world as a result of tomorrow's activity.",
        "source": "X30n0605_002:0681b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人於塔廟寶像及畫像以華香幡葢敬心而供養若使人作樂擊鼓吹角貝簫笛琴箜篌琵琶鐃銅鈸如是眾妙音盡持以供養或以歡喜心歌唄頌佛德乃至一小音皆已成佛道。",
        "translation": "If a person makes offerings to the precious images of stūpas and temples with flowers, incense, banners, and reverence, or if they cause someone to make music, beat drums, blow horns, scales, flutes, lutes, harps, pipas, cymbals, and so forth, they might make offerings to all of these wonderful sounds, or sing and praise the merits of the Buddha with joyful hearts, even to the point where a small sound has become the Buddha's path.",
        "source": "X30n0605_002:0681b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行半約諸塵供養明天業以華香幡葢者幡本作旛今亦通用敬心而供養者如大集經云佛在世時有婆多迦過去曾作一長幡於婆尸佛塔上從是已來九十一劫天上人中常有大幡覆陰其上受福快樂於後出家得羅漢果又云若人懸幡風吹一轉受一轉輪王位乃至是幡爛壞為塵一塵一小王位百緣經云昔有長者名曰寶葢是長者於過去世曾將一寶珠葢於毗婆尸佛舍利塔頭從是已來九十一劫天上人中常有自然寶葢以覆其頂於後值佛出家獲證聖果若使人作樂者世本云黃帝時伶倫作樂擊鼓者世本云夷作鼓以枹擊之云鼓也吹謂鼓吹也月令云命樂正習吹角者通典云書傳所不載或出羗胡馬融云出吳越間貝者大蠡也可容數升並吹之以節樂亦出南蠻簫者世本云舜所置也其形參差象鳳翼有十管長二尺一名籟前代有洞簫今時亦間有也蔡邕云簫者編竹為之而有底大者二十三管小者一十六管長則濁短則清以密蠟實其底或增減得宜則其聲和笛者風俗通云丘仲所造長一尺四寸有七孔琴者世本云神農所造又琴操云伏義作琴所以修身理性反其天真耳白虎通云琴者禁也謂所以禁止淫邪正人心也廣雅云長三尺六寸以象三百六十日五絃象五行大絃為君寬和而溫小絃為臣清廉不亂文王武王加二絃以合君臣之恩也爾雅云大琴謂之離有二十七絃今無其器琴譜云弄琴之法急若繁星不亂緩如流水不絕其間作用若孤雲在太虗爾箜篌者白虎通云漢武帝命樂工候調作或云候暉造其聲坎坎然以應奏節故謂之坎候其聲訛轉為空候耳候者因彼樂工而得名也琵琶者漢遣烏孫公主嫁昆彌念其道行故思慕無已使工巧裁箏筑為馬上之樂以手推却前後而奏聲故名琵琶耳鐃者通典云鐃如編鐘而無舌有柄搖之以止鼓又漢鼓吹曲有鐃歌釋名曰鐃者謂其聲鐃鐃然因以名之銅鈸者疏云長安人呼露盤為銅鈸唄者或云唄匿此云讚頌本出于西方此土按梁宣騐記云陳思王姓曹名植字子建魏武帝第三子十歲善文藝私製轉七聲植曾游漁山於巖谷間聞誦經聲遠谷流美乃效之而製其聲又佛道論衡云陳思王幼含珪璋十歲能文每讀內典輙踟蹰嗟玩以為至道之宗極也用是遂製轉讀七聲為升降曲折之響世之諷誦咸憲章焉甞游漁山忽聞空中梵天之響清颺哀婉中心有感獨聽良久其間從者莫得而聞植則深感神理彌悟法音因慕其聲遂節寫為梵唄撰文製章傳為後式以故梵聲光顯始於此也又賢愚經云波斯匿王欲行征伐時祇桓中有一比丘形極矬陋而彼音聲奇美清徹異常震聲高唄韻益和暢軍眾傾耳無有厭足王乃問佛今是比丘以何因緣形貌醜陋其聲乃爾佛告大王過去有佛名曰迦葉度人訖已便般涅槃王收舍利起塔供養即勅監典各主一邊一監懈怠功獨不成王遂責之其人懷恐便白至言此塔太高何時當成及王去後其塔繼就顯然可觀其人即便悔前過咎持一金鈴著塔剎頭仍立誓言願我生生音聲極妙當來有佛號釋迦文令我得見度生死苦以是因緣果報若斯以嫌塔高報身矬短以施鈴故今蒙解脫獲妙音響毗尼母論云佛告諸比丘聽汝等唄唄者即是言說之辭十誦律云為諸天聞唄心喜故也或音樂舞伎螺鈸蕭韶發歡喜心種種供養昔者提婆颺唄清響徹於淨居釋尊入定琴歌震於石室當知園林樓觀是入法界之法門音聲語言總成佛事之法語。",
        "translation": "These three and a half practices are about the offerings of the dust of tomorrow's karma with flowers, incense, banners, banners originally made as pennants, but now they are also commonly used with respect and offerings.",
        "source": "X30n0605_002:0681b18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△七散心塵供明人業。",
        "translation": "△Seven distracting mental dusts are offered to illuminate human behavior.",
        "source": "X30n0605_002:0682b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人散亂心乃至以一華供養於畫像漸見無數佛。",
        "translation": "Suppose a person distracts his mind up to the point where he makes an offering of a single flower to a picture image and gradually sees countless buddhas.",
        "source": "X30n0605_002:0682b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "前一行約散心用塵供養明人業也大思惟經云若不散華獻佛雖得往生依報不具賢愚經云舍衛國中有豪富長者生一男兒面貌端嚴天雨眾華積滿其舍遂名天華乃至出家得羅漢果阿難白佛天華何福而得如是佛言過去有佛名毗婆尸有一貧人見僧歡喜即於野澤采眾草華用散大眾爾時貧人者今天華是以散華故九十一劫身體端正意有所須隨念即至因果經云若以一華散空供十方佛乃至畢苦其福不盡。",
        "translation": "The previous line talks about scattering the mind and making offerings with dust to explain human actions. The Sutra of Great Contemplation says that if someone doesn't scatter flowers and offer them to the Buddha, even though they may attain the reward of rebirth in the Pure Land, the reward is not complete.",
        "source": "X30n0605_002:0682b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△八身業供養明天人。",
        "translation": "△Eight bodily karmic offerings are made to those of tomorrow.",
        "source": "X30n0605_002:0682b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有人禮拜或復但合掌乃至舉一手或復小低頭。",
        "translation": "Sometimes a person pays homage, or maybe they just fold their palms or even raise one hand, or maybe they bow their head slightly.",
        "source": "X30n0605_002:0682b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "禮拜一句五體著地是上禮即天業合掌低頭是中禮是人業應知禮拜則屈伏無明深投覺地至若致敬之極當如樹倒山崩所以業報差別經云禮佛一拜從其膝下至金剛際一塵一轉輪王位獲十種功德一得妙色身二出言人信三處眾無畏四諸佛護念五具大威儀六眾人親附七諸天愛敬八有大福德九命終往生十速證涅槃三藏勒那云發智清淨禮者良由達佛境界慧心明利了知法界本無有礙由我無始順於凡俗非有有想非礙礙想今達自心虗通無礙故行禮拜隨心現量禮於一佛即禮一切佛禮一切佛即是禮一佛何則由如來法身體用融通故也所以禮佛一拜則是徧通法界於六道四生同作佛想文殊菩薩云心不生滅故敬禮無所觀內行平等外順修敬內外冥合名平等禮天台云當禮拜時雖不見能禮所禮然而影現法界一一佛前皆見自身而禮拜也然散華禮拜之文既出經論本乎金口誠實之言因便引明以助思修共期佛果餘皆準此。",
        "translation": "The phrase \"worshiping with five bodies on the ground\" refers to upward worship, which is the karma of gods. Clasping one's hands and lowering one's head refers to middle worship, which is the karma of humans. You should know that worshiping subdues ignorance and plunges deeply into the ground of awakening to the point where if you pay homage to the utmost, it'll be like a tree falling down and a mountain crumbling.",
        "source": "X30n0605_002:0682b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△九結成顯實。",
        "translation": "△9. The conclusion reveals the truth.",
        "source": "X30n0605_002:0682c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此供養像漸見無量佛自成無上道廣度無數眾入無餘涅槃如薪盡火滅。",
        "translation": "This image of an offering gradually sees measureless buddhas who have accomplished the unsurpassed path on their own and have extensively liberated measureless multitudes into nirvāṇa without remainder like fuel going out of a fire.",
        "source": "X30n0605_002:0682c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行半是結成非但顯實自成佛道亦能開權化他薪盡涅槃也故云廣度無數眾入無餘涅槃也。",
        "translation": "This half of the line is a formation that not only reveals the truth of his own attainment of Buddhahood but also opens up the power to teach others and extinguishes the firewood in nirvāṇa; therefore, it's called extensively liberating measureless multitudes into nirvāṇa without remainder.",
        "source": "X30n0605_002:0682c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△十口業供養明人業。",
        "translation": "△Ten Oral Actions and Offerings to Brighten People's Actions.",
        "source": "X30n0605_002:0682c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人散亂心入於塔廟中一稱南無佛皆已成佛道。",
        "translation": "If a person's mind is distracted and they enter a stūpa or temple, then they'll say, \"Namo Buddha,\" once they've achieved the Buddha Way.",
        "source": "X30n0605_002:0682c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次一行約口業例上應具天人業今但出人業一稱南無佛者南無甚眾當知只是歸命之義而云救我度我等也一稱佛名而成佛道者此約今經開顯之意以判之是則屬乎通記觀經亦云一稱佛名能消八十億劫生死重罪寶積經云高聲念佛魔軍退散文殊般若經云眾生愚鈍觀不能解但令念聲相續自得往生智度論云譬如有人初生墮地即能日行千里足一千年滿中七寶以用布施不如有人於後惡世稱佛一聲其福過彼大品般若云若人散心念佛乃至畢苦其福不盡增一阿含云以四事供養滿閻浮提一切眾生善心相續稱佛名號於一食頃功德過上不可思議無能量者三昧寶王論云浴大海者用於百川念佛名者必成三昧亦猶明珠投於濁水濁水不得不清念佛攝於亂心亂心不得不佛既契之後心佛雙亡雙亡定也雙照慧也定慧既均亦何心而不佛又何佛而不心心佛既然是則萬境萬緣無非三昧者也所以業報差別經云高聲念佛誦經者有十種功德一能排眠二天魔怖懼三聲徧十方四三途息苦五外聲不入六令心不散七勇猛精進八諸佛歡喜九三昧現前十生於淨土大集經云或一日夜或七日夜不作餘業小念見小大念見大又般若經文殊問佛云何速得阿耨菩提佛答有一行三昧欲入此三昧者應須於空閒靜處捨諸亂意不取相貌繫念一佛專稱名字隨佛方所端身正向能於一佛念念相續此即是念中得見過去未來現在諸佛晝夜常說智慧辨才終不斷絕報恩經云華林園第三大會有九十二億人而成佛者此是於今釋尊遺法之中一稱南無佛人也以是而知佛力難思玄通罕測如石吸鐵似水投河慈善根力任運如是至心信者靈感昭然方今濁世唯此為真誡簡要之門偉遇易行之道所以廣引明據實彼信心賢者能遵定蒙深益。",
        "translation": "The next line is about verbal actions, for example, the above should be accompanied by the actions of gods and humans. Now, we're only talking about human actions. One who calls himself Namo Buddha is a person who doesn't belong to the great multitude of people. One who calls himself Buddha's name and has achieved the Buddha Way is someone who judges this according to the revealed meaning of the present sūtra.",
        "source": "X30n0605_002:0682c22_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△二約了因顯實。",
        "translation": "△Two, it's about understanding the cause and revealing the truth.",
        "source": "X30n0605_002:0683b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於諸過去佛現在或滅後若有聞是法皆已成佛道。",
        "translation": "If there are people who hear this teaching, whether the buddhas of the past are present or have ceased, they've all achieved the Buddha Way.",
        "source": "X30n0605_002:0683b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行明了因種子例上皆具有相非有相非無相至心散心等五乘種子今皆開之令入一實若至心聞一句是天業若散心聞一句是人業問何意約過去佛門廣明五乘答三世諸佛皆有開權但未來未起現在始行於證義弱過去開權已久其受化之人皆成四一並於十方施權顯實證義事強搆之虗言不如驗之以實故於過去佛廣說五乘於義為便。",
        "translation": "In this line, he explains that the five vehicle seeds, such as the well-known cause seeds, all have characteristics, not characteristics or no characteristics, and the supreme mind and distracted mind are now opened up to bring them into the single reality.",
        "source": "X30n0605_002:0683b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌未來佛章二初頌開三。",
        "translation": "△Two Verses on the Buddha of the Future Chapter Two First, the verse begins with three.",
        "source": "X30n0605_002:0683b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來諸世尊其數無有量是諸如來等亦方便說法一切諸如來以無量方便。",
        "translation": "\"The number of future world-honored ones will be countless, and these tathāgatas and others will skillfully teach all tathāgatas with measureless skillful means.",
        "source": "X30n0605_002:0683b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此下一行半頌開三如文可解。",
        "translation": "The next line and a half of verse here opens the third, as the text makes clear.",
        "source": "X30n0605_002:0683b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌顯一四初頌人一。",
        "translation": "△Two verses reveal one of the four first verses, \"People.",
        "source": "X30n0605_002:0683b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "度脫諸眾生入佛無漏智若有聞法者無一不成佛。",
        "translation": "'Liberate all sentient beings and enter the Buddha's untainted wisdom.' If there's anyone who hears the teaching, there's no one who doesn't become a buddha.",
        "source": "X30n0605_002:0683b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此五行頌顯一初度脫諸眾生一行頌人一。",
        "translation": "These five lines of verse reveal the first one, which liberates sentient beings, and the first one praises the person as one.",
        "source": "X30n0605_002:0683b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌行一。",
        "translation": "△Two verse lines praising practice one.",
        "source": "X30n0605_002:0683b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛本誓願我所行佛道普欲令眾生亦同得此道。",
        "translation": "\"The buddhas originally vowed that the buddha path I'm practicing would cause sentient beings to attain that path as well.",
        "source": "X30n0605_002:0683b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次諸佛本誓願一行頌行一佛所行道誓令得此道豈非行一也。",
        "translation": "Next, the buddhas originally vowed that one verse would praise the practice of the path practiced by one buddha, vowing to cause them to attain that path? Is that not the practice of the one?",
        "source": "X30n0605_002:0683c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌教一。",
        "translation": "△Three verse verses teach oneness.",
        "source": "X30n0605_002:0683c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來世諸佛雖說百千億無數諸法門其實為一乘諸佛兩足尊知法常無性佛種從緣起是故說一乘。",
        "translation": "Although the buddhas of future ages will teach a hundred trillion incalculable teachings, they're really the One Vehicle.",
        "source": "X30n0605_002:0683c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三未來諸世尊兩行頌教一知法常無性者實相常住無自性乃至無無因性無性亦無性是名常無性記云知法常無性等一實理上性相二空無性性空即無四性既云實相無自性等故知即是理性性空性空既爾相空準知無性亦無即是相空故知經中一無性言具二無性即是無性性無相性也本自有之故曰常無知者照也具如止觀第五不思議境中一念三千非自他等既無四性一念亦無即是性空既無一念無念亦無即是相空即是不思議之二空也若不了今家依於智論中論等準理準義緣於心性立此二空諸無可準非用法相者之所逮也故於實道須閑修性若本自二空即是性德若推檢入空即是修得推而不成須修萬行正助合行行中具足一切諸行方名緣因聞斯義已方乃名開問世間因緣可以四句了生無生今性本淨非關緣起何須以此四句推之答世緣起法亦本無生但由情計謂之為生理性亦爾由謂自他等故須推之二空不顯尚須更約續待推檢況因緣耶佛種從緣起者中道無性即是佛種迷此理者由無明為緣則有眾生起解此理者由教行為緣則有正覺起欲起佛種須一乘教此即頌教一也又無性者即正因佛性也佛種從緣起者即是緣了以緣資了正種得起一起一切起如此三性名為一乘也。",
        "translation": "The three future world-honored ones who have two lines of verse and teach one know that the Dharma is always without nature because its true nature is always abiding, has no essence, and even has no cause, no nature, and no nature is called always without nature.",
        "source": "X30n0605_002:0683c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌理一。",
        "translation": "△The four verses on the principle of oneness.",
        "source": "X30n0605_002:0684a04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是法住法位世間相常住於道場知已導師方便說。",
        "translation": "'This is the dharma-status of the Dharma abiding worldly characteristics that are always present in the site of enlightenment,' said the guide in a skillful manner after he knew it.",
        "source": "X30n0605_002:0684a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四是法住法位一行頌理一也眾生正覺一如無二悉不出如皆如法為位也世間相常住者出世正覺以如為位亦以如為相位相常住世間眾生亦以如為位亦以如為相豈不常住世間相既常住豈非理一又釋世間者即是陰界入也常住者即正因也然此正因不即六法緣了不離六法正因常故緣了亦常故言世間相常住也於道場知已此舉果釋成開權顯實道場朗然斯理久暢物情障重方便施三。",
        "translation": "The four verses on the abiding Dharma state and the one verse on the principle of oneness are that sentient beings and right awakening are the same, not two, and none of them are free from thusness, and they are all thusness in their states.",
        "source": "X30n0605_002:0684a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌現在佛章三初頌施化意。",
        "translation": "△Four Verses on the Present Buddha Chapter Three The first verse is about the meaning of giving and transforming.",
        "source": "X30n0605_002:0684a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天人所供養現在十方佛其數如恒沙出現於世間安穩眾生故亦說如是法。",
        "translation": "The offerings made by gods and humans to the present buddhas of the ten directions are as numerous as the sands of the Ganges, and they appear in the world to stabilize sentient beings; therefore, they also explain the teaching like this.",
        "source": "X30n0605_002:0684a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四行半頌現在佛章上文有四今但頌三惟不頌後結於中初一行半是頌施化之意正為安穩眾生。",
        "translation": "These four and a half lines of praise to the present Buddha are four in number, but now we'll only praise three but not the last one. The first line and a half of the verse is about the intention to teach and stabilize sentient beings.",
        "source": "X30n0605_002:0684a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二顯實。",
        "translation": "△Two reveal the truth.",
        "source": "X30n0605_002:0684a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知第一寂滅以方便力故雖示種種道其實為佛乘。",
        "translation": "Knowing the first tranquility is really the Buddha vehicle even though it shows various paths because of the power of skillful means.",
        "source": "X30n0605_002:0684a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌上顯實知第一寂滅即頌理一其實為佛乘或頌教一或頌行一。",
        "translation": "The verse above shows the truth. Knowing the first tranquility is a verse that praises the oneness of principle, which is really the Buddha vehicle, or a verse that praises the oneness of teaching, or a verse that praises the oneness of practice.",
        "source": "X30n0605_002:0684a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三開權。",
        "translation": "△Three unveil the provisional.",
        "source": "X30n0605_002:0684a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知眾生諸行深心之所念過去所習業欲性精進力及諸根利鈍以種種因緣譬喻亦言辭隨應方便說。",
        "translation": "He knows the depth of sentient beings' activities, what they think about in their minds, what they've done in the past, their karmic desires, their energy, their faculties, and their sharpness and dullness, and he explains them according to various causes and conditions, using metaphors and expressions as appropriate.",
        "source": "X30n0605_002:0684a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是頌開權如文。",
        "translation": "This verse discloses the provisional teaching as the text.",
        "source": "X30n0605_002:0684b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌釋迦章二初略頌上權實二初頌顯實。",
        "translation": "△Two verses on Śākyamuni, two short verses on the provisional and the real, and the first verse revealing the real.",
        "source": "X30n0605_002:0684b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今我亦如是安穩眾生故以種種法門宣示於佛道。",
        "translation": "\"Now, I too have thus stabilized sentient beings and have therefore proclaimed the Buddha Way through various teachings.",
        "source": "X30n0605_002:0684b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此兩行略頌上權實為下總譬作本所言譬本者然上根已悟中根未曉故須作喻還譬上法然譬不孤起承躡有由故言譬本也今約總頌中有六意得為總譬六義作本偈云今我亦如是我即釋迦是一化之主為下有大長者譬作本安穩者即大涅槃常樂住處也此處寂靜無五濁障故名安穩安穩對不安穩不安穩即三界生死行化之所有五濁障名不安穩此即為下火宅譬作本眾生即是五道受化之徒為下五百人譬作本又安穩者即是安穩法還對不安穩法不安穩者即五濁法也為下火起譬作本種種法門即對不種種為下唯有一門譬作本。",
        "translation": "These two lines of an outline verse praise the higher expedient and the real, and create the basic general metaphor for the lower level. The reason we say \"basic metaphor\" is that although the higher faculties have been enlightened, the middle faculties haven't yet understood it, so we need to create a metaphor and return to the higher teachings, but the metaphor isn't isolated from the other six meanings of the general metaphor, so we say, \"Now, I, too, am thus. I am Śākyamuni, the lord of the one transformation, and I create the basic metaphor for the great elder below.",
        "source": "X30n0605_002:0684b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌開權。",
        "translation": "△Two verses reveal the authority.",
        "source": "X30n0605_002:0684b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我以智慧力知眾生性欲方便說諸法皆令得歡喜。",
        "translation": "'By the power of wisdom, I know the nature and desires of sentient beings and skillfully explain the various dharmas to make them rejoice.'",
        "source": "X30n0605_002:0684b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知眾生性欲者即是五道根性有三乘之差別為下三十子譬作本向上即是略頌權實向下即是為總譬本本末相承文義整足至下譬喻品中當更引上證下記云本末相承等者本法說也末譬等也。",
        "translation": "Knowing the nature and desires of sentient beings, that is, the nature of the five paths, the distinction between the three vehicles, the thirty lower-level sons, and the parable for the origin, upward is a brief verse on expedient and true, and downward is a general parable on the origin, the mutual continuity of origin and destination, and the complete textual meaning of the lower-level parables.",
        "source": "X30n0605_002:0684b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二廣頌上六義六初頌五濁開三二頌施方便化三頌顯實四頌歎法希有五頌不虗六頌敦信初文又三初約能見之眼。",
        "translation": "△Two broad verses on the six meanings of the above six verses, the first five verses on the turbid opening three, two verses on the teaching of generosity, three verses on the manifestation of reality, four verses on the praise of the rarity of the Dharma, five verses on the unsurpassed, and six verses on the firm belief in the beginning three more verses.",
        "source": "X30n0605_002:0684b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知我以佛眼觀。",
        "translation": "\"Śāriputra, you should know that I see with the Buddha's eye.",
        "source": "X30n0605_002:0684c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初半行一字明佛眼觀見為後長者能見譬作本我以佛眼觀見者下文云長者在門外立舉下證上因知佛在法身之地以常寂佛眼圓照羣機若根利濁輕則以盧舍那像說一乘法若根鈍濁重則脫瓔珞以老比丘像驚入火宅方便開三秖是于時鑒機故言我以佛眼觀見也問若觀色法應用天眼若分別根機應用法眼云何言以佛眼見耶答佛眼圓通舉勝兼劣又四眼入佛眼皆名為佛眼。",
        "translation": "The first half of the sentence explains that the Buddha's eye observes views as a metaphor for the elders who see later. I observe views with the Buddha's eye.",
        "source": "X30n0605_002:0684c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明所見五濁。",
        "translation": "△Two, it shows the five turbidities in what's seen.",
        "source": "X30n0605_002:0684c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見六道眾生貧窮無福慧入生死險道相續苦不斷深著於五欲如犛牛愛尾以貪愛自蔽盲瞑無所見不求大勢佛及與斷苦法深入諸邪見以苦欲捨苦。",
        "translation": "They see that sentient beings in the six destinies are poor, lack merit and wisdom, and enter the perilous path of birth-and-death with unremitting suffering, deeply addicted to the five desires like a yak loving its tail, blinded by craving, and lacking vision, not seeking the Buddha of great power or the Dharma that stops suffering, and deeply penetrating into wrong views with the desire to abandon suffering.",
        "source": "X30n0605_002:0684c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次六道眾生下有兩行三句四字明所見五濁貧窮無福慧半行頌眾生濁也入生死險道相續苦不斷頌命濁也深著於五欲一行頌煩惱濁也不求大勢佛及與斷苦法頌劫濁也深入諸邪見以苦欲捨苦頌見濁也或云五熱炙身欲望捨苦反得苦報或云諸見即是受受即是苦行此苦因望欲捨苦豈可得耶普曜曰明五道源來五戒為人十善生天慳貪墮餓鬼觝突墮畜生十惡墮地獄無五趣五陰六衰則是泥洹不處生死不住泥洹便受菩提決地獄者此方之名胡稱泥梨秦言無有無有喜樂無氣味無歡無利故云無有畜生者形旁行旁故名畜生亦云旁生或云徧有以由此趣徧於五道四天及三十三天皆悉徧有也然上天所乘象馬等是福業化作非眾生數也又畜生者名盲瞑盲瞑者無明多故名畜生劫初時皆解聖語後因飲食異則諂曲心行其語皆變遂不復能語鬼者胡言闍梨哆秦言祖父眾生最初生彼道名祖父後生者亦名祖父又慳貪墮此趣此趣多饑渴故名餓鬼亦被諸天驅使亦希望飲食故名餓鬼人者胡言摩[少/兔]奢此云意昔頂生王初化諸有所作當善思惟善籌量善憶念即如王教諸有所作先思量憶念故名人為意又人能息意能修道得達分又云人名慢五道中多慢者稱人趣也阿修羅者修羅名天阿言非非天故稱阿修羅謂彼常與天鬬又無天行天者天然自然勝樂勝身勝故天名勝眾事悉勝於餘趣常以光自照故名為天阿含云眾生是假名界是法五趣眾生與法界和合也若眾生行不善心時與不善界俱行善心時與善界俱行勝心時與勝界俱行鄙心時與鄙界俱是故比丘當作是學善種種界前是因緣釋六趣後似觀心釋六趣也然此六趣是名輪迴死此生彼初無休息如汲井輪互為高下凡聖相望是六界趣總名不善未脫生死之輪故華嚴云若人欲了知三世一切佛應觀法界性一切唯心造當知心能天堂心能地獄乃至四聖總由一心智者審思常當觀察如善牧人莫令縱逸犯人苗稼矧以初心博地昏散交馳二六時中恒宜檢束久久性成任運合道超凡預聖豈不幸哉犛牛者獸如牛而尾長說文云酉南夷有髦牛牛愛其尾就身護尾人愛其尾故殺其身譬如人貪五欲而害其身亦猶是也。",
        "translation": "Next, under Beings of the Six Destinies, there are two lines, three phrases, and four words that describe the five turbidities of views, poverty, lack of merit and wisdom, half a line verse on the turbidity of sentient beings, continuous suffering entering the perilous path of birth-and-death, verse on the turbidity of life, deep attachment to the five desires, one line verse on the turbidity of affliction, not seeking great strength, the Buddha, and the Dharma of ending suffering, verse on the turbidity of eons, delving into mistaken views and desiring to abandon suffering, verse on the turbidity of views, or views that are views that are feelings, feelings that are afflictions, and the opposite of abandoning suffering, or views that are the cause of suffering and desiring to abandon suffering.",
        "source": "X30n0605_002:0684c14_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△三明起大悲赴應。",
        "translation": "△3. Third, he shows that he's arisen from great compassion and is going to respond.",
        "source": "X30n0605_002:0685b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為是眾生故而起大悲心。",
        "translation": "It's for the sake of these sentient beings that he arouses the mind of great compassion.",
        "source": "X30n0605_002:0685b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而起大悲心者上舉能見次明所見今明大悲熏心應入三界施設方便引趣佛慧。",
        "translation": "The person who arouses the mind of great compassion first cites the subjective view, then explains the view, and now explains that the mind perfumed with great compassion should enter the three realms, define the method, and lead to the Buddha's wisdom.",
        "source": "X30n0605_002:0685b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌施方便化二初念用大化不得三初擬宜。",
        "translation": "△Two verse phrases praising the skillful transformation of sentient beings, the first being mindful that the use of great transformation isn't possible, and the third being appropriate.",
        "source": "X30n0605_002:0685b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我始坐道場觀樹亦經行於三七日中思惟如是事我所得智慧微妙最第一。",
        "translation": "When I first sat in the meditation hall, I observed the tree and went through the practice of contemplating such things for thirty-one days.",
        "source": "X30n0605_002:0685b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行半明念用大乘化之不得則為下身手有力而不用之寢大譬作本初明擬宜也始坐道場者然至理無時假時化物為化之初故言始也事釋者初在此處修治得道故言道場坐此樹下得三菩提故名道樹又感樹恩故觀察念地德故經行道成賽澤之時欲以大法擬宜眾生也觀心釋者樹即十二因緣之大樹深觀緣起自成菩提欲以無漏法林樹蔭蓋眾生故言觀樹經行者大乘三十七品是行道法自以道品履一切地得成佛道欲以此法化度眾生是故起行也問樹地無有分別豈須報恩耶答未曾有經云秪以通化傳法名報恩過去因果經云佛成道初一七日思惟我法微妙無能受者二七日思惟眾生上中下根三七日思惟誰應先聞法即至波羅奈為五人說四諦陳如得法眼淨頞鞞跋提十力迦葉摩訶男拘利未得道佛重說四諦四人得法眼淨佛又說五陰無常苦空非我五人得阿羅漢佛為佛寶四諦為法寶五人及佛是六阿羅漢即是僧寶三寶之興始於此也三七日者舊云思理教等又云勸誡等瑤師云事之至深至聖猶思而後行一七思惟佛智微妙二七思眾生根性不同三七思法藥萬品即舉偈證之我所得智慧微妙最第一眾生諸根鈍云何而可度今明佛在法身之地寂而常照恒以佛眼洞覽無遺豈始至道場淹留三七方思此事言三七者明有所表表佛初欲三周說法故假言三七耳初七思法說次七思譬說後七思因緣說皆無機不得是故息大施小也此偏就圓教大乘為釋耳若通途約大乘釋者初七思惟欲說圓教次七思惟欲說別教後七思惟欲說通教大乘皆無機不得是故息大說三藏三乘為方便之化也。",
        "translation": "This first line and a half clarify that mindfulness of using the great vehicle to convert doesn't obtain, then the lower body and hands are powerful but don't use it.",
        "source": "X30n0605_002:0685b13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△二明無機三初明障重。",
        "translation": "△Two explanations of the absence of opportunity and three first explanations of the seriousness of the hindrances.",
        "source": "X30n0605_002:0685c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生諸根鈍著樂癡所盲。",
        "translation": "The sentient beings' faculties are dull, they're attached to delusions of pleasure, and they're blinded by delusion.",
        "source": "X30n0605_002:0685c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行明無機中又為三初半行明障重。",
        "translation": "Of these three practices that illuminate the incompetence of sentient beings, there are three more, the first half of which illuminates the heaviness of the hindrances.",
        "source": "X30n0605_002:0685c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明不堪聞。",
        "translation": "△Two insights are unlistenable.",
        "source": "X30n0605_002:0685c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如斯之等類云何而可度。",
        "translation": "'How can these kinds of people be saved?'",
        "source": "X30n0605_002:0685c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次如斯下第二半行明不堪聞。",
        "translation": "Next, the second half of the teaching below this explains that they can't be heard.",
        "source": "X30n0605_002:0685c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明諸梵請。",
        "translation": "Third, it explains the requests of the priests.",
        "source": "X30n0605_002:0685c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸梵王及諸天帝釋護世四天王及大自在天并餘諸天眾眷屬百千萬恭敬合掌禮請我轉法輪。",
        "translation": "It was then that the Brahma Kings, the four heavenly kings of Indra, the four guardian kings, the Mahêśvara gods, and the rest of the heavenly retinue of tens of millions of people respectfully bowed their palms together and invited me to turn the Dharma wheel.",
        "source": "X30n0605_002:0686a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時諸梵王下有二行明諸梵雖請說大佛知無機所以不說爾時諸梵王者別而為語但在一十八梵若約通論應該大千諸梵欲天帝釋亦應然也言十八梵者初禪有三謂梵眾梵輔大梵二禪有三謂少光無量光光音三禪有三謂少淨無量淨徧淨四禪有九謂無雲福生廣果無想無煩無熱善現善見色究竟及諸天帝釋者此就欲天為語所言諸天者即是妙高山其山有四角每角有八天中間善法堂帝釋天居之統王三十二今文兼主伴所以云也如上諸天眾並合掌致敬殷勤勸請轉大法輪言法輪者諸佛凡有所說皆名法輪葢輪者有乎運轉摧破之義所謂運正法輪摧邪制外者也。",
        "translation": "At the time, there were two lines under \"Brahmā Kings\" that explained that although the Brahmās had requested to speak, the Buddha knew there was no opportunity and therefore didn't speak about them.",
        "source": "X30n0605_002:0686a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三念息大化二初強說有損。",
        "translation": "△Three times he was mindful of the great transformation, and the first time he forcefully explained that there was harm.",
        "source": "X30n0605_002:0686a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我即自思惟若但讚佛乘眾生沒在苦不能信是法破法不信故墜於三惡道。",
        "translation": "I immediately thought to myself, \"If I only praise the Buddha's vehicle, sentient beings who are trapped in suffering can't believe in this Dharma; they don't believe in the Dharma and therefore fall into the three evil destinies.",
        "source": "X30n0605_002:0686a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二行明念欲息化又二初一行半明無機強說聞則有損。",
        "translation": "These two lines illustrate the transformation of mindfulness of desire, and the first two lines and a half illustrate the harm that comes from speaking forcefully without opportunity.",
        "source": "X30n0605_002:0686a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二息化。",
        "translation": "△Two are about calming and transforming.",
        "source": "X30n0605_002:0686a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我寧不說法疾入於涅槃。",
        "translation": "'I'd rather not explain the teaching and quickly enter nirvāṇa.'",
        "source": "X30n0605_002:0686a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後半行正明息化作方便張本。",
        "translation": "The second half of the line correctly explains that calming and transforming is a method of reciting the source.",
        "source": "X30n0605_002:0686a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二念同諸佛用三乘化得二初正明化得四初明三乘擬宜。",
        "translation": "△Two kinds of mindfulness are the same as the buddhas' use of the three vehicles to convert two, first, they correctly explain the four ways to convert, and first, they explain the appropriateness of the three vehicles.",
        "source": "X30n0605_002:0686a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尋念過去佛所行方便力我今所得道亦應說三乘。",
        "translation": "He investigates the power of the methods practiced by the buddhas of the past, and the path I've now attained should also be described as the three-vehicle path.",
        "source": "X30n0605_002:0686a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行明三乘擬宜也尋念者念彼雖無大機不容永捨要以方便而誘濟之非都不知開三欲引同諸佛故云尋念也。",
        "translation": "This line explains the appropriateness of the three vehicles. Seeking mindfulness is remembering that even though they don't have great abilities, they can't permanently abandon them.",
        "source": "X30n0605_002:0686a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明有機二初明諸佛稱歎五初敘諸佛現。",
        "translation": "△Two explanations of the potential two first explanations of the praise of the buddhas five first descriptions of the buddhas' appearances.",
        "source": "X30n0605_002:0686b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作是思惟時十方佛皆現梵音慰喻我。",
        "translation": "When he thinks this, the buddhas of the ten directions all appear to comfort me with their Sanskrit sounds.",
        "source": "X30n0605_002:0686b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初三句釋迦自敘諸佛現佛現者由念佛方便力故現現由擬法會機二義故佛現也。",
        "translation": "The first three phrases of Śākyamuni's explanation of the buddhas' appearances are based on the power of mindfulness of the buddha's skillful means.",
        "source": "X30n0605_002:0686b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明諸佛正歎釋迦。",
        "translation": "△Two, the buddhas praise Śākyamuni.",
        "source": "X30n0605_002:0686b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善哉釋迦文第一之導師得是無上法隨諸一切佛而用方便力。",
        "translation": "\"It's good that Śākyamuni, the foremost teacher, has attained this unsurpassed teaching and follows all the buddhas with the power of their skillful means.",
        "source": "X30n0605_002:0686b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此明諸佛歎上欲大化於彼無機故諸佛不歎今欲說小曲會根緣則始終得度所以佛歎也能隱實設權故云善哉為一施三引入佛慧即是第一導師得是無上法者即是得實智微妙第一也而用方便力者隨諸一切佛隱實用權也。",
        "translation": "This shows that the Buddhas praised him for wanting to greatly transform those without opportunity, so the Buddhas didn't praise him for wanting to explain the lesser curves, meeting the faculties and conditions, and then finally attaining salvation in the beginning and end, so the Buddhas praised him for being able to conceal the truth and set forth expedients.",
        "source": "X30n0605_002:0686b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明諸佛亦隱實用權。",
        "translation": "△Three buddhas understand that they also use their powers in a hidden way.",
        "source": "X30n0605_002:0686b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等亦皆得最妙第一法為諸眾生類分別說三乘。",
        "translation": "We've also all attained the most subtle and highest dharma by discerning the three vehicles for each type of sentient being.",
        "source": "X30n0605_002:0686b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四雙釋二義。",
        "translation": "△Four explains the two meanings together.",
        "source": "X30n0605_002:0686b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "少智樂小法不自信作佛是故以方便分別說諸果。",
        "translation": "A little knowledge enjoys small dharmas and doesn't have confidence in becoming a buddha; therefore, we discern the fruits of these teachings with skillful means.",
        "source": "X30n0605_002:0686b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為眾生少智不堪聞大所以隱實而復樂小所以施權。",
        "translation": "Because sentient beings have little knowledge and aren't able to hear the great teaching, they conceal the truth and enjoy the lesser teaching, so they give it as a right.",
        "source": "X30n0605_002:0686b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五雙結二義。",
        "translation": "△5. They both conclude the two meanings.",
        "source": "X30n0605_002:0686b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復說三乘但為教菩薩。",
        "translation": "'Even though I've repeatedly explained the three vehicles, I'm teaching the bodhisattvas.'",
        "source": "X30n0605_002:0686b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復說三終為顯實。",
        "translation": "Even though he repeatedly teaches the three, it's always for the purpose of revealing the truth.",
        "source": "X30n0605_002:0686b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋迦酬順二初發言酬順。",
        "translation": "△Two Śākyamunis rewarded and conformed, and the first spoke of rewarding and conforming.",
        "source": "X30n0605_002:0686b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知我聞聖師子深淨微妙音稱南無諸佛。",
        "translation": "\"Śāriputra, you should know that I've heard the holy lion's profound, pure, and subtle voice calling the buddhas of the southern region.",
        "source": "X30n0605_002:0686b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二行明釋迦酬順既聞諸佛歎勸對曰南無南無此云敬從由隨順諸佛隱實用權。",
        "translation": "These two lines show that the Śākyamuni rewarded compliance after hearing the Buddhas praise and advise him, saying, \"Namo! Namo! This is called respectful following because of the right to follow the Buddhas' hidden reality.",
        "source": "X30n0605_002:0686c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二念順物機。",
        "translation": "△Two kinds of mindfulness conform to the capacity of things.",
        "source": "X30n0605_002:0686c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作如是念我出濁惡世如諸佛所說我亦隨順行。",
        "translation": "Again, he had this thought, \"I've emerged from the turbid and evil world just as the buddhas have taught, and I'm also acting in accordance with it.",
        "source": "X30n0605_002:0686c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明施化。",
        "translation": "△Three is to clarify the teaching.",
        "source": "X30n0605_002:0686c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "思惟是事已即趣波羅奈諸法寂滅相不可以言宣以方便力故為五比丘說。",
        "translation": "After thinking this, he then headed for the tranquil aspect of the dharmas at Vārāṇas, which can't be explained in words and was explained to the five monks because of the power of skillful means.",
        "source": "X30n0605_002:0686c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行半正明施化諸法寂滅相不可以言宣下即是前說中道無性佛種之理良由此理非數又不可說今以方便作三乘說又非生非滅而以方便作生滅說又偏真之理亦非可說以方便故作四門說初為五人說無常有門。",
        "translation": "In this first line and a half, he was explaining the principle of the cessation of all things that can't be declared in words, which is to say that the principle of the Middle Way, the naturelessness, and the Buddha-nature is incalculable and inexplicable.",
        "source": "X30n0605_002:0686c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四明受行悟入。",
        "translation": "△4. He explains how to experience, practice, and awaken to [the truth].",
        "source": "X30n0605_002:0686c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是名轉法輪便有涅槃音及以阿羅漢法僧差別名。",
        "translation": "This is called turning the wheel of the Dharma, which then has the distinct names of the sound of nirvāṇa and arhat, Dharma, and saṃgha.",
        "source": "X30n0605_002:0686c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次一行明受行悟入轉佛心中化他之法度入他心名轉法輪唯陳如初得見諦即斷見惑分證滅諦亦是分得有餘涅槃涅槃之音起自於此由此得成無學便有羅漢之名。",
        "translation": "The next line explains how feeling, practice, awakening, and entry turn the teaching in the mind of the Buddha to save others and enter the minds of others, and it's called turning the wheel of the Dharma.",
        "source": "X30n0605_002:0686c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋疑。",
        "translation": "△Two, \"Explaining Doubts.",
        "source": "X30n0605_002:0686c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從久遠劫來讚示涅槃法生死苦永盡我常如是說。",
        "translation": "Since eons long ago, I've praised the teaching of nirvāṇa as the permanent end of the suffering of birth-and-death, and I've always explained it this way.",
        "source": "X30n0605_002:0686c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行是釋疑疑師云佛初未能鑒機尋念諸佛始知根性即釋云非我不知用於方便特欲引同故念諸佛非今始念方知從久遠劫來見其樂小已為讚示令盡眾苦所以聞小即得解脫復疑弟子云何眾生一世暫聞即證羅漢即釋云從久遠劫來為某讚示稱於本習故速得道。",
        "translation": "This line explains the doubtful teacher's claim that the Buddha first failed to discern the capacities of the buddhas and then realized their capacities, which is explained as follows: \"It's not that I don't know and use skillful means to lead others to think of the same buddhas; it's not that I've only begun to think of them now and then realized that I've come from a long time ago to see how little they enjoy and have praised them so that they'll end the suffering of all sentient beings.\" Again, the doubting disciple wonders how sentient beings who hear this for a moment in a single lifetime can realize the arhat, which is explained as follows: \"Since a long time ago, I've praised and shown this person how to praise this person, saying that because of their prior habituation they'll quickly attain the path.",
        "source": "X30n0605_002:0686c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三顯實四初頌人一。",
        "translation": "△Three Expositions of Reality Four First, I'll praise someone.",
        "source": "X30n0605_002:0686c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知我見佛子等志求佛道者無量千萬億咸以恭敬心皆來至佛所曾從諸佛聞方便所說法。",
        "translation": "\"Śāriputra, you should know that I've seen Buddhist disciples and others who aspire to pursue the Buddha's path numberless hundreds of thousands of millions of them all come to the Buddha with respect and dignity, having heard the teaching from the buddhas in a skillful way.",
        "source": "X30n0605_002:0687a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此六行頌上顯實文具四一初我見佛子下二行頌人一三乘行人皆是佛子上文兼有其意次從我即作是念下一行頌理一為說佛慧即是上一切種智佛知見也三從舍利弗當知下二行頌教一但說無上道即教一也四從菩薩聞是法下一行頌行一既云悉亦當作佛是行一更就此文為四意初二行明大乘機發亦云索果次兩行一句明佛歡喜眾生得大乘益故次三句正明顯實次一行明受行悟入也明由機發故得索果索果由於機發所以云耳此應有四句作分別自有障除機未發如諸羅漢在三藏時以樂小故濁障雖除大根鈍故妙機未發自有大機發障未除者如今經中諸凡夫人等雖未斷結以大根利故機發也自有障即除機即發如說無量義時證二乘果即於此座大機即發自有障未除大機未發即五千等退者是也志求佛道者即是索大非求小果然索有三意一大機有感果之義機中論索二情中密求為得為不得即此意也三發言口索即是殷勤三請然昔教之中已有二求但未發言至於今日具此三索問昔出宅索三是機情索者文云如先所許此乃求三何關求一答出外不見必有異途將昔許三以求異意亦得是索一也咸以恭敬心皆來至佛所者一云恥小慕大大機感佛故云至佛所今明非但機至佛所亦乃身到如無量義中四眾圍繞合掌以敬心欲聞具足道也曾從諸佛聞方便所說法者此中初味調伏受行三藏六度通別等三教方便由此調熟故使障除機發而求大也。",
        "translation": "The first two lines of this six-line verse reveal the real stationery. First, I see the sons of the Buddha, and the next two lines praise people. First, the three vehicle practitioners are all sons of the Buddha, and the above has both meanings. Second, the next line of verse from I am thus mindful praises principle 1, which explains that Buddha's wisdom is the Buddha's knowledge and vision of the higher all-inclusive wisdom. Third, the next two lines from Śāriputra should know praises teaching 1, which only explains that the unsurpassed way is teaching 1. Fourth, the next line of verse from Bodhisattva Hears This Dharma praises practice 1, which says that all are also deemed to be buddhas, and practice 1. The first two lines explain that the great vehicle's capacity to arise is also called the fruit of seeking.",
        "source": "X30n0605_002:0687a04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△二頌理一。",
        "translation": "△Two Verses: Principle 1.",
        "source": "X30n0605_002:0687b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我即作是念如來所以出為說佛慧故今正是其時。",
        "translation": "'I just had this thought, 'This is the right time for the Tathāgata to come forth and explain the Buddha's wisdom.'",
        "source": "X30n0605_002:0687b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從我即作是念下有二行一句明障除佛喜佛為佛慧故出興于世昔障重無機不得即說佛慧中間雖障除又未得說今機既發正是說時又昔眾生根鈍智小恐其謗法墮惡故未是說時今根利智大聞必信解故佛歡喜言無畏者不畏執小謗大起罪墮惡故言無畏。",
        "translation": "From this, I will give rise to two lines of thought, one explaining that the Buddha's happiness is due to the removal of the hindrances and the other explaining the Buddha's wisdom. In the past, although the hindrances were removed, there was no opportunity to explain them.",
        "source": "X30n0605_002:0687b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌教一。",
        "translation": "△Three verses teach one.",
        "source": "X30n0605_002:0687b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知鈍根小智人著相憍慢者不能信是法今我喜無畏於諸菩薩中正直捨方便但說無上道。",
        "translation": "\"Śāriputra, you should know that people of dull faculties and little wisdom who are attached to appearances and arrogant can't believe this teaching. Now, I rejoice and have no fear. Among the bodhisattvas, I correctly and directly abandon the method and explain the unsurpassed way.",
        "source": "X30n0605_002:0687b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從於諸菩薩中下三句正顯實也當知五乘是曲非直通別偏傍非正今皆捨彼偏曲但說正直一道。",
        "translation": "The next three phrases from among the bodhisattvas correctly reveal the truth. You should know that the five vehicles are twisted, not straightforward, specific, partial, and not right.",
        "source": "X30n0605_002:0687b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌行一。",
        "translation": "△Four Verses on Practice 1.",
        "source": "X30n0605_002:0687b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩聞是法疑網皆已除千二百羅漢悉亦當作佛。",
        "translation": "After hearing this teaching, the bodhisattvas' web of doubt is removed, and 1,200 arhats all become buddhas.",
        "source": "X30n0605_002:0687b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從菩薩聞是法去一行明受行悟入當知六度通二菩薩初聞略說動舊執致新疑今悉已除非獨菩薩二乘亦爾而云聲聞皆當作佛者昔教不說二乘作佛今行與授記授記豈獨二乘除疑豈獨菩薩葢互存則兩備問菩薩何疑答三藏中說三僧祇未斷結一斷即入真通教說菩薩斷正使留習習盡即成佛來至今經初聞略說悉云方便昔真昔成竟知安在又三乘同學一道何意有別今聞法華掃蕩諸疑無復遺芥。",
        "translation": "From the time the bodhisattvas heard this teaching, one practice explained that they had received, practiced, and awakened to the knowledge that the six perfections were shared by both bodhisattvas and practitioners, and that the first time they heard it, the brief explanation moved old attachments and caused new doubts.",
        "source": "X30n0605_002:0687b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四歎法希有二初頌如是妙法。",
        "translation": "△Four praises the rarity of the Dharma, and two first verse such a wonderful Dharma.",
        "source": "X30n0605_002:0687c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如三世諸佛說法之儀式我今亦如是說無分別法。",
        "translation": "Just as the buddhas of the three times have taught the Dharma in ceremony, so now I'm teaching the Dharma without distinctions.",
        "source": "X30n0605_002:0687c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此一行頌上如是妙法妙法者權實也如三世者引同諸佛用權權是引物之儀式說無分別法引同諸佛顯實實則言語道斷豈存儀式又權實本無分別為鈍根小智分別權實今還悟入一三不二即知佛說三一無分別也諸佛皆爾何獨我耶。",
        "translation": "This line of verse praises the above as the wonderful Dharma. The wonderful Dharma is expedient and real, and like the three worlds, it refers to the same buddhas who use expedient methods. Explicitly, these are the same buddhas who use expedient methods to explain the nondiscriminated Dharma.",
        "source": "X30n0605_002:0687c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌時乃說之五初舉人難。",
        "translation": "△Two verses are explained at the beginning of the sentence, and five are raised as a human objection.",
        "source": "X30n0605_002:0687c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛興出世懸遠值遇難。",
        "translation": "The buddhas arise and appear in the world, and it's a long way from meeting a difficulty.",
        "source": "X30n0605_002:0687c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此四行半頌上時乃說之說上亦舉曇華今頌中還又說之諸佛興出世兩句久久懸遠時有佛出此舉人難。",
        "translation": "These four and a half lines of the verse were spoken when the verse was first delivered, saying that the above verse also cites the Tanhua and the present verse also cites the two phrases, \"When buddhas arise and appear in the world, long ago and far away, there are buddhas who appear.",
        "source": "X30n0605_002:0687c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二舉法難。",
        "translation": "△Two, it's difficult to cite the teaching.",
        "source": "X30n0605_002:0687c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使出于世說是法復難。",
        "translation": "It's no longer difficult to say this is the Dharma that's correctly caused to emerge from the world.",
        "source": "X30n0605_002:0687c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正使出於世兩句此舉法難如今佛出世四十餘年始顯真實。",
        "translation": "It's difficult to praise the truth of the teaching now that the Buddha has been out of this world for more than 40 years.",
        "source": "X30n0605_002:0687c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三舉聞法難。",
        "translation": "△Three, it's difficult to hear the Dharma.",
        "source": "X30n0605_002:0687c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無數劫聞是法亦難。",
        "translation": "It's also difficult to hear this teaching for measureless, incalculable eons.",
        "source": "X30n0605_002:0687c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量無數劫兩句此舉聞法難如五千之流梵音盈耳起席而去聞法豈不難乎。",
        "translation": "These two phrases cite the difficulty of hearing the teaching like the 5,000 streams of Brahmā's voice filling your ears, and then rising from your seat to hear the teaching, isn't that difficult?",
        "source": "X30n0605_002:0687c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四舉信受難。",
        "translation": "△4. He cites the difficulty of believing and accepting it.",
        "source": "X30n0605_002:0687c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽是法者斯人亦復難。",
        "translation": "It's also difficult for someone who listens to this teaching.",
        "source": "X30n0605_002:0687c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能聽是法者兩句此舉信受者難於是上周普眾之中唯身子前達中下雖聽猶未能了。",
        "translation": "These two phrases cite the difficulty of those who believe and accept this teaching.",
        "source": "X30n0605_002:0688a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五頌譬四難。",
        "translation": "△5 Verses metaphorically speaking, there are four difficulties.",
        "source": "X30n0605_002:0688a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如優曇華一切皆愛樂天人所希有時時乃一出聞法歡喜讚乃至發一言則為已供養一切三世佛是人甚希有過於優曇華。",
        "translation": "It's like the udumbara flower that's loved by all and treasured by gods and humans when one hears the teaching, rejoices, and praises it, even speaking one word, then he's made offerings to all three buddhas.",
        "source": "X30n0605_002:0688a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舉曇華譬上四難今但合聞者難餘例可解。",
        "translation": "Holding up the udumbara flower as an example of the four difficulties above, he now only combines the difficulties of those who hear it with the others, which are understandable.",
        "source": "X30n0605_002:0688a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五頌不虗二初頌勿於可信人生疑。",
        "translation": "△Five Verses on the Non-Bullshit Two The first verse is, \"Don't have doubts about trustworthy people.",
        "source": "X30n0605_002:0688a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等勿有疑我為諸法王普告諸大眾但以一乘道教化諸菩薩無聲聞弟子。",
        "translation": "'Don't have doubts, for I am the king of all dharmas and I universally tell the masses to teach bodhisattvas and non-disciples the way of the One Vehicle.'",
        "source": "X30n0605_002:0688a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此二行半頌上不虗又二初一行半勿於可信人生疑我為諸法王者夫為人王言則無二佛為法王豈容虗說。",
        "translation": "The first line of this two-and-a-half-line verse is not false. The first line is not to give rise to doubt about me as the king of the Dharma among credible people.",
        "source": "X30n0605_002:0688a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌勿於可信法生疑。",
        "translation": "△Two verses say, \"Don't give rise to doubt about credible things.",
        "source": "X30n0605_002:0688a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等舍利弗聲聞及菩薩當知是妙法諸佛之祕要。",
        "translation": "You Śāriputra, śrāvakas and bodhisattvas should know that these are the secrets of the wonderful Dharma and the secrets of the buddhas.",
        "source": "X30n0605_002:0688a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "方便可是權假真實寧容是妄聞法王說法勿生疑也。",
        "translation": "Skillful means are provisional, provisional, real, and true, but don't give rise to doubt when you hear the Dharma King preach falsely.",
        "source": "X30n0605_002:0688a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六頌揀眾敦信二初頌揀眾三初頌揀非佛弟子。",
        "translation": "△Six verses on selecting the multitude and sticking to faith, two verses on selecting the multitude, and three verses on selecting those who aren't disciples of the Buddha.",
        "source": "X30n0605_002:0688a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以五濁惡世但樂著諸欲如是等眾生終不求佛道。",
        "translation": "Because of the five turbid bad states, they only enjoy attaching to desires, and such sentient beings never pursue the Buddha Way.",
        "source": "X30n0605_002:0688a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行頌揀眾五濁者一行頌上揀非佛弟子何者若樂著諸欲是行魔業故須揀之上文著涅槃尚非佛弟子此文著生死那是佛弟子此互揀其非終不求佛道者頌上揀增上慢未得上法謂得上法是故其人不求佛道也。",
        "translation": "The first verse of these three verses singles out the many and the five turbidities, and the first verse singles out those who aren't disciples of the Buddha. Why is it that if delighting in desires is practicing demonic behavior, then they must be singled out? The above verse singles out those who are attached to nirvāṇa but aren't yet disciples of the Buddha, and this verse singles out those who aren't and never seek the Buddha's path.",
        "source": "X30n0605_002:0688a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌解義人難得。",
        "translation": "△Two verses say that it's difficult for a person to understand the meaning.",
        "source": "X30n0605_002:0688a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當來世惡人聞佛說一乘迷惑不信受破法墮惡道。",
        "translation": "In a future life, bad people who hear the Buddha teach the One Vehicle are deluded, don't believe it, accept it, and break the Dharma fall into a bad path.",
        "source": "X30n0605_002:0688a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當來世惡人一行頌上如來滅後解義者是人難得也。",
        "translation": "A bad person in a future life who understands the meaning of the verse and line of the Tathāgata after he ceases is a person who's difficult to attain.",
        "source": "X30n0605_002:0688b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌遇餘佛。",
        "translation": "△Three verses encounter other buddhas.",
        "source": "X30n0605_002:0688b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有慚愧清淨志求佛道者當為如是等廣讚一乘道。",
        "translation": "Those with a conscience and a pure intention to pursue the Buddha Way should praise the One Vehicle path in detail for such people.",
        "source": "X30n0605_002:0688b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有慚愧清淨一行頌上若遇餘佛便得決了。",
        "translation": "If he meets another Buddha, then he'll be able to make up his mind.",
        "source": "X30n0605_002:0688b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌敦信二初頌敦信於權。",
        "translation": "△Two Verses on Upholding FaithTwo Verses on Upholding Faith in Authority.",
        "source": "X30n0605_002:0688b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舍利弗當知諸佛法如是以萬億方便隨宜而說法其不習學者不能曉了此。",
        "translation": "\"Śāriputra, you should know that the Buddha's teaching thus uses a trillion methods to teach as appropriate, and those who haven't practiced it can't understand it.",
        "source": "X30n0605_002:0688b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此三行頌上敦信若不信此法無有是處初一行半敦信於權。",
        "translation": "The first line of these three verses urges faith, saying, \"If you don't believe this teaching, there's no place for it.\" The first line urges faith in expediency.",
        "source": "X30n0605_002:0688b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌敦信於實。",
        "translation": "The second line of the verse urges faith in the truth.",
        "source": "X30n0605_002:0688b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等既已知諸佛世之師隨宜方便事無復諸疑惑心生大歡喜自知當作佛。",
        "translation": "'Now that you've known the buddhas as worldly teachers who perform appropriate works with skillful means and have no more doubts, your minds are overjoyed, knowing that you've become buddhas.'",
        "source": "X30n0605_002:0688b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次一行半敦信於實權實無疑自知作佛總上第一卷文畢。",
        "translation": "The next line and a half gives rise to profound faith in the truth, expediency, and the absence of doubt, knowing on your own that you'll become buddhas.",
        "source": "X30n0605_002:0688b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "科註妙法蓮華經卷第二",
        "translation": "Section Notes on the Sutra of the Lotus of the Wonderful Dharma, Volume 2",
        "source": "X30n0605_002:0688b15_0",
        "is_bad_quality": false
    }
]