[
    {
        "source_sentence": "妙法蓮華經科註卷第四",
        "translation": "Miaofa lianhua jing ke jue, vol. 4",
        "source": "X31n0607_004:0258b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "姚秦三藏法師　鳩摩羅什奉　詔譯",
        "translation": "Translated by imperial order from the Yao-Qin Tripiṭaka Master Kumārajīva",
        "source": "X31n0607_004:0258b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上天竺講寺住山比丘　一如　集註",
        "translation": "Bhikṣu Iru, resident monk of Jeta Temple, Jeta Prefecture, India",
        "source": "X31n0607_004:0258b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經五百弟子受記品第八",
        "translation": "Miaofa lianhua jing wuqiezi shouji pin eighth",
        "source": "X31n0607_004:0258b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此品具記千二百聲聞而品題但標五百者葢五百得記名同五百口陳領解故以標品耳妙樂云先標五百故須作受字謂受如來之記也。",
        "translation": "\"This chapter contains a record of twelve hundred śrāvakas, but the title of the chapter only labels it as five hundred because the names of the five hundred who received the record are the same as the five hundred who orally expressed their understanding.",
        "source": "X31n0607_004:0258b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二後兩品授記二初五百弟子受記品授千二百記二初授滿願記二初敘默領解二初敘得解歡喜二初敘得解之由四初聞法譬開三顯一。",
        "translation": "△Two later chapters conferred assurance of assurance that the first five hundred disciples would receive assurance of assurance that the second two chapters would confer assurance of the fulfillment of the vow that the first two chapters would describe the joy and happiness of gaining assurance that the first two chapters would describe the reason for gaining assurance that the first four chapters would hear the teaching and the metaphors that would open three and reveal one.",
        "source": "X31n0607_004:0258b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時富樓那彌多羅尼子(至)隨宜說法。",
        "translation": "It was then that Pūrṇa Maitrāyaniputra (to) explained the Dharma as appropriate.",
        "source": "X31n0607_004:0258c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞是智慧即領方便火宅中兩處顯實方便隨宜說法即領兩處開權也。",
        "translation": "Hearing this wisdom was to receive the skillful means of revealing the reality of the two places in the burning house, and following the appropriate teaching was to receive the expedient means of opening up the two places.",
        "source": "X31n0607_004:0258c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二聞授五大弟子記。",
        "translation": "△Two hears the account of the five major disciples.",
        "source": "X31n0607_004:0258c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又聞授諸大弟子阿耨多羅三藐三菩提記。",
        "translation": "He also heard the prediction that the five great disciples would receive the unsurpassed, correct, and complete enlightenment.",
        "source": "X31n0607_004:0258c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸大弟子指身子及四大弟子領開權授菩提記即領顯實也。",
        "translation": "Those great disciples are the body-son and the four great disciples who receive the record of the opening right to confer bodhi, which is to receive the record of revealing the truth.",
        "source": "X31n0607_004:0258c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三聞宿世因緣之事。",
        "translation": "△Three hear about the causes and conditions of past lives.",
        "source": "X31n0607_004:0258c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復聞宿世因緣之事。",
        "translation": "\"Again, they hear about the causes and conditions of past lives.",
        "source": "X31n0607_004:0258c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞化城品宿世因緣即領顯實也。",
        "translation": "Hearing about the chapter on the transformation city's causes and conditions from previous lives is to apprehend the manifestation of the truth.",
        "source": "X31n0607_004:0258c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四聞佛力觀久若今。",
        "translation": "△Four hears about the power of the buddhas and contemplates long before and now.",
        "source": "X31n0607_004:0258c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復聞諸佛有大自在神通之力。",
        "translation": "They've also heard that the buddhas have great sovereign supernormal powers.",
        "source": "X31n0607_004:0258c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來三達無礙觀彼久遠猶若今日即是大自在神通之力斥異二乘止齊八萬即領開權也。",
        "translation": "The Tathāgata's three attainments are unimpeded in observing that they've been around as long as today, which is to say that the power of great sovereign supernormal abilities repels the two vehicles and brings together the 80,000, which is to say that it's an opening right.",
        "source": "X31n0607_004:0258c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二敘得解歡喜二初明內解歡喜。",
        "translation": "△Two descriptions of the joy of attaining understanding and two explanations of the joy of internal understanding.",
        "source": "X31n0607_004:0258c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得未曾有心淨踊躍。",
        "translation": "He attains a mental purity that's unprecedented and rouses him.",
        "source": "X31n0607_004:0258c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由昔未聞開權顯實而今得聞故言得未曾有除保證涅槃之愛斷破塵沙無明別惑故言心淨開佛知見是故踊躍。",
        "translation": "Because he hadn't heard it in the past, opening up the provisional and revealing the real, but now he's able to hear it, he's said to have attained something unprecedented, removed the love of assurance of nirvāṇa, cut through the dust and uncertainty of specific mental disturbances, and therefore is said to have purified his mind and opened up the Buddha's vision.",
        "source": "X31n0607_004:0258c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明外形恭敬。",
        "translation": "△Two, he shows respect for his appearance.",
        "source": "X31n0607_004:0258c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從座起到於佛前(至)瞻仰尊顏目不暫捨。",
        "translation": "That's when he rises from his seat and goes up to the Buddha (to) look up to the venerable face and doesn't let go of his eyes for a moment.",
        "source": "X31n0607_004:0258c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得解由佛故起恭敬也。",
        "translation": "Attaining understanding, it's because of the Buddha that he arouses respect.",
        "source": "X31n0607_004:0258c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二敘默念領解二初正明默念領解。",
        "translation": "△Two ways of recollecting and understanding the Buddha: First, he correctly explains that he's recollecting and understanding the Buddha in silence.",
        "source": "X31n0607_004:0258c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而作是念世尊甚奇特(至)於佛功德言不能宣。",
        "translation": "He thinks, \"The Bhagavān is extraordinary!\" (Up to) He can't declare the Buddha's merits in words.",
        "source": "X31n0607_004:0258c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上二周身子等得悟皆發言領解此何默念葢身子等為下根未悟事須彰言勸動今下根已悟無所勸動故默念不言世尊甚奇特所為希有者即是領實智隨順七種方便根性而為說法即是領權智乃領方便品中開權顯實也拔出眾生處處貪著乃領火宅中開權顯實也我等於佛功德言不能宣乃領藥草喻中如來有無量功德迦葉等四大弟子說不能盡即是領所不及今富樓那意謂四大弟子聞火宅譬具領如來五時施化及法身地鑑機等事如來猶斥其領所不及我今聞此雖欲領會豈能逾於四大弟子當知所領之外不及處多是故亦云言不能宣既云言不能宣亦是念所不及也。",
        "translation": "In the previous two weeks, the bodhisattvas and others who had attained enlightenment spoke and comprehended what this silent mindfulness was about, since the bodhisattvas and others had to be encouraged by explicit speech in order to attain enlightenment for things the lower faculties hadn't yet attained, but now that the lower faculties have attained enlightenment there's nothing to encourage, so silent mindfulness doesn't say the Bhagavān is very peculiar.",
        "source": "X31n0607_004:0258c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二默求發迹請記。",
        "translation": "△Two, \"Silently seek to initiate the traces and ask for assurance.",
        "source": "X31n0607_004:0259a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛世尊能知我等深心本願。",
        "translation": "\"Only the Bhagavān can know our deep hearts' original vows.",
        "source": "X31n0607_004:0259a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等者通念請發諸人迹也深心是本今現作是迹本願者大慈誓願也大慈下化故我為誓下求作佛故我有願請上求即是求記請說下化即求發迹又從深心故明其三世助佛宣化從本願故即與授記。",
        "translation": "We are people who are generally mindful of the request to initiate the manifestation of people, and the profound mind is the origin.",
        "source": "X31n0607_004:0259a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二如來述記二初長行二初述本迹三初就釋迦世行因發迹三初舉示其人。",
        "translation": "△Two Tathāgatas described the record, first as a long practice, second as a record of the past, third as a cause for the Śākyas to practice and give rise to the record, and third as a description of the person.",
        "source": "X31n0607_004:0259a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸比丘汝等見是富樓那彌多羅尼子不。",
        "translation": "It was then that the Buddha addressed the monks, \"Do you see this as Pūrṇa Maitrāyaniputra?",
        "source": "X31n0607_004:0259a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等見否有二意一見其迹為小否二見其本功德否眾人但見迹為聲聞而不能知本是菩薩故云見否。",
        "translation": "Do you see it or not? There are two things: first, do you see his traces as minor; second, do you see his original merit? Many people only see the traces as śrāvakas but don't know that the original is a bodhisattva; therefore, they say they see it or not.",
        "source": "X31n0607_004:0259a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二總標本迹二初標其迹。",
        "translation": "△Two general indications of the original and derivative, and two initial indications of the derivative.",
        "source": "X31n0607_004:0259a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我常稱其於說法人中最為第一。",
        "translation": "\"I've always called him the best among people who preach.",
        "source": "X31n0607_004:0259a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "標其迹為說法人中最為第一若非法身妙本無以垂於第一勝迹昔來但言於迹中說法第一今則不爾於無上法久得第一此舉迹以顯本也。",
        "translation": "Marking his traces as the best among people who preach, it wouldn't be possible for him to claim to be the best without the marvelous source of the Dharma body. In the past, he only said he was the best at preaching among the traces, but now he's not so.",
        "source": "X31n0607_004:0259b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二標其本。",
        "translation": "△Two labels are given to show the origin.",
        "source": "X31n0607_004:0259b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦常歎其種種功德。",
        "translation": "He also always praises his various merits.",
        "source": "X31n0607_004:0259b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "標其本地福慧萬行法門故云種種本地既有種種法門迹中何但為二乘耶此舉本以明迹也。",
        "translation": "He labels his original merit and wisdom as myriad practices, so he says, \"Why are these various local teachings only two vehicles in the traces?\" This is citing the original to show the traces.",
        "source": "X31n0607_004:0259b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三別釋本迹二初迹中助宣半滿之法。",
        "translation": "△Three separate explanations of the origin and the traces are two. First, he helps proclaim the half-complete teaching in the traces.",
        "source": "X31n0607_004:0259b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "精勤護持助宣我法(至)而大饒益同梵行者。",
        "translation": "He diligently guards and assists in proclaiming my teaching (up to) and greatly benefits those in the same religious practice.",
        "source": "X31n0607_004:0259b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "助宣我法者即是迹中助宣半滿之法也在鹿苑迹為下根聲聞即是護持助宣三藏半滿之法迹在方等示受彈呵即是護持助宣對半明滿之法迹在般若即是護持助宣帶半明滿之法迹在法華得悟即是護持助宣廢半明滿之法上文云我常稱歎種種功德者即此意也本具權實功德而迹於五味助佛調熟實行眾生豈非精勤助宣之意也能於四眾示教利喜者分別半字教也具足解釋者助宣滿字教也而大饒益者助佛饒益半滿之眾生也同梵行者是迹中所化半滿之弟子也。",
        "translation": "Assisting in proclaiming my teaching is assisting in proclaiming the half-complete teaching in the sūtra. Being in Deer Park and in the sūtra for the lower-rooted śrāvakas is to guard and assist in proclaiming the half-complete teaching of the Tripiṭaka. Being in Fangdaeng, showing and accepting Danhao is to guard and assist in proclaiming the half-complete teaching of contrastive insight.",
        "source": "X31n0607_004:0259b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二別述本地功德莫測。",
        "translation": "△Two separate accounts of local merit are unfathomable.",
        "source": "X31n0607_004:0259b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自捨如來無能盡其言論之辯。",
        "translation": "The Tathāgata himself is incapable of explaining the full extent of his discourse.",
        "source": "X31n0607_004:0259b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "降佛已還七方便人不能知其本地之辯。",
        "translation": "After subduing the Buddha and returning to the seven skillful means, people aren't able to know his local discernment.",
        "source": "X31n0607_004:0259b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二約過去世顯其本行。",
        "translation": "△Two, it shows his past activities in terms of past lives.",
        "source": "X31n0607_004:0259b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝等勿謂富樓那(至)常作佛事教化眾生。",
        "translation": "Don't say, 'Pūrṇa (to) always does Buddha-works to teach sentient beings.'",
        "source": "X31n0607_004:0259b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言富樓那非直止於我所助宣半滿之法而於久遠佛所亦復助宣半滿之法取今日助宣為發迹取過去助宣為顯本顯本有二一遠本二近本遠本冥邈為信良難故今但舉九十億近本言之有宿命智能知近本故舉近以證遠令其生信護持助宣即擬助宣半字之法佛之正法即擬助宣對半明滿之法又於空法明了通達即擬助宣滯半明滿之法四無礙智即四無礙辯以智在說故一義無礙智知諸法義了了通達無滯二法無礙智為知一切義故智慧通達諸法名字分別無滯三辭無礙智所謂一切眾生殊方異語若一語二語多語略語廣語女語男語過去未來現在語如是等語言能令各各得解辯說無礙一切聞者悉解其言說四樂說無礙智菩薩於一字中能說一切字一語中能說一切語一法中能說一切法於所說法皆是真實皆隨可度者而有所益所謂十二部經八萬四千法藏隨一切眾生根性所樂聞法而為說之聞者無厭由具神通之力故能隨佛壽命脩清淨行於彼佛世既未發迹人皆謂之實是聲聞不言是大菩薩也化無量眾生令立三菩提者即是助宣廢半明滿之法如是助宣佛法者葢與物結淨土緣耳若不與物結緣則菩薩成佛時土穢無機可化故也。",
        "translation": "He said, \"Pūrṇa doesn't just assist in proclaiming the half-complete teaching in my place; he also assisted in proclaiming the half-complete teaching in a long-ago Buddha's place. Assisting in proclaiming today is initiating the traces and assisting in proclaiming in the past is revealing the origin. There are two origins, one distant and two near origins, and the distant origin is obscure and difficult to believe.",
        "source": "X31n0607_004:0259c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三約三世佛所脩因行。",
        "translation": "△3. It's about the causal practices cultivated by the buddhas of the three times.",
        "source": "X31n0607_004:0259c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘富樓那亦於七佛(至)常勤精進教化眾生。",
        "translation": "The monks Pūrṇa and the seven buddhas (to) always applied themselves to teaching sentient beings.",
        "source": "X31n0607_004:0259c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此亦例前助宣半滿之法利益大小機也七佛者若依諸文所出一毗婆尸佛二尸棄佛三毗舍浮佛四俱留孫佛五拘那含牟尼佛六迦葉佛七釋迦牟尼佛此則以莊嚴劫千佛中後之三佛賢劫千佛中初之四佛為七佛也若據今經釋迦自云今於我所說法人中亦為第一則是以七佛為過去釋迦為現在彌勒等佛為當來應指莊嚴劫中後之四佛賢劫中初之三佛為過去七佛而諸文中或以釋迦共前六佛為過去七佛者意恐劫章經在釋迦滅後結集亦以釋迦為過去佛耳。",
        "translation": "This is also an example of the previous practice of helping to proclaim the half-complete teaching to benefit both large and small sentient beings.",
        "source": "X31n0607_004:0260a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二與授記七初明因圓。",
        "translation": "△Two and the seven predictions for the Buddha's enlightenment are first explained in terms of the completion of causes.",
        "source": "X31n0607_004:0260a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "漸漸具足菩薩之道。",
        "translation": "Gradually, they complete the bodhisattva path.",
        "source": "X31n0607_004:0260a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明果滿。",
        "translation": "Second, he explains the consummation of the result.",
        "source": "X31n0607_004:0260a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "過無量阿僧祇劫當於此土(至)天人師佛世尊。",
        "translation": "After measureless incalculably long eons, he'll be here in this land (to) the gods, humans, teachers, and the World Honored One.",
        "source": "X31n0607_004:0260a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明國淨五初明國大嚴淨。",
        "translation": "△Three states of knowledge are purified, and five first states of knowledge are greatly adorned and purified.",
        "source": "X31n0607_004:0260a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛以恒河沙等(至)人天交接兩得相見。",
        "translation": "Those buddhas meet with each other like the sands of the Ganges (to) humans and gods, and they can see each other.",
        "source": "X31n0607_004:0260a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地平如掌者經直云如掌不言手掌手掌不平則非所引海底有石名掌此石無有一微塵許不平當是類如海掌耳又賢劫經正明如佛手掌非引同人掌也。",
        "translation": "\"When the earth is level like a palm, the sūtras directly say it's like a palm, not a palm. If a palm isn't level, then there's a rock at the bottom of the ocean called a palm, and there's not a speck of dust on this rock that isn't level.",
        "source": "X31n0607_004:0260a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明純是善道。",
        "translation": "△Two things are clear: \"It's purely a good path.",
        "source": "X31n0607_004:0260a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諸惡道亦無女人一切眾生皆以化生無有婬欲。",
        "translation": "There are no evil destinies, and there are no women. All sentient beings are born by transformation, and there's no sexual desire.",
        "source": "X31n0607_004:0260a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無諸惡道者於中亦有差別不同若無女人必無惡道或有女人亦無惡道者如阿閦佛國雖有女人而無女事無量壽佛國二種俱無。",
        "translation": "If there's no woman, there must be no evil destinies, or if there's a woman and no evil destinies, such as in Akṣobhya's land, although there are women, there are no women who do anything.",
        "source": "X31n0607_004:0260a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明福慧具足。",
        "translation": "△Three insights are complete in terms of merit and wisdom.",
        "source": "X31n0607_004:0260a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得大神通身出光明(至)一者法喜食二者禪悅食。",
        "translation": "Attaining great supernormal powers, his body emits radiance (up to) one is a meal of joy in the Dharma and the other is a meal of joy in meditation.",
        "source": "X31n0607_004:0260b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月藏經第九明法食喜食禪食經文總言法喜禪悅別分應有三種差別妙樂云法食聞法也如安養界下品生人在蓮華中常聞彌陀觀音說法喜食者聞法歡喜正聞屬法食聞已為喜食禪食者謂以禪法自資不須段食或可法即是喜。",
        "translation": "The ninth section of the Yuezang jing explains that Dharma food, joy food, and meditation food. The sūtras speak generally of Dharma joy and meditation pleasure, and there are three kinds of distinctions.",
        "source": "X31n0607_004:0260b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四明弟子眾多。",
        "translation": "△Four clear examples of the many disciples.",
        "source": "X31n0607_004:0260b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有無量阿僧祇千萬億(至)六通三明及八解脫。",
        "translation": "There are measureless incalculable hundreds of millions (to) six supernormal powers, three sciences, and eight liberations.",
        "source": "X31n0607_004:0260b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五結功德成就。",
        "translation": "△5. He accomplishes the virtues of bondage.",
        "source": "X31n0607_004:0260b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛國土有如是等無量功德莊嚴成就。",
        "translation": "Their buddha land has such an immeasurable amount of merit and adornment accomplished.'",
        "source": "X31n0607_004:0260b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "月藏經第五明十善各十功德一不殺得十功德者一於一切眾生得無所畏二於眾生得大慈心三斷惡習業四少病五長命六非人所護七無惡夢八無怨九不畏惡道十命終生善道後作佛時國無害仗之具國人長壽乃至第十不邪見得十功德一心性柔善乃至第十死生善道作佛時國人正信是為無量功德莊嚴也。",
        "translation": "The fifth section of the Yuezang jing clarifies the ten virtues of each of the ten good qualities. 1. those who attain the ten virtues of not killing 1. become fearless of all sentient beings 2. attain great kindness toward sentient beings 3. cut off bad habituated karma 4. few illnesses 5. long life 6. not protected by humans 7. no bad dreams 8. no enmity 9. no fear of the evil path 10. when the country becomes a buddha after his life ends and he's born on the good path, the country's people have no harmful battles.",
        "source": "X31n0607_004:0260b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四國劫名。",
        "translation": "△The names of the four countries are eons.",
        "source": "X31n0607_004:0260b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "劫名寶明國名善淨。",
        "translation": "An eon is called a precious luminosity, and a country is called a good and pure one.",
        "source": "X31n0607_004:0260b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五佛壽量。",
        "translation": "△Five buddhas have a lifespan of measure.",
        "source": "X31n0607_004:0260b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛壽命無量阿僧祇劫。",
        "translation": "Their buddha's life span is measureless and incalculably long.",
        "source": "X31n0607_004:0260b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六法住久。",
        "translation": "△Sixth, \"The Dharma lasts a long time.",
        "source": "X31n0607_004:0260b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法住甚久。",
        "translation": "The Dharma abides for a very long time.",
        "source": "X31n0607_004:0260b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△七供舍利。",
        "translation": "△7. Venerating relics.",
        "source": "X31n0607_004:0260b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛滅度後起七寶塔徧滿其國。",
        "translation": "After the Buddha's death, he erected seven jeweled stūpas that filled his kingdom.",
        "source": "X31n0607_004:0260c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌二初頌發迹二初總發諸聲聞迹五初標難思之法。",
        "translation": "△Two verse verses, two verse verses, two verse verses, and two general verses that describe the traces of the śrāvakas.",
        "source": "X31n0607_004:0260c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to recapitulate this meaning and spoke the verse, saying.",
        "source": "X31n0607_004:0260c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘諦聽佛子所行道善學方便故不可得思議。",
        "translation": "\"Monks, listen closely to the way the Buddha's son conducts himself, for it's inconceivable that he trains well and makes effort.",
        "source": "X31n0607_004:0260c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此標弟子為行難思已得垂迹之法。",
        "translation": "This is an indication that the disciple's practice is inconceivable and has led to the traces of the teaching.",
        "source": "X31n0607_004:0260c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明垂迹之由。",
        "translation": "△Two, it explains the reason for setting down traces.",
        "source": "X31n0607_004:0260c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "知眾樂小法而畏於大智是故諸菩薩作聲聞緣覺。",
        "translation": "Knowing that multitudes delight in small things but fear great wisdom, bodhisattvas become śrāvakas and pratyekbuddhas.",
        "source": "X31n0607_004:0260c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明垂迹利益。",
        "translation": "△3. He explains the benefits of tracing his steps.",
        "source": "X31n0607_004:0260c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無數方便化諸眾生類(至)漸當令作佛。",
        "translation": "By using countless methods to teach various sentient beings, they'll gradually become buddhas.",
        "source": "X31n0607_004:0260c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小欲者示求小乘也懈怠者示退大乘也以權行引實行化諸眾生漸令作佛也。",
        "translation": "While minor desires indicate seeking the lesser vehicle, laziness indicates retreat from the great vehicle and using expedient actions to lead to real actions, it gradually causes sentient beings to become buddhas.",
        "source": "X31n0607_004:0260c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四明內祕外現。",
        "translation": "△Four explanations of internal secrecy and external manifestation.",
        "source": "X31n0607_004:0260c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內秘菩薩行外現是聲聞(至)方便度眾生。",
        "translation": "The inner secret is that the bodhisattva's practice is manifested externally by śrāvakas (to) skillfully liberating sentient beings.",
        "source": "X31n0607_004:0260c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非但示為聲聞亦示作外道及三毒凡夫如身子示瞋難陀示貪調達示癡皆其類也。",
        "translation": "Not only are they shown to be direct disciples, they're also shown to be non-Buddhists and the three venomous worldlings like the body-son who's shown anger, Nandha who's shown greed, and Tathāgata who's shown delusion are all of these kinds.",
        "source": "X31n0607_004:0260c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五明指略抑廣。",
        "translation": "△5. It refers to the broad and the abbreviated.",
        "source": "X31n0607_004:0260c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我具足說種種現化事眾生聞是者心則懷疑惑。",
        "translation": "\"If I fully explain the various manifestations, then sentient beings who hear this will have doubts and confusions in their minds.",
        "source": "X31n0607_004:0260c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二別發滿願迹本二初頌顯過去本。",
        "translation": "△Two Distinctly Arousing the Vow's Legacy Two Verses First, he reveals the past life of Pūrṇa.",
        "source": "X31n0607_004:0260c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此富樓那於昔千億佛(至)而自淨佛土。",
        "translation": "'Now, this Pūrṇa purified the Buddha-lands himself because of the hundreds of billions of buddhas (to) in the past.'",
        "source": "X31n0607_004:0260c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌三世行因。",
        "translation": "△Two verse titles reveal the causes of the three worldly practices.",
        "source": "X31n0607_004:0260c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未來亦供養無量無數佛(至)成就一切智。",
        "translation": "In the future, he'll also make offerings to measureless and countless buddhas (up to) the accomplishment of omniscience.",
        "source": "X31n0607_004:0260c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌授記四初頌因圓。",
        "translation": "△Two hymns of praise and four assurances of assurance begin with the completion of causes.",
        "source": "X31n0607_004:0260c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "供養諸如來護持法寶藏。",
        "translation": "\"Make offerings to the tathāgatas and safeguard the treasury of Dharma treasures.",
        "source": "X31n0607_004:0260c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌果滿。",
        "translation": "△Two verse phrases praising the consummation of the result.",
        "source": "X31n0607_004:0260c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其後得成佛號名曰法明。",
        "translation": "He then attains the Buddha name, which is Dharma luminosity.",
        "source": "X31n0607_004:0261a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三劫國名。",
        "translation": "△Triple eons: \"The name of the country.",
        "source": "X31n0607_004:0261a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其國名善淨七寶所合成劫名為寶明。",
        "translation": "That country's name is Good and Pure, and the combination of seven treasures in an eon is called Jeweled Luminosity.",
        "source": "X31n0607_004:0261a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌國淨。",
        "translation": "△Four verse on the country's purity.",
        "source": "X31n0607_004:0261a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩眾甚多其數無量億(至)我今但略說。",
        "translation": "The number of bodhisattvas is vast and their number is countless and billions.",
        "source": "X31n0607_004:0261a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二授千二百記三初念請。",
        "translation": "△Two grants twelve hundred assurances and three first invites them to recite.",
        "source": "X31n0607_004:0261a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時千二百阿羅漢(至)如餘大弟子者不亦快乎。",
        "translation": "Wouldn't it be nice if the other great disciples were like the twelve hundred arhats who had then attained the lesser vehicle?",
        "source": "X31n0607_004:0261a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "千二百人皆已得小乘果不為見思所惱故心自在既聞三周說法又見記富樓那是故歡喜念欲請記。",
        "translation": "Those twelve hundred people have all attained the fruit of the lesser vehicle and aren't troubled by views and perceptions; therefore, their minds are at ease.",
        "source": "X31n0607_004:0261a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二與記二初長行三初總記千二百。",
        "translation": "△Two things are recorded, two are given, the first is a long practice, and the third is a general record of the twelve hundred people who have attained the fruit of the lesser vehicle.",
        "source": "X31n0607_004:0261a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛知此等心之所念(至)三藐三菩提記。",
        "translation": "\"The Buddha knows what these minds think (up to) the record of samyak-saṃbodhi.",
        "source": "X31n0607_004:0261a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二別授憍陳如。",
        "translation": "△Two separate assurances were given to Kauṇḍinya.",
        "source": "X31n0607_004:0261a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於此眾中我大弟子(至)天人師佛世尊。",
        "translation": "\"Among these people is my great disciple (to) the Bhagavān, the teacher of gods and humans.",
        "source": "X31n0607_004:0261a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "陳如最初悟道居上座首故別與記妙樂云問若其居首別記何不初周記耶答若約實行大小緣別兩初各異身子最初結大緣故初周先悟陳如先結小緣故初鹿苑先悟若約權行引物希向二意各異垂迹之法不可一準。",
        "translation": "Chen Ru first awakened to the path and took the head seat, so he was given a special prediction. Miaoleun asked, \"If he takes the head seat and gives a special prediction, why doesn't he give a prediction for the first round?\" A. If we look at the practice of differentiating major and minor conditions, the two firsts are different.",
        "source": "X31n0607_004:0261a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三別授五百人。",
        "translation": "△Three separate ordination of five hundred people.",
        "source": "X31n0607_004:0261a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其五百阿羅漢(至)盡同一號名曰普明。",
        "translation": "All 500 of them were given the same name, Pu Ming.",
        "source": "X31n0607_004:0261a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦留陀夷此云黑光亦云麤黑顏色黑而光故周陀或云周利此云大路邊生佛本行經云其母隨夫往他國久而有孕垂產思歸行至中路即誕其子如是二度凡生二子乃以大小別之大即周陀小即莎伽陀亦云槃陀伽亦云槃特此云小路邊生問佛許千二百次第與記今何但記五百不見千二百得記答此五百即千二百數頌中末後迦葉汝已知等一行半總授七百故是千二百也。",
        "translation": "Kālôdayin, which is black and shiny, and Gayin, which is black in color and shiny, is therefore Cūḍa or Cūḍarī, which is born by the side of the road. The Buddha's sūtras on this topic say that a mother who follows her husband to another country for a long time becomes pregnant, gives birth to a son when he wants to return to the middle of the road.",
        "source": "X31n0607_004:0261a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌二初記陳如及與五百。",
        "translation": "△Two verses and two hymns begin with a record of Tantra and the five hundred.",
        "source": "X31n0607_004:0261b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke the verse, saying.",
        "source": "X31n0607_004:0261b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍陳如比丘(至)壽命劫多少皆如上所說。",
        "translation": "\"The monk Kauṇḍinya (to) has a lifespan of an eon or more as explained above.",
        "source": "X31n0607_004:0261b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二總授一切聲聞記。",
        "translation": "△Two, he summarized the predictions of all the śrāvakas.",
        "source": "X31n0607_004:0261b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉汝已知五百自在者(至)汝當為宣說。",
        "translation": "\"Kāśyapa, you have known 500 [eons of] attainment of mastery; you will explain it for them.",
        "source": "X31n0607_004:0261b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上二句結前五百已得記者次二句即頌七百故云餘諸聲聞眾亦當復如是又次二句為不在此會者令迦葉代為宣說故云其不在此會汝當為宣說後持品中云我先總說一切聲聞皆已授記正指今一行半偈非是止授七百聲聞也。",
        "translation": "The first two phrases conclude with the first 500 having been given the task of reporting. The second two phrases are a verse about the 700, so it's said that the rest of the śrāvakas will do the same. The second two phrases are for those who aren't present at this meeting, so Kāśyapa will proclaim it for them, so it's said that you will proclaim it for them when they aren't present at this meeting.",
        "source": "X31n0607_004:0261b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三領解二初長行二初經家敘喜二初慶今得解故歡喜二初明內心慶喜。",
        "translation": "△Three comprehends two first long lines, two first sūtras that describe their joy, and two first sūtras that rejoice because they've now attained understanding.",
        "source": "X31n0607_004:0261b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時五百阿羅漢於佛前得受記已歡喜踊躍。",
        "translation": "At the time, 500 arhats rejoiced and jumped for joy after they had received assurance of Buddhahood.",
        "source": "X31n0607_004:0261b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明外形恭敬。",
        "translation": "△Two, they showed respect in appearance.",
        "source": "X31n0607_004:0261b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從座起到於佛前頭面禮足。",
        "translation": "They then rose from their seats and bowed their heads and feet in front of the Buddha.",
        "source": "X31n0607_004:0261b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二愧昔不解故自責。",
        "translation": "△Two, he regrets that he didn't understand it in the past and therefore rebukes himself.",
        "source": "X31n0607_004:0261b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悔過自責。",
        "translation": "He repents of his faults and takes responsibility for them.",
        "source": "X31n0607_004:0261b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二自陳領解二初法說二初悔得小為足。",
        "translation": "△Two self-representations led to two understandings, the first explaining the Dharma and the second repenting of having attained the stage of the lesser one.",
        "source": "X31n0607_004:0261b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊我等常作是念自謂已得究竟滅度。",
        "translation": "\"Bhagavān, we've always thought this, saying we've attained complete extinction.",
        "source": "X31n0607_004:0261b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是悔責昔迷得小為足不知求大。",
        "translation": "This is repentance for having been mistaken in the past and attained the level of the small that's sufficient without knowing the greatness of what's sought.",
        "source": "X31n0607_004:0261b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二責根鈍難悟。",
        "translation": "Second, it's a rebuke for having dull faculties and difficulty in awakening.",
        "source": "X31n0607_004:0261b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今乃知之。",
        "translation": "Now we know it.",
        "source": "X31n0607_004:0261c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此責根鈍始悟不早知之今知小非究竟大為真實也。",
        "translation": "He blames his dull faculties for first realizing it and not knowing it earlier. Now, he knows that small isn't the ultimate greatness because it's true.",
        "source": "X31n0607_004:0261c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二譬說二初略譬二初略舉譬況。",
        "translation": "△Two metaphors are explained, the first is a brief metaphor, and the second is a brief metaphorical situation.",
        "source": "X31n0607_004:0261c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無智者。",
        "translation": "It's like the person who has no cognition.",
        "source": "X31n0607_004:0261c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋無智意。",
        "translation": "△Two explanations of the meaning of lacking cognition.",
        "source": "X31n0607_004:0261c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何我等應得如來智慧而便自以小智為足。",
        "translation": "\"Why is it that we should attain the Tathāgata's wisdom and then take for ourselves the inadequacy of small wisdom?",
        "source": "X31n0607_004:0261c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正譬二初開譬二初貧人醉酒譬三初親友繫珠譬。",
        "translation": "△Two correct metaphors, two opening metaphors, two first, the poor man's drunkenness metaphor, and three first, the friend-tied-jewel metaphor.",
        "source": "X31n0607_004:0261c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊譬如有人(至)繫其衣裏與之而去。",
        "translation": "Bhagavān, it's like a person who ties them up in their robes and takes them away.",
        "source": "X31n0607_004:0261c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "繫珠譬領上王子結緣也譬如有人者即二乘之機也親友者昔日第十六王子也家即大乘教為家也醉酒而臥者當時大機暫發無明暫伏以得聞經內心微解如至親友家以無明重故還復迷失如醉酒而臥醉有二義一重醉都不覺知二輕醉微覺尋忘亦名不覺雖有二義終成繫珠如毒鼓耳官事當行者明王子餘處機興逗緣往應故云當行弘法化他此非私務故云官事無價寶珠者一乘實相真如智寶也繫其衣裏者慚醜忍辱能遮醜恚及防外惡即是外衣信樂之心內裹善根即是內衣于時聞法微信樂欲即了因智願種子也妙樂云真如智寶者此是約教乃以了因而為繫珠教中詮理故云真如教是智用故云智寶也。",
        "translation": "The pearl-tied metaphor leads to the princely connection above, such as a person who is the opportunity of the two vehicles, a friend who was the sixteenth prince of the past, and whose home was the home of the great vehicle teaching, and who was drunk and lying down when the great opportunity arose temporarily and ignorance temporarily subsided in order to hear the sūtras and attain a subtle understanding of the internal mind.",
        "source": "X31n0607_004:0261c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二醉臥不覺譬。",
        "translation": "△Two metaphors of being drunk and lying down and not realizing it.",
        "source": "X31n0607_004:0261c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其人醉臥都不覺知。",
        "translation": "That person is drunk and lying down and doesn't even realize it.",
        "source": "X31n0607_004:0261c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此領中間懈退不受大法也醉臥不覺知者無明心重尋復不憶也。",
        "translation": "He's in the middle of laziness, doesn't accept the great teaching, and he's drunk and unaware when his ignorant mind is heavy with discursive thought and doesn't recall it.",
        "source": "X31n0607_004:0262a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三起已遊行譬。",
        "translation": "△3. The parable of the person who rises and travels.",
        "source": "X31n0607_004:0262a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起已遊行到於他國(至)若少有所得便以為足。",
        "translation": "\"After rising, he marches to another country (to) consider it enough if he has gained little.",
        "source": "X31n0607_004:0262a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此領上中間接之以小受三乘化也善根欲發厭苦求樂故云起已遊行無明覆解不知向本求大乘衣食故言向他國求於小乘衣食若魔佛相望生死魔界為他國佛法大小皆為本國就大小相望小乘未免生死猶是他國大乘永免生死乃為本國究竟還源也明背大乘國往小乘土不知從珠取給而傭作自資獲一日價得少為足。",
        "translation": "This leads to the middle of the above and brings in the lesser transformation by the three vehicles, which is the desire to arouse good roots, tire of suffering, and seek happiness.",
        "source": "X31n0607_004:0262a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二親友覺悟譬三初呵責。",
        "translation": "△Two friends and relatives awakening metaphors: First, he rebukes them.",
        "source": "X31n0607_004:0262a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於後親友會遇見之(至)何為衣食乃至如是。",
        "translation": "What are the clothing and food and up to this?",
        "source": "X31n0607_004:0262a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此呵責譬上動執生疑也。",
        "translation": "This is the metaphor of rebuking someone who's moved to attachment and given rise to doubt.",
        "source": "X31n0607_004:0262a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二示珠。",
        "translation": "△Two, he shows you the pearl.",
        "source": "X31n0607_004:0262a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我昔欲令汝得安樂(至)以求自活甚為癡也。",
        "translation": "'My intention in the past was to make you comfortable (up to) seeking your own livelihood was quite foolish.'",
        "source": "X31n0607_004:0262a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此示珠譬宿世因緣也某年日月者指大通佛所也。",
        "translation": "This showing of the pearl is a metaphor for the causes and conditions of past lives, and the years, suns, and months refer to the place of the great penetrating Buddha.",
        "source": "X31n0607_004:0262a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三勸貿。",
        "translation": "△Three times he encouraged trade.",
        "source": "X31n0607_004:0262a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝今可以此寶貿易所須常可如意無所乏短。",
        "translation": "Now, you can trade in this treasure for what's needed, always as you wish, and nothing lacking.'",
        "source": "X31n0607_004:0262a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此勸貿譬得記作佛也妙樂云珠雖價直無數必須貿易方有濟用了因內解雖復究竟必以宿種易於現行以昔解一解一切解貿今現行一行一切行珠體不竭貿易無窮故須更聽更修方顯寶之功用如華嚴中得摩尼珠十種瑩治方能雨寶解行相稱方堪佛記從是已後則具有寂滅忍衣首楞嚴食自行化他無量眾寶無功用位彼此不窮。",
        "translation": "This exhortation to trade is a metaphor for attaining recognition as a buddha, too. Although the price of the marvelous music cloud pearl is countless, it must be traded before it can be of help.",
        "source": "X31n0607_004:0262a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二合譬二初合貧人醉酒譬三初合親友繫珠譬。",
        "translation": "△Two combinations of metaphors, the first combining the poor man's drunkenness metaphor, and the third combining the friends and relatives tied to a pearl metaphor.",
        "source": "X31n0607_004:0262b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛亦如是為菩薩時教化我等令發一切智心。",
        "translation": "Thus did the Buddha teach us as bodhisattvas so that we would give rise to the mind of omniscience.",
        "source": "X31n0607_004:0262b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二合醉不覺知譬。",
        "translation": "△Two combinations of the parable of the drunken person who doesn't know is wrong.",
        "source": "X31n0607_004:0262b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而尋廢忘不知不覺。",
        "translation": "He's searching for forgetfulness and doesn't know it.",
        "source": "X31n0607_004:0262b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三合起已遊行譬。",
        "translation": "△Tridharmony: The parable of the person who has arisen and then traveled.",
        "source": "X31n0607_004:0262b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既得阿羅漢道自謂滅度資生艱難得少為足。",
        "translation": "Since attaining the path of the arhat, he claims to have ceased the difficulty of subsistence and attained the fulfillment of few.",
        "source": "X31n0607_004:0262b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二合親友覺悟譬三初合呵責。",
        "translation": "△Two together with the parable of the friend who's awakened, the three together with the first are rebukes.",
        "source": "X31n0607_004:0262b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切智願猶在不失(至)汝等所得非究竟滅。",
        "translation": "\"All wisdom and vows are still present and not lost, and what you've attained isn't ultimately extinguished.",
        "source": "X31n0607_004:0262b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二合示珠。",
        "translation": "△Two together show him the pearl.",
        "source": "X31n0607_004:0262b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我久令汝等種佛善根(至)而汝謂為實得滅度。",
        "translation": "'I've long told you to plant the good roots of the Buddha, but you think you've really attained extinction.'",
        "source": "X31n0607_004:0262b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三合勸貿。",
        "translation": "△Tridharmony exhorts.",
        "source": "X31n0607_004:0262b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊我今乃知實是菩薩(至)甚大歡喜得未曾有。",
        "translation": "\"Bhagavān, now I know that this is really a bodhisattva (to) rejoice greatly and attain something unprecedented.",
        "source": "X31n0607_004:0262b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌二初頌內心得解二初頌慶喜。",
        "translation": "△Two verse verses, two verse verses, the first verse on inner mind, and the second verse on rejoicing.",
        "source": "X31n0607_004:0262b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿若憍陳如等欲重宣此義而說偈言。",
        "translation": "It was then that Ājñāta-kauṇḍinya and the others wanted to reiterate this meaning and spoke the verse, saying.",
        "source": "X31n0607_004:0262b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等聞無上安隱授記聲歡喜未曾有禮無量智佛。",
        "translation": "'We hear the sound of the unsurpassed peaceful assurance of awakening and rejoice, and we have never before paid homage to the Buddha of Immeasurable Knowledge.'",
        "source": "X31n0607_004:0262b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌悔責。",
        "translation": "△Two verses of repentance and blame.",
        "source": "X31n0607_004:0262b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今於世尊前自悔諸過咎。",
        "translation": "'Now, before the Bhagavān, we repent of our faults.'",
        "source": "X31n0607_004:0262b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌自陳領解二初頌法說。",
        "translation": "△Two verses expressing their own understanding and two verses explaining the teaching in the first verse.",
        "source": "X31n0607_004:0262b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於無量佛寶得少涅槃分。",
        "translation": "'Attaining a modicum of nirvāṇa with measureless Buddha treasures.'",
        "source": "X31n0607_004:0262b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頌上得少為足。",
        "translation": "The verse above attains a small amount as its fulfillment.",
        "source": "X31n0607_004:0262b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌譬說二初頌略舉譬二初頌略舉譬況。",
        "translation": "△Two verses on the explanation of the parable and two verses on the brief presentation of the parable, the first verse briefly presents the parable's situation.",
        "source": "X31n0607_004:0262b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無智愚人。",
        "translation": "'He's like a foolish man without wisdom.'",
        "source": "X31n0607_004:0262b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌釋無智意。",
        "translation": "△Two verses explain the meaning of lacking wisdom.",
        "source": "X31n0607_004:0262b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便自以為足。",
        "translation": "He then regards himself as having enough.",
        "source": "X31n0607_004:0262c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌正舉譬二初頌開譬二初頌捨寶不知。",
        "translation": "△Two verses correctly cite the metaphors, two verses opening with the metaphors, and two verses laying aside treasure without knowing it.",
        "source": "X31n0607_004:0262c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如貧窮人往至親友家(至)有無價寶珠。",
        "translation": "It's like a poor person who goes to a friend's house (or home) and finds a priceless jewel.",
        "source": "X31n0607_004:0262c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "[月*肴]膳譬大通佛所先聞方便繫珠譬王子覆講後結大緣妙樂云當知貧人本來先醉加蒙[月*肴]膳受已而臥三教助道猶如[月*肴]膳更以異方便助顯第一義也[月*肴]膳食已便消如方便教非究竟益往在大通佛所未結大緣已前歷諸味中竝聞三教及至王子覆講法華雖聞圓頓但成結緣如繫珠也。",
        "translation": "[The [moon*dish] meal metaphor is that of the Datong Buddha, who first heard the method of binding the pearl metaphor, and the prince repeatedly lectured it and then formed the great condition.",
        "source": "X31n0607_004:0262c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌親友覺悟。",
        "translation": "△Two verses on the awakening of a close friend.",
        "source": "X31n0607_004:0262c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "與珠之親友後見此貧人(至)五欲而自恣。",
        "translation": "He became a friend of the pearl and then saw this poor man (arrive) with the five desires and behave himself.",
        "source": "X31n0607_004:0262c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌合譬。",
        "translation": "△Two verses combine the metaphors.",
        "source": "X31n0607_004:0262c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等亦如是世尊於長夜(至)身心徧歡喜。",
        "translation": "'So did we, the Bhagavān, during the long night (until) we were universally joyous in body and mind.'",
        "source": "X31n0607_004:0262c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初一行頌上合譬中初繫珠譬我等無智下二句頌上合譬中第二醉不覺知得少涅槃下二句頌上合譬中第三起已遊行今佛覺悟下二句頌上合譬中初呵責得佛無上下二句頌上合譬中示珠我今從佛下一行頌上合譬中勸貿得記作佛是故歡喜。",
        "translation": "In the first line of the verse, the verse coincides with the parable in which the first one ties the pearl to the parable of our lack of cognition, and the second one coincides with the parable in which the second one is drunk and doesn't know that we've attained partial nirvāṇa, and the third one coincides with the parable in which the first one rebukes the Buddha for having no peer, and the second one coincides with the parable in which the second one encourages the trade to be remembered as a Buddha and therefore rejoices.",
        "source": "X31n0607_004:0262c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經授學無學人記品第九",
        "translation": "Miaofa lianhua jing jiaoxing wuxue people ji pin 9",
        "source": "X31n0607_004:0262c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "研真斷惑名為學真窮惑盡名無學三果四向研修真理募求勝見故名為學阿羅漢果研理已窮勝見已極無所復學故名無學此二千人或是學人或是無學人同是一流一時受記同一名號故別為一品也。",
        "translation": "Studying the truth and ending mental disturbances is called training, and the exhaustion of mental disturbances is called not studying. The three fruits of the fourfold training are called training because they collect the truth and pursue superior views.",
        "source": "X31n0607_004:0262c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二授學無學人記品授二千人記二初請記二初二人請二初默念得記。",
        "translation": "△Two classes of giving assurance to those who are trainees and those who are not trainees are given two thousand assurances of assurance, the first that they'll receive assurance of assurance, and the second that they'll receive assurance of assurance of silence.",
        "source": "X31n0607_004:0263a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時阿難羅睺羅而作是念(至)設得授記不亦快乎。",
        "translation": "Ānanda Rāhula then had this thought (to himself): Wouldn't it be nice if we could get a prediction?",
        "source": "X31n0607_004:0263a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二發言請記二初引例。",
        "translation": "△Two speakers asked for remembrance, and the first cited an example.",
        "source": "X31n0607_004:0263a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即從座起到於佛前(至)唯有如來我等所歸。",
        "translation": "He immediately rose from his seat and went up to the Buddha (to) There's only the Tathāgata to whom we all belong.",
        "source": "X31n0607_004:0263a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二引望。",
        "translation": "△Two invoke the hope.",
        "source": "X31n0607_004:0263a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又我等為一切世間(至)我願既滿眾望亦足。",
        "translation": "'For us, the world (to) fulfill my vows and the hopes of the people are fulfilled.'",
        "source": "X31n0607_004:0263a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二人於佛最親時眾所望羅雲是佛子俗中親重阿難持佛法藏道中親勝勝重兩人不蒙別記則眾望不足也問若重若勝應同上流又如列眾二人在多知識上數中獲記何意居下答總與千二百記二人已同上流今更索別記耳。",
        "translation": "When these two people were closest to the Buddha, the expectation of the multitude was that Rāhula was a son of the Buddha who was close to and respected by the secular world, and Ananda held the Buddha's dharma store, and was close to and respected by the path.",
        "source": "X31n0607_004:0263a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二二千請。",
        "translation": "△Two thousand two hundred requests.",
        "source": "X31n0607_004:0263a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時學無學聲聞弟子二千人(至)住立一面。",
        "translation": "At the time, 2,000 śrāvaka disciples who were trainees or postlearners (to) stood to one side.",
        "source": "X31n0607_004:0263a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二千請記但有默念引例二意同於二人故言如阿難等願耳不發言請者非如二人親重親勝故也。",
        "translation": "The 2,000 requests were recorded only as silent recitations, citing two examples where the intention was the same as the two, so they said they were like Ānanda and other vows. Those who didn't speak the requests weren't like the two people who were close, important, and superior.",
        "source": "X31n0607_004:0263a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二授記二初記二人二初記阿難五初長行明脩因得果。",
        "translation": "△Two responses were given, two responses were given, and two responses were given to Ānanda.",
        "source": "X31n0607_004:0263a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告阿難汝於來世(至)所共讚歎稱其功德。",
        "translation": "It was then that the Buddha told Ānanda, \"In the future (to) you'll be praised and praised for your merits.",
        "source": "X31n0607_004:0263a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難為今佛侍者護持法藏於六十二億佛所亦護法藏如今不異爾後方得菩提此自行修因得果也教化二十千萬億菩薩等即果後化他令他修因得果也。",
        "translation": "As an attendant of the present Buddha, Ānanda has protected the Dharma treasure and has protected the Dharma treasure in six billion buddha-places. Now, this is no different from the time when he attained enlightenment, which is the result of cultivating causes on his own, teaching and transforming twenty thousand million bodhisattvas and so forth, which is the result of transforming others and causing them to cultivate causes and attain the fruit.",
        "source": "X31n0607_004:0263a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌明修因得果。",
        "translation": "△Two verses explain the cultivation of causes to attain their fruition.",
        "source": "X31n0607_004:0263a23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to reintroduce this meaning and spoke the verse, saying.",
        "source": "X31n0607_004:0263a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今僧中說(至)於此佛法中種佛道因緣。",
        "translation": "'Now, I've explained among the saṃgha (to) planting the causes and conditions of the Buddha's path in this Buddha's teaching.'",
        "source": "X31n0607_004:0263b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三八千菩薩等生疑。",
        "translation": "△Three thousand, eight thousand bodhisattvas and others had doubts.",
        "source": "X31n0607_004:0263b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時會中新發意菩薩(至)而諸聲聞得如是決。",
        "translation": "At that point, the newly awakened bodhisattvas (to) and the śrāvakas attained this kind of resolve.",
        "source": "X31n0607_004:0263b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八千菩薩疑者通疑聲聞今日發心即蒙佛記國淨若此何故昔於方等記諸菩薩無量劫行乃得佛記。",
        "translation": "The 8,000 bodhisattvas who doubted it were śrāvakas who doubted that today's arousal of intention would lead to the Buddha's approval of the country's purity.",
        "source": "X31n0607_004:0263b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四如來為發迹釋疑。",
        "translation": "△The four tathāgatas explained their doubts for those who had arisen the traces.",
        "source": "X31n0607_004:0263b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊知諸菩薩(至)其本願如是故獲斯記。",
        "translation": "The Bhagavān then knew that the bodhisattvas' (up to) original vows were thus fulfilled.",
        "source": "X31n0607_004:0263b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛因眾疑即為發迹釋疑阿難昔日與我同發大心即是同學由我精進前超得佛由彼多聞猶故持經迹為侍者本地如此今授妙記何足可疑。",
        "translation": "Because the Buddha had so many doubts, he then explained the doubts for their traces, saying, \"Ānanda, we had the same great intention as me in the past, so we were fellow students, and because of my effort we surpassed the Buddha, and because he's well-versed, he still holds the sūtras and traces as an attendant.",
        "source": "X31n0607_004:0263b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五明阿難顯本述歎。",
        "translation": "△5. Ānanda revealed the origin and praised it.",
        "source": "X31n0607_004:0263b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難面於佛前自聞授記(至)爾時阿難而說偈言。",
        "translation": "Ānanda personally heard the assurance of assurance before the Buddha (to) At that point, Ānanda spoke in verse, saying.",
        "source": "X31n0607_004:0263b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊甚希有(至)方便為侍者護持諸佛法。",
        "translation": "\"The Bhagavān is most rare!\" △Two kinds of predictions: first, there's the first one.",
        "source": "X31n0607_004:0263b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二記羅雲二初長行。",
        "translation": "△Two kinds of predictions Rāhula made, the first being about longevity.",
        "source": "X31n0607_004:0263b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告羅睺羅(至)當得阿耨多羅三藐三菩提。",
        "translation": "It was then that the Buddha told Rāhula (to) that he would attain unsurpassed, correct enlightenment.",
        "source": "X31n0607_004:0263b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈煩。",
        "translation": "△Two verses were vexed.",
        "source": "X31n0607_004:0263b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to reiterate this meaning and spoke in verse, saying.",
        "source": "X31n0607_004:0263b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為太子時(至)安住於佛法以求無上道。",
        "translation": "\"When I was a prince, I abided in the Buddha's teaching and sought the unsurpassed path.",
        "source": "X31n0607_004:0263b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本是菩薩迹為小乘以迹覆本名為密行。",
        "translation": "Originally, this was a bodhisattva's manifestation of the lesser vehicle's practice of covering the origin with traces, which is called esoteric practice.",
        "source": "X31n0607_004:0263b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二授二千三初長行。",
        "translation": "△Two grants of two thousand three first long practices.",
        "source": "X31n0607_004:0263b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊見學無學二千人(至)正法像法皆悉同等。",
        "translation": "It was then that the Bhagavān saw that the 2,000 people who were students and the 2,000 people who were not students (up to) the true teaching and the imitation teaching were all the same.",
        "source": "X31n0607_004:0263b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌。",
        "translation": "△Two verses.",
        "source": "X31n0607_004:0263b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to reintroduce this meaning and spoke in verse, saying.",
        "source": "X31n0607_004:0263b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是二千聲聞(至)名聞普周徧漸入於涅槃。",
        "translation": "\"These are the 2,000 śrāvakas (to the point where) their reputation is heard universally and they gradually enter nirvāṇa.",
        "source": "X31n0607_004:0263b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三記喜。",
        "translation": "△Three notes of joy.",
        "source": "X31n0607_004:0263c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時學無學二千人聞佛授記歡喜踊躍而說偈言世尊慧燈明我聞授記音心歡喜充滿如甘露見灌。",
        "translation": "It was then that 2,000 trainees and nondisciples who heard the Buddha's instructions rejoiced and roused, saying, \"Bhagavān, the lamp of wisdom illuminates my heart as I rejoice when I hear the instructions, like the irrigation of ambrosia.",
        "source": "X31n0607_004:0263c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "中道種智之慧照徹三諦源底復能破諸眾生煩惱惑暗故云慧燈明也。",
        "translation": "The wisdom of the middle way's seed wisdom illuminates the source and soles of the three truths and also destroys the afflictive and deluded darkness of sentient beings; therefore, it's called the wisdom lamp illuminating.",
        "source": "X31n0607_004:0263c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經法師品第十",
        "translation": "Saddharmapuṇḍarīka-sūtra, Chapter 10 of the Teacher of the Dharma",
        "source": "X31n0607_004:0263c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此品明五種法師一受持二讀三誦四解說五書寫大論明六種法師一信力故受二念力故持三看文為讀四不忘為誦五宣傳為說聖人經書難解須解釋今經合受持為一合解說為一開讀誦為二足書寫為五別論受持書寫是自行解說是化他通論若自軌五法則五種皆自行若教他五法則五種皆化他自軌故通稱弟子化他故通稱法師今從通義故稱法師品法者軌則也師者訓匠也法雖可軌體不自弘通之在人故五種通經皆得稱師舉法成其自行皆以妙法為師師於妙法妙行成就故言法師又五種人能以妙法訓匠於他舉法目師故稱法師凡多種解皆約圓教法門而釋品也。",
        "translation": "This chapter explains the five kinds of Dharma masters: one who receives and maintains the second reading, three who recites, four who interprets, and five who writes. The great treatise explains the six kinds of Dharma masters: one who receives and maintains the second reading, three who recites because of the power of mindfulness, three who reads the text and four who recites because of the power of mindfulness, and five who publicizes and speaks because of the difficulty in understanding the scriptures of the noble ones.",
        "source": "X31n0607_004:0263c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○前三周是迹門正說領解受記竟此下五品是迹門流通非止蔭益當時復欲津洽來世故有五品流通法師寶塔兩品明弘經功深福重流通未聞利益巨大達多一品引往弘經彼我兼益以證功德深重持品八萬大士忍力成者此土弘經新得記者他土弘經安樂行品外凡初心欣斯勝福見聲聞畏憚(經云若聲聞人聞是經驚疑怖畏等)聞菩薩擯辱(持品云濁世惡比丘數數見擯出等)顧己力弱無益自他便生退沒佛為此人說安樂行依之法弘不慮危苦。",
        "translation": "After the first three chapters are devoted to the transmission of the teachings, the next five chapters are devoted to the transmission of the teachings, not only to the benefit of the recipients, but also to the desire to bring the teachings into the future, so there are five chapters of the transmission of the Dharma teacher, two chapters of the jeweled stūpa, which explain the profound merit of the sūtras and the great virtue of the benefits of the unheard ones, and one chapter of the Dharma teacher, which leads to the transmission of the scriptures, and one chapter of the Dharma teacher, which benefits both himself and others to realize the profound merit of the recipients.",
        "source": "X31n0607_004:0263c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三五品迹門流通四初法師寶塔兩品明弘經功深福重流通未聞益大二初法師品二初長行偈頌歎美五種法師能持法人二初稟道弟子門功深福重二初佛世弟子二初揀出其人類。",
        "translation": "First, the two categories of the Dharma teacher's jeweled stūpa explain the profound merit of promoting the sūtras and the great benefit of disseminating them to those who haven't heard of them.",
        "source": "X31n0607_004:0264a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊因藥王菩薩(至)求辟支佛者求佛道者。",
        "translation": "It was then that the Bhagavān asked the Viśeṣa-cinti-buddha for the path of the Buddha because of the Medicine King Bodhisattva (to).",
        "source": "X31n0607_004:0264a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初因藥王告八萬者因者憑寄也欲以妙法憑寄藥王使其領受告語八萬皆流通也汝見是大眾等者的示持經得福之人也妙樂云本託藥王因茲告餘此流通初先告八萬大士者大論云法華是秘密付諸菩薩如下涌出品召於下方尚待本眷屬驗餘人未堪也。",
        "translation": "The first reason the king of medicine told the 80,000 was because he wanted to send the wonderful Dharma to the king of medicine by virtue of his desire to receive it, and he told them that the 80,000 were circulating.",
        "source": "X31n0607_004:0264a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二揀出得記緣。",
        "translation": "△Two selected circumstances for attaining assurance of future attainment.",
        "source": "X31n0607_004:0264a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是等類咸於佛前(至)當得阿耨多羅三藐三菩提。",
        "translation": "Such and such kinds of people will attain unsurpassed, correct, and complete enlightenment in the presence of the Buddha.",
        "source": "X31n0607_004:0264a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於佛前當機妙悟者是多聞深解五百及二千是也此等皆已現前與總別記竟今所揀者乃是八部四眾三乘之類故言如是等類咸於佛前者明其時節值佛在座也一句一偈者聞法極少也乃至一念者時節最促也隨喜者自未有行但隨喜其法及隨喜其人也皆與記當得菩提者明其聞極少時極促隨喜之功遂得佛果何況具足得聞盡形受持五種流通三業供養聞少解淺者尚記況復多深以少況多普廣若此下周既爾中上亦然可以意知不俟更說。",
        "translation": "If someone's opportune and marvelously enlightened before the Buddha is well-versed and deeply understood, then 500 or 2,000 of them are the eight divisions, four communities, and three vehicles that have been selected for this purpose.",
        "source": "X31n0607_004:0264a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二滅後弟子二初出弟子類。",
        "translation": "△Two kinds of disciples after the cessation of suffering: first, those who leave the class of disciples.",
        "source": "X31n0607_004:0264b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告藥王(至)乃至一偈一句一念隨喜者。",
        "translation": "The Buddha told Yakṣa King (to) even a verse and a phrase of mindfulness to follow his lead.",
        "source": "X31n0607_004:0264b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二亦與授記。",
        "translation": "△Two also gave him a prediction.",
        "source": "X31n0607_004:0264b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我亦與授阿耨多羅三藐三菩提記。",
        "translation": "'I'll also grant him the assurance of attaining supreme perfect enlightenment.'",
        "source": "X31n0607_004:0264b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞極少法亦與授記功報如前解也。",
        "translation": "The merits and rewards of hearing a very small amount of the teaching and being given the prediction are explained as before.",
        "source": "X31n0607_004:0264b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明授道師門功深福重二初長行二初別二初明現世二初明下品師二初明師相。",
        "translation": "△Two explanations of the profundity and merit of the teacher who bestows the path, two first long practices, two first distinctive practices, and two first explanations of the present world, two first explanations of the lower-class teacher, and two first explanations of the teacher's characteristics.",
        "source": "X31n0607_004:0264b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若復有人受持讀誦解說書寫(至)乃至合掌恭敬。",
        "translation": "\"If there's another person who accepts, recites, interprets, writes, and joins his palms in respect, then he'll accept the teaching.",
        "source": "X31n0607_004:0264b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上明稟道弟子此下明授道師門師論下上時談現未無論上下現未逆之得罪順之得福今明現在下品師相即是五種法師十種供養也妙樂云上下品師者但約凡位以判十供養者一華二香三瓔珞四末香五塗香六燒香七幡葢八衣服九技樂十合掌也。",
        "translation": "The first clarifies the proposition's disciple, the second clarifies the teacher who grants the path, the second clarifies the teacher's perspective, the second discusses the present time and the second clarifies the characteristics of the lower-rank teacher, which are the five kinds of Dharma teachers and the ten kinds of offerings.",
        "source": "X31n0607_004:0264b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明功報。",
        "translation": "△Two, it shows the rewards of merit.",
        "source": "X31n0607_004:0264b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王當知是諸人等(至)廣演分別妙法華經。",
        "translation": "You should know, Healing King, that these people and others (to) extensively explain and discern the Marvelous Lotus Sutra.",
        "source": "X31n0607_004:0264b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "曾供養者明先世因深也愍眾生故生此人間明現世功大也若有人問下明未來報重也何以故下釋出報重之相也。",
        "translation": "This person who made offerings to others in the past shows that the causes in previous lives were deep, and that pity for sentient beings and therefore birth among humans shows that merit in the present life is great.",
        "source": "X31n0607_004:0264b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明上品師二初況出上品相。",
        "translation": "△Two explanations of the superior teacher are two: first, how can he produce the characteristics of the superior class?",
        "source": "X31n0607_004:0264b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況盡能受持種種供養者。",
        "translation": "How could it be possible for someone to make and maintain all kinds of offerings?",
        "source": "X31n0607_004:0264b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明上品功報。",
        "translation": "△Two explanations of the rewards of superior qualities.",
        "source": "X31n0607_004:0264b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王當知是人自捨(至)生於惡世廣演此經。",
        "translation": "You should know, Medicine King, that this person freely gives up (up to) being born in a bad world and extensively explains this sūtra.",
        "source": "X31n0607_004:0264b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是人自捨清淨報者大悲願牽捨於清淨之土而生濁惡世中仍是業生未有通應願兼於業故生也如妙玄眷屬妙中明業生願生眷屬是也。",
        "translation": "This person's pure reward of self-abandonment is the result of his great compassionate vow to abandon the pure land and be born in a turbid evil world where karma is still born but there's no common response to vows and karma so it's born, such as the Miao Xuan's retinue.",
        "source": "X31n0607_004:0264b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明來世二初明下品師二初明師相。",
        "translation": "△Two explanations of the future world, two first explanations of the lower-class teacher, and two first explanations of the teacher's characteristics.",
        "source": "X31n0607_004:0264c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若是善男子善女人(至)說法華經乃至一句。",
        "translation": "\"Suppose a good man or good woman explains the Lotus Sutra up to the last sentence.",
        "source": "X31n0607_004:0264c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竊為一人說一句者雖得一句之解既不廣聞多學異義不可眾中而說一切問難有所不通便令正理不得宣弘若欲申此一句正言且當竊說耳如釋論明有慧無聞譬如小雨無雷妙樂云故知下品師亦許為弘法故於內教中廣習異義以助正教世有習俗典而云助正者反淪正理釋論云有慧無多聞亦不知實相譬如大暗中有目無所見多聞無智慧亦不知實相譬如大明中有燈而無照無聞無智慧譬如人身牛有聞有智慧是所說應受。",
        "translation": "Although he secretly explains one phrase for one person, even though he understands one phrase, he hasn't heard widely and studied many different meanings, and he can't explain them in a crowd. If he wants to explain this one phrase correctly, he should also secretly explain it as the Śākyamuni śāstra explains that there's wisdom and no hearing, like a light rain without thunder and marvelous clouds of joy.",
        "source": "X31n0607_004:0264c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明功報。",
        "translation": "△Two, it shows the merit of rewards.",
        "source": "X31n0607_004:0264c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知是人則如來使如來所遣行如來事。",
        "translation": "You should know that this person is a messenger of the Tathāgata, a messenger sent by the Tathāgata, and performing the Tathāgata's works.",
        "source": "X31n0607_004:0264c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經是如智所說說於如理今日行人乘此如教宣於如理即是如來使也行如來事者如來以如智照如理為事今日行人依如教行如理即是行如來事也(約自行釋)又如來以一如智一如理化眾生為事今日行人能有大悲以此經中真如之理為眾生說令得利益亦名行如來事也(約化他釋)。",
        "translation": "Today's practitioner who makes use of this teaching to proclaim the principle of thusness is a messenger of the Tathāgata and performs the tathāgata's works. The Tathāgata uses knowledge of thusness to illuminate the principle of thusness as a task, and today's practitioner relies on the teaching to perform the principle of thusness, which is to perform the tathāgata's works.",
        "source": "X31n0607_004:0264c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明上品師。",
        "translation": "△Two, \"Teacher of the highest level.",
        "source": "X31n0607_004:0264c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何況於大眾中廣為人說。",
        "translation": "How could he explain it to a large audience?",
        "source": "X31n0607_004:0264c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略不格量上品功報者以前下品望今上品此意可知也。",
        "translation": "The person who doesn't measure the rewards of the higher level is the one who looks back to the lower level and sees the higher level now, which is understandable.",
        "source": "X31n0607_004:0264c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二總二初明逆者得罪。",
        "translation": "△Two general points. First, he explains that a person who goes against the rules will be held responsible.",
        "source": "X31n0607_004:0265a01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王若有惡人以不善心(至)其罪甚重。",
        "translation": "\"King of Medicine, if there's a bad person with an unwholesome mind (to) that person's crimes are very serious.",
        "source": "X31n0607_004:0265a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此中罪福不論福田濃瘠但約初後心明其輕重初心學人讀誦經者既具煩惱若加毀訾障礙則能令其所學事廢故獲罪多佛既惑盡冤親平等惡不干偪豈能障礙故言罪輕供養亦爾此人有待若得供養所修事成故施之福勝佛則無待眾事滿足雖復供獻於佛無益故言報劣妙樂云佛則平等惡不干偪等者若爾供佛無福何須供佛毀佛無罪何須制罪答實爾但為成校量故向云不論福田濃瘠若從田論凡瘠聖濃故應毀供重於凡也。",
        "translation": "Here, the offense and merit don't matter how thick or thin the field of merit is, but the relative seriousness of the offense is explained in terms of the first and last states of mind.",
        "source": "X31n0607_004:0265a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明順者得福。",
        "translation": "△Two, it shows that those who accord with it will obtain merit.",
        "source": "X31n0607_004:0265a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王其有讀誦法華經者(至)以佛莊嚴而自莊嚴。",
        "translation": "He who recites the Lotus Sutra (to) adorns himself with the Buddha's adornment.",
        "source": "X31n0607_004:0265a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛以定慧莊嚴而說此經若人讀誦此經者則是能脩佛之定慧故云以佛莊嚴而自莊嚴也。",
        "translation": "The Buddha adorned himself with meditation and wisdom when he taught this sūtra, and if someone recites this sūtra, they'll be able to cultivate the Buddha's meditation and wisdom; therefore, it's called adorning oneself with the Buddha's adornment.",
        "source": "X31n0607_004:0265a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則為如來肩所荷擔。",
        "translation": "Then he'll be a burden on the tathāgata's shoulders.",
        "source": "X31n0607_004:0265a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在背為荷在肩為擔若人讀誦是經則能得佛非權非實法身之體即是為如來背之所荷亦能得佛能權能實二智之用則是為如來兩肩所擔妙樂云佛得權實及非權實我亦得之乃稱佛得是則義當在佛肩背亦是用佛權實等法名在佛肩背亦是眾生常在肩背日用不知。",
        "translation": "If a person recites this sūtra, then they can attain the Buddha's essence of the Dharma body that's neither provisional nor real, which is the load on the Tathāgata's back, and they can also attain the Buddha's ability to use the two kinds of wisdom that are provisional and real, which is the burden on the Tathāgata's shoulders.",
        "source": "X31n0607_004:0265a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所至方應隨向禮(至)三藐三菩提故。",
        "translation": "They should then pay homage to (to) Samyak-saṃbodhi in whatever direction they go.",
        "source": "X31n0607_004:0265a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨所向方應向禮者上明以法為師今明堪為物師此人有所趣向悉與實相相應皆可敬順順即是向敬即是禮敬而順之及興供養等所以者何下釋上應供之意也妙樂云應持天寶等者先舉人中上供次以天寶況之尚以天寶奉獻故云應持而況人中上供乎。",
        "translation": "Those who should pay homage to the direction they're headed should first understand that they take the teaching as their teacher, and now they understand that they can be the teacher of things.",
        "source": "X31n0607_004:0265a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌三初勸自行利他。",
        "translation": "△Two verses and three hymns begin by encouraging self-benefiting others.",
        "source": "X31n0607_004:0265b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to reiterate this teaching and spoke the verse, saying.",
        "source": "X31n0607_004:0265b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若欲住佛道(至)當受持是經并供養持者。",
        "translation": "\"If you want to abide in the Buddha Way (to), you must accept and maintain this sūtra and make offerings to those who maintain it.",
        "source": "X31n0607_004:0265b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌師門別總二初頌別二初頌現世二初頌下品師二初明師相。",
        "translation": "△Two hymns of praise for the distinctive and general approach of the teacher, two hymns for the distinctive and two hymns for the present life, and two hymns for the inferior class of teachers, first clarifying the characteristics of the teacher.",
        "source": "X31n0607_004:0265b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能受持妙法華經者。",
        "translation": "\"If there's someone who can accept and uphold the Saddharmapuṇḍarīka-sūtra, then he'll be able to offer support to them.",
        "source": "X31n0607_004:0265b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明功報。",
        "translation": "Second, he explains the merit of the teacher.",
        "source": "X31n0607_004:0265b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知佛所使愍念諸眾生。",
        "translation": "You should know that the Buddha causes compassionate consideration for sentient beings.",
        "source": "X31n0607_004:0265b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌上品師二初明師相。",
        "translation": "△Two verse verses on the higher-ranked teacher and two that first explain the teacher's characteristics.",
        "source": "X31n0607_004:0265b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸有能受持妙法華經者。",
        "translation": "\"Are there people who can accept and uphold the Saddharmapuṇḍarīka?",
        "source": "X31n0607_004:0265b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明功報。",
        "translation": "△Two clarify the merit of the teacher.",
        "source": "X31n0607_004:0265b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "捨於清淨土愍眾故生此(至)供養說法者。",
        "translation": "Those who abandon the pure land and take pity on sentient beings and therefore give birth here (to) make offerings and explain the teaching.",
        "source": "X31n0607_004:0265b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌來世二初超頌上品師二初頌師相。",
        "translation": "△Two hymns of praise for future lives, two superlative hymns for superior teachers, and two preliminary hymns for the characteristics of teachers.",
        "source": "X31n0607_004:0265b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吾滅後惡世能持是經者。",
        "translation": "\"He'll be able to uphold this sūtra in the evil world after I die.",
        "source": "X31n0607_004:0265b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌功報。",
        "translation": "△Two hymns of praise for the merits of the teacher.",
        "source": "X31n0607_004:0265b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當合掌禮敬如供養世尊(至)冀得須臾聞。",
        "translation": "He will bow with his palms together in reverence as an offering to the Bhagavān (to) hope to hear it in a moment.",
        "source": "X31n0607_004:0265b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二追頌下品師二初頌出人。",
        "translation": "△Two further verses on the inferior teachers and two verses on the person who emerges from the world.",
        "source": "X31n0607_004:0265b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若能於後世受持是經者。",
        "translation": "\"If he can accept and uphold this sūtra in later lifetimes, then...",
        "source": "X31n0607_004:0265b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌功報。",
        "translation": "△Two verse titles praise the merits of the rewards.",
        "source": "X31n0607_004:0265b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我遣在人中行於如來事。",
        "translation": "'I'll send you among men to do the Tathāgata's work.'",
        "source": "X31n0607_004:0265b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌總二初頌逆者得罪。",
        "translation": "△Two Verses General: The first verse praises the offense of disobedience.",
        "source": "X31n0607_004:0265c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於一劫中常懷不善心(至)其罪復過彼。",
        "translation": "If he always harbors an unwholesome mind during an eon (to), his offense will again exceed his.",
        "source": "X31n0607_004:0265c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌順者得福。",
        "translation": "△Two verses summarize the second verse, \"The obedient will obtain merit.",
        "source": "X31n0607_004:0265c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有人求佛道而於一劫中(至)我今獲大利。",
        "translation": "If someone pursues the Buddha Way for one eon (to), I'll now attain great rewards.",
        "source": "X31n0607_004:0265c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌歎經尊妙。",
        "translation": "△Three verses praise the sūtra's subtlety.",
        "source": "X31n0607_004:0265c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王今告汝我所說諸經而於此經中法華最第一。",
        "translation": "Now, the king of healing herbs tells you that among the scriptures I've taught, the Lotus is the most distinguished.",
        "source": "X31n0607_004:0265c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二長行偈頌歎美所持法示弘經方軌二初長行二初歎經法五初約法歎。",
        "translation": "△Two long verses praising the beauty of the Dharma that you hold and showing the way to spread the sūtras, two long verses praising the sūtras and two praising the Dharma.",
        "source": "X31n0607_004:0265c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛復告藥王菩薩(至)此法華經最為難信難解。",
        "translation": "It was then that the Buddha again told Yama King Bodhisattva (to) that this Lotus Sutra is the most difficult to believe and difficult to understand.",
        "source": "X31n0607_004:0265c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已今當說此經為最此約法歎也已者大品已上漸頓諸說也今者同一座常謂無量義經也當者謂涅槃也大品等漸頓諸說皆帶方便取信為易無量義一生無量無量未還一是亦易信今法華論法則一切差別融通歸一論人則師弟本迹俱皆久遠人法悉與昔異故難信解當鋒難事法華已說涅槃在後則可信也妙樂云當鋒者法華在前如大陣難破涅槃在後如餘黨不難初當先鋒斯為不易。",
        "translation": "This is the most detailed explanation of the teaching. This is the same as the gradual and sudden teachings above the Great Chapter, and this is the same as the one that always refers to the Sutra of Immeasurable Meaning, and this is the one that refers to nirvāṇa.",
        "source": "X31n0607_004:0265c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王此經是諸佛秘要之藏不可分布妄授與人。",
        "translation": "Healing King, this sūtra is the secret store of the buddhas, and it can't be distributed or given to someone falsely.",
        "source": "X31n0607_004:0265c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "秘要之藏者隱而不說為秘總一切法為要真如實相包蘊為藏不可分布者法妙難信深智可授無智不信謗乃獲罪故不可妄說也。",
        "translation": "A secret store that's hidden but not explained is a secret that summarizes all dharmas as essentials, and the true nature of reality as an encompassing collection is a store that can't be distributed because it's difficult to believe in the wonders of the Dharma and profound knowledge can be given to those who lack knowledge and don't believe in it.",
        "source": "X31n0607_004:0265c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛世尊之所守護從昔已來未曾顯說。",
        "translation": "The Bhagavān guarded them in a way that hadn't been revealed since ancient times.",
        "source": "X31n0607_004:0265c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從昔已來未曾顯說者於三藏中不說二乘作佛亦不明師弟本迹方等般若雖說實相之藏亦未說五乘作佛亦未發迹顯本頓漸諸經皆未融會故名為秘此法華經具說昔所秘法即是開秘密藏亦即是秘密藏如此秘藏從昔守護今方顯說也。",
        "translation": "Although the Tripiṭaka doesn't teach the two vehicles to become buddhas and doesn't know the original traces of teachers and disciples, then Equanimous Prajñāpāramitā explains the store of true characteristics, doesn't explain the five vehicles to become buddhas, doesn't reveal the traces, doesn't show the origin, and doesn't gradually unify all the sutras; therefore, it's called secret.",
        "source": "X31n0607_004:0265c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而此經者如來現在猶多怨嫉況滅度後。",
        "translation": "This sūtra says that the Tathāgata is still very much resentful in the present, so why wouldn't he be resentful after he's ceased?",
        "source": "X31n0607_004:0266a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來在世猶多怨嫉者四十餘年不得即說今雖欲說而五千尋即退座佛世尚爾何況未來理在難化也妙樂云如來至怨嫉者思宿惡為怨忌現善曰嫉故障未除者為怨不喜聞者名嫉今通論者迹門以二乘鈍根菩薩為怨嫉五千起去未足可嫌本門以菩薩中樂近成者而為怨嫉闔眾不識何得為怪今仍在迹意則可見理在難化者明此理者意在令知眾生難化也。",
        "translation": "The Tathāgata was still full of resentment in the world for more than forty years, but he couldn't explain it right away. Although he wants to explain it now, he's still retreating from his seat after five thousand inquiries, so why wouldn't he do so in the future when it's difficult to teach the principle?",
        "source": "X31n0607_004:0266a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二約人歎。",
        "translation": "△Two, it's about admiration for people.",
        "source": "X31n0607_004:0266a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王當知如來滅後(至)則為如來手摩其頭。",
        "translation": "The Medicine King should know that after the Tathāgata's disappearance (to) then he'll rub the Tathāgata's hand over his head.",
        "source": "X31n0607_004:0266a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此約人歎也此法在人則人尊貴如來衣覆者言若能持說此經即是修學大忍是為如來衣覆即上文云如來莊嚴也佛護念者實相為佛實智為子尊崇實相發生實智即為諸佛所護念也四信為信力(三寶及戒)四弘為願力大智為善根力信則信理理即法身志願是立行行即解脫善根根固難動此即般若當知三力即是三德秘密之藏初心栖此與佛不殊故名與如來共宿也手摩頭者此人以願力善力自行權實以為機感機感名頭如來以化他權實二智名手開發前人自行權實之頭感應道交故言摩頭摩頭即授記也妙樂云初心栖此等者此用所表如前荷負若不爾者色身共宿乃至摩不淨頭於理何益。",
        "translation": "The four faiths are the power of faith (the Three Treasures and precepts), the four vast powers are the power of vow, the great wisdom is the power of good roots, and faith is belief in the principle, the principle is the Dharma body, aspiration is the establishment, practice is liberation, and the good roots are firmly unshakable.",
        "source": "X31n0607_004:0266a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三約處歎。",
        "translation": "△Three times he praises the place.",
        "source": "X31n0607_004:0266b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王在在處處(至)皆近阿耨多羅三藐三菩提。",
        "translation": "The king of healing is present in all places, and in all places (to) he approaches unsurpassed, perfect enlightenment.",
        "source": "X31n0607_004:0266b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此約處歎也此法在處即處貴夫佛生處得道轉法輪入涅槃等處法王所遊皆應起塔此經是法身生處得道之場法輪正體大涅槃窟此經所在須塔供養不須復安舍利者釋論云碎骨是生身舍利經卷是法身舍利此經是法身舍利不須更安生身舍利生法二身各有全碎皆可解妙樂云生身碎者如釋迦八斛四斗生身全者如多寶全身在寶塔中法身碎者諸方便教也法身全者法華一實也四教五時委簡可見。",
        "translation": "This is a place of praise where the Dharma is present, which is where the noble ones are, where the Buddha's birthplace is attained, where he turns the Dharma wheel, enters nirvāṇa, and other places where the Dharma king travels should erect stūpas.",
        "source": "X31n0607_004:0266b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四約因。",
        "translation": "△The four approximate causes.",
        "source": "X31n0607_004:0266b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王多有人在家出家(至)乃能善行菩薩之道。",
        "translation": "The Medicine King often has people at home and at home who are renunciant (to) then are able to skillfully practice the bodhisattva path.",
        "source": "X31n0607_004:0266b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此約因歎也若未善行菩薩道者稟前三教未能巧度若聞是經即入圓教名為巧度巧度為善行也妙樂云巧度者如止觀第六記引大論作巧拙二醫譬云如用針藥名為拙度用呪術者名為巧度聲聞化人苦行頭陀等名拙度菩薩化人觀諸法實名巧度彼大論文通以衍門為巧今別以一實為巧。",
        "translation": "If someone who hasn't yet well practiced the bodhisattva path has not yet accomplished the three previous teachings, then they'll enter the perfect teaching after hearing this sūtra, which is called \"accomplishing skillful salvation.\" Miao-le Yun Qiaodu is like the sixth record of Zhiguan quoting the Great Treatise as making the two medical metaphors of skillful and clumsy, which says that using needles and medicine is called clumsy salvation.",
        "source": "X31n0607_004:0266b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五約果歎五初明近。",
        "translation": "△V. Approximation of Results The first of the five praises is to explain the nearness of the path.",
        "source": "X31n0607_004:0266b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有眾生求佛道者(至)得近阿耨多羅三藐三菩提。",
        "translation": "Those sentient beings who pursue the Buddha's path (arrive) will attain near-anuttarasamyak-saṃbodhi.",
        "source": "X31n0607_004:0266b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知必得近三菩提果者安樂行中名為近處此菩提果佛眼佛智知見處為體則有二種一者初心菩提即初住二者後心菩提即妙覺今言近者正近初住菩提也。",
        "translation": "You should know that someone who certainly approaches the three fruits of enlightenment is called someone who approaches the place where the buddha's eyes, the buddha's wisdom, and the place of knowing and seeing are the essence of this fruit of enlightenment, and then there are two kinds: first, enlightenment of the first mind, which is the first abode, and second, enlightenment of the second mind, which is marvelous awakening.",
        "source": "X31n0607_004:0266b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二開譬。",
        "translation": "△Two metaphors are opened.",
        "source": "X31n0607_004:0266c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王譬如有人渴乏須水(至)其心決定知水必近。",
        "translation": "\"Medicine King, it's like a person who's thirsty and needs water (to) their mind is certain that they know water will come near.",
        "source": "X31n0607_004:0266c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此有二釋一約觀門二約教門觀門者眾生之心具諸煩惱名高原修習觀智名穿掘方證理味如得清水若依通觀乾慧地如乾土性地為濕土泥知水必近見諦為得清水若依別觀初從假入空但見空不見不空斷四住惑如鑿乾土去水尚遠次從空出假先知非假今知非空因茲二觀得入中道能伏無明轉見濕土去水則近初地為得清水也若依圓觀中道非空非假而照空假如漸至濕泥四住已盡無明已伏已得中道相似圓解故言如泥若入初住發真中解即破無明如泥澄清得見中道如見清水次約教門者土譬經教水喻中道教詮中道如土含水三藏教未詮中道猶如乾土方等般若帶於方便說中道義如見濕土法華教正直顯露說無上道如見泥因法華教生聞思修即悟中道如獲清水妙樂云譬中必須教觀二重方盡其理教觀相修共顯其妙教觀若偏二俱無力初約觀中初總明觀言雖通諸意且在圓依通觀下歷教明觀析體理同故略三藏。",
        "translation": "If we rely on the shared observation of the ground of dry wisdom as the ground of dry soil and the nature of wet soil, then we know that water must be near. If we rely on the distinct observation of the first stage of entering emptiness from the false, but seeing emptiness and not emptiness, we know that the four entrenched mental disturbances are like digging into dry soil and the water is still far away.",
        "source": "X31n0607_004:0266c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三合譬。",
        "translation": "△The three combined metaphors.",
        "source": "X31n0607_004:0266c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩亦復如是(至)必知得近阿耨多羅三藐三菩提。",
        "translation": "\"So too, the bodhisattva (to) surely knows that he's attained near unsurpassed, correct, and complete enlightenment.",
        "source": "X31n0607_004:0266c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於法華中獲聞思修即是圓觀三慧方能近果非三藏方等般若教中聞思修也。",
        "translation": "Attaining hearing, contemplating, and cultivating in the Lotus Sutra is to fully contemplate the three kinds of wisdom before approaching the fruit, not hearing, contemplating, and cultivating in the Paranirmita-vaipulya teaching of the Tripiṭaka.",
        "source": "X31n0607_004:0267a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四釋近。",
        "translation": "△Four explanations of approaching.",
        "source": "X31n0607_004:0267a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以者何(至)今佛教化成就菩薩而為開示。",
        "translation": "\"Why is it that (to) now the Buddha teaches accomplished bodhisattvas and gives instructions?",
        "source": "X31n0607_004:0267a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此釋得近之意一切菩薩者明諸教中權因也三菩提者明一切菩薩所得權果也此權因權果皆攝屬此經如乾濕等土悉依於水故言攝屬也開方便門者在昔為實施權不知權是方便故方便門閉今皆開之即是實相故方便門開昔說一切世間治生產業何曾是於方便今皆開之即是實相不相違背昔說小乘方便及小乘果尚非實相門況小乘方便而當是門今皆開之即是實相汝等所行是菩薩道決了聲聞法是諸經之王咸令眾生開示悟入佛之知見一色一香無非佛法若不開者則深固幽遠無人能到而今開之即得見水無乾土也。",
        "translation": "This explains the meaning of getting close to all bodhisattvas, which explains the causes of the provisional teachings, and the three bodhisattvas, which explains the results of the provisional teachings obtained by all bodhisattvas.",
        "source": "X31n0607_004:0267a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五揀非。",
        "translation": "△The five kinds of wrongdoing.",
        "source": "X31n0607_004:0267a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王若有菩薩聞是法華經(至)當知是為增上慢者。",
        "translation": "Medicine King, if there are bodhisattvas who hear this Lotus Sutra (to), they should know that it's an expression of pride.",
        "source": "X31n0607_004:0267a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若菩薩聲聞聞此說而驚疑者悉是乾土尚非濕土況見水耶。",
        "translation": "If bodhisattvas and śrāvakas hear this and are alarmed and doubt it, they'll see that it's a dry land and not a wet land, so why would they see water?",
        "source": "X31n0607_004:0267a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二示方軌二初示方法三初標章。",
        "translation": "△Two illustrations of the directions and two methods, and three first, a summary.",
        "source": "X31n0607_004:0267a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王若有善男子(至)爾乃應為四眾廣說斯經。",
        "translation": "\"King of Medicine, if there are any good sons (to) then you should explain this sūtra in detail to the four groups of people.",
        "source": "X31n0607_004:0267a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "室衣座三名為三軌末世弘經必藉此三自軌軌他方獲大利修無緣慈是入如來室修寂滅忍是著如來衣修於中空是坐如來座也。",
        "translation": "The three garments and three seats are the three ways by which sūtras in the final age must carry out their own ways and guide others in order to obtain great benefit. cultivating unconditional kindness is entering the Tathāgata's room, cultivating the tolerance of cessation is putting on the Tathāgata's garments, and cultivating emptiness in the middle is sitting on the Tathāgata's seat.",
        "source": "X31n0607_004:0267a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二解釋。",
        "translation": "△Two explanations.",
        "source": "X31n0607_004:0267a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來室者一切眾生中(至)如來座者一切法空是。",
        "translation": "\"The Tathāgata's abode is among all sentient beings, and the Tathāgata's seat is the emptiness of all dharmas.",
        "source": "X31n0607_004:0267a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈悲心是如來室者慈悲覆物惠利歸己名之為室謂悲拔一切苦即四趣三界二乘菩薩等苦慈與一切樂即人天涅槃常住等樂故慈悲是如來室也柔忍心是如來衣者遮彼惡障己醜名之為衣謂遮四住無知無明等醜故柔忍是如來衣也法空是如來座者安心於空方能安他安他安己名之為座葢空能亡一切相謂亡三界有相二乘無相菩薩非有相非無相故法空是如來座也是故利物以慈悲為首涉有以忍辱為基說法以亡我為本能行三法大教宣弘即世間依止故名法師問何故約三法名法師答約事論之必須登堂整服坐座乃可敷弘故約三耳又慈悲生一切善柔和遮一切惡法空蕩一切相。",
        "translation": "Compassionate mind is the Tathāgata's abode. Compassion covers things, and benefiting oneself is called the abode, which means it removes all suffering, namely, the suffering of bodhisattvas in the four destinies, the three realms, and the two vehicles. Compassion gives all happiness, namely, the happiness of humans and gods and the eternality of nirvāṇa.",
        "source": "X31n0607_004:0267a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三勸修。",
        "translation": "△Three exhortations to practice.",
        "source": "X31n0607_004:0267b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安住是中然後以不懈怠心(至)廣說是法華經。",
        "translation": "Abide in this, then with a mind that isn't lazy (to) explain this Lotus Sutra in detail.",
        "source": "X31n0607_004:0267b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五種法師用此三法自軌故云安住是中用此化他故云然後以不懈怠心等此勸修也修如來室是大慈悲若就同體即法身也若被眾生即是解脫能令眾生會於同體即是般若修如來衣者若就所覆即法身也若就能覆嚴身即寂滅忍是般若也若就和光利物即解脫也修如來座者若就能坐即般若也若就所坐即法身也身座冥稱即解脫也妙樂云三法相望各各具三雖復各具秪是一三三尚非三豈離為九是則菩薩常觀涅槃故勸弘經者觀而弘之不觀能弘之心焉曉所弘之理故佛令入我室著我衣坐我座若無三法何謂弘經。",
        "translation": "The five kinds of teachers use these three things to guide themselves, so they say, \"Abide in this, teach others,\" so they say, \"Then cultivate with a mind that isn't lazy.\" This encouragement also includes the Tathāgata's room, which is great compassion, and if it's the same body, which is the Dharma body, and if it's used by sentient beings, which is liberation, and if it's the same body that causes sentient beings to meet in the same body, which is prajñā.",
        "source": "X31n0607_004:0267b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明利益五初遣化人。",
        "translation": "△Two, I'll explain the benefits. Five first steps are to send people away to convert them.",
        "source": "X31n0607_004:0267c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王我於餘國遣化人為其集聽法眾。",
        "translation": "\"King of Medicine, I've sent converts from other countries to gather crowds of listeners of the Dharma for them.",
        "source": "X31n0607_004:0267c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若初心未淳止可遣化人未可遣化四眾八部也若見天龍倚此自高妨損其道故不可令見也若心無倚著則尚堪見佛況復天龍況得總持自證利益耶。",
        "translation": "If his mind isn't pure at first, he can send away converts, but he can't send away the four groups and eight divisions. If he sees gods and dragons leaning on this, he'll be able to see the Buddha, so why wouldn't gods and dragons be able to fully uphold the benefits of self-realization?",
        "source": "X31n0607_004:0267c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二遣四眾。",
        "translation": "△Two, he sent away four groups of people.",
        "source": "X31n0607_004:0267c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦遣化比丘比丘尼(至)聞法信受隨順不逆。",
        "translation": "They also send the transformation monks and nuns (to) hear the teaching, believe it, follow it, and don't reject it.",
        "source": "X31n0607_004:0267c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三遣八部。",
        "translation": "△Three dismissed the eight groups.",
        "source": "X31n0607_004:0267c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說法者在空閑處(至)聽其說法。",
        "translation": "If a Dharma preacher is in a secluded place (to) listen to his teaching, then he'll accept it.",
        "source": "X31n0607_004:0267c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四見佛身。",
        "translation": "△4. He sees the Buddha's body.",
        "source": "X31n0607_004:0267c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我雖在異國時時令說法者得見我身。",
        "translation": "Even though I'm in a foreign country, I sometimes allow Dharma preachers to see my body.",
        "source": "X31n0607_004:0267c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五與總持。",
        "translation": "△V and the Dhāraṇī as a whole.",
        "source": "X31n0607_004:0267c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若於此經忘失句逗我還為說令得具足。",
        "translation": "If I forget a phrase or comma in this sūtra, I'll explain it again so that it's complete.",
        "source": "X31n0607_004:0267c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌三初總勸。",
        "translation": "△Two verses and three hymns are first a general exhortation.",
        "source": "X31n0607_004:0267c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to recapitulate this teaching and spoke the verse, saying.",
        "source": "X31n0607_004:0267c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲捨諸懈怠應當聽此經是經難得聞信受者亦難。",
        "translation": "\"Those who want to abandon laziness should listen to this sūtra. It's difficult to hear and believe this sūtra, and it's also difficult for those who accept it.",
        "source": "X31n0607_004:0267c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正頌二初頌歎經法二初頌開譬。",
        "translation": "△Two main verses, two praises of the sūtra's teaching and two introductory verses that draw out the metaphors.",
        "source": "X31n0607_004:0267c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如人渴須水穿鑿於高原(至)決定知近水。",
        "translation": "'Like a person thirsty for water who has to dig through a plateau (to) definitely knows when he's near water.'",
        "source": "X31n0607_004:0267c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此頌歎經法中約果歎也。",
        "translation": "This verse praises the sūtras and teachings in terms of their fruition.",
        "source": "X31n0607_004:0267c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌合譬。",
        "translation": "△Two verses combine the metaphors.",
        "source": "X31n0607_004:0267c19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "藥王汝當知如是諸人等(至)近於佛智慧。",
        "translation": "\"You, Medicine King, should know that such people (arrive) near the Buddha's wisdom.",
        "source": "X31n0607_004:0267c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌示方軌二初頌方軌三初頌標章。",
        "translation": "△Two verses show the directional guidelines, two verses show the directional guidelines, and three verses show the title.",
        "source": "X31n0607_004:0267c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人說此經應入如來室(至)廣為分別說。",
        "translation": "\"If someone teaches this sūtra, they should enter the Tathāgata's abode (to) explain it in detail and in detail.",
        "source": "X31n0607_004:0267c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌解釋。",
        "translation": "△Two verses explain.",
        "source": "X31n0607_004:0267c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大慈悲為室柔和忍辱衣諸法空為座處此為說法。",
        "translation": "\"This is the teaching that makes the room of great compassion, the robe of gentle forbearance, and the emptiness of all dharmas the seat.",
        "source": "X31n0607_004:0267c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌勸修。",
        "translation": "△Three verses encourage cultivation.",
        "source": "X31n0607_004:0268a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說此經時有人惡口罵加刀杖瓦石念佛故應忍。",
        "translation": "If someone badmouths him or her while speaking this sūtra, adding swords, staves, tiles, and stones, they should tolerate it because they're mindful of the Buddha.",
        "source": "X31n0607_004:0268a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌利益六初明五益意。",
        "translation": "△Two verses on benefits and six explanations of the five benefits in the first place.",
        "source": "X31n0607_004:0268a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我千萬億土現淨堅固身於無量億劫為眾生說法。",
        "translation": "'I will manifest a pure and resilient body in a thousand trillion lands and teach sentient beings for measureless millions of eons.'",
        "source": "X31n0607_004:0268a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此總明如來以五事利益之意也正由應身徧滿十方能為五事守護行人五事者如前第一遣化人乃至第五與總持是也。",
        "translation": "This is a general statement of the Tathāgata's intention to benefit sentient beings with five things; it's precisely because the response body pervades the ten directions that it can guard five things for practitioners.",
        "source": "X31n0607_004:0268a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌遣四眾。",
        "translation": "△Two verses dismiss the four groups.",
        "source": "X31n0607_004:0268a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若我滅度後能說此經者(至)供養於法師。",
        "translation": "\"If someone can teach this sūtra after I die, (to) make offerings to the Dharma teacher.",
        "source": "X31n0607_004:0268a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌遣化人。",
        "translation": "△Three verses dismiss the person who converts them.",
        "source": "X31n0607_004:0268a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引導諸眾生集之令聽法(至)為之作衛護。",
        "translation": "Guide the sentient beings who gather there and make them listen to the teaching (to) guard them.",
        "source": "X31n0607_004:0268a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌與總持。",
        "translation": "△Four verses on the Dharma preacher and the Dharma master.",
        "source": "X31n0607_004:0268a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若說法之人獨在空閉處(至)為說令通利。",
        "translation": "If someone who teaches the Dharma is alone in an empty, shut-off place (to) make it possible for him to teach and bring benefit to others.",
        "source": "X31n0607_004:0268a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五頌見佛身。",
        "translation": "△Five verses on seeing the Buddha's body.",
        "source": "X31n0607_004:0268a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人具是德或為四眾說空處讀誦經皆得見我身。",
        "translation": "If a person possesses these virtues or speaks for four groups of people in an empty place, reading and reciting the sūtras will allow them to see my body.",
        "source": "X31n0607_004:0268a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六頌遣八部。",
        "translation": "△Sixth verse: \"Send out the eight groups.",
        "source": "X31n0607_004:0268a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人在空閑我遣天龍王(至)能令大眾喜。",
        "translation": "'If someone is in an empty place, I'll send the gods and dragon kings (to) make the people happy.'",
        "source": "X31n0607_004:0268a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三結勸。",
        "translation": "△Three concluding exhortations.",
        "source": "X31n0607_004:0268a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若親近法師速得菩薩道隨順是師學得見恒沙佛。",
        "translation": "'If you approach a teacher of the Dharma and quickly attain the bodhisattva path, following this teacher's training will lead to a vision of the Tathāgata Buddha.'",
        "source": "X31n0607_004:0268a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經見寶塔品第十一",
        "translation": "Miaofa lianhua jing see baotao pin diyi",
        "source": "X31n0607_004:0268a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "梵語塔婆或云窣堵波此翻方墳亦翻圓塚義翻靈廟阿含明四處起塔謂佛生處得道處轉法輪處入滅處今之寶塔是先佛入滅塔也先佛已居今佛竝坐當佛亦然此塔從地涌出者正為證前起後證前者證前三周說法皆是真實起後者若欲開塔須集分身明玄付囑聲徹下方召本弟子論於壽量四眾皆覩故言見寶塔品。",
        "translation": "The Sanskrit word taba or surpasses it by the word square tomb, which also means round tomb, and by the word spirit temple, which means the four places where a stūpa is raised are the place where a buddha is born, the place where he attains the way, the place where he turns the wheel of the Dharma, and the place where he enters into extinction.",
        "source": "X31n0607_004:0268a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二寶塔品二初長行三初明多寶涌現六初塔現之相。",
        "translation": "△Two sections of the jeweled stūpa, two first long form, three first clarifying the appearance of many treasures, and six first the appearances of the stūpa.",
        "source": "X31n0607_004:0268b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛前有七寶塔(至)種種寶物而莊校之。",
        "translation": "At the time, there were seven-jeweled stūpas (to) adorned with various treasures in front of the Buddha.",
        "source": "X31n0607_004:0268b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七寶為塔者用表七覺支七聖財為塔塔者實相之境法身所依之處也高五百由旬者是二萬里葢用竪表因中萬行果中萬德以因望果即高義也廣二百五十由旬者即是一萬里橫表萬善莊嚴即廣義也地者無明心地也以無所破破於無明以無所住住第一義空種種寶物者眾多定慧而莊校也妙樂云定慧無多對暗散說又定慧徧攝故亦云多七覺等者既是佛塔又證實經並用無作七覺七財也。",
        "translation": "The seven treasures that make up the stūpa are the seven factors of awakening and the seven holy assets that make up the stūpa, the realm of reality, and the place where the Dharma body rests. 500 yojanas high is 20,000 miles long, and the gist is to express 10,000 practices in cause and 10,000 virtues in effect, which is the high meaning. 250 yojanas wide is 10,000 miles long, and the horizon is 10,000 good adornments, which is the broad meaning.",
        "source": "X31n0607_004:0268b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五千欄楯龕室千萬(至)高至四天王宮。",
        "translation": "The five thousand railing and shield niche is ten million high, reaching as high as the palace of the four heavenly kings.",
        "source": "X31n0607_004:0268b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爛楯是總持龕室千萬者無量慈悲之室亦是無量空舍幢幡是神通勝相垂寶瓔珞者四十地功德上嚴法身下被眾生也寶鈴萬億即八音四辯四面出香者四諦道風吹四德香也高至四天王宮者窮四諦理也妙樂云垂寶等者從因至果果德皆藉因中萬行由莊嚴故即能下化如嚴復垂也。",
        "translation": "The robe is a monk's robe that holds the niche ten million times, which is a room of measureless compassion and measureless emptiness. The banners and streamers are superb marks of supernormal powers, and the pendant jewels and jewelry are the forty stages of merit that adorn the Dharma body and bring sentient beings down.",
        "source": "X31n0607_004:0268b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二諸天供養。",
        "translation": "△Two celestials make offerings.",
        "source": "X31n0607_004:0268b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十三天雨天曼陀羅華。",
        "translation": "The Trāyastriṃśa gods rain down celestial maṇḍala flowers.",
        "source": "X31n0607_004:0268b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△恭敬尊重讚歎。",
        "translation": "△Honoring, respecting, and praising them.",
        "source": "X31n0607_004:0268b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸天供養事解可知更復約理釋之住行向三十心為三十十地為一等覺為一妙覺為一合為三十三同依一實相境如三十三天同居忉利也雨天曼陀羅者必雨四華表初心具四十二地功德後心亦爾皆以四十地所有因華歸向法身如三十三天雨華供養寶塔也餘諸天龍等供養寶塔即是內凡外凡等亦依實相向果行因也。",
        "translation": "The understanding of the things that the gods make offerings to can be seen by further explaining the principle that abiding, practice, and dedication are thirty states of mind, thirty ten stages, one level of first awakening, one marvelous awakening, and one combined into thirty-three, all relying on the same reality as the Trāyastriṃśa Heaven and residing together in Thorea.",
        "source": "X31n0607_004:0268b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三多寶稱歎。",
        "translation": "△Three of the many treasures are praised.",
        "source": "X31n0607_004:0268c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾既寶塔中出大音聲(至)如所說者皆是真實。",
        "translation": "Now, a great voice emanates from the jeweled stūpa (to) thus explained, and it's all true.",
        "source": "X31n0607_004:0268c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此多寶稱歎釋迦正是證前開權顯實不虗也平等大慧即是諸佛智慧也平等有二一法平等即大慧所觀中道理也二眾生平等謂一切眾生皆用因理以至於果同得佛慧也若所觀理與眾生異不名大慧大者如前高廣義約觀心者空觀竪等假觀橫等中觀橫竪平等平等雙照即是平等大慧也如是如是者一如法相是歎佛所說稱於實故二如根性是歎佛至第五時方說法華不差機故皆是真實者如法相說故言真實也。",
        "translation": "This praise of many treasures by the Śākyamuni is precisely the realization that the preceding opening right reveals the real and isn't barren, and that equal great wisdom is the wisdom of the buddhas. There are two kinds of equality: one is the equality of dharmas, which is the principle in what's contemplated by great wisdom, and the other is the equality of sentient beings, which means that all sentient beings use the principle of cause to reach the result and attain Buddha's wisdom together.",
        "source": "X31n0607_004:0268c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四時眾驚疑二初得法喜。",
        "translation": "△There were four times when the multitude was astonished and doubtful, and two times when they first attained joy in the teaching.",
        "source": "X31n0607_004:0268c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時四眾見大寶塔住在空中(至)皆得法喜。",
        "translation": "It was then that the four crowds who saw the great jeweled stūpa standing in the sky (to) all attained joy in the Dharma.",
        "source": "X31n0607_004:0268c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二眾疑怪。",
        "translation": "△Two of the multitude had doubts and wonders.",
        "source": "X31n0607_004:0268c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "怪未曾有從座而起恭敬合掌却住一面。",
        "translation": "They wondered because they had never before got up from their seats, respected him, put their palms together, and stayed to one side.",
        "source": "X31n0607_004:0268c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五大樂說問三初問何因有此寶塔。",
        "translation": "△The five great musicians asked three questions. First, they asked what caused this jeweled stūpa to exist.",
        "source": "X31n0607_004:0268c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時有菩薩摩訶薩(至)以何因緣有此寶塔。",
        "translation": "At the time, there was this bodhisattva Mahāsattva(-to) What were the causes and conditions for the existence of this jeweled stūpa?",
        "source": "X31n0607_004:0268c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二問何故塔從地出。",
        "translation": "△Two questions were asked, \"Why did the stūpa come out of the ground?",
        "source": "X31n0607_004:0268c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從地涌出。",
        "translation": "It welled up out of the ground.",
        "source": "X31n0607_004:0268c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三問何故發是音聲。",
        "translation": "△Three asked why it made this sound.",
        "source": "X31n0607_004:0269a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又於其中發是音聲。",
        "translation": "And within it, this is the sound that arises.",
        "source": "X31n0607_004:0269a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六如來答釋三初答第二問。",
        "translation": "△The six tathāgatas answered and explained three times, first answering the second question.",
        "source": "X31n0607_004:0269a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告大樂說菩薩(至)為作證明讚言善哉。",
        "translation": "It was then that the Buddha addressed the Bodhisattva Mahāpratibhāna (to) make it clear for realization and praised him, saying, \"Good!",
        "source": "X31n0607_004:0269a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上問何故從地涌出佛今答云此佛有願為證法華故從地涌出也。",
        "translation": "The previous question was, 'Why did the Buddha well up out of the ground?' The present answer is, 'The Buddha had the vow to realize the Lotus, so he welled up out of the ground.'",
        "source": "X31n0607_004:0269a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二追答第一問。",
        "translation": "△Two further answers to the first question.",
        "source": "X31n0607_004:0269a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "彼佛成道已臨滅度時(至)應起一大塔。",
        "translation": "\"When he approaches his extinction after becoming a buddha (to), he should erect a large stūpa.",
        "source": "X31n0607_004:0269a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上問以何因緣有此寶塔今答云由彼臨滅有命令造此塔也。",
        "translation": "The previous question was, 'What are the causes and conditions for this jeweled stūpa?' The present answer is, 'It's because he's about to die and has orders to build this stūpa.'",
        "source": "X31n0607_004:0269a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三答第三問。",
        "translation": "△Three answers the third question.",
        "source": "X31n0607_004:0269a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其佛以神通願力(至)從地涌出讚言善哉善哉。",
        "translation": "By virtue of his supernormal powers and vows, that Buddha welled up from the ground and praised him, saying, \"Good, good!",
        "source": "X31n0607_004:0269a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上問何故發是音聲佛今答云彼佛為作證明故發是音聲也釋論明多寶佛不得說法而取滅度何謂不說當是多寶亦得開三但不得至法華顯實故釋論云不說法耳以是義故雖復滅度在在處處凡有說法華經便隨喜作證也。",
        "translation": "The previous question was, \"Why did he make this sound?\" The present answer is that the Buddha made this sound to testify. The Śākyamuni commentary explains that the Buddha of Prabhūtaratna couldn't preach and attain extinction.",
        "source": "X31n0607_004:0269a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明分身遠集七初請見多寶。",
        "translation": "△Two explanations of the distant gathering of the seven parts of the body begin with an invitation to see Prabhūtaratna.",
        "source": "X31n0607_004:0269a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時大樂說菩薩(至)我等願欲見此佛身。",
        "translation": "At that point, the great blissful teaching bodhisattva (arrived) and we wished to see this Buddha's body.",
        "source": "X31n0607_004:0269a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "承佛神力者欲開塔須集分身佛佛集即付囑付囑即召下方下方弟子涌出即應開近顯遠此是大事之由豈非佛神力令問也。",
        "translation": "Those who want to open the stūpa must gather the Buddha's body, and the Buddha's collection is a mandate.",
        "source": "X31n0607_004:0269a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二應集分身。",
        "translation": "△Two parts of the body should be gathered.",
        "source": "X31n0607_004:0269a20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告大樂說菩薩摩訶薩(至)今應當集。",
        "translation": "The Buddha told the great blessed one, \"The bodhisattva Mahāsattva (to) should assemble now.",
        "source": "X31n0607_004:0269a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三樂說請集。",
        "translation": "△Three of them asked Mahākauṣṭhila to assemble.",
        "source": "X31n0607_004:0269a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大樂說白佛言(至)欲見世尊分身諸佛禮拜供養。",
        "translation": "Mahākauṣṭhila said to the Buddha, \"I want to see the Bhagavān's partial body of buddhas and venerate and make offerings to them.",
        "source": "X31n0607_004:0269a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四放光遠召。",
        "translation": "△4. He radiated his radiance and summoned them far away.",
        "source": "X31n0607_004:0269a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛放白毫一光(至)所照之處亦復如是。",
        "translation": "It was then that the Buddha emitted a single ray of white hair (to) shine like this wherever he shone.",
        "source": "X31n0607_004:0269b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五諸佛同來。",
        "translation": "△5. All the buddhas came together.",
        "source": "X31n0607_004:0269b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時十方諸佛(至)并供養多寶如來寶塔。",
        "translation": "At the time, the buddhas of the ten directions (to) all made offerings to the jeweled stūpa of the Prabhūtaratna Tathāgata.",
        "source": "X31n0607_004:0269b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六嚴淨國界三初變娑婆。",
        "translation": "△The six adorned and purified realms three first changed into sahāva.",
        "source": "X31n0607_004:0269b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時娑婆世界即變清淨(至)一方所分之身猶故未盡。",
        "translation": "The world of Śāmbara then becomes pure (to the point where) the body that's part of one side is still not exhausted.",
        "source": "X31n0607_004:0269b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以八背捨三昧之力能變娑婆之穢土而成清淨之土表淨除見思惑也八背捨釋見化城喻品中。",
        "translation": "This is because the power of the eightfold equanimity samādhi can transform the defiled land of Śāmba into a pure land that purifies and removes the mental disturbances of views and perceptions.",
        "source": "X31n0607_004:0269b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二變八方。",
        "translation": "\"△Two transformations in eight directions.",
        "source": "X31n0607_004:0269b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時釋迦牟尼佛欲容受(至)諸天寶華徧布其地。",
        "translation": "At the time, Śākyamuni Buddha wanted to accept (up to) the spread of the gods' precious flowers throughout his land.",
        "source": "X31n0607_004:0269b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以八勝處三昧轉變自在之力第二變二百萬億那由他國皆令清淨表淨除塵沙惑也八勝處者一內有色相外觀色少觀道未增故須觀少二內有色相外觀色多觀心既調觀多無妨故言多三內無色相外觀色少四內無色相外觀色多五青勝處若觀青色轉變自在少能多多能少勝於背捨所見名青勝處六黃勝處七赤勝處八白勝處俱類青勝處中分別今用四色為勝處依大智論也若瓔珞經則以四大為四勝處。",
        "translation": "These eight abodes of excellence are the second transformation by the power of the eight abodes of samādhi that freely transforms 200,000,000,000 nayutas, which purifies the manifestation and removes the mental disturbances of the dust sands. The eight abodes of excellence are the following: first, there's the internal appearance of form and form is little, and the path of contemplation has yet to increase; therefore, it's necessary to contemplate little; second, there's the internal appearance of form and form is much, and since the contemplation mind is trained to contemplate much, it's said to be much; third, there's the internal appearance of form and form is little; fourth, there's the internal appearance of form and form is much; fifth, there's the abode of blue excellence, which is called the abode of blue excellence if the abode of blue transformation freely changes from little to much and less to more than what's seen in the abodes of piety.",
        "source": "X31n0607_004:0269b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三重更變。",
        "translation": "△Triple transformation.",
        "source": "X31n0607_004:0269b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦牟尼佛為諸佛當來坐故(至)徧滿其中。",
        "translation": "Śākyamuni Buddha filled them all for the sake of the buddhas who would come to sit there in the future.",
        "source": "X31n0607_004:0269b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以十一切處三昧於境無間所觀普徧之力第三變二百萬億那由他國皆令清淨表淨除無明惑也十一切處者一青一切處還取前背捨勝處中少青色使徧一切處皆青也二黃一切處三赤一切處四白一切處五地一切處還取前背捨勝處中少地色使一切處皆地也六水一切處七火一切處八風一切處九空一切處還入前空背捨定使一切處皆空也十識一切處還入前識處背捨使一切處皆有識也妙樂云如上三變淨土由背捨等者問佛有首楞嚴三味之力何以仍用小乘背捨等事禪又表破三惑復非所治答是如來定聖行中攬因成果果地事用無爽於理即首楞嚴中具諸三味非昔因時見禪法界此背捨等豈能變過三千若論所表不妨三變表破三惑。",
        "translation": "These ten universal abodes samādhi are the third transformation by which the power of the universal contemplation of the ten universal abodes is applied to the objects without interruption, purifying 200,000,000,000 nayutas and making them all pure, purifying the confusion of ignorance.",
        "source": "X31n0607_004:0269b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△七與欲開塔五初諸佛問訊說欲。",
        "translation": "△7. Opening the stūpa with desire 5. At the beginning, the buddhas inquired about desire and explained it.",
        "source": "X31n0607_004:0269c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是時諸佛各在寶樹下(至)諸佛遣使亦復如是。",
        "translation": "The buddhas were each present under a jeweled tree, and so were the messengers sent by the buddhas.",
        "source": "X31n0607_004:0269c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛同與欲開塔如僧中作法與欲意也大集經明若干佛與欲華嚴經亦說十方若干佛同說華嚴大品經亦云千佛同說般若皆不云是釋迦分身準今經者應是分身彼大集等猶帶方便故時中不顯說是分身耳今經非但數多亦且直說是我分身咸來與欲開塔也妙樂云如僧中與欲者但是引例而已不必全同僧中法事故云如耳多寶願力須諸佛集復令時會知分身多故此諸佛為開塔而集集又不至但遣侍者傳問訊等狀如與欲故諸侍者但申問訊無說欲辭大集若干諸佛與欲者於欲色二界大空亭中廣集十方一切諸佛南方有佛名曰金藏彼諸菩薩見光明已問於彼佛彼佛答云北方世界有佛名釋迦牟尼欲為大眾說法破大憍慢遣使從我索欲我今與之餘方亦爾補註云作法與欲者四分律鈔云凡言欲者希須為義欲明僧作法事意決同集但由緣差不遂情願令送心達僧知無違背法事如布薩說戒等其欲辭曰大德一心念某甲比丘如法僧事與欲清淨。",
        "translation": "The Mahāsaṃgha-sūtra explains that several buddhas in the Saṃgha work with desire to open the stūpa. The Flower Ornament Sutra also explains that several buddhas in ten directions work together to explain the wishes of the Huayan Sutra. The Mahāsaṃgha-sūtra also says that a thousand buddhas in ten directions work together to explain Prajñāpāramitā.",
        "source": "X31n0607_004:0269c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋迦指開塔戶。",
        "translation": "△Two Śākyamunis pointed to the opening of the stūpa's door.",
        "source": "X31n0607_004:0270a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時釋迦牟尼佛(至)如却關鑰開大城門。",
        "translation": "It was then that Śākyamuni Buddha (arrived) opened the great city gate like a key to a barrier.",
        "source": "X31n0607_004:0270a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開塔表開權見佛表顯實亦是證前復將開後也如却關鑰者却猶除也關是橫木持其門者鑰即鏁也表執迹之障除顯本之機動也。",
        "translation": "Opening the stūpa signified opening the expedient and seeing the Buddha signified revealing the truth, which was also the realization that the former would again open the latter, such as removing the key, which is a crossbar holding the door open, and the key, which is the lock, signified removing the obstruction of attaching to the traces and revealing the original motive.",
        "source": "X31n0607_004:0270a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三四眾皆同見聞。",
        "translation": "△Three or four congregations all see and hear together.",
        "source": "X31n0607_004:0270a10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時一切眾會(至)散多寶佛及釋迦牟尼佛上。",
        "translation": "At that moment, all the assembled (to) scatter the Prabhūtaratna Buddhas and Śākyamuni Buddhas.",
        "source": "X31n0607_004:0270a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四二佛分座而坐。",
        "translation": "△Two of the four buddhas were seated separately.",
        "source": "X31n0607_004:0270a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時多寶佛於寶塔中(至)坐其半座結加趺坐。",
        "translation": "At the time, Prabhūtaratna Buddha was sitting halfway up his throne in a jeweled stūpa, cross-legged.",
        "source": "X31n0607_004:0270a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "古佛塔現示滅而不滅釋迦入塔示生而不生不生不滅故竝坐表之又多寶久滅今出證經生不生也往昔滅度猶現全身滅非滅也既非生滅常住不移可表法身釋迦入塔二身相稱如智稱境可表應身。",
        "translation": "The ancient Buddha-stūpa now shows extinction but doesn't cease, and Śākyamuni enters the stūpa to show birth but doesn't arise; neither birth nor extinction is indicated by sitting together.",
        "source": "X31n0607_004:0270a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五四眾念請加被。",
        "translation": "△5.4 The crowd's mindfulness invited them to be entrusted with the Tathāgata's body.",
        "source": "X31n0607_004:0270a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時大眾見二如來(至)接諸大眾皆在虗空。",
        "translation": "The crowd then saw the two Tathāgatas (to) receive the masses, who were all in the sky.",
        "source": "X31n0607_004:0270a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明釋迦唱募三初明大聲唱募。",
        "translation": "△Three explanations of the Śākyamuni's call to arms were first explained as a loud call to arms.",
        "source": "X31n0607_004:0270a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以大音聲普告四眾(至)廣說妙法華經今正是時。",
        "translation": "With a great voice, he universally addressed the four crowds (to) explain extensively that this was the right time to recite the Lotus Sutra.",
        "source": "X31n0607_004:0270a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明付囑時至。",
        "translation": "Second, he explained that it was time to entrust him with the teaching.",
        "source": "X31n0607_004:0270a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來不久當入涅槃。",
        "translation": "'The Tathāgata will soon enter nirvāṇa.'",
        "source": "X31n0607_004:0270a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明付囑有在。",
        "translation": "△Three, it's clear that the entrustment is present.",
        "source": "X31n0607_004:0270b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛欲以此妙法華經付囑有在。",
        "translation": "The Buddha wants to entrust this Saddharmapuṇḍarīka-sūtra to the living.",
        "source": "X31n0607_004:0270b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有在者若佛在世隨機利物自說正法無待他人今佛化緣既盡欲令此法利益無窮故須付囑流通也付囑有在者此有二意一近令有在付八萬二萬舊住菩薩此土弘宣二遠令有在付本弟子下方千界微塵數菩薩令觸處流通妙樂云八萬二萬者八萬在法師品初二萬在持品之首。",
        "translation": "If the Buddha had lived in the world, he would have taught the correct teaching himself at random, without waiting for others. Now, since the Buddha has ended the causes of transformation, he wants to make the benefits of this teaching endless, so he must entrust its circulation to those in existence. There are two meanings to entrusting those in existence: first, to cause those in existence to entrust 80,000 or 20,000 long-abiding bodhisattvas to spread it in this land; and second, to cause those in existence to entrust bodhisattvas below this disciple in a thousand worlds and in a tiny number of dusts to cause it to circulate everywhere they touch.",
        "source": "X31n0607_004:0270b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌三初頌多寶滅度。",
        "translation": "△Two verse verses and three verse verses begin with a verse about the extinction of Prabhūtaratna.",
        "source": "X31n0607_004:0270b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說偈言。",
        "translation": "The Bhagavān then wanted to recapitulate this meaning and spoke the verse, saying.",
        "source": "X31n0607_004:0270b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖主世尊雖久滅度(至)在在所往常為聽法。",
        "translation": "\"Although the noble lord, the Bhagavān, has long since ceased (to) always listen to the teaching in all his dealings with it.",
        "source": "X31n0607_004:0270b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌分身遠集。",
        "translation": "△Two verses say, \"My partial body has gathered far and wide.",
        "source": "X31n0607_004:0270b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又我分身無量諸佛(至)以是方便令法久住。",
        "translation": "'I've divided my body into measureless buddhas (to) cause the Dharma to last for a long time with this method.'",
        "source": "X31n0607_004:0270b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此八行半頌分身佛集上文有七今文甚略仍不次第初三行頌第二應集義兼大樂說欲見及以請集次一行頌土淨次四行半頌諸佛同來。",
        "translation": "These eight and a half verses contain seven verses on the collection of part-body buddhas, but the present text is quite brief and doesn't go in order. The first three verses are on the second meaning of the collection and the great joy in explaining the desire to see and to request the collection, the next line is on the purification of the land, and the next four and a half lines are on the coming of the buddhas together.",
        "source": "X31n0607_004:0270b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌釋迦付囑二初舉三佛以勸流通三初募覓其人。",
        "translation": "△Three verses on the transmission of the Śākyas' instructions, two in which he raises three buddhas to encourage their circulation, and three in which he asks them to find someone.",
        "source": "X31n0607_004:0270b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告諸大眾我滅度後(至)今於佛前自說誓言。",
        "translation": "He told the crowd that after I had died out (until) now, he had spoken his vow before the Buddha.",
        "source": "X31n0607_004:0270b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二舉勸流通。",
        "translation": "△Two raised them for encouragement to circulate.",
        "source": "X31n0607_004:0270b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其多寶佛雖久滅度(至)當發大願令得久住。",
        "translation": "Although that Prabhūtaratna Buddha has long since ceased to exist (to) give rise to the great vow that it will be possible to stay for a long time.",
        "source": "X31n0607_004:0270b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此正舉三佛以勸持經也。",
        "translation": "This is precisely the point of raising three buddhas to encourage adherence to the sūtra.",
        "source": "X31n0607_004:0270b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三釋勸之意。",
        "translation": "△Three explanations of the meaning of the exhortation.",
        "source": "X31n0607_004:0270b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其有能護此經法者(至)多寶如來及諸化佛。",
        "translation": "\"Is there someone who can protect the teaching of this sūtra (up to) the Tathāgata of Prabhūtaratna and the transformation buddhas?",
        "source": "X31n0607_004:0270b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能持此經即是供養三佛及見三佛以釋勸意也。",
        "translation": "Those who can uphold this sūtra are those who make offerings to the three buddhas and those who see the three buddhas in order to explain the meaning of the exhortation.",
        "source": "X31n0607_004:0270b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二舉難持法勸流通二初正舉勸三初誡勸發願。",
        "translation": "△Two examples of difficult principles to uphold and encourage circulation are presented in the first place, and three examples of encouragement are given in the first place to encourage vowing.",
        "source": "X31n0607_004:0270b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善男子各諦思惟此為難事宜發大願。",
        "translation": "Good sons, suppose you each truly consider this to be a difficult matter and make a great vow.",
        "source": "X31n0607_004:0270c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二舉難持勸。",
        "translation": "△Two examples of difficult things to hold and exhort.",
        "source": "X31n0607_004:0270c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸餘經典數如恒沙(至)如斯經典是則為難。",
        "translation": "\"The remaining sūtras are as numerous as the sands of the Ganges (to) such sūtras are difficult.",
        "source": "X31n0607_004:0270c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙樂云八萬四千及十二部皆通大小若通於小但令聽者得小乘神通亦未為難若立有頂此約不得通者為況故知圓經暫讀暫說誠為不易。",
        "translation": "When the 84,000 and 12 divisions of the Āryaśaila teachings are both large and small, it wouldn't be difficult to teach the small and cause the listener to attain the superknowledge of the small vehicle.",
        "source": "X31n0607_004:0270c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三釋難持意。",
        "translation": "△Three explanations of the difficult-to-maintain teaching.",
        "source": "X31n0607_004:0270c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為佛道於無量土(至)若有能持則持佛身。",
        "translation": "'I will carry the Buddha's body for his path in measureless lands (to) if there's someone who can carry it.'",
        "source": "X31n0607_004:0270c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有能持即持佛身此意豈易妙樂云若有能持則持佛身者經有體宗用三衣座室三即三身故體室即法身宗座即報身用衣即應身也。",
        "translation": "If there's something he can hold, then he'll hold the Buddha's body. How could this meaning be easy? When Miao-le says, \"If there's something he can hold, then he'll hold the Buddha's body,\" the sūtras have three bodies, so the body and room are the Dharma body, the seat is the reward body, and the robe is the response body.",
        "source": "X31n0607_004:0270c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋勸意三初重募持經之人。",
        "translation": "△Two explanations of the exhortation three. First, he recruited someone to uphold the sūtras.",
        "source": "X31n0607_004:0270c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸善男子於我滅後(至)今於佛前自說誓言。",
        "translation": "\"Good sons, after I cease, I will now make this vow to myself before the Buddha.",
        "source": "X31n0607_004:0270c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二能持難持佛喜。",
        "translation": "Second, those who can uphold it and those who find it difficult to uphold it will be pleased with the Buddha.",
        "source": "X31n0607_004:0270c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此經難持若暫持者(至)如是之人諸佛所歎。",
        "translation": "If he temporarily upholds this difficult sūtra (to) such a person, the buddhas will praise him.",
        "source": "X31n0607_004:0270c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三能持即成勝行。",
        "translation": "△Three things he can maintain are accomplished by resolute practice.",
        "source": "X31n0607_004:0270c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則勇猛是則精進(至)一切天人皆應供養。",
        "translation": "This is courageous and vigorous, and this is diligence (to the point that) all gods and humans should make offerings.'",
        "source": "X31n0607_004:0270c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此明能持此經則成勝行也勇猛至住淳善地自行之勝行也佛滅度後至皆應供養化他之勝行也。",
        "translation": "This shows that someone who can uphold this sūtra will achieve superior conduct, which is courageous enough to abide in a pure and good state and superior conduct on their own, and after the Buddha's passing away until they should all make offerings to teach others.",
        "source": "X31n0607_004:0270c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經提婆達多品第十二",
        "translation": "Saddharmapuṇḍarīka-sūtraDevadatta-piṭaka-śāstra",
        "source": "X31n0607_004:0270c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提婆達多亦云提婆達兜此云天熱以其生時人天等眾心皆驚熱故亦云天授謂從天乞得故是斛飯王子阿難親兄入大乘論問彼提婆達多世世為佛怨云何而言是大菩薩答若是怨者云何而得世世相值如二人行東西各去步步轉遠豈得為伴報恩經云若有人言提婆達多實是惡人入阿鼻獄者無有是處大雲經云提婆達多不可思議所脩行業同於如來若夫自造三逆及教闍王害父害母如此等事皆是大士善權現化行於非道通達佛道眾生根性不同入道有異一逆一順弘道益物故知現逆為懼惡人令不起惡耳。",
        "translation": "Devadatta is also called Devadatta, which means \"heavenly fever\" because when he was born, the minds of humans, gods, and others were all agitated, and it also means \"heavenly mandate\" because he begged from the gods to get it.",
        "source": "X31n0607_004:0270c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○鳩摩羅什譯此經竟命僧叡講之叡開為九轍又有二十八品生起則元有二十八品後因長安宮人請此品入內江東所傳止得二十七品梁有滿法師講經一百徧於長沙郡燒身仍以此品安持品之前陳有南岳大師次此品在寶塔之後及以正法華勘之甚相應故知二師安次深得經意。",
        "translation": "After Kumārajīva had finished translating this sūtra, he ordered Saṃnin to preach it.",
        "source": "X31n0607_004:0271a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○此品來意引古弘經傳益非謬明今宣化事驗不虗舉往勸今使流通也。",
        "translation": "○This chapter comes from the idea that it's not wrong to cite ancient scriptures to transmit benefits, and it's not wrong to explain that the present task of promoting the teaching is not superfluous, but to cite the past and encourage the present to circulate it.",
        "source": "X31n0607_004:0271a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二提婆達多品引往弘經彼我兼益以證功德深重二初明昔日達多通經釋迦成道三初昔持經相二初長行四初求法時節。",
        "translation": "Second, the chapter on Devadatta refers to the scriptures that were propagated in the past, and we both benefited from them to realize the profundity of their virtues.",
        "source": "X31n0607_004:0271a17_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛告諸菩薩(至)求法華經無有懈倦。",
        "translation": "It was then that the Buddha told the bodhisattvas (to) pursue the Lotus Sutra without laziness.",
        "source": "X31n0607_004:0271a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正明求法二初明發願。",
        "translation": "△Two correctly explained the pursuit of the Dharma, and two first explained the vow.",
        "source": "X31n0607_004:0271a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於多劫中常作國王發願求於無上菩提心不退轉。",
        "translation": "Throughout many eons, he's always been a king and has vowed to pursue unsurpassed bodhi without turning back his mind.",
        "source": "X31n0607_004:0271a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明脩行二初明欲滿檀那勤行布施。",
        "translation": "△Two insights into cultivating practice. First, he explains his desire to fulfill the donor's duty to diligently practice generosity.",
        "source": "X31n0607_004:0271a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為欲滿足六波羅蜜(至)身肉手足不惜軀命。",
        "translation": "He wants to fulfill the six perfections (up to) his body, flesh, hands, and feet, and doesn't spare his life.",
        "source": "X31n0607_004:0271b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六波羅蜜釋見序品今更約教分別者大論云捨依正名檀防七支名戒打罵不報名忍為事始終名精進四禪八定名禪分地息諍名般若此三藏教明六度相也若施者受者及以財物三事皆空名檀不見持犯名戒能忍所忍不可得名忍身心不動名精進不亂不味名禪非智非愚名般若此通教明六度相也若六度修之皆有十利具如疏文此別教明六度相也若以第一義熏修若行若坐捨攀緣是檀捨攀緣不犯是戒於境界不生瘡疣是忍不捨離著之行是精進於事中不放逸是禪於諸法體性無生是般若復次於陰捨是檀不計念陰是戒於陰無我想是忍於陰起怨想是進於陰不熾然是禪於陰畢竟棄是般若又於界捨是檀於界不擾濁是戒於界捨因緣是忍於界數數捨是進於界不起發是禪於界如幻想是般若如是等是名第一義善巧方便甚深法要能滿六波羅蜜此圓教六度相也妙樂云依第一義以成波羅蜜者謂但取初心一念具足則一色一香無非十度。",
        "translation": "The six perfections are explained in the preface section of the explanation, and now we'll distinguish them by their teachings. The great treatise says that equanimity is properly called giving, the seven limbs are called precepts, scolding is not applied, forbearance is the beginning and end of a situation is called effort, the four meditations and eight concentrations are called meditation, the ground is calm, and the disputation is called prajñā.",
        "source": "X31n0607_004:0271b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明為滿般若推求妙法。",
        "translation": "△Two things are explained in order to fulfill the prajñāpāramitā and to inquire into the wonderful Dharma.",
        "source": "X31n0607_004:0271b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時世人民壽命無量(至)吾當終身供給走使。",
        "translation": "The people of the world then had an immeasurable life span, and I will make offerings to them for the rest of my life.",
        "source": "X31n0607_004:0271b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三求得法師。",
        "translation": "△Three sought to find a teacher of the Dharma.",
        "source": "X31n0607_004:0271b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有仙人來白王言(至)若不違我當為宣說。",
        "translation": "An immortal then came to the king and said, \"If it's not contrary to me, I'll explain it to you.",
        "source": "X31n0607_004:0271b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四受法奉行。",
        "translation": "△4. He accepted the teaching and handed it down.",
        "source": "X31n0607_004:0271b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "王聞仙言歡喜踊躍(至)精勤給侍令無所乏。",
        "translation": "The king rejoiced and jumped for joy when he heard what the sage said (to) diligently serve him so that there would be nothing to lack.",
        "source": "X31n0607_004:0271c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌五初頌求法時節。",
        "translation": "△Two verses and five hymns begin with a verse about the time and place for seeking the Dharma.",
        "source": "X31n0607_004:0271c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾世尊欲重宣此義而說偈言。",
        "translation": "Desiring to recapitulate this meaning, the Bhagavān spoke in verse.",
        "source": "X31n0607_004:0271c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我念過去劫為求大法故。",
        "translation": "\"I'm mindful that I sought the great teaching for eons past.",
        "source": "X31n0607_004:0271c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二頌正明求法。",
        "translation": "△Two verses precisely explain the search for the Dharma.",
        "source": "X31n0607_004:0271c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖作世國王不貪五欲樂(至)身當為奴僕。",
        "translation": "'Even though I'm a king of a worldly country who doesn't crave the five desires and pleasures (to) become a servant in my own body,' he said.",
        "source": "X31n0607_004:0271c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三頌得說法師。",
        "translation": "△Three verses reveal the Dharma teacher.",
        "source": "X31n0607_004:0271c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時有阿私仙來白於大王(至)吾當為汝說。",
        "translation": "It was then that the sage Ashi came to the king and said, \"I will explain this to you.",
        "source": "X31n0607_004:0271c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿私此云無比即達多往世名也。",
        "translation": "Ashi is the word for peerless, which is the past-life name of Dharmagupta.",
        "source": "X31n0607_004:0271c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四頌受法奉行。",
        "translation": "△Four verses: \"Accept the teaching and hand it down.",
        "source": "X31n0607_004:0271c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時王聞仙言心生大喜悅(至)勤求於大法。",
        "translation": "When the king heard what the sage said, his heart became overjoyed (to the point where) he diligently sought the great teaching.",
        "source": "X31n0607_004:0271c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "木實曰果草實曰蓏。",
        "translation": "The fruit of wood is called fruit, and the fruit of grass is called fruit.",
        "source": "X31n0607_004:0271c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五頌結證勸信。",
        "translation": "△5 verses conclude with a realization and encouragement of faith.",
        "source": "X31n0607_004:0271c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦不為己身及以五欲樂(至)今故為汝說。",
        "translation": "'Nor do I do so for myself or with the five desires and pleasures.'",
        "source": "X31n0607_004:0271c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二結會古今二初正結會古今。",
        "translation": "△Two Conferences, Ancient and Modern First, he correctly concluded the ancient and modern.",
        "source": "X31n0607_004:0271c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘爾時王者(至)今提婆達多是。",
        "translation": "The Buddha told the monks that at the time, the king (to) this is Devadatta.",
        "source": "X31n0607_004:0271c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明師弟功滿二初明弟子因報已滿三初明因滿。",
        "translation": "△Two explanations of the completion of the disciple's merits, two first, the completion of the disciple's karmic retribution, and three first, the completion of the cause.",
        "source": "X31n0607_004:0271c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由提婆達多善知識故(至)慈悲喜捨。",
        "translation": "It's because of Devadatta's good teachers (to) compassion, joy, and equanimity.",
        "source": "X31n0607_004:0271c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善知識有三一外護二同行三教授止觀云夫外護者不揀黑白但能營理所須如母養兒如虎銜子調理得所舊行道人乃能為耳是名外護善知識二同行者更相策發不昏不散日有其新切磋琢磨同心齊志如乘一船互相敬重如視世尊是名同行善知識三教授者內外方便通塞妨障皆能決了善巧說法示教利喜轉破人心是名教授善知識輔行云言外護者自己身心為內望他身心為外為外所護故名外護言同行者己他遞相策發人異行同故名同行言教授者宣傳聖言名之為教訓誨於我名之為授增一阿含經云莫與惡知識與愚共從事當與善知識智者而交通若人本無惡親近於惡人後必成惡人惡名遍天下善知識反此是故應親近慈悲喜捨名四無量心者從境以得名以所緣眾生無量故能緣之心亦隨境無量故悉受無量心名一慈無量心者能與他樂之心名之為慈心無瞋恨怨惱廣大無量徧滿十方名慈無量心二悲無量心者能拔他苦之心名之為悲心無瞋恨怨惱廣大無量徧滿十方名悲無量心三喜無量心者慶他得樂生歡悅心名之為喜也無瞋恨怨惱廣大無量徧滿十方名喜無量心四捨無量心者若緣於他無憎無愛之心名之為捨心無瞋恨怨惱廣大無量徧滿十方名捨無量心此四亦名四無量定。",
        "translation": "There are three kinds of good teachers: those who guard externally, those who walk with them, and those who teach, those who respect each other as the Bhagavān.",
        "source": "X31n0607_004:0271c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明果圓。",
        "translation": "△Two states of realization are complete.",
        "source": "X31n0607_004:0272a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二相八十種好(至)成等正覺廣度眾生。",
        "translation": "He has thirty-two marks and eighty kinds of features, and he becomes perfectly enlightened and extensively liberates sentient beings.",
        "source": "X31n0607_004:0272a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三十二相八十種好十八不共釋見譬喻品十力四無所畏釋見方便品四攝法者一布施攝菩薩以無所捨心行於財法二種布施若為樂財眾生即以財施而攝取之若為樂法眾生即以法施而攝取之二愛語攝菩薩若以善軟之言隨順一切眾生安慰開喻則一切眾生之所樂聞因是生親愛心依附受道三利行攝菩薩隨起身口意行能令一切眾生各沾利益四同事攝菩薩用法眼明見眾生根緣隨有同欣之者即分形散影普和其光同彼事業各使沾益此四通稱攝者眾生情所愛者即是此之四法若用此四法同情接引則眾生方乃依附然後導以大乘正道而度脫之故云先以欲鈎牽後令入佛道正覺者離邪曰正背妄曰覺。",
        "translation": "If the bodhisattva follows all sentient beings with kind and gentle words that comfort and inspire metaphors, then the delightful hearing of all sentient beings will give rise to affection, attachment, and acceptance of the path.",
        "source": "X31n0607_004:0272a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三結由益。",
        "translation": "△The three bonds are based on benefit.",
        "source": "X31n0607_004:0272b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆因提婆達多善知識故。",
        "translation": "They all result from a good teacher, Devadatta.",
        "source": "X31n0607_004:0272b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明法師妙果當成三初明果成。",
        "translation": "△Two explanations of the Dharma teacher's marvelous achievements that will be accomplished △Three first explanations of the achievements that will be accomplished.",
        "source": "X31n0607_004:0272b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "告諸四眾提婆達多(至)世界名天道。",
        "translation": "He told the four groups of people that Devadatta (to) the world is called the heavenly path.",
        "source": "X31n0607_004:0272b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明化度。",
        "translation": "Second, he explained that the world is called the heavenly realm.",
        "source": "X31n0607_004:0272b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天王佛住世二十中劫(至)得無生忍至不退轉。",
        "translation": "The then-Deva King Buddha lived on earth for 20 medium-length eons (to) attain the patient acceptance of nonarising until he didn't turn back.",
        "source": "X31n0607_004:0272b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三滅後益。",
        "translation": "△Three: \"Post-cessation benefits.",
        "source": "X31n0607_004:0272b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時天王佛般涅槃後(至)發菩提心至不退轉。",
        "translation": "After he attained parinirvāṇa, the then-Deva King Buddha aroused his mind for enlightenment until he didn't turn back.",
        "source": "X31n0607_004:0272b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三斷疑勸信。",
        "translation": "△Three ways to end doubt and encourage faith.",
        "source": "X31n0607_004:0272b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告諸比丘未來世中(至)若在佛前蓮華化生。",
        "translation": "The Buddha told the monks that in a future life (to) if they were in the Buddha's presence, a lotus flower would be born by transformation.",
        "source": "X31n0607_004:0272b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蓮華化生者胎經云蓮華生者非胎卵濕化之化生也非化而言化耳請觀音經云蓮華化生為父母無量壽佛經云華臺久者為胎生實非胎也例蓮華生者亦稱濕卵而非濕卵妙樂云非胎卵濕化之化生者不同界內四生中之化生如諸天化生仍在父膝等生況同四趣中耶今言化生者忽然而有如藥王中云於淨德王家忽然化生亦稱濕卵等者但以蓮華生濕未剖如濕如卵含在華內義之如胎也。",
        "translation": "The lotus flower that's born by transformation is not a fetus or egg, but a birth by transformation that's wet. The Avalokitêśvara Sutra says the lotus flower that's born by transformation is the parent, the Buddha of Immeasurable Life Sutra says the lotus flower that's born by transformation is a fetus that's really not a fetus.",
        "source": "X31n0607_004:0272b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明今日文殊通經龍女成佛二初明文殊通經五初智積請退。",
        "translation": "△Two explanations of today's Wenshu Tong jing, the dragon lady who became the Buddha, and two first explanations of Wenshu Tong jing's five requests for withdrawal.",
        "source": "X31n0607_004:0272c03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時下方多寶世尊所從菩薩(至)當還本土。",
        "translation": "At that point, the bodhisattva (to) whom the Bhagavān Dharmajñāna Prabhūtaratna was following from below would return to his native land.",
        "source": "X31n0607_004:0272c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積謂多寶為證經故出勸物流通既訖是故請還。",
        "translation": "Zhizhe said that it was because of the realization of the sūtras that Prabhūtaratna had sent out an invitation to circulate the sūtras, and since he had finished, he asked to be returned.",
        "source": "X31n0607_004:0272c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二釋尊止之。",
        "translation": "△Two Śākyamuni honored ones stopped him.",
        "source": "X31n0607_004:0272c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋迦牟尼佛告智積曰(至)論說妙法可還本土。",
        "translation": "Śākyamuni Buddha told Zhigye that (to) he could return to his homeland after expounding the wonderful Dharma.",
        "source": "X31n0607_004:0272c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋尊止之者雖迹門事訖本門未彰故託在文殊以留多寶佛之密意非菩薩所知。",
        "translation": "Śākyamuni stopped it because although the manifestation aspect of the teaching had been completed, the original aspect hadn't been revealed, so he entrusted it to Mañjuśrī to preserve the secret intention of Prabhūtaratna that wasn't known to the bodhisattvas.",
        "source": "X31n0607_004:0272c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三文殊尋來。",
        "translation": "△3. Mañjuśrī came looking for him.",
        "source": "X31n0607_004:0272c10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊師利坐千葉蓮華(至)共想慰問却坐一面。",
        "translation": "It was then that Mañjuśrī was sitting on a thousand-leaf lotus (to) congratulate and greet him, and then he sat to one side.",
        "source": "X31n0607_004:0272c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙樂云有人問云文殊序中在座今云何自海而來今為答之豈以凡情而度聖境不起此會於海化物義亦何辜亦可在序一期益訖去時豈要白知來時大利方生與眾自海而至或當彼有廣文具有出會之語而傳至此者略耳問三千世界之外各四百萬億無復大海文殊何故仍云從海涌出答事釋未爽況不思議今以三義通之一者既移天人及變大海若從所移處來處無遠獘二者海眾縱移而龍宮不動龍謂不動而所居已變從變而不變處來有何不可三者無緣者被移有緣者今來此不思議山海宛然令眾不見但是變見非謂改體文殊既不起而往其土亦即穢而淨故淨名云移置他土都不使人有往來想此中乃使有往來想而本不移所以理雖無動化事成規故使所見不同來往時異菩薩化儀尚爾豈佛設變同凡。",
        "translation": "Miaoleyun was asked, \"Wenshu was present in the preface, but why did he come from the ocean?\" He answered, \"Is it because ordinary people have crossed over to the holy realm without rising from this assembly?\" He could also have been present in the preface for a period of time, and when he received his benefits, did he need to know for certain that when he came, Dali was born in Fang and the multitude came from the ocean, or perhaps there was a broad text there that had the words to come together and was transmitted here?\" He asked why Wenshu still said that he had sprung from the ocean when there were four hundred thousand million great seas beyond the three thousand worlds.",
        "source": "X31n0607_004:0272c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四智積問化。",
        "translation": "△4. Zhiji asks about transformation.",
        "source": "X31n0607_004:0273a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積菩薩問文殊師利(至)所化眾生其數幾何。",
        "translation": "Zhizhe asked Mañjuśrī (to what extent) how many sentient beings he had converted.",
        "source": "X31n0607_004:0273a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五文殊決答七初答利益甚眾。",
        "translation": "△V.5 Mañjuśrī's Decisive Answer7 First, he answered, \"The benefits are numerous.",
        "source": "X31n0607_004:0273a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言其數無量(至)且待須臾自當證知。",
        "translation": "Mañjuśrī said their number was incalculable (up to) a moment later, and he would realize it himself.",
        "source": "X31n0607_004:0273a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二蒙益者集證。",
        "translation": "△Two of the benefits are gathered by those who realize them.",
        "source": "X31n0607_004:0273a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言未竟無數菩薩坐寶蓮華(至)住在虗空。",
        "translation": "Before they finish speaking, there are countless bodhisattvas sitting on jeweled lotus flowers (to) abiding in space.",
        "source": "X31n0607_004:0273a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三皆是文殊化。",
        "translation": "△Three: \"They're all transformed by Mañjuśrī.",
        "source": "X31n0607_004:0273a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸菩薩皆是文殊師利(至)皆共論說六波羅蜜。",
        "translation": "All these bodhisattvas are Mañjuśrī(-to) who together discuss the six perfections.",
        "source": "X31n0607_004:0273a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四聲聞先稟小。",
        "translation": "△Four śrāvakas first claimed to be lesser.",
        "source": "X31n0607_004:0273a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本聲聞人在虗空中說聲聞行。",
        "translation": "Originally, these śrāvakas taught śrāvaka practices in mid-air.",
        "source": "X31n0607_004:0273a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先稟權教住二乘道但說斷生死。",
        "translation": "They first brought up the provisional teaching that abides in the two-vehicle path but teaches the cessation of birth and death.",
        "source": "X31n0607_004:0273a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五今聞實住大。",
        "translation": "△5. Now we hear that the true abode is great.",
        "source": "X31n0607_004:0273a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今皆脩行大乘空義。",
        "translation": "Now, they all cultivate the practice of the great vehicle's doctrine of emptiness.",
        "source": "X31n0607_004:0273a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今聞實教悉住大乘法也。",
        "translation": "Now, we've heard the true teaching that they all abide in the great vehicle teaching.",
        "source": "X31n0607_004:0273a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六文殊結利益。",
        "translation": "△VI. Mañjuśrī concludes benefits.",
        "source": "X31n0607_004:0273a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利謂智積曰於海教化其事如是。",
        "translation": "Mañjuśrī told Zhigye that he was teaching and transforming things like this at sea.",
        "source": "X31n0607_004:0273a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△七智積偈讚歎。",
        "translation": "△7. Zhiji praised him in verse.",
        "source": "X31n0607_004:0273a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時智積菩薩以偈讚曰。",
        "translation": "It was then that the bodhisattva Zhigye praised him in a verse.",
        "source": "X31n0607_004:0273a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大智德勇健(至)廣導諸眾生令速成菩提。",
        "translation": "\"Great is the wisdom, virtue, and boldness (to) guide sentient beings broadly so that they can quickly achieve enlightenment.",
        "source": "X31n0607_004:0273a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明龍女利益九初明文殊自敘。",
        "translation": "△Two Explanations of the Benefits of the Nāgârjuna Nine First, he explained his own account of Mañjuśrī.",
        "source": "X31n0607_004:0273a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言我於海中唯常宣說妙法華經。",
        "translation": "Mañjuśrī said, \"In the ocean, I'm the only one who always preaches the Lotus Sutra.",
        "source": "X31n0607_004:0273a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明智積致問。",
        "translation": "△Two, Mañjuśrī asked him.",
        "source": "X31n0607_004:0273a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積問文殊師利言(至)修行此經速得佛不。",
        "translation": "Zhizhe asked Mañjuśrī, \"Does cultivating this sūtra quickly make you a buddha?",
        "source": "X31n0607_004:0273a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明文殊實答。",
        "translation": "△Three wise Mañjuśrī answered in substance.",
        "source": "X31n0607_004:0273b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言有(至)志意和雅能至菩提。",
        "translation": "Mañjuśrī said there's (up to) a will and an attitude that's harmonious and capable of reaching enlightenment.",
        "source": "X31n0607_004:0273b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙樂云文殊所歎龍女不出弘誓定慧諸行智慧下是慧深入等是定慈念等是誓功德下行也下去諸文有此流例準此應知得不退轉即初住念不退也。",
        "translation": "Miaoleyun Wenshu's praise of the dragon-maiden didn't lead to the nonretrogression of the great vow, concentration, wisdom, practices, wisdom, depth, etc., concentration, kindness, mindfulness, etc., and vowed merit, as well as practices that go beyond the texts and examples of this stream.",
        "source": "X31n0607_004:0273b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四智積執別疑。",
        "translation": "△4. Zhiji gathers doubts about attachments and distinctions.",
        "source": "X31n0607_004:0273b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積菩薩言(至)不信此女於須臾頃便成正覺。",
        "translation": "The bodhisattva Zhigong said, \"I don't believe this woman will become perfectly enlightened in a moment's time.",
        "source": "X31n0607_004:0273b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量劫行行是別教法智積難今龍女須臾成佛乃是執別疑圓是故不信。",
        "translation": "Measureless eons of practice and actions are the teachings of Zhigong, and it's difficult for Zhigong to say that the dragon lady's instantaneous attainment of Buddhahood is a result of her adherence to specific doubts and perfections; therefore, she doesn't believe it.",
        "source": "X31n0607_004:0273b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五龍女以圓釋二初經家敘現申敬。",
        "translation": "Δ5. The first two explanations of the dragon lady's perfection are described by the sūtras as present and reverential.",
        "source": "X31n0607_004:0273b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言論未訖時龍王女忽現於前(至)以偈讚曰。",
        "translation": "Before he finished speaking, the dragon-king woman suddenly appeared in front of him (to) praise him in verse.",
        "source": "X31n0607_004:0273b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌讚三初明持經得解。",
        "translation": "△Two verses praising the three first showed that he had attained understanding by retaining the sūtras.",
        "source": "X31n0607_004:0273b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深達罪福相徧照於十方。",
        "translation": "He deeply penetrates the marks of sin and merit, which illuminate everywhere in the ten directions.",
        "source": "X31n0607_004:0273b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "罪福相者約七方便迭論罪福今既開權無罪無福唯一實相名為深達十方即十法界同以實慧明之故言徧照。",
        "translation": "The aspect of sin and merit is discussed in detail in terms of the seven methods, but now that we've opened the right to no sin and no merit, the only true aspect is called profoundly penetrating in ten directions, which is the same as the ten realms of reality, and because we understand it with true wisdom, we say pervasively illuminating.",
        "source": "X31n0607_004:0273b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明成就二身。",
        "translation": "△Two, it's the accomplishment of two bodies.",
        "source": "X31n0607_004:0273b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "微妙淨法身具相三十二(至)無不宗奉者。",
        "translation": "The subtle, pure Dharma body has thirty-two marks (to) there's no one who doesn't hold to it.",
        "source": "X31n0607_004:0273b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具三十二相者深得法身之理即備相好如大品明欲得一切法當學般若如得如意珠也二乘但得空空無相好也四明尊者解謗書云龍女欲彰開權妙相故云法身具三十二相此一一相全理顯現法身徧處三十二相相相周徧法具萬德相亦須具此之妙身不名尊特更指何身為尊特耶釋迦既入多寶塔內驗非現起巍巍堂堂方名尊特秪就中道感應於丈六身便為相海此就開權即劣顯勝而明尊特乃即劣之尊特也。",
        "translation": "Those who have the thirty-two marks deeply understand the principle of the Dharma body that is, it has all the characteristics as explained in the Great Chapter that if you want to attain all things, you should study Prajñāpāramitā and attain the Tathāgata pearl, but the two vehicles only attain emptiness and emptiness without characteristics. The four luminaries who understand the honored one are the liberation writers, the dragon-maiden who wants to express the opening right to the marvelous marks and therefore says the Dharma body has thirty-two marks.",
        "source": "X31n0607_004:0273b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明引佛為證。",
        "translation": "△Three explanations cite the Buddha as proof.",
        "source": "X31n0607_004:0273c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又聞成菩提唯佛當證知我闡大乘教度脫苦眾生。",
        "translation": "'I've also heard that the only one who's achieved enlightenment is the Buddha, who will realize that I've explained the great vehicle teaching and liberated suffering sentient beings.'",
        "source": "X31n0607_004:0273c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六身子挾藏難二初總難信。",
        "translation": "△The six buddhas confronted the difficulty of the Āgamas, and the first two were general and difficult to believe.",
        "source": "X31n0607_004:0273c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時舍利弗語龍女言(至)具修諸度然後乃成。",
        "translation": "Śāriputra then spoke to the nāga girl, saying, \"Only after you completely cultivate the perfections will you attain them.",
        "source": "X31n0607_004:0273c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二出五礙。",
        "translation": "△Two, 'I'll get rid of the five hindrances.'",
        "source": "X31n0607_004:0273c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又女人身猶有五障(至)云何女身速得成佛。",
        "translation": "'Still, there are five hindrances in a woman's body.' How can a woman's body quickly become a buddha?",
        "source": "X31n0607_004:0273c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身子挾三藏權教之意而難也。",
        "translation": "The body of the Tathāgata takes the meaning of the Tripiṭaka expedient teaching and makes it difficult.",
        "source": "X31n0607_004:0273c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△七龍女以實釋二初獻珠表得圓解。",
        "translation": "△Two explanations of the seven dragon-maids in terms of reality First, he offered a pearl to show that he had attained perfect understanding.",
        "source": "X31n0607_004:0273c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時龍女有一寶珠(至)觀我成佛復速於此。",
        "translation": "The nāga girl then had a precious pearl (to) observe that I'll quickly become a buddha again.",
        "source": "X31n0607_004:0273c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓珠表其修得圓因奉佛是將因尅果佛受疾者表龍女獲果速也此即一念坐道場成佛不虗也。",
        "translation": "The perfect pearl showed that she had cultivated the cause to attain perfection and presented it to the Buddha as a response to the cause's result. The Buddha's quickness in accepting the result also showed that the nāga girl had attained the result quickly, which was to sit in the enlightenment site with a single thought and become a buddha without fail.",
        "source": "X31n0607_004:0273c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二正示因圓果滿。",
        "translation": "△Two correctly shows that the cause is complete and the result is full.",
        "source": "X31n0607_004:0273c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當時眾會(至)普為十方一切眾生演說妙法。",
        "translation": "At that time, the congregation universally explained the wonderful Dharma for all sentient beings in the ten directions.",
        "source": "X31n0607_004:0273c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "胎經云魔梵釋女皆不捨身不受身悉於現身得成佛故偈言法性如大海不說有是非凡夫賢聖人平等無高下唯在心垢滅取證如反掌妙樂云問龍女作佛者為不捨分段即成佛耶若不即身成佛此龍女成佛及胎經之文云何通耶答文殊入海通經龍女已得不捨不受之實證今於靈山捨女變男往彼成佛乃由實證起於權用以證圓經成佛速疾若實行不疾權行徒引是則權實義等理不徒然故胎經從實得說若實得者從六根淨得無生忍豈不能如龍女應物所好容起神變現身成佛及證圓經既證無生豈不能知本無捨受何妨捨此往彼補註云魔王梵王帝釋三人并女是四人皆不捨分段生身不受實報法性身悉於現身得成佛所言女者過去佛世彼時人民悉受女身一日一時即成佛道不捨身不受身也。",
        "translation": "The womb sūtra says that Māra, Brahmā, Śākyamuni, and the women all don't abandon their bodies and don't receive the body, and they all become buddhas in the present body.",
        "source": "X31n0607_004:0273c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△八時眾聞見得益二初正明見聞。",
        "translation": "△Eight times when multitudes heard and saw the benefits of the Buddha's body, the first was to directly explain what was seen and heard.",
        "source": "X31n0607_004:0274a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時娑婆世界菩薩聲聞(至)普為時會人天說法。",
        "translation": "At the time, the bodhisattvas and śrāvakas of the Saṃbha world (arrived) universally taught the Dharma to humans and gods at that time.",
        "source": "X31n0607_004:0274a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二人天歡喜。",
        "translation": "△Two gods rejoiced.",
        "source": "X31n0607_004:0274a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心大歡喜悉遙敬禮(至)發菩提心而得受記。",
        "translation": "Their hearts were overjoyed, and they all paid homage to him (to) arouse the mind of enlightenment and obtain assurance of future enlightenment.",
        "source": "X31n0607_004:0274a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無量眾生等彼土蒙益也娑婆世界等此土蒙益也南方緣熟宜以八相成道此土緣薄秖以龍女教化此是權巧之力得一身一切身普現色身三昧也不退義釋見序品。",
        "translation": "Measureless sentient beings and others in that land will be benefited, and those in the sahā world and others in this land will be benefited.",
        "source": "X31n0607_004:0274a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△九智積身子默受。",
        "translation": "△9. The bodhisattva Zhigatse and Śāriputra received it silently.",
        "source": "X31n0607_004:0274a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積菩薩及舍利弗一切眾會默然信受。",
        "translation": "Zhigye bodhisattva and Śāriputra all assembled together in silence and faith.",
        "source": "X31n0607_004:0274a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智積初未信受執別教為疑身子亦未信受挾三藏教為難今方知龍女依圓修行速疾成佛故與一切默然信受也。",
        "translation": "Zhizhe hadn't believed and accepted it at first, holding to a specific teaching as doubtful, and the body hadn't believed and accepted it, holding to the tripiṭaka teaching as difficult. Now, we've realized that the dragon-maiden relies on perfect cultivation and quickly becomes a buddha, so we all quietly believe and accept it.",
        "source": "X31n0607_004:0274a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經持品第十三",
        "translation": "Miaofa lianhua jing chi pin di xiii",
        "source": "X31n0607_004:0274a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二萬菩薩奉命弘經故名持品重勸八十萬億那由他菩薩弘經故名勸持品問何故爾二萬是法師品初別命之數故奉旨受持八十萬億那由他等前無別命止是通覓故今以佛眼視令其發誓此土通經通經證驗深重佛意殷勤是故蒙勸而弘故有二意也。",
        "translation": "Twenty thousand bodhisattvas are instructed to promote the sūtras and therefore are called the chapter of maintenance, and eighty thousand million nayutas are heavily encouraged to promote the sūtras and therefore are called the chapter of maintenance.",
        "source": "X31n0607_004:0274a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三持品明忍力成者此土弘經新得記者他土弘經二初明受持三初二萬菩薩奉命此土弘經。",
        "translation": "△Triple holding class clarifies the power of forbearance of those who have accomplished the sūtras in this land and have newly attained the ability to report on the sūtras in other lands.",
        "source": "X31n0607_004:0274b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時藥王菩薩摩訶薩(至)種種供養不惜身命。",
        "translation": "It was then that the Medicine King Bodhisattva Mahāsattva (arrived) made various offerings and didn't spare his life.",
        "source": "X31n0607_004:0274b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生善少眾生濁也多增上慢見濁也貪利供養煩惱濁也增不善根命濁也遠離解脫劫濁也若非深位菩薩忍力成就安能於此五濁惡世弘通此經耶。",
        "translation": "It's because sentient beings are good, few sentient beings are turbid, many are arrogant, views are turbid, greed for materialistic offerings, afflictions are turbid, unwholesome roots are life is turbid, and eons of liberation are turbid. If it weren't for the accomplishment of the power of forbearance of profoundly ranked bodhisattvas, how could they have propagated this sūtra in these five turbid and unwholesome times?",
        "source": "X31n0607_004:0274b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二諸大聲聞發誓他國流通。",
        "translation": "△Two great śrāvakas took a vow to circulate it in other countries.",
        "source": "X31n0607_004:0274b08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時眾中五百阿羅漢(至)瞋濁諂曲心不實故。",
        "translation": "At the time, there were 500 arhats in the crowd (to) be angry and flattering, so their minds weren't real.",
        "source": "X31n0607_004:0274b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此諸聲聞既得授記已登初住破無明惑得無生忍成大菩薩何故不能於此惡世通經答為引初心始行菩薩未能惡世苦行通經復欲發起如來開於安樂行品也妙樂云為引始行及開安樂行者始行見諸大德尚不能此土弘經況我等耶是故須下安樂行品為始行弘經之軌故文殊問云菩薩於後惡世云何能說是經。",
        "translation": "Q: Since these śrāvakas have been granted discipline, have ascended to the first abode, have broken through the delusion of ignorance, attained the acceptance of nonarising, and become great bodhisattvas, why couldn't they have disseminated the sūtras in this evil world? A: In order to guide the first-minded, first-track bodhisattvas who aren't able to carry out the ascetic practices of this evil world, and in order to motivate the Tathāgata to reveal the Chapter on the Conduct of Well-Being, Mañjuśrī asked how a bodhisattva could teach this sūtra in a later evil world.",
        "source": "X31n0607_004:0274b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三諸比丘尼請菩提記四初姨母請記二初請。",
        "translation": "△Three bhikṣuṇīs asked for a prediction of enlightenment, four first from their aunts, and two first.",
        "source": "X31n0607_004:0274b16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時佛姨母(至)瞻仰尊顏目不暫捨。",
        "translation": "It was then that the Buddha's aunt (to) looked up to the venerable face and didn't let go of her eyes for a moment.",
        "source": "X31n0607_004:0274b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波闍波提亦云憍曇彌此云眾主。",
        "translation": "Pāñcabodhi is also called Kauṇḍamī, which is the word for lord of the people.",
        "source": "X31n0607_004:0274b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二記。",
        "translation": "△Two responses.",
        "source": "X31n0607_004:0274b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於時世尊告憍曇彌(至)得阿耨多羅三藐三菩提。",
        "translation": "The Bhagavān then addressed Kauṇḍamī (to) attain unsurpassed, correct enlightenment.",
        "source": "X31n0607_004:0274b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我先總說一切聲聞皆已授記者即指五百弟子品偈云迦葉汝已知等一行半偈也。",
        "translation": "\"I first explained in a general way that all the śrāvakas have been given the title of reporter, which refers to the verse of the five hundred disciples class, saying, 'Kāśyapa, you've known this for a line and a half.'",
        "source": "X31n0607_004:0274b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二耶輸請記二初請。",
        "translation": "△Two Yahus are invited to remember the first two requests.",
        "source": "X31n0607_004:0274b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時羅睺羅母(至)世尊於授記中獨不說我名。",
        "translation": "It was then that Rāhula-mātṛ (to) the Bhagavān addressed the record without saying my name alone.",
        "source": "X31n0607_004:0274b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二記。",
        "translation": "△Two responses.",
        "source": "X31n0607_004:0274c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告耶輸陀羅(至)佛壽無量阿僧祇劫。",
        "translation": "The Buddha told Yaśodharā (to) that the Buddha's life span was countless incalculably long.",
        "source": "X31n0607_004:0274c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三諸尼領解。",
        "translation": "△Three nuns led the understanding.",
        "source": "X31n0607_004:0274c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時摩訶波闍波提(至)即於佛前而說偈言。",
        "translation": "It was then that Mahāprajāpatī (to) immediately went before the Buddha and spoke in verse, saying.",
        "source": "X31n0607_004:0274c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊導師安隱天人我等聞記心安具足。",
        "translation": "\"Bhagavān, you guide the peaceful gods and humans, and we hear and remember that our minds are replete.",
        "source": "X31n0607_004:0274c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四諸尼發願。",
        "translation": "△The four nuns made a vow.",
        "source": "X31n0607_004:0274c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸比丘尼說是偈已(至)於他方國廣宣此經。",
        "translation": "After speaking this verse, the monks and nuns (to) widely proclaimed this sūtra in other lands.",
        "source": "X31n0607_004:0274c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二明勸持二初長行五初明佛眼視。",
        "translation": "△Two explanations of exhortation and two preliminary long practices △First, he explained the vision of the Buddha's eye.",
        "source": "X31n0607_004:0274c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊視八十萬億那由他諸菩薩摩訶薩。",
        "translation": "The Bhagavān then looked at eighty trillion nayutas of bodhisattvas and mahāsattvas.",
        "source": "X31n0607_004:0274c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眼視默勸而不告言者上來雖不別命諸菩薩而如來已舉持經功德深厚引證分明又多寶分身遠來勸發此之殷勤事義已足有欲應命宜即發誓無煩復言又將護聲聞他方弘經之願故不稱揚此土弘經之事也。",
        "translation": "Although the Bhagavān did not separately order the bodhisattvas, the Tathāgata had already mentioned the profundity of the sūtras' merits, evidenced them clearly, and the branch body of Prabhūtaratna had come from afar to encourage and inspire them to undertake this endeavor, which was sufficient for those who wished to be ordered to do so.",
        "source": "X31n0607_004:0274c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二菩薩請告。",
        "translation": "△Two bodhisattvas asked to be told.",
        "source": "X31n0607_004:0274c14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是諸菩薩皆是阿惟越致(至)當如佛教廣宣斯法。",
        "translation": "\"These bodhisattvas are all nonretrogressors (to) the extent that they will proclaim this teaching in accordance with Buddhism.",
        "source": "X31n0607_004:0274c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿惟越致釋見譬喻品。",
        "translation": "Advaita Vedanta interprets the metaphorical chapter.",
        "source": "X31n0607_004:0274c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三明佛默然。",
        "translation": "△Three clearly stated that the Buddha was silent.",
        "source": "X31n0607_004:0274c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復作是念佛今默然不見告勅我當云何。",
        "translation": "Again, he had this thought: \"Now, the Buddha has been silent and hasn't told me what I should do.",
        "source": "X31n0607_004:0274c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四菩薩知意。",
        "translation": "△4. The bodhisattvas then knew what they wanted.",
        "source": "X31n0607_004:0274c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時諸菩薩敬順佛意并欲自滿本願。",
        "translation": "The bodhisattvas then respect and obey the Buddha's intention and want to fulfill their original vows.",
        "source": "X31n0607_004:0274c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五發誓通經。",
        "translation": "△Vocalizing the Vow Sutra.",
        "source": "X31n0607_004:0274c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "便於佛前作師子吼(至)在於他方遙見守護。",
        "translation": "\"They then made a lion's roar in front of the Buddha (to) guard it from a distance in another place.",
        "source": "X31n0607_004:0274c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二偈頌四初披衣弘經三初總論時節以明著衣。",
        "translation": "△Two verses and four hymns first clothed himself and then spread the sūtras.3 First, the sūtras summarize the time and season to explain the wearing of robes.",
        "source": "X31n0607_004:0274c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即時諸菩薩俱同發聲而說偈言。",
        "translation": "Right then, the bodhisattvas all spoke together in verse, saying.",
        "source": "X31n0607_004:0274c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惟願不為慮於佛滅度後恐怖惡世中我等當廣說。",
        "translation": "\"May it not be for fear that we'll explain it in detail in the terrible, evil world after the Buddha's passing away.",
        "source": "X31n0607_004:0275a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙樂云諸菩薩等請護弘經即是自述弘經方軌以由佛於法師品中說方軌竟寶塔品募覓用方軌人達多品引往用方軌者釋迦即是稟方軌眾故云以身為牀座等持品即是惡世方軌安樂行是始行方軌故云住忍辱地等若不爾者則弘經無軌無軌弘經斯無是處如赤身入陣自損不虗披鎧之言應不徒設。",
        "translation": "Miaoleyun, the bodhisattvas who asked to protect the sūtras were self-reporting the direction of the sūtras because the Buddha taught the direction of the Dharma teacher class, finished the section on the jeweled stūpa class, recruited people to use the directional regulations, and led them to the section on the directional regulations, which is why the Śākyamuni class uses his body as a seat and the equipoise class is the directional regulations of the bad world.",
        "source": "X31n0607_004:0275a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二別明所忍之境三初通明邪見之人。",
        "translation": "△Two Distinctly Explaining the Object of Forbearance Three First, it's generally explained about people with wrong views.",
        "source": "X31n0607_004:0275a08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有諸無智人惡口罵詈等及加刀杖者我等皆當忍。",
        "translation": "We will tolerate those who lack wisdom, who badmouth and ridicule, and who inflict swords and blows.",
        "source": "X31n0607_004:0275a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此下九行別明所忍之境今一行通明邪見之人即俗眾也。",
        "translation": "The next nine lines here separately specify the objects tolerated. The first line now specifies people with mistaken views, which are the common people.",
        "source": "X31n0607_004:0275a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二道門增上慢者。",
        "translation": "△Two paths lead to those who are arrogant.",
        "source": "X31n0607_004:0275a12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惡世中比丘邪智心諂曲未得謂為得我慢心充滿。",
        "translation": "In a bad world, a monk's mind of mistaken knowledge flatters and distorts what's not yet attained, which is called attaining a mind full of self-conceit.",
        "source": "X31n0607_004:0275a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三僭聖增上慢者。",
        "translation": "△Three arrogant, holy, and superior conceits.",
        "source": "X31n0607_004:0275a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或有阿練若衲衣在空閑(至)說外道論義。",
        "translation": "Perhaps there's an araṇya robe in a vacant (to) expound the meaning of a non-Buddhist treatise.",
        "source": "X31n0607_004:0275a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿練若或曰阿蘭若大論翻遠離處薩婆多論翻閑靜處或翻無諍坐禪三昧經云無諍者將護眾生不令起諍也羅什註淨名經云無諍有二一以三昧力將護眾生令不起諍心二隨順法性無違無諍妙樂引寶雲經云阿蘭若者不與世諍不近不遠便於乞食有樹陰多華果足淨水無難事不險阻易登陟獨無侶誦所聞凡居蘭若為調煩惱自舉蔑他非無諍行假名阿練若此舉其身業不善也好出我等過此舉其意業不善也而作如是言等此舉其口業不善也。",
        "translation": "*Anāthapiṇḍika, or Āraṇḍika, as the Mahāprajñāpāramitā translates it, is a place of quietude, or is a place of meditative concentration without disputation, as the sūtra says, \"Without disputation, one will guard sentient beings from disputation.\" The Rājñī commentary on the Pure Names says that there are two ways to be without disputation: one is to guard sentient beings with the power of samādhi so that they don't become critical; the other is to accord with the nature of things without contradicting the wondrous pleasure of being without disputation.",
        "source": "X31n0607_004:0275a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三總明著衣之意。",
        "translation": "△3. This is a general statement about the meaning of wearing robes.",
        "source": "X31n0607_004:0275b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我等敬佛故悉忍是諸惡(至)皆當忍受之。",
        "translation": "'We all tolerate these evils because we revere the Buddha.'",
        "source": "X31n0607_004:0275b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬佛忍惡此與常不輕意同箋難云為斯所輕言汝等皆是佛者罵法有二謂善惡也罵人為佛輕之甚矣。",
        "translation": "Honoring the Buddha and tolerating evil is the same as always not despising the meaning of the words of Mo Nang, which despise you all as buddhas.",
        "source": "X31n0607_004:0275b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濁劫惡世中多有諸恐怖(至)皆當忍是事。",
        "translation": "In the miserable world of the turbid eon, there are many fears, and this is something that all of us should endure.",
        "source": "X31n0607_004:0275b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忍辱鎧者鎧甲也中阿含第五云黑齒比丘訴佛云舍利弗罵我說我佛疾喚舍利弗實罵說否舍利弗言心不定者或說罵我心已定云何說罵如折角牛不觸嬈人如殘童子耻不惱彼(截其兩手不能害物)我心如地淨與不淨大小便利涕唾受而不罵心如掃箒淨不淨俱掃云何罵說於他佛問舍利弗如是惡人汝云何觀答人有五種一身善口意不善但念其善不念不善如納衣比丘見糞聚弊帛左捉右舒截棄不淨而取於淨念用其身淨以規身我棄其口意以誡我口意二口行淨身意不淨亦念用其口淨以規我口棄其身意以誡我身意三意行淨身口不淨亦念其意淨以規我意棄其身口以誡我身口四三業皆不淨者雖無可用當痛念之使得值善知識治其三業勿令墮苦五三業皆淨者常念是人以自訓況念齊願齊以去我惡此是三藏教中用苦無常不淨無我空為鎧也毗婆沙論云罵是一字一字不成罵二字成罵無有一時稱二字者若稱後字前字已滅又能罵所罵皆空於我何為此用通教空為鎧也又云凡聖俱有三受云何差別凡夫於若受則嗔於樂受則喜於不苦不樂受則癡聖人於苦受不瞋於樂受不愛於不苦不樂受不癡三使不能使於使得解脫故有凡聖之異如此等有無差降者此用別教為鎧也今經明鎧者以念佛為鎧是念法佛以第一義佛即是法故文云念佛告勅即法也佛即是僧僧即事理俱和毗盧遮那徧一切處如此之鎧一鎧一切鎧即圓教鎧也妙樂云念佛為鎧者觀受為法界故云是念法佛等也由能觀別得諸教名所觀三受其相不別故持經者應觀三受故云能忍諸惡行等輔行七上云一切行中瞋害尤甚故忍最難大論云如天帝問佛若行忍者唯有一事最不可耐小人輕慢謂為怖畏故不應忍佛言若以小人輕慢謂為怖畏欲不忍者不忍之罪甚於此也何以故不忍之人賢聖善人之所輕慢忍辱之人而為小人之所輕慢二輕之中寧取何輕故知寧為小人之所輕不為賢聖之所賤何以故無智之人輕於不可輕賢聖之人賤於所可賤為是義故彌須行忍。",
        "translation": "The armor of patience is also the armor of the fifth tradition of the Middle Agamas, in which the black-tongued monk complains to the Buddha, saying, \"Śāriputra scolds me and says 'I'.\" The Buddha quickly summons Śāriputra to tell him whether he actually scolds and says 'No.' Śāriputra says his mind is uncertain, or he might say he scolds me and his mind is already determined.",
        "source": "X31n0607_004:0275b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "△二入室弘經。",
        "translation": "△Two enter the room and spread the sūtras.",
        "source": "X31n0607_004:0275c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸聚落城邑其有求法者我皆到其所說佛所囑法。",
        "translation": "I'll go to every village or town that asks for the teaching and explain the teaching that the Buddha has instructed.",
        "source": "X31n0607_004:0275c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三坐座弘經。",
        "translation": "△3. Sitting in a seat, I teach the sūtras.",
        "source": "X31n0607_004:0275c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我是世尊使處眾無所畏我當善說法願佛安隱住。",
        "translation": "'I am the Bhagavān who causes crowds to be fearless, and I will well explain the teaching, hoping that the Buddha will stay in peace.'",
        "source": "X31n0607_004:0275c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四總結請知。",
        "translation": "△4. In summary, please know.",
        "source": "X31n0607_004:0275c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我於世尊前諸來十方佛發如是誓言佛自知我心。",
        "translation": "'Before the Bhagavān, I made this vow to the buddhas of the ten directions that the Buddha himself would know my mind.'",
        "source": "X31n0607_004:0276a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙法蓮華經科註卷第四",
        "translation": "*Saddharmapuṇḍarīka-sūtra, Vol. 4",
        "source": "X31n0607_004:0276a03_0",
        "is_bad_quality": false
    }
]