[
    {
        "source_sentence": "釋普門品重頌",
        "translation": "Śākyamuni's Commentary on the Universal Gate",
        "source": "X35n0646_001:0163c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋天竺寺沙門　遵式　述",
        "translation": "Song Dynasty Tianzhusi shaman Zunshi said",
        "source": "X35n0646_001:0163c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△第二重頌是隋煬大業中智者滅後笈多所譯方入大部故疏闕釋靈感傳天人語南山云什師八地菩薩譯法華闕觀音重頌既涉冥報信有此文今扶上二番問答隨文略釋固難盡理講者但令不失上文大途梗槩何必騁異此頌二十六行為二初一偈雙問二章次二十五偈雙答二問初問中一句歎。",
        "translation": "The second verse was translated by Jātaka after the extinction of the wise one in the great karma of the Yang dynasty in Sui, so the commentary is lacking in the interpretation of the Lingan transmission of the words of the gods and humans, and the translation of the Lotus by Yunshishi of the eighth ground by the bodhisattva Nanyan, which is believed to contain this text.",
        "source": "X35n0646_001:0163c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "德三句正問。",
        "translation": "In the first question, there's a phrase of praise, and in the third phrase, there's the main question.",
        "source": "X35n0646_001:0163c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊妙相具。",
        "translation": "\"The Bhagavān's marvelous attributes are complete.",
        "source": "X35n0646_001:0163c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一句之內名體合歎世尊名也所以略舉尊號則知上九竝為三世中尊歎之要也具相質也相妙而具妙是歎辭具謂三十二滿足又可妙即是好以八十種好嚴其相令妙好也復次名實俱歎法身名是妙名相為妙相上文云具相三十二以八十種好用莊嚴法身即此意也具此相好者即具二嚴能答我問故舉而歎也。",
        "translation": "In one phrase, the name and body of the Bhagavān are combined to praise the Bhagavān's name, so he briefly cites the name of the Bhagavān, knowing that the above nine are the essentials of praising the Bhagavān in the three times.",
        "source": "X35n0646_001:0163c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我今重問彼佛子何因緣名為觀世音。",
        "translation": "Now, I'd like to ask again what reason that Buddha's son has to be called Avalokitêśvara.",
        "source": "X35n0646_001:0163c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "正問中初句兼於二問文云重問即重問上二段之事孰謂不然次二句別問觀音欲佛先答初章就近更徵故也亦可三句併問初章自招後答既有真身冥益豈無應緣顯赴耶故許說中雙許二番謂聞名及見身是也。",
        "translation": "The first phrase of the main question is a combination of the two questions, and the text says, \"I'm repeating the question,\" meaning I'm repeating the question about the previous two phrases, which is not the case? The second two phrases ask separately about Avalokitêśvara, wanting the Buddha to answer first and then to further define it in the first chapter, or they can combine the three questions in the first chapter, inviting himself and then answering later.",
        "source": "X35n0646_001:0164a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△第二答中作三意初二偈總答二章次十九偈別答二章三四偈勸持名供養總答中初一偈正答次一偈依本觀慈悲。",
        "translation": "△In the second answer, three concepts are presented. First, two verses give a general answer to the two chapters, followed by nineteen verses that give a specific answer to the two chapters, and three or four verses that encourage the keeping of names and offerings.",
        "source": "X35n0646_001:0164a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具足妙相尊偈答無盡意汝聽觀音行善應諸方所弘誓深如海歷劫不思議侍多千億佛發大清淨願。",
        "translation": "The verse that answers the inexhaustible meaning of \"Avalokitêśvara's practice is well-applied in all directions, profound as the ocean, inconceivable through eons, serving hundreds of billions of buddhas, and giving rise to the great pure vow.",
        "source": "X35n0646_001:0164a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝聽觀音行是總答前章觀音即境智因緣得名善應諸方所是總答後段普門示現竝用上總意消之次一偈却尋本觀慈誓顯今智斷十番利益本依別圓無量無作四諦起於願行由誓境深廣故弘誓如海弘即廣也歷劫顯時久遠一一劫中侍多千億顯值復多一一佛所復發別願如四十八等一一願含法界故復云大也歷劫約豎侍多約橫一一豎中有橫一一橫中有所歷之時廣說(云云)將此總中本誓歷下別答一一難及普門後廣作可知。",
        "translation": "The first part of the Avalokitêśvara practice is the general answer, and the second part of the Samantabhadra manifestation is the general answer in which the general idea above is used to eliminate the second part of the verse but the original contemplation of the vow of compassion is reflected in the present wisdom that ends the tenfold benefits that originally relied on the distinct and perfect infinite and unconstructed four truths that arise from vowing to practice because of the profundity of the vowed object, the vast vow is as vast as the ocean.",
        "source": "X35n0646_001:0164a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△第二別答復二初一偈是雙許說二章。",
        "translation": "△The second answer is two more. First, the first verse is a dual-acceptance explanation of the two chapters.",
        "source": "X35n0646_001:0164a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我為汝略說聞名及見身心念不空過能滅諸有苦。",
        "translation": "\"I'll explain for you briefly how hearing names and seeing the body and mindfulness of nonemptyness can end the suffering of sentient beings.",
        "source": "X35n0646_001:0164a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聞名是許前章見身是許後章向誡聽今許說言略說者即別答也總答多含即文略而意廣別答陳列且約人界果報邊明七難等普門且約三十三身等即文廣而意略今取意略信是許別答也聞名聞觀世音境智名也上文約四種聞釋成三慧義觀兩全可解見身即普門示現顯應三業也心念不空者明二段應益也心念屬意不云身口者此從冥顯二機攝二章語便何者初章顯機若身若口俱須域意故意能總攝也故上釋持名云口為誦持心為秉持為理不失雖非口持覺觀是口行通屬口業機攝例如小彌陀執持名號一心不亂亦不妨口機下文皆云念彼觀音力例同此釋後段冥機約心為便可解不空者縱使稱名都無顯驗冥益不虗。",
        "translation": "Hearing the name is permitted, and seeing the body is permitted in the previous chapter, and in the latter chapter, we'll admonish you to listen to what's being said.",
        "source": "X35n0646_001:0164a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△第二十八偈正答又二初十三偈頌初章次五偈頌後章初又二初十二偈明口業機應次一行略頌身意二種機應上文七難表六大種而云假令多舉諸難亦是表此今偈加推墮二山惡獸蛇蠍此四皆識種攝毒藥從人及蟲鬼識種攝從塵體地種攝雨雹水種攝又合羅剎鬼難加六成十二難初一偈火難。",
        "translation": "The first 13 verses are devoted to the first chapter, followed by five verses devoted to the second chapter. The first two are devoted to the first 12 verses, which explain the response of the oral function, followed by one line, which briefly praises the two responses of body and mind. The seven difficulties in the above section represent the six elements, and the saying that even if we repeatedly raise these difficulties, it would also represent this.",
        "source": "X35n0646_001:0164b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假使興害意推落大火坑念彼觀音力火坑變成池。",
        "translation": "Suppose he has harmful thoughts and pushes down a huge fire pit, remembering the power of Avalokitêśvara as the fire pit turns into a pond.",
        "source": "X35n0646_001:0164b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上文例作三科釋貼文事證觀解於觀中初廣約十番遭苦稱名成機致感次約別圓二種本住法門及慈悲誓願顯前十界圓益今但略作貼文一釋餘可準上不復備敘講者應具示其意使義觀不壅有益來者言大火坑者上直云大火此加之以坑大而更深意顯聖力火無淺小皆能成難況乎大坑設使劫火從地獄至初禪如此大坑滿中紅焰菩薩亦能或以吹滅或以口噏或復手遮令其不燒或作涼池。",
        "translation": "The preceding example makes three interpretations of the pasted text, the actual facts, the realization, and the contemplation. In the contemplation, the first is a broad overview of the ten kinds of suffering that are encountered, the names that are given, the abilities that are created, and the second is a description of the two kinds of originally abiding dharmas and the vow of compassion that reveals the complete benefit of the prior ten realms.",
        "source": "X35n0646_001:0164b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△次一偈水難。",
        "translation": "△The next verse is \"Water Trouble.",
        "source": "X35n0646_001:0164c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或漂流巨海龍魚諸鬼難念彼觀音力波浪不能沒。",
        "translation": "It might be a huge ocean adrift with dragons and fish, and it's difficult for ghosts to remember the power of Avalokitêśvara that can't be sunken by waves.",
        "source": "X35n0646_001:0164c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上得淺處即能免難若加龍鬼淺亦可畏故值死緣多重於上文彌彰聖應爾。",
        "translation": "If the above were to reach a shallow place, it would be possible to avoid the difficulty, and if dragons and ghosts were added, they could be feared as worthy of death.",
        "source": "X35n0646_001:0164c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△次一偈墮須彌難。",
        "translation": "△The next verse is \"Fall into the difficulty of Sumeru.",
        "source": "X35n0646_001:0164c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或在須彌峰為人所推墮念彼觀音力如日虗空住。",
        "translation": "Perhaps he's pushed down by someone at Sumeru Peak and remembers the power of Avalokitêśvara as the sun stands in space.",
        "source": "X35n0646_001:0164c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如日住空顯聖力難思然但是假設何人能到復被推等設有此事聖無不為頂生人王能上妙高因貪帝位還降人間若能稱名必有免理。",
        "translation": "While it's difficult to fathom the power of a sage standing like the sun in space, suppose someone were to reach it and then be pushed, etc. There's nothing noble about this that wouldn't make a person at the top a king who rises to a marvelous height and descends to earth because of greed for the emperor's position.",
        "source": "X35n0646_001:0164c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△四一偈墮金山難。",
        "translation": "△Tetragram 1: \"It's difficult to fall into the gold mountain.",
        "source": "X35n0646_001:0164c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或被惡人逐墮落金剛山念彼觀音力不能損一毛。",
        "translation": "He might be chased by a bad person and fall down Vajragiri, remembering that Avalokitêśvara's power couldn't harm a single hair.",
        "source": "X35n0646_001:0164c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△五一偈怨賊難。",
        "translation": "△V.1. It's difficult to resent a thief.",
        "source": "X35n0646_001:0164c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或值怨賊繞各執刀加害念彼觀音力咸即起慈心。",
        "translation": "If he's surrounded by enemies and thieves, each wields a sword to inflict harm, mindful of Avalokitêśvara's power, he immediately arouses compassion.",
        "source": "X35n0646_001:0164c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△六一偈王難。",
        "translation": "△Śāriputra: \"Six-one verse: The king is in trouble.",
        "source": "X35n0646_001:0164c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或遭王難苦臨刑欲壽終念彼觀音力刀尋段段壞。",
        "translation": "If he's faced with the king's calamity or suffering and is about to reach the end of his life, he'll remember the power of Avalokitêśvara's sword and find it broken piece by piece.",
        "source": "X35n0646_001:0164c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△七一偈枷鎻難。",
        "translation": "△7.1 Verses on the Difficulty of Being Chained.",
        "source": "X35n0646_001:0164c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或囚禁枷鎖手足被杻械念彼觀音力釋然得解脫。",
        "translation": "If he's imprisoned, shackled, or hand and foot handcuffed, mindful of Avalokitêśvara's power, he'll be freed.",
        "source": "X35n0646_001:0164c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△八一偈毒藥難。",
        "translation": "△Eight-one verse: \"Poison\" is a difficult word.",
        "source": "X35n0646_001:0164c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "呪詛諸毒藥所欲害身者念彼觀音力還著於本人。",
        "translation": "A spell that curses poisons that are intended to harm the body remembers the power of Avalokitêśvara to return to the person.",
        "source": "X35n0646_001:0164c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大慈等愛理合均除而還著本人者被害稱名機成須救能害無機惡心自尅非聖使然又毒藥有鬼須得著人若不殺他必須自害問若惡心自尅怨賊何故但令起慈答賊害事顯但令起慈即彰聖力毒藥陰謀反害方驗然賊亦有自害如東林老僧為賊所斬賊反以釰自刺心入背出羣黨奔迸又毒藥未必例皆還著有作折攝二用釋者若二俱有機則可然若能害者無冥顯二機折亦徒施。",
        "translation": "The principle of great kindness and other loves are equally removed, but those who return to their bodies are harmed by what's called an opportunity that becomes necessary to rescue those who can harm those who don't have an opportunity and whose evil intentions are self-inflicted, not caused by sages.",
        "source": "X35n0646_001:0165a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△九一偈羅剎鬼難。",
        "translation": "△9.1 A verse says, \"It's difficult for a Rāṣṭrapāla demon.",
        "source": "X35n0646_001:0165a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或遇惡羅剎毒龍諸鬼等念彼觀音力時悉不敢害。",
        "translation": "When they encounter a malevolent rāṣṭrapāla or poisonous dragon, the ghosts don't dare to harm them when they remember the power of Avalokitêśvara.",
        "source": "X35n0646_001:0165a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然兼毒龍前有魚龍及鬼此重言者龍鬼通水陸前但在水也上文四種龍等(云云)。",
        "translation": "However, when it comes to poisonous dragons, there are fish, dragons, and ghosts in front of them, and this repeats the saying that dragons and ghosts are connected to water and land, but they're in water as well.",
        "source": "X35n0646_001:0165a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△十一偈惡獸難。",
        "translation": "△11 verses: \"It's difficult to escape from a dangerous animal.",
        "source": "X35n0646_001:0165a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若惡獸圍繞利牙爪可怖念彼觀音力疾走無邊方。",
        "translation": "If a dangerous animal surrounds him with sharp teeth and nails that are frightening, remember the power of Avalokitêśvara and run quickly in limitless directions.",
        "source": "X35n0646_001:0165a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△十一一偈蛇蠍難。",
        "translation": "△Eleven verses on the difficulty of snakes and scorpions.",
        "source": "X35n0646_001:0165a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蚖蛇及蝮蠍氣毒烟火然念彼觀音力尋聲自迴去。",
        "translation": "When snakes and vipers and scorpions are overcome by poisonous smoke and fire, mindful of Avalokitêśvara's power, they turn away on their own after discerning the sound.",
        "source": "X35n0646_001:0165a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△十二一偈雨雹難。",
        "translation": "△12.1 A verse on the difficulty of rain and hail.",
        "source": "X35n0646_001:0165a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雲雷鼓掣電降雹澍大雨念彼觀音力應時得消散。",
        "translation": "When clouds of thunder, drums, lightning, and rain fall, mindful of Avalokitêśvara's power, they'll dissipate at the right time.",
        "source": "X35n0646_001:0165a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲益觀行者應巧約惡業煩惱作蛇虎等法門釋之使順道理若準請觀音疏作三義明消伏力用謂約事約行約理對此中果報煩惱及所住法門會之亦應可解口業機應竟。",
        "translation": "Those who want to benefit the practice of Avalokitêśvara should skillfully explain it in terms of the afflictions of bad karma as serpents and tigers and other dharmas so that it follows the truth.",
        "source": "X35n0646_001:0165a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△第二一偈總頌身意二種機應。",
        "translation": "△The second verse summarizes the two kinds of rewards for body and mind.",
        "source": "X35n0646_001:0165a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生被困厄無量苦逼身觀音妙智力能救世間苦。",
        "translation": "\"When sentient beings are beset by trouble and limitless suffering, the Avalokitêśvara's marvelous power of knowledge can save them from worldly suffering.",
        "source": "X35n0646_001:0165b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三毒猛盛心不自在名之困厄四類同棲各說所苦鴿說婬為最苦蛇說瞋為最苦(云云)女無子苦如上說或分二句對意對身細作可了若作觀解十番為三毒所困及約界外作順逆法門應釋應用上文意消三毒義身業無子無修因男女乃至無圓頓男女尋上文消之若心念身禮二業成機斷除三毒根滿足二莊嚴永拔十界三土世間之苦故云觀音妙智力能救世間苦亦應更明別圓本觀慈悲(云云)。",
        "translation": "The three poisons are so intense that the mind isn't at ease with them, and they're called distress. The four kinds of people living together are each described as suffering. The pigeon describes lust as the most painful, and the snake describes anger as the most painful.",
        "source": "X35n0646_001:0165b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△第二五偈別答普門示現此中文狹望上別文此仍成總又為三初二偈頌普現次二偈頌本觀三一偈結成聖者三業初又二初一偈直頌普現二一偈別舉所化三種法界。",
        "translation": "The second five verses answer the question, \"Does the universal approach reveal itself?\" The first two verses praise the universal approach, the second two verses praise the original contemplation, and the third one concludes with the three activities of the noble ones.",
        "source": "X35n0646_001:0165b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具足神通力廣修智方便十方諸國土無剎不現身種種諸惡趣地獄鬼畜生生老病死苦以漸悉令滅。",
        "translation": "Possessing the power of supernormal cognition, he cultivates extensive knowledge and skillful means, and there are lands in the ten directions where there are no bases that don't reveal themselves, and he gradually brings about the complete cessation of the suffering of birth, old age, illness, death, and other unwholesome destinies, hells, ghosts, and animals.",
        "source": "X35n0646_001:0165b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上文列聖身至金剛神闕地獄界此中舉劣況勝成互出耳一一身說約四句如前又上文約三土為所應此十方當約三土釋十方(云云)。",
        "translation": "The above section lists the holy body up to the hell realm of the vajra gods, where the inferior and superior situations are cited as mutually exclusive, and the one body is explained in about four sentences as before.",
        "source": "X35n0646_001:0165b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△次二偈本觀又二初偈行願次偈觀成普益初又三二句辨觀一句慈誓一句誡歸向。",
        "translation": "△Then there are two verses on the original contemplation and two first verses on the practice and vow, and the second verse on the completion of the universal benefit.",
        "source": "X35n0646_001:0165b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真觀清淨觀廣大智慧觀悲觀及慈觀常願常瞻仰。",
        "translation": "The true contemplation of purity, vast wisdom, contemplation of compassion, and contemplation of kindness are always desired and always looked up to.",
        "source": "X35n0646_001:0165b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真觀了空成一切智清淨觀出假處有無染成道種智廣大智慧即中道觀徧於諸法名廣勝出二邊名大中道體即智慧觀此體故名智慧觀問何以智慧名中體耶答順此經意此經以寂照合法身為體感應為宗得作此說三智實在一心中得不可一異悲觀等者誓願通稱為觀緣諦發故如止觀十法通名為觀。",
        "translation": "True contemplation of emptiness becomes omniscience, pure contemplation of what's provisional, where there's noncontamination, and the knowledge of the path's seeds, vast wisdom, which is the middle way, is the contemplation that pervades all dharmas and is called vastly superior, which transcends the two extremes and is called the great middle way, and the essence, which is wisdom, is called wisdom and contemplation.",
        "source": "X35n0646_001:0165b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△次偈辯益又二。",
        "translation": "△There are two further benefits of the next verse's explanation.",
        "source": "X35n0646_001:0165c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無垢清淨光慧日破諸闇能伏災風火普明照世間。",
        "translation": "\"The unblemished, pure light of wisdom that shatters darkness and quells calamity, wind, and fire universally illuminates the world.",
        "source": "X35n0646_001:0165c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上二句明智光次二句慈光破暗照世(云云)。",
        "translation": "The first two phrases are wise and luminous, and the second phrase is compassionate and luminous, which destroys darkness and illuminates the world (cloud).",
        "source": "X35n0646_001:0165c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△三一偈結成聖者三業顯應。",
        "translation": "△Three verses in one conclude with the three activities of the noble ones being revealed and associated.",
        "source": "X35n0646_001:0165c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "悲體戒雷震慈意妙大雲澍甘露法雨滅除煩惱燄。",
        "translation": "The thunder of the essence of compassion and morality shakes the marvelous great cloud of kindness and mind, and the nectar and Dharma rain extinguishes the flame of affliction.",
        "source": "X35n0646_001:0165c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒雷對身業慈雲對意業澍雨對口業戒檢七支身業為便戒淨能拔三惡之苦故名悲體身輪現通駭動羣情復如雷震內心愛念名慈普覆一切如雲無謀而應逗會不差復名為妙意業也口輪演實相之法為甘露雨三草二木平等蒙潤三惑熱惱為之清涼廣釋三無緣三不護等如上文一一應跡一一說法皆須明別圓菩薩所住法門方有事用釋普門一番竟。",
        "translation": "The thunder of precepts opposes physical actions, the cloud of kindness opposes mental actions, the rain of water opposes verbal actions, and the seven limbs of physical actions are purified by the precepts, which remove the suffering of the three evils and are therefore called the essence of compassion. The body chakra's manifestation penetrates, shocks, and moves sentient beings, and it's like a thunderclap that shakes internal mindfulness and is called kindness that covers all things like a cloud that responds without plotting and teases, and it's also called marvelous mental actions.",
        "source": "X35n0646_001:0165c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△第三四偈勸持供養又為二初二行一句勸持二一行三句勸供養初又二初一行重舉前口業機應以為勸由。",
        "translation": "The third four verses of the exhortation to maintain offerings are divided into two: the first two lines of the exhortation to maintain, the second line of the exhortation to make offerings, and the first two lines of the exhortation to make offerings, which are based on the first line reintroducing the previous opportunity for verbal action.",
        "source": "X35n0646_001:0165c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諍訟經官處怖畏軍陣中念彼觀音力眾怨悉退散。",
        "translation": "When the dispute goes through the officials, the fearful army is present, and he recalls the power of Avalokitêśvara, the many enemies are all dispersed.",
        "source": "X35n0646_001:0165c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由前口業居初舉一攝二所以特舉官訟軍陣者水火難稀鬼虎事寡運衰方值諍訟事眾世之諍本財色田宅日用有之勸持則要也刀杖幽執有過方遭軍陣王役事非由己又捔力相持自刃森目刀杖案籍賖死之難賊奪有財非如師旅斯亦勸之要也。",
        "translation": "From the previous verbal action in the first place, we'll mention one, and then we'll gather two. That's why we're specifically mentioning the official litigation in the military encampment because water and fire are hard to come by, ghosts and tigers are scarce, and luck is bad when it comes to disputes and litigation in the world over property, form, land, housing, and daily use.",
        "source": "X35n0646_001:0165c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△次一行一句正勸又二初三句約權實格量次二句結勸。",
        "translation": "△The next line is a correct exhortation, and there are two more. The first three lines are about expedient and real measurement, and the second two lines are a concluding exhortation.",
        "source": "X35n0646_001:0166a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙音觀世音梵音海潮音勝彼世間音。",
        "translation": "\"The wonderful voice of Avalokitêśvara, the Brahma voice, and the ocean-tide voice are superior to their worldly voices.",
        "source": "X35n0646_001:0166a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先舉菩薩實證實益為格量本勝彼九界權乘慈智故云勝世間音秖音塵一法以實智佛眼觀之即實諦妙音權智法眼觀之即俗諦世音此實證也緣中道修慈名為梵音此慈能與機會名海潮音譬不失度此實益也與夫九界生法二慈作意應物豈復為類故云勝彼格量明矣。",
        "translation": "First, he cites the bodhisattva's actual realization of real benefit as the measure of that which is superior to the compassionate wisdom of the right vehicle in the nine realms, so he says, \"Superior to worldly sounds.\" He simply observes the single particle of sound as the real truth with the Buddha's eye of real wisdom, which is the marvelous sound of the real truth with the Dharma eye of right wisdom, which is the worldly sound of the conventional truth.",
        "source": "X35n0646_001:0166a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△二句結勸。",
        "translation": "△Two concluding words of advice.",
        "source": "X35n0646_001:0166a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故須常念念念勿生疑。",
        "translation": "\"Therefore, always be mindful, and don't have doubts.",
        "source": "X35n0646_001:0166a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初勸常念有事理二行(云云)若事理行成自見菩薩色法二身故一句復止疑勸也。",
        "translation": "The first exhortation is to always be mindful of the twofold practice of principle and phenomena (cloud), and if the practice of principle and phenomena becomes the bodhisattva's own view of the two bodies of form and dharma, then the first sentence further exhorts to stop doubts.",
        "source": "X35n0646_001:0166a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△次一行三句勸供養初一句歎。",
        "translation": "△The next line of three exhortations to make offerings begins with a phrase of praise.",
        "source": "X35n0646_001:0166a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀世音淨聖。",
        "translation": "\"Avalokitêśvara is pure and holy.",
        "source": "X35n0646_001:0166a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩清淨三業從正命生故云淨聖言其堪受供養也正命是聖法人稟此法名人為聖故云觀音淨聖次別別舉德以為勸由。",
        "translation": "The bodhisattva's pure three activities arise from right livelihood, so it's called pure and noble. Right livelihood is the holy person who's endowed with this Dharma celebrity as a saint, so it's called Avalokitêśvara pure and noble, and then it's a reason to discriminate and cite virtues for encouragement.",
        "source": "X35n0646_001:0166a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△於苦惱下二句頌上施無畏德。",
        "translation": "△In the two verses below Suffering and Distress, we'll praise the virtue of the generosity and fearlessness of the above.",
        "source": "X35n0646_001:0166a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於苦惱死厄能為作依怙。",
        "translation": "They're able to provide support in times of suffering, distress, death, and trouble.",
        "source": "X35n0646_001:0166a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦惱死厄怖畏處也作依怙無畏力也如幼子恃怙父母更何所畏即指前現權實身說為父母護三乘子免二死厄。",
        "translation": "It's a place of fear in the face of suffering, distress, death, and adversity, and it's a source of reliance and fearlessness, like a young child relying on his father and mother, so what's there to fear? That means referring to the previous manifestation of the expedient and real body, it's said to be a parent protecting the son of the three vehicles from the hardships of two deaths.",
        "source": "X35n0646_001:0166b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "△具一切下四句舉福田勸。",
        "translation": "The next four phrases below \"endowed with all ...\" cite the field of merit and encourage them.",
        "source": "X35n0646_001:0166b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具一切功德慈眼視眾生福聚海無量是故應頂禮。",
        "translation": "'Possessing all merits, the compassionate eye sees the incalculable ocean of merit that accumulates in sentient beings; therefore, you should pay homage.'",
        "source": "X35n0646_001:0166b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具一切功德舉菩薩報身敬由慈眼視眾生舉應身恩田福聚海無量總歎二田高出如山之謂聚深廣無際之謂海亦是二田所依歎法身也頂禮正勸以三業供養也身儀事顯故特舉之必具三業上文脫瓔珞望今乃互舉耳又此勸事普一切皆得供養百金之瓔孰人可辨又能嚴尚貴所嚴豈復輕耶觀心者身業勤則增長福德供養應身口業動則說般若供養報身意業勤則會理供養法身(云云)釋偈竟。",
        "translation": "Being endowed with all merits, he praises the bodhisattva's reward body, honors the compassionate eye that looks at sentient beings, and praises the response body, the field of merit, the reservoir of blessings, and the limitless ocean that is the basis of both fields. He also prostrates himself in praise of the Dharma body, which is an exhortation to make offerings based on the three karmic activities.",
        "source": "X35n0646_001:0166b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋普門品重頌(終)",
        "translation": "He explained the repeated verses of the Samanta-mukha-parivar (end).",
        "source": "X35n0646_001:0166b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋慈雲尊者疏別行重頌附大部入藏而南方教苑不傳幾二百年矣至元甲午為教門入京於燕城弘法寺得之東歸猶至實然不敢自祕遂鋟諸梓以惠來學大德。",
        "translation": "Song Jijyun zunzhe shou biexing chongs appended to the great part of the canon and entered the collection, but it had not been transmitted for several 200 years since the Jiawu period of the first millennium when he entered the capital for the teaching and obtained it at the Hongfa Temple in Yancheng.",
        "source": "X35n0646_001:0166b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壬寅夏五興元住山苾芻性澄謹題",
        "translation": "This is the title of a book by the bhikṣu of Wuxing Yuanzhu Shan in the summer of nonin.",
        "source": "X35n0646_001:0166b23_1",
        "is_bad_quality": false
    }
]