[
    {
        "source_sentence": "南本大般涅槃經會疏卷第十二",
        "translation": "Southern Edition of the Nirvana Sutra: A Commentary, Volume XII",
        "source": "X36n0659_012:0516b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般涅槃經聖行品中(卷第十二)",
        "translation": "Gaṇḍavyūhasūtra (Vol. 12)",
        "source": "X36n0659_012:0516b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "北凉　天竺三藏　曇無讖　譯",
        "translation": "Northern Liang Dynasty, India, Tripiṭaka, translated by Dharmakṣema",
        "source": "X36n0659_012:0516b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "晉　沙門　慧嚴　慧觀",
        "translation": "Jin Śrāmaṇer Huiyan Huiguan",
        "source": "X36n0659_012:0516b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　謝靈運　重治",
        "translation": "Xie Lingyun 重治",
        "source": "X36n0659_012:0516b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖行品中",
        "translation": "in the category of holy practices",
        "source": "X36n0659_012:0516b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "起卷廣明集諦文為三初明集諦二會通三料簡初又三一標名二釋體三明是非初標名二先牒章門。",
        "translation": "The text of the beginning scroll extensively explains the truth of arising, which is divided into three categories: first, it explains the truth of arising, second, it's shared, and third, it's summarized.",
        "source": "X36n0659_012:0516b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何菩薩摩訶薩住於大乘大般涅槃觀察集諦。",
        "translation": "\"Good sons, how does the bodhisattva Mahāsattva abide in the great vehicle great parinirvāṇa and contemplate the truth of the collection?",
        "source": "X36n0659_012:0516b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩觀此集諦是陰因緣。",
        "translation": "Good sons, the bodhisattvas, the mahāsattvas, observe that this truth of arising is the cause and condition of the aggregates.",
        "source": "X36n0659_012:0516b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋云集因能得陰果故言是陰因緣。",
        "translation": "The next explanation says that the cause of the truth of arising can lead to the result of aggregates, so it's called the cause and condition of aggregates.",
        "source": "X36n0659_012:0516b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂集者下二釋體昔教以業煩惱為集煩惱之中具足十使今但言煩惱不明於業本是煩惱煩惱潤業於煩惱中偏說貪愛愛是繫地之惑潤業故生死華嚴云無業無煩惱苦諦無所住無明無所行平等行世間又十二因緣不生不滅是為平等乃名集諦若十二因緣生滅是集非諦此中有七番一明集因於果已起即是五陰成辦於愛還愛此有是愛陰身。",
        "translation": "The next two explanations of the essence of what's called the aggregate were based on the former teaching that karmic afflictions were the aggregate and that the ten causes were fully present in afflictions. Now, we only talk about afflictions because we don't understand that karma is originally an affliction and that afflictions nourish karma.",
        "source": "X36n0659_012:0516b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂集者還愛於有。",
        "translation": "This is called the aggregate that returns to loving existence.",
        "source": "X36n0659_012:0516b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次愛有二種下是明二種愛。",
        "translation": "Second, there are two kinds of craving, and the following is an explanation of the two kinds of craving.",
        "source": "X36n0659_012:0516b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛有二種一愛己身二愛所須。",
        "translation": "There are two kinds of love: one that loves oneself and two that love what's necessary.",
        "source": "X36n0659_012:0516c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "己身是我所須是所。",
        "translation": "His own body is self, and what's needed is what's there.",
        "source": "X36n0659_012:0516c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三二種愛欲得已得。",
        "translation": "The three two kinds of craving are desires attained and acquired.",
        "source": "X36n0659_012:0516c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有二種未得五欲繫心專求既求得已堪忍專著。",
        "translation": "There are two more kinds that haven't yet been attained, the five desires that bind the mind and concentrate on seeking, and then they've been sought and attained, and they can tolerate and concentrate on them.",
        "source": "X36n0659_012:0516c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四即三界愛。",
        "translation": "The fourth is craving for the three realms.",
        "source": "X36n0659_012:0516c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三種欲愛色愛無色愛。",
        "translation": "There are three more desires, cravings, form, and formless cravings.",
        "source": "X36n0659_012:0516c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五三種。",
        "translation": "There are five kinds of the three kinds.",
        "source": "X36n0659_012:0516c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有三種業因緣愛煩惱因緣愛苦因緣愛。",
        "translation": "There are three more kinds of karmic causal love, afflictive causal love, and painful causal love.",
        "source": "X36n0659_012:0516c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂業因緣愛以報因故感此苦果如鴿雀多欲皆先舉果次言煩惱因緣愛者以習因故生愛可見次苦因緣愛為脫重苦於輕苦生愛如畏死苦而苦治令差然針灸實苦因此得差即便生愛。",
        "translation": "This refers to karmic causal love that brings about this painful result as a result of retribution. e.g., a pigeon or a bird with many desires first raises the result, and then it's called afflictive causal love that creates craving as a result of habituation.",
        "source": "X36n0659_012:0516c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六復有四愛即是四事。",
        "translation": "Six, \"Again, there are four kinds of craving, which are four things.",
        "source": "X36n0659_012:0516c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出家之人有四種愛何等為四衣服飲食臥具湯藥。",
        "translation": "A renunciant has four kinds of craving, which are four things like clothing, food, bedding, bedclothes, and medicine.",
        "source": "X36n0659_012:0516c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七復有五種愛即是五陰。",
        "translation": "Seven, there are five more kinds of cravings, which are the five aggregates.",
        "source": "X36n0659_012:0516c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復有五種貪著五陰隨諸所須一切愛著分別校計無量無邊。",
        "translation": "There are another five kinds of craving for the five aggregates, and whatever they need, they're craving, discriminating, and calculating them in measureless and limitless ways.",
        "source": "X36n0659_012:0516c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子愛有二種下第三明是非。",
        "translation": "\"Good sons, there are two kinds of craving, and the third below explains right and wrong.",
        "source": "X36n0659_012:0516c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子愛有二種一者善愛二不善愛。",
        "translation": "\"Good sons, there are two kinds of craving: one is good craving and the other is unskillful craving.",
        "source": "X36n0659_012:0517a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不善愛則是集若善愛則非集。",
        "translation": "If they're unwholesome, then they're collected; if they're wholesome, then they're not collected.",
        "source": "X36n0659_012:0517a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中復三番料簡初將聖對凡簡。",
        "translation": "There are three more ways to define it, beginning with the noble and the mundane.",
        "source": "X36n0659_012:0517a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不善愛者凡愚之求善法愛者諸菩薩求。",
        "translation": "Unwholesome love is the pursuit of worldlings and fools, and wholesome love is the pursuit of bodhisattvas.",
        "source": "X36n0659_012:0517a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次舉菩薩對二乘簡。",
        "translation": "Next, he presents bodhisattvas to the two vehicles in brief.",
        "source": "X36n0659_012:0517a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善法愛者復有二種不善與善求二乘者名為不善求大乘者是名為善。",
        "translation": "'Again, there are two kinds of lovers of good qualities, those who are unskillful and those who are good and seek the two vehicles are called unskillful.' Those who seek the great vehicle are called good.",
        "source": "X36n0659_012:0517a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三諦非諦簡。",
        "translation": "The three truths are not truths in brief.",
        "source": "X36n0659_012:0517a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子凡夫愛者名之為集不名為諦菩薩愛者名之實諦不名為集何以故為度眾生所以受生不以愛故而受生也。",
        "translation": "Good sons, ordinary people's craving is called the set, not the truth. Bodhisattvas' craving is called the real truth, not the set. Why is it for the purpose of liberating sentient beings so they'll be born and not because of craving?",
        "source": "X36n0659_012:0517a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故云凡夫愛名為集不名為諦菩薩愛者名為實諦不名為集菩薩愛者名為實諦不名集者取其解智故名為諦凡夫不爾故但名集若例此義俗亦非諦若望解了則得名諦若復隨情則稱於俗迦葉白佛下第二會通昔說業惑為集今云何獨說愛為苦因先問次答問中先引四經次正結難。",
        "translation": "Therefore, it's called worldly love that's called the set and not the truth. Bodhisattva love is called the real truth and not the set. Bodhisattva love is called the real truth and not the set because it's taken from their understanding and knowledge and therefore called the truth.",
        "source": "X36n0659_012:0517a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉菩薩白佛言世尊如佛世尊於餘經中為諸眾生說業為因緣或說憍慢或說六觸或說無明為五盛陰而作因緣。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, just as the Buddha did, the Bhagavān taught for sentient beings in other sūtras that karma is a cause and condition, or he taught about conceit, or he taught about the six contacts, or he taught that ignorance is a cause and condition for the five proliferating aggregates.",
        "source": "X36n0659_012:0517a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初引經中言六觸者即是六識取塵而有觸對此亦是集緣此識心得來世果如四識住處為五盛陰。",
        "translation": "The first quote from the sutra says that the six tactile sensations are the six consciousnesses that grasp dust and have contact with it.",
        "source": "X36n0659_012:0517a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今以何義下正結難。",
        "translation": "What's the meaning of this?\" He then correctly concludes his question.",
        "source": "X36n0659_012:0517a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今以何義說四聖諦獨以愛性為五陰因。",
        "translation": "What does it mean to say that the four noble truths have the nature of craving alone as the cause of the five aggregates?",
        "source": "X36n0659_012:0517a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次佛答中又二先歎其問次正答初如文。",
        "translation": "Next, the Buddha answers the question in two ways, first by praising his question, and then by correctly answering it.",
        "source": "X36n0659_012:0517b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛讚迦葉善哉善哉。",
        "translation": "\"The Buddha praised Kāśyapa, 'Good, good!'",
        "source": "X36n0659_012:0517b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次正答中意云昔教今教兩不相違是故今日說愛是陰界本就今教又二初明愛是根本二明愛之過患根本又二謂法說次譬說。",
        "translation": "In the second correct answer, he said, \"The teachings of the past and present don't contradict each other. Therefore, today's teaching that love is the original cause of the aggregates is based on the present teaching, and there are two more.",
        "source": "X36n0659_012:0517b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如汝所說諸因緣者非為非因但是五陰要因於愛。",
        "translation": "\"Good sons, as you say, these causes and conditions are not causes or non-causes, but the five aggregates are the primary cause of love.",
        "source": "X36n0659_012:0517b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子譬如大王若出遊巡大臣眷屬悉皆隨從愛亦如是隨愛行處是諸結等亦復隨行譬如膩衣隨有塵著著則隨住愛亦如是隨所愛處業結亦住復次善男子譬如溼地則能生牙愛亦如是能生一切業煩惱牙。",
        "translation": "Good sons, for example, if the king travels around, his ministers and their retinues all follow him, and so it is when he follows his craving, these bonds also follow.",
        "source": "X36n0659_012:0517b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡三譬謂大王膩衣溼地皆如文。",
        "translation": "The three metaphors, namely, the great king's oily clothes and wet ground, are all as explained in the text.",
        "source": "X36n0659_012:0517b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩下第二明愛過患又二先標列九章門後一一廣釋。",
        "translation": "Good sons, bodhisattvas, second, they explain the faults and problems of craving in two ways, first by listing the nine categories and then by explaining them in detail.",
        "source": "X36n0659_012:0517b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩住是大乘大般涅槃深觀此愛凡有九種一如責有餘二如羅剎女婦三如妙華莖有毒蛇四如惡食性所不便而強食之五如婬女六如摩樓迦子七如瘡中瘜肉八如暴風九如彗星。",
        "translation": "\"Good sons, the bodhisattva Mahāsattva abides in this great vehicle, great parinirvāṇa, and deeply observes that there are nine kinds of this kind of love: one that's blaming the other, two that's like a Rāṣṭrapāla woman, three that's like a marvelous flower with a viper in its stem, four that's like a bad food whose nature is inconvenient and forced to eat it, five that's like a promiscuous woman, six that's like a marucca child, and seven that's like a flesh wound in a sore, eight that's like a violent wind, and nine that's like a comet.",
        "source": "X36n0659_012:0517b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中自為九章一一章中仍當分合譬前一為二乘作譬後八為凡夫作譬初文者。",
        "translation": "The explanation is divided into nine chapters, one for each chapter, and the first one should be a combined metaphor.",
        "source": "X36n0659_012:0517b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何名為如責有餘善男子譬如窮人負他錢財雖償欲畢餘未畢故猶繫在獄而不得脫。",
        "translation": "\"What is called such a reproach with remainder? Good sons are like poor people who are burdened with other people's money and property, even though they've paid off their desires and haven't finished yet, so they're still bound in prison and can't escape.",
        "source": "X36n0659_012:0517b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞緣覺亦復如是以有愛習之餘氣故不能得成阿耨多羅三藐三菩提善男子是名如責有餘。",
        "translation": "śrāvakas and pratyekbuddhas are likewise because of the residual karmic impressions of craving and habituation that prevent them from achieving supreme perfect enlightenment.",
        "source": "X36n0659_012:0517b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二乘未斷習如還財未盡。",
        "translation": "The two vehicles have yet to cut off the habituated condition of returning wealth that's not yet exhausted.",
        "source": "X36n0659_012:0517c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下八為凡夫尋文可見。",
        "translation": "The next eight are for mortals, as the text shows.",
        "source": "X36n0659_012:0517c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何如羅剎女婦善男子譬如有人得羅剎女納以為婦是羅剎女隨所生子生已便食食子既盡復食其夫。",
        "translation": "\"Good sons, what's like a rāṣṭrapāla woman? Good sons, suppose a person gets a rāṣṭrapāla woman and takes her as a wife. That rāṣṭrapāla woman then gives birth to a child, eats it after it's born, and then eats her husband after the child is finished.",
        "source": "X36n0659_012:0517c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子愛羅剎女亦復如是隨諸眾生生善根子隨生隨食善子既盡復食眾生令墮地獄畜生餓鬼唯除菩薩是名如羅剎女婦。",
        "translation": "Good sons, the beloved Rāṣṭrapāla woman is likewise. Following sentient beings, she produces sons with good roots, then she produces and feeds on them. After the sons are complete, she then feeds on sentient beings, causing them to fall into hell, animals, and hungry ghosts, except for bodhisattvas.",
        "source": "X36n0659_012:0517c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何如妙華莖毒蛇纏之譬如有人性愛好華不見華莖毒蛇過患即便前捉捉已蛇螫螫已命終。",
        "translation": "\"Good sons, how is it like the stalk of a marvelous flower tangled up by a viper? Suppose there's a person who loves sex and doesn't see the stalk of a flower, and a viper is in danger of catching it, stinging it, and then dying.",
        "source": "X36n0659_012:0517c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切凡夫亦復如是貪五欲華不見是愛毒蛇過患而便受取即為愛蛇之所毒螫命終即墮三惡道中唯除菩薩是名如妙華莖毒蛇纏之。",
        "translation": "All mortals likewise crave the five desirable flowers and don't see the danger of the beloved viper, so they take them, and then they're poisoned and stung by the beloved viper.",
        "source": "X36n0659_012:0517c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何所不便食而強食之譬如有人所不便食而強食之食已腹痛患下而死。",
        "translation": "\"Good sons, how do you force a person to eat food that's not suitable for them? It's like forcing a person to eat food that's not suitable for them, and then they die from abdominal pain and discomfort after eating it.",
        "source": "X36n0659_012:0517c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛食如是五道眾生強食貪著以是因緣墮三惡道唯除菩薩是名所不便食而強食之。",
        "translation": "Because of this cause, sentient beings in these five paths are forced to eat and become addicted, and they fall into the three bad destinies except for the bodhisattva, who is called a person who is forced to eat food that's inconvenient.",
        "source": "X36n0659_012:0517c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何如婬女譬如愚人與婬女通而彼婬女巧作種種諂媚現親悉奪是人所有錢財錢財既盡便復驅逐。",
        "translation": "\"Good sons, what's like a promiscuous woman? Suppose a foolish man consorts with a promiscuous woman who deceives him with various flatteries and now personally takes all of his money and possessions. After he finishes his money and possessions, he then drives her away.",
        "source": "X36n0659_012:0518a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛之婬女亦復如是愚人無智與之交通而是愛女奪其所有一切善法善法既盡驅逐令墮三惡道中唯除菩薩是名如婬女。",
        "translation": "A foolish man lacking intelligence associates with a woman who's a lover and takes away all of his good qualities and good qualities, and then he expels her after exhausting them, causing him to fall into the three bad destinies, except for bodhisattvas.",
        "source": "X36n0659_012:0518a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何如摩樓迦子譬如摩樓迦子若鳥食已隨糞墮地或因風吹來在樹下即便生長纏繞縛束尼拘羅樹令不增長遂至枯死。",
        "translation": "Good sons, what is like a malukako? Suppose a malukako eats a bird and then falls to the ground with its dung, or if the wind blows it under a tree, it grows up, wraps itself around the bindings of the nyagrodha tree so that it doesn't grow and withers to death.",
        "source": "X36n0659_012:0518a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛摩樓迦子亦復如是纏縛凡夫所有善法不令增長遂至枯滅既枯滅已命終之後墮三惡道唯除菩薩是名如摩樓迦子。",
        "translation": "Similarly, the son of Amitâbha also binds up all the good qualities of ordinary people so that they don't grow and wither away. After withering and dying, he falls into the three evil destinies after his life ends except for bodhisattvas.",
        "source": "X36n0659_012:0518a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何如瘡中瘜肉如人久瘡中生瘜肉其人要當勤心療治莫生捨心若生捨心瘜肉增長蟲疽復生以是因緣即便命終。",
        "translation": "Good sons, how is it like a polyp in a sore? Suppose a person develops a polyp in a long-standing sore. They must diligently treat it and don't become indifferent to it. If they become indifferent, the polyp will grow, and the worms and gangrene will grow again.",
        "source": "X36n0659_012:0518a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫愚人五陰瘡痍亦復如是愛於其中而為瘜肉應當勤心治愛瘜肉若不治者命終即墮三惡道中唯除菩薩是名如瘡中瘜肉。",
        "translation": "Ordinary foolish people with sores of the five aggregates likewise have a flesh wound that's a result of their craving. They should diligently treat that flesh wound, and if they don't treat it, they'll fall into the three evil destinies when their life ends.",
        "source": "X36n0659_012:0518a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何如暴風譬如暴風能偃山夷嶽拔於深根。",
        "translation": "\"Good sons, what's a storm like a violent wind that can lay down mountains and raze peaks and uproot deep roots?",
        "source": "X36n0659_012:0518a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛欲暴風亦復如是於父母所而生惡心能拔大智舍利弗等無上深固菩提根本唯除菩薩是名如暴風。",
        "translation": "A storm of desire is likewise. A storm of evil thoughts generated in the place of a father and mother can uproot the bodhisattva's unsurpassed, deep, and solid bodhi roots, except for the bodhisattva.",
        "source": "X36n0659_012:0518a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何如慧星譬如彗星出現天下一切人民饑饉病瘦嬰諸苦惱。",
        "translation": "\"Good sons, what's like the star of wisdom? It's like a comet that appears under the heavens and causes people to starve, become sick and thin, and suffer.",
        "source": "X36n0659_012:0518b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "愛之彗星亦復如是能斷一切善根種子令凡夫人孤窮饑饉生煩惱病流轉生死受種種苦唯除菩薩是名如彗星善男子菩薩摩訶薩住於大乘大般涅槃觀察愛結如是九種。",
        "translation": "The comet of desire is likewise capable of cutting off the seeds of all good roots, causing ordinary people to become orphaned, hungry, sick, and subject to various kinds of suffering as they transmigrate through birth and death, except for the bodhisattva, who is called like a comet. Good sons, the bodhisattvas, mahāsattvas, and those abiding in the great vehicle and great parinirvāṇa observe the nine bonds of craving as they are.",
        "source": "X36n0659_012:0518b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次善男子以是義故下第三料簡苦集世間因果已畢於四諦中間結前有作苦集起後無生四諦忘前是忘生死忘後是忘涅槃約此生滅文中料簡即令第二三四三番皆顯所以者何若見有苦則有苦生若有苦生則有苦滅既解苦無苦苦則不生苦既不生苦則不滅大品云即色是空非色滅空色性自空空中無生亦復無滅淨名云五受陰洞達空無所起是苦義若能如是解苦無苦而有真諦夫集從苦生既解苦無苦寧復有集解集無集即是真諦苦集滅故名為滅諦既無苦集寧得滅諦滅本不然今則無滅是為解滅無滅而有真諦道治苦集既無所治亦無能治故道不二解道無道而有真諦又寄此中間簡無生者明二邊無生世間因果既其不生出世因果亦復不生則無四諦只解世間苦集無苦集亦解出世道滅無道滅即是無生四諦其意無量且略言之若欲簡出第三番者解苦無苦而有實者是就實中又有二意次第實不次第實次第實者即是無量四諦不次第實是無作四諦還就簡四諦為四章初簡苦諦。",
        "translation": "Next, good sons, because of this meaning, the following third summary of the causes and effects of suffering and arising of suffering in the world has been completed, and in the middle of the four truths, the former is forgetting birth and death, and the latter is forgetting nirvāṇa.",
        "source": "X36n0659_012:0518b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以是義故諸凡夫人有苦無諦聲聞緣覺有苦有苦諦而無真實諸菩薩等解苦無苦是故無苦而有真諦。",
        "translation": "Good sons, for this reason, worldlings have the truth of suffering and not the noble truths, śrāvakas and pratyekbuddhas have the truth of suffering and not suffering, and bodhisattvas understand suffering and not suffering.",
        "source": "X36n0659_012:0518c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自有兩本若舊本則言凡夫之人合聲聞緣覺皆言有苦諦若新定本於集諦中則開凡夫二乘有異凡夫但有苦無諦二乘則有苦有諦此於二乘而與奪之舊云苦是境諦是智凡夫無智但有於境所以唯苦無諦二乘之人有少分智故有苦有諦無真實者不能觀苦解苦無苦故非真實集諦例爾。",
        "translation": "If the old version says that ordinary people combined with śrāvakas and pratyekbuddhas all say there's a truth of suffering, then the new version, which focuses on the noble truth of arising, discloses that there's a difference between ordinary people and the two vehicles. Ordinary people only have the truth of suffering and the two vehicles have the truth of suffering.",
        "source": "X36n0659_012:0518c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸凡夫人有集無諦聲聞緣覺有集有集諦諸菩薩等解集無集是故無集而有真諦。",
        "translation": "Ordinary people have the truth of arising and nothing. śrāvakas, pratyekbuddhas, and others have the truth of arising and nothing but the truth of arising.",
        "source": "X36n0659_012:0518c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞緣覺有滅非真菩薩摩訶薩有滅有真諦。",
        "translation": "The truth that śrāvakas, pratyekbuddhas, and mahāsattvas have cessation and don't have the truth that bodhisattvas and mahāsattvas have cessation.",
        "source": "X36n0659_012:0518c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聲聞緣覺有道非真菩薩摩訶薩有道有真諦。",
        "translation": "It's not true that śrāvakas, pratyekbuddhas, and mahāsattvas have the path and the true truth.",
        "source": "X36n0659_012:0518c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "道滅二諦不論凡夫者唯二乘與菩薩道滅二諦有真偽之異以二乘人不能觀滅諦非諦故非真菩薩能知故是真實。",
        "translation": "The two truths of path and cessation don't matter to mortals; only the two vehicles and bodhisattvas differ in the truth and falsity of the two truths of path and cessation because the two vehicles can't contemplate that the truth of cessation is not the truth and therefore not true, and the bodhisattvas can know it and therefore it's true.",
        "source": "X36n0659_012:0518c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "從善男子下第三廣明滅諦雖復滅道寄彼生滅中間而料簡之以生滅滅道猶未釋故故更釋之無生等三後自廣釋次釋滅諦文為三先唱兩章門次釋三結。",
        "translation": "From there, good sons, the third truth of cessation is explained in detail, even though the path to cessation is defined as the middle of birth and death, it's still not explained by birth and death and the path to cessation, so it's explained in detail by the three following explanations: \"The text of the truth of cessation is divided into three, starting with a recitation of the two categories, followed by an explanation of the three conclusions.",
        "source": "X36n0659_012:0519a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何菩薩摩訶薩住於大乘大般涅槃見滅見滅諦。",
        "translation": "\"Good sons, how do bodhisattvas, mahāsattvas, and bodhisattvas abide in the great vehicle great parinirvāṇa and see the truth of cessation and the truth of cessation?",
        "source": "X36n0659_012:0519a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唱見滅見滅諦兩門若見滅即是斷章門見滅諦是離章門二乘灰身滅智但有斷離兩事菩薩具智德等事(云云)。",
        "translation": "He teaches that the two approaches of seeing extinction and seeing the truth of extinction are such that if one sees extinction, it's the approach of stopping and the approach of seeing the truth of extinction, and the approach of separating from the approach of the two vehicles, the ash-body and the wisdom of cessation, but there are two things, such as stopping and separating, and the bodhisattva is endowed with the wisdom and virtue (clouds).",
        "source": "X36n0659_012:0519a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二所謂斷一切煩惱下是解釋初八字釋見滅門。",
        "translation": "Second, under \"cutting off all afflictions,\" he explains the first eight words that explain the gate of seeing cessation.",
        "source": "X36n0659_012:0519a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂斷除一切煩惱。",
        "translation": "It's called cutting off all afflictions.",
        "source": "X36n0659_012:0519a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是斷惑之無以之為斷。",
        "translation": "It's the absence of stopping afflictions and thus being stopped.",
        "source": "X36n0659_012:0519a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若煩惱下是釋見滅諦章門為二初用次體。",
        "translation": "If the afflictions are stopped, then it's called permanently ceasing.",
        "source": "X36n0659_012:0519a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若煩惱斷則名為常滅煩惱火則名寂滅煩惱滅故則得受樂諸佛菩薩求因緣故故名為淨更不復受二十五有故名出世以出世故故名為我。",
        "translation": "If the afflictions are stopped, then they are called permanently ceased; if the afflictions burn out, then they are called quiescent; if the afflictions cease, then they can experience happiness; the buddhas and bodhisattvas seek causes and conditions for them, so they're called pure; they're no longer subject to the twenty-five existences, so they're called supramundane; and because they're supramundane, they're called self.",
        "source": "X36n0659_012:0519a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初用中凡五句初四句是四德或謂五德今且作四德是就用為言。",
        "translation": "First, there are five phrases in application. The first four phrases are the four virtues or what might be called the five virtues, but now we'll refer to the four virtues as application.",
        "source": "X36n0659_012:0519a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二常於色聲下就畢竟寂滅是約體論。",
        "translation": "The second is always in form and sound, which is discussed in terms of ultimate extinction as the essence.",
        "source": "X36n0659_012:0519a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "常於色聲香味觸等若男若女若生住滅若苦若樂不苦不樂不取相貌故名畢竟寂滅真諦。",
        "translation": "Whether it's male, female, arisen, abiding, ceasing, painful, or pleasant, neither painful nor pleasant, and not grasping appearances, it's called the true truth of complete cessation.",
        "source": "X36n0659_012:0519a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三善男子菩薩下結如文。",
        "translation": "Third, the good sons and bodhisattvas conclude as explained below.",
        "source": "X36n0659_012:0519a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩如是住於大乘大般涅槃觀滅聖諦。",
        "translation": "\"Good sons, the bodhisattvas thus abide in the great vehicle great parinirvāṇa and contemplate the noble truth of cessation.",
        "source": "X36n0659_012:0519a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何下第四廣明道諦文為二初明道諦次會通初為三一章門二解釋三結。",
        "translation": "Good sons, what is the fourth extensive explanation of the truth of the path? The text is divided into two, the first explaining the truth of the path, the second connecting the first three, a chapter introduction, two explanations, and three conclusions.",
        "source": "X36n0659_012:0519b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何菩薩摩訶薩住於大乘大般涅槃觀道聖諦。",
        "translation": "\"Good sons, how does the bodhisattva Mahāsattva abide in the great vehicle great parinirvāṇa and contemplate the noble truth of the path?",
        "source": "X36n0659_012:0519b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中先譬次合。",
        "translation": "The explanation begins with the metaphor and ends with the combination.",
        "source": "X36n0659_012:0519b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子譬如闇中因燈得見麤細之物。",
        "translation": "\"Good sons, it's like seeing coarse and fine things in the dark because of a lamp.",
        "source": "X36n0659_012:0519b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初譬中言因燈者即譬八道然燈照物物即常無常等雖異終是一道隨緣異說。",
        "translation": "The first metaphor says that the cause of the lamp is a metaphor for the eightfold path, but even though a lamp illuminates things, that is, things that are permanent and impermanent, they are ultimately the same thing according to conditions and different explanations.",
        "source": "X36n0659_012:0519b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是住於大乘大般涅槃因八聖道見一切法所謂常無常有為無為有眾生非眾生物非物苦樂我無我淨不淨煩惱非煩惱業非業實不實乘非乘知無知陀羅驃非陀羅驃求那非求那見非見色非色道非道解非解。",
        "translation": "The bodhisattva Mahāsattva also thus abides in the great vehicle, great parinirvāṇa, and sees all things because of the eight noble paths, which are described as permanent, impermanent, existent, and nonexistent, sentient and non sentient beings and non things, pain and pleasure, selflessness, purity and impurity, affliction and non affliction, karma and non karma, real and unreal, vehicle and non vehicle, knowing and not knowing, dravya and non dravya, seeking and not seeking, seeing and not seeing form and not form, path and not path, and understanding and not understanding.",
        "source": "X36n0659_012:0519b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次合譬中云陀羅驃者河西云是真實諦求那是莊嚴瓔珞功德等舊云主諦依諦非陀羅即非真非求那即非俗。",
        "translation": "Next, in the combined metaphors, it's said that dhāravyū is the true truth, and seeking that is the adorned, ornamented, and meritorious qualities.",
        "source": "X36n0659_012:0519b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩如是住於大乘大般涅槃觀道聖諦。",
        "translation": "Good sons, the bodhisattvas thus abide in the great vehicle, great parinirvāṇa, and contemplate the noble truth of the path.",
        "source": "X36n0659_012:0519b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛下第二會通佛昔種種異說今但言八道是故會通文為二先問次答問中二先問次難初問為三一唱不相應二釋不相應三結不相應初如文。",
        "translation": "Kāśyapa said to the Buddha, \"The second thing he would do is to explain that in the past, the Buddha explained variously that there were only eight paths; therefore, the explanation is divided into two: first, he asks a question, then he answers it.",
        "source": "X36n0659_012:0519b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉菩薩白佛言世尊若八聖道是道聖諦義不相應。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, if the eight noble paths are the noble truths of the path, their meanings aren't associated with each other.",
        "source": "X36n0659_012:0519b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次何以故下釋者。",
        "translation": "Next, why is it that the following explanation is given.",
        "source": "X36n0659_012:0519b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故如來或說信心為道能度諸漏或時說道不放逸是諸佛世尊不放逸故得阿耨多羅三藐三菩提亦是菩薩助道之法或時說言精進是道如告阿難若有人能勤修精進則得成就阿耨多羅三藐三菩提或時說言觀身念處若有繫心精勤修習是身念處則得成就阿耨多羅三藐三菩提或時說言正定為道如告大德摩訶迦葉夫正定者真實是道非不正定而是道也若入禪定乃能思惟五陰生滅非不入定能思惟也或說一法若人修習能淨眾生滅除一切憂愁苦惱逮得正法所謂念佛三昧或復說言修無常想是名為道如告比丘有能多修無常想者能得阿耨多羅三藐三菩提或說空寂阿蘭若處獨坐思惟能得速成阿耨多羅三藐三菩提或時說言為人演法是名為道若聞法已疑網即斷疑網斷已則得阿耨多羅三藐三菩提或時說言持戒是道如告阿難若有精勤修持禁戒是人則度生死大苦或時說言親近善友是名為道如告阿難若有親近善知識者則具淨戒若有眾生能親近我則得發於阿耨多羅三藐三菩提心或時說言修慈是道修學慈者斷諸煩惱得不動處或時說言智慧是道如佛昔為波闍波提比丘尼說姉妹如諸聲聞以知慧刀能斷諸流諸漏煩惱或時如來說施是道如佛往昔告波斯匿王大王當知我於往昔多行慧施以是因緣今日得成阿耨多羅三藐三菩提。",
        "translation": "Sometimes the Tathāgata says that faith is the path that can cross over contaminants, or sometimes he says that the path of non-carelessness is the reason the buddhas are not careless and attain unsurpassed, correct, samyak-saṃbodhi, or he says that effort is the path as he told Ānanda. If someone diligently cultivates effort, then they'll attain unsurpassed, samyak-saṃbodhi, or he says that observing the mindful abode of body is the path.",
        "source": "X36n0659_012:0519c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四經多是阿含等教信心乃至布施說道不同次世尊若八聖道下難又三一以今難昔二以昔難今三結過。",
        "translation": "The fourteen sūtras mostly teach faith such as Āgama and even the path of generosity, but the next three difficulties are: first, to cast doubt on the present and past; second, to cast doubt on the past and present; and third, to conclude the error.",
        "source": "X36n0659_012:0520a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊若八聖道是道諦者如是等經豈非虗妄。",
        "translation": "Bhagavān, if the eight noble paths are the truths of the path, then wouldn't such sūtras be false?",
        "source": "X36n0659_012:0520a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初文者若昔是則今非。",
        "translation": "In the beginning, if they were in the past, then they aren't in the present.",
        "source": "X36n0659_012:0520a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼諸經非虗妄者彼中何緣不說八道為道聖諦。",
        "translation": "If those sūtras weren't false, then what was the reason they didn't say that the eightfold path is the noble truth of the path?",
        "source": "X36n0659_012:0520a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二若今是者昔何不說(云云)。",
        "translation": "Second, if it were true in the present, then why wasn't it explained in the past (clouds)?",
        "source": "X36n0659_012:0520a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三結如文。",
        "translation": "The third conclusion is as explained in the text.",
        "source": "X36n0659_012:0520a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若彼不說如來往昔何故錯謬然我定知諸佛如來久離錯謬。",
        "translation": "\"If they didn't say 'why did the Tathāgata err in the past?' then I definitely know that the Buddhas and Tathāgatas have long been free of error.",
        "source": "X36n0659_012:0520a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答為二第一歎問。",
        "translation": "The Buddha answered in two ways. First, he asked a question.",
        "source": "X36n0659_012:0520a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時世尊讚迦葉菩薩善哉善哉善男子汝今欲知菩薩大乘微妙經典所有秘密故作是問。",
        "translation": "The Bhagavān then praised Kāśyapa as good, good, good man. Now, you want to know all the secrets of the bodhisattvas' subtle great vehicle scriptures, so you've asked this question.",
        "source": "X36n0659_012:0520a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子去正答又二謂法譬。",
        "translation": "\"Good man, there are two more ways to answer correctly, namely, the parable of the Dharma.",
        "source": "X36n0659_012:0520a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如是諸經悉入道諦善男子如我先說若有信道如是信道是信根本是能佐助菩提之道是故我說無有錯謬善男子如來善知無量方便欲化眾生故作如是種種說法。",
        "translation": "\"Good man, such are the sutras that all enter the truth of the path. Good man, as I said before, if there's a path of faith, such a path of faith is the root of faith, and it's a path that supports enlightenment.",
        "source": "X36n0659_012:0520a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法說中意者以機別故說異會齊故理同。",
        "translation": "The idea behind teaching the Dharma is that because the faculties are different, the teachings differ and the principles are the same because they meet in unison.",
        "source": "X36n0659_012:0520b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬如良醫下譬說也凡舉六譬一良醫二飲水三金師四然火五一識六一色皆先譬次合初良醫譬可見。",
        "translation": "Like the good doctor, the following metaphors are also explained, where six metaphors are given: first, the good doctor, second, drinking water, third, the gold healer, fourth, the fire, fifth, the one consciousness, and sixth, the one form, all of which are metaphors first and combined first with the good doctor metaphor.",
        "source": "X36n0659_012:0520b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子譬如良醫識諸眾生種種病源隨其所患而為合藥并藥所禁唯水一種不在禁例或服薑水或甘草水或細辛水或黑石蜜水或阿摩勒水或尼婆羅水或鉢晝羅水或服冷水或服熱水或蒲萄水或安石榴水善男子如是良醫善知眾生所患種種藥雖多禁水不在例。",
        "translation": "\"Good sons, suppose a good doctor recognizes the various sources of illness in sentient beings and combines medicines according to their afflictions and what's forbidden by those medicines, except for one type of water that's not forbidden, whether it's ginger water, licorice water, fine spice water, black rock honey water, amalgamated water, nibhāra water, pātra water, cold water, hot water, puṇḍarī water, or ambrosia water. Good sons, such a good doctor well knows the various kinds of medicines that afflict sentient beings, even though there are many forbidden waters that aren't included in the examples.",
        "source": "X36n0659_012:0520b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "河西解水名尼婆羅者煑呵棃水名鉢晝羅煑樹葉為湯以樹為名。",
        "translation": "The water from the west side of the river that frees sentient beings is called nibhāra, and the water from the helium is called pārājapati.",
        "source": "X36n0659_012:0520b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來亦爾善知方便於一法相隨諸眾生分別廣說種種名相彼諸眾生隨所說受受已修習除斷煩惱如彼病人隨良醫教所患得除。",
        "translation": "The Tathāgata also well knows how to skillfully explain the various names and characteristics of a single aspect of the Dharma according to the various categories of sentient beings, and those sentient beings who follow that explanation receive it, cultivate it, and rid themselves of afflictions like a sick person who follows the teaching of a good doctor and gets rid of their afflictions.",
        "source": "X36n0659_012:0520b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子如有一人善解眾語在大眾中是諸大眾熱渴所逼咸發聲言我欲飲水我欲飲水是人即時以清冷水隨其種類說言是水或言波尼或言鬱持或言紗利藍或言婆利或言波耶或言甘露或言牛乳以如是等無量水名為大眾說。",
        "translation": "Furthermore, good sons, if there's a person who well understands the words of many people and is among the masses, the masses are overcome by thirst and they all say, \"I want to drink water! I want to drink water!\" That person then gives cool, pure water of various kinds and says, \"This is water!\" or \"Pāṇi,\" or \"Ujjain,\" or \"Sālêndra,\" or \"Pāli,\" or \"Paya,\" or \"Nectar,\" or \"Cow's milk,\" and speaks for the masses with these measureless names for water.",
        "source": "X36n0659_012:0520b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次飲水中波尼罽賓水名鬱特者東天竺水名經本或言鬱持今未定相承為鬱特紗梨藍中天竺水名波利聲論水名波耶藥和水名。",
        "translation": "Next, the name of the water in Kāśmīra that's drunk, the name of the water in Kāśmīra, the name of the water in Kāśmīra, the name of the water in Eastern India, or the name of the water in Sutra that's called Ujjayin, or the name of the water in Middle India that's called Ujjayin, or the name of the water in Sālêndra, or the name of the water in Medicine and Water, which is uncertain.",
        "source": "X36n0659_012:0520b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來亦爾以一聖道為諸聲聞種種演說從信根等至八聖道。",
        "translation": "\"Good sons, the Tathāgata also explains the eight noble paths from the faculty of faith and so forth for a variety of śrāvakas based on the single noble path.",
        "source": "X36n0659_012:0520b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三金師譬。",
        "translation": "Three gold masters are used as an example.",
        "source": "X36n0659_012:0520c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子譬如金師以一種金隨意造作種種瓔珞所謂鉗鎖環釧釵鐺天冠臂印雖有如是差別不同然不離金。",
        "translation": "Furthermore, good sons, suppose a goldworker uses a type of gold to fashion various jewelry at will, such as pincers, rings, pins, bracelets, banners, crowns, and armlets. Although there are such differences, they are not separate from gold.",
        "source": "X36n0659_012:0520c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來亦爾以一佛道隨諸眾生種種分別而為說之或說一種所謂諸佛一道無二復說二種所謂定慧復說三種謂見慧智復說四種所謂見道修道無學道佛道復說五種所謂信行道法行道信解脫道見到道身證道復說六種所謂須陀洹道斯陀含道阿那含道阿羅漢道辟支佛道佛道復說七種所謂念覺分擇法覺分精進覺分喜覺分除覺分定覺分捨覺分復說八種所謂正見正思惟正語正業正命正精進正念正定復說九種所謂八道及信復說十種所謂十力復說十一種所謂十力大慈復說十二種所謂十力大慈大悲復說十三種所謂十力大慈大悲念佛三昧復說十六種所謂十力大慈大悲念佛三昧及佛所得三正念處復說二十道所謂十力四無所畏大慈大悲念佛三昧三正念處善男子是道一體如來昔日為眾生故種種分別。",
        "translation": "Good sons, the Tathāgata also explains the single Buddha-Path according to the various discriminations of sentient beings.",
        "source": "X36n0659_012:0520c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合文云或說五種所謂信行等見到道者即信法兩行是見諦道中人信解與見到亦名見得此二是思惟道中人四人在兩道各分利鈍信行在見諦時鈍入思惟還成信解鈍法行可知一往如此數習則利不習則鈍翻覆不定數人云十五心是見諦道十六心去是思惟道論家不爾十六皆是見諦道論家分別利鈍在五停心中入見道無利鈍譬如平水乘船有遲有疾得風隨流無復利鈍餘三文可見。",
        "translation": "In conjunction with the text, it might be said that the five kinds of so-called faith and practice that are seen and experienced are those in the path of faith and practice, which are those in the path of seeing the truth. These two are those in the path of contemplation. Four people in each of the two paths are distinguished as having benefit and dullness.",
        "source": "X36n0659_012:0521a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子譬如一火因所然故得種種名所謂木火草火糠火䴬火牛馬糞火。",
        "translation": "Furthermore, good sons, it's like a single fire that results in various names, such as wood fire, grass fire, chaff fire, and horse dung fire.",
        "source": "X36n0659_012:0521a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子佛道亦爾一而無二為眾生故種種分別復次善男子譬如一識分別說六若至於眼則名眼識乃至意識亦復如是。",
        "translation": "Good sons, the Buddha path is likewise one and not two, and it's for the sake of sentient beings that various discriminations are made.",
        "source": "X36n0659_012:0521a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子道亦如是一而無二如來為化諸眾生故種種分別。",
        "translation": "Good sons, the path is likewise one and not two. The Tathāgata discerns variously for the sake of transforming sentient beings.",
        "source": "X36n0659_012:0521a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子譬如一色眼所見者則名為色耳所聞者則名為聲鼻所嗅者則名為香舌所嘗者則名為味身所覺者則名為觸。",
        "translation": "Furthermore, good sons, suppose there's one form, and what the eye sees is called form, and what the ear hears is called sound, and what the nose smells is called fragrance, and what the tongue tastes is called flavor, and what the body feels is called touch.",
        "source": "X36n0659_012:0521a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子道亦如是一而無二如來為欲化眾生故種種分別善男子以是義故以入聖道分名道聖諦。",
        "translation": "Good sons, the path is likewise one and not two. The Tathāgata makes various distinctions for the purpose of teaching sentient beings. Good sons, for this reason, the noble truth of the path is called the path by the division of the noble path.",
        "source": "X36n0659_012:0521a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是四諦下第三總結。",
        "translation": "Good sons, these are the four noble truths. Here's the third summary.",
        "source": "X36n0659_012:0521a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是四聖諦諸佛世尊次第說之以是因緣無量眾生得度生死。",
        "translation": "Good sons, these are the four noble truths that the Buddhas and world-honored ones explain in order. Because of these causes and conditions, measureless sentient beings are liberated from birth and death.",
        "source": "X36n0659_012:0521b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛下第三明無量四諦慧文為三初明無量無量二結為四無量慧三結為二無量他謂此文會通四諦開善謂是攝法盡不盡今謂正是無量無量慧章初文問答。",
        "translation": "Kāśyapa said to the Buddha, \"The third section below explains the wisdom of the immeasurable four truths.\" The first section explains the immeasurable and limitless two sections are the four immeasurable wisdoms and the third section are the two immeasurable others who say this text combines the four truths, which are well understood to be the collection of dharmas that are endless and inexhaustible.",
        "source": "X36n0659_012:0521b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛言世尊昔佛一時在洹河岸尸首林中爾時如來取少樹葉告諸比丘我今手中所捉葉多一切因地草木葉多諸比丘言世尊一切因地草木葉多不可稱計如來所捉少不足言諸比丘我所覺了一切諸法如因大地生草木等為諸眾生所宣說者如手中葉世尊爾時說如是言如來所了無量諸法若入四諦則為已說若不入者應有五諦。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, there was a time when the Buddha was on the bank of the Huan River in the rosewood grove. The Tathāgata then took a few leaves and told the monks, 'Now, I have caught in my hand many leaves, and there are many leaves of grass and trees on the causal land.' The monks said, 'Bhagavān, there are incalculably few leaves of grass and trees on the causal land.",
        "source": "X36n0659_012:0521b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問中先舉昔事昔舉大地草木喻於無量無量手中少許喻有作無生當知先說者少不說者多如此之多四諦攝盡四攝不盡若盡不應言多不盡應有第五諦。",
        "translation": "In the question, he first cites past events and then he cites the metaphor of the earth, grass, and trees, which are countless and measureless, and the small amount in his hand, which is a metaphor of production and nonproduction. You should know that the first mentioned is the lesser and the second is the greater.",
        "source": "X36n0659_012:0521b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛讚迦葉善哉善哉善男子汝今所問則能利益安隱快樂無量眾生善男子如是諸法悉已攝在四聖諦中。",
        "translation": "The Buddha praised Kāśyapa, \"Good, good, good man! What you're asking now will benefit, pacify, and make happy measureless sentient beings! Good man! Thus, all these things are included in the four noble truths.",
        "source": "X36n0659_012:0521b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答亦攝盡亦攝不盡同名四諦名攝則盡分別相貌彼竟不說攝則不盡名同義異故有盡有不盡今佛答之以名往收則皆攝盡。",
        "translation": "The Buddha answered, \"They are also included in the four noble truths, which are collected, exhausted, and not exhausted.\" They are called the four truths, which are collected, then exhausted, and they discern characteristics.",
        "source": "X36n0659_012:0521b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉復白去第二結無量無量為四無量慧文有問答。",
        "translation": "Kāśyapa then said, \"Suppose he goes to the second category of measurelessness and immeasurability and the four kinds of immeasurable wisdom, and the text has questions and answers.",
        "source": "X36n0659_012:0521b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉菩薩復白佛言如是等法若在四諦如來何故唱言不說。",
        "translation": "Kāśyapa again said to the Buddha, \"If these things are in the four truths, why does the Tathāgata say it's not explained?",
        "source": "X36n0659_012:0521c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答中二先示根辨智次正釋諦相初文者。",
        "translation": "There are two answers, the first showing the faculties, the wisdom, and the second correctly explaining the characteristics of the truths.",
        "source": "X36n0659_012:0521c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善男子雖復入中猶不名說何以故善男子知聖諦有二種智一者中二者上中者聲聞緣覺上者諸佛菩薩。",
        "translation": "The Buddha said, \"Good sons, even though we enter the middle, we still don't name it. Why is that? Good sons know that there are two kinds of cognition of the noble truths: one is middle, and the other is higher.",
        "source": "X36n0659_012:0521c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "具論諦智應有三品下是凡夫不足可論故不說之但舉中上者就四人中判於中上若就法者應指四種四諦以判中上有作無生如前說無量今當辨夫無量者非是條然出四諦外還是四諦種別不同故文云分別挍計有無量種若委論者應從地獄乃至於佛凡聖五陰種別不同於一一陰復更分別無量界入豈是聲聞緣覺所知是無量苦諦又從地獄乃至於佛行業不同一一行業分別挍計有無量種亦非聲聞緣覺所知是為無量集諦又從地獄乃至於佛應以何身應說何法令其修學一一身法分別挍計無量法門以為眷屬亦非聲聞緣覺所知是為無量道諦又從地獄乃至於佛得解脫時因緣不同一一解脫復有無量解脫分別挍計有無量種亦非聲聞緣覺所知如是為無量滅諦如此四境既異有作無生亦非二乘中智所及名稱同異為四諦相如大地一名為無量其相浩然今當略說。",
        "translation": "If we were to discuss the wisdom of the truths, there would be three classes of lower worldlings who aren't adequate for the discussion, so we wouldn't say anything about them. Those who cite the middle and higher should judge the middle and higher among the four persons, and those who cite the truths should point to the four kinds of four truths in order to judge the middle and higher as being created and unborn as explained above.",
        "source": "X36n0659_012:0521c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就正釋中四諦為四初苦諦中經文但約陰入界三及重明陰略示苦相初陰者。",
        "translation": "In the correct explanation, the four noble truths are the four first truth of suffering.",
        "source": "X36n0659_012:0522a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知諸陰苦名為中智分別諸陰有無量相悉是諸苦非是聲聞緣覺所知是名上智善男子如是等義我於彼經竟不說之。",
        "translation": "\"Good sons, knowing the suffering of the aggregates is called middle knowledge, and discerning that the aggregates have measureless aspects that are all suffering and aren't known by śrāvakas and pratyekbuddhas is called superior knowledge. Good sons, such are the meanings I didn't explain in that sūtra after all.",
        "source": "X36n0659_012:0522a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文云知諸陰苦是名中智分別諸陰有無量相是名上智云何分別六道陰者是葢人天善。",
        "translation": "The text says that knowing the suffering of the aggregates is called middling cognition, discerning that the aggregates have measureless aspects is called superior cognition.",
        "source": "X36n0659_012:0522a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "及無漏善葢人天善則沈沒三途葢無漏善則輪回諸有二乘陰者葢覆等德葢四等則不能化度眾生葢四德則不能至於寶所菩薩陰則葢覆生死涅槃葢生死則大悲拔苦葢涅槃則大慈與樂佛陰則葢覆法界事理葢事則以應身徧應一切機根葢理則以法身徧一切處又六道陰苦二乘陰樂菩薩陰雙是佛陰雙非如此分別豈是二乘所知。",
        "translation": "The human and uncontaminated good gates are sunken into the three paths, the uncontaminated good gates are reborn into existence, and the two vehicle gates are covered by virtues such as equanimity, the four virtues are incapable of saving sentient beings, the four virtues are incapable of reaching the precious land, and the bodhisattva gates are covered by birth-and-death and nirvāṇa, birth-and-death and great compassion, which removes suffering, and nirvāṇa and great kindness and joy.",
        "source": "X36n0659_012:0522a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知諸入者名之為門亦名為苦是名中智分別諸入有無量相悉是諸苦非諸聲聞緣覺所知是名上智如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing the sense of entry is called the gate, which is also called suffering. This is called the middle way of knowing that the sense of entry has measureless aspects that are all suffering and aren't known by direct disciples and solitary realizers.",
        "source": "X36n0659_012:0522a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次知入為門名為中智分別諸入有無量相是名上智云何分別六道六入名為入門亦名會入眼根色塵會入有為乃至意根法塵會入有為二乘入者入無常無我會入無為菩薩入者眼根入施會入檀波羅蜜乃至意亦如是眼根入戒忍進禪慧之門會入諸波羅蜜乃至意亦如是諸佛入者佛眼入普門門入一切法界慈悲喜捨法界感應會入薩婆若海乃至意亦如是諸經中明六根為寂靜門平等門此義甚多(云云)又六道之是入苦門二乘之入是入不苦門菩薩之入入亦樂亦苦門諸佛之入入非苦非樂門。",
        "translation": "Next, knowing that entry is the gate is called middle wisdom that discerns that all entries have measureless characteristics is called superior wisdom. What are the six entries into the six destinies that are called entry gates and are also called convergence entries? Those who enter the two vehicles enter impermanence and impermanence, those who enter the eye faculty enter generosity, those who enter the donations and those who enter the perfection of giving, and those who enter the mind are likewise.",
        "source": "X36n0659_012:0522b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知諸界者名之為分亦名為性亦名為苦是名中智分別諸界有無量相悉是諸苦非諸聲聞緣覺所知是名上智善男子如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing the elements is called their parts, their natures, and their suffering. This is called middle knowledge, which discerns that the elements have measureless characteristics that are all painful and not known by direct disciples or solitary realizers.",
        "source": "X36n0659_012:0522b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三又知界分性者是名中智分別諸界有無量相是名上智云何分別六道眼界性分唯見於色不能聞聲色界性分但對於眼不對於耳乃至意界性分但能知法不能見聞法界性分但對於意不對耳眼二乘界者眼界性分但是無常苦空無我不得常樂乃至意界性分亦復如是菩薩界者菩薩眼界性分但見色空不能即空即假即中乃至意界性分但能即空不能即假即中亦復如是諸佛界者眼是法界法性性分即能見色聞聲嗅香別味覺觸知法即空即假即中不可思議具足一切無量佛法乃至意亦如是又六道以苦為界二乘不苦為界菩薩亦樂亦苦為界佛以非樂非苦為界。",
        "translation": "Third, knowing the nature of the factors of existence is called middle knowledge that discerns that the factors of existence have measureless characteristics is called superior knowledge. How does it discern the nature of the eye-sector of the six destinies that sees form only, doesn't hear sound, and the nature of the form sector but to the eye and not to the ear, and even the nature of the mind sector that only knows things and doesn't see and hear the nature of the Dharma sector but to the mind and not to the ear? For the two-vehicle sector, the nature of the eye-sector is only impermanent, painful, empty, selfless, and not permanent or pleasant, and even the nature of the mind sector is likewise.",
        "source": "X36n0659_012:0522b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知色壞相是名中智下重廣約陰。",
        "translation": "Knowing the aspect of the decay of form is called the middle knowledge of the lower, extensive, and approximate aggregates.",
        "source": "X36n0659_012:0522c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知色壞相是名中智分別諸色有無量壞相悉是諸苦非諸聲聞緣覺所知是名上智如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing the aspect of form's disintegration is called middle-level cognition, which discerns that forms have measureless disintegrations that are all painful and not known by direct disciples or solitary realizers.",
        "source": "X36n0659_012:0522c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文云分別諸色無量壞相是名上智六道之色壞善壞定二乘之色壞因壞果菩薩之色壞有壞無佛色者壞上諸壞壞為法界非壞非不壞悉是法界又六道色壞樂二乘色壞苦菩薩色壞雙是佛色壞雙非(云云)。",
        "translation": "The text says that discerning the characteristics of form's measureless decay is called superior cognition. The form of the sixth path decays, goodness decays, concentration decays, the form of the two vehicles decays, cause decays, and the form of the bodhisattva decays, existence decays, and the form of the nonbuddha decays.",
        "source": "X36n0659_012:0522c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知受覺相是名中智分別諸受有無量覺相非諸聲聞緣覺所知是名上智善男子如是等義我於彼經亦不說之。",
        "translation": "\"Good sons, knowing the character of feelings and perceptions is called middle knowledge, and discerning that feelings have measureless perceptual forms that aren't known by direct disciples and solitary realizers is called superior knowledge. Good sons, such are the meanings of these things, and I don't explain them in that sūtra.",
        "source": "X36n0659_012:0522c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知受是覺相是名中智分別是受有無量相是名上智六道之受受違受順受不違順於違起瞋覺於順起食覺於不違順起癡覺二乘之受於三覺中一一皆起五分法身須陀洹人初覺無漏(云云)菩薩受者受佛法受眾生受佛法時覺於十力四無所畏諸波羅蜜受眾生於覺於慈悲喜捨四無量心諸佛受者自覺覺他即覺不覺非覺非不覺悉是法界。",
        "translation": "To know that feeling is the characteristic of apprehension is called middle wisdom, and to discern that feelings have measureless characteristics is called superior wisdom. The feelings of the six destinies are felt, disagreed with, experienced, resented, and not disagreed with.",
        "source": "X36n0659_012:0522c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知想取相是名中智分別是想有無量取相非諸聲聞緣覺所知是名上智如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing that the apprehension of perceptions is called middle knowledge and discerning that perceptions have measureless apprehensions that aren't known by śrāvakas and pratyekbuddhas is called superior knowledge.",
        "source": "X36n0659_012:0523a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知想取相名為中智分別是取有無量相是名上智六道之取但取人我眾生壽命色香味觸二乘之取取於無常苦空無我取於涅槃菩薩之取不取二邊但取中道如來取者取即不取即非取非不取悉是法界。",
        "translation": "Knowing also that the mark of conceptual appropriation is called middle wisdom and the mark of discriminating appropriation as having measureless marks is called superior wisdom. The appropriation of the six destinies is only the appropriation of person, self, sentient beings, life, form, odor, taste, and contact.",
        "source": "X36n0659_012:0523a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知行作相是名中智分別是行無量作相非諸聲聞緣覺所知是名上智善男子如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing the form of actions is called middle knowledge, and discerning the form of actions and measureless actions that aren't known by śrāvakas and pratyekbuddhas is called superior knowledge. Good sons, such and such meanings are not explained by me in that sūtra.",
        "source": "X36n0659_012:0523a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知行作相是名中智分別是行無量作相是名上智六道之行能作二十五有二乘之行能作涅槃菩薩之行作諸波羅蜜諸佛之行即作不作即非作非不作作等法界。",
        "translation": "Knowing the form of actions taken is called middle knowledge, and discerning the form of actions with measureless actions is called superior knowledge. The actions of the six destinies can be taken, the actions of the twenty-five existent two vehicles can be taken, the actions of nirvāṇa and bodhisattvas can be taken, the actions of the perfections, the actions of buddhas, that is, actions and non-actions, that is, non-actions and non-non-actions, and so forth, in the Dharma realm.",
        "source": "X36n0659_012:0523a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知識分別相是名中智分別是識無量知相非諸聲聞緣覺所知是名上智善男子如是等義我於彼經亦不說之。",
        "translation": "\"Good sons, this is called the middle knowledge of the discriminated characteristic of knowledge, and the discriminated characteristic of the infinite knowledge of consciousness that's not known by direct disciples and solitary realizers is called the superior knowledge. Good sons, such and such a meaning is not explained by me in that sūtra.",
        "source": "X36n0659_012:0523a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又知識是分別是名中智分別是識無量知相是名上智六道分別取此取彼飲苦食毒二乘分別厭生死沈涅槃菩薩分別離邊會中諸佛分別非邊非中經文約苦諦竟。",
        "translation": "Furthermore, knowledge that discerns is called middling knowledge, and knowledge that discerns is consciousness with measureless knowables is called superior knowledge. The six destinies discriminate taking this and that, drinking pain and eating poison, and the two vehicles discriminate tiring of birth and death and sinking into nirvāṇa.",
        "source": "X36n0659_012:0523a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知愛因緣能生五陰是名中智一人起愛無量無邊聲聞緣覺所不能知能知一切眾生所起如是等愛是名上智如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing that the causes and conditions of craving can give rise to the five aggregates is called middle knowledge. For one person to give rise to craving that's measureless and limitless and that's beyond the ability of śrāvakas and pratyekbuddhas to know, and for that person to know the kind of craving that arises in all sentient beings is called superior knowledge.",
        "source": "X36n0659_012:0523a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二知愛因緣能生諸陰是名中智知一切愛是名上智六道之愛是後陰因緣二乘之愛五分因緣菩薩之愛是無等等色乃至無等等識因緣諸佛之愛是色解脫乃至識解脫因緣。",
        "translation": "Second, knowing the causes and conditions of craving that give rise to the aggregates is called middle knowledge. Knowing all cravings is called superior knowledge. The cravings of the six destinies are the causes and conditions of the latter aggregates, the cravings of the two vehicles, the causes and conditions of the five factors, the cravings of bodhisattvas, the causes and conditions of peerless form and peerless consciousness, and the cravings of buddhas are the causes and conditions of the liberation of form and the liberation of consciousness.",
        "source": "X36n0659_012:0523b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知滅煩惱是名中智分別煩惱不可稱計滅亦如是不可稱計非諸聲聞緣覺所知是名上智如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing that the cessation of afflictions is called middle-level cognition discerns that the afflictions are indescribably calculable and cessation is thus indescribably calculable and not known by śrāvakas and pratyekbuddhas is called superior cognition.",
        "source": "X36n0659_012:0523b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三知滅煩惱是名中智知滅煩惱不可稱計滅亦如是不可稱計是名上智凡夫六道亦得有滅差已還生二乘之滅灰斷不起菩薩自滅復令他滅諸佛之滅滅一切滅即是法界。",
        "translation": "Knowing that the cessation of afflictions is the middle knowledge, knowing that the cessation of afflictions is indescribable and ceases just as it is, and that it can't be calculated, is called superior knowledge.",
        "source": "X36n0659_012:0523b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知是道相能離煩惱是名中智分別道相無量無邊所離煩惱亦無量無邊非諸聲聞緣覺所知是名上智如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing the characteristics of these paths and being able to escape affliction is called middle-level cognition. The characteristics of the distinct paths are measureless and limitless, and the afflictions they escape are measureless and limitless and not known by direct disciples or solitary realizers.",
        "source": "X36n0659_012:0523b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四道離煩惱是名中智分別能離之道無量無邊是名上智六道之道離善之惡離惡之善二乘之道離漏之無漏菩薩之道離邊之中諸佛之道無離無至何以故一切諸法即是佛道故動見修道品不動見修道品亦動亦不動見修道品非動見非不動見修道品(云云)是為分別無量四聖諦竟從知世諦者是名中智去是第三結四無量為二無量又二先明二諦次明二諦慧初文即是二諦。",
        "translation": "The four paths that are free of affliction are called middle wisdom, and the paths that are discriminated, capable of being freed from are measureless and limitless.",
        "source": "X36n0659_012:0523b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子知世諦者是名中智分別世諦無量無邊不可稱計非諸聲聞緣覺所知是名上智如是等義我於彼經亦不說之善男子知一切行無常諸法無我涅槃寂滅是第一義是名中智知第一義無量無邊不可稱計非諸聲聞緣覺所知是名上智如是等義我於彼經亦不說之。",
        "translation": "Good sons, knowing the worldly truth is called middle knowledge. To discern that the worldly truth is immeasurable, limitless, and indescribable and not known by śrāvakas and pratyekbuddhas is called superior knowledge. Good sons, knowing that all conditioned things are impermanent and all dharmas are without self and that nirvāṇa and extinction are the ultimate truth is called middle knowledge. Knowing that the ultimate truth is immeasurable, limitless, and indescribable and not known by śrāvakas and pratyekbuddhas is called superior knowledge.",
        "source": "X36n0659_012:0523b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文中直知世諦是中智分別世諦無量無邊是上智直知三法印即是中智知第一義無量無邊不可稱計是上智世間人但言第一義諦真諦涅槃只得是一不得有二況復無邊今文明第一義諦不可稱計豈唯一種此中言無常涅槃等真諦者與數論不同數云四諦十六諦竝皆見真得聖悉是第一義論家唯無我一種通於真俗餘皆世諦而皆相從言是真者以無常盡於常等倒苦集隨真相從名真依淨名云不生不滅是無常義盡是實相皆第一義又是三法印。",
        "translation": "In the text, direct knowledge of the conventional truth is middle wisdom, and discernment of the conventional truth as immeasurable and limitless is superior wisdom. Direct knowledge of the three seals of the Dharma is middle wisdom, and knowledge of the ultimate truth as immeasurable and limitless and indescribable is superior wisdom.",
        "source": "X36n0659_012:0523c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時文殊下第二明二諦慧者先出舊解六種二諦一有空二虗實三世流布亦言隨事四相續五相待六因生空有指大品虗實流布指阿毗曇相續相待因生指成論又解意同名異一凡聖二虗實三空有四假實五事理六親疎舊釋名云俗是浮虗真名真實世是代謝第一義是無過俗待不俗不俗名真真待不真不真名俗虗實相待真俗名生他問真是真實可稱為諦俗是浮虗何以稱諦彼解云審實浮虗若爾諦義兩釋俗以浮虗釋諦真以審實釋諦興皇云諦未曾二約緣故二俗於凡為實真於聖為實俱用實以釋諦不用浮虗今問真於聖為實聖有照真智可得稱為諦凡於俗為實凡無照俗智安得稱為諦若凡無照俗智而於俗為實得稱俗諦者凡無照真智於真亦為實亦應稱真諦凡於真無智不稱真諦者凡於俗無智安得稱俗諦又聖於真為實而稱為諦者聖何以於俗不實不得稱為諦是則聖人無權智今言諦者還是審實淨名云四諦是菩提不虗誑故即是審實有隨情審實隨智審實隨情智審實故隨凡隨聖約真約俗俱得稱諦喻如一色凡夫謂有賢聖為無亦如一日醉醒不同有轉不轉一諦二諦其義亦爾舊解二諦一體不異龍光云既稱二諦寧當一體二諦有二體亦俱通緣假法為世體無相理為真體雖有二體而實相即俗雖名相即無名相真無名相不妨名相又言二諦一體空為理本故以真為體俗是其用或言從俗取真俗為其體真是其用開善云二諦共以中道為體義皆不然若二諦二體則世無第一第一無世但是不相即不得有相即若其一體但是一諦則無二諦若其二諦以中為體取相障真無知障俗誰復障中二諦之智不能見中焉得為體若二諦二體二體各異不論相即若二諦一體只是一諦與誰相即仁王般若云二諦不相即猶如牛二角大品即色是空淨名五受陰洞達空無所起是苦義及此經中皆云二諦相即(云云)舊云合四諦為二諦或言苦集世間是世諦道滅出世是真諦或言三諦是世諦唯滅是真諦或言四諦皆是世諦明因果故無相因果乃是真諦或言只四諦是世諦即世諦是真諦文云解苦無苦而有真諦餘三亦爾今明非但四諦開合不同亦就二諦開合非一在後當說就文兩番問答初問為三一直審。",
        "translation": "At that point, Wenshushita secondly explained the wisdom of the two truths by first presenting the old interpretation of the six kinds of two truths: one is empty, two are simple, three are real, three are worldly in nature, also said to follow phenomena, four are continuous, five are pending, six are causal, and empty existence refers to the great Chapter on Bhūtatas, and real dissemination refers to the Abhidharma, continuity, mutuality, and pending causation refers to the śāstra. The old interpretation of the name says that the conventional is floating, the real is called true, and the world is a substitute for the first meaning, which is without error.",
        "source": "X36n0659_012:0523c16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "爾時文殊師利菩薩白佛言世尊所說世諦第一義諦其義云何。",
        "translation": "It was then that Mañjuśrī said to the Buddha, \"Bhagavān, what is the meaning of the supreme truth of the worldly truth as explained by the Bhagavān?",
        "source": "X36n0659_012:0524b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次世尊下雙定定相有不。",
        "translation": "Next, the Bhagavān then asked whether there was a dual definition of the determined characteristic.",
        "source": "X36n0659_012:0524b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊第一義中有世諦不世諦之中有第一義不。",
        "translation": "Is there a worldly truth in the Bhagavān's ultimate truth? Is there an ultimate truth in the worldly truth?",
        "source": "X36n0659_012:0524b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三如其有者下雙難。",
        "translation": "Third, as it exists, the following is a dual objection.",
        "source": "X36n0659_012:0524b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如其有者即是一諦如其無者將非如來虗妄說耶。",
        "translation": "'If it exists, it's the same truth; if it doesn't exist, wouldn't it be a false statement by the Tathāgata?'",
        "source": "X36n0659_012:0524b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "難中意者若言有者即是一諦真俗相即故真中有俗俗中有真二諦不異故言是一如其無者即是虗妄實而言之定有定無定一定異皆是虗妄皆出經者互現其文若定有無便成斷常虗妄之說。",
        "translation": "If it's said to exist, it's the same as the true and mundane truths, so the true has the mundane and the mundane has the true, and the two truths are not different.",
        "source": "X36n0659_012:0524b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子下如來直答。",
        "translation": "\"Good sons, the Tathāgata answers directly.",
        "source": "X36n0659_012:0524b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子世諦者即第一義諦。",
        "translation": "\"Good sons, the conventional truth is the truth of the ultimate truth.",
        "source": "X36n0659_012:0524b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二諦相即不斷不常定非虗妄。",
        "translation": "The two truths are the same, uninterrupted, impermanent, and certainly not false.",
        "source": "X36n0659_012:0524b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊下第二番問答。",
        "translation": "The Bhagavān then answers the second question.",
        "source": "X36n0659_012:0524b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊若爾者則無二諦。",
        "translation": "\"Bhagavān, if that's the case, then there are no two truths.",
        "source": "X36n0659_012:0524b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初問意者還成一諦故云則無二諦如長在短中則失長真在俗中則失真只成一諦。",
        "translation": "The first question was, 'Does the truth of the first truth remain the same?' So it's called 'there are no two truths.' For example, when long is in short, it loses its longness, and when true is in conventional, it loses its truth and becomes only the single truth.",
        "source": "X36n0659_012:0524c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答有二初略明大意。",
        "translation": "The Buddha answered in two ways. First, he explained the general idea in brief.",
        "source": "X36n0659_012:0524c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善男子有善方便隨順眾生說有二諦。",
        "translation": "The Buddha said, \"Good sons, there are good methods of following sentient beings and teaching that there are two truths.",
        "source": "X36n0659_012:0524c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理實中道唯有一體善巧方便為緣說二。",
        "translation": "In truth, the middle way is only one, and good skillful means are the reason for teaching the two.",
        "source": "X36n0659_012:0524c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若隨言說下第二廣說凡有八種一世出世二名無名三實不實四定不定五法不法六燒不燒七苦不苦八和合他亦作六種二諦若言空有虗實等諦皆言有虗有實兩理鏗然故非經意今文云隨順眾生說有二諦如隨醉人說則有轉日當用此意以釋經文一師云七種一統隨緣說異一師言七種各異今明智者大師有七二諦名雖不同其義可會一生滅二無生三單俗複真四單俗單中五複俗單中六複俗複中七圓二諦若依法華玄文名相稍別義意必同讀者應知就一種中復各三種謂隨情隨智隨情智今欲以彼七種二諦來釋此文佛旨難知且出一師之見八種不同即為八文初約世出世兩人判二諦者通冠下七。",
        "translation": "If it's spoken following the second extensive explanation, there are eight kinds: one worldly, transcendent, two nameless, three real, and insubstantial, four determined, and five unlawful, six burning, and not burning, seven painful, and not painful, and eight compounded.",
        "source": "X36n0659_012:0524c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子若隨言說則有二種一者世法二者出世法。",
        "translation": "Good sons, if we follow the words, then there are two kinds: one is worldly dharmas and the other is supramundane dharmas.",
        "source": "X36n0659_012:0524c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如出世人之所知者名為第一義諦世人知者名為世諦。",
        "translation": "Good sons, for example, what's known by people who transcend the world is called the first truth, and what's known by people of the world is called the conventional truth.",
        "source": "X36n0659_012:0524c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一二諦各有此意世情多想束為世諦聖智多知束為真諦此即隨情智判二諦。",
        "translation": "Each of these two truths has this meaning: worldly feelings and many perceptions are bound up in the worldly truth, and noble knowledge and many perceptions are bound up in the true truth. This is called the two truths according to feelings and knowledge.",
        "source": "X36n0659_012:0524c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次善男子五陰和合者約名無名判。",
        "translation": "Next, good sons, the confluence of the five aggregates is judged by reference to names and non-names.",
        "source": "X36n0659_012:0524c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子五陰和合稱言某甲凡夫眾生隨其所稱是名世諦解陰無有某甲名字離陰亦無某甲名字出世之人如其性相而能知之名第一義諦。",
        "translation": "Good sons, the confluence of the five aggregates says that some mortal sentient being according to what they call it is called the worldly truth. The aggregate of the understanding aggregates has no such-and-such name, and the aggregate of the secular aggregates has no such-and-such name.",
        "source": "X36n0659_012:0525a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攬陰名生即世諦即陰離陰如性知之性即真諦此約有作四諦立之。",
        "translation": "He grasps the names of the aggregates, which are produced, which are the conventional truths, and the aggregates, which are free from aggregates, and knows their nature as it is, which is the true truth.",
        "source": "X36n0659_012:0525a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三復次善男子或有法有名有實者。",
        "translation": "3. Furthermore, good sons, there may be things that have names and exist in truth.",
        "source": "X36n0659_012:0525a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子或有法有名有實或復有法有名無實。",
        "translation": "Furthermore, good sons, sometimes there are things that have names and realities, and sometimes there are things that have names and no realities.",
        "source": "X36n0659_012:0525a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子有名無實者即是世諦有名有實者是第一義諦。",
        "translation": "Good sons, 'that which has name and no substance' is the conventional truth, and 'that which has name and substance' is the ultimate truth.",
        "source": "X36n0659_012:0525a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "他云世諦有名名召於體物應於名真諦但有名而無實今文反此世但虗名而無真實不生不滅與法相稱即是真諦不能即色而空故有名無實能即色是空故有實有名此依無生四諦立之。",
        "translation": "Other teachings say that the worldly truth has name and fame, which is called the essence of things, and the true truth has name but no substance. The present teaching is the opposite: the world has only names but no substance, which are simple, unarisen, unperishable, and which correspond to things.",
        "source": "X36n0659_012:0525a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四善男子眾生壽命如旋火輪此約單俗複真以論二諦。",
        "translation": "The four good sons are sentient beings whose life span is like a whirling wheel of fire. This is a discussion of the two truths based on the simple conventional and the real.",
        "source": "X36n0659_012:0525a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如我眾生壽命知見養育文夫作者受者熱時之燄乾闥婆城龜毛兔角旋火之輪諸陰界入是名世諦苦集滅道名第一義諦。",
        "translation": "Good sons, suppose we the lifespan of sentient beings know and see the nurturing, the author, the recipient, the burning flame of the hot season, the city of Ganymede, the tortoise hair, the rabbit's horn, the whirling wheel of fire, and the aggregates, the elements, and the field of entry are called the worldly truth, and the path to suffering, accumulation, cessation, and the ultimate truth.",
        "source": "X36n0659_012:0525a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "假名幻化熱炎火輪但有其名而無其實稱世流布即是世諦真與中合共為真諦若單以真為第一義不得言苦集滅道是第一義俱指四諦即真中合此明無量四聖諦中若真若中同為第一義諦前文云第一義無量無邊不可稱說。",
        "translation": "If truth and middle together are the truth, then it can't be said that suffering, arising, ceasing, and the path are the first truths that refer to all four truths, namely, truth and middle, and this explains that among the measureless four noble truths, if truth and middle are both the first truth, the prior statement says that the first truth is measureless, limitless, and ineffable.",
        "source": "X36n0659_012:0525a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五善男子世法五種去此約單俗單中以明二諦。",
        "translation": "Five good sons, five kinds of worldly phenomena are removed from this explanation of the two truths by focusing on the merely conventional and the merely middle.",
        "source": "X36n0659_012:0525a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子世法有五種一者名世二者句世三者縛世四者法世五者執著世善男子云何名世男女缾衣車乘屋舍如是等物是名名世云何句世四句一偈如是等偈是名句世云何縛世捲合繫結束縛合掌是名縛世云何法世如鳴椎集僧嚴鼓戒兵吹貝知時是名法世云何執著世如望遠人有染衣者生想執著云是沙門非婆羅門見有結繩橫佩身上便生念言是婆羅門非沙門也是名執著世善男子如是名為五種世法善男子若有眾生於如是等五種世法心無顛倒如實而知是名第一義諦。",
        "translation": "Good sons, there are five kinds of worldly laws: the world of names, the world of sentences, the world of fetters, the world of dharmas, and the world of attachment. Good sons, what is the world of names? The world of men and women with coarse garments, carriages, and dwellings such as these are the world of names? What is the world of sentences? What is the world of sentences? What is the world of fetters? Rolling up a bundle, tying it up, binding it to the palm is called the world of fetters? What is the world of dharmas? Such as a distant person with dyed clothing who becomes attached and thinks, \"That's an ascetic, not a brāhmaṇa.\" Seeing a cord tied across the body and wearing it then gives rise to the thought, \"That's a brāhmaṇa, not an ascetic,\" is called the world of attachment.",
        "source": "X36n0659_012:0525b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上以熱炎火輪五譬以譬人我而為世諦今以五法而為世諦五法如炎輪炎輪譬法法譬互舉同是單俗心無顛倒如實知之即單指中道以為如實此明有作無生等苦集為俗指下一實諦為真六善男子若燒若割去此約複俗單中以明二諦。",
        "translation": "The previous five metaphors of the fiery wheel of heat and fire were used to simulate a person and self as the truth of the world, and now five dharmas are used as the truth of the world.",
        "source": "X36n0659_012:0525b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子若燒若割若死若壞是名世諦無燒無割無死無壞是名第一義諦。",
        "translation": "Furthermore, if good sons burn, cut, die, or decay, this is called the conventional truth, and nothing burned, nothing cut, nothing died, and nothing decayed is called the ultimate truth.",
        "source": "X36n0659_012:0525b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若燒若死此明體法始終若割若壞此明析法始終即以兩始為有兩終皆無此之有無合之為俗即是複俗單指中道非有非無故無燒割即第一義明上有作無生之真俗同名為俗指下一實諦而以為真。",
        "translation": "Whether it's burned or died, this explains the beginning and end of the essence of the Dharma, and whether it's cut or destroyed, this explains the beginning and end of the analyzed Dharma, which is to say that the two beginnings are existent and the two ends are nonexistent, and this combination of existent and nonexistent is mundane, which is compound mundane.",
        "source": "X36n0659_012:0525b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七善男子八苦有無去此約複俗複中以明二諦。",
        "translation": "Seven, good sons, the eight kinds of suffering have existence and nonexistence, which are explained in terms of the two truths of compound conventionality and repetition.",
        "source": "X36n0659_012:0525b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子有八苦相名為世諦無生無老無病無死無愛別離無怨憎會無求不得無五盛陰是名第一義諦。",
        "translation": "Furthermore, good sons, there are eight characteristics of suffering called the conventional truth: absence of birth, absence of old age, absence of illness, absence of death, absence of separation from what's loved, absence of association with what's disliked, absence of what's sought and absence of the five proliferating aggregates is called the first truth.",
        "source": "X36n0659_012:0525b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "複俗如向言複中者非單指理即事而理法界圓備名為複中此合上來有作無生真之與俗皆名為俗指下一實不可思議而為真諦文雖不顯義推自成然此一番猶是單俗複中二諦八復次善男子下先譬次合明圓二諦。",
        "translation": "The compound conventional, as we've said before, refers not simply to the principle, which is the actual thing, but the principle of the Dharma realm in its entirety is called the compounded middle, which together with the above, refers to the next real, inconceivable, and true truth. Although the text doesn't reveal the meaning and deduces it on its own, this is still a simple, conventional, and compounded middle of the two truths.",
        "source": "X36n0659_012:0525c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子譬如一人多有所能若其走時則名走者若收刈時復名刈者若作飲食名作食者若治材木則名工匠鍛金銀時言金銀師如是一人有多名字。",
        "translation": "Furthermore, good sons, it's like a person who has many abilities. When he walks, he's called a walker; when he harvests, he's called a mower; when he eats and drinks, he's called a food taker; when he treats lumber, he's called a craftsman; when he forges gold and silver, he's called a gold and silver smith.",
        "source": "X36n0659_012:0525c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法亦如是其實是一而有多名依因父母和合而生名為世諦十二因緣和合生者名第一義諦。",
        "translation": "In the same way, dharmas are really one but have many that depend on the union of parents and are called the conventional truth ... those born from the union of 12 causes and conditions are called the ultimate truth.",
        "source": "X36n0659_012:0525c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "真俗相即皆不可思議譬如父母和合生子一人多能以譬圓俗十二緣和合三道即是三德即第一義以顯圓真是名不可思議二諦一切二諦悉入此中方便隨俗說諸二諦無量無邊止論七種何足驚怪能如是知名慧聖行古來皆迷此二諦文今用天台大師七種二諦義來釋八番義則相應真順聖慧。",
        "translation": "True and conventional aspects are both inconceivable, like the union of parents giving birth to a son who is one and many can use the metaphor of the perfect and conventional twelve causes and conditions and the union of the three paths, which are the three virtues, which are the ultimate truth, to show that the perfect and true are called the inconceivable two truths into which all the two truths are included.",
        "source": "X36n0659_012:0525c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利下第三明一實諦慧聖行若前文中舉四舉二共顯一實何不從四至三而超至二非無三諦但此中文束四為二其義則便束四為三義少不便故不言三解者不同此問以常住佛果是一依一實諦引勝鬘云一苦滅諦即是真實地人云除妄顯棃耶即是實諦中假師云除斷常顯中道為一實諦興皇悉不用佛果所依能依焉是一實妄惑與黎耶為一為異若一既除妄惑亦除黎耶若異待妄說實豈是一實對邊說中中還是邊亦非一實然一切法本無所有畢竟清淨實無所有何曾有實及以不實諦與不諦為緣方便假設言教依文正以一道清淨為一實諦此正真法故華嚴云法性遠離是故今明若非彼是此非一實諦若隨緣異說得意無咎文顯一實甚自分明就文為二一標宗二論義初標有問有答。",
        "translation": "Mañjuśrī's third explanation of the noble practice of wisdom in regard to the truth of the single truth is that if the previous passage had mentioned four and two together to reveal the single truth, why wouldn't it be possible to go from four to three and go beyond that to two, not without the three truths? But this Chinese text bundles four into two, and then its meaning is less inconvenient because it bundles four into three.",
        "source": "X36n0659_012:0525c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利菩薩白佛言世尊所言實諦其義云何。",
        "translation": "Mañjuśrī said to the Buddha, \"Bhagavān, what do you mean by what you say is the true truth?",
        "source": "X36n0659_012:0526a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答中有八善男子初二共成初義則有七不同一約境。",
        "translation": "In his answer, there are eight good sons, the first two of which together form the first meaning, and then there are seven differences.",
        "source": "X36n0659_012:0526a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善男子言實諦者名曰真法善男子若法非真不名實諦。",
        "translation": "The Buddha said, \"Good sons, what's called the true truth is called the true dharma. Good sons, if something isn't true, it isn't called the true truth.",
        "source": "X36n0659_012:0526a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二約心。",
        "translation": "Second, it's about the mind.",
        "source": "X36n0659_012:0526a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子實諦者無顛倒無顛倒者乃名實諦。",
        "translation": "Good sons, the real truth is the absence of delusion. The absence of delusion is called the real truth.",
        "source": "X36n0659_012:0526a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三約言說私謂亦可約言行。",
        "translation": "Third, it's measured by language and privately understood to be measured by words and deeds.",
        "source": "X36n0659_012:0526a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子實諦者無有虗妄若有虗妄不名實諦。",
        "translation": "Good sons, the real truth is that there's nothing false, and if there were falsehoods, they wouldn't be called the real truth.",
        "source": "X36n0659_012:0526a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四據人。",
        "translation": "Fourth, it's based on human beings.",
        "source": "X36n0659_012:0526a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子實諦者名曰大乘非大乘者不名實諦。",
        "translation": "Good sons, what's real truth is called the great vehicle. What's not the great vehicle is not called real truth.",
        "source": "X36n0659_012:0526a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五約教。",
        "translation": "Fifth, it's based on the teaching.",
        "source": "X36n0659_012:0526a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子實諦者是佛所說非魔所說若是魔說非佛說者不名實諦。",
        "translation": "Good sons, what's real truth is that it's taught by the Buddha and not by Māra. If it's taught by Māra and not by the Buddha, it's not called the real truth.",
        "source": "X36n0659_012:0526a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六約因體。",
        "translation": "Sixth, it's about the essence of cause.",
        "source": "X36n0659_012:0526b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子實諦者一道清淨無有二也。",
        "translation": "The good sons, the true truth is that the one and only is pure, and there are no two.",
        "source": "X36n0659_012:0526b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七約果體。",
        "translation": "Seven, it's about the essence of the result.",
        "source": "X36n0659_012:0526b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子有常有樂有我有淨是則名為實諦之義。",
        "translation": "Good sons, this is the meaning of the real truth when there's permanence, happiness, self, and purity.",
        "source": "X36n0659_012:0526b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊白佛下第二論義還論七章初約境論義有問有答問中先領問。",
        "translation": "Wenshushilip said to the Buddha, \"The second point of the discussion is to return to the seven chapters that begin with a discussion of the meaning in terms of objects, with a question and an answer, and to begin by leading with the question.",
        "source": "X36n0659_012:0526b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利白佛言世尊若以真實為實諦者真實之法即是如來虗空佛性若如是者如來虗空及與佛性無有差別。",
        "translation": "Mañjuśrī said to the Buddha, \"Bhagavān, if this is the true truth, then what's true is the Tathāgata's uncontaminated emptiness and buddha-nature.",
        "source": "X36n0659_012:0526b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一往似問如來虗空佛性三種有何差別尋下答意正是問此三種與一實諦有何差別。",
        "translation": "One formerly seemed to ask what difference there was between the three kinds of the Tathāgata's emptiness and Buddha-nature, and the following answer precisely asked what difference there was between these three kinds and the single true truth.",
        "source": "X36n0659_012:0526b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答有三一唱兩章門二釋三結初唱章門又二初唱昔四諦次唱今一實興皇名初為實滅章門次為滅實章門取教為實滅取理為滅實亦以四諦教中之實即是實諦若虗空佛性皆是理實即為諦實故名為諦今此初唱昔四諦者。",
        "translation": "The Buddha answered in three ways: first, he sings the two categories, second, he explains the three conclusions, and second, he sings the categories of the four truths of the past, and second, he sings the category of the present one true truth, which is called the first category of the true extinction, and second, the category of the true extinction, which takes the teaching to be the true extinction and takes the principle to be the true extinction.",
        "source": "X36n0659_012:0526b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告文殊師利有苦有諦有實有集有諦有實有滅有諦有實有道有諦有實。",
        "translation": "The Buddha told Mañjuśrī that there's suffering, there's truth, there's accumulation, there's truth, there's cessation, there's truth, and there's the path, there's truth, and there's reality.",
        "source": "X36n0659_012:0526b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "各有三句苦是苦境諦是苦教亦是苦智實是苦諦之理不二為實又云除苦一句餘二亦得判實又但取實除兩句只用實為諦。",
        "translation": "Each had three phrases, \"Suffering is the object of suffering, truth is the teaching of suffering, and knowledge of suffering.",
        "source": "X36n0659_012:0526b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次如來非苦下第二唱一實章門。",
        "translation": "Next, under \"The Tathāgata is not suffering,\" he secondly explains the chapter on the single reality.",
        "source": "X36n0659_012:0526b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來非苦非諦是實虗空非苦非諦是實佛性非苦非諦是實。",
        "translation": "\"Good sons, the tathāgata is not painful and not truth is real, and space is not painful and not truth is real, and the Buddha-nature is not painful and not truth is real.",
        "source": "X36n0659_012:0526b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三種皆是實非苦者非境非諦者非教是實者是理後三諦亦爾如來虗空佛性亦爾顯時名如來隱名佛性虗空取隱顯不二。",
        "translation": "The three kinds are real, and what's not painful is not the object, what's not the truth is not the teaching, and what's real is the principle. The last three truths are also like this: when the Tathāgata is manifest, it's called the Tathāgata, and when it's hidden, it's called the Buddha-nature, and when it's taken from space, the hidden and revealed are not two.",
        "source": "X36n0659_012:0526c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言苦者下第二釋兩章門只約四諦即為四別一一諦中皆先釋實諦實諦即是昔四諦中之實次釋諦實皆如文。",
        "translation": "What's said about suffering is explained in the second of two categories, which are limited to the four truths, that is, the four distinctive aspects, and in each of them, the true aspect is explained first. The true aspect is the reality of the former four truths, and the next aspect is explained as follows.",
        "source": "X36n0659_012:0526c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利所言苦者為無常相是可斷相是為實諦。",
        "translation": "What Mañjuśrī calls suffering is the characteristic of impermanence, which is a characteristic that can be stopped, and this is the real truth.",
        "source": "X36n0659_012:0526c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來之性非苦非無常非可斷相是故為實虗空佛性亦復如是。",
        "translation": "The nature of the Tathāgata is not painful, not impermanent, and not a mark that can be cut off; therefore, it's real. The nature of the Buddha in space is likewise.",
        "source": "X36n0659_012:0526c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子所言集者能令五陰和合而生亦名為苦亦名無常是可斷相是名實諦。",
        "translation": "Furthermore, good sons, what's called accumulation causes the five aggregates to combine and arise, which is also called painful, impermanent, and has a severable aspect that's called the true truth.",
        "source": "X36n0659_012:0526c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來非是集性非是陰因非可斷相是故為實虗空佛性亦復如是。",
        "translation": "Good sons, the Tathāgata is not an aggregate, not a cause of aggregates, and not a severable characteristic; therefore, it's true.",
        "source": "X36n0659_012:0526c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子所言滅者名煩惱滅亦常無常二乘所得名曰無常諸佛所得是則名常亦名證法是為實諦。",
        "translation": "Good sons, what's called cessation is called the cessation of affliction, which is also permanent and impermanent. What's obtained by the two vehicles is called impermanent, and what's obtained by the buddhas is called permanent and is called the realization of the Dharma, which is the true truth.",
        "source": "X36n0659_012:0526c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來之性不名為滅能滅煩惱非常無常不名證法常住無變是故為實虗空佛性亦復如是。",
        "translation": "Good sons, the nature of the Tathāgata isn't called cessation, and it's capable of ceasing afflictions, which are impermanent and impermanent, and it's not called the realization of the Dharma that's eternal, abiding, and unchanging; therefore, it's true.",
        "source": "X36n0659_012:0526c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子道者能斷煩惱亦常無常是可修法是為實諦。",
        "translation": "Good sons, the path stops afflictions, is permanent and impermanent, and this is a cultivable dharma that's the true truth.",
        "source": "X36n0659_012:0527a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如來非道能斷煩惱非常無常非可修法常住不變是故為實虗空佛性亦復如是。",
        "translation": "The Tathāgata who's not the path can stop afflictions, which are impermanent and impermanent, and which aren't cultivable dharmas that are always abiding and unchanging.",
        "source": "X36n0659_012:0527a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次言真實者即是如來下第三結章門又二先結三法與真實相即更無異體。",
        "translation": "Furthermore, he who says \"true and real\" is the Tathāgata, the third chapter below concludes that there are two more ways to conclude that the three things are the same as the truth and have no different essence.",
        "source": "X36n0659_012:0527a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子言真實者即是如來如來者即是真實真實者即是虗空虗空者即是真實真實者即是佛性佛性者即是真實。",
        "translation": "Furthermore, good sons say that what's true and real is the Tathāgata, and what's tathāgata is true and real is space, and what's space is true and real is true and real is the buddha-nature, and what's buddha-nature is true.",
        "source": "X36n0659_012:0527a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次從有苦有苦因下更結是非又兩初結三法異於四諦故是諦實次結三法異於有為有漏是故是實。",
        "translation": "Next, we'll conclude that there's suffering and the causes of suffering, and then we'll conclude that there are two more ways that right and wrong are different from the four truths and therefore true.",
        "source": "X36n0659_012:0527a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利有苦有苦因有苦盡有苦對如來非苦乃至非對是故為實不名為諦虗空佛性亦復如是。",
        "translation": "Mañjuśrī, there's suffering, there's the cause of suffering, there's the end of suffering, there's the antithesis of suffering, and the tathāgata is not suffering or even the antithesis of it; therefore, it's real and isn't called a truth.",
        "source": "X36n0659_012:0527a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦者有為有漏無樂如來非有為非有漏湛然安樂是實非諦。",
        "translation": "Suffering that's existent, acquired, contaminated, and unpleasing to the Tathāgata, which is neither acquired nor contaminated, is perfectly peaceful and comfortable, and this is really not the truth.",
        "source": "X36n0659_012:0527a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言有苦即苦諦苦因即集諦苦盡即滅諦苦對即道諦問非虗非實稱為實者非虗非實亦應稱諦答如所問問二諦若齊何故二乘稱諦如來稱實答與奪之殊二乘審知是苦又解苦無苦與其諦名未窮理實故奪其實。",
        "translation": "The suffering that's spoken of is the truth of suffering, the cause of suffering is the truth of suffering's accumulation, the end of suffering is the truth of suffering's cessation, and the counterpoint of suffering is the truth of the path.",
        "source": "X36n0659_012:0527a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊白佛言如佛下釋第二據心章門先問次答。",
        "translation": "Mañjuśrī said to the Buddha, \"As the Buddha explained in the second chapter of the chapter on relying on the mind, first he asks a question, then he answers it.",
        "source": "X36n0659_012:0527a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利白佛言世尊如佛所說不顛倒者名為實諦若爾者四諦之中有四倒不如其有者云何說言無有顛倒名為實諦一切顛倒不名為實。",
        "translation": "Mañjuśrī said to the Buddha, \"Bhagavān, as the Buddha has taught, those who aren't mistaken are called the true truths. If that's the case, then among the four truths there are four fallacies that aren't as good as their existence, why do they say that the absence of mistakenness is called the true truth and that all mistakennesses aren't called true?",
        "source": "X36n0659_012:0527a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初問意云諦攝倒不如其攝者云何得言不倒為實若不攝者復違前言攝法皆盡進退兩望悉皆有過。",
        "translation": "The first question was, \"What does it mean when the truths are collected and fall short of being collected?\" How can it be said that what's not fallen down is real if it's not collected? It's also contrary to the previous statement that all collected things are exhausted, and both advancing and regressing are viewed as fallacious.",
        "source": "X36n0659_012:0527b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告文殊師利一切顛倒皆入苦諦如諸眾生有顛倒心名為顛倒善男子譬如有人不受父母尊長教敕雖受不能隨順修行如是人等名為顛倒如是顛倒非不是苦即是苦也。",
        "translation": "The Buddha told Mañjuśrī that all mistakenness enters the truth of suffering. Good sons, for example, are like people who don't accept the instructions of their parents and elders, and even though they accept them, they can't conform to their practice.",
        "source": "X36n0659_012:0527b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然下文具明是苦集攝此中但明是苦諦者偏據果報酬因之義。",
        "translation": "Here, however, the clarification of the truth of suffering's accumulation is based solely on the idea that it's the result that rewards the cause.",
        "source": "X36n0659_012:0527b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三問答釋約言說章門。",
        "translation": "The third question and answer explains the approach of speaking in terms of language.",
        "source": "X36n0659_012:0527b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言如佛所說不虗妄者即是實諦若爾者當知虗妄則非實諦。",
        "translation": "Mañjuśrī said, \"Suppose the Buddha teaches that what's not false is the true truth, then you should know that what's false is not the true truth.",
        "source": "X36n0659_012:0527b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善男子一切虗妄皆入苦諦如有眾生欺誑於他以是因緣墮於地獄畜生餓鬼如是等法名為虗妄如是虗妄非不是苦即是苦也聲聞緣覺諸佛世尊遠離不行故名虗妄如是虗妄諸佛二乘所斷除故故名實諦。",
        "translation": "The Buddha said, \"Good sons, all the untruths enter the truth of suffering. Suppose there are sentient beings who deceive others and use these causes and conditions to fall into hell, animals, and hungry ghosts, and such things are called untruths.",
        "source": "X36n0659_012:0527b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其中二事可見私謂準佛答文既約斷惑知是約行。",
        "translation": "These two things can be seen privately by referring to the text of the Buddha's reply, which is about ending mental disturbances and knowing that it's about practice.",
        "source": "X36n0659_012:0527b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊言如佛所說下第四就人為問。",
        "translation": "Mañjuśrī said, \"As the Buddha has taught it, the fourth question is about people.",
        "source": "X36n0659_012:0527b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言如佛所說大乘是實諦者當知聲聞辟支佛乘則為不實。",
        "translation": "Mañjuśrī said, \"As the Buddha has taught, the great vehicle is the true truth. You should know that the vehicle of śrāvakas and pratyekabuddhas is not real.",
        "source": "X36n0659_012:0527b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云二乘所說為實不實。",
        "translation": "Are the teachings of the two vehicles real and unreal?",
        "source": "X36n0659_012:0527b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言文殊師利彼二乘者亦實不實聲聞緣覺斷諸煩惱則名為實無常不住是變易法名為不實。",
        "translation": "The Buddha said, \"Mañjuśrī, the two vehicles are also real and unreal.\" śrāvakas and pratyekbuddhas who have ended the afflictions are called real, and impermanence and non-abiding are called unreal in terms of changing things.",
        "source": "X36n0659_012:0527c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛不定判實與不實約斷惑邊是實而非常住義當不實。",
        "translation": "The Buddha doesn't necessarily judge real and unreal to be real in the sense that the extreme of cutting affliction is real and unabiding is unreal.",
        "source": "X36n0659_012:0527c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊魔說下五就教為難。",
        "translation": "Mañjuśrī Māra explained the next five problems with the teaching.",
        "source": "X36n0659_012:0527c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言如佛所說若佛所說名為實者當知魔說則為不實世尊如魔所說聖諦攝不。",
        "translation": "Mañjuśrī said, \"If what the Buddha teaches is called real, you should know that what Māra teaches is unreal. Bhagavān, is the holy truth contained in what Māra teaches?",
        "source": "X36n0659_012:0527c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "魔所說者聖諦攝不。",
        "translation": "Does what the devil teaches contain the noble truths?",
        "source": "X36n0659_012:0527c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言文殊師利魔所說者二諦所攝所謂苦集凡是一切非法非律不能令人而得利益終日宣說亦無有人見苦斷集證滅修道是名虗妄如是虗妄名為魔說。",
        "translation": "The Buddha said to Mañjuśrī, \"What Māra teaches is that what's included in the two noble truths is suffering and accumulation, which are all unlawful and undisciplined, cannot be made to benefit, nor is there anyone who sees suffering, ends accumulation, realizes cessation, and cultivates the Way, which is called false and such falsehood is called Māra's teaching.",
        "source": "X36n0659_012:0527c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答意云四諦之中苦集諦攝問外道二十五六等諦為屬何諦又外道所說四諦之中為壞幾諦今明但壞苦集不壞道滅何者彼云冥初生覺後生五大五微等生覺是因壞佛集諦大微是果壞佛苦諦二十五六為佛苦集二諦所攝。",
        "translation": "The Buddha replied, \"The four truths include the noble truths of suffering and arising, and the non-Buddhist question of what are the twenty-five or twenty-six noble truths, and what are the noble truths that non-Buddhists say are destroyed in the four truths? Now, it's clear that they only destroy the noble truths of suffering and arising, not the cessation of the path.",
        "source": "X36n0659_012:0527c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言如佛下第六釋約因體章門。",
        "translation": "Mañjuśrī said, \"Thus is the Buddha,\" and the sixth section below explains the chapter on causation and essence.",
        "source": "X36n0659_012:0527c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言如佛所說一道清淨無有二者諸外道等亦復說言我有一道清淨無二若言一道是實諦者與彼外道有何差別若無差別不應說言一道清淨。",
        "translation": "Mañjuśrī said, \"As the Buddha teaches, one single thing is pure, and there are no two.\" Again, non-Buddhists say, \"I have one thing that's pure, and there are no two.\" If they say one thing is the true truth, what difference does it make to them and non-Buddhists? If there's no difference, they shouldn't say one thing is pure.",
        "source": "X36n0659_012:0528a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊牒佛一道清淨是實諦者外道亦云一道清淨應是實諦。",
        "translation": "When Mañjuśrī told the Buddha that one single pure truth is the real truth, the non-Buddhists also said that one single pure truth should be the real truth.",
        "source": "X36n0659_012:0528a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善男子諸外道等有苦集諦無滅道諦於非滅中而生滅想於非道中而生道想於非果中而生果想於非因中而生因想以是義故彼無一道清淨無二。",
        "translation": "The Buddha said, \"Good sons, those non-Buddhists have the truth of suffering's accumulation and the truth of the path to cessation, which is not cessation but gives rise to conceptions of cessation, which is not the path but gives rise to conceptions of the path, which is not the result but gives rise to conceptions of the result, which is not the cause but gives rise to conceptions of the cause.",
        "source": "X36n0659_012:0528a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛答意明外道但有苦集無道滅於非滅中而生滅想者即橫計非想以為涅槃非道道想者計雞狗戒而以為道非果果想者計於萬物微塵世性之果非因因想者計微塵世性是萬物因問前云不壞滅道今計非想雞狗等戒豈非壞耶答此起橫計橫壞道滅前則不爾彼明二十五諦直言冥初生覺等六諦之中但言主諦依諦何處云計非想之與狗戒故知不壞道滅二諦又問外道有苦諦者前何故云凡夫有苦無諦答直言有苦境以為苦諦非謂苦智。",
        "translation": "The Buddha's answer means to explain that non-Buddhists only have suffering, accumulation, and no cessation of the path, and those who conceive of cessation when they don't conceive of cessation are those who mistakenly conceive of non-conception as nirvāṇa, those who conceive of the path as the path, those who conceive of the precepts of chickens and dogs as the path, and those who conceive of the fruit of the fruit as the fruit of the worldly nature of all things, and those who conceive of the cause as the cause of the cause of all things.",
        "source": "X36n0659_012:0528a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊言如佛所說下釋第七據果體章門先問次答問為三一唱外道有四德二釋三結此初唱有如文。",
        "translation": "Mañjuśrī said, \"As the Buddha has taught,\" followed by an explanation of the seventh aspect of the chapter on the essence of result, first asking, then answering, there are three questions: first, a statement that non-Buddhists have four virtues, second explaining, and third concluding, the first statement is as explained in the text.",
        "source": "X36n0659_012:0528a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文殊師利言如佛所說有常有我有樂有淨是實義者諸外道等應有實諦佛法中無。",
        "translation": "Mañjuśrī said, \"If the Buddha teaches that there's permanence, self, pleasure, and purity, then these non-Buddhists should really have the truth that there's nothing in the Buddha's teaching.",
        "source": "X36n0659_012:0528a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故下釋凡有二十四復次計有常樂我淨即為四別初八復次計有常二五復次計有樂三三復次計有淨四八復次計有我此初八復次計常文在初者通以因果故知有常。",
        "translation": "Why is that? The following explanation explains that there are 24 compound concepts of existence, including permanence, bliss, self, and purity, which are four distinct first eight and second categories of permanence, two and fifth categories of bliss, three and third categories of bliss, four and eighth categories of purity, and the first eight and third categories of self.",
        "source": "X36n0659_012:0528b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故諸外道輩亦復說言諸行是常云何是常可意不可意諸業報等受不失故可意者名十善報不可意者十不善報若言諸行皆悉無常而作業者於此已滅誰復於彼受果報乎以是義故諸行是常。",
        "translation": "Why is it that groups of non-Buddhists also say that conditioned phenomena are permanent? How is it permanent? The karmic rewards that are agreeable and unlike are experienced without loss.",
        "source": "X36n0659_012:0528b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二列殺生因必得惡果故常。",
        "translation": "The second list of causes of killing life will surely lead to bad consequences; therefore, they are permanent.",
        "source": "X36n0659_012:0528b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "殺生因緣故名為常世尊若言諸行悉無常者能殺可殺二俱無常若無常者誰於地獄而受罪報若言定有地獄受報當知諸行實非無常。",
        "translation": "If the Bhagavān says that all conditioned actions are impermanent, then both the act of killing and the killable are impermanent. If they were impermanent, who would receive the results of their actions in hell? If they say there must be retribution in hell, you should know that the actions are really not impermanent.",
        "source": "X36n0659_012:0528b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三據能專念故常。",
        "translation": "Three, it's based on the ability to concentrate on mindfulness and therefore is permanent.",
        "source": "X36n0659_012:0528b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊繫心專念亦名為常所謂十秊所念乃至百秊亦不忘失是故為常若無常者本所見事誰憶誰念以是因緣一切諸行非無常也。",
        "translation": "The Bhagavān's fixation on mindfulness is also called constant. What's remembered for ten years or even a hundred years isn't forgotten; therefore, it's constant.",
        "source": "X36n0659_012:0528b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四舉憶想據所念。",
        "translation": "Fourth, he cites recollection and what's remembered.",
        "source": "X36n0659_012:0528b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊一切憶想亦名為常有人先見他人手足頭項等相後時若見便還識之若無常者本相應滅。",
        "translation": "Bhagavān, all recollections are also called permanent. A person first sees the features of another person's hands, feet, head, and neck, and so forth, and then if they see them later, they return to their consciousness. If they are impermanent, the original features should cease.",
        "source": "X36n0659_012:0528b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五舉修習。",
        "translation": "Five examples are given for cultivation.",
        "source": "X36n0659_012:0528b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊諸所作業以久修習若從初學或經三秊或經五秊然後善知故名為常。",
        "translation": "The Bhagavān's actions are cultivated over time. If someone trains for three or five years, they'll know it well and it's called permanent.",
        "source": "X36n0659_012:0528b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六舉笇數。",
        "translation": "Sixth, he cites the phalaenopsis.",
        "source": "X36n0659_012:0528b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊算數之法從一至二從二至三乃至百千若無常者初一應滅初一若滅誰復至二如是常一終無有二以一不滅故得至二乃至百千是故為常。",
        "translation": "The Bhagavān's arithmetic goes from one to two, from two to three, and up to a hundred thousand. If it's impermanent, the first one should cease, and if the first one ceases, who then goes to two? Thus, if one is constant, there are ultimately no two.",
        "source": "X36n0659_012:0528c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七據讀誦。",
        "translation": "Seven, according to recitation.",
        "source": "X36n0659_012:0528c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊如讀誦法誦一阿含至二阿含乃至三四阿含如其無常所可讀誦終不至四以是讀誦增長因緣故名為常。",
        "translation": "The Bhagavān recites the method of recitation from the first Āgama to the second Āgama and even to the third and fourth Āgamas as impermanent, so he can recite it and never reach the fourth. Because this is the cause for increasing recitation, it's called constant.",
        "source": "X36n0659_012:0528c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八據形相皆如文。",
        "translation": "The eight data items are all shaped like the text.",
        "source": "X36n0659_012:0528c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊缾衣車乘如人負責大地形相山河樹林藥木草葉眾生治病皆悉是常亦復如是世尊一切外道皆作是說諸行是常若是常者即是實諦。",
        "translation": "Bhagavān, the vial, garments, chariot, and vehicle are like men bearing the burden of the earth's shape, mountains, rivers, trees, forests, medicinal plants, and leaves, and the healing of sentient beings is all permanent.",
        "source": "X36n0659_012:0528c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次計樂有五復次一據因果。",
        "translation": "Next, there are five ways to impute pleasure, and then one is based on cause and effect.",
        "source": "X36n0659_012:0528c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有諸外道復言有樂云何知耶受者定得可意報故世尊凡受樂者必定得之所謂大梵天王大自在天釋提桓因毗紐天及諸人天以是義故必定有樂。",
        "translation": "Bhagavān, there are non-Buddhists who again say, \"What is the knowledge that there's pleasure?\" Whoever receives pleasure will surely attain it, Bhagavān, because it's called the king of Brahmā, the god Śakra Devānām-Indra, the Viṣṇu Devānām-Indra, and the humans and gods.",
        "source": "X36n0659_012:0528c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二據有求。",
        "translation": "Second, there's the expectation.",
        "source": "X36n0659_012:0528c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有諸外道復言有樂能令眾生生求望故飢者求食渴者求飲寒者求溫熱者求涼極者求息病者求差欲者求色若無樂者彼何緣求以有求故故知有樂。",
        "translation": "Bhagavān, there are non-Buddhists who also say that happiness creates the desire in sentient beings to seek food and drink, so the hungry seek food and thirst for drink, the cold seek warmth, the hot seek coolness, and the sick seek relief, and the desirous seek form.",
        "source": "X36n0659_012:0528c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三據樂因。",
        "translation": "Third, there are causes of pleasure.",
        "source": "X36n0659_012:0529a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有諸外道復作是言施能得樂世間之人好施沙門諸婆羅門貧窮困苦衣服飲食臥具醫藥象馬車乘粖香塗香眾華屋宅依止燈明作如是等種種惠施為我後世受可意報是故當知決定有樂。",
        "translation": "Bhagavān, there are non-Buddhists who again say that giving is pleasant because it's a gift. Worldly people like to give to ascetics, priests, the poor, and needy, clothing, food, bedding, medicine, elephants, horses, carriages, scents, perfumes, flowers, houses, and reliable lamps.",
        "source": "X36n0659_012:0529a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四據樂緣。",
        "translation": "Fourth, there are the conditions for that happiness.",
        "source": "X36n0659_012:0529a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有諸外道復作是言以因緣故當知有樂所謂受樂者有因緣故名為樂觸若無樂者何得因緣如無兔角則無因緣有樂因緣則知有樂。",
        "translation": "Bhagavān, there are non-Buddhists who also say this, 'It's because of the causes that one should know there's happiness.' They say that someone who experiences happiness has a cause and condition, and therefore it's called happy contact.",
        "source": "X36n0659_012:0529a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五據三品。",
        "translation": "Five bases are the three categories.",
        "source": "X36n0659_012:0529a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有諸外道復作是言上中下故當知有樂下受樂者釋提桓因中受樂者大梵天王上受樂者大自在天以有如是上中下故當知有樂。",
        "translation": "Bhagavān, there are non-Buddhists who again say, \"The higher, middle, and lower [levels] should be known to have bliss.\" The lower one who experiences bliss is Śakra Devānām-Indra, the middle one who experiences bliss is the king of Brahmā, and the upper one who experiences bliss is the Mahêśvara Heaven.",
        "source": "X36n0659_012:0529a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三三復次計有淨一據淨因。",
        "translation": "Three, three, and furthermore, it's considered to have a pure and one based on pure causes.",
        "source": "X36n0659_012:0529a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有諸外道復言有淨何以故若無淨者不應起欲若起欲者當知有淨。",
        "translation": "Bhagavān, there are non-Buddhists who again say there's purity. Why is it that if there's no purity, desires shouldn't arise, and if desires arise, you should know there's purity?",
        "source": "X36n0659_012:0529a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二據淨緣。",
        "translation": "Second, it's based on the condition of purity.",
        "source": "X36n0659_012:0529a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又復說言金銀珍寶瑠璃頗棃硨磲碼碯珊瑚真珠璧玉珂貝流泉浴池飲食衣服華香粖香塗香燈燭之明如是等物悉是淨法。",
        "translation": "They also say that gold, silver, precious treasures, lapis lazuli, hammerheads, coral, agates, real pearls, jade, kopecks, fountains, bathing pools, food, clothing, flowers, fragrances, incense, coatings, lamps, and candles, and so on are all pure things.",
        "source": "X36n0659_012:0529a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三據淨器。",
        "translation": "The third basis is pure vessels.",
        "source": "X36n0659_012:0529a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有淨謂五陰者即是淨器盛諸淨物所謂人天諸仙阿羅漢辟支佛菩薩諸佛以是義故名之為淨。",
        "translation": "Furthermore, there are the five aggregates of purity, which are pure vessels that contain pure things, called humans, gods, sages, arhats, solitary realizers, bodhisattvas, and buddhas.",
        "source": "X36n0659_012:0529b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四八復次計有我一據造作。",
        "translation": "48 Furthermore, it's imagined that there's a self and one basis for its creation.",
        "source": "X36n0659_012:0529b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊有諸外道復言有我有所覩見能造作故譬如有人入陶師家雖復不見陶師之身以見輪繩定知其家必是陶師我亦如是眼見色已必知有我若無我者誰能見色聞聲乃至觸法亦復如是。",
        "translation": "Bhagavān, there are non-Buddhists who again say that there's a self that's seen and created. It's like a person who enters a potter's house even though he doesn't see the potter's body and then sees a wheel and rope and knows for sure that his house must be the potter.",
        "source": "X36n0659_012:0529b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二據相貌。",
        "translation": "Second, it's based on appearances.",
        "source": "X36n0659_012:0529b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有我云何得知因相故知何等為相喘息視眴壽命役心受諸苦樂貪求瞋恚如是等法悉是我相是故當知必定有我。",
        "translation": "\"Furthermore, if there's a self, how can we know what's the cause and form and therefore know what's the form? Panting, gazing, dazzling, longevity, servitude, suffering, pleasure, craving, anger, and so forth are all forms of self.",
        "source": "X36n0659_012:0529b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三據別味。",
        "translation": "Third, it's based on the discrimination of flavors.",
        "source": "X36n0659_012:0529b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有我能別味故有人食果見已知味是故當知必定有我。",
        "translation": "Furthermore, since there's a self that discerns taste, a person who eats fruit and sees known taste should therefore know that there must be a self.",
        "source": "X36n0659_012:0529b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四據作業。",
        "translation": "Fourth, it's based on activity.",
        "source": "X36n0659_012:0529b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有我云何知耶執作業故執鐮能刈執斧能斫執缾盛水執車能御如是等事我執能作是故當知必定有我。",
        "translation": "\"Furthermore, how does he know that there's a self? He controls work, so he controls a sickle, mows, axes, chops, carries water in a basket, carries a chariot, and guides such things as these.",
        "source": "X36n0659_012:0529b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五據求乳。",
        "translation": "Five basic things are seeking milk.",
        "source": "X36n0659_012:0529b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有我云何知耶即於生時欲得乳哺乘宿習故以是當知必定有我。",
        "translation": "\"Furthermore, how does he know that there's a self, which is the desire to be fed at birth based on past conditioning? Therefore, you should know that there must be a self.",
        "source": "X36n0659_012:0529b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六據名字。",
        "translation": "Sixth, according to name.",
        "source": "X36n0659_012:0529b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有我云何知耶和合利益他眾生故譬如缾衣車乘田宅山林樹木象馬牛羊如是等物若和合者則有利益此內五陰亦復如是眼等諸根有和合故則利益我是故當知必定有我。",
        "translation": "Furthermore, how does he know that there's a self? It's because they combine to benefit other sentient beings, such as the basket, clothing, chariot, vehicles, fields, homes, forests, trees, elephants, horses, cattle, and sheep. If these things combine, then they will benefit the five internal aggregates. Similarly, the eye and other faculties combine to benefit me.",
        "source": "X36n0659_012:0529b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七據有遮。",
        "translation": "There are seven grounds for suppression.",
        "source": "X36n0659_012:0529c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有我云何知耶有遮法故如有物故則有遮閡物若無者則無有遮若有遮者則知有我是故當知必定有我。",
        "translation": "\"Furthermore, how do we know there's a self? It's because there are obscured things, and if there are things, then there's an obscured lack of things. If there are obscured things, then we know there's a self.",
        "source": "X36n0659_012:0529c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八據伴類。",
        "translation": "There are eight categories of companions.",
        "source": "X36n0659_012:0529c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次有我云何知耶伴非伴故親與非親非是伴侶正法邪法亦非伴侶智與非智亦非伴侶沙門非沙門婆羅門非婆羅門子非子晝非晝夜非夜我非我如是等法為伴非伴是故當知必定有我。",
        "translation": "Furthermore, how is the existence of a self known? Is it a companion or not a companion because what's intimate and what's not intimate are not companions, and what's right and wrong are not companions? Knowledge and not knowledge are not companions, either.",
        "source": "X36n0659_012:0529c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊諸外道等下第三總結外道應有實諦。",
        "translation": "Bhagavān, here's the third summary of the true truth of what non-Buddhists should be.",
        "source": "X36n0659_012:0529c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊諸外道等種種說有常樂我淨當知定有常樂我淨世尊以是義故諸外道等亦得說言我有真諦。",
        "translation": "Bhagavān, because non-Buddhists and others say that there's always happiness, self, and purity, you must know that there's always happiness, self, and purity.",
        "source": "X36n0659_012:0529c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言下二如來答文為三初略次廣三結初文二初非後釋初如文。",
        "translation": "The Buddha said, \"The next two texts of the Tathāgata's answer are three, the first brief, the second extensive, and the third concluding the first two texts, the first not the second explaining the first as it is in the text.",
        "source": "X36n0659_012:0529c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善男子若有沙門婆羅門有常有樂有淨有我者是非沙門非婆羅門。",
        "translation": "The Buddha said, \"Good sons, if there are ascetics and priests who have permanence, pleasure, purity, and self, they are not ascetics or priests.",
        "source": "X36n0659_012:0529c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次何以故下釋非。",
        "translation": "Next, why is it not explained below?",
        "source": "X36n0659_012:0530a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故迷於生死離一切智大導師故如是沙門婆羅門等沈沒諸欲善法羸損故是諸外道繫在貪欲瞋恚癡獄堪忍愛樂故是諸外道雖知業果自作自受而猶不能遠離惡法是諸外道非是正法正命自活何以故無智慧火不能消故是諸外道雖欲貪著上妙五欲貧於善法不勤修故是諸外道雖欲往至正解脫中而持戒足不成就故是諸外道雖欲求樂而不能求樂因緣故是諸外道雖復憎惡一切諸苦然其所行未能遠離諸苦因緣是諸外道雖為四大毒蛇所纏猶行放逸不能謹慎是諸外道無明所覆遠離善友樂在三界無常熾然大火之中而不能出是諸外道遇諸煩惱難愈之病而復不求大智良醫是諸外道方於未來當涉無邊險遠之路而不知以善法資糧而自莊嚴是諸外道常為淫欲災毒所害而反抱持五欲霜毒是諸外道瞋恚熾盛而復反更親近惡友是諸外道常為無明之所覆蔽而反推求邪惡之法是諸外道常為邪見之所誑惑而反於中生親善想是諸外道希食甘果而種苦子是諸外道已處煩惱闇室之中而反遠離大智炬明是諸外道患煩惱渴而復又飲諸欲醎水是諸外道漂沒生死無邊大河而復遠離無上船師是諸外道迷惑諸倒言諸行常諸行若常無有是處。",
        "translation": "Although these non-Buddhists are confused about birth and death and are free from the great guide of omniscience, such ascetics and brāhmaṇas are sunken into desires that weaken good qualities. Although non-Buddhists are bound up in the prison of desire, anger, delusion, and tolerance, they are unable to love and enjoy themselves.",
        "source": "X36n0659_012:0530a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般涅槃經卷第十二",
        "translation": "Mahāparinirvāṇa-sūtra, Vol. 12",
        "source": "X36n0659_012:0530a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日東　天台沙門本純　分會",
        "translation": "Nitto Tendai śramaṇa Benjū Branch",
        "source": "X36n0659_012:0530b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南本大般涅槃經會疏卷第十二",
        "translation": "Southern Edition of the Nirvana Sutra: A Commentary, Volume XII",
        "source": "X36n0659_012:0530b03_0",
        "is_bad_quality": false
    }
]