[
    {
        "source_sentence": "南本大般涅槃經會疏卷第十四",
        "translation": "Southern Edition of the Nirvana Sutra: A Commentary, Volume 14",
        "source": "X36n0659_014:0542b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "涅槃經疏卷第八",
        "translation": "Commentary on the Nirvana Sutra, Volume 8",
        "source": "X36n0659_014:0542b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "頂法師　撰",
        "translation": "written by the master at the top of the Dharma hierarchy",
        "source": "X36n0659_014:0542b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天台沙門湛然再治",
        "translation": "Tiantai śramaṇa Zhanranzhi",
        "source": "X36n0659_014:0542b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般涅槃經梵行品初第二十(卷第十四)北涼　天竺三藏　曇無讖　譯晉　沙門　慧嚴　慧觀　謝靈運　重治梵行品諸師謂梵行四心為體聖行三品為體引經云說四無量是梵天道名轉梵輪說四諦是第一義天道名轉法輪又師言慧定戒為梵行體七善悉知知即慧也四心是十二門禪即定也後明持戒得失即是戒也若然與聖行何異異者梵是化他聖是自行聖以慧為正戒定相成梵以戒為正慧定相成聖是聖人所行梵是淨道道通凡聖聖先戒後慧梵先慧後戒是為梵聖異也又師言因果是梵行體梵者言淨是涅槃因能得涅槃故以因果為梵行體義皆不然若四心為體斯梵天道非大涅槃若三品為體雖異聖行不出二乘非大涅槃因果為體者尚存因果云何名淨非大涅槃若非大涅槃是誰梵行名義無取故皆不用今言梵者名淨淨義有三謂淨淨不淨淨非淨淨非不淨淨云何淨淨所謂七善四無量心三品六念如是等法悉是出世涅槃淨道今以梵行徧淨諸淨文云誰是一切諸善根本當言慈是是名淨淨云何不淨淨我說是慈有無量門所謂神通調象調狂治眼治瘡慈遊世間悲入湯鑊慈善根力無所不現使諸不淨悉皆得淨是名不淨淨云何非淨淨非不淨淨所謂大乘大般涅槃非因非果非自非他非染非淨畢竟清淨即是如來常樂我淨文云慈若有無是有是無是聲聞慈慈若有無非有非無如是之慈是如來慈如來慈者乃是非淨淨非不淨淨若此三慈縱橫竝別非妙非淨即一而三即三而一不可思議乃得名為清淨梵行從三得名名梵行品文為二初明梵行次歎經初梵行為三先七善次四心三持戒初七善中二初徵次釋。",
        "translation": "The first twenty of the Brahmā Chapter of the Mahāparinirvāṇa Sutra (Vol. 14) Northern Liang, India, the Tripiṭaka of Dharmas, the Dharma Gate of Zen, the ascetic Huiyan, the Huiguan, and Xie Lingyun, all the masters of the Brahmā Chapter say that the four states of mind are the essence of the Brahmā path, the three classes are the essence of the noble path, and the sūtras say that the four immeasurables are the Brahmā path called the turning of the Brahma wheel, that the four truths are the supreme truth, and that the path is called the turning of the Dharma wheel.",
        "source": "X36n0659_014:0542b09_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "善男子云何菩薩摩訶薩梵行。",
        "translation": "\"Good sons, what is the religious practice of the bodhisattvas, the mahāsattvas, and the ascetics?",
        "source": "X36n0659_014:0542c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中三標釋結。",
        "translation": "In the explanation, there are three labels and an explanation of the conclusion.",
        "source": "X36n0659_014:0542c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩住於大乘大般涅槃住七善法得具梵行何等為七一者知法二者知義三者知時四者知足五者自知六者知眾七者知尊卑。",
        "translation": "\"Good sons, the bodhisattva Mahāsattva abides in the great vehicle of great parinirvāṇa and abides in seven good qualities that make up the religious practice. What are the seven? 1. knowing the teaching, 2. knowing the meaning, 3. knowing the time, 4. knowing enough, 5. knowing oneself, 6. knowing the multitude, and 7. knowing superiority and inferiority.",
        "source": "X36n0659_014:0542c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "標則標章唱數列名此七善者前三通自他次兩專自行後兩是化他若傍正言之正是化他傍是自行。",
        "translation": "The first three are self-composed, the next two are self-directed, and the last two are transformative, which, if correctly stated at the side, is transformative and the side is self-directed.",
        "source": "X36n0659_014:0542c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中二初明別七善次明圓七善別七善中即為七章初釋知法者法通自他以知法故能自行化他此章亦有標釋結初標如文。",
        "translation": "In the explanation, there are two ways to begin by explaining the seven good qualities, followed by the seven good qualities in the second way. The first way to explain the seven good qualities is to know the Dharma, which is shared with self and others.",
        "source": "X36n0659_014:0543a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何菩薩摩訶薩知法。",
        "translation": "\"Good sons, what is bodhisattva-mahāsattva knowledge of the Dharma?",
        "source": "X36n0659_014:0543a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋中二先列次釋。",
        "translation": "The second explanation is listed first and explained second.",
        "source": "X36n0659_014:0543a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是菩薩摩訶薩知十二部經所謂修多羅祇夜受記伽陀優陀那尼陀那阿波陀那伊帝目多伽闍陀伽毗佛略阿浮陀達磨優波提舍。",
        "translation": "\"Good sons, the bodhisattva Mahāsattva knows the twelve scriptures called the Śuddhâvāsa-gīthānas, the udāna-nidāna-apādāna-etimokṣa, and the ajñāgata-jñānas, the Ābhūdharma-dharma-upadeśa.",
        "source": "X36n0659_014:0543a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中十二部經為十二段初云修多羅者。",
        "translation": "In the explanation of the twelve sections of the sutras, it's called \"sūtra\" in the beginning.",
        "source": "X36n0659_014:0543a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子何等名為修多羅經從如是我聞已至歡喜奉行如是一切名修多羅。",
        "translation": "\"Good sons, what is called śūtra? From thus I've heard until I rejoice and hand down such-and-such, they're all called śūtra.",
        "source": "X36n0659_014:0543a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊云無翻五義訓釋或云契經是用此代彼或云契經是正翻開善云但通無別莊嚴云有別即是偈頌長行引成論云祇夜頌修多羅。",
        "translation": "Some say the scriptures are interpreted without explanation, some say the scriptures are translated here instead of there, or some say the scriptures are translated correctly and opened well, but they are shared without distinction, adorned with explanation, and have distinction, that is, they are verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses, verses.",
        "source": "X36n0659_014:0543a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為祇夜經佛告諸比丘昔我與汝愚無智慧不能如實見四真諦是故流轉久處生死沒大苦海何等為四苦集滅道如佛昔日為諸比丘說契經竟。",
        "translation": "What is this called the Gaia Translation?\" The Buddha told the monks that in the past, you and I were foolish and unwise enough not to see the four true truths as they really are, so we were constantly in a state of birth-and-death and lost in the great ocean of suffering.",
        "source": "X36n0659_014:0543a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爾時復有利根眾生為聽法故後至佛所即便問人如來向者為說何事佛時知已即因本經以偈頌曰。",
        "translation": "It was then that many sentient beings with spiritual faculties came to the Buddha because they wanted to hear the teaching, and they asked him what the Tathāgata had told them.",
        "source": "X36n0659_014:0543a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　我昔與汝等　　不見四真諦　　是故久流轉　生死大苦海　　若能見四諦　　則得斷生死　生死既已盡　　更不受諸有　　是名祇夜祇夜者具足應云路伽祇夜祇夜翻為句亦云頌開善云等句莊嚴云等頌光宅云重頌是頌長行之偈。",
        "translation": "\"In the past, I and you didn't see the four true truths, so we were constantly in a state of transmigration and the great ocean of suffering of birth-and-death. If we could see the four truths, then we could stop birth-and-death. Once birth-and-death has ended, we wouldn't be subject to existence. This is called 'night and day,' and it's called 'complete,' which means 'Luke,' 'night,' which means 'phrase,' 'verse,' 'opening,' 'equal,' 'equal,' 'verse,' 'Guangzhai,' 'grave,' and 'verse.' This is a verse that praises a long practice.",
        "source": "X36n0659_014:0543a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為受記經如有經律如來說時為諸天人受佛記莂汝阿逸多未來有王名曰儴佉當於是世而成佛道號曰彌勒是名受記。",
        "translation": "\"What's called taking assurance of assurance of future attainment of Buddhahood if the sūtras and vinaya teach that when the Tathāgata speaks, he'll take assurance of future attainment of Buddhahood for gods and humans.",
        "source": "X36n0659_014:0543b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受記者梵云和伽羅那論云解義經此翻受記即授六道三乘等記。",
        "translation": "Accepting the reporter's name is the Sanskrit word for accepting the meaning of the sutra, which is translated as accepting assurance that the six destinies, three vehicles, and so forth will be recorded.",
        "source": "X36n0659_014:0543b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為伽陀經除修多羅及諸戒律其餘有說四句之偈所謂。",
        "translation": "What's called the Gatha Sutra? Besides the sūtra and the precepts, there are other verses that say four phrases.",
        "source": "X36n0659_014:0543b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　諸惡莫作　　眾善奉行　　自淨其意　　是諸佛教是名伽陀。",
        "translation": "\"Do not do evil, practice goodness, and purify your own mind. This is called the Gadha of all Buddhism.",
        "source": "X36n0659_014:0543b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伽陀經一云不等句二云不等頌三云直偈即孤起偈所言除修多羅者除別相被頌長行又言及諸戒律者又除戒律中有此偈知前有長行無長行者即是孤起。",
        "translation": "The Gāthā-sūtra has one unequal phrase, two unequal verses, and three straight verses, which are orphaned verses that say, \"Except for the sūtra, this is a verse that praises long practices except for specific characteristics.\" It also says, \"And the precepts and regulations,\" except for this verse in the precepts and regulations, which knows that the previous long practice or lack of long practice is orphaned.",
        "source": "X36n0659_014:0543b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為優陀那經如佛晡時入於禪定為諸天眾廣說法要時諸比丘各作是念如來今者為何所作如來明且從禪定起無有人問以他心智即自說言比丘當知一切諸天壽命極長汝諸比丘善哉為他不求己利善哉少欲善哉知足善哉寂靜如是諸經無問自說是名優陀那。",
        "translation": "What is this called the Udāna sūtras? Suppose when the Buddha entered meditation in the afternoon and explained the essentials of the Dharma to the gods, the monks each thought, \"Now, what is the Tathāgata doing that the Tathāgata clarifies and rises from meditation without being questioned, and with the knowledge of other minds he says to himself, \"Monks, you should know that all the gods have an extremely long life.",
        "source": "X36n0659_014:0543b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優陀那論云無頌之長行經云無問自說因緣此偈出法句。",
        "translation": "The Udana-śāstra says, \"There's no verse that goes along with the sutra,\" and it says, \"Without question, I explain the reason why this verse comes out of the Dharma sentence.",
        "source": "X36n0659_014:0543b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為尼陀那經如諸經偈所因根本為他演說如舍衛國有一丈夫羅網捕鳥得已籠繫隨與水穀而復還放世尊知其本末因緣而說偈言。",
        "translation": "What is called the Nidāna sūtras that are the root of the causes of the verses in the sutras and are explained for others? Suppose there's a man in Śrāvastī who cages a bird after catching it, ties it up in a cage, brings it back to the water and grains, and then releases it.",
        "source": "X36n0659_014:0543b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　莫輕小惡　　以為無殃　　水渧雖微　　漸盈大器是名尼陀那。",
        "translation": "'Don't despise small evil as non-negative. A tiny drop of water that gradually fills a large container is called a nidāna.'",
        "source": "X36n0659_014:0543c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "尼陀那論云本末次第即因緣經。",
        "translation": "The Nidāna Abhidharma-mahāvibhāga says that this is the scripture that deals with causes and conditions in order of their origin and destination.",
        "source": "X36n0659_014:0543c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為阿波陀那經如戒律中所說譬喻是名阿波陀那。",
        "translation": "What's called an apadana sūtra that follows the parables described in the precepts and vinaya is called an apadana?",
        "source": "X36n0659_014:0543c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿波陀那論云即譬喻經。",
        "translation": "As the Treatise on the Apadāna says, this is the metaphorical sūtra.",
        "source": "X36n0659_014:0543c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為伊帝目多伽經如佛所說比丘當知我出世時所可說者名曰界經鳩留秦佛出世之時名甘露皷拘那含牟尼佛時名曰法鏡迦葉佛時名分別空是名伊帝目多伽。",
        "translation": "What's called the itivṛttaka sūtra as taught by the Buddha, which monks should know was explicable when I appeared in the world and was called the scripture of the realm? When Kuryucchanda appeared in the world, it was called the hell of existence, and when Kanakamuni appeared in the world, it was called the dharma mirror, and when Kāśyapa appeared in the world, it was called the fractional emptiness.",
        "source": "X36n0659_014:0543c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "伊帝曰多伽論云一竹伊帝曰多伽開善翻如是語莊嚴翻為本事言我所說名界經者各有界別欲明各有封印名如是語。",
        "translation": "Itti said that when the sūtras of the Tāgas were discussed as a bamboo, Itti said that the Tāgas were well-translated as thus-spoken, adorned, and translated as this ability to say that those I've described as the scriptures of the realms have their own distinctive elements and want to clarify that each is sealed and named thus-spoken.",
        "source": "X36n0659_014:0543c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為闍陀伽經如佛世尊本為菩薩修諸苦行所謂比丘當知我於過去作鹿作羆作麞作兔作粟散王轉輪聖王龍金翅鳥諸如是等行菩薩道時所可受身是名闍陀伽。",
        "translation": "What is called a jātaka sūtra? Suppose the Bhagavān was a bodhisattva who cultivated ascetic practices. Monks, you should know that in the past, I was a deer, a bear, a monkey, a rabbit, a scattered king, a wheel-turning sage king, a dragon, a gold-winged bird, and so forth, and I could accept bodies when I was practicing the bodhisattva path, which is called a jātaka.",
        "source": "X36n0659_014:0543c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "闍陀伽論云本生然本生本事不異即合第九為本生第八為如是語開異者第八名本事第九名本生。",
        "translation": "The Treatise on the Jātaka says 'originally born,' but originally born and competence aren't different, which means the ninth is originally born and the eighth is thus spoken, which is called competence and the ninth is originally born.",
        "source": "X36n0659_014:0544a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為毗佛略經所謂大乘方等經典其義廣大猶如虗空是名毗佛略。",
        "translation": "What's called the Vaibhāra-sūtra? The scriptures of the great vehicle are vast in meaning like space, which is called the Vaibhra-sūtra.",
        "source": "X36n0659_014:0544a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毗佛略者論云廣今經方廣亦云鞞佛略直廣是小乘中名方廣是大乘中名。",
        "translation": "Viṃbhogakāya is the sūtra that says, \"Extensive is the name in the lesser vehicle, and extensive is the name in the greater vehicle.",
        "source": "X36n0659_014:0544a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為未曾有經如彼菩薩初出生時無人扶持即行七步放大光明徧照十方亦如獼猴手捧蜜器以獻如來如白頂狗佛邊聽法如魔波旬變為青牛行瓦鉢間令諸瓦鉢互相掁觸無所傷損如佛初生入天廟時令彼天像起下禮敬如是等經名未曾有。",
        "translation": "What is called the unprecedented sūtra? Suppose a bodhisattva is first born and takes seven steps without support, so he radiates a bright light that shines everywhere in the ten directions.",
        "source": "X36n0659_014:0544a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿浮陀達磨即未曾有。",
        "translation": "*Abhidharma is unprecedented.",
        "source": "X36n0659_014:0544a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等名為優波提舍經如佛世尊所說諸經若作義論分別廣說辨其相貌是名優波提舍。",
        "translation": "What are these sūtras called upadeśa? They're called upadeśa when the Bhagavān teaches the meaning of a sūtra, discerns its meaning, explains it in detail, and discerns its appearance.",
        "source": "X36n0659_014:0544a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "優波提舍即論義亦云大教亦云解義大乘中沒解義名光宅以前和伽羅那名解義謂解受記義(云云)。",
        "translation": "Upadeśa is the meaning of the treatise, the great teaching, and the meaning of understanding.",
        "source": "X36n0659_014:0544a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若能下是第三總結。",
        "translation": "The third conclusion is if a bodhisattva can do so.",
        "source": "X36n0659_014:0544a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩若能如是了知十二部經名為知法。",
        "translation": "If a bodhisattva can thus understand the twelve scriptures, that's called knowing the teaching.",
        "source": "X36n0659_014:0544a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋知義者。",
        "translation": "Next, he explains the meaning of knowing.",
        "source": "X36n0659_014:0544a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩知義菩薩摩訶薩若於一切文字語言廣知其義是名知義。",
        "translation": "What does a bodhisattva know the meaning? If a bodhisattva knows the meaning of all words and languages in detail, this is called knowing the meaning.",
        "source": "X36n0659_014:0544a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即知十二部經所詮之理今明此解極略應言解十二部經空平等義又於一句解無量義又解畢竟清淨義若解三義義勢則周。",
        "translation": "That is, knowing the principle explained in the twelve scriptures. Now, I've explained that this understanding is extremely brief and should be described as understanding the twelve scriptures' meaning of emptiness and equality, understanding the immeasurable meaning in one sentence, and understanding the ultimate pure meaning.",
        "source": "X36n0659_014:0544b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三知時。",
        "translation": "The third time he knows.",
        "source": "X36n0659_014:0544b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩知時善男子菩薩善知如是時中任修寂靜如是時中任修精進如是時中任修捨定如是時中任供養佛如是時中任供養師如是時中任修布施持戒忍辱精進禪定具足般若波羅蜜是名知時。",
        "translation": "What is the time when a bodhisattva knows? Good sons, bodhisattvas well know the time when they're cultivating tranquility at will, the time when they're cultivating effort, the time when they're cultivating equanimity, the time when they're cultivating equanimity, the time when they're cultivating equanimity, the time when they're cultivating equanimity, the time when they're cultivating equanimity, the time when they're cultivating concentration, the time when they're cultivating equanimity, the time when they're cultivating equanimity, the time when they're cultivating concentration, the time when they're making offerings to buddhas, the time when they're making offerings to teachers, the time when they're cultivating generosity, maintaining precepts, tolerating humiliation, and the time when they're cultivating meditation and perfecting the prajñāparamit.",
        "source": "X36n0659_014:0544b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是時中任布施者即是化他餘句多是自行。",
        "translation": "Anyone who makes offerings at such a time is teaching others, and the rest of the sentence is mostly self-reliance.",
        "source": "X36n0659_014:0544b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四釋知足下兩善是自行。",
        "translation": "The fourth explanation is that the two virtues below knowing enough are self-imposed.",
        "source": "X36n0659_014:0544b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩知足善男子菩薩知足所謂飲食衣藥行住坐臥睡寤語默是名知足。",
        "translation": "How does a bodhisattva know his own feet? Good sons, bodhisattvas know their own feet, which are called knowing their own feet in terms of food, clothing, medicine, walking, standing, sitting, lying, sleeping, waking, speaking, and being silent.",
        "source": "X36n0659_014:0544b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五自知者。",
        "translation": "The fifth is self-knowledge.",
        "source": "X36n0659_014:0544b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何菩薩摩訶薩自知是菩薩自知我有如是信如是戒如是多聞如是捨如是慧如是去來如是正念如是善行如是問如是答是名自知。",
        "translation": "Good sons, how does the bodhisattva Mahāsattva know on his own that the bodhisattva knows on his own that I have such faith, such precepts, such learning, such equanimity, such wisdom, such going and coming, such right mindfulness, such good conduct, such questions, and such answers is called self-knowledge.",
        "source": "X36n0659_014:0544b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦視善不善如曾子曰吾日三省吾身。",
        "translation": "He closely examines what's good and unskillful as Zeng Zi said, \"I examine myself three times a day.",
        "source": "X36n0659_014:0544b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六云何知眾下兩善皆屬化他知眾者。",
        "translation": "Sixth, knowing the multitude of people down there are two good qualities that belong to those who know the multitude of people by teaching others.",
        "source": "X36n0659_014:0544b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何菩薩摩訶薩知眾善男子是菩薩知如是等是剎利眾婆羅門眾居士眾沙門眾應於是眾如是行來如是坐起如是說法如是問答是名知眾。",
        "translation": "How does a bodhisattva know the multitude? Good sons, this is a bodhisattva who knows that such and such are the multitude of warriors, the multitude of priests, the multitude of householders, and the multitude of ascetics who should thus walk, come, sit, rise, speak, and ask questions and answers is called knowing the multitude.",
        "source": "X36n0659_014:0544b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應備知十法界眾文中略舉人及二乘於一一眾施三業化但略舉身口又化他多用身口少用意是故略之。",
        "translation": "You should also know the multitude of the ten realms of reality. The text briefly mentions people and the two vehicles, giving three actions to each one of them and transforming them, but it briefly mentions body and speech and uses body and speech more and less than mind to transform others.",
        "source": "X36n0659_014:0544b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七知尊卑者。",
        "translation": "\"Seven, know the honorable and the inferior.",
        "source": "X36n0659_014:0544c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子云何菩薩摩訶薩知人尊卑善男子人有二種一者信二者不信菩薩當知信者是善不信者不名為善復次信有二種一者常往僧坊二者不往菩薩當知其往者善其不往者不名為善往僧坊者復有二種一者禮拜二不禮拜菩薩當知禮拜者善不禮拜者不名為善其禮拜者復有二種一者聽法二者不聽菩薩當知聽法者善不聽法者不名為善其聽法者復有二種一至心聽二不至心菩薩當知至心聽者是則名善不至心者不名為善至心聽法復有二種一者思義二不思義菩薩當知思義者善不思義者不名為善其思義者復有二種一如說行二不如說行如說行者是則為善不如說行不名為善如說行者復有二種一求聲聞不能利安饒益一切苦惱眾生二者迴向無上大乘利益多人令得安樂菩薩應知能利多人得安樂者最上最善。",
        "translation": "Good sons, how does the bodhisattva Mahāsattva know the superiority and inferiority of people? Good sons, there are two kinds of people: those who believe and those who don't believe. Bodhisattvas should know that believing is good, and those who don't believe aren't called good.",
        "source": "X36n0659_014:0544c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應備知十界尊卑文亦簡略不信是闡提即地獄界此則極卑不往僧坊無事中福德即餓鬼界不禮拜是憍慢即畜生界不聽法不受法訓諂曲佷[仁-二+戾]即脩羅界不至心聽散善不專即人界不思義者雖至心聽不能思義即是天法界不能修行但有聞思無有修慧是二乘方便道淺劣皆卑但求小乘無大志願雖復發真此亦為卑若求大乘此乃為尊次第相望乃至圓別是佛菩薩界如是節節迭為尊卑。",
        "translation": "You should also know that the ten realms are honored and inferior. The text is also brief. Disbelief is the most inferior in the realm of hell, which doesn't go to the saṃgha's temple, the realm of personal affairs, the realm of merit, which is the realm of hungry ghosts, failure to worship, conceit, which is the realm of animals, failure to listen to the teaching, failure to accept the teaching of the teaching, flattery, and misconduct, which is the realm of sūras, failure to listen with utmost attention, distraction, and lack of concentration, which is the realm of humans, failure to contemplate meaning, and failure to contemplate meaning in the realm of the Dharma of gods, failure to practice but hearing and contemplating without cultivating wisdom.",
        "source": "X36n0659_014:0544c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子去即第二明圓七善舉兩譬者如意珠譬圓生善甘露譬圓滅惡一善一切善無善不備一滅一切滅無惡不除故舉兩譬先譬次合譬可見。",
        "translation": "Good sons, this is the second explanation of the seven good qualities, which are expressed in two metaphors: the wish-granting pearl metaphor and the good-generating ambrosia metaphor and the cessation of evil.",
        "source": "X36n0659_014:0545a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如諸寶中如意寶珠最為勝妙如諸味中甘露最上。",
        "translation": "\"Good sons, among all the treasures, the wish-granting jewel is the most excellent and wonderful, and among the flavors, the ambrosia is the highest.",
        "source": "X36n0659_014:0545a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次如是下合譬。",
        "translation": "Next, it's a combined metaphor.",
        "source": "X36n0659_014:0545a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是菩薩於人天中最勝最上不可譬喻。",
        "translation": "Thus, the bodhisattva is the most excellent and the highest among humans and gods, and it's inexplicable.",
        "source": "X36n0659_014:0545a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云於人天中最尊最勝若直以世人天解者未為允當於賢聖人天中尊勝乃應今文。",
        "translation": "If you say it's the most honored and most excellent among humans and gods, then it wouldn't be fair to say that it's the most honored among the noble humans and gods that corresponds to the present text.",
        "source": "X36n0659_014:0545a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是名下第三總結。",
        "translation": "\"Good sons, this is called the third summary below.",
        "source": "X36n0659_014:0545a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是名菩薩摩訶薩住於大乘大涅槃經住七善法菩薩住是七善法已得具梵行。",
        "translation": "\"Good sons, this is called the bodhisattva Mahāsattva abiding in the great vehicle great nirvāṇa sūtra abiding in seven good qualities. Bodhisattvas abiding in these seven good qualities have attained the fulfillment of the religious practice.",
        "source": "X36n0659_014:0545a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能具七善即梵行中之一品。",
        "translation": "Being able to perfect the seven good qualities is one of the grades of the religious practice.",
        "source": "X36n0659_014:0545a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明四無量心者亦名四等無量從境四等從心何者前境非一故名無量在境雖多我心一相故名為等通而為言境亦名等心亦無量(云云)文為二初明四心後明心果初辨四心又二先明次第四後明圓四次第又三一略標二論義三領解初標如文。",
        "translation": "The second clarification of the four immeasurable states of mind is also called the four equal immeasurable states of mind from the object. What is it? The object is not one, so it's called immeasurable.",
        "source": "X36n0659_014:0545a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子復有梵行謂慈悲喜捨。",
        "translation": "\"Furthermore, good sons, there's also the religious practice of kindness, pity, joy, and equanimity.",
        "source": "X36n0659_014:0545a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次迦葉下論義先問次答問開五難一難四心應三二難四心應一三重難四心應三四難四心應二五重難四心應一合而言之亦成三難第一與第三難四令三第二與第五難四令一第四一難難四令二且依經文而分五難。",
        "translation": "Second, Kāśyapa then explained the meaning of the treatise by first asking and then answering the question, opening with five difficulties.",
        "source": "X36n0659_014:0545a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉菩薩白佛言世尊若多修慈能斷瞋恚修悲心者亦斷瞋恚云何而言四無量心推義而言則應有三。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, if someone who cultivates kindness often can stop anger and cultivates compassionate thoughts, then they'll also stop anger. How would he say that the four immeasurable states of mind should be interpreted in three ways?",
        "source": "X36n0659_014:0545b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第一以兩心無異同能治瞋應同是一喜能與樂捨能除癡是故但三不應有四。",
        "translation": "First, because there's no difference between the two minds, they're the same in that they can counteract anger and should be the same in that joy provides happiness and equanimity removes delusion.",
        "source": "X36n0659_014:0545b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈有三緣下第二皆同有二難令唯一。",
        "translation": "There are three conditions of kindness, and the second is that they are both the same and there are two difficulties in making them unique.",
        "source": "X36n0659_014:0545b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊慈有三緣一緣眾生二緣於法三則無緣悲喜捨心亦復如是若從是義唯應有一不應有四眾生緣者緣於五陰願與其樂是名眾生緣法緣者緣諸眾生所須之物而施與之是名法緣無緣者緣於如來是名無緣慈者多緣貧窮眾生如來大師永離貧窮受第一樂若緣眾生則不緣佛法亦如是以是義故緣如來者名曰無緣。",
        "translation": "Bhagavān, there are three conditions of kindness: one conditioned by sentient beings, two conditioned by the Dharma, and three unconditioned. Compassion, joy, and equanimity are likewise.",
        "source": "X36n0659_014:0545b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先唱三緣次釋三心三緣深淺但為一義然約境雖異緣心無別如緣貧窮即眾生緣知此貧人應須衣食即是法緣若知眾生須知如來受第一樂則無所須即是無緣能緣既一不應有四故只是一緣五陰名眾生緣者五陰從何而生緣所須物而施與之是名法緣若緣如來不須此物即是無緣欲明緣境心徧乃至上緣於佛況復餘境。",
        "translation": "First, he calls out the three conditions, then he explains the three mental states. The three conditions are only one in depth and one in depth, but even though their objects are different, their mental states aren't different. If he conditions the poor, that's the condition of sentient beings.",
        "source": "X36n0659_014:0545b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈之所緣下第三舉三緣難。",
        "translation": "The third difficulty in citing the three conditions is that they are the objects of kindness.",
        "source": "X36n0659_014:0545b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊慈之所緣一切眾生如緣父母妻子親屬以是義故名眾生緣法緣者不見父母妻子親屬見一切法皆從緣生是名法緣無緣者不住法相及眾生相是名無緣悲喜捨心亦復如是是故應三不應有四。",
        "translation": "Bhagavān, the condition of kindness is that all sentient beings are like the condition of parents, wives, and relatives.",
        "source": "X36n0659_014:0545c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生境淺法空則深無緣兩無是故極深既有三緣寧得有四只應有三成論人云緣生是生空緣法是法空緣如來是平等空此失文意文云緣眾生者緣於父母妻子願與其樂何時云空。",
        "translation": "When the objective realm of sentient beings is shallow and the Dharma is empty, then it's deep, unconditioned, and the two are nonexistent.",
        "source": "X36n0659_014:0545c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有二種下第四難。",
        "translation": "\"There are two kinds of people,\" he says, under the fourth difficulty.",
        "source": "X36n0659_014:0545c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊人有二種一者見行二者愛行見行之人多修慈悲愛行之人多修喜捨是故應二不應有四。",
        "translation": "Bhagavān, there are two kinds of people: those who see and act, and those who love and act. Those who see and act mostly cultivate compassion, and those who love and act mostly cultivate joy and equanimity.",
        "source": "X36n0659_014:0545c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人有二種見行利根愛行鈍根利人好瞋為教鈍者十徧不解是故生瞋為此義故須修慈悲以捨瞋心鈍見利者恒生嫉妬所以令其修於喜捨即除嫉妬若爾只見有二不應有四。",
        "translation": "There are two kinds of people who see and practice, those with sharp faculties, those with dull faculties, and those who prefer anger as their teaching. The dull ones don't understand ten things and therefore become angry.",
        "source": "X36n0659_014:0545c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫無量者下第五以名字離合作難。",
        "translation": "The fifth one is called 'immeasurable' and the fifth one is named 'free from cooperation'.",
        "source": "X36n0659_014:0545c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊夫無量者名曰無邊邊不可得故名無量若無量者則應是一不應言四若言四者何得無量是故應一不應四也。",
        "translation": "Bhagavān, the term 'immeasurable' means that it's limitless and inaccessible, so it's called immeasurable. If it's immeasurable, then it should be one, not four.",
        "source": "X36n0659_014:0545c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既言無量豈得唯四既其但四不應無量若無量者唯應是一。",
        "translation": "Since it's called immeasurable, how could it be only four? If it's only four, it shouldn't be immeasurable; if it's immeasurable, then it should only be one.",
        "source": "X36n0659_014:0546a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次如來答為二先破定四之執次答無四之難初有三一明教門廣略不定二明反常不定三明治惑不定既其不定何必須四初約十二因緣不定為答。",
        "translation": "The Tathāgata then answers in two ways, first by refuting the insistence that there are four, and then by answering the difficulty that there are no four. First, there are three ways to explain that the teachings are broad and abbreviated, uncertain, counterintuitive, uncertain, and sandwich confusion, uncertain, and why do they need four?",
        "source": "X36n0659_014:0546a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告迦葉善男子諸佛如來為諸眾生所宣法要其言祕密難可了知或為眾生說一因緣如說何等為一因緣所謂一切有為之法善男子或說二種因緣及果或說三種煩惱業苦或說四種無明諸行生與老死或說五種所謂受愛取有及生或說六種三世因果或說七種謂識名色六入觸受及以愛取或說八種除無明行及生老死其餘八事或說九種如城經中除無明行識其餘九事或說十一如為薩遮尼犍子說除生一法其餘十一或時具說十二因緣如王舍城為迦葉等具說十二無明及至生老病死善男子如一因緣為眾生故種種分別無量心法亦復如是善男子以是義故於諸如來深祕行處不應生疑。",
        "translation": "The Buddha told Kāśyapa, \"Good sons, the Tathāgatas explain the essentials of the Dharma for sentient beings, and their words are esoteric and difficult to understand.",
        "source": "X36n0659_014:0546a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或十一乃至二一因緣隨機利益不可為定除生一法者河西云薩遮尼犍聰明鍱腹頭戴火冠來至佛所其心高逸不聽佛法密迹杵擬怖方聽法其父是梵志母是尼犍俱共出家以從非法父母生故唯此為恥餘無所憚佛將護之故除生一法唯說十一為迦葉說以辟支根利復無忌諱具說十二。",
        "translation": "He was born to a father who was a priest and a mother who was a nikāṇḍa, and they left home together because they were born from an illegitimate father and mother.",
        "source": "X36n0659_014:0546a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來方便下第二反常不定或謂口密不定。",
        "translation": "\"Good sons, the second thing that follows from the Tathāgata's skillful means is that he's impermanent and uncertain, or what's called close-mouthed and uncertain.",
        "source": "X36n0659_014:0546b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來世尊有大方便無常說常常說無常說樂為苦說苦為樂不淨說淨淨說不淨我說無我無我說我於非眾生說為眾生於實眾生說非眾生非物說物物說非物非實說實實說非實非境說境境說非境非生說生生說非生乃至無明說明明說無明色說非色非色說色非道說道道說非道善男子如來以是無量方便為調眾生豈虗妄耶。",
        "translation": "\"Good sons, the Bhagavān has great skill in teaching impermanence, saying eternal, saying impermanent, saying pleasant as painful, saying painful as pleasant, impure, saying pure, saying impure, saying self, saying no-self, and no-self, saying self.",
        "source": "X36n0659_014:0546b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛實具足常樂我淨亦說無常不淨生死實是無常不淨亦說常樂我淨。",
        "translation": "The Buddha is truly replete with permanence, bliss, self, and purity, and he also teaches that birth and death are truly impermanent and impure, and he also teaches that permanence, bliss, self, and purity.",
        "source": "X36n0659_014:0546b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子或有眾生下第三治惑不定謂身密不定。",
        "translation": "Good sons, there are sentient beings who are uncertain in the third category of correcting mental disturbances, which is uncertainty about the confidentiality of the body.",
        "source": "X36n0659_014:0546b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子或有眾生貪於財貨我於其人自化其身作轉輪王於無量歲隨其所須種種供給然後教化令其安住阿耨多羅三藐三菩提若有眾生貪著五欲於無量歲以妙五欲充滿其願然後勸化令其安住阿耨多羅三藐三菩提若有眾生榮豪自貴我於其人無量歲中為作僕使趨走給侍得其心已即復勸化令其安住阿耨多羅三藐三菩提若有眾生性戾自是須人訶諫我於無量百千歲中教訶諫喻令心調順然後復勸令其安住阿耨多羅三藐三菩提善男子如來如是於無量歲以種種方便令諸眾生安住阿耨多羅三藐三菩提豈虗妄耶諸佛如來雖處眾惡無所染汙猶如蓮華善男子應如是知四無量義。",
        "translation": "Good sons, suppose there's a sentient being who lusts after possessions. I transform that person's body into a wheel-turning king who makes various offerings to them as needed for measureless years, then I teach and instruct them to abide in the unsurpassed, correct, and complete enlightenment.",
        "source": "X36n0659_014:0546b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "作轉輪王施財是捨與五欲樂是喜作僕使趍走是慈訶諫是悲。",
        "translation": "To be a wheel-turning king who gives alms of wealth is equanimity, and the pleasure of the five desires is joy. To be a servant and make him walk around is kindness, and reprimanding him is pity.",
        "source": "X36n0659_014:0546c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是無量下第二答無四之問又二前總後別總又二初舉二事次總非前問舉二事者前舉體異次明用異初體異者。",
        "translation": "Good sons, it's measureless. The second answer to the question, which has no four, is twofold: first, it summarizes two things, and second, it summarizes two things that aren't the previous question.",
        "source": "X36n0659_014:0546c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是無量心體性有四若有修行生大梵處。",
        "translation": "\"Good sons, the essence of this immeasurable mind has four natures, and if someone cultivates it, they'll be born in the place of the great Brahma.",
        "source": "X36n0659_014:0546c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "得報不同慈得徧淨悲得空處喜得識處捨得不用處處異故治惑不同。",
        "translation": "The attainment of rewards is different, compassion attains pervasive purity, emptiness attains joy, consciousness attains equanimity, non-use attains, and each is different, so the mental disturbances they treat are different.",
        "source": "X36n0659_014:0546c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是無量伴類下第二明用異者。",
        "translation": "Thus, the second difference in application is explained below the category of measureless companions.",
        "source": "X36n0659_014:0546c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如是無量伴類有四是故名四夫修慈者能斷貪欲修悲心者能斷瞋恚修喜心者能斷不樂修捨心者能斷貪欲瞋恚眾生。",
        "translation": "Good sons, thus there are four limitless companions. This is why they're called the four virtuous ones who cultivate kindness to end craving, compassion to end anger, joy to end unhappiness, and equanimity to end craving and anger in sentient beings.",
        "source": "X36n0659_014:0546c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪取人物慈與人物瞋與人苦悲拔人苦嫉忌人樂喜與人樂癡長憎愛捨亡愛憎。",
        "translation": "They crave taking people as beings, are compassionate with people, are anger with people's suffering, are compassionate with people's suffering, are jealous of people's happiness, are joyous with people's happiness, are deluded, abhor, and love, and abandon what's loved and hated.",
        "source": "X36n0659_014:0546c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故下二總結前非。",
        "translation": "It's for this reason that the next two summarize the previous falsehoods.",
        "source": "X36n0659_014:0547a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以是義故得名為四非一二三。",
        "translation": "\"Good sons, it's for this reason that they're called the four not-one, two, and three.",
        "source": "X36n0659_014:0547a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非一者非第二第五非二者非第四非三者非第一第三。",
        "translation": "What's not one is not the second and fifth, and what's not two is not the fourth and what's not three is not the first and third.",
        "source": "X36n0659_014:0547a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如汝所言下第二別答五問即為五章此初答第一治惑難唯三無四。",
        "translation": "The second answer to the five questions below as you say is in five chapters. The first answers the first difficulty of curing mental disturbances, which is only three and not four.",
        "source": "X36n0659_014:0547a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如汝所言慈能斷瞋悲亦如是應說三者汝今不應作如是難何以故善男子恚有二種一能奪命二能鞭撻修慈則能斷彼奪命修悲則能除彼鞭撻善男子以是義故豈非四耶復次瞋有二種一瞋眾生二瞋非眾生修慈心者斷瞋眾生修悲心者斷非眾生復次瞋有二種一有因緣一無因緣修慈心者斷有因緣修悲心者斷無因緣復次瞋有二種一於過去久已積習二於現在今始積習修慈心者能斷過去修悲心者斷於現在復次瞋有二種一瞋聖人二瞋凡夫修慈心者斷瞋聖人修悲心者斷瞋凡夫復次瞋有二種一上二中修慈斷上修悲斷中善男子以是義故則名為四何得難言應三非四。",
        "translation": "Good sons, as you say, kindness can stop anger, and so can pity. You should not make this objection now. Why is it so? Good sons, there are two kinds of anger: one that takes life and two that lash. Cultivating kindness stops them from taking life, and cultivating pity removes them from lashing. Good sons, is this not the fourth? Furthermore, there are two kinds of anger: one that angers sentient beings and two that angers non-sentient beings.",
        "source": "X36n0659_014:0547a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今明雖同治瞋瞋有輕重是故成四有六復次如文。",
        "translation": "Now, although it's clear that anger is treated equally, anger has a lesser and a greater degree of seriousness, so it becomes four and has six.",
        "source": "X36n0659_014:0547a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故迦葉是無量下答第二同緣難。",
        "translation": "\"Therefore, Kāśyapa is immeasurable,\" he says in reply to the second difficulty about the same conditions.",
        "source": "X36n0659_014:0547a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故迦葉是無量心伴類相對分別為四。",
        "translation": "\"Therefore, Kāśyapa is the companion of measureless mental categories that are relatively discriminated as four.",
        "source": "X36n0659_014:0547a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "治惑不同伴類有四何得令同有三緣但共為一復以器下答第三淺深難難令有三。",
        "translation": "How can there be four types of people who aren't companions in correcting mental disturbances and how can they be made to have three common conditions but only one in common? Furthermore, under vessel, he answers the third difficulty of making the difficult shallow and deep difficult to make three.",
        "source": "X36n0659_014:0547a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復以器故應名為四器若有慈則不得有悲喜捨心以是義故應四無減。",
        "translation": "Again, because they are vessels, they should be called four vessels. If there's kindness, then there can't be compassion, joy, and equanimity.",
        "source": "X36n0659_014:0547b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今明隨用有四豈逐行為三或言器是境。",
        "translation": "Now, we've explained that there are four according to function, don't we say that each practice is three? Or we might say that the container is the object.",
        "source": "X36n0659_014:0547b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以行分別下答第四據人利鈍難。",
        "translation": "Discriminating by practice, he answers the fourth difficult question, which is based on the sharpness and dullness of people.",
        "source": "X36n0659_014:0547b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以行分別故應有四若行慈時無悲喜捨是故有四。",
        "translation": "\"Good sons, it's because of the discrimination of actions that there should be four. If there's no compassion, joy, and equanimity when practicing kindness, then there are four.",
        "source": "X36n0659_014:0547b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲明雖有兩人而有四行不得為二。",
        "translation": "He wants to clarify that even though there are two people, the four practices can't be two.",
        "source": "X36n0659_014:0547b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以無量故下答第五名字難為二初列四章門次廣解釋。",
        "translation": "The answer to the fifth difficulty with names is twofold. First, he lists the four categories and then explains them in detail.",
        "source": "X36n0659_014:0547b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以無量故亦得名四夫無量者則有四種有無量心有緣非自在有無量心自在非緣有無量心亦緣亦自在有無量心非緣非自在。",
        "translation": "\"Good sons, it's because of immeasurability that we can also call the four [practitioners of] immeasurability.\" There are four kinds of immeasurable people: those who have immeasurable minds that have cognition and aren't self-contained, those who have immeasurable minds that are self-contained and aren't cognized, those who have immeasurable minds that are both cognized and self-contained, and those who have immeasurable minds that are neither cognized nor self-contained.",
        "source": "X36n0659_014:0547b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何等無量有緣非自在緣於無量無邊眾生而不能得自在三昧雖得不定或得或失何等無量自在非緣如緣父母兄弟姉妹欲令安樂非無量緣何等無量亦緣亦自在謂諸佛菩薩何等無量非緣非自在聲聞緣覺不能廣緣無量眾生亦非自在善男子以是義故名四無量非諸聲聞緣覺所知乃是諸佛如來境界善男子如是四事聲聞緣覺雖名無量少不足言諸佛菩薩乃得名為無量無量。",
        "translation": "What are the immeasurable conditions that are not self-contained, which are the condition of measureless and limitless sentient beings who can't attain self-contained samādhi even though it's attained indefinitely or attained or lost, what are the immeasurable self-contained and non-contained like the condition of parents, brothers, sisters, and desires for well-being that are not immeasurable, what are the immeasurable conditions that are also conditioned and self-contained that are not self-contained by buddhas and bodhisattvas, and what are the immeasurable conditions that are not self-contained by śrāvakas and pratyekbuddhas who can't extensively relate to measureless sentient beings and aren't self-contained?",
        "source": "X36n0659_014:0547b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲明無量尚有四句何妨得有四種無量。",
        "translation": "There are still four phrases that want to explain immeasurability, so why wouldn't there be four kinds of immeasurability?",
        "source": "X36n0659_014:0547b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛下第三領解如文。",
        "translation": "Kāśyapa then said to the Buddha, \"The third thing he understands is as explained in the text.",
        "source": "X36n0659_014:0547b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉菩薩白佛言世尊如是如是實如聖言諸佛如來所有境界非諸聲聞緣覺所及。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, this is so and so, indeed, just like the noble words say, the realms of buddhas and tathāgatas are beyond the reach of śrāvakas and pratyekbuddhas.",
        "source": "X36n0659_014:0547b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊頗有菩薩下第二明不次第即圓四心又二初料簡小慈次顯大慈此之大小小亦不小不可以凡夫為小二乘為大二乘為小菩薩為大何以故凡夫二乘俱不住於大涅槃故今以次第慈為小不次第慈為大此兩俱住大涅槃故有人以似為小真為大此亦不然次第似真俱小不次第似真俱大故簡小大有兩問答。",
        "translation": "Bhagavān, there are bodhisattvas who secondly explain that the four states of mind are not sequential, but rather two: the first is to show simple small compassion, the second is to show great compassion, which is small and small, and not small.",
        "source": "X36n0659_014:0547c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊頗有菩薩住於大乘大般涅槃得慈悲心非是大慈大悲心不。",
        "translation": "Bhagavān, could it be that there are bodhisattvas who abide in the great vehicle great extinction and attain the mind of compassion and not the mind of great kindness and compassion?",
        "source": "X36n0659_014:0547c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初問有菩薩住大涅槃有慈悲心非是大慈心不此正問次第梵行。",
        "translation": "The first question was: Is there a bodhisattva abiding in great nirvāṇa who has the mind of compassion and isn't it the mind of great compassion? This is the correct question about the sequential religious practice.",
        "source": "X36n0659_014:0547c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次佛答為三一唱有二釋有三結有初唱如文。",
        "translation": "Next, the Buddha answered in three ways: first, by singing, second, by explaining, and third, by concluding that there was a first singing as explained in the text.",
        "source": "X36n0659_014:0547c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言有。",
        "translation": "The Buddha says there is.",
        "source": "X36n0659_014:0547c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋有中二先出境次明觀。",
        "translation": "Second, he explained that there are two of them, first exiting and then clearly observing.",
        "source": "X36n0659_014:0547c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩若於諸眾生中三品分別一者所親二者怨憎三者中人於親人中復作三品謂上中下怨憎亦爾。",
        "translation": "\"Good sons, suppose a bodhisattva discerns three classes of sentient beings: one that's dear, two that's disliked, and three that's the middle person. Among those who are dear, he creates three more classes, which are superior, middling, and inferior, and so are disliked.",
        "source": "X36n0659_014:0547c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初境有九品怨親中人各有三品或謂中人唯一但七中人於我無怨無親不須開三一往如此然此中人不無愚智貴賤之殊故可分三便成九境即有九慈。",
        "translation": "In the first place, there are nine classes of people who dislike and hate the middle person, and there are three classes of people who are only like the middle person.",
        "source": "X36n0659_014:0547c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次是菩薩下正明修觀。",
        "translation": "Next, this is the bodhisattva who correctly explains the cultivation of contemplation.",
        "source": "X36n0659_014:0547c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於上親所與增上樂於中下親亦復平等與增上樂於上怨所與少分樂於中怨所與中品樂於下怨所與增上樂菩薩如是轉增修習於上怨所與中品樂於中下怨等與上樂轉復修習於上中下等與上樂若上怨所與上樂者爾時得名慈心成就菩薩爾時於其父母及上怨所得平等心無有差別。",
        "translation": "This bodhisattva-mahāsattva gives superior happiness to his higher relatives, and he also gives superior happiness to his middle and lower relatives equally.",
        "source": "X36n0659_014:0547c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若全未修但欲與其三親三樂三怨三苦三種中人不與苦樂若初修慈於三親中與三品樂於三中人與三品樂於三怨人上怨與下樂中怨與中樂下怨與上樂第二修時上怨與中樂中下兩怨與其上樂第三修時三怨併與上樂未是親中三種之樂第四修時即以中人下樂併與三怨第五修時以中人中樂併與三怨第六修時以中人上樂併與三怨第七修時以三親下樂併與三怨第八修時以三親中樂併與三怨第九修時以三親上樂併與三怨是名上怨與增上樂爾時得名慈心成就又直取二品樂與九種境初入觀時三親與三樂第二時中親與上樂下親與中樂第三時下親與上樂第四時下中人與下樂第五時下中人與中樂第六時下中人與上樂第七時上怨與下樂第八時上怨與中樂第九時上怨與上樂是名慈心或就今文中但略有四番入觀初番三親等與上樂此總三親以為一番別開三怨以為三番是菩薩若明修觀實有九品修習不同而今文中但明三品。",
        "translation": "若全未修但欲與其三親三樂三怨三苦三種中人不與苦樂若初修慈於三親中與三品樂於三中人與三品樂於三怨人上怨與下樂中怨與中樂下怨與上樂第二修時上怨與中樂中下兩怨與其上樂第三修時三怨併與上樂未是親中三種之樂第四修時即以中人下樂併與三怨第五修時以中人中樂併與三怨第六修時以中人上樂併與三怨第七修時以三親下樂併與三怨第八修時以三親中樂併與三怨第九修時以三親上樂併與三怨是名上怨與增上樂爾時得名慈心成就又直取二品樂與九種境初入觀時三親與三樂第二時中親與上樂下親與中樂第三時下親與上樂第四時下中人與下樂第五時下中人與中樂第六時下中人與上樂第七時上怨與下樂第八時上怨與中樂第九時上怨與上樂是名慈心或就今文中但略有四番入觀初番三親等與上樂此總三親以為一番別開三怨以為三番是菩薩若明修觀實有九品修習不同而今文中但明三品。",
        "source": "X36n0659_014:0548a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是名得慈下第三結有。",
        "translation": "\"Good sons, this is called attaining kindness. Here's the third conclusion of existence.",
        "source": "X36n0659_014:0548b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是名得慈非大慈也。",
        "translation": "\"Good sons, this is called attaining kindness, not great kindness.",
        "source": "X36n0659_014:0548b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊何緣下是第二番亦先問次答。",
        "translation": "What are the Bhagavān's conditions for this second statement, which also begins with a question and ends with an answer?",
        "source": "X36n0659_014:0548b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊何緣菩薩得如是慈猶故不得名為大慈。",
        "translation": "\"Bhagavān, what are the conditions for a bodhisattva to attain this kind of kindness and still not be called great kindness?",
        "source": "X36n0659_014:0548b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答為三一唱難成二釋三結初文唱。",
        "translation": "The answer is three: first, they sing about the difficulty of attaining it; second, they explain it; and third, they conclude by singing the first verse.",
        "source": "X36n0659_014:0548b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以成難故不名大慈。",
        "translation": "\"Good sons, it's because it's difficult to achieve that it can't be called great compassion.",
        "source": "X36n0659_014:0548b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次何以故下釋先法。",
        "translation": "Next, why is it so?\" He explains the prior teaching.",
        "source": "X36n0659_014:0548b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故久於過去無量劫中多集煩惱未修善法是故不能於一日中調伏其心。",
        "translation": "Why is it that over the course of measureless eons in the past, many afflictions were accumulated and good qualities weren't cultivated, and therefore they weren't able to control their minds in a single day?",
        "source": "X36n0659_014:0548b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次譬。",
        "translation": "Next, he explains the parable.",
        "source": "X36n0659_014:0548b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子譬如豌豆乾時錐刺終不可著諸煩惱堅亦復如是雖一日夜繫心不散難可調伏又如家犬不畏於人山林野鹿見人怖走瞋恚難去如守家狗慈心易失如彼野鹿是故此心離可調伏以是義故不名大慈復次善男子譬如畫石其文常在畫水速滅勢不久住瞋恚難除譬如畫石善根易滅猶如畫水是故此心難得調伏如大火聚其明久住電光之明不得暫停瞋如火聚慈如電明是故此心難得調伏。",
        "translation": "Good sons, it's like a pea that's dry, pricked, and never attached to the afflictions.",
        "source": "X36n0659_014:0548b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡舉四譬如文惑強慈弱不得名大達惑慈成方名大慈。",
        "translation": "Where four things are cited like the text, confusion is strong and kindness is weak, it can't be called great penetration, and only when confusion and kindness are complete is it called great kindness.",
        "source": "X36n0659_014:0548b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義下第三結。",
        "translation": "The third conclusion below is based on this meaning.",
        "source": "X36n0659_014:0548b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故不名大慈。",
        "translation": "Because of this meaning, it's not called great kindness.",
        "source": "X36n0659_014:0548b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩住初地下是第二顯大明圓四心方是大慈文為二一明大慈二明虗實初大慈又三一正明大慈二明兼用三明善本初正明大慈又三謂唱釋結初唱如文。",
        "translation": "Good sons, the bodhisattva abides in the first ground level, and the second shows that the four perfections of mind are great compassion. The text is twofold: one shows great compassion, and the second shows the first great compassion in detail.",
        "source": "X36n0659_014:0548b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩住於初地名曰大慈。",
        "translation": "\"Good sons, the bodhisattvas, the great beings, and the great compassionate beings who abide in the first ground are called great compassionate beings.",
        "source": "X36n0659_014:0548c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以故善男子最極惡者名一闡提初住菩薩修大慈時於一闡提心無差別不見其過故不生瞋。",
        "translation": "Why is that, good sons? The most extreme evil is called icchantika. When first-abiding bodhisattvas cultivate great kindness, they don't discriminate between the minds of the icchantika and don't see their faults; therefore, they don't become angry.",
        "source": "X36n0659_014:0548c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋中意者上來於上怨與上樂未於闡提與其上樂今此圓慈緣於闡提但見實相不見其過故不生瞋方是大慈。",
        "translation": "Next, in the explanation, the person's intention is that the previous one was to hold resentments and give happiness to the superior one but not to the accomplished one and give happiness to the superior one.",
        "source": "X36n0659_014:0548c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三結如文。",
        "translation": "The three conjugations are as explained in the text.",
        "source": "X36n0659_014:0548c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故得名大慈。",
        "translation": "It's for this reason that they're called great compassion.",
        "source": "X36n0659_014:0548c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子為諸眾生下是第二明慈兼用者。",
        "translation": "\"Good sons, here's the second explanation of the combined application of kindness for the sake of sentient beings.",
        "source": "X36n0659_014:0548c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子為諸眾生除無利益是名大慈欲與眾生無量利樂是名大悲於諸眾生心生歡喜是名大喜無所擁護名為大捨若不見我法相已身見一切法平等無二是名大捨自捨己樂施與他人是名大捨。",
        "translation": "Good sons, removing the lack of benefit for sentient beings is called great kindness. Desiring to give sentient beings measureless benefits and pleasures is called great compassion. To be joyous at heart and rejoice in sentient beings is called great joy, and having nothing to protect is called great equanimity.",
        "source": "X36n0659_014:0548c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若慈但與樂悲唯拔苦則非兼用今明慈亦拔苦悲亦與樂捨中亦二如文。",
        "translation": "If kindness only goes along with happiness and pity only removes suffering, then it's not both. Now, I'll explain that kindness also removes suffering, pity also goes along with happiness, and in equanimity there are also two as explained in the text.",
        "source": "X36n0659_014:0548c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯四無量心下第三明善本為三初為六度本。",
        "translation": "Only the four immeasurable states of mind are the third clarification of the good roots, the first of which is the root of the six perfections.",
        "source": "X36n0659_014:0548c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子唯四無量能令菩薩增長具足六波羅蜜其餘諸行不必能爾。",
        "translation": "Good sons, only the four immeasurable [minds] can cause a bodhisattva to grow and fully attain the six perfections, and the other practices don't need to be like that.",
        "source": "X36n0659_014:0549a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次為發心本。",
        "translation": "Next, we'll discuss the origin of arousal of mind.",
        "source": "X36n0659_014:0549a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩先得世間四無量心然後乃發阿耨多羅三藐三菩提心次第方得出世間者。",
        "translation": "Good sons, the bodhisattva Mahāsattva first attains the four immeasurable worldly states of mind and then arouses the mind of unsurpassed, correct, and complete enlightenment before he attains supramundane enlightenment.",
        "source": "X36n0659_014:0549a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三自相本。",
        "translation": "These three are the basis of their own characteristics.",
        "source": "X36n0659_014:0549a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子因世無量得出世無量以是義故名大無量。",
        "translation": "Good sons, it's because of worldly immeasurability that we can attain supramundane immeasurability.",
        "source": "X36n0659_014:0549a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛下第二明虗實開善謂為實觀亦先問次答問為三一奪難二縱難三遮難初奪難者又二先法次譬初法者。",
        "translation": "Kāśyapa said to the Buddha, \"The second thing he explained below was that the simple truth is well understood to be the true contemplation, which first asks and then answers three questions: first, to overcome a difficulty, second, to resolve a difficulty, and third, to resolve a difficulty.",
        "source": "X36n0659_014:0549a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉菩薩白佛言世尊除無利益與利樂者實無所為如是思惟即是虗觀無有實利。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, except for the absence of benefit and joy, there's really nothing to be gained from this kind of contemplation.",
        "source": "X36n0659_014:0549a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明雖欲拔苦實未拔苦皆是虗言雖欲與樂實不得樂此是假說。",
        "translation": "It's a false statement that although one wants to remove suffering, they really haven't removed suffering.",
        "source": "X36n0659_014:0549a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次舉譬顯。",
        "translation": "Next, he cites an example to show that.",
        "source": "X36n0659_014:0549a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊譬如比丘觀不淨時見所著衣悉是皮想而實非皮所可食啖皆作蟲想而實非蟲觀好美羮作穢汁想而實非穢觀所食酪猶如髓腦而實非腦觀骨粹粖猶如[麩-夫+酋]想而實非[麩-夫+酋]四無量心亦復如是不能真實利益眾生令其得樂雖口發言與眾生樂而實不得如是之觀非虗妄耶。",
        "translation": "Bhagavān, it's like a monk who observes impurity and sees that the clothes he's wearing are really skin and not skin, and that the things he eats and tastes are really thoughts of worms and not worms, and that the delicious drinks are really thoughts of dirty juice and not dirty, and that the cheese he eats is like marrow and brains and not brains, and that the bones are like [bran-fu+sheik] and the gathering is really not [bran-fu+sheik].",
        "source": "X36n0659_014:0549a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦如比丘作假想觀觀羮為穢而實非穢雖言與樂實不得樂。",
        "translation": "It's also like a monk who makes a false conception and observes that a drink is defiled but really isn't defiled even though he says it's pleasant and really can't be pleasant.",
        "source": "X36n0659_014:0549a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊若非虗妄下第二縱難。",
        "translation": "Bhagavān, if this isn't false, then the second difficulty arises.",
        "source": "X36n0659_014:0549a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世尊若非虗妄實與樂者彼諸眾生何故不以諸佛菩薩威德力故一切受樂。",
        "translation": "Bhagavān, if it's not false and enjoyable, then why don't all sentient beings experience happiness because of the authoritative power of the buddhas and bodhisattvas?",
        "source": "X36n0659_014:0549b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "縱有實益何以不見得安樂者若實與樂今佛菩薩無量無邊何以不見與眾生樂。",
        "translation": "Even if there were real benefit, why wouldn't they see well-being? If it were real well-being, then why wouldn't the buddhas and bodhisattvas now have measureless and limitless happiness to give to sentient beings?",
        "source": "X36n0659_014:0549b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當真實下第三遮難。",
        "translation": "If it should be true, then the third obstruction would be to stop it.",
        "source": "X36n0659_014:0549b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若當真實不得樂者如佛所說我念往昔唯修慈心經此劫世七反成壞不來此生世界成時生梵天中世界壞時生光音天若生梵天力勢自在無能摧伏於千梵中最勝最上名大梵王有諸眾生皆於我所生最上想三十六反作忉利王釋提桓因無量百千作轉輪王唯修慈心乃得如是人天果報若不實者云何得與此義相應。",
        "translation": "If it should be true that they don't attain happiness, then as the Buddha has said, I remember that in the past, I cultivated kindness alone, and after seven eons of formation and decay in this world, I won't come to be born in the Brahma Heaven when the world is formed, or in the Luminous Sound Heaven when it's decayed.",
        "source": "X36n0659_014:0549b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛若答言是虗無實如來亦由往昔行慈得為梵主最勝最上何得無益是故遮云不得無益故名遮難。",
        "translation": "If the Buddha answers that it's empty and insubstantial, then the Tathāgata also practiced kindness in the past and became the most excellent and supreme Brahmā, how could it be useless? Therefore, it's called a refutation because it's not useless.",
        "source": "X36n0659_014:0549b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次佛言善男子下答前三難初答遮難次答奪難三答縱難初答遮難為二先歎其遮。",
        "translation": "Next, the Buddha said, \"Good man, we'll answer the first three difficulties.\" First, we'll answer the difficulty of refuting, then we'll answer the difficulty of plundering, and third, we'll answer the difficulty of vertical refutation.\" The first answer to the difficulty of refuting is twofold: first, we'll praise him for refuting.",
        "source": "X36n0659_014:0549b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善哉善哉善男子汝真勇猛無所畏懼。",
        "translation": "The Buddha said, \"Good, good, good sons, you're really brave and fearless.",
        "source": "X36n0659_014:0549b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次正答答中四偈為三初一行明大慈。",
        "translation": "The next correct answer consists of four verses, the first of which is a line explaining great compassion.",
        "source": "X36n0659_014:0549b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即為迦葉而說偈言。",
        "translation": "He spoke a verse for Kāśyapa, saying.",
        "source": "X36n0659_014:0549b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若於一眾生　　不生瞋恚心　　而願與彼樂　是名為慈善次一行大悲。",
        "translation": "\"If you don't become angry with a sentient being and wish to give them happiness, this is called charity. The second line is about great compassion.",
        "source": "X36n0659_014:0549b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切眾生中　　若起於悲心　　是名聖種性　得福報無量三兩行格量。",
        "translation": "If someone among all sentient beings arouses the mind of compassion, this is called the noble lineage that obtains measureless merit and rewards.",
        "source": "X36n0659_014:0549b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　設使五通仙　　悉滿此大地　　有大自在主　奉施其所安　　象馬種種物　　所得福報果　不及修一慈　　十六分中一實能與樂功德無量。",
        "translation": "Suppose there were a great sovereign of the five powers who completely filled this great land, a great sovereign who bestowed his peace, elephants, horses, and various things, and the result of the merit gained wasn't as great as cultivating a single act of kindness. One of the sixteen parts of the equation really brings joy and immeasurable virtue.",
        "source": "X36n0659_014:0549c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子夫修慈心下二答奪難又二初唱真實。",
        "translation": "Good sons, suppose someone cultivates kindness, followed by two answers to difficult questions. The first two are called true.",
        "source": "X36n0659_014:0549c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子夫修慈者實非妄想諦是真實若是聲聞緣覺之慈是名虗妄諸佛菩薩真實不虗。",
        "translation": "\"Good sons, someone who cultivates kindness is really not deluded in their perceptions; the truth is that if this were the kindness of śrāvakas and pratyekbuddhas, it would be called false and unsubstantial; the truth of the buddhas and bodhisattvas is not false.",
        "source": "X36n0659_014:0549c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故舉聲聞假想之悲顯菩薩是實。",
        "translation": "Therefore, citing the śrāvakas' imaginary compassion shows that the bodhisattvas are real.",
        "source": "X36n0659_014:0549c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何知耶第二廣明是實又五一實能轉境二實能治惑三實能善本四實能徧諸法五實不可思議初為三一唱二釋三結初如文。",
        "translation": "How do we know it? The second extensive explanation of this reality is fivefold: one reality that transforms objects, two realities that correct afflictions, three realities that are well founded, four realities that pervade all dharmas, and five realities that are inconceivable. The beginning is divided into three: a call, two explanations, and three conclusions.",
        "source": "X36n0659_014:0549c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何知耶。",
        "translation": "\"How do we know this?",
        "source": "X36n0659_014:0549c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩修行如是大涅槃者觀土為金觀金為土地作水相水作地相水作火相火作水相地作風相風作地相隨意成就無有虗妄觀實眾生為非眾生觀非眾生為實眾生悉隨意成無有虗妄。",
        "translation": "Good sons, when a bodhisattva-mahāsattva cultivates such great nirvāṇa, he observes that earth becomes gold, observes that gold becomes the characteristics of earth, and observes that water becomes the characteristics of water, water becomes the characteristics of earth, water becomes the characteristics of fire, fire becomes the characteristics of water, earth becomes the characteristics of wind, wind becomes the characteristics of earth, and accomplishes them as he wishes without any delusion.",
        "source": "X36n0659_014:0549c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中意者解此有二一實能轉境二但能令見若轉金為土則可實轉若令眾生為非眾生但能令見一師云經云能成云何二解菩薩非但能轉金成土亦轉眾生成非眾生非眾生者即是草木轉非眾生成於眾生若言眾生本來虗妄無所有者當知眾生有非眾生若言諸法有安樂性即非眾生亦是眾生情與無情有性無性准此可知私問若眾生與非眾生實更互轉情作無情無情作情是義難信若不實轉聖力徒施總而言之只是諸佛菩薩自既依正不二而二二而不二能令眾生亦復如是此則永轉若暫轉者不無斯義亦令轉者不自覺知況復慈即如來如來即慈慈即佛性佛性即諸法敬請後德思之思之。",
        "translation": "Those who explain the meaning of this explanation understand that there are two things: one is actually able to change objects, and the other is simply able to cause views. If one changes gold into earth, then one can actually change it, and if one causes sentient beings to become non-sentient beings, then what are the two things that the sūtras say can be accomplished? Not only can the bodhisattva change gold into earth, but he can also change sentient beings into non-sentient beings.",
        "source": "X36n0659_014:0550a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子當知菩薩四無量心是實思惟非不真實。",
        "translation": "Good sons, you should know that the bodhisattva's four immeasurable states of mind are really contemplated and not untrue.",
        "source": "X36n0659_014:0550a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子下第二明實能治惑又三謂唱釋結。",
        "translation": "Furthermore, good sons, the second clarification is that they really correct mental disturbances, and there are three more explanations of the knot.",
        "source": "X36n0659_014:0550a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子云何名為真實思惟謂能斷除諸煩惱故。",
        "translation": "\"Furthermore, good sons, what's called true contemplation that removes the afflictions?",
        "source": "X36n0659_014:0550a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子夫修慈者能斷貪欲修悲心者能斷瞋恚修喜心者能斷不樂修捨心者能斷貪恚及眾生相。",
        "translation": "Good sons, someone who cultivates kindness can stop desire, someone who cultivates compassion can stop anger, someone who cultivates joy can stop unhappiness, and someone who cultivates equanimity can stop craving and the characteristics of sentient beings.",
        "source": "X36n0659_014:0550a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義故名真實思惟。",
        "translation": "Because of this meaning, it's called true contemplation.",
        "source": "X36n0659_014:0550a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊云四等但是功德猗樂相伏非究竟斷此中四等即是般若即是能斷。",
        "translation": "The old saying is that the four equal qualities are merely merits, abiding in comfort, and not ultimate cessation.",
        "source": "X36n0659_014:0550a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子四無量下第三明實為善本又二先明能為大乘善本次明能為三乘善本初又二初明通為一切善本次明能為布施之本初文可見。",
        "translation": "Furthermore, good sons, under the four immeasurables, the third clarification is that they are really the roots of goodness, and there are two more. The first clarifies that they are capable of being the roots of great vehicle goodness, and the second clarifies that they are capable of being the roots of samādhi goodness.",
        "source": "X36n0659_014:0550a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩四無量心能為一切諸善根本。",
        "translation": "\"Furthermore, good sons, the bodhisattvas, the four immeasurable states of mind, can be the root of all goodness.",
        "source": "X36n0659_014:0550b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩下二偏明為布施之本又五一正施本二無相為得三有相為失四明一心即四心五廣發誓願。",
        "translation": "Good sons, bodhisattvas, the next two partially explain what constitutes the root of generosity, and there are five more: first, the root of right charity, second, marklessness as attainment, third, marklessness as loss, fourth, understanding that one mind is four minds, and fifth, making a broad vow.",
        "source": "X36n0659_014:0550b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩若不得見貧窮眾生無緣生慈若不生慈則不能起慧施之心以施因緣令諸眾生得安隱樂所謂飲食車乘衣服華香牀臥舍宅燈明。",
        "translation": "Good sons, if the bodhisattva Mahāsattva doesn't see poor sentient beings without conditions to give rise to kindness, then he can't give rise to the mind of wisdom and generosity that causes and conditions for giving to cause sentient beings to attain peace and happiness, such as food and drink, chariots and vehicles, clothing, flowers, incense, beds, bed and bedding, homes, and lamps and lights.",
        "source": "X36n0659_014:0550b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初明施本舉八事為下八事作本。",
        "translation": "The first explains the basis of generosity, citing eight things as the basis for the next eight things.",
        "source": "X36n0659_014:0550b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是施時下第二明無相為得又三初總次別三結初總如文。",
        "translation": "When thus giving alms, the second thing he explains is that it's obtained without marks. There are three generalizations, followed by three specific conclusions.",
        "source": "X36n0659_014:0550b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是施時心無繫縛不生貪著必定迴向阿耨多羅三藐三菩提。",
        "translation": "\"When he thus gives alms, his mind has no fetters, doesn't become addicted, and definitely returns to unsurpassed, correct, and complete enlightenment.",
        "source": "X36n0659_014:0550b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其心爾時無所依止妄想永斷不為怖畏名稱利養不求人天所受快樂不生憍慢不望反報不為誑他故行布施不求富貴凡行施時不見受者持戒破戒是田非田此是知識此非知識施時不見是器非器不擇日時是處非處亦復不計饑饉豐樂不見因果此是眾生此非眾生是福非福。",
        "translation": "At that point, his mind has no basis for deluded perceptions, is permanently stopped, isn't frightened of fame and profit, doesn't seek the pleasures of humans and gods, doesn't become proud, doesn't expect a counter-reward, and doesn't practice giving without seeking wealth and riches. When he gives alms, he doesn't see that the recipient is observing precepts and breaking precepts.",
        "source": "X36n0659_014:0550b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次別中云不見因果者施時是因得報是果得果是常不得是斷菩薩皆不作如此施。",
        "translation": "When they give alms, it's cause that obtains reward, it's effect that obtains result that's permanent and not obtained, and it's stopped.",
        "source": "X36n0659_014:0550b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三雖復下結如文。",
        "translation": "Third, although it's furthermore the same as the above, the conclusion follows.",
        "source": "X36n0659_014:0550b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雖復不見施者受者及以財物乃至不見斷及果報而常行施無有斷絕。",
        "translation": "Even though he doesn't see the donor or recipient and gives them property, and even though he doesn't see the stoppage and the result, he always gives without cutting off the result.",
        "source": "X36n0659_014:0550b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩若見下第三明有相為失為三法譬合法如文。",
        "translation": "Good sons, suppose a bodhisattva sees that the third thing he's done is to explain that there are three metaphors for loss, just as the text says.",
        "source": "X36n0659_014:0550c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩若見持戒破戒乃至果報終不能施若不布施則不具足檀波羅蜜若不具足檀波羅蜜則不能成阿耨多羅三藐三菩提。",
        "translation": "Good sons, if a bodhisattva sees that observing precepts and breaking precepts ... and their rewards are never given, then he doesn't fully attain the perfection of the perfection of giving.",
        "source": "X36n0659_014:0550c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子譬如有人身被毒箭其人眷屬欲令安隱為除毒故即命良醫而為拔箭彼人方言且待莫觸我今當觀如是毒箭從何方來誰之所射為是剎利婆羅門毗舍首陀復更作念是何木耶竹耶柳耶其鏃鐵者何冶所出剛耶柔耶其毛羽者是何鳥翼烏鴟鷲耶所有毒者為從作生自然而有為是人毒惡蛇毒耶如是癡人竟未能知尋便命終。",
        "translation": "That person then says, \"Wait here, don't touch me. Now, I will examine this poisoned arrow and see where it came from. Who shot it? Is it a warrior, bamboo, willow, or iron? What metal is it that's hard, rigid, or soft? What bird, winged, or crow, or kite? Is it poisonous to humans, vipers, or snakes?\" Such a foolish man doesn't even know it, and then he dies.",
        "source": "X36n0659_014:0550c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "譬中人譬淺行菩薩箭譬慳起眷屬請醫譬知識勸施言且待者譬不肎時施我當觀者取相分別毒箭誰射譬分別福田若持若犯何箭竹柳譬分別施物何物可捨何物不可所有毒者譬執施之人竟不知施而命終者既不得施為慳所蔽斷善根命。",
        "translation": "The metaphor of the person metaphorically speaking is the shallow-practicing bodhisattva's arrow metaphorically speaking, and the stingy person's retinue asks the doctor metaphorically speaking, and the friend exhorts him to give, saying, \"Wait!\" metaphorically speaking, \"I won't give until the time comes.\" He'll examine the person's ability to discern the characteristics of the field of merit, whether it's maintained or violated, and the poisonous arrow metaphorically speaking, \"The bamboo and willow metaphorically speaking,\" discerns what to give, what can be discarded, and what can't. The poisonous person metaphorically speaking, \"The person who takes the gift doesn't even know it's given, but his life ends.",
        "source": "X36n0659_014:0550c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "合譬如文。",
        "translation": "It's like the preceding sentence.",
        "source": "X36n0659_014:0551a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩亦爾若行施時分別受者持戒破戒乃至果報終不能施若不能施則不具足檀波羅蜜若不具足檀波羅蜜則不能成阿耨多羅三藐三菩提。",
        "translation": "\"Good sons, bodhisattvas too, when they practice generosity, discriminate between recipients who uphold the precepts and those who violate the precepts, even to the point where the result is ultimately ungivable. If they can't give, then they don't fully possess the perfection of giving, and if they don't fully possess the perfection of giving, then they can't achieve unsurpassed, correct, and complete enlightenment.",
        "source": "X36n0659_014:0551a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子下第四一心即四顯圓慈相。",
        "translation": "Furthermore, good sons, the fourth aspect of unity of mind is the four manifestations of the mark of perfect compassion.",
        "source": "X36n0659_014:0551a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩行布施時於諸眾生慈心平等猶如子想又行施時於諸眾生起悲憫心譬如父母瞻視病子行施之時其心歡喜猶如父母見子病愈既施之後其心放捨猶如父母見子長大能自存活。",
        "translation": "Furthermore, when the bodhisattva-mahāsattva practices generosity, he's compassionate toward sentient beings like a parent who looks at a sick child and rejoices when he gives generosity, just as a parent who sees their child recovering from illness and then gives generosity and lets go of it, just as a parent who sees their child growing up and being able to survive on his own.",
        "source": "X36n0659_014:0551a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "明行施時具有四等施時生慈及以起悲施時心喜施已是捨。",
        "translation": "When practicing generosity, he has four ways of being compassionate when he gives, and his mind is joyous when he gives and equanimous when he gives.",
        "source": "X36n0659_014:0551a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩於慈心中下第五廣發誓願凡有八重初明施食乃至燈明初三如文。",
        "translation": "The fifth vow that the bodhisattva makes in his compassionate mind has eight parts, beginning with an explanation of food donation and ending with a lamp.",
        "source": "X36n0659_014:0551a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是菩薩摩訶薩於慈心中布施食時常作是願我今所施悉與一切眾生共之以是因緣令諸眾生得大智食勤進迴向無上大乘願諸眾生得善智食不求聲聞緣覺之食願諸眾生得法喜食不求愛食願諸眾生悉得般若波羅蜜食皆令充滿攝取無閡增上善根願諸眾生解達空相得無閡身猶如虗空願諸眾生常為受者憐憫一切為眾福田善男子菩薩摩訶薩修慈心時凡所施食應當堅發如是等願。",
        "translation": "When the bodhisattva Mahāsattva gives food in a compassionate mind, he always makes this vow: 'Now, what I give will be shared with all sentient beings.' May this be the cause and condition that causes sentient beings to attain food of great wisdom, diligently dedicate themselves to the unsurpassed great vehicle, may sentient beings attain food of good wisdom and not seek food of the direct disciples and solitary realizers, may sentient beings attain food of joy in the Dharma and not seek food of desire, may all sentient beings attain food of prajñāpāramitā, and may all be filled with the good roots that bring in no hindrance, may sentient beings understand the marks of emptiness and attain a body without hindrances, and may sentient beings always be recipients of compassion for all beings and be a field of merit for all.",
        "source": "X36n0659_014:0551a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩於慈心中布施漿時常作是願我今所施悉與一切眾生共之以是因緣令諸眾生趣大乘河飲八味水速履無上菩提之道離於聲聞緣覺枯竭渴仰志求無上佛乘斷煩惱渴渴仰法味離生死愛愛樂大乘大般涅槃具足法身得諸三昧入於甚深智慧大海願諸眾生得甘露味菩提出世離欲寂靜如是諸味願諸眾生具足無量百千法味具法味已得見佛性見佛性已能雨法雨雨法雨已佛性徧覆猶如虗空復令其餘無量眾生得一法味所謂大乘非諸聲聞辟支佛味願諸眾生得一甜味無有六種差別之味願諸眾生唯求法味無閡佛法所行之味不求餘味善男子菩薩摩訶薩於慈心中布施漿時應當堅發如是等願。",
        "translation": "Furthermore, good sons, when the bodhisattva Mahāsattva gives milk in a compassionate mind, he always makes this vow that what I give now will be shared with all sentient beings. Because of this cause and condition, sentient beings will be led to the river of the great vehicle, drink the eight flavored waters, and quickly fulfill the path to unsurpassed enlightenment, free from the withering thirst of direct disciples and solitary realizers, and aspire to the unsurpassed Buddha vehicle, cutting off affliction, thirst, and longing for the taste of the Dharma, free from craving for birth-and-death, craving, and happiness, the great vehicle, parinirvāṇa, and the perfected Dharma body, attaining samādhi, and entering the ocean of profound wisdom, may sentient beings attain the taste of ambrosia, enlightenment, transcendence, freedom from desire, and quiescence, and so forth.",
        "source": "X36n0659_014:0551a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩於慈心中施車乘時常作是願我今所施悉與一切眾生共之以是因緣普令眾生成於大乘得住大乘不退於乘不動轉乘金剛座乘不求聲聞辟支佛乘向於佛乘無能伏乘無羸乏乘不退沒乘無上乘十力乘大功德乘未曾有乘希有乘難得乘無邊乘知一切乘善男子菩薩摩訶薩於慈心中施車乘時常應如是堅發誓願。",
        "translation": "Furthermore, good sons, when the bodhisattva Mahāsattva gives chariot rides in his compassionate mind, he always makes this vow: \"Now, what I give will all be shared with all sentient beings. As a result, all sentient beings will attain abiding in the great vehicle, not regressing from it, not changing from it, riding the adamantine seat vehicle, not seeking the vehicle of the śrāvakas and solitary realizers, and heading for the Buddha vehicle, the incapable vehicle, the unwavering vehicle, the nonretrogressing vehicle, the unsurpassed vehicle, the ten powers, the great merit vehicle, the unprecedented vehicle, the rare vehicle, the difficult to attain vehicle, the limitless vehicle, and knowing all vehicles. Good sons, when the bodhisattva Mahāsattva gives chariot rides in his compassionate mind, he should always make this vow resolutely.",
        "source": "X36n0659_014:0551b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩於慈心中布施衣時常作是願我今所施悉與一切眾生共之以是因緣令諸眾生得慚愧衣法界覆身裂諸見衣衣服離身一尺六寸得金色身所受諸觸柔耎無閡光色潤澤皮膚細耎常光無量無色離色願諸眾生皆悉普得無色之身過一切色得入無色大般涅槃善男子菩薩摩訶薩布施衣時應當如是堅發誓願。",
        "translation": "Furthermore, good sons, when the bodhisattva Mahāsattva gives garments in a compassionate mind, he always makes this vow: \"Now, what I give will be shared with all sentient beings. As a result, sentient beings will attain the garment of conscience, which covers the body with the Dharma realm and tears apart the garments that are seen.",
        "source": "X36n0659_014:0551b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第四施衣云離身一尺六寸者一依理云裂諸見衣除十六知見二依事云面各四寸即一尺六寸。",
        "translation": "The fourth garment that's given is said to be 1 foot 6 inches free from the body. 1. according to principle, it's said to divide the garments of views and remove the 16 cognitive views. 2. according to fact, it's said to be 4 inches on each side, which is 1 foot 6 inches.",
        "source": "X36n0659_014:0551c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩於修慈中布施華香塗香粖香諸雜香時常作是願我今所施悉與一切眾生共之以是因緣令諸眾生一切皆得佛華三昧七覺妙鬘繫其首頂願諸眾生形如滿月所見諸色微妙第一願諸眾生皆成一相百福莊嚴願諸眾生隨意得見可意之色願諸眾生常遇善友得無閡香離諸臭穢願諸眾生具諸善根無上珍寶願諸眾生相視和悅無有憂苦咸備眾善不相憂念願諸眾生戒香具足願諸眾生持無閡戒香氣芬馥充滿十方願諸眾生得堅牢戒無悔之戒一切智戒離諸破戒悉得無戒未曾有戒無師戒無作戒無穢戒無汙染戒竟已戒究竟戒平等戒塗割善惡等無憎愛願諸眾生得無上戒大乘之戒非小乘戒願諸眾生悉得具足尸波羅蜜猶如諸佛所成就戒願諸眾生悉為布施持戒忍辱精進禪智之所熏修願諸眾生悉得成就大般涅槃微妙蓮華其華香氣充滿十方願令眾生純食大乘大般涅槃無上香膳如蠭采華但取香味願諸眾生悉得成就無量功德所熏之身善男子菩薩摩訶薩於慈心中施華香時常當堅發如是誓願。",
        "translation": "Furthermore, when the bodhisattva-mahāsattva cultivates kindness and gives floral incense, coated incense, and miscellaneous incense, he always makes this vow that what I give now will be shared with all sentient beings. May this be the cause and condition that causes all sentient beings to attain the Buddha-flower samādhi, the seven awakenings, and the wonderful garland that ties the top of their heads.",
        "source": "X36n0659_014:0551c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第五施華香中云無戒者是無戒之戒非是不受及受不得之無華嚴云如虗空戒無所依戒大集云無所住戒見住戒非故言無作戒者非是非色非心之無作乃是此戒不作生死涅槃之戒餘三如文。",
        "translation": "The fifth offering of flowers and incense says that the absence of precepts is the absence of precepts, not the absence of acceptance or acceptance that's not obtained, or the absence of the Huayan precept that's like space, the absence of a basis, or the Daji precept that has no basis, or the absence of an abode, or the view that the abode is not a precept.",
        "source": "X36n0659_014:0551c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩於慈心中施牀敷時常作是願我今所施悉與一切眾生共之以是因緣令諸眾生得天中天所臥之牀得大智慧坐四禪處臥於菩薩所臥之牀不臥聲聞辟支佛牀願諸眾生得安樂臥離生死牀成大涅槃師子臥牀願諸眾生坐此牀已復為其餘無量眾生示現神通師子遊戲願諸眾生住此大乘大宮殿中為諸眾生演說佛性願諸眾生坐無上牀不為世法之所降伏願諸眾生得忍辱牀離於生死饑饉凍餓願諸眾生得無畏牀永離一切煩惱怨賊願諸眾生得清淨牀專求無上正真之道願諸眾生得善法牀常為善友之所擁護願諸眾生得右脅臥牀依因諸佛所行之法善男子菩薩摩訶薩於慈心中施牀敷時應當堅發如是誓願。",
        "translation": "Furthermore, good sons, when the bodhisattva Mahāsattva spreads out a bed in his compassionate mind, he always makes this vow that what I give now will be shared with all sentient beings. As a result, sentient beings will attain the bed on which the god of gods sleeps, attain great wisdom, sit in the four abodes of meditation, and sleep on the bed on which bodhisattvas sleep, not on the bed on which śrāvakas and solitary buddhas sleep.",
        "source": "X36n0659_014:0552a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩於慈心中施舍宅時常作是願我今所施悉與一切眾生共之以是因緣令諸眾生處大乘舍修行善友所行之行修大悲行六波羅蜜行大正覺行一切菩薩所行道行無邊廣大如虗空行願諸眾生皆得正念遠離惡念願諸眾生悉得安住常樂我淨永離四倒願諸眾生悉皆受持出世文字願諸眾生必為無上一切智器願諸眾生悉皆得入甘露法舍願諸眾生初中後心常入大乘涅槃之宅願諸眾生於未來世常處菩薩所居宮殿善男子菩薩摩訶薩於慈心中施舍宅時常當堅發如是誓願。",
        "translation": "Furthermore, good sons, when the bodhisattva Mahāsattva gives a dwelling in a compassionate mind, he always makes this vow that what I give now will be shared with all sentient beings. As a result, sentient beings will be placed in great vehicle abodes, cultivate the practices of good friends, cultivate the practice of great compassion, the six perfections, the practice of great correct awakening, and the practice of all the paths practiced by bodhisattvas, which is limitless and vast like the vastness of space. May all sentient beings attain right mindfulness and be free of bad mindfulness.",
        "source": "X36n0659_014:0552a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子菩薩摩訶薩於慈心中施燈明時常作是願我今所施悉與一切眾生共之以是因緣令諸眾生光明無量安住佛法願諸眾生常得照明願諸眾生得色微妙光澤第一願諸眾生其目清淨無諸翳網願諸眾生得大智炬善解無我無眾生相無人無命願諸眾生皆得覩見清淨佛性猶如虗空願諸眾生肉眼清淨徹見十方恒沙世界願諸眾生得佛光明普照十方願諸眾生得無閡明皆悉得見清淨佛性願諸眾生得大智明破一切闇及一闡提願諸眾生得無量光普照無量諸佛世界願諸眾生然大乘燈離二乘錠願諸眾生所得光明滅無明闇過逾千日願諸眾生得火珠明悉滅三千大千世界所有黑闇願諸眾生具足五眼悟諸法相成無師覺願諸眾生無見無明願諸眾生悉得大乘大般涅槃微妙光明示悟眾生真實佛性善男子菩薩摩訶薩於慈心中施燈明時常應堅發如是誓願。",
        "translation": "Furthermore, good sons, when the bodhisattva Mahāsattva gives a lamp in his compassionate mind, he always makes this vow that what I give now will be shared with all sentient beings.",
        "source": "X36n0659_014:0552b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子一切聲聞下第二為三乘本又三初明三乘次一切法三總結以此章用慈攝一切法無法不徧圓慈之義轉更明顯然善本者即是利他利他之中慈悲最勝初文即是三乘。",
        "translation": "Shanshan all śrāvakas, the second below, is the root of the three vehicles, which are three more. First, it explains the three vehicles, then all dharmas, and third, it summarizes this chapter, which uses kindness to gather all dharmas, making it impossible not to pervade them all and further clarify the meaning of perfect kindness.",
        "source": "X36n0659_014:0552b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子一切聲聞緣覺菩薩諸佛如來所有善根慈為根本。",
        "translation": "\"Good sons, all śrāvakas, pratyekbuddhas, buddhas, and tathāgatas have good roots, and kindness is their root.",
        "source": "X36n0659_014:0552c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩摩訶薩下第二別列一切法。",
        "translation": "The second thing below bodhisattva-mahāsattva is to list all the dharmas separately.",
        "source": "X36n0659_014:0552c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩修習慈心能生如是無量善根所謂不淨出息入息無常生滅四念處七方便三觀處十二因緣無常等觀煗法頂法忍法世第一法見道修道正勤如意諸根諸力七菩提分八道四禪四無量心八解脫八勝處十一切入空無相願無爭三昧知他心智及諸神通知本際智聲聞智緣覺智菩薩智佛智善男子如是等法慈為根本。",
        "translation": "Good sons, the bodhisattva Mahāsattva cultivates kindness that produces these measureless good roots, which are called impurity, inspiration, breath, impermanence, arising and ceasing, the four abodes of mindfulness, the seven skillful means, the three abodes of contemplation, the twelve causal conditions, impermanence, and so forth.",
        "source": "X36n0659_014:0552c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不淨與出入息即是二甘露門七方便者數師云一不淨二別相三總相四煗五頂六忍七世第一論師云一色苦二色集三色滅四色道五色過六色味七色出三觀處者謂苦無常無我此小乘名若大乘者觀十二因緣苦業煩惱以為三觀又瓔珞經明三觀者二諦觀平等觀中道第一義觀(云云)無諍有三解一云慈心成故無諍二云空解明故無諍三云隨心覺照與物不諍本際智者二解一空解為本際故阿若憍陳如名了本際二以邊際智緣延促自在為本際智。",
        "translation": "The unclean and in-and-out breaths are the two wisdoms, and the seven skillful means are described by the number masters as one unclean, two distinct, three general, four coarse, five top, six tolerant, and seven worldly first masters as one form, suffering, two form, arising, three form, cessation, four form, path, five form, transgressions, six tastes, and seven forms, which are the three contemplative positions, namely, suffering, impermanence, and no-self, which are the names of the lesser vehicle and the greater vehicle, which are the three contemplations of the twelve causes and conditions of suffering, actions, and afflictions.",
        "source": "X36n0659_014:0552c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以是義下第三總結。",
        "translation": "The third conclusion below is based on this meaning.",
        "source": "X36n0659_014:0552c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以是義故慈是真實非虗妄也若有人問誰是一切諸善根本當言慈是以是義故實非虗妄。",
        "translation": "\"Good sons, it's because of this meaning that kindness is real and not false. If someone asks who are the roots of all goodness, they should say that kindness is because of this meaning that it's really not false.",
        "source": "X36n0659_014:0552c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子能為善者下是第四實徧即是諸善亦是徧於一切善法明圓慈轉顯又二先明即大乘諸善一十五句次明即小乘諸善有十六句。",
        "translation": "Good sons, those who can do good deeds are the fourth real universal, that is, the good deeds are universal in all the good dharmas, and the manifestation of perfect kindness is twofold.",
        "source": "X36n0659_014:0552c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子能為善者名實思惟實思惟者即名為慈慈即如來慈即大乘大乘即慈慈即如來善男子慈即菩提道菩提道即如來如來即慈善男子慈即大梵大梵即慈慈即如來善男子慈者能為一切眾生而作父母父母即慈慈即如來善男子慈者乃是不可思議諸佛境界不可思議諸佛境界即是慈也當知慈者即是如來善男子慈者即是眾生佛性如是佛性久為煩惱之所覆蔽故令眾生不得覩見佛性即慈慈即如來善男子慈即大空大空即慈慈即如來。",
        "translation": "Good sons, those who can do good are called truly contemplating.",
        "source": "X36n0659_014:0553a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子慈即虗空虗空即慈慈即如來善男子慈即是常常即是法法即是僧僧即是慈慈即如來善男子慈即是樂樂即是法法即是僧僧即是慈慈即如來善男子慈即是淨淨即是法法即是僧僧即是慈慈即如來善男子慈即是我我即是法法即是僧僧即是慈慈即如來善男子慈即甘露甘露即慈慈即佛性佛性即法法即是僧僧即是慈慈即如來善男子慈者即是一切菩薩無上之道道即是慈慈即如來善男子慈者即是諸佛世尊無量境界無量境界即是慈也當知是慈即是如來。",
        "translation": "Good sons, kindness is space, and space is kindness, which is the Tathāgata. Good sons, kindness is often, which is the Dharma and the Dharma, which is the Saṃgha, which is kindness, which is the Tathāgata. Good sons, kindness is bliss, which is the Dharma and the Dharma, which is the Saṃgha, which is kindness, which is the Tathāgata. Good sons, kindness is I, which is the Dharma and the Saṃgha, which is kindness, which is the Tathāgata. Good sons, kindness is the unsurpassed path of all bodhisattvas, which is kindness, which is the Tathāgata.",
        "source": "X36n0659_014:0553a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初十五句句句中皆結是如來慈。",
        "translation": "The first fifteen phrases conclude each phrase with the Tathāgata being compassionate.",
        "source": "X36n0659_014:0553a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "慈若無常下是第二徧小乘善法。",
        "translation": "\"If kindness is impermanent, then this is the second universal lesser vehicle good teaching.",
        "source": "X36n0659_014:0553a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子慈若無常無常即慈當知是慈是聲聞慈善男子慈若是苦苦即是慈當知是慈是聲聞慈善男子慈若不淨不淨即慈當知是慈是聲聞慈善男子慈若無我無我即慈當知是慈是聲聞慈善男子慈若妄想妄想即慈當知是慈是聲聞慈善男子慈若不名檀波羅蜜非檀之慈當知是慈是聲聞慈乃至般若波羅蜜亦復如是善男子慈若不能利益眾生如是之慈是聲聞慈善男子慈若不入一相之道當知是慈是聲聞慈善男子慈若不能覺了諸法當知是慈是聲聞慈善男子慈若不能見如來性當知是慈是聲聞慈善男子慈若見法悉是有相當知是慈是聲聞慈善男子慈若有漏有漏慈者是聲聞慈善男子慈若有為有為之慈是聲聞慈善男子慈若不能住於初住非初住慈當知即是聲聞之慈善男子慈若不能得佛十力四無所畏當知是慈是聲聞慈。",
        "translation": "If it's impermanent and impermanent, that's kindness, and you should know that it's kindness. If it's painful and painful, that's kindness, and you should know that it's kindness, and it's śrāvaka charity.",
        "source": "X36n0659_014:0553a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子慈若能得四沙門果當知是慈是聲聞慈。",
        "translation": "If good sons and kindnesses can attain the four ascetic realizations, they should know that this is kindness that's śrāvaka kindness.",
        "source": "X36n0659_014:0553b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亦十六句句句後皆結是聲聞慈。",
        "translation": "He also concludes each of the 16 phrases with the śrāvaka kindness.",
        "source": "X36n0659_014:0553b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子慈若有無下第五明實不可思議又四一歎大慈體二歎行慈人三歎詮慈教即大涅槃四歎說慈主初歎慈體。",
        "translation": "\"Good sons, if there's compassion, then the fifth one below explains that it's really unfathomable. There are four ways to praise the essence of great compassion, two praise the person who practices compassion, three praise the person who teaches compassion, which is the great nirvāṇa, and four praise the person who explains compassion.",
        "source": "X36n0659_014:0553b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子慈若有無非有非無如是之慈非諸聲聞辟支佛等所能思議善男子慈若不可思議法不可思議佛性不可思議如來亦不可思議。",
        "translation": "Good sons, if there is compassion, it's neither existent nor nonexistent. Such compassion is beyond the ability of śrāvakas and pratyekabuddhas to contemplate. Good sons, if compassion is inconceivable, the Dharma is inconceivable, the Buddha-nature is inconceivable, and the Tathāgata is inconceivable.",
        "source": "X36n0659_014:0553b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "舊有三解一云眾生慈緣有法緣緣無無緣緣非有非無二云初地至三地空心多故是無四地至七地有心多故是有八地至十地有無竝觀故云非有非無三云同據佛果妙有故是有無生死界故是無冥真故非有非無今言不然緣五陰法如何是無若是無者即應入真既不入真何得是無又若是無無緣何異又初地至三地豈一向空又非有無豈皆佛地今文歎於行慈之人但行慈者皆有雙非不必唯佛此乃正明梵行中意若緣淨淨是無若緣不淨淨是有若緣非淨非不淨是非有非無不竝不別又緣於三諦緣真故無緣俗故有緣中故非有非無中論云因緣所生法即空即假即中道義問四句是戲論何以釋經答定性四句即是戲論假名四句非是戲論。",
        "translation": "There are three older interpretations: first, sentient beings' compassion conditioned by the existence of dharmas conditioned by the absence of conditioned beings is neither existent nor nonexistent; second, it's because there are many empty states of mind from the first ground to the third ground that there are none; fourth to seventh ground there are many states of mind that there are existent; eighth to tenth ground existence and nonexistence are observed; third, it's because the same basis for the Buddha's fruit is marvelously existent that it's existent and nonexistent in the realm of birth and death that it's nonexistent and true that it's neither existent nor nonexistent.",
        "source": "X36n0659_014:0553b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩住於下第二歎行慈人。",
        "translation": "The second thing below the bodhisattva's abode is to praise people who practice kindness.",
        "source": "X36n0659_014:0553c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子菩薩摩訶薩住於大乘大般涅槃修如是慈雖復安於睡眠之中而不睡眠勤精進故雖常覺寤亦無覺寤以無眠故於睡眠中諸天雖護亦無護者不行惡故眠不惡夢無有不善離睡眠故命終之後雖生梵天亦無所生得自在故善男子夫修慈者能得成就如是無量無邊功德。",
        "translation": "\"Good sons, the bodhisattva Mahāsattva abides in the great vehicle great parinirvāṇa and cultivates such kindness even though he's still asleep and doesn't sleep. Although he always awakens and doesn't awaken because there's no sleep, even though the gods protect him, there's no protector who doesn't act badly and therefore sleeps and doesn't have bad dreams.",
        "source": "X36n0659_014:0553c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是大涅槃下第三歎詮慈之教。",
        "translation": "The third teaching below that of great nirvāṇa is to praise the teaching of compassion.",
        "source": "X36n0659_014:0553c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子是大涅槃微妙經典亦能成就如是無量無邊功德。",
        "translation": "Good sons, this subtle scripture of the great nirvāṇa also accomplishes such measureless and limitless merit.",
        "source": "X36n0659_014:0553c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來下第四歎說慈之主。",
        "translation": "The fourth lamentation under \"Tathāgatas,\" is about the lord who teaches compassion.",
        "source": "X36n0659_014:0553c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸佛如來亦得成就如是無量無邊功德。",
        "translation": "The buddha-tathāgatas can also achieve such measureless and limitless merit.'",
        "source": "X36n0659_014:0553c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉白佛下第三追答第二縱難前難云慈悲若實應有利益故更牒問請答。",
        "translation": "Kāśyapa then said to the Buddha, \"Third, we'll follow up with an answer to the second objection, which asks if compassion really does have benefits.",
        "source": "X36n0659_014:0554a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迦葉菩薩白佛言世尊菩薩摩訶薩所有思惟悉是真實聲聞緣覺非真實者一切眾生何故不以菩薩威力等受快樂若諸眾生實不得樂當知菩薩所修慈心為無利益。",
        "translation": "Kāśyapa said to the Buddha, \"Bhagavān, all the contemplations of the bodhisattva Mahāsattva are true, śrāvakas, pratyekbuddhas, and not true. Why don't all sentient beings experience happiness based on the bodhisattva's authority?\" If sentient beings really don't experience happiness, then you should know that the bodhisattva's cultivation of compassion is not beneficial.",
        "source": "X36n0659_014:0554a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "還復進退兩難一就實修慈為難若佛實修應與眾生何以眾生不得慈益若慈不能與眾生益慈即無用。",
        "translation": "Again, there are two difficulties in advancing and regressing. First, it's a difficulty regarding the true cultivation of kindness.",
        "source": "X36n0659_014:0554a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答又三初明實有益二引事證三結歎不思議初又三前唱有益次善男子下釋益三以是義故下結益初如文。",
        "translation": "Answer: First, there are three ways to explain what's really helpful, second, to cite facts to prove it, and third, to conclude that it's inconceivable.",
        "source": "X36n0659_014:0554a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言善男子菩薩之慈非不利益。",
        "translation": "The Buddha said, \"Good sons, the bodhisattva's kindness is not unbeneficial.",
        "source": "X36n0659_014:0554a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次釋益。",
        "translation": "Next, he explained the benefit.",
        "source": "X36n0659_014:0554a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子有諸眾生或必受苦或有不受若有眾生必受苦者菩薩之慈為無利益謂一闡提若有受苦不必定者菩薩之慈則為利益令彼眾生悉受快樂善男子譬如有人遙見師子虎豹豺狼羅剎鬼等自然生怖夜行見杭亦生恐畏善男子如是諸人自然怖畏眾生如是見修慈者自然受樂。",
        "translation": "\"Good sons, there are sentient beings who will surely suffer or who won't. If there are sentient beings who will surely suffer, then the bodhisattva's kindness is not beneficial, meaning the icchantika. If there are sentient beings who will surely suffer but won't, then the bodhisattva's kindness is beneficial, causing all of those sentient beings to experience happiness. Good sons, it's like a person who sees a lion, a tiger, a jackal, a wolf, a razzaloo, or a ghost from a distance, and becomes naturally frightened when they see a hangman walking at night.",
        "source": "X36n0659_014:0554a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若定業不轉則不得益若不定業則得益也雖是定業若修善者還成不定如定壽八十此不可轉中間非橫慈即益之云何定業如初興殺起重毒害殺時決定殺後暢快竝起恚心此業即定則不能與樂若不定者慈能與樂問業自不定自應得樂何須慈與答業雖不定或轉成定若得慈益轉重為輕見虎豹等自然生怖者喻行慈者人見生喜。",
        "translation": "If a determined action doesn't change, then it doesn't benefit; if an indeterminate action does benefit, then even though it's a determined action, if it's cultivated well, it becomes indeterminate. For example, if a determined life span is 80 years, this can't be changed in the middle, but it's not horizontal.",
        "source": "X36n0659_014:0554a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子以是義故菩薩修慈是實思惟非無利益。",
        "translation": "Good sons, therefore, a bodhisattva's cultivation of kindness is really contemplated, not without benefit.",
        "source": "X36n0659_014:0554b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子我說是慈有無量門下第二引事為證。",
        "translation": "Good sons, I say this kindness has measureless aspects, as evidenced by the second citation below.",
        "source": "X36n0659_014:0554b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子我說是慈有無量門所謂神通善男子如提婆達教阿闍世欲害如來是時我入王舍大城次第乞食阿闍世王即放護財狂醉之象欲令害我及諸弟子其象爾時蹹殺無量百千眾生眾生死已多有血氣是象嗅已狂醉倍常見我翼從被服赤色謂呼是血而復見趣我弟子中未離欲者四散馳走唯除。",
        "translation": "\"Good sons, I say that this kindness has measureless aspects that are called supernormal powers. Good sons, suppose Devadatta taught that the Ajātaśatru wanted to harm the Tathāgata. When I entered the great city of Rājagṛha and went to solicit alms in order, the Ajātaśatru king released a wealth-protecting, drunken elephant that wanted to harm me and my disciples.",
        "source": "X36n0659_014:0554b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "阿難爾時王舍城中一切人民同時舉聲號哭流淚作如是言怪哉如來今日終沒如何正覺一旦散壞是時調達心生歡喜瞿曇沙門滅沒甚善從今已往真是不現快哉此計我願得遂善男子我於爾時為欲降伏護財象故即入慈定舒手示之即於五指出五師子是象見已其心怖畏失大小便舉身投地敬禮我足善男子我時手指實無師子乃是修慈善根力故令彼調伏。",
        "translation": "At the time, Ānanda, all the people in Rājagṛha simultaneously raised their voices, wept, and said, \"It's strange that the Tathāgata has ended up disappearing today. How could right awakening once it's scattered and disintegrated?\" At that point, his well-adjusted mind rejoiced that the Gautama ascetic had ceased to exist, which is very good.",
        "source": "X36n0659_014:0554b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡舉八事慈運神通以教眾生初事中文云謂呼是血者有三解此是十二秊前未制壞色故專著赤二云五部不同十誦一衣三種雜點五分四分三隨著一謂青泥木蘭木蘭赤色三云三色衣中一衣即用三色點之如大豆許但諸弟子併著點衣但其點雖小遙望猶赤。",
        "translation": "Where eight things are mentioned, the charitable powers are used to teach sentient beings. First, the Chinese say, \"He who calls on this blood has three understandings.\" Second, the five divisions differ in the ten recitations of a garment, three kinds of mixed dots, five parts, and four parts, three kinds of dots, and one refers to the red color of the blue mud, wood, and orchid. Third, the three colored garments include a garment that's dotted with three colors, such as soybeans, but the disciples wear dotted garments together.",
        "source": "X36n0659_014:0554b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次五事可見。",
        "translation": "The next five things show that.",
        "source": "X36n0659_014:0554c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子我欲涅槃始初發足向拘尸那城有五百力士於其中路平治埽灑中有一石眾欲舉移盡力不能我時憐憫即起慈心彼諸力士尋即見我以足拇指舉此大石擲置虗空還以手接安置右掌吹令碎粖復還合之令彼力士貢高心息即為略說種種法要令其俱發阿耨多羅三藐三菩提心善男子如來爾時實不以指舉此大石在虗空中還置右掌吹令碎粖復合如本善男子當知即是慈善根力令諸力士見如是事。",
        "translation": "\"Furthermore, good sons, when I first set out for nirvāṇa and had 500 strong men go to the city of Kuśinagara, there was a rock in the middle of the road that was being pacified and dried up, and I couldn't lift it with all my might. I then had compassion and became compassionate when those strong men looked for me and saw me lift this large rock with my thumb, toss it into the air, put it in my hand, place it in my right palm, blow it until it broke, and then close it again, causing those strong men to become arrogant and calm their minds. Good sons, at the time the Tathāgata really didn't lift this large rock with his finger, but placed it in the air with his right palm, blew it until it broke, and closed it again as before. Good sons, you should know that this is the power of the faculty of charity that causes the strong men to see such things.",
        "source": "X36n0659_014:0554c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子此南天竺有一大城名首波羅於是城中有一長者名曰盧至為眾導主已於過去無量佛所植諸善本善男子彼大城中一切人民信伏邪道奉事尼犍我時欲度彼長者故從王舍城至彼城邑其間相去六十五由旬佛與大眾步行而往為欲化度彼諸人故尼犍聞我欲至彼城即作是念沙門瞿曇若至此者此諸人民便當捨我不復供給我等窮悴如何存活諸尼犍輩各各分散告彼城人沙門瞿曇今欲來此然諸沙門委棄父母東西馳騁所至之處能令土地五穀不登人民饑饉死亡者眾病瘦相尋無可救解瞿曇無賴純將諸惡羅剎鬼神以為侍從無父無母孤窮之人而就咨啟為作門徒所可教詔純說虗空隨其至處初無安樂彼人聞已即懷怖畏頭面敬禮尼犍子足白言大師我等今者當設何計尼犍答言沙門瞿曇性好叢林流泉清水外設有者宜應毀壞汝等便可相與出城斬伐林木勿令有遺流泉井池填以臭穢堅閉城門各嚴器仗當壁防護勤自固守彼設來者莫令得前若不前者汝當安隱我等亦當作種種術令彼瞿曇復道還去彼諸人民聞是語已敬奉施行斬伐樹木汙辱諸水莊嚴器仗牢自防護善男子我於爾時至彼城已不見一切樹木叢林唯見諸人莊嚴器仗當壁自守見是事已尋生憐憫慈心向之所有樹木還生如本復更生長其餘諸樹不可稱計河池井泉其水清淨盈滿其中如青瑠璃生眾雜華彌覆其上變其城壁為紺瑠璃城內人民悉得徹見我及大眾門自開闢無能制者所嚴器仗變成雜華盧至長者而為上首與其人民俱共相隨來至我所我即為說種種法要令彼諸人一切皆發阿耨多羅三藐三菩提心善男子我於爾時實不化作種種樹木清淨流水盈滿河池變其本城為紺瑠璃令彼人民徹見我身開其城門器仗為華善男子當知皆是慈善根力能令彼人見如是事。",
        "translation": "Furthermore, good sons, there's a great city in southern India named Śubhāra. In that city there's an elder named Ruzi who's the guide of all the people and has planted good roots by countless buddhas in the past. Good sons, all the people in that great city believe in and submit to the mistaken path, and they serve Nirgrantha. When I wanted to save that elder, I went from Rājagṛha to that city, and the distance between us was 65 leagues.",
        "source": "X36n0659_014:0554c13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "復次善男子舍衛城有婆羅門女名婆私吒唯有一子愛之甚重遇病命終爾時女人愁毒入心狂亂失性裸身無恥遊行四衢啼哭失聲唱言子子汝何處去周徧城邑無有休已而是女人已於先佛植眾德本善男子我於是女起慈憫心是時女人即得見我便生子想還得本心前抱我身如愛子法我時即告侍者阿難汝可持衣與是女人既與衣已便為種種說諸法要是女聞法歡喜踊躍發阿耨多羅三藐三菩提心善男子我於爾時實非彼子彼非我母亦無抱持善男子當知皆是慈善根力令彼女人見如是事。",
        "translation": "Furthermore, good sons, there was a Brāhmaṇa woman named Vasiṣṭha in Śrāvastī who had only one son whom she loved very much and whose life ended when he became ill. At the time, the woman's sorrow and pain entered her mind, and she was confused, naked, shameless, and strewn about in four directions, crying and losing her voice, saying, \"My son, where are you going? Where are you going? You've been everywhere, there's no rest. But after the woman had planted the merit base of the previous Buddha, good sons, I aroused compassion for this woman.",
        "source": "X36n0659_014:0555a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子波羅柰城有優婆夷名摩訶斯那達多已於過去無量先佛種諸善根是優婆夷夏九十日屈請眾僧奉施醫藥是時眾中有一比丘身嬰重病良醫診之當須肉藥若得肉者病則可除若不得肉命將不全時優婆夷聞醫此言尋持黃金徧至市里唱如是言誰有肉賣吾欲買之若有肉者當等與金周徧城市悉不能得是優婆夷尋自取刀割其股肉切以為羮下種種香施病比丘比丘服已病即得差是優婆夷患瘡苦惱不能堪忍即發聲言南無佛陀南無佛陀我於爾時在舍衛城聞其音聲於是女人起大慈心是女尋見我持良藥塗其瘡上還復如本我即為說種種妙法聞法歡喜發阿耨多羅三藐三菩提心善男子我於爾時實不往至波羅奈城持藥塗彼優婆夷身善男子當知皆是慈善根力令彼女人見如是事。",
        "translation": "Furthermore, good sons, there was an Upāsikā named Mahāsnadatta in Vārāṇasī who had planted good roots in the past with measureless previous buddhas. Upāsikā had invited the saṃgha to give him medicine for the 90 days of summer when a monk with a serious illness was examined by a good doctor.",
        "source": "X36n0659_014:0555b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子調達惡人貪不知足多服酥故頭痛腹滿受大苦惱不能堪忍發如是言南無佛陀南無佛陀我時住在優禪尼城聞其音聲即生慈心爾時調達尋便見我往至其所手摩頭腹授與鹽湯而令服之服已平復善男子我實不往提婆達所摩其頭腹授湯令服善男子當知皆是慈善根力令提婆達見如是事。",
        "translation": "Furthermore, good man, the miscreant Tadyadhar doesn't know enough to eat much butter, so he suffers headaches and a full belly and is unable to tolerate great suffering.",
        "source": "X36n0659_014:0555b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子憍薩羅國有諸群賊其數五百群黨鈔劫為害滋甚波斯匿王患其縱暴遣兵伺捕得已挑眼逐著黑闇叢林之下是諸群賊已於先佛植眾德本既失目已受大苦惱各作是言南無佛陀南無佛陀我等今者無有救護啼哭號咷我時住在祇洹精舍聞其音聲即生慈心時有涼風吹香山中種種香藥滿其眼匡尋還得眼如本不異諸賊開眼即見如來住立其前而為說法賊聞法已發阿耨多羅三藐三菩提心善男子我於爾時實不作風吹香山中種種香藥住其人前而為說法善男子當知皆是慈善根力令彼群賊見如是事。",
        "translation": "Furthermore, good sons, there were a group of thieves in Kauśālodharā, a group of 500 men who traveled around extensively, inflicting harm on the king of Prasenajit, who was troubled by their brutality, sent his troops to search for them, picked their eyes, and drove them into the darkness under the jungle.",
        "source": "X36n0659_014:0555c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第七事初云憍薩羅舍衛者或有言是一國異名或云憍薩是附庸國其國有賊故波斯遣兵。",
        "translation": "The seventh thing is that first, it's called Kauśālapati. Some say it's a different name for a country, or Kauśālapati is a vassal state that has bandits and therefore Persia sends its troops.",
        "source": "X36n0659_014:0555c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復次善男子瑠璃太子以愚癡故廢其父王自立為主復念宿嫌多害釋種取萬二千釋種諸女刑劓耳鼻斷截手足推之阬塹時諸女人身受苦惱作如是言南無佛陀南無佛陀我等今者無有救護復大號咷是諸女人已於先佛種諸善根我於爾時在竹林中聞其音聲即起慈心諸女爾時見我來至迦毗羅城以水洗創以藥塗之苦病尋除耳鼻手足還復如本我時即為略說法要悉令俱發阿耨多羅三藐三菩提心即於大愛道比丘尼所如法出家受具足戒。",
        "translation": "Furthermore, good sons, Prince Rukia, who had abolished his father's king because of his folly and had made himself lord, then remembered that past enmity had often harmed the Śākya lineage, took 12,000 Śākya lineage women, cut off their ears and noses, amputated their hands and feet, and pushed them to the moat.",
        "source": "X36n0659_014:0555c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子如來爾時實不往至迦毗羅城以水洗創藥塗止苦善男子當知皆是慈善根力令彼女人見如是事悲喜之心亦復如是善男子以是義故菩薩摩訶薩修慈思惟即是真實非虗妄也。",
        "translation": "Good sons, the Tathāgata really didn't go to Kapilavastu to wash himself with water, rub him with medicine, and stop his suffering. Good sons, you should know that this is the power of the faculty of charity that causes that woman to see such things and be compassionate and joyous. Good sons, for this reason the bodhisattva Mahāsattva cultivates the contemplation of kindness, which is real and not false.",
        "source": "X36n0659_014:0556a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子下第三結歎。",
        "translation": "Good sons, here's the third conclusion.",
        "source": "X36n0659_014:0556a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "善男子夫無量者不可思議菩薩所行不可思議諸佛所行亦不可思議是大乘典大涅槃經亦不可思議。",
        "translation": "\"Good man, what's immeasurable cannot be considered. What the bodhisattvas do cannot be considered, and what the buddhas do cannot be considered.",
        "source": "X36n0659_014:0556a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫無量者不可思議乃是通歎菩薩所行不可思議歎次第慈諸佛所行即歎圓慈是大乘典即是歎教皆不思議俱會一圓言語道斷心行處滅不可說不可量。",
        "translation": "The immeasurable is inconceivable because it's a universal exclamation of the inconceivability of what the bodhisattvas do and the inconceivability of what the buddhas do, which is to exclamation of perfect compassion, which is the great vehicle code, which is to exclamation of the teaching that none of them should be considered, all of them united in a single, perfect path of speech, cutting off mind, practice, and extinction, which is inexplicable and immeasurable.",
        "source": "X36n0659_014:0556a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大般涅槃經卷第十四",
        "translation": "Mahāparinirvāṇa-sūtra, Vol. 14",
        "source": "X36n0659_014:0556a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "日東　天台沙門本純　分會",
        "translation": "Nitto Tendai śramaṇa Benjū Branch",
        "source": "X36n0659_014:0556a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "南本大般涅槃經會疏卷第十四",
        "translation": "Southern Edition of the Nirvana Sutra: A Commentary, Volume 14",
        "source": "X36n0659_014:0556a19_0",
        "is_bad_quality": false
    }
]