[
    {
        "source_sentence": "俱舍頌疏記　論本第二十三",
        "translation": "Commentary on the Verses of the Kuchea Treatise (Text XXIII)",
        "source": "X53n0841_023:0493a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "富春沙門　遁麟　述",
        "translation": "Fuchun Shaman Dunlin Narrative",
        "source": "X53n0841_023:0493a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依前二門者謂不淨持息為二門也。",
        "translation": "Relying on the first two approaches means that the two approaches are impure breath-holding.",
        "source": "X53n0841_023:0493a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言為觀修念住者觀者准此五停心位為止散動偏修於止爾時假想觀骨鏁等一想而住心名之為止四念住位取身受心法差別之相又於身中而取種種差別之相除其四倒生如實見故名為觀。",
        "translation": "When it comes to observing the cultivation of mindfulness, an observer refers to the five states of stabilizing the mind up to the point of distraction, partially cultivating calmness, and then nominally observing the bones, retracts, and other parts of the mind up to the four states of mindfulness, taking the distinctive aspects of body, feeling, mind, and dharmas, and taking the various distinctive aspects of the body to remove the four errors and produce a true view, so it's called observing.",
        "source": "X53n0841_023:0493a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言別想總想者此中唯以身受等別觀名別想以四總觀名總想非約無常等行相為總別也初別想中有三初以自相別觀。",
        "translation": "When it comes to distinctive perceptions and general perceptions, these are only distinctive perceptions of body sensation and so forth, and the four general perceptions are called general perceptions.",
        "source": "X53n0841_023:0493a13_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次共相別觀次總觀四。",
        "translation": "The second is the distinctive contemplation of common characteristics, followed by the four general contemplations.",
        "source": "X53n0841_023:0493a15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且初自相別觀者正理云謂觀察身內外十處自性各別從眼至觸一一皆有處自相故如是於彼各別法中有正智生名觀自相此自相觀得成滿時有道色起爾時方立自相種姓身念住名言且觀身與餘有為同非常者此以共相別觀且說觀身餘三准此。",
        "translation": "The first is contemplation of distinctive aspects of self-nature, which is defined by the correct principle as observing the distinctive nature of each of the ten internal and external parts of the body, from the eye to touch, each of which has a place in self-nature. Thus, in each of these distinctive qualities, correct knowledge arises and is called contemplation of self-nature.",
        "source": "X53n0841_023:0493a16_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言觀身至一極微者謂觀色身能造所造五根五境積聚極微之所成立如是漸略後觀唯一極微名身念住滿。",
        "translation": "When it comes to observing the body up to a single subtlety, it means observing the form body, the five faculties and five objects that are created, and the accumulation of subtleties that are formed, and so on, gradually and briefly, and then observing only a single subtlety is called the fullness of mindful abiding in the body.",
        "source": "X53n0841_023:0493a21_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀受心法至一剎那者謂先觀受等自性長短時節乃至漸略唯一剎那時名受等滿。",
        "translation": "Observing feelings and mental factors up to a single moment means first observing the own-nature of feelings and so forth for a long and short period of time and then gradually abbreviating it to a single moment of time is called the completion of feelings and so forth.",
        "source": "X53n0841_023:0493a23_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言由念力令慧住境者有宗義故論云毗婆沙師說此品念增故是念力持慧得轉義如斧破木由楔力持故(此以果從因立名也)故正理又立喻言謂後後位善根增長如畦中水泛溢漫流。",
        "translation": "When it's said that the power of mindfulness causes wisdom to abide in objects, there's a doctrinal meaning. That's why the treatise says that the mindfulness of this class increases because of the power of mindfulness, and wisdom is transformed like an ax breaking through wood because of the power of a wedge (this is called the result following the cause.) Therefore, the correct principle also poses the metaphor that the growth of good roots in later stages is like water flooding and spreading in a border.",
        "source": "X53n0841_023:0493b01_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言或由慧力令念住境者是論主釋故論云理實應言慧令念住是故於慧立念住名隨慧所觀念能明記故。",
        "translation": "This is because the treatise says that the principle really should be that wisdom causes mindfulness to abide. Therefore, mindfulness of wisdom is called following the contemplation of what wisdom is able to clearly identify.",
        "source": "X53n0841_023:0493b04_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言所緣念住者是慧所緣亦攝於慧以盡所緣攝諸法故。",
        "translation": "The mindfulness of the objects of wisdom is because the objects of wisdom are also included in wisdom in order to exhaust the collection of dharmas that are the objects of wisdom.",
        "source": "X53n0841_023:0493b06_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言相雜念住能斷煩惱者此論無文唯此義立耳。",
        "translation": "He who speaks of the abiding of mindfulness of compounding that cuts off affliction has no text in this treatise but this meaning.",
        "source": "X53n0841_023:0493b07_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有非俱有者謂於所緣之中有不與能緣同時也以通緣三世法故。",
        "translation": "'Both existent and non-existent' means that within the referent, there's an existent that isn't concurrent with the referent because it's a referent to all three worldly phenomena.",
        "source": "X53n0841_023:0493b08_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身最麤者身是色故。",
        "translation": "The most coarse body means that the body is form.",
        "source": "X53n0841_023:0493b10_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次受麤者如言我手痛等此以麤細為次第念以從生為次第。",
        "translation": "The next feeling is coarse, such as saying, 'My hand hurts.' This is the order of coarse and fine, and mindfulness is the order of birth.",
        "source": "X53n0841_023:0493b10_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言治倒唯四者正理又云對治四貪故但有四。",
        "translation": "When they say there are only four ways to counteract error, the correct principle also says that there are only four ways to counteract the four cravings.",
        "source": "X53n0841_023:0493b11_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言四中三種名不雜緣者謂身受心唯得別緣若將身合心緣心即不得定觀身不淨故三曰不雜。",
        "translation": "The three of the four are called unadulterated cognition, which means that the body, sensation, and mind can only have separate cognition. If the body is combined with the mind and cognized by the mind, then concentration cannot be observed, and the body is therefore impure.",
        "source": "X53n0841_023:0493b12_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次總相念與前別者正理云雜緣法念住總有三種謂二三四唯總緣四名此所修前雜非唯二三等故與前差別已上從五停心至此外凡位竟自下明內凡位。",
        "translation": "Next, general mindfulness is distinct from the prior, and the correct principle is that there are three general types of mindful abiding that are complex in terms of conditions, namely, two, three, and four general conditions only.",
        "source": "X53n0841_023:0493b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言從此總相念住至次生暖法者准婆沙正理入道次第從雜念住後修三義觀及七處善方從總相入於暖頂此論略而不說(三義觀者謂觀蘊處界三科之義也七處善者謂如實知色苦色集色滅趣色滅行色味色患及色出離知受等四其數亦爾今從總數但言七處)然此論云修習總緣共相法念住漸次成就乃至上上品從此念住後有順決擇分初善根生名為暖法。",
        "translation": "From this general mindfulness abiding to the next production of the warm dharma, according to the Vibhāṣā council of the correct principle, the order of entry into the path is from the complex mindfulness abiding followed by cultivation of the three contemplations and the seven points of goodness before entering the warm peak from the general aspect.",
        "source": "X53n0841_023:0493b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言具觀四聖諦修十六行相者此有漏心學觀四諦未能明了如隔羅縠觀眾色像新云准下減緣行中此觀四諦於一一諦觀四行已方易諦也。",
        "translation": "When it comes to fully observing the four noble truths and cultivating the sixteen defining activities, this contaminated mind trains in observing the four truths without being able to clearly understand them like a viewer's form through a linen gauze, or a new cloud that defines the following lesser defining activities, which are observing the four truths and then observing the four defining activities in each of them.",
        "source": "X53n0841_023:0493b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言善根生名為頂法者正理論云行者修習此暖善根下中上品漸次增進於佛所說苦集滅道生隨順信觀察諸有恒為猛盛焰所焚燒於三寶中信為上首有修所成順決擇分次善根起名為頂法。",
        "translation": "When it comes to the production of good roots, the term \"paramount,\" the correct principle says that practitioners cultivating these warm good roots gradually advance in the lower, middle, and higher classes, teaching the suffering, accumulation, cessation, and path of the Buddha, and then observe with obedient faith that all existences are constantly being burned by a raging fire.",
        "source": "X53n0841_023:0493c03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言頂為最勝者正理又云頂聲顯此是最勝義如吉祥事至成辦時世間說為此人至頂。",
        "translation": "When it says that the top is the most excellent, the correct principle also says that the sound of the top indicates that it's the most excellent meaning, such as when auspicious circumstances reach completion, the world says that this person reaches the top.",
        "source": "X53n0841_023:0493c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言見道唯法念住者謂見道速疾無容別觀故但法念住也新云別緣觀劣不能易位總觀力勝能易位故由斯初位皆法念住也。",
        "translation": "The expression 'abiding mindfulness of the Dharma alone' means that the path of seeing is rapid, allowing no separate contemplation; therefore, it's only abiding mindfully in the Dharma.",
        "source": "X53n0841_023:0493c09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言忍可四諦最勝者前位善根非不忍可此最殊勝偏受其名若爾世第一位亦應名忍正理釋云世第一位雖於聖諦亦能忍可無間必能入見道故必無退墮而不具觀四聖諦理此具觀故偏得忍名。",
        "translation": "When it comes to tolerating the most excellent of the four truths, the good roots of the prior stage aren't intolerant; this most excellent is partially entitled to its name.",
        "source": "X53n0841_023:0493c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此忍善根有下中上者准婆沙文云通約四善根分為三品暖為下品頂為中品忍及世第一為上品今不約此。",
        "translation": "\"These good roots of forbearance are lower, middle, and higher, according to the Vibhāṣā text, which generally divides the four good roots into three categories, the lower category of warmth, the middle category of supreme forbearance, and the highest category of the world's first.",
        "source": "X53n0841_023:0493c15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言唯觀欲苦至一剎那者論云與世第一相隣接故由此義准暖等善根皆能具緣三界苦等義已成立無簡別故。",
        "translation": "When it comes to observing only the suffering of desire up to a single moment, the treatise says that it's connected to the world's highest root, so this is the meaning according to which good roots like warmth are able to refer to the suffering of the three realms and so forth.",
        "source": "X53n0841_023:0493c17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言減餘一行者謂出行也。",
        "translation": "The expression \"lessening of the other one's condition\" refers to traveling.",
        "source": "X53n0841_023:0493c19_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言減緣之時亦減行者此緣與行名異體同故此八緣亦是行攝謂約所託名之為緣行解相狀名之為行且如道行又是道諦餘諦亦然故緣行合一此減緣行章中具明若更解釋却增煩惑有修十六十二八四者准此無修十五十四十三十一十九七六五三二一行也。",
        "translation": "When it comes to lessening conditions, it also reduces practice. These conditions and practice have different names and the same essence. Therefore, the eight conditions are also included in practice, which is called conditions according to their designation, and the shape of practice according to their understanding is called practice.",
        "source": "X53n0841_023:0493c20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言唯起一行者謂是行修要心現前觀察諦理心不並起故但一得非心法多亦不妨。",
        "translation": "The expression 'only one practice' means that it's a practice that requires the mind to directly observe the truth and principle, so it's not something that arises together with only one attainment or non-attainment, and it's not bad to have many mental factors.",
        "source": "X53n0841_023:0494a01_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言如名次第從後向前者如十六行名之次第從後減向前如出居最後故先減之問於見道中餘三諦下各有四行相作何行耶答隨先串習即作此行准此觀餘諦時不作苦下行也。",
        "translation": "He said, \"As the names are ordered from backward to forward,\" meaning that the order of the names of the sixteen practices is reduced from backward to forward as if they were to come out and live last.",
        "source": "X53n0841_023:0494a03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言擬宜相當者擬謂對向宜謂稱合此等但以次第相當以為相屬。",
        "translation": "When it comes to appropriate, appropriate means to confront, appropriate means to conform, and these are regarded as subordinate in order and similarity.",
        "source": "X53n0841_023:0494a06_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言於世間最為第一者准婆沙問答以都勝初故名第一。",
        "translation": "The expression \"most eminent in the world\" refers to the answer to the Vibhāṣā council's question, which is that it's superior to the first, so it's called the first.",
        "source": "X53n0841_023:0494a08_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言離同類因者謂世第一前總是有漏從此已後并是無漏故此世第一位能離同類因也。",
        "translation": "The expression \"free from similar causes\" means that the first in the world was always contaminated, and from here on out it's all uncontaminated, so the first in the world is therefore free from similar causes.",
        "source": "X53n0841_023:0494a09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言得非四善根體者恐其聖道加行重現前失故除之故正理云已見諦者加行現前成無用故婆沙又云何故得為沙門果體而非煗等體耶答沙門果體成就所顯故得是沙門果煗等善根聖不重起故得非煗等又問何故生相等是世第一法而非得耶答生相等與彼同一果相隨行不相離常和合無前後相與所相未嘗相離由此亦是世第一法得與彼法不同一果不相隨行性離不和合或前或後得與所得有時相離譬如樹皮有時離樹是故得非世第一法煗頂忍得亦復如是。",
        "translation": "It's because the correct principle says that those who have seen the truth will become useless when their applied practices are repeatedly manifested, and the Vibhāṣā council also says, \"Why is the attainment of the essence of the ascetic fruit and not the essence of the śramaṇa?\" A The ascetic fruit is manifested by the accomplishment of the essence of the ascetic fruit, so the attainment of the ascetic fruit, such as the śramaṇa and other holy roots, is not repeatedly produced, therefore the attainment of the śramaṇa and others is not the śramaṇa.",
        "source": "X53n0841_023:0494a11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言無色無見道者夫入見道必緣欲界以無色心不緣欲界故。",
        "translation": "When it comes to the formless path of no views, a person entering the path of views must be directed toward the desire realm because the formless mind isn't directed toward the desire realm.",
        "source": "X53n0841_023:0494a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言更加欲界者此非正義正理破云對法諸師不許彼說非聞思所成順決擇分故言前三善根三州初起者婆沙問云何故天中不能初起答彼處無勝厭離等作意故問惡趣中有勝厭離等作意何故不起此善根答惡趣中無勝依身若有勝厭離亦有勝依身者則能初起人中具二故能初起第四善根天亦初起者既唯一念不起即已起必名初天中既許入聖道故天初起此善。",
        "translation": "This is not the correct meaning, and the correct principle refutes the claim that masters of the opposing teachings don't allow them to say that they aren't formed by hearing and thinking, and therefore follow the right ascertainment factor. The first three good roots that are first produced in the three states are those that cannot be first produced in heaven, asks the Vibhāṣā council.",
        "source": "X53n0841_023:0494a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言前之善根男女得二者謂若得一餘但成就非謂並起故婆沙云於女身所起暖亦得亦在身亦成就亦現在前於男身所得暖得而不在身成就不現前如說暖法頂忍亦爾男准此說此謂善根同故互得也。",
        "translation": "When it comes to the previous good roots, the two are acquired by men and women, which means that if one is acquired, the other is accomplished, not both are produced. Therefore, according to the Vibhāṣā council, the warmth that arises in the woman's body is also acquired, present in the body, and accomplished, and present in the male body, where the warmth is acquired but not present in the body, as explained in the explanation of the tolerance of the warmth of the Dharma peak.",
        "source": "X53n0841_023:0494b05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言得女身非擇滅者謂本是男身證聖已後無轉為女即於女身得非擇滅若本是女即不同此如羅漢尼猶是女故若本女人證聖之後容轉為男由是第四女容得二男但得一。",
        "translation": "When it comes to attaining non-selective extinction in the female body, it means that there's no turning into a woman after realizing the noble body when it was originally a man's body, which means attaining non-selective extinction in the female body when it was originally a woman's body.",
        "source": "X53n0841_023:0494b09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遷上地者如身在欲界依初禪起煗等生初禪時不名失地以同本所依故若生第二定時方名遷上地若此地死還生此地不捨者謂聖人有聖道資故雖死而不捨要遷上地上地中有起時方捨也。",
        "translation": "When the body is in the desire realm, depending on the first dhyāna, such as the arising of the dhāraṇī, it's not called losing the ground because it's the same as the original basis.",
        "source": "X53n0841_023:0494b13_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "異生於煗頂亦由退捨者謂此二是動善根故亦有退捨准此失地唯聖退捨及死唯是異生也。",
        "translation": "An unenlightened person at the top of the hill also causes equanimity, meaning that these two things move the wholesome roots and therefore there's equanimity.",
        "source": "X53n0841_023:0494b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依本必見諦者謂依根本地起四善根必三生滿便於當生能入見道其未至地及中間禪起煗等者於此生中不必見諦謂止觀不均厭生死心不猛利故又准婆沙根本起煗頂亦無退也。",
        "translation": "Those who rely on the origin must see the truth means that the four good roots that arise from the root ground must be fulfilled in three lifetimes, and then in the future life they can enter the path of seeing those who have not yet reached the ground and those who arise from the intermediate state, etc. In this life, there's no need to see the truth because calming and observation aren't uniformly disillusioned with birth and death, and the mind isn't intense.",
        "source": "X53n0841_023:0494b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言要大加行方修得者此以未曾修故有善根得成時促非如餘有漏定無始熟修故大功用方能起也又正理云乃至於先所捨不欽敬故。",
        "translation": "This is because it has never been cultivated before, so when there are good roots that become productive, it's not like the other contaminated concentrations that are cultivated from beginning to end, so great effort can only arise.",
        "source": "X53n0841_023:0494b22_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言遇了分位善說法師者謂知前人善根位次知已得煗位便為說頂等。",
        "translation": "This refers to someone who knows the stages of the previous person's good roots and knows that they've reached a superior stage and then explains the top of their head.",
        "source": "X53n0841_023:0494c01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言而無久流轉者前順解脫分極速三生得聖今順決擇極疾此生即得正理云是等引起勝善根故。",
        "translation": "When it comes to continuity without prolonged periods of time, the former followed the factors of liberation very quickly in three lifetimes and attained sainthood very quickly in the present followed right ascertainment and attained it immediately in this lifetime. The correct principle says that this causes such superior good roots.",
        "source": "X53n0841_023:0494c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言雖有退等者等取亦容造惡業等也但不斷善根與前有異餘并是同正理論須加觀察三寶殊勝功德為門引生淨信心故。",
        "translation": "Although there's retrogression and so forth, this kind of taking also allows for the creation of bad actions and so forth, but it doesn't stop with the good roots. The rest are the same, according to the correct theory, because the Three Treasures' extraordinary qualities must be observed as the entryway to pure faith.",
        "source": "X53n0841_023:0494c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言於卵濕生至得非擇滅者正理論云謂卵濕生者多愚癡故無想天大梵僻見處故北州無現觀故扇[打-丁+虎]等多諸煩惱故第八有聖必不受故見所斷惑必不起故又婆沙云扇[打-丁+虎]等身形鄙陋故是人中惡趣若得忍位殊勝善根必更不受(解云第八有言但遮欲界非遮上界以上流者受多生故)言世第一至離生者猶是有漏故是異生住現在時與苦法忍為等無間緣引至生相名入也世第一如無間道苦法智忍如解脫道此二共捨異生性也但以苦法忍在正生時未成就故不名聖者至得生次第故名等無間。",
        "translation": "When it comes to the egg moist birth to attaining nondiscursive cessation, the correct principle says that the egg moist birth is characterized by much delusion, the absence of conceptualization, the seclusion of the heaven and Brahma, the absence of clear views, the absence of clear observation, and the many afflictions of the eighth rank of saints, which must not be tolerated, and the Vibhāṣā council says that the body of the egg moist birth is despicable, so it's a bad destiny among human beings, and if it attains the stage of forbearance, the excellent good roots must not be tolerated again.",
        "source": "X53n0841_023:0494c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言煗頂二位容轉成佛者以頂猶墮惡趣故若未殖佛乘順解脫分聲聞種性若得轉向佛乘經三無數及百劫已起彼煗等轉向麟角經百劫已起彼暖等皆一座成覺故此唯約四善根論轉不轉婆沙又約前解脫分法論轉不轉。",
        "translation": "When it says that the two stages of awakening and the peak of awakening allow for the attainment of Buddhahood, it's because the peak is still falling into a bad destiny if one hasn't yet prospered in the Buddha vehicle and followed the śrāvaka seed nature of the liberation stage.",
        "source": "X53n0841_023:0494c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言菩薩利物必墮惡趣者正理云菩薩專求利他事故為欲拔濟無邊有情弘誓莊嚴經無量劫故往惡趣如遊園苑若不爾者無成佛義。",
        "translation": "The correct principle says that bodhisattvas who seek to benefit others will surely fall into bad destinies because they want to rescue limitless sentient beings and vow to adorn themselves through countless eons.",
        "source": "X53n0841_023:0494c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言暖頂忍三容可轉成獨覺者謂獨覺不往惡趣故忍猶可轉為之准世第一位亦容轉成獨覺但以時促故不可轉也。",
        "translation": "The expression \"warm-roofed forbearance\" means that the pratyekabuddhas don't go to bad destinies, so forbearance can still be transformed into the first worldly rank, but because of the shortage of time, it can't be transformed into pratyekabuddha.",
        "source": "X53n0841_023:0494c24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言麟角獨覺者此簡部行部行如聲聞說有可轉唯麟角無轉義與佛同也故論云有餘獨覺異麟覺喻起彼種姓初二善根轉向餘乘理無遮礙言從煗位終至菩提者論云有餘師說從不淨觀不起于座乃至成菩提。",
        "translation": "When it comes to the lion's horn solitary realizer, this is simply the partial practice, the partial practice as taught by the śrāvakas, that there's something to be turned, except for the lion's horn, which has the same meaning as the Buddha.",
        "source": "X53n0841_023:0495a02_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言極速三生者譬如田第一下種第二苗成第三結實三位不同修道亦爾第一生身入法性第二生成就第三生得解脫正理云初生殖解脫分第二生成就第三生起順決擇分即入見道若謂第二生起順決擇分第三生入聖者彼言便與前說相違謂依根本地起煗等者彼必此生得入見諦或彼應許極速二生俱舍師救云依根本地起煗等者必於前生已起煗等或可第四生方能依根本地起也但言極速極遲者則顯中間多少無准。",
        "translation": "The first birth is the entry into the Dharma nature, the second birth is the fulfillment of the third birth, and the third birth is the attainment of liberation. The correct principle is that the first birth is the entry into the liberation aspect, the second birth is the fulfillment of the third birth, and the third birth is the entry into the path of seeing by following the right ascertainment aspect.",
        "source": "X53n0841_023:0495a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言三業為體者論云雖就最勝唯是意業而此思願攝起身語亦得名為順解脫分故通三業又論云遇佛出世植此善根有餘師言亦遇獨覺(解云佛及教法俱名佛世)言施一食持一戒者婆沙云有人因施一摶食乃至一淨齒木即能種植解脫種子如戰達羅等彼作是言願我因斯定得解脫或有雖設無遮大會而不能種解脫種子如無暴惡等彼謂所施皆求世間富貴名稱不求解脫或有受持一晝夜八戒而種解脫或有盡形持戒不能種解脫分(已上七方便竟)。",
        "translation": "The statement that the three activities are the essence of the treatise says that although the most excellent is only mental activity, this conception and vow to gather up body and speech can also be called the part of liberation that follows the three activities and the treatise says that when the Buddha appears in the world, he plants this good root, and there are other teachers who say that he also meets the pratyekabuddha (the explanation says that the Buddha and the teachings are both called the Buddha world).",
        "source": "X53n0841_023:0495a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自下約聖位辨之次生法智者此觀上下八諦總十六心正理論云既於三界四聖諦境旋環粉擾作意思惟寧不能為現觀障礙初習業地於諸諦境多反旋環已淳熟故。",
        "translation": "From the following, we'll discuss the noble stages and then give rise to knowledge of the Dharma. This is the contemplation of the higher and lower eight truths, which comprise the sixteen mental states of the correct principle, as explained in the Treatise on the Three Worlds and Four Noble Truths, which are objects that spin around, distract, and orientate the mind, rather than being an obstruction to clear observation.",
        "source": "X53n0841_023:0495b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言舉後等流以為標別者謂四善根忍是有漏性今此中忍是無漏性恐濫前忍舉法智果顯是無漏與前忍別謂此能生法智是法智因謂法智忍名如華菓樹正理云此無漏忍以欲苦法為其所緣名苦法忍謂於苦法無始時來身見所迷執我我所今創見彼唯苦法性忍可現前名苦法忍問上下八諦何故先觀欲界苦婆沙解云欲非定地是故先觀上二界俱定地攝故後合觀。",
        "translation": "When it comes to distinguishing the latter streams by mentioning that the forbearance of the four good roots is contaminated in nature and that this middle forbearance is uncontaminated in nature, lest it abuse the former forbearance and mention the fruit of Dharma cognition to show that it's uncontaminated and distinct from the former forbearance, it means that this knowledge of the arising of dharmas is the cause of Dharma cognition, which is the forbearance of Dharma cognition named like the flowering fruit tree or the correct principle that this uncontaminated forbearance has the desire for painful dharmas as its object and is called the forbearance of painful dharmas.",
        "source": "X53n0841_023:0495b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言此後境智與前相似故立類名者如上界苦智與欲界苦智一類是同故名為類又論結云以後隨前而證境故昔云此忍義亦同也。",
        "translation": "When it says that the knowledge of this latter state is similar to the former, it's called a type. For example, the knowledge of suffering in the upper realm and the knowledge of suffering in the desire realm are the same, so they're called types.",
        "source": "X53n0841_023:0495b11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言此有三種者述三現觀別也唯慧能見餘心心所非慧性故不能見諦但名為緣其四相等非心法故不能緣境而與慧等同一事業故得名為事現觀也是則慧具三名相應法名有二四相等但一名也。",
        "translation": "When it says there are three kinds, it means that wisdom alone can see other minds and mental factors that aren't the nature of wisdom and therefore can't see the truth but are called contingent on the four equivalents that aren't mental factors and therefore can't be contingent on objects and therefore share the same cause with wisdom.",
        "source": "X53n0841_023:0495b14_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言或由見惑至不能淳熟者第二釋生名也婆沙云復次有身見等剛強難伏如獸[怡-台+龍]悷故說名生。",
        "translation": "The expression \"sometimes due to the mental disturbances of views that aren't fully ripened\" is the second explanation of the name birth.",
        "source": "X53n0841_023:0495b18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言二釋同前者謂依主持業同前正性離生也詳其正性之名即通涅槃及與見道離生決定唯目見道故此二名皆通兩釋。",
        "translation": "When it says the two interpretations are the same as the previous one, it means the correct nature is the same as the previous one based on presiding over karma, which is free from birth. In detail, the name of the correct nature refers to nirvāṇa and to the path of seeing, which are free from birth and definitely only the path of seeing.",
        "source": "X53n0841_023:0495b20_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦法智忍名為入者論云此忍生已得聖者名此在未來捨異生性故解云如燈生時正能滅暗住時已滅生相生時正能生法住時已生此忍亦於生時正捨異生性住時已捨故。",
        "translation": "When this forbearance is produced, the name of the noble one has already been attained, so the explanation is like a lamp that's produced when it's capable of extinguishing darkness and has ceased when it's abiding.",
        "source": "X53n0841_023:0495b22_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言不為惑得之所隔礙者謂斷惑時惑體不現但斷其得故言不為得礙正理難云經主釋言約斷惑得無能隔礙故名無間道者若爾解脫亦應名無間約與離繫得俱亦無能隔礙故應作是釋無間隔故名為無間無間即道名無間道是無同類道能為間隔令於解脫道不為相續緣義諸無間道唯一剎那諸解脫道或相續故。",
        "translation": "The expression 'not obstructed by the attainment of affliction' means that when affliction is ended, the essence of affliction isn't manifested but its attainment is ended; therefore, it's called the uninterrupted path because it's not obstructed by the attainment of correct principles as explained by the master of the scriptures.",
        "source": "X53n0841_023:0495c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "忍如駈賊者喻惑得出身也。",
        "translation": "Forbearance is like a thief, which is a metaphor for the origin of afflictions.",
        "source": "X53n0841_023:0495c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智如閇戶者喻令惑得不入身也。",
        "translation": "Knowledge is like a door open to a door, which is a metaphor for causing afflictions not to enter the body.",
        "source": "X53n0841_023:0495c08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言前十五心名為見道者謂從道類忍已前十五心也忍名為見智名為智至十五心於一一諦理皆已見故無未曾見雖知八諦未得周盡今明見道不明知道故無有失若說知道十六方周。",
        "translation": "The fifteen prior states of mind are called the path of seeing, meaning the fifteen prior states of mind after the path of type of forbearance are called forbearance, and wisdom is called wisdom.",
        "source": "X53n0841_023:0495c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言如修習曾見者舉例釋也如餘修道已曾見故故名為修今第十六亦已曾見故名修也。",
        "translation": "He says, \"As cultivation has been seen before,\" citing examples to explain, \"As the rest of cultivation has been seen before, it's called cultivation.\" Now, the sixteenth has also been seen before, so it's called cultivation.",
        "source": "X53n0841_023:0495c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言此中約諦不約剎那者謂約八諦作法論遍不遍不約十六剎那心遍與不遍已見上地無邊之道唯餘一念未見今見豈得從少名未見諦故論云又道類智是果道攝故却修八諦十六行相故捨前道故相續起故如餘修道故非見道攝。",
        "translation": "When it's about the truths and not about the jhāna, it means it's about the eight truths, making a theory that's pervasive and not pervasive, and not about the sixteen jhāna moments, which are pervasive and not pervasive.",
        "source": "X53n0841_023:0495c15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言知諦未盡中間起者謂知八諦未究竟時中間起七智也。",
        "translation": "The expression \"arising in the middle of knowing the truths that have yet to be exhausted\" refers to the seven kinds of cognition that arise in the middle when knowing the eight truths that have yet to be fully realized.",
        "source": "X53n0841_023:0495c20_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言隨信他言而行義者謂先信他為是首行隨信起名隨信行由先所作但隨他語不自披教故婆沙云由信為先得入聖道如是種類補特伽羅從本已來性多信故若聞他勸汝應務農以自存活彼不思察我為應不作為應作為有宜便為無宜便聞已便作乃至商侶事王習學書筭種種伎藝聞亦如是隨法行者婆沙云乃至由慧為先得入聖道如是種類補特伽羅從本已來性多慧故若聞他勸汝應務農以自存活彼便思察我為應作為不應作等。",
        "translation": "The expression \"practice according to faith in the words of others\" means that believing in others is the first practice, and following faith, it's called \"practice according to faith.\" It's because it's done before but following the words of others and not revealing its own teaching that the Vibhāṣā council says that it's because faith is the first step to enter the noble path.",
        "source": "X53n0841_023:0495c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言先時未以世道斷修惑者謂凡夫時未曾用有漏六行斷惑也。",
        "translation": "To say that he hadn't previously cut off the afflictions of cultivation with the conventional path means that when he was a worldling, he hadn't cut off the afflictions with the six contaminated practices.",
        "source": "X53n0841_023:0496a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至見道中名初果向者謂從苦忍乃至第十五心總名為向未名為果也。",
        "translation": "He's called heading toward the first realization in the path of seeing, meaning that from the tolerance of suffering up to the fifteenth mental state, the general term is heading toward what's not yet called the realization.",
        "source": "X53n0841_023:0496a08_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言六十四人者但從第三向論若兼初二向即有七十三人並是向道以此章中約十五心建立故未得果也。",
        "translation": "He says there are sixty-four people who are only speaking from the third direction, but if we were to discuss both the first two directions, there would be seventy-three people who are headed toward the path. In this chapter, about fifteen mental states are established, so they haven't yet attained fruition.",
        "source": "X53n0841_023:0496a09_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言隨三向住果者論云阿羅漢果必無初得見道無容斷修惑故世道無容離有頂故所以第四必無初得。",
        "translation": "Those who speak of the fruit of abiding in the following three directions are those for whom the treatise says there must be no first attainment of the fruit of the arhat.",
        "source": "X53n0841_023:0496a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言信解者婆沙云依見道所攝信得修道所攝信勝解又云依向信得果勝解又云以信為先心脫三結故名信解。",
        "translation": "Those who speak of faith and understanding say the Vibhāṣā council relies on faith that's included in the path of seeing to attain the faith and understanding that's included in the path of cultivation, and it's also said that faith is the first mental state to escape the three bonds, so it's called faith and understanding.",
        "source": "X53n0841_023:0496a14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見至者又云依見道所攝見得修道所攝見又云以見為先心脫三結故名見至又云由慧增上力正見顯故。",
        "translation": "Relying on views that are included in the path of seeing, he attains views that are included in the path of cultivation, and he says that because views precede the mind's liberation from the three bonds, he's called arriving at views and because the right view is revealed by the superior power of wisdom.",
        "source": "X53n0841_023:0496a16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所至者如疏解。",
        "translation": "That which is attained is explained in the commentary.",
        "source": "X53n0841_023:0496a18_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言二聖信慧互增者理實信解信增見至慧增今言互者顯不具二故言互增非如東西互見也。",
        "translation": "When it comes to the mutual increase of faith and wisdom of the two sages, it's true that faith and understanding increase, and faith and wisdom increase when it's expressed as mutual, so it's not expressed as mutual increase like mutual views of things.",
        "source": "X53n0841_023:0496a18_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言未起勝果道者正理云又非得果時即有勝果道所斷煩惱離繫得生道類忍不能引彼離繫得故(准此先所斷惑隨其所治更起勝道引離繫得為勝果道也)。",
        "translation": "Those who say the path to ultimate fruition has yet to arise say that the correct principle is that it's not the time when the fruit is attained that's when the path to ultimate fruition is attained where afflictions removed, free from binding, are produced, and the path to type of forbearance can't be brought about by freeing oneself from binding.",
        "source": "X53n0841_023:0496a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言非諸預流皆受七返者謂中間亦有不滿七而得涅槃故。",
        "translation": "The claim that not all stream-winners experience seven rebirths means that there are some in between who don't complete seven but attain nirvāṇa.",
        "source": "X53n0841_023:0496a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諸無漏道總名為流者釋預流名謂無漏道趣向涅槃故名為流。",
        "translation": "The general term for the uncontaminated paths is \"streams.\" This explanation of the term \"streams of advancement\" means that the uncontaminated paths lead to nirvāṇa and are therefore called streams.",
        "source": "X53n0841_023:0496b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "最初至得名之為預者昔名入流者義亦同也。",
        "translation": "Those who first arrived at it are called pre-current, which was formerly called entry into the stream and has the same meaning.",
        "source": "X53n0841_023:0496b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言應目第八者謂苦法忍居第八故智度論說見道名八人地舊又解云四向四果從後向前初向第八故婆沙云第八聖者謂隨信隨法行從勝數之是第八故今章及新並無此解一來不還非定初得者謂二三兩果若超越者即是初得若次第者即非初得此預流果不得即已得必在初故名為定。",
        "translation": "The expression should be interpreted as the eighth meaning that the tolerance of suffering and dharmas resides in the eighth place, so the Wisdom and Understanding Treatise says that the path of seeing is called the eighth stage of people.",
        "source": "X53n0841_023:0496b03_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一具得果向無漏道者十六心中前十五心是向第十六心是果故具二道也。",
        "translation": "One complete attainment of the fruit and heading toward the uncontaminated path means that the first fifteen of the sixteen mental states are heading toward the fruit, and the sixteenth is the fruit; therefore, it's complete with two paths.",
        "source": "X53n0841_023:0496b09_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二得見修無漏道者亦以第十六是修道故具二道也。",
        "translation": "Those who attain the second view cultivate the uncontaminated path because the sixteenth mind is cultivated and therefore fully possesses the two paths.",
        "source": "X53n0841_023:0496b10_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三於十六心流遍至得者謂遍歷十六心皆起得至身也非謂得果名得。",
        "translation": "Third, the stream of attainment in the sixteen ... refers to the pervasive passage through the sixteen ... minds that gives rise to the body of attainment, not the attainment of the fruit called attainment.",
        "source": "X53n0841_023:0496b11_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言第八三義俱闕者一但是向道闕於果道二唯見闕修三但是初念未遍十六心雖是聖道不名預流果。",
        "translation": "The eighth one has three missing meanings: first, it's only the path of dedication and not the path to fruition; second, it's only seeing and not cultivating; and third, it's only the first thought that hasn't yet pervaded the sixteen minds, even though it's a noble path and isn't called the fruit of stream-winning.",
        "source": "X53n0841_023:0496b13_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言皆七等故說極七生者總而論之有四七生等是七故但言七生即攝皆盡如七葉樹別別枝上皆有七葉非唯有七以數等故但言七也准論七生約一趣說非約兩趣又約欲界不約上界以上流那含極有頂有第八生故問如何得知人天別說非合說耶答經言天及人故。",
        "translation": "The expression \"all seven and so forth, therefore it's said to be the ultimate seven births\" means that in a nutshell, there are four or seven births, and so forth, which are seven.",
        "source": "X53n0841_023:0496b15_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言七步虵者婆沙云如七步虵四大力故不減七步由毒勢力故不越七步。",
        "translation": "He said, \"Seven steps to the hair:\" The Vibhāṣā says it's like seven steps to the hair and four great powers so it doesn't lose seven steps because of the power of poison and doesn't go beyond seven steps.",
        "source": "X53n0841_023:0496b20_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四日瘧者舊云諸瘧者發時不同或有半日發半日不發或有一日發一日不發或有極遲者一日二日三日不發至第四日法爾必發此名第四日瘧聖道亦爾至第七生必斷餘惑而般涅槃此取法爾極遲分限以喻第七非取數喻正理破云如七步虵所螫此喻不然。",
        "translation": "The four days of malaria is an old expression that says the onset of malaria varies from half a day to half a day without onset, or a day to a day without onset, or a day to a day that's extremely late, or a day or two or three days without onset until the fourth day when it will definitely occur.",
        "source": "X53n0841_023:0496b21_10",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽量定者過此齊限亦得住故新云此是法爾毒力不越七步。",
        "translation": "A person whose life span is limited goes beyond this same limit and also attains abiding, so the new saying is that the poisonous power of Fār doesn't extend beyond seven steps.",
        "source": "X53n0841_023:0496c03_11",
        "is_bad_quality": false
    },
    {
        "source_sentence": "壽量限定者自是別緣如說火能燒水能溺等皆能殺人而樹提不燒念佛不溺豈水火之喻非乎。",
        "translation": "A person whose life span is limited is self-contained by a different condition like saying fire can burn, water can drown, and so forth, all of which can kill people, but Jyoti doesn't burn and Nianfo doesn't drown, isn't the metaphor of water and fire false?",
        "source": "X53n0841_023:0496c04_12",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言法爾自得苾蒭形相者婆沙云如五百仙人在伊師迦山中修道本是聲聞出無佛世獼猴為現佛弟子相彼皆學之法證獨覺果無學不受外道相故。",
        "translation": "When they say that Dharma is self-acquired in the form of a monk, the Prātimokṣa says, \"Suppose 500 sages are cultivating on Mount Ishika, originally śrāvakas who emerged from the Buddhaless world as monkeys to present the characteristics of Buddha disciples, and they all learn the Dharma and realize the fruit of pratyekabuddha because they're not trained and don't accept the characteristics of non-Buddhists.",
        "source": "X53n0841_023:0496c06_13",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一以不生長退墮業者謂不造新惡趣業也二違彼生長業與果者謂舊招惡趣不定業者不能與果若有定業不得預流故。",
        "translation": "One, by not growing karma and falling back, it means not creating karma in new bad destinies. Two, by going against the karma that grows and produces results, it means old karma that brings bad destinies and indeterminate karma can't produce results if there's determined karma that can't be stream-winner.",
        "source": "X53n0841_023:0496c09_14",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三強盛善根者謂無漏善根也。",
        "translation": "Three, strong good roots means uncontaminated good roots.",
        "source": "X53n0841_023:0496c11_15",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四加行意樂俱清淨者得不作律儀也。",
        "translation": "Four, those whose intentions are both purified by applied practices and attained by abstinence from performing restraints.",
        "source": "X53n0841_023:0496c12_16",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五謂諸有惡趣尚不起忍者此是以劣況勝義通二釋一云由忍不墮惡趣故所以有惡趣之業不能生忍善根況得預流果耶二云忍尚不起惡趣之業名不起忍且從前解又婆沙云諸預流者雖未永斷修所斷結而已永斷見所斷結闕一資糧不墮惡趣如車有二輪有所運載鳥有二翼能飛虗空闕一不可成就此亦如是故預流者不墮惡趣。",
        "translation": "Five, it means that there are bad destinies that don't yet give rise to ninjas, which are inferior, but the ultimate truth is that there are two interpretations: one says that because forbearance doesn't lead to falling into bad destinies, the good roots of forbearance can't arise from the actions of bad destinies, so how could they attain the fruit of pre-flow? The second says that forbearance doesn't yet give rise to the actions of bad destinies, which is called not giving rise to forbearance and is explained in the previous section.",
        "source": "X53n0841_023:0496c12_17",
        "is_bad_quality": false
    }
]