[
    {
        "source_sentence": "閑居編第二十二",
        "translation": "Leisurely at Home: 22nd Edition",
        "source": "X56n0949_022:0898b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宋孤山沙門　智圓　著",
        "translation": "Song Gushan śramaṇa Zhiyuan",
        "source": "X56n0949_022:0898b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謝吳寺丞撰閑居編序書",
        "translation": "Xie Wusi Chancellor's Preface to the Compilation of Notes on the Leisure Life of the Buddha",
        "source": "X56n0949_022:0898b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二月六日沙門某謹齋沐撰書白于寺丞(左右)某不接文會以踰年已而慕高義渴嘉談無日忘之也某近以故疾遽作伏枕閑房今月朔旦侍疾者俄云錢唐主簿李君遣介貽書及發亟一闚乃寺丞所撰某之拙文集曰閑居編者之盛序焉由是霍然驚起凭几俯讀舒卷沈翫疑乎紙變墨渝何止於三復哉而其辭炳炳然其旨淵淵然較古今之得失論文理之勝負盡在此矣而於某之所作發仲尼華衮之襃有伯喈色[糸*系]之歎此亦過當矣竊自疑之某之狂言果非也果是也果非也而寺丞情之所鍾而曲加粉澤且寺丞閑默端雅言為世範非容易而談者豈虗授其言哉果是也乃林下病夫狂簡斐然山謳野詠矣矧寺丞負文章之大名乃士林之傑然也雖蠖屈於筦榷將膺揚於代言方且為典為誥以潤色帝業作誓作命以發揮王猷安肯以不世之文以冠野夫之集乎於是乎猶豫於中心者久而忽然獨斷何乎且大君子用心唯道是從不以靜躁分不以形服阻我道之果同也我文之果是也則必當為我發揮之張皇之若然者則寺丞其我之知音乎夫音不易知知音難得寺丞既知之某既得之矣彼挽鹽車者尚能為孫陽之鳴某雖臞瘠困躓晨夕待盡尚能身別寒暑眼分菽麥心有是非豈不能為知音一鳴哉今為寺丞鳴之矣惟寺丞聽之某幼緣宿習雅好空門於齠齓之年即毀其髮壞其服而為浮屠徒也洎年邇升冠頗好周孔書將欲研幾極深從有道者受學而為落髮之師拘束之不獲從志由是杜門閴然獨學無友往往得五經之書而自覽焉雖文字不及盡識句讀不及盡分而好求聖師之指歸而會通其說焉譬若九方堙之相馬略玄黃而談神駿也而與夫嘈嘈誦聲者尋章摘句者已胡越矣讀易也乃知本乎太極闢設兩儀而五常之性韞乎其中矣故曰立天之道曰陰曰陽立地之道曰柔曰剛立人之道曰仁與義是故文王海列四德以演之聖師岳配五常以翼之乃以乾坤首之也繇是知五常者其周孔之化源乎讀書也乃知三皇以降洪荒朴略非百世常行之道其言不可訓故聖師以二帝三王之道作範於後代尊揖讓鄙干戈故以二典首之也雖湯武有救弊之德而非仲尼之本志也故語曰武盡美矣未盡善也讀其詩也乃知有天地然後有夫婦有夫婦然後有父子有父子然後有君臣夫婦其本二儀而首三綱乎故以關睢首之也讀春秋也乃知周室衰狄人猾夏平王東遷號令不行禮樂征伐不出乎天子而出乎諸侯也是故仲尼約魯史而修春秋以賞罸貶諸侯討大夫以正其王道者也故語曰禮樂征伐自諸侯出自諸侯出蓋十世希不失矣且魯隱公逮于昭公十世失政死於乾侯乃其驗乎是以春秋始於周平魯隱也雖先儒之瞽說謂始王賢君者後學從而傳之其如論語聖師之言何唯禮經也弟子記述諸漢儒糅雜諸後賢易置諸故於首篇之所以而悉出於人情諒非乎聖旨也一且既知之於心矣而勇於為學且曰吾雖無師之訓教無友之磋切而準的五經發明聖旨樹教立言亦應可矣於是殺青磨鈆不舍晝夜將欲左攬孟軻之袂右拍楊雄之肩盤游儒官鳴唱文教金口木舌大訓乎衰世使天三王二帝之道不遠復矣無何身嬰羸病頓阻進學忽忽不樂壯志寢微一日自省曰汝釋迦之徒也空華乎世界浮雲乎富貴谷響乎言語掣電乎形命又何嬰病失志至如是乎自是專尋釋典反照心性弃捐萬事會同一心故於嚮者為文之道不能果其志就其業也是以晚年所作雖以宗儒為本而申明釋氏加其數倍焉往往旁涉老莊以助其說於戲人豈不知則某於為文不能淳矣公孫龍之無家司馬遷之多愛乃自貽之也後世有聖如仲尼者其將罪我乎於是孤文片記悉不欲留以逃後世之責耳尋以養病孤山隱居林下有朋自遠方來者每以編紀為勉遂以嚮者之志對焉彼曰何傷乎亦各言其志爾夫三教者本同而末異其於訓民治世豈不共為表裏哉子之所述宜在集之以貽於後也於是乃從其請故後有所得者因而錄之而謌詩文頌錯雜閒出號之曰閑居編亦陸魯望叢書之儔也且欲不出戶庭以貽子孫爾敢冀偶知音而有所發揮乎今覩寺丞所贈之序豈不幸甚乎謹當囑後學輩編其所著使各從其類而首戴雄文用貽後代俾儒者釋者見之而不惑知三教之同歸且免夫詆訶之辭也成我者其寺丞乎若夫前世之賢為僧作序者多矣至如吳翰林(融)之序禪月包中丞之序晝公而但指在謌詩豈能辨明文教惟辭惟理比夫雄文而彼有慙色但所稱者之賢不如貫休皎然爾某寢疾在牀奄忽非久輒陳顛亂之說以敘生平之志以感知音之惠口占成書故不當以文辭見責也既假來學之筆札其字體之誤繆高下之失儀亦不當見責也惟寺永察之煦色方隆自愛為望不宣某白。",
        "translation": "On the sixth day of the second moon, an ascetic, who had been studying for a long time, had not received the Wenhui because of his passing years, but had admired the high meaning and longed for the excellent discussions, and had forgotten it every day.",
        "source": "X56n0949_022:0898b10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "第二十二",
        "translation": "Twenty-two",
        "source": "X56n0949_022:0899b19_1",
        "is_bad_quality": false
    }
]