[
    {
        "source_sentence": "法華玄記十不二門顯妙(并序)",
        "translation": "Fahua xuanji shibuqimen xianmiao (with preface)",
        "source": "X56n0929_001:0356a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "永嘉沙門釋　處謙　述",
        "translation": "Yongjia śramaṇa Shi Lüqian said",
        "source": "X56n0929_001:0356a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖人之教或廣或略存諸眾典原其化意盡歸於法華者大藏群經根此也然聖人出世本以己證導諸群緣蓋物機情別未可一之於道由是權之於前本之於後使循其迹而歸之源至於斯經也畢矣文云雖設種種道其實為佛乘特令揆昔昭然可見也吾祖親承斯旨九旬敷唱允叶聖心洎荊溪記之尚患十妙文繁觀道難通於是撮乎妙旨十門點示意深言遠文而雖迂舊解不詳各固所是繁於異論雜乎粹旨余不揆疎昧深所惜哉故特遵先範去諸異同專取文旨再為注解目為顯妙且符記主之意也文云此下但直申一理使一部經旨皎在目前根於此者不其然歟若夫分文對相辨正舛訛存此舊解此不復云。",
        "translation": "This is the root of the scriptures in the Tripiṭaka, but the noble person's appearance in the world is originally based on his own realization and guiding all sorts of conditions, even though there's no single path that can be distinguished according to the capacities of things and the feelings of others.",
        "source": "X56n0929_001:0356a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時",
        "translation": "time",
        "source": "X56n0929_001:0356a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皇宋熈寧四年冬十一月既望日於錢塘淨住方丈東軒序法華玄記十不二門顯妙解然此迹門談其因果及以自他。",
        "translation": "On the fifteenth day of the eleventh month of the fourth year of the Huang Song period, he was at the Dongxuan of the Qingtang Jingzhu fangzhu preface to the Fahua xuanji shifu xianmyao jie, which is a profound interpretation of the traces of the teaching that talks about cause and effect and self and others.",
        "source": "X56n0929_001:0356a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因等法相玄義備矣。",
        "translation": "The profound meaning of cause and other aspects of reality is complete.",
        "source": "X56n0929_001:0356b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "使一代教門融通入妙。",
        "translation": "It causes the teachings of the past generation to blend together and enter into the marvelous.",
        "source": "X56n0929_001:0356b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直申一理經旨在茲原夫聖人為一施三群情麤別至此而復情祑理妙一代融通百界成佛出世大意妙盡於此。",
        "translation": "The sutra directly describes the purpose of the One Principle, which is to explain that the noble person gives to one group of three feelings that are coarse and specific up to this point, and then the feelings are hard, the principle is marvelous, and the one generation interpenetrates the one hundred realms, becoming a buddha, and the great intention to transcend the world is wonderfully complete here.",
        "source": "X56n0929_001:0356b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故凡諸義釋皆約四教及以五味。",
        "translation": "Therefore, all explanations of the meaning are limited to the four teachings and the five flavors.",
        "source": "X56n0929_001:0356b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "待對教味一代相形權巧調引俾機識妙苟能了妙即了是開豈容別求。",
        "translation": "When the flavors of the teachings are matched, the characteristics of a generation are shaped, expediently adjusted, and guided so that the person can understand the subtle, that is, the understanding is unlocked, and there's no room for searching for it separately.",
        "source": "X56n0929_001:0356b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意在開教悉入醍醐。",
        "translation": "The idea is that the profound teaching is fully penetrated into Daigo.",
        "source": "X56n0929_001:0356b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "了妙開麤待對教味一切成絕絕尚無狀豈復滯麤判而即開絕無過此四十餘年未暢厥旨今經一啟聖意獨彰妙教醍醐心佛眾生一而矣。",
        "translation": "To understand the subtle and unlock the coarse pending the confrontation of all the flavors of the teaching is absolutely, completely, and yet stateless, how could it be that the coarse is judged to be unlocked and absolutely, without exception, unexplained for more than 40 years? Now, once the sūtras are revealed, the noble intention is to uniquely highlight the subtle teaching, the ghee, the mind, the buddha, and sentient beings as one and the same.",
        "source": "X56n0929_001:0356b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀心乃是教行樞機仍且略點寄在諸說。",
        "translation": "Contemplation of mind is the pivotal point of the teaching's practice, so let's just briefly point it out in the explanations.",
        "source": "X56n0929_001:0356b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上開妙解已一代融通今示用解觀心全心即名妙觀非此觀心教將何設行依何行故曰觀心乃教行樞機也教既純圓純妙行必諸妄惑除依教立行此之謂也故記主云陰等十境唯在三教舊云對偏則無圓常教有且夫相對妙教麤頂在昔豈絕待圓融反却在妄心也正名此名不正行將安寄。",
        "translation": "After the above introduction of subtle understanding, the whole mind now shows that using understanding to contemplate the mind is called subtle contemplation. If it weren't for this contemplation of the mind, what would the teaching set up and what would the practice depend on? Therefore, it's called contemplation of the mind being the pivot of the teaching and practice.",
        "source": "X56n0929_001:0356b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或存或沒非部正意。",
        "translation": "Whether it exists or disappears is not the correct intention of the school.",
        "source": "X56n0929_001:0356b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行門雖要部非正談故存沒互出止觀專論則行相方備。",
        "translation": "Although the practice aspect is essential, the school doesn't discuss it correctly; therefore, it's stored or not, and it's mutually exclusive to the treatises on calming and insight, so the practice aspect is only complete.",
        "source": "X56n0929_001:0356c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故縱有施設託事附法或辨十觀列名而已。",
        "translation": "Therefore, even though there are assumptions, we might define the ten contemplations and list their names.",
        "source": "X56n0929_001:0356c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀即是心能所無二理絕觀圓義復何陰今約觀大義唯斯三種或用託事依觀見理從行附法二種亦然義雖開三種觀唯一本文觀心雖則非正三相備有故此列示矧以五祖親承有在了一代之教意宗法華為根本述本之要唯教與觀記主得意深叶祖承教觀之設唯斯數句斷盡化源根乎本要釋或失措教觀從設。",
        "translation": "Although the contemplation is mind, the subject and object have no two principles, and the absolute contemplation is perfect, what other elements are there? Now, regarding the great meaning of contemplation, there are only these three kinds, or we may use the entrustment of things to rely on the contemplation to see the principle from the practice, and the two kinds of attachment to the Dharma are also true. Although the meaning opens up three kinds of contemplation, only this article contemplates mind, although it's not correct, the three aspects are complete, so we list them.",
        "source": "X56n0929_001:0356c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所明理境智行位法能化所化意在能詮詮中咸妙為辨詮內始末自化。",
        "translation": "The principle, objective, cognitive, practical, and positional factors that are explained are capable of transforming and those that are transformed are intended to be subtle in their ability to explain the beginning and end of self-transformation within the explanation.",
        "source": "X56n0929_001:0356c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上已總敘此下別陳總別相顯聖旨彌彰然本文廣談境智及以自化為解首顯能詮教也能詮之妙權別為總一部咸然何法是妙乃以境智始末自他示其妙相。",
        "translation": "The above has been summarized here, and the following is a separate statement of the general and specific aspects that show the noble intention to be clear, but this article discusses in detail the wisdom of objects and the understanding of self-creation as the first to show the teaching of Nengquan, the subtlety of the right to distinguish between Nengquan and the general, and the salt of the Dharma that is subtle is the beginning and end of the wisdom of objects and the self and others to show its subtle aspects.",
        "source": "X56n0929_001:0356c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故具演十妙搜括一化出世大意罄無不盡。",
        "translation": "Therefore, the ten subtle aspects of the Sarvâstivāda teaching are exhaustive.",
        "source": "X56n0929_001:0356c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "出世大意為妙而興今既談妙罄乎佛旨佛旨者何眾生性是依性談教豈復別途教觀一致諸法實相遮那體徧經文如是因果俱妙始絕絕麤一化功畢意盡於此。",
        "translation": "Now that we're talking about the subtle, the Buddha's will is exhausted. What's the Buddha's will? The nature of sentient beings is based on the nature, so why is there a separate path of teaching and contemplating the true characteristics of all things?",
        "source": "X56n0929_001:0356c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故不可不了十妙大綱。",
        "translation": "Therefore, it's impossible not to understand the Outline of the Ten Marvels.",
        "source": "X56n0929_001:0356c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十妙大綱唯佛究了初心若達與佛何殊眾生開佛知見在茲稟斯教者必也如然雖有肉眼名為佛眼此其證也。",
        "translation": "The ten subtle outlines are only for the Buddha to understand, and if he attains them, how are they different from the Buddha? Sentient beings who have opened the Buddha's vision and are here to receive this teaching must do so, even though they have the physical eye called the Buddha's eye.",
        "source": "X56n0929_001:0356c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故撮十妙為觀法大體。",
        "translation": "Therefore, the ten subtle elements are summarized as the great essence of the contemplation dharma.",
        "source": "X56n0929_001:0357a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若了十妙即此了心是觀大體用此造境無不真實世間相常觀與經合文義相符。",
        "translation": "If he understands the ten subtleties, then he understands that this mind is the great essence of contemplation and uses this to create an object that's not untrue or real, the worldly aspects of constant observation are consistent with the sūtras, text, and meaning.",
        "source": "X56n0929_001:0357a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若解迹妙本妙非遙應知但是離合異耳因果義一自他何殊故下文云本迹雖殊不思議一。",
        "translation": "If you understand that the traces are subtle and the original is subtle, you should know that they're merely separate and distinct, and the meaning of cause and effect is the same.",
        "source": "X56n0929_001:0357a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既達迹妙豈與本殊離合雖異妙理元同引證分明宜加識信。",
        "translation": "Having understood the subtlety of the manifest, how could it be different from the original? Although the isolation and confluence are different, the subtle principle is the same, and it's appropriate to add consciousness and faith.",
        "source": "X56n0929_001:0357a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "況體宗用祇是自他因果法故況復教相祇是分別前之四章使前四章與諸文永異。",
        "translation": "What's more, the essence, the tenets, and the functions are simply the law of cause and effect for self and others, so why wouldn't the teachings and characteristics simply discriminate the previous four chapters so that the previous four chapters are always different from the other texts?",
        "source": "X56n0929_001:0357a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上了釋名本迹咸等了四章與名無別總三為名體等何異舉一例諸不俟終目。",
        "translation": "The above explains that the name, its origin, traces, and so forth, and the four chapters are not distinct from the name, but the three in general are the name, the essence, and so forth.",
        "source": "X56n0929_001:0357a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若曉斯旨則教有歸。",
        "translation": "If you understand this idea, then the teaching has a conclusion.",
        "source": "X56n0929_001:0357a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經言雖設種種道其實為佛乘佛乘者何妙而已矣。",
        "translation": "Although the sūtras say that there are various paths, they're really the Buddha-vehicle and the Buddha-vehicle, but what's marvelous about them?",
        "source": "X56n0929_001:0357a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一期縱橫。",
        "translation": "\"A period is vertical and horizontal.",
        "source": "X56n0929_001:0357a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "期猶代也一代即縱橫也時縱教橫約顯談法華之前縱橫白固未知所歸來至今經顯談歸本群情驚駭妙教一興大事發明次文見矣。",
        "translation": "A period is like a generation, and a generation is a vertical and horizontal time, a teaching, and a horizontal statement.",
        "source": "X56n0929_001:0357a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不出一念三千世間即空假中。",
        "translation": "Not beyond a single thought are the three thousand worlds that are empty, provisional, and intermediate.",
        "source": "X56n0929_001:0357a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直申妙旨顯示佛乘一念三千即空假中在此而已夫一念心起必對一境心不並慮逐境而生生滅交遷未曾蹔捨權乘眾教雖復斷之不能除根情境猶存與教共住縱橫既存妙性莫彰今點一念與三千同其同如何一念是理三千世間即空假中妙符念性念根即除真尚永絕豈復存妄真妄俱宿不二門開諸法實相入佛境界三無差別一性咸同含生本具非造所成妙法堂奧上根直入即登初住縱橫之相一切歸源一門歸然諸門皆爾此唯得意功忌存情或封執語言而謂了達其猶緣木求魚應無得理。",
        "translation": "Directly explain the marvelous purpose of showing the Buddha vehicle a single thought of the 3,000 worlds that is, emptiness, falsehood, and nothing more.",
        "source": "X56n0929_001:0357a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理境乃至利益咸爾。",
        "translation": "The principle, object, and even benefit are all the same.",
        "source": "X56n0929_001:0357b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "境理既然下九由此十法皆妙皆成佛乘今經題目立此妙名。",
        "translation": "Since the objective and the principle are the next nine, the ten dharmas are all marvelous and all become the Buddha vehicle.",
        "source": "X56n0929_001:0357b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則止觀十乘成今自行因果起教一章成今化他能所。",
        "translation": "Then, the ten vehicles of calming and insight become the present self-causation, and the initiating teaching chapter becomes the present transformation of what's possible for others.",
        "source": "X56n0929_001:0357b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則者連上辭也則知止觀十乘行此自行因果起教一章用此化他能所方見兩部文名義成一致。",
        "translation": "This is a link to the above phrase, which then shows that the practice of the ten vehicles of calming and contemplating this self-causation, the arising of effects, and the teaching of one chapter using this transformation of others, the agent, and the object are then seen to be consistent with the names of the two texts.",
        "source": "X56n0929_001:0357b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "則彼此昭著法華行成使功不唐捐所詮可識。",
        "translation": "They are then mutually illuminating, showing that the Fahua practices are accomplished so that their merit isn't lost, and the explanations can be recognized.",
        "source": "X56n0929_001:0357b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "照明著顯以行成教以教輔行功不唐捐者教行斯在如此所詮故云可識。",
        "translation": "The illuminating attachment shows that the teaching is accomplished by the practice and the practice is aided by the teaching, and the merit of the practice is not lost.",
        "source": "X56n0929_001:0357b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故更以十門収攝十妙。",
        "translation": "Therefore, it's also called the ten subtleties collected in ten categories.",
        "source": "X56n0929_001:0357b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欲教成行非門不入教既妙矣舉教而行豈復異途故下文云重述十門令觀行可識。",
        "translation": "If you want to teach to become a practitioner, you can't enter without going through the ten subtle approaches.",
        "source": "X56n0929_001:0357b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者為實施權則不二而二開權顯實則二而不二。",
        "translation": "Why is it that when implementing the provisional, it's not two but two? When opening the provisional and revealing the real, it's two but not two.",
        "source": "X56n0929_001:0357b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "就今經談設化之意施則全實成權開則權全是實權實不二妙在化源以此為門入乎佛乘如指諸掌。",
        "translation": "From the perspective of the present sūtra's discussion of the designation of the teaching, the bestowal is the whole truth becoming the expedient, and the opening is the expedient being the whole truth, and the truth not being two, the marvelous source of the teaching being the entryway into the Buddha vehicle like pointing the fingers at the palms of your hands.",
        "source": "X56n0929_001:0357b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法既教部咸開成妙故此十門不二為目。",
        "translation": "Since the Dharma and doctrinal divisions are all revealed to be marvelous, the ten aspects are therefore not two as the goal.",
        "source": "X56n0929_001:0357c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "宮嗇不得其門不見宗庿之美至道不得其門不覩妙法堂奧不二為門豈容情見門立不見誰之過與。",
        "translation": "The palace miser doesn't see the beauty of the ten departments, the supreme way doesn't see the beauty of the sect, the path doesn't see the profound dharma hall, and the gate of nonduality is the gate, how could it be possible for people to see the gate and not see whose fault it is?",
        "source": "X56n0929_001:0357c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一門下以六即撿之。",
        "translation": "Under each aspect, he would examine it with the six immediate alternatives.",
        "source": "X56n0929_001:0357c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "門既成妙入者作佛故一一門撿以六即顯佛高下不生功濫門之功也。",
        "translation": "Since the gate has become marvelous, those who enter will become buddhas, so each gate will be checked by the six namely, the manifestation of the Buddha's superior and inferior unproduced merits and the merits of the gate.",
        "source": "X56n0929_001:0357c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本文已廣引誠證此下但直申一理使一部經旨皎在目前。",
        "translation": "This article has already extensively cited Chengzheng's explanation of the next part of the story, which is to directly explain the single principle so that the meaning of the sutra is clear at the present time.",
        "source": "X56n0929_001:0357c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一理直了不難異途經旨在目豈虗言哉。",
        "translation": "The one principle is straightforward, not difficult, and the aim of the different paths of the scriptures is not just words.",
        "source": "X56n0929_001:0357c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者色心不二門二者內外不二門三者修性不二門四者因果不二門五者染淨不二門六者依正不二門七者自他不二門八者三業不二門九者權實不二門十者受潤不二門是中第一從境妙立名第二第三從智行立名第四從位法立名第五第六第七從感應神通立名第八第九從說法立名第十從眷屬利益立名。",
        "translation": "The first is the nonduality of form and mind, the second is the nonduality of internal and external, the third is the nonduality of cultivation, the fourth is the nonduality of cause and effect, the fifth is the nonduality of defilement and purity, the sixth is the nonduality of reliance and directness, the seventh is the nonduality of self and other, the eighth is the nonduality of the three activities, the ninth is the nonduality of expedient and real, and the tenth is the nonduality of sensation and benefit.",
        "source": "X56n0929_001:0357c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十妙對門多少不同皆從義便雖則各從於義不忘本數咸立十也。",
        "translation": "The ten subtle aspects of the reasoning are all different in number and in meaning, even though each follows the meaning and doesn't forget the original number, they're all designated as ten.",
        "source": "X56n0929_001:0357c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一色心不二門者且十如境乃至無諦一一皆有總別二意總在一念別分色心。",
        "translation": "One is the gate of form and mind not being two, and each of the ten, such as objects and even the truth of nothing, has two meanings of general and specific, which are always in one thought and separately distinguished from form and mind.",
        "source": "X56n0929_001:0357c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色心一門從境妙立境有七科法相甚廣今以色心然而攝之攝之之相下文可見分色心者不二成二妄之境也其體一者二即不二妙之門也故以總別斷盡十門二不二相使麤妙昭著門旨不壅是知境妙不二之門在乎一念色心體一得此之門寶乘即乘道場而至此一既爾下之九門觸類而達達不俟再思。",
        "translation": "The one aspect of form and mind is posited from the subtlety of the object, which has seven categories and a wide range of characteristics. Now, we can see below that the subset of form and mind that's not two becomes two false objects, and the essence of which is one, which is the subtle approach of not two.",
        "source": "X56n0929_001:0357c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者初十如中相唯在色性唯在心體力作緣義兼色心因果唯心報唯約色。",
        "translation": "Why is it that in the first ten thusnesses, the characteristic is only in form and the nature is only in mind, and the force that creates the conditioned meaning is both form and mind, and the cause and effect is only mind and the result is only about form.",
        "source": "X56n0929_001:0358a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此十如境分色心也下之六境分對色心各從於義在文其詳。",
        "translation": "These ten thusnesses are only in form and mind as objects, and the next six objects are in form and mind as objects, each according to their meaning in the text.",
        "source": "X56n0929_001:0358a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二因緣苦業兩兼惑唯在心四諦則三兼色心滅唯在心二諦三諦皆俗具色心真中唯心一實及無諦准此可見。",
        "translation": "The twelve causes and conditions of suffering and action are both confusion and only mind, and the four truths are three parts of form and mind, and cessation is only in mind, the two truths, and the three truths are both conventional and include form and mind, and the true, middle, and only mind, the one true and no truths, as seen here.",
        "source": "X56n0929_001:0358a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此分對七科法相既成二皆情境也真如隨緣成於九界佛性斯隱不二門閉今示此境俾曉情相為下不二入門之本然真中一實皆理境也何情之有法雖屬理分對在情但破其情一時歸性次文可見矣。",
        "translation": "These seven categories of opposites both form and form two, which are all objects of discriminations, truly are, according to their conditions, formed in the nine realms, the buddha-nature, and thus the hidden gate of nonduality is closed. Now, we show this object so that we can understand that the objects of discriminations are the basis of the lower gate of nonduality, and that the single reality in truth is the object of principle.",
        "source": "X56n0929_001:0358a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既知別已攝別入總。",
        "translation": "Having known the distinct, he then gathered the distinct into the general.",
        "source": "X56n0929_001:0358a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既知別已結上也攝別入總起後也。",
        "translation": "After knowing the distinct, he concludes by gathering the distinct into the general and then initiating the latter.",
        "source": "X56n0929_001:0358a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切諸法無非心性一性無性三千宛然。",
        "translation": "\"All things are nothing but mind nature, and the three thousand are universally the same in nature and non-nature.",
        "source": "X56n0929_001:0358a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此釋總相也上既已示別相了別為總乃直示云一切諸法無非心性等此即攝別入總了總即性故使七科咸成不二即此是門達乎佛乘佛必三身點示三相彰一妙體心性中也無性空也三千假也故云夫三諦者天然性德今用此為門上根一觀直入初住或內外凡三諦妙理始終如此一部經旨初後咸然此門若了至下不難也。",
        "translation": "This explanation of the general aspect also shows that since the above has shown the distinctive aspects and understood the distinctive as the general, it's directly shown that all things are nothing but mind nature, etc. This is the point of gathering the distinctive into the general, understanding the general as nature so that the seven categories will all become nondual, meaning that this is the gate to reach the Buddha vehicle, the Buddha must point to the three bodies, show the three aspects, reveal the one marvelous essence, mind nature, middle, non-nature, emptiness, and the 3,000 provisional, so it's said that the natural nature of the three truths is virtue, and now this is the gate through which the higher faculties and one contemplation directly enter the first abode, or both internal and external worlds, and the marvelous principle of the three truths is always the same, and the purpose of this sūtra is not difficult at first and last, if understood to the end.",
        "source": "X56n0929_001:0358a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知心之色心即心名變變名為造造謂體用。",
        "translation": "You should know that the mind's form and mind are the mind's names, and changes are called creations, which are essences and functions.",
        "source": "X56n0929_001:0358b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此愽釋上為二異名上分色心即是心性之一變為色心之二妄無別妄全真成妄亦名事造亦名迷用全水為波其例恒然故此示之。",
        "translation": "This is a brief explanation of the two different names for form and mind, the upper part of which is the mind nature, one of which is transformed into the two delusions of form and mind, and the lack of distinction between delusion, the whole truth becoming delusion, which is also called the creation of things, and delusion in terms of function, which is always the same as the whole water becoming waves.",
        "source": "X56n0929_001:0358b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則非色非心而色而心唯色唯心良由於此。",
        "translation": "This is why it's not form and not mind, but form and mind only, and this is the good reason why it's only form and mind.",
        "source": "X56n0929_001:0358b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此重釋上了妄成真也上既全真作妄全即了妄全真三障即三德波是水種一切皆成故非色非心而下封三諦顯矣宛轉相成良由於此。",
        "translation": "This is a re-explanation of the above understanding of delusion into truth, which is both true and perfect, making delusion perfect, which means understanding delusion, perfect truth, the three hindrances, which are the three virtues, and waves that are seeds of water, which are all formed, so it's not form and not mind, and the lower three sealed truths are evident, which are formed from this.",
        "source": "X56n0929_001:0358b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知但識一念徧見己他生佛他生他佛尚與心同況己心生佛寧乖一念。",
        "translation": "Therefore, it's known that just one thought of consciousness universally sees oneself, others produce buddhas, others produce other buddhas, yet they're the same as mind, so why wouldn't one thought of oneself produce buddhas?",
        "source": "X56n0929_001:0358b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若如此識一念之心全三德性自他生佛即此念是學者若然佛從誰有耶。",
        "translation": "If this consciousness of a single thought completely characterizes the three virtues of the mind, then other-born buddhas are born from this thought, and if that's the case, from whom do buddhas arise?",
        "source": "X56n0929_001:0358b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故彼彼境法差而不差。",
        "translation": "Therefore, there's a difference between that and that object and principle that's not different.",
        "source": "X56n0929_001:0358b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "未到今經三法成差差即不差妙名益顯也。",
        "translation": "Before we get to the three things in this sutra, the difference is that they are not different, and the marvelous name is more apparent.",
        "source": "X56n0929_001:0358b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二內外不二門者凡所觀境不出內外。",
        "translation": "The second aspect of nonduality between internal and external is that whatever object is being contemplated isn't internal or external.",
        "source": "X56n0929_001:0358b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "內外分境唯約所觀妄境成二非謂不二却分內外文云迷謂內外悟唯一心然內外之相此三法分咸諸文隨諸法相立內外者來至今經咸成不二皆可入理名理為門。",
        "translation": "The internal and external parts of the object only form two according to the deluded object that's being contemplated, not that they're not two. The text says that delusion refers to internal and external aspects, but awakening is only the mind, and the internal and external aspects of these three parts of the Dharma are established according to the characteristics of the dharmas.",
        "source": "X56n0929_001:0358b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "外謂託彼依正色心即空假中妙故色心體絕唯一實性無空假中。",
        "translation": "Externally, it's called relying on the correct form and mind that's empty, fake, and middling, so the essence of form and mind is absolutely unique in its true nature, without being empty, fake, or middling.",
        "source": "X56n0929_001:0358b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "託彼依正立外色心今達此境空假中妙此境即絕唯是一性空假中相亦須無狀卓然妙性與誰對待立外依正耶。",
        "translation": "Relying on that which is correctly established outside of form and mind, the present realizes that this object is empty, fake, and medium, and the marvelous thing about this object is that it's only the single nature, empty, fake, and medium, and the other must be without shape or form, and who is it that's correctly established outside of that which is correctly relied upon?",
        "source": "X56n0929_001:0358b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色心宛然豁同真淨無復眾生七方便異不見國土淨穢差品。",
        "translation": "'Form and mind are just as vast and true and pure, and there are no more seven ways sentient beings differ and don't see the difference between the pure and defiled qualities of the land.'",
        "source": "X56n0929_001:0358c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "色心宛然同真清淨順妙空蘊無復眾生淨穢國土依正俱泯色心外相一切空淨。",
        "translation": "Form and mind are just as truly pure and consistent with the subtle aggregate of emptiness, and there are no more sentient beings who are pure and defiled by the land, and both form and mind are externally marked by all emptiness and purity.",
        "source": "X56n0929_001:0358c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而帝綱依正終自炳然。",
        "translation": "Yet, Di Gang's basis and principle are ultimately distinct.",
        "source": "X56n0929_001:0358c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蘊而即立妙假斯成說雖前後圓融一時直申一理門門如此。",
        "translation": "Although the aggregate is immediately established, the subtle hypothesis is accomplished by explaining that the prior and subsequent are perfectly integrated at one time and directly express the single principle through this approach.",
        "source": "X56n0929_001:0358c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所言內者先了外色心一念無念唯內體三千即空假中。",
        "translation": "Those who speak of the internal first understand the external form mind, one thought, no thought, only the internal body of the three thousand that is, emptiness, provisional, and intermediate.",
        "source": "X56n0929_001:0358c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一念若存內外成隔剎那無亡色心相一體圓性全乎三千空假中是。",
        "translation": "If a single thought exists, internal and external become separated, moment by moment, without loss, the form and mind are one and the same, and their perfect nature is all of the three thousand that is empty, provisional, and intermediate.",
        "source": "X56n0929_001:0358c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則外法全為心性心性無外攝無不周十方諸佛法界有情性體無殊一切咸徧。",
        "translation": "Then, external dharmas are all mind nature, and mind nature has no external inclusion or non-perimeter, and the nature and essence of sentient beings in the Dharma realm of the ten directions are not different, and all are universal.",
        "source": "X56n0929_001:0358c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妄念既除外即同內諸佛與性一尚不立曷分二焉一切咸徧豈作意乎。",
        "translation": "Since deluded thought is excluded, that is, it's the same as the internal buddhas and nature, which are not yet established, why is there a distinction between them?",
        "source": "X56n0929_001:0358c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誰云內外色心己他此則用向色心不二門成。",
        "translation": "Whoever said that internal and external form and mind are one and other, this is accomplished by using the approach of nonduality of form and mind?",
        "source": "X56n0929_001:0358c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "妙旨一貫以彼成此復何爽哉。",
        "translation": "What's so cool about the consistent, subtle meaning of using one to form the other?",
        "source": "X56n0929_001:0358c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三修性不二門者性德祇是界如一念此內界如三法具足。",
        "translation": "The third aspect of cultivating the nonduality of nature is that the virtue of nature is simply to think of the elements as one, and this internal element is like the three qualities in full.",
        "source": "X56n0929_001:0358c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓融三諦之謂性一一常樂之謂德性德至理即界如念念方絕跡以此為門修性不二始終若此。",
        "translation": "The nature of the perfect interpenetration of the three truths is called nature, and the one that's always happy is called virtue.",
        "source": "X56n0929_001:0358c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性雖本爾藉智起修。",
        "translation": "Although the nature is originally such, cultivation arises through knowledge.",
        "source": "X56n0929_001:0358c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上已明性此論興修無別修解性之心即名為修下觀行去盡立修名名同義別順善明達不可雷同。",
        "translation": "Having explained nature above, this treatise promotes cultivation without distinction, and the mind that cultivates the understanding of nature is called cultivation.",
        "source": "X56n0929_001:0359a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由修照性由性發修。",
        "translation": "From cultivation, the mind illuminates the nature, and from the nature, cultivation arises.",
        "source": "X56n0929_001:0359a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同體照發更互相成不害修性天然妙理。",
        "translation": "When the same essence is illuminated and arisen, they're mutually formed, not harming the cultivation of the natural and marvelous principle of nature.",
        "source": "X56n0929_001:0359a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "在性則全修成性起修則全性成修性無所移修常宛然。",
        "translation": "When it's in the nature, the whole nature is cultivated, and when it's arisen from cultivation, the whole nature is cultivated, and there's nothing to remove from the nature that's cultivated, which is always the same.",
        "source": "X56n0929_001:0359a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "全性成修則性無所移全修成性則修常宛爾修性名分體常不二。",
        "translation": "When the whole nature becomes cultivated, the nature is not displaced, and when the whole cultivated nature becomes cultivated, cultivation is always just like that.",
        "source": "X56n0929_001:0359a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修有二種順修逆修。",
        "translation": "There are two kinds of cultivation ... advancing and opposing cultivation.",
        "source": "X56n0929_001:0359a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修有二種須揀順逆方免混濫。",
        "translation": "There are two kinds of cultivation, and it's necessary to discriminate between those that are agreeable and those that are disagreeable in order to avoid confusion.",
        "source": "X56n0929_001:0359a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "順謂了性為行逆謂背性成迷。",
        "translation": "Conformity is defined as understanding the nature and practicing, and adversity is defined as deviating from the nature and becoming deluded.",
        "source": "X56n0929_001:0359a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以了為行豈行異性以為修與性天隔。",
        "translation": "Does comprehension become practice? Does practice differ from nature? Does it mean that cultivation and nature are separated by heaven?",
        "source": "X56n0929_001:0359a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迷了二心心雖不二逆順二性性事恒殊。",
        "translation": "Although the two minds of delusion and comprehension are not two, the two natures of disagreement and conformity are always different.",
        "source": "X56n0929_001:0359a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迷了性同逆順事別。",
        "translation": "When the deluded and the comprehended are the same in nature, the contrary and the agreeable are distinct in nature and things.",
        "source": "X56n0929_001:0359a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "可由事不移心則令迷修成了。",
        "translation": "It's possible to cause delusion and cultivation to become accomplished by not shifting the mind from the subject matter.",
        "source": "X56n0929_001:0359a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈可迷了二修使同謂迷心是了斯為大錯故特示之。",
        "translation": "How can it be that deluded and resolute two minds can be the same, saying that deluded mind is resolute? This is a big mistake, so I'm specifically showing it.",
        "source": "X56n0929_001:0359a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故須一期迷了照性成修。",
        "translation": "Therefore, it's necessary to illuminate the mind's nature into its cultivation in one period of delusion.",
        "source": "X56n0929_001:0359a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "須分照性之心示為明了。",
        "translation": "It's necessary to show the mind that illuminates the nature in part as insight.",
        "source": "X56n0929_001:0359a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見性修心二修但泯。",
        "translation": "The two kinds of cultivation of seeing the nature and cultivating the mind are only extinguished.",
        "source": "X56n0929_001:0359a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見性無性豈復立修若不了性修何由泯。",
        "translation": "How could it be possible to establish cultivation if you don't understand the nature and how could cultivation be extinguished if you don't see the nature?",
        "source": "X56n0929_001:0359a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曉順修對性有離有合。",
        "translation": "Furthermore, it's clear that the deferential cultivation has both separation and combination with respect to nature.",
        "source": "X56n0929_001:0359a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "置逆論順理必妙融離合之相順理而成。",
        "translation": "Setting against the theory, conformity must be a marvelous blend of the characteristic of separation and conformity, which is formed in accord with principle.",
        "source": "X56n0929_001:0359a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離謂脩性各三合謂修二性一。",
        "translation": "Separate means that the nature of cultivation is each of the three, and combined means that the two natures of cultivation are one.",
        "source": "X56n0929_001:0359b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修性體圓各具三者離之狀也修性分對共為三者合之相也離合同時未嘗少間性脩體一不曾暫別妙性之文不思議旨自然而然安以情見而分別之故終曰離合一相頗得波水之況下文備矣。",
        "translation": "When the essence of the cultivated nature is perfect, each has the shape of the separation of the three, and when the nature of cultivation is divided into pairs, the characteristic of the combination of the three is also separated from the contract without ever being little separated from the nature, the essence of the one, the text of the marvelous nature is not discussed, the intention is natural, and it's settled to discriminate it by emotional views.",
        "source": "X56n0929_001:0359b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修二各三共發性三是則修雖具九九祇是三。",
        "translation": "The cultivation of two each of the three co-produced nature three is then cultivated although the 99 is only three.",
        "source": "X56n0929_001:0359b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "能發所發雖各論三而有九數九祇是三離即是合不二之狀顯矣。",
        "translation": "Although each of the three that can be initiated and the three that are initiated have a total of nine, the nine are only three.",
        "source": "X56n0929_001:0359b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "為對性明修故合修為二。",
        "translation": "In order to clarify the cultivation of the opposite nature, the combined cultivation is therefore two.",
        "source": "X56n0929_001:0359b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離合雖一分對從義義雖分對不違妙理性雖緣了對修無功合而說一修雖有性欲顯其能故唯論二雖此分對體常自一。",
        "translation": "Although the separation and the union are one-part opposites, the meaning follows from the meaning, although the one-part opposites don't contradict the subtle principle that although the opposites are conditioned, the cultivation has no merit and is said to be one, although the cultivation has a nature that wants to show its ability, so the only thing that's discussed is the two, although the essence of this one-part opposition is always one.",
        "source": "X56n0929_001:0359b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二與一性如水為波二亦無二亦如波水。",
        "translation": "The nature of two and oneness is like water becoming a wave, and two is not two, but also like waves and water.",
        "source": "X56n0929_001:0359b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波水之喻親而可鑒性與一乘既如波水二修之事理亦如然以喻得解請詳斯旨。",
        "translation": "The metaphor of waves and water is intimate and discernible, and since the nature and the One Vehicle are like waves and water, the matter and principle of the two cultivations are likewise. Please use the metaphor to get a detailed understanding of its meaning.",
        "source": "X56n0929_001:0359b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應知性指三障是故具三修從性成成三法爾。",
        "translation": "It should be understood that nature refers to the three hindrances and therefore contains the three cultivations, which are formed from nature into the three dharmas.",
        "source": "X56n0929_001:0359b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修若無性如木無根佛若無本從何而成生本是妙病不能求求而即得速豈過此。",
        "translation": "If cultivation has no nature, it's like wood without roots. If the Buddha has no origin, how did it come into being? This is a wonderful illness that can't be sought, and how quickly can it be attained?",
        "source": "X56n0929_001:0359b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "達無修性唯一妙乘無所分別法界洞朗。",
        "translation": "Attaining the nature of no cultivation is the only marvelous vehicle that discerns nothing, and the Dharma realm is perfectly clear.",
        "source": "X56n0929_001:0359b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "達無修性至洞朗者文雖在此意實通前上論修性豈是未達而分別耶是知正談性修實無取捨分別咸亡法界常朗妙不二相始終一實言雖前後不可情迷若此明了方可論道。",
        "translation": "Although the text attains the level of cultivation of the nature of nonexistence, the meaning really goes along with the previous discussion of cultivation of nature, doesn't it mean that it's not yet attained and discriminated? This is because we know that we're talking about the nature of cultivation, which is really without taking and discriminating, and that the Dharma realm is always clear and marvelous, without dual characteristics, beginning and end are the same, and although the prior and subsequent are true, they can't be misconstrued by emotions.",
        "source": "X56n0929_001:0359b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此由內外不二門成四因果不二門者眾生心因既具三軌此因成果名三涅槃。",
        "translation": "This is the gate of nonduality of internal and external that leads to the four gates of nonduality of cause and effect.",
        "source": "X56n0929_001:0359c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因果不二亦祇全指一念具足三軌妙理是知不指三軌念無由破念既不破因果永殊了念即理因果俱均若達此者十門咸成故色心門云總在一念別分色心亦可例云總在一念別分因果因果諸門兼同不可情滯。",
        "translation": "The nonduality of cause and effect also refers only to a single thought that has all three orbits of the marvelous principle is to know that without referring to the three orbits of thought there is no way to break the thought that does not break the cause and effect are never the same as the thought that is the principle that both cause and effect are the same If this is achieved, the ten aspects are all complete Therefore, the aspect of form and mind is always in a single thought that is separately divided into form and mind can also be an example of a single thought that is separately divided into cause and effect The aspects of cause and effect are the same and cannot be obstructed by emotions.",
        "source": "X56n0929_001:0359c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因果無殊始終理一若爾因德已具何不住因。",
        "translation": "There's no distinction between cause and effect, and the beginning and end are the same in principle.",
        "source": "X56n0929_001:0359c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此由理一乃至斯疑因若已具住因即足何故立果改因受果因德何在。",
        "translation": "This is because the principle is one, and even then there's doubt about why the cause abides when the cause is complete, and why the result is established and the cause is changed to receive the result of the virtue of the cause.",
        "source": "X56n0929_001:0359c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但由迷因各自謂實若了迷性實唯住因。",
        "translation": "It's simply because each deluded cause is considered real if it's understood that the deluded nature is really only an abiding cause.",
        "source": "X56n0929_001:0359c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迷執謂實因果乃殊了性住因與果何爽。",
        "translation": "When deludedly attached to the truth, the cause and effect are different, and what's the difference between the abiding cause and the result?",
        "source": "X56n0929_001:0359c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故久研此因因顯名果。",
        "translation": "Therefore, a long time studying this cause reveals that the cause is called the result.",
        "source": "X56n0929_001:0359c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既若住因圓人何故復立果稱故此解云但久研此因因顯名果無別果也。",
        "translation": "If he abides in the cause and perfects the person, why would he again establish the name of the result? Therefore, the explanation says, \"Only by studying this cause for a long time does the cause reveal the name of the result and there's no separate result.",
        "source": "X56n0929_001:0359c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "祗緣因果理一用此一理為因理顯無復果名豈可仍存因號。",
        "translation": "It's only by taking the principle of cause and effect as one and using that one principle as cause, the principle shows that there's no further fruit name, so how could it still exist as a cause?",
        "source": "X56n0929_001:0359c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "辨之則毫髮不差亡之則始終而一本末如此方得六處皆名即佛。",
        "translation": "If you discern it, then there's not a hair of difference; if you lose it, then it's always the same, and it's the same in essence and in essence, so then you can name all six places as the Buddha.",
        "source": "X56n0929_001:0359c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因果既泯理性自亡祇由亡智親疎致使迷成厚薄。",
        "translation": "Since cause and effect are extinguished, reason itself disappears, but it's only because of the disappearance of knowledge and the closeness and proximity of it that delusion becomes thick and thin.",
        "source": "X56n0929_001:0359c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即惑成智智力淺深由迷厚薄薄厚約迷智常圓足。",
        "translation": "That is, mental disturbances and wisdom become shallow and deep by reason of the thickness and thinness of the delusion, and the thickness of the delusion is determined by the constant and perfect completion of the wisdom.",
        "source": "X56n0929_001:0359c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "迷厚薄故強分三惑義開六即名智淺深。",
        "translation": "Because the delusion is thick and thin, it's forced to divide the three confusions into six, which is called the shallowness and depth of wisdom.",
        "source": "X56n0929_001:0359c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "惑豈非一厚薄分三理同事異豈非厚薄淺深之義歟。",
        "translation": "Isn't confusion just a thick and thin part of the three principle colleagues, and isn't that the meaning of thick and thin, shallow and deep?",
        "source": "X56n0929_001:0359c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故如夢勤加空名惑絕。",
        "translation": "Therefore, like a dream, diligently adding emptiness is called cutting off confusion.",
        "source": "X56n0929_001:0360a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行雖如夢不可暫亡惑雖空名非行不絕勤加深薄相脩而成蓋由契理皆如幻也。",
        "translation": "Although practice is like a dream, it can't be temporarily extinguished, and although confusion is empty, it's called non-perfection of practice, which is formed by diligently deepening and thinning each other to match the principle that they're all illusory.",
        "source": "X56n0929_001:0360a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幻因既滿鏡像果圓空像雖即義同而空虗像實。",
        "translation": "Although the cause of illusion is complete, the result of the mirror image is perfect, and although the image is the same in meaning, the void image is real.",
        "source": "X56n0929_001:0360a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空名之惑鏡像之果義雖是同迷悟虗實情性相隔。",
        "translation": "Although the confusion of the name of emptiness and the result of the mirror image have the same meaning, the delusion, enlightenment, and the feelings and natures of the blacks and the real are separated.",
        "source": "X56n0929_001:0360a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "像實故稱理本有空虗故迷轉成性。",
        "translation": "The image is real, so it's called the principle, originally empty, and the delusion is transformed into the nature because of emptiness.",
        "source": "X56n0929_001:0360a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "像現稱理全性具以無窮空虗本無隨智光而輪轉。",
        "translation": "The image-like manifestation is called the principle of the totality of nature with the infinity of emptiness and the absence of the original nature that follows the light of wisdom and transmigration.",
        "source": "X56n0929_001:0360a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則不二而二立因果殊二而不二始終體一若謂因異果因亦非因曉果從因因方克果。",
        "translation": "If it's said that cause is different from effect, cause is not cause, and the result is derived from cause.",
        "source": "X56n0929_001:0360a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非實相之因無以成圓極之果形端影直心也始然。",
        "translation": "It's not the cause of the true form that makes the perfect result, but the beginning and end of the form, the shadow, and the straightforward mind.",
        "source": "X56n0929_001:0360a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以三千在理同名無明三千果成咸稱常樂。",
        "translation": "Therefore, the three chiliocosms in principle are all called the same thing: ignorance, and the three chiliocosms in effect are all called eternal bliss.",
        "source": "X56n0929_001:0360a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎那心起百界同作無明一念附根三千咸稱常樂經云凡夫賢聖人平等無高下但在心垢淨取證如反掌心念若存如掌不反。",
        "translation": "The momentary mind arises from the same ignorance in all realms, and one thought attaches to the root of the 3,000 that are all called eternal bliss. The sutra says that mortals, noble and noble people are equal, have no superiority or inferiority, but it's in the mental pollution and purity of the mind that's obtained like reversing the palm.",
        "source": "X56n0929_001:0360a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千無改無明即明三千並常俱體俱用。",
        "translation": "The three thousand unchanged nescience is the understanding that the three thousand are both permanent, both in essence and in function.",
        "source": "X56n0929_001:0360a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "金碑云而此三千性是中道不當有無有無自爾苟能見全上作無明之念俱為至明之體用不二理亦由斯上四節文皆云三千方見一而無二。",
        "translation": "The Jin tablet cloud and this three thousand nature is the middle way improper existence and nonexistence and nonexistence since then if you can see all of the above to make the mindfulness of ignorance and both the essence of the supreme luminosity and the principle of nonduality also from this the above four sections of the text are cloudy three thousand parties see one and not two.",
        "source": "X56n0929_001:0360a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以修性不二門成。",
        "translation": "This is accomplished by cultivating the gate of nonduality.",
        "source": "X56n0929_001:0360a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此上四門攝自行因果同一念心圓觀可了向下六門攝化他相準意可知。",
        "translation": "These four gates of self-control, cause and effect, and the same mindfulness of mind can be fully observed, and the next six gates of transformation and otherness can be understood.",
        "source": "X56n0929_001:0360a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五染淨不二門者。",
        "translation": "The fifth aspect of the nonduality of defilement and purity.",
        "source": "X56n0929_001:0360b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "染淨之相法豈然乎但由物機迷悟之耳故下文云三千未顯驗體仍迷此之謂歟迷情若除淨相自彰。",
        "translation": "Is it true that the characteristics of defilement and purity are only deluded and enlightened by the things that matter? That's why the following clouds say that the 3,000 unmanifest experiences are still deluded in essence.",
        "source": "X56n0929_001:0360b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若識無始即法性為無明故可了今即無明為法性。",
        "translation": "If consciousness is beginningless, then the Dharma nature is nescience, so it can be understood that now nescience is the Dharma nature.",
        "source": "X56n0929_001:0360b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若知無始無明全法性是了今無明豈不然乎今無明在法性何夫病在不知無明得便或能了達全法界迷為我智體故染淨對機不羞毫末自爾而成。",
        "translation": "If we know that beginningless nescience is the whole Dharma nature, then we can understand present nescience, isn't it otherwise? Now, nescience is in the Dharma nature, and what's wrong with that is that we don't know that nescience gets to be convenient or that we can understand the whole Dharma realm and that delusion is the essence of self-knowledge, so defilement and purity are contradictory to each other without being ashamed of the minutest detail.",
        "source": "X56n0929_001:0360b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法性之與無明徧造諸法名之為染無明之與法性徧應眾緣號之為淨。",
        "translation": "Dharma nature and ignorance universally create dharmas that are called defiled, and ignorance and the Dharma nature universally respond to all conditions that are called pure.",
        "source": "X56n0929_001:0360b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "染淨同體感應任緣故群生感心中諸佛諸佛應心內群生機應相對方得如聲答響者也。",
        "translation": "Since defilement and purity are the same in essence, the principle of mutual dependence is appropriate because sentient beings feel the buddhas in their minds and the buddhas respond to the sentient beings in their minds in a way that's consistent with their ability to answer the call like a voice.",
        "source": "X56n0929_001:0360b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濁水清水波濕無殊清濁雖即由緣。",
        "translation": "Although turbid water is clear and sparkling, there's no difference between clear and turbid, even though it's caused by cognition.",
        "source": "X56n0929_001:0360b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以喻化之若了濕性清淨何殊濁即同清感焉異應道交之義識可見矣。",
        "translation": "If we metaphorically transform it, then we'd understand how the wetness is pure and different from the turbid, which is the same as the clear sensation, and we'd see the meaning of the interaction of the different paths.",
        "source": "X56n0929_001:0360b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "而濁成本有。",
        "translation": "But turbidity has a cost.",
        "source": "X56n0929_001:0360b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "物機無始未曾離合。",
        "translation": "The function of things has never been separated from their union since beginningless time.",
        "source": "X56n0929_001:0360b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濁雖本有而全體是清以二波理通舉體是用。",
        "translation": "Although the turbidity is originally existent, the whole body is pure, and the two waves are connected in principle, holding up the essence as the function.",
        "source": "X56n0929_001:0360b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "波理既通體用咸一安得不然。",
        "translation": "Since the waves and principle are both connected, the essence and function are both one, so how could it not be?",
        "source": "X56n0929_001:0360b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故三千因果俱名緣起迷悟緣起不離剎那。",
        "translation": "Therefore, the three thousand causes and effects are all called dependent arising, and delusion, enlightenment, and dependent arising aren't separate from a single moment.",
        "source": "X56n0929_001:0360b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此舉法體合上二水顯性無殊剎那見性緣起咸同。",
        "translation": "This cites the Dharma body that combines the above two waters, which are manifest in nature without distinction and are the same in terms of the dependently arisen conditioned nature of the momentary.",
        "source": "X56n0929_001:0360b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎那性常緣起理一。",
        "translation": "The nature of the moment is constant, and the principle of dependent arising is one.",
        "source": "X56n0929_001:0360c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "見性體一猶波理通合初後中可例知。",
        "translation": "The essence of the seeing nature is the same as the principle of the confluence of the first and last, as can be seen by way of example.",
        "source": "X56n0929_001:0360c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一理之內而分淨穢。",
        "translation": "Within the one principle, there's a distinction between purity and defilement.",
        "source": "X56n0929_001:0360c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "剎那即性分乎淨穢方見百界含心三千自己。",
        "translation": "The momentary aspect of nature is divided into pure and defiled, and only then do we see the hundred realms containing the mind's three thousand selves.",
        "source": "X56n0929_001:0360c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別則六穢四淨通則十通淨穢。",
        "translation": "Specifically, the six defilements and four purifications generalize to the purification of the ten passages.",
        "source": "X56n0929_001:0360c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六穢四淨直約十界分十通淨穢互就百界弁雖此通別與剎那性平等無殊指歸妙境出自法華言顯於斯。",
        "translation": "The six defilements and four purifications are directly related to the ten elements, and the ten passages of purity and defilement are mutually related to the function of the one hundred elements, even though these passages and distinctions are equal in nature and not different in their referral to the marvelous objects that come from the words of the Lotus.",
        "source": "X56n0929_001:0360c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知剎那染體悉淨三千未顯驗仍迷故相似位成六根徧照照分十界各具灼然。",
        "translation": "Therefore, we know that the defiled essence of jñāna is fully purified, and the three thousand unmanifest experiences are still misconstrued, so the similarity stage is formed by the universal illumination of the six faculties, which delineate the ten elements, each complete and scintillating.",
        "source": "X56n0929_001:0360c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以悟顯迷迷若未了由剎那在剎那見性染體方淨性淨若何淨三千性若了斯旨方合本經知法常無性也。",
        "translation": "To awaken reveals the delusion, if the delusion hasn't been understood by the moment, the defiled body of the momentary view is then purified, and if the 3,000 natures are purified, then the purpose of understanding this is to match the sutra's knowledge that things are always without nature.",
        "source": "X56n0929_001:0360c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈六根淨人謂十定十分真迹垂十界亦然乃至果成等彼百界。",
        "translation": "Is it true that someone with purified six faculties would say that the ten concentrations and ten true forms pervade the ten realms as well, and even that the fruit would become equal to the other hundred realms?",
        "source": "X56n0929_001:0360c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成何所成成性百界應何所應應機彼群百界是己感他豈緣其心淨則佛土淨。",
        "translation": "What's formed, what's formed, and what's the nature of the hundred realms, and what should be the function of the hundred realms? Is it because their minds are purified that the Buddha-lands are purified?",
        "source": "X56n0929_001:0360c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故須初心而遮而照照故三千恒具遮故法爾空中。",
        "translation": "Therefore, the first mind must examine, conceal, and illuminate the three thousand constant features of concealment and therefore the Dharma exists in the sky.",
        "source": "X56n0929_001:0360c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初心理觀遮照同時空中三千剎那具足。",
        "translation": "The first mental contemplation obscures and illuminates the three thousand moments in the air that are complete at the same time.",
        "source": "X56n0929_001:0360c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "終日雙亡終日雙照。",
        "translation": "At the end of the day, both are extinguished, and at the end of the day, both are illuminated.",
        "source": "X56n0929_001:0360c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "皆云終日是顯同時。",
        "translation": "Both say that the ending day is the same time of manifestation.",
        "source": "X56n0929_001:0360c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不動此念徧應無方隨感而施淨穢斯泯。",
        "translation": "When this mindfulness doesn't move, it universally responds to nowhere, following feelings and giving pure defilements that disappear.",
        "source": "X56n0929_001:0360c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念全三千何動之有普應群機無心即徧應隨感施淨穢何局。",
        "translation": "What is the limit of mindfulness of the full 3,000 that moves and has universal response to all sorts of faculties without mind, that is, universal response, and the concomitant application of purity and defilement?",
        "source": "X56n0929_001:0360c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亡淨穢故以空以中仍由空中轉染為淨。",
        "translation": "The loss of purity and defilement is therefore based on emptiness, which is still in the middle, and the change from defilement to purity in the air.",
        "source": "X56n0929_001:0361a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "亡轉雖曰空中妙假纖塵不易。",
        "translation": "Although it's said that the loss of defilement is a subtle assumption in the air, it's not easy to remove dust.",
        "source": "X56n0929_001:0361a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空中自亡。",
        "translation": "The emptiness itself disappears.",
        "source": "X56n0929_001:0361a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "染淨即觀得名為了病者去藥亡一切俱蕩妙性之體法爾如然。",
        "translation": "When defilement and purity are observed, it's called the healing of the sick, and the medicine disappears, so the essence of the marvelous nature of all [things] is thus.",
        "source": "X56n0929_001:0361a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以因果不二門成。",
        "translation": "This is accomplished through the gate of the nonduality of cause and effect.",
        "source": "X56n0929_001:0361a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "非上因果莫成此用承躡相由未甞少間。",
        "translation": "Nothing short of the above cause and effect can accomplish this function by following the principles of mutual dependence without ever being shortchanged.",
        "source": "X56n0929_001:0361a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六依正不二門者已證遮那一體不二良由無始一念三千。",
        "translation": "The sixth aspect of the nonduality of direct reliance is that he has realized that China is one and the same, and it's nondual because of the beginningless, single thought of 3,000.",
        "source": "X56n0929_001:0361a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮那非徧徧生之局群生非局局彼之徧局徧局殊體自純一果證無證證彼局性以果驗因顯因本有徧非因有證復何從。",
        "translation": "遮那非徧徧生之局群生非局局彼之徧局徧局殊體自純一果證無證證彼局性以果驗因顯因本有徧非因有證復何從。",
        "source": "X56n0929_001:0361a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以三千中生陰二千為正國土一千屬依依正既居一心一心豈分能所雖無能所依正宛然。",
        "translation": "Taking the 3,000 intermediate aggregates of birth, the 2,000 are the correct land, and the 1,000 are dependent on the correct as they reside in one mind and one mind, how could they be distinguished from the subjective and the objective even though there are no subjective and objective dependent on the correct as it were?",
        "source": "X56n0929_001:0361a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遮那極證依正妙融妙融之相全由性具之徧不出三千三千依正全三諦理理實何在在迷剎那剎那性顯依正宛然能所俱絕。",
        "translation": "Caina's ultimate realization of the marvelous fusion of reliance and directness and the marvelous fusion of characteristics all come from the pervasiveness of the nature that's not outside the 3,000,000 reliance and directness, but the principle of the three truths in their entirety, and what is really in their delusion and moment-to-moment nature that reveals the reliance and directness as being completely separate from both the agent and the subject.",
        "source": "X56n0929_001:0361a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是則理性名字觀行已有不二依正之相故使自他因果相攝但眾生在理果雖未辨一切莫非遮那妙境。",
        "translation": "Then reason, name, contemplation, and practice have the characteristics of nonduality, dependence, and correctness, so they cause themselves and others to be included in the mutuality of cause and effect, but sentient beings are in principle and effect, even though they haven't discerned anything other than Cāna's marvelous state.",
        "source": "X56n0929_001:0361a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三即俱有意亦不同理即全迷名字觀行解行論有有雖不同俱皆未顯但遮那妙體依妙常融雖復俱融不可混同順此區別。",
        "translation": "Although the three are both intentional and not the same, the principle is completely misconstrued, and the explanation of practice is both different and unmanifest, but the subtle essence of China depends on the subtle and constant integration, although both are still integrated, and can't be confused with each other in following this distinction.",
        "source": "X56n0929_001:0361a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然應復了諸佛法體非徧而徧眾生理性非局而局始終不改大小無妨因果理同依正何別(已見上注)故淨穢之土勝劣之身塵身與法身量同塵國與寂光無異是則一一塵剎一切剎一一塵身一切身廣狡勝劣難思議淨穢方所無窮盡。",
        "translation": "Still, it should be further understood that the buddha's Dharma body is not universal but universal in nature, and the physical nature of sentient beings is not restricted but restricted in beginning and end without changing size, and there's no obstruction between cause and effect, the principle of sameness, and what distinction is there between reliance and directness (see the above note).",
        "source": "X56n0929_001:0361a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三諦妙境空假中觀契性應變安局方所塵身至細非法體而何興塵剎雖微非理土而何有應本如此修成乃彰所以一多相入身剎重重符空假中之妙觀合無差別之果理法華大教不二之門成則稱性妙矣。",
        "translation": "The wondrous state of the three truths, emptiness, hypothesis, and contemplation are in accord with the nature, changing, and security of each place. The dust body is so subtle and insubstantial that it doesn't matter how it arises, and although the dust bases are subtle and not the principle land, they don't exist.",
        "source": "X56n0929_001:0361b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非三千空假中安能成茲自在用如是方知生佛等彼此事理互相收。",
        "translation": "If it weren't for the 3,000 realms of emptiness and hypothesis, how could this be accomplished with ease? Thus, only then would we know that things like birth and Buddha are mutually inclusive of each other and of principle.",
        "source": "X56n0929_001:0361b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若非三千攝境不徧不空假中境不是性故須三千咸空假中方見諸法實相因佛體性生心均一絕待妙融俱成佛道乃得一攝一切一切攝一是以法華大事純顯斯旨振古少如獨　今家解由妙旨並以三千而為指南可謂盡開權顯實之旨極三無差別之理經題妙法敘之妙名不可思議法則略舉界如具攝三千妙歎於法法祇是妙故記釋妙境云三千即空性了因等其文分明上文又云不出一念三千世間即空假中及斯點示節節如此學者不見覧執三千有無相攻違祖背宗及成法怨為之柰何。",
        "translation": "If it weren't for the 3,000 realms that are not pervasive, not empty, and provisional, then the 3,000 realms that are not nature must be salted, empty, and provisional in order to see the true characteristics of all things, because the Buddha's essence, nature, birth, mind, and so forth are all of a piece, and all of them are one. This is because the great matter of the Lotus is purely indicative of this intention, and it's as unique as the ancient one. The present interpretation is based on the marvelous intention, and using the 3,000 as a guide, it can be said that the essence of the three undifferentiated qualities is fully disclosed, and the title of the scripture is the marvelous statement of the Dharma, and the marvelous name is inconceivable.",
        "source": "X56n0929_001:0361b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以染淨不二門成。",
        "translation": "This is accomplished through the gate of nonduality of defilement and purity.",
        "source": "X56n0929_001:0361b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾聖淨用既曰由生具故得初心觀已一念隨位彰顯方乃染淨依正融攝相成。",
        "translation": "Since the noble and pure functions are said to be produced from the necessities, the first mindfulness is observed and then manifested in accordance with the level of defilement and purity, depending on the proper integration of the two.",
        "source": "X56n0929_001:0361b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七自他不二門者隨機利他事乃憑本本謂一性具足自他方至果位自即益他。",
        "translation": "The seventh aspect of the nonduality of self and other is the random practice of benefiting others by relying on the origin, which is the single nature that's complete, self and other in order to reach the fruitful state of self that benefits others.",
        "source": "X56n0929_001:0361c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一性自他本自常存本既我心自他豈別纔有感即應未始毫差非修成而方爾實一本之天然。",
        "translation": "The single nature of self and others is originally eternally present, and since self and mind are self and others, how could they be separately perceived and responded to without ever being the slightest bit different from what's cultivated and accomplished, which is really the naturalness of one single nature?",
        "source": "X56n0929_001:0361c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如理性三德三諦三千。",
        "translation": "It's like the three virtues of reason and the three chiliocosms.",
        "source": "X56n0929_001:0361c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理性三德示其性體三諦三千顯其圓具一一圓具三千性體方得果證稱性施為以自益他豈有二別。",
        "translation": "The three virtues of reason reveal their nature and essence, and the three thousand of the three truths reveal their complete fulfillment, each complete fulfillment of the three thousand nature and essence before realizing the fruit of praising the nature and bestowing it for the benefit of self and others, are there any two distinctions?",
        "source": "X56n0929_001:0361c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行唯在空中利他三千趣物。",
        "translation": "Self is only in the air, and the three thousand destinies are for the benefit of others.",
        "source": "X56n0929_001:0361c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三諦既其一心自他豈應有異莫以情見逐語分張違不二旨。",
        "translation": "Since the three truths are one mind, shouldn't they be different for self and others? Don't contradict the principle of nonduality by dividing them into sentiments and views and by language.",
        "source": "X56n0929_001:0361c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "物機無量不出三千能應雖多不出十界轉現不出一念土土互生不出寂光。",
        "translation": "Although there are measureless things and abilities that don't come from the 3,000, they can be responded to in many ways, but they don't come from the ten realms, and their manifestation doesn't come from a single thought, and the mutual production of land and earth doesn't come from silent illumination.",
        "source": "X56n0929_001:0361c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三千而攝物機十界而統應化語辭之異感應咸均轉現不離一念土互不出寂光豈非全性全同理性以此鑑照自他之相豈存而乎門門合於題旨。",
        "translation": "Are the three thousand that contain things and machines, the ten realms and the unified response, the differences in language and words, and the various sense-fields all manifesting together, not apart from the single mindfulness of the land and the mutual absence of silent illumination not all natures and the same reason, and are thus examined to illuminate the characteristics of self and other, and are they not present and in accord with the title's meaning from door to door?",
        "source": "X56n0929_001:0361c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "眾生由理具三千故能感諸佛由三千理滿故能應應遍機徧欣赴不差不然豈能如鏡現像鏡有現像之理形有生像之性。",
        "translation": "Because sentient beings are endowed with 3,000 principles, they can experience the buddhas. Because the 3,000 principles are complete, they can respond to every single one of them, and they're happy to go without any difference. Otherwise, how could they be like a mirror that shows an image? A mirror has the principle of showing an image, and a form has the nature of producing an image.",
        "source": "X56n0929_001:0361c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生理同佛而感佛證齊生而應纔欣即赴如影隨形或謂不然鏡像之喻經論所陳為何法設耶鏡有現像之理猶佛三千理滿形有生像之性喻生三千理感感應道交欣赴不差法喻相符如函合蓋焉不信哉。",
        "translation": "The principle of birth is the same as that of the Buddha, and the Buddha's realization is produced in unison, and the response is to rejoice in and go forth like a shadow following a form. Or is it otherwise, or is the metaphor of a mirror and an image presented in a sutra or a treatise? Why is the mirror's principle of a present image like the Buddha's 3,000 principles that are complete, and the form has the nature of a birth image?",
        "source": "X56n0929_001:0361c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一形對不能現像則鏡理有窮形事未通若與鏡隔則容有是理無有形對而不像者。",
        "translation": "If a single form doesn't match an image, then the mirror's principle is exhausted, the form and things aren't yet shared, and if it's separated from the mirror, then there's no such principle that's not matched by a form that doesn't have an image.",
        "source": "X56n0929_001:0362a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若一機興感應而不赴則應體有窮形事不通若與鏡隔容有是理既其形對無不像者反此乃知應無不徧法無不通然今家所明感應不差由生理與應體一不同諸論黎耶熏變彼權此實輔行弁之矣。",
        "translation": "If a machine produces a response and doesn't go, then the response body has a limit, the form and matter are not understood, and if the mirror is separated from the response body, then there is a principle that the response body is not universally applicable, and the Dharma is not invisible.",
        "source": "X56n0929_001:0362a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若鏡未現像由塵所遮去塵由人磨現像非關磨者。",
        "translation": "If the mirror's unmanifest form is obstructed by dust, then the dust is removed by the person grinding the manifest form and not by the grinding.",
        "source": "X56n0929_001:0362a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "鏡未現像由塵所遮理未趣應為惑所覆磨塵雖假於功現像全由於內名字觀行雖常感應見思當存顯應未彰須藉功成應方內啟然今家所談感交互成三十六句有何一法而非應耶但顯應妙能在功成耳。",
        "translation": "Although the mirror's unmanifest form is obstructed by dust, the principle's unintended purpose should be obscured by confusion, and although the manifest form is entirely based on internal names, the practice of contemplation is always contingent on views and perceptions that should exist, and the manifest form should not yet be revealed through the accomplishment of which should be internally revealed, but what's the one thing that's not contingent on the thirty-six phrases discussed by the presentists about the interaction of feelings and accomplishments?",
        "source": "X56n0929_001:0362a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以喻觀法。",
        "translation": "This is a metaphor for the method of contemplation.",
        "source": "X56n0929_001:0362a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀字平聲。",
        "translation": "The character contemplate has a flat sound.",
        "source": "X56n0929_001:0362a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大旨可知應知理雖自他具足必藉緣了為利他功。",
        "translation": "The general idea can be understood that although the principle of knowing is complete in itself and others, it must be accomplished through the fulfillment of conditions for the benefit of others.",
        "source": "X56n0929_001:0362a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "緣了無功性何由發性德緣了發性利他功莫大矣。",
        "translation": "How can the lack of efficacy in the fulfillment of conditions give rise to the virtue of the nature? The fulfillment of conditions gives rise to the nature that's of great benefit to others.",
        "source": "X56n0929_001:0362a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "復由緣了與性一合方能稱性施設萬端則不起自性應無方所。",
        "translation": "Furthermore, because the fulfillment of conditions and the nature are unified, it's possible to praise the nature and define myriad aspects, but without the fulfillment of the self-nature, there should be no direction or location.",
        "source": "X56n0929_001:0362a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性雖備足未契同凡順性緣了而合性者方能普應施設萬端分證之位雅斯符旨。",
        "translation": "Although the nature is complete, it doesn't match the nature of ordinary people who conform to the nature, fulfill the conditions, and unite with the nature in order to be able to universally respond, define, and realize all ends of the position, which is in accord with Yasi's intention.",
        "source": "X56n0929_001:0362a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此由依正不二門成八三業不二門者於化他門事分三密隨順物理得名不同。",
        "translation": "This is because the eight non-dual approaches of the three activities and the non-dual approaches of the three directives are based on the fact that they are divided into three mysteries that follow physics and get different names.",
        "source": "X56n0929_001:0362b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三密一際豈可分張對機事別故此異陳了應同法一體無殊不二之門允斯而成。",
        "translation": "Since the three mysteries are at one remove, how could they be differentiated to match the distinctive abilities of the situation and thus be presented differently, the same principle should be unified, without distinctions, and the gate of nonduality should be realized like this.",
        "source": "X56n0929_001:0362b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心輪鑒機二輪設化現身說法未曾毫差在身分於真應在法分於權實。",
        "translation": "The mind-wheel, given the capacity of the two wheels to designate and transform the present body, teaches without the slightest difference that the identity is in truth and the response is in principle and the Dharma is in expedient and true.",
        "source": "X56n0929_001:0362b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身分真應法開權實在昔施權身法未合故此離合明來至今經即三而一身法俱融次文明矣。",
        "translation": "The body is part of the true response, the Dharma is part of the expedient, and the real is the expedient body and the Dharma that were bestowed in the past, so it's separated from the two, and the scripture has come to clarify that the three are one, and the body and Dharma are both integrated in order to understand them.",
        "source": "X56n0929_001:0362b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二身若異何故乃云即是法身二說若乖何故乃云皆成佛道若唯法身應無垂世若唯佛道誰施三乘。",
        "translation": "If the two bodies are different, why is it that they're the Dharma body and if the two explanations are contradictory, why is it that they've both become buddhas and the path? If it's only the Dharma body, there should be no dying world, and if it's only the Buddha path, who will bestow the three vehicles?",
        "source": "X56n0929_001:0362b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "垂世施權雖屬為機而於理性妙體常融今經談性權實正軌一體平等三業身法豈違不二。",
        "translation": "Although the provisional world bestows authority for the purpose, the marvelous essence of reason is always fused with the present sūtra's discussion of the nature, authority, and reality as being one and the same, how could the three karmic bodies and principles be at odds with each other?",
        "source": "X56n0929_001:0362b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "身尚無身說必非說身口平等等彼意輪色心一如不謀而化常冥至極稱物施為。",
        "translation": "The body is still bodiless, and the explanation must not be that the body and speech are equal and the mind-wheel, form, and mind are the same without conspiring to change, always mysterious and extremely praiseworthy.",
        "source": "X56n0929_001:0362b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "冥極施為不動此念徧應無方無記化他出生何盡。",
        "translation": "When this mindfulness is applied everywhere and in no direction, what's the limit of indeterminate transformation and birth of others?",
        "source": "X56n0929_001:0362b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "豈非百界一心界界無非三業界尚一念三業豈殊。",
        "translation": "Isn't it true that there are a hundred realms, one mind, and no realms that aren't three realms, yet one mindfulness of three karmas?",
        "source": "X56n0929_001:0362b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "百界三業既居一念妙豈過此非開顯至教曷此宜揚。",
        "translation": "Since the three activities in the hundred realms reside in one mind, how could they not be more subtle than this, which is the ultimate teaching that should be revealed and praised.",
        "source": "X56n0929_001:0362b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "果用無虧因必稱果若信因果方知三密有本百界三業俱空假中故使稱宜徧赴為果。",
        "translation": "If we believe in cause and effect, then we'll know that the three mysteries have their origin and that the hundred realms and three activities are all empty and provisional in nature, so it's appropriate to call them the result of universal access.",
        "source": "X56n0929_001:0362b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不談百界俱空假中未見成佛稱性之相。",
        "translation": "He doesn't talk about the fact that the whole hundred realms are empty and provisional before he sees the mark of becoming a buddha and praising his nature.",
        "source": "X56n0929_001:0362b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一一應色一一言音無不百界三業具足化復作化斯之謂歟。",
        "translation": "Each response to form and each speech and sound is not without its own fulfillment of the three activities in the hundred realms, which is called transformation and further transformation.",
        "source": "X56n0929_001:0362b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "應色言音咸皆百界同生念性至果顯發以斯應用豈有窮乎。",
        "translation": "The response form, speech, and sound are all produced in the same hundred realms as the mindfulness of nature until the result is revealed.",
        "source": "X56n0929_001:0362c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故一念凡心已有理性三密相海一塵報色同在本理毗盧遮那方乃名為三無差別。",
        "translation": "Therefore, a single moment of mindfulness of the mortal mind already has the rationality of the three densely proportioned oceans of form and a single particle of response form that's all in the original principle, which is called the three undifferentiated aspects of Vairocana.",
        "source": "X56n0929_001:0362c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三密相海妙性遮那並指下凡心色本具乃合經文三無差別是知無差妙旨須符念性色心不二妙境可觀故本文云一切諸法中悉有安樂性記至云結束開意以諸法中有妙理故方可論開點示眾生本有覺藏心佛眾生無差別既云諸法豈非九界色心耶有安樂性豈非遮那妙境耶今依妙解直示斯旨令成初心圓觀體相用此觀察見遮那性與果無別故輔行云心造一切三無差別文理分明此旨焉可別生穿鑿耶。",
        "translation": "The three densely proportioned oceans of marvelous nature, Caina, and the form of the lower mortal mind originally possessed are in accordance with the scriptures, and the three non-differences are known to be in accordance with the marvelous objective of mindfulness, the nonduality of form and mind, and the marvelous objects to be contemplated, so this article says that in all dharmas there is well-being.",
        "source": "X56n0929_001:0362c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以自他不二門成。",
        "translation": "This is because the self and other are not two.",
        "source": "X56n0929_001:0362c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九權實不二門者平等大慧常鑒法界亦由理性九權一實實復九界權亦復然。",
        "translation": "The nine provisional and real nonduality approaches are equal, great wisdom, constant scrutiny, and the Dharma realm is also based on the rational nine provisional, real and nine realms, and the provisional is also the same.",
        "source": "X56n0929_001:0362c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "實不可二故唯一也權不可一故言九也此直示其相若圓互具百界常然名雖百界一性無差群情隔礙權實乃乖若依今經顯斯至理同一佛乘空假中妙所以調達悟此而受記龍女了此而作佛並由大慧契合法界權實正軌。",
        "translation": "The actual cannot be two, so it is only one, and the right cannot be one, so it is said to be nine. This directly shows that they are similar, perfect, and mutually inclusive, and the hundred realms are always the same, although the hundred realms are one in nature, without distinctions, and the right and the real are not the same if we rely on the present scriptures to show that this is the ultimate principle, the same Buddha vehicle, empty, fake, and in the middle, so it is adjusted to understand this and receive the record, the dragon lady understands this and becomes a Buddha, and the great wisdom accords with the right and real directive of the Dharma realm.",
        "source": "X56n0929_001:0362c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "權實相冥百界一念不可分別任運常然。",
        "translation": "The provisional and real are one in a hundred realms, one thought that can't be discriminated, and the free operation is always possible.",
        "source": "X56n0929_001:0362c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "分別若生此旨全失任運之然唯在絕念。",
        "translation": "If discrimination arises, this intention is completely lost, and the only thing that remains is to stop thinking about it.",
        "source": "X56n0929_001:0362c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "至果乃由契本一理非權非實而權而實此即如前心輪自在致令身口赴權實機三業一念無乖權實不動而施豈應隔異。",
        "translation": "The ultimate result is that it's based on understanding the original single principle that's not expedient or real, but expedient and real, which is the same as the previous mind-wheel's freedom to cause body and speech to go to the expedient and real machine and the three karmic activities without deviating from the expedient and real, which are immovable and applied, how could they be different?",
        "source": "X56n0929_001:0362c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "雙非之理不異權實權實之應全雙非是。",
        "translation": "The principle of dual noncontradiction isn't different from the expedient and the real, and the expedient and the real should both be noncontradictory.",
        "source": "X56n0929_001:0363a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "對說即以權實立稱在身即以真應為名三業理同權實冥合此以三業不二門成。",
        "translation": "When speaking to each other, that's the claim established by expedient and real, and when it comes to the body, that's the name given to the true response. The principle of the three actions is the same, and expedient and real are coincidental. This is accomplished through the gate of nonduality of the three actions.",
        "source": "X56n0929_001:0363a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十受潤不二門者物理本來性具權實。",
        "translation": "The gate of nonduality of the ten experiences is based on the physical nature originally endowed with expedient and real [karmic] qualities.",
        "source": "X56n0929_001:0363a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性具權實與性無殊故其熏發全性而興。",
        "translation": "The nature is endowed with expedient and real, and there's no difference between the nature and the permeation of the whole nature that gives rise to it.",
        "source": "X56n0929_001:0363a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無始熏習或實或權權實由熏理常平等。",
        "translation": "Beginningless perfuming may be real or expedient and real because the perfuming principle is always equal.",
        "source": "X56n0929_001:0363a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性雖本具不熏無發熏何所熏還熏一性合性熏發在昔猶昧於今猶明群生佛種從因緣起師教為緣全表理性立修發名不稟妙教發性無從縱有發生乃成權隔六道三乘沈迷可復。",
        "translation": "Although the nature is originally possessed without perfuming and without the arising of perfuming, what is perfumed that's also perfumed by the unity of the nature and the perfuming and arising of the unity of the nature that was still obscured in the past but is still clear today when the seed of Buddhahood in all sentient beings arises from causes and conditions, the teacher teaches it as a condition, and the whole nature expresses the principle that establishes cultivation and arouses the name without relying on the marvelous teaching, and there's no way the nature can be arisen even though there are arisen rights that separate the six destinies and three vehicles, and sunken delusion can be restored.",
        "source": "X56n0929_001:0363a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "遇時成習行願所資若無本因熏亦徒設遇熏自異非由性殊。",
        "translation": "When he meets them, he'll form formations, practices, and vows that are supported by the absence of an original cause, and in vain he'll encounter perfuming that's self-different and not due to a difference in nature.",
        "source": "X56n0929_001:0363a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "成習若異三草二木能為事殊能潤教兩權乘亦別至今經開成一地而受潤俱同理歸一致故依今經無一善根不性佛道低頭舉手童子戲沙並在斯典照然可鑒。",
        "translation": "If the formation of karmic impressions is different from the three grasses and two trees that are capable of serving different purposes and nourishing the two expedient vehicles, they're also different from the present sūtra, which initiates the formation of a single ground and receives the same nourishment from both, so the principle returns to the same conclusion.",
        "source": "X56n0929_001:0363a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "性雖無殊必藉幻發幻機幻感幻應幻赴能應所化並非權實。",
        "translation": "Although there's no difference in nature, it must be through illusion that illusory feelings, illusory perceptions, and illusory responses go together in a way that's not expedient or real, or that can be responded to or transformed.",
        "source": "X56n0929_001:0363a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "機感應赴皆如幻者修全在性理必如幻雖即如幻感應益彰故使物機應契僉同寂光無非法顯。",
        "translation": "When the sensation and response are all illusory, the cultivation of the whole nature and principle must be illusory, even though it's illusory, and the sensation and response are made more pronounced, so the things and the abilities that arise should all fit together in a quiescent light without non-legal manifestation.",
        "source": "X56n0929_001:0363a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然由生具非權非實成權實機佛亦果具非權非實為權實應物機應契身土無偏同常寂光無非法界。",
        "translation": "However, since birth is neither expedient nor real, the expedient and real [factors] become expedient and real, and the Buddha's fruition is neither expedient nor real, and the material [factors] should fit the body and land without bias, the same constant quiescent light, and the same non-non-nonlegal realm.",
        "source": "X56n0929_001:0363a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文理分明解不合旨徒目云云無由顯發如水至冷飲者方知此須明解執言奚為。",
        "translation": "The text and principle are clearly understood to be at odds with the aim, and in vain they're not revealed like water until it's cold and drinkable.",
        "source": "X56n0929_001:0363b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故知三千同在心地與佛心地三千不殊四微體同權實益等。",
        "translation": "Therefore, he knows that the 3,000 are both in the mind ground and the 3,000 in the Buddha's mind ground, and the four subtle entities are the same in terms of right and true benefit.",
        "source": "X56n0929_001:0363b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "受益之權了斯經旨達己心地三千妙性與佛果證妙性豈殊方合四微同體皆一地之所生三草二木感一雨之所潤實纖塵而無爽何一法而非真普使一切感成佛道豈虗也哉故復經云無有一人獨得滅度皆以如來滅度而滅度之大哉至教潤物成功也如此。",
        "translation": "The right to receive benefit understands the purpose of this sutra, which is to realize the subtle nature of the 3,000 coexisting in the mind ground and the subtle nature of the Buddha's fruit realization, how could they be different? The four subtle aspects of the same body are all produced by the same ground, the three grasses and two trees feel the moistening of a rain that's really fine and dustless, and what single dharma is not true?",
        "source": "X56n0929_001:0363b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此以權實不二門成是故十門門門通入色心乃至受潤咸然故使十妙始終理一。",
        "translation": "This is because the provisional and real are not two; therefore, the ten aspects are all connected to form, mind, and even sensation and nourishment.",
        "source": "X56n0929_001:0363b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本文為解妙字不設十相妙無始終不語三千性體不圓既圓且妙方乃因果自他咸同一本十門交通一一相入豈是作意理自當然。",
        "translation": "In this article, in order to understand the word marvelous, we don't posit that the ten aspects are marvelous, beginningless, and endless, and we don't say that the nature and essence of the 3,000 are not perfect, that they are perfect and marvelous, and that their causes and effects are self and others all from the same root, and that each of the ten gates is connected and entered into by one another.",
        "source": "X56n0929_001:0363b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如境本來具三依理生解故名為智智解導行行解契理三法相符不異而異假立淺深設位簡濫三法祇是證彼三理。",
        "translation": "As the original object is complete in three ways, the understanding arises based on the principle; therefore, it's called wisdom. wisdom understands, guides practice, and meets the principle. The three things are consistent, not different, but different, assuming the shallow and deep are established, and the three things are simply confused.",
        "source": "X56n0929_001:0363b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自行因果五章已立一妙無殊化他全此始末分明鏡智行位一而無爽不二之門昭然在目。",
        "translation": "The five chapters on self-causation have established the single, marvelous, and undifferentiated aspect of transforming others, which is clearly delineated from beginning to end, mirroring the stages of wisdom and practice, and the nondual aspects of unity and nondifferentiation.",
        "source": "X56n0929_001:0363b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下之五章三法起用三法既是一念三千既空假中成故有用若了一念十方三世諸佛之法本迹非遙故重述十門令觀行可識。",
        "translation": "The following five chapters present the three dharmas in action. The three dharmas are both one thought and three thousand, which are both empty and formed in the false, so they are useful.",
        "source": "X56n0929_001:0363b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大式妙解開佛知見苟不如此出世妙旨其何以宣然雖至歎不離一念若依今經而了念者則一部妙旨皎然自心十方佛體全我本性誠堪信矣摩訶止觀一念三千而為妙境直指介爾全三千性而立佛乘明不思議文理顯然也噫世之輪扁賤藝妙尚子不能傳況出世至道豈易了之然上所言蓋筌罤也苟不體道如闕魚免焉妄執滯耶故大意云若欲修習並須口決今此亦爾若欲解乎妙旨非口決而難通苟無妙解其何以行重述十門令觀行可識言在此焉不信哉。",
        "translation": "If the great style of marvelous understanding opens up the Buddha's vision, then how can it be declared, even though the ultimate praise is not separate from a single thought? If we rely on this scripture and the mindfulness of a single thought, then the marvelous intention is clear to our own mind, the Buddha's body in ten directions, the whole of my original nature, and sincere and believable.",
        "source": "X56n0929_001:0363b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "首題既爾攬別為總符文可知。",
        "translation": "Since the title of the explanation is general, the explanation is specific, and the explanation is general.",
        "source": "X56n0929_001:0363c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋題是總釋文是別總別相貫妙旨一如也。",
        "translation": "The title of the explanation is the general explanation, and the text is the distinctive, general, and specific aspects that go together in a single, marvelous purpose.",
        "source": "X56n0929_001:0363c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法華玄記十不二門顯妙(終)",
        "translation": "Fahua xuanji shibujimen xianmiao (end)",
        "source": "X56n0929_001:0363c13_0",
        "is_bad_quality": false
    }
]