[
    {
        "source_sentence": "重刻五百問論序",
        "translation": "Preface to the Reprint of the Five Hundred Questions",
        "source": "X56n0939_001:0600a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百問論何為而造耶曰為俾破權執悟實道也然篤而論之如來一代說大小權實教每會必各有囑累諸大羅漢弘演小宗彌勒以權教為職文殊大乘為任等是荷擔菩提莊嚴雙樹其間豈容優劣哉及至滅後諸大祖師後先遞出分宗立家偏弘一門葢亦各受密囑乘願轂而來者也若慈恩基師專據深密主張瑜伽以三時教該括一化三無二有統轄眾機其極遂至乎以一乘為權三乘為實矣斯旨也始與我所弘法華之者戞戞乎不相容焉則不得不作為玄贊別立一家之說也然竊忖其意豈非木牛楊葉俯提弱喪以餘深法示教利喜者耶所謂世界故實第一義故實權誘方便皆無唐捐但稟今宗教眼未明者或眩其說將泣兩岐又彼宗徒牢執一途或恐馴致蹋順璟之禍又復焉知無或不幸而寶器受粗食者乎是論主之所以深憂遠慮而有此造也歟條章雖多大要有三焉一開顯正意為決定聲聞而翻判屬有性以敗種之論通再活之經安得今已生竟引論滅之此剡足徇屨點金成鐵不知其可二今經要在乎顯一代設化之意諸法門綱目總讓之前經然虗張名相廣開章段大小參雜今昔莫辨而大事因緣措之弗顧買櫝還珠不亦戾乎三末世弘通專為行人紛綸法相茫如烟海不見一語及于行要問橋論箭空費光景一朝瞑目色心何依此棄所急而不知務也他若事義去取訓詁同異類則抑末矣三要既呈矣庶幾教台徒確有所守及習彼宗者祛膠著或有圓種者生慕嚮焉非必圖強聒一切悉使捨彼從此也製作主意葢如斯而已矣此論智證大師之所將來趙宋時彼方已失傳最宜須寶護獨奈舊刻鹵莾訛謬相望而復靡別本可讐校慧心致疑其來也久矣每一披卷未曾不憮然而增慨也山門碩匠有守篤和尚恒惋惜不置乃據昔人所考覈及玄贊等默索精思嚴訂其譌疑者不敢輒改別為箋註三卷論定是非且略釋肯綮難通者於是從來以為不可讀委諸高閣者皆喜而讀之研之得益者寢多其孫昌宗上人銳志進學稱不愧堂搆之任比以和尚校本壽之梨棗仍以箋註分會入本論各章之下合刻之將欲以公于大方而揭論主之志於幾墜也其為功為惠亦豈小哉刻成徵余弁言余聞之喜甚乃不自揣敢攄鄙見如此且為提其要曰清涼國師有言法華云此經難信難解佛現在世猶多怨嫉況滅度後誠哉斯言若保執三乘五性不信一乘一性者深為可愍此甄簡權實絲毫不貸所謂寶山無非寶取之先擇摩尼也智證大師曰釋法華者三家三論法相天台竝是法王之一官法界之一門能為眾生之妙藥能為諸趣之律梁此四悉投機諸祖一揆所謂雪山無非藥採者期於對病也若異其異而不通於大同則於和合海分河飲水徒長見慢與夫外道諍訟何異乎雖然此猶未也智者大師之言曰方便說稱妙不妙見理之時無復權實非權非實亦無妙與不妙是故稱妙也嗚乎此何等境界安得與法界有情同造乎斯地受廣大妙法喜樂乎讀者倘幸稔知之則守篤和尚用心之苦併昌宗上人致力之勤皆為非唐設也乃是論流通日昌月盛我有望焉豈不大歡喜哉。",
        "translation": "The Five Hundred Questions [on the Awakening of the True Path] is also said to be for the purpose of breaking the clinging to expedient principles and realizing the true path. However, if we examine the Tathāgatas' generational teaching of expedient principles and real principles, each assembly must have a mandate to the great arhats to propagate the lesser school, and Maitreya's teaching of expedient principles as an office, Wenshu's teaching of the great vehicle as an office, and so forth, are these two trees that bear the burden of the adornment of bodhi, and there is no room for superiority or inferiority between them?",
        "source": "X56n0939_001:0600a08_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "寬政六秊歲次甲寅孟秋　後學六如沙門慈周撰凡例一此論專對破慈恩玄贊本邦上代性相相拒若守護章法華秀句一乘要決等蓋皆其流亞諸祖未必閱此論而暗相發明者多今宗學者最所宜講究但恨舊本烏焉剩脫義路茅塞先師患之殫力訂正稍覺披豁。",
        "translation": "Kuanzheng six years old, the first quarter of the year, the second half of the year, and the sixth year of the year, the ascetic Ci Zhou wrote a case where this treatise is devoted to refuting the nature and characteristics of Cien Xuanzan, the state, the last generation, and the rejection of the Shouhu zhang, the Fahua Xiuju, the Essentials of the One Vehicle, and so forth, all of which are the streams of the patriarchs who did not necessarily read this treatise and the darker aspects of the inventions of many scholars of the present school are the most appropriate to investigate, but hate the old text, the wool is left out of the meaning, the road, the haystack, the former master suffered from it, the racking of efforts to set it right, and slightly feel open.",
        "source": "X56n0939_001:0600c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一註稱光山本者乃野州日光山所傳訂譌頗精先師多采用之惜乎中卷失傳。",
        "translation": "A commentary that called it the Guangshan text was transmitted from Naozhou and Nikko mountains, and it was quite accurate in terms of correcting errors.",
        "source": "X56n0939_001:0600c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一本論所牒玄贊則有現本可對校其他率推徵文理究其所必當然而後從之其難決者且存舊不敢擅改換焉。",
        "translation": "A version of the present treatise, which is called Xuanzan, has an existing text that can be checked against other versions, and the text and principles are investigated to see what is appropriate, yet the difficult ones are preserved in the old and dare not be changed without permission.",
        "source": "X56n0939_001:0600c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一格上私記條數以便搜求然不與本論題下條數同者意古來傳寫經多手致此離合耳今且據現本。",
        "translation": "A private record of the number of entries on the grid for searching, but not the same as the number of entries under the title of this treatise, means that in ancient times, many hands transmitted the scriptures to cause this discrepancy, and now we will rely on the present text.",
        "source": "X56n0939_001:0601a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一先師校本主辨誤字若其句逗國譯未遑盡匡覽者請自裁正焉。",
        "translation": "A former master who proofread the text mainly identified misspellings, but if the sentences and phrases in the Chinese translation are not ready to be fully explained, please correct them yourself.",
        "source": "X56n0939_001:0601a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "睿山南溪沙門　昌宗　識五百問論卷上(一百一十一問)毗陵沙門　湛然　述問釋一經文前幾門。",
        "translation": "Rui shan Nanxi shaman Changzong 識500問論卷上 (One hundred and eleven questions) Weiling shaman Zhanran 述問釋一經文前幾幾門。",
        "source": "X56n0939_001:0601a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答開為六門一敘經緣起之意二明宗旨三明經品得名四明品廢立五彰品次第六釋經本文今意謂之不然除釋本文餘之五門初文略明緣起可爾餘三明品在無非經骨格第二宗旨未曉如何容子陳疑方知遠旨曾聞有用名體宗用教相等五稍似得於此經旨歸。",
        "translation": "Answer: It's divided into six categories: first, a description of the meaning of dependent arising in the sutra; second, an explanation of the purpose; third, an explanation of the categories of the sutra that get their names; fourth, an explanation of the categories that are abolished; fifth, an explanation of the subordination of the categories; and sixth, an explanation of the text of the sutra that's meant to be interpreted otherwise.",
        "source": "X56n0939_001:0601a15_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何謂緣起。",
        "translation": "Q What's meant by dependent arising?",
        "source": "X56n0939_001:0601a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答緣起為五一酬因請二破疑執三為彰記行四為利今後五顯時機初文有二一酬因二酬請酬因又六一酬行因即方便品初云佛曾至未曾有法二酬願因亦方便品云我本立誓願及壽量中每自作是意等三酬求因即達多品四酬持因論云佛曾已下為讀誦甚深及後之四恒即四依是及不輕品受持之文五酬相因謂雨華等彌勒疑問等六酬說因三世諸佛成佛已後必說故也今謂雖列六因竝今昔大途之通因而非出世本意之別因經云若但讚佛乘眾生沒在苦等四十餘秊不顯真實今始得暢而不為酬因徒說久遠何益於今故今別因大唯二種一為迹門開權顯實二為本門開迹顯遠此則正當一代別因不同諸教。",
        "translation": "A The five kinds of dependent arising are: 1. rewarding causes and invitations, 2. refuting doubt and attachment, 3. clarifying the practice of remembering, 4. bringing benefit to the present, and 5. revealing the capacity of the time.",
        "source": "X56n0939_001:0601a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰何謂酬請。",
        "translation": "Q: What does it mean to respond to a request?",
        "source": "X56n0939_001:0601b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰釋迦初成梵王請說但說方便今酬身子請說權實境酬文殊請說安樂行酬彌勒請說真應果今謂一代大小皆酬梵請身子所請通為三周三周所陳豈獨於境權在於昔安合重求況法說周三世十方皆令眾生得一切種智乘是寶乘遊於四方此豈非行直至道場此豈非果滅化寶所行果亦然所談者教何以獨境餘之二酬至文方決。",
        "translation": "A: When the Śākyamuni first became king of Brahmā, he asked the body to explain only the method. Now, he asks the body to explain the expedient and the real, and Mañjuśrī to explain the peaceful and pleasant practice, and Maitreya to explain the true and appropriate result. Now, it's said that in one generation, both the great and the small are rewarded with the request of Brahmā. The body's request is shared by the three circumferences, and what's presented in the three circumferences is not only the object, but the expedient is in the past, and the rejoined is sought after.",
        "source": "X56n0939_001:0601b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何謂破疑。",
        "translation": "Q: What does it mean to refute doubt?",
        "source": "X56n0939_001:0601b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰一破疑二破執初破疑者聲聞疑謂永不成佛故云感傷諸小菩薩亦疑獨得又疑菩提己亦無分經云菩薩聞是法等文兼破悔疑小不得作佛今聞作佛悔所以除知為大因故疑通三乘悔唯小有以寬攝狹但說破疑今謂疑通悔局為出何文文中既云諸求三乘若有疑悔豈從一句便判疑寬以寬攝狹應俱有悔又諸小菩薩身住何位初疑獨得後疑無分獨得與無分相違疑悔焉分於大小。",
        "translation": "A: First, it's breaking doubt and second, it's breaking attachment. First, it's breaking doubt because the śrāvakas doubt that they'll never become buddhas, so they're sad that the lesser bodhisattvas also doubt that they've attained independence and doubt that bodhi itself has no part. The sutra says that bodhisattvas hear this teaching and so forth, and it also breaks the repentance that the lesser doubts won't become buddhas and now they hear that they've become buddhas and repent, so they remove the knowledge that it's a great cause.",
        "source": "X56n0939_001:0601b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰何名破執。",
        "translation": "Q: What's the term that refutes attachment?",
        "source": "X56n0939_001:0601c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰法華論云決定退大二種聲聞今經唯為退大一種經云我昔教汝志願佛道及明大通十六王子今經正破退大者執四中非三今謂論語現在且置未來若弘教者欲達經旨須遠尋始達末謂於彼土生滅想時得聞是經滅想乃順現在情執得聞則順化儀大體既云得聞是經何以蔽之論云決定增上慢未熟故釋云其趣寂者元無大性亦非不輕與記之限乃引例云如般若經皆令入於無餘涅槃非皆盡入今謂違經背論徒引他文般若現云皆入而反云不盡論云未熟而改云無如樹上菓菓未熟時與元無菓其理同耶不輕品中始終無復除趣寂言何以苦為菩薩除之除在昔教取出今經何以將昔之除證今之取又云趣寂佛不記菩薩記令信解上慢佛不記菩薩記令發趣若趣寂後作佛違涅槃等處處教文今謂論文此二同為未熟未熟則是後時必定當熟若趣寂永沈則上慢永沒上慢教無長沒之文則趣寂義無永沈之理何事未熟該於二人元無獨在趣寂若其二人永沈長沒何以菩薩令解令發是則天親謬言不輕諭諂又云菩薩有二頓悟漸悟漸悟二義從小向大名漸生數少故從凡歸大名頓生數多故乃引涅槃八萬劫等云是聖人非是異生二者曾發大小二心修二行者來歸大者皆名為漸今謂生數多少在於勤怠安得以大小判之又大含漸頓何得以所從判之又小通賢聖聖兼初後凡通內外外兼博地而判能入若言涅槃八萬劫等曾發大小正當趣寂昔具二緣但以大弱小強小此大彼人不觀其始末輙判有無。",
        "translation": "Answer: The Lotus Sutra says that there are two kinds of śrāvakas who are determined to retreat from the great. The present sūtra is only one kind of retreat from the great. The sūtra says that I taught you in the past to aspire to the Buddha Way and to understand the sixteen princes of the great penetration. The present sūtra refutes the attachment of those who have retreated from the great to the four, middle, and not three.",
        "source": "X56n0939_001:0601c02_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問何名彰記行耶。",
        "translation": "Q What's the name of this practice of making clear the mind?",
        "source": "X56n0939_001:0602a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答有二一記二行記謂未記聲聞今為授記文云我設是方便等及迦葉等領解初文今謂楞伽四義故記聲聞大集二三授聲聞記楞伽大集為法華前後而云未記耶二彰行者今說一乘菩薩行故下文云有佛子心淨等聲聞若菩薩等如來但化菩薩等今問若唯為退大那為菩薩仍云但化應不關小若以一乘化菩薩者若有菩薩非一乘者應以一乘而化導之若是菩薩皆悉一乘豈以一乘還化一乘若大小共聞成佛無疑二俱不聞俱不成佛驗知三祇共位菩薩行同二乘故使得失而無差降。",
        "translation": "A, there are two kinds of practice: the first kind of practice that's noted and the second kind of practice that's noted because it's not noted by the śrāvakas, and the second kind of practice that's noted because it's noted by the śrāvakas and the second kind of practice that's noted because it's noted by the śrāvakas and the third kind of practice that's noted because it's noted by the śrāvakas before and after the Lotus.",
        "source": "X56n0939_001:0602a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何位名為一乘因果。",
        "translation": "Q: What level is called the cause and effect of the One Vehicle?",
        "source": "X56n0939_001:0602a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰七地為一乘因佛地為一乘果今謂此經一乘因果通收始末遍於大小彈指合掌敗種邪逆現在滅後一句一偈咸皆與記竝入佛因豈至七地方為因耶七地已前若非佛因復非小行大小不攝為外道耶又云三周明一乘境安樂行明一乘行壽量明一乘果今謂釋乃分張義豈能會境如前難行果未詳且以行標其名行無理教其行安寄觀一切法所觀者何讀說是經所說是教夢坐道場此豈非果菩薩行之非人何謂壽量本行豈非本因如實知見可非本理又云由此三故彰菩薩行說法華經今謂三周未明行果境非說法之由若能說之人由知契境所被之機由機契應所說之法由二方談若安樂行但行無理非說經之由由經可弘初心藉行大悲扶理順佛嚴勅機教相扣由義方成若云果為彰行之由而說法華經者果謝於往垂迹於今迹談果事遠為說本此品但云說壽得益不語說經之相故文云聞佛壽長獲如是等增道之位。",
        "translation": "A: The seventh ground is the One Vehicle cause, the Buddha ground is the One Vehicle effect. Now, this sūtra says that the One Vehicle cause and effect are collected from beginning to end, pervading both large and small, snapping fingers and putting palms together to defeat various evils and disobediences, and then cessation of manifest activity, one phrase and one verse are all recorded together as the cause of the Buddha, how could it be that up to the seventh ground is the cause?",
        "source": "X56n0939_001:0602a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何為利今後耶。",
        "translation": "Q: How will it benefit the present and future?",
        "source": "X56n0939_001:0602b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰又二一利今二利後今利者二一果記利如三周後二現證利如龍女作佛此界菩薩乃至八部遙見悟解及分別功德品等乃至下諸品末聞品得益後利者眾散已後今謂今後可然何不說往自本成之後大通之後二萬億後今日之前豈無一人於此經文從佛得益故經云于今有住聲聞地者故知過去受益葢多然現利中果記現證二不相離法師品中滅後一句尚許通記豈現在獲悟不名果記若非果記當得者何若現證者何名佛與故經云安住實智中我定當作佛安住實智非證是何名得佛法分何名獲大善利何名無上寶不求自得何謂大寶自然而至何名而今自得何名得其果報何名今得無漏大果何名其中應受供養。",
        "translation": "Ans. There are two benefits, one present and two subsequent. The present benefits are two: one is the benefit of fruition, such as the benefit of the three circumambulations and two are the benefit of present realization, such as when a nāga becomes a buddha, the bodhisattva in this realm and up to the eight divisions who remotely see and understand the factors of enlightenment and discernment of merit, and even the final stage of the lower stages of listening.",
        "source": "X56n0939_001:0602b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何名為為顯時機。",
        "translation": "Q What's called the time when it's opportune to show?",
        "source": "X56n0939_001:0602b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答一時二機時謂諸佛說教一頓二漸頓謂從凡求佛如勝鬘一乘一乘是權四乘是實漸如此經一乘是實二乘是權今謂勝鬘一乘何殊此經一乘一乘若同何以彼權此實彼頓此漸彼四與彼一如何此二與此一同不四一若異四中之一非一四一若同權實安隔一二若異非從一開一二若一權實仍別異不可會一何須會又問此二彼四同異云何若異何以俱非一乘若一權實不等又問漸頓二途為何勝劣若言漸勝不定應從漸入頓若言頓勝不應頓屬彼經若許須勝仍屬彼經那云此經出諸經上若言從凡即名頓者此經諸天八部下文八界微塵一句一偈隨喜勸聽此等豈即盡從小來彼經三乘不愚於法亦從小入應在漸收況彼以四一相對此乃一二雙陳是則二處俱具兩文漸頓未能分路正直捨方便但說無上道豈無上道仍名為漸唯一無二十方唯一但化菩薩除佛方便唯佛與佛乃能究盡發心不退竝不能知古佛塔踊以來證本地踊出以弘經龍女須臾而見成邪王即生而獲悟如斯等例非頓者何。",
        "translation": "A The one time and two opportunities are when the Buddha teaches that the one is sudden and the two are gradual, which means that ordinary people seeking the Buddha like Śrīmālā's One Vehicle and One Vehicle are expedient, and the four vehicles are real and gradual.",
        "source": "X56n0939_001:0602b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此既屬漸漸相如何。",
        "translation": "Q: What's the gradual aspect of this?",
        "source": "X56n0939_001:0602c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答舊有五時初為提謂為人天教第二時即三七之後十二秊前說三乘有行未說空行即阿含等第三時即成道後三十秊中說三乘空行謂維摩思益大品等第四時成道後三十秊中說一乘猶未分明演說佛性常住實相說無常佛果為真實即無量義法華等第五時即涅槃大悲經等今謂乍觀可爾理即不然提謂中明長生不起法忍等不應獨在人天之教第二時十二秊前者五秊說大般若七秊說般舟九秊說鴦掘十秊說如來藏皆明佛性實相又第二時說十地經又大般若云鹿苑無量人得無生忍等故知且依古義五時為定恐厭文繁且略應止具如古德廣有破斥非此可論。",
        "translation": "A The old five periods were first mentioned as the teaching of humans and gods, second period, the twelve years after the third and seventh, when the three vehicles' existential practices were taught before the empty practices were taught, namely, the Āgamas and so forth, third period, the thirty years after the attainment of enlightenment, when the empty practices of the three vehicles were taught during the thirty years after the Vimalakīrti-nirdeśa-sūtra, and fourth period, the thirty years after the attainment of enlightenment, when the One Vehicle was taught but not clearly explained, and the eternally abiding true character of the buddha-nature was explained, and the impermanent Buddha-fruit was made real, namely, the Dharma Flower of Immeasurable Meaning, and so forth, and the fifth period, the Nirvana and Great Compassion Sutra, and so forth.",
        "source": "X56n0939_001:0602c18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問舊義既然更有新義不。",
        "translation": "Q: Since there's an old meaning, is there a new meaning?",
        "source": "X56n0939_001:0603a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰新經義者頓教大乘但唯一時不從小起教被唯一若漸大之教乃有三時如解深密經為勝義生菩薩依三性說三無性勝義生白佛初於一時在痆斯仙人墮處鹿苑林中為發趣聲聞乘者以四諦法轉正法輪有上有容未了義故第二時中唯為發趣大乘者依一切法皆無自性無生無滅本來寂靜自性涅槃以隱密相轉正法輪斯處甚奇甚為希有亦是有上所容受猶未了義亦諸諍論安足處所世尊于今第三時普為一切乘者無容是真了義非諸諍論今謂彼經是第三時故此菩薩不說後品後聞法得益具結大小二道不同乃以阿含為第一時隱密說有不明有者有其何性第二時中隱密不了而生諍論第三時中仍存諸乘故云一切以有諸故驗未會三乘。",
        "translation": "Answer: The new meaning of the sūtras is that the sudden teaching of the great vehicle is only one time, and the teaching that doesn't start with the lesser is only one, and if the teaching of the gradual greatness is only three times, then there are three times, as in the case of the profound and mysterious sūtras, when the bodhisattva Vairocana explains the three non-natures based on the three natures, and Vairocana Vairocana explains to the Buddha that at the beginning, in the Deer Preserve Forest where the sages of Nārāyaṇa fell, he was aiming for the śrāvaka vehicle and turning the right wheel of Dharma based on the four truths, there's an upper, existent, and tolerant meaning that's not fully understood.",
        "source": "X56n0939_001:0603a06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問深密既然如何判釋。",
        "translation": "He asked, \"Since it's profound, how do we explain it?",
        "source": "X56n0939_001:0603a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰第一時隱密說有未說於空第二時者隱密說空謂般若等第三時者顯了說有云依他圓成故也謂華嚴等亦顯了說空空所執性今問般若之中有圓成不若其無者實相般若如來種智色心乃至無上菩提一一皆云一切智智清淨三智品中三智一心名為佛智又此解深密經為是法華前耶後耶涅槃既明五時驗此既在法華前道理未有深密後事又復不辨鹿苑已前信知只辨中間三昧又曰金光明經亦明三種法輪謂轉照持轉謂四諦法輪為空照謂照有照空持謂非空非有可任持故今謂何經無此有空等三又曰新醫舊醫新醫即第三時也頓悟之機一果之證無三時教若機漸成定有三時此經三周說一乘處多被聲聞先說般若已教其空破彼有病不愚於法既信解已今說第三時令其歸趣為顯第三真實之教故說此經故與金光明解深密同第三時今謂三教三時其義各別不可以二經同解深密金光明通立大乘有等三諦何關漸三涅槃經二醫相對本譬邪正兩常故與漸教永別涅槃幸有五味何不用之復順論文何為固執論云依法者如經過去諸佛以無量無數方便種種因緣念觀方便說法是法皆為一佛乘故如是等譬喻者如依牛有乳酪生熟蘇乃至醍醐此五味中醍醐第一為小乘如乳大乘如醍醐故以此喻明大乘無上諸聲聞等亦同大乘無上聲聞同者示諸佛如來法身之性同諸凡夫二乘法身平等論與涅槃經合何事固違兩經復是終窮論解終窮之經何事却引不了之教彼部若了何以通小通小若了此經亦應却得小果若得小果何會之有。",
        "translation": "Answer: In the first period, it's said covertly that there's existence but not emptiness. In the second period, it's said covertly that there's emptiness, which is described as prajñāparin, and in the third period, it's said that there's existence that depends on other things being fully formed, which is described as Huayan, and so forth, and it's also said that there's emptiness in prajñāparin that's not fully formed, which is the reality, prajñāparin, the tathāgata's knowledge of various forms of form and mind, and even unsurpassed enlightenment, each of which is described as omniscience, pure, three kinds of wisdom, and one mind that's called buddha wisdom.",
        "source": "X56n0939_001:0603a20_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問何名顯機。",
        "translation": "Q: What's the term for revealing the capacity?",
        "source": "X56n0939_001:0603b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰依涅槃經唯有一機然性有二種一理性如勝鬘說如來藏二行性如楞伽說如來藏前皆有之後或有無談有藏無說皆作佛今謂若唯一機何以二三二三是機不應唯一唯言表獨一切不開若諸教更開則唯言成誑徒立二藏二無二也理必行在於當行必理在於昔豈有前皆具有令後或有或無若弘教者談有藏無過在談者若言在佛經無此言經無說有增謗之義理在於斯又曰依善戒地持有二種性所謂有無彼經論云性種性者無始法爾六處殊勝展轉相續此依行性無種性人雖復發心勤行精進終不能得無上菩提但以人天而成熟之即無性也被有此依行性非被於無今謂何不云無性是決定聲聞而云是人天種性若爾則有二種無性二乘之人尚判為無三途四趣道理非有今問勤行之人幾時不得即知定屬無性之人況講說者復不勤行則有無俱無是知不曉一切教中咸具折伏攝受二義如毒天二鼓藥珠兩身是故論中有眾生意樂意輙於一事中或呵或讚豈可聞五性便謂人天二乘永無覩一性宗乃言一切皆有故大論云說人天教者譬如王子從高墮下父王接以人天繒綿令不至三途之地而成大損故說善戒且免三途歎於滅想令脫果繫豈可聞有即生有見聞無便謂永無處處生著引之難出。",
        "translation": "Answer: According to the Nirvana Sutra, there is only one capacity, but there are two kinds of natures: one rational, as Bhagavān explains, and two practices, as Laṅkâvatāra explains, that the Tathāgatagarbha is present in the past, and the latter may or may not be present in the future, and that both the store and the non-explained are made buddhas.",
        "source": "X56n0939_001:0603b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此經下文妙莊嚴王品八萬四千得法眼淨為是何位。",
        "translation": "Q: What is the level of the 84,000 attainments of the Dharma eye that are purified in the following section of this sutra, the Chapter of the King of Marvelous Adornment?",
        "source": "X56n0939_001:0603c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答是被聲聞傍利益故今謂若爾何經不然諸大乘經皆有二乘聞大獲小二子勸王聽法華經聞經乃成令得小果此典何名唯為會三諸教之上其言徒施唯一佛乘有言無實藥王十喻空歎芭蕉法師三說全同泡沫又曰涅槃三種病人此經三艸二木逆次配於三時教也今謂三時豎經一期病人艸木橫判人法如何以橫而判於豎信用深密亦是胸襟又曰般若云三乘定性及不定性此經大乘無復定性今謂在般若中有定不定若入今經無復定性若至此經猶尚不轉暫名為定發在界外故也般若仍挫故有不同又曰楞伽五性三乘及以定性無性無性即是闡提之人勝鬘四性亦復如是今謂此並猶在不了抑揚教故不可引權以證實教。",
        "translation": "A It's because it's beneficial to the śrāvakas in the vicinity. Now, if that's the case, then what sūtra is it? All the great vehicle sūtras have two sons who hear the great vehicle and obtain the small, and they advise the king to listen to the Lotus Sutra and hear the sutra before it becomes a small accomplishment. What's the name of this scripture but a combination of three teachings above which the vaipulya is the only Buddha vehicle that has words without substance, and the ten parables of the Medicine King are empty and praised by Basho, the teacher, and the three teachings are all the same bubble.",
        "source": "X56n0939_001:0603c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何名為宗旨。",
        "translation": "Q: What is called the tenet?",
        "source": "X56n0939_001:0604a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰教乃有三宗即有八言教三者一多說有宗阿含等是二多說空宗即中百十二門般若等是雖多說空亦不違有三非空有宗即華嚴深密法華等是今謂淨名楞伽為屬何教若阿含明有何故中含中說大空經其經最廣廣明二空二乘證空為與阿含空所證同異所證若同空有乖諍所證若異小教兩分乃至成論所明空理猶屬小攝所言二多說空指中百等者論申於經何不兼指所申之經而獨引能申之論縱引般若百論破邪般若顯正復云等者為攝何經何惜更引三兩部類而單引般若直云等耶又般若中有三智品品中純明三種智慧一一切智是聲聞智二道種智是菩薩智三一切種智是佛智聲聞智既屬於空而菩薩佛智不可同小又般若中若以十八空為頭以對諸法稍似明空若以六度四諦真如法界法性平等性離生等為頭則一切皆有及非空有豈可唯空又十八空為頭乃云更互清淨不必唯空又若云般若為二乘說空是則般若諸經何殊二乘之典鹿苑二乘先以證空更為說空增其小習何益增進耶又般若論中明一切實等四句不同又云般若如火聚四邊不可取不可取而取應四句取之何獨空耶若言非空非有指華嚴深密法華等經淨名楞伽攝屬何教華嚴始終只明四十二位住前先修十梵行空得入初住一身無量身平等妙法身湛然應一切豈唯雙非入法界品諸善知識善財於善知識所各得無量法門或云如幻或云最勝光明或離欲際挊沙算法等一切法門又云一一塵中一切剎一一剎中一切塵塵剎剎塵亦復然身土土身亦皆爾何曾獨云一雙非耶又阿含部內處處文中皆離斷常雙離豈非雙非文耶又法華若與華嚴深密同一教者法相大小及記大小亦應合同何故二乘於華嚴迷大於法華會小於深密中大小並陳若異法同教一切諸異只應皆同何須立異而異於同雖辨三時又不成別一一時中同不成同如是不成其過無量。",
        "translation": "Answer: There are three doctrines, that is, there are eight doctrines that say that the three are one that mostly teaches existence, such as the Āgama school, two that mostly teaches emptiness, such as the one hundred and twelve gates of the Madhyamaka school, such as Prajñāpāramitā, and so forth, even though they mostly teach emptiness, and three that aren't emptiness, such as the non-empty existence school, such as the Huayan profound esoteric Lotus school.",
        "source": "X56n0939_001:0604a13_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問何名宗八。",
        "translation": "Q: What's the name of the eightfold school?",
        "source": "X56n0939_001:0604b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰一我法俱有宗即犢子部二有法無我宗即薩婆多等三法無去來即大眾部四現通假實即說假部五俗妄真實即現出世部六諸法但名即一說部七勝義皆空即般若部等八應理圓實即法華等成實當第四今經一乘宗今謂般若之外皆一乘宗此記聲聞餘處皆爾般若之中有廣乘品一切諸法皆摩訶衍豈非大乘大寧非一則一切大乘無非一乘大經云一切眾生悉一乘故又宗猶尊也尊者主也宗既一教之主寧可主一教多云何教三宗乃八耶若言教八宗唯一者六前在小小乘但是宗計之宗則非宗尊之宗也若六可為六亦應為十八何但六耶若小乘部別則分為六宗般若等經宗應隨部何以合華嚴等共為第三。",
        "translation": "Ans. 1. the I and the Dharma are both existent, which is the Vātsīputrīya sect; 2. the I and the Dharma are not self, which is the Saṃbhūta sect; 3. the Dharma has no past and future, which is the Mahāyāna sect; 4. the manifestation is shared with the provisional and the real, which is the Explanation of the Hypothesis; 5. the conventional and false are real, which is the manifestation of the Transcendent; 6. the dharmas are only names, which is the One Explanation; 7. the ultimate truth is emptiness, which is the Prajñāparinirvāṇa sect; 8. the principle is perfect and true, which is the realization of the Lotus; 10. the fourth is the Sutra's One Vehicle school. Now, beyond Prajñāparinirvāṇa, there's the One Vehicle school, which is said to be the śrāvaka school.",
        "source": "X56n0939_001:0604b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問亦曾聞說諸品得名各各不同其相如何。",
        "translation": "Q. I've also heard it said that each of these categories gets a different name, so what's the difference?",
        "source": "X56n0939_001:0604c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰唯蓮華一名諸釋同異自下諸品所釋得名悉皆不殊什公云蓮華者奔荼利迦新經論中說青黃赤白梵云殟鉢羅俱某頭鉢特摩奔荼利如次以對四色不同今是白華準下文云放白毫光有大白牛故也今問對白甚善許車之時何故不云羊車鹿車大白牛車何惜白字而略白著之耶又曰理教行果為蓮華下文具有理等四相今問何故有時即云無量義中但說理教法華中惟明行果一家之說自語相違何故復云三周明境境只是理壽量明果果非教行若總一經通明此四是故題中具此四者今問三周正當迹經大旨何以但境流通中應當品品皆具四法何以增減多少不同又曰法即是妙是蓮之華即是持業依主二釋亦可大法之妙是依主釋亦可妙法如蓮華持業釋亦可妙法蓮華經是持業釋若俱是理亦持業釋若妙法是理經即是教即依主釋今謂前何故云教理行果今離持業依主多釋乃棄行果但取教理故知妙法二字教則俱教理則俱理餘二亦然故知蓮華但譬四法耳等是帖於六釋何以不華含蓮為有財釋華繞於蓮為隣近釋華因非實為相違釋四色相望為帶數釋六釋皆悉全具四法。",
        "translation": "Answer: \"Only the lotus is one of the various interpretations that are the same and different from the following, and the names given to the various classes are all not different.\" Shigong said, \"The lotus is a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, a white lotus, and so forth.",
        "source": "X56n0939_001:0604c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問下諸品名得名如何。",
        "translation": "Q: What are the names of the following phrases?",
        "source": "X56n0939_001:0605a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰二十八品以為四例一義有十五二義有十三義有一四不定有二初十五者又為四從法為名有四謂方信持陀從譬有三謂譬藥化從人有四謂法提常妙從事有四謂序授踊屬二義十中又為三從人法有八謂學無學記如來壽量法師功德如來神力藥王本事觀音普門嚴王本事普賢勸發能所但一分別功德因果但一隨喜功德三義有一五百弟子授記四不定有二安樂行見寶塔今謂屬對甚佳終成不見法華之文異諸經處又曰隨朝岌法師譯藥艸品後添半品正妙二經及論俱無今謂此大不曉應是聞正經名未曾親讀正本具有如何云無言句少殊義理不別若爾引用正經未可依據又曰有彰品次弟子欲聞乎今謂下文釋經品品皆立三門解釋本意即是品之次第何煩預談空費光景又曰更有明品廢立亦欲聞耶今謂至下廢處但知廢之何須此述。",
        "translation": "Answer: The twenty-eight classes are named according to four examples: one meaning has fifteen; two meanings have thirteen meanings; one four uncertain meanings; two first fifteen; and four from the Dharma as the name. There are four that are called the Fangxin Ciduo from the parable, three that are called the parable of medicine and transformation from people, four that are called the Fati changmiao from the situation, and four that are called the preface to the delegation of the two meanings.",
        "source": "X56n0939_001:0605a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰略知文前正釋如何。",
        "translation": "Q: What is the correct explanation before knowing the text in brief?",
        "source": "X56n0939_001:0605b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰不取古人今為三段以序為序次八品為正餘為流通今謂述而不作信而好古又有明稽古者可憑何以依嘉祥而隱其名分章段而越其則嘉祥是天台弟子用義仍未深奧稟其法者乃天台之孫如何不順祖考之令又曰隨朝有遵法師以方便下二十七品俱為正說凡有益處皆名正經今謂有益為正一往似通具如諸品之末縱無聞品益人亦有行之獲利雖然終失佛自被機而為正經告令宣弘而為轉利又失滅後正像之益不順佛所付囑之言不順菩薩發誓之意又曰說一乘處以為正經非一乘處非為正宗此則不如遵師益處為正如陀羅尼及以勸發不說一乘而亦獲益今謂初聞遵釋欲嫌奢慢及聞八品之外不明一乘却不及以遵師通勢若等是唯八品為說一乘則餘者皆無何獨此二勸發之中總攬一部以為四法撮要授柄而云非經一何謬耶陀羅尼聞護經力大乃至有能護持其名福不可量故總信一乘功深利廣是故獲益若總聞非一護總無功總聞總護若非別聞別記何益此二既爾餘例可知。",
        "translation": "A: It's not taken from the ancients, but now it's divided into three sections, with the preface being the order, the next eight sections being the correct, and the rest being the circulation. It's called exposition without making a point of faith and preferring the ancient, and there are those who clearly examine the ancient, so why is it that they rely on Jiaxiang and withhold their names, divide into sections and transcend their principles? Jiaxiang is a disciple of Tiantai, and his teachings are still not profound.",
        "source": "X56n0939_001:0605b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問更有餘意只如向耶。",
        "translation": "Q: Is there any other intention than to simply point the way forward?",
        "source": "X56n0939_001:0605b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰亦可方便至持品明一乘境安樂踊出明一乘行壽量下五明一乘果何者三周說境令知權實勸應捨權而取於實聲聞聞此遂便得記說行令知因之是非勸令學是除非由斯踊出說果令知身之真化證之果因勸識於化求證於真漸獲因果二位勝德菩薩知此遂便道證具顯因果所成勝德須徵因果權實真化今問若八品為正正唯說境何以進趣令至持品若言安樂是行若從所行行即屬法若從能行行即有人若無人者何以經言菩薩摩訶薩於後惡世云何能說是經若言無境何以文云觀一切法空如實相若言無果成外道因戒取所攝經何故云能令眾生至一切智地乃至夢中行詣道場若說果非果現證是果壽量說往餘品說當當果若非往果寧是從顛倒生故說說豈非教壽量下五判屬果者壽量可爾餘四如何分別功德報思供養及以授記記果在當何名為果若當果為果義同向說何獨此五隨喜下四準此可知若言相從生者即名為果一切皆從方便品生遠從鹿苑最初成道故亦不定。",
        "translation": "A: It's also possible to explain the One Vehicle realm from the skillful means to the maintaining stage, and then to explain the One Vehicle practice, and to explain the One Vehicle result from the next five. What are the three circumambulations that explain the realm so that one knows the expedient and the real and encourages one to abandon the expedient and take the real? śrāvakas hear this and then attain knowledge, explain the practice so that they know the difference between cause and effect, and encourage them to train in it unless they enthusiastically explain the result so that they know the true body, the result of transformation, and the result of realization, and encourage consciousnesses to seek realization of the true and gradually attain the two stages of excellence in cause and effect.",
        "source": "X56n0939_001:0605b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰願聞經文釋文疑妨。",
        "translation": "Q: Do you have any doubts about the interpretation of the sūtras and the text of the vows?",
        "source": "X56n0939_001:0605c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰序準論文有七成就七義具足餘經所無今問餘經所無華嚴深密何以無耶若言無者何以同時若有者與向為妨若言華嚴深密之外名餘與前不同為妨。",
        "translation": "Answer: The introduction to the standard treatises has seven accomplishments and seven meanings that are fully present in other scriptures. Now, I'd like to ask why there's nothing in the other scriptures that aren't Huayan and Saṃdhin. If they say there's nothing, how can it be both at the same time? If they exist, it's a hindrance to go along with them.",
        "source": "X56n0939_001:0605c15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰如是二字何義理耶。",
        "translation": "Q: What's the meaning of the word thus?",
        "source": "X56n0939_001:0605c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰初明說由如阿難所問五事今謂此乃緣起事相一意耳又曰若約所以如肇公云信則所言之理順順則師資之道成今謂但是師弟有付受之意耳又曰應以十義釋此信字一信極果之初因二信證諦之歸漸三信通妙真之證淨四信荷至德之嘉威五信聖七財之元胎六信善本因之俶路七信啟機門之勝手八湛心水之清珠九信達名道之良資十信頴衷誠之佳傅今謂文才甚妙義理寬疎準此流例其類葢廣本迹未顯權實不彰又曰若依地論復有四釋一依譬喻如說富貴定無有異二依教誨如云當如是讀誦三依問答答言如是四依許可如云我當為汝如是思作今謂若消他經可依此四若釋今經未知譬喻譬喻何等乃至許可許可何等寧知此經與諸教異若如是等不殊諸教是則一部誰辨不同所無之言便為徒設又曰真諦云結集昇座眾有三疑今謂三俱除疑餘理未顯又曰寶法師云此經離五謗謂一有二無三亦有無四非有無五非非有非非無今謂此乃無小乘經之所離何假今經又曰光宅云如是者一部也今雖闕餘文大理斯在又曰梁武云如斯之義是佛說也今謂猶劣光宅光宅指一部則不失當部武帝云佛說則太成通漫又曰三藏云一就佛三世同然二就法古今不異三就僧阿難傳聞不異故也今謂此通一代未顯法華何廢通消事須辨別唯通無別則失當部之旨歸唯別無通乃遺佛化之大體故知向來一十五釋咸末甄衡將法華之別文寄通如是之下故末可也他釋如是還有二三紙皆咸未詳。",
        "translation": "Answer: First, it's explained from the five things as Ānanda asked. Now, this is called the single point of the conditioned arising of things. Also, if we look at it from the perspective of its reasoning as Zhaogong said, \"Believe then the principle that's spoken is obeyed, and when it's obeyed, the path of the teacher and student is accomplished.\" Also, it's said that the word believe should be interpreted in terms of ten meanings.",
        "source": "X56n0939_001:0605c19_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問曰我聞如何。",
        "translation": "He asked, \"What have I heard?",
        "source": "X56n0939_001:0606a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答傳法菩薩自指己身今謂雖即明指自身須判所聞法體又曰非謂我者定屬一人謂諸陰界假者是也今謂一人何妨假我假我還指一人者必在人假辨非實又曰大論三我(云云)。",
        "translation": "A: The bodhisattvas who transmit the Dharma refer to themselves. Now, even though they say that they are clearly referring to themselves, they must discern the essence of the Dharma they've heard.",
        "source": "X56n0939_001:0606a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何不稱名而但云我。",
        "translation": "Q Why isn't it called a name and just called self?",
        "source": "X56n0939_001:0606b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答有三義故一不乖俗二自在等今謂用世流布未為自在世人未必共有自在如集法傳三阿難三者親義世人共言我聞親也若言阿難或非親聞今謂我還非親世共用故況我非阿難未堪承信又曰我總耳別今謂總別實爾而闕辨所聞教別又曰大乘云根識心所對境和合方聞然根有五義勝於識等故根名聞若但聞聲可唯耳識既緣名義便在意中故瑜伽云聞謂比量耳者親聞於聲與意為門意方聞故以二為門熏習在總因聞所成總名為聞廢別耳意總名我聞此界以聲而為佛事聲為所依名等有故菩提要因聞熏成故由斯經中不說見覺今謂此釋勝於獨指行蘊則失和合熏習成聞但不辨法華而為所聞未成準的。",
        "translation": "A There are three meanings, one is not contradictory to the conventional, two are self-contained, and so forth. Now, it's said that people who use the world to disseminate what's not self-contained may not share the same self-containedness as the three ananas in the Dharma collection and transmission.",
        "source": "X56n0939_001:0606b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰佛本願力如來識上文義相生此文義相是利他善根所起名為佛說聞者識上雖不親得然似彼相分明顯現故名我聞今問如來聞者二識何別若別不應二俱名識不應三無差別若同不分凡聖之位若名同體別何不從智若如來識還從利他善根因緣而生聞者亦從熏習因起俱從因緣並無常耶何以故利他善根非本有故還成似現無異聞者若佛本有生亦本有生若由佛所熏佛亦由生所習經云一切眾生即涅槃故涅槃初分佛亦無常又問佛識為遍為不遍耶不遍同凡若其遍者遍凡識耶若遍凡識者與凡相似同處現耶異處現耶(云云)若云末尼天鼓無思而作此釋當理須辨作相而有五時同異之相以前釋而無破立者良由不知教法共別故也。",
        "translation": "It also says that the Buddha's original vow is the power of the Tathāgata's consciousness to produce the meaningful aspect of the above text, which is produced by the altruistic good roots and is called the Buddha's teaching. Although the Tathāgata's consciousness is not personally attained, it seems to have its distinctive characteristics and manifests itself clearly, so it's called my hearing.",
        "source": "X56n0939_001:0606b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問一時云何。",
        "translation": "Q What's one time?",
        "source": "X56n0939_001:0606c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答有二義故一說聽事訖二說聽相會今謂說聽始終而為一時相會在初事訖在後但云始終即攝初後然淨名經中前中後以為一時涅槃晨朝至於中夜以為一時此經八秊而為一時餘經例說可以意得然須明此始終等時及辨化儀并辨法體是故須云感應道交此經唯為一大事故而論一時又曰五陰和合念念生滅假立於時今謂此時不對於法但是柯邏羅等時何關此經又曰準唯識論說聽二徒心識變作今謂生佛二變如釋我聞又曰不定其時或長或短今謂應對諸經方云長短直云不定此亦不然又於一經如五十小劫謂如食頃此約一經之內不定則不得判經初一時。",
        "translation": "A There are two meanings, so one says listen to the completion of an event, and the other says listen to the conjunction of opposites. Now, it's said that we listen to the beginning and end as one time, and the conjunction of opposites is at the beginning, the completion of an event is at the end, but we say that the beginning and end are included in the beginning and end. However, in the Jingming jing, the beginning, middle, and end are considered one time, and the morning of Nirvana and the midnight of Nirvana are considered one time. The other sutras are examples of what's meant by one time, but it's necessary to explain that these are always the same time, to discern the manner of teaching, and to discern the essence of the teaching.",
        "source": "X56n0939_001:0606c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問佛義如何。",
        "translation": "Q: What does the Buddha mean?",
        "source": "X56n0939_001:0606c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答自覺覺他覺滿等廣如諸教不出自覺覺他及以覺滿自覺只是二智斷於二障盡耳今謂諸經明此三覺不同若俱舍婆沙等及諸部阿含皆悉明於三十四心自他及滿大品三乘共行十地至第十地菩提樹下一念相應斷餘殘習自覺覺滿亦以此覺而以覺他次諸經論或云華王界或云色究竟受佛職位破無明盡成大菩提名自覺滿亦以此覺而覺於他若華嚴中及以此經壽量本論判三身菩提一時具滿此是經論正文而人多不探討同異如前四義各有其因各自成果不知何以然耶若云二智斷障為更許別途為唯許此耶若不許別途大品三智四智所斷各各不同又曰問三身之中何身攝耶答準處準機若應聲聞即應化身準文準理教諸菩薩即合報身如此土眾見異見燒即是應身若見不燒即報身也推功有本即法身也今謂聲聞何以無文理菩薩何以去處機如靈山處一處即多處以所被一機具多機昔聞聲聞之教理至此乃成法華之四法小菩薩之機處成圓常之三德又曰劬師羅長者覩三尺而發心五百婆羅門見灰身而起信無邊身菩薩窮上界而有餘住小聖之凡夫覩丈六而無盡今謂上界之餘未名真體此經所覩令見何身不判此文徒談境異。",
        "translation": "A. Self-awareness, awakening, other-awareness, and completion are as vast as the teachings that don't judge self-realization to be self-awareness, other-awareness, and completion by awakening.",
        "source": "X56n0939_001:0606c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問住王舍城者其義若何。",
        "translation": "Q What's the meaning of \"abiding in Rājagṛha\"?",
        "source": "X56n0939_001:0607a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答古人因此解梵天聖佛等住住名雖同義意全別語邃義幽之處曾不屬心名同理別之文虗張援據今謂不尋異論失在於茲此是龍樹菩薩釋大品佛住之文龍樹意以四住相望不差於佛見古人引便謂古釋望風斥聖其過不輕乍觀文筆之幽邃未若鈴場之下流名同理別之文請思向釋如是等義亦復如是又曰茅城古先君王所都多出吉祥茅艸崇山四周以為外墎西通狹徑北闡山門東西長南北狹周一百五十里子城周三十餘里北門有窣覩波是調達放象害如來處次此東北有塔是身子見馬勝得初果處廣在西域記頻婆娑羅王所都編戶之家頻遭火灾居民怨嗟王曰以我無德民庶遭患修何德業可以攘之羣臣曰大王德化黎庶不謹請制嚴刑以懲後犯若有犯者遷之寒林王遂其言乃先後宮失火王曰我其遷矣命太子攝國事自遷寒林吠舍黎王聞住於野集軍來伐邊候奏聞王自建城故稱王舍城後以此施婆羅門今純婆羅門居之置千王於其地謬矣今謂若撿大藏及諸記傳皆無方可彰言又曰城乃摩羯國之中人王所都表一乘乃三乘之中法王所住之境城出餘城故經勝餘經今謂此亦與前判教為妨一乘三乘之後何曾在中中山最高表過二乘意亦如是又曰城無物而不出表無嘉德而不具難亦如是若但過二乘不出三祇但為婆沙俱舍所攝又曰處有三謂淨穢空說但二謂靈山及空空處訖至經末今謂與諸同異亦未能論又云標創會故云靈山今謂亦與諸文為妨未論。",
        "translation": "Answer: An ancient interpretation of the abodes of Brahmā, gods, saints, and buddhas is that although the abodes are called the same, the meaning is entirely different, and the profundity of the meaning is more profound than the absence of a text that belongs to the mind, the words are the same, the principle is different, and the text is generally unnecessary. This is the text of the Bodhisattva Nāgârjuna's explanation of the abode of the great class of buddhas. Nāgârjuna's intention was to look at the four abodes from each other and not differ from the Buddha.",
        "source": "X56n0939_001:0607a14_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "又曰地論云列菩薩眾者輔翼圓滿天龍眾者眷屬圓滿今謂若釋圓滿實如論文但所說圓滿未及此經若同此經他種何不授二乘記。",
        "translation": "It's also said in the Dilun that the congregation of bodhisattvas is assisted by the perfection of the congregation of celestials and dragons, and that their followers are perfected. Now, it's said that if the explanation is perfected, it's really as explained in the sūtras, but the perfection explained is not as complete as this sūtra.",
        "source": "X56n0939_001:0607b16_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問眾之來意其意有幾。",
        "translation": "Q: What's the meaning of the coming of the multitude?",
        "source": "X56n0939_001:0607b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰來意有五一證信二顯德三啟請四當機五引攝今謂曾聞古德立四種眾大德欲假竊彼義改彼名仍闕結緣證信顯德兼於影響啟請義當發起當機名同引攝亦在發起眾中若依古大無復欺誑所用嘉祥何惜少許言及疏主。",
        "translation": "A: There are five meanings of the comings: one is to confirm faith, two is to disclose virtue, three is to inspire, four is opportune, and five is to lead. Now, I've heard that ancient virtues established four kinds of great virtues that want to pretend to steal their meanings and change their names, but they lack the connection, confirm faith, disclose virtue, and influence, inspire, and raise the meaning, and the opportune name is the same as leading.",
        "source": "X56n0939_001:0607b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此眾之中為幾權實。",
        "translation": "Q How much of this multitude is expedient and true?",
        "source": "X56n0939_001:0607c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答依佛地論一約處化佛穢土聲聞為實菩薩為權報佛淨土菩薩為實聲聞為權今此化報雙有隨應兩權二實初列靈山化佛菩薩為權後列壽量報身淨土聲聞等眾一切俱權況多寶分身悉為化現今謂不應壽量已前萬二千人一切俱實滿慈為是萬二千外為是內耶為在會內為非會耶若在會在數復應問言後方權耶初即權耶何故爾前內祕於大外現小耶身子既為法說之首豈定實耶四大聲聞一切實耶菩薩八萬為盡權耶是八萬人至壽量耶若至後品變為實耶至後品時無聲聞名那云權耶兩權二實為二俱有耶依向所問何相違耶至壽量時論具三身法身為復攝何眾耶論云報身即引經云無量無邊豈指今耶論云化身即指經文伽耶所成即報身耶壽量之中聲聞菩薩見法報耶諸菩薩等見多寶時變為權耶諸聲聞等皆成實耶故不可依何須待問。",
        "translation": "A According to the Buddha-stage Translation, the śrāvakas of the defiled land are the real ones, the bodhisattvas are the expedient ones, and the bodhisattvas of the pure land are the real ones, and the śrāvakas are the expedient ones.",
        "source": "X56n0939_001:0607c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問束一切眾為成幾類。",
        "translation": "Q What kinds of beings are bound up in the masses?",
        "source": "X56n0939_001:0607c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答眾有十五僧二高名無名尼二尊重內屬次聖德難思眾帝釋眾三光四王眾自在眾色眾龍緊乾脩迦人後眾有六謂多寶分身龍宮地涌妙音普賢今謂僧中立無名眾何不為高名隱德眾若云無名亦似無德尼中可爾但舊亦立內屬故若云尊重似非內屬菩薩不應單云聖德難思僧尼二眾皆有大權隱在小中聖而叵測直云聲聞菩薩從迹於理何爽而云聖德使濫餘聖況帝釋至人無不有權而引於實若一槩從迹不應獨著難思之言以隱餘眾却難思故後六直列理合如然。",
        "translation": "A There are fifteen congregations, two high-ranking, nameless, and nuns, two respected, and inner subjects, followed by the congregation of noble virtue, which is difficult to fathom, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, the congregation of Śākyamuni, and the congregation of Śākyamuni.",
        "source": "X56n0939_001:0607c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問若望他經為同異耶。",
        "translation": "Q If we look to other scriptures, are they the same or different?",
        "source": "X56n0939_001:0608a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答六門分別一約三乘則無獨覺仁王則有下文亦云求三乘者二約三界無無色界照不及故仁王則有三約五趣則無地獄獄苦逼故陀羅尼則有本為息苦威力所致此經進善無暇故不來四約四眾無二俗下威儀中則有五約八部無夜叉摩睺下文具有六約二王無輪王下文具有今謂將初列文以對眾何故不辨有無所以緣覺之人濫佛滅後故列眾則無下文有者唯聞十二因緣故若直云有無莫知所以或是集經者略不列之無色不來言照不及既非如來悲智短闕應求不照不來所以及對仁王有無之由曾聞古釋甚有所以何不思之地獄不來乃以進善息苦釋之非無此理法華終窮乃是進善息惡之極復言威力者陀羅尼力本佛所置佛豈別假陀羅尼耶必若別假何不經經說陀羅尼合其來耶若有來不來應有所以準望古德約乘戒等豈不然耶俗二眾者何待威儀中耶闍王所將即其相也八部二王或是略無或別有意既別序具有必是略耳。",
        "translation": "A. The six categories are distinguished. 1. about the three vehicles, then there's no pratyekabuddha; 2. about the three realms, then there's no colorless realm that's not well illuminated; 3. about the five destinies, then there's no hell; 4. about the four aggregates, then there's no two secular realms; 5. about the eight groups, then there's no yakṣa mahoraga; 6. about the two kings, then there's the wheel-turning king; 6. about the two kings, then there's the following: those who seek the three vehicles, then there's nothing below.",
        "source": "X56n0939_001:0608a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問一切諸經列眾先後必如此耶。",
        "translation": "Q: Is this how all the sutras list the congregations first and last?",
        "source": "X56n0939_001:0608a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰準華嚴經羅摩伽經炬樓王經和休經大五濁經竝先列菩薩次列聲聞論大小故今謂或可爾未必全然。",
        "translation": "Answer: According to the Huayan jing, the Lamaega jing, the Torchwood king jing, and the Hew jing, the great five turbidities jing, the bodhisattvas are listed first, followed by the śrāvakas in terms of size, so now we say that may be true, but it may not be entirely true.",
        "source": "X56n0939_001:0608a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問歎羅漢德願聞其理。",
        "translation": "Q Q praises the virtue of the arhats and wishes to hear about their principle.",
        "source": "X56n0939_001:0608a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答大義有六謂數位離德名識今謂理即如是何無表彰及辨同異可一切皆亦大耶。",
        "translation": "A There are six major meanings of the term \"greatness\" which are several distinct virtues called consciousnesses. Now, this is called the principle that is thus, why is there no recognition or identification of similarities and differences that make them all great?",
        "source": "X56n0939_001:0608a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問諸漏乃至心得自在其義何耶。",
        "translation": "Q What's the meaning of the contaminants and even the attainment of mastery?",
        "source": "X56n0939_001:0608b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰準大般若及舊論中有十六句今依彼經以對論文今謂此甚疎遺論中諸句但是釋於經中五句何得取於大般若中十六句文苦和會耶雨大法雨等八句亦然若依般若消十六句可幾紙數答近六七紙今謂繫而不要請不須說。",
        "translation": "Answer: According to Mahāprajñāpāramitā and the old treatise, there are sixteen phrases in the sūtras and the text of the treatise. Now, this is called a very loose interpretation of the phrases in the sequelae, but it only explains five phrases in the sūtras. How can it be taken from the sixteen phrases in Mahāprajñāpāramitā and the eight phrases in the text of suffering and harmony?",
        "source": "X56n0939_001:0608b03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此中所列二十一人從何次第。",
        "translation": "Q What is the order of the twenty-one people listed here?",
        "source": "X56n0939_001:0608b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答或出家次第如報恩經初度五人次度耶舍門人五十次度優樓頻螺門人五百次度伽耶門人三百次度那提門人二百次度鶖子門人一百次度目連門人一百合舉大數成一千二百五十十二遊經佛成道後二秊度五人三秊度迦葉兄弟三人五秊度目連今謂此是部別見異何足會耶況報恩但言次第度十二由則言其秊數已下次第未必全依出家前後。",
        "translation": "A Maybe the order of leaving home is like the first five retreats of the Sutra of Recompense for Kindness, the fifty retreats of the men of Yeshe, the five hundred retreats of the men of Uruvilvā, the three hundred retreats of the men of Gayā, the three hundred retreats of the men of Nadī, the two hundred retreats of the men of Shishu, the one hundred retreats of the men of Mucilin, the one hundred retreats of the men of Mucilin, the one hundred retreats of the men of Mucilin, the one thousand two hundred and fifty-two retreats of the Sutra of Recompense for Kindness, the two hundred retreats of the men of Nadī, the one hundred retreats of the men of Shishu, the one hundred retreats of the men of Mucilin, the one thousand two hundred and fifty-two retreats of the Sutra of Recompense for Kindness.",
        "source": "X56n0939_001:0608b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問優樓等三名有何義。",
        "translation": "Q: What's the meaning of the three terms Ulūka and so forth?",
        "source": "X56n0939_001:0608b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰優樓頻螺此云木瓜胸前癭起狀如木瓜又云池中有龍名木瓜也伽耶者象頭山亦云城城近伽耶名伽耶城那提河名因果經說三人皆在河邊修道。",
        "translation": "A: Uruvilvā, which is called the papaya, has a burr in front of its chest that looks like a papaya, and there's a dragon in a pond named Papaya.",
        "source": "X56n0939_001:0608b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問餘名如何。",
        "translation": "Question: What's the rest of the name?",
        "source": "X56n0939_001:0608b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答舍利弗此云鶖即百舌鳥亦云春鸎自古共云鶖鵠鳥詩云在梁似鶴小鳥也目連此云大採菽氏上古有仙採豆為食迦旃延大般若云迦多演那此云大剪剃婆羅門姓上古有仙多年頭髮長無人剪仙有子兄弟二人俱來覲父小者為諸仙剃頭因此為稱孫陀羅難陀身長一丈五尺二寸也佛到城二日度尼中摩訶波闍佛有三母此為最小大母生佛七日命終耶輸陀羅此云持譽天人讚詠故也相傳云乾達婆女彼生男為樂神生女為玉女若玉女不應有子今謂釋名雖爾應問此中歎聲聞及諸名與維摩思益般若等經為同為異若其同者自初得道遍歷諸會具聞大小德亦增進豈一向如初若一向如初豈諸利智聲聞之人被諸菩薩彈訶為如來加說來至法華大機將動宛然如舊博地凡夫一席經耳尚有所得如何大聖始終無緣若其異者德隨解轉轉相何似請釋其途。",
        "translation": "A: \"Śāriputra, the Śāriputra, the Śāriputra, the hundred-tongued bird, and the spring waterfowl, have been called Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, the Śāriputra, and the Śāriputra.",
        "source": "X56n0939_001:0608b21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問菩薩眾者其義如何。",
        "translation": "Q: What's the meaning of this group of bodhisattvas?",
        "source": "X56n0939_001:0608c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此諸菩薩有二門一者自行大智為首二者化他大悲為首今謂菩薩悲智誰不知之但大小乘殊偏圓各別四階成道三乘共地瓔珞諸伏華嚴普賢文殊善財及入法界諸知識等為一槩耶有階降耶大論大集大智有三謂一切智道種智一切種智慈悲有三謂眾生緣法緣無緣既無分別實暗所聞。",
        "translation": "Answer: There are two approaches to bodhisattvas. One is self-knowledge and the other is compassion. Who doesn't know this compassion and wisdom of bodhisattvas? But who doesn't know it? Are the four stages of attaining the path, the three common stages of the three vehicles, the Yingluo Zhufu Huayan, Samantabhadra, Shanzai, and the knowledge of entering the Dharma realm all in one?",
        "source": "X56n0939_001:0608c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此諸菩薩是何地位。",
        "translation": "Q: What's the status of these bodhisattvas?",
        "source": "X56n0939_001:0608c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰皆八地已上為簡小故名摩訶薩今謂若簡小乘初心即異簡小菩薩未審菩薩從何以分大小別耶若從諸教如四階成道三祗滿百劫種相之初亦未逮於瓔珞初信更有諸別且此未論若也從位十地望於等覺尚小何須八地方受大名。",
        "translation": "Answer: They're all eighth-stage and above, so they're called mahāsattvas because they're simple and small. Now, if they're simple and small, then the initial mind of the lesser vehicle is different from that of the simple and small bodhisattvas. We haven't examined how bodhisattvas discriminate between large and small.",
        "source": "X56n0939_001:0608c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問諸菩薩德諸句如何。",
        "translation": "Q: What are the words of the bodhisattva virtues?",
        "source": "X56n0939_001:0609a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰初不退轉者不退有四一信不退謂十信第六名不退心故次位不退即十住位第七名不退住三證不退即初地得無退失故四行不退即八地已上有為無為皆能修故今謂若釋不退信位之名即指第六第七方有不退名證行二位無不退名何名不退若從義立何須指處若指處者六七已前為退不退若不退者十俱不退何須分限證行二種何以證前而行居後信住俱有不退之名向行何事獨無不退若證未極更須修行豈證真如行有退耶未審退相其相如何不知行退至何處止初地已上亦名為位證位已上行位若退安知信及以位二種不退又曰樂說辯才者四辯七辯七辯者一建辯以無謇故二迅辯如懸河故三應辯不差機故四不謬辯契當理故五無所斷辯如連珠故六義味辯多義理故七最上辯如雷震故今謂應辨所說寬狹不同判諸菩薩所演各別信知三祇共位不關普賢文殊。",
        "translation": "Answer: \"First, there are four kinds of nonretrogression. First, there's nonretrogression in faith, which is the sixth name for nonretrogression in the ten stages of faith; second, there's nonretrogression in the ten abodes, which is the seventh name for nonretrogression in the ten stages; third, there's nonretrogression in realization, which is the attainment of the first ground without loss of retrogression; fourth, there's nonretrogression in practice, which is the attainment of the eighth ground and above, because both perception and non-perception can be cultivated; now, if we interpret the name for the stage of nonretrogression in faith to mean the sixth and seventh, then there's nonretrogression in the name of realization and practice.",
        "source": "X56n0939_001:0609a02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問諸菩薩等因緣德業名義如何。",
        "translation": "Q: What are the names of the bodhisattvas' causal virtues and actions?",
        "source": "X56n0939_001:0609a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰文殊在北方常喜世界作佛名歡喜藏摩尼寶積佛聞名能滅四重又曰過去作佛名龍種上尊王又曰肇云此諸菩薩皆無生忍無生忍者無處不生今謂肇意豎通少分可依。",
        "translation": "He said that Mañjuśrī had become a buddha in the northern Jāti world and was called the joyful store, the maṇi jewel, and the accumulation of buddhas heard of his name that could extinguish the four grave [afflictions] and that he had become a buddha in the past and was called the supreme dragon king.",
        "source": "X56n0939_001:0609a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問說大乘經至佛所護念其義如何。",
        "translation": "Q: What does it mean to preach a great vehicle sūtra until the Buddha is mindful of it?",
        "source": "X56n0939_001:0609a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論云欲說法時成就今謂論云如來欲說法時至成就為諸菩薩說大乘經名無量義乃至法門故既云欲說即指法華名為正說說無量義猶名為欲。",
        "translation": "A: The treatise says that when he wants to explain the teaching, he accomplishes it. Now, the treatise says that when the Tathāgata wants to explain the teaching, he accomplishes it by explaining the names of the great vehicle scriptures, including immeasurable meanings and even the teachings, so when it says he wants to explain it, it means he refers to the name of the Lotus, which is the correct name for explaining immeasurable meanings, it's still called wanting it.",
        "source": "X56n0939_001:0609a24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何以先說無量義。",
        "translation": "Q. Why is it that the immeasurable meanings are first explained?",
        "source": "X56n0939_001:0609b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰有三義一者依人先為菩薩說無量義次為聲聞說一乘二者依利先以一乘利他教理化根熟菩薩次以一乘自利行果方化退大聲聞三者依法先談無量義法體次說法華法用今謂三義各有大妨若為菩薩說無量義不知無量義為是何乘若言先為菩薩何故彼經列眾具列聲聞及菩薩眾其數乃與此經無別故十功德品廣說不可思議十種大功德力已一切菩薩得無量義三昧或得百千陀羅尼門或得菩薩諸地諸忍或得支佛羅漢四果又說法品三萬二千菩薩得無量義三昧三萬四千菩薩得無量陀羅尼門四眾八部王及仕女百千眾俱聞佛所說或得燸法乃至世第一法須陀洹乃至羅漢支佛及無生忍諸陀羅尼此等豈非益聲聞耶菩薩舉數聲聞云諸驗知諸言表多安得云獨為菩薩耶若言此經為聲聞者菩薩聞是法等分別功德菩薩得益又下諸品聞品得益過於彼經二依利者自他之言不應別對若在能化俱有自他二德具足若在所化先須自利聲聞得記發誓弘經若得記已還令自利而此行果何殊小宗況復一乘須具自他豈可分之以為兩段況復教理唯被菩薩行果唯為聲聞只為聲聞昔迷大教而失大理而今還以迷教理之行果與彼聲聞何不只依法華之前具四法之小教況與釋名四法相背又若無量義已說一乘何須更說此法華耶言體用者今謂二俱一乘並有體用用即利物物益須體豈有以無用之體化彼菩薩闕體之用教此聲聞無用有體之一乘有情咸具無體有用之一乘外道神通當知彼化三乘名之為用此經實相妙體灼然是則彼經從體開用之一乘故三乘稟益此經是収用入體之一乘故令三歸一故無量義云無量義者從一法生此經云種種因緣皆成種智況復體是法本無益於人何得三番分張異釋。",
        "translation": "Answer: There are three meanings: first, it's based on the person who first explains the immeasurable meaning for the bodhisattva and then explains the One Vehicle for the śrāvakas; second, it's based on the benefit who first uses the One Vehicle to teach and transform the bodhisattvas with mature roots and then uses the One Vehicle to teach the result of self-benefiting practices before transforming the retrogressing śrāvakas; third, it's based on the method who first talks about the essence of the Dharma with immeasurable meaning and then explains the Dharma function of the Lotus. Now, each of these three meanings has a major obstruction.",
        "source": "X56n0939_001:0609b04_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問大是何義。",
        "translation": "Q What's the meaning of greatness?",
        "source": "X56n0939_001:0609c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答十二門論六種釋大一出二乘二佛果最大此乘能至三佛所乘四能滅大苦而與大樂五觀音等大人所乘六盡諸法源底今謂過二乘獨在佛息大苦盡法底諸經共有然須簡出豈無量義耶又曰攝大乘對法有七大一境大緣百千教法故二行大具二利故三智大了二無我故四進大三僧祇故五方便大具悲智離二邊過故六證得大成就十力無畏故七業大窮生死邊際建佛事故今謂須簡意亦同前又曰勝鬘一乘一乘即大乘大乘即佛性佛性即涅槃今謂勝鬘是權一乘今經是實一乘何得以權來釋於實權實既殊涅槃豈等(云云)。",
        "translation": "Answer: The six interpretations of the Daśabhūmikas are one that goes beyond the two vehicles, two that are the greatest in terms of Buddhahood, four that go to the three buddha vehicles, four that end great suffering and give great joy, five that are vehicles of great persons like Avalokitêśvara, and six that exhaust the sources of all dharmas.",
        "source": "X56n0939_001:0609c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問諸經如淨名等並有異名此無量義有異名乎。",
        "translation": "Q: Do the sutras like Jingming and so forth have different names for this immeasurable meaning?",
        "source": "X56n0939_001:0609c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論中具列一十七名初名無量義乃至第十六名妙法蓮華第十七名最上法門今問對前三異則名異義異本不相關若其相關名異義同此經亦應名無量義耶如其亦得名無量義乃是此經與彼同體同法同人異名而已若異名而已已聞無量義竟何須三請更說法華若也不同與論妨不況論但云是法華異名不云無量義也又曰無量義云無量義者從一法生其一法者即是無相如是無相無相不相無相不相名為實相菩薩安住如是實相發大悲心故知如是安住能開實相發菩提心則與今經能會之實其相永別又曰無量義云善男子菩薩若能修一法門無量義者必得疾成無上菩提善男子如一種子生百百生千千生萬萬中一一復生百千萬數乃至無量此經亦爾從一法生乃至無量故名無量義彼釋曰此經不唯取所出教理無量義體即真智境體今謂彼經正明從一出多為宗何以棄所出之無量取能出之正體體雖極要經意不然若然者從一出多何異此經會多歸一同異屬目而無解分辨異則以三義取體爾乃同為一類此事可見何以固違。",
        "translation": "Answer: The treatise lists 17 names, the first of which is called immeasurable meaning, the 16th is called the Lotus of the Wonderful Dharma, the 17th is called the paramount dharma-gate.",
        "source": "X56n0939_001:0609c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問既知無量義名同異若是餘名不能盡理追逐第十六名名法華者前雖略釋因茲更問其義何耶。",
        "translation": "Q: Since we know that there are measureless names that are the same and different, and if the other names don't exhaust the principle, then we'll chase the 16th name, which is called the Lotus, even though it was explained briefly earlier, and ask what it means.",
        "source": "X56n0939_001:0610a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰一出水義以所詮理名華二華開義以能詮教名華今問經詮因果及以權實以故蓮華譬彼二雙何以但語教理棄蓮存華開與出水華實無缺安得二時輒分能所況復與前四法義違然亦與向行果文背。",
        "translation": "A: First, the meaning of \"rising water\" is called \"flower\" based on the principle that's being explained, and second, the meaning of \"opening flower\" is called \"flower\" based on the teaching that can be explained. Now, I'm asking why the sūtras explain cause and effect and use expediency and reality so the lotus is like those two pairs.",
        "source": "X56n0939_001:0610a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰無量義者又有三義故一名無量義體用勝故二教菩薩法化根熟故三佛所護念依佛有故今問何故前對法華但有體而無用今獨釋無量義乃云體用勝故又勝何經名之為勝若勝小乘未足為勝若勝大乘法華亦在大乘之根若當體名勝小乘亦然何獨此耶。",
        "translation": "Also, the meaning of immeasurable has three further meanings so one is immeasurable because the essence and function are superior, two are taught that the bodhisattva's faculties of Dharma transformation are ripe, and three are based on the Buddha's existence in order to protect his mind. Now, I've asked why the previous explanation of the meaning of immeasurable only has essence but no function.",
        "source": "X56n0939_001:0610b02_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰曾聞他問法華亦與無量義同名何故此三昧起方說此經。",
        "translation": "Q: I've heard others ask why the Lotus and the Sutra of Immeasurable Meaning are called the same thing when this samādhi arises.",
        "source": "X56n0939_001:0610b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答有五解一者蓮華二時得名彼如未出水時性能出故故未化二乘令趣一乘此經如出水正化二乘二彼正化菩薩傍化二乘此正化二乘傍化菩薩故彼正名無量義傍名法華此正名法華傍名無量義時異體同然將教理以對行果三彼據智體名無量義此約智用名為法華會二歸一故四彼以理教名無量義菩薩已修一乘因趣一乘果故不為說行果一乘名蓮華由但不知應病與藥之教理但說教理名為蓮華此聲聞未能應病與藥故不為說教理蓮華但說行果蓮華令趣入故故下經云乘此寶乘直至道場因行蓮華也唯以佛之知見示悟眾生果蓮華也論云開者無上義示者同義悟者不知義入者令至不退轉地義釋曰前三是果後一是因五者彼以教理二種無量義此經對彼二乘教理行果並名蓮華前之三義彼此體同後之二義此寬彼狹又曰實理經文上下亦通教理行果今謂五義釋異自覺不當乃伏云理實上下具於四法當知上來二二異釋其義自壞何須更難且如第一義立彼如未出水時若以聲聞未迴心時名未出水則爾前諸教一切皆然何獨無量義耶二傍正者彼經亦應少許聲聞於彼得記若全無者何名為傍只應有無相對何名傍正相對若言此經正化二乘即應聲聞得益多於菩薩何以菩薩得益倍於餘經若言彼經正化菩薩菩薩得益應多於此如何少耶若云但是名傍正者論中直列一十七名名既並施傍正何在正即俱正傍亦並傍三體用者已如前難四教理等其義已壞但開示等四準論文中不云因果然論釋開只云如來能證令眾生知次釋示云法身平等示眾生知釋悟中云唯佛一乘令眾生悟並無果名準不退地其地却成直至道場道場是果何名為因其第五義亦隨前破言菩薩不知應病與藥之教理何異聲聞只緣聲聞之人未知正應授與故知聲聞自行義強唯稀化物菩薩化他久著唯應進行至果若果不須至分別功德何須進位諸義既廢何論寬狹。",
        "translation": "Answer: There are five explanations. One, the lotus is called the lotus in two ways. He is like the one that comes out of water when the properties are produced and therefore the two vehicles have not yet been transformed so that they can go to the one vehicle.",
        "source": "X56n0939_001:0610b09_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問從佛說此經已至不動者其義如何。",
        "translation": "Q: What does it mean to say that this sūtra has reached the stage of immovability since the Buddha taught it?",
        "source": "X56n0939_001:0610c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰表智處得理方可說法今謂此為入於何等三昧得何等理若入無量義三昧還得無量義理只應正為菩薩而說教理若入法華三昧經文但云入於無量義處三昧況復得理應記二乘又曰若不入者則有分別動搖說不自在今入三昧身心不動離於分別動搖於法自在又離一切障謂入三昧離諸定障若無定者於障及說不自在故今問何以將婆沙之義用釋法華三身吾今此身即是法身不謀而應無運而作佛不入定何障何縛而不自在但為示化儀現入定相亦令見者得四悉益得種等益得顯密益。",
        "translation": "Answer: It means that the principle can be attained only by demonstrating the state of knowledge. Now, this is called the principle that can be attained by entering what kind of concentration? If one enters the concentration of immeasurable meanings and still attains the principle of immeasurable meanings, one should only teach the principle for bodhisattvas. If one enters the concentration of the Lotus, the sūtras only say that one enters the concentration of immeasurable meanings, how could there be principle that should be recorded for the two vehicles?",
        "source": "X56n0939_001:0610c20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曾有人問佛常在定何須云入。",
        "translation": "Q: Has anyone ever asked why the Buddha always remains in meditative concentration and why does he need to enter it?",
        "source": "X56n0939_001:0611a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰有十義故一者隨緣動靜利物故二者為放光若不入定則非佛瑞三凡欲說法須先審機四顯法殊妙今謂此四既然餘六請止與前釋佛氣類欲同若言隨緣動靜如須菩提亦不違物情若言放光不入則非佛瑞如般若中支節放光及涅槃中面門放光乃至諸經凡有放光豈必入定若言審機與婆沙中日夜三時審機何別若顯法妙華嚴般若及以大集涅槃直爾說之豈不妙耶故知此四並附小乘非法華意。",
        "translation": "Ans. There are ten meanings. 1. because it follows conditions, moves and quiesces, and benefits things, 2. because it's an emitted light, and if it doesn't enter concentration, then it's not a buddha-rui, 3. whenever there's an emitted light, how can it be different from examining the capacity of the three periods of the day and night in the Vibhāṣā council, and 4. to reveal the wonders of the Dharma, since the other six are explained in the same way as the desire for the Buddha's vitality.",
        "source": "X56n0939_001:0611a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問天雨四華其義如何。",
        "translation": "Q: What does it mean when the gods rain down the four flowers?",
        "source": "X56n0939_001:0611a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰華名柔軟表見者離於剛強麤鑛三業今謂華表顯實之徵預呈開權之兆但除麤鑛三業欲定亦可治之。",
        "translation": "Answer: The name \"flower\" means \"gentle.\" It shows that those who see are free from the three activities of rigidity and strength, and grit and ore. Now, the flower shows that it's a sign of the manifestation of the truth, and it's an omen that reveals the opening of rights but removes the three activities of grit and ore.",
        "source": "X56n0939_001:0611a16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問華既如是四者表何。",
        "translation": "Q: \"Since the flower is thus four, what does it indicate?",
        "source": "X56n0939_001:0611a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰表度四生興四念住修四生勤獲四神足行四法迹證四諦截四流斷四繫去四軛得四妙智悟四涅槃證四德今謂華本表因不應指果若也指果天應雨實況但以多四連煩為對不知四內大小相違應知四生唯在界內若度界內興何四住證何四諦乃至流軛羅漢已袪故未是得四智等人等是煩列何不更列四大方海等耶。",
        "translation": "Answer: It shows the four deliverances that produce the four abodes of mindfulness, cultivate the four deliverances, and attain the four miracles, realize the four truths, cut off the four streams, end the four tethers, remove the four yokes, attain the four marvelous cognitions, realize the four virtues, and so forth.",
        "source": "X56n0939_001:0611a19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何此界地動地界不動放光則及他土。",
        "translation": "Q: How does the ground in this realm move and the earth that doesn't move emit light that reaches other lands?",
        "source": "X56n0939_001:0611b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰光明寬狹或唯此界如阿含經下生入胎乃至轉法輪等皆有六動十八動等又勝思梵天經七因緣故動一怖魔二攝散三調放逸四念法相五令觀說處六令熟者脫七令隨順正義今謂大小乘經雖皆地動當其部會必不徒然大小不同各有所以況須云廣狹所以故知後代弘教應求旨實若法華中只同小教大小法相亦應無殊信知古釋可依近代未為準的。",
        "translation": "A: The light is wide and narrow, or maybe it's just this realm like the Āgama sutras where there are six movements and eighteen movements from the birth of the next generation into the womb to the turning of the wheel of the Dharma, etc. Also, the Sutra of Brahmā has seven causes and conditions that cause movement, one to fear the devil, two to gather in distractions, three to adjust dissipation, four to be mindful of the characteristics of the Dharma, five to cause observation of the place of discourse, six to cause those who are ripe to escape, and seven to cause compliance with the correct meaning.",
        "source": "X56n0939_001:0611b02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問放光瑞其義云何。",
        "translation": "Q: What's the meaning of the ray of light that radiates?",
        "source": "X56n0939_001:0611b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰前雨華動地未是殊絕之能是故今更放神光希奇今謂若華地非殊應表餘教若也與光共表今經如何其瑞有絕不絕又曰放光七義一令信佛最勝二破癡暗三引出世四表內發智光五息眾苦六召眾至七令猒色境今謂此全不是法華經瑞四含何曾不云佛勝所破之暗暗體如何若欲界癡外道初禪已能斷之外道尚除下八地癡小乘出宅已名出世證得初果乃至三十四心亦名智發三界之惑小智先無此中放光非為召眾不淨觀者色境已傾若表他經必無是過儻在般若猶召勝機大集華嚴還招物議。",
        "translation": "Answer: The previous rain on the lotus that moved the earth wasn't special; therefore, the present release of the divine light is rare. It's said that if the lotus and the earth aren't special, the rest of the teaching should be expressed, and if it's also expressed together with the light in the present sutra, how is its appearance special and not special? It's also said that the release of the light has seven meanings: first, to cause faith in the Buddha's supremacy; second, to destroy delusion and darkness; third, to lead to transcendence; fourth, to express the inner light of wisdom; fifth, to quell the suffering of many; sixth, to summon the multitude of people; and seventh, to cause the sorrow of the form realm.",
        "source": "X56n0939_001:0611b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問其光何故偏照東方但萬八千。",
        "translation": "He asked why his light shines partially in the east but is only eighty-thousand in number.",
        "source": "X56n0939_001:0611b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰西方以東為上表法華唯被佛性大乘不被餘性今謂自釋別序已來至此言涉今典若然唯被佛性佛性無偏定聲聞人天流轉此中豈無佛性者耶又曰萬表涅槃寶渚萬德八千表菩提白牛八正今謂萬德可爾千數如何但以八表八而復不云一乘八正無簡小乘義尚通途未足以為法華之表又曰振地唯在此界偏驚有緣放光照萬八千顯明權實今問若唯此界不涉他方何故妙音往來十方地踊普賢神力此等亦何。",
        "translation": "Answer: \"In the West, the East is the highest expression of the Lotus, which is only possessed of the buddha-nature, and the Mahāyāna, which isn't possessed of any other nature.\" Since the explanation of the special preface, it's been said that only the buddha-nature has been expressed, and the buddha-nature has no partiality, so is there no buddha-nature among the śrāvakas, humans, and gods in flux?",
        "source": "X56n0939_001:0611b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問六趣名相於此要耶。",
        "translation": "Q: Do the names and characteristics of the six destinies matter here?",
        "source": "X56n0939_001:0611c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰光中既見理須消釋此應六門分別一者釋名趣謂所趣假者起業所歸趣處地持云所受自然俱舍云光潔自在名天涅槃云多思雜心云意靜名人雜心云從他求又云飢虗多畏名餓鬼俱舍云傍行傍生名畜畜養之義人之資具故也捺落迦此云苦器其處不定非唯地下阿素落云非天此之翻名一切大同無顯今教二出體者皆以第八異熟識而為趣體無覆無記性攝故唯識云此第八識是界趣生施設本故是為趣生之體無勞別執實有命根今謂凡諸釋義須分大小若小乘經未明第八欲釋趣體亦第八耶若小乘能造如正法念六道皆由心之所造即第六識若言所造能趣所趣不越命根若從大乘第八為定大乘須分徧圓不同若從圓教從無住本世間常住常住世間水波波水終無別號三開合者總一生死二謂善惡分段變易今謂若約小乘無變易名法華依大則有變易復應消釋六趣之中幾聞不聞開不開等今經只云受報好醜復何得以變易加之若言變易在六趣中則須分分段六趣變易六趣實六權六本六迹六若大乘中通云生死方可二種相對論之又若變易在六趣中釋六趣時即云變易者諸佛常體遍一切處若釋六趣亦可為三一分段二變易三佛身。",
        "translation": "Answer: Since they are seen in the light, the principle must be eliminated when interpreting these six destinies. One is to interpret the names of the destinies that are destined to be false, the place of destination that is the origin of karma, the ground, the cloud that is received by nature, the community, the cloud of luminosity, purity, and freedom, the name of heaven, the cloud of nirvāṇa, the cloud of many thoughts and distractions, the cloud of quietness of mind, the cloud of celebrity distractions, the cloud of seeking from others, the cloud of hunger, the cloud of fear, the name of hungry ghosts, the community, the cloud of evening activities, the name of animals, the meaning of animal husbandry, the necessity of human possessions, and the cloud of naraka, the cloud of suffering, the place of uncertainty, not just the ground, the cloud of asura, the cloud of non-heavenly existence, the transliteration of this name, all things common, the absence of manifestation.",
        "source": "X56n0939_001:0611c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰三即三界四即四生及以四有生有本有死有中有今謂夫離合者開一為多合多為一餘數亦然故生死與六六一相對此則可爾若對四生四有未必全然四生與趣相攝不同生能攝趣趣不攝生況人傍生全攝四生獄天中有寬狹永乖生等四有一一攝六以四對六開合不成又曰方便因緣有後無後今謂攝大乘所立四種寬狹永別雖俱名生死高下不同六趣但合在於分段四俱不攝若順變易在六趣中進退有妨已如向問又曰或五除素落今謂若以此五開合亦殊應知變易隔在五外何名開合方便等四都不相關又曰或七五趣并業及以中有今謂以業中陰而對五者乃成三重列於六趣等是重列何以四中但加於中除生本死若有去取不成開合又曰或九謂九有情居今謂但對六趣此則可爾由前復對變易生死及以四有故亦不成二十五有不成亦爾又曰餘三門在第二經中亦如後破。",
        "translation": "It's also said that the three are the three realms, the four are the four births, and the four existences, birth has origin, death, and intermediate existence. It's also said that those who are free from union are those who open one into many, close many into one, and the rest are likewise.",
        "source": "X56n0939_001:0612a05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問見諸菩薩及種種修行等義何耶。",
        "translation": "Q: What's the meaning of seeing all the bodhisattvas and various practices?",
        "source": "X56n0939_001:0612a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰不出三寶僧開三乘今問種種之言多耶一耶頓耶漸耶大耶小耶既云光之所照本顯權實俱同種種之言權耶實耶與此經會同耶別耶若同何以三乘未會若異何能顯經若實不應種種若權與此永乖大小漸頓準例可知。",
        "translation": "Answer: It doesn't mean that the saṃgha doesn't meet the Three Treasures and opens up the three vehicles. Now, I'm asking whether the various ways of speaking are many, one, sudden, gradual, great, or small, and since the light that shines on them originally shows that both expedient and real are the same, what kinds of ways of speaking are expedient, real, and true, and whether they're the same as this sūtra or different? If they're the same, then why is it that the three vehicles haven't yet met? If they're different, how can they reveal the sūtra? If they're true, then they shouldn't be various, and if they're expedient, then their size, gradual, and sudden are precisely the same, as can be seen from this example.",
        "source": "X56n0939_001:0612a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問涅槃何義。",
        "translation": "Q. What's the meaning of nirvāṇa?",
        "source": "X56n0939_001:0612b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰六門解釋今謂施教之來意在修行何棄行而全略至涅槃而廣張涅槃為行之所期應對行以分判初出體中具列四種謂自性清淨有餘無餘及以無住處今問華臺始滿初成正覺有餘無餘其相何似又曰二釋名者出所知障名為法身勝鬘云在纏名藏出纏名法身今謂引勝鬘此說甚有典據然應須辨與涅槃等諸大乘經同耶異耶藏名含藏在纏之時全藏為纏如何復云能藏若云含法則藏是能含法是所含此之能所與惑別耶與惑同耶又復含者為唯含染亦含淨耶為唯含因亦含果耶為唯含凡亦含聖耶若一法不含不名一切若俱含者巨有所妨不含法身不名為藏涅槃經云祕密之藏三德具足若勝纏藏三德不具非如來藏是眾生藏又問佛性與法身同耶異耶所言佛者從何立名果耶因耶若從因者因無佛名若從果者凡即是佛何名為性故知勝鬘是未了之說是以因藏對惑言之又曰三乘俱坐解脫牀亦非大涅槃今問三乘俱坐既俱非大驗知菩薩有大非大若也非大理須法華更會何得輒云會唯二有若非大不會現違經文菩薩聞已疑除善行若依此義自語相違又曰由擇滅故體如伊字今謂圓經無擇滅稱何得以三十四心之擇滅用釋五十二位之涅槃。",
        "translation": "Answer: The six interpretations of the teaching now say that the intention of the generosity of the teaching is to cultivate practice, but why abandon practice and completely abbreviate it to nirvāṇa and then extensively explain that nirvāṇa is the expectation of practice, and that practice should be judged in terms of the four kinds of self-nature purity, remainder, no remainder, and the abode of no abiding.",
        "source": "X56n0939_001:0612b04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問文殊師利何故獨名法王子耶。",
        "translation": "Q: Why is Mañjuśrī called Prince of the Dharma alone?",
        "source": "X56n0939_001:0612c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰未紹法王之位獨得王子之名今謂餘者不稱王子一切皆應上慢龍種尊王古佛不合更稱王子逸多現居儲君何無王子之號方等列眾十一菩薩皆名王子應當皆悉位居等覺方受王子之名但知諸經或略或存如淨名經歎菩薩云近無等等佛自在慧皆等覺也故所列菩薩亦略王子又曰文殊菩薩是第四依已供八恒并前三依供二十六恒今謂四依供五至八如人步涉所至近遠劣者始行五百次者六百次七次八豈令次者行於十一次行十八後者行於二十六耶故知只是一一加之名六七八如聲聞人出化城時豈歸凡地行初由旬只於三百即前進也此見小乘修熏禪者有五階差五各三品以後後人三三增之便謂四依供佛亦爾若其五人各行三百道理最後一千五百故知此中不須別釋。",
        "translation": "Answer: Before he was promoted to the position of Dharma king, he was given the name prince alone. Now, the others aren't called princes, but all the others should be called princes, and all the conceited dragon-race honored kings, and the ancient buddhas don't agree with the name prince, and they don't call him prince; the eleven bodhisattvas in the present abode are all called princes, and they should all be placed in the position of virtual enlightenment and then receive the name prince.",
        "source": "X56n0939_001:0612c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰何故以恒河而為喻耶。",
        "translation": "Q: Why is the Ganges River used as a metaphor?",
        "source": "X56n0939_001:0612c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰有五義故一由沙多二世人計為福水入中滅罪沒死生天三劫劫名存四佛多近住五眾人共悉乃取池口初出方四十里沙為喻今謂夫兼俗之言事須去取若全用者五義之中豈緣第二沒者生天佛取為喻故應須簡第二存四為信之首。",
        "translation": "Ans. There are five meanings, so one is because there's a lot of sand, two worldlings count it as blessed water, and it enters, ceases sins, forfeits death, is born in heaven, three eons, and the name is stored, four buddhas abide near, and five multitudes collectively take the first 40 miles of sand that comes out of the mouth of the Ganges as a metaphor.",
        "source": "X56n0939_001:0612c17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問七寶名體其事如何。",
        "translation": "Q: What's the matter with the names and bodies of the seven treasures?",
        "source": "X56n0939_001:0612c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰一金說文云五色黃者為長久埋之不生百練不輕二銀亦曰白金三珊瑚佛地論赤色石脂樹形四真珠即赤珠佛地論赤蟲所出或珠體赤五末尼如意神珠無瑠璃故開二珠六車璖青白間色七馬腦此言杵藏或胎取堅實今謂經意釋施以辨度相用辨今經判五時別直釋名體有何不可然文正意事在辨異以顯於同若不顯同何繁說耶。",
        "translation": "Answer: a gold said the text of the cloud five colors yellow for a long time buried does not produce a hundred Lian not light two silver is also called white gold three coral Buddha ground theory red resin tree shape four true beads that red beads Buddha ground theory red insects or beads body red five Mawni Ruyi Shenzhu no lapis lazuli so open two beads six car modeling blue and white color seven horse brain this is said to be the meaning of the scriptures to explain the donation to identify the degree of discernment with the discernment of the scriptures judge five times to explain the name of the body what is not possible, but the text is the correct meaning of the matter is to identify the difference to show in the same if not show the same why complicated to say yeah.",
        "source": "X56n0939_001:0612c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問車等如何。",
        "translation": "Q: What about chariots and so forth?",
        "source": "X56n0939_001:0613a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰車者夏后代奚仲造之古音居行居人也今曰車車者舍也行如舍故乘者駕也周禮云載也輦輓車也人前引之古卿大夫皆亦乘之自漢已後天子乘之故今天子皇后所乘者曰輦輿者說文云車輿也又云無輪車也作轝非體欄鉤欄也門遮也楯檻也縱曰楯橫曰欄華葢者酉方暑月持之遮熟釋名雖爾須會此經意亦如前又曰唯識云具足攝受方成度相頌曰安住與依止意樂及事業巧便向清淨度成由此七於此中但舉迴向一今謂雖有清淨之言為有相耶為無相耶非相非無相耶與華嚴般若施為法界及攝大乘與大品中度度攝六為同異耶又曰施有五種謂志心信心隨時自手如法行捨此五即攝七中事業今謂既攝入七問意同前都無般若無住相故亦無楞嚴互相攝故。",
        "translation": "A: \"The chariot was built by Xi Zhong in the Xia dynasty, and the ancient sound of the chariot's residence is like the residence of a house. The chariot is a house, and it travels like a house; therefore, the vehicle is a carriage, and it's driven by the Zhou dynasty, and it carries, carries, and holds an enduring chariot, and it's led by people.",
        "source": "X56n0939_001:0613a07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此中經文六度之相雜亂次第二種何所表彰。",
        "translation": "Q: In this sutra, the six perfections are confusing in their aspects. What is the second type of recognition?",
        "source": "X56n0939_001:0613a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰雜在地前次在登地今謂教純行雜一切皆然純雜相望乃雜進而純怠何者正行施時未修餘故若云初地成就檀波羅蜜餘非不修但隨力隨分不審初地菩薩為破何戒違何則瞋不行何行何惑所亂有何愚癡世人但知信權教而迴轉不窮實以歸宗今文因光所見乃見地上地前及以七地尚乃不知地前為何所表不判所表徒設餘辭況所釋行相全同人天戒善而已。",
        "translation": "A: It's mixed in the first ground, followed by the second in the first ground. The teaching is pure, the practice is mixed, and everything is pure, mixed, and the Xiangwang is mixed, advanced, and purely lazy.",
        "source": "X56n0939_001:0613a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問從或有菩薩至無上道文相如何。",
        "translation": "Q: What's the textual appearance of the path from some bodhisattvas to the unsurpassed path?",
        "source": "X56n0939_001:0613b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰初之一行是後得智今問後得智體獨在於佛亦通菩薩若根本智在佛獨有如何後得屬菩薩耶故知深是不要此解。",
        "translation": "Answer: The first one is subsequently attained knowledge. Now, the question is: Is the essence of subsequently attained knowledge found solely in the Buddha and shared with bodhisattvas? If the fundamental knowledge is found solely in the Buddha, how does subsequently attained knowledge belong to bodhisattvas? Therefore, we know that this is not a profound understanding.",
        "source": "X56n0939_001:0613b06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問爾時文殊至大士何義理耶。",
        "translation": "Q: At that point, what's the meaning and principle of Mañjuśrī to the great person?",
        "source": "X56n0939_001:0613b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此答成就也今謂大文雖即在答成就今此初文是經家序出答人非答成就文也論中但云文殊師利以宿命智能答彌勒不云此文為答成就分文既悞何足可怪。",
        "translation": "Answer: This is an accomplished answer. Now, although the main text is an accomplished answer, this first text is a sūtra preface that answers the person, not an accomplished answer. The treatise only says that Mañjuśrī answered Maitreya with his knowledge of past lives, not that this text is an accomplished answer.",
        "source": "X56n0939_001:0613b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問從如我惟忖去文是何義耶。",
        "translation": "Q: What is the meaning of the text Tathāgata Vipaśyin?",
        "source": "X56n0939_001:0613b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論分此文云成就十種事初是大義因成就經但五句論有八句應作四對今謂論以八句釋於四句何須以增句添經文耶廣如疏記。",
        "translation": "Answer: The text of this part of the treatise says that it accomplishes ten kinds of works. The first one is a sutra of great significance because it accomplishes only five sentences and has eight sentences that should be made into four pairs.",
        "source": "X56n0939_001:0613b14_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問十號名義何。",
        "translation": "Q: What are the ten epithets?",
        "source": "X56n0939_001:0613b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答瑜伽云無上丈夫調御士薄伽梵為第十即世尊也故知如來是下九號之總序也今謂此亦譯人意別何足和會什公善曉音辭計無忝於新學所譯經論皆如此經何得後譯獨為前後故笈多添品一句不改後代豈可過笈多耶。",
        "translation": "A. The yoga says that the unsurpassed tamer, the Bhagavān, is the tenth, the Bhagavān, and so it follows that the Tathāgata is the general preface to the next nine numbers. Now, this is also called a translation of a different meaning, which is not sufficient to reconcile the fact that Shigong well understood the sounds, words, and words, and considered them unparalleled in the new study of the translated sūtras and treatises.",
        "source": "X56n0939_001:0613b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問頗羅墮唐名何等。",
        "translation": "Q: What is the name of the tang of Bālāditya?",
        "source": "X56n0939_001:0613b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此婆羅門十八姓中之一可爾。",
        "translation": "He answered, \"This is one of the eighteen Brahman surnames.",
        "source": "X56n0939_001:0613b23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問八王子名為何表詮。",
        "translation": "Q: What's the name of the eight princes?",
        "source": "X56n0939_001:0613c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰應為四對一大智大悲二了有了空三進善破惡四違偽知真今謂直聞所對對甚分明及至屬名未為的當如何有善名為悲智無量及寶為了有空唯進善破惡稍欲相似響雖虗假不可全偽法通真俗未必無假。",
        "translation": "Answer: They are the four pairs of great wisdom, great compassion, two understanding existence and comprehension of emptiness, three advancing goodness and refuting evil, and four knowing the truth in spite of falsehood. Now, this is called a directly heard pair that's quite distinct and which belongs to a name yet to be done.",
        "source": "X56n0939_001:0613c01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問彌勒當知至汝身是也此是何文耶。",
        "translation": "Q Maitreya, you should know that this is your body. What is this text?",
        "source": "X56n0939_001:0613c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答古今相即也今謂自古章疏皆云結會古今而忽改為古今相即何足為奇人雖相即事處天隔。",
        "translation": "A The ancient and modern are the same. Now, it's said that since ancient times, chapter commentaries have taught that the ancient and modern are combined, but suddenly it's changed to the ancient and modern are the same.",
        "source": "X56n0939_001:0613c06_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問瑠璃是何義。",
        "translation": "He asked, \"What's the meaning of lapis lazuli?",
        "source": "X56n0939_001:0613c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰應云吠瑠璃無吠略也頗黎應云頗胝迦即水精也亦云水玉或白珠智論云出山石窟中俗云過千秊冰而化為之若西方地熟無冰何物化之但應石類今謂此釋甚佳。",
        "translation": "Answer: It should be called vaiḍūrya without vaiḍūrya, and it should be called bāṭika, which is water essence and also water jade or white pearl.",
        "source": "X56n0939_001:0613c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "○釋方便品",
        "translation": "○Explaining the Chapter on Skillful Means",
        "source": "X56n0939_001:0613c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初來意中云一依八品為正蓮華有出水開敷之二德妙法具果秀行竦之兩能今經唯為一乘故破二會二歸於一乘為法華宗主今謂始欲設問方便之由子既自云不無疑失三周既無緣覺之人何得但云破會二耶菩薩須破非止一文至下諸文子當自挍又曰亦可十九品為正初十二品明一乘境安樂行明一乘行壽量品明一乘果今謂前何故云八品明於一乘之境至此那忽加四品耶境無餘三已如前難安樂唯行壽量唯果及不輕等合入果耶不便如前又曰十二品中初八品正明權實三根得記法師下三勸募持行下之一品稟命捨權持行實法今謂何故適云十二品明境今即忽爾屬行境乃是理行是能趣又聲聞之人聞三周時權已被會豈至持品方勸捨耶又捨不名會於一佛乘分別說三則知三是一家之三如於一拳分別說指今還合指以成於拳故知捨指何異捨拳若其捨權無實可趣若三周未捨領解空談若言自行持實化他持權是故須勸持於權者自三周來聲聞何處尚自執權而言勸捨。",
        "translation": "In the initial stage of the teaching, it says, \"One relies on the eight classes as the correct lotus that has the two virtues of emitting water and disclosing the marvelous Dharma that has the two capabilities of producing fruit and manifesting practice.\" Now, the sūtra is only for the One Vehicle, so it refutes the two assemblies and the two return to the One Vehicle as the patriarch of the Lotus School.",
        "source": "X56n0939_001:0613c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問論文從此方便品去謂何文耶。",
        "translation": "Q: What's the text of the treatise that goes from this chapter on skillful means?",
        "source": "X56n0939_001:0614a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論曰自此已下示現所說因果相故釋曰此下明經宗旨所說因果體相相狀此有三釋一者所說諸佛智慧為果能詮智慧教門為因今謂能詮所說悉皆是教況教因智果未見明文諸佛乃以教為行因行為果棄行存教有言無實端拱待理終無此事若佛智是果何獨云境諸佛有果而具境眾生有境而無果境通果別通別混和況復此果濫於壽量二者三請已明一乘之事開示悟入前三為果後一名因今問向以教為因今以入為因二因參雜兩果縱橫因一果三違論如向三者初智及門門因智果開示悟入三果入因教理行果俱法華故令識昔者教行方便說三今談乘體理果果慧唯一聽三乘之教解一乘之理行三乘之因證一乘之果法華意也今謂教行理果俱法華故別對義壞已如前難若四俱法華則昔亦有四聲聞在昔豈無昔四若今昔並四何以乃云識昔教行談今理果又何以前對無量義即云行果今對昔小即云理果豈以所對不同即令能對互失又豈有聞三解一證一由三若聽行三乘之教因解證一乘之理果昔教既具昔應已證何待今耶況聽小悟大都非主對又云聲聞聽三為聽三中之一為總聽三消釋糾亂不可整理。",
        "translation": "A: The treatise says that from here on out, it shows the aspects of cause and effect as explained; it explains that from here on out, the purpose of the sūtras is to explain the essence and characteristics of cause and effect as explained.",
        "source": "X56n0939_001:0614a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何名方便品。",
        "translation": "He asked, \"What is the category of skillful means?",
        "source": "X56n0939_001:0614b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰先明字訓便字應房連反今謂此是北人喚字不正反音又悞依北應云傍連反依南應須去聲呼之他釋云佛智有二一真實智二方便智真實智有二一實法二實智實法亦二一體實謂有為無為二真實謂真如妙理實智亦爾一如體實智即觀體實無漏真智對凡妄智不知名實根本後得二智俱是二證真實智唯正體智此有五對一對妄名實智二對事名實智三對相名實智四對知詮名實智此之四種實智皆是唯觀第四真智餘四所對如次皆是四世俗智五對權智名實智謂一乘理智對二權智此依證智以第四真智對後三俗智若依趣入智以第三真智對第三俗智方便智有三或四一進趣方便智謂見道前七方便也有則曰方隨宜曰便二施為方便謂善巧波羅蜜多後智妙行二利蒞真入俗曰方自他俱利曰便三習成方便同體諸法巧相習成且真如中具恒沙佛法以智為門以識為門皆攝一切包總有則曰方以少含多曰便四權巧方便實無此事應物權現以三業權化利物有則曰方隨時而濟曰便又有三方便一接下方便下文云無二亦無三除佛方便說即權巧方便此乃有三謂身語意二顯上方便如淨名云無方便慧縛有方便慧解及下文我設是方便等三通障方便下文云何故世尊慇懃稱歎方便等乃至瑜伽十二種方便等今謂此五對真智三四方便不知真實智外別有方便為真實內即方便耶不見融通直爾分釋若望今方便品但有方便而無真實非法華方便立進趣方便不知更令世尊修七方便為復世尊用七方便令人修習若令修習與小乘何別入俗不知復入何俗三乘共地七地已上亦能入俗習成乃是菩薩因行不知復行何波羅蜜為婆沙中前四後二為華嚴攝大乘楞嚴中諸度等耶若無簡擇佛何故於諸經之中所說不同所被不等唯第四權巧可為方便與諸經共未可全用次接下者云無二三乃是破下何名接下況復不是今經之意言顯上者乃引淨名無方便等此亦不然彼經四句二二相對方便與慧更互相須具乃名解闕即名縛乃是上下更互相顯不名顯上言通障者不知以何而為障體若以二乘為障與接下何別若云佛身中障與進趣習成等有何別耶故釋法華方便品者先須與諸大乘經中簡擇同異方可出其正慧之體若不爾者如何得出諸教之上空歎芭蕉具如前難。",
        "translation": "Answer: First, we'll explain that the Sanskrit phoneme beni should be translated as fanglian and the other way around.",
        "source": "X56n0939_001:0614b07_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問此方便品即以方便而為其體為別有體。",
        "translation": "Q: Does this chapter on the skillful means have a separate essence from its essence?",
        "source": "X56n0939_001:0614c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰以後得智為性唯識云說後五波羅蜜皆後得智今從根本智今謂消今法華之文不應引於唯識論釋唯識自通諸部方等以彼方等彈呵二乘挫言敗種論順經旨權云種無後弘經人不曉斯意以申敗種之論用通再活之經先不生者今皆生之安得今已生竟引論滅之故知論中破小破外今經正意會小會外破會天隔通義不成況方便之名不在根本況根本後得並有方便真實二種若根本無方便云何經言如來方便波羅蜜皆已具足若後得無實何故經云今為汝說實既是俱具何可依論但論無圓因非今經意故不可用論云阿陀那識甚深細一切種子如暴流我於凡夫不開演恐彼分別執為我此與世間相常住同耶異耶與為眾生開佛知見與汝等所行是菩薩道等為同異耶不同之事非此可申。",
        "translation": "Answer: Taking subsequently attained wisdom as the nature, Consciousness-only says that the latter five perfections are all subsequently attained wisdom, and now from fundamental wisdom, this is called extinction.",
        "source": "X56n0939_001:0614c24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問品初云從三昧安詳而起為從何等三昧起耶。",
        "translation": "Q: At the beginning of the chapter, it says that it arises from samādhi that's peaceful, but what kind of samādhi does it arise from?",
        "source": "X56n0939_001:0615a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰雖是無量義三昧多是第四禪今謂經文但云入於無量義處三昧何以專趣貶佛之定而云多是第四禪耶若言諸佛成道說法入滅等皆在第四禪者即附傍方便小教作此說耳如何經文自云欲說法華先入無量義定改云入第四禪如華嚴中佛欲說法亦先入第四禪耶。",
        "translation": "Answer: Although it's the samādhi of immeasurable meanings and mostly the fourth meditation, why does the sūtra only say that it's the samādhi of immeasurable meanings? If it says that the buddhas achieve enlightenment, preach the Dharma, enter into extinction, and so forth, they're all in the fourth meditation, which is an adjunct to the lesser teaching of skillful means. How does the sūtra itself say that those who want to preach the Lotus first enter the samādhi of immeasurable meanings and then say they enter the fourth meditation?",
        "source": "X56n0939_001:0615a15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何以獨告舍利弗。",
        "translation": "Q: Why did you tell Śāriputra alone?",
        "source": "X56n0939_001:0615a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰隨深智慧與如來相應故今問身子為未聞法華先相應耶為得聞竟方相應耶今既未聞若已相應何須更申三請之慕豈身子諂附知而強請耶等取相應應告文殊文殊既曾釋彌勒疑復愜眾望故聲聞智與佛永乖又曰一聞即解此乍可爾但未聞未解何名相應又曰根相應非智相似名為相應今謂此乃自壞向義復違論文又言根相應此則須云機感相應則端美矣中下二周時未至故故知相應甚不應理。",
        "translation": "Answer: Following profound wisdom is associated with the Tathāgata. Now, I'd like to ask the bodhisattva whether he's associated with the Lotus before hearing it or whether he's associated with it after hearing it. Since he hasn't heard it yet and if he's associated with it, why does he need to further explain the three requests? Does the bodhisattva flatter himself, attach himself to the knowledge, and forcefully request it? Equally, he should tell Mañjuśrī that Mañjuśrī had previously explained Maitreya's doubts and the expectations of the multitude, so śrāvaka's wisdom and the Buddha were permanently at odds.",
        "source": "X56n0939_001:0615a22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何不告菩薩。",
        "translation": "He asked why he didn't tell the bodhisattva that.",
        "source": "X56n0939_001:0615b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰有五義故今謂不須餘說但直述其旨答曰告不定性兼持所餘所餘者即定性人令不愚法今謂兼即是被不愚即解何名此經不被定性前後相違無可承準。",
        "translation": "A: There are five meanings; therefore, it's not necessary to say anything else but to explain the meaning directly.",
        "source": "X56n0939_001:0615b07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經云其智慧門等其義何耶。",
        "translation": "Q: What does the sūtra mean when it says it's a gate of wisdom and so forth?",
        "source": "X56n0939_001:0615b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰有二智慧及門論云一證甚深即智慧理二阿含言教甚深又曰一切種智者謂有為無為有漏無漏若教若理此即是境一切智智者一切智即根本智重云智者即後得智今以理窮智慧有五攝一切法一智性謂真如今謂真如是境境性非智智性照境寂智照故應別也二智相謂根本後得二智為體今問何以釋相而云體耶應當戒體是戒相耶真如之體亦即相耶亦可四相名四體耶三智伴謂塵沙萬德有為功德今謂智屬了因有為功德乃屬緣因福慧二嚴準此理異四智因者謂能詮教今謂今智在果非教可辦行解相資方乃至果彼弘教者機感相稱時熟果滿方受智名五智境謂有為無為空有真俗今謂此智既唯真如為性復以有為無為為境境與真如為同為異性即真如則不名智若名為智應照真如若但以真如為性不照真如若以真俗有為無為等為境何異二乘不照真如即只但照三界真俗有為有漏即彼伴耶又曰今依實勝慧唯取性相為體故火宅牛車即是智相牛車言行各與一故今謂不知如何賜子真如及以二智今為說教何以不云賜其智因復云聲聞但入初信唯得教故若言行聲聞之人行未辦故故不可以果中二智與諸子等又曰寶所舊有即是智性今謂若云舊有乃是眾生本有覺藏還賜眾生理本之藏何名果地根本等耶。",
        "translation": "Answer: There are two kinds of wisdom and the gate of wisdom as stated in the Treatise: one is the realization of profundity, which is the principle of wisdom, and the other is the profundity of the linguistic and doctrinal teachings of the Āgamas.",
        "source": "X56n0939_001:0615b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問無量知見其智既以真如二智為其性相何謂無量。",
        "translation": "Q. Since the cognition of innumerable knowables sees their cognition and the two cognitions of true reality as their nature and characteristics, what does it mean by innumerable?",
        "source": "X56n0939_001:0615c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰性相伴境如其次第體遍用寬德備法廣如空無限德數無窮終必無盡故曰無量今謂五中何以但取性相為體何釋無量總舉四耶此是智慧之無量無量若四智慧亦四豈至無量而加二耶。",
        "translation": "Answer: The nature and characteristics accompany the objects as their secondary essence, pervasiveness, breadth of virtues, and the breadth of the Dharma, such as the infinity of space and the infinite number of virtues that must ultimately be inexhaustible.",
        "source": "X56n0939_001:0615c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問其智慧門為何義耶。",
        "translation": "Q: What's the meaning of the aspect of wisdom?",
        "source": "X56n0939_001:0615c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論云其智慧門難見難覺難知難解難入釋曰凡夫現量智不知名難見凡夫比量智不知名難覺聖人根本後得智不知名難知初無漏智不知名難解後無漏智不知名難入入者證也今謂經對二乘鈍根菩薩名為難解及以難入難非不入即應入故又對前稱難今非難故何以云佛二智不知耶佛若不知為以何法而教他耶若以小乘無漏智初後不知為難解難入此似可爾於今正入後非不入論以前三釋於後二難見故難解難覺知故難入如何以小二無漏智與佛二智同一釋耶。",
        "translation": "A: The treatise says that the gate of wisdom is difficult to see, difficult to awaken, difficult to know, difficult to understand, and difficult to enter. It also says that the sūtras name the second-vehicle dull-rooted bodhisattva as difficult to understand and difficult to enter because it's difficult and not difficult to enter, which means it should enter.",
        "source": "X56n0939_001:0615c16_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問二乘之人為唯不得此五種智餘亦得耶。",
        "translation": "Q: Does a adherent of the two vehicles only fail to attain these five kinds of cognition and attain the others as well?",
        "source": "X56n0939_001:0616a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰所得解脫三乘同證般若法身相性智慧彼所未得今謂若未得此二餘亦未得既許三德無前無後不縱不橫如何一德許二乘有得一則三種俱成無二則信三咸闕而見經中云佛說一解脫義我等亦得此法到於涅槃即將以為三德之一此深未曉聲聞自序一解脫者序初述時脫非脫故述情謂同而今知別方求異趣自斥昔非若昔是真涅槃應極涅槃若極不應更求故知不可獨有一德是故須曉大小理殊。",
        "translation": "A: The attained liberation of the three vehicles is the same as the realization of the wisdom of the Dharma body, characteristics, and nature that hasn't been attained by others. Now, it's said that if these two haven't been attained, the rest haven't been attained either. Since the three virtues are acknowledged to be without precedent or consequence, not vertical or horizontal, how can one virtue be acknowledged to the two vehicles? If one is attained, then all three kinds will be attained; if not, then faith in the three will be absent, and the scripture says, \"The Buddha teaches the meaning of one liberation, and we have attained this Dharma to reach nirvāṇa, which is to say that it's one of the three virtues.\" This is a profound statement that the śrāvakas don't understand.",
        "source": "X56n0939_001:0616a03_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問無量無礙去其義云何。",
        "translation": "Q: What's the meaning of going without limit and without obstruction?",
        "source": "X56n0939_001:0616a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論中牒經增十八不共五根五力及菩提分今謂準此論文亦是增句解釋經也故不得與經中並列為對而釋如八句五難即其例也如歎聲聞德一向不應用十六句又曰於此釋四無量五門分別列名釋名辨行出體差別一釋名者一切有情感梵天福成如來故今謂若梵天福成如來者一切梵天並已成佛復更何用無緣等耶梵福有漏佛所不許次辨行相乃為三類一無樂者與樂名慈不瞋為體二有苦者掖苦名悲不害為體三有樂者助喜名喜不嫉善根為體又於無苦無樂起於離想令離諸惡名捨今謂既其不語小中大千不知所緣廣狹分齊借使大千只云不瞋不害為體當知只是婆沙有漏無量次出體者四種即體今謂應以所緣為體為依根本為依無漏為依真如體既不同行相自別直爾指四但依世間尚無限齊況能在佛耶次差別者有三一有情作有情想二法緣不見有情唯作法想三無緣離分別心作真如想或法無量緣諸教法今謂應以此三而分行相分行相已乃同有漏又復不判屬於有情法緣無緣皆以法心及真如心緣於有情如何但云法想真如想耶又亦不判諸經今經各於三慈得何等慈及三四同異時耶此經三四何殊餘耶。",
        "translation": "Answer: In the sūtras, the sūtras add eighteen distinctive characteristics to the five faculties, five powers, and factors of enlightenment. Now, this is called an explanation of the sūtras that accords with the text of the sūtras, so it's not to be interpreted in parallel with the sūtras, such as the eight sentences and five difficulties, which are examples.",
        "source": "X56n0939_001:0616a13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰若釋四辯三門分別列名辨相出體法謂能詮名句文聲今謂無簡別於大小宗異義謂所詮真俗今謂不辨二諦大小之殊辭謂諸方音辭今謂不辨方所廣狹不同辯謂七辯今謂七辯亦須明其辯異然是須識修相所依以婆沙中亦釋四故故出體中但指無漏即婆沙文也乃至無畏無礙解等若立義章是須對於諸經辨別顯法華勝徒列章門不明同異若辨同異自廢章門。",
        "translation": "Also, if we explain the four rhetorical approaches, we can discern the names, discern the characteristics, and get out the essence of the teaching, which is to say that there's no simplification in distinguishing between large and small, and the meaning is to say that what's explained is true and secular, which is to say that we don't discern the difference between large and small in the two truths, which is to say that the sounds and words of the directions are different, which is to say that we don't discern the difference between the breadth and narrowness of the directions, which is to say that the seven rhetorical approaches are the same, which is to say that the seven rhetorical approaches must also clarify the differences in their rhetorical approaches.",
        "source": "X56n0939_001:0616b10_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問無量等既爾禪定等云何。",
        "translation": "Q. Since this is the case with immeasurable and so forth, what is meditation and so forth?",
        "source": "X56n0939_001:0616b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰禪謂四靜慮定謂四空定也今謂禪名既通權實大小今應唯實若有禪名必四禪者大論亦云無記化化亦四禪耶若一切定必四空者首楞嚴定亦四空耶大經云能觀心性名為上定地持九禪等豈此經中開小入實所明禪定更指小教有漏等耶。",
        "translation": "Answer: \"Meditation refers to the four meditations, and concentration refers to the four concentrations of emptiness. Now, it's said that since the name of meditation refers to both expedient and real, it should only be real. If the name of meditation must be the four meditations, then the great treatise also says that indeterminate transformation is also the four meditations. If all concentrations must be the four emptinesses, then Śūraṃgama's concentration is also the four emptinesses.",
        "source": "X56n0939_001:0616b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問言辭柔軟悅可眾心其義何耶。",
        "translation": "Q: What does it mean when words are gentle and pleasant to the minds of all people?",
        "source": "X56n0939_001:0616b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰大論云五種音聲從佛口出一甚深如雷二清徹遠聞聞者悅樂三入心敬愛四諦了易解五聽者無厭今謂其事實然須辨所說及所被多少為同大論但釋共教及不共耶。",
        "translation": "Answer: The Mahāprajñāpāramitā says that five kinds of sounds emanate from the Buddha's mouth: 1. profound like thunder, 2. clear and penetrating, distantly heard, pleasing to the listener, 3. endearing to the mind, 4. comprehending and easily understood, and 5. unwearying to the listener. Now, it's true that it's necessary to discern how much of what's said and what's received, whether it's the same as the Mahāprajñāpāramitā but explains the shared teachings and the distinctive aspects.",
        "source": "X56n0939_001:0616b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何名唯佛與佛至諸法實相。",
        "translation": "Q What's the term that goes from only buddhas and buddha to the true characteristics of dharmas?",
        "source": "X56n0939_001:0616c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答論云無量成就說不可盡實相謂如來藏法身之體不改變故佛智具知此實相體今謂前明禪定是佛所得。",
        "translation": "A The treatise says that the inexhaustible accomplishment of teaching the true character of the Dharma body of the Tathāgatagarbha means that the Buddha's wisdom fully knows the true character of that character because it doesn't change.",
        "source": "X56n0939_001:0616c05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依論釋理窮教極豈依向釋能見法身論文既以藏及法身並列故不同於勝鬘別對故知勝鬘尚是方便不可用釋真實之教豈更用於根本禪定釋佛智耶故知下釋如是相等須依藏身以論相等。",
        "translation": "If we rely on the explanation in the treatise that the principle is exhausted and the teaching is complete, how could we rely on the explanation in the direction of seeing the Dharma body? Since the treatise lists the store and the Dharma body together, it's different from the separate explanation in the Śrīmālādevīsiṃhanāda treatise, so we know that the Śrīmādevīsiṃhanāda is still a method and can't be used to explain the true teaching, how could it be used to explain the Buddha's wisdom in terms of fundamental meditation? Therefore, we know that the following explanation of such equality must rely on the store body to explain equality.",
        "source": "X56n0939_001:0616c07_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問既云論以身藏而釋實相其十如相為何似耶。",
        "translation": "Q: Since the treatise explains the true aspect based on the body as a store, what is the resemblance of the ten aspects of thusness?",
        "source": "X56n0939_001:0616c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰若許論釋今亦依論論有四釋初釋云何等法云何法何似法何相法何體法初可等法者謂三乘法云何法者起種種事說何似法者依三種門得清淨故何相法者三種之義一相法故何體法者唯一佛乘無異體故今謂準論釋十如文各通三乘故次句者事謂三乘差別不同次句者三乘教門不同故也次者唯一大義無他義故次句者唯一理體故次番釋者論云何等法者有為無為法以初句對聲聞及六道有為故論云云何法者因緣非因緣故他云轉釋有為無為今謂以初句中緣覺法對六道計非因緣故論云何似法者謂常無常法他云轉釋因緣今謂以初句中菩薩乘對八法界八界皆悉計常及觀無常俱無常故論云何相法者生等三相及不生等三相法他云轉釋常無常今謂總以三乘對六界說論云何體法者謂五陰體非五陰體他云轉釋三相非三相今謂十界皆五陰皆非五陰第三番釋但作三句何似法者無常有為因緣法何相法者謂可見相等法何體法者謂五陰能取可取是苦集體故又五陰者是道諦體今謂初句唯約六道釋次五陰者下只指六道五陰為能觀耳第四番釋論云復有依說何等法者謂名句字身故云何法者依如來說法故今謂並能詮十界教故論云何似法者能教化可化眾生故今謂說前三番以化佛故何相法者依音聲取彼法故今謂可化眾生尋詮得益者故何體法者假名體相故今謂判能詮所詮皆假說故論中自以四番釋者信知此義非容易故一卷論文唯只此文及開示悟入重重釋之驗知兩文是經文宗骨如向是也故知古師釋方稱論文。",
        "translation": "Answer: If we accept the explanation of the treatise, now we also rely on the treatise. There are four explanations of the first explanation, namely, what are the three vehicles, what are the teachings, what are the seeming teachings, what are the characteristics, and what are the essence of the three kinds of teachings.",
        "source": "X56n0939_001:0616c12_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問何名除諸菩薩眾信力堅固者。",
        "translation": "Q: What's the name of this except for the bodhisattvas who have a strong faith?",
        "source": "X56n0939_001:0617a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰初地上得四證淨今謂四證淨義乃是婆沙俱舍之文若取此文則使法華不殊小典焉使一切四十餘秊不得聞耶又云除初地外餘無信者一句與記為何人耶二乘得記為信未信若也未信不應與記若其已信先入初地耶如何迴心始入初信若也所餘是不信者地前向乃不信此經此經為復教何人耶此經若其不教下凡當知不應此界中說。",
        "translation": "A: The first ground attains the fourfold realization of purity. Now, the meaning of the fourfold realization of purity is the text of the Vibhāṣā council. If this text is taken, then the Lotus is not different from the lesser scriptures; how could it be that all the 40 remaining scriptures cannot be heard?",
        "source": "X56n0939_001:0617a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問不退不知未審不退為在何位。",
        "translation": "Q: Does he not know at what level he's not retrogressing before he's examined it?",
        "source": "X56n0939_001:0617b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰七地已前不能知也今謂向者適言初地被除即當信者信故即知如何此中七地方知應當此經被八地去為令眾生其言虗設豈唯八地是所為耶。",
        "translation": "Answer: He said he couldn't know it before the seventh ground. Now, this is called the first ground that's appropriately described as being removed, which means he should believe in it and therefore know how it is. Here, the seventh ground should be known when the sūtra is removed from the eighth ground in order to cause sentient beings to abandon their falsehoods.",
        "source": "X56n0939_001:0617b01_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問爾時舍利弗至難信難解之法其義何耶。",
        "translation": "Q: At that point, what did Śāriputra mean by the teaching that's difficult to believe and difficult to understand?",
        "source": "X56n0939_001:0617b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰準論云何事疑義釋云如來說聲聞解脫與我解脫同同坐解脫牀是故生疑今謂解脫若同豈更生疑已前難又曰大涅槃有其三事摩訶般若解脫法身解脫雖同般若法身即是佛智慧性相果體餘二未得四眾不解所以生疑今謂亦如前難。",
        "translation": "Answer: According to the standard explanation, what is the meaning of doubt? The explanation says that the Tathāgata teaches that the śrāvakas' liberation and my liberation are the same as sitting on the same bed of liberation, which is why doubt arises.",
        "source": "X56n0939_001:0617b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問偈文初云慧日大聖尊久乃說是法為何謂耶。",
        "translation": "Q: At the beginning of the verse, it says, \"Venerable Wisdom Sun has been teaching this Dharma for a long time.",
        "source": "X56n0939_001:0617b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰成道多秊不曾顯說今謂不曾顯說應曾密授密乃眾人不知顯後云未曾說爾前諸經為說何法自釋經來未曾云此與諸經異。",
        "translation": "Answer: After many years of attaining enlightenment and not having explained it explicitly, he said he hadn't explained it explicitly, but the people didn't know it was explicit, and then he said he hadn't explained it before.",
        "source": "X56n0939_001:0617b11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經云皆當驚疑何等驚耶。",
        "translation": "Q: The sūtras say that people should be surprised and have doubts, what kind of surprise?",
        "source": "X56n0939_001:0617b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰準論文中具列五種驚悕釋云總有六人五即五悕一人不攝也定性聲聞為損驚悕不定性聲聞即悔驚怖未得謂得凡夫誑驚怖具煩惱凡夫顛倒驚怖退位菩薩即多事驚怖不退菩薩即五不攝捨權就實忻趣佛位今謂不退不知何為不怖若言八地已上為不退者八地已前一切皆怖瓔珞云初地菩薩念念入法流心心趣解脫得如來一身無量身今聞法華而不免怖為何謂耶如華嚴中初住菩薩亦得法身遍應一切為亦怖耶。",
        "translation": "答曰準論文中具列五種驚悕釋云總有六人五即五悕一人不攝也定性聲聞為損驚悕不定性聲聞即悔驚怖未得謂得凡夫誑驚怖具煩惱凡夫顛倒驚怖退位菩薩即多事驚怖不退菩薩即五不攝捨權就實忻趣佛位今謂不退不知何為不怖若言八地已上為不退者八地已前一切皆怖瓔珞云初地菩薩念念入法流心心趣解脫得如來一身無量身今聞法華而不免怖為何謂耶如華嚴中初住菩薩亦得法身遍應一切為亦怖耶。",
        "source": "X56n0939_001:0617b15_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰佛為不退說此一乘不逗餘器又曰如來為二種人謂多事及悔者今謂既七地已去不能及云唯為不退者說何故更取此二種人并天龍八部及聞一句耶又嚴王龍女適來是畜及在邪見為是退人為不退耶又曰多事即不說有驚怖餘四有驚怖者故論總云驚怖今謂論一一別說何以言總故知論出五怖無所去取應皆得入何所簡耶。",
        "translation": "He also said that the Buddha taught this One Vehicle for the sake of nonretrogression and didn't tease the rest of the body. He also said that the Tathāgata teaches two kinds of people, namely, those who have many affairs and those who repent. Now, since the seventh ground has departed, he can't explain it in terms of clouds and only those who are nonretrogressing.",
        "source": "X56n0939_001:0617b24_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問眾中糟糠至故去譬義如何。",
        "translation": "Q: What's the meaning of the metaphor of going because the chaff in the crowd is so small?",
        "source": "X56n0939_001:0617c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰折摧枝葉扇拂糠粃風驚粃落霜殞貞存今謂言辭甚善與經未合。",
        "translation": "He replied, \"It's breaking down branches and leaves, fanning away chaff, and the wind frightens the chaff down, and frost protects its safety.\" Now, that's considered very good language that doesn't fit the sūtras.",
        "source": "X56n0939_001:0617c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問諸佛唯以一大事因緣其義何耶。",
        "translation": "Q: What does it mean when the buddhas use only one great cause and condition?",
        "source": "X56n0939_001:0617c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰如是說聽佛者總包十方三世大事者事物體事事義道理隨應皆得今謂不說事相但云事物等有益在何今大事者指法華經則他經非大故應思擇。",
        "translation": "A: It's said that listening to the Buddha in general encompasses the three worlds in the ten directions.",
        "source": "X56n0939_001:0617c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問開等四句其義何耶。",
        "translation": "Q: What do the four sentences of opening and so forth mean?",
        "source": "X56n0939_001:0617c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論釋開云除一切智智更無餘事釋曰重言智者謂根本後得又曰一切智是佛根本智重云智智者是後得此二智是用故有空如來藏不空如來藏又大經云未得菩提時一切善不善皆名佛性淨名七識貪欲瞋癡十不善等為如來種如是等非一因緣今謂既引此文如何初地方名信力七地菩薩猶退不知又曰有四種藏一能含藏謂賴耶識如庫藏等二能生德藏謂報身種子如穀種等三能覆藏謂煩惱等如土覆物四能顯德藏謂法佛性如金性等今問此四藏體同耶別耶若言別者金性是譬還指煩惱覆處有性報身種子何處成立若無始大不名種子若有始立則必有終若有始終而為種子還感始終而為果報是則此報因果無常又此種子在煩惱中耶煩惱外耶法身既以煩惱為能覆法身是煩惱家之所覆則法身煩惱天然二物若在煩惱時不能除惑誰有智慧來治此惑顯此身耶若也昔能與惑共住後時何能常離於惑賴耶乃是報識之上假立二名假名為藏以為能藏信知所藏皆無實法又此所藏與煩惱等為同為異耶異則非惑豈以報識假名之藏能含非惑出世法耶若其同者只是煩惱在報之時假立其相又曰所知障斷證佛報身菩提圓滿煩惱障斷證佛法身涅槃圓滿諸佛出世欲令眾生斷所知障及所發業并所得果圓證菩提開佛知見今謂二障若斷二身亦亡只緣二乘自斷惑故斥名斷法身對惑報身種子已如向問次引論釋示云三乘法身平等明佛性法身無差別故今謂論云三乘平等何以簡於沒定性耶論云悟者令悟真實處故今謂亦令三乘悟真實處何以苦云永不能發此三何曾云是果耶論云入者入初地故今問前云七地不知何以初地能入。",
        "translation": "Answer: The explanation of the opening statement of the treatise says that besides omniscience, there's nothing else. The explanation says that the redundant wisdom refers to the fundamental and subsequently attained wisdom of the buddhas, and the redundant wisdom says that omniscience is the fundamental wisdom of the buddhas, and the wisdom of the two kinds of wisdom is subsequently attained.",
        "source": "X56n0939_001:0617c13_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "又曰論中委解此方便品餘但總解大意而已故知若解此品已解一部今謂若爾何以因果不同境行差別權實立異有無乖角乃以八品明境安樂行去行前文在因壽量去果藥艸存權爾前取實一乘在前安樂去無若其解境即解因等何須下文更說餘耶若也須明下文行等當知解此未解於彼故知解此即解於彼言甚分明但是不曉方便義足。",
        "translation": "It also says that the rest of the explanation in the treatise is only a general explanation of the general idea. Therefore, we know that if we understand this chapter, we've already understood one part. Now, what is the meaning of \"if\"? Why is it that the cause and effect are different, the condition and practice are different, the expedient and real are established differently, and there are no discrepancies?",
        "source": "X56n0939_001:0618a18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰大經云大事者所謂佛性今謂應當為佛性故出現於世何以却簡滅定性耶。",
        "translation": "Also, the great sūtra says that the great matter is called the buddha-nature. Now, it means that it should appear in the world because of the buddha-nature, but why is it simply a qualitative nature that ceases?",
        "source": "X56n0939_001:0618b01_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰大經云佛性者名為一乘即是開貧女之寶藏證示悟入等及祕密藏亦復如是今謂佛性一乘眾生本有若簡定性應非有情情有必有無情乃無徒引圓經用證偏謬。",
        "translation": "It also says that the great sūtra says that the buddha-nature is called the One Vehicle, which is the jeweled store that opens up the poor woman's mind, proves that she's awakened and entered, and so on, and the secret store is likewise.",
        "source": "X56n0939_001:0618b03_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰如圓伊三點開等亦同今謂若解脫已在於聲聞一點離張而屬小滅二障以趣果何以煩惱前袪除無知以在當何以法身後證若煩惱障斷不證法身何須別對又煩惱障若障法身二乘斷盡應當已證如是進退違妨難量故知準向所引諸文開等豈分因果藏等安立假名。",
        "translation": "It also means that if liberation had been attained by the śrāvakas at one point free from tension and belonging to the lesser extinction of the two hindrances in order to reach fruition, why would it be necessary to eliminate afflictive hindrances and remove ignorance in order to realize the Dharma body in the future? If the afflictive hindrances are eliminated and the Dharma body isn't realized, why would there be any need to separately oppose them? If the afflictive hindrances obstruct the Dharma body, the two vehicles should have ended them and realized them.",
        "source": "X56n0939_001:0618b06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云西方伊字如倒品字今謂天目應當二目在上若準梵書短聲呼伊為於冀反則一點在下若長聲呼則為於夷反則一點在上計近三藏諳梵體不知何事云如倒品又自釋云短聲一點在下長聲一點在上自古讀經無有此字短聲呼者何須乃云如倒品耶故古有釋皆如艸下則天目義同。",
        "translation": "It also says that the western letter i is like the inverted article, which is now called the second eye of the gods should be on top.",
        "source": "X56n0939_001:0618b12_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云得法身則二障滅二死盡今謂二死不出界內二障不異婆沙如何得常住法身又復應云二死盡法身滿豈可先得法身死障後破。",
        "translation": "It also says that when the Dharma body is attained, the two hindrances cease and the two hindrances end. Now, it's said that the two hindrances of death not being outside the realm and the two hindrances not being different from the Vibhāṣā council, how can the eternally abiding Dharma body be attained? Again, it should be said that the two hindrances of death ending and the Dharma body being complete, how can the Dharma body be attained first and the hindrances of death broken later?",
        "source": "X56n0939_001:0618b17_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰擇滅即是解脫今謂大乘圓常用智融妙故華嚴般若宗極之談必無擇滅斷惑之說。",
        "translation": "It also says that selection and extinction is liberation. Now, it's called the marvelous integration of the great vehicle's common wisdom of perfect unity, so the Huayan Prajñāpāramitā school's discussion of the ultimate necessity is not the explanation of selection and extinction and the elimination of afflictions.",
        "source": "X56n0939_001:0618b20_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云雜集中擇滅諦有三能滅所滅滅性即是三大般若在上為能證道如額上目法身解脫如下兩目即是所證今問般若無所至果應常至果不名能證如何能在於上名為般若餘二在下仍立別名上下前後既乖因果能所永別大品云菩薩常觀涅槃行道故知般若能照涅槃所觀涅槃具三能觀亦爾能所一合彼彼互融如是方為法華妙境境妙須智以智為門入門見理須行行即知見波羅蜜也入位證果起用益他能所一切具足如是方名方便品耳故解方便即解後品。",
        "translation": "It's also said that there are three concentrations of the noble truth of extinction, which are able to extinguish and the nature of extinction, which are the three elements of prajñā that are able to actualize the path, such as the forehead, the upper eye, the Dharma body, and liberation, and the following two eyes, which are what's actualized. The question is, \"How can prajñā, which has no object to attain the fruit, be constant to attain the fruit and not be called able to actualize?\" The other two are still underneath, and they're still designated separately as prajñā, and the prior and subsequent are both contradictory in terms of cause and effect.",
        "source": "X56n0939_001:0618b22_9",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問嘗聞人問無學果位亦居分段應在門中如小菩薩應非出宅。",
        "translation": "Q. Have people heard asked whether the stage of the fruit of post-learners also resides in a segmented state, such as a junior bodhisattva who doesn't leave home?",
        "source": "X56n0939_001:0618c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰果位二乘從因名出諸小菩薩惑未斷故故不名出今謂會二歸此不出菩薩為何益耶。",
        "translation": "Answer: The two vehicles in the fruit level are called out from the cause, and the lesser bodhisattvas haven't cut off their mental disturbances, so they aren't called out.",
        "source": "X56n0939_001:0618c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰問何以二子趣於羊鹿故稱出宅大子牛車未名出宅答二二乘惑盡故出宅菩薩初劫煩惱猶行如未出宅今謂婆沙菩薩三祇百劫惑尚猶行豈況初祇具同凡品會二歸此何足為奇故知全迷瓔珞華嚴菩薩位行。",
        "translation": "Again, he asked why the two sons are destined for the lamb and deer, so they're called out of the house and the great sons are not called out of the house. Answer: The two sons' mental disturbances have ended, so they're out of the house.",
        "source": "X56n0939_001:0618c11_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰七地分段盡此一生亦名出宅二乘同故已前即非猶多生故如有學類故出宅已方乃上車今謂七地同於二乘乃是大品三乘共位何得先引三祇後援共地兩無分判故二並非若以得有餘果名為上車有餘未出分段何以出宅索車菩薩三十四心爾前猶來未上菩提樹下已號極尊佛更索車都無是理。",
        "translation": "It also means that the seventh ground is the same as the two vehicles in that this lifetime is also called the emancipation, which is not the same as the previous one, so if there are trainees, then the emancipation is only the upper chariot after the common level of the three vehicles in the great category, how could it be that the first leads to the third incalculable and the second supports the common level? Therefore, the two are not the same.",
        "source": "X56n0939_001:0618c15_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問一乘之義正是經宗云何分別。",
        "translation": "Q: What is the precise meaning of the One Vehicle that the sūtras discern?",
        "source": "X56n0939_001:0618c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答五門分別一出體性二釋名三明說意四彰差別五問答料簡初體性者略為三一總含體謂無漏若種若現有為無為若因若果根本方便能成佛德皆名一乘一乘者即大乘也亦名無上乘今謂若別論宗體理合甄分通而言之應兼能所自他因果豈以能成獨立乘耶況因果等不判深淺又通種現大成混和以種現共論其理天隔若其別說種屬凡愚若凡亦名乘事應未可。",
        "translation": "Answer: The fivefold distinction is one that gives the essence, two that explains the name, three that explains the meaning, four that shows the distinction, and five that answers the question.",
        "source": "X56n0939_001:0618c22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰中邊分別論云無上乘有三品一正行體謂十度二所緣謂十二緣三修證今謂若準此論不取種也雖不取種未了所緣既修十度以為行相故所緣如何取異緣覺故依古釋別有差分二隨勝體有六一攝事歸理如勝鬘等多以法身真理法性為一乘二攬餘歸智體亦以真智為一乘如上文云方便知見不退不知等三隱劣隨勝體下文云諸佛唯以大事故出現於世四二運廣用體唯以因智名為一乘如火宅中與諸菩薩及聲聞眾乘此寶乘直至道場五勝出分段體通取因果出分段死所有理性名一乘體六引攝殊勝體以詮旨一乘教門名一乘體今謂隨六種勝體義不成如人名位事業功用可多可異若論其體不可分張然六中初理依希可爾言依希者事理之名通涉大小直爾言之不成一乘若攬餘歸智智不名體理智既別故簡是非從勝乃是佛出世意不名乘體廣用二運亦非車體自運容可從因運他理須在果況自利利物皆須因果不獨用故故至道場道場是果也勝出分段者應云二死不獨分段況因果非出教體永乖故知雖云有體而實無體並是莊挍但可以當體為名耳三真實體者根本大乘理教行果及能入大乘方便四法皆名一乘咸能運載故品初云其智慧門等本論云阿含言教今謂真實之中理教行果與隨事中理等何別第一是理豈可不攝事耶第二是智智即是行第三即是四法因緣第四是因因亦屬行第五亦行行通因果又屬此果第六在教徒分四異粟柄禾莖況復四法共釋一乘與前法華對無量義自相違也。",
        "translation": "Also, according to the Discourse on Discrimination in the Middle, there are three categories of the unsurpassed vehicle: the first is the correct practice body, which is the ten perfections, the second is the twelve conditions, and the third is cultivation and realization. Now, if we refer to this discourse, we don't take the seeds, but even though we don't take the seeds, we haven't understood the conditions, and since we cultivate the ten perfections as a way to practice, how are the conditions to take different conditions for awakening? Therefore, according to ancient interpretations, there are six distinctive aspects that follow the ultimate body.",
        "source": "X56n0939_001:0619a06_2",
        "is_bad_quality": true
    },
    {
        "source_sentence": "又云此真實體五門不同一詮旨謂理教今謂若以能詮為教所詮為理故不應以二共為體二因果三福智四覺寂五二利今謂因果二利亦與前同福智在因覺寂有果何須更以四法而為真實變化五門之名望前都無別義又曰三六如所引之法身即是乘體佛性含三乘語通無足以顯一乘之體今謂皆是乘果及具度耳。",
        "translation": "It also says that the five aspects of this true entity are different from one that explains the meaning, which is the principle and the teaching. Now, it means that if we take the explanation as the teaching and the explanation as the principle, we shouldn't take the two together as the essence, the two causes and effects, the three merits and wisdom, the four awarenesses and quiescence, and the five two benefits.",
        "source": "X56n0939_001:0619b08_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰釋名者乘運載今謂運至何處所載者何從何處來有何資具互為大小車主是誰駕者幾人經歷幾處(云云)。",
        "translation": "It's also said that the explanation of the name is that the vehicle carries the carriage, which is now referred to as the place to which it's carried, and what's contained therein, from where it comes, what are the mutual attributes, and what are the size of the vehicle owner and who drives it?",
        "source": "X56n0939_001:0619b15_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曾聞人問因行名乘果運既息何得名乘。",
        "translation": "Q: Have you ever heard someone ask how the causal activity is called the vehicle when the fruition of that activity has stopped?",
        "source": "X56n0939_001:0619b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰五義名乘一者因通二運果廣運他今謂此正答所問二者能體通二運能體並名乘果中體有能非無亦乘攝今謂此不答所問何須列之本問因果不應更以有無足之三者二乘唯自運小尚得名乘況佛廣運他何理非乘攝今謂此亦不答所聞本問因果所得之名徒將大小以相對又下二句其言不成應云況佛廣利他豈得非乘攝四者因中理智能雙運二用勝故得名乘果中理智因修成因乘種類亦乘攝今謂種類之名非正收故知不如從初答五者因中二運常增進作用勝故得名乘果中自運窮未來令他增進得乘攝。",
        "translation": "A: There are five meanings to the name vehicle. First, the cause communicates with the two transports, and the result carries extensively to others. Now, this is said to be the correct answer to the question. Second, the subject communicates with the two transports, and the subject communicates with the name vehicle.",
        "source": "X56n0939_001:0619b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云初四隨他不正答後一隨自正義答今謂初一乃可正義答後四相從因起答。",
        "translation": "Also, the first four follow other things incorrectly, and the last one follows its own correct meaning.",
        "source": "X56n0939_001:0619c05_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何名為一。",
        "translation": "What's called one?",
        "source": "X56n0939_001:0619c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰有三義名一一者簡別故名一二者破別故名一三者會別故名一言簡別者昔三今一一實二權至佛極界方名為一非簡別三論云無二乘者無二涅槃體又云我設是方便令得入佛慧。",
        "translation": "Answer: There are three meanings to the name one. one is simply distinguished and therefore is called one. two are distinguished and therefore are called one. three are simply distinguished because in the past three, now one is really two rights up to the Buddha's ultimate state, which is then called one and not simply distinguished.",
        "source": "X56n0939_001:0619c07_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云如火宅之許以三車出宅門已但與牛車。",
        "translation": "It also says, \"Suppose a burning house permits the use of three carts to leave the house and then only give a bullock cart.",
        "source": "X56n0939_001:0619c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云二十秊中常令除糞今謂自昔至今二乘難破逐難為語如向所引若以此文即定法華一部文者何不引序中諸求三乘人若有疑悔者佛當為除斷令盡無有餘菩薩聞是法疑網皆已除未聞未解不名善行菩薩之道願賜我等三種寶車許三索三佛以方便力示以三乘教三皆方便皆權皆索故知白牛非三中一。",
        "translation": "It also says that in the twenty harvest periods, the bullock cart is always allowed to remove the dung. Now, it means that since ancient times, the two vehicles have been difficult to refute and difficult to speak for, as quoted above. If this text is the definitive Dharma Flower school text, why isn't it quoted in the introduction as saying that if people seeking the three vehicles have doubts and repentance, the Buddha will remove them so that they'll end them.",
        "source": "X56n0939_001:0619c11_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰一理簡教二果簡因今謂若以一理簡於三教簡二歸於何處菩薩四階位耶共地位耶五十位耶故佛度五人名六羅漢三乘同坐所證無殊簡因因本不殊至果果無別簡教教本不同但理無異趣故證法皆同。",
        "translation": "Also, if we take the one principle and shorten the teaching, the two fruits and shorten the cause, now we say that if we take the one principle and shorten the three teachings and shorten the two, where do the bodhisattvas' four stages, or common stages, or fifty stages return to? Therefore, the Buddha has saved five people named the six arhats, and there's no difference between what the three vehicles realize while sitting in the same seat.",
        "source": "X56n0939_001:0619c18_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云三乘疑佛為除斷者身子除疑耳經文三乘竝除釋義但歸身子違經背義當奈之何雖引論文但云無二但不見論釋開等中三乘同得若但為二不應云三淨名菩薩尚自被彈於法華中豈得不會彈本在會教旨可知若不會者婆沙四階大品共地瓔珞賢聖華嚴初住而此四者所證法身同耶別耶。",
        "translation": "Also, the scriptures say that the three vehicles are all removed by the Buddha in order to remove doubt, but the body removes doubt. Although the scriptures cite the treatises, they only say there are no two, but they don't see the treatises, interpretations, and so forth in which the three vehicles are equally attained.",
        "source": "X56n0939_001:0619c22_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰勘梵本云無第二第三此自與前難會義同豈能合於願賜我等三種寶車亦云願賜我等第二第三耶次破二者準望可知。",
        "translation": "It also says that the Sanskrit text says there's no second or third one, so how could it be the same as the previous meaning of the disputed assembly and fit in with the vow to give us the three kinds of precious carts and the vow to give us the second or third one?",
        "source": "X56n0939_001:0620a04_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又釋會云有四義故一者會教如無垢稱一音說法今謂彼經若有一音即是彼經已會何須更至法華方會若彼已會何故彼經仍云種敗二者會理寶性論云三獸度河河性無差得水淺深今謂釋法華理應引今教今教無文方求外部況部有會方乃求之求於本無何名求耶若諸經無文何論獨有論無經有理乃可然論有經無終無此理得水名同應無三獸獸三仍別會義不成若以寶性釋法華則二乘至於法華猶住聲聞緣覺。",
        "translation": "The explanation of the assembly also says that there are four meanings: first, it's the assembly teaching like the one sound teaching of the name of Vimalakīrti. Now, if that sūtra has one sound, that means it's already been assembled by that sūtra.",
        "source": "X56n0939_001:0620a06_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云下文高原得水今謂此與寶性同耶別耶寶性尚住二乘此經同記作佛況高原對水以昔異今不得引證會教文也三會行者鶖子云為是究竟法為是所行道今謂幸有汝等所行之文如何引昔迴遑之教以證今經會行語。",
        "translation": "It also says below that the plateau attains water now that it's the same as the nature of the jewel, or is it different? The nature of the jewel still abides in the two vehicles, and this sūtra is the same as the record of making buddhas, so the plateau is different from the water in the past, and now the text of the teaching cannot be cited to confirm the assembly.",
        "source": "X56n0939_001:0620a15_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰我設是方便令得入佛慧今謂亦不應引佛施權智用證二乘會行之文四會乘者下經文云為求牛車出於火宅今謂若二乘至此應求行果何以證乘況出宅之牛車非入大之寶乘若出宅車是等賜車已乘出宅何須更求則昔教已會何須至今。",
        "translation": "He also said, \"I have set up this method to make it possible to enter the Buddha's wisdom.\" Now, he said, \"I shouldn't have cited the Buddha's authoritative wisdom to confirm the text of the two vehicles' assembly practices.\" 4.",
        "source": "X56n0939_001:0620a19_7",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云雖依諸教而法華中顯會教理密會行果今謂若顯密二文同在今教今教之中何處是顯何文是密聲聞於此專求行果應行果是顯聞教得記二顯不虗夫云密者唯自己知而眾不知或眾皆知而己不知於此何人不知得記而以四法分顯密耶若準前以無量義經而望法華則云法華正明行果則應行果名之為顯何以教理却為顯耶若是密者法華仍是覆相明一教仍在權何名入實若以微密為密教者此經教理非麤非權故皆不可。",
        "translation": "Although it relies on various teachings, the Lotus clearly assembles the doctrine and the esoteric assembles the result of practice. Now, if the two texts, the manifest and the esoteric, are both in the present teaching, where is the manifest and which text is the esoteric? śrāvakas who focus on the result of practice and the result of response to practice here are the manifest hearers who have learned the teaching and have obtained assurance that the two are not manifest.",
        "source": "X56n0939_001:0620a24_8",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問若真實方便相對今經此二何者是耶。",
        "translation": "Q: If true and real are relative, which of these two is this sūtra?",
        "source": "X56n0939_001:0620b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此經正以一乘因果以為真體教為方便今問若以實教對實理等而為此二則應教為行因行為證因若棄行唯教有言無行何可師之若以方便教而真實之方便彌不可也況因果二法不名一體具如前問。",
        "translation": "Answer: This sūtra uses the One Vehicle principle of cause and effect as the true essence of the teaching as the teaching of method. If we take the true teaching to be the true principle and these two are the cause, then the teaching should be the practice, and the cause should be the realization.",
        "source": "X56n0939_001:0620b10_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又云今此小義雖未動於智海如愚所知頗亦絕於今古博識深智當自詳之今謂自媒自衒士女惡聞然此法華一乘為主攢一代教總括諸乘大事因緣於茲適遂降為小義寧免自傷如以祖考為後生以大王為小吏有耳識者莫不寒心唯佛與佛乃能究盡豈有愚見能絕古今衡岳台崖雙弘禪慧靈山親稟妙悟斯宗尚云佛法不思議唯教相難解二乘及菩薩尚所不能測何況諸凡夫而欲判此事譬如生盲人分別日輪相欲判虗空界一切諸色像而言了達者畢竟無是事。",
        "translation": "It also says that even though this minor meaning hasn't yet moved the ocean of wisdom, such as the ignorant know-it-all, it's still cut off from the knowledge of the present and the learned and profound wisdom of the past. Now, it's called self-promotion, self-promotion, and the bad hearing of women and men, but this is the main teaching of the Lotus One Vehicle that encompasses the great causes and conditions of the vehicles.",
        "source": "X56n0939_001:0620b14_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問說此一乘為有義意。",
        "translation": "Q: Does this teaching of the One Vehicle have a meaning?",
        "source": "X56n0939_001:0620c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰凡有十意一為不定性二乘今問何不辨於此土他土我於餘國作佛等文彼土所說非法華耶若非法華何以經云得聞是經二任持所餘不定種性謂六住菩薩退依二乘涅槃故云菩薩聞是法疑網皆已除今謂向不定性二乘即此六住等退者耶況退大已依小涅槃即名二乘何以復引證菩薩耶若此屬退大尚應名決定況退大者不必皆從六住退也經稱六者據其退位耳三者法等故行乘雖異真如無差今問若理性真如名無差者三途四趣皆悉無差豈三乘耶若已得真如名無差者地前菩薩尚自未得何關二乘又無差者差定性不若差定性則非無差又定性差為待性定方乃差之為未定前即便差耶若未定差者法界眾生幾許應當入定性耶故不可也四無我等我既無實故說一乘今問為語眾生身中之我本無說一乘耶為初果去見我已無說一乘耶若眾生身中我本無為說一乘者應當一切俱得何以乃有餘不聞者何故乃云八地方堪若初果人應當昔教已入一乘何須至今若言真我不應無實若理性我難亦同前五解脫同故三乘同得脫煩惱障今謂解脫已如前難脫煩惱障昔教已脫何以不入若被八地須脫二障全未脫者可不聞耶彈指等善無煩惱耶六性不同故不定種性有差別故聲聞身中具有聲聞及佛種性今問一切眾生並有佛性皆是所為何獨聲聞若獨聲聞龍天八部四眾五道非聲聞者應非所為七佛於有情得同體意樂今問昔教何曾不說同體仍棄定性何名同耶若依此意何須立前差別意耶同體亦齊法等何別八二乘於佛得自體意樂今問一切有情誰不於佛得自體耶是盲者過日用不知與前同體法等何殊若指此經豈獨二乘耶九為化故諸教所明多文云佛從定起得授記別今問法華已前何教中明身子得記八部四眾別得記同壽量何曾因定起耶十究竟由過此外無別勝乘依理究竟最為殊勝依論但與二乘人也今問若無勝者何以獨為聲聞而不為菩薩諸經多為菩薩此教唯為聲聞聲聞不勝菩薩則此教劣於他教若唯為二人何故開等三乘通為及至正釋於性相體等四番之中咸為三乘豈執一文而生別見又曰法華論中無此十義今謂但是章疏假構之言何須自樹以為形斥乃出天親智不如己若觀論文無有一言而過分者。",
        "translation": "Answer: There are ten meanings. 1. it's the unqualified two vehicles. Now, why doesn't the scripture discern that in this land and another land I made buddhas in other lands and other texts, what's taught in that land is not a flower? If it's not a flower, then why does the scripture say you can hear it? 2. it's the remaining indeterminate nature that the bodhisattvas in the sixth abode have retired based on the two vehicles' nirvāṇa, so it's said that the bodhisattvas in the unqualified two vehicles are those who have retired from these six abodes.",
        "source": "X56n0939_001:0620c01_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問此法華經與諸經何別。",
        "translation": "Q: How is this Lotus Sutra different from the other scriptures?",
        "source": "X56n0939_001:0621a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此之一乘與勝鬘涅槃何殊此通理智彼唯佛性今問理與佛性有何差別又涅槃云亦名般若等五又慧聖行豈非智耶若以所通而為通者此經亦是理為所通亦由不知名異體同若準前意則法華唯為行果果為所通復云法華具足四法四法中理即是所通又云此唯攝入彼通出生今問此唯攝入何以藥艸喻品通出生耶彼通出生何以涅槃一切眾生悉一佛乘故金沙大河直入西海得道女人必無諂等耶若勝鬘經與涅槃經同出生者何以後引勝鬘四乘用同此經藥艸喻品況勝鬘斥小何曾出生一代教中唯無量義明於出生而不引之乃引他經經意各異又云此唯有性彼通無性今謂此經亦通無性諸經敗種至此咸生涅槃唯有一切眾生皆有性故故涅槃中八六四二後能發心故知不許存於無性世人信言而不思理故使失處非一途也又曰此經唯不定性彼通定性今謂唯言亦與彼國為妨若言彼經通定性者涅槃經中十仙外道雖取小果悉知常住但見小果之言謂通無性不見鎮常之說咸趣一乘又云此多說教理彼多說行果今謂四法相違數不可知若對無量義即云此經正說唯為行果今對涅槃即云此經多說理教前文又云密說行果而今此中多說理教問此多說何如無量義中亦多說耶又云無量義中已說一乘今問何不記小。",
        "translation": "Answer: How is this one-vehicle scripture different from Śrīmālā's Nirvana, which teaches only the principle and wisdom, and which teaches only the buddha-nature? What's the difference between principle and buddha-nature? If the scripture teaches what's common, then this scripture also teaches principle as common, and since it's not known to be different, the essence is the same.",
        "source": "X56n0939_001:0621a18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經從舍利弗至法亦如是其義何耶。",
        "translation": "Q: What does the sūtra mean from Śāriputra to Dharma as well?",
        "source": "X56n0939_001:0621b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰釋迦依一切佛先權後實今問若一切佛皆先權後實者自法華前應一切權若一切權淨名般若華嚴如何若云一切香積如來及無量壽等皆先權耶身子本願故說三乘豈必先權寂滅道場初成即說亦先權耶又於一佛乘分別說三以方便力示三乘教三皆方便豈可亦謂梵本錯耶又云十方世界法式皆同如華嚴中十方說者皆四菩薩大般若中十方說者請者皆同說楞嚴時十方世界俱說楞嚴如是等經在法華前皆悉十方並先權耶又云於論指前文云如向說種種因緣者謂三乘法彼三乘法唯有名字章句言說非有實義然彼實義不可說故今問準論豈非三皆方便未顯真實真實於三不可說故故知天親了了明見後弘教者徒自疲勞。",
        "translation": "Answer: The Śākyamuni relies on all buddhas to precede the provisional and then the real. Now, he asks if all buddhas precede the provisional and then the real, then he should precede all the provisional since before the Lotus, and if all the provisional are purely called Prajñāparinirvāṇa and Huayan, then how is it that all fragrant tathāgatas and those of immeasurable life precede the provisional? Is it because of the body's original vow that the three vehicles are explained, that they must precede the provisional, that the first accomplishment of the path to extinction is explained, and that they precede the provisional?",
        "source": "X56n0939_001:0621b18_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問論文以此經唯譬蓮華更有餘譬不。",
        "translation": "Q: Does the treatise say that this sūtra only describes the lotus and has no other descriptions?",
        "source": "X56n0939_001:0621c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論云依牛有乳乃至醍醐醍醐為第一小乘如乳大乘如醍醐今經如醍醐今謂論文既云乃至故知中間越於三味驗知應須具依涅槃用五味譬方了今經當第五時具如古德所用者是何故苦依深密而云此經當第三時而不肎依論用五味若以深密為最後教判一切教但三時者深密為是法華涅槃前耶後耶華嚴自云初成時說故知乃是最初成道先說之教判與法華深密同時驗知不了深密與法華涅槃時味前後凡云時者為判前後深密若在法華之後最後正可判於前經故勝義生未知深密之後應說般若法華且隨所見判為第三故第三時正與古德判教意同故一家判教或時亦以鹿苑之前除華嚴教方等亦成第三時故亦以法華當於第五醍醐教也其義明矣順論順經與古人合因何乃云凡夫如牛聲聞如乳支佛如酪小菩薩如生酥大菩薩如熟酥佛如醍醐論云小乘如乳何須改之云凡夫耶若大小乘譬於教者五味應須初從牛出如何檀改以乳譬牛若準論文順古人釋若以五味譬漸教者須言人天為乳。",
        "translation": "A: The treatise says that the cow has milk and even Daigo Daigo is the first lesser vehicle to be like milk, and the greater vehicle to be like Daigo. The present sūtra is like Daigo. Now, the treatise says that it's even, so you know that the middle is beyond the three flavors.",
        "source": "X56n0939_001:0621c08_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乳教未入五時之限還以小乘方對初教即解深密正當第三不違子見復依論文豈不善耶。",
        "translation": "If the milk teaching doesn't reach the limit of the five time periods, then wouldn't it be good to use the lesser vehicle approach to the first teaching, which is to understand the profound and accurate third view that's not contradictory to the son's view and to rely on the text of the treatise?",
        "source": "X56n0939_001:0622a03_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問一切種智是何乘。",
        "translation": "He asked what vehicle is the all-inclusive wisdom.",
        "source": "X56n0939_001:0622a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰一切種智即一佛乘今問判種智許是佛乘論釋種種因緣既云三乘當知聞法改觀方為佛乘若菩薩先是佛乘豈有佛乘更為佛乘若言菩薩是佛因者論何故云非有實義。",
        "translation": "Answer: \"All-inclusive cognition is the one Buddha vehicle. Now, the question is, is it possible that inferring that all-inclusive cognition is the Buddha vehicle?\" Since the explanation of the various causes and conditions in the treatise says \"three vehicles,\" you should know that hearing the teaching and contemplating it is only the Buddha vehicle if the bodhisattva is first the Buddha vehicle, then how could there be a Buddha vehicle that's not the Buddha vehicle?",
        "source": "X56n0939_001:0622a05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經云從舍利弗至何況有三為何義耶。",
        "translation": "Q: What does the sūtra mean when it says there are three from Śāriputra to how many?",
        "source": "X56n0939_001:0622a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此遮也尚無第二緣覺第三聲聞由此經云羊車鹿車為求牛車出於火宅故但破二不云破牛今謂文列三乘各有所為各自出宅文未曾云羊鹿求牛索辭只云願賜我等三種寶車得三車後方云長者見子得出火宅自惟財富無量方乃等與大車當知三車出宅並未得寶車若前文中已是二乘求於牛車則是二乘重求出宅出宅即是已得大車何須長者更等賜耶故出宅大車非等賜車以出宅車本為治濁況三祇共地地及小信等如是菩薩濁猶未除三十四心除五濁耳故經云初以三車誘引諸子何以不云但二車。",
        "translation": "Answer: This is the scripture that says there's no second pratyekabuddha or third śrāvaka yet, because the scripture says that the goat cart and the deer cart seek the ox cart to get out of the burning house, it only refutes the two and doesn't say that it refutes the ox. The scripture says that each of the three vehicles has an individual purpose and each gets out of the house, but it never says that the goat and deer seek the ox cart and asks for an excuse, it only says that they want to give us three kinds of precious chariots.",
        "source": "X56n0939_001:0622a09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問五濁何義。",
        "translation": "Q: What do the five turbidities mean?",
        "source": "X56n0939_001:0622a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰以五門分別第一釋名者濁以滓濁為義五種漸增漸惡故佛出世若五漸好佛不出世次出體者甚廣不能具述三明相者尼乾經中立十二濁皆云示現謂劫時眾生煩惱命三乘差別不淨國土難化眾生種種煩惱外道邪亂魔及魔業皆是諸佛為利眾生非要故略。",
        "translation": "A: The first explanation of the name is based on the five aspects of discriminating between the turbid and the meanings of the five progressively increasing and gradually becoming more and more evil so the Buddha comes into the world if the five progressively better buddhas don't come into the world and the next one comes out of the world with a body that's too vast to describe in detail the three luminous forms.",
        "source": "X56n0939_001:0622a21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問有他人有云減劫時佛出增劫時輪王出何故儴佉與彌勒同世又佛不出家亦為輪王日月燈明八子皆王四天下耶。",
        "translation": "Q: Are there others who say that when the Buddha exits during the decreasing eon and the wheel-turning king exits during the increasing eon, why is it that Bhaiṣajyaguru and Maitreya are from the same era and the Buddha doesn't leave home and also becomes the wheel-turning king, the sun, moon, lamps, and eight sons, all of whom are kings of the four worlds?",
        "source": "X56n0939_001:0622b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰儴佉增劫佛壽長故故得值佛佛不出家堪為輪王非是定作八子亦爾。",
        "translation": "Answer: Because the Buddha's life span is long, he attains the status of wheel-turning king because he's not a renunciant.",
        "source": "X56n0939_001:0622b05_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又曰金輪定增劫餘三則不定故無憂王佛滅度後百秊即出事義可知。",
        "translation": "It's also said that the golden wheel is set for an additional eon, and the other three are unsettled, so King Wuzu's meaning can be understood from the one hundred harvest periods after Buddha's passing.",
        "source": "X56n0939_001:0622b06_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經云於一佛乘分別說三者何耶。",
        "translation": "Q: What does the sūtra say about discriminating three in one Buddha vehicle?",
        "source": "X56n0939_001:0622b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答於一大乘分別說三今問何不云分別說二亦經略耶應但第三耶況第三非小獨在菩薩。",
        "translation": "A: In the One Great Vehicle, they discern three. Now, why doesn't the sūtra say that discerning two is also abbreviated? Should it only be the third, since the third is not minor and solely for bodhisattvas?",
        "source": "X56n0939_001:0622b09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經云舍利弗至辟支佛其義何耶。",
        "translation": "Q: What does the sūtra mean when it says Śāriputra to pratyekabuddha?",
        "source": "X56n0939_001:0622b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此釋疑也疑曰如來不為上慢者說云何知彼是增上慢二乘趣寂若遇佛者多不愚法彼不定性可迴心者不問近遠必能聞知化菩薩事若不知者非真二聖今問定性趣寂不愚迴心何須廣立前來諸教自立自壞。",
        "translation": "Answer: This explains the doubt. The doubt is that the Tathāgata doesn't teach for the conceited, so how does he know that he's conceited, that the two vehicles are headed for quiescence, and that if he meets a buddha, he's not fooled by many teachings.",
        "source": "X56n0939_001:0622b12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經從舍利弗至皆是增上慢人者何耶。",
        "translation": "Q: What's the sutra that goes from Śāriputra to all those who are arrogant and superior?",
        "source": "X56n0939_001:0622b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰顯增上慢相今謂此是抑挫之辭不應判為增上慢相。",
        "translation": "Answer: It shows the characteristic of pride in superiority. Now, this is called a discouragement; it shouldn't be judged as a characteristic of pride in superiority.",
        "source": "X56n0939_001:0622b17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經從所以者何至無有是處為何謂耶。",
        "translation": "Q: What does the sūtra mean from this to there being no such place?",
        "source": "X56n0939_001:0622b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰真聖趣寂者是不愚法人不定性者理信修學今問何故復立趣寂為不定性趣寂即定何以復立為二人耶。",
        "translation": "Answer: A truly noble person aiming for quiescence is not a foolish person, but an unqualified person who is faithful in principle and cultivates it.",
        "source": "X56n0939_001:0622b19_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經云若遇餘佛便得決了謂餘佛者為是誰耶。",
        "translation": "Q: Does the sūtra say that if he meets another Buddha, he'll then attain certainty about who that other Buddha is?",
        "source": "X56n0939_001:0622b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰如瑜伽云若已建立阿賴耶識依無色界亦入滅定信有藏識不斷絕故今謂何故自立定性之人滅第八識今何更引不斷之文若定性不斷第八識者而言永不發菩提心終無是處自立自壞義亦同前。",
        "translation": "Answer: As the yoga says, \"If someone has already established the store consciousness based on the formless realm and has also entered into the concentration of cessation, then they believe there's a store consciousness that doesn't continue to cease.\" Now, why is it that he establishes himself as a person of certainty who ceases the eighth consciousness? Now, why would he cite another text that doesn't continue? If someone of certainty doesn't continue with the eighth consciousness, then they would say that they never arouse the mind of enlightenment and there's ultimately no place for self-establishment and self-destruction, which has the same meaning as the previous one.",
        "source": "X56n0939_001:0622b22_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問古人譯經名十二部新譯何故名十二分。",
        "translation": "Q: In ancient times, sūtras were called twelve divisions, but why are they called twelve parts in new translations?",
        "source": "X56n0939_001:0622c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰部濫部袟由斯道士立三十六部今謂立十二分何能免於三十六分豈由道士展轉改耶外道專濫常樂我淨何更不改立別名耶云濫部袟猶稍可通後人雖復種種解釋終不能出達磨多羅。",
        "translation": "Answer: \"The name 'Mahīśāsaka-parivarta' means 'Mahīśāsaka-parivarta'; 'Mahīśāsaka-parivarta' means 'Mahīśāsaka-parivarta'; 'Mahīśāsaka-parivarta' means 'Mahīśāsaka-parivarta'; 'Mahīśāsaka-parivarta' means 'Mahīśāsaka-parivarta'.",
        "source": "X56n0939_001:0622c04_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者是玫[炯-火+王]。",
        "translation": "\"What's Mae [jong-fire+king]?",
        "source": "X56n0939_001:0622c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰赤色說文云火齊珠也一曰石之美好曰玫圓好曰[王*回]今謂事釋具爾。",
        "translation": "He said it's red in color, and the explanation is that the fire pearl is also a beautiful stone called Mae, which is well rounded and [King*Hui], which is now called a full explanation of things.",
        "source": "X56n0939_001:0622c09_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問經云若於曠野中積土成佛廟等皆成佛道是義何耶。",
        "translation": "Q: What does the sūtra mean when it says that if you accumulate dirt in the wilderness to make a buddha-temple, etc., they all become buddhas on the path?",
        "source": "X56n0939_001:0622c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰論云謂發菩提心行菩薩行者所作善根能證菩提非謂凡夫及決定性聲聞未發心之所能得如是乃至小低頭等亦復如是今謂經中自結菩薩及二乘人天當知發心指今五乘在昔須發故知乃是行菩薩行者之所能得仍恐譯論者情見而已至如八識九識梵本豈可混和譯者乖張後學分[乳-孚+((人*人)/木)]不知童子沙戲何處曾為大行若云無始曾發中間微善被熏此或應爾今謂此是過去佛章乃是久遠曾作小善已後發大能使久遠小善成菩提因若不爾者能得之言不在童稚所作之言指前能證之語在後。",
        "translation": "Answer: The treatise says that the good roots created by someone who arouses the mind to practice bodhisattva practices can realize enlightenment, not by ordinary people or determined śrāvakas who haven't yet aroused the intention to do so, and even by those who are small and lowly, etc. Now, this is called the sutra's own conclusion that bodhisattvas and two-vehicle humans and gods should know that arousing the intention refers to the five vehicles in the past and had to be aroused.",
        "source": "X56n0939_001:0622c12_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問音樂供養其事如何。",
        "translation": "Q: What's the matter with musical offerings?",
        "source": "X56n0939_001:0622c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰音樂女色不以施人亂眾生故出發菩提心經今謂施者必其心志豈可斷彼善根音等事通女男仍須問彼施者但恐觀者心亂不應斷他善心具如阿含有伎人問佛常作音樂得生天不佛種種呵竟云必墮惡道今時託佛自縱無明稱為供養應未可也如來不見女男之相約誰辨失。",
        "translation": "Answer: \"Music for women doesn't disturb sentient beings by giving to others; therefore, it follows from the Sutra on the Mind of Enlightenment. Now, it's said that the donor must have the intention, how could he cut off their good roots?\" Such things as music for women and men are shared by women and men.",
        "source": "X56n0939_001:0622c23_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問諸佛兩足尊至導師方便說其理如何。",
        "translation": "Q: How do the two-legged honored buddhas arrive when the tutor explains the principle of skillful means?",
        "source": "X56n0939_001:0623a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰具三性義佛能證知遍計所執生法二我體性是無佛證無我亦知此無是凡妄執今謂若法無我非破遍計何以言之次佛種從緣起即依他性無漏依他報佛種子因緣所生從緣所起因修作故由證真理斷能執心染分依他知所執見從淨分依他因緣修佛種者為一乘故重顯常法即圓成實法住法位者真如住在諸法之中體性常名有為法住法有染淨離染得淨分位顯之故名法位相者體性也世間本體即是常住真如實性一乘體也於金剛座道場之中知此諸法本性已導師方便以名相說今問三性亦可俱耶必前後耶若必前後一切菩薩唯漸無頓若一時者知等如何又若相即體性如何經云如是相性體三只應是一若是一者佛豈一法作三名說若此三法是一法者自餘七句皆只一法何須論中何等等言四番解釋故不應爾又云塵勞之儔為如來種豈遍計中無餘二耶煩惱生死即是菩提涅槃故可一時俱觀三性又曰一切法中略有二種一空二有空無別體總立一性名為遍計有法差別分之為二常與無常常名圓成無常名為依他又分為二漏與無漏漏是依他無漏圓成今依前門無常名為依他依他有漏皆悉除斷就中但有無漏淨分依他究竟滿位成菩提故故言佛種從緣起也意顯能證常住法性真如二無我理乃能了知二我為無依於善友修習智慧從緣起法菩提覺滿為證一乘真如妙理妙理即是法住法位世間常住相大般涅槃今謂遍計若空豈以依他圓成二體同名為有圓成不變依他隨緣若不變隨緣二俱名有遍計豈得獨名為空若遍計之性本無名空依他本有而無本空若定非空便同外計真如隨緣何但獨隨唯有緣耶真如自體不當空有而空而有故隨他之言他不定有若言真如定有方隨他有亦可真如定空方隨他空若言圓成唯在果者何名一切皆有三性若通因果亦隨遍計通名為有空亦復然遍計是情情體是惑惑即般若前文自立惑種即是法身種故又染淨二種依他不同同名為有二有何殊二有若殊體性應別若染唯有不能不有豈可令淨亦唯在有二有同名為染何名為淨如是等過無量無邊。",
        "translation": "Answer: The Buddha who has the meaning of the three natures is able to realize that the two-self nature of things that are produced by pervasive discrimination is nothing. The Buddha has realized the absence of self and also knows that this absence is a false attachment by ordinary people.",
        "source": "X56n0939_001:0623a06_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問經云知第一寂滅至其實為一乘其理何耶。",
        "translation": "Q: What is the principle behind the sutra that says knowing the first tranquility until it's really the One Vehicle?",
        "source": "X56n0939_001:0623b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰此初開權後還顯實今謂應指開權教時處所若指初轉為諸比丘名為開權初唯小故故得權名淨名方等諸部般若悉皆有人初得小乘彼亦權耶若名開權部應非大若非開權果應非小如般若心經觀自在菩薩行深般若而告舍利弗。",
        "translation": "Answer: At first, it's called opening the provisional; later, it's called revealing the real. Now, this refers to the time and place of the teaching of opening the provisional; if it refers to the first turn, it's called opening the provisional for the monks. At first, it's only small; therefore, it's called the provisional and the pure.",
        "source": "X56n0939_001:0623b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何名為一稱南無佛。",
        "translation": "He asked, \"What is called the single claim to be the Buddha of Southern Wisdom?",
        "source": "X56n0939_001:0623c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰有本云稱南謨諸佛南謨此云敬禮若言伴談或云伴題此云禮拜舊云和南訛也今謂此釋事當又曰薩縛賴他悉陀唐言一切義成舊云悉達訛既出家已淨飯王乃命當家三人舅氏二人侍於太子五人云道安樂耶苦證耶三人曰苦為道二人曰樂為道乃至太子苦行復受乳糜等五人捨去等又此五人迦葉佛時九人學道四人利根已成道竟五人根頓乃至今日又經云過去六人供佛五人取稻華一人待熟故五人先成後即須跋五夜叉食慈力王肉緣陳如初證四人至夏初方得西域記云至安居後得。",
        "translation": "Answer: There is a text that says, \"We call the buddhas namo.\" This is called \"worship.\" If we say \"accompanying talk\" or \"accompanying title,\" this is called \"worship.\" The old text says, \"We are also called \"Sarvâstivāda.\" Tang says, \"All the meanings are accomplished.\" The old text says, \"Siddhârtha.\" Since he left home, the king of Jīvaka ordered the three heads of household, the uncle and the two attendants to the prince, and the five people who made the path peaceful and pleasant, the three said, \"Suffering is the path.\" The two said, \"Suffering is the path.\" The five said, \"Suffering is the path.\" Even when the prince practiced austerities and then received surimi, the five people abandoned the path.",
        "source": "X56n0939_001:0623c02_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何名三輪轉輪何義。",
        "translation": "Q: What's the meaning of the term \"three wheels of transmigration.",
        "source": "X56n0939_001:0623c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰速疾義故見道似彼論云如聖王輪捨後取前見道似彼捨苦集故明見諦理不俱時故尊者妙音說正見思惟勤念似輻正業命似轂正定似輞故名法輪寧知法輪唯是見道見道生時說為已轉天親破有宗云三轉行相非唯見道如何可說唯依見道立法輪名是故應唯轉十二行諸論諸宗異釋甚多今謂此但述昔而已何須廣述異宗。",
        "translation": "Answer: The meaning of speed makes the path of seeing seem like that. The treatise says that it's like the noble king's wheel that takes the former path after the latter and the path of seeing seems like that.",
        "source": "X56n0939_001:0623c13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問諸大乘經亦有法輪名耶。",
        "translation": "Q. Do the great vehicle scriptures also have the name of the wheel of the Dharma?",
        "source": "X56n0939_001:0623c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰大乘總貫一切諸文於中為五一法輪自體謂擇法覺正見正智等三轉通於見修無學亦如妙音二法輪因謂生聖道教謂聞思修等及行相方便三法輪眷屬謂諸聖道助伴五陰瑜伽戒信助道觀也四法輪境謂四諦十二緣三性等五法輪果謂大菩提今謂云何大乘法輪自體但用擇法及正智等三轉復通見修無學復同小乘妙音師耶乃至境為因緣四諦及以三性而果得大菩提耶如大品大集法華華嚴涅槃等經皆是法輪亦同小乘妙音師耶華嚴法界亦必須以四諦因緣耶四諦因緣分大小耶故大小乘輪體相用因位通塞伴助等相其義各別永不相關如何大小參雜一槩判耶。",
        "translation": "Answer: The Mahāyāna summarizes all the texts and there are five of them. 1. the essence of the Dharma wheel is discriminating qualities, which are awakening, right view, right knowledge, and so forth. 3. the causes of the Dharma wheel are birth, noble paths, teachings, which are hearing, contemplating, cultivating, and so forth, and practices, characteristics, and skillful means. 3. the dependents of the Dharma wheel are the assistants of the noble path, the five aggregates, yoga, morality, faith, and the contemplation of the path. 4. the objects of the Dharma wheel are the twelve links to the four truths, the three natures, and so forth. 5. the fruits of the Dharma wheel are great bodhi.",
        "source": "X56n0939_001:0623c21_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "同經云千二百羅漢悉亦當作佛者其相云何。",
        "translation": "Does the same sūtra say that all twelve hundred arhats should be considered buddhas? What is their status?",
        "source": "X56n0939_001:0624a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰如大經云須陀洹人八萬劫到乃至辟支佛十千劫到到十信初信今謂千二百人現在得記如何乃指大經五人五人滅後方始發心經文各各經若干劫故況十信未斷聲聞惑惡豈可小乘已斷之位來入大乘未斷位耶縱入未斷為是煩惱更生為復十信已斷又曰此等初修極為遲鈍不如初修始行菩薩今問為復不如何等初修婆沙論中三僧祗耶為大品中乾慧等即為大乘瓔珞歡喜等耶為涅槃中初發心住是由不了多種菩薩及由不了斷不斷之位趣入不同亦由不知大經五人元是敗種至大乘中方說經生亦由不曉入大之位又云此據不定非諸二乘皆定作佛故大經三十四云我於一時說一乘一道及一行相能為眾生作大寂靜永斷一切結轉因成果我諸弟子不解我意於大眾中唱如是言佛說初果至阿羅漢皆得作佛今謂此是大經二十三雙諍論之文何不更引我言聲聞永入涅槃我諸弟子不解我意則謂聲聞永無成義二俱不解今為處中令二俱解挫言不成理須俱成或引實挫權或存權接物恐執實遮權故遮實恐執權遮實故遮權諸餘諍論大意皆然當知示由不了諍論却引諍論偏證一邊此乃生諍非息諍也若定不發何故前引大經凡有心者皆當作佛況復諍論並指昔經涅槃法華咸不諍攝故大經云師子吼者名決定說故決定言豈同昔諍故知不應引昔諍教證師子吼故知息諍豈合更引諍文引諍意者必在無諍故知涅槃法華是無諍教令得佛意故立諍言通諸諍。",
        "translation": "答曰如大經云須陀洹人八萬劫到乃至辟支佛十千劫到到十信初信今謂千二百人現在得記如何乃指大經五人五人滅後方始發心經文各各經若干劫故況十信未斷聲聞惑惡豈可小乘已斷之位來入大乘未斷位耶縱入未斷為是煩惱更生為復十信已斷又曰此等初修極為遲鈍不如初修始行菩薩今問為復不如何等初修婆沙論中三僧祗耶為大品中乾慧等即為大乘瓔珞歡喜等耶為涅槃中初發心住是由不了多種菩薩及由不了斷不斷之位趣入不同亦由不知大經五人元是敗種至大乘中方說經生亦由不曉入大之位又云此據不定非諸二乘皆定作佛故大經三十四云我於一時說一乘一道及一行相能為眾生作大寂靜永斷一切結轉因成果我諸弟子不解我意於大眾中唱如是言佛說初果至阿羅漢皆得作佛今謂此是大經二十三雙諍論之文何不更引我言聲聞永入涅槃我諸弟子不解我意則謂聲聞永無成義二俱不解今為處中令二俱解挫言不成理須俱成或引實挫權或存權接物恐執實遮權故遮實恐執權遮實故遮權諸餘諍論大意皆然當知示由不了諍論却引諍論偏證一邊此乃生諍非息諍也若定不發何故前引大經凡有心者皆當作佛況復諍論並指昔經涅槃法華咸不諍攝故大經云師子吼者名決定說故決定言豈同昔諍故知不應引昔諍教證師子吼故知息諍豈合更引諍文引諍意者必在無諍故知涅槃法華是無諍教令得佛意故立諍言通諸諍。",
        "source": "X56n0939_001:0624a10_1",
        "is_bad_quality": true
    },
    {
        "source_sentence": "問經云諸佛興出世懸遠值遇難者難相如何。",
        "translation": "Q: What is the difficult aspect of the sutras that say buddhas arise and appear in the world long before they meet with difficulty?",
        "source": "X56n0939_001:0624b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰賢劫第九減中四佛已出後第十減中彌勒次出至第十五減九百九十四佛次第出興此劫壞已鶻盧支佛獨王一劫更經十二劫後始有莊嚴劫千佛出興初淨光稱王佛後更三百劫空過無佛如迦葉佛住世七日不說此經如今釋迦四十餘秊方說此經今謂懸遠似當不知經意正云出世說難聽難。",
        "translation": "A: In the ninth minus of the good eon, four buddhas emerged, followed by Maitreya in the tenth minus, and then Maitreya in the fifteenth minus 994 buddhas emerged in succession. After this eon's destruction, Ursa Major was the sole king of the world for one eon, and then after 12 eons there was the Dhāraṇī eon when a thousand buddhas emerged, beginning with the King of Pure Light Buddha, followed by 300 eons of emptiness and nothing more.",
        "source": "X56n0939_001:0624b13_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問子釋第一卷經為有幾紙章疏。",
        "translation": "Q: How many pages of commentary does the first volume of the Sutra of the Son of Pratibhāna have?",
        "source": "X56n0939_001:0624b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰近三百紙仍恐疎略今謂曾見古德章疏消一部經三百餘紙甚得經旨今已太繁却云疎略當知少文而攝多義方為善也故古人章疏第一卷經一百紙餘消法華經兼通大小開合十方三世教法遠指過去久久本因益未來際永永無已況實相之理不得混和諸大乘經依理起行涉位獲果義勢難融況消經文無有一句非法華意觀向所釋何以多違縱名同而義乖或似而意[牙*牙]故餘所觀不如先古雖然仍欲問後餘文旨趣得失如何為可否耶答曰可也。",
        "translation": "Answer: Nearly 300 pages, but I'm afraid it's loose. Now, I've seen ancient commentaries on the sutra eliminate more than 300 pages of a sutra, and they've got the meaning of the sutra.",
        "source": "X56n0939_001:0624b20_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五百問論卷上",
        "translation": "The Five Hundred Questions [on the Vijñapti-mātra Treatise], Vol. 1",
        "source": "X56n0939_001:0624c07_0",
        "is_bad_quality": false
    }
]