[
    {
        "source_sentence": "華嚴一乘分齊章義苑疏卷第六",
        "translation": "Huayan yisheng fenqi zhang yiyuan shou, vol. 6",
        "source": "X58n0995_006:0224c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "霅溪普靜沙門　道亭　述",
        "translation": "Zhaxi Puzing shaman Daoting said",
        "source": "X58n0995_006:0224c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第六斷惑分齊至寄惑顯位相。",
        "translation": "The sixth part of the explanation is that the confusions are eliminated in equal parts and the delusions are sent to reveal the characteristics of the stages.",
        "source": "X58n0995_006:0224c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰所論斷惑分齊者謂依覺故迷依迷云悟既惑分麤細故智有優微隨教之異也若依下分章初是約人實斷二即別位淺深。",
        "translation": "He explained that the explanation of the delineation of the confusion that's cut means that it's based on awakening, so it's based on delusion, so it's based on awakening because the confusion is delineated as coarse or fine, and therefore knowledge has superior or inferior characteristics that differ according to the teaching.",
        "source": "X58n0995_006:0224c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初義者若依至煩惱所知。",
        "translation": "The first meaning is if we rely on the cognition of the afflictions.",
        "source": "X58n0995_006:0224c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰良由此教談其顯了三乘故具足三乘惑相迴心直進之殊也障下指惑體雖品品斷除要即唯二也。",
        "translation": "He explains that this is the first teaching that discusses the distinctive characteristics of the three vehicles, so it's a direct advancement of the mind that fully reflects the characteristics of the three vehicles' afflictions, and it's a direct advancement of the mind that refers to the essence of affliction even though it's removed in stages, which is only two.",
        "source": "X58n0995_006:0224c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先辨二乘斷至十戒禁取。",
        "translation": "First, it identifies the two vehicles that are stopped up to the ten precepts and prohibitions that are adhered to.",
        "source": "X58n0995_006:0224c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初中者指其名數分別俱生者分其麤細通有十種言一貪者三界愛為體生眾苦為業生眾苦者謂愛力五取蘊生故二瞋者於諸有情苦及苦具心憎恚為體不安隱住惡行所依為業不安隱住者謂心懷憎恚多住苦故三無明者謂三界無智為體於諸法中邪決定疑雜染生起所依為業謂由愚癡起諸煩惱四慢者依止薩迦耶見心高舉為體不敬苦生所依為業不敬者謂於師長及德所而生慢傲苦生者謂生後有故五疑者於諸諦理猶豫為體善品不生者止為業於諦理猶豫者亦攝於寶善品不生者謂由不決不造修故六身見者於五取蘊等隨觀執我及我所諸忍欲覺觀見為體一切見趣所依為業七邊見者於五取蘊等隨觀執若常若斷諸忍欲覺觀見為體障處中行出離為業處中行者謂離斷常緣起正智八邪見者謗因謗果謗作用或懷實事或邪分別諸忍欲覺觀見為體斷善根為業及不善根堅固所依為業九見取者謂於諸見及見所依五取蘊等隨觀執為最為勝為上為玅諸忍欲覺觀見為體執不正見所依為業十戒禁取者於諸戒禁及戒禁所依五取蘊等隨觀執為清淨為解脫為出離諸忍欲覺觀見為體勞而無果所依為業戒禁者謂惡見為先勞而無果者由此不能得出離故。",
        "translation": "He explained that in the beginning, he was referring to the nouns, numbers, discriminations, and co-arising, which are rough and subtle, and there are ten kinds in general.",
        "source": "X58n0995_006:0224c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於中四種至六通二種。",
        "translation": "Of these, the four kinds up to the six supernormal powers are two kinds.",
        "source": "X58n0995_006:0225a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰分別麤而顯現俱生細以難知是故與身俱生與心同事於十使中此四唯麤唯局分別餘六麤細兩兼故通二種。",
        "translation": "It's because it's difficult to know that it's co-arising with the body and cooperating with the mind. Of the ten tendencies, these four are only coarse and only limited to discrimination, and the other six are both coarse and fine and therefore share both kinds.",
        "source": "X58n0995_006:0225a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五識得起至分別起也。",
        "translation": "The fifth consciousness can arise up to the point where it discriminates and arises.",
        "source": "X58n0995_006:0225a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此下揀諸識具惑使之分齊言初三者貪瞋無明也此三是不善性故五識有之由下出分別之所以邪師等三因者更等邪師邪教邪思惟既因三引故屬分別。",
        "translation": "Explanation: The following is a list of consciousnesses that are afflicted with the afflictive tendencies, the first three of which are greed, anger, and ignorance. These three are unwholesome, so the fifth consciousness has them.",
        "source": "X58n0995_006:0225b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "意識具十種四分別六通二。",
        "translation": "The consciousness has ten kinds, four discriminations, six supernormal abilities, and two.",
        "source": "X58n0995_006:0225b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰意識起過彌廣仍資餘識故茲通具。",
        "translation": "The explanation is that consciousness arises from an exceedingly wide range and still feeds the other consciousnesses, so it's hereby fully included.",
        "source": "X58n0995_006:0225b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "末那唯四至是故唯四。",
        "translation": "Manas is only four up to this point, so it's only four.",
        "source": "X58n0995_006:0225b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初句正明次句揀除以瞋下出所以末那者此云貪污意即第七識此識既但有覆故無於瞋又以下出除邊見之所以言一類相續緣第八識者應有難云既有我見執緣賴耶須有我所之邊見故今通云剎那剎那執我無暇邊邪故無邊見也又以後三下揀餘四使藉三因生者定屬分別此識無彼者唯是俱生故不起分別也又有難云既屬俱生前五識亦有俱生與此何別故今揀云又由恒相續緣故非第六所引等。",
        "translation": "The explanation is that the first sentence correctly explains the second sentence by selecting the meaning of the second sentence, excluding anger, and the following sentence by selecting the meaning of manas, which is the seventh consciousness.",
        "source": "X58n0995_006:0225b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第八識至無記性故。",
        "translation": "The eighth consciousness is therefore indeterminate in nature.",
        "source": "X58n0995_006:0225b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰八識白淨無垢無有惑使故總不起唯是異熟者但唯總報之主耳。",
        "translation": "He explained that the eighth consciousness is white, pure, undefiled, and without afflictive tendencies; therefore, it's generally unarisen and only immature, but it's only the lord of the total retribution.",
        "source": "X58n0995_006:0225b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此分別俱生至百二十八也。",
        "translation": "This discriminated co-arising goes up to 128.",
        "source": "X58n0995_006:0225b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰約界地定其品數以通迷四諦故異小乘初明分別次明俱生通前下總合品數竝可知。",
        "translation": "The explanation says that it's determined by the number of classes in the objective realm because it's common to be confused about the four truths and therefore differs from the lesser vehicle in that it first clarifies discrimination, then clarifies co-arising, and it's possible to know the number of classes that are combined under the general category of the former.",
        "source": "X58n0995_006:0225b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何故前愚法至通一切境也。",
        "translation": "The question is why the former foolish dharmas reach the level of penetrating all objects.",
        "source": "X58n0995_006:0225b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰通局之問初問二答問中由小乘俱舍頌云苦下具一切集滅除三見道除於二見上界不行恚故今難云十使不通迷四諦也此即以局而難通也答中二義初約惑廣二據唯心境由心變故通迷也意揀小乘心外有境也。",
        "translation": "The explanation is that the question of the general principle is asked in the first place, and the second answer is that the lesser vehicle verse of the club verse says that suffering is accompanied by all the aggregates, cessation, the three views, the path, and the two views of the higher realms, so it's difficult to say that the ten conditions don't lead to delusion about the four truths.",
        "source": "X58n0995_006:0225b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二斷惑至得不還果。",
        "translation": "Second, he stops mental disturbances and attains the fruit of nonreturning.",
        "source": "X58n0995_006:0225c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰斷惑得果者謂除惑品之多少獲證入之階差先斷分別入真見道三類不同第一類者於初果向後一剎那間頓斷三界迷諦分別一百十二品即證初果第二倍離欲者此從外道中來於外道中曾以六行事觀伏欲界修惑九品中前六品然後迴心歸佛發生空慧入真見道斷除分別并斷先伏六品修惑即證二果故云兼斷倍離欲得一來果言倍離下釋相更明則兩事雙除故曰倍也第三已離欲者此類亦從人天外道中來但是於彼道中曾以六行事觀齊伏欲界修惑九品然後迴心歸佛修我空觀入真見道斷除分別并斷所伏九品修惑即證三果故曰不還由不還故云已離欲也。",
        "translation": "The explanation says that cutting off affliction and attaining its fruit refers to the number of classes of affliction removed and the stage of attainment of the difference between the first cutting off discrimination and entering the true path of seeing three different kinds of fruits.",
        "source": "X58n0995_006:0225c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如瑜伽說至證三果故。",
        "translation": "It's because it's realized the three realizations as explained in the yoga.",
        "source": "X58n0995_006:0225c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰上文三類小乘入證本出瑜伽故引此三為證也。",
        "translation": "The explanation says that the above three categories of lesser vehicle entry and realization originally came from the yoga, so these three are cited as proof.",
        "source": "X58n0995_006:0225c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次斷俱生至阿羅漢果。",
        "translation": "Next, it's ending co-arising and reaching the fruit of the arhat.",
        "source": "X58n0995_006:0225c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰其七識俱生最後地方斷故今云第六識俱生九地九品謂三界九地每地九品共有八十一品又進修道人者將此帖前見道第一類人說之則前見此修正當漸出離者餘如常說。",
        "translation": "The explanation says that the seventh consciousnesses that are co-arising in the final stage are stopped, so now it's called the sixth consciousness that's co-arising in nine stages and nine classes, which are the nine stages of each of the three realms and a total of 81 classes.",
        "source": "X58n0995_006:0225c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二頓出離者至更無餘果。",
        "translation": "Those who are suddenly freed from the second path will reach the realization that there's nothing left.",
        "source": "X58n0995_006:0226a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰不備歷階漸故云頓也謂此一類人由根勝故將三界八十一品修惑束成三九纔斷欲界一品將色界一品無色界一品一時齊斷故云頓斷三界然後却斷第二品第三品等故云漸除九品此之二三等亦三界同斷但於初果身中修此斷證直造無學不更經二三故云更無餘果。",
        "translation": "It means that this type of person, because of their superior faculties, bundles the eighty-one classes of affliction cultivation in the three realms into three or nine, cutting only one class of the desire realm and one class of the form realm and one class of the formless realm at a time, so it's called cutting the three realms suddenly and then cutting the second and third classes together, so it's called gradually removing the nine classes.",
        "source": "X58n0995_006:0226a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者以彼至云漸除也。",
        "translation": "Why is that? Because it's gradually removed up to the point of the cloud.",
        "source": "X58n0995_006:0226a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰徵釋頓漸也言竪論者不乖次第九品之除。",
        "translation": "The explanation is that the lemmas and explanations are sudden and gradual, and those who say it's a correct explanation don't deviate from the ninth category of removal.",
        "source": "X58n0995_006:0226a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若爾何故至經等如彼說。",
        "translation": "If that's the case, how does it get to the sūtras and so forth as they explain?",
        "source": "X58n0995_006:0226a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰若爾下問以於下答故對法下證成言若爾者牒前頓出離難其漸除以於三界法不能頓緣者正答所問意顯根劣固守漸次既不頓緣焉能頓斷對法文顯言依止未至定者謂欲界未至色界根本故也。",
        "translation": "The explanation says, \"If this is the case, the following question is asked in order to answer it in the following way, so it's gradually removed because it's difficult to escape from the three realms immediately, which is the correct answer to the question.",
        "source": "X58n0995_006:0226a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其末那煩惱至而斷故也。",
        "translation": "It's because their manas and afflictions reach and are stopped.",
        "source": "X58n0995_006:0226a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰七識恒行故煩惱細從其頓出離人智行殊勝亦不能頓緣故於第九地中與其修惑一處齊斷故瑜伽下證成非如下揀顯準知。",
        "translation": "The explanation is that because the seven consciousnesses are constantly active, the afflictions are subtle, and from their sudden escape the superiority of a person's knowledge and conduct can't be immediately conditioned.",
        "source": "X58n0995_006:0226a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問何故前愚至此中有耶。",
        "translation": "Q. Why is it that the former foolishness exists up to this point?",
        "source": "X58n0995_006:0226a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰愚法聲聞但分界別斷無此頓超故躡而難之。",
        "translation": "The explanation is that foolish śrāvakas only eliminate the distinctive aspects of the world without immediately transcending them.",
        "source": "X58n0995_006:0226a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答為顯前劣至斷煩惱障。",
        "translation": "A, it's to show that the former folly reaches the elimination of the afflictive hindrances.",
        "source": "X58n0995_006:0226b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初勝智引攝轉彼小心二例況末那顯教陿劣此謂下結分齊。",
        "translation": "He explained that first, superior cognition leads to the inclusion of those who are careful of the two examples, but second, the manas reveal the teaching's weaknesses, which are the alignment of the lower-level bonds.",
        "source": "X58n0995_006:0226b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所知障至非擇滅也。",
        "translation": "It's the cognitive hindrances that reach the point of non-selection and cessation.",
        "source": "X58n0995_006:0226b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此所知障但能障定故入無餘時須斷又滅其智獨顯無餘故唯非擇滅也。",
        "translation": "The explanation says that these cognitive hindrances only hinder concentration, so when they enter without remainder, they must be eliminated and extinguished, and their cognition alone shows that there's no remainder, so only non-selective extinction is possible.",
        "source": "X58n0995_006:0226b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其餘一切至如瑜伽說。",
        "translation": "All the others arrive as the yoga explains.",
        "source": "X58n0995_006:0226b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰先雙標慧解脫下列二類此乘所知既獨障定不障智慧故慧解脫人不斷也言俱解脫者謂定慧雙修定既被障不得解脫故須分斷謂八下示所斷障與能斷智也。",
        "translation": "The explanation says that the first two categories of liberation from wisdom are those in which the knowables of this vehicle alone hinder concentration and don't hinder wisdom, so the liberators of wisdom don't stop there.",
        "source": "X58n0995_006:0226b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又諸解脫至心得解脫故。",
        "translation": "They are also liberated until they attain liberation of mind.",
        "source": "X58n0995_006:0226b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初句指八定次句離障顯由聲聞下約人體障明其深入耳。",
        "translation": "The explanation says that the first phrase refers to the eight concentrations, and the second phrase indicates that the hindrances are removed by the śrāvakas and the following phrase describes their depth in terms of the human hindrances.",
        "source": "X58n0995_006:0226b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知此始教至斷種子故。",
        "translation": "You should know that this is the first teaching up to the point of cutting off seeds.",
        "source": "X58n0995_006:0226b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此中結意料揀有其二義一以所知料揀謂小乘但斷煩惱此則兼斷所知二小乘唯斷煩惱此則兼斷種子何以故謂彼小乘既不談八識含藏故無種子設爾經部所談即屬大乘故也。",
        "translation": "The explanation says that there are two meanings to the selection of the connotation here: one is the selection based on knowledge, which means that the lesser vehicle only ends afflictions, and this also ends knowledge; the second reason is that the lesser vehicle only ends afflictions, and this also ends seeds.",
        "source": "X58n0995_006:0226b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "直進菩薩至二障俱斷。",
        "translation": "The bodhisattva who directly advances to the point where the two hindrances are both eliminated.",
        "source": "X58n0995_006:0226b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此教菩薩雖五位伏斷之殊皆二障故不同聲聞更分界地也。",
        "translation": "The explanation is that although the bodhisattvas of this teaching have overcome the differences in the five levels, they all have two hindrances, so they're not like the śrāvakas who are further divided into elemental stages.",
        "source": "X58n0995_006:0226b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又煩惱障至約界分品。",
        "translation": "It also deals with the afflictive hindrances up to the level of the elemental division.",
        "source": "X58n0995_006:0226b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰菩薩之人觀智勝前不假委細分其品數唯一伏斷也。",
        "translation": "The explanation says that a bodhisattva's knowledge of contemplation is superior to the prior one, and he doesn't need to specify the number of classes that are only subdued and eliminated.",
        "source": "X58n0995_006:0226b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但於二障至頓斷彼種。",
        "translation": "However, it's from the two hindrances to the sudden removal of those types.",
        "source": "X58n0995_006:0226c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰地前伏障者謂資粮位中伏二障現行加行位中伏二障隨眠皆用加行智為能伏纔登初地見道入心二障分別種子剎那頓斷。",
        "translation": "The explanation says that subduing hindrances before the ground means subduing the two hindrances in the stage of accumulation, subduing the two hindrances in the stage of applied practices, and using the knowledge of applied practices to subdue them all.",
        "source": "X58n0995_006:0226c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其俱生中至大菩提故。",
        "translation": "It's because they reach great enlightenment in the process of co-production.",
        "source": "X58n0995_006:0226c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初明留惑何以下徵釋所以潤生攝化則資其智願不墮二乘則護其沉空其所知障既障大智菩提造菩提者分分而斷。",
        "translation": "He explains that first, he clarifies why the afflictions that remain are explained below, so he nourishes sentient beings, nurtures them, converts them, and vows not to fall into the two vehicles, then protects them by sinking into emptiness, and since the cognitive hindrances obstruct great enlightenment, the bodhi-maker is stopped in parts.",
        "source": "X58n0995_006:0226c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故攝論至證佛果也。",
        "translation": "Therefore, it's the reason why the Summary of the Discourse has reached the realization of Buddhahood.",
        "source": "X58n0995_006:0226c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰即由留煩惱障起勝行者謂資成大悲殊勝之行悲智相導得至無漏佛果。",
        "translation": "He explains that this is the superior practice that arises from retaining the afflictive hindrances, which is the accomplishment of the extraordinary practice of great compassion, guided by compassion and wisdom, that leads to the untainted Buddhahood.",
        "source": "X58n0995_006:0226c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又梁攝論至金剛位。",
        "translation": "Also, Liang's Summary of the Discourse reaches the adamantine stage.",
        "source": "X58n0995_006:0226c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰據論定留惑窮因何以故論云留惑至惑盡證佛一切智故。",
        "translation": "The explanation says that according to the treatise, the afflictions that remain are definitively exhausted as a result of the treatise, so it's said that the afflictions that remain will reach the end of the afflictions and realize the Buddha's omniscience.",
        "source": "X58n0995_006:0226c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所知障至方得總盡。",
        "translation": "The cognitive hindrances will only reach their total end.",
        "source": "X58n0995_006:0226c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰正障菩薩道者謂與大菩提而歒體相違故地地斷終至佛地方究竟。",
        "translation": "The explanation is that the correct hindrance to the bodhisattva path is that it is at odds with the essence of great enlightenment and therefore ends up in the buddha stage.",
        "source": "X58n0995_006:0226c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此即說至俱至佛地。",
        "translation": "This is called the stage of arriving at the buddhahood of all buddhas.",
        "source": "X58n0995_006:0226c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰由此者指前所知若然者則煩惱修惑故留所知修惑故斷以是義故俱至佛地也。",
        "translation": "Explanation: This refers to the former cognition. If this is the case, then the afflictions and cultivation of mental disturbances will remain, and the cognition and cultivation of mental disturbances will be eliminated.",
        "source": "X58n0995_006:0226c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故對法論至及如來故。",
        "translation": "Therefore, it's because of the explanation of the teaching that they'll reach the tathāgata.",
        "source": "X58n0995_006:0226c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰證成二障俱至佛地也修道位中唯修所知對治道者良以此障障其菩提是故修其法空之智而對治之其煩惱障不障菩提仍資大願故不斷之但至盡得果一時俱亡頓成羅漢及如來者謂約煩惱盡邊成羅漢所知盡邊成如來斯乃寄對引攝之義也。",
        "translation": "The explanation is that the realization of the two hindrances all reaching the buddha stage also involves cultivating only the path of antidotes to the knowables in the cultivation stage, which is a good way to counteract the hindrances that obstruct enlightenment and therefore cultivate the knowledge of the emptiness of phenomena and counteract the afflictive hindrances that don't obstruct enlightenment and still support the great vow, so they don't stop there.",
        "source": "X58n0995_006:0226c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其末那俱生至佛地盡也。",
        "translation": "His manas will be co-arisen until the end of the buddha stage.",
        "source": "X58n0995_006:0227a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰七識俱生偏障佛地故至彼盡。",
        "translation": "The explanation says that the seven co-arising consciousnesses are partial hindrances to the buddha stage and therefore reach their end.",
        "source": "X58n0995_006:0227a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問其二障至現行有何同異。",
        "translation": "He asked what the similarities and differences were between the two hindrances and their manifest activity.",
        "source": "X58n0995_006:0227a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰二障修惑既通諸地於六七二識之中或起現前時還同耶異耶。",
        "translation": "The explanation is that since the two hindrances and the afflictions of cultivation are common to all stages, when the sixth and seventh consciousnesses are present or arise in the present, are they the same, or different?",
        "source": "X58n0995_006:0227a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答其煩惱至不起過患。",
        "translation": "He answered, \"The afflictions up to that point don't give rise to faults.",
        "source": "X58n0995_006:0227a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰合盡而故留焉成患害加以智控用成大悲。",
        "translation": "The explanation is that the combination is ended, so it remains a danger and becomes harmful, and it's used to control wisdom and become greatly compassionate.",
        "source": "X58n0995_006:0227a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "猶如毒蛇至而成餘用。",
        "translation": "It's like a viper that reaches and makes use of something else.",
        "source": "X58n0995_006:0227a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰舉喻也毒蛇喻惑呪力譬智御餘喻助成願行下合法云。",
        "translation": "He explains that it's a metaphor, and the viper is a metaphor for mental disturbance, a metaphor for wisdom, and a metaphor for the rest of the world to aid in the accomplishment of vows and practices.",
        "source": "X58n0995_006:0227a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩善巧至皆得自在。",
        "translation": "Bodhisattvas skillfully attain mastery over all.",
        "source": "X58n0995_006:0227a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初引證是故下結意言或現者助勝行故或種者斷而不斷故由是皆得自在也。",
        "translation": "It's explained that the first quote is to confirm that this is the reason the second concludes with the idea that either the manifestation is an aid to superior practice, or the seeds are cut off but not stopped, and thus they all attain mastery.",
        "source": "X58n0995_006:0227a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其第七識至觀智為間故。",
        "translation": "The seventh consciousness then arrives at the point where observing wisdom is the interval.",
        "source": "X58n0995_006:0227a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰受生三界非七識煩惱能為故非潤生既不潤生攝化故不更留行相細故者謂四惑俱生也惑既微細觀智纔虧即便現起故云七地已還有時暫現由觀智為間斷故。",
        "translation": "He explained that feeling birth in the three realms isn't something that the seventh consciousness' afflictions can do, so it doesn't moisten birth, and since it doesn't moisten birth and bring about transformation, it doesn't stay in the lineage because it's subtle, meaning the four co-produced afflictions are subtle, and observing wisdom is limited even when it's present.",
        "source": "X58n0995_006:0227a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其所知障至地地分斷故。",
        "translation": "It's because the cognitive hindrances are stopped from the first ground to the second ground.",
        "source": "X58n0995_006:0227a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰二識所知最障菩提欲證後地入心須於前地出心而斷故云皆後地惑於前地起等。",
        "translation": "Explanation: The cognitive hindrance of the two consciousnesses that most hinder enlightenment must be stopped in the mind that emerges from the prior ground when they want to realize the mind that enters the latter ground.",
        "source": "X58n0995_006:0227a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問若爾何故至有漏心等耶。",
        "translation": "Q. If that's the case, how does it get to the contaminated mind and so forth?",
        "source": "X58n0995_006:0227b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰若爾者躡上地地分斷以問也意謂若分分斷應無漏失何故下正難相違。",
        "translation": "He said, \"If this is the case, he's asking a question based on the fact that the upper ground is partially stopped, meaning that if it's partially stopped, there should be no loss of contaminants.",
        "source": "X58n0995_006:0227b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答若約第六至即似有漏。",
        "translation": "Answer: If we look at the sixth consciousness, it would seem to be contaminated.",
        "source": "X58n0995_006:0227b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰六識煩惱留故起似無乖所斷。",
        "translation": "The explanation says that the six consciousnesses appear to be unobstructed because the afflictions remain.",
        "source": "X58n0995_006:0227b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若約所知至此二通十地。",
        "translation": "If we look at the sixth consciousness, it would seem to be contaminated up to the point where these two pass through the ten stages.",
        "source": "X58n0995_006:0227b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰二識所知貫其十地若起有漏正當所斷復何問哉。",
        "translation": "The explanation says that the knowledge of the two consciousnesses goes through the ten stages, and if contaminants arise that are properly eliminated, what question is there?",
        "source": "X58n0995_006:0227b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若末那煩惱至餘義準知。",
        "translation": "If manas afflictions up to the remaining point are known, then what's the point?",
        "source": "X58n0995_006:0227b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰七識煩惱既非所留即實有漏於七地有無七識煩惱恒行無明從初入雖二智雙緣決定別照照真則寂然不動照俗乃識妄差殊葢不定者但在觀智之斷續耳。",
        "translation": "The explanation says that since the seven consciousnesses' afflictions aren't retained, that is, they're really contaminated, and in the seventh ground there are or aren't seven consciousnesses' afflictions that are constantly active and nescient from the first entry, even though the two kinds of cognition are both conditioned by determining distinct illumination, true illumination is quiescent and motionless, and conventional illumination is a difference between consciousness and delusion.",
        "source": "X58n0995_006:0227b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此教中至對法論說。",
        "translation": "Furthermore, this is the teaching that reaches the explanation in the Treatise on Contemplation of the Dharma.",
        "source": "X58n0995_006:0227b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰惑滅智起初法二喻如秤兩頭低昂時等故對法云又此中有於所生處如秤兩頭低昂道理有本云如昂即押押即昂等或云築即押押即築等恐傳寫之訛也以違論故。",
        "translation": "The explanation says that the first two metaphors for the arising of the cessation of delusion and the arising of cognition are like scales with two heads held low and so forth, so the opposing teaching says that there's a principle in this place that arises like scales with two heads held low and so forth, or there's a principle in the text that says something like \"Aang, that's bet, that's bet, that's bet,\" which is probably a misrepresentation because it's contrary to the explanation.",
        "source": "X58n0995_006:0227b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此障法至是其障義。",
        "translation": "This obstruction to the truth of the Dharma is another obstruction.",
        "source": "X58n0995_006:0227b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰且法相大乘見有實惑可斷惑滅智起故如秤兩頭低昂時等今以點示意順性宗故說障既依識本自無性無性即空妄說為障義也若更深而究之所依之識亦無有性故圭山云識如幻夢此中依識無性之言亦含斯義思之。",
        "translation": "He explained that the Mahāyāna view of the Dharma aspect is that real afflictions can be ended, and cognition arises when the afflictions cease, such as when the two heads of a scale are held low. Now, he's using a point to show his intention to follow the nature school, so he's saying that the hindrance relies on the fact that consciousness is inherently without nature, and the lack of nature means that it's a false statement of the meaning of hindrance.",
        "source": "X58n0995_006:0227b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如維摩經至準彼知之。",
        "translation": "It's like the Vimalakīrti-sūtra up to the point where he knows it by reference.",
        "source": "X58n0995_006:0227c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰了苦之無苦故曰洞達空無是苦義今此障義亦準彼知者則彼而曉此達惑障之本空耳。",
        "translation": "The explanation says that he understands the absence of suffering, so he's said to have penetrated the meaning of emptiness as suffering. Now, if he also knows the meaning of this hindrance, then he'll understand it and realize the original emptiness of the afflictive hindrances.",
        "source": "X58n0995_006:0227c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依終教至能斷所知障。",
        "translation": "If he relies on the final teaching until he's able to eliminate the cognitive hindrances, then he'll be able to understand their fundamental emptiness.",
        "source": "X58n0995_006:0227c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此教所斷須達惑體之本空知真性之本有方諸二乘唯存忻猒三昧屆懷未曉妄源故但能忻伏斯乃以實奪權作如是說。",
        "translation": "The explanation is that what's stopped by this teaching is to attain the essential emptiness of the essence of affliction and to know the true nature of what originally existed before the two vehicles could only exist in the concentration of calmness and unawareness of the deluded origin, so they could only subdue them.",
        "source": "X58n0995_006:0227c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故彌勒所問經至亦如上說。",
        "translation": "Therefore, Maitreya's question about the sutra's attainment was likewise explained above.",
        "source": "X58n0995_006:0227c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰原其迷真執妄二相普周若彼二乘希心既寡焉斷妄情何以故能所不相應故清涼云迷真妄念生悟真妄即止既不如斯但能折伏而矣。",
        "translation": "He explained, \"Originally, the two aspects of misconstruing the true and attaching to the deluded were universally shared, but if the two vehicles had few states of mind, how could they cut off deluded feelings? Why is it that what's possible isn't associated with what's possible?\" Qingliang said, \"Misconstruing the true and deluded, deluded thoughts arise, and awakening the true and deluded is stopped.",
        "source": "X58n0995_006:0227c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問此說何故至愚法故不同也。",
        "translation": "He asked why this statement is different from the teaching of arriving at ignorance.",
        "source": "X58n0995_006:0227c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初問二答問中初教二乘有斷此教但伏伏斷不同故須成問答中初權二實權中言以上就下者謂寄對引攝故說煩惱障與二乘同佛地而斷也又以下同上者謂令具勝進許悟大途故說所知分有所斷也今此就實等者究彼造心未能契實既不悟心焉能盡妄故但折伏又亦下從容之說亦自不同。",
        "translation": "The explanation is that the first question and the second answer are the first teaching that the two vehicles are stopped, but this teaching is different from the subduing and stopping. The answer is the first expedient and the second true expedient, which is to say that the above is directed downward, meaning that the afflictive hindrances and the two vehicles are included in the same buddha stage and are stopped, and the following is the same as the above, which is to make them perfect and advance to the great path of awakening, so it's said that the knowables are stopped.",
        "source": "X58n0995_006:0227c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其菩薩人至究竟清淨。",
        "translation": "His bodhisattva person reaches ultimate purity.",
        "source": "X58n0995_006:0227c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此教行人知真達妄無斷而斷無斷故惑性即智性而斷故不礙迷真體惑既然故不分俱生及與分別之麤細也何以故不同法相見有實惑可分割故但有下克示惑相唯有此二正使者二障現行兼所依無明習氣者唯無明故地前伏使現者伏即是斷謂留伏煩惱除斷所知若但有伏何名為聖初地斷使種者自在攝化不復更留是故地上但除微細無明習氣至於佛地違離微細念故得心性心即常住名究竟覺如此除斷亦不同他宗歷破四十二品之殊也。",
        "translation": "The explanation is that this teaches that the practitioner knows the true, reaches the delusion, has no cutting, and cuts off the nature of delusion, which is the nature of wisdom, and cuts off the confusion, so it doesn't prevent delusion about the true essence of confusion since it's not distinguished from co-production and discrimination of the coarse and the subtle. Why is that? It's different from the characteristics of the Dharma, seeing that there are real confusions that can be divided, so it's only these two correct messengers who show the characteristics of confusion, and these two hindrances that are both present and dependent.",
        "source": "X58n0995_006:0227c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然彼地前三賢至所知障等故。",
        "translation": "However, it's because of the three stages of goodness up to the level of the cognitive hindrances.",
        "source": "X58n0995_006:0228a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此三賢菩薩一者超權二者越小若乃三觀澄明真俗不二即是超權故留惑種偏斷所知即越小聖故曰不墮等文中但有越小義含超權何以故達法之異故。",
        "translation": "The explanation is that these three good bodhisattvas are either transcendent or transgressional, and if they have clarified the three contemplations, true and secular are not two, that is, they are transcendent, so they leave the seeds of confusion and partially eliminate the knowables, which are transgressional and noble, and so forth.",
        "source": "X58n0995_006:0228a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故梁攝論至皆此義也。",
        "translation": "Therefore, Liang's Summary of Discourses up to this point all have this meaning.",
        "source": "X58n0995_006:0228a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰引茲一經二論雖皆證地前亦有增勝且攝論證異小仁王證留惑起信明證入增勝經論雖爾其實舉一兼餘也。",
        "translation": "The explanation is that although both the scriptures and the treatises cited here realize the pre-earth level, they also have superiority and the Summary Discourse realizes the difference between the lesser Renwang's realization, the confusion that arises from faith, and the realization of the superiority of the scriptures and treatises, although they are really one and the same.",
        "source": "X58n0995_006:0228a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以此菩薩至正使俱盡。",
        "translation": "Thus, the bodhisattva attains the level where the correct afflictions are all consummated.",
        "source": "X58n0995_006:0228a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰以此菩薩唯怖智障者此障障其菩提是彼菩薩所求之果是故畏之修唯識真如等觀者能治之智也所言唯識者謂觀名義自性差別等相真如觀者當知唯心無外境界以斯二觀治彼所知則惑散空明唯一真際然於下故留資行初地下雙除二障不分見修者地上已去但除習氣故無可分也。",
        "translation": "The explanation is that this bodhisattva is only afraid of the cognitive hindrance, which hinders his enlightenment and is the fruit sought by that bodhisattva; therefore, he is afraid of cultivating consciousness-only, true thusness, and so forth, which are the cognitive abilities that can be cured. Consciousness-only means observing nominal self-nature, distinctions, and so forth.",
        "source": "X58n0995_006:0228a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故彌勒所問至此文為證。",
        "translation": "Therefore, Maitreya's question up to this point in the text is proof.",
        "source": "X58n0995_006:0228b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初引小例大問以不同二答以證真觀機益物由是煩惱障真有違同體大悲利益眾生故見道中一切俱斷。",
        "translation": "Explanation: First, he cites a small example to illustrate a big question that's different from the second answer to realize the truth of observing the capacity to benefit things because the afflictive hindrances are truly conflicting with the same essence of great compassion for the benefit of sentient beings, so everything in the path of seeing is stopped.",
        "source": "X58n0995_006:0228b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其末那煩惱至後除殘習。",
        "translation": "Those manas are afflicted until the end, when they remove residual habits.",
        "source": "X58n0995_006:0228b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初地斷麤者使種也後除殘習者地上已去但斷餘殘習氣也。",
        "translation": "The explanation says that the first ground stops coarse tendencies and seeds, and the latter removes residual karmic impressions that have left the ground but are left behind.",
        "source": "X58n0995_006:0228b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故無性攝論至更不云斷也。",
        "translation": "Therefore, the Asvabhāvahāva's Commentary on the Compendium of the Great Vehicle doesn't say anything about stopping them.",
        "source": "X58n0995_006:0228b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰意顯初現觀時已斷七識使種自後但除殘習故有轉言也。",
        "translation": "The explanation says that the intention is to show that the first stage of clear observation has already ended the tendency seeds of the seven consciousnesses, and since then, it's only removing residual karmic impressions and therefore there's a change in language.",
        "source": "X58n0995_006:0228b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若云此是入至何名轉淨。",
        "translation": "If you say this is entry, then what's the name of the transition to purity?",
        "source": "X58n0995_006:0228b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰牒難返質斷義極成也。",
        "translation": "The explanation says that it's extremely difficult to return to the essence of cutting, and the meaning is fully formed.",
        "source": "X58n0995_006:0228b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依始教容如彼說。",
        "translation": "If we rely on the initial teaching, it's allowed to be explained like that.",
        "source": "X58n0995_006:0228b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰約權縱難何以故權教七識佛地方斷故。",
        "translation": "The explanation says that it's difficult to define the provisional teaching and difficult to define the seven consciousnesses because they're eliminated in the Buddha's place.",
        "source": "X58n0995_006:0228b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知至但除習氣。",
        "translation": "Therefore, you should know that they only remove the habituated tendencies.",
        "source": "X58n0995_006:0228b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰約實奪破不容初地更說暫伏決知是斷後除殘習耳。",
        "translation": "The explanation says that focusing on the truth, refuting and refuting doesn't allow the first ground to be further explained, and it's definitely known that it's removing residual karmic impressions after cutting them off.",
        "source": "X58n0995_006:0228b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故寶性論至習氣障故。",
        "translation": "Therefore, the Jewel-Nature Treatise gets to the point where it removes the hindrance of habituated tendencies.",
        "source": "X58n0995_006:0228b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰論明三類皆先標過次約人指惑第主一類證成上文地上習氣也。",
        "translation": "The explanation says that the three categories in the explanation are all labeled as fallacies first, followed by the main category of confusion in terms of people, and the realization of the above ground-level karmic impressions.",
        "source": "X58n0995_006:0228b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解云論釋至無間生習氣。",
        "translation": "Understanding the explanation of the treatise, he arrived at the karmic impressions that arise without interruption.",
        "source": "X58n0995_006:0228b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰位彌高惑彌薄故云地上名摩訶薩故知但有習氣障也言習氣者謂無明熏習氣分也。",
        "translation": "Explanation said that the level is very high, the confusion is very thin, so it's called mahāsattva on the ground, so you know that there are only hindrances of karmic impressions.",
        "source": "X58n0995_006:0228b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問云何地上至彼失此中無也。",
        "translation": "Q: What is the loss of the above ground to the other here?",
        "source": "X58n0995_006:0228b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初問二答問約惑盡類小答據二障雙除如始下舉小聖之頓超況薩埵之殊勝言猶尚不得彼一來果者謂直登無學故不證一來也。",
        "translation": "The explanation is that the first question and the second answer are about the end of mental disturbances and the lesser answer is based on the removal of both hindrances, such as the beginning, the sudden transcendence of the lesser sages, and the extraordinary situation of the sattva, which is still not yet the fruit of the one coming.",
        "source": "X58n0995_006:0228c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此教中至十地論說。",
        "translation": "Furthermore, this is the teaching up to the tenth ground as explained in the treatise.",
        "source": "X58n0995_006:0228c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰知起惑滅非初非中後者謂無斷故相緣性而本融而斷故惑迷真而要除云何下徵喻惑空如太虗之本淨也。",
        "translation": "He explained that knowing that arising and ceasing of afflictions is not initial and not intermediate and subsequent means that there's no stopping, so the nature of mutual dependence is originally fused and stopped, so afflictions are misconstrued and true and must be removed.",
        "source": "X58n0995_006:0228c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此教中至宜應知之。",
        "translation": "It's also appropriate to know the extent of this teaching.",
        "source": "X58n0995_006:0228c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰迷真妄念生則真隨妄轉是故煩惱等法皆是真如隨緣如起信說者彼文盛談熏習隨緣之義也又經云一切法即如如等者即光明淨名等經故光明云唯如如獨存淨名云凡夫如草本如至於彌勒亦如也法既皆如煩惱亦爾故煩惱即菩提結業即解脫是故下結揀權實以語學者。",
        "translation": "The explanation is that when deluded thoughts of the true arise, then the true follows the deluded. Therefore, afflictions and other things are true, such as conditioned forms that give rise to belief, and the scriptures say that all things are true, such as thus, that is, the scriptures of the pure name of the Guangming Group, so the Guangming Group says that only thus exists, and the pure name says that worldlings are like herbs, such as Maitreya, and so are the afflictions.",
        "source": "X58n0995_006:0228c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二明寄惑至一十八門。",
        "translation": "The second section explains the 18 aspects of sending afflictions to 18.",
        "source": "X58n0995_006:0228c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此章大意但是寄惑之麤細顯位之淺深偏收經論差別之談與前約人實斷之全異也學者須知不可強執翻成矛盾此義他宗未之有也。",
        "translation": "The explanation is that the general idea of this chapter is simply to discuss the differences between the coarse and the fine aspects of the afflictions, the shallow and the deep aspects of the manifestation level, and the actual elimination of the aforementioned differences between the scriptures and the treatises. Students should know that they shouldn't forcibly attach to these contradictions, which are not shared by other schools.",
        "source": "X58n0995_006:0228c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一寄二障至論亦同此說。",
        "translation": "This is also true of the Treatise on the Two Hindrances of the One Mantra.",
        "source": "X58n0995_006:0228c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初標章謂分下顯義故梁攝論下據文此門之意但寄斷煩惱障顯地前為比觀所知障顯地上證觀言惑智二障者即煩惱所知也據文可解。",
        "translation": "He explained that the first section of the chapter refers to the meaning of the section below, so the Liang Translation of the Compendium of the Great Vehicle according to the text only refers to the cutting of the afflictive hindrances before the manifestation stage as the comparative view of the cognitive hindrances and the realization of the contemplation on the manifestation stage, saying that the two hindrances of afflictive and cognitive are also understandable according to the text.",
        "source": "X58n0995_006:0228c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二寄皮等至斷心煩惱。",
        "translation": "Second, he sends skins and so forth to cut off the afflictions of the mind.",
        "source": "X58n0995_006:0228c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初標法喻二引文釋成謂寄法喻三惑以顯三祇三位之淺深謂初僧祇從三賢至初地麤故如皮二僧祇從二地至八地細故如肉三僧祇從八地至地盡至細故如心皆言煩惱者約通相喧動故也。",
        "translation": "The explanation is that the first refers to the metaphor of the Dharma and the second cites the text to explain its formation, which is to send a metaphor of the three disturbances to show the shallowness and depth of the three divisions of saṃgha, meaning that the first saṃgha goes from the third level of wisdom to the first level of coarseness, like skin, the second saṃgha goes from the second level to the eighth level of fineness, like meat, and the third saṃgha goes from the eighth level to the end of the level of fineness, like mind.",
        "source": "X58n0995_006:0228c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三以此三惑至出心除心等。",
        "translation": "Third, these three mental disturbances reach the point where the mind is removed and so forth.",
        "source": "X58n0995_006:0229a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰每地三心難見優劣故寄此三煩惱以顯之如梁攝下據文言三十三僧祇者後開等覺共十一地每地三心故成三十三也。",
        "translation": "He explained that it's difficult to see the superiority and inferiority of each of the three mental states, so he sends these three afflictions to show them as Liang collects the following according to the text: thirty-three incalculable eons, which later reveal a total of eleven stages of virtual enlightenment, and three mental states for each stage, so they become thirty-three.",
        "source": "X58n0995_006:0229a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四以二障至地上及佛地。",
        "translation": "Fourth, he uses the two hindrances to reach the ground and the Buddha stage.",
        "source": "X58n0995_006:0229a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰標章據文示位可知。",
        "translation": "The explanation says that the banner shows the stages according to the text.",
        "source": "X58n0995_006:0229a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五以染心至是賴耶識。",
        "translation": "The fifth takes the defiled mind up to the laya consciousness.",
        "source": "X58n0995_006:0229a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初標義二據文三解釋言染心麤細者六七八識之別寄於三位者地前地上金剛後心以顯三身者化報法之三身謂地前約事識第六識盡得現化身三類之異地上約末那七識盡得現報身今言應者即是報故應字平呼故真諦名報身為應身與法身相應故或但去呼以應十地故地盡約賴耶八識盡得現法身以遠離微細念故餘如文解。",
        "translation": "The explanation says that the first is to label the meaning, the second is to refer to the text, and the third is to explain that the defiled mind is coarse and subtle, which are the distinctions between the sixth, seven, and eight consciousnesses, and that the three bodies are manifested by the three bodies of transformation, retribution, and dharma, which are the three kinds of manifestation and the three kinds of difference between the sixth consciousness and the phenomenal consciousness, and the seven manas, which are the manifestation of the retribution body.",
        "source": "X58n0995_006:0229a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六寄於三障至能顯法身。",
        "translation": "Sixth, he focuses on the three hindrances to the point where he can reveal the Dharma body.",
        "source": "X58n0995_006:0229a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰煩惱障菩提故清淨而顯應身結業障解脫故清淨而顯化身智障隱法身故清淨而能顯現。",
        "translation": "The explanation says that the afflictive hindrances to enlightenment are purified and reveal the response body, the karmic hindrances to liberation are purified and reveal the transformation body, and the intellectual hindrances to the hidden Dharma body are purified and can manifest it.",
        "source": "X58n0995_006:0229a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七以迷三性至真如修令淨故。",
        "translation": "Seven, it's because he's deluded about the three natures and has cultivated true reality that it's purified.",
        "source": "X58n0995_006:0229a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初標義二據經三解釋於據經中一切凡夫下指迷何者下徵列如是下示悟一返二順言三者成就相者則是圓成實謂圓滿成就故餘如文解。",
        "translation": "He explained that first, he identified the meaning, second, he relied on the sūtras, and third, he explained that according to the sūtras, all worldlings are deluded, and second, they are listed, and second, they are enlightened, and third, they are accomplished, which means perfectly accomplished.",
        "source": "X58n0995_006:0229a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八寄四障至金輪王報。",
        "translation": "The eighth one refers to the four hindrances up to the golden wheel king's retribution.",
        "source": "X58n0995_006:0229b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰以約使現四障寄顯十信三賢四位四行四因四報之異皆滅障顯位依位成行依行為因依因感報謂障之與位歒體相翻行之與因因之與德至順善成唯四報輪王寄顯攝化之優劣耳。",
        "translation": "Explanation: The difference between the ten faiths, three virtues, four stages, four practices, four causes, and four rewards is that the elimination of hindrances reveals the stages, the formation of practices based on the stages, the causes based on the practices, and the rewards based on the causes that bring about the retribution of the hindrances and the stages.",
        "source": "X58n0995_006:0229b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又翻前四障至故名佛子也。",
        "translation": "Also overturn the four previous hindrances to so called the son of the Buddha.",
        "source": "X58n0995_006:0229b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初標翻初障下釋成四義有法有喻言種子如父者傳體相續故般若母者交搆資成故初地已上諸佛家故者紹隆佛種是其真子非同小外之子也。",
        "translation": "The explanation is that the first marker over the first hindrance under the explanation into four meanings there are dharmas and metaphors that say seeds such as the father who transmits the essence of continuity, therefore Prajñāpāramitā, the mother who interlocks the formation of the first ground and upwards of the buddha family, therefore, Shaolong Buddha seeds are their true sons and not the same as lesser external sons.",
        "source": "X58n0995_006:0229b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此四種至四義應知。",
        "translation": "These four kinds of unity should be understood up to the four meanings.",
        "source": "X58n0995_006:0229b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰又此四種和合者謂四行之相應故悲智雙運能轉生死而至菩提故云如車輪能運能轉至解脫處如處如聖王輪下將車之四事以配四行可以意會亦共成運動之義也思之。",
        "translation": "釋曰又此四種和合者謂四行之相應故悲智雙運能轉生死而至菩提故云如車輪能運能轉至解脫處如處如聖王輪下將車之四事以配四行可以意會亦共成運動之義也思之。",
        "source": "X58n0995_006:0229b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第二以四障至常德無有生死。",
        "translation": "Second, the four hindrances lead to the eternal virtue of nonexistence of birth and death.",
        "source": "X58n0995_006:0229b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此終教地上除習以顯四位等殊謂初之三地滅闡提習寄同世間正受法性性淨成德報滅因緣仍受變易二四五六地滅外道不正之智寄同二乘定為德本德現無方敺和利樂報除方使生死三七八九地滅二乘怖畏之習寄同大乘至順護偏以為三昧定成顯德八苦不拘報除死生細中之細故云有有四十地至佛地已還滅獨覺捨大悲習果滿因圓一切究竟堅固以為正定定成顯德寂然不動報無餘惑故云無有生死。",
        "translation": "The explanation is that this final teaching ground removes accumulation to show the distinction between the four levels, meaning that the first three grounds eliminate icchantika accumulation and send it to the same worldly level where the nature of the true feeling is purified by the nature of reality and becomes virtuous when the retribution ceases and the causes and conditions remain subject to change.",
        "source": "X58n0995_006:0229b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四德圓故至攝論等說。",
        "translation": "Because the four virtues are complete, it's explained in the Summary of Discourses and so forth.",
        "source": "X58n0995_006:0229c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初解第四生死此上下指所據經論也。",
        "translation": "The explanation says that the first explains the fourth birth-and-death up and down here refers to the sūtras and śāstras on which they're based.",
        "source": "X58n0995_006:0229c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此四中至亦誠證也。",
        "translation": "These four virtues are also sincerely realized.",
        "source": "X58n0995_006:0229c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰料揀惑次正使下通揀八位仍證上文約人實斷中終教二惑之義也。",
        "translation": "He explained that they sort out the confusion, then correctly cause the following to sort out the eight stages in general and still confirm the meaning of the two confusions in the final teaching that were actually ended in the above passage.",
        "source": "X58n0995_006:0229c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九於十地中至是出世故。",
        "translation": "The nine attainers of the ten stages are world-transcendents.",
        "source": "X58n0995_006:0229c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此中寄正使習氣世間出世間以顯十地之別此且約凡夫之一分也。",
        "translation": "Explanation: Here, he's referring to the proper conditioning karmic impressions that are mundane and supramundane to show the distinction between the ten stages, which is also about one part of being a worldling.",
        "source": "X58n0995_006:0229c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故十地經至先已除斷。",
        "translation": "Therefore, the sūtra on the ten stages arrives at the point where it's been removed.",
        "source": "X58n0995_006:0229c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰三界正使此地齊除證成初義皆言微薄者更有微習證成次義初義者前三地次義者四地已去。",
        "translation": "The explanation says that the three realms are here, where the correct tendencies are all removed and the initial meaning realized, and the one who says it's slight has subtle habits that are realized in a secondary meaning.",
        "source": "X58n0995_006:0229c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "地論釋曰至故云同也。",
        "translation": "The explanation of the Discourse on the Bhūmis says that it's the same because it reaches the fourth ground.",
        "source": "X58n0995_006:0229c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初是世親釋前地經解云下大師却釋論義分其二障種習也。",
        "translation": "He explained that the first was Shippin's explanation of the previous stage, which was explained in the sutra, but the next was the great teacher's explanation of the treatise's meaning, which divided it into two hindrances and various kinds of accumulation.",
        "source": "X58n0995_006:0229c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故當知至約終教說。",
        "translation": "Therefore, it should be understood that the explanation arriving at the final teaching is approximately the same.",
        "source": "X58n0995_006:0229c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰近結此門遠結前九言多分者有通始教故。",
        "translation": "He explained that the proximate conclusion of this teaching and the distant conclusion of the prior nine say that there are many parts of the teaching that go through to the beginning.",
        "source": "X58n0995_006:0229c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十又於十地至心習煩惱。",
        "translation": "Ten furthermore, at the tenth ground, there's the affliction of mental conditioning.",
        "source": "X58n0995_006:0229c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰言又於十地別相中者牒前分地於出世間分其大小之二位也所寄惑相本文次釋云。",
        "translation": "The explanation says that when it comes to the distinctive characteristics of the ten stages, it refers to the two stages of the former stages that are greater and lesser than the one in the supramundane realm, and the characteristics of the afflictions that are referenced in this article.",
        "source": "X58n0995_006:0229c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "解云以三地至以顯彼位也。",
        "translation": "It's explained that he'll use the three stages to reach them in order to show their status.",
        "source": "X58n0995_006:0230a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰七地已還猶同煩惱正使八地已上方論習氣無明。",
        "translation": "The explanation says that after the seventh ground, he's still the same as the afflictions and afflictions proper, and after the eighth ground, he's still ignorant of the accumulated tendencies above.",
        "source": "X58n0995_006:0230a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十一於此菩薩至二習無明故。",
        "translation": "After the eleventh ground, the bodhisattva arrives at the ignorance of two kinds of accumulation.",
        "source": "X58n0995_006:0230a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰於此菩薩位中者牒前出世間中第二位也於此位中又分二位七地已還寄滅色心正使顯有功用未自在位八地已上寄滅微細習氣顯無功用於色自在也。",
        "translation": "It's explained that this bodhisattva's second stage in the previous stage of transcendence. Within this stage, there are two more stages: those who have returned from the seventh stage and are still focused on extinguishing form and mind, and those who are correctly motivated to show that they have effort and are not yet self-possessed, and those who have risen from the eighth stage and are focused on extinguishing subtle karmic impressions to show that they have no effort and are self-possessed in form.",
        "source": "X58n0995_006:0230a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故本業經至無明滅盡。",
        "translation": "Therefore, the sutra on original karma reaches the point where ignorance ceases.",
        "source": "X58n0995_006:0230a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰七地已還二習果報滅無遺餘者謂與無漏相應超出世間故無果執八地色習無明盡者無現相也九地心習無明除者無轉相也十地二習無明者無業相也。",
        "translation": "It's explained that after the seventh ground, the effects of the two kinds of accumulation cease without remainder, which means that it's associated with the uncontaminated and transcends the world, so there's no attachment to results.",
        "source": "X58n0995_006:0230a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十二依三無性至故言不見。",
        "translation": "The twelfth ground relies on the three non-natures up to the point where they're said not to have been seen.",
        "source": "X58n0995_006:0230a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初立義二據文於立義中寄滅分別性以顯見道寄滅依他起性以顯修道次據文中見道言不得者故唯識云若時於所緣智都無所得爾時住唯識離二取相故則分別亡而無得也修道言不見者唯識云無得不思議是出世間智捨二麤重故使證得轉依由證轉依二無上果故言不見。",
        "translation": "Explanation: First, it establishes the meaning; second, it refers to the text in which the nature of discrimination is extinguished to show the path of seeing and the nature of dependent arising is extinguished to show the path of cultivation; second, it refers to the text in which the path of seeing is said to be unobtainable, so Consciousness-only says that if at that point in time there's no gain in any of the cognition of objects, then Consciousness-only abides free of the two acquired characteristics, then discrimination disappears and there's no gain.",
        "source": "X58n0995_006:0230a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十三依雜集至二位差別。",
        "translation": "Thirteen distinctions are made between the two levels based on the mixed set and the final stage.",
        "source": "X58n0995_006:0230a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰以分別煩惱寄顯見道以俱生煩惱寄顯修道既皆以煩惱麤細以顯二位故次問云。",
        "translation": "The explanation says that the path of seeing is revealed by discriminating afflictions, and the path of cultivation is revealed by co-arising afflictions.",
        "source": "X58n0995_006:0230a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以得知至非實斷者。",
        "translation": "\"How can we know that these are not really stopped?",
        "source": "X58n0995_006:0230a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰既屢言惑種兼對位次何故非斷故茲問也。",
        "translation": "The explanation says that since it's often said that the seeds of affliction are both counteracted by the stages, how is it not stopped? Therefore, he asks this question.",
        "source": "X58n0995_006:0230b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如分別我見至非入見道耶。",
        "translation": "\"Is it because of the view of discriminating self that it's not entering the path of seeing?",
        "source": "X58n0995_006:0230b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初顯邪見謂三緣分別如佛下明正教之凡初希佛道此人下約無邪非證以返質意成寄惑顯非是約人實斷也若是實斷此既無邪何不證入。",
        "translation": "The explanation says that the first thing that shows wrong views is that the three conditions are discriminated as buddhas, the second thing that shows the true teaching is that there's no wrongness and non-realization, and the second thing that shows the lack of fulfillment is that the confusion is not really stopped by the person concerned.",
        "source": "X58n0995_006:0230b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若言雖無至非入見者。",
        "translation": "If it's said that even though there's no such thing, it's not an entry view.",
        "source": "X58n0995_006:0230b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰彼又計云此中無邪之人不入見道為有邪種故故此牒之。",
        "translation": "The explanation says that they also imagine that a person lacking error won't enter the path of seeing because there are seeds of error, so they explain this.",
        "source": "X58n0995_006:0230b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既無現行至返以顯之。",
        "translation": "Since there's no present action, he goes back to show it.",
        "source": "X58n0995_006:0230b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰既無現行者縱計即應入資粮加行者約位以質義既下翻成寄顯也。",
        "translation": "The explanation says that since there's no present practice, even though it's calculated that someone should enter the stage of accumulation and applied practices, the meaning is lowered and translated into a consciousness that's clear.",
        "source": "X58n0995_006:0230b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又以任運至通二位斷之。",
        "translation": "He also uses the two levels of attainment and completion to cut it off.",
        "source": "X58n0995_006:0230b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰俱生細而難除故寄修道顯其差殊如實義下經而示之如末那下顯七識惑細故通見修二位以斷除。",
        "translation": "He explained that co-production is subtle and difficult to remove, so he consults cultivation to show its differences as they are shown in the sutra below the true meaning, such as the manas below, which shows that the seven delusions of consciousness are subtle and therefore are eliminated by going through the two stages of seeing and cultivating.",
        "source": "X58n0995_006:0230b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如無相論至故得知也。",
        "translation": "As in the Signless Treatise, it's understood because it reaches.",
        "source": "X58n0995_006:0230b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰第二執識等者謂末那執第八故故言執識此識惑細故至羅漢方得斷盡亦可通六識俱生對其分別故言第二執識言若見識肉煩惱等者謂見道緣真得出世道十六心時者八忍八智此時斷盡但是分別正使餘殘未盡但是思惟者即是俱生末那故云是第二識無性下指同說也。",
        "translation": "He explained that the second consciousness-attaching consciousness means that the manas attach to the eighth consciousness and therefore speak of consciousness-attaching consciousness because the delusion of this consciousness is subtle and can only be ended when the arhat arrives and the six consciousnesses are concomitantly produced and discriminated, so he speaks of the second consciousness-attaching consciousness.",
        "source": "X58n0995_006:0230b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十四於分別至迴心二乘說。",
        "translation": "Fourteen discriminations that lead to a return to mind are explained by the two vehicles.",
        "source": "X58n0995_006:0230b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰將分別三緣寄顯三賢謂十解等除邪師等如次應知者更等十行除邪教十迴向除邪思惟此約直進說者結上三賢菩薩又以下約引攝二乘迴心教說故地前約伏也。",
        "translation": "He explained that he would discriminate three conditions and refer them to the three stages of goodness, which are the ten liberations and so forth that remove wrong teachers and so forth, and the other ten practices that remove wrong teachings and ten dedications of merit that remove wrong contemplations. This is about the direct advancement of the bodhisattva who concluded the above three stages of goodness, and the following is about the teaching that leads to the convergence of the two vehicles and the teaching that returns to mind, so the prior stage is about suppression.",
        "source": "X58n0995_006:0230c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十五於俱生至故作此說。",
        "translation": "Fifteen [stages of] co-arising up to the present time are therefore explained here.",
        "source": "X58n0995_006:0230c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰俱生六七約現行寄顯七地已還觀心有間俱生永伏寄顯八地已上無為相續此上二門都從十三中分別俱生來而更開此寄顯也。",
        "translation": "He explained that the sixth and seventh stages of co-arising are contingent on the manifestation of the present, and after the seventh stage, he'll return to contemplation of the mind, observe the interstices of co-arising, permanently subdue, and send out manifestations of the continuity of nonexistence from the eighth stage onward.",
        "source": "X58n0995_006:0230c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十六又以至作此說也。",
        "translation": "These sixteen furthermore are explained as follows.",
        "source": "X58n0995_006:0230c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初約惑寄顯此亦下示凡小大乘可知。",
        "translation": "He explains that first, he refers to the manifestation of mental disturbances, and then he shows that this is the lesser and greater vehicle.",
        "source": "X58n0995_006:0230c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十七為顯至返寄顯之。",
        "translation": "Seventeen is the point of revealing and returning to reveal them.",
        "source": "X58n0995_006:0230c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰每地斷一障終至佛地故成十一正當深密十一種麤重也。",
        "translation": "The explanation says that each stage removes one hindrance and eventually reaches the buddha stage, so it becomes 11 correct, profound, and 11 kinds of debilitation.",
        "source": "X58n0995_006:0230c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十八為顯至知寄顯也。",
        "translation": "Eighteen are manifest until they are known and sent back to be manifested.",
        "source": "X58n0995_006:0230c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰前門顯諸地之差故寄麤重此門顯真俗之異故寄諸愚如深密下引經雙證二門或曰法相大乘以此麤重正為斷證何以此中却為寄顯答據彼云斷今此帶實指權但是安立何以故有教無人故阿含施設故。",
        "translation": "He explained that the previous approach shows the difference between the stages and therefore sends the debilitating hindrances, and this approach shows the difference between real and conventional and therefore sends the folly of the two approaches as profoundly described in the sutra below.",
        "source": "X58n0995_006:0230c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此諸義廣如至準思可見。",
        "translation": "These various meanings are as broad as they are accurate to consider.",
        "source": "X58n0995_006:0230c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初約教門正結何以下徵釋所以意顯入證之甚深識情難造若不顯之將為絕分故茲寄顯意有三焉一護十地二離慢心三令生信。",
        "translation": "Explanation: First, we'll discuss the doctrinal approach and correctly conclude why, and then we'll explain why we mean to reveal the profundity of the awakening and the difficulty of creating consciousnesses that would be cut off if we didn't reveal them.",
        "source": "X58n0995_006:0230c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依頓教至及與不斷。",
        "translation": "If we rely on the sudden teaching, we'll attain and maintain continuity.",
        "source": "X58n0995_006:0230c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰此教惑本空而性本顯更不可擬議斷與不斷縱說一念即無念也。",
        "translation": "The explanation is that this teaching teaches that the afflictions are inherently empty and the nature is inherently manifest, so it's impossible to propose stopping and not stopping even though it's said that a single thought is no thought.",
        "source": "X58n0995_006:0231a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如法界體性至文證之準知。",
        "translation": "It's accurate to understand the essence of the Dharma realm from the perspective of the textual evidence.",
        "source": "X58n0995_006:0231a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初佛問發心文殊下以義頓酬故見即是道歇即真趣故佛頂云歇即菩提不從人得。",
        "translation": "The explanation is that the first Buddha asked about the arousal of mind, Wenshu, and the next one paid off immediately with the meaning, so seeing is the path, resting is the true destination, so the Buddha's summit cloud rests that enlightenment is not obtained from people.",
        "source": "X58n0995_006:0231a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若依圓教至一切斷也。",
        "translation": "If we rely on the perfect teaching, we'll reach the point where everything is stopped.",
        "source": "X58n0995_006:0231a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰初明惑性本融故不可說其體性等以所障下彰不如是知義分能所雖分能所真妄亦以議徹故云彼能障惑亦如是也是故下據本融以頓證頓斷也。",
        "translation": "He explained that first, he clarified that the nature of affliction is originally fused, so its essence can't be explained, and so forth, in order to manifest the meaning of not knowing the opposite, even though it's divided into subject and object, true and false, so he discussed and penetrated it, saying that the afflictions that are able to hinder are also like this.",
        "source": "X58n0995_006:0231a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故普賢品至是此義也。",
        "translation": "Therefore, this is the meaning of the Chapter of Samantabhadra.",
        "source": "X58n0995_006:0231a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰引文雙證圓障圓除也。",
        "translation": "The explanation says that the quoted passage both proves that the hindrances are completely removed.",
        "source": "X58n0995_006:0231a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又此斷惑至廣如經說。",
        "translation": "Furthermore, this is the point of cutting off afflictions as explained in the sūtras.",
        "source": "X58n0995_006:0231a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰四義料揀前三雖一斷一切斷猶約寄乘第四約本教故說法如此也此義請思。",
        "translation": "He explained that the four meanings are sorted out from the first three, even though they are cut in one way and all are cut in another, and the fourth is explained in this way because it's based on the original teaching.",
        "source": "X58n0995_006:0231a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又前三乘至此約別教言。",
        "translation": "From the first three vehicles up to this point, it's said to be specific to the teaching.",
        "source": "X58n0995_006:0231a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰全揀教宗也由全揀故緣起即成性起故即入此教若乃不壞行布即是三乘等也。",
        "translation": "He explained that the doctrine of complete selection is also the doctrine that because of complete selection, conditioned arising is formed, and the nature arises, that's how to enter this teaching, and if that's the case, the practice of indestructibility is disseminated, which is the three vehicles.",
        "source": "X58n0995_006:0231a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若約攝方便至斷惑門竟。",
        "translation": "From the perspective of gathering skillful means to the end of the gate of cutting off mental disturbances, the explanation says it's a comprehensive collection of doctrines.",
        "source": "X58n0995_006:0231a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋曰全收諸教宗也由全收故方使同歸以是下明本末融會例餘通結。",
        "translation": "He explained that the doctrine of collecting all the teachings also collects them all, so it's possible to return to them all together and thus the following explains the integration of the past and the future with the rest of the examples.",
        "source": "X58n0995_006:0231a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "華嚴一乘分齊章義苑疏卷第六",
        "translation": "Huayan yisheng fenqi zhang yiyuan shou, vol. 6",
        "source": "X58n0995_006:0231a23_0",
        "is_bad_quality": false
    }
]