[
    {
        "source_sentence": "夾註釋門歸敬儀序",
        "translation": "Preface to the Commentary on the Śrīmālādevīsiṃhanāda Ritual",
        "source": "X59n1095_001:0450a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋門歸敬儀者真俗歸敬之洪範事理觀行之繩墨也所以歷代重之以為龜鑒也然今時不熾行之何也想其文義高奇而消解尤難也似蚊咬鐵牛終無所得故淺識庸流不甚潤如矣在昔蕭山然律師製科文竝通真記三卷探頤顯隱然而其書也傳寫誤夥文理紛焉慕學之徒莫不憾焉茲有洛北朝日山比丘慧門光公者是律苑之翹楚也每見古典尊唱往哲補垂磨滅者非一二荷法志願蔽乎盡際適得通真記善本躍然而薌拜讐閱而糾謬翫味往復附記本文下標科厥上錄為三卷傍施和訓以便後學殺青既竟屬余為序余雖恐效顰之謗不可不隨喜焉見善而不揚吾佛之所制也儒門之君子亦誡焉繇旃率贅鄙辭云爾。",
        "translation": "The Śrīmāṇasūtra is a flood plaque of true and secular reverence, a cord of observing the principles of phenomena and practice, and so it has been valued for generations as a tortoise's guide, but nowadays it is not practiced with fervor. Why is it so difficult to decipher the meaning of its text, which is high and strange, like a mosquito biting an iron bull that never gets anything, and so it is not well nourished by the vulgar stream of knowledge? In the past, the master Xiao Shan Ran produced a three-volume record of the Tongzhen kowan, which was apparent and elusive, yet his books were also misrepresented, the text and principles were mixed, and the admirers of the discipline did not regret it.",
        "source": "X59n1095_001:0450a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "旹元祿己巳覺皇成道日於洛西密嚴道場不肖比丘玅辨雅謹識新刻夾註釋門歸敬儀序釋門歸敬儀者吾祖南山徵照大師之所製也其為書也文高而理淵言簡而義博匪是所以淺學膚受之士可追精究者也有永嘉起律師著護法記二卷以闢其幽隱惜乎學者欲覩其完書未之得也寔為缺典矣不空然尊者所撰之通真記三卷竝科文舊雖栞行文句參差寫誤絡繹讀者病諸予甞搜索數本讎挍同異其脫者補之餘者芟之譌者正之疑者詳之槩歸至當而后閱之數過掩卷熟思隋珠趙璧為天下之至寶苟韞匵而藏諸則人孰得而共之聿觀誦之暇自彊繫科本文之上會記厥下逐章排布萃作一書析為三卷顏曰夾註釋門歸敬儀鳩工鏤版式布遐方一日有客謂余曰了然律師撰述斯文光顯祖教其弘宗扶教之意至矣盡矣唯臻辨繞佛繞塔之方軌稟承真悟之義攘斥靈芝之說尤其甚矣然今公之汲汲焉弘揚斯文詎不擊其大節乎余曰吁子之言實其爾雖然通真之為作也其推徵解釋莫不提耳而告之指掌而示之若夫纔觀一件之麤譚總擲三軸之全書則焉異乎惡一莖之[禾*(截-隹+韭)]莠棄萬把之稻[禾*糞]哉矧又舉小疵而害大醇君子之所誡也子豈不聞夏后氏之璜不能無考明月之珠不能無類然而天下寶之者何也其小惡不足妨大美也後之覽斯書者不可不思書以為序。",
        "translation": "The new engraving of the preface of the Śrīmālādevīsiṃhan Zanzhao's book, which was produced by our patriarch Nanshan Zanzhao, is high in text and profound in principle, simple in speech, and broad in meaning, not something that a person of shallow learning and skin can pursue and delve into.",
        "source": "X59n1095_001:0450a17_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "旹",
        "translation": "in passing",
        "source": "X59n1095_001:0450c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "元祿二禩龍輯己巳僧自恣日芝苑後裔比丘慧門光熏盥題于朝日之華嚴丈室釋門歸敬儀通真記卷上(并序)大宋蕭山沙門釋　了然　述夫二諦同根三寶一性羣有昧茲而逐妄大雄由是以興慈開八正之玅門示一直之平道莫不靜諸見本顯自心源故前聖後贒咸宗斯軌釋門歸敬儀者吾祖澄照律師之作也師窮三學之玅弘一性之宗審歸敬為至道之良津真俗乃觀行之樞要於是括三藏而廣陳敬法彰二空而圓顯淨心事理該明文義俱備了然忝霑慈潤獲奉遺言審慮竭愚輒申科釋文成三卷題曰通真庶乎通二諦之門顯一真之理後之作者無誚斐然云。",
        "translation": "On the day of the monk's confessional in Zhiguan, a descendant of the monk's family, Huimen Guangxuan's toilette was inscribed in the Huayan abbot's room in Chaoil on the occasion of the Śrīgupta Memorial Service's memorial (and preface), the Śrīgupta Master of Xiaoshan, Zhi Ran, stated that the two truths are of the same root, the three treasures are of the same nature, and all beings are obscured and driven away by delusion.",
        "source": "X59n1095_001:0450c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋門歸敬儀",
        "translation": "Explanation of the Rituals for Giving Respect to the Doctrine of the Gate",
        "source": "X59n1095_001:0451a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "題中五字通別簡辨凡有兩重一道俗對簡敬儀乃通釋門則別以禮敬儀軌俗所常行不標釋門則濫通無準然歸之一字俗禮未聞二局就釋教對簡餘文則釋門是通歸敬為別以淨厨誥等亦標釋門今題歸敬知下十篇非餘法也儀之一字通則可知釋者略梵語也具云釋迦此云能仁門者限其內外舉物以喻宗也歸謂歸依敬即恭敬迴轉等意如下自明儀者法也謂下十篇引教立儀楷模有則然此敬法通乎事理義在下文此宜先曉。",
        "translation": "The five words in the title are general, specific, and brief, but there are two levels: one is secular, the other is simple, and the other is respectful, which is the usual practice of the secular world.",
        "source": "X59n1095_001:0451a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "沙門釋道宣大唐龍朔元年於京師西明寺述。",
        "translation": "The ascetic Śākyamuni Daoxuan recounted the teaching at Ximing Temple in Beijing in the first year of Longshuo's reign.",
        "source": "X59n1095_001:0451a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述號中若據元本別有序題次安述號序文已後方是本題今為蠧損缺於序分故直顯本題以冠于首仍移述號以次安之沙門釋如常所聞道宣大師之法諱也行業功勳備如僧傳大唐者河東晉陽是唐虞舊封至李氏高祖神堯初受周封為唐國公至隋進爵為唐王入隋受恭帝禪位始號唐國臣庶尊之乃加大字龍朔即第三帝高宗之年號也京師者即長安是大唐所都之地公羊傳云京師者何即天子之居也京大也師眾也天子之居必以大眾之詞言之西明寺者長安兩街有八寺其一曰西明顯慶元年高宗為皇太子建也二年敕授西明寺上座大師懇辭不受敕遣鴻臚卿劉審躬往終南禮拜迎請送上此寺述作記處故此標之寺者嗣也謂治事者相嗣續於其內也國家有九寺焉因漢明帝永平十年佛法初到有摩騰法蘭二尊者以白馬駄經像屆于洛陽敕於鴻臚寺延禮之至十一年敕於雍門外別建寺以白馬為名即漢土佛寺之始自此伽藍因彰寺號述者劉勰云作者曰聖述者曰明大師示謙故不言作也。",
        "translation": "In the statement of the title, if the original text is based on a separate orderly title, then after the preface to the statement of the title, then the original title will be included in the preface, so the original title will be directly displayed to crown the first part, and the statement of the title will be moved to the next part.",
        "source": "X59n1095_001:0451a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬本教興一(謂佛化厥初禮儀莫識聖法乘時行斯謁敬所以廣引誡教為信首之初宗庶有不惑於教喻)。",
        "translation": "Respect for the origin of the teaching to flourish one (that is, the Buddha's transformation of the first rituals, Mo consciousness of the holy Dharma vehicle when practicing this respect so widely cited admonition teaching as the first school of faith, so that there is no confusion in the teaching metaphors).",
        "source": "X59n1095_001:0451b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "列篇目中前後注文不同者以前顯一篇大意後釋隨篇別目或可義同但詞有廣略爾初注中初四句通明敬本教興所下三句別顯今文引用之意乘猶登也機感相應故曰乘時謁者請也。",
        "translation": "The difference between the text of the previous and subsequent commentaries in the list of titles is that the first one shows the general idea of the first one, and the second one explains the meaning of the subsequent one in a separate title, or maybe it's the same but with a broad or abbreviated meaning. In the first commentary, the first four sentences generally explain the respect for the origin of the teaching and the rise of the second three sentences separately show the meaning of the present reference to the vehicle, which is like ascending, and the opportunity to sense the connection, so it's called the time when the visitor is invited.",
        "source": "X59n1095_001:0451b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濟時護法二(謂季俗根鈍非敬不弘故濟時機綜習惟遠遂使相從奔競上下相遵既不亂倫二寶由盛)。",
        "translation": "The second one is to help the people of the time and protect the Dharma (meaning that the faculties of the secular world are dull, and non-honoring doesn't lead to greater reverence; therefore, when the time comes, the opportunity to help is fully accumulated, yet far away, so that they are subordinate to each other, run up and down, and comply with each other without disrupting the relationship, and the two treasures are made to flourish).",
        "source": "X59n1095_001:0451c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次二注中初四句明濟時下四句顯護法綜習惟遠者相承無替也。",
        "translation": "In the next two notes, the first four phrases clarify when it's time to help, and the next four phrases show that the comprehensive study of Dharma protection is only as far away as possible, so that it's inherited without replacement.",
        "source": "X59n1095_001:0451c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因機立儀三(謂時涉澆淳情分利鈍致立教者開抑殊途或彼佛德高滅罪稱[宋-木+取]或此方本淨二業能明等)。",
        "translation": "The three rituals established based on the situation (that is, the time involves the outgoing and the simple, the discriminating and the dull, which leads to the establishment of a different path of teaching, or the Buddha's virtue is high, the extinction of sins is praised, or the two karmas in this direction are originally pure and can be explained, etc.).",
        "source": "X59n1095_001:0451c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次三注中初二句明機致下二句立教或下四句總顯因機立教所以澆淳乃時節之變利鈍乃機器之殊鈍者教以權方且脩事業曰抑利者令行理觀直趣上乘曰開抑塞也二業即真俗也。",
        "translation": "In the next three notes, the first two phrases clarify the opportunity, the next two phrases establish the teaching, or the next four phrases generally show that the establishment of the teaching is based on the opportunity, so the watery and simple is a change of season, the sharp and dull is a difference in machine, and the dull is taught with expediency and modifies the undertaking, which is called suppression.",
        "source": "X59n1095_001:0451c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乘心行事四(謂事在未亡因心行用約緣課業條流須識由心通三性事染六塵因福起罪莫知道業)。",
        "translation": "The vehicle mind acts in four ways (meaning that things in the future are caused by the mind acting in accordance with conditions, coursing through karma, and streams of consciousness, which are caused by the mind's ability to permeate the three natures, defile the six dusts, and cause merits to give rise to crimes that don't know about karma).",
        "source": "X59n1095_001:0451c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次四注中初四句總顯乘心行事由下四句別示罪福之相言事在者煩惱現行也因心行用者具縛凡夫未開智解隨所造業必假行成也。",
        "translation": "In the next four notes, the first four sentences generally show the activity of the vehicle mind, and the next four sentences specifically show the characteristics of sins and merits.",
        "source": "X59n1095_001:0451c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "寄緣真俗五(謂法被權道情投業理心形兩位指月雙筌或以鄙俗淺度不識分量罔冐人真實為沈俗)。",
        "translation": "The five (that is, the Dharma is conditioned by the expedient way, sentiments are cast into karma, principle, mind, form, two fingers, moon, and two chymns, or the vulgar and shallow don't know the difference and recklessly ignore the truth of the person as sinking into the vulgar).",
        "source": "X59n1095_001:0451c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次五注中初二句總明機教以顯事理法者能被之教情者所被之機機分利鈍故教開權道權以事攝道以理濟心下二句躡顯正行形心屬能行事理是所行身行事行猶於指也心通理觀猶於月也身心事理真俗竝馳故曰雙筌或下誡斥妄情約篇有三一唯著身事非於理解則失在執局二唯著心理廢於身事則失在罔冐三事理兩分真俗二路則失在隔別備見本篇。",
        "translation": "In the next five notes, the first two phrases summarize the teaching to show the principle and the phenomena. The Dharma is the teaching that can be applied, the feelings are the principle that's applied, and the ability is sharp and dull.",
        "source": "X59n1095_001:0451c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引教徵迹六(謂末法根鈍多封性習須引聖言以為教量今以四依檢行四印徵明無涉浮言飾詐斯絕)。",
        "translation": "Citing the teachings and describing the traces of the six (meaning that the dullness of the faculties of the latter half of the Dharma and the many close-knit habits require citing holy words as a measure of the teaching.)",
        "source": "X59n1095_001:0452a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次六注中初四句明鈍根難信須引誠教以表非虗今下四句正顯篇中引教徵事之理。",
        "translation": "The next six notes begin with four sentences that explain how difficult it is for dull faculties to believe and how sincere teaching must be cited to show that it's not false. The next four sentences now precisely show the principle of citing the teaching to describe the situation in the text.",
        "source": "X59n1095_001:0452a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約時科節七(謂心行等級勤惰不恒故立法撿心分時策行是知克念修聖斯言有歸不爾流溺還同無始)。",
        "translation": "There are seven sections that deal with time (meaning that the levels of mental functioning are diligent, lazy, and not constant, so the method of legislating collects the mind and curates its practices in stages.)",
        "source": "X59n1095_001:0452a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次七注中初四句示其篇意正顯約時後四句引俗勸脩意存無間。",
        "translation": "The next seven notes contain the first four phrases that show the meaning of the text and precisely express the time, and the last four phrases that refer to the secular world and encourage cultivation, with no gap in meaning.",
        "source": "X59n1095_001:0452a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "威儀有序八(謂敬相顯心虔誠有被今須引誠教具列容儀則容止若思言詞安定不以法繩則手足無所措矣)。",
        "translation": "The manner is ordered eight (meaning that reverence and respect are manifested in the mind, piety and sincerity are acquired, and now the sincere teaching must be introduced to complete the list of mannerisms, so that if one thinks, speaks, and stabilizes without using the Dharma rope, then there's nothing to do with the hands and feet).",
        "source": "X59n1095_001:0452a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次八注中初四句示威儀次二句明有序後二句結顯容止孝經云容止可觀若下六字出曲禮彼云儼若思安定詞。",
        "translation": "In the next eight notes, the first four sentences demonstrate manner, the next two sentences clarify order, and the last two sentences conclude with the manifestation of manner and demeanor.",
        "source": "X59n1095_001:0452a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "功用感通九(謂業假行成功由心起心懷染淨業亦真虗此由想見未清善惡交集不示緣報迷滯難明)。",
        "translation": "The nine sense-works (meaning that the success of nominal karma and practices arises from the mind, which harbors defiled and pure karma, but is also truly barren, which is due to perceptions and views that are not yet clear, and the confluence of good and evil that don't reveal the causes and effects, which are confused and difficult to understand).",
        "source": "X59n1095_001:0452a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次九注中初竝功用後二句示感通。",
        "translation": "The first of the next nine statements shows both their exertion and the second two statements show the penetration of perception.",
        "source": "X59n1095_001:0452a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "程器陳迹十(謂聽言觀行時俗罕依故立條例以清心路)。",
        "translation": "The tenth note refers to the time when listening to words and observing deeds is rarely relied upon by ordinary people, so ordinances are established to clear the path of the mind.",
        "source": "X59n1095_001:0452a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第十注中聽言觀行文出論語借以顯意謂聽其言而觀其行則少有如說而行者故不獲已托事興言豈直自貽將濟來學也。",
        "translation": "In the tenth note, listening to the words and observing the deeds is a way of expressing the meaning that if one listens to their words and observes their deeds, then there are few who practice as they've been taught, so they don't get to justify their actions by saying whether they're directly criticized by themselves or will help those who come to learn.",
        "source": "X59n1095_001:0452a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬本教興篇第一(謂興立敬本非正信而不弘無信必不興敬有敬必先懷言篇明信本敬隨後生故也)。",
        "translation": "Respect for the origin of the teachings and the rise of the title of the first chapter (meaning that the rise of the origin of respect is not correct faith and does not expand without faith it will not rise to respect and with respect it will be preceded by the words of the chapter that explains the origin of faith and respect subsequently arises).",
        "source": "X59n1095_001:0452a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋敬本教興篇篇名中敬即禮儀必由心起本字正詮於信信即是心由信為歸敬之本故云敬本教者賢聖被下之言興者發起因由之謂教興之意通別有殊備載本篇此不委示篇者戒疏云章品之佳名分段之別目流類均等義齊一也第者居也一者始也此既居先故稱第一(篇字已下復可例釋)注中初二句總明敬本教興次二句反覆推釋後二句結示篇意以敬非信而不成信非教而不立若然則信必因教而起教實為信而興注云興立敬本則教興之意可見也。",
        "translation": "In the explanation of the chapter on respecting the origin of the rise of the teaching, the title of the chapter on respecting the manner of worship must arise from the mind, and the word \"origin\" correctly explains that faith is the mind, and faith is the basis for returning to respect, so the meaning of respecting the origin of the teaching is that the worthy and noble are subordinated to the words \"rise\" and the causes and conditions that give rise to the meaning of the rise of the teaching are general, specific, and distinct, and are included in the commentary to the chapter on precepts, which states that the chapter is a good name for the segmentation of distinctive titles, the streams, categories, and meanings are all the same, and the first one resides and the first one begins.",
        "source": "X59n1095_001:0452b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "序曰自法王之利見也必以靜見為先故論云何處何時誰起此見一切諸見悉斷故文良證也。",
        "translation": "The preface says that since the Dharma king's view of benefit must be preceded by a still view, the treatise says where and when did this view arise, all views are completely eliminated, so the text is a good testament.",
        "source": "X59n1095_001:0452b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本文初段中序者敘也敘述敬本之宗要及教興之因由曰者辭也將明教本必假言通也(下去例同此解)初二句正敘上句指人下句示意法王是佛簡異世主故稱法王法華經云我為法王於法自在乘機出世故云利見周易乾卦二五兩爻皆云利見大人彼以聖君登寶必合時心此以能仁降靈宜應機感故待時而興適機而應羣生利見不亦宜乎故借儒經以明垂應言靜見者靜屬教主之心見乃眾生之病然見病雖多我見為本由凡夫無始依真起妄(無明)由妄計我(人我法我)由我起見(謂我見等五利使惑及斷常等六十二見)由見發毒(謂貪慢等五鈍使惑)由毒造業隨業受報輪轉無休是以世尊為靜此見故於最清淨法界流出正體智從正體智起後得智從後得智起大悲心從大悲心現應化身從應化身流出諸教謂三歸五戒諦緣度等種種法門雖事理偏圓任機而設原其本意皆為靜見同成佛道由未出世先建此心及後立言咸酬素願拔他病本暢我己懷故云必以靜見為先也故下次引證文出中論彼偈具云一切法空故世間常等見何處於何時誰起此諸見此偈顯諸見本空也又云瞿曇大聖主憐愍說是法悉斷一切見我今稽首禮此偈世尊設教令人靜見也。",
        "translation": "In the first paragraph of this article, the preface describes the doctrinal essentials of respect for the fundamentals and the causes of the rise of the teaching. The preface is also a statement that will clarify the teaching fundamentals and must be interpreted in provisional terms. (The following examples are the same as this explanation.) The first two sentences correctly describe the first sentence refers to people, and the second sentence indicates the meaning that the king of the Dharma is the Buddha, who is simply another lord of the world and is therefore called the king of the Dharma.",
        "source": "X59n1095_001:0452b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然則習熏日久取會無由事須立敬設儀開其信首之法附情約相顯於成化之功。",
        "translation": "However, after long years of practice and permeation, there's no way to get together, so it's necessary to establish reverence and set up rituals that reveal the method of faith and head of faith, attach to feelings and conventions, and reveal the merit of accomplishing transformation.",
        "source": "X59n1095_001:0452c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教興初科中初二句敘機迷習之一字即是無明無明力故起念熏習於本識藏成見慢種子無始至今經流長劫故云日久未遇良師不反性覺故曰取會無由事下四句明設教此即下文所立之法立敬者如本起初生竝三歸等法成立歸敬之本也設儀者如佛見瓶沙王經等示禮敬之正儀也由此敬儀始開物信故曰開信首也附情約相者如智論中位列敬相附彼凡聖道俗之情以教道初行事須立法用成化導之功也是知佛慈宏博法乳恩深憐其著我之徒開茲靜見之法母胎初降即顯化儀道果始成便立歸法今迴邪見使住正流初乃求他佛之冥加終則歸自心之本淨由斯引導畢至佛乘故知歸敬一法為入道之根本趣涅槃之極致也歸敬興意大略如斯。",
        "translation": "In the first two sentences of the first section of the teaching, the deluded word for accumulation is nescience, and the power of nescience causes the arising of mindfulness and permeation in the store of the original consciousness to form the seeds of conceit, beginninglessly and continuing through long eons.",
        "source": "X59n1095_001:0452c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然後肝膽塗地形骸摧折知宇宙之極尊則敬逾天屬(以父母生身也報施在於一生佛起法身也醻遠終於累劫或功高難賞德深不謝慧深益厚非醻所及也)曉教義之遠大則道越常途(以七略被時立身立國之政淪歷於三有也八藏所宗亡空絕有之法畢超於九居也)。",
        "translation": "Then, his liver and bile are coated with the earth, his physical body is broken, and he knows the supreme dignity of the universe, and then he honors those who are more than subordinates of the gods (because his parents' birth body is also the reward given to him during his lifetime, the Buddha's birth body is also the Dharma body, his pāramitā is distant and ends in many eons, or his merits are high and difficult to appreciate, his virtues are deep and unexpreciated, and his wisdom is deep and beneficial, beyond the reach of the pāramitā).",
        "source": "X59n1095_001:0453a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科初二句顯能敬誠慇肝膽塗地表情之切也形骸摧折節身之至也知下四句示所歸道大初二句見佛起敬次二句聞法悟道初中十方三世唯佛特尊故曰宇宙極尊天屬是父以父比佛佛德更高既知境尊敬宜倍父故云敬逾天屬言宇宙者郭象云天地四方曰宇往古來今由宙注中前二句明父母德淺生我色身功止一世雖云恩重而實可酬故云報施等佛下二句顯聖主德高起我法身功超累劫其恩罔極其德難酬故云酬遠等或下四句示佛德深之相三祇積行謂之功萬行所成謂之德慧深照理玅盡覺源故益厚利物度生無極故不賞語出漢書蒯通說韓信云足下挾不賞之功等次下曉謂開悟教是能詮義即所詮文義所詮意存出有故曰遠大因聞開悟道證無生故云道越常途道即三乘所證之道也注中初三句示世法常途後三句明佛教遠大初言七略者輯略(輯音集即諸書總要)兵書略六藝略(禮樂射御書數)諸子略詩賦略術數略方技略斯竝立身立國之異謀然非出有之至道故曰淪歷三有次言八藏者三藏加雜大小各四也亡空有者顯中道故超九居者出三界故九居即三界分九地也問所敬三寶何不言僧答聞法開悟誰曰非僧。",
        "translation": "In the second section, the first two phrases show that the respect and sincerity of the person, the expression of the sincerity of the liver and bile, and the physical destruction and fracture of the body are the ultimate goal. The first two phrases show that the noble lord's virtue is high, and the second two phrases show that hearing the teaching and awakening to the path is the only thing that honors the Buddha in the ten directions and three times.",
        "source": "X59n1095_001:0453a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀斯以言則識形心兩途事理雙軌。",
        "translation": "Viewing this, he said that consciousness, form, and mind are two paths, and things and principles are two separate tracks.",
        "source": "X59n1095_001:0453b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "總陳教意舉總要中初科初句躡上生起觀者詳覧之謂能觀在於大師斯者指法之辭所觀屬乎聖教此指前科見佛聞法身心行事開悟正理即本此教以述今文故舉大綱令知宗要則下正舉初舉形心示能敬也次舉事理明所行也能行色心依正二位雖曰兩途所行事理真俗竝運故曰雙軌雙二合也軌車迹也此四者實一部之大宗即唯識之正觀也然事理兩行通能及所若約所行禮佛誦經等名事福也觀法無我等名理觀也若就能敬色心二報一往配屬身事心理此乃常俗所談至理而求實乖圓觀略見下科委如第五。",
        "translation": "In the first section, the first phrase tiptoes up to the essence of the teaching and gives rise to the observation that the observer is the teacher who refers to the words of the teaching, and the observation belongs to the noble teaching, which refers to the prior section that seeing the Buddha, hearing the teaching, acting in body and mind, and awakening to the right principle are based on this teaching in order to explain the present text, so the outline is given so that the essentials of the proposition can be understood in the following section.",
        "source": "X59n1095_001:0453b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "形則縛於俗習苦陰常纏故當折挫以歸依剖析剖析觀其慢惑也。",
        "translation": "Their forms are bound to conventional habits, and the aggregate of suffering is always tethered; therefore, they should be frustrated in order to take refuge in analysis, analysis, and contemplation of their conceit and mental disturbances.",
        "source": "X59n1095_001:0453b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "圓配中初科初二句示過患形即是身本唯識有業惑所牽故縛於俗習報屬苦果故苦陰常纏報此為實計有我人即遍計性故下次出對治初以事治折挫謂息於慢情歸依謂尊他勝境故下文云謂此形儀本唯識有迷於本習妄見我人故須徵研令行敬養令見我身俯仰上下唯塵生滅來往屈伸此隨俗也剖下次以理治剖析二字即是觀法觀行脩捨故重言之觀慢惑者以智破障知身無我即翻遍計成無相性下文云重觀此身但塵非我妄謂我所能有行敬據此一理名通真也。",
        "translation": "The first two phrases of the first section in the perfect match show the faults and distress of the form that is the body originally only consciousness has karmic and afflictive forces, so it's bound to worldly habits and the retribution belongs to the painful fruit, so the painful aggregates are always tangled up with the retribution of this being the real imaginary self and person that is the nature of pervasive imagination.",
        "source": "X59n1095_001:0453b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "心則封於迷倒倒在生常故須鏡生滅以懲之追想追想知其妄著也。",
        "translation": "The mind then is sealed in delusion and inverted in birth and permanence, so it must be disciplined by mirroring birth and extinction in order to trace thoughts and trace perceptions to know its deluded attachment.",
        "source": "X59n1095_001:0453c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次心中初二句示過心即妄識體本真理違真起念謂之迷逐念攀緣謂之倒迷倒所纏習俗難改故曰生常亦遍計性故下次出對治初以事治鏡取照義照察此心性本無念念起成妄妄故生滅欲止生滅無如息念故曰懲之懲即止也故下文云真本非心今隨心起名隨俗也追下次以理治追想二字即是觀法追即隨也想即念也念起即知隨念隨覺隨捨以至無念故重言之知妄著者以智破惑惑亡念靜即翻遍計成無相性故下文云知真非心名通真也起信論云推求五陰色之與心六塵境界畢竟無念以心無相十方求之終不可得等問形心各有境智真俗兩分豈曰竝觀同成唯識答行布四門圓融一觀善須思之問折色求空觀法無我教屬小乘豈通圓觀答如後正觀委明問慢惑妄著同異如何答惑體是同無非集諦但慢相高倨故就身論究其集因實皆心惑。",
        "translation": "Next, in the mind, the first two phrases show that the mind is deluded, the essence of consciousness, and the truth is contradicted by true mindfulness, which is called delusion, and by mindfulness, which is called fallacy, delusion, habits, and conventionality that are tied up in habituation, and which are difficult to change, so it's called birth-and-permanence, and the nature of the mind is originally without mindfulness, mindfulness arises into delusion, so birth-and-permanence desires to stop birth-and-permanence without breath, so it's called punishment, and punishment means stopping.",
        "source": "X59n1095_001:0453c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "深惟四山恒逼非念念而莫知切於身也八倒纏綿非新新而不曉節於心也。",
        "translation": "He deeply believes that the four mountains are constantly oppressed unless he's mindful and doesn't know how to cut himself off and the eight errors are entangled unless he's new and doesn't understand how to control his mind.",
        "source": "X59n1095_001:0453c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "徵推中初科初三句警身八下三句警心竝以初句示過患次句勸對治後句結囑四山即生老病死涅槃經云我昔告波斯匿王云大王有親信人從四方來各作是言有四大山從四方來欲害人民王若聞者當設何計乃至我說即是生老病死常來切人等八倒即凡夫二乘各具四倒二四合言故曰八也以凡夫外道於心計常於受計樂於法計我於身計淨是謂無常計常等為四倒也故佛以四念處觀治之謂觀心無常觀受是苦觀法無我觀身不淨二乘之人執此為極佛於最後了義教中顯以四德令成佛道則知法身不滅是為真常涅槃寂靜是為真樂身心不二是為真我本性無垢是為真淨方顯二乘常計無常猶屬四倒非字義當為不念念新新竝目觀行切謂激切節謂誡勵。",
        "translation": "The first three sentences warn the body, the next three warn the mind, and together the first sentence shows the faults, the second sentence encourages correction, and the last sentence concludes with a statement that the four mountains are birth, old age, illness, and death. The Nirvana Sutra says that I once told King Prasenajit, \"Great king, there are faithful people from the four directions who each say this, 'There are four great mountains coming from the four directions that want to harm the people.' If the king hears this, what plan will he devise?\" Even I say that birth, old age, illness, and death are always present to cut off the eight errors of people, which are the four errors of the worldling and two vehicles, and the two and four together are called eight.",
        "source": "X59n1095_001:0454a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以剖析靜於慢惑非愛斷者所欣追想厭於妄著是異生者所背。",
        "translation": "Therefore, analyzing, calming, and analyzing the mental disturbances of conceit are not the delight of those whose craving is stopped, and pursuing thoughts and becoming disillusioned with deluded attachments are the backing of those who are unenlightened.",
        "source": "X59n1095_001:0454a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次中初二句重示身觀顯非外道所行後二句重示心觀顯非凡愚所樂愛斷乃外道之計異生即凡夫之性外道計於我宰多起憍慢今既靜慢故非所忻凡夫封於情見多生妄著今既厭著故是所背又可凡夫外道映互其人非忻是背左右其言。",
        "translation": "The first two phrases in the next section focus on the body as an observation to show that it's not something practiced by non-Buddhists, and the second phrase focuses on the mind as an observation to show that what non-Buddhists delight in is the ascetic's conception of worldlings as the nature of mortals.",
        "source": "X59n1095_001:0454a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "固當撫攬誠教以法糺徵則生身不徒委於下塵無識不徒生於上趣矣。",
        "translation": "If you firmly embrace the sincere teaching and use the Dharma to teach, the body that arises won't be in vain in the lower realms, and the absence of consciousness won't be in vain in the upper destinies.",
        "source": "X59n1095_001:0454a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示勸攬教中攬誠教者發正解故以法徵者起正行故糺督責也徵證明也則下示功益初句有智脩敬則不虗喪人身次句無智不脩則不空生上界下塵惡道也喻出涅槃文如下引無識謂無出道之智識也。",
        "translation": "Showing the exhortation to embrace the sincere teaching, he arouses right understanding and therefore initiates right practice with the method of taxation, so he tries to supervise and proves it. The first sentence shows the merits of having wisdom and reverence, so he doesn't lose his life. The second sentence shows that lacking wisdom and reverence, he isn't born in the upper realms or lower dust and evil destinies, which are metaphors for emerging from nirvāṇa.",
        "source": "X59n1095_001:0454b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敢序斯致引文證之。",
        "translation": "I dare to preface this by citing the text to prove it.",
        "source": "X59n1095_001:0454b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "小乘論云敬者以慚為體也由我德薄前境尊高故行敬也今反無慚不恥深可笑也大乘論云由信及智故敬於彼信故非邪智故興敬。",
        "translation": "The lesser vehicle treatise says that reverence is based on conscience as its essence, and it's because my virtue is weak and the prior object is exalted that I practice reverence. The present objection is that lacking conscience is not shameful and profoundly ridiculous, and the greater vehicle treatise says that reverence is based on faith and wisdom.",
        "source": "X59n1095_001:0454b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引文明敬本初科初小論通標義該諸部初句標定由下示意然諸小論未見明出敬體之文唯心所法中慚之一法意云於有德其心謙下崇重賢善為性即是此中前境尊高之義推敬由慚慚即敬體今下反責大乘論者亦是通指不具引文準百法等論善十一中有信一法別境之五中則有勝解勝解即智二皆心所彼疏釋云何者為信謂於實德深忍樂欲心淨為性信有三種一種實有謂於諸法實事理中深信忍故二信有德謂於三寶真淨德中深信樂故三信有能謂於一切世出世善深信有力能得成就又云忍謂勝解此即信因信下反釋如涅槃中信智相資文如下引證。",
        "translation": "The introduction of civilization and reverence in the first section of the first lesser treatise is a general statement of the meaning of the first part of the treatises, which is defined by the next section, but the lesser treatises don't see a text that clearly shows the essence of reverence except for the mental factor of conscience, which means that in virtue his mind is modest and low, he reveres the good as his nature, which is the meaning of the former object being exalted, and he deduces reverence from conscience, which is the essence of reverence.",
        "source": "X59n1095_001:0454b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故引誠教信智及慚敬之本矣。",
        "translation": "Therefore, it leads to the sincere teaching of faith, wisdom, and the basis of conscience and respect.",
        "source": "X59n1095_001:0454b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本起經曰佛初誕降周行十方舉手指天地曰天上天下唯我獨尊(以時俗所重九十六部號為大聖人天師也為絕邪歸正故示此相唯佛獨尊餘皆邪道既曰尊嚴歸依弘護非信敬之不成)三界皆苦無可樂者(三界眾生三苦交集無思厭背貪附更深故立此言令興厭離有厭苦身令思苦本觀達業惑深是苦因不沒諸見便得解脫餘則以苦捨苦長淪苦中)。",
        "translation": "The original scripture says that the Buddha first appeared and descended, traveled around the ten directions, raised his finger to heaven and earth, and said, \"I alone am the honored one in heaven and on earth.\" (In order to end wrong and return to right, he showed this characteristic that only the Buddha is honored, and the rest are wrongdoers.) The three realms are painful, and there's nothing to enjoy.",
        "source": "X59n1095_001:0454b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "教興初段信首宗本中初科初經中文有兩段義如注顯初段注中初示邪師九十六部者多論云六師各有十五弟子師資合論有九十六為下示正寶既下結顯次段注中文有四節初示眾生著苦三界眾生總該六趣三苦謂苦苦(五陰有漏)行苦(四相遷流)壞苦(樂盡苦至)故下二明佛示言教即三界皆苦之語有下三明因教開悟苦身即是苦諦苦本惑業即是集諦厭思觀達即脩道諦便得解脫即證滅諦是則世尊為信而興教眾生由信而致敬信敬既成諸見則息靜見之旨於茲顯矣餘下四示邪法增生如諸外道炙身臥棘苦行節脩雖受勤勞終無出離法華經云深入諸邪見以苦欲捨苦乃墜於三惡道等。",
        "translation": "In the first section of the first part of the commentary, there are two meanings as shown in the notes. In the first section of the commentary, the first shows that there are ninety-six wrong teachers, and many treatises say that each of the six teachers has fifteen disciples, and the combined treatises have ninety-six.",
        "source": "X59n1095_001:0454c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之一經成歸敬之本也定信守之宗也理須依憑託附以登高原之趣也。",
        "translation": "This is one of the sutras that forms the basis of reverence, establishes the tenets of faithfulness, and provides the principle of reliance, trust, and attachment to ascend to the highlands of destiny.",
        "source": "X59n1095_001:0454c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科初正結由佛初生示此勝相故為敬本決邪歸正故為信宗有本作守非次理下勸信高遠之趣即三乘聖道也。",
        "translation": "The first section of the second section correctly concludes that since the Buddha's first birth showed this remarkable characteristic, it's the basis of reverence, which determines what's wrong and returns to what's right, and therefore it's the doctrine of faith, which is to guard what's not the next principle and encourage faith in the lofty destiny, which is the noble path of the three vehicles.",
        "source": "X59n1095_001:0454c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故論云歸依者迴轉之語也由昔背正從邪流蕩生趣今佛出世興言極尊遂即迴彼邪心轉從正道故也。",
        "translation": "Therefore, the treatise says, \"Relying is the word for turning around.\" It's because in the past he turned away from the right and wandered into the destiny of birth through evil, and now the Buddha has appeared in the world and raised the term \"most honored,\" which means turning around that wrong mind and following the right path.",
        "source": "X59n1095_001:0454c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三中初科因上絕邪歸正故引多論以示歸意初舉論文由下示意初示隨流義棄捨三寶曰背正隨順魔外曰從邪由此沈迷還淪苦海故曰流蕩生趣也今下明迴轉義反上可知興言極尊者指上經中之語也。",
        "translation": "In the first of the three, the cause is to abandon wrong and return to right, so he cites a number of treatises to show what he means by returning. First, he raises the text of the treatise and then shows what he means by following the flow.",
        "source": "X59n1095_001:0455a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於是乃立歸法有五等之差始於背俗之初終於入道之極皆歸三寶以為心師之迹也所歸極矣所為大矣(謂初以身從終除心惑故也)。",
        "translation": "It then establishes that there are five kinds of distinctions in refuge, beginning at the beginning of deviation from conventionality and ending at the end of the path, which all lead to the Three Treasures as the traces of a teacher of the mind.",
        "source": "X59n1095_001:0455a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次立法中言五等者準母論云翻邪三歸五戒三歸八戒三歸十戒三歸具戒三歸文舉前後意含中間由八年已前三歸言下即發具戒故得通言皆歸三寶心師薩婆多云我教謂心師也他教謂師心也所師極者佛最尊故所為大者除心惑故然經明勝相乃初降誕之法儀論示正歸即始成道之鴻範無非本始皆定信宗。",
        "translation": "In the next section of the teaching, the five precepts are likewise discussed in the standard commentary on the Āgamas, the three mistaken fifth precepts, the three eighth precepts, the three tenth precept, the three full precepts, and the three precepts are enumerated in the preceding and following text, and the meaning includes the middle from the eight years prior to the three refuges, that is, the issuance of the full precepts, so it's possible to say in general that they all belong to the Three Treasures as mind teachers.",
        "source": "X59n1095_001:0455a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "安得傲然情無懾憚況復加以謗訕流言通俗自沈苦海出濟無期重使身心惡習念念逾增亦使威儀失節時時結業覆器之喻塵露於目前捕鼠之誣頻繁於胸臆可不誡歟可不誡歟。",
        "translation": "Furthermore, when combined with slander, gossip, and common sense, they sink into an ocean of suffering with no hope of escape, which causes bad habits in body and mind to increase from moment to moment and makes their manner lose control.",
        "source": "X59n1095_001:0455a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三科中為三初四句過通三業初句身業次句心業懾(之涉反心伏也)後二句口業對其道俗自出過患污彼淨心自下次六句重資三道初二句報道次二句增長惡習即煩惱道後二句破壞威儀即是業道覆下三引喻伸誡初喻智論第十五云佛子羅云其年幼稚未知慎口人來問之世尊在否詭言不在若不在時詭言佛在有人白佛佛語羅云澡盤取水與吾洗足洗已語言覆此澡盤如勅即覆佛言以水注之注已問言水入中否答言不入佛語羅云無慚愧人妄語覆心道法不入亦復如是次喻佛藏經云佛告舍利弗譬如蝙蝠欲捕鳥時則入穴為鼠欲捕鼠時則飛空為鳥而實無有鳥鼠之用其身臭穢但樂暗暝破戒比丘亦復如是論以覆器喻不納法合今憍慢不敬過由不聞法故經以鳥鼠喻破戒合今三業失儀義同破戒塵露謂過狀顯也頻繁謂此徒多也目前胸臆皆言可見。",
        "translation": "In the three categories, there are three first four phrases that refer to the three karmas, the first to physical karma, the second to mental karma (which involves the opposite of mental suppression), the second to verbal karma, and the second to conventional karma that produces its own faults and defiles the pure mind. The next six phrases reinforce the three paths, the first two to reporting, the second to the growth of bad habits, which is the path of affliction, and the second to the destruction of dignity, which is the path of karma. The first three are metaphors that extend the admonition.",
        "source": "X59n1095_001:0455a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又依佛見瓶沙王經曰如來於伽耶山成道度迦葉已念瓶沙王昔有先請將諸徒眾往赴彼國王及士眾并沙門(或云桑門沙門那者竝是天竺道士之佳號俗中之常目亦是彼國脩淨行者此云淨志以義目之)初聞佛至皆悉遠迎未知禮敬或有禮足而坐者或舉手問訊而坐者或稱姓名或叉手合掌或默然而坐者皆疑迦葉是宿舊師今從佛來未知誰為所依者迦葉知已欲決眾疑升空而下禮敬佛足以手摩捫以口嗚之自云佛是我師我為佛之弟子又持扇在佛後搖之。",
        "translation": "Also, according to the Sutra on the Buddha's Vision of King Bimbisāra, the Tathāgata attained enlightenment on Mount Gayā and Kāśyapa was mindful that King Bimbisāra had previously asked him to send his disciples to that country. The king, his men, and the monks (some say \"Samañjana\", which is a good name for a Taoist monk in India and the usual term among laypeople, as well as those who cultivate pure practices in that country.) When they first heard that the Buddha had arrived, they all greeted him from afar, didn't know how to pay respect, or some saluted his feet and sat down, raised their hands to ask a question and sat down, called him by his name, folded their palms with their palms together, or sat in silence.",
        "source": "X59n1095_001:0455b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬儀萌兆中初經示正儀文有六節初成道度人二念下念赴王請三王下王眾遠迎四未下各伸禮敬五皆下覩相生疑六迦下決疑示敬伽耶亦云耆闍崛此云靈岳迦葉此云飲光即鬱鞞羅等三迦葉也瓶沙即頻婆娑羅此云最堅由此國王先有期約今既成佛故思往赴注中沙門目於外道未知所依者以迦葉兄弟佛未出時為眾師傅今從佛來師資未決故眾懷疑。",
        "translation": "In the first section of the sutra, the proper ritual is shown in six parts. First, he attains enlightenment and liberates people; second, he's mindful of going to the king's invitation; third, he's mindful of going to the king's invitation; third, the king's crowd is far away; fourth, they each extend homage and respect; fifth, they all see the appearance and become doubtful; sixth, he resolves doubts and shows respect.",
        "source": "X59n1095_001:0455b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此第二經明禮敬正儀之萌兆也。",
        "translation": "This second sūtra explains the incipiency of proper conduct of worship.",
        "source": "X59n1095_001:0455c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結示中言萌兆者謂此敬儀最初立故。",
        "translation": "The phrase \"omen\" in the conclusion means that this is the first time this reverence was established.",
        "source": "X59n1095_001:0455c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "文中不足有者言之手摩口嗚者愛重之極不能已已也遠敬在於所卑故始於足自餘稱名顯相使疑者決之非正敬也。",
        "translation": "The words \"insufficient\" in the text mean it's hand-held, mouth-waved, and those who value it too much to be able to finish it.",
        "source": "X59n1095_001:0455c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "點解中言不足者正儀極多非止手摩口嗚而已且據此經有者言之爾稱名即自言佛是我師顯相即搖扇等此但決疑義非正敬則顯禮足等相是正儀也。",
        "translation": "According to this sūtra, there are those who say it's not enough to properly conduct themselves, not just hand-movement and mouth-whistling, but also those who say it's okay to call themselves by name, which is to say that the Buddha is my teacher, and to show their form, which is to shake the fan, etc. This is only to resolve doubt that the meaning is not proper reverence, and then to show that the salutation of the feet and other aspects are proper conduct.",
        "source": "X59n1095_001:0455c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "智度論云外道是他法故來則自坐白衣如客法故命之令坐一切出家五眾身心屬佛故立不坐若得道羅漢如舍利弗等皆坐聽法三果已下竝不聽坐以所作未辦結賊未破故。",
        "translation": "According to the Zhidu lun, non-Buddhists are other dharmas, so they come and sit on their own. The white coat is like a guest dharma, so it's ordered to make them sit, and all five renunciant monks belong to the Buddha in body and soul, so they stand and don't sit.",
        "source": "X59n1095_001:0455c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "位列敬相中初引論文其相有五初是外道二是白衣三即出家凡夫五眾四是無學五是學人坐立之相在文易了言外道者俱舍云學乖諦理隨自妄情不反內覺故稱外道所作未辦者諦理未精故結賊未破者細惑猶在故。",
        "translation": "The first is a layman, the second is a white-clothed man, the third is a renunciant, the five religious communities, the fourth is an unlearned man, and the fifth is a learner who sits and stands in a way that's easy to understand in the text.",
        "source": "X59n1095_001:0455c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此第三文明位列敬相也。",
        "translation": "This is the third civilized stage of listing respectful marks.",
        "source": "X59n1095_001:0456a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今有安坐像前情無敬讓可謂無事受罪枉壞身心如上三果尚立況下凡乎像立而坐彌是不敬比今君父可以例諸故知遶旋行立為敬故行安得長傲禮懺獲罪。",
        "translation": "Now, if someone sits stably in front of an image without reverence, it can be said that they've done nothing to deserve punishment and have wasted their body and mind.",
        "source": "X59n1095_001:0456a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡勸初科為四初正伸誡約二如下以聖況凡三比下以俗例道四故下顯正抑非行字音杭。",
        "translation": "The first section of the admonition and exhortation is divided into four first correctly extending the admonition to the following two, namely, the noble condition, the worldly example, and the fourth, therefore, the correct suppression, not the sound of the word practice.",
        "source": "X59n1095_001:0456a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此言易矣臨機難哉常志在心努力制抑方可改革不爾雖讀不救常習思之惟之。",
        "translation": "This is easy to say, but difficult to approach is the constant intention to work at restraining in the mind before reforming it, even though it's read and not saved by constant practice, thought, and guidance.",
        "source": "X59n1095_001:0456a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "勸行中初二句言易行難常下二句正勸不下有言無行空說無益。",
        "translation": "The first two phrases in the exhortation to practice say that it's easy to practice and difficult to be constant, and the next two phrases are a correct exhortation not to speak or act but to speak emptily and without benefit.",
        "source": "X59n1095_001:0456a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故增一阿含經云無恭敬心於佛者當生龍蛇中以過去從中來今猶無敬多睡癡等斯為良證。",
        "translation": "Therefore, the Incremental Āgama Sutra says that those without respect for the Buddha will be born among dragons and snakes because they came from the past and are still without respect and are often drowsy and deluded.",
        "source": "X59n1095_001:0456a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引證中初將因驗果合墮龍蛇以下以果推因猶承故習。",
        "translation": "In the introduction to the realization, first he tests the cause to see if the effect is combined with falling into the dragons and snakes, and then he deduces the cause from the effect and continues to cultivate it.",
        "source": "X59n1095_001:0456a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大悲經云佛過去時行菩薩道見三寶舍利塔像師僧父母耆年善友外道諸仙沙門婆羅門無不傾側謙下敬讓由是報故成佛已來山林人畜無不傾側禮敬於佛。",
        "translation": "According to the Sutra of Great Compassion, when the Buddha was practicing on the bodhisattva path in the distant past, he saw the Three Treasures, relics, stūpas, images, teachers, monks, parents, seniors, good friends, non-Buddhists, hermits, ascetics, ascetics, priests, and priests, and everyone would lean to one side, humble themselves, and pay respect to the Buddha because of this reward.",
        "source": "X59n1095_001:0456a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "致敬因本中初科初示因行過去時則該攝三祇菩薩道則統收萬行見下局就敬論是今本意所敬之境無論道俗不簡冤親如常不輕其事可證由下次示果德報即酬因義也傾側謂傾動側讓也。",
        "translation": "In the first category of the causes of paying homage, the first shows the causes and practices that were gathered in the past, the three incalculable bodhisattva paths, the unified collection of all practices, and the view that the following is the basis for the present meaning of the object of homage, whether it's the path or the secular world, not simply enemies or relatives, as always, and not despised.",
        "source": "X59n1095_001:0456a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此第四文明致敬之因本也。",
        "translation": "This fourth cause of civilized respect is also the origin.",
        "source": "X59n1095_001:0456b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如俗禮云無不敬儼若思安定詞傲不可長欲不可縱志不可滿是也。",
        "translation": "As the secular ritual says, \"There's no lack of respect, just as there's a word for stability, which means pride mustn't grow, desire mustn't be indulged, and ambition mustn't be fulfilled.",
        "source": "X59n1095_001:0456b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "類顯中文出禮記初句正合今文餘竝因引儼若思謂心有所主安定詞謂口不妄言傲不可長則誡其憍倨欲不可縱則抑其耽荒志不可滿則懲其自伐。",
        "translation": "The first phrase of the verse that shows the type of language comes from the Book of Rituals, and the rest of the verse is a causal reference to the fact that if one thinks, the mind has a purpose, and if one speaks quietly, then one admonishes arrogance and conceits that desires are not long, then one suppresses delusions, and if intentions are not full, then one punishes one's own vow.",
        "source": "X59n1095_001:0456b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依經律論明立敬儀。",
        "translation": "Relying on the sutras, vinaya, and treatises, he explains the manner in which he establishes reverence.",
        "source": "X59n1095_001:0456b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因明相敬中初科經論未詳何文律即四分存亡敬相竝如下引。",
        "translation": "In the first section of this explanation, the sūtras and treatises don't go into detail about the four parts of the precepts, namely, respecting each other's existence and demise, as quoted below.",
        "source": "X59n1095_001:0456b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛告比丘汝等共相恭敬迎逆問訊從何為始比丘白佛各言其志或云大姓貴族者或云神智高達者或云佛所宗親者或云道登聖果者以事舉之佛言汝等所言皆是長慢無可觀者應隨順法訓流布於世於我法律更相恭敬佛法可得流布。",
        "translation": "The Buddha told the monks, \"You must all respect each other.\" He asked, \"What was the beginning?\" The monks said to the Buddha, \"Tell him your intentions, whether it's someone from a great family, someone of high spiritual intelligence, someone from a Buddha's clan, or someone who has attained the noble fruit of the path, and cite these things.",
        "source": "X59n1095_001:0456b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別示中初律示初科中四分房舍犍度云佛從王舍城與諸比丘人間遊行詣毗舍離而六羣先往取房舍與和尚親厚等時舍利弗大目連後至不得房臥埵上因集眾訶誡已汝謂誰當受第一房第一水第一食弟子白佛各言其志如文所云大姓貴族者恃豪勢故神智高達者矜智能故佛所宗親者倚親厚故佛下總責所答乖理應下佛示慈誨令遵法則禮讓不虧則三寶可久。",
        "translation": "In the first part of the special instructions, the first Vinaya instructs that in the first section, the Buddha's four groups of monks marched from Rājagṛha to Vaiśālī, and the six groups first went to fetch a dwelling and became intimate with the monks.",
        "source": "X59n1095_001:0456b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬儀有四道不禮俗一也僧不禮尼二也守戒者不禮犯戒者三也前受戒者不禮後受戒者四也自餘五眾存亡乃殊皆約年夏次第而設敬也。",
        "translation": "There are four ways of paying respect to those who don't revere the secular world: first, the saṃgha doesn't revere the nuns; second, those who observe the precepts don't revere those who violate the precepts; third, those who received the precepts before don't revere those who received the precepts after; and fourth, the remaining five groups of people who survive and perish are all set apart in order of years and summers.",
        "source": "X59n1095_001:0456b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示敬儀中文列四種其相可知自餘等者上通道俗今據出家故言五眾存則各相恭敬亡則設禮塔像具有法儀竝如律鈔。",
        "translation": "The four kinds of reverence in this list of precepts can be understood from the rest of them, since they're based on the secular world and now on the renunciant world, it's said that each of the five groups survives and then respects the other, and then sets up reverences, stūpas, and images with the proper rituals.",
        "source": "X59n1095_001:0456c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因引古事昔有鵽鳥獼猴大象同在一林以為朋友乃相謂曰先生宿舊禮應供養如何同住不識禮敬象云我見此樹生齊吾腹猴言我曾蹲地手挽樹頭鳥言我於遠林食此樹子墮出而生我應最長即時大象背負獼猴鳥在猴上周徧而行仍說偈云有敬長老者是人能護法現世得名譽將來生善道於是人皆効之悉行禮敬諸有智人以喻取解。",
        "translation": "Citing ancient events, the monks, monkeys, and elephants once shared a forest and considered themselves friends. They then said to each other, \"Sir, we should make offerings to this tree from years gone by.\" The monkey said, \"I saw this tree growing close to my belly.\" The monkey said, \"I once squatted on the ground and took the tree's head by the hand.\" The bird said, \"I was eating from this tree's seed in a distant forest, and I fell out and was born, and I should be the longest.",
        "source": "X59n1095_001:0456c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三科亦出四分智論亦同初示三畜共林表同義聚乃下評章禮儀合識尊卑象下各述元由使知前後諸下結告。",
        "translation": "The three categories also come from the four parts of the Wisdom Treatise, which are the same. The first shows that the three animals share the same meaning, and the next reviews the rituals, combines consciousness with dignity, and the second describes the original reason for each, so that the former and latter can be known, and the second concludes with a comment.",
        "source": "X59n1095_001:0456c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云恭敬於塔廟謙下諸比丘遠離自高心常思惟智慧又云若有智慧則無貪著今貪慢而著隨則其愚不可及也。",
        "translation": "The sūtras say that monks who revere the stūpas and temples and humble themselves are free from self-exaltation and always contemplate wisdom.",
        "source": "X59n1095_001:0456c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二中初引二經皆遣慢著初是法華初句奉佛塔廟次句同輩相遵三句以恭去慢四句以智遣著次即遺教今下伸誡既有我慢則貪著隨之愚不可及文出論語借責愚人不用彼意謂愚而貪慢誨不可及也。",
        "translation": "The first of the two sutras cites two ways to expel the addiction of conceit: first, the Fahua's first sentence honors the Buddha's stūpa and temple; second, the peers follow each other; third, they are respectful and rid of conceit; fourth, they are wise and expel the addiction; second, they are the legacy of the teaching; and now, the following admonition extends to the admonition that since there is conceit, the addiction follows, and foolishness is unreachable.",
        "source": "X59n1095_001:0456c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "濟時護法篇第二(謂護持濟物非三寶而不隆)。",
        "translation": "The Second Part of the Treatise on Protecting the Dharma During Times of Relief (This is called \"Protecting and Supporting the Three Treasures,\" and it doesn't prosper unless it's the Three Treasures).",
        "source": "X59n1095_001:0456c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋濟時護法篇篇名中濟謂濟慧時謂時機以三寶為能濟時機為所濟故曰濟時又以時機為能敬三寶為所敬能所相濟上下遵行則法流長劫故曰護法注中上句示篇名下句顯篇意。",
        "translation": "In the explanation of the title of the chapter on [the] Three Treasures, Jiji and Haofa, Ji means to help, and Wisdom means to help when the Three Treasures are available, and when the Three Treasures are available, they are available, and both the upper and lower complies, then the Dharma flows for a long time.",
        "source": "X59n1095_001:0457a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "序曰夫以立像表真恒俗彝訓寄指筌月出道常規。",
        "translation": "The preface says that if you take the image of the manifestation of the real constant secular Yi Xun send finger chyuan moon out of the practice of the path.",
        "source": "X59n1095_001:0457a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "本文初科此篇廣明四種三寶理體冥寂非相莫顯故於篇首略敘大猷上二句約儒教明如國家宗廟設像奉先事載儒經故云恒俗彝訓彝常也下二句約釋教明圓覺經云脩多羅教如標月指喻出內典故曰出道常規。",
        "translation": "The first section of this article is a broad explanation of the four kinds of Three Treasures, the principle essence of which is mysterious and quiescent, and not visible in any way, so the first two sentences are about Confucianism, such as the setting up of an image in a national temple to honor the ancestors, which is described in the Confucian scriptures, so it's called the constant secular teaching and the constant Yi.",
        "source": "X59n1095_001:0457a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以妄想倒情相沿固習無思悛革隨業漂淪是以經言為善若登清升若爪之土為惡若崩沈滯如下之地此言在斯誠為極誡。",
        "translation": "But because deluded conceptualization and mistaken emotions continue to be firmly established without thought of reformation, karma drifts downhill as a result, the sūtras say that it's good if you ascend to the clear, ascending, clawed land, and bad if you crumble, sink, and stagnate in the following land.",
        "source": "X59n1095_001:0457a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "發起元由中初科初四句將立後法先敘迷情欲顯三寶為茲而設妄想是惑倒情是見即是下文見愛煩惱妄想綿續謂之相沿我見鏗然謂之固習無思悛革者不能反流故隨業漂淪者甘受輪回故又初句起妄本次句潤妄業三句執妄情四句受妄果是下次引經伸誡然為善若登之語本出書傳加漢書張紘與子書云從善若登從惡若崩今與經喻合而用之喻文出涅槃彼云爾時世尊取地少土置之爪上告迦葉言是土多耶十方世界土地多乎迦葉菩薩白佛言世尊爪上土者不比十方所有土也善男子有人捨身還得人身捨三惡身得受人身諸根完具生於中國具足正信脩習正道已得解脫得解脫已能得涅槃如爪上土捨人身已得三惡身乃至不得解脫常樂涅槃如十方世界所有土也此下伸誡。",
        "translation": "The first four phrases will establish the latter principle. The first one will describe deluded feelings and the desire to reveal the Three Treasures. Deluded thoughts are confusion, mistaken feelings are views, which are the following views, cravings, afflictions, deluded thoughts, and continuity are called \"continuity,\" and \"inherent habits,\" \"lack of reformation,\" \"lack of reformation,\" and \"drifting with karma,\" which is the willingness to undergo rebirth. The first phrase raises delusion, the second phrase nourishes deluded karma, the third phrase holds to deluded feelings, and the fourth phrase receives the result of delusion.",
        "source": "X59n1095_001:0457a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何以知耶但以慢山上聳俯視於人物我室四蒙包藏於見愛慢無納法之實經明覆器之賓我有懷著之功論顯納烟之義器仰無思不服有服必拔慢根室壞便歸太虗見愛安形無地理例然也背此非凡所行情事得也乖斯是聖遊履適化然也。",
        "translation": "How do we know this? But because conceit rises up on a hill and looks down on a person, the four monks in my room are encapsulated in views and emotions, and conceit has no basis in the reality of the Dharma, the sūtras clarify the object of covering a vessel, and I have the power to harbor attachments, the treatises reveal the meaning of accepting smoke, the vessel is elevated without thought or submission, and submission must uproot conceit, and the room is destroyed and returned to the great void.",
        "source": "X59n1095_001:0457b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次中初句徵謂何以得知妄習難改耶但下釋文有三節初八句執妄致迷器下五句翻迷顯悟背下四句總約迷悟以格凡情初中初四句示過本即我慢二惑慢有三種我慢邪慢增長慢即五鈍之一使也由慢自大故上聳如山陵懱於他故俯視人物我有二種人我法我主宰為義即五利之總相也能藏見愛喻之於室迷執不通喻若四蒙見謂見惑八十八使見所斷故愛即脩惑八十一品脩所斷故是則我室為能藏見愛為所藏故事鈔云三毒所起我心為本是也後四句顯過失慢有自高之失故不受道法喻覆器也我有懷著之失能藏見愛喻納烟也文言論顯未詳所出(舊記引智論云牧牛人問佛幾法成就能令牛羣番息佛言有十一法乃至第五云知作烟者除諸蚊虻牛遙見烟則來趣向屋舍比丘亦爾如所聞而說除諸結使蚊虻以說法烟引眾生入無我實相空舍恐不合文意)又解我有懷著懷著有二若著惡法能成妄業還資我本此著有過意如前解若著善法引生理觀觀成遣著反能害我此著有功分堪資道若作此釋即此二句亦是顯悟却引智論燒烟之喻方順文意次中上二句翻慢山過謂器仰有納水之功合顯慢傾能受教法下二句翻我室過謂室壞有散烟之用合顯我空則見愛不存理下一句結云理謂道理文以喻顯故曰例然三中背與乖字皆目能治之觀即是器仰室壞也此與斯字竝指所治之惑即是我室慢山以我慢順迷觀智順悟以悟反迷故曰背此乖斯非凡所行是聖遊履文綺交映翻對可知情事得者情即凡夫之心事謂所脩之行言此理觀雖非凡行今以凡心對事起脩冥符正觀有所悟入故曰得也適化然者受教法故。",
        "translation": "In the next section, the first phrase explicates the text, which has three sections. The first eight phrases are about deluded attachment causing deluded vessels, the next five phrases are about delusion revealing enlightenment, and the next four phrases are about delusion and enlightenment in order to frame worldly discriminations. The first four phrases show the root of the error, which is self-conceit, two kinds of delusion, and pride, which has three kinds of self-conceit, wrong conceit, and pride in growth, which is one of the five dullnesses, and because of pride's arrogance, it rises up like a mountain, and it's liquid in others, it looks down on people.",
        "source": "X59n1095_001:0457b10_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "然則封迷長劫佛世有退席之人不識分量季俗豐輕生之士此竝不思之徒也。",
        "translation": "Still, in the long eon of enclosure and delusion, there were people in the Buddha world who withdrew from their seats, didn't know their place, and were secular, abundant, and lighthearted.",
        "source": "X59n1095_001:0457c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三中然字印可上文義當如是則字評量後事意謂未然故引不思之徒以彰難化之理初示久迷法華經云汝既三請豈得不說汝今諦聽當為汝說說是語時會中五千人等禮佛而退此輩罪根深重等豈非執著我慢長劫難清佛世尚然況今末濁不下示輕信大師云冒染大度罪福本空等此竝不思之徒也。",
        "translation": "In the three cases, the word 'rān' implies that the above meaning should be thus assessed in terms of the latter thing, meaning it's not yet rāned. First, it shows how long they've been deluded, and the Lotus Sutra says, \"Since you've been asked three times, how could you not explain it?\" Now, listen closely, and I'll explain it for you. When 5,000 people worship the Buddha and withdraw, are these people not attached to self-conceit and long eons when it's difficult to clear the Buddha's world, so why wouldn't the present, final, turbid stage show that there are those who don't think, such as the gullible great master who says, \"Risk defilement, great salvation, and the fundamental emptiness of sins and merits.",
        "source": "X59n1095_001:0457c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "當知我身屬於他緣冥冥不知來處我神屬於惑業忽忽莫測何心經云命如風中燈不知滅時節今日復明日不覺死時至冥冥隨業緣不知生何道此至言也乾豆莫干其慮吁可悲哉。",
        "translation": "You should know that my body is conditioned by others, and I don't know where I'm coming from. My spirit is conditioned by afflictions and karma, and I don't know how to fathom it. The sutra says that life is like a lamp in the wind that doesn't know when it's going out.",
        "source": "X59n1095_001:0457c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四中初四句牒二報以示妄令息妄以從理當知二字即警誡之辭身是色陰四大緣假故屬他緣不了集因故不知來處圓覺經云我今此身四大和合乃至四緣假合妄有六根等神即是識識含種子由種起毒即煩惱道由惑起業即是業道忽即是念念通善惡三性難均故曰莫測何心經下次引文證出坐禪三昧經具云今日營此業明日造彼事樂著不觀苦不覺死賊至又云誰能知死時所趣從何道譬如風中燈不知滅時節文究往因云不知來經推來報云不知去此下三句指經伸誡乾豆是喻事出涅槃彼云譬如豌豆乾時錐刺終不可著煩惱堅硬亦復如是莫于其慮是法說于猶涉也慮即是心謂煩惱堅固道化不入于心合上乾豆錐刺不入。",
        "translation": "The first four sentences of the four present the two retributions to show the delusion so that the delusion will be stopped and the two words of the admonition will be understood to mean that the body is the aggregate of form and the four conditions are false, so it belongs to other conditions and doesn't know where it's coming from. The Sutra of Perfect Enlightenment says, \"Now, this body of mine has four major combinations and even four conditions that are false combinations, such as the six faculties and other spirits, which are consciousnesses and the seeds contained in consciousnesses.",
        "source": "X59n1095_001:0458a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "且自等智有三我同牛羊之智出道唯一牛羊異我非倫人道道緣不行還同畜獸獸道報重頑厚非其所聞。",
        "translation": "Moreover, there are three kinds of self and other kinds of cognition, which are the same as the cognition of cattle and sheep and the only one that leaves the path, which is different from self and unlike humans, the path doesn't work, and it's the same as the path of animals and beasts, which has heavy, stubborn, and thick rewards that aren't heard from them.",
        "source": "X59n1095_001:0458a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五中初科初二句總示等智有三者涅槃經云一切眾生於三法中皆有等智謂婬慾飲食恐怖次二句別示人中有出道智異於牛羊故曰非倫人下責勸初示人道是脩道緣今若不脩自同畜獸獸下次示畜生無出道智受形鄙穢故云報重煩惱濁鈍故云頑厚頑即癡也癡因偏重多墮畜生。",
        "translation": "In the first of the five categories, the first two phrases generally show that there are three kinds of equanimous knowledge. The Nirvana Sutra says that all sentient beings have equanimous knowledge in three things, which are lust, desire, food, and fear. The second two phrases specifically show that among humans there's knowledge of the way out that's different from that of cattle and sheep, which is why it's called non-natured. The next phrase urges that the first shows that the human path is a condition for cultivating the path, and if we don't cultivate it, we'll be like animals and beasts.",
        "source": "X59n1095_001:0458a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今既形有輕清識心機舉猒勞生於往劫欣解網於將來固當立像表儀傾塵聚而頂禮寄緣引領蕩煩累於新心是則情異牛羊乘明智而弘道身如木石假彫琢而成器可不然乎可不然乎鼠入角而至窮更知何趣名引言而顯實理極於斯況復五滓交橫四山常逼而能安忍於時事還是昏昏之所媚乎。",
        "translation": "Now, since form has a light, pure consciousness, mental functions, and the lifting up of worldly sufferings in past eons, he's eager to unravel the net in the future, and he should certainly erect an image to express his manner, tilt the dusty mass and pay homage to it, send conditions to lead, and cleanse the afflictions in a new mind.",
        "source": "X59n1095_001:0458b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次中初約報策脩形輕清者異報重故心機舉者異頑厚故機謂圓轉舉謂超越慨昔輪回故須猒往期後樂報故須脩來固下示其脩法立像謂陳其所敬寄緣謂托其脩法傾塵謂折挫報形蕩累謂清澄心惑是下結益鼠下伸誡勸有三初約喻勸事出諺語事淺意深故引為誡名下舉文勸引文用意志在遵行名引寫倒合作引名況下舉時勸五滓即五濁也四山如上所引而下二句反責安忍時事順故業也昏即迷時媚猶惑也。",
        "translation": "In the next place, the first one is about retribution, which is to cultivate a form that's light and clear, which is different from a retribution that's heavy, which is mental, which is hard and thick, which is called perfect, which is to transcend the cycle of reincarnation in the past, which is to be relaxed, which is a pleasant retribution in the future, which is to be cultivated, which is to be solid, which is to demonstrate its cultivation, which is to present an image that's respected, which is to send a reference, which is to entrust its cultivation, which is to tilt the dust that's frustrated, which is to deflate the form of retribution, which is to clear the mental disturbance, which is to conclude that the rat is benefited, which is to extend the admonition and exhortation, which has three meanings.",
        "source": "X59n1095_001:0458b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以大聖知時通化陶誘立正三寶導濁識之所歸開明四印示迷生之不昧固得住法萬載功由歸敬之勳神升四天諒藉傳揚之力廣如慈經所出豈虗搆哉。",
        "translation": "所以大聖知時通化陶誘立正三寶導濁識之所歸開明四印示迷生之不昧固得住法萬載功由歸敬之勳神升四天諒藉傳揚之力廣如慈經所出豈虗搆哉。",
        "source": "X59n1095_001:0458b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "立寶彰益中初科初六句示佛立教法大聖是佛通合作適謂順機也陶謂陶甄誘即接誘正三寶者簡邪師故導濁識者引初機故四印即十誦四墨印彼第五十八云佛何故說四墨印答欲說真實法故來世比丘當了了知是佛說非佛說等廣文如彼墨即文句印謂證明由教印心不生謬解故云不昧固下次示功益初則住法益神下得報益歸敬傳揚文雖單舉義實兼收慈經即彌勒上生經文如後引。",
        "translation": "立寶彰益中初科初六句示佛立教法大聖是佛通合作適謂順機也陶謂陶甄誘即接誘正三寶者簡邪師故導濁識者引初機故四印即十誦四墨印彼第五十八云佛何故說四墨印答欲說真實法故來世比丘當了了知是佛說非佛說等廣文如彼墨即文句印謂證明由教印心不生謬解故云不昧固下次示功益初則住法益神下得報益歸敬傳揚文雖單舉義實兼收慈經即彌勒上生經文如後引。",
        "source": "X59n1095_001:0458b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今此之述本被後進之初心曲授稱功體非前良之早慮固須叮嚀指掌鋪覼相狀識三寶有數種之權謀解七眾無貳師之希向言唯質露意在脩行想有識者知無繁於翰墨故佛言吾言不在綺飾令人受解為要敢附斯轍筆記序云。",
        "translation": "The present statement is originally intended for the novice practitioner who is advancing later in life, and the essence of the merit of the title is not based on the early consideration of the former consciousness, but rather on the exhortation to lay hands on the scriptures, the shape of the consciousness of the Three Treasures, the several kinds of expediency, and the understanding of the seven groups of people without two teachers.",
        "source": "X59n1095_001:0458c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "述作中初科欲立四種三寶恐謂繁廣故先示之既被初心故須委曲前良立教多被利根文體簡約故非所比早猶先也慮即是心覼(落戈反覼縷也)數種如下所示四種之相權謀謂權巧謀略言七眾者通收道俗同崇正寶故無異向而言解者開導之謂言下示文體故下引文證敢下依法陳情取信於後。",
        "translation": "In the first section of the exposition, the desire to establish the four kinds of Three Treasures is feared to be cumbersome and extensive, so it's first shown that since it was first introduced to the mind, it must be entrusted to the former Liang to establish a teaching that's mostly for the sharp faculties, so the text is simple, so it's not comparable to the earlier or earlier.",
        "source": "X59n1095_001:0458c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今於此篇顯三寶相相隨見起隨機四位初謂一體二謂緣理三謂化相四謂住持各有名相。",
        "translation": "Now, this chapter shows that the characteristics of the Three Treasures arise according to view in four random stages: first, they are one in essence; second, they are conditions and principles; third, they are characteristics of transformation; and fourth, they are abiding in each of their names and characteristics.",
        "source": "X59n1095_001:0458c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三寶相狀中初科初四句總敘初下別列言隨見者見即機見機分大小迷悟之殊見亦隱顯有無之異故此三寶隨見而興約其性具迷悟本然故說一體簡迷存悟獨顯法身故有理體眾生有見佛因佛即隨緣出現故有化相濁機障重不及化源薄有餘資堪承遺像故立住持約時為言一體理體三時同有化相唯局佛世住持義通初後就人為言一體凡聖同具理體唯在聖人化相住持凡聖同見據教為言一體唯局大乘餘三義通大小隨其經教所說異故隨機之義於焉著矣。",
        "translation": "In the first section of the chapter, the three treasures' characteristics are first summarized in the first four sentences, and then listed separately under the heading \"following views\".",
        "source": "X59n1095_001:0458c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "初言一體三寶者。",
        "translation": "The first one says \"one body, three treasures.",
        "source": "X59n1095_001:0459a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一是非二之名體謂本識之謂。",
        "translation": "One is the name of what's not two, which is the essence of the original consciousness.",
        "source": "X59n1095_001:0459a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一體釋名中一體之名文雖自釋及解非二古說多差今釋此文略存三義一簡相釋體雖是一約相分三恐謂隨相亦有三體故此簡之云非二也戒本疏云今了法本理實無三(云云)二遣數釋隨俗談數一是數始從一至二以及百千今此一體孤然獨立本無對待強借一名以詮自性恐聞此一謂同諸數於一體外有二可對故此遣之云非二也故古德云借一遣二即其意也三顯實釋一是心真諸法中實一實之外餘則非真故云非二二既是非即顯一實故大師云諸法本無實唯有識(云云)言本識者梵語阿棃耶或云阿賴耶此翻為藏或翻無沒謂能藏種子任持不失故而言本者本即體義染淨因果依之生故問心體本識同異如何答心體就性而彰名本識從相而立稱一理一事其異可知若爾戒疏體是心體此文體是本識既曰妄真文何偏舉答名假言詮言不竝立名詮自性表顯不同識既從相以得名故須從相以解義統論正理則真俗圓收言本識則妄徹真源舉心體則真該妄末由茲圓具故得互標況下釋文明言心體好思正理切勿迷名。",
        "translation": "Although the explanation of the name of oneness in the interpretation of the name of oneness is self-explanatory and understands that it's not two, there are many differences between the ancient teachings. The explanation of this text briefly retains three meanings.",
        "source": "X59n1095_001:0459a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以無始心體性淨如空妄想客塵封迷隨染致使相從至于今日經生歷死無由猒曉。",
        "translation": "But since beginningless time, the mind's essence is pure in nature like emptiness, deluded in conception, enclosed in objects, confused, followed by defilement, and subordinated to each other until today, through birth and death, there's no reason to be unaware of it.",
        "source": "X59n1095_001:0459b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示體中初科初二句示心體心即八識體是真如即相之體自性清淨故曰性淨不同餘空治之令淨佛性論云清淨有二一者因中無染清淨二者果上無垢清淨一體在因即無染清淨虗空是喻以具周遍不動等義故此比焉然空但頑虗性有神解故非喻所及即戒疏云本來無染業疏云要識心本是大乘理其體清淨玅用虗通正觀文云觀察自心自性清淨非空非有非染非淨等是知心體本識體相圓融多見有人纔聞唯識便云事觀輒隨己見排斥祖乘引悞後昆輕毀先德勉咨來哲熟覽斯文則知上以本識標名下以淨心釋體性相圓具真俗無乖良由雄文奧義理須極思研精玅觀圓門旨在深遊善解諛聞寡學焉足言哉妄下六句明識相即真如隨緣之義初二句妄起元因妄想即是無明其性不住喻之如客染污真性名之曰塵封迷謂妄起覆真隨染謂真隨妄動致下二句隨緣流轉即性之相同一生滅故曰相從經下二句著妄不反問心體既淨何容妄染答凡夫性體真妄同源染淨未分致容妄起故無明起時全真成妄非謂真外別有妄法來染淨心水波金像可以為喻淨心誡觀云生死煩惱從真性起喻如大水本淨湛然為因風故遂生波動後因大寒乃結成氷眾生佛性本淨如水由覺觀風波浪生死貪愛堅固成煩惱冰起信論云依如來藏故有生滅所謂不生不滅與生滅和合非一非異名阿棃耶識等問妄起遣真妄自生滅真源不變何說隨迷答隨緣義故真逐妄流問真既成迷何云本淨答不變義故性自天真問真如凝然法身生滅教宗天別性相岐分今此儀文為當何義答性宗教義文旨煥然問相宗生法則八識種子性宗起妄則真性隨緣今一體示名但言本識豈同法性妄起由真答前已廣明可自思取。",
        "translation": "The first two phrases in the first section show the essence of the mind, which is the essence of the eight consciousnesses, is true, which is the essence of characteristics, and is therefore inherently pure. The Buddha-nature Treatise says there are two kinds of purity: one is undefiled and pure in the cause, and the other is undefiled and pure in the result, which is undefiled and pure in the cause.",
        "source": "X59n1095_001:0459b07_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "故經云諸法本來性相空寂眾生妄計彼此得失輪迴生死不得解脫經云一切眾生竝有佛性即我本識出障嘉名迷故曰凡悟便名聖所以貧女寶藏力士額珠性常清淨有而無用為惑所覆無由光顯如經深叢覆寶移流雜味然其本性光淳無玷。",
        "translation": "Therefore, the sūtras say that the original nature and characteristics of all dharmas are empty and sentient beings deludedly conceptualize each other's gains and losses, and are not liberated from the cycle of birth and death. The sūtras say that all sentient beings have buddha-nature, which is our original consciousness that escapes hindrances and is called delusion.",
        "source": "X59n1095_001:0459c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次引證初文出膽察經初證性淨如空眾生下證從真起妄又經即涅槃如來性品初二句正舉經文即下釋示經意經中佛性即我本識佛翻為覺即果德之嘉名識屬妄心乃凡夫之因號今居凡位即顯覺名則知煩惱心中佛性未嘗不覺迷凡悟聖但名移爾寶藏額珠竝以喻顯事出涅槃彼云一切眾生悉有佛性常為無量煩惱所覆是故眾生不能得見如貧女舍多有真金之藏家人大小無有知者而有異人善知方便即於其家掘出金藏善男子我今普示一切眾生所有佛性為諸煩惱之所覆蔽如彼貧女有真金藏不能得見等力士額珠者涅槃經譬如王家有大力士其人眉間有金剛珠與餘力士捔力相撲而彼力士以頭低觸其額上珠尋沒膚中都不自知是珠所在其處有瘡即命良醫欲自療治及至醬時執鏡以照珠在鏡中明了顯現等性下二句釋上二喻以宅寶額珠性常不變土肉障之故無用也為下二句合上二喻惑則雙合土肉光顯別合珠藏深叢覆寶等者亦出涅槃檢經唯有藥喻彼云善男子譬如雪山有一味藥過去往世有轉輪王於此雪山為此藥故在在處處造作木筒以接是藥是藥熟時從地流出集木筒中其味真正王既沒已其後是藥或酸或醎或苦或辛或甜或淡如是一味隨其流處有種種味是藥真味留停在山猶如滿月凡人薄福雖以钁(居縛反鋤也)劉加功囷苦而不能得復有聖王出現於世以福因緣即得是藥真正之味善男子如來祕藏其味亦爾為諸煩惱叢林所覆無明眾生不能得見一味藥者喻如佛性以煩惱故出種種味所謂地獄餓鬼畜生(云云)。",
        "translation": "The next introduction is the initial text of the 膽察經 which first realizes that the nature is pure like emptiness and sentient beings secondly realizes that delusion arises from the truth and that the scripture is the Nirvana chapter on the nature of the Tathāgata The first two sentences correctly present the scripture text which is the following explanation shows the meaning of the scripture in which the buddha nature is my original consciousness which is translated as enlightenment which is the prajñā name of the fruit of virtue consciousness belongs to the deluded mind which is the causal name of worldlings Now that I live in the worldly position which is the name of manifest enlightenment then I know that the buddha nature in the mind of affliction is not yet unenlightened misconstruing worldlings and awakening sages but it's called the transference of the buddha nature.",
        "source": "X59n1095_001:0459c20_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "所以前脩聞此勵力勤觀日故劫新遂證斯德及成玅覺轉依法身身非始生寄緣脩顯。",
        "translation": "That's why the former director heard of this motivation, diligently observed the newness of the past eon, realized this virtue, and then became profoundly enlightened, transformed the body of the Dharma according to the body of the Dharma that wasn't originally born, and relied on conditions to cultivate its manifestation.",
        "source": "X59n1095_001:0460b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "反妄勸脩中初科初示因脩顯證初句聞法次句起行三句歷時四句顯證斯德即本性光淳之德及下反顯初顯脩必依性玅覺極果聖人也三祇行滿障盡覺圓故言成也法身自性本具也言轉依者即轉雜染分依清淨分故攝論云對治起時離本識(八識)雜染不淨品(七識)與淨品相應(真識)故云轉依身下次顯性假緣成身雖本具非緣不顯故憑三學以顯玅心。",
        "translation": "The first section of the counter-oblivious exhortation to cultivate first shows that the cause cultivates the manifestation. The first section hears the teaching, the second section initiates the practice, the third section goes through time, and the fourth section reveals that the virtue is the virtue of the innate, brilliant, and simple awakening, and the following counter-manifestation first shows that cultivation must rely on the innate, profound, and perfect awakening, so it's called becoming, and the self-nature of the Dharma body is originally complete.",
        "source": "X59n1095_001:0460b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後進聞此興大志求彼去已還我云何住遵途進德還登位極。",
        "translation": "Later, he hears this and arouses his great intention to seek their return after leaving.",
        "source": "X59n1095_001:0460b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次中初二句躡彼前脩示其後進大志即菩提心彼下經喻總顯前後二脩發志所以涅槃經云譬如二人俱聞他方有七寶山山有清泉其味甘美有能到者永斷貧窮服其水者增壽萬歲唯路懸遠嶮阻多難時彼二人俱欲共往一人莊嚴種種行具一則空手無所齎持相與前進路值一人多齎寶貨七珍具足二人便前問言仁者彼土實有七寶山耶其人答言實有不虗我已獲寶飲服甘泉唯患路嶮多有盜賊沙滷棘刺乏於水草往者千萬達者甚少聞是語已一人即悔尋作是言路既懸遠艱難非一往者無量達者無幾而我云何當能到彼一人復言有人能過我亦能過若得果達則得如願採取珍寶飲服其水如其不達以死為期是時二人一則悔還一則前進到彼山所多獲珍寶如願服水多齎所有還其所止奉養父母供給宗親是悔還者見是事已心復生熱彼去已還我何為住即便莊嚴涉道而去遵下二句合顯上句法喻雙顯下句唯就法說文中不具引經但密用經意耳。",
        "translation": "The first two phrases in the second part of the sentence tiptoe in and show the great intention of those who advance later, which is the mind of enlightenment. The following sūtras and metaphors summarize the first and second phrases of the sūtras and show the determination aroused by them.",
        "source": "X59n1095_001:0460b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "自昔已來此乘無權皆成正覺逈出樊籠俯應羣心興悲赴感我之與佛無始實同彼以先覺故先出有我獨不悟盤桓下凡一思此事悔熱何及今若不脩後生何據。",
        "translation": "Since the distant past, this vehicle without authority has become perfectly enlightened, escaped from the cage, bowed to the compassion of the masses, and roused feelings of compassion for me and the Buddha, who were really the same since beginningless time.",
        "source": "X59n1095_001:0460c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三中初六句示往佛因脩已證初四句明法身自昔兩字通指往佛此乘即是一體如大白牛運載無盡喻之如乘純圓獨玅不落諸數名曰一乘一乘自性是真實道故曰無權此即自性法身性既本真凡脩必證故曰皆成正覺此即自受用身前明證德此論斷障永超二死永斷二障則三界繫縛無所拘留故曰逈出樊籠樊籠囚眾生之具也木作曰樊竹作曰籠俯下二句明應身羣心有感佛身心應故曰俯應等此通報及變化身我下十句正約今機激發進行初二句顯性同次四句明位別盤桓謂怠而不進後四句感悟起脩一猶忽也我凡佛聖佛覺我迷事現動心寧不憤發。",
        "translation": "The first six sentences in the third indicate that the cause of the former Buddha's sūtra has been realized. The first four sentences clarify that the Dharma body refers to the two words from the past, and this vehicle is one in essence like a great white ox that carries endlessly, which is metaphorically called the One Vehicle. The One Vehicle's own nature is the true and real path, so it's called without authority.",
        "source": "X59n1095_001:0460c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所以承遵梵網以網魚龍(經喻內毒如龍難觸欲貪如鯨吞海)揖佩三身憑依三學。",
        "translation": "Therefore, he undertakes to follow the Brahmā's Net in order to net fish and dragons (the sutra's metaphor of internal poison being like a dragon hard to touch and desire like a whale swallowing the ocean), bowing his head to the three bodies, and relying on the three disciplines.",
        "source": "X59n1095_001:0460c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示脩法中初科初令依教承遵謂依稟也梵網即是聖教網可捕於魚龍教能羅於惑業故以為喻注中以龍喻瞋以鯨喻貪癡毒不顯理亦須具內宜作瞋鯨是海族崔豹古今注云鯨大者長千里小者數丈鼓浪成雷噴沫成雨飲水如傾等揖下次教起行揖謂恭敬推讓佩謂感服存誠三身即法應化也三學即戒定慧也三身是果三學是因以果推因果由因克故提綱領以示行宗。",
        "translation": "The first part of the method of showing and training is to first make the teaching to be followed, which is to rely on the offerings. Brahmā's Net is the holy teaching that nets fish and dragons and teaches them to be able to trap afflictive activity, so it's used as a metaphor.",
        "source": "X59n1095_001:0461a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "爰初投足先奉戒宗戒本有三三身之本一律儀戒謂斷諸惡即法身之因也(由法身本淨惡覆不顯今脩離惡功成德現故)二攝善法戒謂脩諸善即報身之因也(報以眾善所成成善無高止作今脩止作二善用成報佛之緣)三攝眾生戒即慈濟有心功成化佛之因也(以化佛無心隨感便應今大慈普濟意用則齊)。",
        "translation": "I would like to begin by putting my foot in front of the precepts school. The precepts book has three buddha-bodies, the first of which is the precepts that cut off evil, which is the cause of the Dharma body (because the Dharma body is originally pure and not covered by evil, now cultivating freedom from evil accomplishes the manifestation of virtue), the second collects the good Dharma precepts that cultivate goodness, which is the cause of the reward body (the reward is based on the accomplishment of many good deeds, the accomplishment of which has no high stopping power, now cultivating the stopping power and the accomplishment of two good uses to accomplish the causes of the reward buddha), and the third collects the sentient beings precepts that are the cause of compassionate relief of those with minds that accomplish the transformation of the buddha (because the transformation buddha has no mind to respond to feelings as they arise, now great compassionate universal relief is matched in intent and function).",
        "source": "X59n1095_001:0461a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯戒因中初科初明七眾以戒為因戒下次明三身以戒為因初總示一下別配言律儀者篇聚重輕開遮持犯楷模不亂也戒以警訓如戒疏明言斷惡者如善戒梵網大小律儀篇聚所制婬盜等戒起對治行作意防護即止持行是斷德因將成法佛注中初明性德故云法身本淨今下示脩顯故云離惡攝善法者謂六度萬行事理諸善無所不脩即作持行以此眾善成就大智是智德因將成報佛注中報以善成顯果德也今脩止作示因行也若據止善屬上律儀由止成善還歸次聚不妨前聚自具作持三聚圓脩無乖前後思之文中示本故曰身因注示能成故言緣也攝眾生者前二自利今此利他即用二善遍攝眾生普運慈悲㧞苦與樂即利他行是恩德因將成化佛注中初二句明果德化佛無心者謂無彼此愛憎之心離於取著不見可度故隨感便應者大悲愍物不捨眾生故今下明因行因脩慈行與果用同故云意用齊也。",
        "translation": "The first section of the manifestation of the cause of morality first clarifies the seven groups of people using morality as a cause precepts next clarifies the three bodies using morality as a cause first summarizes and then shows the first section separately matching the words vinaya, the chapter and cluster of heavy and light, opening and sealing, maintaining and violating the model without confusion, precepts to warn and instruct as in the precepts commentary clarifies the words stopping evil as in the case of good precepts, Brahmā's Net, large and small vinaya, the chapter and cluster of rules for lust, theft, and other precepts, initiating corrective actions with the intention of guarding that is stopping and maintaining actions that are the cause of stopping virtue.",
        "source": "X59n1095_001:0461a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約佛有三隨義三別境非心外百慮咸歸理實如此不可餘見。",
        "translation": "According to the Buddha, there are three meanings that follow the three distinct objects that are not outside the mind, and all the one hundred concerns return to the truth as such and can't be seen otherwise.",
        "source": "X59n1095_001:0461b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次中初科因前三聚別配三身懸恐後人實生三異故約一心融通三法初二句指上別分次二句約心融會境非心外是唯識義即戒所防塵沙等境皆唯識變故非心外故業疏云不妄緣境但唯一識等百慮周易繫詞云天下同歸而殊途一致而百慮今借用之後二句勸解正理。",
        "translation": "In the next section, the first section causes the previous three groups to be distinctly matched with the three bodies, lest the latter actually give rise to the three differences, so the first two sentences refer to the above distinctive part, and the second two sentences refer to the mind's integration of objects that are not external to the mind because they are consciousness-only in the sense that the objects such as dust and sand that are guarded by the precepts are consciousness-only in their transformation, so they are not external to the mind.",
        "source": "X59n1095_001:0461b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或迷此及試重廣之然則功德之本非戒不弘道初俗歸必先敬受隨境起心無非三戒如約一生心不懷惡攝律儀也有慈起善攝善法也將濟離苦護眾生也內緣既爾三佛皆然。",
        "translation": "Some people may be confused about this and try to reintroduce it more broadly, but then the basis of merit is not the precepts that don't enhance the path. The first secular refuge must first be honored and accepted, and the mind that arises from following the object is nothing other than the three precepts.",
        "source": "X59n1095_001:0461b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一戒圓具中初二句示重廣之意然下正明初明一戒三聚又二初示受體隨下示隨行初總明境即萬境通情非情故大師云動念有境境必戒護如下別配約一生者舉戒境也不懷惡者示戒相也故業疏云如殺一戒具兼三位息諸煞緣攝律儀也行其惠命攝善法也護前命故攝眾生也此一既爾餘者例然與此大同內下次示一體三身內即是心緣即心用戒既三聚一心佛亦三身一體攝體歸心無非唯識。",
        "translation": "The first two phrases of the first precept are to show a serious and extensive meaning, but the next is to explain the first one, the three groups of precepts, and the second one is to show the acceptance of the body, and the next one is to show the following practices.",
        "source": "X59n1095_001:0461b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離合待時不定三一故經云吾今此身即是法身斯本從跡也又云色聲見我名行邪道此跡異本也。",
        "translation": "Since this body is the Dharma body, the sūtra says, \"Now, this body is the Dharma body, and this is the origin from the traces.\" It also says that form and sound are called practicing a wrong path, and these traces are different from the origin.",
        "source": "X59n1095_001:0461c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "離合教意中初科初二句總舉故下引示初經明合文出涅槃吾即釋迦自指釋迦當體便是法身故曰即是斯下示意若以事分本屬真身跡是化身今以理求真化不二故曰本從跡也又下次經顯離文見金剛般若此下示意真體無相故非色聲則顯化身有相非實是則真化隔別本跡岐分故曰跡異本也。",
        "translation": "In the first section of the meaning of the teaching that is free from conformity, the first two phrases are generally cited, so the following quote shows that the first sūtra clarifies that the combined text comes out of nirvāṇa, and that I am Śākyamuni, which refers to the essence of Śākyamuni, is the Dharma body, so that's what it is. The following shows that if we take the phenomenal part of the original true body, the manifestation is the transformation body, and now we seek the principle that the true and transformation are not two, so it's called the original from the manifestation.",
        "source": "X59n1095_001:0461c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故摩羯道成高山先照祇園開政下乘後席眾說備之可用通鏡。",
        "translation": "Therefore, Māgāra Daocheng Takayama first illuminates the Jetavana, opens the government's lower vehicle, and then sits down with the multitude of people who say it's available through the mirror.",
        "source": "X59n1095_001:0461c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科初四句正明初示頓教摩竭此云善勝即佛初成道先在此國首唱華嚴圓頓一乘如日初照也所被上機聞法開悟如高山也祇下次示漸教此由二乘不堪大法故寢大施小示現受生雪嶺行成金臺果滿始從鹿苑終至鶴林四十九年三百餘會隨機開導廣演羣乘然後但以一乘而為度脫中間所說不無圓隔其實一法隨機故開是知機鈍則教淺故空有不均或不談一體或三學別蹤或三聚不具或三身別立機勝則教圓故真俗不二顯談一體圓脩三學圓具三聚圓顯三身離合待時於茲可見比今文義圓別可知異前摩竭故標祇園具云祇樹給孤獨園祇即祇駄此云戰勝事如常引即釋迦最初施漸教處被機設化故云開政對彼上器故標下乘對彼華嚴故云後席席猶會也後二句結顯總引諸教無非待時故云眾說備之等。",
        "translation": "The next section begins with four sentences that correctly explain how the first manifestation of the sudden teaching, Maghā, which is called Shanshō, was the first to announce the first accomplishment of the Buddha's path in this country, the Huayan, the perfect and sudden One Vehicle, like the first illumination of the sun, and the awakening of the Dharma heard by the higher faculties, like the high mountain, and the next manifestation of the gradual teaching, which is based on the fact that the two vehicles are unable to match the great Dharma, so the great sleeps and gives to the lesser manifestation, the birth in Seoling, the accomplishment of the Golden Plateau, and the completion of the fruit of the forty-nine years of assembly from Deer Park to Crane Forest.",
        "source": "X59n1095_001:0461c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故先顯由緣後明性相欲明性體因言致理不是餝非終歸顯實將使通明性體解若心燈後被以文筌登岸捨筏可也。",
        "translation": "Therefore, first revealing the causes and conditions and then clarifying the nature and characteristics of the desire to understand the nature and essence of the cause and words that lead to the principle aren't the cradle and don't ultimately lead to the manifestation of the truth, which will lead to a thorough understanding of the nature and essence of the understanding as a lamp to the mind followed by a textual censer to board the shore and disembark the raft.",
        "source": "X59n1095_001:0462a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯文意中初二句躡前生起欲下正示文意初敘在迷理須言顯如前所敘意在明心恐謂飾詞故此遮謗將下次明悟後方可遣言故云後被文筌等通明是悟解即悟相心燈是喻疑是世傳無盡燈也周圍以鏡十界圜遶中安一燈表乎一心故號心燈鏡光交徹燈像互映比夫悟性體用昭然登岸捨筏法喻可曉兩言性體皆目心源問性相之旨可得聞乎答性相名通古多異說今詳文旨前後兩科皆明性相約前科明無染心體謂之性隨緣成識謂之相故文云無始心體性淨如空(性也)妄想客塵封迷隨染(相也)據下科明心性本淨謂之性義分三用謂之相故下三寶皆言性淨是也論性則前後皆同(同心體故)語相則假實分異(唯識假相隨緣似有三寶德相如實不空)文指後明正存次解問性相既明識性義別今論三寶為約性具為約識具答識相真性體用不二真俗圓具何得偏言。",
        "translation": "The first two phrases in the exposition of the meaning of the text are creeping ahead to give rise to the desire to come under the correct indication of the meaning of the text. The first phrase describes the delusion in principle that needs to be expressed, and the first phrase describes the intention to clarify the mind for fear of what's called ornamentation, so it's an obscuration that can only be dismissed after the next clarification of enlightenment.",
        "source": "X59n1095_001:0462a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言一體三寶者。",
        "translation": "He says the Three Treasures are one in essence.",
        "source": "X59n1095_001:0462b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋三寶標中一體之名兩番標者前明一體但顯由緣未分三相今明性相正示三寶故得重標義如上釋。",
        "translation": "The explanation of the name \"one body\" in the label of the Three Treasures is labeled twice because the former clarification of one body only showed that it was caused by conditions that didn't distinguish the three aspects.",
        "source": "X59n1095_001:0462b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行者既知心性本淨悟解無邪名為正覺覺即佛也性淨無染法也性淨無壅僧也今覺於本名始覺也本實體淨名先覺也。",
        "translation": "Since practitioners know that the mind's nature is originally pure, awakening and understanding are not mistaken, they are called right awakening, which is the Buddha, whose nature is pure and undefiled, whose nature is pure and uncongested, and whose present awareness is called initial awareness and whose original entity is pure and called prior awareness.",
        "source": "X59n1095_001:0462b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中初科初正明三相今下重示覺義初中三皆言性性即心體一體義故知覺二字是性家之德為佛寶之用覺為能照性為所照覺性不二故名佛寶般若德也即體之用性自神解(若準相宗說真如無知無覺宗旨可知也)戒本疏云故照理邊即為覺義住法圖讚云照無不周照周等覺謂之佛寶性淨無染者不變義故雖曰隨緣性常清淨具斯德故名為法寶法身德也戒本疏云體離名言即是法義住法圖讚云體無非法謂之法寶性淨無壅者壅即礙義以此淨心本具河沙功德由迷致染相似乖真而此至德與性常和不為煩惱之所壅礙故名僧寶解脫德也戒本疏云至理無滯和合僧義住法圖讚云至德常和謂之僧寶是則於一性中分別三相性相之義顯矣相雖分三性常自一性雖是一相常自三三無別三即一為三一非自一即三為一三一不二性相圓融舉一即三全三是一學者臨文宜知此意次中初了本性故名始覺即釋上文知覺解悟性本自覺故名先覺即釋上文心性本淨先覺即本覺也若但從迷一體性具唯有本覺今約脩顯解心初發即名始覺也始覺即本廣如起信問一體在迷今明悟者答悟有二義一者解悟二者證悟解悟即從迷忽覺頓知己性即是法身證悟則從凡至聖證真斷惑必假漸脩圭峰覺鈔廣明此義須者看之今一體言悟即是解悟欲顯理體還依漸脩故下文云如是斂念會必精勤積熏不已自然清淨即其證也。",
        "translation": "In the explanation of the first section of the first section, the correct definition of the three aspects is now repeatedly shown in the meaning of awakening. The first three are all said to be the nature, which is the meaning of the unity of mind and body.",
        "source": "X59n1095_001:0462b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如此安心如此練身俯仰周循無念不剋俗云惟狂克念作聖惟聖罔念作狂沈彼俗士尚此放言豈惟出道翻無此致都不可也。",
        "translation": "So at ease so training the body to look down and around without thought of non-killing the secular cloud but crazy to grasp the mindfulness of the sage but the sage is not mindful of the madness of the sage Shen the secular man is still this loose talk, how could it be that only the transcendent Way would not have this cause?",
        "source": "X59n1095_001:0462c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科初正勸如此二字指上法也安心謂冥會性理練身謂不廢事脩周循謂不斷絕也無念不剋者謂若無正念不能克證觀茲嚴誡志在勸思次引俗書以彰攝念文出尚書彼下以俗勵釋放言謂放猥之言也。",
        "translation": "The next section begins with the word \"exhortation\" which refers to the above two words, \"at ease\" which means to meditate on the nature and principle, \"to train oneself\" which means not to waste time, \"to cultivate\" which means not to stop, \"no mindfulness and no rejection\" which means that without right mindfulness, one cannot realize the contemplation of this solemn admonition and the intention to exhort is to secondly cite secular writings to show that the text of gathering mindfulness is out of the Shangshu, and then use secular inspiration to explain the release of words which means to release obscene words.",
        "source": "X59n1095_001:0462c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問曰卿發斯言欲何標據念念總是識心言言都非智略如何依準得一舉而騰九萬耶。",
        "translation": "The question was, \"What is the purpose of your saying this, and what's the basis for it?\" How does mindfulness always involve consciousness and mind, and words are not wise and brief?",
        "source": "X59n1095_001:0462c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問答中初問因前一體但說識心不談理智教似不圓心性本淨即名為佛教似太頓不圓之教欲冀頓超恐無是理故問顯之初二句誥其所出念下二句責其理乖識心即是一體非智略者謂不說聖智方略也如下言其難信一舉九萬事出莊子比其頓超。",
        "translation": "The first question in the answer was, \"Because the prior doctrine of oneness only talks about consciousness and mind and doesn't discuss principles and wisdom, the teaching seems incomplete, the mind is inherently pure, and that's called Buddhism.\" He wanted to hope to suddenly transcend this teaching, so he asked to show that the first two sentences were to let the mind out of which it arises and the next two sentences were to rebuke it for being mistaken in principle, which is to say that consciousness and mind are one and the same.",
        "source": "X59n1095_001:0462c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答曰夫以聖道遠而難希淨心近而易惑為山基於一簣為佛起於初念故萬里之剋離初步而不登三劫之功非始心而罔就是知行人發足常步此心開示不由外來悟入誠因內起迷時謂禮外境悟已還禮自心故經云心想佛時是心是佛。",
        "translation": "Answer: \"When the noble path is distant and difficult to ascertain, the pure mind is near and easy to perplex, because the base of the mountain is in one basket, and the Buddha arises from the first thought, therefore, ten thousand miles of grasping is free from the beginning and not ascending, and the accomplishment of three eons is not the beginning mind but is incoherent when the practitioner arouses the feet and always steps in this mind to reveal that it's not from the outside that enlightenment comes, but sincerely because of the internal arising, when delusion occurs, it's called worshipping the external objects and returning to one's own mind after enlightenment.",
        "source": "X59n1095_001:0463a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "答中初科亦二意初據始心宜觀答初二句正答初句言佛法太高初心非分次句謂心法至近晚學宜觀心性本淨即是淨心終日共行寧非至近瞥爾起妄即墮凡夫剎那不生便成正覺文言易惑且據隨迷義準接凡意彰易悟故令發足常步此心為下六句喻顯文分兩對初二句為一對上句假事立例文出論語下句合法顯理為山比佛智一簣比識心後四句為一對上二句以遠途而推發足下二句舉大劫而究始心萬里比於大劫初步比於始心是下二句結顯既近且易發足宜脩開下次引二經開示圓理初約法華開佛智見由法華已前諸三乘輩迷佛非心故於佛道自甘絕分執心生滅故息心趣寂自求涅槃是故此經開方便門示真實相則三乘五性同入佛乘現前一心即是如來無量知見如付宅寶如示衣珠故曰不由外來等次用觀經觀心即佛上二句義立故下正引彼十六行皆明事觀多被鈍機然上士圓觀本無彼此不開圓解恐隔自他故以圓音演茲玅觀彼經具云諸佛如來是法界身入一切眾生心想中是故汝等心想佛時是心是佛等以此文證則知剎那想念是佛無疑豈待高談理智而獨稱圓玅乎問心想是佛何佛何心耶若是真心彼言心想若是己佛彼觀彌陀若順想心現他法體則自他宛然安引彼文以證圓義。",
        "translation": "The first section of the answer has two meanings. First, according to the initial mind, it's appropriate to contemplate the first mind. Second, the first sentence says that the Buddha's teaching is too high, and the initial mind is not part of the second sentence says that it's appropriate for late learners to contemplate that the mind's nature is originally pure, and that's what the pure mind is when it's practiced together all day long.",
        "source": "X59n1095_001:0463a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如是斂念會必精勤積熏不已自然清淨忘此外求甫當行道徒役身心終為世福故身子不思經劫而居退忘難陀整慮終朝而拔其神。",
        "translation": "Thus, when he is mindful of what he's doing, he'll surely apply himself to it, accumulate its perfuming, and then naturally purify himself by forgetting that he's pursuing the path, that he's doing nothing but serving his body and mind, and that he'll ultimately attain worldly merit.",
        "source": "X59n1095_001:0463b10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科初四句勸脩初句脩定慧次句起精進三句歷長時四句證聖果忘下四句誡斥妄情忘猶捨也甫謂我也意謂捨此心觀別求行相自言我當行道既乖正行故徒役身心事理不融故歸世福故下引事重誡身子即舍利弗言不思者智論云舍利弗六十劫脩菩薩行欲度布施河而有乞人求乞其眼舍利弗言此無所任何以索之若須我身及財物者當以相與答言不須汝身及以財物唯欲得眼若汝實行檀者以眼見與舍利弗出一眼與之乞者得眼於含利弗前嗅之嫌臭唾而投地便以脚踏舍利弗思惟言如此弊人難可度也眼實無用而強索之既得脚踏可惡之甚如此人輩不可度也不如自度早脫生死思惟是已於菩薩道退向小乘難陀整慮者賢愚經云佛在舍衛有女名難陀乞丐自活見諸國王人民供養佛僧心自思惟我之宿罪生處貧賤雖遇福田無有種子便行乞丐以作微供唯得一錢持詣油家具語所懷油主憐愍增倍與油得以歡喜足作一燈奉上世尊自立誓願我今貧窮用是小燈供養於佛以此功德令我來世得智慧燈除滅一切眾生垢暗作是語已禮佛而去乃至竟夜諸燈盡滅唯此獨然爾時目連次當直日欲取滅之即舉手扇復以衣扇燈明不損佛語目連今此燈者非汝聲聞之所傾動正使四大海水以用灌之毗嵐風吹之亦不能滅此是發大心人之所布施佛說是已難陀復來頭面作禮佛即授記於未來世過二阿僧祇劫當得作佛號曰燈光是知身子失在於不思難陀得在於專慮也。",
        "translation": "The next section begins with four phrases of exhortation and trains. The first phrase trains in concentration and wisdom, the second phrase initiates effort, the third phrase traverses a long period of time, and the fourth phrase realizes the noble fruit. Forgetting the next four phrases admonishes and denies false discriminations. forgetting is like abandoning. fu means self, and the idea is to abandon this mind and contemplate the characteristics of separately pursued paths.",
        "source": "X59n1095_001:0463b13_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "上明一體三寶也。",
        "translation": "The above describes the Three Treasures as a single body.",
        "source": "X59n1095_001:0463c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二明緣理三寶者。",
        "translation": "Second, it explains the Three Treasures in terms of principle.",
        "source": "X59n1095_001:0463c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二理體標云緣理者緣屬脩門必依三學以為能顯理是性門正約一心以為所顯義通染淨染如血乳屬前一體今依三學稱緣脩顯垢盡心淨喻若醍醐脩性雙標故云緣理即此文云今以三學克剪纏結惑業既傾心性光顯等可為良證問戒疏四種理體居先今此儀文一體冠首者答疏求加護理體功強故在初一體在迷不彰勝用故居後今約脩顯從凡至聖故一體居初以障盡覺圓便歸理體從體起用故有化相化相滅度故有住持生起相因故茲行布問泛言理有大小之殊身分事理之別今如何分答法身性具曰理五分脩成曰事若據小教唯說脩成不妨當教自稱理寶(戒資別脫定慧觀若緣脩生滅斷見思為解脫無生等智為知見空無我理為法身佛性論云小乘無性德佛性唯有脩德等)若約大乘脩性雙具(戒稟三聚定慧圓脩但觀一識斷二障為解脫一切智為智見顯本性為法身)若爾儀文戒疏大小如何答戒疏據教局小約義則通(義有分通祖意自別故疏談理體亦說心源也)此文直約大乘顯談心本。",
        "translation": "The two principle bodies are labeled as the principle of causation, which must rely on the three disciplines as the way to reveal the principle that is the nature gate that is precisely about the one mind as the meaning to be revealed through defilement and purity defilement like blood and milk belonging to the former one body.",
        "source": "X59n1095_001:0463c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理謂至理天真常住還是心體且從染說無始有終但為惑網不能出障今以三學剋剪纏結惑業既傾心性光顯始終性淨無始無終。",
        "translation": "The principle refers to the ultimate truth that heavenly truth is eternally abiding or the essence of mind, and it's explained from the perspective of defilement that there's beginningless and endless, but it's because of the web of confusion that the hindrances can't be removed.",
        "source": "X59n1095_001:0464a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中明佛寶體相初科初約性具以釋理字又二初三句明理體本淨初句標簡次句釋義下句決顯若約字書理字訓正訓治今從釋教克體以論仍簡偏真故云至理至即是極諸法源底故理即心體天真常住故不垢不淨謂之天真不生不滅謂之常住復遮偏執謂一體外別有理體以為法身故即決云還是心體且下次四句示因妄致迷從染說者真妄和合如血乳故然真妄二法本同一源起無端由皆云無始問從真可爾今云從染無明為初安云無始答準起信疏云更無染法始於無明故云無始此是染法最初生相唯佛能知餘安究始用觀治妄妄法可盡故曰有終今下次明脩顯以釋緣字又二初二句正示三學即能顯之緣纏結乃所治之障惑下四句顯德始終性淨者準義即是二種法身約自性身因中無染即是始淨果上無垢即是終淨約五分身障盡始覺即是始淨悟後無迷即是終淨若從五分則有始無終今約自性故無始無終起信論云染法從無始以來熏習不斷乃至得佛後則有斷淨法熏習則無有斷盡於未來此義云何以真如法常熏習故妄心即滅法身顯現起用熏習則無有斷。",
        "translation": "The first section of the explanation explains the essence and characteristics of the Buddha's treasures. The first section deals with the nature and specifies the word principle, and the first three sentences explain the essence of principle as originally pure.",
        "source": "X59n1095_001:0464a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由法成立隨境分相即號此相為五分法身謂戒定慧解脫解脫知見也前之三學從因受名由戒護助果成法身故云戒身定慧準此可以類知後二從果次第受名解脫身者由慧剋惑惑無之處名解脫身解脫知見以乃出纏破障反照觀心故云知見身也。",
        "translation": "The first three disciplines are named after the cause, and the result is formed into the Dharma body because the precepts protect and assist the result, therefore it's called the body of precepts, concentration, and wisdom. The latter two are named after the result in order, and the body of liberation is named after the wisdom that combats affliction, the confusion, and the absence of confusion, and it's called the body of liberation.",
        "source": "X59n1095_001:0464b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示相中初科初句躡前法即法身謂理體也言成立者緣成垢盡性德圓滿也故攝論云能成立者謂真如有十種功德所成立者謂十種新生正行廣如彼論是則性德假緣故云成立隨下正顯又二初總示境即所度之機謂三乘六道也相即能應之佛謂應化二身也法身既立隨類現形故云隨境分相等問應化二身正屬化相何名理體答理是無為非相不顯欲彰四八金容是五分脩成法身之相故云即號此相為五分等不妨二身自屬化相若離此相別顯法身則真俗兩分正乖宗教法華經云微玅淨法身具相三十二即為良證前下次分顯文出佛地論三因二果在文易見戒即是因法身是果果從因號故名戒身智見屬智智是能照心字屬理理是所顯今取能照名智見身即知所顯屬自性身也。",
        "translation": "In the first section of the presentation of characteristics, the first phrase tiptoes around the prior dharma, which is the principle body and speaks of being established, which is the fulfillment of the nature and virtue of the conditioned into defilement.",
        "source": "X59n1095_001:0464b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "唯佛法中三乘聖者具此五分能為六道作大歸依。",
        "translation": "Only the sages of the three vehicles in the Buddha's teaching have these five elements, which can serve as the great refuge for the six destinies.",
        "source": "X59n1095_001:0464c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科初三句簡異外道三乘同具理兼大小名同證異準上可知能下次二句顯用。",
        "translation": "The next section begins with three simple phrases that differ from the non-Buddhists' view that the three vehicles share the same principle, have the same large and small names, and realize the differences, which can be understood from the above, and the next two phrases that reveal their function.",
        "source": "X59n1095_001:0464c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故論云歸依於佛者謂一切智五分法身也歸依於法者謂滅諦涅槃也歸依於僧者謂諸賢聖學無學功德自身他身盡處也即自他惑滅所無之處故云盡處也故經云一切聖人皆以無為法得名無為即無漏之別目也。",
        "translation": "Therefore, the treatise says, \"Those who take refuge in the Buddha refer to the fivefold Dharma body of omniscience; those who take refuge in the Dharma refer to nirvāṇa in the truth of cessation; those who take refuge in the saṃgha refer to the places where the virtuous, noble, untaught, and untaught virtues of self and others end up, namely, the places where self and other afflictions cease and therefore end up. That's why the sūtras say that all sages attain the name of unconquerable by means of the unconquerable, which is the distinct title of uncontaminated.",
        "source": "X59n1095_001:0464c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "引論示中初正引文出多論一切智者即無分別智慈恩云一切智者自能開智如睡夢覺智觀於空智理智真智無分別智如所有也問一切智與五分法身還有異不答一切智即五分中解脫智見也今重標者顯師資故(由三乘人皆具五分今歸佛寶即一切智者之五分也自餘三乘雖具五分非一切智即業疏中無師大智大意同也)滅諦者謂滅大患度四流妄因妄果永盡無餘審知所斷決定如實故名諦也涅槃此云圓寂因滅苦故即證此德也賢聖名通大小據論唯局聲聞學無學者果位別故功德即所證之理自他盡處者理無彼此皆可依故故下引證即金剛般若文見魏譯理相差別如後正觀無為下點釋問就文談理既當大乘示相引文何依小論答圓教門中無施不可小文大用如海納流問法身所證即大涅槃自他盡處亦即滅諦三法相混若為分之答理本是一約相分三故業疏云雖有一義相有差別是也多論云以法而言無師無學法為佛寶(簡異弟子是有師故)非學非無學法為法寶(顯是所證理故)聲聞學無學法為僧寶(簡異教主故標聲聞佛唯無學此通學人)以義而推佛與僧屬能證人法是所證理又能證中師資兩異別就資中果位不同準上論文理體三寶還約化相以分三異則知理體法身之相亦指化相明矣。",
        "translation": "The first thing that the introduction of the discussion shows is that the correct introduction of the text out of the many treatises is that omniscience is nondiscriminating wisdom, and Cien says that omniscience is the self-knowledge that opens up wisdom like the wisdom of sleeping, dreaming, awakening, observing emptiness, wisdom of principle, true wisdom, nondiscriminating wisdom, and such wisdom as exists.",
        "source": "X59n1095_001:0464c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "由此三寶常住於世不為世法之所陵慢故稱寶也如世珍寶為生所重今此三寶為諸羣生三乘七眾之所歸仰故名正歸。",
        "translation": "Because these Three Treasures are eternally abiding in the world and aren't conceited by worldly phenomena, they're called treasures. Just as worldly treasures are valued by sentient beings, these Three Treasures are revered by the seven congregations of the three vehicles, so they're called the rightful refuge.",
        "source": "X59n1095_001:0465a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示可歸中初科初五句顯尊特此字正指理寶由出障故不為世慢如下顯喻上二句舉喻下五句合法。",
        "translation": "The first five phrases in the first section show that they can be revered. This word refers precisely to the principle treasure that's not arrogant in the world because it's free from obstruction, as follows: \"The first two phrases show the parable, and the next five phrases refer to the law.",
        "source": "X59n1095_001:0465a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若無專信雜事邪神雖受歸戒不得聖法故經云歸依於佛者真名清信士終不妄歸依其餘諸天神斯何故耶以真三寶性相常住堪為物依自餘天帝身心苦惱有為有漏無力無能自救無暇何能救物惟出世寶有力能持。",
        "translation": "If there's no dedicated faith, then even though evil spirits receive the precepts, they can't obtain the noble teaching.",
        "source": "X59n1095_001:0465a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "專信成歸中初四句正明一則專信二乃簡邪故下次引經雙證簡邪專信之理文出涅槃斯下徵顯經意初句徵以下釋初三句釋正境可歸自下六句釋偽境無力惟下二句結歸正理。",
        "translation": "In the first four sentences, he correctly explains that one is devoted to faith and the other is simple and mistaken, so the next time he quotes the sūtras to double-witness the principle of simple and mistaken devoted faith.",
        "source": "X59n1095_001:0465b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言歸依者如憑王力得無侵害今憑正寶威福無涯故使神龍免金翅之誅信士超夜叉之難五種三歸皆歸此寶。",
        "translation": "Those who say they take refuge in the king's power are like those who rely on the right treasure's might and merit, which has no limit and therefore enables the gods and dragons to avoid the death of Gold Wing and the faithful to transcend the difficulties of Yakṣas.",
        "source": "X59n1095_001:0465b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "別解歸意中初句牒定如下例釋憑王力者多論云以三寶為所歸所歸以救護為義如人獲罪於王投向他國以求救護彼王勅言汝求無畏以投我也莫出我境莫違我教必當救護眾生亦爾繫屬於魔有生死過歸向三寶魔無如之何神龍事見涅槃金翅鳥能噉龍唯不食受三歸者信士事出消災經彼云主人問於客我所事神畏子而走何耶客曰我犯酒戒為親所逐尚餘四戒故為天神所見營護於是邪神不敢當也主人求戒於客問佛所在遂往舍衛見佛經歷一亭中有一女端正是噉人鬼婦也托宿於此女人報言慎勿留此宜急前去男子問言用何等故將有意乎女人報言吾以語卿何用問為男子自念前舍衛國人完佛四戒我神尚畏我已受三自歸五戒何畏懼乎遂自留宿噉人鬼見護戒神徘徊其傍去亭四十里一宿不歸明日男子進路鬼見噉人骨狼藉衣毛為起等夜叉此云捷疾五下結示始自翻邪終乎具戒故云五種。",
        "translation": "The first sentence of this special explanation refers to the following example: \"By virtue of the king's power, many treatises say that the Three Treasures are what's to be relied upon, and what's to be relied upon is to rescue. Suppose a person is sinned against and the king throws them into another country to seek rescue and protection, and he commands you to seek fearlessness in order to throw yourself at me. Don't go outside of my realm; don't disobey my teaching; you will rescue sentient beings.",
        "source": "X59n1095_001:0465b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或即名之同相三寶由理通三世義盡十方常住二寶此為至極。",
        "translation": "They may be called the Three Treasures in common with each other, which are the ultimate in principle, and the two eternally abiding treasures in the ten directions, which have the same meaning as the three worlds.",
        "source": "X59n1095_001:0465c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋異名中初句標起由下推釋三世約豎深十方據橫廣常下顯勝上句標舉一理三寶由同真理皆常住故下句別顯理寶以純淨故故云至極問外宗以一體為同相今以理體為同相者答他宗不明理體但以一體為同相爾今約迷悟用別聖凡在凡則真性本同在聖則法身無別是則一體理體皆同相也若爾何故住法圖讚指此理體為區別之門。",
        "translation": "In the explanation of the different names, the first sentence identifies the arising from the following interpretation of the three worlds, about the vertical and deep, the ten directions, according to the horizontal and broad, and the eternal, the inferior, and the superior. The first sentence identifies the three treasures of the one principle as being eternally abiding because they are the same truth, and the second sentence shows the principle treasure separately because it's pure, so it's called the ultimate.",
        "source": "X59n1095_001:0465c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云若人得聞常住二字是人生生不墮惡趣斯何故耶以知法佛本性常故一時聞解熏本識心業種既成淨信無失況能立願歸依奉為師範固當累劫清勝義無陷沒如經有人受三歸依彌勒初會解脫生死此乃出苦海之良津入佛法之階位。",
        "translation": "The sūtras say that if a person hears the word eternal, they'll be born, and won't fall into bad destinies.",
        "source": "X59n1095_001:0465c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯功益中有四初經示聞熏二況下歸依得報三如下上生反證四此下結益有歸初中初四句引經文出涅槃斯下七句示意法佛常住如上所明解即是慧由聞經中本性常住解此正理以為能熏識心二字是所熏識即八識心字屬信即本識中本有信種今假聞熏則本識中信種成就故云業種淨信無失次中清勝則超乎六道無沒則出乎惡趣三中上生緣如下引四中此字正指理體眾生苦海假茲得度如得良津三乘入道必先歸戒故云階位階位猶漸次也。",
        "translation": "There are four benefits in manifesting merit. First, the sūtras show that hearing perfumes two situations, then the next refuge obtains its reward, then the next rebirth is the realization, then the next benefit is the conclusion that there's a refuge. First, the four sentences cite the sūtras that lead to the passage out of nirvāṇa, then the next seven sentences show the meaning that the Dharma-body buddha is eternally abiding as explained above, and understanding this correct principle from hearing the sutras that the original nature is eternally abiding.",
        "source": "X59n1095_001:0465c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以罪多惡重輕而慢者雖曾受歸隨緣還失是故智人初受歸時專心緣此得名歸依故感善神隨逐護助。",
        "translation": "It's because many sins and heavy evils are committed, and a conceited person who has previously accepted the precepts and follows the conditions nevertheless loses them that when a wise person first accepts the precepts, he focuses his mind on this and attains the name reliance.",
        "source": "X59n1095_001:0466a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡輕慢中初四句示慢機雖受還失是故下六句示信機一能成業二感勝用。",
        "translation": "The first four phrases of the admonition against being arrogant show the capacity for conceit even though it's been accepted and lost, so the next six phrases show the capacity for faith that first creates karma and second brings about superior effectiveness.",
        "source": "X59n1095_001:0466a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上明佛竟。",
        "translation": "After the above explanation of the Buddha, he finishes.",
        "source": "X59n1095_001:0466a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "後之二寶緣此而生如前廣敘以開靈府。",
        "translation": "The next two treasures arise in reference to this as was explained in detail earlier in order to awaken the spirit house.",
        "source": "X59n1095_001:0466a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "略法僧中緣此而生者由佛所證方顯此理則法由佛生僧隨脩學得證滅諦則僧因佛有靈府即心性也。",
        "translation": "When the principle is revealed by the realization of the Buddha, then the Dharma is produced by the Buddha, the saṃgha attains the realization of the truth of cessation after training, and the saṃgha has a spiritual mansion because of the Buddha, which is the nature of mind.",
        "source": "X59n1095_001:0466a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此理三寶能生化相弘道利生罪福通感故調達出血業成劫罪耆域出血業成梵福以化佛無心猶如光焰儀像非情體唯無記所感罪福還約法身由顯相狀法身依故以法本非形無漏無色不以相顯羣有何依故立像表真厥趣斯矣是知化佛供毀一自法身無有興亡獨稱常住言極繁矣意在通之。",
        "translation": "This principle is that the Three Treasures produce characteristics, promote the Way, and bring benefit to sentient beings, and cause mutual recognition of sins and blessings, so it's necessary to bring about the bleeding karma that causes kalpas and crimes, and the bleeding karma that causes purity and blessings because the transformation buddha is without mind like a blazing light whose deportment is not the essence of feelings but only the sins and blessings caused by indeterminacy.",
        "source": "X59n1095_001:0466a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生化相中初科有四初八句從真起用弘道感通二以化下八句攝用歸真推功有本三以法下六句推從真起用所以四是下六句顯推功由本所以初中初二句明起用次二句化相功能後四句敬毀報應即罪福感通之相調達即提婆達多此云天熱生時諸天心熱知其出世必破法故是佛堂弟具三十相出家之後專學神通廣誦法聚欲攝從眾為佛所呵而生忿恨遂結闍王教行二逆自欲害佛以要名利故舉大山飛空壓佛隨侍金剛杵擬山碎迸石飛來出佛指血故墮阿鼻一劫受罪斯由惡心出血感罪也耆域或云耆婆此云能活初生之時手持藥囊及以針筒善能醫治乃闍王之臣曾為世尊針足出血由此果報一劫生天斯由善心出血獲福也次中初二句化相非真儀下二句住持無記所下二句推用歸體功由法身由下二句反釋三中初二句示法身之體初曰非形無分段故次曰無漏超諸有故後曰無色非質礙故不下示法身之相以法身冥寂雖無形色而能示現三十二相八十種好色相炳然故知化身即法身之相也即依此相導利羣生出假化他其旨在此故云厥趣斯矣厥即其也趣即旨也此言立像即通化相四中初二句推本無下顯用若約小教則有生滅今約大教故無興亡如法華經良醫之喻劫火焚世靈山儼然竝指化身即稱常住言下結囑。",
        "translation": "In the first section of the aspect of birth and transformation, there are four first eight sentences that arise from the truth and use the vast path to bring about penetration, two that take the eight sentences under transformation and return to the truth, and push the merit to have a root, three that take the six sentences under the Dharma and push the merit to have a root, and four that take the six sentences under the sixth sentence to show that the merit arises from the truth, the first two sentences clarify the arising of the merit, the second two sentences explain the function of the aspect of transformation, and the last four sentences honor and disparage the merit of the response, that is, the merit of the sin and the transfer of the merit of the aspect of adjustment, that is, Devadatta, which is a cloud of heavenly fever, when the gods are born with feverish hearts and know that their appearances in the world will break the Dharma.",
        "source": "X59n1095_001:0466a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以澆淳在數倚伏赴機故列三法限於萬載所以金河西竭玉關東騖代出八九年逾六百三遭殄除終還興顯有何致斯曆數未也萬載已後澆風不追固無傳授天祿終也由慈氏運開緣生道會淳源將發交謝應期不虗設也。",
        "translation": "But because the pouring of the simple is in the number of years, the leaning of the quiescent to the opportunity, the three dharmas are listed as limited to ten thousand years, so the golden river, the Gaṅgā River, the jade barrier, the east, and the generation of the successors are eighty-nine years old, more than six hundred and three times in the past, the wasting of time, and the final return of the successor to the manifestation of what has not yet happened in the calendar.",
        "source": "X59n1095_001:0466b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科前言化佛本無興亡今約赴機以示生滅初二句總約住劫千佛以明以劫初則淳劫盡則澆故佛隨機出於減劫度人多少住壽短長莫不隨機故有出沒故曰倚伏倚隨也伏潛也故下即彰今佛立法有數正兼像末故云三法正像各千末法一萬今舉大數爾所下躡顯廢興以彰數定又三初八句謂曆數有在雖廢不亡萬下次四句謂天祿永終慈光掩耀三由下五句仍引後佛以顯不亡初中初句教隱中天金河梵語跋提世尊涅槃在此河側故云西竭次句法流東夏玉關即夷夏接境之關名所謂玉門關也佛法東漸迹由斯入騖(音務)馳也代下四句經時遭難大法彌堅代出八九者自漢明丁卯迦竺初來迄于唐朝九遷時代計其甲子六百餘齡三遭殄除者住法圖讚云初夏赫連勃勃得三秦地殊不信佛繪像為衣披之令人禮佛即為禮我後為天震而死及塟又震出之其子曰冐襲位破長安滅佛法逢僧斬戮有沙門曇始被刃不傷因爾改心次元魏大武重道士冦謙之為立道壇司徒崔皓讒於佛法帝然之太平真君七年遂滅佛法逢僧梟斬至十一年曇始又諫帝被厲疾遂誅崔氏其子文成重立佛法光顯紹續又次周武帝納道士張賓及前僧衛元嵩讒遂毀二教安法師著二教論以抗之帝聞之存廢理乖遂雙除屏建德三年除蕩關內六年除蕩關東自謂得志于天下也未及一年身喪國亡有下推不滅之理三中既釋迦緣謝則慈氏運開運開宜興緣謝宜隱一隱一顯莫不順機據本尋源實唯一佛故法華云然燈佛等皆是我身出沒隨時實無生滅緣生謂機熟也道會契機說法易可化也。",
        "translation": "The second section of the previous section says that the transformation buddha originally had no rise and fall, but now we're talking about going to the opportunity to show birth and death. The first two sentences summarize the thousand buddhas of the eon of abiding in order to explain that at the beginning of the eon, it's simple, and at the end of the eon, it's sprinkled, so the buddhas randomly emerge and decrease, depending on how many people they save, how long they live, and how long they're not random, so there's an ebb and flow, so it's called a leaning, a following, a following, a following, a manifestation of the present buddha's law that has a number of positive and negative images, so it's called a thousand positive images of each of the three things, and ten thousand negative images of each of the last things.",
        "source": "X59n1095_001:0466c01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "此明理寶是歸依所宗故覆詳之令心有寄故出耀云道之在心不問老少惟在剛烈乃名道耳信心以存何往不剋文良證也可不鏡哉。",
        "translation": "This explains that the treasure of principle is the doctrine that takes us back to, so it's covered in detail so that the mind has something to put its trust in.",
        "source": "X59n1095_001:0467a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結中應先問云此明理體何得廣談化相將文答之欲顯理體是三種之宗以末顯本令心有寄也故下引經策勸文有二意一曰剛烈意在勸脩二曰信心意在勸信。",
        "translation": "In the conclusion, the question should be asked first, \"How can this clarification of the essence of principle be discussed in detail about the transformation aspect?\" The text will answer it in order to show that the essence of principle is the denomination of the three kinds, so the derivative will show the fundamental and cause the mind to have support. Therefore, the following quote from the sutra encourages the text to have two meanings: first, fierce, which encourages cultivation; and second, faith, which encourages belief.",
        "source": "X59n1095_001:0467a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三明化相三寶者。",
        "translation": "The third is to explain the Three Treasures of the transformation aspect.",
        "source": "X59n1095_001:0467a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三標言化相者應機而現有形狀故如佛與僧皆證滅理心住無相而示此相故云化相。",
        "translation": "The three banners say that the characteristics of transformation are manifested in form according to the opportunity, so it's called the characteristics of transformation because the Buddha and Saṃgha both realize the principle of cessation and the mind abides in marklessness.",
        "source": "X59n1095_001:0467a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "謂釋迦如來為佛寶也所說滅諦為法寶也先智苦盡為僧寶也此化相三寶或名別相。",
        "translation": "The Śākyamuni Tathāgata is the Buddha treasure, the truth of cessation as explained is the Dharma treasure, and prior knowledge of suffering's end is the Saṃgha treasure. The Three Treasures of the transformation aspect may be called a different aspect.",
        "source": "X59n1095_001:0467a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中辨名體初科釋迦乃一佛之別號如來是諸佛之通名今標釋迦葢彰別相通別名義如常所聞滅諦同前但前約所證之理今據所說之教先智苦盡者總收小乘賢聖五位先智即是七方便人僧祇律云先法智後比智謂慧解脫人(云云如彼)苦盡即四果人證真斷苦不入惡道賢聖雖殊皆有所證苦取所證屬前理體今取能證故云化相問若取儀相有濫住持答凡聖分之問凡通佛世聖及未來答佛後之聖非化相佛世之凡是住持此下會釋異名問外宗亦談別相同異如何答彼以佛有法報化三身不同法有教理行果四種之別僧有大小八輩五位之異此則總約三身事理以論別相若華嚴宗別約舍那別說圓頓別為上機猶如王者異於羣庶今言別者局就化相言之則佛佛化身不同如釋迦彌陀等身量大小壽命依正說法被機各各差別故云別相名同義異如上可分問若將三身配今四寶其理如何答三身約教離分不同約理究本實唯一佛從本垂跡故有二身(真應)隨機大小則有三身(法報化)分別理智總有四身(凡聖同具曰自性法身理也三祗脩顯曰自受用身圓鏡智也從體起用別應上機曰他受用身平等智也應三乘機說半滿教曰變化身成事智也)今以自性因位法身配屬一體自受用身果上自性配於理體他報化身竝屬化相(由各對機有所說故)住持假立非此可配且據事分終歸理一。",
        "translation": "The first section of the explanation discerns the essence of the name. Śākyamuni is the distinctive name of one Buddha, and the Tathāgata is the generic name of the buddhas. The label Śākyamuni now highlights the distinctive aspect of the generic and distinctive names, as always heard of the noble truth of cessation, but the prior principle of the realization is the same as the prior knowledge, and now according to the teaching explained, the prior knowledge is the seven expedient persons.",
        "source": "X59n1095_001:0467a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "體是無常四相所遷滅過千載但可追遠用增翹敬。",
        "translation": "The essence is impermanent, and the four marks of the body have been extinguished for more than a thousand years, but they can be traced back to a distant past and used to increase reverence.",
        "source": "X59n1095_001:0467b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "體狀中初正示且據佛寶四相即生老病死如佛有示生人滅之相等他宗謂之有為無漏色滅下勸敬奉追遠文出論語謂世尊入滅不覩慈容但可追慕遐想聖恩起敬心爾。",
        "translation": "In essence, the first thing he shows is that according to the four phases of the Buddha's treasure, birth, aging, illness, and death, the Buddha's manifestation of the cessation of life is called by other schools equal to the cessation of existent, uncontaminated form, and the second thing he encourages is to honor, respect, and pursue the far-reaching passage out of the treatises that says the Bhagavān entered into extinction without seeing his compassionate countenance but can be admired, revered, and conceived of as a noble grace.",
        "source": "X59n1095_001:0467b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以賢劫中三佛已往無我第四羣生何依長淪苦海解脫無路是以能仁膺期出世說法度人。",
        "translation": "Because the three buddhas of the good eon have departed without a self, and the fourth group of sentient beings has no refuge in the ocean of suffering and no path to liberation, Neng Ren expects to appear in the world to teach the Dharma and save people.",
        "source": "X59n1095_001:0467b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯功益中初科初指前佛已往顯須出意言賢劫者謂此劫中有千聖現故號為賢三佛已往者一拘樓孫二拘那含三名迦葉三聖既滅則正化潛光四佛不興則羣生無怙是下顯今應運光紹聖蹤。",
        "translation": "The first section of the manifestation of merit refers to the previous buddha's past to show the mind that must emerge.",
        "source": "X59n1095_001:0467c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "開八正之玅門示一直之平道近出人天之欲泥遠登賢聖之津筏將趣斯道堦漸有由說理三寶令物歸向豈非真理常住乘權御實疎解形心稱為佛子受道之賓證澄無之本淨筌蹄之喻顯性空之玄理事義光矣神用明矣羣生依資生滅盡矣。",
        "translation": "Opening the eightfold correct path, showing that it's always been the level path, nearly escaping the mire of human and divine desire, and far ascending the raft of the wise and noble, he'll go to this path, which is gradually cleared by explaining the principle that the Three Treasures cause things to return to, isn't that the truth, eternal abiding, the vehicle, the expedient, the real, and the poorly understood form and mind called the Buddha's son, the guest who receives the path, realizes the innate purity of Chengwu, the metaphor of the chyuan's hoof, reveals the profundity of nature and emptiness, and the meaning of the council is illuminated, the spiritual function is clarified, and the support of sentient beings for birth and extinction is exhausted.",
        "source": "X59n1095_001:0467c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次中初正示次受道下結益初中初二句總示所說法門八正即見思語業命進念定此八總之即是三學前二屬慧中三屬戒後三屬定正以簡邪門以入道三乘聖者由此入故一直平道即是一乘近下二句示設教之意若約五乘拔三途苦與人天樂即此人天亦是出處今約本意人天雖勝猶陷欲泥故設三乘令超三界故曰近出遠登然上言八正即所乘之筏今云賢聖即能乘之人八正則三乘共脩賢聖則大小別位一直平道菩薩獨遊究竟所歸是佛本意將下四句躡示化儀次第斯道即理體三寶捨名就理即是一乘此乘深玅入須漸次故設八正三乘以為階漸後說一乘顯理三寶眾生聞解得證一乘皆由所說真如理故豈下四句美其聖意設化有儀理體是實化相是權理體無形非權莫示故乘化相之權以御理體之實故曰乘權御實眾生形心縛於俗習如枷鏁也佛施玅教而解脫之如疎解也言佛子者法華經云真是佛子從佛口生從法化生得佛法分次中初明得益上二句機有所證謂本淨也下二句教有所顯謂性空也妄想本寂謂之澄無法性天真謂之本淨性本淨故謂之性空事下次結歎初二句歎教以教顯理故曰事義以智鑑機故曰神用光謂光顯明謂無隱後二句歎機依資即師奉也師教奉脩皆證理體故云生滅盡矣。",
        "translation": "In the next section, the first two sentences summarize the eightfold correctness of the teachings that are explained, namely, views, perceptions, words, actions, livelihoods, intensities, and concentrations. The eightfold in summary are the three precepts, the two precepts, the middle three precepts, the three precepts, the last three precepts, and the three concentrations.",
        "source": "X59n1095_001:0467c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "既而能事已隆告以數終之運非色現色表法身之不亡無形留骨示化迹之無泯所以碎身以生物信全眼以導神功斯道莫思恩德非謝。",
        "translation": "Now that the task has been accomplished, I've been told that the number of terminal transits is not form presenting form to express the immortality of the Dharma body, the immateriality of bones to show the inexistence of the traces of the teaching, and so breaking up the body to create faith, the perfect eye to guide the spiritual work of the Way, and I don't think merits are appreciated.",
        "source": "X59n1095_001:0468a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "生起住持中初科初明化相示滅能事隆者釋尊一代化事盛也然而盛必有衰生必有滅所作既辦須入涅槃故云告以數終也非下正明生起初以化顯真表其不滅言既入滅復本法身法身圓寂故云非色仍出金棺重示相好故云現色既滅復現可驗不亡無下次用住持以顯化相化相已滅故云無形舍利猶存故云留骨碎身者王勃云碎金剛之聖身為舍利之遺骨全眼者釋迦方志云那伽羅城即古華氏城城東南三十餘里有佛髑髏狀如荷葉其色黃白有佛眼睛大如奈許青白映徹等斯下結顯化相功能以上表真佛自能利生復生住持此恩此德罔極難酬故云非謝。",
        "translation": "The first section of the arising and abiding section first clarifies that the transformation aspect shows cessation, and the person who can do the work is prosperous, yet prosperity must lead to decay, birth must lead to cessation, and the work must be accomplished before entering nirvāṇa, so it's called the end of a number of times.",
        "source": "X59n1095_001:0468a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故當敬養塔像興起信根先備此心方知由委。",
        "translation": "Therefore, you should venerate the stūpa and image, arouse the faculty of faith, and then prepare this mind to understand the reason.",
        "source": "X59n1095_001:0468b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次中欲立住持故先勸信此心即信心也。",
        "translation": "In the next section, he wants to establish abiding, so he first encourages faith, which is faith.",
        "source": "X59n1095_001:0468b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四明住持三寶者。",
        "translation": "The fourth clarification is about those who abide in the Three Treasures.",
        "source": "X59n1095_001:0468b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四中標言住持者住謂安住世間持謂任持不絕。",
        "translation": "In the fourth, the label abiding means abiding in the world, and maintaining means maintaining without breaking.",
        "source": "X59n1095_001:0468b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人能弘道萬載之所流慈道假人弘三法於斯開位遂使代代興樹處處傳弘匪假僧揚佛法潛沒至如漢武崇盛初聞佛名既絕僧傳開緒斯竭及顯宗開法遠訪華胥致有迦竺來儀演布聲教開俗成務發信歸心實假敷說之勞誠資相狀之力名僧寶也。",
        "translation": "When people are able to spread the way, the path of compassion has been streamed for 10,000 years, and the three dharmas are spread by people in order to make them flourish from generation to generation.",
        "source": "X59n1095_001:0468b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋中正推僧寶中有三初八句立理推功至下十句約事反顯實下三句結判初中前四句明人法相對上二句約人弘法下二句以法推人三法即三寶也後四句正顯傳法住持之功代代約時節處處據方所興樹傳揚義同流布次中初二句非僧不弘漢武即前漢武帝元狩中北伐凶奴王獲金人以為大神列於甘泉宮而禮事之後鑿昆明池得黑灰問東方朔朔曰此非臣所知可問西域胡道人準此胡道人即指佛也及下六句由僧開法顯宗即後漢第二主明帝也諡曰顯宗即光武第四子以永平三年夜夢金人傅毅奏曰臣聞西方有聖人一千年後教流此土陛下所夢其必是乎至七年甲子遣蔡愔等將命求之至大月氏國遇摩騰法蘭白馬駄經[疊*毛]繪聖像自西而來至十年丁卯同還漢地此即神州三寶之始由二尊者首揚慈訓悅服邪徒現希有之通開未萠之信自此德化草偃風行人到于今咸受其賜。",
        "translation": "釋中正推僧寶中有三初八句立理推功至下十句約事反顯實下三句結判初中前四句明人法相對上二句約人弘法下二句以法推人三法即三寶也後四句正顯傳法住持之功代代約時節處處據方所興樹傳揚義同流布次中初二句非僧不弘漢武即前漢武帝元狩中北伐凶奴王獲金人以為大神列於甘泉宮而禮事之後鑿昆明池得黑灰問東方朔朔曰此非臣所知可問西域胡道人準此胡道人即指佛也及下六句由僧開法顯宗即後漢第二主明帝也諡曰顯宗即光武第四子以永平三年夜夢金人傅毅奏曰臣聞西方有聖人一千年後教流此土陛下所夢其必是乎至七年甲子遣蔡愔等將命求之至大月氏國遇摩騰法蘭白馬駄經[疊*毛]繪聖像自西而來至十年丁卯同還漢地此即神州三寶之始由二尊者首揚慈訓悅服邪徒現希有之通開未萠之信自此德化草偃風行人到于今咸受其賜。",
        "source": "X59n1095_001:0468b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所說名句表理為先理非文言無由取悟故約名教說聽之緣名法寶也。",
        "translation": "The names and phrases that are explained represent the principle as the first principle that there's no way to get awakening apart from the language, so the names and teachings that are explained and heard are called the Dharma treasure.",
        "source": "X59n1095_001:0468c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次法中初正示不出聲名句文大小教文以之為體名即名字能詮自性句謂句逗能詮差別此二同是非色非心必假聲傳故云所說上竝能詮理是所詮故云表理故下結示。",
        "translation": "Next, in the teaching, the first thing that is directly shown is that it doesn't produce the sound, the words, the phrases, the large and small teachings, and the words as their essence, the name, which is the name, can explain its own nature, the phrase, which is a teaser, can explain the distinction between these two, which are the same, and which are neither form nor mind, which must be transmitted by means of sound.",
        "source": "X59n1095_001:0468c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此理幽奧非聖不知聖雖云亡影像斯立名佛寶也。",
        "translation": "This principle is mysterious, not known to sages, and although the sages say that images are lost, they establish the name Buddha treasure.",
        "source": "X59n1095_001:0468c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛寶中初二句以法推人下三句正顯佛寶。",
        "translation": "Of the buddha treasures, the first two phrases use the teaching to deduce the person, and the next three phrases correctly reveal the buddha treasure.",
        "source": "X59n1095_001:0468c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但以羣生福淺不及化源薄有餘資猶逢遺法。",
        "translation": "However, because the fortune of sentient beings is shallow and lacks the source of transformation, they have few remaining resources and still encounter the remaining Dharma.",
        "source": "X59n1095_001:0468c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "欣遇中上二句自責不值化相斯由障重下二句自慶得逢遺像良謝宿因。",
        "translation": "In the first two sentences, he blames himself for not having met the characteristics of the Buddha because of the heavy hindrances, and in the second sentence, he congratulates himself on meeting the remaining images and thanks himself for their past causes.",
        "source": "X59n1095_001:0468c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此之三寶體是有為具足漏染不足陳敬然是理寶之所依持有能遵重相從出有。",
        "translation": "The essence of these three treasures is that they are existent, defiled, and deficient in terms of presenting reverence, yet they are the basis for the principle treasure, which holds, complies, and respects aspects that escape existence.",
        "source": "X59n1095_001:0468c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "約體推敬中初科初四句示體佛是土木法乃紙素皆是有為上指騰蘭以為僧寶豈稱有漏今據末代多是凡夫故有漏染理非可敬然下推功須奉一能顯理二能導物。",
        "translation": "In the first section, the first four phrases show the essence of the Buddha as earth, wood, and dharma as paper and vegetarian, all of which are existent. The above refers to Tang and Ran as the saṃgha treasure, how could it be called contaminated? Now, according to the late generation, most are worldlings, so the principle of contamination and defilement is not honorable, but the next deduction is that merit must be given to one that reveals the principle and two that guide things.",
        "source": "X59n1095_001:0468c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "如俗王使巡歷方隅不以形徵故敬齊一經云如世有銀金為上寶無銀有鍮亦稱無價故末三寶敬亦齊真。",
        "translation": "As the secular king's envoy travels to different corners of the world, he doesn't rely on physical attributes, so he venerates the same scriptures that say, \"If there's silver and gold in the world, that's the highest treasure.",
        "source": "X59n1095_001:0468c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今不加敬更無尊重之方投心何所起歸何寄故當形敬靈儀心存真理導緣設化義極於斯。",
        "translation": "Without reverence now, there's no more respectful way to cast your mind, so where will it rise and what will it lead to? Therefore, you should honor the form, revere the spirit and conduct yourself with the truth in mind, guide the conditions, and set up the transformation that's most meaningful.",
        "source": "X59n1095_001:0469a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "責過勸行中初四句示不敬之過故下二句立敬法形心屬能敬靈儀屬所敬以形敬像以心緣理若緣所敬即是理體若解唯識即是淨心真俗圓脩義如下說後二句結美化儀。",
        "translation": "In the first four sentences of \"Rewarding faults and encouraging practice,\" the next two sentences establish the principle of reverence, the form, the mind as the object of reverence, and the spiritual deportment as the object of reverence.",
        "source": "X59n1095_001:0469a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經云造像如麥獲福無窮以是法身之器也論云金木土石體是非情以造像故敬毀之人自獲罪福莫不表顯法身致令功用無極。",
        "translation": "The sūtras say that making an image like wheat obtains unlimited merit because it's a vessel for the Dharma body, and the treatises say that the bodies of gold, wood, earth, and stone are nonconceptual in order to make an image, so the person who venerates and disparages it obtains their own sins and fortune. Nothing less than this shows that the Dharma body has limitless utility.",
        "source": "X59n1095_001:0469a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四中初則無上依經舉極小以況其大次即大智度論舉非情以推其理經文如後具引罪福同上所明。",
        "translation": "Of the four, the first is unsurpassed, relying on the sūtras to cite the very small in order to describe the great, and the second is the Mahāprajñāpāramitā-śāstra to cite the insentient in order to deduce its principle.",
        "source": "X59n1095_001:0469a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "故使有心行者對此靈儀莫不涕泣橫流不覺加敬但以真形已謝唯見遺蹤如臨清廟自然悲肅舉目摧感如在不疑今我亦爾慈尊久謝唯留影像導我慢幢是須傾屈接足而行禮敬如對真儀為我說法今不見聞心由無信何以知耶但心用所擬三界尚成豈此一堂頑癡不動大論云諸佛常放光說法眾生無始罪故對面不見。",
        "translation": "Therefore, even if a practitioner with a mind for this spiritual ceremony doesn't weep and cry profusely, he doesn't realize that he's being honored but only sees his remains as he approaches a clear shrine, naturally pitying and solemn, raises his eyes, and destroys his senses as he does without doubting them.",
        "source": "X59n1095_001:0469a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "示敬法中初事中初科有二初示敬情如對下責過初中初四句正示敬情但下推發敬所以由不見化佛但見住持以斯感激故興悲仰如下四句舉俗例顯清廟即國家宗廟圖寫祖考容儀使子孫祀而敬之以強祖先之德故云清廟今則比乎是也今下四句合法是下二句以事推情理須加敬次中又三初四句躡事正責以佛無私應志誠感神感而未通由我無信心由合作由心何下次五句徵顯敬慢初舉事況心用即是意思心造善惡報分六道業有定散故分三界豈下以敬比量謂一念妄心尚成三界豈可誠心堅信不能感格一堂聖像使放光現瑞以彰靈感乎頑癡上文云儀像非情體唯無記大下三引論反證不信之失。",
        "translation": "The first is to show respect for the Dharma, the first is to show respect for feelings as opposed to the second is to rebuke the fallacy. The first four sentences correctly show respect for feelings, but the second is to promote respect because we haven't seen the transformation buddhas but have seen the abbot, so we are grateful and therefore feel compassion.",
        "source": "X59n1095_001:0469a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是須一像既爾餘像例然樹石山林隨相標立導我心路無越聖儀。",
        "translation": "It's necessary to have one image, and so the other images are examples of trees, rocks, mountains, and forests that are marked out according to their characteristics to guide my mind along the path without going beyond the holy rituals.",
        "source": "X59n1095_001:0469b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "次科有二初則不專一像故曰餘像例然次則不專靈像故通萬境以境顯心心通境遍故樹石等皆表聖儀。",
        "translation": "There are two subsections. First, it's not exclusively one image, so it's called the remaining images are examples. Second, it's not exclusively spiritual images, so it's possible to use all objects to reveal the mind and the mind to penetrate objects, so trees and rocks and so forth all express noble manners.",
        "source": "X59n1095_001:0469b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又作是念見雖是色了色心生心外無塵名為真觀言從心起實唯識有名為俗觀。",
        "translation": "Also, when he is mindful of this view, even though it's form, he sees that form arises in mind, and there's no dust outside of mind, which is called true contemplation, and that words arise from mind and are really consciousness-only, which is called mundane contemplation.",
        "source": "X59n1095_001:0469b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "理中初科即唯識玅觀也問此明三寶何言唯識答理合然也初說一體即是唯識一是非二遮無境故體是本識表理實故脩成理體則轉識以成智也次依理體現於化相此從體以顯用也後依化相生起住持此從用以留迹也雖迷悟體用之異莫不皆是唯識所流然今住持三寶佛法非情僧具漏染還是一體真妄同源不以觀融無堪反淨故今躡事以理融之則身對靈儀心存真理真理者即唯識之本性是諸佛之法身故使脩敬行人對住持之儀相達唯識之玅觀悟一體之真性證理體之法身是知吾祖約此禮敬一法廣顯真俗意在正明唯識真觀也又此且約所敬勝境以明真俗若能敬身心所行事理竝委真俗篇明之就文為二初三句躡事總顯次五句正示真俗初中因事明理故云又作此念念是思慧能觀智也色即靈像所敬境也約情妄見謂有實體故云見雖是色遍計性也今入正觀玅智圓解即是自心妄現境界故曰了色心生依他性也問心通真妄此言心生為真為妄答若約從真起妄唯一真心今約返妄漸脩必須次第準下俗觀應含二心初曰言從心起即是六心意言分別故有名相次曰實唯識有即是八心妄現境界故有影像總包二義故曰心生次中上二句明真觀下三句顯俗觀初中心外無塵者由前了色既從心生則能分遣外塵邪執翻遍計性證無相性故名真觀行事鈔云諸法外塵本無攝論云知塵無所有通達真(云云)俗觀中即前真觀會色歸心色相既空心相須顯心有二相言從心起即是意言若但唯意言則濫而非實雖空遍計但遣妄塵不了依他終成偏計故復遣濫的示心源故云實唯識有二皆心相故名俗觀須知前明真觀離俗無真後明俗觀離真無俗諦了竝觀莫疑前後問此何位人能住此觀答行位不同不可一槩約行而言初心凡夫便脩此觀即名此人為大菩薩即說此行為佛果證行故文云唯識四位凡聖通學起信疏云十信之初發心之時即觀本識自性緣起因果之體得成正信據位而言約文準論願樂行人能證此理(即四十心并四加行)問諸家於此通收四位今特異之請言其致答不識觀相故有濫通此觀唯遣外塵意言猶在何得於此妄通高位故攝論云若至登地故似唯識意言分別亦不得立今觀意言豈通高位文中明判名願樂地脩道人也問既言脩道何得言非答此言獨指願樂地中脩行道行之人非脩道位文自釋云道為人脩人能脩道等何得不曉。",
        "translation": "Although the difference between delusion, awakening, essence, and function is not without its traces in consciousness-only, the upholding of the Three Treasures, buddha, dharma, non-sentient beings, saṃgha, contaminated, defiled, or one and the same origin of truth and delusion is not fused by contemplation, and there's no possibility of a counter-purification.",
        "source": "X59n1095_001:0469b16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "漸次增明念念無絕時功既積熏習逾增觀道脩明不迷緣假名願樂位脩道人焉道為人脩人能脩道故稱行者名為道人。",
        "translation": "Gradually, it becomes clearer that mindfulness is never cut off when accumulating accumulation of effort and permeation is more than enough to observe the path and to cultivate awareness, not confusing the conditions and nominally naming the person who cultivates the path in the stage of joyful vowing, which is called the practitioner who cultivates the path because the path is a person who cultivates people who can cultivate the path.",
        "source": "X59n1095_001:0470a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因脩顯位中初六句歷觀起脩名下二句顯其行位道下四句返釋觀道脩明住真觀也不迷緣假住於俗觀不昧事儀也又可觀道即能觀智緣假即所觀境緣謂緣生諸法遍計性也假謂假有識相依他性也緣生本無即真諦境唯識假有即俗諦境觀智明白真俗歷然故曰不迷等願樂地者資糧加行同前所明脩道人者文中自釋不同古人是脩道位。",
        "translation": "In the first six sentences, the successive contemplations reveal the stages, and the next two sentences reveal the stages of practice, and the next four sentences return to explain that contemplating the path, Sauming, abides in true contemplation, not misconstruing causation and falsity, and abides in worldly contemplation, not ignoring the ways and means.",
        "source": "X59n1095_001:0470a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今則聞告懷嫌誠當實錄日損之謂於斯自明可不誡哉。",
        "translation": "Now, those who hear and report about it, harbor resentments, and sincerely record the meaning of daily impairment are self-evidently admonished.",
        "source": "X59n1095_001:0470a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結誡中意謂有人聞此所告或起嫌疑但當以真言實錄以自驚悟庶令煩惱日損觀道日新矣。",
        "translation": "The concluding admonition means that someone who hears this advice might become suspicious but should record it accurately in true words to awaken themselves, so that their afflictions will be diminished day by day and their contemplation of the path will be renewed day by day.",
        "source": "X59n1095_001:0470b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋門歸敬儀通真記卷上",
        "translation": "Shimen guijing yitongzhen ji, vol. 1",
        "source": "X59n1095_001:0470b04_0",
        "is_bad_quality": false
    }
]