[
    {
        "source_sentence": "淨心誡觀發真鈔卷上(并序)",
        "translation": "Jingxin jingguan fazhen chao (and preface)",
        "source": "X59n1096_001:0518a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天台沙門　允堪　述",
        "translation": "Tendai śramaṇa Yunkan says",
        "source": "X59n1096_001:0518a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫學道者以明己為本立言者以益物為宗在昔聖賢率循此二茲誡觀者乃明己益物之教乎吾祖南山雖託訓於慈忍豈無意於將來愚慶荷大師之道凡二十載所述諸科記僅將百卷噫著文字而忘理觀者不亦病乎今年四十有一知浮世之過半遂用此觀為治心之法一日講次學徒有昧復立言以暢之勒成三卷題曰發真欲使履於斯道而發真歸源矣若然則又跂於日明已益物得無意乎。",
        "translation": "Although our ancestor Nanshan entrusted his instructions to Ciren, did he not intend for the future? I'm afraid I'm sick of hearing the great master's path for twenty years, and I've only mentioned a hundred volumes of notes on the subjects, so I've forgotten the principle of contemplation.",
        "source": "X59n1096_001:0518a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時慶曆五年歲次乙酉三月既望於錢塘淨住院講堂序淨心誡觀法序餘杭郡沙門釋　元照　述太近至易無如自心入死出生了不知覺其體明瑩其量包容故使一迷遽生諸法其猶寶鑑因明而像生又若長川緣澄而波動謂心異物為物轉心吸攬塵緣積成勞結淪歷諸有沈屈己靈餘趣無知人倫尠學縱令聽習多墮邪癡奔逐名聞封著知解至有江南江北走覓菩提曲見邪心未嘗正直野猿騰躍家犬遲迴勞我聖師提耳垂誨曲留妙藥的指病根囊括兩乘津通萬行託彼親度用表弘慈囑使竊闚恃彰秘勝深訶講論苦勉修治然古德傳通雙弘教觀諸部則以教開解斯文乃以觀示修既非無目而遊豈是數他之寶須信從真起妄舉體現前達妄即真不從他得淨心之要覽者宜知。",
        "translation": "時慶曆五年歲次乙酉三月既望於錢塘淨住院講堂序淨心誡觀法序餘杭郡沙門釋　元照　述太近至易無如自心入死出生了不知覺其體明瑩其量包容故使一迷遽生諸法其猶寶鑑因明而像生又若長川緣澄而波動謂心異物為物轉心吸攬塵緣積成勞結淪歷諸有沈屈己靈餘趣無知人倫尠學縱令聽習多墮邪癡奔逐名聞封著知解至有江南江北走覓菩提曲見邪心未嘗正直野猿騰躍家犬遲迴勞我聖師提耳垂誨曲留妙藥的指病根囊括兩乘津通萬行託彼親度用表弘慈囑使竊闚恃彰秘勝深訶講論苦勉修治然古德傳通雙弘教觀諸部則以教開解斯文乃以觀示修既非無目而遊豈是數他之寶須信從真起妄舉體現前達妄即真不從他得淨心之要覽者宜知。",
        "source": "X59n1096_001:0518a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨心誡觀發真鈔卷上本",
        "translation": "Jingxin jingguan fazhen chao shouben",
        "source": "X59n1096_001:0518b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "天台沙門釋　允堪　述",
        "translation": "Tendai śramaṇa Shi Yunkan said",
        "source": "X59n1096_001:0518b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨心誡觀法",
        "translation": "Jingxin jingguan fa",
        "source": "X59n1096_001:0518b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此誡觀者正由學人多滯心病未臻法源故我大師運以慈悲拯斯倒執闢乎二道統被三機始明小乘終伸大行前二十五篇彰自利後之四篇顯利他莫不括總羣經發明自證俾其來者咸證上乘又使夫由此觀者然後了萬有性相事理因果行位顯智無不盡矣雖八萬法門五千經卷不俟徧[門@免]而可該悉也亦由得其門而備觀宗廟之美矣下所謂一字之中含無量義其斯之謂歟又一切法本於自心心若明淨諸法顯了能達此理則遍能含攝豈以言詮廣略而滯於知見乎故今五字之目通貫眾篇矣且辨釋名題如初門自顯故於此鈔略而不解講者宜探取下文至時提授今但麤分能所何者如心之一字屬所淨與誡觀法四字屬能由人假法而能淨心言心者梵語質多此翻為心約小而論則但淨六識心矣故下云垢染漸滅心轉明淨如修五停心等觀是也據大而說則發起淨信息於妄念復一真心矣故下復曰起於大乘清淨信心趣向菩提種性住處故一題淨心二義通攝誡者警也觀者梵語毗鉢舍那此翻為觀以觀察為義法者則也常也可軌可則令物生解為義。",
        "translation": "This admonition and contemplation is precisely because students are often stagnant in their mental illness and have not yet reached the origin of the teaching, so our great teacher uses compassion to rescue them from this mistaken attachment by opening up the two paths and unifying the three faculties, first clarifying the twenty-five essays on the lesser vehicle and finally extending the four essays on the great practice, which manifest self-benefit and ultimately reveal benefit to others, and which do not fail to summarize the various scriptures, invent self-realization, and cause and effect, practice, and position, and reveal wisdom that is inexhaustible.",
        "source": "X59n1096_001:0518b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "終南山沙門釋　道宣　撰",
        "translation": "By Dao Xuan, an ascetic of Zhongnan Shan",
        "source": "X59n1096_001:0518c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "終南山者周之山名也五經要義曰長安之南山一名太一潘岳關中記曰其山一名中南言在天之中居都之南也山者國語曰土之聚也說文曰山者宣也宣氣產生萬物也今終南即大師深隱之地沙門者出家之通稱梵語沙門那此翻勤息謂勤勞息苦斷煩惱故或翻乏道以為良福田故能斷眾生饉乏以能修八正道故能斷一切邪道故涅槃曰沙門名乏那者名道如是道者斷一切乏斷一切道以是義故修八正道為沙門那從是道中獲得果故名曰沙門是故沙門之名通乎因果今大師即四依上士大乘觀行沙門也如般舟三昧豈下位之所行乎(般舟翻佛立能於定中見十方現在佛在前而立)大師凡滿二十餘會以三月為一限是知本高迹下現律師身而演律藏也故世以律師召焉又佛言辭親出家識心達本解無為法名曰沙門釋者具曰釋迦此翻能仁始尼樓聰遭擯止雪山中歸德如市鬱為強國父王遙歎我子能仁因改姓釋迦自後繼氏焉至淨飯王當第五代佛當第六今所稱者當第七也由出家五眾以佛為師故阿含曰四河歸海無復本名四姓出家咸稱釋氏大師名諱如西土以稱名為尊故子名有兼於父母者而後世稱之中夏以避名為尊父母既亡聞名則心瞿(音句驚悲也)故人諱之然廟中不諱臨文不諱道宣即大師名也感通等事如皇宋朝高僧傳撰者亦述也謂撰古遺文述而不作也。",
        "translation": "Zhongnan Shan is the name of Zhou's mountain, and the Essentials of the Five Classics says that the south mountain of Chang'an is one Taichi, and the Guanzhong ji says that its mountain is one Zhongnan, which means that it's in the middle of heaven and resides south of the capital.",
        "source": "X59n1096_001:0518c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬禮。",
        "translation": "\"Respect and worship.",
        "source": "X59n1096_001:0519a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "敬禮者敬恭也肅也禮者仲尼燕居曰禮也者理也君子無理不動又曰禮者體也(猶人身體)體不備君子謂之不成人設之不當猶不備也律中分大小禮次乃至如來及塔五眾通禮斯亦當也智論有三禮一口禮(即下禮)二屈膝頭不至地(即中禮)三頭至地(即上禮與周禮稽首同也)前一屬口業後二屬身業又敬通於心則三業具矣欲知禮法邪正不同如西竺三藏厥號勒那覩此下凡屬在邊鄙不閑禮法翻出七種一曰我慢心禮即無心恭敬外覩似恭內增慢惑如碓上下又如木人情不殷重故二唱和求名禮即口唱心散見人則身輕急捷人去則身惰心疲(此二行人不可為之)三身心恭敬禮即形心恭敬無有異念如佛有前手摩其頂導利人天為最功德雖大猶未發智後多退沒故四發智清淨禮達佛境界慧心明利禮於一佛即禮一切佛禮一切佛即是一佛法僧亦爾以解脫體同故心心轉明一拜一起淨業無窮果報無限五徧入法界禮即想自身從本已來不離法界不在諸佛身外亦不在內自性平等本無增減今禮一佛即遍通諸佛如一室中懸百千鏡有人觀鏡鏡皆像現佛身清淨明逾於鏡遞相涉入鏡無不照影無不現故地持論云不現前供養勝現前供養又諸佛德用既齊名號亦等隨稱何名名無不盡如稱釋迦名禮者一切諸佛無不備周以梵語釋迦此云能仁豈有一佛非能仁乎又如無量壽豈有一佛非長壽乎梵語彌勒此云慈氏(思益經云眾生見者得慈心三昧以無緣慈攝一切也)豈有諸佛非慈氏乎故智論云一佛勝能等一切佛勝能如是禮者周遍法界六正觀修誠禮此明自禮自身佛不緣他境他身佛何以故一切眾生佛性平等但為迷故專禮於他己身佛性妄認為惡若能返照則解脫有期故淨名云如自觀身實相觀佛亦然又隨力修明即是引出佛性三祇果圓即是至得果佛性況茲妙達唯局大聖若論下凡雖未頓修不得不解如涉遠道要藉自身欲見佛性要觀己佛法僧亦爾體同無二是名正觀禮也七實相平等禮大意同前前猶有禮有觀自他兩異今此一禮無自無他凡聖一如體用平等若見佛可尊可敬即見凡可卑可慢若起此心遂成僻執故般若經云是法平等無有高下是名阿耨菩提以實相離念不可以心取不可以相求不可以禮敬不可以慢情去高下離尊卑靜亂一源恭怠齊致此之一禮凡夫淺識聞恐反謗上智之人內行平等外順修敬內外冥合是名平等禮今之行人若欲修禮敬者當從淺至深隨力運想無使虗禮虗喪其功矣。",
        "translation": "Respect and worship are honoring, respectful, and solemn, and the worshipper Zhongni Yanju said, \"Respect and principle are also principles, and the gentleman is immovable without principle.\" Also, the worshipper is the body (like the human body), and a body that is not complete is called not adult, and a designation that is inappropriate is like not complete. The Vinaya divides the greater and lesser reverence into order and even the Tathāgata and the stūpa's five universal reverences.",
        "source": "X59n1096_001:0519a18_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "三寶藏薩婆若法身。",
        "translation": "The Three Treasures store the Dharma body of Sāvajñā.",
        "source": "X59n1096_001:0519c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三寶者名雖是一總含四種故戒疏云一理體者如五分法身為佛寶滅理無為是法寶聲聞學無學功德是僧寶二化相者如釋迦道王三千為佛寶演布諦教為法寶拘隣等五為僧寶三住持者形像塔廟為佛寶紙素所傳為法寶戒法儀相為僧寶四一體者唯約心體義分三相如涅槃說三寶同性等謂性本知覺為佛性本寂滅為法性本有河沙功德妙用與性一一相應和合無異為僧言藏者梵云俱舍此云藏以含攝為義謂三寶普遍含受無礙也故起信論首伸歸敬曰歸命盡十方最勝業徧知色無礙自在救世大悲者(佛寶也無礙即徧法界故)及彼身體相法性真如海無量功德藏(法寶也)後釋云無邊德藏僧(僧寶也)故今言藏義同彼論薩婆者智論云薩婆是法復次得薩婆若故名為佛又思益經云平等一切法名薩婆若聲聞緣覺所不能及又云於一切法中無礙故名薩婆若小遠云此翻一切智法身者小則五分法身戒定慧解脫解脫知見也大則清淨法身所言清淨者離垢出纏真如也不為二障等所污故法即軌生物解身則具體依聚三義且軌生物解者謂等覺位後解脫道中得自受用身時根本智內冥真理有軌解之義體依聚者無垢真如為體是體義與塵沙萬德及報化二身為依止名依義有常樂我淨積聚名聚義。",
        "translation": "Although the name of the Three Treasures is one, it always includes four kinds. Therefore, the commentary on the precepts says, \"One is the essence of principle, such as the five-part Dharma body as the Buddha treasure, the cessation of principle and nothingness as the Dharma treasure, and the merits of śrāvakas, trainees, and trainees as the saṃgha treasure.",
        "source": "X59n1096_001:0519c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨力誡初學惟聖哀愍聽。",
        "translation": "According to their powers, they admonish beginners to listen with compassion to the noble ones.",
        "source": "X59n1096_001:0520a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隨力下言隨己智力誡勗初學非敢呈於達者此亦示謙耳惟下不獨求德亦含請加也由哀愍聽許則無其障障若不生功由請護。",
        "translation": "Following the power, he says he'll admonish the beginner according to his own ability, not daring to present it to someone who has attained it. This also shows humility, but he's not only seeking virtue, he's also asking for it to be added.",
        "source": "X59n1096_001:0520a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "時在隋州興唐伽藍夏安居撰令送泰山靈巖寺付慈忍受持。",
        "translation": "At the time, he was sent to Tai Shan Ling Yan Temple by order of Xia Anju, the director of the Xing Tang temple in Sui Prefecture, to support by compassion.",
        "source": "X59n1096_001:0520a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "隋州屬山南道漢陽之地也春秋時屬楚即禹貢荊梁二州之域又左傳曰鬬伯比言於楚子曰漢東之國隋為大杜預注曰隋國今義陽隋縣也興唐則別名伽藍乃通稱具云僧伽羅摩此云眾園或云毗訶囉此云遊止夏安居者安居篇云由夏中壞行義多招譏復重故文云自今已去聽三月夏安居春冬過少必無事不依同結吉羅然聖人用心必該二利何者稟制禁足自利之行成立言訓人利他之道著實菩薩之行歟泰山者五嶽之東嶽也博物志云泰山一言天孫也五經通義云一曰岱宗言王者受命易姓報功告成必於岱宗也東方萬物始交代之處宗長也言為羣嶽之長也靈巖亦寺之別名案廣弘明云高宗興光元年帝於西武州西山石壁開窟五所鐫佛像各高七十尺次六十尺雕飾奇偉冠於萬代谷深三十里東為僧寺名曰靈巖慈忍僧傳不載始末之迹無得而聞斯亦實行潛光高而不名之士也。",
        "translation": "The Sui region is part of the Hangyang region of the southern Shandong province, and during the Spring and Autumn period was part of Chu, which is the region of the two states of Jing and Liang in Ugong. Zuo's biography says that Kumbhâṇḍa was spoken to by Chu's son, who said that the Sui region is now the Sui county of Yiyang, and Xingtang is known as Kālāma, which is a generic term that includes the name Saṃgharama, which means \"many parks\", or Vihāra, which means \"touring the summer retreat\", and the title of the retreat, which says that since mid-summer, the meaning of bad behavior has been much criticized and repeated.",
        "source": "X59n1096_001:0520a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡三十篇如右。",
        "translation": "The 30 commentaries are as shown on the right.",
        "source": "X59n1096_001:0520b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "篇者戒疏云篇類均等與諸章品義齊一也刑昺疏云篇者積章而成篇者徧也言出情鋪事明而徧者也。",
        "translation": "Part of the precepts commentary cloud part of the class equal and the chapter of the chapter of the same meaning also the last commentary cloud part of the accumulation of chapter and the formation of the chapter is universal also said out of feeling shop things clear and universal.",
        "source": "X59n1096_001:0520b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "釋名篇第一序宗篇第二五停篇第三",
        "translation": "The first chapter of the Explanation of Names is the second chapter of the Preface School, the third chapter of the Five Stops.",
        "source": "X59n1096_001:0520b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "挍量篇第四自慶篇第五善根篇第六",
        "translation": "The Fourth Chapter of the Sutra on the Assessment of One's Own Empowerment and the Fifth Chapter on Good Roots",
        "source": "X59n1096_001:0520b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "破戒篇第七邪命篇第八誑佛篇第九",
        "translation": "Chapter 7 on Breaking the Precepts and Chapter 8 on Improper Living and Chapter 9 on Saving the Buddha",
        "source": "X59n1096_001:0520b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "造過篇第十解脫篇第十一食緣篇第十二流轉篇第十三不動篇第十四過患篇第十五心濁篇第十六二報篇第十七結使篇第十八緣生篇第十九安般篇第二十相資篇二十一因果篇二十二止劫篇二十三二諦篇二十四心行篇二十五菩提篇二十六教化篇二十七佛性篇二十八福田篇二十九受持篇三十淨心誡觀法五字釋名篇第一初釋名篇夫法者有萬差必繫名定名彰五字理貫羣篇若不預明恐迷通義故立此解以冠其初言字與名者俱舍云名詮自性句詮差別文即是字為二所依第一者爾雅云第次也僧傳云第者為居一者為始此既居先故稱第一字者先儒云語助。",
        "translation": "造過篇第十解脫篇第十一食緣篇第十二流轉篇第十三不動篇第十四過患篇第十五心濁篇第十六二報篇第十七結使篇第十八緣生篇第十九安般篇第二十相資篇二十一因果篇二十二止劫篇二十三二諦篇二十四心行篇二十五菩提篇二十六教化篇二十七佛性篇二十八福田篇二十九受持篇三十淨心誡觀法五字釋名篇第一初釋名篇夫法者有萬差必繫名定名彰五字理貫羣篇若不預明恐迷通義故立此解以冠其初言字與名者俱舍云名詮自性句詮差別文即是字為二所依第一者爾雅云第次也僧傳云第者為居一者為始此既居先故稱第一字者先儒云語助。",
        "source": "X59n1096_001:0520b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨心者。",
        "translation": "\"The pure mind.",
        "source": "X59n1096_001:0520c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "於汝現行煩惱諸部過患教修對治令汝即時隨分解脫垢染漸滅心轉明淨發生定慧起於大乘清淨信心趣向菩提種性住處以今微因後感當果是故教汝察病對治興隆功業修入信境成決定根力。",
        "translation": "Teaching you to cultivate antidotes to the faults and problems of your existing afflictions will cause you to immediately and directly liberate yourself from defilement and gradually cease, so that your mind becomes clear and pure, concentration and wisdom arise, and pure faith in the great vehicle leads to the abode of the seed nature of enlightenment.",
        "source": "X59n1096_001:0520c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現行煩惱者以眾生於麤細惑障全未斷故自無始來常共現行也諸部下以內外過患非一故言諸而各有種屬故言部如含過患則非瞋等今亦隨患教修對治是故亦隨分而得解脫菩提此翻為道謂趣向大道無漏種性中作畢竟所依住處微因者通指淨心也當果者總包四十二位是故下彰下所示觀行功業即觀行欲修此法先須有信以信為道源功德母故根力下五根五力此略提道品之階級耳以五根中有信根五力中有信力故若望下四十二地此信境應収十信由具信故方入後位。",
        "translation": "The manifest afflictions are because sentient beings haven't completely eliminated the afflictive hindrances of the coarse and subtle, so they've always shared the same manifestation since beginningless time.",
        "source": "X59n1096_001:0520c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "其三賢十聖無垢妙覺四十二地空宗真理唯可知聞影像麤相。",
        "translation": "The three stages of worthies, ten sages, the pure and marvelous awakening, and the forty-two stages of emptiness are the only truths that can be known and heard, images, and coarse aspects.",
        "source": "X59n1096_001:0521a10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三賢華嚴明十住十行十迴向為賢十地為聖無垢妙覺者若合下四十二位則無垢屬等覺以此位斷十一品無明鄰真際極故若望斷盡無明則名妙覺方無垢矣四十二者即住行向地等妙二覺共成四十二若加十信即成五十二位諦觀法師束為七科謂信住行向地等妙又合七為二初凡二聖就凡又二信為外凡住行向為內凡亦名為賢約聖亦二十地等覺為因妙覺為果今既說賢位已上故揀去十信成四十二位又前云起於大乘清淨信心則又可包十信矣此収僧佛二寶也空宗真理屬法寶又是四十二位所證理故唯可下以凡夫未能親證但可知聞麤相又影像者喻未見其真。",
        "translation": "If he combines the lower forty-two stages, then Immaculate Marvelous Enlightenment belongs to the stage of Equanimity because this stage ends the eleven kinds of ignorance next to the ultimate limit of reality.",
        "source": "X59n1096_001:0521a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下地凡夫力所未及亦未能行。",
        "translation": "Ordinary people in the lower stages are beyond their ability and can't practice it.",
        "source": "X59n1096_001:0521b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下地者對聖賢上地故言下也馬鳴造遺教論亦召凡夫為下地也。",
        "translation": "The lower ground is called lower because it's the higher ground of the noble ones, and Ma Ming's theory of the transmitted teachings also calls worldlings to the lower ground.",
        "source": "X59n1096_001:0521b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今唯使汝淨除業鏡客塵[目*壹]等見汝身中少分佛性。",
        "translation": "Now, I only want you to purify the mirror of karma, the guest dust [eyes * one], and so forth, and see a small part of the buddha-nature in your body.",
        "source": "X59n1096_001:0521b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "業鏡鏡喻心也業収惑業又智論說天帝以大寶鏡照四州人善惡亦名業鏡又下文云大業之樹光明如鏡眾生造業於彼悉現客塵者古師云分別煩惱麤動如客微細難辨如塵此俱喻煩惱障也故楞嚴云以不住者名為客義以搖動者名為塵義[目*壹]爾雅云幽[目*壹]昧冥也又陰風也詩[目*壹][目*壹]其陰注云如常陰[目*壹][目*壹]然今取陰暗之象也少分者言未得全見也涅槃云十住菩薩見少分故如來全見十住菩薩所見佛性如後夜見色如來所見如晝見色又佛性品云譬如醉人欲涉遠道朦朧見道十住菩薩見少分故如來全見十住菩薩位階十地尚不了了知見佛性何況聲聞緣覺之人能見耶又況下位者乎。",
        "translation": "Mirror of karma is a metaphor for the mind, karma 収confusion karma and the Wisdom Treatise says that Indra uses a great precious mirror to illuminate the good and evil of people in the four states, also known as mirror of karma and the following cloud, the tree of karma shines like a mirror, sentient beings create karma, and it all appears there Guest dust is an ancient master cloud that discerns the afflictions and coarse movements like guests, subtle and difficult to discern like dust.",
        "source": "X59n1096_001:0521b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝可飲服般若甘露洗蕩蓋纏漸顯淨心心若清淨令眾生界淨眾生既淨則佛土淨。",
        "translation": "You can drink the ambrosia of prajñā and wash away the hindrances and gradually reveal a pure mind.",
        "source": "X59n1096_001:0521b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "般若秦言智慧照了一切諸法皆不可得而能通達一切無礙名為智慧今存梵名者謂祕密與多含此無順古生善故不翻弉師立五義般若可翻而存梵者為生善故大論云般若尊重智慧輕薄不可以輕代重也此智最勝故喻甘露甘露者一名天酒張華注神異記云天酒甘露也蓋纏五蓋十纏也心若下淨名云若菩薩欲得淨土當淨其心隨其心淨則佛土淨又或假佛力見淨者小遠涅槃疏云其土常淨物本見穢由前心不善故佛轉之今始見淨名為變土理實變心以此證知皆由心淨故佛土淨。",
        "translation": "Prajñācakra Chin says wisdom that illuminates all dharmas that are unobtainable and can penetrate all without obstruction is called wisdom.",
        "source": "X59n1096_001:0521b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "始除煩惱令戒清淨戒既完具定復清淨以戒定淨令智慧淨智既淨已顯自身源。",
        "translation": "After first removing the afflictions, the precepts are purified. Once the precepts are complete, concentration is again purified.",
        "source": "X59n1096_001:0521c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "顯自身源者身或可作心由上對治惑滅智淨則知此身具如來性起信問曰法界一相佛體無二何故不唯念真如復假求學諸善之行答曰譬如大摩尼寶體性明淨而有鑛穢之垢若人雖念寶性不以方便種種磨治終無得淨如是眾生真如之法體性空淨而有無量煩惱垢染若人雖念真如不以方便種種熏修亦無能得淨是故勸今始除煩惱修戒定慧乃可顯自心源。",
        "translation": "The person who reveals his own source may be the body or mind that's purified by the above antidotes, which remove afflictions and purify wisdom. Then he knows that this body possesses the tathāgata nature.",
        "source": "X59n1096_001:0521c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有此義故名為淨心。",
        "translation": "Because this is the case, it's called a pure mind.",
        "source": "X59n1096_001:0521c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "已下諸篇治過雖別同名淨心。",
        "translation": "The following essays address faults that are different but are also called pure mind.",
        "source": "X59n1096_001:0521c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡者令汝識知對治初門先除麤染根本惡業知病知藥守心慎口勵己修道離過患故名誡。",
        "translation": "The admonition is to make you aware of the first step in correcting them by first removing the root of defilement and bad karma, knowing illness and medicine, keeping your mind and being careful with your words, and encouraging yourself to cultivate a life free of faults and distress.",
        "source": "X59n1096_001:0521c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麤染根本者即誡財色等下文云一切苦因果財色為本等又從五停篇下皆是隨病設藥亦誡之義也勵己下明身業勵勉也。",
        "translation": "The root of the afflictions is the admonition against property and form, which follows as the cause and effect of all suffering, and property and form as the root, which follows from the five precepts and sets forth the meaning of the admonition to administer medicine according to illness.",
        "source": "X59n1096_001:0521c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀者察義觀察此誡與佛法相應不相應及障道過患名字句偈審諦思量如實解心得誡本意。",
        "translation": "\"He observes the meaning of this admonition, observing that it's not concomitant with the Buddha's teachings and that it hinders the path and its faults by naming the phrases, verses, and sentences, examining them with care and consideration, and truly understanding the original meaning of the admonition.",
        "source": "X59n1096_001:0521c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "觀察下謂觀此誡文更推求佛意若相應者可用不相應者則止猶十誦墨印義也此勸觀能治之法及障道過患者此勸觀所治之病也以觀病用藥方曰相應句偈者即下隨篇長行之後復出重頌是也宜以名字収長行句偈収重頌若通而論之句偈即名字也如實解心依此如實解了淨心名得誡觀本意。",
        "translation": "This exhortation to observe the qualities that can be cured and the afflictions and anomalies of the hindrances is to observe the disease that's being cured and to use the prescription for the disease, which is to say that it's appropriate to collect the long lines, the verses, and the verses, but if we discuss them together, the verses are also the names.",
        "source": "X59n1096_001:0522a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "又能隨順止觀二門此二法者定始慧初生長一切禪支道品故名觀。",
        "translation": "He also follows the two approaches of stilling and observing. These two approaches are the first concentration, the first arising of wisdom, and the growth of all the factors of the path of meditation, so they're called observing.",
        "source": "X59n1096_001:0522a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "止觀者止屬定觀屬慧止靜觀明也又在因謂之止觀在果謂之定慧今望生下禪支道品則俱為因矣一切禪支者即根本曰禪勝妙支林功德也初禪有五支二禪四支三禪五支四禪四支是也道品即三十七道品由此是入道淺深品類故云道品又支林道品悉從定慧而生定慧又從戒而起雖舉定慧義攝於戒。",
        "translation": "Stillness and contemplation are the cause, which is called stillness and contemplation, and the result, which is concentration and wisdom. Now, when we look at the birth of the lower meditative factors and the factors of enlightenment, they are both causes.",
        "source": "X59n1096_001:0522a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法者即此誡文首軸次第慇懃曉示欲使禁斷煩惱止諸惡業加行勝進住不退心故名為法。",
        "translation": "The teaching is the first axis of the precepts, which are presented in order and with care to make sure that the afflictions are stopped, the bad actions are stopped, and the preparatory practices are carried out with resolve and nonretrogression, so it's called the teaching.",
        "source": "X59n1096_001:0522a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "煩惱屬心惡業總身口則三業通誡名法加行下謂加功用行勝進無退者由此誡觀之法也若約位収小則煖頂忍世第一屬加行位前二有退後二無退又屬內凡大則住行向為內凡也解名既冠諸篇約位無遺大小。",
        "translation": "When afflictions are mental, bad actions are general in body and speech, and the three actions are collectively admonished and called dharmas, and when applied, the practice of applied effort is superior, advanced, and nonretrogressive.",
        "source": "X59n1096_001:0522a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "下諸篇中皆有此淨心誡觀法五義當須知之。",
        "translation": "The following essays contain five meanings of the method of admonishing and contemplating the pure mind that should be known.",
        "source": "X59n1096_001:0522b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀序宗法第二",
        "translation": "Admonitions and Contemplations Preface to the Tenets of the Dharma, Part II",
        "source": "X59n1096_001:0522b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二釋序宗篇淨心之目既冠於諸篇入道之源要先除於麤咎故立此位以次前篇言序者敘也爾雅云舒業順敘緒也郭璞云四者又為端緒宗者要也本也言敘陳入道之端緒要斷財色為其宗本耳。",
        "translation": "The second explanation of the preface to the Zong chapter is that the title of Puremind is found in all the chapters, and the source of the path of entry should be first removed from the debilitating factors, so this position is established in order to follow the preface to the previous chapter, which says that the preface also describes Ershiya's statement that the karma of Shu is in line with the description of the thread, and Guo Pu's statement that the four are also the end of the thread, and the Zong is the key to the source.",
        "source": "X59n1096_001:0522b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫欲修道於三業中先斷財色二種。",
        "translation": "If someone wants to cultivate the path, they must first cut off the two kinds of wealth and form in the three activities.",
        "source": "X59n1096_001:0522b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修道即三乘聖道三業即身口意業財色以是麤染根本故。",
        "translation": "The path of cultivation is the noble path of the three vehicles, and the three actions are physical, verbal, and mental actions, and possessions and form because they are the root of defilement.",
        "source": "X59n1096_001:0522b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若不貪財即無諂諍若不貪色即無熱惱經曰背捨離欲順菩提分當修身觀精勤一心除世貪愛制伏垢惱令心清淨以斷財色成無漏善根薰本識中成無貪種子漸盡惑染入賢聖位。",
        "translation": "If you don't crave possessions, there's no flattery; if you don't crave form, there's no agitation. The sutra says that when you abandon desire and follow the factors of enlightenment, you should cultivate body contemplation, diligently focus on removing worldly cravings, subdue defilements, and purify the mind so that you stop possessions and form and become an untainted good root that perfumes the root consciousness and becomes the seed of no craving, gradually ending affliction and defilement and entering the noble position.",
        "source": "X59n1096_001:0522b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "貪劉熈曰貪探也探入他分故即無即或作則下句同諂諍者莊周曰希其意而道其言謂之諂又因而致競謂之諍熱惱謂貪色猛盛則心熱惱經云者大凡引用多撮眾經之精粹例不別標其目背捨者即八背捨也智論云背是淨潔五欲捨是著心故即心生猒背而不受著也離欲者遠五欲故順下以菩提分中無著欲故今若離之是名順也本識者即藏識也以無漏善根為能薰藏識為所薰能所相資薰成無貪善種善種若成聖果可得故曰入賢聖位禮別名記中倍英曰賢倍傑曰聖家語哀公問孔子何謂聖人對云智通乎大道應變而不窮測物之情性者也我教極指則以佛為聖餘皆賢也且如列子中孔子對太宰噽亦指佛為聖故彼云丘聞西方有聖者焉不治而不亂不言而自信不化而自行蕩蕩乎民無能名焉。",
        "translation": "Greed Liuji said that greed also probes into other parts of the mind so that there's no such thing as that or making then the next sentence is the same as flattery and debate, which Zhuang Zhou said is called flattery when he hopes for their intentions and speaks their words, and it's called debate and vexation when greed for form is intense and the mind is vexed.",
        "source": "X59n1096_001:0522b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今見解法人等仍貪財色長養結使與諸漏相應惡業繫縛墜三惡道經云既非道人又非白衣無所名也。",
        "translation": "Now, we see that people who understand the teaching still crave possessions, form, and nurturing bonds, which are associated with contaminants and bad karma, and fall into the three evil destinies.",
        "source": "X59n1096_001:0522c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "結使成論云猶如乳母常隨小兒能繫縛生死故名為結常隨眾生故名為使即九結十使三惡道者即地獄餓鬼畜生三俱不善故惡也各有餘經故云道也經即遺教以食貪財色故非道人規頂矩袍故非白衣二位不収故曰無所名也馬鳴云不入出世及世間中故非施設故。",
        "translation": "The bond that causes the accomplishment of the teaching is like a wet nurse who always follows her child and binds him to birth and death and therefore is called a bond that always follows sentient beings and therefore is called a bond, which is the nine bonds and ten makes. The three evil destinies are hell, hunger, ghosts, animals, and the three unwholesome and therefore evil aspects of each of the other scriptures, so the scriptures say the path is also the legacy of the teaching that because one eats and craves possessions and form, one is not a follower of the path, so one's regular robe is not a white coat, and the two positions aren't valid.",
        "source": "X59n1096_001:0522c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "多求利故專習唇吻莊補華綺戲論諍訟遞相謗嫉三毒轉彊煩惱增長沈淪苦海知而故犯無解脫時千佛出世不見不聞以是因緣地獄罪畢受惡龍身為盜佛衣食破戒瞋垢所得惡果如盲龍經說即知解義不救業苦。",
        "translation": "Because they seek lots of profit, they specialize in the cultivation of kisses and lips, adornments, flowers, and decorations, they engage in confrontational arguments, defamation, jealousy, the three poisons, the transformation of the environment, and the growth of afflictions, which cause them to sink into the ocean of suffering.",
        "source": "X59n1096_001:0522c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "吻口吻也釋名云吻[打-丁+(改-己)]也[打-丁+(改-己)]拭之也莊補下即莊嚴補綴文華綺錯之言也戲論者音義指歸云戲劇也諕浪笑傲俳諧而言論也又成論云若一異論名曰戲論謗嫉加誣曰謗害賢曰嫉千佛案釋迦譜云大乘經三世三劫各有千佛過去莊嚴劫現在賢劫未來星宿劫三千王子次第成佛故曰千佛今釋迦即賢劫中第四佛也惡龍身者是地獄餘報也為盜下指因也如盲龍下大集經濟龍品云有一盲龍名曰頗羅機梨奢舉聲大哭作如是言大聖世尊願救濟我我今身中受大苦惱日夜常為種種諸蟲之所唼食居熱水中無時暫樂佛言梨奢汝過去世於佛法中曾為比丘毀破禁戒外現相善廣貪眷屬名聲四遠乃至得供養獨受用之等惡業因緣得此盲報即知下解義無行業果不亡。",
        "translation": "Kissing, mouthing, and kissing are also the words used in the explanation of the name, such as kissing [hitting - ding + (change - self)] and [hitting - ding + (change - self)] to wipe it off, such as under the name Zhuangbu, which means to adorn and embellish the words of Wenhua Yiqie, or conceptualize the meaning of the word conceptualize, and Chenglun, which says that if there's one different theory, it's called conceptualizing, denigrating, and misrepresenting it, denigrating, and harming the good, and jealousy.",
        "source": "X59n1096_001:0522c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝宜依誡如說修行隨病對治隨分解脫不可口言而得清淨三毒五結。",
        "translation": "You should follow the admonition to practice as instructed, treating illnesses as they arise and liberating them without engaging in colloquial speech, and then attain purification of the three poisons and five fetters.",
        "source": "X59n1096_001:0523a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "修行應法師曰行下孟切施之名行即造修也不可口言大鈔云佛法貴如說而行不貴多讀多誦又云不以口之所言而得清淨如說行者乃是佛法五結常途多言九結恐五字誤即愛忿慢無明慳嫉疑見取也。",
        "translation": "Cultivation should be said by the Dharma teacher to practice under the name of Meng Che giving practice that's created by cultivating also not delicious words Dazhuan yun the Buddha's teaching is valuable as explained and practice is not valuable as much reading and recitation and also yun not to use the words of the mouth and get purified as explained practice is the Buddha's teaching five fetters constant way much said nine fetters afraid of the misunderstanding of the five words that is love anger arrogance ignorance covetousness jealousy doubt view taking also.",
        "source": "X59n1096_001:0523a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者偏重先治重者輕即自差披戒定鎧摧心魔賊一切苦因果財色為本一切樂因果戒定為本然此因果悉在眾生心微塵中何故不禁餘過先誡財色。",
        "translation": "What's the biased approach that first treats the serious, which is to treat the lesser ones with the armor of precepts and concentration and destroy the mind's demons and thieves, which are the causes and effects of all suffering, the root of which is possessions and form, and the root of all pleasant causes and effects, which are the causes and effects of precepts and concentration.",
        "source": "X59n1096_001:0523a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先治重者不越貪嗔癡也又此三毒出自見愛故顗禪師云若論煩惱根本不出見愛枝派分別則科目甚多所謂三毒五蓋十使九十八煩惱八萬四千乃至塵沙等今若能除根則枝葉亦無鎧甲之別名上句既収戒定摧心下宜収智慧以智慧能殺賊故心魔即心所起煩惱魔是也心微塵中者華嚴經云一切眾生心微塵中有無師智無礙智廣大智等是則善惡因果皆在心微塵中楞嚴云諸法所生唯心所現一切因果世界微塵因心成體又清涼云總該萬有即是一心微塵者舉小以攝大也故華嚴法界觀云如一微塵其相不大而能容攝無邊法界由剎塵諸法既不離法界是故俱在一塵中現諸法既不離於一塵因果亦不離於一心。",
        "translation": "If we can remove the roots, then the branches and leaves don't have the distinctive name of armor. The previous sentence includes the phrase 収戒定 destroying the mind, and the next phrase is appropriate for 収智慧 because wisdom can kill thieves.",
        "source": "X59n1096_001:0523a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大乘經云八萬四千障道罪業悉因財色以為根本何以故十方眾生無始已來為財相殺者過微塵數為色相殺者數復過是道俗二流為於財色今現有一百二十六大地獄中受千萬種苦經無量劫始入畜生餓鬼緇素二人同為財色之所傷害初持後犯能免者稀。",
        "translation": "The great vehicle sūtras say that 84,000 crimes that hinder the path are all caused by material things as their root. Why is it that since beginningless time sentient beings in the ten directions have been killed by material things more than a tiny number, and those killed by material things are more numerous than the two streams of path and worldly people who are motivated by material things.",
        "source": "X59n1096_001:0523b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八下即八萬四千塵勞所起諸業多論云佛說塵勞有八萬法藥亦有八萬無始者遠推過去生死無極從迷以來未甞覺悟故言無始地獄者梵云捺落迦於三塗中是火塗道在此地極下之處故小乘論中有八大地獄每一獄四門共有十六小獄八獄共有一百二十八兼本八獄合一百三十六文作二十六字誤其中相狀廣狹數量如正法念經所明更有輕繫地獄或人間或深山曠野或在海邊鉄圍山間靈感傳云窈窈冥冥日月光明所不能照又引契經頌云鐵圍兩山間不覩日月光餓鬼聚其中償其宿罪故或在虗空中今對餘輕繫故俱言大耳緇素二人即比丘白衣也雖比丘具戒白衣五八戒皆初心勇猛故持後心懈慢故犯問緇衣色者何狀貌耶答紫而淺黑非正色也周禮云三入為纁(詩云切三染絳也)五入為緅(子侯也)七入為緇鄭氏注云再染以黑為成緇故淨秀尼見聖眾衣色如桑葚乃淺赤深黑色也。",
        "translation": "The eight lower realms are 84,000 karmic activities caused by worldly sufferings, and many treatises say that there are 80,000 Dharma medicines for worldly sufferings and 80,000 beginningless ones.",
        "source": "X59n1096_001:0523b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若有斷者名菩薩行名真持戒名為賢士名佛弟子。",
        "translation": "If there's a nihilist, that's called a bodhisattva who practices, that's called a true observer of the precepts, that's called a good man, and that's called a disciple of the Buddha.",
        "source": "X59n1096_001:0523c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "菩薩者具云菩提薩埵智度論云菩提名佛道薩埵名成眾生用諸佛道成就眾生又菩提自行薩埵化他自修佛道又用化他也賢士鈔引月燈三昧經云能持淨戒名勝士義意同也佛弟子者奧法師云從佛所生得佛法分紹繼佛家故名佛弟子又大鈔云學在我後名之為弟解從我生名之為子。",
        "translation": "Bodhisattva is the generic term that refers to the bodhisattva, the wisdom and perfection of wisdom treatise, which says that bodhi is called the buddha path, sattva is called the completion of sentient beings, and bodhi practices itself, sattva converts others, cultivates the buddha path on its own, and uses it to convert others.",
        "source": "X59n1096_001:0523c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "財色二事相欲似輕感罪尤重河沙誑惑由財色起此之二過能壞君臣師徒夫婦等亦壞內外親族朋友知識。",
        "translation": "These two faults can destroy rulers, ministers, teachers, disciples, couples, and so forth, as well as internal and external relatives, friends, and acquaintances.",
        "source": "X59n1096_001:0523c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "相欲似輕者謂貪財愛色其相非重故似輕如律十種黑心對財事起故又智論云婬欲雖不惱眾生心心繫著此雖相輕泊乎罪報則九百二十一億六十千歲受地獄苦故曰感罪尤重君臣白虎通云君者郡也羣下之歸心也臣伏也男子之賤稱春秋說曰正氣為帝間氣為臣師徒周禮云師者教人以道之稱又楊雄云師者人之模範徒黨也夫婦大載禮云夫者扶也言扶制萬物也婦者釋名云服也以服家事也內外下如叔伯是內族舅姑是外族朋友毛詩序云代木宴朋友故舊也自天子至于庶人未有不須友以成者也又同門曰朋同志曰友知識聞名歎德曰知覩形敬奉曰識凡有三種一外護善知識二同行善知識三教授善知識凡破壞如是等人莫不由乎財色是故尚須誡之佛言財色在□□人之不捨譬如刀刃有蜜不足一飡之美小兒舐之有害舌之患(此屬自損上屬損他由財色也)。",
        "translation": "The seemingly light nature of the desire for possessions and form means that the desire for possessions and form is not heavy, so it seems to be light, like the ten kinds of black thoughts in the Vinaya that arise in relation to possessions.",
        "source": "X59n1096_001:0523c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若離財色更無世間人天脫苦聖凡同讚諸漏滅盡進至佛果為此先誡財色二種。",
        "translation": "If he were to part with possessions and form, then there would be no worldly beings, gods, or humans who are freed from suffering, sages, and mortals who share the praise of ending the contaminants and advancing to Buddhahood.",
        "source": "X59n1096_001:0524a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "更無世間等謂眾生五陰并所依國土依正劣報悉由財色所致今若遠離財色則劣報非有人天舉勝包劣通乎六道聖凡凡當作賢字進至佛果者由不為境惑所礙則終至於極道如佛言夫為道者猶木在水尋流而行不觸兩岸不為人取不為鬼神所遮不為□流所住亦不腐敗吾保其入海矣人為道者不為欲情所惑不為眾邪所誑精進無礙吾保其入道矣。",
        "translation": "Being free of worldly form means that the five aggregates of sentient beings and the lands they depend on are all caused by material possessions and form. Now, if we part with material possessions and form, then the bad retribution is not experienced by humans and gods, but rather by sages and worldlings who take the word \"noble\" and \"wise\" as it refers to those who advance to the Buddhahood because they aren't hindered by the afflictions of their environment and then eventually reach the ultimate path.",
        "source": "X59n1096_001:0524a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因色生憍因財生恡憍而且恡雖有餘德亦不足觀。",
        "translation": "From form arises conceit, from wealth arises desire, and although there are other virtues, they're not enough to contemplate.",
        "source": "X59n1096_001:0524a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "憍憐也恣也本亦作驕恡正作悋鄙悋也夫人具斯二過縱有所餘德行不足觀之孔子曰如有周公之才美使驕且悋其餘不足觀也矣邢昺云言為鄙悋所揜棄也。",
        "translation": "Being proud and pitying, and also wanton, which is also originally called proud and stingy, and which is correctly called stingy and mean, a woman with these two faults may have a surplus of virtue that's not enough to contemplate.",
        "source": "X59n1096_001:0524b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先斷財色使功行成立後聽經論即是入道次第也言逆行疾故名淨心。",
        "translation": "First, he stops possessions and form so that merit and virtue are established; then he listens to the sūtras and treatises, which are the stages of entry into the path, and says that he's quick in going against the grain and is therefore called a pure mind.",
        "source": "X59n1096_001:0524b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先斷下二句収戒律也故下云能斷財色即名奉律今大師意在先奉律藏次習經論方得其次言逆下以此言雖一期逆耳能能策行人速疾至道也由斯義故名為淨心。",
        "translation": "The next two phrases 収戒律也故下云能斷財色即名奉律今大師意是先奉律藏次继续習經論才得次言逆下以此言虽然一期一期逆耳能能能策行人快速到道也由此意义故名淨心。",
        "source": "X59n1096_001:0524b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0524b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈者應法師云梵言也正云伽陀或云室盧迦此方當頌攝經中作伽佗訛也曰者說文云詞也從口一聲亦像口氣出也然則曰者發語詞也。",
        "translation": "\"Verse is a Sanskrit expression that responds to the teacher of the Dharma, and it's correctly called gada or śloka. It's a verse that's collected in a sutra and made into a kātra, and it's a word that's spoken, a sound that comes from the mouth, and it's like breath coming out of the mouth.",
        "source": "X59n1096_001:0524b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　煩惱如河沙　　先斷惡二種　　一財二是色　死時神不恐　　吉羅須護持　　況言犯四重　三聚戒清淨　　布薩心喜踊河沙者即恒河中沙此河長八十由旬廣四十由旬其底甚深象度皆沒沙細如麫水白如乳今喻煩惱之多故言河沙神不恐者謂斷此二則至命終神識無怕怯也反此不斷則死時懷恐懼吉羅者五篇之小罪聲論正音突悉吉栗多四分戒云式叉迦羅尼義翻應當學梵僧云守戒謂此罪微細隨學隨守也今勸護小以慎於大故曰況言犯四重三聚戒者即大乘戒也一攝律儀戒謂惡無不離起證道行是斷德因修成法身瓔珞經云律儀戒謂十波羅夷菩薩戒疏云攝律儀能令心住二攝善法戒謂善無不攝即身口意善及聞思修三慧六波羅蜜八萬四千助道行等是智德因修成報身瓔珞經曰攝善法謂八萬四千法門戒疏曰攝善自成佛法三攝眾生戒又名饒益有情戒謂生無不度起不住道是恩德因修成化身瓔珞經曰攝眾生者謂慈悲喜捨化及眾生令得安樂戒疏曰攝眾生成就眾生莊嚴論曰初一戒以禁防為體後二戒以勤勇為體布薩此曰淨住出要律儀曰是憍薩羅國語六卷泥洹曰布薩者長養二義一清淨戒住二增長功德今謂戒淨德長故心喜勇。",
        "translation": "Afflictions are like the sands of the river. First, there are two kinds of evil that are stopped. First, wealth and second, form.",
        "source": "X59n1096_001:0524b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　鄙夫愛則色　　誡汝斷貪著　　由財三世苦　因色入火鑵鄙陋也愛者貪染之心名之為愛謂於一切財色染着故此屬愛煩惱也二世者即現未也過去已謝故不言之由現世因求財色則致疲勞或求不得苦等縱有得者樂極則衰苦相斯至乃至命終受泥利苦故下句曰因色入火鑵火鑊者指無間之苦具也法苑珠林曰沸鑊騰波炎爐起。",
        "translation": "A vile man who loves form and admonishes you to stop clinging to it because of possessions and the three periods of suffering because form enters into the fire can be despicable. Love is the mind that's defiled by craving, and it's called craving because it's defiled by all possessions and form.",
        "source": "X59n1096_001:0524c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　色能障聖道　　財能令行薄　　審諦自看心　知貪是狂錯色障道者僧祇云由犯此戒道果無分故律中婬欲為初欲令比丘今世取涅槃故財令行薄者以貪財則高節之行日漸薄也多論曰貪於俗利壞道功德財失於俗人信敬之心又違佛四依非節儉行是知面王大士推為上機天須菩提終歸下器且顏子尚有單瓢之樂況出世之士反以財利滯於發足乎。",
        "translation": "Form hinders the noble path, and possessions weaken practice. Examining the mind to see for oneself the truth, he knows that greed is a crazy mistake, and form hinders the path.",
        "source": "X59n1096_001:0524c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智避如火坑　　頑愚不嫌惡　　若犯當悔除　除已更勿作智下言有智之人避於財色猶如火坑遺教云及諸財寶皆當遠離如避火坑馬鳴釋云避大火聚相似法故頑下反上句也以愚人不知是患故不嫌耳若下佛言有二種智人一者不作二者犯已能悔今勸悔往猶得名智過之不改斯又愚甚。",
        "translation": "Wisdom avoids things like fire pits, and the stubborn fool doesn't resent evil. If he violates it, he must repent and remove it. After removing it, he mustn't do it again.",
        "source": "X59n1096_001:0525a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　一切有形類　　終歸填溝壑　　持戒禁情苦　後受大安樂終歸下以形骸一喪非可愛之物終歸填塞於溝填坑壑之內章服儀云一生形骸委之溝壑累世神靈繫於業道斯義同也說文云溝水瀆也廣深四尺壑爾雅云流水深則成壑亦溝池也又坑也持戒下若以持戒制於貪財遂色之情則不受二世之苦是故近獲三種樂遠趣涅槃密意在遠故言大也。",
        "translation": "All sentient beings ultimately return to fill the gully, upholding the precepts and prohibiting the suffering of sentient beings and subsequently experience great happiness.",
        "source": "X59n1096_001:0525a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀五停心觀法第三",
        "translation": "The third admonition to observe the five methods of stopping the mind and observing the precepts",
        "source": "X59n1096_001:0525a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三釋五停篇兩種麤染遠則為入道之宗五處制心奉乃作上行之本故次前位以立茲篇謂三毒慢亂宜修止息故曰五停心察治有方名之觀法。",
        "translation": "Three explanations of the five kinds of calming are explained in the chapter on the two kinds of coarse defilements that are distantly associated with the doctrine of entering the path, and five points of mental discipline that are the basis for making superior effort.",
        "source": "X59n1096_001:0525b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五妄想者如除刺樹先斷其根故修五停觀息五過止不令起故名停心觀。",
        "translation": "The five deluded thoughts are like removing a thorn tree by first cutting its roots so cultivating the five calming contemplations calms the five faults and doesn't allow them to arise so it's called calming mind contemplation.",
        "source": "X59n1096_001:0525b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五妄者即貪瞋癡慢散亂也刺樹即刺棘之樹喻諸微細惑障也欲除此障先須修觀除根本五種麤過能除之法即用五停言五停者停住也謂作此觀時於五處停住其心思惟觀察又曰停息也謂停息煩惱等故觀者即意識心王與慧相應推求觀察故名觀。",
        "translation": "The five deluders are greed, anger, delusion, arrogance, distraction, the thorny tree, the thorny tree, and metaphors for subtle afflictive hindrances. To remove this hindrance, it's necessary to first cultivate contemplation to remove the root of the five kinds of coarse errors.",
        "source": "X59n1096_001:0525b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "因修此觀現惱不行得小解脫所由之處戒定調柔漸證神通名大解脫十障滅盡名真解脫莫不因今五停觀法如是修入名為淨心。",
        "translation": "As a result of cultivating this contemplation, the present afflictions don't go away and minor liberation is attained where precepts, concentration, training, and flexibility gradually lead to the realization of supernormal powers called great liberation and the cessation of the ten hindrances called true liberation. Nothing is not due to the present five kinds of stilling and contemplation.",
        "source": "X59n1096_001:0525b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "現惱不行者伏故不起也未是真斷故言得小解脫也所由由從也因也神通總包六通也若惑未盡證未究竟故言漸若見思惑盡證無學果方名解脫又對前小故得大名十障者即十地中每一地破一障也若至等覺如唯識破十一種障是也又唯識說金剛喻定現在前時斷佛地障即入妙覺方名真解脫也如是大小兩果莫不由五停心為入道初門。",
        "translation": "When the present afflictions are not acted upon, it's because of their suppression that they don't arise and because they haven't really been stopped, it's called minor liberation, which is based on, followed by, and caused by, the psychic powers that encompass the six powers.",
        "source": "X59n1096_001:0525b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0525b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自知欲情多　　一向觀不淨　　背捨得解脫　欲竭即得定　　若當逐講論　　念欲轉熾盛　是即非對治　　下道入險徑欲情下即多貪眾生貪於欲境佛令修不淨觀可以對治然貪境雖多不過四種一顯色(青黃赤白)二形色(長短方圓)三妙觸(身分細滑)四供奉(供承祇奉)治法亦四一青瘀(說文曰積血也)想(治顯色貪)二爛壞想(治形色貪)三蟲蛆想(治妙觸貪)四死屍想(治供奉貪)俱舍但作一骨鎻觀通治四貪背捨下二句指益當逐講論等者謂講屬散心未能防禦則欲情轉復熾盛要在修觀定力對治像法決疑經明法師過者所謂但外求文解而不內觀修心又曰非禪不慧偏慧不禪一翅一輪豈能遠運念下指過險徑喻但逐言論喪觀行也。",
        "translation": "Although there are many desires, one is directed toward observing impurity, and the other attains liberation. If one goes along with lectures, one's mind becomes engorged with desire, which is not a cure, and one enters a dangerous path under desires, which is many desires, sentient beings become greedy for the desire realm.",
        "source": "X59n1096_001:0525b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自知瞋恚多　　一向修慈悲　　毒火得清凉　成就善律儀　　若當逐講論　　非治徒勞疲　貪瞋更增長　　重被煩惱羇瞋恚下即多瞋眾生令修慈悲觀可以對治當以怨親處中(怨親各分三品并處中成七)運三樂等施(佛菩薩天樂也)從易至難令七品人皆獲三樂則調心平等此觀若成瞋病即遣毒火瞋心燥熱故如火也用觀息滅故得清凉若當下倣上而作下亦例然如唐傳感通曰明琛齊人少遊學西河以通鑒知譽然經論雖富偏以徵難為心甞造蛇熱論若葛亮陣圖常山蛇勢大業之季大有學之後因潞州僧講法華琛求捔試其僧知琛論道難抗乃以情告且贈絹十四琛受而不去欲聽一講此僧戰灼事不獲己如常消文琛後入堂齎絹於眾曰高座法師昨日遺絹請不論議然佛法宏廣是非須分高座爾時神氣奔勇泰然待問難雖重疊答無不通琛精神擾攘思難無從曰高座法師由來暗塞如何今日頓解若斯當是神助耶合堂大笑琛即出邑共伴二人投家乞食心氣滿噎而不下雖同伴解諭步步歎嗟登嶺困極止一樹下便解剔衣裳赤露而臥仍自動轉語伴曰我今煩惱意欲作蛇先造蛇勢論今報至矣卿可上樹蛇心若至則有吞噬之害言訖全身作蛇長五丈許趣谷而下其伴目驗至鄴說之貪瞋者貪應是令字以貪屬上科所治理非載言。",
        "translation": "He knows that much anger is cultivated from one direction, that is, cultivating compassion. Poisonous fire becomes cool, and good discipline is accomplished. If he doesn't follow lectures, then he'll counteract the futile fatigue, increase greed and anger, and be seriously afflicted, then he'll cultivate compassionate contemplation, which is to say that many beings with anger can be counteracted by using the three classes of enemies (each of the three classes of enemies is divided into seven.) He should bestow the three pleasures and so forth (the bliss of the buddhas and bodhisattvas) from the easy to the difficult, so that all seven classes of people attain the three pleasures.",
        "source": "X59n1096_001:0525c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自知愚癡多　　諦觀十二因　　始悟輪迴苦　了知無我人　　若當逐講論　　見諍終日喧　放本求枝葉　　不能拔斷根愚癡下則多癡眾生令修十二因緣觀可以對治十二因緣者即無明等十二支也約三世因果治三世愚癡俱舍云說前後中際為遣他愚惑意云說前際遣過去愚(即無明行二支)說後際遣未來愚(即生支老死支)說中際遣現在愚(識名色六入觸受愛取有八支)於中有逆順兩觀順觀無明至老死所謂無明滅故行滅等逆則觀老死至無明所謂老死支滅由生支滅等因此便能對治癡病始悟下亦指益由悟故不受流轉若泯流轉則無我人眾生見諍下即爭鋒唇舌之間鼓論不形之事也放本即不修因緣觀枝葉即逐講論根喻愚癡。",
        "translation": "Knowing themselves to be full of delusion, they should truly contemplate the twelve causes, first realizing the suffering of transmigration, then realizing that there's no self, and if they go from one lecture to another, they'll see the arguments, end up clamoring for branches and leaves, and not be able to uproot their delusion, then they'll be full of deluded sentient beings who cultivate the twelve causes and conditions, which are the twelve branches of ignorance and so forth.",
        "source": "X59n1096_001:0526a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自知我慢多　　諦觀十八界　　方得無人解　吾我病即差　　若當逐講論　　反益三塗債　計我常求勝　　名利自杻械我慢下即著我眾生作界分別觀可以對治我者以主宰自在為義以眾生不了肉身虗假妄計有我因着我故其慢即生令觀十八界但是假緣而有於中利觀六界以迷少法鈍觀十八界為迷多法所謂外六境界中六識界內六根界行人若觀內六根界但有生長所依之義外六境界但牽心所緣之義中六識界但有緣慮了別為義則主宰自在之我復何所寄此觀若成則能覺悟了然無我故曰方得無人解又執吾我之病自然差矣杻械即桎梏(在足曰桎在手曰梏)喻名利二種拘禁於人不閑豫也。",
        "translation": "He knows that he has a lot of conceit and observes the eighteen realms with care, and then he attains the understanding of no one, and his illness of self is healed. If he goes from one lecture to another, it will only benefit him in his debt to the three destinies, as he always seeks to win fame and profit from handcuffs, and he's conceited, which means he's attached to self.",
        "source": "X59n1096_001:0526b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　自知亂想多　　常數出入息　　覺觀漸得成　加我戒定力　　若當逐講論　　喧塵未能息　遞互相是非　　何時滅事識亂想下即多思覺眾生亦名散亂眾生亦名尋伺眾生佛令修數息觀可以對治如下本篇自辨此不委明覺觀漸得成者成字誤當作滅字以覺觀即尋伺是所治病梵云毗恒迦此云尋毗庶羅此云伺舊云覺觀成論云若心散行數數起生是名為覺散心少微則名為觀是二法者遍在三界以是心之麤細喻如打鈴初聲為覺餘聲為觀加我下觀行若成散亂即滅則戒定慧俱勝故有力也遞互下即以己為是斥他為非自謂握靈蛇之珠抱荊山之玉也事識楞伽經說心有三種識謂真識(如來藏)現識(第八識)分別事識(前六識)又獨名意識為事識故起信云隨事攀緣分別六塵名為意識亦名分離識又復說名分別事識藏師釋曰能分別去來內外種種事相故。",
        "translation": "He knows that there's a lot of distracting thoughts, always calming breaths in and out, perceptions and contemplations, and the power of moral discipline and concentration. If we go from lecture to lecture, the clamor of the dust that fails to calm down and the mutuality of right and wrong, when will these two things cease?",
        "source": "X59n1096_001:0526b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "此是毗曇中七方便法五停觀成名第一方便自餘別相念處總相念處煗法頂法忍法世第一法名七方便觀行成就得須陀洹果若初入道大小乘人通修此觀。",
        "translation": "These are the seven skillful means in the vedas, the five meditations, the accomplishment of which is called the first skillful means, the remaining distinctive mindfulness, the general mindfulness, the forbearance of the Dharma at the top of the Dharma, and the first worldly method, which is called the seven skillful means of accomplishing meditation and attaining the fruit of stream entry if people of both large and small vehicles commonly practice this meditation.",
        "source": "X59n1096_001:0526c11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "毗曇或云阿毗達磨或云阿鼻達磨皆梵言轉也此云勝法或云無比法以詮慧故即論也七方便者方便即因義以皆為趣後果故亦名七賢對後四聖故別相者別謂各別身心法不同故謂觀此四法作不淨等行相故念者明記為性由慧性輕躁今則用念記憶注境不忘故總相念者行人觀門漸熟於一剎那中通觀身受心法為苦空無常無我也(已上三位屬外凡資糧位)煗法者煗從喻得名如人近火得火之前相謂無漏智起能燒迷理惑薪名之為火此雖未起無漏已得智火之前相故名為煗此位所修觀行俱舍頌云從此生煗法具觀四聖諦修十六行相頂法者從上品煗善根後有善根生名之為頂頂者至極之義也此有二解一云煗頂有退動忍無退動今頂位至無退至極邊至極之處如人之頂是一身至極之處也二云煗位唯退忍位唯進今此頂位是進退兩際之中如山之頂在一上一下兩際之中故名為頂此位所修觀行俱舍頌曰次生頂亦然謂同前具觀四諦作一十六行相也但此位漸勝耳忍法者從頂善根後有善根生名之為忍忍亦二義一者印可義能印可四諦理故二決定義能決定無退動故此位所修觀行下忍作四諦十六行相中忍七周減緣二十四周減行上忍唯觀欲界苦諦一行一剎那所以俱舍頌云下中忍同頂上唯觀欲苦一行一剎那世第一者從忍善根後有善根生名世第一謂此行人於世間異生有漏位最第一故此位所修觀行亦同上忍位唯重觀欲界苦諦一行一剎那為等無間緣引入見道故俱舍頌曰世第一亦然(已上四位屬內凡加行位)須陀洹者此云逆流已斷八十八使見惑初見真諦逆生死流故亦名預流初預聖流故。",
        "translation": "Vedan or Abhidharma or Abhidharma are both Sanskrit words for turning, this is called the superior dharma or the incomparable dharma in order to explain the reason for wisdom, that is, the treatise. The seven expedients are the cause in the sense that they all lead to the latter result, so they are also called the seven virtuous ones that are opposed to the latter four sages.",
        "source": "X59n1096_001:0526c15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0527a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　何因說五停　　復不逐講經　　抱疾說藥方　祇欲取聲名　　凡夫貪利養　　無心治忘情　若修五停觀　　決定修道成何下二句合推上所因抱疾下四句頌不逐講論所以忘情忘合作妄若修下兩句頌修五停得益是知多說不如少行勵之以德斯為上矣。",
        "translation": "\"Why does teaching the five calming factors and not following lectures? Why does teaching the prescriptions for medicine because of illness only serve to get fame and reputation? Ordinary people crave profit and nutrition and don't want to cultivate forgetfulness? Why do the next two phrases combine to deduce the above cause, the next four phrases verse not following lectures, so they forget their feelings and cooperate with delusion?",
        "source": "X59n1096_001:0527a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故令修五停觀法止逐講論。",
        "translation": "Why does it cause cultivation of the five calming meditations to stop going from lecture to lecture?",
        "source": "X59n1096_001:0527b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何故下徵辭與前偈文意同此合在前作長行偈居下作重頌似便恐後寫妄易對治。",
        "translation": "Why is the following statement the same as the preceding verse? It seems to fit in with the preceding long verse and the following repeated verse, lest it be written later and be easy to counteract delusion.",
        "source": "X59n1096_001:0527b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有二要法一者佛教次第入道對治麤重煩惱二者見解法義人知而故犯不畏佛戒不修威儀五篇淨戒悉皆破盡見他持戒復起憎謗唯貪財色瞋惱鬪諍慳嫉憍慢無慚無愧身壞命終必墮地獄畜生餓鬼經歷多劫當觀此事現前驗知故修五停止過起道順佛教故名為淨心。",
        "translation": "There are two important things: first, Buddhism's gradual entry into the path to counteract the debilitating afflictions, and second, seeing and understanding the meaning of the teaching, people knowingly violate and don't fear the Buddha's precepts, don't cultivate respect, and the five pure precepts are all broken, seeing others upholding the precepts and then becoming hateful and defamatory, only craving wealth and form, anger, fights, stinginess, stinginess, jealousy, pride, lack of conscience, and lack of modesty.",
        "source": "X59n1096_001:0527b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "麤重煩惱者即上貪等五過用五停對治故勸令修二下所以止逐講論者為說法人多為名利故又知而故犯等五篇者夷殘提提舍尼吉羅古德曰三均具者名篇不具號聚今師不爾縱使聚從五位義具三均篇名在七本因雜攝義無不可現前驗知者驗知因果也犲狼正作豺狼之屬禮記云季秋之月豺祭獸說文云似犬銳頭而頰白高前而廣後以性多貪惏(王逸注楚詞曰愛財曰貪愛食曰惏)。",
        "translation": "The coarse afflictions are the five faults of greed and so forth that are counteracted by the five calming hindrances, so they are encouraged to cultivate the two lower calming hindrances.",
        "source": "X59n1096_001:0527b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0527b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　貪如犲狼性　　瞋如惡龍心　　壞法故毀禁　污戒犯姦婬　　識法望除毒　　反更作罪深　造業心無悔　　命過就刀林　　墮大無間獄　佛性歷劫沈　　如軄除名罰　　失勢不堪任惡龍者龍乃鱗蟲之長也以心多瞋毒故今取二類甚者為喻姦私也俗作姧刀林者指獄報之苦具也法苑曰刀林聳日劒嶺參天佛性者一切眾生本具一真覺性也由逆造罪故至沈淪如軄者白虎通曰各量其軄盡其才也即公卿大夫等除名者在官有過則除名而遭罰喻眾生雖具佛性乃有過而沈淪乎。",
        "translation": "\"Greed is like the nature of a wolf with lots of tears, and anger is like the mind of a dragon that breaks the precepts because it destroys the Dharma and violates the precepts by committing adultery and sexual misconduct while knowing the Dharma and hoping to remove poison, but instead creates deeper sins, creates karma without remorse, and falls into a great unremitting hell.",
        "source": "X59n1096_001:0527b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何破戒口　　噉人食憍恣　　云何破戒手　受人財物施云何下以破戒故財法兩亡佛藏云不除我倒者不聽受一柸之水一衲之衣況恣受信施厚利乎。",
        "translation": "\"How does he violate the precepts by speaking out, devouring people's food, and being proud? How does he violate the precepts by using his hands to accept people's property as alms? The Buddha canon says that someone who doesn't remove their error won't accept a grudge of water or a robe, so why would they wantonly accept a generous gift of faith and profit?",
        "source": "X59n1096_001:0527c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何破戒身　　坐臥好牀褥　　云何破戒業　受佗禮己足好牀褥今時不肖者華牀重褥恣意高臥而略無慙色也且如四分菩提王子請佛從於階階布衣令佛蹈上過世尊不受令却之為未來故也況復毀破淨戒而輙便安受大經所謂寧處鐵牀斯言可省破戒業業謂業體婆娑曰至三羯磨其業滿足是也。",
        "translation": "What is the body that breaks the precepts? What is the karma that breaks the precepts? What is the karma that accepts the good beds and mats that are made by worshipping one's own feet? What's the karma that breaks the precepts? What's the karma that breaks the precepts? What's the karma that accepts the good beds and mats that are made by worshipping one's own feet?",
        "source": "X59n1096_001:0527c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　云何破戒行　　默受稱揚讚",
        "translation": "\"What is the practice of violating the precepts that is praised and received in silence?",
        "source": "X59n1096_001:0527c22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "戒行者大受隨二戒遮約外非方便善成故名戒行今不能全護故言破也當知上據受體此約隨行默受下律中有過須發露令眾委知今默應於則則人謂清流故有稱讚之事也。",
        "translation": "\"The practice of morality is the great acceptance and following of the two precepts, which are not accomplished skillfully by external means and are therefore called the practice of morality. It should be noted that the above is based on the acceptance of the essence of the precepts, and this is based on the following practice of silent acceptance of the lower precepts, in which faults must be revealed so that the congregation will know that silence is appropriate in this case, which is called purification by others.",
        "source": "X59n1096_001:0527c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　若犯此五事　　諸天共悲歎",
        "translation": "If someone violates these five rules, the gods will lament them together.",
        "source": "X59n1096_001:0528a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五事即上口手身業行也。",
        "translation": "The five matters are the activities and conduct of the upper lip, hands, and body.",
        "source": "X59n1096_001:0528a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛教新受戒者五年學律然後學經律有五部一四分二五分三十誦四僧祗五解脫此五部律同一毗尼大藏文相廣博卒難悉識。",
        "translation": "The Buddha taught that newly ordained people study the Vinaya for five years and then study the scriptures. There are five Vinayas, one four, two five, thirty, thirty recitations, four saṃgha, five liberations, and these five Vinayas are the same as the Vijñāta collection.",
        "source": "X59n1096_001:0528a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "言律者梵言毗尼義翻為律律者法也裁量輕重等非法不定律有此能故以法訓經者梵云修多羅正名為線義曰契經線能貫華經能持緯謂所詮之義似緯似華能詮之文能持能貫今順此方典誥是以目之為經今雖舉經律而攝論焉謂戒定慧三學必須具矣又論通宗釋經律於義亦含五部者如來入滅百年毱多弟子競採大眾之文用集家之典也四分即曇無德部(今家所宗)五分即彌沙塞部十誦即薩婆多部僧祇是根本部(非百載五宗也)解脫即迦葉遺部(此有戒本)文少婆麤富羅部律未翻度故今不列且用僧祇在數故結云此五部律同下五部雖分異同屬一大毗尼藏也卒難下言律藏之深耳如唐義淨解云慧休瀛州人大小諸藏並通關鍵唯律部未遑精閱逐從洪律師聽來四分講肆三十餘遍日漸其致終未極言顧門徒曰余聽涉多矣至於經論一遍入神今遊律部愈增愈時豈非理可虗求事難通會乎。",
        "translation": "The Sanskrit word for vinaya is translated as vinaya, and the vinaya is a law, a measure of weight, etc., not a law that is not set in stone, so there is this ability to teach the scriptures with the law. The Sanskrit word sūtra is sūtra, and the proper name is thread, which means that the thread of the scriptures can penetrate the flower scriptures, and the text that can penetrate the flower scriptures can penetrate the meaning of the scriptures.",
        "source": "X59n1096_001:0528a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今欲知者財色為宗能斷財色即名奉律禁戒清淨發生定慧成就聖道知律綱要故名淨心。",
        "translation": "Those who want to know now that possessions and form are the subject, and being able to cut off possessions and form is called devotion to discipline, the observance of precepts, and the purification of concentration and wisdom, the accomplishment of the noble path, and knowing the outline of the vinaya is therefore called a pure mind.",
        "source": "X59n1096_001:0528b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "財色為宗者謂戒律之意以斷財色為宗也前雖具誡今亦因而言之。",
        "translation": "The doctrine of stopping possessions and form refers to the intention of the precepts, which is to stop possessions and form as the doctrine. Although the previous admonition was complete, this is also the reason we say it now.",
        "source": "X59n1096_001:0528b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0528b05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　五部戒律中　　宗要斷財色　　修禪觀不淨　對治自忍抑　　林野歎死屍　　內心懷悲惻　我身會當然　　貪熱即時息修禪觀不淨此約修不淨觀對治貪病即前五停中初位所誡今載頌者亦叮嚀之意蓋世多此病耳林野歎死屍西土葬法或棄之寒林或捐之中野鳥獸所飡誠堪傷歎故唐楊衡持云野干鳥雀喧爭處林下何人在定中悲惻惻愴也以見他屍壞反顧自身彼我同然豈無惻愴如此觀時貪心自息又修此觀時宜通修九想觀(一脹二青瘀三壞四血塗五膿爛六噉七散八骨九燒想)。",
        "translation": "Of the five parts of the precepts and regulations, the doctrinal essentials are to stop possessions and form, cultivate meditation, contemplate impurity, and counteract self-tolerance and suppression, admire dead corpses in the forest and fields, and harbor compassion within one's heart for what happened to me. When cultivating meditation and contemplating impurity, this is about cultivating the contemplation of impurity to counteract the disease of greed, which was previously admonished in the first of the five suspensions.",
        "source": "X59n1096_001:0528b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　三毒甚強盛　　摧之用智力　　衣求破弊衣　食即一坐食　　常行平等心　　淨意怛質直　若不能如此　　袈娑覆荊棘三毒亦五停之數摧下如對瞋須修慈對癡須觀十二因緣並要假智慧觀力以摧挫之衣求下此破貪心求好財之患四分曰捨檀越施衣著糞掃衣十住婆沙中有十種利如律鈔頭陀篇所引一坐智論云先受食處更不復食三千云不得數數食應一食以長道多則長婬怒癡結不異俗人質直者離諂曲也經曰諂曲之心與道相違是故宜應質直其心馬鳴云示現本直心遠離諂曲煩惱障故。",
        "translation": "The three poisons are very strong, and they are destroyed by the power of knowledge, which destroys bad clothing, food, which is the one-seat meal, always practicing equanimity, and the quality of straightforwardness. If this isn't possible, the robe will be covered with thorns, and the three poisons will be destroyed by the number of the five suspensions.",
        "source": "X59n1096_001:0528b17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "聖教萬差為根性不同病藥眾多愚者致惑雖用功力非正對治妄貪名利更增塵垢是以先修五停後學講論知道次第名為淨心。",
        "translation": "Although the noble teaching's myriad differences are the root of different illnesses and many foolish people cause mental disturbances, their exertion isn't the right antidote for their false desire for fame and profit, which adds to the defilement.",
        "source": "X59n1096_001:0528c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0528c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世人習多聞　　未曾行一分　　妄情取妄法　諍競起紛紜　　入道依次第　　戒定自資薰　淨命如迦葉　　勿得同六羣一分舉少以況也且一分之行尚不能行況餘修行者哉淨命如迦葉者具云摩訶迦葉波此云大飲光氏於佛會中常著糞掃衣清淨活命一日比丘起慢如來易衣分座大千震動豈非上行之所召乎六羣者佛會中起過之儔也即難陀跋難陀迦留陀夷闡陀馬師滿宿此六為羣黨故號六羣。",
        "translation": "\"Ordinary people who are accustomed to hearing much have never practiced a single part of it, deludedly grasped deluded dharmas with deluded emotions, and disputes and quarrels have arisen, entered the path in order, and followed the self-subsidized perfuming of precepts and meditation. One part of purified life is like Kāśyapa. One part of purified life is like Kāśyapa, for example, and still can't be practiced, so why wouldn't other practitioners?",
        "source": "X59n1096_001:0528c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨心誡觀發真鈔卷上本",
        "translation": "Jingxin jingguan faizhen chao shouben",
        "source": "X59n1096_001:0528c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨心誡觀發真鈔卷上末",
        "translation": "Jingxin jingguan faizhen chao shoushang mou",
        "source": "X59n1096_001:0529a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀末法中校量心行法第四",
        "translation": "Admonitions for Contemplating the Methods of Measuring the Mind's Conduct in the Terminal Dharma, Part IV",
        "source": "X59n1096_001:0529a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四釋校量篇五處止心雖各防於一過眾非溢目要通撿於十支故立此篇以次前行謂正像之季漸入萬年故稱末法撿意運為比前優劣故曰校量心行。",
        "translation": "Although each of the five places of calming the mind may be guarded against a single error, the many non-overflowing eyes should be collected from all ten branches, so this chapter is established to follow the previous practice, which is to say that the season of the true form gradually enters ten thousand years, so it's called the final method of carrying out the intention to be superior and inferior to the previous one, and therefore it's called the practice of calibrating the mind.",
        "source": "X59n1096_001:0529a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫解義皆因聽學為知法人身犯四重畜八不淨財食噉俗饌無羞無耻知而故犯不畏後世是故令汝校量心行先淨禁戒後方聽經汝用五誡得名淨心。",
        "translation": "Ordinary people understand the meaning only because they listen and train in order to know that the Dharma person violates the four heavy animals and eight impure possessions, eats, and secular foods, has no shame or embarrassment, and therefore violates and isn't afraid of the afterlife.",
        "source": "X59n1096_001:0529a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "學者覺也謂覺悟所應知義也為知法人為作也謂學通之後作知法人既知必修其言而行之今但學言而鮮行之於道何益哉四重即婬盜殺妄也諸戒之中此四最重四分曰譬如斷人頭不可復起等八不淨者一田宅園林二種植生種三貯積穀帛四畜養人僕五養繫禽獸六錢寶貴物七氈褥釜鑊八象金飾床及諸重物此之八名經論及律盛列通數顯過不應涅槃中亦云八毒蛇法俗饌酌醪食魚肉恣養身腹也大師所謂以酒肉為行解斯徒是也五誡即誡上四重八不淨噉俗饌無羞耻故犯不畏。",
        "translation": "Studying is also known as awakening, which is to know the meaning of what should be known, and making it for the sake of knowing the person and making it for the sake of doing it after studying it. Having known and made known the person, he must cultivate his words and conduct them. Among the precepts, these four are the most serious. The four parts of the precepts say, \"For example, cutting off a person's head and not raising it again, there are eight impurities: first, fields, homes, gardens, forests, second, planting seeds, third, stockpiling grain and provisions, fourth, keeping people and servants, fifth, keeping animals, sixth, money, treasures, and valuables, seven, blankets, mats, cauldrons, eighth, elephants, gold, decorated beds, and other heavy things.",
        "source": "X59n1096_001:0529a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "古者大德講華嚴經唯一卷疏於後法師作三卷疏。",
        "translation": "In the past, the great master taught that the only commentary on the Huayan Sutra was a three-volume commentary made by a later master.",
        "source": "X59n1096_001:0529b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "華嚴前後兩譯初即東晉義熈年天竺佛陀跋陀羅於陽都譯凡六十卷次即唐天后代于闐三藏實叉難陀譯凡八十卷南山但見前本一卷疏者即法順所撰師雍州萬年人俗姓杜世以杜順為稱於終南山撰法界觀一卷後授弟子智儼執此以講華嚴大旨文見行世其諸神異具如續高僧傳貞觀十四年歸寂春秋八十四即華嚴新舊二疏始祖也其三卷十卷又名俱亡此皆釋初譯本後清凉國師造疏釋後譯本今多所行大師亦不見也。",
        "translation": "The first and second translations of the Huayan were the 60-volume translation by Buddhapattra of India in Yangdu in the year of Yiqiang in the Eastern Jin dynasty, and the second was the 80-volume translation by the Tang dynasty's descendants, the Yutian Tripiṭaka, and the 80-volume translation by Jixian Nanshan, who only saw the former one-volume commentary written by Fashun, a native of Wannian in Yongzhou whose secular family name was Du Shi and who was known as Du Shun, who wrote a one-volume contemplation of the Dharma realm on Zhongnan Mountain and later gave it to his disciple Zhiyan to hold onto for the purpose of teaching the great tenets of the Huayan, whose miraculous features are described in the sequel to the Biographies of Eminent Monks, who retired in the 14th year of Zongguan's reign at the spring and autumn of 84, the originator of the new and old commentaries on the Huayan.",
        "source": "X59n1096_001:0529b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今時講者十地一品出十卷疏各逞功能競顯華詞文字浩博寄心無所然文者當體即義何須人語今時愚人竟求於名不求於法尚不可著何況著文字法離文字言語斷故大集經曰經文是一講者異說各恃己見壞亂正法天神瞋故三灾俱起以是因緣佛法淡薄如一斛水解一升酪看似酪色食即無味。",
        "translation": "At the present time, lecturers of the ten grounds and one class have produced ten volumes of commentaries, each of which has its own function and competes to show the vast amount of flowery language and words that send the mind to nothing, but the text should be the essence and the meaning, why do we need human speech? At the present time, foolish people go so far as to seek names and don't seek the Dharma, let alone attach to words.",
        "source": "X59n1096_001:0529b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "然文下經云無離文字而說解脫必曰捨文字然後見法非見法者也此句立也何須人語者此句遣也下云法離文字言語斷故又起信云一切法從本以來離言說相離名字相離心緣相畢竟平等若了此旨何須人語若昧此道縱疏鈔山積法音雷震徒自勞耳名者即名句文以正破此執法者即真理也以真尚不可得況復著文字又起信云以一切言說假名無實故又真如之體體離名字言語道斷故永嘉曰法不自名假名詮法法既非法名亦非名名不當法法不當名名法無當一切空寂三灾者通大小也小則飢饉疾疫刀兵大則火水風也又復應知小三灾壞生陰世間大三灾壞住處世間今且約小也據立世毗曇中二十小劫中間方有小三灾起故彼論云剡浮提中所有人民遭大疾疫一切鬼神起瞋恚心損害世人壽命短促一日一夜無量眾生疾疫病死無人送埋是時此土白骨所覆時有一人合集剡浮提內男女唯餘一萬留為當來人種刀兵者手執草木即成刀仗互相殘害剡浮提內亦留一萬以為人種飢饉者六七年間天不降雨思欲見水尚不可得何況飯食一日一夜餓死無數剡浮提內亦留一萬以為人種今欲免者婆娑論曰能一日一夜持不殺戒於未來生決定不逢刀兵灾若能以一訶梨怛雞果起殷淨心奉施眾僧於當來決定不逢疾疫灾若能以一團食施與有情於未來世決定不逢飢饉灾也。",
        "translation": "However, the following sūtra says that there's no liberation that's free from words, and it must be said that those who abandon words and then see the Dharma and don't see the Dharma also establish this sentence, and why is human speech necessary? This sentence also excludes the following sentence, saying that the Dharma is free from words and words are cut off.",
        "source": "X59n1096_001:0529b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "諦思講論人情測佛佛智境界豈人能測如是審察名為淨心。",
        "translation": "Trisagion discusses how human feelings can fathom the Buddha's wisdom, and how can anyone fathom the Buddha's wisdom realm? Such an examination is called a pure mind.",
        "source": "X59n1096_001:0529c21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛智下經曰假使滿世間皆如舍利弗盡思共度量不能測佛智豈下凡能測乎。",
        "translation": "The Sutra on the Descent from Buddha's Wisdom says, \"Suppose the whole world were like Śāriputra, and they all exhausted their thoughts and shared their calculations, and they couldn't fathom Buddha's wisdom, could lower mortals fathom it?",
        "source": "X59n1096_001:0529c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0530a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　敷演說法師　　二種陞高座　　一者福無量　二者離罪過　　慈心成就人　　法施勝財貨　瞋垢是非佗　　棘刺上坐臥一下以行法施故經中以七寶滿爾所恒河沙數三千大千世界以用布施得福甚多乃至受持四句偈為他人說勝前福德二下不規利說法故棘刺雖曰法座翻成棘刺。",
        "translation": "\"The two kinds of teachers who expound the Dharma are those who are elevated on high seats, the first with immeasurable merit and the second free from transgressions, those who are accomplished with kindness, those who give Dharma charity better than wealth, those who are defiled by anger, and those who are non-trivial. The thorns on the top of the head sit and lay down once because they practice Dharma charity.",
        "source": "X59n1096_001:0530a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　有漏為基堵　　無明作根本　　解經不除毒　法師自傷損　　賊心求名利　　怱怱未思忖　嬰孩欲登梯　　先須戒足穩基說文曰墻始築也堵(當吉切)垣也無明古師謂迷惑不了名曰無明體即是癡也以癡為貪瞋母故曰根本怱怱者與忩音義同速也選云何事怱怱言逐利之急速也嬰孩釋名曰人始生曰嬰兒胸前曰嬰抱嬰前乳養之也孩即長於嬰儒云嬰兒之未孩今喻闕行法師也。",
        "translation": "Contaminants are the foundation, blockage, and ignorance is the root. Understanding the sūtras doesn't remove the poison, and the teacher of the Dharma hurts and injures himself.",
        "source": "X59n1096_001:0530a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　學士聦明者　　舉動多輕躁　　或有錯解義　邪見復顛倒　　是故定治動　　七覺中法要　定慧平等修　　種智得微妙七覺中法要者以七覺中有定覺支故為治動之要也定慧下遮偏修也又七覺中有擇法覺支即智慧也種智總包道種智等智論有三智一切智是聲聞辟支佛道種智是菩薩一切種智是佛智也。",
        "translation": "A student of the secular world who acts with much agitation or is mistaken in understanding the meaning of wrong views and mistaken in mistaken views therefore has the essential principle of concentration to counteract agitation. The essential principle of the seven factors of awakening is that there are seven factors of awakening that are essential to counteract agitation because there are factors of concentration and wisdom that are essential to the cultivation of seed wisdom.",
        "source": "X59n1096_001:0530a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世尊在世時　　唯教修出離　　習善莫生足　少惡即遠避　　念念觀無常　　勤修真對治　寂慮學禪那　　何須著文字世尊者位高證極為世所尊也即十種通號之一修出離者近出三塗而生人天遠出三界而遠五陰等習善下於善勤修為多益美故不可生足也惡不可積少須避之故涅槃云莫謂小罪以為無殃水滴雖微漸盈大器念念者要無間斷也又智論曰無常有二種一者念念滅一切有情為法不過一念住二者相續法壞故名為無常如人命盡若火燒草木等勤修即習善對治即遠惡遠惡之要宜修禪定故復云寂慮學禪那等梵云禪那秦言思惟修即攝心繫念學諸三昧也又禪有世間出世間之異世即四禪根本出世復有二種一出世間禪即三三昧師子奮迅等二出世間上上禪即首楞嚴等百八三昧也。",
        "translation": "When the Bhagavān was in the world, he only taught cultivation of emancipation, cultivation of goodness that's not sufficient, lesser evil that's avoided, mindfulness of impermanence, diligent cultivation of true antidotes, and quiescent cultivation of meditation. The Bhagavān's rank is high, realized, and honored by the world, which is one of the ten general terms, cultivation of emancipation that's near escape from the three destinies and birth in heaven, far escape from the three realms and far escape from the five aggregates, etc., cultivation of goodness that's beneath goodness, diligent cultivation that's abundant and beneficial, so evil that's not accumulated must be avoided.",
        "source": "X59n1096_001:0530b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何因世尊在世時悉得聖道及生天中。",
        "translation": "Why is it that when the Bhagavān was alive, he fully attained the noble path and was born among the gods?",
        "source": "X59n1096_001:0530b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "依次而學不越毗尼入道有方五年習戒夜則修定攝心守境安處林野不畜餘食少欲慚愧一心諦觀無常不淨離諸調戲意不散亂舉動進止恒令淨潔無惡姿容先意問訊以是善緣悉得道迹。",
        "translation": "They trained in order, didn't transgress the vinaya, and entered the path. There were five ways to cultivate precepts, five nights to cultivate concentration, collect the mind and guard the objects, stay in the woods and fields, don't store other foods, have few desires and modesty, single-mindedly observe impermanence and impurity, part with agitation, and don't scatter the mind.",
        "source": "X59n1096_001:0530b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "有方方法也習戒修定例舉所詮之行也林野即塚間樹下不畜餘食者時至分衛故無餘畜此令修頭陀上行也經曰日中一食樹下一宿慎莫再矣無惡姿容者和顏視物也先意問訊者預語接人也鄭玄注禮曰小聘曰問又爾雅曰訊者言也即用言問彼曰少病少惱起居輕利又曰乞食易得住處無惡伴等是也。",
        "translation": "There are ways and means of cultivating precepts and concentrations, examples of which are explained in the practice of forest and fields, that is, under trees between cemeteries, not storing food for others, and not storing food for others because of the lack of security. The sūtras say that one meal in the day, one night under a tree, and caution should not be repeated.",
        "source": "X59n1096_001:0530b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "汝能一心依此學者名為淨心。",
        "translation": "If you can single-mindedly rely on this scholar, that's called a pure mind.",
        "source": "X59n1096_001:0530c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse goes.",
        "source": "X59n1096_001:0530c07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　正法證道時　　淨法調眾生　　隨事秉羯磨　除垢獲三明　　像法盡至末　　羯磨癈不行　雖復似和合　　集則起鬪諍正法簡像法末法此頌上佛在世時悉得聖道者蓋以毗尼等淨法調眾生故羯磨者明了論疏翻為業所作是業故亦翻為所作百論云事也今謂羯磨屬能被也事屬所被法事名通一百八十四種故言隨事等三明者謂過去宿命明現在漏盡明未來天眼明即六通中三也像法像似也以像法千年不及正法但像似耳至末法即萬年也此時雖有羯磨亦不行也所謂但有教理而無行果。",
        "translation": "\"When the right Dharma realized the path, the pure Dharma disciplined sentient beings according to circumstances, karma was applied to remove the stain and obtain the three kinds of knowledge, even though it seemed to be a combination, the collection then gave rise to a dispute. The verse says that when the Buddha was alive, all attained the noble path because karma was explained in the Commentary on the Clarification of the Dharma as karma and other pure dharmas that disciplined sentient beings.",
        "source": "X59n1096_001:0530c08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡是諸經律　　甘露亦毒藥　　解服百疹瘳　不消病發作　　知法不向心　　解經行轉薄　棄捨戒定業　　文字處起著解服下釋上甘露不消下釋上毒藥知法下法合毒藥反此知解而向心起行無捨戒定而不著文字則成甘露而百疹瘳矣(疹司忍切瘳丑鳩切病愈也)。",
        "translation": "All these sutras and vinaya, the ambrosia is also poisonous, and when the understanding is taken, the hundred rashes are healed, and the illnesses that arise don't subside.",
        "source": "X59n1096_001:0531a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　所以韻句撰　　讀時心歡樂　　靜坐好思量　觀察自忖度　　何緣重頌偈　　文少義廣愽　依誡益汝身　　信受勿疑惡所以下推偈中成韻所以何緣下推長行後立頌所以也對法等論說重頌者即復更頌前長行義又云不了義經應更頌即為二義故立重頌一者為益利根後來二者為顯前不了義令聽法者見解明淨故涅槃但有初之一義成實第二云或佛自說或弟子說欲令義理堅固不散如線貫華次第堅固又嚴飾詞句令喜樂故又義入偈中則令要略易可解故今文異同成實依戒戒當從言作。",
        "translation": "Therefore, when you read it, your mind is happy, you sit quietly and deliberate, you examine yourself, and you consider why you're rejoicing in the verse when the text is small and the meaning is broad, relying on the precepts to benefit you, believing and accepting them, and not doubting evil.",
        "source": "X59n1096_001:0531a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　或見他毀罵　　輕賤心漠漠　　此約大乘教　與理不違錯輕賤心漠漠者謂或遭彼毀罵輕賤要清虗其心不納其言也爾雅云漠清也文選曰澹乎至人心恬然存乎玄漠注曰至人真性澹乎然無所營為唯在玄然寂寞而已今若能如此則其心無惱也此約下謂上既破於著文離相克證種智等此即歸大乘之教也及令心泊乎無為與真理相冥則終成校量心行之旨也。",
        "translation": "This is a teaching that's based on the great vehicle and doesn't contradict the principle. A person who is despised by another and despised by another should clear their mind and not accept their words.",
        "source": "X59n1096_001:0531a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀六難自慶修道法第五",
        "translation": "Admonitions for Contemplating the Six Difficulties in Self-Honoring Cultivation, Part V",
        "source": "X59n1096_001:0531b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五釋自慶篇推校心行漸使於調柔依正克隆得不懷於自幸故次前位以立茲篇謂人身中國等誠非易偶故曰六難既幸而獲當營善利故曰自慶修道。",
        "translation": "Five explanations of the chapter on self-enjoyment are to examine the mind and gradually make it flexible, rely on proper cloning, and not harbor self-gratification.",
        "source": "X59n1096_001:0531b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一者萬類之中人身難得如提謂經說今得人身難於龜木二者雖得人身中國難生此土即當邊地之中具足大乘正法經律三者雖有正法信樂復難今隨力信不敢疑謗四者人身難具今受男形根無殘缺相貌成就五者雖具男形六根無缺五欲纏染出家甚難今得割愛出家修道披著佛衣受佛淨戒六者雖受禁戒隨戒甚難汝可於戒律中尊重愛樂慚愧慎護。",
        "translation": "Although it's difficult to attain the person and China, it's difficult to be born in this land, which is the future borderlands and is complete with the scriptures and rules of the right great vehicle teaching. Although it's difficult to believe in and enjoy the right teaching, it's difficult to follow the strength of faith and not dare to doubt it.",
        "source": "X59n1096_001:0531b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "提謂經有真偽二本故僧祐錄稱宋孝武時北國沙門曇靖撰一卷者邪正天別續高僧傳舊錄別有提謂經一卷與諸經語同今所引者是真本智昇錄曰久虧其本無可究尋龜木者菩薩處胎經佛說偈曰盲龜浮木孔時時猶可值人一失命根億劫復難是又大莊嚴論曰我昔聞有一小兒經中說龜值浮木孔其事甚難此小兒故穿一板作孔受頭擲著池中自入池內低頭舉頭欲望入孔水漂板故不可得值即自思惟極生厭惡人身難得佛以大海為喻浮木孔小盲龜無眼百年一出實難可值我今池小其板孔大復有兩目日百出頭猶不能值況復盲龜而當得值即說偈曰巨海極廣大浮木孔復小百年而一出得值甚為難我今池水小浮木孔復大數數自出頭不能值木孔盲龜遇浮木相值甚為難惡道復人身難值亦如是中國者通局有二通則印土為中故方志曰則以佛所生國迦毗羅城應是其中謂居四重鐵圍之內故經曰三千日月萬二千天地之中央也佛之威神不生邊地若生邊者地為傾斜故中天竺國如來成道樹下有金剛座用承佛焉據此為中也局則約此神州故戒疏曰此方中嶽亦號中華且據軒轅局談中表若然則邊自立中故曰邊地之中也甞試論之中邊在人不定局處何哉苟人居邊而聞法生解斯成中矣中不聞法反成邊矣如舍婆三億家不聞不見今神州雖具正法而有生不經耳者又何異舍婆三億之徒哉信樂者夫信為道源功德母安得誠言而不信受如宋傳曰順璟浪郡人甞覽華嚴經中始從發心便已成佛乃生毀謗啟手足時扶掖下地地便徐裂璟身俄墜生陷地獄至今有坑廣袤丈餘號順璟捺落迦也此由不信之愆耳又傳曰隋天台法智每謂人曰我聞經言犯一吉羅歷一中劫入于地獄可信又聞經說一稱阿彌陀佛滅八十億劫生死重罪則未之信人難云何故生大邪見俱是佛言急須念佛久則三昧現前乃於國清寺兜率臺上晝夜精進念佛忽預辭道俗曰生西方中夜無疾而化時有金色光明來迎照數百里江上漁人謂言天曉遲久方明始知智之往生矣此由信之力也今若依教信奉復起欣樂善莫大矣男形者非受黃門二形女人等報也根者約下載牒中是總六根也相貌者非跛躄矬陋之相也五欲者色聲香味觸能纏縛行人三界受生今若能觀色如熱金聲如毒鼓香如惡氣味如沸蜜觸如蛇虺近則能出父母妻子之家遠能出三界火宅之家也斯事非易故曰甚難婆沙云家者煩惱因緣出家者為滅垢累故佛衣以三衣是無上法王之服一切九十六種外道皆無由斯受持故得解脫受佛淨戒者以一受之後能清色心革凡成聖故隨戒即隨中之行上雖明受而必資隨故大師曰受是要期思願隨是稱願修行若但有受無隨直是空願之院不免寒露之弊若但有隨無受此行或隨生死又是局狹不周今言隨戒難者謂受據壇場受體初始發心隨約受後防非終至四捨時既經遠復為難矣。",
        "translation": "The Sutra of Trapuṣa has two versions, genuine and counterfeit. Therefore, when Sengyou said that during the Song Dynasty, the ascetic Tanying of the Northern Kingdom wrote a one-volume work, the old records of the separate continuity of the biographies of senior monks from the erroneous and correct gods have a one-volume work, which is the same as the words of the other sutras. The one quoted here is the genuine version of the Zhisheng Record, which says that the long-deficient bodhisattva's abode in the womb is not investigable, and the Buddha spoke in verse, saying that a blind turtle with a hole in floating wood can still be worthy of a person's life root for a hundred million eons.",
        "source": "X59n1096_001:0531b16_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "於此六事若不觀察即便放逸深障聖道既超六難常應喜慶難得已得得已莫失如是思量名為淨心。",
        "translation": "If someone doesn't examine these six things, even if they are careless, they'll deeply hinder the noble path. Having surpassed the six difficulties, they should always rejoice in the fact that they've been attained and gained, and then not lose them. Such deliberation is called a pure mind.",
        "source": "X59n1096_001:0532a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六事即六難綺互其文耳。",
        "translation": "The six things are the six difficulties, and the text is a perfect match.",
        "source": "X59n1096_001:0532a24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse goes.",
        "source": "X59n1096_001:0532b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　世有六種難　　難得已得具　　勤修戒定慧　善解名味句　　是故學大乘　　問即須知處名味句謂義味由名句之所生也亦云名句文既曰善解須兼大小又須善通外問故下曰問即須知處。",
        "translation": "\"There are six kinds of difficulties in the world that are difficult to attain and have been attained fully, diligently cultivating morality, meditation, and wisdom, and skillfully understanding the words of names and flavors. Therefore, students of the great vehicle should train in the field of questioning, which is the place of needing to know, and the words of names and flavors, which are the meanings and flavors that arise from the words and phrases, as well as the words and phrases.",
        "source": "X59n1096_001:0532b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　受他檀越食　　飽腹無智慮　　無智長貪瞋　不能如法住　　犯禁毀戒足　　命終生四趣檀越亦云陀那鉢底此云施主或日檀那秦言布施四趣者即四惡趣六道中除人天耳以是善趣故若智論修羅亦在善趣収故楞嚴修羅道四趣今既言惡應在下趣所収。",
        "translation": "Accepting food from others, filling their bellies without wisdom or concern, lacking wisdom, growing greed and anger, and being unable to abide in accord with the Dharma, violating prohibitions and violating the precepts, and then being born in the four destinies at the end of their lives.",
        "source": "X59n1096_001:0532b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀世相如夢修出世善根法第六",
        "translation": "The sixth admonition to observe worldly phenomena as a dream and cultivate supramundane good roots.",
        "source": "X59n1096_001:0532b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六釋善根篇自慶修道已不昧於憲章覩世知空須克敦於出離故立此位以次前篇謂榮名利養殊非實有故曰世相如夢了妄趣真薰成聖種故曰修出世善根出世者出離三界器世也。",
        "translation": "Sixth, he explains that the chapter on good roots celebrates the fact that he has cultivated cultivation and hasn't lost sight of the constitution, sees the world and knows emptiness, and must strive to escape.",
        "source": "X59n1096_001:0532b14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "云何方便能令眾生離苦出世。",
        "translation": "What skillful means can cause sentient beings to part with suffering and transcend the world?",
        "source": "X59n1096_001:0532b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "但愚人貪愛我即不貪何者是名世愚貪愛所謂官榮封賞車馬庫藏臺觀園林采女音樂上服美饌遊戲射獵宴會倡伎嫁娶賓席特怙族姓追朋逐勢三軍列陣前鋒精銳謀策將略果毅傷殺平殄除蕩快意適情攻城破柵収縛簿斂刀筆豪俠意志建立俗藝毉方工巧居積攝斂奠祭以要言之如此。",
        "translation": "But foolish people crave what I don't crave, which is called worldly foolish craving, which is called official glory, fiefs, rewards, carts, horses, treasury, terraces, gardens, forests, women's music, fine clothing, fine dining, games, hunts, banquets, musicians, weddings, banquets, feasts, clans, and clansmen, chasing after friends and opponents, three armies in formation, three vanguards, sharp counsels, strategies, generals, strategies, resolute assaults, kills, pacifies, destroys, confiscates, binds, swords, pens, heroic wills, establishes secular arts, recipes, prescriptions, arts and crafts, accumulates, recites, recites, and pays respects to the sacrifices.",
        "source": "X59n1096_001:0532b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我者目出家之士也以出家之人本破我我所今順世諦假名呼之封賞封約官爵賞據賜賚也庫藏貯物舍曰庫又通俗文曰庫藏曰帑臺者爾雅曰四方而高曰臺釋名曰臺持也言築土堅高能自勝持觀者劉熈曰於上觀望也爾雅曰觀謂之闕園林園如下解林說文曰平地有叢木曰林采謂採擇有德之女或作綵後漢光武立美人綵女之號上服名衣也美饌說文曰具食也論語曰有酒食先生饌馬融曰饌飲食也倡伎業疏曰倡謂排憂以人為戲弄也伎通男女即奏樂也又伎倆也嫁娶者男曰娶女曰嫁方言曰自家而出謂之嫁禮記曰男三十而娶謂娶於異姓賓席者設之以待賓也周禮以饗燕之禮觀四方之賓客也族姓周禮五家為比五比為閭四閭為族是百家為一族也一族間必有豪盛之家號曰族姓三軍軍族也周禮夏官司馬曰凡制軍萬有二千五百人為軍王六軍大國三軍次國二軍小國一軍謀策春秋正義曰編簡為策釋名曰書教令於上所以驅策諸下也漢制約勅封侯曰冊冊賾也勅使整賾不犯法也將略略謀略也又法也果毅(魚既切)果敢曰毅殄絕也城崔豹古今注曰城者盛也所以盛受人物也柵竪編木也又村柵也簿斂簿籍斂聚也劉熈曰簿言可以簿疏物也籍所以籍人名戶口也刀筆古者無紙例書以竹簡木櫝當者留之不當者則削故今目於翰簡曰刀筆也釋名曰筆述也述事而書之豪俠意志者即恃雄豪為任心意志氣慠逸於物也俗藝漢書地里志曰好惡取舍動靜非常隨君上之情欲故謂之俗藝者才能也醫方工巧屬五明之數西域記曰醫方明者禁呪閑邪藥石針艾也工巧明者伎術機關陰陽歷數又周禮曰知(去呼)者[邱-丘+倉]物巧者述之守之世謂之工又曰天有時地有氣材有美工有巧合此四者然後可以為良居積下即儲畜聚斂貨物以事商估也奠祭即九流中墨流也禮注曰奠薦也陳也言陳薦於先祖也劉熈曰喪祭曰奠奠停也言停久也祭尚書大傳曰祭之言察也察者至也言人事至於神也。",
        "translation": "我者目出家之士也以出家之人本破我我所今順世諦假名呼之封賞封約官爵賞據賜賚也庫藏貯物舍曰庫又通俗文曰庫藏曰帑臺者爾雅曰四方而高曰臺釋名曰臺持也言築土堅高能自勝持觀者劉熈曰於上觀望也爾雅曰觀謂之闕園林園如下解林說文曰平地有叢木曰林采謂採擇有德之女或作綵後漢光武立美人綵女之號上服名衣也美饌說文曰具食也論語曰有酒食先生饌馬融曰饌飲食也倡伎業疏曰倡謂排憂以人為戲弄也伎通男女即奏樂也又伎倆也嫁娶者男曰娶女曰嫁方言曰自家而出謂之嫁禮記曰男三十而娶謂娶於異姓賓席者設之以待賓也周禮以饗燕之禮觀四方之賓客也族姓周禮五家為比五比為閭四閭為族是百家為一族也一族間必有豪盛之家號曰族姓三軍軍族也周禮夏官司馬曰凡制軍萬有二千五百人為軍王六軍大國三軍次國二軍小國一軍謀策春秋正義曰編簡為策釋名曰書教令於上所以驅策諸下也漢制約勅封侯曰冊冊賾也勅使整賾不犯法也將略略謀略也又法也果毅(魚既切)果敢曰毅殄絕也城崔豹古今注曰城者盛也所以盛受人物也柵竪編木也又村柵也簿斂簿籍斂聚也劉熈曰簿言可以簿疏物也籍所以籍人名戶口也刀筆古者無紙例書以竹簡木櫝當者留之不當者則削故今目於翰簡曰刀筆也釋名曰筆述也述事而書之豪俠意志者即恃雄豪為任心意志氣慠逸於物也俗藝漢書地里志曰好惡取舍動靜非常隨君上之情欲故謂之俗藝者才能也醫方工巧屬五明之數西域記曰醫方明者禁呪閑邪藥石針艾也工巧明者伎術機關陰陽歷數又周禮曰知(去呼)者[邱-丘+倉]物巧者述之守之世謂之工又曰天有時地有氣材有美工有巧合此四者然後可以為良居積下即儲畜聚斂貨物以事商估也奠祭即九流中墨流也禮注曰奠薦也陳也言陳薦於先祖也劉熈曰喪祭曰奠奠停也言停久也祭尚書大傳曰祭之言察也察者至也言人事至於神也。",
        "source": "X59n1096_001:0532c01_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "眾多世務無量殺害飲酒噉肉鬪諍勝負怨雔熱惱悲喜安危吉凶禍福能於此中悉捨離者名真修道出世人也眾生迷倒於此世事謂是真法不知無數劫來生死大苦身壞命終墮三惡道恒河沙劫受大燒煑雖遭此苦仍於生死貪著無厭迭相承習迷惑塵境皆由未值善導未聞正法汝今既聞如聞修學名為淨心。",
        "translation": "Many worldly affairs are countless, including killing, drinking, eating, meat, fighting, winning, losing, resentment, passions, sorrow, happiness, security, good fortune, and bad fortune. Those who can completely abandon them are called true practitioners of cultivation and transcend the world. Sentient beings are deluded in these worldly affairs and think they're the true teaching. They don't know that for countless eons birth-and-death is a great suffering, that their bodies break up, that their lives end, that they fall into the three evil destinies, that they are burnt for eons, and that they experience great suffering, but they're still addicted to birth-and-death and don't tire of repeatedly continuing to be confused about objects because they haven't met a good guide and haven't heard the right teaching.",
        "source": "X59n1096_001:0533a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "以要至無量是結略辭合在禍福下則善雔正作讎(市流切)仇也迭相迭遞也更也善導知識之通號也至於如來亦稱善導故經曰我如良醫又如善導。",
        "translation": "From the essentials to the infinite is the abbreviation for the conjunction under \"woe and fortune,\" then \"good guidance\" is correctly translated as \"synopsis\" (shiluche), \"enmity,\" \"iteration,\" \"passing,\" \"change,\" and \"the general term for a well-directed friend.\" As for the Tathāgata, he's also called a good guide.",
        "source": "X59n1096_001:0533a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0533b01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　凡夫狂癡性　　所見常不正　　資養三毒身　貪瞋轉增盛　　未觀屍穢形　　持糞如行屏　常遊違順境　　詐偽起諂佞　　實無常我樂　妄見常我淨　　罪業顛倒故　　恒遊諸險徑資養資或作恣行屏廣雅曰圊圂屏皆廁之別名又屏字亦作併(防正切)字統曰廁也實無下以心實無常妄見為常法實無我妄見有我受實是苦妄見為樂身實不淨妄見為淨此之兩句即四念四倒兩相翻也又上句欠淨字下句少樂字為成句偈互對影略聖智之巧險徑喻三惡道也。",
        "translation": "\"Ordinary people's delusions of grandeur, their views are always incorrect, they feed the three venomous bodies, their greed and anger increase, they don't yet observe the corpse's defiled form, they hold dung like a walking screen, they travel constantly in opposition, they are deceitful and deceitful, they really don't have permanence, self and happiness, and they deludedly see permanence and self and purity.",
        "source": "X59n1096_001:0533b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　智者如實解　　慧命心決定　　觀世如夢幻　窮真道成聖智下有智之人目為智者契理而知故曰如實解理解既實則智慧性命必無差失故曰慧命心決定因緣解了故不同眾生認倒為實故曰觀世如夢幻了幻則聖道可證故曰窮真道成聖。",
        "translation": "The wise person understands things as they really are, and the mind of wisdom and life are determined.",
        "source": "X59n1096_001:0533b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀破戒僧尼不修出世法第七",
        "translation": "Admonition to observe that renegade monks and nuns don't practice supramundane dharmas 7th",
        "source": "X59n1096_001:0533b18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "上根之者了世相之非堅中下之流逐塵境而還附善難久固戒乃毀傷故次前篇以立茲訓謂不修五篇禁制曰破戒五眾之上二故號僧尼唯耽俗務曰不修出世法僧尼者梵云僧伽此云眾文曰大眾者四人若過然亦有通者始從一人終至二十皆名僧今一往目比丘耳尼者善見曰尼女也梵阿摩此曰女母。",
        "translation": "Those with superior faculties understand the world's characteristics and are not resolute, while those in the lower streams follow the objects and return to attach to goodness, which is difficult to establish for a long time, and the precepts are disparaged.",
        "source": "X59n1096_001:0533b19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "僧尼破戒者。",
        "translation": "A monk or nun who breaks the precepts.",
        "source": "X59n1096_001:0533c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂畜養奴婢僮僕牛驢車乘田宅種植園林華果金銀粟白屏風氈被好枕細席箱匱盆瓮銅器盤椀上好三衣牙牀坐褥房舍退屋厨庫碓磨脂麵藥酒雜鮭醬酢異種口味王公貴重多人顧識生緣富貴數過親舊餉送吊問申訴衙府身為眾首門徒彊盛講說相難好喜音樂常居一寺評量僧事迭相擯罸借問旱潦豐儉盜賊水火毒獸之事經過酒店市纏屠膾獵射之家親友婦女琴瑟詩賦圍碁雙陸讀外書典高語大笑嫌恨諍競飲酒食肉綾羅衣服五色鮮明勤剃鬚鬚爪利如鋒畜八不淨財寶富足於此等事貪求愛著積聚不離名真破戒。",
        "translation": "所謂畜養奴婢僮僕牛驢車乘田宅種植園林華果金銀粟白屏風氈被好枕細席箱匱盆瓮銅器盤椀上好三衣牙牀坐褥房舍退屋厨庫碓磨脂麵藥酒雜鮭醬酢異種口味王公貴重多人顧識生緣富貴數過親舊餉送吊問申訴衙府身為眾首門徒彊盛講說相難好喜音樂常居一寺評量僧事迭相擯罸借問旱潦豐儉盜賊水火毒獸之事經過酒店市纏屠膾獵射之家親友婦女琴瑟詩賦圍碁雙陸讀外書典高語大笑嫌恨諍競飲酒食肉綾羅衣服五色鮮明勤剃鬚鬚爪利如鋒畜八不淨財寶富足於此等事貪求愛著積聚不離名真破戒。",
        "source": "X59n1096_001:0533c03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "奴婢說文曰男入罪曰奴女入罪曰婢由畜此類故馬鳴所謂難生卑下心過若據大師意為離染過故大鈔曰今諸伽藍或賣買奴婢者其中穢雜孰可言哉豈唯犯婬盜亦隨犯深知聖制不許凡豈強哉故僧祇曰若人施僧奴若施園民婦一切不應受若言施供給僧男淨人聽受僮僕廣雅曰役使也牛驢僧祗曰若人施一切眾生並不應受理在通攝今約喜犯故略標耳車乘說文曰輿輪總名古音居釋名曰古者車如居言行所以居人也今曰車(齒邪切)舍也言行者所處如舍也乘廣雅曰駕也謂可駕乘者也周禮四馬曰乘乘載也田宅劉熈曰土已耕者曰田田者填也五稼填滿其中也宅說文曰託也人所投託也此是妨道之物別人不開種植會通曰下子曰種移根曰植僧祇曰為僧營理者得別人不開即污家戒中自種教他一切不合粟種子也屏風釋名曰障風也亦曰扆在後所依倚也鄭玄注禮曰扆屏風也崔豹古今注曰孫亮作瑠璃屏風今多以紙素為者於眾可畜別人不宜以體重妨道故氈釋名曰氈旃也毛著旃旃也四分曰氍毹他施聽受廣三肘長五肘淨施畜今約大者被者釋名曰被被(去呼)也被覆人也枕檢也所以檢項也席釋也可卷可釋也瓮或作甕北人呼瓮南人曰鋼上好三衣即體色貴重者非道人所畜牙牀者牙角莊飾者釋名曰牀裝也所以自裝載也退屋一室之外更畜復餘退屋碓(都妹切)舂也脂即猪驢魚等脂也孫炎曰膏凝曰脂藥酒諸藥酒煎也鮭(古擕切)魚名王公下即遺教中結好貴人也因結好故多作媟慢二語又經曰不親近國王王子大臣官長生緣即父母也以父母為生我之緣如事鈔有生緣奉信法是也數過頻數經過也親櫬也言相隱櫬也餉饋也吊問吊生曰唁(魚變切)吊死曰吊訴訟也借問旱潦雨水曰潦或作澇潦也謂但詢世事也經過下舉其游往之非也酒家或請召者當一日不沽酒者得入或別有門者得屠家亦爾要一日不殺也店崔豹古今注曰店置也所以置貨鬻之物也市纏風俗通曰市恃也言交易而退恃以不匱也纏合作廛市中空地謂之廛屠膾說文曰屠刳也廣雅曰屠壞也又屠分割牲肉也膾應法師曰切肉也獵謂田獵白虎通曰為田除害故曰田獵射即弓射譙子法訓曰善射者調弓定準見可而發琴風俗通曰樂之統也琴操曰伏犧始作世本曰神農作白虎通曰琴者禁也禁止於邪以正於人心也廣雅曰琴長三尺六寸六分象三百六十六日五絃象五行大絃為君小絃為臣文王武王加二絃以合君臣之恩也又五絃第一為宮其次商角徵羽文武二絃為少宮少商又琴操曰廣六寸象六合上曰池言其平下曰濵言其服前廣後狹象尊卑上圓下方顯天地瑟世本曰庖犧作五十絃黃帝使素女鼓瑟哀不自勝乃破為二十五絃三禮圖曰瑟似琴但頭小狀與琴少異詩賦文選序曰古詩之體今則全取賦名斑固曰賦者古詩之流今之述作者詩賦殊體不同古詩隨志立名也圍碁博物志曰堯造圍碁教子丹朱或曰舜以子商均愚故作圍碁以教之雙陸聲譜曰愽陸采名也魏志陳思王曹子建製雙陸局置骰子二因以名也外書典即外道經書典籍等今多有浮圖氏全背正教而淫外書亦事五佛出世之訓也且古之巨儒有梁肅師元浩裴休依宗密彼尚潛心空典此何頓棄祖乘苟或三藏該明六經旁曉此則不害於道矣通慧曰如習鑿齒道安以詼諧而伏之宗雷(即宗炳雷次宗)之輩慧遠以詩體而誘之崔無二復禮以辨惑而柔之陸[丘*鳥]漸皎然以詩式而友之此皆不施他術唯通外學耳未能如此且專己宗寄語後昆未可忘本勤剃鬚髮等者據沙門之剃落為除憍慢為毀形好如律中頭鬚爪髮悉皆長利法滅之相今若未長數剃為成好相斯非正意故下邪命中曰數為洗剃是也今時又有一數故留爪髮顯異惑眾斯何徒哉若能務恊中庸方符聖旨律中爪極長一麥當剪。",
        "translation": "奴婢說文曰男入罪曰奴女入罪曰婢由畜此類故馬鳴所謂難生卑下心過若據大師意為離染過故大鈔曰今諸伽藍或賣買奴婢者其中穢雜孰可言哉豈唯犯婬盜亦隨犯深知聖制不許凡豈強哉故僧祇曰若人施僧奴若施園民婦一切不應受若言施供給僧男淨人聽受僮僕廣雅曰役使也牛驢僧祗曰若人施一切眾生並不應受理在通攝今約喜犯故略標耳車乘說文曰輿輪總名古音居釋名曰古者車如居言行所以居人也今曰車(齒邪切)舍也言行者所處如舍也乘廣雅曰駕也謂可駕乘者也周禮四馬曰乘乘載也田宅劉熈曰土已耕者曰田田者填也五稼填滿其中也宅說文曰託也人所投託也此是妨道之物別人不開種植會通曰下子曰種移根曰植僧祇曰為僧營理者得別人不開即污家戒中自種教他一切不合粟種子也屏風釋名曰障風也亦曰扆在後所依倚也鄭玄注禮曰扆屏風也崔豹古今注曰孫亮作瑠璃屏風今多以紙素為者於眾可畜別人不宜以體重妨道故氈釋名曰氈旃也毛著旃旃也四分曰氍毹他施聽受廣三肘長五肘淨施畜今約大者被者釋名曰被被(去呼)也被覆人也枕檢也所以檢項也席釋也可卷可釋也瓮或作甕北人呼瓮南人曰鋼上好三衣即體色貴重者非道人所畜牙牀者牙角莊飾者釋名曰牀裝也所以自裝載也退屋一室之外更畜復餘退屋碓(都妹切)舂也脂即猪驢魚等脂也孫炎曰膏凝曰脂藥酒諸藥酒煎也鮭(古擕切)魚名王公下即遺教中結好貴人也因結好故多作媟慢二語又經曰不親近國王王子大臣官長生緣即父母也以父母為生我之緣如事鈔有生緣奉信法是也數過頻數經過也親櫬也言相隱櫬也餉饋也吊問吊生曰唁(魚變切)吊死曰吊訴訟也借問旱潦雨水曰潦或作澇潦也謂但詢世事也經過下舉其游往之非也酒家或請召者當一日不沽酒者得入或別有門者得屠家亦爾要一日不殺也店崔豹古今注曰店置也所以置貨鬻之物也市纏風俗通曰市恃也言交易而退恃以不匱也纏合作廛市中空地謂之廛屠膾說文曰屠刳也廣雅曰屠壞也又屠分割牲肉也膾應法師曰切肉也獵謂田獵白虎通曰為田除害故曰田獵射即弓射譙子法訓曰善射者調弓定準見可而發琴風俗通曰樂之統也琴操曰伏犧始作世本曰神農作白虎通曰琴者禁也禁止於邪以正於人心也廣雅曰琴長三尺六寸六分象三百六十六日五絃象五行大絃為君小絃為臣文王武王加二絃以合君臣之恩也又五絃第一為宮其次商角徵羽文武二絃為少宮少商又琴操曰廣六寸象六合上曰池言其平下曰濵言其服前廣後狹象尊卑上圓下方顯天地瑟世本曰庖犧作五十絃黃帝使素女鼓瑟哀不自勝乃破為二十五絃三禮圖曰瑟似琴但頭小狀與琴少異詩賦文選序曰古詩之體今則全取賦名斑固曰賦者古詩之流今之述作者詩賦殊體不同古詩隨志立名也圍碁博物志曰堯造圍碁教子丹朱或曰舜以子商均愚故作圍碁以教之雙陸聲譜曰愽陸采名也魏志陳思王曹子建製雙陸局置骰子二因以名也外書典即外道經書典籍等今多有浮圖氏全背正教而淫外書亦事五佛出世之訓也且古之巨儒有梁肅師元浩裴休依宗密彼尚潛心空典此何頓棄祖乘苟或三藏該明六經旁曉此則不害於道矣通慧曰如習鑿齒道安以詼諧而伏之宗雷(即宗炳雷次宗)之輩慧遠以詩體而誘之崔無二復禮以辨惑而柔之陸[丘*鳥]漸皎然以詩式而友之此皆不施他術唯通外學耳未能如此且專己宗寄語後昆未可忘本勤剃鬚髮等者據沙門之剃落為除憍慢為毀形好如律中頭鬚爪髮悉皆長利法滅之相今若未長數剃為成好相斯非正意故下邪命中曰數為洗剃是也今時又有一數故留爪髮顯異惑眾斯何徒哉若能務恊中庸方符聖旨律中爪極長一麥當剪。",
        "source": "X59n1096_001:0533c14_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "經曰此等比丘名禿居士名披袈裟賊名禿獵師名三塗人名無羞人名一闡提名謗三寶名害一切檀越眼目名生死種子名障聖道遠離此等十種惡名即為淨心。",
        "translation": "The sūtras say that these monks are called bald gentlemen, monk-robed thieves, bald hunters, three-doodle people, shameless people, monks who denigrate the Three Treasures, names that harm the eyes of all religious practitioners, seeds of birth-and-death, and names that obstruct the noble path. To avoid these ten bad names is to purify the mind.",
        "source": "X59n1096_001:0534c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "居士者外國居財一億稱下居土乃至百億名上居士今則剃髮積貯雖僧而俗故曰禿居士也賊者以破戒利養不消如盜得故名賊善見曰比丘破戒受施名為盜用獵師蔡邕月令章句曰獵捷也言以捷取之也今此比丘捷獵財食不異於彼故名曰禿獵師一闡提者涅槃約七義釋初曰一闡名信提名不具不其信故名一闡提次約善方便進念定慧無常善等解闡提廣如初句是則闡提一名具含眾惡古來諸德未見的翻唯河西道朗翻為極欲謂極惡欲之邊故或曰信不具則失餘義既含眾惡不可偏翻況復經曰最極惡者名一闡提。",
        "translation": "A householder who lives in a foreign land with 100 million possessions is called a householder of the lower land and even 10 billion is called a householder of the upper land. A thief is someone who breaks the precepts and accumulates accumulations, even though it's monastic and secular, so he's called a thief. Good advice says that a monk who breaks the precepts and accepts charity is called a thief.",
        "source": "X59n1096_001:0534c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0535a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　可怪凡夫人　　積聚貪瞋癡　　破戒無羞耻　輕賤木叉珍　　追求忙如火　　種植涉艱辛　教他多布施　　自捨若抽筋　　慠慢善知識　恃怙膿血身　　放逸著五欲　　何時出苦津木叉此曰別別解脫戒疏曰事戒名別脫道戒名解脫以道性虗通舉法類遣也而言珍者可尊貴故又戒序曰如寶求無厭寶即珍也善知識者涅槃曰具足梵行名善知識。",
        "translation": "It's strange that ordinary ladies accumulate greed, anger, and folly, break the precepts without shame, despise the jewel of the mokṣa, pursue busyness like fire, plant seeds, involve hardship, teach others to be generous, abandon themselves if they have sinews, become arrogant, and know good consciousness, rely on the body of pus and blood, and become carelessly attached to the five desires. When does the mokṣa emerge from suffering and allow for liberation? The commentary on the precepts says that the moral precepts are called liberation by distinction, and the path precepts are called liberation by the nature of the path, which is general, citing the types of dharmas to be rejected.",
        "source": "X59n1096_001:0535a05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　衣貪五色服　　食貪常飽肚　　捨靜入憒閙　經戒未曾覩　　㧞草復掘地　　溉灌治園圃　生業過俗人　　瓮匱居三五　　唯憂財不足　鎻門牢閉戶　　高聲大語笑　　謟慢心未普　毀犯四重禁　　觝突兇如虎　　身壞永沈淪　罪畢生夷虜五色服者含五方正間也五正者即青黃赤白黑也五間者即綠紅碧紫[馬*甾]黃色也此由五行相刻而成先儒曰青是東方正綠是東方間東方為木木色青木刻土土色黃並以所刻為間故綠色青黃也赤是南方正紅是南方間南為火火色赤火刻金金色白故紅色赤也白是西方正碧是西方間西為金金色白金刻木木色青故碧色青白也黑是北方正紫是北方間北方水水色黑水刻火火色赤故紫色赤黑也黃是中央正[馬*甾]黃是中央間中央土土色黃土刻水水色黑故[馬*甾]黃色黃黑也斯皆悅目之色生人貪心佛不聽服今反服之憒閙心亂曰憒㧞草掘地溉灌皆單提中戒園圃說文曰園樹果圃樹菜也觝突觝觸也夷虜禮記曰東方曰夷南方曰蠻西方曰戎北方曰狄今謂夷狄邊虜之地且周孔之教彼尚不聞況佛法乎仲尼曰夷狄之有君不如諸夏之亡也蓋美中國而賤蠻夷也今既於法不遵生使罪終生彼。",
        "translation": "The five-colored robe contains the five directions of the correct interval. The five corrects are blue, yellow, red, white, and black, and the five intervals are green, red, purple, [horse*stan] yellow, and black. Yellow is the central correct [horse*stan] yellow is the central earth, the earth's color is yellow, the earth's color is black, and the earth's color is black because it's carved into water.",
        "source": "X59n1096_001:0535a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　可念眾生犯　　癡暗無慧光　　但貪目前利　不見當來殃　　出家望靜樂　　返為馳逐忙　抱財忽命終　　道俗競分張　　惡性如蛇蝎　惡貪如犲狼　　剃頭無實德　　高容返自傷　隱罪求名聞　　不畏利養瘡　　白衣修戒施　壽盡生天堂　　沙門倒慳惜　　不觀空無常　唯知造惡業　　觸事皆面牆　　破戒違律儀　無慙故覆藏　　我作還我受　　三塗遣誰當　雖無我人法　　善惡亦不亡　　三界輪迴苦　六道生死長道俗競分張者生雖貯畜死無一隨或作法愽散與僧或滅擯斷還於俗如僧祇陳如空林入般乃至佛言屬僧又滅擯比丘若死衣物入親(以此人財法兩亡不受僧利故還親屬也)又四分曰淨人五中與一是知義通道俗惡性如蛇蝎者此句舉瞋也蝎春秋正義曰蠆毒蟲也高容者即高儀尚容也今若起於貪瞋等返同蛇蝎之所傷也名聞(去聲)聲達曰聞詩曰令聞令望利養瘡者言於身為病復可惡(去聲)故如其瘡疱也白衣下十誦曰未來世中出家之人入地獄白衣生天以俗人無法在身但專信故得生天也出家有法為世福田乃返毀犯妄受信施開諸惡門故入地獄也面牆者夫子謂伯魚曰人而不為周召南(風之始也)其猶正牆面而立也與善惡下佛言假使經百劫所作業不亡因緣會遇時果報還自受六道生死長者非唯一報生死之長謂流浪六道生已復死死已復生都未出離故言長耳。",
        "translation": "Being mindful of the transgressions of sentient beings, their delusion is darkened by lack of wisdom, and they only desire present gain and don't see future evil.",
        "source": "X59n1096_001:0535b12_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "　如是諸惡過　　謹慎好思量　　願斷相續因　持心如金剛　　定水洗煩惱　　戒城自遮防　德如螺髻梵　　去處見西方金剛者梵曰跋闍此曰金剛唐書曰百鍊不消可以切玉一曰若著山石陷至水際見同數則止今取堅固義螺髻梵者淨名曰爾時螺髻梵王語舍利弗勿作是語謂此土以為不淨所以者何我見釋迦牟尼佛土清淨譬如自在天宮舍利弗言我見此土丘陵坑坎荊棘沙礫土石諸山穢惡充滿螺髻梵王言仁者心有高下不依佛慧故見此土為不淨耳舍利弗菩薩於一切眾生悉皆平等深心清淨依佛智慧則能見此佛土清淨今言西方者意目於淨土耳若能達了此土即西方也故智者曰心分垢淨見兩土之卑沈行開善惡覩二方之麤妙今若迷者淨則成穢經曰譬如諸天共寶器食隨其福德飯色有異又曰隨其心淨即佛土淨大集曰欲淨佛土當淨汝心又華嚴經曰無量諸佛世界悉從心緣起故知心淨則佛土淨矣。",
        "translation": "Such are the evils and faults, which are carefully and well-considered, and which are causes of continuity, which are maintained with a mind like adamant, which is cleansed of afflictions by still waters, which are guarded by the city of morality, and which are guarded by virtue like the conch-tufted Brahmā. The Brahmā who goes away and sees the West as adamantine is Sanskrit for Vajra, and this is Jingang for Jingang.",
        "source": "X59n1096_001:0535c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀外現威儀內起邪命法第八",
        "translation": "Admonitions for Observing Externally Appearing Regulations and Internally Arising False Lives 8th",
        "source": "X59n1096_001:0536a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八釋邪命篇僧尼二部既破於五篇名利兩途容招於邪命故立此位以次前篇謂人前整肅顯處莊嚴曰外現威儀實非為道妄計活命名內起邪命。",
        "translation": "The eight explanations of wrong livelihood are explained in the section on the two groups of saṃgha and nuns, which have already been refuted in the five books, and the two paths of fame and profit are allowed to lead to wrong livelihood. Therefore, this position is established in order to follow the previous section, which says that people who are neat and respectful in front of others and adorn themselves in their appearance are really not living for the path in a false designation of wrong livelihood that arises within.",
        "source": "X59n1096_001:0536a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邪命者。",
        "translation": "\"Wrong livelihood.",
        "source": "X59n1096_001:0536a13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "邪命者邪以簡正命即身命常途所論即四邪五邪邀利活命今下文別出其相也。",
        "translation": "Wrong livelihood is wrong in the sense that it's simply right livelihood, which is body life, and the eternal path that's discussed, which is the four wrongs and five wrongs that invite living life for profit. Now, what follows is to distinguish their characteristics.",
        "source": "X59n1096_001:0536a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂淨治住處嚴飾道場羅列旛華及諸道具數為洗剃常帶袈裟覆膞靴履威儀齊整緩行直進下聲軟語或復靜默閉目低頭衣鉢隨身執着律相然其內心常求名利望他請喚恭敬尊重。",
        "translation": "He purifies his dwelling place, adorns the site of enlightenment, arranges banners, flowers, and other necessities, and cleanses and shaves his head, always wearing a monk's robe, covering his feet and boots, and conducts himself neatly, walks slowly and straight ahead, speaks softly and quietly, closes his eyes and bows his head, carries his bowl, and memorizes the precepts, yet his inner mind always seeks fame and profit, expects others to call on him, respects, and venerates him.",
        "source": "X59n1096_001:0536a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "住處即召己房舍也道場始則菩提場即是佛成正覺處今目安置尊像之處以為道場故事鈔曰止得嚴淨道場稱歎虔仰數為下至執著律相來明詐現外飾也靴西域記曰凾嚩履此曰靴本胡服趙武靈王好之遂依而作履劉熈曰履禮也飾足所以為禮也然其下正示邪心。",
        "translation": "The abode is the monastery where he calls himself, and the site of enlightenment is the site of the Buddha's attainment of perfect enlightenment. The memoir says that the place where he stops and attains an ornately clean site of enlightenment is praised, revered, and counted down to the point where he adheres to the precepts and comes to understand the fraudulent appearance of external adornment.",
        "source": "X59n1096_001:0536a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "進戒度人強為師首處在徒眾希他依止設解經律問時生難性多嫌恨惡眼視人少見侵觸不受其懺口若發言喜說機刺嫉他得利如火燒心情塵意垢曾未除遣雖坐繩牀起惡覺觀攀緣亂想念世欲事令夜惡夢漏失不淨惡覺染意熏本識藏結惡業種染能障淨生死不絕輪迴無際受諸苦惱。",
        "translation": "When he enters the precepts and liberates people, he is the head teacher, a disciple who wants others to rely on him, and when he asks questions about the sutras and vinaya, he becomes difficult, resents the hostile nature of it, looks askance at people, sees little, and doesn't accept his confessions, speaks openly, likes to talk, criticizes others, and gets benefits like fire, and feels the defilement of the dust and thoughts that have never been removed.",
        "source": "X59n1096_001:0536b02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "師首者在三之數(即君父師)依止者大師曰新受戒者創入佛法萬事無知動便違教若不假師示導進誘心神法身慧命將何所託故律制未滿五歲及滿五夏愚癡者令依止有德使咨承法訓匠成己益今不思己德輙希彼人依我止住欲求利養以自活身誠可醜也生難(平去二聲俱通)謂或作艱難或作留難也且知識具解為開人心今若法慳後招愚闇少見下謂弟子少有犯師而即不受懺也四分曰若弟子被師呵責令餘比丘為將順故於和尚闍梨所調和令早受懺應知折伏柔和知時而受不受者如法治(僧反治師不知時過)機刺機字誤合作譏謂好作譏誹諷刺之言也惡覺觀即不善尋伺也。",
        "translation": "The head teacher is one of the three (i.e., the ruler, father, and teacher) who takes refuge in the great teacher, who says that a newly ordained person who initiates the Buddhist teaching is ignorant of everything and is moved to disobey the teaching.",
        "source": "X59n1096_001:0536b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三業不淨乖八聖道外白裏黑順八邪徑是名邪命欺誑凡聖如是觀察得名淨心。",
        "translation": "To be impure in three activities and to deviate from the eight noble paths that are white on the outside and black on the inside, following eight wrong paths is called wrong livelihood that deceives worldlings and sages. Thus observing them obtains the name pure mind.",
        "source": "X59n1096_001:0536b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "乖八聖道者以語業等不正故名乖外白者詐飾威儀也裏黑者內無梵行八邪徑者反八正道也。",
        "translation": "Those who deviate from the eight noble paths are called deviating because their speech and actions aren't correct. Outside is white, which is fraudulent decorating of manner; inside is black, which is the absence of the religious practice; and inside is the eight wrong paths, which are the opposite of the eightfold right path.",
        "source": "X59n1096_001:0536b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0536b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　口誦無常經　　身作有常計　　求望他利養　合眼未觀諦　　三衣唯欲好　　不肯著破弊　內心至麤橫　　外相真似細　　欺誑世間人　大悲為流涕　　賢聖不讚歎　　善神不扶衛　業障日夜增　　戒定念念滯　　雖有兩箇眼　復患一雙[目*壹]無常經者以經說無常之義為破有情常想今雖口誦而心不除其猶抱病但誦藥方耳合眼下低頭瞑目似禪定人於彼真諦殊未觀了麤獷應作橫犬不可附也或作穬殺芒也非此字體涕流也[目*壹]亦作翳目之病也今喻煩惱無明也。",
        "translation": "\"Although he orally recites the sutra on impermanence, his body contemplates permanence, seeks to bring benefit to others, closes his eyes without observing the truth, and while he only desires the good in his three garments, he's unwilling to attach himself to the negatives. Inside his mind is so coarse and rough that his external appearance truly seems subtle, deceiving worldlings, his great compassion is tears, good sages don't praise him, good spirits don't defend him, and the hindrances of karma increase day and night, and although he has two eyes, he suffers from a double [eye*one].",
        "source": "X59n1096_001:0536c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀取相恃善誑佛法第九",
        "translation": "The ninth admonition against contemplating the acquisition of characteristics and relying on goodness to defeat the Buddha's teaching",
        "source": "X59n1096_001:0536c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "九釋誑佛篇邪心規利既自謂於勝他執相恃強乃妄誣於上聖故立此位以次前篇謂著我我所以修稱己有道故曰取相恃善虧平等法未了三空不恊聖心故名誑佛又佛尚起誑豈況餘者。",
        "translation": "In the ninth chapter of the explanation of the deceitful buddha, the wrong mind regulates profit because it claims to be superior to others, clings to characteristics, and is deficient in the noble mind.",
        "source": "X59n1096_001:0536c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "經曰何者比丘名為誑佛。",
        "translation": "The sūtra says, \"What kind of monk is called a deceiver of the Buddha?",
        "source": "X59n1096_001:0536c17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "苦言我修慈悲彼人瞋恚我能布施某甲慳貪我具淨戒彼人犯戒我勤精進彼人懈怠我有智慧彼人太愚我今樂靜彼染憒閙我修威儀彼人輕躁我如法住彼不如法或恃隱山絕粒納衣一食常坐不臥塚間樹下或講經律善解法相我有如是福德智慧取此相者即名我見眾生見壽者見堅執是相名為誑佛。",
        "translation": "He says, \"Suffering, I cultivate compassion, while others are angry; I'm able to give generously; someone is stingy and greedy; I'm full of pure precepts, while others violate them; I'm diligent and energetic, while others are lazy; I have wisdom, while others are too foolish; I enjoy quietness now, while others are defiled and agitated; I cultivate decorum, while others are restless; I abide according to the Dharma, while others don't conform to the Dharma; I may rely on seclusion on a mountain, cutting off grain, putting on a coat and feeding myself; I always sit and don't lay down under a tree in a tomb; I may preach sūtras and vinaya; I well understand the characteristics of the Dharma; and when I have such merit and wisdom and grasp this characteristic, it's called self-view.",
        "source": "X59n1096_001:0536c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "即名我見下謂於名色陰入等法中妄計有我我所之實故名我見妄計有我生故名眾生見妄計有我受一期果報長短之壽名壽者見此則十六見之三也由此顛倒見故起一切煩惱生死行業能講經律解法相故名誑佛也以不依教起行調伏自心誣罔聖心真行誑佛謂是正道非誑是何。",
        "translation": "This is called the view of self, which means that in such things as name-and-form, aggregates-and-entries, and so forth, the false notion that there's a self and what's real is called the view of self. The false notion that there's a self that arises is called the view of sentient beings, and the false notion that there's a self that produces the results of one life that's long and short is called the view of a life-span. This is the third of the 16 views, and it's because of this mistaken view that all the afflictions of birth-and-death arise in the profession that's able to preach scriptures and precepts and understand the characteristics of the Dharma that it's called a deceiver.",
        "source": "X59n1096_001:0537a01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "何者修道名不誑佛。",
        "translation": "What's the cultivation of holiness that's called not deceiving the Buddha?",
        "source": "X59n1096_001:0537a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "若人修空無相無願三解脫門亦不生著唯觀世諦虗妄顛倒如幻如夢無有一實成此觀門修戒定慧精進不恃己能輕佗無德柔和質直謙下無諍以此善根迴向無上菩提如是離相修者名不誑佛。",
        "translation": "If a person cultivates the three gates of liberation of emptiness, signlessness, and wishlessness, and doesn't become attached to them but only observes the world truth as false, mistaken, illusory, and dreamlike, with no single reality, he cultivates the gate of observing morality, meditation, wisdom, and diligence, doesn't rely on his own abilities, despises wanderers, has no virtue, is gentle, straightforward, humble, and non-debatable, and thus has the good roots to dedicate himself to unsurpassed bodhi. Such a practitioner who is free of characteristics is called a non-deceiver.",
        "source": "X59n1096_001:0537a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "空無相等者依如毗曇分十六相以為三門空無我名空門滅下四行為無相門餘名無願門若依成實觀法性空名為空門於此空中無相可取名無相門於此空中無貪求願樂之心名無願門若依智論觀諸法無我我所故名空觀男女一異等相皆不可得名無相知一切法無相都無所作又一切相皆不可得則於三界無所願求名無願此三通名解脫門者解脫即是涅槃言門者取能通為義謂此三法能通行者入涅槃城故智論曰涅槃城有三門謂空無相無願此三是能治法唯觀下是所治病如幻者譬如幻師幻作象馬及種種物體雖無實然幻色可見幻聲可聞與情相對而不錯亂無智不了謂之為實諸法亦如是皆是無明幻作雖空而可見聞不相錯亂迷心不了妄執為實修空觀者若知諸法同如幻相則心無所得豁然開解悟一切法皆悉空寂故說如幻如夢者夢中無實事謂之有實覺已知虗妄世諦亦爾如是下雖終日持戒習定而實無所得以無得故名離相也。",
        "translation": "If we rely on the wisdom treatise to observe the emptiness of the nature of things, the name is emptiness; the four practices below cessation are the approach of formlessness; the remaining is the approach of wishlessness. If we rely on the wisdom treatise to observe the emptiness of things as self and self and therefore the name is emptiness; the marks of unity and difference between men and women are unknowable; the name is markless; knowing that all things are markless and without marks, and that all marks are unknowable, then there's nothing to wish for in the three realms; the name is wishless; these three passages are called the gates of liberation.",
        "source": "X59n1096_001:0537a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不誑佛故得平等法法眼明朗能淨智障不著空有名為淨心。",
        "translation": "Because he doesn't deceive the Buddha, he attains the equal Dharma eye, which is clear and purifies cognitive hindrances, doesn't attach to emptiness, and is called a pure mind.",
        "source": "X59n1096_001:0537b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法眼者天台淨名疏曰法眼見色心麤細因緣假名俗諦諸法也智障者著於空有是智家之障也今不著故除障而心淨也。",
        "translation": "The Dharma eye, according to Tiantai's Commentary on the Pure Names, is the Dharma eye that sees the coarse and fine causes and conditions of form and mind, nominal and conventional truths, and the intellectual hindrances of those who are attached to emptiness and existence, which are the hindrances of the intellect. Now, because they aren't attached, the hindrances are removed and the mind is purified.",
        "source": "X59n1096_001:0537b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0537b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　八萬四千法　　對治多種病　　是名大方便　成就善巧行　　執相名誑佛　　著我起見諍　比丘自沈溺　　不能到究竟　　故修三脫門　法空資慧命　　深觀緣集故　　證智更歡慶八萬俱舍曰如來說法蘊數有八十千真諦配曰佛始從成道終至涅槃時經三百五十度說法一一皆具六波羅蜜成二千一百一一皆破四大六塵成二萬一千又配三毒等分成八萬四千故偈曰光耀至鶴林三百五十說六塵并四大二萬有一千貪瞋癡等分八萬四千說對下即上所破之病又對八萬四千塵勞也大方便者法華論曰方便者聲聞觀蘊處界猒苦離苦得解脫六度四攝二利即順大乘若根本若方便行皆歸入一乘故曰大方便也究竟涅槃岸也深觀下以能□□□□□四諦但是虗幻因緣合集而有則能趣證智下明證得涅槃常樂我淨之樂故曰歡慶矣。",
        "translation": "84,000 dharmas to treat various illnesses is called great skillful means accomplishing skillful actions attaching to characteristics and calling them fraudulent buddhas, attaching to self and creating view disputes, a monk's own sinking, unable to reach the ultimate, so he cultivates the gate of triple liberation, the emptiness of dharmas, the necessities of wisdom and life, deeply observing the collection of conditions, realizing wisdom, and rejoicing over 80,000 club teachings, which say that from the time the Buddha first became a buddha and finally reached nirvāṇa, there were 80,000 true truths that matched the 350 teachings, each one complete with the six perfections, which became 2,100, each one destroying the four elements and the six dusts, which became 21,000, and the three poisons and so forth, which were divided into 84,000.",
        "source": "X59n1096_001:0537b13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "誡觀慢天懼人屏處造過法第十",
        "translation": "Admonition to Contemplate the Arrogant God, Fear of Man, and the Ping Place, Tenth [Chapter]: Creating Faulty Practices",
        "source": "X59n1096_001:0537c05_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "十釋造過篇執相恃強既慠凡而誑聖覆瑕作咎遂怖顯以欺幽故立此篇以次前位謂天遠而不畏故起慢人近而可羞故起懼因懼則諸惡不敢顯為故曰屏處造過。",
        "translation": "Ten interpretations of the chapter on creating faults attaching to characteristics and relying on strength both to offend worldlings and to defile sages, making faults, and then fearing and revealing them to deceive the dark.",
        "source": "X59n1096_001:0537c06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫憍諂威儀不恒人前斂攝名為諂詐屏處造過名為憍逸。",
        "translation": "An ordinary person who flatters and behaves in a manner that's not constant and is collected in front of people is called flattering and deceitful, and creating a fault in a pent-up place is called being proud.",
        "source": "X59n1096_001:0537c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "不恒者對人乍攝居屏無拘是不恒相易曰不恒其德或成之羞詐偽也。",
        "translation": "When someone isn't constant, he's not constant in dealing with others and abiding in a screened-in place without restraint, which is called not constant in terms of their virtue or becoming ashamed and deceptive.",
        "source": "X59n1096_001:0537c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "所謂破諸戒儀私飲盜食赤露倮跣河池澡浴露地便利下氣出聲摩捫屏處仰眠伏地蹲踞支頰走驟顧眄吟詠歌嘯咯要而言人名憍諂三業四儀悉不如法人前似人屏處如鬼。",
        "translation": "It's called breaking the precepts by drinking and eating privately, stealing food, being naked, toms, bathing in a river pool, and bathing in the open air, facilitating the emission of bad breath, making noises, and facing the screen, sleeping on his back, crouching on the ground, crouching with his cheeks up, walking, glancing, chanting, singing, and whistling.",
        "source": "X59n1096_001:0537c14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "私飲不公曰私進口曰飲此通非時諸漿不加口法妄飲也盜食不從人受通名盜得戒疏不受戒中引多論為斷盜竊因緣是也倮合作裸(卵果切)說文曰袒也跣者足無履也河池澡浴者按釋教則有澡于雨儒宗乃□□□□然西土須畜雨浴衣故四分戒本曰春殘一月在應求雨浴衣(可披著雨中而浴狀似三衣也)半月應用浴(即春□□□□謂□□□□□)而露入河池且此方自別有堂以待澡浴□□□□露地便利以四分制三事當屏處所謂大小便爵楊枝也下氣下泄濁氣而故出其聲也母論曰氣有二種一者上氣出時莫當人張口令出要回面向無人處出二者下氣不聽眾中出要作方便出家無人處令出摩捫以手撫持曰捫仰眠等者僧祇仰臥修羅伏臥餓鬼左脇如貪欲人具如法者出三十五卷中蹲踞應法師曰蹲猶虗坐踞謂垂足實坐也支頰即支頥也亦作榰爾雅曰榰柱也走驟驟奔也顧眄說文曰迴觀曰顧邪視曰眄(莫奠反)以律制不得左右顧視故吟詠謌調章句也又十誦好作文頌莊嚴章句是可怖畏嘯說文曰吹聲也人前下顯處現相規利故如人屏處無慚造過故如鬼。",
        "translation": "私飲不公曰私進口曰飲此通非時諸漿不加口法妄飲也盜食不從人受通名盜得戒疏不受戒中引多論為斷盜竊因緣是也倮合作裸(卵果切)說文曰袒也跣者足無履也河池澡浴者按釋教則有澡于雨儒宗乃□□□□然西土須畜雨浴衣故四分戒本曰春殘一月在應求雨浴衣(可披著雨中而浴狀似三衣也)半月應用浴(即春□□□□謂□□□□□)而露入河池且此方自別有堂以待澡浴□□□□露地便利以四分制三事當屏處所謂大小便爵楊枝也下氣下泄濁氣而故出其聲也母論曰氣有二種一者上氣出時莫當人張口令出要回面向無人處出二者下氣不聽眾中出要作方便出家無人處令出摩捫以手撫持曰捫仰眠等者僧祇仰臥修羅伏臥餓鬼左脇如貪欲人具如法者出三十五卷中蹲踞應法師曰蹲猶虗坐踞謂垂足實坐也支頰即支頥也亦作榰爾雅曰榰柱也走驟驟奔也顧眄說文曰迴觀曰顧邪視曰眄(莫奠反)以律制不得左右顧視故吟詠謌調章句也又十誦好作文頌莊嚴章句是可怖畏嘯說文曰吹聲也人前下顯處現相規利故如人屏處無慚造過故如鬼。",
        "source": "X59n1096_001:0537c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一切天神證知此過身壞命終生獼猴中及鬼魅中為犯戒儀果報對至不欺闇室即其義也何以故大業之樹光明如鏡眾生造業於彼悉現神天有二一字同生二字同名小不見天天常見人業力持罪不在晝夜行者謹慎屏露無差。",
        "translation": "All the gods and goddesses realize that this fault destroys the body and is born among monkeys and ghosts at the end of life as the result of violating the precepts and the consequences of not deceiving a dark room, which is its meaning.",
        "source": "X59n1096_001:0538a14_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "獼猴應法師曰梵云摩斯吒此云猴猱(努刀切)也鬼魅許慎曰老物精也爾雅曰鬼之為言歸也尸子曰古者謂死人為歸人佛教釋鬼者畏也又威也自多怖畏復令人畏通俗文云山澤恠在獸犯戒儀上三篇曰戒下四號威儀通而言之戒即威儀□□□□□佛凡制一戒皆訶曰云何最初犯戒又曰汝寧死不犯威儀等果報對至言報應之不差也以此緣故不可欺於闇室而造過也神下出華嚴經第六十卷故下偈中指經云是也一下二神之名字也天常見人者以不論晝夜常見故則所造罪業難可隱也不在下言不偏在晝不偏在夜蓋常見耳若然當須屏露兩處護之如一。",
        "translation": "獼猴應法師曰梵云摩斯吒此云猴猱(努刀切)也鬼魅許慎曰老物精也爾雅曰鬼之為言歸也尸子曰古者謂死人為歸人佛教釋鬼者畏也又威也自多怖畏復令人畏通俗文云山澤恠在獸犯戒儀上三篇曰戒下四號威儀通而言之戒即威儀□□□□□佛凡制一戒皆訶曰云何最初犯戒又曰汝寧死不犯威儀等果報對至言報應之不差也以此緣故不可欺於闇室而造過也神下出華嚴經第六十卷故下偈中指經云是也一下二神之名字也天常見人者以不論晝夜常見故則所造罪業難可隱也不在下言不偏在晝不偏在夜蓋常見耳若然當須屏露兩處護之如一。",
        "source": "X59n1096_001:0538a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大千世界在佛毛孔豈容屏過賢聖不知。",
        "translation": "How can a great chiliocosm be screened from the pores of a buddha when it's not known by the noble ones?",
        "source": "X59n1096_001:0538b07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "大千者俱舍曰四大洲蘇迷盧欲天梵世各一千此名小千界此小千千倍說名為中千此千倍大千皆同一成壞雜含曰至千日千月乃至千梵天名小千界以小千為一一數至千名中千以中千為一一數至千名大千合千名第二大千亦至百億梵天名三千大千世界在佛毛孔者以佛身無量充遍法界雖大千之廣塵剎之多在一毫中而非是迫故知佛身一毛端徧一切而含一切也凡聖□□□□□□故華嚴偈曰十方虗空可知量佛毛孔量不可得乃至汝應觀佛一毛孔一切眾生悉在中今既為大千世界類則為善作惡悉在佛毛孔矣且眾生造一小善尚恃乎佛知作一大惡何誑於聖昧法華曰我常知眾生行道不行道則知善惡無不察矣。",
        "translation": "The great trichiliocosm is said by the Śuddhâvāsa to be one thousand each of the four continents, Sumeru, the desire heavens, and the Brahma world, which are called the lesser trichiliocosm, the lesser trichiliocosm is said to be a thousand suns, a thousand moons, and even a thousand Brahmā heavens, which are called the lesser trichiliocosm, the lesser trichiliocosm is said to be one number to a thousand, the middle trichiliocosm is said to be one number to a thousand, the middle trichiliocosm is said to be a thousand, the greater trichiliocosm is said to be the second greatest trichiliocosm, and the ten billion Brahmā heavens are said to be the three thousand great trichiliocosms.",
        "source": "X59n1096_001:0538b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "是故菩薩有八萬威儀聲聞戒有三千威儀汝應修集威儀庠序屏露二處一等用心乃至失命不虧仁範如是持行名為淨心。",
        "translation": "Therefore, the bodhisattva has 80,000 comportments, and the śrāvaka precepts have 3,000 comportments. You should cultivate the collection of comportments, zealous, unobtrusive, and first-class attentiveness in two places, even if you lose your life and don't lose your benevolent example. Such maintenance of practice is called a pure mind.",
        "source": "X59n1096_001:0538b22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "八萬三千者斯亦略舉智論六十三曰略說則八萬四千廣則無量無邊故出家之人有無邊律儀豈止乎八萬三千也又菩薩多而聲聞少者以菩薩通護心戒聲聞止在七支故見不等威儀左傳曰有威而可畏之謂威有儀而可像之謂儀摩得伽曰云何威儀一切沙門所生功德為威儀也庠序者夏曰校商曰庠周曰序乃禮官之所今取法軌則之貌乃至下謂命難不可犯如鵝珠草繫海板之儔是也仁範儒中以推愛及物為之仁本也鵝珠護生損己不曰推愛及物乎在彼名仁在釋則名戒故仁範矣。",
        "translation": "The 80,000 and 3,000 is also briefly cited in Zhilun LXIII, which says that if it's briefly cited, then there are 84,000 and if it's broad, then it's measureless and limitless.",
        "source": "X59n1096_001:0538c01_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "偈曰。",
        "translation": "The verse says.",
        "source": "X59n1096_001:0538c12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　賢聖出三界　　常遊三界境　　觀諸眾生業　如形對日影　　智者慎威儀　　持戒心勇猛　屏處無闕失　　四念堅固秉賢聖下以煩惱斷雖出三界而菩薩慈悲不捨故遊三界如形下形端則影直如善業也形曲影斜似惡業也是知善惡之業形影不差聖人觀之纖毫不隱四念者一身念處頭等六分四大五根假合故名為身是中觀身智慧為念明內身五種不淨破淨顛倒即是處也觀外身內外身亦如是是為身念處二受念處者六觸因緣生六受從六受生三受名之為受是中觀受智慧為念明達三受皆苦破樂顛倒即是處也觀外受內外受亦如是是為受念處也三心念處者六識能識諸塵分別攀緣謂之為心是中觀內心智慧為念了知心從緣生剎那不住念念生滅破常顛倒即是處也觀外心內外心亦如是是為心念處四法念處者想行二陰及三無為法名之為法是中觀法智慧為念通達一切法我我所畢竟不可得故無我破我顛倒即是處也觀外法內外法亦如是是為法念處聲聞正用此破四倒也菩薩破八倒。",
        "translation": "\"Good sages who emerge from the three realms always travel to the realm of the three realms observing the actions of sentient beings like form against the shadow of the sun. The wise man is careful with his manners, upholds precepts, and is courageous in mind, has an unblemished state of mind, and has four firm states of mindfulness.",
        "source": "X59n1096_001:0538c13_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　觀身如毒蛇　　察心如冤家　　身心是大患　覆罪如河沙　　智者犯已悔　　終不蓋疵瘕　藏過嬰惡名　　地獄受鐵叉毒蛇四大喻四蛇也冤家者以心能地獄牽生惡道故名為冤家也大患以身心為禍患之本也蓋疵瘕者喻犯戒也說文曰疵病也瘕(音加)亦病也亦作瑕字應法師曰瑕過也嬰纏也。",
        "translation": "He observes the body as a viper, examines the mind as an enemy, and the body and mind are great afflictions that cover sins like the sands of the river. The wise repent after violating them and never cover up a blemish or impurity, or hide a fault, infest, or bad reputation.",
        "source": "X59n1096_001:0539a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　苦哉末法時　　比丘比丘尼　　剃髮雖改服　猶守貪瞋癡　　假名優婆塞　　諭諂優婆夷　名中喚五戒　　實未具一支諭諂諭字誤合作諛(與朱反)周書曰面從曰諛不擇是非而言謂之諛左傳曰左右諛諂希其意道其言謂之諂優婆夷對女也上優婆塞對男也成論亦名優婆娑秦言善宿是人心善離破戒宿故所持八戒也(已上論文)中含曰多聞聖弟子持八支齋斯義同也今言五戒義亦通受但八戒限一宿五戒通盡形據四分或受一二等或年月長短皆開不同薩婆多部接俗揩定於時數也一支即一戒又支即是分如五戒具持名滿分等。",
        "translation": "Although they shave their hair and change their clothes, they still guard their craving and delusion under the guise of being an upāsaka.",
        "source": "X59n1096_001:0539a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　口常誦藥方　　心病不肯治　　惡業覆障故　邪命求餘資　　身見執著我　　不覺即分離　亦不觀五陰　　氣息若懸絲　　人前粗斂攝　屏處踰須彌　　唯懼人怪笑　　不畏天證知　欲醉狂情發　　行坐染心思　　纏綿破重戒　命終墮阿鼻　　地獄經一劫　　劫盡更復移　此苦難堪忍　　屏處最慎之　　為造狂業故　諸佛發大悲　　犯欲須臾樂　　受苦無量時藥方喻三乘十二分教餘資即內外兩資不越衣也屏處踰須彌者言屏造惡之大也踰過越也欲醉者為欲所醉也。",
        "translation": "He always recites the prescription for medicine, refuses to treat mental illness, and because of the hindrances of bad karma, pursues other assets in his wrong livelihood, sees and clings to self, doesn't perceive and immediately separate from them, doesn't examine the five aggregates, and has breath that's like a thread hanging from his shoulder. He only fears the strange laughter of people and doesn't fear the knowledge of gods.",
        "source": "X59n1096_001:0539b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　經曰人從生　　即有二種天　　晝夜與身俱　共人同受年　　一念為善惡　　了了皆現前　惡多天減筭　　善強命長延經即華嚴人從□□□□□從生下即有同生同名二神天也。",
        "translation": "The sūtras say that when a person is born, there are two kinds of gods, one in which day and night accompany the body, and the other in which people share years of experience, and one in which thoughts of good and evil are fully manifested, and the other in which there's much evil and gods are reduced in number.",
        "source": "X59n1096_001:0539b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "　毗盧遮那佛　　身界廣無邊　　於一毛孔中　容受三大千　　性照圓明徹　　含生上福田　以眾屏多過　　無緣起慈憐毗盧遮那亦云盧遮那此俱梵音廣略左右之異故晉譯華嚴經毗盧遮那此云光明徧照身智二光照法界故盧舍那此云淨滿二障麤細無不盡故前約德顯此約離障義雖兩別法歸一同其猶鏡也垢盡明現欲何二焉皆事理圓融權實無二於一下即楞嚴曰身心圓明不動道場於一毛端徧能含受十方國土長水云身圓明則毛端現土心圓明則徧照法界此乃悟物咸真即成妙用今之言身界廣無邊即經身圓明也又曰性照圓明徹即心圓明也含生下眾生以佛為無上福田佛豈不下化眾生故見其過以無緣慈而憐愍也問何名無緣慈答小遠涅槃疏曰不住法相及眾生相名無緣慈問不住法相如何行慈答有□□□□眾生妄有法之所纏深可哀傷所以生慈二人□□□□□□則與樂故名為慈矣。",
        "translation": "The body realm of Vairocana Buddha is vast and limitless, and in a single pore it contains three great thousands, its nature shines perfectly clear and thorough, and it contains birth in the field of merit. Vairocana is also called Luciana, which is the difference between the Sanskrit sound broad and abbreviated, left and right, and the Jin Translation of the Huayan Sutra.",
        "source": "X59n1096_001:0539b20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨心誡觀發真鈔卷上末",
        "translation": "Jingxin jingguan faizhen chao shoulu",
        "source": "X59n1096_001:0539c15_0",
        "is_bad_quality": false
    }
]