[
    {
        "source_sentence": "西方合論卷之三",
        "translation": "Compilation of Treatises on the Western Land, Volume 3",
        "source": "X61n1165_003:0793a04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "第三部類門",
        "translation": "third group of Buddhist disciples",
        "source": "X61n1165_003:0793a06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "夫如來說教廣有多門經中或偶一拈題或因緣舉出者不可勝載唯念佛一門頻形讚歎如高巒之峙平原躍空而出類金星之晃沙磧映日即明故知法門殊勝未有逾此一門者也今約諸經但言西方大事者一槩收入分經緯二義說文曰織有經集絲為之經常而緯變是故以經則非專談安養者不收以緯則凡泛舉念佛者亦入登葱山而樵玉首採羊脂泛溟海而斮香忍捨牛頭孔子曰爾所不知人其舍諸至於聞所未聞不無望於來哲。",
        "translation": "The Tathāgata teaches that there are many aspects to the teaching, and there are countless sūtras that are occasionally titled or cited for reasons, except for the one aspect of mindfulness of the Buddha that is frequently praised like a high mountain range, a plain that leaps into the sky, or a Venus that shimmers in the sand and tills that reflect the sun.",
        "source": "X61n1165_003:0793a07_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一經中之經二經中之緯三緯中之經",
        "translation": "One is the scripture of scriptures, two is the latitude of scriptures, and three is the scripture of latitudes.",
        "source": "X61n1165_003:0793a16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四緯中之緯",
        "translation": "latitude in the four latitudes",
        "source": "X61n1165_003:0793a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一經中之經者一無量平等清淨覺經二無量壽經三阿彌陀經四無量壽莊嚴經五出寶積第十八經名無量壽如來會五經同一梵本前四譯稍不精六即大阿彌陀經龍舒居士將前四譯和會者佛在王舍國靈鷲山為阿難慈氏等說中間出寶積者旨富詞法不知龍舒何以不見此本一佛說阿彌陀經二稱讚淨土佛攝受經二經同一梵本初經簡淨愈於後譯佛在舍衛國祇樹給孤獨園為舍利弗說讀誦者多主此經一觀無量壽經佛在王舍城耆闍崛山中為韋提希夫人說經中言十六妙觀修持法門備載此經故孤山判為定善然三種經皆專為西方起教如天中之天人中之王不必自相排抑譬一大虗空一尚不得豈有二哉經中妙義具見餘門今不贅述。",
        "translation": "The first sūtra within a sūtra is the Sutra of Immeasurable Pure Enlightenment, the Second Sutra of Immeasurable Life, the Third Sutra of Amitâbha, the Fourth Sutra of Immeasurable Life, the Fifth Sutra of Exiting Jewels, the Eighteenth Sutra, the Sutra of Immeasurable Life, the Tathāgata Assembly, and the Five Sutras, all of which are in the same Sanskrit edition, the first four translations of which are slightly incomplete, and the sixth, the Great Amitâbha Sutra, which was translated into Chinese by Jushi Longshu and assembled by the Buddha on Mount Vulture in Rājagṛha in Rājagṛha for Ānanda Tzu and the others.",
        "source": "X61n1165_003:0793a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二經中之緯者一鼓音聲王經佛在瞻波大城伽伽靈池與比丘百人說中云若有四眾受持阿彌陀佛名臨命終時佛與聖眾接引往生一後出阿彌陀佛偈經自惟念法比丘乃從世饒王至弘此無量誓世世稽首行共五十六句始終惟偈二經亦專言淨土言義較前甚略判入緯髏又鼓音意重持呪偈經是伽陀部非教本故。",
        "translation": "Of the two scriptures, the first is the Dhāraṇī Sutra of the King of Sound of the Drum, which the Buddha explained to a hundred monks at Gagga's Spiritual Pond in the great city of Campā, saying that if there are four groups of people who accept and bear the name of Amitâbha when their lives come to an end, the Buddha and the holy people will guide them to rebirth.",
        "source": "X61n1165_003:0793b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三緯中之經者一華嚴經普賢菩薩勸進善財童子海會大眾發大十願至臨命終時一切諸根悉皆散壞一切威勢悉皆退失惟此願王不相捨離於一切時引導其前一剎那間即得往生極樂世界其人自見生蓮花中蒙佛授記得授記已經無數劫普於十方不可說不可說世界以智慧力隨眾生心而為利益乃至能於煩惱大苦海中㧞濟眾生令其出離皆得生於極樂世界又解脫長者云我若欲見安樂世界無量壽如來隨意即見如是十方一切世界所有如來我若欲見隨意即見(以下正明欲見即見之故)我能了知如來國土莊嚴神通等事無所從來亦無所去無有行處亦無住處亦如己身無來無去無行住處一法華經云聞是經典如說修行於此命終即往安樂世界阿彌陀佛大菩薩眾圍繞住處生蓮華中寶座之上得菩薩神通無生法忍得是忍已眼根清淨以是清淨眼根見七百萬二千億那由他恒河沙等諸佛如來一楞嚴經大勢至白佛我憶往昔恒河沙劫有佛出世名無量光十二如來相繼一劫其最後佛名超日月光彼佛教我念佛三昧譬如有人一專為憶一人專忘如是二人若逢不逢或見非見二人相憶二憶念深如是乃至從生至生同於形影不相乖異十方如來憐念眾生如母憶子若子逃逝雖憶何為子若憶母如母憶時母子歷生不相違遠若眾生心憶佛念佛現前常來必定見佛去佛不遠不假方便自得心開如染香人身有香氣此則名曰香光莊嚴我本因地以念佛心入無生忍今於此界攝念佛人歸於淨土一寶積經佛告父王一切眾生皆即是佛汝今當念西方世界阿彌陀佛常勤精進當得佛道王言一切眾生云何是佛佛言一切決無生無動搖無取捨無相貌無自性可於此佛法中安住其心勿信於他爾時父王與七萬釋種聞說是法信解歡喜悟無生忍佛現微笑而說偈曰釋種決定智是故於佛法決信心安住人中命終已得生安樂國面奉阿彌陀無畏成菩提又佛告彌勒發十種心往生極樂何者為十一者於諸眾生起於大慈無損害心二者於諸眾生起於大悲無逼惱心三者於佛正法不惜身命樂守護心四者於一切法發生勝忍(發生最勝忍心)無執著心五者不貪利養恭敬尊重淨意樂心六者求佛種智於一切時無忘失心七者於諸眾生尊重恭敬無下劣心八者不著世論於菩提分生決定心九者種諸善根無有雜染清淨之心十者於諸如來捨離諸相起隨念心是名菩薩發十種心由是心故當得往生若人於此十念隨成一心樂欲往生彼佛世界若不得生無有是處一般舟三昧經佛告跋陀惒菩薩若沙門白衣所聞西方阿彌陀佛剎常念彼方佛不得缺戒一心念若一日晝夜若七日七夜過七日已後見阿彌陀佛於覺不見於夢中見之譬如夢中所見不知晝不知夜亦不知內亦不知外不用(猶因也)在冥中故不見不用有所蔽礙故不見(此亦佛說)如是跋陀惒菩薩(指上沙門白衣)心當作是念時諸佛國境界名大山須彌山其有幽冥之處悉為開闢目亦不蔽心亦不礙是菩薩摩訶薩(亦指沙門白衣)不持天眼徹視不持天耳徹聽不持神足到於佛剎不於是間終生彼間佛剎乃見便於是間坐見阿彌陀佛聞所說經悉受得從三昧中悉能具足為人說之一觀佛三昧經文殊自敘宿因謂得念佛三昧當生淨土世尊復記之曰汝當往生極樂世界一大集經賢護品云求無上菩提者應修念佛禪三昧偈云若人稱念彌陀佛號曰無上深妙禪至心想像見佛時即是不生不滅法一十住斷結經云時座中有四億眾自知死此生彼牽連不斷欲為之源樂生無欲國土佛言西方去此無數國土有佛名無量壽其土清淨無淫怒癡蓮花化生不由父母汝當生彼一如來不思議境界經云菩薩了知諸佛及一切法皆惟心量得隨順忍或入初地捨身速生妙喜世界或生極樂淨土中一隨願往生經言佛國無量專求極樂者何一以因勝十念為因故一以緣勝四十八願普度眾生故一稱揚諸佛功德經云若有得聞無量壽如來名者一心信樂其人命終阿彌陀佛與諸比丘住其人前魔不能壞彼正覺心又云持諷誦念此人當得無量之福永離三途命終之後往生彼剎一大雲經云善男子於此西方有一世界名曰安樂其土有佛號無量壽於今現在常為眾生講宣正法告一菩薩汝善男子娑婆世界釋迦牟尼佛為諸薄福鈍根眾生說大雲經汝可往彼至心聽受是彼菩薩欲來至此故先現瑞善男子汝觀彼土諸菩薩身滿足五萬六千由旬世尊彼來菩薩名號何等何緣而來此土將非為度眾生故來唯願如來為諸眾生分別解說善男子彼土菩薩欲聞淨光受記別事并欲供養如是三昧是故而來善男子是菩薩名無邊光通達方便善能教導一入楞伽經云大慧汝當知善逝滅度後南天竺國中大名德比丘厥號為龍樹能破有無宗世間中顯我無上大乘法得初歡喜地往生安樂國一大悲經云我滅度後北天竺國有比丘名祈婆伽修習無量最勝善根已而命終生於西方過百千億世界無量壽佛國以後成佛號無垢光如來。",
        "translation": "三緯中之經者一華嚴經普賢菩薩勸進善財童子海會大眾發大十願至臨命終時一切諸根悉皆散壞一切威勢悉皆退失惟此願王不相捨離於一切時引導其前一剎那間即得往生極樂世界其人自見生蓮花中蒙佛授記得授記已經無數劫普於十方不可說不可說世界以智慧力隨眾生心而為利益乃至能於煩惱大苦海中㧞濟眾生令其出離皆得生於極樂世界又解脫長者云我若欲見安樂世界無量壽如來隨意即見如是十方一切世界所有如來我若欲見隨意即見(以下正明欲見即見之故)我能了知如來國土莊嚴神通等事無所從來亦無所去無有行處亦無住處亦如己身無來無去無行住處一法華經云聞是經典如說修行於此命終即往安樂世界阿彌陀佛大菩薩眾圍繞住處生蓮華中寶座之上得菩薩神通無生法忍得是忍已眼根清淨以是清淨眼根見七百萬二千億那由他恒河沙等諸佛如來一楞嚴經大勢至白佛我憶往昔恒河沙劫有佛出世名無量光十二如來相繼一劫其最後佛名超日月光彼佛教我念佛三昧譬如有人一專為憶一人專忘如是二人若逢不逢或見非見二人相憶二憶念深如是乃至從生至生同於形影不相乖異十方如來憐念眾生如母憶子若子逃逝雖憶何為子若憶母如母憶時母子歷生不相違遠若眾生心憶佛念佛現前常來必定見佛去佛不遠不假方便自得心開如染香人身有香氣此則名曰香光莊嚴我本因地以念佛心入無生忍今於此界攝念佛人歸於淨土一寶積經佛告父王一切眾生皆即是佛汝今當念西方世界阿彌陀佛常勤精進當得佛道王言一切眾生云何是佛佛言一切決無生無動搖無取捨無相貌無自性可於此佛法中安住其心勿信於他爾時父王與七萬釋種聞說是法信解歡喜悟無生忍佛現微笑而說偈曰釋種決定智是故於佛法決信心安住人中命終已得生安樂國面奉阿彌陀無畏成菩提又佛告彌勒發十種心往生極樂何者為十一者於諸眾生起於大慈無損害心二者於諸眾生起於大悲無逼惱心三者於佛正法不惜身命樂守護心四者於一切法發生勝忍(發生最勝忍心)無執著心五者不貪利養恭敬尊重淨意樂心六者求佛種智於一切時無忘失心七者於諸眾生尊重恭敬無下劣心八者不著世論於菩提分生決定心九者種諸善根無有雜染清淨之心十者於諸如來捨離諸相起隨念心是名菩薩發十種心由是心故當得往生若人於此十念隨成一心樂欲往生彼佛世界若不得生無有是處一般舟三昧經佛告跋陀惒菩薩若沙門白衣所聞西方阿彌陀佛剎常念彼方佛不得缺戒一心念若一日晝夜若七日七夜過七日已後見阿彌陀佛於覺不見於夢中見之譬如夢中所見不知晝不知夜亦不知內亦不知外不用(猶因也)在冥中故不見不用有所蔽礙故不見(此亦佛說)如是跋陀惒菩薩(指上沙門白衣)心當作是念時諸佛國境界名大山須彌山其有幽冥之處悉為開闢目亦不蔽心亦不礙是菩薩摩訶薩(亦指沙門白衣)不持天眼徹視不持天耳徹聽不持神足到於佛剎不於是間終生彼間佛剎乃見便於是間坐見阿彌陀佛聞所說經悉受得從三昧中悉能具足為人說之一觀佛三昧經文殊自敘宿因謂得念佛三昧當生淨土世尊復記之曰汝當往生極樂世界一大集經賢護品云求無上菩提者應修念佛禪三昧偈云若人稱念彌陀佛號曰無上深妙禪至心想像見佛時即是不生不滅法一十住斷結經云時座中有四億眾自知死此生彼牽連不斷欲為之源樂生無欲國土佛言西方去此無數國土有佛名無量壽其土清淨無淫怒癡蓮花化生不由父母汝當生彼一如來不思議境界經云菩薩了知諸佛及一切法皆惟心量得隨順忍或入初地捨身速生妙喜世界或生極樂淨土中一隨願往生經言佛國無量專求極樂者何一以因勝十念為因故一以緣勝四十八願普度眾生故一稱揚諸佛功德經云若有得聞無量壽如來名者一心信樂其人命終阿彌陀佛與諸比丘住其人前魔不能壞彼正覺心又云持諷誦念此人當得無量之福永離三途命終之後往生彼剎一大雲經云善男子於此西方有一世界名曰安樂其土有佛號無量壽於今現在常為眾生講宣正法告一菩薩汝善男子娑婆世界釋迦牟尼佛為諸薄福鈍根眾生說大雲經汝可往彼至心聽受是彼菩薩欲來至此故先現瑞善男子汝觀彼土諸菩薩身滿足五萬六千由旬世尊彼來菩薩名號何等何緣而來此土將非為度眾生故來唯願如來為諸眾生分別解說善男子彼土菩薩欲聞淨光受記別事并欲供養如是三昧是故而來善男子是菩薩名無邊光通達方便善能教導一入楞伽經云大慧汝當知善逝滅度後南天竺國中大名德比丘厥號為龍樹能破有無宗世間中顯我無上大乘法得初歡喜地往生安樂國一大悲經云我滅度後北天竺國有比丘名祈婆伽修習無量最勝善根已而命終生於西方過百千億世界無量壽佛國以後成佛號無垢光如來。",
        "source": "X61n1165_003:0793b15_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "四緯中之緯者一如華嚴毗盧遮那品云爾時大威光童子見波羅蜜善根莊嚴王如來成等正覺現神通力即得念佛三昧名無邊海藏門又光明覺品云爾時光明過千世界乃至一切處文殊菩薩各於佛所同時發聲說此頌言一切威儀中常念佛功德晝夜無暫斷如是業應作又賢首品云見有臨終勸念佛又示尊像令瞻敬俾於佛所深歸仰是故得成此光明又十無盡藏品第八念藏云此念有十種所謂寂靜念清淨念不濁念明徹念離塵念離種種念離垢念光耀念可愛樂念無能障礙念又兜率偈讚品離垢幢菩薩云以佛為境界專念而不捨此人得見佛其數與心等又十回向品第十回向云以法施回向願得憶念與法界等無量無邊世界未來現在一切諸佛(此二十二字作一句讀)又十地品中從初至末地地皆云一切所作不離念佛又佛不思議法品云如來有十種佛事一者若有眾生專心憶念則得現前二者若有眾生心不調順則為說法等又入法界品云德雲比丘告善財言善男子我得自在決定解力信根清淨智光照耀普觀境界離一切障具清淨行往詣十方供養諸佛常念一切諸佛如來總持一切諸佛正法常見一切諸佛隨諸眾生種種心樂(下文所言正此義)示現種種成正覺門於大眾中而師子吼善男子我唯得此憶念一切諸佛境界智慧光明普見法門所謂智光普照念佛門常見一切諸佛國土種種宮殿悉嚴淨故令一切眾生念佛門隨諸眾生心之所樂皆令見佛得清淨故令安住力念佛門令入如來十方中故令安住法念佛門見無量佛聽聞法故照耀諸方念佛門悉見一切諸世界中等無差別諸佛海故人不可見處念佛門悉見一切微細境中諸佛自在神通事故住於諸劫念佛門一切劫中常見如來諸所施為無暫捨故住一切時念佛門於一切時常見如來親近同住不捨離故住一切剎念佛門一切國土咸見佛身超過一切無與等故住一切世念佛門隨於自心之所欲樂普見三世諸如來故住一切境念佛門普於一切諸境界中見諸如來次第現故住寂滅念佛門於一念中見一切剎一切諸佛示涅槃故住遠離念佛門於一念中見一切佛從其所住而出去故住廣大念佛門心常觀察一一佛身充偏一切諸法界故住微細念佛門於一毛端有不可說如來出現悉至其所而承事故住莊嚴念佛門於一念中見一切剎皆有諸佛成等正覺現神變故住能事念佛門見一切佛出現世間放智慧光轉法輪故住自在心念佛門知隨自心所有欲樂一切諸佛現其像故住自業念佛門知隨眾生所積集業現其影像令覺悟故住神變念佛門見佛所坐廣大蓮華周徧法界而開敷故住虗空念佛門觀察如來所有身雲莊嚴法界虗空界故一法華經云若有因緣獨入他家一心念佛乞食無侶一心念佛又云若人散亂心入于塔廟中一稱南無佛皆已成佛道一淨名經云寶積當知直心是菩薩淨土菩薩成佛時不謟眾生來生其國深心是菩薩淨土菩薩成佛時具足功德眾生來生其國大乘心是菩薩淨土菩薩成佛時大乘眾生來生其國布施是菩薩淨土菩薩成佛時一切能捨眾生來生其國持戒是菩薩淨土菩薩成佛時行十善道滿願眾生來生其國忍辱是菩薩淨土菩薩成佛時三十二相莊嚴眾生來生其國精進是菩薩淨土菩薩成佛時勤修一切功德眾生來生其國禪定是菩薩淨土菩薩成佛時攝心不亂眾生來生其國智慧是菩薩淨土菩薩成佛時正定眾生來生其國四無量心是菩薩淨土菩薩成佛時成就慈悲喜捨眾生來生其國四攝法是菩薩淨土菩薩成佛時解脫所攝眾生來生其國方便是菩薩淨土菩薩成佛時於一切法方便無礙眾生來生其國三十七品是菩薩淨土菩薩成佛時念處正勤神足根力覺道眾生來生其國回向心是菩薩淨土菩薩成佛時得一切具足功德國土說除八難是菩薩淨土菩薩成佛時國土無有三惡八難自守戒行不譏彼缺是菩薩淨土菩薩成佛時國土無有犯禁之名十善是菩薩淨土菩薩成佛時命不中夭大富梵行所言誠諦常以軟語眷屬不離善和諍訟言必饒益不嫉不恚正見眾生來生其國如是寶積菩薩隨其直心則能發行隨其發行則得深心隨其深心則意調伏隨意調伏則如說行隨如說行則能迴向隨其迴向則有方便隨其方便則成就眾生隨成就眾生則佛土淨隨佛土淨則說法淨隨說法淨則智慧淨隨智慧淨則其心淨隨其心淨則一切功德淨是故寶積若菩薩欲得淨土當淨其心隨其心淨則佛土淨又云菩薩成就八法於此世界行無瘡疣生於淨土何等為八饒益眾生而不望報代一切眾生受諸苦惱所作功德盡以施之等心眾生謙下無閡於諸菩薩視之如佛所未聞經聞之不疑不與聲聞而相違背不嫉彼供不高已利而於其中調伏其心常省己過不訟彼短恒以一心求諸功德是為八一涅盤經云菩薩六念念佛第一又云繫念思惟因緣力故得斷煩惱一大悲經云一稱佛名以是善根入涅槃界不可窮盡一大般若經云佛告曼殊室利菩薩能正修行一相莊嚴三昧疾證菩提修此行者應離喧雜不思眾生相專心繫念於一如來審取名字善想容儀即為普觀三世一切諸佛即得諸佛一切智慧一坐禪三昧經曰菩薩坐禪不念一切惟念一佛即得三昧一增一阿含經云四事供養閻浮提一切眾生若有稱佛名號如[穀-禾+牛]乳頃功德過上不可思議一文殊般若經云佛告文殊欲人一行三昧者應處空閒捨諸亂意不取相貌繫心一佛專稱名字隨彼方所端身正向能于一佛念念相續即是念中能見過去未來見在諸佛念一佛功德與念無量佛功德無二阿難所聞佛法猶住量數若得一行三昧諸經法門一一分別皆悉了知晝夜宣說智慧辯才終不斷絕阿難多聞辯才百千等分不及其一一大集經云若人專念一方佛或行或坐至七七日現身見佛即得往生一法華三昧觀經云十方眾生一稱南無佛者皆當作佛惟一大乘無有二三一切諸法一相一門所謂無生無減畢竟空相習如是觀五欲自斷五葢自除五根增長即得禪定一那先經云王問那先人生造惡臨終念佛得生佛國我不信是語那先答言如持大石置于船上因得不沒人雖本惡因念佛故不入泥犁其小石沒者如人作惡不知念佛便入泥犁中頌曰。",
        "translation": "四緯中之緯者一如華嚴毗盧遮那品云爾時大威光童子見波羅蜜善根莊嚴王如來成等正覺現神通力即得念佛三昧名無邊海藏門又光明覺品云爾時光明過千世界乃至一切處文殊菩薩各於佛所同時發聲說此頌言一切威儀中常念佛功德晝夜無暫斷如是業應作又賢首品云見有臨終勸念佛又示尊像令瞻敬俾於佛所深歸仰是故得成此光明又十無盡藏品第八念藏云此念有十種所謂寂靜念清淨念不濁念明徹念離塵念離種種念離垢念光耀念可愛樂念無能障礙念又兜率偈讚品離垢幢菩薩云以佛為境界專念而不捨此人得見佛其數與心等又十回向品第十回向云以法施回向願得憶念與法界等無量無邊世界未來現在一切諸佛(此二十二字作一句讀)又十地品中從初至末地地皆云一切所作不離念佛又佛不思議法品云如來有十種佛事一者若有眾生專心憶念則得現前二者若有眾生心不調順則為說法等又入法界品云德雲比丘告善財言善男子我得自在決定解力信根清淨智光照耀普觀境界離一切障具清淨行往詣十方供養諸佛常念一切諸佛如來總持一切諸佛正法常見一切諸佛隨諸眾生種種心樂(下文所言正此義)示現種種成正覺門於大眾中而師子吼善男子我唯得此憶念一切諸佛境界智慧光明普見法門所謂智光普照念佛門常見一切諸佛國土種種宮殿悉嚴淨故令一切眾生念佛門隨諸眾生心之所樂皆令見佛得清淨故令安住力念佛門令入如來十方中故令安住法念佛門見無量佛聽聞法故照耀諸方念佛門悉見一切諸世界中等無差別諸佛海故人不可見處念佛門悉見一切微細境中諸佛自在神通事故住於諸劫念佛門一切劫中常見如來諸所施為無暫捨故住一切時念佛門於一切時常見如來親近同住不捨離故住一切剎念佛門一切國土咸見佛身超過一切無與等故住一切世念佛門隨於自心之所欲樂普見三世諸如來故住一切境念佛門普於一切諸境界中見諸如來次第現故住寂滅念佛門於一念中見一切剎一切諸佛示涅槃故住遠離念佛門於一念中見一切佛從其所住而出去故住廣大念佛門心常觀察一一佛身充偏一切諸法界故住微細念佛門於一毛端有不可說如來出現悉至其所而承事故住莊嚴念佛門於一念中見一切剎皆有諸佛成等正覺現神變故住能事念佛門見一切佛出現世間放智慧光轉法輪故住自在心念佛門知隨自心所有欲樂一切諸佛現其像故住自業念佛門知隨眾生所積集業現其影像令覺悟故住神變念佛門見佛所坐廣大蓮華周徧法界而開敷故住虗空念佛門觀察如來所有身雲莊嚴法界虗空界故一法華經云若有因緣獨入他家一心念佛乞食無侶一心念佛又云若人散亂心入于塔廟中一稱南無佛皆已成佛道一淨名經云寶積當知直心是菩薩淨土菩薩成佛時不謟眾生來生其國深心是菩薩淨土菩薩成佛時具足功德眾生來生其國大乘心是菩薩淨土菩薩成佛時大乘眾生來生其國布施是菩薩淨土菩薩成佛時一切能捨眾生來生其國持戒是菩薩淨土菩薩成佛時行十善道滿願眾生來生其國忍辱是菩薩淨土菩薩成佛時三十二相莊嚴眾生來生其國精進是菩薩淨土菩薩成佛時勤修一切功德眾生來生其國禪定是菩薩淨土菩薩成佛時攝心不亂眾生來生其國智慧是菩薩淨土菩薩成佛時正定眾生來生其國四無量心是菩薩淨土菩薩成佛時成就慈悲喜捨眾生來生其國四攝法是菩薩淨土菩薩成佛時解脫所攝眾生來生其國方便是菩薩淨土菩薩成佛時於一切法方便無礙眾生來生其國三十七品是菩薩淨土菩薩成佛時念處正勤神足根力覺道眾生來生其國回向心是菩薩淨土菩薩成佛時得一切具足功德國土說除八難是菩薩淨土菩薩成佛時國土無有三惡八難自守戒行不譏彼缺是菩薩淨土菩薩成佛時國土無有犯禁之名十善是菩薩淨土菩薩成佛時命不中夭大富梵行所言誠諦常以軟語眷屬不離善和諍訟言必饒益不嫉不恚正見眾生來生其國如是寶積菩薩隨其直心則能發行隨其發行則得深心隨其深心則意調伏隨意調伏則如說行隨如說行則能迴向隨其迴向則有方便隨其方便則成就眾生隨成就眾生則佛土淨隨佛土淨則說法淨隨說法淨則智慧淨隨智慧淨則其心淨隨其心淨則一切功德淨是故寶積若菩薩欲得淨土當淨其心隨其心淨則佛土淨又云菩薩成就八法於此世界行無瘡疣生於淨土何等為八饒益眾生而不望報代一切眾生受諸苦惱所作功德盡以施之等心眾生謙下無閡於諸菩薩視之如佛所未聞經聞之不疑不與聲聞而相違背不嫉彼供不高已利而於其中調伏其心常省己過不訟彼短恒以一心求諸功德是為八一涅盤經云菩薩六念念佛第一又云繫念思惟因緣力故得斷煩惱一大悲經云一稱佛名以是善根入涅槃界不可窮盡一大般若經云佛告曼殊室利菩薩能正修行一相莊嚴三昧疾證菩提修此行者應離喧雜不思眾生相專心繫念於一如來審取名字善想容儀即為普觀三世一切諸佛即得諸佛一切智慧一坐禪三昧經曰菩薩坐禪不念一切惟念一佛即得三昧一增一阿含經云四事供養閻浮提一切眾生若有稱佛名號如[穀-禾+牛]乳頃功德過上不可思議一文殊般若經云佛告文殊欲人一行三昧者應處空閒捨諸亂意不取相貌繫心一佛專稱名字隨彼方所端身正向能于一佛念念相續即是念中能見過去未來見在諸佛念一佛功德與念無量佛功德無二阿難所聞佛法猶住量數若得一行三昧諸經法門一一分別皆悉了知晝夜宣說智慧辯才終不斷絕阿難多聞辯才百千等分不及其一一大集經云若人專念一方佛或行或坐至七七日現身見佛即得往生一法華三昧觀經云十方眾生一稱南無佛者皆當作佛惟一大乘無有二三一切諸法一相一門所謂無生無減畢竟空相習如是觀五欲自斷五葢自除五根增長即得禪定一那先經云王問那先人生造惡臨終念佛得生佛國我不信是語那先答言如持大石置于船上因得不沒人雖本惡因念佛故不入泥犁其小石沒者如人作惡不知念佛便入泥犁中頌曰。",
        "source": "X61n1165_003:0794c04_0",
        "is_bad_quality": true
    },
    {
        "source_sentence": "　如來金口言　　讚歎西方土　　如入長安城　東西南北入　　入已即一城　　無別天子都　普賢佛長子　　文殊七佛師　　授記及迴向　是果位往生　　釋種得法忍　　善財證佛果　面奉阿彌陀　　是菩薩往生　　龍樹破有無　祈婆最勝根　　皆得佛授記　　是禪師往生　聞佛心信樂　　誦念與持諷　　大石置船上　是下劣往生　　阿難世多聞　　佛子中第一　不如念一佛　　頓了諸經法　　云何義解家　得輕易念佛　　諸正念法門　　經中皆悉載　但一大乘法　　無二亦無三　　奉勸悟達士　趂時歇狂解　　一心念阿彌　　蓮花念念生　此是常寂光　　非報非方便　　作是觀為正　勿妄生分別　　禪教律三乘　　同歸淨土海　一切法皆入　　是無上普門　　教海義無量　甕觀捨少許　　一臠遍鼎味　　是中有全藏西方合論卷之三",
        "translation": "\"The Tathāgata's golden mouth says, 'Praise for the Western Land.' Like entering Chang'an City, entering east, west, north, and south, entering the one city, there's no separate city of gods or sons, the eldest son of the Buddha, the seven Buddha-masters of Mañjuśrī, bestowing predictions and dedications of merit, and realizing the Buddhahood with good fortune are the realizations of rebirth in the stage of fruition.\" These are the rebirths of the bodhisattvas, the nāga trees that refute existence and nonexistence, the most excellent roots of the prayers, all attaining Buddha's predictions, and the rebirths of the meditation masters, the faithfulness of hearing the Buddha, the recitation and chanting, the placing of the boulder on the boat, and the rebirths of the inferior ones.",
        "source": "X61n1165_003:0796a15_0",
        "is_bad_quality": false
    }
]