[
    {
        "source_sentence": "淨土晨鐘卷第六",
        "translation": "Jingtu mingling bell, vol. 6",
        "source": "X62n1172_006:0063a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "荊溪周克復重朗纂男周　石糓城",
        "translation": "Jingxi Zhou Kefu Chonglang Zhuanan Zhou Shi Hencheng",
        "source": "X62n1172_006:0063a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "訂吳郡陳濟生皇士參",
        "translation": "Prescribed to Wu County, Chen Jisheng, and Huang Shishen",
        "source": "X62n1172_006:0063a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨土策進",
        "translation": "Jingtu zajin",
        "source": "X62n1172_006:0063a19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "往生以往為義往以進為功進則西方彈指可到退則隔十萬億剎之外譬之駕馬然騏驥不鞭箠而日致千里良馬顧鞭影而馳其次則須執策擬其後矣求生彼土者無悠怱坐進之理亦復如是善乎蓮大師曰世間一技一藝始學不勝其難因置不學則終無成矣故貴有決定不疑之心雖復決定而優游遲緩則亦不成故其繼貴有精進勇猛之心雖復精進或得少而足或時久而疲或遇順境而迷或逢逆境而墮則亦不成故其終貴有常永貞固誓不退轉之心古云三昧不成假令筋斷骨枯終不休歇又云道不過雪竇不復登此山如是有心何事不辨茲取前賢警切之語著為是編多本蓮池者樂其文義簡至且言近而可徵也以誓願策其始以一心正念策其終義備矣志淨業者其以是當繞朝之策祖生之鞭述策進第六。",
        "translation": "Rebirth in the past is the meaning of going forward, and progress is the merit of going forward, then the West can be reached with a snap of the fingers, and going back is a distance of ten trillion jasms away. It's like driving a horse, but it's a horse that doesn't need a whip and a restraint and travels a thousand miles day by day.",
        "source": "X62n1172_006:0063a20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策願力",
        "translation": "The power of the vow to curb",
        "source": "X62n1172_006:0063b11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問為惡必墮三途非資願力則淨業正因何以願為答曰從善如登為惡如崩安可例故欲生淨土樂見阿彌陀佛必須發願乃得往生若無願心善根沉沒華嚴經云不發大願是為魔事欲成無上道故須得願波羅蜜所以本師莊嚴樂邦實惟四十八願普賢亦以十大願王為極樂先導曰最後剎那一切諸根悉皆退失惟此願王不相捨離於一切時引導其前一剎那間即得往生極樂世界唐道昂法師志篤西方一日見天眾繽紛告徒云兜率迎我非本願也吾志西方何不果言訖天樂倐隱隨見西方法音滿前師乃坐化夫時逼須臾猶能却天宮而轉淨土終遂所期願力之神不可思議如此。",
        "translation": "The question was, \"Why is the vow the proper cause of purifying karma when evil is bound to fall into the three destinies and not the power of the vow?\" The answer was, \"If you pursue goodness as you ascend, and evil as you collapse, then you must make the vow to be reborn in the Pure Land and enjoy seeing Amitâbha Buddha.",
        "source": "X62n1172_006:0063b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "竊見常人念佛者多只為福田故眷屬故病苦求痊及永年故保富貴安樂子孫光顯故往往香燭道場所陳祝願回向之詞皆是趨逐凡緣與阿彌接引本願甚背縱使一生修習不明大道錯用功夫何益惟是發真正願願見阿彌陀佛願生清淨國土願得親承授記回入娑婆廣度眾生毫不自求人天福報如是發願時刻注向雖不對佛陳白而心意之中欣樂不忘方稱願力成就方與佛願相應臨命終時必蒙接引(已上纂故鄉消息)。",
        "translation": "We often see that many ordinary people who call on the Buddha only for a field of merit, because of their dependents, because of their illness and pain, and because of their recovery and longevity, because of their prosperity and well-being, and because of the radiance of their children and grandchildren, and because of the words of consecration and dedication of merit that are often presented at candlelight ceremonies, tend to pursue worldly conditions and are quite contrary to Amitâbha's original vow. Even if a lifetime of cultivation is spent without understanding the great way, what good is it to misuse one's efforts?",
        "source": "X62n1172_006:0063b24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問誓願並稱其義何居曰蓮大師云期其志而必到者願為之先導也堅其願而不退者誓為之後驅也故疏稱誓為願中勇烈意吾願雖發若無大誓安克有終蓮宗寶鑑引懺云眾生無邊誓願度煩惱無盡誓願斷法門無量誓願學佛道無上誓願成此謂之四弘願慈照集懺恐人著事迷理乃云自性眾生誓願度自性煩惱誓願斷自性法門誓願學自性佛道誓願成此四句直明真理與後人開一門戶只要人自信自肯從這裏入頭悟自性彌陀達性心淨土入諸佛境界(合纂)。",
        "translation": "The question was, \"What is the meaning of the combined title of vow and vow?\" The Lotus Master said, \"When someone expects his intention and will definitely arrive, the vow will guide him; when he is resolute in his vow and doesn't retreat, the vow will drive him away; therefore, the commentary calls the vow a bold intention in the vow. Although I have made the vow, if I hadn't made the great vow, I couldn't have ended it.\" The Lotus Sutra's Guide to Repentance says, \"Sentient beings have unlimited vows, afflictions have no end, vows to end Dharma gates, measureless vows to study the Buddha Way, and unsurpassed vows to achieve what is called the four vast vows.",
        "source": "X62n1172_006:0063c09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策勇猛精進",
        "translation": "To exert vigor and effort",
        "source": "X62n1172_006:0063c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡修淨土人灼然是要敵他生死不是說了便休當念無常迅速時不待人須是把做一伴事始得若半進半退似信似疑濟得甚事如何出離輪迴譬如百二十斤擔子到臨時自家擔荷得去方為了事決不在會說會道廣化人緣上決不在有傳有授扭揑做作上決不在盛設道場多點香燭上若是信得及便從今日去發大勇猛發大精進莫問會與不會見性不見性但執持一句南無阿彌陀佛如靠著一座須彌山相似搖撼不動專心一意或參念觀念憶念十念或默念專念繫念禮念念茲在茲心念不空過念佛不離心日日時時不要放捨綿綿密密如雞抱卵常令暖氣相接即是淨念相繼更加智照則知淨土即是自心此乃上智人修進工夫如此把得定做得王靠得穩縱遇苦樂逆順境界現前只是念佛無一念變異心無一念退惰心無一念雜想心直至盡生永無別念決定要生西方極樂世界能如是用功則歷劫無明生死業障自然消殞塵勞習漏自然淨盡無餘親見彌陀不離本念功成行滿願力相資臨命終時定生上品其或力量未充須隨力修習未能專一亦要朝昏禮念家緣繁冗無忘十念稱名日日用心猛著精彩積功積行發願發心誓畢此生同登淨域此乃真實了生死人也(蓮宗寶鑑)。",
        "translation": "Whenever someone cultivates the Pure Land, they certainly want to oppose the birth and death of others, not just talk about it and then stop. When mindfulness is impermanent and swift, the time is not waiting for someone else.",
        "source": "X62n1172_006:0063c20_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世網中人若是痛念無常用心真切者不問靜閙閒忙一任公私幹辨迎賓待客萬緣交擾八面應酬與他念佛兩不相好不見古人道朝也阿彌陀暮也阿彌陀假饒忙似箭不離阿彌陀其有世緣重力量輕者亦須忙裏偷閒閙中取靜每日或念百聲千聲定為日課不容一日放過又有冗忙無頃刻暇者每日晨朝十念積久功成亦不虗棄念佛外或念經禮佛懺悔發願種種作福隨力修諸善行以助之凡一毫之善皆須回向西方如此用力決定往生亦且增高品位(淨土或問)。",
        "translation": "If someone in the world's net is painfully mindful of the inactive and has a sincere mind, they don't care about quiescence, arouse concern, and busyness; they just let public and private affairs get in the way, welcome guests, entertain guests, and be distracted by a myriad of conditions, respond to rewards from eight sides, and recite the Buddha's name to others; they don't see the ancient way of saying, \"Even in the morning, Amitâbha is present, and in the evening, Amitâbha is present; they're busy, like an arrow, and don't part from Amitâbha. Some people with heavy worldly causation and lighter strength must also steal time from their busy lives and get quiet in the midst of the hustle and bustle.",
        "source": "X62n1172_006:0064a18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世人修行淨業勿得言我今忙迫且待間暇我今貧乏且待富足我今少壯且待暮年若已分定常忙分定貧乏分定夭折即於淨業無緣耶忽爾喪亡雖悔何及是故即今安徤努力修之(寂室)。",
        "translation": "A person who cultivates pure activities must not say, 'Now I'm busy and waiting for time, now I'm poor and waiting for prosperity, now I'm young and strong and waiting for old age.' If he's certainly always busy, certainly poor, certainly dying young, that means he has no connection to pure activities.",
        "source": "X62n1172_006:0064b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一生之中以淳淨心堅固諦信至誠禮誦悔過發願吾知此人若身若心則與彌陀氣類交接智論云如風吹樹斜勢西傾及其倒時必當西倒習善得生亦復如是(櫨菴法師有嚴)。",
        "translation": "In a single lifetime, with a pure mind and a resolute, true faith, sincere prostration, repentance, and vow, I know that this person, whether in body or mind, is in contact with the aura of Amitâbha.",
        "source": "X62n1172_006:0064b08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世人念佛不真切只是把生死二字看得輕忽一生忙忙碌碌將性命撇在虗空與己全無干涉即或當場嗟嘆片時毛骨悚然過後仍前醉夢屠赤水云世智紛紛名利場中伶俐識神擾擾死生路上糊塗哀哉誰曉四大不堅無常甚速三途八難最苦肯去要緊真切念佛百中希有一二也昔一僧探俗友勸以生死事大急宜念佛友謝以三頭未了僧問故友曰親樞未舉男婚女嫁未畢僧別不久友忽亡僧往弔作詩曰吾友名為張祖留勸伊念佛說三頭可怪閻公無分曉三頭未了便來勾此言雖淺大可醒俗吾願世人各宜奮發精力一下斬斷輪迴信得這句佛即勇往直前念去只此一念是破黑暗之明燈是渡苦海之大船是脫生死之良方是出三界之徑路併其或驗或不驗或悟或不悟一切都不計較但持一句佛號在心無事也念有事也念安樂也念病苦也念生也念死也念如此認真事無不濟。",
        "translation": "The world's recitation of the Buddha's name is not genuine, it's just that they take the word life and death lightly and go about their lives, leaving their lives in the void and not interfering with themselves at all, or they may sigh in contempt on the spot, and for a moment their bones are creeped out, and then they're still drunk, dreaming of Tu Chishui Yun, the world's wisdom is full of fame and profit, and the eloquence of consciousness and the spirit is disturbed and confused on the road to death and birth.",
        "source": "X62n1172_006:0064b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "蘇州承天寺頭陀懷林為冥使所追期七日當往急詣真如禪師求救師令發願修塔晝夜勤念金剛經中當知此處即為是塔二句至七日冥使入室拘之金塔光耀目不能開而去頭陀得不死拽鍊若募終此勝事克復輯金剛持驗至此竦然曰懷林發功德大願諷上乘妙法七日便能跳出生死異矣今觀淨土法門一日七日至一念十念決定往生不更異乎乃今人一生念佛不免輪迴又何以故要知如來教人念佛正攝百千萬襍念於一念一念猛勵自然證佛還思今人念佛時一串素珠中意起意滅不知多少更端則其念佛亦只口中喃喃心上並不知有佛在此彼手之於口口之於心尚未合一安望凡人與佛能合而為一耶念佛不能絕去襍心純一精進至無間地欲逃生死往生上品斷無此理(已上附纂)。",
        "translation": "The head monk of Chengtian Temple in Suzhou, Huairin was pursued by the messenger of darkness for seven days and then rushed to the Zenru Zen master for help. The master ordered him to make a vow to build a stūpa and diligently recite the two phrases of the Jingang Sutra, which should be known as this place is the stūpa, until seven days when the messenger of darkness entered the room and detained him, the golden stūpa shone brightly, the eyes could not be opened, and the head monk was able to immortally drag and chain.",
        "source": "X62n1172_006:0064c04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策攝心悟心",
        "translation": "To collect the mind and awaken the mind",
        "source": "X62n1172_006:0064c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡歷涉緣務而內心不忘於佛及憶淨土譬如世人切事繫心雖經歷語言去來坐臥種種作務而不妨密憶前事宛然念佛之心亦應如是或者失念數數攝還久久成性任運常憶(慈雲懺主)。",
        "translation": "Where there are affairs involving conditions and internal mind does not forget the Buddha and recollection of the Pure Land, such as people who are tied to matters of concern, although they experience language, going, coming, sitting, lying, and various kinds of work, and may not be able to closely recollect previous events, just like the mind of mindfulness of the Buddha should be the same or lose mindfulness of repeatedly collected and returned over time into the nature of the free flow of constant recollection (Maitreya confessor).",
        "source": "X62n1172_006:0064c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "古云雜念是病念佛是藥念佛正治雜念而不能治者因念不親切也雜念起時即用心加功念佛字字句句精一不二雜念自息矣。",
        "translation": "The old saying is that recollection is the disease, recollection is the medicine, recollection is the cure for recollection, but can not be cured because the recollection is not intimate. When recollection arises, that is, mindfulness, effort, recollection of the Buddha, word by word, phrase by phrase, precise, not two, recollection of recollection is self-relieved.",
        "source": "X62n1172_006:0064c23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "端坐念佛恐心難攝不若經行。",
        "translation": "Sitting upright in mindfulness of the Buddha, I'm afraid it's difficult to gather the mind, so why not practice with the scriptures?",
        "source": "X62n1172_006:0065a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "問猿方著鎻旋即昏沉惺惺策發隨復散亂云何降伏答寂寂治散亂散去則生昏沉惺惺治昏沉昏去則生散亂止觀雙持昏散皆退今只須精明念佛念無二念曰精念而返照曰明精即止明即觀一念佛而止觀備矣。",
        "translation": "Q猿 方著鎻旋即昏沉惺惺策發隨復散亂云何降伏答Silence to counteract distraction Scattering then gives rise to unconsciousness Sympathetic to counteract unconsciousness Fainting then gives rise to distraction Stop and look at the dual maintenance of unconsciousness and distraction are retrogressed Now we only need to concentrate mindfulness of the Buddha mindfulness without dual mindfulness said concentrate mindfulness and return to illumination said Ming concentrate that is stopping Ming that is observing a mindfulness of the Buddha and stopping and observing is complete.",
        "source": "X62n1172_006:0065a03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "參禪人只守一則公案如參念佛是誰不得又參萬法歸一一歸何處等若透一則餘盡透矣若自覺已透於別則公案還有不盡透處即是向所守公案還非真透未免涉情識也。",
        "translation": "Those who practice meditation should only observe one statement, such as the statement of mindfulness of the Buddha who is not allowed to study and the statement of the return of each of the myriad phenomena to where they return, etc. If they penetrate one, then the rest is completely penetrated. If they realize that they have penetrated others, then there is still a statement that is not completely penetrated, which is to say that the statement of mindfulness is not really penetrated, not without involving the consciousness of feelings.",
        "source": "X62n1172_006:0065a08_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "行住坐臥四威儀中皆可用心而坐時為勝然始學者先須行多坐少若貪坐則昏不能退無事有事皆可用心而無事為勝先於靜處做後於動處鍊。",
        "translation": "Among the four rituals of walking, standing, sitting, and lying, all can be done with mindfulness, and sitting is superior; however, when starting out, learners must first do more walking and less sitting.",
        "source": "X62n1172_006:0065a12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "凡夫放心初學攝心後乃得心攝心非止一法功高易進念佛為先想起時不須別作除滅但舉阿彌陀佛四字盡力挨拶便是攝心工夫忽然悟去名曰得心今見六祖道本來無一物何處惹塵埃便將神秀時時勤拂拭之句藐視如一莖草不知時時拂拭正學者今日事也(已上蓮池遺稿)。",
        "translation": "When ordinary people are at ease with the initial study of collecting the mind and then attaining the mind, collecting the mind is not just one method of high effort and easy advancement, but when recollection of the Buddha comes first, there is no need to separately remove and extinguish but to lift up the four words Amitâbha Buddha and try to squeeze them is the work of collecting the mind, and suddenly awakening is called attaining the mind. Now, when I see the Sixth Patriarch's path, there was originally not a single thing, where did it cause dust and dirt, then Shenxiu's phrase of diligently wiping it at times is despised as a blade of grass, not knowing that wiping it at times is exactly the task of today's scholar (already on the Lotus Pond manuscript).",
        "source": "X62n1172_006:0065a15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策三種念佛成佛",
        "translation": "Cētriṃśati nembutsu buddha",
        "source": "X62n1172_006:0065a21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "或問今見世人念佛者多生西方成佛者少何也答其說有三一者口雖念佛心中不善以此不得往生不知既是念佛便要依佛所說積德修福孝順父母忠事君王兄弟相愛夫婦相敬至誠信實柔和忍耐公平正直陰隲方便慈憫一切不殺生命不凌辱下人不欺壓小民但有不好心起著力念佛定要念退這不好心如此纔是念佛的人定得成佛二者口雖念佛心中胡思亂想以此不得往生念佛之時按定心猿意馬字字分明心心照管如親在西方面對彌陀不敢散亂如此纔是念佛的人定得成佛三者口雖念佛心中只願求生富貴或說我等凡夫料西方無分只圖來世不失人身此則不合佛心以此不得往生不知天宮福盡也要墮落人間富貴能有幾時若說是凡夫西方無分則聖賢都是凡夫做安知儞不生西方也便可發廣大心立堅固志誓願往生見佛聞法得無上果廣度眾生如此纔是念佛的人定得成佛(蓮池)。",
        "translation": "Some people ask, \"Nowadays, we see that many people who are mindful of the Buddha are born in the West and become buddhas.\" Why is it that they say that there are three things: first, although they say they are mindful of the Buddha, their minds are not good, and they won't be reborn because of this. They don't know that since they are mindful of the Buddha, they must accumulate virtue and cultivate merit according to the Buddha's teaching.",
        "source": "X62n1172_006:0065a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策出家人一心正念",
        "translation": "He urges renunciant monks to single-mindedly and correctly recall the Buddha's name.",
        "source": "X62n1172_006:0065b15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "先民有言禹惜寸陰至於眾人當惜分陰我今衰殘奚啻惜分一彈指頃毋雜用心言毋雜用心者謂本參正念外纔起一念雜想即便掃除攝歸正念不可時刻延捱今略開七事真為生死出家直欲一生了辨務力守之時時自警。",
        "translation": "As the ancestors once said, \"U cherishes an inch of skin, and as for all people, they should cherish a part of skin.\" Now that I'm decrepit, why should I cherish just one snap of the fingers? \"Don't get distracted.\" \"Don't get distracted\" means that outside of the original practice of right mindfulness, even if one distracting thought arises, it should be removed and gathered into right mindfulness.",
        "source": "X62n1172_006:0065b16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "一不得畜資財造房屋買田地置一切精緻好物即經像等傳自太古出自名家皆勿留戀一心正念。",
        "translation": "First, he mustn't store up money or property, build a house, buy land, or acquire all the fine things, even scriptures and images that have been handed down from ancient times and come from famous families.",
        "source": "X62n1172_006:0065b21_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "二不得作種種非緊要福緣事姑俟他日大事已明作之未晚今且權置萬行門一心正念。",
        "translation": "Second, he mustn't do various things that aren't important or beneficial, waiting until another day when the great matter has been clarified.",
        "source": "X62n1172_006:0065b23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "三不得於好色好味等起貪愛心於好言贊譽我者起貪愛心不得於惡色惡味等起嗔惱心於惡言譏毀我者罵辱我者種種拂逆我者起嗔惱心乃至過去未來事或順或違皆悉屏絕堅壁固守一心正念。",
        "translation": "Third, he mustn't become desirous of nice things, such as good looks and tastes, and he mustn't become desirous of those who speak well of him or her. He mustn't become angry and resentful of those who speak ill of him or her, ridicule him or her, insult him or her, or become angry and resentful of those who disobey him or her, even whether they were agreeable or disagreeable in the past or future.",
        "source": "X62n1172_006:0065b24_1",
        "is_bad_quality": false
    },
    {
        "source_sentence": "四不得吟作詩文書寫真草題帖對聯修飾尺牘泛覧外書議論他人得失長短乃至教憑臆見而高心著述禪未悟徹而妄意拈評緘口結舌一心正念。",
        "translation": "Four, they mustn't recite poems or write letters, write real cursive inscriptions, post and couplets, decorate their rulers, read externally, discuss the strengths and weaknesses of others, or even teach based on conceptual views and write statements with a high mind, make false accusations before Chan is fully understood, and hold their tongue with one mind and right concentration.",
        "source": "X62n1172_006:0065c04_2",
        "is_bad_quality": false
    },
    {
        "source_sentence": "五不得交結親朋應赴請召遊山翫景雜話間談凡種種世諦中事除理所當為決不可已者餘悉休罷一心正念。",
        "translation": "Fifth, he mustn't associate with friends and relatives who are invited to visit the mountains and take in the sights, and he might engage in casual conversation about various matters in the conventional truth, except for those that are reasonable and absolutely impossible to do.",
        "source": "X62n1172_006:0065c07_3",
        "is_bad_quality": false
    },
    {
        "source_sentence": "六不得貪著放逸恣縱睡眠大事未明捍勞忍苦一心正念。",
        "translation": "Sixth, he mustn't be addicted, careless, wanton, or asleep, failing to understand great matters, defend suffering, and endure hardship with one mind and right concentration.",
        "source": "X62n1172_006:0065c10_4",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七不得與世人競才競能爭名爭勢未得言得未證言證誑稱知識妄自尊高惟應執卑守愚終身居學地而自鍛鍊常精常進一心正念(蓮池自警)。",
        "translation": "Seven, they mustn't compete with others for their talents and abilities, for fame and power, or for knowledge that's not obtained, that's not realized, that's realized, and that's claimed to be superior, but they should hold to their inferiority, guard their foolishness, remain in the stage of training, train themselves, always strive, and always advance with one correct mindfulness (Lianchi's own warning).",
        "source": "X62n1172_006:0065c11_5",
        "is_bad_quality": false
    },
    {
        "source_sentence": "(此蓮師現身說法語也借自警以警人句句嘔心言言針頂謂是彼說自家話與我輩無與可乎覽此而不悚然易慮者必非真學道人)。",
        "translation": "(This is the Lotus Master's way of saying the Dharma in person, which uses self-policing to warn people, saying every word to vomit the mind, saying the tip of the needle, and saying that it's okay for them to say their own words and for us not to be associated with them.)",
        "source": "X62n1172_006:0065c14_6",
        "is_bad_quality": false
    },
    {
        "source_sentence": "我出家後到處參訪時徧融師門庭大振予至京師叩之膝行再請師曰可守本分不得去貪名逐利亦不得去攀緣只要因果分明一心念佛予受教出同行者大笑謂此數言誰說不出千里遠來只道有甚高妙處予曰不然此正是他好處吾輩企慕遠來他却不說玄說妙凌駕眾人只將自家體認過切近精實工夫叮嚀開示正是真實禪和不可輕也我至今著實遵守。",
        "translation": "When I left home and went to visit everywhere, the monastery of the universal master was greatly invigorated. When I went to the capital, I bowed my knee and asked the master again, \"You can keep your original part and not go craving fame and profit, and not go clinging to conditions as long as the cause and effect is clearly defined and the mindfulness of the Buddha is single-minded.\" I was taught and my fellow practitioners laughed and said, \"Who can't say these few words that come from thousands of miles away?",
        "source": "X62n1172_006:0065c16_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "今人念佛不肯真切加功只是不曾深思諦信不要說不信淨土只如世尊說人命在呼吸間這一句於義理非有難解儞們眼裏親見耳裏親聞經過許多榜樣如今要儞信得這句早是不能勾也儞若真實信得這句則念佛法門不必要我費力千叮萬囑爾自如水赴壑萬牛不能挽矣即如前日津送亡僧時儞們覩此榜樣當愀然不樂痛相警策曰大眾我與儞但今日送某僧明日送某僧不知不覺輪到自身此時悔恨無及須疾忙念佛時刻不要放過方好我見儞們口裏也說可惜及乎過後依然言笑自如只是不信人命在呼吸間也。",
        "translation": "Now, if they truly believe this statement, then the mindfulness of the Buddha's teaching need not be as painful as a thousand exhortations from me, for they themselves are like water going into a gully that cannot be pulled back by a thousand oxen.",
        "source": "X62n1172_006:0065c24_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "予見新學少年纔把一句佛頓在心頭閑思妄想越覺騰沸便謂念佛工夫不能攝心不知汝無量劫來生死根由何能即斷且萬念紛飛之際正是做工夫時節旋收旋散旋散旋收久後純熟自然妄念不起且汝之能覺妄念重者虧這句佛如不念佛時瀾翻潮湧剎那不停者自己豈能覺乎。",
        "translation": "I have seen new students and youths who have just put a single phrase of the Buddha in their minds and whose leisure thoughts and deluded ideas are boiling over, then they say that the mindfulness of the Buddha's work cannot be collected in the mind. I don't know how you can immediately stop the root of birth and death for countless eons, but when ten thousand thoughts are flying around, it is the right time to do the work, to spin away, scatter, disperse, spin back, and naturally after a long period of maturation, deluded thoughts will not arise.",
        "source": "X62n1172_006:0066a11_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "念佛有默持有高聲持有金剛持高聲覺大費力默念又易昏沉只是綿綿密密聲在唇齒之間乃謂金剛持又不可執定或覺費力不好默持或覺昏沉不妨高聲今念佛者只是手打魚子隨口叫喊所以不得利益須句句出口入耳聲聲喚醒自心如一人濃睡一人喚云某人彼即醒矣所以念佛最能攝心。",
        "translation": "There is silent chanting, loud chanting, vajra chanting, loud chanting, feeling great effort, silent chanting, and easy to be drowsy, just a long, dense sound between the lips and teeth is called vajra chanting, but it is not possible to hold to a concentration, or feel the effort is not good silent chanting, or feel drowsy, may as well be loud chanting.",
        "source": "X62n1172_006:0066a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "幼時尚不知念佛見隣家一老嫗每日課佛數千問為何如此彼云先夫往時念佛去得甚好故我如此念先夫去時並無他病只與人一請而別出家人奈何不念佛(蓮池警眾)。",
        "translation": "When I was young, I didn't know how to mindfully call on the Buddha. I saw an old woman from the neighborhood who taught thousands of buddha lessons every day and asked why she did so.",
        "source": "X62n1172_006:0066a23_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策在家人一心正念",
        "translation": "He urged those in the family to be single-mindedly and correctly mindful.",
        "source": "X62n1172_006:0066b03_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "來書云世累所羈不能一洗凡俗然世未足稱累也世間法如人倫庶物一一與道非礙所貴任理隨緣無心順應而已登第日發大誓願心不以富貴利達負其所學期如古昔名臣是謂濟世必不以富貴所達迷失正念務了明此一段大事因緣是謂出世。",
        "translation": "As the text from the future says, \"Worldly encumbrances cannot be cleansed of conventionality, but the world is not enough to be called an encumbrance. Worldly phenomena like people, families, and common goods each share with the Way are not obstacles to what's valued, and they are subject to principle and conditions without mind, so they just conform to it.\" On the day of ascension, he made a great vow not to let wealth and profit get in the way of what he'd learned, and to expect to be like the famous ministers of old is to help the world.",
        "source": "X62n1172_006:0066b04_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "子貢問一言終身夫子以恕答之今日戒之一字銘以終身罄無不盡以攝心即是戒故若向心地法門中念得便一切具足尚何論戒之持與不持如其不然須一一依教奉行經云攝心為戒因戒生定因定發慧戒之時義大矣哉佛戒至密殺戒微及蜎蠕極之纔有忿嫉即殺戒不淨眼取色耳取聲即盜戒不淨隔壁聞釵釧聲即婬戒不淨至是則身心俱斷事理雙盡矣處世緣中持戒豈能一一與剃染者例論惟貴於心學大頭腦處著力一旦脫然悟去則咳唾掉臂無不是清淨毗尼矣但不可未得謂得而發狂解便道飲酒食肉不礙菩提行盜行婬無妨般若墮落魔羅境界耳果能時時反照刻刻提撕向本參念佛話頭上做工夫則不惟日後有發明在即目前便自得力日用有主宰不隨物轉縱居聲色名利之場妻子眷屬日夕相接不妨與世推移混俗和光自然出污泥而不染是謂塵中大解脫門也所稱宜世不染世益人後益己者豈外是哉。",
        "translation": "He answered with forgiveness. Today, the word precepts is inscribed in the phrase \"end of life,\" and there's nothing that isn't exhausted. If one mindfully recites the Dharma aspect of the mind ground, then everything is complete.",
        "source": "X62n1172_006:0066b09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "人之處世遇順境者其情愉以安遇逆境者其情憂以危然而順未足為幸逆未足為不幸也溺於意之所便則出世之心不生戚戚乎不得志然後厭身世之桎梏而求出世是故萬苦交於前但以正智觀察苦從何生從身生身從何生從業生業從何生從惑生因惑造業因業成身因身受苦但能破惑一切空寂問所以破惑之方只須就本參話頭上理會念佛的是誰捉破此疑諸惑皆破思之毋忽。",
        "translation": "When a person lives in the world, their feelings are pleasant because they're comfortable when they encounter a pleasant situation, and their feelings are sad because they're dangerous when they encounter a difficult situation.",
        "source": "X62n1172_006:0066c02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "攝心用觀坐立想像等俱隨人無定但常觀無間非塵緣未了者所能為雖不能常觀亦是工夫毋用為慮又塵緣中觀法難成不如直以學業家業得暇之時即便默持名號只貴字字分明句句親切心則自攝若久之不退三昧成就即此是觀。",
        "translation": "Regathering the mind and using contemplation, sitting, standing, imagining, and so forth all go along with people without a set mind, but always observing without interruption is not something that those who have not yet completed the dust and conditions can do, even though they can't always observe it, it's still work, so don't use it as a concern.",
        "source": "X62n1172_006:0066c10_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "法門無量要在明心明心要門無如念佛讀作之暇或心煩時靜坐念佛甚有利益一念在佛雜念退休心空境寂妙當何如願無易而忽之(已上遺稿)。",
        "translation": "There are countless dharma-gates that are essential to clarify the mind. The essential gate to clarify the mind is not like mindfulness of the buddha, but when you have time to read or when your mind is troubled, sitting quietly and mindful of the buddha is very beneficial.",
        "source": "X62n1172_006:0066c15_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "策老者病者一心正念",
        "translation": "To encourage the elderly and sick to be unified in their mind and correct mindfulness.",
        "source": "X62n1172_006:0066c18_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言人命無常促於呼吸少年亦爾何况老乎我今殷勤來相警策當觀此身目暗耳聾髮白面皺背傴腰曲骨痛節攣步履龍鍾精神昏塞譬如夕陽西照光景須臾哀草迎秋凋零頃刻此身不久前路茫茫未知所往誠如己事已辨非愚所量其或不然何不猛省無常戰兢惕勵諦思淨土决志往生放下萬緣一心念佛(老堂警策)。",
        "translation": "The Buddha says that human life is impermanent and prompts breathing, and so is a youth, not to mention old age. Now, I've diligently come to warn and advise you to examine this body, which has dark eyes and deaf ears, white hair and a wrinkled face, a flat back, a bony back, painful joints, a spastic step, a dragon's bell, and a faint spirit.",
        "source": "X62n1172_006:0066c19_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "佛言人命無常促於呼吸平人亦爾何況病乎我今殷勤來相警策當觀此身四大不調百體欲散飲食漸減醫藥無靈便利床敷呻吟枕席譬諸魚遊釜內倐忽焦糜燈在風前剎那熄滅此身不久前路茫范未知所往誠如己事已辨非愚所量其或不然何不猛省無常戰兢惕勵諦思淨土決志往生放下萬緣一心念佛(病堂警策)。",
        "translation": "The Buddha said that human life is impermanent, and even an ordinary person is prolonged by breathing, so why wouldn't an illness be? Now, I've earnestly come to warn and guide you. You should examine this body, which has four major disorders and has a hundred bodies that want to disperse, eat and drink, and gradually decrease, and have no medicine that's effective for making beds, groaning, pillows, and seats, like a fish swimming in a cauldron that suddenly scorches and rots, a lamp in front of the wind that goes out instantaneously, and this body's path to the unknown is as honest as its own task.",
        "source": "X62n1172_006:0067a02_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "七十古希百年能幾今此暮景正宜放開懷抱看破世間宛如一場戲劇何有真實但以一聲阿彌陀佛消遣光陰但以西方極樂為我家舍我今念佛日後當生西方何幸如之發大歡喜莫生煩惱倘遇不如意事即便撥轉心頭這一聲佛急急提念却回光返照我是阿彌陀佛世界中人奈何與世人一般見識回嗔作喜一心念佛此是智慧中人大安樂大解脫法門也。",
        "translation": "At this late hour, it's time to open your mind and see that the world is like a drama, how could it ever be real? But to pass the time with a single sound of Amitâbha Buddha and to take the Western paradise as my home.",
        "source": "X62n1172_006:0067a09_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "病從身生身從業生業從心生心空則業空業空則身空身且空病安從生願空其心即大忤意事亦付之如夢如幻如泡如影怡然坦然不以介意但回光內照一心正念一心正念者但置一聲佛於清淨心中也若是不惟却病而道從此入矣。",
        "translation": "Illness arises from the body, the body is born from activity, karma arises from the mind, the mind is empty, karma is empty, the body is empty, the body is empty, and the illness is peaceful, the vow is empty, and the mind is paid off like a dream, like an illusion, like a bubble, like a shadow, pleasantly and openly, without minding it, but returning the light to the inner illumination, one mind is correctly mindful, one mind is correctly mindful, but placing one sound of the Buddha in a pure heart is not only sick, but the path is entered from here.",
        "source": "X62n1172_006:0067a17_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無業而病病屬先業現生償此併多生之業償之矣所謂重報輕受者也世事以疾而廢因癈世事得修道業又所謂因禍而得福者也應生歡喜而勿煩惱惟將身外事并此身四肢百骸盡情放下使空無一物若不可歇者權且歇下待後處之妄想熾不能制當念佛數聲壓伏之世間榮華富貴不過片時間事厄難苦惱亦不過片時間事倐忽便無且萬般皆屬前緣非人力所能奈何也盡情放下一心念佛(蓮池遺稿)。",
        "translation": "Without karma, illness belongs to prior karma, present life, and this combined with many lifetimes of karma to repay it. It's called the heavy reward and the lighter reward. Worldly affairs are wasted because of illness, and because of the abatement of worldly affairs, one can cultivate good karma, and it's called the attainment of good fortune because of calamity.",
        "source": "X62n1172_006:0067a22_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "無常迅速老少無別年少猶處未定之天妄翼長壽若老年人定然光景無多矣須把身世事處分了當任他大限朝到暮到撒手便行無所繫累此晚景大要緊處修淨土人尤不可忽每見人到屬纊時都有幾件做不完的勾當能於每日到上床時都有去得下的意思方好但己事不辨說去得下也難。",
        "translation": "Impermanence is swift, and old age is indistinguishable from youth. Young people are still in an unsettled heaven, and they falsely hope for a long life, but if old people are set on having a long life, there's not much time left.",
        "source": "X62n1172_006:0067b06_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "世人以病為苦而先德云病者眾生之良藥何也誠有形之身不能無病值無病時嬉怡放逸誰為覺悟者惟病苦逼身上乘人從此悟四大非實人命無常倍堅道念其次亦萬念灰冷良心孤露從前所作善惡歷歷現前不容欺昧急切回頭然則病誠悔悟之一機而修進之一助也然無根器人病至而怨尤病甚而惶懼及病去而復縱恣妄行以自愉快邪迷不返雖盧扁其如之何故因病受益者非有根器人不能(合纂)。",
        "translation": "People in the world think of illness as suffering, but the virtuous preceptor said that illness is a good medicine for sentient beings. Why is it true that a tangible body can't be without illness? When there's no illness, it's playful and carefree. Who is the enlightened one who only realizes that the four elements are not real, that human life is impermanent, and that the mindfulness of the path is twice as strong as the next, and that all thoughts are as cold as conscience, and that the isolation of conscience from previous good and evil deeds is a vivid manifestation that brooks no delusion and urgent retrieval?",
        "source": "X62n1172_006:0067b12_0",
        "is_bad_quality": false
    },
    {
        "source_sentence": "淨土晨鐘卷第六",
        "translation": "Jingtu mingling bell, vol. 6",
        "source": "X62n1172_006:0067b22_0",
        "is_bad_quality": false
    }
]