[
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第三十六",
        "from": "X04n0223_036:0245b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唐于闐國三藏沙門實叉難陀譯經",
        "from": "X04n0223_036:0245b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唐太原方山長者李通玄造論",
        "from": "X04n0223_036:0245b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唐福州開元寺沙門志寧釐經合論",
        "from": "X04n0223_036:0245b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "明法品第十八之餘",
        "from": "X04n0223_036:0245b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子菩薩摩訶薩住不放逸發大精進起於正念生勝欲樂所行不息於一切法心無依處於甚深法能勤修習入無諍門增廣大心佛法無邊能順了知令諸如來皆悉歡喜佛子菩薩摩訶薩復有十法能令一切諸佛歡喜何等為十一者精進不退二者不惜身命三者於諸利養無所希求四者知一切法皆如虗空五者善能觀察普入法界六者知諸法印心無倚著七者常發大願八者成就清淨忍智光明九者觀自善法心無增減十者依無作門修諸淨行佛子是為菩薩住十種法能令一切如來歡喜。",
        "from": "X04n0223_036:0245b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第三佛子已下至能令一切如來歡喜有十一行半經明行十種法諸佛歡喜分經云依無作門修諸淨行者以此無作門修法界虗空界行海徧周清淨故智無所為名之為修知根同事名之為行行無不利非作非生名為無作門也常處十方一切三界受生利俗而無染淨名之為淨行故。",
        "from": "X04n0223_036:0245b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子復有十法能令一切諸佛歡喜何者為十所謂安住不放逸安住無生忍安住大慈安住大悲安住滿足諸波羅蜜安住諸行安住大願安住巧方便安住勇猛力安住智慧觀一切法皆無所住猶如虗空佛子若諸菩薩住此十法能令一切諸佛歡喜。",
        "from": "X04n0223_036:0245c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第四佛子已下至諸佛歡喜有六行經明安住十法分已上佛歡喜分。",
        "from": "X04n0223_036:0245c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子有十種法令諸菩薩速入諸地何等為十一者善巧圓滿福智二行二者能大莊嚴波羅蜜道三者智慧明達不隨他語四者承事善友恒不捨離五者常行精進無有懈怠六者善能安住如來神力七者修諸善根不生疲倦八者深心利智以大乘法而自莊嚴九者於地地法門心無所住十者與三世佛善根方便同一體性佛子此十種法令諸菩薩速入諸地。",
        "from": "X04n0223_036:0245c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第五佛子已下至令諸菩薩速入諸地有八行經明行此十法速入諸地分經云有十種法令諸菩薩速入諸地者明雖於初發心住位而徧知諸住諸行諸迴向諸地法門為一即一切故一切即一故即因即果故即如善財童子見彌勒菩薩已彌勒還令却見文殊師利明因果不異不離故此亦如是從初發心位佛果地位一念齊進而亦不出一念中修成正覺佛因果及菩薩行悉圓滿故如善財一生龍女不出一剎那際三生成佛總相似故云一生成佛者明今生是父母分段身是信心及見道修行生捨分段身入變易生名為一生亦不出剎那際無古今性無分段性無變易性萬相如幻故如化故非生滅故無三世故以此初住徧脩諸位諸地故貫通諸法總一時一法多少延促自在無礙不出一剎那際故法如是故去情以智觀之可見經云與三世諸佛同一體性者為法身智慧同也三世廣大劫一念同三世諸佛普賢其行大智大悲圓滿同故。",
        "from": "X04n0223_036:0245c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】復次佛子諸菩薩初住地時應善觀察隨其所有一切法門隨其所有甚深智慧隨所修因隨所得果隨其境界隨其力用隨其示現隨其分別隨其所得悉善觀察知一切法皆是自心而無所著如是知已入菩薩地能善安住佛子彼諸菩薩作是思惟我等宜應速入諸地何以故我等若於地地中住成就如是廣大功德具功德已漸入佛地住佛地已能作無邊廣大佛事是故宜應常勤修習無有休息無有疲厭以大功德而自莊嚴入菩薩地。",
        "from": "X04n0223_036:0246a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第六復次佛子已下至而自莊嚴入菩薩地有十行經明入地勝進分。",
        "from": "X04n0223_036:0246a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子有十種法令諸菩薩所行清淨何等為十一者悉捨資財滿眾生意二者持戒清淨無所毀犯三者柔和忍辱無有窮盡四者勤修諸行永不退轉五者以正念力心無迷亂六者分別了知無量諸法七者修一切行而無所著八者其心不動猶如山王九者廣度眾生猶如橋梁十者知一切眾生與諸如來同一體性佛子是為十法令諸菩薩所行清淨。",
        "from": "X04n0223_036:0246a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第七佛子有十種法已下至所行清淨有八行經明淨行分經云知一切眾生與諸如來同一體性者三乘菩薩知一切眾生同有如來佛性理性此經知一切眾生同有如來一切種智之性如經下文有經卷如三千大千世界內在小眾生身中有人成佛破此微塵出此經卷言微塵許大眾生皆有佛一切種智故菩薩成佛化之總得如來一切種知故達理之智名一切智差別智名一切種智。",
        "from": "X04n0223_036:0246b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】菩薩既得行清淨已復獲十種增勝法何等為十一者他方諸佛皆悉護念二者善根增勝超諸等列三者善能領受佛加持力四者常得善人為所依怙五者安住精進恒不放逸六者知一切法平等無異七者心恒安住無上大悲八者如實觀法出生妙慧九者能善修行巧妙方便十者能知如來方便之力佛子是為菩薩十增勝法。",
        "from": "X04n0223_036:0246b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第八菩薩既得行清淨已下至十增勝法有八行經明昇進轉增分。",
        "from": "X04n0223_036:0246b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子菩薩有十種清淨願何等為十一願成熟眾生無有疲倦二願具行眾善淨諸世界三願承事如來常生尊重四願護持正法不惜軀命五願以智觀察入諸佛土六願與諸菩薩同一體性七願入如來門了一切法八願見者生信無不獲益九願神力住世盡未來劫十願具普賢行淨治一切種智之門佛子是為菩薩十種清淨願。",
        "from": "X04n0223_036:0246b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第九佛子已下至是為菩薩十種清淨願有七行半經明大願成行利生分。",
        "from": "X04n0223_036:0246c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子菩薩住十種法令諸大願皆得圓滿何等為十一者心無疲厭二者具大莊嚴三者念諸菩薩殊勝願力四者聞諸佛土悉願往生五者深心長久盡未來劫六者願悉成就一切眾生七者住一切劫不以為勞八者受一切苦不生厭離九者於一切樂心無貪著十者常勤守護無上法門。",
        "from": "X04n0223_036:0246c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十佛子已下至守護無上法門有七行經明行十法令大願圓滿分經云聞諸佛土悉願往生者不出塵中智徧現應供養十方一切諸佛而無來去。",
        "from": "X04n0223_036:0246c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子菩薩滿足如是願時即得十種無盡藏何等為十所謂普見諸佛無盡藏總持不忘無盡藏決了諸法無盡藏大悲救護無盡藏種種三昧無盡藏滿眾生心廣大福德無盡藏演一切法甚深智慧無盡藏報得神通無盡藏住無量劫無盡藏入無邊世界無盡藏佛子是為菩薩十無盡藏菩薩得是十種藏已福德具足智慧清淨於諸眾生隨其所應而為說法佛子菩薩云何於諸眾生隨其所應而為說法。",
        "from": "X04n0223_036:0246c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十一佛子菩薩滿足如是願已下至如應說法有九行經明十種無盡藏分。",
        "from": "X04n0223_036:0247a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】所謂知其所作知其因緣知其心行知其欲樂貪欲多者為說不淨瞋恚多者為說大慈愚癡多者教勤觀察三毒等者為說成就勝智法門樂生死者為說三苦若著處所說處空寂心懈怠者說大精進懷我慢者說法平等多諂誑者為說菩薩其心質直樂寂靜者廣為說法令其成就菩薩如是隨其所應而為說法為說法時文相連屬義無舛謬觀法先後以智分別是非審定不違法印次第建立無邊行門令諸眾生斷一切疑善知諸根入如來教證真實際知法平等斷諸法愛除一切執常念諸佛心無暫捨了知音聲體性平等於諸言說心無所著巧說譬喻無相違反悉令得悟一切諸佛隨應普現平等智身菩薩如是為諸眾生而演說法則自修習增長義利不捨諸度具足莊嚴波羅蜜道。",
        "from": "X04n0223_036:0247a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十二所謂知其所作已下至具足莊嚴波羅蜜道有十六行經明菩薩知根利益分。",
        "from": "X04n0223_036:0247a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】是時菩薩為令眾生心滿足故內外悉捨而無所著是則能淨檀波羅蜜具持眾戒而無所著永離我慢是則能淨尸波羅蜜悉能忍受一切諸惡於諸眾生其心平等無有動搖譬如大地能持一切是則能淨忍波羅蜜普發眾業常修靡懈諸有所作恒不退轉勇猛勢力無能制伏於諸功德不取不捨而能滿足一切智門是則能淨精進波羅蜜於五欲境無所貪著諸次第定悉能成就常正思惟不住不出而能銷滅一切煩惱出生無量諸三昧門成就無邊大神通力逆順次第入諸三昧於一三昧門入無邊三昧門悉知一切三昧境界與一切三昧三摩鉢底智印不相違背能速入於一切智地是則能淨禪波羅蜜於諸佛所聞法受持近善知識承事不倦常樂聞法心無厭足隨所聽受如理思惟入真三昧離諸僻見善觀諸法得實相印了知如來無功用道乘普門慧入於一切智智之門永得休息是則能淨般若波羅蜜示現一切世間作業教化眾生而不厭倦隨其心樂而為現身一切所行皆無染著或現凡夫或現聖人所行之行或現生死或現涅槃善能觀察一切所作示現一切諸莊嚴事而不貪著徧入諸趣度脫眾主是則能淨方便波羅蜜盡成就一切眾生盡莊嚴一切世界盡供養一切諸佛盡通達無障礙法盡修行徧法界行身恒住盡未來劫智盡知一切心念盡覺悟流轉還滅盡示現一切國土盡證得如來智慧是則能淨願波羅蜜具深心力無有襍染故具深信力無能摧伏故具大悲力不生疲厭故具大慈力所行平等故具總持力能以方便持一切義故具辯才力令一切眾生歡喜滿足故具波羅蜜力莊嚴大乘故具大願力永不斷絕故具神通力出生無量故具加持力令信解領受故是則能淨力波羅蜜知貪欲行者知瞋恚行者知愚癡行者知等分行者知修學地行者一念中知無邊眾生行知無邊眾生心知一切法真實知一切如來力普覺悟法界門是則能淨智波羅蜜佛子菩薩如是清淨諸波羅蜜時圓滿諸波羅蜜時不捨諸波羅蜜時住大莊嚴菩薩乘中隨其所念一切眾生皆為說法令增淨業而得度脫墮惡道者教使發心在難中者令勤精進多貪眾生示無貪法多瞋眾生令行平等著見眾生為說緣起欲界眾生教離欲恚惡不善法色界眾生為其宣說毗鉢舍那無色界眾生為其宣說微妙智慧二乘之人教寂靜行樂大乘者為說十力廣大莊嚴如其往昔初發心時見無量眾生墮諸惡道大師子吼作如是言我當以種種法門隨其所應而度脫之菩薩具足如是智慧廣能度脫一切眾生佛子菩薩具足如是智慧令三寶種永不斷絕。",
        "from": "X04n0223_036:0247a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十三是時已下至令三寶種永不斷絕有五十二行半經明行十波羅蜜利益眾生諸對治分經云諸次第定者色界四禪菩薩次第能入於無色界四禪菩薩悉能順入或超間入出如涅槃經闍維分說從初禪入三禪出空處入無所有出非想處入識處出如是超間如是次第如此經方網三昧一方入定十方起十方入定一方起等具如十信位中說三摩鉢底智印者明寂用同起印諸萬法無不明了如大海水而現萬像淨智普印一切萬法皆能了知而無能所亦無作者經云入真三昧者無三界及三乘染淨沈掉是也離諸僻見者有無二見是內見外見身見邊見戒取見取等總是乃至六十二見是六十二見者於一切法上計有四見一常二無常三亦常亦無常四非常非無常於五陰上各有四見四五二十三世五陰上合為六十本二見共為六十二見一切僻見不離此也經云善觀諸法得實相印者以無作無依無相大智印印諸萬法起唯法起無有無明三世計著名實相印普門慧者徧知眾生諸根及法智一切智智種種差別智也色界眾生為住定故教令起觀修無相觀者教微妙智慧為相不當情智慧利故。",
        "from": "X04n0223_036:0247c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】所以者何菩薩摩訶薩教諸眾生發菩提心是故能令佛種不斷常為眾生開闡法藏是故能令法種不斷善持教法無所乖違是故能令僧種不斷復次悉能稱讚一切大願是故能令佛種不斷分別演說因緣之門是故能令法種不斷常勤修習六和敬法是故能令僧種不斷復次於眾生田中下佛種子是故能令佛種不斷護持正法不惜身命是故能令法種不斷統理大眾無有疲倦是故能令僧種不斷復次於去來今佛所說之法所制之戒皆悉奉持心不捨離是故能令佛法僧種永不斷絕菩薩如是紹隆三寶一切所行無有過失隨有所作皆以迴向一切智門是故三業皆無瑕玷無瑕玷故所作眾善所行諸行教化眾生隨應說法乃至一念無有錯謬皆與方便智慧相應悉以向於一切智智無空過者菩薩如是修習善法念念具足十種莊嚴。",
        "from": "X04n0223_036:0248a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十四所以者何已下至念念具足十種莊嚴可有十八行經明令三寶種永不斷絕分六和敬法者一身二口三意四戒五施六見名為六和敬法於眾生田中下佛種子者示一切眾生菩提理智故及微少善根為勝緣故。",
        "from": "X04n0223_036:0248b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】何者為十所謂身莊嚴隨諸眾生所應調伏而為示現故語莊嚴斷一切疑皆令歡喜故心莊嚴於一念中入諸三昧故佛剎莊嚴一切清淨離諸煩惱故光明莊嚴放無邊光普照眾生故眾會莊嚴普攝眾會皆令歡喜故神通莊嚴隨眾生心自在示現故正教莊嚴能攝一切聰慧人故涅槃地莊嚴於一處成道周徧十方悉無餘故巧說莊嚴隨處隨時隨其根器為說法故菩薩成就如是莊嚴於念念中身語意業皆無空過悉以迴向一切智門若有眾生見此菩薩當知亦復無空過者以必當成阿耨多羅三藐三菩提故若聞名若供養若同住若憶念若隨出家若聞說法若隨喜善根若遙生欽敬乃至稱揚讚歎名字皆當得阿耨多羅三藐三菩提佛子譬如有藥名為善見眾生見者眾毒悉除菩薩如是成就此法眾生若見諸煩惱毒皆得除滅善法增長佛子菩薩摩訶薩住此法中勤加修習以智慧明滅諸癡闇以慈悲力摧伏魔軍以大智慧及福德力制諸外道以金剛定滅除一切心垢煩惱以精進力集諸善根以淨佛土諸善根力遠離一切惡道諸難以無所著力淨智境界以方便智慧力出生一切菩薩諸地諸波羅蜜及諸三昧六通三明四無所畏悉令清淨以一切善法力盛滿一切諸佛淨土無邊相好身語及心具足莊嚴以智自在觀察力知一切如來力無所畏不共佛法悉皆平等以廣大智慧力了知一切智智境界以往昔誓願力隨所應化現佛國土轉大法輪度脫無量無邊眾生。",
        "from": "X04n0223_036:0248b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十五何者為十已下至度脫無量無邊眾生有三十行經明以十種莊嚴令見者發心無空過分六通前已釋訖如十通品說十通如經具明。",
        "from": "X04n0223_036:0248c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】佛子菩薩摩訶薩勤修此法次第成就諸菩薩行乃至得與諸佛平等於無邊世界中為大法師護持正法一切諸佛之所護念守護受持廣大法藏獲無礙辯深入法門於無邊世界大眾之中隨類不同普現其身色相具足最勝無比以無礙辯巧說深法其音圓滿善巧分布故能令聞者入於無盡智慧之門知諸眾生心行煩惱而為說法所出言音具足清淨故一音演暢能令一切皆生歡喜其身端正有大威力故處於眾會無能過者善知眾心故能普現身善巧說法故音聲無礙得心自在故巧說大法無能沮壞得無所畏故心無怯弱於法自在故無能過者於智自在故無能勝者般若波羅蜜自在故所說法相不相違背辯才自在故隨樂說法相續不斷陀羅尼自在故決定開示諸法實相辯才自在故隨所演說能開種種譬喻之門大悲自在故勤誨眾生心無懈息大慈自在故放光明細悅可眾心菩薩如是處於高廣師子之座演說大法唯除如來及勝願智諸大菩薩其餘眾生無能勝者無見頂者無映奪者欲以難問令其退屈無有是處佛子菩薩摩訶薩得如是自在力已。",
        "from": "X04n0223_036:0248c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十六佛子已下至如是自在力已有二十三行經明菩薩初發心得與佛平等法堪為大法師分。",
        "from": "X04n0223_036:0249a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】假使有不可說世界量廣大道場滿中眾生一一眾生威德色相皆如三千大千世界主菩薩於此纔現其身悉能映蔽如是大眾以大慈悲安其怯弱以深智慧察其欲樂以無畏辯為其說法能令一切皆生歡喜何以故佛子菩薩摩訶薩成就無量智慧輪故成就無量巧分別故成就廣大正念力故成就無盡善巧慧故成就決了諸法實相陀羅尼故成就無邊際菩提心故成就無錯謬妙辯才故成就得一切佛加持深信解故成就普入三世諸佛眾會道場智慧力故成就知三世諸佛同一體性清淨心故成就三世一切如來智一切菩薩大願智能作大法師開闡諸佛正法藏及護持故。",
        "from": "X04n0223_036:0249a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十七假使有不可說世界廣大道場已下至及護持法故有十三行半經明處眾無畏說法自在身無映蔽分。",
        "from": "X04n0223_036:0249b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時法慧菩薩欲重宣其義承佛神力而說頌言。",
        "from": "X04n0223_036:0249b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第十八爾時已下可一行經明法慧以頌歎法分。",
        "from": "X04n0223_036:0249b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】　心住菩提集眾福　　常不放逸植堅慧　正念其意恒不忘　　十方諸佛皆歡喜　念欲堅固自勤勵　　於世無依無退怯　以無諍行入深法　　十方諸佛皆歡喜　佛歡喜已堅精進　　修行福智助道法　入於諸地淨眾行　　滿足如來所說願　如是而修獲妙法　　既得法已施羣生　隨其心樂及根性　　悉順其宜為開演　菩薩為他演說法　　不捨自己諸度行　波羅蜜道既已成　　常於有海濟羣生　晝夜勤修無懈倦　　令三寶種不斷絕　所行一切白淨法　　悉以迴向如來地　菩薩所修眾善行　　普為成就諸羣生　令其破闇滅煩惱　　降伏魔軍成正覺　如是修行得佛智　　深入如來正法藏　為大法師演妙法　　譬如甘露悉霑灑　慈悲哀愍徧一切　　眾生心行靡不知　如其所樂為開闡　　無量無邊諸佛法　進止安徐如象王　　勇猛無畏猶師子　不動如山智如海　　亦如大雨除眾熱【論】第十九如此以頌歎法中有二十行頌兩行一頌如文其義自具隨文稱歎。",
        "from": "X04n0223_036:0249b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】時法慧菩薩說此頌已如來歡喜大眾奉行。",
        "from": "X04n0223_036:0249c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第二十最下一行經明大眾聞法歡喜奉行分第四會夜摩天說十行法門此之一會昇夜摩天是序分從偈讚品已下是正說分動地興供是流通分。",
        "from": "X04n0223_036:0249c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "昇夜摩天宮品第十九",
        "from": "X04n0223_036:0249c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】將釋此品約作三門分別一釋品名目二釋品來意三隨文解釋一釋品名目者何故名夜摩天宮明以處表法此天名為時分天為此天無日月晦明以蓮華開為晝合為夜故名時分天故為表十行法門知時而應物化不可不知時故故以時分天以表知根而對經不可一向為也知是人天種二乘三乘一乘種知可以何善根而接引之故以時分天以表所行之行須以知時故須彌山以表十住之法門明以從信昇進離凡夫地故又表十住之位初登法頂至相盡處故又表須彌處大海中高八萬四千由旬非手足所攀緣而昇上故明初十住之位非以有心思求觀行攀緣所及以無思不為蕩然智應萬法無依方可昇也此十行位處夜摩之中明依空而住不與人連十行亦然依法空而行行知時而益俗也故處此天而表之也於兜率天說十迴向為明其處居欲界天之處中又明此天樂知足也以表十迴向以迴正智處俗利生處大悲門饒益一切於諸境界無所貪求故處此天以為所表昇他化天說十地法門者超過化樂明至欲界際表十地自在超昇化樂至欲界之頂化心魔王至欲盡際故昇第三禪說佛華法門明普賢行滿表以行法悅悅無盡眾生故又彰第四禪是佛位故此約進修昇降表法且如是安立然其理智一一徧周無去來也以此皆云不離菩提道場普光明殿而昇忉利夜摩兜率等如第三禪超初禪二禪者明位倍倍勝故此一會未有來文是纓絡本業經如來領聲聞菩薩眾向菩提樹下說往昔於此菩提樹下初成正覺時說法界經一一排次至第三禪故是故於此夜摩天以表十行第二釋品來意者前明十住昇進以昇須彌之頂此明十行之昇進以至夜摩以次此品須來第三隨文釋義者於中大意義分為二一長科經意二隨文解釋。",
        "from": "X04n0223_036:0249c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時如來威神力故十方一切世界一一四天下南閻浮提及須彌頂上皆見如來處於眾會彼諸菩薩悉以佛神力故而演說法莫不自謂恒對於佛爾時世尊不離一切菩提樹下及須彌山頂而向於彼夜摩天宮寶莊嚴殿時夜摩天王遙見佛來即以神力於其殿內化作寶蓮華藏師子之座百萬層級以為莊嚴百萬金網以為交絡百萬華帳百萬鬘帳百萬香帳百萬寶帳彌覆其上華蓋鬘蓋香蓋寶蓋各亦百萬周迴布列百萬光明而為照耀百萬夜摩天王恭敬頂禮百萬梵王踊躍歡喜百萬菩薩稱揚讚歎百萬天樂各奏百萬種法音相續不斷百萬種華雲百萬種鬘雲百萬種莊嚴具雲百萬種衣雲周帀彌覆百萬種摩尼雲光明照耀從百萬種善根所生百萬諸佛之所護持百萬種福德之所增長百萬種深心百萬種誓願之所嚴淨百萬種行之所生起百萬種法之所建立百萬種神通之所變現恒出百萬種言音顯示諸法時彼天王敷置座已向佛世尊曲躬合掌恭敬尊重而白佛言善來世尊善來善逝善來如來應正等覺唯願哀愍處此宮殿時佛受請即昇寶殿一切十方悉亦如是爾時天王即自憶念過去佛所所種善根承佛威力而說頌言。",
        "from": "X04n0223_036:0250a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　名稱如來聞十方　　諸吉祥中最無上　彼曾入此摩尼殿　　是故此處最吉祥　寶王如來世間燈　　諸吉祥中最無上　彼曾入此清淨殿　　是故此處最吉祥　喜目如來見無礙　　諸吉祥中最無上　彼曾入此莊嚴殿　　是故此處最吉祥　然燈如來照世間　　諸吉祥中最無上　彼曾入此殊勝殿　　是故此處最吉祥　饒益如來利世間　　諸吉祥中最無上　彼曾入此無垢殿　　是故此處最吉祥　善覺如來無有師　　諸吉祥中最無上　彼曾入此寶香殿　　是故此處最吉祥　勝天如來世中燈　　諸吉祥中最無上　彼曾入此妙香殿　　是故此處最吉祥　無去如來論中雄　　諸吉祥中最無上　彼曾入此普眼殿　　是故此處最吉祥　無勝如來具眾德　　諸吉祥中最無上　彼曾入此善嚴殿　　是故此處最吉祥　苦行如來利世間　　諸吉祥中最無上　彼曾入此普嚴殿　　是故此處最吉祥如此世界中夜摩天王承佛神力憶念往昔諸佛功德稱揚讚歎十方世界夜摩天王悉亦如是歎佛功德爾時世尊入摩尼莊嚴殿於寶蓮華藏師子座上結跏趺坐此殿忽然廣博寬容如其天眾諸所住處十方世界悉亦如是。",
        "from": "X04n0223_036:0250b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第一長科經意者此一品四十九行經中約作十段長科一爾時如來威神力故已下至恒對於佛有三行半經明十方同見如來不離其處分二爾時已下至寶莊嚴殿可有兩行經明不離十方一切菩提場普光明殿而昇夜摩天分三時夜摩天王已下至時彼天王敷置座已有十四行半經明時分天王遙見佛來化座莊嚴及恭敬分四向佛世尊已下至處此宮殿可兩行半經明時分天王請佛入殿昇座分五時佛受請已下至悉亦如是可有一行經明如來受請都結十方同然分六爾時天王已下有一行半經明天王憶昔往因說頌歎佛分七說頌之中有二十行頌歎十如來曾來入此天宮分八如此世界已下至歎佛功德有兩行半經明十方同此一時歎佛分九爾時世尊已下至諸所住處可兩行半經明如來受請入殿廣博寬容分十十方世界悉亦如是此總結十方同此分第二隨文解義者初爾時已下至恒對於佛明十方一切處恒徧滿無增減故言不離菩提樹須彌頂而昇夜摩天者明智徧一切處而示其身非去來故云遙見佛來者明從十住向十行位故即以神力化座者明行位依空智而所成無能所之建立故以座表行號曰蓮華明無作行成無所染著故藏者含容義明無行之行含藏眾善故師子者明無畏也以無為之理智處生死而無畏故此依主為座名百萬層級者明十住十千十行百萬明隨位昇進階級故百萬金網以為交絡者明此位中以行網教網化眾生故此為報得依果故十住十千十行百萬明昇進也華鬘香寶及四種帳明以四攝法方便行含攝眾生故又四種蓋明以四無量心慈悲喜捨覆蔭眾生故百萬光明而為照耀者明以智眼觀根而攝化故天王者行自在也恭敬頂禮者行行無慢也梵王踊躍者淨行利生見求乞者歡喜無厭也百萬菩薩稱揚者明以行濟物眾聖歡喜稱歎也天樂奏音者明善能說法所招果也四種雲以行慈覆俗前云蓋後云四種雲明約器大小覆育故摩尼雲亦然隨根大小照燭與益故百萬善根所生明已上莊嚴皆約行中善根所生故為行能利物積善即得諸佛覆護眾福所嚴已下如文可解云善來善逝者善滅眾惡苦灾逝者度眾生之離縛時佛受請昇座者明昇進正入十行位故已上望佛自德十方恒自徧周今作昇降者總約眾生進修昇降故二十行頌中歎十佛昔曾入此殿明今所入十行理智與古無殊此十如來還是約行昇進所成之號前十住位昇須彌頂十如來名號亦是隨位會古之號明所入之法不異古今諸佛故如十住位中須彌頂上帝釋宮中遙見佛來即於殿中安置普光明藏師子之座為明初入如來智慧中生即以方便三昧之門名安置普光明藏即明智慧照耀法界藏故令此十行位時分天王遙見佛來化作寶蓮華師子之座者明以行華設其教網漉諸眾生令入如來智之境界藏故蓮華表行無著義故化座者明行體以依十住智慧虗無法身安立也所作如化也以茲所表末後五行經都結十方同時歎佛如來入殿其殿包容如天所住者明入位昇進自智寬容方知佛境故。",
        "from": "X04n0223_036:0250c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第三十六",
        "from": "X04n0223_036:0251c04_0",
        "context_with_next_sentence": false
    }
]