[
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第一百十五唐于闐國三藏沙門實叉難陀譯經唐太原方山長者李通玄造論唐福州開元寺沙門志寧釐經合論入法界品第三十九之二十八【論】如善財童子問摩耶夫人得此解脫其已久如摩耶答言善男子乃往古世過不可思議非最後身菩薩神通道眼所知者唯佛能知故意明不可以時分知不可以劫數度也要須以佛智印冥同古今量盡始末見亡者能知其發心得法之久近若立始終之見者設將無盡剎微塵比之成數無由可悉設使展轉無盡無盡剎塵比之成數亦不可悉數亡計盡智現方知即無以數法算其遠近若以算法盡無盡劫算毛孔中虗空量了無得其邊際故以虗空無壽量故以此無量為得時也如文殊師利頌云一念普觀無量劫無去無來亦無住如是了知三世事超諸方便成十力此是最後身菩薩之大數也爾時劫名淨光表法身為劫體世界名須彌者得不動智為世界體雖有諸山五趣雜居然其國土眾寶所成清淨莊嚴無諸穢惡者唯其自心淨即一切境界淨萬法無垢作淨穢二見即自心見不淨也明大悲徧含五趣大智無染淨等見故名眾寶莊嚴有千億四天下者明萬行利生之位也有一四天下名師子幢者明大智徧周十方一境於中有八十億王城有城名自在幢者明八正道行十波羅蜜於中智所遊居名輪王所居號自在幢王名大威德者是智自在能治生死自不壞也彼王城北有道場名滿月光明者城北者北為坎位是師君智所居治迷之位也號道場能治執惑故名滿月光明其道場神名曰慈德者以智之化迷以慈悲為德有菩薩名離垢幢者法身起行性自無垢坐於道場將成正覺者欲成為將有一惡魔名金色光與其眷屬無量眾俱至菩薩所彼大威德轉輪王已得菩薩神通自在化作兵眾其數倍多圍遶道場諸魔惶怖悉自奔散者意明惡魔名金色光者法身智境真假一相一向離垢菩薩未明心境平等要假一切智王明觀心境理徹無二心境如幻一切境界幻智幻生即於境不迷妄想心魔總唯法界皆為佛事名為奔散道場神慈悲歡喜者法悅也道場神於彼王而生子想者明破見由智起行化俗由悲明此位智由慈悲所生故觀智如子乃至合會輪王者毗盧遮那是道場神我身是者明恐人不解其意託事像之令易解故終不可以心外別有境魔但明心無內外中間萬法自他同體一亦不一他亦不他只為法幽難顯借事表明諸有智者以譬喻得解乃至一切初發無上大菩提心皆先起大願大慈悲心教化眾生方求出要利眾生之行及至行滿此法不移其志一切諸佛皆如是先從大慈悲願行生故十方世界無量諸佛將成佛時皆於齋中放大光明來照我身及我宮殿屋宅者悲宮智殿養育為屋生死海為宅明齋處身之中一切眾生生長之際此處是含生生長之藏如樹根魁之際向上長莖榦枝條向下生根入地處陰陽之中際發生之元始又如甲子旬中以戍為天魁左生陽右生陰今齋中放光者表受生之元始如天魁之象起慈悲之始生大智之元故如人生亦爾初生少小漸長大者亦從齋輪起氣通於上下生長之性此處是受氣始生之元故從此放光也是其乾位是始終之際生長之元此齋中是也又表處智悲之中際成智之中即眉間毫相是成大悲之中即齋中是故此是十一地普賢處世利生門治十地中出世緣真利生不自在行不廣大障如十定品中諸菩薩求覓普賢三求不見者是隨大智之中行檀度為主總統法界波羅蜜海門也都言三世一切佛以慈悲為初生無慈悲利物有厭生死即是二乘及淨土菩薩後迴心始可歸真定性之流生多劫難返餘如經自具我唯知此菩薩大願智幻解脫者明推德升進有三門一示善友之處云在三十三天二有王名正念三王女名天主光汝往問菩薩行菩薩道。",
        "from": "X04n0223_115:0754c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第二三十三天正念天王女名天主光主智悲自在正念諸法無失現前門。",
        "from": "X04n0223_115:0755c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時善財遂往天宮見彼天女禮足圍遶合掌前住白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說天女答言善男子我得菩薩解脫名無礙念清淨莊嚴善男子我以此解脫力憶念過去有最勝劫名青蓮華我於彼劫中供養恒河沙數諸佛如來彼諸如來從初出家我皆瞻奉守護供養造僧伽藍營辦什物又彼諸佛從為菩薩住母胎時誕生之時行七步時大師子吼時住童子位在宮中時向菩提樹成正覺時轉正法輪現佛神變教化調伏眾生之時如是一切諸所作事從初發心乃至法盡我皆明憶無有遺餘常現在前念持不忘又憶過去劫名善地我於彼供養十恒河沙數諸佛如來又過去劫名為妙德我於彼供養一佛世界微塵數諸佛如來又劫名無所得我於彼供養八十四億百千那由他諸佛如來又劫名善光我於彼供養閻浮提微塵數諸佛如來又劫名無量光我於彼供養二十恒河沙數諸佛如來又劫名最勝德我於彼供養一恒河沙數諸佛如來又劫名善悲我於彼供養八十恒河沙數諸佛如來又劫名勝遊我於彼供養六十恒河沙數諸佛如來又劫名妙月我於彼供養七十恒河沙數諸佛如來善男子如是憶念恒河沙劫我常不捨諸佛如來應正等覺從彼一切諸如來所聞此無礙念清淨莊嚴菩薩解脫受持修行恒不忘失如是先劫所有如來從初菩薩乃至法盡一切所作我以淨嚴解脫之力皆隨憶念明了現前持而順行曾無懈廢善男子我唯知此無礙念清淨解脫如諸菩薩摩訶薩出生死夜朗然明徹永離癡冥未嘗惛寐心無諸蓋身行輕安於諸法性清淨覺了成就十力開悟羣生而我云何能知能說彼功德行善男子迦毗羅城有童子師名曰徧友汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子以聞法故歡喜踊躍不思議善根自然增廣頂禮其足遶無數帀辭退而去。",
        "from": "X04n0223_115:0755c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】王名正念者明智淨自在如天王正念者表淨智無念而自在任理施為不為而萬事自為明十一地淨智任運應現也在十住位中但名正念天子問其梵行未云有女至此十一地中名王又云有女明以智生悲也有女名天主光者表無作智中慈悲無染性任用利物也此位表智圓用無前後也取天表處生死中自在神化無方非即在於處所也敬申所求云我得菩薩解脫名無礙念意明無礙念者得三世無礙智一念印三世古今及未來一切眾生生死劫量及一切三世諸佛成道劫量一念徧知無不了然如今現前以無妄念智現前諸法本如是故此明無妄念之正念智也於中所有諸劫中諸佛之數於諸劫中或供養多佛或供養少佛增減不定者是一念中無念正智普皆供養三世諸佛之數此是無久近中久近之狀也總無時之大圓智境法自如是不由修生也修者但自照十二緣生達妄成智智無所修但自解迷真無可作亦無三世古今之性此是十一地中第二地善知識次十一地中第二地善知識已下總明正念中無礙智用徧周同行攝生之行身也此方如是十方一切世界例然六道等徧總從摩耶大悲海生以正念無作智為體也此是十一地中戒波羅蜜以智生悲門故女名天主光。",
        "from": "X04n0223_115:0756b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第三迦毗羅城徧友童子師主徧滿十方主世法師範門。",
        "from": "X04n0223_115:0756c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】從天宮下漸向彼城至徧友所禮足圍遶合掌恭敬於一面立白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說徧友答言善男子此有童子名善知眾藝學菩薩字智汝可問之當為汝說。",
        "from": "X04n0223_115:0756c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】迦毗羅城童子師此云黃色城也黃色者是中宮色故明為此童子師不離中道軌治俗典如此土孔丘之流明世間師範門如孔子頭頂下如返宇表處俗行謙之道以身表法像尼丘山似彼山頂中下非彼山因求祠而生此俗說非也姓孔者聖人無名無性以德立名為姓非以俗姓為姓約德以有寬明之德以之姓孔孔者寬也以行化蒙名之為丘丘者山岳之稱以艮為山為小男為童蒙因行所化而立名也故名丘也亦以德超過俗名之為丘亦至德尊重無傾動之質名之為丘生在兗州者艮之分也主以化小男童蒙之位兗州上值於角角為天門主眾善之門亦主以僧尼道士以乘角氣而生此非世凡流之能體故善財至此徧友不言而便令善財往眾藝所者師範之法正者不親教付之以助教不決之事問之以正師表德不孤必有鄰附贊成其化行也。",
        "from": "X04n0223_115:0756c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第四善知眾藝童子主徧周十方字智門。",
        "from": "X04n0223_115:0757a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時善財即至其所頭頂禮敬於一面立白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說時彼童子告善財言善男子我得菩薩解脫名善知眾藝我恒唱持此之字母唱阿字時入般若波羅蜜門名以菩薩威力入無差別境界唱多字時入般若波羅蜜門名無邊差別門唱波字時入般若波羅蜜門名普照法界唱者字時入般若波羅蜜門名普輪斷差別唱那字時入般若波羅蜜門名得無依無上唱邏字時入般若波羅蜜門名離依止無垢唱拕(輕呼)字時入般若波羅蜜門名不退轉方便唱婆(蒲我反)時入般若波羅蜜門名金剛場唱茶(徒解反)字時入般若波羅蜜門名曰普輪唱沙(史我反)字時入般若波羅蜜門名為海藏唱縛(房可反)字時入般若波羅蜜門名為普生安住唱哆(都我反)字時入般若波羅蜜門名圓滿光唱也(以可反)字時入般若波羅蜜門名差別積聚唱瑟吒字時入般若波羅蜜門名普光明息煩惱唱迦字時入般若波羅蜜門名無差別雲唱娑(蘇我反)字時入般若波羅蜜門名降霪大雨唱麼字時入般若波羅蜜門名大流湍激眾峯齊峙唱伽(上聲輕呼)字時入般若波羅蜜門名普安立唱他(他可反)字時入般若波羅蜜門名真如平等藏唱社字時入般若波羅蜜門名入世間海清淨唱鎻字時入般若波羅蜜門名念一切佛莊嚴唱拕字時入般若波羅蜜門名觀察簡擇一切法聚唱奢(尸苛反)字時入般若波羅蜜門名隨順一切佛教輪光明唱伎字時入般若波羅蜜門名修因地智慧藏唱叉(楚我反)字時入般若波羅蜜門名息諸業海藏唱娑(蘇紇反)多(上聲呼)字時入般若波羅蜜門名蠲諸惑障開淨光明唱壞字時入般若波羅蜜門名作世間智慧門唱曷攞多(上聲)字時入般若波羅蜜門名生死境界智慧輪唱婆(蒲我反)字時入般若波羅蜜門名一切智宮殿圓滿莊嚴唱車(上聲)字時入般若波羅蜜門名修行方便藏各別圓滿唱婆(蘇紇反)麼字時入般若波羅蜜門名隨十方現見諸佛唱訶婆(訶婆竝上聲呼)字時入般若波羅蜜門名觀察一切無緣眾生方便攝受令出生無礙力唱縒(七可反)字時入般若波羅蜜門名修行趣入一切功德海唱伽(上聲)字時入般若波羅蜜門名持一切法雲堅固海藏唱吒字時入般若波羅蜜門名隨願普見十方諸佛唱挐(妳可反)字時入般若波羅蜜門名觀察字輪有無盡諸億字唱娑(蘇紇反)頗字時入般若波羅蜜門名化眾生究竟處唱娑(同前)迦字時入般若波羅蜜門名廣大藏無礙辯光明輪徧照唱也(夷舸反)娑(蘇可反)字時入般若波羅蜜門名宣說一切佛法境界唱室者字時入般若波羅蜜門名於一切眾生界法雷徧吼唱侘(恥加反)字時入般若波羅密門名以無我法開曉眾生唱陀字時入般若波羅蜜門名一切法輪差別藏善男子我唱如是字母時此四十二般若波羅密門為首入無量無數般若波羅蜜門善男子我唯知此善知眾藝菩薩解脫如諸菩薩摩訶薩能於一切世出世間善巧之法以智通達到於彼岸殊方異藝咸綜無遺文字算數蘊其深解醫方呪術善療眾病有諸眾生鬼魅所持怨憎呪詛惡星變怪死屍奔逐癲癎贏瘦種種諸疾咸能救之使得痊愈又善別知金玉珠貝珊瑚琉璃摩尼硨磲鷄薩羅等一切寶藏出生之處品類不同價直多少村營鄉邑大小都城宮殿苑園嚴泉藪澤凡是一切人眾所居菩薩咸能隨方攝護又善觀察天文地理人相吉凶鳥獸音聲雲霞氣候年穀豐儉國土安危如是世間所有技藝莫不該練盡其源本又能分別出世之法正名辯義觀察體相隨順修行智入其中無疑無礙無愚暗無頑鈍無憂惱無沈沒無不現證而我云何能知能說彼功德行善男子此摩竭提國有一聚落彼中有城名婆呾那有優婆夷號曰賢勝汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子頭面敬禮知藝之足遶無數帀戀仰辭去。",
        "from": "X04n0223_115:0757a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】徧友云此有童子名善知眾藝學菩薩字智者明徧友是師童子是學者依教立名即如此方孔丘門人顏回之流善財致敬申請所求童子眾藝云我得菩薩解脫名善知眾藝我恒唱持此之字母唱阿字時此云無也入般若波羅蜜門名菩薩威力入無差別境明達一切法空門是菩薩威力斷一切障入無功智徧法界眾生界故唱多字時入般若波羅蜜門名無邊差別境是明一切諸有是差別智是普賢行徧知一切三界六道眾生中法則行解及所宜應化如是總有四十二般若波羅蜜門為首名為字母入無量無數般若波羅蜜門如文自明。",
        "from": "X04n0223_115:0757c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第五賢勝優婆夷主世間一切正邪吉凶諸方技術師筮博說一切總達利生門。",
        "from": "X04n0223_115:0758a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】向聚落城至賢勝所禮足圍遶合掌恭敬於一面立白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說賢勝答言善男子我得菩薩解脫名無依處道場既自開解復為人說又得無盡三昧非彼三昧法有盡無盡以能出生一切智性眼無盡故又能出生一切智性耳無盡故又能出生一切智性鼻無盡故又能出生一切智性舌無盡故又能出生一切智性身無盡故又能出生一切智性意無盡故又能出生一切智性功德波濤無盡故又能出生一切智性智慧光明無盡故又能出生一切智性速疾神通無盡故善男子我唯知此無依處道場解脫如諸菩薩摩訶薩一切無著功德行而我云何盡能知說善男子南方有城名為沃田彼有長者名堅固解脫汝可往問菩薩云何學菩薩行修菩薩道爾時善財禮賢勝足遶無數帀戀慕瞻仰辭退南行。",
        "from": "X04n0223_115:0758a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】賢勝優婆夷者明世醫方眾術世及出世莫不總明安物養生無法不了以居塵俗方便利生或作博說世筮玄占未達或作良醫善藥救世不安辯寶物以定真偽刊名言而釋文義奇才異智莫不普明鬼魅眾邪皆能制伏含普賢之智海等文殊之法身佛果處躬化靈萬有無方不至無剎不周無行不行無生不濟為慈悲故現作女身智無不明號為賢勝主禪波羅蜜門城名婆怛那者此云喜增益此以德立名以多饒益人多增喜事雞薩羅寶此寶如師子旋毛得無依處道場者法無依處身亦無依徧萬行故行無體故居南印度。",
        "from": "X04n0223_115:0758b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第六南方沃田城以堅固解脫長者主處世無者念清淨解脫門。",
        "from": "X04n0223_115:0758b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】到於彼城詣長者所禮足圍遶合掌恭敬於一面立白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說長者答言善男子我得菩薩解脫名無著念清淨莊嚴我自得是解脫已來於十方佛所勤求正法無有休息善男子我唯知此無著念清淨莊嚴解脫如諸菩薩摩訶薩獲無所畏大師子吼安住廣大福智之聚而我云何能知能說彼功德行善男子即此城中有一長者名為妙月其長者宅常有光明汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子禮堅固足遶無數帀辭退而去。",
        "from": "X04n0223_115:0758b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】南方有城名為沃田者以約此善友以智德澤資也人多善增德厚以立其名故長者名堅固解脫者明求法無懈如下自言爾時善財詣彼致敬申請所求長者云我得無著清淨念莊嚴明第六般若無相智慧莊嚴諸念即於一切法念自無著也。",
        "from": "X04n0223_115:0758c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第七沃田城妙月長者主處世淨智光明門。",
        "from": "X04n0223_115:0758c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】向妙月所禮足圍遶合掌恭敬於一面立白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說妙月答言善男子我得菩薩解脫名淨智光明善男子我唯知此智光解脫如諸菩薩摩訶薩證得無量解脫法門而我云何能知能說彼功德行善男子於此南方有城名出生彼有長者名無勝軍汝詣彼問菩薩云何學菩薩行修菩薩道是時善財禮妙月足遶無數帀戀仰辭云。",
        "from": "X04n0223_115:0758c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】此城中有一長者名妙月者明此中長者會第六無相智慧門以方便波羅蜜為一體故明十地已前第六地三空無相智慧門是出世間解脫十地已後十一地中三空寂滅智慧門是處世間成第七方便波羅蜜與大慈悲一體無二以從大慈悲母智幻所生此最後地十住十地中七八二位相融此十一地中六七兩位和融一體須知升進形勢如是善財往詣致敬頂禮申請所求妙月長者云我唯知此淨智光明解脫者是妙月長者約德立名慈悲智光是破惑義以破世間眾生惑故因慈悲利生破惑立名此明三空慈悲淨智總一體用圓滿故。",
        "from": "X04n0223_115:0758c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第八南方出生城無勝軍長者主無相法中得無盡相門。",
        "from": "X04n0223_115:0759a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】漸向彼城至長者所禮足圍遶合掌恭敬於一面立白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說長者答言善男子我得菩薩解脫名無盡相我以證此菩薩解脫見無量佛得無盡藏善男子我唯知此無盡相解脫如諸菩薩摩訶薩得無限智無礙辯才而我云何能知能說彼功德行善男子於此城南有一聚落名之為法彼聚落中有婆羅門名最寂靜汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子禮無勝軍足遶無數帀戀仰辭去。",
        "from": "X04n0223_115:0759a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】南方者依初釋有城名出生者表第八願波羅蜜出生諸法及眾行故長者名無勝軍者表勝一切無明憍慢生死邪見惡賊魔軍故善財往詣禮敬申請所求長者答云我得菩薩解脫名無盡相者明一切心境總如來相於一毛處念念出生無盡諸相無念理中智幻所生何有盡相。",
        "from": "X04n0223_115:0759a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第九出生城南法聚落最寂靜婆羅門主誠願語門。",
        "from": "X04n0223_115:0759b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】漸次南行詣彼聚落見最寂靜禮足圍遶合掌恭敬於一面立白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說婆羅門答言善男子我得菩薩解脫名誠願語過去現在未來菩薩以是語故乃至於阿耨多羅三藐三菩提無有退轉無已退無現退無當退善男子我以住於誠願語故隨意所作莫不成滿善男子我唯知此誠願語解脫如諸菩薩摩訶薩與誠願語行止無違言必以誠未曾虗妄無量功德因之出生而我云何能知能說善男子於此南方有城名妙意華門彼有童子名曰德生復有童女名為有德汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子於法尊重禮婆羅門足遶無數帀戀仰而去。",
        "from": "X04n0223_115:0759b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】此城南有一聚落名為法者眾人所居名之聚落以無體性名之為法取其寂靜名之中有婆羅門名最寂靜者姓之及名總皆寂靜表力波羅蜜隨俗不俗眾會不諠名為力用自在善財往詣致敬頂禮申請所求云我得菩薩解脫名誠願語者誠是實也明所願依言誠實無虗妄言此是信士語從心願所言依真而無虗誑語言體真也所願皆真故名句文及聲言辭及所說一切皆性真故此為解脫此是法師位表法界為聚落一切言說自真人法悉皆如然表言不虗也。",
        "from": "X04n0223_115:0759b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第十妙意華門城德生童子有德童女主智悲圓滿處世幻住門。",
        "from": "X04n0223_115:0759c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時善財童子漸次南行至妙意華門城見德生童子有德童女頂禮其足右遶畢已於前合掌而作是言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道唯願慈哀為我宣說時童子童女告善財言善男子我等證得菩薩解脫名為幻住得此解脫故見一切世界皆幻住因緣所生故一切眾生皆幻住業煩惱所起故一切世間皆幻住無明有愛等展轉緣生故一切法皆幻住我見等種種幻緣所生故一切三世皆幻住我見等顛倒智所生故一切眾生生滅生老病死憂悲苦惱皆幻住虗妄分別所生故一切國土皆幻住想倒心倒見倒無明所現故一切聲聞辟支佛皆幻住智斷分別所成故一切菩薩皆幻住能自調伏教化眾生諸行願法之所成故一切菩薩眾會變化調伏諸所施為皆幻住願智幻所成故善男子幻境自性不可思議善男子我等二人但能知此幻住解脫如諸菩薩摩訶薩善入無邊諸事幻網彼功德行我等云何能知能說時童子童女說自解脫已以不思議諸善根力令善財身柔輭光澤而告之言。",
        "from": "X04n0223_115:0759c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】此南方有城名妙意華門者妙智行華悉圓滿故表十一地十法滿也彼有童子名曰德生復有童女名曰有德此明智悲二行齊均無前却故童子童女者明智悲齊滿雖處世間無五欲想以居幻住故善財往詣頂禮致敬申請所求云我等證得菩薩解脫名為幻住者約佛境界眾生境界皆智幻所生住居幻境無實無虗無有識情心境皆亡性相無礙以智功德故幻生光影身土重重如因陀羅網身境重重十方身土境相相入無礙無礙十方世界智凡體徹無始無終圓古今而一性常住世間無所依止此明世間緣生性自離故真如虗妄假安立故妄體本無真無住故智無依止如虗空故以智報生皆幻住故有無自在隨智用故雖智體同空不處寂故智身無量等徧十方性無往來相光影故身土重重無大小故經云幻境自性不可思議。",
        "from": "X04n0223_115:0760a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第一百十五",
        "from": "X04n0223_115:0760a20_0",
        "context_with_next_sentence": false
    }
]