[
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第九十三",
        "from": "X04n0223_093:0623a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唐于闐國三藏沙門實叉難陀譯經",
        "from": "X04n0223_093:0623a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唐太原方山長者李通玄造論",
        "from": "X04n0223_093:0623a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唐福州開元寺沙門志寧釐經合論",
        "from": "X04n0223_093:0623a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "入法界品第三十九之六",
        "from": "X04n0223_093:0623a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第三海岸聚落善住比丘主修行住。",
        "from": "X04n0223_093:0623a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時善財童子專念善知識教專念普眼法門專念佛神力專持法句雲專入法海門專思法差別深入法漩澓普入法虗空淨治法瞖障觀察法寶處漸次南行至楞伽道邊海岸聚落觀察十方求覓善住見此比丘於虗空中來往經行無數諸天恭敬圍遶散諸天華作天妓樂幡幢繒綺悉各無數徧滿虗空以為供養諸大龍王於虗空中興不思議沈水香雲震雷激電以為供養緊那羅王奏眾樂音如法讚美以為供養摩睺羅伽王以不思議極微細衣於虗空中周迴布設心生歡喜以為供養阿脩羅王興不思議摩尼寶雲無量光明種種莊嚴徧滿虗空以為供養迦樓羅王作童子形無量婇女之所圍遶究竟成就無殺害心於虗空中合掌供養不思議數諸羅剎王無量羅剎之所圍遶其形長大甚可怖畏見善住比丘慈心自在曲躬合掌瞻仰供養不思議數諸夜叉王各各悉有自眾圍遶四面周帀恭敬守護不思議數諸梵天王於虗空中曲躬合掌以人間法稱揚讚歎不思議數諸淨居天於虗空中與宮殿俱恭敬合掌發弘誓願時善財童子見是事已心生歡喜合掌敬禮作如是言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何修行佛法云何積集佛法云何備具佛法云何熏習佛法云何增長佛法云何總攝佛法云何究竟佛法云何淨治佛法云何深淨佛法云何通達佛法我聞聖者善能誘誨唯願慈哀為我宣說菩薩云何不捨見佛常於其所精勤修習菩薩云何不捨菩薩與諸菩薩同一善根菩薩云何不捨佛法悉以智慧而得明證菩薩云何不捨大願能普利益一切眾生菩薩云何不捨眾行住一切劫心無疲厭菩薩云何不捨佛剎普能嚴淨一切世界菩薩云何不捨佛力悉能知見如來自在菩薩云何不捨有為亦復不住普於一切諸有趣中猶如變化示受生死修菩薩行菩薩云何不捨聞法悉能領受諸佛正教菩薩云何不捨智光普入三世智所行處時善住比丘告善財言善哉善哉善男子汝已能發阿耨多羅三藐三菩提心今復發心求問佛法一切智法自然者法善男子我已成就菩薩無礙解脫門若來若去若行若止隨順思惟修習觀察即時獲得智慧光明名究竟無礙得此智慧光明故知一切眾生心行無所障礙知一切眾生歿生無所障礙知一切眾生宿命無所障礙知一切眾生未來劫事無所障礙知一切眾生現在世事無所障礙知一切眾生言語音聲種種差別無所障礙決一切眾生所有疑問無所障礙知一切眾生諸根無所障礙隨一切眾生應受化時悉能往赴無所障礙知一切剎那羅婆牟呼栗多日夜時分無所障礙知三世海流轉次第無所障礙能以其身徧往十方一切佛剎無所障礙何以故得無住無作神通力故善男子我以得此神通力或於虗空中或行或住或坐或臥或隱或顯或現一身或現多身穿度墻壁猶如虗空於虗空中結跏趺坐往來自在猶如飛鳥入地如水履水如地徧身上下普出煙焰如大火聚或時震動一切大地或時以手摩觸日月或現其身高至梵宮或現燒香雲或現寶焰雲或現變化雲或現光網雲皆悉廣大彌覆十方或一念中過於東方一世界二世界百世界千世界百千世界乃至無量世界乃至不可說不可說世界或過閻浮提微塵數世界或過不可說不可說佛剎微塵數世界於彼一切諸佛國土佛世尊前聽聞說法一一佛所現無量佛剎微塵數差別身一一身雨無量佛剎微塵數供養雲所謂一切華雲一切香雲一切鬘雲一切末香雲一切塗香雲一切蓋雲一切衣雲一切幢雲一切幡雲一切帳雲以一切身雲而為供養一一如來所有宣說我皆受持一一國土所有莊嚴我皆憶念如東方南西北方四維上下亦復如是如是一切諸世界中所有眾生若見我形皆決定得阿耨多羅三藐三菩提彼諸世界一切眾生我皆明見隨其大小勝劣苦樂示同其形教化成就若有眾生親近我者悉令安住如是法門善男子我唯知此普速疾供養諸佛成就眾生無礙解脫門如諸菩薩持大悲戒波羅蜜戒大乘戒菩薩道相應戒無障礙戒不退墮戒不捨菩提心戒常以佛法為所緣戒於一切智常作意戒如虗空戒一切世間無所依戒無失戒無損戒無缺戒無雜戒無濁戒無悔戒清淨戒離塵戒離垢戒如是功德而我云何能知能說善男子從此南方有國名達里鼻茶城名自在其中有人名曰彌伽汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子頂禮其足右遶瞻仰辭退而行。",
        "from": "X04n0223_093:0623a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第三修行住從爾時善財童子已下至我唯知此普速疾供養諸佛成就眾生無礙解脫門有八十行經明入本位法門約分五段一念善知識所授之教二次第南行三詣善知識處四見善知識恭敬禮拜五正申所求見此比丘於虗空中來往經行者明不住上二界息心住念禪不住出三界禪不住不出故言來往經行十王恭敬供養明攝眾生行徧故表十波羅蜜行智自在故如王空中莊嚴約法空中起行報生龍王表智悲自在震雷明法音普震激電智慧破惑緊那羅王奏眾樂音明以法音悅樂一切眾生故摩睺羅伽是恭敬義阿脩羅是處生死海不沒義迦樓羅王作童子形婇女之所圍遶是離慢謙下智悲義羅剎王者是住生死海大悲守護眾生義夜叉王者是大智守護眾生義為能行於虗空速疾故如智自在速疾故梵天王恭敬義淨居天空中與宮殿俱表智悲自在含育義如是皆云不思議數者皆表行周眾有普徧含生故此第五正申所求中請菩薩所修十種佛法并求十種不捨之法具如經文時善住比丘告善財言已下是正授其法經云善男子我已成就菩薩無礙解脫者明得法空智慧在空中經行明不著靜亂於染淨二障不能留滯名為無礙解脫得解脫已若來若去若行若止隨順思惟觀察即時獲得智慧光明名究竟無礙從是已去即他心宿命神足等十無障礙明以法空觀察三界細習淨業現前即得此十無障礙法門此明以法空觀照力治三界習氣及出三界治習已自然而得此十無障礙法是故歎善財言今復發心求問佛法一切智法自然者法明佛法出世一切智法用照世間意明以所得法空用治染淨二習神通道力自然顯著一切自在皆自然現前已下准此至我唯知此普速疾供養諸佛成就眾生無礙解脫門是都結所入當位法門竟已下以明昇進前門此段以明將方便觀照門佛智自然智神通道力自至以此不捨方便而成就佛法不捨佛法而成菩薩行教化眾生此以忍波羅蜜為主餘九為伴此三比丘明入十住中得出三界解脫心還以比丘表之已下彌伽是俗人住居市肆明處煩闠而不亂故教諸人眾輪字莊嚴法門者明修世技文字令圓滿故意明先修出三界解脫方修世法住於生死故約智一位通修諸法約位偏修世智為明前三已得出三界解脫神通故先修出世方學世間明自在無業不染著世間故又以出世間智學世間智易明了故第二昇進前位中從如諸菩薩持大悲戒已下至辭退而去有九行半經約分為五門一歎推先德二示善知識所居之國三示其居處四舉知識之名五辭退而去國名達里鼻茶者其國在南印度境名義未譯彌伽此云能伏為出世智已恒現前世間智已得具足真俗二智已滿能伏邪見異論故名能伏亦名為雲以能有德陰俗雨法故故名為雲城名自在者明出世智已得現前於世名言義智自在故城名自在此依主立名也。",
        "from": "X04n0223_093:0624a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第四達里鼻荼國彌伽長者主生貴住。",
        "from": "X04n0223_093:0624c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時善財童子一心正念法光明法門深信趣入專念於佛不斷三寶歎離欲性念善知識普照三世憶諸大願普救眾生不著有為究竟思惟諸法自性悉能嚴淨一切世界於一切佛眾會道場心無所著漸次南行至自在城求覓彌伽乃見其人於市肆中坐於說法師子之座十千人眾所共圍遶說輪字莊嚴法門時善財童子頂禮其足遶無量帀於前合掌而作是言聖者我已先發阿耨多羅三藐三菩提心而我未知菩薩云何學菩薩行云何修菩薩道云何流轉於諸有趣常不忘失菩提之心云何得平等意堅固不動云何獲清淨心無能沮壞云何生大悲力恒不勞疲云何入陀羅尼普得清淨云何發生智慧廣大光明於一切法離諸闇障云何具無礙解辯才之力決了一切甚深義藏云何得正念力憶持一切差別法輪云何得淨趣力於一切趣普演諸法云何得智慧力於一切法悉能決定分別其義爾時彌伽告善財言善男子汝已發阿耨多羅三藐三菩提心耶善財言唯我已先發阿耨多羅三藐三菩提心彌伽遽即下師子座於善財所五體投地散金銀華無價寶珠及以上妙碎末栴檀無量種衣以覆其上復散無量種種香華種種供具以為供養然後起立而稱歎言善哉善哉善男子乃能發阿耨多羅三藐三菩提心善男子若有能發阿耨多羅三藐三菩提心則為不斷一切佛種則為嚴淨一切佛剎則為成熟一切眾生則為了達一切法性則為悟解一切業種則為圓滿一切諸行則為不斷一切大願則如實解離貪種性則能明見三世差別則令信解永得堅固則為一切如來所持則為一切諸佛憶念則與一切菩薩平等則為一切賢聖讚喜則為一切梵王禮覲則為一切天主供養則為一切夜叉守護則為一切羅剎侍衛則為一切龍王迎接則為一切緊那羅王歎詠讚歎則為一切諸世間主稱揚慶悅則令一切諸眾生界悉得安隱所謂令捨惡趣故令出難處故斷一切貧窮根本故生一切天人快樂故遇善知識親近故聞廣大法受持故生菩提心故淨菩提心故照菩薩道故入菩薩智故住菩薩地故善男子應知菩薩所作甚難難出難值見菩薩者倍更難有菩薩為一切眾生恃怙生長成就故為一切眾生拯濟拔諸苦難故為一切眾生依處守護世間故為一切眾生救護令免怖畏故菩薩如風輪持諸世間不令墮落惡趣故如大地增長眾生善根故如大海福德充滿無盡故如淨日智慧光明普照故如須彌善根高出故如明月智光出現故如猛將摧伏魔軍故如君主佛法城中得自在故如猛火燒盡眾生我愛心故如大雲降霔無量妙法雨故如時雨增長一切信根芽故如船師示導法海津濟處故如橋梁令其得渡生死海故彌伽如是讚歎善財令諸菩薩皆歡喜已從其面門出種種光普照三千大千世界其中眾生遇斯光已諸龍神等乃至梵天悉皆來至彌伽之所彌伽大士即以方便為開示演說分別解釋輪字品莊嚴法門彼諸眾生聞此法已皆於阿耨多羅三藐三菩提得不退轉彌伽於是還昇本座告善財言善男子我已獲得妙音陀羅尼能分別知三千大千世界中諸天語言諸龍夜叉乾闥婆阿脩羅迦樓羅緊那羅摩睺羅伽人與非人及諸梵天所有語言如此三千大千世界十方無數乃至不可說不可說世界悉亦如是善男子我唯知此菩薩妙音陀羅尼光明法門如諸菩薩摩訶薩能普入一切眾生種種想海種種施設海種種名號海種種語言海能普入說一切深蜜法句海說一切究竟法句海說一所緣中有一切三世所緣法句海說上法句海說上上法句海說差別法句海說一切差別法句海能普入一切世間呪術海一切音聲莊嚴輪一切差別字輪際如是功德我今云何能知能說善男子從此南行有一聚落名曰住林彼有長者名曰解脫汝詣彼問菩薩云何修菩薩行菩薩云何成菩薩行菩薩云何集菩薩行菩薩云何思菩薩行爾時善財童子以善知識故於一切智法深生尊重深植淨信深自增益禮彌伽足涕泗悲泣遶無量帀戀慕瞻仰辭退而行。",
        "from": "X04n0223_093:0624c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第一正入當位法門從爾時善財童子已下至妙音陀羅尼光明法門有六十七行經約分為十門一正念其所授之法思惟勝進二南行至處推覓彌伽三見已致敬禮畢四正申所求五彌伽速自下座五體投地敬初發心六散金銀華無價寶為座令善財坐上七稱讚善財而能發無上大菩提心為世所依八彌伽面門放光集眾九彌伽為眾說輪字品莊嚴門十彌伽授與善財妙音陀羅尼光明法門自我唯知此妙音陀羅尼已下是推德昇進彌伽所以速自下其座五體投地致敬善財言遽者疾也明彌伽敬能發大菩提心者與十方諸佛同一體性同一智慧同一解脫人天所依何得不敬以善財先於前三善知識已得出世菩提心已得同於十方諸佛法身根本智至彌伽所學世間差別言音名字句義智明世間俗智敬出世間真智慧故以明約真而有世間俗智即真俗自在故故城名自在是以彌伽敬彼善財所得諸佛出世間智慧是世間智慧根本故是以敬之以表俗諦差別智敬真諦根本智以俗智是根本智中起故令後學者貴出世道根本智故以根本智與一切眾生作無明生死之因果善財初覺彌伽敬之十方一切諸菩薩恒常頂禮初發心以貴初覺根本智是出三界智慧相應與一切諸佛智慧解脫同一體性故普賢行海因茲而起是故彌伽敬之而禮又表無知法慢故又此第四生貴住明三界業謝名生在佛家故第四地亦名生在佛家與此住位同知同得同見其法依本而安立之修學者初生後熟輪字品莊嚴法門者明於一名字法門於一音聲言音無二體名字無二性莊嚴種種名字以為助伴而與人天六道眾生說種種法門令生歡喜令得解脫然其不離無聲一聲無名一名為隨順眾生世間言詞故說一切世間諸法無時即以無名字為主即以有一切出世間法而為莊嚴若說無有出世間法時即有一切世間為莊嚴如是互為主伴互為莊嚴有無緣起皆無自性將用教化眾生隨根開解令得解脫眾生及名字言音皆無自性以此名字圓滿清淨音聲輪無所障礙以一音聲說無量名皆以一音聲與無量名無量字作體故即無量名無量字總是一字故以聲性無體故無量名字與一切聲作體故即以名字體自無能所分別性相故以眾生自無性故以此無聲之聲無名之名無說之說教化一切無性眾生令其破業至其本地又以無依之智無聲之聲無名之名猶如虗空徧一切六道眾生音聲同其類音為其說法令其歡喜然身心智慧名字六根總無受者說者然一字中徧含多字之義互為主伴然亦各不相知無彼無此故是故當知一切名字皆以有無二字互為緣起若說一切法有字時即一切有法自具無故自相成壞自有自無自在說一切法本自無即有法自具以有無自相成壞故即無與有自在以從有無無體如法緣生無盡名言互為主伴隨世安立更相成壞皆一一字中有無盡義猶如帝網影像相入若究之本源皆幻緣有各無主宰當知名不與聲作無聲不與名作字智慧本無猶如虗空徧一切處等眾生界以智體性隨其類音皆令歡喜而得解脫故名妙音陀羅尼光明法門此是第四生貴住善知識以精進波羅蜜為體餘九為伴若約智通修五位若約位偏修俗智輪字莊嚴法門前三善友明出世智慧以三比丘表之此彌伽及解脫長者二人明處世間解脫故還以俗士表之餘義如文自具第二昇進前位門中從如諸菩薩摩訶薩已下至辭退而行有十四行經約分為四門一推德於先二示其善友所在三舉善友之名四頂禮辭去此不推別有國土者但南行有一聚落明同處俗流以精進波羅蜜與禪波羅蜜大體不二故所以不別國也為此二友竝是俗流故明從真入俗以和會真俗無二門世與出世體無有二。",
        "from": "X04n0223_093:0625c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第五住林城解脫長者主具足方便住。",
        "from": "X04n0223_093:0626c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【經】爾時善財童子思惟諸菩薩無礙解陀羅尼光明莊嚴門深入諸菩薩語言海門憶念諸菩薩知一切眾生微細方便門觀察諸菩薩清淨心門成就諸菩薩善根光明門淨治諸菩薩教化眾生門明利諸菩薩攝眾生智門堅固諸菩薩廣大志樂門任持諸菩薩殊勝志樂門淨治諸菩薩種種信解門思惟諸菩薩無量善心門誓願堅固心無疲厭以諸甲冑而自莊嚴精進深心不可退轉具不壞信其心堅固猶如金剛及那羅延無能壞者守持一切善知識教於諸境界得不壞智普門清淨所行無礙智光圓滿普照一切具足諸地總持光明了知法界種種差別無依無住平等無二自性清淨而普莊嚴於諸所行皆得究竟智慧清淨離諸執著知十方差別法智無障礙往十方差別處身不疲懈於十方差別業皆得明了於十方差別佛無不現見於十方差別時悉得深入清淨妙法充滿其心普智三昧明照其心心恒普入平等境界如來智慧之所照觸一切智流相續不斷若身若心不離佛法一切諸佛神力所加一切如來光明所照成就大願願身周徧一切剎網一切法界普入其身漸次遊行十有二年至住林城周徧推求解脫長者既得見已五體投地起立合掌白言聖者我今得與善知識會是我獲得廣大善利何以故善知識者難可得見難可得聞難可出現難得奉事難得親近難得承接難可逢值難得共居難令喜悅難得隨逐我今會遇為得善利聖者我已先發阿耨多羅三藐三菩提心為欲事一切佛故為欲值一切佛故為欲見一切佛故為欲觀一切佛故為欲知一切佛故為欲證一切佛平等故為欲發一切佛大願故為欲滿一切佛大願故為欲具一切佛智光故為欲成一切佛眾行故為欲得一切佛神通故為欲具一切佛諸力故為欲獲一切佛無畏故為欲聞一切佛法故為欲受一切佛法故為欲持一切佛法故為欲解一切佛法故為欲護一切佛法故為欲與一切諸菩薩眾同一體故為欲與一切菩薩善根等無異故為欲圓滿一切菩薩波羅蜜故為欲成就一切菩薩所修行故為欲出生一切菩薩清淨願故為欲得一切諸佛菩薩威神藏故為欲得一切菩薩法藏無盡智慧大光明故為欲得一切菩薩三昧廣大藏故為欲成就一切菩薩無量無數神通藏故為欲以大悲藏教化調伏一切眾生皆令究竟到邊際故為欲顯現神變藏故為於一切自在藏中悉以自心得自在故為欲入於清淨藏中以一切相而莊嚴故聖者我今以如是心如是意如是樂如是欲如是希求如是思惟如是尊重如是方便如是究竟如是謙下至聖者所我聞聖者善能誘誨諸菩薩眾能以方便闡明所得示其道路與其津梁授其法門令除迷倒障拔猶豫箭截疑惑網照心稠林浣心垢濁令心潔白使心清淨正心諂曲絕心生死止心不善解心執著於執著處令心解脫於染愛處使心動轉令其速入一切智境使其疾到無上法城令住大悲令住大慈令入菩薩行令修三昧門令入證位令觀法性令增長力令修習行普於一切其心平等唯願聖者為我宣說菩薩云何學菩薩行修菩薩道隨所修習疾得清淨疾得明了時解脫長者以過去善根力佛威神力文殊師利童子憶念力故即入菩薩三昧門名普攝一切佛剎無邊旋陀羅尼入此三昧已得清淨身於其身中顯現十方各十佛剎微塵數佛及佛國土眾會道場種種光明諸莊嚴事亦現彼佛往昔所行神通變化一切大願助道之法諸出離行清淨莊嚴亦現諸佛成等正覺轉妙法輪教化眾生如是一切於其身中悉皆顯現無所障礙種種形相種種次第如本而住不相雜亂所謂種種國土種種眾會種種道場種種嚴飾其中諸佛現種種神力立種種乘道示種種願門或於一世界處兜率宮而作佛事或於一世界沒兜率宮而作佛事如是或有住胎或復誕生或處宮中或復出家或詣道場或破魔軍或諸天龍恭敬圍遶或諸世主勸請說法或轉法輪或般涅槃或分舍利或起塔廟彼諸如來於種種眾會種種世間種種趣生種種家族種種欲樂種種業行種種語言種種根性種種煩惱隨眠習氣諸眾生中或處微細道場或處廣大道場或處一由旬量道場或處十由旬量道場或處不可說不可說佛剎微塵數由旬量道場以種種神通種種言辭種種音聲種種法門種種總持門種種辯才門以種種聖諦海種種無畏大師子吼說諸眾生種種善根種種憶念授種種菩薩記說種種諸佛法彼諸如來所有言說善財童子悉能聽受亦見諸佛及諸菩薩不可思議三昧神變爾時解脫長者從三昧起告善財童子言善男子我已入出如來無礙莊嚴解脫門善男子我入出此解解門時即見東方閻浮檀金光明世界龍自在王如來應正等覺道場眾會之所圍遶毗盧遮那藏菩薩而為上首又見南方速疾力世界普香如來應正等覺道場眾會之所圍遶心王菩薩而為上首又見西方香光世界須彌燈王如來應正等覺道場眾會之所圍遶無礙心菩薩而為上首又見北方袈裟幢世界不可壞金剛如來應正等覺道場眾會之所圍遶金剛步勇猛菩薩而為上首又見東北方一切上妙寶世界無所得境界眼如來應正等覺道場眾會之所圍遶無所得善變化菩薩而為上首又見東南方香燄光音世界香燈如來應正等覺道場眾會之所圍遶金剛燄慧菩薩而為上首又見西南方智慧日普光明世界法界輪幢如來應正等覺道場眾會之所圍遶現一切變化幢菩薩而為上首又見西北方普清淨世界一切佛寶高勝幢如來應正等覺道場眾會之所圍遶法幢王菩薩而為上首又見上方佛次第出現無盡世界無邊智慧光圓滿幢如來應正等覺道場眾會之所圍遶法界門幢王菩薩而為上首又見下方佛光明世界無礙智幢如來應正等覺道場眾會之所圍遶一切世間剎幢王菩薩而為上首善男子我見如是等十方各十佛剎微塵數如來彼諸如來不來至此我不往彼我若欲見安樂世界阿彌陀如來隨意即見我若欲見栴檀世界金剛光明如來妙香世界寶光明如來蓮華世界寶蓮華光明如來妙金世界寂靜光如來妙喜世界不動如來善住世界師子如來鏡光明世界月覺如來寶師子莊嚴世界毗盧遮那如來如是一切悉皆即見然彼如來不來至此我身亦不往詣於彼知一切佛及與我心悉皆如夢知一切佛猶如影像自心如水知一切佛所有色相及以自心悉皆如幻知一切佛及以己心悉皆如響我如是知如是憶念所見諸佛皆由自心善男子當知菩薩修諸佛法淨諸佛剎積集妙行調伏眾生發大誓願入一切智自在遊戲不可思議解脫之門得佛菩提現大神通徧往一切十方法界以微細智普入諸劫如是一切悉由自心是故善男子應以善法扶助自心應以法水潤澤自心應於境界淨治自心應以精進堅固自心應以忍辱坦蕩自心應以智證潔白自心應以智慧明利自心應以佛自在開發自心應以佛平等廣大自心應以佛十力照察自心善男子我唯於此如來無礙莊嚴解脫門而得入出如諸菩薩摩訶薩得無礙智住無礙行得常見一切佛三昧得不住涅槃際三昧了達三昧普門境界於三世法悉皆平等能善分身徧一切剎住於諸佛平等境界十方境界皆悉現前智慧觀察無不明了於其身中悉現一切世界成壞而於己身及諸世界不生二想如是妙行而我云何能知能說善男子從此南行至閻浮提畔有一國土名摩利伽羅彼有比丘名曰海幢汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子頂禮解脫長者足右遶觀察稱揚讚歎思惟戀仰悲泣流淚一心憶念依善知識事善知識敬善知識由善知識見一切智於善知識不生違逆於善知識心無諂誑於善知識心常隨順於善知識起慈母想捨離一切無益法故於善知識起慈父想出生一切諸善法故辭退而去。",
        "from": "X04n0223_093:0626c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "【論】第一正入當位法門中從爾時善財童子已下至善男子我唯知此於如來無礙莊嚴解脫門而得入出有一百四十行半經於此段中約分十門一正念所授之法思惟勝進二漸次遊行十有二年至住林城三推求解脫長者四見已致敬正申所求五解脫長者即入菩薩三昧現其身中十方各十佛剎土答善財所請令其同入六解脫長者從定而起又以言說說其定中十佛境界大會道場七明解脫長者隨心應念諸佛現前八心念無體見佛如影九心無表裏徧至十方而無去來十善男子我於此如來無礙莊嚴解脫門而得入出是正示三昧之名及出入自在分自此已下是昇進前位云漸次遊行者明勝進不住於前法也十有二年者如前第二海門國海雲比丘住海門國十有二年明直觀十二緣以為出世間解脫以表比丘是求出世解脫故以生死海為佛體故善財來至此住林城漸次遊行十有二年為明於十二緣生法中行於世間然以十二緣生以為禪體以解脫長者是世間俗士表處俗行真名為解脫前海雲比丘不住生死觀十二緣生得出世心此解脫長者於十二緣生法中處於生死不壞緣生不著緣生故云遊行十二年是不住義故是生死涅槃無二義是生死涅槃無出沒義故若約智通治以十波羅蜜為體此約位別治以明同別自在以此第五禪波羅蜜門以法界自體無作禪中諸有緣生性自離故一切心境莫不自是法界無礙解脫禪定林故是故城名住林一切心境作而無用性自住故推求者觀察勝進也得見解脫長者者明以真會俗真俗自體本性解脫也見已五體投地真俗無依五位同會也亦明五蘊十二緣總禪林也合掌者真俗會而不二也已上以觀察禪定冥會已下以言更申所求已下入三昧十方各現十佛剎者明定體徧周圓滿故以十為圓數也又已下以從定中所見十佛如來及上首菩薩是三昧所現自位佛果及行故又已下隨念而見諸佛者以自心應真是佛故所念皆是佛境界更無餘也明自心是佛諸念總佛餘如文自具此是第五具足方便住以禪波羅蜜為體餘九為伴若以智境之中即五位通修若以約位之中偏治真俗靜亂二障會五蘊十二緣為法界性自禪用而無作緣生之定門以明一切世間心境總皆禪也第二明昇進前位中從如諸菩薩摩訶薩已下至辭退而去有十六行經約分為四門一推德於前二示善知識方所及國土三舉善知識名號四善財敬戀善友流淚辭去第一推德於前者明解脫長者推德於前位善知識有十種殊勝勸令善財進求加行第二南行如前初位已釋至閻浮提畔者明此位正心住是得出世間及處世間智慧神通之極畔故故云閻浮提畔唯得世間出世大悲心未得入俗同纏行圓滿大慈悲心故故以比丘表之於世間中出俗相故後位即明入俗大悲心圓滿即以優婆夷滿願表之有一國土名摩利伽羅者此梵本未譯有比丘名海幢者明約以德智慧如海能破眾生業惑處名之為幢幢者摧壞義故。",
        "from": "X04n0223_093:0628c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大方廣佛新華嚴經合論卷第九十三",
        "from": "X04n0223_093:0629b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "音切",
        "from": "X04n0223_093:0629b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "栗(力質切)。",
        "from": "X04n0223_093:0629b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "遽(渠預切)。",
        "from": "X04n0223_093:0629b11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唯(營癸切)。",
        "from": "X04n0223_093:0629b11_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "恃(市音)。",
        "from": "X04n0223_093:0629b11_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "垣(羽元切)。",
        "from": "X04n0223_093:0629b11_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "淚(力偽切)。",
        "from": "X04n0223_093:0629b11_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "著(知慮切)。",
        "from": "X04n0223_093:0629b11_6",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "拯(整音)。",
        "from": "X04n0223_093:0629b12_7",
        "context_with_next_sentence": false
    }
]