[
    {
        "source_sentence": "華嚴懸談會玄記卷第三十九",
        "from": "X08n0236_039:0394c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "蒼山再光寺比丘　普瑞集",
        "from": "X08n0236_039:0394c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏第九總釋名題等者總字二釋一所釋題為總故次疏云今初總題包於別義則一總題包眾多之別義此對所詮名總又疏序云大方廣佛華嚴經即無盡修多羅之總名以雖展至無盡皆名大方廣佛華嚴經故名總題此對能詮名總今且約對所詮故云包於別義即所釋之題名總也二云能釋疏文為總故謂十門疏文總解釋經之題目然總有二義一總者略也對下別解文義此釋題目但總略也二總者廣也對上疏序略釋名題字各二義今各以十義釋之故即廣也若約所釋題目為總者有所對望自在下文二釋之中後釋近宗以疏不云釋總名題其總字在上故知後解為正言後明品稱者以連總題因便釋之故貞元疏云第九釋經名題中先解經題後解品稱既言釋經名題明知品稱因便釋之。",
        "from": "X08n0236_039:0394c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏今初總題包於別義下上總釋名題總屬於疏文此中總題者對於別義總目於題也故與上之義不同言該難思之法門者即所包之別義何義不在題中而一一皆為入法之詮門故云法門問法既難思何假經疏名義答不因名義豈知難思非知難思何能入法故十忍品云了法不在言善入無言際而能示言說如響徧世間佛經安立既爾故今疏釋應然故經於無名之中強立七字之名疏於無言之內強說十門之義蓋文影略耳或可中字誤書蓋是名字不勞異釋。",
        "from": "X08n0236_039:0394c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏一通顯得名者此有多義解釋不同一云謂通顯諸經得名之異對彰此經得名不同則通在諸經二云廣明他經得名不同比對此經得名通局之異則通在正題以理盡圓故三云疏文通顯一題七字總從四複八單之義以得其名意謂今疏不約七字各別從一法得名故云通顯則通即是顯通顯之得名則通在疏文疏中雖舉諸經得名但是對顯體式故鈔云並非正要三解之中後一近宗。",
        "from": "X08n0236_039:0395a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔以人為名約明法之所由者如思益梵天所問經雖舉能問之人意明所問之法佛皆為說所問法故即人為明法之因由也餘可例知言以法為目下如般若經雖文詞浩博大意皆在般若正體餘亦例知上為人法立名之總意下皆別顯得名也。",
        "from": "X08n0236_039:0395a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔須達挐者下疏云亦云須達多正云賑無依義云給孤獨即長者之稱仁而聰敏積而能散拯乏濟貧哀孤恤老時美其德故立斯稱優填梵語此云出愛。",
        "from": "X08n0236_039:0395a16_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔如般若經者般若是實相體故神足是神通用故體是其定定能發通如足能行步故云神足十住是體斷結是用漸備即十地之因一切智德即是妙覺之果。",
        "from": "X08n0236_039:0395a19_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔如時非時經者彼經說冬春夏各四月每季分為八箇十五日總為二十四箇半月(與今俗法二十四氣相似謂一年四時每一時中分成兩節謂立春春至立夏夏至立秋秋至立冬冬至一節二氣有四十五日八節總二十四氣今准脚影出身法為度)以辨時非時經云冬初十五日七脚為時四脚半為非時(律鈔說隨人脚影量身影仍須午前七脚影名為時午後四脚半者即非時餘可准知又准毗羅三昧經早起諸天食時中日諸佛食時晚畜生食時暮鬼神食時佛令斷六趣因今同三世佛故論時非時也)第二箇十五日八脚為時六脚八指為非時第三箇十五日九脚為時七脚六指為非時第四箇十五日十脚為時八脚三指為非時第五箇十五日十一脚為時九脚四指為非時第六箇十五日十二脚為時十一脚六指為非時第七箇十五日十一脚半為時十脚三指為非時第八箇十五日十一脚為時九脚四指為非時(冬四月竟下取意引之)春初半月以十脚及八脚少三指第二半月以九脚半及七脚少三指第三半月以九脚及六脚少三指第四半月以八脚及五脚少三指第五半月以七脚及三脚少三指第六半月以六脚及三脚少三指第七半月以五脚及三脚少三指第八半月以四脚及二脚少一指(上皆有時非時之言下皆准知春四月竟)夏初半月以三脚及二脚少四指第二半月以二脚及一脚少五指第三半月以二脚半及一脚少三指第四半月以三脚及二脚少二指第五半月以四脚半及二脚半第六半月以五脚及三脚第七半月以五脚半及三脚半第八半月以六脚及四脚半(夏四月竟已上冬初半月從九月十六日至三十日已下如次准之若是時量午前向西影若非時量午後向東影)乃至如是諸比丘我已說十二月時非時為聲聞之所應作憐憫利益故(上皆經文恐學者欲知故備錄也勿厭繁文)然今鈔意但取依所說時立經名也言如密嚴經者上卷云如是我聞一時佛住出過欲色無色無想於一切法自在無礙神足力通密嚴之國非諸外道二乘行處等故並非正要下應有問云既是其類繁廣疏何不廣敘耶答意可知。",
        "from": "X08n0236_039:0395a22_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏如智論等即彼論大般若經囑累品處詺目此經為不思議解脫經故智論第一百卷云有不思議解脫經十萬偈問淨名經題下異名亦云不可思議解脫經寧知非是彼經耶答以彼論云十萬偈明是華嚴也問彼淨名經或有廣本寧知非彼耶答彼論又云佛說不思議解脫經時有五百羅漢雖在佛邊而不得聞或時得聞而不能用故知即是華嚴也。",
        "from": "X08n0236_039:0395c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔論曰下謂大乘教法有十種義相殊勝而重言殊勝者有二義一能說主及所說法皆殊勝故二或所詮殊勝故能詮亦殊勝也上殊勝是所詮下殊勝語是能詮此總標也下十准知一所依相者謂阿賴耶是染淨諸法所依故殊勝以其殊勝故如來言說亦殊勝也二所知相者體即徧計依他圓成是菩薩所知故殊勝如來依此言說亦殊勝也(下皆准知)三入所知相者體即唯識性謂聞思修三慧通漏無漏為能入所知相為所入今所入中唯識性故故彼本論釋第三入勝相云多聞所熏習依止非阿賴耶識所攝如阿賴耶識成種子正思惟所攝等四彼入因果者體即六波羅蜜彼論釋曰六波羅蜜雖是世法能引出世法能生唯識道故(意云修世間六度為因出世為果即此因果入彼唯識性故)五彼因果修差別者體即菩薩十地彼論云出世十種菩薩地名入因果修差別也(意謂即彼因果中取十地為修差別也)六增上戒者體即菩薩律儀論云菩薩所受持護禁戒名於修差別戒學相七增上心者體即諸定論云首楞伽摩虗空蘊等定說名心學相(上生鈔云彥曰梵語首楞嚴此云一切事究竟或云究竟堅固國西曰此是舊梵語若正應云首楞嚴摩三摩地此云虗空蘊等持等持即定也破蘊如虗空唯有法實性名虗空蘊之定從境彰名即是大乘證法空之定也)八增上慧者體即無分別名無分別相九彼果斷者體即無住涅槃十彼果智者體即三身論云如此三身是無分別智果若離自性身法身不成譬如眼根若離法身應身不成譬如眼識離根不成應知此二由所依能依故得相應若離應身已入大地菩薩無受用法樂若無受用法樂菩提資糧不應具足譬如見色若離應身化身不成若無化身諸菩薩在願樂位中聲聞瘦澁願樂初法修行皆不得成是故決應有三身言由此所說下對小乘未信大者故作是說今疏所引當第十勝相中論文也。",
        "from": "X08n0236_039:0395c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔離世間品十名下准下疏云初一約能詮依此生行故名為處餘九約所詮功能立稱二決彼行義定能感果故三證所證故四能證分明故五有智超勝故六悲興萬行故七一一圓融故八軌則具足故九即理涉事故十即事而真故故應尊重下勸學可知言出現品十名者下准下疏中立為五對一內深外絕對謂內證三德祕密藏故外則凡小不能測故二證寂開智對三現果成因對謂性淨萬德即是佛種今十門出現即示現義四越世順佛對世尚不知安能破壞此十通是佛分齊境五淨根演實對知生佛同源則能淨故隨緣不變之性諸佛本故而性相無礙因果圓融為不思議過此更無為究竟法前九別義後一總該。",
        "from": "X08n0236_039:0396a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏依今梵本者因明鈔云問彼土之言何名梵語答具云梵摩此云清淨謂諸梵天遠離諸欲光潔自在故云清淨昔時世界初成立時光音天下降閻浮因食地肥等飛騰不起尋便住此展轉染生以為人種本是梵胤故云梵也又印土人與梵天等言音無異故云梵也本是文本即貝多之經也。",
        "from": "X08n0236_039:0396b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔毗佛略云方廣者問梵云佛陀此云覺者此既有佛字何不翻有覺義耶答精微鈔云神變經說一切梵字有界有緣隨緣變生不定故為佛字是界餘字是緣以毗略助之譯為方廣以陀字助之譯為覺者有如此方言字是界若以人者助之便為儲字若但以青字助之便為請字有此所以不應致詰問勃陀云覺者存略應云勃何故云即佛字耶答此但梵音輕重以隨此方先已聞佛字生善故譯者順古但存佛字不云勃也既屬果人則已有者義華字汎言已含雜華嚴亦帶其飾義故皆存略而義無遺或可華嚴是體雜飾是用略用存體以順唐人言好略故言修多羅云經者問修多羅何不翻為契經但譯為經耶答今就敵體翻名但譯為經良以梵本無欲底之言故不譯為契若爾藏攝中疏亦無欲底何故譯為契耶答彼為單經字恐濫席經故加契言助以揀之今言華嚴經而無濫涉故不言契問何不敵體翻為聖教答兼順此方聖教亦為經故。",
        "from": "X08n0236_039:0396b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏前三異名等者梁論但語其數涅槃等大略呼之智論言其總法一與三傍呼異名云總第二不具云略或三名皆總相少略也不須總略別分二品十目多分從別義立名不能總該一切義理也。",
        "from": "X08n0236_039:0396c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔不得總該等者此有三節相躡而起顯不得為經總名一二品十目各從別義立名一一別名不得總該一部義理故不可立為經名應有問云若十目皆取得為經名否第二意答云不可具舉故亦不可為經名也意云不可十種別目皆舉共為一名也問若不可具舉准前十名疏中釋出現十目云前九別義第十總該前九皆為不思議究竟法也釋離世間品十目云初一能詮具下九故為具後九所詮一一別義故今若舉世間品之第一或出現品之第十已得其總何須備舉十名方為總耶故第三意答云雖各得其總唯局當品不通一部之總名出現十名總別局於出現一品離世十名總別唯局離世一品豈得下總結也。",
        "from": "X08n0236_039:0396c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏故今譯等者以立名本欲呼召一部能詮文言云經何故復言大方廣佛華嚴今由經詮彼義故以所詮六字而為經名一法即大方廣人即佛華嚴二法即大方廣佛喻即華嚴三具體即大方具用即方廣四有果即佛有因即華嚴復單悉周故云理盡義圓又理盡四復義圓八單故標經首。",
        "from": "X08n0236_039:0397a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔而具前四對之復者對前諸經四對之義皆具故設有時處等雖顯文似闕而約義以含謂時無別體依法假立時隨於法遍六字中處有四種大即法性土方即自受用土廣即他受用及變化土則何所不具問餘經立名皆依經說今此題目下經而無說處為依何立答以今經闕立名之文具本之中應具建立或如楞伽等經結集者立名未可詳定已上但汎論得名。",
        "from": "X08n0236_039:0397a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏二對辨開合者下謂此疏中以七字相對辨於開合於五對中有五重開合皆前合後開也一合則一題開為教義能詮教依所詮義設教義互相關涉(已下作對皆立關涉准此明之)問若依七字皆是能詮何以唯經字是教若各就所詮應皆是義何成一對答經字直呼一部能詮故是教也大等六字語一部下所詮即是義也又六字雖亦能詮別對經字是所詮故經義雖通所詮對上六字能詮義顯故成一對也二合則但是義故開則分為法喻又此中若約教迹鈔說有總別一對嚴字為總上五字皆別綱要云嚴字通能所人法等故三合則但是所喻之法開則分能所證言亦名境智一對者問梵言佛陀此云覺者即有覺之者為能證人可爾何亦名智答前約結歸其主為能證人今約克性唯智能證故亦名境智一對亦猶菩薩證得初地豈是假者證耶實即智能克證亦得說言菩薩證得或取人中別法為能證也四合則唯所證之法開則分為揀持以方廣名言遍轉故以大字揀之云大之方廣也言大之一字下探玄記云謂大字是能揀方廣為所揀此是揀義理應方廣是能持持於大義大字所持言揀大異小者謂此言方廣於大小中是大非小故大字為能揀方廣上持此大義言簡實異權者謂此言方廣於權實中是實非權故大字為能揀於表是實以經說廣大甚深法非權宗所明故此含六重權實一破相始教方廣為權立相始教方廣為實以彼但明空此說中道故二或立相為權破相為實彼但遍計為空此明依他亦空故三始為權終為實四終為權頓為實五漸為權頓為實六偏為權圓為實大字揀上諸權方廣持上諸實言簡果異因者謂此言方廣於因果中是果非因以是佛所證故大字為能揀既是果所證大非因位法餘方廣無此大故不名為果問下經正法廣陳豈不說因答雖說於因屬下華字今言方廣故為果所證也言亦是體用一對者或為體用一對開合如前然准教迹方者是相大字是性亦性相一對合亦所證開為真俗故五合則唯人開則分為因果謂以上四對於一題中從下向上七字已畢今第五對於前次第之外別取第三對中人為果而獨不成對又借下華字以喻其因即成因果一對也而云借者華字以屬前喻今又取華為喻因故云借也是以單用下結釋華字單合有異今具對佛字為果單以華字喻因也若合華嚴二字為喻體通喻上四字互嚴謂以人嚴法以法嚴人以體嚴用以用嚴體以性嚴相以相嚴性等皆曰華嚴也又單用華字及單用嚴字亦有互嚴義皆可通喻上四字如綱要云以德行之華嚴大方廣之法界成十身之佛果等如彼廣說又准教迹鈔亦以華為能嚴上四字是所嚴即能所一對已上前後總有十對(今疏七對一教義二法喻三人法四境智五揀持六體用七因果依教迹揀出三對一總別二性相三能所故總為十對)若約次第說者一經字是教上六是義即教義對二嚴字是總上五是別即總別對三華字為能嚴上四所嚴即能所對四華嚴是喻上四是法即法喻對五華字是因佛字是果即因果對六佛是能證人上三所證法即人法對七佛是能證智上三所證境即境智對八廣字是用上二是體即體用對九大字是揀方廣是持即揀持對一方字是相大字是性即性相對故此十對前能具後後不具前皆先汎明為合隨義分異為開開則教義等不同合則為教義一對等上來十對依於圓數且示方隅但理可通隨應作之故玄鏡云大方廣所證法也佛華嚴能證人也等。",
        "from": "X08n0236_039:0397a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔上德若谷等者明皇注云上德若谷者虗沿而容物大白若辱者純潔而含垢廣德若不足者大成而執謙建德若偷者立功而不衒質真若渝者淳一而和光大方無隅者不立小圭角大器晚成者且無近功大音希聲者不飾小言說大象無形者能應萬類道隱無名者功用不彰無名氏也夫唯道善貸且成者雖隱無名氏而實善以冲和妙用資貸萬物且成熟之意云下鈔主釋也餘但因便引之正用大方無隅之一句故唯釋此一句也言借其言用者意顯不取其義彼謂大道體無方隅故學道者不立小圭角今大方下明今意也。",
        "from": "X08n0236_039:0398a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔以嚴通能所下總標華為能嚴下別釋若約三大互嚴亦華為能嚴故言佛是嚴成之果者此有二義一望上三大之法以三大法嚴成佛果之人故以佛為所嚴三大為能嚴此亦應有以人嚴法影在上華為能嚴大方廣為所嚴之中二望下二句又以因望果佛亦所嚴此中影略以果嚴因以互嚴故故云華嚴二字合則亦喻上之四字也即釋嚴中者即下具彰義類釋嚴字中但互嚴義以為喻體至下具明。",
        "from": "X08n0236_039:0398a15_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏並略以十義釋之者問既是具彰義類又復云略其義何耶答一字法門海墨書而不盡雖各具彰十義以表無盡而云略者不亦宜乎然雖各以十義釋之而體式非一且分五節一大方廣三字各約義用類同釋故大則十皆常徧義同方則十皆軌持義同廣則十皆繁多義同二佛字約體全同釋以七字配於十義其體全同非是義同故三華字法喻相似釋以十佛義似於十華四嚴字能所互嚴釋字是體同故五經字局於當字釋然次下鈔云七字互釋而云經字十義不互釋者言總意別故體勢非一故顯義無定故或可雖不以餘六字釋經字然以經字釋餘六字故如教大等亦互釋也。",
        "from": "X08n0236_039:0398b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏一體大下即總融萬有無障礙理為體其相用等皆同真性一一具常徧之義言即是大字者意顯雖舉相用等常徧唯釋題中大字也。",
        "from": "X08n0236_039:0398b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔古人亦各十義等者探玄記云一境大二心大三行大四位大五因大六果大七體大八用大九教大十義大今明下清涼意以具德之法一文即具一切如海一滴具百川味亦復此滴非彼滴等今且於一題明之一部等文例可知也應從義顯且依緣起相由一門消文今用大字為緣餘六字為起所起不離能起所起全在能起之中故大字具餘六字皆是大字中六字故云則七字皆大非謂全失餘六字作大字以常徧為緣則軌持等義皆常徧互不相濫故玄鏡云具十無盡故稱大也若以體大為緣何法非體下皆准知故行願鈔云於七字中一一字皆有七字義。",
        "from": "X08n0236_039:0398b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔涅槃云所言大者下證上二義等者問經題汎云大字何知是體大耶答當經文闕取涅槃文為例以彼經佛自釋大涅槃經之名其釋大字既云常徧明是真如故知大字即體大也以起信釋體大即真如為體故是則用涅槃起信之文成華嚴之義妙之至也言先證常義即涅槃第三等者彼疏云佛告下歎教善隨其經文初中後別為上中下合法稱根能生行心故名為善第二句中義味深者名義為味不同餘處名字為味義能津心令人愛樂如世美味故名為味第三句中其文善者言詞才巧不增不減故曰文善第四句中純具梵行明其行圓寶藏無闕彰其理圓亦可純備彰其因圓寶藏無闕明其果滿經有此勝故勸奉持自下第二辨經名德令人樂持先總敕聽許為宣說下正說中有八復次初一正出經功德大者名之為常依於大名辨其大德此經具有六義釋大已如上辨(指彼第一疏也)今且以常義顯之如八大河下依涅槃名辨涅槃德先喻(其第三卷命品云一名恒河二名閻摩羅三名薩羅四名阿梨羅跋提五名摩訶六名辛頭七名博叉八名悉陀是八大河及諸小河悉入大海然此八大河謂阿耨達池四面各出一河為四大河四河流出去四十里各分出四通為二十河今唯言八者准勝鬘經東之五河人皆具見餘三大河名稱普聞十二小河不見不聞故但言八大河也)後合此經如是下破相趣寂此經所辨同前八河故云如是降伏煩惱離煩惱魔及諸魔性滅餘三魔然後下證實捨相以證實際除妄無妄可在云捨以相難捨如身命故或可安放身命如大涅槃中取契合義是故下總結之。",
        "from": "X08n0236_039:0398c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔故生公序云者引證也正取末文既云大矣所以稱常證上大具常義也故鈔云正順今意若釋彼文者謂自然真理以智證悟之時亦宜合符契所證之真理未證之時真則無差悟證之後所證真理豈容改易不易之體湛然寂而常照既其真理悟及未悟無有差別但從我迷情則乖背於真理所以真理之境事不在於我誠能涉入修求便返迷歸於極理雖歸極得本實無始起若實有初始則必有終盡若實有始終真常之理以之暗昧若尋其旨趣乃是我初會之非寂照之體在於今有寂照之體出於上古即是莫先於大也所以稱常既其常矣必滅於生死之累故云般泥洹也般泥洹即涅槃梵音之輕重也。",
        "from": "X08n0236_039:0399a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔涅槃第二十五下明深故名大今以深義成前常義故言以體絕常境者以雖曰常而出於念何可為常境而緣之耶或可絕於尋常之境總相顯其深義也言如人最長者即顯勝故名大今亦以勝義成前常義故言無有一法等者略鈔第三云是義勢之先後非時分之先後由是最先故稱大也如人最長以生在先故稱為大不約身量說大小也故老子云下引證也有物混成先天地生證其先義強名之曰大名也即大名之下有先義故釋曰下彼以虗無為道故名大先於天地而生故今不取彼義但以其大及之言可證此真理為諸法之本為大為先之義故引之也。",
        "from": "X08n0236_039:0399a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔四相品文下泥洹經云佛告迦葉菩薩具四德能為人說大泥洹經一自行非邪二能正他人三隨問而答四善因緣達識根性盡一卷經唯廣徵釋此四種法故云四相品也。",
        "from": "X08n0236_039:0399b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔故遠公下涅槃疏第二云先解大義釋之初言大者其性廣博以廣釋大二如人下以常釋大但喻無合與上文中所言大者名之為常其義相似三以勝釋大勝有二種初言是人若住正法名人中勝住正故勝後備德故勝。",
        "from": "X08n0236_039:0399b10_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔彼更有多下涅槃疏第一初云大義有六一常故名大故下文言大名為常二勝故名大如世勝人名為大人故下文言是人若能安住正法名人中勝勝故大涅槃如是三廣故名大故下文言大名廣博體窮法界名性廣博四多故名大故下文言譬如大藏多諸珍異涅槃如是多有種種妙法珍寶故名為大五高故名大故下文言譬如大山人不能上故名大山涅槃如是凡夫二乘乃至十住不能到故名之為大六深故名大如海淵深名為大海故下文言大者名不可思議淵深難測名不思議。",
        "from": "X08n0236_039:0399b15_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔今以多即約用下通妨也應有問云彼經既有多高等六義名大何故但引常徧耶故此釋也言多即約用者即三用大中收也此釋體大故不言多言高即約果者即四果大中收也此釋體大故不言高其餘深勝二義於常義中已含之也故唯遍常二義以釋體大。",
        "from": "X08n0236_039:0399c01_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔復是別文者以疏云其性廣博猶如虗空有似一處經文故揀別之上句其性廣博是一處文下句猶如虗空別是一處文也以虗空周徧喻理體周徧證成徧故名大也然准彼經合文言解脫亦爾似以虗空性無逼迫喻涅槃無逼迫之義今借其文但喻遍義思之可見。",
        "from": "X08n0236_039:0399c06_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏二者相大下但釋同別之相而大具常徧准前釋之。",
        "from": "X08n0236_039:0399c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔然遠公下揀濫也應有問云遠公約三種涅槃亦是體相用三與此何異耶於此揀云遠公三大通於因果以性淨涅槃凡聖皆有故今明佛所證法中有三大即唯果有也。",
        "from": "X08n0236_039:0399c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏謂業用普周等者行願疏云如體包徧故彼鈔云即前無邊之相以遍於體一一如體故成大用一一能包能徧一入一切為遍一切入一為包交參涉入互相無礙重重無盡也今周即周徧普即普包也。",
        "from": "X08n0236_039:0399c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔南經四相品下彼彼云迦葉復問下牒佛已說為問也若佛已度下執迹為難耶輸陀羅者此云持譽以是因緣下執迹疑實唯願已下請佛通釋下佛答之先呵難詞能建下釋釋意如何明納妃生子之事是大涅槃所起德用非實煩惱釋相如何汎舉涅槃所起德用類以釋之大般涅槃能建大義者總舉類答義猶用也建猶起也大般涅槃能起大用用相非一名建大義下廣辨之於中先敕聽勸說誡莫生疑下為說之文別有四一舉菩薩位大涅槃能建大義仰類如來二我已久住是大涅槃下正就如來能建大義初中有二初明菩薩證實起化乃至言菩薩住涅槃者於大涅槃隨分克證故名為住所入涅槃性是緣起作用之法是故入中無心化現乃至第二明佛能建義中初明如來住大涅槃種種化現已後經文廣說化現二十五有等(今缺引第四節也)。",
        "from": "X08n0236_039:0399c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔彼經即約果用下約彼此以揀別也言今意明即體之用者顯此經三大相即故此以廣字釋大字故言下佛果有下會釋也此有二釋一問彼經既約果用云何證此即體之用耶釋云下文佛果有相用者皆由本自有故故佛相用即是本有相用所以將果用證上即體之用也二或可問曰既七字互釋下文釋佛字十義佛果亦有相用即與彼經何別答此問佛果雖有相用皆本有故與彼別也二釋隨通。",
        "from": "X08n0236_039:0400a14_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏四果大謂智斷依正等者智即菩提斷即涅槃依即國土正即佛身普周法界者以徧釋大略其常義疏謂大智為主下餘行如盲智猶有目以智運行能到彼岸故智度論云說前五度譬如盲人第六般若事同有目若不得般若開導前五便墮惡道不成出世。",
        "from": "X08n0236_039:0400a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏七者教大下有二意一行願鈔云每說一會或一位義終皆結通云十方亦如是說故二精微鈔云謂此經中一文一句盡是通方之說故遍十方亦是稱性之談故通三際遍十方中十方通三際故云重重。",
        "from": "X08n0236_039:0400b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏八者義大十行願鈔云重重無盡固不在言隨相門中亦淺深備說二地中廣明十惡十善即該人天乘也四諦品及五地十重四諦即該聲聞乘也六地十重十二因緣即該緣覺乘也八部般若不出三天偈文涅槃法華出現品中一兩門說盡如斯事類不可具陳。",
        "from": "X08n0236_039:0400b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏九者境大下以所化眾生為境大故十者業大者即前能所文義化生為境能化之業常徧故。",
        "from": "X08n0236_039:0400b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔而言等者下科此鈔文大分為二初敘四論大性後今疏體大下以疏十大配彼七大性故言等取雜集者本論無著造釋論師子覺造而各別行後安慧菩薩雜糅合為一本名雜集論般若即無著所造金剛般若論也。",
        "from": "X08n0236_039:0400b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔不廣說之者此句是鈔詞也以彼以中但總相釋相大字云與七種大性共相應故而不別別廣說之耳。",
        "from": "X08n0236_039:0400b21_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔了知廣大等者梵言補特伽羅此云數取趣謂數數造業取於諸趣即目於人法目一切諸法即了人法二無我理故。",
        "from": "X08n0236_039:0400b23_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔此與瑜伽大同者一法全同二心即瑜伽發心三信解者謂信及勝解瑜伽唯勝解無信此小異也四淨心與瑜伽增上意樂名異義同精純唯善故是淨心此心無退進之不息即增上意樂也五六二名全同七果者即瑜伽圓證也。",
        "from": "X08n0236_039:0400c02_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔若與對法會者謂將般若論七大會上雜集七大性也一緣大教法即法性然若而為境故名境大性雜集二般若論心即雜集行大性發心為眾行之本故言即由淨心者淨字誤書應是發字或可發心離垢故曰淨心以發心中有大悲故無沉寂之垢行利他行有大智故無愛見等垢行自利行不錯無妨三般若論信解即雜集智大性於境印決即是勝解瑜伽於境決斷即名為智雜集理實則異無謬大同信亦澄清於境何謬略不言之不爾既言信解豈但勝解一法或信是勝解之果以因顯果故不言之四般若論淨心無惡雜故即雜集論精進大性瑜伽論增上意樂亦進之無退故此與前行二利淨心不同五般若論資糧即雜集論方便善巧由大悲故不住涅槃由大智故不住生死而為善巧方便與當所證無住涅槃為資糧故六般若時即雜集第七業大性窮生死際盡未來時故云時般若於是時中建立佛事而為作業故云業雜集七般若果即雜集第六證得大性(瑜伽謂圓證也)謂證佛功德云證得此即為果故雜集云果言雜集依體下揀別二論六七次第也問二論六七云何不次答雜集約依自證得之體起用無窮又雖得果而不捨因故證得居先業在於後般若論約時通因因時已能建立佛事至果極成乃至窮未來際即從其因義在前果義居後餘五大性雜集般若二論意同言依教起行下此總論七類大性從因至果之次第也一依教法為境二起大行心三智及信解於甚深理善通達故四以純淨心精進長時五由悲智為無住涅槃資糧善巧方便不滯生死涅槃二邊證大下還依雜集之次且從一義結故雜集即是對法者但名異爾前後互舉勿謂是兩論也以未雜糅時名對法已糅後名雜集也已上攝論但總標七大性餘三論雖各別明七大性義而雜集論兼廣釋之皆大同小異此上皆是他文。",
        "from": "X08n0236_039:0400c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔今疏總會下以疏十大配彼七大性故一體大即彼雜集第三智大中彼取能知曰智今取所知二無我理曰體也二相大者有二一或亦智大所知攝不離理體故恒河性德相即相入亦智所知故二亦般若論一法大性攝即教所詮亦為境故三用大即雜集第五方便善巧積集資糧而是即真體之用為教法之所詮亦境攝故四果大全同雜集證得及般若果故五因大已上疏中釋因大之文總攝彼五大性故一前疏云發菩提心鈔云即十信發心故即般若論心大性瑜伽論發心大性亦是雜集論行大性及本故非即行也二前疏云起解鈔云即十住位即攝瑜伽勝解大性雜集智大性般若信解大性以十住位智住真性故二前疏云行願證鈔云行是十行願是十向證是十地即攝雜集行大性雖有三位通望果證皆名行故是十地因下揀濫也問既云是證何非雜集證得大性故此答也四前疏云精勤匪懈鈔云通策於前即般若論第四淨心大性及雜集論精進大性五前疏云成就諸位即攝瑜伽及般若資糧大性及雜集方便善巧大性以前鈔指云次文當知故今對以明也六智大全同雜集第三智名而義小異以彼論釋但了二無我性此通了性相等故故前相大亦為所知七教大即雜集境大性瑜伽般若法大性八義大通前諸論所說六種大性但除雜集境大瑜伽般若法大性皆是教故九境大名同雜集初一境大性而義同般若論時大性及雜集方便善巧皆化生為境故十業大同般若論第六時大性而具含般若雜集二論時業二名言為對題中下謂題中七字十大為能攝今略十大二字三論七大性為所攝而云說十者為對能攝有十所攝七大亦開為十故也開合如上可知故云下結歸疏文也言或相大一種下問向明七大性義何有恒沙等相大耶故此答也此有二義一云彼既不說三大故相大一種般若雜集二論略無(瑜伽既大同般若故略不損也)上但依義且為是配二又通約十大唯是當宗彼明七大隨教各殊故無相大亦無失也問既教旨殊何得引彼釋此答而彼不離此是所流故以末顯本故今會他文明本末交映也。",
        "from": "X08n0236_039:0401a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏用多繁興等者約當字釋即是用多繁興若約前十皆多者但取廣多名多則前十皆多問體大何得復名用耶真性豈是多耶答約用為門則無法非用無障礙理豈礙多耶謂直談真體理實是一今望能依事法有多故所依體性隨事局故亦有多也即明一徧一切下以廣大二字相濫故此揀也大約徧義廣約攝義以分二字亦可反此者謂大攝廣徧亦得問大之與廣既皆有徧攝二義二字云何差別答大則徧攝皆體廣則徧攝皆用乃成天隔故精微鈔云以皆業用一稱體徧二稱體攝能稱徧攝俱名為廣所稱徧攝俱名為大。",
        "from": "X08n0236_039:0401c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏一廣依義者廣在能詮二廣說義者廣在所詮三廣破義者廣在所破故四廣超義者亦廣在所超以真如理無有諸法能比類故五廣治義者廣在能治諸行故六廣攝義者約所攝名廣故七廣德義者廣在所攝德勝故八廣生義者廣在所生之果故九廣絕義者廣在所絕心識等故十廣知義者亦於所知立名廣故。",
        "from": "X08n0236_039:0401c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔言前四即雜集下一節鈔文科分為三。",
        "from": "X08n0236_039:0402a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初具引二論以配疏文(二)",
        "from": "X08n0236_039:0402a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初引雜集(二)",
        "from": "X08n0236_039:0402a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初引論(言前)",
        "from": "X08n0236_039:0402a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二配疏(釋曰)",
        "from": "X08n0236_039:0402a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二引入大乘(二)",
        "from": "X08n0236_039:0402a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初引論(言後)",
        "from": "X08n0236_039:0402a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二配疏(釋曰)",
        "from": "X08n0236_039:0402a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二廣會二論顯其同異(三)",
        "from": "X08n0236_039:0402a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初就顯會相似(然其)",
        "from": "X08n0236_039:0402a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二破古失論意(而刊)",
        "from": "X08n0236_039:0402a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三正顯其同異(二)",
        "from": "X08n0236_039:0402a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初約大同以四攝六(若欲)",
        "from": "X08n0236_039:0402a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "後約小異並開為十(今取)",
        "from": "X08n0236_039:0402a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三釋疑歸題以彰互釋(二)",
        "from": "X08n0236_039:0402a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初釋疑(然為)",
        "from": "X08n0236_039:0402a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "後歸題(若欲)",
        "from": "X08n0236_039:0402a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔一切有情等者謂一切言教繁廣為所依處一切有情當得利益大乘即是能詮故疏云為生依故則廣在能詮為所依也二宣說是能說廣大甚深法即是所說之義故廣在所依三廣破諸障廣在所破故鈔云集論約所破此約能破以能破顯所破故四無法不超即廣在所超又所明法理雖廣皆有無比之義即廣在能超故行願鈔云言廣超者有二義一德相於世間法法法超過為廣二德相之法法法皆超世間為廣(上云法法是所超之世法下云法法是能超之德相)言此方廣等者結顯也意云此方廣廣破無比三名四義皆是大乘由義差別故立三名也准此雖只言方廣已能持大義可證前揀持一對中持義謂今既名無大字得屬大乘前揀實異權揀果異因等雖名無實果等字明依義判也。",
        "from": "X08n0236_039:0402a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔故對疏四次第無差者即前後次第也但今疏加一二等言次之耳。",
        "from": "X08n0236_039:0402a32_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔毗佛略者此云方廣是摩訶衍者起信鈔云具足應云摩訶衍那此云大乘但總揀小乘故此與前集論結顯意同雖有六種方廣皆是大乘差別名也言為諸眾生下即五廣治義此約能破能治前諸障故集論第三約所破故或所治唯是煩惱障故次鈔云一治煩惱言亦有眾多下即六廣攝義廣攝三乘五乘故言眾多乘也疏云通攝無邊異類法者即攝無量乘准別教說故所攝名廣言亦以多下即七廣德義福慧二嚴各具多德故云多嚴亦廣在所攝之德故言亦能出生下即八廣生義能生無量廣大果報故疏云果海者沒同果海故即廣在所生言非是下即九廣絕義非是一切分別言念所稱說度量故即廣在所絕故次鈔云體絕眾相不思議故行願鈔云以本性照體獨立不可以智知不可以識識故擬心即差言斷除下即十廣知義問論但云斷除邪見疏何立名為廣知耶答由斷智障故無所不知即廣在所知知即能知或可二論十義中三廣破五廣治十廣知皆通能所但第三總治二障第五別治煩惱第十別治所知以為異耳。",
        "from": "X08n0236_039:0402b01_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔釋曰下亦但前後次第全同但疏加五六等言次之耳。",
        "from": "X08n0236_039:0402b20_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔然其下就顯會其相似其字即指入論以近前引故不引名但云其也入論第一約所破集論第三約能破故同(應更有集論總入論別如上可知)集論第四約法為無比入論第五約心不能知故異也此上四義唯約名顯相似故揀也。",
        "from": "X08n0236_039:0402b22_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔而刊定下彼以入論第一同集論第三不分能所及總別故一失意也又以總揀之言為釋名之義二失意也。",
        "from": "X08n0236_039:0402c02_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔若欲下以大同故合也可知。",
        "from": "X08n0236_039:0402c04_6",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔今取小異下由小異故開也言入論二約所攝者約所說三五諸乘為所攝也言集論二約通辨下顯二論通別有異也以集論通明德果入論別開三四三約二嚴言通因者因亦有故言四約能生唯果者能字或錯疑是所字即約所生唯果若約能生不唯是果應是唯因也或可不錯以鈔中顯此能生通其二義若約能生唯因若約所生唯果互影略故故下歸題亦以廣生為因故學者細思言三約下顯總別有異集論總該二障入論別分二障言已如前會者即前鈔云集論約法不可比類此約心不能知故並不同。",
        "from": "X08n0236_039:0402c05_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔然為順下為有問云上廣十義何不如大方等各十義皆順一題之次第耶故此答也可知。",
        "from": "X08n0236_039:0402c16_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔若欲下即依題及義為次故字義開合不同言十廣說是義者說即詮說此有二義一若約所詮義為廣說即是上六字二若通能所詮為廣說即通上七字。",
        "from": "X08n0236_039:0402c18_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏解佛十義者下即用一題望於十佛約體全同配歸十佛以釋佛字即是七字皆佛也。",
        "from": "X08n0236_039:0402c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔十佛即是十身者准離世間品疏云然佛就內覺身多就相故立名不同耳言三昧佛即福德身者三昧福嚴中勝故餘義如前依主中辯。",
        "from": "X08n0236_039:0402c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔大即法界佛者行願鈔云若心若境法法皆佛名法界佛言方是本性下以方是稱性之德相智是本性之智德故全同也行願鈔云玄鑒深遠故即眾生本覺智慧心性之佛言廣即涅槃佛下以涅槃化身周徧法界故廣也行願鈔云即是化身化用自在故化畢歸寂故名涅槃佛謂應化涅槃也言亦隨樂等者隨佛大悲意樂及他見佛善根意樂無不現生故若貞元疏廣字亦即威勢身威勢亦是用故言佛是梵音下唐梵正相當故言華即願佛下以華喻因願及三昧正是其因故攝因屬果即是佛故言嚴即業報佛下取華字萬行因上總有能嚴之義成相好莊嚴身也言教法住持下以法住則佛住故教即住持佛也言心伏勝故者謂雖威勢能伏於他以心降伏最為殊勝如慈心降魔等行願鈔云萬法由心迴轉故心為威勢總攝七字若玄鏡中又配佛字以初成正覺威光赫奕映菩薩故應義通無執一文以為定也又前十身配於十佛亦但依義文不具說貞元疏云心佛即是化身隨心化故明知義無方也又圭峯圓覺鈔云十佛中初五及十局於果位餘該凡聖八簡散心九簡虗妄六七俱攝謂法界佛若心若境若性若相無非佛故其心者萬法雖眾不出一心唯心知覺故。",
        "from": "X08n0236_039:0403a02_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔然此五對一一相屬者謂以一切智斷煩惱障證一切法性能自開覺如睡夢覺以一切種智斷所知障達一切法相亦能開覺一切有情如蓮華開故五對一一相屬也或可初對了俗由於證真果位之中任運得俱不同因地有俱不俱故五對皆俱故云相屬。",
        "from": "X08n0236_039:0403b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔是根本智者以所證法性是諸法之根本乃是一切之智名一切智亦根本之智名根本智或此智與後得為根本了俗由證真故是根本即智言一切種智是後得智者由於所證俗諦有諸種類悉無謬故亦依主立名言後得智者以初入聖起無漏智必先起真智後起俗智亦後得即智問五地已去真俗雙運何名後得答既了俗由於證真依義次第名後得智。",
        "from": "X08n0236_039:0403b07_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔二所斷障中下非如二乘單斷不同因中未究竟斷煩惱障障理所知障障事煩惱障依我執起通於根隨煩惱即障所知障依法執起與根隨類同然依法起所知不是障被障障所知若據敵體而障正障其智今於所緣事境不能明了應名智障今從境立名云所知障是所知之障也。",
        "from": "X08n0236_039:0403b14_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔三所證理下謂所證理即是境故亦猶義之言境故知所證之理不唯真理謂一切法性即真法性遠離虗幻名諦一切法種類之相易知云俗此義不謬故亦名諦不同二乘及因位菩薩有未究竟故以所證二諦為佛也以一切智下對能證釋所證由所證彰所斷明上之三對復互相屬也。",
        "from": "X08n0236_039:0403b20_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔四所成益下自既能爾令他皆然不同二乘獨善及因中未能必然言上之下總揀上三對六法也此有二義一通二別初通者上三對六法俱通自利利他此盡理言之以能證所斷所證之中皆有二利故又自利本欲利他利他即是自利故後別義者從顯別配以一切智由斷煩惱證法性即自利上三皆能自開覺以一切種智斷所知障覺法相為利他上三皆是亦能開覺一切有情即前三對別別相屬此一對總相屬也。",
        "from": "X08n0236_039:0403c02_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔五顯覺相下顯自他開覺之相也近顯第四對之相既四包前三即通以喻顯前四對覺之行相也謂以覺字合一切智及所覺諸法之性以睡夢合所斷煩惱即是能自開覺之相也以華開合種智斷所知障以蓮子合所證法門即是亦能開覺一切有情之相也言前即覺察察深理故後即覺悟者悟諸法故亦可前是覺悟證悟徹源故後為覺察無非審的故。",
        "from": "X08n0236_039:0403c11_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔離覺覺者所謂離於能覺及於所覺雖無能所而雙非而無所不覺不礙兩存故云盡覺或雙泯能所沒同果海而盡覺故。",
        "from": "X08n0236_039:0403c18_6",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "鈔七事記中者即六成就中開聞及我謂二故言今並起之者先總釋勝義也一能覺下別明勝相天皷但能驚覺忉利天眾令知修羅賊軍來去安危佛令驚覺一切眾生種現習氣三種煩惱生滅有無二天皷能護自天眾破他修羅故息苦佛能救一切眾生苦苦壞苦行苦之三苦能破蘊魔天魔煩惱魔死魔之四魔也三天皷令天眾受色聲香味觸五欲之樂佛令一切眾生受涅槃樂四天鼓令天眾生貪愛縛著之心佛令眾生起無漏智或上四佛令眾生如次悟苦集滅道欲令知斷證修故勝天鼓也具此下總結。",
        "from": "X08n0236_039:0403c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔二不由他悟下以真智內發不從他得故云無師梵行品云成就慧身不由他悟疏云若見有他安稱為悟既曰心悟自亦不存寂而能知豈唯定之方寸不取況於人乎。",
        "from": "X08n0236_039:0404a08_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔三斷二無知下由二障故於真俗諦無由證知唯佛能盡斷故四已過下凡夫二障所覆故唯睡二乘所知障在故亦睡得單身空智實非究竟以為究竟是妄智故亦夢佛二障盡故不睡情謂斯絕故不夢五猶如下涅槃第九說如赤蓮華為日所照無不開敷即十地無漏行成如日照佛智自發如華開。",
        "from": "X08n0236_039:0404a12_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔六性淨無染下本性清淨不能染故應得之性因時雖有煩惱有五義故不染一離一切相故名為佛二性是能對治故意在能治故三佛性非是惑障安足處故非惑所住處故四性不變故涅即黑泥緇謂綵黑如白玉投於黑泥而不轉為黑色佛性在惑而不被染五妄惑熾然不能染實性如幻刀雖利不能斫石言因時下舉劣況勝前應得性時有惑尚不能染況至得果時惑盡無餘豈當有染耶。",
        "from": "X08n0236_039:0404a18_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔七具足三義即是三佛者三身也以化報法次第配之或就一佛身具三義故。",
        "from": "X08n0236_039:0404b02_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔八具足三德者永嘉大師云法身不痴即般若般若無著即解脫解脫寂滅即法身三德圓融舉一全收。",
        "from": "X08n0236_039:0404b04_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔同體三寶者謂具覺照義為佛具軌持義為法具和合義為僧也。",
        "from": "X08n0236_039:0404b06_6",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "▲鈔釋曰下釋疏略指之意一覺勝天皷即一切種智二不由他悟即一切智三斷二無知即離煩惱障及所知障等以有同佛地論故疏略指然有少別相故鈔具出也。",
        "from": "X08n0236_039:0404b07_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "華嚴懸談會玄記卷第三十九",
        "from": "X08n0236_039:0404b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "音釋",
        "from": "X08n0236_039:0404b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "賑(音軫富也)。",
        "from": "X08n0236_039:0404b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "填(徒堅切塞滿也)。",
        "from": "X08n0236_039:0404b16_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "瘦澁(上所以切損也下音色)。",
        "from": "X08n0236_039:0404b16_2",
        "context_with_next_sentence": false
    }
]