[
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經卷第三文句唐天竺沙門般剌密諦　譯經明菩薩沙彌古吳智旭　文句明菩薩比丘溫陵道昉　參訂二明六入性二初總徵二別釋。",
        "from": "X13n0285_003:0260b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0260b12_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次阿難云何六入本如來藏妙真如性。",
        "from": "X13n0285_003:0260b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "梵云鉢羅吠奢此云入亦云處根境二法俱名為入今但指六根然不曰根而曰入正取吸塵為義凡夫入三界六塵二乘入於真諦菩薩入於俗諦佛入中諦皆名為入此是因緣所生法即空即假即中故云本藏性也。",
        "from": "X13n0285_003:0260b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二別釋六初明眼入即藏性(至)六明意入即藏性。",
        "from": "X13n0285_003:0260b18_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0260b19_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難即彼目睛瞪發勞者兼目與勞同是菩提瞪發勞相因於明暗二種妄塵發見居中吸此塵象名為見性此見離彼明暗二塵畢竟無體如是阿難當知是見非明暗來非於根出不於空生何以故若從明來暗即隨滅應非見暗若從暗來明即隨滅應無見明若從根生必無明暗如是見精本無自性若於空出前矚塵象歸當見根又空自觀何關汝入是故當知眼入虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0260b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此六入文一一亦有四節今從初至名為見性是明因緣所生法即總示中所謂浮塵諸幻化相也次從此見離彼至何關汝入是明因緣即空即總示中所謂當處出生隨處滅盡性真常中求於去來迷悟生死了無所得也三是故當知眼入虗妄是明因緣假名即總示中所謂因緣和合虗妄有生因緣別離虗妄名滅幻妄稱相也四本非因緣非自然性是明因緣即中即總示中所謂其性真為妙覺明體本如來藏等也下比准此例知初文即彼目睛瞪發勞者承上色陰初文言之兼目與勞同是菩提瞪發勞相者人知瞪是目之勞相而不知此清淨目即是菩提之勞相也蓋上文借清淨目以喻菩提此則直指菩提本非目入但是依菩提真起目入妄不可喚目入妄作菩提真譬如依目起勞不可喚勞作目前云見見之時見非是見正謂此耳因於明暗二種妄塵發見居中吸此塵象名為見性者正顯目入是因緣所生法也第四卷云由明暗等二種相形於妙圓中黏湛發見見精映色結色成根根元目為清淨四大因名眼體如蒲萄朵浮根四塵流逸奔色即是此文註脚須知明暗二塵已屬空華無性況由此所發妄見及所結浮勝二根豈有實性可得所云發見居中者不過隨情說耳次文先直明其離塵無體次檢責其性本無生無體無生則因緣即空三文意顯說有眼入不過是幻妄稱相若非幻妄何故眾生洞視不過分寸那律觀於大千菩薩見百千界惟佛窮盡十方靡所不矚於此無差別性之中有此種種差別耶四文明其本即非因緣非自然之如來藏性故空假二義俱得成也惟其眼入即空假中故阿那律陀悟之名為樂見照明金剛三昧問曰經文非明暗來等舊皆用自他四性配釋今何不用答曰中論四性推檢無生實與此經妙合但經文顯示無生已甚分明何必更添名相。",
        "from": "X13n0285_003:0260c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明耳入即藏性。",
        "from": "X13n0285_003:0261a12_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難譬如有人以兩手指急塞其耳耳根勞故頭中作聲兼耳與勞同是菩提瞪發勞相因於動靜二種妄塵發聞居中吸此塵象名聽聞性此聞離彼動靜二塵畢竟無體如是阿難當知是聞非動靜來非於根出不於空生何以故若從靜來動則隨滅應非聞動若從動來靜即隨滅應無覺靜若從根生必無動靜如是聞體本無自性若於空出有聞成性即非虗空又空自聞何關汝入是故當知耳入虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0261a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "分文為四准上可知初文亦云瞪發勞相者若從字便此文應云塞發勞相下文應云畜發勞相等今從義便故皆用瞪字一者為顯真如不守自性妄為明覺喻之以瞪其法易明二者正顯無明一動六根遂成語不頓彰起非先後故也文皆易知惟其耳入即空假中故觀音悟之名為耳門圓照三昧。",
        "from": "X13n0285_003:0261a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三明鼻入即藏性。",
        "from": "X13n0285_003:0261b05_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難譬如有人急畜其鼻畜久成勞則於鼻中聞有冷觸因觸分別通塞虗實如是乃至諸香臭氣兼鼻與勞同是菩提瞪發勞相因於通塞二種妄塵發聞居中吸此塵象名齅聞性此聞離彼通塞二塵畢竟無體當知是聞非通塞來非於根出不於空生何以故若從通來塞則聞滅云何知塞如因塞有通則無聞云何發明香臭等觸若從根生必無通塞如是聞機本無自性若從空出是聞自當迴齅汝鼻空自有聞何關汝入是故當知鼻入虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0261b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文義可知惟其鼻入即空假中故周利槃特迦依此調心豁然得大無礙也。",
        "from": "X13n0285_003:0261b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四明舌入即藏性。",
        "from": "X13n0285_003:0261b17_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難譬如有人以舌舐吻熟舐令勞其人若病則有苦味無病之人微有甜觸由甜與苦顯此舌根不動之時淡性常在兼舌與勞同是菩提瞪發勞相因甜苦淡二種妄塵發知居中吸此塵象名知味性此知味性離彼甜苦及淡二塵畢竟無體如是阿難當知如是甞苦淡知非甜苦來非因淡有又非根出不於空生何以故若甜苦來淡則知滅云何知淡若從淡出甜即知亡復云何知甜苦二相若從舌生必無甜淡及與苦塵斯知味根本無自性若於空出虗空自味非汝口知又空自知何關汝入是故當知舌入虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0261b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初文因甜苦淡二種妄塵者略舉甜苦攝餘酸辛鹹等共為一種淡自為一種也次文虗空自味非汝口知者猶言非汝口中所知之味也方與下二句各成一意餘文可知惟其舌入即空假中故憍梵鉢提悟之名為一味清淨心地法門。",
        "from": "X13n0285_003:0261c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五明身入即藏性。",
        "from": "X13n0285_003:0261c09_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難譬如有人以一冷手觸於熱手若冷勢多熱者從冷若熱功勝冷者成熱如是以此合覺之觸顯於離知涉勢若成因於勞觸兼身與勞同是菩提瞪發勞相因於離合二種妄塵發覺居中吸此塵象名知覺性此知覺體離彼離合違順二塵畢竟無體如是阿難當知是覺非離合來非違順有不於根出又非空生何以故若合時來離當已滅云何覺離違順二相亦復如是若從根出必無離合違順四相則汝身知元無自性必於空出空自知覺何關汝入是故當知身入虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0261c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初文合覺之觸顯於離知者謂因合時有覺之觸顯於離時亦有身知也涉勢若成因於勞觸者若字訓作順字謂冷熱相涉之勢順其勝劣而成皆因二手相觸之勞相也次文離合違順二塵者離為一塵合中違順二相總名一塵下云四相不過隨意開合說耳餘文可知惟其身入即空假中故畢陵伽婆蹉悟之名為純覺遺身。",
        "from": "X13n0285_003:0261c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六明意入即藏性。",
        "from": "X13n0285_003:0262a03_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難譬如有人勞倦則眠睡熟便寤覽塵斯憶失憶為妄是其顛倒生住異滅吸習中歸不相踰越稱意知根兼意與勞同是菩提瞪發勞相因於生滅二種妄塵集知居中吸撮內塵見聞逆流流不及地名覺知性此覺知性離彼寤寐生滅二塵畢竟無體如是阿難當知如是覺知之根非寤寐來非生滅有不於根出亦非空生何以故若從寤來寐即隨滅將何為寐必生時有滅即同無令誰受滅若從滅有生即滅無誰知生者若從根出寤寐二相隨身開合離斯二體此覺知者同於空華畢竟無性若從空生自是空知何關汝入是故當知意入虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0262a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初文眠寤憶忘各有生住異滅四相初眠為生正眠為住將寐為異已寤為滅初寤為生正寤為住勞倦為異眠去為滅初憶為生正憶為住將忘為異忘竟為滅初忘為生正忘為住欲憶為異憶成為滅如此生住異滅總名顛倒無始習氣剎那不停如浪逐浪後不至前前七轉識之相類皆若此今意知根通則八識心王五十一種心所攝無不盡別則獨取第七末那恒審思量為體相者以當其名兼攝第八阿賴耶識以七八二識不相離故下文以思量兼了別性並舉正謂此也人知眠寤憶忘為意勞相而不知此意知根即是菩提勞相蓋此意知別無自體不過因於生滅妄塵黏湛發知知精映法攬法成根而已前云生住異滅此云生滅二塵者麤而言之生即攝住滅即攝異細而言之生滅二塵各具生住異滅四相生四相者欲生為生正生為住生已為異未生為滅滅四相者欲滅為生正滅為住滅已為異未滅為滅也集知居中者圓覺所謂妄有緣氣於中積聚假名為心意識為見聞順流緣於外塵獨頭意識為見聞逆流緣於內塵流不及地名覺知性者謂獨頭意識但能依於意根而緣內塵終不能反緣其根如眼有見不能觀眼此反緣不及之地名為覺知性也次文寤寐生滅二塵者寤寐各有生滅總稱二也令誰受滅猶云令誰知滅生即滅無猶云生即知隨滅相俱無若從根出者指肉團浮塵根也肉團寤寐二相不過隨身開合寤則如蓮華開寐則如蓮華合離斯寤寐二體別覓覺知體性毫不可得云何可說是從根生餘文可知惟其意入即空假中故須菩提悟之頓入如來寶明空海。",
        "from": "X13n0285_003:0262a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三明十二處性二初總徵二別釋。",
        "from": "X13n0285_003:0262b21_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0262b22_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次阿難云何十二處本如來藏妙真如性。",
        "from": "X13n0285_003:0262b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "處者方隅處所指眼耳等為內六處指色聲等為外六處凡夫以三界依正為處二乘以方便依正為處菩薩以實報依正為處佛以常寂光土依正為處處無實法即空假中故曰本藏性也此中破妄顯真惟眼色耳聲各各二法對破餘皆專破外塵以內六處前已破顯今意正在破外六塵故也。",
        "from": "X13n0285_003:0262b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二別釋六初明色與見即藏性(至)六明意與法即藏性。",
        "from": "X13n0285_003:0262c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0262c07_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難汝且觀此祇陀樹林及諸泉池於意云何此等為是色生眼見眼生色相阿難若復眼根生色相者見空非色色性應銷銷則顯發一切都無色相既無誰明空質空亦如是若復色塵生眼見者觀空非色見即銷亡亡則都無誰明空色是故當知見與色空俱無處所即色與見二處虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0262c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此中諸文亦各四節初云觀此樹林泉池者由汝觀故方知林泉由林泉故方顯汝觀此正舉出因緣所生之法即總示中所謂一切浮塵諸幻化相也次從於意云何至誰明空色正顯因緣即空三從是故當知至二處虗妄顯因緣假名四本非因緣非自然性顯因緣即中以對總示中文如前可知次文先雙徵次雙破破眼根生色相云見空非色色性應銷者既許色塵從眼生必許空塵亦從眼生是色以眼為性空亦以眼為性今見空之時既非是色則空性已起色性應銷以空色二性相反不容並立故也然設許色性銷亡則便一切都無既無色相亦何能顯明空質以空色二法又必相待故也空亦如是者見色非空空性應塞塞則顯發一切都實空相既無誰明色質也次破色塵生眼見云見空非色見即銷亡者既許見從色生則以色為見性觀空之時既非是色見性即應與色並銷然見性既亡則便一總都無又誰明此空色耶見從空生例此可知故不復設第三文中意顯十界見與色空俱無實處不過幻妄稱相第四正顯惟是隨緣不變不變隨緣之藏性也惟其色處即空假中故優波尼沙陀悟之塵色既盡妙色密圓。",
        "from": "X13n0285_003:0262c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明聽與聲即藏性。",
        "from": "X13n0285_003:0263a11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難汝更聽此祇陀園中食辦擊鼓眾集撞鐘鐘鼓音聲前後相續於意云何此等為是聲來耳邊耳往聲處阿難若復此聲來於耳邊如我乞食室羅筏城在祇陀林則無有我此聲必來阿難耳處目連迦葉應不俱聞何況其中一千二百五十沙門一聞鐘聲同來食處若復汝耳往彼聲邊如我歸住祇陀林中在室羅城則無有我汝聞鼓聲其耳已往擊鼓之處鐘聲齊出應不俱聞何況其中象馬牛羊種種音響若無來往亦復無聞是故當知聽與音聲俱無處所即聽與聲二處虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0263a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此中第二推破之文與前後諸文不同另為一局當知佛語巧妙大有所關今為出其言外之旨略有二意一者諸文彼此互彰意二者密顯此方教體意初意者若取前章法式以破耳聲應云此等為是耳生聲相聲生耳聞若復耳根生聲相者聞靜非聲聲性應銷銷則顯發一切都無聲相既無誰明靜相靜亦如是若復聲相生耳聞者聽靜非聲聞即銷亡亡則都無誰知動靜若取後章法式以破聲塵應云此聲為復生於汝耳生於鐘鼓為生於空若復此聲生於汝耳稱耳所生應從耳出耳非鐘鼓云何耳中有鐘鼓聲稱汝聞聲當於耳入耳中出聲說聞非義若生於空空性常恒聲應常在何藉他人擊鼓撞鐘若生鐘鼓鐘鼓常在應常出聲何須撞擊若生於桴應是桴聲非鐘鼓聲又桴亦常在聲應常出若生於手亦如桴破若生撞擊今除鐘鼓桴手虗空諸相之外安得別有撞擊體相體相尚無聲從何出是謂以彼彰此也又取此章法式以破色見應云此等為是色來眼邊眼往色處若復此色來眼邊者此色已來阿難眼處目連迦葉應不俱見何況一千二百五十沙門舉眼同見若復汝目往彼色邊仰觀日時汝目已往日處其餘諸色應皆不見又取此章法式以破香聞應云此等為是香來鼻邊鼻往香處若復此香來汝鼻邊目連迦葉應不俱聞若復汝鼻往彼香處忽有臭氣亦應不聞是謂以此彰彼也說此意者謂治眾生無量戲論習氣法應爾故次意者秪一鐘聲圓應一切而無匱陳那所謂妙音密圓秪一耳根圓聞一切而無雜觀音所謂圓照三昧故曰此方真教體清淨在音聞也或謂此是破妄不可約真心反難恐塞悟門此大不然佛之破妄元為顯真倘於此處瞥悟正暢如來說法本懷耳若無來往亦復無聞者謂若計音聞各有實處而無往來則又不成聞矣惟其聲處即空假中故憍陳那於此悟明四種四諦具如下文所明。",
        "from": "X13n0285_003:0263a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三明齅與香即藏性。",
        "from": "X13n0285_003:0263c07_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難汝又齅此爐中旃檀此香若復然於一銖室羅筏城四十里內同時聞氣於意云何此香為復生旃檀木生於汝鼻為生於空阿難若復此香生於汝鼻稱鼻所生當從鼻出鼻非旃檀云何鼻中有旃檀氣稱汝聞香當於鼻入鼻中出香說聞非義若生於空空性常恒香應常在何藉爐中爇此枯木若生於木則此香質因爇成煙若鼻得聞合蒙煙氣其煙騰空未及遙遠四十里內云何已聞是故當知香鼻與聞俱無處所即齅與香二處虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0263c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第二文破若生於木有縱有奪初云則此香質因爇成煙若鼻得聞合蒙煙氣乃順凡情而縱許之次云其煙騰空未及遙遠四十里內云何已聞乃以現量而奪破之蓋凡情不了一切惟心香性即如來藏不過循業發現而妄計香木有殊勝力故以鼻不蒙煙破其不從木生亦是另為一局若據常式應云若生於木則木常應發香何藉火爇然後聞氣若生於火火應自香何須香木又離枯木火尚無體云何發香餘皆可知惟其香處即空假中故香嚴童子悟之妙香密圓。",
        "from": "X13n0285_003:0263c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四明甞與味即藏性。",
        "from": "X13n0285_003:0264a03_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難汝甞二時眾中持鉢其間或遇酥酪醍醐名為上味於意云何此味為復生於空中生於舌中為生食中阿難若復此味生於汝舌在汝口中秪有一舌其舌爾時已成酥味遇黑石蜜應不推移若不變移不名知味若變移者舌非多體云何多味一舌之知若生於食食非有識云何自知又食自知初同他食何預於汝名味之知若生於空汝噉虗空當作何味必其虗空若作鹹味既鹹汝舌亦鹹汝舌則此界人同於海魚既常受鹹了不知淡若不識淡亦不覺鹹必無所知云何名味是故當知味舌與甞俱無處所即甞與味二俱虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0264a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文皆可知惟其味處即空假中故藥王藥上悟之位登菩薩。",
        "from": "X13n0285_003:0264a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五明身與觸即藏性。",
        "from": "X13n0285_003:0264a17_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難汝甞晨朝以手摩頭於意云何此摩所知誰為能觸能為在手為復在頭若在於手頭則無知云何成觸若在於頭手則無用云何名觸若各各有則汝阿難應有二身若頭與手一觸所生則手與頭當為一體若一體者觸則無成若二體者觸誰為在在能非所在所非能不應虗空與汝成觸是故當知覺觸與身俱無處所即身與觸二俱虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0264a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此之觸塵較色聲香味四塵虗妄是一相貌不同必由能知方顯所觸以其身未觸時僅名色法故也此中第二破妄亦異常式若據常式應云此痛為復因於棒生因於身生因虗空生若因棒生棒則自痛何預汝身若因身生何須待棒若因空生空性常恒痛應常在又空自痛身何所知又計身棒合生者以身倚棒即應有痛何須待打若離生者離無所觸云何痛生乃至若從打生除却人手棒及虗空并汝身相打何體相打尚無體云何生痛今不用此破法別就一身能所互奪倍為親切言誰為能觸者此以有知為能觸無知之物為所觸也故能在於手則頭便無知如木石之但為所觸不復成能若能在於頭則手便無用亦如木石但為所觸不復名能若頭與手各各有一能知觸者則成二知應有二身若頭與手一觸所生猶言共一知觸之體既惟一觸則頭手無二若頭手無二觸便無成以二物相合方有觸故若頭與手既是二體則此觸塵畢竟安在在能則不在所在所則不在能身中求於觸處了不可得不應虗空與汝成觸也能所二句交合頭手二事若以頭為能者觸在頭則不在手在手則不在頭若以手為能者觸在手則不在頭在頭則不在手餘文可知惟其觸處即空假中故跋陀婆羅悟之妙觸宣明。",
        "from": "X13n0285_003:0264b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六明意與法即藏性。",
        "from": "X13n0285_003:0264c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難汝常意中所緣善惡無記三性生成法則此法為復即心所生為當離心別有方所阿難若即心者法則非塵非心所緣云何成處若離於心別有方所則法自性為知非知知則名心異汝非塵同他心量即汝即心云何汝心更二於汝若非知者此塵既非色聲香味離合泠煖及虗空相當於何在今於色空都無表示不應人間更有空外心非所緣處從誰立是故當知法則與心俱無處所則意與法二俱虗妄本非因緣非自然性。",
        "from": "X13n0285_003:0264c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初文云意中所緣者法名內塵秪是前五塵之生滅影事於世諦中亦無別體故也分別法性則有三種一是善性通漏無漏人天十善色無色定名有漏善四聖法界所有戒定慧等名無漏善二是惡性通界內外見思相應種種諸業名界內惡塵沙無明相應種種諸業名界外惡除此二性於善惡法無可記別名無記性言生成法則者由意緣善生成善法軌則由意緣惡生成惡法軌則意緣無記生成無記法之軌則則亦訓法軌持為義軌生物解令人知是善惡無記法任持自性善惡無記三法性不可改此正明因緣生法所謂一切浮塵諸幻化相也次文總立即心離心二種難端然後別破初破此法若即心者法則不名為塵非是心之所緣云何成於外處次破離心別有方所再立二案謂法自性為有知耶非有知耶先破有知總以一句定其名義別以異汝即汝而雙破之謂法既有知則名為心且此離心有知之法為異汝耶為即汝耶若異於汝則非是塵乃同他人心量若即是汝則即汝心云何汝心更二於汝而曰離心別有方所此破離心有知已竟次破離心法塵若無知者既非前五塵及虗空相更有何物名為法塵今於五塵虗空都無表示不應更在虗空之外空非有外義決不成設許空外則亦非心所緣境界而不可立為處矣餘文可知惟其法處即空假中故摩訶迦葉悟之妙法開明銷滅諸漏。",
        "from": "X13n0285_003:0264c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四明十八界性二初總徵二別釋。",
        "from": "X13n0285_003:0265a11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0265a12_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次阿難云何十八界本如來藏妙真如性。",
        "from": "X13n0285_003:0265a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "界者因義根塵為緣而生於識說名為界又種族義根塵識三各有種子各為族類又界限義內根外塵中間名識此中正意惟破界妄而顯識性以根塵二種先已破顯故也十法界染淨諸識俱無實界可得一一即空假中故云本藏性也。",
        "from": "X13n0285_003:0265a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二別釋六初明眼識界即藏性(至)六明意識界即藏性。",
        "from": "X13n0285_003:0265a18_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0265a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難如汝所明眼色為緣生於眼識此識為復因眼所生以眼為界因色所生以色為界阿難若因眼生既無色空無可分別縱有汝識欲將何用汝見又非青黃赤白無所表示從何立界若因色生空無色時汝識應滅云何識知是虗空性若色變時汝亦識其色相遷變汝識不遷界從何立從變則變界相自無不變則恒既從色生應不識知虗空所在若兼二種眼色共生合則中離離則兩合體性雜亂云何成界是故當知眼色為緣生眼識界三處都無則眼與色及色界三本非因緣非自然性。",
        "from": "X13n0285_003:0265a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此中諸文准上亦各四節從初至生於眼識即舉正因緣境次從此識為復至云何成界明其即空三從是故當知至三處都無明其惟是假名四則眼與色至終明其即中以對總示文義如前可知初文言如汝所明者與即是奪以此因緣生法義關四教阿難所明不過是藏教中法有我無意耳尚不知因緣即空況假中耶下文乃正破其法執而會歸藏性也次文徵中但立眼生色生二案破中兼破共生初破眼生可知次破色生者若汝識因色生則空無色時汝識應隨色滅汝識既滅云何識知是虗空性若色變時汝亦識其色相遷變則色自變而汝識不變界從何立若謂識從色變則識已受變界相自無若識從色生而又不變則恒應識色應不識知虗空所在矣次破共生者若識是眼色二種之所共生則果必宜似因一分從眼生者則是有知一分從色生者則應無知故眼色合時汝識乃一分有知一分無知而中離正當眼色離時汝識當一分歸眼一分歸色而兩合如此則體性雜亂云何成界耶當知眼識無生明矣第三文中意顯九界眼識及佛界成所作智皆是不變隨緣假說為界實則十法界之三處都無體性不過假名而已第四文中結顯眼色識三一一本是隨緣不變不變隨緣之藏性也惟其眼識即空假中故舍利弗悟之心見發光光極知見。",
        "from": "X13n0285_003:0265b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明耳識界即藏性。",
        "from": "X13n0285_003:0265c06_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又汝所明耳聲為緣生於耳識此識為復因耳所生以耳為界因聲所生以聲為界阿難若因(勝義)耳生動靜二相既不現前根不成知必無所知知尚無成識何形貌若取耳(形能)聞無動靜故聞無所成云何耳形雜色觸塵名為識界則耳識界復從誰立若生於聲識因聲有則不關聞無聞則亡聲相所在識從聲生許聲因聞而有聲相聞應聞識不聞非界聞則同聲識已被聞誰知聞識若無知者終如草木不應聲聞雜成中界界無中位則內外相復從何成是故當知耳聲為緣生耳識界三處都無則耳與聲及聲界三本非因緣非自然性。",
        "from": "X13n0285_003:0265c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次文徵中亦但立耳生聲生二案破中兼破共生初破耳生又二一破勝義耳生文相易知二破浮塵耳生故云若取耳形為能聞者既無動靜聞無所成豈可使此耳形對於色塵觸塵而為識界耶蓋耳形決定不能見色又知觸者即屬身根故也次破聲生又二先直破云則不關聞然無聞則亡聲相所在次破轉計云若謂識雖從聲而生原許此聲因於聞根而有聲相則聞聲時亦應聞其所生之識若不聞識則識非從聲生故非以聲為界若許聞識則識便同於聲識已被聞又誰為知聞識者若更無知聞識者則終如草木無知又不可矣次破共生云又不應聲塵聞根雜成中界謂半是根生半是塵生則有知無知體性雜亂界相自不成也中位既無內外安有無生之理昭然明白餘文可知惟其耳識即空假中故普賢菩薩悟之心聞發明分別自在。",
        "from": "X13n0285_003:0265c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三明鼻識界即藏性。",
        "from": "X13n0285_003:0266a10_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又汝所明鼻香為緣生於鼻識此識為復因鼻所生以鼻為界因香所生以香為界阿難若因鼻生則汝心中以何為鼻為取肉形雙爪之相為取齅知動搖之性若取肉形肉質乃身身知即觸名身非鼻名觸即塵鼻尚無名云何立界若取齅知又汝心中以何為知以肉為知則肉之知元觸非鼻以空為知空則自知肉應非覺如是則應虗空是汝汝身非知今日阿難應無所在以香為知知自屬香何預於汝若香臭氣必生汝鼻則彼香臭二種流氣不生伊蘭及旃檀木二物不來汝自齅鼻為香為臭臭則非香香應非臭若香臭二俱能聞者則汝一人應有兩鼻對我問道有二阿難誰為汝體若鼻是一香臭無二臭既為香香復成臭二性不有界從誰立若因香生識因香有如眼有見不能觀眼因香有故應不知香知即非生不知非識香非知有香界不成識不知香因界則非從香建立既無中間不成內外彼諸聞性畢竟虗妄是故當知鼻香為緣生鼻識界三處都無則鼻與香及香界三本非因緣非自然性。",
        "from": "X13n0285_003:0266a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次文破鼻生中又以浮塵勝義二根並徵先破浮塵根可知次破勝義根中又以肉以空以香為勝義所托之處一一破之勝義根尚不可得況因根所生識耶若因香生以下方破識從香生謂識因香有不應知香如眼有見不能觀眼若能知香即非香生若不知香又非鼻識且香塵若非識知其有則香界便自不成鼻識若不知香則因界斷非從香建立既無中間之識亦不成內外根塵畢竟虗妄足顯無生矣餘文可知惟其鼻識即空假中故孫陀羅難陀悟之明圓滅漏。",
        "from": "X13n0285_003:0266b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四明舌識界即藏性。",
        "from": "X13n0285_003:0266b14_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又汝所明舌味為緣生於舌識此識為復因舌所生以舌為界因味所生以味為界阿難若因舌生則諸世間甘蔗烏梅黃連石鹽細辛薑桂都無有味汝自甞舌為甜為苦若舌性苦誰來甞舌舌不自甞孰為知覺舌性非苦味自不生云何立界若因味生識自為味同於舌根應不自甞云何識知是味非味又一切味非一物生味既多生識應多體識體若一體必味生鹹淡甘辛和合俱生諸變異相同為一味應無分別分別既無則不名識云何復名舌味識界不應虗空生汝心識舌味和合即於是中元無自性云何界生是故當知舌味為緣生舌識界三處都無則舌與味及舌界三本非因緣非自然性。",
        "from": "X13n0285_003:0266b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次文徵中亦惟二案破中兼破無因生及共生先破舌生文相易知次破味生又為三意一者若從味生不應知味譬如舌不甞舌二者以能生例所生能生之物既多所生之識亦應多體如多父不應共生一子三者以所生例能生識既味生而體是一則能生之味亦應是一如一子決無多父則何者為鹹何者為淡何者為甘為辛何者為諸味和合相何者為諸味俱生相何者為諸味變異相皆無分別既無分別又不名舌識矣次不應虗空生汝心識一句破無因生空生即無因也次舌味和合即於是中元無自性云何界生破共生也蓋使舌味和合而生於識則半屬有知半屬無知體性紛雜不成中界矣餘文可知惟其舌識即空假中故滿慈悟之能以法音降伏魔怨消滅諸漏。",
        "from": "X13n0285_003:0266c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五明身識界即藏性。",
        "from": "X13n0285_003:0266c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又汝所明身觸為緣生於身識此識為復因身所生以身為界因觸所生以觸為界阿難若因身生必無合離二(種)覺觀(之)緣身何所識若因觸生必無汝身誰有非身知合離者阿難物不觸知身知有觸知身即觸知觸即身即觸非身即身非觸身觸二相元無處所合身即為身自體性離身即是虗空等相內外不成中云何立中不復立內外性空則汝識生從誰立界是故當知身觸為緣生身識界三處都無則身與觸及身界三本非因緣非自然性。",
        "from": "X13n0285_003:0266c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次文直破身生觸生文皆可知從阿難物不觸知以下更將身觸合辨明其無性即破共生意也言外物本不觸汝之知但汝身知有物觸耳然知於身者即是觸塵知觸塵者即是身根若以為即是觸塵便非可名為身根若以為即是身根便非可名為觸塵是則身觸二相元無內外處所可得也又若謂觸實合身即為身自體性別無觸位若謂觸若離身即是虗空等相又無觸用內外二界尚自不成中間識界復云何立中既不可復立內外之性亦空豈非因緣即空之明證乎餘文可知惟其身識即空假中故優波離悟之身心一切通利。",
        "from": "X13n0285_003:0267a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六明意識界即藏性。",
        "from": "X13n0285_003:0267a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又汝所明意法為緣生於意識此識為復因意所生以意為界因法所生以法為界阿難若因意生於汝意中必有所思發明汝意若無前法意無所生離緣無形識將何用又汝識心與諸思量兼了別性為同為異同意即意云何所生異意不同應無所識若無所識云何意生若有所識云何識意唯同與異二性無成界云何立若因法生世間諸法不離五塵汝觀色法及諸聲法香法味法及與觸法相狀分明以對五根非意所攝汝識決定依於法生今汝諦觀法法何狀若離色空動靜通塞合離生滅越此諸相終無所得生則色空諸法等生滅則色空諸法等滅所因既無因生有識作何形相相狀不有界云何生是故當知意法為緣生意識界三處都無則意與法及意界三本非因緣非自然性。",
        "from": "X13n0285_003:0267a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次文雙徵雙破先破因意生中復為二義初約單意不生破次約同異俱非破初破云若因意生則於汝意之中必須有所思量乃可發明汝意若一總都無前法則意根便無所生離彼法緣意根尚無形相意識又將何用次破云又汝第六識心設是因意根生則與第七思量兼第八了別之性為同為異識若同於意根便即是意云何是意所生識若異於意根則不同意之有知應即無所識別若無所識云何名為意根所生若有所識既無法塵可識云何但自識其意根由此言之同異二性皆不能成從何而立界耶問曰識心應指第八今何反作第六了別應指第六今何反作第八答曰以名定義萬無一得以義定名萬無一失今之文義須如此釋不可泥字而昧理也且八識名字有通有別別則前六名識能了境故第七名意恒審思量故第八名心諸法集起故通則八皆名識稱為八識故八皆名意皆有思量性故八皆名心是心王故今識心二字重在識字故指第六了別性三字重在性字故是第八思量正指意根此是可知由第七第八無始恒相依倚故以兼字顯之此正問所生識心與能生意根是同是異則文理俱順矣二破法生中直明法無自體何能生識蓋五塵相貌俱可指陳唯有法塵不過即是五塵生滅影子別無自體故今徵云汝且諦觀法塵之法作何形狀若離色空動靜通塞合離等法之生滅則法塵終無所得生不過是色空諸法等生滅不過是色空諸法等滅何處更有法塵自體相耶所因之法塵既無則因法塵生所有之識作何形相其故大目犍連悟之心光發宣圓明清淨自在無畏也從初卷佛告阿難汝我同氣至此是如來答示文中就事以顯理竟。",
        "from": "X13n0285_003:0267b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明性本具相為三初當機疑問二訶誡許宣三正篇開示。",
        "from": "X13n0285_003:0267c12_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0267c13_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難白佛言世尊如來常說和合因緣一切世間種種變化皆因四大和合發明云何如來(今乃)因緣自然二俱排擯我今不知斯義所屬惟垂哀愍開示眾生中道了義無戲論法。",
        "from": "X13n0285_003:0267c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上來就事顯理正明藏性隨緣不變的皆中道了義無戲論法而阿難久執麤淺因緣名言習氣所以反墮疑網謂是撥無世諦不免墮在斷空故更求開示中道了義也原此疑情來歷有三一者近從陰入處界起疑謂既本非因緣非自然性則根塵識等一切皆空而不知如來所示乃即事之理非撥事言理也二者遠從十番辨見起疑謂此見性既非覺聞知見則能見所見同為眚影而不知如來所示乃即眚之目非眚外覓目也三者更從七處破妄起疑謂緣影既是非心因緣自然復俱排擯則妄無所依真無可據而不知如來所示惟其離一切相所以即一切法也。",
        "from": "X13n0285_003:0267c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二訶誡許宣。",
        "from": "X13n0285_003:0268a05_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時世尊告阿難言汝先厭離聲聞緣覺諸小乘法發心勤求無上菩提故我今時為汝開示第一義諦如何復將世間戲論妄想因緣而自纏繞汝雖多聞如說藥人真藥現前不能分別如來說為真可憐愍汝今諦聽我當為汝分別開示亦令當來修大乘者通達實相阿難默然承佛聖旨。",
        "from": "X13n0285_003:0268a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此中從初至真可憐愍是訶辭汝今諦聽一句是誡辭我當為汝至通達實相是許宣阿難默然承佛聖旨是領佛誡一心諦聽三業皆寂也初文言汝先厭離諸小乘法者以阿難歸來見佛即殷勤啟請得成菩提方便豈非厭小求大故我今時為汝開示第一義諦者歷指前來所說一一無非第一義諦更非次第三諦等也金口誠言明文若此解者欲以奢摩他等分配前文可謂公與佛坑今須一一更為點示俾經旨昭然經初首唱常住真心性淨明體即誡直心正念真如便是第一義諦真實血脉次欲逐破妄執先唱大定之名俾利根者妄執破處定體圓彰覓心了不可得心即竪窮橫徧寧非第一義諦次明二種根本不離一心寧非第一義諦次明諸法所生唯心所現寧非第一義諦次明見性是心非眼而此見性本無動搖亦無舒卷本無生滅亦無增減本不可還亦決非物本無舒縮亦無斷續本無是見亦無非見本非自然亦非因緣本非明暗色空亦非覺聞知見本非和合非不和合以要言之離一切相即一切法寧非第一義諦次明陰入處界即空即假即中寧非第一義諦第一義諦即是中道了義無戲論法也乃捨此而別求中道了義大似說藥而不知真藥良以有聞無慧故也故仍誡以諦聽庶幾不為徒聞耳實相亦即第一義諦亦即中道了義以其無相不相名為實相前已深明相即無相道理今更重明無相即相道理令其通達也。",
        "from": "X13n0285_003:0268a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三正為開示二初牒疑總示二歷大別顯。",
        "from": "X13n0285_003:0268b13_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初中二初就法破妄二借喻顯理。",
        "from": "X13n0285_003:0268b14_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0268b15_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難如汝所言四大和合發明世間種種變化阿難若彼大性體非和合則不能與諸大雜和猶如虗空不和諸色若和合者同於變化始終相成生滅相續生死死生生生死死如旋火輪無有休息。",
        "from": "X13n0285_003:0268b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此牒其妄計而破之也如來所說和合因緣秪為顯示諸法無性若妄計四大有實體性由彼和合能生諸法則與外道邪計何異故今牒而破之先破非和合次破和合由不達不變隨緣之性必計體非和合由不達隨緣不變之性必將轉計和合今並破之則已密顯如來藏性方是四大真性而四大無性正是如來藏之實性矣先破非和合云若計彼諸大之性體必非和合者則一一大皆不能與諸大雜和猶如虗空不和諸色便無諸大之用如地性常堅遇水不潤水性常冷遇火不熱等何以生成萬物若計彼諸大之性必定是和合者則便同於種種變化始終相成生滅相續生而復死死而復生從生至生從死至死如旋火輪無有休息便無諸大之體如地遇水則失其堅水遇火則失其潤等自體既失又將何以生成萬物此等豈非戲論妄想也耶。",
        "from": "X13n0285_003:0268b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二借喻顯理。",
        "from": "X13n0285_003:0268c11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難如水成氷氷還成水。",
        "from": "X13n0285_003:0268c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此承上文破其妄計而總示以隨緣不變不變隨緣之理性也此為七大總喻極須著眼以氷水總喻隨緣之相以氷水同一濕性而喻不變之性若藏性隨於染緣成佛法界中九界七大喻以如水成氷若藏性隨於淨緣顯九法界中佛界七大喻以氷還成水惟一濕性氷水相殊是謂不變隨緣氷水雖殊濕性無二是謂隨緣不變由其隨緣即不變故所以七大無非性真圓融周徧法界由其不變即隨緣故所以七大無不隨心應量循業發現也。",
        "from": "X13n0285_003:0268c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二歷大別顯此正顯示隨緣不變不變隨緣之藏性方是七大實性所謂性具法門事事無礙之法界也須知七大即是陰入處界但開合廣略不同開色陰為前五大指受陰為根大合想行識為識大又橫列六塵為前五大收六根為根大收六識為識大也既知七大更無異法當以二文前後互融方開圓悟之門前明陰入處界皆如來藏本無生滅須知即是七大皆如來藏本無生滅後明如來藏中性具七大清淨圓融徧周法界循業發現當知即是如來藏中性具陰入處界清淨圓融徧周法界循業發現所謂即事之理無有少許理性而不攝在事中即理之事無有少許事相而不攝在理中故得毛吞巨海芥納須彌介爾三千剎那十世心性妙理至此已極三諦一諦更無餘蘊故使阿難大悟頓獲法身下文滿慈騰問不過別為法執重者破疑滯耳諸家不達或以此為次第三諦或以此為空與不空兩藏或但指此為空如來藏下文方顯不空等藏誣罔圓宗謗毀佛語哀哉哀哉文分為七初明藏性即地大性(至)七明藏性即識大性。",
        "from": "X13n0285_003:0268c22_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初中三初破妄執二顯理性三斥迷惑。",
        "from": "X13n0285_003:0269a17_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0269a18_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝觀地性麤為大地細為微塵至鄰虗塵析彼極微色邊際相七分所成更析鄰虗即實空性阿難若此鄰虗析成虗空當知虗空出生色相汝今問言由和合故出生世間諸變化相汝且觀此一鄰虗塵用幾虗空和合而有不應鄰虗合成鄰虗又鄰虗塵析入空者用幾色相合成虗空若色合時合色非空若空合時合空非色色猶可析空云何合。",
        "from": "X13n0285_003:0269a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十法界內色外色總名地大今且約現前外色辨也七分析色自是外道邪計由彼不達色性即是藏性本與空性無二無別妄謂析色方可歸空今故牒而破之謂汝尚同凡外所計和合因緣觀於此地虗妄體性以為積色至麤方為大地析色至細便為微塵至鄰虗塵乃析彼極微色邊際相七分所成設使更析鄰虗即實成空性耶若使此鄰虗塵果然析成虗空當知此虗空中亦應出生色相矣下文方正破之文並可知色猶可析一句亦是順其情計而姑縱之實則麤亦法界細亦法界皆是隨心應量循業發現麤不待合細不待析也。",
        "from": "X13n0285_003:0269b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二顯理性。",
        "from": "X13n0285_003:0269b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝元不知如來藏中性色真空性空真色清淨本然周徧法界隨眾生心應所知量循業發現。",
        "from": "X13n0285_003:0269b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此正顯示如來藏性即是色之真性亦是空之真性是故色之與空無非是性無非是真色非待合而始有空非待析而始成秪由隨緣常不變故所以不變常隨緣也以其隨緣不變故號為如以其不變隨緣故號為來以其性具十界染淨功能故稱為藏以其無法不在裡許故名為中以其無性之性即是十法界色空實性性不可改體無虗妄故一一皆性皆真以其十法界色皆悉離過絕非體是無作故名清淨本然以其十法界色各各竪窮橫徧故名周徧法界夫性真色空即是性具清淨本然即是性體周徧法界即是性量此示隨緣不變體也隨十法界眾生迷悟之心應其所知染淨之量循於十界善惡諸業而發現為十界苦樂諸色此示不變隨緣用也隨緣即不變如氷水之濕性始終不變不變即隨緣如濕性之氷水總是隨緣隨寒凍緣水則成氷而濕性無減以喻隨迷染緣成九界生死幻色而藏性無減隨和暖緣氷則成水而濕性無增以喻隨悟淨緣成佛界真善妙色而藏性無增故知總喻徧喻七大體用性相今一一文還須用上喻意而消釋之則旨趣昭然。",
        "from": "X13n0285_003:0269b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三斥迷惑。",
        "from": "X13n0285_003:0269c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間無知惑為因緣及自然性皆是識心分別計度但有言說都無實義。",
        "from": "X13n0285_003:0269c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間者徧指九法界眾生也總未達此隨緣不變不變隨緣妙性故各各有因緣自然二種妄計而此妄計但是戲論言說而已終無實義可指陳也蓋凡外世間或計時方微塵大自在等諸邪因緣或計冥諦神我以為自然此則藏教所明因緣生法即已破竟復有鈍根聲聞緣覺稟佛因緣言教不達如來說法旨趣以苦集滅道世出世間因果差別總屬因緣以滅諦所顯偏真涅槃性無生滅還名自然此則通教所明因緣即空亦已破竟復有鈍根三乘稟佛即空言教不達如來說法旨趣以苦集滅道一切如幻名為因緣以真理無生苦不能迫集不能染還名自然此則別教所明因緣假名亦已破竟復有鈍根菩薩稟佛即假言教不達如來說法旨趣以無明招感九界生死名為因緣但中佛性凝然不變如月在雲外還名自然此惟今教所明因緣即中方得破盡無餘故知未曾開佛知見則九界同名識心如水成氷若圓解初開則識心便成妙觀察智如氷成水下皆准知惟其藏性即地大性故持地菩薩悟之塵銷智圓成無上道。",
        "from": "X13n0285_003:0269c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明藏性即火大性三初破妄執二顯理性三斥迷惑。",
        "from": "X13n0285_003:0270a10_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0270a11_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難火性無我寄於諸緣汝觀城中未食之家欲炊爨時手執陽燧日前求火阿難(若欲)名和合者如我與汝一千二百五十比丘今(和合而)為一眾眾雖為一詰其根本各各有身皆有所生氏族名字如舍利弗婆羅門種優樓頻螺迦葉波種乃至阿難瞿曇種姓(如此方可名為和合)阿難若此火性因和合有彼手執鏡於日求火此火為從鏡中而出為從艾出為於日來阿難若日來者自能燒汝手中之艾來處林木皆應受焚若鏡中出自能於鏡出然於艾鏡何不鎔(今乃)紆汝手執尚無熱相云何融泮若生於艾何藉日鏡光明相接然後火生汝又諦觀鏡因手執日從天來艾本地生火從何方遊歷於此日鏡相遠非和非合不應火光無從自有。",
        "from": "X13n0285_003:0270a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十法界內火外火總名火大今且約現前外火辨之火性無我者且指妄性本無自體為破凡外性計故也寄於諸緣等者仍舉正因緣境然後明其無性阿難名和合者以下舉和合相以反顯於非和合性此喻不唯反顯火大亦復徧顯下文五大文不重出義實相通故也陽燧者取火之鏡優樓頻螺此云木瓜林尊者之名迦葉波此云龜氏尊者之姓瞿曇此云地最勝亦云日種即如來俗姓鏡即陽燧紆者屈曲之貌不應火光無從自有一句兼破不和合義。",
        "from": "X13n0285_003:0270b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二顯理性。",
        "from": "X13n0285_003:0270b10_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝猶不知如來藏中性火真空性空真火清淨本然周徧法界隨眾生心應所知量阿難當知世人一處執鏡一處火生徧法界執滿世間起起徧世間寧有方所循業發現。",
        "from": "X13n0285_003:0270b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此顯性具十法界火火之與空皆性皆真隨緣常自不變故能隨心應量而循業發現即是不變常自隨緣致有十法界火種種差別也餘如上釋。",
        "from": "X13n0285_003:0270b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三斥迷惑。",
        "from": "X13n0285_003:0270b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間無知惑為因緣及自然性皆是識心分別計度但有言說都無實義。",
        "from": "X13n0285_003:0270b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "義如上釋惟其藏性即火大性故烏芻瑟摩悟之生大寶燄登無上覺。",
        "from": "X13n0285_003:0270b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三明藏性即水大性三初破妄執二顯理性三斥迷惑。",
        "from": "X13n0285_003:0270b22_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0270b23_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難水性不定流息無恒如室羅城迦毗羅仙斫迦羅仙及鉢頭摩訶薩多等諸大幻師求太陰精用和幻藥是諸師等於白月晝手執方諸承月中水此水為復從珠中出空中自有為從月來阿難若從月來尚能遠方令珠出水所經林木皆應吐流流則何待方諸所出不流明水非從月降若從珠出則此珠中常應流水何待中宵承白月晝若從空生空性無邊水當無際從人洎天皆同滔溺云何復有水陸空行汝更諦觀月從天陟珠因手持承珠水盤本人敷設水從何方流注於此月珠相遠非和非合不應水精無從自有。",
        "from": "X13n0285_003:0270b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十法界內水外水總名水大今且約現前外水辨之水性不定有時而流有時而息亦指妄性無體以破外計如室羅城下舉因緣境此水為復下明其無性先皆廣破和合後以不應水精無從自在一句轉破不和合也月中之水名太陰精正當望夜月輪中天名白月晝方諸即取水珠名餘可知。",
        "from": "X13n0285_003:0270c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二顯理性。",
        "from": "X13n0285_003:0270c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝尚不知如來藏中性水真空性空真水清淨本然周徧法界隨眾生心應所知量一處執珠一處出水徧法界執滿法界生生滿世間寧有方所循業發現。",
        "from": "X13n0285_003:0270c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明性具十法界水水之與空皆性皆真隨緣常自不變故能不變常自隨緣遂有十界水差別也。",
        "from": "X13n0285_003:0270c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三斥迷惑。",
        "from": "X13n0285_003:0270c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間無知惑為因緣及自然性皆是識心分別計度但有言說都無實義。",
        "from": "X13n0285_003:0270c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "惟其藏性即水大性故月光童子悟之一味流通得無生忍。",
        "from": "X13n0285_003:0271a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四明藏性即風大性三初破妄執二顯理性三斥迷惑。",
        "from": "X13n0285_003:0271a03_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0271a04_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難風性無體動靜不常汝常整衣入於大眾僧伽梨角動及傍人則有微風拂彼人面此風為復出袈裟角發於虗空生彼人面阿難此風若復出袈裟角汝乃披風其衣飛搖應離汝體我今說法會中垂衣汝看我衣風何所在不應衣中有藏風地若生虗空汝衣不動何因無拂空性常住風應常生若無風時虗空當滅滅風可見滅空何狀若有生滅不名虗空名為虗空云何風出若風自生被拂之面從彼面生當應拂汝自汝整衣云何倒拂汝審諦觀整衣在汝面屬彼人虗空寂然不參流動風自誰方鼓動來此風空性隔非和非合不應風性無從自有。",
        "from": "X13n0285_003:0271a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十法界內動外動總名風大今亦且就現前外動辨之風性無體動靜不常者正顯妄無自性破外計也汝常整衣下重舉因緣生法僧伽梨此云大衣此風為復下正明緣生無性袈裟此云壞色即三衣之都名空性常住風應常生者能生是常所生亦應常也若無風時虗空當滅者所生無常以例能生亦應無常也風空性隔者既不達同是藏性則風性屬動空性屬靜不相為用也不應風性無從自有者轉破不和合計也。",
        "from": "X13n0285_003:0271a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二顯理性。",
        "from": "X13n0285_003:0271a24_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝宛不知如來藏中性風真空性空真風清淨本然周徧法界隨眾生心應所知量阿難如汝一人微動服衣有微風出徧法界拂滿國土生周徧世間寧有方所循業發現。",
        "from": "X13n0285_003:0271b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明性具十法界風風之與空皆性皆真是故隨緣即不變不變即隨緣而有十法界風差別也。",
        "from": "X13n0285_003:0271b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三斥迷惑。",
        "from": "X13n0285_003:0271b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間無知惑為因緣及自然性皆是識心分別計度但有言說都無實義。",
        "from": "X13n0285_003:0271b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "惟其藏性即風大性故瑠璃光法王子悟之合十方佛傳一妙心。",
        "from": "X13n0285_003:0271b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五明藏性即空大性四初破妄執二明大均三顯理性四斥迷惑。",
        "from": "X13n0285_003:0271b11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0271b12_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難空性無形因色顯發如室羅城去河遙處諸剎利種及婆羅門毗舍首陀兼頗羅墮旃陀羅等新立安居鑿井求水出土一尺於中則有一尺虗空如是乃至出土一丈中間還得一丈虗空虗空淺深隨出多少此空為當因土所出因鑿所有無因自生阿難若復此空無因自生未鑿土前何不無礙唯見大地迥無通達若因土出則土出時應見空入若土先出無空入者云何虗空因土而出若無出入則應空土元無異因無異則同則土出時空何不出若因鑿出則鑿出空應非出土不因鑿出鑿自出土云何見空汝更審諦諦審諦觀鑿從人手隨方運轉土因地移如是虗空因何所出鑿空虗實不相為用非和非合不應虗空無從自出。",
        "from": "X13n0285_003:0271b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十法界內空外空總名空大今亦且就現前外空辨之空性無形因色顯發者正明空無自性破外計也如室羅城下重舉因緣生法此空為當下廣明緣生無性剎利種即王族婆羅門此云淨裔亦云梵志如此方儒業之家毗舍即商賈首陀即農夫頗羅墮此云利根即術士九流之類旃陀羅此云魁膾即屠酤婬舍諸下賤家虗空之淺深隨其出土之多少所謂因緣生法也次明因緣無性中總徵三句次先破無因無因即是自然由眾生於四大邊多計因緣於空大邊多計自然故先破之次破因土出中先破正計次若無出入下破其轉計謂若計空無出入則未出土時先有虗空虗空與土同住一處同體相連故出土時空亦應出也由其未達空土皆如來藏別無自體故得以此難之次破若因鑿出亦先正破次不因鑿出下更破轉計汝更審諦下此理玄微故更囑云諦審諦觀欲其於此悟入妙性也鑿空虗實者鑿是實物空體虗融若未達藏性則虗實迥殊不相為用故曰非和非合也不應虗空無從自出者又轉破其不和合計。",
        "from": "X13n0285_003:0271c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明大均。",
        "from": "X13n0285_003:0271c21_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若此虗空性圓周徧本不動搖當知現前地水火風均名五大性真圓融皆如來藏本無生滅阿難汝心昏迷不悟四大元如來藏當觀虗空為出為入為非出入。",
        "from": "X13n0285_003:0271c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此以空均四大而名五大顯其皆性皆真無二無別也蓋九界眾生於此色空二法總未能融通為一凡夫計四大實色與頑然虗空敵體相對二乘以生死妄色與涅槃真空敵體相對稟通教人以從假入空與從空出假亦敵體相對稟別教人以空有二諦與但中第一義空亦敵體相對孰知四大即空空即四大空即藏性四大亦即藏性藏性即空藏性亦即四大是故十法界地水火風即是十法界空十法界空即是十法界地水火風今承上文拈出一井中空即復非因非緣亦非自然非和非合非不和合四句咸離百非俱遺始信十界虗空性圓周徧本不動搖與彼現前地水火風一一性真圓融皆如來藏本無生滅彰彰明矣由汝不悟四大元如來藏遂以世間戲論妄想和合因緣而自纏繞今當觀此虗空為出為入為非出入若謂虗空有出入是因緣戲論破已如上若謂虗空無出入是自然戲論破亦如上若知藏性虗空隨緣不變則出入即非出入若知藏性虗空不變隨緣則無出入不妨出入若知藏性虗空離諸戲論則知藏性四大亦皆離諸戲論矣。",
        "from": "X13n0285_003:0272a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三顯理性。",
        "from": "X13n0285_003:0272a21_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝全不知如來藏中性覺真空性空真覺清淨本然周徧法界隨眾生心應所知量阿難如一井空空生一井十方虗空亦復如是圓滿十方寧有方所循業發現。",
        "from": "X13n0285_003:0272a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明性具十法界空空之與覺皆性皆真也前文既以空均四大則今舉一空字便是全舉五大人謂五大是無情法名為不覺根識是有情法名之為覺殊不知情與無情皆性皆真是故十法界若正若依一一無非清淨本然周徧法界此隨緣不變之體也隨十界眾生之心應其所知大小之量循於善惡諸業發現而為十法界空此不變隨緣之用也。",
        "from": "X13n0285_003:0272b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四斥迷惑。",
        "from": "X13n0285_003:0272b09_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間無知惑為因緣及自然性皆是識心分別計度但有言說都無實義。",
        "from": "X13n0285_003:0272b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "凡外以析色歸空為因緣以頑空不動為自然稟藏教不得意人以滅色會空為因緣以真空不動為自然稟通教不得意人以體色即空為因緣以空理無生為自然稟別教不得意人以緣了二修顯發真如為因緣以真如佛性迥出二邊為自然皆由不了藏性故終無實義可得耳惟其藏性即空大性故虗空藏菩薩悟之妙力圓明。",
        "from": "X13n0285_003:0272b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六明藏性即根大性然一切大小乘經秪明六大所謂地水火風空識皆不別立此根大名以一切諸法色心收盡地水火風空五大同是色法識大即是心法此之前五浮勝二根及浮塵肉團還屬前五大攝勝義意根即識大攝所以不須立也今經別立根大須知於前五根不取浮勝二種色法但取任運照現量境一種功能於第六根不取浮塵肉團色法但取勝義默容諸法一種功能當知即是第八識之見分寄在六根門頭緣彼現量六塵者也立此根大凡有三意一者為收前法故二者為順後文故三者為立圓通境故初為收前法又有三意一者前文十番辨見皆借見精以顯妙性今更申明見聞等精即是藏性藏性如真月見聞等精與色空等塵如二月依真月有二月指二月即真月則見見非見之旨至此愈明二者前以五陰收一切法罄無不盡今開色陰為前五大指受陰為根大指想行識三陰為識大一一大中仍各具足十界五陰以色心二法決不相離故也三者前以十八界收一切法亦無不盡今橫開六塵為前五大合六根為根大合六識為識大若合若開咸成所觀妙境初意竟二為順後文者文云生死輪轉安樂妙常同是六根更非他物將欲說此法門故先立此大也三為立圓通境者如六塵六根六識皆為下文諸聖圓通而作張本設不立此根大則勢至念佛圓通便為無據故須別立此根大也文分為四初破妄執二明大均三顯理性四斥迷惑。",
        "from": "X13n0285_003:0272b18_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0272c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難見覺無知因色空有如汝今者在祇陀林朝明夕昏設居中宵白月則光黑月便暗則明暗等因見分析此見為復與明暗相并太虗空為同一體為非一體或同非同或異非異阿難此見若復與明與暗及與虗空元一體者則明與暗二體相亡暗時無明明時無暗若與暗一明則見亡必一於明暗時當滅滅則云何見明見暗若明暗殊見無生滅一云何成若此見精與暗與明非一體者汝離明暗及與虗空分析見元作何形相離明離暗及與虗空是見元同龜毛兔角明暗虗空三事俱異從何立見明暗相背云何或同離三元無云何或異分空分見本無邊畔云何非同見暗見明性非遷改云何非異汝更細審微細審詳審諦審觀明從太陽暗隨黑月通屬虗空壅歸大地如是見精因何所出見覺空頑非和非合不應見精無從自出。",
        "from": "X13n0285_003:0272c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十法界見聞覺知一往皆是寄在六根總名根大舊稱見大得別遺總今所不用今但約見根一法辨之以例餘五根耳見覺無知因色空有者此明緣生之見無自體性以例開齅覺知無不皆爾也則明暗等因見分析者意顯明暗亦無自性還與見覺互為因緣以例動靜合離生滅等法亦無不皆爾也此是正舉因緣生法下乃廣明無性先徵次破徵中共立六句一者一體二者非一體三者或同四者非同五者或異六者非異若未達隨緣不變不變隨緣妙性假饒聰辨明了斷斷不能出此六句戲論窠臼故徵起而一一破之初從阿難此見至一云何成先破一體文相易知二從若此見精至從何立見破非一體言明暗虗空三事俱異者異字訓作離字設三事一總俱離則無從立見矣三明暗相背以破或同或者不定之辭今明暗決定相背是故不可說或同也四離三元無超破或異設令離於明暗空三稍有見之自體可以指陳可說或異今既無可別指是故不可說或異也分空分見本無邊畔追破非同非同即異但是防轉計者之變文耳見暗見明性非遷改以破非異非異即同亦是防轉計者之變文耳汝更細審下囑令更加精研欲其悟入藏性蓋不達藏性則見聞等根是覺知性空及四大是頑礙性故非和非合此破其和合妄計也不應見精無從自出一句又破其轉計不和合也。",
        "from": "X13n0285_003:0273a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明大均。",
        "from": "X13n0285_003:0273b13_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若見聞知性圓周徧本不動搖當知無邊不動虗空并其動搖地水火風均名六大性真圓融皆如來藏本無生滅阿難汝性沉淪不悟汝之見聞覺知本如來藏汝當觀此見聞覺知為生為滅為同為異為非生滅為非同異。",
        "from": "X13n0285_003:0273b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此以見聞覺知均前五大而名六大顯其皆性皆真無二無別也蓋九界眾生於此見與見緣二法總未能融通為一凡夫計前五大為實法計內六根為實我敵體相對二乘執五大為生滅外法執六根為生滅內法敵體相對稟通教人謂五大為如幻外法謂六根為如幻內法亦敵體相對稟別教人雖知前五大為相分見聞覺知為見分然必遠離依他起性方證圓成實性今在妄中則見相二分亦復敵體相對孰知五大即見聞覺知見聞覺知即五大見聞覺知即藏性五大亦即藏性藏性即見聞覺知藏性亦即五大是故十法界見聞覺知即是十法界地水火風空十法界地水火風空即是十法界見聞覺知今承上文拈出見根一種即復非一非異非同不同四句咸離百非俱遺始信十界見聞覺知性圓周徧本不動搖與彼虗空四大一一性真圓融皆如來藏本無生滅明矣言無邊不動虗空動搖地水火風者仍是隨他意語既知藏性則虗空非動非不動雙照動與不動地水火風亦非動非不動雙照動與不動隨緣常不變故五大皆動而非動不變常隨緣故五大皆非動而動又隨緣常不變故十界五大皆非動非不動不變常隨緣故九界五大皆非動而動佛界五大皆動而非動不達此致則動與不動皆為戲論耳汝當觀此見聞覺知為生為滅等者意顯汝今現前見聞覺知既不是生滅同異又不是非生滅非同異則非如來藏性而何蓋藏性隨緣常不變故所以不是生滅同異不變常隨緣故所以不是非生滅非同異也若迷此妙性則說生說滅說同說異說非生滅說非同異俱是戲論若達此妙性則一切戲論皆得除滅亦可隨四悉檀巧作生滅非同異種種說矣。",
        "from": "X13n0285_003:0273b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三顯理性。",
        "from": "X13n0285_003:0274a01_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝曾不知如來藏中性見覺明覺精明見清淨本然周徧法界隨眾生心應所知量如一見根見周法界聽齅嘗觸覺觸覺知妙德瑩然周徧法界圓滿十虗寧有方所循業發現。",
        "from": "X13n0285_003:0274a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明性具十法界見聞覺知見之與識皆性皆明也覺明覺精即初卷所謂識精元明指自證分言之前文既以見聞覺知均於五大則今舉一見字便是全舉六大人謂六大之中五是相分根是見分見相二分不是自證殊不知見相即是自證自證即是見相見相自證無非妙性無非真明是故十法界若見若相一一無非清淨本然周徧法界是謂隨緣不變之體隨十界眾生之心應其所知之量如一見根眾生洞視不過分寸而非減如來窮盡微塵清淨國土無所不矚而非增聽齅嘗等莫不皆然各各性具一千二百功德橫徧豎窮故曰妙德瑩然秪由十界業異故循業發現而為十界六根於無差別性中妄見種種差別是為不變隨緣之用也。",
        "from": "X13n0285_003:0274a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四斥迷惑。",
        "from": "X13n0285_003:0274a19_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間無知惑為因緣及自然性皆是識心分別計度但有言說都無實義。",
        "from": "X13n0285_003:0274a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "凡外計六根是我從時方微塵大自在天等生為因緣計神我徧滿十方為自然稟藏教不得意人執名色緣六入為因緣六入既滅所證偏真為自然稟通教不得意人以如幻六入為因緣六入體空為自然稟別教不得意人以依他起性成於六根為因緣以六根消滅所證圓成實性為自然皆由不了藏性故無實義也惟其藏性即根大性故大勢至法王子悟之成念佛三昧。",
        "from": "X13n0285_003:0274a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "七明藏性即識大性然小乘惟言六識大乘則言八識或言九識須知第九識名乃就果地而立實無別體秪約八識之性出障圓明故更加以白淨之號喚作菴摩羅識耳今經第八第七兩識總攝入於意根前文所云思量兼了別性是也此則已屬根大中收故今獨約前六識言之明其皆是性具分文為四初破妄執二明大均三顯理性四斥迷惑。",
        "from": "X13n0285_003:0274b05_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0274b12_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難識性無源因於六種根塵妄出汝今徧觀此會聖眾用目循歷其目周視但如鏡中無別分析汝識於中次第標指此是文殊此富樓那此目犍連此須菩提此舍利弗此識了知為生於見為生於相為生虗空為無所因突然而出阿難若汝識性生於見中如無明暗及與色空四種必無元無汝見見性尚無從何發識若汝識性生於相中不從見生既不見明亦不見暗明暗不矚即無色空彼相尚無識從何發若生於空非相非見非見無辨自不能知明暗色空非相滅緣見聞覺知無處安立處此二非空則同無有非同物縱發汝識欲何分別若無所因突然而出何不日中別識明月汝更細詳微細詳審見托汝睛相推前境可狀成有不相成無如是識緣因何所出識動見澄非和非合聞聽覺知亦復如是不應識緣無從自出。",
        "from": "X13n0285_003:0274b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十法界六種識心總名識大今且就阿難眼識辨之以例其餘五識識性無源因於六種根塵妄出者正明識是緣生破性計也汝今徧觀下重舉因緣生法此識了知下推其緣生無性舉因緣中辨於根識不同之相循歷周視先辨根相即前文根大中所謂見大此是第八識之見分寄於浮勝二種眼根任運了境無別分析故喻以但如鏡中然不同鏡之無知也汝識於中次第標指等次辨識相此中眼識與同時意識亦復有別佛雖不說理合知之若但親緣文殊舍利等相不帶名言者則是眼識功能若起文殊舍利等名言即是同時意識功能又眼識所緣文殊舍利等相但是托彼文殊舍利本質之境變起眼識家自相分境而為所緣非即緣彼文殊舍利實體以文殊舍利實體乃阿難第八識之相分是彼見大之所緣緣故也推無性中先立四句然後一一推破初破生於見中二破生於相中文皆可知三破生於空者夫空則既非是相亦非是見非見則無所辨自不能知明暗色空非相則滅前緣何處可用見聞知覺既是處此二非為一總俱空耶為除見相之外別有一法耶若一總俱空則同於無若別有一法亦非同於見相之物縱發汝識欲何分別乎四破無因生者眼識與同時意識皆惟緣現量境決無日中別識明月之理因見日故方了別日則非無因明矣此以因見因相因空同屬因緣以無因為自然而並破之汝更細詳下勸令更加審究并破和合不和合也見精托在汝睛形相推於前境但有可狀則方成有既不是相則便成無如是識緣既非見非相非空亦非無因畢竟因何所出況未達藏性則識屬動搖見屬澄靜理必非和非合聞聽覺知皆屬澄靜餘五種識亦皆動搖亦必非和非合此破其計和合也不應識緣無從自出一句破其轉計不和合性。",
        "from": "X13n0285_003:0274c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二明大均。",
        "from": "X13n0285_003:0275a12_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若此識心本無所從當知了別見聞覺知圓滿湛然性非從所兼彼虗空地水火風均名七大性真圓融皆如來藏本無生滅阿難汝心麤浮不悟見聞發明了知本如來藏汝應觀此六處識心為同為異為空為有為非同異為非空有。",
        "from": "X13n0285_003:0275a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此以六種識心均前六大而名七大顯其皆性皆真無二無別也蓋九界眾生於此識及根塵總未能融通為一凡外計識中所現緣影為心計根為身計塵為物敵體相對二乘執根塵為能生執識心為所生亦敵體相對稟通教人雖知能生之根塵如幻所生之識亦復如幻終非一體稟別教人雖知一切唯識而見相二分不說即妄恒真及於見相二分之外別立自證及證自證仍復相對孰知見相即自證自證即見相自證即藏性見相亦即藏性藏性即自證藏性亦即見相是故十法界識即是十法界地水火風空根十法界地水火風空根即是十法界識今承上文拈出眼識一種如此離過絕非始信十法界六識六根皆悉圓滿湛然性非從所與彼虗空地水火風一一性真圓融皆如來藏無生滅矣此中了別二字即指六識見聞覺知四字仍指六根汝心麤浮下責其不悟識心本如來藏而勑令更加觀察也六處識心為同為異等者若言其同則眼識胡不別聲耳識胡不辨色若言其異則耳自聽法何故身起欽承口來問義若言其空何故了了明明不可斷滅若言其有何故內外中間俱無所在若言非同何故性中相知若言非異何故用中相背若言非空何故覓不可得若言非有何故應用無盡既此六處識心不是同異空有亦不是非同非異非空非有謂非如來藏性而何蓋藏性隨緣常不變故所以不是同異空有藏性不變常隨緣故所以不是非同非異非空非有也若迷此妙性則說同說異說空說有說非同異說非空有俱為戲論若達此妙性則戲論自滅亦可隨四悉檀作同異等種種說矣。",
        "from": "X13n0285_003:0275a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三顯理性。",
        "from": "X13n0285_003:0275b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝元不知如來藏中性識明知覺明真識妙覺湛然徧周法界含吐十虗寧有方所循業發現。",
        "from": "X13n0285_003:0275b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明性具十法界六識識與本覺皆性皆真也明知覺明即下文所謂性覺妙明本覺明妙指真如理性言之前文既以識心均於六大則今舉一識字便是全舉七大人謂七大秪是根塵識三全體虗妄不是妙明明妙真體殊不知性識即是明知覺明即是真識是故十法界識心一一無非妙覺湛然徧周法界是謂隨緣不變之體由此故有不變隨緣之用含吐十虗何方何所皆是循於十法界業而發現為十法界識也含吐二字通於迷悟且約佛界言之十世古今始終不離當念微塵剎土自他不隔毫端義之如含一念普觀無量劫一光普照十方界義之如吐然含亦非含吐亦非吐故云寧有方所次約迷情言之取頻伽瓶滿中盛空名之為含用餉他國開孔倒瓶名之為吐亦復含無所含吐無所吐故云寧有方所以要言之無不還歸此法界故含徧十虗無不從此法界流故吐徧十虗相宗所謂集起名心集則是含起則是吐也不言隨眾生心應所知量者此識即是眾生之心即是能知之量前之六大恐迷情謂是心外實法故須一一皆云隨心應量今之識大既是直指眾生現前之心但不知其全體即是藏性故以含吐十虗寧有方所而名狀之方知向日所認緣影不惟不是真心斷斷乎亦不是六識矣。",
        "from": "X13n0285_003:0275c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四斥迷惑。",
        "from": "X13n0285_003:0275c24_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世間無知惑為因緣及自然性皆是識心分別計度但有言說都無實義。",
        "from": "X13n0285_003:0276a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "凡外計識心是我或是我所計斷滅者屬邪因緣計常住者屬於自然二乘執此六識是因緣生法無我我所若惑業俱盡不復生識譬如薪盡火滅火無去處愛盡涅槃亦復如是涅槃之界無生無滅名為自然稟通教人以識心即空為因緣空理無生為自然稟別教人以唯識之相四分皆屬依他起性名為因緣唯識之性即是真如無為名為自然此皆不達藏性終無實義也惟其藏性即六識性故彌勒菩薩悟之得成無上妙圓識心三昧已上明性本具相竟從初卷佛告阿難汝我同氣至此是正明理性中第三如來答示已竟。",
        "from": "X13n0285_003:0276a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四大眾圓悟二初經家敘益二當機偈讚。",
        "from": "X13n0285_003:0276a14_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初中二初敘益二敘儀。",
        "from": "X13n0285_003:0276a15_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初又二初略敘二廣敘。",
        "from": "X13n0285_003:0276a16_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0276a16_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時阿難及諸大眾蒙佛如來微妙開示身心蕩然得無罣礙。",
        "from": "X13n0285_003:0276a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "微妙開示者由此即性具相之文方知前來就事顯理之文一一皆是了義極談也不復妄認四大為自身相頓悟清淨法身故身蕩然不復妄認六塵緣影為自心相頓悟常住真心故心蕩然知此妄身妄心不離法身妙心如漚不離海塵不離空漚之與塵豈能為礙於空海故得無罣礙也此略敘悟門亦是總敘下之廣敘即別敘耳。",
        "from": "X13n0285_003:0276a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二廣敘又二初圓悟三大二結屬真因。",
        "from": "X13n0285_003:0276b01_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初又三初悟性量即是相大二悟性體即是體大三悟性具即是用大。",
        "from": "X13n0285_003:0276b02_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0276b04_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "是諸大眾各各自知心徧十方見十方空如觀手中所持葉物。",
        "from": "X13n0285_003:0276b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此翻前一迷為心決定惑為色身之內之迷情也既領七大文中周徧法界之義亦領陰入處界文中性真常中求於去來迷悟生死了無所得之義亦領辨見文中離一切相等義亦領徵心文中七處咸非之義矣。",
        "from": "X13n0285_003:0276b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二悟性體即是體大。",
        "from": "X13n0285_003:0276b11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一切世間諸所有物皆即菩提妙明元心心精徧圓含褁十方。",
        "from": "X13n0285_003:0276b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此翻前迷己為物故於是中觀大觀小之迷情也具如舉一毛端便即菩提妙明元心所以徧能含受十方國土蓋既領七大文中清淨本然之義亦領陰入處界文中其性真為妙覺明體等義亦領辨見文中此見及緣元是菩提妙淨明體等義亦領徵心文中密顯大佛頂義矣。",
        "from": "X13n0285_003:0276b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三悟性具即是用大。",
        "from": "X13n0285_003:0276b19_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "反觀父母所生之身猶彼十方虗空之中吹一微塵若存若亡如湛巨海流一浮漚起滅無從。",
        "from": "X13n0285_003:0276b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此翻前以動為身以動為境譬如澄清百千大海棄之惟認一浮漚體之迷情也惟心所現故云若存心外無體故云若亡因緣和合虗妄有生故其起無所從來因緣別離虗妄名滅故其滅無所從去蓋既領七大文中性色真空性空真色循業發現等義亦領陰入處界文中幻妄稱相等義亦領辨見文中汝身汝心皆是妙明真精妙心中所現物等義亦領徵心文中眼不能見義矣以此為性具并用大者虗空具足眾塵塵塵之性元即空性巨海具足眾漚漚漚之性無非海性故也。",
        "from": "X13n0285_003:0276b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二結屬真因。",
        "from": "X13n0285_003:0276c08_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "了然自知獲本妙心常住不滅。",
        "from": "X13n0285_003:0276c10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "指彼十界依正色心等法總不離我現前一念介爾之心此心體本離過絕非相本豎窮橫徧用本具足恒沙總三義而惟是一心即一心而宛然三義的是人人本有之妙心從來常住不滅所謂無始菩提涅槃元清淨體依此脩行乃能得成無上菩提者也如來最初即語阿難一切眾生生死相續皆由不知常住真心性淨明體今乃了然知之雖是故物義如新獲矣。",
        "from": "X13n0285_003:0276c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二敘儀。",
        "from": "X13n0285_003:0276c18_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "禮佛合掌得未曾有於如來前說偈讚佛。",
        "from": "X13n0285_003:0276c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "從來未悟今日始悟故曰得未曾有受益既深感恩自切故讚佛發願所以報佛恩也。",
        "from": "X13n0285_003:0276c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二當機偈讚二初讚歎述益二誓願請加。",
        "from": "X13n0285_003:0276c21_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初中二初讚圓常人法二述所證淺深。",
        "from": "X13n0285_003:0276c22_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0276c23_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "妙湛總持不動尊首楞嚴王世希有。",
        "from": "X13n0285_003:0276c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此中初一句指能說人次四字述所說法後三字總讚人法皆希有也由阿難徹悟自己心性方知佛所證極與我之所本具毫無差別故矢口而讚只須妙湛總持不動六字収盡三卷經文妙旨亦収一題妙旨亦便吸取下文妙旨亦能該攝一代時教乃至十方三世一切佛法妙旨今當一一點示不與舊解同也言妙湛者即是隨緣常不變義言總持者即是不變常隨緣義言不動者即是隨緣不變不變隨緣無二體義敘悟中云心徧十方空如葉物即妙湛也父母生身如塵如漚即總持也物即妙心心精含褁即不動也又三義惟是一心故名妙湛一心宛具三義故名總持非一非三而三而一故名不動一切眾生是理即妙湛總持不動聞名生解是名字即妙湛總持不動起圓止觀是觀行即妙湛總持不動六根清淨是相似即妙湛總持不動無明初破是分證即妙湛總持不動圓滿徹證是究竟即妙湛總持不動今稱究竟證者故名為尊所謂十號具足天中之天聖中之聖九法界世間所共尊也收前七大妙旨者周徧法界故名妙湛性色真空性空真色循業發現等故名總持清淨本然故名不動又三即一故妙湛一即三故總持非一非三而三而一故不動約究竟故稱尊也收前陰入處界妙旨者性真常中求於去來迷悟生死了無所得故妙湛幻妄稱相故總持其性真為妙覺明體故不動一三三一乃至究竟稱尊如上說收前辨見妙旨者見與見緣并所想相如虗空華本無所有故妙湛本是妙明無上菩提淨圓真心妄為色空及與聞見故總持此見及緣元是菩提妙淨明體故不動又離一切相故妙湛即一切法故總持無是非是故不動又面皺變而見不皺變為妙湛無生滅而捨生趣生為總持生滅與不生滅惟是一心為不動又主空為妙湛主必有客空必具塵為總持主之與客空之與塵實無二性為不動也收前徵心妙旨者正顯七處咸非為妙湛旁顯七處皆是為總持理實無非無是即非即是為不動也悟妙湛故即奢摩他最初方便悟總持故即三摩鉢提最初方便悟不動故即禪那最初方便又悟妙湛總持不動言三即一是奢摩他最初方便悟妙湛總持不動舉一即三是三摩鉢提最初方便悟妙湛總持不動非一非三而三而一是禪那最初方便又悟妙奢摩他三摩禪那言三即一成今妙湛悟妙奢摩他三摩禪那舉一即三成今總持悟妙奢摩他三摩禪那非一非三而三而一成今不動也收一題妙旨者如來密因修證了義名妙湛諸菩薩萬行首楞嚴名總持大佛頂名不動又二修全在一性名妙湛一性具足二修名總持性修不二名不動又首楞嚴者名一切事畢竟堅固謂陰入處界七大畢竟空故稱妙湛畢竟假故稱總持畢竟中故稱不動乃至三一一三究竟名尊具如上說又具足萬行者該具名妙湛積具名總持性具名不動廼至三一一三等如上說又密因者了因佛性名妙湛緣因佛性名總持正因佛性名不動性具三因名不動修中三因名妙湛證發三因名總持廼至三一一三等如上說又不動故稱大妙湛故稱佛總持故稱頂又妙湛故相大總持故用大不動故體大又妙湛故自覺總持故覺他不動故覺滿又妙湛故頂不可見總持故從頂發輝不動故頂相最尊乃至各各三一一三如上說究竟稱為世尊亦如上說吸取下文妙旨者如來藏本妙圓心十界俱非故妙湛如來藏元明心妙十界俱即故總持如來藏妙明心元離即離非是即非即故不動乃至三一一三如上說又圓真實故妙湛通真實故總持常真實故不動三一一三等亦如上說該攝一代時教乃至十方三世一切佛法妙旨者佛法雖多不出權實為實施權開權顯實一切如來說法儀式總不出此今知九界性即佛界性故妙湛佛界性即九界性故總持一性一切性一切性一性故不動也開權顯實故稱妙湛為實施權故號總持權實不二故名不動以要言之報身智慧名妙湛應身功德名總持法身理體名不動又一切智名妙湛道種智名總持一切種智名不動該具功德名妙湛積具功德名總持性具功德名不動真諦之理名妙湛俗諦之理名總持中諦之理名不動是故三身皆妙湛三即一故三身皆總持一即三故三身皆不動非一非三而三而一故今阿難一語便即讚盡自非圓悟安得有此舊謂妙湛領顯見義總持領陰入處界義不動領七大義失於妙旨甚矣首楞嚴王即全性成修三昧之名具如玄義及初卷釋今知徵心辨見四科七大等文無非顯此三昧之體性也希有者九界眾生未悟藏性未具佛德不能說此三昧亦未嘗聞此三昧故為希有今始得聞之耳。",
        "from": "X13n0285_003:0277a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二述所證淺深。",
        "from": "X13n0285_003:0278a11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "消我億劫顛倒想不歷僧祇獲法身。",
        "from": "X13n0285_003:0278a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "億劫顛倒想者即無始以來認悟中迷之妄想也依此妄想故有九法界中因緣自然和合不和合等種種戲論今知隨緣不變不變隨緣妙性故戲論妄想頓消而本有法身斯獲也既言法身必具般若解脫與別教所明素法身不同若欲點示則倒想消處即是解脫能消之智即是般若然此法身三德向本無減但在迷不覺僅有其理義之如失今從迷得悟始覺有功名之為獲而有五位淺深不同所謂名字獲觀行獲相似獲分證獲究竟獲也阿難內祕外現則其本地密獲不可妄測但據迹中顯獲的在圓教初信對彼藏教位齊初果故下文云汝今已得須陀洹果明文在茲惟其方證初信是故還須定境修觀以為證入初住華屋之門當知墮婬室時尚是凡夫所以無無漏戒但有律儀須佛極救而七處計心之文全是見惑所攝耳舊註紛紛不惟罔識如來所說藥相亦復不知阿難所示病相矣。",
        "from": "X13n0285_003:0278a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二誓願請加三初發大願二請佛加三喻不退。",
        "from": "X13n0285_003:0278b05_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今初。",
        "from": "X13n0285_003:0278b06_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "願今得果成寶王還度如是恒沙眾將此深心奉塵剎是則名為報佛恩伏請世尊為證明五濁惡世誓先入如一眾生未成佛終不於此取泥洹。",
        "from": "X13n0285_003:0278b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初一偈是四弘誓願次一偈是增上誓願願今得果成寶王者期心妙覺極果是欲證十界道滅所謂佛道無上誓願成兼攝法門無量誓願知也還度如是恒沙眾是欲滅十界苦集所謂眾生無邊誓願度兼攝煩惱無盡誓願斷也此四弘誓依無作四諦而發故名深心次增上誓中五濁惡世誓先入是勇猛增上蓋五濁眾生剛強難化今達藏性平等無二方無所畏又同體大悲如父母於子病者加憐故也如一眾生未成佛二句是弘伇增上由達藏性豎窮橫徧故不遺一眾生亦不憚盡未來際又同體大悲如父母於子等生愛念故也泥洹亦云涅槃此翻滅度。",
        "from": "X13n0285_003:0278b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二請佛加。",
        "from": "X13n0285_003:0278b21_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大雄大力大慈悲希更審除微細惑令我早登無上覺於十方界坐道場。",
        "from": "X13n0285_003:0278b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "證法體故稱大雄具智斷故稱大力能與拔名大慈悲大力是妙湛德大慈悲是總持德大雄是不動德又此三即一故妙湛此一即三故總持此三非一非三而三而一故不動又證妙湛總持不動理體故名大雄具妙湛總持不動智照故名大力起妙湛總持不動妙用名大慈悲也微細惑者據下文佛告阿難汝今已得須陀洹果已滅三界眾生世間見所斷惑即上文所謂消我億劫顛倒想也又云然猶未知根中積生無始虗習彼習要因修所斷得此指三界思惑又云何況此中生住異滅分劑頭數此指界外別惑即今所謂微細惑也無上覺即究竟覺由細惑除便登妙覺所謂明極即如來也十方界即寂光實報方便同居一切國土所謂一人成佛時法界皆為一佛之依正也。",
        "from": "X13n0285_003:0278b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二喻不退。",
        "from": "X13n0285_003:0278c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舜若多性可銷亡鑠迦羅心無動轉。",
        "from": "X13n0285_003:0278c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舜若多此云空空無可銷但漚滅空本無猶可云銷鑠迦羅此云金剛以喻稱性所發堅固誓願之心同於藏性故終無動轉也大科正明理性已竟。",
        "from": "X13n0285_003:0278c16_0",
        "context_with_next_sentence": false
    }
]