[
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經合轍卷第十明　二楞庵釋　通潤　述阿難彼善男子修三摩地想陰盡者是人平常夢想銷滅寤寐恒一覺明虗靜猶如晴空無復麤重前塵影事觀諸世間大地山河如鏡鑒明來無所粘過無蹤跡虗受照應了罔陳習唯一精真生滅根元從此披露見諸十方十二眾生畢殫其類雖未通其各命由緒見同生基猶如野馬熠熠清擾為浮根塵究竟樞穴此則名為行陰區宇若此清擾熠熠元性性入元澄一澄元習如波瀾滅化為澄水名行陰盡是人則能超眾生濁觀其所由幽隱妄想以為其本。",
        "from": "X14n0289_010:0433b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明行陰未破已破之相也先明想盡行現晝想夜夢皆獨頭意識為主故想盡則寤寐一如而性覺玅明虗靜不動正如晴明太虗纖雲盡淨逈無所有也既法塵已空麤重相滅而意識成玅觀察智觀諸世間大地山河直如鏡之照像毫無去留以虗而受以照而應了無舊時我執習氣沾帶唯是八識精真之體逈然獨存此想盡之相也生滅根元即行陰也以遷流造作故為生滅之元由麤重在前故幽隱不見今粗重既滅而幽隱者始得披露故知三界生死根元非關意識是第八識中含藏種子為本故曰那陀微細識習氣成暴流由見此根本故能盡見十二類生皆由此而生生滅滅也雖未通其各命由緒等者識壽煖三合為命根言想陰已盡雖未曾知十二類生各各受命之由緒而十二類同生之基已見其肇若陽燄光明閃爍不定故曰猶如野馬熠熠清擾言野馬者乃田氣游氣春晴伏地可見狀如水而光如燄渴鹿認以為水而實非水即陽燄也言清擾者謂此行陰幽清擾動非若意識之如大流也為浮根塵究意樞穴者門簨曰樞門臼曰穴皆動轉之要處言根塵生滅皆以行陰為樞穴此即行陰未盡之相也葢想陰如大流行陰如細流識陰如無波之流前之想陰盡如大流息此之行陰現如細流生若將此細流元習之性反入無波元澄之體則元習澄矣若元習一澄則此細流皆為澄清之水此即清水現前名為初伏客塵煩惱此即行陰已盡之相亦是轉第七識為平等性智時也葢眾生之濁本乎行陰故行陰盡而超眾生濁至此則知異生之性遷變不生皆由行陰主之也環師云生滅不停業運常遷名眾生濁故行陰盡則超之由行陰密移曾無覺悟名幽隱妄想。",
        "from": "X14n0289_010:0433b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難當知是得正知奢摩他中諸善男子凝明正心十類天魔不得其便方得精研窮生類本於本類中生元露者觀彼幽清圓擾動元於圓元中起計度者是人墜入二無因論。",
        "from": "X14n0289_010:0434a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此下明行陰將破未破時有十種相也得正知者言想陰已破不遭邪慮方得正知破後二陰名徧如矣奢摩他中即圓定發明也凝則不動明則不惑正則不偏用心如此故天魔不能伺其便也葢受想二陰未破觀力猶淺天魔尚可窺其用心伺其間隙壞其正定今二陰已破唯一精真即外魔無所窺其淺深又安能擾亂哉故下十種皆是內魔作孽也方得精研窮生類本者言想陰既盡天魔不擾方得加功用行精研窮究十二類生之根本故十二類生根元方得披露也幽清圓擾動元者隱密難見曰幽擾微波輕動曰清擾十二同基曰圓擾合而言之謂之動元然雖觀察動元實未曾淨藏識種子故忽起異計墜入無因。",
        "from": "X14n0289_010:0434a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一者是人見本無因何以故是人既得生機全破乘於眼根八百功德見八萬劫所有眾生業流灣環死此生彼秪見眾生輪迴其處八萬劫外冥無所觀便作是解此等世間十方眾生八萬劫來無因自有由此計度亡正徧知墮落外道惑菩提性。",
        "from": "X14n0289_010:0434a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此單計遷流不住以為無常而起斷見也是人指想行已盡之人本無因者謂前際無因也生機全破者行陰披露也由行陰全破六用不行故乘定中眼根功德徹見過去八萬劫中諸類眾生隨業波流死此生彼相續不斷八萬劫前冥然不見妄計冥無所觀處為冥諦為自然為渾混不知己之見量有限遂生妄計以為一切眾生皆從八萬劫前無因而有由此計度便惑此冥諦為正徧知菩提性坐守於此更不前進所謂依舊認賊為子故曰墮曰亡曰惑言外道者即異端也以彼不見根本妄生異計故。",
        "from": "X14n0289_010:0434a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二者是人見末無因何以故是人於生既見其根知人生人悟鳥生鳥烏從來黑鵠從來白人天本竪畜生本橫白非洗成黑非染造從八萬劫無復改移今盡此形亦復如是而我本來不見菩提云何更有成菩提事當知今日一切物象皆本無因由此計度亡正徧知墮落外道惑菩提性是則名為第一外道立無因論。",
        "from": "X14n0289_010:0434b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "末無因者後際無因也何以下是以前際推後際也言我前際本來不見菩提云何後際更有成菩提事此由未見識陰不能別見各命由緒但是總相見於多分眾生長時不變起斯計耳若四果羅漢行開識現便能別見各命由緒終不執於自然矣岳師云本無因之本字當是末字亡正徧知者執無因非正知觀前後際止八萬劫非徧知由彼不達善惡循業發現妄計八萬劫前自然而有八萬劫後自然而無成斷滅論此在邪見中攝。",
        "from": "X14n0289_010:0434b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難是三摩中諸善男子凝明正心魔不得便窮生類本觀彼幽清常擾動元於圓常中起計度者是人墜入四徧常論一者是人窮心境性二處無因修習能知二萬劫中十方眾生所有生滅咸皆循環不曾散失計以為常二者是人窮四大元四性常住修習能知四萬劫中十方眾生所有生滅咸皆體恒不曾散失計以為常三者是人窮盡六根末那執受心意識中本元由處性常恒故修習能知八萬劫中一切眾生循環不失本來常住窮不失性計以為常四者是人既盡想元生理更無流止運轉生滅想心今已永滅理中自然成不生滅因心所度計以為常由此計常亡正徧知墮落外道惑菩提性是則名為第二外道立圓常論。",
        "from": "X14n0289_010:0434c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此單計遷流不住者為徧常而起常見也長水曰行陰生滅相續不失故名常由計四種徧一切法故名圓也瑜伽云依止上中下靜慮起宿命住隨念而生四徧常論一者下計心境常是人想破行現乘此心開遂究心境二性從何而有然見量有限故窮至二萬劫外則不能見遂計一切眾生二萬劫中無因而有然不計劫外無因為斷滅唯計劫內相續為徧常所心異乎前計二者下計四大常此亦行人乘心開而究四大種性本來常住依此修習然心量有限故見四萬劫中眾生雖有生滅而四大體性常恒此亦計劫內所見而已三者下計八識常根字識字之訛六識即眼耳鼻舌身意識也末那即第七識執受即第八識也此由行人乘心開後窮心意意識本元由處本性常恒岳師云本元由處指行陰也依此修習能觀八萬劫中一切眾生死此生彼本性常住良由六八二識皆依第七為生滅根元故即計此生滅根元為常住性如見細流謂之止水此尚未望見八識真常流注況菩提妙性乎所謂無量劫來生死本癡人喚作本來人也四者下計想盡常想元想陰也生理行陰也行人妄謂流轉生滅皆屬想心今已永滅則不生不滅之理自然屬行不待研窮觀察便計為常不知行陰即生滅根元也此四皆計生滅為圓常在邊見中攝。",
        "from": "X14n0289_010:0434c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於自他中起計度者是人墜入四顛倒見一分無常一分常論一者是人觀玅明心徧十方界湛然以為究竟神我從是則計我徧十方凝明不動一切眾生於我心中自生自死則我心性名之為常彼生滅者真無常性二者是人不觀其心徧觀十方恒沙國土見劫壞處名為究竟無常種性劫不壞處名究竟常三者是人別觀我心精細微密猶如微塵流轉十方性無移改能令此身即生即滅其不壞性名我性常一切生死從我流出名無常性四者是人知想陰盡見行陰流行陰常流計為常性色受想等今已滅盡名為無常由此計度一分無常一分常故墮落外道惑菩提性是則名為第三外道一分常論。",
        "from": "X14n0289_010:0435a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此雙計常無常也自即己身他即眾生國土葢平等性中本無自他而妄計自他中道了義本無偏執而妄執兩邊國師所謂南方佛法半生半滅是也一者下在自他處計常無常首二句舉其觀行湛然下明其墮計神我者即二十五冥諦中末後諦也我徧十方即量同虗空我也由彼計有真我周徧十方無生無滅故常眾生在我心中生生死死故是無常二者計三災及不及處為常無常此由不觀自心但觀國土自三禪以下三災所及處計為無常自四禪以上三災所不及處計之為常三者下計自己身心為常無常以身麤而心細故別觀心雖流轉十方而性無改變為常能令此身生死為無常故唯識云體常至細如一極微潛轉身中作事業故四者下觀四陰而雙計也計前三陰已滅為無常行陰現在遷流名為常由此下結成外論此亦邊見中攝。",
        "from": "X14n0289_010:0435b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於分位中生計度者是人墜入四有邊論一者是人心計生元流用不息計過未者名為有邊計相續心名為無邊二者是人觀八萬劫則見眾生八萬劫前寂無聞見無聞見處名為無邊有眾生處名為有邊三者是人計我徧知得無邊性彼一切人現我知中我曾不知彼之知性名彼不得無邊之心但有邊性四者是人窮行陰空以其所見心路籌度一切眾生一身之中計其咸皆半生半滅明其世界一切所有一半有邊一半無邊由是計度有邊無邊墮落外道惑菩提性是則名為第四外道立有邊論。",
        "from": "X14n0289_010:0435b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此雙計有邊無邊也分位有四謂三際見聞彼我生滅也一者下約三際以計有邊無邊生元流用不息者謂觀行陰現在遷流無有間斷遂計過去已去未來未至為有邊計現在相續不斷處為無邊此在無邊際中妄立邊際所謂刻畫虗空也豈知菩提之道無去來今者哉二者下約見聞以計有邊無邊謂八萬劫內有見有聞處為有邊以限於八萬之數也無聞無見處為無邊以無窮無極不可得而知也三者下計彼我為有邊無邊由彼計自己神我色來見色聲來聽聲無不徧知自謂唯我一人得無邊性而彼一切眾生皆現我性之中然我但見其人不見其人之性便計彼人不得無邊之性名有邊性豈知汝自不見非彼人性有邊也四者下約生滅以計常無常此人窮此行陰始有而後空先生而後滅據自己識見妄計眾生身中一半屬生一半屬滅遂判生為有邊滅為無邊此在邪見中攝惑菩提性者以菩提性無分位無邊際故。",
        "from": "X14n0289_010:0435c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於知見中生計度者是人墜入四種顛倒不死矯亂徧計虗論一者是人觀變化元見遷流處名之為變見相續處名之為恒見所見處名之為生不見見處名之為滅相續之因性不斷處名之為增正相續中中所離處名之為減各各生處名之為有互互亡處名之為無以理都觀用心別見有求法人來問其義答言我今亦生亦滅亦有亦無亦增亦減於一切時皆亂其語令彼前人遺失章句二者是人諦觀其心互互無處因無得證有人來問唯答一字但言其無除無之餘無所言說三者是人諦觀其心各各有處因有得證有人來問唯答一字但言其是除是之餘無所言說四者是人有無俱見其境枝故其心亦亂有人來問答言亦有即是亦無亦無之中不是亦有一切矯亂無容窮詰由此計度矯亂虗無墮落外道惑菩提性是則名為第五外道四顛倒性不死矯亂徧計虗論。",
        "from": "X14n0289_010:0436a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計四種矯亂也上計常與無常邊與無邊尚未至混淆此則亦常亦無常亦邊亦無邊一向矯亂此顛倒之尤者也知見者據彼定中所知所見而倒計也婆沙論云外道計天常住名為不死計不亂答得生彼天若實不知而輙答者恐成矯亂故有問時答言秘密不應皆說或不定答佛法訶云此真矯亂一者下明八亦矯亂以一生滅行陰而計八種即四句中雙亦也就上遷流有邊處名變中間相續無邊處名恒非隨緣不變之旨以八萬劫內所見處名生八萬劫外不見處名滅非果生因滅之旨相續不斷處為增中間所離處為減非不增不減之旨生處為有滅處為無非有無俱遣之旨以理都觀者以觀行陰也用心別見者別生八義也以自無定見故逢人問即以兩楹之說而混答之令彼前人於章句中不得義理故隨聞隨失也二者下明唯無矯亂此人在無處觀心即從無處有箇入路故逢人問而答物物皆無三者下明唯是矯亂此人在有處觀心即從有處得箇入路故逢人問而答處處皆是問前以八義並陳可名矯亂今單計有無而以一字答人何故亦名矯亂答執物而不順理為矯中無主正為亂今觀第一第四言皆兩可亂意為多而終非順理亦兼於矯第三第四言惟一偏矯意為多而終非主正同歸於亂故總名矯亂四者下明有無矯亂有無俱見者謂既見互其互有又見其互互無也其境枝故其心亦亂者言所見之境不定能見之心亦不定故有問者即答云亦有即是亦無以有即是無不專於無也亦無不是亦有以無不是有不專於是也良以知見紛錯杳冥恍惚中無定衡故總歸矯亂而已此亦邪見中攝若是真實得底人道有道無總有出身活路。",
        "from": "X14n0289_010:0436a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於無盡流生計度者是人墜入死後有相發心顛倒或自固身云色是我或見我圓含徧國土云我有色或彼前緣隨我迴復云色屬我或復我依行中相續云我在色皆計度言死後有相如是循環有十六相從此或計畢竟煩惱畢竟菩提兩性並驅各不相觸由此計度死後有故墮落外道惑菩提性是則名為第六外道立五陰中死後有相心顛倒論。",
        "from": "X14n0289_010:0436c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計後際有想十六也無盡流即行陰也此由見行陰有相故併前已滅想陰皆成有相色有四相者一色是我者即色是我也二我有色者我大色小色在我中也三色屬我者離色是我也四我在色者色大我小我在色中也色陰既爾三陰亦然此以現在之生有推未來之死亦有故曰死後有相此即六十二見中之四見也從此下更成轉計言煩惱則攝盡染法言菩提則攝盡淨法既知四陰是常則知煩惱菩提二性竝行各不相觸故凡則決定凡聖則決定聖決無轉凡成聖轉煩惱成菩提之事也惑菩提性者迷於不變隨緣之旨而認確定死常故曰惑此亦邊見中攝。",
        "from": "X14n0289_010:0436c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於先除滅色受想中生計度者是人墜入死後無相發心顛倒見其色滅形無所因觀其想滅心無所繫知其受滅無復連綴陰性銷散縱有生理而無受想與草木同此質現前猶不可得死後云何更有諸相因之勘校死後相無如是循環有八無相從此或計涅槃因果一切皆空徒有名字究竟斷滅由此計度死後無故墮落外道惑菩提性是則名為第七外道立五陰中死後無相心顛倒論。",
        "from": "X14n0289_010:0436c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計後際八無相也此由見前三陰已滅無相而因計行陰皆成無相也形因色有故色滅則形無所因心因想繫故想滅則心無所繫以有受則連持色心故無受則無綴三陰既銷縱有行陰亦歸斷滅此則以斷推斷也今觀此身現在尚無陰相可得死後豈有陰相哉此又以身騐死決知無陰相也從此下轉計涅槃因果一切皆無同歸斷滅也惑菩提性者以菩提性不立一塵不捨一法真空妙有妙有真空非斷滅故此亦邊見中攝。",
        "from": "X14n0289_010:0437a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於行存中兼受想滅雙計有無自體相破是人墜入死後俱非起顛倒論色受想中見有非有行遷流內觀無不無如是循環窮盡陰界八俱非相隨得一緣皆言死後有相無相又計諸行性遷訛故心發通悟有無俱非虗實失措由此計度死後俱非後際昏瞢無可道故墮落外道惑菩提性是則名為第八外道立五陰中死後俱非心顛倒論。",
        "from": "X14n0289_010:0437a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計有無俱非也雙計有無者謂以存處計有滅處計無也自體相破有以行陰之現有而破前三之已無以前三之已無破行陰之現有也死後俱非者以破無則成非無破有則成非有故曰非有非無色受想中見有非有者謂在色受想滅中雖見行有亦同色受想滅而非有矣行遷流內觀無不無者謂在行陰擾動之內雖見前三已無亦同行存而非無矣如是窮四陰而徧計遂成八俱非相故隨舉一蘊皆成雙非也又計諸行者蓋不單指一行而兼指萬法言此萬法遷流變化無不雙非故曰心發通悟也虗實失措者以非無故不可言虗以非有故不可言實也由此計度死後俱非者謂以生存例死後也後際昏瞢無可道故者後際即死後未來際昏瞢猶言杳冥謂後際之事杳冥恍惚故道有亦非道無亦非而皆不可道也以未得真知灼見揣摩彷彿而創為此論若真得見諦者不妨道有道無皆成玅論惑菩提性者以菩提性非有非無言思路絕故此亦邪見中攝。",
        "from": "X14n0289_010:0437b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於後後無生計度者是人墜入七斷滅論或計生滅或欲盡滅或苦盡滅或極樂滅或極捨滅如是循環窮盡七際現前消滅滅已無復由此計度死後漸滅墮落外道惑菩提性是則名為第九外道立五陰中死後斷滅心顛倒論。",
        "from": "X14n0289_010:0437b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計七處斷滅也後後無即行陰念念滅也或計生滅等此計陰性如無源之水有流近而竭者有流遠而竭者故雖生七處近遠不同後皆斷竭七際謂四洲六欲初禪二禪三禪四禪四空也身滅即欲界人天欲盡即初禪苦盡即二禪極樂即三禪極捨即四禪及無色界也現前銷滅者三陰已滅行陰亦爾也七處皆現斷滅死後必不復生也若此方儒宗末流但計人間斷滅仍不許有六處惑菩提性者以菩提性亘古亘今常住不斷故此亦邊見中攝。",
        "from": "X14n0289_010:0437c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三摩中諸善男子堅凝正心魔不得便窮生類本觀彼幽清常擾動元於後後有生計度者是人墜入五涅槃論或以欲界為正轉依觀見圓明生愛慕故或以初禪性無憂故或以二禪心無苦故或以三禪極悅隨故或以四禪苦樂兩亡不受輪迴生滅性故迷有漏天作無為解五處安隱為勝淨依如是循環五處究竟由此計度五現涅槃墮落外道惑菩提性是則名為第十外道立五陰中五現涅槃心顛倒論。",
        "from": "X14n0289_010:0437c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計五現涅槃也或者不定之辭以欲界為涅槃者如仙家計玉皇橫統三十三天為玄都上清之境無生無死不知此即六欲之帝釋也由此天澄瑩生明超過日月便計此處是現涅槃若據前文初禪離苦受一切苦惱所不能逼二禪離憂受一切憂懸所不能至故今云初禪無憂二禪無苦誤也三禪極樂以得寂滅樂故四禪苦樂雙亡一切世間諸苦樂境所不能動三災不壞無生滅故此皆迷有漏作無為認生死為涅槃也此由見下界之不安遂計五處為安隱以見下界之穢濁遂計五處為勝淨耳言究竟者計此五處皆是極果也五現涅槃者謂此五處是現在涅槃以現在受樂不待來生故此亦邪見攝惑菩提性者以菩提涅槃尚在遙遠故。",
        "from": "X14n0289_010:0437c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難如是十種禪那狂解皆是行陰用心交互故現斯悟眾生頑迷不自忖量逢此現前以迷為解自言登聖大妄語成墮無間獄汝等必須將如來語於我滅後傳示末法徧令眾生覺了斯義無令心魔自起深孽保持覆護消息邪見教其身心開覺真義於無上道不遭枝岐勿令心祈得少為足作大覺王清淨標指。",
        "from": "X14n0289_010:0438a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此結勸覆護也故現斯悟者心發邪悟知其悟而不知其迷也自起深孽者言外魔不擾皆是自己心魔為孽所謂自作孽也故知心正事正心邪事邪若未達一心觸途皆偽正行亦成邪行佛門變作魔門若了一心則無往不利苦行亦成玅行邪宗即是正宗只如五熟炙身外道一法若了之則勝熱為無分別智燄之門若昧之則尼乾作大邪見嚴熾之解是以法無邪正道在變通於無上道不遭枝岐者言此十種如木之枝而非本如路之岐而非正也無令心祈得少為足者祈求也勿令心之所求而以偃鼠鷦鷯之見自限葢遭枝岐即墮於外道得少為足即墮於二乘故囑其為眾生作成佛之標指令其直往不令中途遭委曲也。",
        "from": "X14n0289_010:0438a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難彼善男子修三摩提行陰盡者諸世間性幽清擾動同分生機倐然隳裂沉細綱紐補特伽羅酬業深脉感應懸絕於涅槃天將大明悟如雞後鳴顧瞻東方已有精色六根虗靜無復馳逸內外湛明入無所入深達十方十二種類受命元由觀由執元諸類不召於十方界已獲其同精色不沉發現幽秘此則名為識陰區宇若於羣召已獲同中消磨六門合開成就見聞通隣互用清淨十方世界及與身心如吠瑠璃內外明徹名識陰盡是人則能超越命濁觀其所由罔象虗無顛倒妄想以為其本。",
        "from": "X14n0289_010:0438b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明識陰未盡已盡之相也諸世間性即異生性也同分生機即同生基也基表生之根機表動之始沉細綱紐亦指行陰言以幽隱深微故曰沉細生滅總要故曰綱紐由前堅凝正心用功不輟至此而生死綱紐忽然隳裂也補特伽羅此云數取趣即中有身也綱紐既立則三界諸趣受生償業之深脉此感而彼應者皆懸遠隔絕矣此行陰已盡之相也由生死既絕而涅槃性天將大明悟如雞後鳴也葢涅槃性天為五陰所覆昏如長夜每一陰現如報雞一鳴故色陰現如雞初鳴受陰現如雞二鳴至識陰現則如雞後鳴矣迴顧涅槃性天已有精色微露但未能透明以有一層識陰區宇未破故也然行陰既盡無復遷流而六根始得虗靜不復馳逸於是內根外塵化為一味湛明之境故內不見有能入之根外不見有所入之塵唯識所謂離二取相故得真住唯識也受命元由即前各命由緒指第八識也良以根塵既銷業識始露今既觀見受命由緒復能執守受生元本故十二類中不能復牽召其受生矣至此則斷異生性障證徧行真如故曰於十方界已獲其同然此纔是初入地相初證真如初見佛境界如見東方已有精色殊非向前昏沉望佛境而不見也但所見佛境若黎明時見物非若大明當空無不洞徹此識陰未盡之相也若於群類既不能召而於十方又獲其同若使更用金剛智力銷磨六門使其分者合壅者開皆得成就則六根如隣之相通可以互用而世界身心內外明徹如吠瑠璃成一圓融清淨寶覺此非發現幽秘之比是識陰已盡之相也藏經音義曰吠琉璃寶名此寶青色其體甚堅一切寶刀皆不可壞亦非烟燄所能鎔鑄唯鬼神有神通力者能攻之為器也亦云即金翅鳥卵以清瑩明徹猶如金剛不可破壞故借以為喻故知行盡無過者在七信位齊小羅漢識盡乃十信滿心住位初心始得證入圓通是知凡言羅漢獲圓通者皆指初住以圓住齊於別地是大乘羅漢故葢受命之濁本乎識陰識陰已盡則連持色心不斷者亦已斷盡故得超命濁至此方見受命之元是罔象虗無妄想主之也言罔象虗無者謂此虗無恍惚不真是真識中生滅影子非真虗無也。",
        "from": "X14n0289_010:0438b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難當知是善男子窮諸行空於識還元已滅生滅而於寂滅精妙未圓能令己身根隔合開亦與十方諸類通覺覺知通脗能入圓元若於所歸立真常因生勝解者是人則墮因所因執婆毗迦羅所歸冥諦成其伴侶迷佛菩提亡失知見是名第一立所得心成所歸果違遠圓通背涅槃城生外道種。",
        "from": "X14n0289_010:0439a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此下明識陰將盡未盡之相其類有十也一因所因執窮諸行空者照見行陰空也於識還元者謂行相泯然歸於識海如波瀾滅化為澄水時亦是生滅已滅寂滅將現時由識陰未破尚有所覆故於寂滅精玅之理未得圓滿然令向之六根隔開者今始合也亦與十方諸類通覺者即諸類不召已獲其同此是行盡而識現也覺知通脗能入圓元者言此知覺上與諸佛相通下與眾生脗合即受命之元發覺之元皆由於此今四陰蕩盡渾身已住其中故曰能入圓元此正識陰區宇也若於下謂於是中起法執而墮外道也所歸指圓元謂即於圓元為歸休處遂立此處為真常因以為決定而不可轉不知此圓元處實非真常因而妄執為真常因故墮因所因執若作此解則與黃頭外道所執冥諦同一類矣言冥諦者百論云從冥生覺從覺生我知從我知生五唯量從五唯量生五大從五大生十一根神我為主常覺相處中不敗不壞攝受諸法此中所執冥諦為第一諦中間二十三法從冥諦生神我即受用此二十三法者也迷菩提者謂不知正果亡知見者謂不知正因是名下結成外種立所得心成所歸果者以不達圓滿菩提歸無所得而妄計有所得所歸也向也根隔合開圓通將近今則圓者徧而通者隔反違遠矣向也於涅槃天將大明悟今則背涅槃城而不見矣向也覺心欲發將為佛子今則反成外道種姓矣。",
        "from": "X14n0289_010:0439a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又善男子窮諸行空已滅生滅而於寂滅精妙未圓若於所歸覽為自體盡虗空界十二類內所有眾生皆我身中一類流出生勝解者是人則墮能非能執摩醯首羅現無邊身成其伴侶迷佛菩提亡失知見是名第二立能為心成能事果違遠圓通背涅槃城生大慢天我徧圓種。",
        "from": "X14n0289_010:0439b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計能非能執也前認識陰為歸托處此即以前所歸托處攬為識體而謂一切眾生皆從我體流出遂執我能生彼彼不能生故曰能非能執由作此解正與摩醯首羅同一種類蓋首羅能現無邊眾生身遂為一切眾生皆我流出是能窺見海能生漚而不知己身尚未離漚也能為心能事果者謂我能作為我能辦事因因果果總是我也大慢天即指摩醯以執我能生物輕慢一切故我徧圓種者謂我徧我圓故十二類生皆我流出也。",
        "from": "X14n0289_010:0439b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓若於所歸有所歸依自疑身心從彼流出十方虗空咸其生起即於都起所宣流地作真常因無生滅解在生滅中早計常住既惑不生亦迷生滅安住沉迷生勝解者是人則墮常非常執計自在天成其伴侶迷佛菩提亡失知見是名第三立因依心成妄計果違遠圓通背涅槃城生倒圓種。",
        "from": "X14n0289_010:0439c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計常非常執也謂行盡識現時即以識陰為自身所歸所依之處故自疑身心世界皆從彼中流出即此便是不生滅性此認湛不搖處為不生滅不但不見不生滅性亦迷現在生滅之法是以非常為常故曰常非常執作此見解正與計自在天為萬物因者同一類矣豈知自在亦非常之天哉由外道不知遂執此為生天生地之本溫陵曰由依識元妄計常住故曰立因依心成妄計果前計我圓生物此計彼圓生我故曰倒圓問萬法唯識是如來正說云何此中皆墮外種答內教萬法唯識從緣變起悉如夢幻不是實生故不立知見不生法執今曰立所得心立依因心立能為心皆是知見立知故總墮外道。",
        "from": "X14n0289_010:0439c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓若於所知知徧圓故因知立解十方草木皆稱有情與人無異草木為人人死還成十方草樹無擇遍知生勝解者是人前墮知無知執婆吒霰尼執一切覺成其伴侶迷佛菩提亡失知見是名第四計圓知心成虗謬果違遠圓通背涅槃城生倒知種。",
        "from": "X14n0289_010:0440a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計知無知也所知即所觀識陰知徧圓者謂此識性無處不徧也因知立解者謂因知徧圓而生見解妄謂無情草木與人無異不分有情無情故曰無擇是人則墮有情無情皆有知覺則與婆吒霰尼二種外道同一類矣溫陵曰此謬計圓知以為因心則果終虗謬矣以無知為知是倒知也問觀國師有情與無情其一體之說忠國師有無情作佛之談有何差別答內教謂由迷真如而成業識從業識而起相見遂分有情無情各自安立既悟之後則轉業識而成真如故有情無情同一圓融清淨寶覺通為一佛國土謂之法性身法性土全身是土全土是身豈復有草樹為人人為草樹種種差別是知內教所說無情說法是說破識之後渾成一心時也此則業識尚在相見猶存未能融為一體是妄計也問前文草木金石皆能作妖為孽豈非有情乎答此是依草附木之精靈有知非草木元有知也曰若老楓化為羽人朽麥化為胡蝶此自無情而之有情賢女化為貞石山蚯化為百合此自有情而之無情則又何謂答此偶有所感而化也非老楓朽麥元有情也亦非賢女山蚯元無情也今之未破識陰而妄言天地同根萬物一體者皆婆吒霰尼之儔也昔晦堂老人與夏倚公立論道至會萬法為自己及情與無情其一體時有一犬臥香案下以壓尺擊犬又擊香案曰犬有情便去香案無情自住情與無情何得便成一體去夏不能答堂云纔入思惟便成剩法何曾會萬法為自己耶。",
        "from": "X14n0289_010:0440a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓若於圓融根互用中已得隨順便於圓化一切發生求火光明樂水清淨愛風周流觀塵成就各各崇事以此羣臣發作本因立常住解是人則墮生無生執諸迦葉波并婆羅門勤心役身事火崇水求出生死成其伴侶迷佛菩提亡失知見是名第五計著崇事迷心從物立妄求因求妄冀果違遠圓通背涅槃城生顛化種。",
        "from": "X14n0289_010:0440b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計生無生執也識陰盡者銷磨六門諸根互用今雖未得互用已得隨順十八神變便能覩見四大元化之相妄謂一切變化皆從四大發生於是背自己之性火光明而求火光明背自己之性水清淨而求水清淨背自己之性風周流而愛風周流背自己之性地無法不生而妄計地大為能生於是事水事火事風事地求出生死以此四大為造物之根源遂立此四大為司物之真宰妄計能生萬物而實不能生故曰生無生執迦葉波即事火外道言作如是解者便與此等同一類也迷心逐物猶言背覺合塵不當求而求曰妄求不當冀而冀曰妄冀四大為所生所化而實非能生能化執此不能生不能化者為能生能化是名顛倒化理且心為化原識是化種今迷心從物捨本逐末非顛倒而何欲出生死返入生死矣。",
        "from": "X14n0289_010:0440b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓若於圓明計明中虗非滅羣化以永滅依為所歸依生勝解者是人則墮歸無歸執無想天中諸舜若多成其伴侶迷佛菩提妄失知見是名第六圓虗無心成空亡果違遠圓通背涅槃城生斷滅種。",
        "from": "X14n0289_010:0440c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計歸無歸執也圓明即識陰也見圓明而遂計明中罔象虗無之體為畢竟空性便欲灰身泯智以永滅空為歸休之地不知此永滅空亦是幻境非實歸處也無想天是略言非非想以該四空是其同類也圓虗無心者以罔象虗無為因也成空亡果者以斷滅空亡為果也。",
        "from": "X14n0289_010:0440c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓若於圓常固身常住同於精圓長不傾逝生勝解者是人則墮貪非貪執諸阿斯陀求長命者成其伴侶迷佛菩提亡失知見是名第七執著命元立固妄因趣長勞果違遠圓通背涅槃城生妄延種。",
        "from": "X14n0289_010:0440c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計貪非貪執也圓常亦識因也觀圓常而欲固身常住同於精圓者亦若此方性命雙修形神俱玅之意也貪非貪執者此是妄生貪著留形世間不知此身本不可貪以為常以此身如芭蕉電露故也阿斯陀此云無比即古仙也執著命元者以識陰為長命之元立固妄因者身非常住久必壞生故以長生為固妄也趣長勞果者勞我以生息我以死故以久壽為長勞也生妄延種者不知法身是亘古亘今不毀不壞之體而欲希延壽命以長存故曰妄也。",
        "from": "X14n0289_010:0441a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓觀命互通却留塵勞恐其銷盡便於此際坐蓮華宮廣化七珍多增寶媛恣縱其心生勝解者是人則墮真無真執吒枳迦羅成其伴侶迷佛菩提亡失知見是名第八發邪思因立熾塵果違遠圓通背涅槃城生天魔種。",
        "from": "X14n0289_010:0441a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計真無真執也觀命互通者以識壽暖三連持不斷者為命今觀見各命由緒皆以識陰為主是識陰互通一切命也若識陰盡則彼我之陰亦盡誰證真常誰為度生故却留塵勞以固命根復恐銷盡故自化七珍寶媛窮奢極欲以為大菩薩行事不知縱恣其心邪思已久非若菩薩真見命元留法執以度生也由彼妄計此是真菩薩行而不知非真故曰真非真執吒枳迦羅即欲頂自在天能化欲境而自娛樂者發邪思因立熾塵果者始欲以緣思淨盡為因今反以邪思縱恣為因矣始欲以纖塵不立為果今反以塵勞熾盛為果矣昔鬱頭藍弗以世俗智伏下地惑得非想定具五神通時君尊敬迎以入宮宮中女子接足而禮藍弗觸女子手遂用貪愛便失神通故曰纔生一念欲便失五神通豈有邪思熾塵而不退墮者乎。",
        "from": "X14n0289_010:0441a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓於命明中分別精麤疏決真偽因果相詶惟求感應背清淨道所謂見苦斷集證滅修道居滅已休更不前進生勝解者是人則墮定性聲聞諸無聞僧增上慢者成其伴侶迷佛菩提亡失知見是名第九圓精應心成趣寂果違遠圓通背涅槃城生纏空種。",
        "from": "X14n0289_010:0441b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此計定性聲聞也命明猶言命光即識陰也此識既含藏漏無漏種故於此中分別決擇苦集種子是有漏是麤是偽滅道種子是無漏是精是真修道為因曰感證減為果曰應此皆實修實證唯求速出生死而趨涅槃殊不知清淨道中本無生死及涅槃也故永嘉云知苦常懷厭離斷集恒畏其生慕滅獨證無為修道唯論自度故一居寂滅即便休息於諸菩薩遊戲神通淨佛國土不生好樂所以戀住化城不趨寶所言定性聲聞者即不回心鈍阿羅漢也無聞僧即愚法聲聞未得謂得未證謂證者圓精應心謂滿其專精求應之因成其獨感趣寂之果然此有餘涅槃僅齊七信識陰所覆尚不達圓通因地安能至無餘果地哉此由空所纏縛以小知小見為足亡失佛之知見不能趨向大乘寂滅場地所謂夜明簾外轉身難也。",
        "from": "X14n0289_010:0441b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又善男子窮諸行空已滅生滅而於寂滅精妙未圓若於圓融清淨覺明發研深妙即立涅槃而不前進生勝解者是人則墮定性辟支諸獨覺倫不迴心者成其伴侶迷佛菩提亡失知見是名第十圓覺脗心成湛明果違遠圓通背涅槃城生覺圓明不化圓種。",
        "from": "X14n0289_010:0441c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明定性辟支也銷六入一為圓融破有歸空為清淨了見命元為覺明發研深妙者獨覺則觀物變易發深妙之悟緣覺則觀十二因緣發深妙之悟也即於發深妙處立為涅槃歸休之地堅執不捨滯在圓明一路不趨寶所所謂水澄月滿道人愁也定性辟支比之聲聞已勝一步以能侵斷習氣故也圓覺脗心者獨覺緣覺雖皆與覺明脗合但非圓融清淨寶覺還是精覺脗合之心故成元澄湛明之果也不化圓種者以有覺在非若菩薩常覺不住故曰不化昔有僧問曹山朗月當空時如何山曰猶是階下漢僧云請師接上階山日月落後相見問聲聞辟支皆是出世聖人何故亦列魔數答此經以圓通為宗略有纖毫沾帶便是違背圓通故約其沾著法執處實與眾魔無異然但取其不回心者若肯回心便名大阿羅漢不墮斯類矣。",
        "from": "X14n0289_010:0441c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難如是十種禪那中塗成狂因依迷惑於未足中生滿足證皆是識陰用心交互故生斯位眾生頑迷不自忖量逢此現前各以所愛先習迷心而自休息將為畢竟所歸寧地自言滿足無上菩提大妄語成外道邪魔所感業終墮無間獄聲聞緣覺不成增進汝等存心秉如來道將此法門於我滅後傳示末世普令眾生覺了斯義無令見魔自作沉孽保綏哀救銷息邪緣令其身心入佛知見從始成就不遭岐路。",
        "from": "X14n0289_010:0442a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此勉勸覆護也中途成狂前八居多未足生足後二居多也因依迷惑者言此十種皆依無明妄執生起所愛先習即無始來墮貪愛境所薰習氣今於定中各自發現故在中塗自畫不進妄謂究竟此皆墮在大妄語中也前七是外道第八是邪魔若魔外既由邪心感邪福業俱未斷惑故業盡而必墮若後二種已能斷惑取證但不增進亦無墮落矣見魔者分別曰見岳師曰前七純是見第八是見愛以留塵勞生勝解故至於二乘界內見愛雖盡而法愛猶存總屬分別見妄綏安也邪緣即指見孽除此見孽則自然證入佛知見地中間更無諸委曲相矣故初卷云皆由不知常住真心用諸妄想至此則知妄想即是五陰若此五陰妄想有一毫不淨不能得入佛知佛見若破除五陰方得真無生法忍譬如髯公五關斬將方能得見真主之意已上五十種見解竝是迷宗失旨背湛乖真揑目生華迷頭認影若敲氷索火緣木求魚畏影逃虗捫空捉電苦非甘種砂豈飯因皆不能以法性融通一旨和會盡迷方便悉入見纏不達正宗皆投見網所以天魔外道本無其種修行失念遂派其原故知但有所重所依立知立解絲毫見處不亡皆成外道故華嚴經云見在即凡情亡即佛祖師云不用求真唯須息妄是以悟宗之士尚不得無見無解豈可更隨言執意而起有見有解乎。",
        "from": "X14n0289_010:0442a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如是法門先過去世恒沙劫中微塵如來乘此心開得無上道。",
        "from": "X14n0289_010:0442b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此結顯諸佛共證也如是法門者是指識陰中辨魔法門言恒沙如來未有不從破除識心而成無上菩提者前文云陀那微細識習氣成暴流真非真恐迷我常不開演所以迷之則中途成狂悟之則轉識成智故曰過去諸如來斯門已成就。",
        "from": "X14n0289_010:0442b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "識陰若盡則汝現前諸根互用從互用中能入菩薩金剛乾慧圓明精心於中發化如淨琉璃內含寶月如是乃超十信十住十行十迴向四加行心菩薩所行金剛十地等覺圓明入於如來玅莊嚴海圓滿菩提歸無所得。",
        "from": "X14n0289_010:0442b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明入住菩薩將此不生不滅為本修行然後圓成果地修證故曰識陰若盡則一根可作諸根用此正初住圓通位也以初住中即能直入等覺後心更無委曲故曰從互用中能入菩薩金剛乾慧究其所以皆由初住心精發暉十用涉入圓成一心所謂現在諸菩薩今各入圓明也從此圓明心中發清淨化正如琉璃之含寶月如是而超越四十四心以至等覺後心則圓明發化已極故從金剛無間道轉入解脫道故曰入於如來妙莊嚴海所謂一門超出妙莊嚴路也圓滿菩提歸無所得者金剛經云若有一法可得然燈佛則不與我授記故得無所得證無所證即是見性成佛不從外得華嚴所謂初發心時便成正覺以此圓教是上上根人一生頓超如龍女善財皆從初住超之前文所謂後是凡夫上歷菩薩六十聖位葢圓宗只有二位一斷前通惑從觀行位一超直入初住中間更不取證二斷後別惑從入初住一超直至等覺中間亦不取證非若別教一位必經多劫漸斷漸證直至滿三祇劫因圓果滿取證菩提也此圓頓法門若上上根知此當下便是更無欠少二乘知此回心增進得大涅槃此奢摩他三摩禪那所以為妙覺非尋常觀行可修得者故始曰妙奢摩他等而終曰妙覺妙莊嚴海始曰悟妙明心元所圓滿常住心地而終曰圓滿菩提歸無所得也通議云從互用中即入金剛乾慧者此言識陰一破則不歷諸位一超直入圓證佛果此乃上根利智如觀音耳根圓通生滅既滅寂滅現前忽然超越世出世間故今識陰一破則六根互用從互用中即入菩薩金剛乾慧是則但破生相無明便成佛果不必定歷諸位也是知五陰次第未必一一經歷但約觀心通途故須一一開示耳。",
        "from": "X14n0289_010:0442c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此是過去先佛世尊奢摩他中毗婆舍那覺明分析徵細魔事魔境現前汝能諳識心垢洗除不落邪見陰魔銷滅天魔摧碎大力鬼神褫魄逃逝魑魅魍魎無復出生直至菩提無諸少乏下劣增進於大涅槃心不迷悶。",
        "from": "X14n0289_010:0443a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此言先佛授受心法以示行人也言此魔事皆是古佛在止觀中用始覺智觀察魔事歷歷分明雖害定者是魔而致魔者實由五陰主人若主人心淨汝能諳識即有魔事現前不生取著不落邪見則陰魔天魔神鬼魍魎皆喪魄逃逝不復出生矣若發足不成顛倒中塗不致成狂則直至圓滿菩提萬德莊嚴無不具足若下劣聲聞滯跡化城不趨寶所者由此增進直至如來大涅槃海亦不迷悶矣。",
        "from": "X14n0289_010:0443a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若諸末世愚鈍眾生未識禪那不知說法樂修三昧汝恐同邪一心勸令持我佛頂陀羅尼呪若未能誦寫於禪堂或帶身上一切諸魔所不能動汝當恭欽十方如來究竟修進最後垂範。",
        "from": "X14n0289_010:0443a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此重示密修功用也若利根人從發心住一超直入更無魔事留難若鈍根者既不識禪那又不解說法而心復好樂直修反聞大定汝恐落於邪見何由保護令彼專心一意持此呪心則一切諸魔自不能擾以見顯密皆是大佛頂至尊至勝第一法門不可思議境界故復以持呪終之最後垂範若約當經則此魔事在末後宣揚故曰最後若約一大時教則此經在法華已後宣說亦曰最後也第二大科已竟。",
        "from": "X14n0289_010:0443b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難即從座起聞佛示誨頂禪欽奉憶持無失於大眾中重復白佛如佛所言五陰相中五種虗妄為本想心我等平常未蒙如來微細開示又此五陰為併銷除為次第盡如是五重詣何為界唯願如來發宣大慈為此大眾清明心目以為末世一切眾生作將來眼。",
        "from": "X14n0289_010:0443b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此復問五陰所以名妄想也世尊尋常但說此五陰法皆是仗因托緣而生曾未說此五種皆本妄想生起如色名堅固妄想受名虗明妄想等我等今日雖一往聞此微細開示然不知此五種陰何故通明妄想若此五陰既總名妄想今日若欲剗除為當一時併盡為復次第漸除若欲斷除至於何處方得盡其邊際更願大慈無倦重為發宣也。",
        "from": "X14n0289_010:0443b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛告阿難精真妙明本覺圓淨非留生死及諸塵垢至乃虗空皆因妄想之所生起斯元本覺妙明真精妄以發生諸器世間如演若多迷頭認影妄元無因於妄想中立因緣性迷因緣者稱為自然彼虗空性猶實幻生因緣自然皆是眾生妄心計度阿難知妄所起說妄因緣若妄元無說妄因緣元無所有何況不知推自然者是故如來與汝發明五陰本因同是妄想。",
        "from": "X14n0289_010:0443b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此總示五陰皆以妄想為本也言此精真妙明本覺之體本來圓滿本來清淨纖毫不著一物不留即根身器界乃至虗空皆非清淨心中所有之物生死根身也塵垢器界也以此根身器界虗空皆因妄想之所生起所謂晦昧為空空晦暗中結暗為色色雜妄想想相為身也斯元本覺玅明真精本來圓淨皆由妄想發生諸器世間本非實有而妄認為實正如演若迷頭而認鏡中之影以為實無異也既從妄生則非有因汝等尋常但知五陰從因緣生非妄想有不知此因緣性皆依無知業愛而生也由迷此無知業愛而生則又計為本覺妙明心中自然而有且此虗空從清淨覺中一念晦昧而起者尚非實有又況因緣自然皆是眾生妄想分別計度生起者乃實有耶然我向來見諸眾生妄執五陰以為實法故我強說五陰從妄心起從因緣生今既知得五陰元無處所故說妄性因緣元無所有故我所說五陰諸法從因緣生非一定語故曰因緣所生法我說即是空亦名為假名亦名中道義且因緣所生諸法尚無實有但是假名又況不知因緣而推一切法從自然生者非妄而何是故如來今日與汝發明五陰本因同是妄想欲令汝知一切諸法皆以妄為本也。",
        "from": "X14n0289_010:0443c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝體先因父母想生汝心非想則不能來想中傳命如我先言心想酢味口中涎生心想登高足心酸起懸崖不有酢物未來汝體必非虗妄通倫口水如何因談酢出是故當知汝現色身名為堅固第一妄想。",
        "from": "X14n0289_010:0444a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此名色陰為堅固妄想也汝且不知色陰為堅固妄想耶即汝形體先因父母妄想生起以有愛染而後有赤白故也雖有父母想心若汝中陰愛涎不發決不能流愛為種而來父母想中結胎以續其命則知渾身都是妄想所成復恐不知故復以喻明云正如想酢味而水出想懸崖而足酸且懸崖不曾有酢物不曾來汝體若非妄想同類則口中之水如何因人談酢梅而出乎色陰所以名堅固妄想者如此言堅固者父母己三和合一處凝結而成故。",
        "from": "X14n0289_010:0444a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即此所說臨高想心能令汝形真受酸澁由因受生能動色體汝今現前順益違損二現驅馳名為虗明第二妄想。",
        "from": "X14n0289_010:0444a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明受陰為虗明妄想也即將前足心受酸澁處發明者所謂一滴水墨兩處成龍也言此懸崖不來令汝足心真受酸澁豈非汝之胸中已先領受懸崖高峻之語故能動汝色體能令汝形真受酸澁乎且汝現前因違順二境而生損益二受交驅互馳而不休息此受陰所以稱虗明妄想也受有三謂苦受樂受捨受損益即苦樂二受也以虗故受如太虗之受物以明故受如明鏡之受像。",
        "from": "X14n0289_010:0444a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "由汝念慮使汝色身身非念倫汝身何因隨念所使種種取像心生形取與念相應寤即想心寐為諸夢則汝想念搖動妄情名為融通第三妄想。",
        "from": "X14n0289_010:0444b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明想陰為融通妄想也念慮即意識也謂一身以意識為主宰故眼耳鼻舌以及手足皆聽其使役汝身若非意識同類何因隨意所使令耶故凡目前種種取像必因意識先動而後諸根方取足知此身與念相應無頃刻離正如歌舞工伎之人隨他拍轉拍緩則步緩拍急則步急五根亦如是但隨意轉何者意地若生身輪動作意地若息根境寂然故寤與形接則為想寐與神交則為夢則知汝身皆是想念搖動妄情此想陰所以名融通妄想也言融通者謂此想心在五根中若寤若寐皆由此作主故得圓融通貫也。",
        "from": "X14n0289_010:0444b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "化理不住運運密移甲長髮生氣銷容皺日夜相代曾無覺悟阿難此若非汝云何體遷如必是真汝何無覺則汝諸行念念不停名為幽陰第四妄想。",
        "from": "X14n0289_010:0444b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明行陰為幽隱妄想也運運者變之又變也密移者密密推移人不覺知也甲長髮生生也氣銷容皺滅也言生滅日夜相代乎前而無一人能覺悟者正見其密移也故粥熊曰運轉亡已天地密移疇覺之哉此若下指出行陰是妄想若此行陰非汝體者云何使汝甲生髮長等若此行陰真汝身者云何日夜遷變曾無覺悟則知行陰念念遷變而不覺知所以名幽隱妄想也。",
        "from": "X14n0289_010:0444b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又汝精明湛不搖處名恒常者於身不出見聞覺知若實精真不容習妄何因汝等曾於昔年覩一奇物經歷年歲憶忘俱無於後忽然覆覩前異記憶宛然會不遺失則此精了湛不搖中念念受熏有何籌算阿難當知此湛非真如急流水望如恬靜流急不見非是無流若非想元寧受妄習非汝六根互用開合此之妄想無時得滅故汝現在見聞覺知中串習幾則湛了內罔象虗無第五顛倒微細精想阿難是五受陰五妄想成。",
        "from": "X14n0289_010:0444c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明識陰為微細精想也精明即前文一精明也湛不搖處即湛若止水皆指第八識也名恒常者言汝以精明湛不搖處為真常乎則汝一身不出六根若果精真則不雜不妄不應復受雜妄薰習何因昔年曾覩之物忘失已久而再覩時宛然如故葢最初薰習雖由前六而記持不失則第八之功以第六如聚斂之臣第八如庫藏之吏故再覩奇物經多年而記憶宛然者皆由第八精了湛不搖處念念受薰之力也由其罔象虗無故薰之以真則真薰之以妄則妄耳阿難下喻明非真言此湛不搖處尚非真常不動之性喻如急流之水望之若安恬寂靜此但流急故不見其流相非真不流則知水流處藏識亦復如是非真不動以此是前四妄想根元故受妄習若非妄想根元寧受前四妄習之心哉然此想元非得六根互用開合成就無由得滅何以故以第八與前六根同一體性安危其同真則同真妄亦同妄故六根銷磨則此妄元如湯銷氷應念化成無上知覺今汝現在六根之中串習幾微不忘視聽者都由精想念念受薰故在眼能見在耳能聽以此精了湛不搖者元從一念無明而有故似有如無而非真無故曰罔象虗無此識陰所以名顛倒微細精想也言顛倒者顛倒妙圓真淨玅心而有故言微細者流急不見故言精想者聽精見精皆是此一精想故故知此五受陰雖有粗細五種不同然皆五種妄想所成非本來自有也是以若見五陰有即眾生世間若了五陰空即真諦世間若了五陰實相即中道第一義正覺世間離此五陰三世間外更無一法能建能立為俗為真一代時教所詮除此別無方便迷此為凡悟此成佛唯是一心開合無異耳已上答五陰皆名妄想已竟。",
        "from": "X14n0289_010:0444c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝今欲知因界淺深唯色與空是色邊際唯觸與離是受邊際唯記與忘是想邊際唯滅與生是行邊際湛入合湛是識邊際。",
        "from": "X14n0289_010:0445a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此答前五陰詣何為界也因即五種妄想因界即五種妄想因之界限邊際也淺深者謂五種妄想前為淺淺後為深深也唯色與空是色邊際者有分段曰色無分段曰空尋常但知有分段身色為色陰邊際而不知空此分段色身亦是色陰邊際也以無色界尚有微細色質故根境相對曰觸根境不對曰離尋常但知領納違順二境為受邊際不知不領納二境亦是受邊際也故梵志以不受為宗世尊詰之曰是見受否故知受固受而一切不受亦受也有念為記無念為忘人但知念一切法為想邊際不知不念一切法亦是想邊際也如圓覺云動念息念皆歸迷悶是也化無而有曰生化有而無曰滅人但知念念遷流喻如暴流者為行不知至不遷處化為澄水時亦是行邊際以有無風匝匝之波故經云至於無生法忍猶為三相遷流是也反還曰入混一曰合人但知分汝湛圓覺性為視聽觀察而流逸奔色奔聲等為識邊際不知反流旋一合於圓湛猶是識之邊際以欲真已非真真如性故故知但知色之為色而不知空亦是色者淺若知空色皆色者深乃至但知出流分湛為識不知反流合湛亦識者淺若知出流分湛與反流合湛皆識邊際者深是則如來發明五重妄想邊際可謂極盡其界矣。",
        "from": "X14n0289_010:0445b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此五陰元重疊生起生因識有滅從色除理則頓悟乘悟併銷事非頓除因次第盡我已示汝劫波巾結何所不明再此詢問汝應將此妄想根元心得開通傳示將來末法之中諸修行者令識虗妄深厭自生知有涅槃不戀三界。",
        "from": "X14n0289_010:0445c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此答前問五陰頓除漸斷也重疊生起者謂一重疊一重次第生起也由一念不覺而轉此覺心為業識因識有行因行有想因想有受因受有色此五陰元從次第而生也今日解除固當先滅色次滅受滅想滅行而後滅識也生則從細至麤猶如着衣滅則從麤至細猶如脫衣但五陰之理圓元從一念妄想生故一言之下心地開通乘其一悟而疑惑頓除若銷我億劫顛倒想是也若五陰之相從次第結故當從次第而漸盡也我已前來綰巾示結以明次第生者當次第解已是法喻昭然何所不明而於此再問者何耶故知前之六結此之五陰皆是次第生而次第解也汝應下結勸傳示也心得開通者謂了達根元全是妄想生起非性本有此教其自悟也傳示下復教其悟人也令識虗妄者言令一切眾生皆達此五陰虗妄也深厭自生者若達此五陰虗妄則深厭此生之苦便知有涅槃之樂而不復留戀三界矣問頓悟漸除之義何如答如大海猛風頓息波浪漸停猶孩子諸根頓生力量漸備似曦光之頓出霜露漸消若印文之頓成讀有先後如華嚴云初發心時便成正覺三賢十聖次第修證若未悟而修非真修也良以非真流之行無以契真何有飾真之行不從真起經云若未聞此法多劫修六度萬行者竟不證真此皆頓悟漸除義也有云頓悟頓修者此說上上智根性樂欲俱勝一聞千悟得大總持一念不生前後際斷若欲斷障如斬一籰絲一斬一切斷若約修德如染一籰絲一染一切色又頓悟者不離此生即得解脫如師子兒初生之時是真師子即修之時即入佛位如春竹生筍不離於春即與母齊何以故心空故若除妄念永絕我人即與佛齊經云不壞世間而超世間不捨煩惱而入涅槃不修頓悟猶如野干隨逐師子經百千劫終不得成師子故知若不直了自心豈成頓悟隨從妄學終不成真故證道歌云是以禪門了却心頓入無生知見力故知直了真如即心成佛者是圓頓宗若不了此心妄有修證者是藏通教灰斷之果若依此心依行別修者是別教大乘與圓教即心便具者所有行位功程日劫相倍故曰即心是者疾發心行者遲也正宗分竟。",
        "from": "X14n0289_010:0445c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難若復有人徧滿十方所有虗空盈滿七寶持以奉上微塵諸佛承事供養心無虗度於意云何是人以此施佛因緣得福多不。",
        "from": "X14n0289_010:0446a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此流通分也先舉功令較言十方虗空處無盡也盈滿七寶財無盡也奉微塵佛田無盡也心無虗度念無盡也是人下令其校量得福多少也。",
        "from": "X14n0289_010:0446b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難答言虗空無盡珍寶無邊昔有眾生施佛七錢捨身猶獲轉輪王位況復現前虗空既窮佛土充徧皆施珍寶窮劫思議尚不能及是福云何更有邊際。",
        "from": "X14n0289_010:0446b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此較定無量也首二句單言財勝昔有下以劣顯勝以一錢施一佛財田俱劣而獲輪王勝報況現前徧空佛土即田勝也皆施珍寶即財勝也窮劫下決其獲福尚不思議況求邊際乎。",
        "from": "X14n0289_010:0446b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛告阿難諸佛如來語無虗妄若復有人身具四重十波羅夷瞬息即經此方他方阿鼻地獄乃至窮盡十方無間靡不經歷能以一念將此法門於末劫中開示未學是人罪障應念銷滅變其所受地獄苦因成安樂國得福超越前之施人百倍千倍千萬億倍如是乃至算數譬喻所不能及阿難若有眾生能誦此經能持此呪如我廣說窮劫不盡依我教言如教行道直成菩提無復魔業。",
        "from": "X14n0289_010:0446b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此以法施之勝較財施之劣也若復有人者設有一人也四重即殺盜婬妄十波羅夷即梵網所說十重罪是極惡因也十方阿鼻是極惡果也一念弘經者即指將墮地獄之人言一念者即暫爾發心非長久也此法門是確指大定圓通深入之一門也言末劫者聖遠魔強之日言末學者難進易退之人是人罪障即上四重十惡應念銷滅者即應弘經之一念皆得銷滅也變其下不但只消惡業復能轉苦處而為極樂國也夫一念微功便能脫極苦生極樂者由萬法唯心轉迷為悟故也得福下言不唯滅罪而且獲福超前以虗空剎寶供養微塵諸佛之人葢虗空盈滿七寶世間豈有是事以佛眼觀變大地為黃金亦尋常事耳況妙真如性是本來家寶而清淨本然周遍法界豈止徧滿虗空以一切珍施佛者尚獲無量功德況將此法施人使人盡得家珍運用無盡其福德豈可以心思較量哉故能超越前百千萬億倍乃至譬喻亦不能及也且極重罪人一念弘經尚能滅罪獲福如此何況輕罪無罪乃至有福多福之人弘經果報殊勝可知一念如此何況久弘乃至盡形者其果報益可知矣阿難下顯無罪之持經持呪功德無盡也良以誦經持呪方得聞慧其功德已至便說不盡呪復依教而行則直至如來大菩提果無復魔業為留難者其功德豈可量哉故法華經云若有聞法者無一不成佛昔泥蛤聽法而生天廐象聽經而悛惡比丘戲笑而獲果女人思惟而悟空況聞此大乘圓頓之教有不滅罪生福者乎。",
        "from": "X14n0289_010:0446b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛說此經已比丘比丘尼優婆塞優婆夷一切世間天人阿修羅及諸他方菩薩二乘聖仙童子并初發心大力鬼神皆大歡喜作禮而去。",
        "from": "X14n0289_010:0446c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此明法會欣慶也聖仙童子是居仙趣而修內教希獲童真妙果者也發心大力是具神通得無畏回心護教而住如來座下者也皆大歡喜者謂預聞大法得大饒益故慶快非常也。",
        "from": "X14n0289_010:0447a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經合轍卷第十(終)",
        "from": "X14n0289_010:0447a06_0",
        "context_with_next_sentence": false
    }
]