[
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經直解卷第六明古杭雲棲寺後學沙門　廣莫　直解繡水優婆塞　朱大猷　校爾時觀世音菩薩即從座起(至)從聞思修入三摩地。",
        "from": "X14n0298_006:0807b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前別敘初因之二十五方便也此六根中耳根也由選當機文義詳備故移置此菩薩名觀世音者從因以立名也名通二意一自行二化他按今經追敘初因約自行邊說自行既成復以自行之功加被群機下三十二應十四無畏等即其事也下文云由我觀聽圓明故觀音名遍十方界此約自行釋名也若約法華普門品意全在化他邊說彼經云若有無量百千萬億眾生聞是觀世音菩薩一心稱名觀世音者觀其音聲皆得解脫云云此約化他釋名也或謂觀乃眼家之用世通十界音是十界言說音須耳聞何故稱觀此約六根清淨邊說良由眾生六根分隔不相為用菩薩由返聞故內得圓通如前文云明不循根寄根明發則六根適以互用故稱觀世音也又前云不由前塵所起知見故稱入流今何故又稱觀世音不亦墮循聲流轉之咎乎此對未得圓通者說若得圓通何妨入廛垂手拔苦與樂循聲救苦塵塵無礙故又稱為觀自在也菩薩乘無緣慈被諸眾生說法如幻度生同空乃以無緣而應之如古德云無緣慈力赴群機明月影臨千澗水不忘眾生故名觀世音也然又從古觀世音如來受記得觀音名因果相符同得此名我昔下正明悟因聞思修者即是如幻聞熏聞修三昧聞屬耳根思即是熏熏是熏習謂從聞中熏習次第修成始入定故三摩地譯云正心行處又云正定。",
        "from": "X14n0298_006:0807b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初於聞中入流亡所(至)生滅既滅寂滅現前。",
        "from": "X14n0298_006:0807c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承上聞思修意正出觀體也初於下先示人空之行聞中是耳根初字應下漸增字意有三重以應前文三空義故入是返意流是聞性功能以流逸取聲塵故所字指上流字說動靜是所聞之塵良由眾生循聲流轉而其聞性向外流出菩薩不隨聲塵所起流返入內窮能流之根流根不可得則亡其所入所入的流性既寂則外之動靜二相了然不生此節聞思修已麤具矣流性既寂根塵乃解此是人空境界何以故葢由我相不空故有根塵有我我所今根塵既解正是我空我即人也如圓通章前總示解結次第中第一云此根初解先得人空可引證此這便是第一重意矣如是下謂從此漸入增進其功應上初字看上文根塵既解能所即空而盡性未亡故復牒而遣之云聞所聞盡盡聞之性亦不住也上聞字是能聞根下所聞是塵盡字謂此能聞所聞俱盡只此盡聞之覺亦不住著則覺所覺亦空上覺字是遣盡聞之覺下所覺是能所以盡聞之覺不住故則其能覺所覺皆空矣此是法空境界如前經第二重云空性圓明成法解脫解脫即是空之異名謂能所俱盡盡性亦空故名法空這便是第二重意矣空覺下二句空覺字即頂上句空字說謂盡覺及能所皆空則空覺極盡圓滿空所空滅矣上空字是法空下所空字是人空謂人空法空俱滅此是三空境界如前經第三重云解脫法已俱空不生俱空者即人法二空拂其迹故故云不生這便是第三重意矣生滅下二句結顯寂滅謂彼微細生滅滅盡從此證大寂滅寂滅即大涅槃義故云寂滅現前。",
        "from": "X14n0298_006:0807c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "忽然超越世出世間(至)與諸眾生同一悲仰。",
        "from": "X14n0298_006:0808a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承上寂滅現前以明獲二殊勝之功也忽然下二句謂菩薩得證大寂滅理而寂滅理體一法叵得湛然清淨烏有十界之殊哉故云忽然超越世出世間即此忽然二字細研有味意謂此理不勞久練工夫遷延委曲但於豁爾空圓直下一了百當放下便是如禪家所謂[囗@力]地一聲百雜碎剎那相應無復許多難事故云忽然忽然即倐忽間便能超越四聖六凡之境又此二句是承上起下之辭又是牒明耳根圓通功効之勝也十方下是所獲承上被下之功十方義准天台約十法界釋即頂上句世出世間說即十法界故由能超越十界故云圓明今菩薩稱理之智既圓既明故云殊勝言殊勝者謂勝中之最勝故加殊言此二勝者良由菩薩證得生佛同體本妙覺心是故上合諸佛下合眾生然此覺心本具同體慈悲故上合佛心則諸佛之慈即菩薩之慈慈能被下而與樂故故云同一慈力又菩薩之心下合眾生則眾生之悲仰即菩薩之悲仰眾生悲仰者由苦而生悲欽仰菩薩來㧞其苦仰字中含有感意菩薩俯仰應之故云同一悲仰。",
        "from": "X14n0298_006:0808a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世尊由我供養觀音如來(至)三十二應入諸國土。",
        "from": "X14n0298_006:0808b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前上合佛心同慈力故應身與樂而先標應數也由供觀音如來者以因承果也蒙授三昧者蒙果垂因也聞熏聞修三昧稱如幻者謂大寂滅第一義空一塵不立佛之一字如眼中屑豈容此三昧耶良由眾生背覺合塵處處躭染不能通達第一義空如來不獲已乃建百千三昧無量度門令諸眾生依而修之洗心離染證彼第一義空既登妙空則所修三昧不可得矣本無而有故稱如幻約喻說也聞熏聞修如前文解金剛是喻以譬觀智如金剛之堅利能破惑故與佛下謂由三昧功成承前上合佛慈起後諸應此總標應數下別釋所應上二句是承前下二句是起後入諸國土者按下三十二應圓收十界即十界之國土也。",
        "from": "X14n0298_006:0808b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世尊若諸菩薩入三摩地(至)而為說法令其解脫。",
        "from": "X14n0298_006:0808c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經菩薩妙應說法自三乘始也菩薩法身真體湛若虗空方圓隨器各見不同虗空云何為汝成同不同而應物現形則空隨運轉無不隨入菩薩無作妙應之身亦在此也應止三十二者以三十二數麤攝十界故若千百億微塵數以至無量無數不可思議數曷有限量哉又此三十二應是上合佛心同慈力故慈能與樂故文中令得解脫得成就皆與樂事也今初先明出世三乘文列四聖者以中乘開緣獨故三乘中又先明大乘三摩地譯語見前名通大小乘故無漏之語亦通大小大乘中言無漏者是菩薩出世上上無漏也勝解現圓句亦通大小雖同具此語而義有深淺故勝解現圓者謂能感之機有諸勝解智力現前圓具則菩薩順其所感而應之故下句說我於彼前云云也諸語通三乘者各隨乘深淺解之又若諸下次應中乘先獨次緣稱有學者學於獨學於緣也寂靜妙明者以其樂獨善寂喜趨靜故妙明即是靜中所得寂照之義勝解一句如大乘中說但以隨乘析義有差別故現獨覺說法者獨覺出無佛世因觀諸法生滅得悟無生無師自悟故稱獨覺今菩薩示同其行說獨覺法令其易悟得解脫故又若諸下次明緣覺緣覺者依世尊教觀十二緣覺悟無生故名緣覺十二緣者初無明乃至第十二老死是也詳如法界次第中說葢緣覺乘人觀此生起還滅覺悟無生既悟無生則斷諸緣生滅故云斷十二緣生滅緣斷無生性現即此無生名為勝性勝妙現圓者謂無生勝妙之性現得圓滿然由菩薩為現彼身而說彼法彼始成就得解脫故又次若諸下三應小乘有學者初果至三果皆名有學得四諦空者即苦集滅道四也四俱名諦者諦信也實也信為實苦實集等故空是所證真諦空也有學未滿空理云何稱得此以因中說果之謂也。",
        "from": "X14n0298_006:0808c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若諸眾生欲心明悟(至)而為說法令其成就。",
        "from": "X14n0298_006:0809a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應次列欲色二界天趣之求也初若諸下初應色天欲心下二句初欲心明悟一句葢語倒也應云明悟欲心欲是欲界之欲即五欲也以其明悟五欲是苦是麤是散動障禪定之法故厭之而欣上界淨妙離故云不犯欲塵以不犯故即於欲界之身便得清淨清淨即梵天生因是故菩薩現梵王身說離欲法令得解脫謂解脫欲境得生初禪以禪天稱梵者梵是西音具云梵摩譯云離欲或名淨行次若諸下次應欲天天主指忉利天主居須彌山頂山頂周八萬四千由旬四方各八天帝釋居中統之故稱三十三天之主以統此天故故云統領諸天也謂諸眾生有統天之志菩薩現帝釋身為說上品十善等法而成就之稱帝釋者梵語釋迦提婆因陀羅譯云能天帝今帝是華言釋是梵語略云帝釋因緣出雜阿含經玩今文意前現梵王說法則云解脫後現帝釋說法則云成就葢前稱解脫者令其解脫欲境與其清淨之樂禪天有三重樂故後稱成就者欲天全屬散善菩薩隨順而成就生天之樂故云成就下皆倣此三若諸下次應欲界頂天欲身的欲字是愛欲之欲與下文愛統之愛意同稱自在者別行疏云此天假他所化以成己樂故稱他化自在自在即樂義故遊行十方一句亦從自在邊說若不能遊行則非自在十方但指一世界說我於下如上文解以上二應但指欲天第二第六者以帝釋護法之心勝餘天故常近如來故他化乃欲界頂故舉上下二天意該其餘也四若諸下次應色界頂天欲身自在者言雖同前自在逈別以離下界苦麤障故極色邊際故故以大字簡之飛行虗空句亦勝前義此天乃大千界主自在超勝飛行於大千之空故稱大自在也我於下如前文說然今色頂何故不說解脫仍云成就耶良以慕飛行而求自在非解脫意約所慕邊云成就若彼天正欲解脫色籠存想空處自當說解脫矣大論云過淨居天有十住菩薩號大自在決非欲頂長水指為他他誤也今文初列梵王後陳色頂亦該其中但譯經者列名不次故見前後出沒參互必由譯時冗沓所致故爾大論又云大自在天現身八臂三目騎白牛執白拂者是也五若諸下次應天將愛統鬼神者按宣律師感通傳云天人費氏說四王天一王之下有八將四王總三十二將據彼所說今文天大將軍非一人也汎指三十二將說故各統所屬鬼神以救護國土必令雨暘時若年糓豐稔不使他諸鬼神擾害眾生也我於下如前文說六若諸下次應四王天統世界獲眾生者是帝釋外臣居須彌山半四埵引見第二解我於下如前文說七若諸下次應四王太子生天宮驅鬼師是四天太子所職事即那吒太子之類也天父正統太子亞之金光明經所出即其事也我於下如前文說以上但列欲色二界不及無色者有三意一以無色無身故二舉下義以該上故三總收入下文雜類中故如上七應先列正統後列臣輔文雖不次妙應之身平等寂然無剎不現也。",
        "from": "X14n0298_006:0809a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若諸眾生樂為人主(至)而為說法令其成就。",
        "from": "X14n0298_006:0809c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應人間貴姓名賢以示世諦所尚而順其求也初若諸下初應剎利人主即國王王統兆庶然有大小不同如四輪粟散中夏夷狄分疆列界各治其國名為人主菩薩隨順其求為現其身說綱常倫理修齊治平之法令成就故次若諸下次應長者愛主族姓者謂於本族中德高年邁五服推讓不唯本族所尚而人間世靡不景慕如黃叔度郭有道陳太丘荀朗陵輩方以命駕太史占奏以真人東行德星聚五百里賢人集如此適足以稱長者故云世間推讓論亦云長者具十德故我於下如前可知三若諸下次應居士愛談名言者名言即是綱常倫理孝悌忠信等語世間必以此為名言故居士者以清淨自居素守貧富貧而樂富而好禮如此足稱居士我於下如前可知四若諸下次應宰官愛治國者治國必自修齊始所謂忠臣出孝子之門以此治國國無不治治國乃宰相事也剖斷邦邑者剖是分剖斷是決斷藩鎮為邦縣治為邑上自台輔下及尹牧俱稱宰官菩薩現為說法必陳聽訟而必使之無訟尼聖即其人也五若諸下次應淨裔婆羅門譯云淨裔又云淨行數術者以卜易星命為數禁呪符籙為術二者能為攝生衛命之法術即法故我於下如前可知。",
        "from": "X14n0298_006:0809c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若有男子好學出家(至)而為說法令其成就。",
        "from": "X14n0298_006:0810a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應皈佛四眾順其求也初若有下初應比丘按竺乾九十五種外道俱有出家為沙門者則出家之輩信非一種今所列者乃出族姓家入如來種者是也持諸戒律者比丘具二百五十戒以此諸戒律其身故比丘譯義如前我於下可知次若有下次應比丘尼尼是天竺女聲即女比丘故禁戒者禁是制止之辭尼戒五百條詳見四分律藏戒相倍於男比丘故以上是出家二眾菩薩皆現其身說法成就故三若有下次應近事男五戒是在家皈佛者所持戒相雖淺乃為諸戒之基五戒不堅持則諸戒俱毀矣如架屋先實其基基不實則屋必傾矣優婆塞譯云近事男以親近事奉出家比丘為其師範故四若有下次應近事女五戒同上自居者謂以五戒持身自守堅貞故優婆夷譯云近事女我於下如前可知以上是在家歸佛二眾菩薩皆現其身說法成就故。",
        "from": "X14n0298_006:0810a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若有女人內政立身(至)而為說法令其成就。",
        "from": "X14n0298_006:0810b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應女德而順其求也初若有下初應內廷諸宮女德內政者掌王家宮壺后妃之教令名曰內政立身者謂正以持己然後正人之不正如此則身修而家齊國可治矣自內而達於外如詩所謂周南召南被文王后妃之化是也彼內廷諸女具此願樂而仰菩薩菩薩現女主身及國夫人等說法成就故女主即天子之后也國夫人即君夫人所謂邦君之妻是也命婦者謂妻因夫榮受天王之誥命故曰命婦大家者家訓曰姑女師也如後漢扶風曹世叔妻同郡班彪之女名昭字惠姬和帝數召入宮令皇后貴人師事焉者無可職稱權曰大家耳次若有下次應童男不壞男根者謂真元不喪欲惡不行故曰童真我於下如前可知三若有下次應處女女中有靜處堅貞不慕男子所侵暴其身者名曰處女處讀上聲亦以童真自處故侵暴二字見毛詩謂女不貞淑以行多露乃為他人之所侵暴我於下如前可知。",
        "from": "X14n0298_006:0810b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若有諸天樂出天倫(至)而為說法令其成就。",
        "from": "X14n0298_006:0810c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應八部及十二生類無剎不現而遂其求也天倫者總攝三界天類也脫倫者或求生正趣故或厭下苦麤欣上淨妙故八部及諸雜類皆以意會其求脫倫向往之願俱可解也菩薩皆能現身說法令成就故餘皆倣此藥叉譯云輕犍乾闥婆譯云尋香天帝之歌神也天帝欲其歌然香召之彼聞香即至故云尋香阿修羅譯云無端正男醜女妍故又云非天似天非天故緊那羅譯云疑人似人而頭有角天帝之絲竹樂神也摩呼羅伽譯云大蟒非人者即諸鬼神是也有形無形下四類按第七經末形作色色即形故彼云有色是休咎精明等無色是空散消沉等有想是神鬼精靈等無想是精神化為土木金石等今文從略併成一應言之然於八部又闕迦樓羅譯云金翅鳥十二類中又闕若非有形若非無形若非有想若非無想等以略影廣也然知菩薩於空散消沉尚現同事說法成就豈形想之類獨不徧耶葢略耳又從前通稱三十二應世出世一切聖凡生類無不攝盡所謂無剎不現身也。",
        "from": "X14n0298_006:0810c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "是名妙淨三十二應(至)無作妙力自在成就。",
        "from": "X14n0298_006:0810c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經總結前文三十二應皆歸功於聞熏三昧自在之力也妙淨者謂不動本質遍示生故如一月在天千江現影月不來影不往眾生法爾得蒙慈力以成其功所謂隨緣赴感靡不周而恒處此菩提座即此義也應應妙淨事事無礙不可思議故稱妙淨或問月沉萬水不易本形非有隨緣現相之能豈無法喻不齊之過耶答曰前不云乎虗空不動逐器方圓器器見空隨形轉變月之與空當合看始得月以明心空以示相俱不失旨請靜思之皆以下全功結歸聞熏三昧之力稱無作者謂此妙應本乎無作無作而作作而無作是三昧不動而動之妙用神通無滯無壅故稱自在。",
        "from": "X14n0298_006:0811a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世尊我復以此聞熏聞修(至)獲十四種無畏功德。",
        "from": "X14n0298_006:0811a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前下合眾生同悲仰故應身拔苦而先標應數也我復的復字承前與樂意說故稱曰復以此三昧者功歸所自也與諸下牒前下合悲仰起後十四無畏㧞彼諸苦令無所畏故云無畏功德於我身心者我是菩薩自稱謂此㧞苦功德總在菩薩身心上得或觀相好而生善故或隨所應身中得無畏故或觀道力而治惡故或於三昧而修成故四悉巧被眾惡自消故云於身心得也又細玩下十四段中前云知見觀聽等屬身斷滅妄想等屬心細尋可見。",
        "from": "X14n0298_006:0811a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一者由我不自觀音(至)觀其音聲即得解脫。",
        "from": "X14n0298_006:0811a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前下合悲仰而㧞苦故此總陳觀體令彼稱名脫諸苦也此文十四段今初是總下十三是別初明返聞自性是觀之體餘是功能故不自觀音以觀觀者二句明觀體也三觀字諸方解者或有以下者為去聲或有以上者為去聲總不得經意何者此是返聞自性之義耳且將三觀字訓作聞字義便明白如云由我不自聞聲以聞聞者聞者即是聞的自性明白切當更無所疑然今三觀字皆訓平聲讀之觀即聞故令彼下是加被利他的功能謂即以上返聞之功加被眾生而諸眾生能觀菩薩的音聲音聲即名號也能稱名號則一切苦惱皆得解脫良以名號即稱實性名即實故實性雖寂感無不通如眾生有苦而呼天天必佑也文中苦惱亦是總舉下十三節別示諸苦相也又取名意可合併者併之以故文為六截。",
        "from": "X14n0298_006:0811b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二者知見旋復令諸眾生(至)大水所漂水不能溺。",
        "from": "X14n0298_006:0811b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應而下同悲仰此二明水火不能燒溺也知見旋復者由返聞故餘根皆復此明見復也雖兼知說意且在見指眼根說故旋復者旋是返義復是復於元覺也謂眼根返入復歸元覺眼性屬火今既旋復眼火則息以內外火性同本生故內既息外亦亡也以此功德加被眾生是故入火不燒也觀聽旋復者雖兼觀說意自屬聽旋復如上說上兼知次兼觀者意明一返元六解脫故耳性屬水今既旋元聞水自息亦由內外同體內既息外亦亡也以此功德加被眾生是故入水不溺也故問耳目屬水火意出自何經答世醫難經說故良由五臟按五行眼通心火耳通腎水故詳見彼書可撿。",
        "from": "X14n0298_006:0811b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四者斷滅妄想心無殺害(至)亦如吹光性無搖動。",
        "from": "X14n0298_006:0811c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應而同悲仰此三明鬼難刀兵不能害也斷滅下二句良由六根旋復六識併銷妄想指六識說想心取物三毒流行偏多殺害今既併銷即亡殺害以此功德加被眾生設入鬼國鬼不能害鬼是不覺義妄想是鬼義故斷妄想鬼不能害也熏聞成聞者上聞是妄故熏修其妄使其忘緣自歸以成真聞一聞既返六妄知根亦銷亦復同於忘聲真聽以銷復故境不礙心內根既亡外境何有以此功德加被眾生物自當壞何能害己臨當下二句約事明不能害己物自壞也使其下約理明真性不動幻物何害上約事可解下約理中又引喻明水與光喻真性如水性無我割則隨割於水何傷又如日月之光搏撮弗得飃皷弗動淮南子曰光可見而不可握水可循而不可壞意可類此真性亦然夫惟真性寂然無朕安能割之使傷吹之使動耶今文惟字即指水與光性說水光之性即妙真如性故。",
        "from": "X14n0298_006:0811c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六者聞熏精明明遍法界(至)經過險路賊不能劫。",
        "from": "X14n0298_006:0811c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應而下同悲仰此四示明純暗謝根斷塵離賊所不劫鬼禁俱平也聞熏下二句由觀體純一明徹於外故云明徧法界明能破暗故云暗性不全以此功德加被眾生諸惡鬼等雖近其傍菩薩三昧精明閃爍如日而諸鬼目不敢正視藥叉譯見前羅剎譯云可畏鳩槃茶譯云魘昧鬼毗舍闍譯云噉精氣富單那譯云熱病鬼音性下二句謂外之音性遍銷內之觀聽返入以此功德加被眾生能令眾生枷鎖不著離塵功茂枷鎻禁繫亦屬外塵故不著也滅音下二句謂音塵既滅真聞圓滿然由真聞本具之慈無處不生力能拔苦與樂令諸求者雖經險路賊不能劫正明慈善根力遍生之意冥被賊心使其劫殺之念不起縱欲劫之或刀刃鎗矟悉段段壞矣。",
        "from": "X14n0298_006:0812a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "九者熏聞離塵色所不劫(至)諸阿顛迦永離癡暗。",
        "from": "X14n0298_006:0812a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應而下同悲仰此五明貪嗔癡三毒悉遠離也熏聞離塵之義前文已明今何重出良以熏聞一行具無量德今舉十四事乃無量中少分耳若明其極非言可盡何復云重色不劫者色是色慾由六湛圓明六塵虗妄妄不能劫真故云色不劫也以色不劫故多婬眾生仰之而神功必被其益也故云遠離貪欲純音無塵者前文但說熏聞而聞性純今兼所聞之音亦純者良由心外無法音塵亦稱性故故云純音音稱性故無塵可得根也境也俱化為一真心矣故無能對所對以此功德加被忿根眾生則諸嗔恚轉為慈矣故云遠離嗔恚銷塵下四句謂銷外妄塵旋內真明法界是依身心是正依正兩融朗徹無礙故如瑠璃內外通淨也以此身土兩融之功加被癡暗眾生能令昏鈍闡提轉昏為明故云遠離癡暗昏鈍性障者謂闡提眾生昏鈍為性全無正智是故撥無因果執著豁達空見障真般若根於性故故云性障阿顛迦譯云無欲不樂欲涅槃故即是一闡提之異名耳。",
        "from": "X14n0298_006:0812a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十二者融形復聞不動道場(至)眾人愛敬有相之女。",
        "from": "X14n0298_006:0812b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應而下同悲仰此六明資生克紹之義能令獲二求也融形復聞者按當文意形約依正說謂融通依正之形故云不動而能涉也復聞指真聞說意帶妄聞謂返妄聞而復真聞也不動下二句道場是修道之場如華嚴說不動菩提場而升而說謂不離當處而徧遊華藏也不壞世界者謂不壞去來彼此近遠相故能遍下四句明供養之廣及克紹為子之義然上融形復聞一句屬理不動下二句謂不動理而涉事世間屬事故以理從事故云不壞世界能遍等者正明理事互融本具權實二義故有法王子之稱以此功德加被無子眾生求男得男也六根下謂六根既復圓通用無優劣見聞覺知皆為明照平等互融故云無二稱性周遍故云含十方界大圓鏡是智空如來藏是理謂依十法界建立此智此理而此智此理皆由六根圓照之所建立故能承順十方微塵如來秘密法門不唯承順而已猶能受領無失即此承順受領之義能令無子眾生求女得女也檇李敏師解曰前不動而涉者即方便智方便屬權權能幹事故應屬男立大圓鏡空如來藏屬實智實智詣理理能含育故應屬女如淨名說智度菩薩母方便以為父即斯義歟。",
        "from": "X14n0298_006:0812b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十四者此三千大千世界(至)施無畏力福備眾生。",
        "from": "X14n0298_006:0812c10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前被機拔苦之功結歸聞性總顯一名勝等多號也夫此聞熏三昧之功利他無盡良以所拔之苦有盡機應相對故於無盡中發宣盡相今第十四中總顯一名等彼多號功德無二何以故謂此娑婆一界中眾生耳根利故正與菩薩所修圓通相契藥病相投由是一能勝多也然約逗機邊顯勝實非恒沙菩薩所證之道為劣彼此所證則同而所被稍異耳此三下此字指娑婆說世界總有三千大千俱名娑婆是釋迦牟尼一佛所化之境有小千中千大千具三種千故俱舍論云四大洲日月須彌盧欲天梵世各一千此名小千界此小千千倍說名一中千此千倍大千皆同一成壞故云三千大千也昔宣律師問韋天曰余聞一佛化境三千國土日月歲數或言百億或言千百億廣略不同者何耶答曰如師問百億千百億者經文分明千百億化身一佛化一日月則成千百億日月總要言之萬億日月為一大千良由天竺億數有大小應以一百小億為一大億乃成百大億日月故云百億現住下明此界中現住世間的菩薩有如是之多種種現形凡情莫格如此方三教中歷古聖賢間出皆是此數種種修法垂範以諸方便漸次引歸寶所人莫之識也隨順眾生若干種心以無量法門而教化之由我下菩薩以前功德結歸本根謂由我得圓通本根開發微妙耳門故能身心微妙含容周遍法界身心遍界者如下文云現一一形以一至無量首眼多身即一身此為身之含容也又云誦一一呪以一至無量言音能以無畏施諸眾生以無畏為施者如前所說火不能燒水不能溺等令他無所異故此為心之含容也其身其心無大不容無小不入故云含容周遍也此法界者約十法界說能令下校一多平等謂令法界眾生持觀音一名與彼共持多菩薩名彼此持名之二人所感福德正等無異世尊下明一多平等的所以無異即平等故良由菩薩發妙耳門真實圓通故能一多平等是名下總結十四無畏也力者即指圓通無作妙力說福備者謂令不畏水火等難即是福故無苦不㧞故稱為備又福即是樂既拔苦已則易苦為樂故云福備眾生坊本六十二下有億字今准南藏無億字。",
        "from": "X14n0298_006:0812c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世尊我又獲是圓通修證(至)救獲眾生得大自在。",
        "from": "X14n0298_006:0813b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應重顯圓通性分具有四種不思議德以應眾生也前云力今云德者力是力用約外應說德是性德約內具說謂性分之所固有故謂之德又德者得也得之於心應之於境故長水疏云內德不充外用不起此之謂也世尊下總標性具四德謂由圓通而修證故所證得者是無上道也故字牒由圓通生起四德之境四種皆稱不思議者不思議是妙之總稱初一多無礙故次顯密無畏故三陰信冥通故四悲敬田滿故良由德備於內應徧於外無作而作作而無作言莫能議心莫能思故稱不可思議之妙德也一者下別釋德相妙妙聞心者菩薩自讚聞思修三慧也聞是耳根心字義屬思修即是聞熏聞修的意思巧變文法故爾又思修義屬第六識心故稱為心然依聞而思而修故稱聞心言妙妙者正是讚辭謂妙聞妙思妙修指初觀體而言故云初獲三慧俱妙潤文巧致故併言妙妙心精遺聞的心字即頂上心字說謂思修之心既精遺其妄聞是故見聞覺知等六根不能分隔融為一真心矣故云成一圓融清淨寶覺也諸家解妙妙聞心等語辭致可觀義理不徹不能指出實境從勞粉飾也故能下正明德相現眾多妙容者約全體說非止首臂目而已無邊密呪者如不空罥索經面然燄口等呪皆是此菩薩所說秘密神呪然且來此震旦千萬中一二耳以多故云無邊也其中下示相一首是本乃至八萬四千是不思議變也對治眾生八萬四千煩惱故菩薩妙能通身遍身盡大地是菩薩手眼奚止八萬四千哉對治之說良有以也爍迦羅譯云堅固二臂是本乃至八萬四千是不思議變也母陀羅譯義如第二解說二目是本乃至八萬四千是不思議變以無染曰清淨希有不思議故可尊可重故稱為寶慈威定慧者總指首臂目及全體所示之相以此四意或折或攝皆名救護眾生慈曰攝受威曰折伏定則制狂慧則轉癡一切眾生根性不齊大約無出此四也外應圓彰內德不疵如鏡臨照妍媸不爭順緣而成就故故云得大自在。",
        "from": "X14n0298_006:0813b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二者由我聞思脫出六塵(至)皆名我為施無畏者。",
        "from": "X14n0298_006:0813c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應重顯四德此以顯密形聲施令無畏也聞思脫出六塵者聞思指三慧說略一修字一根既返六處皆脫故指六塵說脫也如聲度垣者即以聲為喻聲則垣墻不能障隔以譬見聞覺知不為六塵所礙正明圓通之意則能互用矣妙能者能約用說以現形誦呪皆是用故一一形一一呪者一一即種種指一多之形無邊之呪說也此形此呪順緣拔苦總以無畏施眾生故是故十方塵界眾生皆稱菩薩為施無畏者此以無差別之差別以明不思議之妙德益眾生故。",
        "from": "X14n0298_006:0813c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三者由我修習本妙圓通(至)捨身珍寶求我哀愍。",
        "from": "X14n0298_006:0814a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應重顯四德茲以神功陰速眾生見者自然發施心而生悲仰也謂菩薩乘圓通妙門遊歷十方由三昧力故眾生見者聞者咸生敬慕施心冥發捨身是內施珍寶是外施然世所愛者身命身命能捨況外物乎以內外施者求哀愍故希與㧞故此皆菩薩不思議德之所感也。",
        "from": "X14n0298_006:0814a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四者我得佛心證於究竟(至)求大涅槃得大涅槃。",
        "from": "X14n0298_006:0814a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前妙應重顯四德茲以悲敬二田上供下益俱圓備也得佛心者因心契果我心即佛心故得即證義又得字應下句證字得與證分句說故證究竟者證究竟覺故能以下菩薩以等心之施上供於佛下益於生生佛平等故傍及下正明下益各遂其求故六道眾生者地獄眾生阿所求耶求銼燒舂磨得暫息故餓鬼求免饑虗故畜生求免刀碪故餘可知矣妻子壽是世間法三昧涅槃是出世法壽句應連妻子今插三昧之下則漏無漏混亂是譯場忽略也下益中不及珍寶者文略耳理應有故又世出世法不能盡述故稱乃至以上備明耳根圓通功化已竟。",
        "from": "X14n0298_006:0814a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛問圓通我從耳門(至)故觀音名遍十方界。",
        "from": "X14n0298_006:0814a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經結今佛問最初入道圓通方便本從耳門入也初句是牒佛問語我從下菩薩自陳從耳門入也三昧稱圓照者三昧即聞熏聞修今不說熏修而言圓照者圓照即三慧故照即慧故三疊俱空故稱圓照緣心自在者緣是無緣之緣初則不隨前塵返流全一既得全一即稱圓通乘無緣慈循聲救苦無心而應應即不應無別留滯故稱自在因入下指入流本因證得菩提是果即以耳根為最初方便也以上二十五聖各據自所證入為第一者以歸元無二故是故門門稱為第一世尊下結明遠本示不忘意也又顯己者有所自來彼佛指古觀音如來說彼佛讚歎菩薩善得圓通最初法門乃於大眾中授記觀世音號以表因果符契也十方字約橫竪義說竪指十方界橫指十方空以十法界各遍十方故從前詳明二十五聖圓通遙應十八界及七大意故下文世尊及十方佛同時全體放光意表十八界法法全彰同歸覺頂為究竟實際下自詳解今略指文源起伏耳。",
        "from": "X14n0298_006:0814a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時世尊於師子座(至)交光相羅如寶絲網。",
        "from": "X14n0298_006:0814b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經佛因各顯圓通已竟交光互灌以表異入而同歸也五體者首及四支指全體說也五體放光以表圓通無處不彰故初釋尊光灌彼塵佛及諸會眾文中但云菩薩不及二乘若按下文塵佛光來灌佛及菩薩羅漢則釋尊光去亦應三乘皆灌理應有之但經家敘述不全或譯場忽耳此以象表意也交光互灌佛及三乘者以表前諸圓通自他不隔因果同歸也前二十五聖大小相參今流光灌頂亦應三乘同及以表圓通心法處處可入人人可證也皆灌頂者頂是究竟圓極的所在以表心法究竟覺際人所固有但得圓通則何人不究竟此大佛頂耶林木池沼是無情物能演法音者以表圓通現前則一切色是物色一切聲是佛聲既稱圓通則於依正色心物我自他無適而非圓通方稱圓通實際所以前文諸聖皆云無礙流通細玩可得也末二句可解。",
        "from": "X14n0298_006:0814b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "是諸大眾得未曾有(至)梵唄詠歌自然敷奏。",
        "from": "X14n0298_006:0814c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經釋尊會眾覩光獲證天喜雨華塵界不隔情無情等皆慶讚也此諸眾者集家指本師會眾說也得未曾有者覩上交光互灌之象曾未之見故合眾獲金剛三昧者前諸聖者各證圓通皆稱金剛三昧指金剛喻定說也長水疏獨指耳聞圓觀者誤矣良以佛光互灌是通印諸聖何嘗獨顯耳聞下文令選當機方稱耳根為對機之法今但通象非局意也即時下明諸天聞法覩光生法喜故雨眾蓮華華具百寶色色雖百寶不出五顯色青黃赤白等是顯色故空成七寶色者上百寶色以明華之功製百種多奇故今云七寶色映於空者以明寶之實質不出金銀珠玉硨磲瑪瑙等故此娑婆下明合界之象用顯圓通之本意也迷時無隔而自隔悟後則萬礙俱通六根無壅是故塵界合而為一也梵唄下明慶讚意梵唄是諸天音樂也詠歌是天人讚詠也謂眾樂不鼓而自鳴天人不教而自成歌情與無情由圓通法門玄象所感自然敷奏其音也。",
        "from": "X14n0298_006:0814c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於是如來告文殊師利(至)何方便門得易成就。",
        "from": "X14n0298_006:0815a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經世尊令選諸聖圓通誰當此界之機也選圓通而告文殊者文殊實智第一對機擇法非智不能故有是命也於是下世尊欲明其局先示其通在諸聖邊說實無優劣前後差別對眾生論法當適機故告文殊令其擇之汝觀下可解各說最初成道方便者道即十方諸佛所得菩提之道方便是入道的法則皆言修習真實圓通者謂前諸聖各從門入皆成道故即以自所證得為真實故門雖不同所證一也彼等指二十五聖說我今下對此方機則屈通為局佛問文殊諸聖圓通誰當其根可令阿難開悟耶兼我下佛謂不唯利益當時亦乃兼通末世令彼入道從何方便得易成就。",
        "from": "X14n0298_006:0815a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊師利法王子奉佛慈旨(至)承佛威神說偈對佛。",
        "from": "X14n0298_006:0815a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊奉旨選法集成伽陀而答之也文可解對即答義以下答上曰對如儒書中凡臣答其君多稱對曰。",
        "from": "X14n0298_006:0815a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "覺海性澄圓(至)初心入三昧遲速不同倫。",
        "from": "X14n0298_006:0815a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊將選圓通先標其本兼顯空界緣生悟迷遲速等意然後去取之也覺海下二句先明圓通真本辭止二句囊括多義上句是依體起用下句是攝用歸體上句覺是體澄圓是用又覺是法海是喻性字通乎法喻澄圓之用亦通法喻法中澄是寂義圓是照義寂照二義依性覺起故海之性亦具澄圓之用如海色湛然故說澄森羅並現故說圓海與性覺法喻頗齊故取譬也下句圓澄是用覺是體有攝用歸體之義上句說澄圓者意明寂而常照故下句說圓澄者意明照而常寂故寂而照照而寂同出而異名二俱元妙也元明下六句顯生妄之始初句元明照性即是本覺智體元明即是本明照是明上發的照用雖萬有俱在照中本無知而知無照而照若生一念能照所照則真轉成妄所照既立則真照之性亡矣迷於能所之妄則性覺真空變為頑虗故云迷妄有虗空也依空而生堅執之性是世界之因故云依空立世界也想澄一句明世界初成之相想澄之澄與上澄圓之澄不同此想澄之澄是妄想凝結之意謂妄想凝結昏鈍既極則有情化成無情故云想澄成國土也知覺一句明眾生陰身初起之相謂眾生陰身是地水火風所成地等本是無情之物由六根旋令覺知而六根初本一性圓明為地等壅令留凝是故聽不出聲見不超色便成眾生五陰之身故云知覺乃眾生也空生下六句明空界眾生微眇之甚反顯大覺之大故云空生大覺中如海一漚發也海喻大覺漚喻虗空虗空尚小何況有漏塵國及諸眾生依空而有者小之更小葢可知矣漚乃起滅不常以明空因迷有悟本無空漚滅則空無矣此句法喻雙顯謂虗空尚無何有世界眾生以所遣能故云況復諸三有也三有約依正說故如諸字歸元下六句正明簡選圓通之意謂前諸聖同歸覺元之性本無二致而其方便能入則有多門言其能入之方便不同也聖性一句謂諸聖所證之性無不通達是真實故順者逆者皆方便故順者順此方之機耳根是也逆者餘聖所說以不適機故名逆也末二句結前標本起後正簡然茲聖性觸處貫通初心欲入必藉圓根則速證元覺若誤依不圓根卒難究竟故當簡選如前經所謂日劫相倍以是簡選令可入者入之不同倫者謂遲速不可同其匹也下偈正簡自六塵始。",
        "from": "X14n0298_006:0815b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色想結成塵(至)能所非徧涉云何獲圓通。",
        "from": "X14n0298_006:0815c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊奉旨正選諸聖圓通必以逗機為順先於六塵也初一偈簡色塵也想是觀想由觀不淨白骨歸於微塵微塵歸空然則色由妄想結成是障礙麤質使精了之性不復明徹安得圓通次一偈簡聲塵也謂聲性從雜亂語言上發語言不出名句文三聲為實體名句文是聲上假相葢以直聲為聲聲中清濁高下聯布屈曲為音音有宮商角徵羽五種不同故云雜也伊即彼也名句味者唯識論云名詮自性句詮差別自性指萬物自體性說如云山山雲物等此即為名故云名詮自性但未知何山何水必要差別義顯方稱為句如云山是須彌山是雪山香山等水是江水海水等以差別義顯故稱為句文者文秪是字為名句所依故稱為文味是義味然而語言文字有盡義理無窮一句不能含攝一切義味不圓可知故被簡也三一偈簡香塵也香是合中知離則何有不恒即是生滅圓覺不成四一偈簡味塵也味是舌味味性或有或無非本然常住之味云何依此雜變覺觀而得圓通五一偈簡觸塵也觸是觸發能所相待合離非定云何為圓通哉六一偈簡法塵也法是意內所緣憑外塵有非徧可知不圓信矣以上六塵被簡矣下簡六根。",
        "from": "X14n0298_006:0815c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "見性雖洞然(至)想念不可脫云何獲圓通。",
        "from": "X14n0298_006:0816a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前簡選圓通必以逗機為順次於六根也初一偈簡眼根也謂見性雖稱洞然前後不相到亦非圓通矣四維下二句前經但約前後左右說今偈文引四維說者通前互顯也四維即四角虧一半者後方二角不能見故但見前方二角故云虧半虧是不及見意以不遍故不得為圓通也次一偈簡鼻根也次應耳根遷逗機故輟在後文謂鼻息但通出入而闕中交故云現前無交氣也氣是息有出入無中交故云支離闕故非圓故云匪涉入則非圓通矣三一偈簡舌根也初句非字倒置應云舌入非無端則易明也無端者謂舌根所入非無端由必因味塵乃生覺了味若亡則覺了元無云何獲圓通哉亡字讀應作無四一偈簡身根也初句身為能觸物為所觸然亦能所非定前經云能為在手為復在頭在能非所在所非能能所無位觸無實矣能所互闕故非圓覺觀也涯量者涯是涯畔量是限量指能所涯量不[淴-心+口]合故冥會即[淴-心+口]合義五一偈簡意根也知根即意知根意根無體由雜亂思量顯故如前經云必有所思發明汝意若無前法意無所生故云知根雜亂思也次句湛是澄湛了是了畢謂意中湛了無所思量則意根終無見矣若想念不脫圓通不可得也以上五根被簡矣下簡六識。",
        "from": "X14n0298_006:0816a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "識見雜三和(至)念緣非離物云何獲圓通。",
        "from": "X14n0298_006:0816b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前簡選圓通必以逗機為順又次於六識也初一偈簡眼識也識見雜三和者識是所生見與塵為能生根塵識三和合而顯物體雜亂故稱雜三和也前經云眼色為緣生眼識故若詰其本則三皆無相無實體故自體指眼識說依眼識而入圓通今眼識自體先已無定云何依此能得圓通次一偈簡耳識也心聞洞十方義如前普賢章說此是後身菩薩大因之力所成初心不能入也所依之行既高能依之機不及機教不合亦從簡例三一偈簡鼻識也鼻想者觀鼻端白光本是權順機宜而設駐彼散心依白而住暫用之法非長修之事若住此不休則成心有住圓通何可得哉四一偈簡舌識也舌以說法為優亦是拈弄音文而已只可開悟先成道者末世將來不能逗矣且名言句義非無漏法不可依此得圓通也五一偈簡身識也持犯指戒說持之與犯但束身而已若法身非身則無所束即此持犯威儀元非遍故云何令得圓通六一偈簡意識也葢二乘人由作意得神通故約意識顯神通也然彼神通本以宿因成就何關作意且作意未離物圓通何可得哉以上六識被簡矣下簡七大。",
        "from": "X14n0298_006:0816b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若以地性觀(至)因果今殊感云何獲圓通。",
        "from": "X14n0298_006:0816c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前簡選圓通必以逗機為順又次於七大也初一偈簡地大也文可解次一偈簡水大也想念非真者指月光水觀說水觀如幻故非真實如如之理元非覺觀以二如字並稱者古來講謂上如是智下如是理以如如智契如如理則成四如矣愚謂同一如字何分理智若據實論之良以不異名如是不動意然又非如虗空凝然不動之謂即於諸法繁興說不動耳以法法各住本位即名為如般若云如如不動法華云是法住法位世間相常住法是世間相世相即常住故常住即不動義此約十法界說為如如今且據人世論如且云依也如正也如天也如地也如日月山川也如草木昆蟲也如佛也如魔也如無法而非如一如不能盡其義故重加一如意明法法皆如故稱如如如如之理不遷不易何有捨此取彼故非覺觀之謂非圓通之行矣三一偈簡火大也火頭金剛初厭欲有因修火光定以火定却欲則厭有之心不忘非真理也是大乘器具非初心方便以初心難入亦從簡例四一偈簡風大也風性無恒動與寂是對待法有對則非真覺云何以是得圓通耶五一偈簡空大也頑虗無覺是昏鈍法無覺異乎菩提安得為圓通哉六一偈簡識大也識以了別為義了別則屬生滅非常住之道依識而求存心先妄圓通非可得也七一偈簡見大也前經見大中都攝六根以一見大攝餘根也諸行指念佛說念屬行故以念念遷流即為行也既有遷流是無常性故云元生滅也因指念佛果指圓通念因生滅覺果無生感應既殊圓通安可得哉以上七大被簡矣下文特選耳根為逗機之順道也。",
        "from": "X14n0298_006:0816c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "我今白世尊(至)救世悉安寧出世獲常住。",
        "from": "X14n0298_006:0817a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前所簡別選耳根實逗此方之機則觀音為最也我今下二句可知此方下二句正指娑婆眾生耳根利故教體是聲名句文依此得返觀聞性不為聲塵所轉即得清淨故次云欲取三摩提實以聞中入也離苦者指前十四無畏說得解脫者指三十二應說謂此㧞苦與樂之功乃善述其名曰良哉觀世音是已良者善也美也取盡善盡美之意又次云此菩薩從恒沙劫來遍入塵剎以無緣之慈妙應一切心得自在以自在無畏施諸眾生也妙音下歎其名之妙也名下得其實故謂觀音之名是名微妙何以故一稱其名即得解脫一切苦難得非妙乎又其名也是名清淨梵即淨義良由等觀一切如一子想而無冤憎彼我之迹故觀音之名是梵音也又其名也如海潮之音循聲救苦不失其時應念即至如潮汛起伏不失時故救世下二句顯其實德世指六凡說令離諸苦悉安寧故出世指四聖說令三乘人俱獲常住常住即佛界也此二句義通收前經二種殊勝妙力也此偈總十六句分為二偈初一偈以良哉觀世音為結句總歎逗機適化以聞根為順末乃結稱嘉號次一偈承上以明菩薩功深力大歷歎名實為十界之益友也長水疏截偈不審前後斷落使義脉壅滯非善法也。",
        "from": "X14n0298_006:0817a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "我今啟如來(至)覺觀出思惟身心不能及。",
        "from": "X14n0298_006:0817b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊歷歎耳根圓通妙具三種真實也初二句總據前經如觀音所說譬如下初偈一章四句先歎圓實也以十方同時聞故說名圓真實也聞非虗妄故稱真實以真實故能徧圓也然細玩之擊皷不是喻約現前事驗聞圓實故次偈一章八句歎通實也初引餘根校耳顯彼不齊之劣次隔垣下明耳之勝謂此聞性隔垣能聽遠近可聞得非通乎實故能通故云通真實也亦以五根不與聞齊勝劣可見矣後偈一章十二句歎常實也初四句明聲有動靜聞無起滅次四句明聲自生滅聞元常住生滅圓離得非常乎實故能常故云常真實也末四句是常實餘意謂此聞性縱在夢中雖無所思聞性不無如前經云夢聽舂[打-丁+鳥]聞性存焉後二句明聞根覺觀出於思惟之表身心所不能及也。",
        "from": "X14n0298_006:0817b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今此娑婆國(至)豈非隨所淪旋流獲無妄。",
        "from": "X14n0298_006:0817c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊指此耳根利故翻顯循聲返本之利害俱屬於聞也今偈十一句總屬一章初明娑婆世界以聲論宣明若迷本聞循聲汩妄害莫大焉後乃確指阿難以驗循聲之誤其害可見矣謂彼強記多聞總歸有漏不免落於登伽邪思幻術然此豈非循聲之所淪溺哉果能旋轉欲流內窮聞性獲於無妄之真聞不亦利乎夫斯利也利莫大焉。",
        "from": "X14n0298_006:0817c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難汝諦聽(至)將聞持佛佛何不自聞聞。",
        "from": "X14n0298_006:0817c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊以聞熏三昧誡勉阿難除強記而返真聞也此偈十一句總為一偈以義盡為一偈故初五句文殊叔承佛威而選聞熏宣說斯義堪教阿難令諦聽也聞熏名金剛王者金剛是喻譬觀智如金剛之堅利能斷惑故又以金剛是寶中至寶故稱為王聞熏之智五根所不齊故以王擬之幻如前說不思議言其妙也以此三昧能出生諸佛故稱佛母具三寶故乃名為真又金剛下三句句雖分三總一義耳後六句正明誡勉汝指阿難說謂汝聞他塵佛法門要當先除欲漏若欲漏不除畜聞成過則誤汝真修將聞受持佛所說佛何不自聞返己之真聞耶然阿難持佛所說法法即佛故故云持佛佛。",
        "from": "X14n0298_006:0817c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "聞非自然生(至)摩登伽在夢誰能留汝形。",
        "from": "X14n0298_006:0818a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊釋聞之名詳示還源得體之功警其初誤也初六句為一偈正顯釋名返源次見聞下六句為一偈正明得寂照之體末四句為一偈正警初誤覺後觀之猶如夢故初偈中謂聞非自有因聲立名曰聞若旋轉聞機則與聲脫能脫之聞更欲誰名謂聞之名亦無矣一根下二句示返源之義一返六脫者外用雖隔內性本融故一根返歸真源則外隔俱脫而內融矣次偈中謂見聞等六根如幻翳相似言其非實也六根約正說三界約依說依指六塵也謂六塵亦如空華六塵徧三界故指三界說也次二句明根塵銷除真覺圓淨真覺既圓淨之極則本有光明通達光即寂照寂照之體大而無外故含虗空也末偈中謂迷時為登伽所留今覺後却來觀乎世間舉世皆夢汝在大覺中登伽在夢安能留汝形哉信乎迷悟之利害若此。",
        "from": "X14n0298_006:0818a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如世巧幻師(至)一處成休復六用皆不成。",
        "from": "X14n0298_006:0818b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前六根設譬以明一休復而六無性也此分二偈初偈一章六句舉喻以明六根幻成要以一機抽拽若使內機歇息歸於寂然外諸所動皆無性矣後偈一章五句法合上喻初句祇是例辭後四句正屬合偈六根合諸男女一精明合一機幻師法義不合大約妄心合幻師故云幻師幻作等也法中一精明者指第八識的見分說見分本湛故云一精明由外境所擊分而為六根塵識三和合而成故云六和合也六由一成故云元依一處休復合上機息歸寂休即息機復即歸寂六用不成合上諸幻無性以上法喻了然明白吳興解以真如合幻師者誤矣既云真如不應稱幻師。",
        "from": "X14n0298_006:0818b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "塵垢應念銷(至)性成無上道圓通實如是。",
        "from": "X14n0298_006:0818b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊結歸前義極乎圓淨勉眾當依是而修也此節義分二偈前四句為一偈結前六根休復乃成圓明淨妙之體謂餘塵未盡尚在學地學地通三乘說故加諸字若明淨極矣即是如來究竟地也後大眾下五句為一偈正是勉眾當依反聞而修也次句汝字倒置應云旋倒汝聞機為順旋倒即返義聞機如第三經中解下二句可知末句總結圓通實如所選。",
        "from": "X14n0298_006:0818b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此是微塵佛(至)我亦從中證非唯觀世音。",
        "from": "X14n0298_006:0818c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊歎上反聞圓通乃三世師資入道之心宗也此十句總為一偈前八句總明三世師資依是而修初二句總歎返聞是過去塵佛入道要門一路即是一道涅槃為所通圓通為能通以能通為門通於所通故過去指如來說現在指菩薩說未來指修學者說修學必屬二乘葢三世影顯文互通也巧言攝意可以心會又過現二世皆稱已證未來勸修當從聞入末二句文殊謂我亦從此證入非獨觀音此重明一路意也。",
        "from": "X14n0298_006:0818c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "誠如佛世尊(至)非是長修學淺深同說法。",
        "from": "X14n0298_006:0818c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊結明承旨取觀音而去諸聖之意也此文義分二偈前偈一章六句結明承旨取觀音之意後偈一章五句結明去諸聖之意初中前四句出委命承旨簡選的所以又誠如下二句是委命承旨以救下二句正出所以謂所以命選者欲以救諸末劫求出世之人故後二句出取觀音意謂欲成就求出世間人之涅槃心者觀音為最也涅槃對生死說謂世間眾生念念生滅是生死心出世涅槃不生不滅是諸佛心今乃成就彼人解脫生死希證涅槃唯觀音返聞為最也次中謂自餘二十四聖所修方便皆是佛之威神觀機逗教即彼事上令捨塵勞塵勞既捨則已非是長時修學之法又復深淺不侔大小異轍然而淺深在機世尊一音演說隨類各解逗機似別指歸實同故云淺深同說法也。",
        "from": "X14n0298_006:0818c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "頂禮如來藏(至)圓通超餘者真實心如是。",
        "from": "X14n0298_006:0819a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經文殊料揀已周禮佛覆命鄭重其選乃以反聞對之并結全意也此文并為一偈初二句文殊禮讚佛也如來藏是佛所證圓理藏義解見前文是為上上無漏之法妙不思議者也今文殊禮讚所證意實在能畢事而覆命是主伴之禮也次二句願以所選加被未來更無他惑又次六句可解末句真實心指前圓通常三真實說長水挾情之說非也。",
        "from": "X14n0298_006:0819a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於是阿難及諸大眾(至)阿耨多羅三藐三菩提心。",
        "from": "X14n0298_006:0819a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經集家敘述大眾聞偈悟心及所證有差也於是二字是集家敘語起文之辭謂阿難及眾聞前簡選圓通偈意得法喜而開悟故身心了然者身是六根心是藏識由前一六俱亡得圓通實義了無疑滯故云身心了然得大開示者稱藏性而說故云大開示也以得悟故觀佛菩提涅槃二種果德明了無疑菩提屬智德涅槃屬斷德猶如下設喻顯其明了之意文可解若以意合者事喻五住惑遠遊喻流轉五道為五住惑之所留故未得歸還家喻菩提涅槃道路喻諸行也因事遠遊喻昔日之迷明了還家敘今日之悟普會下述三乘及諸雜類解證有差也十恒河沙者言其數之多也得本心者得字得淺深說有未實證者故本心指藏心說人所本有故離塵垢得法眼淨者初果以上皆是法眼淨位性比丘尼即摩登伽女譯義見前女由聞偈增進四果又有無量眾生發無上道心以上即解證有差之相也梵語阿耨多羅譯云無上三藐譯云正等三菩提譯云正覺無等等者法華文句云九法界心不能等理佛法界心能等此理故云無等而等也又究竟之理是無等初緣究竟理而發心能等於理故云無等等也又心之與理俱不可得將何物等何物而言無等等耶心之與理俱不可說不可說而說說此心等此理故云無等等也初是橫釋次是竪釋又次乃非橫非竪釋也三釋皆妙詳出於此學者當子細潛心理會可得也前第四經末請行初文佛說發覺初心二決定義其第二決定審煩惱根本兼選圓根直至於此始圓第二義也應知二決定義為自行總科後文重請安立道場結壇說呪等事葢為末世眾生而發請者為利他行也自利利他為行門大意學者窮經深入先識大猷斯為一助也。",
        "from": "X14n0298_006:0819a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難整衣服於大眾中(至)於菩提心得無退屈。",
        "from": "X14n0298_006:0819b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經阿難從前得悟自行復請安立道場等事為利他行也初阿難下至稽首白佛是集家語從大悲世尊下方是阿難自陳之言整衣服者肅其請儀心迹圓明者心存於內迹現於外圓則不偏明則不局由得悟故德容異昔也悲欣交集者悲昔之沉淪欣今之遭際並集於心故欲益下敘其請法之由成佛法門者指前耳根圓通說是中即指聞根此是阿難欲請利他先陳自利也常聞下引例明利他之由佛昔有言謂自未度而度人者菩薩之心也自覺圓而覺他者如來之道也此是阿難回小果心向大乘道之所從也世尊下正敘末劫多難請陳匡護之道去佛漸遠者隔正像法二千年入末法中又漸遠矣時甚衰替魔外偏熾如恒沙之多難尤甚矣當於是時欲將如來正法攝化其心入乎正定云何令其安立道場遠離魔外之事於佛菩提心不退轉而無屈撓之難耶。",
        "from": "X14n0298_006:0819b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時世尊於大眾中(至)阿難大眾唯然奉教。",
        "from": "X14n0298_006:0819c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經佛諾其請將有所酬先歎其請之善而誡令諦聽也佛歎善哉者正歎其回自化他行大乘行故此心固善也重言善者大乘之道希世行故又小聖回心便為固故乃善之善者故重言之汝今下誡聽阿難下領教唯者應之速也。",
        "from": "X14n0298_006:0819c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛告阿難汝常聞我(至)是則名為三無漏學。",
        "from": "X14n0298_006:0819c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經世尊將酬道場之請先明結壇修心之本也梵語毗奈耶譯云法律佛引律中三義而稱決定者謂修行人決定依此三法次第得故所謂下標名三名生起次第有由初云戒者攝心名戒以防非止惡不令恣縱五欲塵勞名攝心也因戒生定者攝心是定之因故戒具足能生定也因定發慧者定極能發般若真光故經云無量清淨慧皆依禪定生即此意也從微及著直至究竟果覺不離此三故稱三無漏學也此總標下別釋。",
        "from": "X14n0298_006:0819c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難云何攝心我名為戒(至)不如此說則波旬說。",
        "from": "X14n0298_006:0820a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經世尊別釋三學以明結壇修心之本茲先釋戒自婬始也此連後文四節皆釋戒學定慧二學義形於戒不別釋也是故文中皆言多智禪定等語良由定慧以戒為基基若不實即彼二學亦無成故今文大意戒為急務故詳明之定慧一學依戒顯故下皆倣此然又詳審佛意先標三學後次第應別釋則於標列文義周備今但明戒中四誨定慧二學置之不說葢大乘戒即攝定慧故如古德云圓人學戒即學定慧此經屬圓故一學一切學也云何下徵名若諸下正釋諸世界有二意一指此娑婆大千界說故稱諸也二通指十方說謂諸眾生皆由婬欲以正性命則生死無窮是故其心不婬則生死根本斷矣何有相續此正明攝心為戒也若諸下先釋婬戒婬屬愛愛為生死根本故相續長劫汝修下修三昧者本欲求出塵勞塵勞約五住惑說若婬心不除塵勞必不可出縱有下是縱辭大率婬心不除一切定慧俱不得成縱發定慧只是邪定邪慧如來正定正智必不可得如此不斷婬而修行者必落魔道修力深者為上修力淺者為中為下然作魔民猶是男身故稱為上若作魔女婬心愈熾修力愈淺故為魔女如登伽之類彼等迷誤既深不知自以為魔亦各自有魔法師徒訓化稱己所得為無上道也我滅下極指末法下衰之際多此魔民充滿世間正法如懸絲邪法熾盛惡燒如火潛匿姦欺廣行貪穢稱善知識婬婬相傳令諸眾生墮愛見坑喻愛如坑者謂貪愛之陷溺如坑難出離故菩提正路則失之矣汝教下佛誡阿難留願入末法中教彼眾生欲修正定先斷婬心是名先佛第一決定清淨明誨稱先佛者約末世說佛滅既久故稱為先疊舉十號之三者殷重之也決定如前說驅制婬穢曰清淨達道之教曰明誨此結初誨名也是故下結明非戒不足以修定及慧如蒸砂等者舉喻以明非戒不定之意謂不斷婬而修定者如蒸砂求飯則誤矣砂非飯本縱經塵劫秪名熱砂蒸砂求飯喻以婬身而求佛果葢斥婬身非求道之本也經劫之言極明誤之甚也汝以下深警誤由汝字先指阿難意及末劫良由阿難誤墮婬室故指阿難以及眾也佛謂若使不斷婬求佛妙果縱得妙悟皆是婬根此二句亦是縱辭何者葢不斷婬必無妙悟豈有妙悟成婬根者耶然或縱發理解亦是助其婬機非妙悟也如前三品魔類是也三塗者塗是塗毒地獄名火塗餓鬼名饑虗塗畜生名刀碪塗又塗與途通若云途途秪是三惡道耳必使下稱婬機者機是機括約喻說貪婬之心對境即發如機發之速也身心俱斷者二乘制身菩薩制心二俱斷故斷性亦無者謂斷婬是人空境斷性是法執必使法執亦無則人法俱空也得二空故佛菩提可希冀矣末四句總結初章大可解波旬是魔王名譯云殺者生身法身俱為所殺故。",
        "from": "X14n0298_006:0820a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又諸世界六道眾生(至)不如此說即波旬說。",
        "from": "X14n0298_006:0820c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前別釋三學以明結壇修心之本於戒次釋不殺也又諸下次釋殺戒殺以相殺相吞故亦生死相續也汝修下如前章說縱有下亦縱辭落神道者鬼神貪血食故不斷殺心彼不斷殺而修定者報落其類三品修力亦如前說大力鬼者長水疏云五嶽四瀆係祠祀者是也以血食所主故飛行夜叉及羅剎類譯語見前諸鬼師等為大力部從如此方河神及五方鬼等是也地行羅剎亦乘修力感生者報得鬼福如今虎狼附鬼力而食人者是此類也彼等鬼部不識正法各有徒眾以鬼法率眾亦各自稱有道我滅下如前可知彼言食肉得菩提路者如今之世傳鬼語以血食祭者得何等福除何等祟即此意也阿難我今下出比丘食肉之由佛召當機云我令比丘食五淨肉者葢由竺乾地多砂石種植為難且以小乘初制比丘不能頓斷肉食是故佛以大悲神力化生諸肉本無命根假名為肉五淨者律開三淨謂不見不聞不疑為我殺者名為淨也孤山義加自死鳥殘合稱五淨稱婆羅門地等者西域五天通稱婆羅門國故指婆羅門說佛世比丘既得其味傳之末季現前無佛所化無由乃食眾生肉矣此食肉人豈得名為釋子汝等下正明非釋子意文可解汝教下佛誡留願入末法中及結第二明誨名義解如前說是故下結明非戒不足以修定及慧譬如等者舉喻以明非戒不定之意塞耳大呌求不聞者秪可自瞞人何不聞苟或不呌聞者猶寡以大呌故聞者愈多然其塞耳欲隱也大呌求不聞者則彌露矣塞耳喻修定大呌求不聞喻不斷殺而求出塵修定是欲隱也不斷殺而求出塵其罪愈彰是彌露也以法合喻會意乃得清淨下出大乘戒意遵殺戒故不踐生草草所生發猶人命也戒謹之士既不敢蹋況手拔乎如草繫比丘可鑑云何大悲之子取眾生血肉充食耶此深責比丘食肉之非也若諸下正示教誡東方者西域指震旦諸國為東絲綿絹帛震旦所產從鑊湯烹殺中來戒謹比丘不應服也此土指五天竺說靴履等是彼所出葢天竺多山崇峻綿亘故多產獸彼人所衣皆裘毳等裘是羔絨之衣細羺之毛名毳又所食者多乳等以醍醐為之上味初[穀-禾+牛]名乳以酵發之初番名酪次番名酥又次名醍醐此是獸之身分守戒者不應食者如此不服不食於諸世間真為解脫以解脫故無餘債也酬還宿債不遊三界者以不服不食無宿債可酬故不遊三界也葢宿債者以後望今說非指過去宿冤若按下章無始之言亦指過去辯在下文何以下三句釋不酬意謂服食其身即為彼緣反顯不服不食緣從此斷如人下二句引例為緣之意人食地味即與地為緣故足不離地也百糓即五糓別生之多者黍稷稻菽麥各生二十種五種變而成百也必使下七句結明真脫之意身身分者食肉為身食乳衣毛為身分也又貪味屬心衣毛屬身故云身心二途不服不食我說下二句正結真脫意末四句如前章說。",
        "from": "X14n0298_006:0820c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難又復世界六道眾生(至)不如此說即波旬說。",
        "from": "X14n0298_006:0821b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前別釋三學以明結壇修心之本於戒又次釋盜戒也生死相續及汝修等者皆如前說縱有下亦縱辭落邪道者盜則不義不義是邪故落邪道是以不斷盜而修定者必墮其類文中不言盜而言偷者盜是劫盜明火執械傷人破戶是謂大盜偷是穿窬竊取畏首畏尾是謂小偷今文意在禁止小偷不與取等及竊仁義鄉愿之名者故斥為偷心小偷尚戒況其大盜者乎是故不言盜而言偷也三品精類如前意會之精靈者如第九經色陰中說以邪心含受魑魅邪悟靈異或見遠方市井無端說法通達妙義者是其類也妖魅等者如多年不死之狐能現妖冶女色凡一切妖孽怪事及世所稱五方賢聖能禍福人者是其類也邪類眾多難以枚舉故稱群邪此等各有黨與各自稱已得上人法此以迷為解也我滅下可知潛匿姦欺稱善知識者正是竊盜仁義鄉愿名德以自濡者古稱德中賊者即此謂也詐稱得上人法詃惑無識彼無識愚人為其所惑智者旁觀洞徹肝腑也恐令失心者恐是驚恐或說未然禍福水火災祥等事恐嚇其心合失故守此輩所過之處令人家財耗散往往有之非空言也我教下四句正示不偷所以循方猶隨方也隨在何地皆令乞食乞食則無畜無畜則捨貪心貪心既捨即成菩提之漸矣諸比丘下六句示其養生繕性之法謂諸比丘不自熟食乞他所熟寄養吾身殘年旅泊如客寓三界暫住而已不作常住之想示此一往去已無再返之念佛制如此云何賊人現比丘相假借如來圓頂方袍裨助偷心販賣佛法造種種業為佛之法却誹具戒為小乘道末法之獘一至於此疑誤末學墮無間獄也若我下示以內施返其偷心於自身心然燈爇香身尚能捨況其身外有偷心耶無始宿債一時酬畢之言於理尚疑何者今之內施及前章不服不食等語但可免我後世酬債之愆云何無始宿債得償耶大率內施心重供佛功高及前章真脫之行滿故以此功而償彼債又或回己之功向彼宿冤令彼超脫方堪畢酬文略義晦必以意會可得然或圓乘實觀或種俱銷自他不隔物我一如復有何債可償耶長揖世間者謂永別謝絕不復來故雖未下四句明覺路深遠未即大通佛說是人於如來妙道已得決定信心言其不退也若不下六句極言內施微因不可不行也微因者謂於身分所捨不多而其成功甚大無始宿債畢酬功非大乎故反顯以明內施因微果著行者所當行也若不行此縱成無為宿債須償故引佛例為證馬麥事見四分律藏可檢由佛宿生詬一比丘可食馬麥今雖成佛猶不免此故云雖成無為宿債必償世尊以此深警行者勿忘施行也汝教下佛誡留願入末法中及結第三明誨義如前說是故下結明非戒不足以修定及慧譬如下舉喻以明非戒不定之意水喻標定漏巵俗稱漏斗是也喻不斷偷的身心長水疏云灌禪定水於破戒巵欲求漏果塵劫不平誰之過歟若諸下正示教戒謂比丘於一衣一鉢之外分寸不畜又令乞食餘分施餓眾生此明竭盡施皆反其偷心之對治法也於大下又明降心義謂於大集會中降伏我慢高心捶是打詈是罵同於稱讚稱讚對詈捶義略也補云捶打同於撫摩此云毀譽不動降心之法應上身然燈炷身心俱捨也故下云必使身心俱捨又復不將如來不了之說迴為己解自心局隘又局隘於人誤彼初學若不以此自誤誤人佛印是人得真三昧末四句可解。",
        "from": "X14n0298_006:0821b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿難如是世界六道眾生(至)不如此說即波旬說。",
        "from": "X14n0298_006:0822b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "這一節經承前別釋三學以明結壇修心之本於戒又次釋妄戒也前標三無漏學今列四誨者謂三學雖圓若大妄語則於三昧不得清淨故加此誨然上四戒是比丘四根本戒指本雖同戒相校細此屬大乘故大妄語者簡諸支末妄語故加大言成愛魔失佛種者貪前戒具名譽自矜愛己名德故生諸妄即愛見成魔既落魔類則失佛種勢必然也所謂下二句上但標名此正示相得約理說證約果說理所未得而謂為得果所未證而謂為證此二句為妄語正意或求下別示求尊要譽之相須陀洹等譯語見前此為尊重弟子為世所敬故云尊勝第一前三稱果第四稱道者前三約當果說第四是無學位具八正道故辟支是中乘人又勝於前十地指地上說地前指三賢位說是大乘故超勝前三指此要譽要供總名大妄語也一顛迦譯義見前如人下二句約喻明斷佛種多羅是梵語具云貝多羅譯云岸形樹名也刀斷其本更不發生故下二句以法顯喻云佛記是人永殞善根斷木喻滅佛種刀喻大妄語以妄語斷佛種如刀斷木也佛記者佛授記也按業定報必非謬故沉三苦海者三苦海指三途說三途純苦無涯涘故我滅度下佛勑三乘人應身生末法中作種種形者行四攝法也示現同形同事令易信受故或作下四句示順行事如是下四句示逆行事稱讚下二句通上順逆皆以讚佛弘法令其身心信向得入正定雖其現形同事終不自言聖迹擅泄佛之秘密因緣輕向末學初心言此彼亦輕信二俱忽慢招不恭之罪唯除臨終陰有遺付亦不明言略露而已如寒拾輩及南嶽天台銅輪鐵輪之說是也云何下深責妄語之人顯其異言異行惑人耳目汝教下佛誡末法化行如上及結第四明誨如前是故下結明非戒不足以修定及慧如刻等者舉喻以明非戒不定之意謂不斷妄而修定者如刻人糞乾屎橛作栴檀形形雖像香其性本臭終不成香刻糞喻不斷妄而修定者栴檀喻正定正定本具一切功德法香故妄語身心如人糞臭惡無比安得正定我教下正示教誡謂比丘當直心行道如淨名云直心是道場無虗假故於四儀中凡諸往去行來俯仰語默一切行中無謟無詐無矜無誕云何自欺謂得上人法耶譬如下引譬以明妄稱之罪文可解求佛菩提如噬臍者言其不可及也噬臍如春秋傳曰楚文王伐申過鄧鄧祁侯曰吾甥也止而享之騅甥聃甥養甥請殺楚子鄧侯弗許三甥曰亡鄧國者必此人也若不早圖後君噬臍注曰以不及也葢噬囓也如人自囓其臍不可及故今經所喻以明求菩提者以妄語故佛果不可及也若諸下重躡直心說謂直心如弦一切行中皆踐真實直故無魔佛印下可知末四句如前。",
        "from": "X14n0298_006:0822b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經直解卷第六",
        "from": "X14n0298_006:0823a11_0",
        "context_with_next_sentence": false
    }
]