[
    {
        "source_sentence": "維摩經疏第四(原本此卷唯卷尾有疏題發首無題直安品自今例上故安題)胡　吉藏　撰不思議品第六不思議品第六方丈再會大開二章第一略明二智已竟今即第二廣明二智凡有五品今即第一不思議品且問此經名不思議經何故徧以此品標不思議品耶答唯此品名不思議品餘不名不思議品者亦應唯此品是不思議經餘非不思議經又難不思議是法維摩是人如此巳不解云如此難若不思是法法通一經而有不思議品維摩是人人通一經亦應有維摩詰品維摩是人無別維摩品不思議是法無別不思議品次到難維摩是人唯通而無別品者亦應不思議是法唯別應無通法有別不可無通人有通不可無別是義云何然解前難此品名不思議餘品不名不思議品亦此品是不思議經餘品非不思議經者解云例而不例者維摩人義顯不思議法不顯何者經名不思議即通此品名不思議者明不思議別事言此經通名不思議者經題云一名不思議解脫又肇師云始於佛土終至法養其文雖殊不思議一故是通也今此品明不思議別者方丈之室色三萬二千師子之座即不思議事也難此經通名一不思議經何不通名一不思議品解云有通別通名不思議經通名不思品即無十四品今欲開十四品品別為義故此品徧名不思議品也人唯一通無兩別故不例(云云)又難此經名不思議經有不思議品者涅槃經名涅槃應有涅槃品解云互例而不例者涅槃般若明義已顯故不須立涅槃時若品此經名不思議未顯故須立不思議品也次一意所以此經通名不思議經別有不思議品者欲以別貫通用事顯理亦用迹顯本言以別灌通者此品明大能入小小能容大此是菩薩不思議別事此一事既不思議經一切事皆不思議何者此品大小相容絕凡夫二乘有所得及以淺行境界所餘一切事舉足動步皆絕凡夫二乘有所得及以淺行境界皆不思議也言用事顯理者只此大小相容即是不思議之事事既絕二乘有所得淺行理亦絕此等境界事既不思議理亦不思議迹既不思議本亦不思議為是義故所以此品名不思議品也又品辨不思議名故下文云菩薩有解脫名不思議辨體辨名明用事故名不思議品也問若使此品通貫一經名不思議者何不正說之初即明不思議至此方明不思議耶解云欲通灌前後故處中明之也且此之一經起於現病由現病故有此一經為此故前現病現病故文殊問故病人顯不思議等事故問疾後明不思議也。",
        "from": "X19n0343_004:0207c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "問若此經起現病何不名現病經耶解云不得名現病經現病語別不思議語通何者健病一切皆不思議現病是不思議中一事故不得名現病經也所以接問病品者明問病品辨無量一義此下明一無量義上無量一者但一病方便下明一無量者現眾生數等身說眾生數等教故也又意前問疾品明菩薩赴緣之本意今明菩薩本意赴緣前本意者有二種眾生本菩薩本眾生癡愛本菩薩以大悲為本由大悲故有菩薩身心也今為赴緣者既大悲用此大悲何為大悲為眾生現一切方便事為眾生故說教令眾生體悟如菩薩為是故有此品來也。",
        "from": "X19n0343_004:0208b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時舍利弗見此室中無有牀座作是念斯諸菩薩大弟子眾當於何坐長者維摩詰知其意語舍利弗言云何仁者為法來耶求牀座耶。",
        "from": "X19n0343_004:0208b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "就此品中大開為二第一明方便實慧第二明實方便慧又方便實即迹本實方便即本迹又開云第一呵求坐第二給坐今即第一有數番問答不開今即身子嘿念牀坐問眾中有菩薩有聲聞何故聲聞念座菩薩不念座耶解云此有所以菩薩不念座者有二義一者菩薩以法身為身身無疲[病-丙+卷]故不念座又且菩薩聞於勝法怡神悅意不念於疲[病-丙+卷]何以知然世間人聞音樂等尚復忘疲豈況菩薩聞斯勝法而當有疲[病-丙+卷]故不念座二乘反此何者聲聞心雖無漏身猶結業有結業故身有待所以念座二者設使未得法身菩薩結業身者此菩薩聞法入心不覺有[病-丙+卷]故不念座聲聞雖聞勝法法不入心如法華中聲聞自序云我聞如來說成就眾生淨佛國土都不喜樂但念空無相願故知不入心既不入心故身有惓有惓故念牀也又欲貶挫聲聞不斥菩薩由其念坐故所以得貶斥聲聞故其嘿念也問何故不彰言而嘿念耶解云此乃坐更相影發兩聖神交居士神力空室身子嘿念故不彰言也二者就事為論聲聞[券-刀+((巨-匚)@一)]故不彰言何者菩薩法身為身無諸患累聲聞身有患累[券-刀+((巨-匚)@一)]彰言不見牀故嘿念坐也又身子所以念座者竝是方便為開道門身子為道方便居士為俗方便居士空室方便身子念牀方便居士知身子應念故空室身子知居士借座故身子念牀也問二人皆方便何故令聲聞念不令菩薩念耶解云令聲聞念長得一種何者長得呵聲聞若令菩薩念即為取座不得呵今念得呵聲聞令聲聞高楊菩薩然後為取座也今即身子念身子是眾人之長體疲身惓以己察人故云諸菩薩大弟子當於何坐也長者知其意即責汝為法來牀座來作兩關問也。",
        "from": "X19n0343_004:0208b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言我為法來非為牀座維摩詰言唯舍利弗夫求法者不貪軀命何況牀座夫求法者非有色受想行識之求非有界入之求非有欲色無色之求唯舍利弗夫求法者不著佛求不著法求不著眾求夫求法者無見苦求無斷集求無造盡證修道之求所以者何法無戲論若言我當見苦斷集證滅修道是則戲論非求法也唯舍利弗法名寂滅若行生滅是求生滅非求法也法名無染若染於法乃至涅槃是則染著非求法也法無行處若行於法是則行處非求法也法無取捨若取捨法是則取捨非求法也法無處所若著處所是則著處非求法也法名無相若隨相識是則求相非求法也法不可住若住於法是則住法非求法也法不可見聞覺知若行見聞覺知是則見聞覺知非求法也法名無為若行有為是求有為非求法也是故舍利弗若求法者於一切法應無所求說是語時五百天子於諸法中得法眼淨。",
        "from": "X19n0343_004:0209a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗答為法來明菴園精舍非無牀座今所以來者為法故來此言自死何者且竝汝若求法不求座即應念法不念坐既念坐不念法即應求座不求法也又依文難汝為求法來此言復死何者若有法可求即非求法度即節破也夫求法者下前身子有二一者云不求座已如前竝二者為求法故來是故今更破其求法言夫求法者非五陰等求者明五陰畢竟不可得故不應五陰求界入不可得故不應界入等求也非有欲色下前橫洗六道今竪窮三界也舍利弗夫求法不著佛求者上明世間六道非求法今明出世三寶亦非求法求三寶畢竟不可得云何著佛等求所餘文可尋造音摻說是語時五百人得法眼淨者此中呵身子諸天得道呵聲聞化菩薩通二意也又作此呵即是無得寶相若有所得求即有所依即心眼不淨若無所得即是悟心眼即淨故云得法眼淨此云法眼淨者小乘亦法眼大乘亦法眼小乘法眼即初果見四諦法名法眼大乘法眼即初地得真無生法故云法眼淨今此中大乘法眼肇師作此釋也問此中法眼與五眼中法眼何異解云異此中云法眼只是慧眼見四諦法慧眼開名慧眼而今言法眼者見四諦法故云法眼若五眼中法眼二乘所無唯在菩薩明知三乘根性而為說法故云法眼也。",
        "from": "X19n0343_004:0209b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時長者維摩詰問文殊師利仁者遊於無量千萬億阿僧祇國何等佛土有好上玅功德成就師子之座。",
        "from": "X19n0343_004:0209c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時長者維摩詰問仁者下品開兩章第一明方便實慧竟今第二明實方便慧問何故明此二慧耶解云經文如此今依經而明又問經何故明二慧解云此經以二慧為宗前一品略明二智今下去廣明二智為此故前章明實慧此章明方便慧也問何故前明實慧後明方便慧不前明方便後明實慧耶解云此無所在既前明實慧亦得前明方便慧而今前明實慧後明方便慧者隨緣故爾前身子念座求法是故前破其念座求法之心明畢竟無所求即實慧也今明如此小室容此大座即擁慧也又前明實慧今明擁慧者今明如此大座及以小室竝是十方諸佛無依無徧淨業所感今將明無依無礙之用故前破其有依礙之心若破有得有礙即得無依無礙之法為是義故前破有得有礙之心畢竟淨今方得明無依無礙之法也今即第一居士問文殊何處有好上玅第一之座吾為汝取之問主人設容座即應為設座云何問容何處有好高座吾為取之耶解云所以爾者欲顯淨名不可思議神力令文殊選取之應言即取也又所以問文殊者復有二義一者若不問文殊居士自設如此大座者恐是居士化作非是實來二者恐是一室一國之最上非是十方國土之第一為是義故所以問文殊仁者遊於十方何處有第一之座應言為取也文殊遊十方菩薩悉遊十方一切佛土如華嚴中云一切處文殊故文殊遍遊十方是故問之又問者非是淨名不曾遊十方文殊遊十方故問文殊今問者欲令文殊自選取故問也問實若為勝化耶解云實難化易如幻化師從牛口入牛尾出此事為易又二乘亦能化不能實用是故問覓不化作也。",
        "from": "X19n0343_004:0209c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊師利言居士東方度三十六恒河沙國有世界名須彌相其佛號須彌燈王今現在彼佛身長八萬四千由旬其師子座高八萬四千由旬嚴飾第一於是長者維摩詰現神通力即時彼佛遣三萬二千師子之座高廣嚴淨來入維摩詰室諸菩薩大弟子釋梵四天王等昔所未見其室廣博悉皆包容三萬二千師子座無所妨礙於毗耶離城及閻浮提四天下亦不迫迮悉見如故。",
        "from": "X19n0343_004:0210a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊答居士應言而取如文淨名入定彼佛即遣座者淨名不取而至彼亦不動而到正意(云云)其室廣博悉苞客者次簡此勾如芥納須彌須彌入芥芥納須彌須彌不小芥子不大蹵山令小開芥令大若爾即非不思議只芥納須彌須彌不小芥子不大亦應小室容大座大座不狹室亦不廣此是例義而今文云室苞大座室既廣博者芥納須彌芥應開大叡師解云自內觀即廣自外觀即如故在室內觀即廣博出外觀只是八尺之室內廣不礙外狹外狹不礙內廣只此復是不思議也法師更一意成叡師此說明客座故廣室相如故不開也。",
        "from": "X19n0343_004:0210b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時維摩詰語文殊師利就師子座與諸菩薩上人俱坐當自立身如彼座像其得神通菩薩即自變形為四萬二千由旬坐師子座諸新發意菩薩及大弟子皆不能昇爾時維摩詰語舍利弗就師子座舍利弗言居士此座高廣吾不能昇維摩詰言唯舍利弗為須彌燈王如來作禮乃可得坐於是新發意菩薩及大弟子即為須彌燈王如來作禮便得坐師子座。",
        "from": "X19n0343_004:0210b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "新發意菩薩及身子等皆不能昇身子答云吾不能昇何吾之有吾只是我之異名我自在義既不自在何得稱吾耶又問身子羅漢之人入神通時能變身滿三千世界云何不能昇此座耶有人解云維摩神力制不能昇如前菩薩品明魔不能去者居士神力制魔不得去今亦爾身子實能昇居士制不能昇今明不然明此等高座竝諸佛無漏淨業所起身子等結業之身故不能昇為燈王如來作禮佛借神力乃可得昇也。",
        "from": "X19n0343_004:0210b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言居士未曾有也如是小室乃容受此高廣之座於毗耶離城無所妨礙又於閻浮提聚落城邑及四天下諸天龍王鬼神宮殿亦不迫迮維摩詰言唯舍利弗諸佛菩薩有解脫名不可思議若菩薩住是解脫者以須彌之高廣內芥子中無所增減須彌山王本相如故而四天王忉利諸天不覺不知巳之所入唯應度者乃見須彌入芥子中是名不可思議解脫法門又以四大海水入一毛孔不嬈魚鼈[元/?]鼉水性之屬而彼大海本性如故諸龍鬼神阿脩羅等不覺不知己之所入於此眾生亦無所嬈又舍利弗住不可思議解脫菩薩斷取三千大千世界如陶家輪著右掌中擲過恒沙世界之外其中眾生不覺不知己之所住又復還置本處都不使人有往來想而此世界本相如故又舍利弗或有眾生樂久住世而可度者菩薩即演七日以為一劫令彼眾生謂之一劫或有眾生不樂久住而可度者菩薩即促一劫以為七日令彼眾生謂之七日又舍利弗住不可思議解脫菩薩以一切佛土嚴飾之事集在一國示於眾生又菩薩以一切佛土眾生置之右掌飛到十方徧示一切而不動本處又舍利弗十方眾生供養諸佛之具菩薩於一毛孔皆令得見又十方國土所有日月星宿於一毛孔普使見之又舍利弗十方世界所有諸風菩薩悉能吸著口中而身無損外諸樹木亦不摧折又十方世界劫盡燒時以一切火內於腹中火事如故而不為害又於下方過恒河沙等諸佛世界取一佛土舉著上方過恒河沙無數世界如持鍼鋒舉一棗葉而無所嬈又舍利弗住不可思議解脫菩薩能以神通現作佛身或現辟支佛身或現聲聞身或現帝釋身或現梵王身或現世主身或現轉輪聖王身又十方世界所有眾聲上中下音皆能變之令作佛聲演出無常苦空無我之音及十方諸佛所說種種之法皆於其中普令得聞舍利弗我今略說菩薩不可思議解脫之力若廣說者窮劫不盡。",
        "from": "X19n0343_004:0210c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又問如此大小相容唯應度者乃能見之今身子等既見不思議應解不思議解云身子等不解何以知不解故下文迦葉謂身子云於盲者前現眾色像聲聞之人聞不思議不解不知亦爾也即難既不解應不見答見何必解事如世間人作一物極精玅眾人皆見而不解也問解有何失解云聲聞若解即具三慧與菩薩無異也又舍利弗或有眾生樂久住世而可度者菩薩即演七日以為一劫者復是一種不思議且問與大座入少室何異上明須彌入芥須彌如故芥客須彌芥亦如故今演七日為一劫七日如故促一劫為七日一劫如故此義是[〦/(刀*ㄚ*(留-刀-田))/日]也難若不異者今演七日為一劫七日即長促一劫為七日一劫即[打-丁+豆]亦應芥納須彌芥子應開須彌入芬須彌應小既不蹵須彌開芬子亦應不延七日促一劫解云此文言延七日為一劫者乃延說之演演說七日為一劫何時延牽七日令長言演耶過不識字訓斯意僻也又解云此明延促與上相容義異上明大小相容不思議今明延促不思議上明不改不思議今明改不思議上明改不思議者小能容大大能入小而大小宛然故不思議今明改不思議者餘人不能改七日為一劫改一劫為七日菩薩能改不改者改故不思議示菩薩擁道非一故有此二文不同上明相容大小如故今亦七日為一劫一劫為七日長[打-丁+豆]如故今既延[打-丁+豆]為長促長為[打-丁+豆]上亦開小為大蹵大令小欲示菩薩擁非一故有斯二也問此之延促自在之智五智中為是若箇智耶五智者一泥洹智二法住智三無諍智四邊際智五願智此是五智中邊際智邊際知能延促自在也問此是菩薩權變自在大小相容今時若為能得解脫耶解云且舉一喻如一小鏡尚寫百丈大山鏡容大山而不大大山入鏡大山如故菩薩體諸法如夢如幻如鏡中像故能如此也次明延促長短者如人眠夢夢經百年百年之夢只是一覺之眠百年之夢一覺之眠不長一覺之眠百年之夢不[打-丁+豆]也他云夢顛倒虗妄何得為喻解云夢中夢歷歷覺中覺分明夢既虗妄覺亦顛倒是故菩薩體諸法如夢如幻故能如此也次文明作無量事現無量身辨不思議事問魔亦能化作佛身聲聞身及一切物今菩薩亦能如此復何足為奇耶解云菩薩能圓現彼不能圓現言菩薩能圓現者現一切身故華嚴云現眾生數等身說眾生數等教彼不能如此故菩薩不可思議也舍利弗我今略說菩薩不可思議者明不思議事不可具說今略說之也問略說盡不盡解云略盡一者略而不盡今盡而言略盡者明不思議事不出形之與聲既明形聲即攝一切故云略盡也。",
        "from": "X19n0343_004:0211a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "是時大迦葉聞說菩薩不可思議解脫法門歎未曾有謂舍利弗譬如有人於盲者前現眾色像非彼所見一切聲聞聞是不可思議解脫法門不能解了為若此也智者聞是其誰不發阿耨多羅三藐三菩提心我等何為永絕其根於此大乘已如敗種一切聲聞聞是不可思議解脫法門皆應號泣聲震三千大千世界一切菩薩應大欣慶頂受此法若有菩薩信解不可思議解脫法門者一切魔眾無如之何大迦葉說此語時三萬二千天子皆發阿耨多羅三藐三菩提心。",
        "from": "X19n0343_004:0212a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "時大迦葉聞說未曾有次舉譬即證前明聲聞見而不解也然可有四句一者見聞而解即菩薩二者見聞不解即聲聞三者不見不聞而今聞即世人復有不見不聞不解即底下之人也言未曾有者有二一前見未曾二聞未曾也。",
        "from": "X19n0343_004:0212a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時維摩詰語大迦葉仁者十方無量阿僧祇世界中作魔王者多是住不可思議解脫菩薩以方便力故教化眾生現作魔王又迦葉十方無量菩薩或有人從乞手足耳鼻頭目髓腦血肉皮骨聚落城邑妻子奴婢象馬車乘金銀瑠璃硨磲碼碯珊瑚琥珀真珠珂貝衣服飲食如此乞者多是住不可思議解脫菩薩以方便力而往試之令其堅固所以者何住不可思議解脫菩薩有威德力故行逼迫示諸眾生如是難事凡夫下劣無有力勢不能如是逼迫菩薩譬如龍象蹴踏非驢所堪是名住不可思議解脫菩薩智慧方便之門。",
        "from": "X19n0343_004:0212a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時維摩詰大迦葉仁者十方作魔王者明迦葉見一不見一唯知菩薩住不思議解脫魔無如之何不知只魔是住不可思議解脫也又上明順不思議順法門今明逆不思議逆法門上明善法門今明惡法門上明順不思議有二一形二聲形聲攝盡今明逆不思議亦有二一天二人天攝一切天人攝一切人人天攝一切盡魔即天乞人即人也然乞人非是世間容容人乃是住不思議菩薩能作如此化耳此就何物乞解云此就垂度檀河人檀河垂滿人乞強就其乞外即國城妻子內即四支百體其若施即度檀河檀河即滿故乞人是不思議人令行者行滿也次與龍象蹴蹋非驢所堪是不思議菩薩所能乞非淺行所能乞也有時云凡魔如驢不思議菩薩魔如龍象乃是不思議菩薩能了非凡魔所能也此言龍象者只是一象耳如好馬名龍馬好象龍象也。",
        "from": "X19n0343_004:0212b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "觀眾生品第七",
        "from": "X19n0343_004:0212b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "觀眾生品第七所以有此品來者有三意一者遠二者處中三者近言遠生者此經是菩薩經明菩薩行菩薩行者發心誓度一切眾生先人後己故大經云自未得度先度他是故敬禮初發心既發心欲度一切眾生應須識眾生相若不識眾生相即不能度眾生為是今明觀眾生令菩薩識眾生相雖度眾生實無眾生可度故金剛般若云滅度一切眾生實無眾生可度此言通貫一切故言遠生言中者從問疾品生彼文云從癡有愛即我病生以眾生病是故我病眾生病滅我病乃滅前後際悲皆等若爾菩薩大悲由眾生故有故大論云般若是佛母誰是般若母解云大悲為般若母誰為大悲母眾生為大悲母眾生從癡故愛愛故受生受生故病以眾生病故菩薩有大悲病以大悲故說般若是故眾生為大悲本大悲為般若本根本起自眾生是故今須觀眾生在本若正即一切正從菩薩正觀所觀為名故云觀眾生品也言近生者即是不思議品生不思議即是二知二知即是能觀眾生即是所觀又上不思議解脫即是緣教眾生即是教緣上雖明能觀緣教竟未明所觀教緣若但明教不明緣即不具足為是故上明教今辨緣也問今觀眾生者眾生為是有故觀為是無故觀耶然此義眾家釋不同薩婆多等云實無眾生但有陰入界等法眾生但有假名此名二世無唯現在和合故有名耳今明若實無眾生即菩薩菩薩本發心度眾生既無眾生可度何有菩薩又且若無眾生即是無見若實有法即是有見具足有無斷常二見云何名為菩薩故般若云斷一切諸見名為菩薩今既不離諸見云何名菩薩菩薩者即是體道之人古經詺菩薩為道士體道之士故名道士既體道即應離一切見也第二犢子道人云眾生是有眾生不可無何者彼云四大和合有眼法生五陰和合有人法生以是義故故知實有人法彼明假人不不可言真故非無為非三世非有為在第五藏中今明此亦非菩薩何者既云度一切眾生實無眾生得度所以者何若有眾生見壽者等見即非菩薩非但非菩薩亦非二乘乃是具縛凡夫何者我見是眾生之本故大品云身見攝六十二見故是具足凡夫也次呵棃云亦有亦無世諦故有真諦故無大論及成實論并馬鳴傳皆作此說明五陰為人輪軸為車世諦故有第一義諦故無若爾斯義應好然攢求之者竝崇此句以為栖神之宅詫心之處今明還是亦有亦無二見何者汝世諦有可無不真諦無可有不世諦不可無真諦不可有若爾世諦定有真諦定無故是有無二見非是菩薩也今觀眾生悉離如此之法如文如幻師見幻幻有非有幻有非無四句內外皆洗只此一句洗一切病故師云只假有一句破一切病也問云觀眾生如第五大此即是無云何彈他耶解云今明觀眾生如第五大何得同他若觀第五大如第五可薩衛今觀眾生如第五大只眾生菀然而無所有故云觀眾生如第五大所以大品云菩薩度眾生如虗空也問可無實眾生應有假幻眾生解云為實故幻無實何有幻四句皆淨只此是實相故大品云眾生即實際建立眾生於實際即建立實際於實際也實相既無所有眾生亦無所有故論云諸法實相者心行言語斷無生亦無滅寂滅如涅槃又責若爾經中何意或說有人或說無人耶解云諸佛或說我或說於無我諸法實相中無我無非我為是故眾生即實相也。",
        "from": "X19n0343_004:0212b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "○就文為二第一文殊淨名觀眾生第二身子天女觀眾生此之四人觀即一切人觀即觀一切何者文殊與淨名即道俗二人天女與身子即人天二人男女二人大小二人幽顯二人故此四人觀攝一切盡也就文殊與維摩觀眾生中為二第一明化他第二明自行就初為二第一論所觀眾生第二論能觀四等所以前論觀眾生後論四等者如前釋以眾生是四等本故前論觀眾生後論四等觀眾生既正次令眾生離苦故有大悲次與大樂故有大慈離苦得樂故有大憙知苦樂不二得空平等故有大捨為是故觀眾生後論四等也。",
        "from": "X19n0343_004:0213b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時文殊師利問維摩詰言菩薩云何觀於眾生維摩詰言譬如幻師見所幻人菩薩觀眾生為若此如智者見水中月如鏡中見其面像如熱時燄如呼聲響如空中雲如水聚沫如水上泡如芭蕉堅如電久住如第五大如第六陰如第七情如十三入如十九界菩薩觀眾生為若此如無色界色如焦穀芽如須陀洹身見如阿那含入胎如阿羅漢三毒如得忍菩薩貪恚毀禁如佛煩惱習如盲者見色如入滅盡定出入息如空中鳥跡如石女兒如化人煩惱如夢所見已寤如滅度者受身如無煙之火菩薩觀眾生為若此。",
        "from": "X19n0343_004:0213c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今即第一前文殊問菩薩云何觀眾生維摩言如幻師者淨名答明菩薩了悟眾生無所有故借十喻以明之大品餘處大乘皆借十喻以曉也言如幻者此句有盡言盡者眾生謂眾生是實信幻是虗今菩薩還借其所信之虗喻其所信之實同其信之虗既知實不實即知虗不虗此即盡也不盡者或情便謂若使如此乃無有實眾生應有虗眾生此於迷者不盡復須洗之本借虗為破實既無有實何處復有虗借假破實既捨實即應捨虗何領實無更著虗如肇師云無常為破常非是有無常今亦爾將虗為破實非是有於虗破實破故明虗實無虗即無此兩句既無四句內外皆淨也問若無實無虗乃至非虗非實一切皆無應無眾生解云不如此今明無所有者明眾生相無所有眾生相宛然而無所有舉譬如幻語咲菀然而無所有故肇師不真空論云幻化人非無幻化人幻化人非真人也彼人體諸法如此所以什師歎云秦人解空第一僧肇其人也如智者見水中月此明智人見月菀然而無所有不取愚者不如彌猴捉水中月沒水而□鏡像亦爾取智人見鏡像宛然了知無所有不取愚人不如鷄見鏡像即與之鬬鷄為之碎爪虎為之折牙不取此為喻但取智者為喻也如熱時炎此亦得類前智者見鏡像實無所有亦智者見熱炎實無所有也亦得異上上智見面知無所有今或者謂熱炎為水實無水故有異也次如第五大乃至十九界等者已如前釋今更明有二意一者因緣人二者破實人明因緣人如幻有無所有而有二者破實我為破實我之病明眾生如十三入十九界畢竟無所有也菩薩觀眾生為若此即體也問眾生如十三入十九界等畢竟無所有菩薩觀誰耶眾生既如十三入十九界菩薩亦如十三入十九界眾生無所有菩薩亦無所有誰能觀耶解云已如前明只眾生相如此菩薩觀眾生宛然無所有又眾生知所有亦不須菩薩度只為眾生於無所有中於眾生成有為是故菩薩觀眾生無所有令眾生同悟無所有也。",
        "from": "X19n0343_004:0213c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊師利言若菩薩作是觀者云何行慈維摩詰言菩薩作是觀已自念我當為眾生說如斯法是即真實慈也行寂滅慈無所生故行不熱慈無煩惱故行等之慈等三世故行無諍慈無所起故行不二慈內外不合故行不壞慈畢竟盡故行堅固慈心無毀故行清淨慈諸法性淨故行無邊慈如虗空故行阿羅漢慈破結賊故行菩薩慈安眾生故行如來慈得如相故行佛之慈覺眾生故行自然慈無因得故行菩提慈等一味故行無等慈斷諸愛故行大悲慈導以大乘故行無厭慈觀空無我故行法施慈無遺惜故行持戒慈化毀禁故行忍辱慈護彼我故行精進慈荷負眾生故行禪定慈不受味故行智慧慈無不知時故行方便慈一切示現故行無隱慈直心清淨故行深心慈無雜行故行無誑慈不虗假故行安樂慈令得佛樂故菩薩之慈為若此也文殊師利又問何謂為悲答曰菩薩所作功德皆與一切眾生共之何謂為喜答曰有所饒益歡喜無悔何謂為捨答曰所作福祐無所怖望。",
        "from": "X19n0343_004:0214b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊師利菩薩應作是觀者云何行慈下第二論能觀四等前文殊問接前觀眾生菩薩既觀眾生云何行慈也維摩言作是觀自念為眾生說此法即真實慈然此中問易答難所以爾者問即狹狢答即顯道故問易答難也前問云既無眾生菩薩云何行慈今即如此說即真實慈者明菩薩作此觀即是中道正觀今眾生悟此正觀得於法身之樂即真實之慈若凡夫二乘只是斷常觀得生死果非真實慈何者凡夫見有即常見二乘見無即斷見既是斷常煩惱見即得生死果令菩薩雙離此二觀眾生無所有即離常見無所有而觀眾生即離斷見離斷常即中道正觀令眾生悟此中道得於法身故是真實之慈也又說此法真實慈悲之說故云即真實慈也然作此釋猶未可解何者既無眾生即應無說云何言說如此即真實慈耶解云眾生若知無所有畢竟無菩薩亦無所說故大品云眾生若知畢竟空菩薩即無功夫只為眾生無所有於眾生有眾生既無所有而有菩薩無所說而說無所說而說說無所有令眾生無所有有悟有無所有故說此無所有法即真實慈也寂滅慈者即寂滅諸見即寂滅慈也阿羅漢者問二乘慈橫門慈非好慈今云何言行阿羅漢慈耶解云此借阿羅漢以目此慈耳阿羅漢名[煞-(烈-列)]結賊明此慈能破結賊也行菩薩慈亦爾竝是借喻耳所餘三等如文。",
        "from": "X19n0343_004:0214c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊師利又問生死有畏菩薩當何所依維摩詰言菩薩於生死畏中當依如來功德之力文殊師利又問菩薩欲依如來功德之力當於何住答曰菩薩欲依如來功德力者當住度脫一切眾生又問欲度眾生當何所除答曰欲度眾生除其煩惱又問欲除煩惱當何所行答曰當行正念又問云何行於正念答曰當行不生不滅又問何法不生何法不滅答曰不善不生善法不滅又問善不善孰為本答曰身為本又問身孰為本答曰欲貪為本又問欲貪孰為本答曰虗妄分別為本又問虗妄分別孰為本答曰顛倒想為本又問顛倒想孰為本答曰無住為本又問無住孰為本答曰無住則無本文殊師利從無住本立一切法。",
        "from": "X19n0343_004:0215a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊問生死畏菩薩當何所依者初文殊與居士觀眾生為二第一明化他竟今第二自行此文更為二初文殊問次淨名答今第一文殊問然此問正為始行菩薩故作此問也問何故卓爾有此文來明生死有畏菩薩當何所依耶解云有此文來者具有通別二意言通意者此中正明始行菩薩發菩提心既發菩提心即有異二乘心二乘心自調自度棄生死入涅槃今既是菩薩發菩提心應在生死濟度一切眾生既在生死生死甚可怖畏今是始行菩薩未勉怖畏畏於生死既畏生死菩薩當何所依故作此問也別意者從前四等文生菩薩既有大悲即應在生死拔眾生苦生死既可畏菩薩當何所依勉怖畏故問云生死有畏菩薩當何所依也維摩詰言菩薩於生死畏中當依如來功德者上文殊問云生死有畏當何所依今答云當依如來功德明上有所憑故下無所畏然依如來功德即是念佛三昧念佛三昧遍治一切何者有別治通治別治者如貪欲多教不淨瞋恚多教慈悲愚癡多教因緣覺觀多教數息著我多教界方便此即別也通治者眾生等有此病應教念佛三昧念佛三昧通治一切故令依如來功德也又如大品中明菩薩九相觀時菩薩身毛皆竪生於畏心令作於六念今亦爾也文殊又問菩薩依如來功德當於何住者明菩薩在生死怖畏依佛功德何所作耶淨名答云菩薩依如來功德欲度脫一切眾生也又上依如來功德即上所依今明度眾生即下有所濟亦上有所弘今下有所化又此亦是釋上依如來功德得無所畏何者以大來脫小明菩薩運心欲遍度一切眾生此心既大豈當復有於小畏者耶二者度一切眾生即有慈心若有慈心即無所畏亦無有人能惱菩薩者故世云人無害獸之獸無害人之意也三者念佛功德此是勝法既樂勝法即忘畏事故不畏也又問欲度眾生當何所除者明菩薩度眾生何所除答云所以度眾生者欲除眾生煩惱故也又問何故除煩惱答云當行正念既除煩惱即行於正觀由觀故能除煩惱也又問云何正念答得行不生不滅此言不生不滅非是八不中不生不滅此言不生不滅者明惡法不生善法不滅故云不生不滅也又問善不善熟為本答曰身為本者明身能起善起不善故云身為本問身熟為本答欲貪為本者明由欲貪故有欲貪即是愛由愛故有身所以大經云生死本際有二種一無明二有愛愛故受身所以欲貪為身本也又問欲貪熟為本答虗妄分別為本者明為欲貪本也又問虗妄分別熟為本答曰顛想為本何故分別於色只為有顛倒之想故虗妄分別所以顛倒想為分別本也又問顛倒想熟為本答曰無住為本此言難解開中有二釋第一解言無住為本者明顛倒妄想無有一念住時若得一念住即為正法只為不得一念住故為耶倒舉喻如水波動波若靜即水平影正以波動不得靜水不平即影不正今顛倒亦爾不得一念住故云無住為妄想顛倒本也二者言無住為本者明顛倒畢竟無所有畢竟無所有於眾生成有無所有於眾生有故云無住為顛倒想本也問無住熟為本此復難解若言無本便墮無因自然等義與外道及由來更有何殊且略類兩家一外道責十一根誰為本若五大為本乃至責冥初熟為本答冥初無本答責內學成論五住地義見一處住地誰為本答欲愛為本責欲愛熟為本答色愛為本即責色愛熟為本答有愛次責有愛答無明為本次責無明熟為本答無明無本今亦爾從初責善不善最後責無住無本何異耶今且依兩釋與由來人異一者明成論即有五地義僧佉法即有二十五諦義今菩薩未曾有此義但顛倒謂情有此等法今菩薩却責彼不可得故云無住無本也有時舉喻夢得錢飲酒飲酒而相打相打即許官問云何意相打因飲酒何得酒錢酤酒那得錢即不知今亦爾責顛倒不得故言無本此是破義非是立義也二者明未曾有因未曾無因因與無因竝顛倒謂謂有因責因故云無住無本故與他異也。",
        "from": "X19n0343_004:0215a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "○時維摩詰室有天女者第二章身子與天女論眾生所以有此女者終是諸佛菩薩更相影嚮堪開道利緣前維摩作男方便今天女作女方便故肇師云原夫能天能人者豈天人之所能果以非天非人故能天能人耳今亦爾能男能女者非男女之所能果非男非女能男女耳問今天女身子論眾生與前文殊居士何異解云通即不異何者通令識眾生之實凡夫不能知眾生之實此二章通令識眾生之實故不異也別即有異何者前文殊與淨名論眾生即通今天女與身子論即別言上論通者直論眾生如幻如炎如十三入等眾生語通一切故上論通今論別者今直男女論男男不可得論女女不可得論女女不可得所以為別也然此二人論攝一切人盡何者已如前明男女攝盡人天攝盡道俗攝盡故此二人攝盡也二人攝既盡二人論即一切人論此二人論不可得即一切不可得也問今論眾生何故論男女耶解云由男女故有一切眾生何者男見男女見女女見男男見女女愛女男愛男男愛女女愛男由男女故起愛見有愛見故有集諦有集諦故即有苦諦有苦集即輪轉生死也問經云生死本際凡有二種謂無明與愛今云何言見愛為本耶解云只見是無明無明故起見所以成論云是癡增上名之為見為是故今論男女論男不可得即無男論女不可得即無女無男無女即無愛見無愛見即無眾生故此二人論於男女也。",
        "from": "X19n0343_004:0216b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "時維摩詰室有一天女見諸天人聞所說法便現其身。",
        "from": "X19n0343_004:0216c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "就此文有七番且開為三第一論義之由第二正論義第三佛迹今即第一有天女者什師云是維摩八不思議宅神至人空同無像竝現十方未曾有宅不宅隨俗故宅未曾有神不神隨俗故有神隨俗宅宅異凡夫宅八不思議宅隨俗神神異凡夫神法身菩薩神故云室有天女也見諸大人聞所說法便現身者有二意一者上開道二者下斥聲聞上開道即供養菩薩之與正法斥聲聞即與身子論也言見大人聞說法者見文殊等諸菩薩來聞上所說不思議之法故言見諸大人聞所說法也便現其身者天本隱今即顯天女何意隱者居士空室既空物亦空神今室有物神即現前隱成空權巧今現成有方便又若隱若顯若現若藏皆為物開道皆是方便前藏方便今現方便故云現其身也。",
        "from": "X19n0343_004:0216c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即以天華散諸菩薩大弟子上華至諸菩薩即皆墮落至大弟子便著不墮一切弟子神力去華不能令去。",
        "from": "X19n0343_004:0217a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即以天華散者第二正論義就此為三初本身論二轉身論三復身論今初言以天華散者欲以華為論故天女散華又散華者欲示供養復欲挫諸小道故散華也言以華為論者菩薩或依果論或正果論華即依果身即正果正果中或本身論或轉身論或復身論三業皆為所以爾者菩薩無依無礙種種為或世界或光明或香華或國土如信相菩薩疑佛八十室忽然廣博土穢而忽淨即答[打-丁+豆]壽之疑何者室狹而不狹即知壽[打-丁+豆]而不[打-丁+豆]光明論議即如大經十九卷大眾中忽有光明非青見青非黃見黃等即是釋德王之難也香味論即如此經下文香積品也今此中即散華論只散一華即雙難大小散菩薩難菩薩散大弟子難聲聞散菩薩皆墮落者此是菩薩無礙問答散華即無依之問菩薩能去華菩薩無依之答此無礙之問問無礙之答無礙之答答無礙之問問答皆無礙故華不著身也至大弟子即無礙之問著而不墮即有礙之答無礙之問有礙之答答不成答故云華不去也一切弟子神力去華不能令去者此即意業通前天手散華身業問今大弟子神力去不去即意業通不通也所以去不去者此是無礙之華故有礙之心去之不去無礙華無礙心華即不著有礙心故華即便著有礙心非但無礙著有礙亦著無礙心非但無礙不著有礙亦不著心有礙無礙有礙皆著無礙皆不著也。",
        "from": "X19n0343_004:0217a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時天問舍利弗何故去華答曰此華不如法是以去之天曰勿謂此華為不如法所以者何是華無所分別仁者自生分別想耳若於佛法出家有所分別為不如法若無所分別是則如法觀諸菩薩華不著者已斷一切分別想故譬如人畏時非人得其便如是弟子畏生死故色聲香味觸得其便也已離畏者一切五欲無能為也結習未盡華著身耳結習盡者華不著也。",
        "from": "X19n0343_004:0217b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時天問何故去華即口論義身子聲聞中第一是故問身子何故去華也身子答此華不如法故去之也言不如法者華本俗人所[托-七+巫]非[戒-廾+((巨-匚)/八)]律之法非沙門之法故云不如法又言不如法者不如華法華法去之即去今去不去此非華法故云不如法也天曰勿謂此華不如法身子謂華不如法天女今答勿謂華不如法乃是舍利弗不如法何者華無心言如法不如法仁者謂如法不如法故如法不如法在身子也若於佛法出家有所分別不如法者第二節明若分別如法不如法皆不如法若不分別如法不如法皆如法舍利弗分別如法不如法不如法皆在舍利弗菩薩不分別如法不如法如法皆菩薩也譬如人畏不舉譬曉華著不著前譬後合今即譬言人畏時非人得便者什師云外國有羅剎變為馬有人騎之羅剎及頭語云馬好不此人即拔刀云刀好不此人若畏羅剎即得其便以不畏故羅剎無如之何也如是弟子畏生死故下第二合譬有二前明聲聞畏生死故華著身菩薩不畏生死故不著也次云聲聞結習未盡故華著身菩薩結習盡故華不著身也然此語難解大論云若菩薩斷習得佛時更斷何物然大論有兩說一小乘人說菩薩未斷一豪煩惱大乘說菩薩得無生斷煩惱習盡論有雙彈此二解今當如實說明菩薩斷煩惱盡未斷習若使如此今云何言菩薩斷習耶什師有二解一云聲聞菩薩皆有習但聲聞有習即起菩薩有習習不起以起故言有不起故言無心起不起故言有不有非是斷不斷故言有不有也說解云聲聞有三界習菩薩無三界內習有念佛功德習大論言有習者有念佛功德習此言無習無三界習故經論各有其意無相違也。",
        "from": "X19n0343_004:0217b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言天止此室其已久如答曰我止此室如耆年解脫舍利弗言止此久耶天曰耆年解脫亦何如久舍利弗默然不答。",
        "from": "X19n0343_004:0218a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言天止此室其已久如有此文來者可有二意一者歎故問何者上天女神力屈身子神力言辨屈身子言辨此即內有無依之慧外有無礙之辨必久殖三多處室應久是故問云止此室久如如即正問止久近也二者驚怪故問何者天女有如此神力辨才內有無依之慧外有無礙之辨不應復受女人之身為此義故所以問云止此室其已久如也答曰我止此室如耆年解脫者上身子作久近問今天女破久近故今答云我止此室如汝所證無為解脫詺身子為耆年六十為耆年身子爾時亦老也外書云六十耆指使不復自伇云耆年也解脫者然解脫有二種一有為二無為有為解脫者五分法身解脫故數偈云前及一切法是皆五陰攝前即是色陰餘四法身即行陰五陰皆是有為故五分法身解脫皆為也無為者數滅涅槃即無為解脫今此問是無為解脫也舍利弗言止此久耶者上天女云我止此室如汝所證無為舍利弗言若爾天止此室久矣何以故無始已來本有此無為解脫故肇師云超群有以幽深量大虗以永久隨之弗得其縱迎之罔眺其首故知解脫來久解脫既久天止此室亦久故云止此久耶也天曰耆年解脫亦如久者即責解脫久近明數滅無為解脫即無生無滅無始無終無久無近云何無為解脫久耶若有久近即來去生滅而不爾所以今責解脫亦何如久也舍利弗嘿然不答者有二意一者進退不答若答言無久近乃順解脫即違言失若言有久近不違前言即傷解脫言違前言者前天女云如耆年解脫身子領云止此久耶明解脫是久今若言無久近即違言若言有久近即永解脫所以嘿然不知所云也二者身子既利根聞此一責玄悟解脫無久近無不久近是故嘿然也然嘿有三品下中上下嘿即是凡夫不知法相故嘿然中嘿者即是身子知道無言恐言傷道故嘿然上嘿然者即是淨名知道無言言不乖道故嘿今身子知解脫出無言說恐言說傷解脫故嘿然也。",
        "from": "X19n0343_004:0218a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "天曰如何耆舊大智而默答曰解脫者無所言說故吾於是不知所云天曰言說文字皆解脫相所以者何解脫者不內不外不在兩間文字亦不內不外不在兩間是故舍利弗無離文字說解脫也所以者何一切諸法是解脫相。",
        "from": "X19n0343_004:0218b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "天曰如何耆舊大智而嘿前來責語非語明聲聞不能聖說法今即責嘿非嘿明聲聞不能聖嘿然上生不得今死不得若生若死若語若嘿皆悉不成是故今責何故大智而嘿也答曰解脫無所言說者身子順解脫而答明解脫無有言說是故嘿然也天曰言說文字皆解脫相者明身子見一不見二只知解脫無言說不知言說即解脫故言解脫出言說之水如犢子之我由來真諦地論棃耶出四句外身子亦爾唯知解脫絕四句不知四句即解脫故云文字皆解脫相也所以者何釋文字即解脫如文所以者何一切諸法是解脫相者重釋明一切皆解脫相既云一切法皆解脫相文字一法豈非解脫耶二者只一切法是解脫解脫是一切法也。",
        "from": "X19n0343_004:0218c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言不復以離婬怒癡為解脫乎天曰佛為增上慢人說離婬怒癡為解脫耳若無增上慢者佛說婬怒癡性即是解脫。",
        "from": "X19n0343_004:0218c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言不復以離三毒為解脫乎舍利弗及難天女若使一切法即解脫者三毒亦是一切法三毒亦是解脫佛說離三毒為解脫若爾應離文字諸法為解脫故作此問也天曰佛為增上慢人說離三毒為解脫耳然身子至此凡四節屈第一華屈第二語屈第三嘿屈語嘿即立屈今此即引佛語屈若語若嘿若引皆悉不成也言此是引佛語者身子云佛說離三毒為解脫汝云何言一切諸法皆解脫耶故今天答佛為增上慢人說離三毒為解脫耳何者增上慢人未斷謂斷未得謂得未斷煩惱謂得解脫佛為此人說斷煩惱盡乃得解脫若為深行大士說三毒即解脫故無行云婬欲即是道恚癡亦復然如是三法中無量諸佛道如來所說各有其意云何作定解耶故云佛為增上慢人離三毒為解脫耳若無增上慢三毒即解脫也。",
        "from": "X19n0343_004:0219a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言善哉善哉天女汝何所得以何為證辯乃如是天曰我無得無證故辨如是所以者何若有得有證者則於佛法為增上慢。",
        "from": "X19n0343_004:0219a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言善哉善哉者身子自知下劣高讓菩薩是故稱歎踰楊善哉善哉也身子問汝何得何證辯乃如是身子既屈天女之辯故今問辯也曰我無得無證辨乃如是彈其稱歎明聲聞語嘿非語嘿自謙稱歎非稱歎聲聞都無一切法何但聲聞無一切法亦都無有聲聞故法華云十方佛土無有二乘也問何者為得何者為證解云得有為為得證無為為證亦得道諦為得證滅諦為證聲聞有得有證即有所得有所得即外有所依內即有礙菩薩無得無證即無所得無所得故外無所依內無礙故大經云有所得者無四無礙無所得者有四無礙故今答云無得無證辨乃如是也然言無得無證非是無得故無得無證今明乃得無所得證無所證故云無得無證諸法無得無證而言有得有證即增上慢人也。",
        "from": "X19n0343_004:0219a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗問天汝於三乘為何志求天曰以聲聞法化眾生故我為聲聞以因緣法化眾生故我為辟支佛以大悲法化眾生故我為大乘。",
        "from": "X19n0343_004:0219b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗問天女於三乘為何志求者上天女言我無得無證故辯如是身子今更重問汝於三乘為何志求佛法不出三乘故作問也天曰聲聞法化下天女答明我懷抱非三非一非大非小不應問大小三一也。",
        "from": "X19n0343_004:0219b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗如人入瞻蔔林唯齅瞻蔔不齅餘香如是若入此室但聞佛功德之香不樂聞聲聞辟支佛功德香也舍利弗其有釋梵四天王諸天龍鬼神等入此室者聞斯上人講說正法皆樂佛功德之香發心而出舍利弗吾止此室十有二年初不聞說聲聞辟支佛法但聞菩薩大慈大悲不可思議諸佛之法。",
        "from": "X19n0343_004:0219b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗如人入瞻蔔林唯嗅瞻蔔者上明無三無一無大無小便作無解是故今明雖無大無小而無失大小故云入瞻蔔林唯嗅瞻蔔也合譬如文舍利弗吾止此室十有二年者上彈其久近明無久近便謂無久近是故今明雖無久近不失久近所以今云吾止此室十有二年也何故的言十二年解云十二年是一紀之數如肇師云在什公門下十有餘年然在門什公實不得十二年而云十二年亦存其一紀數耳莊子外篇老子問孔丘云吾聞子北方之賢者亦得道乎答未得也又問惡乎求之彼答曰吾求之陰陽十有二年而未得也。",
        "from": "X19n0343_004:0219c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗此室常現八未曾有難得之法何等為八此室常以金色光照晝夜無異不以日月所照為明是為一未曾有難得之法此室入者不為諸垢之所惱也是為二未曾有難得之法。",
        "from": "X19n0343_004:0219c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此室常有釋梵四天王他方菩薩來會不絕是為三未曾有難得之法此室常說六波羅蜜不退轉法是為四未曾有難得之法。",
        "from": "X19n0343_004:0219c15_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此室常作天人第一之樂絃出無量法化之聲是為五未曾有難得之法此室有四大藏眾寶積滿周窮濟乏求得無盡是為六未曾有難得之法。",
        "from": "X19n0343_004:0219c18_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此室釋迦牟尼佛阿彌陀佛阿閦佛寶德寶燄寶月寶嚴難勝師子響一切利成如是等十方無量諸佛是上人念時即皆為來廣說諸佛祕要法藏說已還去是為七未曾有難得之法此室一切諸天嚴飾宮殿諸佛淨土皆於中現是為八未曾有難得之法舍利弗此室常現八未曾有難得之法。",
        "from": "X19n0343_004:0219c20_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "誰有見斯不思議事而復樂於聲聞法乎。",
        "from": "X19n0343_004:0220a02_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗此室常現八未曾有難得之法者此明淨名依果正果即以無生玅慧依果即以無漏淨業所起此中八未曾有束為四雙相對今即第一此室常以金色光明不俟日月火珠燈明二者不為諸垢所惱此即內外一雙外有光明內無煩惱也此室常有釋梵四天他方菩薩此明勝緣此室常說六波羅蜜此明玅教即緣教一雙此室常作第一之樂出無量法化此明法無盡此室有四大藏此明財無盡即財法無盡一雙此室釋迦等佛此明正果此室一切諸天嚴餝此明依果依正一雙所以此室一切諸天宮殿諸佛淨土於中現者什師云方寸金剛能見數里金剛有漏顛倒業所起尚爾豈況菩薩無漏淨業而不能耶誰有見斯而復樂聲聞者明二乘乞食尚不得豈當不樂此耶。",
        "from": "X19n0343_004:0220a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言汝何以不轉女身天曰我從十二年來求女人相了不可得當何所轉譬如幻師化作幻女若有人問何以不轉女身是人為正問不舍利弗言不也幻無定相當何所轉天曰一切諸法亦復如是無有定相云何乃問不轉女身。",
        "from": "X19n0343_004:0220a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗言汝何以不轉女身第三復身論義第一本身論義竟今即第二轉身論義者女身論義為三第一女本身論義第二轉身論義轉身論者轉身而論故云轉身而論二者轉身即是論義云轉身而論義也前身子問所以問者身子語亦不得嘿亦不得故前云如何耆舊大智而嘿既不得嘿所以發言問何以不轉女身也二者所以問何以不轉女身者驚恠故問何者有無礙之辨即有無礙之身有礙之身即有礙辨好體應爾而今女是有礙身有無礙辨何者夫男女穢質即是有礙身而就穢中復有礙無礙男即無礙女即有礙故女有三監五礙今天女是女身即有礙身為是故所以問云何以不轉女身也天曰我從十二年來求女相了不可得前身子問何不轉女身今天女答曰求女相了不可得竟何轉耶然身子兩節迷一謂有女復令女轉身今天女破其根本求女尚不可得何所轉也言十二年求女相不得者可有二義一者就淨名室為論天女既在淨名室十有二年淨名如行而說天女如說而行淨名如行說說無男女天女如說而行行無男女為此故所以云十二年求女相不可得也二者一日求女相不可得乃至十日十二年求女不可得乃是畢竟不可得故大品云諸佛恒沙壽求眾生相不可得為此義故故云十二年求女相不可得也譬如幻師化作下次舉譬曉如文所以舉喻者一即明女身如幻女二者釋疑疑云今現女身云何言無為是故今舉幻喻亦見幻女了幻女應有幻女既不有故女身亦不有也次問身子幻師作幻女而問何不轉是正問不身子答不也者明身子作此問是耶問故聲聞是耶問答是耶答菩薩問問答皆正也言幻無定相當何轉者身子度節悟幻尚無女竟何所轉如大品常啼問法尚水從何海來去至何所常啼逈悟尚無水云何言其來去今亦爾幻尚無女相云何轉女耶天曰一切諸法亦復如是者欲廣類萬法明非但女身如此諸法亦然也。",
        "from": "X19n0343_004:0220a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即時天女以神通力變舍利弗令如天女天自化身如舍利弗而問言何以不轉女身舍利弗以天女像而答言我今不知何轉而變為女身天曰舍利弗若能轉此女身則一切女人亦當能轉如舍利弗非女而現女身一切女人亦復如是雖現女身而非女也是故佛說一切諸法非男非女。",
        "from": "X19n0343_004:0220c10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即時天女以神力變舍利弗身者成無礙辨故轉既有無礙之辨故有無礙之身也二者成幻化之言上雖有幻化之言未有幻化之事搆之虗言未若驗之以實為此故明非但幻化之言亦有幻化之事明男女不定男女菩薩不定菩薩聲聞不定聲聞為是此故轉女身也又所以轉身者欲生種種論前本身論今轉身論故轉女為身子變身子為女以變女為男女不定女女身如幻轉男為女男不定男男身如幻男女既然萬法亦爾為是故轉女身為身子而問何不轉女也身子以天女像答不知何轉而變為女此非是非女為女實無女可轉故云不知何轉也什師直云就理而答竟無女身何所言轉故云不知何轉也天曰舍利弗若能轉此女身一切女人亦當能轉者明身子形雖是女實非女一切女亦爾形雖是女實無有女既不能轉舍利弗形雖是女實無有女亦不能轉舍利弗女形無女而能轉者一切女形無女亦應能轉故云若能轉此女身即一切女亦能轉也是故佛說一切法非男非女者良由大聖有於斯教我稟此教而悟我如是也。",
        "from": "X19n0343_004:0220c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即時天女還攝神力舍利弗身還復如故天問舍利弗女身色相今何所在舍利弗言女身色相無在無不在天曰一切諸法亦復如是無在無不在夫無在無不在者佛所說也。",
        "from": "X19n0343_004:0221a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即時天女還攝神力身子復如故下第三復身論義復身子身問女身何所在也身子答女身無在無不在者好體唯一無一有應云女身無在云何雙無耶解云此有二意一者身子領悟竪入何者明本有女在故有不在既無女在云何不在故無在無不在乃至四句皆淨畢竟清徹也二者明了無女論何物在今亦爾了無女論何物在不在也天曰一切諸法亦復如是者明非但女身無在無不在一切法亦復如是向女今男向女不在今女亦不在向凡今聖向凡不在今凡不在故萬法亦如是然此中唯彈兩句者明佛世根利故也。",
        "from": "X19n0343_004:0221a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗問天汝於此沒當生何所天曰佛化所生吾如彼生曰佛化所生非沒生也天曰眾生猶然無沒生也舍利弗問天汝久如當得阿耨多羅三藐三菩提天曰如舍利弗還為凡夫我乃當成阿耨多羅三藐三菩提舍利弗言我作凡夫無有是處天曰我得阿耨多羅三藐三菩提亦無是處所以者何菩提無住處是故無有得者舍利弗言今諸佛得阿耨多羅三藐三菩提已得當得如恒河沙皆謂何乎天曰皆以世俗文字數故說有三世非謂菩提有去來今天曰舍利弗汝得阿羅漢道耶曰無所得故而得天曰諸佛菩薩亦復如是無所得故而得。",
        "from": "X19n0343_004:0221b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利弗問天汝於此沒當生何所有此文來者上論男女明無男女今論生死辨無生死所以身子問者身子既見天女有如此神變辨才故問汝於沒當生何處也天曰佛化所生吾如彼生也舍利弗問天汝久如當得菩提者上明不離生死無有生死今明不得菩提無有菩提身子問者上天女既引佛化生必應鄰佛證菩提必當不久故問得菩提也天曰答如文。",
        "from": "X19n0343_004:0221b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時維摩詰語舍利弗是天女已曾供養九十二億諸佛已能遊戲菩薩神通所願具足得無生忍住不退轉以本願故隨意能現教化眾生。",
        "from": "X19n0343_004:0221c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時維摩詰語舍利弗下第三淨名拂天女迹所以拂者上身子與天女種種論義門門致屈身子羞於大眾身子是如來右面弟子智慧第一云何辨不及於小女為此義故拂迹明此女是無生大士法身菩薩受屈大人何足為恥耶二者時□見天女內有無礙辨外有無礙之身未知是何地位之人是故今顯是無生大士不退轉人本願之力為化眾生故託斯賢也。",
        "from": "X19n0343_004:0221c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛道品第八",
        "from": "X19n0343_004:0221c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛道品第八然此品名不易可聞六道之中唯人道中多聞此名雖然對餘道言中多聞實論聞復無幾所以大品三慧中云若得聞佛名畢苦其福不盡故聞此名不可思議也所以有此品來者有二義一者此經明菩薩行菩薩行者下化眾生上求佛道下化眾生應須識眾生識眾生故能度眾生若不識眾生何能度眾生上來佛道應須識佛道若不識佛道何能求佛道為是故前觀眾生今論佛道然此雖有二章更無兩路何者只為求佛道故度眾生度眾生者只為安置佛道是故雖有二還成一也二者近從天女章生明無生法身菩薩此是體道之人寄迹穢形為弘正道此是一方便今明非但有此一種方便體道之人有無量方便或行無間乍入酒舍絓一切事皆為通達佛道為是故有今品來也。",
        "from": "X19n0343_004:0221c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時文殊師利問維摩詰言菩薩云何通達佛道維摩詰言若菩薩行於非道是為通達佛道。",
        "from": "X19n0343_004:0222a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "品有時開為三第一論佛道第二論佛種第三明眷屬今且開為二第一體道作違方便第二體道作順方便此之違順約緣故有違順菩薩體之皆順何以知然於菩薩皆利緣顯道故皆順也就初為二第一論佛道第二論佛種今即第一論佛道言行非道通達佛道者今且責何意作此語故大師答難凡引經者皆責其原由悉須得其根本今此言有何意而作此語耶解云體悟不體悟為論以不達者有道有非道異體達之者道非道未曾二只行非道即是道也問若爾達者道非道皆道可爾不達者道非道悉非道不解云如是以道心故非但行道是道行非道亦道故大品云不見產業無非般若者以般若心作一切行一切行皆般若非道心行一切行一切皆非道顛倒心作一切一切皆顛倒故思益云一切法正一切法耶也問菩薩既體道非道皆是道若爾只道為道云何言非道為道耶解云於菩薩併道今言非道為道者三毒五逆於凡夫二乘謂言非道菩薩了凡夫二乘非道者為道故云通達非道為道也問凡夫二乘道非道皆非道若爾只應云非道為非道云何言道為非道耶解云此義亦如前於菩薩道為其是非道也問菩薩道非道皆是道可得菩薩道非道皆非道不解云得只非道為道只道為非道總道非道皆是束非道道悉非也問若爾眾生道非道悉非道可道非道皆是道不解云亦得於其悉是道道於其是道非道於其亦是道也難菩薩道非道皆道可方便無方便皆方便不解云斯義有例非例何者道非道皆道此是菩薩方便故爾眾生道非道皆非眾生無方便故爾無方便故是非悉非有方便故是非皆是也而例者詺道為方便非道為無方便斯言即例也。",
        "from": "X19n0343_004:0222a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又問云何菩薩行於非道答曰若菩薩行五無間而無惱恚至於地獄無諸罪垢至於畜生無有無明憍慢等過至於餓鬼而具足功德行色無色界道不以為勝示行貪欲離諸染著示行瞋恚於諸眾生無有恚礙示行愚癡而以智慧調伏其心示行慳貪而捨內外所有不惜身命示行毀禁而安住淨戒乃至小罪猶懷大懼示行瞋恚而常慈忍示行懈怠而勤修功德示行亂意而常念定示行愚癡而通達世間出世間慧示行謟偽而善方便隨諸經義示行憍慢而於眾生猶如橋梁示行諸煩惱而心常清淨示入於魔而順佛智慧不隨他教示入聲聞而為眾生說未聞法示入辟支佛而成就大悲教化眾生示入貧窮而有寶手功德無盡示入形殘而具諸好相以自莊嚴示入下賤而生佛種性中具諸功德示入羸劣醜陋而得那羅延身一切眾生之所樂見示入老病而永斷病根超越死畏示有資生而恒觀無常實無所貪示有妻妾綵女而常遠離五欲淤泥現於訥鈍而成就辯才總持無失示入邪濟而以正濟度諸眾生現徧入諸道而斷其因緣現於涅槃而不斷生死文殊師利菩薩能如是行於非道是為通達佛道。",
        "from": "X19n0343_004:0222b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又問云何菩薩行於非道者上既云行非道為道何者是非道故問於非道也答若菩薩行五無間而無惱恚者只行五無間非道即為佛道何以故菩薩以道心行五無間故五無間是道眾生顛倒心行道道成五無間又菩薩道心行道故具是道菩薩心行五無間五無間亦是道眾生顛倒心行五無間故是五無間顛倒心行道亦是五無間何者顛倒心行道即傷道傷道即傷法身罪過五逆何者五無間只害五陰身故云云又只道是三寶道是父母汝既破道即破三寶破父母具如大品所明以是故云菩薩行無間即為道眾生行道即無間也餘一切類爾示入羸劣醜陋而得那羅延身者故上云非但一女人穢質為佛道明一切醜陋[邱-丘+酋]劣皆為佛道也那羅延身者此天中力士端正而猛健猛健對羸劣端正故對醜陋故云示入羸劣醜陋而得那羅延身。",
        "from": "X19n0343_004:0222c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "○於是維摩問文殊何等為如來種下第二論佛種問此論佛種與上論佛道何異解云有例不例言其例者將前例後將後例前將前例後者前云菩薩通達非道為道今亦得云菩薩通達非種為種今云發心者是佛種亦得云發心者是佛道不發心者非佛道此義即例言不例者即體悟非道為道今即明佛種為佛種非佛種不為佛種何者此就文為論上即始終淺深為論今即就終始深淺為言上就深行菩薩有方便能體一切非道以為佛道今就淺行未有方便不能體非種為種正開種非種為二明凡夫為佛種二乘非佛種二乘之人斷煩惱盡住於涅槃煩惱糠已脫不復能生菩提心牙故非種若是凡夫未斷煩惱證涅槃煩惱糠未脫故能生菩提心牙故為種為是故二章為異也問此中何意明凡夫為種二乘非種耶若使此中明非種法華不應授記作佛南北有二解北云有五宗四宗不同深淺為異故此經明非種法華授其記作佛南人云有四時五時有別亦深淺不同以此經淺故挫二乘非種法華深故明二乘作佛今明不然何必明作佛不作佛而判經之深淺耶若使此經挫二乘判言此經淺法華者華嚴挫二乘華嚴應淺華嚴於汝是頓教深此經此經是漸淺既有漸頓異應有挫不挫異同挫二乘同應是淺言華嚴挫者彼文云如藥樹王不於二處生一者不火坑生二者不深水生佛種亦爾一者不於一闡提中生二者不於二乘心中生如是故二經皆挫二乘也今所明者非是此經不明作佛為淺法華明作佛為深此二經實齊而不同者與奪適時遂緣何定應須與即與宜聞奪即奪也問為何物緣而奪為何物緣而與耶且解云為奪緣故奪為與緣故與也又責何物是奪緣何物是與緣耶解云奪即令二乘人慕於大道明二乘不及凡夫凡夫有及復二乘即無也與則接二乘二乘聞不及凡夫永絕其根為是故汝併應成佛何得永絕不復修行耶為是故二經與奪隨宜非謂有深淺也。",
        "from": "X19n0343_004:0223a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於是維摩詰問文殊師利何等為如來種文殊師利言有身為種無明有愛為種貪恚癡為種四顛倒為種五蓋為種六入為種七識處為種八邪法為種九惱處為種十不善道為種以要言之六十二見及一切煩惱皆是佛種曰何謂也答曰若見無為入正位者不能復發阿耨多羅三藐三菩提心譬如高原陸地不生蓮華卑濕淤泥乃生此華如是見無為法入正位者終不復能生於佛法煩惱泥中乃有眾生起佛法耳又如植種於空終不能生糞壤之地乃能滋茂如是入無為正位者不生佛法起於我見如須彌山猶能發於阿耨多羅三藐三菩提心生佛法矣是故當知一切煩惱為如來種譬如不下巨海不能得無價寶珠如是不入煩惱大海則不能得一切智寶。",
        "from": "X19n0343_004:0223b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "然文即文殊為主居士為賓前來即淨名為主玅德為賓所以爾者明二人德齊[牙-(必-心)+?]為賓主具二莊嚴也問若爾一一品中應二人互為賓主解云不得何者此經初來為顯居士為主如來命之為賓故文殊為賓多居士為賓少也此中增數明義如文言七識處為種者七識有二種一者七識界六識并意根為七識也二者七識住欲界人天為一三禪為三三空為三合為七識也問何故欲四趣非住色界第四禪非住無色非想非住耶解云四趣非住者四趣苦識不樂住第四禪無想天無心識故識不樂住非想滅定滅心識故識不樂住也八耶九惱可知云云。",
        "from": "X19n0343_004:0223c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時大迦葉歎言善哉善哉文殊師利快說此語誠如所言塵勞之儔為如來種我等今者不復堪任發阿耨多羅三藐三菩提心乃至五無間罪猶能發意生於佛法而今我等永不能發譬如根敗之士其於五欲不能復利如是聲聞諸結斷者於佛法中無所復益永不志願是故文殊師利凡夫於佛法有反復而聲聞無也所以者何凡夫聞佛法能起無上道心不斷三寶正使聲聞終身聞佛法力無畏等永不能發無上道意。",
        "from": "X19n0343_004:0224a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又云聲聞終身聞此法不能發心者斯言亦是難解何者既云終身不能發心法華何意授記耶解云此是一時平奪耳舉譬如罵小兒小兒作一事不成即罵云至老不成未必長不成乃一時呵令悟耳問何意迦葉自述不能發菩提耶解云若使文殊居士自說聲聞不信以迦葉是大羅漢自陳不能故一切皆信也。",
        "from": "X19n0343_004:0224a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時會中有菩薩名普現色身問維摩詰言居士父母妻子親戚眷屬吏民知識悉為是誰奴婢僮僕象馬車乘皆何所在。",
        "from": "X19n0343_004:0224a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時會中有菩薩下品為二第一明違方便意今第二明順有此文來者遠從上空室生止空室無一切物及以眷屬象馬等悉無是故今問也然居士所以空室無眷屬者復是一種方便何者眾生所見不同世間耳目之徒見菩薩同其有父母有妻子等便謂菩薩實有父母妻子眷屬而菩薩同眾生欲令眾生同菩薩故菩薩同眾生有眷屬實遠離之眾生實謂菩薩有眷屬故普現問淨名廣答也。",
        "from": "X19n0343_004:0224a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於是維摩詰以偈答曰智度菩薩母方便以為父一切眾導師無不由是生。",
        "from": "X19n0343_004:0224b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "智度菩薩母者經論中釋父母不同一即福慧判父母大品不證品云六度父母論主釋云五度為父般若為母五度即福德門般若即知慧門二者定慧判父母般若為父母般舟三昧為父三者二慧判父母即是此文然佛有二種父母一法父母二人父母何意有二父母解云有二身一生身二法身既有二身故有二父母何者釋迦法身即二智為父母生身即淨飯摩耶為父母居士亦二法身即二智纂釋女為父母也佛菩薩有二父母眾生亦有二父母何者眾生以無明為父貪愛為母此是本父母由此本父母故有張王父母即末父母也今一切眾導師竝從知度方便生亦一切眾生竝從無明貪愛生也又且此生法二身父母異者若法身父母同生身即不同何意爾耶解云法身同故父母同生身不同故父母不同所以經云十方諸如來同共一法身故法身同生身或丈六千尺故生身不同也眾生亦爾一切眾生皆從無明貪愛生故是同而有張王萬姓故不同也問何意此中以實為母方便為父不以方便為母實為父耶解云及責何意貪愛為母無明為父不無明為母貪愛為父耶責云併疑解云通皆得而不爾者逐義顯現實慧靜照當能生義方便教喻如令遊空不滯涉有不著當能教義能生匹母能教配父眾生亦爾貪愛故生由無明使起愛也又實慧內鑒而靜方便外用而動世間父母配於天地天動而陽地靜而陰故云六龍駇天天無蹔靜一馬行地乍有蹔動天終動地終靜也今二慧亦爾以擁變動動與陽齊匹於天實性凝靜靜與陰同故配於地也一切眾道師者上明能生父母竟今明所生之子息問若為言二智生佛耶今只用二智為佛何處離二智有佛而言二智能生耶解云就義如此世間父母為能生子為所生今二智實不異佛但於義開二以二智為法佛為人法為能生人為所生又因果判二智是因佛是果因為能生果為所生然此可有三種一者因有人法法能成人所成果中亦爾二者因能生果所生也問何因得此二智云何方法生以而言如此耶解云從來云佛二智說二諦既二智說二諦只以知為諦眾生稟二諦生二智即此二諦教為父母故大品云般若為佛母也方便或父或師大品云漚和抅舍大師方便力也。",
        "from": "X19n0343_004:0224b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法喜以為妻慈悲心為女善心誠實男畢竟空寂舍。",
        "from": "X19n0343_004:0225a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法憙以為妻者前明父母竟今明妻子妻亦有二今即法喜為妻世間以妻為憙今菩薩以法自娛故云法憙為妻此非但聞法為妻通三慧為法憙也慈悲心為女善心誠實為男者次明兒息亦有二今以慈心為女誠實為男者慈心外[女*高]故匹為女實心處內故配為男又慈心軟弱故為女實心幹用故為男也問慈是功德門誠實是智慧門何意禪女慧男也解云如觀音經云求男即智慧願女端正端正即福門也師子孔二嚴中明福嚴劣智慧嚴勝劣故為女勝故為男齊而不齊也畢竟空寂舍前明人竟今明於舍非是前有人後有舍但依正報故前後辨耳以正果正故前明依果傍故後辨舍亦有二前方丈為舍今以畢竟空為舍世間舍遮風霜防劫盜今畢竟空舍亦爾遮一切見防諸天魔也又世間栖止為舍菩薩止居畢竟空故喻之為舍也。",
        "from": "X19n0343_004:0225a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "弟子眾塵勞隨意之所轉道品善知識由是成正覺。",
        "from": "X19n0343_004:0225b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "弟子眾塵勞隨意之所轉者以三毒一切塵勞以為弟子隨意之所轉者三毒令不三毒如弟子弟子順從為義也道品善知識者前明自眷屬今明善知識善知識者示是道是非道故以道品為善知識大品云道品為涅槃近門示生死開涅槃也。",
        "from": "X19n0343_004:0225b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "諸度法等侶四攝為伎女歌詠誦法言以此為音樂。",
        "from": "X19n0343_004:0225b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "諸度法等侶者前明善識今明伴侶世間皆有伴侶今菩薩以諸度為伴侶此是第一真實伴侶住即俱住行即同行也所以言諸度為侶者度即從此岸到彼岸諸度既共菩薩即相隨去也諸度者明度有六有十八萬四千一切非一故云諸度也四攝為伎女者世間人集玅伎女自悅悅他今菩薩以四攝攝眾生自悅悅他問眾生可悅菩薩云何亦悅耶解只四攝攝眾生眾生受菩薩攝菩薩心即悅樂故也歌詠誦法言世間歌詠陽春白水玅曲美音今菩薩歌詠法言為音樂也故有法俗二樂亦是兩音也。",
        "from": "X19n0343_004:0225b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "總持之園苑無漏法林樹覺意淨玅華解脫智慧果。",
        "from": "X19n0343_004:0225b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "總持之薗菀者世間薗菀殖樹敷華結實今菩薩以陀羅尼為薗菀持一切惡不起持一切善不失以一切不失故七覺華敷結解脫實也既有薗菀即有林樹故次明無漏林樹也覺意者七覺此是卅七是之最勝前八正即見道七覺即修道解脫即無學八正為林樹七覺為華解脫為果具三道也解脫知慧果具為無為二果解脫即無為果知慧即有為果也問此是小乘何以解大乘耶解云大小具三道故也。",
        "from": "X19n0343_004:0225b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "八解之浴池定水湛然滿布以七淨華浴此無垢人。",
        "from": "X19n0343_004:0225c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "八解之俗池者前明薗菀薗菀中有池故今次明浴池八解即八解脫或云八背捨解脫下地故云解脫背捨下地故云背捨也以為浴池者池洗濯塵累解脫煩惱故喻之浴池也定水湛然滿者問八解脫攝定盡無有離八解別有定何故復明耶解云亦無離池有水只以水為池只已定為八解而今更說者就異義說耳洗濯無累為解脫具足湛滿為定水也布以七淨華者既有澄清美水復布淨玅之華七淨者一戒淨二心淨三見淨四度疑淨五道非道淨六行淨七斷淨以此七淨布於三道故云布也三道者見修及無學見諦道有五謂戒淨心心即定淨見淨即除身邊等見四度疑淨除疑也道非道淨即除戒取也修道中一淨謂行淨無學亦一謂斷淨也。",
        "from": "X19n0343_004:0225c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "象馬五通馳大乘以為車調御以一心遊於八正路相具以嚴容眾好飾其姿慚愧之上服深心為華鬘。",
        "from": "X19n0343_004:0226a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "象馬五通馳者五通為象大乘為車一心為御行八正路也相具以嚴容者相麤好細故相以嚴容好以餝姿也。",
        "from": "X19n0343_004:0226a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "富有七財寶教授以滋息如所說修行迴向為大利。",
        "from": "X19n0343_004:0226a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "富有七財寶者前明服餝竟今明財寶七財信[戒-廾+((巨-匚)/八)]聞慧捨慙愧可知也坂授以滋息者既有財物應須出入息利以此七財授與前人前人復授與人如是則財財不窮化化無絕四生有盡七財乃窮也如所說修行者既坂授財物應便行財也。",
        "from": "X19n0343_004:0226a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四禪為牀座從於淨命生多聞增智慧以為自覺音甘露法之食解脫味為漿淨心以澡浴戒品為塗香摧滅煩惱賊勇健無能踰降伏四種魔勝旛建道場。",
        "from": "X19n0343_004:0226a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四禪為牀坐者牀有二下離上安四禪亦爾離下諸結上發慧也多聞為覺音者世間貴人欲覺眼眠即奏音樂金菩薩入四禪用多聞智慧音覺之也甘露為之食解脫味為漿者甘露即涅槃涅槃為食解脫為漿也問涅槃只解脫云何說二解云為無為異無為為涅槃有為為解脫也。",
        "from": "X19n0343_004:0226a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "雖知無起滅示彼故有生悉現諸國土如日無不見。",
        "from": "X19n0343_004:0226a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "雖知無起滅者前來一段出世對世間辨今明出世超於世間世間無有斯事也上下半示生下半示生有益菩薩出世如日處天無不都見無不蒙益也。",
        "from": "X19n0343_004:0226b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "供養於十方無量億如來諸佛及己身無有分別想雖知諸佛國及與眾生空而常修淨土教化於羣生諸有眾生類形聲及威儀無畏力菩薩一時能盡現覺知眾魔事而示隨其行以善方便智隨意皆能現或示老病死成就諸羣生了知如幻化通達無有礙。",
        "from": "X19n0343_004:0226b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "雖知諸佛國及眾生空者雖知佛土空而修淨土雖知眾生空而常度眾生此即菩薩平等之觀從來云此是菩薩竝觀竝觀即空有竝善惡動靜竝空有即竪竝善惡等竝即橫竝此之空有不二無相妨礙故云竝觀問何地菩薩能如此竝耶他云八地菩薩竝觀師責若為竝耶為真俗二竝不二竝耶開善二諦一體竝責一云何言竝二物可論竝既其不二云何言竝耶故不可也龍光真俗二體故竝師云二竝者詺作鱉[白/卑]竝兩孔而竝左右不相關也又何意竝只為空有二故竝汝既二諦不相關云何言竝今言竝者即是不二之觀從初發心即修習此不二觀大經及華嚴皆有此文二心不別也問二心既不別云何初後解云初竝後竝云何不別舉喻如作佛初後皆佛而有初後殊也責何意須竝耶解云二見眾生故菩薩竝觀眾生常行二見菩薩為破此二明不二故經云愚者謂二知者了達無二此即對二明不二二去不二即淨也。",
        "from": "X19n0343_004:0226b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "或現劫盡燒天地皆洞然眾人有常想照令知無常無數億眾生俱來請菩薩一時到其舍化令向佛道經書禁呪術工巧諸技藝盡現行此事饒益諸羣生世間眾道法悉於中出家因以解人惑而不墮邪見或作日月天梵王世界主或時作地水或復作風火劫中有疾疫現作諸藥草若有服之者除病消眾毒劫中有饑饉現身作飲食先救彼饑渴却以法語人劫中有刀兵為之起慈悲化彼諸眾生令住無諍地若有大戰陣立之以等力菩薩現威勢降伏使和安一切國土中諸有地獄處輒往到於彼勉濟其苦惱一切國土中畜生相食噉皆現生於彼為之作利益示受於五欲示復現行禪令魔心憒亂不能得其便火中生蓮華是可謂希有在欲而行禪希有亦如是或現作淫女引諸好色者先以欲鉤牽後令入佛智或為邑中主或作商人導國師及大臣以祐利眾生諸有貧窮者現作無盡藏因以勸導之令發菩提心我心憍慢者為現大力士消伏諸貢高令住無上道其有恐懼眾居前而慰安先施以無畏後令發道心或現離婬欲為五通僊人開導諸羣生令住戒忍慈見須供事者現為作僮僕既悅可其意乃發以道心隨彼之所須得入於佛道以善方便力皆能給足之如是道無量所行無有涯智慧無邊際度脫無數眾假令一切佛於無數億劫讚歎其功德猶尚不能盡誰聞如是法不發菩提心除彼不肖人癡冥無智者。",
        "from": "X19n0343_004:0226c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三灾事義已如餘處廣辨問三灾中何物菩薩化眾生耶解云婆須密菩薩在此中化眾生此菩秿彌勒處釋道安云此菩薩係彌勒後也。",
        "from": "X19n0343_004:0227a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "維摩經疏第四",
        "from": "X19n0343_004:0227a15_0",
        "context_with_next_sentence": false
    }
]