[
    {
        "source_sentence": "毗盧遮那成佛神變加持經義釋卷第七沙門　一行　述記息障品第三息障品者謂淨除內外諸障種種魔事也佛已答金剛手所問緣漫荼羅眾支分竟金剛手更復諮問三事初問安立大悲胎藏時云何淨除一切諸障者及令諸修行人不為毗那也迦等之所惱害第二問云何持誦真言第三問云何成果今此品中正答初問餘二句於後品中答也就答第一問中初有二偈明真實義常當意思惟不動摩訶薩以下明祕密方便所謂真實義者言凡夫地中無量重障乃至十地菩薩諸微細障雖從緣差別種種不同然舉要言之無不由自心起今觀心之實相本不生故當知一切諸障亦本不生乃至心實相因不可得故當知一切諸障亦復因不可得作如是觀時無非大日如來金剛眷屬實不曾罣礙行人也。",
        "from": "X23n0438_007:0376c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次隨順昔慳恡者此因障起因緣若行者於過去世現在世慳恡財寶不以惠人或為諸修道人作種種留難則令魔事得便諸障難生今為淨除起障因故受持三世無障礙智戒捨身口意奉獻如來諸有所作隨此而轉即是真正菩提心念此菩提心時一切起障之因自然靜息也若作深祕釋者此三世無障礙智戒即是住無戲論金剛印纔念此金剛印時百非眾過殄滅無餘故云善除妄分別從心思所生憶念菩提心行者離諸過也 嗢 婆 嚩梵音正翻為有亦帶生聲故隨文便以心思有為心思所生次明祕密方便中常當意思惟不動摩訶薩而結彼密印能除諸障礙者不動明王是毗盧遮那成辦諸事智為欲普護一切菩提心遍摧一切大障故以畢竟無相之身示作如來使形以奉如來教敕故無能爼壞之者是故行者常當係念思惟若有種種諸難起時但持彼真言密印自然退散復次言不動明王者即是淨菩提心大日如來心王彼真言所謂悍 字門如來自在力風與大空三昧和合也彼密印相所謂如來大智慧刀也以此三事因緣能於種種法界門遍摧一切諸障是即普通對治門也。",
        "from": "X23n0438_007:0376c23_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云祕密主復聽繫除散亂風已下更明別別對治法若就世諦以阿闍棃或於露地建立悲生漫荼羅恐大風為障故說淨除之法當觀 阿字門遍於自體支分普作金剛不壞色此是加持我身而梵本云作無我者我是字輪之相以入 阿字門相我體本來不生即是真實相所以互文言之欲具含淺深二釋也如是自加持已復於漫荼羅隅角風方地上觀作訶 字門深玄之色以白檀塗香圖畫於上作七圖點漫荼羅其量各如彈丸用瓦甌葢之器上觀作暗字以此字門轉作金剛山王彈合三千大千世界一切須彌盧山合為一體以加其上不動持明王安住其上當數數作意觀之所以然者風是覺觀戲論能牽壞眾生心地大悲漫荼羅故先用金剛不動智加持自體以住無戲論塗香於覺觀風上作七覺大空漫荼羅闔以新瓦器者龍樹云禪定坏器未得智慧火燒時遇緣輒壞不可持久既燒之後則令心器完堅名曰 陀 羅 尼故須以此 陀 羅 尼器蓋之也 暗字是 阿字上更加空點以大空遍一切處故金剛不壞智亦復遍一切處以此為金剛座而用鎮之是故戲論皆滅也。",
        "from": "X23n0438_007:0377a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云大有情諦聽行者防駃雨已下明對治暴流駃水之障當思惟 囉字門色赤如火遍於身內猛燄從體中出周帀其外猶如鬘形即觀其身作大力不動明王執持慧刀威猛奮怒相其所起方面畫作雲龍以大慧刀印而斷壞之彼障即時消散所以然者如世人於空露地畫作漫荼羅時若遇惡龍降雨即便毀壞行者於心地中畫作大悲漫荼羅亦復如是若為三毒惡龍降暴雨流駃水令不思議染色湮滅漂淪故用無垢智身作不動明王威猛大勢以大慧刀印斷壞蔭雲則隨所向方無不清廓也   枳(引)羅劒是金剛橛首如一股金剛而下體銛銳猶如橛形若更細小即名金剛針其相各異阿闍棃建立漫荼羅時或以勇健菩提心依金剛橛方便以息風雨當用佉陀羅木若無者當用苦練木乃至鑌鐵為之用成辦諸事金剛薩埵加持當觀自身即同一切金剛以釘障起方面則令道場地分一切皆同金剛是故諸障無能嬈害。",
        "from": "X23n0438_007:0377b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云復次今當說已下更明息一切障方便謂真言者當觀威猛大勢不動明王住本漫荼羅位中即是三角漫荼羅周帀熾燄其中微黑者是也此有二種或觀聖不動尊住本位中以三昧足蹈彼頂上或觀自身即是不動尊亦住本位中以三昧足加彼頂上臨以忿怒之威隨彼彼諸為障者即當退散若固爾不從教命不速去者必當自斷其命是持真言者當生慈心勿令彼命根斷絕也所以然者如是淨菩提心不動明王殺害諸眾生業煩惱壽命時即須生彼法性真常之命故龍樹以為若諸佛令修行者必定墮於灰斷涅槃者便有殺眾生罪故不應如文堅住而失如來密意瑜伽金剛頂經說世尊初成正覺於金剛界漫荼羅攝召三千世界普門大眾時有    摩醯首羅天王即是三千大千世界主住於諸世界最中色欲二界之間者以慢心故不肎從命而作是言我是三界之主更有何等世尊而召我耶復作是念彼持呪者怖諸觸穢我今化作種種不淨之物圍遶宮城之表而住其中彼之法術何所能為不動明王承佛教敕見彼作如是事即命受觸金剛舊譯所謂不淨金剛令彼取之爾時受觸金剛須臾吞滅如是諸穢時至佛所時摩醯首羅猶作是言爾等皆藥叉之類而我為諸天主何能受汝教命耶尋即迯歸乃至七返於是不動明王白佛言世尊此有情故犯三世諸佛三昧耶法當以何法治之佛言可斷其命時不動明王以左足蹈彼頂上寶冠半月中右足蹈彼妃首冠半月中爾時摩醯首羅尋即命絕即於悶絕之中證無量甚深三昧得無生記於灰欲世界成正等覺號為月勝如來然此皆是密語所謂吞滅一切穢者即是堪忍五濁煩惱垢污不為彼等所染而能悉噉食之言足蹈者足名鉢曇即是金剛句義斷彼命者即是一百六十心等悉皆永寂無生是故現授大菩提記時彼一切天神未入祕藏者皆生怖畏言如是最大天王主以不順諸佛三昧耶故自取命絕我等云何不復敬畏即時往詣漫荼羅大會隨彼相應法門而入真言行法不動明王復白佛言世尊此大自在天當更云何佛言汝可起之不動明王即說法界生真言摩醯首羅得蘇息到無畏處心大歡喜而白佛言世尊是事甚希有也佛初召我名時我即問佛此諸夜叉是何等類佛言是諸佛之主我不解故而作是念若如來是一切中尊云何更有主耶而今乃自證知由此大力菩提心王故令我現前授記作佛法王所說誠不虗也然此中深釋者三千大千世界主即是無始無明於一切生死中而得自在唯此菩提心明王能制伏之乃至殺彼無常之身令得常命餘以類推之可解也   囉爾迦此云芥子其味辛辣是降伏相應性類彼微妙是諸毒藥當作障礙者形像而用塗之以如是治故彼六情根猶如火燒即時退散此是真言幻相法爾勸諸行人勿生疑惑心也此中密意者辛毒之藥即是無常苦空無我等苦切對治譬如病氣深入必瞑眩治之乃可盡其源本乃至帝釋梵王等自在安樂為世界之尊如來以此法治之即悟心身熾然猶如火宅厭怖生死正順涅槃何況諸餘有情耶。",
        "from": "X23n0438_007:0377c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云爾時金剛手白佛言世尊如我解佛所說義已下是領解佛說偈中住本漫荼羅位句故云我亦如是知諸聖尊住本漫荼羅位令有威神由彼如是住故如來教敕無能隱蔽也本尊之位略有四種阿字地輪黃色而方嚩字水輪色白而圓囉字火輪色赤三角形賀字風輪色黑半月形更有佉字虗空輪無有定相具種種色皆是如來祕密方便若圖畫觀想本尊隨相應事而住此位中者皆令威神顯著諸障盡息令如來正三昧耶種種教勅一切無能隱蔽之者上文但舉不動尊一法令祕密主觸類申而長之遍於一切法中以故名為善知三密也次即引佛為證故云何以故世尊即一切諸真言三昧耶所謂住於自種性故譬如轉輪聖王若住於自種性中遵修上代轉治世之法無所增減則四域之內自然恭順其命世尊亦爾以常安住如來種性之中無所違越故一切諸真言主無不法而行之以為性平等戒而不敢犯復次如剎利婆羅門等四姓若住於自種性中奉其家法則為世人稱譽事有成功今此本漫荼羅亦爾平等無動是金剛地性本無生性寂靜圓滿是大悲水性離言說性鋒銳照明是大慧火性離塵垢性卷舒成壞是自在風性離因緣性無相之像是不可得空大空本性如是本性三世諸佛尚不能作之何況諸為障者而能蔽之是故真言門修菩薩行諸菩薩亦當紹如來種性放効諸尊住本漫荼羅位作諸事業也如欲作寂災事業即當自作本尊身而住圓漫荼羅若作增益事業即住方漫荼羅若作降伏事業即住三角漫荼羅欲作攝召事業即住半月漫荼羅若欲出生種種莊嚴即住雜色漫荼羅能令行者威驗即同本尊一切為障者無能映奪也已上是金剛手所說是故世尊印可言如是祕密主如汝所說又祕密主若說諸色彼諸聖尊之漫荼羅位諸尊形相當知亦爾是則先佛所說者佛又推廣其義如經所說諸尊若云黃色者此是金剛色身也當在因陀羅方輪中若白色者此是清淨慈悲色當在圓壇中若赤色者此是威猛除障色當在三角中若黑色者此是劫火大風色當在半月中若青色者此是虗空不壞不可降伏色多是忿怒持明王等或在三角或在半月中如色及漫荼羅者當知形相亦爾若黃色者當作勝進法喜之容若白色者當作慈悲寂定之容若赤色者當作威猛精進之容若黑色者當作大力奮迅之容若青色者當作不可爼壞之容若黃白色者則兼增益威猛之容如是以類推之乃至種種間雜者亦當隨事甄明知其性分乃至十方三世諸佛一切祕密藏之中設不說者亦當通用此意以起相應之事業故引先佛為證明法爾道同非我出興于世獨作如是說也。",
        "from": "X23n0438_007:0378b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次復拂疑敦信兼明障起所由謂不入如是祕藏略由二事一者信根不具二者慧根不具以無信故不能受行以無慧故更增疑網故云祕密主於未來世劣慧無信眾生聞如是說不能信受以無慧故而增疑惑也然祕密方便旨趣難知如世間幻術靈藥履水昇空等不可以因量談議懸判是非唯是親經試驗者乃證知耳如人手執仙方不肯諮稟明師未曾和合服用而反誹謗曾登天者以為是虗誕之言是故經云彼唯如聞堅住而不修行自損損佗無有義利由是而言則知障由心造何關外物耶。",
        "from": "X23n0438_007:0379a17_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次世尊說從眾因緣生法遠離八不常如實相然不壞如是因緣故雖寂滅無相不妨種種不思議事彼劣慧眾生以不解十緣生句故不知二諦中密號故而作是說世尊常說諸法空無所得云何有如是有為有相之言當知是外道法非諸佛說故經云彼無智人當作如是信解也佛為重明此義復說偈言一切智世尊諸法得自在如其所通達方便度眾生者言佛世尊於一切法平等覺故能以涅槃為生死生死為涅槃煩惱為菩提菩提為煩惱如是種種法相自在旋轉故名於法得自在者此中通達梵本兼有己聲謂具足方便無所不達之義哀愍一切眾生不能直入法界故以甚深祕藏回作淺略名言俯逮眾生古先一切智人皆作如是演說充足種種求義利者非我獨作如是說也彼諸愚夫以不知諸法實相故自作增減見然我所說諸法本不生起常如大空是故諸真言者常當以此決定無疑慮心作諸事業自然功不唐捐無有罣礙也。",
        "from": "X23n0438_007:0379b03_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "普通真言藏品第四",
        "from": "X23n0438_007:0379b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次說普通真言藏品者世尊已答執金剛息障方便竟將說持誦真言成就悉地之相故先演說所持真言然此經大本一一善知識三密門中各有種種異方便真言數如恒沙不可備載今傳法聖者為欲攝廣為略故取其宗通要旨義兼用者舉為一品名曰普通真言藏品也經云祕密主普賢等各各言音請白世尊樂欲於此大悲藏生大漫荼羅王如所通達法界清淨門衍說真言法句上文毗盧遮那已於遍一切處法界門如所通達宣說大力大護三三昧耶等普通真言法句是以諸執金剛菩薩眾等各於一法界門得自在者為欲莊嚴大悲胎藏漫荼羅悉皆白佛欲於自所通達法藏中演說真言法句如是一一真言法句當知即是一種寶乘也爾時世尊欲令如是寶乘一一通至佛地無罣礙更以無壞法爾加持而告之言善男子當說如所通達法界淨除眾生界真實語句以蒙加持教命故今此諸善知識有所宣說皆同大日如來此中無壞者或可譯為無盡或云無害或云不動然阿闍棃以不壞為正義如人論議墮在負處不可復救更有一人能出離彼過令敵論者不能制伏梵語謂之無壞如來神力法爾如是非作非壞諸真言相亦皆法爾如是非作非壞還用自相加持故曰無壞法爾加持言淨除者謂除種種識心戲論之垢戲論垢除時眾生界即是法界其實無所除也。",
        "from": "X23n0438_007:0379b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云時普賢菩薩即時住於佛境界莊嚴三昧說無礙力真言者此佛境界即是諸佛自證不思議平等之心地莊嚴也謂大悲胎藏漫荼羅從普現色身遍滿虗空法界一時行菩薩道莊嚴種種佛剎成就一切眾生隨起一種善根皆具萬德故名為普賢菩薩此即是大日之圓因而佛是圓因之果也今所說真言正明此義也。",
        "from": "X23n0438_007:0379c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": " 曩 莫 三 滿 多 沒 馱 南(引) 三 滿 多(引) 努 蘖 多(引) 尾 囉 惹 達 麼 儞(寧逸反) 惹 多 摩 賀(引) 摩 賀 娑嚩(二合) 賀(引)初句歸命次句三滿多是等義努蘖多是進義或名為去或名為往為逝與上引聲相連亦有無進義等謂身語意畢竟平等也以如是平等妙因遍一切處行菩薩道去成正覺故云等逝如是去者當知無去無來相故云無進也第三句尾囉惹是離塵垢義 達 麼 涅 惹 多是法生義以不如實自知三業等故即有六十心等種種塵垢今知如是塵垢畢竟等故一切障葢自然淨除即是大日如來圓因一切如來功德法爾無缺是故離一切障時名為佛境界莊嚴種子從此種子遍於一切處發生莖葉華果成無礙力大藥樹王故云法生也如蓮荷生大池中漸次滋蔓還能遍滿大池今此種子亦是本從平等法界中出生還復遍滿平等法界故次句云 摩 訶 摩 訶所謂大中之大也。",
        "from": "X23n0438_007:0380a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次前云摩訶所出生處大後云摩訶所成就處大前是因大後是果大前是智願大後是行大又中間兼有引聲即是大無大義以大中之大無可待對故大相亦不可得如瑜伽者觀心圓明遍一切處時圓明相亦不可得故名大無大。",
        "from": "X23n0438_007:0380a21_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次麼是大空義訶是因義因是淨菩提心即是大空大空即是佛境界莊嚴三昧亦名薩波若慧所以重言之者言此心恒殊勝進念念增廣是故大而又大也又初心不異後心初入法界時大空還是究竟法界時大空是故果即是因因又非因又訶字亦是喜義謂菩薩初得大空生而生諸佛家發起十無盡願心大歡喜故故此真言正以訶字為體若行者思惟觀照入訶字門時即得同於普賢菩薩能住佛境界莊嚴三昧也今但略明句義一一當以字門廣釋之已下例爾。",
        "from": "X23n0438_007:0380b02_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云時彌勒菩薩住發生普遍大慈三昧說自心真言者如前普賢菩薩住遍一切如來境界出生無盡莊嚴今亦如是還遍一切如來境界而起大慈隨種種眾生性欲施與正法之樂雖云於一法門而得自在其實具足一切法界門如其自所通達演說心要故曰真言心也     阿爾單惹野譯云無能勝即是瑜伽宗中彌勒菩薩異名也就彼經義以於種種金剛事業無不究其微玅故曰無能勝者今此真言以 阿字為體以知一切諸法本來不生但從緣起故雖復生死流轉不出於如乘此如如遍一切眾生趣中成正等覺是故名曰無能勝者次句轉釋無能勝因緣    薩婆薩埵是一切眾生   阿捨耶是心性弩竭多是至義知義逝義了知一切眾生心性而隨順之也謂明見一切根緣又知種種工伎故能普遍諸趣如其性欲而充滿之所以名為普遍大慈三昧又彌勒正音云 昧 底哩(二合)(引) 曳此云慈氏此名號即是真言以最初 昧字 麼為種子麼是心意亦是大空又加三昧聲言自證此心即是大空三昧具含萬像故則能遍發大慈若有眾生能修此字門者即同慈氏菩薩也阿闍棃言若就本名以底哩(二合)(引) 字為種子所謂如實相無垢翳慈也。",
        "from": "X23n0438_007:0380b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云爾時虗空藏菩薩入清淨境界三昧說自心真言者謂入此三昧時即知諸佛境界畢竟清淨猶如虗空是故普門漫荼羅皆悉離一切相唯是心佛自證不可示人而已自在神力出納取與周給眾生不可窮盡又如虗空正以無所有故無所不有也 阿(去)(引) 迦(引) 捨是虗空 三(去)  麼多是等   奴蘖多是了知亦是進逝謂知心同虗空故一切諸法皆悉等同虗空爾時以不住法具修萬行用無所得為方便故亦復等同虗空故此真言正以最初長 阿字為體長 阿是發行之義言以虗空無垢菩提心虗空遊步而修萬行於大空中具生種種莖葉華果也故次句轉釋之   微唧怛囕(二合)(引)是種種奇妙顯色之義  嚩囉是衣  達囉是被著之義著雜色衣即是萬德莊嚴法身亦是畵作大悲漫荼羅莊嚴淨地亦是大空鏡中普現萬像之義也。",
        "from": "X23n0438_007:0380c10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云爾時除葢障菩薩入悲力三昧者如普遍大慈從一切法界門出生種種利樂當知悲力亦爾以一切法界門淨諸葢障拔苦眾生又如陽春之月震雷奮動時蟄者皆坼故名悲力也此真言以初 阿字引聲急呼者為體梵音是攝伏聲即是大悲雷震也 阿字是一切眾生本心也具足一切智性但以不如實自知故名為種種葢障傍有二點是淨除義也所謂除葢障者只是開此 阿字門使佛眼清淨耳 阿字引聲中帶三昧義行與涅槃點合故即是具足方便義也言此心障葢除時萬行方便皆悉具足即是蓮華臺藏開敷義也是故亦用此字為如來座真言次云    薩怛縛呬多是有情利益   毗庾蘖多是發起義亦是生義明所以拔除葢障之意正為發生萬行功德利益眾生如蓮實得離堅[穀-禾+卵]漸出淤泥鮮榮滋茂塵水不染能令受用之者身心快樂故次句即明利益之果梵云 怛[口*藍]者體是多聲是眾生識心又有如如義即心如實相所以與 囉字相連者言心之實相自性常淨無有塵垢也上有圓點即是同於大空住在生死時亦如是入涅槃時亦如是故重言之住二邊時亦如是行中道時亦如是故重言之未究竟出纏時亦如是已究竟出纏時亦如是故重言之當自在分別說次更有  怛[口*藍]怛[口*藍]字者是遣教道之迹直明證處言此中心如如相亦不可得獨一不思議法界耳餘義重言者同前。",
        "from": "X23n0438_007:0381a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云爾時觀自在菩薩入於普觀三昧說自心及眷屬真言者此即是普眼三昧如上所說大悲胎藏漫荼羅有無量法門就一一門復有無量根緣無量方便猶如虗空大海不可度量又隨入一法門即具一切法界門如是不同而同不異而異唯佛智慧乃能知之入此三昧時即能於念念中以普眼遍觀具足明了故名普觀三昧時觀自在菩薩從此三昧中以平等真語說普眼之心及得大勢等法門眷屬以同是蓮華部故也初云薩嚩怛佗蘖多即是一切如來嚩盧(引)枳多是觀言同彼十方三世諸佛所觀故曰一切如來觀亦名平等觀金剛頂宗名為金剛眼也次句云   羯嚕拏是悲  摩野是體言此普眼正以大悲為體故名悲體如鑄真金為人以其自體純是金故名為金人今此悲體亦爾是故觀自在名為悲者復次常寂法身以定慧為二手亦以悲智為二手是故祕密主持金剛慧印觀自在持蓮華印若望三諦則是從空入假智若對三點則是如來解脫德故有觀自在悲者之名持明藏中約此三目義用分為三部觀自在即是蓮華部主也次句云   囉囉囉者正明此蓮華三昧離塵垢義以囉字門本不生故乃至因不可得故如來悲眼常無垢翳以對三毒垢故三道垢故凡夫聲聞緣覺垢故凡夫二乘菩薩垢故三轉言之乃至三眼三智所對治垢本來不生乃至因不可得故轉言之次云吽者是能恐怖彼義以自心離三垢故即知一切眾生心亦離三垢大悲熏心而作是念云何眾生不能須臾觀察而自了知是故發師子吼聲欲以觀自在力令一切眾生離此本無之垢也復次吽字本體是賀字門賀是因義即是蓮華臺藏下有 隖聲是萬行須蕊上有大空點故具足開敷只以此誠諦之言恐怖諸障是蓮華部中忿怒義也次云 若者是生義傍有二點謂淨除三垢之生令蓮華種性生此真言正明增益功德義即以此字為真言體或可以最初娑字為體是無染著之義也又此得大勢真言是蓮華眷屬重言 髯字本體是 惹字門即是生義所治煩惱障生所知障生今以二障生義皆悉本來不生乃至因不可得故二障不生得真實大空生是故加以圓點次有 索字為真言體是不動義若法有有無論動與不動皆是敗壞不安之相今以生不可得故於 娑字側更加二點令此蓮華三昧同於涅槃第一堅固不可動轉此即是如來勢位今此真言王持未開敷蓮令不退失要當同得如是大位故名得大勢也右多羅菩薩真言亦是蓮華眷屬   迦嚕拏所謂悲者  納婆吠是生從於悲者而生即是從觀自在眼中生也次云  多麗是眼義也亦是度義今此真言以 多字為體多是諸法如義以一切法本不生乃至因不可得故當知無有實相以無相故如亦不可得即是如於諸法實相傍有三昧畫即是萬行皆如也 囉是六塵義以諸法非如非異故六塵皆如實相即是本性無塵名為如實知見淨無垢眼。",
        "from": "X23n0438_007:0381b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次六根六塵名為生死大海一切眾生悉皆沒溺其中不得邊際今見六塵如實相故到佛眼彼岸故名為度重言   跢哩抳者譯云極度自得度已又能普度一切眾生自得普眼無塵亦令一切眾生普眼無塵抳是 多聲如大本有五百多羅尊皆從觀自在眼生瑜伽密語以為阿彌陀佛姉妹。",
        "from": "X23n0438_007:0382a05_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右毗俱胝是觀音眷屬如持明藏中說一時執金剛於佛會中出現無量威猛眷屬一切大眾皆生恐怖時觀自在於額上皺中現此菩薩如今人忿時額上有波浪皺文梵語謂之毗俱胝故以為名也   毗俱胝出現時諸執金剛皆大恐怖入金剛藏身中彼尋以忿怒形進至金剛藏前金剛藏亦復恐怖入如來座下而作是言願佛護我佛謂毗俱胝言姉妹汝住彼即住立而白佛言唯佛所教敕我當承行於是諸執金剛怖畏亦除皆大歡喜言此大悲者而能現此威猛大勢甚希有也所以然者執金剛眷屬用畢竟空智摧滅人法惑顛倒無復遺餘乘此威猛之勢并欲損壞大悲功德是故觀自在者為護蓮華藏故以毗俱胝三昧伏而折之然此大悲忿怒齊至中道并當止息故佛告言姉妹汝住也初云    薩婆陪也譯云一切恐怖次云   怛囉散儞又是恐怖末云吽者亦是恐怖聲凡有三重恐怖義如世間一切眾生於生死險道大恐怖中不覺不知乃更豎我慢幢而自恃怙故以最初畢竟空句怖之爾時諸戲論滅得入金剛實性乃至下不見眾生可化上不見諸佛可求謂證涅槃而自恃怙見如來種種無盡莊嚴亦復謂是虗妄而欲滅之故調以大悲三昧使其柔伏爾時金剛實性已如百練純蠟隨意所為而復調之不止則傷平等大慧故復以如來威勢而制止之故有三種恐怖義   薩破吒也譯云殘害即是轉釋此 吽字令三種垢慢究竟無餘也此真言以 怛字為體即是如於中道不得令增又不得令減所餘字門皆當轉釋之且如次下 囉字是垢義初以有相為垢次以無相為垢第三以有無均等時不捨為垢以如於中道故即能離此三垢佗皆効此。",
        "from": "X23n0438_007:0382a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右白處尊真言此是蓮華部母白是本淨菩提心蓮華種子所含藏處萬德莊嚴從此出生故以為名初云怛佗蘖多尾灑野是如來境界以最初多字為真言體如於心實相即是本淨菩提心次句云   三婆吠是從生義謂從彼如來境界生也末句云鉢納摩(二合)是蓮華   麼哩[寧*頁]是鬘鬘謂結集眾華以為嚴飾即蓮華部眾多眷屬之義此又轉釋前句誰從如來境界生耶謂蓮華鬘從彼而生故為蓮華部母又此白處是本淨菩提心三昧故作女天形若本淨之慧即是大日如來也。",
        "from": "X23n0438_007:0382b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右馬頭尊真言是蓮華部忿怒明王如觀自在菩薩於一切法界門以普眼遍觀而得自在今馬頭尊還以此觀自在力從一切法界門大摧三障拔苦眾生馬頭即是大精進之義也最初 吽字義同前釋  佉那是啖食之義  畔惹是破壞之義 颯頗 吒 野是破碎令盡義也皆轉釋吽字謂以此蓮華忿怒啖食三垢破壞三障令摧碎無餘也若從一法界門則摧障不盡今從一切法界門是故殄滅無遺然此真言正以佉(引)字為體佉(引)是不可得空長聲呼之即是三昧萬行皆用不可得空為方便故猶如虗空不可破壞除諸法實相之外一切皆啖食之次云娜者是施義言所以駈除垢障之意正欲以如是除垢障遍施眾生也餘字門當廣分別說。",
        "from": "X23n0438_007:0382c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云時地藏菩薩住金剛不可壞行境界三昧者猶如金剛地輪以極堅固不可壞故能住持萬物使不傾動又如大地出生種種珍寶伏藏無有窮盡含藏一切種子令不朽敗漸次滋榮今此三昧亦如是能持法界眾生善根種子經無量億劫終不敗亡出生實性功德無有窮盡又如金剛以是地之實性是故不可破傷今此堅固菩提心亦是第一實際乃至常在無間地獄為一切眾生備受眾苦亦不為煩惱所傷故以為喻也初云賀字是因義如世間種子雖有上中下性無不因地而生一切眾生萬善種子雖三椉種種差別無不因此金剛地生故三轉言之即是三椉因義也。",
        "from": "X23n0438_007:0382c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次如世間種子雖復從緣增長有種種類形至論地界無生無滅今此三乘種子亦復如是以所生法不可得故當知因即非因至論實體但一金剛界耳次云   蘇多努者是善子義以此堅固菩提心荷負世間不可傾動是則能紹如來大悲家業故以為名復次種性真正故名為善子觀一切眾生一毫之善皆從寶王如來種性生此是地藏菩薩最真實語正以賀字為此真言體也。",
        "from": "X23n0438_007:0383a03_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云文殊師利住佛加持神力三昧者加持義已於第一品中釋此菩薩通達如來甚深般若唯是佛佛自證不可授與人若離加持方便則一切有心量者所不能及是故以嬰兒行反示童子之身演說人法無我蠲除戲論之法此是有迹之處非是究竟不行處然以祕密加持故令修道者藉此言詮得悟文表之旨若不開如是方便則眾生處處生著不知佛慧之深也復次如上所說諸三昧一一皆遍一切法界門今此加持三昧亦復如是雖則無盡莊嚴遍滿法界猶是如來反示童真之迹俯逮羣生欲令寄此舟航存乎捨筏不可執行處為證處持瓦礫為明珠也初云  係係是呼召義 俱 麼 羅 迦是童子   尾目訖底 鉢 佗 悉體(二合) 多是住解脫道者    娑麼羅娑麼羅是憶念憶念   鉢囉底枳孃是先所立願此意言唯願童真法王子住於解脫道者憶念本誓故以普門自在加持令我速悟如來自然智慧也解脫為諸佛解脫大般涅槃此解脫道即是二種無我觀佛子所行之道故此真言正以第四 麼(引)字為體即是我義以一切法本不生故我亦本來不生更欲對誰說為無我故不觀我與無我具見空與不空是名大我亦名大空皆以加持方便故作如是說究竟解脫時實亦不如所說也。",
        "from": "X23n0438_007:0383a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云爾時金剛手住大金剛無勝三昧說自心及眷屬真言曰者智度云梵音摩賀釋有三義所謂大多勝以此祕密之主所持金剛慧印高廣皆遍法界無有中邊故名為大具有世界微塵普門眷屬故名為多於一切金剛義中最為第一故名為勝能於一切法界門顯示生死過患然此智體無能說其過者故名無勝能於一切法界門大破四魔軍眾絕其種類然此智體更無有法能破壞之者故名無勝若唯有一門之用則不名為大復次如是大慧一切眾生等共有之今以三昧具足故名為無勝故還住此三昧而說真言也。",
        "from": "X23n0438_007:0383b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初句普遍歸命一切諸金剛次句云戰拏  譯云極惡所謂暴惡乃至悉能啖食法界眾生及諸賢聖無復遺餘次云    摩賀嚧灑 拏又是大忿怒義乃至如劫燒災火既已焚燒萬物又復滅其灰燼也復次 戰是一切法離遷變義 拏是一切法離怨對義是故金剛智體無能勝者 麼是四魔義我慢義心意義皆無自性藉眾緣生故即是本來不生故永離塵染自性鈍故猶如大空故曰     摩賀嚧灑拏此又轉釋不可破壞之義也復次金剛智體離一切遷變以無怨對故無我無意故離塵染故無知故同於大空故廣說之句末[合*牛]字是真言體賀是因義若法待因而成即是遷變法未離怨對悉皆可破可轉今此因本不生故其性常恒不可破壞具堅固力猶若風輪下有 鄔聲即是無勝三昧上有空點故遍一切處是故名大金剛所謂金剛部中忿怒之義能於菩提樹下大怖四魔也。",
        "from": "X23n0438_007:0383b20_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右   莽莫雞真言莽是母義莫雞是多義即十世界微塵諸執金剛之母一切如來智印皆從彼生故名多母也以最初 底哩字為真言體 多字是心如實相自性清淨一切塵垢本來不生上有 伊聲是三昧義此中慧性即是 毗 盧 遮 那金剛種子還從此三昧生若就句義  怛囉吒是破壞義吒字半體不成兼有死義前殺四住地人後殺無明住地人非但殺一切凡夫亦殺害一切賢聖故重言之也   若衍底譯云勝生亦名甘露生此是一切無能勝者之母故名勝生此生即是不死句故名甘露之義也。",
        "from": "X23n0438_007:0383c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右金剛鎖真言以最初 麼字為體是縛義此縛本體不生故猶如金剛與傍 曩字相連是大空義言此金剛之縛由大空故所為必成以此普縛眾生無能解者故名金剛鎖也句義云  滿駄是結護義與大空合故遍一切處皆以金剛鎖而固結之乃至有一毫可縛之機終不縱捨次云  暮吒是堅牢之義又轉釋前句非同世間之縛以無常遷變易可分散也皆再言之其義同前次句云    縛日嚧納婆吠此云金剛生       薩縛怛羅鉢羅底賀帝所謂一切無能害者轉釋固結堅牢之義言此鎖從金剛實性生同體密緻無有間隙亦無形像可執無微迹可尋見故畢竟不可壞也。",
        "from": "X23n0438_007:0383c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又金剛部忿怒明王月黶尊真言以最初 紇哩淫字為真言體賀是淨菩提心與風輪合故成自在力與囉字共體又加傍點故本性無塵而能滌除一切垢障上有三昧聲故定慧均等威勢具足於一字中具有菩提涅槃萬行方便故此明王部類最多乃至具百千手操持器械也紇哩是攝召義又召請義謂攝召四魔境界所有人民次以吽字大勤勇聲而恐怖之為遍成就一切金剛事業以無量門具足一切佛法故次云撥吒是叱呵義既發大勤勇聲尚有剛強眾生極難調者未肎順命故復以大忿怒聲而折伏之也。",
        "from": "X23n0438_007:0384a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又金剛針真言亦是金剛眷屬此智印幖幟狀如一股嚩日羅而極銛銳是一向專精穎利之慧從一切法界門貫穿諸法無不直達至於實際故以為名也以最初娑字為真言體以所為誠諦故則能深入法性若處處生著之人何由致之是故智者聞說  素旨之名即時隨義能解婆字門成立於中    薩嚩達麼是一切諸法    你吠駄[寧*頁]是穿義次云    縛日羅素旨是金剛針   縛囉禰是勝願謂以勝願金剛針穿一切諸法也如渴乏之人一向求水無復異念故能不計功力穿徹高原當知此金剛針正是菩提心義用是故所往必通無所罣礙也。",
        "from": "X23n0438_007:0384a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又一切執金剛真言即是上文所列虗空無垢等十世界微塵數持如來差別智印者同入大金剛無勝三昧於自心中出不思議光光中現此真言滿月之字字中發大音聲一切大眾咸普聞之如執金剛者餘一切尊說真言時當知亦爾也以最初吽字為真言體其中賀字是金剛慧身下有 鄔聲謂萬行以此慧身具足萬行故有種種差別印名又鄔字聲亦是三昧義由有種種行故有種種金剛無勝三昧門上加大空者明此一一三昧門皆悉遍一切處也三是眾多義明一切執金剛祕密門雖復轉差別至於此字之義無不道同是故三轉言之撥吒是叱呵義也又轉釋前句言此種種智門皆為普應眾生大摧二種生死故更復轉釋所以斷其二種業煩惱命為得二種大空生故所以重言 髯字也。",
        "from": "X23n0438_007:0384b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又一切諸奉教者真言如世間尊貴者侍從僕役之人隨教敕指麾執作眾務故或名奉教者或名使者或名守衛者等皆從事區別受命亦是金剛手住大金剛無勝三昧而演說之三部使者皆通用也以最初 係字為真言體本音是 賀字門即菩提心金剛種姓亦是風輪所為事業以加 翳字聲故即金剛萬行三昧重言係係者謂行人極行定中之定也若釋句義係係是呼召聲次云     緊唧囉野徙譯云何不速此是約敕之義如人處分僕使故先呼名而誡語之汝何不速為此事而久稽留欲使趣時之急令不失機會也次云  紇哩恨拏是執持義也令以金剛自在力速往執持一切眾生重言之者是守護之義既持護之又當謹固持之勿令縱逸還為諸為障者之所逼奪也    佉那佉那是食噉義又轉釋前句既執持之又當噉食又極噉令盡勿使尚有遺噍類也。",
        "from": "X23n0438_007:0384c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次對有為無為二重三障四魔故呼召執持噉食皆再言之     鉢利補囉也是充滿義    娑嚩鉢羅底枳孃是本所立願汝本立忿怒之願欲悉食一切眾生可以肥功德之身滿此大貪之志故當速作也復次如大長者告語領理家事者令開府藏出種種珍寶給與求乞之人咸使虗往實歸無所匱乏故云充滿本所立願也。",
        "from": "X23n0438_007:0384c16_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云時釋迦牟尼佛入於寶處三昧說自心及眷屬真言者由此三昧故如來出現于世以如來出現故則有無量無邊五乘法寶悉皆出現猶如輪王正位時世間種種伏藏自然開發又如諸寶山無所不有隨諸眾生有信手者則能自恣取之法華經化城喻品此中當廣說也    薩嚩吉禮捨是一切煩惱    [寧*頁]素娜曩是摧伏    薩嚩達麼是一切法     嚩始多鉢羅鉢多是得自在此意言摧伏一切煩惱於一切法而得自在也以初娑字為真言體娑名為漏亦名為堅言一切有漏有為之法無力無堅而為諸眾生謂有性實堅著不捨是故此法無常敗壞時即便沒在愛苦大海今入阿字門故則知諸漏本來不生況有堅固住者故能以此法王三昧遍破二十五有普閉一切諸惡趣門轉無量塵勞盡成寶處故名為破有法王於法自在也末句云       誐誐曩三麼(引)三麼者譯云等虗空無等者言此三昧非但於一三千界而得自在乃於無盡諸眾生界而得自在是故廣博無際等同虗空又如虗空雖無所不遍而具含萬像種種不同故言無等。",
        "from": "X23n0438_007:0384c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次如寶性是一而力用不同有辟邪除毒者有愈疾者有持財者有能成就種種幻術者有能普雨眾物乃至可共語使令者有能示眾生宿命行業乃至賢聖大會悉於中現者故云等不等也。",
        "from": "X23n0438_007:0385a19_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又毫相真言是如來無量功德之所集成即寶處三昧中一種滿願如意珠也初云   嚩羅禰譯云與願次云    嚩羅鉢羅帝是得願如人自得財寶乃能周給濟人我今本所希願今悉滿足今當施與一切眾生種種諸願也以最後 吽字為真言體 賀是因義歡喜義因是一切智願歡喜是初得此願到修行地是故加三昧萬行之聲上加大空點者言以萬行方便鍊冶如是願寶鑒徹空明威力具足故能出一切財寶遍施眾生以此勇施之音折伏貧窮下劣者令心通泰是毫相法門中 吽字義也又一切佛頂真言頂是第一尊勝義即是如來十八不共法異名即是寶處三昧中最難至處如輪王髻中祕寶非凡下之人皆得覩之也以最初 [金*(离禸+ㄆ)]字為真言體嚩是心智不行處語言不及處又加大空即是遍一切處無有邊際以三乘萬行究竟所歸會處是故三轉言之又於三部最無上故於三諦中最真實際故在三德頂故所以三轉言之次云 吽字是威猛大勢之聲一切賢聖所不能伏者悉伏一切聖賢所不能斷處悉斷故於諸真言主猶若輪王悉能益其威勢治其過失還約二種生死故二轉言之也次云  撥吒轉釋如來忿怒之義以二重吽字故摧滅二種煩惱無復遺餘令二邊重障畢竟清淨乃至十方諸佛八種佛頂以妙極於此故皆悉同歸故云一切諸佛頂。",
        "from": "X23n0438_007:0385a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又無能勝真言是釋迦眷屬中忿怒明王也無能勝是不可破壞義謂於一切世界種種隨類法門中遍摧諸障調伏眾生故以最初 地[口*陵]字為真言體 駄是法界之義 囉是垢障塵染義與三昧大空合故轉聲為 地哩也囉字是火輪即焚燒降伏之用以法界故無所不遍以大空故有無量門以三昧故具萬行方便以二轉言之故能除二重大障是故廣大威猛無能制伏也次云  [口*陵][口*陵]者以世界之障淨除則亦無可待對說為法界乃名一真法界是故除去 駄字但存 囉字門囉是本淨法界以加三昧聲故有解脫義加大空點故有不思議義對前無量除障門皆是不思議解脫門也。",
        "from": "X23n0438_007:0385b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次囉字是慧即佛智此中三昧即佛眼對眼故名見對智故名知以大空故畢竟淨如前二字所以普門調伏眾生者正為今此二字佛之知見畢竟清淨者次云 日[口*陵]者正體 惹字是生義也初句二字滅除一切過患令至第二句平等法界今此末句二字復從平等法界發生一切功德故此中以囉字為淨菩提心種子以三昧畫為大悲胎藏以大空點為普門無盡莊嚴以 惹字故芽莖葉華果次第開敷即是大空生也。",
        "from": "X23n0438_007:0385c11_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次以初二字故具一切降伏用以次二字故具一切寂災用以後二字故具一切增益用各有二囉字一對三種權用一對三種實用就一一囉字中以本淨故白色具寂災用以智體故黃色具增益用以火輪故赤色具降伏用此是具德忿怒是故能伏一切無有能勝之者也。",
        "from": "X23n0438_007:0385c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又無能勝明妃亦是寶處三昧中說但明王是慧明妃是定定慧合故出生一切無勝子故以為名也     阿跛囉(〔引〕)爾帝是無能勝   惹衍底亦是勝之別名即是戰勝之勝能降伏之義   怛膩帝是摧伏勝境之義如來以此實語現為證驗我已藉此三昧勢力大破二種四魔竟汝諸佛子若能如是行之必當復法王之業勿懷疑悔也以第二 跛字為真言體亦名勝義諦亦名第一義諦以於一切功用皆至妙極之境故普勝一切眾生即此勝相亦復本無生故尚不可得況有法能勝之者故名第一也。",
        "from": "X23n0438_007:0386a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又地神真言地為萬物所依住處皆悉依之而得生長如來心地亦如是為一切眾生所依處善種由之而得滋長故名持本三昧亦名普載三昧也 跛哩 體(町以反) 吠(微貝反)(引)即地神名也以第三 體字為真言體正音是 佗字門謂一切法皆有所依住處故如來藏猶如大地今以諸法本不生故一切法所依住處皆不可得也上加 伊字三昧聲也次有 嚩字加以 翳聲翳是三昧亦是指物之聲謂指真言之體此處出過語言之地不可示之唯觀行者內證之境也 曳是乘義如世間車乘要因於地而得前進如來已出過一切心地不復依止進行是故離一切乘也。",
        "from": "X23n0438_007:0386a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右毗紐天真言即是世間所奉那羅延王有眾多別名也今正音云   尾瑟拏吠此是毗紐以最初 尾字為真言體 嚩字加以伊聲所謂金剛大力三昧又以離言說故名畢竟空 瑟拏是進義生義如此天乘迦樓羅鳥而行空中自在無礙釋迦那羅延亦復如是椉大勢威猛金翅鳥王飛行畢竟空中截生死流轉取所應度者故彼名號即是真實言。",
        "from": "X23n0438_007:0386b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又  嚕捺囉真言即是世間所奉摩醯首羅天亦有眾多異名也嚕捺羅即是一種自在天乘以最初嚕字為真言體以本無塵垢三昧故其心於一切法得自在法爾如是天然成就故名摩醯首羅天 捺羅是授與之義若以字門相釋即是淨法界椉也以一切世間無非淨法界故當知如是寶車其數無量故能隨意取與遍施眾生也。",
        "from": "X23n0438_007:0386b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又風神真言   嚩(〔引〕)野吠即是風之正音以初嚩字為真言體 縛是縛義以入阿字門故本來無縛無縛故即真解脫真解脫者即是如來也是乘義也又是一種風天乘也末後吠字是無言三昧亦是畢竟空義言此解脫風乘於畢竟空中旋轉無礙是故往返神速能普度羣生也。",
        "from": "X23n0438_007:0386b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又美音天真言亦名大辯天亦名辯才天是諸天中歌詠美妙者猶如毗首羯磨工於伎巧之類非乾闥婆也    薩羅娑嚩底曳是彼名號正音即為真言又是一種妙音天乘也以初娑字為真言體是堅固義如馬鳴自奏[口*賴]吒和羅樂五百王子思惟世間過患同時出家今此真言亦爾能以金剛諷誦令一切眾生咸悟三界無常無有堅住勤修堅法成堅固身又法華云言辭柔輭悅可眾心隨順說諸法皆令得歡喜亦是此法門意也。",
        "from": "X23n0438_007:0386b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又   涅哩底真言是羅剎王也正音       囉乞灑娑地鉢多曳是言即是真言囉乞灑娑是能啗義以初字為種子是垢障義如羅剎常啗眾生無有厭足如來亦爾常食一切垢障眾生無有厭足也 駄是法界義加 伊字故轉為 地聲跛多(〔引〕)名住以住法界三昧故名為妙住如是妙住時見一切垢障眾生悉入法界藏中即能啗入腹之義若乘如是乘者迅速無比名為羅剎乘也。",
        "from": "X23n0438_007:0386c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又  燄摩真言     吠(無葢反)嚩娑嚩哆也是本名即為真言毗嚩娑是堅固住義以初字為真言體是無縛義所謂堅住無縛三昧亦是以理除眾縛不以非法也 娑是諦義以離言說戲論常如法相故判決是非無有錯謬是故名為法王也亦是乘義乘此如如去至法王位是名焰摩乘也。",
        "from": "X23n0438_007:0386c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又死王真言是  焰摩明王主奪一切眾生命根是故從無明行業生者無能出其境界是故經云無上諸世尊緣覺聲聞眾尚捨無常身何況諸凡夫明此死王威勢最大也   沒[口*栗]底野吠即是死義以最初字為真言體 麼是我義一切眾生不觀諸法念念無常故則生二種我相故係屬死王不得自在是故如來以無常句而警悟之一切眾生則知諸法無我若無我者誰屬死王誰受諸苦耶次云 底野是乘如是以乘二我如實相故能斷一切眾生業壽之命而不為二死所拘是名死王乘也。",
        "from": "X23n0438_007:0386c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又黑夜神真言是焰摩侍后  迦羅名黑  怛哩曳名夜此黑夜名即為真言黑夜晦冥是一切鬼物魑魅所行之處諸生靈等多懷恐怖衰惱之時獨此神於黑夜中威勢自在亦能理其眷屬不令非法損惱世間如是無明黑夜亦是三界凡夫怖畏不安穩常有種種煩惱鬼魅自恣遊行今黑夜真言即安住其中得不思議解脫故用最初迦(〔引〕)字為真言體言一切眾生以無明故造虗妄業迷失正路墮在生死稠林今觀此業本不生故無相無垢是故黑夜如不異大明如若捨暗求明明復成障住此無障三昧於黑夜中成最正覺名為黑夜乘也。",
        "from": "X23n0438_007:0387a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又七母真言是焰摩部主諸鬼魅之類凡有七姉妹也一名   左悶拏二名 矯吠哩三名吠瑟拏微四名   嬌麼哩五名  印捺哩六名  嘮捺哩七名  末羅囉呬弭此七名皆是真言今云莽怛哩毗藥則七母通用也 莽是母義句中兼有等聲是眾多非一之義以母類眾多又為眾鬼之母故以為名亦以 麼字為真言體是無我義大空義猶如虗空以無相故不礙眾生大空亦爾不礙一切煩惱故能出生種種病行以利眾生故名鬼母乘也。",
        "from": "X23n0438_007:0387a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右釋提桓因真言釋迦是百福義以於因中作百無遮大施大會故得成此果故以為名今云釋迦羅也是正音也以初釋字為真言體 捨是本性寂義又 奢 摩 佗亦是止義次轉釋云以諸業垢本不生故復次從本性心地起諸作事及種種淨妙六塵即是淨佛國土莊嚴法身之義從一字中即具百字功德故名百福輪寶乘此百福輪寶乘名為帝釋乘也。",
        "from": "X23n0438_007:0387b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右   嚩嚕拏龍王真言此是大海中龍也諸龍王亦可通用之  阿半是水義  跛多是主義 曳助聲以於一切智水法門而得自在是故名為水主以初阿字為真言體以此水本來不生常不動故又如 半(〔引〕)字無有此岸彼岸無所不遍無所不有同於大空故名為如來大智慧海心主自在龍王常住其中出生神變加持普門法雨潤及一切末句以 曳字故名為水主乘也。",
        "from": "X23n0438_007:0387b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又梵天真言初句云鉢囉惹譯云一切生次云  跛多是主義 曳是助聲所謂一切眾生主也如劫初時梵宮寂莫無人梵天適生念時有命盡天來降又皆不見梵王終始故便作是念我等從梵王生以能生一切有情故名一切生主而實眾生前際無始非是梵王所生如來亦復如是以世間一毫之善乃至諸智子等皆從佛心生故又不見如來終始故名為世間之父而實眾生佛性前際無始非是如來所生也以最初 鉢羅字為真言體 跛是最勝義 囉是淨法界不為塵垢所染即是蓮華胎藏一切佛子皆如是最勝胎藏生是故名勝子末句加 曳字故名為梵王乘也。",
        "from": "X23n0438_007:0387b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又日天子真言大日之義如初品中已說   阿(去)(引)儞底野野是彼名是故世間日常利眾生者以初阿(引)字為真言體此字引聲呼之是寶佛日本初不生之行亦名日出三昧亦名破暗三昧次云 儞者即轉釋菩提心義自開如是慧日誓當轉授一切普利羣生乘此如實相去毗盧遮那大日之位名為日天乘也。",
        "from": "X23n0438_007:0387c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又月天真言是瑜伽淨月之義   戰捺囉野即是月名一切世間能息除熱惱施清涼樂故謂之甘露造曆者傳云此甘露有十六分乃至以十五分遍施眾生以所餘一分還生今以最初戰字為真言體 戰是不死義一切甘露味中無過淨月三昧其服之者則離諸遷變不死不生次云 娜者即是施眾生義囉是無塵又為淨月之用以加 曳聲故所謂月天乘。",
        "from": "X23n0438_007:0387c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又諸龍真言是一切龍通用  謎伽即雲義  扇儞是啗食義曳是助聲西方謂龍為啗雲也雲是諸蔭障葢之義能令眾生昏蟄慧日不明龍能須臾盡之使大虗澄廓萬像明現。",
        "from": "X23n0438_007:0387c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次如諸龍王非但除一切雲亦能興一切雲今此菩提心龍王不思議妙用亦爾能起無盡莊嚴雲遍覆法界如娑竭羅不動本處降雨六天故此真言以最初 謎字為體以知諸法無我故得八自在我三昧次云 伽者是一合義 扇是寂義 儞是大空以種種蔭雲密合之相皆本寂故無葢障同於大空本淨中還起佛化之雲同體密合遍於法界以加 曳聲故名為諸龍乘也。",
        "from": "X23n0438_007:0388a01_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又護門二龍王真言  難奴歡喜義跛字連上轉聲云  鄔跛是近義亞義    鄔波難陀即第二龍名也如大龍王普雨世間作一切眾生利益自觀勢力而生慶喜即是如來喜法門云二龍者一是慧力次小者是三昧力復次初是佛地力次小者是近佛地力初是究竟地力次小者是初發心力以祕藏之中初心勢力不異後心然亦小者有差別故云次小也以初 娜字為真言體又加空點轉聲而難重言大空者即是空之大空又對福智權實等種種二法門皆同大空故成不思議勢力以此遍施眾生即是大雲普雨之義故加馱字末後有 瑜聲故名為二龍王乘也已上皆是釋迦眷屬寶處三昧中一種法界門所餘未盡者下當更說也。",
        "from": "X23n0438_007:0388a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云爾時毗盧遮那世尊樂欲說自教迹不空悉地一切佛菩薩母虗空眼明妃者如前諸大尊等各於自所通達法界門說自心及眷屬真言皆欲如其性類引攝無量眾生令於彼彼法門得自在故今毗盧遮那又欲令彼一切諸法界門進趣修習者乃至一毫之善功不唐捐故諸有所作無不成就如般若經初品所開示故從一一門皆生如來普門大智身故復說心王自證之教所謂摩訶般若一切佛菩薩母明妃如大品佛母品中演說其義以如來加持之教本來不生故無有足迹可尋是故不空教迹遍一切處若有迹可尋是則生滅行處非自教之迹也又此真言以初 誐字為體誐是行義是去來義以一切法本不生故乃至因不可得故則是一切法都無所行所謂不行色不行受想行識不行色常色無常不行色苦色樂如是我與無我淨與不淨空與不空有相無相有作無作有為無為寂靜不寂靜等皆應廣說乃至一切種智亦如是復次不行亦不行何以故以一切法非是本有今無故不誑相涅槃亦不可得故曰   伽伽那是大空義轉釋二字以二邊不行故名為大空也此中句義誐誐曩譯為虗空  縛囉是勝願  落乞灑妳是相勝願如虗空相即是淨菩提心心畢竟淨故無邊際故離分別故故以大虗空喻之然是中復有無量功德虗空不能喻也以如是觀心實相故名曰虗空眼即於如是虗空眼中蓮華胎藏開敷心佛現前是故名蓮華母諸佛母次句云     誐誐曩三謎者前句已說心相今更明心體包含廣大等同虗空次云   薩嚩都譯云一切處   嗢蘖多譯云更無比言此等空智願於一切法界門皆至妙極之境是故無可為譬無能及者唯佛與佛乃能知之亦兼母子兩義也次云    阿避娑(〔引〕)囉是堅固不可壞義言此智本從金剛寶性生故不可破壞又為虗空佛母之所含養故不可破壞次云   三婆吠者是從生義如人胎分成就時出離胎藏如來亦爾淨菩提心究竟圓滿時出過一切諸觀自然智生如是生時即是從大空生故云從不可壞生也   入嚩羅曩是光焰照明義如大威德天生時自然有光照諸世界如來亦爾適從佛母降生時大日威光遍照法界爾時毗盧遮那所願已滿而作是念我今普門具體皆從虗空眼生是故此恩難可酬報由此發誠實言歸命般若波羅蜜云     曩謨阿目伽(引) 南(引)即是歸命不空者此義無所不遍故用多聲呼之所以然者如世人雖復智能備足勢位自在而常供養其母如來亦復如是雖為法王尊無與等然常尊重般若波羅蜜依之而住梵網以孝順父母為心地戒義在於斯也。",
        "from": "X23n0438_007:0388a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云復次薄伽梵為息一切障故住於火生三昧說此大摧障聖者不動主真言者如蓮華眷屬以馬頭為忿怒明王金剛眷屬以月黶為忿怒明王釋迦眷屬以無能勝為忿怒明王今毗盧遮那自教迹中以聖不動降三世為忿怒明王以毗盧遮那普遍一切法門故當知不動尊普門成辦諸事大摧一切障也 囉字門是毗盧遮那大忿怒火能燒一切世界使灰燼無遺今不動尊從此火中生猶如軍吒利尊從執金剛火中生是故如來住於火生三昧略說此中障有二種若從種種外事因緣故者皆名外障從種種內事因緣生者皆名內障乃至此中多不和合微細之相如般若魔事品中廣明復次從四住地因緣生者如為外障從無始無明住地生者名為內障此不動真言皆能壞之故此明王具大威勢普能守護一切真言行人使菩提心不復動轉令彼所為善業隨意皆成又如世人為佛使者一切眾生無能傷害而陰蔽之今此明王以承佛法威命行如來事故乃至蓮華金剛手等皆悉不能制之何況波旬之類是故行者當念閻浮提三障重故常應繫念修行也又初句云       戰拏摩賀(〔引〕)嚕(〔引〕)灑拏釋名與金剛手真言大同而義小異且如左字前約金剛智門明不遷變今約蓮華臺上常智之身明不遷變又 拏字門一生補處菩薩尚有一死是則未離怨對如來智身本不生故則無有死是永離怨對是故不動明王能殺灌頂菩薩麤重之身斷其變易之命況餘三界眾生即是暴惡之中又極暴惡之義 摩是我義 賀是因義乃至諸菩薩等尚有微細生故猶屬眾緣無常無我不得自在今如來常智離諸因緣得成八自在我無能害力故此賀(〔引〕)字名為風輪亦名羂索印次有 囉字加三昧聲正是火生三昧之體與風輪和合猛威熾然即如來大忿怒義次有 灑字以本性鈍故即是大慧刀印也以 囉字門一切諸障即是淨法界故幻相本來不生則無法可破實相本來不生畢竟不可破故此慧刀都無所破也次有 拏字是大空三昧言此暴惡熾然之勢從無量門皆悉遍一切處也次云   薩頗吒野是破壞義轉釋前句明忿怒之功也 娑是堅固義謂一切眾生各各於所得法堅著不捨生不可破壞想今入 頗字門見一切法展轉從眾緣生猶如聚沫易可摧伏是故次明吒字是卑慢義如師子王欲與野干共戰自恃材力故以為不足可敵是故說此為金剛慢加野字故名為忿怒乘也次有 吽字即是發誠實言作師子吼聲賀是如來自在力義與三昧大空合故具足普門之萬行無所不遍此是中胎吽字義也次句云  呾囉吒是堅固義明所以大摧諸障之意正為護持佛國普令道種堅固無動無退故此中字義謂觀諸法如實相即是淨法界有佛無佛法爾如是離諸造作是故須彌座王不可傾動為此羂索所持者不可復解也末句 憾(〔引〕) [牟*含](〔引〕)二字是真言體謂普門成辦諸事雖種種方便不同究竟同證八自在我其歸一揆當歷法廣分別之。",
        "from": "X23n0438_007:0388c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云復次說降三世真言者亦是成辦諸事忿怒明王此中與不動尊少有差別者不動尊是大慧火刀正以降伏為用降三世是大慧風刀正以攝召為用前真言從 囉字生為燒一切無智薪故此真言從 賀字生為除一切煩惱塵故復次如世間內外種子以火界所持故不腐不敗乃至成就以風界所持故增長滋榮與時開發是故降三世真言能折伏一切剛強難化眾生咸使心意柔輭發生萬行此其差別也所謂三世者世名貪欲瞋恚愚癡由此得有諸世間故亦是世間所執性故復次於過去世已植如是三毒根令隨行業因緣生復於後世田中下如是種子是故名為三世又三世者名為三界如來以加持神力故於首陀會天初成正覺以真言威力來下四禪中爾時色像光明所知見法及諸眷屬悉皆類彼諸天而復出過於彼百千萬倍不可為喻諸四禪天喜懼交至怪未曾有而作是念今此處為世界中尊而又有過我境界不識其所從來是何謂也即共集會而問佛言大天隨行何法威德如是爾時世尊隨彼所宜聞法以三輪教化而開導之既降伏已然後次第來下遍於三界為欲調伏閻浮提眾生故以補處身從兜率天下而轉法輪乃至於舍衛城現大神變制諸外道及曠野鬼神訶利帝母等種種難化眾生如金剛頂中廣說故曰降三世也初云 賀者正是風輪自在之用以一切眾生無不待因成故隨業流轉於三世中不得自在唯有毗盧遮那至第一無生際故離一切因是故自在神力旋轉無礙普遍一切時處開發無量眾生也三重言之以對三世義故又對愚童有識覺心三種眾生故永拔三道大樹開三德華故又 賀是喜義如入楞伽所說亦是如來大喜笑聲欲授一切眾生奇特記故變革威儀常度也次云   微薩麼臾者即是奇哉怪哉之義如佛常教五停心等各有對治門今此真言則以大三毒力攘奪世間三毒所謂以貪調貪以瞋調瞋以廢調癡故云奇怪復次如二乘已死之疾種種良藥不能療治今還以三種毒藥救之令起故云奇怪復次金剛種子本性不生而今方便種植具生種種根莖華葉故云奇怪以末句加曳字故名為大摧乘也次句云      薩嚩怛佗(〔引〕)蘖多(〔引〕)   尾灑野是如來境界   三婆嚩是生轉釋前句如是自在之用從何處生謂從如來境界生也此中 尾字是一切法語言道斷處即是如來自心自證之法 灑是鈍義謂布施際不異慳貪際乃至智慧際不異愚癡際是故無有定相可說亦無所乘是如來境界義以從如是境界生故雖在諸有之中而煩惱不污業不能縛猶如大風觸物無礙故名三婆縛次云   怛[口*賴](二合)(引)路(引)枳也(二合)譯云三世   尾惹野降伏義又釋前句以是義故能普勝三世而降伏之也此真言以 怛[口*賴]字為體此翻為三世三毒如實相即是淨法界加三昧聲是萬行方便義譬如善調御師只調惡馬難調之性作良馬調柔之用是故未調伏時材力雄駿奔縱逸羣者既調之後則堪一日千里但觀種性何如耳豈易體而治之哉佛調御亦爾能調剛強生死作普門法界用亦調剛強涅槃作普門世界用是故如來三業三毒普勝世間次云 吽者即此大調御士威猛之聲也末云 弱字是呼召驚覺之聲亦是生義言一切眾生與我無異皆從如來境界生也降三世風種種所為事業正為開敷增長佛菩提樹是故加淨除點革彼剛強凝污之性咸使滋榮若行者以誠諦言發此聲時能遍入一切眾生心令得醒悟也。",
        "from": "X23n0438_007:0389b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又聲聞真言是釋迦眷屬亦於寶處三昧中說之似傳寫者出文不次耳初云  係都是因   鉢囉底也野是緣   尾誐多是離  羯麼是業   涅惹多是生意明自所證法離諸因緣以離因緣故則能永害業生故加 吽聲也六因四緣義此中應廣說毗尼中偈云諸法從緣起如來說是因彼法因緣盡是大沙門說此偈攝三藏義亦攝此真言義故天竺相傳謂之法身舍利也最初字門賀是因義所謂諸苦所因貪欲為本以加三昧萬行聲故即是種種滅苦道滅此因故無所依止名為涅槃 都字是諸法如如義聲聞法中以四聖諦為四真如亦以十二因緣為住為住者即如也次云 鉢羅(二合)者以六情不著六塵故滅盡諸愛無復巢窟是一切世間甚深難解處也故智度以聖人心中所得涅槃為第一義也 底也(二合)是乘如義謂滅苦之道去至涅槃中故名乘如次有尾字是滅語言三昧故舍利弗云解脫之中無有言說吾今於此不知所云  誐多是無去來義乘此去者不復來至六道中  羯麼是無作無我義 涅(寧逸反)是大空義聲聞經中以法空為大空故云誰老死是老死亦皆邪見 惹是無生義所謂能自說我生已盡乃至不復更生以之故復加 多字也末句 吽字以離一切因故心得自在下有三昧聲故成俱解脫上有大空故得四無礙辯成無礙解脫是名大力聲聞故能以此師子吼聲威伏三障隨佛轉法輪也復次入阿字門故一切眾生本來離一切因以知諸法常寂滅故化城亦滅如是無疑悔時是名決了聲聞法謂能以此 吽聲普令一切聞故。",
        "from": "X23n0438_007:0390b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又緣覺真言亦是釋迦眷屬 嚩是語言道斷義以辟支佛智慧深利見一切集法皆是滅法也故名為證寂然界住此三昧時觀諸法如涅槃相無可宣說名為極滅語言三昧以此因緣不樂說法欲滿眾生願故但以神力加此一字以為真言也復次文字性離即解脫相故此 嚩字門即是諸佛金剛語能以無言之聲普遍世界若知如來常不說法者乃名具足多聞是名決定緣覺乘也又此是聲聞緣覺入法界乘故用字門明義若是二乘聖者自所宣說真言即但明句義無字義也。",
        "from": "X23n0438_007:0390c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又一切諸佛菩薩心真言即是 真 多摩尼普通一切佛菩薩用初云        薩嚩母駄冐(引)地薩怛縛   紇哩乃耶(引)譯云一切佛菩薩心以此淨菩提心寶王十方三世證者無不道同故又此   紇哩乃耶是樞極之心非唧多心也次句云    甯夜吠捨[寧*頁]是入義入一切佛菩薩心即是入於普門法界故此真言正以 甯夜字為體此字與前字長畫中 阿聲相連 阿是心之實相 甯字即同圓點是入證義亦是大空義心自證時同於大空是故離一切相而具一切無盡莊嚴相以加 也字故名為普門乘也次句      娜莫薩縛尾禰者是毗盧遮那發誠諦言普遍歸命如是菩提心寶猶如輪王寶馬雖復周行遍四天下去心不息如來亦爾雖萬行已滿恭養一切善知識心故不休息復次世尊自念往行菩薩道時常蒙如是諸佛恩故如諸菩薩初住地時無生忍時受灌頂時上如來地時皆賴十方諸佛加持建立如法華方便品中稱南無諸佛亦是此意也    薩縛尾禰譯云與一切願以一切智願自滿足故能施一切眾生種種希願悉皆以此因緣得滿大菩提願是故盧遮那佛欲從普門普雨眾寶故先敬禮如是真多摩尼也復次 娑字是堅固義無所著義 囉嚩是法界心離苦無縛義 尾是大慈悲水加三昧聲離語言故即無緣三昧 禰是授與義一切眾生所願常自滿足我獨能施之如是無捨之施周給一國猶固不盡也。",
        "from": "X23n0438_007:0391a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又一切諸世天心真言亦是釋迦眷屬今不次耳初句云 路(引) 迦(引) 路(引) 迦 羯 囉 野者路(引)迦(引)譯為世間次  路迦字以與 阿聲相連故名為阿路(引)迦是明義 羯 囉 野是作義作世間明者謂以此明普明照世間除其暗冥也所以然者世間即是暗冥之義以暗冥本不生故即是大日光明故以最初 路字為真言體 攞是相義此相本來無相名為實相故佛能以實相身普現種種世間之身也次云一切(  )天(  )龍(  )藥( )叉( )乾 闥 婆 阿 脩 羅 迦 樓 羅 緊 那 羅 摩 睺 羅 伽 儞 者 儞字是等義謂此八部之外更有無量無邊種種族類諸趣皆舉此無相之明一以貫之次云   紇哩(二合)乃耶即是心義又帶多聲    甯夜迦羯哩灑野是攝義謂以如是一點攝一切諸世間樞極之心也末句云     尾唧怛囉蘖底是種種行亦是巧色義西方謂錦繡為唧怛羅此錦繡之行名一切眾生所喜見身亦名一切眾生語言陀羅尼亦名百千萬億旋陀羅尼種種巧明處皆從無相日中旋出還至極妙之境故名普照世間乘也。",
        "from": "X23n0438_007:0391b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又一切諸佛真言在東方大勤勇位十方佛等皆通用之初云   薩嚩佗譯云總攝一切   尾麼底譯云無慧以無慧故則有種種疑悔故此字正譯為疑    尾枳囉拏是除棄之義如世人謂蠲除糞穢亦用此名即是菩提樹下廓然大悟時於一切種一切知見中疑悔永盡實相智生此實相身即是毗盧遮那法界身故次句云       達磨駄(〔引〕)覩涅(寧逸反)惹(〔引〕)多譯云法界生也此中 涅(同前反)字名為大空三昧 惹是生義上帶 囉聲下有多聲 囉是淨法界心亦是如來三角大智火 多字是如來實相故此智生時即是從大空生末句云   參參賀此三字皆是種子為真言體 娑字正是蓮華心以一切法諦不可得故名為如實知見以一切法無所著故名為佛無漏智無流故常常故不可破壞名為第一實際以加大空點故遍一切處如蓮華敷故此經宗以成菩提智為華開敷佛也以對妙因妙果故對權實二用故對自證加持本迹義故對自覺覺佗義故所以再言之賀字是如來自在力正以如是自在力故從此二重蓮華奮迅示現無盡莊嚴藏以大悲漫荼羅廣義普攝眾生也。",
        "from": "X23n0438_007:0391c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又   訥達囉灑真言是法佛奉教者常守護漫荼羅內門住於右邊譯云難執持亦云難降伏以毗盧遮那大空無礙力故一切無能執持制伏之者又譯云不可越亦云不可觀視以常奉宣如來三昧耶教是故威勢尊嚴無敢過越又彼光暉暉猛盛如集百千日輪一切嬰童之目不能諦視欲具如是眾義故存其梵名初句云   訥駄囉灑即彼正音     摩賀(〔引〕)嚧灑拏是大忿怒義如前釋   佉(〔引〕)娜野是食啗義正以 佉字為真言體以諸法如虗空亦不可得故名為不可得空一切眾生以不解此空故常縱諸四魔等肆意陵暴法界宮城今還用此空力駈除吞滅無復遺餘又能自在攝召一切眾生令入此難解難入法門普見心佛次云 娜字者非但招入而已亦能以無量門開出如來祕寶而能施之是則法身奉教者所為事業次有 野字門是無乘義以無所乘故於一念中周施往反普遍十方若心有所依待則能爾也次云       薩[金*(离禸+ㄆ)]怛佗蘖多枳攘 矩 嚕者此枳攘字引聲故合云  阿枳碾是教勅義所謂一切如來教勅矩嚕是作義又轉釋前句乃至十方三世一切如來教勅皆能隨教而作也又是奉宣法王教勅之意令一切如說而行不得違越也 阿 毗 目 佉真言譯云相對亦是法佛奉教者與   訥達囉灑相對常在門之左邊故以為名最初 係聲即呼召義次云   摩賀鉢囉 贊 拏譯云極大暴惡以對前真言故亦是極忿怒義次云    阿毗目佉又轉釋此義以初 阿字故能殺二十五有我倒眾生以後佉字故復殺二十五有無我倒眾生。",
        "from": "X23n0438_007:0392a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次有我是二種生死集相無我是二種生死滅相以無遷變無待對故以一切悉能害之故名極暴惡也次云  仡哩恨拏是攝取義   佉(引)娜野是啗食義亦已佉字為真言體明如來所以呼召之意令彼攝取二種為障者而啗食之也又此尊威力悉與前尊同等俱同不可得空為種子為相甄辨故以相對為名耳復次此不可得空義普護一切法界門是故此尊亦名極暴惡毗盧遮那亦名極暴惡寶幢佛亦名極暴惡華開敷佛亦名極暴惡皷音佛亦名極暴惡無量壽佛亦名極暴惡大勤勇者亦名極暴惡虗空眼亦名極暴惡真多摩尼亦名極暴惡觀自在亦名極暴惡金剛手餘皆以類言之如是一一門皆遍一切門展轉相對非如非異故名不可思議法界宮門也次句云     緊唧囉野徙譯云何不速前已釋之次云       三摩耶麼弩娑麼(二合)囉者譯云憶念三昧耶亦與前義相對前真言隨所教勅應作故此中互文令憶念三昧耶也。",
        "from": "X23n0438_007:0392b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又結大界真言亦是毗盧遮那住於清淨法幢高峯觀三昧中說譬如良將統御三軍隨彼材力所堪各盡其用是故盡地而守無能犯之若入此三昧者亦能部分一切法門使如提綱振領毛目盡舉當知二明王二奉教四大護等皆是此中折衝禦侮之用是以城池嚴固無敢干之若真言行人用此結周界者乃至諸聖尊等以不越三昧耶故猶尚不能壞之持律比丘如法結界作諸羯磨假使界外眾僧盡集更無有方便令壞其法事也初云      薩嚩怛羅弩蘖帝譯云隨一切遍謂周遍十方一切處所次云     滿駄野徙[牟*含]譯云結界此意云遍一切方所結界也     摩賀三摩野   涅惹帝譯云從大三昧耶生譬如眾僧如法結界隨彼久近齊未捨已來界法常生當知大三昧耶即是一切諸佛金剛羯磨是故如法結已金剛界生   娑麼囉嬭者譯云憶持念如羯磨唱相時先誡眾僧令一心和合同共憶持今亦如是普告微塵大眾令憶念本誓同共加持也。",
        "from": "X23n0438_007:0392b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次深祕釋者即是共結行人心地中大界從此以後悉成金剛法界宮諸魔羣道不復得入一切玅業隨意皆成如此界本來不生故畢竟不可捨也     阿鉢囉底賀帝是無能害義無能壞義無罣礙義  馱迦是威光義重言之者謂極威光乃至如劫火猛焰無能逼近此是法界法爾非造作所成也次云  左囉是行義重言之者所謂極行以極行故周流速疾無處不遍又左者名無滅囉者名無障言此界非唯堅固不可破壞又有猛盛威光循環四布不可隱滅也次句云重言  滿馱極結義    娜捨儞迦即是十方義以 滿字本無縛故如是界體同於大空無縛之結終不可解故名極結復次於一微塵中結界亦遍十方故名極結也次句云      薩嚩怛佗(〔引〕)蘖多(〔引〕)   弩枳孃帝譯云如來教 鉢囉(二合)  嚩囉譯云所證  達麼名法  臘馱名獲亦是證得之義   尾惹野此翻為勝亦名無能勝以如是結界故於一切諸佛三昧耶教逮得如來自所證法一切諸障無能俎敗其功故云無能勝也次云    婆誐嚩底是德號總名即本真言主次云      尾矩哩尾矩黎者皆是除義初言尾矩哩是勸令淨除次云尾矩黎是已淨除又初除謂淨諸垢次除復淨諸相次句云 黎 嚕  補哩是宮義處所義言此所結界內即是一切世尊離垢無相之宮所以結界之意在於界故以黎字為真言體 攞字加三昧聲萬行悉皆無相即是諸佛自證心證之宮一切有心量者非其境界故復結云   尾矩黎意明畢竟淨也。",
        "from": "X23n0438_007:0392c16_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "自此已下明種子真言。",
        "from": "X23n0438_007:0393a19_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又菩提心真言 阿字門是心實相心一切法本來不生故此心即是本智當日故為毗盧遮那法門也。",
        "from": "X23n0438_007:0393a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又菩提行真言正體 阿(引)字是淨菩提心加三昧聲所謂萬行此萬行以實相日為幢旗故名寶幢如來也。",
        "from": "X23n0438_007:0393a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又成菩提真言 阿字是菩提心種子以加大空點遍一切處萬德開敷故名娑羅樹王華開敷佛也。",
        "from": "X23n0438_007:0393b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又涅槃真言 傍有二點是淨除義眾生自心妄想戲論淨時即是涅槃雖適無所依而出生一切聲字故名鼓音聲如來也 右降三世不動尊真言皆以自在風為體 長聲呼之具足萬行加涅槃點為明如來解脫力故 加成佛點為明如來大慧力故智斷相資猶如二翼皆能成辦諸事。",
        "from": "X23n0438_007:0393b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又除葢障真言 阿字是一切眾生佛知見性加三昧畫即此心地中萬善之萌今以悲力三昧決其翳瞙破其[穀-禾+卵]故名除葢障也。",
        "from": "X23n0438_007:0393b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又觀自在真言 娑字是心蓮華普眼以此遍觀一切世界即是自在加持蒙此加持者亦復胎藏開敷諸漏淤泥所不能染故加涅槃點也。",
        "from": "X23n0438_007:0393b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又金剛手真言 嚩字是金剛慧印以諸法語言道斷故不可壞不可轉種種戲論皆滅法如涅槃欲以此慧淨除一切眾生故加涅槃點也。",
        "from": "X23n0438_007:0393b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又妙吉祥真言 麼是心義名為大空只以大空之心自證心之大空是故更加圓點此中無德不備故名妙吉祥也。",
        "from": "X23n0438_007:0393b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又虗空眼真言 以伽字門於法無所行故名為行如實道三世諸佛皆從此道來成正覺是故 伽字名之為來上加空點即是成菩提句也餘如前釋。",
        "from": "X23n0438_007:0393b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又法界真言 以囉字為心諸塵垢本來不生故畢竟常淨上加圓點言此中緣生幻相無所不遍無所不有也。",
        "from": "X23n0438_007:0393c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又大勒勇真言 佉字名為空空如涅槃經說乃至十地菩薩非其境界我坐道場知空等虗空故過語言道離諸因緣然諸世間徒見降魔之迹大此勒勇之號也。",
        "from": "X23n0438_007:0393c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又水自在尊真言亦持法身一德以於心水法門而得自在故以為名 惹是不生生義如大雲普雨遍生萬物雖一味平等然亦隨分受潤種種不同是故加大空點此點亦是自在義也。",
        "from": "X23n0438_007:0393c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又多羅尊真言 多是諸法如義亦是眼義觀諸法如實相無所不遍是以加大空點由此點故於眼法門而得自在能不以二相見諸佛國也。",
        "from": "X23n0438_007:0393c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又毗俱胝真言 婆是有義加三昧聲名有自在三昧諸有本自不生則無可捨故以大悲方便安住其中但調礦穢之病而不捨法若除病者即是損減阿字門也。",
        "from": "X23n0438_007:0393c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又得大勢真言 與觀自在相成前字加涅槃點為令出離諸垢果實成就故此字加大空點為令滋生無礙華蕊開敷故餘如前釋。",
        "from": "X23n0438_007:0393c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又白處尊真言 跛者名為第一義所謂涅槃以第一義不可得故發起大悲萬行不證實際一切蓮華眷屬皆從此生能以涅槃作種種自在用故加大空點也。",
        "from": "X23n0438_007:0393c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又    賀野仡哩嚩真言 此對蓮華三昧中普門自在之用與不動真言其義小殊故但以短聲呼之也。",
        "from": "X23n0438_007:0394a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又    耶輸陀羅真言 是蓮華部明妃於莊嚴寶乘法門而得自在故用 也字為種子以加大空點故遍一切處周給羣生是名普觀乘亦名普門乘也。",
        "from": "X23n0438_007:0394a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又寶掌菩薩真言 梵本名    囉怛曩跛抳與下文地藏眷屬中寶手菩薩意同圖中無別位次疑有複重錯誤當訪餘本勘之。",
        "from": "X23n0438_007:0394a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又光網菩薩真言 是文殊眷屬梵音   惹履抳此翻為網故用初字 為種子以此光網生不可得故名常寂光此光非色非心而具種種不思議色一一皆遍法界同於大空於此光網度人門而得自在故加圓點也。",
        "from": "X23n0438_007:0394a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又釋迦牟尼真言 婆是有義以法王三昧普現二十五有隨類之身皆為淨調諸有令入祕藏故加傍點也。",
        "from": "X23n0438_007:0394a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又三佛頂通用之 吽字義如前說 吒是慢義如來無量劫來淨除憍慢垢故證知法界平等無高下故得此無見頂相上加圓點即是猶如虗空無邊際義也亦是萬德之頂具足法王威勢自在用所以皆加大空也。",
        "from": "X23n0438_007:0394a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右白傘佛頂白是大慈悲義入 攞字門一切法相不可得故畢竟常淨此則如來眾相之頂以白淨大慈悲遍覆法界故加大空點也。",
        "from": "X23n0438_007:0394b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "左勝佛頂入 捨字門一切諸法本性寂故此是大寂之頂故名為勝大空義如前釋。",
        "from": "X23n0438_007:0394b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又最勝佛頂 娑是法蓮華義加三昧聲故須蕊具足此是如來壽量祕密神通之頂故名最勝也。",
        "from": "X23n0438_007:0394b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又火聚佛頂 怛羅是如如無垢義亦是火輪義此即如來定慧光明之頂能除暗障故以為名也。",
        "from": "X23n0438_007:0394b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又除障佛頂 賀名離諸因緣亦名自在力此是如來力無所畏神通之頂能柔伏一切眾生業垢皆令清淨是故加囉字門大空義如前釋。",
        "from": "X23n0438_007:0394b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又世明妃真言     是一切世天種子以如來如即是世間如故以於因緣得自在故勝義涅槃不可得故二十五有本不生故一切諸乘於三界中不動不出生故是故住於寶處三昧作種種隨類之身若加空點是無所不遍義種種色所為利益皆成就義也一切世天隨取一字以為種子。",
        "from": "X23n0438_007:0394b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又無能勝真言 吽字是釋迦如來奮怒師子吼聲其義如前釋。",
        "from": "X23n0438_007:0394b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又地神真言梵音謂地神為 跛哩 體(町以反) 尾故以最後 字為種子即是金剛三昧義能持此道場地令如金剛也。",
        "from": "X23n0438_007:0394b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又   計捨抳真言以一切法離諸作故名為吉祥妙業三昧 羅字是無相慧身從此慧身現加持三昧之用故加 伊字聲也。",
        "from": "X23n0438_007:0394b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又     鄔波髻捨抳真言以一切法施不可得故名妙吉祥施願三昧無相加持三昧如前釋。",
        "from": "X23n0438_007:0394c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右  唧怛囉童子真言是玅吉祥大空三昧以具萬德莊嚴能成一切義利故名為  唧怛羅餘如前釋。",
        "from": "X23n0438_007:0394c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又財慧童子真言以一切法離因緣故名玅吉祥自在神力三昧餘如前釋阿闍棃言文殊眷屬五尊各有一承教者皆用第二 里字為種子以使者義同故也第五請召童子真言梵本缺文梵音    阿(去)迦羅灑抳此請召名即是真言以義推之當用最初阿子與 里字相配為種子也。",
        "from": "X23n0438_007:0394c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又除疑怪真言自此以下是除障義悲力三昧中眷屬釋句義中   賀娑難是喜義謂以悲力拔除一切眾生惡邪疑悔之網皆使住實智中以最初見法故踊躍歡喜也當以字門廣釋之此是小心真言也用最初 字為種子或隨義便趣用一字。",
        "from": "X23n0438_007:0394c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又施一切眾生無畏真言釋句義中   囉(引)娑難是味義謂以悲力三昧開甘露門拔除生死暗夜種子怖畏眾生令見正道得至自歸依處最後 難字即字真甘露味也。",
        "from": "X23n0438_007:0394c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右除一切惡趣真言釋句義中   特懵娑難是碎義謂以悲力三昧壞滅一切眾生惡趣之障也 馱是法界義即眾生本心此心為業累所縛密緻堅固不能自出今觀法界本來無縛故自然出於累外是故加以大空也。",
        "from": "X23n0438_007:0394c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又救意慧真言    尾賀娑難總義云以種種善巧方便令得安樂即釋悲力三昧中哀愍救護之意若無慧方便者尚不能自解況解一切眾生是故以哀愍心遍學種種權巧名為救意慧也。",
        "from": "X23n0438_007:0395a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又大慈生真言 [女*它]字是長養義以入阿字門故則是一切智地種種善萌在三障堅[穀-禾+卵]中為渴愛日光之所焚灼不得滋長今從大悲力三昧中興大慈雲普降法雨令隨性分咸得滋長故名大慈生。",
        "from": "X23n0438_007:0395a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又大悲纏真言譬如大樹為蔓艸所纏交固盤結不相捨離淨菩提心亦爾為悲力所纏故處三界獄中如己舍宅無求出意故以為名 焰是種種椉當引法華火宅事明之但以假名字引導諸眾生故種種椉不可得也。",
        "from": "X23n0438_007:0395a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又除一切熱惱真言 伊字名為極無生三昧所謂一切智水清淨法性池一切聖人娑囉娑鳥樂遊集處今以悲力三昧引導生死曠野熱惱眾生同入其中故以為名也。",
        "from": "X23n0438_007:0395a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又不思議慧真言 鄔字亦是極無生三昧但法門少有差別耳以知諸法畢竟等故能以種種煩惱惡業為如來事於無間獄中受三禪樂故名不思議解脫門若入如是解脫門則能久處生死常無厭倦也。",
        "from": "X23n0438_007:0395a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又寶處真言自此已下是地藏菩薩金剛不可壞行境界三昧中法門眷屬梵云    囉怛曩(二合)迦羅(急呼)翻為寶作或云寶生以寶處為正也    釋迦牟尼三昧是眾寶生現世間處今此菩薩名是眾寶所滋生處如世間地若有寶性之處常生眾寶今以寶性心地常出一切眾生萬善之寶故以 娜字為真言以施義同於大空故遍一切處無所不出也。",
        "from": "X23n0438_007:0395b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又寶手真言如如意珠在手能隨一切求者而給與之此是地藏三昧中滿願法門也 灑是諸法性鈍義猶如圓珠無心無意無所分別而能回順眾生各得其宜若有機思於其間則終日疲勞而所應不周矣大空義如上說。",
        "from": "X23n0438_007:0395b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又持地真言猶如大地住持萬物金剛不壞境界亦復如是是萬善生根處種種事業所安立處能令一毫之善經無量劫終不敗亡 仰是大空義上加圓點又是大空以心自證心故名大空三昧此大空中無所不有即是地持萬物義也又此一真言梵本無菩薩名然撿上下諸品地藏眷屬唯有五菩薩不應有此真言似複重也。",
        "from": "X23n0438_007:0395b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右寶印手真言 頗是諸法如聚沫義如世間泡沫唯是水性自為因緣都無自體諸功德寶亦復如是唯是心水波動自為因緣畢竟不出阿字門以能照知寶性自在用之故名寶印手也。",
        "from": "X23n0438_007:0395b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右堅固意真言以淨菩提心印其性常堅固故正是金剛不可壞行境界之體 拏字加大空點即是心自證心此中所為義利皆悉成就即是建立眾生於實際也。",
        "from": "X23n0438_007:0395c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又虗空無垢真言自此已下是虗空藏清淨境界三昧中法門眷屬 賀是因義亦是淨菩提心以一切因不可得故如淨虗空遠離諸相又加大空點故遍一切處自在旋轉如風行空中無所罣礙也。",
        "from": "X23n0438_007:0395c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又虗空慧真言 囉字門一切諸垢本不生故名為自然淨慧光又加三昧大空點故如秋天萬像澄霽纖塵不動時滿月照空無所不遍故以為名也。",
        "from": "X23n0438_007:0395c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又清淨慧真言入  蘖多字門於一切法無所行而諸法如實相也以加大空點故亦復不行不分別以此妙慧心無所著遍淨普門漫荼羅故以為名也。",
        "from": "X23n0438_007:0395c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又行慧真言 駄字門是法界義以此入法界心猶如善財童子親近一切善知識具修一切菩薩行是故加三昧聲即萬行義也 囉字即是淨法界智以加大空點故於一念中具普賢道故以為名也。",
        "from": "X23n0438_007:0395c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又安慧真言安是不動不退無所畏義以此虗空無垢慧心具足一切力故獨步無畏作師子吼聲故以普門滅一切眾生戲論故以 [合*牛]字為體也。",
        "from": "X23n0438_007:0395c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又諸奉教者真言 地(引)字是淨法界義加萬行三昧聲 室哩是吉祥具德義 唅字義與成辦諸事大同 沒藍是遍一切處無縛無垢義當廣釋之一切使者奉教隨取其一以為種子或隨義用相應。",
        "from": "X23n0438_007:0395c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又菩薩所說真言以業性本寂故一切法離怨對故如如不可得故法界無塵故無所乘故離諸作故如上所說十佛剎土微塵菩薩眾等隨取一字以為真言或隨義用相應也。",
        "from": "X23n0438_007:0396a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又淨居天真言當於上文寶處三昧中說之經本不次耳釋句義中    滿怒羅麼譯云悅意  達麼是法   三婆嚩是生言此諸天從清淨法化生非同世天從業苦因緣生西方語法一切端嚴微玅適悅人心者通名    滿拏羅摩也復次以淨法界宮是淨居義從蓮華胎藏生故名悅意法生次句     尾婆嚩迦曩此翻為說回文當在句初以自從法化生能為世間說此方便也次云  參參為此真言體 娑是蓮華義亦是生義加點故莊嚴具足即是大悲胎藏以對二重淨居義故重云之也。",
        "from": "X23n0438_007:0396a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又諸   羅剎心真言隨彼趣言音說之阿闍棃不釋句義就字門有二重加 羅(引)字啖食二重業垢入淨法界腹中是羅(引)剎義用初字為真言體也。",
        "from": "X23n0438_007:0396a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又   拏枳抳真言此是  藥叉趣攝世間所傳云屬摩訶迦羅人有受其呪術者為彼所加持故好食人心故法華云若吉蔗若人吉蔗是也凡人身或有黃藥如牛黃之類若彼遇而食之便得最上成就能於一日中周行四域隨意所為然彼法亦不得無故殺人要知彼命期欲盡於六月內方得取之以幻術潛盜其心更用餘物代之彼雖失其常性猶固未死要至命期盡時乃散壞耳    毗盧遮那以降三世法門化作大黑神具大威力以灰塗身於曠野中作法悉召   拏枳抳輩而呵責之以汝常殺人故今當食汝以方便示為彼眾而吞之彼等怖畏咸歸命佛然後捨之制令不殺彼白佛言我若不食肉者如何自濟佛言聽汝食死人心彼白佛言人欲死時諸大  藥叉等競來爭取云何可得佛言聽於六月內以呪法加持之至命盡時聽汝取食為調彼眾令入佛慧故說此真言也 賀是因義以一切法皆因心有故今以 囉字門食之名為啗食人心更加傍點故永盡心垢住大涅槃。",
        "from": "X23n0438_007:0396a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又藥叉女真言句義云持藥叉女明者以女聲呼之故云 駄哩以一切乘本不生故不動本處即至道場是故此乘法性自爾離諸造作本性常寂名為藥叉義乘此乘者隱祕不可為喻故名為藥叉乘駄哩是淨法界三昧能滅種種心垢故啗食世間所餘藥叉真言非持明者印品中說之。",
        "from": "X23n0438_007:0396b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "右   毗舍遮真言  比旨是其本名隨彼趣言音故訛略耳毗舍遮是極苦楚義以是餓鬼趣故常為飢渴熱惱之所逼切因以為名若就字門比旨是第一義諦離遷變義對二種死故重言之加三昧聲言謂以大悲力故不捨苦惱眾生即於其入住不思議解脫是毗舍(引)遮真實語也右  部多真言亦是藥叉之類也即隨彼趣言音以為真言 伽去義以無所去去至三德涅槃祕密藏中成自在義重言之者究極義也當以字門廣釋之阿闍棃言凡真言不言種子字者於初中後隨取一字或隨義便取之皆得也。",
        "from": "X23n0438_007:0396b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又   阿修羅真言修羅名天以帶 阿聲故名為非天故名阿修羅略說天有四種所謂生天世天淨天第一義天入阿字門皆悉不可得故又成就最大身故是毗盧遮那阿修(引)羅義亦隨彼趣言音以為真言當以字門廣釋。",
        "from": "X23n0438_007:0396c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又    摩睺羅伽真言亦隨彼趣言音不釋句義字門可解也凡釋八部諸真言於一一字中當引世間淨眼品彼趣中十自在門廣分別說佗皆倣此。",
        "from": "X23n0438_007:0396c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又諸   緊那羅真言   賀散難是歡喜義次句是令佗歡喜義如來以金剛伎樂普悅一切眾生皆令深樂法音踊躍歡喜乃至大迦葉等堅住實際者猶能起之況餘生死中人是名法界藏中緊那羅善知識也字義如前釋。",
        "from": "X23n0438_007:0396c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又一切人真言如來為彼常樂生人中者說此人趣乘若眾生誦習之者永離惡道種種不閑處亦離上界諸天多諸放逸長壽難處即於人趣法門得自在故成大悲胎藏漫荼羅也。",
        "from": "X23n0438_007:0396c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "復次如來生身一切皆示同人法是故此趣乘於祕密藏中能建大義阿(引)闍(引)棃(引)欲令種種性欲眾生隨類得解故不解句義當觀所應度者以八萬四千相應法藏廣演字門故一一字各為種子如前一切真言所明句義且約一徒法門爾然實一一字中具無量義不可詳言得意者當觸類申而長之自在旋轉普入一切修(引)多羅中若劑所聞堅住不進則不名無盡法門也復次此無盡法門非思量分別之所能解但行者如教修行逮得見心明道時自然如善財童子於一心中普見世界微塵數諸善知識總持一切三密法藏無所不通耳。",
        "from": "X23n0438_007:0396c23_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經云祕密主如是等一切真言我已宣說是中一切真言之心汝當諦聽所謂阿字門念此一切諸真言心最為無上是一切真言住處當於此真言而得決定者如此經文本十世界微塵數金剛菩薩眾等及無量無邊隨類之身於一一門各有根本真言心真言隨心真言等猶如普眼法門不可勝載如來以普門身各各差別說已還復攝入 阿字門若不如是則諸眾生夫入祕藏者不知此真言心廣博無邊深入無際也如從毗盧遮那一念無相心中普現一切善知識一一善知識各持一法界門三密法藏今觀此一一門皆悉本不生故畢竟不出如來一念無相心中以是義故當知此心最為無上是一切真言本住之處如十方世界皆住虗空而虗空的無所依若悟阿字門是一切諸真言心者則悟一切字門皆是一切真言心皆是一切真言住處皆悉最為無上也為欲分別令易解故行者當以此阿字門遍釋如上諸真言義以阿字門不障諸法從緣生故若從緣生即是本不生義故當知大日真言與一切真言亦有差別亦無差別非實非虗非如非異於一心中明了無礙如是見時即是自見心明道即於此真言而得決定也。",
        "from": "X23n0438_007:0397a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "毗盧遮那成佛神變加持經義釋卷第七",
        "from": "X23n0438_007:0397b09_0",
        "context_with_next_sentence": false
    }
]