[
    {
        "source_sentence": "大品義疏第七",
        "from": "X24n0451_007:0276a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "胡　吉藏　撰",
        "from": "X24n0451_007:0276a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "隨喜品第三十九",
        "from": "X24n0451_007:0276a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "九品半經開為二段前八品半經受持讀誦書寫解說乃至供養般若故其福無邊今一品明直依般若嘿念隨喜不動身口得福無邊此歎般若功力轉力轉妙故令應信行也論二義生起一者上三假品命善吉說般若從三歎品中領觀四眾以來因天主廣明功德今欲令善吉復實就隨喜行說般若故有此品二者上明香華等供養得無邊福天主自慶此是我等能辦非出家人所有今欲報其自多之情明起一隨喜則其福無邊問今說隨喜為得是說般若答般若有無量門今以隨喜行說般若心隨喜故隨喜是般若也問此經明隨喜迴向與華嚴何異答二義一者華嚴是深淺觀故十迴向中有十心今此中通也何以知然下具明為阿鞞及新發意菩薩明隨喜也又華嚴明無差別差別故十迴向今差別無差別但明一迴向然彼明差別即是今差別何者要以般若心方成十也問菩薩五法隨喜與迴向何異答於他功德則生隨喜自之功德則宜迴向他功德不可迴向但有發願令迴向也問隨喜即是迴向不答用隨喜功德迴向佛道亦是也問於他功德何意隨喜答一為破嫉妬父見子利不生隨喜若見怨家受苦或生悲心故隨喜難生也二者遂菩薩本意欲令眾生作善他遂能作豈不樂哉又隨喜念過去三貪即是念故明隨喜隨喜謂般若正念又善是快道今見作善而欣喜豈不順道也隨喜具四句一者所隨喜是有所得能隨喜心亦然二所隨喜是無所得善而能隨喜心是無所得四句易明今此中隨喜通得無得一切凡聖善而菩薩隨喜心是無所得耳問此隨喜與四等中喜七覺中喜五受中喜十八支中喜發同異耳問菩薩已修行何故更隨喜迴向答菩薩自修行更迴向者欲增廣此行也而隨喜者他已修行令於他行上更脩行也又餘施戒是動身口今是靜嘿行也又上受持等多有自行今是化他行受持通三乘行今獨有菩薩行也。",
        "from": "X24n0451_007:0276a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "問隨喜如是懺悔云何答如般若觀隨喜無福不生無罪不滅他云有假名眾生造惡故教其懺悔今明直見有眾生已是虗妄而後其起善滅惡以自作此解後自教他是三虗妄淨名云當直除滅勿擾有心了眾生尚不可得有何惡滅善生耶品三隨喜是菩薩妙行故彌勒開其宗須菩提說教之主故次演之隨喜深妙非佛不盡故如來述成更須宣釋三聖共陳乃窮其妙初五一彌勒以五句開隨喜之宗二善吉領隨喜之宗三受定四設二難五答二難也五句者一隨喜二迴向三與眾生共四無所得五稱歎隨喜隨喜如前迴向者師釋此一句云迴其所向一切疑心皆有所依皆有所向故今迴其此心令畢竟無所向乃至向道了與眾生共須識眾生菩薩本來不二故有共義論云固不可共若可共者佛將上共與眾生而更作之也若自行施戒復教人行亦是共義也今以此隨喜迴向果與眾生共他無所得通貫四句也若聲聞偏袒下第五稱歎隨喜為二初對二乘凡夫四種福但稱歎何以故下第二釋歎正言凡夫二乘福德為自菩薩功德為他優劣師云假令有所得為他亦不及此中隨喜今大判作自行化他優劣也戒為自調定為自淨智為自度又以聖道三種戒為自調正念正定二為自淨正見正思正方便三慧為自度又施為自調戒為自淨智又自度如百論三根行施戒智也。",
        "from": "X24n0451_007:0276c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時須菩下第二領隨喜義定宗五句中不領與眾生共及無所得俱領隨喜迴向及稱歎三句也為二初領宗二定宗領宗中二初所隨喜福德次領能隨喜心領所隨喜福德中論又云四段福德總持師釋云此中明三福過去佛及弟子福德從戒眾以去明現在佛及弟子福德從及領眾生攝善根第三明凡夫福德今謂其人講論而不見文可謂於盲者前現眾色像也論明四福不明現在未來凡聖福但明過去四福也所以不明二世福者略舉一世具四種福則知餘二世二世具四種也二者正領就過去致難過去四福皆滅無而生心隨喜則墮無而謂有顛倒過也故不語二世四種者一過去佛福二過去佛在世時弟子福三過去佛像法正法中得道弟子福四總明過去佛在時滅度後人天及畜生等福過去以領處論云凡三種一切發心其未得佛此菩薩時福也二得佛時福三滅度至像正末法滅時福也應六般若波羅蜜下第二明過去佛現在時所化弟子福也應六度大乘弟子福也及諸聲聞人者此下小乘人福也初總明凡聖即七方便聖即四果下學無學別得聖人也諸佛戒眾下上雖總明過去善根今復別出也所以更別出者以諸佛無量善根故我彼像正像正眾生稟悟得道別列也是法中學得須陀洹下第三明像正教中學得三乘道果善根也及餘眾生種善根第四過去佛在時及滅度人天乘善根及畜生等善根上是三乘今人天乘更及餘道善根故後列也是諸善根和合下第二領能隨喜心前領隨喜初句及第五稱歎句如是隨喜已下領迴向也若有善男子下第二定宗定宗中前領有所得隨喜心次正定宗生心能隨喜也心生緣者緣之所四福事有福德本謂造福之人及起福處也可得不者第二正定宗也論云就畢竟智難也有所得心與所緣之福相稱以不此念意明隨喜是有所緣之福是無所得成隨喜義以不。",
        "from": "X24n0451_007:0277a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第三彌勒受定云不得如所念者論云二因緣故有所得隨喜心不稱隨喜福也一者過去佛為功德久已滅無遺滅無宿命智或有而不及但如聞憶於分別故不如如所念二者諸佛及功德出三世如來涅槃相行者作有所得心分別言有四種善根及能隨喜心故不稱所隨喜福也前就事為論自明無三世三世義過去不滅滅義而行者於謂無而言有故不得如所念餘實是三世義而行者亦總謂言福德各有二義但失也。",
        "from": "X24n0451_007:0277b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第三須菩設二難北人云初就無常行難二就畢竟空門難次解云初者奪難次是縱難奪難奪其能緣之心所緣之福皆畢竟不可得有何能所耶有解云就內設二難若從理為論則無隨喜若不從理則墮顛倒次解云直就有所得作難若言能所是顛倒如見有二事則是有所得也今明此文論難也望經論始終還歎彌勒無三世三世義三世二義也上既開此二開今歎還也初難無三難三世次難三世無三世難無三世三世者若言過去佛及善根滅無而菩薩生隨喜心則是無而謂有便墮顛倒也次若諸佛善根非三世則能隨心非三世能畢竟不可得有得隨喜初難為二前難次舉四偈為解也過去無佛以有佛無常謂有常三倒生斷二時不得生時前於資心復見此是從微至著於常心佛常解決定是常也斷時先斷見次心想斷時從重至輕也故見諦斷見倒學人猶有想心雖暫起想心憶念觀解即隨滅也凡夫具三也(云云)若如緣事下有人云此是第二縱難縱有能所何者是耶故一一責覔不可得也北人云畢竟空難也復師云順道理乖道理無如此能所也今明是第二乖上三世無三世也如經如事者所緣福德如實畢竟無所起事處亦畢竟空能隨喜亦如實畢竟空菩薩心亦空況何處起隨喜耶何等是緣者一一責覔耶。",
        "from": "X24n0451_007:0277b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次彌勒第五答二難北人云先答畢竟空歎次答無常歎歎則先無常後畢竟空答則先畢竟空後無常者一解又勢遂近故爾又解無常劣畢竟空勝難家以修行次第先劣後勝答家遂說次第先勝後劣也縱奪家云次第答先奪後答縱此解大悟亦明前答後難後答等難遂其深淺亦隨文勢無三世難深故先答三世難淺故後答難家先難三世後難無三世也從淺至深也今且論兩答始終明隨喜義大意若定言有三世過去已無亦非隨喜義若言無三世無所亦不成隨喜義要淨如此有無二見畢竟淨於畢竟空中就後論假名能所能所宛然而未曾能所雖未曾能所而不失能所義如畵空文藻宛然而無蹤迹也問隨喜義則能所無能所取無能所能所答得意為言取無能所能所義故成隨喜但就能所畢竟無蹤迹也答中為二初明正隨喜迴向邪隨喜迴向義第二明堪聞不堪聞義亦是第一明菩薩過去三多具足亦生巧方便學自相空了達能所不有非不有非二非不二即是正隨喜迴向也問何故言巧學自相空答能所宛然而自相空以巧學故雖能所而自相空雖自相空而能所無方便者則隨有無二見也次明無方便邪隨喜迴向有所得邪迴向人過去無三多今世外不得無所得善知識內文不善學有相空或言能所定有或言能所無或言能所二或言即不二故皆是有所得不來正隨喜迴向也如是須菩不應為新發意菩薩說第二明堪聞不堪聞初明不堪聞非信樂當妄失云始行之人忽聞此畢竟空便作空解生斷見既畢竟空何用脩行故悔從來作善此人進不得於般若退失昔有得善根也當在阿鞞前說此明皆聞也當為二種人說一阿鞞人未得阿鞞內有深信外值好師能信不怖怖由我生亦由心生我之與心本不有誰耶自本不有今常是無故得正觀不墮斷見中也。",
        "from": "X24n0451_007:0277c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "須菩提菩薩用心盡滅下答第二無三世三世難二周答之一二答中各有無常門實相門也是心盡滅者無常門也既言諸佛善過去已滅即現在能隨喜心今滅既滅則無所有無所有故亦無所故即入實相故云何等是緣何等事即是因無常入實相也二心不俱下第二周先明無常後入實相也二者隨喜心即因心也菩提心即果心也有現在隨喜心時無過去佛菩提心也下因無常入實相也豈有現在心始生過去心滅耶。",
        "from": "X24n0451_007:0278b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時釋下第二須菩明隨喜義彌勒云為阿鞞說次阿鞞者說眾中始行之流望崖自絕故須菩一周但明始行人隨喜義引始行人令其堅固也為二初天主三問須菩三答次彌勒二問須菩一答初問隨喜深遠以何因緣方便誨導新意人令不怖畏第二問云何令新發意自起善根三問新發意隨喜用佛之法復云何答三問即三答初問明簡釋新發意明此人發心即學無所得復值好外緣曲巧示其得失之行得道令利即其事也外緣中三事所應行謂無所得大乘觀也二示魔事所不應行有所得也三念其心不增減也可差有得無得耶正約迷悟二緣故有了諸法本來曾有如此事故心易動也是菩薩亦常不離佛答第二問以上信悟無所得故生生值佛所值無所得善根乃至菩提也復次發意下答第三問以於佛殖無依善根故作無得隨喜也凡七句一斷道謂得□死道入無餘也二斷戲論偏斷諸見也三道盡去入無餘時捨八正道也四棄重擔偏捨五陰五陰具因果果入無餘時捨因有餘時捨果也五滅聚落出家要依俗其以有待之身須食故也俗舍有食復有五欲刺故著定慧處踐五欲刺令折名為滅也亦斷有結者上斷戲論等是橫論今竪論即謂三有結不出五下分五上分欲界五下分上二界為五上分也正智得解脫者結習俱亡正智得脫故異上但斷煩惱得脫也。",
        "from": "X24n0451_007:0278b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時彌勒下第二彌勒二問善吉十一答初問七答次問四答初問上善吉答天主第三始行隨喜義也北人云彌勒還用善吉二問初用前無常問次用畢竟空以釋之還用前奪縱二難前已用竟今更用者誡善吉意也我前已釋竟汝今何解以不也今諮此言何爾大淺耶今明此是有所得難故異也有所得反覆成二關若始行人言能所則墮三倒作能所想即想倒乃至見能所則見倒也第二難云既不倒則無能所云何成隨喜耶答初問七復次第一就能所不生心答上問以不生佛想即不生能所想以不墮想倒既無根本想倒豈有心見倒耶若菩薩下第二隨喜迴向盡滅空問答若此能所畢竟盡滅無縱迹處所故名盡滅論云說諸法實相為滅非無常盡滅也問若非無常盡何故不直作實相門說答因此無常盡滅無所有故即是實相若直說無所有其義不顯今明以無所有者良由現見無常盡滅故知無所有也既無所有亦無所無如是五故名實相也第三復次總說一切凡聖善根自性空門答以皆是性空豈生三倒耶第四復次別就善根迴向性空門答能迴向善根所向佛道此能所皆性空故不生三倒也第五復次論云前明過去事今明現在自所起隨喜福德自相離問答也自所起隨喜福德是無所得善根故離陰入界有所得故不墮三倒也第六復次就善根起隨喜福德自性離四答非但善根離有所得陰入亦無所得善根自性離尚離無所得善根豈生有所得三倒耶第七就譬喻門答明菩薩能念如所念所念過去佛善根既非相非無相畢竟寂滅能念亦應如是故墮三倒第二段彌勒重難北人云據畢竟空難復言是奪難今明如前上言若有能所則墮三倒今明若不墮三倒則無能所無能所則無隨喜亦無迴向今云何得不取相而迴向耶此意明云何不取能所相而今隨喜宛然成耶。",
        "from": "X24n0451_007:0278c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次須菩以四義答之一者以般若方便力答論云須菩不得定答處故但云方便力也若言有能所則墮三倒若不墮三倒則無能所今憑彼般若方便力籌量得失得離上二過也能所無能所豈墮三倒無能所能所宛然豈失能所故有般若不墮有無中也文二初明般若方便故得次勸思惟失也何以故者釋前若是福德離般若方便不得迴向菩提義何故離般若不得迴向言何以故菩提實汁隨喜是行般若實是此福德既離般若實道何能迴向何以須菩不離般若正以般若心中法相不可得故善根有實也善根既離般若何能得菩提耶應如是思惟下第二勸思惟失心成得也凡勸二思惟一者取相有所得諸佛所不許也若有取相下第二初思惟若取相有所得則違理諸佛不說大利益此中法譬如文譬如下譬說無利益有所得隨喜但得生死人天樂小利不得佛道之大利也食是隨喜福德毒無取相愛見等煩惱生得人天福樂為好色得名與富貴勢力為好色也無智人是始行有所得菩薩也食之歡喜者愛人天樂時悅心食欲消時若死等苦者無常至時憂愁遂死及以死苦也自失命為死失樂具以為次死又失慧命為死妨行善道為次死也不淨受下合譬也此中先釋作有所得隨喜所得也修有所得法師教化失也不淨受者但著語言也不淨取相者不如此分別得無別也不淨讀誦者亡失句讀若自失若受不具足也不解義者不得經意也如此之人自悟後悟他也。",
        "from": "X24n0451_007:0279a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "求佛道下第二如諸佛所知善根答明如諸佛智慧得知善根我亦如是迴向佛既不取相我亦如是也故依佛必無悟心付地天不中也復次求佛道下第二如諸法實相迴向則勉取相復次菩薩應如是念下有人言此復次據佛本為菩薩時所為迴向故不取相也又解上就佛所知善根今就十方佛能知智慧答佛既不取相菩薩心亦復如是也。",
        "from": "X24n0451_007:0279b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時佛讚下第三明隨喜深妙非佛不窮故述成二人而佛更說也又二第一讚成前說格量顯勝二者如來重說顯隨喜廣妙唯佛能窮初三第一述成格量二諸天領悟供養三佛述諸天重格量顯勝初二一讚述成二格量成者通述彌勒須菩而言囑須菩者非人而說大道故可讚文恐人說有失印成彌勒大人說大法又位居窮學故不須歎也格量三初舉教化定散供養二善根格此化他格也亦舉供養小乘極果格量三舉供養大乘初心格後二自行格也小乘中因多而施主一人大乘中十方施主供養大千初心前舉小乘後亦舉大乘初心也次第二諸天領悟具財法二供養亦滿中三果方便力故即須答彌勒中第一方便力也第二佛重述諸天領悟重益有人解云佛應護前三格次舉所有次隨喜格但未及次說而諸天來故今方說也前非隨喜格隨喜今舉隨喜格隨喜非但有得不及非無得而多有得不及非無得也。",
        "from": "X24n0451_007:0279c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第二佛重說為四一請二說三格量四格迴向往生如文佛重說中為二一稱實相隨喜二與解脫中隨喜問上二人已說佛何故復說耶答欲讚隨喜深妙唯佛能窮也又上二人廣說難品佛今格廣為略但開二門一稱實二與解脫等今修行之易故不意隨喜明不取不捨今中道門也第二與解脫等明然脩萬法與解脫等心應此理而能迴向是聽說說門說中之一安豈過法聽也二格量者古解云格上須菩隨喜也而文實似而意通也上舉供養而心格今舉大千復格上舉大千悲用少也今舉十方佛田多也三者上直明供養初心今具舉佛及弟子也四上舉供養時少今明供養時長謂佛在及滅度後也第五就明隨喜迴向如文以始行人有得心強無得觀弱故更可寧勿起有所得為正迴向也。",
        "from": "X24n0451_007:0279c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "照明品第四十",
        "from": "X24n0451_007:0280a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此第三歎人法美人因說般若也三周辨般若體九品半明所生功德用既歎故稱歎也為二就此竟遍歎五品初歎於法聞持半品次美於人歎法非無美人美人非無歎法但隨像顯從多為論也為品初涉大開五章第一歎般若照窮實相妙極圓明過無不盡德無不滿第二般若過無不盡德無不滿故信之者得無邊之福毀之者得莫大之罪故雙舉信毀稱歎般若也即信毀品了也第三從信毀品末須菩白佛是深般若其歎淨品將未畢竟故無始空故釋所以信得大福毀得大罪者良由般若甚深故即甚深行歎也即出信毀之本第四歎淨品中若菩薩作是知下盡無作品行汁歸人明無為無作行無不成說無不益即能成德行歎說般若也第五遍歎品以行無不成說無不善故能導引諸行皆對般若岸遠離究竟歎也品若為二初四品略歎遍歎一品廣歎照明品者從初故作名畢竟遠離顛倒無明照諸法實相明耳故云照明也但此照非是有法故照乃見無照為照就道則未曾照不照亦未曾見不見而有照不照見不見用以其有見故能令眾生本所不見得見以其有不見用故使眾生所見而今不見也此品亦云生般若品從下文眾生得悟般若故於緣名生也為五一歎般若二供養般若三生般若四信般若五重歎般若初歎者由般若故隨喜義成故知般若無過不盡而無德不滿也既知般若功德高明其德如是必須依順崇重[牙-(必-心)+?]受其法故第二明供養雖復供養生福猶未了悟發慧是故第三次明生般若也般若所以得生必由深信故第四明信般若也既信悟則疑復歡喜第五重歎般若能離諸邊照窮相所以名為摩訶也。",
        "from": "X24n0451_007:0280a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初有十七句第一句能成隨喜歎有解云是般若者以須菩上答彌勒所以能隨喜迴向者以有般若方便力故能取相迴向也時會聽者於須菩所說未能深信是以而言是般若也問取定體後歡之欲命虗衿而取信也論主云上四聖共說無得隨喜迴向得無邊福身子在座雖復無言而聞說歡喜為欲利益時會故從座起稱歎言能如此無所得隨喜迴向利眾生得入佛道者此是般若功德故佛印成云是般若也第二句淨明歎由般若故眾界畢竟淨而明照一切法謂五法藏三世無為不可說也從此下十五句歎般若非但成隨喜廣有無量功能也第三句明歸崇歎由般若能守護菩薩能令離諸苦煩惱能滿所行故可歸崇故言應禮般若也第四句無所著歎以三界中三毒泥不能汙故言不著三界也第五句能除煩惱歎謂愛等百八見等六十二般若力能除上竪論斷三界惑今橫論能除一切惑上明惑不能累今明能除於惑也第六助道最上歎上既除惑今能助道由般若故能分別道品不以般若道品不成故助道中般若為上也第七能離苦果歎前明離惡因故今明能離生老病死苦果也第八總攝五眼歎惑因既滅苦果亦亡故開行人之目五眼圓明也第九顯示中道歎行人五眼既開道不明見正道第十能成種智歎既見正道便成種智也第十一能生菩薩歎非但成果德智亦能生因中菩薩也第十二無生無滅歎上雖歎滅惑滅惑本性空竟無所滅雖言生佛菩薩竟無所生也第十三拔苦本歎斷常見諸見是結本結是生死苦本上既有不滅不生則知不常不斷斷常本息則苦果斯傾也第十四與樂本歎上既明離苦本今施樂本樂本能令眾生信實信實故生諸善寶此施因寶以善因寶得世出世樂寶故言無救者作護也第十五不可破壞歎般若無一豪可取佛尚不能破況餘人耶第十六無轉無還歎不轉生死中不還入涅槃又不生故不滅故不還一示轉生眼智明覺二勸轉亦生眼智明覺三證轉亦生四行故十二也第十七能離有無歎正法性非有無也。",
        "from": "X24n0451_007:0280b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "云何供養下第二明供養為二初明供養二釋疑初中三問供養之方二答問供養者有上十七種德故須供養也又般若無一豪相可取未悟之徒求其定相不得便生輕慢故身子問云何供養也佛答如供養世尊者無始來深著人相於法情符故今言欲供養法當如供養至人也般若不異世尊者論云般若變成佛故云不異也爾時釋心下第二釋疑為四初疑次釋三歎四答疑身子何故問供養般若不疑上十七言者舉後例前也釋疑正引須菩後答彌勒四義中初般若方便力成隨喜義釋也以般若力能成隨喜入事故問供養般若也次舉般若道五重釋疑何故以般若力成隨喜不言餘行力勝諸行故也又般若力非但能成隨喜亦能遍導眾生行故復此文來也譬法合也但應言五盲而云百千去導力少不足貴故顯導多也略明五章賢劫三昧中八萬四千般若波羅蜜廣則無量也他云引導即引今文為證文云開導則引涅槃金錍決其眼瞙為證今且難引導義若未有般若已有五生亦應未有般若已有五方成若必由般若五方成亦應必由般若五方生也今明般若有互相成互相資互相導何以知然云無所得中一切行皆是般若般若故一切一切行云何不能相導耶若有所得但五不能導般若亦不能導今文明無優劣優劣義故偏歎般若為導也導喻七地城喻種智此就大乘為論也又云道喻八正城喻涅槃此明小乘為論也無般若大小乘俱不成也釋問下第三歎則有三初領弟子云言若無下第二引佛言明[牙-(必-心)+?]相資成亦應[牙-(必-心)+?]相導也若爾者下第三正設難也第四答中為兩初述印其互相資成如文但菩薩下正答難[牙-(必-心)+?]相資但般若為主如雖有眾業相資聚為其主名為聚散也。",
        "from": "X24n0451_007:0281a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "白佛云何生下供養但生福也若不了悟無由發慧故問生也般若未曾生不生緣生故不生緣悟故生佛性得失須顯亦爾此義與由來相反由來必須會真諦生般若又見有諸法可生如此豈生般若耶今經正對由來若能了境智真俗一切法畢竟不生乃是生般若也具足論四句一者一切法不生般若生如前也二者一切法生般若不生三俱生四俱不生也文為二初明生般若不生般若義次明合不合釋成生不生義初兩問答如文第二身子問與何等法合下第二也文為二初明有方便合不合皆得義次明無方便合不合皆失義初中兩一身子與佛論合不合二天主與佛論合不合亦是初身子問既生般若必去真諦境合亦與實相會佛破云一無所與合方生般若也若有一豪法可與合者界般若不生也次無已問問一不與菩薩共若合者無已尊敬般若故問云行般若因得薩婆若果因變為果果因與果合故佛答云般若亦合果亦不得也此二番破天主及身子合見也次兩求破無合見也下天主聞此領解知般若遠離有合無合等法生滅取捨見也第二須菩提問明見合不合見皆是無方便初須菩對上無合不合是方便即明見合不合是無方便也次佛更泯此見若菩薩言教若無合無不合作此無見復失般若也。",
        "from": "X24n0451_007:0281b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "白佛云何信般若下第四明信般若就行門則先信後生若說門則先後信般若所得生由自深信故明信也亦應倒生四句名信一切法若信般若二應一切法不行般若三俱信四俱不信也有人從此即屬大段故明信毀以得般若開為二初明信二明毀信中三初明信之相是二明得解歡喜三出能信之人今問此中明信般若見屬信毀段先明生般若何不屬信毀耶今作此開亦無大失也且屬此品第四明信也此文近生者從上明合不合失般若非合不合復失般若則般若無一定相云何信耶答如文。",
        "from": "X24n0451_007:0281c10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "白佛名摩訶下第五領解稱歎上十七句歎般若妙用無方若虗心迴向功超世表今復歎者以般若生信之時要須體悟諸法然後乃能生之信得成立故名摩訶就文為三初明般若妙契中道遠離有無即是有方便得義二明不會中道則著二邊即失三舉十門釋成得失初二第一正歎般若不著有無第二明若福慧圓修便能不著即釋前義也初三一謂正歎二佛及問三須菩舉十門釋歎因緣初作摩訶歎時言常有信真諦境生般若有般若是空慧從境生如此信般若佛上已行般若則不信如此境智等一切法則不信般若時眾時聞此疑除故須菩即領解稱歎言能如此於一切法皆爾不信始是大智慧也佛反問可解次初菩舉者釋歎因緣所以名摩訶般若者良由離此十種見故若不離此十見非摩訶也十見者謂大小合散量無量廣狹力無力也微塵為小世界為大聚成麤色為合散歸本塵為散假想觀云色遍一切處為廣不遍為狹假諦等無力總有心為有力皆無此文也非大非小名摩訶出此文也問今歎摩訶何故乃云非大非小耶答此明本義也良由道未曾大小故非大非小歎為大故知此大是名大大也若新發意下第二明始行之人若福德圓修則不著有無釋上義若但行般若空觀則墮無見中偏行五度有行則墮有見中要圓修六度空有調心則不墮二見也。",
        "from": "X24n0451_007:0281c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世尊若菩薩能如是知下第二明不在中道著二邊之失對上偏行若但行般若空觀則見無大小故墮無見中偏行五度則有大小墮有見中也文中但明作大小為失不明無大小為失者依論解意此是略舉一邊也下無菩提失界也前是失因也。",
        "from": "X24n0451_007:0282a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "所以者何下第三舉十門釋成得失義也既稱所以者何故知是釋上得失也十門中一一門三一眾生不生為例二舉色不生為例三舉佛不生此三即攝世出世及法兩雙義盡也又此十門皆是俱不生句上明色不生故般若生今明色不生故般若不生恐言有般若可生故今明般若亦不生也最後力不成結門來者時會皆悟般若故不作大小乃至不作力無力便言由般若力故發此觀門故知般若有大力所以泯之般若何曾力不力耶。",
        "from": "X24n0451_007:0282b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "信毀品第四十一",
        "from": "X24n0451_007:0282b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第二明般若過無不盡德無不滿故信得大福毀得大罪亦遠從大段生上三十品明般若體合前十品半明所生功德今明毀般若故得大罪也般若何曾生不生亦曾福之與罪信之故於緣得福毀之故於緣獲罪也問信般若生福般若為物作利因緣毀般若生罪般若應與物作起罪因緣耶答般若豈令緣起罪緣自於般若起罪也大經云有人日出則作罪不出不作罪日可有罪耶問此亦同疑日若不出則不作罪若無般若則緣不生謗也答雖因般若生謗因此謗終得悟也信毀兩明故目品又云有所得即是毀故言信毀反此亦無所得毀即是信以其毀有所得信故也。",
        "from": "X24n0451_007:0282b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "品明信毀即二段就信中為三初明般若甚深久殖三多方能信二歎所信般若離於聞見三明始行之人亦能信受初有問答問來著上品既明信般若故今問信之所由也問有二意一問信解所由即過去行因二結問現在聞能信解初四問一問其人來處二問發心幾時三問供養幾佛四問修行幾時初問來處是問果必應好世界來下三問問因也能隨順下第二結問現在能信解也有人以此五問者不得經意也復有人云此問緣上問因亦然也上言問曠劫脩因故現在即信解也豈是問緣耶佛答問為二初答過去行因四句二答現在聞二能解問答四句即四先答第一問次答第二問次答第四問次答第三問如文可尋也是菩薩若見聞下答第二現在聞即信解問也是人見經卷即歡喜即如見佛開經卷即見理如親從佛聞也下治能隨順深般若也無所得故釋隨順也。",
        "from": "X24n0451_007:0282b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "須菩白佛般若可見可聞耶下第二明所信般若絕於見聞上云見般若如見佛聞般若如從佛聞恐時會言般若可聞故泯其此心也諸法鈍故釋不可聞見惑者謂六塵為鈍六情為利次云六情為鈍智慧為利今且此分名鈍也。",
        "from": "X24n0451_007:0282c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "須菩白佛幾時行佛道下第三明始行人能信解般若也前問次答上身子已問今更問者論云前六行中明般若可聞見次言般若不可聞見今問二事菩薩幾時行得是方便能行有能行無能行無不墮斷見中行有不墮常見中故問佛也古釋云上但明久行能信則始行之徒便爾自絕今明欲明始行而能信久而不信息其自高之心於不足之者故請佛令分別所以更問也佛答顯分別者以義不定可具四句一者久行信始行不信二者久始俱信三俱不信四始行信久行不信不可一途也今文但二句一者久始俱信即是學無所得人也二者久行不信久行不信是有所得人久行有得既不信始行有得即可知故但明二句也始行信二義一者識有所得無所得二者其人不見得無得其人不見得無得耶正等異也。",
        "from": "X24n0451_007:0282c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "有菩薩多見諸佛下明久行不信即第二段明毀般若上久始二人皆是行義也文三第一明久攝不信之因發言毀謗深法成大惡業第二明受於重苦不治劫數第三勁桶三業兼辨毀謗之意今是初便從眾中起去者或可心去身亦避席如法華五千之徒或可身在座而心避不欲聽聞也問直作有所得學未非拔無所得是謗以不答已是但輕耳問好心作有所得學言是學無所得般若此人得罪不答不得罪若惡心謗則得罪論云如調達惡心出佛身血則得罪耆婆好心治佛身血不得罪不信故謗則得罪愚癡不解故謗則不得罪。",
        "from": "X24n0451_007:0283a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "是人毀三世諸佛一切智下第二明得苦果為二初明受苦果二論重輕苦果中二初明正報次明餘報正報者三千大千百億阿鼻獄此人一劫中受苦竟遍歷十方大千地獄此間世界成從他方復來此間地獄中也憂愁是心苦苦惱是身苦也餘報中但說生畜生不明生餓鬼者破法人二因緣一瞋毒二愚癡以無貪慳故不生餓鬼也不欲見般若故生盲人家輕說法人故生下賤家此言毀說法人故無舌不欲聞故無耳摩手非拔故無手也五逆罪相似下第二論輕重前論因此論果身子常聞小乘五逆一劫受苦今忽聞謗般若受苦時長苦故問相似佛答二事懸遠故不相似也如煞父母但違一世恩故一劫受苦破行般若菩薩無違久劫恩以菩薩於無邊世中愛念眾生過父母父母不能以眼施子菩薩以內外物盡施之煞羅漢出佛身血但破肉身破般若是破法身壞僧見離眷屬讚五法亦不破般若故不相似也墮衰謁者如人著衰雖好衣美食無色力雖懃身作業財物日秏此人破般若雖身口持戒布施坐禪誦經終無善法也問有五逆人信般若得滅罪不有持戒人毀般若得生天不答五逆人必不信般若如世王改往依般若懺悔罪亦得滅故前云惡腫癩創是其事也可具四句一持戒而信般若二破戒不信般若此二易明也三破戒而信如五逆二事一者破戒必不信如五逆人不信第一事也二者破戒人若改往如王信懺悔者亦得罪滅是第二事也四持戒而毀如前受苦也次曰持戒而毀者如精持小乘而聞般若不信而謗此則入阿鼻疏文前列尋之也黑性者善為白故是黑也不說身大小者論果也佛二義故不說一者若說其身大小則人絕不生信亦受是苦二者若說其身則毀般若人聞便受若死及死等苦也問既說其時長何不說身大畏事若不說身大畏事者亦畏事不說時長答此通誡已謗者今除過今未謗者謗故說時長欲引接已謗者令其改悔故不說身大也若說即死於事無益也問涅槃經何具說五逆業時長身大也答。",
        "from": "X24n0451_007:0283a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "白佛應好攝身口下第三勸攝三業即出毀因前勸攝三業意是口而言攝身口業者意是口業本既攝意業則身口亦善故說好攝身口又手非拔亦是身業也品明專是口業得大重罪也出家受戒者此具二義出家者謂五眾也受戒則攝七眾七眾與五有所得小乘人破般若也論主云佛滅後五百部報自法決聞般若中畢竟空如刀傷心如此之人處處破般若也四因緣者初為魔所便謂內有煩惱魔外天魔入心故毀般若也第二因緣的是煩惱魔謂堅著邪見鈍根不解佛意第三因緣者外值惡師內復有懈怠第四因緣世世習瞋瞋是不信相自高輕他我智慧非是尚不解說汝能解耶以瞋及慢二事故毀也。",
        "from": "X24n0451_007:0283c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "須菩自不懃精進下第三段歎般若甚深明信毀之本也以難解故敢毀以甚深故信得大福為三須菩歎般若甚深三脫人不同故有三說亦三相不同故有三周也又佛泯縛解境智因果以明淨義即淨然身子歎深淨明有妙用善吉舉眾生以說法因淺以明深也一明泯縛解故甚深亦畢竟淨非深不深於緣不了故名甚深也初二句第一明兩問答舉三緣故不解般若故深也佛答不縛不解者無別般若故深即諸法無縛解是也所以信毀之末明無縛解者良由諸法未曾縛解耶正故歎有知成毀也二者既無縛解何有信意亦欲泯信毀也白佛下第二明般若非深不深畢竟淨於緣不了故名為深也須菩舉甚深問不懃習無得觀為不懃進也不種般若分得善根為不種善根也與破般若惡師相值為發相得著世樂不得出世為懈怠也煩惱亂心為喜妄不解分別諸法實相耶正名無巧便慧也佛答明八緣繫屬於魔惡發相得但是人中惡師今是天魔眷屬也就答中為二初明因果淨二例一切法淨色淨者諸法實相淨即境淨實相生般若果故般若果亦淨淨此因果境智也論云色淨是身受心法淨也果淨者是四念處謂無常苦無我此果亦淨也此約五陰作也菩提淨果亦淨者菩提屬行陰終是四念處也若約般若境智則如前也我淨下第二歷法例明淨義也。",
        "from": "X24n0451_007:0283c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "歎淨品第四十二",
        "from": "X24n0451_007:0284a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此第三身子歎般若深淨為信毀之由凡十門歎一甚深門歎二照明歎三不相續歎四無垢歎五無得無著歎六不出歎七無知歎八一切淨歎九無損益歎十無受歎一一歎例四句一歎二述三審四答問雖有十義勢有三第一就甚深理歎此深理能有妙用謂能智能滅煩惱等三泯其以智照也初甚深歎者身子知般若雖復念想觀除言語法滅為毀之得大罪信之得大福故歎云甚深也佛述畢竟深者以畢竟淨者名甚深也自有智淨境不淨智不淨境淨今內外並冥緣智俱寂謂畢竟淨也又體此淨人謂十方三世佛十方三世佛亦不著淨如□是畢竟淨又體此淨能與一切樂實無所與能拔一切苦實無所拔又是畢竟淨也次重審何法淨者恐或者謂真諦理淨實相自淨故問也佛答口心色畢竟淨真勿真諦置餘處餘處則於緣無益也。",
        "from": "X24n0451_007:0284a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "是淨故明者第二歎以體斯淨法故發生明觀即般若觀也即第二歎淨用不不相續第三不相續歎既得般若觀明則生死不續謂無餘涅槃也文云不去者既不相續五眾不去其後世也無垢下第四無垢歎明諸煩惱不能汙此淨法及般若觀也第五無得著歎者小乘行此淨得苦忍其道比忍比忍為著苦忍為得大乘行淨明得順忍次得無生忍為著順忍為得也今畢竟淨中未曾大小何有深淺得着異耶第六無生門歎者明一切法無生異上無餘也既其無果也下三界明無生處也第七除也既其無因無果也下三界明無生處也。",
        "from": "X24n0451_007:0284b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第七無知問歎即第三泯於知照也諸法鈍故者有人言真理既鈍般若從理生亦鈍也色無知者□理無知故不能實成般若智也今謂不爾即般若大智竟無所知也一切法淨下第八明一切法淨也第九無損益門歎上身子問佛答之時言貪着般若能行般若能行般若得薩婆若故因能益果作無損益歎也第十無受歎者既無益無損則無緣無觀故心行斷所以無所受也從無知其淨淨此淨知即淨因也無損益淨其果無所受明觀心滅也次須菩說淨者佛為法王身子次佛今教主故說也又佛已說淨體身子明淨用於義是同但欲令易解故舉易曉難了諸法所以淨者如我也佛弟子誰不知我淨也今諸亦然也問我是橫計可淨耳諸法非橫云何答若約謂情俱是橫也豈不俱淨答約佛教假名為言諸法既假名我假名也故進退無異問叵復果不答我是橫謂故畢竟無此法所以言淨今假名因緣苦結而畢竟淨故借我為喻也又弟子明淨故人淨今明人淨故法淨又上法淨故般若淨今人淨故般若淨又身子一無量門明淨今就無量一門明淨不辨淨有多因也此中二門一以我淨二我無邊總顯萬法皆淨論文委釋也。",
        "from": "X24n0451_007:0284c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若菩薩皆如是知下大段第四明結法屬人行無不成說無不益就文為三第一明結法屬人二明人行此法故行無不成第三今明若說此法故言無不益也初結法屬人者上三聖說般若深淨今明若能如是了悟則名菩薩非凡夫二乘然般若末曾屬不屬但不屬礙屬則菩薩也聞如是知者即知畢竟空無始空名為般若也般若非屬下屬假名屬般若非空不空假名為空故目此為二空以為般若也次須菩提問意者論釋此是難畢竟空若菩薩行畢竟空則應無所知佛答菩薩知道種故知諸法何曾畢竟空不畢竟空但為破眾生有病令悟畢竟空了菩薩雖行畢竟空無知而無所不知二乘道名為知道種故也豈如二乘沉空耶色不知也等者須菩提難意明菩薩既有道種慧則有能觀智慧應不空也佛答明所觀既空能觀之道種慧亦空也不作是念我施與者上明色不知色等此是外法謂受者及財物是外法故也今不見我即不見與者與者是內法空也下來十三空釋此義十三空是別破法盡後五空是總破諸法耳。",
        "from": "X24n0451_007:0284c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時下等第二既結法屬人人行法故行無不成為三一自行成二化他行成三二行雙成菩薩位不假外護初二第一明菩薩事無礙行二明礙無礙兩捨行勸中兩第一須菩提明麤無礙行二佛說細礙無礙行初中先天主問因上明方便力故無所礙故問事也須菩答中為二初明礙次明無礙然事有二法二功德二智慧各各三一者自行礙二者化他礙三隨喜礙文意具含此也所以言礙者須菩云內着我外著法是故為礙也復次示教利喜下依論此文屬第二明無礙然先明自行而今明化他無礙屬此文了化他無礙後結得二益一自無餝謬二如佛所許也第二佛重說微細礙無礙中為四第一佛為說礙無礙二須菩領悟稱歎如來述成三須菩重問如來釋四重領解歎如來述成初三謂稱歎述成一也次識聽□是甚深第二句禮歎者須菩歡喜言我所解是甚深般若發言欲禮也佛述之十方佛不能得般若汝聲聞云何有般若可得次須菩因此了悟非但般若不可得一切法亦不可得次佛述中三謂標釋結明諸法一性者即令上般若與法皆不可得故是一性一性者謂畢竟淨也次明若有不畢竟可有畢竟既無不畢竟有畢竟故無畢竟無不畢竟名為二性也是一法性是無性法第二釋上無二性也一法性者牒前一性也是二無性者亦無此一性故名不二也是無性即是性者名為不二性也不起不作者本來如此非非智使然也如是須菩下第三結不二性知此得益也白佛下第三難知難解歎論云須菩明我自謂為得而佛不得故知般若難知難解也佛答非獨汝難於一切眾生不能現覺以般若六識不能識故也第四不思議難者以說三世正為說礙無礙問須菩上已說礙無礙佛何故更說答眾生顛倒之垢不可頓洗先洗其麤垢謂我與彼受財物見此三事為礙無三為無礙今除其細垢何但見三是礙無三亦礙乃至非三非無三隨可撥心則失般若故名為礙也二者須菩是小乘人恐於菩薩道非道不能善識故佛重述成稱歎重更為說也此中但就隨喜迴向一門明其礙無礙則餘義自顯也。",
        "from": "X24n0451_007:0285a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "白佛甚深下第二領解稱歎如來述成有人言五歎一甚深二可禮三不可得四歎解難解五不思議今謂不可得非別歎有人言此中四歎下無作品初是第五無為無作歎今依論判下乃至使佛無為無作更歎亦非是歎也今謂四歎一甚染二可禮三歎可解四不思議佛即四述也甚深者須菩知佛所說非己所及故言甚深又擬心則失般若故般若甚深佛述言一切微細不入般若中故須菩入深般若中智力窮極故言不可思議也。",
        "from": "X24n0451_007:0285c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無作品第四十三",
        "from": "X24n0451_007:0285c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛十一述須菩可禮歎之般若無起無作須菩今與佛論無作無起義從此為名也此即是第三須菩重問答兩答問初問即是歎意云般若無起無作云何行般若能離惡法習善法佛答若人若法求佛義不可得故無作豈有惡可離善可得耶第二問意既無作者應云何行般若因得般若耶佛答中二初明不作有行次明不作無行不作有行中三門初橫不行一切境次竪不行一切觀謂常無常等三不行不具足無是行般若不具足二解一云凡夫於色具足起常無常倒今借凡夫無常破是常故無常為不具足不行此無常故名不行不具足也又昔明無常已破常今復破不具足即是破無常即是具破也問何故不行常無常答知常無常不二常無常不受次說常無常耶次解不具不足具足下地所行具足是補處菩薩所行令不行下地不具足行補處具足印如是亦不行為行上第二明不行非但不行有如是之行亦復不行始是菩薩行也昔日作無常苦無我為極今明不行常無常故是未曾有所以歎也又從來謂有所得行為行般若今忽若今忽聞無所得行為行般若故是復未曾有也數人云滿有十一為具足但有根塵為不具足論具十四為具足但有十一為不具足也白佛未曾有也第四重領稱歎佛重述如文也復次下第二須礙無礙兩捨門也是名無礙者明有礙無礙皆名為礙無礙無無礙始名無礙也。",
        "from": "X24n0451_007:0285c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時慧命須菩提白佛下第四重領解稱歎上四歎但歎般若但歎佛今歎所說般若人故人法合歎也為二初歎法次歎人說不說如來不異者信毀品明信謗故兼明得失一也次就信中明有無得故有礙無礙二也次礙不礙俱不行三世明說如來不異四部也謂能巧說般若故則猶不巧說故則隱故諸有增減人能如此一了故增不了故減也故今明說不說不增減悟不悟亦然也問他義佛度眾生得道引涅槃增生死減等彼答佛恒度而無明恒復來破(云云)今明二何傾滿四句云何偏於一切句語耶而云四句去就迷悟若悟涅槃增生死減若迷生死增涅槃減第二句生死涅槃二皆滿並具即有生死即有涅槃有涅槃有生死皆滿二河減者生死涅槃不可得即是不二名為減也如此四句盡是約緣生死涅槃了不如此也白佛諸菩薩所為皆歎第二歎行般若人也世尊應禮諸菩薩下第三明化他行成此久近樓前前歎菩薩自行今云化菩薩即歎化他行也此中既云為眾生大莊嚴等即是化他行由先自悟不行礙無礙今還令眾生得此悟故眾生亦非礙非無礙相空菩薩度空眾生非礙非無礙菩薩度非即非無礙眾生也又初文中明須菩稱歎菩薩化他行成次一比丘領悟稱歎初中三謂標歎釋歎結初標歎中有一世尊就利益眾生歎謂令眾生得世樂出世樂次欲度眾生生下三世尊歎菩薩能令眾生脫三界苦得三乘涅槃故歎也次有三世尊能發心義歎如文也何以故下第二釋世尊以是因緣故下第三結歎也爾時有一比丘下第二一比丘歡喜領悟明菩薩實無度而能度六道實無所行而能萬行亦般若中雖無所有而無所不有也釋問為習何法者天王問意下菩薩能作如此觀行故眾生可度化他行成前二不行得不得是自行如此二行得成為習何法耶答習空者此是始習要次習空如習應品七轉之始習於七空也又此中詺無依得為空佛何等護者第三二行既成不假外護有人解云先問為習何法此欲守護故問其所習也故問云既其習空則此人無所行我不知作何物意欲明無護也又天主見菩薩勸行深行深妙恐有緣礙自謂有力故欲護之須菩反答無護者此意明菩薩轉深妙二行既成故不見內外虗實內即所護之菩薩外能破之人亦不見諸法不如夢之實乃如夢之虗故非內外不實不虗始是菩薩妙行也次明得正觀在心束盡歎不能干即是護也釋問云何知如夢者上即菩薩得夢智慧故不須護今問云何得知如夢耶若菩薩不在實中猶在夢中行則是成倒之人寧不須護耶四夢事者此明凡夫見實復見虗見虗者謂夢事四何者凡夫人中行夢法還云有夢以從泯時是因夢是果故言念夢分別夢好惡生憂喜故云念是念用此夢喻得是如夢實智慧名用是夢也云我因此夢喻得知諸法如夢名為我夢也實四事者分別此是人色非人色為念色謂色常無常等為念是色因色心生憍慢為用色以色我所得故云我是今菩薩不見意之四亦不見虗四故知諸法不實不虗始名為夢也若如凡夫見實見虗皆是實也。",
        "from": "X24n0451_007:0286a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時佛神力下第三段明初信受持說無不益為三初勸信二依信受持離諸煩惱第三自受持離障惱轉為也說則獲福無窮初中二先明眾集二明勸信問餘處但云眾集今云佛神力者有人解云先來諸天聞般若甚深之法心不能悟便欲捨之是以密感令來厲於時眾彼雲集如何捨去耶論二解一云猶是上天事久故去去復更來二云更有新天來所以諸天供養者般若雖善深□此品了了說諸法實相故諸天歡喜供養也。",
        "from": "X24n0451_007:0286c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時四天王見各千佛現下第三勸信明般若十方三世佛所行之道更無異轍非我釋迦獨作此說故故般若可信時會恐釋迦出穢土明般若是權誘之教故今明三世十方佛土雖淨穢而所明之道無二也有時解云時眾須菩所說理意難樹未能深信故即往也方便聽令悟解復云現在不解未來見彌勒佛異說應悟故今明十方三世佛明理不二云亦無二若此既不了彼何由悟當現亦然也文二初明十方道同二明三世同十方同中一千佛同今說般若相同二明實相為相三名字同同名般若四品數多小同故云說是般若品與華嚴云名字句同五轉教人同六問難人同也。",
        "from": "X24n0451_007:0287a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時佛告下第二明三世同為二初明人處同二明教門同當來彌勒亦於此山處說般若但論千佛者就事賢劫盡無此山故問何意只云千佛皆於此山中說而不云千佛外佛亦於此山中說答千佛有此山只就千佛盡劫燒無復此山故不言千佛外佛亦是此山中說法華此就理不思議今不論此如法華常在鷲山不思議之論也。",
        "from": "X24n0451_007:0287a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "須菩問何相何因義下第二明教門同三問三答三問如文也釋三答不同此間講人不分北人云相者如釋迦因七瑞相說般若當來佛亦然因者如我釋迦因大眾集故說般若當來佛亦然義者如我釋迦從經初作如此義說般若當來亦然又人解云總答三問云如我今說般若以兩權為相當來亦然如我今因大眾說兩權當來佛亦然如今說兩權令眾生得當來亦然今謂不爾文分明自答三問初答何相問只是實相無依無得相故文中凡舉七相謂非常非無常問大涅槃經云諸佛或說非道為道道為非道常說無常無常說常而今何故言皆說非常非無常益眾生恒有斷常取捨病是故諸佛常說中道離斷常法也假令大經之言常說無常者此終眾生悟實相中道故心顯道之言也有人言真諦理常絕四四絕不可改易今常說絕四之法不同如同也。",
        "from": "X24n0451_007:0287a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "白佛下答第二因問答是因般若是果非因不因佛因道說般若非果不果佛果名說色非常非無常畢竟淨般若亦非常無常畢竟淨問何故作此言耶答因色淨故般若淨此是諸法淨故般若淨如下法尚品中說諸法等故般若等非般若故諸法等謂般若異諸法等諸法本不等今明諸法本來等故所以般若等也。",
        "from": "X24n0451_007:0287b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世尊云何色法淨答第三何義問義者明清淨之所以也以何義故明色及般若清淨今廣釋清淨義故云義也論云法門也以種種義故淨亦種種門故得也四門初就五陰不生不滅不垢不淨得明清淨即□法譬次舉五陰不汙故清淨亦有法譬復次舉虗空可說故淨第三單舉譬門明清淨初句明可說故淨二聲出者一因谷空口空故有聲與大音聲此喻因菩薩住二事一智慧二辨說一般若為八萬四千法藏也二聲未曾二口聲亦空出谷大音既空口聲亦空而凡夫無二謂二之谷聲不異聲今言不異明二聲二即喻可說清淨皆如大音說豈不清淨也第二句不故淨上如大音說說無所說故淨也第三句虗空不可得者不可以有無如中論六種品第四單就法說總明一切淨第四是法而不譬譬而不法前二法亦譬又前三者是別義明淨一是總義明淨然法門之中不出總別法譬故作此釋所以之中亦不出此意故是明淨義也。",
        "from": "X24n0451_007:0287b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "終不病眼下第二依信受持離法鄣問現見有人□解說般若而不見諸病患此事云何答三義一□□□病世重罪故誡令勿造罪乃至般若力尚不能轉況餘力耶二者必如般若所說行則無眾患也而眾生不能如般若所行故也如法服良藥病無不差不如法服故病不差失法服人非藥無力三者此是轉重多輕也若不持般若應未來重受報今以般若力現世少受此果未來不復受也。",
        "from": "X24n0451_007:0287c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無數百千諸天下第三時轉為他說獲利無窮為三第一明說者得利二明聽者獲利三者舉十門示之法方初中二第一須菩明說者得利二佛述初中明諸天來次明為諸天說法得福利問天上自有般若經卷何故來答天上有般若經卷傳聞有之非佛口說有也假令有者一忉利天與修羅鬪故誦般若所以有也二兜率天有一生菩薩說法故有也而今來者二義一者人有三事勝天一斷欲二強識念三精進是故就人聽般若也二者有菩薩天欲令人行敬般若故遠來來時惡鬼遠去憎人行心遂諸師氣力次句明為天說法得多福者一者天利根二福德為此勝因說法故其福多也。",
        "from": "X24n0451_007:0287c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第二佛述中為二初正述次釋述須菩先歎現世功德習離諸病及得福利今佛述明二世功德也何以故下第二釋述為兩初歎般若與如意珠同二歎般若與如意珠異同者如如意寶能離一切苦得一切樂得般若如意寶能離今世後世苦得二世及涅槃樂也般若中無有法可得下第二歎般若不生不滅超勝摩尼摩尼是生滅法故得之則生樂失之則受苦般若不生不滅無得失苦樂也又得如意寶自高陵他是開罪因緣得般若智自他不二生死涅槃平等開佛道因緣也若菩薩如是不知者勸菩薩如般若而行故得利益也二句初句無所著行故得利益亦如是不知者知即不為說天說般若今亦不著此知知無所知也無力無非力者第二勸不取捨行故得利益畢竟空故不見力由般若能得佛道故不見力下皆是不取不捨行杵。",
        "from": "X24n0451_007:0288a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "爾時諸天子下第二明聽者得益稱歎為二第一諸天得益稱歎第二須菩及大眾共稱歎初二第一諸天歡喜供養悟道二佛破轉法輪說於般若初四句一歡喜謂意業二供養身業三發言歎為口業四出得失之人即是總釋歡喜供養意也由來云第二時教引此為證今問汝引諸天見第二時謂是第二時教者佛下云非一非二轉何不引證非一時二時耶答言佛是以空遣有不引者亦諸天以有遣空故引若言空是遣有有不遣空亦空得破有有不得破空空有樂不得相破亦[牙-(必-心)+?]相遣也又思益經汝□第二時亦云見第二轉豈不違耶又法華□□中舉昔小以對大歎豈是第二時耶有人解云始聞一悟為一轉次中復為二轉也乃至百悟為百轉也今依論不然諸天見昔初轉八萬諸天得無生忍陳如一人得初道故是一轉後見無量百千諸天得無生故是第二轉也問昔轉小輪今轉大輪何以相類答若取顯示教昔小今大則是小為一轉大為一轉若秘密教昔即是大故亦無量人發聲聞心乃至無量人得無生忍補處等也故昔轉大今亦轉大故相類也有人解云從請說已來至始悟道也前請說中雨華及三歎者此信悟耳未得無生故文不列若得無生久久列數不明數以未得故也今始得證悟無生也論云初說名定實一法相因初轉故乃至法盡皆名法輪大本云如來口說皆名轉法輪也亦例此語亦應初名為教用初教後□□教若初後皆名教亦初後皆名法輪然欲例亦得可[牙-(必-心)+?]例也佛破三句畢竟空泯諸天一轉二轉之見二用無法有法空泯轉還之見說世間生為轉說世間滅為還今有法本空故不轉無此空故不還一問答總釋非一非二非轉非還者不破之也自相空故了。",
        "from": "X24n0451_007:0288b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次須菩及大眾歡喜稱歎明般若理畢竟淨自相空而能令得無生菩提故不為大造法無歎般若能得無謂自也今歎能得大果前是現世今是後世也次三脫門歎無轉無還如前也若能今是後世也次三脫門歎無轉無還如前也。",
        "from": "X24n0451_007:0288c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若能如是說第三舉幻示說般若之方十門一說二教三詔四開五示六分別七顯八現九解釋十淺易說者或依文或口轉教者讚般若令人受持乃至正憶念詔者以智慧證前人前人悟解也開者耶疑□□□解若門閇破除耶品令得悟分般若門開□□□以眼觀不分明若指示是非得失分了悟分別者經云略說難解廣分別正悟也顯現者佛為種種眾生說種種求攢不吾毀起令行解說法者說佛意趣以觀眾生令知輕重解釋者種種因緣本末譬喻解釋令易解淺易故令作深說深者作淺說難者得易悟亦無說者還成說般若義了雖能作十門說而實無說者受法無所受取證悟者無所悟乃至無福因如此之人始能清淨說般若也若有說有受等是有所得說法也四句即為四初明說法次受法受法得悟無生為證證時煩惱斷為福因同入無餘故無定因也。",
        "from": "X24n0451_007:0288c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "遍歎品第四十四",
        "from": "X24n0451_007:0289a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "北人云百度六又言為般羅蜜品文云般羅蜜品今立為遍歎品所以有此品者即是第五歎最後容玄歎□□□行諸行皆到彼岸所以皆云般羅蜜也品九十句為四一法說歎二譬喻歎三雖過歎四得門歎初十七句云度淺者有人云須菩作受淺歎今作無遍歎此一以之義如散華品三歎治受及無量無邊下論主云佛上就珍寶門歎須菩就廣解歎今廣歎般若故有九十句無邊者歎般若如大海無邊下九十句即是無邊義也又云盡斷常等一切諸邊故云無邊佛述者亦是九十句述略明具四句一者須菩一遍歎佛舉述如云無來般羅蜜永勉來義名般一遍歎佛舉述如云無來般羅蜜永勉來義名般羅蜜佛言無者此永勉去來來名般羅蜜二者須菩就末歎佛就本述如云無煩惱般羅蜜永勉煩惱名般羅蜜佛言處不可得六情是生煩惱處故為本本尚不可得況有末末本永勉始名般羅蜜三者須菩以淺歎佛就深述如云夢般羅蜜永勉□□□如夢般若羅蜜佛就深是夢不可得永勉虗空□□□度也四者須菩以深歎佛以淺述如云無彼岸般羅蜜佛言無名無身故佛舉彼岸述此是釋成無彼岸義也既云彼岸須識彼岸故舉彼岸述成無彼岸也五者須菩以一相歎佛舉種種答如云念處波羅蜜佛四念處不可得是也略言五勢猶未盡也第二句須菩就般若門歎永勉不等佛舉諸法等般若述如法尚文也第三句離門歎謂離煩惱舉畢竟空述非但離煩惱亦離一切法故名畢竟也第四不增門歎謂菩薩同上雖彼雖波羅蜜故心無所著有二門人不能壞故名不壞也第五永勉彼此岸歎佛述無名無身故者有人云破無名身也因名身故有無身既無名身豈有無名身今謂不爾須菩就深歎佛以淺述無名身名為彼岸如前釋也第五空種□□□出入息不可得出入息由空種今了出入息如□□無所有也第七不可說歎佛據無覺觀述覺是言語本也第八無名歎此是名色之謂般若是智慧是名稱故佛述有無四陰豈有智慧行陰攝也第九無福歎以般若是三世佛法藏用三印印之天人不能改此是般若三印亦不住無得二印也佛答不可依者不可出伏也不可盡歎者或者謂三世有為法是盡滅今求三世盡滅者謂三世有為法是滅盡今求三世盡滅不可得也不作歎者無二種作一眾生作善惡二無情法作如火燒水爛等不對歎者得慧眼不見有眾生從今世對後世也次不失歎者不失是不違失若令一切法不違失實相也。",
        "from": "X24n0451_007:0289a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如夢下第二譬喻歎有五句須菩初句就能喻歎□□□中不可得者虗實永勉也餘四句須菩皆就□□□就喻本答喻本空故喻亦空影者象義也以象為虗以鏡面為實以炎為虗以風塵日光為實以幻為虗以術事為實實者為本本尚空況末也。",
        "from": "X24n0451_007:0289c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無垢下第三就離過門歎煩惱本來清淨故無垢也三毒不能汙名不汙佛答處不可得六情生煩惱處能生處無故所生無也次念歎者念想觀除也次無動歎者住法性菩薩一切論者不能勝一切結使不能覆無常對至心不憂三緣不能動也次無染歎非但愛不能染一切有所得觀解皆是妄解不能染也次不起歎者須菩就不起後世業歎佛答憶想分別無者從憶想分別生三毒三毒有業業即身就本答次寂滅離者三毒火滅也佛答云非但三三火滅一切法相不可得即是歎略述廣事也無煩惱歎者但初歎得無生時煩惱滅也佛就本斷答憶想是本尚空況是煩惱次斷般羅蜜者須菩斷有漏法佛廣答□□□□□□□□出故斷也次不壞歎者不壞假名有實相也此是不相離為不壞不壞諸法實有相也。",
        "from": "X24n0451_007:0289c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無常波羅蜜下第四就得門北人就此為三今不可前何意是滅觀耶何故非行耶後亦爾責持公宜約諸科數之大(云云)今為二初歎無行不成二歎無果不滿也無常波羅蜜者非數論有所得無常此是無見無常也無此岸非彼岸故非波羅蜜今云言其無常者明其無有常非謂有無常故永勉二邊名度義也論主上說如法性常今說波羅蜜無常者云波羅蜜所緣是法性法性是常能緣是無常此就一義說也然般若具常無常非常非無常等用也念處波羅蜜佛答身受心法不可得豈有苦無常等四如此緣觀永息名度義也始是生念處故一切師有非緣非觀名□□□般若是波羅蜜者論問言舉斷法歎般若云何□□般若歎般若有二般若若五度共行能斷或平諸行此是有智慧般若佛癡慧不可得是常作般若故舉之常般若為歎所以云般若為答也般若復是二萬德亦應例法也若以種檀歎檀用無常檀歎以常檀色無慳無施之常檀也亦是體用二般若也十力下第二果德也菩薩行般若助得菩薩十力後得十力也道種不知者論云道種是行始菩薩用法始度眾生於大眾中縮復問今是歎果德云何菩薩道種是法始耶覺前妄得因中無畏道種法始後得果無畏及佛始從因至果論意如此也如實說亦名如來如實知亦名如說也自姓者此世因豈復身自性成佛也佛法波羅蜜者菩薩行般若故能集佛十力無畏四無礙等佛法也出過一切法者果地法出度菩薩上也。",
        "from": "X24n0451_007:0289c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大品經義疏第七",
        "from": "X24n0451_007:0290a23_0",
        "context_with_next_sentence": false
    }
]