[
    {
        "source_sentence": "妙經文句私志記卷第十二(從廣開顯盡過去佛章開人天乘總問答)石皷沙門釋　智雲　撰　　疏卷第四記於此文為三先分章示根次義門分別三依文正釋初文為四初引經標章次舉品分周三亦名下三周異名四引例顯今云此文為三初科節經文次義門料簡三隨文帖釋今謂此文可大為五初重標示其大科門次通示其文之分齊三即其文以科判四八義門料簡其所科五隨其料以判釋初中初是重舉經文廣明開三顯一是重標示其大科門前初已標舉竟今更此言故是重也上下例示廣是對略之名如後所釋三一通別準前可知凡七品半即此一句即是通示其文分齊即盡迹門正說文也向舉其始令知其初未知其經故此盡言之也此文顯前總體分齊起下次別科也。",
        "from": "X29n0596_012:0419a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文為三下是依向通更別科節撿此文中將盡其體正應為六一標其數二列其名三明異名四舉例五示文處六釋所以如此方盡其勢不爾都不知其勢數豈名解釋文從省直便有四別然雖有此四之與六要唯二也謂能所人法二也初標數次列名三異名四舉例初數者通文執直七品半別義仍更有三將列先此標也下列三名各含三義雖各含三二顯一隱隱謂文處所也雖有隱顯義必具三不可不知法說是正標其名也為上根人即所為也亦名所以亦名為意即初法說之所由也此二顯也文處不言隱也自可知故下二例知言上根者對下二以得名中下亦爾法說名義於次當顯應通為一切豈別言上次文自顯不俟此繁下別二名各具諸義例前可知不繁爾也亦名八下明法異名也謂前三名亦即名為此等故是前三法之意名即顯約異名顯前三法之義令易解也然此二三之名並是相形待也法是對譬之名理是對事之稱餘二亦爾然理有通別今是從通知前事理通名為理之義同也謂直案其道理而說故名法說法即理理即法也事即是譬譬即是事舉世道理之事喻前出世妙道理之法故也行即因緣因緣有進趣造會之義即因緣之功能故名為行故即是三異名則前三義益以顯矣此是其別通名為周周遍市也於一功上三遍過而說故名為周謂開顯也次例顯者向已明之異名此顯根機亦異即成前之江為三也記引彼經第二十一方便品有若廣若略之說又云學是略般若則知一切法廣略相又云利根中根定散之心並入是門是門無礙今云既云無礙下根必入經不云者略也又云或指彼部其教退通三人云為三根彼三乘人同學衍道並取所被而為分例示云單說智度為略具說六度為廣始自色心終乎種智為廣但云色淨即云乃至種智即是略相今謂雖競引彼經要於文義等不相通會何者此為三根作三周說如向所引彼經總要所說不過略廣所被下出上中如何得與此文通會今說強為會通謂既有上中即兼於下略廣之說自攝於中然此三周之說豈得名略中廣理實難會今恐所引兼未得其要實未及委尋然縱得其實亦未會此中意此中正為開權顯實法難妙解機性不等故有二三差別彼經不爾何得為例由來並不言此意直故會通其言亦矣以為輙謂文雖云例意在於況何者彼經未爾猶尚有三而為三說況此既而不為說耶意有於此故注(云云)若得此意稱有可通不然亦徒繁耳。",
        "from": "X29n0596_012:0419a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下第四料簡者謂疏理前所科也於中有四初總標義數次列出其名三隨名解釋四釋成前義此中要者即以十義料簡前之所科又以五重問答料簡成前三科十義以義意深廣故遞轉次釋之也初釋標數者應知此三周文含名勢數一者此十一一皆具二義即十雙也文意具含十雙古今多偏失其圓旨今對顯偏圓故有此釋二者十只顯前人法二也三者於人九中初一聲聞餘八皆通三乘四者又於人中前三即論三周正說所被之根性以並聞三周而獲利益於利益中初是橫淺深下並竪初橫中初二即三周領解以一即三周授記餘並通論也又既十雙即得有四句義不(云云)。",
        "from": "X29n0596_012:0419c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次列十名雖此十章廣要義唯二謂料簡前法要之二所謂人法也初一簡前三周法次九簡前所為三根人也得此一意可會其宗要矣不然可不知何義此十次第隨文自彰不俟於先釋。",
        "from": "X29n0596_012:0420a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初章中有三初正釋次明通別三問答例法顯人初中約三別也明通文即有三於一一中皆先標次依經文示其相狀於示相中一一皆於別上示其通具餘二之義初譬即喻開顯之說時希也次即皆列開佛知見因緣譬中示因緣義初因句兩向故下更別取即應宿緣所感驚入開示故即因緣義也導師正喻開顯引至寶所故即譬說上釋引別而通竟下明通而別意正從多正故別言三周而不從略傍故不言通名字不監名別義通且從名也即從三義言三周也一意者三中之一通中之別也機具有二義不可定通別也下例法以顯機問中初牒前人法本別而今法說仍通例人亦應爾答中初例前通次例前別非直以義亦有文至下自知不繁此述然則此初一問亦即明人何獨言法亦以向之文義而為例矣(云云)。",
        "from": "X29n0596_012:0420a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次有無論者謂所化聲聞之人持實定有無也文具二義古人偏執故今破會以顯圓通雖寄聲聞義通三故云三乘初業名且別論於中有二初標起次正釋釋中有三初述舊此二下次辨非今明下三正釋初述兩家初家先述其計定有次述其破無顯成定有次家亦二初述其計定無次述其破定有顯成定無記於以破中初引彼經次以彼經之意破有明無三會通此經明有之意記亦念處為初業破中外凡即初業也知一乘即不愚於法也此舉彼經要義寧有以下正破執有可知此前兩家各定計有無也。",
        "from": "X29n0596_012:0420a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下是辨非也於中有二初標乖失次別釋乖失謂乖違其文失棄其義二家應各有此二過而釋中且明光宅乖文文作是說此據照實也今執定有故是乖文次失義者所破其三並是義故則互舉耳下更取意別難光宅開善則一向權光宅宜權以顯實故別破之初牒其計即前文第二句也亦應等者取其義以難之以光宅宜四乘義許有三藏三乘既有所化三乘則有能化之主名為三藏佛也此教所化有實能化則一向權故今宜二為能所也此義不例者記云今文中之今謂此是假宜彼宗以救其義也此意總明因有而果無也。",
        "from": "X29n0596_012:0420b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今明以下第三正釋於中有三初略明要義次引經論廣釋三更別明大義初中先標不可偏執下釋所以明經其有二義故初句前破光宅定有乖文義現於此不得謂定有也次句前破開善定無二義現於此不得謂定無也此則具有二義而並不可定執是經之要義也下是以引經論廣釋於中有四初引論解次會經釋若從以下三會有無若得以下四總結勸初引論明聲聞得授記中先明聲聞差有其四然復明其授得否今文具引故爾義如次釋前二非經所被後二即是也次會經文論且有四義猶未盡故加今經所明會而釋之則有五種方盡其實於中總標別釋釋中即有五別初釋定性二退大三應化四上慢五大乘初定性者此從昔為名以定取於小果故云定性也次釋退中疲厭等是取小之由即如文佛道長遠等也引經名別異名不因始終頓漸二種故云別異此是退大取小故云退菩提心聲聞三釋應化前二是實是所此一權能即同事利益權應化實故云應化聲聞四釋上慢非上謬謂而慢於上故云上慢五釋大乘有標有釋少聞四諦之聲而自悟大用佛道之聲而利他少則聞彼聲大則聲聞彼(云呼)此五者前四不出權實通論昔日此第五一即此經開會前四以得名也上會釋竟下明有無二義觀此文意當有四句初明從昔故有次明從今故無三明實既有二權同於實則亦有無上慢一類既非前三則非有非無故有四句總結勸者達四無方尚不可執況各其一故不可而已以下第三更別約前大乘聲聞以論有無以仍有此一義將盡無故於中有三謂標釋結釋中四句初明權無次明實有三經意正明自實四明既自復即能他次結者前結勸通能所今結別論能也。",
        "from": "X29n0596_012:0420b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上通論三周所化聲聞權實有無竟下釋第三厚薄之二義也中惑者謂能惑亂非不定也若爾字正從心次薄存從博非從博從縛則為以博藉非也前是論人此論其人性行以顯三周差別之所從矣於中有三初述舊以辨非三正釋初中無釋惑上根次下以釋厚薄初中無明其惑之由將必異下正明其惑之狀踟蹰以下明其因致得失初中正由理教入出不同故致疑惑爾矣次得失中踟蹰於理教迴遑於出入俱是猶預不定之皃以故致得失以下約於三根彰其厚薄惑教情多者執理一故不應多由此故即悟次二可知以此則厚及中故為三所以三說正由於此。",
        "from": "X29n0596_012:0421a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次辨非中三初總非次別難後結總非言不爾者不爾所以如下難也下難破者直攬其前要以難破之初一句總責定之緣於其義無的莫故此通責之也若更別者謂為小大為復小大下別難此三也於中一一皆先牒其謂然後難破初應結云既云得果之後遊觀不應更有此惑次中既條然不監故不應有此疑惑次難相惑者牒已難之前二並昔此一義當今會正由其言不分此疑無因故致此難(云云)結云進退等者全云惑大曰進惑小曰退今謂前二約昔難之是退後一約今難之是進二途無宗其所依約教無據以故不可用也。",
        "from": "X29n0596_012:0421a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次正釋中二先簡定根惑即為以下次正釋也初中所以先簡定此二者是此科之宗要故前釋所以失者正以無宗要故此二相因故先簡定三乘也得聖果不在更論根性通惑亦並已除故須論其別惑若直言根性與惑則因果不分通別莫辨非此中意故須先間定也次正釋中為二初約四句四人釋次約三根三品釋初中先標列四句若別以下明四人釋初云即為四者謂即上二事共作四句也下列四名此並由宿習致此差降不同三周以之而起也以四句對三周四種人也前三句次第對於三周後既結緣則前三是當機也次文重釋者向將四對此束四以對三記云第二釋中應以中間二句為中文云為中下者或剩下字若下根字別為下句今謂初既云以初二為上根應以第三句為中根第四為下根次重既云中間即以初句為上根二三句兩為中根與前同故直云下根而注(云云)如此道理並通所以第四亦得為當機者雖重雖鈍有緣而得始終三聞故後文云聞一句隨喜皆授三菩提記況具足聞故並當機次約三根三品釋者向直通論厚薄不同故作三說此今更明三根初入直作皆有三品以論惑之厚薄前是單論此似具足論上三則薄中三則中下三極厚上薄故一聞中中故再聞下極厚故三聞此約亦悟解不同故知見亦不爾何故然耶次例小以顯大記云十六剎那皆名無漏至第十五心猶受向名故三品盡皆入初住上約三乘聖作以釋此下或即更通約凡夫以釋即約三惑障三諦理以上故初聞即破三中破二下破一次聞中破三下破二三聞方了此並同體之三例如一麤惑先除義也亦有此義故約此之釋思之。",
        "from": "X29n0596_012:0421b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下明轉不轉者轉是遷易之名也上明厚薄不均致有三周不等從此以下明稟三周之化得益之差別謂轉不轉異故有三處得悟解也此則明三周利益之初漸故漸故次而來也於中亦三先述舊次辨非三正釋初中明三初一即悟次二明轉義在其中易知此則但明轉無更不轉之義未全應於科目次下難言明其非也初牒其釋為利以下難責也為利則齊皆成上也皆上無中下猶有中下故無轉義次舉類顯此例甚切於中勢數有四謂舉有定有難有結文闕其定可以思之聞證初果則無而有再聞故異今此亦爾(云云)以此未當也下正釋中二先正釋次料簡初中有四初通四次別三結四喻初通釋轉義不定故從緣以二故為轉緣即知淺教略舉善惡則攝一切故是通也下正明此三故即是別也結異舊者二義一者舊唯約現在今論宿世二者舊唯有轉不明不轉若唯現在緣而無因若唯有轉過同前雖今異於舊順於宗要義應科目喻中三刀喻三根同斫一木喻同斷惑證理利一等喻三而有差別利鈍下合喻前異而同而已也料簡中二番問答前明初證同異此明入證後異同初問未證如前證此位已猶有次不答中明無真修體顯是無之義任理而修不修而修也次緣修者因向而起也未證名緣證已名真望上未極而更修進亦名為緣緣為也真是即也前有差後亦爾不答中一一義明並無也其中有無之所以可知此二似橫竪義諸並不釋可以思之次釋悟不悟者三周利益之中第二意也前明其始且以轉為其名此明其正故以悟為其目即言悟不悟者然前所論三根義雖通於三乘而文且三根以釋從此向下並約三乘以論三根義方顯了雖約三根而文但明聲聞順記似只明其一得悟餘二猶未今約不悟明不悟盡皆悟故以為科因矣於中有二初通次別初且通者通論三乘三根有即異也初問次釋問中先舉餘經說三次依經以同此三而言耶者二疑之詞也謂如此不如此耶然經以下是次合釋文有二句初是酬其列經別義下是酬正而通義然別未了故云一往今此心通不得從別故義不然也正謂三乘通有三根之義故也今經以下是欲別釋直約此經別論三乘各具三根故云別也並皆悟解無不悟者也於中亦先依經作問多有此疑將釋破之故此問起即三周領解也支佛以下是次釋會先支佛次菩薩初中無約義明聲聞領解即攝支佛聲聞三根有三領即攝支佛三根三領解也次引始終二文證成文義具足故定有也舊云以下次明菩薩三根同解悟也於中有五初述舊次辨非三重述舊四重辨非五約例別顯通初中有二謂總與別總中有標厚其下釋云域壞者域謂限域即要期也三根以下是次別屬對也此明菩薩三根並在法說悟解次辨非中二別直以義破以是道理故不然也若爾下更約文破忍是住上心是信作據文此說故不然也文義不會故為非也次重述其救成前義後只是前增損併在於前也下重非者如後文次第四乃聞壽量說始入初住非增道也下是第五例菩薩通以顯三乘亦爾初問中準下答意此問意有深遠何者菩薩既通二乘亦應爾何故三周以後並不更言二乘悟通既後不言故知並在於前後唯增道二乘既爾故知菩薩亦然故不應謂前不爾雖例菩薩以顯二乘意在反例二乘以顯菩薩防他此意故此釋破父子約會天性熟開既開會已縱有未悟盡名菩薩於後悟得並從通名故不從其別也。",
        "from": "X29n0596_012:0421c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋領解有無者利益之中第三意也前二並從此科中出前二是義此一是文即三周領解文也轉悟故領解解故轉悟故三即悟解中初中極也若論二乘此即第二意也正從第三第二兩意次第故有此也言有無者即就三乘論也如文自顯於中有二初問起次正釋初問約前通義徵於別釋起於借釋次釋中先釋緣覺不無次釋菩薩借有初中先約義次約餘文三約文此文以此義三種故不無也釋菩薩中二初且總略菩薩異於二乘故不爾以不爾故不言次廣借中二意初是翻前後意次是翻前初意仍含義二從要從略也要對略廣本有無從彼此(云云)第三一意借收始終一切故云具足今謂初是有義而未言次是有言而不得三前且略在從廣又此總別四義即四悉意義及次第可知。",
        "from": "X29n0596_012:0422b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋授記得不者得利益中有自有他前三是自利此即論他利又約經文領後有記故今亦爾以此意故次而來而言得不得者亦以三乘文義故也將會無文不得盡有皆得故也於中初徵起即得不得意也此亦三下是次備釋三義亦與前同一則有而未言二則言從略要三借在於後前且略之言法身者對應身也尚授法身記況不應身以此故總得無不得也中亦含四意(云云)次問者因向法身記之而起此問答中本者即法身也此明記應即記法也欲使等者此釋疑也疑云既法身為本何不記本以攝末記法以應故釋之云爾若記法本則闕此義廣如後文釋也以明若至後記即同菩薩法身記若爾菩薩但一二乘兩授然向三中第二已有此義不須此惑(云云)。",
        "from": "X29n0596_012:0422c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋淺深前明利益且似橫論此下三番並似約竪論利益也文含二義前已明橫當明其竪故次來述也且此淺深中二初標明晦即淺深也初聞下釋釋中有法有喻法中二聞四重是淺深之由以是故有淺深此正明迹而言本通談其勢爾也中二重皆喻淺深也記云舉凡況聖舉麤況細單複下引事也以是定知然矣如後分別功德及勸品末即其事明矣於後白明故此門最略。",
        "from": "X29n0596_012:0422c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋權實者蓋明能引所引利益之有無也亦故前初標云第九益有權實者是也亦通三乘前雖通有其義且為明實故今此具之於中先述舊解有無如文次今正釋於中四有初作舊無而標有所以下次釋初無而後有文云以下三明非後初亦有故一音下四證初後俱皆有云之意稍隱可善消息故注(云云)。",
        "from": "X29n0596_012:0423a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋待不待者明前利益通於二時舊釋多偏故今通會明二俱有上既通始終故屬竪攝於中有二初正釋後料簡初中文二初通論一化次別就當部初中有三初標何故下釋此乃下結初標可知釋中有徵有釋釋中有標有釋標云佛有顯密者大論有此說也釋中即有二別初釋顯中有義有證有結可知次釋密中有待不待有便悟入有結亦並可知結云大判者通論一代也次別就當部中文亦有三初迹次本後結迹有三周論待不待三周不悟待後三世而悟即迹本待不待也結中據前後悟文顯成待不待也前悟即三周順解後入則分別領解此亦大判若曲就二門三分論之亦有待不待也可以準例不俟繁文。",
        "from": "X29n0596_012:0423a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上正釋意下次料簡二番問答明前二也初番簡前一化次番簡前當部並因此經前後二文初即不在此會之流次即在會而起去者也初答云餘經者謂前四時一都不言之二者言之判為定性永滅無餘淨名敗種準安樂行則為大失大經意與此同如後當釋此人非顯非密非此非彼則為永失次答意者弘經之人即四依也準下經文即遣使還告也亦餘佛也此人略聞不生誹謗在人天中以有緣種故值四依而得度即如下文迷惑之眾世世與師俱生亦其義矣亦是待後時也。",
        "from": "X29n0596_012:0423b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此上十門料簡前三科人法竟下有五番問答記云此下料簡不關十門全云下五是汎料簡今謂又重料簡前三之與十也於初之二番重料簡前三科次三番重料簡前十義於初二中初簡所為三根次簡能被之三法初番問中將經事通問今名別以前科三皆云為故答中通責言不便者非善順於道理故也下釋顯其不便所以謂請雖通而悟解別今為科文雖別而不遮通無方若是云何作定相應解故結責云奇義從語此中即具四句妙旨故注(云云)次問者前云三周亦名理事行今更例顯亦得即是三世義不言不者謂示為不爾也答十三句初文無義有次釋會其義有三結故如所問准後第三見明宿世望前二周固當現未如拾所問三世義也。",
        "from": "X29n0596_012:0423b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下三番重簡前十義者初番重簡前惑有厚薄次番簡前根轉不轉及悟不悟後番通簡於前第五次者約三乘中緣覺義也初問中記云障大者舊師計也四句料簡今家破之言如前者指上玄文五濁有除不除大機有動不動不得一向云障於大亦可云如後即後釋五濁中具歷五味四四句是有人下復引他解斷見惑竟有無明在故所證真與此無明共為大障無明舉修惑也即不發心初果故引法華論證言無煩惱者已斷見故有染慢者有修惑也未知常住即是大障若薄地不執未有所證未曾斷見二癡合明無明惑強故云獨障意云五濁之中眾生劫命不全為障為障者見修兩濁若爾下他難也意云若二人無明若共若獨俱能障者此之無明若定能障即定須破若聞法已破不妨聞法何障之有若未聞法無明先破則聞法時無明已去復不名障此是三論師意不問無明為障所以直以自他責障有無答至為通者聞法故破破由聞法言無前後者未聞法破為前聞法已破為後前名自破後名他破自他無破無因不可次雖不前後等者雖非自他因緣故破以因緣故亦前亦後亦前故闇滅亦後故明生今從破說故無前後今從立說無明定障又亦應云雖無前後聞法定破全云四句下是答答意云應以四句料簡不得一向為障言如前者如玄義中謂自有五濁除而大機動二有不除而大機動三有除而大機不動四有不除而大機不動此意答云亦障亦不障也初四二障二三不障次問中先舒他義言斷見者謂得初果言與合者彼師通呼五住之惑而為無明故次舉愽地凡夫即云無明獨為障然此中既已斷見則指餘之四住耳言合共者初果之人見偏真理而又執之故與無明合而共為障也所指論者彼師甚悟論意以阿羅漢破煩惱障為無煩惱具所知障為有染慢耳言若爾者若向既直其二種障義此則雙指二然其難詞仍但云無明者俱通說之執偏真理二屬於無明故言非是障者既聞法已方破無明斯乃惑破聞法二不同時故不成障答中云不可定前後者若云前滅應燈未生而闇已滅此譬未聞法而破無明若云後滅燈初生時應闇仍在此譬聞法已方破無明既俱不可故不定其前後雖不前後者理雖不燈生之前生之後闇滅闇定障者而正燈生之時闇即滅故此譬正聞法時無明即破故得是障不酬其所問也然百論云不破闇元康法師釋云以燈不到闇故彼記甚廣不能具也今文意以闇不得起即名為破故成能破之義與論不同上兩釋亦之甚廣今略明且初問中先引他宜若爾以下次明他難是義云何明他以前二為問也初中無且通宜有無有人以下次明別為障若愽地下三明通為障初言五障大者如後又云出世本為說大以五濁障重而不得施故是障大四句如前者兩解已如前記今謂此或仍是他人有此料簡謂雖謂通言障若分別之仍有四句與前第三惑有厚薄科中四句勢同故云如前但今別惑而彼通惑為異次明別為障者即別明修惑為障大也言有人正指有此斷見有修惑障一類之人非謂別指更有一師作此釋者名有人也故次所引論文自分別也斷見而與合者以斷見惑以此見智與修惑合共為障也總呼修惑為無明也下引論證以明為障之義準此師意以無見惑有修惑而為障故此言也若如前記所明論羅漢全無見修名無煩惱而有智障名有染慢借論少分義耳即全誤下明俱為障者謂二惑通為障也總呼見修為無明也即癡為根本也與初何別者初有四句則有障有不障此即全當為障之義謂見修障重根又鈍也次是他人難者前所宜者以彰此經也三周之所破也三周說法為能破也既有能所乖於性空故用經論破性之義為此難也將且先預定前之所宜故云若爾即指前通別二無明也次下難者文有四句初二雙定次二雙難雙定如文宜者應更反質設爾何過將難者云二俱過宜者更云其過如何下是正難顯其過也謂既障不合得聞既聞故非為障若未聞破此無能破既無性其能何有於所故都無障又聞破是他破未聞破是自破若二合破是共破若非二破是無因破非直有二過亦為有四句失既無此四理何得有破義故云是義云何將前宜破之義不成以問於今故云是義云何亦是將以通難一切而今別為其答將顯成前同所釋正義故述他此難問答中無指為者為顯正義故為其通下是正為仍舉喻顯此謂即生即滅即滅即生故言無定先後此明用既相即體即雙非雖復雙非本是闇障今是通明乃是非明闇之闇障亦是非明闇之通明矣此明能障所障能破所破皆不思議故非思議定判而言定是障者亦是不定之定定即不定故注(云云)義云何者略如是矣。",
        "from": "X29n0596_012:0423b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "以下一番明知不知義即簡前轉悟不轉悟兩番也前云悟不悟此明知不知故是同也初問中先舉兩經三文皆明初即知能知次以問此何故後猶不知不愚是了知義自知當得作佛故云當覺此引戒經兩文展轉釋前也既初即知作何故仍有三乘之果故引釋云雖初一大且取既知何故且取故又引釋知易行難故也二雖三異正在初並同知以問此經後由不知言三根之後者後是對初之名全云三乘根性謂之三根三乘皆已果滿菩薩又云不退望彼初業故云之後今謂此釋將為近當初疑等者全云初略開顯執動疑生故四初不疑今謂三周之初皆有疑請故云初疑皆待聞已方悟故云後悟此則初後極相違反云何通會故云此義云何答中有二初明答此經後亦云知不得一向定謂不知次釋答前經初能知亦有不知不得謂一向知初中又二初明前後亦知破其定不知全釋又身子下釋前起後初中有三初總標經明知次示其文三釋會意初標如文次示文中含於三義下約三意釋會前文知即前初文是不知即前除佛已下文是後有知不知義豈謂一向不知次釋起者釋前不知起後釋前經意於中有三初引二文彼見聞下次以況結若執以下三因誡勸初中意者前云滅後不知今釋不知之義先引後有不知次引初有不知次總況二雖初後異並親見聞猶且不知況於滅後如何得知故其宜矣若執以下因以誡勸起後釋也初誡無益論者下勸要初誡意者聖意深遠各有多意如前如後不得專固甚其文自相破壞如彼矛楯此要並兵器也往者楚有得賣矛楯之人有買矛者而謂之曰此矛能壞千楯其買矛者尚在尋有買楯者至又謂之曰此楯能壞千矛前買矛者乃問之云以子之矛壞子之楯為得幾許賣者莫對今意正取若定執二文互相破壞如彼矛楯今會其意勿對文也於道無益者理無定故餘事者勸徒勿穢惡謂絕大患致大道矣非爾所識者此是大經之意皆是佛說若各定執皆言不解佛意云在無偏不可造次故也下是釋前初引二經之意於中有二初約久近次約權實初中有標釋結標明其義通二不一向也三乘以下是正融也初牒經文而標為二下約久近顯其二即以其二顯知不知也初即此經下文發心寶所次即中入化城久近不得定執昔經且語一邊今經其言其二雖言其二猶是說其昔若通言之即具三義故前無其三此但明於二故結言其義爾也若得此下是次約權實解此似直約向近之上以論二或亦通也(云云)於中有三初即正解釋次述意解今不取下簡非以顯正也初中直以二字即顯二義不知不名為權也次述意中先宜二種人次宜四句有標有釋意明為列四實故有此四權也此從言而無義故下簡非而顯正也不取簡句非但取顯成前正釋也即於二名自會二義故云於義自顯徒煩其言於理愈隱(云云)之意爾矣此上一科正止觀第三文末及記所釋甚要悉矣下一問答重簡前三周之中所被三乘中乘之義聖教所說不同故須會通顯成前義初問者先舉經論古今通有此說以問於今將備釋之先此略起次答中初約三類通釋後結有無酬其所問初中三類文即有三初明二又即有三初依論標二名次辨二意即兼顯其二義如此不同是其異也仍即此意是其義矣可以思之次下是釋其二初釋獨覺所引二經一論並明是此人也世無二生其不稟教與稟為礙故照徙之引大經者釋成上言彗星者詞納蘇遂反二翻利掃義矣言其星形似掃帚其義可知以喻獨覺出時無佛法故以為喻大經疏中具解次釋緣覺併兼二義都以願力並得值佛言得初果者以先是聲聞之人二果三果皆爾言十四生者人天七反故成十四從極鈍說廣在餘文雖成獨覺以有願故仍異於前皆得值佛故仁王經有緣覺眾即此類也言二三果例然者記云如一來人及五含中後之三人知佛出世尚有從天下來親近佛等若上流者縱至無色般並有起欲界化來見佛若不見佛亦可容得有餘般時亦名獨覺故云例然以從願故也言部行者聖教所說又有此一類故也師徒訓化即其義也此二緣覺之中有此一類也言亦變化者上二就實此一約權應也且如文應以支佛得度即為現之是也下結詶者若例聲聞亦容有五今略言之即有權實及開會大乘三種緣覺義矣夫。",
        "from": "X29n0596_012:0424c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上來十門及五番問答並是料簡顯前大科三章門意今自下即是第五隨其科門判釋於中大科五章普兼示其文處也初直約法開三顯一也異名準知次是時眾利根因以得悟發言了領佛所說彰其得悟解也三即是佛重述所說成其所解實不虗四者謂前是自行宜復今次化他也五者非真聲聞利根因以得悟三乘四眾利者皆同悟入也此五若他古今但以為四含第四五同為授記段也以通應下二周但四故也今意以應中後二周並令有五以並有文義故也又第五文雖有領解而無授記又通領前非獨第四故不得於第四文中開出以故必為五也有若從要義亦是二也謂三屬能二屬所也能即初科三中能被法也所即三中所被機也則前科三章一云皆具此二此今是初周二矣名義次第總在其中思說皆可知矣初三許者謂順其所請許與說也誡令精誠許為說也簡非其人許為當者說也記云三章合二即以其章二字當之亦即各有二文今謂下之二科各有其文初之一科但例有其二義不得有其二文則初一名順即是許次有試有許下亦有簡有許故初一文二義下二各有二文二義宜善思之初中先牒其請為所順許亦其由也次許即有二文疏釋其誡而有兩意先消此文對今三慧次會大經四種善法初有標章屬對正為今生此三利益故作此誡不諦不善則不能生但三而非慧也三慧名通此即妙也應以善字貫於二義謂善思善念也次會四者彼經云有四法能為大般涅槃而作近因謂親近善友聽聞正法思惟其義如說修行此其四也彼四此三如何一總三別經云吾當為汝即試令於佛所諦等即是令近善知識也餘名義並同故云可解此二並釋誡意也非直能近生三慧二即能遠為大般涅槃三德極果而作近因以故建首為斯誡大經又云若言離此四法而修苦行是涅槃因者無有是處此意若無正解而修苦行以名為無益與彼都無異故下文云以苦欲捨苦即其義矣亦名無因而行者也為最要故先此誡令生妙解行也許文易知故不釋前請頌云欲聞具足道今許之云為汝分別解說即許為其是具足道也。",
        "from": "X29n0596_012:0425c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋簡許者此明妙道不可妄授其人猶摩尼寶投白象子非徒無益翻致大損故簡去之具如頌中文即有二疏亦具解仍先標章次釋其二初釋簡中經文有六意初敘其由次敘數而退三釋退所以四明簡去得宜五歎美現眾六度於是退者疏文具解復五其由有二謂遠以近遠由三止近由順誠所以牒其時者正由此也(云云)疏釋初有數有退在疏文直釋簡去之由眾有其二前為此輩非當其人故三止不說今將為當者說故須簡去言威神力讚遣如後頌文即是簡非而遣令去故以名也前之三止都為二眾一簡二顯表三周即在顯數之內顯有二意一謂令三請二表三周今此即含有其二三也(云云)注者云未明啟節齊表先枯一實方談五千便起斯譯均而初異也。",
        "from": "X29n0596_012:0426a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下是釋退之由又有徵釋結徵者所以簡令退去者何耶釋云有三過故結云以有三失故以去也有云次釋起去所以由凡有二義一者大乘中有失二者小中有失所言罪者執小乖大(此引二種古人云云)故稱為罪所言根者二義一者過去修習小乘故稱為根二者用此執小遂謗大乘故名為根言深重者為釋疑故來若對小乘遂障於大三根聲聞亦執小乘並應障大何故五千獨去三根住耶是故釋云五千罪根深重十方諸佛不能救拔是故退廗三根之人雖執小乘罪相輕淺故獨住也。",
        "from": "X29n0596_012:0426b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "及增上慢者第二明執小乘有障大之失此明於小乘內自此失實未得小乘故現不聞正法及增上慢謂現在失於現值佛修習小乘未得小果道果故名為失又罪根深重者明過去失次於過去障他聽說大乘復謂此果以為究竟不受大法故名為失又以此失簡住餘聲聞諸餘聲聞但有小之失無有未得謂得等故餘人在座五千退廗未得道諦謂得道諦未證滅諦謂證滅諦故言未得證也即釋上增上慢義有如此失總結上二失也次有釋云下釋起去所由此自徵云難得有五人身中國諸根值佛出聞正法難五千之徒已具其四將說妙法避廗而起去耶此去之所以者何謂也今釋有二意一罪根深重二有增上慢輩等類亦比類也罪者可毀可責可怖可厭之義若因若果可毀可厭者皆名為罪若依小乘此罪者三謂煩惱等三障(云云)今依大乘障有二種一煩惱二所知所知障者隨所應障入大乘聖作煩惱障者隨其所應障入三乘聖作(云云)依大般若重障有四謂煩惱業異熟法煩惱謂一百二十八及隨(云云)業者依薩遮尼乾子經有五(云云)異熟障者謂能障聖道法異熟果即三惡趣八無暇等其間佛前佛後應云法前法後難是佛前後不得聖果法障者謂於宿世障他化善道遺法菩提於此生中不得聞法道之正法謂五果中等依增二果所攝罪根深重者住遺法業是罪根故現不聞法是罪體故即第四障也慢謂輕悔不長倨傲為義恃己陵他高舉為相瑜伽等說慢有七種一慢二過慢三慢過慢四我慢五增上慢六卑慢七邪慢初慢者謂於劣計己勝或於等計己等過慢者謂於等計己勝或於勝計己等慢過慢者於勝計己勝我慢者恃所執我高舉為相增上慢者己實少德謂己多德卑慢者謂他多分勝己計己少劣邪慢者己全無德謂己有德今增上慢即是第五己實少德謂己多德得世間異禪定等故未得謂多得未證得多謂得謂有為道證謂無為滅此是增上慢相非全未得而謂得若爾便非增上相乃是邪慢相故有此煩惱障及前法障二種障力故不聲聞法(云云)此上兩家所釋此文略言爾也初唯約二次或二三四下明今解唯約三釋謂罪重根深上慢與舊異者舊通今別通者通大小乘通於凡聖別者唯小乘凡位所以爾者正釋小中上慢之流故也此三如何別者罪通根別慢又別也通應因果別當唯因又更因中之一物也(云云)然往隨文謂但是二故有所釋皆唯約二以文云及故也今明罪根為二並及故為三根言罪根者先舉其二法深重顯其二功故重為罪之功深為根之用何為罪謂五濁世何為根謂執小也五濁釋其罪障多是釋五濁之甚也以此全具見修故即具三障也如後所釋執翳是其根極甚故為深正由濁多故此極執翳覆蔽也即極信小不信大也。",
        "from": "X29n0596_012:0426b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下釋上慢前通執小乘此謬執己所得猶居凡而謬謂為聖經文有標有釋爾舉釋以釋其標下更釋經所釋前他兩釋皆對道滅今對三四者前通此別謬謂通真極慢也如前引論所釋己實少德謂己多德此是增上以此陵他故為慢也結三失者一總二別五障能障能障大小執小障於大上慢又自障於小總別失於小大二道故云失也以釋不止之意正為顯成向簡遣之意也去有益無損住有損無益妙得其宜故不止矣。",
        "from": "X29n0596_012:0427a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上已簡去非器下是顯美行者正當機也先釋經喻文出大論此等以下合顯法也謂喻此等也義同前釋門中破光宅義也此引經證執小棄大為不黠云慧也喻其無深智慧也彼經意者棄除般若如捨根本而習二乘所應行經如攀附枝葉此但釋所遣去者反顯美於住者真實堪任器用能受妙道復能利他他既顯美住者堪能又慶於去者無妨故亦佳矣佳善好也愆亦作[億音+(天*天)]正作愆謂過失也大光者大明也即佛慧知見無所不明也在即不得說眾無此益故住有二妨去無二失也。",
        "from": "X29n0596_012:0427b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "汝今下是次許也為令極佛意故云善也復更出者非也上枝葉下是釋受旨也謂時眾受佛三許之意旨也唯者敬諾也亦敬譍也然者信順也受旨亦是請詞并前故云四也徒者虗也正為有此損益非無意也定云論云一止表其二相一表當機樂聞止其現相俟其三請即今文表三周說是也二止表不樂聞者結緣之眾俟其起去即令去三止為枝葉未去是也(云云)此正當受旨之文後更出者恐晚人加足此下料簡釋成前義問答兩番初會昔兩說初問言慈悲者為下二事之本無則應爾有不應然今既遣去似不仁慈不住為說似無慈愍亦可初無悲愍次不仁慈無在如聾瘂者不聞不說也故如彼二也若新經中明如聾如盲謂不聞不見要而言之舊取無自利利他故新且言無自利故然大乘有自必他無自故無他矣爾文約舊說也增狀強為其作遠期得度因緣也大經云如人以藥塗皷眾中擊之聞者皆死人者佛也皷者法也毒塗者無緣大慈悲勳於妙法也於眾擊者為眾說者也死者破無明惑也死有遠近即世破者近也久後破者遠也即喻當機結緣二眾也如喜根等者舉例爾其然也出諸法無行經彼明昔佛末法有二比丘一名喜根菩薩僧也二名勝意聲聞僧已勝意執小喜根強為其說勝意不信大生毀謗墮於地獄後還因以悟解與後不輕義同不引不輕而引彼經者下文共知更欲今知多類故也如來最大慈悲何不如彼二而止遣去不令聞耶答中初總標其有由次別其所以初言各者昔與今也釋中初華嚴次喜根初中先明彼不須遣次明今故須遣言未廗者若備說彼經常說無已亦如此經下文自從是來我常在此教化頌云常在靈鷲山此則何有未廗且據結集流通以說相傳復約五時化明無中而不妨於有也或云記傳所記彼經三本略本十萬頌亦名百千頌經即十萬也今八十卷三分譯一中廣二本偈亦難思故亦名大不思議經此亦經爾大通佛說偈如恒沙淨明德佛則云閦婆偈不輕菩薩則云二十千萬億頌智度論說云如大海則今七軸最略本也今云未者則七處九會八無聲聞最後第九會初方有故云未廗所以爾者葢表必有頓漸差會二化故也先頓次漸此是差也後明先二即是會也具如前文無量義說及信解文正表必有差二故在而隔此中應辨謬解(云云)次明今者此正破會之時故必須遣此有三意為顯法妙不可非其人故為護結緣眾不令傷已聞故為篤當機之眾令銳意故以此三緣故須遣去滅化城破草菴並喻開破方便顯真實也。",
        "from": "X29n0596_012:0427b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下釋次結緣意是俱謗故強為作因緣今已為緣不欲傷失故須遣去也以慈者遠令得樂故以悲者不令謗墮苦故此是各有其所以也次更釋前住益之義問可知答中先正顯其義次引諸例顯初結緣者已作妙樂之緣不令更作極苦之因此則幸令得知斷三作大涅槃常樂之果豈非無極慈悲之利益哉如上說者如前待時中及次釋不止中釋皆於滅後從弘經人得益故也下引三文並顯結緣益也疑惑未能信解不生毀謗故得世世與師俱生後以得度大經記云是字即八萬等也亦是聞而未能信解後亦以是得度次二語謂信不信也例並結緣之灌並意令後以得利益此意並明無苦得樂之因明真大慈悲妙道之利益人多不曉此意謂猶簡奇何名為妙當應之此真妙矣有妙因者令其入妙無其因者為作因緣故所被機有二謂當結也能被之法有兩謂廣略也亦何有妙於此哉非直於此總顯三世佛化利益不出此二意也若不明此意非直不曉此經妙旨只都不曉佛教大宗若得此意邪難無所容其惑矣或曰略廣直為二緣此文未達其要旨今對此文且作是說何須定執或曰聲聞有此二類餘二云何曰此例易知何更此惑下文云其餘眾生千萬億種皆生疑惑又引大經及光明尚通一切何獨三乘故知此意普勉一切令結良緣以為當機之根本故豈不思而勉哉此意最廣遠達此意者方知此經利益之廣遠釋之妙絕豈不思而志之。",
        "from": "X29n0596_012:0428a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此前簡許之意極須詳審此二文者結許之文前略不釋受旨前已釋意今更於此出者此盖曉人不達起盡還依尋常體勢輙爾加足故不然矣云云前許之文既不言之此何言之受旨之義已釋於前何須於此更言之正為受旨之文承第三許文次便故疏亦承次便釋之然後料簡以此義故云此二文後人輙加足矣。",
        "from": "X29n0596_012:0428b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下是正廣說者即第三章也既許既受故正說也疏文此中有三初重舉爾科門次科其文總釋其義三隨其科別解初重舉爾者正是對前二為方便廣是對前略以為名文為二下是次科判總釋即有二別初對前二略科以直二廣上句逼下次釋其義初中二科各有二義謂科及意上二但言諸佛釋迦今明五佛故以四廣上諸佛以四廣諸則可會釋迦唯一將何以廣則以六義以為廣也若爾則諸佛人法俱廣釋迦唯義廣矣正以此故約三以釋也並言廣權實者謂上權實二智也今謂不然若爾上是略歎此是廣歎二也疎乖宗旨正謂約開顯義以論略廣何稱開歎二智故是失宗旨也易知故略言之直云爾耳。",
        "from": "X29n0596_012:0428b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下釋略廣之所以也於中復有二初通釋略廣二之所以次別釋廣義之所以初中二合有三而有略廣對三略以明三廣故名為廣也句逗即是文三行半故是少諸佛即是人以總故是略開顯是經之要義但二故是略前言略者義現於此也下是對上明三廣也廣義現於此矣此是合明二略廣也在文易知此義正應於前最初重舉爾廣章之下言之貫通三周四章五佛六義統盡正宗之文何故曲列於此然正約能用顯邊對前略以明廣故也又以廣文開為三章於前明之不便故於正廣之初明之義便故也(云云)。",
        "from": "X29n0596_012:0428c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下別釋廣義之所以於中有四初列六名次釋六意三明五均四明次第初列名者應知此六中二為宗主初後各共成之初二通成後二別顯通成開示五別釋開權六別勸信實此雖列六義之名而又即是通科文也次釋六意亦爾並通挾生而熟者挾謂合挾謂般若中通教含中真生者謂只在般若稟通不彼方等彈行名生也即於般若中便濤汰合熟故云挾生而熟也若無在方等入通人至般若已熟不名生也並酪明蘇者方等中新稟藏人此人與生蘇並謂即被彈得生蘇益也若鹿苑人至方等任運得生蘇益不名並也五佛故也次釋六意所以此六義者釋文如文法謂開顯妙法也將開顯之故先稱歎意正令恃眾生尊重故一一皆先牒名示其意也在文可尋此則妙義所從盡於此矣為此故約此六彰其義矣次會五章均五者謂五章中文互而義均也其文三句初明義均次明文互三釋互不之意互出者具如後文葢大也謂大要而明之意在文略而義備意會而不繁於文也全云詣者至也謂但論至要之旨而不繁文此恐不可今謂詣契會也如向釋也無開顯則已有必具六故不在繁文下明次第不定而皆得也前後亦後文隨文自見不俟先具妙義無方何定先後故云無在廣雖有三明此六義攝人與文盡矣此之一科恐有經來未之有矣非直經妙科實妙矣何者經云此經開方便門示真實相故二是經之宗要矣必待餘四而共成之方盡其致況更五佛則三十矣況更偈頌則六十矣況諸佛道同互相成顯則一一佛說經數皆六十矣況更本門三九十方豈復數哉其旨者何在妙之矣一言蔽諸何俟辭費有云以不結通十方非了義說先後有言良由各守所習而牽文不能虗懷而尋旨信哉當矣如得向者之意則一言盡於大虗無餘外矣後學宜其詳而演之。",
        "from": "X29n0596_012:0428c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下是第三隨科別釋於中初科二次明六後消文初總義通於五次別且在三世此則四五在其中矣次明總六中初標義有其六次列現文唯四三明二在後文謂五六二也即互現也後文有闕還指於此四文處所易知故不言初約二以歎法也初釋歎中初通標次別釋即約二以歎法也法中妙之與時雖皆是歎而正取時為歎也應知二字皆有簡顯二義思之。",
        "from": "X29n0596_012:0429b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初釋法中但解時義即顯妙也五濁是開三之由故云必也此謂施設名開非開廢也久後方說不同尋常故即妙物下更重釋不速而久之意初明三可未時故不即說下文云不務速說無智永失也次明三可是時故今說下文有智若聞則能信解也應知有通有別通者並約昔日五千通言一切小執者也若別者正是施時未可開故以人不堪故亦別擬中間且調熟也五千未去者定起不即說也別擬此三故此云也今人堪者約當機也即是時也且止請許正令去也喻中二句即以顯法中二也華即妙華喻於妙法久時方出喻久乃說也有云何西道朗云此言靈瑞華又云空起華天竺有樹而無其華若輪王出世此華即現明眾生若應聞一乘教成法輪王者佛乃說是經故靈華為輪王之相法華為成佛之徵其次有云梵云鄔曇鉢羅此云瑞應全輪王出大海減少金輪既現其華乃至應金輪之御世名瑞應華此法華經輪王出生死海減一乘道顯方演說之故舉為喻今文所釋先釋其喻次明表法初中先釋其華次釋其時下明所表即令釋上之二也言靈瑞者此舊翻也新譯如前靈謂潛通瑞即表非也此華為金輪王之先兆故也次下釋時言三千年或輪王將出之前此時先現也諸釋並無此言或聖教不同或古相承有此說也以此時出故云時一現耳現則金輪王出故是輪王之先兆靈瑞之義矣。",
        "from": "X29n0596_012:0429b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下約所喻法釋仍有兩番初約人次約法初有三義三乘後合三千年方說妙法表其華現授法王記合輪王出下更約法釋者義又相會故此是時味並是法也此會漸說也三昧合三漸乃說合時前現文略不言授法王記合輪王出故注(云云)。",
        "from": "X29n0596_012:0429c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次約觀中重出者謂標起及正釋也中觀名瑞約體就初也能通名靈彰其後用也釋從義便故此次第觀法無二是中是瑞能導一切皆入實相是靈又能初修中觀如瑞華現必能通至於實果如輪王出又一心三觀平等故名中名瑞必能通於三諦三智名至實相雖但言中實正表於此不能說與時三義會以故注(云云)也。",
        "from": "X29n0596_012:0429c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋勸信中初總釋名次別釋意後總釋勸信人法也初名謂勸持眾令於當所說之法必定信受真實無虗妄也次別者謂四一也仍有二重初約相待次約絕待後結意深謂三諦一實妙異謂不同昔三權麤也妙謂一實圓異謂昔三權偏也至普謂住妙理而行一行一切行不同昔偏勝局勝者同一妙人皆長者子不同昔日作人志意下劣也此並對昔以顯今故是相待義次明全昔異麤是今一妙無今昔異故是絕待結者此二並反於常不勸必謗故先勸也結者經合勸人法向且約法故此合結勸也無虗妄即向絕妙法也佛即妙人妙人所說豈不信。",
        "from": "X29n0596_012:0430a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋開權即第三也經文二句初說昔施次說施意即此名為開矣文釋初句言佛道者謂諸佛權化之道也隨三種機釋隨也宜說方便釋宜也合結故云隨宜也正為破執昔施故言三也而佛以下釋昔施三之意意在實釋意趣物莫能釋難解合言此二故云意趣難解此明施三在一事近意遠故難以難故物不能知故云難解次釋者釋向隨宜難解之所以也初徵可知釋中即舉自釋謂亦明昔施方便乃意趣難知一與前同而意趣之文屬結又屬顯實但文廣於前也經有二句即總方便即三五七九化也次言因緣總舉三業施化事也下是別明口業也釋云舉今等者以文云如我故也即舉自己以釋諸佛也既二事還與前同如何為釋諸佛事隱自己事顯時眾易知故以為釋巧慧同者釋上以自釋諸之意正顯施化道同故也借者此字二呼俱得此與彼去呼彼從此入呼故並得也言開權者皆云開顯今謂猶施也以釋結為兩向者以文含二義故是結開權復即是顯實對前釋故是結對後釋故即標結即約人標此即屬法非真經妙釋亦然能盡妙矣且結開權者是法二字總指前無數方便也非思量等明昔施為無數方便之意難知唯有諸佛乃能知也佛意等者初句標非思量等明施化意難知次約所稟者以顯能化者意能化雖三意在於一稟者謂三而不知一故能化者非難所稟故為難此具消經兩句意也以此故結開權是約人也次顯實者向說昔三是方便故即開權今說昔三為於一故即顯真實也經云示今云顯其義一矣勝人法即真實妙法也出世本為此也將重顯示更徵起既起而正爾也而有五者以此五方能顯示其真實也能成若是也二言勝人法者謂勝人所證知之法也人即是佛也經有二文故文即無分別義即當妙也前言是法者總舉昔權以顯施意意在於此故今言是法者總指向方便之法即是真實之法分別者思議也權實定實則可分別思議今權即實則不可思議分別能知故云爾也所以爾也此是實權故也非則不然是故然矣釋中初句正消文次句釋上之所以下句結示其要此即如前甚深境界是也應知此標文為後四之宗也觀古今諸釋並不能明所以其義流浪真知所從一宗雖明說釋罕知其要徒言開示莫知本合哀哉弱喪復者鮮矣孰知此之一句是昔是今是權是實是開是顯是結是標是人是法疏文一雙合此十義貫下諸說一一皆爾不達此意徒言開顯義其所從後學宜其詳諸無得因修惑趣爾矣。",
        "from": "X29n0596_012:0430a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次標出意者正為釋成前義也仍先徵云所以施權要令入實者何耶出世之本意在於一實故也以文云為故是為大事等即所為之境也復起於次廣釋故疏仍云標也疏釋此文仍先標列解釋之方次正依以解釋此是宗要故釋須有其方總謂通談大意別謂分字別消其文初中三意初正標意即詶酬願令他同己得妙實也唯為等者引下草喻證也除諸等引大證論釋不他之所以也正為自得佛令他同得豈更為他而依魔事故不為也次分字者別釋五字也於中有二初正釋五字以彰為實而出世次更約開權以顯成初有標釋結釋中五字即有五別初釋一中先標其體一實相謂無相即前非思量分別之法也非五等簡非以釋其義九即九乘謂人天兩三乘為八別菩薩即是九也餘義易知以此等是數是相是權今非此等故名一約相待也若絕者外無也其性謂實性即一切法天真之本分也以下釋其義初二字正標其義下約諸非以顯於是此等並局狹故非也用以化物故此實仍即為或事曾習故為機為機故致感致感故為因因即招感義對因感發助而成之故為緣也應知此一即大此一大即事此一大事即因緣以此因緣故出也次約開施釋成者本意如是但事不獲已且作先漸也而言今者出世後也有標有類有證可知。",
        "from": "X29n0596_012:0430c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋重標之意其意有二一為正釋之端端本首也二為愛重此大事故引大論者論云昔有國王久而無子因出遊獵夫人於後誕娩太子尋即奏報王聞默然如是至三因白其故王答我欲多聞其名遂且不言令汝數數說之無有厭足論申彼經數說般若之意今借類顯數言大事之意太子是王種故愛重無厭般若大事皆諸佛母故數以稱之也(云云)之意略爾有此二意故再言之若後又提以結則三稱矣今更一助釋者初標之中含於二義一總二別總謂權實別謂四句初一徵釋且明其總而別義未彰故更徵起然後釋別為此故二徵釋於經於釋其意愈彰經含二義疏亦有之但詞微密今略申之爾矣(云云)。",
        "from": "X29n0596_012:0431a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次正釋中此文稍廣大略有三初述異解次引論釋三心能正科釋初中自復有三初總標次正別述三總結非標云諸解者此文是此經之宗體從來異解葢多故云諸解皆未當理將使辨是識非無或多致故出之也。",
        "from": "X29n0596_012:0431a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下正出諸實也都有一十三家前十一家通釋四句後之兩家但釋佛知見義於中一一皆先述然後辨非初家先通標四一以彰顯實次正別釋果以此文(云云)當果一故其所以呼為果者以佛知見正是極果之名即令眾生皆得同一佛果故名果一一是同義無三之義故也今言理者一切眾生本來同有此佛知見理體故名理一切後廣釋其明四雖同顯於果理而有說受二門之別約以消其四也先來四為二謂說受也其此意者以初云開示次云悟入義當此二故也既大判為二次釋又各更為二以各有二句故也有何所以說受各有其二故文答如文言因果者其呼今迹本二門名因果也意謂初說令弟子得入一乘因故前名因門後說師久成長遠之果故名果門今意一門俱有因果如玄義破以前後二門略廣二說故名開示以票二說得二利益故名悟入同顯體果理故是果一次辨非者先總非次別破所以總不用者違文背義故不可用如下所釋何者以下次別難破初破其束四為二次破其釋二各且初破其相不應為說受二相中先舉經文次明經意三總以理意責之正應以四句並約所化不應以二為能化王應知四句並通能所若離二為能所都無道理今正破其離別故云悉主前機機是所主能主者誰故有其人既有其所固有其能所主既通能不可別經之與疏文義甚明有人於此強作道理申救殊非宗旨次破其釋各二之非初明二門所說各別因起不同正是開三未論顯遠無因緣故因緣如後說若爾下縱例破之言若爾者謂若如所說因內即待說果門者序中應得略說略中即待廣說二處等去結難也因中如向二處既不得然果門二義何得於因門說因無其理下方等者此明果門因緣未會故未應說若果門因緣未會而得說者因門亦應爾因既不然果安得爾故此師所釋都不知其義之所從來無異於諂囈。",
        "from": "X29n0596_012:0431b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次光宅者即約三慧總別以釋四句初以二義釋開通指於昔謂開除開顯昔說方便是開除說真實是開顯權實通以言之故開也其所以爾者以經云開佛知見又云使得清淨正當此義此是出世之大意故云也次下三句是約今也示中言不說所以者全云未彰為二施三及會三歸一之所以也今謂未說開除開顯之所以所以者正明為開會令生三慧故也次二可知此是出世之大意盡於此四也次辨非中有二初總非次約四義別難初謂語義相違過次濫偏權過三抑深從淺過四總結以故不可用初可知次三句明名義既通不能顯簡別故是通濫通三未深開則深以未釋開故是抑深就淺過也亦是違經文義過結者初結前通濫過次簡三過謂相違及抑深也以三以淺俱非果義故也(云云)之意略爾上言逾遠者上聲呼逾益也謂轉益遠也正應作逾世多借用應知其義不得依文。",
        "from": "X29n0596_012:0431c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次地師即約大四依之位以消四句地前為開地上為示悟入初云五恒者記云大經四依品文經明八恒初云若有眾生於一恒沙佛所發菩提心然後乃能於惡世中不謗愛樂是經未能為人演說二恒正解信樂受持未能廣說三恒能為他說未解深義四恒廣說十六分中解一分義五恒八分六恒十二分七恒十四分八恒十六分具足解釋盡其義趣具足其體皆如初恒言十六分者如世間秤十六兩為斤故大論云佛語鍱腹外道汝若出家比舍利弗智慧十六分中不及其一西方挍量多用此義古人五恒用對賢位以六七八用對初地以上至十地以三地對十二十四十六(云云)今謂初云五恒等者釋開義謂於五恒沙佛所發菩提心然後於大涅槃之義十六分中解其一半為開即以解而釋開也即三十心正顯其位即三賢也次言初至六者示之位也或盡解明示之義也即六恒十二分解也而言見思盡者此借共十義也經四依名借共十地義通於別圓古人所釋義只是別而借共位故此云也次七至八是悟之位空有並觀是悟之義即七恒十四分之解也次言十者前既尅至八此應云九十略十此是入之位也引經釋入義也大經十地名眼見餘名聞見既云眼見故是入極也即八恒十六分中盡解者也次簡非者有三初總簡非不用次明不用所以及結以故不用次所以中初舉經言佛以以下明經之義云何以下以經之義責其所釋不當如此以下是結其非以非不會故不用也但約別猶不能明豈以釋圓妙故注(云云)。",
        "from": "X29n0596_012:0432a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第四家約理就解理一解三合有四句亦三慧之總別也初標次釋釋中先明昔閇次顯今開前明光宅初開在昔次三在今此師四句並在於今則釋初句仍有勝異餘三則同次明難破言同前者如前光宅也其解大同小異就其同邊故云同前同前有三過也。",
        "from": "X29n0596_012:0432b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第五家竪約四時之教以釋四句初言別者即初教三乘當分分不同又對次共三乘故別也通即般若三乘同共臨故抑揚即方等抑小揚大故此直約漸釋也雖將入以顯頓而不知四皆言佛知見同異云何經意以四異一同以四顯一以一收四今作此解如何同異故未思也。",
        "from": "X29n0596_012:0432b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第六家勢數同前直就大乘四節以釋故深初別加無量義次合破者僻却三以破向裂取一以置此本是一體今分置二故云擗裂如此擗裂並是人情穿鑿全至於傷害誣誷於妙教失已甚矣。",
        "from": "X29n0596_012:0432b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第七家亦約四位以釋四句其中意義可以意得不在繁文故云傍通等者並非正至故云傍挾以云初地至六與前義同故是傍通以三十心故云挾別盡令一切眾生入佛知見絕待圓妙挺拔於常教是挺經之奇特簡不可以相待圓妙以解釋況乃傍通挾別而釋於茲故未見明矣對其傍狹之言故須此釋不可異也。",
        "from": "X29n0596_012:0432b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第八家亦用四位以釋四句而直取地前不取登地所以簡取地前者意謂數義並相當故於中初引經論通明位數地前以下正別用前四十心以對四句何不用之者仍責古人正當其義而不直用而奇前直曲取地上以釋初引三經攝大乘下次引三論十七地者即陳真諦三藏譯瑜伽之異名也有五十卷唐朝玄奘法師所譯名為瑜伽論也論最初明十七地義舊本直從此義為名故云十七地論人不曉此事便除七字為十地論然十地論直解十地之義何有五十二位葢不思也言十七地者瑜伽論第一云何等十七位嗢拕南曰五識相應意有尋伺等三三摩地俱非有心無心地聞思修所立如是具三乘有依乃無依是名十七地一者五識身相應地二者意地三者有尋有伺地四者無尋唯伺地五者無尋無伺地六者三摩呬多地七者非三摩呬多地八者有心地九者無心地十者聞所成地十一者思所成地十二者修所成地十三者聲聞地十四者獨覺地十五者菩薩地十六者有餘依十七者無餘依地如是略說十七地名為瑜伽師地(云云)論數十卷解此十七地義或恐要知其名略述爾矣言五凡夫論者明五位差別通有凡夫之名未知作者或云非真而舊共用具如淨名疏中所釋言皆有等者謂上經論六本同明有此位數也謂十信至等妙也然華嚴十信等覺兩位義有文無本業則備仁王無等覺下三論可知次簡破者初斥文謬已略如向所明次約義非縱而奪之皆非斷者別則四十心並非斷道圓則但三消文不足何因等者責其無理不應皆漫語者若文若義皆不得其實也。",
        "from": "X29n0596_012:0432c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第九家約論四句以釋四句且四智者道慧道種慧一切智一切種智出大品經言總別者大論釋也初二因次二果皆有總別故各有二因果所得皆無前後故云一時即以於彼四對於此四破中有三初破其用論定一時不通於前後次破其用論定高極不通於淺深三總會釋前兩義論中言定此不言定故須通淺深雖橫而堅故云似也明在極果一時而得故局在高今此義該四位故通淺深此二並言淺深何以取別者前言一時須通上下次言位高局於極果須通下位下位猶多故言淺深也結會前二者論一時則局定此一時則無方若時會無方則達論四亦爾故後還用論四以釋此四若不達此妙則論不可會若達此意則橫竪無方乃至四句不思議矣。",
        "from": "X29n0596_012:0433a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第十家約二諦以釋四句謂作此說二諦即令物開示悟入也初雙非顯是真理故是開次雙是能在二事故是示次復能泯合二故是悟又能不滯而存其二故是入此徒有言都無所以次破者先判其所解雖四句要不出於空有故直是二諦次明但是權麤非此妙實記云不出二乘恐涉通教今謂初教二乘恐不能爾故當共二乘也然其既空有此乃復論真俗即大乘二諦但義不融故是通二乘義(云云)。",
        "from": "X29n0596_012:0433a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次第十一家約三諦以解四句雖約行釋義通於教三諦理謂同一空無性也即三無三也昔不達故為閇今達故為開此意應在十住次即不三而三為示此在十行出假位也達於前二不二故名為悟此即十迴向修中觀也事理既融順以趣極故名為入位即登地以上也破中亦先定其所釋次明猶彼權麤後明非此圓妙言邐迆者謂連延也即次第前後相接續也雖似具足三諦之觀而要歷位不即圓融故是別菩薩法非佛妙法如後所釋。",
        "from": "X29n0596_012:0433b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上述十家並通釋四句竟此下二家但解佛知見也初家用大論釋二智義釋此知見言總相者謂同一空無相也以此照了智為智知如種智能了一切差別之相名為別相以照了分明為見意見審於知故以此釋次破中初總不然下明不然之義於中有三初述論所釋此是以下判論義之是非何以以下責其謬用論別以釋此圓非所應也。",
        "from": "X29n0596_012:0433b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次述一家以盡無生二智以釋知見盡智約無生死因而見理名知無生通無因果更審於前名見次責破中言通者謂此名義通前多教三乘因果皆有故也向別且非況通焉可故不然矣祥云雖有四句不出二門初之二句明能化門後之二句明所化能化門有大開之與曲示所化門中有始悟之與終入故此四門無義不攝開者眾生佛性名佛知見亦名一乘涅槃云一乘佛性一切眾生悉有佛性悉有一乘無明覆故不能得見為說佛性名之為開今除煩惱使得清淨故開佛性即德無不圓使得清淨累無不盡示者曲示五性差別之義故名為示(云云)悟者既開示竟今以令其有佛性名之為悟修行證之故攝為入知有佛性謂十信以上證入佛性謂妙覺以還舉始及終位無不攝今謂四句分二過同於前此意以略廣兩說擬其二能然無二領解二所安在若以驚疑為者謂佛為魔為略悟耶就不為悟略悟既無廣入何必曲示二所既不云信二能固非實說況依四句皆云為令總通於能所何為間絕為二故所未聞其又依此經四智釋佛知見謂知者蓋般若之異名正觀之別目即是四智六道本來寂滅一切眾生本來是佛一切種者雖知眾生本來寂而滅於眾生成不寂滅故於道未曾二六道當法身於緣未始一法身當六道道當法身名為一切智法身當六道名一切種任運當知此法名為自然智此三不從師得名無師智此之四智為三世佛心一切眾生宜以恒此鏡行即是初佛也(云云)如上以下是三總結非也起爾用諸經論相似之言全不識此經要妙之旨都不知從何處而起復當歸何處去奇哉奇哉自彰於復正釋中矣。",
        "from": "X29n0596_012:0433b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下第二引論所釋此有二意一為成前諸釋之非二顯大師所釋高遠大師當時不引丹丘於後見有二能故引以成顯也於中有二初述論解後會師釋初中論有三番準疏意初通約三乘次別約菩薩三別約凡夫初番具解四句後之二釋但釋後之三句不解初也今述論文有三初述初番論言以下次略述論初番之意又一以下三述論中後之兩番所釋初釋四句論文一一皆先釋義次引經文帖成初番釋中觀論文意以前三句是顯果理後之一句令修證入於初三中初句為總次二句別總明本有一切功德故云無上別明身智二種故云法身及一乘也初約無上解開佛知見言無上者正以一切智為無上葢總指一切所有境智智斷名一切智非謂別指四智中之一正以為總故若境若智若斷總名無上亦名無餘向上無法故云無上旁外更無所有故名無餘即橫竪皆盡矣言無餘者二義一成無上義如向所明二明出世意唯為於此更不為餘事也此但釋佛知見開義如何謂為物說此即是開也說此知見即無或業一切染累都盡故即清淨有智即具斷故引經帖者文具三義謂說一切智斷也論次又稟釋云佛知見者如來能證以如實知彼深義故今文不引者義已現於前文故不繁也次約同義釋爾謂向者顯歎佛知見為開今示三乘同有此無上義名示示即說也謂說以示之同有也次引文帖可知佛性法身下是論家重釋上經文也三約不知義以解悟悟者還是為其說令其覺悟知有也次釋入句不退轉即初地以上證不退也業謂行業亦即因也謂無量智之因也亦以說為令入也次下明證意者論意此是約前後次第消經四句文也故詳云祥論此意四門即為次第也所述次第之意與此大同其亦言三乘也。",
        "from": "X29n0596_012:0434a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上述初番中兩意竟下是述論第二第三兩番也初言約菩薩者論初句即言菩薩次二句皆言菩提心故知別菩薩也開如前者論無文今以例顯論意故言如前次番亦爾言菩薩者論亦不局但是稟大乘方便化者通言之唯今意者即三菩薩也具如前文斥中所為疑者即前斥不知之人及略開顯中之方便示三唯一真實而有其疑今為令知唯實決定無餘令修一實行也此約已入淺位者次令初發心次令其證入次言凡夫者初通指一切三界六道即前諸餘眾生類又下文一切眾盡教以佛道也外道即邪僻凡夫豈如正妙故覺悟之入中既言小果何名凡夫或從多言今謂前既已明二乘此不應重論恐論文既未字謂令未得聲聞小果者入大故也以此故並是約凡夫也論文非直初番次第三番皆有其次第也今觀論意三番大要不出二意初開無上義即前稱歎諸佛二智之義次之三句即次開權顯實意也初顯一切本體只明一切本有佛知見義次別為三乘人開顯不知同者令知同不覺悟者令覺悟已知悟令證入也次番更別為菩薩次番更為凡夫並以初義為本故後二番不更釋初句深有以矣故此三收十界文統前後盡矣以見觀之故前諸釋並淺局矣。",
        "from": "X29n0596_012:0434b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下丹丘會者明大師所釋與論所解互有相成顯也於中初通標不乖次別明其義初言四解不乖者此就論初番也論初番具解經之四句今作四番釋四句文與論解四義會故云不乖下明不乖之義初總標次別會標者論句句別釋今於論一句中皆作四釋則論別今通即令論四皆具今四則使論別成通及益論之深博何乖之有下別會者初即論第四義次即論第一義三即論第二義四即論中第三義也不退地是位故約位釋智是能證實是所證既能證實故約智釋同即心性故作觀釋不得其門故不知處故作門釋論別消文今從通義次第不同次第雖異當分義同故是相顯會矣(云云)之意略示此之四釋收法界一切義盡故論餘之二番不俟更言。",
        "from": "X29n0596_012:0434c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "自此以下即是第三今文正釋於中有二初且通釋後別消文初中有二謂標釋也今釋顯實者此總標也對前人師及論故云今釋對前言權此是正釋顯實故云顯實合有旨宗以起下釋文無脫也無量以下是次釋也於中有三初通立三義次通釋三義三簡通從別初立三者謂無量也十也四也此三者即廣中略也初文亦略具足應云所言一者一切法皆一也為會前經收無量以歸一故云無量也正釋顯實而言一者具含三義謂一實妙今且對數以言之也次二例爾可知若無量下通釋三義初約經論釋無量一即大品大論文也略舉二境應知十八界爾中道即一實妙三義具矣所以皆爾者上下數明不俟繁也次釋十一言帖文整足次於此當文有其義也言不次第者謂此文義與玄義中次第不同而義數具足所以以下約文示其十相初簡開權次正約實以顯初正是妙理故次正是妙智故次者文具三義以通從別故者為行一次明位者以是妙物無差而無不差故一知見而有四十同是圓妙故云位一又取結為三法一者前標相從合之為行今復開之為三前明三即一今明一即三以妙故也一即妙也應赴於感此即妙應故云一也眷屬即是人也行通因果此是果用故即神通令得佛知見故是利益一教即說也經文下總結前標云文義整足今屬當已結云信合此下是明四一於中初通明同異次別明同異同言通者四一故是數同四義並別故是義異下別明者初二名義俱不同後二義雖不同而名是同初名義異中初對舊標異依義以下釋成以文義二故須此名以魔不解妙理故不得妙道以此道理故不乖所知所見是本有妙實夫作是說故不可違次亦名義俱異因是簡果之名故單以名單故義不局定行通者因即趣果為行果即利用為行此上二是名義俱別次下二是名用而義仍亦有別何者舊之所明只二乘人教今之所論三五七九方盡其實豈非名同而義仍別故前數同義異是矣上是通釋三義竟今且以下是簡去通二從別四也所以爾者前二通釋其義今是正消其文文但四一故簡去前二以從略四。",
        "from": "X29n0596_012:0434c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此下即是第二正消文也此中即有四別初中文略應云就初理一文更有二初明一後總結成初中即為四釋初正釋中疏又有四初標釋之方數次列其名三隨名以釋四總結明所用之由致釋此初文復須三義方盡其實初文言先釋理一者對餘三一以起初也復四意者正標能釋之方數之也謂作四法以釋初理一之文也而言意者謂佛說此理一含有四意今以四義顯佛元意故云爾也然開顯是此經之宗況此四句橫竪盡實之體貫一部統二門盡三世深廣若是釋之無方何能顯發故須有矣理盡於此不可過減故約四也次列四名者並是約修顯性餘非要便故用此四名也修中有通具顯二義故須如此次第下是第三釋者正依所列四名以消釋也記科此文為八初標次以所依能用顯於所涉同述來意三二智下簡於能用進否不同四經云下引文約位以簡得失五三教下約教以判六故寄下結意顯正七如瑞相下引序表證八開者下正釋四位(云云)全云約位為四初標次明約位所以三正釋四然圓下由位有淺深之義(云云)今觀釋此四文一一皆有三意初通釋意次別消文三結宗要初言通者經云為令眾生開示悟入佛知見故出世今且通釋此意故云通也仍經從後釋向前所以爾者經為令從修顯性故今為約性起修故即本末性修互相顯也文。",
        "from": "X29n0596_012:0435b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初釋知見意二智以下次釋佛知見意經云以下三釋眾生佛知見意三教以下是四簡顯眾生佛知見意故寄以下總結所約四位以釋之意如瑞以下是會前序四華所表結成釋意諦境性也智眼修也性待於修所藉能顯故先明知見知見名通簡顯其妙故明佛知見也佛自知見久已證得不俟更論眾生有而未得為之開顯故言眾生開佛知見眾生之名又通不知何等故簡三顯一此約相待若絕以言全三並是無非圓矣然圓又通始終今即顯真中四位則眾生及佛見四義並得成立以此之故寄此四位以釋得一理次會前瑞所表者天雨四華正表依諦境性起知見修得開示悟入四真因位乘以趣果即而散佛上能垂之人即大眾也前表如此故今約修四位以顯理性矣。",
        "from": "X29n0596_012:0435c09_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此是通釋約位意竟下正別約四位消四句文於中即有四別初釋開中有標釋結初標三事二義三謂惑藏理二即開與知見也又二即開破開顯顯藏即不空妙有也實相即真空妙無也此即修顯性也次何者下釋中初明全未修時性為惑閇初心以下次明雖修初名未開內加以下正明真能開破初言通別者通即見修界內四住別即塵沙無明界外無明染者有本作染著著義稍切夫人經云不染而染染而不染並難可了知此明解或方不可作定知解即不思議也此即起下明修開也明雖開隱而不閇故可修以開也圓信等即名字觀行相似也又即聞思修三慧也此三雖修但伏未開此即簡未下是正明開破中有法譬合法中內外二事通為下正開破顯出之緣此即所知見性體知見即能知見也此或含藏一切漏無漏種故名為藏譬中三事喻上三也合者從開破開出理智能所合論故名為開佛知見緣修以下更釋使得清淨句此別指前固非指後前有正助兩行今言或通或別應從通也正則顯理助則破或對智明斷故言使得清淨次下結會初引經彼正是釋十住義故彼經義猶通別今正取其圓義即中道妙理也修與性合故名為住次結為十住位又會此序華瑞所表故云小白次釋示中有釋有結釋中初牒前開三事謂開除開顯能所也體備萬德正明示之體即所示佛知見也法界以下明示之義也以是故名示也即是十行結其位也大白等者會序瑞之所表也次釋悟中初牒前二事理以下正顯悟體即所悟也事即示行理即開住融通謂相即雙非也無二趣唯一道也次引論會異名也先引次會二必不二故云今不二也此二只是權實之異名即權實不二也結謂會瑞皆可知也次釋入中先釋次會論後結位初釋中先兩句牒向第三悟理明遞傳攝前故也自在以下正釋入義自在流注正明入義即造會也任運到恭即中道體用無功用也阿即初住無生恭即妙覺究竟借字義以釋也薩婆此云一切智有通有別今是通指果地一切智慧功德深廣如海非別指也即是恭字所證法也次亦先引次會初通達即雙照用也次會正顯二用也遮者絕除盡也次結位瑞可知。",
        "from": "X29n0596_012:0435c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上正釋文竟下是第三會宗要者一為顯此經位義故二為簡名同義別故三以世人所見有無名定此並麤方非妙無方之物故為此三義故須此釋於中有法譬合法中有三初明無淺深次明就智分別既有二智實理非有權量不無三引證有初中道明無有以圓妙故何有淺深次明就智分別既有二智實理非有權量不無今就權量言之故有淺深異矣下引證者此大經伽葉品末之文全華嚴謬矣初引次釋意明無而有也次舉喻無而有也朔生也蘇也明也即月初也望即圓滿日月相望見也月體無二就用有此明暗之別合中實相之體無四淺深約事而論淺深四位之別應知不有而有有而不有事隨一即圓是此經之妙位非別家之所明是一家之所明不同世人之所說故是此經一家辨位之宗要矣(云云)之意略爾。",
        "from": "X29n0596_012:0436b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋約智釋者前通性修能所此約修能照也又即前位之當體矣文亦三初簡異次正釋後會要初中以此四智出大品經仍通三教今則唯圓故不同彼應知即是無偏之圓矣次正以四智消經四句文也仍有兩番各有四別初言道慧即標其名見道實性是明其義道通性相慧是照實故見道性實性中下是會消於開文此達即佛知見昔無此達故即不開今既此達故即開也次以道種釋示亦三義初標其名知十界下是釋其義一一皆下是消示文此慧固中之照權事差別加之以種十界即諸道種類差別世間出世間皆有解或知此了達即佛知見用未不知故非示今作此達故即示佛知見也次釋悟亦有此義名義文一切即十界一相即無相寂即無二此亦照理故也如此知者是佛知見從來不如此知即不悟今如此知故即悟也釋入中亦三名義文此智即理而達事故加以種名義中於中道體而雙照故也此即佛知見從來不爾知故不入今作是知故即入次更一番者將前經中四智會論中理量二以釋之義益明矣易知此亦下是三結融會數一如前釋記云慧因智果各通總別因果之上各加種者故得別名各加一切故受果稱初言道者故受因稱慧之與智一往且然若依諸經未必全爾今謂此經下文二處皆明四智何故不以為釋而以他四釋耶故他即以為釋然義亦可但名有少不便故從便易以釋通會諸經論若得今此釋已則當經義亦可會又佛地經中明四智論中廣釋又可會否然彼局在極果今則通因乃至初心修觀皆會故不通也(云云)次約門釋者記云門既是教理應先列今在此者各有其意若專釋此四則先教次觀後方知位此中釋理四皆能詮於四法中親者先列具如下文逆順生起以親先故故先位智次及教觀於位智中位為所踐涉智為能證則所親能疎故先位次智於教觀中非教不觀故教前觀後(云云)今於此中亦三謂標釋結會標言圓等者以四通故簡三對一故言圓標正以四門諸教共有今即妙四故云圓矣所言橫者對前二義是竪故此義當於橫如城四門無復優劣法亦爾矣四門同證一理故也記云初心所稟教法具四以法相望無復優劣故名為橫應知位智多約於竪約觀乃成非橫非竪通論並是約非橫竪以論橫竪觀門亦有淺深故也教四相望似亦淺深今謂經文四句義含橫竪故得為兩句釋觀既依門觀亦屬橫故知二竪此下二橫二而不二不二而二亦即四義不但二矣次下正釋言一切者餘三門也餘三例爾此即開佛知見也未說不知閇也既說而解故即開矣次有門者三皆有也此即示佛知見也未說不知故非示今說而知故即示也次二例知能通以下是總結融會一理非四以四顯不四而四四而不四一四無方妙門斯矣次約觀解總前能所為此門也亦標釋結標者但觀自心具四句之義此為最要故初以釋次辨觀相狀全云此門亦約竪今謂不可思議不可定也心性具三義一心而三三而一心不可定一定三處絕故不可思議此即自心佛知見矣未作此觀唯暗唯穢故名之為閇今作此觀唯淨故名為開下三例然一宗盛明可以意得不繁文具是為下結會記云觀本無障不須融通前三附理故須融通觀正依理故也今謂既云一三而四亦是無四而四四即無四此融會之義意極分明不為無矣所以四釋必融會者此經之義法固爾矣別別論之意如是正要通論都由佛知見矣佛之知見圓妙無方何必數四而復淺深為此故須融之四與淺深皆無方矣此是至要位妙道之知見若定四與淺此深皆凡人住於恒情違於妙道今為順理去情故一一皆融會之宜善知其要旨不得趣爾無從(云云)。",
        "from": "X29n0596_012:0436c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "所以四下是第四通明前四釋之由次也有徵釋結徵含三意一何故四二何故此四三何故如此次第前列名中亦已略釋今此釋中逆順兩番三義在其中矣所以初順釋者從親向疎本向末修極以顯初也次逆釋者翻前三也(云云)此逆順各具前之二義不四不盡非此四餘不能盡次第必然不爾失其敘矣結身理者皆令同證會得方名理一非直談其理同名為理一應知位智二別四觀則通通謂一切凡夫別謂三乘聖位以當時具有凡聖眾故故不得一向淺一向深亦不得離對凡聖為此故雖一四而用四番釋也下釋第二結成理一之文準經道理及所釋意而大事因緣該於四一則此結文應在最後教一文下何故於此獨結理一今謂此有四意一者理是本正三助成故二者說理一中已具有餘三義後但是重顯成故三者將顯佛意極於此故四者後文自有通結之文不可重故為此故即於此結矣餘三可會第二即具餘三如何經云為眾生開示悟入佛知見故此即具矣如或未曉當更言之為令令即教也眾生即人也開示悟入即行也佛知見即理也以言簡密物或未會故更別說後之三矣故疏四釋正以於此又玄義中此文即證三義佛知見體也開示悟入宗也為令眾生用也何但具三亦即具五總此三法名為妙也純說此妙如彼蓮華不同餘經是其教也收一切盡何但三四而不具足以故即結為大事矣全云佛出世意何不化物令至極果而但令至開等因位釋云從難為意自凡階聖會小歸大斯為極難若至開等已入無功用道任運趣果斯則但令至開便是令其至極故不云耳此之一疑積習有之矣非直無能釋者窂有疑恨無其人文矣今見此見有此疑釋云未當文且有其疑故知乃不無矣然其所疑當矣所釋全未所以未者不知當文不統上下當文者若直論位則應如所釋上一四句具顯二義所謂橫竪橫為顯理竪為明位理極四句不可過減故直論四即理以論位亦不可加減以此之故疏約四釋以彰二義正謂此矣不達意便謂從難此固不可言不統上下文者序中四華散佛上六種震動六位破惑皆因果也方便之題四句十雙此橫竪盡矣稱歎二智寄言絕言皆具四句因果即高廣極矣下四佛章皆云究竟皆得一切種智頌云本願如我無異今已滿足譬喻云遊四方至道場壽量云得入無上慧速成就佛身如此一部通說因果之文極多而局取此一文兩句之義而曲為釋固是未[紵丁+死]一部上下要意宜審詳之然應知此一文釋前起後前謂勝人法亦即開顯意後謂後諸開顯而作本也前含通別二義故有兩教釋今即釋別也應知前之一言即具二四謂理等及開等也理既具四次三亦然則前一言非直二四亦具四四矣今釋理一四句既約四番餘之三一既例有四句之義亦即例知皆有四番之義則有四四一十六句之義然但一即具諸故不別論總章既爾下四例然長行既爾偈頌中亦然上周既爾中下亦然廣說既爾略說亦然迹門二十二重既爾本門二十重亦然而要以此一為餘作本若於此中不深得意餘能會哉宜放常情從其妙道勿拘於積習以疑於正要思之思之。",
        "from": "X29n0596_012:0437b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "昔方便下簡權釋疑顯成實義何者昔日方便三教亦得有此開等義不釋云約義亦得有開等四義而無佛知見義是故權而非實今並開入佛知見故是顯真實本有之理故為理一前之二教不說本有此佛知見性無可開顯別教雖有而與惑隔初心無分緣修除麤惑已然後方見故並為今所開破會故並為權法也既無圓妙性德何用須更辨其修故不須更曲辨三教開等四相故今不復論矣次釋人一者有通有別通即九界別且三乘開會皆成一乘真實之人故也文釋有標釋結釋中舉昔化事以顯化心事雖是權心正為實此由本是故也次引文證二結者以此之故即是開權人顯一實皆同一妙也次行一中初且約行一消文次更明有兩向之義初中有標釋釋中經文四句但是二義初二句正明行一下二句是重明意且初三乘釋諸眾行釋作此明昔權實之行非一實也為圓下釋次句常為一事也圓即一事一實行也此亦就佛意與向一也此行下重釋成即下二句是上所為之一事也即是者能如此說者即是開權顯實皆同一妙行也下約兩向釋者含有二義故也於中初且約行明二次仍通約四一皆明二義以彰圓妙無方故也初中標次釋後明所以今意釋中明所以得為兩句之義初明為教之義次明為行之義光宅從初義故為教今從次義故為行以義便故次約通明二中亦有標釋結也標云然四句者仍前別起此通也四句即一文也義所以也釋中行二已如向釋但明餘之三也應知雖通二今且從一便也初中亦得呼為位一今從理者義如前釋餘並可知下結通義顯今別意故如文所明也次教一中初標章次略消文三廣釋初他人為因者即向所明乘運之義今言教一義亦如向圓頓下略消文也經云但者對權明實即佛意也圓頓對於偏漸今則絕待之名也引前證成教義也說大乘經名妙法蓮華故是教一義也下釋無有餘乘之義先出餘乘即不了不釋為餘義總指三教為餘即有餘乘三字皆所無也此句即是總也義者以所詮並未了悉故名有餘如大經說以此有不了故非一佛乘以非一乘故非教一今既云無故是一矣約開會義故云無也。",
        "from": "X29n0596_012:0438b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下廣釋者先述異次正釋初有三家初家總束三乘為二初無二乘故云無二次無薩故云無三即是無初教三乘也下當合破故此未論次家亦是無三次第與前翻也若作以下合破前二釋也三乘有二皆佛明言所無盡不會但一文義乖反故並未可次第三家但無二乘不無菩薩以菩薩為第一故次第爾前二家無三且猶未可況此直無此二又次第反常故甚不可次破中先破其所無次破其次第初中先破二三之義次結其過初言三藏者以其但知有初三不知有共三故也言其過者如此所存仍是有餘何關無餘故非一佛乘也下破其次第中有三初明違經論次第以經論次第而破之後結其過失並如文易知。",
        "from": "X29n0596_012:0438c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今言下是正釋即約五味以釋前數就橫今更竪釋故約五時以文義便故初釋一佛乘即第五時正顯此經開會意也義已如前次釋無餘即對華嚴彼猶帶別別教何故名為有餘釋言帶方便故以能詮次第歷別非圓頓了義故是有餘說也此則有餘不是一物但以一無為能有餘以下便屬所也次消無二無三約次二味般若有三所無有二以有餘故方等有四故所無有三並有餘故次況顯於三藏此非直經釋亦盡矣並從語義便故故云爾也祥云無緣覺第二聲聞第三也問何以知者答數之次第從一至三上既言但一佛乘是故今明無第二及第三也文相歷然不應更有異釋有人云二謂聲聞緣覺二乘也若三者謂三是中大乘也有言二者大小二乘也有云若二者謂人天二乘若三者謂三乘也此悉非解不須破之今謂儒者云博而冥要續僧傳云此師學最當博今謂博則不博矣要且未要何者經論所明二乘眾多菩薩不一如其所執且猶不知有多二乘況更能知多種菩薩若必爾者則婆娑四階三乘十地三祇六度百劫與三大無數十度萬劫應皆是一乘不如其是者昔時已說則皆已得何故定起斥並不知三皆疑請三周說已三皆疑除餘解如是一部之中義尚不能知豈謂為博非直不能精要亦未為富博能橫達三五七九皆會如謂富博竪達五味同一醍醐如謂精要矣如後喻中當委明之此中未正要矣然前四一同是釋出世意應須會令易見謂為令眾生一句貫通於四謂為令同會一理但為教化菩薩但為一行但為一乘說法文云以者為也但為此四一而出更不為其餘也故並出世之意若準皆具六義此六應明五濁簡勸二也謂出世本為一實為五濁故權說於三今濁除實顯故不得不信不信則上慢矣文雖互現互現於後義必具於此中知之。",
        "from": "X29n0596_012:0439a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下是總結者前於諸佛顯實章中開為五章今此章當第五故云爾也而疏本擬從成諸佛四一文也七字誤落次總談三世章末故前語不成就後義無所從故並除之所不應矣故今移次於前則盡矣今文為結前嘉祥為標後今觀文勢義當兩向不得偏故經云如是謂皆為顯實令得四一故也此結成前三世十方皆爾即起後也故前云此總為後諸別作本即此意也。",
        "from": "X29n0596_012:0439b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次三世章中有三初因論四義次因明九世三正消其文初中所以先明四一者因向總四復論其別故也先約文次約義初亦三世皆云一佛乘一切種智故是教行二也亦即兼是科文謂總別也次約義者相狀如後自明次因明九世者因文明三三必九故故明九世於中有三初舉經總標過去以下次略以點示一世各三故也未來以下三別示相狀初中文云十三全云十三無文出第十一經中但標三世各有三亦不具出相狀緣經中先言未來故文先明也過去準知者準望現未可以知之不欲繁文故但注(云云)初釋過去章先明義應有六約文但二餘之四義指上指下上即諸佛也下即釋尊下正消二文舉昔開施為今開發也說昔施權之意即是顯一實也並如前所明例上以下即明顯實具四一也權教皆實教故教一餘三例知不次第者不與總章次第同也雖不同前此中義仍為便謂為人說教人稟教識理依理修行此却為次便然妙道無方亦不必定二文二義故云兼也次未來章二文兼六又二兼四並如向明易知故直注(云云)次現在章正是十方現化主也正欲以現證故在後與釋尊接引初出意者更作異名重顯意也前言大此言多一也此即出世之因緣也別即為得菩提涅槃通即還是一乘四一乃至四四義矣前為別釋前起後故在顯實中明今為通成開顯之意故在初說(云云)。",
        "from": "X29n0596_012:0439b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次開顯二文餘四義亦指後也文具四一者前二章約義兼具今即文義並具二別二總所以前以此為總者以有是諸佛之言故開不俱得應知此三世章與前總章有二不同何者前總四一並約能化以論三世章中皆約能所以說故文皆云是諸眾生從佛聞法望下頌中即是所化受行悟入又前理一有開等四句今但有三而不明開所以爾者今謂此蓋互略理實均等或取論意以解今且依所宗義大略爾也。",
        "from": "X29n0596_012:0439c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次言廣釋迦章者前初分二章謂廣前二略向總別四已廣諸佛略開顯竟此下即當廣釋迦章故云爾也於中有四初標示章門次六義闕一三科出其五四隨以解釋前三可知次釋開權中經文有三初明照機隨其以下二明施化即敘昔之此二名為開權也將全盡文體應大分為二初明道同次正明施化於施化中方開五六文從省要故道同之文仍寄於開權中釋宜應知之疏釋中具解三文初順同中先釋我字次釋如是我即指自身如是正明化道同謂先差而後會也所以爾者正由體同故用不得不同故同出濁世故也次釋照權機文有二句釋有三義三謂根欲性故也此文有欲性二字而兼三義有何者文云欲次文云本牲是二字又云深心即根義故即具三又頌中云知眾生性欲文統收以彰三世故有三也次釋三義最初習故名根現有好樂故欲後時遇緣發生故是性總此三為因為感佛照而化之為緣為應方便下釋施權化即權應利益也開者施也此總指昔四時權化也下釋顯實言如此者總指昔四三之權法也前四佛章皆云是法今云如此皆明權為於實作此說者即顯實也前總章但約能三世章佛乘屬能種智約所今此二句並通屬能通所也然顯實必具四一故即明之言一切是行一者應知一切通於能所正應一切種智能知即是行所知是理一文從簡顯故互言之有此三則人義自明故不言也。",
        "from": "X29n0596_012:0440a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次五濁中言釋開者兼意以標章即釋成向有開顯之所以也次文釋之明矣將舉等者即更科此文為二意也而言意者謂今昔隱顯之大意也如文自釋釋中初標其意言未明者今此是明之也其法以下是正明也中有二初約當文明有而無只為以下採取正文以明無而有初者復有二義一有無之由二正有無由者正由法界體性清淨湛一如空故其法就體清淨位也湛一相也如空喻也法界一切性依清淨無相離染湛一普遍不動如空三義常遍無礙喻上三義正由此義故唯有一無二三也此文但明無頌中具明有無故頌云十方佛土中等也而言十方佛土者正寄通明法體以明有無之由故也又正應知無五故有無五故無有五故無有如文所明即無五也(云云)尚無以下明其無也略明無中間三時之所有即無三五七九之物也只為以下明無有也前有而無唯一而無三有由有正今明無而有無一而有三亦有由有正五濁障重是無而有之所由也實不得宣即明無實也須施以下明有權也正明故有故言下引證分別下例顯此是舉五濁釋開之意矣此義特要宜極思之。",
        "from": "X29n0596_012:0440b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次正明五濁中言唱數者五是其數以言宣之故言唱合而言之故云唱數既言諸佛豈獨釋迦通前總別故前云互矣就濁是滓穢暗惡不清明義故餘經中亦呼為五滓也次列五名則此五物皆同暗穢使於妙道不明故也下明體相者如是是指前之詞即是示前之體相也記云如是為體相者濁體及相不可具頌頒但略云如是經雖不具疏文略述還指釋文共為體相下所引文是也云慳貪等即見修二濁又不善之言通於見修唯有命濁經文不釋既有眾生等三命必有故全云體相者從如是乃至嫉妬是也言如是者將明其名下體相先更指上所列之名然經從略但有劫等三濁體相仍合明之如云劫濁亂時命等四濁聚集之時方名亂之時也故經云亂時即出劫濁之時也亂又即濁惡之相也次云眾生垢重即出眾生濁之時也垢重亦即濁惡之相也次云慳貪嫉妬此略出煩惱濁之體也亦即濁惡之相也經為從略合而明之疏釋務其易知所以離分先出其體方示其相就相是體家之相故開合俱可。",
        "from": "X29n0596_012:0440c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "疏文為四初標次釋三生起四料簡初文云如是者明體相也者斯乃略牒經之二字非唯指此二字而為體相今謂此文從前以來不能決定今且依疏文於中有五初正料體相次明其次第三廣料簡四明四悉五多門雜釋初體相中二初合標次別釋初言如是者此二字是結指於前謂向列其名即有體相是名下之物云則有相狀文雖闕略義必有矣故列名已而直指云如是即名體相並在其中疏從此義便寄以釋故舉以標云爾次列釋中初體中應有通別兩體以有通別二名故文中但出其別也初劫云無別者對餘四有別體此一總四故云無別劫是等者梵云劫﨟娑此云時也通於長矩雖通長短而經論多說劫名長時故今云爾剎那短者論云時極短者即一剎那故論頌云百二十剎那為怛剎那量﨟縛此六十此三十須臾此三十晝夜三十晝夜月十二月為年以故剎那是短之極也準此文體次第應先翻名釋義及辨長短次則正出其體謂無別體但約四等及引文成則易知今文似不次第知之廣如大小二章未及會也所引次釋文者正明總四為體亦正明濁義也次眾生體眾生之義後文當釋且言無別體者眾生是人人無別體但攬因果二法之上立此名字故也所引文者亦是釋濁義也以是因果法上名故是垢重以重故即濁也次二體及義於次相中自顯連持色心即先業種之功能也亦於次自現故注(云云)次釋此別釋也若通言者皆不出於無明即無明以為濁之總也次釋相者謂五濁之相狀也先正釋後結廣示略初中即有五別初劫相中有標釋結初云四濁等者記云空成壞三而無劫濁於住劫中準悲華經八萬至三萬亦未有濁至二萬歲為五濁始四濁增聚故小劫名濁此總標也下別歷四濁顯劫濁相於中有法譬合法由四濁聚小三災起次嗔恚下明小災由煩惱盛次災起下明由三小故四濁增煩惱倍隆明由劫濁煩惱隆熾次諸見下明由劫煩惱故見濁熾盛次麤弊下明由前三故眾生濁摧年等者由四濁故命濁積年成壽年摧壽減故是命濁眾濁下總結約譬中水譬劫濁由風波等水則奔昏由餘四故致劫成濁風譬見及煩惱二濁波譬命濁魚龍譬眾生濁合中初正合次舉二例助顯初云時使然者互相濁也次舉二例欲界地使之然園處使然類明顯時濁使餘四濁轉盛總結如此略是劫濁之相廣如二章所明應知此中皆約極甚以論為濁之義下四例爾煩惱相中約五鈍使各以喻顯其相貪心之相如海納流嗔心之相如蚖吸毒撓諸世間下三例爾虺或作蚖正應作蚖故下文毒蛇虺蝮也吸毒蓋縱恣其毒也撓者(乃飽反)擾也亦音蒿義同蚖踞(許遙反)喧也非此中意亦音遨訓困亦非此意正應作嚚(魚斤反)傳云心不測德義為頑口不道忠信為嚚今此中意都不識世出世間是非道理故也度謂法度故孝經云進退可度去呼不得為入疑心如納網事生疑豈可語實道理結如是五狀不同是煩惱濁之相次明見濁相此是五利使亦應即有五相文中舉四前二即五中之二次二即五中之等類也無人謂有記云身見也有道謂無邪見也又應反云無道謂有戒取也所通非勝即見取也偏執有無即邊見也十六知見大論初列其名謂一我二眾生三壽者四命者五生者六養育七眾數八人九作者十使作者十一起者十二使起者十三受者十四使受者十五知者十六見者論次第釋云謂於陰入界等法中無明不了妄計有我我所所實名之為我謂於陰等法中妄計我生故云眾生謂於陰等法中妄計有計我能受一期果報長短之壽故謂於陰等法中妄計我命根連持不斷名為命者等也廣如論中及法界次第中釋不可具載然此十六且依大論若近所釋其數增減不定都名亦別具於別文未及通會六十二見如後自釋總此諸見橫竪周密故總立二事喻之纏縛重顯上羅網屈曲重顯上稠林不能得出雙顯上二既稠且密何由能得出離故是濁之相次眾生濁相眾生總六道色心即五陰實法妄情不了攬之立以假者故云宰主次喻合正顯其相二是黏物犖固總喻其妄計為實宰主次略合正顯其相情之甚矣由此甚計造業故故漂流受六趣果報次又重喻顯其妄執雖處處受生都無定實而謬執能如此之甚是其濁相次命相中此是業報所得業不定故報命如是是其濁之相也下總結廣示略廣如諸經論中所說此向略語其大要雖餘廣說非此所立亦不能更具論故示云爾。",
        "from": "X29n0596_012:0440c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上明體相正消文竟次明次第者謂五之次第也如文所釋即因果總別故為次第然次第不定二義今此是次第義若當時從機所宜則不定故經文不爾正顯佛出施權之時故先劫也。",
        "from": "X29n0596_012:0441c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次料簡者疏通釋疑也都有四番問答初番論大次番論小三番論大小四番大不即小釋此四種疑也初問者正是此章之要旨正緣障大故初不得說即初說大相違故有此論也答中明具有四義初總標明有障有不不得一向也次別釋釋中初一句正酬華嚴之問後一句正顯今文之意中間兩句義有相從來耳今言正當第四義矣次約小者例前作問本言障大而有不障本不障小今亦得有不故是例作問也其既兩向只應二句何故為四若言亦有與宗相違若言不則盡應初得度何不得者故須有四句答中亦例有四義但約小乘為實亦有標釋釋中初義一聞即悟故生來無過故具如上文所明前云鈍此云利者大小相望也次亦聞即悟故現極作惡業如其經中所明故其人雖迹本為於實取為實邊說正為顯此一類之義故也經中具說皆共所知不在繁文次義根鈍共知遮輕生來無過故也第四句通說一切以果驗其因故也此四句前三酬其為障違宗難第四一句詶其不障盡初得度難明有不障今言不者約前三句從多說也義仍有者約第四句一分義也次第三番者初番約頓次番漸初今此一番即當漸說中間三時意也何以知者以中間具四三教義故也問中不在兩處指前二而得聞者即指次二時也答中欲明大小皆得故約四門為對四種相性故此不依常之次第所通無實當體後後名義勝前故致然矣初兩四門能所不殊能入巧拙故得有二次二亦爾此則前二所不入者並皆得入不在他方亦非永不但使有緣無不得矣此亦待時不待時義此則妙經之前差別之化盡於是矣應知根遮知根等四出大論二十四釋十中義通小大故今正用彼義然若委得前來乘戒煖急之意一切皆可通矣(云云)之意略爾宜善思之次第四番前之約昔意此一番用此經意料簡初第一番中第四句意即明最初不得鈍說法華即以此一類於此妙乘為障不盡皆然故云一往不得即說法華故云障大而即得聞小益故不障小問此所以故云何故答中初答障大所以次答不障小所以初中引大經意有釋結證釋中初明本濁若聞以下明根鈍聞重增疣下引大經顯成增障之義舊即外道邪師駿癡也乳即法駿好惡即邪正也不知即不知藥不知病者病即通別兩或起根源者即因邪正二藥而起也藥餌即服其藥謂修行二法也初以無常等破其妄計常等之病遮也後令修真常等破其無常等病是開也彼都不知是不知授藥之可否也無所知等結以故障於大也次引證是陣大也若聞以下次明不障等也即客醫翻於前也厭苦集欣道滅也破其邪計即能除苦集證道滅也結云以此故不為障引證成不障也。",
        "from": "X29n0596_012:0442a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次於四悉者五是所治四是能治即寄所以彰能也記云劫命只是依正二報故即世界今謂二俱報法同是不相應行劫通依正命局於正正是所顯通別二時故為世界次二並屬所為之人令成善正見故次是所治次第一義可知通論各具四從除障之義故此相對合論四也。",
        "from": "X29n0596_012:0442c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若論以下第五更約多門雜料簡於五濁初約因果二因謂煩惱及見餘三是果因所致故一人下次約人法門人謂眾生法即餘四並是眾生所依所用故是法也四法下是法時門時劫也餘四屬法以對時說生亦屬法二報以下是約三障二報謂生命二惱即見及煩惱通說並名煩惱煩惱間業業能招報故云其間眾生下是三假門初二可知言相待可知者即劫煩惱見也記云劫即長短相待煩惱違等故相待見即有無等相待若通證者各具三假依正二報莫不皆從三假而成今從分別且別說也故別對之眾生下三假施設門前三出中論此三出智論記云眾生和合受眾生名命等並是眾生計法又有所計假名對眾生名故故云名通兩處委釋具如止觀第五記煩惱下約凡聖門記云煩惱在凡者謂諸凡夫定有故耳然見必在凡煩惱通聖如具縛者及羅漢向言三通者劫減有佛劫增唯凡又減則有佛增通餘聖又增與減各有無以大小乘不同故也眾生之名具通凡聖命有凡聖報命不同命短以下約長短門一劫之中數數生故故長短別此乃約人及以欲天見佛處說若論初禪即劫命等二禪以去劫短命長乃至無色準說可知三通長短者煩惱在凡故長在聖故短諸見在餘凡夫故長在利根外道故短亦可在餘凡夫故短在鈍根外道故長亦可在小故短一生斷故在大故長長留惑潤生入生死故又見前盡為短煩惱後盡為長今分別濁入生死者不名為濁眾生準說劫但下帶不帶門命是不相應行法須帶陰法論長短時餘並屬法非不帶時非親帶故但在於法劫通下內外門大劫害器故名為外小劫害人故名為內或可四濁聚時特通內外三小下害不害門物即外器大劫起時人已上生隨三不同生三禪處小劫下五道三界門準應別論三五相參故合明之通色如前言命通者亦應云餘云餘四通於三界五道命通具如俱舍中明五道壽別人間五十年等亦應云通於四生四生各有長短故也劫是下共別門易知是通別門從八萬下釋上大小劫全云住劫之中凡二十劫初之一劫唯減謂從壽無量歲則百年減一至壽十歲中十八劫具增與減謂從十歲則子年倍父則增至壽八萬又從八萬百年減一至壽十歲方名一劫後之一劫唯增至八萬雖此不同然二十劫時量皆等今文中約其最初故但論減耳然云從八萬去未詳所出準對法論從無量歲而減故彼論云初從無量減至壽唯十次增減十八後增至八萬言為小劫者此準大論及立世經若梁攝論呼為大劫俱舍雜心地持等論呼為中劫然中劫多種有以二十增減有以四十有以六十悉名中劫言八十遍等住劫既有二十增減餘三亦準住劫而定多少合此四劫共為大劫故成八十(云云)。",
        "from": "X29n0596_012:0442c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上十二門是雜分別五濁義竟下有一番問答是對濁以明清佛是相待之名故也亦是顯成濁有輕重之義故也初問可知答中舉例以顯全云非理曰邪今謂反顯理則為正知初果有正無邪儒云凡人任情喜怒違理顏生任道怒不過分此亦近邪止義矣全云準此以清反濁此去增劫及減中二萬之前既未名濁皆是五清此上五門既釋五濁準其次第應先體相次次第三雜辨後可料簡四悉以三正釋五濁故次論障不障故料簡後明五為能所治故有四悉次第正應爾也思之思之次下應明釋結之文疏略不釋記亦不言定云從劫濁亂時下是釋諸佛以方便下是結但釋三而不釋見命二濁者眾生攝命隨彼眾生連持有命故見是煩惱攝故既云諸不善根則攝一切煩惱故全云從成就諸不善下方是釋結之文即以所化之機成就諸濁之不善根遂致如來施權隱實此即釋成為濁施權之意亦是結成其意故云釋結言諸不善根者通指五濁由有此五廣生過惡故也今謂一住隨文初釋似是謂釋前五結前五也意雖如此義未的明也若其次釋於文起盡似如未然釋結只是一義故云亦也今謂從如是下通是釋結如是二字含於二義謂即指前而復起後謂如是舍利弗由是五濁之故云諸佛方便等也如是既含前後二義故疏取指前義邊名為體相下為釋結釋成昔日施權之由亦即是結其意要如是含前後及釋結皆不相離也下文頌中所牒此名皆云結歸釋意以二義是一故不定也至下當更明之此中且爾又經中故字古今上下不定今謂義雖可通正應屬下詳釋亦然。",
        "from": "X29n0596_012:0443b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次下釋簡真者全云真是已證小果敦迫之今謂此恐不然上釋昔日施權疑竟下約簡偽篤令必信今日所顯之真實敦者厚篤之謂厚逼之使必信也所分二章初言真偽者謂簡非真顯是偽也此二章名各即含二義也初章之二即向所明二也經自分明初簡非中經文三句初二句舉非真正是所簡後一句正是簡非也初句三人初弟子通次二則別今釋其通下二俱非也初略消文次廣約義初明真弟子隨順即聞知也嗣續也既不聞等故即非真也經云菩薩即圓人也次更約義對昔得是於今非也此則施權則是顯實故為非也此即兩重通釋簡非文竟下更別明非義行是知解為本故此文中無真字而具有其義下文具有體證真而非妙實故非理一弟子貫三並是其人既非弟子故非人一次明上慢者前以非真此明是其偽也經文有二初明是偽次更釋成初中先舉偽當知以下正顯是也如此謬謂故是偽也既言皆是故即顯是也疏先標章次釋即正消二文三更重約四一正消中三句初二釋舉偽後一釋是也初言何者者消文以釋上意也言身尚無量者身有其二謂分段變易變易極多故云無量無明是彼生因既未損一毫分故身果無量以大擊斥之二百由旬即界外所生處也如後文釋此並偽也未得等者即顯定是偽也下更舉真以顯偽也真者如是今既不然故定是偽言真是者即妙法也上是約二真以顯偽下更約四真以顯偽能如此則是真既其不然故皆偽也上慢是偽信行無故即成真信從於教亦即所信故真是佛子能信之人即真人也如此之詞並敦逼令其必信舉也。",
        "from": "X29n0596_012:0443c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次開釋者此中疏文稍似難會言易見者應云第二開除釋疑即為二別初開除中謂開除二非即有二別今文從略初標大章即是二科從先開下即是初中更開為二仍兼以顯其義若佛以下方釋其文然兩科及意可知次正釋中經文但開其非疏文更對前之是後正釋經顯其非也二句各有所以可知次釋第二經文亦直開非疏亦仍先舉是然後釋經以顯其非也二文亦各有其所以在文易知所以知如此者以文義勢數固當爾耳不然則無以。",
        "from": "X29n0596_012:0444a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上釋開除二意下釋疑者此亦勢數同然矣疑在文外經直是釋今仍先出其疑然後消釋文也初出疑者以釋文義觀之固當爾也釋中有四初引經略次釋引廣成三引南岳所釋四述他人異解初即下化城品中文也次論釋者向之經義現於此故初引論後顯今意初中先引論問先世即業報之身也有漏業果不得不滅既滅更於何處何因而得具足此中準令述論此問之由以論釋大品而為此問故須有其由諸並不述誠為未了今未暇尋撿論次答中初正釋次引證初中先明無內因果漏因緣即有漏惑業不生即無有漏果出外以下即明有也即外因緣果處所言無煩惱名者無前惑業因緣也聞經即具足佛道因緣也次此經為證初證前無內之人我於餘國證前外處即界外有餘國土也為說是事謂說此經即具佛道因緣故名是事上引論釋竟下明所引用之竟共成一致故也永云他人所釋云生滅度想及於餘國值佛者是博地凡夫預生此想此人即橫於他方見佛聞法非謂羅漢羅漢以定力不捨身近代皆同此說今謂此經下文大經八六等說楞伽醉酒及大論釋彼若典據任彼所依今且依如向經論所說最後了義為憑未能從其餘說次述南岳所釋記云下有三義並南岳釋今謂向以從有餘國土中佛故名餘佛此以四依為餘佛此是圓因之位同以妙知覺了一切故名為佛而未究竟故名為餘次下兩釋直對釋尊指其餘他佛名為餘佛初二約羅漢後一約凡夫初二正消經後一約義也羅漢念十方者善覩妙教大機發故也南岳每講大論而更此三釋者為顯含多意義故也次異解中初出兩家後明今意初家非約羅漢正約凡夫次家不約凡夫正約羅漢初家先以三義顯非羅漢後正會文顯是凡夫初三義者初直明非何容以下破他言是末法以下三是舉況以此三義故定非約羅漢既非於經如何即牒釋云正是約凡夫也次家即破瑤師正顯是約羅漢文有四句初明凡夫易信次明羅漢極難三引文證四結是非注(云云)明意爾矣又言此直異解今不用者是今意也謂此兩家相抗但是異解非是正義正義如前依論及南岳總有四義是也記云此九字應作白字書之前二家亦非全失故云異解全云破古為三初敘昔次引他人辨非其義必然下今師正釋(云云)注文者既引昔破又許其當不合更云不用縱指所破云不用者不合注多是後人謬加足耳今謂若實是今所斷固然如其非今此又一謬宜其詳之次結不虗者總結開之與顯皆不虗也止物謗心四字是科之意言此為三者又有三句點以顯義亦不用便即以為三科既非急然不俟更碎科也次釋頌中大分為二者上文有三謂許說受旨正說今不頌受旨故但二也雖言簡誡只是簡許以誡聽即上簡中許之文也正從其要故三中但頌其一簡之二也又上中簡有釋今但頌釋簡退之由初明其障重故退次明無機故簡總二因緣故退故簡合要言之但云簡也文中初舉三失通四次明經從別說通者通是凡夫故別者各有所以並從多說又正是此五千非謂一切皆爾慢有其七如前所明此三眾以顯其二得禪謂聖果者如大論阿蘭若比丘修得四禪生增上慢謂得四果恃此自高不肯復進臨終之時見四禪隱便生邪見謂無涅槃佛為欺我惡見生故先種中陰阿鼻相現命終而墮諸比丘問佛此人今生何處佛言生阿鼻獄諸比丘驚疑坐禪持戒便至爾耶世尊為說上因緣已說偈多聞持戒禪未得漏盡法雖有是功德是事難可信墮地獄由謗佛非不開第四禪言矜高者自恃其賢白矜男況多爾有云慢中之增慢中人之上名增上慢今明增上是勝之法謂得增勝之法恃此自高名增上慢與邪慢何以異真諦釋云都未得聖法而恃怙邪法以起慢名邪慢若得少證法如得四禪等謂是究竟名增上慢有懷者有心於勝道故即是慢今謂只未得謂得也正直之道深故淺不能信也不自省者不自省察己之過位有無慚事矯誑故是無慚反此則為有美此即內凡聖位此猶未得舉有以顯無也於戒等者戒名通十如大經大論所明今文言缺漏即十中無前五也律儀含三謂不穿不缺不不破經略舉其一即攝三也漏即次之二也定能防心地惡故定名戒道能除惡故道名戒既無定慧起諸惡過故是漏也此前五既無後五不在論故不言也瑕玼是玉病之內外故喻此無內外之戒也覆罪釋護自得釋惜都不知是非也小中小者四果之智已是小四禪又是小更加謬以有為無愚小之極也。",
        "from": "X29n0596_012:0444a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋糟糠中先解二字次約法合三釋所以但釋其一亦應例顯未得出世禪定故如糟糠易知故略次合釋二喻者無大機不可起發也非好器不堪受妙道也雙結遣退之由以故爾矣此兩釋初是正義。",
        "from": "X29n0596_012:0445b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "頌誡許者正頌簡許義即兼於誡許故也釋初頌諸佛章文有二先與長行對辨其異後正料釋初中有三加四初三先標列次相狀此文義相狀分明至是易知不俟更繁述也所以如此異者至聖當時鑒機理故互顯不繁文故前云次第亦無在故要具此六義乃圓成餘不俟論也次料釋者上文有四今加五濁及勸信故成五也文雖有五義只是四仍闕歎法及簡偽也初中又為二者上文有三謂標釋結今此二文兼前三義也初言施即是開也此有二義同體又即化他並是修得也言權法者同體之權果上之用也祥云所得法謂實智方便方謂權智也(云云)言頌上元數方便者釋也頌隨宜者即上初標之文初一行即所照機宜也即照九有七之機也而為說七法而發之即次行意也佛悉知一行正頌隨也次說八部即隨之分齊也隨欲之宜下約四悉以顯隨宜之狀也宜即因盛感即緣應以權道感應而能致利益也即權樂宜治也既為方便故不論第一義次更釋經所照機宜之文希望名念者與欲義同種種所行道即所念法謂三五七九等法此二句通言今約別釋即屬現也過去以下經文雖通義即當別以下句有先世之言故文便約過去以釋性欲即念也或可下更釋即互為也現欲成當性過欲成現性皆有其理雖通現未正意在於往現也全云或可下釋伏難伏難上長行中釋隨其本性之文云過去名根未來名性名性今云過去所習名性者何乃相違故釋云習欲成性屬未來性生習欲即屬過去義兼二理兩釋何妨(云云)有意略爾故注(云云)言傳傳為者其言雖通今正約機感故別論其通也善惡有通別別論世出世大小等可知通論遞傳是善是惡乃至別教地前登地相望也今通說故云傳(云云)心略爾佛以以下總攬其要釋此開權文也九部如經文或說十二部有通有別通則大小各十二部別則大十二小但九或說大小各但九而義有別謂大無緣喻義以根利故小無廣問記並是一往為緣別說通皆十二部也故大品云魔作比丘為菩薩說聲聞十二部經今此正論開權顯實故且從別說也指玄義者如彼說法妙中廣辨此不可具故指彼也然經論古今諸說不同後學或不能旁通今先略明其要實然後正消此文有云經論不同凡有四句一大小俱有十二大乘具足小乘隨分所以明十二部者以是一數之圓又治眾生十二緣病故也二大小俱明九所以但九者亦是一數之圓又為九道眾生故說九部小乘法淺故除三淺狹故無方廣授佛記非其宗人小無補處義故除授記法淺有人能問故除無問自說又大士能為他不請之友故有無問小不能濟總要待請方說故無無問自說大乘根利直說即解不須因緣及以譬喻亦不假論義故略此二也第三句小廣而大略如地持論說菩薩藏名方廣經聲聞藏謂十二部此意明大乘十二為明方廣之理從所詮之理為名故十二名方廣小乘十二不名方廣之理故在其十二部名沒方廣之稱第四句大廣小略顯大乘是滿字故具足十二小乘是半字故唯九部即今文所說正是法華宗也次明體者通以言教為體今謂有能有所合即五法能中三假一實可知他又為二謂雖有十二不出長行偈頌今謂即貫散也他又為三謂修多長羅祇夜伽陀也此上之三並是體也(云云)。",
        "from": "X29n0596_012:0445b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上是通論已竟下正消此文者言修多羅者亦修單蘭亦修妬路正云素怛覽亦素怛蘭含於五義要而言之此云經也即如一切經初皆云其經者是新云契經謂聖人之言契會理機故也此有總別如從如是終至奉行皆名多羅此總相也於其中總隨事分出十二經其餘直說法相者是別相修多羅也有云成起二修明直說語言為修多羅謂別相也涅槃云從如是至奉行謂通相多羅也言加陀者此云不重頌亦云不等頌新云諷誦謂不頌長行亦名孤起頌經言本事者此方言也梵云伊帝目多伽此云本事謂說他往時之事也如下藥王有本事是也言本生者亦此方言梵云闍陀伽此云本生謂說自己昔時所生之事也經中多說其事繁不能敘言未曾有者梵云阿浮陀達磨此云未曾有法經亦希有法經新云直云希有法經即如經中所說所現奇特殊常之事皆是希有之法也言因緣者梵云尼陀那此云因緣謂因緣事也而說開施等教名為因緣言譬喻者梵云阿波陀那此云譬喻謂託事類以顯法即如此方比與之義也言祇夜者此云重頌謂重頌前長行也長行已說今更頌之故云重頌亦如此方序頌之流也言優波提舍者此云論義謂自為為他光揚發起問答往復以論盡其道理故名論義經也此是略明現文九部竟也若十二者更加其謂廣問記梵云毗佛略此云方廣謂語義真正直而廣大為求無上菩提廣度一切眾故也梵云優陀那此云無問自說謂其法甚深無能問者佛自唱說故也梵云和伽羅那新云縛誐羅拏此云授記謂記三乘六道所得果報及成佛道等事故名授記經也此三并前九為十二部也新云十二分教諸異義同今此正約施開權教別說故云九部大略且爾廣如玄義。",
        "from": "X29n0596_012:0446a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次言結意者結束以明施開之意也即長行中是法非思量等是結開之意也初一行明無大有小下二句明以無有故息大而說小也由貪著因故有苦果有小而加有苦故為說於小也此意者以此之故且為說小意在一大教即是結施開之意也。",
        "from": "X29n0596_012:0446b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次頌顯實中三行理一總標既言佛慧佛道大乘並是所為所令會於本有故並理一次三行別顯四義以前長行顯實理中有總別四義故也初一行即頌總也是者是向九部也但前續出世此兼說法之意知之次行總頌別中三義第三行以有入字故即頌別有第四義也以故者正是顯實也並有通義且從別要。",
        "from": "X29n0596_012:0446c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次頌上人一者疏文先標所頌上直以下與上辨異有佛子下正消經文初言人一者文皆約人故也辨異者前略此廣顯義會機固當爾也上就能意此約所也略廣能所互相顯矣祥云初三行半歎昔聞法已得入者不是開會方便之人後一行始明今教之意此人都不識開會之分齊故作此執所會唯是三藏二乘尚不出於共教二乘況於菩薩既不知有其方便菩薩何能識於能開圓實一乘此未足以論此妙道今意並是方便所開會矣初三行半即別同會別教次第大乘也後一行通開會一切方便也初中文初牒示其人即初行文也即地前六度行同堪為說也為此佛者即釋次二行半文有為說與記歡喜結成為說即開顯心喜即領解並現經文可尋次一行通中初一句通舉其人次句明聞法次二句即利益也初通明兩教三乘也所以前列別言別此更七者恐將別為究竟故先別言之也此總者言其同皆是方便故也聞我說者即聞此說也一偈者要在開顯也成佛無疑者如理覺了權實無方妙解而無或也此蓋以妙解誡勸之也。",
        "from": "X29n0596_012:0446c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次頌教一中經初三為正明實教唯一次三句權則有三後一句明方便為三之意疏文初標所頌次正釋初釋初三句唯一次釋次三句方便有三後釋最後一句施三之意說三句為一今牒經以顯故云爾也然他人從說佛智慧下屬後明佛出世意即唯為大事出世也此是與前義及以次第並不相應故今不爾次更釋初三句中第三無二無三義也長行云無有餘乘若二若三釋云無餘者無別教帶方便有餘之說無二者無般若中之帶二無三者無方等中所對之三也如此二三皆無況三藏中三耶今此頌文無無有餘乘之言但有若二若三之說疏釋仍具約三雖具約三而與前義不同言圓入別者圓接別圓是無餘非不是有餘非直別是有餘以圓接之亦是有餘昔未開顯故有此義今並開顯故亦無此有餘之說也記云通中半滿相對之二者通真合二故也由闕別故更引上餘乘來此釋成說假則通論三教言餘及以二三且云相入以有餘皆假故得相入無餘無復相入之名以純一故此指乳及二蘇二味文盡全云此文應傳寫之悞領頌既無疏豈從釋況前長行已釋與此都不相會縱異釋則於前文便合重出豈容於此輙爾增之又云無通教中半滿相對等者亦恐文悞但準前長行自攝諸權教何須異解以或其文若云欲無諸教相接故別解者理亦非要(云云)餘文多所不用況勘授舊本與今文同諸新寫本或多異者蓋魚魯之謬並宜改正但無方等般若之二三不云華嚴鹿苑者收教已盡故從略耳今謂一宗所釋有此二義今意正顯文含二義不欲繁文故前後互出若還只與前同只合指如前釋何須繁長此故不可若云後人輙足亦恐不爾何有輙能此者耶若云勘挍舊不爾者亦尋三教舊本未有異於此者此非甚為利害亦且從之未敢從所斷也。",
        "from": "X29n0596_012:0447a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次頌一行經文有四初三句正顯所為次二句遮次一行半顯成初後一行釋前遮意疏文具釋此四初言事者釋是行義即消初三句也事即所行故是行也長行與頌皆言事也大事出世所謂四一前為三一竟此即頌前為行一一事而出世也次者經約遮疏約顯不以彼正以此行也。",
        "from": "X29n0596_012:0447b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次正釋顯初意也或以初句為總為自次二句為別為他今準餘文初三句即三德三身自修證得亦即以利他故云力也定慧即身手也自證等三句即令他同於己無上道及平等同是三德即玄義三大乘也。",
        "from": "X29n0596_012:0447b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋不以者釋前終不以等也所以終不以者以有此二自證於大而不與他即慳貪乖理違願故不可全云文脫半字應云一行半釋自大而以小化不可勸信中二者內有過則外有畏所說不可信既無故所說可信也惡即五住因果也次者由內無故外益明顯內外德備故說可信是舉果德極可信以勸物信也次舉因者果由於因果可信者正由因可故也亦是況也無誓不可有故可信因尚如此況於果耶今菩提等者舉三事即自他通別通語一期別言身子極舉此三以結成可信勸必信也。",
        "from": "X29n0596_012:0447c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次問答釋疑初疑問言事相乖世多此疑故以問也次釋中三世益物此答本誓今明現在此答今滿此文古今諸釋不同今文與諸釋異宗中消此文者亦並難見今且論經意者昔自行初稟開顯之教了知一切皆同一體立此誓願成佛得開顯說即願是願滿總統經文有五二因三果今言滿者即統彰其五意謂本稟此教立此誓願今得說此是願滿以此經開顯一切眾生無遺餘故所化有差會差即未滿會即滿也如無量義一而無量意歸一從實施權皆如是也疏文云三世者此含二意一顯二密顯且就迹過去約因現在就果因即輔佐開會乃以流通開顯並是願滿即如文殊釋疑佛得定起開顯文殊入海流通遮沙成佛釋迦亦爾此即約因論願滿也現在約果可知若密意者即潛彰本果地三世開顯則世世得開顯已即是願滿若但一世開顯分而未全若得三世開顯方究竟滿密意通本故云三世今且顯迹故云現在從知顯密不相離也今之學者若深得此意知佛意唯為於此當立此誓但得弘宣流通此經即是願滿此是妙意不俟異途古諸釋雖多未有顯斯意者又宗中諸釋亦未深統是意後學宜其敬請。",
        "from": "X29n0596_012:0447c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋五濁中疏文有三初標章上明以下釋意此文以下是科釋意中先敘上下二文異此明以下正明其意雖明道同正明成現化主故釋迦前後兩重出也次科章中云障大者障不得說大也次言障三者是三所治之障為對初章而作是名非謂不得說三為障義自現於第三章中第四即開顯也應知此五濁一章亦即自統收諸佛一化意盡而以五濁為主也。",
        "from": "X29n0596_012:0448a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋初中應知二意謂經及疏經文四句義只是三謂相遇盡教不受疏意有二一者科題二者釋文科題即二義謂障大釋文即四義科題以束經三為二初二句大也次二句障也四義即初句中有能所也疏文初釋初句中眾生如是等下次釋初句中相遇夫大悲下三釋盡教佛道但眾生下四釋無智下二句前三即釋大後一即釋障又前四正消文後更通料簡初中先通舉經文次別釋先眾生中二初釋通名正法念下次辨差別初有三義記云初釋對他得名次釋從自立稱後釋即是功能新譯恐濫稱為有情三義都失今若直依文三結即是其義若欲即名易解者初約眾人共生故次約眾法共成人故三約眾因諸處受生故此故易知若依證契大乘經(舊譯名大乘同性經)楞伽城主名毗毗產而白佛言世尊眾生者是何義注云梵云薩埵舊譯云眾生或為有情也佛言主眾生是有情總眾和合故所謂地水火風空識名色界入緣起及因業果會對而生猶如蘆束或執為我或曰眾生生者養育者乃至受者想者當知即此皆是眾生想今謂經中此釋即今文三義之中次後之二義也故知今文三義釋名義足言眾共者即三災之後上界天眾來生下世界故也正法念下次明差別於中有二初明十種後會五類若依後文初是果報後約造業今且從初初中先標列次隨釋釋中初二通五道餘則不定初言長者有漏果上長時受報更習其業解脫未期故云長也而四但言身心者舉身攝於口也次釋短中五道生死有此二類上一類竟今此一類果報之上而能此業解脫有期故云短也方是常定之義從善至善因果常定故名為方有漏善之因果故云生死圓者唯惡因果無已故也角者聚也下所列者是其三也即於果上起三種業還約三種果也亦名為雜也青是怕怖之皃義亦兼於果也次二易知次總人天名為白也望於下三並是善淨故名為白要是有漏故名生死而不釋紫者記云即修羅種類多故謂天鬼畜如紫間色意謂四是正色紫不定色故以擬之義有之矣若但明五道舉四已攝於五舉青以釋地獄則兼攝紫以此故不別釋若約六道即當之也次會異中先舉經說五異後問其異所以故云其義云何答會之云爾前云生死故是果報今云心畫故是造業最重無明暗心造其故云黑也次漸微故也又云赤者有云赤是喜色今謂善心稍純如云丹心者也白者淨也離下穢也經論辨其因果狀皃異多不可具述故注(云云)略消其文爾也。",
        "from": "X29n0596_012:0448a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上釋眾生竟下釋相遇之文初牒以徵次釋中有二初就事次約理事由於理理必假事事即感應理即天關既相由藉故須雙釋若雖遭而不患悲不能拔反是則能並令會天性矣前文以天性為理一不信請觀此文下釋盡教佛道文有四句前三明簡非後一正明教也前簡三非即七方便非一妙故一一皆明其過佛無此過故不教也後一正明但教有標釋結證體達等釋上實相妙慧也妙慧能體即三觀也實相所體即三諦也即前妙達於方真秘義矣此即開意盡矣生死即二種意如此故云永也次後二句經即第三疏即第四科即第二釋障也根鈍釋無智罪重釋錯亂迷惑也總由此二故障大也即總言五濁障不得說一大佛道也。",
        "from": "X29n0596_012:0448c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次過去下釋疑顯成前義兩番問答初疑問中先舉往二以問於今初舉往二記文不釋諸釋皆云未知所出此問意者初一但願自國此容更有第二又願十方此則已盡如何今日猶故有云何答止意謂通示其意別故言人身報言人身仍須有機緣乃可得矣若言得人身者盡得則更須有別願也以人身與得道因緣別故頗有以下第二問也道理不定假設此問故云頗有答中四句初遮通次顯別三釋遮四喻顯可知次別明中五者五即有五故也初眾生中初一句即眾生也餘並是其濁也都無本唯有惡報惡因惡果三惡六趣故是其濁義矣善事本即妙種也五欲即麤惡本也從癡等引淨名釋癡愛等也從癡有愛釋癡愛也則我病生釋生惱也病有二種身心今云生惱即心病也。",
        "from": "X29n0596_012:0448c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋命濁命謂識中業種識受胎形既微命亦甚危故即命濁義矣疏文便約觀門解者記云但隨便也今謂若無事釋即可如此次既廣約事解正符託事明恐文仍是不次惑之恐是大師當時宜約觀丹解丘於後依經補助便直依次而釋故其然也一念即無明心也一念無明即有行行即業行業即有識名色故即胎如是復有念業故展轉無窮故即世世增長此是心法爾也受胎之微形下是次約事釋也於中有二初略清文以顯命濁次更約經廣明受胎之相以顯命濁之義初受胎即有名色故微形名色即具其五故即五陰陰名世謂實法世也此之陰世皆由報命連持故即命也下釋增長即是釋濁義矣後之二句皆是濁義也所引陰經十時不同即是十世以世世增長亦兼微形之義祥云胎內十時不同為世世增長即應是此十也又約大期以明世世即生生也若餘文入胎經即有三十八七日以論增長經說不同故也若依俱舍但列五位一羯剌藍位此云和合或染或凝二頞部曇位此云皰皰起也三閇尸位此云耎肉四健南位此云堅肉五鉢羅奢佉位此云支節乃至形相滿皆第五位也如是不同皆增長義隨所須下既兼明內外好醜亦即兼釋最後二句義矣都由薄少之故乃有如是逼迫故並是其濁義隨所須者業所感也。",
        "from": "X29n0596_012:0449a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋見濁經文初一句總標二義下別明本末總二義者謂見與濁邪見即總一切見稠林喻其見行繁密故為濁也此取見之極甚故為濁也疏文初略釋三義或云下別解六十二初言五見者具指五利使也經文但言邪今具言五通言外異並非正解故云邪也故嘉祥云總明外道諸見為一邪見邪見眾多故云稠林次釋有無即是斷常二見也言因等者經云依止即是因也因即本故為本末也有引智論云愛多者著有故起有見見多者著無故起無見又云四見多者著有邪見多者著無也次釋六十二文有兩番初中先色陰四句初二即離次二不即言根本者即斷常也有云十六為即陰四十六為離陰也有云大品又云一異為本此經云有無為本亦不相違由計有我故生諸見則我為其本以有我故計我與陰一我與陰異故以一異為本我與陰一則陰滅我滅便起斷見我與陰異則陰滅我存故起常見斷常即是有無故以有無為本有無謂邊見也邊見與六十二見為本我見為邊見之本也大品佛母開十四難為六十二十四難者一神及世間常無常等四二神及世間邊無邊等四三死後如去不如去等四合為十二及身與神一身與神異合為十四也常無四約五陰作之一陰具常無常四句故成二十邊無邊亦約五陰故成二十如去不如去亦二十合為六十一異為本為六十二有人問云五見攝六十二見不答我見為六十二本邪見撥無而六十二計有故不攝邪見見取以六十二為第一戒取謂六十二見為道則四見非六十二攝而六十二見屬邊見也更別異解繁不具述。",
        "from": "X29n0596_012:0449b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次煩惱濁者即五鈍使如前所明他云猶屬見使名虗妄法全云三界依正皆虗妄法非謂指上六十二見若是著見只是利家背上之使非煩惱濁今謂他人不約五濁釋故必屬見今約五濁故屬煩惱則初二句通舉下二句更別舉我慢自衿諂曲媚物正以深著故為濁義也。",
        "from": "X29n0596_012:0449c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次劫濁中初約事解復有二重初明無次明有經云不聞釋云無者正以無故不聞更又由無僧故不聞佛法故無二即無三寶也以長時無三寶故濁之甚也次明有者只總緣此也此無三有四故為時濁次釋難度之所以只為有五重障無一信機不可度也次觀解中明有二邪無二正二邪即是愛邪法邪覺觀也二正即正觀觀正道理無此解行何由能度自度之要故約之也。",
        "from": "X29n0596_012:0449c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下明權者施開義在其中結前濁障起後權除故云是故方便者下二句是即道滅對除前五濁之苦集矣次終令入大者經文初二句斥前權偽次一行正顯今乃一真實有性有修此三疏文具解疏標終令入大者前是一往意為於此今是究竟正遂本懷故終令入也言拆等者解偽也拆斥非體滅障不即顯上拆義正以此故則非真實但是權宜偽物拆字從木旁斥後人意工然從手從來不辨字體謂與折濫故改從斥然折從手由來非木人自為濫字亦非濫也文中多有此字能從正者善矣。",
        "from": "X29n0596_012:0450a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋顯真初性次修初皆對前偽以顯體達對折滅無明即心攝一切法即釋諸法本無謂本性無生滅即釋本來也常寂者寂即釋常自也寂即釋寂滅也此是體性本爾故即是真實也下釋約修以顯真也言本無雖寂等者牒性以起修也雖字應在本上謂性雖本來無者二常自寂滅必待修而致顯故也今人直聞本有便認性為即是更不論修或直勤苦修習而不辨其本性若真謂性即是亦可氷即水用水便火用若直勤修不須識性此即鑿石求水錯水求不知其性之有無矣今此一文除此二過顯於二德也可謂妙要矣然此一文義意深廣上下多釋故疏略點而已既為妙要仰之不已更略申之以彰所忘何者妙法雖曠不逾開權顯實雖廣不過修性性德雖廣不出通別性雖多要在於四修果雖廣不出自他此之五要即文具有之矣何者初二句即開破一切方便門也。",
        "from": "X29n0596_012:0450a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次一頌即顯示真實相也於顯實中初二句彰其體性也次二句明其修會也性中初四是其別也寂滅相三字是其通也初別四者諸法也本來也常也自也此四對下三故即是其別下三收上四故是其通諸法者一切法也即十界十如斥三不通故云諸法即一切法也此一切法皆滅也不然非妙何時寂滅非謂有初本來寂滅不然則本無今有也有始有終既無其始固無終故常寂滅何因緣爾非謂有使之然性自爾故言自寂滅也無形無聲不生不滅故云寂滅大經云生滅滅已寂滅為樂也彼經明修此中明性故云本自也又諸法寂滅謂一切生滅本常無生滅也生滅既即無生滅無生滅亦即生滅也有無既然故即非生既非不生滅也亦即常能生滅能無生滅微妙無方顯實之四義名為妙物矣是佛之知見眾生之本有一切諸佛已修得一切眾生悉當得次修會者既言行已作佛故即修而會矣謂因圓果滿宜極其體也佛子能行之人也道即前性之義也行者修也妙達其性都任而銳之也已者因圓也作佛果滿也一切生滅因果轉成一切種智名來世作佛又隨時處有感而應覺而化之故云來世作佛此即自他作佛義矣世有謬習之人輙謂本來即是而來世為未了矣此即增上慢人都不曉聖教之旨趣直率於愚情自增益其無明之咎誰復與其過歟此上諸義信為妙慧豈不志而勤之者耶(云云)何故性云寂滅修成覺智從便互舉理恒均矣修性各應具三性三皆寂滅修三皆照了性修既相即寂而常照照而常寂絕言慮矣一部妙旨復盡在於此中(云云)今舉上之四義釋於五濁亦可即四悉之意初總障大即世界世界總三故次別障三信知為障故是為人說三除五即對治終令入大即第一義非直數足文上次第義又允合可無惑矣。",
        "from": "X29n0596_012:0450b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次開別頌不虗文中標章來意消文消文雖明其三即當消文非別為三但應為一文也下明頌過去章大消文非別為三但應為一文也下明頌過去章文為二者上文只有開顯今有二即頌上之二也初二行謂開之人及正開也。",
        "from": "X29n0596_012:0450c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次頌顯實言兼具者上並約當章前兼此具上文但略今有二者隨機理應宜故也又前長行三世章中有二謂先明佛施化次明眾生悟入總及釋迦章中則無今頌中過去未來釋迦此三章中則有諸佛及現在二章則無有則於義更顯無則明其不定或略或存隨宜言兼得行一者能入即屬行也。",
        "from": "X29n0596_012:0450c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次廣者於中復自總別總別與略廣者前約文此就數也思之又初總專約能次別專約所各有能所而互有耳所以過去廣明受行悟入者擊今時眾必信悟入故也此文並是歷別開顯實義今對前已別明開權故直名顯實又直說昔為實施權即是顯實義也初總中初一行明昔初照機次二句明昔初化意正為於後也若就佛意昔四並為後之四故即以明四一初即人一次二句即具三一方便通教行故即二一異方便下重顯理一若用以下簡同顯異圓謂同體即異而修也異謂異體各有所為也今之所言即是用異顯於同也祥云異謂神通異於前說法故云異也此情見謂。",
        "from": "X29n0596_012:0451a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次開別中五為三者約義故五就文但三故云五復為三也初菩薩者以文明六度故是菩薩是菩薩義通今是何等若作下釋於中初約義通兩向今但以下明當文則不可定尋上以下準前文義以定判初兩向中約五則但一約七則三三藏最即具五故但初後大中加二故云兼所以兼者七中菩薩即有三種皆行六度而心有異故何者下釋此二義有總標別顯其狀相以相無相二義可知雙非即所為為此次第而修初修相無相次無相而相十迴向中修非相非無相初地證得出本業經若開會即地前也既通有此二義今定何等釋云若此當文但言一種六度則不可定判經前文義即通三也其故然者既言以異總語一切即須具七不然方便不盡權化不盡故定通其三也下明三菩薩既同入實皆成四一之義次約二乘顯一所引二文釋者即兼得緣覺例如只一六度兼三菩薩只證一聲聞即兼兩教二乘也此人皆聞教亦並成教一略不言也。",
        "from": "X29n0596_012:0451a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次釋人天乘中有四初標章次釋會三異解四正消文釋會中初明文不的彰但明下以義故是人天之因不同大要皆謂善業文明造起供養並有相善而有專散之別故知是矣入文自見次述異解中先述彼謂下破言地師者蓋弘十地論師也述其解童子聚沙為佛塔之義童子者即童真地正言此位之人也然地無此名即住位中第八住也古人多分呼住為地故也無二等者解童真義下解聚沙為塔之義沙是表其無著眾行塔是安佛身體之處表其眾生積集含藏以成正覺之心如塔之義也。",
        "from": "X29n0596_012:0451b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次破非中二初破其非後問答顯是初中有三初標其兩過次釋出其兩三雙結其二初中先出其意今謂正顯其兩失即文義亦深廣也下釋顯其二過先標竪狹夫佛分明下釋乖文失初中先破其非有法有喻次顯正義亦有法喻喻於聖凡高下以義可消息也次破其乖文失廣於中初明文廣而棄以下正明其乖若如以下結責其挾既言地住即唯別教於菩薩中猶不能盡況二乘與凡夫殆者危也非此中意又幾也幾近也亦未全是此意也郭象注莊子云殆盡也正當此是即全不攝也下雙結深則狹而不通初心故一致致者得也道理也但得一種道理也經文約五乘而都不會故甚乖下是問答正顯是也問中舉其道理問經之所說也可知答中初云應明三佛性者謂義相開涉應約以明之也三謂正緣了也亦涉於五且約三也。",
        "from": "X29n0596_012:0451b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下約大經以釋顯之然大經有四句準應先標列之然後釋會於此文直取經一句便釋不復標列稍似難見若解釋者應須略知經之通意然後乃可釋會此文從來諸釋都不可會今略明之然後消疏大經三十二云或有佛性一闡提有善根人無或有佛性善根人有一闡提無或有佛性二人俱有或有佛性二人俱無此即經文在列之四句也經文直列而不釋不知何者為善根人佛性多種不知有無何等此是經中一科大義義甚難會古今諸釋種種不同丹丘所釋於中先出舊解然後正釋舊有三家一云闡提人有有於惡邪境界之性善根人有有於萬善了因亦名緣因二人俱有併有正性或心或眾生性俱無俱無果與果果性也河西云闡提人有有惡五陰不善性善根人有有善五陰善性二俱有俱有無記五陰性俱無俱無妙絕涅槃之果性此釋與舊語異而意同興皇作三種釋一總就諸義二就理內外三單就理內通就諸義者理非善惡而有善惡二用善根人有有善用闡提人有有惡用俱有者各有一邊俱無者各無一邊次就理內外者佛性本非得無得約緣或有得無得理外闡提是有得理內是無得善根人有無得之性闡提人有有得之性俱有俱無如上說次單約理內闡提人即善星善根人即羅云此是順逆二化闡提有逆化不善之性善根人有順化善法之性俱有俱無如上說上是丹丘述舊竟下自正釋今明欲依此解四句者闡提人有但有於沒善根人有但有於出二人俱有在河中二人俱無俱不到岸欲更作者亦應無量略出如此又約三諦釋者闡提人有者世諦惡因也善根人有者出世善因也二人俱有者俱有世諦果報身也二人俱無者俱無中道因果也此丹丘之所釋也而不言前三家之是非者亦各有其道理故不言也若前三家之義廣如別論今更略中丹丘所釋之意文有兩釋初約彼經所明河中出沒二義中以消四句次直約三諦之義以釋四句河中七人正譬於此故約以釋此中正明佛性之義故約三諦以釋以此二最要故約以釋然佛性未始四亦無不四故約無而明有也但有沒者即河中初之二人造惡業墮惡道故名為沒即但有惡性亦即境界因性次有出即第三人以上齊第六人不復起惡退墮亦可即是因因觀智善性二人互無可知或可別指第三人也次俱有同河中者河有多種或生死或涅槃若同在涅槃河中謂理性涅槃即中道正因性若在生死河者二人俱有生死生死是苦道亦是正因性二河義俱得當更詳之俱無即無二果性不約佛性釋不能消得佛性有無之言正與五性義相應也次結示略廣然猶釋在何處此結意謂此是依文故前云欲依文也謂若欲更依文釋者亦更有多種四義皆得略要具爾令後知之故也次更約三諦之義釋者即此正明中道體用體即中道用即二諦並佛性義故約以釋也雖有四句只是三諦何者第一第三共是世諦第二句真諦第四句中道諦也初言有者有如此性也世即簡真然世通善惡因果此人非直無出世善亦無世善又既真諦為善縱有世善亦名為惡故以惡字甄之人為簡果故云因也次既出世故是真諦即是善也因者對未至果故也依真修行故是因也俱有世果者猶同世間果報身也無中因果者此語稍似難會不能更述妨難直釋之者正謂惡人未修中道因善人未至中道果合以言之故云爾也不然文實難消惡人但有世諦惡因佛性次有真諦善因佛性互無可知俱有界身佛性俱無中道因果性若欲對五性者前三亦可對三世性果報身正因性第四俱無二果性且論三諦也(云云)遠法師云闡提人有善人無者有不善性無其善性佛法緣起為不善陰故不善陰名為佛性闡提有此善根人有一闡提無者初地以上名善根人通則種性以上菩薩斯名善人彼有善性無不善性二人俱有俱有理性或三俱無俱無果性也此師所解其易亦是亦是一解並有此理故丹丘云更作無量釋也然尅論善根人位分者下既對於闡提上又對於極果則其人分位不言自可知矣今更一義助顯之者闡提即邪定聚也善根人即不定及正定聚通大小乘可以思之。",
        "from": "X29n0596_012:0451c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上以通述大經義竟次當釋疏文者於中有三初引大經所說即是以下判會此文昔方便下正釋此文詶其所問初引大經四中第二句以彼此義正相當故也判會彼文即是此說之義人天小善猶通位頭等更別彰其最劣行也又舉譬顯之老氏九層千里皆其類矣可知然大經河中七人初一常沒即邪定聚次一出已復沒即不定聚次四人出已不沒而未到岸即正定聚第七一人到岸即是極果佛也其次六人即是次第行人皆稟大涅槃教同聞佛性次第而修有此差別今此直是從來稟人天化未聞圓實之說今言即是者不取其解但取初行微善之行即如止觀云初修歸戒等是也下明開會詶其問者若已聞實說任運自到無住果報若未聞實灼然須住有漏果報今開有漏善行即是緣因佛性故能趣菩提定成顯實之說緣是助正因對於果正即了因智慧也緣即善行福德也助正顯果故云因能生覺果故云佛性緣因即佛性也同是開顯而前三乘皆明四一今作緣因雖同開顯而有通別前三出世皆有諦理故明四一此二但是世間事行今開其多有漏善行即成無漏福德莊嚴故即緣因佛性然此緣因即具三因行一即具於四雖異而同無方之義恒在同為有方之見應知要旨有漏之善若不開之終無不受之義三乘無漏尚須開之況於人天有漏而能不受而本業云善不受者彼約已開大乘發大心修次第行者以說非謂全未聞大道者也都非此意今正約開以說若既開之無微不妙何復更有滯麤果報人多謬封良由不體開顯之要故也或曰若爾但開於善惡則無分同常沒者不然每言通別今正語別何以迷通諸法本末常寂滅相此豈遠乎況一句即四句況三諦遍收一切上通釋竟。",
        "from": "X29n0596_012:0452c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "妙經文句私志記卷第十二",
        "from": "X29n0596_012:0453a15_0",
        "context_with_next_sentence": false
    }
]