[
    {
        "source_sentence": "十地義記卷第三本(此卷盡二地中離邪婬戒)淨影釋　慧遠　撰釋福利中初結前起後。",
        "from": "X45n0753_003:0087a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經中初明過凡入聖福利之相住是法下總結住義前中九句初一是總餘八是別就結住中住是法者牒前所說謂住上來四種法也是名住者結成住義不動故者釋成住義所得不退故名不動以不動故名之為住八地已上可名不動云何此中已名不動不動有五一種子不壞名為不動種性已去斯名不動二起行不退名為不動初地已上悉名不動故地持言初地已上如明分月日夜增長善法不退亦復如是三空有無間名為不動七地已上方名不動四修心純熟離功用動名為不動八地已上方名不動五究竟窮滿更無進趣名為不動唯在佛地今此所論起行不退名不動耳。",
        "from": "X45n0753_003:0087a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "論文之中先解初總過示得者聖道是其福利正體舉過凡地顯得聖也下釋餘別文別有三一就總開別二隨別解釋第三釋竟結不相似顯成過義八中前七自分德成後一明其勝進心熟。",
        "from": "X45n0753_003:0087a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "入位列名此句就位明能入也得出世道名為入位就總過中開此入位將總名別名入位過下諸句中過義例然下釋其相先法後喻初成釋入對後所得名此為初出世解位如始住胎借喻以顯如似世人初託胎報名始住胎法喻相同故曰相似經帖可知家過列名此句就法以明在也佛法為家何故次辨如似世人雖稟胎報若在凡家未足為勝要在王家方是勝過菩薩如是外道法中發心求出不足為勝要依佛法而起心者方是勝過故次明也前句已云入菩薩位明知異外何須此句更明家過然彼外道亦常自言我是菩薩菩薩之言無間於彼故復明耳家生已下借喻顯之如王家生故云家生此喻同法故云相似種過列名大乘法中成就助行名為種過何故次辨如人雖復生在王家或奴或客未足為勝得王體分方是勝過菩薩亦爾雖在佛家發二乘心非大福利起大乘行堪紹佛種方是殊勝故次明之下釋其相先喻後合得王體分名之為子此喻同法故云相似大乘生者依大乘法集起一切助道之行堪紹佛位如王子也下以經帖得佛種故名為尊貴大不同小故不可嫌道過列名此句就位以彰出也出世名道何故次辨如人雖復得王體分或鬼或畜道則不勝稟託人報方名為過菩薩亦爾雖住大乘若在世間雜類未捨非勝福利今住出世方乃為勝故明道過下釋其相先法後喻世及出世不攝攝者地前世間地上出世今此菩薩世間不攝出世攝也異道相似借喻顯之人道異於三惡趣故名為異道同法名似下以經帖過世帖前世間不攝入者帖前出世攝也體過列名如似世人雖稟人道諸根殘缺果報非勝形無缺損方是勝過菩薩如是雖住出世若無大悲法身不具未是殊勝要具大悲方乃是勝故次明矣下釋其相先法後喻悲為體者此直指斥於作他下釋悲是體悲行利他何故用此為自體乎菩薩之心益他為主故作他事即是己事故得為體也自體相似舉喻顯之如人體具同法名似經言住在菩薩法者大悲正是菩薩法也故地持云若人問言住何等地名為菩薩應正答言住大悲者是處過列名不住行境以之為處何故次辨如似王子諸根雖具住處鄙劣報則非勝所居堂殿華極超世方名勝過菩薩如是悲身雖具滯着兩邊則非殊勝寂用無礙方名勝過是故明此不住境界為處過矣下釋之中先法後喻不捨世者不住涅槃方便不染不住世間在而不染故曰方便於世涅槃寂用雙依故名巧住住相似者借喻以顯下以經帖住正處者着有是凡住寂是小不住正是菩薩正法故名正處業過列名空資證慧名之為業何故次辨如世王子住處雖華所食麤弊果非精上妙饌自資是乃為勝菩薩如是雖依不住取相染神則非精上空資慧命是乃為勝故次辨耳業是資業下釋之中先法後喻順空智者冥心如道名為順空合空真照稱曰聖智生命相似借喻以顯食資報存名為生命同法名似下以經帖言入三世真如法者智順名入觀三世法平等一如詮旨並舉名三世如如猶空也畢定列名大心堅固名為畢定何故次辨如世王子依正雖勝體氣不立子而不紹心志堅正堪紹國祠菩薩如是自分諸德雖復圓具心不堅正不能畢定攝取菩提志意猛決方有上達故次明矣下釋之中先法後喻佛種不斷因畢定也究竟涅槃得果定也涅槃斷果道是菩提行方便果經文之中但明菩提今此論家通舉涅槃終尅必然故稱究竟成相似者借喻以顯如彼王子心志建立名為成就同法名似下以經帖種中畢定帖種不斷究竟菩提帖前畢竟涅槃道也如是已下第三段文明不相似顯成過義顯示凡生菩薩生者并牒二生入胎已下就之以顯不相似義准下轉離明不相似以驗此文此謂菩薩已入聖住不似未入乃至畢定不似不定凡夫亦然已入胎者不似不入乃至成就不似不成非明凡夫異於菩薩法喻之異何待言論所言入胎不相似者此明凡夫入胎不似有惱無惱顯其菩薩入位不似亦可入胎不相似者通明凡聖凡夫入胎不似不入菩薩亦然有惱無惱別釋菩薩入胎不似未入有惱已入則無此之一義貫通下句皆以有惱無惱別故並不相似如是次下并列餘七不相似也如是說下釋後結文言如是說住此地中名為住者上四十句住此地行前已說竟名如是說住此地也此解經中住如是法是名住者正解經中名住歡喜不動之言略不解釋經帖可知。",
        "from": "X45n0753_003:0087a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋名有四一結前起後二問答略顯三對文指斥四隨文廣解。",
        "from": "X45n0753_003:0088b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "已說住義云何釋名是初分也。",
        "from": "X45n0753_003:0088b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "云何說下第二分也於中具有三問二答然下經中有三十句初十多喜次十念當後十念現對初十句有二問答對後二十單問無答以下文中將釋之際更須問答辨其念當念現差別不能煩重故此不答須就前中初一問答以喜釋地後一問答就地彰喜云何說者是初問也諸地得聖無不歡喜云何獨說此地為喜多歡喜故示名喜者是初答也下經文中初之十句名為多喜以多喜故顯示此地名為歡喜喜相在初此地是其證聖之始是故多喜以何喜者是第二問向者雖云以多喜故示名歡喜未知以何為此多喜下答顯之此地喜者就處以指下經文中初之十句說言菩薩住歡喜地成就多喜名為此地菩薩歡喜故今指之此地歡喜是其多喜問曰下有三十句文皆是此地菩薩歡喜何故偏名初之十句為此地喜釋言初十正是此地行報之喜是故偏名此地歡喜餘二十句攀緣方喜故與異名名為念喜復何念者是第三問復是更義前雖知以多歡喜故名為喜地更以何念地名為喜若以後答應言念當念現喜故地復名喜此略不答。",
        "from": "X45n0753_003:0088b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初說已下是第三段對文略指初說十者初兩問答所明多喜下經文中十句說也後二十者後一問中所問念喜下經文中有二十句說所念也。",
        "from": "X45n0753_003:0088c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四隨文釋於中初十對前住中厚集善身以明歡喜第二對上為義生喜第三對前福利生喜悲是惻愴喜相不順略不就之以明歡喜。",
        "from": "X45n0753_003:0088c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋初門中經有十句初一是總餘九是別論文有二一攝別喜入初總中成總多喜喜者舉經心體根者下九之中前六自利喜之行體後三化他離於喜障前中初二敬之與愛是喜行心非正喜體今攝入總名為心喜次三正是喜心之體攝之入總名為體喜後一明其喜行功能出生之義說以為根攝之入總名為根喜備此三義故名多喜二釋餘別先就總喜開餘九別下次釋之敬喜列名尊敬三寶名之為敬就總喜中開出此敬將總名別故云敬喜下諸句中喜義例然敬三寶者釋其相也此地自證三寶體性信其深勝故生敬耳如小乘中入見道時亦於三寶得不壞信此亦如之經言信者信故敬也此望上境以起敬心愛者列名望自所證如理生愛樂觀如者釋其相也經帖可知此二是心次三正是喜之體相初中後別故有三句慶者列名慶猶喜也自覺勝者出其所慶覺己所證勝地前也調柔列名喜心轉勝充遍內外身心無苦離於忿惱故曰調柔言自身心遍益成者喜是懌悅利益之法前喜微故但能益心今此轉增身心遍益踴躍列名增盛名踴遍益踰前故名踴滿此釋踴也堪受列名喜行成就能攝菩提故名堪受自見近者知己行立取果近也此近菩提與念當得有何差別然念當得念果豫喜今此念因能受故喜上來自行下三化他離於喜障初口次身第三就意明離瞋惱亦可初明眾生求法不壞他意次明菩薩化彼起行不惱於彼後明眾生行不應法不生忿怒不壞列名下釋其相自心調柔先心無瞋論解不動對緣不忿謂他論義自解釋時心調無諍故不擾動以心不動言必柔軟不壞他意亦可論解並就菩薩經帖可知不惱列名教他已下釋其不惱化攝他時以心慈悲身口調柔雖見惡人以道漸化不惱他也不瞋列名前之兩句令他眾生不壞不惱此明自心不生瞋也下釋其相見諸眾生不如說行心乖法也威儀不正身違道也雖見不律念之可愍是故不瞋已說喜下釋後念喜於中初先結前生後對文指斥略列其門已說多喜是結前也次說念喜是生後也第二第三十句說者對文指斥是念二下略列門也有二舉數念當念現列其名字緣已來果名念當得緣今所成名念現得下廣釋之。",
        "from": "X45n0753_003:0088c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "解當得中初問起發。",
        "from": "X45n0753_003:0089a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經中准論兩門分別一總別分別經有十句初一是總餘九是別第二隨要四門分別一者念佛二者念法三念菩薩四念所行謂後七句通是行攝下論依此兩門釋之就彼第四菩薩行中初句是總餘六是別六中初一是其行體後五明其次第修成言念如來教化法者此文不足少一得字准論應言念得化法此念已家當成十地得佛化法非念他佛教化法也。",
        "from": "X45n0753_003:0089a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "論中有二一就總別二門解釋第二從於初二共下隨要四門釋別成總前中先釋初總念佛後解餘別云何念者徵問起發有何所疑為此問乎然此念者念已當果經中乃云念他諸佛云何成己念當得義故為此問如佛所得我亦得者釋答前問謂念現佛所得之果我當同彼故念他佛成己當得如是念者結答之辭念他成己如是念也釋餘別中先就總念開餘九別一者已下以總念佛遍名餘九九句之中皆初列名後舉經對念佛法者正是念法念佛門中開此念法將總名別名念佛法諸句齊然相顯可知第二段中略有三對一以念法成初念佛二以菩薩成初念佛第三以彼菩薩所行通攝餘六成初念佛前中有三一總牒前二顯成共義言於中者於此十中初二共者十中初二念佛念法同為念己當成佛德論家取意說為共矣餘句同然二念佛下別舉初二初言念佛如佛我得舉第一句念佛舉經如佛我得舉其論文念佛法下舉第二句念佛法者舉其論文念諸佛法舉其經文第三言佛佛法二者結明前二以佛與法二種別故前說為二上來以法成初念佛所言念佛菩薩二者是第二門以初念佛對念菩薩復以為二所以彰二為顯共也何不明共類上可知不能煩廣此三對中初對明二亦明其共此對明二略不彰共後對之中顯成共義略不明二文綺互耳念菩薩者舉經對顯以何義故但舉菩薩不舉佛乎佛前對中先已舉竟不須更舉然初對中經論並舉今唯舉經略不舉論文左右耳此以菩薩成初念佛念佛行下是第三門明菩薩行攝餘六句成初念佛於中有三第一并舉七句之文二隨顯下就彼諸行顯成念佛彰其共義三亦總別下總別分別先舉文中菩薩行總一處舉之餘六行別一處而舉念佛行者舉其論文念菩薩行舉其經文此舉第四菩薩行也如是次下舉餘六句謂向行後文之次第有其六句此總舉也念佛淨下別舉餘六一一句中經論並舉相顯可知第二段中先就初總菩薩之行顯成念佛以何顯下就餘六別顯成念佛言隨所顯菩薩行者此文是倒若正應言彼菩薩行隨所顯也名初念佛以為所顯此十句中宗顯念佛故名念佛為所顯矣彼菩薩行為成所顯念佛之義是故名隨明餘六句成念佛中有三問答初一問答總明餘六顯成念佛後二別明以何顯者是初問也向者雖云彼菩薩行隨於所顯彼行是總未知以何為能顯體如是諸念總舉答之如下所說六句諸念應知是彼能顯行體就下別中初一問答就波羅蜜能顯行體顯成念佛後一問答就餘五句能顯之相顯成念佛復何顯者是初問也向者雖云諸念應知諸念之中復以何法為顯行體波羅蜜顯是其答也彼波羅蜜離障名淨是顯行體云何顯者問後五句前雖知彼能顯行體顯相云何下次答之地勝去者謂從初住乃至九地行修轉勝故名為去地盡去者是第十地位滿上昇故名盡去此句是總下三同是地盡之中差別行德於中餘者謂於文中餘三句也以此同是地盡中法故別標舉得化法者是十地中從諸佛所受法明也作利益者是十地中降注法雨滅惱生善利眾生也入如來行是十地中受佛智職及大盡等始從初地乃至法雲入佛境界顯相正爾自下第三彰其總別念佛行者牒向第四菩薩行也亦總別者該攝後六目之為總成初念佛說以為別。",
        "from": "X45n0753_003:0089b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋現得中初結前起後下釋其文。",
        "from": "X45n0753_003:0090a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經中有二第一正明所念現得第二廣明遠離五畏離畏猶前第十句中離畏之義廣故別分論還依此別舉別釋就前經中句別有十初一是總我離世境生歡喜者六塵等法是世境界今入出世真如法中離彼境也餘九是別此九猶前福利相中九句法也少不次第其義大同入如來所是前家過此句就法以彰其入遠凡夫地是前初總過凡夫地前文之中用此為總今為別矣近到慧地是前文中入位過也此句就位以彰其入斷惡道者是前道過此句就位以彰其出作依止者是前文中法體過也前說悲心以為法體今以悲故作物依止近見佛者是前種過此明成就助道種故能近見佛生佛境者是前處過此句明其不住道法為佛境界依之起行名之為生入真如法是前業過此句明其證行成也我離怖畏是前文中畢定過也前據行德彰其畢定今就斷德說為離畏。",
        "from": "X45n0753_003:0090a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "論先釋總我離世境牒舉經文離凡取事釋其相也六塵是凡所取着事住初地時證如捨相是故言離下釋餘別於中有四一就總開別二以轉離遍名餘九三不似下就後九句明不相似成總轉離四不愛下別釋怖畏第二段中皆初列名後以經對入轉離者入佛法也就轉離中開出此入將總名別名入轉離諸句齊爾如來所者法是如來住處名所趣順名入此明境異遠凡地者離凡心也到慧地者得聖位也此彰身別斷惡道者絕惡因故惡果斷也作依止者悲益他也近見佛者大乘行成趣佛不遙名近見也生佛境者世間涅槃佛常遊處名佛境界依此發起不住道行名為生也入如法者空是如法菩薩所證就人顯法名菩薩如證會名入我離畏者勝報清淨故離畏也初句云我此句復彰中間諸句類應齊有不能煩耳第三段中初三別牒別明不似後六并舉并明不似何故如是以前三中後二合一故須別論不得并舉入轉牒初事不似者佛法為事不似凡夫六塵事也遠近離者此牒第二第三句文身不似者慧身不似凡識身也餘六句下并牒餘六顯不相似始從餘六至捨轉離并牒上文如是次者比前對後明其次第如前六句下文次第明不相似下正明其不相似義行不似者是斷轉離出世淨行不似凡夫惡道行也依不似者是依轉離悲依生起還為物依是故名為迭相依止異彼不能作依止者名不相似他力是前近見轉離上得如來助道行力不似不得名為他力不相似也處不似者是生轉離不住道處不似餘處業不似者是平等轉離如資慧命說以為業成不似者是捨轉離成就離怖畢定勝德故名成就良以此等不相似故名為轉離下第四段別解第十所離怖畏先解怖畏畏者牒經言不愛者是所畏事不活等五令心憎惡名為不愛疑慮憂想正是畏體所畏不定便生疑慮所畏定者便生憂想此是心法與心俱起名共心生下釋文中毛豎等事以心畏故相現在身名毛豎等。",
        "from": "X45n0753_003:0090b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "次說已下廣解離畏就此文中初先生起徵問略顯以為起發言次說者生起辭也次說何等次說畏果次說畏因次說離果次說離因文中略故但云次說云何已下是問辭也云何畏者問怖畏果云何畏因問怖畏因此文不足若具為文亦應問言云何離因云何離果亦以文迮略不具問遠離已下略顯其相遠離因者明離畏因乘上言便先明離之無怖畏者明離畏果此文亦略若具應言不活等五是怖畏果着我想等是怖畏因略不具論但云離耳前所離中有問無答今明離中有答無問文之左右。",
        "from": "X45n0753_003:0090c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經中有三一明離果二何故下明離畏因三佛子下總以結之前離果中先問後釋所以問也問由何生因前文中離一切畏毛豎等事故為此問入初地時遠離一切煩惱業苦所以但言離畏者何自下釋之釋意如何解有兩義一以五畏偏障初地初地斷盡故偏說離餘業煩惱通障諸地初地不盡為是不說如十使中五見及疑盡在見諦見中偏說貪瞋癡慢通障見修見中不盡不與斷名此亦如是二以此中為明歡喜畏是喜障故偏說之文中初總後別顯之得歡喜地諸畏悉離是其總也餘是別也別中先舉所離五畏後結能離就五畏中言不活者懼無資緣身不存活言死畏者懼其因盡身報亡也第二因中先問後釋何故問也畏是報法報法叵斷云何可離下對釋之釋意如何以斷因故令畏盡也結文可知論中依經三分解釋釋初段中所以之問略而不解但釋後答於中有二一就初總釋顯答意良以五畏是初地障別障初地故偏說離是初義也又欲彰此歡喜利益喜與畏返故偏說離是後義也二隨別文釋顯所離一二及五依身等者不活依身惡名依口眾畏依意意無智德故畏大眾身意可解然彼惡名乃出他口非在於我云何依口言彰他口惡名屬己由己造惡惡名隨生然彼名者性是口業故說依口三四依身謂死惡道此亦依身何不與彼初不活畏一處通說而別分乎良以此二得捨相對須釋故爾於中兩句初明依身後釋依義言愛憎者是怖畏因由愛由憎故生畏也愛樂憎苦故名愛憎善道惡道是怖畏緣善謂現在人天善報所愛事也惡謂來世三塗惡果所憎事也言捨得者正是畏體於現善報畏死名捨來苦畏受稱之為得依身故者結畏屬身畏捨畏得皆依身也自下問答彰此五畏攝畏周盡何故問也怖畏眾多何故但說此之五種打縛已下答以彰盡釋離因中何故之問略而不解但釋後答句別有二一明畏因二此治下舉經顯離前中初攝五因為二後辨其相言邪智者是不活因取我乖理目之為邪邪心決斷故名為智由此取我懽已不活妄取想者是惡名畏因悕求他利不應法理名妄取想亦可妄想取着美名名妄取想由此妄取起惡名畏見愛着者是死畏因由見我故愛着自身懼已死也此三雖別同是惡法故合為一善根少者是餘二因功德善少畏墮惡道智慧善少故畏大眾此二同是少善法故復合為一上辨畏因此對治下舉經顯離毛豎已下釋總結文前段文中已言我離毛豎等事今復重舉有何異乎前說身畏後說異者前文之中總舉畏體名說身畏今就畏體隨相別論故云異身非身外畏名異身耳。",
        "from": "X45n0753_003:0091a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "安住分中經文有三一總明安住二謂信下有三十句別明安住三成如是淨治地下總結安住經有此三論亦同然。",
        "from": "X45n0753_003:0091c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "前總經中大悲為首是安住因菩薩所行皆為眾生悲為行本故云悲首深大堅固是安住觀轉復懃者是安住行論中悲首略不解釋深大堅固牒舉經文煩惱不壞釋深心堅小乘不壞解大心堅此之二心同名為觀轉修牒經諸所說善此地攝者謂下所說信等善根此地攝也。",
        "from": "X45n0753_003:0091c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下釋第二廣安住中文別有五一徵前起後二開列章門三對文指斥四隨門廣釋五是名懃下釋已總結云何懃行是初問也就第二中初舉三數次列三名所謂信心修行回向信心行始依信修行隨所修行用以迴向此之三種行修次第有三十句是第三段對文指斥。",
        "from": "X45n0753_003:0091c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下廣釋中先解信心初舉指斥故言初十說信成就經有十句初一是總餘九是別。",
        "from": "X45n0753_003:0091c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下以論釋先解初總隨所有事於中信者總對境界以彰信也如下所說三寶境等為所信事於此事中深信決定名信增上下釋餘別於中初先就總開別次廣解釋九中前六始起信心後之三向信增成欲就前六中初二自行後四利他自中初句上敬三寶後句於理證信清淨就初句中敬信列名良以初地分與三寶境界相應知彼殊勝所以興敬信增上中開出此敬將總名別名信增上下諸句中信增例爾尊敬解釋下以經帖淨信列名證離疑濁故名為淨自證真淨釋其相也就下四句利他之中初句化行後三化心分別列名說己所證授與眾生故曰分別次釋彼帖相顯可知下化心中初慈與悲是起化心後一不倦是常化心解慈悲中初列兩名行用義同是故并列次釋其相下舉經帖後重分別除苦相者除苦之能是悲相也決定救濟悲之深也救苦不虗故名決定與樂相者與樂之能是慈相也永與樂者慈之大也所言起者牒前經中起悲之言轉現前者從世修習得出世悲初入地時無懈大悲成就現行今正住中復更現前故云轉現不倦列名常化無厭故曰不倦化無量生久能益者釋不倦也化無量生益之廣也久處能益利之常也常能廣益故曰不倦下三句中初起行心所謂慚愧二起行緣將護善友三行所依謂敬教法解慚愧中初列其名內羞名慚外耻曰愧次辨其相不著世間慚愧能也於慳等下對過以顯慚愧相也慳是慳弊等者等取其餘五弊此等能障六度之行是故名為波羅蜜障於障羞耻名深慚愧下以經帖言慚愧者帖於慳等深慚愧也言莊嚴者帖前不著世間言也以不着故法身殊好故曰莊嚴解安樂中初列其名同法不惱釋顯其相下以經帖言忍辱者能忍他惱言安樂者善將護他解敬法中初列其名敬信殊勝釋其相也虔仰名敬無疑曰信尊重之心名曰殊勝下以經帖敬順帖敬信還帖信尊重貴者帖殊勝也下重分別後之三句後三別牒下三問答顯之可知。",
        "from": "X45n0753_003:0091c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋修行中初結前問後以為起發。",
        "from": "X45n0753_003:0092b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經有九句初一是總餘八是別。",
        "from": "X45n0753_003:0092b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "論言此十修行成就總舉對問經有九句而言十者大數言耳下隨文釋先解初總云何問也集善無息釋其相也集諸善根是頓修也無休息者是常修也下以經帖善帖集善無厭足者帖無息也下釋餘別先牒總開別後釋其相八中前七是阿含行後一證行前中初二攝法方便後五依法次第修行就前二中親近集者是其求法方便心也親近善友從之求法故云親近就總集中開此親近將總名別名親近集下諸句中集義類然不忘法者非謂已得聞持成就名不忘法此求法心無時蹔廢故曰不忘樂法集者正聞法時愛法心也於問答下釋愛樂相直諮為問直詶為答設難為論通難為解於此等中心愛樂也下五句中前三內觀順理之行後二緣中離著之行釋前三中文別有三一隨文辨釋多聞聞慧正觀思慧不著修慧於三昧中不愛著者不味禪也二重分別向多聞等簡牒前文是聞思修會名顯示如是次者初句是聞第二是思第三是修三慧不越故曰次第三重釋前不著之言謂於所得三昧法中不愛著也為欲簡後不貪不求故須辨之釋後隨緣離著行中先列兩名不貪是其知足行也不求是其少欲行也次釋其相以知足故已得不貪以少欲故未得不求次舉貪求二種之過彰離所以貪於己得著心重故障菩薩戒求於未得過是輕故退菩薩戒下以經帖不著帖前不求帖後上來七句是阿含行下明證行如寶列名如世真寶難得無垢勢力莊嚴殊勝不改具此六義證心同彼故云如寶出世間心念念現者釋顯其相經言如寶帖前如寶無厭帖前出世間心念念現也。",
        "from": "X45n0753_003:0092b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋迴向中初結前問後以為起發經中合有十三句文論就大數說之為十此十三中准後論釋三門分別一總別分別初句是總餘句是別二隨行要三門分別初之一句是其所求第二一句能求觀解後十一句是能求行第三別就能求行中總別分別求波羅蜜一句是總餘十是別下論依此三番辨釋宜審記知。",
        "from": "X45n0753_003:0092c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "成就如是淨治法下安住分中大段第三總結安住前說信等能淨此地是故名為淨治地法成是法時名為安住然此所成名淨地法下說信等名清淨法兩言相濫故下文中牒此辨異宜須記知。",
        "from": "X45n0753_003:0092c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "論釋迴向文別有三一總顯文意示現迴向二隨文廣釋第三如是迴向成下總結迴向就初段中求一切等說何事者問以起發求一切智是其初句等者等於餘十二句未審此文說何等事良以文中無迴向言故為此問示迴向者答以顯之迴向之義廣如別章。",
        "from": "X45n0753_003:0092c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第二段中文別有三一總別分別二求何等下隨其行要三門分別第三別就能求行中分別廣釋就初段中求智是總彰總異別今此文中宗為求佛此句正顯求佛之義故名為總下顯別義求力等別彰別異總下十二句皆為成初求一切智故望求智說為別矣一者已下隨別列名經中具有十二句文論中少一謂不動下少其一句生薩婆若下廣釋中還須具有初言觀求一切智者觀是觀解就前總求一切智中開出此觀將總名別故云觀求一切智地下諸句中求一切智其義例然此句是其能求之解後十一句是能求行行中初總餘十是別別中行體其唯六度但施與禪各分兩句慧分三句餘三各一故有十句。",
        "from": "X45n0753_003:0093a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上來第一總別分別自下第二隨其行要三門分別於中初先問答辨釋後重結之求何等者問所求果求一切智舉經對問以何觀求問能求解前言求智以何觀解而求彼智觀佛力等舉經對問力無畏等是向所求一切智地識知彼法方得趣求故須觀之云何求者問後十一能求之行用云何行而求彼智求波羅蜜無著法者舉經對問以波羅蜜離著行故能成彼智此乃通攝後十一句斯皆名為波羅蜜矣下重結之此三求者總牒前三言是家者結初求智一切智地是所求處故名為家言依家者結前第二於向所求一切智中分別觀察力無畏等名曰依家無障求者結前第三求波羅蜜無著法也能治六弊故云無障。",
        "from": "X45n0753_003:0093a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上來第二三門分別自下第三別就第三能求行中分別解釋於中初先牒前起後云何求者舉先問也求波羅蜜無著法者舉前答也此舉上文非是此中始問新答二就總開別此無障求舉前所牒差別異者就無障中開後別也三隨別廣釋釋六度中各有三句一對行立障二辨障相三翻障顯治檀有二垢對行立障一者已下辨其障相謟曲列名見乞詐設是外謟也無心許與是內曲也此謟曲者一向不許不隨先者許而不與於中有三一者先許後全不與二先許多後與微少三許勝妙後與麤惡此三皆是不隨先言此治已下翻障顯治離謟曲者治前垢也如說能行治後垢也尸羅一垢對行立障不護已下辨其障相不護實語列其障名違本受下顯不護相不護實語有其二種一犯戒不護違本受時能持之言二覆藏不護犯默妄語今言違本是初不護犯已覆者是後不護對治是下翻障顯治忍有一垢對行立障汙家已下辨其障相汙家列名云何污下辨污家相謂惱他也利益他下辨家顯污正以益他是佛家故惱亂他業即是污也對治是下翻障顯治精進一垢對行立障戒無量下辨其障相謂於戒行生退轉心退有三種一法廣故退二時久故退三法精故退戒無量者是法廣也以法廣故難可具持劫長遠者是時久也以時久故難可常持難持難行是法精也以法精故難可善持律儀戒中惡無不離故難持也餘二聚中善無不攝生無不度故難行也以是義故生退轉心精進之心遍策諸行今此何故偏就戒論此有三義一以戒是三學之初二以戒中備具三聚攝行寬廣第三戒是事中所行難成易敗人多於戒生退轉心不同定慧證法之樂堅固難失具斯三義故就戒論對治是下翻障顯治禪有二垢對行立障一亂心下辨其障相事中攀緣名為亂心內情妄取故曰憶想對治是下翻障顯治經言不動治前亂心生薩婆若治後憶想薩婆若者是一切智理定生之故除憶想分別心也慧有三垢對行立障下有三句辨其障相此對三道說垢為三無善巧者不住行障於世涅槃不現現者明無善巧或於世間一向不現涅槃中現此同二乘或於涅槃一向不現世間中現此同凡夫此二一向故非善巧不修道者助道行障於上證法欲心薄者證道行障自未得處名為上證如是次下翻障顯治如前三垢下經次第三行對治不捨世事成出道者對治初障集助法者治第二障常求勝道治第三障上來廣釋。",
        "from": "X45n0753_003:0093b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如是成者是迴向中第三總結。",
        "from": "X45n0753_003:0093c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "從上初十說信成就已來訖此大段第四隨文廣釋是名懃行第五總結前者問言云何勤修故今釋竟結答前矣。",
        "from": "X45n0753_003:0094a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下次解釋成就如是淨治地下總結之文於中有三一牒前行辨釋經中成就如是淨治之言有四舉數次列四名初十已下對文指斥初十是信信中後三即是其欲第二十句名為精進第三十句迴向之心名為方便以迴向故能以少善得無量果故名方便二是名下就前四種結成安住即釋經中名為安住三何以故下徵前起後舉經證成何以故者論主自徵我何以故說前四行以為安住如經所說成就如是淨治地法名為安住故我說之成就如是淨治地者帖上文中懃行四種乃至示現方便之言名為安住帖上是名說中安住如是說訖總結說分。",
        "from": "X45n0753_003:0094a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "校量勝中文別有四一結前生後第二解釋校量勝義三開章門四廣解釋。",
        "from": "X45n0753_003:0094a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "已顯安住次說校量是初段也。",
        "from": "X45n0753_003:0094a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "言勝聲聞辟支佛者第二段也初住地時已過二乘何故今此方云勝乎有人釋言此非別異聲聞緣覺向前初住及安住分行修趣寂相同二乘是故名為聲聞緣覺然此正對別異二乘以辨過義若爾初住已過二乘何故今此方乃說過又此為顯地中滿足勝前初住及正住地何因對彼別異二乘而說過乎釋言初住非不自有過二乘處若就願等以辨勝者前來未有故此論之正以前來未有願等勝過二乘今方有故明知即是過前初住向言初住自有過處更有何過為辨此義汎辨過相其義自顯然大過小數別無量今隨其要且論十七一發心過下至凡夫發菩提心超出二乘故經說言沙彌發心勝過羅漢以菩提心廣大意故二信心過十住已上於大乘法信決定故三者解過習種已去於深法界如實解故四起行過性種已上離麤煩惱具佛種性一切行故五如觀過亦名道過解行已去於如實道觀察相應趣實證故六者證過初地已上息除妄想證法性故七求勝過初地滿心於所證法不以為足更求勝故八淨業過離垢地中戒清淨故九定自在過明地之中於禪解脫得自在故十道品行過謂炎地中不捨眾生修行道品十一成就不住行過謂五地上十二甚深緣起行過謂六地上十三寂用雙行故過謂七地上十四報熟離功用過謂八地上十五辯才說法行過謂九地上十六成就微細智過謂第十地第十七者斷一切習一切諸行滿足故過謂如來地以此求之前說分中證過二乘而未能起願行等故不及此勝對前說分辨勝便足何用對彼二乘說過良以小乘大乘所對凡欲辨勝多皆對之乃至明佛亦對顯之。",
        "from": "X45n0753_003:0094a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下次第三開列章門有三舉數下列其名言願勝者起行方便修行勝者依願正行果利益者行修滿足此乃隨其行修始終以分三耳何者願。",
        "from": "X45n0753_003:0094b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下第四廣釋先解願勝於中有二一問答略顯二隨文廣釋何者問也謂十答也十願之義五門分別一列名解釋名字是何一供養佛願亦名攝功德願就其所作名供養佛就所成行名攝功德二護法願亦名攝智慧願就其所作名護正法就所成行名攝智慧三攝法上首四增眾生心五知眾生亦名化生下文之中初知眾生後化眾生就初以名名知眾生就後以名名化眾生六知世界七淨佛土八同心行九三業不空十成菩提此十據相隨心求義名之為願論其行體光明善根轉勝增廣故名為願二據修分別初七修始次二修熟後一修成得菩提果三就行分別行謂自利利他之道初二自利次五利他後三不定若別分之第八願者自利純熟第九願者利他純熟第十一願自利利他二行得果若通論之皆是自利故下論言此後三種顯自身矣俱是利他故下論言此後三種得如實化若復通論十願俱是自利利他故下論言勝有二種一常勤行無量行故即是自利二與一切眾生同行即是利他四就所求行位分別前之七種就行分別行如上辨後三就位位在何處如下論說第八願者地校量勝謂從初地乃至九地第九名為地盡校量在第十地十地學窮名為地盡第十名為一切地盡在如來地以如來地聖位窮極名一切盡五就所求因果分別前之九種是所求因後一是其所求之果又十願中前六求因第七求於淨土依果次二求因後一求於法身正果十願如是下次釋文。",
        "from": "X45n0753_003:0094c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經中先明十種大願後以十盡成諸大願論還依經次第解釋前十願中先科其文於中有三一就經科分經有四分一修願方便二無餘下正明十願第三重明修願方便四住初地起如是願總以結之二就論科分論亦有四一正解十願二何故唯說此十願下徵數以顯願之圓備第三解釋修願方便第四何故名大願下總解大願三將論對經定其所釋於經文中但釋第二第三段文餘二不解彼第一段修願方便與第三段方便不異為是不釋第四總結易故不解科分如是次釋其文文中初言發諸大願起大方便大行成者是第一段修願方便於十願中始起求心名發諸願數數起心修練諸願名起方便以久修故任性成就名大行成此願心成非所願成所願至佛方乃成矣此三方便就初以舉義通下九。",
        "from": "X45n0753_003:0095a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無餘已下正明十願先解第一攝功德願問曰五度皆是功德何故今此但明供佛釋言此地檀行增上故就供養明攝功德以供養佛檀行攝故雖明供養行供養中備修諸德諸處多明供養三寶今此何故但明供佛理實通有略故不論又此十中隱顯以論初願之中對佛求供第二願中對法願護第八願中對僧求同又復供養大例有三一唯供佛顯行趣求二供佛僧從之求法三供三寶具攝功德今就初義單明供佛。",
        "from": "X45n0753_003:0095a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經中初至盡未來際舉願所求供養之行一切劫下結誓自要初段之中句別有九相從為六要攝為三所言九者一者無餘二一切佛三一切供養四一切恭敬五一切種具六者深信七者廣大八如虗空九盡未來相從六者初四為一名福田大餘之五句說為五大通前六也此之六大備如下論要為三者初之六句是願所求供養行體次有一句是願所求供養行德後二是其願之所求供養行能下結誓中一切劫者供養時也一切成佛供養處也供養恭敬是願所求供養行也大供養者於一切佛頓供養也無休息者於一切時常供養也此第二段論家不釋宜須記知下釋大願云言常行無量行者指此文矣十願之末皆有此文。",
        "from": "X45n0753_003:0095b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "論中有二一依經解釋第二釋竟就其所求六大結之顯成大願就初段中先解福田句別有五一就無餘開其三數二列三名謂佛供養及以恭敬第三廣釋今先明佛佛有三者牒以舉數應等列名三佛之義廣如別章供養有三牒以舉數次列其名言利養者謂衣服等資潤名利敬供養者謂香華等不任資養但可表敬名敬供養言修行者謂信戒等仰順聖心名行供養如維摩中名法供養地持論中名至處道有說此三別對三佛初對應身次對報身後對法身亦可三佛隨義以分正是一人今總對之為三供養不可別分恭敬有三牒以舉數次列三名言給侍者身形奉給如阿難等言迎送者身不奉給但可迎來送去而已言修行者以所修行敬順彼也修行供養修行恭敬有何差別體一義異資順之義說為供養虔仰之義稱為恭敬然此三敬亦得別望三佛以分初望應身乃至第三望彼法身亦可通對上來第三廣釋三相第四是故作願已下結成願心是於佛田無出供養及恭敬故此願之末作願自要供養恭敬無有休息舉彼顯此明於佛田供養恭敬攝福盡也五如經下舉經并帖釋供事中言無量者供事廣也言種種者種別多也復是勝者皆精好也備此三義故云具足釋心大中心別有三一上二深三信清淨增上敬者此解上也願迴向者此釋深也求佛心中而為供養何有不深信清淨者此解信也所言廣大餘中勝者勝餘凡夫二乘善也愛果因者能生世間無量果也所言此因得涅槃者能得後際二涅槃也。",
        "from": "X45n0753_003:0095b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上來釋竟下以六大結其所求顯成願大言初願中六種大者所求大故願心大也下別指斥福田大者佛能生福故名福田下舉經對田唯佛是何故乃舉供養恭敬此舉敬養為顯佛是能生福也餘悉可知言時大者常果之因經三僧祇方得涅槃故名時大此常無常分為二大六決定中合以為一蓋隨釋者開合左右互以相從皆得無傷又此標別起願各異是以分之。",
        "from": "X45n0753_003:0095c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第二願中初總後別又發大願是其總也餘文是別別中經文與初願同經同初願論中但解願心所求護法行體廣大已下釋不異前不能煩耳諸願齊然釋護法中初舉三法第二廣釋護持之義第三別解三佛菩提第二廣中隨行始終兩番辨釋初就始修以明護持第二復名三種成下就行終成以釋護持法有三種一教二證三是行法就此三法彰護差別一切佛說皆受持者牒舉經文謂教法者總指法體修多羅等出其名字舉修多羅等取毗尼及阿毗曇此釋法也下解護持書寫供養讀誦受持自行護也為他說者外化護也攝佛菩提牒舉經文謂證法者略指法體言證三種菩提法者就總開別就前總證開為三種菩提法故名證三種佛菩提法非謂行心證三法也此釋所護下解能護攝此證法自行持也教化傳授化他護也化法皆護牒舉經文謂修行法此解法也下釋護持但就利他略無自利於修行時有障難者謂他修時有行障也攝護救者攝令增善護與救濟令離惡也未起障難護令不生已起障難能救濟也下就成行以顯護持於中有三第一總舉第二別釋第三總結復三成者上來已釋今更重明故云復也行德相應名為成就於佛所說修多羅等舉其教法言阿含者名前所說為阿含也所言次第令不斷者窮達教旨總持不亂故名次第總持不忘名為不斷言成就者成就聞持轉法輪德證三覺者是其證法初證是總三覺是別得證成者依法所成證行成也言修行者是修行法乃至如實彰前修行之分齊也謂此修法始從發心乃至後際如實境界修覺成者是其依法所成行也修行是因正覺成者修得果也是名三成第三總結上來第二廣釋護法自下解釋三佛菩提聲聞辟支亦名佛者俱有覺義通名佛也菩薩云何證於聲聞緣覺菩提釋有兩義一者菩薩自所證中通具諸法故經說言攝正法中具足一切聲聞緣覺世出世法二者隨化現證小果故法華云知眾樂小法而畏於大智是故諸菩薩作聲聞緣覺故說證矣下次五願明其利他於中初願攝法上首為眾請法二以所行增長物心三知眾生而為教化四知世界往彼攝益五淨佛土攝物處中攝法願中初總後別又發大願是其總也餘文是別別中經文與初願同經同初願就其所求行體之中句別有四一攝法處二從兜率乃至涅槃明攝法時三我爾時下於前時中明其常攝四一切處下在前處中明其頓攝成佛無餘所從人也一切住處攝法處也第二段中謂八相時就此八時以明攝法何者八相一生兜率二下八胎三住胎中四者初生五者出家六者成道七轉法輪八入涅槃然此八種諸佛亦有具不具者如釋迦等具足八相或但具七如天王佛白衣成道則無出家須扇多佛出世之時無生可化虗示滅度留一化佛半劫度人是則彼佛無轉法輪若取化說亦得具八從兜率者標數之首故說為從謂從兜率乃至涅槃如世人言從一至十其義相似後二可知論中但釋所願行體然上經中第二段文迴之後釋自餘次第良以第二廣故後論釋初段中成佛無餘乃至住處并舉經文下釋有二一解成佛二釋住處一切應佛解成佛也應取正覺故名為成為從攝法偏舉應耳言無邊者釋無餘也別則難窮故曰無邊總攝無遺稱曰無餘此釋人也下釋住處句別有二一約應佛解釋住處應佛遍滿諸世界中故名世界以為住處無邊應佛各在一界是故遍滿二就世界解釋應佛住之所以隨何世界佛住處者牒前起後應感相順眾生見者正解應佛住之所以為令物見是故住之如來示化名之為應物機名感機有順聖聖隨物感故曰相順順物示化令生見也從兜率天乃至為首并舉第二第三段文隨彼已下超釋第三第二段文迴在後釋言隨彼生供養佛者隨眾生故自供養佛令他學已故云方便以如來說攝方便者以是為也為使如來有所說故啟請攝法請法利生故曰方便集功德者是供養也集智慧者是攝法也所集福智總名助法自下解釋第四段文言一切處一時成轉牒舉經文非前後者攝之頓也何故示下料簡第二攝法之時八相之中但釋第一第二第三第六第八餘三不解何故如是彼前五相捨勝從劣有疑須釋第一相者捨上天報生於兜率是故須釋第二相者捨天生人理合料簡第三相者捨化受胎復須解釋第六相者自力難成他教易就捨易從難是故須解第八相者住益勝滅捨住取滅理然須辨餘之三相捨劣就勝無疑可釋第四相者住胎必生何須料簡第五相者出家勝俗不勞辨釋第七相者轉法化生勝於不轉所以不論釋初相中有二問答何故示彼不在色界及無色者是初問也色無色天勝於欲界聖力自在堪能往生何故示彼兜率處生言難處來乃至為遮是初答也此防後時閻浮眾生輕慢心故小乘法中色無色界長壽天難無初捨凡入聖道者是故將成不得生彼若生彼者後生閻浮成佛道時閻浮眾生咸作是念佛自避難來此成佛非為我等有是心故不能重敬聞說不受於化無宜故不生彼何故不在他化等者第二問也乘前答中上界是難他化天等非是難處何故不生舉彼他化等取化樂故名為等如來有力乃至敬心第二答也為增兜率眾生敬故何故不生化樂天中增彼敬心化樂天報猶勝兜率起敬義微是故不生若生彼者眾生念言貪樂生此不為我等若爾何不生於下天下天報劣若生彼者後生人中成佛道時人皆念言夜摩天等樂微易捨故佛捨之不增敬意又欲天中忉利四天同是地居合以為一空天有四此五之中兜率據中如來處之故經說言如來大人處天天中在人亦然何故人中捨上樂者此問第二來下入胎愍我來生增敬心者謂增閻浮眾生敬也何故處胎此問第三住胎之言化生是勝何故處胎釋言增長同生故者佛出世時眾生胎生名彼為同若佛化生胎類咸言佛法深勝化生者得非我境界絕分不求為遮此意故受胎生彼我同類能得此法我亦應得故名增長若依涅槃則有多義一劫初眾生無其道器佛不出世故不化生二生上族寄勝表法三為教人敬父之業四假親護法五為息慢六為息謗七為留身蔭於諸國故不化生以化生者還復化滅無舍利故八為同諸佛故不化生三世諸佛化胎生眾無化生故具此多義故受胎生今此略就一義言耳何故自成此問第六成佛道相他教易成自力難就何故捨易自成正覺現丈夫力釋自成也非因他得釋非餘化何故示現入涅槃者此問第八入涅槃相住世化勝何故取滅釋言令生懃修道故若佛久住眾生常見不能起於難遭之想故現取滅令彼懃修。",
        "from": "X45n0753_003:0096a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第四願中初總後別別中經文與初願同經同初願就其所求行體之中文別有二一明一切菩薩所行二說前行增長物心初中有二一總二別所謂一切菩薩行者是其總也廣大已下是其別也第二段中句別有二一對行彰說二教化下對人明化說中有二一總二別說一切行說前總也如實已下說前別也如實地道是前廣大無量無雜波羅蜜者名與前同言方便者是前六相總別等也業者是前諸地所淨生助道法論中初先牒問起發。",
        "from": "X45n0753_003:0097b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第四願中心得增者是牒經也增長物心正是所願故偏牒之以何等行令心增者是徵問也下對辨釋文別有三一舉經中總菩薩行明增物心一切所行是舉經中總菩薩行教化已下明增物心二彼有四下舉彼經中別菩薩行明增物心於中先舉四種別行有四舉數次列四名言種種者道義差別所言體者謂波羅蜜菩薩行體業者所謂諸地修業言方便者德義善巧諸德同體巧相集成故云方便以此四下明增物心三何者下隨別廣釋解種種中初問次釋後以經帖何者種種是初問也世行三下題文辨釋經中四句前三教道一處辨釋後一證道在後別解前教道中世行有三標別舉數然世出世汎釋有二一就位分別地前世間地上出世二隨義分別教行差別名為世間證行平等說為出世今依後義故名教行以為世間隨位不同故有三種廣者已下題經解釋初至六地一行之中備具一切名之為廣第七地中一切行中備具一切名之為大八地已上法流水中念念深入無量佛境故曰無量下解證中初無雜者法無我觀題經辨釋出世間智標別其相經帖可知體牒前門波羅蜜攝舉經對顯業牒前門諸地所淨生諸助法舉經對顯業是修業業能顯證名為所淨修起教行名生助法能作此二故名為業言方便者牒舉前門下總別等將經對顯彼六相門一備一切一切成一成壞善巧稱曰方便說一切下是其經中第二段文乘勢舉來非是第四方便之文。",
        "from": "X45n0753_003:0097c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第五願中初總後別別中經文與初願同經同初願就其所求行體之中句別十一初之七句明知眾生後之四句明化眾生前七句中所謂無餘一切生界總知眾生有色下別後四句中教化一切總明教化令信已下三句是別論中先對後之四句總顯願相何者已下隨文解釋先作二問以為起發何者是生是其初問問前七句所知眾生為何義者是第二問問後四句化益差別下對前問次第辨釋解初問中一切生界有六種者牒總開別次列六名言麤細者報相差別言依止者報之所託不淨淨者受報處所欲界不淨上二界淨言苦樂者正是其報言自業者得報之因言自體者報之體性下次釋之何者麤細問其初門麤有色下對問辨釋下之二界名麤有色上四空處名細無色下就色中復辨麤細麤有想者除無想天餘名有想細無想者第四禪中無想天報與廣果天同在一處外道取為究竟涅槃修無想定生於彼天得五百劫無心之報無佛弟子生彼天中下就無色別明麤細麤非無想前三空處細非想者第四空處言非想者無麤想也非非想者非無細想是名下結釋依止中先牒前門次舉經對四生之義釋有三門一隨事分別二對五趣辨其通局三對五趣明其寬狹隨事辨者如諸鳥等名為卵生如今人類名為胎生諸畜之類依濕起者名為濕生如諸天等名為化生言通局者化生最通全攝二趣地獄諸天餘之三趣皆分有之如劫初時人鬼及畜一切化生胎生次局人鬼畜等三趣分有卵濕最局人畜分有餘趣悉無畜中卵濕相顯可知人中濕生如頂生王等人中卵生如毗舍佉母三十二子如是等也言寬狹者以其四生望彼五趣辨其寬狹四生是寬五趣是狹雜心云為生攝趣為趣攝生論自釋言謂生攝趣非趣攝生何者四生五趣不攝論言中陰是其化生五趣不收下釋化生依止之義胎卵濕等有色可依理在不疑化生忽有先無依託云何依止下答依業以業力故報得生也淨不淨者牒舉前門謂三界繫舉經對顯欲界不淨上界是淨因果屬別目之為繫種種身者受報別也雜入六道舉經以對入者是處於六道處皆有苦樂故云雜也自業牒前一切生處舉經對顯由業異故生處差別亦可業是受生所依故名生處自體牒前名色攝者舉經對顯果報雖眾無出名色四陰為名色陰是色何故四陰說之為名人多釋言五陰成生生是假名四陰之心成名中強從其所成故號為名是義不然當知色陰形現可覩不假名彰是故當相說之為色餘四是心心法冥漠非名不辨是故從詮說之為名故楞伽云以名宣說無色四陰故號為名是名眾生總結所知為何義者牒第二門下對顯之為三舉數經中四句初句是總後三是別今言三者就別言耳次辨其相信佛法者信佛所說因果等法此化令起世間信也入二乘者令得小果經言斷世數道故者五趣差別名為數道除因離果名之為斷入無上者已得小果漸化令入大菩提也經言令住一切智者所謂佛智智之分齊故名智處。",
        "from": "X45n0753_003:0098a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第六願中經同初願論中偏釋所願行體文別有四一牒總開別明入皆知二列三名三廣解釋四約智分異就初段中言無餘者是牒總也牒彼經中所謂無餘一切世界有三開別隨入如是皆現知者明入皆知佛於世間現知不比今願得之次列其名言一切者世界相也真實義者世界體也無量相者世界多也十方廣多故曰無量下次釋之一切相者牒舉初門如經已下舉經對顯下廣分別於中有三一寬狹分別一千為廣二千為大三千無量以千須彌千四天下合為一界名為小千小千為一數之至千名為中千中千為一數復至千名為大千此大千界華嚴經中名世界剎大智論中名一世界論自釋言此大千界成壞同時故名一界此復為一數如恒沙名世界性此復為一數如恒沙名世界海此復為一數如恒沙名世界種此復為一數至無量名一佛界九地菩薩能於是界現成佛道如大智論發趣品中如是分別今此文中且據一剎以分廣等二麤細分別隨何等界意識身者意識是心身者是色色心麤故世界亦麤色心細故世界亦細三亂住下依住分別亂者牒經不次第者住無行行倒住牒經不造舍宅覆世界也正住牒經造舍宅者仰世界也是名下結下次解釋真實義相如帝網者牒舉經文真實義相將論對顯如帝釋網百寶所成諸色互班不相障礙世界如是一處之中備有多土多土同體互相集成無有一土別守自性而無不性世界實爾名真實義如業幻者轉喻況土成如帝網如似世人業幻之力火處見水水處見火地處見空空處見地如是一切世界同爾名業幻作故如帝網無量相者牒舉前門言十方界無量入者舉經對顯入名為處十方國土無量處處差別別入無量相者解釋辭也十方國土形狀各異如阿閦界安樂國等非就一處說其無量下次約智分其麤細真實是理唯智能知餘二是事可以目覩故云現見。",
        "from": "X45n0753_003:0098c10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第七願中經同前判論中偏釋所願行體初言淨土總以舉數淨土之義廣如別章此應具論下廣辨釋七中前四當相明土次有一句就人顯勝後之兩句舉因顯果就前四中初二土體第三土相後一土用前兩句中初彰體同後明體淨同體淨者釋有三義一者諸佛報應之土同皆用彼法性為體二者應土同皆用彼真土為體三就應中諸土同處迭互相依故曰同體下以經帖一切一土一土一切釋還有三若准初義一切報應是一法性一法性土緣起說為一切報應准第二義一切應土是一真土彼一真土隨物見異為一切應若從後義一處之中具有無量差別應土彼應土中迭互相望或淨為一餘為一切或穢為一餘為一切如是等也自在淨者明土淨也淨有二種一者相淨眾寶莊嚴無諸瑕穢二自在淨如摩尼珠美惡斯現今此所論是自在淨淨穢圓通無礙無障故曰自在染淨隔礙不名為淨以自在故說為淨矣經言一切平等淨者相淨之土彼此別異自在淨土十方齊同故云平等莊嚴淨者土之相也下以經帖莊嚴有三一神通莊嚴神變自在或小容大大入小等二光明莊嚴寶光相照無有闇冥三寶相莊嚴諸寶集成今言神通是初嚴也光者是其第二嚴也相者是其第三嚴也下重解釋後二莊嚴光明莊嚴釋前光也眾寶莊嚴解前相也神通莊嚴相顯不釋受用淨者土之用也次以經帖離一切惱能成斷德成就淨道能成行德穢土境界受用生過妨礙道法淨土異彼故離煩惱成就淨道如香積飯其有食者離過增道然後乃消上來四句當相明土所言住處眾生淨者就人顯勝下以經帖智慧眾生悉滿中者如維摩說菩薩成佛時有一切種功德眾生來生其國今此且就智慧言耳智人住中明土淨也下二舉因顯果之中因淨舉因因有二種一者行業謂施戒等如維摩說二者德業所謂淨土三昧法門如下八地淨土法門及十地中佛國體性三昧門等今此所說是德業因下以經帖入佛上妙平等境者如來藏中淨土法門是佛妙境證會名入能入實智是淨土因言果淨者對因明果果有二種一者相淨妙寶莊嚴從施戒等行業所生二自在淨隨心異現從彼淨土三昧而現今此所論是自在果下以經帖隨生心樂而為示者用隨物心下重顯之顯智力者前因是智智起此用名智神力舉用彰彼智之力能名顯智力此如八地淨土中說是義應定不勞異釋上來七願是行方便自下三願行修純熟於中通論三俱自利故下文言此後三種顯示自身三俱利他故下文言此後三種得如實化於中分別初一是其自利純熟次一是其利他純熟後一自利利他得果就初願中經如前判就其所願行體之中有十二句初句是總中十是別後一總結初言同心同行故者總後十中初二句也就後十中共集善根是其同行平等一觀是其同心後十皆同不可并舉故偏對此以彰同矣論中偏釋所願行體先解初總次釋其別後一結文略而不解解初總中不念餘乘正解同義良以不念餘小乘故與菩薩同亦得說言同菩薩故不念餘小下以經帖言同心者慧心同也言同行者福行同也就釋別中先舉十數次列十名十中前五明行修同後之五種明德用同前五行中初二自分後三勝進自分之中初是福行後是慧行共集善根無怨嫉者起行無乖故云共集以行同故情無乖異名無怨嫉一切菩薩等一觀者證如平等名平等觀與諸菩薩觀心不異是故云一當知觀心望理說等對人說一亦可望人同故名等證理一味故云一觀就勝進中初親近者攝法方便後之兩句依法起行行分自他隨意現身是利他行八相成道教化眾生名現佛身自心解者是自利行解發自中不假他授名自心解菩提之道顯照自心名解諸佛神力智力神力是佛阿含用也智力是佛證行體也後五用中初一通體神通上進名曰不退所為稱心故云隨意後四通用四中前三如意通業下一是其法智通業成就大乘無障礙慧名不思議具菩薩行是總結文乘勢舉來非是第十法智通文下重分別初顯功德是共集也住寂等觀是第二也聚集論法是第三也近佛菩薩名為聚集集何所為為論佛法隨心示成是前隨意現佛身也此乃八相示成佛道自發勝心念如來者是前自心解知諸佛神力智力勝進解心不由他教是故名為自發勝心仰攝諸佛神通智力名念法身得不退通是第六句神通體也後四句中初言餘四通業得名總顯其相下別顯之一往餘界一身往也第二自餘異身示者多身往也己身為自自身之外他身名餘異身示者釋有兩義一對前句分多名異二對後句異生名異以此異身飛行十方令物覩見名為示現同生往者是其多身同生通也入大乘者成就實慧通達甚深大乘法也。",
        "from": "X45n0753_003:0099a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第九願中經同前判就其所求行體之中文別有二一乘不退輪行菩薩行是其自利二身口意下明其不空行菩薩行是其利他前中初明乘不退輪後明行行輪謂三輪身口意業能摧物惡轉下趣上故名為輪益用無減稱曰不退依此起行說之為乘乘此起行名為行行第二段中先明不空後彰行行不空有二一者作業二者利益前中初言身口意業作不空者總明作業眾生見下別明作業得如已下是其利益論中初言第九不空行菩薩行總顯願相不空行行正是所願故偏顯之復行已下依文辨釋先解初段乘不退輪後釋第二不空行行言復行行顯乘輪者釋初段也前明不空今重顯彼不空行行依不退輪故云復行顯乘輪也以不空行依三輪故於中二下釋第二段但解不空行行之言易解不釋有二舉數作業已下列名解釋言作業者身等所作能益不虗名作業不空言利益者拔苦與樂濟潤不虗名利益不空此二若通俱是作業齊是利益為分兩種隱顯異名良以前者隨其見聞身口意等業相差分故名作業後不如是故不名業又第二門除其事惱彰益義顯故名利益前作業者利之以道道益相隱故不名益作業必定列其名字身口等業益利決然故曰必定身口意業作不空者此舉經中初總作業對以顯之如是次下釋彼經中別作業也如向總中初身次口後明意業下別亦然故云次第言應知者應知後別如前總中三業次第生見牒經示現勝身令彼生信信無疑惑故曰決定此應信人何故乃云必定佛法以法勝故依成勝身故覩色身信法勝也明身不空指斥其相聞聲牒經口宣實教生物真解口業不空指斥其相心喜牒經菩薩內心廓備諸德令物喜敬起心趣順故斷煩惱明意不空指斥其相下第二中利益列名次明二苦彰益所治種種苦者違逼苦也貧窮苦者是其順緣不足苦也對治是下舉經彰益得藥樹身治種種苦治苦之勝如藥樹王遍治眾苦非獨除病得如寶身治貧窮苦隨心利益如如意寶備與眾樂非直與財。",
        "from": "X45n0753_003:0100b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第十願中經同前判就前所願行體之中句別有八初句是其菩提自體後七是其菩提作業體者即是自行果也業者即是利他果也於一切處成菩提者是菩提體實德圓通義無不在是故說言一切處成是義云何本有妄心結集有果形有分限不能周普以妄攝真真在妄中如妄局別不能周遍是時法界廣大之法集在眾生心微塵中後息妄心有果不生有果滅故形無所在知復從何說真在此說真在彼是時真德無一偏在而無不在無一在故菩提無處無不在故一切處成於一凡下是菩提業業有七種初至度生示大涅槃是其第一示正覺業於中初明現成之處示初生下正明現成就前處中凡夫道者謂閻浮提是其可化凡夫住處名凡夫道於一凡道簡餘三天不離一切統收百億百億閻浮同皆現成故云不離現成可知現佛境界乃至滅苦是其第二說實諦業於中三句初句是總後二是別現佛境界神通智力是初總也八相成道說法度人唯佛所為名佛境界雖云佛境相猶未分故復說言神通智力八相成佛是神通力說諦滅苦是其智力隨一切下是其別也別中初至示得佛道合為一句廣前通力度生滅苦為第二句廣前智力前中初言隨一切生所應度者化能隨人於念念中化隨物心所化眾生心緣各異名為念念示得佛道正現成佛此猶是前示成正覺說諦依彼是故牒來度生滅苦正說實諦一三菩提至涅槃性是其第三證教化業於中經文有證無化論中具有三菩提者此名正道簡異二乘是故言一此是證體言遍知下對治顯證用向菩提證智之體遍知法界一切法也照理普周名曰遍知生死涅槃悉同無我名一切如法體寂滅說為涅槃非果涅槃法體本淨名為性矣以一音下是其第四種種說業示大涅槃不斷行者第五不斷佛種業也示智起法是其第六法輪復業示大智地示理法也諸佛智慧名為大智智依理生故名理法為智慧地願已當來成佛滅後令此智地顯彰在時故名為示如佛滅後諸聖弟子傳證是也發起法者發起教法願已來世作佛滅後教法住持流通無失名起佛法理法云示教云發起文綺互耳法智通下是其第七自在業也一切劫下結誓自要一切劫數求佛時也成菩提數所求果也果德非一是故言數求大智通無休息者正是結誓自要之辭求大智通對前菩提以自要也於中別分菩提自體名為智慧菩提作業說為神通通則二中皆有智通無休息者對前劫數以自要也。",
        "from": "X45n0753_003:0100c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "從初願來大段第二正明十願安住喜地發諸願下是第三段修願方便於中先明修願方便以十願下明修所以以十願中攝願廣多故須為此三分修習住歡喜地起如是願是第四段總結文也。",
        "from": "X45n0753_003:0101b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "下以論釋於此願中偏解第一所願行體於中初言起大乘行總顯願相無上菩提大人所乘名為大乘願能生彼故名為起願能趣彼故說為行云何已下隨文辨釋先作二問以為起發云何菩提問其體也云何作業問其用也下對二問次第辨釋大菩提者牒上前問如經已下舉經對顯言作業者舉後所問下廣釋之先舉七數次列七名示正覺者現成就也說實諦者轉四諦也此說小乘證教化者以己所證化眾生也此說大乘種種說者說世法也不斷佛種者菩薩所行名為佛種得佛常起故云不斷法輪復者大聖雖滅令法住持住持如本故云復住言自在者變化無礙下廣辨釋初業牒前於一凡道乃至涅槃舉經對顯下次釋之於中但解一凡夫道一凡道者重牒前文一閻浮義此解一也簡餘三方是故言一言閻浮提凡夫道者重牒前文可化住處解凡夫道可化眾生名為凡夫住處名道不離已下略不解釋一切凡道類一可知示初生等不異向前第三願中所以不解第二牒前現佛境界乃至滅苦舉經對顯下次釋之經中三句但釋後二初現佛境神通智力略不解釋以其總故若當具釋不異後別是以不論釋後別中先解初句隨世一切解隨一切眾生界也此名眾生以為世界言可化者釋所應度言隨心者解念念中化順物情故云隨心示佛身者解示佛道下重牒來明示現相謂除難處勝處受生名示佛身除難處者諸難不同略有八種所謂地獄畜生餓鬼盲聾喑啞世智辯聰佛前佛後北鬱單越及長壽天前之三難在下三趣中間四難在於人道第八在於色無色天此諸難中三塗鬱單及長壽夭就處彰難此處眾生不任受道如來不生所以除之噵言彼彼勝處生者就非難中簡劣取勝閻浮最勝在中生也百億閻浮同皆現生故云彼彼下解別中後句之文謂教眾生除苦斷集證滅修道名度眾生滅苦惱也第三牒前一三菩提正是證體此名正道簡別餘道是故言一觀釋遍知法者解釋一切法也無我釋如一切性淨解彼性也言涅槃者還是經中涅槃之言諸法理寂名為涅槃令生信者解教化也經中無此論以義安第四牒前言一音者釋一音說何者一音若就實論如來真聲名為一音應物異現令各各解如一真身令人異見法螺之音是佛真聲常寂之聲是法螺聲恒有恒無故曰常寂若就應辨釋有兩義一隨類辨一或為胡眾現一胡音令餘種類各別得解對漢亦然如是一切故經說言佛一音說眾生隨類各得解也二隨法辨一或為眾生說施一音亦令餘人解戒定等如是一切故經說言佛一音說眾生各各隨所解也具斯諸義故曰一音隨種種信可化生者解令一切眾生言也謂諸眾生信戒信施如是等異名種種信一時令喜解令喜也隨人異樂語稱物情故令歡喜一音異解故喜一時第五牒前示大涅槃不斷所行舉經對顯第六牒前復佛智地解釋示大智慧地也以佛智地釋大智地復解示也聖雖滅度以住持力令彼智地傳化在時與本不異故名為復一切所說軌則不失解釋發起一切法也修多羅等所說軌則釋一切法舉修多羅等取毗尼及阿毗曇亦可舉彼修多羅部等餘十一言不失者解發起也第七牒前觀法無性是法智通知法空也如意幻通相顯可知下復屬當法智通者見理捨相不住世間餘二事用不住涅槃。",
        "from": "X45n0753_003:0101b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "從釋供養訖來至此論中第一廣釋十願何故唯說此十願下論中第二徵其十數以顯願圓於中前七相顯可知言後三願顯自身者後三通是自利德也地校量者謂從初地乃至九地行德漸增名校量勝言地盡者謂第十地學之窮也一切地盡謂如來地此三示現如實化者此三通是化他行熟名如實化別分如上。",
        "from": "X45n0753_003:0102a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "發諸願下論中第三解彼經中第三大段修願方便於中先釋修願方便次解經中修願所以下以經帖初言發願牒舉經文隨心求義修願始也十種願心求供養等十種行義故名求義求是願也所求不定故曰隨心方便牒經成彼所作方便勇者成彼所作十大願也巧修諸願名為方便所求決絕故號勇猛大行牒經所作成者所作十願皆悉成也十大願中備攝法界一切諸行故修諸行成此願矣故下文言菩薩初地於大願中具足一切菩提分法漸次起下解彼經中修願所以漸次起三非一時者釋前起後釋前三行起後一一攝無量願何以故下徵前起後何故久習不得一時以十願下舉後顯前以十願中各攝廣多無量大願故漸不頓經帖可知經中第四住歡喜地起如是願易解不釋。",
        "from": "X45n0753_003:0102b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "何故名下論中第四總釋大願前十願中一一皆言又發大願此之大願上來未解故今釋之何故名願問以起發光明善根轉勝增者此解願也真證善根出障清淨故曰光明漸勝名增增長向佛故說為願願名不別何故向者求義解願今言善根轉勝增乎釋言前是始方便心以求釋之今此總解大願之體故曰光明轉勝增廣勝有二下釋其大也有二舉數勝聲聞等辨勝過劣一常懃下顯其勝相常懃無量自行勝也常是常修無量頓修何者是乎前十願中願願之末皆言所作無有休息指彼所說以為常懃無量行也與生同者利他勝也十盡示者指後顯前據斯以論十願通是自利利他。",
        "from": "X45n0753_003:0102b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十地義記卷第三本",
        "from": "X45n0753_003:0102c09_0",
        "context_with_next_sentence": false
    }
]