[
    {
        "source_sentence": "俱舍論釋頌疏義鈔卷下本",
        "from": "X53n0839_003:0185a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "京兆西明寺沙門　慧暉　述",
        "from": "X53n0839_003:0185a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第十九　分別隨眠品",
        "from": "X53n0839_003:0185a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋此品疏分二一釋名二分文解釋有部貪等即隨眠大眾及經部現行名纏垢種子名隨眠大乘眠伏藏識現行名纏垢種子名隨眠有部釋云貪等潛伏在六識難知名隨眠有得繫屬在身隨也此品亦明纏垢獨名隨眠者一是根本二以初明故。",
        "from": "X53n0839_003:0185a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "離隨眠業無感有能者如無學有故業不能感三有業也。",
        "from": "X53n0839_003:0185b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上界少分貪緣外境多分緣內唯欲界貪少分緣內多分緣外境皆是以小從多立名也問何故四諦煩惱多增減不同答苦諦有身邊見餘諦無者不執其因及滅道無漏法為我我所故身見餘諦無執身為我故苦下有身見邊見合斷常依身見生苦諦下有邊見也戒禁取有二類一非因執因二非道執道前非因執因推因果者隨斷常身邊見生故在見苦斷及執無想定別解脫戒等為出離道此迷麤果即見苦斷若執撥道邪見等為出離道即違道義強見道諦斷集滅諦下無戒禁取如後文釋由獨頭無明不了四諦引生疑疑有無引邪見撥無執此邪見等為勝故取有見取也與五見相應無明貪等緣五見等生亦見所斷餘緣事貪等及相應無明緣事境生即修所斷四諦下十煩惱四句分別者有唯緣諦即邪見獨頭無明疑身邊見有唯重緣貪嗔慢有通二即相應無明及戒見二取苦集即親緣滅道即重緣第四句即修道貪等四也問無慚愧何故不立為使答以三義故不立一行相麤二依他建立三依使生故使是其本故無慚等及忿等以不堅勞皆不立也問三界見惑即就界不就地修惑即約地地別斷答見惑三界各自界煩惱相似故就果論修惑九地各能潤生故就當地論不就界論也正理四十六云得果遍智皆就界建立隨眠准釋。",
        "from": "X53n0839_003:0185b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "數數習道方能斷故此約無漏道說若六行不重習前道也正理破云若緣見此所斷法性即隨彼所斷者苦集下十一遍使應通見修斷能緣五部法生故又滅道下邪見等三緣無漏非斷法生應是非斷自釋云若緣苦集諦為境名見苦斷乃至若緣修部為境即是修斷先師開為親緣重緣以救前正理十一遍支緣五部生通五部斷難云若緣見此為境即五見疑獨頭無明即親緣煩惱緣若緣見此所斷法為境即貪等緣五見疑無明背上生隨五見疑無明見斷他部緣十一使及滅道下邪見等即是前見此為境攝也今釋云此中辨貪等四中前三十二以配見斷了何得正理以遍行及滅道邪見等若古人分別見此為境及見此所斷為境以遮正理二難者十一遍使及滅道下邪見可爾九上緣惑不緣自界四諦所斷法生是何所斷由無漏慧見苦諦時不見上界境故也問何以得知貪等緣見惑生答准識身足論第十一貪等緣有覆無記法生即知貪等緣身邊見生故知貪等即是重緣也前八十八見法忍類忍所害故後十是法智類智所害故若言不爾者智害即決定有漏無漏道斷皆是智害忍即不定無漏道即忍害有漏道即智害也。",
        "from": "X53n0839_003:0185c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "西國名壞身是經部釋後有部釋名有身見勿無所緣方執故此破經部壞身見壞是無義非如何緣無法執我也斷見即蘊我是七斷滅論等常見離蘊我四遍常等斷常即邊也三見執所緣境名身見等二取執能緣取為勝等名見取等也。",
        "from": "X53n0839_003:0186a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "邪見即見者問五見皆顛倒轉應名名邪見答此見損邪滅中重名邪如臰蘇等也若撥無空非擇滅緣名不緣體非過重故能撥彼者是欲界修所斷邪行相智非邪見也戒禁邪非因執因即迷集諦如何不在斷集諦邪答先迷苦果如執梵王自在天能生眾生先計梵王等為我然後計彼為常我說自身執是身邊見此二種見既在苦諦故戒禁取只在苦諦也計有漏戒為成佛因及狗牛等為生天因此迷苦果皆並見苦斷若謗道邪見等三為出離道邪見等三實非出離道而執此三為出離道此迷道諦是見道斷三十七品等問身見迷自事不執他身如何計梵王為常是身邊見也答夫執梵王等為常我必先於自身計我常等為道正因也問道下邪見等三不是道非道計道即是戒禁取無想涅槃非滅計為滅何故滅下無戒禁取答執無想果名涅槃即是執劣為勝是見取収也問執道下邪見等三非道計道即是戒禁取滅下邪見等非滅計滅何故是見取非戒取攝答道下邪見等撥無道諦即便執邪見為出離道故是戒取攝滅下邪見等緣滅撥無滅別執無想滅為滅不即執邪見等三為滅故是見取攝也又執無想涅槃為滅彼計與釋教涅槃是常寂不別是執劣為勝見取収執邪見等三為出離道體相與佛道有別違道強故是戒取攝也於有漏無常等法中計常樂我淨故此四種皆名顛倒問我見我所見二俱時生緣何我見得為我顛倒體我所見即非答第二說通取我所見為我倒體今此論同前說唯取我見正理婆沙同第二說二俱取也戒取具後二義無一何倒一義邪見具初中二義闕後一義貪等三義皆闕非顛倒體也問見取中執善法為淨實樂為樂為緣何名倒答彼執有漏為涅槃樂淨故得名倒正理不取餘三諦下見取為樂淨以非增勝故唯取苦諦下見取也問無我執為我得說為倒邪斷二見實有撥為無如何非倒答我見具三義得說為我倒邪斷二見闕後一義非是倒見及相應見所斷故者見即三見體相應即同時心心所皆是見斷故入流永斷問想心與見相應得立為倒受等亦與見相應亦立為倒答以世間言想心亂不言受等亂心與見為所依想能取像與見相應故亦是倒也二十部中無別分別部法邪分別皆名分別部如初果人有妻妾等於妻妾上取計樂淨故此二倒上想心未斷經部想心通迷理事故通二斷也破云如聖人見繩為蛇等非是顛倒不與見相應故率爾見不爭境起心覺已即止故非是倒也。",
        "from": "X53n0839_003:0186a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "令心高舉物名慢名者此都釋慢名。",
        "from": "X53n0839_003:0186c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "行轉不同等此釋高舉雖齊行解生處不同分成七種也婆沙云於勝功能未得謂得彼勝功能名增上增上慢所緣境一說有五有漏善根及四果凡夫起五種初果起三種等有說有九有漏善根及四向四果為九凡夫起九初果起七種等至無學位不起也於多分勝謂己少劣者雖然稱境以有挍量心故昇成高舉相故舉問也問增上與邪慢皆於未得法上生有何差別答增上慢功能法上生邪慢無能法上又增上內外道起邪唯外道起又增上通凡聖起邪唯凡夫起也七慢諸說不同評曰通見修斷問我慢緣我見起如何通修斷答身見執五斷法為我慢緣我起故通二斷也界繫諸說不同評曰通三界繫若爾色無色界無族等挍量如何有卑慢等答有挍量定等功能故又無始數習故有也。",
        "from": "X53n0839_003:0186c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "慢類者正理釋云即是九慢品類九慢緣五斷法生故通五部斷若爾我見緣五斷法生應我見通五部斷答苦法智忍行得二修違我見故不違我慢也如煞生等是修惑引生初二果聖者雖有修惑不行煞等問有愛及無愛准後文斷常見所增即通見惑引如何此言唯修答理實通見惑引此言唯修者順經說故問無愛有愛既求煩惱不生即是善性緣何成染答此不求擇滅唯求不生故成也。",
        "from": "X53n0839_003:0186c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "藹羅筏拏是水名名龍即是象等者等取阿索羅落北洲無想天舊云伊羅鉢多羅此云香葉象也十一煩惱具為因等三三義若與煩惱同時心心所無遍隨眠五部義四相義無遍緣五部義唯有為因遍生五部一義三義中有一義皆是遍行因遍行因故舉寬也無明正理唯取不共相應五見收此論通二無漏緣准此說問苦集諦下有邪見等得為遍行因滅道下邪見等何故非遍行因答一以苦集煩惱親緣重緣皆緣有漏境意樂無別二以勢堅勞得為遍行因滅道與上相違故不立也又苦集九地[牙-(必-心)+?]為因果苦集下煩惱得為九上緣惑滅諦九地不[牙-(必-心)+?]為因道諦法類治不同故滅道下無九上緣惑也問如何得知十一遍使見惑得與修惑為因答以世間有我者貪嗔等勝故知見惑與修惑為因問十一遍使頓緣為前後緣若頓緣者十遍使行因不同如何俱起若前後緣餘煩惱亦有此能應立為遍行因答不據一時頓緣然有頓緣力用且如邪見力能撥無五部故說頓緣不說十一使一時起若貪等自相惑緣苦不緣集等故不立等。",
        "from": "X53n0839_003:0187a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "九上緣惑者婆沙十八欲界非修地非離染地不能攝伏自界煩惱故得起緣色無色界色無色界與上相違不能緣欲界也由無明不了上二界故引生疑疑後生邪見撥無上界苦果見取執邪見為勝戒取計為生天因等此約苦下三見疑無明緣上界集下煩惱緣上准前釋欲界緣色無色界既如此緣無色亦然八地相望下地緣上地亦爾也欲色二界不合緣者以緣欲自地即隨增緣色無色即不隨增若欲或緣上隨增即有三界雜亂失上二界欲界緣時得合緣者以同不隨增色緣無色無色亦不隨增色界自地即隨增下地緣上地隨增不隨增准此釋上地界煩惱不緣下界地者上地煩惱緣下地等即有斷欲惑盡不得遍知義也八地一一別緣為八句乃至八地合緣為八句思之可知。",
        "from": "X53n0839_003:0187a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不執上界為我我所故者如外道執梵王為常我即是身邊二見緣上界如何言身邊二見不緣上耶答不執梵王身為己身常我故不是己身身邊二見執梵王為常我見邪智攝謂與無明相應邪智即於欲界先起二見執常我已次後即起獨頭無明執彼梵王謂為常我行相曚昧不能決執所以非見也問九上緣或自界五部即隨增若緣上界五部即不隨增答一自界有彼愛異熟等流果即隨增色無色界與上相違二異熟地別故三上地細下地麤故緣上不隨增也問遍行隨眠何寬何狹答[牙-(必-心)+?]有寬狹遍行唯苦集諦下少分取過現二世狹通四相及相應法即寬隨眠通四諦三世寬不通四相及相應法即狹四句分別未來四諦煩惱及過現非遍行煩惱為第一句過現十一使上相應俱有法為第二句過現十一使為第三句未來煩惱以及過現非遍行煩惱上相應法四相為第四句也。",
        "from": "X53n0839_003:0187b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏緣者諸行即有為法於此法上得無為名諸行擇滅如欲界有為法欲界愛所潤攝為己有身見執我等斷此愛時顯得無為餘人聞說還為此地見滅所斷邪見等緣以上地法下地愛見等不耽著故下地邪見不緣上地滅也。",
        "from": "X53n0839_003:0187c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於道邪見等緣者愛著自界法身見執為我我所若自尋教或聞他說即由躭著自地行故便撥彼道為無或疑及愚故被三惑緣問邪見緣滅諦即緣自地滅滅智緣諦應不緣上地滅諦答滅智境是悟即緣上地滅邪見境是迷不緣上地滅也問九上緣或是迷如何評緣上地苦集答以所緣九地苦集[牙-(必-心)+?]為因故不同滅諦[牙-(必-心)+?]不為因也。",
        "from": "X53n0839_003:0187c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "非因果故者非同類因等流果不同於道諦非能作因增上果不同於苦集唯緣自地滅也問邪見緣滅為見緣為不見俱總相緣若不見如何名無漏緣若見如何撥無答應言剩滅但尋教見或聞他說即撥為無緣道亦爾但都撥為無如夜見杌為人等。",
        "from": "X53n0839_003:0187c14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六地法智者未至地法智能治欲界治餘即兼中間等五地法智治上八地修惑疏唯舉中間等五地以此五地全不治欲界故偏舉也類智初定及未至中間起治初定名自地治上七地名餘上七地准此釋問六地法智[牙-(必-心)+?]相因即緣一時緣五地者苦類忍類智因苦法智生應緣法智時即緣上斷智答雖法類智品下答由別治故也。",
        "from": "X53n0839_003:0187c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二初無故者或更有釋四諦闕二諦下智二無見修惑中闕不斷上界惑初無法智雖治上界修惑不治上界見惑見惑不緣法智品道也問九地類治不治欲欲界三惑不能緣未至地有四道無間道能斷欲界惑餘三道不能治欲惑及上五地四道亦不能治欲界欲界三惑如何能緣答一六地智四道同故二[牙-(必-心)+?]相因故三六地[牙-(必-心)+?]相緣故故欲界三惑皆能緣法智類智法雖亦[牙-(必-心)+?]為因以治別故如二人相背面不相見法類亦然也問先凡夫斷欲惑盡後入見道起苦法智忍應斷上見惑答先起法忍觀諦為法引類忍斷上惑法忍不斷上惑也。",
        "from": "X53n0839_003:0188a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "即由此因者即由道道諦六地及九地[牙-(必-心)+?]為因緣一時即六惑九傍顯九地苦集[牙-(必-心)+?]為因故九上緣惑能緣上一地至八地謂苦集不能對治緣一時不能緣八地不同道也。",
        "from": "X53n0839_003:0188a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二種隨增者先軌範師說相應隨增如城邑側有糞與水土相和由糞力令水土成穢由水土令糞力轉增城邑況身水土況心心所糞如煩惱況法可知。",
        "from": "X53n0839_003:0188a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "所緣隨增如猪犬於糞穢中眠戲由穢增於犬犬況煩惱穢況有漏境。",
        "from": "X53n0839_003:0188a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏緣惑及九上緣惑如白玉悞墮泥中不增波也所緣隨增必是相應隨增自有相應不是所緣即九上緣惑也問過未隨眠有隨眠增不答定有以有前後二得未斷起故若無者異生起善心應離染也設過未二世煩惱上得斷了仍名有隨眠者如作人停作國王先位由號作人國王一以有體故二以曾當有用故也上界煩惱由無苦果又定力伏故有覆無記性故欲界身邊見有覆性者以不障施戒修故如世人有我者為我未來修福也欲界三十六煩惱除身邊二見餘三十四皆是不善性名不善。",
        "from": "X53n0839_003:0188a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不善惑中婆沙一百一十三此三具五義故謂通五部遮五見疑遍六識簡慢是隨眠性簡纏垢能發麤惡身語業作斷善窂強加行是故獨立貪等三為不善根也。",
        "from": "X53n0839_003:0188b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無記惑中者即欲界身邊見及上二界煩惱全也貪即是愛。",
        "from": "X53n0839_003:0188b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "愛上定者謂定上起貪。",
        "from": "X53n0839_003:0188b13_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "見上定者執上定為勝非因執因等慢即執此定起慢也此末師計本師不立無記根一以劣弱故二無教說故善惡猛利即立有部亦云也立無量聖教皆已滅沒若無記法力劣却須立根也問記者記者答捨置不答如何名記答以記彼言此不應言即是記也世尊如來命皆是我異名外道改我為世等問佛佛記言不應答也因明無記根便明四記一置(竹吏切赦也設也實也建也上也)。",
        "from": "X53n0839_003:0188b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十",
        "from": "X53n0839_003:0188b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世者三世即五蘊法上所繫色法即一一極微心心所一一剎那皆有煩惱緣若斷一一極微及剎那心心所上煩惱盡皆得擇滅今此約五部論據大段說也貪等三及貪等相應無明約緣別法即貪緣順不緣違等若共相惑如邪見撥無因果順違皆撥無餘准此釋共相惑全及相應無明唯意識相應自相惑中貪嗔及此二相應無明通與六識相應慢及慢相應無明唯意識相應今言隨增不要現在在過未二世未斷二世煩惱上法前後得得在身即名隨增以心心所與煩惱及境相繫定也自相惑過現二世緣境六識通論以此二世前五識相應貪嗔二及相應無明不具二義一世不遍不繫三世二事不遍緣青不緣黃等不名遍行過現意識相應貪等三及相應無明闕事遍一義亦不名遍行雖然貪等是自相惑但望緣三世及事遍即名遍行遍行寬自相狹意識寬五識狹若不生五識亦寬也未來意識相應貪等三及相應無明能遍緣三世約未來眾多意識一類眾多意識與貪相應一類眾多意識與嗔等相應此眾多意識相應貪等縛一切事名事遍故疏云意識種類無邊所繫法流三世名世遍疏言境流三世也或未來眾多人意識與貪等相應緣事及三世名遍問如於糞等貪不緣時何名事遍答自相緣惑約自所緣境為事遍不順貪等緣嗔等亦緣也未來五識相應貪嗔及相應無明可生者即緣一世事不名遍行若不生者有眾多五識與貪嗔及相應無明在未來世能繫自所緣事所緣事流遍三世能緣五識及貪等即在未來以生相繫定得名遍行但是貪望順境名遍不望違境說。",
        "from": "X53n0839_003:0188b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "或有同時參差三世者即一眼識與貪等合緣三境生所緣三境在三世能繫眠識與貪等在未來具事世二遍一念眠識上具事世二遍況未來有無量五識合論所以疏云種類無邊未來五識與意識別明者以緣境別故也。",
        "from": "X53n0839_003:0189a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "共相惑與意識相應種類多故緣一切境盡如過去邪見撥過去現在亦然未來准此說。",
        "from": "X53n0839_003:0189a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "現世以不定故者如有邪見撥無過去因未來果不撥現在等有唯緣一世有二世三世合緣隨緣多少即繫以不定故不說遍行也。",
        "from": "X53n0839_003:0189a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "名現正緣能繫經部云前未斷惑能繫三世若有過未二世可論說能繫過未既無如何可說惑繫能若三世實有即應有為是常住也。",
        "from": "X53n0839_003:0189a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "過去色是定共別解脫戒此有漏戒上有煩惱緣勤修道厭捨未來色是定道二戒應勤斷煩惱求彼二戒。",
        "from": "X53n0839_003:0189a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若過去色非有勤修厭捨以未來是反難。",
        "from": "X53n0839_003:0189a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "以過去去色是有故下順成未來准過去釋也。",
        "from": "X53n0839_003:0189a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "既緣過未生心故知有體過未不同兔角無不同現在有能生心心所覺故有體也經部難云火輪生覺夢見兔有角亦能生心應有實體有部通云火輪依實色生覺夢中見兔角由盡同見兔及別見牛角夢想心亂謂言牛角角在兔頭上也。",
        "from": "X53n0839_003:0189a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世友者世是天父母生已恐鬼神害故立名言與天為友也問若無用即名過未者現在彼同分眼不撥識無用應名過未世答不然以眼有取後果用故是現在世也問過去同類因及異熟因有與果用應名現在無取果用應名過去即二法同時半是現在半是過去答正理救云據取果名現在過去與果名功能也。",
        "from": "X53n0839_003:0189b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法體有用者用既不離體體既常有用亦應然用若離體即同外道同異句義。",
        "from": "X53n0839_003:0189b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又此作用云何得說為去來今者體既三世皆有不自分三世由作用分三世又此作用云何現在有用過未無用現在更由何法方名有用若更有用便成無窮失也。",
        "from": "X53n0839_003:0189b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "且作用中而得更立有餘作用者即應現在作用上更有作用用即有過未更有作用不作用作用方無也。",
        "from": "X53n0839_003:0189b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "故不許法本無今有下經部自三世道理若不許我作此釋即三世義皆不成立也世尊說有過未二世者據曾有即當有說又過未生識者我許緣無生識又我許現在種子能生當果不過去業能生當果又言煩惱縛三世雖無過未體有能縛煩惱種子在身此遠通前難此前諸文正理皆有故應撿也。",
        "from": "X53n0839_003:0189b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "何事有幾等者此通問境識及隨增也事即六塵若細論色即一一極微心心所即一一剎那皆有煩惱緣也。",
        "from": "X53n0839_003:0189b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "略毗婆娑即此論是也十六境為所緣十六識為能緣也且應知何法等者未辨隨增先明境識故言且也釋此疏文分二初配境識後明隨增也。",
        "from": "X53n0839_003:0189c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "苦集修斷各五識緣者此第一節無客字長行論文具有也謂苦集下有遍行能緣五部故得相緣且苦下五識緣者自部下十煩惱為同類因能緣苦部若遍行因緣他部及九上緣即不緣苦諦五識中有緣不緣時故論云客下皆准此釋也集下緣苦者七惑中為遍行因者即緣苦部他部緣及九上緣即不緣也修部緣者修有三性識善無記中聞思慧覺觀諦理及作無我觀即緣白骨持息念不善識即不緣就觀諦中有漏即緣無漏不緣也。",
        "from": "X53n0839_003:0189c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色界修部緣者初定近分厭下苦等即緣欣上淨妙等及染無記即不緣也。",
        "from": "X53n0839_003:0189c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏識緣者苦忍智即緣類忍智不緣也欲苦既爾集諦五識准苦說之。",
        "from": "X53n0839_003:0189c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "修部五識緣者苦集下遍行即緣彼部若九上及自部惑即不緣也。",
        "from": "X53n0839_003:0189c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色修部緣者善作無我觀及苦麤障即緣靜妙及染無記即不緣也。",
        "from": "X53n0839_003:0189c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏識緣者法忍智緣類忍智不緣修部自緣者聞思觀諦理及無我觀又如眼等緣色等境即緣也。",
        "from": "X53n0839_003:0189c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色界苦集修各八識緣者自界三如欲界說欲界三緣者苦集下九上緣惑即緣自界緣即不緣修斷通三性善作忻上心及無我觀即緣餘善及染無記即不緣無色修緣者空處近分厭下緣欣上及染無記不緣也無漏識緣者類智忍緣法智忍不緣緣苦集時即修部也。",
        "from": "X53n0839_003:0190a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無色界苦集修斷各十識緣者彼欲色界各三緣者准前欲界緣色界說自界三如欲色界說無漏如色界說也。",
        "from": "X53n0839_003:0190a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "見滅道皆增自識緣者且欲界滅道各六識緣者此據滅道所斷煩惱說非滅道體也苦集下緣者即遍行緣修下即無我觀等緣自識緣者不取親緣邪見等三以緣無漏邪見等是不緣也取重緣貪等即緣者唯緣有漏法也。",
        "from": "X53n0839_003:0190a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色界修斷緣者苦麤障無我觀即緣染無記不緣也。",
        "from": "X53n0839_003:0190a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏第六者唯滅道法忍智緣類忍智不緣也又云無漏識緣滅道者非是滅道法忍智以滅道邪見等體即是苦集故用苦集法忍智智以滅道法忍智緣無漏故也。",
        "from": "X53n0839_003:0190a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色界滅道各九識緣無色十一識緣者亦准欲界說自識即取重緣貪等也。",
        "from": "X53n0839_003:0190a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏法通十識緣者前三界十五識境中滅道約所斷法論此約二諦體兼虗空非擇滅言十識者三界滅道各邪見等三為六三界修部空無我觀為三成九無漏識欲界法忍智上二界類忍智為十也此總論無漏不簡有為無為也。",
        "from": "X53n0839_003:0190a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如是了智下正明樂根隨增義分二一出樂根數二隨其所應下正辨隨增且出樂根數者所以就樂根明者隨作論者意若就諸根明亦准前難若遍二十二根即文繁廣遮定婆沙具約二十二根作法先問樂根次問單緣識後問重緣識也定樂根名數有七前十六境中通七部也。",
        "from": "X53n0839_003:0190b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "欲修所斷及諸遍行者明修部樂十五或隨增也且修斷四惑中自部隨增者五識相應貪及相應無明同時起有相應隨增無所緣謂不緣樂故五識相應嗔及無明約自他身樂無二隨增義嗔不順樂故也修斷意識相應四惑望緣五識樂有所緣隨增無相應隨增無樂故緣自身過未及他身三世樂也苦集十一遍使緣修斷樂作所緣隨增也。",
        "from": "X53n0839_003:0190b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色界一切者此言一切者是總相說色界據實只取初定三定餘地無樂初定三識相應樂十四惑隨增苦集下十一遍使及修斷三惑意相應者唯所緣隨增三識相應貪嗔唯相應隨增也第三定意樂苦集下共十五惑通二隨增苦集體即樂根故滅道下十三惑中觀緣惑與樂唯相應隨增與邪見等相應故無所緣隨增也若重緣邪見等即所緣隨增若與樂相應即相應隨增也修斷三惑通二隨增與樂相應起即相應隨增若緣自身過未他身三世樂即所緣隨增色界三十一惑也已上明樂根色欲色二界共四十六惑隨增有唯所緣有通二種隨增如前辨也若不取煩惱望樂根並無二隨增義也第二明單緣識七十八惑隨增此段分二一出識數二辨隨增此言識者即是前緣樂根煩惱相應之識後重緣是此緣十二識上煩惱相應之識。",
        "from": "X53n0839_003:0190b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "謂欲界四除見滅斷者苦集下十一使親緣修斷樂及九上緣惑緣上界樂道下邪見亦親緣無漏樂道諦體即是樂根緣一地時即緣六地道也修斷中不善意識緣自部樂若善意識即無我觀能緣自部樂及第三定無漏樂若無記識唯緣自部已上是出欲界緣樂根上四識相也。",
        "from": "X53n0839_003:0190c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "色界五部者除滅下邪見等三者此三緣無為不是緣樂識前樂根隨增取此三者前約與樂根相應故取為隨增此約緣樂識滅諦非樂根故不取也取重緣貪等緣樂識邪見相應樂也苦集取第三定緣自部惑并十一遍使名單緣識除九上緣惑第四定已上無樂根故道下親重緣惑並得為單緣識也修斷三性中染無記緣自部樂善緣五部樂及下欲界五識樂也不取初定三識樂明者此約界明不約地也無色界二善作空無我觀緣類智品道緣一即緣九緣著第三定無漏樂也。",
        "from": "X53n0839_003:0190c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏第十即見道諦及修所斷者道下取邪見等三修斷取二者法智類智是也。",
        "from": "X53n0839_003:0190c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此隨所應下正明隨增者欲界四部有二十九惑者且苦集下十一遍使是緣修斷樂識有相應隨增重緣貪等即所緣隨增道下八惑親重緣准苦集說修部四惑意識相應是單緣識有相應隨增四惑緣善無記心即所緣隨增也色界五部二十八惑隨增者苦集下親重緣惑皆是單緣識具二隨增也滅下邪見等三體非是樂根與樂相應起不是單緣識故除也貪等是單緣識是相應隨增也道下七惑親迷三惑是單識是相應隨增重緣貪等即所緣隨增及相應也修斷三惑緣善無記識即所緣隨增自為單緣即相應隨增也。",
        "from": "X53n0839_003:0191a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無色界二部及諸遍行隨眠隨增者道下邪見等三是單識緣第三定無漏樂即相應增重緣貪等即所緣隨增也修斷貪等緣無我觀善心是所緣隨增也苦集下十一遍使緣道下邪見等及修斷善識是所緣隨增也。",
        "from": "X53n0839_003:0191a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若復有問言下第三重緣識分二一出識數二正明隨增。",
        "from": "X53n0839_003:0191a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "緣緣樂根識者上緣是第三重緣識下緣字是前單緣識後重緣識緣前單識言緣緣也即是後起心緣前識起也重緣識取遍行者謂遍行不緣無漏樂不得為單識能緣五部緣著道下邪見等及修斷善得為重緣識也此重緣識有八十二惑隨增七十八如單識數加苦集貪慢四也明隨增者即是後念起者緣於前念如苦集下親緣惑為單緣識重緣惑為重緣餘十一遍行等緣此重緣作所緣隨增等餘皆准此說也欲界二十九惑色界二十八惑無色二十五惑隨增也染心與惑相應即是相應隨增若緣此染心上煩惱未斷所得即所緣隨增若斷過未煩惱上得是斷縛性次心心所與煩惱同一聚在過未世是不斷伴性名有隨眠若隨增即得未斷也。",
        "from": "X53n0839_003:0191a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若無記心心所名無染心若煩惱緣此善無記心此無記心方名有隨眠故為隨增方得名有隨眠若不隨增善無記心心所不得名有隨眠心也。",
        "from": "X53n0839_003:0191b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "婆沙四十六云垢不說為漏等者煩惱垢麤不堅住故不信懈怠放逸過輕不為漏等也品類足論上界二纏得為有漏體此論以二義故不說也。",
        "from": "X53n0839_003:0191b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "同內門轉者正理破云若爾色界緣外色聲法外境無色緣法外境生如何以內門因釋彼自釋第二因云以同類智對治道俱舍救云以內門者據多分說也。",
        "from": "X53n0839_003:0191b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無明漏等與十二支中無明別者此唯無明彼通一切煩惱等也。",
        "from": "X53n0839_003:0191b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三漏前二依主釋後一持業釋瀑流軛前二依主後二持業釋四取依主釋。",
        "from": "X53n0839_003:0191b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六十二見如婆沙第一百九十九及二百廣明不可具引略出名數謂前際分別有十八謂四遍常論四一分常論二無因論四有邊論四不死矯亂論後際有四十四謂十六有想論八無想論八非有想非無想論七斷滅論五現法涅槃足前際十八成六十二見也。",
        "from": "X53n0839_003:0191b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四遍常論者一由憶劫初執我世常謂由彼外道得宿命通憶劫初事因此起見執我世常二由憶生執我世常由彼得通憶多生事便執為常三由天眼見諸有情死此生彼諸蘊相續執我世常既得天眼見不斷故便謂是常四由尋思不如實知執我世常彼諸外道作如是念有法常有無法常無便謂是常四遍常論常見為體也。",
        "from": "X53n0839_003:0191c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四一分常論者一從梵世來生此界得宿住通便言大梵是常自身無常二聞梵王說大種與心隨一無常心便忍許三從遊戲忘念天沒來生此間得宿住通便作是念於彼天中不遊戲者彼天常住四從意憤恚天沒如忘念天說此四以邊見為體。",
        "from": "X53n0839_003:0191c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二無因論者一從無想天沒憶出心便起邪見一切諸法本無今有二由尋思位有今生不了過去便撥為無此二邪見為體。",
        "from": "X53n0839_003:0191c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四有邊論者一由天眼下見地獄上見初定執我及世俱是有邊二由天眼傍見無邊執我及世俱無邊三由天眼上下見邊由神境通運身傍去不得邊際執我及世亦有邊亦無邊四非有邊非無邊即遮第三為此第四我及世間不可定說為有邊為無邊此四一師以身見為體第二說通常斷見為體若執有邊即是斷見若執無邊即是常見也。",
        "from": "X53n0839_003:0191c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四不死矯亂論者不死謂無以長壽外道執為常住不死不得生天一不如實知怖忘語故便矯亂答是法應說不應說二不如實知怖邪見故不得生天便矯亂答應說不應說三不如實知怖愚癡故不得生天便矯亂答應說不應說四不如實知怖不了故不得生天便返詰彼若有問言我於後世為有非有便反詰言汝何所欲汝若言有我意亦然此四計天不死是常即彼復計善酬問答得生彼天是戒禁取為體以非因計因故也於後際第十六有想論者一執有色死後生有想二執我無色死後生有想三執我亦有色亦無色死後生有想四執我非有色非無色死後生有想五執我有邊死後生有想六執我無邊死後生有想七執我亦有邊亦無邊死後生有想八執我非有邊非無邊死後生有想九我有一想死後生有想十我有種種想死後生有想十一我有小想死後生有想十二我有無量想死後生有想十三我純有苦十四我純有樂十五我有苦樂十六我有非苦非樂八無想論者取有想中前八唯無想名別八非有想無想論者亦如無想說此上總以常見為體七斷滅論者一此我為麤四大造死後斷滅二我欲界天死後斷滅三我色界天死後斷滅四空處天死後斷滅五識處六無所有處七非想非非想處皆言死後斷滅此以斷見為體五現法涅槃者一於欲界中受五欲樂二於初定受定喜樂三於二定受樂四於三定受樂五於四定受現法涅槃此五執劣為勝見取為體也。",
        "from": "X53n0839_003:0192a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經部四取皆貪為體從境立名皆依主釋問貪等煩惱起時取現行煩惱行相極麤易知如何言難知答一以貪等起時自不知故二是彼流類故三或色法一一極微心心剎那皆有煩惱緣故名微細煩惱在心識猶如人眠難覺知也。",
        "from": "X53n0839_003:0192b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三義釋隨初一總後二是別第二約得第三約現行說漏有二義住義如疏釋流者不順菩提涅槃正流於生死中流泄過無窮通久住流轉二義也。",
        "from": "X53n0839_003:0192b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "瀑流者急流煩惱漂有情善品如急流漂物。",
        "from": "X53n0839_003:0192b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "和合者煩惱與業合果生也。",
        "from": "X53n0839_003:0192b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "為有漏依者四取為因來世有漏法依此生名為有漏依也。",
        "from": "X53n0839_003:0192b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十一",
        "from": "X53n0839_003:0192b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "問纏既未說如何此言已說隨眠并纏答體雖未說已說纏名為漏等及一百八煩惱也。",
        "from": "X53n0839_003:0192b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "結九者此九力能於境生繫縛有情名結也。",
        "from": "X53n0839_003:0192b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "隨惑即十纏六垢名隨煩惱名即十六皆於感觀二類轉嫉即感慳即觀遍顯得十六隨惑也。",
        "from": "X53n0839_003:0192b20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十纏中無慚愧雖性不善性非自力起悔雖自力起通善惡性睡眠昏沈掉舉二義俱無餘嫉慳忿覆二義皆具也前說九結今更說五結故言。",
        "from": "X53n0839_003:0192b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又五順下分五者是數分者別義即三界別故五順之下分下分即欲界此五共有力令不起出欲界第二說人及界皆名下分也。",
        "from": "X53n0839_003:0192c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "由貪嗔二不超欲界設以六行斷欲界煩惱盡上生有頂名超下有情由身見等三為障為因還生下界若爾六行道斷欲界貪等及身見等三皆斷如何論言由三復還下答有二說一由有頂身見等三為緣引生下界身見等故前文言有頂地煩惱為煩惱根二由不斷欲界身見等體但斷其得故身見等更生也。",
        "from": "X53n0839_003:0192c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三結通三界四部二結欲界五部問集滅下無戒禁取如何說見取隨戒取轉答此據苦道二諦說或因苦道下戒取引集滅下見取生故說見取隨戒取轉也。",
        "from": "X53n0839_003:0192c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "說斷三種攝彼三根者即身見等三彼經言斷三結據三根說邊見等三苗亦隨斷舉根攝苗也。",
        "from": "X53n0839_003:0192c15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "異方者涅槃望三界生死名異方恐得涅槃我我所斷故怖畏解脫也。",
        "from": "X53n0839_003:0192c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上分者正理論說體有八物掉舉等三二界別故即是第三果人名上分此五障不出上二界見惑已斷惑兼順下界生故見惑不說為順上分結。",
        "from": "X53n0839_003:0192c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上二界愛別立者一過重二所愛別故掉舉等三無此能故合立也問隨煩惱中何故上二界唯立掉舉不立餘隨煩惱答以障定勝故立掉舉為結惛沈順定不立也。",
        "from": "X53n0839_003:0192c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "樂受有貪縛約勝及自身說亦有嗔縛如見怨受樂時生嗔貪嗔同時必有癡於苦有貪見怨受苦貪彼受苦有癡准前捨受有貪嗔不知癡此苦樂捨通三性善無記性即唯所緣隨增不善有覆無記二通二隨增若緣他身一向所緣隨增此言苦樂者憂喜亦名苦樂也又三縛攝餘惑五見疑癡中攝慢貪中攝世尊為劣慧人麤相說三縛遮離三染名縛又唯現行不據成就說也。",
        "from": "X53n0839_003:0193a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "隨煩惱此餘者此根本之餘也若據隨根本煩惱除根本十煩惱外餘皆名隨煩惱故後門辨從根本等流若以隨心王起名隨煩惱即根本亦隨煩惱也繫縛有情置生死獄名纏。",
        "from": "X53n0839_003:0193a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "睡眠通三性無記性中通一謂異熟生於善性中唯生得善與生得善心相生故不通威儀工巧通果加行善以加行生睡眠任運生正理五十四約三性任運心引受隨能引心通三性今取染汙為纏也財法二施得二果不施名相違。",
        "from": "X53n0839_003:0193a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "昧略者昧即簡定定中取境分明略即簡散散取境多故取境少不明也。",
        "from": "X53n0839_003:0193a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "嗔即損他命害即打罵等忿即令憤發也。",
        "from": "X53n0839_003:0193a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "等流者即隨或有力與根本煩惱齊等流即流類或等即是引從根本煩惱引生也約相同名等流無愧作罪怖即由無明力不了因果生帶境名惛沈亦由無明不了生。",
        "from": "X53n0839_003:0193a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "悔從疑者謂作善了由疑無果故生追悔也。",
        "from": "X53n0839_003:0193b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "正理云忿恨別者忿相即大力即劣恨相小用即大也。",
        "from": "X53n0839_003:0193b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "諂為心曲五見嶇曲故五見等流也。",
        "from": "X53n0839_003:0193b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "由自在起不隨從見惑生故疾等五纏六垢不通見斷是修斷也。",
        "from": "X53n0839_003:0193b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "歡行轉釋與喜樂二受相應遍六識故前五識即樂第六識即喜相應也以戚行轉釋與憂喜相應遍六識故五識即苦意識與憂相應已下皆准此釋。",
        "from": "X53n0839_003:0193b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唐由虗捐即棄也。",
        "from": "X53n0839_003:0193b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "以煩惱勢用欲盡時與捨心相應。",
        "from": "X53n0839_003:0193b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "諂誑二定有喜捨相應唯意地故惛掉憍通三界憍初二定喜捨相應唯意地故第三定樂捨第四已上唯捨惛掉初定喜樂捨相應有四識故二定喜捨三定樂捨四定已上唯捨相應也正理論云惛掉通三界故與眠悔合立顯惛掉亦唯取在欲也問無明一最勝何故不立為葢答云一以力勝餘一切煩惱合立為一葢力用不及無明故不立葢二云不說自成故不說也不立慢為葢者由有慢者修善法勝故又高舉故葢下轉也。",
        "from": "X53n0839_003:0193b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不立五見者一說由執我者修離染故一說以慧為體性據利故。",
        "from": "X53n0839_003:0193b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不順盖義盖義下轉上二界不立盖者一說不是初離染障一說非不善性故隨煩惱中不立者准上應知治者不盖食者能盖此五能盖彼二也。",
        "from": "X53n0839_003:0193b24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "昧劣者取境不明名昧取境力微名劣從用為名也。",
        "from": "X53n0839_003:0193c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "[夢-夕+登]瞢是目不明睡眠之先兆也。",
        "from": "X53n0839_003:0193c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不樂即身心不適悅。",
        "from": "X53n0839_003:0193c04_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "嚬申即事業過分身疲勞生。",
        "from": "X53n0839_003:0193c05_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "食不平等者由所飲食過於恒度等或香味觸等隨有偏增能使食者令心昏眠。",
        "from": "X53n0839_003:0193c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "令心沈明者沈即下昧即闇取境不明也。",
        "from": "X53n0839_003:0193c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "尋親里等厭散亂同生掉悔。",
        "from": "X53n0839_003:0193c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "前二治沈言光明不言慧後二言定何不言黑暗者可隨舉一影顯[牙-(必-心)+?]彰。",
        "from": "X53n0839_003:0193c10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "貪葢食可愛相治不淨觀嗔食可憎想治即慈悲觀疑食謂三世境治即十二緣起歡此論釋昏眠掉悔約食治用同合立為一惑貪等力用勝獨立一盖餘二用劣合立也。",
        "from": "X53n0839_003:0193c12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "有部釋昏眠能障慧蘊約違障說昏眠與慧明昧有別掉悔與定高下別故經部約順障又昏眠第三障慧蘊掉悔第四障定蘊不順定慧障義次第也。",
        "from": "X53n0839_003:0193c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "他界遍行即九上緣惑九上緣惑所緣即上界苦集起苦集法智忍九上緣惑即斷及起苦集類智忍知上界苦集時九上緣惑已斷故不斷也及滅道下重緣或緣邪見等上起邪見等體即苦集諦於彼斷位即滅道法智忍生即滅道下親緣重緣惑皆斷滅道法智忍不知邪見等及起苦集知忍知苦集時即是知滅道下邪見等彼重緣貪等未斷故不斷也。",
        "from": "X53n0839_003:0193c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "遍知所緣故者遍知所緣境時能緣煩惱即斷問貪等重緣知苦集諦時不知貪等所緣如何名遍知所緣答雖親重不同近遠有別皆取四諦為所緣境知所緣時親重緣惑皆斷上界亦爾也。",
        "from": "X53n0839_003:0194a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "斷彼能緣故者自界緣惑即苦集下一切煩惱總名自界緣惑九上緣惑雖緣上界體亦繫在自界以緣上界且名所緣謂後念苦集下煩惱緣此九上緣惑生亦能為因生彼九惑斷即能緣自界惑時所緣九上緣惑即隨斷也。",
        "from": "X53n0839_003:0194a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "對治起故斷者問三界見惑皆由對治道生斷如苦諦下惑苦法智忍為對治道緣何斷見惑不言對治道耶答九品修惑決定由九品對治道斷故說之見惑對治道不定若有頂即決定苦類忍為對治道下八地凡即有漏道聖即無漏道為對治以此不定故見惑不言對治道也。",
        "from": "X53n0839_003:0194a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無間道即斷煩惱上得解脫道即持無為上得加行道惑一惑多不定餘三道皆有九品也四對治各在一道據多分說如厭亦通三道緣苦集厭患也無間不通餘三道持通四道四道皆遠煩惱得也。",
        "from": "X53n0839_003:0194a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "相應法即心心所同聚相近不可令離煩惱但煩惱於所緣境不生名斷問煩惱斷時但斷自身煩惱如何言於所緣令諸惑斷答此是斷自身煩惱上得令於境無繫縛能名離所緣不同古人貪緣嗔時斷能緣貪嗔上得無為也問過去已滅與現相近未來未生與現相隣攝一剎那如何名遠答以世性攝故名遠三世體性各別攝現在故界過未名遠若爾現在與過去及與未來皆世性別皆應名遠答過未皆無作用故得名遠現在有用與過未世世性不同不名遠也若爾無為無用應亦名遠答無為現在有得故名近若爾過未二世與現在亦有得應名近答為隔現在名近無為無礙名近者即過現二世應得二名以性攝故名遠以隣次故名近。",
        "from": "X53n0839_003:0194a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經部釋云過去以得體未來未得體以此二別名遠也。",
        "from": "X53n0839_003:0194b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "正理救云過未非五識境故又有意識不緣故時分攝故名遠不可將無為難無為三世不攝不論遠近如虗空遍一切處名近也又擇滅於色心二法上得以相無名近無失故經部云凡言遠者依相上立過未既無體相如何名遠。",
        "from": "X53n0839_003:0194b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘經部有漏道不斷惑但能伏不現行如石鎮草去石即生入聖再斷有部有漏即斷入聖不退即更不斷也無為無勝劣由道有勝劣證有淺深若後道勝進即重得起勝以得隨道生故重起得。",
        "from": "X53n0839_003:0194b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此言六時約鈍根及次第人說若利根即五時等無練根一時也若無間道即能斷若解脫道正證當品無為解脫道名持生持彼無為上得生也若得四果最後解脫道亦名持生亦得果攝入得果持生劣故持生有二有漏道無漏道別也論云六時等約次第得果說若超越第三果人若先有漏道斷欲界惑盡依未至地入見道至第十六心超前二果取第三果欲界見四諦下無為四時得一凡位有漏道持生二無漏道持生三得三果時得四得四果時得若上界前三諦下無為三時得前四除有漏道持生道諦下無為二時得修斷九品無為不為第三果體一時有得有漏持生一時若根本地入見道四法忍不是欲界斷道欲四諦下無為及修斷九品無為一時得即有漏持生上二界前三諦下無為三時得道諦下無為二時得也若超越第二果必依未至地入見道前七諦下無為四時持生及後三果時得道諦下無為三時得除持生修道六品無為亦一時得也菩薩先斷無處有處下八地煩惱後依第四定入見道欲界見修斷無為及無所有處下八地修道無為二時得一有漏道持生二得果時得無處有處前七地見道無為三時得前二上加無漏道持生有頂地四諦下無為及修惑前八品無為二時得第九品一時得也獨覺亦凡位斷無處有處下八地煩惱盡若未至地入見道前八地見斷無為及初定上七地修斷無為三時得一有漏持生二無漏持生三得果得若中間等五地入見道欲界見修無為一時得初定上七地見修無為三時得有頂地四諦下無為及修道前八品無為名二時得一持生時得二得果時得第九品一時得謂除持生一也問如超越第三果人欲界修斷第九品無為得為第三果體不佛獨覺第二果修斷六品無為准此難答既不重印不得為二三乃獨覺果體佛即不爾許為果體以自在故如得滅定若不爾者應無為果體少無覺果無漏法王初登覺位萬德來朝又如根本地不是欲界重印道欲界四諦下無為不得為第三果體修道九品無為不得第三果等體准此釋問佛與獨覺因斷下八地見修惑盡緣何獨覺從初定至無處有處即重以無漏道印菩薩即不起耶答佛利根故從見道後直斷有頂修惑獨覺准正理一百二十六從初定起無漏道重即為勢方能斷得有頂也若爾麟覺及佛不斷欲界見惑即同利根如何重起四法智忍耶答如次第人起見道必具觀四諦方斷見惑以初起難修道隨觀一諦即能斷修惑以非初起故麟角及佛雖不斷欲界見惑以初起無漏見道故起四法智忍為方便引四類智忍也。",
        "from": "X53n0839_003:0194b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "遍知以無漏智為體舊云九永斷智智即知遍智永斷即斷遍知智為能證斷即所證所證名遍知果取因名也問修道是智可名斷遍知見道八忍如何名遍知答是智眷屬亦得智名如臣作時亦名王作若言見斷即得六果若見道即五果第六是修道果也問身見等三初果即斷如何第三果方得五順下分結盡遍知答據五下分結都盡處得遍知說無失又取身見等三下所顯無為為此遍知體言五順下分結盡遍知義亦無失正理論釋五下分次第人五中斷二超越人斷有頂身見等三二人合說也若色愛盡即唯色界修惑盡一切結釋遍知准五順下分釋上二界見道煩惱治同合立遍知也。",
        "from": "X53n0839_003:0195a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於中忍果六者問如超越第三人第十六心時不取上二界道下遍知以結集為五順下分遍知故第十六心時得五順下分結盡遍知此遍知即是第十五心忍果兼前忍果六即得士如何論言忍果得六答婆沙六十三說五順下分許是忍果論言得六者約次第得果人說若并超越即得共得七種如下捨五得一即是超越得五下分果也。",
        "from": "X53n0839_003:0195b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "餘三智果者法智許容得三類智得二世俗智得二今言智果三三種智合說也。",
        "from": "X53n0839_003:0195b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "未至果一切者未至等六地有見道又未至有九地名有九品無漏道并有漏斷欲界惑有漏道故得九遍知果也。",
        "from": "X53n0839_003:0195b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "有部正義根本入見道者先斷欲界煩惱盡更不斷欲界見修惑又根本不是欲界斷道如何言別引無為得生今起四法忍者與四類智忍為方便中間地亦五果也。",
        "from": "X53n0839_003:0195b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "聖九者九地皆有無漏道此依未至地入見道者說菩薩因中依第四定見道位成上界見道二果修斷中成一第十六心時修道破前二立一五下分故無覺果位成一謂一切結盡麟角准前菩薩第四定入見道說部行依前未至入見道因位在見道中成五見諦五果若根本地入見道者即唯成上界見道二遍知果至第十六心修道時破前二立為五下分遍知起一百二十六心重印色界四地并得色愛盡遍知果位成一切結盡一遍知也四沙門果中初果向五初果及第二果向并第三果向皆得六第三果得一第四向二果一若超越第三果未至入見道向五果一若根本入見道向二果一超越第二向果六也問如超越第三果人至苦類智位三緣即具如何不立遍知答此據次第說至位方立也超越人未得欲界集下無漏得若依根本入見道不得欲界見斷三也問如何見道三緣立遍知修道即四緣立答見道唯染修道通染不染上無為為體同類修道能緣煩惱未盡相未顯故不立遍知若至後超越界相顯方立遍知也。",
        "from": "X53n0839_003:0195b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "雙因越界別者如四定斷修道染斷初二三定煩惱盡時雙因必定未得越界無色亦爾也二緣具故方集遍知得果越界二緣相對四句分別有得果不越界初果為第一句初果第二果是越色界為第二句第三四果為第三句第四句可知得遍知不得果四句分別准前可知。",
        "from": "X53n0839_003:0195c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不還果人生第四定成就樂根及生無色界成色愛盡遍知故知起重遍知故知起重印道也有捨一得一即佛麟角捨五順下分得一切結盡一遍知也此門說得遍知兼捨者有二意若進勝道捨劣即捨名不捨體也若退失捨勝得劣即捨名體俱捨起或退一說據起或至生相一說起惑至現在方名退也。",
        "from": "X53n0839_003:0195c23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "俱舍論釋頌疏義鈔下",
        "from": "X53n0839_003:0196a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "京兆西明寺沙門　慧暉　述",
        "from": "X53n0839_003:0196a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十二　賢聖品",
        "from": "X53n0839_003:0196a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋此品疏分二一釋名二分文解釋。",
        "from": "X53n0839_003:0196a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "賢和者即事和。",
        "from": "X53n0839_003:0196a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "聖正者正即涅槃理聖於此正得決定故說文云有多才以行謂之賢桂菀珠藂云無事不通為聖依仁王經地前名賢地上名聖即三賢十聖五位修行此論即七聖八聖七方便為七賢四向四果為八聖亦有五位修行前三方便為資糧位四加行為加行位見道為通達位修道為修習位無學道為究竟位也。",
        "from": "X53n0839_003:0196a10_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "頌煩惱等斷者等取相應俱有法與煩惱同斷然斷必由道力故得者斷即無為法也正理論第二云若一剎那心能頓斷九品即無漏者有漏道能一剎那斷五部下上上品等應是無漏答五部合斷俱時厭易若當諦別斷一時九品即難也問空非二滅何故非四諦攝答若法是苦果苦因苦滅苦對治者立為諦二滅非四位故四諦不攝又無為法故非道諦攝無記故非滅諦攝無漏故非若集諦攝更有一釋如上卷已述婆娑問四諦若依實事體即有三苦集一物故若依因果即有五部道有因果故若依現觀即有八諦上下各四諦故答依因果道諦同出苦合立一若爾苦集同趣如何不合立一答以行相別觀故若爾道諦行相何不別觀答依諦信故如邪見諦無集即無過去不謗現世果故苦集諦下行相別觀道諦謗因即果所以觀道諦行相同信准此也問四諦凡聖同觀如何唯為聖諦答聖知實苦等名聖諦凡觀苦謂樂不名凡諦若爾何不就顛倒名凡諦答聖見知不顛倒得名聖諦凡見不知顛倒不名凡諦如外道言我見世間無一目者尚苦況涅槃中六根皆無故觀為苦也又六行道初觀欲界為苦等觀初定為靜等若依二定即觀初定為苦等行相不定不名凡諦也聖者由得聖智一得已後不退故所觀境隨能觀智亦名聖諦凡人後觀不正故不名聖諦也問四諦皆有四行相觀如何四行相觀苦但名苦等諦不名空等諦餘緣三諦准此答依不共立名如苦唯有漏果法上立具三苦故餘三不定無常通苦集道諦空非我通四諦集名唯是能招苦果故若因生緣通無漏道滅名即局滅諦靜通有漏定及無漏道妙離通道諦道名唯顯向涅槃路故如通世間道理行名通有漏出通滅諦故皆不立諦名也詮部說滅道一向名聖諦唯諦故苦集通凡聖觀亦名凡諦也五受中苦受是苦如何有漏法皆名苦諦境若但樂無處苦即似苦相非定別有苦生行者即四相舉無常滅相勝攝餘三相也有部異師釋樂少苦多正義以就行苦皆苦諦攝許有實樂若經部以三因故樂亦是苦也經部四愛為集諦一現有愛貪現在果二後有愛即貪未來果三與喜俱行愛即已得物上轉四彼彼隨樂愛即未得物上轉前二緣內身起後二緣外境生有部通云就勝說愛為集諦也問四諦二諦相攝云何答二攝四四攝二不盡二攝四者苦集可破壞即世俗諦攝實義即勝義諦攝道如船筏可捨即世俗實即勝義滅即勝義二滅亦勝義攝二滅四諦不攝世俗與勝義俱通漏無漏也瓶水等名世俗者可破壞故名世顯在俗情名俗瓶水等未破折時望彼俗情邊是實有名諦也經部師無漏等智取法不顛倒名勝義餘智取法先觀為樂後觀為苦等名世俗智大乘四真四俗一假實二理事三淺深四詮首一瓶軍林等二蘊處界三四諦四二空真如五一真法界初唯俗後唯真中間望前即真望後即俗廣如彼述欲入聖位先觀涅槃德厭生死過患親近善友發戒定慧等聞慧觀法如初學浮常執水況執文觀義思慧如曾習能暫捨木況暫捨文觀義修慧如久習者能永捨木況全捨文觀義依生得慧及生得善聞教發聞慧等聞思等慧唯加行生修慧通三得也。",
        "from": "X53n0839_003:0196a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "前二易可成者即身心遠離由不貪永等正理云已得衣等若多若少若麤若細更不希求名喜足舊云知足也不廣求多少妙衣等名少欲也問無色界無衣食貪等色界無欲食如何有前三聖種答無色無有怨境得有無嗔善根雖無衣食等何妨得有無貪善根喜足功能又色界有對治四貪道無色有厭患及勝進二道於身等不貪衣等亦不貪也衣等為緣能生眾聖名種也婆沙一百八十一云樂斷無間道樂修解脫道又前見道後修道也正理云問第四亦治嗔等煩惱何不取無嗔等為體答理實應爾以前三用無貪為性故第四亦同前三無貪為體也婆沙一百八十一云問喜足少欲皆用無貪為性如何喜足為聖種少欲非聖種答喜足於現在不貪難故立聖種少欲未來未得衣處不貪易不立又正理云喜足不求立少欲更求不立又外道有少欲濫彼故不立也問如何緣衣等無食是無漏性耶答聖道是無漏衣等無貪為緣引生隨所引聖道亦是無漏也問如何不說藥為聖種答於藥不生貪故又病人方食非一切人皆食又攝在前三中故有在食中如患勢食葛粉有在臥具中如患冷著桝在臥具有在衣以樹裹腹也廣即八萬四千中即五停心觀多貪不淨多嗔慈悲執我十八界愚癡十二因緣惡覺數息觀惡者有二也依近對治門說不淨觀治貪遠即通治嗔等煩惱餘皆准此說也若別治即四對治門今據通治故辨骨隟也供奉謂折旋俯仰即自身供奉他人有人傳謂他人供奉自身及緣他顯形色妙觸起貪皆非理觀修骨鏁於自身安心等故知四貪約自身上起也正理論云此鈍根人修先觀外人音瘀後方觀內身若利根者先觀自身皮為外邊緣內三十六物等也不淨觀不斷惑以緣小故如五識為同令緣一地等方斷惑也又三作意一自相二共相三勝解三中共相斷惑也婆沙三十一評家以無貪為體同時通四蘊五蘊緣欲界色體修不淨觀不緣色名字是善性約行相名不淨也問此觀遍緣者如阿那律不觀天為不淨舍利子不觀佛為不淨如何名遍緣欲界色答勝阿那律者能觀天為不淨佛還能觀佛為不淨也婆沙云初起在人後修成就生天亦得現行一說初後皆人中此論同前說此勝解作意相應唯緣自世如五識緣境不生通緣三世也婆沙云非生得是加行得通離深得離下地染得上地不淨觀後由加行方得現前異生上加行獨覺中加行聲聞或中或上加行也唯近分捨者唯捨受放欲界苦憂喜樂初二定喜第三定樂能生尋放也正理云菩薩獨覺自能起聲聞因說方起也出入相兼數共成十也。",
        "from": "X53n0839_003:0196c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "心隨息而行者息從唯心齊髖髀胵乃至足指出一尋等隨所至方也。",
        "from": "X53n0839_003:0197b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "以息是身一分攝者四大成身息即四大中風大攝至第五位六處滿方有息也息依心轉無心無息若有息者身在欲界入二無心定應有息也若身在欲界及初二三定入第四定以入定無麤心引彼四大遍住身分無毛孔開也問第四定有外風如何無息合第四雖有外風以彼依身不容納故正理論云入第四有漏定引彼堅密大種遍身造無表可言無毛孔開若入彼無漏定即身生處四大造無表既非堅密如何無毛孔開答造無漏無表雖是生處四大攝而極微細與彼相似故無有過也問生第四定既無毛孔開如何發語答由傾動故亦能發聲如機開聲豈由毛吼有說咽喉上有毛吼有說發語時毛吼即蹔開破後二說云感得無毛吼身如何發語即開也。",
        "from": "X53n0839_003:0197b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "俱舍慧暉第五",
        "from": "X53n0839_003:0197c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "俱舍論釋頌疏義鈔下末",
        "from": "X53n0839_003:0197c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "京兆西明寺沙門　慧暉　述",
        "from": "X53n0839_003:0197c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十三",
        "from": "X53n0839_003:0197c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "自相有二一自相二自相中共相十處各生一智名自相共生一智名共相乃至觀色一一極微即自相同青等即共相受等亦爾無表如何答此說礙色不說無表也與五停心觀中不淨別者一體不同前無貪此慧二治不同前治貪此治四顛倒三行相不同四緣境不同前唯色此通心心所也。",
        "from": "X53n0839_003:0197c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "有非俱有者身受心法中身及法二有與念住不俱時也有部釋慧為果念為因論主慧為因念為果同時因果也四法一一別緣為四句名不雜緣二二合緣為三句三三合緣為二句四法合緣為一句雜緣也四分善根觀一一諦熟方改易觀煗頂忍三各有三品次第轉生若未見六行道斷欲界惑即思引修慧若先斷欲界惑即從修引煗等也大乘煗等名明德明增即順無順無間定也煗位觀所取空頂位即所取空順能取空忍位有三品下忍印所取空中忍印能取空上忍雙印二空也。",
        "from": "X53n0839_003:0198a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如人頂者人頂身中最高顯動善中勝若山頂即進退中故也忍者謂信信許四諦故前二雖信以退故此位不退偏得名忍世第一更勝不名忍者以中上忍不具十六行及四諦故況世第一也。",
        "from": "X53n0839_003:0198a12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無我非我別者無我即色中無受等非我即色不是我等也十六行相互相違不可得起一一即行修餘行相皆是得修未減八諦緣時八諦下所減行相亦起法前得云也。",
        "from": "X53n0839_003:0198a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "與欲苦四行相屬如名次第擬宜相當者德光論師梵言瞿拏鉢剌是中印度袜底補國人是西方有學聖人於本國造百餘部論如留無常入見道者於欲界及上界苦諦非我集下緣滅下離道下出共有八行相故名擬宜相當繫屬定第一周一時減苦下空集下生滅下妙道下行此八行相第二周減苦下苦集下集下滅妙道下如此八行相第三周減餘八行相不減即三周減行留餘八行相入見道者准前說此上兩說同釋婆娑文十六十二八四行相十六行相約未減道時說十二即約減道諦時說德光約第一周減八行相說餘准此說光法師取後說寶法師取前說破德光論師言准正理論言七處善觀觀色苦色集色苦滅色趣滅行色味色患色出離既更不觀道故知從後除道下三行及道諦緣方不觀也又我見增者留無常入見道如何於餘三諦下緣離出等行相與苦下非我同時減也問世第一法名勝者為都勝為分勝若都勝者豈勝世俗智見道眷屬故若分勝者煗等前三皆分勝故應名世第一答此法於有漏中都勝能開聖道門世俗智無此能故不名世第一又世俗智因此世第一法方得生也問現在世第一法能引聖道名勝未來無力能引聖道應非第一答未來順已起者亦名世第一法也問同時隨轉色四相不作等無間緣應非世第一答同一生住異滅果等故亦得名第一問如何世第一法與苦法智忍作強等無間緣答具四善故一品類故同見道是上品等故二無量善法所生長故三生六十劫等三性相同故性即同以慧為體相者若世第一法作苦行相見道亦爾四為此苦法忍廣修煗等加行故也問如何能得得作沙門果體不得為四善根體答沙門果據成就說所以得為體此四加行據等無間緣此得非體以前後不定故不同生等及定共戒以同一果故若得為煗等體煗等上法後得常在身應常起煗等既得果如何成就加行道也。",
        "from": "X53n0839_003:0198a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三道名決擇此四能順是因三道所順是果順之決擇故依主釋順決擇即分也北洲色天有勝依身以厭心界故若三惡趣有勝厭心所依身界故人天九處身具二義故得起煗等善根也。",
        "from": "X53n0839_003:0198c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第四善根天得初起者即約人中修前三乃命終生天更起煗等便起世第一法前三六天不能初起有勝依身以厭心界故人中具二義四善根皆得初起也。",
        "from": "X53n0839_003:0198c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "女界得二者以前三善根時長容轉根如女得女善根得而成就在身亦現行得男善根得而不在身成就不現行男身得二准上釋第四女得二以女身界容轉成勝身男於上忍已得女身非擇滅故男不得女善根女男得二如得別解脫戒各容懸發得二也失地捨者如依初定起煗等命終生二定方名失地若生初定不名失地故不捨煗等此四是有漏善為滿業不能為引厭背有故也異生無見道資彼煗等善根故命終捨也正理論云依根本地起煗等者即是先凡位斷惑欲盡後起煗等以根本地止觀均平現世得入聖有說必至涅槃婆沙第六必入見道未至中間起煗等者以止觀不平不定入聖次第得果者決定依未至地入見道也。",
        "from": "X53n0839_003:0198c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "捨了再得非是先所捨者如別解脫戒捨了再得非是先所捨者也。",
        "from": "X53n0839_003:0199a02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "遇了分位者即了五位修行次第者為說修煗法次第修頂從頂生忍准此也。",
        "from": "X53n0839_003:0199a04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於卵濕生者以遇多遇痴故得聖後不受若未得聖前即亦許受如世羅等問順解脫分亦必至涅槃與煗何別答前解脫攝後即決擇攝前散善攝後即定善攝前七方便不攝後即加行攝後修十六行相前無十六行相此慧為體前散善有此別也都有五義一必至涅槃二不斷善三不造逆四不隨惡趣五不退煗位有前一頂位有前二忍位世第一具五也無想大梵僻見處北洲無見道扇[打-丁+虎]等身劣煩惱故。",
        "from": "X53n0839_003:0199a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第八有等者婆沙論等取色男一處二生業於色界十六天一處受一生更不受第二生於第二生得非擇滅欲界第八生業色界第二生業障得上品忍世第一在現在作等無間緣引苦忍法生世第一於見斷煩惱上得非擇滅若爾異生即是聖人世第一法法現在時有見道上得故答但苦法忍在生相雖有得在身未成就不名聖也聲聞下獨覺中佛上修聲聞忍畢許轉成部行獨覺不許轉作佛菩薩修因往惡趣故也部行獨覺起煗頂同聲聞許轉成佛也。",
        "from": "X53n0839_003:0199a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一坐者更釋上佛及麟角忍位不轉所以有說從不淨觀修也。",
        "from": "X53n0839_003:0199a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三乘轉根同異者前二乘因者一厭共求寂大義因也異者一行因久近證果遲速聲聞三生六十劫獨覺四生一百劫佛三無數劫一福德厚薄身有好醜聲聞無相獨覺容有三十一相等佛有三十二相三根有利鈍入法淺染即三獸渡河喻四慈悲厚薄去住時異即三獸被圍喻五事中利益身口不同獨覺身業神通聲聞菩薩通身口業化六得道時分得時取悟聲聞待時及教獨覺待時不待教佛亦爾七斷障生死證時觀境異二乘斷一障一分段生死菩薩二障皆斷聲聞觀四諦四威儀中得果獨覺觀十二緣菩薩觀萬行後二皆坐得果八依道及身遇佛依地異獨覺無漏道證聲聞初後果無漏道證中間二果通漏無漏道證佛唯此洲身獨覺三洲身得聲聞通三界身得前二果依未至地證第三果通第六地第四果通九地部行獨覺通九地證麟角及佛第四定證部行與聲聞通見佛及不見佛麟角及佛不見佛九用心多少異佛麟角三十四心部行獨覺一百六十心聲聞無覺十八心念初果十六念中二果一無間道一解脫道也解脫是果分是因順之解脫順解脫之分依主釋種解脫分善正理論云遇佛不遇佛男女皆修得也。",
        "from": "X53n0839_003:0199b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若三生者前說根本起四加行即現身入聖如何說有三生俱二生得答若今生根本地起煗等者必是前生先近分地起煗等故說三生也問三生與六十劫四生與百劫誰鈍誰利答皆通鈍利時多少不同者由厭心勝劣故有時長短若三生是利佛時最長應是鈍根問獨覺先斷無所有處下八地惑盡第二生依第四定入見道二生即得果如何論說四生答前世品說獨覺一說是凡夫修一說是前三果人准次前文得上忍猶不可轉況前三果人許轉總說三生及四生共得聲聞及獨覺果亦不可定配也問六十劫百劫取何劫量答准菩薩三無數劫取火灾劫二乘亦取火灾劫數成六十劫等若取增減劫者即如今有人種解脫分向後至壞空成劫中第九劫即滿六十劫三洲六天未有有情何處得果准此取火灾劫數成六十劫等也。",
        "from": "X53n0839_003:0199b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舉後等流者即後智是忍等流果合先舉忍後智合先智後忍言先舉智果顯忍因是無漏簡七方便中忍也忍言謂信先無始來於苦諦執我我所等今得無漏智知苦諦無我我所信唯有苦理名忍以欲界在下是麤苦果及散地故先觀後觀上二界苦等同定地故合觀也婆沙第三有三說一云苦法忍於未來世能滅異生性現在斷惑得如燈破闇現在生相破闇現在燒炷勢氣隔彼異生性不生故有部未來三法有用一光明二生相三苦法忍有說世第一法能捨異生性雖是有漏如乘御調象等或可二共捨世第一法如無間道與異性生俱滅苦法忍如解脫道與異生性不成就得俱生此論同此說也無間道雖與惑得俱惑得無力引後惑得至生相也解脫道在生相不被當品惑得礙名正解脫至現在名已解脫也大眾部見一諦時即觀四諦者如見苦諦時此知苦因名斷集證苦下滅即滅諦修苦下道即修道也苦諦下具四事業餘三諦各一事業謂斷證修也破云若見苦時即見四諦者應見共時即名初果等既不許然故知非也。",
        "from": "X53n0839_003:0199c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如修曾見者第十六心名修道如彼以後修道見已見諦故是修道攝也。",
        "from": "X53n0839_003:0200a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "難意者第十五心道類忍是道諦理至第十六心方見道類忍第十六心見第十五心亦是未見今見如何第十六心修道攝即答約諦即第十六心已知八諦理不據第十五心一剎那未知名見道攝又以果道攝故如餘修道若爾應如餘修道有退答以任持見道無為得故亦無退若爾住持見道無為得應見道攝答有大過失修道等皆持見道無為得豈皆不見道攝經部師第十六心是見道攝比量云以智攝故如餘修道七智有部是修道因云以果道攝如餘修道也。",
        "from": "X53n0839_003:0200a10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "難不名後三向者初六人除具縛人次三人除斷六品人次六十四人除斷欲界第九品一人也。",
        "from": "X53n0839_003:0200a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "後七地不言具縛人者離下地染即是上地具縛人也。",
        "from": "X53n0839_003:0200a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "根本煩惱有下中上名下三品下貪緣中境名下分成九品者約緣上中下三境起不同分成九品下貪緣上境起名下下品下貪緣中境起名下中品下貪緣下境起名下上品中品貪於上境起名中下品若於中境起名中中品若下境起名中上品上貪於上境起名上下品中境生名上中品下境生名上上品也。",
        "from": "X53n0839_003:0200a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "斷見惑了欲界有九品修惑共潤七生故約極多方受七生有一生二生得無學果者至後門辨至第七生斷三界修惑盡即得無學果問遍沒那含更受十六生如何但言七生得無學果答准下論文必經欲界生聖不往餘界生又前文言第八有等等取色無色一處二生業不受第八有等即七生類色界一處一生業即遍沒那含是故知七生人不得上二界受生上二界受生者不得欲界受生兩類各別得初果了便斷欲界修惑盡得第三果生初定等是十六生類也。",
        "from": "X53n0839_003:0200b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "如七步虵者由毒力不越七步四大力不減七步第四日瘧即隔日定發也。",
        "from": "X53n0839_003:0200b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "以不生長退墮業故者初果人不造三塗業若先有決定三塗業忍位尚不得況得初果也。",
        "from": "X53n0839_003:0200b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十四",
        "from": "X53n0839_003:0200b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "問頌中說三四品即攝三二生何故別說三二生耶答如初果中十六生類雖斷三四品有受多生一間受一生現般斷三四品不受生以不定故別說三二生也。",
        "from": "X53n0839_003:0200b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "若凡位斷六品惑入見道者不起重印道不得無漏根不具三緣名一來向不名家家也婆沙許斷九品修惑一一品皆得出觀以初無間道不得第三生非擇滅故三不得四等若許於斷第五品應即得第六生非擇滅故也此疏釋九品潤七生即別配品數定是光法師釋若寶法師即未斷第九品共潤七生如上上品有潤七生力乃至下下品有潤七生之力若斷前品了即後品獨潤七生不滿七生者亦七生攝若爾不滿七生即七生攝家家不滿三生應家家攝答七生不具緣滿與不滿皆七生攝家家須具三緣要具三二生方是家家攝也正理論云得聖後皆不造引業許造滿業婆沙五十三有二說一說同上不造引業一說許造如五淨居天何業生故知須造前師通云是漏無漏定資故業順決擇分尚不造業況得見道豈有造業初果七生亦是故業惑也聖者有漏道斷惑有分離染許命終有無漏定任持故凡夫無分離染有命終理以世俗道不堅窂故出定即退若初果人立誓入定斷欲界上六品惑了方出定即於六品得非擇滅若出定要至第六無間道方得六生非擇滅此既斷五必斷六斷五品時何不於六生即得非擇滅耶答斷五時必斷六以第二果容有退故未得六生非擇滅也疏中間斷上上一品即五生家家斷上二品即四生家家斷五品即一生半家家何故無耶答中上名三品同一上品及中品故同必斷六品也婆沙有天七人七乃至天一人一等受七生據人中得道人中入滅說前文四七二十八生此論文與婆沙同也天三人二及人三天二釋斷欲三品三生家家天二人一人二天一即釋斷四品二生家家此據得果入滅處不同也圓寂即涅槃前三果四向得自性涅槃不得餘二涅槃至第九解脫道證八十九品無為為二涅槃體身智在顯有餘身智無顯無餘也得初果了却斷三品更受三生若斷劫四品更受二生前論言七生約極多說若極少說現生即得無學果中間多少如理思之先凡位斷三四品及七八品惑入見道至道類智不名家家及一間以闕根故也。",
        "from": "X53n0839_003:0200c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "彼往天上一來人間者此約人中得第二果有下三品惑共潤人天各一生往天上受一生却來人間便入涅槃天上得果却來人中准此說也。",
        "from": "X53n0839_003:0201a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "凡位斷九品惑闕無根緣若現般那含闕生數皆不名一間也。",
        "from": "X53n0839_003:0201a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "越第九品惑等流果者第九品是前八品等流果斷此第九品惑盡名越也問欲界死受色界中有有有中般涅槃初定死生二定等何故無耶答欲界有胎生苦苦厭心勝在色界中有中故有中般色界與上相違故無中般若爾前二果在欲界何故無中般答中有身微弱於欲不善惑難斷自地無聖道在本有位尚不可越欲界無況在中有前文引中有不能斷不善惑隨生彼地起彼地聖道不起餘地也。",
        "from": "X53n0839_003:0201a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "經部先無行後有行者有速集道不由功用此釋先說無行所以無速進道有功用行是有行故後說之正理論云有行無行先後皆有經說我以有行可尊故先說無行後說也又生般有行無行皆約有餘涅槃說不約無餘涅槃說以色界於捨壽不自在為不具緣故也。",
        "from": "X53n0839_003:0201b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又流者行義有二上行樂定樂慧二果往色無色別也問退上三定生梵眾天得作全超等三退上二定生少光退上第四定生少淨及生無雲皆得作全超等三不答婆沙一百七十四說一說不得以依十六天建立全超等三上地有缺減故一說得作半超一說三種皆得也問樂定無色空處生得作全超等三不答亦得作三種也異生雖有上行以還下生不名上流也。",
        "from": "X53n0839_003:0201b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "全超等三種人雖於下諸地得涅槃不妨以色究竟天有頂天為極處也且造超業及生後三業據定業說理實亦造不定業也問如色界聖人造五淨居天業命終即生名生業如何名後答對中生業說理實亦造中生業此言造業約凡位造業不是得聖後造業也。",
        "from": "X53n0839_003:0201b17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "中般分三但由惑根者中般分惑分三品下下下中下上根分三品即上上上中上下故由惑根分中般成三也。",
        "from": "X53n0839_003:0201b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "生般惑三品者即中下中中中上。",
        "from": "X53n0839_003:0201c02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "根分三者即中上中中中下由惑根別分生般成三也。",
        "from": "X53n0839_003:0201c02_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上流分三其由惑根業惑三品者即全超等三如次。",
        "from": "X53n0839_003:0201c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上下上中上上根三品者即下上下中下下由。",
        "from": "X53n0839_003:0201c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "業分三品者即全超等三受生有多少故。",
        "from": "X53n0839_003:0201c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "謂全超業下釋也。",
        "from": "X53n0839_003:0201c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "唯行善事故名善士趣前二果有妻室無學雖唯行善以無趣向故非善士趣也。",
        "from": "X53n0839_003:0201c07_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又前二果為趣或上或下生此七唯趣上生故。",
        "from": "X53n0839_003:0201c08_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "又一間以人中有一生或上下不定不立此名也婆沙一百一十五云問何故上流不別立答中生二種名受一生行相難知故分上流受多生易知不分又中生時促易建立上流多生難建立合立一也婆沙又言問無色不還五事勝一地勝二界勝三損滅色蘊勝四定勝五煩惱少勝何故不立善士趣答彼非麤顯難可了知不立也。",
        "from": "X53n0839_003:0201c09_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "亦有此等差別相不者此前二門約色界受生五不還有此差別此文約欲界經生聖如色界有七九不還差別相不也言不往餘界不言自界自界許受多生經生多時即是練根淳熟也昔凡身得初果經生於聖身上得二果等名勝依止也。",
        "from": "X53n0839_003:0201c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "先一無漏一有漏似無間道後一無漏似解脫道者第一念心斷入第二念定定障第二念心斷入第三念定定障與以五蘊為體二前心與定障俱時滅後一無漏心如閇戶也問感五淨居為資故業為更造業若資故業即不合言前後無漏資中間有漏若更造即聖人如何更造後有業答以有漏無漏定資故業感淨居天即資無始曾得第四定業如前引婆沙文有二說此疏言無漏勢力熏修有漏是許造業也此疏說六心更起三心為六心等是第一師義第二師說更別起六心乃至十五心等又五品中間通出定不出定也又六品心不要相連起也正理論云為定感淨居為業名定應不用業若業應不用定答俱由二力感淨居也問修下三定有幾品心答一說有三謂下中上如是說者亦有五品心若有五品心應有五品果答雖無五品果有五品果根若有五品果即下三定有淨居天也。",
        "from": "X53n0839_003:0201c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "滅定無心極似涅槃依身證得此定名身證論主釋證得出定時有識身靜故却緣彼定言極似涅槃也佛告給孤獨長者福田等依無漏三學法上立滅定非是無漏法故身證不入也問何故俱解脫得入答無學以身解脫故有學身非解脫不立也。",
        "from": "X53n0839_003:0202a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "依因無故者依即因與聖為依因也出定後法後得在身亦名身證也第九無間道力能斷三界修惑以先斷故不斷第九品如大明出少大闇皆滅也問非相見惑見道能斷見道應是金剛喻定答以九品合斷勢力師劣劣惑斷道非金剛喻定也未至中間四定三無色皆有金剛喻定以九地皆有斷非想地惑道也問鈍無學未得利無學鈍無學應名有學以更學利故答不得別果及功德故非有學戒定慧三為所學體也。",
        "from": "X53n0839_003:0202a19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "因名乞士果名應供唯識云應以永害煩惱賊故應以永斷分段生死故應受人天廣供養故也問何故離欲修道染立二果色無色修道染立一果答欲界惑不善性難斷難破難可越度故立二果色無色與上相違也。",
        "from": "X53n0839_003:0202b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "見惑斷立一果修惑斷立三果者見惑易遠離立一果修惑與上相斷立三也。",
        "from": "X53n0839_003:0202b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "既聖離八地修惑各別二得義唯凡夫有漏道但引一得無漏離見惑及有頂地修惑但一無漏得以有漏道不斷有頂修惑名不同所作雖斷下八地見惑以見道不斷修惑名不同所作也。",
        "from": "X53n0839_003:0202b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "利根聖人第九無間道即起法前得得二智先起盡智者由先願煩惱盡故先起盡智無生智後合有俗智此論略無正理則有鈍根盡智長時利根無生智長時盡智金剛喻定後第二剎那生也。",
        "from": "X53n0839_003:0202b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今名四果名沙門者全取無漏道名通無間解脫是有財釋有漏道雖能斷無所有處下八地煩惱盡以斷不盡故有諸過失非沙門性也。",
        "from": "X53n0839_003:0202b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "至後果位起一類得得前無為非是總一得一一無為皆別有得也練根五因具故亦名得果得利果故後三果皆具五因有法後得得前八智十六行相或已得名得也無漏道名沙門性引無為上得生證無為為果正理論云初三果越欲界故立後果越上有頂故立也真梵簡初定假梵王八支聖道名法輪轉至佗五人身摧煩惱賊名轉法輪也相傳釋降未伏故即見道鎮已伏故即修道此釋不得不順論文法輪唯在見道今釋降未伏故即八忍鎮已伏故即七智皆在見道故唯初成道及涅槃時有地空天神唱名轉法輪者以至初後故非餘不轉中間但名說法也世尊轉者約能轉人說理實是五人法輪也問如何不名斷苦但名知苦答凡斷苦者但斷集因即後苦果不生不可斷此身身即是苦故問四諦下各有四行相如何但說知苦等不說知空等答理合如是知苦苦四苦名不共標之既知是苦即知是空等也經部約三道能詮教聲名法輪以佗人聞教得悟道故三周巡四諦名十二行相問既是正轉如何前名已轉答已至轉初名已非是轉畢名已也正理通云此與八聖道為入門故非法輪體也。",
        "from": "X53n0839_003:0202b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十五",
        "from": "X53n0839_003:0202c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "預流有七生及家家那含約隨信行有一億七萬七千三百九十人第四果亦有差別此時不時等二解脫以無漏相應心勝解脫為體因位勝果位名解脫婆沙更有一說三生得名時以修道劣故六十劫得名不時以修道勝故如佛三無數劫得也又此二名有二名一心解脫即離貪二慧解脫即離無明也。",
        "from": "X53n0839_003:0202c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "明六無學前五先說從生後結名不時即先結名後說從生作頌文便也。",
        "from": "X53n0839_003:0203a01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "退法學無學二位皆下故先有也有部說有羅漢名高底迦由鈍根故六返退第七返證得恐更以刀自害故知退也大眾部等四部說初果退以初得劣故也此宗初果初得無退以初得故退無所取義准超越中間二果亦初得無退初果及超越中間二界通鈍利根以初得故不退見道煩惱緣無事生事者體也如執苦為我等苦中無我體親重二感皆緣無事也。",
        "from": "X53n0839_003:0203a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "修道貪等於事上生二事者觀也可觀親好醜等生於中非無此相故知如色等可見聞等又解見惑審慮生修惑率爾起退也經部說初後果聖道所證不退中間果若無漏證亦不退有漏道證即許退也。",
        "from": "X53n0839_003:0203a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五從果非先者即是簡去二道性同取不同者許退也心所即四禪定許退佛言我說不動無學無由便隨定有退果義既是不動法如何退定也果退不命終向中退許命終也正理論說不淨觀無貪為體從此入聖有退持息念入聖無癡為體無退無痴即是慧故又三列有退有退緣故天等六欲天即無退闕退緣故又與順退分定相應心即退順住分定相應心不退又樂定退樂慧不退若全離欲即善無記心皆能起惑若分離欲即通三性心起惑若爾無學已斷染如何有退分定答順住分定中少分順退也性退不起染果退先起染後退果也仆(扶北反又)匹豆反也覺無學轉根加行道通曾未曾得無間解脫唯未曾得加行通漏無漏無間解脫唯無漏道未來修者亦爾加行道學無學各一無學第九解脫道通漏無漏以修一切地功德故也。",
        "from": "X53n0839_003:0203a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "學位見惑所發九品無知無覆無記性障利根九無間道引生斷也問轉思等成護如何不成利答無知多品未能總除故不成利但是轉彼劣性成利根名轉根不是捨劣別得利根也。",
        "from": "X53n0839_003:0203b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初二果依未至地第三果依六地初二果轉根與得果地必同後二果或同或異也。",
        "from": "X53n0839_003:0203b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "容捨果道者位求果道故果轉根捨果得果住向轉根捨向及果所得唯果唯求果道故故致容言如第三果轉根加行無間解脫道皆第三果道攝若住第四向加行無間勝果道攝解脫並是第三果道攝既練根第九解脫道第三果道攝故有學依六地也問解脫道已至涅槃果勝進已過如何名道答同加行類故或從前至後皆是道故或趣無餘依故名道也滅定是第八解脫名解脫也不艱辛任運轉釋樂名也艱辛轉名苦非道名苦通行唯是無漏道不說有漏道色界以五蘊為體無色四蘊為體遲速因人通行因法依主釋若總因法即持業釋也覺有三義自覺覺陀覺行圓滿如次簡凡夫二乘小菩薩盡無生智名菩薩。",
        "from": "X53n0839_003:0203b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三十七是分分者因義能趣菩薩之分也婆沙三說一說同此一說開戒為二有十一正命隨前二攝一說十二開戒為三婆沙更約七十五法廢立繁而不述。",
        "from": "X53n0839_003:0203c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "覺分不說心王者心王緣自相覺分緣共相又覺者是心所不可心王補佐心所也又立喜不立樂捨者覺分行相猛利樂捨凝滯故不立也。",
        "from": "X53n0839_003:0203c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四正斷者已生惡修律儀斷上得未生惡修斷斷上得斷字是即道已生善修防護善法斷惡法未生善修修習斷斷惡等修習善令生所以四種皆名斷也問已生善一品一念如何更令增長答經說順住分增長說勝進分也問欲界有惡可具有四正斷上二界無惡如何有四正斷答雖無惡法有彼功德又彼無所治有能治道故無色有遠分及持對治若爾有學有染可具有四無學無染如何有四答同上二界說也欲勤等四共定相應與神為足有餘師說神即是定欲等四與定為足舉果就因名神足也問信等五根何故先說為根後說為力答劣為根勝為力可屈為根不可屈為力勝劣有別義別者能生名根能斷名力不動為根不屈伏為力。",
        "from": "X53n0839_003:0203c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五根五力次第者謂於因果先起信心為果修因次行精進由精進故念住所緣由念力持心便得定由心定故能如實知是故信等如是次第也。",
        "from": "X53n0839_003:0203c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "念住等三助伴出體通一切加行善今言慧等約勝說也有部舉念住為初盡無生智為後也覺分在修道斷有頂惑近菩薩助勝也。",
        "from": "X53n0839_003:0203c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初定一切者約前後位共有三十七一念中即不共具以四念住等定不俱時餘容俱時有也。",
        "from": "X53n0839_003:0204a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "覺分轉者從念住至無生智名轉無漏慧觀證見四諦理名證在觀緣三寶及戒起信名淨信即名淨出定後天魔梵魔等不能破壞名淨也。",
        "from": "X53n0839_003:0204a05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於佛等者於是境第七聲戒是自內證不言於有漏慧有煩惱緣不得名淨唯取無漏慧緣三寶法及戒也。",
        "from": "X53n0839_003:0204a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四向四果八人有為無漏五蘊盡無生智為佛僧體五分法身等皆在道諦攝見道諦時起法前得得之菩薩獨覺道者菩薩唯有學十方界唯一人獨覺取麟角部行同聲聞也此四次第依出定後義次第說不依證時次第也。",
        "from": "X53n0839_003:0204a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "聖所受戒者受以信為體十五心中皆有戒名一切時得法寶有四教理行果教理通四諦行唯道諦果通滅道諦前三果雖通在家人得今取理和名僧不取受和也。",
        "from": "X53n0839_003:0204a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "正智與解脫俱時無正智時正解脫亦無也煩惱上得障心解脫現在斷二世煩惱上得未來心慧正得解脫約勝說煩惱為障理實通上二界定業皆能為障唯說心解脫不說心所者心所隨心王故也雖有學於障亦分得解脫以至無餘別故不說也。",
        "from": "X53n0839_003:0204a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無學得滅定是身解脫非心有學得滅定為第二句無學得滅定為第三句第四句可知。",
        "from": "X53n0839_003:0204b01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無為說三界者依世俗一相說斷貪名離等有漏法一一斷時皆得一雖義即有別體即不別也。",
        "from": "X53n0839_003:0204b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "厭通斷不斷是寬唯緣苦集是狹離通四諦寬唯是斷狹離即是通厭即是局名厭離通局也慧不是厭與厭相應名厭也。",
        "from": "X53n0839_003:0204b05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十六　分別智品第七之一釋疏文分二一釋名二分文解釋。",
        "from": "X53n0839_003:0204b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "智慧見忍同體義別決斷名智慧簡擇稱慧推求名見信可是忍聖慧忍簡四加行忍言聖慧忍自所斷惑斷與不斷未知未成決斷也。",
        "from": "X53n0839_003:0204b10_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "餘二者除盡無生智八忍外餘八智等通忍見智慧也五識相應慧不得名見無推未故正見取意識相應慧也。",
        "from": "X53n0839_003:0204b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "先凡位六行斷惑後入見道至苦法忍雖已決斷是忍流斷故又異生斷惑無間道中慧名智不名忍後容退故若忍辱忍即無嗔為體別安受苦忍即精進別諦察法忍即此法類智忍也問忍與疑得俱不得名為智忍與無明俱應不得名見答忍與疑得俱疑惑斷與不斷不名智忍與無明俱照了四諦四諦得名見也。",
        "from": "X53n0839_003:0204b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "後時方能遍緣四諦故通六智者此通外難難云既緣苦集不緣滅道體應不通六智也。",
        "from": "X53n0839_003:0204b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "有漏無漏智取境別者有漏智不分明顛倒轉無漏智分明不顛倒轉問俗智無始來曾觀苦如何不名苦智答後容觀為樂等故不名苦智也。",
        "from": "X53n0839_003:0204c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無漏佗心智勝不知有漏心者以想緣有漏法不別緣故不知也。",
        "from": "X53n0839_003:0204c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不緣勝地者有漏佗心智知心心所有十五謂欲界四定各下中上三心四定佗心智共有十二初定下佗心智知初定下品心及欲界三心初定中佗心智兼知初定中下心及欲界三心初定上佗心智能知六心二定等准此可知若無漏法不由地有勝劣但由根有上下故二定下心不能知初定中品心也無漏佗心智能知所知各十二四定各三如二定下佗心智知自地下及初定下心二定中品佗心智知自及下地中下品心二定上佗心智知自下地上中下心以無漏佗心智無有一人獨成三品故唯知自下品心有漏佗心智一人容成三品故能知六心也問如欲界有四定能化心初定佗心智知幾心答婆沙一說四心皆知欲界攝故一說知一唯知初定化心以上定佗心雖化欲界境以勝故不知也問中間禪三品心何地化心智知答婆沙多說評曰初定三品佗心智皆能知以同地攝故也過未無情他心智不能知法類二智所緣境別故不相知如二人相背一人觀天一人視地不相見面也雖欲界滅道法智知上二界以非全能知故也正理論一說麟角知四念心初二第八第十四是正義知三心是不正義也聲聞知二心十五心中隨知二心皆得部行獨覺同聲聞說此論說麟角知三心更不知者一說見道有二類心法類二智此已知畢一說知初二念心五念加行成知第八念已去力劣七八念方成一說苦集法智同緣有漏修佗心智加行易成滅道法智同緣無漏五念加行不成也如獼猴献蜜迦葉勸佛知道取阿難為侍者不是自能知佛入世俗心神力令知也出定後言我已知苦等表定中唯得盡智別言我已知苦不復更知等表定中二智俱得別利根但言不復更知謂言利根定中不得盡智重言我已知苦不復更知表在觀中二智皆得也。",
        "from": "X53n0839_003:0204c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "世俗智攝一全一少分者凡言一全只約攝自體已下攝一全皆准此釋。",
        "from": "X53n0839_003:0205a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "俗智攝一少分者攝有漏佗心智不攝無漏佗心智四智體中對餘三智名少分也。",
        "from": "X53n0839_003:0205a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法智類智攝七少分者攝苦等四智者此四智通法類智攝法智攝法分邊不攝類分邊類智攝類分邊不攝法分邊名少分。",
        "from": "X53n0839_003:0205a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "攝盡無生智者此二智以六智為體法智攝法分及四諦智法分邊不攝類分邊。",
        "from": "X53n0839_003:0205a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "攝佗心智者此智以四智為體法智攝法分邊類智攝類分邊。",
        "from": "X53n0839_003:0205a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "苦集滅四少分者攝法智類者此二智通四諦智苦智攝苦邊集滅准此。",
        "from": "X53n0839_003:0205a24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "攝盡無生智者此二智以六智為體苦智攝六智中苦智邊集滅智攝六智中集滅邊及攝六智中法類智少分法類智通四諦智苦集滅智各攝法類中苦集滅少分也。",
        "from": "X53n0839_003:0205b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "道智攝五少分者攝法類智者此二智通四諦智攝緣道諦邊法類智不攝緣餘三諦邊法類智也。",
        "from": "X53n0839_003:0205b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "攝盡無生智者此二智六智為體攝六智中道智也及法類智中緣道諦法類智攝佗心智者攝四智體中道智也。",
        "from": "X53n0839_003:0205b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "盡無生智攝六少分者攝無學身中四諦智及法類智非見性者不取無學身中六智有見性者及有學身六智也。",
        "from": "X53n0839_003:0205b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "事辨身中者無學智苦斷集證滅修道第九解脫道事以辨盡智初生依事辨身也。",
        "from": "X53n0839_003:0205b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一切聖道為因生故者見修無學等聖道遠近共為因名因圓生無生智也。",
        "from": "X53n0839_003:0205b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "釋名者正理論云智緣無生法生名無生智無生法即煩惱上非擇滅非擇滅雖常有此未闕緣得未生故惑無生法同二涅槃此涅槃得生煩惱不生故如涅槃得亦名涅槃盡智即解脫道無間道斷煩惱解脫道重知彼煩惱盡名盡智也。",
        "from": "X53n0839_003:0205b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "欲界滅道與上界滅道同滅即同是善常道同出離所以緣滅道法智能治上界問法智治上界得無為為法智攝為類智攝別依前義不應道理正是類智所治故別類智攝亦不應理法智證故答是類智攝問既法智證如何類智攝答以是類智正所知故也世俗智作自相共相即前三方便中作自共相加行中作十六行相也無漏心心所道諦攝故作道下四行相能知佗無漏心心所也。",
        "from": "X53n0839_003:0205b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "自相緣者如受領納名自佗心智亦作領納行相下知同類心准此釋佗心智加行先觀自身色形相表心喜怒然後觀佗心以色為門故無色界無佗心智別無漏即觀苦空等問無漏佗心智作道下四行相知無漏心有漏佗心智何故不作苦集下八行相知有漏心答無漏無始未曾得作道下四行相方知無漏心有漏佗心智無始曾得不作苦集諦行相亦能知也問何故入無漏定不知有漏心答一說以起無漏佗心智難不起智有漏心一說無漏緣有漏不能別緣佗心智但緣一法以不別緣故不知有漏心也問佗心智能知前人心前人心緣色此佗心智能知此色不又前人心作無常行相此佗心智能知此行相不答不能取前人所緣境及行相也。",
        "from": "X53n0839_003:0205c07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "我生已盡緣集行相梵行已立即緣道行相所作已辦緣滅行相不受後有緣苦行相我生者生即取非想四蘊三世生梵行已立一切無漏行已立者有學已立無學正立所作已辦即一切煩惱決已斷盡擇滅已證也出觀後有漏心中作我生已盡等言涉世俗我故於觀內離二行相也正理論釋二行相即是前十六行相無顛倒名有是處等也待因緣生法非常違我見非我對我見故如舍不是人違我所見故空如舍中無人者也等者引引果入現在也相續即身由受生不斷父母等緣成辨也滅即擇滅五蘊息得無為也。",
        "from": "X53n0839_003:0205c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "[辟-辛+戈]涅槃菩提正道理如有部正理義唯慧為體據簡擇滅義論主破云別唯以慧為十六行相體應不得俱生無有二慧俱時生故此能取境心上差別不同名行相通一切心心所別有體名有所行者兔角等如何生心耶答緣名生心心所也上三禪近分及四無色近分無無漏故無餘智也餘七智約第四果人依九品證故通九地起餘八智通緣五蘊法故通四念住攝也。",
        "from": "X53n0839_003:0206a07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十智相緣自身即約後念智緣前念智不約同時別望佗人說即同時緣也。",
        "from": "X53n0839_003:0206a15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "道智緣九者道智知道諦無漏法故不知俗智及有漏佗心智也俗有漏佗心智通苦集二諦攝故苦集智緣此二諦時知二智也。",
        "from": "X53n0839_003:0206a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四皆十者世俗智約緣無我觀能緣十智佗心智知有漏無漏心故緣十智盡無生初起緣四諦起故緣十智也。",
        "from": "X53n0839_003:0206a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一切法即五位色心心所不相應無為色不相應為三界不相應法心心所為三界相應法無漏相應即大地尋伺心王不相應即是道共無表四相得無為分二善及無記為十俗緣十約無我觀觀一切法無我說餘皆准此說也。",
        "from": "X53n0839_003:0206a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "俗智即作無我觀觀一切法自體大地大善地尋伺心王四相得以隣近故如眼不自緣扶根四塵也婆沙第十依地者聞所成依五地欲界四定慧所成即欲界修所成依六地謂未至中間四定無色緣少空處緣上四空處乃至有頂唯緣有頂此觀初起唯欲色界身欲界聞思修加行及色界聞通加行生得修通三得若欲界死生二定乃至生有頂後有頂死劫生初定善修者得初定無我觀。",
        "from": "X53n0839_003:0206b04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不善修者內法異生得通成就現行外法成就不現行以著我故也。",
        "from": "X53n0839_003:0206b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "生欲界起非我行相者緣一切法別生初定起非我行相唯緣初定乃至有頂緣法少故不緣欲界及同時無表色上三定准釋問欣厭二不相緣非我是何作意答欣作意云何緣厭法答設有無量可厭法少許欣即遍緣也。",
        "from": "X53n0839_003:0206b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "見道初五心來別超越人蓋成無漏佗心智見道初即苦法忍後即道類忍修道初道類智後即第九無間道無學道初第九解脫道後即未灰身來是也修者習善有為令圓滿自在不修染無受果故不修無記及無為果也見道等中皆有苦集滅道法類世俗見道等皆通得習二修別佗心智加行道有得修無習修佗心智在見道及無間皆無得習二修解脫勝進容得習二修皆有也盡無生智四道皆得習二修加行無間以見性故無習修解脫勝進皆有二修也問何緣見道唯同類修自諦行相答未曾得又八忍七智斷自諦惑不交雜故故不互修修道不爾也苦集滅智知苦等至無學位必當盡故有邊聲道智不爾三乘六性道各各別起不互修也問三諦邊修俗智何勝何劣答後諦邊修勝前諦邊故問此俗智何故不現前答未來有二類依身爭現在世一俗智依身二見道依身見道依身現前俗智依身闕現在世依身不得生故二惑現在一依身俗智見道隨一先起依此身餘智不起也如苦類智知苦諦時未來俗智上有法前得與現在苦類智俱時生得未來俗智俗智不生得非擇滅也通障即不染無知令斷此障問聖人勝進道離染欲界修即行修修佗心智凡夫六行道離欲染勝進道何故不行修答聖人無漏佗心智即作道四行相與道相應即行修凡夫有漏佗心智與斷道不同故不行修也。",
        "from": "X53n0839_003:0206b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "依此地者如初定近分離欲界染九無間道前八解脫道能修初定近分有漏功德得此者即離下染第九解脫道得根本定修此地根本近分有漏功德也謂離此者即依初定離三定染即能修三定下無漏得此者謂離下染得上地也問別離自染即修自下無漏者見道能離三界染如何不修三界無漏但言修自下答見道初得必不能修上地也無漏道依上地起能修自下以自在故也盡智能遍修以所繫縛法初得解脫所傳法氣通故能遍修約身在欲界說生上地不修下以弃捨故別法先曾得今再得不名修如退上界果作下果等名得不名修彼却得上果名得亦名修彼雖曾得以勝進故名修也別現若未創得此法此法上得初念名得如聞思現在但能自修不能修過未修慧現在能修三慧亦能修三世也。",
        "from": "X53n0839_003:0206c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十七　分別智品第七之二處非處者合道理為處不合道理為非處是所知境佛智能知名處非處之智力依主釋也正理論云一切皆是處非處攝名為難悟故折出餘九問處智即知非處何故別說非處答遮無因外道說知遮惡因外道說非處也業中善業感善是處善業感不善果即非處乃至真實作意漏盡名處與此相違非處中間七力皆准此釋。",
        "from": "X53n0839_003:0207a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "根目信等五根別爾斷善人無信等佛應不知答過去有信等或自意根有上下等或知無信等五根也性謂種性即三乘六性等所趣即三乘涅槃滿盡力知自亦知佗漏盡事也。",
        "from": "X53n0839_003:0207a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "後之三力在二乘身名通名明在佛身勝名力餘二通在佛無勝用不名力且天眼通見五趣善惡由此引殊勝智出亦正了知能感彼業名死生智力不別說佗心智力者以前根上下智力能知根亦知心心所也昔佛在世誓多門前有一人求度舍利子觀見此人八萬劫來未種順解分善此人求度不已佛見與度彼得獲果舍利子恠而問佛佛答曰我昔過去於那伽羅國共此國人持地欲請定光佛供養此人賣柴知有迎佛更取柴賣得錢擬供養佛至山被虫食欲命終時彼但云南無城中欲所迎者名種解脫分善又智度論說佛在祇洹經行有鷹逐鴿鴿飛向佛影中無怖後舍利子影至便作聲戰恐問佛佛言汝三毒習氣在故佛教舍利子入宿住智觀過去八萬劫外不知更教入死生智解未來八萬劫外亦不知常受鴿身舍利子白佛此鴿何時得脫佛言非二乘得知過去恒沙大劫作鴿身後輪轉五道得為人身經五百生世中乃得利根爾時有佛度無量眾生已入涅槃後於遺法中作五戒近事聞比丘讚佛乃初發心經三大劫方得作佛舍利子曰佛我於一鴿簡莫能知況於佛法所以二乘第八第九不得名力人種者先是人後作初或父母隨一是人一是非人也第三說身力無邊若不爾如何能任持是無邊心力也觸處婆沙有五說評家能造所造觸和合是為身體若不和合即身力劣有說重觸為體以有力者重故又有說澁觸為性以有力身澁故又有說能造四大為性四大平等即有力不平等即力劣又有說所造七觸外別有所造恒觸為性此論同第四第五說疏言所觸中大種差別同第五說也前輪王取銅銀輪王若金轉輪王與獨覺無別又言凡象即是西方凡常用者香象即戰時用。",
        "from": "X53n0839_003:0207a21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "依法者依佛正覺法立難沙門即四沙門梵志出家外道天魔即六欲天主梵等即梵眾等天也。",
        "from": "X53n0839_003:0207c03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "正等覺難者世尊正覺一切皆知比丘造罪佛既自知何要問彼又佛在室內問阿難外有雨等通云為令餘人於事審諦世尊大智尚問況餘人不問耶。",
        "from": "X53n0839_003:0207c05_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無由者由是因由有無畏難佛告正見故。",
        "from": "X53n0839_003:0207c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "漏求盡者愛語勢曰惡罵調達通云勢白如慧馬調達如惡馬須苦治故。",
        "from": "X53n0839_003:0207c09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "說障者如初二果人有妻子如何得聖果通云邪行障離欲第三果不障初二果斯有何失也。",
        "from": "X53n0839_003:0207c11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "說出苦道者如蓮華色尼何故被折眼精出舍利子消渴病羅云乞食不得等通云由有苦依是過去業未來必不受也或云是示現受苦令諸有情起出離心故也。",
        "from": "X53n0839_003:0207c13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無畏智為體者由有智故不怖懼佗故名無畏。",
        "from": "X53n0839_003:0207c17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "與力別者力降天魔無畏破外道體與力同與不屈伏為因名力與怯懼為因名無畏也謂顯如來三德滿故立四無畏第一無畏智德第二無畏斷德後二恩德問無畏得已以智為體畏應得以無智為體答智與眾多法為對治智能治疑疑不得以無智為體智能治於畏畏不得以無智為體智得與無畏為體為也問佛說法時眾生不教應無三念住即世尊說法應失根器答世尊說法欲令人解之人若不解即天解之人不解故念住有三天得解故無不應根器失諸大聲聞雖有三念住一以非斷習故二以非奇特故不立梵云喬答摩是剎帝利中一性舊云瞿曇訛也昔曾聞往昔剎帝利種被賊奪位父死其子仙人貪種將養後太史奏曰剎帝利有星出王教人捉得令鏘身示人後仙人至不見此子觀知此處便知不活遙勸小兒令起世情仙現化密雲為其掩障細雨霑灑繫令息苦飢現一女人以動其根小兒緣此泄精仙人收以牛糞褁之置甘蔗園內日光照觸團開生一小兒形容殊妙後長為王因此號為日種牛糞種地種也迦葉波婆羅門中一性身長千尺正法千年或七日也。",
        "from": "X53n0839_003:0207c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "煩惱斷得擇滅定障斷即二無知得非擇滅畢竟斷即前二不退也共德約名體同作用勝劣有殊。",
        "from": "X53n0839_003:0208a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "梵云阿蘭那行此云無淨行謂無覺得宿住智知過去生死由於自佗身起煩惱我於煩惱身上起煩惱尚招生死幾於我無煩惱身起煩惱即重明日欲於其處乞食等先發願願彼處有情明日莫於我身起諸煩惱便入勝定息定力詣彼彼煩惱不生也淨有三一蘊二言三煩惱即有迷事煩惱淨也。",
        "from": "X53n0839_003:0208a16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "問宿住智與願智何別佗心智知現在與知現在願智何別答宿住智知過去欲色有漏五蘊想緣不明願智知三界漏無漏五蘊四蘊想緣別緣分明佗心智現在佗身唯自相不明願智知自佗身共相分明也。",
        "from": "X53n0839_003:0208a22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四無礙解法詞等是境智於境中無礙無礙即解解即智也名召法勝故頌舉之具足知名句文三也若爾名等即義如何不名義答所詮勝義是名義名等緣多法故不名義也。",
        "from": "X53n0839_003:0208b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "詞二地法五地者詞二地據聲法五地通上三定據有緣名等智說有也。",
        "from": "X53n0839_003:0208b07_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法無礙解婆沙四說二評文說隨語二地一說隨身五身評取前說後二說一說欲色界一說通三界評取前說深法師會兩說三後評即是前評不可一論有二評文意即不評通無色界語業既唯二地名等亦然名等隨語二地若隨身五地也今取能緣義及辨等智故通九地四皆加行得以習佛語為加行所緣體性依地與無諍別餘與無諍同邊際定是因因定引此六生六是果此無淨等六依第四定成為六際此六定是流類如一頌四句為句之流類也能緣詞無礙解依第四定發詞體即欲界初定攝也。",
        "from": "X53n0839_003:0208b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "九品一遍為下下兩遍為下中乃至九遍為上上品也。",
        "from": "X53n0839_003:0208b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六通釋名者神據等持境即所化四二塵通即證智三法立名從定發通通能起化心化境名智證境也佗心即境通即證智加行立名宿住即過去五蘊是境隨念即心相應念通即是智若涅槃名漏盡漏盡即是所證通即能證智若漏盡身中起從所依及證智立名前五通凡得第六聖得以少從多總名共凡德也正理論云解脫道者顯初出障無壅名通勝進道亦有也宿住先觀此生十位次方觀中有初心即名加行滿以中有今生攝也。",
        "from": "X53n0839_003:0208b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "宿住境曾經事者未得淨居如何能憶答曾憶有二一見二聞淨居先聞也。",
        "from": "X53n0839_003:0208c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六通加行者神境思性天眼思色天耳思聲無色無此等用無五通也問天眼見色天眼通即死生智明死生智明如何知意等耶答謂天眼通能引有別勝智生能知意別等與天眼通合立死生智明天眼名死生智從果立名若死生智名天眼通即就因立名也問天眼通即死生智如何天眼通知現在死生智智知未來答據眷屬說天眼通眷屬緣未來或對宿住緣未來也死生智善天眼通無記者無記據根體及通體善即約眷屬說也問二識相應慧名通天眼天耳如何通四定發答約眼耳根說四定發也問何故六通立三為明答宿住緣過去死生緣未來漏盡忻涅槃故三有勝用故立為明復次宿住智明引空定死生智明引無願定漏盡智明引無想定故立三為明智證即明也。",
        "from": "X53n0839_003:0208c08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "容有是真者別以十智為體世俗是有漏佗心通漏無漏餘八智皆無漏故言容也。",
        "from": "X53n0839_003:0208c22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "示道者示即顯示真教導者導引令入正法神變現通令發心記心記破心中念善惡事令信此皆令發心教誡與說法名示導也。",
        "from": "X53n0839_003:0208c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "健馱梨真諦云有女天名健馱梨從所說人為名或是國名此國出此也伊利尼是論名路刑外道造論有此呪從出處為名也。",
        "from": "X53n0839_003:0209a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "行三意勢佛運身勝解此三是即質化如馬勝往上界化色觸二塵為所依地及籠此身梵王來欲界化四塵為所依地及籠此身下界方得見也問舉意即至者如前文度一極微名一念如何遠方能即至答正理論云如日舒光即能頓至若不爾者中間斷絕行義不成舉心即現大身至彼如無邊身菩薩等運身勝解通二乘凡夫四二外處性此八化說離質問身在色界作欲界化化香味不又身在欲界作色界化化幾塵答婆沙說色界作欲界化化香味不若化不有成就香味失答無成就失化而不成就不與五根合如身外眾服等一說不化前文說即質化亦准此說小乘唯不能化前人為畜等也。",
        "from": "X53n0839_003:0209a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "化作化事為即是通者化所化事之能化心即是通不也。",
        "from": "X53n0839_003:0209a18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "能化心從神境通生者此說解脫道出障是通體能化心從神境通生與通為果所化事近與化心為果遠且與通為果若言神通通即慧神即是定若言通果心無障名通即是慧與定為果通即是果通果之心也問第二定作欲界化心與初定作化心何勝何劣答若約地即初定化心勝欲界化心劣雖依二定以化心屬欲界故若約所依定即欲界化心勝以依第二定故也以化心不化聲別有發語心生二定發語起初定心在定即能起初定化心發語二乘凡夫定未自在語等不得不同及前後也迦葉大乘言入滅定此論言死後至慈尊再現十八變是本願故也若化人化飲食即在化主身中消若權略道食金石等即化事身中消或置在餘處也。",
        "from": "X53n0839_003:0209a20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "修得者謂四本定地淨色為體由彼入定引得淨色依此二根能發二識能見聞遠色聲等也。",
        "from": "X53n0839_003:0209b09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "肉眼見近不見遠天眼遠近皆見肉眼有同分彼同分天眼唯同分肉眼見前不見後及不見左右天眼前後左右皆見肉眼見障內不見障外天眼內外皆見肉眼見麤不見細天眼二皆見肉眼見晝不見夜天眼晝夜皆見肉眼見明不見暗天眼明暗皆見肉眼有翳缺天眼皆無也六欲天等即是生得天眼天眼若修得者天即是眼若生得之眼若中有等似天眼即有財釋耳三釋亦爾也。",
        "from": "X53n0839_003:0209b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十八　分別定品第八之一此品疏文分二一釋名二分文解釋。",
        "from": "X53n0839_003:0209b19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "梵云禪那此云靜慮來意者定是發慧之緣次有定品已說諸智結前諸智差別所成功德結前十力等後文令同念心心所不散於一境傳名一境性性即定也經部心王上假建立定離心王外別立受想行三破云受等能領納離心外別有受等體定能令心一境性何妨離心外別有定體也入無想定前心心所熏色上成心心所種子若生無色界於修定時熏心心所上成色種子若欲色二界色心二皆能持種三性心名別自持破云入不善心時善色種何心持也有部約取果一切法至現在即有取後果之力此在欲色界臨命終時色已有取無色最後色果也正理論云此空與色俱時而有起勝解想思惟彼空然虗空體雖與色俱時色想無空方得顯根本成位具緣五蘊法從加行位立無色名厭前外空起勝解想思內六識身乃至一切皆作識餘根本亦緣五蘊空識行相既多麤動捨空識行相寂然而住名無所有處也問何故四無色名處答是受生處又謂外道執彼為涅槃今謂破彼立為受生處也正理論云定與愛相應名味助伴五蘊性餘惑與定相應不名味者答此愛與定專注一所緣故定得味名餘惑散動不得此名前念淨定生後念愛定前念淨定中有順退分定及順住中一分順退能生後念味定餘淨定不生味定也有部定是體亦是體亦是支餘四助定具支能依非定也支者顯成義五支顯初定乃至四支顯第四定等也或隨順義各隨順義各隨順當地定也或資助義具五支資初生等也四句者有初定支非二定支尋伺有二定支非初定支內淨有初定支亦二定支喜樂第四句可知問如第三定超入空處空處應具支答初習定者要具支方能起後成就則易不假支等能起也。",
        "from": "X53n0839_003:0209b21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "輕謂輕利安即安適與相應心作適悅因初二在定無五識樂也七十五法四地受皆立支五支中明四地受名即別今據五受說也婆沙八十約七十五法癈立文繁不述經部說第二定離初定尋伺即有內淨等持即心差別更無別體難斷難破世間道難可越度解脫道也。",
        "from": "X53n0839_003:0210a03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "亦可離中者初離欲染得初定味著為定空竟後得第二定初定同欲界亦信可離故有內淨。",
        "from": "X53n0839_003:0210a09_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "離外均流者初定有三識餘緣外境二定離此名離外均流故有內淨上座部說初二定喜不是喜受三定樂受皆喜受故也。",
        "from": "X53n0839_003:0210a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "非離煩惱而得生故者由定與煩惱相應生名非離煩惱而定得生入第四定能照萬物寂靜無灾患動如密室燈能照萬物燈焰不動也。",
        "from": "X53n0839_003:0210a14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "但不是彼地繫者借三識及尋伺起下地心借無記性雜心論主達磨多羅異熟不許異地起功巧不通上地通果即意識起此三識威儀無記光法師借身識威儀眼耳二識通威儀通果尋伺亦威儀也寶法師云四無記攝色不盡攝心亦不盡借自性無記威儀無聲如何耳識得是威儀故知自性無記也。",
        "from": "X53n0839_003:0210a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "初定無漏無間生初二三定各淨無漏淨生染定是淨定生退分無學生染者即順住中一分順生染染生不淨即妨定退心也。",
        "from": "X53n0839_003:0210a23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "味生淨一說生順住分一說生勝進分皆無評文。",
        "from": "X53n0839_003:0210b02_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "死淨生一切者善及無覆無記皆名淨不善有覆名染也正理論云無色根本善極寂靜故無邊緣智不緣下有漏無為及法智品道又言無色超越色相色界不言超越故知色界有緣下法智品道四無色非我行相但緣上四空不緣下界也。",
        "from": "X53n0839_003:0210b03_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "有漏雖作十六行相不斷自地染者有漏學未得明利如來得師子王不能害獸等也八近分未離下地染未得喜樂相應心也。",
        "from": "X53n0839_003:0210b08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "上七近分無無漏者於自地煩惱不厭背故初定近分有無漏道者以治自地及下界有灾患界故。",
        "from": "X53n0839_003:0210b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無味定者近分是離染道味定離染時不起有不是離染道者亦是離染道之流類也異說未曾得根本亦味色分也。",
        "from": "X53n0839_003:0210b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "問何故初定近分名未至餘即非耶答正理七十八云欲簡餘近分故此初近分不從定引生又味此故得未至名餘近分從下定引生又不味彼不得此名即是根本功德未現行義中間具味等三定以別是一生處故在有尋伺上無尋伺下約定者名中間也梵云三摩地此云等持通三性定散地唯是有心等者是定定體平等及能持心等即是持持業釋或等者是引定前心平等引定生持即是定即等之持依主釋梵云三摩鉢底此云等至通善染唯定通有心無心等者引也是定前心引至定位依主得名別定名等持業得名梵云三摩[口*皿]多此云等引唯是定及有心等者定也引者從定引生四無量等惑等者定前心平等引至定位依主釋後一唯善性婆沙云十三等持等至四句分別智有等至非等持二無心定有等持非等至謂不定心相應等持第三句有心定第四句可知由得空故蘊不是我破即蘊我蘊中無我我所即蘊是空破離蘊我也苦集有漏可捨離道諦雖無漏如船筏可捨故對治我我所是空意樂樂證涅槃是無想意樂樂捨有為是無願意樂空非我雖是有為不名無願者以似涅槃故不捨也有漏空緣一切法別無漏空緣非我涅槃名解脫此三能與為入門也先以空定空五蘊煩惱等空相既多順厭捨起有漏空等三等持思惟前空相亦可捨離不取前非我等行相空取於空名空空空之空故見五蘊中空即不生貪著見五蘊無我不生厭捨不及空相故取空相也。",
        "from": "X53n0839_003:0210b16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "非常與無願相應等持觀前聖道為非常厭捨也重無相但觀前無相相應聖道上非擇滅為靜相前聖道觀擇滅為無相今此無相當情亦可厭捨起有漏定觀前無相相應聖道為無相重名無相不是擇滅名可捨也別無漏即生欣心不能生厭故重空等三定不作無漏等持也時解脫欣聖道不能厭捨不能作重空等三上七近分無者無勝功德別此重空欲界攝者未至聖道後起有頂地攝者無所有處聖道後赴有漏重空等三謂此二地無聖道故餘九地聖道自地聖道後生也此皆是起智離染後方便後更加行方現在前佛無加行現前欲界恩德攝上二界修慧攝此三等持從法類苦滅四智後生若欲界不從類智後生若上二界不從法智後生空無願不從滅智後生無想不從苦智後生也。",
        "from": "X53n0839_003:0210c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "但說住現法樂不說住後法樂者後樂不定生故或後容退或入涅槃現樂即定也或現即是後所依既言現所依必有後樂能依也。",
        "from": "X53n0839_003:0211a08_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六通中修二者天眼通觀生死漏盡得涅槃故偏說修也。",
        "from": "X53n0839_003:0211a11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "　　●論本第二十九　分別定品第八之二婆沙八十一有二說一云治無量煩惱二二無量諸賢聖廣遊戲處也欲煞有情心名嗔欲害有情心名害躭著境界永不修善品名不欣慰於妙欲境界起染著情無厭名貪也問不淨觀治貪與此捨何別答貪有二一色境二婬欲不淨治色捨治婬欲論主釋不淨治婬欲捨治親友等貪也悲治嗔即無嗔為體前說非治害者據真家等流果傍治說也慈悲同以無嗔為體二想別者無嗔治煞有情忻行相轉不害治害有情感行相轉是二別也論主言不害為悲體者前說無瞋者不害似無瞋以無瞋名說婆沙二說一說喜根為體一說心所忻為體無評家此論同初說破後說云以喜與忻名義全別如何以忻為喜體也頌說捨能對治貪據正對治長行論兼治嗔者據傍治說慈能治嗔者治嗔所引嗔捨治嗔治貪所引嗔是二別也問捨以無貪為體能治貪所引嗔慈以無嗔為體應治嗔所引貪答捨以親非親皆捨捨能兼治嗔慈能治嗔不生後嗔貪與樂不治貪也問慈與樂即是悲拔苦何須別立慈悲二種答雖有與樂而未拔苦雖有拔苦而未與樂故二別說也雖作與樂等行相彼不得樂以意樂無顛倒故大乘真實與樂如變大地為金銀攬海水為蘇酪等也。",
        "from": "X53n0839_003:0211a13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一無苦無樂者與示即慈二有苦即三惡道全人趣少分拔苦即悲三若有樂者助喜即喜初癡隨增離癡相次苦離嗔相次樂離貪相次欲令離諸惡故名捨無量也問下三定有喜樂歡行轉三地起悲即慼行轉如何悲得與下三定相應答如無漏是厭行相轉依下三定是歡行轉既得相應悲亦爾也若煩惱薄者上怨與上親頓能平等與上樂拔苦等若煩惱增者慈皆即與樂拔苦等各分三品一切有情分為七品慈悲喜皆於親與上樂乃至第七遍上怨與上親等捨即先處中次怨三品後親三品先下親次中後上也。",
        "from": "X53n0839_003:0211b11_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此四次第謂歡行者隨樂先起也。",
        "from": "X53n0839_003:0211b22_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此四凡夫亦能起以無煩惱重者歡行者身中證得名身作證得住此定名具足住也。",
        "from": "X53n0839_003:0211b23_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "弃背是解脫義初二定根本及近分中間並背捨欲界貪心第三背捨不淨觀心次四背捨下地貪心第八背捨一切所緣心也。",
        "from": "X53n0839_003:0211c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "欲初定有顯形色貪者由眼識引生也欲界雖有初二解脫不立者以自煩惱所陵雜故不立也三四定中雖有治初二解脫貪以遠故不立第二定無眼識緣欲界色生貪故第三定不立解脫也又第三定有樂轉故不立解脫也解脫為因勝處為果初二解脫取想相不淨第三總相取淨不能別觀此能別觀緣一身名所緣少緣多身名所緣多多少自在也依地自性如解脫說此於境中取境轉變多少自在不起於惑名制心名心勝境處也勝處不能分能造所造遍處分能造所造別觀皆遍一切處也世界壞時定既法爾得煩惱法爾先斷方得生上無有不斷下界地煩惱得生上地也。",
        "from": "X53n0839_003:0211c04_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "因教有證先教後證正法有教證及戒像中無證末中及無戒唯教法也一說教證二法千年一說教法通千年外此論同涅槃經二十二若我弟子持說者教住修行者證法住也。",
        "from": "X53n0839_003:0211c16_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此論依攝者此牒前攝彼勝義依彼故也。",
        "from": "X53n0839_003:0211c20_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "寶法師大師世眼久已閉下是流通分依前科定品文及初科文後三行頌是流通分此疏科文錯也。",
        "from": "X53n0839_003:0211c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "俱舍論釋頌疏義鈔下末(終)",
        "from": "X53n0839_003:0211c24_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此本者南都於東大寺大喜院搭中以清涼院本校合并點加畢慶安四年(辛卯)仲冬吉日",
        "from": "X53n0839_003:0212a01_0",
        "context_with_next_sentence": false
    }
]