[
    {
        "source_sentence": "西方合論卷之四",
        "from": "X61n1165_004:0796b12_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "第四教相門",
        "from": "X61n1165_004:0796b14_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "夫一大藏教如器街空空無相體器有方圓器盡空除緣亡教滅是故隨緣普應則涅槃真如一器也稱智自在則名相專持一空也藥無定方定方以病豈謂玉屑珊瑚無上妙藥槩以治四百四病哉夫病除藥貴便溺即是醍醐異證同方參苓化為酖毒何況無上醫王治三乘出世之藥療人天聲聞凡夫等瘡者哉故先德約教或一或多名相雖別理趣是同道人不揣固陋竊附先哲分別諸句用彰一乘庶使觀者知淨土法門攝一代時教毋為儱侗禪宗輕狂義虎所誑惑云爾。",
        "from": "X61n1165_004:0796b15_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一純有教二趨寂教三有餘教(上三教分攝)四無餘教五頓悟教六圓極教(上三教全攝)一純有教者為諸凡夫耽著愛染造諸黑業如來悲憫為說地獄苦餓鬼苦畜生苦無福德著我所苦欲生人天當修善根如佛初成道為提謂說世間因果五百賈人同受五戒先懺悔五逆十惡謗法等罪是為有教觀經脩三福中首言孝養父母奉事師長慈心不殺脩十善業又無量壽經極言五惡五痛五燒之苦教化羣生令持五善亦攝此義然是經為求往生遮諸不善非是忻心人天小果修持是同證果即別如楞嚴華嚴諸方等雖不單說亦兼帶之(亦說戒惡修善)不名純有觀經鈔曰圓頓行者豈違小乘出家之式三歸眾戒威儀等事又曰得前前者不得後後得後後者必得前前何以故一切諸佛無不以十善而得度故華嚴經曰十不善業道是地獄畜生餓鬼受生之因十善業道是人天乃至有頂處受生之因又此上品十善業道以智慧修習心狹劣故怖三界故闕大悲故從他聞聲而了解故成聲聞乘又此上品十善業道修治清淨不從他教自覺悟故大悲方便不具足故悟解甚深因緣法故成獨覺乘又此上品十善業道修治清淨心廣無量故具足悲愍故方便所攝故發生大願故不捨眾生故希求諸佛大智故淨治菩薩諸地故淨修一切諸度故成菩薩廣大行又此上上十善業道一切種清淨故乃至證十方無畏故一切佛法皆得成就是故我今等行(平等行也)十善應令一切具足清淨乃至菩薩如是積集善根成就善根增長善根思惟善根繫念善根分別善根愛樂善根修習善根安住善根菩薩摩訶薩如是積集諸善根已以此善根所得依果(依報與證果)修菩薩行於念念中見無量佛如其所應承事供養又云雖無所作而恒住善根又云雖知諸法無有所依而說依善法而得出離奉勸悟達之士猛省永嘉豁達之言早尋白社不請之友勿輕戒律天上無作業之佛勿貪虗名地下有對證之鬼蓮邦不遠請即加鞭。",
        "from": "X61n1165_004:0796c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二趨寂教者即二乘寂滅之教趨向涅槃於嚴土利他不生喜樂是為小乘與淨土大乘之教正反今云分攝者以無量壽經及觀經中皆有須陀洹乃至得阿羅漢果故先德(指天台)云小乘不生據決定性不生此中(指上二經)明生為在此間(世間)先發大乘心熏成種子退心下地(退居小乘)要由垂終回小向大故生問曰既回心向大何故至彼復證小果釋曰以退大既久習小功深是故彼佛稱習說小且令證果又此證小果者不守小位而住還起大心進行彌速或五劫或十劫得成初地如是階級猶是殊勝是故不同又云經中亦有頻婆證阿那含然非此教正所被機今從正為韋提希等宣淨土觀尚非通別(通教別教)豈是小乘如迦支出世亦有聲聞畢竟大乘是正以羊鹿等車非實車故。",
        "from": "X61n1165_004:0797a17_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三有餘(未盡之談)教者了二空真理修習萬行趣大乘佛果唯不許闡提二乘成佛謂闡提無性二乘定性決不可成未盡大乘真理故名有餘此經言除五逆不生又云二乘種不生教義似同二乘上已釋竟言五逆不生者以謗法故以無信心非是無性決不可成故觀經中毀戒眾生臨終惡相見者聞讚佛功德地獄猛火化清涼風乃至五逆十惡具足十念者見金蓮華猶如日輪一剎那頃皆得往生此是自性不思議功德仗不思議佛力得顯現故若不具足佛性如頑石濁滓豈能透月當知念能顯性如是往生是性力故如日能顯空空非因日是故一切眾生皆成佛故不同始教有餘之教。",
        "from": "X61n1165_004:0797b06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四無餘教者一切眾生平等一性悉當成佛是為大乘極則之教唯一自心為教體故云無餘(此下言淨土全是無餘教義)今此淨土法門依正信願等法究極皆歸一心故經中言一心不亂即得往生又大本三輩生彼者皆云發無上菩提之心菩提心者即佛性是華嚴經曰菩提心者猶如種子能生一切諸佛法故猶如良田能長眾生白淨法故猶如大地能持一切世間故猶如淨水能洗一切煩惱垢故猶如大風普于世間無所礙故猶如盛火能燒一切諸見薪故廣往彼經當知菩提心是鐵砲中利藥念佛是藥線華嚴初發心時便成正覺即是此義菩薩五位加行亦只是藥中引線耳無量妙行詎有加一行三昧之外者哉。",
        "from": "X61n1165_004:0797b18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五頓悟教者長者論曰但一念不生即名為佛不從地位漸次而說故立為頓教如思益經得諸法正性者不從一地至一地楞伽經曰十地則為初初則為八地乃至無所有何次當知頓者即是不歷階級之義(以下言淨土全是頓悟教義)天台觀經疏曰頓悟漸入此即頓教正為韋提希及諸侍女並是凡夫未證小果故知是頓不從漸入鈔曰今經頓者乃于化法(教化人之法)以圓為頓何故無生忍位別在初地圓在初住別教凡夫經無數劫方至此位唯有圓教即生可入今就韋提希即身得忍判為頓者是圓頓故又他經說受菩薩戒身身相續戒行不缺經一劫二劫三劫始至初發心住如是修行十波羅蜜等無量行願相續不斷滿一萬劫至第六正性住徒是修行增進始至第七不退住今此經中五逆十惡持名即生皆得不退正合頓義如觀經中是心作佛是心是佛等語皆直指心宗更無迂迴且如阿彌一聲是非俱剗何等直截故古人謂之頭則公案鑊湯波底豈貯寒氷烈火燄中詎容寸草達磨復起不易吾說更或踟蹰萬里千年。",
        "from": "X61n1165_004:0797c06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六圓極教者慈恩通贊曰此方先德總判經論有四宗一立性宗二破性宗三破相宗四顯實宗涅槃法華華嚴等是顯于真實中道義捨化城而歸寶所故知彌陀經乃第四宗也又以教准宗(教中分列宗旨)宗有其八一我法俱有宗二有法無我宗三法無去來宗四現通假實宗五俗妄真實宗(俗屬妄真屬實)六諸法但名宗七勝義皆空宗八應理圓實宗如華嚴及彌陀經是第八宗收又若真歇了禪師等以帝網千珠發明淨土圓融之義諸書具載近有老宿以華嚴配此經謂圓全攝此此分攝圓得圓少分分屬圓故據經判義甚有旨趣但圓極義者無全無分如月在川川川皆有全月乃至瓶池寸水亦是全月無分月故如風在樹樹樹皆有全風乃至片葉莖草亦是全風無分風故若圓中有分者圓即有段若分中非全者圓即不徧分全雙乖圓義不成今約蓮宗圓極分五種義一剎海相含義二三世一時義三無情作佛義四依正無礙義五充徧不動義一剎海相含義者一切諸佛報化國土互相攝入全他全此而無留礙若計不相入者此即情見情見非實如一室中含一虗空其中若人若畜若鬼若虫若几若瓶若架之類皆依虗空建立虗空屬人時則諸鬼畜虫几瓶架所依之虗空一切攝入人中虗空屬鬼時則諸人畜虫几瓶架所依之虗空一切攝入鬼中虗空屬虫時諸人鬼畜几瓶架所依之虗空一切攝入虫中乃至虛空屬架時則諸人畜鬼虫几瓶所依之虗空一切攝入架中參而不雜離亦不分非入非不入是故經云國土光淨遍無與等徹照無量無數不可思議世界如明鏡中現其形像當知淨方濁土交光相入如千燈一室故二三世一時義者眾生情見執有時分過現未來等事約實相中即無時體可得何以故若計晦明是時者晦明則是業相如病眼見眚非定相故若計老少是時者老少則是幻質如敝網褁風非定質故云何是中而有實義今約延促相入二義以明時體一促中有延二延中有促一促中有延者如人假寐夢經種種城邑聚落及見故人悲笑分明經歷時月醒而問人熟睡幾時侍者答言數千錢時其人自思假寐無幾云何經歷如許變態了了記憶非病非醉展轉追惟是義終不可得二延中有促者如人二十忽得顛病吞刀捉火或為人言未來事或對妻子嬉笑如常及生男女或忽能文著種種書經三十年遇一異人呪水與飲其人如睡忽覺即以二十為昨日事家人屈指為計歲月出示子女及種種書其人自思本無歲月焉有是事亦不復記病與不病以是二喻進退互觀畢竟無有三世可得是故經云觀彼久遠猶若今日經須臾間歷事諸佛遍十方界是謂三世無間三世無間者時體不可得故三無情作佛義者權教中言有情有佛性無情無佛性一切草木器界不能成道及轉法輪此是執情強計屬意即有屬物即無不了諸法皆住法位何以故意是色故是空根故是往古來今故是無情故一無一切無故青黃是意故風鳴谷响是意故草木瓦礫是意故是有情故一有一切有故故知情之為情亦可說自亦可說物不應說言誰無誰有如一夫妻共生一子不應說言誰生誰不生夫髮毛爪齒亦是無情與我俱佛邪抑與我不俱佛邪夢中見山見水見木見石亦是無情是情想攝邪抑非情想攝邪當知是中尚無是我非我云何更計有情無情是故經中道場寶樹能淨諸根風枝水晌咸宣妙法無一物非佛身無一物不轉法輪豈是情見妄知所能計度四依正無礙義者依是器界正是身根若約凡情即橫計有依有正是義非實何以故若言虛空是依者如人張口則虗空入乃至毛孔骨節心腹之內皆有虗空是依邪是正邪若言地水火風是依者如人涎液入器為水髮焦為土兩手相觸成火噓氣為風是依邪是正邪是故經中無量寶華一一華中出三十六億那由他百千光明一一光明出三十六億那由他百千佛普為十方說一切法以佛力故現有寶華以寶華故復現諸佛是故當知盡一剎是佛身剎剎皆然無一身非佛剎身身皆然非是佛神力變現唯一真法界智為依正故五充徧不動義者眾生妄計佛身即有去來而實佛身無去無來亦無不去不來辟如鳥飛空中一日千里空非隨鳥鳥不離空是故經言阿彌陀佛常在西方又言至一切行人之所如涅槃經佛言善男子波羅柰城有優婆夷已于過去無量光佛種諸善根是優婆夷夏九十日請命眾僧奉施醫藥是時眾中有一比丘身嬰重病良醫診之當須肉藥若不得肉病將不全時優婆夷尋自取刀割其髀肉切以為[榷木+月]送病比丘比丘服已病即得差是優婆夷患瘡苦惱不能堪忍即發聲言南無佛陀南無佛陀我于爾時在舍衛城聞其音聲於是女人起大慈心是女尋見我持良藥塗其瘡上還合如本我即為其說種種法聞法歡喜發阿耨多羅三藐三菩提心善男子我于爾時實不往至波羅柰城持藥塗是優婆夷瘡當知皆是慈善根力令彼女人見如是事復次善男子調達惡人貪不知足多服酥故頭痛腹滿受大苦惱發如是言南無佛陀南無佛陀我時住在優禪尼城聞其音聲即生慈心爾時調達尋便見我往至其所手摩鹽湯而令服之服已平復善男子我實不往調達所摩其頭腹授湯令服當知皆是慈善根力令調達見如是事復次善男子憍薩羅國有五百賊群黨抄掠波斯匿王遣兵伺捕得已挑目逐著黑闇叢林之下受大苦惱各作是言南無佛陀南無佛陀啼哭號咷我時往在祇桓精舍聞其音聲即生慈心時有涼風吹香山中種種香藥滿其眼眶尋還得眼如本不異諸賊開眼即見如來住立其前而為說法賊聞法已發阿耨多羅三藐三菩提心善男子我于爾時實不作風吹香山中種種香藥住其人前而為說法當知皆是慈善根力令彼羣賊見如是事如上之法豈容思議總之皆是一真法界不得言是自心感見亦不得言心佛和合以佛地中離自離他離和合故是故入此門者莫同凡夫情見分別計度如清涼云阿彌陀佛即本師盧舍那猶屬情量何以故十方世界惟一智境無別佛故。",
        "from": "X61n1165_004:0798a06_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "(問論中所引涅槃經言慈善根力或者如來法性無人我遠邇眾生受苦皆如來性中境相邪答此止說得正因佛性然論正因寧獨如來雖眾生之性亦爾但眾生為業所障於他人受苦縱親詣彼所尚不克救況不徃而獲免耶教中言八地以上菩薩一呼其名即蒙利益以分別業盡法爾如然故杜順和尚一履懸門十年無人竊去自云多生不作盜業故得如是報宋人有鄒囊陀者人一見其面輙得禍近時有其妃子貧甚凡手所觸物尋即廢去不能自存此非多生業力之故與佛善根力合得如是報無足怪者)。",
        "from": "X61n1165_004:0799b13_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "西方合論卷之四",
        "from": "X61n1165_004:0799b19_0",
        "context_with_next_sentence": false
    }
]