{
    "T05n0220_033:0181c11_0": "大般若波羅蜜多經卷第三十三",
    "T05n0220_033:0181c13_0": "三藏法師玄奘奉　詔譯",
    "T05n0220_033:0181c14_0": "初分教誡教授品第七之二十三",
    "T05n0220_033:0181c15_0": "「善現！",
    "T05n0220_033:0181c15_1": "汝復觀何義言：即佛十力若有願若無願增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有願若無願增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0181c18_2": "「世尊！",
    "T05n0220_033:0181c18_3": "若佛十力有願無願，若四無所畏、四無礙解、十八佛不共法有願無願，尚畢竟不可得，性非有故，況有佛十力有願無願增語及四無所畏、四無礙解、十八佛不共法有願無願增語！",
    "T05n0220_033:0181c22_4": "此增語既非有，如何可言：即佛十力若有願若無願增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有願若無願增語是菩薩摩訶薩？」",
    "T05n0220_033:0181c25_5": "「善現！",
    "T05n0220_033:0181c25_6": "汝復觀何義言：即佛十力若寂靜若不寂靜增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若寂靜若不寂靜增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0181c29_7": "「世尊！",
    "T05n0220_033:0181c29_8": "若佛十力寂靜不寂靜，若四無所畏、四無礙解、十八佛不共法寂靜不寂靜，尚畢竟不可得，性非有故，況有佛十力寂靜不寂靜增語及四無所畏、四無礙解、十八佛不共法寂靜不寂靜增語！",
    "T05n0220_033:0182a04_9": "此增語既非有，如何可言：即佛十力若寂靜若不寂靜增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若寂靜若不寂靜增語是菩薩摩訶薩？」",
    "T05n0220_033:0182a07_10": "「善現！",
    "T05n0220_033:0182a08_11": "汝復觀何義言：即佛十力若遠離若不遠離增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若遠離若不遠離增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182a11_12": "「世尊！",
    "T05n0220_033:0182a11_13": "若佛十力遠離不遠離，若四無所畏、四無礙解、十八佛不共法遠離不遠離，尚畢竟不可得，性非有故，況有佛十力遠離不遠離增語及四無所畏、四無礙解、十八佛不共法遠離不遠離增語！",
    "T05n0220_033:0182a15_14": "此增語既非有，如何可言：即佛十力若遠離若不遠離增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若遠離若不遠離增語是菩薩摩訶薩？」",
    "T05n0220_033:0182a19_15": "「善現！",
    "T05n0220_033:0182a19_16": "汝復觀何義言：即佛十力若有為若無為增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有為若無為增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182a22_17": "「世尊！",
    "T05n0220_033:0182a22_18": "若佛十力有為無為，若四無所畏、四無礙解、十八佛不共法有為無為，尚畢竟不可得，性非有故，況有佛十力有為無為增語及四無所畏、四無礙解、十八佛不共法有為無為增語！",
    "T05n0220_033:0182a26_19": "此增語既非有，如何可言：即佛十力若有為若無為增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有為若無為增語是菩薩摩訶薩？」",
    "T05n0220_033:0182a29_20": "「善現！",
    "T05n0220_033:0182a29_21": "汝復觀何義言：即佛十力若有漏若無漏增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有漏若無漏增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182b04_22": "「世尊！",
    "T05n0220_033:0182b04_23": "若佛十力有漏無漏，若四無所畏、四無礙解、十八佛不共法有漏無漏，尚畢竟不可得，性非有故，況有佛十力有漏無漏增語及四無所畏、四無礙解、十八佛不共法有漏無漏增語！",
    "T05n0220_033:0182b08_24": "此增語既非有，如何可言：即佛十力若有漏若無漏增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有漏若無漏增語是菩薩摩訶薩？」",
    "T05n0220_033:0182b11_25": "「善現！",
    "T05n0220_033:0182b11_26": "汝復觀何義言：即佛十力若生若滅增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若生若滅增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182b14_27": "「世尊！",
    "T05n0220_033:0182b14_28": "若佛十力生滅，若四無所畏、四無礙解、十八佛不共法生滅，尚畢竟不可得，性非有故，況有佛十力生滅增語及四無所畏、四無礙解、十八佛不共法生滅增語！",
    "T05n0220_033:0182b18_29": "此增語既非有，如何可言：即佛十力若生若滅增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若生若滅增語是菩薩摩訶薩？」",
    "T05n0220_033:0182b21_30": "「善現！",
    "T05n0220_033:0182b21_31": "汝復觀何義言：即佛十力若善若非善增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若善若非善增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182b24_32": "「世尊！",
    "T05n0220_033:0182b24_33": "若佛十力善非善，若四無所畏、四無礙解、十八佛不共法善非善，尚畢竟不可得，性非有故，況有佛十力善非善增語及四無所畏、四無礙解、十八佛不共法善非善增語！",
    "T05n0220_033:0182b28_34": "此增語既非有，如何可言：即佛十力若善若非善增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若善若非善增語是菩薩摩訶薩？」",
    "T05n0220_033:0182c02_35": "「善現！",
    "T05n0220_033:0182c02_36": "汝復觀何義言：即佛十力若有罪若無罪增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有罪若無罪增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182c06_37": "「世尊！",
    "T05n0220_033:0182c06_38": "若佛十力有罪無罪，若四無所畏、四無礙解、十八佛不共法有罪無罪，尚畢竟不可得，性非有故，況有佛十力有罪無罪增語及四無所畏、四無礙解、十八佛不共法有罪無罪增語！",
    "T05n0220_033:0182c10_39": "此增語既非有，如何可言：即佛十力若有罪若無罪增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有罪若無罪增語是菩薩摩訶薩？」",
    "T05n0220_033:0182c13_40": "「善現！",
    "T05n0220_033:0182c13_41": "汝復觀何義言：即佛十力若有煩惱若無煩惱增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有煩惱若無煩惱增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182c17_42": "「世尊！",
    "T05n0220_033:0182c17_43": "若佛十力有煩惱無煩惱，若四無所畏、四無礙解、十八佛不共法有煩惱無煩惱，尚畢竟不可得，性非有故，況有佛十力有煩惱無煩惱增語及四無所畏、四無礙解、十八佛不共法有煩惱無煩惱增語！",
    "T05n0220_033:0182c21_44": "此增語既非有，如何可言：即佛十力若有煩惱若無煩惱增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若有煩惱若無煩惱增語是菩薩摩訶薩？」",
    "T05n0220_033:0182c25_45": "「善現！",
    "T05n0220_033:0182c25_46": "汝復觀何義言：即佛十力若世間若出世間增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若世間若出世間增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0182c28_47": "「世尊！",
    "T05n0220_033:0182c28_48": "若佛十力世間出世間，若四無所畏、四無礙解、十八佛不共法世間出世間，尚畢竟不可得，性非有故，況有佛十力世間出世間增語及四無所畏、四無礙解、十八佛不共法世間出世間增語！",
    "T05n0220_033:0183a04_49": "此增語既非有，如何可言：即佛十力若世間若出世間增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若世間若出世間增語是菩薩摩訶薩？」",
    "T05n0220_033:0183a07_50": "「善現！",
    "T05n0220_033:0183a07_51": "汝復觀何義言：即佛十力若雜染若清淨增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若雜染若清淨增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183a10_52": "「世尊！",
    "T05n0220_033:0183a10_53": "若佛十力雜染清淨，若四無所畏、四無礙解、十八佛不共法雜染清淨，尚畢竟不可得，性非有故，況有佛十力雜染清淨增語及四無所畏、四無礙解、十八佛不共法雜染清淨增語！",
    "T05n0220_033:0183a15_0": "此增語既非有，如何可言：即佛十力若雜染若清淨增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若雜染若清淨增語是菩薩摩訶薩？」",
    "T05n0220_033:0183a18_1": "「善現！",
    "T05n0220_033:0183a18_2": "汝復觀何義言：即佛十力若屬生死若屬涅槃增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若屬生死若屬涅槃增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183a21_3": "「世尊！",
    "T05n0220_033:0183a21_4": "若佛十力屬生死屬涅槃，若四無所畏、四無礙解、十八佛不共法屬生死屬涅槃，尚畢竟不可得，性非有故，況有佛十力屬生死屬涅槃增語及四無所畏、四無礙解、十八佛不共法屬生死屬涅槃增語！",
    "T05n0220_033:0183a26_5": "此增語既非有，如何可言：即佛十力若屬生死若屬涅槃增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若屬生死若屬涅槃增語是菩薩摩訶薩？」",
    "T05n0220_033:0183a29_6": "「善現！",
    "T05n0220_033:0183b01_0": "汝復觀何義言：即佛十力若在內若在外若在兩間增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若在內若在外若在兩間增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183b04_1": "「世尊！",
    "T05n0220_033:0183b04_2": "若佛十力在內在外在兩間，若四無所畏、四無礙解、十八佛不共法在內在外在兩間，尚畢竟不可得，性非有故，況有佛十力在內在外在兩間增語及四無所畏、四無礙解、十八佛不共法在內在外在兩間增語！",
    "T05n0220_033:0183b09_3": "此增語既非有，如何可言：即佛十力若在內若在外若在兩間增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若在內若在外若在兩間增語是菩薩摩訶薩？」",
    "T05n0220_033:0183b13_4": "「善現！",
    "T05n0220_033:0183b13_5": "汝復觀何義言：即佛十力若可得若不可得增語非菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若可得若不可得增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183b16_6": "「世尊！",
    "T05n0220_033:0183b16_7": "若佛十力可得不可得，若四無所畏、四無礙解、十八佛不共法可得不可得，尚畢竟不可得，性非有故，況有佛十力可得不可得增語及四無所畏、四無礙解、十八佛不共法可得不可得增語！",
    "T05n0220_033:0183b20_8": "此增語既非有，如何可言：即佛十力若可得若不可得增語是菩薩摩訶薩，即四無所畏、四無礙解、十八佛不共法若可得若不可得增語是菩薩摩訶薩？」",
    "T05n0220_033:0183b24_9": "「復次，善現！",
    "T05n0220_033:0183b24_10": "汝觀何義言：即大慈增語非菩薩摩訶薩，即大悲、大喜、大捨增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183b26_11": "具壽善現答言：「世尊！",
    "T05n0220_033:0183b26_12": "若大慈，若大悲、大喜、大捨，尚畢竟不可得，性非有故，況有大慈增語及大悲、大喜、大捨增語！",
    "T05n0220_033:0183b28_13": "此增語既非有，如何可言：即大慈增語是菩薩摩訶薩，即大悲、大喜、大捨增語是菩薩摩訶薩？」",
    "T05n0220_033:0183c02_14": "「善現！",
    "T05n0220_033:0183c02_15": "汝復觀何義言：即大慈若常若無常增語非菩薩摩訶薩，即大悲、大喜、大捨若常若無常增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183c04_16": "「世尊！",
    "T05n0220_033:0183c04_17": "若大慈常無常，若大悲、大喜、大捨常無常，尚畢竟不可得，性非有故，況有大慈常無常增語及大悲、大喜、大捨常無常增語！",
    "T05n0220_033:0183c07_18": "此增語既非有，如何可言：即大慈若常若無常增語是菩薩摩訶薩，即大悲、大喜、大捨若常若無常增語是菩薩摩訶薩？」",
    "T05n0220_033:0183c10_19": "「善現！",
    "T05n0220_033:0183c10_20": "汝復觀何義言：即大慈若樂若苦增語非菩薩摩訶薩，即大悲、大喜、大捨若樂若苦增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183c13_0": "「世尊！",
    "T05n0220_033:0183c13_1": "若大慈樂苦，若大悲、大喜、大捨樂苦，尚畢竟不可得，性非有故，況有大慈樂苦增語及大悲、大喜、大捨樂苦增語！",
    "T05n0220_033:0183c15_2": "此增語既非有，如何可言：即大慈若樂若苦增語是菩薩摩訶薩，即大悲、大喜、大捨若樂若苦增語是菩薩摩訶薩？」",
    "T05n0220_033:0183c18_3": "「善現！",
    "T05n0220_033:0183c18_4": "汝復觀何義言：即大慈若我若無我增語非菩薩摩訶薩，即大悲、大喜、大捨若我若無我增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183c21_0": "「世尊！",
    "T05n0220_033:0183c21_1": "若大慈我無我，若大悲、大喜、大捨我無我，尚畢竟不可得，性非有故，況有大慈我無我增語及大悲、大喜、大捨我無我增語！",
    "T05n0220_033:0183c23_2": "此增語既非有，如何可言：即大慈若我若無我增語是菩薩摩訶薩，即大悲、大喜、大捨若我若無我增語是菩薩摩訶薩？」",
    "T05n0220_033:0183c26_3": "「善現！",
    "T05n0220_033:0183c26_4": "汝復觀何義言：即大慈若淨若不淨增語非菩薩摩訶薩，即大悲、大喜、大捨若淨若不淨增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0183c29_5": "「世尊！",
    "T05n0220_033:0183c29_6": "若大慈淨不淨，若大悲、大喜、大捨淨不淨，尚畢竟不可得，性非有故，況有大慈淨不淨增語及大悲、大喜、大捨淨不淨增語！",
    "T05n0220_033:0184a03_7": "此增語既非有，如何可言：即大慈若淨若不淨增語是菩薩摩訶薩，即大悲、大喜、大捨若淨若不淨增語是菩薩摩訶薩？」",
    "T05n0220_033:0184a05_8": "「善現！",
    "T05n0220_033:0184a05_9": "汝復觀何義言：即大慈若空若不空增語非菩薩摩訶薩，即大悲、大喜、大捨若空若不空增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184a08_10": "「世尊！",
    "T05n0220_033:0184a08_11": "若大慈空不空，若大悲、大喜、大捨空不空，尚畢竟不可得，性非有故，況有大慈空不空增語及大悲、大喜、大捨空不空增語！",
    "T05n0220_033:0184a11_12": "此增語既非有，如何可言：即大慈若空若不空增語是菩薩摩訶薩，即大悲、大喜、大捨若空若不空增語是菩薩摩訶薩？」",
    "T05n0220_033:0184a14_13": "「善現！",
    "T05n0220_033:0184a14_14": "汝復觀何義言：即大慈若有相若無相增語非菩薩摩訶薩，即大悲、大喜、大捨若有相若無相增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184a16_15": "「世尊！",
    "T05n0220_033:0184a17_0": "若大慈有相無相，若大悲、大喜、大捨有相無相，尚畢竟不可得，性非有故，況有大慈有相無相增語及大悲、大喜、大捨有相無相增語！",
    "T05n0220_033:0184a20_1": "此增語既非有，如何可言：即大慈若有相若無相增語是菩薩摩訶薩，即大悲、大喜、大捨若有相若無相增語是菩薩摩訶薩？」",
    "T05n0220_033:0184a22_2": "「善現！",
    "T05n0220_033:0184a23_3": "汝復觀何義言：即大慈若有願若無願增語非菩薩摩訶薩，即大悲、大喜、大捨若有願若無願增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184a25_4": "「世尊！",
    "T05n0220_033:0184a25_5": "若大慈有願無願，若大悲、大喜、大捨有願無願，尚畢竟不可得，性非有故，況有大慈有願無願增語及大悲、大喜、大捨有願無願增語！",
    "T05n0220_033:0184a28_6": "此增語既非有，如何可言：即大慈若有願若無願增語是菩薩摩訶薩，即大悲、大喜、大捨若有願若無願增語是菩薩摩訶薩？」",
    "T05n0220_033:0184b02_7": "「善現！",
    "T05n0220_033:0184b02_8": "汝復觀何義言：即大慈若寂靜若不寂靜增語非菩薩摩訶薩，即大悲、大喜、大捨若寂靜若不寂靜增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184b05_9": "「世尊！",
    "T05n0220_033:0184b05_10": "若大慈寂靜不寂靜，若大悲、大喜、大捨寂靜不寂靜，尚畢竟不可得，性非有故，況有大慈寂靜不寂靜增語及大悲、大喜、大捨寂靜不寂靜增語！",
    "T05n0220_033:0184b08_11": "此增語既非有，如何可言：即大慈若寂靜若不寂靜增語是菩薩摩訶薩，即大悲、大喜、大捨若寂靜若不寂靜增語是菩薩摩訶薩？」",
    "T05n0220_033:0184b11_12": "「善現！",
    "T05n0220_033:0184b11_13": "汝復觀何義言：即大慈若遠離若不遠離增語非菩薩摩訶薩，即大悲、大喜、大捨若遠離若不遠離增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184b14_14": "「世尊！",
    "T05n0220_033:0184b14_15": "若大慈遠離不遠離，若大悲、大喜、大捨遠離不遠離，尚畢竟不可得，性非有故，況有大慈遠離不遠離增語及大悲、大喜、大捨遠離不遠離增語！",
    "T05n0220_033:0184b18_16": "此增語既非有，如何可言：即大慈若遠離若不遠離增語是菩薩摩訶薩，即大悲、大喜、大捨若遠離若不遠離增語是菩薩摩訶薩？」",
    "T05n0220_033:0184b21_17": "「善現！",
    "T05n0220_033:0184b21_18": "汝復觀何義言：即大慈若有為若無為增語非菩薩摩訶薩，即大悲、大喜、大捨若有為若無為增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184b23_19": "「世尊！",
    "T05n0220_033:0184b24_0": "若大慈有為無為，若大悲、大喜、大捨有為無為，尚畢竟不可得，性非有故，況有大慈有為無為增語及大悲、大喜、大捨有為無為增語！",
    "T05n0220_033:0184b27_1": "此增語既非有，如何可言：即大慈若有為若無為增語是菩薩摩訶薩，即大悲、大喜、大捨若有為若無為增語是菩薩摩訶薩？」",
    "T05n0220_033:0184c01_0": "「善現！",
    "T05n0220_033:0184c01_1": "汝復觀何義言：即大慈若有漏若無漏增語非菩薩摩訶薩，即大悲、大喜、大捨若有漏若無漏增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184c03_2": "「世尊！",
    "T05n0220_033:0184c03_3": "若大慈有漏無漏，若大悲、大喜、大捨有漏無漏，尚畢竟不可得，性非有故，況有大慈有漏無漏增語及大悲、大喜、大捨有漏無漏增語！",
    "T05n0220_033:0184c06_4": "此增語既非有，如何可言：即大慈若有漏若無漏增語是菩薩摩訶薩，即大悲、大喜、大捨若有漏若無漏增語是菩薩摩訶薩？」",
    "T05n0220_033:0184c09_5": "「善現！",
    "T05n0220_033:0184c09_6": "汝復觀何義言：即大慈若生若滅增語非菩薩摩訶薩，即大悲、大喜、大捨若生若滅增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184c12_7": "「世尊！",
    "T05n0220_033:0184c12_8": "若大慈生滅，若大悲、大喜、大捨生滅，尚畢竟不可得，性非有故，況有大慈生滅增語及大悲、大喜、大捨生滅增語！",
    "T05n0220_033:0184c15_0": "此增語既非有，如何可言：即大慈若生若滅增語是菩薩摩訶薩，即大悲、大喜、大捨若生若滅增語是菩薩摩訶薩？」",
    "T05n0220_033:0184c17_1": "「善現！",
    "T05n0220_033:0184c17_2": "汝復觀何義言：即大慈若善若非善增語非菩薩摩訶薩，即大悲、大喜、大捨若善若非善增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184c20_3": "「世尊！",
    "T05n0220_033:0184c20_4": "若大慈善非善，若大悲、大喜、大捨善非善，尚畢竟不可得，性非有故，況有大慈善非善增語及大悲、大喜、大捨善非善增語！",
    "T05n0220_033:0184c23_5": "此增語既非有，如何可言：即大慈若善若非善增語是菩薩摩訶薩，即大悲、大喜、大捨若善若非善增語是菩薩摩訶薩？」",
    "T05n0220_033:0184c25_6": "「善現！",
    "T05n0220_033:0184c25_7": "汝復觀何義言：即大慈若有罪若無罪增語非菩薩摩訶薩，即大悲、大喜、大捨若有罪若無罪增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0184c28_8": "「世尊！",
    "T05n0220_033:0184c28_9": "若大慈有罪無罪，若大悲、大喜、大捨有罪無罪，尚畢竟不可得，性非有故，況有大慈有罪無罪增語及大悲、大喜、大捨有罪無罪增語！",
    "T05n0220_033:0185a02_10": "此增語既非有，如何可言：即大慈若有罪若無罪增語是菩薩摩訶薩，即大悲、大喜、大捨若有罪若無罪增語是菩薩摩訶薩？」",
    "T05n0220_033:0185a05_11": "「善現！",
    "T05n0220_033:0185a05_12": "汝復觀何義言：即大慈若有煩惱若無煩惱增語非菩薩摩訶薩，即大悲、大喜、大捨若有煩惱若無煩惱增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185a08_13": "「世尊！",
    "T05n0220_033:0185a08_14": "若大慈有煩惱無煩惱，若大悲、大喜、大捨有煩惱無煩惱，尚畢竟不可得，性非有故，況有大慈有煩惱無煩惱增語及大悲、大喜、大捨有煩惱無煩惱增語！",
    "T05n0220_033:0185a12_15": "此增語既非有，如何可言：即大慈若有煩惱若無煩惱增語是菩薩摩訶薩，即大悲、大喜、大捨若有煩惱若無煩惱增語是菩薩摩訶薩？」",
    "T05n0220_033:0185a15_16": "「善現！",
    "T05n0220_033:0185a15_17": "汝復觀何義言：即大慈若世間若出世間增語非菩薩摩訶薩，即大悲、大喜、大捨若世間若出世間增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185a18_18": "「世尊！",
    "T05n0220_033:0185a18_19": "若大慈世間出世間，若大悲、大喜、大捨世間出世間，尚畢竟不可得，性非有故，況有大慈世間出世間增語及大悲、大喜、大捨世間出世間增語！",
    "T05n0220_033:0185a21_20": "此增語既非有，如何可言：即大慈若世間若出世間增語是菩薩摩訶薩，即大悲、大喜、大捨若世間若出世間增語是菩薩摩訶薩？」",
    "T05n0220_033:0185a24_21": "「善現！",
    "T05n0220_033:0185a24_22": "汝復觀何義言：即大慈若雜染若清淨增語非菩薩摩訶薩，即大悲、大喜、大捨若雜染若清淨增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185a27_23": "「世尊！",
    "T05n0220_033:0185a27_24": "若大慈雜染清淨，若大悲、大喜、大捨雜染清淨，尚畢竟不可得，性非有故，況有大慈雜染清淨增語及大悲、大喜、大捨雜染清淨增語！",
    "T05n0220_033:0185b01_25": "此增語既非有，如何可言：即大慈若雜染若清淨增語是菩薩摩訶薩，即大悲、大喜、大捨若雜染若清淨增語是菩薩摩訶薩？」",
    "T05n0220_033:0185b04_26": "「善現！",
    "T05n0220_033:0185b04_27": "汝復觀何義言：即大慈若屬生死若屬涅槃增語非菩薩摩訶薩，即大悲、大喜、大捨若屬生死若屬涅槃增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185b07_28": "「世尊！",
    "T05n0220_033:0185b07_29": "若大慈屬生死屬涅槃，若大悲、大喜、大捨屬生死屬涅槃，尚畢竟不可得，性非有故，況有大慈屬生死屬涅槃增語及大悲、大喜、大捨屬生死屬涅槃增語！",
    "T05n0220_033:0185b10_30": "此增語既非有，如何可言：即大慈若屬生死若屬涅槃增語是菩薩摩訶薩，即大悲、大喜、大捨若屬生死若屬涅槃增語是菩薩摩訶薩？」",
    "T05n0220_033:0185b13_31": "「善現！",
    "T05n0220_033:0185b13_32": "汝復觀何義言：即大慈若在內若在外若在兩間增語非菩薩摩訶薩，即大悲、大喜、大捨若在內若在外若在兩間增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185b17_0": "「世尊！",
    "T05n0220_033:0185b17_1": "若大慈在內在外在兩間，若大悲、大喜、大捨在內在外在兩間，尚畢竟不可得，性非有故，況有大慈在內在外在兩間增語及大悲、大喜、大捨在內在外在兩間增語！",
    "T05n0220_033:0185b20_2": "此增語既非有，如何可言：即大慈若在內若在外若在兩間增語是菩薩摩訶薩，即大悲、大喜、大捨若在內若在外若在兩間增語是菩薩摩訶薩？」",
    "T05n0220_033:0185b24_3": "「善現！",
    "T05n0220_033:0185b24_4": "汝復觀何義言：即大慈若可得若不可得增語非菩薩摩訶薩，即大悲、大喜、大捨若可得若不可得增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185b27_0": "「世尊！",
    "T05n0220_033:0185b27_1": "若大慈可得不可得，若大悲、大喜、大捨可得不可得，尚畢竟不可得，性非有故，況有大慈可得不可得增語及大悲、大喜、大捨可得不可得增語！",
    "T05n0220_033:0185c01_2": "此增語既非有，如何可言：即大慈若可得若不可得增語是菩薩摩訶薩，即大悲、大喜、大捨若可得若不可得增語是菩薩摩訶薩？」",
    "T05n0220_033:0185c05_0": "「復次，善現！",
    "T05n0220_033:0185c05_1": "汝觀何義言：即三十二大士相增語非菩薩摩訶薩，即八十隨好增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185c07_2": "具壽善現答言：「世尊！",
    "T05n0220_033:0185c07_3": "若三十二大士相，若八十隨好，尚畢竟不可得，性非有故，況有三十二大士相增語及八十隨好增語！",
    "T05n0220_033:0185c10_4": "此增語既非有，如何可言：即三十二大士相增語是菩薩摩訶薩，即八十隨好增語是菩薩摩訶薩？」",
    "T05n0220_033:0185c12_5": "「善現！",
    "T05n0220_033:0185c12_6": "汝復觀何義言：即三十二大士相若常若無常增語非菩薩摩訶薩，即八十隨好若常若無常增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185c15_7": "「世尊！",
    "T05n0220_033:0185c15_8": "若三十二大士相常無常，若八十隨好常無常，尚畢竟不可得，性非有故，況有三十二大士相常無常增語及八十隨好常無常增語！",
    "T05n0220_033:0185c18_9": "此增語既非有，如何可言：即三十二大士相若常若無常增語是菩薩摩訶薩，即八十隨好若常若無常增語是菩薩摩訶薩？」",
    "T05n0220_033:0185c21_10": "「善現！",
    "T05n0220_033:0185c21_11": "汝復觀何義言：即三十二大士相若樂若苦增語非菩薩摩訶薩，即八十隨好若樂若苦增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0185c23_12": "「世尊！",
    "T05n0220_033:0185c23_13": "若三十二大士相樂苦，若八十隨好樂苦，尚畢竟不可得，性非有故，況有三十二大士相樂苦增語及八十隨好樂苦增語！",
    "T05n0220_033:0185c26_14": "此增語既非有，如何可言：即三十二大士相若樂若苦增語是菩薩摩訶薩，即八十隨好若樂若苦增語是菩薩摩訶薩？」",
    "T05n0220_033:0185c29_15": "「善現！",
    "T05n0220_033:0185c29_16": "汝復觀何義言：即三十二大士相若我若無我增語非菩薩摩訶薩，即八十隨好若我若無我增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186a03_17": "「世尊！",
    "T05n0220_033:0186a03_18": "若三十二大士相我無我，若八十隨好我無我，尚畢竟不可得，性非有故，況有三十二大士相我無我增語及八十隨好我無我增語！",
    "T05n0220_033:0186a06_19": "此增語既非有，如何可言：即三十二大士相若我若無我增語是菩薩摩訶薩，即八十隨好若我若無我增語是菩薩摩訶薩？」",
    "T05n0220_033:0186a09_20": "「善現！",
    "T05n0220_033:0186a09_21": "汝復觀何義言：即三十二大士相若淨若不淨增語非菩薩摩訶薩，即八十隨好若淨若不淨增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186a11_22": "「世尊！",
    "T05n0220_033:0186a12_23": "若三十二大士相淨不淨，若八十隨好淨不淨，尚畢竟不可得，性非有故，況有三十二大士相淨不淨增語及八十隨好淨不淨增語！",
    "T05n0220_033:0186a15_24": "此增語既非有，如何可言：即三十二大士相若淨若不淨增語是菩薩摩訶薩，即八十隨好若淨若不淨增語是菩薩摩訶薩？」",
    "T05n0220_033:0186a17_25": "「善現！",
    "T05n0220_033:0186a18_26": "汝復觀何義言：即三十二大士相若空若不空增語非菩薩摩訶薩，即八十隨好若空若不空增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186a20_27": "「世尊！",
    "T05n0220_033:0186a20_28": "若三十二大士相空不空，若八十隨好空不空，尚畢竟不可得，性非有故，況有三十二大士相空不空增語及八十隨好空不空增語！",
    "T05n0220_033:0186a23_29": "此增語既非有，如何可言：即三十二大士相若空若不空增語是菩薩摩訶薩，即八十隨好若空若不空增語是菩薩摩訶薩？」",
    "T05n0220_033:0186a26_30": "「善現！",
    "T05n0220_033:0186a26_31": "汝復觀何義言：即三十二大士相若有相若無相增語非菩薩摩訶薩，即八十隨好若有相若無相增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186a29_32": "「世尊！",
    "T05n0220_033:0186a29_33": "若三十二大士相有相無相，若八十隨好有相無相，尚畢竟不可得，性非有故，況有三十二大士相有相無相增語及八十隨好有相無相增語！",
    "T05n0220_033:0186b03_34": "此增語既非有，如何可言：即三十二大士相若有相若無相增語是菩薩摩訶薩，即八十隨好若有相若無相增語是菩薩摩訶薩？」",
    "T05n0220_033:0186b06_35": "「善現！",
    "T05n0220_033:0186b06_36": "汝復觀何義言：即三十二大士相若有願若無願增語非菩薩摩訶薩，即八十隨好若有願若無願增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186b09_37": "「世尊！",
    "T05n0220_033:0186b09_38": "若三十二大士相有願無願，若八十隨好有願無願，尚畢竟不可得，性非有故，況有三十二大士相有願無願增語及八十隨好有願無願增語！",
    "T05n0220_033:0186b13_39": "此增語既非有，如何可言：即三十二大士相若有願若無願增語是菩薩摩訶薩，即八十隨好若有願若無願增語是菩薩摩訶薩？」",
    "T05n0220_033:0186b16_40": "「善現！",
    "T05n0220_033:0186b16_41": "汝復觀何義言：即三十二大士相若寂靜若不寂靜增語非菩薩摩訶薩，即八十隨好若寂靜若不寂靜增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186b19_42": "「世尊！",
    "T05n0220_033:0186b19_43": "若三十二大士相寂靜不寂靜，若八十隨好寂靜不寂靜，尚畢竟不可得，性非有故，況有三十二大士相寂靜不寂靜增語及八十隨好寂靜不寂靜增語！",
    "T05n0220_033:0186b22_44": "此增語既非有，如何可言：即三十二大士相若寂靜若不寂靜增語是菩薩摩訶薩，即八十隨好若寂靜若不寂靜增語是菩薩摩訶薩？」",
    "T05n0220_033:0186b25_45": "「善現！",
    "T05n0220_033:0186b25_46": "汝復觀何義言：即三十二大士相若遠離若不遠離增語非菩薩摩訶薩，即八十隨好若遠離若不遠離增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186b28_47": "「世尊！",
    "T05n0220_033:0186b28_48": "若三十二大士相遠離不遠離，若八十隨好遠離不遠離，尚畢竟不可得，性非有故，況有三十二大士相遠離不遠離增語及八十隨好遠離不遠離增語！",
    "T05n0220_033:0186c03_49": "此增語既非有，如何可言：即三十二大士相若遠離若不遠離增語是菩薩摩訶薩，即八十隨好若遠離若不遠離增語是菩薩摩訶薩？」",
    "T05n0220_033:0186c06_50": "「善現！",
    "T05n0220_033:0186c06_51": "汝復觀何義言：即三十二大士相若有為若無為增語非菩薩摩訶薩，即八十隨好若有為若無為增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186c09_52": "「世尊！",
    "T05n0220_033:0186c09_53": "若三十二大士相有為無為，若八十隨好有為無為，尚畢竟不可得，性非有故，況有三十二大士相有為無為增語及八十隨好有為無為增語！",
    "T05n0220_033:0186c12_54": "此增語既非有，如何可言：即三十二大士相若有為若無為增語是菩薩摩訶薩，即八十隨好若有為若無為增語是菩薩摩訶薩？」",
    "T05n0220_033:0186c15_55": "「善現！",
    "T05n0220_033:0186c15_56": "汝復觀何義言：即三十二大士相若有漏若無漏增語非菩薩摩訶薩，即八十隨好若有漏若無漏增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186c18_57": "「世尊！",
    "T05n0220_033:0186c18_58": "若三十二大士相有漏無漏，若八十隨好有漏無漏，尚畢竟不可得，性非有故，況有三十二大士相有漏無漏增語及八十隨好有漏無漏增語！",
    "T05n0220_033:0186c21_59": "此增語既非有，如何可言：即三十二大士相若有漏若無漏增語是菩薩摩訶薩，即八十隨好若有漏若無漏增語是菩薩摩訶薩？」",
    "T05n0220_033:0186c24_60": "「善現！",
    "T05n0220_033:0186c24_61": "汝復觀何義言：即三十二大士相若生若滅增語非菩薩摩訶薩，即八十隨好若生若滅增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0186c27_62": "「世尊！",
    "T05n0220_033:0186c27_63": "若三十二大士相生滅，若八十隨好生滅，尚畢竟不可得，性非有故，況有三十二大士相生滅增語及八十隨好生滅增語！",
    "T05n0220_033:0187a01_64": "此增語既非有，如何可言：即三十二大士相若生若滅增語是菩薩摩訶薩，即八十隨好若生若滅增語是菩薩摩訶薩？」",
    "T05n0220_033:0187a03_65": "「善現！",
    "T05n0220_033:0187a04_0": "汝復觀何義言：即三十二大士相若善若非善增語非菩薩摩訶薩，即八十隨好若善若非善增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0187a06_1": "「世尊！",
    "T05n0220_033:0187a06_2": "若三十二大士相善非善，若八十隨好善非善，尚畢竟不可得，性非有故，況有三十二大士相善非善增語及八十隨好善非善增語！",
    "T05n0220_033:0187a09_3": "此增語既非有，如何可言：即三十二大士相若善若非善增語是菩薩摩訶薩，即八十隨好若善若非善增語是菩薩摩訶薩？」",
    "T05n0220_033:0187a12_4": "「善現！",
    "T05n0220_033:0187a12_5": "汝復觀何義言：即三十二大士相若有罪若無罪增語非菩薩摩訶薩，即八十隨好若有罪若無罪增語非菩薩摩訶薩耶？」",
    "T05n0220_033:0187a15_6": "「世尊！",
    "T05n0220_033:0187a15_7": "若三十二大士相有罪無罪，若八十隨好有罪無罪，尚畢竟不可得，性非有故，況有三十二大士相有罪無罪增語及八十隨好有罪無罪增語！",
    "T05n0220_033:0187a18_8": "此增語既非有，如何可言：即三十二大士相若有罪若無罪增語是菩薩摩訶薩，即八十隨好若有罪若無罪增語是菩薩摩訶薩？」",
    "T05n0220_033:0187a22_0": "大般若波羅蜜多經卷第三十三"
}