{
    "T05n0220_179:0961c09_0": "大般若波羅蜜多經卷第一百七",
    "T05n0220_179:0961c10_0": "十九",
    "T05n0220_179:0961c12_0": "三藏法師玄奘奉　詔譯",
    "T05n0220_179:0961c13_0": "初分讚般若品第三十二之八",
    "T05n0220_179:0961c14_0": "「復次，世尊！",
    "T05n0220_179:0961c14_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於佛十力若作大小、不作大小，於四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法若作大小、不作大小；於佛十力若作集散、不作集散，於四無所畏乃至十八佛不共法若作集散、不作集散；於佛十力若作有量無量、不作有量無量，於四無所畏乃至十八佛不共法若作有量無量、不作有量無量；於佛十力若作廣狹、不作廣狹，於四無所畏乃至十八佛不共法若作廣狹、不作廣狹；於佛十力若作有力無力、不作有力無力，於四無所畏乃至十八佛不共法若作有力無力、不作有力無力。』",
    "T05n0220_179:0961c26_2": "世尊！",
    "T05n0220_179:0961c26_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0961c27_4": "何以故？",
    "T05n0220_179:0961c27_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0961c29_0": "「復次，世尊！",
    "T05n0220_179:0961c29_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於無忘失法若作大小、不作大小，於恒住捨性若作大小、不作大小；於無忘失法若作集散、不作集散，於恒住捨性若作集散、不作集散；於無忘失法若作有量無量、不作有量無量，於恒住捨性若作有量無量、不作有量無量；於無忘失法若作廣狹、不作廣狹，於恒住捨性若作廣狹、不作廣狹；於無忘失法若作有力無力、不作有力無力，於恒住捨性若作有力無力、不作有力無力。』",
    "T05n0220_179:0962a09_2": "世尊！",
    "T05n0220_179:0962a10_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0962a11_4": "何以故？",
    "T05n0220_179:0962a11_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0962a13_0": "「復次，世尊！",
    "T05n0220_179:0962a13_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於一切智若作大小、不作大小，於道相智、一切相智若作大小、不作大小；於一切智若作集散、不作集散，於道相智、一切相智若作集散、不作集散；於一切智若作有量無量、不作有量無量，於道相智、一切相智若作有量無量、不作有量無量；於一切智若作廣狹、不作廣狹，於道相智、一切相智若作廣狹、不作廣狹；於一切智若作有力無力、不作有力無力，於道相智、一切相智若作有力無力、不作有力無力。』",
    "T05n0220_179:0962a23_2": "世尊！",
    "T05n0220_179:0962a23_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0962a24_4": "何以故？",
    "T05n0220_179:0962a25_0": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0962a26_0": "「復次，世尊！",
    "T05n0220_179:0962a26_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於一切陀羅尼門若作大小、不作大小，於一切三摩地門若作大小、不作大小；於一切陀羅尼門若作集散、不作集散，於一切三摩地門若作集散、不作集散；於一切陀羅尼門若作有量無量、不作有量無量，於一切三摩地門若作有量無量、不作有量無量；於一切陀羅尼門若作廣狹、不作廣狹，於一切三摩地門若作廣狹、不作廣狹；於一切陀羅尼門若作有力無力、不作有力無力，於一切三摩地門若作有力無力、不作有力無力。』",
    "T05n0220_179:0962b08_2": "世尊！",
    "T05n0220_179:0962b08_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0962b09_4": "何以故？",
    "T05n0220_179:0962b09_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0962b11_0": "「復次，世尊！",
    "T05n0220_179:0962b11_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於預流若作大小、不作大小，於一來、不還、阿羅漢若作大小、不作大小；於預流若作集散、不作集散，於一來、不還、阿羅漢若作集散、不作集散；於預流若作有量無量、不作有量無量，於一來、不還、阿羅漢若作有量無量、不作有量無量；於預流若作廣狹、不作廣狹，於一來、不還、阿羅漢若作廣狹、不作廣狹；於預流若作有力無力、不作有力無力，於一來、不還、阿羅漢若作有力無力、不作有力無力。』",
    "T05n0220_179:0962b21_2": "世尊！",
    "T05n0220_179:0962b21_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0962b22_4": "何以故？",
    "T05n0220_179:0962b22_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0962b24_0": "「復次，世尊！",
    "T05n0220_179:0962b24_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於預流向預流果若作大小、不作大小，於一來向一來果、不還向不還果、阿羅漢向阿羅漢果若作大小、不作大小；於預流向預流果若作集散、不作集散，於一來向乃至阿羅漢果若作集散、不作集散；於預流向預流果若作有量無量、不作有量無量，於一來向乃至阿羅漢果若作有量無量、不作有量無量；於預流向預流果若作廣狹、不作廣狹，於一來向乃至阿羅漢果若作廣狹、不作廣狹；於預流向預流果若作有力無力、不作有力無力，於一來向乃至阿羅漢果若作有力無力、不作有力無力。』",
    "T05n0220_179:0962c07_2": "世尊！",
    "T05n0220_179:0962c07_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0962c08_4": "何以故？",
    "T05n0220_179:0962c09_0": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0962c10_0": "「復次，世尊！",
    "T05n0220_179:0962c10_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於獨覺若作大小、不作大小，於獨覺菩提若作大小、不作大小；於獨覺若作集散、不作集散，於獨覺菩提若作集散、不作集散；於獨覺若作有量無量、不作有量無量，於獨覺菩提若作有量無量、不作有量無量；於獨覺若作廣狹、不作廣狹，於獨覺菩提若作廣狹、不作廣狹；於獨覺若作有力無力、不作有力無力，於獨覺菩提若作有力無力、不作有力無力。』",
    "T05n0220_179:0962c19_2": "世尊！",
    "T05n0220_179:0962c19_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0962c20_4": "何以故？",
    "T05n0220_179:0962c20_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0962c22_0": "「復次，世尊！",
    "T05n0220_179:0962c22_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於諸菩薩摩訶薩若作大小、不作大小，於菩薩摩訶薩行若作大小、不作大小；於諸菩薩摩訶薩若作集散、不作集散，於菩薩摩訶薩行若作集散、不作集散；於諸菩薩摩訶薩若作有量無量、不作有量無量，於菩薩摩訶薩行若作有量無量、不作有量無量；於諸菩薩摩訶薩若作廣狹、不作廣狹，於菩薩摩訶薩行若作廣狹、不作廣狹；於諸菩薩摩訶薩若作有力無力、不作有力無力，於菩薩摩訶薩行若作有力無力、不作有力無力。』",
    "T05n0220_179:0963a04_2": "世尊！",
    "T05n0220_179:0963a04_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0963a05_4": "何以故？",
    "T05n0220_179:0963a05_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0963a07_0": "「復次，世尊！",
    "T05n0220_179:0963a07_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於諸如來、應、正等覺若作大小、不作大小，於佛無上正等菩提若作大小、不作大小；於諸如來、應、正等覺若作集散、不作集散，於佛無上正等菩提若作集散、不作集散；於諸如來、應、正等覺若作有量無量、不作有量無量，於佛無上正等菩提若作有量無量、不作有量無量；於諸如來、應、正等覺若作廣狹、不作廣狹，於佛無上正等菩提若作廣狹、不作廣狹；於諸如來、應、正等覺若作有力無力、不作有力無力，於佛無上正等菩提若作有力無力、不作有力無力。』",
    "T05n0220_179:0963a18_2": "世尊！",
    "T05n0220_179:0963a18_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0963a19_4": "何以故？",
    "T05n0220_179:0963a20_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0963a21_0": "「復次，世尊！",
    "T05n0220_179:0963a21_1": "若菩薩摩訶薩起如是想：『如是般若波羅蜜多，於一切法若作大小、不作大小，於一切法若作集散、不作集散，於一切法若作有量無量、不作有量無量，於一切法若作廣狹、不作廣狹，於一切法若作有力無力、不作有力無力。』",
    "T05n0220_179:0963a26_2": "世尊！",
    "T05n0220_179:0963a26_3": "是菩薩摩訶薩名大有所得，非行般若波羅蜜多。",
    "T05n0220_179:0963a27_4": "何以故？",
    "T05n0220_179:0963a27_5": "非有所得想能證無上正等菩提故。",
    "T05n0220_179:0963a29_0": "「所以者何？",
    "T05n0220_179:0963a29_1": "世尊！",
    "T05n0220_179:0963a29_2": "有情無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0963b01_3": "有情無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0963b02_4": "有情無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0963b03_5": "有情無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0963b04_6": "有情空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0963b05_7": "有情無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0963b06_8": "有情無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0963b07_9": "有情遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0963b08_10": "有情寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0963b09_0": "有情不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0963b10_1": "有情不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0963b11_2": "有情無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0963b12_3": "有情勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0963b13_4": "世尊！",
    "T05n0220_179:0963b13_5": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0963b16_0": "「復次，世尊！",
    "T05n0220_179:0963b16_1": "色無生故，當知般若波羅蜜多亦無生；受、想、行、識無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0963b18_2": "色無滅故，當知般若波羅蜜多亦無滅；受、想、行、識無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0963b20_3": "色無自性故，當知般若波羅蜜多亦無自性；受、想、行、識無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0963b22_4": "色無所有故，當知般若波羅蜜多亦無所有；受、想、行、識無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0963b24_5": "色空故，當知般若波羅蜜多亦空；受、想、行、識空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0963b26_6": "色無相故，當知般若波羅蜜多亦無相；受、想、行、識無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0963b28_7": "色無願故，當知般若波羅蜜多亦無願；受、想、行、識無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0963c01_8": "色遠離故，當知般若波羅蜜多亦遠離；受、想、行、識遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0963c03_0": "色寂靜故，當知般若波羅蜜多亦寂靜；受、想、行、識寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0963c04_1": "色不可得故，當知般若波羅蜜多亦不可得；受、想、行、識不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0963c07_2": "色不可思議故，當知般若波羅蜜多亦不可思議；受、想、行、識不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0963c09_3": "色無覺知故，當知般若波羅蜜多亦無覺知；受、想、行、識無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0963c11_4": "色勢力不成就故，當知般若波羅蜜多勢力亦不成就；受、想、行、識勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0963c14_5": "世尊！",
    "T05n0220_179:0963c14_6": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0963c16_0": "「復次，世尊！",
    "T05n0220_179:0963c16_1": "眼處無生故，當知般若波羅蜜多亦無生；耳、鼻、舌、身、意處無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0963c18_2": "眼處無滅故，當知般若波羅蜜多亦無滅；耳、鼻、舌、身、意處無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0963c20_3": "眼處無自性故，當知般若波羅蜜多亦無自性；耳、鼻、舌、身、意處無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0963c22_4": "眼處無所有故，當知般若波羅蜜多亦無所有；耳、鼻、舌、身、意處無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0963c25_5": "眼處空故，當知般若波羅蜜多亦空；耳、鼻、舌、身、意處空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0963c27_0": "眼處無相故，當知般若波羅蜜多亦無相；耳、鼻、舌、身、意處無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0963c29_1": "眼處無願故，當知般若波羅蜜多亦無願；耳、鼻、舌、身、意處無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0964a02_2": "眼處遠離故，當知般若波羅蜜多亦遠離；耳、鼻、舌、身、意處遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0964a04_3": "眼處寂靜故，當知般若波羅蜜多亦寂靜；耳、鼻、舌、身、意處寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0964a06_4": "眼處不可得故，當知般若波羅蜜多亦不可得；耳、鼻、舌、身、意處不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0964a08_5": "眼處不可思議故，當知般若波羅蜜多亦不可思議；耳、鼻、舌、身、意處不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0964a11_6": "眼處無覺知故，當知般若波羅蜜多亦無覺知；耳、鼻、舌、身、意處無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0964a13_7": "眼處勢力不成就故，當知般若波羅蜜多勢力亦不成就；耳、鼻、舌、身、意處勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0964a16_8": "世尊！",
    "T05n0220_179:0964a16_9": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0964a18_0": "「復次，世尊！",
    "T05n0220_179:0964a18_1": "色處無生故，當知般若波羅蜜多亦無生；聲、香、味、觸、法處無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0964a20_2": "色處無滅故，當知般若波羅蜜多亦無滅；聲、香、味、觸、法處無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0964a22_3": "色處無自性故，當知般若波羅蜜多亦無自性；聲、香、味、觸、法處無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0964a24_4": "色處無所有故，當知般若波羅蜜多亦無所有；聲、香、味、觸、法處無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0964a27_5": "色處空故，當知般若波羅蜜多亦空；聲、香、味、觸、法處空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0964a29_6": "色處無相故，當知般若波羅蜜多亦無相；聲、香、味、觸、法處無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0964b02_7": "色處無願故，當知般若波羅蜜多亦無願；聲、香、味、觸、法處無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0964b04_8": "色處遠離故，當知般若波羅蜜多亦遠離；聲、香、味、觸、法處遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0964b06_9": "色處寂靜故，當知般若波羅蜜多亦寂靜；聲、香、味、觸、法處寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0964b08_10": "色處不可得故，當知般若波羅蜜多亦不可得；聲、香、味、觸、法處不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0964b11_0": "色處不可思議故，當知般若波羅蜜多亦不可思議；聲、香、味、觸、法處不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0964b13_1": "色處無覺知故，當知般若波羅蜜多亦無覺知；聲、香、味、觸、法處無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0964b15_2": "色處勢力不成就故，當知般若波羅蜜多勢力亦不成就；聲、香、味、觸、法處勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0964b18_3": "世尊！",
    "T05n0220_179:0964b18_4": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0964b21_0": "「復次，世尊！",
    "T05n0220_179:0964b21_1": "眼界無生故，當知般若波羅蜜多亦無生；色界、眼識界及眼觸、眼觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0964b23_2": "眼界無滅故，當知般若波羅蜜多亦無滅；色界乃至眼觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0964b26_3": "眼界無自性故，當知般若波羅蜜多亦無自性；色界乃至眼觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0964b29_4": "眼界無所有故，當知般若波羅蜜多亦無所有；色界乃至眼觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0964c02_5": "眼界空故，當知般若波羅蜜多亦空；色界乃至眼觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0964c05_6": "眼界無相故，當知般若波羅蜜多亦無相；色界乃至眼觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0964c07_7": "眼界無願故，當知般若波羅蜜多亦無願；色界乃至眼觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0964c10_0": "眼界遠離故，當知般若波羅蜜多亦遠離；色界乃至眼觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0964c12_1": "眼界寂靜故，當知般若波羅蜜多亦寂靜；色界乃至眼觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0964c14_2": "眼界不可得故，當知般若波羅蜜多亦不可得；色界乃至眼觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0964c17_3": "眼界不可思議故，當知般若波羅蜜多亦不可思議；色界乃至眼觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0964c20_4": "眼界無覺知故，當知般若波羅蜜多亦無覺知；色界乃至眼觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0964c23_5": "眼界勢力不成就故，當知般若波羅蜜多勢力亦不成就；色界乃至眼觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0964c26_6": "世尊！",
    "T05n0220_179:0964c26_7": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0964c28_0": "「復次，世尊！",
    "T05n0220_179:0964c28_1": "耳界無生故，當知般若波羅蜜多亦無生；聲界、耳識界及耳觸、耳觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0965a01_2": "耳界無滅故，當知般若波羅蜜多亦無滅；聲界乃至耳觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0965a04_3": "耳界無自性故，當知般若波羅蜜多亦無自性；聲界乃至耳觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0965a07_4": "耳界無所有故，當知般若波羅蜜多亦無所有；聲界乃至耳觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0965a09_5": "耳界空故，當知般若波羅蜜多亦空；聲界乃至耳觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0965a12_6": "耳界無相故，當知般若波羅蜜多亦無相；聲界乃至耳觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0965a14_7": "耳界無願故，當知般若波羅蜜多亦無願；聲界乃至耳觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0965a17_0": "耳界遠離故，當知般若波羅蜜多亦遠離；聲界乃至耳觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0965a19_1": "耳界寂靜故，當知般若波羅蜜多亦寂靜；聲界乃至耳觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0965a21_2": "耳界不可得故，當知般若波羅蜜多亦不可得；聲界乃至耳觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0965a24_3": "耳界不可思議故，當知般若波羅蜜多亦不可思議；聲界乃至耳觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0965a27_4": "耳界無覺知故，當知般若波羅蜜多亦無覺知；聲界乃至耳觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0965b01_5": "耳界勢力不成就故，當知般若波羅蜜多勢力亦不成就；聲界乃至耳觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0965b04_6": "世尊！",
    "T05n0220_179:0965b04_7": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0965b06_0": "「復次，世尊！",
    "T05n0220_179:0965b06_1": "鼻界無生故，當知般若波羅蜜多亦無生；香界、鼻識界及鼻觸、鼻觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0965b08_2": "鼻界無滅故，當知般若波羅蜜多亦無滅；香界乃至鼻觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0965b11_3": "鼻界無自性故，當知般若波羅蜜多亦無自性；香界乃至鼻觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0965b14_4": "鼻界無所有故，當知般若波羅蜜多亦無所有；香界乃至鼻觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0965b16_5": "鼻界空故，當知般若波羅蜜多亦空；香界乃至鼻觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0965b19_6": "鼻界無相故，當知般若波羅蜜多亦無相；香界乃至鼻觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0965b21_7": "鼻界無願故，當知般若波羅蜜多亦無願；香界乃至鼻觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0965b24_0": "鼻界遠離故，當知般若波羅蜜多亦遠離；香界乃至鼻觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0965b26_1": "鼻界寂靜故，當知般若波羅蜜多亦寂靜；香界乃至鼻觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0965b28_2": "鼻界不可得故，當知般若波羅蜜多亦不可得；香界乃至鼻觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0965c02_3": "鼻界不可思議故，當知般若波羅蜜多亦不可思議；香界乃至鼻觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0965c05_4": "鼻界無覺知故，當知般若波羅蜜多亦無覺知；香界乃至鼻觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0965c08_5": "鼻界勢力不成就故，當知般若波羅蜜多勢力亦不成就；香界乃至鼻觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0965c11_6": "世尊！",
    "T05n0220_179:0965c11_7": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0965c13_0": "「復次，世尊！",
    "T05n0220_179:0965c13_1": "舌界無生故，當知般若波羅蜜多亦無生；味界、舌識界及舌觸、舌觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0965c15_2": "舌界無滅故，當知般若波羅蜜多亦無滅；味界乃至舌觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0965c18_3": "舌界無自性故，當知般若波羅蜜多亦無自性；味界乃至舌觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0965c21_4": "舌界無所有故，當知般若波羅蜜多亦無所有；味界乃至舌觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0965c23_5": "舌界空故，當知般若波羅蜜多亦空；味界乃至舌觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0965c26_6": "舌界無相故，當知般若波羅蜜多亦無相；味界乃至舌觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0965c28_7": "舌界無願故，當知般若波羅蜜多亦無願；味界乃至舌觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0966a02_0": "舌界遠離故，當知般若波羅蜜多亦遠離；味界乃至舌觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0966a04_1": "舌界寂靜故，當知般若波羅蜜多亦寂靜；味界乃至舌觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0966a06_2": "舌界不可得故，當知般若波羅蜜多亦不可得；味界乃至舌觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0966a09_3": "舌界不可思議故，當知般若波羅蜜多亦不可思議；味界乃至舌觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0966a12_4": "舌界無覺知故，當知般若波羅蜜多亦無覺知；味界乃至舌觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0966a15_5": "舌界勢力不成就故，當知般若波羅蜜多勢力亦不成就；味界乃至舌觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0966a18_6": "世尊！",
    "T05n0220_179:0966a18_7": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0966a20_0": "「復次，世尊！",
    "T05n0220_179:0966a20_1": "身界無生故，當知般若波羅蜜多亦無生；觸界、身識界及身觸、身觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0966a22_2": "身界無滅故，當知般若波羅蜜多亦無滅；觸界乃至身觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0966a25_3": "身界無自性故，當知般若波羅蜜多亦無自性；觸界乃至身觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0966a28_4": "身界無所有故，當知般若波羅蜜多亦無所有；觸界乃至身觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0966b01_5": "身界空故，當知般若波羅蜜多亦空；觸界乃至身觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0966b04_6": "身界無相故，當知般若波羅蜜多亦無相；觸界乃至身觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0966b06_7": "身界無願故，當知般若波羅蜜多亦無願；觸界乃至身觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0966b08_8": "身界遠離故，當知般若波羅蜜多亦遠離；觸界乃至身觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0966b11_9": "身界寂靜故，當知般若波羅蜜多亦寂靜；觸界乃至身觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0966b13_10": "身界不可得故，當知般若波羅蜜多亦不可得；觸界乃至身觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0966b16_11": "身界不可思議故，當知般若波羅蜜多亦不可思議；觸界乃至身觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0966b19_12": "身界無覺知故，當知般若波羅蜜多亦無覺知；觸界乃至身觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0966b22_13": "身界勢力不成就故，當知般若波羅蜜多勢力亦不成就；觸界乃至身觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0966b25_14": "世尊！",
    "T05n0220_179:0966b25_15": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0966b27_0": "「復次，世尊！",
    "T05n0220_179:0966b27_1": "意界無生故，當知般若波羅蜜多亦無生；法界、意識界及意觸、意觸為緣所生諸受無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0966b29_2": "意界無滅故，當知般若波羅蜜多亦無滅；法界乃至意觸為緣所生諸受無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0966c03_3": "意界無自性故，當知般若波羅蜜多亦無自性；法界乃至意觸為緣所生諸受無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0966c06_4": "意界無所有故，當知般若波羅蜜多亦無所有；法界乃至意觸為緣所生諸受無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0966c08_5": "意界空故，當知般若波羅蜜多亦空；法界乃至意觸為緣所生諸受空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0966c11_6": "意界無相故，當知般若波羅蜜多亦無相；法界乃至意觸為緣所生諸受無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0966c13_7": "意界無願故，當知般若波羅蜜多亦無願；法界乃至意觸為緣所生諸受無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0966c16_0": "意界遠離故，當知般若波羅蜜多亦遠離；法界乃至意觸為緣所生諸受遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0966c18_1": "意界寂靜故，當知般若波羅蜜多亦寂靜；法界乃至意觸為緣所生諸受寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0966c20_2": "意界不可得故，當知般若波羅蜜多亦不可得；法界乃至意觸為緣所生諸受不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0966c23_3": "意界不可思議故，當知般若波羅蜜多亦不可思議；法界乃至意觸為緣所生諸受不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0966c26_4": "意界無覺知故，當知般若波羅蜜多亦無覺知；法界乃至意觸為緣所生諸受無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0966c29_5": "意界勢力不成就故，當知般若波羅蜜多勢力亦不成就；法界乃至意觸為緣所生諸受勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0967a03_6": "世尊！",
    "T05n0220_179:0967a03_7": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0967a05_0": "「復次，世尊！",
    "T05n0220_179:0967a05_1": "地界無生故，當知般若波羅蜜多亦無生；水、火、風、空、識界無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0967a07_2": "地界無滅故，當知般若波羅蜜多亦無滅；水、火、風、空、識界無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0967a09_3": "地界無自性故，當知般若波羅蜜多亦無自性；水、火、風、空、識界無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0967a11_4": "地界無所有故，當知般若波羅蜜多亦無所有；水、火、風、空、識界無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0967a14_5": "地界空故，當知般若波羅蜜多亦空；水、火、風、空、識界空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0967a16_6": "地界無相故，當知般若波羅蜜多亦無相；水、火、風、空、識界無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0967a18_7": "地界無願故，當知般若波羅蜜多亦無願；水、火、風、空、識界無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0967a20_8": "地界遠離故，當知般若波羅蜜多亦遠離；水、火、風、空、識界遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0967a22_9": "地界寂靜故，當知般若波羅蜜多亦寂靜；水、火、風、空、識界寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0967a24_10": "地界不可得故，當知般若波羅蜜多亦不可得；水、火、風、空、識界不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0967a26_11": "地界不可思議故，當知般若波羅蜜多亦不可思議；水、火、風、空、識界不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0967a29_12": "地界無覺知故，當知般若波羅蜜多亦無覺知；水、火、風、空、識界無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0967b02_13": "地界勢力不成就故，當知般若波羅蜜多勢力亦不成就；水、火、風、空、識界勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0967b05_14": "世尊！",
    "T05n0220_179:0967b05_15": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0967b08_0": "「復次，世尊！",
    "T05n0220_179:0967b08_1": "無明無生故，當知般若波羅蜜多亦無生；行、識、名色、六處、觸、受、愛、取、有、生、老死愁歎苦憂惱無生故，當知般若波羅蜜多亦無生。",
    "T05n0220_179:0967b11_2": "無明無滅故，當知般若波羅蜜多亦無滅；行乃至老死愁歎苦憂惱無滅故，當知般若波羅蜜多亦無滅。",
    "T05n0220_179:0967b13_3": "無明無自性故，當知般若波羅蜜多亦無自性；行乃至老死愁歎苦憂惱無自性故，當知般若波羅蜜多亦無自性。",
    "T05n0220_179:0967b16_4": "無明無所有故，當知般若波羅蜜多亦無所有；行乃至老死愁歎苦憂惱無所有故，當知般若波羅蜜多亦無所有。",
    "T05n0220_179:0967b18_5": "無明空故，當知般若波羅蜜多亦空；行乃至老死愁歎苦憂惱空故，當知般若波羅蜜多亦空。",
    "T05n0220_179:0967b20_6": "無明無相故，當知般若波羅蜜多亦無相；行乃至老死愁歎苦憂惱無相故，當知般若波羅蜜多亦無相。",
    "T05n0220_179:0967b23_7": "無明無願故，當知般若波羅蜜多亦無願；行乃至老死愁歎苦憂惱無願故，當知般若波羅蜜多亦無願。",
    "T05n0220_179:0967b25_8": "無明遠離故，當知般若波羅蜜多亦遠離；行乃至老死愁歎苦憂惱遠離故，當知般若波羅蜜多亦遠離。",
    "T05n0220_179:0967b27_9": "無明寂靜故，當知般若波羅蜜多亦寂靜；行乃至老死愁歎苦憂惱寂靜故，當知般若波羅蜜多亦寂靜。",
    "T05n0220_179:0967c01_10": "無明不可得故，當知般若波羅蜜多亦不可得；行乃至老死愁歎苦憂惱不可得故，當知般若波羅蜜多亦不可得。",
    "T05n0220_179:0967c03_11": "無明不可思議故，當知般若波羅蜜多亦不可思議；行乃至老死愁歎苦憂惱不可思議故，當知般若波羅蜜多亦不可思議。",
    "T05n0220_179:0967c06_12": "無明無覺知故，當知般若波羅蜜多亦無覺知；行乃至老死愁歎苦憂惱無覺知故，當知般若波羅蜜多亦無覺知。",
    "T05n0220_179:0967c09_13": "無明勢力不成就故，當知般若波羅蜜多勢力亦不成就；行乃至老死愁歎苦憂惱勢力不成就故，當知般若波羅蜜多勢力亦不成就。",
    "T05n0220_179:0967c12_14": "世尊！",
    "T05n0220_179:0967c12_15": "我緣此意，故說菩薩摩訶薩般若波羅蜜多名大波羅蜜多。",
    "T05n0220_179:0967c14_0": "大般若波羅蜜多經卷第一百七十九"
}