{
    "T07n0220_600:1105c03_0": "大般若波羅蜜多經卷第六百",
    "T07n0220_600:1105c05_0": "三藏法師玄奘奉　詔譯",
    "T07n0220_600:1105c06_0": "第十六般若波羅蜜多分之八",
    "T07n0220_600:1105c07_0": "「復次，善勇猛！",
    "T07n0220_600:1105c07_1": "若諸菩薩修行般若波羅蜜多，不行色開顯不開顯，不行受、想、行、識開顯不開顯；不行眼開顯不開顯，不行耳、鼻、舌、身、意開顯不開顯；不行色開顯不開顯，不行聲、香、味、觸、法開顯不開顯；不行眼識開顯不開顯，不行耳、鼻、舌、身、意識開顯不開顯。",
    "T07n0220_600:1105c12_2": "不行色寂靜不寂靜，不行受、想、行、識寂靜不寂靜；不行眼寂靜不寂靜，不行耳、鼻、舌、身、意寂靜不寂靜；不行色寂靜不寂靜，不行聲、香、味、觸、法寂靜不寂靜；不行眼識寂靜不寂靜，不行耳、鼻、舌、身、意識寂靜不寂靜。",
    "T07n0220_600:1105c17_3": "「不行色本性清淨不清淨，不行受、想、行、識本性清淨不清淨；不行眼本性清淨不清淨，不行耳、鼻、舌、身、意本性清淨不清淨；不行色本性清淨不清淨，不行聲、香、味、觸、法本性清淨不清淨；不行眼識本性清淨不清淨，不行耳、鼻、舌、身、意識本性清淨不清淨。",
    "T07n0220_600:1105c23_4": "不行色本性開顯不開顯，不行受、想、行、識本性開顯不開顯；不行眼本性開顯不開顯，不行耳、鼻、舌、身、意本性開顯不開顯；不行色本性開顯不開顯，不行聲、香、味、觸、法本性開顯不開顯；不行眼識本性開顯不開顯，不行耳、鼻、舌、身、意識本性開顯不開顯。",
    "T07n0220_600:1105c28_5": "不行色本性寂靜不寂靜，不行受、想、行、識本性寂靜不寂靜；不行眼本性寂靜不寂靜，不行耳、鼻、舌、身、意本性寂靜不寂靜；不行色本性寂靜不寂靜，不行聲、香、味、觸、法本性寂靜不寂靜；不行眼識本性寂靜不寂靜，不行耳、鼻、舌、身、意識本性寂靜不寂靜。",
    "T07n0220_600:1106a05_6": "不行色本性遠離不遠離，不行受、想、行、識本性遠離不遠離；不行眼本性遠離不遠離，不行耳、鼻、舌、身、意本性遠離不遠離；不行色本性遠離不遠離，不行聲、香、味、觸、法本性遠離不遠離；不行眼識本性遠離不遠離，不行耳、鼻、舌、身、意識本性遠離不遠離。",
    "T07n0220_600:1106a11_7": "「不行色過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離，不行受、想、行、識過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離；不行眼過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離，不行耳、鼻、舌、身、意過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離；不行色過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離，不行聲、香、味、觸、法過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離；不行眼識過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離，不行耳、鼻、舌、身、意識過去未來現在本性清淨不清淨、開顯不開顯、寂靜不寂靜、遠離不遠離。",
    "T07n0220_600:1106a26_8": "「善勇猛！",
    "T07n0220_600:1106a26_9": "若諸菩薩能如是行，速能圓滿一切智法。",
    "T07n0220_600:1106a28_0": "「復次，善勇猛！",
    "T07n0220_600:1106a28_1": "若諸菩薩修行般若波羅蜜多，不恃執色，不恃執受、想、行、識；不恃執眼，不恃執耳、鼻、舌、身、意；不恃執色，不恃執聲、香、味、觸、法；不恃執眼識，不恃執耳、鼻、舌、身、意識；不恃執色清淨，不恃執受、想、行、識清淨；不恃執眼清淨，不恃執耳、鼻、舌、身、意清淨；不恃執色清淨，不恃執聲、香、味、觸、法清淨；不恃執眼識清淨，不恃執耳、鼻、舌、身、意識清淨；不恃執色所緣清淨，不恃執受、想、行、識所緣清淨；不恃執眼所緣清淨，不恃執耳、鼻、舌、身、意所緣清淨；不恃執色所緣清淨，不恃執聲、香、味、觸、法所緣清淨；不恃執眼識所緣清淨，不恃執耳、鼻、舌、身、意識所緣清淨。",
    "T07n0220_600:1106b11_2": "「復次，善勇猛！",
    "T07n0220_600:1106b11_3": "若諸菩薩修行般若波羅蜜多，不執著色，不執著受、想、行、識；不執著眼，不執著耳、鼻、舌、身、意；不執著色，不執著聲、香、味、觸、法；不執著眼識，不執著耳、鼻、舌、身、意識；不執著色清淨，不執著受、想、行、識清淨；不執著眼清淨，不執著耳、鼻、舌、身、意清淨；不執著色清淨，不執著聲、香、味、觸、法清淨；不執著眼識清淨，不執著耳、鼻、舌、身、意識清淨；不執著色所緣清淨，不執著受、想、行、識所緣清淨；不執著眼所緣清淨，不執著耳、鼻、舌、身、意所緣清淨；不執著色所緣清淨，不執著聲、香、味、觸、法所緣清淨；不執著眼識所緣清淨，不執著耳、鼻、舌、身、意識所緣清淨。",
    "T07n0220_600:1106b23_4": "「善勇猛！",
    "T07n0220_600:1106b24_0": "若諸菩薩能如是行，速能圓滿一切智法。",
    "T07n0220_600:1106b24_1": "「善勇猛！",
    "T07n0220_600:1106b25_2": "若諸菩薩能如是行，則為隣近如來十力、四無所畏、四無礙解、大慈、大悲、大喜、大捨、十八佛不共法。",
    "T07n0220_600:1106b27_3": "「善勇猛！",
    "T07n0220_600:1106b27_4": "若諸菩薩能如是行，則為隣近三十二大士相、八十隨好，身真金色，無邊光明，如龍象視，無能見頂。",
    "T07n0220_600:1106b29_5": "「善勇猛！",
    "T07n0220_600:1106b29_6": "若諸菩薩能如是行，則為隣近過去未來現在無著無礙智見，亦為隣近如來教授、教誡、示導，亦為隣近過去未來現在無著無礙智見，決定受記。",
    "T07n0220_600:1106c04_7": "「善勇猛！",
    "T07n0220_600:1106c04_8": "若諸菩薩能如是行，速證一切佛法清淨，速能證得佛土清淨，速能攝受聲聞眾圓滿，速能攝受菩薩眾圓滿。",
    "T07n0220_600:1106c06_9": "「善勇猛！",
    "T07n0220_600:1106c06_10": "若諸菩薩能如是行，不住色，不住受、想、行、識；不住眼，不住耳、鼻、舌、身、意；不住色，不住聲、香、味、觸、法；不住眼識，不住耳、鼻、舌、身、意識；不住名、色，不住顛倒、見、蓋、愛行，不住欲、色、無色界，不住有情界、法界，不住地、水、火、風、空、識界，不住我、有情、命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、受者、知者、見者及彼諸想，不住斷、常，不住染、淨，不住緣起，不住布施、慳貪、持戒、犯戒、安忍、忿恚、精進、懈怠、靜慮、散亂、妙慧、惡慧，不住念住、正斷、神足、根、力、覺支、道支，不住顛倒等斷，不住靜慮、解脫、等持、等至，不住明及解脫、解脫智見，不住盡智、無生智、無造作智及無著智，不住止、觀，不住無量、神通，不住苦、集、滅、道，不住異生、聲聞、獨覺、菩薩、佛地，不住異生、聲聞、獨覺、菩薩、佛法，不住生死、涅槃，不住佛智、力、無畏等，不住過去未來現在智見，不住佛土圓滿，不住聲聞眾圓滿，不住菩薩眾圓滿。",
    "T07n0220_600:1106c24_11": "何以故？",
    "T07n0220_600:1106c24_12": "善勇猛！",
    "T07n0220_600:1106c24_13": "以一切法不可住故。",
    "T07n0220_600:1106c25_0": "「善勇猛！",
    "T07n0220_600:1106c25_1": "非一切法有可住義。",
    "T07n0220_600:1106c25_2": "所以者何？",
    "T07n0220_600:1106c25_3": "以一切法皆無執藏，無執藏故無可住者。",
    "T07n0220_600:1106c26_4": "善勇猛！",
    "T07n0220_600:1106c27_0": "若一切法有可住者，應可示現此可執藏、此法常住，如來亦應安住諸法，示現諸法此可執藏、此可積集。",
    "T07n0220_600:1106c29_1": "善勇猛！",
    "T07n0220_600:1106c29_2": "以一切法不可安住、不可執藏、不可積集，是故無法是常住者。",
    "T07n0220_600:1107a02_0": "由此如來不安住法，亦不示現此可執藏、此可積集。",
    "T07n0220_600:1107a03_1": "善勇猛！",
    "T07n0220_600:1107a03_2": "無有少法是實可生，以無少法實可生故都無所住，故說諸法無可住義。",
    "T07n0220_600:1107a05_0": "善勇猛！",
    "T07n0220_600:1107a05_1": "以無所住及無不住為方便故，說一切法都無所住。",
    "T07n0220_600:1107a06_2": "「善勇猛！",
    "T07n0220_600:1107a06_3": "無有少法可說住者，如四大河無熱池出，未入大海終無住義。",
    "T07n0220_600:1107a07_4": "如是諸法乃至無造，諸行未盡終無住義。",
    "T07n0220_600:1107a08_5": "善勇猛！",
    "T07n0220_600:1107a09_6": "無造行者，謂於此中無住不住、無留難者，一切皆依俗數而說，實無有住、無留難者、無究竟者亦無不住。",
    "T07n0220_600:1107a11_7": "善勇猛！",
    "T07n0220_600:1107a11_8": "無造行者依俗數說，如諸有情世俗所見，非實有住或留難者、或究竟者亦無不住。",
    "T07n0220_600:1107a13_9": "非無造行有實住者，是故可言依俗數說，故一切法皆無住義。",
    "T07n0220_600:1107a15_0": "「善勇猛！",
    "T07n0220_600:1107a15_1": "如是菩薩摩訶薩眾，依一切法無住方便，修行般若波羅蜜多。",
    "T07n0220_600:1107a16_2": "善勇猛！",
    "T07n0220_600:1107a16_3": "若諸菩薩能如是行，速能圓滿一切智法，隣近無上正等菩提，疾能安坐妙菩提座，疾能證得一切智智，疾能圓滿三世智見，疾能圓滿一切有情心行差別，遍知妙智故。",
    "T07n0220_600:1107a21_0": "「善勇猛！",
    "T07n0220_600:1107a21_1": "若諸菩薩摩訶薩眾，欲普饒益一切有情，欲以財施一切有情皆令充足，欲以法施一切有情皆令願滿，欲能破壞一切有情無明卵[穀-禾+卵]，欲普授與一切有情大智佛智，欲普哀愍一切有情，欲普利樂一切有情，欲令一切有情豐足財施、法施，欲令一切有情豐足清淨尸羅，欲令一切有情豐足安忍柔和，欲令一切有情豐足勇猛精進，欲令一切有情豐足清白靜慮，欲令一切有情豐足微妙般若，欲令一切有情豐足究竟解脫，欲令一切有情豐足解脫智見，欲令一切有情豐足生諸善趣，欲令一切有情豐足明及解脫，欲令一切有情豐足畢竟涅槃，欲令一切有情豐足諸佛妙法，欲令一切有情豐足圓滿眾德，欲轉無上微妙法輪，一切世間沙門、梵志、天、魔、外道，皆無有能如法轉者。",
    "T07n0220_600:1107b07_2": "欲於世間宣說妙法，欲能如實記諸佛地，欲能如實記菩薩地，欲能如實記獨覺地，欲能如實記聲聞地，欲能覺發諸有情類本願善根，應學如是甚深般若波羅蜜多勇猛正勤常無間斷，應依如是甚深般若波羅蜜多精勤修學無所顧戀。",
    "T07n0220_600:1107b13_3": "「善勇猛！",
    "T07n0220_600:1107b13_4": "我都不見有諸餘法，能令菩薩速疾圓滿所求無上諸佛妙法，如此所說甚深般若波羅蜜多。",
    "T07n0220_600:1107b15_5": "若諸菩薩安住如是甚深般若波羅蜜多，精勤修學時無暫捨，速能圓滿一切智法。",
    "T07n0220_600:1107b17_6": "善勇猛！",
    "T07n0220_600:1107b17_7": "若諸菩薩修行般若波羅蜜多能至究竟，是諸菩薩隣近無上正等菩提定無疑惑。",
    "T07n0220_600:1107b19_8": "善勇猛！",
    "T07n0220_600:1107b19_9": "若善男子、善女人等聞此般若波羅蜜多，歡喜信受生實想者，我說彼類能引無上正等菩提，殊勝善根速至究竟。",
    "T07n0220_600:1107b22_10": "是善男子、善女人等攝受善根，定能積集大慧資糧。",
    "T07n0220_600:1107b23_11": "善勇猛！",
    "T07n0220_600:1107b23_12": "若諸菩薩手執如是甚深般若波羅蜜多方便善巧相應法教，是諸菩薩設不現前蒙佛受記，當知已近蒙佛受記，或復不久當蒙諸佛現前受記。",
    "T07n0220_600:1107b26_13": "「善勇猛！",
    "T07n0220_600:1107b27_14": "譬如有人精勤受學十善業道已至究竟，當知彼人善根成熟，已得隣近北俱盧生；如是菩薩若手執此甚深般若波羅蜜多，當知隣近所求無上正等菩提定無疑惑。",
    "T07n0220_600:1107b30_15": "「善勇猛！",
    "T07n0220_600:1107c01_16": "譬如有人樂行惠捨，於諸財寶無所顧悋，於諸有情常以布施、愛語、利行、同事攝受，持戒、修忍摧伏憍慢，修如是行至究竟時，速獲大財生於高族；如是菩薩若手得此甚深般若波羅蜜多，當知隣近不退轉位。",
    "T07n0220_600:1107c05_17": "「善勇猛！",
    "T07n0220_600:1107c05_18": "譬如有人樂修施、戒尸羅、安忍無不具足，慈愍有情勸持淨戒，復能造作感增上業，當知速獲轉輪王位；如是菩薩若手得此甚深般若波羅蜜多，當知速坐妙菩提座。",
    "T07n0220_600:1107c09_19": "「善勇猛！",
    "T07n0220_600:1107c09_20": "如轉輪王將登大位，於白半月十五日晨，沐浴受齋至大殿上，昇師子座面東而坐，有大輪寶從空而來，當知彼王受轉輪位，不久當得具足七寶；如是菩薩手中得此甚深般若波羅蜜多，當知速獲一切智智。",
    "T07n0220_600:1107c14_21": "「善勇猛！",
    "T07n0220_600:1107c14_22": "如有情類成勝善根，常樂修行清白之行，信解廣大，厭患人身，具淨尸羅，樂營眾事，其心長夜思願生天，與四洲人常為覆護，當知彼類不久得為四大天王護四洲界；如是菩薩若以般若波羅蜜多相應法教，施有情類心無悋惜，當知不久得為法王，於一切法皆得自在。",
    "T07n0220_600:1107c21_23": "「善勇猛！",
    "T07n0220_600:1107c21_24": "如有情類成勝善根，清淨過前所成就者，所獲財寶先惠施他後自受用，所營事務先為有情後方為己，常自守護不為非法不平等貪之所染污，其心長夜願為天主，於所修善其心堅固，當知彼類不久定生三十三天作天帝釋；如是菩薩若以般若波羅蜜多相應法要，施有情類無顧悋者，當知不久定作法王，於一切法得大自在。",
    "T07n0220_600:1107c29_25": "「善勇猛！",
    "T07n0220_600:1107c29_26": "譬如有人得四梵住，當知不久生於梵天；如是菩薩若以般若波羅蜜多相應法要，施有情類無顧悋者，當知不久轉妙法輪，施諸有情利益安樂。",
    "T07n0220_600:1108a03_27": "「善勇猛！",
    "T07n0220_600:1108a03_28": "譬如大地至雨際時，見上空中密雲含潤，天將昏闇漸降大雨，陂湖池沼處處充溢，大地原隰上下俱潤，密雲垂覆甘雨普洽，令諸藥物、卉木、叢林、枝葉、花果悉皆茂盛，水陸山川香氣芬馥，處處皆有花果泉池，大地于時甚可愛樂，人非人類見已歡娛，採摘花果嗅香甞味；如是菩薩現得般若波羅蜜多精勤修學，是諸菩薩當知不久一切智智之所潤沃，善能趣入一切智智，當能開顯一切智智，由斯潤洽一切有情，分別開示無上法寶。",
    "T07n0220_600:1108a14_29": "「善勇猛！",
    "T07n0220_600:1108a14_30": "譬如無熱龍王宮內，有情生已出四大河，各趣一方充滿大海；如是菩薩手中得此甚深般若波羅蜜多，復能於中精勤修學，彼皆能出大法流注，以大法施充足有情。",
    "T07n0220_600:1108a18_31": "「善勇猛！",
    "T07n0220_600:1108a18_32": "如眾鳥等依妙高山，形類雖殊而同一色；如是菩薩手中得此甚深般若波羅蜜多，信受修行皆同一趣，謂趣如來一切智趣。",
    "T07n0220_600:1108a21_33": "「善勇猛！",
    "T07n0220_600:1108a21_34": "譬如大海諸水依持，常為眾流之所歸趣；如是菩薩手中得此甚深般若波羅蜜多，精勤修學令極通利，不久當作一切法海，速疾當成一切法器，常為諸法之所歸趣，世俗諸法不能擾動。",
    "T07n0220_600:1108a25_35": "「善勇猛！",
    "T07n0220_600:1108a25_36": "如日輪舉蔽諸光明；如是菩薩所學般若波羅蜜多出現世間，一切外道悉皆隱沒。",
    "T07n0220_600:1108a27_37": "善勇猛！",
    "T07n0220_600:1108a28_0": "若諸菩薩所學般若波羅蜜多出現世間，與有情類作法明照。",
    "T07n0220_600:1108a29_1": "善勇猛！",
    "T07n0220_600:1108a29_2": "若諸菩薩出現世間，作諸有情善根明照，與有情類作淨福田；一切有情皆應供養，一切有情皆應歸趣，一切有情皆應稱讚。",
    "T07n0220_600:1108b04_0": "「復次，善勇猛！",
    "T07n0220_600:1108b04_1": "若諸菩薩能學般若波羅蜜多，於諸學中是最勝學，如是學者普為有情淨涅槃路。",
    "T07n0220_600:1108b06_2": "何以故？",
    "T07n0220_600:1108b06_3": "善勇猛！",
    "T07n0220_600:1108b06_4": "若學般若波羅蜜多，於諸學中最勝第一，為妙為微妙、為上為無上、無等無等等。",
    "T07n0220_600:1108b08_5": "善勇猛！",
    "T07n0220_600:1108b08_6": "若諸菩薩能學般若波羅蜜多，令一切學皆至究竟，普能受持一切所學，於一切學皆能開示，摧伏一切他論邪學。",
    "T07n0220_600:1108b11_7": "善勇猛！",
    "T07n0220_600:1108b11_8": "若諸菩薩能學般若波羅蜜多，則能修行三世諸佛、諸菩薩行。",
    "T07n0220_600:1108b12_9": "善勇猛！",
    "T07n0220_600:1108b13_0": "諸佛世尊於此所學甚深般若波羅蜜多，已、正、當學極善安住，為諸有情已、正、當說如是無上清淨學法。",
    "T07n0220_600:1108b15_1": "善勇猛！",
    "T07n0220_600:1108b15_2": "如是所學甚深般若波羅蜜多，超過一切世間所學最尊、最勝。",
    "T07n0220_600:1108b16_3": "善勇猛！",
    "T07n0220_600:1108b17_4": "如是所學甚深般若波羅蜜多，是自然學，一切世間無能及者。",
    "T07n0220_600:1108b18_5": "「善勇猛！",
    "T07n0220_600:1108b18_6": "若學般若波羅蜜多，於諸法中都無所學，謂若世間、若出世間，若有為、若無為，若有漏、若無漏，若有罪、若無罪，於如是等一切法門不生執著，於一切法無著而住，為諸有情無倒開示無上清淨所學之法。",
    "T07n0220_600:1108b23_7": "何以故？",
    "T07n0220_600:1108b23_8": "善勇猛！",
    "T07n0220_600:1108b23_9": "以一切法無著無縛，無有少法為著為縛而現在前，由此亦無得解脫義。",
    "T07n0220_600:1108b25_10": "「善勇猛！",
    "T07n0220_600:1108b25_11": "色無著無縛亦無解脫，受、想、行、識無著無縛亦無解脫，眼無著無縛亦無解脫，耳、鼻、舌、身、意無著無縛亦無解脫，色無著無縛亦無解脫，聲、香、味、觸、法無著無縛亦無解脫，眼識無著無縛亦無解脫，耳、鼻、舌、身、意識無著無縛亦無解脫，名、色無著無縛亦無解脫，顛倒、見趣、諸蓋、愛行無著無縛亦無解脫，貪、瞋、癡無著無縛亦無解脫，欲、色、無色界無著無縛亦無解脫，有情界、法界無著無縛亦無解脫，我、有情、命者、生者、養者、士夫、補特伽羅、意生、儒童、作者、受者、知者、見者及彼諸想無著無縛亦無解脫，地、水、火、風、空、識界無著無縛亦無解脫，緣起、染、淨無著無縛亦無解脫，布施、慳貪、持戒、犯戒、安忍、忿恚、精進、懈怠、靜慮、散亂、般若、惡慧無著無縛亦無解脫，苦、集、滅、道無著無縛亦無解脫，念住、正斷、神足、根、力、覺支、道支無著無縛亦無解脫，顛倒等斷無著無縛亦無解脫，靜慮、解脫、等持、等至無著無縛亦無解脫，無量、神通無著無縛亦無解脫，盡智、無生智、無造作智及無著智無著無縛亦無解脫，明及解脫、解脫智見無著無縛亦無解脫，異生、聲聞、獨覺、菩薩、佛地無著無縛亦無解脫，異生、聲聞、獨覺、菩薩、佛法無著無縛亦無解脫，生死、涅槃無著無縛亦無解脫，佛智、力、無畏等無著無縛亦無解脫，過去未來現在智見無著無縛亦無解脫。",
    "T07n0220_600:1108c22_12": "何以故？",
    "T07n0220_600:1108c22_13": "善勇猛！",
    "T07n0220_600:1108c22_14": "以一切法著不可得、縛不可得，著、縛既無，從彼解脫亦不可得。",
    "T07n0220_600:1108c24_0": "「善勇猛！",
    "T07n0220_600:1108c24_1": "言著縛者，謂於法性執著繫縛。",
    "T07n0220_600:1108c24_2": "法性既無，故不可說有著有縛。",
    "T07n0220_600:1108c25_3": "言解脫者，謂脫著、縛，彼二既無故無解脫。",
    "T07n0220_600:1108c26_4": "善勇猛！",
    "T07n0220_600:1108c26_5": "無解脫者，謂於諸法都無有能得解脫性，若於諸法能如是見，即說名為無著智見。",
    "T07n0220_600:1108c28_6": "善勇猛！",
    "T07n0220_600:1108c28_7": "言無著者，謂於此中著不可得。",
    "T07n0220_600:1108c29_8": "著無著性，著無實性，故名無著。",
    "T07n0220_600:1109a01_9": "以於此中能著、所著、由此、為此、因此、屬此皆不可得，故名無著。",
    "T07n0220_600:1109a02_10": "善勇猛！",
    "T07n0220_600:1109a02_11": "言無縛者，謂於此中縛不可得。",
    "T07n0220_600:1109a03_12": "縛無縛性，縛無實性，故名無縛。",
    "T07n0220_600:1109a04_13": "以於此中能縛、所縛、由此、為此、因此、屬此皆不可得，故名無縛。",
    "T07n0220_600:1109a05_14": "「善勇猛！",
    "T07n0220_600:1109a05_15": "若於諸法無著無縛，如何於法可說解脫？",
    "T07n0220_600:1109a06_16": "善勇猛！",
    "T07n0220_600:1109a07_17": "無著無縛亦無解脫，離繫清涼名真解脫。",
    "T07n0220_600:1109a08_0": "善勇猛！",
    "T07n0220_600:1109a08_1": "若於諸法無執著者則無繫縛，若於諸法無繫著者則無解脫，遠離三事離繫清涼名真解脫。",
    "T07n0220_600:1109a10_2": "善勇猛！",
    "T07n0220_600:1109a10_3": "如是菩薩悟入諸法無著無縛亦無解脫，得真智見修行般若波羅蜜多。",
    "T07n0220_600:1109a12_4": "善勇猛！",
    "T07n0220_600:1109a12_5": "若諸菩薩能如是行，隣近無上正等菩提，速能證得一切智智。",
    "T07n0220_600:1109a13_6": "「善勇猛！",
    "T07n0220_600:1109a13_7": "我以如是甚深般若波羅蜜多微妙法印，印諸菩薩摩訶薩眾，令斷疑網，精勤修學甚深般若波羅蜜多速至究竟。",
    "T07n0220_600:1109a16_8": "善勇猛！",
    "T07n0220_600:1109a16_9": "我今自持如是法印，令久住世利樂有情。",
    "T07n0220_600:1109a17_10": "所以者何？",
    "T07n0220_600:1109a17_11": "我聲聞眾無勝神力，能持般若波羅蜜多微妙法印，至我滅後後時、後分、後五百歲，饒益有情。」",
    "T07n0220_600:1109a20_0": "爾時，世尊告賢守菩薩、導師菩薩等五百上首菩薩及善勇猛菩薩摩訶薩言：「善男子！",
    "T07n0220_600:1109a21_1": "汝等應學如是如來無量無數百千俱胝那庾多劫，曾所修集甚深般若波羅蜜多而為上首。",
    "T07n0220_600:1109a23_2": "甚深般若波羅蜜多之所流出，甚深般若波羅蜜多之所建立無上法藏，汝等應持如是法藏，我涅槃後後時、後分、後五百歲，無上正法將欲壞滅時、分轉時，廣為有情宣說開示，令彼聞已獲大利樂。」",
    "T07n0220_600:1109a28_3": "時，諸菩薩聞佛語已，皆從座起頂禮佛足，合掌恭敬俱白佛言：「世尊！",
    "T07n0220_600:1109b01_0": "我等當學如是如來無量無數百千俱胝那庾多劫，曾所修集甚深般若波羅蜜多而為上首。",
    "T07n0220_600:1109b03_1": "甚深般若波羅蜜多之所流出，甚深般若波羅蜜多之所建立無上法藏，我等當持如是法藏，佛涅槃後後時、後分、後五百歲，無上正法將欲壞滅時、分轉時，廣為有情宣說開示，令彼聞已獲大利樂。",
    "T07n0220_600:1109b07_2": "「世尊！",
    "T07n0220_600:1109b07_3": "當於彼時，有大恐怖、有大險難、有大暴惡。",
    "T07n0220_600:1109b08_4": "當於彼時，諸有情類多分成就感匱法業，心多貪欲，不平等貪及非法貪之所染污，慳悋、嫉妬纏縛其心，多忿、凶勃、好麁惡語，諂曲、矯誑、樂行非法，多懷輕蔑、鬪訟相違，住不律儀、耽嗜所蔽，懈怠增上、精進下劣，忘失正念、住不正知，口強喙長、偃蹇憍慠，憙行惡業，隱覆內心，貪恚癡增、善根薄少，為無明[穀-禾+卵]之所闇蔽，諸有所行皆順魔黨，與深法律恒作怨害，於法寶藏常為大賊，稟性弊惡難可親附。",
    "T07n0220_600:1109b17_5": "「世尊！",
    "T07n0220_600:1109b17_6": "我等今者決定能持如是如來無量無數百千俱胝那庾多劫善根所集無上法藏，與彼有情作大饒益。",
    "T07n0220_600:1109b20_7": "世尊！",
    "T07n0220_600:1109b20_8": "彼時當有少分有情，於斯法藏勤求樂學，彼性質直無諂無誑，寧捨身命不作法怨，於法亦無誹謗厭背。",
    "T07n0220_600:1109b22_9": "我與彼類當作饒益，於此深法示現、勸導、讚勵、慶喜，令勤修學。」",
    "T07n0220_600:1109b24_10": "爾時，世尊即以神力，護持般若波羅蜜多微妙甚深無上法藏，令惡魔眾不能壞滅。",
    "T07n0220_600:1109b25_11": "復以威力，護能受持精進修行此法藏者，令斷魔羂蕭然解脫，於所修行速至究竟。",
    "T07n0220_600:1109b27_12": "佛時微笑放大光明，普照三千大千世界。",
    "T07n0220_600:1109b28_13": "人中、天上兩處有情，因佛光明互得相見。",
    "T07n0220_600:1109b29_14": "時，此眾會天、龍、藥叉、健達縛、阿素洛、揭路茶、緊捺洛、莫呼洛伽及餘神眾，皆持種種天妙華香，奉散世尊而為供養，復發廣大讚詠聲言：「甚奇！",
    "T07n0220_600:1109c04_0": "如來！",
    "T07n0220_600:1109c04_1": "大威神力！",
    "T07n0220_600:1109c04_2": "護持法藏及修行者，令惡魔軍不能壞滅，斷諸魔羂得大自在，於所修行速至究竟。",
    "T07n0220_600:1109c06_3": "若有淨信諸善男子、善女人等，於此法門受持、讀誦、為他廣說，不復怖畏諸惡魔軍。",
    "T07n0220_600:1109c08_4": "若諸菩薩於此法門受持、讀誦、為他廣說，便能降伏諸惡魔軍，一切惡魔不能留難。」",
    "T07n0220_600:1109c10_5": "爾時，佛告善勇猛言：「如是！",
    "T07n0220_600:1109c10_6": "如是！",
    "T07n0220_600:1109c10_7": "如天等說。",
    "T07n0220_600:1109c11_8": "善勇猛！",
    "T07n0220_600:1109c11_9": "如來於此無上法門，為諸惡魔已結壃界，令惡魔眾所有羂網於此法門不能為礙。",
    "T07n0220_600:1109c13_10": "善勇猛！",
    "T07n0220_600:1109c13_11": "如來今者依此法門，摧諸惡魔所有勢力。",
    "T07n0220_600:1109c14_12": "善勇猛！",
    "T07n0220_600:1109c14_13": "如來今者護此法門，制諸惡魔令不侵損。",
    "T07n0220_600:1109c15_14": "善勇猛！",
    "T07n0220_600:1109c15_15": "若有淨信諸善男子、善女人等，於此法門受持、讀誦、廣為他說，一切惡魔不能擾亂，而能降伏諸惡魔怨。",
    "T07n0220_600:1109c18_16": "若諸菩薩於此法門受持、讀誦、廣為他說，普能降伏一切魔軍，施諸有情利益安樂。",
    "T07n0220_600:1109c20_0": "「善勇猛！",
    "T07n0220_600:1109c20_1": "如是法門非諸雜染弊有情類手所能得。",
    "T07n0220_600:1109c21_2": "善勇猛！",
    "T07n0220_600:1109c21_3": "如是法門非魔羂網所拘縶者之所行地。",
    "T07n0220_600:1109c22_4": "善勇猛！",
    "T07n0220_600:1109c22_5": "如是法門是性調善極聰慧者之所行地。",
    "T07n0220_600:1109c23_6": "「善勇猛！",
    "T07n0220_600:1109c23_7": "如極調柔聰慧象馬，非小王等之所乘御，亦非出現於弊惡時，唯為輪王之所受用；由斯出現於彼世時，如是調柔極聰慧者，方能受用此深法門故，此法門乃墮其手。",
    "T07n0220_600:1109c27_8": "「善勇猛！",
    "T07n0220_600:1109c27_9": "譬如齋戒龍王、善住龍王、哀羅筏拏龍王，彼不為人之所受用及為見故而現在前，亦復不為諸餘天眾所受用故而現在前，唯為調善聰慧天眾所受用故而現前也！",
    "T07n0220_600:1110a02_10": "如如帝釋思與天眾往遊戲處嚴飾之時，如是如是彼龍現作如是相狀來現其前，為天帝等所受用故。",
    "T07n0220_600:1110a04_11": "如是若有善士人帝乃能受用此深法門，謂能聽聞、受持、讀誦，為有情類宣示分別。",
    "T07n0220_600:1110a06_12": "彼於此法為大莊嚴，能大流通，作大法照，成大法喜，受大法樂。",
    "T07n0220_600:1110a08_13": "「善勇猛！",
    "T07n0220_600:1110a08_14": "若於般若波羅蜜多甚深法門，受持一句，尚獲無量無邊功德，況有於此大般若經，能具受持、轉讀、書寫、供養、流布、廣為他說，彼所獲福不可思議！",
    "T07n0220_600:1110a11_15": "善勇猛！",
    "T07n0220_600:1110a11_16": "唯性調柔極聰慧者，乃能攝受如是法門，若不調柔極聰慧者，此甚深法非其境界。",
    "T07n0220_600:1110a13_17": "善勇猛！",
    "T07n0220_600:1110a13_18": "我為有情斷諸疑惑，故說如是大般若經。」",
    "T07n0220_600:1110a14_19": "說此法時，無量無數菩薩摩訶薩得無生法忍，復有無邊諸有情類皆發無上正等覺心。",
    "T07n0220_600:1110a16_20": "爾時，如來記彼決定當證無上正等菩提。",
    "T07n0220_600:1110a17_21": "時，薄伽梵說是經已，善勇猛等諸大菩薩及餘四眾，天、龍、藥叉、健達縛、阿素洛、揭路茶、緊捺洛、莫呼洛伽、人非人等一切大眾，聞佛所說皆大歡喜、信受奉行。",
    "T07n0220_600:1110a22_0": "大般若波羅蜜多經卷第六百",
    "T07n0220_600:1110a25_0": "般若佛姆心呪",
    "T07n0220_600:1110a26_0": "ta怛　dya耶　thā他　oṃ唵　ga伽　te帝ga伽　te帝　pa鉢　ra囉　ga伽　te帝pa鉢　ra囉　saṃ僧　ga伽　te帝　bo菩dhi提　svā薩嚩　hā訶般若佛姆親心呪oṃ唵　pra鉢囉　jñā娘　pra鉢囉　jñā娘ma摩　hā訶　pra鉢囉　jñā娘　svā娑嚩hā訶"
}