{
    "T14n0489_001:0704b03_0": "佛說除蓋障菩薩所問經卷第一",
    "T14n0489_001:0704b05_0": "西天譯經三藏朝散大夫試鴻臚少",
    "T14n0489_001:0704b06_0": "卿傳梵大師賜紫沙門臣法護等",
    "T14n0489_001:0704b07_0": "奉　詔譯",
    "T14n0489_001:0704b08_0": "如是我聞：一時，佛在象頭山中，與大苾芻眾七萬二千人俱，皆是阿羅漢——諸漏已盡無復煩惱，心善解脫慧善解脫，如大龍王諸有所作悉已成辦，釋諸重擔逮得己利，盡諸有結，正智妙心俱得解脫，諸心自在到勝彼岸，善入法界建立法幢，心能棄捨一切利養，正善出家極善具圓，滿足諸願住涅槃道——唯一補特伽羅現居學地，所謂尊者阿難。",
    "T14n0489_001:0704b15_1": "諸菩薩摩訶薩八萬四千人，皆是一生補處——獲諸總持得一切智，現前趣向一切智，漸入一切智，增廣一切智，得無礙總持諸三摩地；復能安住首楞嚴王妙三摩地，具大神通遊戲自在，履輕安道，離諸所起一切障累，大慈大悲廣遍十方一切世界，超越無邊一切佛剎，通達空行及無相行諸願離著，勤劬發起一切有情利益勝行，善入一切佛之境界；心如虛空具無邊智，心如大海深無涯底，心如須彌山王堅固不動，心如蓮華離諸染著，心如妙寶極善清淨，心如真金精鍊瑩潔——其名曰寶星菩薩摩訶薩、寶手菩薩摩訶薩、寶印手菩薩摩訶薩、寶冠菩薩摩訶薩、寶髻菩薩摩訶薩、寶峯菩薩摩訶薩、寶積菩薩摩訶薩、寶頂菩薩摩訶薩、寶幢菩薩摩訶薩、金剛藏菩薩摩訶薩、金藏菩薩摩訶薩、寶藏菩薩摩訶薩、吉祥藏菩薩摩訶薩、淨藏菩薩摩訶薩、淨無垢藏菩薩摩訶薩、如來藏菩薩摩訶薩、智藏菩薩摩訶薩、日藏菩薩摩訶薩、等持藏菩薩摩訶薩、蓮華藏菩薩摩訶薩、解脫月菩薩摩訶薩、普月菩薩摩訶薩、普賢菩薩摩訶薩、觀自在菩薩摩訶薩、得大勢菩薩摩訶薩、普光菩薩摩訶薩、普眼菩薩摩訶薩、蓮華眼菩薩摩訶薩、廣眼菩薩摩訶薩、普威儀道菩薩摩訶薩、普嚴相菩薩摩訶薩、普戒慧菩薩摩訶薩、智慧菩薩摩訶薩、法慧菩薩摩訶薩、勝慧菩薩摩訶薩、上慧菩薩摩訶薩、金剛慧菩薩摩訶薩、最勝慧菩薩摩訶薩、師子慧菩薩摩訶薩、師子遊戲菩薩摩訶薩、大音聲王菩薩摩訶薩、師子吼聲菩薩摩訶薩、震吼深妙音聲菩薩摩訶薩、無染著菩薩摩訶薩、離諸垢菩薩摩訶薩、月光菩薩摩訶薩、日光菩薩摩訶薩、智光菩薩摩訶薩、智吉祥菩薩摩訶薩、賢吉祥菩薩摩訶薩、月吉祥菩薩摩訶薩、蓮華吉祥菩薩摩訶薩、寶吉祥菩薩摩訶薩、妙吉祥童真菩薩摩訶薩，如是等諸菩薩眾而為上首。",
    "T14n0489_001:0704c24_0": "復有賢護等十六大士，慈氏等賢劫中一切菩薩摩訶薩眾。",
    "T14n0489_001:0704c26_0": "四大王天主等四大王天諸天子眾、帝釋天主等忉利天中諸天子眾、須夜摩天主等夜摩天中諸天子眾、兜率陀天主等兜率陀天諸天子眾、善變化天主等化樂天中諸天子眾、他化自在天主等他化自在天中諸天子眾、導師等善分魔王子眾、大梵天主等梵眾天中諸天子眾、大自在天主等五淨居天諸天子眾，毘摩質多羅阿修羅王、大力阿修羅王、羅睺阿修羅王等無數百千阿修羅眾，阿那婆達多大龍王、摩那斯大龍王、娑伽羅大龍王、阿難多大龍王、嚩蘇枳大龍王等無數百千龍王之眾，吉祥威光龍王子等、無數百千龍王之子并諸龍女，及餘無數百千天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人、非人等大眾集會。",
    "T14n0489_001:0705a11_1": "時，象頭山遍四方面四由旬內，天人大眾充滿虛空，乃至無有一毛端量極微塵量之所空缺。",
    "T14n0489_001:0705a13_2": "於如是等天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人、非人等眾會中間，敷佛所坐妙師子座。",
    "T14n0489_001:0705a16_3": "其座高一由旬，縱廣正等各半由旬，嚴設無數百千天妙寶衣，寶鈴寶網張設幰蓋彌覆其上。",
    "T14n0489_001:0705a18_4": "復有無數百千天妙繒帛，周匝垂掛，散真珠華及諸妙華。",
    "T14n0489_001:0705a19_5": "又師子座周匝地方皆是金剛所成，嚴飾殊妙地平如掌，柔軟清淨妙香芬馥，無數百千天妙寶華散布其地。",
    "T14n0489_001:0705a22_6": "復有蓮華大若車輪，無數百千黃金為葉，瑠璃為莖，帝青為臺，馬腦為鬚，妙香可愛適悅快樂，如是莊嚴佛所受用。",
    "T14n0489_001:0705a24_7": "又復師子之座，於其四隅不近不遠，有四寶樹而極聳拔，高半由旬，周廣盤欝三俱盧舍。",
    "T14n0489_001:0705a27_0": "爾時，世尊在大眾中處師子座，以極淨慧轉妙法輪，摧伏魔軍不染世法，作師子吼明煥無畏。",
    "T14n0489_001:0705a29_1": "猶如大池清淨無雜，又如大海廣積妙寶深無涯底，如須彌山王高出眾山，如日光明威耀赫奕，如滿月輪人所愛樂，如大龍王能雨法雨，如大梵王世間最上。",
    "T14n0489_001:0705b03_2": "而佛世尊與無數百千俱胝那庾多梵王、護世等無邊善調伏者弟子眾俱，是時大眾一心誠諦瞻仰世尊。",
    "T14n0489_001:0705b07_0": "爾時，世尊先以常光照諸大眾，於常光中復從頂上放大光明，其名普照，是光復有無數百千光明眷屬，其光即於十方一切世界普照耀已，旋環佛所右繞三匝，復從世尊口門而入。",
    "T14n0489_001:0705b11_1": "而佛世尊口門之相悉無動靜，譬如日月光明悉從虛空界入，而虛空界亦無動靜；佛之光明口門入時，無動靜相亦復如是。",
    "T14n0489_001:0705b13_2": "又如積以乾沙投之酥油，或投以水，彼等入時悉無動靜；佛之光明口門入時，無動靜相亦復如是。",
    "T14n0489_001:0705b17_0": "爾時，東方去此佛剎過殑伽沙數等世界，有世界名大蓮華，其中有佛號蓮華眼如來、應供、正等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，為諸菩薩宣說法要。",
    "T14n0489_001:0705b20_1": "彼所說法唯以一乘發起利益，彼佛剎中無有聲聞緣覺名字，況復聲聞緣覺乘法？",
    "T14n0489_001:0705b22_2": "又彼世界有情皆修菩薩行法，得不退轉於阿耨多羅三藐三菩提。",
    "T14n0489_001:0705b24_3": "又彼世界，不以飲食而為資養，彼諸菩薩悉以等持靜慮法喜為食。",
    "T14n0489_001:0705b25_4": "又彼世界，不以日月星宿而為照明，皆彼如來身光普照而悉清淨。",
    "T14n0489_001:0705b27_5": "又復其土，無諸草木沙礫土石山等，地平如掌。",
    "T14n0489_001:0705b28_6": "彼有菩薩摩訶薩名除蓋障，獨止一處，若諸有情聞是菩薩名者，一切障累悉得蠲除。",
    "T14n0489_001:0705c02_0": "是時，除蓋障菩薩摩訶薩蒙佛光明之所照觸，離自所止詣彼佛所，到已頭面禮佛雙足退住一面；并餘菩薩各各蒙光所照觸已悉離所止，咸來詣彼世尊蓮華眼如來所，到已，頭面各禮佛足，退住一面。",
    "T14n0489_001:0705c07_0": "爾時，除蓋障菩薩摩訶薩即從座起，偏袒右肩，右膝著於蓮華臺上，合掌頂禮，白其佛言：「世尊！",
    "T14n0489_001:0705c09_1": "何故有是光明，極善無垢清淨悅意，使諸有情蒙光照者身心調暢？」",
    "T14n0489_001:0705c11_0": "爾時，蓮華眼如來告除蓋障菩薩摩訶薩言：「善男子！",
    "T14n0489_001:0705c12_1": "西方去此佛剎過殑伽沙數等世界，有世界名娑婆，其中有佛，號釋迦牟尼如來、應供、正等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
    "T14n0489_001:0705c15_2": "若諸有情聞彼如來名字之者，悉得不退轉於阿耨多羅三藐三菩提，是彼如來所現此光明。」",
    "T14n0489_001:0705c17_3": "即時除蓋障菩薩摩訶薩復白佛言：「世尊！",
    "T14n0489_001:0705c18_4": "何因何緣而諸有情聞彼如來名字之者，悉得不退轉於阿耨多羅三藐三菩提？」",
    "T14n0489_001:0705c20_5": "蓮華眼如來告除蓋障菩薩摩訶薩言：「善男子！",
    "T14n0489_001:0705c21_6": "彼佛如來往昔修行菩薩道時，發是願言：『願我當來成正覺已，一切有情聞我名者，悉得不退轉於阿耨多羅三藐三菩提。』」",
    "T14n0489_001:0705c24_7": "除蓋障菩薩言：「云何？",
    "T14n0489_001:0705c24_8": "世尊！",
    "T14n0489_001:0705c24_9": "彼世界中一切有情悉得不退轉邪？」",
    "T14n0489_001:0705c25_10": "佛言：「不也。",
    "T14n0489_001:0705c25_11": "善男子！」",
    "T14n0489_001:0705c26_12": "除蓋障菩薩言：「云何？",
    "T14n0489_001:0705c26_13": "世尊！",
    "T14n0489_001:0705c26_14": "若然者，亦有有情不聞彼佛名邪？」",
    "T14n0489_001:0705c27_15": "佛言：「善男子！",
    "T14n0489_001:0705c27_16": "一切皆聞。」",
    "T14n0489_001:0705c27_17": "除蓋障菩薩言：「若皆聞者，何故乃有不得不退轉者？」",
    "T14n0489_001:0705c29_18": "佛言：「善男子！",
    "T14n0489_001:0705c29_19": "所言一切不退轉，亦非一切不退轉。」",
    "T14n0489_001:0706a01_20": "除蓋障菩薩言：「如佛所說，一切不退轉，亦非一切不退轉。",
    "T14n0489_001:0706a02_21": "其義云何？」",
    "T14n0489_001:0706a02_22": "佛言：「善男子！",
    "T14n0489_001:0706a03_23": "若有有情得聞如來名字，生起不退轉種子者，我說斯等有情得不退轉；非是得聞如來名字，俱時皆得不退轉地。",
    "T14n0489_001:0706a05_24": "「善男子！",
    "T14n0489_001:0706a05_25": "我今復說譬喻以成斯義。",
    "T14n0489_001:0706a06_26": "譬如有樹初植種子，而其種子離諸過失，後以諸緣得生牙莖，乃至滋長果實成結。",
    "T14n0489_001:0706a08_27": "善男子！",
    "T14n0489_001:0706a08_28": "彼樹何故但說種子？」",
    "T14n0489_001:0706a08_29": "除蓋障菩薩言：「世尊！",
    "T14n0489_001:0706a09_30": "由其種子離諸過失，乃至果實成辦，故說種子。」",
    "T14n0489_001:0706a10_31": "佛言：「善男子！",
    "T14n0489_001:0706a10_32": "得不退轉有情亦復如是，由彼纔聞如來名字之時，不退轉種子生起具足，而其有情即於阿耨多羅三藐三菩提得不退轉。」",
    "T14n0489_001:0706a14_0": "爾時，除蓋障菩薩摩訶薩白蓮華眼如來言：「世尊！",
    "T14n0489_001:0706a15_1": "我今欲往娑婆世界，瞻覩世尊釋迦牟尼如來、應供、正等正覺，禮奉親近尊重供養。」",
    "T14n0489_001:0706a17_0": "於是蓮華眼如來告除蓋障菩薩言：「善男子！",
    "T14n0489_001:0706a18_0": "汝當可往，今正是時。」",
    "T14n0489_001:0706a18_1": "餘諸菩薩俱白蓮華眼如來言：「世尊！",
    "T14n0489_001:0706a19_2": "我等亦欲往詣娑婆世界，瞻覩世尊釋迦牟尼如來、應供、正等正覺，禮奉親近尊重供養。」",
    "T14n0489_001:0706a21_3": "時彼世尊告諸菩薩言：「善男子！",
    "T14n0489_001:0706a22_0": "汝等可往，今正是時。",
    "T14n0489_001:0706a22_1": "然汝往彼世界，勿生放逸。",
    "T14n0489_001:0706a23_2": "何以故？",
    "T14n0489_001:0706a23_3": "彼世界中諸有情類極貪瞋癡，無沙門婆羅門父母之想，非法欲行，暴惡麁獷，口出惡言，高倨輕慢，染著懈怠，破戒造惡，慳嫉增盛，如是多種煩惱隨煩惱等。",
    "T14n0489_001:0706a26_4": "彼佛世尊，於如是等惡有情中而為說法。」",
    "T14n0489_001:0706a27_5": "彼諸菩薩白其佛言：「世尊！",
    "T14n0489_001:0706a28_6": "彼佛如來難行能行，於如是等惡有情中能為說法。」",
    "T14n0489_001:0706a29_7": "佛言：「諸善男子！",
    "T14n0489_001:0706a29_8": "如是，如是。",
    "T14n0489_001:0706b01_9": "彼佛如來難行能行，惡有情中能為說法。",
    "T14n0489_001:0706b02_10": "又，善男子！",
    "T14n0489_001:0706b02_11": "彼諸有情亦復如是，難行能行，於彼雜染世界之中，能起一善心者斯為極難。",
    "T14n0489_001:0706b04_12": "何以故？",
    "T14n0489_001:0706b04_13": "若清淨世界中，清淨有情發起善心豈為希有？",
    "T14n0489_001:0706b05_14": "雜染世界之中能起善行者極為希有，能於一彈指頃發淨信心，一彈指頃能歸依佛及法僧寶，一彈指頃修持淨戒，一彈指頃離貪著心，一彈指頃起悲愍意發阿耨多羅三藐三菩提心，極為希有。」",
    "T14n0489_001:0706b09_15": "諸菩薩言：「希有世界！",
    "T14n0489_001:0706b10_16": "希有善逝！」",
    "T14n0489_001:0706b11_0": "爾時，除蓋障菩薩摩訶薩等諸菩薩眾，咸歎：「善哉！",
    "T14n0489_001:0706b12_1": "於彼佛所，如其行相，聞佛所言，順佛教勅。」",
    "T14n0489_001:0706b13_2": "各各頭面禮佛足已，從佛會出，俱時往詣娑婆世界。",
    "T14n0489_001:0706b14_3": "於世尊釋迦牟尼佛所，作供養事，或有化現諸寶樹者，枝幹傭圓色相榮茂，華果具足。",
    "T14n0489_001:0706b16_4": "或現瑠璃寶樹，或現頗胝迦樹，或現劫樹，或真金樹，或眾華樹，或眾果樹，或現妙寶衣雲，或莊嚴雲，或塗香雲，或寶鬘雲，或妙蓋雲，或末香雲，或鼓樂雲，如其所應各化現已，咸悉萃集前導除蓋障菩薩摩訶薩等諸菩薩眾，來詣娑婆世界。",
    "T14n0489_001:0706b22_0": "爾時，除蓋障菩薩摩訶薩告諸菩薩言：「仁者！",
    "T14n0489_001:0706b23_0": "彼娑婆世界諸有情等苦之深重，仁等宜應隨其神力善化而往，使彼有情得勝妙樂。」",
    "T14n0489_001:0706b24_1": "時諸菩薩聞是語已，如教而行。",
    "T14n0489_001:0706b26_0": "爾時，除蓋障菩薩摩訶薩如其色相，以自神力作諸化事，即從身中放大光明，善妙無垢清淨適悅，使諸有情蒙光照者身心調暢。",
    "T14n0489_001:0706b28_1": "是光普遍廣照於此三千大千世界，而此三千大千世界之中，所有地獄餓鬼畜生等趣，諸有情類蒙光照觸，皆得離苦息恚害心，互相皆起父母之想。",
    "T14n0489_001:0706c03_2": "又此三千大千世界之中，幽隱暗暝，日月光明所不照處是光普照，所有日月具大神力，有大威德自在照耀，為此光明映蔽不現，悉無焰赫光耀之用。",
    "T14n0489_001:0706c06_3": "又此三千大千世界光明普照，其中所生諸有情類互得相見。",
    "T14n0489_001:0706c08_4": "又此三千大千世界，諸鐵圍山、大鐵圍山、目真隣陀山、摩訶目真隣陀山、寶山、黑山及諸山等，其光普照，上至梵世下至阿鼻大地獄，於其中間一切方分而無光明所不照處。",
    "T14n0489_001:0706c13_0": "爾時，諸菩薩眾隨彼色相如其所應，亦以神力作諸化事，令諸有情須食者得食，須飲者得飲，須衣者得衣，須輦輿者得輦輿，須財者得財，盲者能視，聾者能聽，裸者得覆，迷亂之者還得正念，苦者得樂，諸懷妊者產生無難。",
    "T14n0489_001:0706c18_0": "佛說除蓋障菩薩所問經卷第一"
}