{
    "T15n0634_001:0474c13_0": "佛說大乘智印經卷第一",
    "T15n0634_001:0474c15_0": "西天三藏寶法大師賜紫沙門",
    "T15n0634_001:0474c16_0": "智吉祥等奉　詔譯",
    "T15n0634_001:0474c17_0": "如是我聞：一時世尊入王舍大城，次第乞食，受施充足，還迦蘭陀林。",
    "T15n0634_001:0474c18_1": "食時食已，結跏趺坐，與大比丘眾及諸菩薩百萬人俱，歡喜圍繞。",
    "T15n0634_001:0474c20_0": "是諸大眾皆得陀羅尼平等無礙，心悟總持，得三摩地，安住空性、無相、無願、解脫法門，具足無量殊勝功德，言議、思惟皆不可及。",
    "T15n0634_001:0474c22_1": "為眾所知、為眾所識，寂靜安住如是法門，於諸分別悉皆平等，不隨世間眾所好樂，了知眾生差別識性，於一切時所知善惡，離諸憎愛，一味平等。",
    "T15n0634_001:0474c26_2": "爾時世尊忽於眉間放大光明，是諸眾會咸皆悚慄，肅恭合掌，瞻仰如來，目不暫捨。",
    "T15n0634_001:0474c28_3": "世尊告言：「汝等應當繫心思惟，安住如來所知境界，於我、我所，好惡、分別，悉皆遠離。",
    "T15n0634_001:0474c29_4": "若於自身毀譽等觀苦樂一切，審知眾生由染污緣受差別相，遊處好樂，晝夜不捨，以方便力悉使斷除。",
    "T15n0634_001:0475a03_5": "觀諸眾生種種造作諸不善業，隨順他教，競共馳逐，與諸同分安處動作無義利業。",
    "T15n0634_001:0475a05_6": "斯由有情識心愚昧，於真實境無所了知；失勝善心；逐惡朋友；不解、思惟深遠勝法；真實義諦起諸分別謂為真實；無揀擇慧；闕定信心；於佛言教及眾妙行不生好樂；設復修善，無應正理；著有、著空互為究竟。",
    "T15n0634_001:0475a09_7": "我以如來智印三摩地力悉能了知。",
    "T15n0634_001:0475a10_8": "汝等應當於是有情深心憐愍。」",
    "T15n0634_001:0475a11_9": "是諸大眾聞如是說，讚歎如來勝定功力，悉能了知如是差別。",
    "T15n0634_001:0475a12_10": "爾時世尊作是語已，乃入如來智印三摩地。",
    "T15n0634_001:0475a13_11": "是諸大眾覩佛如來入是勝定，於佛身相及種種相，一切眾會忽皆不見，不能了知；如來所著法衣及近身衣亦復不見，不能了知；如來所有四威儀相乃至一切動轉之相，皆不可見，不能了知；如來所有音聲差別不能聽聞，不能了知。",
    "T15n0634_001:0475a19_12": "所以者何？",
    "T15n0634_001:0475a19_13": "以是安住如是智印三摩地勝功德力，心無動轉，不可測量故。",
    "T15n0634_001:0475a20_14": "復次如來由勝定力，於諸外境種種莊嚴，一切眾會皆不可見，不能了知；於諸所住清淨國土，皆不得見，不能了知。",
    "T15n0634_001:0475a23_15": "所以者何？",
    "T15n0634_001:0475a23_16": "以是安住如來智印三摩地勝功德力，心無動轉，不可測量故。",
    "T15n0634_001:0475a25_0": "爾時大眾於佛形相既無所見，各各稱讚勝定功德。",
    "T15n0634_001:0475a26_1": "承佛威力，深心所求離諸怖畏。",
    "T15n0634_001:0475a26_2": "爾時如來復於定中放大光明，遍照三千大千世界。",
    "T15n0634_001:0475a28_3": "其間所有日月、星辰、電火、藥珠種種光明悉皆掩蔽。",
    "T15n0634_001:0475a29_4": "復於定中發生異香。",
    "T15n0634_001:0475a29_5": "其香微妙，不與世間栴檀、沈水諸香為比。",
    "T15n0634_001:0475b01_6": "是時色、無色天、梵王帝釋，及諸天人、四眾、八部、大鐵圍山、小鐵圍山及須彌山眾山之王、水陸空界幽暗之處，一切有情咸覩光明，歎未曾有。",
    "T15n0634_001:0475b04_7": "各尋是光至迦蘭陀林。",
    "T15n0634_001:0475b05_8": "各隨所有，香、華、衣服、寶冠、瓔珞以為供養。",
    "T15n0634_001:0475b06_9": "見是會中諸大菩薩及聲聞眾，如大池中蓮華開敷，異香芬馥集在眾會。",
    "T15n0634_001:0475b07_10": "時諸人天聞是香已，各各皆得智慧明了。",
    "T15n0634_001:0475b08_11": "復於空中有寶瓔珞、上妙衣服，處處垂下，嚴飾供養。",
    "T15n0634_001:0475b10_12": "時諸大眾咸皆歡喜，恭敬禮拜，退坐一面。",
    "T15n0634_001:0475b11_0": "爾時東方如一酤胝殑伽沙數，一一沙數為一酤胝，爾所國土一切如來皆是釋迦分身化利。",
    "T15n0634_001:0475b13_1": "如是如來各集眾會，菩薩摩訶薩阿僧祇數不可稱量。",
    "T15n0634_001:0475b14_2": "是諸菩薩悟證平等，當得阿耨多羅三藐三菩提，諸身色相微妙具足，人天眾會皆無與等。",
    "T15n0634_001:0475b16_3": "爾時一切分身如來各各告語諸菩薩言：「善男子！",
    "T15n0634_001:0475b17_4": "娑婆世界有佛世尊，號釋迦牟尼，應、正等覺，出現於世，化諸有情離眾罪垢。",
    "T15n0634_001:0475b19_5": "經無量時演說正法，示佛知見，甚深難解。",
    "T15n0634_001:0475b20_6": "有陀羅尼門，名如來智印三摩地三摩鉢提，我今為汝略而讚說。",
    "T15n0634_001:0475b21_7": "諸善男子！",
    "T15n0634_001:0475b21_8": "汝等諦聽！",
    "T15n0634_001:0475b22_9": "諸菩薩摩訶薩於百千劫具足修行六到彼岸，具大智慧，福德無量，悟證修習常無懈廢，永離罪垢，捨眾惡緣，住三摩地，得佛智慧，心無動轉，以無動心了悟諸法。",
    "T15n0634_001:0475b25_10": "若諸有情親近如來及大菩薩，熏修智慧，三業恭敬，以勝法財修諸供養經無量時，不如於此一剎那頃安住如是勝三摩地，所獲功德不可較量，常生勝處諸佛國土。」",
    "T15n0634_001:0475b29_11": "爾時諸佛作是語已，安住禪定，以神通力攝諸菩薩，詣娑婆世界，示同一身入王舍城，次第乞食，受施充足，至迦蘭陀林，乃與眾會分食妙供。",
    "T15n0634_001:0475c03_12": "是諸眾會無不霑足。",
    "T15n0634_001:0475c04_13": "飯食已，訖攝斂衣鉢，跏趺而坐。",
    "T15n0634_001:0475c04_14": "一切國土所來諸佛及諸菩薩亦復如是，無二無別。",
    "T15n0634_001:0475c06_15": "復次南方如一酤胝殑伽沙數，一一沙數為一酤胝，爾所國土一切諸佛，攝諸菩薩從彼國來集會亦爾。",
    "T15n0634_001:0475c08_16": "如東方、南方，西方、北方、四維、上下，一切諸佛諸大菩薩皆來集會亦復如是。",
    "T15n0634_001:0475c10_17": "爾時釋迦牟尼應、正等覺，見所分身一切諸佛皆來集會，心相怡悅，唯佛與佛乃得相見。",
    "T15n0634_001:0475c12_18": "時諸如來同入如是智印三摩地三摩鉢提，靜意廓如，動亂止息，以不動心明照諸法，無二無別，諸佛身相亦復不現。",
    "T15n0634_001:0475c14_19": "爾時此會人天大眾見是十方無數諸佛皆來集會，以勝定力身相不現，咸皆驚喜，整衣，合掌，右繞三匝，以寶蓮華及眾妙華諸色具足，持以供養。",
    "T15n0634_001:0475c18_0": "是時集會無量世界諸大菩薩，得清淨心，具正法眼，於一切時心相澄寂，各各當得阿耨多羅三藐三菩提者，見釋迦牟尼如來、應、正等覺與諸如來，安住如是智印三摩地三摩鉢提，由勝定力隱諸色相，志願希求，深心歡喜，以精意力不起於坐，覺智現前，入佛境界，得陀羅尼門。",
    "T15n0634_001:0475c24_1": "時諸菩薩告此娑婆世界諸大眾言：「善男子！",
    "T15n0634_001:0475c25_2": "汝等應當於佛功德眷戀希求；於諸有情繫心憐愍；知諸菩薩摩訶薩於百千劫行六波羅蜜，具大智慧，福德無量；於一切法悉皆了知；離諸戲論，處深禪定；不忘，不愚，達諸性相；於是勝法應當願求。」",
    "T15n0634_001:0475c29_3": "爾時三千大千世界聲聞、緣覺具大智慧，得大神通，捨生死岸，離煩惱縛，於自涅槃修證圓滿。",
    "T15n0634_001:0476a02_4": "大苾芻眾及諸宰官、婆羅門、鄔婆索迦、鄔婆斯迦，如是等眾咸來至此王舍大城迦蘭陀林釋迦如來、應、正等覺及分身佛會，繞百千匝，恭敬禮拜，各以上妙雜色蓮華，其華千葉，七寶間錯，過無量數以為供養。",
    "T15n0634_001:0476a07_5": "復有八十酤胝那庾多數諸大菩薩摩訶薩眾，是諸菩薩皆是他方國土中諸佛如來之所遣使，有大勇猛不怖生死，有大慈悲不樂涅槃，各以神力入大禪定，現諸威儀。",
    "T15n0634_001:0476a11_6": "從彼彼土如彈指頃到王舍城迦蘭陀林釋迦牟尼應、正等覺及分身佛會，三業恭敬，以清淨妙音尊重讚歎。",
    "T15n0634_001:0476a13_7": "見諸佛身隱晦不現，渴仰世尊，圍繞眾會，頭面作禮，退處一面，各各皆於寶蓮華上結跏趺坐。",
    "T15n0634_001:0476a15_8": "復有三億諸比丘眾樂修己利、求解脫者，承於如來智印三摩地力而來集會。",
    "T15n0634_001:0476a17_9": "是時他方三千大千世界帝釋梵王、大自在天、淨居天子、日月星辰，及諸一切天、龍、樂叉、乾闥婆、阿蘇囉、緊那囉、摩虎囉伽，及比丘、比丘尼、優婆塞、優婆夷、人、非人等，各并眷屬，覩佛光明，皆來集會。",
    "T15n0634_001:0476a22_10": "如是等眾，譬如有人髮密修長，將一一髮剪如微塵，如一人髮至千萬人髮亦復如是，以一髮塵為一眾生，是赴會眾復過是數。",
    "T15n0634_001:0476a25_0": "爾時尊者大目乾連、摩訶俱絺羅、摩訶迦栴延、摩訶迦葉波、摩訶富樓那彌多羅尼子、摩訶須菩提等，知諸大眾雖在會中，而不覩見如來身色及與住處。",
    "T15n0634_001:0476a28_1": "于時尊者舍利弗從座而起，至妙吉祥童真菩薩前，白言：「仁者！",
    "T15n0634_001:0476a29_2": "今此世尊入是如來智印三摩地，而我等輩云何不能見如來身及與住處？」",
    "T15n0634_001:0476b02_3": "時妙吉祥童真菩薩告舍利弗言：「汝諸聲聞具大智慧，得諸解脫，常修梵行，離諸怖畏，一切人天悉皆恭敬。",
    "T15n0634_001:0476b05_0": "汝等應當各各依自所得三摩地門，以智慧力觀察如來身色住處。」",
    "T15n0634_001:0476b06_1": "時舍利弗等即時各各入自所得三摩地門，以智慧力觀察推求如來色身及與住處，遍於三千大千世界微塵剎土，窮盡神力皆不能見。",
    "T15n0634_001:0476b09_2": "時舍利弗白妙吉祥童真菩薩言：「我等依自所得三摩地門，以智慧力觀察推求如來色身及與住處，了不可見。",
    "T15n0634_001:0476b12_3": "惟願仁者為我等輩分別指示，咸令得見！」",
    "T15n0634_001:0476b13_4": "時妙吉祥童真菩薩告舍利弗言：「汝諸聲聞雖具智慧及與神通，而於如來智印三摩地門不能思惟，故於佛身及所住處不能得見。",
    "T15n0634_001:0476b16_5": "所以者何？",
    "T15n0634_001:0476b16_6": "汝諸聲聞以差別心，觀視如來色身住處，由此分別自為障礙。",
    "T15n0634_001:0476b17_7": "是如來身非分別心所能觀見，若以汝身即如來身，汝等所住即如來住，乃至一切有情之身即如來身，一切有情之所住處即如來住，空有一相自他無二，不舍有為而證無為，不離無為而悟有為，以如是心觀如來身及與住處，爾乃可見。",
    "T15n0634_001:0476b23_8": "汝等既用有分別心，欲見如來無相境界，設經無量塵沙劫數莫復能得。」",
    "T15n0634_001:0476b24_9": "於是眾會悲感懊惱，離分別心，安住正念，身心內外猶如虛空寂靜而住。",
    "T15n0634_001:0476b26_10": "爾時世尊從禪定起，其心廣大如海汪洋，澄清映徹如淨瑠璃，普觀眾生若身、若土，與諸如來平等不二。",
    "T15n0634_001:0476b28_11": "身相廓然，眾會皆覩。",
    "T15n0634_001:0476b29_12": "是時三千大千世界皆大振動。",
    "T15n0634_001:0476c01_0": "一切諸天心大歡喜，離諸怖畏，於虛空中雨天寶華，其華微妙繽紛而下。",
    "T15n0634_001:0476c02_1": "又於空中作天妓樂，種種歌詠、上妙音聲、琴瑟、箜篌、琵琶、笙簫，是諸樂器不鼓自鳴，於是會中以為供養。",
    "T15n0634_001:0476c05_0": "于時舍利弗從座而起，至世尊前曲躬合掌，而白佛言：「大悲世尊！",
    "T15n0634_001:0476c06_1": "如來所入智印三昧，而我等輩無所覺知。",
    "T15n0634_001:0476c07_2": "各以神通入自所得三摩地門，以智慧力周遍推求如來身色及與住處，杳不可得，不能了知。",
    "T15n0634_001:0476c09_3": "是我等輩先自所得三摩地門及智慧力狹劣短促，未得如來無相正智自在法門。",
    "T15n0634_001:0476c11_4": "惟願世尊大慈悲力深加憐愍，與我等輩而為開導，於佛知見定慧法門使令悟入，於無相境任運現前。」",
    "T15n0634_001:0476c13_5": "爾時佛告舍利弗：「我入如是智印三摩地，非汝聲聞及諸緣覺所得智慧之所了解及能推求，唯佛與佛乃能知之。",
    "T15n0634_001:0476c16_6": "何以故？",
    "T15n0634_001:0476c16_7": "如來色身由無動心，離諸希求，捨分別緣，絕自他相，凝然湛寂，勝智功力之所任持，大定如如為一體相。",
    "T15n0634_001:0476c18_8": "若汝聲聞及諸緣覺唯求自利，不樂利他，所證法門及智慧境未解融通，自他隔閡，空有互違，於佛、如來法空無相智印三昧難解難入。",
    "T15n0634_001:0476c21_9": "是故汝等於佛身相及與住處不可得見，亦不了知。」",
    "T15n0634_001:0476c24_0": "佛說大乘智印經卷第一"
}