[
    {
        "source_sentence": "諸阿闍梨真言密教部類總錄",
        "from": "T55n2176_002:1125c18_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "卷下",
        "from": "T55n2176_002:1125c19_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "天台沙門安然集",
        "from": "T55n2176_002:1125c21_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "11 諸金剛部諸金剛部第十一1 大輪金剛法大輪金剛法一大輪金剛陀羅尼經一卷澄大輪金剛總持陀羅尼呪經運佛說大輪金剛總持陀羅尼印法一卷仁大輪金剛修行供養法一卷又別一卷睿大輪金剛悉地成就及供養法一卷仁梵漢兩字金剛輪真言一卷澄2 金剛薩埵法金剛薩埵法二普賢金剛薩埵念誦法內云瑜伽念誦儀軌不空大樂金剛薩埵修行成就儀軌一卷金剛頂勝初瑜伽經中略出大樂金剛薩埵念誦儀軌一卷不空金剛頂瑜伽金剛薩埵五祕密修行念誦儀軌一卷私云上四三出經法菩薩金剛3 金剛王法金剛王法三金剛王菩薩念誦法一卷內云祕密念誦儀軌不空譯貞元新入目錄海列外題仁列內題云金剛王菩薩祕密念誦儀軌珍列內題云金剛王菩薩祕密念誦經不空梵字金剛王真言一本仁4 諸金剛法諸金剛法四金剛部諸尊圖像儀軌一卷仁梵字金剛王中九尊真言一本仁金剛業菩薩法一卷大乘金剛髻珠菩薩修行分一卷一名金剛髻菩薩加持品貞元圓覺缺注金剛祕密善問陀羅尼經一卷貞元圓覺梵釋作善門字金剛上味陀羅尼經一卷內云陀羅尼念誦法不空譯貞元新入目錄圓覺金剛場陀羅尼經一卷貞元圓覺梵釋密跡金剛力士經七卷貞元圓覺梵釋云五卷或云七卷密跡金剛力士經二卷貞元云出五卷密迹經第四第五圓覺梵釋故不入藏金剛羯尼經一卷運薩波金剛法一卷睿跋折羅頓拏法一卷運佛說大金剛香勝陀羅尼一卷運伽馱金剛真言一卷海12 諸忿怒部諸忿怒部第十二1 不動法不動法一金剛手光明灌頂經一卷內云最勝立即聖無動尊大威怒王念誦儀軌不空譯貞元新入目錄珍列外題海列內題云金剛手光明灌頂經最勝立印聖無動尊大威怒王念誦儀軌法品一卷仁運列內題但無品字不動尊儀軌一卷海底哩三昧耶經一卷內云底哩三昧耶不動使者念誦法不空譯貞元新入目錄圓覺海珍列外題運云底哩三昧耶法一卷此有二本海略仁廣底哩三昧耶不動尊威怒王使者念誦法一卷不空運略事業品文底哩三昧耶不動尊威怒王使者念誦法一卷不空仁廣事業品文底哩三昧耶不動尊聖者念誦祕密法三卷運不動使者陀羅尼祕密法一卷金剛智譯貞元新入目錄仁運珍海云不動使者祕密法一卷不動明王安鎮家國等法一卷金剛智三藏付王無海錄外不動使者法中略出印契法次第一卷仁梵字不動尊儀軌一卷海梵字不動尊真言一本仁梵字不動鎮宅真言一本仁不動鎮宅真言一紙仁錄外廣攝不動祕法要訣六卷安然集小本云五2 降三世法降三世法二金剛頂瑜伽降三世成就極深密門一卷不空遍智貞元新入目錄海仁運行云降三世儀軌一卷遍智指授金剛頂降三世大儀軌一卷內云金剛頂降三世大儀軌法王教中觀自在菩薩心真言一切如來蓮花大曼荼羅品不空譯貞元新入目錄海行珍私云此屬觀音而人多惑故重出示之降三世五字真言一本仁降三世十八會印子一卷運3 軍荼利法軍荼利法三大妙金剛大甘露軍荼利焰鬘熾盛佛頂經卷達磨栖那譯運大聖甘露軍荼利瑜伽念誦法一卷仁甘露軍荼利瑜伽念誦法一卷內云甘露軍荼利菩薩供養念誦成就儀軌不空譯貞元新入目錄海列外題仁珍列內題圓覺阿密哩多軍荼利法一卷澄仁軍荼利別法一卷澄佛說阿密利多軍荼利護國大自在拔折羅摩訶布陀羅金剛大神力陀羅尼一卷阿地多與日照譯仁梵字軍荼利根本真言一本仁梵唐兩字阿密利多軍荼利大神力陀羅尼一卷仁梵字軍荼利心真言一本仁梵字千臂甘露軍荼利真言一本澄梵漢兩字千臂陀羅尼經一卷澄4 六足尊法六足尊法四文殊師利耶曼德迦金剛陀羅尼經一卷運睿云文殊師利焰曼德迦金剛陀羅尼經一卷聖閻曼德迦威怒王立成大神驗念誦法一卷不空譯貞元新入目錄海運珍仁云二卷聖閻曼德迦威怒王立成大神驗念誦法一卷大興善寺私云與前少略恐仁二卷內一聖閻曼德迦威怒王儀軌一卷不空睿錄外私云前本文字少異文殊師利耶曼德迦呪法一卷睿錄外梵字六足尊心真言一本仁5 金剛藥叉法金剛藥叉法五金剛藥叉瞋怒息災大威神驗念誦儀軌一卷金剛智大金剛焰口降伏一切魔怨品一卷金剛智瑜祇經一品錄外6 烏樞瑟摩法烏樞瑟摩法六集經亦名大頭金剛大佛頂經具說本行大威力烏樞瑟摩明王經三卷內云金剛恐怖集會方廣儀軌觀自在菩薩三世最勝心明王經大威力烏樞瑟摩明王經無能勝譯貞元新入目錄海仁運列外題云二卷亦云阿質多霰譯私云方廣大威力烏樞瑟摩明王經上下兩卷。",
        "from": "T55n2176_002:1127a06_18",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "金剛恐怖集會方廣儀軌觀自在菩薩三世最勝心明王經一卷。",
        "from": "T55n2176_002:1127a06_44",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "而烏樞瑟摩經兩卷內題前加書觀自在經題又觀自在經外題書烏樞瑟摩經題加前兩卷以為大威力烏樞瑟摩明王經三卷烏芻沙摩最勝明王經一卷仁大威怒烏芻澁摩成就儀軌一卷不空譯貞元新入目錄海仁運珍圓覺梵字烏瑟澁摩儀軌一卷海梵字烏樞澁摩真言一本仁梵字烏樞澁摩心心真言一本仁7 穢跡金剛法穢跡金剛法七穢迹金剛法禁百變法一卷無能勝譯貞元新入目錄仁加經字珍除下法字亦無經字亦云無能勝亦云阿質達霰譯穢迹金剛說神通大滿陀羅尼法術靈要門一卷無能勝譯貞元新入目錄海仁云阿質達霰珍云穢迹金剛說神通法一卷無能勝譯圓覺8 金剛童子法金剛童子法八聖迦抳忿怒金剛童子菩薩成就儀軌經三卷內云金剛頂一切如來真實攝大乘現證大教王經不空譯貞元新入目錄海仁運珍金剛童子持念經一卷仁金剛兒法一卷仁佛說無量壽佛化身大忿迅俱摩羅金剛念誦瑜伽儀軌法一卷金剛智仁叡云金剛童子念誦法一卷無量壽佛化身金剛忿怒速疾成就真言一本仁梵字金剛童子真言一本仁梵字童女心真言一本仁13 諸世天部諸世天部第十三1 大自在天法大自在天法一大自在天法則儀軌一卷仁行摩醯首羅天王法一卷仁運摩醯首羅天化生呪法一卷仁摩醯首羅大自在天王神通化生伎藝天女念誦法一卷運私云恐前本大自在天女經一卷運2 多門天法多門天法二毘沙門天王經一卷不空譯貞元新入目錄海仁叡珍云一品一卷北方毘沙門天王念誦要經二卷曉摩訶吠室羅末那野提婆喝羅闍陀羅尼儀軌一卷海毘沙門天王儀軌一卷叡北方毘沙門天王真言法一卷澄仁北方毘沙門天王隨軍護法真言一卷不空行毘沙門天王別行法一卷叡那吒句鉢羅陀羅尼經一卷叡佛說北方毘舍門天王甘露太子那吒俱伐羅祕密藏王如意救攝眾生根本陀羅尼一卷運青面北方天陀羅尼法一卷澄四天王經一卷貞元小乘錄中載之私云上一宜傍見之3 宿曜法宿曜法三文殊師利菩薩及諸仙所說吉凶時日善惡宿曜經二卷不空譯貞元新入目錄海圓覺文殊師利宿曜經二卷不空仁珍私云實是前本但文少異寶星經略述二十八宿佉盧瑟吒仙人經一卷仁七曜星辰別行法一卷一行運新撰宿曜經七卷加年記一卷安礙述寶星陀羅尼經十卷或八卷貞元圓覺梵釋大集日藏經十卷內云大集經日藏分第十二或第十三或第十五貞元圓覺梵釋並缺注大集月藏經一卷梵釋私云已上大乘二十八宿本經宜傍見之舍頭諫經一卷內云舍頭諫晉曰天子二十八宿經一名虎耳經貞元圓覺梵釋摩鄧伽經三卷或二卷貞元圓覺梵釋摩鄧女經一卷一名阿難為蠱道女惑經亦云摩耶女貞元梵釋摩鄧女解形中六事經一卷貞元圓覺梵釋阿難問事佛吉凶經或名阿難問事經亦名事佛吉凶經貞元圓覺梵釋私云已上小乘二十八宿本經宜傍見之4 三兄弟四姊妹天法三兄弟四姊妹天法四氷迦羅天經一卷海那羅延天共阿修羅王鬪戰法一卷寶思惟叡四姊妹神女真言法一卷叡5 摩利支天法摩利支天法五佛說摩利支天經一卷不空譯貞元新入目錄海仁珍叡云摩利支天經一卷摩利支天經一卷或上加小字貞元圓覺梵釋失譯今附梁錄未利支提婆花鬘經一卷不空譯貞元新入目錄海仁摩利支菩薩略念誦法一卷不空運梵字摩利支心并根本真言一本仁梵字摩利支心真言一本仁6 大吉祥天女法大吉祥天女法六加辨才天女寶藏天女法大吉祥天女經一卷內云佛說大吉祥天女十二契一百八名無垢大乘經不空譯貞元新入目錄海列外題仁珍列內題仁無佛說二字圓覺吉祥天女十二名號經一卷不空譯貞元新入目錄海仁珍加大字梵字吉祥心真言一本仁海云一卷梵字辨才真言一本仁寶藏天女陀羅尼法一卷運7 訶利帝母法訶利帝母法七訶利帝母經一卷內云訶利帝母真言法不空譯貞元新入目錄圓覺海列外題仁運列內題訶利帝母因緣經一卷貞元云是說一切有部律中緣起義淨鈔出故不入藏鬼子母經一卷貞元小乘錄中載之大藥叉歡喜母并愛子成就法一卷亦名訶利帝母法不空譯貞元新入目錄海仁珍圓覺梵字歡喜母真言一本仁8 蘘虞梨法蘘虞梨法八蘘虞梨童女經一卷內云加佛說字不空譯貞元新入目錄圓覺海列內題仁運珍云蘘虞梨童子經一卷不空佛說蘘虞梨童女經念誦儀軌一卷不空運常求利毒女經一卷澄常瞿利毒女陀羅尼經一卷叡9 童子法童子法九金毘羅童子威德要法一卷曉六童子威德要法一卷曉憂丘滿願法一卷運仁入不動法策子之末10 歡喜天法歡喜天法十使呪法經一卷海大聖天歡喜雙身毘那夜迦法一卷不空譯貞元新入目錄海仁運珍圓覺11 太元帥法太元帥法十一金剛部元帥大將阿吒婆俱經三卷海佛說阿吒婆句大元率將無邊神力隨心陀羅尼經一卷仁阿吒婆枸鬼神大將上佛陀羅尼經一卷亦直云阿吒婆拘呪經貞元圓覺鬼神大將元率阿吒薄拘上佛陀羅尼經一卷梁失譯曉珍鬼神大將元率阿吒薄拘上佛陀羅尼出普集經一卷仁私云恐前本大元帥全身金剛三昧耶法三卷曉太元阿吒薄句無邊甘露降伏一切鬼神真言一卷仁梵字遏吒薄俱真言一本仁12 神王法神王法十二如意輪王摩尼跋陀別行法印一卷不空仁運珍深沙神記并念誦法一卷曉菩提王記一卷曉多婆天法一卷有疑13 羅剎眾法羅剎眾法十三電光熾盛可畏形羅剎斯金剛最勝明經一卷仁妙吉祥速疾成就大羅剎美女諸法中祕密心所成就法一卷運14 迦樓羅法迦樓羅法十四文殊師利菩薩根本大教王金翅鳥王品一卷不空譯貞元新入目錄圓覺海仁速疾立驗魔醯首羅天說迦樓羅阿尾奢法一卷不空譯貞元新入目錄海運珍仁15 施餓鬼法施餓鬼法十五施焰口餓鬼陀羅尼經一卷內云佛說救拔焰口餓鬼陀羅尼經不空譯貞元新入目錄珍列外題仁列內題救面然餓鬼陀羅尼神呪經一卷亦云施餓鬼食呪經後兼有施水呪貞元圓覺缺注梵釋施燋面一切餓鬼食陀羅尼法一卷仁施諸餓鬼飲食及水法并手印一卷不空三藏口決一卷仁圓覺加本云施諸餓鬼飲食及水法一卷餓鬼飲水及呪法一卷施諸餓鬼飲食儀軌一卷海餓鬼陀羅尼一卷運焰口陀羅尼一本仁餓鬼報應經一卷貞元梵釋私云此一宜傍見之16 諸人法諸人法十六佛為優填王說王法政論經一卷不空譯貞元新入目錄海仁圓覺佛為勝光天子說王法經一卷亦直云勝光天子經貞元梵釋如來示教勝軍王經一卷亦直云勝軍王經貞元圓覺缺注梵釋練王經一卷一云大小練王經貞元圓覺缺注梵釋金光明經正論品最勝王經名王法正論品王法正理論一卷貞元大乘圓覺梵釋寶行王正論一卷貞元大乘圓覺梵釋私云上七宜傍見之梵字維摩詰真言一卷海護諸童子陀羅尼呪經一卷內云護諸童子請求男女陀羅尼經貞元圓覺梵釋大乘驗人通行法一卷貞元婆羅門自按摩法一卷仁僧護經一卷貞元小乘錄中載之圓覺梵釋私云此一宜傍見之14 諸天供部諸天供部第十四供養十二天法一卷仁施八方天儀則一卷仁供養護世天法一卷法全叡私云胎藏灌頂四門神供法出大日經具緣品義釋胎藏一百一十二天供法出大日經祕密曼荼羅品義釋金剛界灌頂八方神供法出略出經金剛界十二天供法出護摩儀軌蘇悉地天供神供法出蘇摩呼及灌頂經不空羂索經十方天神供法出大灌頂經十二卷或無大字錄云九卷未詳貞元圓覺缺注梵釋灌頂經疏二卷梵釋大乘疏中載之摩尼羅檀經一卷亦云摩尼羅檀神呪經貞元圓覺缺注梵釋玄師颰陀所說神呪經一卷錄云幻師無所說字或作跋字或云婆陀古錄云幻王跋陀經貞元圓覺缺注梵釋冥道無遮齋法一卷澄冥道無遮齋文一卷珍錄外五十天供并八十天供法一卷珍錄外甘露陀羅尼一本仁須彌盧王真言一本仁梵字請天龍真言一本仁梵字送天龍真言一本仁15 諸護摩部諸護摩部第十五金剛頂瑜伽護摩儀軌一卷不空譯貞元新入目錄海仁運珍護摩儀軌一卷師子國三藏沙門阿目伽跋折羅譯奉勅改名智藏叡與前稍廣內護摩法一卷運攝真實經一品大吽供養儀軌一卷契進海錄外建立曼荼羅護摩儀軌一卷法全仁錄外大壇供養及供養十天法一卷仁護摩略抄一卷護摩法要集一卷16 諸禮懺部諸禮懺部第十六金剛頂瑜伽三十七尊禮一卷內云金剛頂經金剛界大道場毘盧遮那如來自受用身內證眷屬法身異名最勝上乘祕密三摩地禮懺文一卷不空譯貞元新入目錄海珍列外題仁列內題修真言三昧四時禮懺供養儀要一卷仁六時禮懺并食堂禮文一卷仁錄外六時禮懺文一本珍集諸經禮懺儀二卷貞元離垢惠菩薩所問禮佛法經一卷貞元圓覺梵釋正恭敬經一卷一名威德陀羅尼中說經或名正法恭敬經貞元圓覺缺注梵釋三十五佛名經一卷內云佛說三十五佛名禮懺文出鄔波離所問經不空譯貞元新入目錄廣七階佛名經一卷貞元佛名經圓覺缺注梵釋略七階佛名經一卷貞元八佛名號經一卷貞元圓覺梵釋八部佛名經一卷亦名佛名經貞元圓覺缺注梵釋八吉祥經一卷亦云八世界八佛名號經貞元圓覺梵釋百佛名經一卷貞元圓覺梵釋三劫三千佛名經三卷貞元圓覺梵釋五千五百佛名經八卷貞元圓覺梵釋佛名經十二卷或十三卷或二十卷貞元圓覺梵釋馬頭羅剎佛名經十六卷貞元十五年十月二十三日勅入目錄題但云佛名經梵釋入偽疑錄六菩薩名一卷序入藏云六時菩薩名亦當誦持貞元私云上十宜傍見之17 諸讚嘆部諸讚嘆部第十七1 胎藏金剛二界灌頂通用讚胎藏金剛二界灌頂通用讚一金剛手阿利沙偈讚一卷大日經第七略出經第四同用供養法梵字大讚一卷珍錄外大吉慶讚二卷二本運云一卷仁梵字吉慶讚十卷海梵字吉慶伽陀九首一本仁梵唐兩字毘盧遮那成佛神變加持經吉慶加陀讚一本仁大日經義釋引縛駟羅阿毘庾經及略出經同用灌頂法2 胎藏界通讚胎藏界通讚二三身讚一卷珍錄外梵字三身讚一卷仁三寶讚一卷運3 金剛界通讚金剛界通讚三佛部曼荼羅讚嘆一本仁金剛部讚一卷運寶部金剛讚一卷海梵字寶部金剛讚一卷海蓮花部讚一卷運梵唐兩字蓮花部讚一卷仁梵字蓮花部讚一卷海仁梵字羯摩部一百八名讚一本梵字五方歌讚一本仁梵字百字讚一本仁梵字金剛峯樓閣真言并一百八名讚一卷海十六大菩薩一百八名讚一卷仁運十六讚嘆一本仁梵字十六大菩薩讚一卷海4 蘇悉地通讚蘇悉地通讚四五讚嘆二本兩本仁念佛讚一本弘索仁一百五十讚佛頌一卷貞元七佛讚嘆一本仁三如來畫像贊一卷澄總釋陀羅尼義讚一卷行運叡十弟子讚一卷澄5 法身佛讚法身佛讚五文殊讚法身禮一卷內云大聖文殊師利菩薩讚法身禮并序不空譯貞元新入目錄仁珍云大聖文殊師利菩薩讚佛法身禮一卷海地藏菩薩問法身讚一卷內云百千頌大集經地藏菩薩請問法身一卷不空譯貞元新入目錄觀自在法身讚嘆一本仁6 大日讚大日讚六大毘盧遮那如來菩提讚一卷運毘盧遮那心略讚一本仁毘盧佛心略讚一本運私云恐是前本7 釋迦讚釋迦讚七釋迦牟尼佛成道在菩提樹降魔讚一卷海運仁云二卷兩本梵字降魔讚一本仁釋迦如來足下千輻輪相真言并讚一卷運仁云如來千輻輪相讚一本釋迦如來涅槃後彌勒菩薩悲願讚一本仁無量微密持經一卷一名成道降魔得一切智經私云上一宜傍見之8 佛頂讚佛頂讚八加佛母讚梵唐兩字大佛頂根本讚一本仁佛頂尊勝真言根本讚一本仁梵字七俱胝佛母讚一本海9 觀音讚觀音讚九讚觀世音菩薩頌一卷貞元梵唐兩字觀自在菩薩讚一本仁梵字十一面讚一卷海如意輪讚一卷運10 普賢讚普賢讚十普賢行願讚一卷不空譯貞元新入目錄海仁圓覺仁云普賢菩薩讚一本梵字普賢行願讚一卷海仁運梵唐兩字普賢菩薩讚一本仁行梵唐對譯普賢行願讚一本仁運大方廣佛花嚴經普賢菩薩行願讚一本澄運私云恐是初讚異本11 文殊讚文殊讚十一文殊行願讚一卷運梵字文殊讚一本仁文殊師利菩薩一百八名讚一本運梵字千鉢文殊一百八名讚一卷海梵唐兩字文殊師利菩薩讚一本仁12 諸菩薩讚諸菩薩讚十二梵唐兩字大隨求大結護讚一本梵唐兩字彌勒菩薩讚一本仁梵唐兩字虛空藏菩薩讚一本仁梵唐兩字地藏菩薩讚一本仁梵唐兩字除蓋障菩薩讚一本仁13 諸金剛讚諸金剛讚十三梵唐兩字金剛藏菩薩讚一本仁梵字金剛藏降三世讚王一卷海降三世金剛一百八名讚一本仁14 諸世天讚諸世天讚十四普集天龍八部讚一卷仁天龍八部讚一卷運仁云一本梵字天龍八部讚一卷海梵唐兩字天龍八部讚一本仁15 雜用讚雜用讚十五本尊讚一本仁梵字大三摩耶真言一百八名讚一卷海梵唐兩字送本尊歸本土讚一卷仁梵唐兩字除壇上粉念此緣生偈讚一本仁浴像燒香偈讚一本仁私此二重出唐梵兩字滿願讚一本仁18 諸悉曇部諸悉曇部第十八1 字母本教字母本教一瑜伽金剛頂經釋字母品一卷不空譯貞元新入目錄海仁圓覺文殊問字母品經一卷內云文殊問經字母品第十四不空譯貞元新入目錄海仁列內題圓覺大涅槃經文字品悉曇章二本兩本應珍2 悉曇異本悉曇異本二悉曇章一本婆羅門僧正門人佛哲本悉曇章一卷仁安國寺本與前亦異悉曇章一卷海與前少異悉曇章一卷仁全雅手寫與前亦異悉曇章一卷行與前四本亦異悉曇章一卷題云悉曇梵字一卷與前五本亦異運悉曇章一卷曉與前六七亦大異文有爛脫悉曇章一卷珍初持曉本入唐遇般若三藏歸天竺以前曉本隨三藏說更加多章與前七本亦大異大悉曇章二卷海和上作大悉曇章十八章安然據字記唯出諸轉頭上大江君南天竺般若菩提悉曇一十八章安然據字記方具出諸章字在中院3 悉曇解釋悉曇解釋三羅什悉曇章一卷海錄外瞻波城悉曇章一卷海錄外天台山悉談章一卷惠明珍大涅槃經如來性品十四音義二卷羅什仁叡是兩本然一卷著朱脈為別也十四音辨一卷如玄仁涅槃經十四音七曇章圖一卷運又云悉曇章圖一卷文字一卷珍是涅槃經文字品字母反音七曇記一卷運七曇字紀一卷海悉曇釋一卷海梵唐文字一卷行辨說梵文漢字功德及出生一切文字根本次第一卷全真行諸梵字十二卷運初有大隨求結護真言悉曇字母并義釋一卷海和上撰字源一卷榮律師集悉曇藏八卷安然集4 梵唐對譯梵唐對譯四建立梵夾經記一卷珍唯識三十本論梵夾一卷運翻梵語十卷仁梵唐語十卷義淨集珍梵唐千字文一卷仁梵語雜名一卷仁隨文梵語集一卷安然集19 諸碑傳部諸碑傳部第十九金剛三藏碑一卷運無畏三藏碑一卷運不空三藏碑一卷運不空三藏表答碑三卷海興善寺三藏碑一卷運惠果和尚碑一卷運大明和尚碑一卷運師資相授法傳一卷運略敘傳大毘盧遮那成佛神變加持經大教相承傳法次第記一卷海雲仁略敘金剛界大教王經師資相承傳法次第記一卷海運仁20 諸圖像部諸圖像部第二十1 胎藏界四種曼荼羅圖胎藏界四種曼荼羅圖一大毘盧遮那大悲胎藏大曼荼羅一鋪五副苗仁海云七副珍云五副大悲胎藏三昧耶略曼荼羅一鋪一副苗仁海云二副大悲胎藏法曼荼羅一鋪三副海苗大悲胎藏梵號曼荼羅一鋪五副苗仁海行運亦將來但有少異胎藏曼荼羅手印樣一卷仁私云此一重出2 金剛界四種曼荼羅圖金剛界四種曼荼羅圖二金剛界大曼荼羅一鋪七副綵色仁金剛界大曼荼羅一鋪五副苗仁海云三副金剛界三摩耶曼荼羅一鋪行金剛界九會曼荼羅一鋪五副苗仁海云七副珍云六副金剛界三十七尊種子曼荼羅樣一張仁金剛界八十一尊大曼荼羅一鋪三副海金剛界八十一尊種子曼荼羅樣一張仁珍3 錄外祕密曼荼羅錄外祕密曼荼羅三薦福寺金剛三藏手繪金泥曼荼羅苗一楨仁會昌滅佛法日和上密屬手工令圖一本那邦無復異本金剛三藏手繪金剛界大曼荼羅一鋪仁理趣經十八會曼荼羅十八楨仁叡降三世十八變曼荼羅十八楨叡佛眼佛母曼荼羅一楨海珍愛染王曼荼羅一楨海不動尊曼荼羅一楨運尊有黑髻不動尊曼荼羅一楨珍尊者葛髻右一使者左二使者下五使者4 諸尊曼荼羅圖諸尊曼荼羅圖四一釋迦牟尼佛在菩提樹下像一鋪一副綵色仁行六七俱胝佛母像樣一卷最七日月光明世尊像一軀行九千光佛像一軀曉二五佛頂曼荼羅楨子苗一鋪運八金輪佛頂像樣一卷最行三熾盛壇樣一紙仁四佛頂尊勝壇像一鋪五副仁一〇大毘盧遮那九頂輪王曼荼羅楨一鋪六副珍五法花曼荼羅樣一楨仁一一普賢菩薩像一軀行三一普賢延命像一鋪三副仁一二阿魯力觀音曼荼羅一張行三二水自在天像一鋪一副仁一三八菩薩住樣一卷最三三隨求大會槙子苗一鋪運一四大頭金剛像樣一卷最行三四八大明王像一卷碑本仁降三世十八會印子一卷運一五水月觀世音菩薩像一軀曉行一六金剛童子忿怒王像一軀行一七大吉祥天菩薩像一軀行一八摩利支天菩薩像一軀行一九阿梨底母像一軀行二〇大元帥本身將部曼荼羅一鋪總五十餘身曉二一大元帥大悲身像一鋪曉二二大元帥忿怒身像一鋪曉二三大元帥化身像一鋪曉二四大聖千頭舍毘羅童子像一軀曉二五六童子像一鋪曉二六大聖迦毘羅神王像一軀曉二七深沙神王像一軀曉二八涅槃王像一軀曉二九七曜二十八宿像曉三〇護摩爐壇樣一十五種曉三五諸曼荼羅圖一卷運三六供養賢聖等七種壇樣一卷仁三七護摩壇樣三卷海一仁一珍一各有少異5 塔龕塔龕五鍮鉐佛一面石佛仁佛跡并記一卷仁佛眼塔樣并記一卷白銅印泥塔一合仁壇龕涅槃淨土一合仁壇龕西方淨土一合仁6 真言諸三藏影真言諸三藏影六金剛智三藏真影一紙苗仁無畏三藏真影紙苗仁大廣智不空三藏真影一紙苗仁金剛無畏不空三師三藏真影一楨珍和上寄𭙮景金屬智惠輪寫得不空三藏院本一行禪師影一鋪三副海惠果阿闍梨影一鋪三副海青龍寺真和上真影一鋪一副綵色7 諸聖僧影諸聖僧影七付法藏二十三師真影二十三楨珍壇龕僧伽誌公乃迴三聖像一合仁大聖僧伽和上影一張苗仁傅大士真影一張珍僧會和尚入定立影一楨苗仁珍8 天台諸大師影天台諸大師影八南岳思大師真影一楨澄南岳思大和上示先生骨影一鋪三副綵色仁定光禪師擎佛招手影一鋪澄珍天台大師感得聖僧影一鋪三副綵色仁澄天台山智者大師靈應圖一張有感神僧影六副九尺澄天台山國清寺壁上大師說法影像并佛頂及維摩四王六祖像一卷澄長安資聖寺壁上南岳大師與天台大師等二十弟子說法影一楨珍9 誦法花諸禪師靈異影誦法花諸禪師靈異影九定禪師誦法花天童給事影一張苗仁映禪師誦法花善神來聽經影一張苗仁法惠禪師誦法花口放光照室宇影一張苗仁惠斌禪師誦法花神人來禮拜影一張苗仁山登禪師誦法花感金銀殿影一張苗仁道超禪師誦法花感二世弟子生處影一張苗仁惠向禪師誦法花滅後墓上生蓮花及墓裏常有誦法花聲影一張苗仁法惠和尚閻王前誦法花影一張苗仁阿蘭若比丘見空中普賢影一張苗仁秦郡老僧教弟子感夢示宿因影一張苗仁10 雜事圖雜事圖十釋門集僧軌度圖一卷珍含影圖一卷運九哢十紉圖一張仁五藏六府圖一卷運私云聖僧以後傍列而已真言密教總目錄卷下終小本枇云一千七百五十五卷。",
        "from": "T55n2176_002:1132c05_12",
        "context_with_next_sentence": true
    }
]