[
    {
        "source_sentence": "開元釋教錄卷第十九入藏錄上",
        "from": "T55n2154_019:0680a26_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "庚午歲西崇福寺沙門智昇撰",
        "from": "T55n2154_019:0680a28_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "入藏錄合大小乘經律論及聖賢集傳見入藏者。總",
        "from": "T55n2154_019:0680a29_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一千七十六部。",
        "from": "T55n2154_019:0680b01_6",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "合五千四十八卷。",
        "from": "T55n2154_019:0680b01_14",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "成四百八十帙。",
        "from": "T55n2154_019:0680b02_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘入藏錄大乘入藏錄上大乘經律論總六百三十八部二千七百四十五卷二百五十八帙此直列經名及標紙數餘如廣錄大乘經　五百一十五部　二千一百七十三卷　二百三帙大乘律　二十六部　五十四卷　五帙大乘論　九十七部　五百一十八卷　五十帙大乘經大乘經重單合譯大乘經重單合譯三百八十四部。",
        "from": "T55n2154_019:0680b10_23",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一千八百八十卷。",
        "from": "T55n2154_019:0680b11_6",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一百七十九帙大般若波羅蜜多經六百卷十六會說六十帙一萬五百八十一紙放光般若波羅蜜經三十卷亦云放光摩訶般若經三帙或二帙亦云摩訶般若放光四百六十六紙摩訶般若波羅蜜經四十卷亦名大品般若經僧祐錄云新大品或二十四卷或二十七卷三十卷六百二十三紙光讚般若波羅蜜經十五卷亦云光讚摩訶般若經或十卷二百二十一紙摩訶般若波羅蜜鈔經五卷或無鈔字亦名長安品經一名須菩提品經或七卷九十紙上二經二十卷二帙。",
        "from": "T55n2154_019:0680b22_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "道行般若波羅蜜經十卷一帙題云摩訶般若波羅蜜道行經或八卷亦云般若道行品經一百七十紙小品般若波羅蜜經十卷題云摩訶般若波羅蜜經無小品字一帙一百五十紙大明度無極經四卷亦直名大明度經或六卷九十四紙勝天王般若波羅蜜經七卷一百二十五紙上二經十一卷同帙。",
        "from": "T55n2154_019:0680c02_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊師利所說摩訶般若波羅蜜經二卷亦直云文殊般若波羅蜜經或一卷二十一紙文殊師利所說般若波羅蜜經一卷二十紙濡首菩薩無上清淨分衛經二卷一名決了諸法如幻化三昧經二十八紙金剛般若波羅蜜經一卷舍衛國第一譯一十二紙金剛般若波羅蜜經一卷婆伽婆第二譯一十四紙金剛般若波羅蜜經一卷祇樹林第三譯一十四紙能斷金剛般若波羅蜜多經一卷室羅筏第四譯一十九紙能斷金剛般若波羅蜜多經一卷名稱城戰勝林第五譯一十二紙實相般若波羅蜜經一卷八紙仁王護國般若波羅蜜經二卷亦云仁王般若經或一卷二十八紙摩訶般若波羅蜜大明呪經一卷亦云摩訶大明呪經一紙般若波羅蜜多心經一卷亦云般若心經一紙上十二經十五卷同帙。",
        "from": "T55n2154_019:0680c20_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大寶積經一百二十卷四十九會說合成一部十二帙一千九百九十一紙大方廣三戒經三卷四十六紙無量清淨平等覺經二卷亦直云無量清淨經或四卷六十一紙阿彌陀經二卷上卷題云佛說諸佛阿彌陀三耶三佛薩樓佛檀過度人道經亦名無量壽經五十五紙無量壽經二卷三十九紙上四經九卷同帙。",
        "from": "T55n2154_019:0680c28_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿閦佛國經二卷一名阿閦佛剎諸菩薩學成品經四十紙大乘十法經一卷佛住王舍城者二十紙普門品經一卷亦云普門經二十二紙胞胎經一卷一名胞胎受身經一十五紙文殊師利佛土嚴淨經二卷或直云嚴淨佛土經亦經直云佛土嚴淨經二十五紙法鏡經二卷或一卷二十五紙上六經九卷同帙。",
        "from": "T55n2154_019:0681a08_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "郁迦羅越問菩薩行經一卷或云郁迦長者問居家菩薩行經二十五紙幻士仁賢經一卷或云仁賢幻士經一十八紙決定毘尼經一卷一名破壞一切心識一十七紙發覺淨心經二卷二十八紙優填王經一卷五紙須摩提經一卷有加菩薩字亦云須摩經八紙須摩提菩薩經一卷九紙阿闍貰王女阿術達菩薩經一卷亦名阿闍貰女經亦直名阿述達經一十九紙離垢施女經一卷二十三紙上九經十卷同帙。",
        "from": "T55n2154_019:0681a20_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "得無垢女經一卷一名論議辯才法門或云無垢女經二十五紙文殊師利所說不思議佛境界經二卷或一卷有一本乃是偽經佛性海藏題為文殊所說應審觀也二十四紙如幻三昧經二卷或三卷或四卷五十七紙聖善住意天子所問經三卷或四卷五十七紙太子刷護經一卷五紙大子和烋經一卷或云私烋四紙上六經十卷同帙。",
        "from": "T55n2154_019:0681b01_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "慧上菩薩問大善權經二卷或一卷或直云大善權經或云方便所度无極經或云慧上菩薩經或云善權方便經三十二紙大乘顯識經二卷二十五紙大乘方等要慧經一卷一紙彌勒菩薩所問本願經一卷或無所問字亦云彌勒本願經一名彌勒難經八紙佛遺日摩尼寶經一卷一名古品遺日說般若經一名大寶積經一名摩訶衍寶嚴經一十六紙摩訶衍寶嚴經一卷一名大迦葉品二十紙勝鬘師子吼一乘大方便方廣經一卷亦直名勝鬘經或二卷十九紙毘耶娑問經二卷三十四紙上八經十一卷同帙。",
        "from": "T55n2154_019:0681b14_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大方等大集經三十卷三帙或二十九卷或三十一卷或三十二卷或四十卷六百二十一紙大方等大集日藏經十卷一帙題云大乘大方等日藏分或十二卷或十五卷二百六紙大集月藏經十卷一帙題云大集經月藏分第十二或十二卷或十五卷二百一十九紙大乘大集地藏十輪經十卷一帙一百六十五紙大方廣十輪經八卷一百九紙大集須彌藏經三卷內題云大乘大集經須彌藏分第十五或二卷三十八紙上二經十一卷同帙。",
        "from": "T55n2154_019:0681b26_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "虛空藏菩薩經一卷一名虛空藏經二十七紙虛空藏菩薩神呪經一卷一十七紙虛空孕菩薩經二卷三十一紙觀虛空藏菩薩經一卷亦名虛空藏觀經或無觀字三紙菩薩念佛三昧經六卷或無菩薩字或五卷九十八紙上五經十一卷同帙。",
        "from": "T55n2154_019:0681c04_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大方等大集菩薩念佛三昧經十卷題云大方等大集經菩薩念佛三昧分一帙一百三十四紙般舟三昧經三卷一名十方現在佛悉在前立定經或云大般舟三昧經或二卷五十紙拔陂菩薩經一卷亦云拔波安錄云颰披陀菩薩經一十四紙大方等大集賢護經五卷或六卷題云大方等大集經賢護分亦云賢護菩薩經亦直云賢護經八十二紙上三經九卷同帙。",
        "from": "T55n2154_019:0681c12_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "阿差末經七卷晉曰無盡意或四卷或五卷或云阿差末菩薩經九十二紙無盡意菩薩經六卷初題云大集經中無盡意所說不可盡義品第二十二亦云阿差末經或直云無盡意經八十九紙上二經十三卷同帙。",
        "from": "T55n2154_019:0681c16_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大集譬喻王經二卷或無大集字三十四紙大哀經八卷或云如來大哀經或六卷或七卷一百一十七紙上二經十卷同帙。",
        "from": "T55n2154_019:0681c19_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "寶女所問經三卷或直云寶女經亦云寶女問慧經亦云寶女三昧經或四卷六十四紙無言童子經二卷或云無言菩薩經或一卷四十一紙自在王菩薩經二卷或無菩薩字三十四紙奪迅王問經二卷四十一紙上四經九卷同帙。",
        "from": "T55n2154_019:0681c25_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "寶星陀羅尼經十卷或八卷一帙一百三十三紙大方廣佛華嚴經六十卷八會說舊譯六帙或五十卷一千七十九紙大方廣佛花嚴經八十卷九會說新譯八帙一千三百二十九紙信力入印法門經五卷九十五紙度諸佛境界智光嚴經一卷或二卷一十七紙佛花嚴入如來德智不思議境界經二卷二十二紙大方廣入如來智德不思議經一卷一十四紙大方廣佛華嚴經不思議佛境界分一卷或二卷一十二紙大方廣如來不思議境界經一卷一十一紙大乘金剛髻珠菩薩修行分一卷亦名金剛鬘菩薩加行品一十八紙大方廣佛花嚴經修慈分一卷七紙上八經十三卷同帙。",
        "from": "T55n2154_019:0682a15_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大方廣普賢所說經一卷別有一本向三十紙非是本經應須揀擇五紙莊嚴菩提心經一卷七紙大方廣菩薩十地經一卷七紙兜沙經一卷五紙菩薩本業經一卷亦直名本業經亦名淨行品經一十二紙諸菩薩求佛本業經一卷或無諸字一十一紙菩薩十住行道品一卷亦直云菩薩十住八紙菩薩十住經一卷五紙漸備一切智德經五卷或十卷一名十住又名大慧光三昧一百五紙上九經十三卷同帙。",
        "from": "T55n2154_019:0682a27_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十住經四卷或五卷九十七紙等目菩薩所問三昧經二卷或三卷一名普賢菩薩定意或直云等目菩薩經五十二紙顯無邊佛土功德經一卷二紙如來興顯經四卷一名興顯如幻經六十六紙上四經十一卷同帙。",
        "from": "T55n2154_019:0682b04_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "度世品經六卷或五卷或無品字一百二十紙羅摩伽經三卷或四卷七十二紙大方廣佛花嚴經續入法界品一卷或無續字八紙上三經十卷同帙。",
        "from": "T55n2154_019:0682b08_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大般涅槃經四十卷或三十六卷四帙七百三十紙大般涅槃經後譯荼毘分二卷亦云闍維分亦云後分三十九紙大般泥洹經六卷記云方等大般泥洹經或七卷一百四十一紙上二經八卷同帙。",
        "from": "T55n2154_019:0682b13_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "方等般泥洹經二卷亦名大般泥洹經或三卷四十五紙四童子三昧經三卷或無三昧字四十四紙大悲經五卷八十七紙上三經十卷同帙。",
        "from": "T55n2154_019:0682b17_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "方廣大莊嚴經十二卷一名神通遊戲或云大方廣二百一十四紙普曜經八卷一名方等本起一百四十三紙上二經二十卷兩帙。",
        "from": "T55n2154_019:0682b21_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法花三昧經一卷一十一紙無量義經一卷一十七紙薩曇分陀利經一卷舊錄云薩芸芬陀利經亦直云分陀利經三紙妙法蓮花經八卷或七卷二十八品僧祐錄云新法花經一百五十二紙上四經十一卷同帙。",
        "from": "T55n2154_019:0682b26_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "正法花經十卷或云方等正法花或七卷一帙一百九十紙添品妙法蓮花經七卷二十七品寶塔天授連為一品或八卷一百五十八紙維摩詰所說經三卷一名不可思議解脫或直云維摩詰經僧祐錄云新維摩詰經六十一紙上二經十卷同帙。",
        "from": "T55n2154_019:0682c04_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "維摩詰經二卷維摩詰說不思議法門之稱一名佛法普入道門三昧經或三卷五十五紙說無垢稱經六卷九十七紙大方等頂王經一卷一名維摩詰子問經亦名善思童子經亦直云頂王經二十紙大乘頂王經一卷亦云維摩呪經一十六紙上四經十卷同帙。",
        "from": "T55n2154_019:0682c11_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "善思童子經二卷二十一紙大悲分陀利經八卷亦云大乘悲分陀利經一百六十八紙上二經十卷同帙。",
        "from": "T55n2154_019:0682c14_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "悲華經十卷一帙一百九十九紙金光明最勝王經十卷一帙一百四十九紙合部金光明經八卷二十四品一百二十紙伅真陀羅所問經二卷初云伅真陀羅所問寶如來三昧經或云伅真陀羅尼王經或三卷五十八紙上二經十卷同帙。",
        "from": "T55n2154_019:0682c20_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大樹緊那羅王所問經四卷亦名說不可思議品或云大樹緊那羅經六十七紙佛昇忉利天為母說法經二卷亦云佛昇忉利天品經或三卷三十七紙道神足無極變化經四卷一名合道神足經或二卷或五卷四十九紙上三經十卷同帙。",
        "from": "T55n2154_019:0682c27_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "寶雨經十卷一帙一百四十一紙寶雲經七卷一百二紙阿惟越致遮經三卷或無遮字或四卷六十六紙上二經十卷同帙。",
        "from": "T55n2154_019:0683a03_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不退轉法輪經四卷一名不退轉經七十三紙廣博嚴淨不退轉法輪經四卷或六卷或直云廣博嚴淨經亦直云不退轉法輪經七十八紙不必定入印經一卷或不必定入定入印經二十一紙入定不定印經一卷一十六紙上四經十卷同帙。",
        "from": "T55n2154_019:0683a09_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "等集眾德三昧經三卷或二卷或無三昧字或直云等集經五十紙集一切福德三昧經三卷五十紙持心梵天經四卷亦云持心梵天所問經一名莊嚴佛法經又名等御諸法經凡十七品或六卷九十一紙上三經十卷同帙。",
        "from": "T55n2154_019:0683a14_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "思益梵天所問經四卷或直云思益經僧祐錄云思益義經八十三紙勝思惟梵天所問經六卷一百一紙上二經十卷同帙。",
        "from": "T55n2154_019:0683a18_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "持人菩薩經四卷初云持人菩薩所問陰種諸入以了道慧經或三卷五十四紙持世經四卷一名法印經或三卷七十八紙濟諸方等學經一卷天竺薩和鞞曰僧迦或無學字一十五紙大乘方廣總持經一卷或無乘字一十四紙上四經十卷同帙。",
        "from": "T55n2154_019:0683a24_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊師利現寶藏經三卷或二卷或無現字或直云寶藏經四十二紙大方廣寶篋經三卷或二卷四十三紙大乘同性經二卷亦名一切佛行入智毘盧遮那藏說經一名佛十地經或四卷三十八紙證契大乘經二卷亦名入一切佛境智陪盧遮那藏三十二紙上四經十卷同帙。",
        "from": "T55n2154_019:0683b03_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "深密解脫經五卷七十一紙解深密經五卷七十五紙上二經十卷同帙。",
        "from": "T55n2154_019:0683b06_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "解節經一卷一十紙相續解脫地波羅蜜了義經一卷或二卷亦名解脫了義經亦直云相續解脫經一十八紙緣生初勝分法本經二卷亦直云緣生經二十三紙分別緣起初勝法門經二卷亦直云分別緣起經二十三紙楞伽阿跋多羅寶經四卷九十二紙上五經十卷同帙。",
        "from": "T55n2154_019:0683b13_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "入楞伽經十卷一帙一百七十四紙大乘入楞伽經七卷一百三十七紙菩薩行方便境界神通變化經三卷四十七紙上二經十卷同帙。",
        "from": "T55n2154_019:0683b17_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大薩遮尼乾子所說經十卷一帙或加授記字無所說字或七卷或八卷一名菩薩境界奮迅法門經一百三十九紙大方等大雲經六卷一名大方等無相大雲經一名大雲無相經一名大雲蜜藏經或四卷或五卷九十紙大雲請雨經一卷內題云大雲經請雨品第六十四二十三紙大雲輪請雨經二卷二十七紙大方等大雲請雨經一卷內題云大方等大雲經請雨品第六十四二十紙上四經十卷同帙。",
        "from": "T55n2154_019:0683b26_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "諸法無行經二卷或一卷三十一紙諸法本無經三卷三十九紙無極寶三昧經一卷或無三昧字三十紙寶如來三昧經二卷一名無極寶三昧經或一卷三十八紙慧印三昧經一卷一名寶田慧印三昧經亦直云慧印經二十紙如來智印經一卷一名諸佛法身一十九紙上六經十一卷同帙。",
        "from": "T55n2154_019:0683c05_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大灌頂經十二卷一帙或無大字錄云九卷未詳一百一十八紙藥師如來本願經一卷隋笈多譯一十二紙藥師琉璃光如來本願功德經一卷一十一紙藥師琉璃光七佛本願功德經二卷三十一紙阿闍世王經二卷五十五紙普超三昧經三卷或四卷或上加文殊師利字亦直云普超經一名阿闍世王品安公錄云更出阿闍世王經六十八紙放鉢經一卷七紙上六經十卷同帙。",
        "from": "T55n2154_019:0683c14_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "月燈三昧經十一卷或十卷一帙一百九十八紙月燈三昧經一卷一名文殊師利菩薩行十事行經一名逮慧三昧經一十紙無所希望經一卷一名象步經二十紙象腋經一卷一十六紙大淨法門經一卷題云大淨法門品上金光首女所問溥首童真所開化經二十四紙大莊嚴法門經二卷亦名文殊師利神通力經亦名勝金色光明德女經二十六紙如來莊嚴智慧光明入一切佛境界經二卷亦云如來入一切佛境界經三十四紙度一切諸佛境界智嚴經一卷一十二紙後出阿彌陀佛偈經一卷或無經字一紙觀無量壽佛經一卷亦云無量壽觀經一十六紙阿彌陀經一卷亦名無量壽經五紙稱讚淨土佛攝受經一卷亦直云稱讚淨土經一十紙上十一經十三卷同帙。",
        "from": "T55n2154_019:0684a03_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "觀彌勒菩薩上生兜率天經一卷亦云彌勒上生經八紙彌勒成佛經一卷一十七紙彌勒來時經一卷三紙彌勒下生經一卷一名彌勒授決經亦云彌勒成佛經亦云當下成佛亦云下生成佛初云大智舍利弗七紙彌勒下生成佛經一卷義淨三藏新譯五紙諸法勇王經一卷一十八紙一切法高王經一卷一名一切法義王經二十紙第一義法勝經一卷一十四紙大威燈光仙人問疑經一卷一十五紙順權方便經二卷一名轉女身菩薩經亦云惟權方便經或云順權女經亦云隨權女經或一卷二十八紙樂瓔珞莊嚴方便品經一卷亦云轉女身菩薩問答經二十六紙上十一經十二卷同帙。",
        "from": "T55n2154_019:0684a18_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "六度集經八卷亦名六度無極經亦云度無極集亦云雜無極經或九卷一百四十七紙太子須大拏經一卷或云須達拏一十六紙菩薩睒子經一卷亦云孝子睒經亦直云睒經七紙睒子經一卷一名孝子睒經一名菩薩睒經一名佛說睒經一名睒本經一名孝子隱經六紙太子慕魄經一卷六紙太子沐魄經一卷或作慕魄三紙九色鹿經一卷三紙上七經十四卷同帙。",
        "from": "T55n2154_019:0684a27_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無字寶篋經一卷六紙大乘離文字普光明藏經一卷五紙大乘遍照光明藏無字法門經一卷亦直云大乘遍照光明藏經六紙老女人經一卷亦云老母經或云老女經二紙老母經一卷二紙申日經一卷五紙老母女六英經一卷亦云老母經一紙月光童子經一卷一名月明童子經或名申日經九紙申日兒本經一卷亦云申兒本經錄作兜本誤也三紙德護長者經二卷一名尸利崛多長者經二十八紙文殊師利問菩提經一卷一名伽耶山頂經一名菩提無行經亦直云菩提經七紙伽耶山頂經一卷亦云伽耶頂經一十紙象頭精舍經一卷九紙大乘伽耶山頂經一卷九紙長者子制經一卷亦直名制經四紙菩薩逝經一卷亦云誓童子經或直名逝經四紙逝童子經一卷亦名長者制經亦直云制經亦名菩薩逝經亦直云逝經三紙犢子經一卷二紙乳光佛經一卷亦云乳光經六紙無垢賢女經一卷或名胎藏經三紙腹中女聽經一卷一名不莊校女經三紙轉女身經一卷一十九紙上二十二經二十三卷同帙。",
        "from": "T55n2154_019:0684b25_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "無上依經二卷三十一紙未曾有經一卷三紙甚希有經一卷五紙決定總經一卷或云決定總持經亦云決總持經八紙謗佛經一卷七紙寶積三昧文殊問法身經一卷一名遺日寶積三昧文殊師利菩薩問法身經六紙入法界體性經一卷或云入法界經十紙如來師子吼經一卷六紙大方廣師子吼經一卷五紙大乘百福相經一卷七紙大乘百福莊嚴相經一卷九紙大乘四法經一卷與單本中實叉難陀譯者二名雖同多少全異一紙菩薩修行四法經一卷一紙希有希有挍量功德經一卷或直云希有挍量功德經六紙最無比經一卷十二紙前世三轉經一卷六紙銀色女經一卷七紙阿闍世王受決經一卷四紙採蓮違王上佛授決號妙華經一卷亦直云採蓮違王經二紙正恭敬經一卷一名威德陀羅尼中說經或名正法恭敬經五紙善敬經一卷亦名善恭敬經一名善恭敬師經七紙稱讚大乘功德經一卷五紙說妙法決定業障經一卷三紙上二十三經二十四卷同帙。",
        "from": "T55n2154_019:0684c24_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "諫王經一卷亦云大小諫王經四紙如來示教勝軍王經一卷亦直云勝軍王經十紙佛為勝光天子說王法經一卷亦直云勝光天子經七紙大方等修多羅王經一卷或無王字二紙轉有經一卷二紙文殊師利巡行經一卷五紙文殊尸利行經一卷八紙貝多樹下思惟十二因緣經一卷亦云聞城十二因緣經四紙緣起聖道經一卷八紙稻芉經一卷七紙了本生死經一卷五紙自誓三昧經一卷題下注云獨證品第四出比丘淨行中八紙如來獨證自誓三昧經一卷亦云獨證自誓三昧經亦云如來自誓三昧經七紙灌洗佛形像經一卷亦云四月八日灌經亦直云灌經二紙摩訶剎頭經一卷亦名灌佛形像經三紙造立形像福報經一卷三紙作佛形像經一卷亦云優填王作佛像經一名作像因緣經四紙龍施女經一卷或無女字二紙龍施菩薩本起經一卷或云龍施女經或云龍施本經四紙八吉祥神呪經一卷或無神字三紙八陽神呪經一卷亦云八陽經別有一本亦云八陽神呪可半紙許初有七佛名號者非也四紙八吉祥經一卷亦云八方八世界八佛名號經二紙八佛名號經一卷四紙盂蘭盆經一卷亦云盂蘭經二紙報恩奉盆經一卷一紙佛說浴像功德經一卷三藏寶思惟譯三紙浴像功德經一卷三藏義淨譯四紙挍量數珠功德經一卷二紙數珠功德經一卷內云曼殊室利呪藏中校量數珠功德法二紙上二十九經二十九卷同帙。",
        "from": "T55n2154_019:0685b02_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "不空羂索神變真言經三十卷三帙五百二十六紙不空羂索呪經一卷亦云不空羂索觀世音心呪經一十一紙不空羂索神呪心經一卷一十三紙不空羂索陀羅尼自在王呪經三卷亦名不空羂索心呪王經三十四紙不空羂索陀羅尼經一卷一名普門三十七紙千眼千臂觀世音菩薩陀羅尼神呪經二卷或一卷一十九紙千手千眼觀世音菩薩姥陀羅尼身經一卷或云千臂千眼二十二紙千手千眼觀世音菩薩廣大圓滿無礙大悲心陀羅尼經一卷一十九紙觀世音菩薩祕密藏神呪經一卷八紙觀世音菩薩如意摩尼陀羅尼經一卷七紙上九經十二卷同帙。",
        "from": "T55n2154_019:0685b18_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "觀自在菩薩如意心陀羅尼呪經一卷四紙如意輪陀羅尼經一卷此經出大蓮花金剛三昧耶加持祕密無障礙經二十四紙文殊師利根本一字陀羅尼經一卷題云大方廣菩薩藏中文殊師利根本一字陀羅尼法亦名一字呪王經三紙曼殊室利菩薩呪藏中一字呪王經一卷三紙十二佛名神呪經一卷題云十二佛名神呪校量功德除障滅罪經六紙稱讚如來功德神呪經一卷三紙孔雀王呪經一卷亦名大金色孔雀王經并結界場法具八紙大金色孔雀王呪經一卷五紙佛說大金色孔雀王呪經一卷八紙孔雀王呪經二卷亦云孔雀王陀羅尼經四十二紙大孔雀呪王經三卷六十紙上十一經十四卷同帙。",
        "from": "T55n2154_019:0685c04_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "陀羅尼集經十二卷三百四十三紙十一面觀世音神呪經一卷一十紙十一面神呪心經一卷一十紙摩利支天經一卷或上加小字二紙呪五首經一卷或無經字二紙千囀陀羅尼觀世音菩薩呪經一卷或無經字三紙六字神呪經一卷或云六字呪法六紙七俱胝佛大心准提陀羅尼經一卷亦直云七俱胝佛母心經五紙七俱胝佛母准泥大明陀羅尼經一卷一十六紙上九經二十卷二帙上帙七卷下帙十三卷。",
        "from": "T55n2154_019:0685c16_17",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "觀自在菩薩隨心呪經一卷亦名多唎心經十九紙種種雜呪經一卷或無經字六紙佛頂尊勝陀羅尼經一卷杜行顗奉制譯七紙佛頂最勝陀羅尼經一卷日照三藏譯八紙佛頂尊勝陀羅尼經一卷佛陀波利譯七紙最勝佛頂陀羅尼淨除業障經一卷日照三藏再譯十三紙佛頂尊勝陀羅尼經一卷義淨三藏譯或加呪字八紙無量門微密持經一卷一名成道降魔得一切智經六紙出生無量門持經一卷或云新微密持經七紙阿難陀目佉尼呵離陀經一卷或云出無量門持經一十紙無量門破魔陀羅尼經一卷或直云破魔陀羅尼經一十一紙阿難陀目佉尼訶離陀隣尼經一卷一十紙舍利弗陀羅尼經一卷八紙一向出生菩薩經一卷一十二紙出生無邊門陀羅尼經一卷一十四紙勝幢臂印陀羅尼經一卷二紙妙臂印幢陀羅尼經一卷別有一本十六七紙非是本經不可流布二紙上十七經十七卷同帙無崖際持法門經一卷一名無際經一十五紙尊勝菩薩所問一切法入無量門陀羅尼經一卷或直云尊勝菩薩所問亦云入無量門陀羅尼十七紙金剛上味陀羅尼經一卷一十五紙金剛場陀羅尼經一卷一十四紙師子奮迅菩薩所問經一卷二紙華聚陀羅尼呪經一卷三紙華積陀羅尼神呪經一卷三紙六字呪王經一卷五紙六字神呪王經一卷六紙虛空藏菩薩問佛經一卷亦云虛空藏菩薩問七佛陀羅尼呪經亦云七佛神呪經十二紙如來方便善巧呪經一卷十紙持句神呪經一卷亦云陀羅尼句三紙陀隣尼鉢經一卷亦云陀隣鉢呪三紙東方最勝燈王如來經一卷題云東方最勝燈王如來遣二菩薩送呪奉釋迦如來助護持世間經十三紙善法方便陀羅尼經一卷六紙金剛祕密善門陀羅尼經一卷五紙護命法門神呪經一卷一十一紙無垢淨光大陀羅尼經一卷一十二紙請觀世音菩薩消伏毒害陀羅尼呪經一卷亦直云請觀世音經十二紙上十九經十九卷同帙。",
        "from": "T55n2154_019:0686b06_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "內藏百寶經一卷亦云內藏百品八紙溫室洗浴眾僧經一卷亦直云溫室經三紙須賴經一卷十八紙私訶昧經一卷或云私訶末經一名菩薩道樹經亦名道樹三昧經十一紙菩薩生地經一卷一名差摩竭經三紙四不可得經一卷五紙梵女首意經一卷一名首意女經五紙成具光明定意經一卷或云成具光明三昧經或直云成具光明經二十二紙寶網經一卷亦云寶網童子經二十三紙菩薩行五十緣身經一卷亦云菩薩緣身五十事經亦云五十緣身行經六紙菩薩修行經一卷亦云威施長者問觀身行經亦云長者修行經七紙諸德福田經一卷或直云福田經或云諸福田經五紙大方等如來藏經一卷或直云如來藏經九紙佛語經一卷四紙金色王經一卷九紙演道俗業經一卷九紙百佛名經一卷六紙上十七經十七卷同帙。",
        "from": "T55n2154_019:0686b26_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "稱揚諸佛功德經三卷亦名集諸佛花經一名集花經一名現在佛名經或四卷五十七紙須真天子經三卷亦云須真天子所問經亦云問四事經或二卷四十六紙摩訶摩耶經一卷一名佛昇忉利天為母說法經亦云摩耶經或二卷二十六紙除恐災患經一卷一十七紙孛經一卷或云孛經鈔一十八紙觀世音菩薩受記經一卷一名觀世音受決經一十三紙上六經十卷同帙。",
        "from": "T55n2154_019:0686c07_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "海龍王經四卷或三卷七十三紙首楞嚴三昧經三卷或二卷亦直云首楞嚴經僧祐錄云新首楞嚴經五十二紙觀普賢菩薩行法經一卷云出深功德經或無行法字亦云普賢觀經一十六紙觀藥王藥上二菩薩經一卷一十九紙不思議光菩薩所問經一卷亦云不思議光菩薩所說經亦云無思光孩童菩薩經一十二紙上五經十卷同帙。",
        "from": "T55n2154_019:0686c16_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "十住斷結經十卷最勝問菩薩十住除垢斷結經一名十千日光三昧定亦云十地斷結經或十一卷或十四卷二百五十四紙諸佛要集經二卷亦直云要集經天竺曰佛陀僧祇提四十三紙未曾有因緣經二卷或無因緣字度羅睺羅沙彌序四十紙上三經十四卷二帙。",
        "from": "T55n2154_019:0686c21_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "菩薩瓔珞經十二卷一名現在報或十四卷或十六卷或十三卷三百三十七紙超日明三昧經二卷或直云超日明經或三卷四十八紙上二經十四卷二帙。",
        "from": "T55n2154_019:0686c25_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "賢劫經十三卷題云颰陀劫三昧晉曰賢劫定意經舊錄云賢劫三昧經或十卷或七卷一帙一百九十二紙大乘經單譯大乘經單譯一百三十一部二百九十三卷二十四帙大法炬陀羅尼經二十卷二帙二百九十八紙大威德陀羅尼經二十卷二帙二百六十八紙佛名經十二卷或云十三卷或分為二十卷二百五十三紙三劫三千佛名經三卷莊嚴劫上賢劫中星宿劫下五十九紙上二經十五卷二帙上帙七卷下帙八卷。",
        "from": "T55n2154_019:0687a06_16",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五千五百佛名經八卷一百三十一紙不思議功德諸佛所護念經二卷或直云不思議功德經或四卷三十七紙上二經十卷同帙。",
        "from": "T55n2154_019:0687a10_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "華手經十三卷一名攝諸善根經亦名攝諸福德經或十一卷或十二卷或十卷一帙二百二十九紙大方等陀羅尼經四卷一名方等檀特陀羅尼經或無大字六十三紙僧伽吒經四卷五十一紙力莊嚴三昧經三卷三十八紙大方廣圓覺修多羅了義經一卷二十七紙上四經十二卷同帙。",
        "from": "T55n2154_019:0687a18_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "觀佛三昧海經十卷或云觀佛三昧經或八卷一帙一百五十六紙大方便佛報恩經七卷一百二十六紙菩薩本行經三卷四十七紙上二經十卷同帙。",
        "from": "T55n2154_019:0687a23_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法集經六卷或七卷或八卷一百二十七紙觀察諸法行經四卷六十三紙上二經十卷同帙。",
        "from": "T55n2154_019:0687a26_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "菩薩處胎經五卷初云菩薩從兜術天降神母胎說廣普經亦直云胎經或八卷或四卷一百十五紙弘道廣顯三昧經四卷一名阿耨達龍王所問決諸狐疑清淨品亦名入金剛問定意經凡十二品或二卷五十五紙施燈功德經一卷一名然燈經一十五紙上三經十卷同帙。",
        "from": "T55n2154_019:0687b04_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "央崛魔羅經四卷七十八紙無所有菩薩經四卷六十二紙明度五十挍計經二卷或無明度字或無五十字四十紙上三經十卷同帙。",
        "from": "T55n2154_019:0687b08_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "中陰經二卷二十八紙大法鼓經二卷三十一紙文殊師利問經二卷亦直云文殊問經五十一紙月上女經二卷維摩詰之女二十九紙大方廣如來祕密藏經二卷二十四紙上五經十卷同帙。",
        "from": "T55n2154_019:0687b14_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘密嚴經三卷五十六紙占察善惡業報經二卷亦名大乘實義經出六根聚經亦直云占察經亦名地藏菩薩經二十八紙蓮華面經二卷二十三紙文殊師利問菩薩署經一卷亦云文殊問署經二十紙大乘造像功德經二卷或一卷二十一紙上五經十卷同帙。",
        "from": "T55n2154_019:0687b21_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "廣大寶樓閣善住祕密陀羅尼經三卷四十一紙一字佛頂輪王經五卷亦名五佛頂經或四卷一百二十一紙大陀羅尼末法中一字心呪經一卷一十四紙上三經九卷同帙。",
        "from": "T55n2154_019:0687b27_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經十卷一帙一百四十三紙大毘盧遮那成佛神變加持經七卷亦云大毘盧遮那成佛經一百三十五紙蘇婆呼童子經三卷亦云蘇婆呼請問經或云蘇婆呼律或云蘇磨呼或二卷四十九紙上二經十卷同帙。",
        "from": "T55n2154_019:0687c06_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "蘇悉地羯羅經三卷九十一紙牟梨曼陀羅呪經一卷或無經字三十三紙金剛頂瑜伽中略出念誦法四卷亦云經八十一紙上三經八卷同帙。",
        "from": "T55n2154_019:0687c11_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "七佛所說神呪經四卷初卷云七佛十一菩薩說大陀羅尼神呪經七十三紙大吉義神呪經二卷或四卷三十九紙文殊師利寶藏陀羅尼經一卷一十七紙金剛光焰止風雨陀羅尼經一卷二十一紙阿吒婆拘鬼神大將上佛陀羅尼經一卷亦直云阿吒婆拘呪經五紙阿彌陀鼓音聲王陀羅尼經一卷四紙大普賢陀羅尼經一卷三紙大七寶陀羅尼經一卷一紙六字大陀羅尼呪經一卷二紙安宅神呪經一卷亦云安宅呪經四紙摩尼羅亶經一卷亦云摩尼羅亶神呪經四紙玄師颰陀所說神呪經一卷錄云幻師無所說字或作跋字亦云波陀古錄云幻士跋陀經二紙護諸童子陀羅尼呪經一卷亦云護諸童子請求男女陀羅尼經四紙諸佛心陀羅尼經一卷三紙拔濟苦難陀羅尼經一卷二紙八名普密陀羅尼經一卷二紙持世陀羅尼經一卷四紙六門陀羅尼經一卷一紙清淨觀世音普賢陀羅尼經一卷此經有一錯本應須審之五紙上十九經二十三卷同帙。",
        "from": "T55n2154_019:0688a08_10",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "智炬陀羅尼經一卷三紙諸佛集會陀羅尼經一卷四紙隨求即得大自在陀羅尼神呪經一卷亦云隨求所得一十四紙百千印陀羅尼經一卷二紙救面燃餓鬼陀羅尼神呪經一卷亦云施餓鬼食呪經後兼有施水呪四紙莊嚴王陀羅尼呪經一卷四紙香王菩薩陀羅尼呪經一卷二紙一切功德莊嚴王經一卷一十四紙拔除罪障呪王經一卷三紙善夜經一卷三紙虛空藏菩薩能滿諸願最勝心陀羅尼求聞持法一卷亦云虛空藏菩薩求聞持法經四紙金剛頂經曼殊室利菩薩五字心陀羅尼品一卷一十一紙觀自在如意輪菩薩瑜伽法要一卷九紙佛地經一卷一十三紙佛垂般涅槃略說教誡經一卷亦云佛臨般涅槃一名遺教經六紙出生菩提心經一卷一十一紙佛印三昧經一卷三紙文殊師利般涅槃經一卷四紙異出菩薩本起經一卷或無起字一十一紙千佛因緣經一卷一十八紙賢首經一卷一名賢首夫人經三紙月明菩薩經一卷或加三昧字或云月明童子經亦云月明童男經三紙心明經一卷一名心明女梵志婦飯汁施經三紙滅十方冥經一卷或云十方滅冥經六紙鹿母經一卷別有鹿子經一卷與此全同三紙魔逆經一卷一十三紙上二十六經二十六卷同帙。",
        "from": "T55n2154_019:0688b11_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "德光太子經一卷一名賴吒和羅所問光德太子經一十九紙大意經一卷五紙堅固女經一卷一名牢固女經六紙商主天子所問經一卷或無所問字一十七紙諸法最上王經一卷二十三紙師子莊嚴王菩薩請問經一卷一名八曼荼羅經五紙離垢慧菩薩所問禮佛法經一卷六紙受持七佛名號所生功德經一卷四紙佛臨涅槃記法住經一卷或加般字五紙寂照神變三摩地經一卷一十六紙差摩婆帝受記經一卷三紙不增不減經一卷或云二卷者誤七紙造塔功德經一卷二紙右繞佛塔功德經一卷亦云繞塔功德經三紙大乘四法經一卷與重譯中日照出者名字雖同經體全異八紙有德女所問大乘經一卷時有一本可八九紙文錯不堪四紙大乘流轉諸有經一卷三紙妙色王因緣經一卷四紙佛為海龍王說法印經一卷一紙師子素馱娑王斷肉經一卷四紙般泥洹後灌臘經一卷一名般泥洹後四輩灌臘經亦直云灌臘經二紙八部佛名經一卷亦云八佛經三紙上二十二經二十二卷同帙。",
        "from": "T55n2154_019:0688c06_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "菩薩內習六波羅蜜經一卷或云內六波羅蜜經安公云出方等部三紙菩薩投身餓虎起塔因緣經一卷僧祐錄云以身施餓虎經十一紙金剛三昧本性清淨不壞不滅經一卷亦名金剛清淨經八紙師子月佛本生經一卷七紙長者法志妻經一卷三紙薩羅國經一卷或云薩羅國王經四紙十吉祥經一卷二紙長者女菴提遮師子吼了義經一卷六紙一切智光明仙人慈心因緣不食肉經一卷五紙金剛三昧經二卷或一卷二十七紙法滅盡經一卷三紙甚深大迴向經一卷四紙天王太子辟羅經一卷亦云太子譬羅經或無天王字二紙優婆夷淨行法門經二卷亦直云淨行經或無經字三十二紙八大人覺經一卷一紙三品弟子經一卷亦云弟子學有三輩經三紙四輩經一卷或云四輩弟子經或云四輩學經三紙當來變經一卷或云當來變識經二紙過去佛分衛經一卷或云過世二紙十二頭陀經一卷一名沙門頭陀經五紙樹提伽經一卷三紙長壽王經一卷六紙法常住經一卷二紙上二十三經二十五卷同帙。",
        "from": "T55n2154_019:0689a06_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘律大乘律二十六部　五十四卷　五帙菩薩地持經十卷或無經字亦云論亦名菩薩戒經又名菩薩經或八卷一帙一百八十六紙菩薩善戒經九卷一名菩薩地或十卷一百八十紙淨業障經一卷一十五紙上二經十卷同帙。",
        "from": "T55n2154_019:0689a12_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "優婆塞戒經七卷或五卷或六卷或十卷是在家菩薩戒一百三十一紙梵網經二卷三十六紙受十善戒經一卷一十六紙上三經十卷同帙。",
        "from": "T55n2154_019:0689a17_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "菩薩瓔珞本業經二卷或直云瓔珞本業經三十九紙佛藏經四卷一名選擇諸法經或三卷或二卷七十紙菩薩戒本一卷曇無讖譯一十一紙菩薩戒本一卷三藏玄奘譯一十八紙菩薩戒羯磨文一卷六紙菩薩善戒經一卷憂波離問菩薩受戒法一十五紙上六經十卷同帙。",
        "from": "T55n2154_019:0689a24_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "菩薩內戒經一卷一十八紙優婆塞五戒威儀經一卷一十五紙文殊師利淨律經一卷或真名淨律經一十三紙清淨毘尼方廣經一卷一十七紙寂調音所問經一卷一名如來所說清淨調伏經一十八紙大乘三聚懺悔經一卷十三紙菩薩五法懺悔文一卷二紙菩薩藏經一卷一十紙三曼陀颰陀羅菩薩經一卷七紙菩薩受齋經一卷三紙文殊悔過經一卷一名文殊五體悔過經二十一紙舍利弗悔過經一卷亦直名悔過經五紙法律三昧經一卷亦直云法律經七紙十善業道經一卷六紙上十四經十四卷同帙。",
        "from": "T55n2154_019:0689b11_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘論大乘論九十七部　五百一十八卷　五十帙二十一部一百五十五卷釋經論七十六部三百六十三卷集義論大智度論一百卷或云大智度經論亦云摩訶般若釋論或一百一十卷或七十卷十帙二千八十五紙十地經論十二卷或一十五卷一帙二百四十六紙彌勒菩薩所問經論五卷或六卷或七卷或十卷一百二十八紙大乘寶積經論四卷八十四紙寶髻菩薩四法經論一卷題云寶髻經四法優波提經一十二紙上三論十卷同帙。",
        "from": "T55n2154_019:0689b22_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "佛地經論七卷一百一十七紙金剛般若論二卷無著菩薩造三十紙能斷金剛般若波羅蜜多經論頌一卷亦云能斷金剛論頌四紙上三論十卷同帙。",
        "from": "T55n2154_019:0689b27_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "金剛般若波羅蜜經論三卷天親菩薩造四十八紙能斷金剛般若波羅蜜多經論釋三卷亦云能斷金剛論釋三十三紙金剛般若波羅蜜經破取著不壞假名論二卷亦名功德施論三十三紙文殊師利菩薩問菩提經論二卷一云文殊問菩提經論一云伽耶山頂論經三十紙妙法蓮華經論一卷題云妙法蓮華經優波提舍二十五紙上五論十一卷同帙。",
        "from": "T55n2154_019:0689c08_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "法華經論二卷初有歸敬頌者是或一卷題亦云妙法蓮華經優波提舍三十紙勝思惟梵天所問經論四卷或三卷五十九紙涅槃論一卷或云大般涅槃經論一十紙涅槃經本有今無偈論一卷亦直云本有本無論六紙遺教經論一卷二十六紙無量壽經論一卷題云無量壽經優波提舍願生偈七紙三具足經論一卷題云三具足經優波提舍一十八紙轉法輪經論一卷題云轉法輪經優波提舍一十紙上八論十二卷同帙已上釋經論已下集義論。",
        "from": "T55n2154_019:0689c17_18",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "瑜伽師地論一百卷十帙一千八百十七紙顯揚聖教論二十卷二帙三百三十七紙瑜伽師地論釋一卷最勝子等諸菩薩造十九紙顯揚聖教論頌一卷無著造凡十一品一十三紙王法正理論一卷二十紙大乘阿毘達磨集論七卷一百三紙上四論十卷同帙。",
        "from": "T55n2154_019:0689c24_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘阿毘達磨雜集論十六卷二百五十五紙中論四卷亦云中觀論或八卷九十八紙上二論二十卷二帙。",
        "from": "T55n2154_019:0690a02_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "般若燈論釋十五卷二百五十二紙十二門論一卷二十四紙十八空論一卷二十二紙百論二卷四十三紙廣百論本一卷八紙上五論二十卷二帙。",
        "from": "T55n2154_019:0690a08_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘廣百論釋論十卷一帙一百九十七紙十住毘婆沙論十四卷或無論字或十二卷或十五卷二百七十六紙菩提資糧論六卷六十七紙上二論二十卷二帙。",
        "from": "T55n2154_019:0690a13_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘莊嚴經論十三卷或十五卷一帙二百五紙大莊嚴論經十五卷或無經字或十卷二百九紙順中論二卷題云順中論義入大般若波羅蜜經初品法門三十二紙攝大乘論三卷真諦三藏譯五十九紙上三論二十卷二帙。",
        "from": "T55n2154_019:0690a18_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "攝大乘論二卷佛陀扇多譯四十四紙攝大乘論本三卷三藏玄奘譯六十一紙攝大乘論釋十五卷天親釋真諦譯或十二卷亦云釋論三百二十七紙上三論二十卷二帙。",
        "from": "T55n2154_019:0690a23_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "攝大乘論釋論十卷世親釋笈多譯一帙一百五十六紙攝大乘論釋十卷世親釋玄奘譯一帙一百七十六紙攝大乘論釋十卷無性釋玄奘譯一帙二百十六紙佛性論四卷八十三紙決定藏論三卷五十三紙辯中邊論頌一卷五紙中邊分別論二卷或三卷三十八紙上四論十卷同帙。",
        "from": "T55n2154_019:0690b04_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "辯中邊論三卷三十九紙究竟一乘寶性論四卷亦云寶性分別一乘增上論或三卷或二卷八十紙業成就論一卷一十二紙大乘成業論一卷一十七紙因明正理門論本一卷三藏玄奘譯一十五紙上五論十卷同帙。",
        "from": "T55n2154_019:0690b11_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "因明正理門論一卷三藏義淨譯一十六紙因明入正理論一卷六紙顯識論一卷題云顯識品從無相論出一十九紙轉識論一卷三紙唯識論一卷一名破色心初云唯識無境界或云唯識無境界論一十九紙唯識論一卷初云修道不共他一十紙唯識寶生論五卷一名二十唯識順釋論六十五紙唯識三十論一卷二紙唯識二十論一卷十紙上九論十三卷同帙。",
        "from": "T55n2154_019:0690b21_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "成唯識論十卷一帙一百七十五紙大丈夫論二卷三十四紙入大乘論二卷四十一紙大乘掌珍論二卷三十三紙大乘五蘊論一卷世親造玄奘譯八紙大乘廣五蘊論一卷與前論異本或無廣字安慧造日照譯一十三紙寶行王正論一卷一十九紙大乘起信論一卷真諦三藏譯二十五紙上七論十卷同帙。",
        "from": "T55n2154_019:0690c02_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大乘起信論二卷實叉難陀譯二十四紙發菩提心論二卷或云發菩提心經亦云經論二十八紙三無性論二卷題云三無性論品出無相論或一卷三十五紙方便心論一卷或二卷凡四品一十七紙如實論一卷題云如實論反質難品二十三紙無相思塵論一卷或直云思塵論三紙觀所緣論一卷三紙觀所緣論釋一卷一十三紙上八論十一卷同帙。",
        "from": "T55n2154_019:0690c11_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "迴諍論一卷二十五紙緣生論一卷一十一紙十二因緣論一卷四紙一輸盧迦論一卷或云一書三紙大乘百法明門論一卷題云大乘百法明門論本事分中略錄名數二紙百字論一卷八紙解拳論一卷二紙掌中論一卷三紙取因假設論一卷九紙觀總相論頌一卷一紙止觀門論頌一卷四紙手杖論一卷七紙六門教授習定論一卷九紙大乘法界無差別論一卷六紙破外道小乘四宗論一卷六紙破外道小乘涅槃論一卷五紙上十六論十六卷同帙。",
        "from": "T55n2154_019:0690c28_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "都計大乘經律論見入藏者。",
        "from": "T55n2154_019:0691a01_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "總六百三十八部。",
        "from": "T55n2154_019:0691a02_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "合二千七百四十五卷。",
        "from": "T55n2154_019:0691a02_12",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二百五十八帙。",
        "from": "T55n2154_019:0691a03_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "與前廣錄部數不同者。",
        "from": "T55n2154_019:0691a04_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "前廣錄中以大寶積經諸部合成分為四十九部上錄。",
        "from": "T55n2154_019:0691a05_14",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "此合為一部。",
        "from": "T55n2154_019:0691a06_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "故欠四十八部不同。",
        "from": "T55n2154_019:0691a06_12",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "開元釋教錄卷第十九　入藏錄卷上",
        "from": "T55n2154_019:0691a07_100",
        "context_with_next_sentence": false
    }
]