[
    {
        "source_sentence": "入唐新求聖教目錄",
        "from": "T55n2167_001:1078b27_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "長安五臺山及揚州等處。所求經論念誦法",
        "from": "T55n2167_001:1078b29_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "門。及章疏傳記等。都計五百八十四部。八百",
        "from": "T55n2167_001:1078c01_0",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二卷。",
        "from": "T55n2167_001:1078c02_2",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "胎藏金剛界兩部大曼陀羅。",
        "from": "T55n2167_001:1078c02_14",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "及諸尊壇像。",
        "from": "T55n2167_001:1078c03_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "舍利并高僧真影等。",
        "from": "T55n2167_001:1078c03_10",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "都計五十種。",
        "from": "T55n2167_001:1078c03_16",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "在長安城。",
        "from": "T55n2167_001:1078c04_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "所求經論章疏傳等。",
        "from": "T55n2167_001:1078c04_13",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "四百二十三部。",
        "from": "T55n2167_001:1078c05_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "五百五十九卷。",
        "from": "T55n2167_001:1078c05_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "胎藏金剛兩部大曼荼羅及諸尊曼荼羅壇像并道具等二十一種。",
        "from": "T55n2167_001:1078c06_16",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "在五臺山。",
        "from": "T55n2167_001:1078c07_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "所求天台教迹。",
        "from": "T55n2167_001:1078c07_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "及諸章疏傳等。",
        "from": "T55n2167_001:1078c07_18",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三十四部。",
        "from": "T55n2167_001:1078c08_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "三十七卷。",
        "from": "T55n2167_001:1078c08_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "并臺山土石等三種。",
        "from": "T55n2167_001:1078c08_17",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "在揚州。",
        "from": "T55n2167_001:1078c09_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "所求經論章疏傳等。",
        "from": "T55n2167_001:1078c09_12",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一百二十八部。",
        "from": "T55n2167_001:1078c09_19",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "一百九十八卷。",
        "from": "T55n2167_001:1078c10_6",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "胎藏金剛兩部大曼荼羅及諸尊壇樣。",
        "from": "T55n2167_001:1078c11_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "高僧真影。",
        "from": "T55n2167_001:1078c11_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "及舍利等。",
        "from": "T55n2167_001:1078c11_14",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "二十二種。",
        "from": "T55n2167_001:1078c11_19",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "聖迦抳忿怒金剛童子菩薩成就儀軌經三卷大興善寺三藏譯金剛頂經瑜伽文殊師利菩薩法一品一卷中間更題云金剛頂文殊菩薩儀軌供養法　不空三藏譯大威怒烏芻澀摩儀軌一卷不空譯佛為優填王說王法政論經一卷不空速疾立驗魔醯首羅天說迦樓羅阿尾奢法一卷不空觀自在菩薩如意輪瑜伽一卷不空金輪王佛頂要略念誦法一卷通諸佛頂　不空金剛壽命陀羅尼念誦法一卷不空聖觀自在菩薩心真言瑜伽觀行儀軌一卷不空金剛頂經多羅菩薩念誦法一卷不空甘露軍荼利菩薩供養念誦成就儀軌一卷不空文殊師利菩薩根本大教王金翅鳥王品一卷不空不空羂索毘盧遮那佛大灌頂光明真言一卷不空金剛頂超勝三界經說文殊五字真言勝相一卷不空五字陀羅尼頌一卷不空大日經略攝念誦隨行法一卷不空木槵經一卷大毘盧遮那成佛神變加持經略示七支念誦隨行法一卷不空金剛頂降三世大儀軌法王教中觀自在菩薩心真言一切如來蓮華大曼荼羅品一卷不空大聖曼殊室利童子菩薩一字真言有二種亦名五字瑜伽法一卷不空金剛頂經觀自在王如來修行法一卷不空金剛頂瑜伽中發阿耨多羅三藐三菩提心論一卷亦名瑜伽總持教門說菩提心觀行修持義　不空金剛頂瑜伽他化自在天理趣會普賢修行念誦儀軌一卷不空金剛頂瑜伽降三世成就極深密門一卷不空與遍智譯仁王般若陀羅尼釋一卷不空佛說大輪金剛總持陀羅尼印法一卷不空佛說一髻尊陀羅尼經一卷不空阿閦如來念誦供養法一卷不空金剛頂勝初瑜伽普賢菩薩念誦法經一卷不空金剛頂瑜伽護摩儀軌一卷不空陀羅尼門法諸部要目一卷不空大聖文殊師利菩薩讚佛法身禮一卷不空仁王般若念誦法經一卷不空成就妙法蓮華經瑜伽觀智儀軌一卷不空金剛頂勝初瑜伽經中略出大樂金剛薩埵念誦儀軌一卷不空大樂金剛不空真實三昧經般若波羅蜜多理趣釋一卷不空金剛界瑜伽略述三十七尊心要一卷大廣智三藏說金剛頂瑜伽千手千眼觀自在菩薩修行儀軌經一卷不空大方廣佛華嚴經入法界品四十二字觀門一卷不空大方廣佛華嚴經入法界品頓證毘盧遮那法身字輪瑜伽儀軌一卷不空觀自在菩薩如意輪念誦法儀軌一卷不空佛頂尊勝陀羅尼念誦儀軌經一卷不空如意輪菩薩真言注義一卷不空佛頂尊勝陀羅尼注義一卷不空聖閻曼德迦威怒王立成大神驗念誦法一卷不空金剛王菩薩祕密念誦儀軌一卷不空無量壽如來修觀行供養儀軌一卷不空普賢金剛薩埵瑜伽念誦儀軌一卷不空佛說摩利支天經一卷不空金剛頂經一字頂輪王瑜伽一切時處念誦成佛儀軌一卷不空仁王護國般若波羅蜜多經陀羅尼念誦儀軌一卷不空新譯仁王般若經陀羅尼念誦儀軌序一卷不空瑜伽蓮華部念誦法經一卷不空瑜伽醫迦訖沙羅烏瑟尼沙斫訖羅真言安怛陀那儀則一卷不空一字頂輪王瑜伽經一卷不空一字頂輪王念誦儀軌一卷不空大虛空藏菩薩念誦法一卷不空略述金剛頂瑜伽分別聖位修證法門序一卷不空受菩提心戒儀一卷不空般若波羅蜜多理趣經大安樂不空三昧耶真實金剛菩薩等一十七聖大曼荼羅義述一卷阿目佉金剛述金剛頂經金剛界大道場毘盧舍那如來自受用身內證智眷屬法身異名佛最上乘祕密三摩地禮懺文一卷不空文殊問經字母品第十四一卷不空瑜伽金剛頂經釋字母品一卷不空金剛頂瑜伽金剛薩埵五祕密修行念誦儀軌一卷不空十一面觀自在菩薩心密言儀軌經三卷不空菩提場莊嚴陀羅尼經一卷不空一切如來心祕密全身舍利寶篋印陀羅尼經一卷不空八大菩薩曼荼羅經一卷不空金剛頂瑜伽十八會指歸一卷不空大吉祥天女十二名號經一卷不空佛說一切如來金剛壽命陀羅尼經一卷金剛智譯大乘緣生論一卷不空大樂金剛薩埵修行成就儀軌一卷不空大藥刃女歡喜母并愛子成就法一卷亦名訶哩底母法　不空七俱智佛母所說准提陀羅尼經一卷不空觀自在大悲成就瑜伽蓮華部念誦法門一卷不空佛說大孔雀明王畫像壇儀軌一卷不空大聖文殊師利菩薩佛剎功德莊嚴經三卷不空大方廣如來藏經一卷不空末利支提婆華鬘經一卷不空佛說十力經一卷勿提犀譯佛說迴向輪經一卷尸羅達摩譯華嚴長者問佛那羅延力經一卷般若波羅蜜多心經一卷出生無邊門陀羅尼經一卷不空葉衣觀自在菩薩經一卷不空大佛頂廣聚陀羅尼經五卷不動使者陀羅尼祕密法一卷金剛菩提譯修習般若波羅蜜菩薩觀行念誦儀軌一卷不空金剛手光明灌頂經最勝立印聖無動尊大威怒王念誦儀軌法品一卷不空共遍智同譯金剛頂經瑜伽修習毘盧舍那三摩地法一卷金剛智譯佛說十地經九卷尸羅達摩譯金剛頂一切如來真實攝大乘現證大教王經三卷不空佛頂尊勝陀羅尼呪一卷千手千眼觀世音菩薩廣大圓滿無礙大悲心大陀羅尼神妙章句一卷金剛恐怖集會方廣儀軌觀自在菩薩三世最勝心明王經一卷不空大方廣曼殊室利經觀自在菩薩授記品第三十四一卷不空金剛頂瑜伽念珠經一卷不空大樂金剛不空真實三摩耶經般若波羅蜜多理趣品一卷不空金剛頂經瑜伽文殊師利菩薩法一品一卷亦名五字呪法青龍題云金剛經瑜伽文殊師利菩薩真言經雖題目別意義同也　不空普賢菩薩行願讚一卷不空百千頌大集經地藏菩薩請問法身讚一卷不空佛說大吉祥天女十二契一百八名無垢大乘經一卷阿唎多羅陀羅尼阿嚕力品第十四一卷不空一字奇特佛頂經三卷不空底哩三昧耶不動尊威怒王使者念誦法一卷不空能淨一切眼疾病陀羅尼經一卷不空除一切疾病陀羅尼經一卷不空佛說救拔焰口餓鬼陀羅尼經一卷佛說三十五佛名禮懺文一卷不空訶利帝母真言法一卷不空觀自在菩薩說普賢陀羅尼經一卷不空毘沙門天王經一品一卷不空雨寶陀羅尼經一卷不空禳麌梨童女經一卷不空菩提場所說一字頂輪王經五卷不空金剛恐怖集會方廣儀軌觀自在菩薩三世最勝心明王經大威力烏樞瑟摩明王經二卷北天竺三藏阿質達霰譯穢跡金剛說神通大滿陀羅尼法術靈要門一卷沙門阿質達霰譯穢跡金剛法禁百變法經沙門阿質達霰譯普遍智藏般若波羅蜜多心經一卷摩竭提國三藏法月譯千手千眼觀自在菩薩根本真言釋一卷千手千眼觀自在菩薩廣大圓滿無礙大悲心陀羅尼呪一卷金剛智新譯慈氏菩薩所說大乘經生稻𦼮喻經一卷不空北方毘沙門天王真言法一卷不空佛說阿吒婆拘大元率將無邊神力隨心陀羅尼經一卷金剛頂蓮花部心念誦儀軌梵本真言二卷大寶廣博樓閣善住祕密陀羅尼經三卷不空大雲輪請雨經二卷不空　下卷注未有祈雨者是也佛母大孔雀明王經三卷不空上三部九卷同怪十八上三經寫得大興善寺翻經院本觀自在菩薩心真言瑜伽觀行儀軌一卷不空施諸餓鬼飲食及水法并手印不空三藏口決一卷文殊師利瑜伽五字念誦經修行教一卷轉法輪菩薩摧魔怨敵法一卷大聖妙吉祥菩薩祕密八字陀羅尼修行曼荼羅次第儀軌法一卷淨智金剛譯如意輪王摩尼跋陀別行法印一卷金剛吉祥大成就品一卷遍照佛頂等真言一卷不空千轉陀羅尼觀世音菩薩呪一卷不空　智通法師譯聖閻曼德迦威怒王立成大神驗念誦法一卷興善寺三藏譯大梵天王經觀世音菩薩擇地法品一卷無動使者法中略出印契法次第一卷金剛兒法一卷大毘盧遮那略要速疾門五支念誦法一卷觀自在菩薩如意輪陀羅尼一卷不空奇特最勝金輪佛頂念誦儀軌法要一卷摩利支天經一卷大隨求八印法一卷惟謹金剛頂瑜伽要決一卷拔濟苦難陀羅尼經一卷觀自在菩薩心真言一印念誦法一卷不空聖觀自在菩薩根本心真言觀布字輪觀門一卷大聖天歡喜雙身毘那耶迦法一卷不空大自在天法則儀軌一卷金剛頂經觀自在菩薩瑜伽修習三摩地法一卷清信士馬列述最上乘受菩提心戒及心地祕決一卷無畏流出一行記最上乘教授戒懺悔文一卷不空略敘金剛界大教王經師資相承傳法次第記一卷沙門海雲記略敘傳大毘盧舍那成佛神變加持經大教相承傳法次第記一卷沙門海雲集記金剛頂瑜伽要略念誦儀軌法一卷觀自在菩薩心真言念誦法一卷不空諸佛境界攝真實經三卷三藏般若譯不空羂索神變真言經二卷第六第七玉呬怛多羅經三卷毘那耶律藏經一卷大菩提心隨求陀羅尼一切佛心真言法一卷阿地瞿多譯佛說無量壽佛化身大忿迅俱摩羅金剛念誦瑜伽儀軌法一卷金剛智譯大輪金剛修行悉地成就及供養法一卷電光熾盛可畏形羅剎斯金剛最勝明經一卷降三世大會中觀自在菩薩說自心陀羅尼一卷金剛智三藏譯金剛童子持念經一卷毘盧遮那五字真言修習儀軌一卷不空大毘盧遮那胎藏經略解真言要儀一卷佛說普遍焰鬘清淨熾盛思惟寶印心無能勝總持隨求大明陀羅尼自在陀羅尼功能一卷金剛忿怒速疾成就真言一本梵字佛頂尊勝陀羅尼一本梵字菩提莊嚴陀羅尼一本梵字心真言一本梵字心中心真言一本梵字馬頭觀自在菩薩心真言一本梵字軍荼利金剛根本真言一本梵字烏樞澀摩心真言一本梵字軍荼利心真言一本梵字烏樞澀摩心中心真言一本梵字白傘蓋佛頂真言一本梵字馬頭觀世音心真言一本梵字三界無能勝真言一本梵字佛眼真言一本梵字七俱胝佛母真言一本梵字青頸觀音小心真言一本梵字文殊師利菩薩真言一本梵字文殊師利菩薩八字真言一本降三世五字真言一本一切如來白傘蓋大佛頂陀羅尼一本梵字羯磨部一百八名讚一本梵字五方歌讚一本梵字降魔讚一本梵字三身讚一本梵字吉慶伽陀九首一本一切如來心真言一本一切如來心印真言一本一切如來金剛被甲真言一本一切如來灌頂真言一本一切如來結界真言一本一切如來心中心真言一本一切如來隨心真言一本梵字法身緣生偈一本梵字金剛頂瑜伽經真言一本梵字賢劫十六菩薩真言一本梵字二十天真言一本梵字十波羅蜜真言一本梵字四無量真言一本梵字金剛王中九尊真言一本梵字觀自在聞持真言一本梵字觀自在聞持甘露真言一本焰口陀羅尼一本二十天名并真言一本梵字大毘盧遮那經真言一本梵字懺悔滅一切罪真言一本梵字菩提莊嚴心真言一本梵字寶樓閣心真言一本梵字文殊一字三字等并忿怒真言一本梵字孔雀王真言一本梵字觀自在心真言一本梵字如來慈真言一本梵字金剛延命真言一本梵字金剛壽命真言一本梵字金剛王真言一本梵字大忍真言一本梵字歡喜母真言一本梵字遏吒薄俱真言一本梵字龍猛集六妙真言一本梵字辨才真言一本梵字大悲心真言一本梵字五佛頂真言一本梵字大三昧耶真言一本梵字葉衣心真言一本梵字摩利支心真言一本梵字吉祥心真言一本梵字三部心真言一本梵字八大菩薩真言一本梵字不動尊心真言一本梵字七俱智真言一本梵字多羅真言一本梵字馬頭明王真言一本梵字金剛童子真言一本梵字童女心真言一本梵字滅惡趣真言一本梵字請天龍真言一本梵字送天龍真言一本梵字電光真言一本梵字電光心真言一本梵字虛空藏真言一本施一切眾生陀羅尼一本文殊釰真言一本甘露陀羅尼一本須彌盧王真言一本蓮華部瑜伽念誦法梵本真言一本梵字持世陀羅尼一本梵字心真言并小心真言一本梵字摩利支心并根本真言一本梵字文殊師利根本真言一本梵字六足尊心真言一本梵字尊勝真言一本梵字不空羂索真言一本梵字如意輪真言一本梵字袈裟加持供養真言一本梵字佛慈護真言一本梵字廣大寶樓閣金剛釰真言一本梵字文殊讚一本一切如來菩提心戒真言一本梵字不動尊鎮宅真言一本浴像燒香偈讚一本最上乘教受戒懺悔文一本菩提心戒一本用心次第一卷青龍寺新譯經等入藏目錄一卷十六大菩薩一百八名讚一卷七佛讚嘆一本大方廣佛花嚴經普賢菩薩行願讚一卷降三世金剛一百八名讚一本釋迦牟尼佛成道在菩提樹降魔讚二卷兩本三世金剛一百八名讚一本十六讚嘆一本天龍八部讚一本五讚嘆二卷兩本如來千輻輪相讚一本毘盧遮那心略讚一本大吉慶讚二卷兩本佛頂尊勝真言根本讚一本大尊讚一本梵字無垢淨光陀羅尼一本梵字相輪橖中陀羅尼一本梵字修造佛塔陀羅尼一本梵字置相輪橖中及塔四周以呪王法置於塔內真言一本梵字相輪真言一本佛部曼陀羅讚嘆一本觀自在法身讚嘆一本普集天龍八部讚一本蘇悉地并蘇摩呼經梵本一卷兩部二卷大虛空藏菩薩所問經八卷不空三藏譯大慈大悲救世觀世音自在菩薩廣大圓滿無礙自在青頸大悲心真言一卷不空大毘盧遮那成佛神變加持經蓮華胎藏悲生曼荼羅真言集一卷不空普遍光明大隨求陀羅尼經二卷阿密哩多軍荼利法一卷大聖甘露軍荼利念誦儀軌一卷大聖歡喜雙身法一卷佛頂尊勝陀羅尼別法一卷龜茲國僧着那譯烏芻沙摩最勝明王經一卷一字頂輪佛頂要法別行一卷鬼神大將元帥阿吒薄拘上佛陀羅尼出普集經一卷摩醯首羅天王法一卷蘇悉地羯羅供養真言集一卷梵字普賢行願讚一卷悉曇章一卷大般涅槃經如來性品十四音義二本竝是同本然一卷着朱脈為別也　羅什譯出十四音辨一卷沙門智玄述阿字觀門一卷沙門惟謹述阿闍梨要義一卷略釋毘盧遮那經中義一卷大毘盧遮那成佛神變加持經七卷无畏三藏譯大毘盧遮那經疏十四卷一行阿闍梨述大毘盧遮那經略識二卷中下梵網經盧舍那佛說指示門心地品卷上一卷摩騰竺法蘭譯梵網經盧舍那佛說菩薩十重四十八輕戒一卷略本梵網經盧舍那佛說菩薩心地戒品一卷極略本曹溪山第六祖惠能大師說見性頓教直了成佛決定無疑法寶記檀經一卷沙門入法譯仁王般若經疏三卷天台維摩經疏十卷豫州剌史揚敬之撰翻梵語十卷法華經圓鏡七卷缺第四六七卷華嚴經疏二十卷澄觀法師作法花圓鏡樞決一卷天長寺釋延秀集仁王護國般若經疏二卷沙門道液述金剛辨宗二卷沙門道液述金剛辨宗科文一卷阿彌陀經疏一卷沙門懷感述大佛頂疏隨文補闕鈔一卷仁王般若經科文一卷大佛頂隨疏科文一卷父母恩重經疏一卷西明寺沙門體清述安樂集一卷沙門道綽撰五方便心地法門抄一卷大方廣佛花嚴經普賢行願品疏一卷沙門澄觀述中觀論三十六門勢一卷沙門元康撰救謗方等經顯正一乘論一卷沙門弘沇述淨土法事讚二卷善導和尚撰百法論顯幽抄十卷沙門從方述大乘百法明門論疏一卷沙門義忠撰百法疏抄二卷上下　章敬寺沙門擇隣大乘百法論義選抄四卷河中金剛述大乘百法玄樞決一卷十二有支義一卷因明入正理論疏三卷沙門基撰因明入正理論疏一卷沙門清邁撰因明義斷一卷沙門惠沼撰十四過類記一卷因明義纂要一卷沙門惠沼述因明論科文一卷因明論義疏三卷沙門利因明義選上下二卷缺中卷沙門𮘆空錄因明正理門論述記一卷下卷沙門勝莊述因明義範一卷沙門空相大乘百法義門抄二卷沙門金則述因明義心一卷因明入正理論義衡二卷上下沙門清素撰略敘大小乘斷惑入道次位一卷兼略明三界義小乘入道位一卷依俱舍頌大小乘入道位次一卷十二門論疏翼贊抄序一卷宗四分比丘隨門要行儀一卷大般若波羅蜜經開題一卷法華二十八品序一卷蛇勢論一卷念佛讚一卷章敬寺沙門弘素述唯心觀一卷菩提達磨撰華嚴經法界觀門一卷京南山沙門杜順撰大方廣佛華嚴經金師子章一卷法性一心圖一卷新譯經論入藏經錄中書門下牒一卷南陽和尚問答雜徵義一卷劉澄集西國付法藏傳一卷行立禪師述佛性偈一卷大唐故弘景禪師石記一卷秀邑撰紫閣山大莫碑一卷沙門飛錫撰沙門無著入聖般若寺記一卷五臺山金剛窟收五功德記一卷大報無遷論一卷講論沙門知玄述皇帝降誕日內道場論衡一卷傅大士還源詩徵心行路難一卷讚西方淨土一卷長安資聖寺粥利記一卷內州道場談論沙門知玄撰長安資聖寺翻譯講論大德貞惠法師記并碑一卷供奉大德義通法師銘一卷長安資聖寺寶應觀音院壁上南岳天台等真影讚一卷天台等真影讚一卷九哢十紐圖一張此圖現傳于世真超所持又明了坊信範注抄一卷有之寫得了國忌表歎文一卷副安集一卷百司舉要一卷兩京新記三卷如五百字千字文一卷皇帝拜南郊儀注一卷丹鳳樓賦一卷曹溪禪師證道歌一卷真覺述甘泉和尚語本并大𮘆和尚傳心要旨一卷心鏡弄珠珠耀篇并禪性般若吟一卷長安左衛大薦福寺讚佛牙偈一卷內供奉三教講論大德知玄述會昌皇帝降誕日內道場論衡一卷利涉法師與𭑲珽論一卷詩賦格一卷碎金一卷京兆府百姓素索徵上表論釋教利害一卷建帝幢論一卷東山泰法師作杭越唱和詩一卷王建集一卷進土章解集一卷僕郡集一卷莊翱集一卷李張集一卷杜員外集二卷臺山集一卷雜詩一卷白家詩集六卷大悲胎藏法曼荼羅一鋪三輻苗大悲胎藏三昧耶略曼荼羅一鋪一輻苗金剛界九界曼荼羅一鋪五輻苗金剛界大曼荼羅一鋪五輻苗普賢延命像一鋪三輻苗釋迦牟尼佛菩提樹像一鋪一輻綵色佛頂尊勝壇像一鋪二輻苗水自在天像一鋪一輻苗大悲胎藏手契一卷金剛部諸尊圖像儀軌一卷熾盛壇樣一卷八大明王像一卷碑本佛跡并記一卷佛眼塔樣并記一卷金剛智三藏真影一紙苗大廣智不空三藏真影一紙苗無畏三藏真影一紙苗青龍寺義真和尚真影一鋪一輻綵色壇龕涅槃淨土一合壇龕西方淨土一合壇龕僧伽誌公邁迴三聖像一合鍮鉐印佛一面一百佛白銅印泥塔一合金銅五鈷金剛鈴一口金銅五鈷金剛杵一口金銅獨鈷金剛杵一口金銅三鈷金剛鈴一口金銅五鈷小金剛杵一口裏盛佛舍利右件法門佛像道具等。",
        "from": "T55n2167_001:1084c26_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於長安城興善。",
        "from": "T55n2167_001:1084c26_16",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "青龍。",
        "from": "T55n2167_001:1084c27_1",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "及諸寺求得者。",
        "from": "T55n2167_001:1084c27_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "謹具錄如前。",
        "from": "T55n2167_001:1084c27_14",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文殊所說寶藏陀羅尼經一卷無淨三昧法門二卷南岳大師撰三觀義二卷天台大師撰小止觀一卷下卷　天台大師撰行法等懺悔法一卷天台淨名經疏科目一卷涅槃經玄義文句一卷六妙門文句一卷釋上宮疏法花助記輔略抄二卷勝鬘經疏義私抄一卷雜揚法雲寺明空述釋上宮疏大乘顯正破疑決一卷釋道瞻述天台大師手書一紙臺山記一卷南岳大師撰四十二字門二卷臺山撶皮南岳大師撰隨自意三昧一卷臺山撶皮圓教六即義一卷皇帝降誕日於麟德殿講大方廣佛華嚴經玄義一卷請賢聖儀文并諸雜讚一卷淨土五會念佛略法事儀讚一卷南岳沙門法照述大唐代州五臺山大華嚴寺般若院比丘貞素所習天台智者大師教迹等目錄一卷天台智者大師遺旨并與晉王書一卷荊溪和尚在佛隴無常遺旨一卷諫三禪和乘車子歌一卷惠化寺超律和尚作思大師歌餞智者臺山并智者酬思大師歌一卷思大禪師酬鵲山覺禪師訢老詩一卷南岳思大和尚德行歌一卷達摩和尚五更轉一卷玄弉三藏玄奘三藏法寶義論一卷北齊稠禪師羅什法師十四利無行一卷大師弘教誌一卷五臺山大聖竹林寺釋法照得見臺山境界記一卷沙門道超久處臺山得生彌勒內宮記一卷五臺山大曆靈境寺碑文一卷五臺山土石二十丸立石各十丸右件教迹等。",
        "from": "T55n2167_001:1085b09_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "於大唐代州五臺山大華嚴寺經夏寫得。",
        "from": "T55n2167_001:1085b10_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "謹具錄如前。",
        "from": "T55n2167_001:1085b10_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "然立石等者。",
        "from": "T55n2167_001:1085b10_17",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "是大聖文殊師利菩薩住處之物。",
        "from": "T55n2167_001:1085b11_13",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "圓仁等因巡禮五頂取得。",
        "from": "T55n2167_001:1085b12_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "緣是聖地之物列之於經教之後。",
        "from": "T55n2167_001:1085b13_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "願令見聞隨喜者同結緣。",
        "from": "T55n2167_001:1085b13_15",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "皆為大聖文殊師利眷屬也。",
        "from": "T55n2167_001:1085b14_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大吉祥天女十二契一百八名無垢大乘經一卷一切佛心中心經一卷寶星經略述二十八宿佉盧瑟吒仙人經一卷陀羅尼集要經一卷蘇摩呼童子請經一卷新譯般若心經一卷般若三藏譯佛說阿利多軍荼利護國大自在拔折羅摩訶布陀羅金剛大神力陀羅尼一卷阿地多三藏日照三藏翻譯金剛頂蓮華部心念誦儀軌二卷觀自在菩薩如意輪念誦儀軌一卷金剛頂瑜伽千手千眼觀自在菩薩修行儀軌一卷普賢菩薩金剛薩埵瑜伽念誦儀軌一卷大興善寺沙門不空譯金剛頂瑜伽金剛薩埵五祕密修行念誦儀軌一卷金剛頂勝初瑜伽經中略出大樂金剛薩埵念誦儀軌一卷不空觀自在如意輪菩薩瑜伽法要一卷金剛智譯如意輪菩薩真言注義一卷金剛頂瑜伽千手千眼觀自在菩薩念誦法一卷葉衣觀自在菩薩法一卷大佛頂如來密因修證了義諸菩薩萬行品灌頂部錄出中印契別行法門一卷阿閦如來念誦供養法一卷不空金剛譯修真言三昧四時禮懺供儀要一卷金剛頂經瑜伽十八會指歸一卷佛頂尊勝陀羅尼注義一卷最上乘教授戒懺悔文一卷太元阿吒薄句無邊甘露降伏一切鬼神真言一卷施燋面一切餓鬼念誦陀羅尼法一卷大樂金剛不空真實三昧耶經般若波羅蜜多理趣釋一卷唐梵對譯金剛般若經二卷唐梵對譯阿彌陀經一卷唐梵對譯般若心經一卷唐梵兩字最勝無垢清淨光明大陀羅尼一卷唐梵兩字不空羂索真言一本唐梵兩字青頸大悲真言一本唐梵兩字一切佛心真言一本唐梵兩字一切佛心中心真言一本唐梵兩字灌頂心真言一本唐梵兩字灌頂心中心真言一本唐梵兩字結界真言一本唐梵兩字祕密心真言一本唐梵兩字祕密心中心真言一本唐梵對譯普賢行願讚一本唐梵兩字大佛頂根本讚一卷唐梵兩字大佛頂結護一本唐梵兩字大隨求結護一本唐梵兩字天龍八部讚一本唐梵兩字百字讚一本唐梵兩字送本尊歸本土讚一本唐梵兩字觀自在菩薩讚一本唐梵兩字彌勒菩薩讚一本唐梵兩字虛空藏菩薩讚一本唐梵兩字金剛藏菩薩讚一本唐梵兩字文殊師利菩薩讚一本唐梵兩字普賢菩薩讚一本唐梵兩字除蓋障菩薩讚一本唐梵兩字地藏菩薩讚一本唐梵兩字滿願讚一本唐梵兩字毘盧遮那成佛神變加持經吉慶伽陀讚一本唐梵兩字釋迦如來涅槃後彌勒菩薩悲願讚一卷唐梵對譯金剛般若經論頌一卷唐梵對譯法華經二十八品題目兼諸羅漢名一卷淨名經記五卷无量義寺文襲述淨名經集解關中疏四卷資聖寺道液集淨名經關中疏釋微二卷中修山沙門契真述法華經銷文略疏三卷天長寺釋延秀集解肇論略疏一卷東山雄作肇論抄三卷牛頭山幽西寺惠澄撰肇論文句圖一卷惠澄撰肇論略出要義兼注附焉并序一卷沙門零興撰因明糅抄三卷章敬寺擇隣述因明義斷一卷大雲寺苾蒭沼述因明入正理義纂要一卷大神龍寺沼集劫章頌一卷劫章頌疏一卷岑山沙門遍知集劫章頌記一卷沙門道詮述劫章科文一卷智者大師修三昧常行法一卷五方便念佛門一卷智者大師述觀心遊口決記一卷智顗大師述四十二字門義一卷南岳思大師述釋門自鏡錄五卷僧惠詳集觀心十二部經義一卷天台頂述形神不滅論一卷雲溪沙門海雲撰法華三昧修論決一卷天台智者大師所著經論章疏科目一卷鳩摩羅什法師隨順修多羅四悉檀義不墮員門一卷大般若經開兼二十九位法門一卷量處重輕義一卷道宣絹敘羯磨文西大原寺懷素撰略羯磨一卷說罪要行法一卷義淨三藏撰諸天地獄壽量分限一卷受菩薩戒文一卷最上乘佛性歌一卷沙門真覺述大乘楞伽正宗決一卷隋廬山遺愛寺慧珍禪師念佛三昧指歸一卷梵語雜名一卷四條戒并大小乘戒決一卷南岳思禪師法門傳二卷衛尉承柆朏撰天台大師答陳宣帝書一卷天台略錄一卷智者檖松讚頂禪師撰天台智者大師十二所道場記一卷灌頂述法花靈驗傳二卷感通傳一卷道宣清涼山略傳一卷大唐韶州雙峯山曹溪寶林傳一卷會稽沙門靈徹上都清禪寺至演禪師鐘傳一卷大理牛肅與僧至演同敘南荊州沙門無行在天竺國致於唐國書一卷內供奉談莚法師歎齋格并文一卷集新舊齋文五卷上都雲花寺詠字太觀法師奉答皇太子所問諸經與義并牋一卷歎道俗德文三卷揚州東大雲寺演和上碑并序一卷李邕唐故大廣禪師大和楞伽峯塔碑銘并序一卷陸亘撰唐揚州龍興寺翻經院故慎律和上碑銘并序一卷李花撰唐故大律師釋道圓山龕碑并序一卷李邕大唐大慈恩寺翻經大德基法師墓誌銘并序一卷大慈恩寺大法師基公塔銘并序一卷唐故終南山靈感寺大律師道宣行記一卷大唐西明寺故大德道宣律師讚一卷天台大師答陳宣帝書一卷大唐新修定公卿士庶內族吉凶書儀三十卷鄭餘慶重修定開元詩格一卷祗對義一卷判一百條一卷駱賓王撰祝元膺詩集一卷杭越寄和詩集一卷詩集五卷法華經二十八品七言詩一卷大毘盧遮那大悲胎藏大曼荼羅一鋪五輻苗金剛界大曼荼羅一鋪七輻綵色供養賢聖等七種壇樣一卷金剛界三十七尊種子曼荼羅樣一張金剛界八十一尊種子曼荼羅樣一張法華曼荼羅樣一張胎藏曼荼羅手印樣一卷南岳思大和尚示先生骨影一鋪三輻綵色天台大師感得聖像影一鋪三輻綵色阿蘭若比丘見空中普賢影一張苗法惠和上閻王前誦法花影一張苗山登禪師誦法華感金銀殿影一張苗惠斌禪師誦法華神人來拜影一張苗映禪師誦法花善神來聽經影一張苗定禪師誦法花天童給事影一張苗惠向禪師誦法花滅後墓上生蓮華及墓裏常有誦經聲影一張苗秦郡老僧教弟子感夢示宿因影一張苗道超禪師誦法華感二世弟子生處影一張苗法惠禪師誦法華口放光照室宇影一張苗大聖僧伽和尚影一張苗舍利五粒菩薩舍利三粒辟支佛舍利二粒盛白蠇小合子并安置白石瓶子一口右件法門等。",
        "from": "T55n2167_001:1087b13_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大唐開成三年八月初到揚州大都府。",
        "from": "T55n2167_001:1087b14_4",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "巡諸寺尋訪抄寫畢。",
        "from": "T55n2167_001:1087b14_13",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "先寄付使下准判官伴宿禰管雄。",
        "from": "T55n2167_001:1087b15_9",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "船已送延曆寺訖。",
        "from": "T55n2167_001:1087b15_17",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "然都未具目申官。",
        "from": "T55n2167_001:1087b16_7",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "今謹具錄數申上。",
        "from": "T55n2167_001:1087b16_15",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "以前件經論。",
        "from": "T55n2167_001:1087b17_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "教法。",
        "from": "T55n2167_001:1087b17_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "章疏。",
        "from": "T55n2167_001:1087b17_11",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "傳記。",
        "from": "T55n2167_001:1087b17_14",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "及諸曼荼羅。",
        "from": "T55n2167_001:1087b17_20",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "壇像等。",
        "from": "T55n2167_001:1087b18_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "伏蒙國恩隨使到唐遂於揚州五臺及長安等處尋師學法九年之間。",
        "from": "T55n2167_001:1087b19_14",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "隨分訪求得者。",
        "from": "T55n2167_001:1087b20_3",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "謹其色目如前。",
        "from": "T55n2167_001:1087b20_10",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "謹錄申上謹言。",
        "from": "T55n2167_001:1087b20_17",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "承和十四年月日入唐天台宗請益傳燈法師位圓仁上。",
        "from": "T55n2167_001:1087b22_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "延文四己亥年四月九日於東寺西院僧坊以或本書寫訖追可比校證本矣。",
        "from": "T55n2167_001:1087b24_13",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "大法師　賢　　寶。",
        "from": "T55n2167_001:1087b25_8",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "元文四年歲次己未七月二十二日命岡本深慶令修補了　權僧正　賢　　賀。",
        "from": "T55n2167_001:1087b27_15",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "文政三年庚辰十一月中旬以東寺觀智院本令書寫之。",
        "from": "T55n2167_001:1087b29_5",
        "context_with_next_sentence": true
    },
    {
        "source_sentence": "台嶽已講權僧正　真　　超。",
        "from": "T55n2167_001:1087c01_12",
        "context_with_next_sentence": true
    }
]