{
    "X04n0223_090:0603b14_0": "大方廣佛新華嚴經合論卷第九十",
    "X04n0223_090:0603b15_0": "唐于闐國三藏沙門實叉難陀譯經",
    "X04n0223_090:0603b16_0": "唐太原方山長者李通玄造論",
    "X04n0223_090:0603b17_0": "唐福州開元寺沙門志寧釐經合論",
    "X04n0223_090:0603b18_0": "入法界品第三十九之三",
    "X04n0223_090:0603b19_0-0": "【經】云何為種種三昧所謂普藏嚴法界三昧普照一切三世無礙境界三昧法界無差別智光明三昧入如來境界不動轉三昧普照無邊虗空三昧入如來力三昧佛無畏勇猛奮迅莊嚴三昧一切法界旋轉藏三昧如月普現一切法界以無礙音大開演三昧普清淨法光明三昧無礙繒法王幢三昧一一境界中悉見一切諸佛海三昧於一切世間悉現身三昧入如來無差別身境界三昧隨一切世間轉大悲藏三昧知一切法無有跡三昧知一切法究竟寂滅三昧雖無所得而能變化普現世間三昧普入一切剎三昧莊嚴一切佛剎成正覺三昧觀一切世間主色相差別三昧觀一切眾生境界無障礙三昧能出生一切如來母三昧能修行入一切佛海功德道三昧一一境界中出現神變盡未來際三昧入一切如來本事海三昧盡未來際護持一切如來種性三昧以決定解力令現在十方一切佛剎海皆清淨三昧一念中普照一切佛所住三昧入一切境界無礙際三昧令一切世界為一佛剎三昧出一切佛變化身三昧以金剛王智知一切諸根海三昧知一切如來同一身三昧知一切法界所安立悉住心念際三昧於一切法界廣大國土中示現涅槃三昧令住最上處三昧於一切佛剎現種種眾生差別身三昧普入一切佛智慧三昧知一切法性相三昧一念普知三世法三昧念念中普現法界身三昧以師子勇猛智知一切如來出興次第三昧於一切法界境界慧眼圓滿三昧勇猛趣向十力三昧放一切功德圓滿光明普照世間三昧不動藏三昧說一法普入一切法三昧於一法以一切言音差別訓釋三昧演說一切佛無二法三昧知三世無礙際三昧知一切劫無差別三昧入十力微細方便三昧於一切劫成就一切菩薩行不斷絕三昧十方普現身三昧於法界自在成正覺三昧生一切安隱受三昧出一切莊嚴具莊嚴虗空界三昧念念中出等眾生數變化身雲三昧如來淨空月光明三昧常見一切如來住虗空三昧開示一切佛莊嚴三昧照明一切法義燈三昧照十力境界三昧三世一切佛幢相三昧一切佛一密藏三昧念念中所作皆究竟三昧無盡福德藏三昧見無邊佛境界三昧堅住一切法三昧現一切如來變化悉令知見三昧念念中佛日常出現三昧一日中悉知三世所有法三昧普音演說一切法性寂滅三昧見一切佛自在力三昧法界開敷蓮華三昧觀諸法如虗空無住處三昧十方海普入一方三昧入一切法界無源底三昧一切法界海三昧以寂靜身放一切光明三昧一念中現一切神通大願三昧一切時一切處成正覺三昧以一莊嚴入一切法界三昧普現一切諸佛身三昧知一切眾生廣大殊勝神通智三昧一念中其身徧法界三昧現一乘淨法界三昧入普門法界示現大莊嚴三昧住持一切佛法輪三昧以一切法門莊嚴一法門三昧以因陀羅網願行攝一切眾生界三昧分別一切世界門三昧乘蓮華自在遊步三昧知一切眾生種種差別神通智三昧令其身恒現一切眾生前三昧知一切眾生差別音聲言辭海三昧知一切眾生差別智神通三昧大悲平等藏三昧一切佛入如來際三昧觀察一切如來解脫處師子嚬伸三昧菩薩以如是等不可說佛剎微塵數三昧入毗盧遮那如來念念充滿一切法界三昧神變海。",
    "X04n0223_090:0604b04_0": "【論】二云何為種種三昧已下至入毗盧遮那如來念念充滿法界三昧神變海有六十六行經正說所入三昧之名分。",
    "X04n0223_090:0604b07_0-0": "【經】其諸菩薩皆悉具足大智神通明利自在住於諸地以廣大智普觀一切從諸智慧種性而生一切智智常現在前得離癡翳清淨智眼為諸眾生作調御師住佛平等於一切法無有分別了達境界知諸世間性皆寂滅無有依處普詣一切諸佛國土而無所著悉能觀察一切諸法而無所住徧入一切妙法宮殿而無所來教化調伏一切世間普為眾生現安隱處智慧解脫為其所行恒以智身住離貪際超諸有海示真實際智光圓滿普見諸法住於三昧堅固不動於諸眾生恒起大悲知諸法門悉皆如幻一切眾生悉皆如夢一切如來悉皆如影一切言音悉皆如響一切諸法悉皆如化善能積集殊勝行願智慧圓滿清淨善巧心極寂靜善入一切總持境界具三昧力勇猛無怯獲明智眼住法界際到一切法無所得處修習無涯智慧大海到智波羅蜜究竟彼岸為般若波羅蜜之所攝持以神通波羅蜜普入世間依三昧波羅蜜得心自在以不顛倒智知一切義以巧分別智開示法藏以現了智訓釋文詞以大願力說法無盡以無所畏大師子吼常樂觀察無依處法以淨法眼普觀一切以淨智月照世成壞以智慧光照真實諦福德智慧如金剛山一切譬喻所不能及善觀諸法慧根增長勇猛精進摧伏眾魔無量智慧威光熾盛其身超出一切世間得一切法無礙智慧善能悟解盡無盡際住於普際入真實際無相觀智常現在前善巧成就諸菩薩行以無二智知諸境界普見一切世間諸趣徧往一切諸佛國土智燈圓滿於一切法無諸闇障放淨法光照十方界為諸世間真實福田若見若聞所願皆滿福德高大超諸世間勇猛無畏摧諸外道演微妙音徧一切剎普見諸佛心無厭足於佛法身已得自在隨所應化而為現身一身充滿一切佛剎已得自在清淨神通乘大智舟所往無礙智慧圓滿周徧法界譬如日出普照世間隨眾生心現其色像知諸眾生根性欲樂入一切法無諍境界知諸法性無生無起能令小大自在相入決了佛地甚深之趣以無盡句說甚深義於一句中演說一切脩多羅海獲大智慧陀羅尼身凡所受持永無忘失一念能憶無量劫事一念悉知三世一切諸眾生智恒以一切陀羅尼門演說無邊諸佛法海常轉不退清淨法輪令諸眾生皆生智慧得佛境界智慧光明入於善見甚深三昧入一切法無障礙際於一切法勝智自在一切境界清淨莊嚴普入十方一切法界隨其方所靡不咸至一一塵中現成正覺於無色性現一切色以一切方普入一方其諸菩薩具如是等無邊福智功德之藏常為諸佛之所稱歎種種言辭說其功德不能令盡靡不咸在逝多林中深入如來功德大海悉見於佛光明所照。",
    "X04n0223_090:0605a05_0": "【論】三其諸菩薩皆悉具足大神通已下至悉見於佛光明所照有五十三行半經明諸菩薩蒙佛光明所益之德分。",
    "X04n0223_090:0605a08_0": "【經】爾時諸菩薩得不思議正法光明心大歡喜各於其身及以樓閣諸莊嚴具并其所坐師子之座徧逝多林一切物中化現種種大莊嚴雲充滿一切十方法界所謂於念念中放大光明雲充滿十方悉能開悟一切眾生出一切摩尼寶鈴雲充滿十方出微妙音稱揚讚歎三世諸佛一切功德出一切音樂雲充滿十方音中演說一切眾生諸業果報出一切菩薩種種願行色相雲充滿十方說諸菩薩所有大願出一切如來自在變化雲充滿十方演出一切諸佛如來語言音聲出一切菩薩相好莊嚴身雲充滿十方說諸如來於一切國土出興次第出三世如來道場雲充滿十方現一切如來成等正覺功德莊嚴出一切龍王雲充滿十方雨一切諸香出一切世主身雲充滿十方演說普賢菩薩之行出一切寶莊嚴清淨佛剎雲充滿十方現一切如來轉正法輪是諸菩薩以得不思議法光明故法應如是出興此等不可說佛剎微塵數大神變莊嚴雲爾時文殊師利菩薩承佛神力欲重宣此逝多林中諸神變事觀察十方而說頌言。",
    "X04n0223_090:0605b03_0": "【論】四爾時諸菩薩已下至說頌有二十一行半經明諸菩薩所得三昧神通現變化雲莊嚴逝多林及十方國分。",
    "X04n0223_090:0605b06_0-0": "【經】　汝應觀此逝多林　　以佛威神廣無際　一切莊嚴皆示現　　十方法界悉充滿　十方一切諸國土　　無邊品類大莊嚴　於其座等境界中　　色像分明皆顯現　從諸佛子毛孔出　　種種莊嚴寶燄雲　及發如來微妙音　　徧滿十方一切剎　寶樹華中現妙身　　其身色相等梵王　從禪定起而遊步　　進止威儀恒寂靜　如來一一毛孔內　　常現難思變化身　",
    "X04n0223_090:0605b06_0-1": "皆如普賢大菩薩　　種種諸相為嚴好　逝多林上虗空中　　所有莊嚴發妙音　普說三世諸菩薩　　成就一切功德海　逝多林中諸寶樹　　亦出無量妙音聲　演說一切諸羣生　　種種業海各差別　林中所有眾境界　　悉現三世諸如來　一一皆起大神通　　十方剎海微塵數　十方所有諸國土　　一切剎海微塵數　悉入如來毛孔中　　次第莊嚴皆現覩　",
    "X04n0223_090:0605b06_0-2": "所有莊嚴皆現佛　　數等眾生徧世間　一一咸放大光明　　種種隨宜化羣品　香燄眾華及寶藏　　一切莊嚴殊妙雲　靡不廣大等虗空　　徧滿十方諸國土　十方三世一切佛　　所有莊嚴妙道場　於此園林境界中　　一一色像皆明現　一切普賢諸佛子　　百千劫海莊嚴剎　其數無量等眾生　　莫不於此林中見【論】五汝應觀此逝多林已下至莫不於此林中見有二十六行頌明文殊師利重頌前法如文具明已上明佛光所照諸菩薩蒙光照入嚬伸三昧普賢境界方便門但是一切三昧總是方便行門普賢境界總是文殊法身根本智所成就故。",
    "X04n0223_090:0605c13_0-0": "【經】爾時彼諸菩薩以佛三昧光明照故即時得入如是三昧一一皆得不可說佛剎微塵數大悲門利益安樂一切眾生於其身上一一毛孔皆出不可說佛剎微塵數光明一一光明皆化現不可說佛剎微塵數菩薩其身形相如諸世主普現一切眾生之前周帀徧滿十方法界種種方便教化調伏或現不可說佛剎微塵數諸天宮殿無常門或現不可說佛剎微塵數一切眾生受生門或現不可說佛剎微塵數一切菩薩修行門或現不可說佛剎微塵數夢境門或現不可說佛剎微塵數菩薩大願門或現不可說佛剎微塵數震動世界門或現不可說佛剎微塵數分別世界門或現不可說佛剎微塵數現生世界門或現不可說佛剎微塵數檀波羅蜜門或現不可說佛剎微塵數一切如來修諸功德種種苦行尸波羅蜜門或現不可說佛剎微塵數割截肢體羼提波羅蜜門或現不可說佛剎微塵數勤修毗棃耶波羅蜜門或現不可說佛剎微塵數一切菩薩修諸三昧禪定解脫門或現不可說佛剎微塵數佛道圓滿智光明門或現不可說佛剎微塵數勤求佛法為一文一句故捨無數身命門或現不可說佛剎微塵數親近一切佛諮問一切法心無疲厭門或現不可說佛剎微塵數隨諸眾生時節欲樂往詣其所方便成熟令住一切智海光明門或現不可說佛剎微塵數降伏眾魔制諸外道顯現菩薩福智力門或現不可說佛剎微塵數知一切工巧明智門或現不可說佛剎微塵數知一切眾生差別明智門或現不可說佛剎微塵數知一切法差別明智門或現不可說佛剎微塵數知一切眾生心樂差別明智門或現不可說佛剎微塵數知一切眾生根行煩惱習氣明智門或現不可說佛剎微塵數知一切眾生種種業明智門或現不可說佛剎微塵數開悟一切眾生門以如是等不可說佛剎微塵數方便門往詣一切眾生住處而成熟之所謂或往天宮或往龍宮或往夜叉乾闥婆阿脩羅迦樓羅緊那羅摩睺羅伽宮或往梵王宮或往人王宮或往閻羅王宮或往畜生餓鬼地獄之所住處以平等大悲平等大願平等智慧平等方便攝諸眾生或有見已而調伏者或有聞已而調伏者或有憶念而調伏者或聞音聲而調伏者或聞名號而調伏者或見圓光而調伏者或見光網而調伏者隨諸眾生心之所樂皆詣其所令其獲益佛子此逝多林一切菩薩為欲成熟諸眾生故或時現處種種嚴飾諸宮殿中或時示現住自樓閣寶師子座道場眾會所共圍遶周徧十方皆令得見然亦不離此逝多林如來之所佛子此諸菩薩或時示現無量化身雲或現其身獨一無侶所謂或現沙門身或現婆羅門身或現苦行身或現充盛身或現醫王身或現商主身或現淨命身或現妓樂身或現奉事諸天身或現工巧技術身往詣一切村營城邑王都聚落諸眾生所隨其所應以種種形相種種威儀種種音聲種種言論種種住處於一切世間猶如帝網行菩薩行或說一切世間工巧事業或說一切智慧照世明燈或說一切眾生業力所莊嚴或說十方國土建立諸乘位或說智燈所照一切法境界教化成就一切眾生而亦不離此逝多林如來之所。",
    "X04n0223_090:0606b19_0-0": "【論】六爾時彼諸菩薩已下至不離逝多林如來之所有六十三行經明諸菩薩以佛三昧光明照故得如上三昧及無限大悲無限神通無限饒益眾生分已上二十七段經文總明答前菩薩大眾前後所問四十法門竟此法界法門明智體自在以智力自現不藉如來口言又令文殊普賢二人本位自宣本果之行令易解故不迷教之體用已上是一部經之始終圓滿總以法界體收第二爾時文殊師利童子已下直至經末已來為文殊師利童子從善住樓閣南行就根利生成行表法令後發心者不迷其行令易開解分自爾時文殊師利童子已下名為就俗利生成行門已前教中但云文殊師利不云童子明此已下入俗化蒙以行立名便名童子明已前總約佛果普光明智中起子方賢聖以立化儀即覺首自首等五位諸菩薩是皆通化無方潛顯自在文殊為信首不名童子自此已下以法界體中入俗草創化蒙約行所行立名即號文殊師利童子以妙智慧化童蒙入佛智慧生佛家故此是三世諸佛始發菩提心初法身現根本智無性之理妙慧故一切三世諸佛從此而初生佛家從此而成就普賢大願行故何故名為就俗利生成行門者已前但云昇天表行成就諸天未往人間俗中化利此法界品已前一卷",
    "X04n0223_090:0606b19_0-1": "半餘經但有菩薩聲聞世主已得道者未有處俗凡夫入此法門自文殊師利童子從善住樓閣已下是入人間就根接俗化利凡夫令其得此法界道理又令善財童子徧求善知識五十三人以表五位三種因果法身中根本智普賢差別智中行於此二中無所住智名之為佛以此三法具足名之為佛以此三法徧與五位終始而作因果名為乘如來乘直至道場亦名乘法界乘以法界還以此三種因果為體用故前後五位因果例然總以此三法為因果此佛文殊師利普賢菩薩與五十箇善知識行而作因果而自無因果為自佛果位中無所修無所行故但與五位中修行者作治染淨二障習氣生熟處說名因果然法身理智萬行自無因果但以五位中加行治惑習氣而立如來因果之名以文殊師利往詣覺城人間就根教化令善財起加行位求五十三善知識成一百一十因果法門令學者不迷其五位之行使易解故與後發菩提心者作修行之樣式故名為就俗利生成行門為與學者成行樣式令不迷故更有餘意至下就位方明從此就俗利生成行門中自文殊師利童子已下至經末長科三段。",
    "X04n0223_090:0607a15_0-0": "【經】爾時文殊師利童子從善住樓閣出與無量同行菩薩及常隨侍衛諸金剛神普為眾生供養諸佛諸身眾神久發堅誓願常隨從諸足行神樂聞妙法主地神常修大悲主水神智光照耀主火神摩尼為冠主風神明練十方一切儀式主方神專勤除滅無明黑闇主夜神一心匪懈闡明佛日主晝神莊嚴法界一切虗空主空神普度眾生超諸有海主海神常勤積集趣一切智助道善根高大如山主山神常勤守護一切眾生菩提心城主城神常勤守護一切智智無上法城諸大龍王常勤守護一切眾生諸夜叉王常令眾生增長歡喜乾闥婆王常勤除滅諸餓鬼趣鳩槃茶王恒願拔濟一切眾生出諸有海迦樓羅王願得成就諸如來身高出世間阿脩羅王見佛歡喜曲躬恭敬摩睺羅伽王常厭生死恒樂見佛諸大天王尊重於佛讚歎供養諸大梵王文殊師利與如是等功德莊嚴諸菩薩眾出自住處來詣佛所右遶世尊經無量帀以諸供具種種供養供養畢已辭退南行往於人間爾時尊者舍利弗承佛神力見文殊師利菩薩與諸菩薩眾會莊嚴出逝多林往於南方遊行人間作如是念我今當與文殊師利俱往南方時尊者舍利弗與六千比丘前後圍遶出自住處來詣佛所頂禮佛足具白世尊世尊聽許右遶三帀辭退而去往文殊師利所此六千比丘是舍利弗自所同住出家未久所謂海覺比丘善生比丘福光比丘大童子比丘電生比丘淨行比丘天德比丘君慧比丘梵勝比丘寂慧比丘如是等其數六千悉曾供養無量諸佛深植善根解力廣大信眼明徹其心寬博觀佛境界了法本性饒益眾生常樂勤求諸佛功德皆是文殊師利說法教化之所成就爾時尊者舍利弗在行道中觀諸比丘告海覺言海覺汝可觀察文殊師利菩薩清淨之身相好莊嚴一切天人莫能思議汝可觀察文殊師利圓光暎徹令無量眾生發歡喜心汝可觀察文殊師利光網莊嚴除滅眾生無量苦惱汝可觀察文殊師利眾會具足皆是菩薩往昔善根之所攝受汝可觀察文殊師利所行之路左右八步平坦莊嚴汝可觀察文殊師利所住之處周迴十方常有道場隨逐而轉汝可觀察文殊師利所行之路具足無量福德莊嚴左右兩邊有大伏藏種種珍寶自然而出汝可觀察文殊師利曾供養佛善根所流一切樹間出莊嚴藏汝可觀察文殊師利諸世間主雨供具雲頂禮恭敬以為供養汝可觀察文殊師利十方一切諸佛如來將說法時悉放眉間白毫相光來照其身從頂上入爾時尊者舍利弗為諸比丘稱揚讚歎開示演說文殊師利童子有如是等無量功德具足莊嚴彼諸比丘聞是說已心意清淨信解堅固喜不自持舉身踊躍形體柔輭諸根悅豫憂苦悉除垢障咸盡常見諸佛深求正法具菩薩根得菩薩力大悲大願皆自出生入於諸度甚深境界十方佛海常現在前於一切智深生信樂即白尊者舍利弗言唯願大師將引我等往詣於彼聖人之所時舍利弗即與俱行至其所已白言仁者此諸比丘願得奉覲爾時文殊師利童子無量自在菩薩圍遶并其大眾如象王迴觀諸比丘時諸比丘頂禮其足合掌恭敬作如是言我今奉見恭敬禮拜及餘所有一切善根唯願仁者文殊師利和上舍利弗世尊釋迦牟尼皆悉證知如仁所有如是色身如是音聲如是相好如是自在願我一切悉當具得爾時文殊師利菩薩告諸比丘言比丘若善男子善女人成就十種趣大乘法則能速入如來之地況菩薩地何者為十所謂積集一切善根心無疲厭見一切佛承事供養心無疲厭求一切佛法心無疲厭行一切波羅蜜心無疲厭成就一切菩薩三昧心無疲厭次第入一切三世心無疲厭普嚴淨十方佛剎心無疲厭教化調伏一切眾生心無疲厭於一切剎一切劫中成就菩薩行心無疲厭為成就一眾生故修行一切佛剎微塵數波羅蜜成就如來一切力如是次第為成熟一切眾生界成就如來一切力心無疲厭比丘若善男子善女人成就深信發此十種無疲厭心則能長養一切善根捨離一切諸生死趣超過一切世間種性不墮聲聞辟支佛地生一切如來家具一切菩薩願學習一切如來功德修行一切菩薩諸行得如來力摧伏眾魔及諸外道亦能除滅一切煩惱入菩薩地近如來地時諸比丘聞此法已則得三昧名無礙眼見一切佛境界得此三昧故悉見十方無量無邊一切世界諸佛如來及其所有道場眾會亦悉見彼十方世界一切諸趣所有眾生亦悉見彼十方世界種種差別亦悉見彼一切世界所有微塵亦悉見彼諸世界中一切眾生所住宮殿以種種寶而為莊嚴及亦聞彼諸佛如來種種言音演說諸法文辭訓釋悉皆解了亦能觀察彼世界中一切眾生諸根心欲亦能憶念彼世界中一切眾生前後十生亦能憶念彼世界中過去未來各十劫事亦能憶念彼諸如來十本生事十成正覺十轉法輪十種神通十種說法十種教誡十種辯才又即成就十千菩提心十千三昧十千波羅蜜悉皆清淨得大智慧圓滿光明得菩薩十神通柔輭微妙住菩薩心堅固不動爾時文殊師利菩薩勸諸比丘住普賢行住普賢行已入大願海入大願海已成就大願海以成就大願海故心清淨心清淨故身清淨身清淨故身輕利身清淨輕利故得大神通無有退轉得此神通故不離文殊師利足下普於十方一切佛所悉現其身具足成就一切佛法。",
    "X04n0223_090:0608b10_0-0": "【論】第一從爾時文殊師利童子從善住樓閣已下至六十二卷之初爾時文殊師利菩薩勸諸比丘發阿耨多羅三藐三菩提心已此一段經名為創始就根入俗遊歷門於此門中分為兩段一從爾時文殊師利童子已下至辭退南行往於人間有二十行半經明與同行菩薩及常隨侍衛之眾辭佛南行往於人間分二爾時尊者舍利弗已下至成就一切佛法有八十六行半經明舍利弗等六千比丘隨逐文殊師利南行在路發心得此一乘法門分隨文釋義者第一從初爾時文殊師利童子從善住樓閣出者明以自法身現根本智樓閣中起差別智以利眾生故名為出無量同行菩薩者成助道翼從共教化眾生故是萬行主伴常隨侍衛諸金剛神者都舉諸侍衛之神此神之中約有二義一以諸神所行約自德立名二約文殊師利之德差別行上以標其德以為侍衛守護之義此一段并菩薩神天有三十二眾通後六千比丘眾以為四十二眾以為四十二種方便行成就眾生大智慧解脫之海初金剛神者法身中普光明智也智現名神普為眾生供養身眾神者是恭敬義以廣化身雲十方恭敬供養諸佛引接眾生報得其身端正嚴飾故足行神者是精勤教化眾生無疲勞行風神以摩尼為寶冠者表明淨無垢智能設教義以風體能吹壞散一切萬物亦能昇持生長一切萬物然自無體性所依以離垢寶冠表之像法身智慧能說教網散壞煩惱染淨自無所依以巽為風教故餘如經自具如鳩槃茶王所除餓鬼趣者此以大囊垂下如冬瓜坐以踞之行以置之於肩取像表法以大悲垂俗荷負眾生無辭勞倦摩睺羅伽王者此是腹行大蟒之類取像表法以胷腹行是恭敬義此是守護僧伽藍神自餘准名下義表之倣此及文殊師利諸菩薩出自住處者隨根接俗也右遶如來無量帀者敬順所行右遶者從南自東至北是二舍利弗等六千比丘隨逐文殊南行段中復分為七段一爾時尊者舍利弗已下至皆是文殊師利說法教化之所成就有十三行半經明舍利弗及六千比丘隨文殊師利南行分二爾時尊者舍利弗已下至白毫相光來照其身從頂上入有十六行經明舍利弗勸諸比丘觀察文殊師利隨路行時十種福相嚴身及道路分三爾時尊者舍利弗已下至此諸比丘願得奉覲有十行半經明舍利弗讚歎文殊師利十無量德諸比丘眾咸欲願見文殊師利舍利弗為白文殊師利分四爾時文殊師利童子菩薩已下至願我一切悉當具得有六行半經明六千比丘頂禮文殊師利自發大願請佛證知分五爾時文殊師利菩薩告諸比丘已下至入如來地有十八行經明文殊師利菩薩為諸比丘說十種無疲厭法行不墮二乘地入如來地分六諸比丘聞此法已已下至住菩薩心堅固不動有十六行經明六千比丘聞文殊師利說法得無礙眼三昧於一切法各得十十法解脫門分七爾時文殊師利菩薩勸諸比丘已下至卷",
    "X04n0223_090:0608b10_0-1": "末有六行經明文殊師利重勸比丘住普賢行便得不離文殊師利足下普於十方佛所悉現身具足一切佛法分隨文釋義者六千比丘表信心亦入位故以十信心十住十行十迴向十地十一地路上一時總得故故云六千前後圍遶以舍利弗為主自餘為伴主伴同行明昇進進求正法故出自住處者出自聲聞及諸權見故趣求法界大菩提故遶佛三帀者順佛正教故遶佛三帀皆是右遶自南向東向北向西至西如是三帀以為右遶成法今人返左行如是六千比丘是舍利弗同住出家未久非是羅漢宿世有種皆易發心經云六千比丘悉曾供養無量諸佛深植善根解力廣大信根明徹者明往昔曾種信根今生信種已熟舍利弗勸諸比丘令觀文殊師利菩薩福德圓光暎徹者是心淨之常光能令見者歡喜光網者是法網圓滿明其教光嚴身見者滅苦故文殊師利所行之路左右八步平坦莊嚴者明身心常與八正道俱故周徧十方皆有道場者化行常滿十方十方諸佛說法之時放眉間光灌文殊頂者明文殊師利是十方佛創蒙發心法身無相智慧之頂一切諸佛初發心時入此智慧而生佛家故一切眾生初發菩提心皆以此法身無相智慧為體一切眾生皆自有之皆須方便三昧方能明現故樹皆寶嚴明因行報生六千比丘觀察文殊師利及所聞十種無疲厭法便獲得無礙眼三昧者得法身中無相智眼明淨以執亡見謝智眼圓通非肉眼故身邊等五見亡法自明矣即十方礙盡初一切法中各明十法以明三昧力創始初明後勸普賢願行加進一切諸明悉達此已上明六千比丘發心竟後明覺成發緣利物如舍利弗是示現聲聞前已述訖已上餘義可解之意如文自具。",
    "X04n0223_090:0609b23_0": "大方廣佛新華嚴經合論卷第九十",
    "X04n0223_090:0609c01_0": "音切",
    "X04n0223_090:0609c02_0": "標(北遙切)。",
    "X04n0223_090:0609c02_1": "踞(倨音)。",
    "X04n0223_090:0609c02_2": "蟒(莫朗切)。"
}