{
    "X04n0223_068:0460b12_0": "大方廣佛新華嚴經合論卷第六十八",
    "X04n0223_068:0460b13_0": "唐于闐國三藏沙門實叉難陀譯經",
    "X04n0223_068:0460b14_0": "唐太原方山長者李通玄造論",
    "X04n0223_068:0460b15_0": "唐福州開元寺沙門志寧釐經合論",
    "X04n0223_068:0460b16_0": "十定品第二十七之二",
    "X04n0223_068:0460b17_0": "【經】爾時普賢菩薩即以解脫神通之力如其所應為現色身令彼一切諸菩薩眾皆見普賢親近如來於此一切菩薩眾中坐蓮華座亦見於餘一切世界一切佛所從彼次第相續而來亦見在彼一切佛所演說一切諸菩薩行開示一切智智之道闡明一切菩薩神通分別一切菩薩威德示現一切三世諸佛是時普眼菩薩及一切菩薩眾見此神變其心踊躍生大歡喜莫不頂禮普賢菩薩心生尊重如見十方一切諸佛是時以佛大威神力及諸菩薩信解之力普賢菩薩本願力故自然而雨十千種雲所謂種種華雲種種鬘雲種種香雲種種末香雲種種蓋雲種種衣雲種種嚴具雲種種珍寶雲種種燒香雲種種繒綵雲不可說世界六種震動奏天音樂其聲遠聞不可說世界放大光明其光普照不可說世界令三惡趣悉得除滅嚴淨不可說世界令不可說菩薩入普賢行不可說菩薩成普賢行不可說菩薩於普賢行願悉得圓滿成阿耨多羅三藐三菩提。",
    "X04n0223_068:0460c10_0": "【論】第七爾時已下至三藐三菩提有十九行半經是普賢菩薩為眾現身分何故得見普賢菩薩為存想念是以見之以迴體從用故是普賢身也以明想念皆為佛用故普見一切眾生亦佛用也釋義中分為三段一爾時普賢菩薩已下至示現一切三世諸佛有七行經明普賢菩薩如應現身分二是時普眼已下至一切諸佛有兩行半經明菩薩大眾得見普賢菩薩歡喜如見十方一切諸佛分三是時已下至三藐三菩提有十行經明諸菩薩信解力普賢菩薩本願興雲供養光明普照息三惡趣令諸菩薩入普賢行分如普賢菩薩如應現身即見故將心出入三昧求即不得見明無出入智不可作出入三昧求故自非位合道同智自會矣想念而見且是如應現身故然後方會其本身也餘義如文自具意明無依住智是普賢之大體如應現身是普賢之大用。",
    "X04n0223_068:0461a02_0": "【經】爾時普眼菩薩白佛言世尊普賢菩薩是住大威德者住無等者住無過者住不退者住平等者住不壞者住一切差別法者住一切無差別法者住一切眾生善巧心所住者住一切法自在解脫三昧者佛言如是如是普眼如汝所說普賢菩薩有阿僧祇清淨功德所謂無等莊嚴功德無量寶功德不思議海功德無量相功德無邊雲功德無邊際不可稱讚功德無盡法功德不可說功德一切佛功德稱揚讚歎不可盡功德。",
    "X04n0223_068:0461a11_0": "【論】第八爾時普眼菩薩已下至歎不可盡功德九行半經明普眼菩薩以十種住法歎普賢菩薩十種廣大所住之法分釋義明普眼歎普賢十種廣大住如來歎普賢十廣大功德其義如文稱歎。",
    "X04n0223_068:0461a15_0-0": "【經】爾時如來告普賢菩薩言普賢汝應為普眼及此會中諸菩薩眾說十大三昧令得善入成滿普賢所有行願諸菩薩摩訶薩說此十大三昧故令過去菩薩已得出離現在菩薩今得出離未來菩薩當得出離何等為十一者普光大三昧二者妙光大三昧三者次第徧往諸佛國土大三昧四者清淨深心行大三昧五者知過去莊嚴藏大三昧六者智光明藏大三昧七者了知一切世界佛莊嚴大三昧八者眾生差別身大三昧九者法界自在大三昧十者無礙輪大三昧此十大三昧諸大菩薩乃能善入去來現在一切諸佛已說當說現說若諸菩薩愛樂尊重修習不懈則得成就如是之人則名為佛則名如來亦則名為得十力人亦名導師亦名大導師亦名一切智亦名一切見亦名住無礙亦名達諸境亦名一切法自在此菩薩普入一切世界而於世界無所著普入一切眾生界而於眾生無所取普入一切身而於身無所礙普入一切法界而知法界無有邊親近三世一切佛明見一切諸佛法巧說一切文字了達一切假名成就一切菩薩清淨道安住一切菩薩差別行於一念中普得一切三世智普知一切三世法普說一切諸佛教普轉一切不退輪於去來現在一一世普證一切菩提道於此一一菩提中普了一切佛所說此是諸菩薩法相門是諸菩薩智覺門是一切種智無勝幢門是普賢菩薩諸行願門是猛利神通誓願門是一切總持辯才門是三世諸法差別門是一切諸佛示現門是以薩婆若安立一切眾生門是以佛神力嚴淨一切世界門若菩薩入此三昧得法界力無有窮盡得虗空行無有障礙得法王位無量自在譬如世間灌頂受職得無邊智一切通達得廣大力十種圓滿成無諍心入寂滅際大悲無畏猶如師子為智慧丈夫然正法明燈一切功德歎不可盡聲聞獨覺莫能思議得法界智住無動際而能隨俗種種開演住於無相善入法相得自性清淨藏生如來清淨家善開種種差別法門而以智慧了無所有善知於時常行法施開悟一切名為智者普攝眾生悉令清淨以方便智示成佛道而常修行菩薩之行無有斷盡入一切智方便境界示現種種廣大神通是故普賢汝今應當分別廣說一切菩薩十大三昧今此眾會咸皆願聞。",
    "X04n0223_068:0461c06_0": "【論】第九爾時如來告普賢菩薩已下至咸皆樂聞有四十五行經明令普賢菩薩演說十種三昧分釋義中分為八段一爾時如來已下至當得出離有四行半經明佛令普賢說十大三昧分二何者為十已下至無礙輪大三昧有六行經明如來先自說十三昧名分三此十大三昧已下至當說現說有一行半經明此三昧十方三世諸佛共所同說分其三昧名如來自說者意明如來是三昧之體令普賢說三昧之功用者明普賢是三昧之用以明佛果位中體用圓滿故此約體名佛用是普賢此位會體用自在故四若諸菩薩已下至亦名一切法自在有四行半經明佛歎若聞此三昧愛樂修行名得佛自在分五此菩薩已下至普了一切佛所說有九行半經明修學此十三昧者得於一切法無所著自在善巧轉佛法輪分六此是諸菩薩法相門已下至嚴淨一切世界門有五行半經明佛歎修此十三昧能入十種法門分七若菩薩入此三昧已下至示現種種廣大神通有十二行半經明佛歎若入此三昧得獲大方便利用示現成佛不捨修菩薩行分八是故已下至咸皆願聞有一行半經明如來勸令普賢說此十三昧德用自在分其中文義如經自明如此十定品已後十一品經意以十地中所得出世大悲智成處世大悲智令差別智圓滿自在方成普賢行具足以出世悲智是佛果處世差別智悲是普賢行是菩薩道至出現品二行方終。",
    "X04n0223_068:0462a08_0": "第十爾時已下有十段經正說十種三昧作用之功分其文列後。",
    "X04n0223_068:0462a10_0-0": "【經】爾時普賢菩薩承如來旨觀普眼等諸菩薩眾而告之言佛子云何為菩薩摩訶薩普光明三昧佛子此菩薩摩訶薩有十種無盡法何者為十所謂諸佛出現智無盡眾生變化智無盡世界如影智無盡深入法界智無盡善攝菩薩智無盡菩薩不退智無盡善觀一切法義智無盡善持心力智無盡住廣大菩提心智無盡住一切佛法一切智願力智無盡佛子是名菩薩摩訶薩十種無盡法佛子此菩薩摩訶薩發十種無邊心何等為十所謂發度脫一切眾生無邊心發承事一切諸佛無邊心發供養一切諸佛無邊心發普見一切諸佛無邊心發受持一切佛法不忘失無邊心發示現一切佛無量神變無邊心發為得佛力故不捨一切菩提行無邊心發普入一切智微細境界說一切佛法無邊心發普入佛不思議廣大境界無邊心發於佛辯才起深志樂領受諸佛法無邊心發示現種種自在身入一切如來道場眾會無邊心是為十佛子此菩薩摩訶薩有十種入三昧差別智何者為十所謂東方入定西方起西方入定東方起南方入定北方起北方入定南方起東北方入定西南方起西南方入定東北方起西北方入定東南方起東南方入定西北方起下方入定上方起上方入定下方起是為十佛子此菩薩摩訶薩有十種入大三昧善巧智何者為十佛子菩薩摩訶薩以三千大千世界為一蓮華現身徧此蓮華之上結跏趺坐身中復現三千大千世界其中有百億四天下一一四天下現百億身一一身入百億百億三千大千世界於彼世界一一四天下現百億百億菩薩修行一一菩薩修行生百億百億決定解一一決定解令百億百億根性圓滿一一根性成百億百億菩薩法不退業然所現身非一非多入定出定無所錯亂佛子如羅睺羅阿脩羅王本身長七百由旬化形長十六萬八千由旬於大海中出其半身與須彌山而正齊等佛子彼阿脩羅王雖化其身長十六萬八千由旬然亦不壞本身之相諸蘊界處悉皆如本心不錯亂不於變化身而作他想於其本身生非己想本受生身恒受諸樂化身常現種種自在神通威力佛子阿脩羅王有貪恚癡具足憍慢尚能如是變現其身何況菩薩摩訶薩能深了達心法如幻一切世間皆悉如夢一切諸佛出興於世皆如影像一切世界猶如變化言語音聲悉皆如響見如實法以如實法而為其身知一切法本性清淨了知身心無有實體其身普住無量境界以佛智慧廣大光明淨修一切菩提之行佛子菩薩摩訶薩住此三昧超過世間遠離世間無能惑亂無能映奪佛子譬如比丘觀察內身住不淨觀審見其身皆是不淨菩薩摩訶薩亦復如是住此三昧觀察法身見諸世間普入其身於中明見一切世間及世間法於諸世間及世間法皆無所著佛子是名菩薩摩訶薩第一普光明大三昧善巧智。",
    "X04n0223_068:0462c11_0-0": "【論】初普光明三昧中約分四門一釋三昧名二明三昧之體用三舉三昧之境界四隨文釋義一釋三昧名者何故名為普光明三昧三者正也昧者定也識心不現名之為昧正智徧周名之為普照迷破惑名之為光法無不達名之為明二明三昧之體用者此三昧明以法身根本智為體十種無盡智為用以此義故佛自說三昧之名普賢說三昧之用三明舉三昧之境界者於此初三昧中略舉境界以三千大千世界為一蓮華現身徧此蓮華之上結跏趺坐於其身中復現三千大千世界其中有百億四天下一一四天下現百億身一一身入百億百億三千大千世界於彼世界一一四天下現百億百億菩薩修行一一菩薩修行生百億百億決定解令百億百億根性圓滿一一根性成百億百億菩薩法不退業然所現身非一非多入定出定無所錯亂如是後後倍倍增廣具如經說此是初三昧之境界意明身土重重重重相入徧周廣大無盡限故四隨文釋義者於此段略舉十義一普賢菩薩承如來旨說此三昧不自己功旨者意也二重舉三昧名三舉菩薩十種無盡智四明如是菩薩能發十種無邊心五明是菩薩有十種入三昧六明十種入三昧善巧智七舉羅睺羅阿脩羅王不壞本身現變化身喻八明菩薩深達心法如幻法門九明比丘觀察內身不淨不壞本身如故喻十明菩薩住此三昧觀察法身見諸世間及世間法普入其身如上修學普光明三昧以觀法身根本智為體以十無盡智為用以發十無邊心為所行之行以十種入三昧差別智為三昧同別自在之力以十種入三昧善巧智令三昧身一多佛剎眾生剎現在身內不廢自身常復如故復於身內現無量身度眾生及供養諸佛如下文云住此三昧觀察法身見諸世間普入其身於中明見一切世間及世間法於諸世間及世間法皆無所著為以法身性自無內外大小中邊量故法如是見故法如是無著故為從法身無相理所現世間及世間法皆如影幻體故為世間及世間法皆法身一味無二相故所有報境皆如影像重重不礙故如羅睺羅阿脩羅王者明能攝日光令世生惱以羅云攝睺云惱也阿脩羅云無天無天妙戲故於中化事如經自明。",
    "X04n0223_068:0463b03_0-0": "【經】佛子云何為菩薩摩訶薩妙光明三昧佛子此菩薩摩訶薩能入三千大千世界微塵數三千大千世界於一一世界現三千大千世界微塵數身一一身放三千大千世界微塵數光一一光現三千大千世界微塵數色一一色照三千大千世界微塵數世界一一世界中調伏三千大千世界微塵數眾生是諸世界種種不同菩薩悉知所謂世界雜染世界清淨世界所因世界建立世界同住世界光色世界來往如是一切菩薩悉知菩薩悉入是諸世界亦悉來入菩薩之身然諸世界無有雜亂種種諸法亦不壞滅佛子譬如日出遶須彌山照七寶山其七寶山及寶山間皆有光影分明顯現其寶山上所有日影莫不顯現山間影中其七山間所有日影亦悉顯現山上影中如是展轉更相影現或說日影出七寶山或說日影出七山間或說日影入七寶山或說日影入七山間但此日影更相照現無有邊際體性非有亦復非無不住於山不離於山不住於水亦不離水佛子菩薩摩訶薩亦復如是住此妙光廣大三昧不壞世界安立之相不滅世間諸法自性不住世界內不住世界外於諸世界無所分別亦不壞於世界之相觀一切法一相無相亦不壞於諸法自性住真如性恒不捨離佛子譬如幻師善知幻術住四衢道作諸幻事於一日中一須臾頃或現一日或現一夜或復現作七日七夜半月一月一年百年隨其所欲皆能示現城邑聚落泉流河海日月雲雨宮殿屋宅如是一切靡不具足不以示現經年歲故壞其根本一日一時不以本時極短促故壞其所現日月年歲幻相明現本日不滅菩薩摩訶薩亦復如是入此妙光廣大三昧現阿僧祇世界入一世界其阿僧祇世界一一皆有地水火風大海諸山城邑聚落園林屋宅天宮龍宮夜叉宮乾闥婆宮阿脩羅宮迦樓羅宮緊那羅宮摩睺羅伽宮種種莊嚴皆悉具足欲界色界無色界小千世界大千世界業行果報死此生彼一切世間所有時節須臾晝夜半月一月一歲百歲成劫壞劫雜染國土清淨國土廣大國土狹小國土於中諸佛出興于世佛剎清淨菩薩眾會周帀圍遶神通自在教化眾生其諸國土所在方處無量人眾悉皆充滿殊形異趣種種眾生無量無邊不可思議去來現在清淨業力出生無量上妙珍寶如是等事咸悉示現入一世界菩薩於此普皆明見普入普觀普思普了以無盡智皆如實知不以彼世界多故壞此一世界不以此世界一故壞彼多世界何以故菩薩知一切法皆無我故是名入無命法無作法者菩薩於一切世間勤修行無諍法故是名住無我法者菩薩如實見一切身皆從緣起故是名住無眾生法者菩薩知一切生滅法皆從因生故是名住無補特伽羅法者菩薩知諸法本性平等故是名住無意生無摩納婆法者菩薩知一切法本性寂靜故是名住寂靜法者菩薩知一切法一相故是名住無分別法者菩薩知法界無有種種差別法故是名住不思議法者菩薩勤修一切方便善調伏眾生故是名住大悲法者佛子菩薩如是能以阿僧祇世界入一世界知無數眾生種種差別見無數菩薩各各發趣觀無數諸佛處處出興彼諸如來所演說法其諸菩薩悉能領受亦見自身於中修行然不捨此處而見在彼亦不捨彼處而見在此彼身此身無有差別入法界故常勤觀察無有休息不捨智慧無退轉故如有幻師隨於一處作諸幻術不以幻地故壞於本地不以幻日故壞於本日菩薩摩訶薩亦復如是於無國土現有國土於有國土現無國土於有眾生現無眾生於無眾生現有眾生無色現色色現無色初不亂後後不亂初菩薩了知一切世法悉亦如是同於幻化知法幻故知智幻知智幻故知業幻知智幻業幻已起於幻智觀一切業如世幻者不於處外而現其幻亦不於幻外而有其處菩薩摩訶薩亦復如是不於虗空外入世間亦不於世間外入虗空何以故虗空世間無差別故住於世間亦住虗空菩薩摩訶薩於虗空中能見能修一切世間種種差別妙莊嚴業於一念頃悉能了知無數世界若成若壞亦知諸劫相續次第能於一念現無數劫亦不令其一念廣大菩薩摩訶薩得不思議解脫幻智到於彼岸住於幻際入世幻數思惟諸法悉皆如幻不違幻世盡於幻智了知三世與幻無別決定通達心無邊際如諸如來住如幻智其心平等菩薩摩訶薩亦復如是知諸世間皆悉如幻於一切處皆無所著無有我所如彼幻師作諸幻事雖不與彼幻事同住而於幻事亦無迷惑菩薩摩訶薩亦復如是知一切法到於彼岸心不計我能入於法亦不於法而有錯亂是為菩薩摩訶薩第二妙光明大三昧善巧智。",
    "X04n0223_068:0464b10_0-0": "【論】第二妙光明三昧者於此段中四義如前一釋三昧名二明三昧體用如下自明三明三昧之境界四隨文釋義一釋三昧名者為明法身理智體淨能現妙光以立其名二釋三昧之體用者明此三昧還以根本智為體幻智為用三明三昧之境界者以入三千大千世界微塵數三千大千世界於一一世界中復現三千大千世界微塵數身乃至一一身放三千大千世界微塵數光具如經說乃至菩薩身中能現一切聖凡國土更相照現重重相入等是此三昧之境界具如經說四隨文釋義者復分為二一長科經意二隨文解釋一長科經意者於此段中長科為十段一佛子已下一行經是普賢菩薩告眾重舉三昧之名分二佛子此菩薩已下至種種諸法亦不壞滅有十一行經明入三昧境界廣狹身土照現互相涉入光影重重不雜亂分三佛子譬如日出已下至亦不離水有八行經明以日光照現七寶山及大海水及山間以此日光影更相照現影像重重無盡光影喻分四佛子菩薩摩訶薩已下至恒不捨離有五行經明如是菩薩住妙光廣大三昧不壞世間相不壞真性二俱不住二俱不壞分五佛子譬如幻師已下至本日不滅有七行經明以幻師幻作日月年歲長短不同不壞本日喻分六菩薩摩訶薩已下至不壞彼多世界有十七行經明菩薩入此妙光大三昧能一多世界更互相入各不妨礙分七何以故已下至是名住大悲法者有十一行經明菩薩住無我法於諸法自他境界身之及心無所妨礙分八佛子已下至無退轉故有六行半經明此菩薩以不可數世界入一世界善知無數眾生差別菩薩趣入差別佛處處出興皆現自身於彼一一佛所修行諸行而身彼此無去來能同異自在分九如有幻師已下至後不亂初有五行半經明以幻師喻菩薩實智所生如幻喻分十菩薩了知一切智幻故已下至下有二十行半經明入此妙光明大三昧得智幻門自在分四隨文釋義者此一段以根本無作智性自徧周以如影智顯現諸境自他相入一多自在由根本智故多入一中猶如影智一現多境各身色相狀差別故如世界所因者今生修是來世因世界建立者明各各世界建立法則故世界同住者一世界中有多類眾生同住光色世界者或有眾生於佛光中住故如此日月星是帝王及人中眾生共業所化精光昇上復有天住居其中故往來者於虗空中持轉往來此菩薩悉知如八部神名如初會中已釋補特伽羅法者數取趣明數取惡法趣於苦果摩納婆法教儒童法餘如經自具。",
    "X04n0223_068:0465a08_0": "【經】佛子云何為菩薩摩訶薩次第徧往諸佛國土神通三昧佛子此菩薩摩訶薩過於東方無數世界復過爾所世界微塵數世界於彼諸世界中入此三昧或剎那入或須臾入或相續入或日初分時入或日中分時入或日後分時入或夜初分時入或夜中分時入或夜後分時入或一日入或五日入或半月入或一月入或一年入或百年入或千年入或百千年入或億年入或百千億年入或百千那由他億年入或一劫入或百劫入或百千劫入或百千那由他億劫入或無數劫入或無量劫入或無邊劫入或無等劫入或不可數劫入或不可稱劫入或不可思劫入或不可量劫入或不可說劫入或不可說不可說劫入若久若近若法若時種種不同菩薩於彼不生分別心無染著不作二不作不二不作普不作別雖離此分別而以神通方便從三昧起於一切法不忘不失至於究竟譬如日天子周行照耀晝夜不住日出名晝日沒名夜晝亦不生夜亦不滅菩薩摩訶薩於無數世界入神通三昧入三昧已明見爾所無數世界亦復如是佛子是為菩薩摩訶薩第三次第徧往諸佛國土神通大三昧善巧智。",
    "X04n0223_068:0465b04_0": "【論】第三次第徧往諸佛國土神通三昧者於此段中約有三門一釋三昧名二釋三昧體用三隨文釋義一釋三昧名者何故名為徧往諸佛國土神通三昧為此三昧以理性自性徧周即智用自體徧周以智用自體徧周即神通徧周此明約理智自體徧周以如幻智應物動寂依根本智恒無來往彼此延促以此立名名為徧往諸佛國土神通三昧二釋三昧體用者此三昧以法性身為體以根本智起如幻智為用此如幻智如空谷響應物成音自無體故以此二智以法為體但有德用而無所依乃至一切眾生心本來如是故但為智自無性不能自了逐境成迷故以止觀二門照之迷解依本此約法身為止體約觀十二緣生成智體用明定能發慧觀能起智三隨文釋義者二義如前一長科經意者於此段中長科為四段一佛子已下至神通三昧有一行半經明普賢重舉三昧之名分二佛子此菩薩已下至於究竟有十六行半經明入三昧延促自在無所分別於諸法不忘失分三譬如日天子已下至亦復如是有三行半經明舉日天子照臨四天下晝夜無生滅喻分四佛子已下至善巧智有一行半經明都舉已上總結其三昧之名分已上文義自具不煩更釋。",
    "X04n0223_068:0465c02_0-0": "【經】佛子云何為菩薩摩訶薩清淨深心行三昧佛子此菩薩摩訶薩知諸佛身數等眾生見無量佛過阿僧祇世界微塵數於彼一一諸如來所以一切種種妙香而作供養以一切種種妙華而作供養以一切種種蓋大如阿僧祇佛剎而作供養以超過一切世界一切上妙莊嚴具而作供養散一切種種寶而作供養以一切種種莊嚴具莊嚴經行處而作供養以一切無數上妙摩尼寶藏而作供養以佛神力所流出過諸天上味飲食而作供養一切佛剎種種上妙諸供養具能以神力普皆攝取而作供養於彼一一諸如來所恭敬尊重頭頂禮敬舉身布地請問佛法讚佛平等稱揚諸佛廣大功德入於諸佛所入大悲得佛平等無礙之力於一念頃一切佛所勤求妙法然於諸佛出興於世入般涅槃如是之相皆無所得如散動心了別所緣心起不知何所緣起心滅不知何所緣滅此菩薩摩訶薩亦復如是終不分別如來出世及涅槃相佛子如日中陽燄不從雲生不從池生不處於陸不住於水非有非無非善非惡非清非濁不堪飲漱不可穢汙非有體非無體非有味非無味以因緣故而現水相為識所了遠望似水而興水想近之則無本想自滅此菩薩摩訶薩亦復如是不得如來出興於世及涅槃相諸佛有相及以無相皆是想心之所分別佛子此三昧名為清淨深心行菩薩摩訶薩於此三昧入已而起起已不失譬如有人從睡得寤憶所夢事覺時雖無夢中境界而能憶念心不忘失菩薩摩訶薩亦復如是入於三昧見佛聞法從定而起憶持不忘而以此法開曉一切道場眾會莊嚴一切諸佛國土無量義趣悉得明達一切法門皆亦清淨然大智炬長諸佛種無畏具足辯才不竭開示演說甚深法藏是為菩薩摩訶薩第四清淨深心行大三昧善巧智。",
    "X04n0223_068:0466a09_0": "【論】第四清淨深心行三昧於此段中三門如前一釋三昧之名者何故名為清淨深心行三昧以菩薩已修空無相之理智得身如理智徧周之身起前理智徧周之身以善巧智加行深心供養隨所供養一切諸佛香華蓋等十事而心不壞法身智身無作無想是故以立其名二釋三昧之體用者以法身根本智為體起方便善巧智興十事供養等眾生數佛為用三隨文釋義二義如前一長科經意者於此段中科為四段一佛子已下一行經明普賢菩薩重舉三昧之名二佛子此菩薩已下至不分別如來出世及涅槃相有十八行半經明以香華蓋等十事供養等眾生數諸佛分三佛子如日中陽燄已下至皆是心想之所分別有七行經明舉日中陽燄喻菩薩得知如來出興滅度分四佛子此三昧已下至善巧智有十行經明入三昧如夢中所見境界憶念不忘為人善說喻分二隨文釋義者其義如文但入觀者善得其宜先須入無思無心定得法身之理稱虗空之性方可於根本智方便起智興供養心起用須得自在稱理智而為之若也但修空無相法身即於智不能起用若但一向生想不見無相法身即純是有為一一依此十定次第方便一一經文自具明矣。",
    "X04n0223_068:0466b07_0-0": "【經】佛子云何為菩薩摩訶薩知過去莊嚴藏三昧佛子此菩薩摩訶薩能知過去諸佛出現所謂劫次第中諸剎次第剎次第中諸劫次第劫次第中諸佛出現次第佛出現次第中說法次第說法次第中諸心樂次第心樂次第中諸根次第根次第中調伏次第調伏次第中諸佛壽命次第壽命次第中知億那由他年歲數量次第佛子此菩薩摩訶薩得如是無邊次第智故則知過去諸佛則知過去諸剎則知過去法門則知過去諸劫則知過去諸法則知過去諸心則知過去諸解則知過去諸眾生則知過去諸煩惱則知過去諸儀式則知過去諸清淨佛子此三昧名過去清淨藏於一念中能入百劫能入千劫能入百千劫能入百千億那由他劫能入無數劫能入無量劫能入無邊劫能入無等劫能入不可數劫能入不可稱劫能入不可思劫能入不可量劫能入不可說劫能入不可說不可說劫佛子彼菩薩摩訶薩入此三昧不滅現在不緣過去佛子彼菩薩摩訶薩從此三昧起於如來所受十種不可思議灌頂法亦得亦清淨亦成就亦入亦證亦滿亦持平等了知三輪清淨何等為十一者辯不違義二者說法無盡三者訓詞無失四者樂說不斷五者心無恐畏六者語必誠實七者眾生所依八者救脫三界九者善根最勝十者調御妙法佛子此是十種灌頂法若菩薩入此三昧從三昧起無間則得如歌羅邏入胎藏時於一念間識則託生菩薩摩訶薩亦復如是從此定起於如來所一念則得此十種法佛子是名菩薩摩訶薩第五知過去莊嚴藏大三昧善巧智。",
    "X04n0223_068:0466c10_0": "【論】第五知過去莊嚴藏三昧於此段中三門如前一釋三昧名者何故名為知過去莊嚴藏大三昧此菩薩入此定中能知過去諸佛出現劫剎諸佛出現法門以嚴自心根本智具差別智以此成名為前之三昧興其供養於定中須知劫剎諸佛出興之次第法門二釋三昧之體用者以根本智為體知劫剎次第差別智為用已下如文三隨文釋義者三輪者神通記心正教是三輪清淨明此三昧得神通善記不忘善說諸法如歌羅邏者此云薄酪謂初受胎如薄酪自餘如文自具。",
    "X04n0223_068:0466c21_0": "大方廣佛新華嚴經合論卷第六十八",
    "X04n0223_068:0466c23_0": "音切",
    "X04n0223_068:0466c24_0": "儒(人朱切)。",
    "X04n0223_068:0466c24_1": "漱(所奏切)。",
    "X04n0223_068:0466c24_2": "覺(教音)。",
    "X04n0223_068:0466c24_3": "邏(郎佐切)。",
    "X04n0223_068:0466c24_4": "酪(盧各切)。",
    "X04n0223_068:0466c24_5": "錯(倉各切)。",
    "X04n0223_068:0466c24_6": "暎(於敬切)。",
    "X04n0223_068:0467a01_7": "蔽(必袂切)。"
}