{
    "X04n0223_101:0670a13_0": "大方廣佛新華嚴經合論卷第一百一",
    "X04n0223_101:0670a14_0": "唐于闐國三藏沙門實叉難陀譯經",
    "X04n0223_101:0670a15_0": "唐太原方山長者李通玄造論",
    "X04n0223_101:0670a16_0": "唐福州開元寺沙門志寧釐經合論",
    "X04n0223_101:0670a17_0": "入法界品第三十九之十四",
    "X04n0223_101:0670a18_0": "【論】第二樓閣城婆施羅船師主不壞迴向。",
    "X04n0223_101:0670a19_0-0": "【經】爾時善財童子向樓閣城觀察道路所謂觀道高卑觀道夷險觀道淨穢觀道曲直漸次遊行作是思惟我當親近彼善知識善知識者是成就修行諸菩薩道因是成就修行波羅蜜道因是成就修行攝眾生道因是成就修行普入法界無障礙道因是成就修行令一切眾生除惡慧道因是成就修行令一切眾生離憍慢道因是成就修行令一切眾生滅煩惱道因是成就修行令一切眾生捨諸見道因是成就修行令一切眾生拔一切惡刺道因是成就修行令一切眾生至一切智城道因何以故於善知識處得一切善法故依善知識力得一切智道故善知識者難見難遇如是思惟漸次遊行既至彼城見其船師在城門外海岸上住百千商人及餘無量大眾圍遶說大海法方便開示佛功德海善財見已往詣其所頂禮其足繞無量帀於前合掌而作是言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能教誨願為我說船師告言善哉善哉善男子汝已能發阿耨多羅三藐三菩提心今復能問生大智因斷除一切生死苦因往一切智大寶洲因成就不壞摩訶衍因遠離二乘怖畏生死住諸寂靜三昧旋因乘大願車徧一切處行菩薩行無有障礙清淨道因以菩薩行莊嚴一切無能壞智清淨道因普觀一切十方諸法皆無障礙清淨道因速能趣入一切智海清淨道因善男子我在此城海岸路中淨修菩薩大悲幢行善男子我觀閻浮提內貧窮眾生為饒益故修諸苦行隨其所願悉令滿足先以世物充滿其意復施法財令其歡喜令修福行令生智道令增善根力令起菩提心令淨菩提願令堅大悲力令修能滅生死道令生不厭生死行令攝一切眾生海令修一切功德海令照一切諸法海令見一切諸佛海令入一切智智海善男子我住於此如是思惟如是作意如是利益一切眾生善男子我知海中一切寶洲一切寶處一切寶類一切寶種我知淨一切寶鑽一切寶出一切寶作一切寶我知一切寶器一切寶用一切寶境界一切寶光明我知一切龍宮處一切夜叉宮處一切部多宮處皆善迴避免其諸難亦善別知漩澓淺深波濤遠近水色好惡種種不同亦善別知日月星宿運行度數晝夜晨晡晷漏延促亦知其船鐵木堅脆機關澀滑水之大小風之逆順如是一切安危之相無不明了可行則行可止則止善男子我以成就如是智慧常能利益一切眾生善男子我以好船運諸商眾行安隱道復為說法令其歡喜引至寶洲與諸珍寶咸使充足然後將領還閻浮提善男子我將大船如是往來未始令其一有損壞若有眾生得見我身聞我法者令其永不怖生死海必得入於一切智海必能消竭諸愛欲海能以智光照三世海能盡一切眾生苦海能淨一切眾生心海速能嚴淨一切剎海普能往詣十方大海普知一切眾生根海普了一切眾生行海普順一切眾生心海善男子我唯得此大悲幢行若有見我及以聞我與我同住憶念我者皆悉不空如諸菩薩摩訶薩善能遊涉生死大海不染一切諸煩惱海能捨一切諸妄見海能觀一切諸法性海能以四攝攝眾生海已善安住一切智海能滅一切眾生著海能平等住一切時海能以神通度眾生海能以其時調眾生海而我云何能知能說彼功德行善男子於此南方有城名可樂中有長者名無上勝汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子頂禮其足遶無量帀殷勤瞻仰悲泣流淚求善知識心無厭足辭退而去。",
    "X04n0223_101:0671a07_0-0": "【論】第一正入當位法門中從爾時善財已下至我唯知此大悲幢行若有見我及以聞我與我同住憶念我者皆悉不空此段門中分為五門一念善知識教思惟升進二漸次遊行往詣彼城三見其船師在城門外海岸上住四禮敬合掌申其所求五船師授與善財自行法門隨文釋義者見船師在城門外海岸上住百千商人及餘大眾圍遶此有二義一實有此行以主導入海商人及採寶者為海險難非聖智不知二表法以自得真門出纏離苦以其願行成大悲海常臨生死海岸引接眾生百千商人表戒波羅蜜中萬行圓滿無量大眾表行徧周滿一切諸行經云往一切智大寶洲因成就不壞摩訶衍因者摩訶云大衍云乘所說之教總云大乘教遠離二乘怖畏生死住寂靜三昧旋還此明歎譽善財明能以寂靜三昧處生死旋還利生不出故善男子我知此海中一切寶洲一切寶處一切寶類一切寶種一切寶器如是實有此智聖智所知世間諸法表法者我知海中一切寶洲者明達一切智洲一切寶處者善別賢能諸根利純一切寶類者善知同行類別行類一切寶種者善知大小乘差別種我知一切寶器者知眾生大小根器堪與何法而成熟之一切寶用應根與法令任其作用一切寶境界三乘一乘三寶境界一切寶光明者三乘一乘智慧大小光明我知淨一切寶者三十七道品十波羅蜜五停心觀方便是淨一切智寶方便鑽一切寶者止觀二門是出一切寶者善能依根設教令現智寶故作一切寶者以無相智起差別智以大願風興大慈雲雨諸寶雨化一切眾生和合心境令使無依自能顯現一切智寶故一切龍宮難處者淨土菩薩如龍分有慈悲遊空神足一分自在夜叉喻聲聞能空三毒亦得神通羅剎宮難處者喻緣覺居涅槃海能空無明及諸佛一切智種不現前故如是等難悉皆以迴向願力同處生死不害無明十二有支達取無明成佛種智處法界緣生自在門名為悉皆迴避免其諸難亦善別知漩澓深淺者愛取有業深淺也波濤遠近者情識想念攀緣多少水色好惡者愛心善惡亦善別知日月星宿運度數量晝夜晨晡晷漏延促者明了世事中明陰陽玄象五星行度數風起時分晷漏四時延促皆悉知之表法中明五位進修及三乘差別教分行門隨行隨根迴轉軌則方法時熟解脫日月歲劫所經多少悉能知之其船鐵木堅脆機關澀滑水之大小風之逆順如是一切安危之相無不明了者實知此事表法者明善知三乘迴心未迴心堪入生死不堪入生死根器成熟及未成熟一乘中菩薩第六住第六地現前處生死中得出生死心三空智慧寂滅現前七住七地菩薩於出生死中常處生死八住八地得無生忍現前菩薩無功智現前任運利生九住九地學佛十力四無畏十住十地一分與如來出世智慧解脫知見齊圓住佛灌頂位十一地方學普賢神通妙行至普賢行品方終如來出現品中佛果文殊普賢三法法身根本智差別智方始理智大慈悲如先所發願稱願圓滿如三乘教中後得智以普賢行教化眾生此一乘中名字教法說似前後如是升進不出一剎那際如是三乘因前果後道滿三祇如是一乘見道在初發心住中加行行因在十行十迴向十地十一地如是船之鐵木安危澀滑悉能知之乃至知根遲速應止即止且止三乘及以人天法中乃至五停心觀根若熟者應行即行令使升進一乘法中以生死性十二有支便為法事大智用故已下大意如然善男子我將好船運諸商眾至安隱道乃至引至寶洲與其珍寶咸令充足然後將領還閻浮提者是事表法中明從初發心住得佛根本智自此已去經後諸位中皆與說其妙法至於十地一切智智之道珍寶已滿十一地中還當送至本所舊住生死海中以此所得一切智智之珍寶廣利無盡眾生此明約修行升進作如是說使令易解而亦不出生死海中成大寶洲自餘如文自具此皆約事理說託事表法令生解故此是第二不壞迴向善知識船師云我將大船往來無始無有令其一損壞者若有眾生得見我身聞我法者令其永不怖生死海必得入於一切智海者是不壞迴向義以戒波羅蜜為主餘九為伴約智門中諸位通治約位門中以成大慈悲戒以海中船師所表往來常不出生死海故成大悲幢行已下推德升進第二推德令善財升進中從如諸菩薩已下至辭退而去有十行經約分為五門一推德升進二示善知識之方所三舉善知識所居之城名可樂四舉善知識之名號曰無上勝五禮敬辭去城名可樂者以長者善明斷決人間種種諸事復能說出世之法眾生樂之不捨故城名可樂長者號無上勝者此是忍波羅蜜門處眾行之中忍為殊勝又德藝過世間故號為無上勝餘行約前歎德中所說。",
    "X04n0223_101:0672a21_0": "第三可樂城無上勝長者主等一切佛迴向。",
    "X04n0223_101:0672a22_0-0": "【經】爾時善財童子起大慈周徧心大悲潤澤心相續不斷福德智慧二種莊嚴捨離一切煩惱塵垢證法平等心無高下拔不善刺滅一切障堅固精進以為牆壍甚深三昧而作園苑以慧日光破無明闇以方便風開智慧華以無礙願充滿法界心常現入一切智城如是而求菩薩之道漸次經歷到彼城內見無上勝在其城東大莊嚴幢無憂林中無量商人百千居士之所圍遶理斷人間種種事務因為說法令其永拔一切我慢離我我所捨所積聚滅慳嫉垢心得清淨無諸穢濁獲淨信力常樂見佛受持佛法生菩薩力起菩薩行入菩薩三昧得菩薩智慧住菩薩正念增菩薩樂欲爾時善財童子觀彼長者為眾說法已以身投地頂禮其足良久乃起白言聖者我是善財我是善財我專尋求菩薩之行菩薩云何學菩薩行菩薩云何修菩薩道隨修學時常能化度一切眾生常能現見一切諸佛常得聽聞一切佛法常能住持一切佛法常能趣入一切法門入一切剎學菩薩行住一切劫修菩薩道能知一切如來神力能受一切如來護念能得一切如來智慧時彼長者告善財言善哉善哉善男子汝已能發阿耨多羅三藐三菩提心善男子我成就至一切處菩薩行門無依無作神通之力善男子云何為至一切處菩薩行門善男子我於此三千大千世界欲界一切諸眾生中所謂一切三十三天一切須夜摩天一切兜率陀天一切善變化天一切他化自在天一切魔天及餘一切天龍夜叉羅剎娑鳩槃茶乾闥婆阿脩羅迦樓羅緊那羅摩睺羅伽人與非人村營城邑一切住處諸眾生中而為說法令捨非法令息諍論令除鬬戰令止忿競令破怨結令解繫縛令出牢獄令免怖畏令斷殺生乃至邪見一切惡業不可作事皆令禁止令其順行一切善法令其修學一切技藝於諸世間而作利益為其分別種種諸論令生歡喜令漸成熟隨順外道為說勝智令斷諸見令入佛法乃至色界一切梵天我亦為其說超勝法如於此三千大千世界乃至十方十不可說百千億那由他佛剎微塵數世界中我皆為說佛法菩薩法聲聞法獨覺法說地獄說地獄眾生說向地獄道說畜生說畜生差別說畜生受苦說向畜生道說閻羅王世間說閻羅王世間苦說向閻羅王世間道說天世間說天世間樂說向天世間道說人世間說人世間苦樂說向人世間道為欲開顯菩薩功德為令捨離生死過患為令知見一切智人諸妙功德為欲令知諸有趣中迷惑受苦為令知見無障礙法為欲顯示一切世間生起所因為欲顯示一切世間寂滅為樂為令眾生捨諸想著為令證得佛無依法為令永滅諸煩惱輪為令能轉如來法輪我為眾生說如是法善男子我唯知此至一切處修菩薩行清淨法門無依無作神通之力如諸菩薩摩訶薩具足一切自在神通悉能徧往一切佛剎得普眼地悉聞一切音聲言說普入諸法智慧自在無有乖諍勇健無比以廣長舌出平等音其身妙好同諸菩薩與諸如來究竟無二無有差別智身廣大普入三世境界無際同於虗空而我云何能知能說彼功德行善男子於此南方有一國土名曰輸那其國有城名迦陵迦林有比丘尼名師子頻申汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子頂禮其足遶無量帀殷勤瞻仰辭退而去。",
    "X04n0223_101:0673a06_0-0": "【論】第一正入當位法門中從爾時善財童子已下至一切處修菩薩行清淨法門無依無作神通之力於此段中約立五門一念善知識教思惟升進二漸次經歷到於彼城三見無上勝長者在其城東無憂林中商眾居士無量百千之所圍遶四投身於地禮敬而起五正申所請無上勝便授自所行法門隨文釋義者漸次經歷到彼城內者升進入位名內見無上勝在城東者明以智利生為東表不住本位東方表智以就俗引眾生發明生位也西方表慈悲如下以觀世音菩薩住金剛山之西阿表慈悲位也以此是等一切佛迴向佛者覺也以角宿是東方之宿以角主僧尼道士眾善之門俗作此角計所主屬合作此覺也為主眾善門故角為天門眾善也以此在城東普賢智行以東表之表明生眾善之首觀音大慈悲行以西方表之以西方是金金為白虎主秋主殺以慈悲主之以是經云明練十方儀式主方神又主方神隨方迴轉意明隨方法迴轉以度眾生然實大象性自無形體虗融而非跡隨方表法法逐緣分聖人垂訓於俗纏還以俗緣中事物而表法只如亡言之理不可以引蒙絕象真源不可以益俗是故以方隅而表法執之者還非利俗啟迷廢之者復失今者利俗啟迷以城東是引迷明生起眾善之義亦以房為青龍是世間福德之位無憂林中者此主忍波羅蜜以忍成滿處行無憂故林者以此長者行徧十方隨形而廣蔭羣品以行廣多覆蔭故為林亦以化他令無憂故為無憂林也無量商人百千居士之所圍遶者是所化之象表以愚易智以智易愚以惡易善亦為商人常處生死以行仁德化利羣品名為居士此約行釋善財童子觀長者為眾說法已以身投地表十迴向大體約迴真入俗以大慈悲善忍為地再云我是善財我是善財者表求法深重也亦明達我無我以成忍也已下長者告善財所行之行名成就一切處菩薩行以明如一切佛迴向十方一切世界一切眾生所行無不徧故如下文具明如十住中從初至第三住見三比丘表從世間修出世間法此從初迴向見三長者是純俗流合香船師無上勝等明從真入俗名為迴向此是等一切佛迴向中善知識以忍波羅蜜為主餘九為伴約智門中諸位通治約位門中治入生死海中忍不自在障令得法忍自在前十住十行明修出世間離苦忍此位明入世間中成就慈悲饒益忍以此十迴向中捨身肉手足國城妻子有來乞者無厭恨心倍增歡喜第二推德升進中從如諸菩薩已下至辭退而去有十行半經分為五門一推德升進二示善友所住之國三示善知識所居之城名四舉善知識名號五禮敬辭去城名迦陵林者此云相鬬諍以此比丘尼位同十住中第四住十地第四地出三界纏生如來家以迴真入俗成無染慈明比丘是出俗義尼是慈音明迴向行位法門非男女性示相表法也以實而言此尼是此位法故表以真入俗和融真俗是非染淨二見諍故成法性理智處俗恒真無染之慈以滅真俗有無染淨二見鬬諍故成就第四至一切處迴向行精進慈以此城名鬬諍林者明慈行徧周覆蔭廣多故故名為林亦約此比丘尼報得莊嚴眾寶林樹廣多故號為林國名輸那此名勇猛者是精進義為此是第四精進波羅蜜此教皆是託處託事表法以事即法也尼名師子頻申者約德行成名如師子頻申者明慈悲適悅行徧十方教化眾生無有疲勞法樂義也如人身心舒適悅樂也表比丘尼雖行徧十方善和鬬諍心恒出俗也明迴向中處纏無染慈故。",
    "X04n0223_101:0673c21_0": "第四迦陵林城師子頻申比丘尼主至一切處迴向。",
    "X04n0223_101:0673c23_0-0": "【經】爾時善財童子漸次遊行至彼國城周徧推求此比丘尼有無量人咸告之言善男子此比丘尼在勝光王之所捨施日光園中說法利益無量眾生時善財童子即詣彼園周徧觀察見其園中有一大樹名為滿月形如樓閣放大光明照一由旬見一葉樹名為普覆其形如蓋放毗瑠璃紺青光明見一華樹名曰華藏其形高大如雪山王雨眾妙華無有窮盡如忉利天中波利質多羅樹復見有一甘露果樹形如金山常放光明種種眾果悉皆具足復見有一摩尼寶樹名毗盧遮那藏其形無比心王摩尼寶最在其上阿僧祇色相摩尼寶周徧莊嚴復有衣樹名為清淨種種色衣垂布嚴飾復有音樂樹名為歡喜其音美妙過諸天樂復有香樹名普莊嚴恒出妙香普熏十方無所障礙園中復有泉流陂池一切皆以七寶莊嚴黑栴檀泥凝積其中上妙金沙彌布其底八功德水具足盈滿優鉢羅華波頭摩華拘物頭華芬陀利華徧覆其上無量寶樹周徧行列諸寶樹下敷師子座種種妙寶以為莊嚴布以天衣熏諸妙香垂諸寶繒施諸寶帳閻浮金網彌覆其上寶鐸徐搖出妙音聲或有樹下敷蓮華藏師子之座或有樹下敷香王摩尼藏師子之座或有樹下敷龍莊嚴摩尼王藏師子之座或有樹下敷寶師子聚摩尼王藏師子之座或有樹下敷毗盧遮那摩尼王藏師子之座或有樹下敷十萬毗盧遮那摩尼王藏師子之座其一一座各有十萬寶師子座周帀圍遶一一皆具無量莊嚴此大園中眾寶徧滿猶如大海寶洲之上迦隣陀衣以布其地柔輭妙好能生樂觸蹈則沒足舉則還復無量諸鳥出和雅音寶栴檀林上妙莊嚴種種妙華常雨無盡猶如帝釋襍華之園無比香王普熏一切猶如帝釋善法之堂諸音樂樹寶多羅樹眾寶鈴網出妙音聲如自在天善口天女所出歌音諸如意樹種種妙衣垂布莊嚴猶如大海有無量色百千樓閣眾寶莊嚴如忉利天宮善見大城寶蓋遐張如須彌峯光明普照如梵王宮爾時善財童子見此大園無量功德種種莊嚴皆是菩薩業報成就出世善根之所生起供養諸佛功德所流一切世間無與等者如是皆從師子頻申比丘尼了法如幻集廣大清淨福德善業之所成就三千大千世界天龍八部無量眾生皆入此園而不迫窄何以故此比丘尼不可思議威神力故爾時善財見師子頻申比丘尼徧坐一切諸寶樹下大師子座身相端嚴威儀寂靜諸根調順如大象王心無垢濁如清淨池普濟所求如如意寶不染世法猶如蓮華心無所畏如師子王護持淨戒不可傾動如須彌山能令見者心得清涼如妙香王能除眾生諸煩惱熱如雪山中妙栴檀香眾生見者諸苦消滅如善見藥王見者不空如婆樓那天能長一切眾善根芽如良沃田在一一座眾會不同所說法門亦各差別或見處座淨居天眾所共圍遶大自在天子而為上首此比丘尼為說法門名無盡解脫或見處座諸梵天眾所共圍遶愛樂梵王而為上首此比丘尼為說法門名普門差別清淨言音輪或見處座他化自在天天子天女所共圍遶自在天王而為上首此比丘尼為說法門名菩薩清淨心或見處座善變化天天子天女所共圍遶善化天王而為上首此比丘尼為說法門名一切法善莊嚴或見處座兜率陀天天子天女所共圍遶兜率天王而為上首此比丘尼為說法門名心藏旋或見處座須夜摩天天子天女所共圍遶夜摩天王而為上首此比丘尼為說法門名無邊莊嚴或見處座三十三天天子天女所共圍遶釋提桓因而為上首此比丘尼為說法門名厭離門或見處座百光明龍王難陀龍王優波難陀龍王摩那斯龍王伊羅跋難陀龍王阿那婆達多龍王等龍子龍女所共圍遶娑伽羅龍王而為上首此比丘尼為說法門名佛神通境界光明莊嚴或見處座諸夜叉眾所共圍遶毗沙門天王而為上首此比丘尼為說法門名救護眾生藏或見處座乾闥婆眾所共圍遶持國乾闥婆王而為上首此比丘尼為說法門名無盡喜或見處座阿脩羅眾所共圍遶羅睺阿脩羅王而為上首此比丘尼為說法門名速疾莊嚴法界智門或見處座迦樓羅眾所共圍遶捷持迦樓羅王而為上首此比丘尼為說法門名怖動諸有海或見處座緊那羅眾所共圍遶大樹緊那羅王而為上首此比丘尼為說法門名佛行光明或見處座摩睺羅伽眾所共圍遶庵羅林摩睺羅伽王而為上首此比丘尼為說法門名生佛歡喜心或見處座無量百千男子女人所共圍遶此比丘尼為說法門名殊勝行或見處座諸羅剎眾所共圍遶常奪精氣大樹羅剎王而為上首此比丘尼為說法門名發生悲愍心或見處座信樂聲聞乘眾生所共圍遶此比丘尼為說法門名勝智光明或見處座信樂緣覺乘眾生所共圍遶此比丘尼為說法門名佛功德廣大光明或見處座信樂大乘眾生所共圍遶此比丘尼為說法門名普門三昧智光明門或見處座初發心諸菩薩所共圍遶此比丘尼為說法門名一切佛願聚或見處座第二地諸菩薩所共圍遶此比丘尼為說法門名離垢輪或見處座第三地諸菩薩所共圍遶此比丘尼為說法門名寂靜莊嚴或見處座第四地諸菩薩所共圍遶此比丘尼為說法門名生一切智境界或見處座第五地諸菩薩所共圍遶此比丘尼為說法門名妙華藏或見處座第六地諸菩薩所共圍遶此比丘尼為說法門名毗盧遮那藏或見處座第七地諸菩薩所共圍遶此比丘尼為說法門名普莊嚴地或見處座第八地諸菩薩所共圍遶此比丘尼為說法門名徧法界境界身或見處座第九地諸菩薩所共圍遶此比丘尼為說法門名無所得力莊嚴或見處座第十地諸菩薩所共圍遶此比丘尼為說法門名無礙輪或見處座執金剛神所共圍遶此比丘尼為說法門名金剛智那羅延莊嚴善財童子見如是等一切諸趣所有眾生已成熟者已調伏者堪為法器皆入此園各於座下圍遶而坐師子頻申比丘尼隨其欲解勝劣差別而為說法令於阿耨多羅三藐三菩提得不退轉何以故此比丘尼入普眼捨得般若波羅蜜門說一切佛法般若波羅蜜門法界差別般若波羅蜜門散壞一切障礙輪般若波羅蜜門生一切眾生善心般若波羅蜜門殊勝莊嚴般若波羅蜜門無礙真實藏般若波羅蜜門法界圓滿般若波羅蜜門心藏般若波羅蜜門普出生藏般若波羅蜜門此十般若波羅蜜門為首入如是等無數百萬般若波羅蜜門此日光園中所有菩薩及諸眾生皆是師子頻申比丘尼初勸發心受持正法思惟修習於阿耨多羅三藐三菩提得不退轉時善財童子見師子頻申比丘尼如是園林如是牀座如是經行如是眾會如是神力如是辯才復聞不可思議法門廣大法雲潤澤其心便生是念我當右遶無量百千帀時比丘尼放大光明普照其園眾會莊嚴善財童子師自見身及園林中所有眾樹皆悉右遶此比丘尼經於無量百千萬帀圍遶畢已善財童子合掌而住白言聖者我已先發阿耨多羅三藐三菩提心而未知菩薩云何學菩薩行云何修菩薩道我聞聖者善能誘誨願為我說比丘尼言善男子我得解脫名成就一切智善財言聖者何故名為成就一切智比丘尼言善男子此智光明於一念中普照三世一切諸法善財白言聖者此智光明境界云何比丘尼言善男子我入此智光明門得出生一切法三昧王以此三昧故得意生身往十方一切世界兜率天宮一生所繫菩薩所一一菩薩前現不可說佛剎微塵數身一一身作不可說佛剎微塵數供養所謂現天王身乃至人王身執持華雲執持鬘雲燒香塗香及以末香衣服纓絡幢幡繒蓋寶網寶帳寶藏寶燈如是一切諸莊嚴具我皆執持而以供養如於住兜率宮菩薩所如是於住胎出胎在家出家往詣道場成等正覺轉正法輪入於涅槃如是中間或住天宮或住龍宮乃至或復住於人宮於彼一一諸如來所我皆如是而為供養若有眾生知我如是供養佛者皆於阿耨多羅三藐三菩提得不退轉若有眾生來至我所我即為說般若波羅蜜善男子我見一切眾生不分別眾生相智眼明見故聽一切語言不分別語言相心無所著故見一切如來不分別如來相了達法身故住持一切法輪不分別法輪相悟法自性故一念徧知一切法不分別諸法相知法如幻故善男子我唯知此成就一切智解脫如諸菩薩摩訶薩心無分別普知諸法一身端坐充滿法界於自身中現一切剎一念悉詣一切佛所於自身內普現一切諸佛神力一毛徧舉不可言說諸佛世界於其自身一毛孔中現不可說世界成壞於一念中與不可說不可說眾生同住於一念中入不可說不可說一切諸劫而我云何能知能說彼功德行善男子於此南方有一國土名曰險難此國有城名寶莊嚴中有女人名婆須蜜多汝詣彼問菩薩云何學菩薩行修菩薩道時善財童子頂禮其足遶無數帀殷勤瞻仰辭退而去。",
    "X04n0223_101:0676a06_0-0": "【論】第一正入當位法門中從爾時善財童子已下至我唯知此成就一切智解脫門於此段中約分五門一漸次遊行至彼國城二周徧推求此比丘尼三眾人告語比丘尼之所在四善財詣彼勝光王日光園中觀察見比丘尼所有依報五善財合掌申請所求比丘尼授與善財自行之法如第四善財詣勝光王日光園中觀察見比丘尼之依報中及大眾莊嚴有十三種一寶樹莊嚴二七寶流泉陂池及華莊嚴三寶樹下師子座莊嚴四眾寶嚴地五林雨華香莊嚴六音樂樹及以眾寶鈴樂音和鳴莊嚴七天衣莊嚴八百千寶樓閣莊嚴及寶蓋莊嚴九如須彌峯光明莊嚴十宮殿莊嚴十一歎比丘尼所有功德出世善根供養諸佛之所生起十二歎比丘尼志德三業現化業用周徧見者不空十三明大眾圍遶此已下三十種眾皆明此比丘尼攝生行徧隨根授法各各不同直至十一地金剛智次隣佛位已來眾總皆攝化明一位徧五位行故一一位皆然皆行徧法界如是重重鍊磨以五十三法一百一十城法方稱總別同異成壞無盡自在之法一一位中皆徧一切位也為顯一法徧多法故以一位徧一切行故為顯多法入一法故安立五位五百法門入一法故明總不異別別不異總如帝網相入也如上勝光王之所捨施者是事表法者明一切智忍慈三法總會故比丘出家捨飾好是忍尼是慈悲義勝光王是智明以願力迴向入俗行精進行和會忍智慈總攝五位之行總為一法界體用故以師子頻申是法界門中法悅樂故從此精進行中會此三法忍智慈至第七第八迴向位中見觀音正趣菩薩方始齊故後之二位修佛十力作用也前三長者非無此智忍慈此約升進勝劣言之表長者猶明智多悲劣尼表悲心處世無染童女表染而不汙波利質多羅樹者此云香徧此樹根莖枝葉悉皆徧熏忉利諸天此乃約行徧熏法界迦隣衣此云細綿衣婆樓那天此云水天普眼捨得等十般若門如經具明是比丘尼所說之法如是無數百萬般若門日光園者以忍智慈為園體善財合掌住立申請不致禮敬但與園中眾樹悉右遶者表眾樹是行報生明以眾行園林以忍智慈三昧法具故以表三行圓滿但與行圍遶是所敬法故無別禮也與眾樹圍遶明會入忍智慈三行故是此位精進義善財申請比丘尼與法名成就一切智者此約根本智中忍智慈悲一切差別智從此三法而具足出生以此攝化之眾直至十地之後金剛智神通善財又請此法門境界如何如經云善男子我入此智光明門得出生一切法三昧王以此三昧故得意生身已下是此法門所作業用境界如經具明大意約以根本智起忍智慈悲萬行大用自在差別法門稱法界境界故從此樣式修行相稱即號觀世音亦名正趣菩薩無功之智及慈悲齊等故是故第七迴向中觀世音與正趣同會一處而見善男子我見一切眾生不分別眾生相以智眼明見故乃至聽聞語言音聲佛法僧皆無所著以智眼所見法眼所知故已下推德令善財升進第二如諸菩薩摩訶薩已下是推德升進於此升進分中有十一行經分為五門一推德升進二示善知識方所及所居之國三舉所居之城名寶莊嚴四舉善知識名號五禮敬辭去南方如初釋國名險難者為此女人行禪波羅蜜門歎德之中一身端坐充滿法界於自身中現一切剎善惡境界總以法界禪體徧該普含眾行普攝眾生普皆同事徹滿十方一切諸境或有世人見其染行者見聞難信故號國名險難也城名寶莊嚴者見聞難信名為險難信而悟入心境皆無稱性惑除生死永盡獲自神通名寶莊嚴明二乘及出纏菩薩離而不為名解脫此十迴向中第五迴向迴出纏行中第五清淨無染禪入於世間同為俗事徧行利生之中乃至示行染法未曾一念染汙之心故號女也而實體中非男非女以取妙智理性本真大慈悲體如女非如世情起男女等見若存世情起男女見者亦自不見此之法門此約菩薩以妙智用起慈悲之行冥同俗行周備十方對現色身應宜設化於此位中表菩薩有如是德處真不證在纏不汙法門徧周法界誰是誰非此非世情思度故亦非世情愚惑所行自非智徹真源行齊法界冥應所為知根備俗者歟方能體會斯道婆煩蜜女者此云世友或云天友為徧與人天作師友故或云以寶易財或示現世間婬染之行易以財事此皆世行難可了知三界六道人天地獄無行不備也此是不染而染唯普賢智所及。",
    "X04n0223_101:0677a15_0": "大方廣佛新華嚴經合論卷第一百一",
    "X04n0223_101:0677a17_0": "音切",
    "X04n0223_101:0677a18_0": "鑽(子官切)。",
    "X04n0223_101:0677a18_1": "晡(博孤切)。",
    "X04n0223_101:0677a18_2": "晷(鬼音)。",
    "X04n0223_101:0677a18_3": "脆(此惠切)。",
    "X04n0223_101:0677a18_4": "澀(色立切)。",
    "X04n0223_101:0677a18_5": "窄(子革切)。"
}