{
    "X04n0223_069:0467a05_0": "大方廣佛新華嚴經合論卷第六十九",
    "X04n0223_069:0467a06_0": "唐于闐國三藏沙門實叉難陀譯經",
    "X04n0223_069:0467a07_0": "唐太原方山長者李通玄造論",
    "X04n0223_069:0467a08_0": "唐福州開元寺沙門志寧釐經合論",
    "X04n0223_069:0467a09_0": "十定品第二十七之三",
    "X04n0223_069:0467a10_0-0": "【經】佛子云何為菩薩摩訶薩智光明藏三昧佛子彼菩薩摩訶薩住此三昧能知未來一切世界一切劫中所有諸佛若已說若未說若已授記若未授記種種名號各各不同所謂無數名無量名無邊名無等名不可數名不可稱名不可思名不可量名不可說名當出現於世當利益眾生當作法王當興佛事當說福利當讚善義當說白分義當淨治諸惡當安住功德當開示第一義諦當入灌頂位當成一切智彼諸如來修圓滿行發圓滿願入圓滿智有圓滿眾備圓滿莊嚴集圓滿功德悟圓滿法得圓滿果具圓滿相成圓滿覺彼諸如來名姓種族方便善巧神通變化成熟眾生入般涅槃如是一切皆悉了知此菩薩於一念中能入一劫百劫千劫百千劫百千億那由他劫入閻浮提微塵數劫入四天下微塵數劫入小千世界微塵數劫入中千世界微塵數劫入大千世界微塵數劫入百佛剎微塵數劫入百千佛剎微塵數劫入百千億那由他佛剎微塵數劫入無數佛剎微塵數劫入無量佛剎微塵數劫入無邊佛剎微塵數劫入無等佛剎微塵數劫入不可數佛剎微塵數劫入不可稱佛剎微塵數劫入不可思佛剎微塵數劫入不可量佛剎微塵數劫入不可說佛剎微塵數劫入不可說不可說佛剎微塵數劫如是未來一切世界所有劫數能以智慧皆悉了知以了知故其心復入十種持門何者為十所謂入佛持故得不可說佛剎微塵數諸佛護念入法持故得十種陀羅尼光明無盡辯才入行持故出生圓滿殊勝諸願入力持故無能暎蔽無能摧伏入智持故所行佛法無有障礙入大悲持故轉於不退清淨法輪入差別善巧句持故轉一切文字輪淨一切法門地入師子受生法持故開法關鑰出欲淤泥入智力持故修菩薩行常不休息入善友力持故令無邊眾生普得清淨入無住力持故入不可說不可說廣大劫入法力持故以無礙方便智知一切法自性清淨佛子菩薩摩訶薩住此三昧已善巧住不可說不可說劫善巧住不可說不可說剎善巧知不可說不可說種種眾生善巧知不可說不可說眾生異相善巧知不可說不可說同異業報善巧知不可說不可說精進諸根習氣相續差別諸行善巧知不可說不可說無量染淨種種思惟善巧知不可說不可說法種種義無量文字演說言詞善巧知不可說不可說種種佛出現種族時節現相說法施為佛事入般涅槃善巧知不可說不可說無邊智慧門善巧知不可說不可說一切神通無量變現佛子譬如日出世間所有村營城邑宮殿屋宅山澤鳥獸樹林華果如是一切種種諸物有目之人悉得明見佛子日光平等無有分別而能令目見種種相此大三昧亦復如是體性平等無有分別能令菩薩知不可說不可說百千億那由他差別之相佛子此菩薩摩訶薩如是了知時令諸眾生得十種不空何等為十一者見不空令諸眾生生善根故二者聞不空令諸眾生得成熟故三者同住不空令諸眾生心調伏故四者發起不空令諸眾生如言而作通達一切諸法義故五者行不空令無邊世界皆清淨故六者親近不空於不可說不可說佛剎諸如來所斷不可說不可說眾生疑故七者願不空隨所念眾生令作勝供養成就諸願故八者善巧法不空皆令得住無礙解脫清淨智故九者雨法雨不空於不可說不可說諸根眾生中方便開示一切智行令住佛道故十者出現不空現無邊相令一切眾生皆蒙照故佛子菩薩摩訶薩住此三昧得十種不空時諸天王眾皆來頂禮諸龍王眾興大香雲諸夜叉王頂禮其足阿脩羅王恭敬供養迦樓羅王前後圍遶諸梵天王悉來勸請緊那羅王摩睺羅伽王咸共稱讚乾闥婆王常來親近諸人王眾承事供養佛子是為菩薩摩訶薩第六智光明藏大三昧善巧智。",
    "X04n0223_069:0468a02_0": "【論】第六智光明藏三昧者明此菩薩能知未來一切諸劫中所有諸佛若已說法若未說法皆悉能知故智光明藏者不離一念含三世劫智名之為藏餘義如文自具於中八部王等名依初會已釋名此不表法但以供養恭敬法故親近如來。",
    "X04n0223_069:0468a07_0-0": "【經】佛子云何為菩薩摩訶薩了知一切世界佛莊嚴三昧佛子此三昧何故名了知一切世界佛莊嚴佛子菩薩摩訶薩住此三昧能次第入東方世界能次第入南方世界西方北方四維上下所有世界悉亦如是能次第入皆見諸佛出興於世亦見彼佛一切神力亦見諸佛所有遊戲亦見諸佛廣大威德亦見諸佛最勝自在亦見諸佛大師子吼亦見諸佛所修諸行亦見諸佛種種莊嚴亦見諸佛神足變化亦見諸佛眾會雲集眾會清淨眾會廣大眾會一相眾會多相眾會處所眾會居止眾會成熟眾會調伏眾會威德如是一切悉皆明見亦見眾會其量大小等閻浮提亦見眾會等四天下亦見眾會等小千界亦見眾會等中千界亦見眾會量等三千大千世界亦見眾會充滿百千億那由他佛剎亦見眾會充滿阿僧祇佛剎亦見眾會充滿百佛剎微塵數佛剎亦見眾會充滿千佛剎微塵數佛剎亦見眾會充滿百千億那由他佛剎微塵數佛剎亦見眾會充滿無數佛剎微塵數佛剎亦見眾會充滿無量佛剎微塵數佛剎亦見眾會充滿無邊佛剎微塵數佛剎亦見眾會充滿無等佛剎微塵數佛剎亦見眾會充滿不可數佛剎微塵數佛剎亦見眾會充滿不可稱佛剎微塵數佛剎亦見眾會充滿不可思佛剎微塵數佛剎亦見眾會充滿不可量佛剎微塵數佛剎亦見眾會充滿不可說佛剎微塵數佛剎亦見眾會充滿不可說不可說佛剎微塵數佛剎亦見諸佛於彼眾會道場中示現種種相種種時種種國土種種變化種種神通種種莊嚴種種自在種種形量種種事業菩薩摩訶薩亦見自身往彼眾會亦自見身在彼說法亦自見身受持佛語亦自見身善知緣起亦自見身住在虗空亦自見身住於法身亦自見身不生染著亦自見身不住分別亦自見身無有疲倦亦自見身普入諸智亦自見身普知諸義亦自見身普入諸地亦自見身普入諸趣亦自見身普知方便亦自見身普住佛前亦自見身普入諸力亦自見身普入真如亦自見身普入無諍亦自見身普入諸法如是見時不分別國土不分別眾生不分別佛不分別法不執著身不執著身業不執著心不執著意譬如諸法不分別自性不分別音聲而自性不捨名字不滅菩薩摩訶薩亦復如是不捨於行隨世所作而於此二無所執著佛子菩薩摩訶薩見佛無量光色無量形相圓滿成就平等清淨一一現前分明證了或見佛身種種光明或見佛身圓光一尋或見佛身如盛日色或見佛身微妙光色或見佛身作清淨色或見佛身作黃金色或見佛身作金剛色或見佛身作紺青色或見佛身作無邊色或見佛身作大青摩尼寶色或見佛身其量七肘或見佛身其量八肘或見佛身其量九肘或見佛身其量十肘或見佛身二十肘量或見佛身三十肘量如是乃至一百肘量一千肘量或見佛身一俱盧舍量或見佛身半由旬量或見佛身一由旬量或見佛身十由旬量或見佛身百由旬量或見佛身千由旬量或見佛身百千由旬量或見佛身閻浮提量或見佛身四天下量或見佛身小千界量或見佛身中千界量或見佛身大千界量或見佛身百大千世界量或見佛身千大千世界量或見佛身百千大千世界量或見佛身百千億那由他大千世界量或見佛身無數大千世界量或見佛身無量大千世界量或見佛身無邊大千世界量或見佛身無等大千世界量或見佛身不可數大千世界量或見佛身不可稱大千世界量或見佛身不可思大千世界量或見佛身不可量大千世界量或見佛身不可說大千世界量或見佛身不可說不可說大千世界量佛子菩薩如是見諸如來無量色相無量形狀無量示現無量光明無量光明網其光分量等于法界於法界中無所不照普令發起無上智慧又見佛身無有染著無有障礙上妙清淨佛子菩薩如是見於佛身而如來身不增不減譬如虗空於蟲所食芥子孔中亦不減小於無數世界中亦不增廣其諸佛身亦復如是見大之時亦無所增見小之時亦無所減佛子譬如月輪閻浮提人見其形小而亦不減月中住者見其形大而亦不增菩薩摩訶薩亦復如是住此三昧隨其心樂見諸佛身種種化相言辭演法受持不忘而如來身不增不減佛子譬如眾生命終之後將受生時不離於心所見清淨菩薩摩訶薩亦復如是不離於此甚深三昧所見清淨佛子菩薩摩訶薩住此三昧成就十種速疾法何者為十所謂速增諸行圓滿大願速以法光照耀世間速以方便轉於法輪度脫眾生速隨眾生業示現諸佛清淨國土速以平等智趣入十力速與一切如來同住速以大慈力摧破魔軍速斷眾生疑令生歡喜速隨勝解示現神變速以種種妙法言辭淨諸世間佛子此菩薩摩訶薩復得十種法印印一切法何等為十一者同去來今一切諸佛平等善根二者同諸如來得無邊際智慧法身三者同諸如來住不二法四者同諸如來觀察三世無量境界皆悉平等五者同諸如來得了達法界無礙境界六者同諸如來成就十力所行無礙七者同諸如來永絕二行住無諍法八者同諸如來教化眾生恒不止息九者同諸如來於智善巧義善巧中能善觀察十者同諸如來與一切佛平等無二佛子若菩薩摩訶薩成就此了知一切世界佛莊嚴大三昧善巧方便門是無師者不由他教自入一切佛法故是丈夫者能開悟一切眾生故是清淨者知心性本淨故是第一者能度脫一切世間故是安慰者能開曉一切眾生故是安住者未住佛種性者令得住故是真實知者入一切智門故是無異想者所言無二故是住法藏者誓願了知一切佛法故是能雨法雨者隨眾生心樂悉令充足故佛子譬如帝釋於頂髻中置摩尼寶以寶力故威光轉盛其釋天王初獲此寶則得十法出過一切三十三天何等為十一者色相二者形體三者示現四者眷屬五者資具六者音聲七者神通八者自在九者慧解十者智用如是十種悉過一切三十三天菩薩摩訶薩亦復如是初始獲得此三昧時則得十種廣大智藏何等為十一者照耀一切佛剎智二者知一切眾生受生智三者普作三世變化智四者普入一切佛身智五者通達一切佛法智六者普攝一切淨法智七者普令一切眾生入法身智八者現見一切法普眼清淨智九者一切自在到於彼岸智十者安住一切廣大法普盡無餘智佛子菩薩摩訶薩住此三昧復得十種最清淨威德身何等為十一者為照耀不可說不可說世界故放不可說不可說光明輪二者為令世界咸清淨故放不可說不可說無量色相光明輪三者為調伏眾生故放不可說不可說光明輪四者為親近一切諸佛故化作不可說不可說身五者為承事供養一切諸佛故雨不可說不可說種種殊妙香華雲六者為承事供養一切佛及調伏一切眾生故於一一毛孔中化作不可說不可說種種音樂七者為成熟眾生故現不可說不可說種種無量自在神變八者為於十方種種名號一切佛所請問法故一步超過不可說不可說世界九者為令一切眾生見聞之者皆不空故現不可說不可說種種無量清淨色相身無能見頂十者為與眾生開示無量祕密法故發不可說不可說音聲語言佛子菩薩摩訶薩得此十種最清淨威德身已能令眾生得十種圓滿何等為十一者能令眾生得見於佛二者能令眾生深信於佛三者能令眾生聽聞於法四者能令眾生知有佛世界五者能令眾生見佛神變六者能令眾生念所集業七者能令眾生定心圓滿八者能令眾生入佛清淨九者能令眾生發菩提心十者能令眾生圓滿佛智佛子菩薩摩訶薩令眾生得十種圓滿已復為眾生作十種佛事何等為十所謂以音聲作佛事為成熟眾生故以色形作佛事為調伏眾生故以憶念作佛事為清淨眾生故以震動世界作佛事為令眾生離惡趣故以方便覺悟作佛事為令眾生不失念故以夢中現相作佛事為令眾生恒正念故以放大光明作佛事為普攝取諸眾生故以修菩薩行作佛事為令眾生住勝願故以成正等覺作佛事為令眾生知幻法故以轉妙法輪作佛事為眾說法不失時故以現住壽命作佛事為調伏一切眾生故以示般涅槃作佛事知諸眾生起疲厭故佛子是為菩薩摩訶薩第七了知一切世界佛莊嚴大三昧善巧智。",
    "X04n0223_069:0470a03_0": "【論】第七了知一切世界佛莊嚴三昧者明此菩薩能徧入十方一切世界見一切諸佛所有教化莊嚴悉能見盡及承事供養及所聞法普入諸趣等總盡故因立名也於中文義經自具明。",
    "X04n0223_069:0470a07_0-0": "【經】佛子云何為菩薩摩訶薩一切眾生差別身三昧佛子菩薩摩訶薩住此三昧得十種無所著何者為十所謂於一切剎無所著於一切方無所著於一切劫無所著於一切眾無所著於一切法無所著於一切菩薩無所著於一切菩薩願無所著於一切三昧無所著於一切佛無所著於一切地無所著是為十佛子菩薩摩訶薩於此三昧云何入云何起佛子菩薩摩訶薩於此三昧內身入外身起外身入內身起同身入異身起異身入同身起人身入夜叉身起夜叉身入龍身起龍身入阿脩羅身起阿脩羅身入天身起天身入梵王身起梵王身入欲界身起天中入地獄起地獄入人間起人間入餘趣起千身入一身起一身入千身起那由他身入一身起一身入那由他身起閻浮提眾生眾中入西瞿陀尼眾生眾中起西瞿陀尼眾生眾中入北拘盧眾生眾中起北拘盧眾生眾中入東毗提訶眾生眾中起東毗提訶眾生眾中入三天下眾生眾中起三天下眾生眾中入四天下眾生眾中起四天下眾生眾中入一切海差別眾生眾中起一切海差別眾生眾中入一切海神眾中起一切海神眾中入一切海水大中起一切海水大中入一切海地大中起一切海地大中入一切海火大中起一切海火大中入一切海風大中起一切海風大中入一切四大種中起一切四大種中入無生法中起無生法中入妙高山中起妙高山中入七寶山中起七寶山中入一切地種種稼穡樹林黑山中起一切地種種稼穡樹林黑山中入一切妙香華寶莊報中起一切妙香華寶莊嚴中入一切四天下下方上方一切眾生受生中起一切四天下下方上方一切眾生受生中入小千世界眾生眾中起小千世界眾生眾中入中千世界眾生眾中起中千世界眾生眾中入大千世界眾生眾中起大千世界眾生眾中入百千億那由他三千大千世界眾生眾中起百千億那由他三千大千世界眾生眾中入無數世界眾生眾中起無數世界眾生眾中入無量世界眾生眾中起無量世界眾生眾中入無邊佛剎眾生眾中起無邊佛剎眾生眾中入無等佛剎眾生眾中起無等佛剎眾生眾中入不可數世界眾生眾中起不可數世界眾生眾中入不可種世界眾生眾中起不可種世界眾生眾中入不可思世界眾生眾中起不可思世界眾生眾中入不可量世界眾生眾中起不可量世界眾生眾中入不可說世界眾生眾中起不可說世界眾生眾中入不可說不可說世界眾生眾中起不可說不可說世界眾生眾中入雜染眾生眾中起雜染眾生眾中入清淨眾生眾中起清淨眾生眾中入雜染眾生眾中起眼處入耳處起耳處入眼處起鼻處入舌處起舌處入鼻處起身處入意處起意處入身處起自處入他處起他處入自處起一微塵中入無數世界微塵中起無數世界微塵中入一微塵中起聲聞入獨覺起獨覺入聲聞起自身入佛身起佛身入自身起一念入億劫起億劫入一念起同念入別時起別時入同念起前際入後際起後際入前際起前際入中際起中際入前際起三世入剎那起剎那入三世起真如入言說起言說入真如起佛子譬如有人為鬼所持其身戰動不能自安鬼不現身令他身然菩薩摩訶薩住此三昧亦復如是自身入定他身起他身入定自身起佛子譬如死屍以呪力故而能起行隨所作事皆得成就屍之與呪雖各差別而能和合成就彼事菩薩摩訶薩住此三昧亦復如是同境入定異境起異境入定同境起佛子譬如比丘得心自在或以一身作多身或以多身作一身非一身沒多身生非多身沒一身生菩薩摩訶薩住此三昧亦復如是一身入定多身起多身入定一身起佛子譬如大地其味一種所生苗稼種種味別地雖無差別然味有殊異菩薩摩訶薩住此三昧亦復如是無所分別然有一種入定多種起多種入定一種起佛子菩薩摩訶薩住此三昧得十種稱讚法之所稱讚何者為十所謂入真如故名為如來覺一切法故名之為佛為一切世間所稱讚故名為法師知一切法故名一切智為一切世間所歸依故名所依處了達一切法方便故名為導師引一切眾生入薩婆若道故名大導師為一切世間燈故名為光明心志圓滿義利成就所作皆辦住無礙智分別了知一切諸法故名為十力自在通達一切法輪故名一切見者是為十佛子菩薩摩訶薩住此三昧復得十種光明照耀何者為十所謂得一切諸佛光明與彼平等故得一切世界光明普能嚴淨故得一切眾生光明悉往調伏故得無量無畏光明法界為場演說故得無差別光明知一切法無種種性故得方便光明於一切法離欲際而證入故得真實光明於一切法離欲際心平等故得徧一切世間神變光明蒙佛所加恒不息故得善思惟光明到一切佛自在岸故得一切法真如光明於一毛孔中善說一切故是為十佛子菩薩摩訶薩住此三昧復得十種無所作何者為十所謂身業無所作語業無所作意業無所作神通無所作了法無性無所作知業不壞無所作無差別智無所作無生起智無所作知法無滅無所作隨順於文不壞於義無所作是為十佛子菩薩摩訶薩住此三昧無量境界種種差別所謂一入多起多入一起同入異起異入同起細入麤起麤入細起大入小起小入大起順入逆起逆入順起無身入有身起有身入無身起無相入有相起有相入無相起起中入入中起如是皆是此之三昧自在境界佛子譬如幻師持呪得成能現種種差別形相呪與幻別而能作幻呪唯是聲而能幻作眼識所知種種諸色耳識所知種種諸聲鼻識所知種種諸香舌識所知種種諸味身識所知種種諸觸意識所知種種境界菩薩摩訶薩住此三昧亦復如是同中入定異中起異中入定同中起佛子譬如三十三天共阿脩羅聞戰之時諸天得勝脩羅退衂阿脩羅王其身長大七百由旬四兵圍遶無數千萬以幻術力將諸軍眾同時走入藕絲孔中菩薩摩訶薩亦復如是已善成就諸幻智地幻智即是菩薩菩薩即是幻智是故能於無差別法中入定差別法中起差別法中入定無差別法中起佛子譬如農夫田中下種種子在下果生於上菩薩摩訶薩住此三昧亦復如是一中入定多中起多中入定一中起佛子譬如男女赤白和合或有眾生於中受生爾時名為歌羅邏位從此次第住母胎中滿足十月善業力故一切肢分皆得成就諸根不缺心意明了其歌羅邏與彼六根體狀各別以業力故而能令彼次第成就受同異類種種果報菩薩摩訶薩亦復如是從一切智歌羅邏位信解願力漸次增長其心廣大任運自在無中入定有中起有中入定無中起佛子譬如龍宮依地而立不依虗空龍依宮住亦不在空而能興雲徧滿空中有人仰視所見宮殿當知皆是乾闥婆城非是龍宮佛子龍雖處下而雲布上菩薩摩訶薩住此三昧亦復如是於無相入有相起於有相入無相起佛子譬如妙光大梵天王所住之宮名一切世間最勝清淨藏此大宮中普見三千大千世界諸四天下天宮龍宮夜叉宮乾闥婆宮阿脩羅宮迦樓羅宮緊那羅宮摩睺羅伽宮人間住處及三惡道須彌山等種種諸山大海江河陂澤泉源城邑聚落樹林眾寶如是一切種種莊嚴盡大輪圍所有邊際乃至空中微細遊塵莫不皆於梵宮顯現如於明鏡見其面像菩薩摩訶薩住此一切眾生差別身大三昧知種種剎見種種佛度種種眾證種種法成種種行滿種種解入種種三昧起種種神通得種種智慧住種種剎那際佛子此菩薩摩訶薩到十種神通彼岸何者為十所謂到諸佛盡虗空徧法界神通彼岸到菩薩究竟無差別自在神通彼岸到能發起菩薩廣大行願入如來門佛事神通彼岸到能震動一切世界一切境界悉令清淨神通彼岸到能自在知一切眾生不思議業果皆如幻化神通彼岸到能自在知諸三昧麤細入出差別相神通彼岸到能勇猛入如來境界而於其中發生大願神通彼岸到能化作佛化轉法輪調伏眾生令生佛種令入佛乘速得成就神通彼岸到能了知不可說一切祕密文句而轉法輪令百千億那由他不可說不可說法門皆得清淨神通彼岸到不假晝夜年月劫數一念悉能三世示現神通彼岸是為十佛子是名菩薩摩訶薩第八一切眾生差別身大三昧善巧智。",
    "X04n0223_069:0472a04_0": "【論】第八一切眾生差別身三昧者明入此三昧能現佛身等眾生差別身皆隨其類現故立其名也又能入同異順逆三昧故以立其名餘義如文自具。",
    "X04n0223_069:0472a09_0": "大方廣佛新華嚴經合論卷第六十九",
    "X04n0223_069:0472a11_0": "音切",
    "X04n0223_069:0472a12_0": "關(古還切)。",
    "X04n0223_069:0472a12_1": "鑰(以灼切)。",
    "X04n0223_069:0472a12_2": "淤(依倨切)。",
    "X04n0223_069:0472a12_3": "紺(古暗切)。",
    "X04n0223_069:0472a12_4": "肘(陟九切)。",
    "X04n0223_069:0472a12_5": "疲(皮音)。",
    "X04n0223_069:0472a12_6": "藕(禺苟切)。",
    "X04n0223_069:0472a13_7": "瞿(其俱切)。",
    "X04n0223_069:0472a13_8": "農(奴冬切)。",
    "X04n0223_069:0472a13_9": "穡(所力切)。",
    "X04n0223_069:0472a13_10": "衂(尼六切)。",
    "X04n0223_069:0472a13_11": "陂(彼為切)。"
}