{
    "X04n0223_116:0760b04_0": "大方廣佛新華嚴經合論卷第一百十六唐于闐國三藏沙門實叉難陀譯經唐太原方山長者李通玄造論唐福州開元寺沙門志寧釐經合論入法界品第三十九之二十九【論】從此十一地已後會慈氏一生所得佛果門於此門中長科為十段。",
    "X04n0223_116:0760b11_0": "【經】善男子於此南方有國名海岸有園名大莊嚴其中有一廣大樓閣名毗盧遮那莊嚴藏從菩薩善根果報生從菩薩念力願力自在力神通力生從菩薩善巧方便生從菩薩福德智慧生善男子住不思議解脫菩薩以大悲心為諸眾生現如是境界集如是莊嚴彌勒菩薩摩訶薩安處其中為欲攝受本所生處父母眷屬及諸人民令成熟故又欲令彼同受生同修行眾生於大乘中得堅固故又欲令彼一切眾生隨住地隨善根皆成就故又欲為汝顯示菩薩解脫門故顯示菩薩徧一切處受生自在故顯示菩薩以種種身普現一切眾生之前常教化故顯示菩薩以大悲力普攝一切世間資財而不厭故顯示菩薩具修諸行知一切行離諸相故顯示菩薩處處受生了一切生皆無相故汝詣彼問菩薩云何行菩薩行云何修菩薩道云何學菩薩戒云何淨菩薩心云何發菩薩願云何習菩薩助道具云何入菩薩所住地云何滿菩薩波羅蜜云何獲菩薩無生忍云何具菩薩功德法云何事菩薩善知識何以故善男子彼菩薩摩訶薩通達一切菩薩行了知一切眾生心常現其前教化調伏彼菩薩已滿一切波羅蜜已住一切菩薩地已證一切菩薩忍已入一切菩薩位已蒙授與具足記已遊一切菩薩境已得一切佛神力已蒙一切如來以一切智甘露法水而灌其頂善男子彼善知識能潤澤汝諸善根能增長汝菩提心能堅汝志能益汝善能長汝菩薩根能示汝無礙法能令汝入普賢地能為汝說菩薩願能為汝說普賢行能為汝說一切菩薩行願所成功德善男子汝不應修一善照一法行一行發一願得一記住一忍生究竟想不應以限量心行於六度住於十地淨佛國土事善知識何以故善男子菩薩摩訶薩應種無量諸善根應集無量菩提具應修無量菩提因應學無量巧迴向應化無量眾生界應知無量眾生心應知無量眾生根應識無量眾生解應觀無量眾生行應調伏無量眾生應斷無量煩惱應淨無量業習應滅無量邪見應除無量雜染心應發無量清淨心應拔無量苦毒箭應涸無量愛欲海應破無量無明暗應摧無量我慢山應斷無量生死縛應度無量諸有流應竭無量受生海應令無量眾生出五欲淤泥應使無量眾生離三界牢獄應置無量眾生於聖道中應銷滅無量貪欲行應淨治無量瞋恚行應摧破無量愚癡行應超無量魔網應離無量魔業應淨治菩薩無量欲樂應增長菩薩無量方便應出生菩薩無量增上根應明潔菩薩無量決定解應趣入菩薩無量平等應清淨菩薩無量功德應修治菩薩無量諸行應示現菩薩無量隨順世間行應生無量淨信力應住無量精進力應淨無量正念力應滿無量三昧力應起無量淨慧力應堅無量勝解力應集無量福德力應長無量智慧力應發起無量菩薩力應圓滿無量如來力應分別無量法門應了知無量法門應清淨無量法門應生無量法光明應作無量法照曜應照無量品類根應知無量煩惱病應集無量妙法藥應療無量眾生疾應嚴辦無量甘露供應往詣無量佛國土應供養無量諸如來應入無量菩薩會應受無量諸佛教應忍無量眾生罪應滅無量惡道難應令無量眾生生善道應以四攝攝無量眾生應修無量總持門應生無量大願門應修無量大悲大願力應勤求無量法常無休息應起無量思惟力應起無量神通事應淨無量智光明應往無量眾生趣應受無量諸有生應現無量差別身應知無量言辭法應入無量差別心應知菩薩大境界應住菩薩大宮殿應觀菩薩甚深妙法應知菩薩難知境界應行菩薩難行諸行應具菩薩尊重威德應踐菩薩難入正位應知菩薩種種諸行應現菩薩普徧神力應受菩薩平等法雲應廣菩薩無邊行網應滿菩薩無邊諸度應受菩薩無量記莂應入菩薩無量忍門應治菩薩無量諸地應淨菩薩無量法門應同諸菩薩安住無邊劫供養無量佛嚴淨不可說佛國土出生不可說菩薩願善男子舉要言之應普修一切菩薩行應普化一切眾生界應普入一切劫應普生一切處應普知一切世應普行一切法應普淨一切剎應普滿一切願應普供一切佛應普同一切菩薩願應普事一切善知識善男子汝求善知識不應疲倦見善知識勿生厭足請問善知識勿憚勞苦親近善知識勿懷退轉供養善知識不應休息受善知識教不應倒錯學善知識行不應疑惑聞善知識演說出離門不應猶豫見善知識隨順煩惱行勿生嫌怪於善知識所生深信尊敬心不應變改何以故善男子菩薩因善知識聽聞一切菩薩諸行成就一切菩薩功德出生一切菩薩大願引發一切菩薩善根積集一切菩薩助道開發一切菩薩法光明顯示一切菩薩出離門修學一切菩薩清淨戒安住一切菩薩功德法清淨一切菩薩廣大志增長一切菩薩堅固心具足一切菩薩陀羅尼辯才門得一切菩薩清淨藏生一切菩薩定光明得一切菩薩殊勝願與一切菩薩同一願聞一切菩薩殊勝法得一切菩薩祕密處至一切菩薩法寶洲增一切菩薩善根芽長一切菩薩智慧身護一切菩薩深密藏持一切菩薩福德聚淨一切菩薩受生道受一切菩薩正法雲入一切菩薩大願路趣一切如來菩提果攝取一切菩薩妙行開示一切菩薩功德往一切方聽受妙法讚一切菩薩廣大威德生一切菩薩大慈悲力攝一切菩薩勝自在力生一切菩薩菩提分作一切菩薩利益事善男子菩薩由善知識任持不墮惡趣由善知識攝受不退大乘由善知識護念不毀犯菩薩戒由善知識守護不隨逐惡知識由善知識養育不缺減菩薩法由善知識攝取超越凡夫地由善知識教誨超越二乘地由善知識示導得出離世間由善知識長養能不染世法由承事善知識修一切菩薩行由供養善知識具一切助道法由親近善知識不為業惑之所摧伏由恃怙善知識勢力堅固不怖諸魔由依止善知識增長一切菩提分法何以故善男子善知識者能淨諸障能滅諸罪能除諸難能止諸惡能破無明長夜黑暗能壞諸見堅固牢獄能出生死城能捨世俗家能截諸魔網能拔眾苦箭能離無智險難處能出邪見大曠野能度諸有流能離諸邪道能示菩提路能教菩薩法能令安住菩薩行能令趣向一切智能淨智慧眼能長菩提心能生大悲能演妙行能說波羅蜜能擯惡知識能令住諸地能令獲諸忍能令修習一切善根能令成辦一切道具能施與一切大功德能令到一切種智位能令歡喜集功德能令踊躍修諸行能令趣入甚深義能令開示出離門能令杜絕諸惡道能令以法光照曜能令以法雨潤澤能令銷滅一切惑能令捨離一切見能令增長一切佛智慧能令安住一切佛法門善男子善知識者如慈母出生佛種故如慈父廣大利益故如乳母守護不令作惡故如教師示其菩薩所學故如善導能示波羅蜜道故如良醫能治煩惱諸病故如雪山增長一切智藥故如勇將殄除一切怖畏故如濟客令出生死瀑流故如船師令到智慧寶洲故善男子常當如是正念思惟諸善知識復次善男子汝承事一切善知識應發如大地心荷負重任無疲倦故應發如金剛心志願堅固不可壞故應發如鐵圍山心一切諸苦無能動故應發如給侍心所有教令皆隨順故應發如弟子心所有訓誨無違逆故應發如僮[仁二+業]心不厭一切諸作務故應發如養母心受諸勤苦不告勞故應發如傭作心隨所受教無違逆故應發如除糞人心離憍慢故應發如已熟稼心能低下故應發如良馬心離惡性故應發如大車心能運重故應發如調順象心恒伏從故應發如須彌山心不傾動故應發如良犬心不害主故應發如旃茶羅心離憍慢故應發如犗牛心無威怒故應發如舟船心往來不倦故應發如橋梁心濟渡忘疲故應發如孝子心承順顏色故應發如王子心遵行教命故復次善男子汝應於自身生病苦想於善知識生醫王想於所說法生良藥想於所修行生除病想又應於自身生遠行想於善知識生導師想於所說法生正道想於所修行生遠達想又應於自身生求度想於善知識生船師想於所說法生舟檝想於所修行生到岸想又應於自身生苗稼想於善知識生龍王想於所說法生時雨想於所修行生成熟想又應於自身生貧窮想於善知識生毗沙門王想於所說法生財寶想於所修行生富饒想又應於自身生弟子想於善知識生良工想於所說法生技藝想於所修行生了知想又應於自身生恐怖想於善知識生勇健想於所說法生器仗想於所修行生破怨想又應於自身生商人想於善知識生導師想於所說法生珍寶想於所修行生捃拾想又應於自身生兒子想於善知識生父母想於所說法生家業想於所修行生紹繼想又應於自身生王子想於善知識生大臣想於所說法生王教想於所修行生冠王冠想服王服想繫王繒想坐王殿想善男子汝應發如是心作如是意近善知識何以故以如是心近善知識令其志願永得清淨復次善男子善知識者長諸善根譬如雪山長諸藥艸善知識者是佛法器譬如大海吞納眾流善知識者是功德處譬如大海出生眾寶善知識者淨菩提心譬如猛火能鍊真金善知識者出過世法如須彌山出於大海善知識者不染世法譬如蓮華不著於水善知識者不受諸惡譬如大海不宿死屍善知識者增長白法譬如白月光色圓滿善知識者照明法界譬如盛日照四天下善知識者長菩薩身譬如父母養育兒子善男子以要言之菩薩摩訶薩若能隨順善知識教得十不可說百千億那由他功德淨十不可說百千億那由他深心長十不可說百千億那由他菩薩根淨十不可說百千億那由他菩薩力斷十不可說百千億阿僧祇障超十不可說百千億阿僧祇魔境入十不可說百千億阿僧祇法門滿十不可說百千億阿僧祇助道修十不可說百千億阿僧祇妙行發十不可說百千億阿僧祇大願善男子我復略說一切菩薩行一切菩薩波羅蜜一切菩薩地一切菩薩忍一切菩薩總持門一切菩薩三昧門一切菩薩神通智一切菩薩迴向一切菩薩願一切菩薩成就佛法皆由善知識力以善知識而為根本依善知識生依善知識出依善知識長依善知識住善知識為因緣善知識能發起時善財童子聞善知識如是功德能開示無量菩薩妙行能成就無量廣大佛法踊躍歡喜頂禮德生及有德足遶無量帀殷勤瞻仰辭退而去。",
    "X04n0223_116:0762c19_0": "【論】第一善男子從此南方有國土名為海岸已下至辭退而去可有半卷經明德生童子有德童女推慈氏菩薩之德令善財童子親近升進分從善男子南方有國土名為海岸者明升進至慈氏一生佛果故名為海岸入佛智海臨生死海故亦以此國臨海而居故有園林名大莊嚴者約慈氏所居以生死為園萬行為林莊嚴自己智悲佛果已皆滿足名大莊嚴其中有一廣大樓閣名毗盧遮那莊嚴藏者明根本智差別智總體報生以立名故毗云種種光明遮那云徧照以差別智為種種光明以根本智為徧照此二智約用成名其體用一也總無作者以此法界體用普光明智成諸萬行廣利含生報生故此大莊嚴樓閣廣大量等虗空一切世間及以眾生咸處其內同住遊止不覺不知如善財童子入此樓閣中見淨世界不淨世界大千世界小千世界乃至地獄畜生餓鬼所住乃至十方世界有佛世界無佛世界菩薩眾會種種等事咸在其中廣如經說以佛智海大悲含物萬行利生大願所持共成樓閣之體止住一切眾生生死園中以萬行林覆蔭含識皆令永得白淨法身無垢淨智清涼之樂經云從菩薩善根果報生從善巧方便生從福德智慧生生無來處滅無去處皆是如幻智住生滅之相還如眾生以業生滅無有來去體相可得取捨無有忻厭經云善男子住不思議解脫菩薩以大悲心為諸眾生現如是境界集如是莊嚴彌勒菩薩安處其中已下廣如經說從此第一段中復分為五段一善男子於此南方有國土名為海岸已下至云何事菩薩善知識有二十行半經明示善友所在及勸往詣其所諮問法門分二何以故善男子彼菩薩摩訶薩已下至住於十地淨佛國土事善知識有十四行經明德生童子歎慈氏德令善財親近承事分三何以故善男子菩薩應種無量諸善根已下至應普事一切善知識有四十九行半經明德生童子教善財童子所應學應行廣大之法分四善男子汝求善知識不應疲倦已下至增長一切菩提法分有三十四行經明德生童子教善財童子事善知識不觀過失不應疲倦由善知識獲無量利益分五何以故善男子善知識者能淨諸障已下至辭退而去有八十九行經明德生童子教恭敬善知識法及由善知識成就廣大佛法分如經云不應以限量心行於六度住於十地淨佛國土事善知識者明六度十地皆是出世一分淨見未亡以此障故未具普賢行不同毗盧遮那如來報身因果境界但得同於出世化佛化身以毗盧遮那報相果海功德身具華冠纓絡環釧眾相福海嚴身非是出纏捨諸飾好厭生死身故是達無明本元法界大智之境自具無邊功德報身又加普賢行願海差別智所成無限功德互為莊嚴功德報身故是故十一地滿德生童子教善財童子入法界門會根本果體不隨引俗化境住於淨見限量行門餘如經具明如化佛之境是出世之門云有他方別分淨土報佛以十方總為一淨土不分淨穢。",
    "X04n0223_116:0763b24_0": "【經】爾時善財童子聞善知識教潤澤其心正念思惟諸菩薩行向海岸國自憶往世不修禮敬即時發意勤力而行復憶往世身心不淨即時發意專自治潔復憶往世作諸惡業即時發意專自防斷復憶往世起諸妄想即時發意恒正思惟復憶往世所修諸行但為自身即時發意令心廣大普及含識復憶往世追求欲境常自捐耗無有滋味即時發意修行佛法長養諸根以自安隱復憶往世起邪思念顛倒相應即時發意生正見心起菩薩願復憶往世日夜劬勞作諸惡事即時發意起大精進成就佛法復憶往世受五趣生於自他身皆無利益即時發意願以其身饒益眾生成就佛法承事一切諸善知識如是思惟生大歡喜復觀此身是生老病死眾苦之宅願盡未來劫修菩薩道教化眾生見諸如來成就佛法遊行一切佛剎承事一切法師住持一切佛教尋求一切法侶見一切善知識習一切諸佛法與一切菩薩願智身而作因緣作是念時長不思議無量善根即於一切菩薩深信尊重生希有想生大師想諸根清淨善法增益起一切菩薩恭敬供養作一切菩薩曲躬合掌生一切菩薩普見世間眼起一切菩薩普念眾生想現一切菩薩無量願化身出一切菩薩清淨讚說音想見過現一切諸佛及諸菩薩於一切處示現成道神通變化乃至無有一毛端處而不周徧又得清淨智光明眼見一切菩薩所行境界其心普入十方剎網其願普徧虗空法界三世平等無有休息如是一切皆以信受善知識教之所致耳。",
    "X04n0223_116:0764a02_0": "【論】第二爾時善財童子蒙善知識教潤澤其心已下至皆以信受善知識教之所致耳有三十行經明善財童子自念往因過惡不善自慚愧悔恨起恭敬供養親近善知識分如文自明。",
    "X04n0223_116:0764a06_0": "【經】善財童子以如是尊重如是供養如是稱讚如是觀察如是願力如是想念如是無量智慧境界於毗盧遮那莊嚴藏大樓閣前五體投地暫時斂念思惟觀察以深信解大願力故入徧一切處智慧身平等門普現其身在於一切如來前一切菩薩前一切善知識前一切如來塔廟前一切如來形像前一切諸佛諸菩薩住處前一切法寶前一切聲聞辟支佛及其塔廟前一切聖眾福田前一切父母尊者前一切十方眾生前皆如上說尊重禮讚盡未來際無有休息等虗空無邊量故等法界無障礙故等實際徧一切故等如來無分別故猶如影隨智現故猶如夢從思起故猶如像示一切故猶如響緣所發故無有生遞與謝故無有性隨緣轉故又決定知一切諸報皆從業起一切諸果皆從因起一切諸業皆從習起一切佛興皆從信起一切化現諸供養事皆悉從於決定解起一切化佛從敬心起一切佛法從善根起一切化身從方便起一切佛事從大願起一切菩薩所修諸行從迴向起一切法界廣大莊嚴從一切智境界而起離於斷見知迴向故離於常見知無生故離無因見知正因故離顛倒見知如實理故離自在見知不由他故離自他見知從緣起故離邊執見知法界無邊故離往來見知如影像故離有無見知不生滅故離一切法見知空無生故知不自在故知願力出生故離一切相見入無相際故知一切法如種生芽故如印生文故知質如像故知聲如響故知境如夢故知業如幻故了世心現故了果因起故了報業習故了知一切諸功德法皆從菩薩善巧方便所流出故。",
    "X04n0223_116:0764b10_0": "【論】第三善財童子以如是尊重如是供養已下至皆從菩薩善巧方便所流出故有三十二行經明善財童子於樓閣前五體投地暫時斂念思惟獲益無量分如文具明。",
    "X04n0223_116:0764b14_0": "【經】善財童子入如是智端心潔念於樓觀前舉體投地殷勤頂禮不思議善根流注身心清涼悅澤從地而起一心瞻仰目不暫捨合掌圍遶經無量帀作是念言此大樓閣是解空無相無願者之所住處是於一切法無分別者之所住處是了法界無差別者之所住處是知一切眾生不可得者之所住處是知一切法無生者之所住處是不著一切世間者之所住處是不著一切窟宅者之所住處是不樂一切聚落者之所住處是不依一切境界者之所住處是離一切想者之所住處是知一切法無自性者之所住處是斷一切分別業者之所住處是離一切想心意識者之所住處是不入不出一切道者之所住處是入一切甚深般若波羅蜜者之所住處是能以方便住普門法界者之所住處是息滅一切煩惱火者之所住處是以增上慧除斷一切見愛慢者之所住處是出生一切諸禪解脫三昧通明而遊戲者之所住處是觀察一切菩薩三昧境界者之所住處是安住一切如來所者之所住處是以一劫入一切劫以一切劫入一劫而不壞其相者之所住處是以一剎入一切剎以一切剎入一剎而不壞其相者之所住處是以一法入一切法以一切法入一法而不壞其相者之所住處是以一眾生入一切眾生以一切眾生入一眾生而不壞其相者之所住處是以一佛入一切佛以一切佛入一佛而不壞其相者之所住處是於一念中而知一切三世者之所住處是於一念中往詣一切國土者之所住處是於一切眾生前悉現其身者之所住處是心常利益一切世間者之所住處是能徧至一切處者之所住處是雖已出一切世間為化眾生故而恒於中現身者之所住處是不著一切剎為供養諸佛故而遊一切剎者之所住處是不動本處能普詣一切佛剎而莊嚴者之所住處是親近一切佛而不起佛想者之所住處是依止一切善知識而不起善知識想者之所住處是住一切魔宮而不躭著欲境界者之所住處是永離一切心想者之所住處是雖於一切眾生中而現其身然於自他不生二想者之所住處是能普入一切世界而於法界無差別想者之所住處是願住未來一切劫而於諸劫無長短想者之所住處是不離一毛端處而普現身一切世界者之所住處是能演說難遭遇法者之所住處是能住難知法甚深法無二法無相法無對治法無所得法無戲論法者之所住處是住大慈大悲者之所住處是已度一切二乘智已超一切魔境界已於世法無所染已到菩薩所到岸已住如來所住處者之所住處是雖離一切諸相而亦不入聲聞正位雖了一切法無生而亦不住無生法性者之所住處是雖觀不淨而不證離貪法亦不與貪欲俱雖修於慈而不證離瞋法亦不與瞋垢俱雖觀緣起而不證離癡法亦不與癡惑俱者之所住處是雖住四禪而不隨禪生雖行四無量為化眾生故而不生色界雖修四無色定以大悲故而不住無色界者之所住處是雖勤修止觀為化眾生故而不證明脫雖行於捨而不捨化眾生事者之所住處是雖觀於空而不起空見雖行無相而常化著相眾生雖行無願而不捨菩提行願者之所住處是雖於一切業煩惱中而得自在為化眾生故而現隨順諸業煩惱雖無生死為化眾生故示受生死雖已離一切趣為化眾生故示入諸趣者之所住處是雖行於慈而於諸眾生無所愛戀雖行於悲而於諸眾生無所取著雖行於喜而觀苦眾生心常哀愍雖行於捨而不廢捨利益他事者之所住處是雖行九次第定而不厭離欲界受生雖知一切法無生無滅而不於實際作證雖入三解脫門而不取聲聞解脫雖觀四聖諦而不住小乘聖果雖觀甚深緣起而不住究竟寂滅雖修八聖道而不求永出世間雖超凡夫地而不墮聲聞辟支佛地雖觀五取蘊而不永滅諸蘊雖超出四魔而不分別諸魔雖不著六處而不永滅六處雖安住真如而不墮實際雖說一切乘而不捨大乘此大樓閣是住如是等一切諸功德者之所住處爾時善財童子而說頌曰。",
    "X04n0223_116:0765b11_0": "【論】第四善財童子入如是智端心潔念已下至善財說頌有八十行經明善財歎善知識所居樓閣分如文自明。",
    "X04n0223_116:0765b15_0": "大方廣佛新華嚴經合論卷第一百十六"
}