{
    "X04n0223_078:0525a01_0": "大方廣佛新華嚴經合論卷第七十八",
    "X04n0223_078:0525a02_0": "唐于闐國三藏沙門實叉難陀譯經",
    "X04n0223_078:0525a03_0": "唐太原方山長者李通玄造論",
    "X04n0223_078:0525a04_0": "唐福州開元寺沙門志寧釐經合論",
    "X04n0223_078:0525a05_0": "如來出現品第三十七之一",
    "X04n0223_078:0525a06_0": "【論】將釋此品約立四門一釋品名目二釋品來意三釋如來放光加文殊普賢所由四隨文釋義一釋品名目者何故名為如來出現品為從第二會普光明殿說十信心以不動智佛為初信首次無礙智佛等餘九佛是十信中進修又明一智中具十種智故隨行立名從十信中信進修行不離根本智不動智體起大悲願行修差別智成大慈悲至此位滿名為如來出現品明前初會菩提場中出現始成正覺者是毗盧遮那佛出現此品中出現是菩薩進修五位行解智悲位滿出現故名出現品亦如善財見德生童子有德童女表智悲二行滿故便見慈氏如來是表如來出現義是故如來以光加此二人問答說如來出現之門文殊表現根本智普賢是差別智成就饒益眾生之門二釋品來意者明前五位中文殊普賢及佛果三法已周此明佛果行圓滿故此品須來三釋如來放光加文殊普賢所由者明如來眉間光是佛中道佛果智光以灌文殊之頂者明佛果智德高勝為令文殊起問佛果之門如來放口中光灌普賢口者明普賢是差別智滿欲令說法故問曰何故如來不自說此品所以放光加此文殊普賢二人答曰以表法故令後學者易解故非是如來自不能說云何為表法答曰為明文殊是佛法身現根本智者普賢菩薩是佛昇進修行差別智者明至此位根本智及差別智齊滿周圓方始名為如來出現表以法身自性白淨無垢中能現自體無依明淨本智問差別智自說自己修行行解之心與古今諸佛合其智德方是自己所行覺行圓滿佛故是故如來放光加之成法則故明一切菩薩果滿功終法皆如是佛所放光許至佛位故法非謬故表明如是法身根本智差別智利生萬行齊備周圓方是自己如來出現表文殊是現根本智者普賢是說法者佛是果也思之可見大意明文殊普賢是成就佛果理智行門還令說佛出現之法佛是根本智自體無言凡是有言皆是差別智初會菩提場中毗盧遮那佛出現者明初會菩提場非是毗盧遮那如來放光成法與初發心修行者為樣式故明表法身根本智與差別利生行周圓滿故令此二人說自佛與古佛出興恰相似故如是文殊普賢是古今諸佛之共法若初發心者從初發信心已來皆悉遊履此之文殊普賢二行至此方滿故如是進修皆不離初信中不動智佛十智之體故以明時不動智不動行不動能徧遊十方不動一入多不動多入一不動小入大不動乃至如經所明為達身心理智無性無依情識繫亡法會常爾故以此五位昇進或昇天表法或身徧十方終成不離普光明殿本智之體一剎那際是故此自果已終之法還不離說信心之處普光明殿說還如善財至慈氏如來還見文殊信心初友入普賢身相似恐後學者迷法一一以善財將行表之令易解故大意依此可知又約此一部之經有三終因果二種常道一從初菩提場至毗盧遮那品有六品經是佛自分五位中因果即以十普賢海月光大明菩薩通神天等五十眾是二發信心菩薩五位通信心即六位因果者從第二會於普光明殿說佛名號品已下至第八會普光明殿如來出現品有三十二品經明菩薩發心因果一終此三十二品中第三禪佛華三昧品未來是此修行中加行之次第三自文殊師利至大塔廟說普照法界脩多羅門化善財令南求五十三勝友明以行勸修五位一終之因果為表但說教由恐在行還迷以置善財是發心能行行者五十三善知識是已行行之人一一求學昇進與後發菩提心者作五位昇進之樣令不迷其行故其中意至文方釋二種常道者如法界品離世間品於出離道常利眾生恒真法界非虗妄也常真法界是常道佛果故恒利世間利生無求自利是佛常道之普賢行也是名此經三終因果二種常道如第二會至第八會中如來出現品是明發心菩薩昇進五位一終付囑流通總在此品明此品是五位進昇果圓之末也有人於法界品終覓付囑流通此為未得經之意趣以法界品總該一部教體及以三世古今無本末時分寂用之大體非是安立加行置因果所為但以引接菩薩發心乘法界乘引接迷徒至此如來出現品以明經五位加行進修功熟處方論流通付囑故若論根本法界性自不迷性自不悟無出無沒不成不壞無流無通也此付囑流通意從凡夫未悟令加行功終處說故非在法界品後也如法界品直論一切諸佛功終之果是自流通不須付囑如法界品中如來師子座暨于法界無有邊涯此明果極也如此如來出現品明信心者五位加行功終之力方始純實創登功畢二行圓周便說付囑流通明果初滿故方人常道法界非古今始末之量也流通此法名曰流通即法界品是為自以法界功滿常以法界行勸眾生以方便行倣而學之名為付囑流通方便行者即五位中方法是也即諸波羅蜜四攝四無量三十七品大願大智大悲等是一切諸佛法皆如是方能成也四隨文釋義者於此一品之中長科兩段。",
    "X04n0223_078:0526a24_0": "【經】爾時世尊從眉間白毫相中放大光明名如來出現無量百千億那由他阿僧祇光明以為眷屬其光普照十方盡虗空法界一切世界右遶十帀顯現如來無量自在覺悟無數諸菩薩眾震動一切十方世界除滅一切諸惡道苦暎蔽一切諸魔宮殿顯示一切諸佛如來坐菩提座成等正覺及以一切道場眾會作是事已而來右遶菩薩眾會入如來性起妙德菩薩頂時此道場一切大眾身心踊躍生大歡喜作如是念甚奇希有今者如來放大光明必當演說甚深大法爾時如來性起妙德菩薩於蓮華座上偏袒右肩右跽合掌一心向佛而說頌言。",
    "X04n0223_078:0526b11_0": "　正覺功德大智出　　普達境界到彼岸　等於三世諸如來　　是故我今恭敬禮　已昇無相境界岸　　而現妙相莊嚴身　放於離垢千光明　　破魔軍眾咸令盡　十方所有諸世界　　悉能震動無有餘　未曾恐怖一眾生　　善逝威神力如是　虗空法界性平等　　已能如是而安住　一切含生無數量　　咸令滅惡除眾垢　苦行勤勞無數劫　　成就最上菩提道　於諸境界智無礙　　與一切佛同其性　導師放此大光明　　震動十方諸世界　已現無量神通力　　而復還來入我身　決定法中能善學　　無量菩薩皆來集　令我發起問法心　　是故我今請法王　今此眾會皆清淨　　善能度脫諸世間　智慧無邊無染著　　如是賢勝咸來集　利益世間尊導師　　智慧精進皆無量　今以光明照大眾　　令我問於無上法　誰於大仙深境界　　而能真實具開演　誰是如來法長子　　世間尊導願顯示爾時如來即於口中放大光明名無礙無畏百千億阿僧祇光明以為眷屬普照十方盡虗空等法界一切世界右遶十帀顯現如來種種自在開悟無量諸菩薩眾震動一切十方世界除滅一切諸惡道苦暎蔽一切諸魔宮殿顯示一切諸佛如來坐菩提座成等正覺及以一切道場眾會作是事已而來右遶菩薩眾會入普賢菩薩摩訶薩口其光入已普賢菩薩身及師子座過於本時及諸菩薩身座百倍唯除如來師子之座爾時如來性起妙德菩薩問普賢菩薩摩訶薩言佛子佛所示現廣大神變令諸菩薩皆生歡喜不可思議世莫能如是何瑞相普賢菩薩摩訶薩言佛子我於往昔見諸如來應正等覺示現如是廣大神變即說如來出現法門如我惟忖今現此相當說其法說是語時一切大地悉皆震動出生無量問法光明時性起妙德菩薩問普賢菩薩言佛子菩薩摩訶薩應云何知諸佛如來應正等覺出現之法願為我說佛子此諸無量百千億那由他菩薩眾會皆久修淨業念慧成就到於究竟大莊嚴岸具一切佛威儀之行正念諸佛未曾忘失大悲觀察一切眾生決定了知諸大菩薩神通境界已得諸佛神力所加能受一切如來妙法具如是等無量功德皆已來集佛子汝已曾於無量百千億那由他佛所承事供養成就菩薩最上妙行於三昧門皆得自在入一切佛祕密之處知諸佛法斷眾疑惑為諸如來神力所加知眾生根隨其所樂為說真實解脫之法隨順佛智演說佛法到於彼岸有如是等無量功德善哉佛子願說如來應正等覺出現之法身相言音心意境界所行之行成道轉法輪乃至示現入般涅槃見聞親近所生善根如是等事願皆為說時如來性起妙德菩薩欲重明此義向普賢菩薩而說頌曰。",
    "X04n0223_078:0527a13_0": "　善哉無礙大智慧　　善覺無邊平等境　願說無量佛功德　　佛子聞已皆欣慶　菩薩云何隨順入　　諸佛如來出興世　云何身語心境界　　及所行處願皆說　云何諸佛成正覺　　云何如來轉法輪　云何善逝般涅槃　　大眾聞已心歡喜　若有見佛大法王　　親近增長諸善根　願說彼諸功德藏　　眾生見已何所獲　若有得聞如來名　　若現在世若涅槃　於彼福藏生深信　　有何等利願宣說　此諸菩薩皆合掌　　瞻仰如來仁及我　大功德海之境界　　淨眾生者願為說　願以因緣及譬喻　　演說妙法相應義　眾生聞已發大心　　疑盡智淨如虗空　如徧一切國土中　　諸佛所現莊嚴身　願以妙音及譬喻　　示佛菩提亦如彼　十方千萬諸國土　　億那由他無量劫　如今所集菩薩眾　　於彼一切悉難見　此諸菩薩咸恭敬　　於微妙義生渴仰　願以淨心具開演　　如來出現廣大法爾時普賢菩薩摩訶薩告如來性起妙德等諸菩薩大眾言佛子此處不可思議所謂如來應正等覺以無量法而得出現何以故非以一緣非以一事如來出現而得成就以十無量百千阿僧祇事而得成就何等為去所謂過去無量攝受一切眾生菩提心所成故過去無量清淨殊勝志樂所成故過去無量救護一切眾生大慈大悲所成故過去無量相續行願所成故過去無量修諸福智心無厭足所成故過去無量供養諸佛教化眾生所成故過去無量智慧方便清淨道所成故過去無量清淨功德藏所成故過去無量莊嚴道智所成故過去無量通達法義所成故佛子如是無量阿僧祇法門圓滿成於如來。",
    "X04n0223_078:0527b21_0": "【論】第一從初爾時世尊已下至佛子如是無量阿僧祇法門圓滿成於如來於中并頌有一百行半經明如來放光加文殊普賢令說如來出現分隨文釋義分為五段第一從初爾時世尊從眉間放白毫相光已下至而說頌言有十二行半經明佛放光灌文殊頂令問法分第二二十行頌明文殊師利菩薩稱歎如來德及放光加持之意請問誰堪演說佛境界分第三爾時如來即於口中放大光明已下至頌有三十五行經明如來放光入普賢口令文殊知問法所在并舉問如來出現十法分第四二十行頌明文殊師利菩薩重頌前所請說如來出現十法分第五爾時普賢菩薩摩訶薩已下至佛子如是無量阿僧祇法門圓滿成於如來明普賢告眾如來出現有十無量百千阿僧祇事而得成就分已上五段是佛光加文殊普賢令相問答說佛出現分光加之意前已敘竟大意表法中明昇進修行法身根本智差別智慈悲行十方圓終處名為如來出現故放光加令文殊普賢二人明理智體用參徹是如來出現明文殊是十方一切諸佛之法身妙理現根本智慧之門普賢是十方一切諸佛差別智萬行大悲之門今明五位進修至此位此二法圓滿名自佛出現故放眉間光灌文殊頂令問自佛果極至頂法門放口中光是說教之光令說自己佛果極至頂差別萬行智悲十方圓滿法故以此二人表法令學者易解故非是如來自不能說又表根本智非言所及也此一品經表明法身根本智差別智悲萬行圓滿故十地十一地已前加行此位真俗二法功終其義如文自明第二佛子譬如三千大千世界已下有十段經明普賢菩薩說如來出現身境界及所行行十事之法分於此段中演說如來十種出現門中有十段經文說如來出現有十百千阿僧祇事其十者第一明如來十無量出現。",
    "X04n0223_078:0528a06_0": "【經】佛子譬如三千大千世界非以一緣非以一事而得成就以無量緣無量事方乃得成所謂興布大雲降霪大雨四種風輪相續為依其四者何一名能持能持大水故二名能消能消大水故三名建立建立一切諸處所故四名莊嚴莊嚴分布咸善巧故如是皆由眾生共業及諸菩薩善根所起令於其中一切眾生各隨所宜而得受用佛子如是等無量因緣乃成三千大千世界法性如是無有生者無有作者無有知者無有成者然彼世界而得成就如來出現亦復如是非以一緣非以一事而得成就以無量因緣無量事相乃得成就所謂曾於過去佛所聽聞受持大法雲雨因此能起如來四種大智風輪何等為四一者念持不忘陀羅尼大智風輪能持一切如來大法雲雨故二者出生止觀大智風輪能消竭一切煩惱故三者善巧迴向大智風輪能成就一切善根故四者出生離垢差別莊嚴大智風輪令過去所化一切眾生善根清淨成就如來無漏善根力故如來如是成等正覺法性如是無生無作而得成就佛子是為如來應正等覺出現第一相菩薩摩訶薩應如是知復次佛子譬如三千大千世界將欲成時大雲降雨名曰洪霔一切方處所不能受所不能持唯除大千界將欲成時佛子如來應正等覺亦復如是興大法雲雨大法雨名成就如來出現一切二乘心志狹劣所不能受所不能持唯除諸大菩薩心相續力佛子是為如來應正等覺出現第二相菩薩摩訶薩應如是知復次佛子譬如眾生以業力故大雲降雨來無所從去無所至如來應正等覺亦復如是以諸菩薩善根力故興大法雲雨大法雨亦無所從來無所至去佛子是為如來應正等覺出現第三相菩薩摩訶薩應如是知復次佛子譬如大雲降霔大雨大千世界一切眾生無能知數若欲算計徒令發狂唯大千世界主摩醯首羅以過去所修善根力故乃至一滴無不明了佛子如來應正等覺亦復如是興大法雲雨大法雨一切眾生聲聞獨覺所不能知若欲思量心必狂亂唯除一切世間主菩薩摩訶薩以過去所修覺慧力故乃至一文一句入眾生心無不明了佛子是為如來應正等覺出現第四相菩薩摩訶薩應如是知復次佛子譬如大雲降雨之時有大雲雨名為能滅能滅火災有大雲雨名為能起能起大水有大雲雨名為能止能止大水有大雲雨名為能成能成一切摩尼諸寶有大雲雨名為分別分別三千大千世界佛子如來出現亦復如是興大法雲雨大法雨有大法雨名為能滅能滅一切眾生煩惱有大法雨名為能起能起一切眾生善根有大法雨名為能止能止一切眾生見惑有大法雨名為能成能成一切智慧法寶有大法雨名為分別分別一切眾生心樂佛子是為如來應正等覺出現第五相菩薩摩訶薩應如是知復次佛子譬如大雲雨一味水隨其所雨無量差別如來出現亦復如是雨於大悲一味法水隨宜說法無量差別佛子是為如來應正等覺出現第六相菩薩摩訶薩應如是知復次佛子譬如三千大千世界初始成時先成色界諸天宮殿次成欲界諸天宮殿次成於人及餘眾生諸所住處佛子如來出現亦復如是先起菩薩諸行智慧次起緣覺諸行智慧次起聲聞善根諸行智慧次起其餘眾生有為善根諸行智慧佛子譬如大雲雨一味水隨諸眾生善根異故所起宮殿種種不同如來大悲一味法雨隨眾生器而有差別佛子是為如來應正等覺出現第七相菩薩摩訶薩應如是知復次佛子譬如世界初欲成時有大水生徧滿三千大千世界生大蓮華名如來出現功德寶莊嚴徧覆水上光照十方一切世界時摩醯首羅淨居天等見是華已即決定知於此劫中有爾所佛出興于世佛子爾時其中有風輪起名善淨光明能成色界諸天宮殿有風輪起名淨光莊嚴能成欲界諸天宮殿有風輪起名堅密無能壞能成大小諸輪圍山及金剛山有風輪起名勝高能成須彌山王有風輪起名不動能成十大山王何等為十所謂佉陀羅山仙人山伏魔山大伏魔山持雙山尼民陀羅山目真隣陀山摩訶目真隣陀山香山雪山有風輪起名為安住能成大地有風輪起名為莊嚴能成地天宮殿龍宮殿乾闥婆宮殿有風輪起名無盡藏能成三千大千世界一切大海有風輪起名普光明藏能成三千大千世界諸摩尼寶有風輪起名堅固根能成一切諸如意樹佛子大雲所雨一味之水無有分別以眾生善根不同故風輪不同風輪差別故世界差別佛子如來出現亦復如是具足一切善根功德放於無上大智光明名不斷如來種不思議智普照十方一切世界與諸菩薩一切如來灌頂之記當成正覺出興於世佛子如來出現復有無上大智光明名清淨離垢能成如來無漏無盡智復有無上大智光明名普照能成如來普入法界不思議智復有無上大智光明名持佛種性能成如來不傾動力復有無上大智光明名迥出無能壞能成如來無畏無壞智復有無上大智光明名一切神通能成如來諸不共法一切智智復有無上大智光明名出生變化能成如來令見聞親近所生善根不失壞智復有無上大智光明名普隨順能成如來無盡福德智慧之身為一切眾生而作饒益復有無上大智光明名不名究竟能成如來甚深妙智隨所開悟令三寶種永不斷絕復有無上大智光明名種種莊嚴能成如來相好嚴身令一切眾生皆生歡喜復有無上大智光明名不可壞能成如來法界虗空界等殊勝壽命無有窮盡佛子如來大悲一味之水無有分別以諸眾生欲樂不同根性各別而起種種大智風輪令諸菩薩成就如來出現之法佛子一切如來同一體性大智輪中出生種種智慧光明佛子汝等應知如來於一解脫味出生無量不可思議種種功德眾生念言此是如來神力所造佛子此非如來神力所造佛子乃至一菩薩不於佛所曾種善根能得如來少分智慧無有是處但以諸佛威德力故令諸眾生具佛功德而佛如來無有分別無成無壞無有作者亦無作法佛子是為如來應正等覺出現第八相菩薩摩訶薩應如是知復次佛子如依虗空起四風輪能持水輪何等為四一名安住二名常住三名究竟四名堅固此四風輪能持水輪水輪能持大地令不散壞是故說地輪依水輪水輪依風輪風輪依虗空虗空無所依雖無所依能令三千大千世界而得安住佛子如來出現亦復如是依無礙慧光明起佛四種大智風輪能持一切眾生善根何等為四所謂普攝眾生皆令歡喜大智風輪建立正法令諸眾生皆生愛樂大智風輪守護一切眾生善根大智風輪具一切方便通達無漏界大智風輪是為四佛子諸佛世尊大慈救護一切眾生大悲度脫一切眾生大慈大悲普徧饒益然大慈大悲依大方便善巧大方便善巧依如來出現如來出現依無礙慧光明無礙慧光明無有所依佛子是為如來應正等覺出現第九相菩薩摩訶薩應如是知復次佛子譬如三千大千世界既成就已饒益無量種種眾生所謂水族眾生得水饒益陸地眾生得地饒益宮殿眾生得宮殿饒益虗空眾生得虗空饒益如來出現亦復如是種種饒益無量眾生所謂見佛生歡喜者得歡喜益住淨戒者得淨戒益住諸禪定及無量者得聖出世大神通益住法門光明者得因果不壞益住無所有光明者得一切法不壞益是故說言如來出現饒益一切無量眾生佛子是為如來應正等覺出現第十相菩薩摩訶薩應如是知佛子菩薩摩訶薩知如來出現則知無量知成就無量行故則知廣大知周徧十方故則知無來去知離生住滅故則知無行無所行知離心意識故則知無身知如虗空故則知平等知一切眾生皆無我故則知無盡知徧一切剎無有盡故則知無退知盡後際無斷絕故則知無壞知如來智無有對故則知無二知平等觀察為無為故則知一切眾生皆得饒益本願迴向自在滿足故爾時普賢菩薩摩訶薩欲重明此義而說頌言。",
    "X04n0223_078:0529c20_0": "　十力大雄最無上　　譬如虗空無等等　境界廣大不可量　　功德第一超世間　十力功德無邊量　　心意思量所不及　人中師子一法門　　眾生億劫莫能知　十方國土碎為塵　　或有算計知其數　如來一毛功德量　　千萬億劫無能說　如人持尺量虗空　　復有隨行計其數　虗空邊際不可得　　如來境界亦如是　或有能於剎那頃　　悉知三世眾生心　設經眾生數等劫　　不能知佛一念性　譬如法界徧一切　　不可見取為一切　十力境界亦復然　　徧於一切非一切　真如離妄恒寂靜　　無生無滅普周徧　諸佛境界亦復然　　體性平等不增減　譬如實際而非際　　普在三世亦非普　導師境界亦如是　　徧於三世皆無礙　法性無作無變易　　猶如虗空本清淨　諸佛性淨亦如是　　本性非性離有無　法性不在於言論　　無說離說恒寂滅　十力境界性亦然　　一切文辭菓能辯　了知諸法性寂滅　　如鳥飛空無有跡　以本願力現色身　　令見如來大神變　若有欲知佛境界　　當淨其意如虗空　遠離妄想及諸取　　令心所向皆無礙　是故佛子應善聽　　我以少譬明佛境　十力功德不可量　　為悟眾生今略說　導師所現於身業　　語業心業諸境界　轉妙法輪般涅槃　　一切善根我今說　譬如世界初安立　　非一因緣而可成　無量力便諸因緣　　成此三千大千界　如來出現亦如是　　無量功德乃得成　剎塵心念尚可知　　十力生因莫能測　譬如劫初雲澍雨　　而起四種大風輪　眾生善根菩薩力　　成此三千各安住　十力法雲亦如是　　起智風輪清淨意　昔所迴向諸眾生　　普導令成無上果　如有大雨名洪澍　　無有處所能容受　唯除世界將成時　　清淨虗空大風力　如來出現亦如是　　普雨法雨充法界　一切劣意無能持　　唯除清淨廣大心　譬如空中澍大雨　　無所從來無所去　作者受者悉亦無　　自然如是普充洽　十力法雨亦如是　　無去無來無造作　本行為因菩薩力　　一切大心咸聽受　譬如空雲澍大雨　　一切無能數其滴　唯除三千自在王　　具功德力悉明了　善逝法雨亦如是　　一切眾生莫能測　唯除於世自在人　　明見如觀掌中寶　譬如空雲澍大雨　　能滅亦起亦能斷　一切珍寶悉能成　　三千所有皆分別　十力法雨亦如是　　滅惑起善斷諸見　一切智寶皆使成　　眾生心樂悉分別　譬如空中雨一味　　隨其所雨各不同　豈彼雨性有分別　　然隨物異法如是　如來法雨非一異　　平等寂靜離分別　然隨所化種種殊　　自然如是無邊相　譬如世界初成時　　先成色界天宮殿　次及欲天次人處　　乾闥婆宮最後成　如來出現亦如是　　先起無邊菩薩行　次化樂寂諸緣覺　　次聲聞眾後眾生　諸天初見蓮華瑞　　知佛當出生歡喜　水緣風力起世間　　宮殿山川悉成立　如來宿善大光明　　巧別菩薩與其記　所有智輪體皆淨　　各能開示諸佛法　譬如樹林依地有　　地依於水得不壞　水輪依風風依空　　而其虗空無所依　一切佛法依慈悲　　慈悲復依方便立　方便依智智依慧　　無礙慧身無所依　譬如世界既成立　　一切眾生獲其利　地水所住及空居　　二足四足皆蒙益　法王出現亦如是　　一切眾生獲其利　若有見聞及親近　　悉使滅除諸惑惱　如來出現法無邊　　世間迷惑莫能知　為欲開悟諸含識　　無譬喻中說其譬【論】第二明如來出現有十無量身。",
    "X04n0223_078:0530c23_0": "【經】佛子諸菩薩摩訶薩應云何見如來應正等覺身佛子諸菩薩摩訶薩應於無量處見如來身何以故諸菩薩摩訶薩不應於一法一事一身一國土一眾生見於如來應徧一切處見於如來佛子譬如虗空徧至一切色非色處非至非不至何以故虗空無身故如來身亦如是徧一切處徧一切眾生徧一切法徧一切國土非至非不至何以故如來身無身故為眾生故示現其身佛子是為如來身第一相諸菩薩摩訶薩應如是見復次佛子譬如虗空寬廣非色而能顯現一切諸色而彼虗空無有分別亦無戲論如來身亦復如是以智光明普照明故令一切眾生世出世間諸善根業皆得成就而如來身無有分別亦無戲論何以故從本已來一切執著一切戲論皆永斷故佛子是為如來身第二相諸菩薩摩訶薩應如是見復次佛子譬如日出於閻浮提無量眾生皆得饒益所謂破闇作明變濕令燥生長草木成熟穀稼廓徹虗空開敷蓮華行者見道居者辦業何以故日輪普放無量光故佛子如來智日亦復如是以無量事普益眾生所謂滅惡生善破愚為智大慈救護大悲度脫令其增長根力覺分令生深信捨離濁心令得見聞不壞因果令得天眼見歿生處令心無礙不壞善根令智修明開敷覺華令其發心成就本行何以故如來廣大智慧日身放無量光普照耀故佛子是為如來身第三相諸菩薩摩訶薩應如是見復次佛子譬如日出於閻浮提先照一切須彌山等諸大山王次照黑山次照高原然後普照一切大地日不作念我先照此後照於彼但以山地有高下故照有先後如來應正等覺亦復如是成就無邊法界智輪常放無礙智慧光明先照菩薩摩訶薩等諸大山王次照緣覺次照聲聞次照決定善根眾生隨其心器示廣大智然後普照一切眾生乃至邪定亦皆普及為作未來利益因緣令成熟故而彼如來大智日光不作是念我當先照菩薩大行乃至後照邪定眾生但放光明平等普照無礙無障無所分別佛子譬如日月隨時出現大山幽谷普照無私如來智慧亦復如是普照一切無有分別隨諸眾生根欲不同智慧光明種種有異佛子是為如來身第四相諸菩薩摩訶薩應如是見復次佛子譬如日出生盲眾生無眼根故未曾得見雖未曾見然為日光之所饒益何以故因此得知晝夜時節受用種種衣服飲食令身調適離眾患故如來智日亦復如是無信無解毀戒毀見邪命自活生盲之類無信眼故不見諸佛智慧日輪雖不見佛智慧日輪亦為智日之所饒益何以故以佛威力令彼眾生所有身苦及諸煩惱未來苦因皆消滅故佛子如來有光明名積集一切功德有光明名普照一切有光明名清淨自在照有光明名出大妙音有光明名普解一切語言法令他歡喜有光名明示現永斷一切疑自在境界有光明名無住智自在普照有光明名永斷一切戲論自在智有光明名隨所應出妙音聲有光明名出清淨自在音莊嚴國土成熟眾生佛子如來一一毛孔放如是等千種光明五百光明普照下方五百光明普照上方種種剎中種種佛所諸菩薩眾其菩薩等見此光明一時皆得如來境界十頭十眼十耳十鼻十舌十身十手十足十地十智皆悉清淨彼諸菩薩先所成就諸處諸地見彼光明轉更清淨一切善根皆悉成熟趣一切智住二乘者滅一切垢其餘一分生盲眾生身既快樂心亦清淨柔耎調伏堪修念智地獄餓鬼畜生諸趣所有眾生皆得快樂解脫眾苦命終皆生天上人間佛子彼諸眾生不覺不知以何因緣以何神力而來生此彼生盲者作如是念我是梵天我是梵化是時如來住普自在三昧出六十種妙音而告之言汝等非是梵天亦非梵化亦非帝釋護世所作皆是如來威神之力彼諸眾生聞是語已以佛神力皆知宿命生大歡喜心歡喜故自然而出優曇華雲香雲音樂雲衣雲蓋雲幢雲幡雲末香雲寶雲師子幢半月樓閣雲歌詠讚歎雲種種莊嚴雲皆以尊重心供養如來何以故此諸眾生得淨眼故如來與彼授阿耨多羅三藐三菩提記佛子如來智日如是利益生盲眾生令得善根具足成熟佛子是為如來身第五相諸菩薩摩訶薩應如是見復次佛子譬如月輪有四奇特未曾有法何等為四一者暎蔽一切星宿光明二者隨逐於時示現虧盈三者於閻浮提澄淨水中影無不現四者一切見者皆對目前而此月輪無有分別無有戲論佛子如來身月亦復如是有四奇特未曾有法何等為四所謂暎蔽一切聲聞獨覺學無學眾隨其所宜示現壽命脩短不同而如來身無有增減一切世界淨心眾生菩提器中影無不現一切眾生有瞻對者皆謂如來唯現我前隨其心樂而為說法隨其地位令得解脫隨所應化令見佛身而如來身無有分別無有戲論所作利益皆得究竟佛子是為如來身第六相諸菩薩摩訶薩應如是見復次佛子譬如三千大千世界大梵天王以少方便於大千世界普現其身一切眾生皆見梵王現在已前而此梵王亦不分身無種種身佛子諸佛如來亦復如是無有分別無有戲論亦不分身無種種身而隨一切眾生心樂示現其身亦不作念現若干身佛子是為如來身第七相諸菩薩摩訶薩應如是見復次佛子譬如醫王善知眾藥及諸呪論閻浮提中諸所有藥用無不盡復以宿世諸善根力大明呪力為方便故眾生見者病無不愈彼大醫王知命將終作是念言我命終後一切眾生無所依怙我今宜應為現方便是時醫王合藥塗身明呪力持令其終後身不分散不萎不枯威儀視聽與本無別凡所療治悉得除差佛子如來應正等覺無上醫王亦復如是於無量百千億那由他劫鍊治法藥已得成就修學一切方便善巧大明呪力皆到彼岸善能除滅一切眾生諸煩惱病及住壽命經無量劫其身清淨無有思慮無有動用一切佛事未嘗休息眾生見者諸煩惱病悉得消滅佛子是為如來身第八相諸菩薩摩訶薩應如是見。",
    "X04n0223_078:0532b05_0": "大方廣佛新華嚴經合論卷第七十八",
    "X04n0223_078:0532b07_0": "音切",
    "X04n0223_078:0532b08_0": "袒(堂爛切)。",
    "X04n0223_078:0532b08_1": "跪(溪委切)。",
    "X04n0223_078:0532b08_2": "燥(先到切)。",
    "X04n0223_078:0532b08_3": "廓(苦郭切)。",
    "X04n0223_078:0532b08_4": "忖(錯本切)。",
    "X04n0223_078:0532b08_5": "怙(戶音)。",
    "X04n0223_078:0532b08_6": "萎(於追切)。",
    "X04n0223_078:0532b09_7": "跽(其几切)。",
    "X04n0223_078:0532b09_8": "倍(薄亥切)。",
    "X04n0223_078:0532b09_9": "囑(之玉切)。"
}