{
    "X04n0223_081:0546c19_0": "大方廣佛新華嚴經合論卷第八十一",
    "X04n0223_081:0546c20_0": "唐于闐國三藏沙門實叉難陀譯經",
    "X04n0223_081:0546c21_0": "唐太原方山長者李通玄造論",
    "X04n0223_081:0546c22_0": "唐福州開元寺沙門志寧釐經合論",
    "X04n0223_081:0546c23_0": "【論】第九會在普光明殿說離世間品。",
    "X04n0223_081:0546c24_0": "離世間品第三十八之一",
    "X04n0223_081:0547a01_0": "【論】將釋此品約作五門一釋品名目二釋品來意三釋敘致始成正覺所由四釋說法之主所以五隨文釋義一釋品名目者所以名離世間品明前品既名如來出現此品即名得離世間故故名離世間此有二義一望說法之主說教益眾生是利益世間品合作利益之名二望眾生聞法處世無染是離世間品故此約說法之主及得益者二義通釋二釋品來意者明前品是五位昇進已終自己佛果覺行已滿此品是普賢常行自從初如來始成正覺已來一時同說是古今諸佛共行乃至從普光明殿說十信心法十定法十通十忍阿僧祇如來壽量菩薩住處佛不思議如來十身相海如來隨好光明功德普賢行如來出現離世間法界品如是十四品經乃至四十品經天上人中不離一剎那際三昧以普光明智一時普印一時同說以此諸會及至昇天皆云不離始成正覺普光明殿此明圓通始末時法不遷故此品須來三釋敘致始成正覺之所由者何故品初敘其始成佛之時及處何意經云爾時世尊在摩竭提國阿蘭若法菩提場中普光明殿乃至妙悟已滿者意明此十定及離世間品等五位進修始終皆以此普賢行體為昇進故又四十品意謂雖別總不離普光明智十定之體一時同說無前後際十方同然已此昇天但云不離菩提場普光明殿如說十定品一會說十一品經在於十定初亦同此品如前敘致還云爾時世尊在摩竭提國乃至妙悟已滿以明十定品以定無前後普收一部經之始末及三世故此離世間品以其二千法門普賢行體成佛因果普收前後及以三世常然之道故以敘之明總是初成正覺時一時以普光明智人間天上及十方世界一時頓印無有前後圓鏡頓照諸鏡為此教頓為大心眾生頓舉智境非如劣解者情識所知故成佛亦一念成說教亦一念說但約智體非三世時分歲月情量所收故四釋說法之主所以者此品何故還令普賢菩薩說者明此二千法門是普賢所行常行故還令普賢自說自行令諸聞法者倣而斆之即行普賢之行如是乃至示現成佛入涅槃總是普賢行故若以根本法身智身佛無成壞之功以差別智論總是普賢行攝故是故如來出現品明自己覺行圓滿故十方諸佛同號普賢以明十住十行十迴向中但一分覺心能治一切煩惱中一分麤惑行得一分慈悲雖踐普賢一分行蹤然未全具普賢行滿故隨位佛果但同號為月為眼為妙至如來出現品明覺行齊圓故是以不可說佛剎微塵數佛同號普賢佛故明根本智全成差別智用滿得名故以體收用此乃就用成名故今此品令普賢說者亦是以根本智就用成名若約初心信解即將用從本本以普賢用從根本智世界名金色佛果號不動智能覺之人號曰文殊此至自行佛果覺行已圓即以根本智從用佛號普賢故所行行亦號普賢故如說此品普賢是約本從用普賢及說十定品普賢亦是如初會中普賢是毗盧遮那如來自行普賢十定品已來普賢是凡夫從十信十住已來昇進道滿自行普賢明自十信心至十地以用從本即成根本智使令圓滿從十地向十一地以根本智從用成差別智一向利生即說十定已來普賢菩薩是也是故說十定品時已登十地諸菩薩再三求覓普賢不得者明以根本智會用未及滿故如來令生想念普賢如對目前方得見者明純用是普賢故即以智想從用是故出現品中令文殊問普賢者明以體從用故如說此品普賢是主以體從用普賢共初如來初會中普賢其功相似是以初會所說法門皆令普賢說法亦是以體從用第二會以普賢智用從體直至十地皆是以用從體且令成其根本智使圓明然後十地終捨三昧涅槃樂如稠林煩惱故方令具普賢大用始得稱周設教於生死中自在故如是安立修行以智境乃至一時是故十定及此品總通敘致始成正覺菩提場始末有發心之士深須得意方堪修道作前後多生尋求不可相應但自以定慧力觀照所緣真俗內外心境染淨偏多處以理智體用平等法而用治之散動多者以定治之樂寂多者以平等法身及大願迴向力以悲智治之一如此經五位修行法治之至究竟趣若自智不及志求良匠不可安然致無所益當知此說法主者是成佛果後以體從用普賢說始終常道普賢二千種法用該萬行八地捨七地中有行有開發智淨無功十地捨涅槃三昧稠林行成普賢行入於生死圓滿大悲方始自在第五隨文釋義者於此一品有七卷經長科為十段。",
    "X04n0223_081:0548a10_0": "【經】爾時世尊在摩竭提國阿蘭若法菩提場中普光明殿坐蓮華藏師子之座妙悟皆滿二行永絕達無相法住於佛住得佛平等到無障處不可轉法所行無礙立不思議普見三世身恒充徧一切國土智恒明達一切諸法了一切行盡一切疑無能測身一切菩薩等所求智到佛無二究竟彼岸具足如來平等解脫證無中邊佛平等地盡於法界等虗空界。",
    "X04n0223_081:0548a17_0": "【論】第一爾時世尊已下至盡於法界虗空界有八行經明歎佛成道所得法門是此品序分如歎德中妙悟皆滿者無功之理智性自徧知故二行永絕者斷常有無無二見也達無相法者智境如幻心境無主住佛所住者佛無所住得佛平等者大智徧周知根與益無自他也到無障處者聖凡同體總別自在不可轉法者體用自在無性可轉所行無礙者智用徧周無物為礙故立不思議者迷亡任智也普見三世者智印古今無延促也身恒徧周一切國土者內外見亡大小情盡心如虗空智體自徧對現色身非往來也智恒明達一切諸法者歎如來差別智滿了一切行盡一切疑無能測身一切菩薩等所求智者歎如來最後身之德用義無不盡行無不周身無不徧事無不知智無不圓任無功用心無卷舒十方普應無心意識任德所求以無依住聲一音徧告隨根別悟任智不同故已下如文自明。",
    "X04n0223_081:0548b10_0": "【經】與不可說百千億那由他佛剎微塵數菩薩摩訶薩俱皆一生當得阿耨多羅三藐三菩提各從他方種種國土而共來集悉具菩薩方便智慧所謂善能觀察一切眾生以方便力令其調伏住菩薩法善能觀察一切世界以方便力普皆往詣善能觀察涅槃境界思惟籌量永離一切戲論分別而修妙行無有間斷善能攝受一切眾生善入無量諸方便法知諸眾生空無所有而不壞業果善知眾生心使諸根境界方便種種差別悉能受持三世佛法自得解了復為他說於世出世無量諸法皆善安住知其真實於有為無為一切諸法悉善觀察知無有二於一念中悉能獲得三世諸佛所有智慧於念念中悉能示現成等正覺令一切眾生發心成道於一眾生心之所緣悉知一切眾生境界雖入如來一切智地而不捨菩薩行諸所作業智慧方便而無所作為一一眾生住無量劫而於阿僧祇劫難可值遇轉正法輪調伏眾生皆不唐捐三世諸佛清淨行願悉已具足成就如是無量功德一切如來於無邊劫說不可盡。",
    "X04n0223_081:0548c04_0": "【論】第二與不可說百千億已下至說不可盡有二十一行經是歎菩薩大眾至德圓滿分。",
    "X04n0223_081:0548c06_0": "【經】其名曰普賢菩薩普眼菩薩普化菩薩普慧菩薩普見菩薩普光菩薩普觀菩薩普照菩薩普幢菩薩普覺菩薩如是等十不可說百千億那由他佛剎微塵數皆悉成就普賢行願深心大願皆已圓滿一切諸佛出興世處悉能往詣請轉法輪善能受持諸佛法眼不斷一切諸佛種性善知一切諸佛興世授記次第名號國土成等正覺轉於法輪無佛世界現身成佛能令一切雜染眾生皆悉清淨能滅一切菩薩業障入於無礙清淨法界。",
    "X04n0223_081:0548c15_0": "【論】第三其名曰已下至入於無礙清淨法界有十行經明菩薩列名及歎德分。",
    "X04n0223_081:0548c17_0": "【經】爾時普賢菩薩摩訶薩入廣大三昧名佛華莊嚴入此三昧時十方所有一切世界六種十八相動出大音聲靡不皆聞然後從其三昧而起。",
    "X04n0223_081:0548c20_0": "【論】第四爾時普賢已下至然後從三昧而起有三行半經明普賢入定大地十八相震動普賢起定分。",
    "X04n0223_081:0548c23_0": "【經】爾時普慧菩薩知眾已集問普賢菩薩言佛子願為演說何等為菩薩摩訶薩依何等為奇特想何等為行何等為善知識何等為勤精進何等為心得安隱何等為成就眾生何等為戒何等為自知受記何等為入菩薩何等為入如來何等為入眾生心行何等為入世界何等為入劫何等為說三世何等為知三世何等為發無疲厭心何等為差別智何等為陀羅尼何等為演說佛何等為發普賢心何等為普賢待法以何等故而起大悲何等為發菩提心因緣何等為於善知識起尊重心何等為清淨何等為諸波羅蜜何等為智隨覺何等為證知何等為力何等為平等何等為佛法實義句何等為說法何等為持何等為辯才何等為自在何等為無著性何等為平等心何等為出生智慧何等為變化何等為力持何等為得大欣慰何等為深入佛法何等為依止何等為發無畏心何等為發無疑惑心何等為不思議何等為巧密語何等為巧分別智何等為入三昧何等為徧入何等為解脫門何等為神通何等為明何等為解脫何等為園林何等為宮殿何等為所樂何等為莊嚴何等為發不動心以等為不捨深大心何等為觀察何等為說法何等為清淨何等為印何等為智光照何等為無等住何等為無下劣心何等為如山增上心何等為入無上菩提如海智何等為如寶住何等為發如金剛大乘誓願心何等為大發起何等為究竟大事何等為不壞信何等為授記何等為善根迴向何等為得智慧何等為發無邊廣大心何等為伏藏何等為律儀何等為自在何等為無礙用何等為眾生無礙用何等為剎無礙用何等為法無礙用何等為身無礙用何等為願無礙用何等為境界無礙用何等為智無礙用何等為神通無礙用何等為神力無礙用何等為力無礙用何等為遊戲何等為境界何等為力何等為無畏何等為不共法何等為業何等為身何等為身業何等為身何等為語何等為淨修語業何等為得守護何等為成辨大事何等為心何等為發心何等為周徧心何等為諸根何等為深心何等為增上深心何等為勤修何等為決定解何等為決定解入世界何等為決定解入眾生界何等為習氣何等為取何等為修何等為成就佛法何等為退失佛法道何等為離生道何等為決定法何等為出生佛法道何等為大丈夫名號何等為道何等為無量道何等為助道何等為修道何等為莊嚴道何等為足何等為手何等為腹何等為藏何等為心何等為被甲何等為器仗何等為首何等為眼何等為耳何等為鼻何等為舌何等為身何等為意何等為行何等為住何等為坐何等為臥何等為所住處何等為所行處何等為觀察何等為普觀察何等為奮迅何等為師子吼何等為清淨施何等為清淨戒何等為清淨忍何等為清淨精進何等為清淨定何等為清淨慧何等為清淨慈何等為清淨悲何等為清淨喜何等為清淨捨何等為義何等為法何等為福德助道具何等為智慧助道具何等為明足何等為求法何等為明了法何等為修行法何等為魔何等為魔業何等為捨離魔業何等為見佛何等為佛業何等為慢業何等為智業何等為魔所攝持何等為佛所攝持何等為法所攝持何等為住兜率天所作業何故於兜率天宮歿何故現處胎何等為現微細趣何故現初生何故現微笑何故示行七步何故現童子地何故現處內宮何故現出家何故示苦行云何往詣道場云何坐道場何等為坐道場時奇特相何故示降魔何等為成如來力云何轉法輪何故因轉法輪得白淨法何故如來應正等覺示般涅槃善哉佛子如是等法願為演說。",
    "X04n0223_081:0549c13_0": "【論】第五爾時普慧菩薩已下至佛子如是等法願為演說有七十二行半經此一段明普慧菩薩有二百問都問一切初發心乃至究竟佛果法門行相分。",
    "X04n0223_081:0549c17_0": "【經】爾時普賢菩薩告普慧等諸菩薩言佛子菩薩摩訶薩有十種依何等為十所謂以菩提心為依恒不忘失故以善知識為依和合如一故以善根為依修習增長故以波羅蜜為依具足修行故以一切法為依究竟出離故以大願為依增長菩提故以諸行為依普皆成就故以一切菩薩為依同一智慧故以供養諸佛為依信心清淨故以一切如來為依如慈父教誨不斷故是為十若諸菩薩安住此法則得為如來無上大智所依處佛子菩薩摩訶薩有十種奇特想何等為十所謂於一切善根生自善根想於一切善根生菩提種子想於一切眾生生菩提器想於一切願生自願想於一切法生出離想於一切行生自行想於一切法生佛法想於一切語言法生語言道想於一切佛生慈父想於一切如來生無二想是為十若諸菩薩安住此法則得無上善巧想佛子菩薩摩訶薩有十種行何等為十所謂一切眾生行普令成熟故一切求法行咸悉修學故一切善根行悉使增長故一切三昧行一心不亂故一切智慧行無不了知故一切修習行無不能修故一切佛剎行皆悉莊嚴故一切善友行恭敬供養故一切如來行尊重承事故一切神通行變化自在故是為十若諸菩薩安住此法則得如來無上大智慧行佛子菩薩摩訶薩有十種善知識何等為十所謂令住菩提心善知識令生善根善知識令行諸波羅蜜善知識令解說一切法善知識令成熟一切眾生善知識令得決定辯才善知識令不著一切世間善知識令於一切劫修行無厭倦善知識令安住普賢行善知識令入一切佛智所入善知識是為十佛子菩薩摩訶薩有十種勤精進何等為十所謂教化一切眾生勤精進深入一切法勤精進嚴淨一切世界勤精進修行一切菩薩所學勤精進滅除一切眾生惡勤精進止息一切三惡道苦勤精進摧破一切眾魔勤精進願為一切眾生作清淨眼勤精進供養一切諸佛勤精進令一切如來皆悉歡喜勤精進是為十若諸菩薩安住此法則得具足如來無上精進波羅蜜佛子菩薩摩訶薩有十種心得安隱何等為十所謂自住菩提心亦當令他住菩提心心得安隱自究竟離忿諍亦當令他離忿諍心得安隱自離凡愚法亦令他離凡愚法心得安隱自勤修善根亦令他勤修善根心得安隱自住波羅蜜道亦令他住波羅蜜道心得安隱自生在佛家亦當令他生於佛家心得安隱自深入無自性真實法亦令他入無自性真實法心得安隱自不誹謗一切佛法亦令他不誹謗一切佛法心得安隱自滿一切智菩提願亦令他滿一切智菩提願心得安隱自深入一切如來無盡智藏亦令他入一切如來無盡智藏心得安隱是為十若諸菩薩安住此法則得如來無上大智安隱佛子菩薩摩訶薩有十種成就眾生何等為十所謂以布施成就眾生以色身成就眾生以說法成就眾生以同行成就眾生以無染著成就眾生以開示菩薩行成就眾生以熾然示現一切世界成就眾生以示現佛法大威德成就眾生以種種神通變現成就眾生以種種微密善巧方便成就眾生是為十菩薩以此成就眾生界佛子菩薩摩訶薩有十種戒何等為十所謂不捨菩提心戒遠離二乘地戒觀察利益一切眾生戒令一切眾生住佛法戒修一切菩薩所學戒於一切法無所得戒以一切善根迴向善提戒不著一切如來身戒思惟一切法離取著戒諸根律儀戒是為十若諸菩薩安住此法則得如來無上廣大戒波羅蜜佛子菩薩摩訶薩有十種受記法菩薩以此自知受記何等為十所謂以殊勝意發菩提心自知受記永不厭捨諸菩薩行自知受記住一切劫行菩薩行自知受記修一切佛法自知受記於一切佛教一向深信自知受記修一切善根皆令成就自知受記置一切眾生於佛菩提自知受記於一切善知識和合無二自知受記於一切善知識起如來想自知受記恒勤守護菩提本願自知受記是為十佛子菩薩摩訶薩有十種入入諸菩薩何等為十所謂入本願入行入聚入諸波羅蜜入成就入差別願入種種解入莊嚴佛土入神力自在入示現受生是為十菩薩以此普入三世一切菩薩佛子菩薩摩訶薩有十種入入諸如來何等為十所謂入無邊成正覺入無邊轉法輪入無邊方便法入無邊差別音聲入無邊調伏眾生入無邊神力自在入無邊種種差別身入無邊三昧入無邊力無所畏入無邊示現涅槃是為十菩薩以此普入三世一切如來佛子菩薩摩訶薩有十種入眾生行何等為十所謂入一切眾生過去行入一切眾生未來行入一切眾生現在行入一切眾生善行入一切眾生不善行入一切眾生心行入一切眾生根行入一切眾生解行入一切眾生煩惱習氣行入一切眾生教化調伏時非時行是為十菩薩以此普入一切諸眾生行佛子菩薩摩訶薩有十種入世界何等為十所謂入染世界入淨世界入小世界入大世界入微塵中世界入微細世界入覆世界入仰世界入有佛世界入無佛世界是為十菩薩以此普入十方一切世界佛子菩薩摩訶薩有十種入劫何等為十所謂入過去劫入未來劫入現在劫入可數劫入不可數劫入可數劫即不可數劫入不可數劫即可數劫入一切劫即非劫入非劫即一切劫入一切劫即一念是為十菩薩以此普入一切劫佛子菩薩摩訶薩有十種說三世何等為十所謂過去世說過去世過去世說未來世過去世說現在世未來世說過去世未來世說現在世未來世說無盡現在世說過去世現在世說未來世現在世說平等現在世說三世即一念是為十菩薩以此普說三世佛子菩薩摩訶薩有十種知三世何等為十所謂知諸安立知諸語言知諸談議知諸軌則知諸稱謂知諸制令知其假名知其無盡知其寂滅知一切空是為十菩薩以此普知一切三世諸法佛子菩薩摩訶薩發十種無疲厭心何等為十所謂供養一切諸佛無疲厭心親近一切善知識無疲厭心求一切法無疲厭心聽聞正法無疲厭心宣說正法無疲厭心教化調伏一切眾生無疲厭心置一切眾生於佛菩提無疲厭心於一一世界經不可說不可說劫行菩薩行無疲厭心遊行一切世界無疲厭心觀察思惟一切佛法無疲厭心是為十若諸菩薩安住此法則得如來無疲厭無上大智佛子菩薩摩訶薩有十種差別智何等為十所謂知眾生差別智知諸根差別智知業報差別智知受生差別智知世界差別智知法界差別智知諸佛差別智知諸法差別智知三世差別智知一切語言道差別智是為十若諸菩薩安住此法則得如來無上廣大差別智佛子菩薩摩訶薩有十種陀羅尼何等為十所謂聞持陀羅尼持一切法不忘失故修行陀羅尼如實巧觀一切法故思惟陀羅尼了知一切諸法性故法光明陀羅尼照不思議諸佛法故三昧陀羅尼普於現在一切佛所聽聞正法心不亂故圓音陀羅尼解了不思議音聲語言故三世陀羅尼演說三世不可思議諸佛法故種種辯才陀羅尼演說無邊諸佛法故出生無礙耳陀羅尼不可說佛所說之法悉能聞故一切佛法陀羅尼安住如來力無畏故是為十若諸菩薩欲得此法當勤修學佛子菩薩摩訶薩說十種佛何等為十所謂成正覺佛願佛業報佛住持佛涅槃佛法界佛心佛三昧佛本性佛隨樂佛是為十佛子菩薩摩訶薩發十種普賢心何等為十所謂發大慈心救護一切眾生故發大悲心代一切眾生受苦故發一切施心悉捨所有故發念一切智為首心樂求一切佛法故發功德莊嚴心學一切菩薩行故發如金剛心一切處受生不忘失故發如海心一切白淨法悉流入故發如大山王心一切惡言皆忍受故發安隱心施一切眾生無怖畏故發般若波羅蜜究竟心巧觀一切法無所有故是為十若諸菩薩安住此心疾得成就普賢善巧智佛子菩薩摩訶薩有十種普賢行法何等為十所謂願住未來一切劫普賢行法願供養恭敬未來一切佛普賢行法願安置一切眾生於普賢菩薩行普賢行法願積集一切善根普賢行法願入一切波羅蜜普賢行法願滿足一切菩薩行普賢行法願莊嚴一切世界普賢行法願生一切佛剎普賢行法願善觀察一切法普賢行法願於一切佛國土成無上菩提普賢行法是為十若諸菩薩勤修此法疾得滿足普賢行願佛子菩薩摩訶薩以十種觀眾生而起大悲何等為十所謂觀察眾生無依無怙而起大悲觀察眾生性不調順而起大悲觀察眾生貧無善根而起大悲觀察眾生長夜睡眠而起大悲觀察眾生行不善法而起大悲觀察眾生欲縛所縛而起大悲觀察眾生沒生死海而起大悲觀察眾生長嬰疾苦而起大悲觀察眾生無善法欲而起大悲觀察眾生失諸佛法而起大悲是為十菩薩恒以此心觀察眾生佛子菩薩摩訶薩有十種發菩提心因緣何等為十所謂為教化調伏一切眾生故發菩提心為除滅一切眾生苦聚故發菩提心為與一切眾生具足安樂故發菩提心為斷一切眾生愚癡故發菩提心為與一切眾生佛智故發菩提心為恭敬供養一切諸佛故發菩提心為隨如來教令佛歡喜故發菩提心為見一切佛色身相好故發菩提心為入一切佛廣大智慧故發菩提心為顯現諸佛力無所畏故發菩提心是為十佛子若菩薩發無上菩提心為悟入一切智智故親近供養善知識時應起十種心何等為十所謂起給侍心歡喜心無違心隨順心無異求心一向心同善根心同願心如來心同圓滿行心是為十佛子若菩薩摩訶薩起如是心則得十種清淨何等為十所謂深心清淨到於究竟無失壞故色身清淨隨其所宜為示現故音聲清淨了達一切諸語言故辯才清淨善說無邊諸佛法故智慧清淨捨離一切愚癡暗故受生清淨具足菩薩自在力故眷屬清淨成就過去同行眾生諸善根故果報清淨除滅一切諸業障故大願清淨與諸菩薩性無二故諸行清淨以普賢乘而出離故是為十佛子菩薩摩訶薩有十種波羅蜜何等為十所謂施波羅蜜悉捨一切諸所有故戒波羅蜜淨佛戒故忍波羅蜜住佛忍故精進波羅蜜一切所作不退轉故禪波羅蜜念一境故般若波羅蜜如實觀察一切法故智波羅蜜入佛力故願波羅蜜滿足普賢諸大願故神通波羅蜜示現一切自在用故法波羅蜜普入一切諸佛法故是為十若諸菩薩安住此法則得具足如來無上大智波羅蜜佛子菩薩摩訶薩有十種智隨覺何等為十所謂一切世界無量差別智隨覺一切眾生界不可思議智隨覺一切諸法一入種種種種入一智隨覺一切法界廣大智隨覺一切虗空界究竟智隨覺一切世界入過去世智隨覺一切世界入未來世智隨覺一切世界入現在世智隨覺一切如來無量行願皆於一智而得圓滿智隨覺三世諸佛皆同一行而得出離智隨覺是為十若諸菩薩安住此法則得一切法自在光明所願皆滿於一念頃悉能解了一切佛法成等正覺佛子菩薩摩訶薩有十種證知何等為十所謂知一切法一相知一切法無量相知一切法在一念知一切眾生心行無礙知一切眾生諸根平等知一切眾生煩惱習氣行知一切眾生心使行知一切眾生善不善行知一切菩薩願行自在住持變化知一切如來具足十力成等正覺是為十若諸菩薩安住此法則得一切法善巧方便。",
    "X04n0223_081:0552b17_0": "大方廣佛新華嚴經合論卷第八十一"
}