{
    "X04n0223_052:0352b19_0": "大方廣佛新華嚴經合論卷第五十二",
    "X04n0223_052:0352b20_0": "唐于闐國三藏沙門實叉難陀譯經",
    "X04n0223_052:0352b21_0": "唐太原方山長者李通玄造論",
    "X04n0223_052:0352b22_0": "唐福州開元寺沙門志寧釐經合論",
    "X04n0223_052:0352b23_0": "十迴向品第二十五之十一",
    "X04n0223_052:0352b24_0": "【論】第十等法界無量迴向以智波羅蜜為體表法以善財童子所見安住地神此是女神如此坤神分位在西南方又處中宮而治四季明處智行悲圓滿故其地神住摩竭國者是如來成道之國明此位昇進至中道同如來智悲圓滿位故摩竭國是此閻浮之中心是中宮位若隨當方有帝王所居處即是若隨位昇進修行中智悲圓滿行是若望迴向表位會融中前天神表智坤神表悲二位會融以成一位養含生之道成德化之門如百萬地神放大光明徧三千大千世界者以智行悲百萬行門慈光照燭徧也大地震吼者悲心感應也種種寶物處處莊嚴者明大悲行滿現業果報舉本位因果報得所嚴也廣釋至位方明又表智悲成滿可以說教利生須當其智如神其心如地載育萬物不以為勞如地能生能養能載終始不移焉二義如前第二長科當位者從初佛子已下至三十三卷中說頌已來長科為二十六段。",
    "X04n0223_052:0352c17_0": "【經】佛子云何為菩薩摩訶薩等法界無量迴向佛子此菩薩摩訶薩以離垢繒而繫其頂住法師位廣行法施起大慈悲安立眾生於菩提心常行饒益無有休息以菩提心長養善根為諸眾生作調御師示諸眾生一切智道為諸眾生作法藏日善根光明普照一切於諸眾生其心平等修諸善行無有休息心淨無染智慧自在不捨一切善根道業作諸眾生大智商主普令得入安隱正道為諸眾生而作導首令修一切善根法行為諸眾生作不可壞堅固善友令其善根增長成就。",
    "X04n0223_052:0353a03_0": "【論】第一佛子已下至令其善根增長成就有十一行經明此位菩薩智悲圓滿堪為法師施法利生分。",
    "X04n0223_052:0353a06_0": "【經】佛子此菩薩摩訶薩以法施為首發生一切清淨白法攝受趣向一切智心殊勝願力究竟堅固成就增益具大威德依善知識心無諂誑思惟觀察一切智門無邊境界以此善根如是迴向願得修習成就增長廣大無礙一切境界願得於佛正教之中乃至聽聞一句一偈受持演說願得憶念與法界等無量無邊一切世界去來現在一切諸佛既憶念已修菩薩行又願以此念佛善根為一眾生於一世界盡未來劫修菩薩行如於一世界盡法界虗空界一切世界皆亦如是如為一眾生為一切眾生亦復如是以善方便一一皆為盡未來劫大誓莊嚴終無離佛善知識想常見諸佛現在其前無有一佛出興於世不得親近一切諸佛及諸菩薩所讚所說清淨梵行誓願修行悉令圓滿所謂不破梵行不缺梵行不雜梵行無玷梵行無失梵行無能蔽梵行佛所讚梵行無所依梵行無所得梵行增益菩薩清淨梵行三世諸佛所行梵行無礙梵行無著梵行無諍梵行無滅梵行安住梵行無比梵行無動梵行無亂梵行無恚梵行。",
    "X04n0223_052:0353b01_0": "【論】第二佛子已下至無恚梵行有二十一行經明菩薩以法利生自修梵行分。",
    "X04n0223_052:0353b03_0": "【經】佛子菩薩摩訶薩若能為己修行如是清淨梵行則能普為一切眾生令一切眾生皆得安住令一切眾生皆得開曉令一切眾生皆得成就令一切眾生皆得清淨令一切眾生皆得無垢令一切眾生皆得照明令一切眾生離諸塵染令一切眾生無諸障翳令一切眾生離諸熱惱令一切眾生離諸纏縛令一切眾生永離諸惡令一切眾生無諸惱害畢竟清淨何以故菩薩摩訶薩自於梵行不能清淨不能令他而得清淨自於梵行而有退轉不能令他無有退轉自於梵行而有失壞不能令他無有失壞自於梵行而有遠離不能令他常不遠離自於梵行無有懈怠不能令他不生懈怠自於梵行不生信解不能令他心生信解自於梵行而不安住不能令他而得安住自於梵行而不證入不能令他心得證入自於梵行而有放捨不能令他恒不放捨自於梵行而有散動不能令他心不散動何以故菩薩摩訶薩住無倒行說無倒法所言誠實如說修行淨身口意離諸雜染住無礙行滅一切障菩薩摩訶薩自得淨心為他演說清淨心法自修和忍以諸善根調伏其心令他和忍以諸善根調伏其心自離疑悔亦令他人永離疑悔自得淨信亦令他得不壞淨信自住正法亦令眾生安住正法。",
    "X04n0223_052:0353c01_0": "【論】第三佛子已下至亦令眾生安住正法有二十五行經明菩薩自住梵行正法亦令他住梵行分。",
    "X04n0223_052:0353c03_0": "【經】佛子菩薩摩訶薩復以法施所生善根如是迴向所謂願我獲得一切諸佛無盡法門普為眾生分別解說皆令歡喜心得滿足摧滅一切外道異論願我能為一切眾生演說三世諸佛法海於一一法生起一一法義理一一法名言一一法安立一一法解說一一法顯示一一法門戶一一法悟入一一法觀察一一法分位悉得無邊無盡法藏獲無所畏具四辯才廣為眾生分別解說窮未來際而無有盡為欲令一切眾生立勝志願出生無礙無謬失辯為欲令一切眾生皆生歡喜為欲令一切眾生成就一切淨法光明隨其類音演說無斷為欲令一切眾生深信歡喜住一切智辯了諸法俾無迷惑作是念言我當普於一切世界為諸眾生精勤修習得徧法界無量自在身得徧法界無量廣大心具等法界無量清淨音聲現等法界無量眾會道場修等法界無量菩薩業得等法界無量菩薩住證等法界無量菩薩平等學等法界無量菩薩法住等法界無量菩薩行入等法界無量菩薩迴向是為菩薩摩訶薩以諸善根而為迴向為令眾生悉得成就一切智故。",
    "X04n0223_052:0353c22_0": "【論】第四佛子已下至悉得成就一切智故有二十二行經明如上法施所生善根迴向願得為一切眾生演說三世佛法入無礙辯及音聲無礙分。",
    "X04n0223_052:0354a01_0": "【經】佛子菩薩摩訶薩復以善根如是迴向所謂為欲見等法界無量諸佛調伏等法界無量眾生住持等法界無量佛剎證等法界無量菩薩智獲等法界無量無所畏成等法界無量諸菩薩陀羅尼得等法界無量諸菩薩不思議住具等法界無量功德滿等法界無量利益眾生善根又願以此善根故令我得福德平等智慧平等力平等無畏平等清淨平等自在平等正覺平等說法平等義平等決定平等一切神通平等如是等法皆悉圓滿如我所得願一切眾生亦如是得如我無異。",
    "X04n0223_052:0354a11_0": "【論】第五佛子已下至得如我無異有十一行經明菩薩令諸清淨以如上法施及迴向發願善根又迴向願見等法界如來出興於世調伏等法界無盡眾生分。",
    "X04n0223_052:0354a15_0": "【經】佛子菩薩摩訶薩復以善根如是迴向所謂如法界無量善根迴向亦復如是所得智慧終無有量如法界無邊善根迴向亦復如是見一切佛無有其邊如法界無限善根迴向亦復如是詣諸佛剎無有齊限如法界無際善根迴向亦復如是於一切世界修菩薩行無有涯際如法界無斷善根迴向亦復如是住一切智永不斷絕如法界一性善根迴向亦復如是與一切眾生同一智性如法界自性清淨善根迴向亦復如是令一切眾生究竟清淨如法界隨順善根迴向亦復如是令一切眾生悉皆隨順普賢行願如法界莊嚴善根迴向亦復如是令一切眾生以普賢行而為莊嚴如法界不可失壞善根迴向亦復如是令諸菩薩永不失壞諸清淨行。",
    "X04n0223_052:0354b04_0": "【論】第六佛子已下至永不失壞諸清淨行有十五行經明菩薩迴向善根如法界無量分。",
    "X04n0223_052:0354b06_0": "【經】佛子菩薩摩訶薩復以此善根如是迴向所謂願以此善根承事一切諸佛菩薩皆令歡喜願以此善根速得趣入一切智性願以此善根徧一切處修一切智願以此善根令一切眾生常得往覲一切諸佛願以此善根令一切眾生常見諸佛能作佛事願以此善根令一切眾生恒得見佛不於佛事生怠慢心願以此善根令一切眾生常得見佛心喜清淨無有退轉願以此善根令一切眾生常得見佛心善解了願以此善根令一切眾生常得見佛不生執著願以此善根令一切眾生常得見佛了達無礙願以此善根令一切眾生常得見佛成普賢行願以此善根令一切眾生常見諸佛現在其前無時暫捨願以此善根令一切眾生常見諸佛出生菩薩無量諸力願以此善根令一切眾生常見諸佛於一切法永不忘失。",
    "X04n0223_052:0354b20_0": "【論】第七佛子已下至於一切法永不忘失有十六行經明以法界等無量善根迴向願令一切眾生得見佛以清淨分。",
    "X04n0223_052:0354b23_0": "【經】佛子菩薩摩訶薩又以諸善根如是迴向所謂如法界無起性迴向如法界根本性迴向如法界自體性迴向如法界無依性迴向如法界無忘失性迴向如法界空無性迴向如法界寂靜性迴向如法界無處所性迴向如法界無遷動性迴向如法界無差別性迴向。",
    "X04n0223_052:0354c05_0": "【論】第八佛子已下至無差別性迴向有六行經明如法界性無起無遷迴向分。",
    "X04n0223_052:0354c07_0": "【經】佛子菩薩摩訶薩復以法施所有宣示所有開悟及因此起一切善根如是迴向所謂願一切眾生成菩薩法師常為諸佛之所護念願一切眾生作無上法師方便安立一切眾生於一切智願一切眾生作無屈法師一切問難莫能窮盡願一切眾生作無屈法師得一切法無礙光明願一切眾生作智藏法師能善巧說一切佛法願一切眾生成諸如來自在法師善能分別如來智慧願一切眾生作如眼法師說如實法不由他教願一切眾生作憶持一切佛法法師如理演說不違句義願一切眾生作修行無相道法師以諸妙相而自莊嚴放無量光善入諸法願一切眾生作大身法師其身普徧一切國土興大法雲雨諸佛法願一切眾生作護法藏法師建無勝幢護諸佛法令正法海無所缺減願一切眾生作一切法日法師得佛辯才巧說諸法願一切眾生作妙音方便法師善說無邊法界之藏願一切眾生作到法彼岸法師以智神通開正法藏願一切眾生作安住正法法師演說如來究竟智慧願一切眾生作了達諸法法師能說無量無盡功德願一切眾生作不誑世間法師能以方便令入實際願一切眾生作破諸魔眾法師善能覺知一切魔業願一切眾生作諸佛所攝受法師離我我所攝受之心願一切眾生作安隱一切世間法師成就菩薩說法願力。",
    "X04n0223_052:0355a06_0": "【論】第九佛子已下至成就菩薩說法願力有二十七行經明菩薩願如上法施迴向善根又願一切眾生得入佛法師位分。",
    "X04n0223_052:0355a09_0": "【經】佛子菩薩摩訶薩復以諸善根如是迴向所謂不以取著業故迴向不以取著報故迴向不以取著心故迴向不以取著法故迴向不以取著事故迴向不以取著因故迴向不以取著語言音聲故迴向不以取著名句文身故迴向不以取著迴向故迴向不以取著利益眾生故迴向。",
    "X04n0223_052:0355a15_0": "【論】第十佛子已下至不以取著利益眾生故迴向有六行經明以無取著以為迴向分。",
    "X04n0223_052:0355a17_0": "【經】佛子菩薩摩訶薩復以善根如是迴向所謂不為躭著色境界故迴向不為躭著聲香味觸法境界故迴向不為求生天故迴向不為求欲樂故迴向不為著欲境界故迴向不為求眷屬故迴向不為求自在故迴向不為求生死樂故迴向不為著生死故迴向不為樂諸有故迴向不為求和合樂故迴向不為求可樂著處故迴向不為懷毒害心故迴向不壞善根故迴向不依三界故迴向不著諸禪解脫三昧故迴向不住聲聞辟支佛乘故迴向但為教化調伏一切眾生故迴向但為成滿一切智智故迴向但為得無礙智故迴向但為得無障礙清淨善根故迴向但為令一切眾生超出生死證大智慧故迴向但為令大菩提心如金剛不可壞故迴向但為成就究竟不死法故迴向但為以無量莊嚴莊嚴佛種性示現一切智自在故迴向但為求菩薩一切法明大神通智故迴向但為於盡法界虗空界一切佛剎行普賢行圓滿不退被堅固大願鎧令一切眾生住普賢地故迴向但為盡未來劫度脫眾生常無休息示現一切智地無礙光明恒不斷故迴向。",
    "X04n0223_052:0355b12_0": "【論】第十一佛子已下至無礙光明恒不斷故迴向有二十二行經明不為世法不為二乘法但為令一切眾生入佛智故迴向分。",
    "X04n0223_052:0355b15_0": "【經】佛子菩薩摩訶薩以彼善根迴向時以如是心迴向所謂以本性平等心迴向以法性平等心迴向以一切眾生無量平等心迴向以無諍平等心迴向以自性無所起平等心迴向以知諸法無亂心迴向以入三世平等心迴向以出生三世諸佛種性心迴向以得不退失神通心迴向以生成一切智行心迴向又為令一切眾生永離一切地獄故迴向為令一切眾生不入畜生趣故迴向為令一切眾生不往閻羅王處故迴向為令一切眾生除滅一切障道法故迴向為令一切眾生滿足一切善根故迴向為令一切眾生能應時轉法輪令一切歡喜故迴向為令一切眾生入十力輪故迴向為令一切眾生滿足菩薩無邊清淨法願故迴向為令一切眾生隨順一切善知識教菩提心器得滿足故迴向為令一切眾生受持修行甚深佛法得一切佛智光明故迴向為令一切眾生修諸菩薩無障礙行常現前故迴向為令一切眾生常見諸佛現其前故迴向為令一切眾生清淨法光明常現前故迴向為令一切眾生無畏大菩提心常現前故迴向為令一切眾生菩薩不思議智常現前故迴向為令一切眾生普救護眾生令清淨大悲心常現前故迴向為令一切眾生以不可說不可說勝妙莊嚴具莊嚴一切諸佛剎故迴向為令一切眾生摧滅一切眾魔鬬諍羅網業故迴向為令一切眾生於一切佛剎皆無所依修菩薩行故迴向為令一切眾生發一切種智心入一切佛法廣大門故迴向。",
    "X04n0223_052:0355c17_0": "【論】第十二佛子已下至入佛廣大門故迴向有二十九行半經明菩薩以如上迴向一切善根但令一切眾生離苦得樂成大菩提分。",
    "X04n0223_052:0355c20_0": "【經】佛子菩薩摩訶薩又以此善根正念清淨迴向智慧決定迴向盡知一切佛法方便迴向為成就無量無礙智故迴向為欲滿足清淨殊勝心故迴向為一切眾生住大慈故迴向為一切眾生住大悲故迴向為一切眾生住大喜故迴向為一切眾生住大捨故迴向為永離二著住勝善根故迴向為思惟觀察分別演說一切緣起法故迴向為立大勇猛幢心故迴向為立無能勝幢藏故迴向為破諸魔眾故迴向為得一切法清淨無礙心故迴向為修一切菩薩行不退轉故迴向為得樂求第一勝法心故迴向為得樂求諸功德法自在清淨一切智智心故迴向為滿一切願除一切諍得佛自在無礙清淨法為一切眾生轉不退法輪故迴向為得如來最上殊勝法智慧日百千光明之所莊嚴普照一切法界眾生故迴向為欲調伏一切眾生隨其所樂常令滿足不捨本願盡未來際聽聞正法修習大行得淨智慧離垢光明斷除一切憍慢消滅一切煩惱裂愛欲網破愚癡闇具足無垢無障礙法故迴向為一切眾生於阿僧祇劫常勤修習一切智行無有退轉一一令得無礙妙慧示現諸佛自在神通無有休息故迴向。",
    "X04n0223_052:0356a16_0": "【論】第十三佛子已下至無有休息故迴向有二十三行經明自在神通無有休息明以如上等善根迴向為一切眾生住大慈大悲大喜大捨及離二種著成滿佛智慧分二種著者著有著無是非自他彼此內外能所都為二。",
    "X04n0223_052:0356a21_0": "【經】佛子菩薩摩訶薩以諸善根如是迴向時不應貪著三有五欲境界何以故菩薩摩訶薩應以無貪善根迴向應以無瞋善根迴向應以無癡善根迴向應以不害善根迴向應以離慢善根迴向應以不諂善根迴向應以質直善根迴向應以精勤善根迴向應以修習善根迴向。",
    "X04n0223_052:0356b03_0": "【論】第十四佛子已下至應以修習善根迴向有六行經明菩薩如是迴向時於三有中所有五欲境界不應貪著以無貪瞋癡善根故修習善根分。",
    "X04n0223_052:0356b06_0": "【經】佛子菩薩摩訶薩如是迴向時得淨信心於菩薩行歡喜忍受修習清淨大菩薩道具佛種性得佛智慧捨一切惡離眾魔業親近善友成己大願請諸眾生設大施會。",
    "X04n0223_052:0356b10_0": "【論】第十五佛子已下至設大施會有四行經明菩薩捨惡成善離眾魔業設法施會分。",
    "X04n0223_052:0356b12_0": "【經】佛子菩薩摩訶薩復以此法施所生善根如是迴向所謂令一切眾生得淨妙音得柔軟音得天鼓音得無量無數不思議音得可愛樂音得清淨音得周徧一切佛剎音得百千那由他不可說功德莊嚴音得高遠音得廣大音得滅一切散亂音得充滿法界音得攝取一切眾生語言音得一切眾生無邊音聲智得一切清淨語言音聲智得無量語言音聲智得最自在音入一切音聲智得一切清淨莊嚴音得一切世間無厭足音得究竟不繫屬一切世間音得歡喜音得佛清淨語言音得說一切佛法遠離癡翳名稱普聞音得令一切眾生得一切法陀羅尼莊嚴音得說一切無量種法音得普至法界無量眾會道場音得普攝持不可思議法金剛句音得開示一切法音得能說不可說字句差別智藏音得演說一切法無所著不斷音得一切法光明照耀音得能令一切世間清淨究竟至於一切智音得普攝一切法句義音得神力護持自在無礙音得到一切世間彼岸智音又以此善根令一切眾生得不下劣音得無怖畏音得無染著音得一切眾會道場歡喜音得隨順美妙音得善說一切佛法音得斷一切眾生疑念皆令覺悟音得具足辯才音得普覺悟一切眾生長夜睡眠音。",
    "X04n0223_052:0356c10_0": "【論】第十六佛子已下至覺悟一切眾生長夜睡眠音有二十五行經明菩薩自得無礙音聲普徧願令一切眾生音聲圓滿分。",
    "X04n0223_052:0356c13_0": "【經】佛子菩薩摩訶薩復以諸善根如是迴向所謂願一切眾生得離眾過惡清淨法身願一切眾生得離眾過惡淨妙功德願一切眾生得離眾過惡清淨妙相願一切眾生得離眾過惡清淨業果願一切眾生得離眾過惡清淨一切智心願一切眾生得離眾過惡無量清淨菩提心願一切眾生得離眾過惡了知諸根清淨方便願一切眾生得離眾過惡清淨信解願一切眾生得離眾過惡清淨勤修無礙行願願一切眾生得離眾過惡清淨正念智慧辯才。",
    "X04n0223_052:0356c22_0": "【論】第十七佛子已下至正念智慧辯才有十行半經明願一切眾生得離過惡得清淨分。",
    "X04n0223_052:0356c24_0": "【經】佛子菩薩摩訶薩復以諸善根為一切眾生如是迴向願得種種清淨妙身所謂光明身離濁身無染身清淨身極清淨身離塵身極離塵身離垢身可愛樂身無障礙身於一切世界現諸業像於一切世間現言說像於一切宮殿現安立像如淨明鏡種種色像自然顯現示諸眾生大菩提行示諸眾生甚深妙法示諸眾生種種功德示諸眾生修行之道示諸眾生成就之行示諸眾生菩薩行願示諸眾生於一世界一切世界佛興於世示諸眾生一切諸佛神通變化示諸眾生一切菩薩不可思議解脫威力示諸眾生成滿普賢菩薩行願一切智性菩薩摩訶薩以如是等微妙淨身方便攝取一切眾生悉令成就清淨功德一切智身。",
    "X04n0223_052:0357a13_0": "【論】第十八佛子已下至一切智身有十四行半經明菩薩以如上善根迴向願得清淨智身分。",
    "X04n0223_052:0357a15_0": "【經】佛子菩薩摩訶薩復以法施所生善根如是迴向願身隨住一切世界修菩薩行眾生見者皆悉不虗發菩提心永無退轉順真實義不可傾動於一切世界盡未來劫住菩薩道而無疲厭大悲均普量同法界知眾生根應時說法常不休息於善知識心常正念乃至不捨一剎那頃一切諸佛常現在前心常正念未曾暫懈修諸善根無有虗偽置諸眾生於一切智令不退轉具足一切佛法光明持大法雲受大法雨修菩薩行入一切眾生入一切佛剎入一切諸法入一切三世入一切眾生業報智入一切菩薩善巧方便智入一切菩薩出生智入一切菩薩清淨境界智入一切佛自在神通入一切無邊法界於此安住修菩薩行。",
    "X04n0223_052:0357b04_0": "【論】第十九佛子已下至安住修菩薩行有十四行經明菩薩法施善根如是迴向願隨住一切剎無有休息見者獲益分已上十九段明法施迴向善根饒益自他行門分已下三十三卷中明莊嚴佛剎迴向分此等法界無量迴向中通此三十二三十三兩卷經。",
    "X04n0223_052:0357b10_0": "【經】佛子菩薩摩訶薩復以法施所修善根如是迴向願一切佛剎皆悉清淨以不可說不可說莊嚴具而莊嚴之一一佛剎其量廣大同於法界純善無礙清淨光明諸佛於中現成正覺一佛剎中清淨境界悉能顯現一切佛剎如一佛剎一切佛剎亦復如是其一一剎悉以等法界無量無邊清淨妙寶莊嚴之具而為嚴飾所謂阿僧祇清淨寶座敷眾寶衣阿僧祇寶帳寶網垂布阿僧祇寶蓋一切妙寶互相映徹阿僧祇寶雲普雨眾寶阿僧祇寶華周徧清淨阿僧祇眾寶所成欄楯軒檻清淨莊嚴阿僧祇寶鈴常演諸佛微妙音聲周流法界阿僧祇寶蓮華種種寶色開敷榮耀阿僧祇寶樹周帀行列無量妙寶以為華果阿僧祇寶宮殿無量菩薩止住其中阿僧祇寶樓閣廣博崇麗延袤遠近阿僧祇寶却敵大寶所成莊嚴妙好阿僧祇寶門闥妙寶纓絡周帀垂布阿僧祇寶窻牖不思議寶清淨莊嚴阿僧祇寶多羅形如半月眾寶集成如是一切悉以眾寶而為嚴飾離垢清淨不可思議無非如來善根所起具足無數寶藏莊嚴復有阿僧祇寶河流出一切清淨善法阿僧祇寶海法水盈滿阿僧祇寶芬陀利華常出妙法芬陀利聲阿僧祇寶須彌山智慧山王秀出清淨阿僧祇八楞妙寶寶線貫穿嚴淨無比阿僧祇淨光寶常放無礙大智光明普照法界阿僧祇寶鈴鐸更相扣擊出妙音聲阿僧祇清淨寶諸菩薩寶具足充滿阿僧祇寶繒綵處處垂下色相光潔阿僧祇妙寶幢以寶半月而為嚴飾阿僧祇寶幡悉能普雨無量寶幡阿僧祇寶帶垂布空中莊嚴殊妙阿僧祇寶敷具能生種種微細樂觸阿僧祇妙寶旋示現菩薩一切智眼阿僧祇寶纓絡一一纓絡百千菩薩上妙莊嚴阿僧祇寶宮殿超過一切妙絕無比阿僧祇寶莊嚴具金剛摩尼以為嚴飾阿僧祇種種妙寶莊嚴具常現一切清淨妙色阿僧祇清淨寶殊形異彩光鑒映徹阿僧祇寶山以為垣牆周帀圍遶清淨無礙阿僧祇寶香其香普熏一切世界阿僧祇寶化事一一化事周徧法界阿僧祇寶光明一一光明現一切光復有阿僧祇寶光明清淨智光照了諸法復有阿僧祇無礙寶光明一一光明周徧法界有阿僧祇寶處一切諸寶皆悉具足阿僧祇寶藏開示一切正法藏寶阿僧祇寶幢如來幢相迥然高出阿僧祇寶賢大智賢像具足清淨阿僧祇寶園生諸菩薩三昧快樂阿僧祇寶音如來妙音普示世間阿僧祇寶形其一一形皆放無量妙法光明阿僧祇寶相其一一相悉超眾相阿僧祇寶威儀見者皆生菩薩喜樂阿僧祇寶聚見者皆生智慧寶聚阿僧祇寶安住見者皆生善住寶心阿僧祇寶衣服其有著者生諸菩薩無比三昧阿僧祇寶袈裟其有著者纔始發心則得善見陀羅尼門阿僧祇寶修習其有見者知一切寶皆是業果決定清淨阿僧祇寶無礙知見其有見者得了一切清淨法眼阿僧祇寶光藏其有見者則得成就大智慧藏阿僧祇寶座佛坐其上大師子吼阿僧祇寶燈常放清淨智慧光明阿僧祇寶多羅樹次第行列繚以寶繩莊嚴清淨其樹復有阿僧祇寶幹從身聳擢端直圓潔阿僧祇寶枝種種眾寶莊嚴稠密不思議鳥翔集其中常吐妙音宣揚正法阿僧祇寶葉放大智光徧一切處阿僧祇寶華一一華上無量菩薩結跏趺坐徧遊法界阿僧祇寶果見者當得一切智智不退轉果阿僧祇寶聚落見者捨離世聚落法阿僧祇寶都邑無礙眾生於中盈滿阿僧祇寶宮殿王處其中具足菩薩那羅延身勇猛堅固被法甲冑心無退轉阿僧祇寶舍入者能除戀舍宅心阿僧祇寶衣著者能令解了無著阿僧祇寶宮殿出家菩薩充滿其中阿僧祇寶珍玩見者咸生無量歡喜阿僧祇寶輪放不思議智慧光明轉不退輪阿僧祇寶跋陀樹因陀羅網莊嚴清淨阿僧祇寶地不思議寶間錯莊嚴阿僧祇寶吹其音清亮充滿法界阿僧祇寶鼓妙音克諧窮劫不絕阿僧祇寶眾生盡能攝持無上法寶阿僧祇寶身具足無量功德妙寶阿僧祇寶口常演一切妙法寶音阿僧祇寶心具清淨意大智願寶阿僧祇寶念斷諸愚惑究竟堅固一切智寶阿僧祇寶明誦持一切諸佛法寶阿僧祇寶慧決了一切諸佛法藏阿僧祇寶智得大圓滿一切智寶阿僧祇寶眼鑒十方寶無所障礙阿僧祇寶耳聽聞無量盡法界聲清淨無礙阿僧祇寶鼻常齅隨順清淨寶香阿僧祇寶舌能說無量諸語言法阿僧祇寶身徧遊十方而無罣礙阿僧祇寶意常勤修習普賢行願阿僧祇寶音淨妙音聲徧十方界阿僧祇寶身業一切所作以智為首阿僧祇寶語業常說修行無礙智寶阿僧祇寶意業得無障礙廣大智寶究竟圓滿。",
    "X04n0223_052:0358b16_0": "【論】第二十佛子已下至廣大智寶究竟圓滿有三紙半經明以如上法施功德寶迴向莊嚴無量佛剎皆令清淨分如第二十段以法施善根迴向莊嚴佛剎中此是願力莊嚴有義隱者釋之可知者如文如延袤言樓閣相連延長無限寶牕牖者大曰牕小曰牖寶多羅形如半月者是西域樹名如此椶櫚樹以寶為體以半月寶用嚴其樹不可言樹形如半月無非如來善根所起者以願力如佛善根所起莊嚴而用莊嚴佛國土故阿僧祇寶海法水盈滿者言水說法阿僧祇寶芬陀利華常出妙法芬陀利聲此是百葉白蓮華也還能出百種音聲說百種法故阿僧祇寶須彌山智慧山王秀出清淨者明以願智慧業超勝報得出過餘法名秀出能清眾業名清淨須彌云妙高山名為止以艮為山為止王者自在也明以止其心心即淨故若心淨即智慧妙用自在故故報得其山亦如是故因果相似故阿僧祇八楞妙寶寶線貫穿嚴淨無比者明八正道之報得寶線者教也以名言竹帛而貫之令法無散失故以成果報也菩薩寶者如菩薩形約行報得阿僧祇寶旋示現菩薩智眼約無礙智報得為以一智中知無盡法門以深幽無極名之為旋阿僧祇宮殿者悲宮智殿報相嚴也鑒者照徹也寶山垣牆者以止為防護報得故阿僧祇寶化事者此寶能化作種種事法此約以一智行萬行報得也寶藏見示一切正法是一切種種之智藏報得故如來幢相迥然高出者有寶似佛形像而立莊嚴國土明真如智幢不傾動報得也阿僧祇寶賢大智賢像具足其寶似賢人形狀有賢人之相約自賢而報生也寶園生諸菩薩三昧快樂者明以三昧為園林之報得故寶音者以音聲為寶非有形質也寶形者以種種寶作種種形故寶相者以寶為相好故寶威儀者以寶作菩薩威儀庠序故寶聚見者皆生智慧聚明以智慧聚報得故寶住者以智境界現作菩薩十住之位寶修習者以寶為修習法門次第見者知一切寶皆是業此是識業寶也寶無礙知見者以寶為無礙知見見者得清淨法眼約淨智無礙所生也寶多羅樹此樹似椶櫚堅如鐵葉長稠密設多時大雨如屋常乾如此經所說約以寶為體非如西域人間木樹也其樹無枝處為身身直上者為榦榦上傍生者為枝枝上細者為條王都及聚落總是約大願行化作莊嚴佛剎跋陀羅樹者此名賢以樹下有賢人居又樹出賢才其上有帝釋寶網莊嚴也寶吹者能出音寶如螺貝之形其聲清亮者清朗也寶鼓妙音克諧窮劫不絕者克者能也諧者和也言音韻和雅曲調無比阿僧祇寶生以寶能生種種法寶亦眾生能發心為寶也寶身者明以寶為種種之身也寶口者以寶為口形能演法音故寶心者以寶為心之形具足意業及大智願寶大意已下如上以因果相似解之其中可解之事如文自具大綱以果知所因如上莊嚴皆大願興行所成如華藏世界皆由普賢願力起明因願起行故寶身業語業意業以寶為三業從自三業起行立譚詮思惟去就以心寶為之。",
    "X04n0223_052:0359a23_0": "大方廣佛新華嚴經合論卷第五十二"
}