{
    "X11n0269_001:0705a03_0": "首楞嚴經集解熏聞記卷第一",
    "X11n0269_001:0705a05_0": "吳興沙門　仁岳　述",
    "X11n0269_001:0705a06_0": "　歸命如來藏　　顯祕修多羅　　教主釋迦文　塵剎遍知者　　文殊阿難等　　菩薩賢聖僧　惟以無緣慈　　證明及加護　　誰昔諸法師　疏茲首楞義　　而我甞撰集　　授彼持經人　注釋或未詳　　流通猶寡益　　是故今覆述　助發于來蒙　　願同觀世音　　熏聞成正覺解說首題已如別卷今釋經文文句分三一序分二正宗分三流通分初東晉安法師立此三分判釋眾經至有唐奘法師譯佛地論而西域親光菩薩判佛地經果有三分一教起因緣分二聖教所說分三依教奉行分乃與序正流通辭異義同則知安師所立冥符親光之說也今經從如是我聞至提獎阿難及摩登伽歸來佛所為序分阿難見佛至第九卷若他說者即魔王說為正宗分即時如來將罷法座下為流通分。",
    "X11n0269_001:0705a21_0": "就序分中復分為二一從如是至文殊師利而為上首為證信序二從時波斯匿王下為發起序此二亦名通序別序通序通諸教別序別一經且初證信序者言如是等令聞者不疑故涅槃後分云佛垂涅槃阿難問佛如來滅後結集法藏一切經初安何等語佛言當安如是我聞一時佛住某方某處與諸四眾而說是經智度論云三世諸佛經初皆稱如是語準興福釋經序文為六一指所聞法二敘能聞人三陳說教時四標垂化主五彰演法處六述同聞眾資中以此六事合為二門一說經時處二引眾同聞至于長水亦復承用今謂合前五事以為一門於義太略處中而判當分三句一傳法時二感佛處三同聞眾初傳法時者謂如是我聞一時也智論亦將此六字作一章釋之今故例彼原夫晉魏以前譯經多云聞如是或曰我聞如是至後秦羅什翻法華經云如是我聞自此相沿以為定式。",
    "X11n0269_001:0705b12_1": "▲注孤山者圓師所居也向下真際長水等皆以處目人具如說題出其疏鈔。",
    "X11n0269_001:0705b14_0": "▲所傳之法者謂結集家傳佛能詮所詮之法也能詮之文與佛不異故曰如所詮之理無非真實故曰是又文如其理故云如理如其文故云是然理通四教則如是之法偏圓不同具如天台諸經疏分別其相今簡偏取圓唯一如來藏心是經法體部屬開顯講者悉之。",
    "X11n0269_001:0705b19_1": "▲能傳之人者阿難自謂也智論問曰佛法中言一切法空無有吾我云何佛經初言如是我聞答曰佛弟子輩雖知無我隨俗法說我非實我也聞者耳根不破聲至可聞處作意欲聞根塵意和合得聞也孤山約四教義明四種我聞一我我聞聞二我無我聞不聞三無我我不聞聞四非我非無我不聞不聞前三種我聞是昔所聞方便之義後一我聞是今正意末學膚受以廣為煩故集解銷文從略而示也。",
    "X11n0269_001:0705c03_2": "▲會機會理之時者孤山谷響鈔云會合也謂今楞嚴之教下合現未之機故曰會機上合常住真心故曰會理機理會合一義在茲。",
    "X11n0269_001:0705c05_3": "▲如是之經我從佛聞者依事相釋也通慧生信鈔云如是等者乃是阿難領諾迦葉舉問之辭能舉發人以曾聞之法言之即經題也豈無句逗數字耶反至所答之義且總而領會不牒其繁辭故云如是若今人之談說領前人意則云如此同也故佛地論曰如是我聞者謂總顯已聞傳佛教者言如是事我昔曾聞也說教時者通指經竟為一時也如涅槃中佛言我往一時在恒河岸又云我於一時在迦尸國等其事同焉。",
    "X11n0269_001:0705c14_0": "二佛在下感佛處注梵語等亦真際疏也經文雖隔解者未異則不標目他皆效此。",
    "X11n0269_001:0705c15_1": "▲佛地論下彼文具云具一切智一切種智離煩惱障及所知障於一切法一切種相能自開覺亦能開覺一切有情如睡夢覺如蓮華開故名為佛應知一切智一切法者真諦智境也一切種智一切種相者俗諦智境也以照真故離煩惱障能自開覺以照俗故離所知障能覺一切有情如睡夢覺如蓮華開者總譬二智覺了之義也又夢覺喻真智一物叵得故華開喻俗智具見諸相故在者住也者或曰暫居名在久停為住今依天台諸疏在即是住智論云四種身儀皆名為住又為恐怖魔軍令弟子歡喜入種種禪定故於中住。",
    "X11n0269_001:0706a07_2": "▲以佛內住首楞嚴者論明四種住義一天住謂布施持戒善心也二梵住謂慈悲喜捨四無量心乃至悲想天因也三聖住謂空無相無作三三昧也四佛住謂首楞嚴等百八三昧力無畏等八萬四千度人法門也佛雖住定示同人法行住坐臥四儀宛然斯由自受用身內冥法性外應羣品故曰能建大義。",
    "X11n0269_001:0706a13_3": "▲迹住者迹以對本為名約土言之則本住寂光迹居堪忍也。",
    "X11n0269_001:0706a15_4": "▲中印度如說題憍薩羅國都城之號者擕李證真鈔云為簡南憍薩羅國故廢國名而標城號。",
    "X11n0269_001:0706a16_5": "▲貨財者蔡氏化清經曰貨者化也變化反易之物故字有化也。",
    "X11n0269_001:0706a18_6": "▲欲境者謂五塵境生人須欲之心故。",
    "X11n0269_001:0706a18_7": "▲多聞者義淨三藏譯舍衛為名稱但得其一耳。",
    "X11n0269_001:0706a19_8": "▲能脫者謂出家斷結之士也。",
    "X11n0269_001:0706a20_9": "▲祇桓者長水云具云祇陀此云戰勝即太子名桓即林也今謂以桓為林非也案西域記並應法師音義並云祇洹訛也正言逝多此云勝氏若言林者梵云婆那故知桓字與洹不殊。",
    "X11n0269_001:0706a24_0": "▲須達市園者具云須達多此云給孤獨亦曰善施市猶買也西域記云給孤獨長者聞佛功德深生尊敬願建精舍請佛降臨佛命舍利子膽揆唯太子逝多園地爽塏尋詣太子具以情告太子戲言金徧乃賣善施聞之心豁如也即出藏金隨言布地有少未滿太子請留白佛此誠良田宜植善種即於空地建立精舍世尊即之告阿難曰園地善施所買林樹逝多所施二人同心式崇功業自今已去應謂此地為逝多樹給孤獨園。",
    "X11n0269_001:0706b09_0": "三同聞眾有二一聲聞眾二辟支眾法華論明先列聲聞者為顯親聞後不謗故又攝不定性迴心入大故乃至云令菩薩敬故地論大同應知兩論皆五性宗並言不定性迴心耳今經顯示定性皆獲一乘反驗彼宗權說明矣。",
    "X11n0269_001:0706b14_0": "初聲聞眾又三一標類。",
    "X11n0269_001:0706b14_1": "▲經與大比丘眾與猶共也智論約七義釋共謂一處一時一心一戒一見一道一解脫是名為共阿難與眾同茲七義故也。",
    "X11n0269_001:0706b16_2": "▲梵語摩訶此云大或曰多或言勝天王等大人所敬故大也數至千二百五十人故多也能破九十六種論議故勝也。",
    "X11n0269_001:0706b19_3": "▲注比丘含三義謂清淨活命故名乞士能斷煩惱故名破惡當剃髮至受戒時魔王言是人必得涅槃故名怖魔由此因中三名能成果上三號即下文阿羅漢三義也由乞士因成應供果由破惡因成殺賊果由怖魔因成無生果四人以上為眾者梵云僧伽此言和合眾以說戒事四人能辦故多人可知。",
    "X11n0269_001:0706c01_4": "▲三迦葉者一優樓頻蠡迦葉二伽耶迦葉三那提迦葉具如第五卷注兄有五百弟子二弟各二百五十共一千人。",
    "X11n0269_001:0706c03_5": "▲先並事火者如此經云諸迦葉波並婆羅門勤心役身事火崇水求出生死者是也。",
    "X11n0269_001:0706c04_6": "▲翻邪入正者法華疏記具明如來作十種神變化優樓頻蠡師徒皆伏得沙門果並以術具投之於水隨流而下二弟并五百弟子見之亦皆歸佛云云。",
    "X11n0269_001:0706c07_7": "▲內冥中道者約開權後說下歎德文備矣。",
    "X11n0269_001:0706c08_8": "▲準涅槃下彼經迦葉菩薩問佛云何得廣大為眾作依止等佛以四依一品答之文云有四種人能護正法為世所依即四果人也又曰第四果人名阿羅漢斷諸煩惱住第十地得自在智隨人所樂種種色像悉能示現今孤山意謂諸大眾皆是從十地之本示四果之迹蓋從多分而說也其間必有適蒙開權如入初住者如法華中三周得記豈無其人乎。",
    "X11n0269_001:0706c16_0": "二佛子下歎德。",
    "X11n0269_001:0706c16_1": "▲注開權發迹者如云開方便門示真實相決了聲聞法是諸經之王即開權之文也又云知眾樂小法而畏於大智是故諸菩薩作聲聞緣覺此發迹之文也。",
    "X11n0269_001:0707a01_2": "▲從佛口生者聞能詮聲教也。",
    "X11n0269_001:0707a01_3": "▲從法化生者悟所詮實理也由茲教理故法身慧命於是而生初住分真能百界作佛八相利物故曰得佛法分。",
    "X11n0269_001:0707a04_4": "▲堪紹佛種安住下釋住義三德祕藏謂法身般若解脫名祕密之藏。",
    "X11n0269_001:0707a05_5": "▲住持下釋持義如八萬四千陀羅尼門即總持善法也。",
    "X11n0269_001:0707a06_6": "▲二十五有者謂四洲四惡趣六欲並梵天四禪四空處無想五那含云云涅槃明二十五王三昧破二十五有初用無垢三昧破地獄有乃至用我三昧破非想有所言王三昧者智者云空假未得為王中道調真故得稱王。",
    "X11n0269_001:0707a10_7": "▲經能於國土成就威儀者前超諸有即上合十方諸佛本妙覺心也今成威儀即下合十方一切六道眾生也。",
    "X11n0269_001:0707a13_8": "▲注有威下左傳曰有威而可畏謂之威有儀而可象謂之儀又曰君有君之威儀其臣畏而愛之則而蒙之故能有其國家令聞長世臣有臣之威儀其下畏而愛之故能守其官職保族宜家令聲聞有聲聞威儀令出家者畏而象之故能從佛轉輪妙堪遺囑等。",
    "X11n0269_001:0707a18_9": "▲所謂下引淨名文顯不思議用也智者云聲聞入定不能現四威儀如迦葉入定至彌勒出世方乃現變不思議定有體有用故能不起現諸威儀如修羅琴隨人吐韻。",
    "X11n0269_001:0707a21_10": "▲法有摧碾煩惱義者以佛教法轉入他心復由行法乃能摧惑故法華疏以教為能轉行為所轉能所和合方得輪名。",
    "X11n0269_001:0707a23_11": "▲見佛始卒者始鹿苑終鶴林亦約多分為言如身子目連先佛入滅則不至涅槃然今經云最後垂範已有遺囑之意如下文所引。",
    "X11n0269_001:0707b02_12": "▲乃至迦葉阿難等來者谷響云于時迦葉在靈鷲山入滅受想定至佛滅後始來阿難在娑羅林外為魔所罥至佛垂滅方來。",
    "X11n0269_001:0707b04_13": "▲毗尼云律者谷響云律銓也詮量輕重犯不犯等稟之則出生死者遺教云依因此戒得生諸禪定及滅苦智慧。",
    "X11n0269_001:0707b06_14": "▲普現色身等如觀音說圓通中。",
    "X11n0269_001:0707b07_15": "▲今從部意正為末者即前遺囑下法意是也又如阿難云我雖未度願度末劫一切眾生阿難既然諸皆可識。",
    "X11n0269_001:0707b10_0": "三其名下列名。",
    "X11n0269_001:0707b10_1": "▲注或尚年臘者如下文憍陳那云我在鹿苑及於雞園觀見如來最初成道於佛音聲悟明四諦臘者歲終祭祀之名也風俗通云夏曰嘉平殷曰清祀周曰大[示*昔]漢曰臘臘獵也獵取禽獸祭先祖也或云臘者接也新故交接也故經律中謂七月十五日為佛臘日蓋取其義。",
    "X11n0269_001:0707b15_2": "▲或尚聲德者如下文引增一是也身子八歲為國論師聲震五竺。",
    "X11n0269_001:0707b16_3": "▲鶖或作[步*鳥]玉篇云水鳥也。",
    "X11n0269_001:0707b17_4": "▲鷺爾雅云舂鉏郭璞云白鷺也。",
    "X11n0269_001:0707b18_5": "▲菽者楊泉物理論云豆之總名。",
    "X11n0269_001:0707b18_6": "▲苗裔者說文云裔衣裾也應法師云以子孫為苗裔者取下垂義。",
    "X11n0269_001:0707b20_7": "▲舍利弗舅氏者法華疏云初論勝於娣娣孕論則不勝知所懷者智人也寄辯尚爾何況出胎即棄家往南天竺讀十八經時人笑云累世難通一生非冀喟然歎曰在家為娣所勝出路為他所輕誓讀不休無暇翦爪時人呼為長爪梵志學訖還家問甥所在遂往佛所思惟良久不得一法入心語佛言一切法不忍忍即安義此言一切法我皆能破使不得安佛問汝見是忍不此墮兩負處若我見忍前已云一切不忍若我見不忍無以勝佛即時低頭得法眼淨。",
    "X11n0269_001:0707c05_0": "▲滿慈子者從父母兩緣得名或云滿願子支謙譯度無極經名滿祝子謂父於滿江禱梵天而得其子又祝與呪同故楊子曰螟蠕之子殪而逢蜾蠃祝之是也此單從父緣立稱也既善且吉者谷響云既已也且兼也亦名善現等應知善相不唯空物亦能感物故譬喻經云舍衛國長者名鳩留產生一子字須菩提有然福報食器皆空所欲皆滿然則空非斷無表妙有之不亡也。",
    "X11n0269_001:0707c12_1": "▲以觀塵性空得道者下文說圓通云我亦觀佛最初成道觀不淨相生大厭離悟諸色性以從不淨白骨微塵歸於虗空空色二無成無學道如來印我名尼沙陀。",
    "X11n0269_001:0707c16_0": "二復有下辟支眾。",
    "X11n0269_001:0707c16_1": "▲經並其初心興福云初發大乘心也準下文云及諸新發心菩薩其數凡有十恒河沙證此初心誠然是大又云或緣覺初心上標無學下列初心證未俱來表盡迴心入大今秪取後解何則既云並其初心即指緣覺而為其也指第六卷發心為證殊不相應。",
    "X11n0269_001:0708a03_2": "▲注此是部行遇佛迴向者意謂部行緣覺出有佛世唯是獨覺出無佛世耳麟喻者名出俱舍說文云麒麟仁獸也爾雅云麟麇身牛尾一角(麟與麟同)又春秋感精符曰麟一角明海內共一主也獨覺亦爾大千唯一故以為喻。",
    "X11n0269_001:0708a07_3": "▲觀十二因緣者如法界次第此十二法展轉能感於果故名因互相由藉而有故名緣。",
    "X11n0269_001:0708a09_4": "▲無師自悟者觀華飛葉落等悟無常空也。",
    "X11n0269_001:0708a10_5": "▲大權引實者以法身大士應為辟支引接實行之人同來佛所也。",
    "X11n0269_001:0708a11_6": "▲私謂者蒼頡篇單作厶取自營之義若從禾者不公曰私乃興自營左右之異故章安荊谿凡撰集一家教文有自說者並云私謂今亦傚之。",
    "X11n0269_001:0708a14_7": "▲經家者即結集人也。",
    "X11n0269_001:0708a14_8": "▲況部行亦出無佛世者法華疏云部行緣覺在無佛世師徒化訓是也然則沇師之說誤矣。",
    "X11n0269_001:0708a16_9": "▲已上止集聲聞辟支二眾者谷響云菩薩眾別序備矣即經云恒沙菩薩來聚道場是也所以不列雜眾者且事起自恣非俗眾所參是故但有三乘僧也至齋畢旋歸王及大臣長者居士俱來隨佛願聞法要事在明日故有俗眾。",
    "X11n0269_001:0708a21_0": "二屬諸下發起序為二一通緣二別緣初又二一休夏敷經。",
    "X11n0269_001:0708a22_1": "▲注自恣律開三日四分云安居竟自恣則七月十六日為定又云僧十四日自恣尼十五日自恣南山云此謂相依問罪故制異日及論作法三日通用克定一期十六日定若有難者如五百問中一月日自恣鮮能自訟者谷響云鮮少也訟責也恣僧舉過者南山云縱宣己罪恣僧舉過內彰無私隱外顯有瑕疵身口託於他人故曰自恣。",
    "X11n0269_001:0708b04_2": "▲經十方菩薩尋謂自恣後十方菩薩亦來佛所也慤沇節三疏從此至文殊師利而為上首判在通序列眾之中孤山長水皆判屬別序今取後義。",
    "X11n0269_001:0708b07_3": "▲注大論下文出第五又四十九云菩提秦言無上智慧薩埵名大心為無上智慧故求大心也。",
    "X11n0269_001:0708b09_4": "▲欲請楞嚴之祕說者資中長水亦同此解是則菩薩知機知應專為此經而來今更釋之。",
    "X11n0269_001:0708b11_5": "▲言密義者且通指大乘法要耳謂恣決心疑之外方將更求大乘微密之義也下文為諸會中宣示深奧即詶其請深奧非密義乎。",
    "X11n0269_001:0708b13_6": "▲經敷座宴安者前自恣文雖曰比丘必兼於佛自恣屬戒宴安是定宣示為慧聖人應物垂範則三學存焉問處何經律知佛自恣答增一云如來同僧坐於草座告諸比丘我欲受歲又新歲經云佛自叉手向諸比丘悔過等云云。",
    "X11n0269_001:0708b18_7": "▲注亦猶下谷響云無量義則開為合序以經先談從一清淨道開出二道三法四果是故法華合為一道若普集經則正為依序以彼先說佛身之正報是故淨名示佛國之依報。",
    "X11n0269_001:0708b21_8": "▲迦陵頻伽者應法師云此鳥本出雪山在[穀-禾+卵]中即能鳴其聲和雅聽者無厭。",
    "X11n0269_001:0708b23_9": "▲經恒沙者大論云恒河中沙一切算數所不能知唯佛及法身菩薩能知其數。",
    "X11n0269_001:0708b24_10": "▲注妙德者涅槃云了了見佛性猶如妙德等佛性非三德不顯故須以法身等釋之。",
    "X11n0269_001:0708c02_11": "▲分證者圓教初住已上皆名分證今指等覺也然此菩薩本是龍種上尊王佛迹輔釋迦豈唯文殊諸聲聞等咸有本迹廣如法華疏記。",
    "X11n0269_001:0708c05_0": "二時下因齊應供又二一佛應王宮。",
    "X11n0269_001:0708c05_1": "▲經宮掖者班固西都賦云後宮則有掖庭椒房呂向注曰掖宮名在天子左右如肘掖也。",
    "X11n0269_001:0708c07_2": "▲注齊者齊也者祭統云齊之為言齊也齊以致齊。",
    "X11n0269_001:0708c08_3": "△二城中下僧應臣舍。",
    "X11n0269_001:0708c08_4": "▲經飯僧者謂以食請僧飯之飯扶晚切餐也曲禮云飯黍毋以著。",
    "X11n0269_001:0708c10_5": "▲注天竺下文出西域記谷響引韓子曰重厚自居謂之長者玉藻云居士錦帶鄭康成注曰居士道藝處士也。",
    "X11n0269_001:0708c13_0": "二唯有下別緣有三一阿難遭術二如來垂救三文殊攝還初又三一失僧次。",
    "X11n0269_001:0708c14_1": "▲經不遑僧次遑暇也四分律明請僧有二種謂僧次請別請也雖律開別請而諸文中多斥別請偏讚僧次十誦律云別請佛及五百羅漢不如僧次請一似像極惡比丘成論云僧次請僧如飲海水即飲眾流。",
    "X11n0269_001:0708c18_2": "▲注涅槃下陳如品說阿難初為侍者先求世尊與我三願一者如來設以故衣賜我聽我不受二者如來設受檀越別請聽我不從三者聽我出入無有時節佛讚阿難具足智慧預見譏嫌何以故當有人言汝為衣食故奉給如來是故先求不受故衣不隨別請出入有時則不能得廣作利益四部之眾是故欲求出入無時今經云先受別請者即不從佛行也既無上座及阿闍梨者以因僧次應諸齊主也。",
    "X11n0269_001:0709a08_3": "▲途中獨歸顯無伴侶此為下文遭術張本。",
    "X11n0269_001:0709a09_4": "▲其日無供謂祇園間更無檀越致供是故入城乞食也。",
    "X11n0269_001:0709a10_5": "△二即時下求齊主。",
    "X11n0269_001:0709a10_6": "▲經於所遊城即室羅筏城準摩登伽經云阿難持鉢入舍衛城乞食於其路次見旃陀羅女故知非別城也以城在祇園北僅五六里故食時持鉢可往復也心中初求最後檀越望前僧次是為最後。",
    "X11n0269_001:0709a14_7": "▲注體色量者律明鉢體大要有二泥及鐵也色者熏作黑色赤色或孔雀咽色鴿色等量者大鉢受三斗小者受斗半中品可知南山云此姬周之斗也準唐斗上鉢一斗下者五升。",
    "X11n0269_001:0709a18_8": "▲剎利王族者具云剎帝利此翻田主西域記明此姓云奕世君臨仁恕為志。",
    "X11n0269_001:0709a19_9": "▲旃陀魁膾者谷響云梵語旃陀羅此翻屠者正言旃茶羅此云嚴幟謂惡業自嚴行持標幟搖鈴持竹為自標故魁師也膾切割也。",
    "X11n0269_001:0709a22_10": "▲欲令下釋發意圓成等孤山意以皆趣菩提菩提即具無量功德也今解無量功德亦應約眾生得益差別論之謂施我食者隨其淨穢所求功德悉令滿足。",
    "X11n0269_001:0709b01_11": "▲經欽仰如來開闡無遮謂遵佛訶誡平等行乞也。",
    "X11n0269_001:0709b02_12": "▲注善現捨貧從富者維摩疏云貧人用乏常憂不足慈心無諍將讙彼意故不從乞富家幸豐乞不為損等。",
    "X11n0269_001:0709b04_13": "▲飲光捨富從貧者飲光即迦葉也疏云其有慈悲之心見貧窮者持鉢往福使現轉報來生免若又貧者遭苦必易化度富者著樂會不從化等皆為淨名所訶者彼訶善現云若能於食等者諸法亦等諸法等者於食亦等如是行乞乃可取食訶飲光云有慈悲心而不能普捨豪富從貧乞迦葉住平等法應次第乞食就佛所印者佛命二人行詣問疾故述昔日被彈之事佛既印可即同佛訶。",
    "X11n0269_001:0709b11_14": "▲經城隍者說文云城池無水曰隍蒼頡篇云城下坑也。",
    "X11n0269_001:0709b13_0": "△三經室。",
    "X11n0269_001:0709b13_1": "▲經爾時阿難因乞食次據摩登伽經云阿難乞食訖還祇洹林於其路次見旃陀羅女則與今經敘事稍別不須會通也然摩登伽經凡有三譯一名摩鄧女經一卷後漢安世高譯二名摩登伽經三卷吳竺律炎共支謙譯三名摩鄧女解形中六事經一卷東晉失譯唯吳本最詳今略錄之初阿難見女持瓶取水往彼語言今我渴乏甚欲須飲女以淨水授與阿難飲訖還其所止此女染著阿難容貌欲心猛盛遂還母所而作是言阿難比丘我甚愛樂欲得為夫如母力者能辦斯事母言有二種人雖加呪術無如之何一者斷欲二者死人自餘之者吾能調伏沙門瞿曇煩惱已盡及其眷屬咸離欲穢如何於彼反起惡業女復泣言若母不得我必捨命母聞斯言慘然不悅乃於舍內牛糞塗地以布白茅於此場中然大猛火用妙遏迦華百有八枚誦呪一周輙以一莖投之火內即誦其呪(呪有十句具在經文)誦已曰若天若魔若乾闥婆火神聞我此呪及吾祠祀宜應急令阿難至此作是語已阿難心即迷亂不自覺知行詣其舍悲噎哽塞泣淚而言我何薄祐遇斯苦難大悲世尊寧不垂愍云云。",
    "X11n0269_001:0709c08_2": "▲注食米臍外道應法師云舊言食米屑此外道修苦行合手大指及第二指以物縛之往至人家舂糓簸米處以彼縛指拾取米屑聚置掌中隨得少多去以為食若全粒者即不取之亦名[孚*鳥]鳩行外道拾米如[孚*鳥]鳩行也昔五百世下此出摩鄧女經今言登伽者誤。",
    "X11n0269_001:0709c13_3": "▲危窘之意者窘急迫也。",
    "X11n0269_001:0709c13_4": "▲得道俱戒者亦名道共戒與真道共俱自然不犯也。",
    "X11n0269_001:0709c15_0": "▲唯存正使謂初果以上雖有三毒不邪起故即思惑也非婦不婬約在家得果者言之於他境不犯又於己妻亦離非時非處等。",
    "X11n0269_001:0709c17_1": "▲懇地不夭者初果掘地蟲離一寸乃至四果離四寸故元夭命之愆也。",
    "X11n0269_001:0709c18_2": "▲不計性實者雖有事中相應獨頭二種無明了法從緣不起性執也。",
    "X11n0269_001:0710a02_3": "▲欲飽還來之事谷響引阿含云三果退家毀失律儀不失道共俗人生謗言無聖法佛言欲飽起厭不久當還更求出家諸比丘不度佛即度之便得四果阿難問言大德是學退無學退答言學退此即慧解脫人退為初果於初果身中作初果人為事也。",
    "X11n0269_001:0710a07_4": "▲初果生殺羊家者大論云初果生屠羊家年向成人不肯殺生父母與刀並羊閉著屋中語言若不殺羊不令汝出其兒以刀自殺即生天上。",
    "X11n0269_001:0710a09_5": "▲世人準律下興福云將毀戒體者犯摩觸戒也資中云準律無心不犯但得不應以不應獨入婬舍故犯吉羅真際云據經婬躬撫摩將毀戒體此謂非戒家近方便耳合犯重偷蘭罪以阿難無心遭彼所逼雖有罪名而無罪體若云犯摩觸及吉羅者皆未盡理今謂慤沇結罪固並不然沇云不應如何銷釋將毀之文耶節謂偷蘭有名無體予試問之經云將毀為欲毀耶不欲毀耶若欲毀者何無罪體若不欲毀者何有罪名進退俱非徒增後學之惑耳。",
    "X11n0269_001:0710a18_6": "▲女之母名摩鄧者摩鄧摩登梵音奢切也準吳本云摩登伽是旃陀羅種又名此女為旃陀羅女又云時復有人於路遊行其車破壞因便修治名摩登伽孤山云據彼所說乃是工巧之姓今準中阿含明四姓謂剎利梵志居士工師驗摩登伽實工師之姓也又應法師云摩登伽具云阿徒多摩登祇旃荼羅摩登祇女之總名阿徒多女之別名此女卑賤常掃市為業用給衣食。",
    "X11n0269_001:0710b02_0": "▲長水所翻未見其義者蓋璿師見登伽經說此女過去為婆羅門女名為本性便將昔名以翻今日又往人翻為敗風謂男女不以禮婚敗五常之風斯亦不爾。",
    "X11n0269_001:0710b05_1": "▲欲破阿難所持之體者以欲釋將也體即婬戒無作之體疵說文云病也。",
    "X11n0269_001:0710b07_0": "二如來垂救。",
    "X11n0269_001:0710b07_1": "▲經如來知彼者知照也以一切種智寂而常照故。",
    "X11n0269_001:0710b08_2": "▲無畏光明者為令阿難得無所畏光明者為令阿難得無所畏故。",
    "X11n0269_001:0710b09_3": "▲結跏趺坐者聲論云以兩足趺跏致兩髀如龍盤結。",
    "X11n0269_001:0710b10_4": "▲注頂表法身者以頂是無見頂相故表至理之無上非下地之所見也。",
    "X11n0269_001:0710b12_0": "▲光表報身者報有二種一自受用二他受用今所放之光即他受用相而所表之身即自受用體以下文云光從頂出即智由理發也。",
    "X11n0269_001:0710b14_1": "▲化佛表應身者然釋迦即應身復云表者顯應用之非一也化復作化斯之謂歟問光中出生千葉寶蓮此表於何答蓮以表實華以表權應身起用不離權實二智是故化佛趺坐其中。",
    "X11n0269_001:0710b18_2": "▲徧照百界者六凡四聖十界互具也。",
    "X11n0269_001:0710b18_3": "▲折惡攝善者折登伽之惡攝阿難之善。",
    "X11n0269_001:0710b20_0": "三文殊攝還。",
    "X11n0269_001:0710b20_1": "▲經將呪往護興福云文殊密說妙解邪方是則阿難亦不顯聞但蒙冥護故第七卷云雖蒙如來佛頂神呪冥獲其力尚未親聞若據登伽經但是世尊自說一呪解彼婬術經云爾時如來以淨天眼觀見阿難為彼女人之所惑亂為擁故即說呪曰悉梯帝(一)阿朱帝(二)阿尼帝(三)說此呪已而作是言吾以斯呪安隱一切怖畏眾生亦欲利安諸苦惱者若有眾生無歸依處我當為作真實歸依爾時世尊復說偈言戒池清涼淨無垢能浴眾生煩惱熱若有智者人此池無明暗障永滅盡是故三世諸賢聖成皆頂戴共稱歎若我真實浴此流當令侍者速返爾時阿難以佛神力及善根力旃陀羅呪無所能為即出其舍還祇洹林當知聖人三密赴機見聞有異不可以常情致詰也孤山問曰既不毀戒何須往護答為呪所攝故盤桓婬室不能自出故下文阿難自敘云遭彼梵天邪術所禁心雖明了力不自由故須往護亦如阿難於涅槃會為魔所冐亦假文殊持呪往救但解其胃非慮同邪。",
    "X11n0269_001:0710c13_2": "▲注下文顯故即第四卷云摩登伽婬火頓歇得阿那含也此是呪後得第三果至攝還佛所聞經至文殊簡圓通竟成阿羅漢若據登伽經說聞呪時未言得益尋求阿難自到佛所且非文殊提獎而歸及聞說法亦得阿羅漢道然則兩經並由聞經方證四果但是大小機見不同耳今更引吳本略明登伽歸佛之相庶了此經與彼碩異經云時彼女人見阿難去於夜過已沐浴其身著新淨衣首戴華鬘塗香嚴飾徐步安詳向舍衛國到城門已住待阿難阿難晨朝入城乞食女見其來深生歡喜隨逐而行終不捨離尊者見是極懷慚愧還祗洹林頂禮白佛旃陀羅女極嬈逼我惟願世尊慈加擁護佛告阿難汝莫愁惱吾當令汝得免斯難爾時世尊告女人曰汝用阿難以為夫耶女言如是乃至佛言若汝欲得阿難為夫宜應出家學其容飾答曰唯然敬承尊教佛言善來便成沙門須髮自落法衣在身即為說法示教利喜所謂施論戒論生天之論欲為不淨眾苦積聚其味至少過患甚多譬如飛蛾為愚癡故投身猛焰等時比丘尼聞說是已心意調伏佛知其心即為廣說四真諦法時比丘尼豁然意解即於座上得阿羅漢道云云問彼經聞小乃得四果此經聞大何故亦證阿羅漢耶答彼小隔大此圓通小如第六卷。",
    "X11n0269_001:0711a17_3": "▲注然約下明登伽得益事通權實由阿難牽以欲鈎者谷響云愛牽於人如鈎牽物故淨名曰先以欲鈎牽後令入佛智今約登伽得聞斯典了悟常心名入佛智此就實行言之若是大權者即法身大士權示應迹引接實機也。",
    "X11n0269_001:0711a21_4": "▲諸家者始自魏北館陶法師分經八段乃至孤山作解行二門皆至佛告阿難汝我同氣下方為正說今觀下依長水分經且首楞嚴者即奢摩他等總名奢摩他等即首楞嚴之別號最初方便復是圓通要門如法華中身子請佛顯實涅槃中純陀請佛談常皆是正說不在序品斯例昭然矣。",
    "X11n0269_001:0711b04_0": "二阿難見佛下正宗分為三一阿難啟請。",
    "X11n0269_001:0711b04_1": "▲經悲泣者無聲出涕曰泣。",
    "X11n0269_001:0711b05_2": "▲注同時發心即阿耨菩提也。",
    "X11n0269_001:0711b05_3": "▲汝常好多聞者於發大心後亦慧多而定少也彼約顯本故作是說若據今經且就迹論何以明之如下阿難自敘當初發心緣於如來三十二相等但是小乘生滅之見洎乎世尊推其心見不知所在驗無大乘圓解明矣良由此中云恨無始來有似密含本意所以孤山引法華文通釋其義耳。",
    "X11n0269_001:0711b11_4": "▲我由下正就迹中以明今意也又孤山解一向多聞者偏著小慧也未全道力者不修大定也然小乘豈但無楞嚴理定亦無圓融佛慧故涅槃云以諸聲聞無有慧力是故如來為說半字以今如來現通演呪悉從理定而發故使阿難知小慧之非而偏請大定也。",
    "X11n0269_001:0711b16_5": "▲經殷勤下請果人因地所修行法故曰十方如來得成菩提等應知得成菩提即究竟覺智也妙奢摩他三摩禪那即圓教真似乃至外凡所修定行也法首楞嚴通因通果今正在因因果相沿始終一貫分別行相委如前說題。",
    "X11n0269_001:0711b21_6": "▲注此大意與一心三觀想應者宗密禪師圓覺經疏別立三名一泯相澄神觀二起幻銷塵觀三絕待靈心觀總結云此與涅槃三相大同小異與天台三觀則義理同而意趣異同者泯相即空觀起幻即假觀絕待即中觀異者此明人用心方便彼則推窮諸法性相此多約心行成故不立所觀之境彼多約義生解故對所觀三諦今輙難之既言用心方便何得復云心行成耶縱是行成那忽經文令一切菩薩及末世眾生依於未覺幻力修習耶所云推窮諸法性相者斯是天台用唯識觀歷事觀理而不知有真如觀唯達法性更不餘塗何甞一向推窮性相耶又則凡明觀道必對諦境辨之如圓覺奢摩他中云以淨覺心取靜為行由澄諸念覺識煩動等三摩提中云以淨覺心知覺心性及與根塵皆因幻化等禪那中云以淨覺心不取幻化及諸靜相了知身心皆為罣礙無知覺明不依諸礙等當知靜即真諦幻即俗諦無知覺明即第一義諦而言不立所觀之境其可得乎豈以經文簡略便為偏說乎密師有禪源詮甞云南岳天台令依三諦修三止觀教義雖圓終成次第唯達磨所傳最上乘禪亦名如來禪等頓同佛體逈異諸門惜夫斯言有抑吾祖。",
    "X11n0269_001:0711c17_7": "▲涅槃明三者彼經此三各有多種名義從正而言奢摩他名定毗婆舍那名慧優畢叉名捨今云止觀即定慧異名由止觀等二邊俱捨。",
    "X11n0269_001:0712a02_8": "▲體真止者知因緣假合幻化性虗故名為體舉緣妄想得空即息空即是真故言體真止。",
    "X11n0269_001:0712a04_9": "▲方便隨緣止者知空非空故言方便分別藥病故言隨緣心安俗諦故名為止。",
    "X11n0269_001:0712a05_10": "▲息二邊分別止者知俗非俗俗邊寂然亦不得非俗空邊寂然故名息二邊止廣如摩訶止觀。",
    "X11n0269_001:0712a07_11": "▲雖二名有異者謂毗婆優畢與三摩禪那也。",
    "X11n0269_001:0712a08_12": "▲其體亦同者謂第二皆緣俗諦第三皆緣中道也。",
    "X11n0269_001:0712a09_13": "▲但禪那下融會第三應知雙遮是中道之體雙照是中道之用體用互顯彼此無殊不言第二者以易解故大定非三止而何者反質之辭也正顯此定必具三止何者定即是止止須依諦諦若非三攝法不徧故經題云具足萬行者良在茲焉。",
    "X11n0269_001:0712a14_14": "▲所主從別者止觀云諸經赴緣偏舉一法以示義端如首楞嚴偏舉止邊具一切法智度法華偏舉觀邊具一切法涅槃舉三法名祕密藏然天台所指雖是首楞嚴三昧經與今名義不可永異。",
    "X11n0269_001:0712a17_15": "▲冥符聖言者智者說止觀時未聞斯典甞云此三止名雖未見經論映望三觀隨義立名若能尋經得名即懸合此義也今觀誠證則智者之說與阿難所請冥若符契矣問奢摩他等與體真止等名字既別豈曰冥符耶答昔安師三分與親光三分名字亦殊而先德歎云妙理潛通慧心懸合彌天之稱豈虗也哉由是觀之三止冥符于何見責。",
    "X11n0269_001:0712a24_16": "▲有通有別者通請正開解別請正明行又通請被三根別請被中下又通該十八界別就一根塵又通約十方別從此界說題已具此不煩文。",
    "X11n0269_001:0712b04_0": "二於時下大眾願聞經及諸十方者前同聞眾但列此方聲聞今為簡異故云十方大阿羅漢問前辟支佛已云無量今何再列答既言於時復有應以此句冠下讀之是則前所集者已聞序經今所來者方聞正說。",
    "X11n0269_001:0712b09_0": "三佛告下如來演說為三一開楞嚴解心二顯楞嚴行法三示楞嚴地位。",
    "X11n0269_001:0712b10_1": "▲皆以楞嚴為目者蓋不忘其本也如章安科涅槃經五段悉用涅槃為名今亦傚之初又二一對慶喜破人法二執顯空如來藏二對滿慈破性相兩疑顯不空如來藏初又二一詶請開示二聞法領悟初又二一廣破心見明人空二會破陰入明法空初又四一審發心二斥妄想三勸直詶四破執計初又二一問。",
    "X11n0269_001:0712b16_2": "▲經汝我同氣情均天倫孤山云南齊褚淵居嫡母喪去官王儉歎之曰雖事緣義感而情抱天屬義感謂非所生也天屬猶天性也蓋譯人取此潤色佛言耳。",
    "X11n0269_001:0712b19_3": "▲注斛飯王之子者初師子頰王有四子一曰淨飯(二子一悉達二難陀)二曰斛飯(二子一調達二阿難)三曰白飯(二子一摩訶男二阿那律)四曰甘露飯(二子一跋提二提沙)。",
    "X11n0269_001:0712b22_0": "▲如來成道夜生者諸經明佛出家成道皆云二月八日夜鬼宿合時。",
    "X11n0269_001:0712b23_1": "▲汝雖堂從者從疾用切爾雅云兄之子弟之子相謂為從父晜弟是也。",
    "X11n0269_001:0712b24_2": "△二阿難下答。",
    "X11n0269_001:0712c01_3": "▲經三十二相者始足下安平終頂有肉髻如法界次第荊谿云三十二相是藏通極果故知阿難發心示同凡小之見也。",
    "X11n0269_001:0712c03_4": "▲瑠瑙具云吠流離耶此云不遠謂西域有山去波羅奈城不遠山出此寶因以名焉後人從玉別為瑠璃。",
    "X11n0269_001:0712c05_5": "▲腥臊者腥或作胜通俗文云魚臭曰胜猳臭曰臊今言欲氣似之注易曰下繫辭云天地網縕萬物化醇男女搆精萬物化生搆合也經作遘遇也義同於易故引釋之。",
    "X11n0269_001:0712c09_0": "二佛言下斥妄想。",
    "X11n0269_001:0712c09_1": "▲經一切眾生等即下文十種異生也正言六道亦兼三乘以六道受分段生死三乘受變易生死皆有輪轉之義故。",
    "X11n0269_001:0712c11_2": "▲注圓融三諦如第四卷明如來藏中六趣見其俗即賴緣之假也二乘見其真即偏空之理也菩薩見其中謂別教地前唯觀但中屬菩薩界若至地上證道同圓方屬佛界二種生死出勝鬘經由五住之因招二死之果云云。",
    "X11n0269_001:0712c16_0": "三汝今下勸直詶。",
    "X11n0269_001:0712c16_1": "▲經終始地位者終妙覺始乾慧也中間永無諸委曲相如第八云是種種地皆以金剛觀察如幻十種深喻奢摩他中用諸如來毗婆舍那清淨修證應知瓔珞五十二位即委曲之相以先空次假後中故乃至大品十地沙四階委曲可知也昔人謂此經同方等部或云兼一別教者甚違佛旨。",
    "X11n0269_001:0713a04_0": "▲注言者心之聲語出揚子彼又云書者心之畫聲畫形君子小人見矣今借用之在文可解。",
    "X11n0269_001:0713a06_0": "四阿難下破執計為三一推見愛二責所在三辨真妄初又二一問經當汝發心下夫如來身相乃因緣所生法也隨機所見四種不同謂生滅無生無量無作四見雖異一境是同今欲破生滅之心顯無作之理故舉所緣之境以問能緣之見如醫設藥先審病源。",
    "X11n0269_001:0713a11_1": "△二阿難下答。",
    "X11n0269_001:0713a11_2": "▲經用我心目者斯由不知心目本如來藏妙真如性妄取勝相謂之實有也用我答誰為愛樂心目答將何所見。",
    "X11n0269_001:0713a13_3": "△二佛告下責所在又二一總責有法譬合三節。",
    "X11n0269_001:0713a14_4": "▲經塵勞者塵謂六塵勞即煩惱通含三惑別在見思。",
    "X11n0269_001:0713a15_5": "▲發兵討除者西域四兵謂象馬車步也周禮司兵掌五兵謂戈柲六尺六寸(柲丘媚切柄也)殳長尋有四尺車戟常酉矛常有四尺夷矛三尋(八尺曰尋倍尋曰酋近夷長)又步卒之五兵則無夷矛而有弓矢討治也誅也。",
    "X11n0269_001:0713a19_6": "△二吾今下別破分七一破在內乃至七破無著興福立八徵八破之義一神湯內瀉二靈膏反熁三針治內障四火角反搜五神呪鞭治六金刀坼腦七針骸補助更取下文如來舉奉問汝目可見以何為心等名為膏肓出鬼共成八段異哉椎輪之疏其例多爾至陵疎疏亦用前七段以為科語若沇節二疏凡此義目並已芟之初破在內為三一問二阿難下答。",
    "X11n0269_001:0713b02_7": "▲經一切世間智論明二種世間謂世界世間眾生世間今指眾生也亦可舉依攝正以下句即云十種異生故。",
    "X11n0269_001:0713b04_8": "▲青蓮華眼者肇師淨名經注云天竺有青蓮華其葉脩而復廣青白分明有大人目相故以為喻。",
    "X11n0269_001:0713b06_9": "▲注外五根名浮塵根者浮謂塵浮塵以染汙為名染汙真性故根以能生為義能生五識故內五根即勝義根也。",
    "X11n0269_001:0713b08_10": "▲屬不可見有對色者準毗曇明三種色一可見色如青黃等二有對色謂五根五塵若云不可見有對但云五根四塵三不可見無對謂法入少分今內五根亦言色者以是清淨四大所造非麤顯之質故不可見然法相有宗當詢善者。",
    "X11n0269_001:0713b14_0": "三佛告下破為四一立例二誡聽三正破四結非初又三一立境內外二審觀先後三定見因由各有問答如文。",
    "X11n0269_001:0713b16_1": "△二爾時下誡聽。",
    "X11n0269_001:0713b16_2": "▲經妙莊嚴路長水云清淨果海眾德具足故曰莊嚴真三摩提因行所履故名為路今不取果海唯指因中所履之法名莊嚴路法華云定慧力莊嚴是也此三摩提乃即慧之定況復具足萬行不亦莊嚴義乎由因通果故謂之路。",
    "X11n0269_001:0713b20_3": "△三佛告下正破又二一躡前復例。",
    "X11n0269_001:0713b21_4": "▲經戶牖者說文云半門為戶穿壁以木為交窻曰牖。",
    "X11n0269_001:0713b22_5": "△二阿難下循例反破又二一牒執。",
    "X11n0269_001:0713b23_6": "▲經汝之心靈一切明了且約妄覺言之。",
    "X11n0269_001:0713b24_7": "△二爾時下設難。",
    "X11n0269_001:0713b24_8": "▲經頗有者頗偏也。",
    "X11n0269_001:0713b24_9": "▲縱不下天台禪波羅蜜明身有三十六物心肝脾胃等是內物爪髮筋脉等是外物今縱不見內物合見外物也必不內知總指前物皆名為內云何知外即指林泉等謂之為外。",
    "X11n0269_001:0713c04_10": "△四是故下結非餘六皆九言科更不別列。",
    "X11n0269_001:0713c06_0": "二破在外經阿難稽首周禮太祝辨九拜一曰稽首鄭氏云稽首拜頭至地也疏曰稽稽留之字頭至地多時為稽首拜中最重臣拜君之拜也。",
    "X11n0269_001:0713c08_1": "▲二所以下取譬此兼兩意一領前破義謂心若在內必如室中之燈先照其內也二為計外張本欲取燈居室外以況心在身外耳。",
    "X11n0269_001:0713c11_2": "▲三一切下顯法。",
    "X11n0269_001:0713c12_0": "二佛告下隨破為二一立例經一切下顯法二佛告下隨破為二一立例。",
    "X11n0269_001:0713c13_1": "▲經循乞摶食應法師云循與巡同摶食即第八云段食是也今存古翻。",
    "X11n0269_001:0713c14_2": "▲軀命不同謂子縛雖斷果縛未亡故。",
    "X11n0269_001:0713c15_3": "▲注齊乃經宿方食谷響云謂待明相故加宿之一字足顯齊義蓋譯人潤色之巧也漢書武紀云元狩三年遣謁者勸有水災郡種宿麥顏師古注云秋冬種之經歲乃熟故云宿麥與今宿齊義稍符合永嘉珙鈔云宿訓預論語云子路無宿諾今觀何平叔注云宿猶預也此非的訓亦取不隔宿而諾謂之預耳然則彼說預先此論即日不為義例若禮記內則作夙齊夙早也與今亦別。",
    "X11n0269_001:0714a05_0": "△二佛告下正破又二一牒執二身心下設難又二一難身心相離二我今下驗內外相知。",
    "X11n0269_001:0714a06_1": "▲經兜羅綿手謂佛手柔輭加以合縵似此綿也注此云細香者若準慧苑華嚴音義曰梵語兜羅此云冰或言兜沙此云霜斯皆從色為名也。",
    "X11n0269_001:0714a10_0": "三阿難下破潛根分三一轉計二隨破三結非初又四一呈心二佛言下審處。",
    "X11n0269_001:0714a11_1": "▲經潛伏根裏即浮塵根也三猶如下舉喻四然我下顯法。",
    "X11n0269_001:0714a12_2": "△二佛告下隨破又二一牒執二彼人下設難又二一躡喻詳見二佛告下依見難心。",
    "X11n0269_001:0714a14_3": "▲經眼即同境不得成隨以眼是能隨境是所見若見眼者能翻為所隨義不成。",
    "X11n0269_001:0714a16_0": "四阿難下破內外分三一轉計。",
    "X11n0269_001:0714a16_1": "▲經腑藏者腑或作府白虎通云人含六律五行之氣而生故內有五藏六府五藏者謂肝心肺腎脾也六府者謂大腸小腸胃膀胱三焦膽也府為藏之宮府也胃者脾之府膀胱者肺之府三焦者腎之府膽者肝之府大腸小腸心之府竅穴居外者莊子內篇曰人皆有七竅以視聽食息七竅者謂眼耳鼻口今正言眼也。",
    "X11n0269_001:0714a22_2": "▲注今立內外者資中科為破在腑藏孤山長水名破見內今據阿難所計顯有內外之文如來所破亦具兩義故文句以此為破內外也。",
    "X11n0269_001:0714b01_3": "▲然則下從容定之須知見有內外體實在內此與初執不可雷同。",
    "X11n0269_001:0714b02_4": "△二佛告下隨破分三一定執二若與下正破為二一約有對破內義二約無對破見義初又二一設難二若成下立妨。",
    "X11n0269_001:0714b05_5": "▲經焦腑者焦謂三焦或作膲黃帝難經云三膲者水糓之道路氣之所終始也上膲在心下下膈在胃上口(自膈已上)中膲在胃中口不上不下(自臍已上)下膲在臍下當膀胱上口楊玄橾云膲元也天有三元之氣所以生成萬物注人法天地所以亦有三元之氣以養身形。",
    "X11n0269_001:0714b10_6": "△二若不下約無對破見義。",
    "X11n0269_001:0714b10_7": "△三若離下縱難又四一就見內縱此由上文云居暗室中無日月燈此室暗中皆汝焦腑似約開眼外見破之恐彼救云我所說義且非開眼[月*者]暗名為見內乃是合眼見暗名為身中故今縱曰若離外見內對所成。",
    "X11n0269_001:0714b14_8": "△二合眼下以見外難初二句牒前轉計次二句以見外難之後二句處外破內。",
    "X11n0269_001:0714b16_9": "△三見面下縱成見外。",
    "X11n0269_001:0714b16_10": "▲注復以前難者即開眼見明何不見面也。",
    "X11n0269_001:0714b17_11": "▲縱其所計者謂亦有見面之義也。",
    "X11n0269_001:0714b18_12": "△四此了下難非在內又二一難心眼在空孤山云此有二過一在空非自過二我見同汝過其文可解而言亦是汝身者身合云眼以眼屬身分故通言之。",
    "X11n0269_001:0714b21_13": "△二必汝下難覺知有二。",
    "X11n0269_001:0714b21_14": "▲經身眼兩覺即自身及空眼也應成兩佛者以必無之義破必非之執。",
    "X11n0269_001:0714b23_15": "▲注所執與難豈其然乎非但此中前兩番縱難皆假施設也。",
    "X11n0269_001:0714b24_16": "△三是故下結非。",
    "X11n0269_001:0714b24_17": "▲注不言見明為外者略也斯例有之如辨魔中於行陰起計度者墜入四顛倒論經文初標一分無常一分常論至後總結略云一分常論與今大同又見外為成見內者以謂心體在內故舊疏科語蓋由此耳。",
    "X11n0269_001:0714c05_0": "五阿難下破隨合分三一轉計二隨破三結非初又二一據昔所聞。",
    "X11n0269_001:0714c06_1": "▲經我常聞佛孤山云常合作甞字之誤也今觀下文云如來常說諸法所生唯心所現又云世尊云何常與比丘宣說見性具四種緣又云汝常不聞如來宣說性覺妙明等並作尋常之常未必皆誤縱是曾甞之甞但依其義不須改文開示四眾者出家在家各二眾也天台於一眾更開為四謂影響發起當機結緣云云由心下長水云第八本識變生三境故云心生法生境界風動能起識浪故云法生心生今雖通舉要取後句法生心生以為所據今謂由指本識者非也夫第八棃耶屬大乘分齊縱佛開示實通此識且阿難迹居初果豈思議之所及乎應知秪就現前分別事識而論轉計荊谿云小乘由心亦此識耳。",
    "X11n0269_001:0714c18_2": "▲注境從心起者如人照鏡形對像生也。",
    "X11n0269_001:0714c19_3": "▲心逐境遷者像有好醜心生欣慼也又下句例由塵發知上句如因根有相反覆相顯意在兩兼。",
    "X11n0269_001:0714c21_0": "△二我今下呈今所解。",
    "X11n0269_001:0714c21_1": "▲注根與塵合者應云心與塵合何則此中根識皆屬能合能合之體即是心性經不云乎我今思惟即思惟體實我心性若言根與塵合故心隨生則濫下文中間之執請細觀之。",
    "X11n0269_001:0714c24_2": "△二佛告下隨破又二一牒執略舉下句影取上句二是心下正破又二一破無體。",
    "X11n0269_001:0715a02_3": "▲經是心無體則無所合體猶性也夫心性遍在諸法假緣而生譬如火性寄諸陽燧因與日合故能出火若無有體而能合者此猶火本無性隨所合物火則隨有豈應爾耶。",
    "X11n0269_001:0715a05_4": "▲則十九界因七塵合者意云心若有體方有合義然其相合不出識與塵也心若無體而論合者必須離十八界外別有一界與第七塵合也此無其理是故斥云是義不然問阿難所執但似內心無體非謂外塵無體以云隨所合處心則隨有若爾秪可云十九界因六塵合何故云七耶答凡言界者以種族為義如心有體則與有合心既無體應與無合由是論之須云七塵。",
    "X11n0269_001:0715a13_5": "△二若有下破有體又二一約內出外入破二約一多徧局破初又四一定。",
    "X11n0269_001:0715a14_6": "▲經自挃其體長水云挃猶觸也。",
    "X11n0269_001:0715a15_7": "△二若復下破。",
    "X11n0269_001:0715a15_8": "△三阿難下救注心依根見合云根依心見其語似倒。",
    "X11n0269_001:0715a16_9": "△四佛言下難。",
    "X11n0269_001:0715a16_10": "▲經則諸已死下眼不自死由心死耳。",
    "X11n0269_001:0715a17_11": "△二阿難下約一多徧局破又二一定二若一下破。",
    "X11n0269_001:0715a18_12": "▲經挃應無在資中云挃頭即是挃足無所在故注文意同。",
    "X11n0269_001:0715a19_13": "▲若徧體下問此徧不徧與一多何別答此單從一體復難二義恐多體被破於一再訂也。",
    "X11n0269_001:0715a22_0": "六阿難下破中間分三一轉計二隨破三結非初又二一據昔所聞。",
    "X11n0269_001:0715a23_1": "▲經談實相者實相之名雖徧四教既約內外推破其心則似衍門三教之義此應是法華前被機通說今阿難泛引其言而為所據。",
    "X11n0269_001:0715b01_2": "△二如我下呈今所解。",
    "X11n0269_001:0715b02_3": "△二佛言下隨破又二一牒執二今汝下正破又三一約身處破二據眼識救三就根塵破初又二一定。",
    "X11n0269_001:0715b04_4": "▲經為復在處孤山云處謂依報處也今恐不爾何者若以依報為處即同十二處之處也斯則顯是六塵之相下文何須定云有表無表耶又則在身既以邊義破之依報亦應以邊義為難而佛以表無表難之者當知此中未對依報而論且定中間之心在何處所耳至阿難據眼識救如來就根塵破方對依報言之。",
    "X11n0269_001:0715b10_5": "△二若在下破。",
    "X11n0269_001:0715b10_6": "▲經如人以表者荀子曰水行者表深表不明則陷楊倞注云表標準也。",
    "X11n0269_001:0715b12_7": "△二阿難下據眼識救。",
    "X11n0269_001:0715b12_8": "▲經眼色為緣證真云眼能發識是增上緣色能牽生是所緣緣。",
    "X11n0269_001:0715b13_9": "△三佛言下就根塵破又二一定二若兼下破。",
    "X11n0269_001:0715b14_10": "▲經物非體知謂色塵之物非如眼體之有知也若翻覆對論亦應云體非物不知影略可見。",
    "X11n0269_001:0715b17_0": "七阿難下破無著分三一轉計二隨破三結非初又二一據昔所聞。",
    "X11n0269_001:0715b18_1": "▲經既不在內下破四性也內即自性外即他性中間即共性俱無所在即無因性一切無著名之為心約離四性以顯假名也此通大乘三教之義一往觀文且說破性猶未破相今但泛指用為轉計之由耳。",
    "X11n0269_001:0715b22_2": "△二則我下呈今所解。",
    "X11n0269_001:0715b22_3": "△二佛告下隨破又二一牒執二世間下破又二一定。",
    "X11n0269_001:0715b23_4": "▲經世間等指器世界飛行指有情世界於中略據畜趣言之諸所物象通攝情器。",
    "X11n0269_001:0715c01_5": "▲注在即有也長水云在即著也若云著者則屬心邊若言有者則屬境邊今指情器豈非境耶況以在訓著於義甚疎又銷下文難意皆失。",
    "X11n0269_001:0715c04_6": "△二無則下難。",
    "X11n0269_001:0715c04_7": "▲經龜毛兔角成論云龜毛兔角鹽香蛇足及風色等是名為無。",
    "X11n0269_001:0715c05_8": "▲注夫相不自有下且心之與境存則俱存亡則俱亡不可偏也永嘉大師所謂念非忘塵而不息塵非息念而不忘若云境在而心若無者猶言空華雖存目翳已亡誰曰然乎支慜度作心無論肇師所破出不真空論。",
    "X11n0269_001:0715c09_9": "△三是故下結非。",
    "X11n0269_001:0715c10_10": "▲注似破四性者以經無自他等文故且云似亦解者之謙也。",
    "X11n0269_001:0715c11_11": "▲介爾妄心者介謂纖介也易曰憂悔吝者存乎介。",
    "X11n0269_001:0715c12_12": "▲中下之輩者此於開解門自分優劣若望行法皆屬上根。",
    "X11n0269_001:0715c13_13": "▲世諦破性謂破性執已方顯世諦也真諦破假假即世諦復破此世諦乃顯真諦也。",
    "X11n0269_001:0715c15_14": "▲假破即相空性破即性空者止觀云若四句推性不見性是世諦破性亦名性空(四句推性即自他共無因也)若四句推名不見名是真諦破假亦名相空(四句推名謂內外中間常自有也)輔行云空非前後二諦同時為辨性相前後說耳。",
    "X11n0269_001:0716a01_15": "▲經文七番義含二空者佛世對機言約義備今據本宗觀道諦而論之非好煩也理必然也。",
    "X11n0269_001:0716a03_16": "▲人法皆有性相者止觀云此性相中求陰入界不可得即是法空性相中求人我知見不可得名眾生空荊谿曰今家依智論中論等立此二空非用法相者所逮沇師未知諒不誣矣。",
    "X11n0269_001:0716a07_0": "三爾時下辨真妄為二一正約心見破妄顯真二徧歷緣塵簡非顯是初又二一破妄心顯真心二破妄見顯真見初又二一阿難悔過申請二如來現瑞發明初又二一悔過。",
    "X11n0269_001:0716a10_1": "▲經即從座起孤山引曲禮云請業起請益起更端起今阿難請益起也此則二土之禮冥符矣。",
    "X11n0269_001:0716a12_2": "▲偏袒右肩者卑之於尊表將執役然右約便易也臣之見君子之見父資之見師故皆袒右此唯天竺之禮耳。",
    "X11n0269_001:0716a14_3": "▲右膝着地者右表吉祥也。",
    "X11n0269_001:0716a14_4": "▲注預流者須陀洹此翻預流初預聖人之流也。",
    "X11n0269_001:0716a15_5": "▲三漏者一欲漏謂欲界一切煩惱除無明二有漏謂上兩界一切煩惱除無明三無明漏謂三界無明中道無漏不漏落二邊即界外無明住地前約權示此約實論。",
    "X11n0269_001:0716a19_6": "△二惟願下申請。",
    "X11n0269_001:0716a19_7": "▲經闡提者涅槃純陀問佛一闡提者其義云何佛言若有四眾發麤惡言誹謗正法造是重業永不改悔心無慚愧如是等人名為趣向一闡提道若犯四重作五逆罪自知定犯如是重事而心初無怖畏慚愧不肯發露於佛正法無護惜建立之心毀訾輕賤言多過咎如是等人亦名趣向一闡提道。",
    "X11n0269_001:0716b01_8": "▲注此翻無欲等者名有多翻今略出其二又涅槃云一闡名信提名不具信不具故名一闡提經文自有七番解說具如高貴德王品。",
    "X11n0269_001:0716b03_9": "▲彌戾車惡見也者此依與福所解資中云應是邊邪不正之見以不正見死墮邊地下賤也孤山云惡見據因下賤據果欲使闡提墮現在惡因毀未來惡果。",
    "X11n0269_001:0716b06_10": "▲經五體者餘經或名五輪以五處圓故即二肘二膝頭頂也。",
    "X11n0269_001:0716b09_0": "二爾時下如來現瑞發明又二一現瑞。",
    "X11n0269_001:0716b09_1": "▲經面門者涅槃疏云口也六種震動孤山云形聲各三震吼覺聲三也(隱隱有聲曰震砰磕發響曰吼令物覺悟曰覺)起動涌形三也(自下升高曰起搖[颱台+易]不安曰動疄壟凹凸曰涌)而言震動者形聲略舉其一耳。",
    "X11n0269_001:0716b12_2": "▲注教行人理法華疏中謂之四一以此解釋顯實之文開示悟入名理一但教化菩薩為人一諸有所作常為一事即行一但以一佛乘故為眾生說法是教一此經顯實與彼不殊故今現瑞用表四意。",
    "X11n0269_001:0716b16_3": "△二佛告下發明為二一明真妄二本二辨真妄二心初又二一總示。",
    "X11n0269_001:0716b18_4": "▲注綖貫珠者綖與線同公羊傳曰中國不絕若綖。",
    "X11n0269_001:0716b19_5": "▲惡叉樹名此與資中所釋不同各有其致故無去取向下凡具兩說例此知之。",
    "X11n0269_001:0716b20_6": "▲經諸修行人謂藏通別人也。",
    "X11n0269_001:0716b21_7": "▲不能得成無上菩提謂圓教佛果也。",
    "X11n0269_001:0716b22_8": "▲乃至別成聲聞緣覺即兩教二乘。",
    "X11n0269_001:0716b22_9": "▲及成外道等即三乘失意之徒或人天邪行之者。",
    "X11n0269_001:0716b23_10": "△二云何下別示。",
    "X11n0269_001:0716b24_11": "▲經生死根本雖通五住今正從見愛而示菩提涅槃雖屬果性亦約因心而辨是故二種並云則汝今者等也應知第四卷發覺初心二決定義與此大同但此中根本則未勸審詳因果則未論同異非初義無以知病非次義無以識藥發解立行目足在茲說者聽者請研其意。",
    "X11n0269_001:0716c05_12": "▲注菩提了因等者了以顯發為義慧行正道明見佛性即實智菩提也緣以資助為義行行助道斷縛得脫即方便淨涅槃也正謂中道無二邊染礙即清淨法身也然此三因正因屬性緣了屬修今約正具緣了三皆在性是故俱彰佛性之名輔行云三千即性空了因三千即假性緣因三千即中性正因此之謂也。",
    "X11n0269_001:0716c11_13": "▲識精猶心性者心即第六王數之心性即三因佛性應知此文秪就現前妄心示性故曰則汝今者識精元明也至第二卷亦就現前妄見顯性則曰且汝見我見精明元等若以下文例此識精元明亦第二月也秪由性在妄中是故能生諸緣法華疏釋佛種從緣起以中道之理為佛種迷此理者由無明為緣則有眾生起解此理者由教行為緣則有正覺起今識精元明即佛種也能生諸緣與彼不異故孤山約隨染淨二緣解此經文全用彼意也。",
    "X11n0269_001:0717a02_14": "▲得失兩異者得謂了性為行失謂背性成迷然得有淺深分別不濫存乎六即云云。",
    "X11n0269_001:0717a04_0": "二阿難下辨真妄二心為二一引發見心二開示真妄初又三一舉奉引見二佛告下因見推心。",
    "X11n0269_001:0717a05_1": "▲注且止其眼者置而未論以下文自有破妄見故。",
    "X11n0269_001:0717a06_2": "▲經即能推者所推之心既不可得故舉能推而為呈露。",
    "X11n0269_001:0717a07_3": "△三佛言下叱心為妄。",
    "X11n0269_001:0717a08_4": "▲經咄丁括丁兀二切宜從上音字書云咄叱也。",
    "X11n0269_001:0717a09_5": "▲虗妄相想者相即前塵想即分別影事二俱不實故曰虗妄。",
    "X11n0269_001:0717a11_0": "二阿難下開示真妄為四一疑請二開示三默領四總訶初又二一疑二請初又二一執前心先明造善次縱令下明造惡。",
    "X11n0269_001:0717a13_1": "▲經皆用此心者阿難但認有作之心不了無為之性圓覺云有作思惟從有心起皆是六塵妄想緣氣非實心體已如空華用此思惟辨於佛境猶如空華復結空果展轉妄想無有是處。",
    "X11n0269_001:0717a16_2": "△二若此下疑所斥。",
    "X11n0269_001:0717a17_3": "▲注封為我心封執也智論明我有三種一邪二慢三名字凡夫具三學人有二(無邪)無學唯一(名字)凡云初果破人執者蓋無邪我如十六知見之類也此就小乘當分為言今阿難既迷大乘常住真心雖有慢我乃與無明同體為障亦名邪我故涅槃中迦葉白佛我從今日始得正見自是之前我等悉名邪見之人。",
    "X11n0269_001:0717a23_4": "▲故以無情為難者荊谿云木石無心之語生乎小宗是知阿難據小為難也。",
    "X11n0269_001:0717a24_5": "△二惟垂下請。",
    "X11n0269_001:0717b02_0": "二爾時下開示為二一經家敘意。",
    "X11n0269_001:0717b02_1": "▲經師子座者荊谿云座無師子之形但有所表故大論云佛人中師子故佛所坐名師子座佛之所說名師子吼。",
    "X11n0269_001:0717b04_2": "▲摩頂者長水云安慰也。",
    "X11n0269_001:0717b05_3": "▲注證此法時即圓教初住。",
    "X11n0269_001:0717b05_4": "△二如來示心為二一真心有體二妄心無體初又二一約諸法正示。",
    "X11n0269_001:0717b07_5": "▲經唯心所現心有二種一真二妄如下文云汝身汝心皆是妙明真精妙心中所現物汝心妄也妙心真也今明生法義必兩兼地論云唯真不生單妄不成真妄和合方有所為但由真弱妄強則生九界依正之法真強妄弱則生佛界依正之法然而真心既實妄性無虗佛意欲令了妄全真達事即理故唯心之言雖通真妄正為顯示真心有體耳。",
    "X11n0269_001:0717b14_0": "▲注因心本具者如鏡具現像之明也。",
    "X11n0269_001:0717b14_1": "▲隨緣能造者如明隨形對而像也故所現像全能現明妍醜既同一明一明妍醜豈分差別。",
    "X11n0269_001:0717b16_2": "△二阿難下約妄事況成。",
    "X11n0269_001:0717b17_3": "▲注如涅槃說出四相品。",
    "X11n0269_001:0717b17_4": "▲空一顯色者谷響云雜集論說二十五色謂青黃赤白長短方圓麤細高下若正(形平等)不正(不平等)光影明闇煙雲塵霧迥表空一顯色。",
    "X11n0269_001:0717b20_5": "▲經何況下長水云清淨簡異妄染妙淨明心即三德具足。",
    "X11n0269_001:0717b22_0": "二若汝下妄心無體分五一牒執。",
    "X11n0269_001:0717b22_1": "▲注覺觀即尋伺百法疏云尋謂尋求令心怱遽於意言境麤轉為性伺謂伺察令心忽遽於意言境細轉為性。",
    "X11n0269_001:0717b24_2": "△二此心下案定。",
    "X11n0269_001:0717c01_3": "▲經別有全性謂分別性全在也。",
    "X11n0269_001:0717c01_4": "▲注為緣業用者即六塵牽起內心為染淨緣而成業用。",
    "X11n0269_001:0717c02_5": "△三如汝下推破。",
    "X11n0269_001:0717c03_6": "▲經縱滅下似釋伏疑恐阿難疑云如我聽法此則因聲而有分別若離此聲乃至一切見聞覺知內守幽閑豈非別有全性耶是故釋云猶為法塵等。",
    "X11n0269_001:0717c06_7": "▲見聞覺知者釋論云眼曰見耳曰聞鼻舌身同云覺意曰知。",
    "X11n0269_001:0717c07_8": "▲注意有四種謂第六意識中有四一定三散定即根本事禪等。",
    "X11n0269_001:0717c08_9": "▲所取法塵者即內守幽閑也既非入定又不緣境故曰散位獨頭。",
    "X11n0269_001:0717c09_10": "△四我非下縱奪又二一縱。",
    "X11n0269_001:0717c10_11": "▲經我非敕汝執為非心指前咄阿難言此非汝心等。",
    "X11n0269_001:0717c11_12": "▲注非顯真者慤疏云離前六塵及思量執更別有真覺不由境發圓鑒寂然此則本性節疏亦爾孤山長水皆不取之若得縱意文旨自顯何者以由前文云若汝執吝分別覺觀所了知性必為心者此心即應離諸一切色香味觸諸塵事業別有全性今所縱者正言若離諸塵事業別有全性容是汝心也。",
    "X11n0269_001:0717c17_13": "△三若分下奪。",
    "X11n0269_001:0717c17_14": "▲經分別影事此同圓覺云六塵緣影也分別即緣緣謂緣慮圭峯云緣慮如影舉體全無彼疏不約前塵為形相對而釋今孤山對釋者蓋帖經伸旨用顯心隨境有耳。",
    "X11n0269_001:0718a03_0": "二塵非下斥失。",
    "X11n0269_001:0718a03_1": "△三即時下默領。",
    "X11n0269_001:0718a03_2": "△四佛告下總訶。",
    "X11n0269_001:0718a04_0": "▲注四禪等如法界次第。",
    "X11n0269_001:0718a04_1": "▲能成無漏者如迦葉說圓通中則從第九滅受想定成阿羅漢大乘羅漢即圓教初住以上分證無生也。",
    "X11n0269_001:0718a06_2": "▲欲界未至者亦名未來禪此是初禪方便定相猶屬欲界故云欲界未至備如次第禪門然諸疏文釋九次第定皆用前釋唯資中又解云未至中間四本靜慮及三無也今長水次解復與沇疏不同未詳所據。",
    "X11n0269_001:0718a11_0": "二阿難下破妄見顯真見分三一悔過申請二現瑞許說三破執明常初又二一悔過。",
    "X11n0269_001:0718a12_1": "▲經不知身心本不相代資中所解蓋言身不代心此約阿難自說若對佛說亦可云佛之身心不能代我之身心出家是身三昧是心二事各行無相替理。",
    "X11n0269_001:0718a15_2": "▲譬如窮子下此與法華喻意稍別彼喻於人以背佛為捨父謂二乘宿世皆於佛邊曾結大緣猶如父子退大流浪名之為捨今譬於法以迷真為捨父真妄相關亦猶父子而真隨妄轉謂失本心義之如捨。",
    "X11n0269_001:0718a19_3": "▲注煩惱障謂根本及隨者案百法論根本煩惱有六謂貪瞋慢無明疑不正見也隨煩惱有二十謂忿恨惱覆誑諂憍害嫉慳無慚無愧不信懈怠放逸昏沉掉舉失念不正知散亂也證真於根本中廣明分別(見惑)俱生(思惑)二類各有種子習氣之異(云云)。",
    "X11n0269_001:0718a24_4": "▲所知障亦名智障者資中云煩惱名數與前不別但應名法貪法瞋等此正約界外見思言之即無明住地也。",
    "X11n0269_001:0718b02_5": "△二惟願下申請。",
    "X11n0269_001:0718b03_0": "▲注心屬王數通乎三性者即第六識心王心數善性惡性無記性也見唯眼識但屬無記者準止觀輔行以五識五意識皆名無記若論起妄次第則眼識在先王數在後今約破妄次第故先心而後見也。",
    "X11n0269_001:0718b07_0": "二即時下現瑞許說又二一現瑞。",
    "X11n0269_001:0718b07_1": "▲經從胷萬字者志誠纂要云梵書作卍古經皆爾梵云室利靺瑳此云吉祥海雲有此相者萬德具也華嚴音義云卍本非是字大周長壽二年主上權制此文著於天樞音之為萬謂吉祥萬德之所集也若西域萬字元作此[歹*(〦/(ㄙ*ㄙ))]。",
    "X11n0269_001:0718b12_2": "▲寶剎者剎土也梵音正云差多羅此翻土田經中或作擦者蓋近字耳。",
    "X11n0269_001:0718b13_3": "△二告下許說。",
    "X11n0269_001:0718b14_0": "三阿難下破執明常為二一略說二廣說初又二一定其常情二奪其妄執初又二一舉前見相二設今譬類初又二一問長水云問意有三正在誰見餘則兼之向下答文不依問次從便故也。",
    "X11n0269_001:0718b17_1": "△二阿難下答。",
    "X11n0269_001:0718b18_0": "▲注赩盛貌谷響引文選云瑤草正翕赩玉樹信葱青注曰翕赩葱青盛鬱貌。",
    "X11n0269_001:0718b19_1": "△二佛告下設今譬類又二一問二阿難下答。",
    "X11n0269_001:0718b20_2": "▲經唯然者敬應曰唯如是曰然禮云父召無諾先生召無諾唯而起注曰應辭唯恭於諾。",
    "X11n0269_001:0718b22_3": "△二佛言下奪其妄執又二一牒前斥非二所以下引盲說見又二一矚暗成見。",
    "X11n0269_001:0718b23_4": "▲經盲人者釋名云盲茫也茫無所見也。",
    "X11n0269_001:0718b24_5": "▲前塵自暗此有二意一指種種色為前塵以無明緣故暗也二暗即前塵以眼之所對故。",
    "X11n0269_001:0718c02_6": "△二阿難下顯見唯心又二一疑二佛告下釋又二一約二人見暗定二約二人明破初又二一問二如是下答二阿難下約二人見明破又三一並。",
    "X11n0269_001:0718c05_7": "▲經名眼見者合先問云名眼見否彼必答言如是今文隱略即以答意牒而並之。",
    "X11n0269_001:0718c06_8": "△二若燈下難。",
    "X11n0269_001:0718c07_0": "△二是故下結。",
    "X11n0269_001:0718c07_1": "▲注心為其主餘是助緣者如下文云世尊常說見性具四種緣所謂空明心眼合舉三緣但心為主燈眼是助既知見性屬心。",
    "X11n0269_001:0718c09_2": "▲漸明真見者證真云此中且約第六意識以明為欲奪其眼見故權用之今謂不然第六意識已為前文所破如云此是前塵虗妄相想等今正指眼根能見之性名之為心是心無記去真稍近故曰漸明若深說者即第二卷云見精明元也但此中未彰灼而示且通漫云心耳。",
    "X11n0269_001:0718c16_0": "二阿難下廣說為二一默請。",
    "X11n0269_001:0718c16_1": "▲注前來已奪者如云塵非常住若變滅時此心則同龜毛兔角等豈假根塵者如引盲人見暗亦是根塵故。",
    "X11n0269_001:0718c18_2": "△二爾時下顯示分二一明見非搖動二明性無生滅初又二一正明二結斥初又二一據陳那昔解示二對阿難現相示初又三一問解。",
    "X11n0269_001:0719a03_3": "▲注阿若多如圓通中解摩訶男即白飯王子也頞鞞或云阿濕婆亦曰阿說即馬勝也婆提或言跋提即甘露飯王子婆敷或作十力迦也蓋未詳初五是外族中三是內族。",
    "X11n0269_001:0719a06_4": "▲三轉十二行法輪者一示轉謂此是苦等二勸轉謂苦應知集應斷滅應證道應修三證轉謂苦我已知不復更知乃至道已修不復更修三轉皆生眼智明覺成十二行能摧煩惱故名法輪。",
    "X11n0269_001:0719a10_5": "▲四諦之境者準天台四教立四種四諦謂生滅無生無量無作今且指生滅四諦也止觀云苦則三相遷移(生異滅)集則四心流動(四分煩惱)道則對治易奪滅則滅有還無。",
    "X11n0269_001:0719a13_6": "▲或曰下孤山義也法華玄文顯以客塵為見思惑故知圓師所解非也。",
    "X11n0269_001:0719a14_7": "△二時下答釋又二一總答。",
    "X11n0269_001:0719a15_8": "▲經長老者長阿含明三種長老一年二法三詐今具前二也。",
    "X11n0269_001:0719a16_9": "△二世尊下別釋。",
    "X11n0269_001:0719a17_10": "▲經俶裝者俶尺叔切張平子思玄賦云簡元辰而俶裝注曰俶始也谷響引漢書曹參趣裝例今俶與趣同今讀曰促此恐不爾。",
    "X11n0269_001:0719a19_11": "▲注迷事惑者事謂六塵之境惑即修道所斷三界十使此名俱生煩惱一切凡夫皆有故其義是麤。",
    "X11n0269_001:0719a21_12": "▲迷理惑者理謂邊邪等道惑即見道所斷八十八使此名分別煩惱外道學人方有故其義則細。",
    "X11n0269_001:0719a23_13": "▲鈍使難破者若破俱生修道位長故。",
    "X11n0269_001:0719a24_14": "▲利使易斷者若斷分別見道心疾故。",
    "X11n0269_001:0719a24_15": "△三佛言下印成。",
    "X11n0269_001:0719b01_16": "△二即時下對阿難現相示又二一舉手開合二飛光左右初又三一現相二謂阿難下審見三佛言下印成如文。",
    "X11n0269_001:0719b03_17": "△二如來下飛光左右又三一現相。",
    "X11n0269_001:0719b04_18": "▲經右盻或作辨同匹莧切或作[盻八]眄同莫甸切皆視也谷響云於義並通不須改也。",
    "X11n0269_001:0719b05_19": "△二佛告下審見。",
    "X11n0269_001:0719b06_20": "△三佛言下印成如文。",
    "X11n0269_001:0719b06_21": "△二於是下結斥又二一結前經若復下結陳那所解汝觀下結阿難所答。",
    "X11n0269_001:0719b08_22": "▲作此雙結者欲假其義斥大眾之失故。",
    "X11n0269_001:0719b08_23": "△二云何下斥失。",
    "X11n0269_001:0719b09_24": "▲經以動為身等責其妄認現前流動之相為身為境而不知真見之性本無動相也。",
    "X11n0269_001:0719b12_0": "首楞嚴經集解熏聞記卷第一"
}