{
    "X12n0272_002:0012b17_0": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經合論卷第二論曰經起前文吾今為汝建大法幢至下文幻妄稱相其性真為妙覺明體處義分九段皆世尊大慈以智方便令微細觀照破滅無明無明未盡名未成佛圓覺曰永斷無明方成佛道馬鳴曰以大智慧破滅無明無明略說有二種一者根本二者現行何謂根本無明曰謂一切不知故喻如生而盲者以生即無所見故無所復疑眾生不知有佛性亦復如是世尊悲憐於此如世神醫以金錍括膜發其光明使其分辯諸境界曉然無惑如敘動靜敘斷常敘正倒敘彼我等是也故初自舉手飛光以顯發動靜二相故第二令觀河呈見見不生滅之地分斷常故第三示正倒手明隨順妙覺名正偏知若不隨順號性顛倒故第四指非是物而見不見者即自體故又問何謂現行無明曰橫生種種疑故喻如夜行之人瞑無所見以無所見故則有疑心眾生疑心障道亦復如是世尊擕之於此又如世導師執持火炬破其疑暗使其昭然親證無惑如敘大小敘前後敘堅執敘成壞等是也故第五自觀四天王勝藏寶殿退居室中見非舒縮故第六擇其見精出是非是無前後故第七使自甄明有自然體破堅執故第八示見見之時見非是見見非因緣所成就故又將欲敷演大陀羅尼諸三摩提妙修行路譏訶阿難強記無益為說二種顛倒見妄是為九段義方起下文以示五陰行相之義。",
    "X12n0272_002:0012c21_0": "爾時阿難及諸大眾聞佛示誨身心泰然念無始來失却本心妄認緣塵分別影事今日開悟如失乳兒忽遇慈母合掌禮佛願聞如來顯出身心真妄虗實現前生滅與不生滅二發明性時波斯匿王起立白佛我昔未承諸佛誨敕見迦旃延毗羅胝子咸言此身死後斷滅名為涅槃我雖值佛今猶狐疑云何發揮證知此心不生滅地今此大眾諸有漏者咸皆願聞。",
    "X12n0272_002:0013a05_0": "佛告大王汝身現在今復問汝汝此肉身為同金剛常住不朽為復變壞世尊我今此身終從變滅。",
    "X12n0272_002:0013a07_0": "佛言大王汝未曾滅云何知滅世尊我此無常變壞之身雖未曾滅我觀現前念念遷謝新新不住如火成灰漸漸銷殞殞亡不息決知此身當從滅盡。",
    "X12n0272_002:0013a10_0": "佛言如是大王汝今生齡已從衰老顏貌何如童子之時世尊我昔孩孺膚腠潤澤年至長成血氣充滿而今頺齡迫於衰耄形色枯悴精神昏昧髮白面皺逮將不久如何見比充盛之時。",
    "X12n0272_002:0013a14_0": "佛言大王汝之形容應不頓朽王言世尊變化密移我誠不覺寒暑遷流漸至於此何以故我年二十雖號年少顏貌已老初十歲時三十之年又衰二十于今六十又過于二觀五十時宛然強壯世尊我見密移雖此殂落其間流易且限十年若復令我微細思惟其變寧唯一紀二紀實為年變豈唯年變亦兼月化何直月化兼又日遷沈思諦觀剎那剎那念念之間不得停住故知我身終從變滅。",
    "X12n0272_002:0013a22_0": "佛告大王汝見變化遷改不停悟知汝滅亦於滅時汝知身中有不滅耶波斯匿王合掌白佛我實不知佛言我今示汝不生滅性大王汝年幾時見恒河水王言我生三歲慈母擕我謁耆婆天經過此流爾時即知是恒河水佛言大王如汝所說十二之時衰於十歲乃至六十日月歲時念念遷變則汝三歲見此河時至年十三其水云何王言如三歲時宛然無異乃至于今年六十二亦無有異佛言汝今自傷髮白面皺其面必定皺於童年則汝今時觀此恒河與昔童時觀河之見有童耄不王言不也世尊佛言大王汝面雖皺而此見精性未曾皺皺者為變不皺非變變者受滅彼不變者元無生滅云何於中受汝生死而猶引彼末伽黎等都言此身死後全滅王聞是言信知身後捨生趣生與諸大眾踊躍歡喜得未曾有。",
    "X12n0272_002:0013b12_0": "論曰如前文世尊舉手飛光但是顯發動靜二相而巳動靜既分見無搖動矣是謂方便小乘法也故以憍陳那自陳所悟客塵二字今觀河呈見見不生滅之地而已令知生滅是斷不生滅是常斷常既分性無生滅矣是謂對機俗諦道也故恃波斯匿王趣而問義將示最上乘而先言小乘將演真勝義性而先言俗諦自淺而入深說法之敘如是所以盡其執情使其妄枯而真現也迦旃延具云迦羅鳩陀迦旃延毗羅胝子具云[月*刖]闍夜毗羅胝子俱舍論曰時極少名剎那時極長名劫仁王經曰一念中有九十剎那一剎那有九百生滅剎那時分也耆婆此云命西域所謂長命天神也末伽黎具云末伽黎拘賒黎子末伽黎其字也母名拘賒黎六師之中斷見類也先儒甞原性曰性與生俱生其意曰俱生即俱死耳審是桀紂為得計非之何益孔孟為無術是之何益僧史記秦釋曇諦方母孕夢僧留麈尾鐵鏤書鎮即覺而二物俱在已而生諦蓋秦王請宏覺法師說法華經所奉者耳曇諦宏覺後身也唐宰相房琯同異人邢和璞遊夏口佛祠钁於松下得巨甕中有婁師德永禪師之像邢曰頗憶此乎房忽見其身為永禪師永房琯前身也使傳記妄傳之則已如其不然則二事豈可誣哉。",
    "X12n0272_002:0013c10_1": "補曰世尊將示波斯匿王不生滅地即指恒河水令先識見無童耄後悟性無生滅如來示教之意其先後次序蓋如此不知無盡果何見而悉刪之耶。",
    "X12n0272_002:0013c14_0": "阿難即從座起禮佛合掌長跪白佛世尊若此見聞必不生滅云何世尊名我等輩遺失真性顛倒行事願興慈悲洗我塵垢。",
    "X12n0272_002:0013c17_0": "即時如來垂金色臂輪手下指示阿難言汝今見我母陀羅手為正為倒阿難言世間眾生以此為倒而我不知誰正誰倒佛告阿難若世間人以此為倒即世間人將何為正阿難言如來竪臂兜羅綿手上指於空則名為正佛即竪臂告阿難言若此顛倒首尾相換諸世間人一倍瞻視則知汝身與諸如來清淨法身比類發明如來之身名正徧知汝等之身號性顛倒隨汝諦觀汝身佛身稱顛倒者名字何處號為顛倒。",
    "X12n0272_002:0014a02_0": "于時阿難與諸大眾瞪瞢瞻佛目睛不瞬不知身心顛倒所在佛興慈悲哀愍阿難及諸大眾發海潮音徧告同會諸善男子我常說言色心諸緣及心所使諸所緣法唯心所現汝身汝心皆是妙明真精妙心中所現物云何汝等遺失本妙圓妙明心寶明妙性認悟中迷晦昧為空空晦暗中結暗為色色雜妄想想相為身聚緣內搖趣外奔逸昏擾擾相以為心性一迷為心決定惑為色身之內不知色身外洎山河虗空大地咸是妙明真心中物譬如澄清百千大海棄之唯認一浮漚體目為全潮窮盡瀛渤汝等即是迷中倍人如我垂手等無差別如來說為可憐愍者。",
    "X12n0272_002:0014a13_0": "論曰母陀羅此云印兜羅綿此云網相海潮音時語也應此機授此法時也本一法也而必言曰圓明妙心寶明妙性何也曰圓有不住義寶有不動義不動者本妙之覺體不住者隨緣之智用與雜華隨緣不變之旨同也以念為知心則不徧故馬鳴曰若心有動非真識知動相者念礙也離諸念礙其知乃徧故名正徧知若以四大為身六塵緣影為心而背空寂之體靈知之知故號性顛倒阿難默計曰如波斯匿王尚足以知不生滅性於生滅之中則我亦能於是中證知其性同佛眾生三無差別故曰若此見聞必不生滅云何世尊名我等輩遺失真性顛倒行事世尊將開示其所以然乃垂手已而又竪之意若曰汝今迷昧之極能識此乎而阿難曰垂手為倒竪手為正者隨世間之解也世尊意曰但是一手耳而首尾相換之頃便成正倒則可以知隨順戒定慧方便觀照故成佛隨順無明行識乃至老死故成眾生自晦昧為空空晦暗中乃至迷中倍人則曰如我垂手等無差別則於此以垂手合法是倒明矣而舊疏曰垂手順身為正阿難反以為倒竪手逆身為倒阿難反以為正是謂一倍瞻視審如此義則經文至迷中倍人處當曰如我竪手等無差別乃曰垂手何哉經文無此意其議橫入如羊袖續白狐之裘不知古師何所依稟而注釋之。",
    "X12n0272_002:0014b12_1": "補曰慶喜雖悟知此玅明真精妙心與佛無別而固遺棄之反執妄身妄心為自心性是為認悟中迷顛倒行事如來即掇其顛倒之妄用以比類使合本玅則曰汝身汝心皆是真精玅心中所現物又曰不知色身外洎山河虗空大地咸是玅明真精妙心中物如以淨莊嚴寶珠置泥潦之中則洿濁冷然自清倘至此會萬物為自己舉必無遺認一漚為全潮成迷中倍人矣迷中倍人者不悟而迷曰迷人悟之而迷曰迷中倍人亦迷之又迷之謂也百千大海喻玅心玅性一浮漚體喻妄身妄心耳。",
    "X12n0272_002:0014b23_0": "阿難承佛悲救深誨垂泣叉手而白佛言我雖承佛如是玅音悟玅明心元所圓滿常住心地而我悟佛現說法音現以緣心允所瞻仰徒獲此心未敢認為本元心地願佛哀愍宣示圓音拔我疑根歸無上道佛告阿難汝等尚以緣心聽法此法亦緣非得法性如人以手指月示人彼人因指當應看月若復觀指以為月體此人豈唯亡失月輪亦亡其指何以故以所標指為明月故豈唯亡指亦復不識明之與暗何以故即以指體為月明性明暗二性無所了故汝亦如是若以分別我說法音為汝心者此心自應離分別音有分別性譬如有客寄宿旅亭暫止便去終不常住而掌亭人都無所去名為亭主此亦如是若真汝心則無所去云何離聲無分別性斯則豈唯聲分別心分別我容離諸色相無分別性如是乃至分別都無非色非空拘舍離等昧為冥諦離諸法緣無分別性則汝心性各有所還云何為主。",
    "X12n0272_002:0014c15_0": "阿難言若我心性各有所還則如來說妙明元心云何無還惟垂哀愍為我宣說。",
    "X12n0272_002:0014c17_0": "佛告阿難且汝見我見精明元此見雖非妙精明心如第二月非是月影汝應諦聽今當示汝無所還地阿難此大講堂洞開東方日輪升天則有明曜中夜黑月雲霧晦瞑則復昏暗戶牖之隙則復見通牆宇之間則復觀壅分別之處則復見緣頑虗之中徧是空性鬱[土*孛]之象則紆昏塵澄霽斂氛又觀清淨阿難汝咸看此諸變化相吾今各還本所因處云何本因阿難此諸變化明還日輪何以故無日不明明因屬日是故還日暗還黑月通還戶牖壅還墻宇緣還分別頑虗還空鬱[土*孛]還塵清明還霽則諸世間一切所有不出斯類汝見八種見精明性當欲誰還何以故若還於明則不明時無復見暗雖明暗等種種差別見無差別諸可還者自然非汝不汝還者非汝而誰則知汝心本妙明淨汝自迷悶喪本受輪於生死中常被漂溺是故如來名可憐愍。",
    "X12n0272_002:0015a08_0": "阿難言我雖識此見性無還云何得知是我真性。",
    "X12n0272_002:0015a09_0": "佛告阿難吾今問汝今汝未得無漏清淨承佛神力見於初禪得無障礙而阿那律見閻浮提如觀掌中菴摩羅果諸菩薩等見百千界十方如來窮盡微塵清淨國土無所不矚眾生洞視不過分寸阿難且吾與汝觀四天王所住宮殿中間徧覽水陸空行雖有昏明種種形像無非前塵分別留礙汝應於此分別自他今吾將汝擇於見中誰是我體誰為物象阿難極汝見源從日月宮是物非汝至七金山周徧諦觀雖種種光亦物非汝漸漸更觀雲騰烏飛風動塵起樹木山川草芥人畜咸物非汝阿難是諸近遠諸有物性雖復差殊同汝見精清淨所矚則諸物類自有差別見性無殊此精妙明誠汝見性若見是物則汝亦可見吾之見若同見者名為見吾吾不見時何不見吾不見之處若見不見自然非彼不見之相若不見吾不見之地自然非物云何非汝又則汝今見物之時汝既見物物亦見汝體性紛雜則汝與我并諸世間不成安立阿難若汝見時是汝非我見性周徧非汝而誰云何自疑汝之真性性汝不真取我求實。",
    "X12n0272_002:0015b03_0-0": "論曰心有二種謂玅明之心謂緣妄之心玅明之心寂滅以此心聽法則法法寂滅如甜說蜜如波歸水緣妄之心分別以此心聽法則法法成辦如赤蠖虫食青則青食黃即黃世尊之意欲汝阿難聽如眼聞聲若以耳分別而認以為真實者誤矣故舉標月譬也借汝阿難分別佛說法之音便為心者應離此法音之外尚有分別之心存焉何以故以法音有起滅心體非起滅故今何不然故舉主客譬也離法音之外亦無分別之心則成斷滅豈如主常住之心乎故曰分別都盡非色非空拘舍離等昧為冥諦也外道立二十五諦最初一諦名為冥性計以為常第二十五諦名為神我亦計為常思我聖境冥性即變二十三諦為我所用我所受用為境纏縛不得解脫我若不思冥諦不變即無纏縛我即解脫此其所宗也離法緣之外亦無分別之心然不成斷滅則應即此法緣當便是汝阿難之心矣此心果是法緣故應各有所還故曰離諸法緣無分別性則汝心性各有所還也法緣不出八種皆妄發現如人揑目見月脇之月故曰如第二月非是月影今八種皆以還盡而見八種者獨無所還大哉世尊之辯精深明白如是之玅故阿難於是證知真精明體徧滿清淨究竟寂滅然尚有憂曰何憂乎曰憂此真精明體與佛眾生平等同時證知不能分辯使不雜和欲令如目前所觀之物樅然不惑故曰云何得知是我真性也夫性見清淨緣見有形世尊憫阿難以清淨之性見同有形之物象故曲折其詞欲盡其惑謂有形之物我汝同見可名同見性見清淨清淨空也但可自見非他能見故曰若見不見自然非彼不見之相言非彼者非世尊不見之相但是阿難不見之相耳然則世尊不見之地亦非阿難可見但是世尊能見故曰若不見吾不見之地自然非物言非物者非是世尊之見但是阿難不見之相耳於阿難言不見之相於世尊言不見之地能所之詞變也倘世尊亦見阿難之見阿難亦見世尊之見則清淨性見宛成有形之物故曰汝若見物物亦見汝體性紛雜則汝與我并諸世間不成安立故明告曰若汝見時是汝非我見性周徧非汝而誰馬鳴曰一切如來皆是法身無有彼此差別互相見故與此同意世尊開示見不見之相者即當了知真性不當更求分別也此段經義全生於云何得知是我真性一句但語簡而意密非麤浮心識者所能知義學之師立為隱二存三之義誤矣。",
    "X12n0272_002:0015c22_0": "補曰長水曰此之文意展轉結歸應有五重經文存三而隱二之意若具論云若不見吾不見之處亦不見吾見處既不見吾見處吾見自然非物吾見若非是物汝見亦非是物汝見既非是物云何非汝真見長水之義諸師皆以為然寂音獨非之愚始謂寂音好辯及究其所非者則如來之旨曉然如指諸掌方知寂音所見出於常情益可以敬服矣問曰阿難請問云何得知是我真性如來反以見疊而問之何歟曰此默傳妙契之道也逮至八種法緣還盡之處則曰不汝還者非汝而誰又至自然非物處則曰見性周徧非汝而誰世尊之至慈方便無過於此倘尚情存物見縱親奉玄音亦安能領悟哉言眾生洞視不過分寸者謂被分寸之物所障不能見障外之形色非謂見不能過分寸也如窻壁屏幃等皆為所障之物蓋凡夫肉眼未得無礙耳。",
    "X12n0272_002:0016a14_0": "阿難白佛言世尊若此見性必我非餘我與如來觀四天王勝藏寶殿居日月宮此見周圓徧娑婆國退歸精舍秪見伽藍清心戶堂但瞻簷廡世尊此見如是其體本來周徧一界今在室中唯滿一室為復此見縮大為小為當墻宇夾令斷絕我今不知斯義所在願垂弘慈為我敷演。",
    "X12n0272_002:0016a20_0": "佛告阿難一切世間大小內外諸所事業各屬前塵不應說言見有舒縮譬如方器中見方空吾復問汝此方器中所見方空為復定方為不定方若定方者別安圓器空應不圓若不定者在方器中應無方空汝言不知斯義所在義性如是云何為在阿難若復欲令入無方圓但除器方空體無方不應說言更除虗空方相所在若如汝問入室之時縮見令小仰觀日時汝豈挽見齊於日面若築墻宇能夾見斷穿為小竇寧無續迹是義不然一切眾生從無始來迷己為物失於本心為物所轉故於是中觀大觀小若能轉物則同如來身心圓明不動道場於一手端徧能含受十方國土。",
    "X12n0272_002:0016b08_0": "論曰於方器中若無方空則空之體不定於圓器中若有方空則空之體有定若空體隨器之方圓成形則空之體非定不定之相也世間前塵大小內外者方圓器之譬也見精者空體之譬也此見精之力謂有舒縮乎則觀月觀簷遠近一覽同時而至其處謂無舒縮乎則涴瓶之塵雖微心察翳月之滓至大必昧謂無斷絕乎則觀水亦見魚沙而見之力但止水際不到魚沙謂有斷絕乎則水及魚沙同時俱見無礙不礙是知遠近舒縮隔廓絕續全是意言自妄分別於明了地中任運建立如指第二之月是陰是晴是圓是缺無有是處涅槃經曰譬如有人欲見面像即便取刀師子吼言世尊以是義故乳中有酪性若刀無面像何故取刀佛言善男子若此刀中定有面象何故顛倒竪則見長橫則見闊若是自面何故見長若是他面何得稱言是己面像若因己面見他面像者何故不見驢馬面像師子吼言世尊眼光實到彼何以故近遠一時俱見故不見中間所有物故善男子光若到彼而得見者一切眾生悉見於火何故不燒如人遠見白物不應生疑鶴耶幡耶人耶樹耶若光到者云何得見水精中物淵中魚石若不到者何故得見水精中物而不得見壁外之色是故若言眼光到彼而見面者是義不然列子謂兩小兒辯鬬一曰日出大而近及午小而遠一曰日出涼故遠及午熱而近二兒不能定其是非而質諸仲尼仲尼不答善乎孔子其亦知此乎何言之深切著明哉。",
    "X12n0272_002:0016c11_0": "阿難白佛言世尊若此見精必我妙性今此玅性現在我前見必我真我今身心復是何物而今身心分別有實彼見無別分辯我身若實我心令我今見見性實我而身非我何殊如來先所難言物能見我惟垂大慈開發未悟。",
    "X12n0272_002:0016c16_0": "佛告阿難今汝所言見在汝前是義非實若實汝前汝實見者則此見精既有方所非無指示且今與汝坐祇陀林徧觀林渠及與殿堂上至日月前對恒河汝今於我師子座前舉手指陳是種種相陰者是林明者是日礙者是壁通者是空如是乃至草樹纖毫大小雖殊但可有形無不指著若必其見現在汝前汝應以手確實指陳何者是見阿難當知若空是見既已成見何者是空若物是見既已是見何者為物汝可微細披剝萬象析出精明淨玅見元指陳示我同彼諸物分明無惑。",
    "X12n0272_002:0017a02_0": "阿難言我今於此重閣講堂遠暨恒河上觀日月舉手所指縱目所觀指皆是物無是見者世尊如佛所說況我有漏初學聲聞乃至菩薩亦不能於萬物象前剖出精見離一切物別有自性佛言如是如是。",
    "X12n0272_002:0017a06_0": "佛復告阿難如汝所言無有精見離一切物別有自性則汝所指是物之中無是見者今復告汝汝與如來坐祇陀林更觀林苑乃至日月種種象殊必無見精受汝所指汝又發明此諸物中何者非見阿難言我實徧見此祇陀林不知是中何者非見何以故若樹非見云何見樹若樹即見復云何樹如是乃至若空非見云何見空若空即見復云何空我又思惟是萬象中微細發明無非見者佛言如是如是。",
    "X12n0272_002:0017a14_0": "於是大眾非無學者聞佛此言茫然不知是義終始一時惶悚失其所守如來知其魂慮變慴心生憐愍安慰阿難及諸大眾諸善男子無上法王是真實語如所如說不誑不妄非末伽黎四種不死矯亂論議汝諦思惟無忝哀慕。",
    "X12n0272_002:0017a19_0": "是時文殊師利法王子愍諸四眾在大眾中即從座起頂禮佛足合掌恭敬而白佛言世尊此諸大眾不悟如來發明二種精見色空是非是義世尊若此前緣色空等象若是見者應有所指若非見者應無所矚而今不知是義所歸故有驚怖非是疇昔善根輕鮮惟願如來大慈發明此諸物象與此見精元是何物於其中間無是非是。",
    "X12n0272_002:0017b02_0": "佛告文殊及諸大眾十方如來及大菩薩於其自住三摩地中見與見緣并所想相如虗空華本無所有此見及緣元是菩提玅淨明體云何於中有是非是文殊吾今問汝如汝文殊更有文殊是文殊者為無文殊如是世尊我真文殊無是文殊何以故若有是者則二文殊然我今日非無文殊於中實無是非二相佛言此見玅明與諸空塵亦復如是本是玅明無上菩提淨圓真心妄為色空及與聞見如第二月誰為是月又誰非月文殊但一月真中間自無是月非月是以汝今觀見與塵種種發明名為妄想不能於中出是非是由是精真玅覺明性故能令汝出指非指。",
    "X12n0272_002:0017b14_0-0": "論曰阿難竟以見精明之體為一物前則疑其有舒縮此又疑其有前後故世尊曰若實汝前汝實見者則此見精既有方所非無指示也然萬象有形可以指擿見精無相豈有處哉以有形之萬象現無相見精之明喻如明珠之光自照珠體雖甚微細之智不能分也雜華曰有一智人破彼微塵出大經卷塵是有耶則不言破塵是無耶則何用名以為塵哉又曰唯一堅密身一切塵中現身雜塵耶則不可言堅密唯一也不雜塵耶則不可言一切塵中現也此最深妙明了之旨以是意而推眾生日用皆平等究竟覺於是中無毫髮為緣為對緣對且不可得何從有生死哉所謂真語實語如所如說不誑不妄者即金剛般若經五語但彼以不妄為不異耳佛真語與二乘共也實語與菩薩共也如語不共無實無虗無虗故不誑無實故不異今言不妄者妄以對真得名所謂真妄一如而已則雖真亦妄故如所如說乃名不妄如所如者所謂如如也眾生意識處處能緣唯不能緣於般若如太末虫處處能集唯不能集火聚之上故世尊每曰般若如大火聚謂是故也此會阿難輩一時惶悚茫然者意識方緣是非是二者之義而是二者之義自體不存世尊恐其退墮特說是五語以堅其信力耳嗚呼世尊之法施可謂不貲既以密說而又正言何謂密說曰若空是見既已成見何者是空若物是見既已成見何者為物若樹非見云何見樹若樹即見復云何樹此為密說也深味而細觀之兩者同一寂滅何以知之以樹見不可分故世尊意令阿難自悟明之何謂正言曰於其自住三摩地中見與見緣并所想相如虗空華本無所有如文殊離是非二名無增語故如一真精玅覺明性離是非二見無剩法故所言如空華者世尊每以喻世相楞伽經首曰世間離生滅猶如虗空華智不得有無而興大悲心張文定方平為滁守日遊琅瑘山恍如夢覺呼梯取於梁之上有經函發之蓋楞伽經四卷",
    "X12n0272_002:0017b14_0-1": "寫未終者文定舉筆績之筆畫如一文定前身山中僧也讀空華之偈而悟今此經號二生經藏其家焉。",
    "X12n0272_002:0018a02_1": "補云阿難問諸物象與此見精元是何物欲冀如來揀定是非是義昭然示之如來亦欲令阿難親證見與見緣元是菩提玅淨明體於中無有是非二相即顧問文殊師利曰如汝文殊更有文殊是文殊者為無文殊文殊答曰世尊我真文殊無是文殊若有是者則二文殊而如來復為宣明曰但一月真中間自無是月非月譬如擊塗毒鼓遠近聞者皆喪昔修山主甞謂眾曰是柱不見柱非柱不見柱是非已去了是非裏薦取此老垂慈之至與先聖無小異第未知學者若為契旨哉言出是非是者結釋精見色空是非是義也出指非指者結釋若是見者應有所指也物為所指見非所指又豈可謂此是見此非見乎蓋由精真妙覺明性超彼諸所有相故名曰出無有精見集解作無有見精。",
    "X12n0272_002:0018a17_0": "阿難白佛言世尊誠如法王所說覺緣徧十方界湛然常住性非生滅與先梵志娑毗迦羅所談冥諦及投灰等諸外道種說有真我徧滿十方有何差別世尊亦曾於楞伽山為大慧等敷演斯義彼外道等常說自然我說因緣非彼境界我今觀此覺性自然非生非滅遠離一切虗妄顛倒似非因緣與彼自然云何開示不入羣邪獲真實心妙覺明性。",
    "X12n0272_002:0018a24_0": "佛告阿難我今如是開示方便真實告汝汝猶未悟惑為自然阿難若必自然自須甄明有自然體汝且觀此妙明見中以何為自此見為復以明為自以暗為自以空為自以塞為自阿難若明為自應不見暗若復以空為自體者應不見塞如是乃至諸暗等相以為自者則於明時見性斷滅云何見明。",
    "X12n0272_002:0018b06_0": "論云是非是義意處收法也阿難聞此見精明體出乎是非是義則意不能取如枯木有華如水有塵則迷以為自然故曰汝猶未明惑為自然也世尊前甞剗絕自然之論恐混濫正法而波及因緣欲以助發實相適今所談覺緣湛然以例外道所說真我徧滿漫不自分而曰似非因緣與彼自然者故掩露其詞陰縱以同世尊陽奪以歸宿於自然也西國有犀名駭鷄製以為枕仰覆前後四面視之其形常正夫四面正者因犀以成形而明暗空塞法法發揮全體無礙者皆見精明性之所成就此阿難所親證知乃認以為自然有自然體受甄明乎。",
    "X12n0272_002:0018b18_0": "阿難言必此玅見性非自然我今發明是因緣生心猶未明咨詢如來是義云何合因緣性佛言汝言因緣吾復問汝汝今因見見性現前此見為復因明有見因暗有見因空有見因塞有見阿難若因明有應不見暗如因暗有應不見明如是乃至因空因塞同於明暗復次阿難此見又復緣明有見緣暗有見緣空有見緣塞有見阿難若緣空有應不見塞若緣塞有應不見空如是乃至緣明緣暗同於空塞當知如是精覺妙明非因非緣亦非自然非不自然無非不非無是非是離一切相即一切法汝今云何於中措心以諸世間戲論名相而得分別如以手掌撮摩虗空秪益自勞虗空云何隨汝執捉。",
    "X12n0272_002:0018c06_0": "阿難白佛言世尊必玅覺性非因非緣世尊云何常與比丘宣說見性具四種緣所謂因空因明因心因眼是義云何。",
    "X12n0272_002:0018c09_0": "佛言阿難我說世間諸因緣相非第一義阿難吾復問汝諸世間人說我能見云何名見云何不見阿難言世人因於日月燈光見種種相名之為見若復無此三種光明則不能見阿難若無明時名不見者應不見暗若必見暗此但無明云何無見阿難若在暗時不見明故名為不見今在明時不見暗相還名不見如是二相俱名不見若復二相自相凌奪非汝見性於中暫無如是則知二俱名見云何不見是故阿難汝今當知見明之時見非是明見暗之時見非是暗見空之時見非是空見塞之時見非是塞四義成就汝復應知見見之時見非是見見猶離見見不能及云何復說因緣自然及和合相汝等聲聞狹劣無識不能通達清淨實相吾今誨汝當善思惟無得疲怠妙菩提路。",
    "X12n0272_002:0018c23_0": "論曰世有寶鏡種性清瑩然有翳有拭有開有掩方其翳非暗與之方其拭非明與之方其開非空與之方其掩非塞與之暗明開掩之不常而其種性則有常故世尊示見精明性者其容受明暗通塞四種緣塵此寶鏡如之今阿難心知自然之論已奪又執因緣之義為問避溺投火惑滋甚矣夫見性因空因明因心因眼者世尊一時方便對機之語非究竟之說也此會所示蓋是稱性法句如王寶劒不可觸故曰離一切相即一切法此其三世如來之所珍祕十方菩薩之所護持離見超情清淨寶相之體非二乘所知之境故世尊呵之曰汝輩聲聞狹劣無識不能通達耳而阿難方以有日月燈則因名有見無日月燈則因名無見是迷昧之極也豈不哀哉見性審如所解因日月燈三種緣塵生則日月燈三種緣塵滅時寧能見明暗自相凌奪乎曰見之矣然則此能見者又何物哉所謂見與見緣有五種義謂明暗空塞為四種見緣謂見精為一種見妄今世尊先破見緣故曰見明之時見非是明見暗之時見非是暗見空之時見非是空見塞之時見非是塞世尊於此分擇見精非前明暗空塞因緣而有故曰四義成就已而又將敘此見精使知亦猶是妄故曰汝復應知見見之時見非是見世尊於此又分擇真見非前見精以見精猶妄故也故曰見猶離見見不能及嗚呼首楞嚴之宗無見頂法於此發現矣。",
    "X12n0272_002:0019a24_0": "阿難白佛言世尊如佛世尊為我等輩宣說因緣及與自然諸和合相與不和合心猶未開而今更聞見見非見重增迷悶伏願弘慈施大慧目開示我等覺心明淨作是語已悲淚頂禮承受聖旨。",
    "X12n0272_002:0019b04_0": "爾時世尊憐愍阿難及諸大眾將欲敷演大陀羅尼諸三摩提妙修行路告阿難言汝雖強記但益多聞於奢摩他微密觀照心猶未了汝今諦聽吾當為汝分別開示亦令將來諸有漏者獲菩提果阿難一切眾生輪迴世間由二顛倒分別見妄當處發生當業輪轉云何二見一者眾生別業妄見二者眾生同分妄見。",
    "X12n0272_002:0019b11_0": "云何名為別業妄見阿難如世間人目有赤眚夜見燈光別有圓影五色重疊於意云何此夜燈明所現圓光為是燈色為當見色阿難此若燈色則非眚人何不同見而此圓影唯眚之觀若是見色見已成色則彼眚人見圓影者名為何等復次阿難若此圓影離燈別有則合傍觀屏帳几筵有圓影出離見別有應非眼矚云何眚人目見圓影是故當知色實在燈見病為影影見俱眚見眚非病終不應言是燈是見於是中有非燈非見如第二月非體非影何以故第二之觀揑所成故諸有智者不應說言此揑根元是形非形離見非見此亦如是目眚所成今欲名誰是燈是見何況分別非燈非見。",
    "X12n0272_002:0019b23_0": "云何名為同分妄見阿難此閻浮提除大海水中間平陸有三千洲正中大洲東西括量大國凡有二千三百其餘小洲在諸海中其間或有三兩百國或一或二至于三十四十五十阿難若復此中有一小洲秪有兩國唯一國人同感惡緣則彼小洲當土眾生覩諸一切不祥境界或見二日或見兩月其中乃至暈適珮玦彗孛飛流負耳虹蜺種種惡相但此國見彼國眾生本所不見亦復不聞。",
    "X12n0272_002:0019c07_0": "論曰暈暈氣也適所謂適見于日月之災珮玦氣狀如此彗所謂埽星偏指曰彗芒氣四出日孛飛星自下而升者流星自上而降者負氣背日如負者耳氣旁日如耳者虹蜺螮蝀也明者虹暗者霓春秋傳曰魯哀公六年楚有雲如赤鳥夾日以飛三日楚子使問諸周太史周太史曰其當王身乎杜預注曰日為人君妖氣守之故以為王身雲在楚上唯楚見之故禍不及他國又魯昭公二十六年冬十一月齊有彗星齊侯使禳之晏子曰無益也只取誣焉天道不陷不貳其命若之何禳且天道之有彗也以除穢也君無穢也又何禳焉若德之穢禳之何損杜預注曰出齊之分野也不書魯不見以是驗有一小洲秪有兩國唯一國人同感惡緣則彼小洲當土眾生覩諸一切不祥境界明矣。",
    "X12n0272_002:0019c22_0": "阿難吾今為汝以此二事進退合明阿難如彼眾生別業妄見矚燈光中所現圓影雖似前境終彼見者目眚所成眚即見勞非色所造然見眚者終無見咎例汝今日以目觀見山河國土及諸眾生皆是無始見病所成見與見緣似現前境元我覺明見所緣眚覺見即眚本覺明心覺緣非眚覺所覺眚覺非眚中此實見見云何復名覺聞知見是故汝今見我及汝并諸世間十類眾生皆即見眚非見眚者彼見真精性非眚者故不名見阿難如彼眾生同分妄見例彼妄見別業一人一病目人同彼一國彼見圓影眚妄所生此眾同分所現不祥同見業中瘴惡所起俱是無始見妄所生例閻浮提三千洲中兼四大海娑婆世界并暨十方諸有漏國及諸眾生同是覺明無漏妙心見聞覺知虗妄病緣和合妄生和合妄死若能遠離諸和合緣及不和合則復滅除諸生死因圓滿菩提不生滅性清淨本心本覺常住。",
    "X12n0272_002:0020a14_0": "論曰眾生現行分別謂之浮塵此浮塵未起則圓明了知謂之現量剎那流入意地便成外境然似之而非謂之似量故曰見與見緣似現前境而此浮塵之起由覺明故覺明者強覺妄知違時失候者非本自妙而常明徧知之體也又名妄覺以因此覺妄故有所緣眚之病也故曰元我覺明見所緣眚以即此覺明之體全是無明馬鳴曰依本覺有不覺依不覺有始覺也故曰覺見即眚於覺妄則言元我於圓明了知現量之境則言本覺何也曰元始覺之異名耳依不覺說有始覺謂是故也本性覺之異名耳依本覺說有不覺謂是故也故曰本覺明心覺緣非眚也言覺所覺眚者疊元我覺明見所緣眚以覺所覺之緣有故言覺非眚中者疊本覺明心覺緣非眚以浮塵未起不墮明了意地眚中故此非見聞覺知之境故曰此實見見云何復名覺聞知見乎。",
    "X12n0272_002:0020b06_0": "阿難汝雖先悟本覺妙明性非因緣非自然性而猶未明如是覺元非和合生及不和合阿難吾今復以前塵問汝汝今猶以一切世間妄想和合諸因緣性而自疑惑證菩提心和合起者則汝今者妙淨見精為與明和為與暗和為與通和為與塞和若明和者且汝觀明當明現前何處雜見見相可辨雜何形像若非見者云何見明若即見者云何見見必見圓滿何處和明若明圓滿不合見和見必異明雜則失彼性明名字雜失明性和明非義彼暗與通及與羣塞亦復如是。",
    "X12n0272_002:0020b16_0": "復次阿難又汝今者妙淨見精為與明合為與暗合為與通合為與塞合若明合者至於暗時明相已滅此見即不與諸暗合云何見暗若見暗時不與暗合與明合者應非見明既不見明云何明合了明非暗彼暗與通及諸羣塞亦復如是。",
    "X12n0272_002:0020b21_0": "阿難白佛言世尊如我思惟此玅覺元與諸緣塵及心念慮非和合耶佛言汝今又言覺非和合吾復問汝此妙見精非和合者為非明和為非暗和為非通和為非塞和若非明和則見與明必有邊畔汝且諦觀何處是明何處是見在見在明自何為畔阿難若明際中必無見者則不相及自不知其明相所在畔云何成彼暗與通及諸羣塞亦復如是。",
    "X12n0272_002:0020c04_0": "又妙見精非和合者為非明合為非暗合為非通合為非塞合若非明合則見與明性相乖角如耳與明了不相觸見且不知明相所在云何甄明合非合理彼暗與通及諸羣塞亦復如是阿難汝猶未明一切浮塵諸幻化相當處出生隨處滅盡幻妄稱相其性真為妙覺明體。",
    "X12n0272_002:0020c10_0": "論曰涅槃經曰甘露之性令人不死若合異物亦能不死世尊以寂滅之體名甘露滅者謂其不死而寂滅也故維摩經稱甘露滅覺道成寶積經曰了生無生盡無盡知眼性離無去來為世照明甘露滅何故現斯金色光又曰觀睒魔鬼趣饑渴大苦逼為證妙菩提施不死甘露如此經前文微細披剝析出見精曉然現前而特告曰幻妄稱相其性真為妙覺明體者甘露滅也謂其曰一切浮塵諸幻化相當處出生隨處滅盡故。",
    "X12n0272_002:0020c19_0": "如是乃至五陰六入從十二處至十八界因緣和合虗妄有生因緣別離虗妄名滅殊不能知生滅去來本如來藏常住妙明不動周圓妙真如性性真常中求於去來迷悟生死了無所得。",
    "X12n0272_002:0020c23_0": "補曰梵語塞徤陀此云陰又云蘊鉢羅吠奢此云入阿也怛那此云處馱都此云界以其能蓋覆真性曰陰根取塵曰入根塵相生而成曰處根塵識三互相因而立曰界然陰入與處界皆非實有故下文一一破之若知陰入處界生滅去來本如來藏玅真如性則迷悟生死了不可得。",
    "X12n0272_002:0021a05_0": "阿難云何五陰本如來藏妙真如性阿難譬如有人以清淨目觀晴明空唯一晴虗迥無所有其人無故不動目睛瞪以發勞則於虗空別見狂華復有一切狂亂非相色陰當知亦復如是阿難是諸狂華非從空來非從目出如是阿難若空來者既從空來還從空入若有出入即非虗空空若非空自不容其華相起滅如阿難體不容阿難若目出者既從目出還從目入即此華性從目出故當合有見若有見者去既華空旋合見眼若無見者出既翳空旋當翳眼又見華時目應無翳云何晴空號清明眼是故當知色陰虗妄本非因緣非自然性。",
    "X12n0272_002:0021a16_0": "阿難譬如有人手足宴安百骸調適忽如忘生性無違順其人無故以二手掌於空相摩於二手中妄生澁滑冷熱諸相受陰當知亦復如是阿難是諸幻觸不從空來不從掌出如是阿難若空來者既能觸掌何不觸身不應虗空選擇來觸若從掌出應非待合又掌出故合則掌知離則觸入臂腕骨髓應亦覺知入時蹤迹必有覺心知出知入自有一物身中往來何待合知要名為觸是故當知受陰虗妄本非因緣非自然性。",
    "X12n0272_002:0021b01_0": "阿難譬如有人談說酢梅口中水出思蹋懸崖足心酸澁想陰當知亦復如是阿難如是酢說不從梅生非從口入如是阿難若梅生者梅合自談何待人說若從口入自合口聞何須待耳若獨耳聞此水何不耳中而出想蹋懸崖與說相類是故當知想陰虗妄本非因緣非自然性。",
    "X12n0272_002:0021b07_0": "阿難譬如暴流波浪相續前際後際不相踰越行陰當知亦復如是阿難如是流性不因空生不因水有亦非水性非離空水如是阿難若因空生則諸十方無盡虗空成無盡流世界自然俱受淪溺若因水有則此暴流性應非水有所有相今應現在若即水性則澄清時應非水體若離空水空非有外水外無流是故當知行陰虗妄本非因緣非自然性。",
    "X12n0272_002:0021b14_0": "阿難譬如有人取頻伽瓶塞其兩孔滿中擎空千里遠行用餉他國識陰當知亦復如是阿難如是虗空非彼方來非此方入如是阿難若彼方來則本瓶中既貯空去於本瓶地應少虗空若此方入開孔倒瓶應見空出是故當知識陰虗妄本非因緣非自然性。",
    "X12n0272_002:0021b19_0-0": "論曰龍勝偈曰諸法不自生亦不從他生不共不無因是故說無生夫諸法不自生待諸緣故不從他生諸緣無自性故不共生智及修行體空無自性無合散故不無因要待覺悟修行方顯不自然成故故知此妙覺明體離一切過本自無生也然世尊又遮如言執防阿難犯之認為斷滅為說五陰軀命六入十二處十八界雖有現行實無能所猶如夢事龍勝曰夢有五種若身中不調若熱氣多則見火見黃見赤若冷氣多則見水見白若風氣多則見飛見黑又復所聞見事多思惟念故則夢或天與夢欲令知未來事是五種夢無實事而妄見人亦如是五道中眾生身見力因緣故見四種我色眾是我色是我我中色色中我合云唯色是我唯離色是我我在色中色在我中如是推求了不可得如色既爾受想行識亦如是又曰諸菩薩知諸法如響如乾闥婆城者日出時見樓櫓宮殿行人出入日轉高轉滅此城但可眼見而無有實是名乾闥婆城有人初不見乾闥婆城晨朝向東見之意謂實有疾行趨之轉近轉滅又如睒魔鬼趣饑渴悶極見熱氣如野馬謂之為水疾走趨之轉近轉滅疲極困厄至窮山峽谷中大喚啼哭聞有響應謂有居民求之疲極而無所見思惟自悟渴願心息無智人亦如是陰入界中見吾我及諸法婬嗔心著四方狂走求樂自瞞顛倒狂歇窮極懊惱若以智慧知無我無實法者是時顛倒願息前言身見力因緣故見四種我此言如是陰入界中見吾我及諸法皆以為夢為乾闥婆城如野馬如谷響此其大槩也至於盡微細執情則見於下文云。",
    "X12n0272_002:0021c23_1": "補曰頻伽又云毗伽具云羯羅頻伽又云迦陵頻伽迦陵此云好頻伽此云聲即好聲烏也其瓶形似之法句經曰精神居形內猶雀藏瓶中瓶破則雀飛去矣淨覺以人喻業以瓶喻身以空喻識人擎空而行猶業持身識而去者殆未盡善也若以人喻業前三陰皆言譬如有人等亦應猶業持身而去愚則以瓶喻陰之區宇故下文曰是以名為識陰區宇是也空喻識則如之謂無分別為真空有分別為識性也人則舉以起喻耳大率與法句經不相遠云。",
    "X12n0272_002:0022a10_0": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經合論卷第二音切甄(音堅)。",
    "X12n0272_002:0022a14_1": "胝(音支)。",
    "X12n0272_002:0022a14_2": "腠(音揍)。",
    "X12n0272_002:0022a14_3": "耄(音冐)。",
    "X12n0272_002:0022a14_4": "殂(音鋤)。",
    "X12n0272_002:0022a14_5": "擕(音携)。",
    "X12n0272_002:0022a14_6": "琯(音管)。",
    "X12n0272_002:0022a14_7": "瞪(音鄭)。",
    "X12n0272_002:0022a14_8": "瞢(武亘切)。",
    "X12n0272_002:0022a15_0": "洿(音烏)。",
    "X12n0272_002:0022a15_1": "慴(之涉切)。",
    "X12n0272_002:0022a15_2": "蠖(音鑊)。",
    "X12n0272_002:0022a15_3": "樅(音窓)。",
    "X12n0272_002:0022a15_4": "矯(居夭切)。",
    "X12n0272_002:0022a15_5": "擿(音隻)。",
    "X12n0272_002:0022a15_6": "貲(音滋)。",
    "X12n0272_002:0022a15_7": "眚(所景切)。",
    "X12n0272_002:0022a16_0": "暈(音運)。",
    "X12n0272_002:0022a16_1": "玦(音決)。",
    "X12n0272_002:0022a16_2": "彗(音衛)。",
    "X12n0272_002:0022a16_3": "埽(音掃)。",
    "X12n0272_002:0022a16_4": "酢(音醋)。",
    "X12n0272_002:0022a16_5": "睒(吐濫切)。",
    "X12n0272_002:0022a16_6": "餉(式亮切)。"
}