{
    "X14n0289_004:0324c06_0": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經合轍卷第四明　二楞菴釋　通潤　述爾時富樓那彌多羅尼子在大眾中即從座起偏袒右肩右膝著地合掌恭敬而白佛言大威德世尊善為眾生敷演如來第一義諦世尊常推說法人中我為第一今聞如來微妙法音猶如聾人逾百步外聆於蚊蚋本所不見何況得聞佛雖宣明令我除惑今猶未詳斯義究竟無疑惑地世尊如阿難輩雖則開悟習漏未除我等會中登無漏者雖盡諸漏今聞如來所說法音尚紆疑悔世尊若復世間一切根塵陰處界等皆如來藏清淨本然云何忽生山河大地諸有為相次第遷流終而復始又如來說地水火風本性圓融周徧法界湛然常住世尊若地性徧云何容水水性周徧火則不生復云何明水火二性俱徧虗空不相陵滅世尊地性障礙空性虗通云何二俱周徧法界而我不知是義攸往惟願如來宣流大慈開我迷雲及諸大眾作是語已五體投地欽渴如來無上慈誨。",
    "X14n0289_004:0325a01_0-0": "此下滿慈因聞三科七大皆是如來藏性故執性難相以興二問也滿慈位登無學已斷見思已破我執已證人空然無明未破法執猶存不達全相是性不知萬法生起之源未明全性是相不知七大徧周之故故乘機發問然必待滿慈者葢阿難以多聞居首滿慈以說法居先皆以義虎稱雄故也大威德者有大雄大力以拔人之迷根曰威有大慈大悲以迪人之悟門曰德善為眾生敷演如來第一義諦者正領三科本如來藏七大徧周法界此皆如來自證法門極難措口而如來曲狥人情頭頭顯露令俾眾生善用其心而得悟入故曰善為也然此第一義諦理極玄微絕難搆副即世尊推我說法人中最為第一今聞如來微妙法音喻如聾人逾百步而聆蚊蚋抑且本所不見又焉能聞其聲乎此不見不聞只是形容法音微玅之意列子曰江浦間生麼蟲名曰焦明羣飛而集於蚊睫棲宿去來蚊弗覺也離朱拭眥而望之弗見其形師曠俛首而聽之弗聞其聲惟黃帝與容成子居空同之上心死形廢徐以神視塊然見之若泰山之形徐以氣聽鬨然聞之若雷霆之聲與此相類佛雖宣明此法令我除疑然我畢竟不能入於無疑之地且阿難輩雖得開悟然而根中積生無始虗習宛然盡在其疑固然即我等輩無學已證諸漏已除者尚紆疑悔況未得無漏者乎世尊下先牒三科以呈疑既曰清淨不應忽生穢染器界根身業果既曰本然又不應從曠劫來相續不斷如世界有成住壞空眾生有生老病死業果有往復循環等又如下次牒七大以陳疑若謂七大本性各各圓融周徧法界則土能尅水地水不合相容水能尅火水火何能共徧通塞各異地空安得互周故我不知是義之所歸趣此二問者一是聖教相違難一是世間相違難也惟願下正請除疑言迷雲者以此二疑能障性天故。",
    "X14n0289_004:0325b10_0": "爾時世尊告富樓那及諸會中漏盡無學諸阿羅漢如來今日普為此會宣勝義中真勝義性令汝會中定性聲聞及諸一切未得二空迴向上乘阿羅漢等皆獲一乘寂滅場地真阿練若正修行處汝今諦聽當為汝說富樓那等欽佛法音默然承聽。",
    "X14n0289_004:0325b15_0": "此許說也勝義中真勝義性者法相宗說勝義有四一蘊處界為世間勝義四諦為道理勝義二空真如為證得勝義一真法界為勝義勝義此中所顯即最後勝義也漏盡無學中根也定性聲聞下根也未得二空迴向上乘者上根也二空者即人空法空得人空者知眾生無性得法空者知諸法無性也一乘即佛乘也寂滅場地即大寂滅海阿練若又名阿蘭若此云離諠諍亦云閑靜處由人法俱空故名真離諠諍真閑靜處即指首楞嚴大寂定是行人安心之地也正修行處者除此一乘其餘皆是旁蹊曲徑不名正修方便教說定性聲聞無性闡提不得成佛如焦芽敗種今則咸歸一乘究竟涅槃悉當作佛方盡大乘至極之談故曰正修如法王經云若定根機為小乘人說小乘法為闡提人說闡提法是斷佛性是滅佛身是說法人當歷百千萬劫墮諸地獄何以故眾生之性即是法性從本已來無有增減故知一切法皆是佛法一切性皆是佛性。",
    "X14n0289_004:0325c09_0": "佛言富樓那如汝所言清淨本然云何忽生山河大地汝常不聞如來宣說性覺玅明本覺明玅富樓那言唯然世尊我常聞佛宣說斯義佛言汝稱覺明為復性明稱名為覺為覺不明稱為明覺富樓那言若此不明名為覺者則無所明佛言若無所明則無明覺有所非覺無所非明無明又非覺湛明性性覺必明妄為明覺覺非所明因明立所所既妄立生汝妄能無同異中熾然成異異彼所異因異立同同異發明因此復立無同無異。",
    "X14n0289_004:0325c18_0-0": "此下發明陰界處人循業發現全性成相以答忽生山河大地之問也尊者置箇問端如向荊棘林中掇出膠盆子相似使人動轉不得世尊是一切智人知尊者抱守因緣未忘法執而於性覺真空性空真覺之理未能透脫即將前所說法作深竿影草而詰之曰如汝所問清淨本然云何忽生山河大地等然我向來在法會中所說性覺玅明本覺明玅者汝常不聞之乎言性覺玅明者謂性覺之體本玅而常明不因明以有玅者也本覺明玅者謂本覺之用本明而常玅不因玅以有明者也滿慈被世尊一釣便上答云我常聞佛宣說斯義不知鼻孔已在世尊手裏故復雙開兩關以審之曰汝既聞此性覺玅明本覺明玅如何意會為復性覺玅明之體猶如明鏡本來自明不假明而明之故稱之為性覺玅明耶為復覺體本來不明如鏡之有塵垢必假明而明之故稱為所明之覺耶一是本然義一是因緣義尊者熟處難忘依舊渾身落在因緣知見坑中不覺認明墮所故曰若使不假明而明之名為覺者則無所明之覺矣意謂必假明而明之必有所明方名覺者是則決非無所明而稱覺必是有所明而稱覺也豈知纔立所明便落生滅因緣知見即非清淨本然之覺性矣故世尊告之曰汝謂無所無明則無玅明性覺必是有所有明方有玅明性覺乎故曰若無所明則無明覺豈知性覺玅明不但不可以有所目之亦不可以無所目之以有所則非性覺無所又非妙明故不但不可以無明目之亦不可以有明目之以不明則墮於昏昏默默明則墮於昭昭靈靈故今汝認此覺性以為必明即此一念便將性覺玅明本覺明玅清淨本然之體晦昧而成無明業識矣以其本非所明而強立所明故妄為明覺先德所謂欲明今日事暗却本來人也故示之曰性覺玅明清淨本然之體本不屬所以無在而無不在故亦不屬明以無明而無不明故故曰覺非所明今汝在清淨性覺中認此性覺以為必明即此必明一念遂將無方所之性覺轉成業識若瓶中之空便落方所故曰因明立所既落方所復轉此大智慧光明而成能見見分故曰所既妄立生汝妄能既有見分復將無同無異真諦理境轉成相分遂有種種差別故曰無同異中熾然成異故宗鏡云最初不覺忽起動心成業識之由為覺明之咎因明立所見分俄興隨見立塵相分安布是也異彼所異者上異字指熾然成異之異彼所異指因明立所之所字也言此熾然成異之異與彼因明立所之所異又異也以立所之異是約一念說此熾然異所該甚廣有因異而立同即同亦異有因同異而復立無同無異即無同無異亦異以世界眾生業果皆在此異字中包含故與前所異不同也。",
    "X14n0289_004:0326b19_0": "如是擾亂相待生勞勞久發塵自相渾濁由是引起塵勞煩惱起為世界靜成虗空虗空為同世界為異彼無同異真有為法。",
    "X14n0289_004:0326b22_0": "此牒上因無明而生三細復點出因三細而生六麤也謂上來如是種種擾亂皆由清淨覺心因明一念生起化而為業識轉而為見分裂而為相分故曰相待生勞勞久發塵勞即見分塵即相分此等皆是自相渾濁非由外物渾之濁之也故結之曰由是引起塵勞煩惱由是二字指最初一念無明言塵勞指相見二分言煩惱指六麤言顯此因明一念不但引起三細即六麤煩惱諸相亦因之而起故將煩惱二字點出而下文乃確示之曰汝前問我云何忽生山河大地諸有為相即汝清淨心中無故突起認明一念便是忽生世界遠公所謂一微涉動境成此頺山勢是也即汝一念認明而令清淨覺心忽然晦昧便是靜成虗空前之所言因異立同者異即世界同即虗空以虗空無二故曰同以世界差別故曰異前之所言因此復立無同無異者非本來無同無異之性覺是虗空世界既成之後而復立者即眾生業果六麤諸有為法也眾生業果之所以為無同無異者以離業果無眾生離眾生無業果故無異而眾生為能造能受業果為所造所受故不同也故知一念纔生萬法皆備則知一念無生萬行具足矣昔有僧問瑯瑘覺和尚云清淨本然云何忽生山河大地覺厲聲云清淨本然云何忽生山河大地又有僧問玄挺禪師云如何是真性中緣起師云大德正興一念時是真性中緣起此又見如來祖師各出手眼接人處。",
    "X14n0289_004:0326c24_0": "覺明空昧相待成搖故有風輪執持世界因空生搖堅明立礙彼金寶者明覺立堅故有金輪保持國土堅覺寶成搖明風出風金相摩故有火光為變化性寶明生潤火光上蒸故有水輪含十方界。",
    "X14n0289_004:0327a04_0-0": "前約最初一念無明答忽生此約發潤二種無明答相續也先明世界相續之因華嚴經云三千大千世界以無量因緣所成且如大地依水輪水輪依風輪風輪依空輪空輪無所依然眾生業感世界安住此亦如是故先辯風輪良以真法性土本來不動由突起知見遂轉此玅明智體而為覺明復轉性覺真空而成晦昧之頑空所謂知見立知即無明本也由此知見與無明風忽然鼓動充塞虗空故空輪之上而有風輪執持世界此由最初一念知見妄立迷本覺而為無明成風輪種是故器界凝結皆由無明風力執持得不散失因空下次明金輪既有無明風依空鼓動而此覺明知見執攬愈固復從晦昧空中結成金輪保持國土故四寶結成須彌純金結成七山彼金山寶山皆是明覺立堅所致此即因見分而攬結相分為地大種堅覺下三明火大堅覺寶成者牒前明覺立堅所成金寶也搖明風出者牒前無明搖動知見所出之風也覺之與明即知見也謂此知見內為無明所鼓外為相金所眩風金相摩轉生火大故有火光為變化性言變化者謂變生為熟化有成無此由無明與相金鼓發知見益熾引發瞋火為火大種寶明下四明水大由火光上蒸而於所見之金寶及能見之覺明愈生光潤津津愛著不肯放捨遂生愛水故有水輪含十方界言含者見世界總是愛水包裹也此由相見引發潤生無明為水大種也故知四大種子本乎癡愛相續不斷古鈔云由妄見動故外感風輪由執心堅故外感金輪由研求燥故外感火輪由愛心深故外感水輪也。",
    "X14n0289_004:0327b08_0": "火騰水降交發立堅濕為巨海乾為洲潬以是義故彼大海中火光常起彼洲潬中江河常注水勢劣火結為高山是故山石擊則成燄融則成水土勢劣水抽為草木是故林藪遇燒成土因絞成水交妄發生遞相為種以是因緣世界相續。",
    "X14n0289_004:0327b13_0-0": "前依無明一發展轉結成四大種子此因水火二大種子展轉結成器界也火騰者火性災上故曰騰水降者水性潤下故曰降也交發立堅者水火濟而互生器界也濕為巨海者即甘水海與鹽水海是水族眾生器界水降之所成立乾為洲潬者即四部洲是陸居眾生器界火騰之所成立以是義故大海本流濕之地不應有火而有火者以受火之氣分故火光常起洲潬本就燥之處不應有水而有水者以受水之氣分故江河常注也水勢下復由水火土三種而生陸地之高山林藪之草木也水勢劣火者以水能尅火若水性不降而就火則勢必滅火豈能生物今則降水之性而就火故水火相合結成高山是故山石擊則成焰者是受火之氣分融則成水者是受水之氣分也土勢劣水者以土能尅水若土性不降而就水則勢必滅水豈能生物今則降土之性而就水故水土相合抽為草木是故林藪遇燒成土者是受土之氣分因絞成水者是受水之氣分也交妄下結成相續由無明為風輪種執心為金輪種瞋心為火大種愛心為水輪種由此四輪交妄發生遞相為種復生四大而器界立於是世界成住壞空始終相續若無明破而風輪息堅執消而金輪壞瞋心歇而火輪空愛心盡而水輪涸是則器界應念化成無上知覺矣(關尹云五行之運因精有魂因魂有神因神有意因意有魄因魄有精五行回環不已精者水魄者金神者火魂者木意者土升者為火降者為水欲升而不能升者為木欲降而不能降者為金金木者水火之交也然則五行者皆吾思慮計之而有是以萬物之來我皆對之以性而不對之以心性者心未萌也無神則無意葢無火則無土無意則無魄葢無土則無金一者不存五者皆廢世之論五行者皆不推其本若關尹者善推本者也然四大五行實非有異故併錄之)",
    "X14n0289_004:0327b13_0-1": "又俱舍云謂諸有情業增上力先依最下依止虗空有風輪生如是風輪其體堅密不可沮壞設有洛那力人以金剛杵奮威懸擊金剛有碎風輪無損又諸有情業增上力起大雲雨樹風輪上渧如車軸積水成輪眾生業力水不流散如食未消不墮識藏又如倉貯米水輪亦爾由風所持令不流散諸有情業感別風起摶擊此水上結金輪如熟乳停上凝成膜故水輪減唯厚八洛叉餘轉成金於金輪上有九大山玅高處中餘八周匝繞玅高山於八山中前七名內於第七山外有四洲洲外復有鐵輪圍山周匝如輪圍一世界持雙等七唯金所成玅高山王四寶為體如次四面北東南西金銀琉璃頗胝迦寶隨寶威德色顯於空故贍部洲空如琉璃如是寶等亦諸有情增上業力之所成就復有大雲起雨金輪上滴如車軸積水奔濤其水即為眾寶種藏由其威德猛風鑽擊變生眾寶如是變水眾寶時因滅果生體不俱有如是變生金寶等已復由業力引起別風簡別眾寶攝令積聚成山成洲水分甘鹹令別成立內海外海如是九山住金輪上中間八海前七名內七中皆具八功德水第八名外鹹水盈滿於外海中大洲有四各對玅高南贍部洲北廣南狹三邊量等其相如車唯此洲中有金剛座上窮地際下據金輪一切菩薩將登正覺皆坐此座上起金剛喻定以無餘依有堅固力能持此故東勝身洲形如半月西牛貨洲形如滿月北俱盧洲形如方座隨其洲相人面亦然等此即一須彌一日月所統世界也問何故此經先金輪而次水輪俱舍先水輪而後金輪答彼約世界安立自下生上以成其次此約世界生起由內感外以立其次故不同也。",
    "X14n0289_004:0328a23_0": "復次富樓那明妄非他覺明為咎所妄既立明理不踰以是因緣聽不出聲見不超色色香味觸六妄成就由是分開見覺聞知同業相纏合離成化見明色發明見想成異見成憎同想成愛流愛為種納想為胎交遘發生吸引同業故有因緣生羯羅藍遏蒲曇等胎卵濕化隨其所應卵唯想生胎因情有濕以合感化以離應情想合離更相變易所有受業逐其飛沈以是因緣眾生相續。",
    "X14n0289_004:0328b07_0-0": "此答眾生相續之因也葢法性身本來周遍實無根身即此根身推其本原亦是明妄所成此明妄者實非他物亦由妙明覺心最初突起一念轉為覺明而成所妄所妄既立於是湛圓玅明覺性分成六處故在眼名見在耳能聞遂生局礙不復周徧圓通以是因緣於器世界不能超越故聽不出聲而見不超色此無他都由色香味觸六妄成就染六根而成塵亦由見聞覺知六妄成就攬六塵而成根於是六根六塵各有定處情想合離各有定業胎卵濕化亦各有定報其同業者則一處相纏業不同者則或離或合也溫陵曰同業即胎卵類因父母己三者業同故相纏著而生合離即濕化類不因父母但由己業或合濕而成形或離異而托化此言本有身顛倒執著故感中有投胎時亦復如是也見明下明中有投胎之因謂胎卵二中有身欲投胎時其無緣處大地如墨唯於父母有緣處見有一點明色發現此中有身既見明色即趨其處其想遂得成就故曰見明色發明見想成也孤山云異見者謂父是所憎境同想者謂母是所愛境女子反此流愛下正明投胎之因由潤生無明也言此中有既見可愛之境即注愛於父母赤白二渧以為種此赤白二渧即納此想心而成胎此想雖因父母交遘發生實由己業相同故吸攪而不捨若磁石之吸鐵以是父母己三為因緣故遂入胎中成五陰身故有羯羅藍等相故俱舍云胎中凡有五位一七名羯羅藍此云凝滑二七名遏蒲雲此云皰狀如瘡皰三七名閉尸此云輭肉四七名健南此云堅肉五七名鉢羅奢佉此云形位今舉其二故曰等也(瑜伽云言中有者謂此五趣有情身在生有死有間名中有亦以異熟五蘊為體是業招故其胎卵中有身便如當生本有身形狀如人中有似人餘趣中有亦爾身如五六歲孩子大其形量雖小然諸根猛利如本有身能作諸業於父母邊起顛倒想或唯見男或唯見女如是漸近彼之處所漸漸不見父母餘處唯見男女根門若男中有緣母起愛生於欲心若女中有緣父起愛生於欲心由起二種愛心己與愛境合所洩不淨流入胎藏認為己身便生歡喜此心生己中有身沒受生有身故曰同業相纏若濕化二生中有由先業力不簡近遠染著稱情當染香處便即受生毗毗產問世尊云眾生死已受中陰身新身未受云何而住佛言如種生芽為先種滅而後芽生為先芽生而後種滅為種滅經久而芽乃生毗毗產言世尊非種滅已而後芽生非芽生已而後種滅生滅同時無先無後佛言如是楞伽王非舊身後識滅已而新身初識生亦非新身初識生已而舊身後識滅生滅同時無先無後如吉彌蟲行蟲有所至身總隨之一著不移步易乃去如是先識託身識總隨之一託不離死方遷捨毗毗產言若如是者有中陰不佛言如卵生眾生棄身託卵以業風力在于卵中凝沍無知至卵熟時識方有覺所以者何業法如是以業力故卵生眾生熟時未至無所覺知又轉輪王及輪王子以福業故受身之時不為胎穢所汙不與胎穢和雜無胎穢染故多化生應當以是而表中陰)",
    "X14n0289_004:0328b07_0-1": "胎卵濕化隨其所應者謂四生各以定業相感故隨其感而應之以四生之定報也亂思不定曰想鍾愛不捨曰情親附不變曰合捨此趨彼曰離由此四心感召而四生亦以類應也情想下明不定業所感之果也言因心或情變為想或想變為情或合化為離或離化為合故其受報或飛變為沉若雀之化蛤或沉變為飛若魚之化龍等亦不定也(且如人中亦具四生如毗舍佉彌羅母三十二子是卵生揜如羅婆利頂生轉輪聖王名濕生阿婆羅比丘尼地中化生又如誌公生於鷹巢五祖生於館舍伊尹生於空桑后稷生於巨跡乃至復有至暴者化為猛虎至婬者化為女人故知善惡由心心之所變不得不變)",
    "X14n0289_004:0328b07_0-2": "以是下結成相續。",
    "X14n0289_004:0329a11_0": "富樓那想愛同結愛不能離則諸世間父母子孫相生不斷是等則以欲貪為本貪愛同滋貪不能止則諸世間卵化濕胎隨力強弱遞相吞食是等則以殺貪為本以人食羊羊死為人人死為羊如是乃至十生之類死死生生互來相噉惡業俱生窮未來際是等則以盜貪為本汝負我命我還汝債以是因緣經百千劫常在生死汝愛我心我憐汝色以是因緣經百千劫常在纏縛唯殺盜婬三為根本以是因緣業果相續。",
    "X14n0289_004:0329a20_0": "此明業果相續之因也想愛同結等者謂彼此情愛如膠似漆固結而不能解故受生時則流愛為種納想為胎而父母子孫生生不斷此等皆以婬欲而正性命故曰欲貪為本貪愛同滋等者謂彼貪我豢養我愛其肉血此皆以貪愛相滋故隨力強弱遞相噉食如言半斤還八兩是也以人下以一例諸非謂止人羊相食而已惡業俱生者謂有此惡業故世世俱生一處相值以償其債也盜貪者謂不與而取及陰取者皆盜以人食羊羊未嘗與人食而人以強力取食是不與而取羊死為人互來相噉而彼亦不知取噉之故是為陰取雖殺盜婬三種不同總是一貪為本故知三界流轉唯一貪愛若斷貪愛便出三界矣汝負二句影略當云汝負我命汝還我命我負汝命我還汝命此屬殺貪我負汝債我還汝債汝負我債汝還我債此屬盜貪此言命債不了故生死相結亦不了也汝愛二句亦影略當云汝愛我心我愛汝心我憐汝色汝憐我色由愛憐不斷故生死相纏亦不斷也唯殺下結成相續合論云譬如世人葬其祖先於吉地則世受其福不然有禍人有親姻地無情識而福禍之應捷於影響一切眾生殺盜婬力妄計而生業果如之。",
    "X14n0289_004:0329b18_0": "富樓那如是三種顛倒相續皆是覺明明了知性因了發相從妄見生山河大地諸有為相次第遷流因此虗妄終而復始。",
    "X14n0289_004:0329b21_0": "此總結三種相續不斷之現行皆由最初一念忽生之種子言此三種相續不斷雖各不同推其所自皆由性覺玅明心體最初不覺突起一念故轉成業識名為覺明因有覺明次又轉為明了知性因有了知次又轉為相分故曰因了發相由此妄見山河大地有為諸相忽然生起即次第遷流亦因此終而復始亦因此所謂種種幻化皆生如來圓覺玅心也。",
    "X14n0289_004:0329c05_0": "富樓那言若此玅覺本玅覺明與如來心不增不減無狀忽生山河大地諸有為相如來今得妙空明覺山河大地有為習漏何當復生。",
    "X14n0289_004:0329c08_0": "此執因性以難果性反詰如來何時復循業發現也意謂眾生性覺妙明本覺明玅之體與諸如來平等無二眾生既從清淨本然體中無狀忽生如來既得清淨覺體何時又當無狀而忽生邪有為即眾生習漏即業果也。",
    "X14n0289_004:0329c13_0": "佛告富樓那譬如迷人於一聚落惑南為北此迷為復因迷而有因悟而出富樓那言如是迷人亦不因迷又不因悟何以故迷本無根云何因迷悟非生迷云何因悟佛言彼之迷人正在迷時倐有悟人指示令悟富樓那於意云何此人縱迷於此聚落更生迷不不也世尊富樓那十方如來亦復如是此迷無本性畢竟空昔本無迷似有迷覺覺迷迷滅覺不生迷。",
    "X14n0289_004:0329c20_0": "此顯覺性不動本無迷悟也先舉喻以審迷因之自出如是下答出迷因無所從來謂此無明本從清淨覺心突然而起了無根本故不因迷若使迷人忽然醒悟悟則無迷亦不因悟既此迷人不因迷悟則知覺性本來不動而迷悟皆屬生滅門中所收也佛言下復舉喻反詰言汝雖知迷悟無根然彼正當惑南為北時忽有悟人指示令悟此人縱使先迷今已醒悟於此聚落更生迷不不也者謂既悟決不復迷也十方下法合言此無明了無根本徹底元空正如迷方之迷更無所因以此清淨覺性在昔本無有迷由彼忽生一念似乎迷其清淨覺體非是真迷若使真迷則迷已有根安得復覺以迷本無根故曰似有正如惑南為北方實不轉今既覺得是迷迷即便滅滅則豈復更生哉昔忠國師問紫璘供奉云佛是何義答云覺義師曰佛曾迷否曰不曾迷師曰用覺作麼故知尚無有覺云何有迷所以云昔時迷悟似迷今日悟迷非悟。",
    "X14n0289_004:0330a14_0": "亦如瞖人見空中華瞖病若除華於空滅忽有愚人於彼空華所滅空地待華更生汝觀是人為愚為慧富樓那言空元無華妄見生滅見華滅空已是顛倒敕令更出斯實狂癡云何更名如是狂人為愚為慧佛言如汝所解云何問言諸佛如來玅覺明空何當更出山河大地。",
    "X14n0289_004:0330a20_0": "復舉喻以明瞖除華滅如來自喻待華更生喻富樓那為愚為慧審之之辭空元下喻清淨覺心本無迷悟也即言其悟已是落第二頭況既悟之後而更索其迷斯實世間極愚之人云何乃問其愚與慧耶佛言下輕輕撥轉言汝解得晴空待華更生之人是愚非慧而汝乃於清淨覺心更索山河大地與此愚人何異哉如上二喻皆顯迷時尚不曾實迷況既悟之後乃復有迷耶。",
    "X14n0289_004:0330b04_0": "又如金鑛雜於精金其金一純更不成雜如木成灰不重為木諸佛如來菩提涅槃亦復如是。",
    "X14n0289_004:0330b06_0": "金鑛雜精金者鑛喻無明金喻覺性言無明與覺性和合也其金一純者喻無明盡而純覺也不重為鑛者喻諸佛本覺已現不更生無明心識相也故圓覺云一成真金體不復重為鑛木喻煩惱灰喻涅槃灰不為木者喻已證涅槃不更生煩惱也此二喻言已覺者更不生迷況既覺之後又加四十二番煅煉之功而成正等正覺得大涅槃者更生迷耶。",
    "X14n0289_004:0330b14_0": "富樓那又汝問言地水火風本性圓融周徧法界疑水火性不相陵滅又徵虗空及諸大地俱徧法界不合相容富樓那譬如虗空體非羣相而不拒彼諸相發揮所以者何富樓那彼太虗空日照則明雲屯則暗風搖則動霽澄則清氣凝則濁土積成霾水澄成映於意云何如是殊方諸有為相為因彼生為復空有若彼所生富樓那且日照時既是日明十方世界同為日色云何空中更見圓日若是空明空應自照云何中霄雲霧之時不生光耀當知是明非日非空不異空日。",
    "X14n0289_004:0330b24_0": "此明七大皆依如來藏心循業發現全相是性以答七大徧周不合相容之問也又汝下先牒定前疑譬如下舉同喻以明虗空體非羣相者喻如來藏心清淨本然周徧法界也不拒羣相發揮者喻七大循業發現也彼太下釋成日照則明喻火大大明當空羣暗皆消故雲屯則暗喻識大迷雲一起真空晦昧故風搖則動喻風大飄風忽起大虗震驚故霽澄則清喻空大萬里無雲碧空如洗故氣凝則濁喻見大空見不分兩相渾濁故土積成霾喻地大陰霾晝飛晴空蔽塞故水澄成映喻水大水天一色晴空映發故如是下雙徵七大所自出若彼下辨破意謂太虗既是因日而有明則十方虗空但有明處皆是一日云何空中更見圓日如盤盂者在乎若使空中更有圓日可見則自日之外皆是空明安得言因日而明耶若謂是明不因於日而因於空空既常存明應常在云何暗來則無光耀當知是明不即空日亦不離空日既不即不離則知清淨本然循業發現矣。",
    "X14n0289_004:0330c18_0": "觀相元妄無可指陳猶邀空華結為空果云何詰其相陵滅義觀性元真唯玅覺明玅覺明心先非水火云何復問不相容者。",
    "X14n0289_004:0330c21_0": "此錯簡當在後文無可憑據下是牒上虗妄以答前問辭也但汝細觀七大之相若果是實或可指陳正如水中月影本來虗妄尚不能能定其為一為二為西為東乃欲詰其相陵滅義是猶邀空華而結空果惡可得哉汝若細觀七大之性元是真常玅覺明體更非別物如是則玅覺性本無水火水火尚無云何乃問其不相容也。",
    "X14n0289_004:0331a04_0": "真玅覺明亦復如是汝以空明則有空現地水火風各各發明則各各現若俱發明則有俱現云何俱現富樓那如一水中現於日影兩人同觀水中之日東西各行則各有日隨二人去一東一西先無準的不應難言此日是一云何各行各日既雙云何現一宛轉虗妄無可憑據。",
    "X14n0289_004:0331a10_0": "此以法合喻也應立量云真覺玅明是有法非離非即是宗因云體非七大而不拒彼七大發揮故同喻如虗空汝以空明則有空現者即是循發空之業而空相現如鑿井而空出是也各各發明各各現者若各循業而境各現如一處求火一處火出一處求水一處水出是也俱明俱現者同循業而境同現如徧法界執滿世間起是也云何下引喻以明俱現之妄各現猶不足顯共業之虗而俱現足以顯共業之妄故承俱現復以喻顯也水中日影是一而東西有日各隨人去者以日影隨東是循東人之業而東日影隨西是循西人之業而西而水中日影初未嘗隨人東西也如是則知循業發現虗妄無憑大都如此而欲難其是一是二是東是西耶此正與非日非空不異空日同一虗妄而已。",
    "X14n0289_004:0331b01_0": "富樓那汝以色空相傾相奪於如來藏而如來藏隨為色空周徧法界是故於中風動空澄日明雲暗眾生迷悶背覺合塵故發塵勞有世間相我以玅明不滅不生合如來藏而如來藏唯玅覺明圓照法界是故於中一為無量無量為一小中現大大中現小不動道場徧十方界身含十方無盡虗空於一毛端現寶王剎坐微塵裏轉大法輪滅塵合覺故發真如玅覺明性。",
    "X14n0289_004:0331b09_0": "此釋明上文二義言七大之相如此則不可詰其相陵滅義七大之性又如此又不可問其不相容者然則七大何故而有由汝業識不空相見未破循色空之業互相傾奪於如來藏而如來藏即循汝業而現空現色故見色空周徧法界是故於中開眼時但見物象森羅塵勞滿前全成穢土不知相本虗而無可憑據良由眾生內為無明所蔽業力所使心自迷悶不自了知實由背清淨覺和合妄塵故發塵勞見世間相不見真如玅覺明性所以全性成相我則不然無明已盡業識已空唯是清淨玅明智體更無所有即以玅明智體合如來藏而如來藏唯見玅覺明心徧十方界更無一物為障為礙是故於中事事無礙所以全相成性故知心有也娑婆境現心無也華藏含空一為二句一多相容也小中二句廣狹無礙也不動二句即一為無量所謂不起而昇不動而徧也身含二句即無量為一也毛端現剎者正中現依微塵轉輪者依中現正即小中現大也此皆如理智中現如量境若但證如理之旨普賢大用不得現前若唯行如量之宗文殊正智不能究竟具此二智方得圓滿滅塵下翻上可知是知業識不空頭頭是障業識一空事事無礙矣宗鏡云心性遍一切處所以四生九類皆於自性身中現以自真心為一切萬有之性故隨為色空周徧法界循業發現果報不同處異生則業海浮沉生死相續在諸聖則法身圓滿玅用無窮隱顯雖殊一性不動。",
    "X14n0289_004:0331c11_0": "而如來藏本玅圓心非心非空非地非水非風非火非眼非耳鼻舌身意非色非聲香味觸法非眼識界如是乃至非意識界非明無明明無明盡如是乃至非老非死非老死盡非苦非集非滅非道非智非得非檀那非尸羅非毗梨耶非羼提非禪那非般剌若非波羅蜜多如是乃至非怛闥阿竭非阿羅訶三耶三菩非大涅槃非常非樂非我非淨以是俱非世出世故即如來藏元明心玅即心即空即地即水即風即火即眼即耳鼻舌身意即色即聲香味觸法即眼識界如是乃至即意識界即明無明明無明盡如是乃至即老即死即老死盡即苦即集即滅即道即智即得即檀那即尸羅即毗梨耶即羼提即禪那即般剌若即波羅蜜多如是乃至即怛闥阿竭即阿羅訶三耶三菩即大涅槃即常即樂即我即淨以是俱即世出世故即如來藏玅明心元離即離非是即非即。",
    "X14n0289_004:0332a02_0-0": "此總將寂滅一心非即非離以顯其玅為三觀之體楞伽所謂寂滅者名為一心一心名如來藏是也先明離萬法以顯空如來藏以如來藏體非羣相清淨本然故非七大非六根非六塵非六識此非世間法也非緣覺法非聲聞法非菩薩法此非出世間法也非如來三號非涅槃四德此非出世間上上法也次明即萬法以顯不空如來藏以如來藏周徧法界循業發現故三明雙遮雙照以顯空不空如來藏以如來藏不落心思言議故由前世尊一往發明三科七大皆如來藏滿慈正為不了此義故興二難一難清淨本然云何忽生山河大地等者是迷於循業故世尊首以因明立所答之以見皆由循業發現此顯萬法性雖真而相本妄是全性而成相也二問七大徧周不合相容者是不知七大本乎性覺世尊首以虗空體非羣相而不拒彼羣相發揮以喻之以見七大皆是玅覺明性此顯萬法相雖妄而性本真以見全相是性也由汝背覺合塵故見相而不見性由我背塵合覺故見性而不見相至此則七大循業已明如來藏性亦顯然猶可思議未顯其玅殊不知如來藏不可以即論又不可以非即論不可以離論又不可以非離論若以即地水火風等論如來藏聖應同凡見妄凡應同聖見真應無二諦若以不即地水火風等論如來藏則應凡聖永別凡夫不能作聖若以非地水火風等論如來藏則凡夫見色應同聖智見空應無二諦若以不非地水火風等論如來藏則凡夫見色長隔真空永不成聖至此方顯如來藏心之玅不容有聲而為玅奢摩他三摩禪那之體此當法界觀中泯絕無寄觀也故曰謂此所觀真空不可言即色不即色亦不可言即空不即空一切法皆不可不可亦不可此語不可受泯絕無寄非言所及非解所到是為行境何以故以生心動念即乖法體失正念故。",
    "X14n0289_004:0332b11_0": "如何世間三有眾生及出世間聲聞緣覺以所知心測度如來無上菩提用世語言入佛知見譬如琴瑟箜篌琵琶雖有玅音若無玅指終不能發汝與眾生亦復如是寶覺真心各各圓滿如我按指海印發光汝暫舉心塵勞先起由不勤求無上覺道愛念小乘得少為足。",
    "X14n0289_004:0332b17_0": "此責滿慈不勤修而徒事口舌以策其進也言如來藏玅明心元如此而世間眾生乃以所知有限量心測度如來無限量境復用世間五行生尅之語而欲入佛知見乎故圓覺云但諸聲聞所圓境界身心語言皆悉斷滅終不能至彼之親證所現涅槃何況能以有思惟心測度如來圓覺境界如取螢火燒須彌山終不能著以輪迴心生輪迴見入於如來大寂滅海終不能至至此則知法華所言佛之知見但有其名未竟其實此經方明言佛知見是三觀圓融寂滅一心如來藏性也譬如下復舉喻以勵之汝與下法合寶覺真心各各圓滿者合琴瑟等皆有玅音也而有發不發者在有玅指與無玅指耳言我得之於心則應之於手故一按指而光明煥發照天照地皆成玅用者喻如有玅指而發玅音也汝則一舉心而塵勞滿眼物象森羅不發玅用者喻如無玅指而不發玅音也所以不發玅用者無他由汝但得涅槃一日之價以為大得不肯進修無上覺道故不發耳若肯進修即與如來把手共行决不相賺故宗鏡云樂蘊奇音按指則宮商應節人懷覺性智巧則功用冥符得失在人精麤由己所以善逝按指發海印之光含識舉心現塵勞之相龍勝云眾生心性猶如利刀唯用割泥泥無所成刀就日損理體常玅眾生自麤若善用之即合本玅。",
    "X14n0289_004:0332c17_0": "富樓那言我與如來寶覺圓明真玅淨心無二圓滿而我昔遭無始妄想久在輪迴今得聖乘猶未究竟世尊諸妄一切圓滅獨玅真常敢問如來一切眾生何因有妄自蔽玅明受此淪溺。",
    "X14n0289_004:0332c21_0": "此窮索妄因而擬斷也我與下領寶覺真心各各圓滿而我昔遭無始妄想領前忽生也久在輪迴者領前相續也今得下領愛念小乘得少為足也世尊下領金鑛木灰喻也敢問下正請妄因言我見思雖盡無明尚存不知妄因生起固宜世尊五住盡而二死亡獨玅真常稱為大覺其知妄因必矣敢問一切眾生何因而有妄起前問清淨本然云何忽生世尊答以因無明起今問此無明者復因何起所謂直窮到底也。",
    "X14n0289_004:0333a06_0": "佛告富樓那汝雖除疑餘惑未盡吾以世間現前諸事今復問汝汝豈不聞室羅城中演若達多忽於晨朝以鏡照面愛鏡中頭眉目可見瞋責己頭不見面目以為魑魅無狀狂走於意云何此人何因無故狂走富樓那言是人心狂更無他故佛言玅覺明圓本圓明玅既稱為妄云何有因若有所因云何名妄自諸妄想展轉相因從迷積迷以歷塵劫雖佛發明猶不能返如是迷因因迷自有識迷無因妄無所依尚無有生欲何為滅得菩提者如寤時人說夢中事心縱精明欲何因緣取夢中物況復無因本無所有如彼城中演若達多豈有因緣自怖頭走忽然狂歇頭非外得縱未歇狂亦何遺失富樓那妄性如是因何為在。",
    "X14n0289_004:0333a19_0-0": "此下借事發明妄本無因突然而起也言汝已知相續起於因明七大由乎循業如來玅覺不生山河大地猶不知妄本無因而妄索其因故曰汝雖除疑餘惑未盡即今目前偶有一事我即借此與汝發明汝即因此而知其妄矣汝豈不聞演若達多迷頭認影以為魑魅狂走之事乎且此達多頭本不失已非魑魅而忽然自以為魑魅無狀狂走者此狂是從何因而起也演若達多此云祠授從神乞得故滿慈被世尊一問當下分明答云此人但是心發顛狂而走更無他故佛言下就事發明由滿慈於事上却解於理上却迷故就其明處以導之言此玅覺明心本來自圓本來自明本來自玅未嘗有妄既已稱之為妄云何有因若有所因即名為真云何名妄若究其現在即是自己妄想展轉相因而生初無定處若推其本始即是一迷而積迷歷乎塵劫亦無有因如初一人忽然妄說遞遞相承從妄說妄及推其因遞遞皆虗即初一人及與後人二俱是妄何者為因我已前來盡力與汝發明汝猶不能自已反求而反從人索妄本耶如是迷因即是因迷自己本圓玅心而有別無他故若汝識此迷本無因則汝妄想元無所依是則汝今雖遭妄想久在輪迴尚無有生云何乃說世尊諸妄一切圓滅獨玅真常索妄本於我耶我今雖得菩提但能說此妄本無因豈能拈出無因之妄以示人乎正如寤人說夢中事心縱精明別無方法拈取夢中之物以示人也且夢中物影影響響亦似有因似可拈取尚不能取況復本無之妄想索其生起之因乃欲取而斷之惡可得哉此妄無因正如達多狂性相似不是因人教他狂亦不是頭上本來有狂元是自己迷頭認影而自狂忽然此狂一歇則知此頭本不曾失縱使未曾歇狂眉毛元在眼上鼻孔依舊下垂曾不動著一絲毫是故頭無得失狂有起歇耳故示之曰汝之妄想即如達多之狂無異其因豈有定在乃欲索之耶。",
    "X14n0289_004:0333c06_0": "汝但不隨分別世間業果眾生三種相續三緣斷故三因不生則汝心中演若達多狂性自歇歇即菩提勝淨明心本周法界不從人得何藉劬勞肯綮修證譬如有人於自衣中繫如意珠不自覺知窮露他方乞食馳走雖實貧窮珠不曾失忽有智者指示其珠所願從心致大饒富方悟神珠非從外得。",
    "X14n0289_004:0333c12_0-0": "此告以歇狂之法也不隨二字是歇狂之初步分別即是分別法執言汝但不去隨順世間業果眾生三種分別現行相續心則三種現行相續心一時頓歇三種種子便不生起此即所謂緣斷而因不生也下又借達多之狂以例滿慈之狂達多之狂迷頭認影滿慈之狂認明墮所狂事不同狂心無異故云若果三緣斷而三因不生即是汝之心中演若達多狂性自歇時也若此狂一歇當下即證菩提不勞餘力圓覺所謂知幻即離離幻即覺祖師所謂但離妄緣即如如佛至此則知勝淨玅心清淨本然周徧法界元是己物不從人得何藉粘皮帶骨動經劫數勤苦修證哉永嘉所謂覺即了不施功也此不獨與滿慈發明云何有妄即阿難見相發心惠我三昧等疑皆釋然矣故寒山云男兒大丈夫作事莫鹵莽徑挺鐵石心直取菩提路邪道不用行行之轉辛苦不要求佛果識取心王主懶瓚云莫謾求真佛真佛不可見玅性及靈臺何曾受熏鍊心是無事心面是娘生面劫石可動移箇中無轉變皆此義也前云自諸妄想展轉相因又云因迷自有又云自怖頭走皆自迷也與頭無預又云狂心自歇歇即菩提是自悟也亦與頭無預則知迷悟由人而寶覺真心各各圓滿本無迷悟故宗鏡云此宗所悟還有師否答此是自覺聖智無師智自然智之所證處不從他悟自證之時法從心現不從外來故楞伽云不由於他通達佛法但可自知方見真實所以千聖拱手作計校不得故曰不煩問師匠心王應自知譬如下以喻結喻衣喻無明珠喻勝淨明心言雖有此勝淨玅心而為無明包褁故雖有而不覺乞食馳走者懷寶迷邦持珠作丐也所願從心致大饒富者現塵現界無不如心也。",
    "X14n0289_004:0334a19_0": "即時阿難在大眾中頂禮佛足起立白佛世尊現說殺盜婬業三緣斷故三因不生心中達多狂性自歇歇即菩提不從人得斯則因緣皎然明白云何如來頓棄因緣我從因緣心得開悟世尊此義何獨我等年少有學聲聞今此會中大目犍連及舍利弗須菩提等從老梵志聞佛因緣發心開悟得成無漏今說菩提不從因緣則王舍城拘舍梨等所說自然成第一義惟垂大悲開發迷悶。",
    "X14n0289_004:0334b03_0": "此第三番躡佛語而執因緣也正如矢在弦上不得不發意謂如來既已擯棄因緣語中復說緣斷而因不生狂歇而菩提現斯則因緣皎然似不可廢云何乃欲頓棄之耶且此因緣是我等入道之門發悟之地於我等輩實有利益又不獨我等年少有學蒙其利益即先輩耆宿亦皆由此而得悟入如天帝釋不修天業宮殿何以隨身轉輪王不作王因七寶何由集聚唯憑自善外感勝緣今言不藉因緣則外道所說八萬劫後自然成道猶如縷丸極處停止者翻成第一義諦耶縱使如來不墮因緣寧不墮自然哉此又我等迷悶而不解者更請發其覆而決其疑也因緣二字是小乘悟入之門故不肯捨不知守此悟而不肯捨是真迷也。",
    "X14n0289_004:0334b16_0": "佛告阿難即如城中演若達多狂性因緣若得滅除則不狂性自然而出因緣自然理窮於是阿難演若達多頭本自然本自其然無然非自何因緣故怖頭狂走若自然頭因緣故狂何不自然因緣故失本頭不失狂怖妄出曾無變易何藉因緣本狂自然本有狂怖未狂之際狂何所潛不狂自然頭本無妄何為狂走。",
    "X14n0289_004:0334b23_0": "此下雙遣因緣自然也言汝以為狂性因緣滅除則不狂性自然而出故汝所執因緣自然以為世出世間玅理盡在於是更無餘蘊所以執悋不肯吐却殊不知未盡然也若謂頭本自然則應本自常然無一時一處而不自然不得驚為魑魅而發狂今者忽驚無頭而狂走者諒必有因決非自然不知何因而怖頭狂走此則頭非自然明矣若謂頭本自然因照鏡故忽驚無頭而狂走者何不因照鏡故而并失其頭耶且正當狂怖妄出時而頭不曾失此頭決不藉因緣明矣若謂狂本出於自然即當本來常常有此狂怖不知未狂之先此狂藏於何地而不起耶若謂狂不出於自然而出於因緣者則頭本無狂妄胡為而忽然狂走也故知不但頭不屬因緣自然即狂亦不屬因緣自然既知頭之與狂不屬因緣自然則知玅覺之與無明皆不屬因緣自然矣。",
    "X14n0289_004:0334c15_0": "若悟本頭識知狂走因緣自然俱為戲論是故我言三緣斷故即菩提心菩提心生生滅心滅此但生滅滅生俱盡無功用道若有自然如是則明自然心生生滅心滅此亦生滅無生滅者名為自然猶如世間諸相雜和成一體者名和合性非和合者稱本然性本然非然和合非合合然俱離離合俱非此句方名無戲論法菩提涅槃尚在遙遠非汝歷劫辛勤修證雖復憶持十方如來十二部經清淨玅理如恒河沙只益戲論。",
    "X14n0289_004:0334c24_0-0": "此下發明正義一悟字一知字是歇狂悟本處由其悟得本頭然後知得狂走以悟本頭方見本來面目是真以知狂走纔覺向外馳求是妄又悟本頭則知清淨本然識狂迷則知循業發現言汝一向自迷家寶向外馳求執緣執自固所不免若使親見本頭狂心頓歇則知因緣自然皆是夢中寱語俱成戲論非實義也是故我說三緣斷故即菩提心者是歇狂悟本之法豈因緣自然之可擬哉雖然若執狂心歇而菩提心生者亦是因緣亦是狂心亦是戲論猶然生滅非是寂滅不獨爾也即使滅生俱盡至於無功用處若有自然作自然想此名自然心生生滅心滅即此自然亦是戲論亦是狂心亦是生滅非是寂滅何以故因以生滅為因緣而以無生滅者為自然以去一重因緣而又墮一重自然是去作病而墮任病故即自然亦屬生滅也喻如世間因雜和而成一體者名和合性對此和合則以非和合者稱本然性即此本然是對待法非真本然故亦如戲論所謂毫釐繫念三塗業因瞥爾情生萬劫繫縛直至本然非本然和合非和合和合本然二俱遠離離與不離二俱雙非至此方是正句方是活句方是真因緣方是無戲論法故中論云不生亦不滅不常亦不斷不一亦不異不來亦不去能說是因緣善滅諸戲論而巖頭亦云大統綱宗要須識句甚麼是句百不思時喚作正句故曰此句方名無戲論法也復恐尊者以解為證故說到極則處當頭一點云雖然得到這箇田地菩提涅槃尚遙遠在正謂得句之時纔是發心正好修行趨向菩提豈似汝等但以多聞記持歷劫辛勤者可能修證由不肯捨戲論法故也抑且不但記持我所說法如瓶受水無遺一滴為戲論即汝向來憶念過去千萬億諸佛法藏通達無礙亦是戲論即使更能憶持十方如來十二部經其中清淨玅理又如河沙之多亦只是增添戲論與本分事了無交涉所以云從門入者不是家珍以文字之學總是名言習氣障自悟門不能洞當人之性故也故盤山云向上一路千聖不傳學者勞形如猿捉影要須發大勇猛斷言語息思想忘能所絕影像一超直入不涉途程大事因緣方知端的故知此經為見性修行不取多聞知解是以阿難已悟玅覺明心知宗不昧下乃重告善逝密請修行故知先悟後修理行冥合若但取一期知解不慕進修欲證究竟菩提涅槃無有是處。",
    "X14n0289_004:0335b18_0": "汝雖談說因緣自然決定明了人間稱汝多聞第一以此積劫多聞熏習不能免離摩登伽難何須待我佛頂神呪摩登伽心婬火頓歇得阿那含於我法中成精進林愛河乾枯令汝解脫是故阿難汝雖歷劫憶持如來祕密玅嚴不如一日修無漏業遠離世間憎愛二苦如摩登伽宿為婬女由神呪力銷其愛欲法中今名性比丘尼與羅睺母耶輸陀羅同悟宿因知歷世因貪愛為苦一念熏修無漏善故或得出纏或蒙授記如何自欺尚留觀聽。",
    "X14n0289_004:0335c03_0-0": "此下極言多聞之弊以激其進修也言汝談說自然因緣決定明了毫無差誤聲聞眾中推汝多聞以為第一用此多聞積劫熏習不能遠離婬術之難若果多聞可以脫苦離縛何須待我神呪冥加之力立使登伽婬火頓歇不待多生便證三果報居不還不生欲界汝亦得脫不然汝又安能得脫婬難哉一呪力而頓超三果一呪力而即得解脫則知呪力與多聞力日劫相倍是故汝雖憶持如來秘密玅嚴不如一日肯修秘密玅嚴便可遠離憎愛二苦以此二苦從投胎時異見成憎同想成愛處便有是與正俱生極難除者若肯一日修無漏業即能永斷況其他乎但汝不肯進修耳故下文復舉劣機得益以痛責之言一念者則非一日之比言熏修者則非徒勝口說出纏指登伽授記指耶輸言耶輸女身已為弱質登伽婬女更是劣機但以一念熏修皆獲大益而汝以堂堂丈夫為人天中眾所知識反自迷自昧自纏自縛尚留見聞躭著戲論而不肯修無漏業者真自欺也此等苦切語是責之也勸之也進之也○自阿難請三觀之旨而如來初則離三細以顯奢摩次則即三細以顯三摩次則不即不離以顯禪那最後則雙遮雙照離即俱非以顯如來藏心為三觀之體至此則一心三觀之旨已明阿難解心至此已極故世尊激其進修良以見解雖圓若不進修秪是承虗接響知解宗徒無由得入故先德云單明自己不了目前如此之人只具一隻眼理孤事寡終不圓通隻翼單輪豈能飛運應須責躬省己策發進修故起信云譬如大摩尼寶體性明淨而有鑛穢之雜若人雖念寶性不以方便種種磨治終無得淨法界觀云若不洞明前解無以躡成正行若守解不捨無以入茲正行是故行由解起行起解絕故即前見解開修證門已上發明玅奢摩他三摩禪那以當見道分竟下文發明最初方便以明修道分。",
    "X14n0289_004:0336a13_0": "阿難及諸大眾聞佛示誨疑惑銷除心悟實相身意輕安得未曾有重復悲淚頂禮佛足長跪合掌而白佛言無上大悲清淨寶王善開我心能以如是種種因緣方便提獎引諸沉冥出於苦海世尊我今雖承如是法音知如來藏玅覺明心徧十方界含育如來十方國土清淨寶嚴玅覺王剎如來復責多聞無功不逮修習我今猶如旅泊之人忽蒙天王賜與華屋雖獲大宅要因門入惟願如來不捨大悲示我在會諸蒙暗者捐捨小乘畢獲如來無餘涅槃本發心路令有學者從何攝伏疇昔攀緣得陀羅尼入佛知見作是語已五體投地在會一心佇佛慈旨。",
    "X14n0289_004:0336a24_0-0": "此敘大眾領悟得益也疑惑銷除者通指前文五重問答也心悟實相者即指前文真勝義性寂滅場地及無戲論法也身意輕安者已悟楞嚴大定故得未曾有者極慶聞所未聞故重復下別敘阿難得益悲淚者由大事已明悲向來之唐喪也超過一切故曰無上佛諸功德大悲為首故獨稱之離垢末尼隨意出生賑給無盡佛亦如是故曰清淨寶王善開我心者言我向為因緣茅塞不能開悟世尊三番開示心得開明故曰善開種種因緣者如約頭以推其無因約狂以推其無緣也提謂提撕以警其迷執獎謂獎勸以振其疲怠引謂誘掖沉謂陷溺冥謂昏蔽苦謂憎愛世尊下特請入佛知見之門也知即前文了然自知之知含育謂包含生育如來即正報剎即依報言我向來有此廣大覺性清淨本然周遍法界含育十方而不知不解世尊以種種方便提携獎誘令得解悟比之向日已覺改頭換面慶幸己甚以為知此一事千了百當不復更有所事矣而如來復責多聞無功不如一日修無漏業然此藏性十方無壁四面無門無由得入正如旅泊之人雖蒙天王賜屋不得其門終不能入故求指示入門之處睦州云汝等諸人還得箇入頭處也未若未得箇入頭處須覓箇入頭處若得箇入頭處已後不得辜負老僧故曰得其門也等諸佛於一朝若不得其門不見室家之好故悟藏心之後而重請入門也宗鏡問云此宗鏡中如何信入答但不動一心不住諸法無能所之證亡智解之心則是無信之信不入之入人法二空心境雙寂如大般若云繫緣法界一念法界知真法界不應動搖若言我入法界已動法界能所兩忘入相斯寂故不動法界是入法界也是故若有能證即為有人若有所證即為有法以唯一真法界心外無法不可以法界更證法界下文所說入處葢如此示我下正請發心障蔽曰蒙昏迷曰暗意謂已證小乘有餘涅槃者令其捨小乘而獲大果不知發何等心為入門之路復令下次請斷惑謂未證四果如我等輩者意識尚存世尊既不許用意識觀察降伏又從何處攝伏疇昔攀緣然後得陀羅尼入佛知見。",
    "X14n0289_004:0336c14_0": "爾時世尊哀愍會中緣覺聲聞於菩提心未自在者及為當來佛滅度後末法眾生發菩提心開無上乘玅修行路宣示阿難及諸大眾汝等決定發菩提心於佛如來玅三摩提不生疲倦應當先明發覺初心二決定義。",
    "X14n0289_004:0336c19_0": "先略標二義菩提心未自在者是現在已發心或進或退而未決定者無上乘即佛乘也玅修行路者由此路而直至佛乘也不生疲倦者得此路而不滯化城也應當者示其所當必用也發覺初心者覺即菩提謂最初欲發得菩提心決定不可廢此二義若無三如來藏第一義心為因則無由證極果若不知現業流識第二義心為業本則無處降心故要決定審因心又要決定審業本也。",
    "X14n0289_004:0337a03_0": "云何初心二義決定阿難第一義者汝等若欲捐捨聲聞修菩薩乘入佛知見應當審觀因地發心與果地覺為同為異阿難若於因地以生滅心為本修因而求佛乘不生不滅無有是處以是義故汝當照明諸器世間可作之法皆從變滅阿難汝觀世間可作之法誰為不壞然終不聞爛壞虗空何以故空非可作由是始終無壞滅故則汝身中堅相為地潤濕為水煖觸為火動搖為風由此四纏分汝湛圓玅覺明心為視為聽為覺為察從始入終五疊渾濁云何為濁阿難譬如清水清潔本然即彼塵土灰沙之倫本質留礙二體法爾性不相循有世間人取彼土塵投於淨水土失留礙水亡清潔容貌汩然名之為濁汝濁五重亦復如是。",
    "X14n0289_004:0337a16_0-0": "此以第一義答第一問也第一義者即前所說第一義諦三如來藏心也楞伽所謂性自性第一義心故曰法筵龍象眾當觀第一義言汝等決欲棄捨小乘修菩薩行而欲入佛知見應當用此微密觀照審詳觀察此因地心與果地覺是同是異以末後牢關不離最初一念故令其審觀也由阿難向所用者皆是因緣生滅心不曾用不生不滅第一義心生滅心如藥汞銀入煅則流去不生不滅心猶如精金有實作用今欲入佛知見故先令其審察當以第一義心為大事因緣方能入佛知見故法華云如來為一大事因緣出現於世葢指此也言發心者謂此覺心本來清淨周遍法界但為二障所纏鬱而不起若得此心開發則於菩提果覺何有故華嚴云有一大經卷",
    "X14n0289_004:0337a16_0-1": "量等三千界在於一塵中一切塵亦然有一智慧人慧眼悉明淨破塵出經卷廣饒益眾生若因中開發此心直下薦取即用此心廣修萬行則頭頭究竟事事堅固流入玅莊嚴海如水投水脗然契合若不以此為因地心仍用舊時名言所熏業種所起生滅識心以為本因而欲求佛果覺如敲氷索火掘地覓天惡可得哉故求佛乘者必欲審因心也宗鏡云攝前則攝後如舉初步即到千里之途程得一則得餘猶觀天月即了一切之水月婆沙論云若離初發念則不成無上道所以云一切功德皆在初心以是下令其在器界審觀有壞不壞以例心有生滅不生滅義汝當徧觀世間可作之法皆有變壞唯是虗空不壞無造作故如是則知第一義心為因方得究竟金剛不壞之體若以生滅為因多劫終成敗壞故求佛乘者必審因心也然此不生滅性不離現在生滅識中但為四大六根渾濁而不得見故令其詳審觀察也四纏即四大由四大拘縛不得自在故名曰纏本來清淨而無渾濁曰湛本來徧周而不分隔曰圓玅覺是體明心是用言汝具有湛圓玅覺明心清淨本然周徧法界一為四大所纏則不徧周裂為六根則不本然翻為五濁則不清淨故從始至終而成五濁始終者劫濁為始命濁為終云何下喻明濁相清水喻淨覺塵土喻四大六根倫猶類也留礙者有形塊也法爾者自然也循順也汩湣汩也正顯清淨覺心本與四大六根了無交涉由彼最初一念忽起遂分能所而清淨覺心渾濁不見故曰汝濁五重亦復如是下文云自心取自心非幻成幻法取字是渾濁之根也。",
    "X14n0289_004:0337c11_0": "阿難汝見虗空徧十方界空見不分有空無體有見無覺相織妄成是第一重名為劫濁汝身現摶四大為體見聞覺知壅令留礙水火風土旋令覺知相織妄成是第二重名為見濁又汝心中憶識誦習性發知見容現六塵離塵無相離覺無性相織妄成是第三重名煩惱濁又汝朝夕生滅不停知見每欲留於世間業運每常遷於國土相織妄成是第四重名眾生濁汝等見聞元無異性眾塵隔越無狀異生性中相知用中相背同異失準相織妄成是第五重名為命濁。",
    "X14n0289_004:0337c21_0-0": "此別明五濁相也五重濁相皆是就目前發揮先明劫濁梵語劫波此云時分言汝舉頭一見空時兩無邊畔各自徧周不能分析空本無體由汝一見便覺蒼蒼莽莽者為空見本無知由空入眼便知明明了了者是見然則無體者因見而有體無知者因空而有覺故一見空時綿綿密密混作一團便是渾濁便是時分不淨故曰劫濁見空既爾見色亦然○汝身下明見濁摶取也言汝投胎時吸取父精母血而成四大之身見聞覺知元一精明本無留礙由汝四大壅塞不能超越無留礙者成留礙矣地水火風元非一物本無知覺被此精明領以為境令生覺受無知覺者有覺知矣是則現前六根四大織妄相成渾濁真性名為見濁六根單言見者舉一以該餘也○又汝下釋濁煩惱即汝意識憶識誦習能緣三世境界此意識性從六根發根能發識故此意識相在六塵現識能了境故是則離塵無意識相離根無意識性故知根塵識三混作一處起貪瞋等渾濁真性名煩惱濁○又汝下明眾生濁知見是主人公業運是善惡業謂此一身雖是主人執受步步關心無奈業力推移不容作主故欲留者因業力遷而不能常存欲遷者因主人留而不能即去由此去留混成一處渾濁真性名眾生濁以此業運是眾生同分生基名眾生濁○汝等下釋命濁即汝六根元是一體由此四纏分為六處事同一家不得名異故性中相知各開門戶不得名同故用中相背唯同與異二不可定故曰失準由此一同一異若經緯密織而不可分不得自在渾濁真性名為命濁此五濁者自一念晦昧為空之後便不澄清故示其相下復授以澄濁之方也。",
    "X14n0289_004:0338b03_0": "阿難汝今欲令見聞覺知遠契如來常樂我淨應當先擇死生根本依不生滅圓湛性成以湛旋其虗妄滅生伏還元覺得元明覺無生滅性為因地心然後圓成果地修證如澄濁水貯於靜器靜深不動沙土自沉清水現前名為初伏客塵煩惱去泥純水名為永斷根本無明明相精純一切變現不為煩惱皆合涅槃清淨玅德。",
    "X14n0289_004:0338b10_0-0": "見聞覺知即是湛圓玅覺明心所分開者即因心四德常樂我淨即果觀四德今欲依此根性為修因之本故先以此標定也言汝正當清濁不分時欲將此因中四德遠契如來果上四德有箇方法應先決擇死生根本由阿難向以六識三毒為死生根本不知此是如來誘引小根出三界之權巧非真實法今阿難欲求無上菩提故令其先擇死生根本不依生滅六識原依不生不滅六根圓湛之性所成此不生滅圓湛之性即汝向來所遺而世尊說為是心者此生死根本即汝向來所用而世尊斥為非心者然此生滅六識實非他物元從圓湛之性引起故即以圓湛不生滅性旋其界內界外二種虗妄滅生令彼回心不至跳梁伏歸淨覺用此清淨覺為因地心如金作器器器皆金故能圓成果地修證此因心正當下文發心住自初住至等覺名修玅覺名證如澄下喻合靜器合圓湛根性沙土合客塵即界內無明泥合根本無明即界外無明若此二種無明既盡則明相精純毫無纖翳故或瞋或喜任意縱橫更無煩惱皆與如來常樂我淨相契合矣問審因心而必因見聞覺知者何也答由此四纏分汝湛圓玅覺明心為視聽覺察故見聞覺知全是妙覺明心是則既由見聞覺知而成濁必由見聞覺知而澄濁所謂既從地倒還從地起也大智度論云譬如清淨池水狂象入中令其渾濁若水清珠入水即清淨不得言水外無象無珠心亦如是煩惱入心能令心濁諸慈悲等善法入心能令心淨然垢淨不定真妄從緣若昧之則念念輪迴遺失真性若照之則心心寂滅圓證涅槃是以楔出楔將麤接麤若不執妄尚不說空幻影潛消智光息燄矣。",
    "X14n0289_004:0338c16_0": "第二義者汝等必欲發菩提心於菩薩乘生大勇猛決定棄捐諸有為相應當審詳煩惱根本此無始來發業潤生誰作誰受阿難汝修菩提若不審觀煩惱根本則不能知虗妄根塵何處顛倒處尚不知云何降伏取如來位阿難汝觀世間解結之人不見所結云何知解不聞虗空被汝隳裂何以故空無形相無結解故則汝現前眼耳鼻舌及與身心六為賊媒自劫家寶由此無始眾生世界生纏縛故於器世間不能超越。",
    "X14n0289_004:0339a01_0-0": "前以不生不滅為因地心故標第一義此以現業流識為死生根故標第二義以答第二問也意謂欲入不生不滅第一義心決要向第二頭見色聞聲處薦取以依六根修行是第二頭事故前喻之如第二月先德云第一句薦得堪與諸佛為師第二句薦得堪與人天為師是也諸有為相即是舊時所修因緣法由彼向執意識為發業潤生煩惱根本不知現業流識為發潤煩惱根本也良以業不發處是真發心生不潤時是真無生故令其審詳發業潤生是誰作而誰受且夫六根是八識體六根引生六識及諸煩惱作苦因六識造業招引生死是苦果麤論似唯六識造業細推實是六根自作現觀似唯六識受報而六壞亦唯六根自受故令其審詳者意明八識自作自受非六識也既知業識造業受報則知轉業識方得發心證果也故楞伽云七識不流轉不受苦樂非涅槃因如來藏者受苦樂與因俱若生若滅故知生死根本非六識也阿難下反顯欲修行者決定當知此煩惱根本也若不知煩惱根本則不知根身器界從何處顛倒而生顛倒起處尚不能知從何降伏疇昔攀緣而欲取如來玅覺之果乎葢一真法界本無根塵由一念不覺妄生能所遂成顛倒由顛倒故引生六識生生滅滅輪轉無窮故欲取玅覺決當先知顛倒起處也下以喻明不識顛倒不知降伏此與下文若不知結則不知解同意結可解而空無結解者喻根結可解而玅覺性本無結解也則汝下正指出六根是結是顛倒處此六根是指六精墮於勝義浮塵二根中而與六塵相對以成結體此即顛倒處也由此六根為媒招引內賊劫取如來藏中珍寶散失於外漫無歸宿人但知六識為內賊劫家寶不知招引內賊劫家寶者實六根也故知起惑是六根造業是六根受報是六根劫家寶亦是六根此六根者實為生死結元故前云誰作誰受此云自劫是呼應處眾生世界即根身也器世間即器界也言此六根所以成結者皆由四纏分汝湛圓玅覺為視聽覺察於是見不超色聽不出聲等遂交織而成結故知根縛則世不能越根解則塵方得超也。",
    "X14n0289_004:0339b15_0": "阿難云何名為眾生世界世為遷流界為方位汝今當知東西南北東南西南東北西北上下為界過去未來現在為世方位有十流數有三一切眾生織妄相成身中貿遷世界相涉而此界性設雖十方定位可明世間秪目東西南北上下無位中無定方四數必明與世相涉三四四三宛轉十二流變三疊一十百千總括始終六根之中各各功德有千二百。",
    "X14n0289_004:0339b22_0": "此約眾生世界以顯六根數量也心本無時亦無方所故曰十世古今不離當念無邊剎海不隔毫端但一涉思惟便有方所一有方所便有定量一有定量便有遷流故界有十方世有三世方有限量世有遷流若經緯然一切眾生皆由世界相織而成此身故世與界即在身中貿易遷流未甞停住人自不知耳所謂有力者負之而趨昧者不覺也界有十方而十方中唯取四方為正不取四隅以非正故不取上下以無位故不取中位以無定故唯取三世與四方相涉故三世與四方相涉數有十二而四方與三世相涉亦數十二也流變三疊者謂遷流變易自一而成三疊也一十百千者吳興曰謂增一為十增十為百增百為千今且以方涉世明三疊者第一約四方各論三世共成十二第二於東方三世變一為十成三十南西北方亦復如是四方各三十成一百二十第三於東方三十變十為百成三百三方亦爾四方各三百成千二百也以世涉方其例可解此世界自然之定數也如大衍之數五十用十乘五用五乘十亦是定數但易約五行故五十相乘此約世界故十二相涉三世四方是唯識不相應行中攝以依根中色心假立分位故然六根功德皆是自體本具無不圓滿故約三世四方自少增多顯其圓滿而已且此功德皆是統論凡夫所具非真性勝用即如下文耳舌意三圓滿千二亦比餘根稍圓而已豈徧周法界之謂哉故知稱真聖人六根功德數皆無量。",
    "X14n0289_004:0340a01_0": "阿難汝復於中克定優劣如眼觀見後暗前明前方全明後方全暗左右旁觀三分之二統論所作功德不全三分言功一分無德當知眼惟八百功德如耳周聽十方無遺動若邇遙靜無邊際當知耳根圓滿一千二百功德如鼻齅聞通出入息有出有入而闕中交驗於鼻根三分闕一當知鼻惟八百功德如舌宣揚盡諸世間出世間智言有方分理無窮盡當知舌根圓滿一千二百功德如身覺觸識於違順合時能覺離中不知離一合雙驗於身根三分闕一當知身惟八百功德如意默容十方三世一切世間出世間法惟聖與凡無不包容盡其涯際當知意根圓滿一千二百功德。",
    "X14n0289_004:0340a13_0": "上以世間相涉論故無優劣此以六根功用論欲其選根故以六根之全缺克定優劣也眼根三分之二者則師云四方各二百四隅各一百今眼所見前及左右三方已成六百併前二隅二百共成八百唯後方併二隅不見故曰三分之二耳根周聽無遺者十方擊鼓十處俱聞故聞聲時似有近遠不聞之時實無近遠故為圓根鼻根缺中交者溫陵云出能取香入能聞香出入之中無能故缺中交長水云出入中交共成三分一分四百缺於中交故唯八百舌根言有分而理無窮者謂一句含無量義故又麤言細語皆有至理故孤山云此取能說不論甞味若取甞味其功則劣合中知故身根離一合雙者離中不知是缺一分合時有覺有違有順故具二分意默容者謂此意根能受熏持種能默容十方三世乃至世出世法若凡若聖無不包含盡其涯際是故圓滿。",
    "X14n0289_004:0340b05_0": "阿難汝今欲逆生死欲流返窮流根至不生滅當驗此等六受用根誰合誰離誰深誰淺誰為圓通誰不圓滿若能於此悟圓通根逆彼無始織妄業流得循圓通與不圓根日劫相倍我今備顯六湛圓明本所功德數量如是隨汝詳擇其可入者吾當發明令汝增進十方如來於十八界一一修行皆得圓滿無上菩提於其中間亦無優劣但汝下劣未能於中圓自在慧故我宣揚令汝但於一門深入入一無妄彼六知根一時清淨。",
    "X14n0289_004:0340b14_0-0": "前令決擇死生根本是六根已次又顯六根功德有全缺已此令其揀選六根之中誰為圓根也逆字是轉凡入聖之玅用以此六根順之則生死始逆之則輪迴息如流逸奔色順也返流旋一逆也前之不隨後之不循皆是逆義如易之地天為泰天地為否地山為謙山地為剝皆逆義也故曰五行順行大地火坑五行顛倒大地法寶易逆數也要知修行無別巧玅只此逆字該括無餘故曰汝今欲逆生死欲流乃欲反窮欲流之根以至不生滅性別無下手工夫應當勘驗此等能受用之六根誰為合中知誰為離中知誰深而難測誰淺而易知誰為用具誰為用缺若能向此六受用根中自推自勘悟得何者是圓通根用此圓根反窮生死欲流入不生滅則與不離不深不圓之根較功量德如日劫相倍矣此意密顯耳根是難是深是圓以眼雖離而不圓舌雖圓而不離意離圓深而不純離以前五根雖離合不同皆緣現量境緣現在境不帶名言無籌度心而意根能緣三類境緣三世境緣五根離合境故非純離今耳根既能離中取境又能周聽無遺故亦離亦圓亦深也今我備顯六湛圓明本來所具功德有離有合有深有淺有全有缺一一分明但汝自隨意樂詳擇其中有可入處吾當發明令汝直往向前不生退墮然我必欲令汝自擇而我不為汝擇者有故以十方如來法眼圓明聖性皆通於一切法若順若逆皆成方便實無優劣無可揀擇但汝劣根未得圓通自在智慧於六根門頭不免窒礙故我令汝在六門中獨選一門深入至無生滅若深入一門則餘五根應時齊拔皆得解脫不勞餘力矣上來密示耳根已竟下因問而更加詳明也。",
    "X14n0289_004:0340c20_0": "阿難白佛言世尊云何逆流深入一門能令六根一時清淨。",
    "X14n0289_004:0340c22_0": "此因解不明徹故躡前二意以請益也意謂欲逆生死欲流至不生滅不知何者是生死欲流是我所當逆者又言六根功德既有優劣則根根不同云何一門深入而六門一時皆得清淨了此問辭方知答意。",
    "X14n0289_004:0341a03_0": "佛告阿難汝今已得須陀洹果已滅三界眾生世間見所斷惑然猶未知根中積生無始虗習彼習要因修所斷得何況此中生住異滅分劑頭數。",
    "X14n0289_004:0341a06_0": "此先答其所當逆之流相也須陀洹此云預流謂小乘從凡入聖證初果而預入聖流故見所斷惑即八十八使亦名見流謂意根對法塵起分別見因此見惑流轉三界不能出離故斷此見惑即證初果入見道位根中積生無始虗習者即八十一品思惑亦名欲流有流無明流也言欲流者謂五根貪愛五塵名為思惑即貪瞋癡慢由此思惑流轉欲界不能出離故名欲流言有流者因果不亡名之為有謂色無色界思惑即貪與慢因此思惑流轉色無色界不能出離故名有流言無明流者無所明了故名無明即三界思惑中癡由此無明流轉生死不能出離故名無明流斷此三流即證四果由二果三果至阿羅漢向皆名修道故曰修所斷惑也何況其中生住異滅分劑頭數者其中指根中以離阿賴耶識諸惑無依故生住異滅者即菩薩所斷惑也天台目為界外見思是也按起信論三細中之業相是生相三細之後二六麤之前二為住相六麤之三四為異相第五為滅相而第六不與焉分劑頭數者謂初住以上至於玅覺總有四十二品也言汝雖今已斷見流得證初果尚有界內思惑猶未能盡況界外見思乎此皆汝所當逆而當反窮者向後五卷中之三空六結皆由此立而證道分之所斷者亦此也。",
    "X14n0289_004:0341b05_0": "今汝且觀現前六根為一為六阿難若言一者耳何不見目何不聞頭奚不履足奚無語若此六根決定成六如我今會與汝宣揚微玅法門汝之六根誰來領受阿難言我用耳聞佛言汝耳自聞何關身口口來問義身起欽承是故應知非一終六非六終一終不汝根元一元六阿難當知是根非一非六由無始來顛倒淪替故於圓湛一六義生汝須陀洹雖得六銷猶未亡一如太虗空參合羣器由器形異名之異空除器觀空說空為一彼太虗空云何為汝成同不同何況更名是一非一則汝了知六受用根亦復如是。",
    "X14n0289_004:0341b16_0": "此下欲答一解六淨之義故先辨本無一六也言汝既不知一解六淨之故汝且審觀現前六根畢竟是一畢竟是六若言是一則耳可見而眼可聽頭可履而足可語今則不然若言是六則身口與耳各不相關胡為問法之時必待身欽口問而後耳始得聞耶是故應知若不是一決當是六以用中相背故若不是六決當是一以性中相通故決非汝根元有一定之一又元有一定之六既非有一定之一六而今現有一有六者皆由無始一念顛倒與外六塵固結一處交淪互替故五濁凡夫執之為六伏根有學執之為一耳今汝雖證初果不入六塵已得六銷決非執六根中虗習尚未曾除猶未亡一由汝不能亡一六根種子一一具在宜乎不知一解六淨之義也且湛圓玅性之墮六根正如太虗之合羣器由器異而說空為異除器異而說空為一其一其異自在器形豈太虗有一異乎當知根與塵合則有異根塵不合則為一其一其異自在根塵合與不合非汝湛圓玅性定有一六也故知根塵結則同結解則同解。",
    "X14n0289_004:0341c11_0": "由明暗等二種相形於玅圓中黏湛發見見精映色結色成根根元目為清淨四大因名眼體如蒲萄朵浮根四塵流逸奔色由動靜等二種相擊於玅圓中黏湛發聽聽精映聲卷聲成根根元目為清淨四大因名耳體如新卷葉浮根四塵流逸奔聲由通塞等二種相發於玅圓中黏湛發齅齅精映香納香成根根元目為清淨四大因名鼻體如雙垂爪浮根四塵流逸奔香由恬變等二種相參於玅圓中黏湛發甞甞精映味絞味成根根元目為清淨四大因名舌體如初偃月浮根四塵流逸奔味由離合等二種相摩於玅圓中黏湛發覺覺精映觸摶觸成根根元目為清淨四大因名身體如腰鼓顙浮根四塵流逸奔觸由生滅等二種相續於玅圓中黏湛發知知精映法攬法成根根元目為清淨四大因名意思如幽室見浮根四塵流逸奔法。",
    "X14n0289_004:0342a02_0-0": "此明根結由塵也夫湛圓玅心本無黏著猶如明鏡一切影像皆現其中由一念妄動即為明暗二塵黏著而湛性被黏引發見性然未成根結也既而見精復與明暗二塵互相照映混合一處遂攬結二塵為勝義根此根即是最初清淨四大所成故曰根元目為清淨四大然微細難顯唯聖天眼方始得見故以葡萄朵顯其體而浮根但為勝義所依耳流逸奔色者謂此見精托彼二根流逸於外也故宗鏡云根有二種有清淨五色根有浮塵五色根若清淨五色根即是不可見有對淨色以為體能發生五識有照境用謂於眼中一分淨色如淨醍醐此色有故眼識得生無即不生俱舍云眼根微塵在眼星上傍布而住清徹膜覆如頗胝迦不相障覆耳根微塵在耳穴內旋環而住如卷",
    "X14n0289_004:0342a02_0-1": "樺皮鼻根微塵在鼻頞內背上面下如雙爪甲舌根微塵布在舌上形如滿月身根微塵遍住身分如身形量若浮塵五根即扶清淨根照境自體不能照境以浮根是麤顯色與清淨根為所依故由動下釋耳結也擊者鼓動義清濁不遺曰卷由通下釋鼻結也發謂引發薰猶皆受曰納由恬下釋舌結也五味相入曰參細嚼其味曰絞由離下釋身結也冷煖相交曰摩摶攬取也腰鼓即細腰鼓俗呼杖鼓顙腔也由生下釋意結也言意思者意以思量為性故意之浮根即肉團心正法念經所謂狀如蓮華開合者是也中有一竅此由最初吸取父母精血時而意即附著於中以奔法所謂無明殻也然在身中人不可見故用思字以明有思量處即其所在也如幽室見者處明者不能見暗中一物而處暗者能見明中諸事葢意根處此杳冥昏默之地為前五根運籌布策故以此狀其知體也此即前文由此世界生纏縛故於器世間不能超越所謂結即同結也。",
    "X14n0289_004:0342b10_0": "阿難如是六根由彼覺明有明明覺失彼精了黏妄發光是以汝今離暗離明無有見體離動離靜元無聽質無通無塞齅性不生非變非恬甞無所出不離不合覺觸本無無滅無生了知安寄。",
    "X14n0289_004:0342b14_0": "此牒上因塵故有結以明離塵故無結也言此六根皆由性覺湛明之體一動而轉為能明之明覺遂失覺明精了之體由是粘明暗而發見結動靜而成聽等光即指六根精光如眼光命光之類此即攬塵以成結也是以離明暗則無見性離動靜則無聽精等此則離塵則無結也此見體聽質等是指結體言非指性體也而阿難誤認故有下文斷滅之疑。",
    "X14n0289_004:0342b22_0": "汝但不循動靜合離恬變通塞生滅明暗如是十二諸有為相隨拔一根脫黏內伏伏歸元真發本明耀耀性發明諸餘五黏應拔圓脫不由前塵所起知見明不循根寄根明發由是六根互相為用。",
    "X14n0289_004:0342c02_0": "此下教以離塵則一解六亡本無一六也不循猶不隨也此不字即是制奔色奔聲之羈靮也與前逆字反字旋字同義言汝欲令六根不隨六塵流轉應當選一圓根為下手處念茲在茲併力於一而先拔之若使一根外脫內伏根塵不相偶合則熟處漸生生處漸熟自然還伏元明本覺之體從此更不黏妄發光而本有常光逈然獨露若此一根既拔則餘五根當時齊拔此即一根反源六根解脫也至此則外不由塵內不循根常光現前即有鑑照不過權托彼根示有照明之相而已此雖不易耳目之用而視聽實不用耳目如是則一根能作諸根用矣此即入一無妄彼六知根一時清淨也故宗鏡云常照常耀鐵圍不能匿其輝遍界遍空穹蒼不能覆其體豈假前塵發照對境生知自然寂然靈知湛然無際。",
    "X14n0289_004:0342c17_0": "阿難汝豈不知今此會中阿那律陀無目而見跋難陀龍無耳而聽殑伽神女非鼻聞香驕梵鉢提異舌知味舜若多神無身覺觸如來光中映令暫現既為風質其體元無諸滅盡定得寂聲聞如此會中摩訶迦葉久滅意根圓明了知不因心念。",
    "X14n0289_004:0342c22_0": "此恐凡小不信六根互用故引此以證阿那律此云無貧跋難陀此云賢喜殑伽河名此云天堂來以其自雪山頂無熱惱池流出故驕梵鉢提此云牛相人而牛飼者也舜若多此云空即主空神也迦葉此云飲光阿那律以心見龍以角聽鉢提牛舌而知味空神無身而覺觸葢空神多劫以無身為苦如來放拔苦光時身觸暫現則樂不可言無色界天亦復類之修滅盡定者六七二識分別俱生我執悉斷故無心念合論曰如蛇以眼聽不必疑跋難陀龍也如蛟無目而能行水母得鰕乃能行不必疑阿那律陀也如螻蟻以身為鼻不必疑殑伽神女也蜂以腋為舌不必疑驕梵鉢提也如風無形物拒之則怒不必疑舜若多神也嗚呼眾生爭於口耳鼻舌數寸之間自以色香味觸為異可不哀哉孤山曰那律等六人或是凡夫業報或是小聖修得斯皆妄力尚不依根何況圓脫豈無互用。",
    "X14n0289_004:0343a15_0": "阿難今汝諸根若圓拔已內瑩發光如是浮塵及器世間諸變化相如湯銷氷應念化成無上知覺。",
    "X14n0289_004:0343a17_0": "此牒根身既超而器界亦超也以根塵二法解則同解故六根齊拔內瑩發光得法性身則浮塵器界乃至明暗動靜等相應念全成法性土矣是知六根未解非惟器界不得自在即根身亦不得自在若六根既解非唯根身得大自在即器界亦得自在故學者但當解根無勞出界世界自在如觀音得三十二應入國土身之類是以含識界中從無始來內為六根所縻外為六塵所結觸途現境寓目生情如彌猴而六處俱黏類[虫*太][虫*未]而諸塵盡泊所以見不超乎色界聽不出乎聲塵若投網之魚似處籠之鳥進退俱阻如羝羊之觸藩驚懼齊臨若乳燕之巢幕若能知塵是識了物即心不為延促所拘豈令大小所轉即能隨物應跡赴感狥機不動道場分身法界矣。",
    "X14n0289_004:0343b07_0": "阿難如彼世人聚見於眼若令急合暗相現前六根黯然頭足相類彼人以手循體外繞彼雖不見頭足一辨知覺是同緣見因明暗成無見不明自發則知暗相永不能昏根塵既銷云何覺明不成圓玅。",
    "X14n0289_004:0343b11_0": "此引世人不藉明而得見以證明不循根寄根明發也聚見於眼者謂性本周遍而迷者不知但謂因明而聚見於眼離明則無見假令世人正當因明聚見於眼時忽然急合其眼則暗相現前與餘根無異設復有人當前而立則六根黯然不復知其頭之與足然世合眼人以手循彼外人之體而撫摩之雖不假眼而頭足一辨了然無惑是則暗中所知與明中所見者了無有異故知藉明而見者離明則無見若不藉明而見自發者是不明之相無見之見自然寂照靈知何曾間斷此則明所不能明暗所不能暗者誰謂見必藉明而有耶故學人問先德云如何是大悲千手眼答曰如人夜間摸得枕子是知凡夫之根尚不藉明而見況根塵既銷真光獨露之人有不發圓通不得大自在者哉。",
    "X14n0289_004:0343c02_0": "阿難白佛言世尊如佛說言因地覺心欲求常住要與果位名目相應世尊如果位中菩提涅槃真如佛性菴摩羅識空如來藏大圓鏡智是七種名稱謂雖別清淨圓滿體性堅凝如金剛王常住不壞若此見聽離於明暗動靜通塞畢竟無體猶如念心離於前塵本無所有云何將此畢竟斷滅以為修因欲獲如來七常住果世尊若離明暗見畢竟空如無前塵念自性滅進退循環微細推求本無我心及我心所將誰立因求無上覺如來先說湛精圓常違越誠言終成戲論云何如來真實語者惟垂大慈開我蒙恡。",
    "X14n0289_004:0343c12_0": "此誤執結體為性體以起斷滅之疑也先牒定前文若於因地以生滅心為本修因而求佛乘不生不滅無有是處為疑根世尊下先推果覺是常菩提是斷五住而得者涅槃是斷二死而證者真如是經煅煉而成者佛性是因磨礱而顯者空如來藏是空諸有而現者菴摩羅識此云白淨識與大圓鏡智皆是轉業識所成者但分別一切而無染著曰白淨圓照萬法而無分別名圓智耳此之七種名雖差別皆是如來自證法門一得永得更無遷變故喻之如金剛也清淨即玅湛圓滿即總持堅凝即不動常住不壞即首楞嚴大定也若此下次推因心斷滅不合果覺先牒離明離暗無有見體等文次牒一卷塵非常住若變滅時此心即同龜毛兔角等文意謂見性離塵無體與前識心離塵無體皆同云何將此畢竟斷滅為因地心乃欲獲如來七常住果是何異邀空華而結空果耶世尊下復轉辯根識不異進以識心推退以見性審循環者推審不止一度也言我如是微細推審若離前塵決無我心及心處所既成斷滅欲將何物為因而欲求如來無上知覺乎今此見性既成斷滅云何如來先說見性是湛是精是圓是常是則違越誠言亦成戲論云何如來自稱真實語者蒙謂識見不明恡謂疑惑不捨。",
    "X14n0289_004:0344a11_0": "佛告阿難汝學多聞未盡諸漏心中徒知顛倒所因真倒現前實未能識恐汝誠心猶未信伏吾今試將塵俗諸事當除汝疑。",
    "X14n0289_004:0344a14_0": "此先責其顛倒也言汝好學多聞無心盡漏故汝心中但是記得顛倒所因而已其實自己現前顛倒不能諳識設我更有開示恐汝所執甚真一時不解故我且將塵俗易了之事為汝發明汝必因此而除疑矣。",
    "X14n0289_004:0344a19_0": "即時如來勅羅睺羅擊鐘一聲問阿難言汝今聞不阿難大眾俱言我聞鐘歇無聲佛又問言汝今聞不阿難大眾俱言不聞時羅睺羅又擊一聲佛又問言汝今聞不阿難大眾又言俱聞佛問阿難汝云何聞云何不聞阿難大眾俱白佛言鐘聲若擊則我得聞擊久聲銷音響雙絕則名無聞。",
    "X14n0289_004:0344b01_0": "世尊一往答阿難語皆是金城湯池無可攻勢而阿難能攻人之所不能攻此真善雲梯仰攻者世尊不操一弓不費一矢但借鐘聲為彼發明亦是城門失火殃及池魚也若是別人只消羅睺一擊疑團粉破何須再審世尊見阿難是箇細作故令羅睺再擊而再審者欲令在聞聲邊究其落處也爭奈阿難佯打不知錯轉一語豈知堂堂佛弟却與斷滅外道同流哉故知不識自己恒常之聞性却狥聲塵生滅之聞相豈非迷本聞而循聲流轉乎先德云顏色規模恰似真人前拈弄越光新及乎入火重烹煉到底終歸是假銀尊者之謂歟。",
    "X14n0289_004:0344b12_0": "如來又勅羅睺擊鐘問阿難言汝今聲不阿難大眾俱言有聲少選聲銷佛又問言爾今聲不阿難大眾答言無聲有頃羅睺更來撞鐘佛又問言爾今聲不阿難大眾俱言有聲佛問阿難汝云何聲云何無聲阿難大眾俱白佛言鐘聲若擊則名有聲擊久聲銷音響雙絕則名無聲。",
    "X14n0289_004:0344b18_0": "此復令擊鐘再騐者欲其知聲有聲無非關聞性也少選有頃猶言少時頃刻也。",
    "X14n0289_004:0344b20_0": "佛語阿難及諸大眾汝今云何自語矯亂大眾阿難俱時問佛我今云何名為矯亂佛言我問汝聞汝則言聞又問汝聲汝則言聲惟聞與聲報答無定如是云何不名矯亂。",
    "X14n0289_004:0344b24_0": "此斥其矯亂也由問聞答聞問聲答聲隨風倒柁言無定準故名矯亂。",
    "X14n0289_004:0344c02_0": "阿難聲銷無響汝說無聞若實無聞聞性已滅同於枯木鐘聲更擊汝云何知知有知無自是聲塵或無或有豈彼聞性為汝有無聞實云無誰知無者是故阿難聲於聞中自有生滅非謂汝聞聲生聲滅令汝聞性為有為無汝尚顛倒惑聲為聞何怪昏迷以常為斷終不應言離諸動靜閉塞開通說聞無性。",
    "X14n0289_004:0344c08_0": "釋迦父子既借鐘聲與阿難說法竟復與鐘聲添箇註脚故告之曰鐘聲初歇之時只是無響非是無聞若是無聞則汝聞性隨聲已滅汝則同於無知枯木若鐘聲更擊汝應不聞今更擊仍聞則汝聞性不隨聲滅明矣然知聲有聲無自是聲塵或有或無豈彼聞性因聲有而成有因聲無而成無耶若使聞性實隨聲滅則汝知聲無者更是阿誰是則聲有知有聲無知無聞性何曾斷滅哉故知聲於聞中有生有滅非是汝之聞性因聲生而令汝聞性為有因聲滅而令汝聞性為無也故因責之曰若是斷常或恐難知若是聲聞固當易了而汝現今尚且惑聲為聞何怪以真常性為斷滅見耶今既解此不應復執離塵無性矣阿難會搜人短處世尊亦會見人破綻真作家敵手哉。",
    "X14n0289_004:0344c22_0": "如重睡人眠熟床枕其家有人於彼睡時搗練舂米其人夢中聞舂搗聲別作他物或為擊鼓或為撞鐘即於夢時自怪其鐘為木石響於時忽寤遄知杵音自告家人我正夢時惑此舂音將為皷響阿難是人夢中豈憶靜搖開閉通塞其形雖寐聞性不昏縱汝形銷命光遷謝此性云何為汝銷滅。",
    "X14n0289_004:0345a04_0": "此引夢事以騐聞性不斷也重睡猶濃睡也搗練杵聲舂米碓聲夢時自怪者夢中占夢也忽寤遄知杵音者覺而後知其夢也自告家人者醒時述夢中事也阿難下就打鼾作寱處點明聞性不昏縱汝下復就眼光落地時點明聞性不滅也。",
    "X14n0289_004:0345a09_0": "以諸眾生從無始來循諸色聲逐念流轉曾不開悟性淨妙常不循所常逐諸生滅由是生生雜染流轉若棄生滅守於真常常光現前根塵識心應時銷落想相為塵識情為垢二俱遠離則汝法眼應時清明云何不成無上知覺。",
    "X14n0289_004:0345a14_0": "此下普示迷常逐斷故有輪迴棄斷守常即成正覺也不循所常逐諸生滅者背根性而隨逐聲色也棄者謂捨之不近守者謂用之不離棄生滅而守真常者脫黏內伏也常光現前者發本明耀也根塵識心應時銷落者即一根解而五根應拔也想相為塵是微細法塵識情為垢是微細法愛皆是貼體汗衫也離此二種則眼根當下清明便是正法眼藏云何不成無上知覺乎故學人問高城和尚云和尚夜後無燈時如何師曰悟道之人常光現前有甚麼晝夜學人云何不見和尚光師曰擬將什麼眼見學人云世人現在同將眼見師彈指曰善哉一切眾生根塵相涉從無始來認賊為子至於今日常被枷鎖汝將眼見意識分別擬求佛道即是背却本心逐念流轉如此之人對面隔越。",
    "X14n0289_004:0345b05_0": "大佛頂如來密因修證了義諸菩薩萬行首楞嚴經合轍卷第四"
}