{
    "X15n0302_009:0329c12_0": "楞嚴經略疏卷之九",
    "X15n0302_009:0329c13_0": "福州鼓山湧泉禪寺沙門　元賢　述",
    "X15n0302_009:0329c14_0": "阿難世間一切所修心人(至)名為三禪。",
    "X15n0302_009:0329c15_0": "此下名色界十八天也此界無飲食婬愛睡眠三欲但有依正色相故云色界又以心離欲染名梵世以心離散動名禮天凡生此者必欲心全伏十善具足加以有漏禪觀者也若人不用真三摩地但以六行執身不婬至於想念俱無則心迹不交不留欲界必能上生梵世身為梵侶故名梵眾天若欲習既除淨心益著於諸律儀自然愛樂隨順是人應時能贊弘梵化故名梵輔天若淨心轉勝至於身心妙圓則出入動靜無非妙圓戒德淨矣復加以明悟慧解過人是人應身能統梵眾為大梵王故名大梵天此言妙者以異於欲之麤言圓者以其無不妙也言明悟者亦本修之觀智增明也此三勝流已離欲界八苦所不能逼雖非正修真三摩地而清淨心中欲漏不動名為初禪若已圓梵行而定力轉深深定發照其光尚微故名少光天若更發多光光光互照輝映十方徧成瑠璃其光大矣故名無量光天按此光雖稱無量止能照小千界而已若吸持圓光以為法音發於教化清淨闡揚妙應無盡故名光音天此三勝流與喜俱發憂愁不生雖非正修真三摩地而清淨心中麤漏已伏名為二禪若由前圓光教體披露妙理以成妙行由是滅前喜相通後樂相此樂寂淨今能少通故名少淨天若此淨空現前引而發之至於無際則身心俱得輕安方成寂滅之樂故名無量淨天淨樂益廣至於世界身心一切圓淨此德成就為彼勝託而歸休於是矣故名徧淨天此三勝流具大隨順得無量樂雖非正修真三摩地而安隱心中歡喜具足名為三禪按此已離喜得樂今復言歡喜畢具者何以此乃安隱心中恬寂清淨之真歡喜也。",
    "X15n0302_009:0330a19_0": "復次天人不逼身心(至)名為色界。",
    "X15n0302_009:0330a20_0": "前初禪離苦有憂二禪離憂得喜苦因盡矣至三禪離喜得樂然樂久必壞則樂亦是苦此天厭之乃於苦樂二心一時俱捨則麤重之垢滅而清淨之福生矣故名福生天此福生即捨心中之定生也若捨心圓融了無所礙定中發慧亦益清淨由是四無量善資之以行無漏禪定可從而發其福無限任心自在及未來際無有窮盡是福之最可愛者故名福愛天從是天而上有二岐路一往廣果直道也一往無想曲逕也若於先心定中發起無量淨光資禪福德抵於圓明如是修證而住則廣福所感得生勝處故名廣果天若於先心益精其捨功用無間捨功既極身心俱滅以是感果得心慮灰凝經五百劫彼認以為涅槃者也不知既捨生而趨滅是以生滅為因豈能發明不生滅性總為妄果而已初生半劫其想始滅最後半劫其想復生遂至淪墮故名無想天此四勝流既已苦樂雙捨故世間苦樂俱不能動然器非真常情俱生滅非為真不動地但有為功用至此已純熟矣名為四禪此中別有五不還天乃三果聖人之所寄居以彼斷欲界思惑俱盡則欲界非所居又苦樂雙亡則下三禪亦非所居獨以雙捨之心與此天同故於此居之若苦樂兩亡境不鬬心則心自無煩故名不煩天煩者熱之甚也若唯一捨心卷舒自在非獨苦樂不交而交之境亦不可得心漸清涼故名無熱天熱者煩之微也若此捨心照了十方圓遍澄寂更無塵象為之沈垢則其見微妙故名善見天若精見既現不為塵垢所滯則能發化無方隨緣應現如陶鑄萬象故名善現天若深究羣有之機至於色性之體則羣有未兆之先出乎形礙入無邊際者也是為色之極處故名色究竟天此五天者雖與廣果同居而四禪四王獨有聞而不能見以此天修無漏定前天修有漏定此天斷惑前天伏惑此天聖位前天凡位麤細逈殊所以不能見也此上凡十八天雖淺深不同然皆能離染欲獨行無交但尚有色質未免形累總名色界。",
    "X15n0302_009:0330c06_0": "復次阿難從是有頂(至)各從其類。",
    "X15n0302_009:0330c07_0": "此明無色界四天也此界依正俱無但聖眼觀之有三尺識神如中陰焉其從色究竟天而來者有二岐路其一於捨心中發起無漏智慧思惑斷盡慧光圓通即出塵界成阿羅漢入菩薩乘此由渠頓發大心速出三界名回心大阿羅漢其一不發大心徒欣上厭下而修遂入空界若捨厭情堅覺身為礙乃修空定滅身歸無是厭色歸空者也故名為空處天若諸礙既消而復以無礙為礙并此無礙亦滅則六識現行俱無唯八識獨全七識止得微細半分而已此厭空而依識者也故名為識處天若空色兩亡而識心未泯猶以為礙乃憑深定伏之令二識現行不生則十方寂然逈無所往故名為無所有處天若識心既滅而識性猶存是現行伏而種子存也此識種子即無始以來生死根本非凡夫外道所能盡亦非二乘聖人所能盡今強窮研於無可盡中發力盡之令此識性如存而又似不存若盡而又似非盡名為非想非非想天此等窮空至此已極然皆不達真空之理若從不還中聖道來者八萬劫滿思惑銷盡得出三界此乃定性聲聞故名不迴心鈍阿羅漢若從無想廣果諸天來者窮極不還智窮力竭迷漏無聞無可復往有墜下輪轉而已此四空天前二身滅後二心滅但得定中果色現前無復業果麤色總名無色界以上三界諸天雖各得一期受用然皆不了覺性故積妄發生妄現三界中間復逐妄不還終不免輪迴七趣隨類受生而已。",
    "X15n0302_009:0331a07_1": "○是諸天上各各天人一段明是總結諸天非單結四空也況四空非菩薩寄居之處今列在四空之後結界名之前甚為無謂宜在名無色界之後方為當也。",
    "X15n0302_009:0331a10_2": "全於末那半分微細古謂是六識半分七識全在於文不順溫陵謂是七識不緣色空之半分似與唯識不合以七識本不緣色空也愚謂七識內執八識見分為我今為空定所伏則此執似亦半銷故云半分微細也又無想諸外道天古說準經論皆謂外道業盡必墮無上生四空之理然翫今經從字明說從彼而生者也若作不生從字甚礙今以理推之經謂其不上生者以其無想不能加修也然此天後半劫想念復生或者懼將退墮極力窮空銷滅身礙因而上生間宜有之其言不生者乃言其大槩也。",
    "X15n0302_009:0331a21_0": "是三界中(至)畜生趣攝。",
    "X15n0302_009:0331a22_0": "此明修羅趣也修羅此云非天謂福力等天而無天行以其多嗔也三界之中唯欲界有之凡有四種若從鬼道中以護法力升居此趣遂乘通力入空而居此從卵所生鬼趣所攝若從天道降墜而來其所卜居隣於日月此從胎生人趣所攝若有能執持世間威力遠澈略無所畏常與梵王帝釋及四天爭權者此從變化而生天趣所攝更有一等下劣修羅生大海心沉水[宋木+儿]口旦遊虗空暮歸水宿此從溼生畜生趣所攝按此四種修羅論其福力似當在天趣之前仙趣之後今最後列者以其為四趣所攝故也其後二種經不言來處以理推之或亦天趣所貶或人間積行功可生天而獨以嗔心不斷遂淪此趣者有之。",
    "X15n0302_009:0331b10_0": "如是地獄(至)即魔王說。",
    "X15n0302_009:0331b11_0": "此總結前七趣也七趣之升沉往返不知幾千萬迴皆執為有莫知其妄今精研之此七趣皆昏沉有為之相因妄想而受生復因妄想而造業豈本心之所有哉本心妙而常寂圓而常遍明而常照且不由取捨修證而得七趣之在此心中直如空華之在太虗無毫末住著亦無毫末頭緒者也然今灼然成有受此輪迴者無非以殺盜婬三為之根本耳因有剎盜婬復有無殺盜婬有之則下墜無之則上升有無相奪而七趣由之輪轉也若能發明真三摩地則此本妙常寂之體有無俱無三界之業因不繫無二亦滅小乘之涅槃不居又何殺盜婬之可言哉眾生因不斷此三各起私業雖人人殊而以類相從報有同分之處皆一妄之所生而已所以欲修菩提者要先除此三惑此三不除縱以有為功力妄得神通終落魔道且假世智而妄研乘神通而造業轉加虗妄必從淪墮是為大可憐愍者豈本有菩提之咎哉依此則為正說反此則為魔說學者不可不知所擇也。",
    "X15n0302_009:0331c04_0": "即時如來將罷法座(至)無可哀救。",
    "X15n0302_009:0331c05_0": "前示七趣已竟當機無問大眾默然當罷法座佛乃再回金容為說魔事者何以修禪類多發魔魔能殺慧命奪善法其害靡細若不預明恐遭其亂但魔事微細非佛不能盡知諸人非獨不能知且不能問矣故佛無問而自說乃最後之深慈也凡欲趣無上菩提修真三摩地者方在觀行之中五陰未滅魔事必乘間而發若不能辨則洗心非正落於邪見將諸魔境認為真實且得少為足卒成淪溺如無聞比丘者焉豈不深可惜哉然禪之動魔其故何也緣此世界眾生其覺圓心體與十方諸佛無二因迷理故不達真如法一見有所相是之謂癡既有所相執而不捨是之謂愛由是其迷益徧頓現虗空其迷不息遂結世界是此有漏世界皆迷頑妄想之所安立者也彼虗空之生於心中第如片雲點於太清況世界之在空中有何堅固者乎所以若有一人撥顯真如還歸元體則諸妄應時銷滅虗空尚殞何況國土而不振裂但此三摩地與諸菩薩及阿羅漢心同一覺如空合空當處湛然固無震動之事若彼魔王鬼神諸凡夫天既是全妄所成以真傾妄遂至宮殿崩裂大地振坼而水陸飛騰無不驚慴也此中昏昧凡夫神通不具者則不覺其遷訛之故若諸魔王等各有五通咸知其故久戀塵勞豈容汝摧滅其處所以於諸三昧中僉來惱汝然彼雖大怒勢原不敵彼處塵勞我居妙覺邪不敵正妄不敵真故如風吹光如刀斷水了不相觸亦如湯加氷不日銷殞且從徒恃神力却從外來勢但為客客心既虗豈能直入必伺我主人之隙主人若迷正觀稍疎客得其便遂發魔境若能堅處禪那覺悟其妄則魔亦不能為害至於五陰銷而還明則魔事頓歇以彼羣邪全是五陰悉受幽氣今以我之明爍彼之幽有不破滅者哉若不能覺悟其妄則必為魔子魔人而已彼摩登梵呪力眇劣也止能毀汝一戒心尚未至淪溺事眇劣也然尚可畏如此若彼魔力豈摩登之比哉直能使汝將登寶覺之身忽遭墮落正如宰臣貴近天子而忽遭藉沒至於零落而不可救其為害為何如也。",
    "X15n0302_009:0332a15_1": "○按此魔事根於五陰修行者多不能免但最初若能親悟不生不滅之心以為本修因復以戒為之防呪為之護備是三者豈有魔事縱發魔事必便銷滅其有為所擾亂而至淪墮者皆先無此三者妄以比知之見修習圓通故也。",
    "X15n0302_009:0332a21_0": "阿難當知汝坐(至)成無上道。",
    "X15n0302_009:0332a22_0": "此下明五陰魔事魔不自來根於五陰一陰未破則有十種境現五陰以次而破故魔事以次而現今首明破色陰也行人初坐道場修習返聞念念無間則分別麤念自然銷滅諸念既滅則離念之體自然一切精明惺惺不昧此體離境故動靜不移此體離念故憶忘如一住於此中深入正定則精性妙淨定心顯也心光未發慧未生也故如明目人處大幽暗是為色陰區宇若得心光煥發無復葢覆如明目人洞見十方則色陰盡而劫濁之依色而立者從此可超矣觀色所由乃堅固妄想之所成非有真實而不可破者也今行人在此色陰之中以觀力精研將破未破之間遂發十境或於定中忽見前境四大不密身能出礙此由定力所逼使心光流溢前境故前境虗豁也或於定中忽見此身內無所障能於身內拾出蟯蛔而身相宛然此由定力所逼使心光流溢形體故形體虗豁也或者內身外境俱得虗豁則魂魄志意精神不守故居互相涉入迭為賓主交相說法或聞空中獨說或聞十方同敷此由宿聞熏種今因禪力激發遂寄神魄現為法音也或以此心澄澈發光忽見大地盡作金色種類悉是如來千佛繞毗盧之座蓮華浮百億之土此由宿聞聖教靈悟染心茲心光被研因而發現者也或於定中忽見十方虗空成七寶色或百寶色各各同時遍滿無礙無雜此由用心觀察制止過分忽然超越似證圓融無礙法界故現斯象也或於夜中合眼能見暗室中異物而室中原物亦自宛然此由心靜而細密澄其光不為境亂故能洞幽也或以此心徧入虗融忽然四肢同於草木一任燒斫曾無所覺或亦無所損此由心徧虗融則己身他物無不寂然五塵併銷四大排遣純一定心非外物所能傷觸也或淨心功極忽見十方諸佛國土凡聖同居無不炳然此由夙習厭穢欣淨積想成種今因定力所感故聖境冥現也或於中夜遙見遠方境界人物并聞其語此由觀力迫心精光飛出故多隔見也或研究精極乃發魔事忽於定中見善知識形體變遷此邪魅入心故發妄見也或無端說法通達妙義此天魔入心故發狂慧也此上十種境現皆由行人觀力與色陰交互故現斯事前九善境後一魔境雖有不同若以為聖而生心取著則魔必乘之妄言證聖其墮無間必矣。",
    "X15n0302_009:0332c12_1": "○色陰盡則能超越劫濁據古諸解多作觀行釋之則陰盡正是伏而非斷豈有超濁之義且經云見諸佛心如明鏡中顯現其像乃是相似理顯又經云生機隳裂酬業深脉感應懸絕乃是不受分段正入信之明文也何云伏而非斷乎若作相似釋之則陰盡是斷而非伏方有超濁之義但下五十種魔之文除聲聞緣覺餘皆云犯大妄語墮無間獄豈有入信超濁之人猶有此失乎吳興乃以五陰首段之文俱作斷釋以順超濁之義以五十種之文除聲聞緣覺餘俱作伏釋以順有墮之文前後雖通但二說遷就亦未為快至交光俱判入信且曰圓頓行人不取實證故自住前俱有墮義此乃臆說經論無據且所謂頓者非止頓悟亦能頓斷雖不取證惑亦自斷豈徒恃其虗見哉若曰住前俱有墮則是見思必未斷五陰必未盡憑何而判其入信乎至近解者多只順文訓釋前後相違殊為可笑今姑依吳興之說再俟高明訂之。",
    "X15n0302_009:0333a05_0": "彼善男子修三摩提(至)成無上道。",
    "X15n0302_009:0333a06_0": "此明破受陰也前色陰未盡如處幽暗無有所見今色陰既盡則能見諸佛心如明鏡中現其影像此乃相似理顯但未證真以有受陰為之領納故也既有領納發用不得故如人被魘手足宛然而不能動此名受除區宇若心能離身返觀其面隨意出入俱無所礙則受陰盡而見濁之依受而立者從此可超矣觀受所由乃虗明妄想之所成非有真實而不可破者也行人於受陰之中觀力所逼將破未破之間發十種境或於定中發大光耀有所發明知其非實用心抑之抑之過急激動悲憂種子生無限悲雖見蚊蚋憐若赤子若悟其非久當自歇若以為聖則悲魔附之逢人悲泣必失正定而從淪墜矣或於定中勝相現前得未曾有大生感激感激太過激動我慢種子生無限勇志齊諸佛謂三祇劫一念可超若悟其非久當自歇若以為聖則狂魔附之我慢無比必失正定而從淪墜矣或受陰未破進無所得色陰已銷退無所居隳墮於兩楹之中逈無所見因其無見生大枯竭沈憶不散將以此為精進之象此由定力偏勝無慧自照若悟其非自無他咎若以為聖則有憶魔附之旦夕懸憶必失正定而從淪墜矣或於定中慧力過猛專執自性尊勝便疑己是盧舍那此由不能恒審溺於知見若悟其非自無他咎若以為聖則有下劣易足魔附之自言得無上道必失正定而從淪墜矣或於定中新證未獲故心已亡歷覽二際之間自生艱險發無限憂如坐鐵床如飲毒藥常求捨命早取解脫此由勤修警懼之過激動悔惱種子若悟其非自無他咎若以為聖則有憂魔附之每自傷毀欣其捨命或常憂愁不耐見人必失正定而從淪墜矣或於受陰定中清淨安穩心生耽樂引動掉舉種子生大歡喜不能自止此由初得輕安無慧自禁若悟其非自無他咎若以為聖則有喜魔附之戲笑歌舞自謂得無礙解脫必失正定而從淪墜矣或於定中見色陰銷受陰現得少為足忽起無端慢心恃己凌他佛位尚輕何況二乘此由忽生勝見無慧自救若悟其非自無他咎若以為聖則有大我慢魔附之不禮塔廟摧毀經像必失正定而從淪墜矣或於圓定精明之中復能發慧與理暫契智與理冥不相違拒因無違拒遂發無量輕安身心調適謂言證聖得大自在此由慧暫契理受陰與諸塵境無重濁之惑故獲輕清若悟其非自無他咎若以為聖則有好輕清魔附之自謂成聖永不求進如無聞比丘者焉必失正定而從淪墜矣或於受陰定中復發明悟得虗明性寂無一法可得著此虗明遂成斷滅撥無因果若悟其非自無他咎若以為聖則有空魔附之謗持戒為小乘謂大乘悟空有何持犯遂至盡破律儀自誤誤人必失正定而從淪墜矣或於定中得虗明性深生味著生無限愛愛極引起貪欲種子遂發狂欲此由定境順適無慧自持若悟其非自無他咎若以為聖則有欲魔附之以欲為道教化行婬百千為羣自悞悞他必失正定而從淪墜矣此上十種境現皆是行人觀力與受陰交互故現斯事也。",
    "X15n0302_009:0333c09_0": "彼善男子修三摩提受陰盡者(至)成無上道。",
    "X15n0302_009:0333c10_0": "此明破想陰也前受陰未盡則身有執受故心不離身至於受陰盡則身無執受故心離身而去住自由自此便有上歷聖位得意生身之分意生身者言隨意而生速疾無礙者也今雖未得但受陰既破已有其因正如寐人寱語雖無所知而言已成音韻令傍聽者咸解其語此名想陰區宇若如明鏡去塵無復遮蔽行陰於此露現見一類生死始終洞然則想陰盡而煩惱濁之依想而立者從此可超矣觀想所由乃融通妄想之所成非有真實而不可破者也今行人於受陰盡後邪慮不生住此想陰圓定之中將破未破能發十種魔事或者心愛圓明乃銳其精思貪求善巧夫妙體既圓妙用自彰有心希求即成邪隙故魔得其便即飛精附人為其說法現通無非投合其求巧之好令其心志迷惑增婬破戒卒之犯王難而入阿鼻皆此求巧一念為之階也或者心愛遊行放蕩乃飛其精思而貪求經歷夫行住在定遊禮何妨若妄情放逸徒喪正念故魔得其便即飛精附人為其說法現通無非投合其求遊之好令其心志迷惑增婬破戒卒之犯王難而入阿鼻皆此求遊一念為之階也或者心愛密脗妙理乃澄其精思而貪求契合夫忘機寂照理自冥會擬心希求反成妄本故魔得其便即飛精附人為其說法現通無非投合其求契之好令其心志迷惑增脗破戒卒之犯王難而入阿鼻皆此求契一念為之階也或者心愛窮萬物之元因乃精爽其心而貪求辨晣夫萬物深本非佛莫測今強求俗理翻益漏心故魔得其便即飛精附人為其說法顯通無非投合其求元之好令其心志迷惑增婬破戒卒之犯王難而入阿鼻皆此求元一念為之階也或者心愛懸應乃精研不休而貪求冥感夫功深行著感應自冥起心希求反成邪隙故魔得其便即飛精附人為其說法現通無非投合其求感之好使其心志惑亂增婬破戒卒之犯王難而入阿鼻皆此求感一念為之階也或者心愛湛寂以澄養通力乃約束身心而貪求靜謐夫心亡則境寂念動則緣繁起心貪寂是謂異念故魔得其便即飛精附人為其說法顯通無非投合其求靜之意使其心志惑亂謂言證聖卒之陷王法而入阿鼻皆此求靜一念為之階也或者心愛知見幽隱乃勤苦研尋而貪求宿命等通夫通由靜慮任運現前若欲強求反成邪種故魔得其使即飛精附人為其說法顯通無非投合其求知之好使其心志迷亂謂言證聖卒之陷王難而入地獄皆此求知一念為之階也或者心愛神變乃研究變化之因而貪取神力夫神境通力離欲方得貪心強取翻成愛染故魔得其便即飛精附人為其說法現通無非投其求通之好使其心志迷惑謂言證聖卒之犯王難而入阿鼻皆此求通一念為之階也或者心愛深入寂滅乃研窮萬化之性而貪求深空夫即色明空是無上智滅色取空是為邪見故魔得其便即飛精附人為其說法現通無非投合其求空之好使其心志迷惑增婬破戒卒之犯王難而入阿鼻皆此求空一念為之階也或者心愛長壽乃辛苦研窮欲脫分段之短算希變易之長年夫見思若盡分段自亡惑全未斷強求成妄故魔得其便即飛精附人為其說法現通無非投合其長壽之好甚至於盛行婬欲自速其斃其墮入阿鼻必矣此皆求壽一念為之階也此之十種皆由觀力與想陰交互故現斯境也。",
    "X15n0302_009:0334b18_1": "○舊說自爾時天魔下屬天魔自口中好言下屬鬼神魔文理謬甚交光謂鬼神即是天魔所遣前飛精精字即屬鬼神乃天魔飛遣之此說甚便可從。",
    "X15n0302_009:0334b22_0": "楞嚴經略疏卷之九"
}