{
    "X15n0302_002:0296a13_0": "楞嚴經略疏卷之二",
    "X15n0302_002:0296a14_0": "福州鼓山湧泉禪寺沙門　元賢　述",
    "X15n0302_002:0296a15_0": "爾時阿難及諸大眾(至)得未曾有。",
    "X15n0302_002:0296a16_0": "前科顯見性之寂此科顯見性之常阿難承佛委示雖知見性無動尚恐此見隨身生滅故請佛為發明時波斯匿王因先見外道說死後斷滅及皈佛聞說死後不滅心尚懷疑未能證知不生滅性故亦從旁置問佛先審其身之變壞者將以反顯性之不變壞也王乃謂此身雖未甞滅而現觀此身念念遷謝新新不住如火燒薪終歸磨滅決知此身當從變滅佛猶欲其詳陳遷謝之相以曉大眾故復審其顏貌何如童子之時王則謂自童而壯自壯而老昔盛今衰何可相比佛猶以凡夫心暗每謂少壯可恃不覺變異乃以不應頓朽為問王則謂變化密移誠不覺知但由後思前深知不同若約麤相而觀且約十年每覺衰老若微細思惟則直是剎那剎那念念不停日趨於盡而已故知此身必從變滅也王於此身生滅無常已能備悉其相而此中便有不生滅性則未之知也故佛即以恒河之見證之試觀王三歲所見之恒河與今六十二歲所見之恒河決無有異則知身之老少有殊見之老少無殊身則受變者也見則不受變者也受變斯有滅不受變又安有滅哉所以身後捨生趨生卒夫甞滅又何疑焉。",
    "X15n0302_002:0296b12_0": "阿難即從座起(至)如來說為可憐愍者。",
    "X15n0302_002:0296b13_0": "阿難因前科說心不受滅遂疑既不受滅必無遺失緣何世尊責我等輩遺失真性顛倒行事世尊乃取手之倒正為喻謂正手變為倒手特是將頭換作尾世人便以為倒矣豈手實有失哉例知如來號正徧知汝等號性顛倒亦以人自生顛倒而性實非有失也下文正釋顛倒之處葢真心量包虗空用周沙界有情無情一切萬法莫非此心所現云何失此本心不認而反認心局於色身之內是認悟中之迷也悟謂妙心本自虗明迷謂妄結心相晦昧為空下正發明此意一真法界全空是覺無明突起便晦昧而化為頑空此虗空之始現也空晦暗中積迷既堅則結暗而成色此世界之始立也以妄想攬妄色以妄色雜妄想則結色而成根此妄身之始成也外之妄緣聚影於內則生滅而不已內之妄識分別乎外則奔逸而不息此昏昏擾擾之相妄以為心性也自一迷為心則必惑此心在色身之內不知色身外及山河虗空大地皆我妙明心中之物今反認心在身內正猶棄海認漚迷矣況認漚為海非迷中之倍人哉垂手之倒以首為尾亦猶是也按顯寂常之義皆借見性發揮今顯圓徧之義則不用見性直舉心性何也以見性尚倒局於身內也真心之義至此已吐露無餘下文阿難曲為後人屢生餘疑故復有六番辨論矣。",
    "X15n0302_002:0296c11_1": "○若此顛倒首尾相換舊說或執垂手為正竪手為倒或執竪手為正垂手為倒愚謂手之倒正實無定論阿難特就世俗之見定倒正而佛亦姑就世俗之倒正上取譬也舊說以世人不識手之倒正喻顛倒而不以倒手喻顛倒其失尤甚如下文如我垂手等無差別以垂為倒尤為明證豈必待錯認手之倒正而後喻顛倒哉若此顛倒數句舊解多未穩今謂佛竪手時已順世俗成正却云以此正手而顛倒下垂但是將上竪之首換為下垂之尾上竪之尾換為下垂之首而世俗視之與正手便差一倍一以為正一以為倒倒正雖殊手體寧有失哉手不失意不可少正答遺失之問也。",
    "X15n0302_002:0296c23_0": "阿難承佛悲救(至)是故如來名可憐愍。",
    "X15n0302_002:0296c24_0": "阿難承佛圓滿常住之說雖已能解但是以緣慮心分別法音現圓滿常住影子而已非情忘識絕冥契真體之悟也阿難既徒獲此心欲直認為本元心地則佛已深訶欲不認為本元心地則所謂圓滿常住者又安在耶所以求佛為拔疑根也阿難此問最為緊要世間稱學道者十箇五雙都落在此其能不認為本元心地者鮮矣佛告阿難下先破其所緣之法也謂以緣心聽圓滿常住之法則圓滿常住便為所緣之境法既是境豈為法性哉正如人以指標月急須看月若認指為月其失非細若以分別法音下破其能緣之心也謂此心離法音別無分別性正如客暫來往非如主之常住豈為真實哉不但分別我聲離我聲無分別性即分別我容離我色相亦無分別性縱使分別都無此中杳杳冥冥故非色中若有精故非空外道呼為冥諦以為離塵有體認為真性矣而不知此乃意根中之法緣也意根對法塵有生滅二種今分別不行正是滅塵是離諸法緣亦無分別自性由此觀之汝之所謂心性者真如客之有還不為主之不還安得為真乎還者謂如客從他方來便可還他方去若是主人常住在此故不可還也世間諸緣各有所因故各有所還如明從日輪便可還日暗從黑月便可還月等是也獨此見精自有照燭不從他得故不可還可還者自然非心既不可還非汝而誰哉所以指為本妙淨明之心也。",
    "X15n0302_002:0297a24_0": "阿難言我雖識此見性(至)汝性不真取我求實。",
    "X15n0302_002:0297b01_0": "阿難雖識見性無還而疑見必見物舍物無見是見乃攬外物影像終是雜妄何云是我之真性乎佛答先列五種見量雖佛至凡夫見有廣狹之殊均之為能見之性也次列阿難所見之境雖種種差殊均之為所見之物也若於此中擇其誰為能見之我體誰為所見之物象豈無辨哉但觀物象有差殊而見性無差殊則見超於物而非物之所能雜明矣若見是物下數句又以物可見見不可見以明見之非物也若謂見必雜物則見亦是物見若是物則見亦可見見若可見則汝亦可見吾之見矣而吾之見豈可見哉若以同見吾所見之物以為見吾之見乎則當吾不見物時又何以不見吾不見之處若謂能見吾不見之處必其妄生計度自然非彼不見之相若謂不見吾不見之地則我見終不可見我見終不可見則汝見亦不可見見不可見自然非物矣云何非汝之真性乎又汝今下數句又以物我不成立以明見之非物也汝今見物之時汝既見物物亦見汝汝見既離乎物物見必雜乎汝將以汝為物物為汝而體性紛雜矣汝之與我并諸世間安能成立其為物為我乎是知汝見必是汝而非物則汝之見性歷覽周遍正汝之真性云何疑其弗真而取我言以求實哉。",
    "X15n0302_002:0297b22_0": "阿難見性必我非餘(至)徧能含受十方國土。",
    "X15n0302_002:0297b23_0": "阿難因佛言見性周遍即我真性遂疑見性有礙非為真性故舉自己所見而問言我曾隨佛到四天王宮及居日月宮此見直周遍娑婆國及歸精舍但局一室之內若謂此見定體本自周遍如何昔之見大者今乃見小為是縮大為少抑是墻宇夾斷其義為何在乎佛答意謂非見之有大小乃前塵未忘之咎耳譬如方器中見方空圓器中見圓空非空之有定方定圓及不定方圓也乃因器而成方圓耳但除其器空自無方圓豈可更問此空方圓之義何在乎今以見合之見有大有小非見之有定大定小及不定大小也乃因塵而成大小耳但除前塵則見自無大小豈可更問此見大小之義何在乎若以為見體有大小則入室之時此見可縮而小觀日之時此見可挽而大乎墻宇之立此見可夾而斷穿為小竇此見可續而通乎是義豈其然哉大抵一切眾生秪為不達萬物皆己而又迷己為物失萬物一體之本心物既非心則非惟不隨心轉而反以轉心是故動為物礙而觀大觀小無自由分若能達萬物為一體則非惟不為物轉而日能轉物若能轉物則同如來身心圓明不動道場於一毛端遍能含受十方國土矣毛端指身中毛端正報之最小也十方國土依報之最大也毛端含國土即正攝依亦小攝大也十方在毛端即依入正亦大入小也毛中看國土而國土不小即小中現大也國外看毛端而毛端不大即大中現小也此乃諸佛照用圓融之極致耳。",
    "X15n0302_002:0297c23_1": "○按此章轉物之力全在妄塵妄塵之功非可輕擬葢由觀行深造而入心地豁然身界頓泯始是相似無礙直至色陰銷盡十方洞開無復幽暗身界內外如觀掌果方是真無礙然是體無礙非用無礙如今依正大小了無罣礙方是用無礙而諸佛之能事畢矣。",
    "X15n0302_002:0298a05_0": "若此見精必我明性(至)故能令汝出指非指。",
    "X15n0302_002:0298a06_0": "阿難因聞見性周遍之說遂疑既說周徧則不局於身內面前必皆有見又我既見物則面前無非我見故曰見性現在我前此疑似淺然有深意不可不知良以見性量括十方體含萬法其與萬法非即非離惟其非即故靈光獨耀迥脫根塵身界無干生死不繫眾生不達斯義則混淆真妄沈溺輪迴既無智以自分終何由而得脫乎唯其非離故塵剎混融萬物一體用彌法界存泯自由眾生未達斯義則沈冥滯寂灰斷纏空既自昧其家珍亦何由而得用乎此經自審問發心以來並是破妄顯真深明非即之意而非離之義未明所以阿難假示癡呆特發見性在前之問意在引起世尊會妄歸真之說以顯非離之義也佛答因渠言見在我前乃令其於目前見處一一自審果是見乎果非見乎若以為是見則指皆是物見何所指若以為非見則既以見物何得非見阿難是非無定而世尊兩皆印之其意果安在乎此義甚深非大智莫能窺故文殊特為啟請佛乃示以見與見緣并所想相如虗空華本無所有元是菩提妙淨明體秪是一體本無有二豈可妄分是非乃即文殊為喻以明不可是非之意言文殊秪一身豈更有一文殊而可分是非乎然又非無文殊乃可謂不可是非也例知秪一真心豈更有一物而可分是非乎然又非并無真心乃可謂不可是非也既唯一真而今見有色空及以見聞者何乃眾生妄見所執如第二月也此第二月乃病目所見全無實體唯是一月豈可於一月而論是非哉是以由汝妄想所見則不能出是非知是一真精妙覺明性則是非自泯無可指亦無非可指矣。",
    "X15n0302_002:0298b10_0": "阿難白佛言世尊誠如(至)無得疲怠妙菩提路。",
    "X15n0302_002:0298b11_0": "阿難已領前說猶慮聽者不審混於外道則毫釐之差千里之隔所以復起二問第一問言覺緣者覺即覺性緣乃覺性之緣因前說萬法全歸本性故茲不分覺性及緣而并以為徧十方界湛然常住不生不滅也彼方有外道名娑毗迦羅所立二十五諦第一諦謂之冥初指為萬法之本源常住之實體此但是見聞知覺一時暫滅中現幽閑之相乃法塵影事非實性也投灰等諸外道所指真我總有三種一曰廣大我二曰微細我三曰大小不定我今言徧十方者即廣大我也此等所謂我者並是象外取空別有自體且有大小之量往來之迹故皆妄說未為真我第二問言自然者以彼方外道多說自然謂內而心性外而萬物皆屬自然佛乃廣說因緣以破之謂如內而三乘根性須由宿生習種為因復假諸教助緣方克成果外而百穀等須有種子為因復假水土等助緣方克生芽等是也今聞佛說覺性非生非滅遠離一切虗妄顛倒則因緣之義迥不相及故復疑其近於自然也殊不知佛說因緣為破自然並是權說未為了義故佛破之曰彼執自然之說者必有自然之體今此見果以何為自體以明為自體當不見暗以暗為自體當不見明等是知自體且無定則自然之說非也執因緣之說者必有所因而後有今此見果何因而有若因明有應不見暗若因暗有應不見明等是知此見非有所因則因緣之說非也佛于此因緣自然若互破又若互立者非欲雙立非欲雙破亦非欲破立不定也極而言之至於非因緣自然非不因緣自然無非不非無是不是葢一涉情見俱是虗假惟能離一切妄計之相則法法無不全真耳阿難未達佛意復引他昔日之說以為難昔佛謂見必因空因明因心因眼四緣成就方得成見此乃小乘權說今經了義故不仝彼直謂見精不假外緣如世人因日月燈方得名見不知無日月燈時所見暗相亦即是見明暗二塵自相凌奪而見未甞暫無是知見明而見非是明見暗而見非是暗見通而見非是通見塞而見非是塞四義既成見精之決定離緣明矣夫見精尚且離緣而況真見能見見精則迥離見精非見精之所可及豈可以因緣自然和合不和合等戲論之法而妄計之哉。",
    "X15n0302_002:0298c24_1": "○真見者緣真如境理智一如能所不分故曰真見精者緣外實境業識所變能所歷然故曰妄真見顯時決無妄見對立為其所見但如人覺時了知前此是夢知是夢者豈更是夢哉故曰見見之時見非是見見猶離見見不能及也按此經前以真見難顯故借見精以顯真見乃是帶妄顯真至此恐人終認見精未契厥旨故復云見見非見乃是剖妄出真佛之密意罄無不盡矣　或問此章凡有二問今佛所答皆是後問前問無一言及之何也答曰此有二意一外道所立冥初真我皆執為自然故佛今破自然已是并冥初真我而破之又此答超情離見一切戲論俱在所破又安有冥初真我之說哉。",
    "X15n0302_002:0299a13_0": "阿難白佛言世尊如佛(至)本覺常住。",
    "X15n0302_002:0299a14_0": "前來佛一向將見性顯真性阿難不達認見為真及聞見見非見之說所以重增迷悶世尊乃指出其病謂見性雖近乎真猶帶二種妄既有妄見即當見處發生惑業既有惑業即當業處招果輪轉是見性為輪迴生死之根也所謂二種妄見者一曰別業妄見謂己業所招乃是一人自見親近之境其境之美惡實己所受用與眾無關如眚目見燈光別有五色圓影他人所無也一曰同分妄見謂其業所感乃是同眾見疎遠之境其境之美惡非一己受用與眾共之如一國人共感惡緣乃見種種灾象他國所無也今以二事進退而合明之如彼眾生別業妄見病目矚燈光現有圓影雖似有前境然終是目眚所成非外色所造唯能見此眚者始無眚之咎今以例一人目見山河國土及諸眾生亦皆妄見所成者也此國土眾生元是我覺明為無明所翳故自見其無明之影此影全是眚唯能覺此眚者則為本覺而非眚以暫覺其眚則早出於眚外豈可復名為見聞覺知乎以彼乃見之真性故不復名見也如彼眾生同分妄見瘴惡所起現有災象雖近於實然亦與燈影不異以彼由目眚所生此由瘴惡所起俱非實有總一見妄之所成耳今以例大千世界國土眾生此國土眾生雖似外境然實同是我覺明無漏妙心突生見聞覺知由是起惑造業發此虗妄病緣若依若正和合而生和合盡而滅豈有真實哉若能妄見不生遠離此虗妄病緣無和合亦無不和合則非獨業果不續而生死根元亦復除滅由是可以圓滿菩提而復昔之清淨本覺也此二事言進退合明者自如彼眾生別業妄見至見病所成是進燈影以合依正自見所見緣至故不名見是退依正以合燈影自如彼眾生同分妄見至及諸眾生是進災象以合世界自同是覺明至本覺常住是退世界以合災象反覆推窮唯是見妄所成此之見妄即是根本無明不易破除故佛於別業中急稱離眚之覺於同分中深明遠離之功良以真覺顯而後妄見可離妄見離而後真覺可復若徒守見性不知離妄又安能斷輪迴而證常住哉。",
    "X15n0302_002:0299c01_0": "○如彼眾生同分妄見下古解指為進退合明者非是近如摸象及正脉皆不以為然但此節文有往復之迹因致成誤然此節正舉災象而必逆例別業者何以災象似實故必例同燈影以明其妄然後可以為能例也　問此章說見病最為微細見有世界眾生便名為妄然則必不見世界眾生方名真見乎曰世界眾生本無好醜好醜起於自心諸佛見萬法一一皆虗眾生見萬法一一皆實眾生見萬法唯是塵相諸佛見萬法唯是自心此真妄之分也。",
    "X15n0302_002:0299c10_0": "阿難汝雖先悟本覺(至)羣塞亦復如是。",
    "X15n0302_002:0299c11_0": "此因阿難前云諸和合及不和合心猶未開故今特為破之謂汝疑菩提心為和合起者今汝此淨妙見精於彼明暗通塞四塵與誰和乎若和明者當見明時何處雜見見相可辨雜明又成何形像況凡物之相知者必先離而後合今謂明非見乎則何以見明既能見明非相離也若謂明即見乎則見明即是見見云何見見非相即也既非相離又非相即何由而成相和哉又既明不非見則全體皆見見必圓滿更於何處和明既明不即見則全體皆明明必圓滿不合容彼見和況見異於明而雜和於明則明受見和當失其名今猶名之曰和明豈命名之義乎是知見精必非和明而暗通塞從可和矣又汝淨妙見精於彼明暗通塞四塵與誰合乎若與明合應唯見明至於暗應不能見云何而復見暗若謂見暗而不與暗合則是見者不合合者不見應不見明云何合明而復見明是知見精必非合明而暗通塞從可知矣阿難見和合之說已破復轉遁於非和合佛復謂汝疑覺非和合者今汝淨妙見精於彼明暗通塞四塵誰非和乎若非明和則見與明已不相入必各有邊畔汝觀此明與見從何為畔且明中無見自不知明相所在何從而分畔乎是知見精必非不和明而暗通塞從可知矣又汝淨妙見精於彼明暗通塞四塵誰非合乎若非明合則明之與見性必相乖如耳遇明既如耳遇明且不知明相所在云何而辨其合與非合乎是知見精必非不合明而暗通塞從可知矣合而觀之說和合却似不和合說不和合却似和合兩楹而不可定者何也良以真精妙覺元非和合亦非不和合誠非思議之所能及若以世間戲論之法而量度之正如手撮虗空秪益自勞虗空云何隨汝執捉哉。",
    "X15n0302_002:0300a17_0": "阿難汝猶未明一切浮塵(至)本非因緣非自然性。",
    "X15n0302_002:0300a18_0": "前文已云見與見緣并所想相如虗空華本無所有此見及緣元是菩提妙淨明體是已會萬妄而歸一真矣阿難至此猶有和合不和合之疑是猶未明此旨葢有兩物方可名和合不和合今既惟一真豈更有和合不和合之可疑哉故佛已破和合而復曰汝猶未明一切浮塵等直至會通四科遍融七大無非廣明會妄歸真之說也一切浮塵諸幻化相統指諸法而言起滅全幻則生即是滅不待移時故曰當處出生隨處滅盡既生滅同時則但是幻妄之稱幻妄之相而已此幻妄稱相猶如空華不實却全華是空亦如鏡影非真却全影是鏡故曰其性真為妙覺明體又曰生滅去來本如來藏常住妙明不動周圓妙真如性性真常中求於去來迷悟生死了不可得是所謂即幻妄而通實相也五陰以葢覆真性為義色為五陰之首凡內而根身外而六塵均名為色最為質礙眾生莫不以為實而非虗矣然此色從緣而生緣散而滅自生趨滅無一刻住則一刻生即是一刻滅所謂當處出生隨處滅盡也故佛於色謂如目見空華此華非從空來非從目出非虗妄而何色尚如是受想行識益可知矣受者以心領納外境苦樂及不苦不樂為義佛於受謂如人以二掌相摩妄生澀滑冷熱之相此相不從空來不從掌出非虗妄而何想者以心緣外相計度憶持為義佛於想謂如人聞說酢梅而口水生亦如思蹋懸崖而足心酸澀此酢說非從梅生不從口入何以耳聞酢而口水生此酸澀非從崖生非從足入何以心思蹋而足酸澀此但從想妄現也非虗妄而何行以念念遷流為義佛於行謂如瀑流水波浪相續而此流性不因空生不因水有亦非水性非離空水喻行本無流行而似有流行亦一虗妄而已識以取境分別為義亦即捨身受身趨生之主也佛於識謂如以瓶擎空遠餉他國而此空非彼方來非此方入喻識神本無輪轉而似有輪轉亦一虗妄而已總之五皆虗妄即本非因緣非自然而為如來藏妙真如性也葢使其體不虗則不能融歸實性唯其虗所以全是實性如波無自體所以全波是水也下六入十二處十八界意皆仝此。",
    "X15n0302_002:0300c06_0": "楞嚴經略疏卷之二"
}