{
    "X17n0331_001:0801a03_0": "楞伽楞嚴合轍序",
    "X17n0331_001:0801a05_0-0": "楞伽以達磨重楞嚴以智者重並為緇門要典而其流通淺深之故亦略相類當楞伽之機者大慧也自覺聖智境界惟證乃知而譯者艱晦其詞使讀者棘口瞠目徐思之又如蚊咬鐵牛了無入處故中下之士不甚躍然當楞嚴之機者慶喜也其落想送難與凡夫頗近又得文士為之潤色讀者如癢得搔各以思惟分別通之至旁引經論之似者為註脚雖復近之彌益戲論自來講席于此二經不過守其師說期無大謬而止至雪浪大師出始盡掃依門傍戶之病一以自心現量出之覺靈山一會重開生面然師舌而不筆聊為人天留一影而已自是而諸師撰述各露鋒頴數年來可謂人握靈蛇至交光之正脉幾于前無古人矣然于楞伽猶未遑也二經並有發明惟憨山老人及今一雨法師耳師少參雪浪夙佩傳心之印浪不拘細節一時門人皆鮮衣跅[跳-兆+也]師獨蕭然一衲三十年無改以大辯才具杜都行浪既化去諸衲子競以瓣香歸師師謙讓未遑而輝山媚川之譽愈不可掩近者結茅于鐵山之麓巢棲茹薇靜照益徹因詮釋二經成若干卷",
    "X17n0331_001:0801a05_0-1": "命曰合轍殺青既竟以示不佞命序之余惟無上大覺豈有轍之可合哉顧守轍非也不能合轍而遽欲舍轍尤非也夫性相二宗非所以適涅槃城之兩輪耶至于破相一宗如王良造父然非能廢兩輪而別挾一長也或者欲以此而遺彼亦過矣就二經言之五法三自性八識二無我三科七大不粲然相乎乃若百八句之問山河大地之問拈是見非見而皆曰是舉因緣自然而皆曰非使以宗門家風會之雖通身是口能下一語否然則謂如來禪之外有祖師禪猶第二義也師生平持論在于矯二宗之偏鋒驅顢頇之狂慧觀其所述葢詳哉其言之至于言之所不能詮引而不發躍如也師葢曰吾聊以轍示焉世有絕塵而奔者吾將旦暮遇之耳然則此書之行固浪師之後燄亦靈山之耳孫也余家珠塢中去鐵山僅一袈裟地三年來侍師于水邊林下每相與了無可共語之語是編成余竊快焉因題數語于簡末不自知其為門外人也。",
    "X17n0331_001:0801b16_0-0": "天啟辛酉重九日吳下菩薩闡提王志堅合十書楞伽合轍自序易曰盈天地之間者唯萬物然則萬物之在天地者雖多而名相一言可以盡蔽今夫世之人以高明者為天厚載者為地巍然突起者為山汪洋平演者為江海川瀆飛者為鳥躍者為魚走者為獸林林總總蔚蔚葱葱者為艸木夫高明者是相而天即名也博厚者是相而地即名也巍然突起者是相而山即名也汪洋滉瀁者是相而江海川瀆即名也飛躍是相而魚鳥即名也奔馳是相而獸即名也林林總總者是相而艸木即名也故知天地之大萬物之多統而論之皆屬名相更無別法是以天不自知為高明地不自知為廣厚山不自知為突起水不自知為汪洋魚鳥不自知為飛躍獸不自知為奔馳草木不自知為蓊欝然而必以高明者為天博厚者為地突起者為山汪洋者為江海川瀆飛者為鳥躍者為魚馳者為獸總總林林者為艸木一定而不可移易者何居皆是與天地並立而為萬物之最靈者名之曰人是人與天地萬物安種種名立種種相謂之妄想建立又謂之意言境其實天地萬物未始有種種相亦未始有種種名也名相既立於是乎卑高陳焉貴賤位焉有無傾焉妍醜出焉彼此立焉是非興焉於是乎執此名非彼名此相非彼相而彼彼此此是是非非森然柴立於心目之間矣其中有具正法眼者以法眼觀了知天地萬物種種名相原從我人妄想建立本非實有本自如如故雖孑然雜處於天地萬物之中而天地萬物種種名相不能眩惑其耳目而能會天地萬物皆歸於自己不以彼為彼不以此為此不以是為是不以非為非故天地如萬物如而人我亦如於是乎指芥子為須彌亦可殤子為壽亦可呼馬為牛亦可指天作地亦可以能真見天地同根萬物一體不見有絲毫異名異相為障為礙故能得意生身隨心自在旁礴於萬物之內而物莫能拘者由此道也是知名相皆生乎妄想而能了名相本非實有者名正智如如此名相所以為凡聖之通衢也此經所詮除五法外雖別開三自性八識二無我然皆不出五法所謂五法者謂名相妄想正智如如也言八識者謂眼識耳識鼻識舌識身識意識末那識含藏識也言三性者謂妄想自性緣起自性成自性也二無我者謂人無我法無我也葢八識是名相是妄想轉八識成智即是正智是如如此即八識亦五法也緣起自性即名相妄想自性即妄想成自性即正智如如即三自性亦五法也於名相上執我執法執即妄想我法即名相若以正智了此我法本空即證二空無我之真如是則我與無我亦五法也故舉五法而天地萬物乃至世間出世間出世間上上法統攝無遺矣故經云三種自性及八種識二種無我悉入五法又云此五法者聲聞緣覺菩薩及如來自覺聖智諸地相續次第一切佛法悉入其中是知盈天地之間者唯萬物而天地萬物不出名相異生之所迷者迷此諸聖之所悟者悟此何以故以執名相為實有而分彼此起是非由彼此是非皆屬妄想以從妄想故說為迷為異生若了名相本空妄想非有則為正智為如如以從如如正智故說為悟為諸聖此則不唯名無定名相無定相即凡聖亦無定位亦屬名相建立故一舉名相而五法立五法立而一心顯一心顯而一切佛法皆入其中矣初祖達磨云楞伽四卷",
    "X17n0331_001:0801b16_0-1": "可以印心是則此經為佛佛授手祖祖相傳之心印如來禪祖師禪之所自出故以佛語心為宗也第此經四教並攝性相通收然性相二宗雖堂皇無異而戶牖各開從上諸師解此經者或依性以解相而宗相者則執相以難性或依相以解性而宗性者則執性以破相故主馬鳴者賓護法宗護法者詆馬鳴所謂操戈入室禍越蕭墻此皆不達唯心唯識之宗一而二二而一者也故凡值經之性相分途處雙引性相併釋之皎如星月各有指歸務令性相二宗如車兩輪並行不悖此余之深意也故命名合轍若由此轍而登路由此路而登不可往之楞伽山頂則一躂可到尚何艱險之有哉時。",
    "X17n0331_001:0802b19_0-0": "天啟辛酉歲夏五端陽後三日書于天界講堂二楞庵釋通潤謹識楞伽阿跋多羅寶經合轍卷第一明　二楞庵釋　通潤　述凡經題目立名不一有以人彰名有以法彰名有以人法彰名有以法喻彰名以人彰名者如淨名月上女等法彰名者如圓覺涅槃等人法彰名者如勝天王般若等法喻彰名者如金剛般若等此經則以處彰名也楞伽城名此翻不可往在南海摩羅那山頂阿跋多羅此云無上以此山此城皆是無上眾寶所成故魏譯云住大海畔摩羅那山頂上楞伽城中彼山種種寶性所成諸寶間錯光明赫奕如百千日照耀金山內外明徹日月光輝不能復現皆是古昔諸仙聖賢思如實法得道之處世尊於海龍王宮說法從大海出舉目觀見摩羅那山楞伽大城即便微笑而作是言昔諸如來皆於此城說自所得聖智證法非諸外道邪見乃至二乘所修境界我今亦為摩婆那王開示此法時摩婆那夜叉王以佛神力聞佛音聲見海波浪觀其眾會藏識大海境界風動轉識浪起發歡喜心請佛說法然則此經是摩婆羅夜叉王為發起故即其所居之處彰名也有者云楞伽寶名文殊般泥洹經云文殊身如紫金山其冠毗楞伽寶之所嚴飾有五百種色一一色中日月星辰諸天龍宮世間眾生所希見事皆於中現又首楞嚴三昧經釋提桓因云我於須彌山善法堂上著釋迦毗楞伽摩尼瓔珞以是光明一切天眾身皆不現釋迦毗楞伽此云能勝宗鏡亦云此城是眾寶所成以表寶積三昧則楞伽亦是寶名但未必是八楞耳若準二譯皆名入楞伽經則古翻不可往其義尤切以無門可入故無路可通故夜叉所據故諸佛所住故菩薩所遊故先德云十方無壁落四面亦無門又云但有路可上更高人也行世間種種事業凡涉思門語路皆可擬議若大性自性第一義者不可以有心求不可以無心得不可以言語造不可以寂默通纔涉思惟便成剩法纔涉唇吻便落窠臼必須離心意識參絕聖凡路學始有少分相應故達磨大師云楞伽以佛語心為宗無門為法門而龐居士亦云楞伽寶山高四面無行路惟有達道人乘空自來去所謂無門可入無路可通也故華嚴論云世尊於南海山摩羅那山之頂楞伽城中說法其山高五百由旬下瞰大海無路可上其城乃眾寶所成光映日月無門可入得神通者堪能升往又此城久為夜叉所據而一旦請佛轉法輪者正顯眾生自性楞伽城中日用時時有夜叉出現亦時時有佛轉輪時時菩薩遊履但為妄想所纏無明所噬靜沉死水動落今時故將諸佛覺場翻成夜叉宮殿若使一念回光則夜叉宮殿全是諸佛道場菩薩實地毫無間隔所以云昨夜夜叉心今朝菩薩面菩薩與夜叉不隔一條線所謂凡聖同居龍蛇混雜故知夜义所據諸佛所住菩薩所遊皆在一處也問此山高聳險絕即二乘神通尚不能到何故夜叉得據此山答此表圓頓法門唯圓頓根方能得入若使根性猛利雖極惡如夜叉不動無明頓入法界全身坐在寶山故廣額屠兒放下屠刀曰我是千佛一數若根性遲鈍悠悠緩緩即使移山動石坐臥虗空秪是止宿草菴處於門外故知欲通此路入此門住此山者秪論根性利鈍信力淺深不簡善惡也。",
    "X17n0331_001:0803b14_0": "宋天竺三藏求那跋陀羅譯。",
    "X17n0331_001:0803b15_0": "宋國名國主姓劉名義隆武帝第三子後受禪即文帝也求那跋陀羅此云功德賢賢從印土航海而來帝以賢教理精通華梵俱洽詔居揚都瓦官寺翻譯眾典首出斯經文成四卷按此經大部有十萬偈百萬句三千六萬言一百五十品今所傳者唯一品耳。",
    "X17n0331_001:0803b21_0": "一切佛語心品之一",
    "X17n0331_001:0803b22_0-0": "一切佛者總言三世十方諸佛也今依五教略明一心初小乘教實有外境假立一心由心造業所感異故二大乘始教以異熟賴耶為一心遮無外境故下經云此二壞不壞相展轉因無始虗偽因三有等三終教以如來藏具諸功德為一心下經云如來藏為善不善因譬如伎兒變現諸趣等四頓教以泯絕無寄為一心下文云三乘與一乘非乘我所說等五圓教總該萬有事事無礙為一心下經云十地則為初初則為第八第九則為七七亦復為八第二為第三無所有何次是則此經四教並談三根普被即知此心不獨此經之宗即一大藏經悉入此宗不特一佛所修所證所說所授者唯此一宗即佛佛相授祖祖相傳者亦唯此宗故此經以第一義心為宗妄想無自性為趣下經云此是過去未來現在諸如來應供等正覺性自性第一義心又云前聖所知轉相傳授妄想無性二語雖別其旨則同以由第一義心故妄想無性以妄想無性即是第一義心也問下經云一切法不生不應立是宗何故以一心為宗答古佛皆垂方便門禪宗亦開一線道切不可執方便而迷大旨亦不可廢方便而絕後陳然機前無實設有一解一語皆是落後之事屬第二頭大智度論云以佛眼觀一切十方國土中一切物尚不見無何況有法畢竟空法能破顛倒令菩薩成佛是事尚不可得何況凡夫顛倒有法今約迷悟二途故總立一心為宗華嚴經云譬如工畫師不能知自心而由心故畫諸法性如是心如工畫師能畫諸世間五蘊悉從生無法而不造如心佛亦爾如佛眾生然應知佛與心體性皆無盡故知萬法同會斯宗猶如百華共成一蜜若諦了之一切在我昇沉去住任意隨緣示聖現凡出生入死語默卷",
    "X17n0331_001:0803b22_0-1": "舒常順一真之道治生產業不違實相之門步步常在其中念念不離法界若不信之人對面千里所以云千山勢到嶽邊止萬事消歸體處平故立一心為宗也。",
    "X17n0331_001:0804a09_0": "如是我聞一時佛住南海濵楞伽山頂種種寶華以為莊嚴與大比丘僧及大菩薩眾俱從種種異佛剎來是諸菩薩摩訶薩無量三昧自在之力神通遊戲大慧菩薩摩訶薩而為上首一切諸佛手灌其頂自心現境界善解其義種種眾生種種心色無量度門隨類普現於五法自性識二種無我究竟通達。",
    "X17n0331_001:0804a15_0-0": "佛住楞伽山頂者表第一義心是最勝極尊無上無比法攀攬不及唯如來方得住持也種種寶華為莊嚴者謂此第一義心具足無量功德智慧為莊嚴也聖眾皆從異佛剎來者謂此處久為夜叉所據故諸佛不住聖眾不來今由夜叉歸心請佛說法故聖眾皆從異佛剎來咸集其處也是諸下出菩薩之德謂菩薩具足無量三昧自在力能以神通遊戲淨佛國土故能往也反顯凡外小乘皆不可往標大慧為上首者彰其名也一切諸佛等者顯其實也言灌頂者位居十地已受如來智職故自心現境界是諸佛授受之心法謂一心如鏡萬法如影心之現境猶鏡之現影故先德云若能了境便識心萬法都如闥婆影下經亦云譬如明鏡現諸色像現識現處亦復如是然則自心現境界非大智慧人不能擔荷此法亦不能搆副此語以外道雖有聰明而無智慧故不解二乘雖有智慧而局守一隅其慧甚小故不解所以大慧為法會之首稱其善解唯善解故能隨心現心隨色現色千應萬變而不窮大經云或現童男童女身天人及與阿修羅乃至摩睺羅伽等隨其所樂皆令現眾生形相各不同行業音聲亦無量如是一切皆能現海印三昧威神力此大乘菩薩所以稱人龍也五法者謂名相妄想正智如如三自性者謂妄想自性緣起自性成自性八識者謂眼識耳識鼻識舌識身識意識末那識藏識也二無我者即人無我法無我也究竟通達者皆能造其極也自心現境界是三界唯心之旨正顯其達性於五法等究竟通達是萬法唯識之宗又顯其達相若達性而不達相則儱侗真如達相而不達性則顢頇佛性必性相俱徹事理雙融方見大慧之實有實如此名曰大慧不亦宜乎。",
    "X17n0331_001:0804b22_0": "爾時大慧菩薩與摩帝菩薩俱遊一切諸佛剎土承佛神力從坐而起偏袒右肩右膝著地合掌恭敬以偈讚曰。",
    "X17n0331_001:0804c01_0": "摩帝此云慧與大慧俱遊者同聲相應也袒肩膝地身業合掌恭敬意業偈讚口業此皆天竺覲佛之儀式也。",
    "X17n0331_001:0804c04_0": "世間離生滅猶如虗空華智不得有無而興大悲心一切法如幻遠離於心識智不得有無而興大悲心遠離於斷常世間恒如夢智不得有無而興大悲心知人法無我煩惱及爾炎常清淨無相而興大悲心一切無涅槃無有涅槃佛亦無佛涅槃遠離覺所覺若有若無有是二悉俱離牟尼寂靜觀是則遠離生是名為不取今世後世淨。",
    "X17n0331_001:0804c11_0-0": "唯聖知聖唯賢知賢大慧洞見如來心髓故呈偈讚佛標顯非有非無之宗不唯揭示全經大旨抑且微露自己家風初一偈頌如來以正智達世間法本無生滅也大經云三世五蘊法說名為世間以陰界入處皆入三世遷流故總名世間雖在世間而實無生滅故曰世間離生滅由別教菩薩雖知蘊入界處皆依生滅識變不知即是不生滅性如來以正智觀察本非有無尚無有生欲何為滅故以空華喻之圓覺云如眾空華滅於空時不可說言有定滅處何以故無生處故應立量云世間是有法非有非無宗因云離生滅故同喻如空華空華離生滅空華非有無則知世間離生滅世間非有無以離生故非有離滅故非無故以空華為喻成立離生離滅非有非無之宗為一經之旨也由菩薩不達生滅即是不生滅故興大悲以示之第二偈頌如來以正智達依他無性也舉一切法則雙該相見以萬法雖多不出相見故由愚法聲聞未亡法執不達萬法皆空緣生無性而妄計為實不知依他起性本非實有亦非實無皆由心識不淨故認為實有計為實無如來以正智觀察知一切法遠離心識猶如幻化故曰一切法如幻遠離於心識以幻人心識本來自無由幻師呪力幻作男女悉無自性既知為幻豈可計之為有認之為無故經云譬如幻化人非無幻化人幻化人非真人也由二乘不達諸法如幻妄認為實故興大悲以示之應立量云一切法是有法非有非無宗因云遠離心識故同喻如幻以計有計無皆是心識故第三偈頌如來以正智達遍計無性也三界諸法悉由眾生循業發現故果生因滅果滅因生本非斷常不知執斷執常皆是凡夫外道虗妄遍計如來以正智觀察等之如夢以夢時非無不可謂斷醒時非有不可謂常既離斷常則非有非無由凡外迷於夢境妄計斷常故以此法醒之而興起大悲也應立量云世間是有法非有非無宗因云遠離斷常故同喻如夢知人下一偈頌如來以正智斷我法二執也人以主宰言法以軌持言煩惱障事爾燄障理唯識論云由我法執二障具生若證二空彼障隨斷故正智現前知人無我則煩惱清淨知法無我則爾炎無相如是則孰為我孰為法孰為煩惱爾炎了無一法當情則知一切凡夫外道及二乘三賢位中菩薩所計我法二執煩惱所知二障皆是處妄豈實有哉由彼不解故興大悲以示之第五一偈半頌如來以正智空能覺所覺也謂此正智現前不但空業識空相見空遍計而已即如來所證涅槃悉皆蕩盡以生死涅槃是對待法若空生死而不空涅槃即此涅槃便是生死所以融大師云若有一法勝過涅槃我說亦如夢幻故曰一切無涅槃無有佛涅槃者以因法顯人故離法無人亦無涅槃佛者以因人顯法故離人無法是則外不見有能證涅槃之佛內不見有佛所證之涅槃智論云三世諸佛皆以實相為師故知若有能證即為有人若有所證即為有法以唯一真法界心外無法不可以法界更證法界故曰遠離覺所覺是則不但執有生死無生死是虗妄即執有涅槃無涅槃亦屬虗妄大經云有諍說生死無諍說涅槃生死與涅槃二俱不可得故曰若有若無有是二悉皆離此顯忘能所處即如如佛也末後一頌結歸佛身言佛之所以為佛不過以自覺聖智觀察一切世間出世間出世間上上法悉如幻夢空華但有生處即除名遠離生著處即遣名為不取故世世常得清淨若能作如是觀即與如來把手共行等無差別故淨名云觀身實相觀佛亦然。",
    "X17n0331_001:0805c02_0": "爾時大慧菩薩偈讚佛已自說姓名我名為大慧通達於大乘今以百八義仰諮尊中上世間解之士聞彼所說偈觀察一切眾告諸佛子言汝等諸佛子今皆恣所問我當為汝說自覺之境界。",
    "X17n0331_001:0805c06_0": "先讚佛次通名次請問禮也我當為汝說自覺之境界者言汝既以己之所證問我我亦當以己之所證告汝也雖然世尊三昧迦葉不知迦葉三昧阿難不知既是自覺境界何處下口須是自己覿面親見始得。",
    "X17n0331_001:0805c11_0": "爾時大慧菩薩摩訶薩承佛所說頂禮佛足合掌恭敬以偈問曰云何淨其念云何念增長云何見癡惑云何惑增長。",
    "X17n0331_001:0805c14_0": "一百八問大慧雖是徧張十界之網實欲高建一心之宗其中關捩全在云何何故及誰字上挑剔令人惕然有深省處略與莊生所云吹萬不同而使其自己也咸其自取怒者其誰耶之誰字相似又與天其運乎地其處乎日月其爭於所乎孰主張是孰綱維是孰居無事推而行是之孰字相似但彼主混茫一氣此主寂滅一心故二教逈別意謂如來所證寂滅一心本來平等云何現前乃有三界九地四聖六凡種種不同五法三自性八識二無我各各差別此等諸法皆是誰之所使何故而有云何而生如此發問正欲令人悟得傀儡棚中有箇抽牽線索者在更無第二人也最初一偈是總問六凡四聖意謂寂滅一心本無淨染而忽生淨染復令淨染二念漸漸增長此由何物之所使耶此下百八句即同華嚴文殊問覺首言心性是一云何見有種種差別之意。",
    "X17n0331_001:0806a06_0": "何故剎土化相及諸外道云何無受次何故名無受何故名佛子解脫至何所誰縛誰解脫何等禪境界云何有三乘唯願為解說。",
    "X17n0331_001:0806a09_0": "次問寂滅一心本無異相云何而有種種諸相四八端嚴如來相也塗灰熏鼻外道相也且外道以不受為宗佛子以解脫為果外道之縛是誰縛佛子之脫是誰脫外道所修為妄想禪三乘所修為寂滅定此皆由誰之力而有差別也。",
    "X17n0331_001:0806a14_0": "緣起何所生云何作所作云何俱異說云何為增長(唐云云何諸有起謂起三有也)云何無色定及以滅正受云何為想滅何因從定覺云何所作生(魏云云何因生果)進去及持身云何現分別云何生諸地破三有者誰何處身云何往生何所至云何最勝子何因得神通及自在三昧云何三昧心最勝為我說。",
    "X17n0331_001:0806a20_0": "此問緣起生處及緣起差別相也昔有僧問玄挺禪師云如何是真性中緣起師曰大德正興一念是此則直指緣起生處也緣起既從寂滅心生云何復有種種差別如外道有計能作所作有無一異俱不俱等者如欲界六天漸修漸進至色界而得四禪者又從色界漸增至無色界而得四空定者有修滅盡定而超出三界者有修無想定生無想天前半劫滅後半劫生者既以無想為因又感無想異熟為果不知中間四百九十九劫中是誰遷流是誰執持是誰見諸物也又三界分為九地始從五趣雜居以至非非想處此即三界內之緣起也又有破三有而出三界者不知此三有由誰而破既破三有不知此身復生何處又有大乘菩薩名最勝子從三昧心現大神通遊戲自在者此即三界外之緣起既緣起皆從清淨心中流出云何而有種種差別此又何故而使之耶當時大慧幸是問著黃面老子若遇德山臨濟不知翻轉面皮多少時也。",
    "X17n0331_001:0806b14_0": "云何名為藏云何意及識云何生與滅云何見已還云何為種性非種及心量云何建立相及與非我義云何無眾生云何世俗說云何為斷見及常見不生云何佛外道其相不相違云何當來世種種諸異部。",
    "X17n0331_001:0806b18_0": "此問妄想差別相也含藏曰藏思量曰意了別名識無而忽有曰生有而忽無曰滅意謂寂滅一心本無有八亦無生滅云何轉而為八識化而為生滅既從生滅識而起諸見云何轉諸見而反無生性一而已云何分而為五而心量各異相一而已云何建而為四而相相各別既立四相云何復說無我無眾生既無我無眾生云何說有俗諦若有俗諦是則墮於常見若無我人未免落乎斷滅若曰心無二心相無二相則佛與外道心相恒同何故當來各分部類如佛弟子有十八部外道有九十六種是也。",
    "X17n0331_001:0806c05_0": "云何空何因云何剎那壞云何胎藏生云何世不動何因如幻夢及犍闥婆城世間熱時燄及與水月光何因說覺支及與菩提分云何國土亂云何作有見云何不生滅世如虗空華云何覺世間。",
    "X17n0331_001:0806c09_0": "此問名相差別也世界有成住壞空根身有生住異滅今舉空壞而收成住舉生而攝住異滅既曰器界有剎那壞云何又說四禪已上三災不及世界不動既曰不動則是真常云何如來又說如幻夢乾城陽燄水光既曰根身是胎藏生云何如來復說從七覺支生從三十七品菩提分法生既曰國土是一云何所見雜亂不同或見穢土有變者或見淨土不毀者或見如虗空華者或見正覺世間者此皆何因所致也。",
    "X17n0331_001:0806c18_0": "云何說離字離妄想者誰云何虗空譬如實有幾種幾波羅蜜心何因度諸地誰至無所受(魏云真如無次第)何等二無我云何爾燄淨諸智有幾種幾戒眾生性。",
    "X17n0331_001:0806c21_0": "此問如如正智之差別也既曰名相妄想各各不同云何復說離言說相離心緣相猶如虗空畢竟平等不知離名字妄想者畢竟是誰既離名相妄想證正智如如所證真如復有幾種到彼岸心復有幾種復有何因超十地而證法界此超證者畢竟是何等機若名相不空執我執法用幾種智微細觀察方得二種無我眾生根性復有幾種用幾種戒相而調伏之。",
    "X17n0331_001:0807a05_0": "誰生諸寶性摩尼真珠等誰生諸語言眾生種種性明處及伎術誰之所顯示伽陀有幾種長頌及短句成為有幾種云何名為論(唐云道理有幾種解釋有幾種)。",
    "X17n0331_001:0807a08_0": "此問有情無情種種語言經論從何建立也如世界初成種種金寶及眾生初起種種性乃至十類眾生種種語言皆從何出也明處伎術即五明也大論云五明者一聲明謂釋詁訓字詮目流別二工巧明謂伎術機關陰陽曆數三醫方明謂禁呪閑邪藥石針艾四因明謂考定正邪研覈真偽五內明謂究暢五乘因果玅理前三外藝後二內教伽陀云諷誦即孤起頌成者謂圓成實性論者所以釋此性者也大慧豈不知寶性從堅覺而生語言由七處而發內外經論從語言而起意有在也先德云鵓鳩樹上啼意在麻裏畬唯忘言象者得之。",
    "X17n0331_001:0807a20_0": "云何生飲食及生諸愛欲云何名為王轉輪及小王云何守護國諸天有幾種云何名為地星宿及日月解脫修行者是各有幾種弟子有幾種云何阿闍黎佛復有幾種復有幾種生魔及諸異學彼各有幾種自性及與心彼復各幾種云何施設量唯願最勝說。",
    "X17n0331_001:0807b01_0": "此廣問十界差別名相也飲食愛欲是眾生根本故先及之阿含經云劫初眾生皆食地肥及田美稻飢則食飽則止復有私多取者因而爭競始立田主以統治之是謂剎利名之為王此特護財小王耳若轉輪王具有七寶飛行自在化導眾生其輪有金銀銅鐵之異其王有四三二一天下之別此人王之最尊者也乃至諸國土中粟散小王各各不同皆以何法守護國土諸天則下自四天上極非非想地則上自四洲下至地獄也日月星宿即三種天子解脫是無學修行是有學如小乘以二果三果為修行證四果為解脫大乘以入地為修行證玅覺為解脫弟子幾種如智慧神通多聞說法等阿闍黎云軌範師幾種佛如法佛報佛應化佛幾種生謂本生意生及化生也魔即天魔鬼魔之類異學即九十六種外道法自性與心即佛與外道所說心性如佛有三自性有七種性自性第一義心如凡小外道以有無為自性以肉團為心六識為心冥諦為心乃至施設種種心量各各不同此皆云何而致。",
    "X17n0331_001:0807b20_0": "云何空風雲云何念聰明云何為林樹云何為蔓草云何象馬鹿云何而捕取云何為卑陋何因而卑陋云何六節攝云何一闡提男女及不男斯皆云何生云何修行退云何修行生禪師以何法建立何等人眾生生諸趣何相何像類云何為財富何因至財富云何為釋種何因有釋種云何甘蔗種無上尊願說云何長苦仙彼云何教授如來云何於一切時剎現種種名色類最勝子圍繞云何不食肉云何制斷肉食肉諸種類何因故食肉。",
    "X17n0331_001:0807c05_0": "此廣問根性差別名相也空風雲變幻不測者念聰明知仁識義者草樹全無知覺者象馬鹿是蠢然不知禮義者而人中復有不知仁義竟捕取而食者有卑賤而醜陋者不知何因而致也六節者西域以兩月為一節即六節師計時外道也闡提此云信不具極惡之人也不男有五有生而不具男根者有閹割者有妬人行婬而自無者有男女互變者有半陰半陽者即生劇妬變半也不女者螺筋皷角脉也修行退者謂退為魔外為諸趣修行進者謂進為住行為向地禪師是以向上事接人者財富謂貨財富足之人不知何因而致也釋種者本行經云大茆草王得成王仙被獵師所射滴血於地生二甘蔗日炙而開一出童男一出童女占相師立男名善生即灌頂甘蔗王女名善賢為第一妃瞿曇釋種即其裔也長苦僊即苦行仙人其所教授即忍辱法門也一切時謂三世一切剎謂十方名謂名號色謂形色如來不許食肉制斷肉者何故夜叉之好食肉者不知又何故也此段空中風雲與林中草樹為一對念聰明與象馬鹿一對男女與不男不女為一對財富與卑陋為一對修行進與修行退為一對如來與闡提為一對食肉與不食肉為一對。",
    "X17n0331_001:0808a03_0": "云何日月形須彌及蓮華師子勝相剎側住覆世界如因陀羅網或悉諸珍寶箜篌細腰皷狀種種諸華或離日月光如是等無量。",
    "X17n0331_001:0808a06_0": "此廣問世界差別名相也如娑婆世界在華藏界第十三重住其中形狀有如日輪形半月形蓮華形師子形箜篌形腰皷形眾華形世界有側者覆者如帝網珠交相涉入者或悉珍寶所成者或不假日月光明而正報依報自有光明者此等世界有無量差別此皆何因之所致也。",
    "X17n0331_001:0808a12_0": "云何為化佛云何報生佛云何如如佛云何智慧佛云何於欲界不成等正覺何故色究竟離欲得菩提善逝般涅槃誰當持正法天師住幾時正法幾時住。",
    "X17n0331_001:0808a15_0": "此廣問如如差別名相也隨機赴感曰化佛詶其宿因曰報佛體性無二曰如如本覺顯照曰智慧如如即法身也舍那報身不於欲界得菩提必於色究竟天者以是三果聖人所住是淨居故善逝者謂已出世而又能入世故曰善般涅槃此云滅度言佛既滅度誰當持此正法眼藏天師即如來別號久如猶幾時也正法住世實有定期由此減劫至彼增劫人壽四萬歲時佛法乃滅唯迦葉持佛袈裟待彌勒下生授之然後入滅。",
    "X17n0331_001:0808a24_0": "悉檀及與見各復有幾種毗尼比丘分云何何因緣彼諸最勝子緣覺及聲聞何因百變易云何百無受云何世俗通云何出世間云何為七地唯願為解說僧伽有幾種云何為壞僧云何毉方論是復何因緣何故大牟尼唱說如是言迦葉拘留孫拘那含是我何故說斷常及與我無我何不一切時演說真實義而復為眾生分別說心量。",
    "X17n0331_001:0808b07_0": "此廣問正智差別相也悉檀此云遍施謂以四法遍施眾生一世界悉檀令人得歡喜益二對治悉檀令人得滅惡益三為人悉檀令人得生善益四第一義悉檀令人得悟理益見即所被之機謂見如是人即與說如是法今所見有幾種也毗尼此云律比丘分即比丘四分律謂大小二乘既總是毗尼云何又分小乘為四分律也既大小二乘同名出世云何初地菩薩纔斷分別執即能現百佛界身而二乘已斷俱生百無所受者秪能現十八神變云何五地菩薩通達世諦涉俗利生而二乘人不能涉俗云何七地名出世間方得念念正受而二乘已得百無受願為說其所以既曰僧伽即名和合云何復有壞僧濫廁其間若獅蟲者既如來稱大毉王其所說法皆能治人之病名毉方論然不能盡毉眾生之病此又何因所致也世尊說法既有種種差別云何又言賢劫三佛悉皆是我拘留孫此云所應斷拘那含牟尼此云金寂迦葉此云飲光也既今佛古佛是一則佛佛道同何不演說一相一味之法而分邪分正說斷常我無我法何不演真實義而復分別種種妄想心量此皆正智之差別故詳問之。",
    "X17n0331_001:0808c04_0": "何因男女林訶棃阿摩勒雞羅及鐵圍金剛等諸山無量寶莊嚴仙闥婆充滿。",
    "X17n0331_001:0808c06_0": "此問器界差別名相之餘也男女林亦云屍陀林其果如男女之狀熟則顏色艶美未幾即墮地狀如死屍臭穢不堪佛令弟子多依此林修不淨觀訶棃具云訶棃怛雞此翻天上持來阿摩勒實如胡桃雞羅已下皆山名謂仙闥婆何故不住人間天上而住此等山也已上一百八句皆從寂滅一心流出種種差別之相菩薩了之名差別智先德云涅槃心易曉差別理難明故大慧一一詳問而為學菩薩道之程式也。",
    "X17n0331_001:0808c15_0": "無上世間解聞彼所說偈大乘諸度門諸佛心第一善哉善哉問大慧善諦聽我今當次第如汝所問說。",
    "X17n0331_001:0808c17_0": "五地菩薩始學世間法唯如來盡物之性故能盡知世間法名世間解即十號之一也謂汝所問百八句義一一皆是大乘菩薩度生法門亦是諸佛所證性自性第一義心故讚其善問而允答也。",
    "X17n0331_001:0808c21_0": "生及與不生涅槃空剎那趣至無自性。",
    "X17n0331_001:0808c22_0": "唐譯云若生若不生涅槃及空相流轉無自性生與空剎那是有為法不生與涅槃是無為法舉此二種則世出世法無不畢具然究其極至不唯生滅剎那空相諸有為法無有自性即涅槃不生滅性諸無為法亦無自性若生死有自性永不能入涅槃若涅槃有自性永不能入生死唯無自性故可生死可涅槃大經云如來成正覺時普見一切眾生成正覺乃至普見一切眾生入涅槃皆同一性所謂無性無何等性所謂無相性無盡性無生性無滅性無我性無非我性無眾生性無非眾生性無菩提性無法界性無虗空性亦復無有成正覺性知一切法皆無性故得一切智大悲相續救度眾生故知無性是一切諸佛談心要訣以一切法緣生無性故不得凡夫法不得聖人法無性緣生故若真若俗不相混濫此寂滅一心所以具有種種差別而種種差別實與寂滅一心無預也是則一答俱銷無俟餘說但為淺識鈍根更添忉怛耳。",
    "X17n0331_001:0809a16_0": "佛諸波羅蜜佛子與聲聞緣覺諸外道及與無色行如是種種事須彌巨海山洲諸剎土地星宿及日月外道天修羅解脫自在通力禪三摩提滅及如意足覺支及道品諸禪定無量諸陰身往來正受滅盡定三昧起心說心意及與識無我法有我自性想所想(能想是心所想是境)及與現二見(即從能想所想而起斷常二見)乘及諸種性金銀摩尼等一闡提大種荒亂及一佛智爾燄得向(得即四果向即四向)眾生有無有象馬諸禽獸云何而捕取譬因成悉檀及與作所作鬱林迷惑通(即林樹蔓草聰明等)心量不現有諸地不相至百變百無受毉方工巧論伎術諸明處。",
    "X17n0331_001:0809b03_0": "此皆總領大慧所問之語參差不齊不必硬配。",
    "X17n0331_001:0809b04_0": "諸山須彌地巨海日月量下中上眾生身各幾微塵一一剎幾塵弓弓數有幾肘步拘樓舍半由延由延兔毫窓塵蟣羊毛&#;麥塵鉢他幾&#;麥阿羅&#;麥幾獨籠那佉棃勒叉及舉利乃至頻婆羅是各有幾數為有幾阿[少/兔]名舍梨沙婆幾舍梨沙婆名為一賴提幾賴提摩沙幾摩沙陀那復幾陀那羅為迦梨沙那幾迦棃沙那為成一波羅此等積聚相幾波羅彌樓是等所應問何須問餘事聲聞辟支佛佛及最勝子身各有幾數何故不問此火燄幾阿[少/兔]風阿[少/兔]復幾根根幾阿[少/兔]毛孔眉毛幾。",
    "X17n0331_001:0809b14_0-0": "凡三界有形之物必有數量今大慧自謂通達大乘深窮萬法故以一百八句諮請然猶坐在法界量裏未能一一窮其數量所謂得其大而遺其細故世尊補出令其更當窮微討細勿自生滿足也且以等覺菩薩智慧校如來智慧如以爪上之土較大地之土此菩薩所以稱大慧未是無量慧若如來則證無量慧矣故法華云諸佛智慧甚深無量唯無量而能盡其量也初四句總舉器界根身大小長短一一皆是積聚幾多微塵所成須彌居大海中入水八萬四千由旬出水亦爾諸山即七金之髏海即香水甘水鹹水海之類日宮縱廣五十一由旬純以天金及天玻璃所成月宮縱廣四十九由旬純以天銀及天青瑠璃所成上中下眾生即十二類生也一剎即一佛剎以大千為限一一剎廣舉微塵剎土言一一剎土皆積聚幾何微塵所成也五尺為一弓二尺為一肘二尺五為一步合二步為一弓合二弓為一丈合二十丈為一息合八十息為一拘樓舍是一里半由延二十里一由延四十里此即世界之里數也七微塵成一窓隙塵七窓隙塵成一兔毛頭塵七兔毛頭塵成一羊毛頭塵七羊毛頭塵成一牛毛頭塵七牛毛塵成一蟣七蟣成一虱七虱成一芥七芥成一大麥&#;大麥也鉢他一升也阿羅一斗也獨籠一斛也那佉梨十斛也勒叉十萬也舉利一億也頻婆羅一兆也謂積幾微塵而成&#;麥積幾&#;麥而成此一升一斗一斛乃至一兆也阿[少/兔]塵也舍利沙婆芥子也賴提草子也摩沙豆也陀那銖也迦梨沙那兩也婆羅斤也謂積幾塵而成一銖一兩一斤也彌樓即須彌山幾波羅彌樓者謂積幾婆羅而成須彌也此等數量皆是汝所不知固所當問而不問反問汝所已知之餘事何哉聲聞已下正顯四聖身量雖大小不同身量各異皆是積微所成而汝不能窮其數者何也風火即四大之二謂四大六根乃至毛孔眉毛等皆積幾塵而有也蓋大慧於廣大處已知其要於精微處未能究盡故勉其當問而當究也先德云一微空故眾微空眾微空故一微空一微空中無眾微眾微空中無一微故善財入普賢一毛孔中見世界重重無盡大經云有一大經卷",
    "X17n0331_001:0809b14_0-1": "量等三千界在於一塵中一切塵亦然有一智慧人淨眼悉明見破塵出經卷廣饒益眾生故知欲窮大千經卷當從窮微塵始知微塵下落則知廣大寂滅一心矣此世尊所以諄諄也。",
    "X17n0331_001:0810a09_0": "護財自在王轉輪聖帝王云何王守護云何為解脫廣說及句說如汝之所問眾生種種欲種種諸飲食云何男女林金剛堅固山云何如幻夢野鹿渴愛譬云何山天仙犍闥婆莊嚴解脫至何所誰縛誰解脫云何禪境界變化及外道云何無因作云何有因作有因無因作及非有無因云何現已滅云何淨諸覺云何諸覺轉及轉諸所作云何斷諸想云何三昧起破三有者誰何處為何身云何無眾生而說有吾我云何世俗說唯願廣分別所問相云何及所問非我云何為胎藏及種種異身云何斷常見云何心得定言說及諸智戒種性佛子云何成及論云何師弟子種種諸眾生斯等復云何云何為飲食聰明廣施設云何樹葛藤最勝子所問云何種種剎仙人長苦行云何為族姓從何師受學云何為醜陋云何人修行欲界何不覺阿迦尼吒成云何俗神通云何為比丘云何為化佛云何為報佛云何為如如平等智慧佛云何為眾僧佛子如是問箜篌腰皷華剎土離光明心地者有七所問皆如實此及餘眾多佛子所應問。",
    "X17n0331_001:0810b03_0": "此總牒問辭竟而美其當問也此者即指大慧所問者餘眾多即如來所補出者言汝所問一心差別之相皆是稱理之談殊非漫然要知不獨汝所問者應問應究即我所說其餘眾多之事亦應問應究也。",
    "X17n0331_001:0810b08_0": "一一相相應遠離諸見過悉檀離言說我今當顯示次第建立句佛子善諦聽。",
    "X17n0331_001:0810b10_0": "言汝所問者雖聖凡有異淨穢不同然一一差別之相皆與無差無別者相應所謂即此相離此相即此物非他物故觸目所見者無非一相一味之法何有差別諸見哉只此二語則知寂滅一心遍一切處所以四生九類皆於自性身中顯現以自真心為一切萬有之性故隨為色空周遍法界循業發現果報不同處異生則業果浮沉生死相續在諸聖則法身圓滿玅用無窮隱顯雖殊一性不動然則諸法本來寂滅不可言宣今於無言說處假立言說次第建立種種諸句汝當善聽而得之言外也。",
    "X17n0331_001:0810b21_0": "此上百八句如諸佛所說不生句生句常句無常句相句無相句住異句非住異句剎那句非剎那句。",
    "X17n0331_001:0810b23_0": "言汝上來所問一百八句若諸佛所見觸目菩提更無異法所謂合江河淮濟為一水鎔盤瓶釵釧為一金也華嚴疏云性非事外曾何乖於種種種種性空曾何乖於一性是以緣起之法總有四義一緣生故有二緣生故空三無性故有四無性故空無性緣生故空則非斷見無見之空是名真空緣生無性故有則非常見有見之有是名幻有故得常種種常一性今言不生即生者所謂無生而生業果儼然也常即無常者所謂不生不滅是無常義也相即無相者所謂若見諸相非相即見如來也無而忽有曰生生法暫停曰住住別前後曰異時之最促曰剎那今則觀生也若石女之懷胎觀住也若陽燄之翻波觀異也同浮雲之萬變觀滅也類狂華之謝空觀剎那也實未曾動著一絲毫所以如來八相成道乃至入滅未曾離剎那際三昧故總云非也。",
    "X17n0331_001:0810c15_0": "自性句離自性句空句不空句斷句不斷句邊句非邊句中句非中句常句非常句。",
    "X17n0331_001:0810c17_0": "因緣無性論云阿難調達並為世尊之弟羅睺善星同是如來之胤而阿難常親給侍調達每興逆害羅睺則護珠莫犯善星則破器難收以此而推諒可知矣若云各有自性不可貿遷者此殊不然至如鷹化為鳩本心頓盡橘變成枳前味永消昔貧今富定性之理難奪先貴後賤賦命之言何在呂望屠牛之士終享大師伊尹負鼎之人卒登相位戴淵四隣所患後著高名周處三害之端晚稱令德闍王無間之罪翻然改圖育王莫大之愆忽能遵善若依自性之理豈容得有斯義故知有情無情皆無自性盡隨心變但逐緣生故曰自性句離自性句由無性故空以有空義故一切法得成故曰空句不空句法性如是即起斷常中邊等見皆是以尺量空持蠡測海言斷者即七斷滅論常即四徧常論邊即小乘假實二邊大乘空有二邊中即假施設中道真實中道不假不實中道不有不無中道也須知非離邊有中亦非即邊是中若離邊求中則邊見未泯若即邊是中則中解猶存故總云非也。",
    "X17n0331_001:0811a12_0": "緣句非緣句因句非因句煩惱句非煩惱句愛句非愛句方便句非方便句巧句非巧句淨句非淨句成句非成句譬句非譬句弟子句非弟子句師句非師句種性句非種性句三乘句非三乘句。",
    "X17n0331_001:0811a16_0": "煩惱及愛染因緣也善巧方便淨因緣也若染淨實有自性則狂者終狂聖者自聖以無自性故隨染緣而成染隨淨緣而成淨而實非染淨也圓成實性雖是眾生現成具足而以種種譬喻演說開導然無一喻可能喻者故強立能說此法者為之師能聽此法者為弟子法建三乘性開五種其中實無說者聽者三乘五性之別故總云非也。",
    "X17n0331_001:0811a23_0": "願句非願句三輪句非三輪句相句非相句有品句非有品句俱句非俱句緣自聖智現法樂句非現法樂句。",
    "X17n0331_001:0811b02_0": "即諸佛菩薩乘大願力而以身口意三輪現通說法鑑機標相曰此我相此人相此眾生相此壽者相而復標曰此有相此無相此是亦有亦無相此是非有非無相等而實四句百非悉皆離絕即其所緣自覺聖智境界現得真實受用法樂亦是此心常分何曾有一毫受用樂相乎故總云非也。",
    "X17n0331_001:0811b08_0": "剎土句非剎土句阿[少/兔]句非阿[少/兔]句水句非水句弓句非弓句實句非實句數句非數句數句非數句明句非明句虗空句非虗空句雲句非雲句工巧句術明處句非明處句風句非風句地句非地句。",
    "X17n0331_001:0811b12_0": "即我所說大而剎土細而微塵大種大種即實句也乃至地水風雲等雖是積聚微塵大種所成究而言之悉無自性皆是眾生循業發現故迦葉云一切世界水沫所成亦從眾生不可思議業因緣出非真實有至於汝之所問五明伎術總不出乎名言之內都無實義所以云一切數句非數句與我靈覺何干涉故總云非也(兩數句一是筭數之數一是數量之數)。",
    "X17n0331_001:0811b19_0": "心句非心句施設句非施設句自性句非自性句陰句非陰句眾生句非眾生句慧句非慧句涅槃句非涅槃句爾燄句非爾燄句外道句非外道句。",
    "X17n0331_001:0811b22_0": "不獨名言不實即汝所問自性及與心種種施設量皆是隨情逐妄立種種名然心之與性本非二物迷則結性而為心悟則轉心而為性正如水之成氷氷還成水豈有二哉心性既爾則五陰眾生亦復如是故知離五陰無眾生離眾生無五陰然五陰眾生尚屬所迷固是虗妄即以智慧觀察照破五陰淨除爾燄超生死而證涅槃亦是虗妄所謂生死涅槃同於昨夢故總云非也至於不達自心而心遊道外者為外道此亦指其迷心逐物而言外亦非真在道外也。",
    "X17n0331_001:0811c08_0": "荒亂句非荒亂句幻句非幻句夢句非夢句燄句非燄句像句非像句輪句非輪句犍闥婆句非犍闥婆句。",
    "X17n0331_001:0811c11_0": "即汝所見國土側覆橫斜或淨或穢雜亂不一悉如幻夢即幻夢等豈真實有幻夢等耶亦是隨業所現故亦非也。",
    "X17n0331_001:0811c14_0": "天句非天句飲食句非飲食句婬欲句非婬欲句見句非見句波羅蜜句非波羅蜜句戒句非戒句日月星宿句非日月星宿句諦句非諦句果句非果句滅起句非滅起句治句非治句相句非相句。",
    "X17n0331_001:0811c18_0": "即汝所問諸天有幾種雖三界諸天優劣不等總是浮虗妄想凝結妄想若除天於何有然飲食婬欲雖曰壽命根元而諸天四食不同六天婬欲亦異誰謂食色有性哉至於所問起諸見者雖見刺難拔見坑難出而一見自性應念化成無上知覺亦非實有又汝所問幾波羅幾戒雖波羅有十戒有七聚三聚等然皆隨機設化而非實有彼岸可到戒性可持亦由對此岸可離而云彼岸可到毀禁可止而云諸戒可持故亦非也至乎日月星宿雖各有天子主持皆是八萬四千精耀亂想之所凝結豈真實有然而二乘所修四諦所證四果與夫無想定中想滅復起之類雖邪正了然總非實證故曰非也治句者唐曰毉方亦是毉師對病施設既對病設方則病去藥亡豈可執哉相句凡三出初曰相者是名相之相是通指十界聖凡之相也次曰相者是標相之相謂建立有無我人等相也此云相者即形相之相是通指諸趣之形相也前為能治此即所治前之能治既非故所治亦非也。",
    "X17n0331_001:0812a13_0": "支句非支句巧明處句非巧明處句禪句非禪句迷句非迷句現句非現句。",
    "X17n0331_001:0812a15_0": "支句唐云支分即七覺支八菩提分也謂此三十七品助道法皆是二乘巧修發悟之處故曰巧明處禪即是所修之定現即是悟雖始迷後悟但是路途之樂未是到家消息故曰非也。",
    "X17n0331_001:0812a19_0": "護句非護句族句非族句仙句非仙句王句非王句攝受句非攝受句寶句非寶句記句非記句一闡提句非一闡提句女男不男句非女男不男句味句非味句事句非事句身句非身句覺句非覺句動句非動句根句非根句有為句非有為句無為句非無為句因果句非因果句色究竟句非色究竟句節句非節句鬱樹藤句非鬱樹藤句雜句非雜句說句非說句毗尼句非毗尼句比丘句非比丘句處句非處句字句非字句。",
    "X17n0331_001:0812b04_0": "護謂守護族謂種族謂三界之內有同類之族有閒散之仙有主治之王有護國之法有攝受之教有貴重之寶有授記之人有不信之夫有男不男女不女之異有嗜好之味有所作之事有分段之身有計度之念有妄起之動有對塵之根有有為之具有無為之法有不爽之因果有不謬之時節有色究竟為聖人居有鬱樹藤為禽獸窟有種種雜亂身有種種差別語有守毗尼而作淨行有住靜處而建立文字然總是妄想所攝無性所收悉如幻化故云非也。",
    "X17n0331_001:0812b14_0": "大慧是百八句先佛所說汝及諸菩薩摩訶薩應當修學。",
    "X17n0331_001:0812b16_0": "總計上文有一百零四句唐譯以有品句分作有句無句而少一數句以起滅分作起句滅句而少一無為句至自證聖智現法樂句唐分為二此合為一又少一決定句若添此一句總有百八句之數是百八句皆云非者以寂滅心中不但一切有為染汙法不可得即一切無為白淨法亦不可著故法界觀云一切皆不可不可亦不可此語不可受以離念境界唯證相應故此即先佛所說諸佛心第一自覺之境界所以般若文殊分云若知無性即知無法若知無法即無境界若無境界即無所依若無所依即無所住如是開示如是信入名真實句名金剛句故修學大乘者應當修學此句也。",
    "X17n0331_001:0812c05_0": "爾時大慧菩薩摩訶薩復白佛言世尊諸識有幾種生住滅。",
    "X17n0331_001:0812c07_0": "大慧先以百八句仰諮世尊總以非字遣之以直顯如如之體而三界唯心之旨朗如星月矣大慧豈不知寂滅一心大總相法門體中纖毫不立乎乃復遽問諸識有幾種生住滅者何故良以真如之體不變不壞逈超生滅而真如相用全在生滅識中顯示唯佛一人圓證真如不生滅性次自等覺至凡夫地若望聖賢階級懸如霄壤若約異熟不空生滅尚在即等覺菩薩類皆坐在無明窟中若不請如來詳說則儱侗真如無智妄稱一切智說故大慧雖領世尊之語而亟請生滅識者正欲顯真如相用差別也故馬鳴以一心分真如生滅為二門故曰是心真如相即示摩訶衍體故是心生滅因緣相能示摩訶衍自體相用故故世尊先標諸識之用次出諸識之相三顯諸識之體然後立真唯識比量以顯萬法唯識之宗使凡聖邪正絲毫不濫直令觀察流注枯渴識情始得證入真如平等法性故詳問之。",
    "X17n0331_001:0812c24_0": "佛告大慧諸識有二種生住滅非思量所知諸識有二種生謂流注生及相生有二種住謂流注住及相住有二種滅謂流注滅及相滅。",
    "X17n0331_001:0813a03_0": "言流注者謂第八現識三相微隱是細中之細故名流注此流注識全是真如不生滅性因無明不覺忽與生滅和合轉而為識名流注生長劫相續名流注住始從正信發心觀察若證法身得少分滅直至金剛道後一念相應慧頓斷生相無明名流注滅言相者謂前七種識三相粗顯以是細中之粗粗中之細又粗中之粗故名曰相然此麤相但就流注住中分為三相七識初生名相生即與前境和合相續不斷名相住從信相應地斷執取相是滅粗中粗相從初地斷相續至七地斷智相是滅粗中細相自八地斷現相九地斷轉相是滅細中粗相名相滅也以流注即相中流注相即流注中相故諸識皆有二種生住滅也然粗細雖殊至於交相熏變皆莫知其所以然故非思量所知以諸眾生從無始來未曾離念故若得無念則知心相生住異滅矣。",
    "X17n0331_001:0813a19_0": "諸識有三種相謂轉相業相真相。",
    "X17n0331_001:0813a20_0": "轉相者謂前七名分別事識亦名轉識而相名轉相論云二者名為轉識依於動心能見相故轉相有二若就無明所動轉成能見者在本識中若為境界所動轉成能見者在事識中也言業相者謂第八名業識而相名業相論云一者依無明力不覺心動故不生滅者名真識而相名真相問既標諸識有二種生住滅而復標三相者何故是顯轉相業相有二種生住滅而真如之相未甞有生住滅也古釋云此三種相通乎八識謂起心名轉八識皆起皆有生滅故心動是業八識皆動故八之真性俱名真相故盖業相已統六粗而轉相亦通三細故下文云四因緣故眼識轉又云種種諸識浪騰躍而轉生皆轉相也心名採集業又云業相猶波浪皆業相也又云常清淨無相是真相也以真如寂滅心不變隨緣不染而染故有業轉二相以真如寂滅心隨緣不變染而不染故有真相也。",
    "X17n0331_001:0813b12_0": "大慧略說有三種識廣說有八相何等為三謂真識現識及分別事識大慧譬如明鏡持諸色像現識處現亦復如是。",
    "X17n0331_001:0813b15_0": "論云現識者所謂能現一切境界猶如明鏡現於色像現識亦爾隨其五塵對至即現無有前後以一切法任運而起常在前故分別事識者論中名意識亦名分離識以隨事攀緣分別六塵故此中真識即如來藏寂滅一心而此現識即賴耶識也然此現識無別自體即是如來藏心以不覺故與諸妄想有和合不和合義和合者能含染淨目為藏識不和合者體常不變目為真如即是如來藏故曰寂滅者名為一心一心即如來藏故偈云佛說如來藏以為阿賴耶惡慧不能知藏即賴耶識此中三識若約馬鳴生滅與不生滅和合非一非異名阿梨耶識則是以真識現識分別事識和合為宗若約護法唯以現識與分別事識和合為宗雖各出手眼義歸一途古德云若言眾生心性同諸佛心性別教也圓教心性是一寂光無彼無此極十方三世佛及眾生邊際成一大圓鏡但是一鏡無有同異佛及眾生一鏡上像耳問今此鏡是約法相宗立約法性宗立答若約法相因緣對待門即本識為鏡此中所立是也若約法性即如來藏寂滅一心為鏡如起信云復次覺相者與虗空等猶如淨鏡是也問何以此中但言現識及分別事識不言末那答有現識必有末那依彼轉緣彼故有意識必有末那意識以末那為根故應知末那細分通現識粗分通意識故舉現識事識而末那在其中矣。",
    "X17n0331_001:0813c16_0": "大慧現識及分別事識此二壞不壞相展轉因。",
    "X17n0331_001:0813c17_0": "前已標諸識以生滅為宗此復出其因也壞即轉相業相而不壞者即真相也由此二相展轉因故能成立生滅之宗也此展轉因若據馬鳴即是依真相而轉業相即第八識依業相而轉轉相即第七識依轉相而轉現相即前五識復轉現相而成智相相續執取計名等相即分別事識故起信云復次生滅因緣者所謂眾生依心意意識轉故此義云何以依阿梨耶識說有無明不覺而起能見能現能取境界起念相續等若據護法即是第八含藏種子能發前七現行現種交熏互為因果故論云諸法於識藏識於法亦爾更互為因性亦常為果性瑜伽論云無常法與他性為因亦與後念自性為因是因緣義自性言顯種子自類前為後因他性言顯種與現行互為因義攝大乘論云藏識染法互為因緣猶如束蘆俱時而有此性相二宗展轉因之不同也故大經云眼耳鼻舌身心意諸情根以此常流轉而無能轉者以眼等八識為能所熏展轉為因而常流轉無別我人故云而無能轉者是以舉體性空方成流轉即此八識名無體性無實我法而為其主若使有性則不可熏變安能流轉故舉此展轉因者正欲破外道小乘實我實法也。",
    "X17n0331_001:0814a15_0": "大慧不思議熏及不思議變是現識因大慧取種種塵及無始妄想熏是分別事識因。",
    "X17n0331_001:0814a17_0-0": "此別明八識展轉相生因也熏有二義一熏習謂熏心體成染淨等二資熏謂現行心境及諸惑相資等變亦有二義一變現二轉變若依護法獨取熏習轉變一義謂以前七為能熏第八為所熏第八為能變前七為所變謂前七相見現行熏第八第八轉變相見二分種子前五能熏第八相分種第六能熏第八相見二分種第七能熏第八見分種於是第八復變起前七現行以能熏所熏能變所變如是如是而不覺知故曰不思議熏不思議變故唯識頌云由一切種識如是如是變以展轉力故彼彼分別生此則前七為現識因也然識有多名以能含藏諸種子故曰藏識為前七業所招感故名業識以能變起諸現行故名現識現字與變字照應言分別事識所以能取種種塵者悉由第八含藏前七種子念念受熏故眼能見色乃至意能取法如外無六塵現行熏內無無明種子熏則眼等六識不能分別六塵矣由內外交熏無間故第七能緣帶質境第六能緣三類境前五能緣性境是則第八為前七之因也若約馬鳴以依真如法故有於無明為諸染因此即業相以有無明染法因故即熏習真如以熏習故則有妄心此即轉相以有妄心即熏習無明不了真如法故不覺起念妄現境界此即現相所謂無明不覺生三細也言不思議熏變者謂真如本不可熏而為無明熏名不思議熏真如之體本自不變而今隨無明緣成一切法名不思議變此現識展轉相因生也取種種塵者謂現在取六塵境也無始妄想熏者即無始見愛熏習也故起信論云無明熏習義有二種一者根本熏習以能成就業識故即經所云不思議熏二者所起見愛熏習以能成就分別事識故即經所云無始妄想熏此即分別事識展轉相因生也。",
    "X17n0331_001:0814c01_0": "大慧若覆彼真識種種不實諸虗妄滅則一切根識滅是名相滅大慧相續滅者相續所因滅則相續滅所從滅及所緣滅則相續滅大慧所以者何是其所依故依者謂無始妄想熏緣者謂自心見等識境妄想。",
    "X17n0331_001:0814c06_0-0": "此別釋展轉相滅因也若約護法覆是盖覆義正指等覺無間道一分極微細所知愚以能蓋覆真識故至解脫道用金剛慧一念頓斷則我法二執虗妄習氣一時頓滅則一切依根之識應念都盡如前五識依五根六以七為根七以八為根八又以七為根故一分極微細所知愚空而一切依根之識皆空所謂皮既不存毛將安附所謂流注滅而相滅也言相續者即流注變文耳所因者即因緣依所從者即俱有依及等無間緣依所緣者即所緣緣也是其所依者言此三者是心心所之所依也故唯識云諸心心所皆有所依所依有三一因緣依謂自種子諸有為法離自因緣必不生故二俱有依謂內六處離俱有依必不轉故三等無間緣依離開導依必不起故唯心心所具三所依名有所依然此三者皆屬無始無明熏起若所緣緣者即自心所現眼等五識所取五塵境相也言此相續識原非實有內以無明種子為親因緣又以俱有依為增上緣又以開導依為等無間緣外以五塵為所緣緣於是內外交熏念念相續無有間斷必使內因外緣雙銷併盡而後相續識滅所謂相滅而流注滅也若約馬鳴以有真如法故能熏習無明以熏習因緣力故能令妄心厭生死苦樂求涅槃以此妄心有厭求因緣故即熏習真如自信己性知心妄動無前境界修遠離法以如實無前境界故種種方便起隨順行不取不念乃至久遠熏習力故無明則滅所謂相滅而流注亦滅也以無明滅故心無有起以無起故境界隨滅以因緣俱滅心相皆盡名得涅槃成自然業所謂流注滅而相亦滅也。",
    "X17n0331_001:0815a11_0": "大慧譬如泥團微塵非異非不異金莊嚴具亦復如是大慧若泥團微塵異者非彼所成而實彼成是故不異若不異者則泥團微塵應無分別大慧轉識藏識真相若異者藏識非因若不異者轉識滅藏識亦應滅而自真相實不滅是故大慧非自真相識滅但業相滅若自真相滅者藏識則滅大慧藏識滅者不異外道斷見論議。",
    "X17n0331_001:0815a18_0-0": "上以真識現識及分則事識和合為宗以壞不壞相展轉因此以泥團微塵金莊嚴具非異不異為同喻成立馬鳴生滅與不生滅和合之宗亦能成立現識與事識和合真比量之宗也以微塵與金喻藏識真相以泥團與莊嚴具喻轉識也若泥團與微塵異則泥團應非微塵所成今泥團實是微塵所成則知非異若泥團與微塵不異則泥團壞而微塵亦壞應無分別若轉識與藏識真相異則藏識不應以轉識真相為因今藏識既以轉識真相隨緣而成藏識則知不異若轉識與藏識真相不異則轉識滅時而藏識真相亦應滅然藏識真相實不滅則知非不異故復示之曰前言相滅則相續滅者非是藏識真相可滅以藏識真相即是真如尚無有生欲何為滅但是藏識一分無始無明業相為可滅耳非自真相滅也言自真相者本覺之心不藉妄緣性自神解名自真相此約不一義說隨無明風作生滅時神解之性與本不異亦名自真相此約不異義說是則前標三相深為有用若自真相果可滅則藏識亦可滅矣反顯藏識由真妄和合而成妄雖滅而真體不無也故論云所言滅者唯心相滅非心體滅若藏識真相實可滅者是與斷滅外道議論無異則誰為能證誰為所證哉故密嚴偈云如來清淨藏世間阿賴耶如金與指鐶非異非不異唯識論偈云此諸法勝義亦即是真如常如其性故即唯識實性明知天親亦用如來藏為識體但後釋論之人唯立不變不許隨緣耳今約馬鳴申量云真識藏識及分別事識是有法和合為宗因云壞不壞相展轉故同喻如金莊嚴具復約護法申量云藏識與分別事識是有法和合為宗因云壞不壞相展轉故同喻如泥團微塵此二量皆是高建法幢支也若異此唯心唯識量皆墮外道議論矣。",
    "X17n0331_001:0815c02_0": "大慧彼諸外道作如是論謂攝受境界滅識流注亦滅若識流注滅者無始流注應斷大慧外道說流注生因非眼識色明集會而生更有異因大慧彼因者說言若勝妙若士夫若自在若時若微塵。",
    "X17n0331_001:0815c06_0": "此出外道斷滅論也彼謂攝取境界之分別事識滅則第八無始流注之識亦滅不知八識自體即是真識名真常流注自無始至今隨緣而生隨緣而滅不知本未甞生未甞滅也若謂此流注者可滅則無始時流注應斷胡為至今流注而不已乎是則真常流注亘古亘今不斷不滅為諸法生因明矣而外道昧此反謂流注生因非如眼識因色光明集會展轉生別有異因為作者生言異因者猶異端也所謂異因者何有執六句勝妙義中大有和合為作者因如勝論所計有執二十五諦中冥初三德為作者因神我為知見受用者如數論所計此中士夫即神我也有執大自在天體實徧常為作者因能生諸法如塗灰所計有執時有作用為作者因能生萬物如時敬外道所計有執極微實常為作者因能成色心等法如路伽所計以此等皆不根於壞不壞相展轉因皆所謂異因也如彌勒所修識心三昧乃至盡空如來國土淨穢有無皆是我心變化所現我了如是唯心識故識性流出無量如來然則外道所計總不外此識心流出彼不以此為因而反以識心所流出者為因豈真因哉若果識流注者可滅誰為出生士夫自在等而以為作者耶且彼所言作者是生滅法反計為常而藏識真常流注者反為斷滅是以常為無常無常為常均為斷滅論議也。",
    "X17n0331_001:0816a06_0": "復次大慧有七種性自性所謂集性自性性自性相性自性大種性自性因性自性緣性自性成性自性。",
    "X17n0331_001:0816a08_0-0": "此因外道計斷滅論是以法性為無性也故以七種性自性表之以見諸法各有自性況性一切性者而自無性乎集自性者即眼識色明集會而生之集一切聖賢皆由此集而有差別如聲聞見苦而斷集緣覺悟集散而觀離菩薩知集本無和合諸佛以集為第一義心外道於集上起有無見正如天人之見飯色餓鬼之見恒河飯飯不同水水各異皆隨自心現量故見諸集差殊而集性自性未甞異也雖一切法仗因托緣集會而生而所生萬物性性不同相相各異如瞽瞍性頑而帝舜性孝帝堯性慈而丹朱性傲是所稟之性各有自性也周公之狀如斷椔臯陶之狀如削瓜傳說之狀如植鰭仲尼之狀如蒙俱是所賦之形各有自性也地性堅水性濕火性燥風性動是大種性各有自性也松本直棘本曲鵠本白烏本黑是因性各有自性也陽燧見日而出火方諸見月而津水琥珀見草而粘慈石見鐵而吸是緣性各有自性也鑛因銷而成金璞因斵而成玉木因削而成器是成性各有自性也故後文云一切法有自性無他性豈斷滅之謂乎問前云趣至無自性此云有自性豈非前後自語相違耶答以真如不守自性而能隨緣成一切自性故在因而因在緣而緣在天而天在人而人外道昧此以無自性法作斷滅論故復以有自性表之如首楞嚴云一切世間草葉縷結詰其根源咸有體性況性一切心而自無體亦是此意故宗鏡云有自性是表詮無自性是遮詮以外道執有自性故以無自性遮之以外道執無自性故以有自性表之。",
    "X17n0331_001:0816b12_0": "復次大慧有七種第一義所謂心境界慧境界智境界見境界超二見境界超子他境界如來自到境界。",
    "X17n0331_001:0816b14_0": "上既說七種性自性皆是真如不守自性所成名依他起性若能了此即是第一義諦故示七種自性而復示七種第一義心也言心境界者謂觸目全是清淨寶覺更無別法下文云無心之心量量者自性處是也慧境界者觀察一切法通達無所有逮得自在力是則名為慧是也智境界者採集業說心不採集為智是也見境界者一切色是佛色一切聲是佛聲所謂佛知佛見是也超二見境界者離有無一異俱不俱是也超子地境界者菩薩等觀眾生如一子地今亦超之下文云我說此諸乘無乘及乘者無有乘建立我說為一乘是也如來自到境界者即自覺聖智不由於他通達佛法是也。",
    "X17n0331_001:0816c03_0": "大慧此是過去未來現在諸如來應供等正覺性自性第一義心以性自性第一義心成就如來世間出世間出世間上上法聖慧眼入自共相建立如所建立不與外道論惡見共大慧云何外道論惡見共所謂自境界妄想見不覺識自心所現分齊不通大慧愚癡凡夫性無性自性第一義作二見論。",
    "X17n0331_001:0816c09_0": "此上七種境界是三世諸佛於七種性自性邊通達第一義心即以第一義心應凡夫成就世間法應三乘成就出世間法應最上乘成就出世間上上法大涅槃經云十二因緣法下智觀故得聲聞菩提中智觀故得緣覺菩提上智觀故得菩薩菩提上上智觀故得佛菩提由得第一義心開聖慧眼故能入真入俗建立施為凡所建立皆是第一義心自覺境界不墮二見故不與外道惡見共自相即真諦境共相即俗諦境然所謂惡見共者豈別有共處哉即於如來七種自證境界以自妄想作此妄見耳由彼愚迷而不覺知是自心所現如鏡像水月本非有無而妄立有無分齊自生障隔不能通達自性第一義心自謂流注亦滅諸性無性反計作者是常此皆愚癡凡夫惡見所噬於自性第一義心作此二見不知性自性第一義心乃藏識真相諸佛非此無由成就世間出世間出世間上上法其可斷滅論乎。",
    "X17n0331_001:0817a02_0": "復次大慧妄想三有苦滅無知愛業緣滅自心所現幻境隨見今當說。",
    "X17n0331_001:0817a04_0": "此言外道不覺自心所現於如幻境認以為實計常計斷依此而修轉沉三界所謂以苦捨苦安可得哉果能斷三有苦因滅三界苦果則能隨見自心所現種種如幻境界決不復墮斷常二見此正修行出苦之要故我為汝說也此錯簡當在若復諸餘沙門之前。",
    "X17n0331_001:0817a10_0": "大慧若有沙門婆羅門欲令無種有種現及事時住緣陰界入生住或言生已滅大慧彼若相續若事若生若有若涅槃若道若業若果若諦破壞斷滅論所以者何以此現前不可得及見始非分故大慧譬如破瓶不作瓶事亦如燋種不作芽事如是大慧若陰界入性已滅今滅當滅自心妄想見無因故彼無次第生。",
    "X17n0331_001:0817a17_0-0": "此廣破有無二見也外道有內外二種內即沙門外即婆羅門也言外道不以諸識展轉為生因而妄計異物為生因生因既異住滅亦然故詳破之唯識量中一切諸法從現識現而數論計因中有果一切諸法從有因生勝論計因中無果一切諸法從無因生故曰有種無種因果現故中論破云果先於緣中有無俱不可先無為誰緣先有何用緣時敬外道妄計一切事業依時而住時為作者為常住因中論破云因物故有時離物何有時物尚不可得何況當有時唯識量以陰界入法皆依識生依識住依識滅所謂當處出生隨處滅盡而附佛法外道計陰界入從次第緣生緣住或說緣生即滅此與相及流注展轉生住滅異矣故中論破云若謂諸法於三世中次第生起若現在諸法與未來作次第緣未來諸法未生與誰作次第緣若未來已有即是生何用次第緣現在諸法無有住時若不住何能為次第緣若有住則非有為法以有為法常有滅相故若滅已則不能與作次第緣若言滅法猶在則是常若常則無罪福等此則唯識量中相及流注可作展轉因而彼所計皆成斷滅矣故總斥之曰彼之所為相續者既已斷滅則凡所作之事生滅之法若三界諸有與夫外道所計涅槃乃至二乘出苦之道出世之業所證之果所修之諦皆悉破壞成斷滅論故下文云彼一一外道涅槃彼等自論智慧觀察都無所有所以者何由彼不見藏識為諸法始非其分故由其無分故妄生穿鑿非因計因非果計果即此現前已成灰斷而欲未來得道得果無有是處應出量云外道小乘一切因果是有法破壞斷滅宗因云有種無種現故時住故緣陰界入生住故生已滅故同喻如破瓶焦芽破瓶不作瓶事喻果不成果焦芽不作芽事喻因不成因既已斷定復詳示之曰若陰界入屬過去者過去已滅屬現在者現在今滅屬未來者未來當滅此則三世無因皆悉斷滅乃復計為從次第緣能生果者如邀空華而結空果特汝自心作此妄想見耳以汝所計之因是斷滅無因焉有無因而能生果者哉故曰無因故彼無次第生問三世次第因緣生一切法是如來所許何故陰界入從緣生緣住緣滅者亦皆破之答中論云不生亦不滅不常亦不斷不一亦不異能說是因緣善滅諸戲論故知三世次第因緣是如來假借以入不生不滅因緣耳此經專以壞不壞相展轉因成立生滅與不生滅和合之宗故即小乘三世次第因緣亦皆呼為附佛法外道此正彈偏斥小之時故作峻厲之語以激之令其取證不生不滅大事因緣耳此義甚深知者亦希。",
    "X17n0331_001:0817c15_0": "大慧若復說無種有種識三緣合生者龜應生毛沙應出油汝宗則壞違決定義有種無種識有如是過所作事業悉空無義大慧彼諸外道說有三緣合生者所作方便因果自相過去未來現在有種無種相從本已來相承覺想地轉自見過習氣作如是說如是大慧愚癡凡夫惡見所噬邪曲迷醉無智妄稱一切智說。",
    "X17n0331_001:0817c22_0": "前計微塵自在等是他生計士夫是自生計有種無種等是無因生此計共生也外道見聖教說三緣和合而生諸法故亦計之如數論計五唯生五大五大生十一根是也然聖教以根塵和合為生識之緣今以有種無種為生識緣不知有種無種皆非識緣既無生因何從而生識果哉若使無因而能生果是則龜應生毛沙應生油有是理乎今既無因決無得果則汝所立三緣和合之宗是自破矣由違背我大乘決定真唯識量眼識色明集會而生之宗故也有種無種生識之說有如此過不但自壞其宗即其所作事業亦托之空言而已豈有實義乎哉故總斥之曰彼等外道說有三緣和合之宗亦復自謂有所作之事業有所傳之教法有因果之自相有三世之種子一一皆從有種無種識三緣和合而生此其計非一日說非一人從本已來世世相承能成事業祖祖孫孫遞相授受不知悉由自妄想地之所流轉自己惡見之所熏習作如是說彼雖愚癡無智慧眼亦由邪師惡見所噬邪教所迷直至於今醉心不覺其實無智而妄稱一切智說應申量破云有種無種為有法和合生識為宗因云悉空無義故喻如龜生毛沙出油已上廣破邪因邪果此下詳示正因正果。",
    "X17n0331_001:0818a20_0": "大慧若復諸餘沙門婆羅門見離自性浮雲火輪犍闥婆城無生幻燄水月及夢內外心現妄想無始虗偽不離自心妄想因緣滅盡離妄想說所說(唐云作是觀已離分別緣亦離妄心所取名義)觀所觀受用建立身之藏識於識境界攝受及攝受者不相應無所有境界離生住滅自心起隨入分別(唐云知身及物并所住處一切皆是藏識所現無能所取及生住滅如是思惟恒住不捨)。",
    "X17n0331_001:0818b03_0": "諸餘沙門婆羅門是除前二種外道別指二種正修行者謂前二種外道不了一切法唯心所現妄立種種異因終無實果若我正因弟子修習唯心觀者觀一切法本無自性如浮雲火輪如尋香城觀一切無生如幻如陽燄如水中月如夢內身外塵皆從自心變現悉由藏識含藏無始無知業愛三種虗偽因緣所變不離自心作是觀已離分別緣亦離妄心所取名義盖說是名而所說即義也若離妄想因緣則分別我執伏若名義空則分別法執伏此當三資糧位時也二執既伏唯心直進觀察所受用之器界及能受用之根身皆從藏識建立觀即觀智所觀即根身器界及識也既知根身器界是藏識現本無實體不生取著而能取之心所取之境兩不相應故外無所取而所取空內無能取而能取亦空故離生滅雖曰我法俱伏心境兩空猶有自心起隨入分別之智在然而未至無分別也此當四加行作四尋思觀時也唯識論云先依明得定發下尋思觀觀無所取立為煖位依明增定發上尋思觀觀無所取名為頂位依印順定發下如實智於無所取決定印持無能取中亦順樂忍立為忍位依無間定發上如實智印二取空立世第一然猶未能真住唯識以現前猶有少物故故頌云現前立少物謂是唯識性以有所得故非真住唯識此中自心起隨入分別者所謂少物也。",
    "X17n0331_001:0818c04_0": "大慧彼菩薩不久當得生死涅槃平等大悲巧方便無開發方便大慧彼一切眾生界皆悉如幻不勤因緣遠離內外境界心外無所見次第隨入無相處次第隨入從地至地三昧境界解三界如幻分別觀察當得如幻三昧度自心現無所有得住般若波羅蜜捨離彼生所作方便金剛喻三摩提隨入如來身隨入如如化神通自在慈悲方便具足莊嚴等入一切佛剎外道入處離心意意識是菩薩漸次轉身得如來身。",
    "X17n0331_001:0818c13_0": "若斷分別我法二執轉六識為妙觀察智轉七識為平等性智方得生死涅槃平等今言不久當得者以有少物在也若無少物便得真住唯識矣故唯識頌云若時於所緣智都無所得爾時住唯識離二取相故既離二取證平等性觀涅槃即生死故不住涅槃而起大悲善巧方便不待開發以無師智自然智繁興大用度一切如幻眾生雖汲汲度生不見有勤勞之相所謂觀空而萬行騰沸也觀生死即涅槃故不住生死而能遠離內外境界毫無染著所謂涉有而一道清淨也彼雖遠難非若小乘畏而避之由其照破法執直見自心故自心外無片事可得由是而創登初地證徧行真如名隨分覺故曰次第隨入無相處從是而漸斷漸證以至八地俱生我執已盡得證無生法忍入寂滅定而為定相所醉不肯度生故設三橋七勸以開導之復從定中以如幻觀觀察三界如幻得如幻三昧故不起滅定而能超越無生即登善慧現大法雲興大法雨度脫如幻眾生得住般若波羅蜜既登此地復從法雲而入等覺以金剛智頓斷生相無明轉第八識成大圓鏡智轉前五識為成所作智頓入玅莊嚴域證玅覺身自然而有不思議業用至此則上與諸佛同一慈力下與眾生同一悲仰神通自在方便具足故無剎不現無類不入此等勝用始由修習唯心識觀故得漸斷漸證至最後而得如來身也。",
    "X17n0331_001:0819a14_0": "是故欲得如來身者當遠離陰界入心因緣所作方便生住滅妄想虗偽唯心直進觀察無始虗偽過妄想習氣因三有思惟無所有佛地無生到自覺聖趣自心自在到無開發行如隨眾色摩尼隨入眾生微細之心而以化身隨心量度諸地漸次相續建立是故大慧自悉檀善應當修學。",
    "X17n0331_001:0819a20_0": "此結勸當學也當遠離陰界入等是牒前妄想因緣所作現行及無始虗偽生滅法皆所當離也又言無始虗偽過妄想習氣為三有之因應當唯心直進而觀察也唯心真進是用心之法言唯是一心直進觀察無始流注為三有因如猫捕鼠首尾一直更不當瞻前顧後也又當思惟八地之無相佛地之無生若得成就無相無生二種境界便得到諸佛自覺之趣則無師智自然智一時皆證得心自在不待開發自能興起無功用行如摩尼之現眾色隨諸眾生種種心色而以化身開諸度門隨其心量而度脫之一一皆令從地至地漸次增進入於如來妙莊嚴域而後已其效如此故復叮嚀告誡之曰我此唯心識觀以為法施自利利他最為勝善超出一切法門應當修學勿自怠也故宗鏡云若迷無始即法性而為無明若了即今即無明而為法性法性之與無明遍造諸法名之為染無明之於法性徧應眾緣名之為淨譬如清波濁水濕性不殊清水既由緣而濁濁水亦由緣而清是以三千因果俱名緣起迷悟緣起不離剎那。",
    "X17n0331_001:0819b15_0": "爾時大慧菩薩復白佛言世尊所說心意意識五法自性相一切諸佛菩薩所行自心見等所緣境界不和合顯示一切說成真實相一切佛語心為楞伽國摩羅山海中住處諸大菩薩說如來所歎海浪藏識境界法身。",
    "X17n0331_001:0819b20_0": "此詳問藏識海中生識浪之所以也心意意識五法自性相領前章旨以七種性自性是依他起性是名相如來了之名七種性自性第一義心是正智如如外道迷之成徧計執是妄想故曰五法自性相一切諸佛菩薩所行者領前唯心識觀是諸佛所行境界及法身菩薩所行境界也自心見等所緣境界不和合者領前攝受及攝受者不相應也顯示一切說成真實相者領前真相識也一切佛語心者總領前所說者皆是一切諸佛所談三界唯心之訣也意謂心意意識五法三自性法皆是諸佛菩薩所到境界其要在通達根身器界皆是自心所現若了唯心則根境不偶觸目遇緣無非顯示如來所說圓成真實之相此即三世諸佛遞相授受寂滅一心之玅門也然則識藏瑩湛澄渟本來不動明矣不知此藏識海何故忽生種種識浪又此藏識何故如來歎稱唯是法身菩薩所證境界其餘外道小乘皆有智慧何故不知唯願如來為諸菩薩說其所以。",
    "X17n0331_001:0819c14_0": "爾時世尊告大慧菩薩言四因緣故眼識轉何等為四謂自心現攝受不覺無始虗偽過色習氣計著色性自性欲見種種色相大慧是名四種因緣水流處藏識轉識浪生大慧如眼識一切諸根微塵毛孔俱生隨處境界生亦復如是譬如明鏡現諸色像大慧猶如猛風吹大海水外境界風飄動心海識浪不斷。",
    "X17n0331_001:0819c20_0-0": "此答藏識有四緣而轉生識浪也因上問云藏識海中本來寂靜何故忽生種種識浪故答云由四緣集會皷動藏海藏海雖寂而能隨四種緣生眼識波浪故於藏識水流處遂有轉識浪生也此四緣者若據馬鳴不覺即無明計著即妄心識性即真如色相即境界也故論云云何熏習起染法不斷所謂依真如法故有於無明以有無明染法因故即熏習真如以熏習故則有妄心即第七識也以有妄心即熏習無明不了真如法故不覺念起妄現境界即前五識也以有妄境界染法緣故即熏習妄心令其念著造種種業受於一切身心等苦即意識也有此四緣俱時皷動識海於真常流注湛不搖處遂有眼識浪生眼識既爾則餘根之識亦復如是餘根之識既爾則根身器界乃至最細如微塵毛孔亦復俱時頓現在前若四緣漸次皷動識海則識浪亦漸次生其頓生者如眼識初見色時是圓成現量之境不起分別無處不遍無法不現故論云三者名為現識所謂能現一切境界猶如明鏡現於色像現識亦爾隨其五塵對至即現無有前後以一切法任運而起常在前故漸生者至第二念流入意識而起分別則眼等諸識隨根各了自境先後亦異喻如猛風吹海波浪漸生若據護法自心現攝受不覺者即根緣境緣以能攝受是根所攝受是境此根境二法原從藏識所變內色而有現量比量之別此當四緣之增上緣所緣緣也無始虗偽過色習氣計著習氣即種子無種不生現行故此當四緣之親因緣也識性自性當九緣之分別依染淨依根本依也欲見種種色相當九緣之作意緣也具此四緣故於真常流注湛不搖處而生轉識波浪眼識既假四緣生起餘識亦然推而廣之則大而根身器界小而微塵毛孔莫不皆是藉緣而生但緣有俱不俱故識有頓生漸生之異七八二識行相微細所藉眾緣一切時有故一念動時根境歷然如鏡現像第六麤動而所藉緣無時不具由違緣故有時不具前五轉識行相麤動所藉眾緣時多不具故起時少不起時多故唯識頌云依止根本識五識隨緣現或俱或不俱如波濤依水謂五識身內依本識外隨作意等緣和合方得現前由此或俱或不俱起正如海中波濤隨風鼓動而現多少外境界風飄動心海亦復如是解深密經云如大海水有一浪生緣現前唯一浪轉乃至有多浪生緣現前有多浪轉是也。",
    "X17n0331_001:0820b15_0": "因所作異不異合業生相深入計著不能了知色等自性故五識身轉大慧即彼五識身俱因差別分段相知當知是意識因。",
    "X17n0331_001:0820b18_0-0": "此明現識與分別事識非一異展轉相因起浪不斷也若約馬鳴因指真如所作相即八種識異不異是生滅與不生滅非一非異名阿黎耶識由真如隨緣故異不變故非異合業生相者謂真如與無明業相和合而生能見能現乃至意識種種相也而能見即意根能現即前五識也由第七識內執第八為我深入計著而前五識不能了知色等五塵自性全是藏識所變於是眼得之而為色耳得之而名聲鼻得之而名香舌得之而名味身得之而名觸故五識身轉不知全是自心取自心此即前五因意根而生也然五識身雖各了自分境不起分別不落名言乃復牽引同時意識於五塵上分染分淨生愛生憎計名著相此又五識為意識因也因真如隨緣而成第八黎耶識因黎耶一轉而成能見為轉識即第七識因轉識而生現識即前五識因前五識為因而復引生意識此則性宗八識異不異展轉相因也若據護法因即第八自證分所作相即前七識是見分異不異者謂八種識皆可名心皆可名意皆可名識故非定異而彼行相所依所緣相應各各差別非定不異由彼非一非異故前七轉識合彼業識而各生相分愚夫不了色等自性皆從自證變起猶如幻事而六七二識深生計著以第七唯內門轉故執第八見分為實我實法為非量第六向內外門轉故執第八見相二分以為實我實法為現比非三量而前五識雖外門轉緣境之時得境自性不帶名言無籌度心為現量境然彼意識不能自轉必藉一分同時無分別意識之力然後能轉俱者即同時意識也言前五識藉同時意識而能各了五塵分段差別之境意識藉前五識而能總了五塵差別之境故深密經云若一眼識生緣現前即一意識共彼眼識同時取境若五種識五種生緣一時現前無分別意識即共五識一時取境此雖說前五種識與同時意識展轉為因亦實與七八二識展轉為因蓋五識緣境有五種心一率爾心謂聞法創初遇境便起二尋求心於境未達方有尋求三決定心審知法體而有決定四染淨心法詮欣厭而起染淨五等流心念念緣境前後齊轉決擇論說五識緣境必有一分別意識俱時而轉此眼俱意名率爾初心初卒墮境故此既初緣未知何境為善為惡為了知故次起尋求與欲俱轉希望心故既尋求己識知前境次起決定印解境故既決定已識界差別取正因等相於怨住惡於親住善於中住捨染淨心生由此染淨意識為先引生眼識同性善染順前而起名等流心如眼識生耳識亦爾此則相宗八識展轉因也然性宗立義八識皆能了境而第八了境為細中之細七與前五了境為細中之麤意識了境為麤中之細麤中之麤若我法二執則五八唯法執七唯我執六識執我執法若無相無見無分別無二執者真如也故云五八唯法七唯人六識二執太分明若相宗八五皆緣性境七識唯緣帶質境六識能緣獨影帶質性境若二執則六七二識皆有無我法二執者前五及藏識也(故四五八無法亦無人六七二執甚均平)",
    "X17n0331_001:0820b18_0-1": "。",
    "X17n0331_001:0821a24_0": "彼身轉彼不作是念我展轉相因自心現妄想計著轉而彼各各壞相俱轉分別境界分段差別謂彼轉如修行者入禪三昧微細習氣轉而不覺知而作是念識滅然後入禪正受實不識滅而入正受以習氣種子不滅以境界轉攝受不具故滅。",
    "X17n0331_001:0821b05_0-0": "此通言八識展轉相生而不覺知以明不思議熏變非思量所知也言彼八種識雖展轉相因而意識實不知因五識而轉五識亦不知因七識而轉七識亦不知因八識而轉以彼諸識本無自性各不相知故皆不作是念我展轉相因也但於藏識及藏識所現境界處自其妄想深入計著藏識為自內我者名七識轉故曰自心現妄想計著轉自其不了藏識所現境界而於色等五塵各能了別自分境者名五識轉故曰而彼各各壞相俱轉自其總能分別五塵分段差別相者為同時意識轉故曰分別境界分段差別謂彼轉其實不可知也喻如修滅定者雖以定力制伏前七現行而陀那識中微細習氣流注尚不能知自謂流注識滅而得滅定不知流注識實未曾滅也以微細習氣不滅故流注識亦不滅但是前七現行已伏不流轉境界故稱滅耳然則伏前七者尚不能知況諸識現行未伏而跳梁者可知哉若據護法彼身總指五識身言五識身雖各能了別五塵差別之境彼實不知有同時意識與我展轉相因由第六不了色等五塵是藏識所現而於五塵境界妄起尋求決定染淨等流心妄生計著流轉不停而彼五識各向自分境界與彼同時意識俱轉然則前五分別分段差別境界皆意識之力也而五識不知謂彼自能流轉殊不知有與之俱轉者在也盖五識取境必有所依以五根為俱有依以第六為分別依以第七為染淨依以第八為根本依無此四依必不能轉故復引入滅定者作證言六識麤淺與前五識俱時而轉尚不能知較七八二識極微細者與之俱轉又惡能知哉如修滅定者彼於厭心種上定力伏惑使諸轉識不行而習氣流轉者尚不能知豈況凡夫外道昏昏擾擾者可能知哉則知藏識微細甚深非思量所知矣思量即七識以彼思量為性相思量第八為自內我故不知皆是虗妄計著實非思量可知必思量盡而後藏識顯露可得而知也。",
    "X17n0331_001:0821c16_0": "大慧如是微細藏識究竟邊際除諸如來及住地菩薩諸聲聞緣覺外道修行所得三昧智慧之力一切不能測量決了餘地相智慧巧便分別決斷句義最勝無邊善根成熟離自心現妄想虗偽宴坐山林下中上修能見自心妄想流注無量剎土諸佛灌頂得自在力神通三昧諸善知識佛子眷屬彼心意意識自心所現自性境界虗妄之想生死有海業愛無知如是等因悉以超度是故大慧諸修行者應當親近最勝知識。",
    "X17n0331_001:0822a01_0-0": "此闡明藏識流注是法身菩薩所知境界非二乘跛驢心慧及外道聰明所能測量以二乘外道所得智慧聰明不離湛不搖處尚不能測其邊際豈能決了而親見其境界哉唯除住地菩薩真斷我法二執親證法身者方能知耳其餘三資糧位及四加行菩薩雖未斷惑亦能永伏分別我法二執而以智慧善巧方便觀察名義自性差別此於一僧祗中無量佛所種諸善根善根成熟遠離分別我法二執得證如來平等法身初獲無分別智者亦得知耳既知已即以無分別智宴坐山林觀察微細流注若上品修則頓超十地若中品修則頓超八地若下品修則從地至地漸斷漸證直至十地得見自心微細妄想流注無量剎土諸佛以智慧水一時灌頂授灌頂職得心自在得法自在乃至得如來十力十通十大三昧諸善知識菩薩無量劫中同行願者一時圍繞而為眷屬是修行人以金剛慧即時頓斷生相無明我法二執微細種子及劣無漏善種一時頓淨即得超越心意意識所現之境是相分虗妄之想是見分生死有海即三界之果業愛無知是三界之因此則五住究盡二死永亡直入如來玅嚴果海此等雖是自因之力亦由無量劫中諸善知識外緣熏習之力故成道時諸善知識一時圍繞而為眷屬故起信論云佛法有因有緣因緣具足乃得成辦眾生雖有正因熏習之力若不遇諸佛菩薩善知識等以之為緣欲自斷煩惱入涅槃者則無是處若雖有外緣之力而內淨法未有熏習力者亦不能究竟厭生死苦樂求涅槃若因緣具足者所謂自有熏習之力又為諸佛菩薩慈悲願護故能起厭苦心信有涅槃修習善根以修習善根故善根成熟則值諸佛菩薩示教利喜乃能進趨向涅槃道是故諸修行者應當親近最善知識。",
    "X17n0331_001:0822b09_0": "爾時世尊欲重宣此義而說偈言譬如巨海浪斯由猛風起洪波鼓冥壑無有斷絕時藏識海常住境界風所動種種諸識浪騰躍而轉生青赤種種色珂乳及石蜜淡味眾華果日月與光明非異非不異海水起波浪七識亦如是心俱和合生譬如海水變種種波浪轉七識亦如是心俱和合生謂彼藏識處種種諸識轉謂以彼意識思惟諸相義不壞相有八無相亦無相譬如海波浪是則無差別諸識心如是異亦不可得心名採集業意名廣採集諸識識所識現等境說五。",
    "X17n0331_001:0822b19_0-0": "自譬如巨浪海至非異非不異是總頌外境界風飄蕩心海識浪不斷因所作異不異合業生相也青赤三句喻發識之境藏識如日月諸識如光明藏識與諸識和合非異不異亦如日月與光明和合亦非異不異也自海水起波浪至異亦不可得釋不異也言巨海澄渟本無波浪由猛風吹海故從海水而起波浪遂謂波浪從海水起不知海水實未嘗起波浪也喻藏識海本無轉識波浪由境風飄動識海故從識海而起轉識波浪遂謂識浪從藏海起不知藏海實未嘗起識浪也此明轉識波浪與藏海和合而起故曰心俱和合生故下文云如來藏者與無明七識俱是也變即不思議變之變言海水本不變所以變者皆由種種波浪簸揚故見海水沸騰謂之變耳不知海水雖與波浪和合實未嘗變也喻識海本不變所以變者皆由轉識種種波浪鼓揚故見識海沸騰謂之變不知識海雖與識浪和合俱生實未嘗變也此明藏識由識浪和合而轉生故曰心俱和合生也又復釋之曰前之海水起波浪者謂彼藏識處由不覺而起能見能現種種諸識和合流轉者若海水之起波浪也前之譬如海水變種種波浪轉者謂彼意識現行攀緣六塵境界熏成藏海種子故令藏海不變而變正如波浪之變遂謂海水亦變而海水實未嘗變也是則海水之於波浪和合而生毫無有異離海無波離波無海故不壞之相雖有八種即無相亦無無相況實有差別乎哉正如海水之於波浪本無差別則知諸識本無有異明矣華嚴偈云譬如大海水波濤千萬異水無種種殊諸佛法如是然前云此二壞不壞相此中獨言不壞相有八者何蓋可壞者心相而不壞者心體前言此二壞不壞相展轉因者雙舉八種識皆有壞不壞相也此言不壞相有八者獨顯八種無相之體不壞故曰無相亦無相也然體雖無異而名有可異者以諸識行相緣境各別故就其用處各別而立名亦有差別耳自其集諸種子起諸現行者名之為心自其恒審思量堅守藏識為我者名意此意言廣採集有以藏識如庫藏意如庫吏堅守毫無滲漏有入無出有益無損故曰廣也自其總能了別諸識所識之境者名意識自其各能了別五塵自分之境者名眼等五識故曰因所作相非異不異也。",
    "X17n0331_001:0823a12_0": "爾時大慧菩薩以偈問曰青赤諸色像眾生發諸識如浪種種法云何唯願說。",
    "X17n0331_001:0823a14_0": "大慧不解非異非不異之旨故發此問意謂境為能發識為所發既能發之境不同則所發之識亦異云何乃以波浪喻之且海中波浪本無差別而心名採集業等是有差別今以無差別者喻有差別得無犯法喻不齊之過乎。",
    "X17n0331_001:0823a19_0": "爾時世尊以偈答曰青赤諸雜色波浪悉無有採集業說心開悟諸凡夫彼業悉無有自心所攝離所攝無所攝與彼波浪同受用建立身是眾生現識與彼現諸業譬如水波浪。",
    "X17n0331_001:0823a23_0": "意謂大海本無波浪由境風一吹波浪便起則能發所發二俱無體全體是海則知藏海本無一物故以波浪喻之豈止無差別而已然而復說心名採集業者此是對機說法開悟凡夫由彼凡夫業識茫茫為彼所使六趣三途無處不往不知業相無體雖是自心採集當體元空而實無有一毫採集之相故以波浪喻之令其了知業相空處即是安身立命之地也且根身器界雖是凡夫建立以為真實受用之物謂之性境亦是現識所變如鏡現像尚非實有況彼藏識所起業相皆是妄習所現以為實有耶故我說彼藏識海中現諸業相喻如海水之現波浪耳安有法喻不齊之過哉。",
    "X17n0331_001:0823b11_0": "爾時大慧菩薩復說偈言大海波浪性皷躍可分別藏與業如是何故不覺知。",
    "X17n0331_001:0823b13_0": "意謂大海澄清本無波浪因境界風皷躍而起猶可意度而知若夫藏識所起業相亦因境風飄蕩而有何故非思量所知。",
    "X17n0331_001:0823b16_0": "爾時世尊以偈答曰凡夫無智慧藏識如巨海業相猶波浪依彼譬喻通。",
    "X17n0331_001:0823b18_0": "言此藏識甚深微細唯諸如來及住地菩薩得無分別智者方能知覺凡夫為無明封裹無智慧眼安得知此故假目前易解之物比類以通之耳故曰藏識如海轉相如有風之波業相如無風之浪有風者因鼓躍而可解無風者極流注而難知。",
    "X17n0331_001:0823b23_0": "爾時大慧復說偈曰日出光等照下中上眾生如來照世間為愚說真實已分部諸法何故不說實。",
    "X17n0331_001:0823c01_0": "前已問云何不一切時演說真實義而復為眾生分別說心量意謂如來照世如日麗天高低普映一切平等即使愚夫無慧亦應為彼說真實法今已分部八識諸法何故不為說寂滅一心當下便是得無犯不平等過耶。",
    "X17n0331_001:0823c06_0": "爾時世尊以偈答曰若說真實者彼心無真實譬如海波浪鏡中像及夢一切俱時現心境界亦然境界不具故次第業轉生識者識所識意者意謂然五則以顯現無有定次第譬如工畫師及以畫弟子布彩圖眾形我說亦如是彩色本無文非筆亦非素為悅眾生故綺錯繪眾像言說別施行真實離名字分別應初業修行示真實真實自悟處覺想所覺離此為佛子說愚者廣分別種種皆如幻雖現無真實如是種種說隨事別施設所說非所應於彼為非說彼彼諸病人良毉隨處方如來為眾生隨心應量說妄想非境界聲聞亦非分哀愍者所說自覺之境界。",
    "X17n0331_001:0823c17_0-0": "佛說一切法為度一切心若彼愚夫業識茫茫毫無實心驟而與之說真實法則返致疑不信拂衣而去故不得已為其分部諸法復以海浪鏡像及夢以顯不實令生信解故自其心之現境覺緣皆具無有前後一時俱現名俱時頓生喻如鏡之現像心之現夢設使眾緣有缺境界不具則從業識次第轉生種種識浪謂之漸生喻如海之波浪於是因指業識海中業相次第轉生意識為波浪者以此識總能識前五所識之境故又指業相次第轉生末那意為波浪者以此意思量第八為自內我故又指業相次第轉生前五為波浪者以此五識對現五塵各能了別自分境故豈真有一定次第哉皆是對機說法耳正如畫師及畫弟子布彩圖像此像非彩中有非筆上出非紙上生然而有眾像者是畫師與弟子隨人所好而繪之耳眾像喻八種識彩色筆素喻境界無明真如三種謂此八識求之於境風不可得索之於無明不可得覓之於真如不可得然說三種緣生八種識者亦是如來悅眾生而作是說也故知凡有言說皆是別為中下之機施設若夫真實之法離言說相離名字相其可置之口吻流之齒角哉故以言說法應初機人以真實法示真修士何以故以真實法擬議不得捉摸不得必須真究實參到自悟處則能所忘影像絕心緣離言語斷然後為得也自非上上根人白醭流唇青草生舌單刀直入者無由詣此此真實法所以特為佛子說也若夫愚者智眼不開慧心不朗固當廣為分別此集起者名心此思量者名意此了別六塵自分境者名識而又喻之如鏡中像如海中波如夢中事及彼所現種種境界悉皆如幻雖現而非真實如是開種種識說種種喻無非隨事施設以應其機耳故占察善惡經立二種觀門為鈍根立唯心識觀為利根立真如觀也若所說不應機驟而示以真實法彼則反以我為妄說故不得已而別施權說正如良毉處方隨病授藥若用之當則溲渤亦能愈疾不當則參术亦可殺人故如來說法亦必隨眾生心應所知量然則此真實法深固幽遠即外道二乘聰明智慧尚非其分以是自覺聖智所知境界其可對愚夫妄說哉。",
    "X17n0331_001:0824b08_0": "復次大慧若菩薩摩訶薩欲知自心現攝受及攝受者妄想境界當離羣聚習俗睡眠初中後夜常自覺悟修行方便當離惡見經論言說及諸聲聞緣覺乘相當通達自心現妄想之相。",
    "X17n0331_001:0824b12_0": "此為真實修行者未悟之先示以用心之法也若欲真實自悟能取所取妄想境界悉從自心現者應離羣聚習俗睡眠三種惡緣以羣聚故則易喧囂而難靜寧以習俗故則世情濃而道情少以睡眠故則心志昏而精神怠若離羣聚則獨坐獨行翛然自適離習俗則生處漸生生處漸熟離睡眠則晝三夜三乾乾不息故遺教經云無以睡眠因緣一生空過無所得也此三種緣真學道之大障故當先離修行方便即二卷中四種大方便也常自覺悟者謂二六時中常常省覺勿昧自心也離外道二乘經論者道不欲雜雜則擾動心神故用功時當一字不留眼角一言不著胸中況習之耶既離三種惡緣又離三種經論唯欲真實通達妄想境界皆是自心變現頓開佛慧為期耳故通心論云夫縛從心縛解從心解解縛從心不關餘處出苦之術唯是觀心觀心得悟一切俱了是故智者先當觀心寒山子云男兒大丈夫作事莫莽鹵逕挺鐵石心直取菩提路邪道不用行行之轉辛苦不用求佛果識取心王主若果辦鐵石心安有不通達者乎。",
    "X17n0331_001:0824c08_0": "復次大慧菩薩摩訶薩建立智慧相已於上聖智三相當勤修學何等為聖智三相當勤修學所謂無所有相一切諸佛自願處相自覺聖究竟之相修行得此已能捨跛驢心慧智相得最勝子第八之地則於彼上三相修生。",
    "X17n0331_001:0824c13_0": "此明既悟之後更加鞭策也意謂既通達自心建立智慧相已更當勤學增長智慧不得坐定故云百尺竿頭坐的人雖然得入未為真直須向百尺竿頭更進一步修學一切法門學二乘則不遺其小學佛願始得盡其大學聖智方得造其極具此三相方能負重致遠荷擔大事便能捨離跛驢心慧得入菩薩第八地葢七地已前觀三界生死不定心名跛驢慧以不能行故今見自心建立智慧復以此三相策進方能捨離至第八地無功用行得與自性湊泊者由於彼上聖智三相修行而生。",
    "X17n0331_001:0824c23_0": "大慧無所有相者謂聲聞緣覺及外道彼修習生大慧自願處相者謂諸先佛自願處修生大慧自覺聖智究竟相者一切法相無所計著得如幻三昧身諸佛地處進趣行生大慧是名聖智三相若成就此聖智三相者能到自覺聖智境界是故大慧聖智三相當勤修學。",
    "X17n0331_001:0825a05_0": "無所有相智者即二乘外道所修處生問何故前云當離此云當學前約入觀之初固當用志不分毫芒不著此約觀成之後固當教網齊開纖悉不漏所以在彼時稱為惡見在此時名為聖智故下云為轉彼惡見故應當修學自願處相者學諸佛自利利他二願處修生如華嚴淨行品觸事興願則獲一切勝玅功德法華云我本立誓願欲令一切眾如我等無異是也自覺聖智究竟相者雖學大小諸乘法相而不取法相以能句句消歸自己故得如幻三昧身親到諸佛進趣之地親行諸佛進趣之行處修生即此而觀能融一切惡見經論世諦語言不存法相能到自覺聖智境界者成就三相之力也故結勸當學不然終是路途之樂耳。",
    "X17n0331_001:0825a19_0": "楞伽阿跋多羅寶經合轍卷第一"
}