{
    "X17n0323_005:0198b08_0": "楞伽阿跋多羅寶經通義卷第五",
    "X17n0323_005:0198b09_0": "一切佛語心品第一之三(餘)",
    "X17n0323_005:0198b10_0": "復次大慧愚癡凡夫無始虗偽惡邪妄想之所回轉回轉時自宗通及說通不善了知著自心現外性相故著方便說於自宗四句清淨通相不善分別大慧白佛言誠如尊教惟願世尊為我分別說通及宗通我及餘菩薩摩訶薩善於二通來世凡夫聲聞緣覺不得其短佛告大慧善哉善哉諦聽諦聽善思念之當為汝說大慧白佛言唯然受教佛告大慧三世如來有二種法通謂說通及自宗通說通者謂隨眾生心之所應為說種種眾具契經是名說通自宗通者謂修行者離自心現種種妄想謂不墮一異俱不俱品起度一切心意意識自覺聖境界離因成見相一切外道聲聞緣覺墮二邊者所不能知我說是名自宗通法大慧是名自宗通及說通相汝及餘菩薩摩訶薩應當修學爾時世尊欲重宣此義而說偈言。",
    "X17n0323_005:0198b24_0": "我謂二種通宗通及言說說者授童蒙宗為修行者。",
    "X17n0323_005:0198c01_0": "宗說通相前文言之詳矣而再言者但前通三乘此唯在佛機應不同故前說後宗次則反上又前為眾請此佛自述故有妄想回轉等言以啟其說則知此法在凡未嘗無之但為迷轉故全體不知夫回轉者謂迷自己故回內向外唯著自心現外性相等境界亦著方便言說故於自心宗本離四句所通相而不能了大慧所以因而致請言不得其短若謂宗通說不通其短在化導說通宗不通其短在自行俱通則不得其短也答中言二種法通者謂宗通不過自證法說通則說一心所顯法而以被物者故佛佛所以道同此經所謂法等言眾具契經即前九部攝一切法故曰眾具而卒歸於契理契機是謂契經自證之法本不可說故寄修者以示其相則曰離自心現種種妄想等謂不墮四句則妄想不行妄想不行則超度一切心識到自覺聖境界然則何以示之亦唯曰離因成見相而已凡有為之法可說眾因緣成得有見相今自覺境界則是無為出因緣外非相之相豈有見乎故云離是宜非凡外小聖墮二邊者所知故曰云云偈言童蒙猶初機也其說通所被未必一向初機為對宗通言爾宗通雖為修行若不假說其何以示是宗亦須說皆一往爾所謂信行樂多聞法行宗深觀者是矣。",
    "X17n0323_005:0198c23_1": "○右第十五章。",
    "X17n0323_005:0198c24_0": "爾時大慧菩薩白佛言世尊如世尊一時說言世間諸論種種辯說慎勿習近若習近者攝受貪欲不攝受法世尊何故作如是說佛告大慧世間言論種種句味因緣譬喻採集莊嚴誘引誑惑愚癡凡夫不入真實自通不覺一切法妄想顛倒墮於二邊凡愚癡惑而自破壞諸趣相續不得解脫不能覺知自心現量不離外性自性妄想計著是故世間言論種種辯說不脫生老病死憂悲苦惱誑惑迷亂大慧釋提桓因廣解眾論自造聲論彼世論者有一弟子持龍形像詣釋天宮建立論宗要壞帝釋千輻之輪隨我不如斷一一頭以謝所屈作是要已即以釋法摧伏帝釋釋墮負處即壞其車還來人間如是大慧世間言論因譬莊嚴乃至畜生亦能以種種句味惑彼諸天及阿修羅著生滅見而況於人是故大慧世間言論應當遠離以能招致苦生因故慎勿習近大慧世論者唯說身覺境界而已大慧彼世論者乃有百千但於後時後五十年當破壞結集惡覺因見盛故惡弟子受如是大慧世論破壞結集種種句味因譬莊嚴說外道事著自因緣無有自通大慧彼諸外道無自通論於餘世論廣說無量百千事相無有自通亦不自知愚癡世論。",
    "X17n0323_005:0199a21_0": "夫道有正道有邪道而論有世論有非世論雖不兩立如水火然而亦未甞不竝行於世若薰蕕之同器也故如來誡其慎勿智近大慧因是而問焉答中先斥世論非則曰世間言論不入真實自通謂彼無理可詮故不可與入真實自通之地又言墮於二邊者凡彼宗歸於此而已凡愚癡惑下次明受習之非謂因受習其說以自破壞故有諸趣下諸過失相而後結斥其非云云釋提桓因等引事證失也持龍形象者葢非龍則不能升天故以龍身往求議論建立論宗者凡彼議論必先立宗作是要已要當平呼謂約也即以釋法者還即彼論為難墮負猶言不勝大慧世論下重出彼論建立唯說身覺境界謂陰身覺想境界也雖彼世論乃有百千極其宗旨不離情識豈知有他道哉後五十年破壞結集者按金剛功德施論謂人壽百齡開為二分初分五十教力增強後五十歲教力漸徵言正法欲滅時也或十當為百字之誤也破壞如來結集正教所以為魔外也惡覺因見盛故者謂顛倒惡覺苦因邪見識盛世間故諸惡黨類受習其說自取淪墜也如是大慧下總結過類斥言著自因緣即向說身覺是已而不能以現自通故曰無有自通大率如是而已(一)。",
    "X17n0323_005:0199b19_0": "爾時大慧白佛言世尊若外道世論種種句味因譬莊嚴無有自通自事計著者世尊亦說世論為種種異方諸來會眾天人阿修羅廣說無量種種句味亦非自通耶亦入一切外道智慧言說數耶佛告大慧我不說世論亦無來去唯說不來不去大慧來者趣聚會生去者散壞不來不去者是不生不滅我所說義不墮世論妄想數中所以者何謂不計著外性非性自心現處二邊妄想所不能轉相境非性覺自心現則自心現妄想不生妄想不生者空無相無作入三脫門名為解脫大慧我念一時於一處住有世論婆羅門來詣我所不請空閒便問我言瞿曇一切所作耶我時報言婆羅門一切所作是初世論彼復問言一切非所作耶我復報言一切非所作是第二世論彼復問言一切常耶一切無常耶一切生耶一切不生耶我時報言是六世論大慧彼復問我言一切一耶一切異耶一切俱耶一切不俱耶一切因種種受生現耶我時報言是十一世論大慧彼復問言一切無記耶一切記耶有我耶無我耶有此世耶無此世耶有他世耶無他世邪有解脫耶無解脫耶一切剎那耶一切不剎那耶虗空耶非數滅耶涅槃耶瞿曇作耶非作耶有中陰耶無中陰耶大慧我時報言婆羅門如是說者悉是世論非我所說是汝世論我唯說無始虗偽妄想習氣種種諸惡三有之因不能覺知自心現量而生妄想攀緣外性如外道法我諸根義三合知生我不如是婆羅門我不說因不說無因唯說妄想攝所攝性施設緣起非汝及餘墮受我相續者所能覺知大慧涅槃虗空滅非有三種但數有三耳。",
    "X17n0323_005:0199c23_0": "次顯正教於中初大慧反問如來亦同世說凡二難如為異方諸天人眾廣說諸法則隨他意語豈亦非自通義又何以異於外道智慧言說數邪如文云云答中先拂初難云我不說世論葢世論者說來去佛唯說不來不去故曰來者趣聚會生等謂來者趣聚義則緣會而生去者散壞義則緣散而滅佛說異是故不來不去即不生不滅乃我所通酬次難云不墮世論妄想數者即二邊是妄想數故徵釋云謂不計著外性非性自心現處則不著二邊以不著故二邊妄想所不能轉相境非性非性即空何轉之有覺自心現故則自心現妄想不生者既了自心復何所生是則心不自生心心不自轉心心不自著心豈復自心墮於自心邪故妄想不生者則順於空相入三解脫門是豈與外道同哉次正引論廣辨邪正則曰我念一時等不請空閒者空閒猶間隙也當是請問之儀如禮有請問之語是也而彼不請卒然有問所以責之也彼問雖多槩以一世論報之所以拒之也如是說者悉是世論則率由情見所以抑之也又曰非我所說是汝世論所以外之也我唯說下即佛自示正教不出三道因果謂無始虗偽等煩惱也種種諸惡之因業也三有苦也及迷心起妄攀緣外性等斯皆內教正因緣之說非外道所知又曰如外道法者重舉彼計以格其說言我諸根義三合知生者按唐譯則我及根境合故有於知生知即識也或說以為因或說無因等佛皆異其說曰我不說因不說無因唯說妄想攝所攝性等夫言施設緣起則未甞無因言妄想則未甞有因但不如彼說有即常說無即斷故曰非汝及餘墮受我見相續者所能覺知則邪正於是別矣受我見者或本無見字謂由受有我由我故受展轉相續皆外道見言涅槃虗空滅等文似孤然因上外道亦問此故何為亦世論邪故釋云爾無為之法本實非三彼以數問亦世論也(二)。",
    "X17n0323_005:0200b09_0": "復次大慧爾時世論婆羅門復問我言癡受業因故有三有耶為無因耶我時報言此二者亦是世論耳彼復問言一切性皆入自共相耶我復報言此亦世論婆羅門乃至意流妄計外塵皆是世論復次大慧爾時世論婆羅門復問我言頗有非世論者不我是一切外道之宗說種種句味因緣譬喻莊嚴我復報言婆羅門有非汝有者非為非宗非說非不說種種句味非不因譬莊嚴婆羅門言何等為非世論非非宗非非說我時報言婆羅門有非世論汝諸外道所不能知以於外性不實妄想虗偽計著故謂妄想不生覺了有無自心現量妄想不生不受外塵妄想永息是名非世論此是我法非汝有也婆羅門略說彼識若來若去若死若生若樂若苦若溺若見若觸若著種種相若和合相續若愛若因計著婆羅門如是比者是汝等世論非是我有大慧世論婆羅門作如是問我如是答彼即點然不辭而退思自通處作是念言沙門釋子出於通外說無生無相無因覺自妄想現相妄想不生。",
    "X17n0323_005:0200c03_0": "彼復挾佛二三義為問使佛以實告則墮彼問矣故亦以世論杜其辭乃至曰意流妄計外塵皆是世論此則齊彼所知凡意識流動隨塵計著無問邪正皆為世論使彼不得問所以杜之也彼論既窮於是始有非世論之請如來言有而非汝有直為異之之論所以啟之也一一皆言非等所以對外言也是終未與說實及其再請而曰非非宗者謂何等為非非宗非非說者意指今宗說言也乃復抑之非汝所知以其於外法妄想計著不唯不能信入亦復隨語生解起請見過所以難之也不得已而後為說亦不過謂妄想不生等凡以二義故謂覺了有無無非自心現量則妄想不生不受外塵故則妄想永息永息猶不生也是即非世論始知三世諸佛初無一法與人但令妄想不生則天真妙性不遠而復皆自己有且曰此是我法非汝有者亦所以奪之也因說彼所有者則曰略說彼識若來若去等謂有如是種種異相溺謂陷溺不能自出之謂餘皆可知然則識相無性而計有去來等故知其妄也然以各不相有則彼此一爾而有真妄虗實所以異也彼論既屈負慚而退亦不暇辭耳且言思自通處又曰出於通外者此皆外道退而有言以佛所說求諸己而不得始知佛說出於自通之外而曰說無生無相等觀其所領亦足見其曉悟矣(三)。",
    "X17n0323_005:0201a03_0": "大慧此即是汝向所問我何故說習近世論種種辯說攝受貪欲不攝受法大慧白佛言世尊攝受貪欲及法有何句義佛告大慧善哉善哉汝乃能為未來眾生思惟諮問如是句義諦聽諦聽善思念之當為汝說大慧白佛言唯然受教佛告大慧所謂貪者若取若捨若觸若味繫著外塵墮二邊見復生苦陰生老病死憂悲苦惱如是諸愚皆從愛起斯由習近世論及世論者我及諸佛說名為貪是名攝受貪欲不攝受法大慧云何攝受法謂善覺知自心現量見人無我及法無我相妄想不生善知上上地離心意意識一切諸佛智慧灌頂具足攝受十無盡句於一切法無開發自在是名為法所謂不墮一切見一切虗偽一切妄想一切性一切二邊大慧多有外道癡人墮於二邊若常若斷非黠慧者受無因論則起常見外因壞因緣非性則起斷見大慧我不見生住滅故說名為法大慧是名貪欲及法汝及餘菩薩摩訶薩應當修學爾時世尊欲重宣此義而說偈言。",
    "X17n0323_005:0201a20_0": "一切世間論外道虗妄說妄見作所作彼則無自宗唯我一自宗離於作所作為諸弟子說遠離諸世論心量不可見不觀察二心攝所攝非性斷常二俱離乃至心流轉是則為世論妄想不轉者是人見自心來者謂事生去者事不現明了知去來妄想不復生有常及無常所作無所作此世他世等斯皆世論通。",
    "X17n0323_005:0201b02_0": "三結指所答云云大慧因問攝受貪欲等義答中以取舍等為貪貪即惑也以貪故繫著外塵等業也復生苦陰等報也皆以愛為本愛復由習近世論及世論者者則人也皆能攝令生貪故云攝受貪欲不攝受法左右異言爾而請中有及法之言故復告其所以攝受法者即善覺知自心現量等此以知諸法門為法又曰不墮一切見等則以離妄為法竝義如前釋然則覺法由於離妄離妄必由覺法文雖竝出旨實互顯多有外道癡人者因斥凡墮邊見者皆愚人法非黠慧者意令聞而自化受無因論則起常見者謂四大性常不假因成故成常見或見外因壞滅計因緣非性則成斷見又曰我不見生住滅故則生而無生滅而無滅反上斷常是亦名法偈初四句通頌世論計作所作而不知唯自心量故無有自宗佛法異彼則曰唯我一自宗謂唯以自心為宗則一切皆法自心量故離作所作等諸世論計心量不可見者惟其自心性離故不可以有無見不可以能所攝則不觀察有無二心了攝所攝非性出於斷常故得以流轉者皆為世論唯不隨妄想轉者名見自心若見自心心實非見以此為宗宗亦非宗所謂唯一真如智獨存者斯得之矣故曰來者謂事生等謂事之來去自彼來去而此心不動如鏡之現象象有生滅而明未甞動惟其出於來去者然後乃知來來者不來去去者不去雖或來去而不為來去所轉則妄想不復生矣凡自心外有常無常等諸差別見者皆世論通非佛法也(四)。",
    "X17n0323_005:0201c04_1": "○右第十六章。",
    "X17n0323_005:0201c05_0": "爾時大慧菩薩復白佛言世尊所言涅槃者說何等法名為涅槃而諸外道各起妄想佛告大慧諦聽諦聽善思念之當為汝說如諸外道妄想涅槃非彼妄想隨順涅槃大慧白佛言唯然受教佛告大慧或有外道陰界入滅境界離欲見法無常心心法品不生不念去來現在境界諸受陰盡如燈火滅如種子壞妄想不生斯等於此作涅槃想大慧非以見壞名為涅槃。",
    "X17n0323_005:0201c13_0": "有以色心轉變至於無變名為涅槃辨二乘之所得又以妄想識滅為涅槃斥外道之所計則既明矣大慧復有所請者惟恐理未盡明見未盡破一為所惑墮於邪見則究竟解脫之道無上涅槃之城反致侵毀法身慧命不得而立此聖人之所憂而不可不辨者文曰或有外道陰界入滅等作涅槃想者按提婆論釋凡二十種計此當第一小乘外道論論曰諸受陰盡如燈滅種壞風止名涅槃今文則又曰境界離欲等謂於六塵無染故曰離欲見諸法無常故不起心心數法以不念過現等境故諸受陰盡如燈滅種壞受滅則想滅故曰妄想不生且約滅想云爾其實見想不除故斥曰非以見壞為涅槃是猶在見中亦可以此總破諸見所以為非一也(一)。",
    "X17n0323_005:0202a03_0": "大慧或以從方至方名為解脫境界想滅猶如風止或復以覺所覺見壞名為解脫或見常無常作解脫想或見種種相想招致苦生因思惟是已不善覺知自心現量怖畏於相而見無相深生愛樂作涅槃想或有覺知內外諸法自相共相去來現在有性不壞作涅槃相或謂我人眾生壽命一切法壞作涅槃想或以外道惡燒智慧見自性及士夫彼二有間士夫所出名為自性如冥初比求那轉變求那是作者作涅槃想或謂福非福盡或謂諸煩惱盡或謂智慧或見自在是真實作生死者作涅槃想或謂展轉相生生死更無餘因如是即是計著因而彼愚癡不能覺知以不知故作涅槃想或有外道言得真諦道作涅槃想或見功德功德所起和合一異俱不俱作涅槃想或見自性所起孔雀文彩種種雜寶及利刺等性見已作涅槃想大慧或有覺二十五真實或王守護國受六德論作涅槃想或見時是作者時節世間如是覺者作涅槃想或謂性或謂非性或謂知性非性或見有覺與涅槃差別作涅槃想。",
    "X17n0323_005:0202a21_0": "此下凡二十一計或云涅槃或云解脫並同出異名或義有同異(云云)言從方至方者論云第二外道說最初有方從方生世間及人從人生天地次第滅沒還入彼處說方是常名為涅槃因今謂方猶方所亦彼此也而趣方者不失自性云爾又曰境界想滅猶如風止則無迹而已據論合在上種滅文下文差互耳舊或以此句當風仙外道計風能生殺萬物說風為常是涅槃者意全不類豈必然乎凡後有名相與論絕不類者例是不必對會也或復以覺所覺見壞為解脫者凡外道曰覺多謂覺想彼復不存能所之異故曰見壞而猶有壞者未離想故或見常無常者按論謂是外道說其師云伊賖那形相不可見遍一切處而能生一切物即賖那是常名為涅槃所生之物即名無常或見種種相想招致苦生因等是以相想而為苦因不知相即自心現量捨相而著無相見者或見內外等法有自共相三世之異別計性不壞作涅槃者或謂於我人眾生等一切假實法壞而作想者此雖計壞而非無我人眾生壽者見既不破亦邪計爾或以外道惡燒智慧者先出彼非相義通文別則是以惡見火燒滅正智也見自性及士夫彼二有間者間當去呼猶間異也謂自性即士夫所從出言其有能所之間故曰士夫所出名為自性如冥初生覺之比一往引同非即彼計彼計如後又曰求那轉變等謂求那有自性有所依所依諸緣則有轉變而求那自性即是作者計此不變作涅槃想惑謂福非福盡者皆指盡處作涅槃見或謂諸煩惱盡等者按論本一計謂是外道說煩惱盡依智名涅槃或見自在等論云自在天能造作眾生及一切物又言我造一切物於一切法中勝是我能作生名常是涅槃因即此計也或謂展轉相生故有生死無別有因者曾不知如是計著是即生死之因而彼愚不覺以不知故計無因作涅槃想或言得真諦道者僧佉論師說二十五諦自性因生諸眾生自性是常名涅槃因論又云於中隨何等性修行如實證知自性生還入自性能離一切生死等按論是僧佉釋亦未可憑據後經文自有覺二十五諦真實之言真實豈非諦義安得於此互出之邪況論却無後段經文驗是二十五諦即其計也而言得真諦道者此亦外道常語爾如冥諦等亦名諦故又曰瞿曇雖神不如我道真但以佛教望之非真諦爾或見功德者論亦曰作所作和合等凡外道所謂功德多指苦行仍於所起和合處作四句見計著或見自性所起如孔雀文采者論謂無因論師作如是說等謂皆出於自然不由造作計自然性為是者此下間大慧字未詳或恐是外道之宗故更端言之不然則多爾二十五真實者真實即諦義如前冥初生覺次第轉生二十五諦即其相也(名義別出)或王守護國土受六德論者(六德義如別出)此或以能安世諦為涅槃或見時是作者時謂時節以世間作必依時時有變遷而作者不異如是而覺者論亦曰時論師說時是常能生一切物等是也或謂性等性即是有謂如地水火風等物各有其性能生萬物或物即是性非性則無物謂反上性等如虗空如萬物之因性非性則兼有無言之謂是外道說本無物而有水生從水生一切物等即其計也或見有覺與涅槃差別而作想者若見有異何從作想是應以前諸計多計覺等為涅槃此復見其異相故翻前計於所異處作涅槃想大略如此餘有同異須者檢之雖是外計亦須文理粗通可也(二)。",
    "X17n0323_005:0203a10_0": "有如是比種種妄想外道所說不成所成智者所棄大慧如是一切悉墮二邊作涅槃想如是等外道涅槃妄想彼中都無若生若滅大慧彼一一外道涅槃彼等自論智慧觀察都無所立如彼妄想心意來去漂馳流動一切無有得涅槃者大慧如我所說涅槃者謂善覺知自心現量不著外性離於四句見如實處不墮自心現妄想二邊攝所攝不可得一切度量不見所成愚於真實不應攝受棄捨彼已得自覺聖法知二無我離二煩惱淨除二障永離二死上上地如來地如影幻等諸深三昧離心意意識說名涅槃大慧汝及餘菩薩摩訶薩應當修學當疾遠離一切外道諸涅槃見。",
    "X17n0323_005:0203a22_0": "結斥文凡五非言不成所成者惟其皆妄想故雖計涅槃而不成所成之涅槃前文所謂非彼妄想隨順涅槃故為智者所棄一也又曰如是一切悉墮二邊者二也又彼雖妄計生滅而實彼法何曾生滅三也然彼皆邪論正智觀之本無成立四也抑又以彼心想流動乖涅槃性是故無有得涅槃者五也並如文云云以是辨之足顯其妄如我所得下對邪顯正其文亦五謂善覺知自心現量不著外性一也離於四句見如實處二也不墮自心現妄想二邊則攝所攝不可得三也一切度量不見所成顯今涅槃出眾邪外四也愚於真實不應攝受者謂凡迷實理隨有所見不應攝受而亦不自攝受則一切無著五也亦可反上五義對之可見(云云)由是言之凡彼蔽涅槃者皆當棄去故曰棄捨彼已彼得自覺聖法則無上玅心理當自顯所謂常樂我淨以至恒沙性淨功德亦是對妄強名究竟言之本無一法若有所得即非涅槃又由自他俱離方證無得之得知二無我等即所證覺法也義見上解得如幻影等諸深三昧離心意意識皆所以顯涅槃者若夫克論所渭涅槃則非證非非證非得非非得非離非非離玅絕百非咸亡四性如是安住是為究竟祕密理藏也(三)。",
    "X17n0323_005:0203b20_0": "爾時世尊欲重宣此義而說偈言。",
    "X17n0323_005:0203b21_0": "外道涅槃見各各起妄想斯從心想生無解脫方便愚於縛縛者遠離善方便外道解脫想解脫終不生眾智各異趣外道所見通彼悉無解脫愚癡妄想故一切癡外道妄見作所作有無有品論彼悉無解脫凡愚樂妄想不聞真實慧言語三苦本真實滅苦因譬如鏡中像雖現而非有於妄想心鏡愚夫見有二不識心及緣則起二妄想了心及境界妄想則不生心者即種種遠離相所相事現而無現如彼愚妄想三有唯妄想外義悉無有妄想種種現凡愚不能了經經說妄想終不出於名若離於言說亦無有所說。",
    "X17n0323_005:0203c08_0": "偈頌為二初凡四偈並言外計無有解脫而其義有四一者不出想心二者不善方便三者一依癡想四者妄見有無由是言之所謂解脫本無有法但離癡想等斯為解脫爾次言凡愚唯著妄想與上互顯其意初四句法不出妄想真實謂妄想出於言語故為三苦本真實反於妄想故為滅苦因然則言語真實復何與焉但由凡迷自生向背故今示之意令眾生反迷歸悟也譬如鏡中象下別舉譬顯即鏡以喻心象以喻境現而非有其妄可知了境即心鏡象不二而言愚夫見有二者謂心境之二也不識心及緣者緣亦境也以不識故謂心與境異是心與境皆起妄則二妄想也了則不二故妄想不生心即種種故無別所相事現而無現等合上鏡象四句也三有唯妄想者一妄想外更無有法經經說妄想終不出於名一假名外亦無有說無說則無法然則妄想一出於心解脫亦從心得解不自解由縛而有解縛不自縛因心而成縛若達心性本空則縛與縛者當處解脫惟其不了但增妄想究而言之唯一心法翻覆而已矣斯皆如來示人令從省要處悟入也(四)。",
    "X17n0323_005:0204a03_1": "○右第十七章。",
    "X17n0323_005:0204a05_0": "楞伽阿跋多羅寶經卷第三竟",
    "X17n0323_005:0204a06_0": "楞伽阿跋多羅寶經卷第四",
    "X17n0323_005:0204a07_0": "一切佛語心品第一之四",
    "X17n0323_005:0204a08_0": "爾時大慧菩薩白佛言世尊惟願為說三藐三佛陀我及餘菩薩摩訶薩善於如來自性自覺覺他佛告大慧恣所欲問我當為汝隨所問說大慧白佛言世尊如來應供等正覺為作耶為不作耶為事耶為因耶為相耶為所相耶為說耶為所說耶為覺耶為所覺耶如是等辭句為異為不異佛告大慧如來應供等正覺於如是等辭句非事非因所以者何俱有過故大慧若如來是事者或作或無常無常故一切事應是如來我及諸佛皆所不欲若非所作者無所得故方便則空同於兔角槃大之子以無所有故大慧若無事無因者則非有非無若非有非無則出於四句四句者是世間言說若出四句者則不墮四句不墮四句故智者所取一切如來句義亦如是慧者當知。",
    "X17n0323_005:0204a22_0": "佛固不易聞見而知佛益難大慧於是清說三藐三佛陀此言正徧知又曰善於如來自性自覺覺他自性謂法身也知覺理一故得互顯文因明涅槃而來亦為後世欲善知佛者請凡約六義謂作不作等作謂修治造作義該因果故繼之事因事即果也不作則非事非因故略不言亦與下答文互出相謂身相言說覺知也竝以理性為所相等如是辭句為異為不異者謂如來自性於作不作等辭句為異不邪答中先酬所問直言非事非因即非因非果也準後徵釋應云非作非不作亦可言非則不作義因果則作義故得兼之言俱有過者不直遮事因而已正言如來若唯事因則墮作過若非事因墮無所有過方盡文旨先以非事覈事則曰若如來是事等謂若如來定須因果等事則同作法作則無常同一切事故曰一切事應是如來佛亦不欲是佛不許同彼事也理而言之方復求同一切法不可得況不欲乎亦且一往覈非云爾舉果知因故略不言因次以事覈非事則曰若非所作等即覈上非事非因句異其言爾故以方便對言之謂非所作則無所得無所得則福智方便皆為徒施故方便則空同於兔角槃大之子謂石女兒也由是言之自性法身克體則不當因果脩顯則非無事因是謂非有事因非無事因則非有非無文偏言者亦略如向說言四句是世間言說者謂有無等四句若出四句則不墮有無等戲論是智者所取即是如來法身句義也(一)。",
    "X17n0323_005:0204b24_0": "如我所說一切法無我當知此義無我性是無我一切法有自性無他性如牛馬大慧譬如非牛馬性非馬牛性其實非有非無彼非無自性如是大慧一切諸法非無自相有自相但非無我愚夫之所能知以妄想故如是一切法空無生無自性當如是知如來如是與陰非異非不異若不異陰者應是無常若異者方便則空若二者應有異如牛角相似故不異長短差別故有異一切法亦如是大慧如牛右角異左角左角異右角如是長短種種色各各異大慧如來於陰界入非異非不異如是如來解脫非異非不異如是如來以解脫名說若如來異解脫者應色相成色相成故應無常若不異者脩行者得相應無分別而脩行者見分別是故非異非不異如是智及爾燄非異非不異。",
    "X17n0323_005:0204c14_0": "前約法身自性相非異非不異則通而且總故次具明三德仍對陰等言之方極其致初法身文先舉一切法無我句以立法身義本因自釋云無我性是無我謂無我之我即真我也故自真我言之則曰自性以無妄我言之則曰無我性故曰一切法有自性無他性知一切法是法身自性則無妄矣然復應知自性有二謂獨一絕待之自性此生佛所同有自他形對之自性則生佛所異今當初義故非對他而曰無他性者此方對自之他言他則其自可知故知兩句各有所屬如牛馬者譬顯也葢牛性柔馬性剛而不相有故曰譬如非牛馬性非馬牛性正言非牛則馬性非馬則牛性而一有一無故曰其實非有非無彼雖互無而一知之性不異則又曰彼非無自性類法可知因復例相亦曰一切法非無自相有自相謂非無諸法之自相亦有法身之自相如是二相不相傾奪未始隱覆但非凡小愚夫所知此言無我者謂無真我之愚夫也如是一切法空等例上無我示諸異名皆如來自性亦當如是知之次對五陰正明非異非不異夫陰即苦道與夫法身的相翻對若知不即不離不合不散則陰體本融即是法身不得轉除也於中先立次覈三結言方便則空者謂法身本無相方便則有相若異陰者則無方便應應之相是則非異非不異又曰若二者應有異覆示上二義不應復異異則不成非異非不異也故就牛角開二喻示之初異牛角似喻喻一切法異而法身性同故曰一切法亦如是次一牛異角喻喻法身本一而諸法宛然如是長短種種色異者亦猶左右角之不同也結文可知解脫中亦先立如來以解脫名說者即解脫是如來異名亦佛之大用故對色相明之若如來異解脫者應色相是如來非解脫也若色相所成則應無常若不異者如修行者得解脫相應無人法之異若亦見有分別異者則不可云一而特以修行對覈者以因顯果亦一往爾般若與爾燄約智障相翻言之文但標例而已准義應云若異則離障無智如離水無水若不異則障豈即智而理須融氷亦非異非不異可以意得(二)。",
    "X17n0323_005:0205b04_0": "大慧智及爾炎非異非不異者非常非無常非作非所作非有為非無為非覺非所覺非相非所相非陰非異陰非說非所說非一非異非俱非不俱非一非異非俱非不俱故悉離一切量離一切量則無言說無言說則無生無生則無滅無滅則寂滅寂滅則自性涅槃自性涅槃則無事無因無事無因則無攀緣無攀緣則出過一切虗偽出過一切虗偽則是如來如來則是三藐三佛陀大慧是名三藐三佛陀佛陀大慧三藐三佛陀佛陀者離一切根量爾時世尊欲重宣此義而說偈言。",
    "X17n0323_005:0205b14_0": "悉離諸根量無事亦無因已離覺所覺亦離相所相陰緣等正覺一異莫能見若無有見者云何而分別非作非不作非事亦非因非陰非在陰亦非有餘雜亦非有諸性如彼妄想見當知亦非無此法法亦爾以有故有無以無故有有若無不應受若有不應想或於我非我言說量留連沉溺於二邊自壞壞世間解脫一切過正觀察我通是名為正觀不毀大導師。",
    "X17n0323_005:0205b21_0": "所以三皆非異非不異者以其性融而理一也一故中中故妙妙故離四句言說故復例通而結成之則曰非常非無常等總不出非二邊顯中道非能所顯一相非四句顯亡言仍間雜不次所以彰法門混融無決定也至於結成理性則曰離一切量等夫離諸言量則無生寂滅自性涅槃而已矣既彰理性乃復宗結示曰無事無因等唯一法身逈然獨立不見諸法為所攀緣故出過一切虗偽名為如來三藐三佛陀重言佛陀者翻知覺之異雙結上二名也言至於此可謂極矣而復疊云離一切根量者總酬所問旨歸法身自性也偈言悉離諸根量等疊頌上諸文總顯一離相陰緣等正覺者陰即五陰緣謂界入等攀緣之緣並對法身正覺言非一異而莫能見因起後難釋故曰若無有見者難也意謂既一切悉離則都無所有於何分別非作非不作等言有餘雜則不一義也亦非有諸法自性如彼妄想見者是以其所離還難自所分別宜莫能解者當知亦非無等釋也謂雖離謂相而亦非無所分別以其法法自爾故故曰以有故有無等是則有不別有有其所無無不別無無其所有是應云以無故無有文言有有者或別有意故雖有分別而不妨離相仍遮其非曰若無不應受受則有矣若有不應想想則著矣若受若想皆於法爾上加之情見所以非也或於我非我等總反斥彼著以我非我有無言量留連沉溺著於二邊增損世諦是為自壞壞世間也解脫一切過者頌上佛陀離一切根量之過亦反上沉溺之失得正觀察乃我所通反顯有無不名正觀不毀大導師者毀猶謗也否則謗矣(三)。",
    "X17n0323_005:0206a01_1": "○右第一章。",
    "X17n0323_005:0206a02_0": "爾時大慧菩薩復白佛言世尊如世尊說修多羅攝受不生不滅又世尊說不生不滅是如來異名云何世尊為無性故說不生不滅為是如來異名佛告大慧我說一切法不生不滅有無品不現大慧白佛言世尊若一切法不生者則攝受法不可得一切法不生故若名字中有法者惟願為說佛告大慧善哉善哉諦聽諦聽善思念之吾當為汝分別解說大慧白佛言唯然受教佛告大慧我說如來非無性亦非不生不滅攝一切法亦不待緣故不生不滅亦非無義大慧我說意生法身如來名號彼不生者一切外道聲聞緣覺七住菩薩非其境界大慧彼不生即如來異名。",
    "X17n0323_005:0206a14_0": "經教言不生不滅者多矣而所以用義詮旨則有同異不可不審也大慧於是以彼兩端申一疑請為皆無性義邪抑為異名別有義乎佛答以不生不滅則不有不無故曰有無品不現所以拂彼之見而教旨異名兩得之矣而大慧以謂不現者不生也即攝受一切法不可得則無而已矣故曰一切法不生故是直以不生無性義領之故復請異名中別有法義答中亦先拂彼見言我說如來非無性者正言異名非謂無性又曰亦非攝一切法者拂上次領義也亦不待緣者謂非待生滅而言不生不滅則逆其意以遮之也亦非無義起後正答也則曰我說意生法身如來名號者其文猶略具應云我說不生不滅即不生義不生而生則一切法身異名皆從此出故曰意生法身如來名號始得疊云彼不生者等不然則此一句全無生起但此不生異乎大慧所領之不生將顯一切法皆趣不生是如來境界故曰一切外道乃至七住菩薩非其境界七住即七地未得無生故非其境界即其為八地無生也可知矣故結答中以不生為如來異名即不生不滅名偏義圓其理一也(一)。",
    "X17n0323_005:0206b10_0": "大慧譬如因陀羅釋迦不蘭陀羅如是等諸物一一各有多名亦非多名而有多性亦非無自性如是大慧我於此娑呵世界有三阿僧祗百千名號愚夫悉聞各說我名而不解我如來異名大慧或有眾生知我如來者有知一切智者有知佛者有知救世者有知自覺者有知導師者有知廣導者有知一切導者有知仙人者有知梵者有知毗細者有知自在者有知勝者有知迦毗羅者有知真實邊者有知月者有知日者有知主者有知無生者有知無滅者有知空者有知如如者有知諦者有智實際者有知法性者有知涅槃者有知常者有知平等者有知不二者有知無相者有知解脫者有知道者有知意生者大慧如是等三阿僧祗百千名號不增不減此及餘世界皆悉知我如水中月不出不入彼諸愚夫不能知我墮二邊故然悉恭敬供養於我而不善解知辭句義趣不分別名不解自通計著種種言說章句於不生不滅作無性想不知如來名號差別如因陀羅釋迦不蘭陀羅不解自通會歸終極於一切法隨說計著。",
    "X17n0323_005:0206c04_0": "此下引譬示異名義如是等諸物者謂帝釋所住地及虗空乃至手足各隨其物以彰異號是以帝釋有多種名人只是一故無多性而隨物顯義故非無自性譬佛亦爾故曰我於是娑呵世界等凡列三十三名(恐煩不釋)始言愚者悉聞各說我名謂名各有義也而不解我如來異名則不知其體一本於不生不滅也又曰皆悉知我等即智者能知如水中月不出不入謂虗空之月如法身應於眾生心水而現如應身而影不離水故不出亦不外來故不入不入故不生不出故不滅以喻顯法其理如之此猶分喻不可守喻而害法也可以意知彼諸愚夫等覆釋彼不知者由墮二邊故昧於不生不滅中道應本亦如世人或以著相見佛或謂佛無形相是皆墮於二邊雖亦供養豈識所以真佛者哉而不善解下凡列三失謂不善解知辭句義趣一也不分別名二也不解自通三也計著種種言說等釋三失也於不生不滅作無性想者正釋不善解知不生義趣但成無法而已亦結斥前所領也釋不解自通言會歸終極者即自性法身一也是亦不能反諸自己之謂(二)。",
    "X17n0323_005:0206c24_0": "大慧彼諸癡人作如是言義如言說義說無異所以者何謂義無身故言說之外更無餘義唯止言說大慧彼惡燒智不知言說自性不知言說生滅義不生滅大慧一切言說墮於文字義則不墮離性非性故無受生亦無身大慧如來不說墮文字法文字有無不可得故除不墮文字。",
    "X17n0323_005:0207a06_0": "因上言義示有得失初言一向失則曰義如言說等夫義有二種謂言下之義有體上之義此知言下之義而已言外無餘義故謂義如其說無別義身身猶體也則無身為失而不知體上之義出於言外則是惡見燒滅正智不知言說自性妄想言有生滅而義無生滅詎得一之邪直如言下之義苟得其趣亦不專言說如淨名說苦空無常義云諸法畢竟不生不滅是無常義等又如菴提遮女經說生死義云生以不生生為義等是皆言下義趣亦何甞局於言說哉次明有墮不墮謂依言說則墮得義則不墮初文者凡諸言說未有不出文字法者縱謂無文字可說苟如言生著是亦墮也惟義則不墮即體上之義其理常融出於有無之外故曰離性非性故反顯言說由文字出則有所從生有生則有身義則不然故無受生亦無身則無身為得故與前異如來不說墮文字法者謂佛未甞著文字相而有所說以其於文字有無了不可得故下文所謂法離文字是也然則如來果無說邪則曰除不墮文字但不著文字有無二邊而為眾生故亦說一切法則又曰非不饒益義說是也抑以所說言之則說有說無者墮也說中道義者不墮也使隨言取著雖中亦墮如以對治說有無而知通變者則未始墮也(三)。",
    "X17n0323_005:0207b05_0": "大慧若有說言如來說墮文字法者此則妄說法離文字故是故大慧我等諸佛及諸菩薩不說一字不答一字所以者何法離文字故非不饒益義說言說者眾生妄想故大慧若不說一切法者教法則壞教法壞者則無諸佛菩薩緣覺聲聞若無者誰說為誰是故大慧菩薩摩訶薩莫著言說隨宜方便廣說經法以眾生希望煩惱不一故我及諸佛為彼種種異解眾生而說諸法令離心意意識故不為得自覺聖智處。",
    "X17n0323_005:0207b14_0": "此下反釋證成也言法離文字者謂如來所證之法本來離相故不著文字說亦不著無文字說所以言不說不答一字者良在於此然以不離而離離彼著相之文字離而不離即文字非文字非文非不文非字非不字則文字當體性離而已淨名所謂文字性離即是解脫無離文字說解脫也是即與離理一義殊故知法理常融人自固執離尚不可況取著乎非不饒益義說者即上除不墮文字但有饒益皆可說也所以必由言說者以眾生妄想希望言說故如來依之以治妄病妄病若盡言說自亡然不可以妄想而廢言說故曰教法則壞誰說為誰者誰即彼我求實之謂若都無有則誰為能度誰為所度而建立機教哉是說與不說各有其致但隨語生解則為不善故誡其莫著言說言令離心意意識故不為得自覺聖智處者蓋妄想心識可使之離而自覺聖智處不可使之得要須自證非言為所及所謂但盡凡情無別聖解又曰凡情盡處聖解卓然斯言近之矣(四)。",
    "X17n0323_005:0207c08_0": "大慧於一切法無所有覺自心現量離二妄想諸菩薩摩訶薩依於義不依文字若善男子善女人依文字者自壞第一義亦不能覺他墮惡見相續而為眾說不善了知一切法一切地一切相亦不知章句若善一切法一切地一切相通達章句具足性義彼則能以正無相樂而自娛樂平等大乘建立眾生大慧攝受大乘者則攝受諸佛菩薩緣覺聲聞攝受諸佛菩薩緣覺聲聞者則攝受一切眾生攝受一切眾生者則攝受正法攝受正法者則佛種不斷佛種不斷者則能了知得殊勝入處知得殊勝入處菩薩摩訶薩常得化生建立大乘十自在力現眾色像通達眾生形類希望煩惱諸相如實說法如實者不異如實者不來不去相一切虗偽息是名如實大慧善男子善女人不應攝受隨說計著真實者離文字故大慧如為愚夫以指指物愚夫觀指不得實義如是愚夫隨言說指攝受計著至竟不捨終不能得離言說指第一實義大慧譬如嬰兒應食熟食不應食生若食生者則令發狂不知次第方便熟故大慧如是不生不滅不方便脩則為不善是故應當善脩方便莫隨言說如視指端是故大慧於真實義當方便脩真實義者微玅寂靜是涅槃因言說者妄想合妄想者集生死大慧真實義者從多聞者得大慧多聞者謂善於義非善言說善義者不隨一切外道經論身自不隨亦不令他隨是則名曰大德多聞是故欲求義者當親近多聞所謂善義與此相違計著言說應當遠離。",
    "X17n0323_005:0208a10_0": "承上文旨將示誡勸於中先言依不依義及善不善損益之相言於一切法無所有此對前著言說者尚不有一切法況有文字可著乎尚能覺了自心現量離攝所攝二種妄想豈不能依第一義乎故曰依於義不依於文也若善男子下斥依文字者自壞第一義然第一義諦實不可壞但著文字乖離其說以為壞爾墮惡見相續者如前依言說相續計著是也善不善者即於一切法相章句有善其意不善其意者善則依義可知言一切法即教理等法也地即行位之地相謂因果之相而於一一皆通達章句亦了性離及實義也正無相樂等謂自行化他皆成就也建立眾生本果上事而因地亦分得此用故攝受大乘攝受大乘則一切凡聖無不攝者如是而為正法為佛種為殊勝入處則自覺聖知樂處是也常得化生下示一期事足良由菩薩始於善義離文字相其卒成就化用如此故復示其所以如實者三謂不異義也不來不去體也一切虗偽息用也分別雖爾不應隨說計著以真實者離文字故因起二喻以示得失一以指指物喻喻言說實義二嬰兒食熟喻喻方便脩法然皆有得有失其理曉然愚夫不了觀指而不觀物食生而不食熟凡今之人執著言說高談理性而不善知真實進脩者皆是幾何而不失實發狂也哉如來所以諄復誨斥不能自己言於真實義當方便脩者應如淨名實慧方便縛解四句(云云)亦可謂脩無不方便義無不真實法如是爾餘文結示過德可知又曰真實義者從多聞得此以善義為多聞非謂博聞也如曰若知如來常不說法是名多聞是也(五)。",
    "X17n0323_005:0208b14_1": "○右第二章。",
    "X17n0323_005:0208b15_0": "爾時大慧菩薩復承佛威神而白佛言世尊世尊顯示不生不滅無有奇特所以者何一切外道因亦不生不滅世尊亦說虗空非數緣滅及涅槃界不生不滅世尊外道說因生諸世間世尊亦說無明愛業妄想為緣生諸世間彼因此緣名差別耳外物因緣亦如是世尊與外道論無有差別微塵勝玅自在眾生主等如是九物不生不滅世尊亦說一切性不生不滅有無不可得外道亦說四大不壞自性不生不滅四大常是四大乃至周流諸趣不捨自性世尊所說亦復如是是故我言無有奇特惟願世尊為說差別所以奇特勝諸外道若無差別者一切外道皆亦是佛以不生不滅故而世尊說一世界中多佛出世者無有是處如向所說一世界中應有多佛無差別故佛告大慧我說不生不滅不同外道不生不滅所以者何彼諸外道有性自性得不生不變相我不如是墮有無品大慧我者離有無品離生滅非性非無性如種種幻夢現故非無性云何無性謂色無自性相攝受現不現故攝不攝故以是故一切性無性非無性但覺自心現量妄想不生安隱快樂世事永息。",
    "X17n0323_005:0208c10_0": "向言不生不滅直據正教言之未辨所以異外道者故大慧復承佛力而有異同之問凡設四竝一以外道說因不生滅與三無為法竝二以彼因此緣竝三以微塵等生與一切性不生滅竝四以說四大不壞竝皆以外道之說比同佛說如文云云故言佛說無有奇特夫如來之說常道也豈有意於尚奇乎而大慧云爾者非自為言也直為對勝外道引物希嚮然自其不知不達者亦謂之奇可也答中先總斥外道非言諸外道有性自性等者謂說一切性不生滅是有性自性又四大常是四大如地只是地等自性各不相混兼前言之為得不生不變相則是以有著心計彼性實有實即有壞雖曰不生不變實則生滅墮於有無故曰我不如是墮有無品於是對異其說亦略有三一離有無品如上說二離生滅如次明之三非性非無性則曰如種種幻夢等謂今所說如幻夢種種以有所現故非無性而無實故非性尚非無性況得如彼墮性實邪言色無自性相攝受者謂幻夢之色無自性相可得攝受但以著心攝取前境則現不攝則不現故曰現不現攝不攝故以是例一切性亦非性非無性則其性本虗唯一自心現量但如是覺妄想不生安隱快樂世事永息者姑以近事言之若夫遠理則無生法忍自此而得豈直若是而已(一)。",
    "X17n0323_005:0209a10_0": "愚癡凡夫妄想修事非諸聖賢不實妄想如犍闥婆城及幻化人大慧如犍闥婆城及幻化人種種眾生商賈出入愚夫妄想謂真出入而實無有出者入者但彼妄想故如是大慧愚癡凡夫起不生不滅惑彼亦無有有為無為如幻人生實其無有若生若滅性無性無所有故一切法亦如是離於生滅愚癡凡夫墮不如實起生滅妄想非諸聖賢不如實者不爾如性自性妄想亦不異若異妄想者計著一切性自性不見寂靜不見寂靜者終不離妄想是故大慧無相見勝非相見相見者受生因故不勝大慧無相者妄想不生不起不滅我說涅槃大慧涅槃者如真實義見離先妄想心心數法逮得如來自覺聖智我說是涅槃。",
    "X17n0323_005:0209a23_0": "三追示離生滅義於中先約虗實對明即凡夫以妄想作事謂事為實非諸聖賢不實妄想以妄想為虗然妄想本一而凡愚謂實聖賢體虗體虗則實性在焉謂實則終無有實如犍城等次以譬顯譬文可知法中言愚夫起不生不滅惑者謂彼妄想本是生滅而計謂不生滅則惑也却成以生滅而惑於不生不滅也彼亦無有有為無為者言彼不棄有為是不知生滅之實既無無為是不知無生滅之實如見幻人出入而實不知本無出入也故復合云如幻人生等以其幻性無性無所有故以是體了一切法離於生滅顯不生不滅亦復如是然則法本如幻而愚夫墮生滅見彼外道者本是生滅而又反起不生滅計故知凡外始終顛倒又安得而同邪又曰愚癡凡夫等者重疊前凡聖妄想虗實異者此亦不然故曰不爾謂凡夫性自性妄想亦不一異也若實異者則凡夫固著性自性不達自性本虗故不見寂靜是終不得離妄想也因復以相無相見矯上之義則虗實不必異聖凡不必殊但相無相之間則其理易轉其妄易融故曰無相見勝等謂無相見者見寂靜故其見勝非相見相見者謂本非相而作相見則不見寂靜是受生因故其見劣反顯無相見者為涅槃如真實義見又可知矣離先妄想心心數法者謂未見無相涅槃已前所有妄想心數皆離設竝之辭雖不別酬尋文可知(二)。",
    "X17n0323_005:0209b24_0": "爾時世尊欲重宣此義而說偈言。",
    "X17n0323_005:0209c01_0": "滅除彼生論建立不生義我說如是法愚夫不能知一切法不生無性無所有犍闥婆幻夢有性者無因不生無自性何因空當說以離於和合覺知性不現是故空不生我說無自性謂一一和合性現而非有分折無和合非如外道見夢幻及埀髮野馬犍闥婆世間種種事無因而相現折伏有因論申暢無生義申暢無生者法流永不斷熾然無因論恐怖諸外道。",
    "X17n0323_005:0209c08_0": "偈言滅除彼生論者外道雖有不生滅之言而實則生滅故但成生論佛言不生不滅對彼則不生義故曰建立不生義言一切法不生等兼出餘義竝顯不生亦可互相成顯也謂無性義無所有即空義犍城等即幻義文以次申之不生無自性等領上再徵也以離於和合等釋也先申空義謂於根塵離和合相故雖有覺知而性不現不現即空空即不生故曰是故空不生又曰我說無自性者申無性義也謂雖一一和合覺知性現而自性不可得故非有各隨其義文雖似反理實相符非若外道必待析無和合然後乃空教門所謂四性無生幻化即空是也夢幻及垂髮等申如幻義也上言有性者無因又曰無因而相現皆所以明幻非有無故幻若有性不應無因無因而然則性非有也幻若無因不應相現無因而現則相本虗也竝顯不生義故其所破立則折伏外道有因之論故曰申暢無生義無生所以無因也熾然言正法之盛然則因無因論亦且一往如彼外道亦有計無因者則成斷見通言佛法本未嘗偏但對外明內故有無偏言爾(三)。",
    "X17n0323_005:0210a04_0": "爾時大慧以偈問曰。",
    "X17n0323_005:0210a05_0": "云何何所因彼以何故生於何處和合而作無因論。",
    "X17n0323_005:0210a06_0": "爾時世尊復以偈答。",
    "X17n0323_005:0210a07_0": "觀察有為法非無因有因彼生滅論者所見從是滅。",
    "X17n0323_005:0210a08_0": "爾時大慧說偈問曰。",
    "X17n0323_005:0210a09_0": "云何為無生為是無性耶為顧視諸緣有法名無生名不應無義惟為分別說。",
    "X17n0323_005:0210a11_0": "爾時世尊復以偈答。",
    "X17n0323_005:0210a12_0": "非無性無生亦非顧諸緣非有性而名名亦非無義一切諸外道聲聞及緣覺七住非境界是名無生相遠離諸因緣亦離一切事唯有微心住想所想俱離其身隨轉變我說是無生無外性無性亦無心攝受斷除一切見我說是無生如是無自性空等應分別非空故說空無生故說空因緣數和合則有生有滅離諸因緣數無別有生滅捨離因緣數更無有異性若言一異者是外道妄想有無性不生非有亦非無除其數轉變是悉不可得但有諸俗數展轉為鉤鏁離彼因緣鏁生義不可得生無性不起離諸外道過。",
    "X17n0323_005:0210a22_0": "次復申二重問答初研無因義凡蘊四問意謂云何何因何故何處而作是無因論邪答亦含四意即初句答處也次句答云何無因謂佛法本非有無等三句答何所因因彼生滅論者第四句答何故為滅彼見故次究無生義凡設三端為問謂為無性為顧視顧猶待義即顧彼諸緣而有所待者為別有法除是三外不應無義答中先遮所問葢無生者不墮有無性本自爾故皆非之名不應無義起後正答也亦凡三意一以證位顯正當八地所得無生故曰七住非境界謂中實諦理非有無凡小等境界也二以離諸緣故則非顧待等緣然因緣法本未嘗離但言無生則自離爾唯微玅道心所得相應亦無想心可得故能所俱離其心既然身亦隨轉故法身轉勝也三以內外性不可得故則外無性非性可得內無心攝受可得斷一異等一切見即諸法寂滅矣如是無生則無自性無自性故空故曰非空故說空等簡非斷無等空直以無生故言空爾然向言離緣則克體言之而亦不離緣故因緣數和合下復即緣生示無生義準後文即十二因緣數法和合而有生滅亦即無生同出因緣故無異性若定一異者則外道說有無性不生等正示無生離四句故捨是無別無生故曰除其數轉變等但有諸俗數者對無生之真則俗數而已意謂無俗數則已必也凡夫以之溺生死海外道以之墮斷常坑連環不斷是謂鉤鎖離是無別生與無生故曰生義不可得而如來示世以一無生破之俾即生無生達鉤鎖無鉤鎖則鉤鎖頓斷入於不生不滅之地故曰生無性不起謂生無生性雖生而不起是生即無生非一非異故離外道定計之過也(四)。",
    "X17n0323_005:0210c04_0": "但說緣鉤鎖凡愚不能了若離緣鉤鎖別有生性者是則無因論破壞鉤鎖義如燈顯眾像鉤鎖現若然是則離鉤鎖別更有諸性無性無有生如虗空自性若離於鉤鎖慧無所分別復有餘無生賢聖所得法彼生無生者是則無生忍若使諸世間觀察鉤鎖者一切離鉤鎖從是得三昧癡愛諸業等是則內鉤鎖鎖燧泥團輪種子等名外若使有他性而從因緣生彼非鉤鎖義是則不成就若生無自性彼為誰鉤鎖展轉相生故當知因緣義堅濕煖動法凡愚生妄想離數無異法是則說無性如醫療眾病無有若干論以病差別故為設種種治我為彼眾生破壞諸煩惱知其根優劣為彼說度門非煩惱根異而有種種法唯說一乘法是則為大乘。",
    "X17n0323_005:0210c17_0": "此下破外顯正也若但說鉤鎖而不言無生凡愚固所不了或離鉤鎖別計生性者則顯諸法一出於有有為無所因反成邪無因論破壞正教鉤鎖無生之義如燈顯眾色非即物是明彼鉤鎖現若如是者則離因緣外別有諸性外道見如之若當體無性故無有生如虗空自性者則正教如之故知若捨緣生別求無生慧者無所發明故曰慧無所分別復有餘無生等指向賢聖所得亦即生無生約證顯也又曰若使諸世間等謂有能如是觀者則當處無生名之為離亦得三昧約脩顯也因示其法又二初立內外以言因緣則曰癡愛諸業等即十二支為內鑽燧等名外外以譬內故言之爾次覈自他以推無性則曰若使有他性等謂若唯他性從緣生者緣非鉤鎖自不成就若無自性則彼外緣為誰鉤鎖亦應反云若唯自性應不待緣若無他性因不自生文相互略且據一邊此椎自他不生也展轉相生故者謂若自他展轉相生成因緣共生義此亦不然如四大堅濕煖動各有其性本無和合而凡愚作生法妄想其實生性不可得是推共不生也離數無異法則無因而已無因豈有生邪既皆求而叵得故曰無性即無四性也如醫療眾病等總譬上法由根異如上說不生空幻等法皆以眾生病根故異非謂法殊根若無殊法亦何別則唯說一乘故無種種之異苟無眾生亦無法也(五)。",
    "X17n0323_005:0211a17_1": "○右第三章。",
    "X17n0323_005:0211a18_0": "爾時大慧菩薩摩訶薩復白佛言世尊一切外道皆起無常妄想世尊亦說一切行無常是生滅法此義云何為邪為正為有幾種無常佛告大慧一切外道有七種無常非我法也何等為七彼有說言作已而捨是名無常有說形處壞是名無常有說即色是無常有說色轉變中間是名無常無間自之散壞如乳酪等轉變中間不可見無常毀壞一切性轉有說性無常有說性無性無常有說一切法不生無常入一切法大慧性無性無常者謂四大及所造自相壞四大自性不可得不生彼不生無常者非常無常一切法有無不生分析乃至微塵不可見是不生義非生是名不生無常相若不覺此者墮一切外道生無常義。",
    "X17n0323_005:0211b07_0": "彼外道皆邪唯佛道獨正理固然也然則果何以異外道邪以為常乎外道亦嘗言之矣以為無常乎佛亦嘗言之矣是果何以異外道邪夫常有邪正向已明之無常之邪正大慧所以再請決也問文可知答中先列外道有七無常義唯色轉變無常少帶釋相餘但列名而已後釋中或兼破計或不破計仍不次第不出色性互有前後由相顯爾言色轉變中間者謂於色變之間無間常趣散壞之猶趣也如乳酪等轉變而中間微不可見惟其於無常壞時方知一切法轉即其相也初釋性無性無常者謂性即四大及所造自相也壞則無性無常義也四大自性下破計也意以自性不可得則何性之有不生則尚無有生何壞無常之有彼不生無常者據前列名又曰入一切法則是計一切法本不生既入一切法謂無常可也何謂不生既已不生矣復何無常云邪因以理直之曰非常非無常蓋極言不生必一切法有無皆不生凡有不生可云無常既無亦不生豈當無常邪若曰分析乃至微塵不可見是不生義非生者此則有塵可滅正同生義何謂不生若不覺此有無皆不生而謂析塵為不生者正墮生無常見也(一)。",
    "X17n0323_005:0211c04_0": "大慧性無常者是自心妄想非常無常性所以者何謂無常自性不壞大慧此是一切性無性無常事除無常無有能令一切法性無性者如杖瓦石破壞諸物現見各各不異是性無常事非作所作有差別此是無常此是事作所作無異者一切性常無因性大慧一切性無性有因非凡愚所知非因不相似事生若生者一切性悉皆無常是不相似事作所作無有別異而悉見有異若性無常者墮作因性相若墮者一切性不究竟一切性作因相墮者自無常應無常無常無常故一切性不無常應是常若無常入一切性者應墮三世彼過去色與壞俱未來不生色不生故現在色與壞相俱色者四大積集差別四大及造色自性不壞離異不異故一切外道一切四大不壞一切三有四大及造色在所知有生滅離四大造色一切外道於何所思惟性無常四大不生自性相不壞故。",
    "X17n0323_005:0211c20_0": "性無常者如後出彼計但是性無性無常事非性無常也故直以自心妄想非之非所謂常無常性何者以事可壞而性不可壞故曰無常自性不壞豈得言性無常若夫能壞之性則不可壞故曰除無常等良以無常自性常與物俱不即不離能令物無常而不自無常如杖瓦石能壞諸物而自體不壞亦如物之八相是也(云云)但此理不易明故復反覆析其說曰現見各各不異等謂若性與事異者如現見諸法直性無常事而已不見所異相則非作所作有差別而可指示曰此是無常此是事安有無常自性不壞邪此皆擬彼執難之意又曰作所作無異者覆領上義若無異者如一切性常亦應無因性此以常例無常顯皆有性則一切性無性有因亦明矣但其性微隱非凡愚所知故復以事驗其必異則曰非因不相似事生正言若非有因則無不相似事生如一切性悉無常豈非不相似事若其生者以驗無常有因必矣反顯前所謂無異者而悉見有異但前一往直彰性事如形之有影凡愚不了見形而不見影此以常例無常兼以事驗如五穀種別則愚智共知此特知無常有性而已未明所以失也故復追破之曰若性無常等夫言性必究竟無作無作則常若言無常則墮於作法非究竟義以是為因則墮作因性相失所以性義故曰自無常應無常等謂自無常者性也性不應無常性若無常對事相奪事應反常為成反難故縱云爾又曰若無常入一切性者恐其執難謂必入一切性應墮三世隨彼色壞何謂自性不壞故復釋出所以自性則曰色者四大積集差別等夫以積集和合言之則未始異以差別言之則未始不異既離異不異即四大造色自性有在於此豈復隨造色而壞乎彼外道者計性無常徒能於四大不壞處及三有造色所在知有生滅而已使離四大造色復於何所思惟見性無常是終不得而見也曾不知所謂自性不壞者不即造色不離造色在乎四大性本不生處故曰四大不生自性相不壞故謂於四大離異不異則無定性無定性故生而不生惟其不生故不得而壞如楞嚴所謂云者則性無常之說墮矣以其說害理為甚故闢之特委焉(二)。",
    "X17n0323_005:0212b11_0": "離始造無常者非四大復有異四大各各異相自相故非差別可得彼無差別斯等不更造二方便不作當知是無常彼形處壞無常者謂四大及造色不壞至竟不壞大慧竟者分析乃至微塵觀察壞四大及造色形處異見長短不可得非四大四大不壞形處壞現墮在數論色即無常者謂色即是無常彼則形處無常非四大若四大無常者非俗數言說世俗言說非性者則墮世論見一切性但有言說不見自相生轉變無常者謂色異性現非四大如金作莊嚴具轉變現非金性壞但莊嚴具處所壞如是餘性轉變等亦如是如是等種種外道無常見妄想火燒四大時自相不燒各各自相相壞者四大造色應斷。",
    "X17n0323_005:0212b23_0": "離始造無常亦曰作已而捨名異義一也以其始終次第造捨義當無常故曰離始造等始謂四大和合而造因見其有四大異相如堅濕煖動各各不同故非之以計異方謂四大各有自相而造義復非差別可得遂捨異而計同方謂彼無差別而此復無同異更造之理故雖同異二方便亦不作況得有所成乎莫不以始造為是卒而非之既所計不常任運成非不待別斥也彼形處壞無常者謂四大造色實不可壞但壞其形處異見是無常義故曰至竟不壞竟猶極也盡也謂分析造色至於極盡猶不可壞但觀察壞其形處長短異見以不可得云壞爾非壞四大也四大不壞下破也謂不壞其實但壞形處現相者謂長短異見則俗數言說而已故曰墮數論中亦併如復斥色即無常者義反前計故對格其說曰彼則形處無常等言各有所偏其於世諦言說有違有墮違則非俗墮則乖真違俗乖真皆非正論其失一也又曰世俗言說非性者仍結前過謂非實故但有言說雖各計不同其不見自相生處一也如前云云若見生處尚不當不壞況言壞乎轉變無常言色異性現者謂造色變異故無常性現以現處為壞非四大壞喻意可知同前形處無常不別破也如是等種種下總破也凡彼諸見皆約四大為言非真智分別則是妄想加彼四大之上故曰妄想火燒四大而所謂離異不異自性相不可壞壞則造色應斷即墮斷見或見其不可壞則又起常見是邪見火燒四大終無已也(三)。",
    "X17n0323_005:0213a02_0": "大慧我法起非常非無常所以者何謂外性不決定故唯說三有微心不說種種相有生有滅四大合會差別四大及造色故妄想二種事攝所攝知二種妄想離外性無性二種見覺自心現量妄想者思想作行生非不作行離心性無性妄想世間出世間出世間上上一切法非常非無常不覺自心現量墮二邊惡見相續一切外道不覺自妄想此凡夫無有根本謂世間出世間出世間上上從說妄想生非凡愚所覺爾時世尊欲重宣此義而說偈言。",
    "X17n0323_005:0213a11_0": "遠離於始造及與形處異性與色無常外道愚妄想諸性無有壞大大自性住外道無常想沒在種種見彼諸外道等無若生若滅大大性自常何謂無常想一切唯心量二種心流轉攝受及所攝無有我我所梵天為樹根枝條普周徧如是我所說唯是彼心量。",
    "X17n0323_005:0213a16_0": "此下的示正教對外揀異也謂我法起於非常非無常則常與無常同出一理葢一理者體也常無常者舉體之用也惟其體用互即故常即無常無常即常此諸法外性所以未始決定故說非常非無常以顯中道中道之理非妙心莫能契故唯說三有微心以體之言三有則徧攝之量言微心則莫測之名此法即心本無內外而言外性者一往順妄爾又言微心者謂三有雖大本於微心一念之萌無法不具此則正教之大體亦即此經所語之心也不說種種相有生有滅者正對外揀直彰理性故不說彼諸妄想相也所以不說者二意一以自性相不壞故故曰四大合會差別四大及造色故此即密示上自性不壞之意故無生滅相可得二以生滅是妄想相所攝故故曰妄想二種事攝所攝謂諸法生滅不出名相二種妄想事所攝今對外辨不說妄想事故也苟知二種之為妄想則離外性無性有無二種見唯一自心現量如是而覺者亦知凡妄想者從思想作行生想行復從攝所攝受心生然則妄想一出於心心性無性故亦離內心之妄想然亦未甞以妄想而廢作行故曰非不作行但離心性妄想則世出世間一切諸法復本一如同一中道故曰非常非無常此能覺者也其不覺者則曰墮二邊惡見相續此外道所以常在妄想而不覺自妄想凡夫所以不離根本而無有根本此本凡外兼之亦互見爾不知根本出此但隨言想種種橫計故謂世出世間諸法生於言說妄想也宜矣偈言遠離於始造者頌總離諸見也諸性無有壞等頌上總破文也謂彼雖妄想無常而四大自性不壞故曰大大自性住乃知外道於本非無常作無常想沒於邪見又曰彼諸外道等者則又覆以向意示諸外道謂彼所計本無生滅之實其大大性常固自若也何得定謂作無常想乎故復彼要言之曰一切唯心量等謂見之邪正想之有無皆本諸心量初無定實惟其以生滅二心流轉識境所以為無常想若於攝所攝根境了無我我所則亦無邪計可得斯皆示無定說虗其情謂爾梵天為樹根等即自在天初造眾生為有情本故如樹本而生枝條以譬心量出諸妄想亦復如之(四)。",
    "X17n0323_005:0213c06_1": "○右第四章。",
    "X17n0323_005:0213c08_0": "楞伽阿跋多羅寶經通義卷第五"
}