{
    "X20n0360_001:0368c03_0": "金光明經文句新記目次",
    "X20n0360_001:0368c06_0": "卷一",
    "X20n0360_001:0368c07_0": "釋序品第一初",
    "X20n0360_001:0368c08_0": "卷二",
    "X20n0360_001:0368c09_0": "釋序品之餘",
    "X20n0360_001:0368c10_0": "卷三",
    "X20n0360_001:0368c11_0": "釋壽量品第二",
    "X20n0360_001:0368c12_0": "卷四",
    "X20n0360_001:0368c13_0": "釋懺悔品第三",
    "X20n0360_001:0368c14_0": "釋讚嘆品第四",
    "X20n0360_001:0368c15_0": "卷五",
    "X20n0360_001:0368c16_0": "釋空品第五",
    "X20n0360_001:0368c17_0": "卷六",
    "X20n0360_001:0368c18_0": "釋四天王品第六",
    "X20n0360_001:0368c19_0": "釋大辯品第七",
    "X20n0360_001:0368c20_0": "釋功德天品第八",
    "X20n0360_001:0368c21_0": "釋堅牢地神品第九",
    "X20n0360_001:0368c22_0": "釋散脂鬼神品第十",
    "X20n0360_001:0368c23_0": "卷七",
    "X20n0360_001:0368c24_0": "釋正論品第十一",
    "X20n0360_001:0369a01_0": "釋善集品第十二",
    "X20n0360_001:0369a02_0": "釋鬼神品第十三",
    "X20n0360_001:0369a03_0": "釋授記品第十四",
    "X20n0360_001:0369a04_0": "釋除病品第十五",
    "X20n0360_001:0369a05_0": "釋流水品第十六",
    "X20n0360_001:0369a06_0": "釋捨身品第十七",
    "X20n0360_001:0369a07_0": "釋讚佛品第十八",
    "X20n0360_001:0369a09_0": "金光明經文句新記目次(終)",
    "X20n0360_001:0369b03_0": "金光明經文句新記卷第一",
    "X20n0360_001:0369b04_0-0": "(□□□□□□□□固寶積首事筆削中夏遷居郡西妙果終其草藁簡異舊說故云新記)永嘉沙門釋　從義　撰釋序品初初釋總題為二初所記題目言文句者文句記云文謂文字一部始終(始自序品終乎讚佛)故云文即是字為二所依(故成唯識論第二卷云也百法鈔云文者文身文無自性依字假立若無改轉之義斯乃但名為字若一字已上有所改轉詮得差別即名為句即由此詮自性差別之時望於名句能為所依故名為文文體雖即是字要與二為所依有改轉義方號為文若不與二為所依又無改轉之義但名為字耳)",
    "X20n0360_001:0369b04_0-1": "句謂句逗義通長短(長句短句)故云名詮自性句詮差別(故云亦指成唯識論百法鈔云名詮自性者謂諸法自性也即一切有為無為有漏無漏色心假實局附自體皆名自性詮此自性號之為名即不局一字二字但有詮自性者總說為名若一字成名如言眼耳鼻舌地水火風等若二字成名如云勝解精進等若三字成名如云毗耶離等句詮差別者即諸法自體之上有不同之義名為差別亦通有漏等即二字已上但詮差別者皆名為句且二字句詮差別者如云佛眼若但云眼即唯詮眼自性今既於眼上加佛字即是詮眼之差別矣若云有漏眼即三字成句詮差別也□顯揚聖教□□□□□□□□□目種種事令世共知故又能令意作種種□□由□□□傳述故問句者何義答攝受於名究竟顯了不現見義故問文者何義答顯發名句以為義也)",
    "X20n0360_001:0369b04_0-2": "此亦不論色行等體(百法論等明聲是色蘊名句文三是心不相應行蘊所收然今題目但謂之文句故亦不論色行等體也)今但以句而分其文云文句(以長短之句而分一部始終之文是故題云文句耳)古之章疏或單題疏或單題章章謂章藻(文藻)亦云章段分段解釋成若干章疏者通意之辭亦記也又疎音即疏通疏條疏鏤也(疏通經旨不出五重大義故解十六觀經謂之疏者由此故也)",
    "X20n0360_001:0369b04_0-3": "今並不云意如上說(即但以句而分其文故云文句何者以由釋題大義委故至經文但粗分章段題云文句良由於此是知玄義與夫文句部〔被〕元分不可參濫若不爾者豈可分文復陳大義談玄說觀卻事消文故云若相帶以說則彼此無歸也又若取其相成而說是則玄義及以文句不可條然諸文中亦指文句名為疏者即此意也故淨名涅槃既別行玄義至於分文又名為疏良由於此故云故但分文句則大理不彰唯談玄旨則迷於起盡以由釋題不可率爾題下別釋理非容易故知全迷玄文大旨而欲以文句消經〔因蔽〕理觀深微而但以事相釋義言弘斯曲者遠矣今且從於部袟元分故解文句不可參濫玄義疏通經文大旨何者以由文句消釋經文凡至大義並指玄文名體宗用三一總別寄行約教故也孤山四明不曉斯旨乃云文句釋經大義非少而言文句者葢大師之謙辭耳今問五重釋題既大義委悉而三分消文何謙辭之有乎是知四明定別題三字謂單法將□□□字非謙辭並皆訛錯世人共迷望聲傳習〔非〕哉)",
    "X20n0360_001:0369b04_0-4": "。",
    "X20n0360_001:0369c11_0": "次能說師號天台即所住之山智者乃隋帝立號大師是後人所稱葢有大德行為眾所師焉即王公大人之模範也說者悅也悅所懷也以靈岳親承大蘇妙悟解斯經之大旨既備於玄義分經文之句逗乃在於此中故是悅所懷而宣說也而門弟子頂禪師記諸善言筆錄成文分為三卷留贈後賢共期無量甚深法性微妙寂滅耳。",
    "X20n0360_001:0369c18_0-0": "次釋別文為二初總指此部品數此者指定之辭也即指定讖師所譯一部四卷有一十八品也(沮渠氏字蒙遜據北涼姑臧郡時中天竺國三藏法師曇無羅讖或云曇摩讖涼云法豐六歲出家日誦萬言初學小乘五明諸論後遇白頭禪師教以大乘十日交諍方悟大旨遂專大乘明解呪術所向皆驗西城呼為大神呪師來至北涼譯金光明經等譯者傳言也又易也變易梵語為華言也周禮有象胥傳四方之言東方曰寄南方曰象西方曰狄鞮北方曰譯說者謂溪世多事北方又恐佛教初從北天竺來故使傳言翻經謂之譯也)",
    "X20n0360_001:0369c18_0-1": "既指讖師所譯品數則簡諸師所翻之本何者此經前後多譯不同初讖師譯次用朝優婆國耶舍崛多此云稱藏譯五卷更廣壽量大辨陀羅尼成二十品次梁朝西天竺優禪尼國波羅末陀此云真諦譯七卷題云金光明帝王增三身分別品業障滅品陀羅尼最淨地品依空滿願品足前十八品成二十二品仍出疏十三卷次隋朝北天竺揵達國闍那崛多此云至德又云佛德譯囑累品銀主陀羅尼品足前七卷",
    "X20n0360_001:0369c18_0-2": "二十二品成八卷二十四品次唐朝義淨譯十卷題云金光明最勝王有三十一品初序次壽量三分別三身四懺悔五滅業障六最淨地陀羅尼七蓮華喻讚八金勝陀羅尼九重顯空性十依空滿願十一四天王觀察人天十二四天王護國十三無染著陀羅尼十四如意寶珠十五大辨財天女十六大吉祥天女十七大吉祥天女增長財物十八堅牢地神十九僧慎爾耶藥叉大將二十正論二十一善生王二十二諸天藥义護持二十三授記二十四除病二十五長者子流水二十六捨身二十七十方菩薩讚歎二十八妙幢菩薩讚歎二十九菩提樹神讚歎三十大辨財天女讚歎三十一付囑故囑累一品前三師所翻則無後兩師所譯則有孤山云後人妄為囑累四明云諸師翻譯皆無囑累者葢搜尋之不廣致茲臆斷耳。",
    "X20n0360_001:0370a23_0": "次舊來下敘古今分判文為二初敘古師分割又為二初正敘為二初敘舊來分讖本又為二初總敘舊來等者舊即對新得名又舊者古即對今也謂從舊以來分剖割截以為三分而有盈縮進退不同也次別敘文為二初敘江北諸師言江北者釋籤第一解建業云隋滅陳後移揚州名額過京江北此即江北非河北也若準釋籤第十解南三北七云南是南朝即京江之南也北謂北朝即是河北非江北也又文句記解北人云諸文所指多是相州北道耳訖者止也畢也發願冥助故云大誓護經差病救魚故云大悲接物次敘江南諸師者今家之意乃以序分入壽量品中從四佛斷疑下方為正說分若流通分則同南師也。",
    "X20n0360_001:0370b12_0": "次敘真諦分新文此自為三初正敘分文應知真諦及江北諸師所分三分雖新舊兩本品數多少不同而大意無別也然真諦新文有二十二品既將初品為序而言壽量至捨身十九品為正後兩品為流通者應云壽量訖流水十九品為正方顯後兩品是流通也即捨身讚佛兩品也若以壽量至捨身為正應云二十品為正後一品為流通也更請詳之次真諦下敘真諦釋分文所以然此但是釋正說分之所以也師果弟因等引經消之可解前師果下三敘真諦難江南諸師前師果弟因既為正者指江南諸師以壽量下為正說分也後師弟因果何得為流通者難江南諸師以四王下十三品為流通分也師弟因果者師因弟果也此從文體語便故云師弟因果耳非謂文之倒誤也然則前後師弟因果元是真諦釋正說分所以之文故舉自己所釋之義以難南師不合分我正說之文為流通耳。",
    "X20n0360_001:0370c04_0": "次今師下今家破者然下文中不破真諦云四王下正論力用者準例知非不煩文耳何者力用但是懺歎兩品滅惡生善空品導成何得將於四王以下流通分為力用耶於中為二初總破諸師人情不知經真咸謂序分未曾辨別正宗之道遂劑序品割為序分又謂流通歇散微末不得論於師弟因果遂將四王已下至捨身並屬正說分以謂授記是弟子果除病是師因故也今總破其非故云是義不然矣。",
    "X20n0360_001:0370c12_0": "夫段下次別破文為三初約三分互通破杜者隔也塞也斷者絕也序本序於正通序則有三義者如下文中明敘述序敘後一十七品即是序本序於正說流通故序則有三義也孤山不曉輒便斥之是則下文所明敘述一十七品乃為孤山之所破矣問諸經若無敘下諸品豈可序分不序正通答諸經若無敘下諸品則以表發序於正通此經既有敘下諸品不可斥之正本正於序通正亦三義者由前序於正故今正於序故壽量斷疑懺歎導成全是正於序中所敘耳又復今正說非但益當機亦被於求世則是正於通故得正說分亦具於三義通本通於正序通亦三義者流通若不通前正序是則將何以利有緣故流通之法還通正序耳上中下語皆善故者下文亦引上中下語此乃引於法華文也故法華云初善中善後善文句釋云初中後善是序正流通即時節善也(彼文明七善一時節善乃至第七梵行之相是無緣慈善也)法界次第云善以順理為義息倒歸真故云順理今此三分若不互通則成杜斷隔絕豈能順於法性之理邪。",
    "X20n0360_001:0371a06_0": "又眾生下次約得道不定破眾生得道根性不定等者上中下語既乃皆善是故三分皆有利益如法華文句約於三段示因緣相即其例也何可容於序無滋味流通歇末耶(孤山改滋字作正字)流通中說師弟因果既無妨礙序中說正亦何所乖故流通中說於師弟因果有正宗之意彌(益也)是督(冬毒切率也正作督)勵(力制切勸勵也勉也)宣行流通不違經意上中下語皆善故也如法華中普賢遠來勸發請說如來答以護念等四此四即是開示悟入豈非流通有於正說又此亦是序中四華豈非流通亦有於序今經四王品初白佛歎金光明諸經之王莊嚴菩薩深妙功德等既是名體宗用豈非流通中有於序正乎以由序及正說只是名體宗用故也。",
    "X20n0360_001:0371a19_0": "又法華下三引例文為二初正引例言阿私者此云無比法華提婆達多品明釋迦過去為世國王從阿私仙求於妙法今舉仙人以顯國王故是本師釋迦之因持品授於姨母耶輸弟子八相應身果記自昔諸師既皆判之為流通分而今經流通分中說師弟因果何所妨故此有其類例若判四王品已下為流通分有師弟因果則於義無妨礙也以江南諸師判今經流通與今家意同故今委破真諦及江北諸師不可見談師弟因果便判之為正說分也次與奪下破執者左傳云一與一奪法華文句云夫分節經文悉是人情蘭菊各美後生不應是非諍競無三益喪一道三益者世界等三悉檀也一道者第一義悉檀也文句記云蘭菊者章安破計也佛赴機說當時稱會後代分節寄茲顯理固執成諍進退俱非縱有異同彼彼蘭菊仍許得意者為言縱不全違聖心終是人之情見若粗得通用不須苦諍恐失四悉之益故也與者許與也奪者斥奪也孤山云真諦奪江南為非今家與江南為是在理或當何必專執耶。",
    "X20n0360_001:0371b13_0-0": "次今從下明今家判釋文為二初分判文為三初正判言今從者今師對古而立也如法華文句云天台智者分文等文句記云天台者章安對古故別云也下去準知序者下次釋名文為二初正釋次經曰下引證初云將者欲也方將也將當也序將有利益者序其將當有於正說四悉之益也淨名疏云大聖將欲說法必先現瑞表發以為由藉發起物情使咸信慕歸宗有在故名為序當者對也直也正當機辨道者正直對於機緣辨常果懺歎導成之道也淨名疏云四眾覩瑞悉皆欣仰大聖知時赴機設教時眾聞經咸霑法利故名正說流通者淨名疏云流譬水之下注通則無滯無壅如來大慈平等說法非止為現在亦遠被正像末代有緣使咸霑潤故名流通問爾序將有利益者但是序於正說之利益耳若自於序中豈無利益耶答今此釋名且從一期次第而說其實三分非但互相貫通亦乃各有利益如法華文句約種熟脫三歷序正流通明得益之相文句記云若唯序等則無階降過未因果若唯種等聞無所從以種等三於序等三所從得益不同故也且如序中通序在滅後別序通過親若佛在世別序五中節節益異如說無量義密得種等三益不同故覩定見光覺動蒙華乃至問答亦有種等三益可知故通別序佛滅後被流通人勸持誦說亦有種等況正宗耶法華既爾今經可知故今下文亦乃約因緣教觀但無第三本迹釋耳法華文句若釋他經但用三意為未發本顯迹故也筌罤者筌者取魚竹器也罤者兔網也莊子雜篇外物第二十六云筌者所以在魚得魚而忘筌蹄者所以在兔得兔而忘蹄言者所以在意得意而忘言吾安得夫忘言之人而與之言哉注云筌者魚笱也以竹為之亦從草者香草可以餌魚置於柴木之中以取魚也蹄兔罝也亦兔弶也以之繼係兔脚也文句記云若言蹄是足者能詮不成若言蹄是迹者其義亦疎尋迹得兔義豈然耶是故應須作此罤字。",
    "X20n0360_001:0371c23_0": "次釋疑為二初疑者惑者見今分文從如是入壽量中天龍集信相室為序分遂疑序分合劑序品以江南及真諦等並以初品為序分壽量下為正說分今何得以序分入壽量正說半品中耶此由不知壽量上半品是序分故有此疑耳。",
    "X20n0360_001:0372a04_0-0": "次眾經下例釋文為二初例非獨今經序分入正眾經亦乃例皆如是何者如維摩經初品但名佛國因果疏中釋云但此品題應云序品言佛國者從正當名(以正說分明佛國因果為宗故也)問既有序正何得用正以標初品答此問非也說用序當名復應問云何不用正今解不無其例如摩訶般若初半品是序從告舍利弗後半品是正而用序標品(以大品經初品名序故云大品正說在序品中)",
    "X20n0360_001:0372a04_0-1": "復有何妨若不許此經序受正說名者亦應不許彼經正用序標品也若爾定應用序標題答金光明序正同品(以序分及正說分同壽量品)亦應為妨此既晚人安品措意不同非佛所制亦非阿難不足定執(文句記云或佛自唱如梵網經心地品或結集所置如大論所述大品一部結集之家本唯三品一序二魔事三囑累或譯人添足如羅什於大品三品以類加之成九十品謂人義法事人如樓耶義如觀空法如三假事如魔事亦如大經純陀哀歎等又非譯者但補助譯人即謝公加也準知諸經非佛自唱及以集者並是譯人添之耳)",
    "X20n0360_001:0372a04_0-2": "此經雖不標序品為初而序義宛然(以上除注外並是淨名疏文)故今謂之如維摩無序品序在正說中以維摩疏分於三分初從如是訖七言偈名為序分而佛國品既從正當名而前半品屬序故知雖無序品而序分不妨在正說品中也涅槃序分入正品中者若約北本四十卷說初品名壽命維摩初品佛國因果既從正當名涅槃初品壽命豈不然乎維摩序分既入正品中涅槃序分豈不然乎故壽命品如是我聞等即是序分也若約南本三十六卷",
    "X20n0360_001:0372a04_0-3": "說初品名序即嚴觀兩師與謝靈運等於壽命品開之為三一序二純陀三哀歎法華文句云涅槃以純陀是序已開常宗乃至云純陀序常者此指純陀品初啟請之文耳即序分之序非序品之序也故知序正同純陀品以純陀品初啟請之文猶屬序分故今謂之涅槃序分入正品中若準章安涅槃疏中則以序品名為序分從純陀品去名為正說者此且從文劑品而分耳若不爾者如何消於今文及法華文句耶眾經等者結斥也諸經序分既皆入正不以為疑何獨或(應作惑字)",
    "X20n0360_001:0372a04_0-4": "此序分入於正宗壽量前半品耶。",
    "X20n0360_001:0372b13_0": "斯乃下次釋意者正釋此經序分入正之疑惑也斯者此也言出經者恐指結集人也文句記云若無集家之言及無佛自唱語似屬譯人以梵文中諸品先足當知乃是集者所置信非譯人明矣況今品後云說是如來壽量品時等豈非結集者乎言意為者為字恐誤應作謂字嶄(仕咸切)者山石高峻之貌字或作磛齊(徂奚切)字恐誤應作劑(在詣切)字分劑也割者截也若法華經則不從於義但劑序品判為序分故知分文用與非一不可指定也。",
    "X20n0360_001:0372b22_0-0": "序有三義下次解釋文為三初釋序分文為二初釋序品之名又為二初釋序文為三初標列序有三義者標也一次緒下列也淨名疏問諸經悉具三序以不答有具不具或二或一皆為序分也(或二如十六觀經但有次緒及發起也或一如佛說阿彌陀經但有次緒也於次緒中諸經或五六七或但三二等)問序訓不同何得俱用次序會通眾義答字書雖爾經意含三共用次序之字亦應無妨依義不依語也次緒下次解釋中初言次緒等者次者第也緒者說文云絲耑也耑者物初生之題也居者安也冠者束也眾說者諸品也首亦初也謂如是等次第安居一部之初冠束眾說諸品之首故名次緒也敘者次第也謂敘述下文諸品次第也方將當益其義含於正說流通以下文云敘述序者敘後一十七品故也發其信心等者即是現瑞表彰發其信樂之心起其常果之教故云發起序也此經三序次第雖爾若準法華淨名三序則以發起在於第二然今文中謂之發起彼疏之中乃云由序辭異意同何者葢指現瑞以為發起之端由故又今文中釋於三序若準法華文句及記乃是從於字義而釋彼文又先釋字訓云序者訓庠序也庠謂安庠即非怱卒越次故也學舍養宮並非今意(具如大部補注中示)",
    "X20n0360_001:0372b22_0-1": "爾雅云東西牆謂之序注云別內外也此可借用以釋別序如由別序方異諸經通序異外亦可兼用今文雖無準須合有故引之耳彼文又云以序從正通名經也故云妙法蓮華經序品今亦例然淨名疏問佛在世時經初無序不名經耶答別序之前雖無六義佛說法時已有其事故得名經也一段下三總結一段者始從如是終至天龍集信相室也含者兼含也故題為序品者品字但是相帶而來耳以此三序乃是序分非但序品故也。",
    "X20n0360_001:0373a03_0-0": "次釋品字者序名在別品義則通下去諸品以通從別不後更釋故但釋別以置於通於中為三初翻名即中阿含作此翻也言梵語者彼中天竺元梵天種還作梵語及以梵書此土書法本無從始但是大權隨其方土為之制立是故倉頡初觀鳥迹具如釋籤輔行及南山戒疏中辨品是類下次釋義者文句記云釋品字義非品題義故字義則通題名則別品是類義諸品咸然此中文句者且別指序品也若從通說一部始終皆是文句而四明云此中文句皆在經者意謂此中文句不同題云文句故知四明不曉此中文句即是題云文句孤山四明並至此中方乃解釋文句二字殊乖法華文句記也言氣類者借喻以顯也氣謂氣候類即種類如陰陽等六氣及二十四氣之不同種類之差別也三引例者例謂類例律者南山云梵語毗尼此翻為律律者法也從教為名斷割重輕開遮持犯非法不定故正翻之俗有九流法流其一故世付法皆約刑科道與俗違刑名乃異至於處斷必依恒法故使律字彳傍兼聿象取茟也處劾決正非茟不定即法家之象致唯律翻之言篇聚者篇謂五篇一波羅夷(義翻極惡如人斷頭不成比丘又云無餘此從眾法絕分為名)",
    "X20n0360_001:0373a03_0-1": "二僧殘(僧伽者為僧婆者為初謂僧前與覆藏羯磨也尸沙者殘也謂末後與出罪羯磨也若犯此罪僧作法除從境為名也如人為他所斫殘有咽喉理須早救也)三波逸提(義翻為墮墮在燒煑覆障地獄也僧有百二十種分取三十因財事生〔他〕貪慢心強制捨入僧名尼薩耆以尼薩耆翻為捨故餘之九十單悔別人若據罪體同一品懺)四提舍尼(義翻向彼悔從對治境立名也)",
    "X20n0360_001:0373a03_0-2": "五突吉羅(突者惡也吉羅者作也若分為二身名惡作口名惡說)聚謂六聚亦云七聚言六聚者一夷二殘三偷蘭遮(義翻為大障善道亦云大罪又云麤惡)四提五提舍尼六突吉羅言七聚者六如上七惡說即開吉羅為二身名惡作為第六聚口名惡說為第七聚言毗曇者即阿毗曇此云無比法亦云對法犍度者此云法聚以分一部為八聚故一業二使三智四定五根六大七見八雜大論問八犍度誰造六分阿毗曇從何處出答佛在無失滅後百年阿輸柯王會諸論師因生別部有利根者盡讀三藏欲解佛經作八揵度後諸弟子為後人不能全解作略毗曇其初造者即迦旃延爾者詞之必然也故篇聚等亦如品類也。",
    "X20n0360_001:0373b15_0": "次從如是下釋序分之文為二初分文次從次緒之序下解釋又為二初釋次緒亦名通序次釋敘述發起亦名別序即是束三以為二也言通別者通序通諸教別序別一經亦可謂之通諸部別序別一部又亦可云通序通諸經別序別一教又通序名通而體別別序事別而義通義通故通有別序體別故別在今經故知今經通別俱別別在無量甚深法性常果等故以如是等不關諸經方可得名正家之序正名序家之正若不爾者發起徒施。",
    "X20n0360_001:0373b23_1": "於中先釋通序又為二初總釋為二初明開合不定又為二初正明舊者古諸師也地人者弘地論人也五事者一如是二我聞三一時四佛住王城等五列眾同聞六事者開佛住王城為二也或七事則開我聞為二也皆言事者若法相之事即如是等若事境即王城等若下文中觀解五事不出附法託事二觀即附法相之事及託事境之事也故義例中明妙玄託附二觀但云託事興觀義立觀心良由此也。",
    "X20n0360_001:0373c08_0": "次此經下明同聞眾不次言不聞前序者以信相室在王城中前序在於耆山故也故王城東北出至耆山有十四五里言不聞後夢者以後夢事亦在耆山說之故也若據信相出城至山亦有無量無邊眾生與菩薩俱是則此眾但聞夢事不聞前序及以壽量亦得是同聞者同聞壽量也亦得是非者不聞前序及以後夢故亦得是非同聞也準例信相且出至山與眾生俱亦得云是同聞眾亦得云非同聞眾也同聞眾少不次第者以天龍等集信相室雖得同聞壽量果宗然而不同諸經列眾在住處後是故謂之少不次第也(亦如圓覺經於通序婆伽婆後即明別序入定現相於現相後方乃列其菩薩之眾故凡解諸經須知別序之意若不爾者將何以明正宗之旨故金剛般若楞嚴圓覺彌須詳審)。",
    "X20n0360_001:0373c20_0": "注云云者令辨同聞不次第意一者同聞雖不次第不可謂之無同聞也二者指於下文自辨此經時處眾坐非一是故不列三者讖本雖少不次諸師所翻或恐有之故玄義判教中云難者以不列同聞為疑胡本尚多何必止四卷七軸或其文未度耳故唐義淨譯金光明最勝王經於序品中列陳如等諸比丘眾列無障菩薩等眾列諸天龍八部等眾四者此經又龍菩薩集信相室聞於壽量不聞前序及以後夢且約顯露作此分別若論秘密豈可不聞又復顯露雖不聞於前序後夢義推亦識與聞無異若不爾者常果豈不與法性冥而起懺歎之大用耶又前序中既乃謂之若有聞者則能思惟無上微妙甚深之義何容城山兩眾永隔有此等意故注云云今略辨之餘俟後德言云云者象氣之分散如雲在天非可卒量也意言下未說者尚多如雲故也。",
    "X20n0360_001:0374a11_0": "此之五六下次述異名不同文為二初正述名印定序三世諸佛經初皆安如是者應云皆安如是等也大論云佛將涅槃阿難心沒憂海阿泥樓馱語阿難言於未來事若有疑者及時諮決何為憂惱如世凡人阿難即以四事問佛一問滅後云何修道二問滅後以誰為師三問滅後惡口車匿云何共住四問佛經初安何語佛告阿難現在滅後依念處修道解脫戒經是汝大師惡口車匿以梵法治(自〔時〕王種輕諸比丘佛去世後猶不改之故令作於梵法而治謂默擯也又云梵天治罪之法別立一壇令犯法者入此壇中諸梵並皆不與共語若心調伏為說陀那迦旃延經令離有無即入初果乃是三藏雙非門也)經初應安如是我聞一時佛在某方國與其大眾非獨我法安如是等三世諸佛經初皆然故此亦得名遺囑序如來遺言令安著故又亦名為經前之序三世諸佛經初皆然故下謂之亦名經前序遺囑令安故同是此意也。",
    "X20n0360_001:0374b02_0-0": "言印定者印謂符印亦是印信如世文書得印方乃永為定準今此亦然淨名疏云如是等者亦為印定佛說非弟子及外道等說也亦名通序與諸經同者以諸經之初同皆安於如是等也此且約於名通而說若論體別復異諸經故云通序名通體別也亦為(去聲)通名作本故者為者與也淨名疏云因別名則名別序有別言教若因通名則有通序及約行理通別等因此而有通別兩序問若以兩序從兩名立者立名則前別後通(維摩詰所說四字別也經之一字通也金光明經別前通後例然)",
    "X20n0360_001:0374b02_0-1": "為序何得前通後別答立名之便應前別後通為序之便應前通後別復次一途亦前別後通何者如現瑞由藉是說經之前如是等六事是如來將入涅槃方說此語故知在後夫經題是總經文是別維摩疏中派總論別是故因於通別兩名有通別序良以序本序於正通故不乖於正說流通也今文乃擥別為總故云亦為通名作本今明通序故作此說至下別序例之可知孤山四明釋下別序為別名作本乃云別序異於眾經故立別題名金光明而釋今文通序亦為通名作本乃云金口所談皆安如是故通名經豈非誤耶亦名經後序結集者所置者以佛說經至入滅後阿難結集方乃安於如是等也言遺囑者即臨滅時貽遺善言囑付阿難令安故也亦名破邪序對破外道阿塸(烏侯切亦作歐又作漚)",
    "X20n0360_001:0374b02_0-2": "者法華文句別釋如是方云對破外道阿歐今雖總釋如是等五亦且別從如是兩字對破阿塸言阿慪者阿者無也慪者有也一切外書以此為首以其所計此二為本部內所明不出此二故佛經初安於如是對破阿慪不如不是故依佛法離有無見爾乃得道故百論云外曰汝指何為善法邪內曰惡止善作外曰汝經有過初不吉故我經不爾初後皆吉內曰凡一切法有於三種謂自他共以汝吉法無自等故故我先破有無自生及他共等故計有無為自他等名之為惡故我經先止若爾中論具破四句彼何不破自然答計自然者有無中(如止觀中引周弘政明三玄云易列八卦是約有明玄老子虗融是納無明玄莊子自然是約有無明玄)",
    "X20n0360_001:0374b02_0-3": "亦有自然有無不攝且從一途故中論云從因緣生尚自不可況無因緣自然易破故但況之但四計義通今且論破外耳若後三教破於四計具如止觀非此可盡亦名證信序令聞者不疑者淨名疏問何故經初安如是等答安如是等乃為斷疑勸信故也故如是等正為獎成佛去世後見聞之徒息疑增信自利利人功成道就涅槃疏云如是者所傳之理我聞者能持之人一時者會理之時佛者稟承之主住者所聞之地眾者親承之伴展轉相證勸信非虗欲使將來順而不惑證信不疑其義若是。",
    "X20n0360_001:0374c22_0": "次天台下今家約四悉判天台師云總此六說都是四悉者以前六義元出古師及大論等如印定序云三世佛經初皆安如是等文在大論又付法藏傳云三世佛法初皆安如是等如通序名本出古師故涅槃疏云舊呼為通序別序也如破邪序文出百論證信序者亦出大論此之六說既出古師及大論等故章安舉天台師云不出四悉也悉是華言徧也檀是梵語施也佛以四法徧施眾生即華梵並舉也諸佛諸經同者指印定序及通序也三世隔別諸經非一皆有五六聞之歡喜故是世界經前遺囑經後結集並是為利將來世人生其善根故是為人(妙玄中簡為人生善是舊是正斷惡是傍是新對治破惡是舊是正生善是新是傍云云)破於邪外既是破惡故屬對治證信非虗順而不惑即得悟理是故乃屬第一義也。",
    "X20n0360_001:0375a12_0": "舊解下次別釋文為二初正釋文為五初釋如是文為三初約因緣釋文為二初敘諸師釋文為四初舊師解似瀉水分缾者涅槃經云阿難受持十二部經為人開說猶如瀉水置之異器法華文句云親承佛旨如仰完器傳以化人如瀉異缾次肇師釋什公四子生肇融叡僧肇法師京兆人也(京兆府屬雍州)家貧傭書為業遂因繕寫乃歷觀經史性好玄微留心莊老嘗讀老子乃歎云美矣然而棲神冥累之方未之有也及見維摩經乃歎云始知所歸矣遂師於什公作物不遷論不真空論般若無知論涅槃無名論及與諸德注維摩經故今所引即注文也三真諦釋四龍樹釋文在大論(初生之時在於樹下後為龍王接入大海由斯悟道故名龍樹又龍樹者華梵並舉也以梵語那伽曷樹那此云龍猛故也)次此之下今家約四悉判注云云者判前四解各據一悉亦且一往如法華文句以肇師解如是為第一義悉檀故知今判且一往耳又今所判成於四悉若文句記乃云諸家異釋多在因緣而第一義尚少況有約教等邪。",
    "X20n0360_001:0375b05_0": "次今作下約教義釋又為二初標次佛如下釋文為二初通釋注云云者通必貫別別豈異通故以通望別而佛如法相說等須含四教之意也如下具引法華文句次別釋又為二初正釋文為四初破邪明正文為二初破邪文乖其理者阿慪有無邪見之文乖見之文乖於正理非有非無也良以正理不當有無故也理異其文反此可知次文如下明正文如其理者文稱理也理如其文者理稱其文也以由文理俱離有無之計故也法華文句云佛明俗有文字真無文字阿難傳佛俗諦文字與佛說不異故名如因此俗文會真諦理故名是此即三藏經初明如是也。",
    "X20n0360_001:0375b16_0": "次今謂下破異明同文為二初破異二諦各異者實有為俗實有滅為真既不相即乃成各異也言理淺者偏真權理非中實之深也摩訶下次明同摩訶衍此云大乘而通教是大乘初門幻有為俗幻有即空為真二諦不隔故云相即問通教名為大乘初門為約當教為通別圓若妙玄之中有此料簡彼文乃約通於別圓名為初門良以摩訶衍門正通實相傍通真諦故也今言理深即是遠通別圓中道理深既是遠通中道二諦相即豈可不然應知此義亦有傍正傍義如向正則名為含中入真之二諦也法華文句云佛名即色是空空即是色色空空色無二無別空色不異為如即事而真為是阿難傳佛文不異為如能詮即所詮為是此則通教經初如是也。",
    "X20n0360_001:0375c05_0": "三今謂下破淺明深文為二初破淺前明通教既云理深今明別教言破淺者以通教是帶淺明深今但破前傍通之淺故云破淺耳言同聞者同聞無生也言各解者聲聞總相體法入空緣覺別相體法入空菩薩具修總相別相故大本四教云佛說實相(真諦)分為三種若得實相滅諸煩惱名聲聞乘若生大悲發無上意名為大乘(即菩薩也)若佛滅後時世無佛因遠離生智名辟支佛乘故同聞無生之法而分三乘之別名為同聞各解也證入優劣者如大經中三獸渡河之喻也象喻菩薩馬譬支佛兔如聲聞河水喻於即空之理三獸渡河而象力大馬力次之兔力最劣河水雖一而象馬兔脚有長短所以渡河有淺深異是故三人雖同入空而聲聞人但除正使緣覺侵習菩薩斷正扶習潤生故知入空不無優降四明約於利鈍菩薩證有真中以明優劣恐非文意唯菩薩下次明深者唯者獨也別教乃是獨菩薩法所以云爾法華文句云佛明生死是有邊涅槃是無邊出有入無出無入中阿難傳此與佛說無異為如從淺至深無非曰是即別教經初如是也。",
    "X20n0360_001:0375c24_0": "四今謂下破離明中文為二初破離言離邊明中者約所聞之教而說也出二諦外有中道者約所到之理而言也若謂不然辭則煩重文字性離下次明中者淨名疏云文字性離者不在自他四句也即字是性性本不有故云性離也即是於如者淨名經云文字性離則是解脫今既釋如故須變文所以謂之即是於如也故言如者故今經中初言也一切法即佛法者二諦即中道也法華文句云佛明生死即涅槃亦即中道況復涅槃寧非中道真如法界徧一切處一切諸法無非佛法阿難傳此與佛說無異故名為如如如不動故名為是即圓教經初如是也。",
    "X20n0360_001:0376a11_0": "初破邪下次約部教結判文為二初約教結判次此經下約部結攝通被根性作種種說即是被於四種根性說於四教問若約四教分文句者玄義判教何故在通帶別明圓不言三藏答以教對部則方等部一往對通既乃帶別明圓寧不兼於三藏況復藏通從教雖分所證理一故判教屬通不妙三藏也。",
    "X20n0360_001:0376a17_0": "三約觀心釋者法華文句但有因緣約教觀心無本迹者以法華文句云若釋他經但用三意為未發迹顯本故也於中為二初正釋此中不分四教觀異者法華文句云觀前悉檀教等諸如是義並是因緣所生法者即通觀也因緣即空即假者別觀也二觀為方便得入中道雙照二諦者亦通亦別觀也悉是中道者非通非別觀也今云觀與境冥為如者能如如於所如故無異也境即正觀為是者境既即是理則無非故云是矣經言下次引證普賢觀經十六觀經皆作是言此四觀字必以初三作平聲呼第二第四作去聲呼邪正之言義有通別四教迭論別則唯圓名正以凡附文作觀多分在圓故也。",
    "X20n0360_001:0376b05_0": "次釋我聞為三初約因緣釋又為三初舊師釋次真諦釋三論解大論問曰云何聞用耳根聞用耳識聞耳意識聞耶答云耳根不破聲在可聞處欲聞憶是事情塵和合故耳識生隨耳識能分別種種因緣得聞聲問應言耳聞那云我聞答我是耳主舉我攝眾緣也應知耳識四緣方聞一根二境三空四作意根即耳根清淨四大勝義內根非浮塵外根四微也境者聲塵也空即可聞處也作意即作心欲聞憶是事也情塵意和合者總舉四緣具足故耳識生也舉我攝眾緣亦是四緣和合也若是眼識乃從五緣而生於四緣上更加明緣以眼為根以色為境以明為照以空不礙以作意發起由此五緣眼識乃生今此耳識不假明緣故但四緣也故知一時是聞持和合即四緣具足若一緣有闕則不和合也若讀法華文句及記應知此說亦見彼文存略差誤具如大部補注中示(云云)此中所以不約四悉判者準前可解故不煩文若欲判之應以舊解是世界真諦是對治釋論因緣和合是為人阿難與聽眾述佛遺旨是第一義若法華文句乃判釋論是世界今且從一往故如上判之耳。",
    "X20n0360_001:0376c01_0": "師釋我下次約教義釋文為二初正釋又為二初開釋即是分聞兩字各釋於中為二初釋我配者匹對也四根性人即是四教根性人也意令次第匹配對當釋其所以故注云云三藏根性謂有能所及以自他故云我我通人體達自他即空名我無我別人十住入空無我十行出假建立於我圓人達於有我無我二邊即中故云不二中道是實即真我義也次釋聞者文句記云此中亦用大經四句然大經顯圓今乃義開竪約四教隨名便故不復次第大經顯圓具如大部補注中示今順教意釋四聞者藏人謂有能聞所聞故云聞聞通人體達能所即空名聞不聞別人入空復能出假名不聞聞圓人達於二邊即中是故名為不聞不聞即不聞於有不聞於無也四教法人者上文釋我則單言人今此釋聞則兼於法即能聞之人所聞之法也有此之意故注云云若淨名疏乃以通教為不聞聞者以如夢如幻點空說聞也以別教為聞不聞者以所聞自在世諦死時即聞聞死而生聞持隨有所聞自在能持也。",
    "X20n0360_001:0376c19_0-0": "有四種不次合釋者即是合於我聞二字總釋之也阿闍世王懺悔經及付法藏傳明三種阿難又法華文句引正法念經明三種阿難一阿難陀此云歡喜持小乘藏二阿難跋陀此云歡喜賢受持雜藏三阿難婆伽此云歡喜海持佛藏又阿含有典藏阿難持菩薩藏蓋指一人具於四德傳持四種之法門耳妙玄第十章安私錄中引經論明四藏云一聲聞藏二雜藏三菩薩藏四佛藏釋籤云聲聞雜菩薩佛次第以對四教之義意亦可見是故今云為四種緣立四種名也然四種阿難親承四佛不周者此約教體明四佛身與教相當是故四佛各附教體以明其相何者三藏既談苦空生滅是故丈六八十無常通教既是大乘初門正通中道傍通真諦是故名為丈六尊特合身佛也合者共也界內分段丈六生身與夫界外法性尊特共合故也故法華文句云若尊特佛與丈六佛共放光者通義也孤山云一身兩見名為合身四明云只一佛身由利鈍根見二種狀故云合身並非義也別教既談法門無量是故但名尊特之身以尊特身光明相好無邊故也圓教既談法界實相是故乃名法身佛也故法華文句云三藏教佛身長丈六壽八十歲老比丘像帶比丘像現尊特身即通教佛(下文又引像法決疑經證通教佛云或見小〔身〕文句記云通佛云大身小身者以云帶老比丘故由是明之帶比丘像即是小身丈六而已現尊特身即是大身巍々特勝祖師格言昭著若此而四明云通教丈六尊特合身不定約相多少分之意謂合身不須現大便是尊特若丈六外有尊特者熾然待對中義不成以此言之四明灼然錯解通教丈六尊特合身之義今人雖欲扶助四明如何消通法華文句及記耶)",
    "X20n0360_001:0376c19_0-1": "即別教佛隱前三相唯示不可思議如虗空相即圓教佛文句記云若云坐蓮華藏或云三世諸佛皆色究竟成無上道並別佛相乃至云(為引別佛之文且略圓佛之說)別佛既云單論即是隱前二相如目連不窮其聲等(四明云丈六身聲不必待現名為尊特今謂不然故輔行引目蓮欲知佛聲近遠如來即現清淨音〔場〕目蓮承佛力去至西方九十九恒河沙佛土至彼聞聲猶如對面又引應持菩薩欲量佛身即自變形高三百三十萬里復見佛身高五百四十三萬兆垓二億里以至上方〔恒〕沙世界永不見於釋尊之頂然後結云身聲既爾諸相例然坐蓮華臺居色究竟等並此相也由是明之諸文凡說現尊特身皆是現起身光相好無量無邊其間乃有全現分現一相二相至多相等隨文可知不煩具引故通教佛丈六尊特乃是大小共論謂之合身義耳所以帶比丘像現尊特身即是於其界內分段丈六小身現於界外法性尊特高大巍々耳然須了知五時教主始終之相莫不皆分段生身文句記云實位補處輔應化佛示歷五味良由此也而梵網云我今盧舍那方坐蓮華臺周巾千華上復現于釋迦者此明從勝現劣耳亦是從本現迹也淨名疏云四度現尊勝者此明從迹現本耳亦是從劣現勝也高麗四教儀云爾時如來現盧舍那身說華嚴者即此意也華嚴既爾二酥法華現相可知然則從劣現起尊勝表彰雖爾收光攝相[(白-日+田)",
    "X20n0360_001:0376c19_0-2": "/廾]劣宛然是故法華別序放光即是從於丈六[(白-日+田)/廾]劣現於尊特勝相巍巍以至佛從三昧而起必須收光但是經文略而不說耳以所表事辨須〔敘〕眾心入於一實故也故淨名疏問云何以得知現尊特身表說實相答法華云我以相嚴身光明照世間無量眾所尊為說實相印又序中云今佛放光明助發實相義豈非皆是指前別序放光現相表彰之意而四明云大乘圓妙不立生身又謂生身丈六[(白-日+田)",
    "X20n0360_001:0376c19_0-3": "/廾]劣不須現起尊勝巍々可不誤哉若謂法華別序不是從劣現勝而為表彰何故淨名疏釋別序現相表彰具明四度現尊勝又料簡問答指放光說實相為尊持耶何故法華六瑞是現相序耶文句云感則大乘機發應則圓毫照之名為勝應顯與淨名疏云四度現尊貴瓔珞嚴身皆譬釋迦勝應宛如符契何謂劣應不現便是勝乎以此驗知四明所立法華教主即劣是勝不須現者灼然違於別序現相矣請有識者熟讀淨名疏及法華文句釋別序現相之文自知四明所立之誤也)",
    "X20n0360_001:0376c19_0-4": "若隱前三相從勝而說非謂太虗名為圓佛乃至云法華已前三佛離明隔偏小故來至此經從劣辨勝即三而一(圓佛法身猶如虗空不可思議隱前三佛報應之相乃是從於最勝而說非謂棄捐前三報應於外別求如太虗空名為圓佛其實即前三佛報應是圓法身猶如虗空不可思議故云隱前三相從勝而說非謂太虗名為圓佛也例如止觀明通佛〔云〕如來相好皆如虗空空中無佛況復相好輔行釋云所云空者相即非相非謂無相世濫用之彌須誡慎彼文與今通圓雖異語勢大同若不爾者文句既云如虗空相即是圓佛記中那云非謂太虗名為圓佛故知記中但是遮人於三佛外別求圓佛所以謂之隱前三相從勝而說非謂太虗名為圓佛故須即前三佛報應是圓法身猶如虗空不可思議方是今家之正意也故下即云法華已前三佛離明隔偏小故來至此經從劣辨勝即三而一豈非即從前三教佛報應之劣而辨圓佛法身之勝名從劣辨勝是即三而一故下諸文皆以佛眼佛知見等名之為勝即其意也以四眼二智報應二身是用佛眼種智法身是體今從四眼二智報應之劣以辨佛眼種智法身之勝是即用論體名開權顯實故妙玄明今經之體乃云開垢衣內身即瓔珞長者然須了知今文從劣辨勝是即用論體妙玄開垢衣內身即瓔珞長者正是即用論體仍顯報應勝劣二用同體相即何以知之以內身是體報應勝劣衣瓔是用既云垢衣內身即瓔珞長者是同體權實豈非即用論體仍顯體同相即乎故知今文與妙玄大意是同但在文小異耳是以今文從劣辨勝即三而一不可妄作丈六尊特勝劣說之四明準此立丈六之劣是尊持之勝豈非濫說之甚乎又復應知非謂太虗名為圓佛亦可謂之太虗圓佛徧同理太虗乃絕一切色像圓佛乃具三千世間雖通此說前義為正故即前三報應之劣是圓法身如空之勝名從劣辨勝是即三而一非謂離前三佛之外別求圓佛法身如空也)",
    "X20n0360_001:0376c19_0-5": "若得實意方知四佛體同用殊(體同用珠例如法華文句云體即實相無有分別用則立法差降不同體同故相即如玄籤所明開垢衣內身即瓔珞長者內身者內體也體既是內用豈非外故義例云法與報應一體無差以至諸文凡說相即及非一非異等莫不皆約體同之義體同故雖則相即用異故勝劣不濫故釋籤指法性尊特是約界外得作此說文句記明法華師弟身俱[(白-日+田)",
    "X20n0360_001:0376c19_0-6": "/廾]劣是隱尊勝瓔珞寂忍而現丈六垢衣拙弊故知衣瓔外用須分安可濫說以劣為勝乎若不約於體同常即用異常分豈可玄籤明開垢衣內身即瓔珞長者文句及記乃云師弟身俱[(白-日+田)/廾]劣俱隱寂忍而耐其拙莫是玄義明開文句及記明隱明著開著不同成天殊之謗乎然今文云體同用殊者釋籤明法華華嚴二處會主釋迦舍那衣瓔少殊內身不別乃是用異而體同耳且從用邊須分故云衣瓔少殊其實理體是同故云內身無別故文句釋始見我身等文約十義明之然後結云緣宜不同略為十異種智法界等無差別故知華嚴會主舍那尊勝瓔珞法華會主釋迦卑劣垢衣乃是緣宜不同從用少殊耳至論實相法身內體復何差別哉然此乃約華嚴法華對論用異理體無別若文句釋信解品中乃以華嚴對於鹿苑明於用異體同之義故文句云衣瓔有異人只是一又云隱顯有殊何關體別然則在昔用異體同須約佛意良以佛意非適今也故得華嚴對於鹿苑明衣瓔有異人只是一何關體別也若跨節開權唯在法華故得華嚴對於法華明用異體同如玄籤所說也故體同用異體同其言雖互其旨無別旨雖無別終不可以體同相即而濫用異常分若不爾者何故謂之體同用殊)",
    "X20n0360_001:0376c19_0-7": "講華嚴者皆云我佛讀唯識者不許他經(講華嚴者皆云我經是舍那佛說遂尊華嚴為勝餘經是釋迦佛說乃排之為劣良由不知體同用異讀唯識者自宗其論以為臻極不許他經所說之義良由迷於法華是佛究竟之談故至法華開顯方知華嚴在於昔日唯識乃是申通方等耳)。",
    "X20n0360_001:0378a04_0": "次此經下約部結攝注云云者令引經文以示三乘說聽之相故玄義云方等之教通於三乘故新本云欲生人天欲得四果緣覺及佛皆應懺悔即此意也三約觀心釋中言攀上厭下觀者即世間禪中六行觀也凡夫之人依文行觀佛弟子多修八聖種(受如病想如〔癩〕行如瘡識如刺無常觀識苦觀於受空觀於想無我觀行名之為八雜心論云聖以此為種聖從彼生故云聖種)言六行者於初禪中厭離雙觀以初禪為厭下苦麤障以覺觀動亂逼惱是心故名苦以從覺觀生喜樂故名麤以覺觀翳二禪內淨故名障二禪異此名攀上勝妙出以二禪內淨安隱勝於初禪覺觀動亂故名勝以二禪之喜因內淨而發故名妙以若得二禪即離覺觀故名出二禪以上乃至四空準說可解欣三厭三各隨用一展轉皆以自地為下厭自地故名為厭下欣上地故名為攀上文句記云佛弟子中亦有修於六行觀者故今用之凡約觀解並須順於佛弟子故既有欣厭彌顯自他故是三藏我聞聞析體兩種從假入空皆是我無我者驗知前明我我聞聞乃是三藏實有之假未可濫作析假入空釋之也故今方明折假入空即是三藏實有滅為真體假入空即是通教幻有即空真既並從假入空故皆是我無我別圓二觀如文可解皆言若作者隨機不定故也。",
    "X20n0360_001:0378b02_0": "三釋一時文為三初約因緣釋文為三初肇師釋啟者初聞也運者合宜也嘉者善也佛化大運必稱物機故云嘉會也次三藏釋文為二初正明若通者高時也不及者下時也私謂下次章安釋出者恐人不曉高下之言故為釋出言私謂者倉頡篇云不公也既非大師當眾所說又非親對大師印述但是自己於結集時私安其語耳師釋下三今家釋者既言眾生感法佛慈赴教機應之時故知今文須約因緣而釋之此即法華文句云若時與道合者第一義也肇云法王啟運嘉會之時者世界也亦可兼於為人生善三藏平時不高不下即對治也。",
    "X20n0360_001:0378b13_0": "次亦是下約教義釋文為二初釋時注云云者意令釋出發真見諦義兼藏通法眼照世即別教也佛眼照中即圓教也故法華文句約教釋時亦云見諦等也而言下次釋一者先斥非故云斯二非一也次顯是故云妄斷豁悟也亦應於此注云云字文無者略良以妄斷豁悟之言義含四教故也。",
    "X20n0360_001:0378b19_0": "三約觀心釋注云云者意令以三配於四教觀心之義準前約教釋時可解。",
    "X20n0360_001:0378b21_0": "四釋化主文為三初約因緣釋文為二初引真諦然外道輩其類有三謂一切智神通韋陀今亦不論三種之別但將佛證一切智異外道愚癡邪計無量二乘自度不能濟他是故以佛慈悲異之諸小菩薩用心猶偏是故以佛平等異之餘人無此者顯佛獨有也觀云尊極名佛故知亦異諸大菩薩以諸大菩薩在於因位故也次引釋論云佛是第九號者輔行云大經解釋為十一句大論合無上士調御丈夫以為一句乃至世尊為第十句涅槃疏云成論與阿含合無上士與調御丈夫為一號至世尊十數方滿涅槃與釋論開無上士與調御丈夫為二號至佛則十名已足總結上德十號具足為世所尊故云世尊此與輔行今文不同恐章安誤也佛名為覺者西云佛陀舊翻覺者又釋論中翻為知者對迷名知對愚稱覺名同對別並屬自覺即以自覺而覺於他涅槃疏中引地人云自覺覺他章安斥云復言覺他此太煩矣(云云)覺世間者解苦集也覺出世間者解道滅也淨名記云常即定法無常只是不定之法於三學中如毗尼藏有心犯重定為業障名之為定餘戒不障名為不定今謂常無常既爾數非數恐約真俗而明之也。",
    "X20n0360_001:0378c18_0": "天台下次約教義釋文亦為二初正釋前明四教我聞不同故分四佛身相有異今對三智是故但明三佛差別若開三為四則一切智有丈六佛屬於三藏依道種智有丈六尊特雖正屬通亦兼於別即以尊特兩字兼之而言道種智者即是通別出假菩薩也孤山云文中剩丈六兩字雖或由解義終不便今謂非剩義亦甚真汝自不曉耳一切種智有法身佛屬圓可見知一切法空寂一相名一切智知一切法諸道種別名道種智一相及諸種行類皆知名一切種智若唯約圓明三智者佛智照空如二乘所見名一切智佛智照假如菩薩所見名道種智佛智照空假中皆見實相名一切種智故言三智一心中得也次三佛下融通云不得一異者以若有一異即乖法體寂滅清淨也非一異而一異者破性執已無妨隨緣作一異說無名相中假名相說良由於此一文既然餘皆準識學者知之。",
    "X20n0360_001:0379a10_0": "三約觀心釋注云云者意令以三對四教耳準三智說亦應可見又令辨於中觀之體雙遮故無一異中觀之用雙照故亦一異耳。",
    "X20n0360_001:0379a13_0-0": "五釋住處文為二初總釋次真諦下別釋文為二初釋住文為三初約因緣釋文為二初引真諦釋次釋論下今家以釋論攝之今先引文句記明釋論四住之義次明攝於真諦八住之相初意者文句記引論云住者四儀住世(論云行住坐臥也又云以怖魔軍眾自令弟子歡喜入種々諸禪定故在此中住今家諸文皆不引此)復有三種一者天住謂欲天(論云六欲天也)二者梵住即色天(法華文句亦同此說恐是存略何者以論中明始從初禪終至非想皆是梵住故也)",
    "X20n0360_001:0379a13_0-1": "三者淨住即三果已去(論中但言聖住不云淨住又復論中但言諸佛支佛羅漢名為聖住於三住中住聖住法愍眾生故住王舍城不言三果已去記中所引恐是誤也然淨名疏與觀經疏明四種住文同大論但淨名疏偏引四住之因觀經疏中具引四住之因果耳又復論中既云諸佛支佛羅漢而觀經疏言三乘者以〔語〕佛是果菩薩在因故以菩薩乘顯於諸佛耳記中又解文句云住三三昧引論云入三三昧即得初果論中解住即無此文亦恐誤也)",
    "X20n0360_001:0379a13_0-2": "論又云布施持戒善心為天住四無量心為梵住(記中注云前從果此從因論云慈悲喜捨名四無量心也)三三昧為聖住聖住只是淨住耳(論云空無相無作是三三昧名聖住法聖住之法佛於中住故知論中兩番釋於三住不出先果次因耳記中謂之聖住只是淨住者亦恐〔說〕會其名也)論又有四住天梵聖佛更加佛住即今文中首楞嚴是故今四住收論文盡(論云又四種住天梵聖佛三住如前說佛住者住首楞嚴等無量三昧十力四無所畏十八不共法等是知四住但是更加佛住對前兼舉是故乃云又四種住耳)",
    "X20n0360_001:0379a13_0-3": "若以教收四教並有前四悉義(以文句中將四種住對四悉故)四佛並為第一義天但前二佛不得云用首楞嚴耳問今釋佛住何以三悉但約欲色及以三果(文句中以四儀住世為世界悉天住梵住名為人悉聖住為對治悉記云但約欲色及以三果者準前思之欲色之言亦是存略耳)能住所住俱非佛邪(然論文明三種住中兩番皆云住聖住法佛於中住但天住梵住并不云佛住耳)",
    "X20n0360_001:0379a13_0-4": "答一從通以趣別二將勝以攝劣言從通者從廣之狹言從勝者佛依王城必攝欲色及以三果(三果之言準向思之)有人斥云今釋住王城何以引於天梵等住此人不曾讀大智論此是彼論釋住正文若只以色身住土以釋住名則大菩薩神無方所便無所住況復佛邪故知他人唯許色身依於王城乃成佛無心所依法故普賢觀明常寂光是佛住處豈王城耶(此斥慈恩基法師也故慈恩法華玄贊云住者游化居處為義居止在山游化城中佛依此中游化安處古人因此乃云聖天梵佛住等住名雖同義意全別語邃義幽之處曾不屬心名同理別之文虗張〔授〕據此為未可也明師鈔云此四名住心安處義今經言住身居止義身心不同是故全別以此驗知慈恩不曾讀於智論若曾讀者何以分於身心兩別豈可龍樹解般若經住王舍城不如慈恩當代大乘師孰過於龍樹何得斥云名同理別之文虗張援據耶若乃但云居止在山游化城中則成佛住王城山中身心全無所住之法是則語邃義幽之處曾不屬心反成自責矣何關今家耶)",
    "X20n0360_001:0379a13_0-5": "。",
    "X20n0360_001:0379c01_0": "次明攝於真諦八住者應云天住梵住攝其天住住禪定及梵住住四等也言定住者恐語倒耳以欲天中亦論欲定故得攝之然真諦云住禪定者須通色界四禪無色四定是故梵住別云四等故大論云梵住是四無量□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□住即欲界六天也聖住攝□□□□□□義全同亦乃攝其五分法□□□□□□解脫解脫知見謂無學□□□□□□□解脫智眼謂自□□□□□□□□□□故灰身則□□□□□□□□□□□□在則五分得住也佛□□□□□□□□是住於首楞嚴耳又有迹住王城攝□□者論云於三住中住聖住法愍眾生□□依止住同既住王城其身豈不行住坐臥況復王城乃是三千大千界內故知論云住於王城攝於真諦之三住也。",
    "X20n0360_001:0379c17_0": "次天台下約教釋者準前約於三智釋佛意亦可解但三智約□而三諦約所依之理耳又前三佛文從合說今此四住□從開說準前釋於四種阿難親承四佛□□□□□□□道種智有丈六尊特佛而今論謂之丈□□□□□□□□□□□□□□□□□等者若單論丈六則住真諦若單論尊特則住中道□□□□□□□□□□□□尊特二身既合是故名為雙住真中此是約於真中合說故與前文道種出假亦須分別何者以由通教出假利根能見不空乃是中道況復別教或在於假或在於中假□□□□道同圓中則但是教道而已是故謂□□□□□□□□□俗則攝前依道種智有尊特佛中則□□□□□□□□□中法身佛住中道可解但尊特是中道之用法身□□□□之體耳然法華文句釋達多品約四教明相好之本此類土體與教相當之意耳若止觀對治攝法中復以藏通證真如銅別圓證中如鏡故知諸文隨義非一(云云)。",
    "X20n0360_001:0380a10_0": "三約觀心釋準前思之。",
    "X20n0360_001:0380a11_0": "次釋處文為二初釋王城又為二初約因緣釋大者廣也多也釋論甚廣今略引之耳五山者法華文句云一名天主穴二名七葉宂三名蛇神四名少獨力五名靈鷲又下文引真諦云五山(云云)排者推也文句記引西域記云此城崇山四周以為外郭東西長南北狹周一百五十里子城三十里城北門是調達放醉象處東北是身子逢馬勝得初果處。",
    "X20n0360_001:0380a18_0-0": "次約觀心釋此文稍略法華文句云王即心王舍即五陰心王造此舍者析五陰舍空空為涅槃城此觀既淺如見土木(如像法決疑云或見此處是土沙草木等)若體五陰舍即空空為涅槃城即通教也若觀五陰舍因滅是色獲得常色受想行識亦復如是此之四德常為諸佛之所游處若觀五陰即法性法性無受想行識一切眾生即是涅槃不可復滅畢竟空寂舍如是涅槃即是真如實體文句記云初立觀境言心王造舍者識陰為王造業諸心必有心所今欲消王且以善惡心王以對無記之舍故云王造若折下四觀此示觀解異於他經應如止觀十乘十境下去皆爾具如止觀不可即具孤山云五陰舍者境也心王居之者觀也四明云無記性同餘四陰為所觀善惡性為能觀今謂若準記云初立觀境若折下四觀則境觀能所顯矣然下文明耆山觀云常為心王所觀令一切心數同入其中者此如法華文句云心王心數緣境之義故能緣是觀所緣是境具在彼文(云云)",
    "X20n0360_001:0380a18_0-1": "四明云善惡王數不離見愛若直以此心觀實相理如用藕絲懸須彌山徒增分別絕念無由若體此心是性惡者性惡融通無法不攝故達修惡即是性惡圓妙之觀初心可修故妙樂云忽都未聞性惡之名安能信有性德之行而性德之行須聞性惡者以知性惡故則修惡本虗三觀十乘無惑可破無理可顯故以性德召此行也(云云)今謂不然文句記云觀陰入界各具十界正當妙境山城雖約陰為所觀亦未結成不思議境又境據假邊且存其數空中尚無其數安有然必約假以立空中一文既然餘皆準此故輔行云能了妄念無一異相(空中寂滅非但亡於淨穢之法亦乃轉於迷染為淨)",
    "X20n0360_001:0380a18_0-2": "達此無相具一切心三千具足方能照於一多相即(妙假宛然)故金錍明性體性量性德三義第三性德方乃具於一多相即又輔行云大虗空中都無明暗明暗約色故有相除法性大虗本無善惡凡夫情謂善惡相除所以於惡令修止觀達惡無惡見惡體性即知體性本無善惡(義準具假善惡宛然)法華文句云明與暗共合如彼月光又日出時暗不向十方暗常在無所歸趣明亦如是與暗共合生死與道合道即是生死佛之所盡已盡所度已度又云燈生暗滅不可定其前後雖無前後暗定是障記云常在者只是暗無暗性舉暗是明迷悟亦爾理性無殊因位之明與無明雜入分真位破一分暗所破之暗體變為明豈智明發仍存先暗云常在耶雖云常在終須破盡究竟永淨方名常在(云云)",
    "X20n0360_001:0380a18_0-3": "而性德之行須聞性惡者以別教中無性德九故自他斷專緣理性而破九界反顯圓教空中之性若明必具妙假九界之惡(其實三千諸法宛然)故文句云若知地具桃李即識實中有權解無差即差若知桃李堅相即識權中有實解差即無差記中於是乃云忽都未聞性惡之名安能信有性德之行故知性德惡行乃是即實之權耳亦名即理之事無差即本之末即體之用故方便品文句記云誰知此經佛以惡行亦得名為善巧方便況輔行明妙境十界六道之法乃是為知性惡法徧又是妙境所攝之法耳故知能攝乃是空中寂滅之性也而初心用觀雖遮照同時但由自行唯在空中化他妙假三千赴物三觀一心自他不二故自行空中則第一義中一法尚不可得豈有三千耶世諦化他尚有無量法何但三千耶人不見之一向談於性惡之行不喜空中寂滅亡泯豈非棄本取末捨體欣用乎況達染淨空中自亡對華說空空無名字一尚無一豈泥性惡相相宛然絕念無由反成自責耳徒增分別豈在他人乎。",
    "X20n0360_001:0381a05_0": "次釋耆山文亦為二初約因緣釋翻鷲頭者亦翻頭者亦翻為靈鷲諸聖仙靈依之住故名為靈鷲峯形似鷲故云鷲頭又是鷲鳥棲之故也鷲黑色多子。",
    "X20n0360_001:0381a08_0": "次約觀心釋準法華文句今此即是別圓二觀也彼文先立觀境云若觀色陰無知如山識陰如靈三陰如鷲又云觀此靈鷲無常析觀也觀此靈鷲即空體觀也記云約山作觀亦先立觀境正當觀陰具如止觀第五去文(大義既指妙玄觀行亦指止觀題云文句良由於此)別圓觀中既云山即法性正因法身餘之二德準諸文說所以又約山為觀者山城雖殊同是依報是故約之以觀正報又諸觀境不出五陰今此山等約陰便故以諸文中直云境智亦應於此以辨二觀同異之相方便正修簡境及心并對前二辨權實等(云云)託事既爾附法例然昔人未曉妄謂託附不觀五陰不論簡境及心十乘等灼然違戾文句及記況空品文句云應引止觀境智何得不許以廣決略俾夫行者即聞即修故知四明頗得斯旨今豈人情妄生與奪庶幾後德精詳斐然(云云)心王及一切心數者若準法華文句云心數甚多且約善數有十謂信進念定慧喜猗捨覺戒此十數輔心王改惡從善革凡成聖(云云)文取通大地十數與心王俱起入善入惡徧通一切謂想欲觸慧念思解脫憶定受作觀悟已王數皆畢心心數法不行故普賢觀云我心自空罪福無主故無心無數名正觀成就自行空中若顯妙假三千宛然(云云)。",
    "X20n0360_001:0381b05_0": "次此經下明不列同聞眾所以文為二初正明此經闕同聞眾者謂今經城山文後不列同聞之眾也時有五處有四者謂聞法時會有五而所依處但有四也耆山聞敘述是一時也信相室聞常果是二時也夢中聞懺悔是三時也覺已與眾詣耆山聞說所夢是四時也讚佛品列眾至金寶山王佛國聞讚歎是五時也以聞說所夢及聞敘述皆在耆山故所依處但有四也既眾座非一故城山文後不列同聞眾也次若爾下釋疑文為二初立疑者若言眾非一座不列同聞者是則阿難在於耆山亦乃不聞信相室說又復不聞夢中所說經初不當稱於我聞次然雖下釋妨佛更為說者報恩經云佛求侍者阿難許已仍求四願一不受故衣二不受別請三諸比丘晨暮二時得見世尊莫令我爾須見便見(若讀法華文句記須知此文)四二十年中佛所說法重為我說佛粗示言端阿難皆解又其得佛覺三昧能自通達者舍利弗問經云阿難修不忘禪得佛覺三昧以三昧力自能聞也言佛覺者只是佛加覺力如佛耳三昧已證非從佛聞故云自能通達也阿難是佛成道夜生年二十五方為侍者已前諸經準向兩意尚得聞之況信相室說及夢中之說而不聞耶。",
    "X20n0360_001:0381c02_0": "次釋敘述發起兩序名別序文為二初通約二義分文又為二初總舉二義亦名別序簡異餘經者別序之言則兼敘述及以發起單言敘述但是別序之所攝耳應知別序望通得名通序文通而義通部含諸教故亦有義通而意別別在諸味故別序文別而義別不開他部故如持鉢合蓋事在當經亦有義別而意通通諸教故又通序文通而義別隨部對教多少別故別序文別而義通通敘部內教多少故為欲徧通通別故爾二序相對其名自分亦為別名作本如向已示。",
    "X20n0360_001:0381c12_0": "次別義為七下雙約二義分文又為二初約別序又為二初約七別分文又為二初分文次生起者只是次第復有通別通則七義皆具生起別則生在於前謂能生於後也起則在後從前起也佛常在定者如云那伽常在定(那伽此云龍亦云象其力最大故以喻之)羣眾也扣擊也故示軌儀者現於入定也出敘經王者此經始終皆在定中至讚佛品樹神虔請如來方乃從三昧起而今謂之出敘經王作謂出定但是定中發言敘述名為出耳若準義淨譯金光明最勝王云爾時世尊於日晡時從定而起觀察大眾而說頌言金光明妙法最勝諸經王是則出定雖異讖本而敘述序皆是佛作全同今意餘如下辨(云云)或時下次約三別分文言或時者下文解於壽量品云又一時重解等孤山四明皆云大師有時作此分章又云大師非止一迴講說故於一時別立名義今謂若準法華文句解方便品云有時解成就甚深未曾有法是結自行權實記云言有非其聽次別諮決時今亦例之或時一時並非聽次乃是章安別諮決時耳注云云者意言三別只是七別之所收耳又復三別且從大槩故下但依七別消文其意在此。",
    "X20n0360_001:0382a08_0": "言敘述下次約敘述又為二初分文細作可尋者以此分剖委細作意可尋經文謂所游法性是果上之三德聞者能思惟即是懷疑以由四佛護持故則能斷疑也敘懺悔品言破惡者壞苦盡業是也言生善者所生功德是也敘讚歎品生善者種智功德莊嚴是也破惡者滅除諸苦是也與無量樂又是生善也皆注云云者令如此對消更引玄義云懺品滅惡非不生善讚品生善非不滅惡也次六行敘空品破惡中破三障惡者然此六行前三行半是破三障後二行半是舉方法能空於惡注云云者令如此說更引玄義云空品雙導也破三障者如下所釋八部所護下注云云者意令說者擥下消今也飱字正作[(歹*又)/食]亦作飡七安切吞也彷彿者正作髣(芳往切)髴(芳勿芳味二切)相似也不審也薳(韋委切)猶遠也謂敘述之意只可名言相似附近不得迂闊薳遠求之則於敘述之文自然分明可見也注云云者意在於此。",
    "X20n0360_001:0382a24_0": "次料簡文為二初問次舊云下答文為二初敘他解文有兩番初番為二初正敘言集經者結集人也次若爾下今家破者初斥答是結集人言則但是論非是經也以經須是佛自親說及佛印定故也(應引大論五人說經委示其相)乖經文者經文既云我今當說何得謂之結集人耶以集經之人不得於經初云我今當說故也或云下次番又為二初正敘次若爾下今家破玄字與懸字同應作懸字若且依玄字說者玄者通也謂信相若能通敘下文一十七品復有何事更致懷疑乎。",
    "X20n0360_001:0382b10_0-0": "次又非下今家正明又為二初問應云既非信相又非集經者那忽作序耶次師云下舉南岳意答又為二初正答與金光明最勝王經宛如符契次釋難又為二初難次此無下釋文為三初正釋此無所妨者謂佛自唱作於經序無所妨礙也菩薩尚能安禪合掌以千萬偈讚諸法王文出法華別序偈中法華序品菩薩尚能安禪說偈今經序品如來入定豈不敘述故大論云聲聞入定則無所說如來在定亦能說法亦能游行又云佛雖常入定無覺觀麤心有不可思議智慧故亦能說法是故今經如來入游甚深法性不妨出言敘述諸品以至下文捨身品中從座而起禮塔等事皆無妨也由斯乃顯前文謂之入游法性出敘經王但是如來寂而常照口發於言名為出敘耳非謂出定也文云下次引證者經文既云我今當說若非如來豈得稱我故法華云我今亦復如是等皆是佛自稱我也孤山問云懺悔是信相說何得以我說是佛耶答信相既對佛說豈不蒙佛威加豈不為佛印定故信相說即佛說也四明云夢中金皷是佛法身以智扣故方乃隨機說於懺悔故知金皷是佛真我故云我說也今謂若從所表當依四明若約設教須取孤山(云云)",
    "X20n0360_001:0382b10_0-1": "大品下三引例者大品序品云爾時世尊出廣長舌徧覆三千大千世界熈怡微笑從其舌根出無量光是一一光化成千葉金色寶華是諸華上皆有化佛結加趺坐說六波羅蜜眾生聞者必得菩提彼文既稱為序此文豈可是正耶。",
    "X20n0360_001:0382c11_0": "釋入定為三下次別依七別之義解釋文為二初釋入定敘述二別次釋壽量初半品懷疑等五別初文又二初釋入定別又為二初分文次解釋文為三初釋能游之人又為三初釋是時文為二初引真諦釋次明今家釋者知機得道即因緣意慧眼法眼佛眼得道復是約教於中為三初總明次若慧眼下別釋佛欲下三結示言履歷者法華文句釋方便品初從三昧起云履歷法緣記云履歷即是歷事對境法緣即是內緣真理應知今文乃是定中履歷法性觀機授道耳。",
    "X20n0360_001:0382c21_0-0": "次釋如來文為二初標示次解釋文為二初略舉三藏次今家正釋又為二初正釋次成論下引證文為三初引成論小乘但以真理為實借小證大則以實相名為實道乘即能乘屬報智也次引大經文在梵行品中十一空者一內空二外空三內外空四有為空五無為空六無始空七性空八無所有空九第一義空十空空十一大空就智就行論來等者仍示經意也三引釋論文為二初正引次今家釋成應知今文釋成大論及前所引成論之文若準法華文句明二三如來云二如來者成論云乘如實道來成正覺故名如來乘是法如如智實是法如如境道是因覺是果若單論乘者如如無所知單明實者如如無能知境智和合則有因果照境未窮名因盡源為果道覺義成即是乘如實道來成正覺此真身如來也以如實智乘如實道來生王有示成正覺者即應身如來也三如來者大論云如法相解如法相說故名如來如者法如如境非因非果而無有異故名為如不動而至故名為來即法身如來也法如如智乘於如如真實之道來成妙覺智稱如理從理名如從智名來即報身如來也以如如境智合故處處示成正覺即應身如來也記云借成論小名以顯圓義也真身即是法報二身合明三如來者但離二為三耳然今文中約三諦釋大論如來三身可解若成論文既是證於智照理名如慈悲等名來故知法報合明真身且言於如耳應身成正覺且言於來耳況引大經就智論來豈不照理名如耶。",
    "X20n0360_001:0383a23_0": "三釋游之字文為二初正釋夫法性下次釋妨又為二初據理立妨次良以下約事答釋又為二初正釋良者實也斆(胡教切)者學也令諸眾生食甘雨味亦應言住者下文解釋開甘露門等一行半偈是明斷德以甘靈是諸天不死之藥食者身安力大體光譬諸佛斷德住大涅槃真常四德也為眾生宣說亦應言出者驗知前文出敘經王但是口出其言耳非謂出定也故法華下次引證者此乃引因以況於果耳。",
    "X20n0360_001:0383b07_0": "次釋所游之法文為二初釋無量甚深法性又為二初正釋又為二初釋無量甚深將者欲也體包等者如法華云其車高廣文句釋云橫周法界之邊際竪徹三諦之源底故言高廣記云法界三諦並非橫竪雖無橫竪法界從徧言橫則便三諦名異言竪則便不二互顯思之可見高廣與體兼而舉之故言法界及三諦耳故輔行云法即諸法界謂界分相不同故一切諸法皆以三諦而為界分言法性者亦是諸法具三諦性性亦性分不可改故三諦性冥始終無變亦可界法性法即是實相實相之理三諦具足斯皆舉一即三之義也三諦無形俱不可見(非三也)然即假法可寄事辨即此假法即空即中空中二體二無二也(釋非三也)心性不動假立中名亡泯三千假立空稱雖亡而存假立假號(而三也)委辨具如圓通記中(云云)。",
    "X20n0360_001:0383b21_0": "次釋法性中云二乘盡無生智者十一智中此是第九第十智也毗曇云盡智謂我知苦乃至我知道無生智謂我知苦已不復更知乃至我知修道已不復更修二乘法性淺者偏真之理也有限者但解六道是空耳是知偏真淺故有限不見心性三千世間即空假中法界三諦之深廣也如實智者即十一智中第十一智也今即圓教妙覺佛智名如實智耳橫包竪徹故言無量甚深者即前所謂其體高廣體包法界徹到三諦故前文云無量甚深即今法性之高廣耳今之法性即前高廣之體也不二互顯所以皆言橫包竪徹即一而三即三而一非前非後斯之謂也故此亦是體與高廣兼而舉之故言法界及三諦耳此則義當修二性一一復具三高廣不二三九離合具在諸文(云云)。",
    "X20n0360_001:0383c11_0": "又無量下次重釋無量甚深者前文正釋乃是中道雙照二邊今文重釋乃是二邊即於中道是則今文及前正釋總而言之蓋顯無量甚深法性一復具三體用不二耳無量具三者三解脫也甚深具三者三般若也無量甚深既各具三當知法性亦復如是故法性具三即三德也三九相即不二可知若不爾者將何以顯佛所游法圓妙難思於中又二初正釋次例如下舉例又為二初正引例論有三說初云一方名廣高遠名大下方及九方名無量次云下名廣中名大上名無量次云緣四方眾生心名廣緣四維眾生心名大緣上下方眾生心名無量今此恐引第三文耳俱與論文迴互不同尋之可見次準此下準例釋成。",
    "X20n0360_001:0383c24_0-0": "次釋諸佛行處者釋迦既爾諸佛例然故法華云唯佛與佛乃能究盡諸法實相佛智無量甚深故行處亦無量甚深者意明佛智以為能游法性以為所游故也言行處者所行之處即法性也是故下文樹神讚云如來行處淨如瑠璃兩足世尊行處亦空故法華云諸佛智慧甚深無量豈非今文佛智無量甚深之義乃能究盡諸法實相豈非今文行處無量甚深之義境智相稱是故乃喻函蓋相顯也過諸下三禮結簡菩薩居未及之地智之所行未能深廣者明菩薩所行雖是清淨不及諸佛所行清淨甚深無量也故地持云菩薩得九種禪乃至正習皆盡故言清淨禪者此明菩薩所行清淨也自下地去皆有餘習者上明菩薩所行清淨即等覺菩薩也若不開等覺者此即第十地也今明九地已還故云自餘下地皆有餘習耳佛住十地頂若入此禪過諸菩薩者此正釋經文過諸菩薩所行清淨也引淨名證云心淨已度諸禪定者引彼經中歎佛之文證於今文諸佛行處過諸菩薩也故知今文乃是先釋菩薩所行次方釋於過諸菩薩所行清淨耳大綱雖顯今更消文地持九種禪者彌勒菩薩造地持處明九種禪初名自性禪次名一切三名難四名一切門五名善入六名一切行七名除煩惱八名此世他世九名清淨禪於中略說又有十種一名世間清淨淨不味不染污禪乃至第九名離一切見清淨淨禪十名煩惱智障斷清淨淨禪如是菩薩無量禪得大菩提果菩薩依是得三菩提淨名疏引優婆塞戒經云九地斷見習十地斷愛習又引地持云離一切見清淨淨禪此據等覺故今約之以消此文一家圓斷義轉分明(此文者指淨名經云斷諸邪見無復餘習)",
    "X20n0360_001:0383c24_0-1": "又云圓教始從初住終至法雲圓斷諸見猶有習在等覺入重玄門千萬億劫重修凡事見理分明習氣微薄事等微煙故名無復餘習又云圓教補處四十一品並盡雖餘一品有若微煙乃可得名悉已清淨故約圓教說補處位悉已清淨若不爾者淨名經中歎菩薩德何故謂之斷諸邪見有無二邊無復餘習此與今文正習皆盡不亦同乎正習既盡豈非菩薩所行清淨乎通別惑者通惑謂見思別惑謂無明然別惑中雖則總含內外無知及以障中根本無明今正語其根本無明為別惑耳良以自行唯在空中仍由空中轉染為淨故也故若通若別皆有正習即此意也言皆盡者且約分盡也若爾清淨淨禪亦約分淨耳故上文云菩薩得九種禪也既云菩薩得之豈非分淨乎若空品云我斷一切諸見纏等即究竟盡也佛住十地頂者過第十地等覺也若入此禪者佛若入此淨禪豈可同於等覺是故便云過諸菩薩也淨名云等者淨名疏云言心淨者佛智窮源無法界惑也已度諸禪定者通論禪定乃通因果故大經云大般涅槃名深禪定窟豈得歎言心淨已度大涅槃耶今約別義禪定據因佛心約果果出因外故言已度耳問何以得知約別在因答大論云禪者此翻思惟修佛心智鑑圓明豈煩思惟究竟無學豈得言修又翻棄惡如來純淨之智何惡可棄故大經云有所斷者名有上士無所斷者名無上士故思惟等義皆是約因而言也故圓教六根清淨即自性禪初發心住即一切禪已究竟離虗妄顯自性清淨心如是乃至清淨淨禪破四十一品無明住無垢地如來心淨度此禪定登妙覺果故言已度故金光明云是時如來游於無量甚深法性過諸菩薩所行清淨彼疏既引此經為證故今文句亦引彼經而證也人不見之如何消釋此一段文孤山云通別各有正使習氣通盡已久望前總說故云通別正習皆盡耳今謂若準止觀云初信破見二信至七信破思八信至十信斷習引華嚴云初發心時正習俱盡界外未盡界內盡耳輔行云八信至十信習盡者習通界外塵沙無明引華嚴云初證初住却望十信故云界內正習盡也孤山之意恐例此說然亦且符次第之意耳四明云通惑正使圓七信盡習氣至佛同別習盡今謂此與止觀相違以止觀云八信至十信斷習盡故何得謂之習氣至佛同別習盡耶四明又解空品文句若通若別究竟盡在於佛云若至佛地不唯別盡通亦窮邊今謂此說語自相違前云通惑正使圓七信盡習氣至佛同別習盡今云佛地不唯別盡通亦窮□□□□□□有人云通惑正習圓住前盡別惑正習初□□□□□盡者約竪說也通別惑累若正若習至佛盡者約橫說也今謂止觀所明十信界內正習盡者且順教道次第之意耳以未入初住猶名教道也若依圓妙是則須明六即之義何者五品即是觀行三觀六根即是相似三觀初住已上分論三觀妙覺即是究竟三觀故知通別不出三惑三惑諦觀位位既妙何得前後橫竪兩分況輔行云從初已來三諦圓修與次第義永不相關此論麤惑任運斷處與次第齊是故謂之初信至七信斷見思八信至十信斷習耳故知通別正習皆盡須約圓妙不可復以次第之說而為妨也。",
    "X20n0360_001:0385a11_0": "次釋敘述序文為二初敘意分文今更論敘述五重玄義者此例如文句記云句句之下通結妙名品品之內咸具體等以經題是總經文是別且擥別為總既明五重大義若以總貫別豈可不然乎故今敘述五重大義即是以總而貫別也擥別為總符文可知斯之謂也故今敘述五重玄義與前敘下十七品義歸一揆矣。",
    "X20n0360_001:0385a18_0": "次解者下隨文釋義文為五初釋敘名文為二初敘他解鑛(古猛切)者金璞也次今明下今家與奪屬敘名者即玄義云以金為名名蓋眾實之上也(云云)。",
    "X20n0360_001:0385a21_0-0": "次經王下釋敘體者今文既將諸經之王以為敘體文句記中復云諸經有明法身即是經王故知王體名義雖異中道法身理無差別而世人云王通三諦體局中道不亦誤乎經王上已說者即指玄義釋名中明十種三法橫竪該羅之義也又玄義中明帝慧王是也名體雖分總別相攝故諸經王以為敘體不妨指於玄義釋名若不爾者上文何故許他人云理乃當然邪於中為二初對上總標然玄義中但明佛所游入法性之理以為經王今文則是約教分別教與玄義不可雷同次三藏下正述文為二初敘真諦又為二初正敘三德攝三者今經三德攝於華嚴般若涅槃三經也故下即云今經通為八位人故稱經王也如玄義中亦引真諦云法身攝華嚴報身攝般若應身攝涅槃今家斥云此是彼師明帝王統攝之義八位人者即凡夫二乘及始行菩薩也孤山云二乘為二凡夫開人天始行分四謂信住行向也四明云二乘為二人天為一信住行向地為五恐誤也何者若將十地為始行處者為純陀等諸大菩薩說真常佛性也般若云法身佛為法身菩薩說法其聽法眾非生死人者佛及菩薩俱是界外法性之身非同界內分段生死無常遷謝之身也故淨名疏明實報土引大論云法性身菩薩說法其國無有二乘之名又云實報土是法身菩薩所居以其觀一實諦破無明顯法性得真實果報而無明未盡潤無漏業受法性報身菩薩既爾如來化此名他受用法性身佛也故妙玄引釋論云佛有生身法身生身同人法有寒熱病患馬麥乞乳法性身佛光明無邊色像無邊尊特之身猶如虗空為法性身菩薩說法聽法之眾尚非生死身何況佛邪又生身佛壽則有量法身佛壽則無量豈可以無常八十年加於法身邪釋籤云般若之中既為菩薩當知化主必非生死若非生死即是常身(六能之中即是常身常壽無量也)",
    "X20n0360_001:0385a21_0-1": "佛有二身者如大品中華積世界普明菩薩欲來此土彼佛令其問訊釋迦少病惱等論問何故諸佛問訊而言病惱答佛有二身生身有寒熱九惱法身無病故問生身不問法身(般若既爾法華準知故法華中分身侍者及地涌菩薩并妙音東來並皆問訊少病惱等故知法華唯除序品寶塔神力囑累妙音放光現相表彰之外莫不皆是分段生身故便問訊云少病以從分段生身放尊勝光明現奇特色相表彰竟已收光攝相〔又〕是分段丈六生身故也故妙音品云佛身[(白-日+田)",
    "X20n0360_001:0385a21_0-2": "/廾]小菩薩亦然法華既爾般若準知華嚴方等亦皆可解以淨名疏四度現相悉是表彰之意故也故此勝劣但約身相而分意在於此矣云云)教分二身為機劣故(界內之機形狀[(白-日+田)/廾]劣丈六八尺不同界外身相尊勝無量無邊)豈以為劣機故暫常(暫現之言豈是藏通故知須約別圓智與體冥能起大用能為界內身相有量及無常等以明暫現為劣機耳)",
    "X20n0360_001:0385a21_0-3": "即以無常加誣法性令無常邪(四明謂即劣是勝又謂華嚴法華現尊特是生滅之身豈非加誣邪)又妙玄云法身菩薩進道無定或從生身進道或從法身進道故地涌菩薩云我等亦自欲得是真淨大法釋籤云或從生身者如他方大士或從釋迦生身佛邊聞法進道(生身之言豈在藏通以此而知五時教主始終之相元是界內分段生身更何所惑故妙玄云釋迦住生身而顯一文句記云實〔佛〕補處輔應化佛示歷五味等而四明云法華教主不是生身豈非訛謬乎)",
    "X20n0360_001:0385a21_0-4": "或從法身者如大論云法身佛為法身菩薩說法此約界外得作此說(請讀斯文何得謂之生身[(白-日+田)/廾]劣不用現大便是尊特莫是荊谿不知中道感應即劣是勝輙指界外為法性尊特乎)。",
    "X20n0360_001:0385c24_0": "金光明經文句新記卷第一"
}