{
    "X23n0438_002:0279c08_0": "毗盧遮那成佛神變加持經義釋卷第二沙門　一行　述記　　入真言門住心品第一之餘爾時執金剛祕密主復以偈問佛乃至不知諸空非彼能知涅槃是故應了知空離於斷常者如上佛說經之大旨心實相門略以周備時金剛手為令未來眾生具足方便無復餘疑故以偈問佛請世尊廣演其義是中略有九句初句云何世尊說此心菩提生者即是菩提心生也如華嚴經廣說歎發菩提心功德今此中直問心密印云何了知此心菩提種子發生若已發生其性云何第二句復以云何相知發菩提心者相謂性成於內必有相彰於外如般若中廣明阿毗拔致相貌今此中亦問菩提心生時有何相貌也經云願識心心勝自然智生說者是如實歎佛功德請敷演前二句義初云識心是心自覺之智次又言心即是心之實相意明境智俱妙無二無別故重言之自然智即是如來常智唯是心自證心不從佗悟言佛既於識心人中最為第一必能知此菩提發生及其微相唯願說之也第三句云大勤勇幾何次第心續生者大勤勇即是佛之異名也歎德而復發問有幾心次第而得是心也第四第五句云心諸相與時願佛廣開演者問此諸心差別之相及相續勝進凡經幾時而得究竟淨菩提心也第六句云功德聚亦然者言是心微妙功德亦願世尊廣開演之故云亦然也第七句云及彼行修行者次問當以何行云何修行而能獲得無上悉地亦可分為二句也第八句第九句云心心有殊異唯大牟尼說者謂眾生異熟識心與瑜伽行者殊異之心亦願世尊分別廣說牟尼者是寂嘿義言佛身語心皆究竟寂滅過語言地以對二乘小寂不可為譬故云大牟尼也阿闍梨言如是九句或可分為十句從此以後迄至經終皆是如來酬九問之意廣分別說然佛觀當時眾會務令得意求宗或後問先答文無定準或轉生疑問以盡支流如下文入大悲藏曼荼羅等即是答修行句百字果等即是答殊異心及功德句其餘隨有相應處皆以類觀之義可知也。",
    "X23n0438_002:0280a20_0": "次如來答金剛手偈中善哉善哉佛真子廣大心利益者以從如來種性生從佛身語心生故曰真子如前大日世尊現廣大加持境界今祕密主亦欲普為如是無量應度眾生速成大行裂大疑網同獲三平等句無盡莊嚴故佛歎言善哉佛子汝今能以廣大心為利益無量眾生故發如是問也次云勝上大乘句心續生之相諸佛大祕密外道不能識者略有七義故名大乘一者以法大故謂諸佛廣大甚深祕密之藏毗盧遮那遍一切處大人所乘二者發心大故謂一向志求平等大慧起無盡悲願誓當普授法界眾生三者信解大故謂初見心明道時具足無量功德能遍至恒沙佛剎以大事因緣成就眾生四者以性大故謂自性清淨心金剛寶藏無有缺減一切眾生等共有之五者依止大故謂如是妙乘即法界眾生大依止處猶如百川同趣大海卉木依地而生六者以時大故謂壽量長遠出過三時師子奮迅祕密神通之用未曾休息七者以智大故謂諸法無邊故等虗空心自然妙慧亦復無邊窮實相源底譬如函葢相稱以如是七因緣故於諸大乘法門猶如醍醐淳味第一故云最勝大乘也乘名進趣句名止息之處故云大乘句也心續生之相者雖此心畢竟常淨猶如虗空離一切相而亦從因緣起有心相生猶如大海波浪非是常有亦非常無若常有者不應風飆止息則澄然而靜若常無者不應風飆纔起鼓怒相續當知是心從緣起故即是不生而生生而不生無相常相相常無相甚深微妙難可了知諸佛祕密之印不妄宣示是故凡夫二乘兩種外道非但不識無生滅心亦復不識生滅心故云諸佛大祕密外道不能識我今悉開示一心應諦聽也次偈云越百六十心生廣大功德其性常堅固知彼菩提生者是略答初問云何即知菩提心生今佛告言越百六十相續心即是淨菩提心如有人問云何知此乳中醍醐生答言若乳酪生熟酥麤濁變異之相悉已融妙無復滓穢當知即是醍醐生也行者最初開發金剛寶藏時見是心性如淨虗空超諸數量爾時離因業生佛樹芽生此芽生時已遍法界何況枝葉華果故云生廣大功德以過心行戲論故不可破不可轉猶若閻浮檀金無能說其過惡故云其性常堅固若知自心有如是印當知是菩提生也次有一偈半略答菩提心相貌以世間更無有法可以表示淨菩提心相者唯除太虗空喻少分相似故云無量如虗空譬如虗空不為烟雲塵霧之所染汙其性常住離諸因緣假使八方大風吹盡世界亦不能令其動自本初以來常自寂滅無相非適今也心相亦爾從無始以來本自不生以本不生故無有一法能令染汙動搖常住不變永寂無相故云不染汙常住諸法不能動本來寂滅無相爾時行人為此寂光所照無量知見自然開發如蓮華敷故云無量智成就此智成就即是毗盧遮那心佛現前故云正等覺顯現梵本云三藐三佛陀現也佛已略說如是心實相印若行者與此相應當知已具堅固信力然此信力本從真言門供養儀軌行法如說修行得至淨菩提心故云供養行修行從是初發心也此中供養有二種一者外供養二者內供養下文當廣說耳或有說言但觀心性無相無為不應種種紛動行菩薩道此說非也如以四種不生觀鑛中金性雖復在因在果常自無減無增若不以方便消融滓穢則此不生金無由可得行人亦復如是若不以三種祕密方便供養行門消融百六十心鑛石之垢何以得此淨菩提心龍樹阿闍梨中道正觀正以從緣起故無生義成而汝謂龜毛兔角為不生是故墮在失處又如世人覩真金百鍊不移以為妙性窮極若五通仙人以諸藥物種種鍊冶能化土石之類盡為金寶其有服食之者住壽長遠神變無方當知真金性中自有如是力用但世人無祕密方便故不能得耳淨菩提心亦如是若以大悲萬行種種鍊冶得成神變加持不思議業故不應未得謂得保初心為極果也。",
    "X23n0438_002:0281a15_0": "經云祕密主無始生死愚童凡夫執著我名我有分別無量我分祕密主若彼不觀我之自性則我我所生者以下答心相續義也欲明淨心最初生起之由故先說愚童凡夫違理之心無始生死者智度云世間若眾生若法皆無有始經中佛言無明覆愛所繫往來生死始不可得乃至菩薩觀無始亦空而不墮有始見中愚童義如先說凡夫者正譯應云異生謂由無明故隨業受報不得自在墮於種種趣中色心像類各各差別故曰異生也其所計我但有言語而無實事故云執著我名言我有者即是我所如是我我所執如十六知見等隨事差別無量不同故名為分次釋虗妄分別所由故云祕密主若彼不觀我之自性則我我所生也若彼觀察諸蘊皆悉從眾緣生是中何者是我我住何所為即蘊異蘊相在耶若能如是諦求當得正眼然彼不自觀察但展轉相承自久遠以來祖習此見謂我在身中能有所作及長養成就諸根唯此究竟道餘皆妄語以是故名為愚童也。",
    "X23n0438_002:0281b09_0": "經云復計有時者謂計一切天地好醜皆以時為因如彼偈言時來眾生熟時至則催促時能覺悟人是故時為因更有人言雖一切人物非時所作然時是不變因是實有法細故不可見以華實等果故可知有時何以故見果知有因故此時法不壞故常亦以不觀時自性故而生如是妄計也經云地等變化者謂地水火風虗空各各有執為真實者或云地為萬物因以一切眾生萬物依地得生故以不觀地之自性但從眾緣和合有故而生是見以為供養地者當得解脫次有計水能生萬物火風亦爾或計萬物從空而生謂空是真解脫因宜應供養承事皆應廣說。",
    "X23n0438_002:0281b20_0": "經云瑜伽我者謂學定者計此內心相應之理以為真我常住不動真性湛然唯此是究竟道離於因果不觀心自性故如是見生以為真我但住此理即名解脫也經云建立淨不建立無淨者是中有二種計前句謂有建立一切法者依此修行謂之為淨次句謂此建立非究竟法若無建立所謂無為乃名真我亦離前句所修之淨故云無淨也由不觀我之自性有如是見生廣說如上經云若自在天若流出及時者謂一類外道計自在天是常是自在者能生萬物如十二門中難云若眾生是自在子者唯應以樂遮苦不應與苦應但供養自在則滅苦得樂而實不爾但自行苦樂因緣而自受報非自在天作又若自在作眾生者誰復作此自在若自在自作則不然如物不自作若更有作者則不名自在如彼論廣說也計流出者興建立大同建立如從心出一切法此中流出如從手功出一切法譬如陶師子埏埴無間生種種差別形相次云時者與前時外道宗計小異皆自在天種類也經云尊貴者此是那羅延天外道計此天湛然常住不動而有輔相造成萬物譬如人主無為而治有司受命行之以能造之主更無所尊貴者故名尊貴又此宗計尊貴者遍一切地水火風空處昔有論師欲伏彼宗計故往詣天祠於彼天像身上坐而飲食西方以飲食之殘為極不淨皆共忿怒論師言如所宗豈非遍一切處地水火風空界相答言如是論師言彼即地水火風我亦如是以之相入何所不可而忿怒邪彼眾默然不能加報亦由不觀我之自性故生如是妄計也經云自然者謂一類外道計一切法皆自然而有無造作之者如蓮華者生而鮮潔誰之所染如棘刺端利誰所削成故知諸法皆自爾也有師難云今目觀人造舟船室宅之類皆從眾緣而有非自然成云何自爾邪若謂雖有而未明了故須人功發之是亦不然既須人功發之即是從緣非自然有也經云內我者有計身中離心之外別有我性能運動此身作諸事業難者云若如是者我即無常何以故若法是因及從因生皆無常故若我無常則罪福果報皆悉斷滅如是等種種論義至挍量中廣明經云人量者謂計神我之量等於人身身小亦小身大亦大智度云有計神大小隨人身死壞時神亦前出即與此同然彼宗以我為常住自在之法今既隨身大小即是無常故知不然也經云遍嚴者謂計此神我能造諸法然世間尊勝遍嚴之事是我所為與自在天計小異如中論破自在云自在天何為不盡作樂人盡作苦人而有苦者樂者當知從愛憎生故不自在今遍嚴者既能造諸福樂而不能以樂遮苦何名遍常自在耶經云若壽者謂有外道計一切法乃至四大草木等皆有壽命也如草木伐已續生當知有命又彼夜則卷合當知亦有情識以睡眠故難者云若見斬刈還生以為有命則人斷一支不復增長豈無命邪如合昏木有眠則水流晝夜不息豈是常覺皆由不觀我之自性故生種種妄見也經云補特伽羅謂彼宗計有數取趣者皆是一我但隨事異名耳若有從今世趣於後世是則識神為常識神若常云何有死生死名此處沒生名彼處出故不得言神常若無常則無有我如佛法中犢子道人及說一切有者此兩部計有三世法若定有過去未來現在則同有數取趣者失佛三種法印西方諸菩薩作種種量破彼宗計也經云若識者謂有一類執此識遍一切處乃至地水火風虗空界識皆遍滿其中此亦不然若識遍常應獨能見聞覺知而今要由根塵和合方有識生則汝識神為無所用又若識神遍五道中云何復有死生邪故知不爾也經云阿賴邪者是執持含藏義亦是室義此宗說有阿賴邪能持此身有所造作含藏萬像攝之則無所有舒之則滿世間不同佛法中第八識義也然世尊密意說如來藏為阿賴邪若時佛法中人不觀自心實相分別執著亦同我見也經云知者見者謂有外道計身中有知者能知苦樂等事復有計能見者即是真我智度云目覩色名曰見者五識知名為知者皆是我計隨事異名也難者云汝言能見是我而彼能聞能觸知者為是我不若皆是者六根境界互不相知一不可作六六不可作一若有非我者是亦同疑故知根塵和合有所知見無別我也經云能執所執謂有外道言身中離識心別有能執者即是真我能運動身口作諸事業或有說言能執者但是識心其所執境界乃名真我此我遍一切處然內外身受心法性皆從緣生無有此自性是中所執能執尚不可得何況我邪亦由不觀我之自性故作是說也經云內知外知者亦是知者別名分為二計有計內知為我謂身中別有內證者即是真我或以外知為我謂能知外塵境界者即是真我也經云社怛梵者謂與知者外道宗計大同但部黨別異故特出之耳經云若摩奴闍者智度翻為人即是人執也具譯當言人生此是自在天外道部類計人即從人生故以人為名唐三藏云意生非也末那是意今云末奴聲轉義別誤耳經云摩納婆者是毗紐天外道部類正翻應云勝我言我於身心中最為勝妙也彼常於心中觀我可一寸許智度亦云有計神在心中微細如芥子清淨名為淨色或如豆麥乃至一寸初受身時最在前受譬如像骨及其成身如像己莊唐三藏翻為儒童非也儒童梵云摩拏婆此中云納義別誤耳(此二名是菩提闍梨解)經云常定生彼外道計我是常住不可破壞自然常生無有更生故以為名也經云聲非聲者聲即是聲論外道若聲顯者計聲體本有待緣顯之體性常住若聲生者計聲本生待緣生之生已常住彼中復自分異計如餘處廣釋非聲者與前計有異彼計聲是遍常此宗悉撥為無墮在無善惡法亦無聲字處以此為實也。",
    "X23n0438_002:0283a03_0": "經云祕密主如是等我分自昔以來分別相應希求順理解脫者經中略舉三十許事若隨類差別則有無量無邊如人坐得四禪即計此法為真實常理或生是念我是得禪者如是等皆是我分相應例可知也皆由不觀我實相故但從久遠以來相承祖習此見各各自謂有大師薄伽梵一切知見者以善修瑜伽故現覺此法而為世間說之唯此是究竟道更無餘道如劫初時獨有一天先生梵界而作是念若更有眾生來與我共住豈不善哉時有上界天命終來生此中先生者即謂之言由我念力故汝得生此汝即我所生也彼亦作是念是尊能生我等便相隨順計為最初有我者從是以來謂是梵天王能造世間如是展轉生於異見不可勝記希求順理解脫者順理梵音瑜祇即是古昔修瑜伽行者謂彼得真解脫是萬物之宗今順彼行希求解脫故云然也已上皆是破壞內外因果違理之心次明最初順理之心即是世間八心也。",
    "X23n0438_002:0283a20_0": "經云祕密主愚童凡夫類猶如羝羊或時有一法相生所謂持齋彼思惟此少分發起歡喜數數修習祕密主是初種子善業發生羝羊是畜生中性最下劣但念水草及婬欲事餘無所知故順西方語法以喻不知善惡因果愚童凡夫也世間從久遠來展轉相承有善法之名然以違理之心種種推求而不能得後時忽然自有念生我今節食持齋即是善法然由未是佛法中八關戒也彼由節食自誡故即覺緣務減少令我飲食易足不生馳求勞苦爾時即生少分不著之心其心歡喜而得安穩由見此利益故數數有修習之即是最初微識善惡因果故名種子心也。",
    "X23n0438_002:0283b07_0": "經云復以此為因於六齋日施與父母男女親戚是第二芽種者此六齋日即是智度論中上代五通仙人勸令此日斷食既順善法又免鬼神災橫如彼廣說也由見止息貪求內獲利益故欲修習此法令得增長故於持齋之日捨己財物而與六親自念我無守護之憂而令佗人愛敬獲孝義之譽以見此因果故轉生歡喜生歡喜故善心稍增由如從種子生芽也。",
    "X23n0438_002:0283b14_1": "經云復以此施授與非親識者是第三疱種謂欲成此守齋善法修習無貪慧捨之心由數習故善心漸次增長復能施與非親識人見此平等施心功德利益故爾時善萌倍復增廣猶如芽莖滋盛未生葉時故名疱種也。",
    "X23n0438_002:0283b18_2": "經云復以此施與器量高德者是第四葉種謂已能習行惠捨藉此為因漸能甄擇所施之境如是之人德行高勝我今宜應親近而供養之即是慧性漸開遇善知識之由漸也。",
    "X23n0438_002:0283b21_3": "經云復以此施歡喜授與伎樂人等及獻尊宿是第五敷華者謂慧性漸開復甄別所施之境見其利佗之益以伎樂人能化大眾令其歡喜故賞其功凡如此類眾多是以云等也尊宿耆舊多所見聞及學行高尚世所師範以其多所導利故推誠歡喜而施與之亦令我施時心倍歡喜故即是華種也。",
    "X23n0438_002:0283c03_4": "經云復以此施發親愛心而供養之是第六成果者謂所習醇熟非直歡喜而已復能以親愛心施與尊行之人又因前施因緣得聞法利知彼內懷勝德謂能出離欲等狎習親附而供養之望初種子即是成果心也。",
    "X23n0438_002:0283c07_5": "復次祕密主彼護戒生天是第七受用種子者謂已能齋施見其利益即知三業不善皆是衰惱因緣我當捨之護戒而住由護戒故現世獲諸善利有大名聞身心安樂倍復增廣賢善命終而得生天譬如種果已成受用其實故曰受用種子也又如從一種子而成百千果實是一一果實復生若干展轉滋育不可勝數今此受用果心復成後心種子亦復如是故曰受用種子也。",
    "X23n0438_002:0283c16_0": "經云祕密主以此心生死流轉於善友所聞如是言此是天大天與一切樂者若虔誠供養一切所願皆滿所謂自在天等乃至彼聞如是心懷慶悅慇重恭敬隨順修行祕密主是名愚童異生生死流轉無畏依第八嬰童心已知尊行之人宜應親近供養又見持戒能生善利即是漸識因果今復聞善知識言有大天能與一切樂若虔誠供養所願皆滿即能起歸依心也雖未聞佛法然知此諸天因修善行得此善報又漸解甄別勝田復聞佛法殊勝妙必能歸依信受故為世間最上心也問曰前說自在天等皆是邪計今復云歸依此等是世間勝心與前有何異邪答曰前是不識因果之心但計諸法是自在天等所造今由善根熟故於生死流轉中求無畏依欲効彼因冀成勝果故不同前計也商羯羅是摩醯首羅別名也黑天梵音嚕捺羅是自在天眷屬龍尊是諸大龍俱吠囉皆世所宗奉大天也梵天后是世間所奉尊神然佛法中梵王離欲無有妃后從波頭摩以下所謂得叉迦羅龍和修吉龍商佉龍羯句擿劒龍大蓮華龍俱里劒龍摩訶泮尼龍阿地提婆龍薩陀龍難陀等龍皆是世間所奉尊神也天仙謂諸五通神仙其數無量故不列名圍陀是梵王所演四種明論大圍陀論師是受持彼經能授教者以能開示出欲之行故應歸依也於彼部類之中梵王猶如佛四圍陀典猶如十二部經傳此法者猶如和合僧時彼聞如是等世間三寶歡喜歸依隨順修行是第八生死凡夫無畏依也。",
    "X23n0438_002:0284a24_0": "經云祕密主復次殊勝行隨彼所說中殊勝住求解脫慧生等者謂即此第八無畏依中復有殊勝心也既聞如上所說世間諸薄伽梵宜應供養歸依復遂生心此諸三寶何者為勝我當擇其善者隨順修行由前善根力故隨彼所說法中得殊勝住者有求解脫智生然以未知緣起法故所有觀空智慧不離斷常故曰常無常空但隨順如是說而勤修學此中復有二種若求解脫智生名殊勝心已於空法作證名決定心若離分說之并前凡有十心也世尊欲明出世間觀空智慧故次說言祕密主非彼知解空非空義了知斷常雖作非有非無平等觀絕諸戲論然亦不能雙離是見由彼未解正因緣故然佛法中以知因緣有故則離無見以觀自性空故不生有見若離有無見者即不墮斷常若不達如是空義雖復不著有無離言絕相終是以分別想作此無分別心猶如長爪梵志觀諸法實相不受一切法而作是見夫真空離於分別云何分別空耶若不解空義者雖復一心精進勤求解脫非彼能知涅槃是故佛言汝欲求涅槃者應了知緣起之空離於斷常也由彼初種子心減損少分貪垢即順少分淨心從此以後齋施漸增即是淨心勢力漸得萌動由此熏習則能甄擇所歸依處有求解脫慧生若不遇善緣還從斷常空退入邪見然其八心種子終不敗亡若聞佛法但於斷常空合觀緣起空即入正道若是未生種子無機之人雖種種為說終不能信解也又如行者於第八心求生死無畏依時若遇善知識為說三寶真歸依處由彼漸識現世因果故即能信受復置是事如彼修齋時是人若遇善知識告言汝觀何利故為此齋施彼即答言我觀貪求保護因緣有種種憂苦少欲行施得歡喜安樂住故善知識告言善哉善男子如佛所說眾生以慳貪故現世有種種憂苦命終以此因緣墮惡道中以心離慳貪垢故現世安穩有大名稱命終生天後得涅槃是故汝今更應以勝上心受八齋法彼聞已便信受如說修行若無機之人但說世間苦樂皆是自在天造或地等變化以時為因則聞如是八齋少分安淨尚不能信況餘深事耶問曰如是八心最初種子復以何為因答曰由世間自久遠以來有善惡之名種子從是生也如劫初眾生貪食地味爾時即以多食者為不善少食者為善或有見多食因緣起諸過患便作是念我今少食此味常自誡節不亦善乎然此眾生亦未識因果後世之報但展轉相承謂仁義慚愧等以為善法有能如是行者世間共稱譽之又如小劫終竟時眾生忽爾發心知世間惡法過患更相勸導共行善事爾時亦無善知識勸導使然當知皆是自心實相熏習因緣力也如最初種子離微塵許心垢時即顯如微塵許淨心勢力雖云善種子生其實相即是不生生以是堅固性故在眾生識心終不敗亡未至自心實際大金剛輪中間更無住處雖果復成種展轉滋長然亦不出阿字門故云最上大乘句心續生之相諸佛大祕密外道不能知法華藥草喻品意亦在於此也復次行者歸依三寶隨順如來律儀於一日中受八齋法由聖戒所防護故寂靜安樂以安樂故則信賢聖所行數數修習是名最初種子為令此善增長而修諸善乃至由戒醇淨決定生天後至涅槃是名受用種子復由親近善知識故聞正法利不起異歸依心是生死流轉凡夫第八真實無畏依又於此中殊勝住有求解脫慧生思惟觀察生決定想從此即發聲聞菩提初種子心皆應准例前文廣分別說乃至三乘一一地皆具十心迄第十地亦具種子芽疱葉華果等有求佛地智生觀畢竟空得到金剛際也。",
    "X23n0438_002:0285a19_0": "爾時金剛手復請佛言唯願世尊說彼心如是說已佛告金剛手祕密主言祕密主諦聽心相謂貪心無貪心瞋心慈心癡心智心乃至云何受生心謂諸有修習行業彼生心如是同性此答前問中諸心相句也初列六十心名次釋其相祕密主彼云何貪心謂隨順染法者染謂染著前境即是染汙淨心若隨順修行此法名有貪心以心法微細難識但觀彼所為事業必有相彰于外譬如覽烟之狀貌則火性可以比知故諸句多以順修明義以可例然也此等皆是未得出世心以來與善種雜起之心若行者善識真偽猶如農夫務除穢草以輔嘉苗則淨心勢力漸漸增長勿謂是因緣事相輕忽至言使心沒其中不得自覺知也第二云何無貪心謂隨順無染法者謂與前心相違乃至所應進求善處亦復不生願樂是故不染善法俱障善萌與無染汙心名同事異最須觀察也是故行者但觀貪心實相自然貪不染心不應起如是無慧不貪之行也第三云何瞋心謂隨順怒法者怒謂瞋心發動事彰於外以心法難識故以順修怒法釋之若數起如是不寂靜相即知是瞋心相也但於此眾緣中觀察瞋心自無所住則此障不生第四云何慈心謂隨順修行慈法者此慈亦是與瞋相違愛見心垢之慈非善種所生也上慈字據內心下慈字是外相所為事業既覺知已但治妨道之失轉轉修慈無量心即是對治也第五云何癡心謂順修不觀法者謂不觀前言善惡是非遇便信受凡所為事業不能先以慧心甄別壽量是非如是等多諸誤失皆是癡心相也第六云何智心謂順修殊勝增上法者謂是人於種種所說中皆以智簡擇此勝此劣此應受此不應受取其勝上者而後行之即是無癡相也然過人之法非智力籌量所能及之唯信者能入耳也是故觀察世智辨聰難是彼對治第七云何決定心謂尊教命如說奉行第八云何疑心謂常收持不定等事者今先釋疑心令決定心相易解明了故謂此人隨有所聞便生不決定心如受戒時便自生疑心我今定得戒為不得戒耶或疑師疑法諸事例爾如人道行以疑惑故不能前進智度偈云乃至譬如觀岐路好利者應逐是彼對治又決定心者謂隨聞善友等如法教命便即不生疑慮至心奉行然亦當以慧觀察生正決定心離邪決定心也第九云何暗心謂於無疑慮法生疑慮解者謂如四諦不淨無常等世間智者不應生疑然彼聞之心懷猶豫如夜見株杌生種種憶度之心若見有如是相者當知暗心使然也第十云何明心謂於不疑慮法無疑慮修行者謂於決定法印非可疑慮之法彼隨所聽聞即能懸信當知是明心也然是中若過若不及即是障道之心更處中之慧是彼對治第十一云何積聚心謂無量為一為性者謂此人隨於一事生信解已更聞種種殊異法皆合集為一如人學得一三昧已見餘經教無量法門差別勝事皆謂說此定心離此之外更無餘法故名積聚心也第十二云何鬪心謂互相是非為性者謂聞佗所說言教常好辨論是非謂是義應爾是事不然假使所言合理亦以種種方便伺求其長短欲令墮在失處設佗來問亦復求其長短言此問乖僻我不應答有如是相現當知是鬪心也第十三云何諍心謂於自己而生是非者謂內懷是非之心如自思惟一義竟輙復自設異端推求其失雖善心諮受於人既領受已還自思惟推求得失謂此事合爾此不合爾多有如是相現當知是諍心也第十四云何無諍心謂是非俱捨者準梵本轉聲於六十心下皆合有為性之字例可知也謂其心不懷向背雖先所宗習作如是見解者更聞異言以違合理即受行之或先以為是聞佗以為不善即能改之情無所執是非俱捨有如是相當知是無諍心也覺知無記無諍之心修諸法實相無諍之心是彼對治也第十五云何天心謂心思隨念成就者如諸天以先世果報故若有所須不加功力隨心而生數起如是願樂當知是天心亦由曾生上界故有此習也如真言行人不期遠大之果但為自心所牽能障淨菩提心當自覺知勿貪世間悉地是彼對治第十六云何阿修羅心謂樂處生死者阿名為非修羅名天以其果報似天而行業住處不同故以為名也此知有解脫之利但深樂生死果報快樂不能進趣若行人有此相貌當知名修羅心亦由先世曾生此趣故有此習也觀察無常苦空等是彼對治第十七云何龍心謂思念廣大資財者謂數作是念我當以何方便獲如是廣大資財勝妙珍寶有此多貪無厭之想是龍趣之心也亦本從龍趣中來故生此習喜令行人願求世間悉地障出世淨心思惟少欲知足無常等是彼對治第十八云何人心謂思念利佗者謂好追求思念某甲於我有恩我當以如是方便令得大利某甲曾於我所有不饒益今當報之及種種理人利物之計皆是人心也當念自觀心行早求法利不應紛紜思慮佗緣是彼對治第十九云何女心謂隨順欲法者亦是人趣心但以多欲心為異耳如經說言女人多欲百倍於男子常念所經樂事或想佗容色姿態等能令行者障蔽淨心亦是多生曾作女人猶有本習也是中以不淨念處等觀身實相是彼對治行第二十云何自在心謂思惟欲我一切如意者自在即外道所事天神也彼宗計自在天能隨念造諸眾生及苦樂等事修此法者亦常係念願得如其本尊若真言行人數念如是悉地願我隨念成就當知是自在心亦先習使然也當觀諸法皆悉屬眾因緣無有自在是所對治第二十一云何商人心謂順修初收聚後分析法者如世商人先務儲聚貨物然後思惟分析之此物當某處用彼物當某處用可得大利若行人先務內外學問令周備已方復籌量此是世典當如是處用此二乘法用應接某人此大乘資糧是某緣所要此名商人心亦由先習使然也修捷疾智是彼對治謂隨聞何法即應觀彼因緣事用豈待多聞蓄聚方求用處耶第二十二云何農夫心謂隨順初廣聞而後求法者如學稼者詢問老農云何知地良美云何耕植耘耨云何候時云何苅藏如是一一知已方就功力此心亦爾先務諮承智者廣聞道品然後行之皆宿習使然也以利智為所對治如聞諸蘊無常即知界入緣起等其相例爾又如毒箭入體豈得俟三農月廣問而後拔之耶第二十三云何河心謂順修依因二邊法者此心性雙依二邊或時修常或時修斷或復邪正兼信如河水雙依兩岸其所漂流之物亦不定係一邊此中對治謂行人專心一境則能有所至到若心不定守能令事業俱辦無此理也第二十四云何陂池心謂隨順渴無厭足法者譬如陂池若眾水流入終無厭足此心亦爾若名利眷屬等事來集其身終無厭足乃至於所學法亦爾如已得乳糜不務速食更復渴望餘味是中少欲知足以為對治第二十五云何井心謂如是思惟深復甚深者謂如俯闚井水淺深之量難知此心性亦如是凡所思惟好尚深邃所有善不善事皆欲令人不能測量共住同事亦不識其心行當知是井心也緣起法門及善人相皆顯了易知是彼對治第二十六云何守護心謂唯此心是實餘心不實者如世人為護己身財物等故乃至周牆重閣種種防守不令為佗所傷此心亦爾常守護身心乃至如龜藏六不令外境所傷謂唯此行為實諸餘有作之務皆為不實學聲聞者多生此心也以兼護佗人為所對治又有人自保所解不欲令佗種種異論所傷謂餘見解悉皆不實亦是也第二十七云何慳心謂隨順為己不與佗法者謂此人諸有所作皆悉為自身故財物伎藝乃至善法皆好祕惜不以惠人有此相者知是慳心也以念施及無常等為所對治常念財物伎能設無常時無有隨我去者然今此身念念不可自保云何惜此邪第二十八云何貓狸心謂順修徐進法者如貓狸伺捕禽鳥屏息靜住不務速進望至度內然後取之此人亦爾遇聞種種法要但作心領受記持而不進行冀待良緣會合則當勇健勵行之又如貓狸蒙種種慈育亦不識恩分若人但受佗慈惠善言而不念報亦貓心也以不待時處如聞輙行常念恩德為所對治第二十九云何狗心謂得少分以為喜足者如狗以薄福因緣所期下劣故遇得少分麤鄙之食便生喜足若稍過於此者則非本所望此心亦爾聞少分善法便以為行不可盡不復更求勝事此聲聞種習所生也以增上意樂為所對治乃至心如大海少亦不拒多亦不溢第三十云何迦樓羅心謂隨順朋黨羽翼法者此鳥常恃兩翅挾輔其身所往隨意以成大勢假少一羽則無所能為此心亦爾常念多得朋黨與輔翼相資以成事業又因佗所作而後發心不能獨進如見人行善便念彼尚能行我何不為當念勇健菩提心如師子王不賴助伴為所對治第三十一云何鼠心謂思惟斷諸繫縛者如鼠見佗箱篋繩係等輙好非理損壞亦不作念由斷此故令我得如是利但爾無趣為之此心亦爾所有繫屬及與成事好為間隙而沮敗之第三十二云何歌詠心梵本缺文不釋阿闍梨言此喻傳法音也如世人度曲於佗得善巧已復為佗人奏之出種種美妙之音聞者歡喜此心欲從佗聽聞正法我當轉為眾生以種種文句莊嚴分別演說令此妙音處處聞知也是聲聞宿習亦能障淨心也當念我當得內證自然之慧然後普現色身而演說之是彼對治第三十三云何舞心謂修行如是法我當上昇種種神變者如世人支分散動說名為舞神變亦爾現種種未曾有事令前人心淨悅眼多是五通餘習者若偏尚如是悉地方便願求亦障淨心也當念除葢障三昧心無散動神通不起滅定而作加持神變勿貪世間小驗是所對治第三十四云何擊皷心謂隨順是法我當擊法皷者皷能警誡眾生令得覺悟若行人但作如是念眾生長夜昏寐我當習種種無礙辯才擊大法皷而警悟之亦能妨礙淨心也當念早證無量語言陀羅尼以天皷妙音普告一切眾生勿以世間小利妨大事因緣是彼對治第三十五云何室宅心謂順修自護身法者如人造立舍宅庇衛其身得免寒熱風雨盜賊惡蟲等種種不饒益事此心亦爾我當持戒修善以自防護今世後世遠離惡道眾苦多是聲聞習也當念救護一切眾生非獨一身是所對治第三十六云何師子心謂修行一切無怯弱法者如師子王於諸獸中隨所至處皆勝無有怯弱此心亦爾於一切事中皆欲令勝一切人心不怯弱自謂無有難事莫能與我角其優劣者若自覺知已當發釋迦師子心當令一切眾生遍勝無有優劣是所對治第三十七云何鵂鶹心謂常暗夜思念者此鳥於大明中無所能為夜則六情爽利若行者晝日雖有所聞誦習昏憒不得其善巧至暗夜思憶所為之事重復籌量便得明了乃至修禪觀等亦以暗處為勝若覺知己當念等於明暗令所作意無晝夜之別是所對治第三十八云何烏心謂一切處驚怖思念者如烏鳥若人善心附近惠養或時伺求其便俱生猜畏之心一切時性常如是此心亦爾雖善友欲為饒益及陷誤之者一槩猜阻而懷疑懼乃至持戒修善時亦於生死懷驚怖心若覺知已當修安定無畏心是彼對治第三十九云何羅剎心謂於善中發起不善者如人見為善事皆作不善意解佛說造諸塔廟得無量福而彼反作是言由此故橫損無量小蟲煩擾施主將何所益當受苦報如是等不善心生起也是中但以觀功德利益不念彼短為所對治第四十云何刺心謂一切處發起惡作為性者猶如棘叢於一切處多所損妨令近者不安此人心亦爾若行善事如大施等既作已便生追悔之心若作惡事竟復自思惟亦懷慙懼是故常懷惡作動慮不安此中對治若有違犯速務懺除勿生掉悔所為善事應自思惟生慶幸心第四十一云何窟心謂順修為入窟法者謂諸龍阿修羅等皆在地下或海底深窟中多有神仙諸藥能得長壽自在行者或念彼中多有美女端正同於諸天可無夭逝之憂五欲自恣或念留住彼中可得劫壽見未來諸佛皆是窟心也當念如法修行可於此生見法明道乃至成佛不應枉路稽留念此世仙之法是彼對治第四十二云何風心謂遍一切處發起為性者風性散亂由不住故此人心亦爾於一切處遍種善根謂於世間外道種種天尊及三乘諸行中皆令有分而作是念如多種子於一切處遍之會有成者當知是風心也當念石田不毛虗費種子當求良美福田膏腴之處專意耕耨所獲必多是彼對治第四十三云何水心謂順修洗濯一切不善法者如水性清潔雖暫為諸垢所汙澂之則淨又能洗除垢穢此人心亦爾常欲發露垢惡懺洗三業眾罪以見此垢此淨我如是行則能障礙淨心但當觀心實相了從本來垢法不生自能除一切葢障是彼治行也第四十四云何火心謂熾盛炎熱為性者如火性赫奕躁疾此人心亦爾若造善時於須臾間能成無量功德造惡亦少時成極重業此中治行應思惟猛暴之心多所敗傷以柔和慈善之水方便令滅而熾然善事務令恒久是彼對治第四十五云何泥心梵本缺文不釋阿闍梨言此是一向無明心也乃至目前近事不能分別記憶故律云猶如泥團又如泥濘以淖弱故難事越度要令有所由藉謂假橋梁等方能越之若覺有此心必須歸馮善友令方便開發乃能漸去無知還生慧性也第四十六云何顯色心謂類彼為性者譬如青黃赤白等染色若素絲入之便與同色此人心亦如是見聞善法亦隨彼行見聞惡事亦依隨修學乃至無記亦爾對種種境界隨事而遷行人自覺知已當念專求自證之法不由佗悟不為佗緣所轉是彼對治第四十七云何版心謂順修隨量法捨棄餘善故者如版在水中隨其分量受載諸物過限則不能勝終亦傾棄之此人心亦爾簡擇善法隨己力分行一事已便作是語我承上以來唯行此法不知其佗乃至習行八齋即不捨離更不慕行餘善以發廣大心學菩提行是所對治第四十八云何迷心謂所執異所思異者如人迷故意欲向東而更向西此人心亦如是意欲學不淨觀而反取淨相自謂我今修不淨觀若修無常無我時反行常我倒中謂我今修無常無我由心散亂故使然也常念專一其心宷諦安詳無倒觀察是彼對治第四十九云何服毒藥心謂順修無生分法者毒謂龍蛇藥草諸惡毒也如人中毒悶絕轉趣死地無有生分此人心亦爾不生善心亦不生惡心乃至一切心不能生起但任運而行漸入無因無果中故名無生分法也行人自覺知已應發起大悲眾善離斷滅空即是所治甘露妙藥第五十云何羂索心謂一切處住於我縛為性者如人為羂索所縛乃至手足支分不得動轉此心者如是墮於斷見我縛之中此見能縛行者心乃至於一切處常為所抅不能自出最是重障也既覺知已應速以緣起正慧刀決除障葢是所對治第五十一云何械心謂二足止住為性者在手曰杻在足曰械如人為械所持故二足停住不得前進此心亦爾常好端坐寂然住立而修定心及觀察法義為此所拘故名為械心此中治行當於一切時處思惟修習使靜亂無間是所對治第五十二云何雲心謂常作降雨思念者如西方夏三月中霖雨特甚以常滯淫昏墊故時俗憂樂思慮之心蔚翳滋多故云作降雨時思念也覺知已則當行捨心離於世間憂喜隨順法喜是所對治第五十三云何田心謂常如是修事自身者如人有良美之田常修治耕墾芸除荒穢種種方便令得清淨此人亦爾常好修事其身以香華滋味等灌塗奉養務令光潔嚴好覺知已常念回此功力修事其心以如是諸供養具播植福田資成勝果是彼對治第五十四云何鹽心謂所思念彼復增加思念者如鹽性鹹凡有所入處皆增鹽味此人心亦如是於所思事復加思念如憶想欲色之時適生此意還復自推求是心由誰而生作何相貌觀此未決復念此推求之慮有何因緣如是則無窮盡也覺知已當一向安心諦理務使穿徹又心性離念非憶度能知不於分別之上更增心數也第五十五云何鬀刀心謂唯如是依止鬀除法者鬀除鬚髮是離俗出家相謂此人心但作是念我已鬀除俗相令惡法不得復滋更何所求當知此心最惡以自作分除故能鬀除所有善根令不得生當念一切賢聖所應斷者所謂無明住地三毒之根若能鬀此令妄想不生乃名真出家也第五十六云何彌盧等心謂常思惟心高舉為性者如須彌山高絕眾峯無能出其上者此人心亦爾常以高舉為性乃至師僧父母等所應尊敬處皆不能下意猶如高幢不可屈撓之若欲撓之要必當折終不能改其常操以忍辱謙卑於一切眾生作大師想為所對治第五十七云何海等心謂常如是受用自身而住者譬如大海百川歸之吞納無限此心亦爾於一切勝事皆歸之於己謂嫌餘人無有比者常自恃如是眾多所長自受用此而住前心務高此心務廣故云與海等同也行者覺知已當念三賢十聖等無量大功德海展轉深廣自尅心行曾未得其塵渧不應起大慢之心也第五十八云何穴等心謂先決定彼後變改為性者譬如完堅之器後若遇緣穿穴無所堪任此心亦爾初時多所受持後稍穿漏也或初發心受戒時具足無缺不久漸生漏法同於已敗之器法水不停凡如是例皆名穴心也故行者當令所為之事皆有終始又知性多變改最能障礙堅固菩提心是彼對治第五十九云何受生心謂諸有修習行業彼生心如是同性者如人由白黑業受善惡報由所作種種雜故受彼彼無量差別身此心亦爾所修諸行欲回向受生當知得果亦兼惡善也故行者當念甄擇善惡除去不善純修白法就此善中又復以慧更去麤鑛如是次第乃至得成純一清淨醍醐妙果是所治也第六十心梵本缺文阿闍梨云少一猿猴心也猿猴之性身心散亂常不蹔住行人亦爾其性躁動不安故多所攀緣猶如猿猴放一捉一大略言之眾生盡爾今就偏盛而言也此中亦不隨動散之相繫緣一境是所對治猶如猿猴若繫之於柱則不復肆情掉擲躍騰是所治也然此六十心或時行者本性偏多或由行道用心發動先習或一時雜起或次第而生當於一切時留心觀察自然得順淨菩提心若阿闍梨為弟子平治心地時亦當一一簡去也。",
    "X23n0438_002:0289c02_0": "經云祕密主一二三四五再數凡百六十心越世間三妄執出世間心生乃至四分之一度於信解者亦是答諸心相及心殊異也由有無明故生五根本煩惱心謂貪瞋癡慢疑所以不說五見者以屬見煩惱多在六十心中也此五根本煩惱初再數為十第二再數成二十第三再數成四十第四再數成八十第五再數成一百六十故云一二三四五再數成百六十心也以眾生煩惱心常依二法不得中道故隨事異名輙分為二就此二中復更展轉細分之其名相具如十萬偈中說若更約上中下九品等乃至成八萬塵勞廣則無量譬如從一種子生五根本於一根本皆破為二枝至第五破則成百六十小枝從此復更離分則條葉不可勝計又如劫初時人皆化生以念為食身光自然安樂無礙然以不知心實相故稍貪著地肥由食味多小色貌隨異是非勝負之心猶此而生以有憍慢心故福利衰減地肥隱沒乃至地膚林藤亦復不現次食自然粳米始有男女之殊婬盜殺妄等種種非法次第而起是事阿含中廣明從是以來有種種族姓種種方俗起種種業煩惱網成種種眾生趣造種種五陰之身自非一切智人則不能究其條緒阿闍梨所以為此喻者欲表一無明心隨諸事離分即成阿僧祇妄執也越世間三妄執出世間心生者若以淨菩提心為出世間心即是超越三劫瑜祇行梵云劫跛有二義一者時分二者妄執若依常途解釋度三阿僧祇劫得成正覺若祕密釋超一劫瑜祇行即已度百六十心等一重麤妄執名一阿僧祇劫超二劫瑜祇行又度一百六十心等一重細妄執名二阿僧祇劫真言門行者復越一劫更度百六十心等一重極細妄執得至佛慧初心故云三阿僧祇劫成佛也若一生度此三妄執即一生成佛何論時分耶然就第一重內最初解了唯蘊無我時即名出世間心生也度世間六十心離我倒所生三毒根本名越三毒妄執也復次有三妄執所謂根境界淹留修行根謂六根境謂六塵界謂六識界以內外十二入界即是根境故合言之此是三果學人所留滯處故云淹留修行也復次有三妄執所謂業煩惱株杌及無明種子即是無學聖人所斷最難斷處凡有三種三妄執也學摩訶衍人初得出世初心與小乘見道適齊然不墮聲聞正位所以爾者由彼從初發心即知心性但為我倒所覆未能現前爾時諦觀陰界入等悉從緣生無常變異是中何者是神我耶作如是推求即了神本不生度無量見網淨菩提心少分增明由得菩提心勢力所以不墮二乘地也然彼行者有法執當心若修禪定道品種種諸度時雖不於中起諸我倒而心住於禪慧等法稽留淹滯不能速至菩提以非如實巧度故名淹留修行也然亦稍離下地三妄執能拔業煩惱根本無明種子生十二因緣知如是甚深之法有佛無佛性相常爾如前所說建立淨不建立無淨等種種宗計皆不相應乃至長叉梵尼諸大論師等自以智慧利根推求諸法實相皆亦不能圖度此十二因緣義如稻芉等經廣明言湛寂者寂是不生義謂五根本煩惱及百六十隨煩惱等皆畢竟不生故名為寂湛者是甚深義譬如清潭萬仞澂恬鏡徹臨視之者不測淺深故說三獸渡河各隨足迹之所至獨有大香象王能漸次深入到其源底耳此中有三乘之人同以無言說道得諸法實相然聲聞入法性最淺故厭怖生死自謂已得涅槃生滅度想辟支佛所入有差稍深故於生死不甚忩遽然不能以方便力發起大悲菩薩悟如是法時即知是心垢漸除所以淨心漸現爾時便得菩提心勢力能以不住道學種種度門故同共一法中而昇沉有異也。",
    "X23n0438_002:0290b21_1": "經云一切外道所不能知者此宗中說有兩種外道也外外道猶如覩見清潭逆生怖畏不敢習近內外道雖能游泳其中適熱除垢得清涼樂然不覺是中有無量寶玉一則不入不識二則入而不識故云一切外道不能知也先佛宣說離一切過者言十方三世諸佛唯有此一門誘進群迷出於火宅是處無復障礙戲論不行故種種因量諸師無能出其過惡者然未度法障未名真淨菩提心如蓮華雖已離濁泥尚未出水故經云彼出世間心住蘊中也以行者於瑜伽中湛寂之心雖已明顯然涉事時根塵識等猶尚當心由厭怖有為故著無為法然以菩提心勢力自然不由佗教有如是慧隨生能於蘊等發起其心修離著方便於五種譬喻觀察無性空初句觀察聚沫者如水上浮沫雖可目覩有種種形推求性實了不可得色陰亦爾若麤若細無不從眾緣生緣生無性即是色本不生也次句浮泡者如夏時暴雨水上浮泡亦但屬眾緣四句觀之都無起滅受陰亦爾諸苦樂等皆從情塵和合生從緣無性即是受本不生也次句陽炎者如春月地氣日光望之如水迷渴者生企求心奔趣徒勤去之彌遠眾生亦爾不知緣起性空有法想生若悟實相即想本不生也次芭蕉者如人求芭蕉中堅實乃至分分破析至於隣虗亦不可得行陰亦爾一微塵涉於動境無不從眾緣生緣生無性即是行本不生也次幻事者如世間呪術藥力蔽惑人心現種種未曾有事識陰亦爾從一念無明幻心幻出三界究其源本都無生滅去來當知從眾緣生無自性故亦識本不生也聲聞經中雖說此五喻而意明無我今此中五喻意明諸蘊性空如觀五陰者當知十二入十八界六入十二因緣等皆應廣分別說如大般若中所明行者如是觀察時從無性門達諸法即空得離一重法倒了知心性如是不為蘊界處能執所執之所動搖故名證寂然界證此寂然界時漸過二乘境界如蓮華雖未開敷而稍出清流之上行者亦爾不復心沒蘊中故名出世間心若據正譯當言上世間心也祕密主彼離違順八心相續業煩惱網者如前所說種子根疱等及歸依三寶為人天乘行齋施善法皆名順世八心若三乘初發道意迄至拔業煩惱根本無明種子生十二因緣名違世八心或可就見道修道等諸位分之各自有八心也大乘行者了達諸蘊性空故於一切法中都無所取亦無所捨雙離違順八心我蘊兩倒二種業煩惱網是名超越一劫瑜祇行瑜伽譯為相應若以女聲呼之則曰瑜祇所謂相應者即是觀行應理之行人也依常途解釋者是菩薩從發心以來經一大阿僧祇劫方證如是寂然界今祕密宗但度此一重妄執即是超一阿僧祇劫行者未過此劫與辟支佛位齊時名為極無言說處爾時心滯無為法相若失方便多墮二乘地證小涅槃然以菩提心勢力還能發起悲願從此以後三乘徑路始分然所觀人法俱空與成實諸宗未甚懸絕由約偏真之理作此平等觀耳故以三乘上中下出世間心合論一僧祇劫至第二僧祇劫乃與二乘異也。",
    "X23n0438_002:0291b07_0": "經云復次祕密主大乘行發無緣乘心法無我性何以故如彼往昔如是修行者觀察蘊阿賴耶知自性如幻陽炎影響旋火輪乾闥婆城者即是明第二重觀法無我性也梵音莽鉢羅是無義亦是佗義所謂佗緣乘者謂發平等大誓為法界眾生行菩薩道乃至諸一闡提及二乘未入正位者亦當以種種方便析伏攝受普令同入是乘約此無緣大悲故名佗緣乘又無緣乘者至此僧祇始能觀察阿陀那深細之識解了三界唯心心外更無一法而可得者乘此無緣心而行大菩提道故名無緣乘也此無緣乘心即是法無我性以行者初劫修觀行時心沒蘊中故以五種無性空門觀法無我然望緣生中道由屬對治悉檀若失般若方便即墮於斷滅名惡取空者濫方廣道人今大乘不可得空相空相亦不可得雖觀諸法無所有然亦於諸法無所空故須離有離無道觀法無我性為欲淨除智障故隨順古昔諸菩薩修學觀蘊阿賴耶即楞伽解深密等八識三性三無性皆是此意經言知自性者即是知三界唯心也如幻陽炎影響旋火輪乾闥婆城六喻皆是雙辦有無明蘊阿賴耶別緣起義與前劫上五喻觀無性空意復有殊矣阿賴耶義云含藏正翻為室謂諸蘊於此中生於此中滅即是諸蘊巢窟故以為名然阿賴耶有三種義一者分別義二者因緣義三者真實義如大乘莊嚴論求真實偈中以離二及迷依無說無戲論故應知三性俱真實所云離二者謂分別性真實由能取所取畢竟無故迷依者謂依佗性真實由此起諸分別故無說無戲論者謂真實性真實由自性無戲論故次說求真實譬喻偈云如彼起幻師譬說虗妄分別如彼諸幻事譬說二種迷釋曰如幻師依呪術力變木石等以為迷因如是虗妄分別依佗性亦爾起種種分別為顛倒因又如幻師像金等種種相貌顯現如是所起分別性亦爾能取所取故二迷恒時顯現次偈云如彼無體故得入第一義如彼可得故通達世諦實此中意言如彼幻者幻事無有實體此譬依佗分別二相亦無實體由此道理即得通達第一義諦又如幻者幻事體亦不可得此譬虗妄分別亦爾由此道理即得通達世諦之實又偈云彼事無體故即得真實境如是轉依故即得真實義釋云若人了彼幻事無體即得平等實境若諸菩薩了彼二迷無體得轉依時即得真實性義也又偈云是事彼處有彼有體亦無有體無有故是故說是幻此偈明幻事有而非有何以故有謂幻像事彼處顯現故非有謂彼實體不可得故如是有體與無體無二由此義故說彼是幻又偈云無體非無體非無體即體無體體無二是故說是幻此偈明幻事非有而有何以故非有謂彼幻事無體由無實體故而有謂幻事非無體由像顯現故如是無體與有體無二由此義故說彼是幻此幻即譬諸蘊是故當知虗妄分別有而非有何以故彼二影顯現而實體不可得故故說色等有體即是無體復次虗妄分別非有而有何以故彼二都無實體然有影顯現故故說色等無體與有體無二由此有無不二能遮建立誹謗及趣小乘寂滅所以然者由於無體知無體故不應安立由於有體知世諦故不應誹謗又以彼二無別故不應厭體入小涅槃彼偈又云幻像及取幻迷故說有二如是無彼二而有二可得骨像及取骨觀故亦說二無二而說二可得亦如是前偈意云迷人於幻像及取幻以迷故說有能取所取二事彼二雖無而二可得由迷顯現故後偈意云觀行人亦爾於骨像及取骨由觀故說有能觀所觀二事彼二雖無而二亦可得由觀顯現故問曰如是觀已以何法為能治何法為所治故彼復說二偈云應知所治體謂彼法迷相如是體無體有非有如幻應知能治體念處等諸法如是體無相如幻亦如是前偈意云何所治體即是迷法相迷法相者謂如是如是體故然如是體可說為有由虗妄分別故亦說非有由能取所取二體與非體無別故如是有亦如幻無亦如幻故說此相如幻後偈意云能治體即是諸法謂佛所說念處等如是如是體故彼體亦皆如幻何以故如諸凡夫所取如是如是有體故如諸佛所說如是如是無體故如是體無相而佛世尊示現入胎出生踰城出家成等正覺如是無相而影顯現是故如幻問曰若諸法同如幻者以何義故一為能治一為所治彼偈答言譬如強幻王令餘幻王即退如是清淨法能令染法盡由此義故菩薩雖修眾行而無所得也彼論明觀察蘊阿賴耶了知自性如幻最與此經符會故具出之當知陽炎影響旋火輪乾城亦應如是廣說前劫五喻有泡沫芭蕉此中所以不論者此三事由帶折法明無性空然此中幻炎等喻意明唯識無境體法難解之空即是麤相轉融故不論也行者解諸蘊唯心即是知法自性未了如是如是自性時畏墮有所得故不能盡理觀有畏墮斷滅故不能盡理觀空非但見有不明亦復見空未盡今以如幻等門照有空不二而人法二空之相亦不當心乃名真入法空悟唯識性故。",
    "X23n0438_002:0292c02_0": "經云祕密主彼如是捨無我心主自在覺自心本不生心主即心王也以不滯有無心無罣礙所為妙業隨意能成故云心王自在心王自在明即是淨菩提心更作一轉開明倍勝於前劫也以心王猶如池水性本清淨心數淨除猶如客塵清淨是故證此性清淨時即能自覺心本不生何以故以心前後際俱不可得故譬如大海波浪以從緣起故即是先無後無而水性不爾波浪從緣起時水性非是先無波浪因緣盡時水性非是後無心王亦復如是無前後際以前後際斷故雖復遇境界風從緣起滅而心性常無生滅覺此心本不生即是漸入阿字門爾時復離百六十心等塵沙諸煩惱一重微細妄執名第二阿僧祇劫故經云知自心性是超越二劫瑜祇行也此中無為生死緣因生壞等義如勝鬘寶性佛性論中廣明今且明宗義故不詳說然上來原始要終自發一毫之善以至於超度人法有無二障雖宗極炳著轉妙轉深由是對治心外之垢尚未開此心中種種祕密不思議事從此以後方乃說之若不作如此對辯則常情各翫先習不能覺其微妙也。",
    "X23n0438_002:0293a03_0": "經云復次祕密主真言門修行菩薩行諸菩薩無量無數百千俱胝那庾多劫積集無量功德智慧具修諸行無量智慧方便皆悉成就者即是欲明超第三劫之心欲令見聞者信樂尊重故先歎其功德耳如餘教中菩薩行於方便對治道次第漸除心垢經無量阿僧祇劫或有得至菩提或不至者今此教諸菩薩則不如是直以真言為乘超入淨菩提心門若見此心明道時諸菩薩無數劫中所修福慧自然具足譬如世人以舟車跋涉經險難惡道得達五百由旬更有一人直乘神通飛空而度其所經過及至到之處雖則無異而所乘法有殊又世尊所以先廣說如上諸心相者為教真言門諸觀行人若行至如是境界時則須明識不得未到謂到而於中路稽留也復次如輪王太子初誕育時眾相備足無所缺減雖未能遍習眾藝統御四洲然已能任持七寶成就紹王之家業何以故以即是輪王具體故真言行者初入淨菩提心亦復如是雖未於無數阿僧祇劫具修普賢眾行滿足大悲方便然此等如來功德皆已成就何以故即是毗盧遮那具體法身故是以經云無量無數劫乃至智慧方便皆悉成就也又如王子始生又以龍神兆庶之所宗歸初發淨菩提心亦復如是已為天人世間迷失正道者作大歸依若常途諸論所明證此心時即名為佛是故舍利弗等一切聲聞緣覺盡其智力不能測量經云所謂出過一切聲聞辟支佛地也行者得此心時即知釋迦牟尼淨土不毀見佛壽量長遠本地之身與上行等從地涌出諸菩薩同會一處修對治道者雖迹隣補處然不識一人是故此事名為祕密又此菩薩能於畢竟淨心中普集會十方法界諸佛菩薩亦自能普詣十方供養諸善知識詢求正法唯獨自明了諸天世人莫能知者由此因緣復名祕密前二劫中雖云度二乘地雖須菩提等由能承佛威神衍說人法俱空而於此祕密一乘心生驚疑不知所趣乃名直過聲聞辟支佛地也時大威德諸天不見菩薩心所依處咸生敬信故釋提桓因作如是願言今此上人不久成佛若彼成佛時我當奉吉祥草四天王亦生此念言若此菩薩成佛時我當獻鉢梵天王亦作此念若此菩薩成佛時我當請轉法輪故云親近敬禮也已歎入真言門功德竟然行者復以何法入此門耶故經次云所謂空性空性即是自心等虗空性上文無量如虗空乃至正等覺顯現即喻此心也前劫悟萬法唯心心外無法今觀此心即心則是如來自然智亦是毗盧遮那遍一切身以心如是故諸法亦如是根塵皆入阿字門故曰離於根境影像不出常寂滅光故曰無相以心實相智覺心之實相境智皆是般若波羅蜜故曰無境界以此中十智喻望前十喻復成戲論故曰越諸戲論第三重微細百六十心煩惱業壽種除復有佛樹牙生故曰等虗空無邊一切佛法依此相續生既不壞因緣即入法界亦不動法界即是緣起當知因緣生滅即是法界生滅法界不生滅即是因緣不生滅故曰離有為無為界若如來出世若不出世諸法法爾如是住故曰離諸造作如般若中一切法趣眼是趣不過猶如百川赴海更無去處是故當知眼即是第一實際第一實際中眼尚不可得何況趣不趣耶耳鼻舌身意亦如是故曰離眼耳鼻舌身意行者得如是微細慧時觀一切染淨諸法乃至少分猶如隣虗無不從緣生者若從緣生即無自性若無自性即是本不生本不生即是心之實際心實際亦復不可得故曰極無自性心生也此心望前二劫由如蓮華盛敷若望後二心即是果復成種故曰如是初心佛說成佛因故於業煩惱解脫而業煩惱具依此中云佛說者世尊以十方三世佛為證言以此一事因緣為眾生開淨知見其道玄同也行者解脫一切業煩惱時即知一切業煩惱無非佛事本自無有縛今何有脫邪如良醫變毒為藥用除眾疾又如虗空出過眾相而萬像具依若住此不思議解脫時即是真阿羅漢不著於有為無為一切世間應受廣大供養故經云世間宗奉常應供養也復次阿闍梨欲明此應供義故統論三劫始終作寶珠譬喻猶如有如意寶在石朴之中以世人不識故棄在衢路之間與瓦礫無異然別寶者見有微相纔彰於外即便識之先用利鐵鐫去鈍石既近寶玉其石漸耎復以諸藥食之使礦穢消化而復不傷其質爾時麤垢已除尚有細垢既洗以灰水磨以淨[疊*毛]種種方便而瑩發之既得光顯置之高幢能隨一切所求普雨眾物爾時世人生奇特想尊重是寶由如大天以能充滿所希願故然此寶玉於一時間普應眾心隨其所得各各差別然此眾物為於寶中先有邪先無邪若先有者即此小珠何能頓藏眾物若先無物者又何能頓雨眾物即此世間寶性已有不可思議何況眾生菩提心寶邪是故諸善知識纔見眾生世間八心適萌動時即便識是真寶知有可鑿之理如彼相者以曾多識名寶是以遇便識之諸佛菩薩亦爾久已證知親從一毫之善自致大菩提道是故鑑彼情機即大歡喜方便誘進令受三歸如前已分別說譬如收彼頑石置於家中次以三種三心拔業煩惱根無明種子如以利鐵開鑿去其麤礦次觀無緣乘法無我性如漸至耎處以藥物消化而不傷之次生極無自性心如灰水瑩拭使極光淨爾時生於佛家名置在高幢雨種種寶以此因緣故堪受世間廣大供養也若行者直從真言門得見心寶如仙人善呪術以神力取之雖巧拙難易不同而獲寶終無有異路故此經從淺至深廣明心相皆為開示菩提心本末因緣若但依常途法相則不得言諸佛大祕密我今悉開衍也。",
    "X23n0438_002:0294b08_0": "經云祕密主信解行地觀察三心無量波羅蜜多慧觀四攝法信解地無對無量不思議建立十心無邊智生者此經宗從淨菩提心以上十住地皆是信解中行唯如來名究竟一切智地如華嚴中初地菩薩能信如來本行所入信成就諸波羅蜜信入諸勝地信成就力信具足無所畏信生長不可壞不共佛法信不思議佛法信出生無中邊佛境界信隨入如來無量境界信成就果於如是諸事中其心畢竟不可破壞不復隨佗緣轉故名信解行地亦名到於修行地也觀察三心即是因根究竟心若通論信解地則是初地菩薩得此虗空無垢菩提心時自然於十無盡界生十大願乃至滿足百萬阿僧祇大願此即是菩提心為因從二地以去增修大悲萬行即是無盡大願於十方界生根乃至漸次增長至第八地以去皆名方便地佛性論云八地以上境界皆同但約方便為階降耳若觀一一地亦自有三心如以眾多十因緣得入初地名為因既彼安住已以種種大悲萬行淨治是地名為根說淨治地果相及方便業名究竟餘皆準此此經無量波羅蜜多四攝法即是治地也行者從此無有待對出過心量不可思議地有十心無邊智生即是初地果相也華嚴云發十大願已則得利益心柔輭心隨順心寂靜心調伏心寂滅心謙下心潤澤心不動心不濁心次又成就十種淨諸地法所謂信慈悲喜捨無有疲厭知諸經論善解世法慙愧及堅固力供養諸佛依教修行復次住是地已善知諸地障善知地成壞善知地相果善知地得修善知地法清淨善知地地轉行善知地地處非處善知地地殊勝智善知地地不退轉善知淨治一切菩薩地乃至轉入如來地如是等有眾多十心若廣分別即有百萬阿僧祇度門故曰無邊智生也更就前三心作十心說之若通論信解地則初地為種子二地為芽三地為疱四地為葉五地為華六地為果七地為受用種子八地為無畏依所謂果中之果九地為有進求佛地慧生是最勝心十地此心決定此二心無別境界還是於第八心中約方便轉勝開出之耳若一一地中亦自具此十心且如住初地時成就淨治諸地法及知諸地相即是先解一地竟藉此為因智慧增長更解二地以上十心類例推之可知華嚴有眾多十法門亦當準此次第廣分別說然此經宗從初地得即入金剛寶藏故華嚴十地經一一名言依阿闍棃所傳皆須作二種釋一者淺略釋二者深祕釋若不達如是祕號但依文說之則因緣事相往往涉於十住品若解金剛頂十六大菩薩生自當證知也經云我一切諸有所說皆依此而得者如上一切智地無盡莊嚴境界及餘無量修多羅佛所稱歎一切行果無不因此而得之是故餘經如是廣歎娑羅樹王莖葉華果今此經中唯明此樹王種子及生育因緣若離此因緣能成彼果者無有是處所以稱大日經王者非為此乎經復舉益勸修云是故智者當思惟此一切智信解地復越一劫昇住此地即是初入此信解地是復越百六十心一重細惑名度三大僧祇劫也行者初觀空性時覺一切法皆入心之實際下不見眾生可度上不見諸佛可求爾時萬行休息謂為究竟若住此者即退不墮二乘地進不得上菩薩地名為法愛生亦名無記心然以菩提心勢力及如來加持力復能發起悲願爾時十方諸佛同時現前而勸喻之以蒙佛教授故轉生極無自性心乃至心之實際亦不可得雖解脫一切業煩惱而業煩惱具存至此不思議地乃名真離二乘地也就前三句義中更開佛地為上上方便心至此第四心時名究竟一切智地故曰此四分之一度於信解也。",
    "X23n0438_002:0295b04_0": "經云爾時執金剛祕密主白佛言世尊願救世者演說心相菩薩有幾種得無畏處乃至當得一切法自性平等無畏者猶是答前心相句以金剛手既聞此教諸菩薩直乘真言門上菩薩地故問世尊此菩薩行道時有幾種得無畏處佛還復約前三劫作差降對明也梵音阿溼嚩娑正譯當言蘇息如人為強力者所持扼喉閉氣垂將悶絕忽蒙放捨還得復蘇眾生亦如是為妄想業煩惱所纏觸緣皆閉至此六處如得再生故名蘇息處亦如度險惡道時其心泰然無所畏懼故名無畏處也佛言祕密主彼愚童凡夫修諸善法害不善法當得善無畏者善義通於淺深今此中意明十善業道如世人以十不善道因緣漂沉惡趣無有窮已後得順世八心漸受三歸戒於無量世生人天中後至涅槃以免離三途極苦名最初蘇息處也若真言行者初入三昧耶依三密供養佛修行位與此齊等也經云若如實知我當得身無畏者如修身觀時見此身三十六物之所集成五種不淨惡露充滿終不為此而生貪愛次復觀受心法得離不觀我性四種顛倒於身之扼縛得蘇息處若真言行者本尊三昧眾相現前時位與此齊也。",
    "X23n0438_002:0295b23_1": "經云若於取蘊所集我身捨自色像觀當得無我無畏者謂觀唯蘊無我時於陰界入中種種分折推求我不可得捨此自色像者譬如因樹則有樹影現若無樹者影由何生今五蘊尚從緣生都無自性何況此積集中而有我耶如上所說乃至證湛寂之心離一切過是於我之扼縛得蘇息處若真言行者於瑜伽境界一切分段中能觀心不可得不生愛慢位與此齊也。",
    "X23n0438_002:0295c07_2": "經云若害蘊住法攀緣當得法無畏者謂行者心住蘊中欲令發起離著爾時約幻炎等喻觀察諸蘊即空得離違順八心證寂然界能離蘊之扼縛於法得蘇息處法謂十緣生句也若真言行者現覺瑜伽境界皆如鏡像水月無性無生時位與此齊也。",
    "X23n0438_002:0295c12_0": "經云若害法住無緣當得法無我無畏者即是無緣乘心觀察法無我性於心外有無影像智都無所得心王自在覺本不生得離法之扼縛於法無我得蘇息處若真言行者於瑜伽道中心得自在用時位與此齊也經。",
    "X23n0438_002:0295c16_1": "云若復一切蘊界處能執所執我壽命等及法無緣空自性無性此空智生當得一切法自性平等無畏者謂觀自心畢竟空性時我之與蘊法及無緣皆同一性所謂自性無性此空智生即是極無自性心生也於業煩惱等都無所縛亦無所脫故云得一切法自性平等爾時於有為無為界二種扼縛得蘇息處即是真言行者虗空無垢菩提心也然此心在纏出纏皆畢竟無相以如來五眼諦觀尚不能得其像貌況餘生滅中人今所以廣明三劫六無畏處眾多心相者皆是擬議外迹以明修證之深淺耳上已明見烟之相可以皆比知火性但知心垢盡處戲論不行即是第六無畏依更欲如何表示耶。",
    "X23n0438_002:0296a10_0": "經云祕密主若真言門修菩薩行諸菩薩深修觀察十緣生句當於真言行通達作證乃至如實遍知一切心相者是略答前問中修行句也如下文萬行方便中無不藉此十緣生句淨除心垢是故當知最為旨要真言行者特宜留意思之然統論此品中十緣生句略有三種一者以心沒蘊中欲對治實法故觀此十緣生句如前所說即空之幻是也二者以心沒法中欲對治境界攀緣故觀此十緣生句如前所說蘊阿賴耶即心之幻是也三者以心沒心實際中欲離有為無為界故觀此十緣生句如前所說解脫一切業煩惱而業煩惱具依即不思議之幻也摩訶般若中十喻亦具含三意今此中云深修觀察者即是意明第三重且如行者於瑜伽中以自心為感佛心為應感應因緣即時毗盧遮那現所喜見身說所宜聞法然我心亦畢竟淨佛心亦畢竟淨若望我心為自即佛心為佗今此境界為從自生耶佗生耶共生無因生耶以中論種種門觀之生不可得而形聲宛然即是法界論幻即幻論法界即法界幻論遍一切處即遍一切處論幻故名不可思議幻也復次言深修者謂得淨心已去從大悲生根乃至方便究竟其間一一緣起皆當以十喻觀之由所證轉深故言深觀察也且如四諦義直示娑婆世界已有無量無邊差別名又況無盡法界中逗機方便何可窮盡今行者於一念淨心中通達如是塵沙四諦空則畢竟不生有則盡其性相中則舉體皆常以三法無定相故名為不思議幻也如四諦者餘一切法門例耳是故唯有如來乃能窮此十喻達其源底此經所以次無垢菩提心即明十喻者包括始終綜該諸地也既觸緣成觀不可縷說今且依釋論明其大歸耳。",
    "X23n0438_002:0296b15_0": "經云云何為十謂如幻陽炎夢影乾闥婆城響水月浮泡虗空華旋火輪乃至云何為幻謂如呪術藥力能造所造種種色像惑自眼故見希有事展轉相生往來十方然彼非去非不去何以故本性淨故如是真言幻持誦成就能生一切者佛說藥力不思議如人以藥力故昇空隱形履水蹈火此事非諸論師等能建立因量出其所由亦非可生疑謂定應爾或不應爾過如是籌度境界唯親行此藥執持行用者乃證知耳又如藥術因緣示現能造所造種種色像雖於眾緣中一一諦求都無生處而亦五情所對明了現前雖展轉相生往來十方然亦非去非不去是事亦非籌度思量之境釋論云佛問德女譬如幻師幻作種種事於汝意云何是幻所作內有不答言不也又問外有不內外有不從前世至今世從今世至後世不幻所作有生者滅者不實有一法是幻所作不皆答言不也佛言汝頗見聞幻所作伎樂不答言我亦見亦聞佛言若幻空欺誑無實云何從幻能作伎樂女言大德是幻相法爾耳雖無根本而可聞見佛言無明亦如是雖非內有乃至無生滅者而無明因緣諸行生若無明盡行亦盡乃至廣說今此真言門喻持誦者亦復如是如下文廣說依三密修行得成一切奇特不思議事雖一一緣中諦求畢竟離於四句法爾如是不異淨心而自在神變宛然不謬此事亦非諸大論師等聰辨利根者所能測量獨有方便具足得成悉地者自證知耳。",
    "X23n0438_002:0296c16_0": "經云復次祕密主陽燄性空彼依世人妄想成立有所談議如是真言相唯是假名者釋論云以日光風動塵故曠野中動如野馬無智人初見之謂之為水眾生亦爾結使煩惱日光熱等動諸行塵邪憶念風於生死曠野中轉無智慧者謂一相為男一相為女復次若遠見之謂以為水近則無水相如是遠聖法者不知無我及諸法空於陰界入性空法中生人想等若近聖法則知諸法實相是時虗誑種種妄想盡除此經意云如世人遠望之者徒見此炎之相強立假名求其實事都不可得故云妄想成立有所談議如真言行者於瑜伽中見種種殊特境界乃至諸佛海會無盡莊嚴爾時應作此陽燄觀了知唯是假名離於慢著轉近心地則悟加持神變種種因緣但是法界炎耳故云如是真言相唯是假名。",
    "X23n0438_002:0297a06_0": "經云復次祕密主如夢中所見晝日牟呼栗多剎那歲時等住種種異類受諸苦樂覺已都無所見如是夢真言行應知亦爾者釋論云如夢中都無實事謂之有實覺已知無而還自笑人亦如是結使眠中實無而生著得道覺時乃知無覺亦復自笑又如以眠力故無法而見法無喜事而喜無瞋事而瞋無怖事而怖眾生亦爾無明眠力故不應瞋喜憂怖而生瞋喜憂怖等故今復明此夢事不思議邊如夢中自見住壽一日二日乃至無量歲有種種國土及眾生族類或昇天宮或在地獄受諸苦樂覺時但一念間耳於覺心眠法因緣中四句求之了不可得而夢事照然憶持不謬以一念為千萬歲以一心為無量境此事非世間智者憶度思量能盡其源底亦非可疑之事獨夢者親證知耳今此真言行者瑜伽之夢亦復如是或須臾間備見無量加持境界或不起于座而經多劫或遍遊諸佛國土親近供養利益眾生此事於諸眾因緣中觀察都無所起不出一念淨心然亦分別不謬此事誰能思議出其所以然實獨證知者自知耳行者得如是境界但當以夢喻觀之心不疑怪亦不生著即以普現色身之夢作無盡莊嚴故云深修十句也。",
    "X23n0438_002:0297b03_0": "經云復次祕密主以影喻解了真言能發悉地如面緣於鏡而現面像彼真言悉地當如是知者此中言影即是釋論鏡中像喻彼論云如鏡中像非鏡作非面作非執鏡者作非自然作亦非無因緣作何以非鏡作若面未到鏡則無像故何以非面作無鏡則無像故何以非執鏡者作無鏡無面則無像故何以非自然作若未有鏡未有面則無像像待鏡鏡待面然後有故亦非無因者若無因緣應常有若常有者除鏡除面亦應自出以是故非無因緣當知諸法亦復如是以我不可得故一切因緣生法不自在故諸法屬因緣故非自作若自無佗亦無故非佗作若佗作則失罪福力亦非共作以有二過故亦非無因如先世業因今世善惡行緣從是得苦樂一切諸法必有因緣以愚癡故不知耳如少兒見鏡中像心樂愛著失已破鏡求索智人笑之失樂更求之亦復如是亦為得道聖人所笑今此真言門中以如來三密淨身為鏡自身三密行為鏡中像因緣有悉地生猶如面像若行者悉地成就時乃至起五神通住壽長遠面見十方國土遊諸佛剎皆以此喻觀察是事從自生耶佗生耶若謂佗三密加持能授是果則眾生未修行時佛之大悲平等何故不令成就若謂自如說行能得是果何用觀三密淨鏡之身求加被耶若共生則有二過何以故若謂我心為因待彼眾緣方得成就者即此因中先有悉地果耶若先無耶若先有之眾緣則無所用若先無之眾緣復何所用然是悉地成就亦復非無因緣故智論鏡像偈云非有亦非無亦復非有無此語亦不受如是名中道不應如彼小兒妄生取著也作如是觀故行者心無所得不生戲論故曰應如是知。",
    "X23n0438_002:0297c08_0": "經云復次祕密主以乾闥婆城譬解了成就悉地宮者釋論云日初出時見城門樓櫓宮殿行人出入日轉高轉滅此城但可眼見而無實有有人初未曾見意謂實樂疾行趣之近而逾失日高遂滅饑渴悶極覩熱氣如野馬謂之為水復往趣之乃至求之疲極而無所見思惟自悟渴願心息行者亦爾以智慧知無我無實法者是時顛倒願息聲聞經中無此乾闥婆城喻又以城喻身說此眾緣實有但城假名為破吾我故菩薩利根深入諸法空中故以乾闥婆城為喻也此中言悉地宮有上中下上謂密嚴佛國出過三界非二乘所得見聞中謂十方嚴淨土下謂諸天修羅宮等若行者成三品持明仙時安住如是悉地宮中當以此喻觀察如海氣日光因緣邑居嚴麗層臺人物粲然可觀不應同彼愚夫妄生貪著求其實事以此因緣於種種勝妙五塵中淨心無所罣礙也。",
    "X23n0438_002:0297c23_0": "經云復次祕密主以響喻解了真言聲如緣聲有響彼真言者當如是解者釋論云若深山峽谷中若深絕澗中若空大舍中以語言聲相擊故從聲有聲名為響無智人謂為有實智者心念是聲無人作但以聲轉故更有響聲誑人耳根人欲語時亦咽口中有風名憂陀那還入至臍觸臍響出響出時觸頂及齗齒脣舌咽胷七處而退是名語言愚人不解而生三毒智者了知心無所著但隨諸法實相真言行者若於瑜伽中聞八風種種違順之音或諸聖者以無量法音現前教授或由舌根淨故能以一音遍諸世界遇此諸境界時亦當以響喻觀察此但從三密眾緣而有是事非生非滅非有非無是故於中不應妄生戲論爾時自入音聲慧法門也。",
    "X23n0438_002:0298a12_0": "經云復次祕密主如因月出故照於淨水而現月影像如是真言水月喻彼持明者當如是說者釋論云月在虗空中行而影現於水實法性月輪在如如法性實際虗空中而凡夫心水有我我所相現又如小兒見水中月歡喜欲取大人見之則笑無智者亦爾身見故見有吾我無實智故見種種法見已歡喜欲取諸相得道聖人笑之復次譬水中見月影攪水則不見無明心靜水中見吾我憍慢諸結使影實智慧杖攪心水則不見以是故說諸菩薩知法如水中月持明行者亦如是由三密方便自心澄淨故諸佛密嚴海會悉於中現或自以如意珠身於一切眾生心水中現爾時應諦想觀今此密嚴之相從我淨心生耶從佛淨身生耶自佗實相尚自畢竟不生何況相違因緣而有所生又如一切江河井池大小諸器月亦不來水亦不去而淨月能以一輪普入眾水之中我今亦復如是眾生心亦不來自心亦復不去而見聞蒙益皆實不虗當以慧杖攪之使知無實不得如彼嬰童欲作方便取之以為玩好之具也既能自靜其意復當如如不動為人演說之故曰持明者當如是說。",
    "X23n0438_002:0298b08_0": "經云復次祕密主如天降雨生泡彼真言悉地種種變化當知亦爾者聲聞經以受譬浮泡般若中以泡為喻雖無實性而因緣猶是實生故十句中有如化而不明泡喻今此經譬意亦復殊也如夏時雨水自雨水中隨渧之大小生種種浮泡形類各異然水性一味自為因緣四句推求無別所生之法是故此泡舉體從緣泡起即是水起泡滅即是水滅故以此喻即心之變化也如行者即以自心作佛還蒙心佛示悟方便轉入無量法門及以心為漫荼羅此境與心為緣能作種種不思議變化是故行者以浮泡喻觀之了知不離自心故不生著也釋論又云修定者有十四變化天龍鬼神亦能化作如化生先無定物但以心生便有心滅則滅又是法無初無中無後生是無所從來滅亦無所至當知諸法亦如是復次如變化相清淨如虗空無所染著不為罪福所汙諸法亦爾法性如如實際自然常淨譬如閻浮提四大河一一河有五百小河以為眷屬此水種種不淨入大海中皆悉清淨與泡喻意同也。",
    "X23n0438_002:0298c02_0": "經云復次祕密主如空中無眾生無壽命彼作者不可得以心迷亂故而生如是種種妄見者釋論云如虗空者謂但有名而無實法虗空非可見法遠視故眼光轉見縹色諸法亦如是空無所有人遠無漏實智慧故棄實相見彼我男女屋舍城郭等種種雜物心著如小兒仰觀青天謂有實色有人飛上極遠而無所見又如虗空性常清淨人謂陰[目*壹]為不淨諸法亦如是性常清淨婬欲瞋恚等[目*壹]故人謂不淨此經云心迷亂者如人以疾病非人等種種因緣其心迷亂妄見淨虗空中有種種人物形相或可怖畏或可貪著若得本心時則知如此事生時不染虗空滅時亦非還淨本來不礙虗空亦不異於空行者修觀行時若有種種魔事種種業煩惱境皆當安心此喻如淨虗空雖於無量劫中處於地獄爾時意無罣礙如得神通者於空一顯色中自在飛行不為人法妄想之所塵汙也。",
    "X23n0438_002:0298c18_0": "經云復次祕密主譬如火燼若人執持在手而以旋轉空中有輪像生者如人持火燼空中旋轉作種種相或方或圓三角半月大小長短隨意所為愚小觀之以為實事而生貪著然實都無法生但手中速疾力能運一火成無量相爾真言行者若於瑜伽中隨心所運無不成就乃至於一阿字門旋轉無礙成無量法門爾時當造斯觀但由淨菩提心一體速疾力巧用使然不應於中作種種見計為勝妙而生戲論也釋論無火輪喻別有影喻云如影可見而不可捉諸法亦如是眼識等見聞覺知實不可得又如影映光則現不映則無諸結使煩惱遮正見光則有我相法相又影人去則去人動則動人住則住善惡業影亦復如是後世去時亦去今世住時亦住報不斷故罪福熟時則出然是影非有物但是誑眼法如旋火燼疾轉成輪亦非實有喻意大同也。",
    "X23n0438_002:0299a09_0": "祕密主應如是了知大乘句心句無等等句必定句正等覺句漸次大乘生句者梵音謂句為鉢曇義如前釋此十喻皆是摩訶衍人甚深緣起非聲聞緣覺安足之處也故名大乘句心之實性更無一法可以顯示之者亦不可授人但如是深觀察時障葢雲披自當證知耳故名心句如來智慧於一切法中無可譬類亦無過上故名無等而心之實相與之函蓋相稱間無異際故云無等等若以十緣生了知心處則安住其中故曰無等等句諸佛以此十緣生義必定師子吼說如來性心實相印若有能信解者假使十方世界一切諸魔皆化身作佛說相似般若亦不能變易其心使法相不如是故曰必定句以此中道正觀離有為無為界極無自性心生即是心佛顯現故曰正等覺句以深修觀察故如入大海漸次轉深乃至毗盧遮那以上上智觀方能盡其源底故曰漸次大乘生句當知如是六句次第相釋次第相生也毗盧遮那即以此十緣生句不思議法界作無盡莊嚴藏從十世界微塵數諸佛法界門常出根力覺道禪定解脫諸寶遍施眾生猶尚不匱故曰具足法財一切如來智業由此具足故曰出生種種工巧大智若於一念心中明見十緣生義則上窮無盡法界下極無盡眾生界其中一切心相皆能了了覺知以皆從緣起即空即假即中故曰如實遍知一切心相阿闍棃言行者初修觀行境界現前時由內因外緣力故自然有緣起智生不同常途習定功力苦至而後通徹也梵本中云自此以後次說真言者持誦次第如法悉地如法果生此是傳法者所記故不於經中具出其大意言已說淨菩提心諸心相竟從此以下明進修方便及悉地果生也。",
    "X23n0438_002:0299b15_0": "毗盧遮那成佛神變加持經義釋卷第二"
}