{
    "X23n0439_001:0522c07_0": "大毗盧遮那成佛神變加持經義釋",
    "X23n0439_001:0522c08_0": "演密鈔引文",
    "X23n0439_001:0522c10_0": "朝議大夫行起居即充乾文閣待制史館修撰騎都尉賜紫金魚袋臣　趙孝嚴奉勅撰大哉如來之教也有顯有密所謂顯者五性三乘是也所謂密者總持秘藏是也若夫圓修萬行具證十身頓了一法界心直超三無數劫此乃神變加持之力不可思議也故毗盧遮那佛親為口說金剛秘密主次傳心印玄之又玄秘之甚秘粵從唐代有三藏善無畏者自中天來持以梵本與禪師一行受詔同譯其理甚深尚難趣入乃請無畏再為敷說一行遂增潤其文號曰義釋斯則啟明門之關鍵也暨我大遼國有三藏摩尼者從西竺至躬慕聖化志弘呪典然廣傳授未遑論撰歷歲既久逮今方興伏惟天佑皇帝睿智如神聰謀出俗以至公治國賞罰無私以大信臨人恩威有濟閱儒籍則暢禮樂詩書之旨研釋典則該性相權實之宗至教之三十二乘早賾妙義雜華之一百千頌親製雄詞修觀行以精融入頓乘而邃悟肇居儲邸已學梵文有若生知殊非性習通聲字之根柢洞趣證之源流欲使玄風兼扶盛世時有總秘大師賜紫沙門覺菀幼攻蟻術長號鵬耆學贍群經業專密部稟摩尼之善誘窮瑜伽之奧詮名冠宗師詔開講會最上乘之至理由此發揚因集科文五卷通行于世師自是談演之暇乘精運思復撰成鈔十卷文無不周義無不攝鏡先制之幽隱燭後學之昏疑意者近報國恩遠弘佛道亦既進奏亟命雕鎪申諭微臣得述前引道安天闊信側管以徒為澄觀月高慚隔縠而莫覩強攄鄙素聊贊玄言。",
    "X23n0439_001:0523b18_0": "大毗盧遮那成佛神變加持經義釋",
    "X23n0439_001:0523b19_0": "演密鈔卷第一并序",
    "X23n0439_001:0523b21_0": "燕京圓福寺崇祿大夫檢挍太保行崇",
    "X23n0439_001:0523b22_0": "祿卿總秘大師賜紫沙門　覺苑　撰",
    "X23n0439_001:0523b23_0": "恭聞皇覺垂形儼十身於藏剎微言著範軼五駕於殊途或有眾生覩佛威儀而得度者或有眾生聞佛音聲而得度者諒根器以成差遂影響而亦異然利有攸往功不唐捐若夫理包性相義貫淺深為八藏之泉源作一乘之鈐鍵獨標圓密逈出餘宗者則大毗盧遮那成佛神變加持經其大矣哉斯經迺總持之潤府法界之靈宮金剛手方可探其賾蓮華眼始能窺其奧頓超位地譬之以神通速離纏痾喻之以呪術加以入金剛界啟菩提心陞金剛座紹菩提種護摩設祭大自在事火異其宗澆頂施儀色究竟受軄方其躅不入曼荼羅不依阿闍梨則不得入其手自無畏三藏翻譯之後禪師一行義釋已還緜歷歲時聲光淪墜非遘昌期孰能極此今我天佑皇帝睿文冠古英武超今十善治民五常訓物博綜儒經有詩賦碑記之製錦爛華明允彰乎教化尤精釋典有讚序疏章之作山輝川媚聿在乎修行于茲邃旨夙促宸懷爰命瑣才俾宣秘呪因咸雍初提總中京大夫慶寺屬以時緣再興未肆迺有副留守守衛尉卿隴西牛鉉守司空悟玄通圓大師弼公洎僧首紫褐師德百有餘人同致書曰伏聞毗盧大教旨趣宏深疏詮妙賾早已著其菁華鈔解至玄尚未闢於閫域儻納勤誠願聞可爾甞其雖從削簡未暇操[竺-二+觚]越大康三年忽降綸旨令進神變經疏鈔科則密教司南時至矣於是敬酬聖澤兼副輿情強摭群詮謬成斯解目之曰演密鈔會於前冬詔赴行在面奉進呈勅令雕印墜典斯興仁王之力也覺苑智虧宿種見匪生知徒然爝火之明曷益曦輪之照庶俾來者共踐玄涯爾。",
    "X23n0439_001:0524a10_0": "將釋此疏大分為二第一文前聊簡第二依文正釋初文分六一起教因緣二藏教收攝三說經會處四辨教淺深五明經宗趣六翻譯傳通。",
    "X23n0439_001:0524a13_0": "且第一起教因緣分二初酬昔願後順當根初中分二初明自證後釋辨加持且初文者我毗盧遮那世尊過去世時於自覺地最初一念發菩提心依三密方便修三十七菩提分法諸度空等波羅密門超三妄執超三執已即證本地法界之身證此身已常處法界金剛宮殿以十佛剎微塵數等上首執金剛眾而為內眷屬以普賢文殊等十佛剎微塵數上首諸菩薩眾為大眷屬故智度云欲為諸佛內眷屬欲得大眷屬等即與如是金剛菩薩無量眷屬常受無盡秘密甚深不可思議廣大法樂。",
    "X23n0439_001:0524a22_1": "後辨加持分二初明體後辨相初明體者即以悲智而為體故遮那世尊自受如是廣大法樂由初本願誓度無邊諸眾生故激起大悲作是思惟一切眾生皆有如是法界宮殿二種眷屬種種法樂與我無異但以無明所覆不自覺知由不覺故輪迴三有唐受辛勤備歷諸苦若我自住如是不可思議微妙境界則諸有情不蒙利益是故住於自在神力加持三昧也。",
    "X23n0439_001:0524b05_2": "後辨相者於是世尊作是思惟已於三昧中現起不思議神變加持之相經云毗盧遮那如來加持故奮迅示現身無盡莊嚴藏奮迅示現語意平等無盡莊嚴藏乃至又現文殊執金剛蓮華手菩薩等種種相皃普於十方宣說真言道句法上來總是酬昔願。",
    "X23n0439_001:0524b10_3": "後順當根分二初金剛啟問後世尊垂答初分為二初示疑相後伸疑問初金剛手菩薩覩佛所現加持之相仰測如來實相之智猶如彌勒覩佛毫光神通之相作是思惟今佛放光為欲說此為當授記今亦如是金剛覩見莊嚴之相皆是外迹智者見其條末則可喻其根本如世大龍驅雷駕電降澍大雨令鳥獸振吼百川奔勇雖不覩其形當知此龍威勢必大今佛現瑞一時普應法界而作加持亦復如是雖不能覩佛身相大小色像威儀然可比知如來智力必大照俗之權尚爾契實之境當復云何後伸疑問者金剛手菩薩由觀如來加持莊嚴相已復諦思惟此加持相乃從如來一切智智為眾生故之所現起又復如來一切智智依何而得於是乘彼眾心并欲自決所疑而伸請問經云爾時執金剛秘密主於眾會中白佛言世尊云何如來應供正遍知得一切智智乃至如是智慧云何為因云何為根云何究竟意云如來不共一切智智之果從何而得為以何法而為其因為以何法而為其根為以何法為究竟耶。",
    "X23n0439_001:0524c04_4": "後如來垂答於是世尊普觀眾會順彼疑問次第宣答經云毗盧遮那告金剛手言菩提心為因大悲為根方便為究竟此經七卷三十一品從始迄終皆是顯斯三句之義當知即是阿阿暗惡四字之義總也是第一起教因緣。",
    "X23n0439_001:0524c09_0": "第二藏教收攝分二初藏收後教攝初如來所說一大時教分成三藏一修多羅藏即是契經二毗奈耶藏即是調伏三阿毗達磨藏即是對法又於修多羅中分出陀羅尼門別為一藏又此通大小乘開為八藏今遮那神變經即當第八總持藏攝問既屬第八總持藏攝何故經題之中不立總持而言經耶答經含總別今就總故雖標總稱即受別名故先哲云三乘之外別有持明即斯是也。",
    "X23n0439_001:0524c16_1": "後辨教攝者古來分教總有多岐且依清涼教類有五一小乘教但說我空縱少說法空亦未明顯但依六識三毒建立染淨根本未盡法源故多諍論二始教亦名分教此既未盡大乘法理故立為初有不成佛故名為分三終教定性二乘無性闡提悉當成佛方盡大乘至極之說故名為終又亦名寶教以稱實理故名理為實上之二教並依地位漸次修成故總名漸四頓教但一念不生即名為佛不依地位漸次而說故立為頓又不同前漸次修行不同後之圓融具德頓詮此理故名為頓五圓教明一位即一切位一切位即一位十信滿心即攝五位成正覺等依普賢法界帝網重重主伴具足故名圓教廣如彼疏今神變經典與此大同但顯密為異耳是故此經五教之中圓教所攝故下序云此經迺秘藏圓宗深入實相為眾教之源爾又疏云此經橫統一切佛教如說唯蘊無我出世間心住蘊中即攝諸部小乘三藏如說蘊阿賴耶覺自心本不生即攝諸經八識三無性義即勝鬘法華等經瑜伽唯識等論如說極無自性心十緣生句即攝華嚴般若種種不思議境界皆入其中如說如實知自心名一切種智則佛性一乘秘密藏皆入其中又如釋字輪旋陀羅尼義以一字攝一切字一切字全是一字初後相攝橫竪該羅一切法門不離一字即同華嚴四十二字初一阿字具漫荼等亦是四十二位舉一全收疏文上下判為圓頓不思議神通之乘又如金剛頂瑜伽指歸中說五部隨一一部具三十七尊乃至一尊成三十七尊互相攝入如帝釋網珠光明交映展轉無限若真言行者善達此理即同遍照如來一一身分一一毛孔一一相一一隨形好一一福德智慧資粮住於果位演說瑜伽不共佛法乃至頓能利樂一切有情上來總是第二藏教所攝。",
    "X23n0439_001:0525a23_0": "第三說經會處依不空三藏所譯都部陀羅尼錄云毗盧遮那成道經大本十萬頌可有三百卷唐國所譯略本七卷緣此經來未盡處會難明且引當宗金剛頂瑜伽比擬顯示瑜伽指歸云金剛頂瑜伽有十萬偈十八會說第一會名如來真實攝教王有四大品一名金剛界二名降三世三名遍調伏四名一切義成就表四智印一一品中各說六漫荼羅不能具引第二會名一切如來秘密主瑜伽於色究竟天說具四大品廣說微細實相理及說降魔醯首羅天等第三會名一切教集瑜伽於法界宮殿說一百二十種護摩爐一一爐所求各異第四會名降三世金剛瑜伽於須彌頂說金剛藏等八大菩薩一一菩薩說四漫荼羅謂大漫荼羅三昧耶漫荼羅法漫荼羅羯磨漫荼羅乃至秘密禁戒秘密修行法第五會名世間出世間金剛瑜伽於波羅奈國空界中略說五佛漫荼羅及諸菩薩諸外金剛部漫荼羅等求悉地法第六會名大安樂不空三昧耶真實瑜伽於他化自在天宮說普賢菩薩漫荼羅等乃至引入弟子授理趣般若波羅密法第七會名普賢瑜伽於普賢菩薩宮殿中說普賢等至金剛拳菩薩及外金剛部等及說修行之人無時無方不依世間禁戒以菩提心為先無為戒為本第八會名勝初瑜伽於普賢宮殿說普賢等至外金剛部稍廣於第七會大略是同第九會名一切佛集會荼吉尼戒網瑜伽於真言宮殿說立自身為本尊呵自身外立形像并說瑜伽法具九味所謂華麗(金剛薩埵)勇健(毗盧遮那)大悲(持金剛)喜笑(觀自在)嗔怒(金剛光)恐怖(降三世)厭患(釋迦牟尼)奇特(金剛笑)寂靜(瑜伽中毗盧遮那)乃至說五部中歌讚舞儀第十會名大三昧耶瑜伽於法界宮殿說普賢菩薩至金剛拳十六大菩薩各各說四漫荼羅乃至偈云愚童覆無智不知此理趣餘處而求佛不悟此處有十方世界中餘處不可得心自為等覺餘處不說佛第十一會名大乘現證瑜伽於阿迦尼吒天說毗盧遮那佛至毗首羯磨菩薩及八大供養四攝等第十二會名三昧最勝瑜伽於空界菩提場說毗盧遮那八菩薩等乃至說自身本尊瑜伽廣說阿字門通達染淨無礙第十三會名大三昧耶真實瑜伽於金剛界道場說十方一切佛異口同音請金剛薩埵說三昧耶真實教法彼受請已說普賢菩薩十七字真言乃至通求世出世悉地等第十四會名如來三昧耶真實瑜伽(與上同處)此經中說普賢菩薩十六大菩薩四攝成一身廣說五部互圓融如來部即金剛部乃至法界即真如般若即實際等第十五會名秘密集會瑜伽於秘密處說所謂喻師婆伽處說號般若波羅密宮此中說教法壇印真言住禁戒似如世間貪染相應語會中除蓋障菩薩從座而起白言世尊大人不應出麤言雜染相應語佛言汝等清淨相應語有何相狀我之此語加持文字化緣方便引入佛道亦無相狀成大利益不應生疑等第十六會名無二平等瑜伽於法界宮說生死涅槃世出世間自他無二動心舉目聲香味觸雜染思慮同真如法界皆成一切佛身第十七會名如虗空瑜伽住實際宮殿說毗盧遮那普賢外金剛部一一說四印漫荼羅修行者與此一一尊相應皆量同虗空法身等第十八會名金剛寶冠瑜伽於第四靜慮天金剛薩埵菩薩請佛為大梵天娑訶世界主說五部漫荼羅引入弟子儀具三十七乃至為弟子受學心念誦於月輪上右旋布列真言字於一一字實相相應周而復始不假持珠遍數以為劑限但證理門心不散動住本尊瑜伽為限等已上一十八會有一十四處謂法界宮有三會普賢宮有二會金剛界道場二會俱十四處此經義當第十六會法界宮處說也所以知者故此經云住如來加持廣大金剛法界宮又云演說身語意平等句法門即與彼同如是會處一該一切於中法門亦復如是總是第三說經會處。",
    "X23n0439_001:0526a16_0": "第四辨教淺深且經開頓漸義分淺深隨根器則有差歸法界則無二此經乃被上下根通顯密說顯謂五性一乘該諸經論密謂字輪觀行陀羅尼門略舉一二以彰教之深勝且彰自教如不空羂索蘇悉地等說修造漫荼羅須用瞿摩夷瞿模怛羅此即牛糞及液瞿摩牛也阿夷糞也烏怛囉液也西竺之法凡乳牛更不使用但取孳養牧於山澤水草自恣多食香草不食穀料其糞香潔彼方共許為淨用戒壇地易施綵繪餘牛不堪此但淺釋若深釋者瞿是行義以入阿字門故則是諸法無行摩是我義夷是乘義何故諸法無行以一切法我不可得故若無有我則無所乘及與乘者故名瞿摩夷瞿模怛羅(二合)此云牛液瞿摸如前釋怛羅是如如離塵垢義體即心之實相若修真言者修造內心大悲漫荼羅能以如是如如離塵之糞液淨治心地令畢竟清淨畫作法界圓壇即是此中用瞿摩夷義又如言三月持誦乃是清淨圓明中阿阿暗三轉方便豈可作九旬解耶若對他教者如梵云劫跛餘教共譯為時分若度三阿僧祇時分即名成佛此中義別梵語劫跛譯為妄執妄執有三謂麤細極細此三妄執依五根本煩惱初分成十枝第二再分成二十種乃至第五分成一百六十隨煩惱數若依於此經發菩提心修密言行初心聚沫浮泡陽燄芭蕉幻事等五種譬喻觀無性空離百六十心一重麤妄執即超一阿僧祇劫復以幻陽燄影響旋火輪乾闥婆城六喻觀不可得空復越百六十心等一重細妄執即超二阿僧祇劫復以幻陽燄夢影乾城響水月浮泡虗空華旋火輪等十喻觀不思議空越百六十心一重極細妄執即超三僧祇劫行者若一生度此三妄執即一生成佛何論時分耶又如婬盜煞妄諸教共說為波羅夷若有犯者故結為重今此教中乃是偷蘭何以故不礙菩提心故非菩薩極重此中四重者先令不捨三寶又令不捨菩提心此即菩薩真四重也若菩薩生如是心捨離於佛即名破於重禁所以然者如來即是一切善法所從生處菩薩以自歸依佛故方有一切地波羅密等萬行成就猶因阿字種子方得生暗字之果若捨阿字自然之智則一切善法不得生故捨佛即是斷一切菩薩之命而絕其成佛之根若行婬盜煞妄但於道有礙非斷佛種故但成偷蘭偷蘭遮者或云大罪或云麤惡以佛不可捨故法僧亦爾菩提心亦然是一切諸行之本若離此心則無一切菩薩法故捨之則犯波羅夷罪今此宗中復以此重而為方便成就四種三昧耶戒所謂不應捨正法捨離菩提心慳恡一切法不利眾生行此戒受時即以密印種子而加持之由此得智水灌頂見身即同大日如來轉於法輪是知此教對餘顯說為深勝爾總是第四辨教淺深。",
    "X23n0439_001:0526c15_0": "第五明經宗趣者語之所上曰宗宗之所歸曰趣此經即以秘密不思議法界緣起觀行為宗若以秘密不思議法界緣起為宗即以觀行為趣或以觀行為宗即以秘密不思議法界緣起為趣是宗之趣或宗即趣可以意得由是疏文上下或歸於不思議法界緣起或歸於甚深秘密觀行其文非一不煩具出。",
    "X23n0439_001:0526c21_0": "第六翻譯傳通分二初明翻譯後辨傳通且初唐玄宗開元中沙門輸波迦羅中印度人釋迦之苗裔風儀爽俊聰叡超群解究五明行該三學總持禪觀妙達其源藝術異能無不諳曉發跡中天來遊東夏途至北印聲達帝京今上發使迎接開元四年景辰大賷梵本來達長安初於興福寺安置後勅住西明至五年丁巳於菩提院譯虗空藏求聞持法等并令進內又曩時沙門無行西遊天竺學畢言歸迴至北天不幸而卒所將梵本有勑迎歸西京華嚴寺收掌無畏與沙門一行於彼揀得數本梵經并總持妙門先未曾譯至十二年隨駕入洛於大福光寺譯大毗盧遮那經沙門寶月譯語沙門一行筆受承旨兼刪綴詞理文質相丰妙諧深趣。",
    "X23n0439_001:0527a09_1": "後辨傳通以斯經乃總持之淵府秘藏之玄關因寄有為廣示無相禪師尚慮學者守文失意搜閱大小相應之教舉顯密二釋會性相微言勒成十四卷目之曰義釋未及宣演玄宗幸蜀禪師沒化斯文尋墜洎我大遼興宗御宇志弘藏教欲及邇遐勑盡雕鎪須人詳勘覺苑持承綸旨忝預校場因採群詮訪獲斯本今上繼統清寧五年勅鏤板流行上來六段不同總是第一文前聊揀已竟。",
    "X23n0439_001:0527a19_0": "第二依文正釋大分為二初明疏序後釋疏文序復分三初題名次作者後正文且序題中復分為三初經題次經號後序字。",
    "X23n0439_001:0527a22_0": "且經題者即大毗盧遮那成佛神變加持經十二字就此分二初離釋後合釋離釋分二初翻名後釋義且翻名者梵云摩訶毗盧遮那悉提三菩提微吃哩[寧*頁]多地瑟姹曩素怛囕摩訶云大毗盧遮那云遍照悉提云成三菩提云正覺微吃哩[寧*頁]多云神變地瑟姹曩云加持素怛囕云經總云大遍照成正覺神變加持經後釋義者復分為二初約三大釋後約三身釋且三大者大之一字是體大謂一真法界橫遍十方竪窮三際莫尋其始寧見中邊非生非滅無去無來此即名為體大毗盧遮那四字即相大謂光明遍照即日之別名除闇遍明義故具常樂我淨恒沙性功德故即相大也成佛神變加持即用大謂以圓滿覺體盡諸障故起三種神變加被住持護念眾生故以神境神變加持故令增威以記說神變加持故令益智以教授神變加持故令益辨即三密方便總攝三類變化十重他報用周法界應物現形導萬種情根歸一乘智火即用大也故起信云一者體大謂一切法真如平等不增減故二者相大謂如來藏具足無量性功德故三者用大能生世出世間善因果故又大毗盧遮那俱屬體大成佛二字即相大神變加持用大也又或大之一字是總毗盧神變等是別體相用三而皆大故二約三身義釋者大毗盧遮那即法身成佛即報身神變加持為應化身又或大屬法身毗盧遮那成佛俱是報身神變加持即應化身或可大之一字即通三身所謂大法身大報身大化身也若真應無礙即盧遮那是毗盧故全毗盧之體是釋迦故名號品云或名毗盧遮那或名釋迦牟尼三大三身或同或異如理思之經者能詮聲名句文四法為體依瑜伽論兼所詮義五法為體若釋義者即貫常攝法四義為名或依雜心說經有五義涌泉出生顯示繩墨結鬘涌泉則澍而無竭出生則展轉滋多顯示則彰事理繩墨則楷定正邪結鬘同線線能貫華結成鬘故後合釋者大之一字即是體大毗盧遮那即是相大成佛神變加持即是用大謂成佛二字自利果圓神變加持利他妙用也神是其智變即是境是變之神從境得名或神即變當體立號神變上即有加持用故神變即加持又神變即能發三種神變加持乃所發三種表業是神變之加持望成佛二字即是所起從能起以彰名是成佛之神變加持此則用大若三大差別相望是大之毗盧遮那是大毗盧遮那之成佛神變加持作依主釋若三大不相離者大毗盧遮那即成佛神變加持作持業釋經之一字是能詮大毗盧等是所詮能所相望依主為名或經是通名大毗盧等是別號以別揀通亦依主釋若廣釋經題如下疏明上來總是釋經題竟。",
    "X23n0439_001:0527c19_0": "次疏號者即義釋二字義謂義理即經旨趣釋謂解釋即疏文言謂以疏主制十四卷之雄文釋一七軸之奧義是義之釋名為義釋或以義釋二字俱屬疏文採眾典之妙義釋一經之微言義即釋故望上經題作釋是大毗盧遮那成佛神變加持經之義釋依主為名上來總是疏號已竟。",
    "X23n0439_001:0528a01_0": "後序字者序謂由序起疏之端由或序者說也宣一部之大旨故爾雅云東西墻謂之序即屏墻也表一宅之庠序也若轉訓時序者緒也如蠒得緒序盡蠒之絲若疏得序序盡疏之意故稱為序疏為所序序是能序能所相望依主為名故云大毗盧遮那成佛神變加持經義釋序前文有三總是釋序題竟。",
    "X23n0439_001:0528a07_0": "次明作者釋者沙門之通稱溫古即序主之別諱溫者尋也古者故也法師憙溫尋故事建立新規故以稱焉論語云子曰溫故而知新可以為師注曰溫尋也尋繹故者又知新可以為師故曰溫古撰者述也特謙立名故曰釋沙門溫古撰。",
    "X23n0439_001:0528a12_0": "後正文者　序　持明藏者秘藏之都稱也謂此經大本有十萬頌正詮一切總持明呪別為一藏故曰特明藏也。",
    "X23n0439_001:0528a15_0": "言持者梵語陀羅尼此云總持總持通四一法總持持能詮教二義總持持所詮義三呪總持謂是真言四忍總持能於前三決定忍可今言總持者四總持中此屬第三雖屬第三能攝餘故餘三不能攝於此故問曰諸教說總持皆以念慧為體何言呪總持謂是真言答云總持之體有通有別通則目於念慧若法義呪忍俱以念慧而為體故是法之總持義之總持等從所說所解等而立其名有法義等別若論別體呪總持謂是真言也若爾既是真言云何能攝餘三耶釋曰非此真言唯目能詮具教理行果四法而為體由具教故能攝法總持具理故能攝義總持具行故能攝忍總持餘之三種總持不能攝此各取法義忍而為體故故不相違又以第三此宗所尚就宗明義故能攝餘是以序云無量事迹所有文言結會指歸無非秘密之藏故下疏云猶如攬結眾髮戴之在首攬結眾髮者總攝諸教也戴之在首者表出眾乘之上也至乃如地載萬物等故名為持又持謂加持梵語地瑟姹曩此云加持通三密也或云憶念唯意密故故下疏云諸佛如來自證三菩提出過一切心地現覺諸法本初不生是處言語盡竟心行亦寂若離如來威神之力則十地菩薩尚非其境界況生死中人乎由是世尊往昔悲願而作是念若我但住如是境界則諸有情不能以是蒙益是故住此自在神力加持三昧普為一切眾生示種種諸趣所喜見身說種種性欲所宜聞法隨種種心行開觀照門譬如幻師以呪術力加持藥草能現種種未曾有事五情所對悅可眾心又下疏云入真言門略有三事一者身密門二語密門三者意密門行者以此三方便自淨三業即為如來三密之所加持乃至能於此生滿足地波羅蜜不復經歷劫數備修諸對治行故大品云或有菩薩初發心時即上菩薩位得不退轉或有初發心時即得無上菩提便轉法輪龍樹以謂如遠行乘羊去者久久乃到馬則差速若乘神通人於發意頃便至所詣不得言發意間云何得到神通相爾不應生疑則此經深旨也。",
    "X23n0439_001:0528c02_0": "明者明呪真言之別稱梵語尾伱也(二合)此譯云明破暗為義梵語漫怛囉此云真言或名神呪謂此真言能破眾生煩惱暗障義翻為明呪即明故故下疏云由不了真諦名為無明由無明故而有諸行生種種苦雖菩薩入於地位然猶未了如來甚深秘密之境即是微細無明亦復是苦佛為彼等說此明呪究竟令知佛之境界除無明苦獲涅槃樂般若心云是大明呪能除一切苦真實不空即斯義也又名謂詮顯通四法故聲名句文能顯義故即總持教猶暗夜金玉藉燈炬以顯彰人顏妍媸由鏡鑑以區別華嚴經云譬如暗中寶無燈不可見佛法無人說雖慧莫能了又清涼云至聖垂誥鏡一心之玄極等法喻配合易可知矣又三密中屬者通途教體多語密也別釋明者據身密也故下疏云從如來身口出者名為真言從如來身分任運生者名之為明問曰前以明字屬教即聲等四法今言從身生者名明何有聲耶答如下疏云從身發吼等聲說亦有聲也仍以身密而為體故或依身立名句等如下布字法於身分上顯三重字輪即三轉法輪義也前據多分依聲立教不遮亦依色香味等假立三故如楞伽經云大慧見此世界蚊虻虫蟻是等眾生無有言說而各辦事等但由顯理生解即是教體豈要唯局言聲者哉如絲竹傳心目擊存道等類故曰明也亦持亦明持即是明或是持之明作釋隨應故名持明。",
    "X23n0439_001:0529a02_0": "藏者能攝義故天親論云何緣名藏由能攝故謂攝一切所應知義此義意言由能詮教能攝一切所應知義令不失故立以藏名梵云賴耶即巢室之藏也安住此中不為頻那夜迦風雨之所侵故或云俱舍即鞘室之藏諸佛依此而安住故或云[薩/木]囉賀即胎藏之藏諸佛從此而出生故或云[薩/木]囉婆即府庫之藏今且取府庫名之為藏由如世間國大庫藏即能蘊攝種種雜寶出內取與賑濟無窮持明藏亦爾蘊攝諸佛秘密法義利樂無盡故以為明藏有其四揀餘三故持明之藏或持明即藏作釋可知故曰持明藏也。",
    "X23n0439_001:0529a13_0": "言宗分條流至久矣者彰其本末也宗者本也分謂支分條乃枝條流即流派謂此明藏大本十萬頌以其太廣博傳法聖者撮其宗要凡三千頌(此即宗也)有多支分所謂阿闍梨支分弟子支分擇地支分造立曼荼羅支分乃至灌頂護摩等支分(即其分也)又於彼支分中展轉蔓延枝派無盡夫法門浩廣窂究津涯故有隨宜化誘應物施緣多於大部之中略出別行欲令披枝葉窮其根抵尋波瀾究其源穴也名曰條流今此中條流之經自後漢明帝已來宣傳翻譯代有其人北凉沙門法眾譯大方等陀羅尼經元魏沙門佛陀扇多譯金剛上味陀羅尼等經周沙門闍那耶舍譯佛頂呪等經東晉沙門帛尸密多羅譯孔雀王等陀羅尼經宋沙門曇摩密多譯虗空藏等經大唐沙門玄奘譯不空羂索等經菩提流支譯不空神變等經乃至金剛智不空等大弘斯典具如開元釋教錄所載故曰宗分至久矣也。",
    "X23n0439_001:0529b05_0": "序　世之學者至中道者謂古來傳譯條流之經雖盛行於世然世間修學之者不見巨本不偶明師但多存心於有為事相少能契會於無為中道故清凉云有作之修多劫終成敗壞無心體極一念便契佛家下疏云如餘菩薩為求無上道故雖難行苦行終不能得瑜伽行者若具方便一生可就以知甚深緣起中道法門故真言又如云落叉此名為億即十萬數亦名為見見謂真言行者作成就時境界現前即以心目觀之一緣不亂即是瑜伽落叉之義而今世間執蘇悉地等經不知秘決如文而住但誦十萬遍欲希悉地何時可獲耶或可言有相者行者不了多分執一切法有故名有相不遮少分著空亦不契中道又或執空仍有邊相俱名有相不合中道故云世之學者等。",
    "X23n0439_001:0529b19_0": "序　其瑜伽行法等者梵語瑜伽此云相應即此相應具通顯秘且顯教者而有四種如瑜伽疏云一境喻伽有總有別初總者釋論解云謂一切境無顛倒性不相違性能隨順性趣究竟性此之四境如次與彼理教行果有相應義後別者楞伽經云若觀真義除去分別遠離瑕穢無有能取亦無所取爾時在定當見瑜伽如是等法一一皆具無倒等四相應義故名曰瑜伽二行瑜伽者復有總別言總行者謂一切行更相順故稱正理故順正教故趣正果故說為瑜伽其別行者月燈經中修三十七品菩提分法說為瑜伽此於一切順果行中最為勝故慧到彼岸經中說般若波羅密多名勝瑜伽導大乘行此殊勝故三果瑜伽者亦分總別初總者謂一切果更相順故合正理故順正教故稱正因故名曰瑜伽後別者然諸經論就相隨根種種異說大義經中說如來地無分別智及以大悲名曰瑜伽自利利他常無盡故四教瑜伽者即說境行果三之教名教瑜伽稱正理故順正行故引正果故故皆瑜伽有義五法名曰瑜伽前四同前五者利生藥病相應名曰瑜伽若密宗所明瑜伽行者正是法界字門觀行也若以阿字本不生義觀即屬理法界觀遍一切處與理相應故下疏云但此中一切眾緣皆成法界標幟所為事業盡帶瑜伽義當阿字遍一切字凡開口動舌皆帶阿音若隨事法界別觀下疏以字門作三重四重曼荼羅異故或以阿縛羅訶佉五字而配五輪次不差故疏云凡行者欲修觀時先當住瑜伽座以阿縛羅訶佉五字加持自體如悉地出現品及供養次第法中說所以然者諸佛無上菩提雖復寂寂無相然要當以金剛身坐金剛地方可入證自餘虗幻身土力所不堪等(云云)其中字字三密各別觀時上下非一乃至五部色相各異皆屬事觀若作事理無礙觀時隨一一事下即歸理故下疏如以夢幻等五六十喻觀一切法皆順空理復次行者初依有相瑜伽世間成就故漸淨六根面見十方諸佛乘此加持妙用遊戱神變廣利眾生然猶屬世間悉地今觀如是悉地但從眾緣生故無有生滅斷常去來一異皆如夢幻泡影鏡像水月乾闥婆城即緣生無性舉體即空事即理也凡一切字皆攬阿字之所成故若無開口之音何有隨宜之說譬千里之程由初步而即登九仞之山虧一籄而不立即理成事也若事事無礙法界觀者下疏復次所以從小至大攝大歸小者欲令行人心自在故由彼心力卷舒無礙漸能以一微塵包含無量世界此無量世界內一微塵中又云復次行者以常修習相應故不思議法界標幟轉更現前能觀自身即是本尊身觀本尊身即是自身如是不二而二二而不二若觀本尊心佛為自身時即見自身在本尊心圓明中於自心上亦有微細圓明種子能令漸次增廣卷舒自在若觀自心中佛為本尊時即見如來在行者心圓明中於佛心上亦有微細圓明種子漸能增廣卷舒自在皆無障礙互不相妨故經云乃至本所尊自身像皆現也即因果交徹生佛互收上來四法界觀義粗略釋之於文煥矣今言瑜伽即當秘密又復秘密之中復有秘密耳行謂觀行隱謂秘隱謂持明藏或宗分或條流雖傳譯久矣然世修學之者但守文失意多存有相窂契中道蓋此秘密瑜伽觀行之法秘隱未得顯明且如蘇悉地等經說弟子將灌頂為息障故作息災護摩之法凡作火供須與息災事理相應所謂火爐薪木形色憙怒時分真言密印本尊等所有支具及所求果皆須相應然此但是淺略有相方便未能正契深密無為中道何以故瑜伽行法秘隱而未顯明故若作深秘瑜伽釋者此護摩支分是眾因緣義世間因緣能生三有災患今還以此為慧火之資供養一切普門身增益不思議勢力經云煩惱為薪智慧為火以是因緣成涅槃飯令諸弟子悉皆甘嗜即是護摩瑜伽之義故蘇悉地等諸經要用此宗決之方見深意耳故云其瑜伽行法隱而未明。",
    "X23n0439_001:0530b14_0": "序　夫法流不通等者夫即語辭法即教法瑜伽教法也水行曰流教法如流故曰法流言不通者擁滯不行也言弘道等者弘謂弘揚道即教道者即假者憂謂憂傷諸瑜伽法流擁滯未得通行即弘揚教道之菩薩能不憂傷者哉故論語云子曰吾衰也久矣不復夢見周公注曰孔子衰老不復夢見周公明盛之時夢見周公欲行其道今借而用之孔子則憂治國之至道不行菩薩則傷利物之法流斯擁治國之至道不行人罹非法利物之法流斯擁行乖中道又起信鈔云諸佛教法欲破滅時傳法菩薩當不惜身命發不退心即造章疏講宜經論獎勸後學使燈燈相續是護教也且佛垂正教本在流通令諸眾生出於生死今乃隱廢即是滅義不必同始皇之煨燼矣又孔子云德之不修學之不講聞義不能從見善不能改此四者是吾之憂也故曰弘道者等。",
    "X23n0439_001:0530c05_0": "序　廼秘藏圓宗等者此經乃是毗盧遮那如來親演執金剛蓮華手同稟非普為一切故稱秘藏故下疏云秘密者即是如來秘奧之藏久默斯要如優曇華時乃說之苟非其人則不虗授不同顯露常教故曰秘藏問華嚴法華涅槃經等佛亦親宣名為秘藏華嚴疏云大華嚴經者諸佛之秘藏彼又釋云謂此華嚴圓經即是一乘秘密之藏三世諸佛悉並宣說等豈非秘藏耶答華嚴等經雖彰秘密教屬顯故大乘四藏之中即屬第一修多羅故今時此經稱秘藏者不屬顯故八藏之中即是第八陀羅尼藏故又此中稱秘密者不同餘故何所以耶謂此經以三密為宗故下疏云如來身語意密唯佛與佛乃能究了言身密者即是諸印如四重漫荼羅一一本尊各有身印若觀此者即知此尊所表秘密之德語密者即是諸尊所有真言若聞此者即知此尊內證之德意密者即是本尊瑜伽之觀乃至與此相應即入如來意密之藏又下秘密漫荼羅品中偈云最初正覺等敷罪漫荼羅密中之秘密大悲胎藏生疏釋云然此大悲藏生前已說竟何故更說有何差別耶然前所說雖為秘密更有秘中之秘密中之密若不得此法者設通達前法亦不成故是以最為秘要若解此者一切世間出世間諸漫荼羅皆同用之無所不入所以此經獨稱秘藏蓋由此也秘中秘義至文當悉。",
    "X23n0439_001:0531a04_0": "言圓宗者圓謂圓滿由含總故宗謂宗主由尊尚故此經總能含攝一切大小性相諸法故下疏云以此經者橫統一切佛教如說唯蘊無我出世間心住蘊中即攝諸部小乘三藏如說觀蘊阿賴耶覺自心本不生即攝諸經八識三無性義如說極無自心十緣生句即攝華嚴般若種種不思議之境界皆入其中如說如實知自心名一切種智則佛性一乘如來秘密藏皆入其中如是於種種聖言無不統其精要故曰圓宗問何以得知答為此經也語其廣包具無量乘論其深勝直歸一乘同華嚴故故下經云云何如來應供正遍知得一切智智彼得一切智智為無量眾生廣演分布隨種種趣種種性欲種種方便道宣說一切智智或聲聞乘道或緣覺乘道或大乘道或五通智道或願生天或生人中及天龍夜叉乃至人非人等身各各同彼言音住種種威儀等疏釋云復次此中問意即是發起大悲胎藏漫荼羅也於薩婆若平等心地畫作諸佛菩薩乃至二乘八邪等四重法界圓壇此一一本尊身語心印皆是一種差別乘也即名廣包具無量乘故又經云而此一切智智道一味所謂如來解脫味疏釋云且如有人志求五通智道即於大悲胎藏現韋陀梵志形為說瞿曇仙等真言行法行者精勤不久成此仙身更轉方便即成毗盧遮那身也如是或現佛身說種種乘乃至現非人身說種種乘隨類形聲悉是真言密印或久或近無非毒皷因緣即名深勝直歸一乘且如此宗正顯密義旋陀羅尼一字即攝一切字一切字全是一字初後相攝舉一全收橫竪該羅一切法門不離一字全同華嚴四十二字初阿具後荼等亦是四十二位舉一全收正當此經所尚之理故疏上下判為秘密圓頓不思議成佛神通乘也如下疏云私謂然大般若等中具說洗滌觀心之事然須有本今行人先約別緣起觀乃至具見十方佛會諸世界等種種境界而後約般若洗滌淨除即成不思議大用頓入佛果若不知行行次第但觀彼文不入深故多錯會經意直爾入空失圓頓道也斯乃即當華嚴十宗之內圓融具德宗但顯密有殊矣。",
    "X23n0439_001:0531b16_0": "言深入實相者深者形淺入者達解實者揀權相者體相如下疏云真言行菩薩以阿字門觀陰界入時即陰求心離陰求心皆不可得相在亦不可得即時懸悟自心本不生際於如來知見大菩提道中遠塵離垢得法眼淨當知此觀最為秘要法門又如餘遠離方便諸菩薩漸次修習戒定智慧於無量劫以種種門觀人法二空猶未能遠離心之影像今真言行者初發心時直觀自心實相了知本不生故即時人法戲論淨若虗空成自然覺不由他悟當知此觀復名頓悟法門也若入此門即是初入一切如來境界譬如彌勒開樓閣門內善財童子是中具見無量不思議事非以言宣但人者自知耳故云深入實相。",
    "X23n0439_001:0531c04_0": "言為眾教之源爾者為者作也眾教者表非一故水本曰源意云此神變經與一切教而為根源且千流萬派起自崑崙積石之山十二分經出乎總持秘密之藏詳此序意而有二種一開漸本即此文是二攝末本如下序云此中具明三乘學處乃至當知無量事迹所有文言結會指歸無非秘密之藏又下疏云且以阿字或加下畫或安上點或置傍點則成四用何者如佛心是一約本不生理名阿(上)約本不生行名阿(長)約本不生菩提名暗約本不生涅槃名惡則成四義四相雖復不同而體未曾有異一切言教皆出於阿字譬如無熱惱池四河流出展轉無盡普遍大地又約字輪對如來方便智更有第五長噁字門此是開漸本然此五字即是真言名一切如來正等覺心能統收一切佛法無有遺餘今且約一途修行次第故作淺深差別說之而實五字各是一如來智各各統收一切佛法及無量言教盡入於阿之一字有若眾流入海同歸一味此是攝末本所謂無不從此法界流無不還歸此法界若爾何故判宗教處言開漸本辨所詮處言攝末本釋曰各據義別或互影顯故不相違。",
    "X23n0439_001:0531c24_0": "序　厥有中天竺者厥猶其也中天竺者西城之名或云印度印度有五此當中也三藏者謂此師解三藏法翻譯三藏全取他名有財建號言字輸波迦等者字即名字輸波迦羅善也僧訶無畏也此出經句至下當知。",
    "X23n0439_001:0532a05_0": "序　業該八藏等者業謂學業該謂該通八藏即經律論陀羅尼大小乘異藏有其八滯帶為名名冠五天者名謂聲名冠謂冠束謂我三藏業該八藏故得芳名冠束於五天竺國即是獨步於五天矣言傳授此經等者傳謂翻傳授謂付授囑授即翻譯付授此經也寔猶實也為作也宗主也匠即師匠蓋取巧義即作者也謂我三藏翻傳囑授此經實為宗主師匠而已如莊子送葬過惠子墓顧謂從者曰郢人堊(白土)漫其鼻端若蠅翼使匠石斵(削也)之(郢者古之善塗塈作泥者施廣領大袖以作塗而領袖不污小有飛泥悞著其鼻端因令匠石運斤而斵之)匠石運斧成風聽而斷之(瞋目恣手)盡堊而鼻不傷郢人立不失容耳若使拙而斷之非徒無効而已或更致其傍損今我三藏性愛恬簡靜慮澄神時開禪觀獎勸後學人或疑問剖析無滯(此出大錄)又於真言事業曲盡能事善得變通譬如規矩繩墨眾匠所同而運思精微獨得其妙由是玄宗詔譯此經可謂文質相半妙諧深趣若使暗於斯理膚受之輩而翻譯者或錯用梵言失於秘密圓頓之旨故云傳授此經等言頃有詔至扈從者頃者時也詔謂詔命迎謂迎接扈謂陪扈從謂隨從開元四年三藏至北印度境聲譽已達京師玄宗發使迎接於福先寺安置至開元十二年有詔并一行隨駕入洛故云頃有詔等。",
    "X23n0439_001:0532b03_0": "序　禪師一行等者禪師者即是禪宗之師匠也禪有南宗北宗未審是何宗之師謂即北宗之師也准禪門師資承襲圖所示第五祖弘忍大師門下有二弟子一是慧能即南宗也一是神秀即北宗也北宗弟子名曰普寂即疏主之師也圖云忍生十子能和尚直入其嫡於中秀弟子普寂化緣轉盛為二京法主三帝門師(今引此者要知疏主之所宗也)。",
    "X23n0439_001:0532b09_1": "一行者疏主之諱夫聖人作則必不徒然唯一為行故曰一行如大寶積經善住意天子復白文殊師利言大士所言禪行比丘何等是耶文殊師利言天子若彼比丘於一切法但取一行極相順者所謂無生是為禪行(云云)今之疏主取何一行是為禪行且以阿字而顯示之阿字者詮一切法本不生義即是無生故經云阿字門一切法本不生故釋曰以一切法無不從眾緣生從緣生者悉皆有始有本今觀此能生之緣亦復從眾緣生展轉從緣誰為其本如是觀察時則知本不生際是萬法之本如聞一切語言時即是聞阿字聲如是見一切法生即是見本不生際若見本不生際即是如實知自心若如實知自心即是一切智智故如來部唯用此阿字而為真言今疏主但取此一字而為其行即是一行三昧故曰一行命世之生也者謂應天命而生世也外典云一千年有聖人生五百年賢人出蓋與此經出與時運符會故曰命世而生也又開元中有道士刑和璞甞謂尹愔曰一行聖人乎漢之洛下閎造曆一千年後八百歲當差一日云則有聖人定之今期年畢矣而一行造大衍曆正其差失即洛下閎之言信矣非聖人而何斯亦足為良證也。",
    "X23n0439_001:0532c07_0": "序　明鑒縱達等者上句定也下句慧也上句者謂寂光鑒照無不恣修而通達也縱者出自論語大宰問於子貢曰夫子聖者歟何其多能也子貢曰固天縱之將聖又多能也比況可知下句者智謂智解周謂周悉變謂權巧通即曉暢謂我疏主不但明鑒縱達亦乃智解周悉至於世間權巧之事靡不曉暢如明皇雜錄云初沙門一行幼時家貧隣有王姥前後濟之約數十萬一行常思報之至開元中一行承玄宗敬遇言無不可未幾會王姥兒犯殺人獄未具姥詣一行求救一行曰姥要金帛當十倍酬之君上執法難以情求如何王姥戟手大罵曰何用識此僧一行從而謝之終不顧顧行心計渾天寺中工役數百乃命空其室內徙一大瓮於中央密選常住二奴授以布曩謂曰某方某角有廢園汝中潛伺從午至昏當有物入來其數七者可盡掩之失一則杖汝如言而往至酉後果有群豕至悉獲而歸一行大喜令寘瓮中覆以木蓋封以六一泥朱題梵字其徒莫測詰朝中使叩門急召至便殿玄宗迎問曰大史奏昨夜北斗不見是何祥也師有以攘之乎一行曰後魏時失熒惑至今帝車不見古所無者天將大驚於陛下也夫疋婦疋夫不得其所則隕霜亦旱威德所感乃能退舍感之切者其在葬枯出繫乎釋門以瞋心壞一切善慈心降一切魔如臣曲見莫若赦天下玄宗從之又其夕大史奏北斗一星見凡七日而復故云智周變通言今上屈之等者上即主上即玄宗皇帝屈謂抑請宴安也息也正取宴坐中掖內[這-言+(序-予+手)]也即玄宗抑請久常宴坐於內[這-言+(序-予+手)]也當睿宗即位勑東都留守韋安右以禮徵之一行固辭以疾不命應遂往荊州當陽山依沙門悟真以習梵律至開元五年玄宗令其族叔禮部朗中洽齎勑書就荊州強起之故曰今上屈之一行至京置於光大殿帝就之訪以安國撫民之道言皆切直元有所隱玄宗初見謂曰卿何能對曰唯善記覽帝因詔掖[這-言+(序-予+手)]取宮人籍以示之周覽既畢覆其本記念精熟如素所習讀數幅之後帝不覺降御榻為之作禮呼為聖人故曰久宴中掖序　聞三藏等者聞謂聽審三藏即譯主蘊者藏也法寶者持明教也囊者寶器思者思念起謂發起予者我也請者求也謂禪師審聞無畏三藏來從天竺蘊藏持明法寶在心器之中欲將此法流通震旦即自思念發起我教者唯一行乎欲令一行請求可與同共翻譯此經也起予之言蓋出論語子曰起予者商也(商者卜商姓卜名商字子夏)始可與言詩矣(包曰孔子言子夏能發明我意可共言詩矣)今三藏思念言一行能發明我意可共譯經矣言奉詔等者奉即稟奉詔謂詔命與者共也即是稟奉玄宗詔命共三藏翻譯出此神變經也仍為筆授者仍者復也筆謂筆削授謂付授錄中或用此受字即稟受也又錄云沙門一行筆受承旨兼刪綴詞理文質相半妙諧深趣故曰奉詔等言譯語比丘等者謂以梵本譯作唐言寶月者法師之諱也練諸教相者練謂練覈練覈諸教性之與相也善解方言者善能也此解字通上去二音解(上)謂解釋善能解釋華言符合梵語又解(去)謂達解善能達解東西兩方之言音故能譯語耳。",
    "X23n0439_001:0533b12_0": "序　非禪師不能等者非者不也禪師者謂能以諸禪那之要軌匠眾人故曰禪師扣繫也幽深也關鍵也謂此經乃秘藏圓宗深入實相若不是禪師明鑒縱達智周通變又復命世而生則不能扣擊其幽深關鍵言非三藏等者莫能者不可也敡謂宣敡至極也賾深也謂以此經理歸一字事入千歧秘中之秘密中之密不是三藏學該八藏名冠五天則不可宣敡其至極深賾者矣。",
    "X23n0439_001:0533b20_0": "序　此中具明等者此中者指此經中也具謂具足明謂顯明三乘者二乘及菩薩為三運載名乘學處者修學之所也謂此經中具足顯明二乘及菩薩乘修學之處故問此經既是秘密之藏不妄與人何故具明三乘學處菩薩則可若明二乘學處豈非妄授耶答此經不同常教上從諸佛菩薩下至世天龍鬼入此漫荼羅者無非大日如來之體如大悲胎藏漫荼羅第三院中皆是釋迦眷屬彼中說聲聞緣覺真言雖明諦緣之理然歸阿字門以入阿字門故一切眾生本來離一切因緣以知諸法常寂滅故化城亦滅如是無疑悔時是名決了聲聞法又能以吽字聲令一切普聞即是此中聲聞之義故云具明等及最上乘者及者兼也不但具明三乘修學之處兼亦明說無上一乘正所宗故又及者揀別揀別三乘外有最上持明法故故古人云三乘之外別有持明最上乘者謂於諸乘最為上故又或云金剛乘無上乘一乘故陀羅尼序云金剛一乘甚深微細持明等如上故云及最上等。",
    "X23n0439_001:0533c14_0": "序　欲令學者等者從欲令至無相已上顯終教之意從一一下彰圓宗之理知世間相性自無生故者相即事有為也性即理無為也自無生故者即表理體本不生故因寄有為廣示無相者即事不礙理一一推覈以盡法界之緣起者即無障礙法界大緣起也如下字輪品三十四字更互助成即為輪體若隨闕一字即不成故即是法界緣起隨闕一法緣不成故且如暗字為菩提果輪時即釰欠等餘字助成若以阿(平)字為行輪時即迦遮等餘字助成若隨闕一字皆不成故乃至阿字菩提心輪惡字涅槃輪等亦復如是如世間事輪籍轂輻輞等眾緣得成闕一不可然此緣起具總具別有同有異亦成亦壞即世親六相圓融之義具矣故云以盡法界之緣起爾。",
    "X23n0439_001:0534a03_0": "序　當知無量等者當知此中無量事相之迹收結通會指決所歸之趣無非此秘密之藏者歟又此指字應作此旨字旨謂宗旨歸謂歸趣意云若能一一推覈究盡法界緣起爾是故真言行者應當了知無量事相教迹所有文字語言總持收結通會宗旨歸趣無不是甚深秘密持明之藏者也。",
    "X23n0439_001:0534a09_0": "序　尚慮等者尚者加也轉訓為復慮謂憂慮持謂受持誦謂諷誦守者執也失謂亡失意謂意趣意云雖將無量事迹所有文字語言收結通會宗旨歸趣無非秘密之藏尚復憂慮受持諷誦之者但執守能詮之文言亡失所詮之意旨如下疏云且如東方寶幢佛乃是初發淨菩提心義豈得但作四方解耶以此例之諸餘法門皆可意領故云尚慮等。",
    "X23n0439_001:0534a16_0": "序　禪師又請等者尚慮持誦者守文失意又請三藏解釋禪師隨其解釋尋記錄之無有真言不窮其趣無有密法不盡其義又控舉淺略深秘兩釋融會眾多經中微妙言教皆同一味故下疏云如一切經中或說諸蘊和合我不可得或說諸法從緣生都無自性皆是漸次開實相門彼言諸法實相者即是此中心之實相心實相者即是菩提更無別理下文出所以但為薄福之人而能自信作佛者甚為難得故世尊且令淨諸垢障(不堪受是法隨宜方便說也)將護其心要待時義契合然後為說即心之印(正是其時也)又下歸宗今經則不如是直約諸法令識其心(即上引二乘真言是)所以此經名為秘密之藏也支分有疑等者謂疑護摩之法為是灌頂支分中攝為是引入弟子支分中收彼中疏釋然護摩法通一切法事中非但加持弟子而已故宜別作一種支分故別開出護摩支分今略示一隅餘文可悉。",
    "X23n0439_001:0534b08_0": "序　都釋門威儀等者威儀者釋門主者之稱如今都僧錄也即今道門猶存此職智嚴者師諱也按開元錄云沙門釋智嚴于闐國王之質子姓鬱持名樂(音洛)幼至大唐早居榮祿授左領軍衛大將軍上柱國封金滿郡公而立性淳質實信居懷請捨宅置寺神龍二年十一月二十四日墨制云人之情也莫不貪惜祿位卿之願也乃欲棄俗出家襲蘭若之蹤起禪那之行忽省來奏嗟賞兼懷特遂所祈或成高志以景龍元年十一月五日和帝生日捨家剃落法號智嚴仍請住終南山至相寺精苦居懷幽棲積念加以經明唐梵智照幽微寶積真詮如來秘偈莫不屢承綸旨久預翻譯頻奉絲言兼令證譯開元九年於石鼈練若及奉恩寺譯決定業障經等四部並文質相兼得其深趣具如錄中所載葢法師有此學業所以禪師見囑伏之。",
    "X23n0439_001:0534b23_0": "序　良時難會信矣者謂良時難會之歎今可信矣此出論語翔而後集曰山梁雌雉時哉時哉注云回翔審視而後下止謂回旋翔審察觀瞻然後下止即是翔止得所也意顯山梁雌雉得其時而人不得其時也按唐錄開元十五年安祿山背亂自范陽起兵直抵汴洛當時玄宗大駕幸蜀此時天子蒙塵萬姓豈得安處其時禪師造却此釋未遑宣演值此時亂辭師息化故有此歎矣。",
    "X23n0439_001:0534c07_0": "序　夫經中文有隱伏等者謂漫荼羅中聖賢之位以第三院說作第二其第二院却為第三其理難明故云隱伏又前入漫荼羅具緣真言品正明引入弟子灌頂即是預說下文世間成就品灌頂之事世間成就品所說即是顯明前品灌頂故云前後相明又談阿字本不生處顯其不變即理法界或說阿字能生諸字顯於隨緣成事法界故云事理互陳皆是如來善巧方便欲令行人從師稟授故曰夫經中等。",
    "X23n0439_001:0534c15_0": "序　溫古者師諱也師學該顯密職在翻譯准開元錄金剛智三藏於資聖寺譯瑜伽念誦法七俱胝等經四部法師筆授若非深達秘旨焉能措筆於是哉言甞接諸賢等者即序主陳製序之意也謂予已甞攀接諸多翻譯之英賢末後席肆預先聞此經是至極絕待不可比對秘妙之法門按開元錄沙門金剛智譯金剛頂瑜伽念誦法四卷七俱胝陀羅尼經時嵩岳沙門溫古筆授具如彼說序主宿登翻譯之場必是曾與諸賢商推斯經深秘之事故云甞接等言非敢窺測者陳謙敬也謂此絕待秘妙之法門理等天高言方海濬理等天高豈得以管見窺言方海濬焉能以蠡情測但專注一心歸依敬仰耳。",
    "X23n0439_001:0535a03_0": "序　輙以等者序主云我於如是絕待微妙之法門不敢窺測其高深但輙然以疎謬鄙拙之情思敘述乎根本枝末者焉。",
    "X23n0439_001:0535a07_0": "大毗盧遮那成佛神變加持經義釋演密鈔卷第一"
}