{
    "X28n0586_013:0380a18_0": "天台三大部補注卷第十三　　止觀　輔行永嘉沙門釋　從義　撰輔行云不同律文篇聚各有根本方便後起對心對境若罪若事若雙若單篇謂五篇聚即七聚一波羅夷二僧殘三波逸提四提舍尼五突吉羅此五篇也一波羅夷二僧殘三偷蘭遮四波逸提五提舍尼六突吉羅七惡說此七聚也南山問云五篇七聚何義開合又云六聚耶答言立五篇者僧祇律中當宗所明但云五種犯五種制五犯聚其六聚七聚即四分下文今且分七五不同具有三義則入五中一者名均二則體均三者究竟均不具此三通入聚攝而六七荖分者六中含吉羅以同體故七中離於惡說以過多故身名惡作口名惡說是故此聚分以為二此等名目欲申通者波羅夷者僧祇中說義當極惡此有三義一者退沒以犯此戒道果無分故二者不共住非但失於道果而已亦乃不入二種僧數三者墮落捨此身已墮落阿鼻大地獄故十誦中說墮不如意處四分中說如人斷頭不可復起若犯此戒不成比丘此從行法非用為名又波羅夷此云無餘蓋從眾法絕分為名僧殘者善見律云僧伽者僧也婆者初也謂僧前與覆藏羯磨也尸沙者殘也謂末後與出罪羯磨也若犯此法僧作法除從境為名故云僧殘也婆沙中云僧伽者僧也婆尸沙者殘也若犯此罪垢纏行人非全淨用有殘之罪由僧除滅也四分中明僧殘乃同上說又云有餘此以行法不絕為名也毗尼母云僧殘者如人為他所斫殘有咽喉故名殘也理須早救故戒律云若犯此罪應強與波利婆沙等由鄰重罪故也偷蘭遮名如前已釋波逸提者義翻為墮十誦律云墮在燒煑覆障地獄也四分十明僧有百二十種分取三十因財事生犯貪慢心強制捨入僧故名尼薩耆也尼薩耆者舊翻捨墮餘之九十單悔別人若論罪體同一品懺也波羅提提舍尼者義翻向彼悔從對治境以立名也僧祇中云此罪應發露也如此戒律中具有悔過之辭是也突吉羅者善見律云突者惡也吉羅者作也四分律本云式叉迦羅尼義翻應當學胡僧云守戒也此罪微細持之極難故隨學隨守以立名也分此一部以為二聚身名惡作口名惡說也其二不定戒託境以言通該六聚若論罪體生疑不信是突吉羅文中具云三罪二罪者略舉生疑之事矣七滅諍中罪亦通有但為競於四諍彼此未知故制七藥用以除殄文義既廣理相又深徒勞宣釋終未盡窮故略而不述也上來已解篇聚名義所言各有根本方便後起等者且淫波羅夷自有其四一遠方便二次方便三近方便第四身交名為根本婬罪既然殺盜大妄例之可見俱舍論中委明斯義十不善中最初殺業如屠羊者將行殺時先發殺心從牀而起執持價直趣賣羊鄽酬價捉取將還養飲送至屠坊手執刀杖若打若刺命未終時如是名為殺生加行準雜心論說名方便隨此表業彼正命終此剎那頃表無表業是為殺生根本業道此剎那後殺無表業隨轉不絕名為殺生後起故也若於後時剝截治洗若稱若賣或煑或食讚述其美表業剎那如是亦名殺生後起殺生既然盜婬妄等准斯可見又復應知十善業中受具戒時來入戒壇禮比丘眾至誠發語請親教師乃至一白二羯磨等此皆名為善業加行第三羯磨竟一剎那中表無表業是則名為根本業道從此以後至說四依及餘依前相續隨轉表無表業皆名後起其第二篇有三方便第三第四有一方便其第五篇但心起身口唯根本耳無方便也若動身口思亦有遠近方便故云若發心欲令身不齊整著三衣等此為方便具如律鈔此不煩錄也言對心者即能犯之心也言對境者乃所託之境也言若罪者即夷殘等罪也言若事者乃婬盜等事也由有犯戒等事即有犯戒等罪阿毘達磨說舉罪等及舉事等諒此名為若罪若事焉目連問經云犯眾學戒如四天王壽五百歲墮泥犁中於人間數九百千歲犯波羅提提舍尼戒於人間三億六十千歲墮泥犁中犯波夜提於人間二十四億四十千歲墮泥犁中犯偷蘭遮於人間五十億六十千歲墮泥犁中犯僧伽婆尸沙於人間二百三十億四十千歲墮泥犁中犯波羅夷於人間九百二十一億六十千歲墮泥犁中大乘梵網戒云犯波羅夷二劫三劫在地獄中言若雙者即止作二犯也言若單者即止作一犯也故下文云雙持雙犯等言四依者即依糞掃衣依乞食依樹下坐依腐爛藥依此四法乃成比丘等委在律文。",
    "X28n0586_013:0381b03_0": "乞浮囊",
    "X28n0586_013:0381b04_0": "或云傳聞西域渡海之人多作鳥翎毛袋或齎巨牛脬或海船有失用以吹氣浮身往往因之而濟岸矣又云浮囊有多般作今未詳悉五分律云自今聽諸比丘畜浮囊若羊皮若牛皮此為浮囊所出正教非傳聞也翎魯丁切箭羽也脬普交切。",
    "X28n0586_013:0381b09_0": "彼列五夷三蘭二提一吉",
    "X28n0586_013:0381b10_0": "彼經出世間戒品云若以心分別男女非男女是菩薩犯波羅夷若以心分別畜生餓鬼男女非男女諸天神男女非男女是菩薩犯波羅夷若以身口行不堪得三乘若受出世間菩薩戒而不起慈悲心是菩薩犯波羅夷若以身口行不堪得三乘若他物若小若大若長若短若有色若有形若住若動若覆藏若移處若有封印若盛貯若心起盜想犯波羅夷若以身口行不堪得三乘若起妄語心犯波羅夷若以身口行不堪得三乘若樹葉若皮若汁若以心欲取犯菩薩僧伽婆尸沙若以身口行不堪得三乘若起歌舞作樂華香瓔珞想是犯菩薩僧伽婆尸沙若以身口行不堪得三乘若起高廣大牀想是犯菩薩僧伽婆尸沙若以身口行不堪得三乘若起過中食想是犯菩薩僧伽婆尸沙若以身口行不堪得三乘若起提金銀珍寶想是犯菩薩僧伽婆尸沙若以身口行不堪得三乘若剃身毛若翦爪如初月形若起此想是菩薩犯偷蘭遮若以身口行不堪得三乘若起斬斫草木想是犯偷蘭遮若以身口行不堪得三乘若起毀他名譽若色若姓若財物若技術若車乘若身力等想是犯偷蘭遮若以身口行不堪得三乘若佛法僧物若華香塗香若衣服若珍寶若菩薩以脚踐蹋犯波夜提若佛塔若佛所行處及菩提樹轉法輪處若以脚踐蹋犯波夜提若不信者不堪得三乘若吐舌動眼毀諸威儀起此想者犯突吉羅若以身口行不堪得三乘若見他物他藥種種服玩詐現求利及說人罪過若起此想犯波羅提舍若以身口行不堪得三乘已上經文若爾記中文須脫落應云五夷五僧殘三蘭并二提一吉一提舍彼經又云佛告文殊戒有二種所謂身口非心意識戒若心意識是戒則無持戒人何以故心攀緣難制故無住處故是故文殊無心意識戒唯身口有戒心意識非殺罪處故又菩薩地持論云四波羅夷一者為貪利故自讚毀他二者自慳不施慳法不說三者嗔恚惡言杖石殘害求悔不受四者謗菩薩藏說相似法又云菩薩遮處則遮開處則開又寶積經云聲聞乘人乃至不應起於一念更受後身是名聲聞持戒於菩薩名大破戒菩薩於無量劫堪忍受身不生厭惡是名菩薩持戒於聲聞名大破戒以是義故為諸菩薩說開遮戒為聲聞人說遮戒云何名為菩薩開遮戒若諸菩薩於大乘中發趣修行日初分時有所犯戒於日中分不離一切智心如是菩薩戒身不壞乃至云以是義故菩薩乘人持開遮戒設有所犯不應失念妄生憂悔自惱其心於聲聞乘有所犯者便為破壞聲聞淨戒何以故聲聞持戒斷除煩惱但求涅槃以是義故名聲聞乘唯持遮戒。",
    "X28n0586_013:0382a09_0": "置果存因下文又云若分因果以對罪名因蘭果蘭如前所注若為重罪之方便名為因蘭獨頭正罪名為果蘭也。",
    "X28n0586_013:0382a12_0": "僧中行白名為下意別住名擯乃至奪其三十五事及本日等名為治擯僧中行白者南山鈔云白清淨比丘法應具修威儀白云大德僧聽我某甲比丘犯故漏失一僧殘罪不憶數覆藏一夜乃至百夜已從僧乞百夜覆藏羯磨僧已與我百夜覆藏羯磨我某甲比丘已行若干日餘有若干日未行白大德知我行覆藏若五人十人總集一處行者應總白云諸大德聽餘辭同向若不盡集亦無別眾此是別人發露法也若有大德勝人來寺者應須安置房中白之不須門首成輕脫故也名為下意者善見律云行摩那埵摩那埵者此云折伏貢高亦名下意言下意者承事眾僧也僧祇亦云析伏下意也別住名擯者南山鈔云懺僧殘法對治有四一治覆藏情過謂波利婆沙波利婆沙此云覆藏亦云別住毗尼母論問云何名別住謂別住一房不得與僧同處故也雖入僧中不得談論亦不得答也二治覆藏罪謂突吉羅如後正懺懺法在前後與別住覆藏法也三治僧殘情過謂摩那埵摩那埵者此云意喜前雖自意歡喜亦生慚愧亦使眾僧歡喜由前喜故與其少日因少日故始得喜名眾僧歎言此人因此改悔更不起煩惱成清淨人是故喜耳四治僧殘罪謂阿浮訶那阿浮訶那此云喚入眾羯磨又云拔除罪根毗尼母云清淨戒生得淨解脫善持起去故也南山戒疏云所以列二十僧中出罪者以二篇罪次死業障重深故須多人強境方發犯者勝心息斷相續故也又業疏云方隅僧少故用五人也中國僧多故倍五為十也二篇鄰重犯悔情浮故倍中受為二十人也今文從略是故但云乃至者也其間治法辭句諸部律文并四分鈔中具辨今不煩錄也奪三十五事者鈔云三十五事七種不同成三十五也初五事者奪其眷屬也一不應授人大戒二不應受人依止三不應畜沙彌四不應受僧差教授比丘尼五若僧差不應往也第二五事者奪其智能也一不應說戒二若僧中問答毗尼義不應答三若僧差作羯磨不應作四若僧中簡集智慧者共評論眾事不得在其例五若僧差作信命不應作第三五事者奪其順從也一不得早入聚落二不得逼暮還三親近比丘四不應近白衣外道五應順從諸比丘教不得作異語第四五事者奪其相續後犯也一不應犯此罪餘亦不應犯謂為殘作訶責指下篇為餘二若相似若從此生相似謂同一篇罪從生者謂為摩觸訶責而與女人屏坐三若復重於此謂犯提被治後更犯殘等四不應嫌羯磨五不應訶羯磨人第五五事者奪其供給也一若善比丘為敷坐具供養不應受二不應受他洗足三不應受他安洗足物四不應受他拭革屣五不應受他揩摩身第六五事者奪其恭敬也謂不應受善比丘禮拜問訊合掌迎逆持衣鉢等第七五事者奪其證正他事也一不應舉善比丘為作億念作自言二不應證他事三不應遮布薩四不應遮自恣五不應共善比丘諍是為三十五事也本日治者治字進平去二呼鈔云此上二行中若覆與前法不覆與後法同俱出罪若二法中重有犯者各壞二法皆悉重與本日治之如行百夜別住今已滿五十夜若更重犯同類罪者前五十夜俱失當再行百夜故名本日治也百夜既爾六夜中犯亦乃如然以違僧命故前法壞也十誦律云迦留陀夷犯故出精僧伽婆尸沙罪不覆藏行六夜摩那埵時已過爾許日爾許日未過是中又故出精更犯一僧伽婆尸沙罪不覆藏迦留陀夷語諸比丘諸比丘白佛佛言與本日治之其本日治作法章句具如律文問何故本日治答為析伏心故又問何故本日治為伏心耶答若還從本日行是事令心析伏諸比丘作是念此人結使厚重以本日治令慚愧更不復作時諸比丘發心欲與摩那埵是故名為本日治也。",
    "X28n0586_013:0383a08_0": "起見即破正見應引大經十二等文無者略準下諸見境中云破正見威儀引六師云若有慚愧則墮地獄若無慚愧不墮地獄此即大經第十七卷六師為於阿闍世王說法故也又三十二卷明斷善根者遠離善友不聽正法不善思惟不如法住謂無施者受者無因無果無善無惡無父無母無聖人無聖法無涅槃等今云十二者恐誤也又大經三十五明六十二見當知起六十二見即破正見也又大論云須菩提為來世求三乘人聞佛說空無所有性以罪重智鈍故取空相便言誰垢誰淨凡夫惡人何以名垢出家善人何以名淨是人不解佛語深義以何事而說著是空故言何用持戒等為以是因緣即生邪見破正見破正見故以少因緣而破戒及威儀無所畏忌出家人仰資白衣便妄語求利衣食等破於正命等種是罪故墮三惡道然今記中既乃謂之犯前三聚名破戒犯下四聚名破威儀四邪五邪名破正命此則全是大論之意以論具明破戒破威儀破正命故也又下文云既以惡空下例前貪攀等者恐誤應云例前愛心破律儀戒也又云堅執見下例前貪五欲故等者亦恐誤應云例前深著生死為有造業等破於理戒也。",
    "X28n0586_013:0383b06_0": "並屬梵音",
    "X28n0586_013:0383b07_0": "梵音呼召此土故也此方翻彼之言為文物國亦云邊鄙土是則一美一貶致有兩殊焉具如玄籤補注中辨。",
    "X28n0586_013:0383b10_0": "南山亦立三種懺",
    "X28n0586_013:0383b11_0": "文在四分律行事鈔中今荊谿斥之者一斥小無懺重二斥判位太高然南山立三種懺者即理懺耳非事懺也若准妙玄云小乘戒藏不許懺重修多羅藏使犯重人念佛身佛身者念空也若爾小乘戒藏雖無理懺懺重之說而經藏中乃有理懺懺重故也今荊谿云小無懺重者且約戒藏不立理懺以斥之耳若約經藏理懺而斥者恐不然也若不爾者如何消於妙玄之文耶問小乘若爾與大乘何異耶答大乘戒藏如梵網中夷愆許懺許增益受故與小乘戒藏發露名為學悔不可同年矣又大乘經藏如方等經等明事懺則夷罪皆除復本清淨還為大僧而小乘經藏雖明觀理懺重而無作法事懺滅夷所以前文第三記云小乘教門尚不開懺等皆是約於戒藏及經藏中不立作法事懺滅愆耳然光明文句并禪波羅蜜明三種懺通大小乘而小乘經如阿含中令犯欲人作蛇口想此想若成淫罪即滅以取相懺亦名事懺故也若無生懺方名理懺耳然禪波羅蜜又云律中未明懺四重法而初教經乃明悔於四重彼經云請三十清淨比丘於大眾中犯罪比丘當自發露僧為作羯磨又於三寶前作諸行法及誦戒千遍即得清淨當知小乘戒藏雖未明作法懺滅夷罪而經藏中亦有也若爾小乘戒藏並未明於事理二懺滅四夷罪而經藏中咸皆有也若準南山律鈔乃揀初教經是偽而天台則不云偽也今在止觀中云若犯事中輕過律文皆有懺法懺法若成悉名清淨戒淨障轉止觀易明者此明依律懺輕令戒淨障轉止觀成就革凡為聖也不引律文約事懺重者以發露與學雖亦清淨不障僧事然而此生不得超生死登聖果故不約之明止觀成就也而光明文句具明律中作法懺於五篇悉皆清淨者自依律文明懺重夷不障僧事名為清淨不是約於修定發慧革凡成聖也止觀又云若犯重者佛法死人小乘無懺法若依大乘許其懺悔者此明依大懺夷令止觀明了也小乘無懺法者小乘戒藏律文無約理懺重也非謂小乘律藏無約事懺夷也然小乘戒藏雖無約理懺重而修多羅藏令犯重者觀空念佛法身即是無生理懺矣具如妙玄及光明文句幸希後德宜熟許之。",
    "X28n0586_013:0384a02_0": "間關",
    "X28n0586_013:0384a03_0": "出入也亦設置之皃也又崎嶇辛苦得達之皃也。",
    "X28n0586_013:0384a04_0": "抵債",
    "X28n0586_013:0384a05_0": "西京揩師云以無漏力強非三塗之債故云抵債也。",
    "X28n0586_013:0384a07_0": "如小乘中僧別兩懺乃至如滅夷過小教權文等僧者眾也即四人已上矣別即三人已還也眾懺如二十僧中行摩那埵及羯磨等別懺如懺波逸提及吉羅等亦云眾別兩行故云僧別兩懺也如滅夷過者小乘發露求滅夷過但得名為學悔者也在大僧之下居沙彌之上治禪病經云犯重比丘懺者脫僧伽利著安陀會生心慚愧供僧苦役掃廁擔糞等行比懺法須者如彼律中應教乞言大德僧聽我某甲比丘犯婬波羅夷無覆藏今從僧乞波羅夷戒願僧與我波羅夷戒慈愍故三乞已僧索欲問和答云與波羅夷戒羯磨應言大德僧聽此某甲比丘犯婬波羅夷無覆藏今從僧乞波羅夷戒若僧時到僧忍聽僧今與某甲比丘波羅夷戒白如是大德僧聽此某甲比丘犯婬波羅夷無覆藏今從僧乞波羅夷戒僧今與某甲比丘波羅夷戒誰諸長老忍僧與某甲比丘波羅夷戒者默然誰不忍者說是初羯磨第二第三亦如是說僧已忍與某甲比丘波羅夷戒竟僧忍默然故是事如是持毗尼母云與白四悔法已名清淨持戒但此一身不得超生離死然障不入地獄也與波羅夷戒已當行隨順法奪三十五事等唯加不得眾中誦律無能誦者聽與波羅夷戒已說戒及羯磨時來與不來隨意第三記云小乘教門尚不開懺雖曰還生無任僧用小無懺重之說仍成重罪未亡問治禪病經既云懺重荊谿那云無懺重也答無懺重者小乘犯重名為斷頭不許懺悔還為比丘此生不能革凡成聖耳非謂不許發露乞戒名學悔也故云雖曰還生無任僧用矣故知發露乞戒名為學悔亦名懺悔與夫小乘無懺重說區以別矣問發露學悔重罪滅耶不滅耶答此生不得超凡入聖仍成重罪未亡然而不入地獄復是夷愆不存既非了義上乘難可推其究竟大寶積經云菩薩犯波羅夷應對清淨十比丘前以質直心殷重懺悔犯僧殘者對五比丘懺悔若為女人染心所觸及因相顧而生愛著對一二比丘懺若作五無間犯波羅夷僧殘犯塔犯僧及犯餘罪菩薩當於三十五佛前晝夜獨處懺悔此上引文應知大小懺法各別然今止觀盛談持犯亦須略知持犯之名故南山云言止持者方便正念護本所受禁防身口不造諸惡目之曰止止而無違戒體光潔順本所受稱之曰持言作持者惡既離己事須修善必須策勤三業修習戒行者善起護名之為作持義如前言作犯者出家五眾內具三毒我倒在懷皷動身口違理造境名之為作作而有違行本所受名之為犯言止犯者癡心怠慢行違本受於諸勝業厭不修學故名為止止而有違反彼受願故名為犯具如律鈔以明斯義又下文云尸羅清淨三昧現前者若準禪波羅蜜乃作四句分別一者犯戒發定持戒不發定過去善根深厚今生雖有犯戒而藉現修之緣所以能發也若過去不種禪定之因今生雖則持戒所以不發也二者破戒不發定持戒能發定三者持犯俱發定四者持犯俱不發定准例思之可以意得。",
    "X28n0586_013:0384c12_0": "黈",
    "X28n0586_013:0384c13_0": "天口切通出之謂也。",
    "X28n0586_013:0384c14_0": "瘉",
    "X28n0586_013:0384c15_0": "經中只言如人病瘡為蘇麨塗以衣褁之為愈瘡故以藥坌之觀身是瘡故以衣覆為九孔漏求索飲食今文瘉字與愈同音說文云病瘳也。",
    "X28n0586_013:0384c18_0": "復有天須菩提面王比丘及許畜重物",
    "X28n0586_013:0384c19_0": "增一阿含云喜著好衣行本清淨所謂天須菩提著弊惡衣無有羞耻所謂面王比丘婆沙論云罳王比丘分別功德論云五百弟子中有兩須菩提一是王者之種一是長戒之種其天須菩提是王者之種所言天者以其五百世中常生天上化應聲聞下生王宮食福自然未曾匱乏佛還本國勅令出家約身守節麤衣惡食草蓐為牀大小便為藥時天須菩提聞佛切教欲退還家于時佛受波斯匿王請其乃詣佛辭退而還阿難語云君且住一宿天須菩提云道人屋舍如何可止且至白衣家寄止一宿明當還歸阿難告云但住今當嚴辨即往王所種種坐具旛華香油嚴飾皆備天須菩提於中止宿以適本心意便得定思惟四諦至于後夜即得羅漢阿難白佛天須菩提已得羅漢飛在虗空佛語阿難夫衣有二種可親不可親若著好衣益其道心此可親近若損道心此不可親近夫時解脫羅漢有六一得好衣二得好食三得好臥具四得好處五得好說法人六得好同學待此六者名時解脫羅漢天須菩提斯其人也薩婆多云此人從第六天上來生人間隨其本習而度脫之面王比丘本是釋種初生之時有異神德母始懷妊乃召梵志占相吉凶梵志策曰此兒頭上有天冠相其母聞之喜而不樂曰夫天冠者王者之相也一國之中豈可有於兩王者乎恐國得知生于害惱是以不樂又復思惟此子若實有王者相自然當有神而護之何憂不濟所以心喜日月既滿產一男兒頭上果有天冠影相復請梵志為其立字梵志再曰頭上既有天冠王者之相復不可離此相別立其名也遂乃字為面王者矣後即出家成於道果著弊惡衣無有羞耻面王比丘斯為第一賢愚經云曾以氎施辟支佛故五百生中白氎裹身而生身大隨大面有王字恐被王損乃投出家云云及許畜重物者涅槃經云我滅度後護持正法諸菩薩等以方便力與彼破戒假名受畜一切不淨物僧同其事業爾時菩薩見犯戒者即往其所恭敬禮拜四事供養為是事故應畜八種不淨之物何以故是人為治惡比丘故又云若諸弟子無有檀越供給所須時世饑饉飲食難得為欲建立護持正法我聽弟子受畜奴婢金銀車乘田宅穀米賣易所須雖聽受畜如是等物要當淨施篤信檀越南山云錢物若擬淨施與他依律文開涅槃又云迦葉白佛菩薩未住不動地時頗有因緣得破戒不佛言菩薩未住不動地時有因緣故可得破戒迦葉白言何者是耶佛告迦葉若有菩薩知以破戒因緣則能令人受持愛樂大乘經典又能令其讀誦通利書寫經卷廣為人說不退菩提為如是故得破淨戒菩薩爾時應作是念我寧一劫若減一劫墮阿鼻獄要令是人不退菩提文殊白佛若有菩薩攝取護持如是之人不退菩提若墮地獄無有是處佛讚文殊善哉善哉如汝所說涅槃又云純陀白佛所言破戒其義云何佛告純陀若犯四禁及五逆罪誹謗正法如是人等名為破戒純陀又問如是破戒可拔濟不佛告純陀有因緣故則可拔濟若被法服而未捨遠其心常懷恐怖慚愧而自考責咄哉何為犯斯重罪深自改悔生護法心欲建正法有護法者我當供養乃至云我說是人不名破戒因便須知所以引也。",
    "X28n0586_013:0385c04_0": "十二頭陀",
    "X28n0586_013:0385c05_0": "南山律鈔中准解脫道論有十三頭陀衣二食五處五第十三者乃是常坐斯蓋勇猛之分故也又下文云乞食如第二方等中說者誤也應云如第二般舟中說也又云狼狽者注後漢書云狼狽者顛沛也顛沛者偃仆也偃仰倒也仆前倒也又文選注云狼跋者狼狽也忘其看視失其去就之皃也又寧僧錄撰南山律鈔音義指歸云狼性躁步速故云狼[跳-兆+貝][跳-兆+貝]步也[跳-兆+貝]補盖切狼猶兢[跳-兆+貝]也狽獸足前後長短為狽也取其揮霍之義也。",
    "X28n0586_013:0385c14_0": "大聖一許三品通開若畜百一記憶而已有云加法若畜長說淨則加法受持令二品合論故云百一要當說淨三品即但三衣為上品畜百一物為中品畜長為下品此依律說與今小異以今止觀雪山大士為上品故今三品通開者以畜百一及以畜長必有三衣後必有前故云三品通開也二品合論者即以畜百一中品畜長下品合而言之但在下根故止觀云百一助身要當說淨此即二品合論故也故知若畜百一之物但自記憶一種便得或不記憶則應加法故云若畜百一記憶而已有云加法則加法受持也若畜長物則須說淨故云若畜長說淨等也南山云百一供身令受持之長物及餘令說淨畜薩婆多云百一之物各得畜一百一之外皆是長物若似寶入百一物數不須說淨餘者一切器與非器一外皆應作淨僧祇云我弟子著三衣足遮寒苦若性不忍寒者弊故衣隨意重著無妨薩婆多問曰此淨施法真耶假耶答一切九十六種外道無淨施法佛大慈悲方便力故教令淨施是方便施非真施也令諸弟子得畜長財而不犯戒又問佛何不直令畜長財而強與結戒又設此方便施耶答佛法以少欲為本是故結戒制令不畜而眾生根性不同悟入各異如昔一時開七寶房舍比丘入中便證聖道又問何故十日耶答佛知法相不緩不急正開十日應具滅儀至大德所前告本意彼許可已然後說言大德一心念我比丘某甲今請大德為衣藥鉢展轉施主願大德為我作衣藥鉢展轉淨施主慈愍故應三請至一比丘所具儀手提衣口云大德一心念此是某甲長衣未作淨為淨故施與大德為展轉淨故彼受請者言大德一心念汝有此長衣未作淨為淨故與我我今受之當語言汝施與誰答云施與某甲即淨施主名字也大德一心念汝有是長衣未作淨為淨故施與我我今受之汝與某甲是衣某甲已有汝為某甲故善護持著用隨因緣若藥鉢並準此涅槃經云雖聽受畜要須淨施篤信檀越檀越此云施主也。",
    "X28n0586_013:0386b03_0": "安陀會鬱多羅僧僧伽梨",
    "X28n0586_013:0386b04_0": "南山云而此三衣諸部無正翻今以義譯慧上菩薩經云五條名中著衣七條名上衣大衣名眾集時衣義翻多種大衣云雜碎衣以條數多故若乃從用名入王宮聚落衣七條名中價衣若乃從用名入眾衣五條名下衣若乃從用名院內道行雜作衣若就條數便云十九十七乃至七條五條律中無五七九名但云安陀會等世人名之七九條耳此亦具在律鈔中示。",
    "X28n0586_013:0386b12_0": "受食受藥禁性重之由持鉢持衣杜譏嫌之本通而言之藥即是食故南山云報命支持勿過於藥藥名乃通要分為四一者時藥從旦至中聖教聽服事順法應不生罪累二非時藥諸雜漿等對病而設時外開服限分無違三七日藥約能就法盡其分齊從以日限用療深益四盡壽藥勢力既微故聽久服方能除患形有三種一盡藥形二盡病形三盡報形今從別說故云受食受藥也受食即初時藥受藥即餘之三藥也時藥受法如九十戒中第三十九不受食戒南山廣約十門分之一制意二能受人三所受境四所受食五受食處六受食法七須食觀八食食法九失受法十對文解初制意者佛未制前比丘各不受食白衣呵言我不喜見著壞色衣人不受食食是為不與取也多論有五義一為斷盜竊因緣故二為作證明故三為止誹謗故四為成少欲知足故五為生物信故餘之九門今且略示第六受食法一器食相對明了論云至邊有三種一至身邊謂以物置比丘手中二至物邊謂俗人擔物令比丘自取手至物邊三至器邊以器貯物授與比丘但捉器受並得二身心相對三單心無對受並如鈔中二非時藥三七日藥四盡壽藥各有受法具如律鈔四藥受淨篇中受食受藥既為斷於盜竊因緣故名禁性重之由也故釋籤云受食受藥詎思益方涅槃疏云手自作食不受而啖既汙道儀乃名不淨三衣一鉢并尼師壇並須加法行護受持故云持鉢持衣杜譏嫌之本也加法受持具如律鈔又釋籤云安疑衣鉢即此意也。",
    "X28n0586_013:0386c16_0": "譏嫌性重",
    "X28n0586_013:0386c17_0": "涅槃經說戒有二種一性重戒二息世譏嫌戒性重戒者謂四重禁也息世譏嫌戒者不作販賣輕秤小斗不欺於他不畜七寶種植家業田宅男女具如經說乃至文云菩薩持於性重戒與息世譏嫌戒等無差別南山戒疏云如初婬殺名性重也下篇所制名性輕也如十不善體是違理無論大聖制與不制若作違行感得苦果是以如來制戒防之禁性惡故名為性戒如伐草木墾土掘地威儀麤醜不光俗信聖未制前作之無罪自制已後塵染更深妨亂修道招世譏謗故名遮也。",
    "X28n0586_013:0387a03_0": "撅",
    "X28n0586_013:0387a04_0": "其月切。",
    "X28n0586_013:0387a05_0": "舂",
    "X28n0586_013:0387a06_0": "書容切。",
    "X28n0586_013:0387a07_0": "礱",
    "X28n0586_013:0387a08_0": "力公切。",
    "X28n0586_013:0387a09_0": "碓",
    "X28n0586_013:0387a10_0": "丁潰切。",
    "X28n0586_013:0387a11_0": "磑",
    "X28n0586_013:0387a12_0": "午對切。",
    "X28n0586_013:0387a13_0": "畜八不淨",
    "X28n0586_013:0387a14_0": "南山云一田宅園林二種植生種三貯積穀帛四畜養人僕五養繫禽獸六錢寶貴物七氈褥釜鑊八象金飾牀并諸重物此之八名經律論中但信通數顯過不應相承次比如上具述不出經論下去或談八種不淨準斯而解更不引也。",
    "X28n0586_013:0387a19_0": "及以三行",
    "X28n0586_013:0387a20_0": "或云無貪瞋癡三行甞讀大乘經律論文菩薩地持經云當知三種行謂身口意行上妙無染般若經云若諸菩薩未發無上正等覺心先應積集無量無數善根資粮多供養佛多事善友於多佛所請問法要發弘誓願意樂具足或指此是大乘三多之行有人云戒定慧三名為三行資生無畏法三是名三行婆沙論說善根有三一福分善根二解脫分善根三達分善根聲聞三生支佛百劫修種此三妙經中說若人有福曾供養佛志求勝法此乃恐是三多之義因而示之後人更宜徧尋諸說三行即是大經所說聖梵天等三種行也不取病兒兩行者以此兩行乃是化他今明自行故不取也。",
    "X28n0586_013:0387b09_0": "論文更有五十法",
    "X28n0586_013:0387b10_0": "論中亦不的標五十法名其間諸法略如記引然彼論中明其能生般舟三昧修餘助法有五十種一緣佛恩常令在前乃至第五十教化眾生安住功德。",
    "X28n0586_013:0387b14_0": "指事象形形聲等",
    "X28n0586_013:0387b15_0": "指事者如上下字是也象形者象物之形如日月字是也象今文誤作像形聲者取譬相成如江河字是也會意者比類為字如止戈為武字人言為信字是也轉注者如左右字左字轉為考字右字轉為老字是也假借者本無其字依聲託事如令長之字是也大篆小篆刻蟲書摹印署書殳書隸書此謂六書八體也。",
    "X28n0586_013:0387b22_0": "莊以燕支離肩高於頂頤隱於臍五管在上等莊子內篇人間世篇第四云支離疏者頤隱於臍肩高於頂會撮指天五管在上兩髀為脇挫鐵治繲足以餬口皷筴播精以食十人上徵武士則支離攘臂於其間上有大役則支離以有常疾不受功上與病者粟則受三鍾與十束薪夫支離其形者猶足以養身終其天年又況支離其德者乎注疏云支離疏者四支離析百體寬疏遂使頰頥隱在臍間肩膊高於頂上形容如此故以支離而為名也會古外切撮子外切高竪之皃亦云髻也古者髻在頂中脊曲頭低故髻指天也管膾也五臟之腧皆在上也腧式注切兩脚髀股攣縮而迫近於脇也挫子臥切鍼執金切縫衣也繲佳買切浣衣也餬音胡餬食也養食其口也筴初革切小箕也精米也食音嗣攘如羊切四斗曰鍾夫支離其形猶忘形也支離其德猶忘德也夫支離殘病適是忘形既非聖人故未能忘德夫忘德者智周萬物而反智於愚明並三光而歸明於昧故能成功不居為而不特推功名於群有與物冥而無迹斯所謂忘德者也。",
    "X28n0586_013:0387c18_0": "有力者負而趨之等",
    "X28n0586_013:0387c19_0": "莊子內篇大宗師篇第六云夫藏舟於壑藏山於澤謂之固矣然而夜半有力者負之而走昧者不知也注云方言死生變化之不可逃故先舉固逃之極然後明之以必變之符將任化而無係也夫無力之力莫大於變化者也故乃揭天地以趨新負山岳以舍故不暫停忽已涉新則天地萬物無時而不移也世皆新矣而自以為故舟日易矣而視之若舊山日更矣而視之若前故向者之我非復今我也我與今俱往豈常守故哉而世之不覺橫謂今之所遇可係而在豈不昧哉疏云夜半闇冥以譬真理幽邃也有力者造化也夫藏舟船於海壑正合其冥隱山岳於澤中謂之得所然而造化之力擔負而趨變故日新驟如逝水九惑之徒心靈愚昧真謂山舟牢固不動巋然豈知冥中質遷無時暫息昨我今我其義亦然也此注疏云真理幽邃學佛之人應辨邪正勿為言語之所惑焉若以莊老之說比齊吾教乍可以微塵等同須彌矣。",
    "X28n0586_013:0388a13_0": "僧鏡錄",
    "X28n0586_013:0388a14_0": "即自鏡錄如前所辨。",
    "X28n0586_013:0388a15_0": "報身功德為瓔珞丈六相好為垢衣等",
    "X28n0586_013:0388a16_0": "請詳此文故知衣瓔丈六尊特勝劣二用但約相好多少分之不從教部真中而辨是以止觀同行知識脫瓔著弊和光利物輔行乃云始終共同利豈過此是則始從鹿苑終至法華莫不皆是脫瓔著弊和光同行故法華文句約如來衣釋誡妙音云師既施權弟子亦隱其實文句記云佛及弟子身俱劣者俱隱寂忍而耐其拙法華既爾二蘇可知始終既同中間豈異而輔行云引出宅已示尊特身彈斥洮汰得授記者此約三蘇法華別序從劣現勝表影而說別序現相表彰雖爾正宗攝相丈六宛然是故法華三周開權乃住生身而顯真實以至涅槃八十年佛談常辨性若今若昔同體異體准而思之又如下文棄蓋中云若為上地人說應作法性佛現法性國為法性菩薩說之何意與諸菩薩現此三界示於凡身耶只為度此凡俗故論此妙法耳若言不爾為誰施權權何所引由是而知始終同行隱勝現劣厥意愈明矣諸文大旨一以貫之。",
    "X28n0586_013:0388b10_0": "菩提流支以諸知識對位",
    "X28n0586_013:0388b11_0": "清涼觀師亦准斯說故彼疏云文殊一人寄十信位信未成位故但一人餘四十寄十住等位然各有十謂從德雲終至慈行寄十住位又從善見以至徧行寄十行位又從鬻香以至安住寄十向位又從婆珊以至瞿波寄十地位若其然者亦應以此三千大千等知識以難清涼如何用對位次耶清涼又解諸知識我唯知此一法門未能知彼菩薩行等謂是謙己推勝若其然者普賢彌勒何以不謙己推勝耶清涼又解善財行布次第謂是圓融之行布若其然者圓融行布一耶異耶一則圓融之外更無行布異則那謂圓融之行布耶既乃圓融又何行布耶夫言圓融融於何法而更行布耶若乃行布豈成圓融耶當知清涼所說全與天台教旨相違清涼又云天台宗判華嚴兼別圓融行布各得一邊是則失於華嚴之意余謂天台判教其義非失汝自不解推過與他豈不聞乎靈山親承大蘇妙悟耶那忽背宗而師賢首哉華嚴歷別及以圓融經文顯然清涼不達妄謂頓頓一槩圓融法華開顯微妙一乘清涼不曉謬言漸頓劣於華嚴嗚呼哀哉若謂天台判教有失而汝何故承用天台三觀法門解行異戶教觀殊塗又復若謂文雖行布須謂圓融不可執文者是則判釋佛教一槩圓融大小不分權實不辨何以故以不依文而判教故又下文云繫者絆也者今止觀中乃作縶字耳相縶也連也孟子云心中正則眸子明者孟子云存乎人者莫良於眸子眸子不能奄其惡胷中正則眸子瞭焉胷中不正則眸子眊焉聽其言也觀其眸子人焉廋哉瞭盧鳥切目睛明也眊莫報切目少睛也。",
    "X28n0586_013:0388c16_0": "止觀云赫赫宗周褒姒烕之",
    "X28n0586_013:0388c17_0": "此文出毛詩小雅正月大夫刺幽王之詩也毛公傳云烕滅也褒國也姒姓也烕呼穴切亦許悅切。",
    "X28n0586_013:0388c19_0": "輔行云龍亡而漦等",
    "X28n0586_013:0388c20_0": "漦俟留切涎沫也涎夕連切口液也漦龍所以沫沫龍之精氣也幽王末年發之者此文誤也應云厲王之末年也倮而嘇之者史記云厲王使婦人裸而譟之也裸音貫祭名也灌祭也裸鬯告神也譟亦作譟蘇到切群呼煩擾也讙呼也今文倮嘇兩字恐誤也未齓者史記云既齓也齓毀齒也初覲切男八月生八歲齓女七月生七歲齓笄古奚切女年十五而笄也烽亦作熢夜火名烽晝火名燧上臺上作桔臯臯頭有籠以薪草置中有寇至即然火以相告曰烽望其煙曰燧也賂力故切遺賂也菹側魚切酢菜也又止觀云坐之者坐字去聲呼之。",
    "X28n0586_013:0389a08_0": "止觀云氛氳郁毓",
    "X28n0586_013:0389a09_0": "氛符分切氳於云切毓余六切。",
    "X28n0586_013:0389a10_0": "膄",
    "X28n0586_013:0389a11_0": "羊朱切。",
    "X28n0586_013:0389a12_0": "甜",
    "X28n0586_013:0389a13_0": "徒兼切。",
    "X28n0586_013:0389a14_0": "酸",
    "X28n0586_013:0389a15_0": "素官切。",
    "X28n0586_013:0389a16_0": "辣",
    "X28n0586_013:0389a17_0": "盧達切。",
    "X28n0586_013:0389a18_0": "憋",
    "X28n0586_013:0389a19_0": "裨列匹列二切瞋也急性也。",
    "X28n0586_013:0389a20_0": "上代名僧",
    "X28n0586_013:0389a21_0": "此依舊說乃曰名梁朝嘉祥寺皎師集傳則曰高僧開元錄云唱師所撰曰名僧傳頗多浮穴皎師所以改舊名僧為高僧者良以寡德適時名而不高實行潛光高而不名是故改舊所稱旨在斯矣。",
    "X28n0586_013:0389b01_0": "輔行云困惾中顙",
    "X28n0586_013:0389b02_0": "困惾中顙文出莊子外篇天地篇第十二彼云夫失性有五一曰五色亂目使目不明二曰五聲亂耳使耳不聰三曰五臭薰鼻困惾中顙四曰五味噣口使口厲爽五曰趣舍滑心使性飛揚此五者皆生之害也惾子公切塞而不通也又音俊又蘇奏切中丁仲切傷也顙蘇朗切頟也五臭謂羶薰香醒腐也言鼻耽五臭故壅塞不通而中傷顙頟也臭如周易云其臭如蘭也噣正作濁濁者穢也五味謂酸辛甘苦醎也厲者病也爽者失也五味穢濁於口故使厲爽也即醎苦成病舌失其味也滑心滑亦古忽切亂也今文作俊字七全切噣字竹救切未知何出也又下文懵憒者上莫孔切下公對切又云九結者婆沙云愛恚慢無明見疑取嫉慳也。",
    "X28n0586_013:0389b16_0": "睡眠遍不違若有皆增一善心所有二十二法俱起十大地十大善地及尋伺有時增惡作不善心所有二十謂大地十大煩惱地六大不善二尋伺二四煩惱忿等惡作二十一有覆有十八無覆許十二如前心品中若有皆增一俱舍頌云欲有尋伺故於善心品中二十二心所有時增惡作於不善不共見俱唯二十四煩惱忿等惡作二十一有覆有十八無要許十二睡眠遍不違若有皆增一論曰且欲界中心品有五謂善唯一不善有二謂不共無明相應及餘煩惱等相應無記有二謂有覆無記及無覆無記然欲界心定有尋伺故善心品必二十二心所俱生謂十大地法十大善地法及不定二謂尋與伺非諸善心皆有惡行有時增數至二十三惡作者何惡所作體名為惡作應知此中緣惡作法說名惡作謂緣惡作心追悔性若於不善不共心品必有二十心所俱生謂十大地法六大煩惱地法二大不善地法并二不定謂尋與伺何等名為不共心品謂此心品唯有無明無有所餘貪煩惱等於不善見相應心品亦有二十心所俱生名即如前不共品說言不善見相應心者謂此心中或有邪見或有見取或戒禁取於四不善貪嗔慢疑煩惱心品有二十一心所俱生二十如不共加貪等隨一於前所說忿等相應隨煩惱品亦二一十心所俱生二十如不共加忿等隨一不善惡作相應心品亦二十一心所俱生謂即惡作第一十一共於無記有覆心品唯有十八心所俱生謂十大地法六大煩惱地法并二不定謂尋與伺欲界無記有覆心者謂與薩迦耶見及邊執見相應此中見不增應知如前釋於餘無記無覆心品許唯十二心所俱生謂十大地法并不定尋伺應知睡眠與前所說一切心品皆不相違通善不善無記性故隨何品有即說此增謂二十二至二十三若二十三至二十四不善無記例之可知覆謂染法能障聖道又能蔽心令不淨故名為有覆此識非染故名無覆記謂善惡有愛非愛果及殊勝體可記別名為有記非善惡故名為無記亦云記錄記憶等也其餘法相名義下文委辨。",
    "X28n0586_013:0390a06_0": "薩遮尼乾",
    "X28n0586_013:0390a07_0": "此云離繫即自餓外道也。",
    "X28n0586_013:0390a08_0": "大論總有八偈",
    "X28n0586_013:0390a09_0": "偈云汝起勿抱臭身臥種種不淨假名人如得重病箭入體諸苦痛集安可眠一切世間死火燒汝當求出安可眠如人被縛將去殺災害垂至安可眠結賊不滅害未除如共毒蛇同室宿亦如臨陣白刃間爾時安可而睡眠眠為大暗無所見日日侵誑奪人明以眠覆心無所識如是大失安可眠。",
    "X28n0586_013:0390a15_0": "猶如麂猶亦玃屬隨人行時前後不定",
    "X28n0586_013:0390a16_0": "猶平聲麂音几貜居縛切說文云大母猴也亦猨也似獼猴而大色蒼黑字正作猷又作冘冘豫不定耳顏氏家訓云吾以為人將犬行犬好豫在人前待人不得又來迎候如此往還至于終日此乃豫之所以為未定也故稱猶豫焉。",
    "X28n0586_013:0390a21_0": "隴右",
    "X28n0586_013:0390a22_0": "亦曰隴西即禹貢雍洲之域自隴而西盡其地也雍州自歧隴已北為關內道自隴西南并得禹貢梁州之北垂為隴右也。",
    "X28n0586_013:0390b01_0": "禪鎮",
    "X28n0586_013:0390b02_0": "木版為之形量似笏中作孔施紐串於耳下頭戴去額四指坐禪人若昏睡頭傾則墮以自警之又有禪帶用皮為之廣一尺長八尺頭有鉤從後轉向前拘兩膝令不動故為乍習禪易倦用此撿身助力故又有倚版為除勞故又有骨人故大論云更與骨人令坐禪者觀之即晝枯骨人也。",
    "X28n0586_013:0390b08_0": "[魚*翁]",
    "X28n0586_013:0390b09_0": "烏紅切。",
    "X28n0586_013:0390b10_0": "飴",
    "X28n0586_013:0390b11_0": "亦之切。",
    "X28n0586_013:0390b12_0": "廣說法門",
    "X28n0586_013:0390b13_0": "野干為天帝釋自說因地作國王以兵借於小國鬬戰傷害又受諸女躭荒奢侈造諸惡業身死乃生地獄餓鬼今生畜生中作野干身又說十善十惡四等六度諸法道品時天帝釋與諸天等聞斯法已皆發道心即還天上野干七日命終之後生兜率天時野干者即釋迦如來是時天帝釋者即舍利弗是。",
    "X28n0586_013:0390b20_0": "未審彼土五鹽",
    "X28n0586_013:0390b21_0": "四分律說有兩種五鹽初五種者一黑鹽二丸鹽三樓鹽四摩鹽五支頭鞞鹽鞞府移切第二五種者一滷鹽二灰鹽三新陀婆鹽四施遽鞞鹽五海鹽此等五鹽或約色辨或從處所以立名也西域記云信度國有一峯多出赤鹽色如赤石也白鹽黑鹽及白石鹽等遠方異域以之為藥也又下文云乃至菩薩有俗蓋者恐誤應云有中道蓋也又下文云唯有塵沙無明名瘡癬者又下文云三請四止者誤也應云三請三止亦可四請三止也若准止觀之意但是引於飢餓來證飢相耳羸瘦瘡癬相從而言非正意也故準經意只是見思為瘡癬耳。",
    "X28n0586_013:0390c09_0": "顆",
    "X28n0586_013:0390c10_0": "苦果切。",
    "X28n0586_013:0390c11_0": "觚",
    "X28n0586_013:0390c12_0": "古胡切。",
    "X28n0586_013:0390c13_0": "鷳",
    "X28n0586_013:0390c14_0": "亦作鷴戶間切白鷴似雉而尾長四五尺。",
    "X28n0586_013:0390c15_0": "凷",
    "X28n0586_013:0390c16_0": "苦對切與塊同。",
    "X28n0586_013:0390c17_0": "[跳-兆+必]",
    "X28n0586_013:0390c18_0": "蒲結切。",
    "X28n0586_013:0390c19_0": "偃[佇-丁+弮]",
    "X28n0586_013:0390c20_0": "[佇-丁+弮]九輦切傲慢也又不伏也[佇-丁+弮]或作[仁-二+蹇]。",
    "X28n0586_013:0390c21_0": "猪",
    "X28n0586_013:0390c22_0": "陟魚切。",
    "X28n0586_013:0390c23_0": "太公六韜",
    "X28n0586_013:0390c24_0": "韜亦作弢吐刀切六弢周書篇名也或云秘讖也文武虎豹龍犬是謂六弢也。",
    "X28n0586_013:0391a02_0": "大師與吉藏書",
    "X28n0586_013:0391a03_0": "會稽嘉祥寺吉藏法師本自命家制作章疏後乃散眾歸心天台如前文句補注中示。",
    "X28n0586_013:0391a05_0": "瑋",
    "X28n0586_013:0391a06_0": "禹鬼以貴二切珍琦之寶也。",
    "X28n0586_013:0391a07_0": "櫪",
    "X28n0586_013:0391a08_0": "郎擊切馬櫪也。",
    "X28n0586_013:0391a09_0": "髦音毛。",
    "X28n0586_013:0391a10_0": "璣",
    "X28n0586_013:0391a11_0": "居依切珠之不圓者也。",
    "X28n0586_013:0391a12_0": "臣如檀子等",
    "X28n0586_013:0391a13_0": "史記田敬仲完世家文也吾臣有檀子者使守南城則楚人不敢為冦吾臣有盼子者使守高唐則趙人不敢東漁於河吾吏有默夫者使守徐州則燕人祭北門吾臣有種首者使備盜賊則道不捨遺。",
    "X28n0586_013:0391a17_0": "翥",
    "X28n0586_013:0391a18_0": "章怒切飛舉也。",
    "X28n0586_013:0391a19_0": "翅",
    "X28n0586_013:0391a20_0": "施智切鳥舉也。",
    "X28n0586_013:0391a21_0": "止觀云玉碧潤鮮可勝言哉",
    "X28n0586_013:0391a22_0": "語出文選左太仲吳都賊注云言竹色如玉碧之鮮潤碧亦玉也明吳都竹色如此是故云也。",
    "X28n0586_013:0391a24_0": "輔行云榻",
    "X28n0586_013:0391b01_0": "他蠟切栛榻也栛虗業切榻又都蓋切手打之謂也若依經文乃作擉字初朔切指也莊子云冬則擉鼈于江刺鼈也北本經作斵子。",
    "X28n0586_013:0391b04_0": "痺",
    "X28n0586_013:0391b05_0": "卑利切。",
    "X28n0586_013:0391b06_0": "止觀云敬獼猴為帝釋",
    "X28n0586_013:0391b07_0": "佛藏經第一云佛告舍利弗過去世中有一癡人不識獼猴入一大林見獼猴聚集一處是人曾聞有忉利天便以謂是忉利諸天即出樹林於多人中作如是言汝等曾見忉別不眾人答云未曾見也即時語云我已得見即將大眾同詣林中告眾人言汝等觀此忉利諸天眾人皆云非忉利天是獼猴耳汝癡倒故不識獼猴又亦不識忉利諸天舍利弗於未來世當有比丘至白衣家作如是言汝欲見佛及諸聖眾聽聞法不中有白衣信佛法者皆云欲見聽受佛法舍利弗中有白衣貪樂語言入于塔寺有諸比丘好於言說能誦諸經依止語言樂於文飾是諸沙門隨順為說謂為真道如牧牛人但樂讀經不入真際但悅人意貴於名利不樂禪定晝夜常好臥厚被褥尚無一念隨順禪定何況能成沙門果者是人常為惡魔所攝於第一義不能勤學是諸惡人但以音聲語言自謂沙門似如癡人見獼猴群謂忉剎天今借彼文以明止觀人而不修摩訶止觀亦如彼喻矣。",
    "X28n0586_013:0391c01_0": "又一種禪人不達他根性純教乳藥等",
    "X28n0586_013:0391c02_0": "此用大經舊醫純用乳藥說邪三修常樂我等不知眾生五濁障重反增其病新醫禁乳說無常等於令即是對治助開又多僕從也體心[跳-兆+曷]心乃至一轍之意者向奪而言之貶同舊醫乳藥邪常令與而言之亦一轍之意以體達如空等似同理性車體故也既無具度資成白牛觀照等十是故但得一轍之意耳故下明於十乘畢云今人只謂捨惡取空名為大乘此空尚不免六十二見設借為乘但有車體禿空而已何能動出委如下文尋之可解令此所斥人法俱非諒與下文其意無別更請後德正意思之問輔行第一引九師相承文師已前非令所承且文禪師既用覺心今此何故斥於覺覔但是一轍將非智者斥於比齊若其爾者所承何在答妙玄開演法華十妙尚云莫以中論相比又云天竺大論尚非其類等所以然者以智者用如來之意明法華之妙故龍樹雖是高祖亦所不及也今此將說法華大車十乘妙行故雖北齊文師豈能盡於淵旨唯南岳天台靈山親承妙悟法華故以法華經意開十妙十乘所以龍樹北齊亦乃未及耳非謂智者自任己情斥於祖宗幸希後德微細研詳若無生宗旨三觀行門其實祖乎龍樹宗於北齊稟於南岳師資相承宛如符契但南岳智者親承妙悟法華三昧故龍樹北齊有所未及耳當仁不讓又何怪哉自別教菩薩境來皆是夜游墮落故也。",
    "X28n0586_013:0392a03_0": "輔行云慧聞已前",
    "X28n0586_013:0392a04_0": "聞應作文慧文禪師是也。",
    "X28n0586_013:0392a05_0": "推踏",
    "X28n0586_013:0392a06_0": "推池回切踏正作蹋談狎切。",
    "X28n0586_013:0392a07_0": "蹶",
    "X28n0586_013:0392a08_0": "居月居衛二切。",
    "X28n0586_013:0392a09_0": "泝",
    "X28n0586_013:0392a10_0": "桑故切。",
    "X28n0586_013:0392a11_0": "具已第八卷釋",
    "X28n0586_013:0392a12_0": "已字恐誤應云具如具在等也。",
    "X28n0586_013:0392a13_0": "止觀云魔處",
    "X28n0586_013:0392a14_0": "遽戰幖也魔生戰幖恐行人出其境界故若作懼者義亦便也。",
    "X28n0586_013:0392a16_0": "輔行云亦應更云陰入為法界",
    "X28n0586_013:0392a17_0": "古本止觀但云眼耳鼻舌等皆是寂靜門亦是法界所以記中乃云亦應更云陰入為法界以今正明陰入為不次第法界故也而今本止觀眼耳鼻舌下已言陰入界者斯乃後人檀自添之耳翻令記文却成誤矣上下文中後人擅添其事非一幸希後德委悉詳之。",
    "X28n0586_013:0392a23_0": "方丈託疾乃至十仙受道等",
    "X28n0586_013:0392a24_0": "須讀維摩經三卷并疏記等及涅槃經三十六卷并玄疏等始可敷演此一節文清涼觀師云淨名但顯作用不思議解脫蓋是一分之義未顯法界融通不思議故不同華嚴經也天台學者敢謂清涼是義不然請以教義判經方知法門無異淨名既顯不思議用華嚴亦彰法界融通彼此圓妙皆不思議復何優劣於其間哉別圓大乘法門正等但即不即及具不具而分兩殊作此所判自然無滯不明斯旨任運抑揚大乘經矣思之思之後昆慎之唐顯慶中高宗勅衛尉寺烝李義表前融洲黃水令王玄策充使西域至毗耶離城東北四里許維摩示疾之室遺址疊石為之玄策躬以手板縱橫量之得十笏因號方丈焉。",
    "X28n0586_013:0392b13_0": "慢有八種",
    "X28n0586_013:0392b14_0": "準涅槃經有七慢一慢二慢慢三不如慢四增上慢五我慢六邪慢七憍慢婆沙論亦列七慢一慢二過慢三慢過慢四我慢五增上慢六卑慢七邪慢毗曇亦列七慢一慢二增慢三慢慢四增上慢五我慢六不如慢七邪慢俱舍明慢具如文句記釋八鳥譬八慢中說瑜伽論中亦列七慢一慢二過慢三慢過慢四我慢五增上慢六下劣慢實無其德謂已有故七邪慢據成實論有大慢名為八也一慢者此陵下境及等境中計等故名慢也二過慢者於其等中而計勝也三慢過慢者他人道德實過於己更起慢心而過於他也四我慢者恃我陵物故也五增上慢者定及無漏慧是增上法未得此法而計得也六卑慢者他實大勝已而言少不如耳七邪慢者自己無德矜高陵物也八大慢者於等中為上於上中為等故也諸阿毗曇婆沙等論分別解釋甚廣云云。",
    "X28n0586_013:0392c06_0": "輔行云故小乘中通大地十大善地十大煩惱地六大不善地二小煩惱地十及十四不相應行俱舍論云通大地十者地謂行處此是彼行處即說此為彼法地大法地故名為大地此中若法大地所有名大地法謂法恒於一切心有彼法是何頌曰受想思觸欲慧念與作意勝解三摩地徧於一切心論云受謂三種領納苦樂俱非有差別故想謂於境取差別想思謂能令心有造作觸謂於根境識和合能有觸對欲謂希求慧謂簡擇念謂記憶不忘作意謂令心警覺勝解謂於境印可三摩地謂心境一性大善地十者大善法地名大善地此中若法大善地所有名大善地法謂法恒於諸善心有彼法是何頌曰信及不放逸輕安捨慚愧二根及不害勤唯徧善心論云信者令心澄淨不放逸者能守護心輕安者身心堪任捨者心平等性無警覺性慚謂於所造罪自觀有耻愧者觀他有耻於罪見怖二根者無貪無嗔無癡善根慧為性故已在前來大地法中故不重說為大善地不害者無所損惱勤者令心勇悍大煩惱地六者大煩惱地法名大煩惱地此中若法大煩惱地所有名大煩惱地法謂法恒於染汙心有彼法是何頌曰癡逸怠不信惛掉恒唯染論云癡謂愚癡逸即放逸怠謂懈怠不信謂心不澄淨惛謂惛沉掉謂掉舉令心不靜唯有此六名大煩惱大不善地二者大不善法地名大不善地此中若法大不善地所有名大不善地法謂法恒於不善心有彼法是何頌曰唯遍不善心無慚及無愧論云於所造罪自觀無耻名曰無慚觀他無耻名曰無愧小煩惱地十者小煩惱法地名小煩惱地此中若法小煩惱地所有名小煩惱地法謂法恒於小分染汙心有名小煩惱彼法是何頌曰忿覆慳嫉惱害恨諂誑憍論云依對現前不饒益境憤發名忿於自作罪恐失利譽隱藏為覆耽著財法不施名慳但欲自利不願他榮妬忌為嫉忿恨暴熱很悷為惱於諸有情心無悲愍為害懷惡不捨結怨為恨罔冐矯設名之為諂詐現有德以求利譽名之為誑心生染著醉傲為憍十四不相應行者頌曰心不相應行得非得同分無想二定命相名身等類論云如是諸法心不相應非色等性行蘊所收一得二非得三同分四無想五無想定六滅盡定七命八生九住十異十一滅十二名身十三句身十四文身此十四名解釋具如論中今且略錄難見之者得與非得具如下文委示名義言同分者亦言眾同分類相似故名眾同分同分有二一無差別謂諸有情有情同分一切有情各等有故二有差別謂有情界地種各別故由出離想不恒心滅名無想定為求解脫以出離想而為先故由止息想恒不恒心滅名滅盡定為求靜住以止息想而為先故餘之名義可以思之。",
    "X28n0586_013:0393b07_0": "大乘中遍行五別境五大善地十一隨煩惱二十不定四準百法論此中脫落應於大善地十一字下添云根本煩惱有六故彼論中心所有六今文但五驗知脫落徧行五者遍四一切為所行故四一切者一善二不善三無記四時地俱時謂剎那地謂三界九地俱謂遍諸心等與八識俱此遍行五具四一切故云徧行徧屬所緣行屬能緣又亦徧行俱屬能緣又亦可行而非是徧徧行五者一作意二觸三受四想五思云何作意謂能警心為性於所緣境引心為業故此警覺應起心種引令趣境故名作意云何為觸根境識三更相隨順令心心所觸境為觸云何為受領納違順故名為受云何為想於境取象施設種種故名為想云何為思謂能取境驅役自心故名為思別境五者緣別別境而得生故名為別境此別境五於前所說四一切中但具初二由闕後二非遍行攝名為別境別境五者一欲二勝解三念四三摩地五慧云何為欲於所觀境有希望故云何勝解於決定境審印持故云何為念於曾習境心不忘故三摩地者此云等持由定令心專不散故云何為慧於所觀境揀擇推求得決定故大善地十一者此世他世俱順益故勝過惡法故名為善於前所說四一切中但徧九地除性時俱雖徧九地由闕三性非別境攝但名為善善十一者一信二精進三慚四愧五無貪六無嗔七無癡八輕安九不放逸十行捨十一不害云何為信於實德能深樂欲故云何精進所謂勇猛不捨善故云何為慚崇重賢善著耻罪故云何為愧輕拒暴惡止息罪故云何無貪對治貪著作善業故云何無嗔對治嗔恚作善業故云何無癡於諸事理明了達故云何輕安身心調暢轉安適故不放逸者對治放逸進修善故云何行捨行謂行蘊捨謂捨離行之捨故能令心靜云何不害於諸有情不損惱故根本煩惱有六者一貪二嗔三慢四無明五疑六不正見能生隨惑名為根本煩而擾惱故云煩惱云何名貪謂由愛力取蘊生故云何名瞋謂令身心生熱惱故云何名慢恃己於他不謙下故云何無明於諸事理迷不了故云何為疑生猶豫故不正見者於諸諦理邪推度故隨煩惱二十者一忿二恨三惱四覆五誑六諂七憍八害九嫉十慳十一無慚十二無愧十三不信十四懈怠十五放逸十六惛沉十七掉舉十八失念十九不正知二十散亂所言隨者謂隨根本煩惱前後分位建立等流性故名之為隨即前十三依他根本煩惱而起名之為隨其後七重雖非依彼根本而起然亦緣彼而有亦得名隨根本及隨於前所說四一切中雖闕三性由不徧地非善十一之所攝故憤發為忿懷惡為恨暴熱為惱隱藏為覆矯詐為誑罔冐為諂醉傲為憍損惱為害妬忌為嫉鄙悋為慳輕拒賢善名為無慚崇重暴惡名為無愧不樂實德名為不信懈怠即是不修善故放逸即是於善縱蕩障礙輕安名為惛沉心不寂靜名為掉舉心多散亂名為失念於境謬解名不正知其心流蕩名為散亂不定四者一睡眠二惡作三尋四伺三性不定名為不定非同觸等定徧心故非如欲等定徧地故非同善染唯一性故名為不定於前所說四一切中雖闕後三由三性具非根非隨令身昧略名為睡眠惡所作業名為惡作尋謂尋求伺謂伺察此二皆悉令心忽遽。",
    "X28n0586_013:0394a18_0": "未到定",
    "X28n0586_013:0394a19_0": "亦云未至未入根本地根本地未現前而能離欲故云未至未到也又云喘息喜樂是內過患者若依大經初禪覺觀二禪歡喜三禪喘息以為內災也若依俱舍三禪內災即動息也今恐由樂故有動息喘息名異義同也又下文云九念處者如下第十卷末所明四教總論有九念處是也。",
    "X28n0586_013:0394b01_0": "九想八念",
    "X28n0586_013:0394b02_0": "一脹想二青瘀想三壞想四血塗漫想五膿爛想六噉想七散想八骨想九燒想一念佛二念法三念僧四念戒五念捨六念天七念入出息八念死。",
    "X28n0586_013:0394b05_0": "五屍五處",
    "X28n0586_013:0394b06_0": "死蛇死狗死人等名為五屍首楞嚴三昧經云兩手兩足及頸名為五處繫縛於魔大經四依品四依驅逐魔云天魔波旬若更來者當以五繫繫縛於汝章安疏云繫有二種一者五屍繫二者繫五處五屍繫者如不淨觀治於愛魔五處如理治於見魔五屍表五種不淨觀五繫表五門觀。",
    "X28n0586_013:0394b12_0": "他解須彌",
    "X28n0586_013:0394b13_0": "一者約對須彌之大對小故大芥子之小對大故小對大之小小是大小對小之大大是小大大為小大故須彌入芥子小是大小故芥子納須彌二約因果須彌芥子色性不殊芥色之因能含須彌色果須彌色果隱在芥因之中若離芥因則無其果是則因能含果三約唯識一念淨心微細如芥森羅萬象猶若須彌萬象從心離心無法四者約用芥子須彌二俱如幻大士神力故令相入楷師雖立四義依今家則無取焉然今止觀并及記中所明須彌芥子相入不思議事文相稍略具明備在涅槃玄義今委引之使此可解彼文明用有三一本用二當用三自在起用於第三用復有三種一不思議用二二鳥雙游用三善惡邪正雙攝用初明不思議用引舊有七一云令他見須彌入芥子其實不入唯應度者乃能見之此解不可若不入者何謂神通二云實入但佛神力[戊@(止/豆)]大令小開小令大此亦不可若爾乃以大容小何謂以小容大三云不知入與不入既是不可思議那可定判入與不入此亦不可佛果上地皆是不可思議盡應不可解餘者盡言可解至此一義獨言不知耶四云若有則相妨皆空故相容此亦不可者其皆空何所論入亦無大小也五云大中有小性小中有大性以芥子之大性容須彌之小性此亦不可若執定性過同外道又似毗曇又還是大容於小何謂以小容大六地論解云大無大相不無無相之大小無小相不無無相之小以無相之小容無相之大無相之大還入無相之小此亦不可大小本是相既言無相那有大小若有大小應是有相若定無相還同空也七興皇解云諸法本無大小因緣假名相待假說大為小假說小為大說大為小小是大小說小為大大是小大故得相容此亦不可大不自大待小為大小不自小待大為小此墮他性義自性大小尚不能相容他性大小那能相容今明小不自小亦不由大故小大不自大亦不由小故大因緣故小大亦不離大離小不在內外兩中間亦不常自有不可思議大亦如是通達此理故即事而真唯應度者見不思議須彌之高廣入於不思議芥子之微小是名以不思議之大入不思議之小住首楞嚴能建大義如經廣說若一往明不思議用在於道後其理實通已上具引涅槃玄義又唐時西京楷師撰此經疏復立四義。",
    "X28n0586_013:0395a06_0": "準俱舍中色攝五根境及以二無作",
    "X28n0586_013:0395a07_0": "俱舍頌曰色者唯五根五境及無表亂心無心等隨流淨不淨大種所造性由此說無表論云五根五境及無表色立色蘊名無表雖以色業為性如有表業而非表示令他了知故名無表亂心者謂此餘心無心者謂入無想及滅盡定等言顯示不亂有心相似相續說名隨流善與不善名淨不淨為簡諸得相似相續是故復言大種所造造是因義謂作生等五種因故顯立名因故言由此說無表略說表業及定所生善不善色名為無表准俱舍論應云一無表今云二無作者恐誤也新譯名為表無表舊翻名為作無作作謂作為表謂表彰成論謂之教無教教謂教示色有十四謂五根五塵并及四大俱舍論數論謂色有十一種色以色蘊為體心以識蘊為體心所及不相應除受想二以行蘊為體受想二種以受想為體故云行攝諸心所唯除受想二又上文云取蘊者從取生故名為取蘊或蘊屬取故名為取或蘊生取名為取也。",
    "X28n0586_013:0395a24_0": "廣以族持性等三義釋界乃至廣以二十二門分別界義俱舍頌曰聚生門種族是蘊處界義論云諸有為法和合聚義是蘊義也生長門義是處義也以能生長心心所法故名為處法種族義是界義也如一山中有多銅鐵金銀等族說名多界如是一身或一相續有十八類諸法種族名十八界此中種旋是生本義如是眼等誰之生本謂自種類同類因故又復應知能持自性故名為界應云二義言三義者亦恐誤也此十八界幾是色幾非色幾有漏幾無漏等有二十二門分別具在論中。",
    "X28n0586_013:0395b11_0": "同時意識",
    "X28n0586_013:0395b12_0": "觀師引唯識義有率爾意識同時意識。",
    "X28n0586_013:0395b13_0": "華他治病",
    "X28n0586_013:0395b14_0": "華戶化切他音陀魏世華他能刳腸易胃湔洗五藏刳音枯湔則前切下文又云玄文對信名別竪者玄文位妙以十乘次第對十信名竪復引瓔珞一信有十十信有百名橫釋籤云既由十乘入於十信故今文義理須具對橫竪二意故先竪次橫故知十信與十乘義同名異。",
    "X28n0586_013:0395b20_0": "阿伽陀藥",
    "X28n0586_013:0395b21_0": "亦言阿揭陀又云阿竭陀此翻為丸藥又下文云如來林菩薩者新經云覺林菩薩耳又下文引大經三十四云內外色等有十時者第十三卷正同今文所引者也。",
    "X28n0586_013:0395c01_0": "又世間者名蓮華注云二乘",
    "X28n0586_013:0395c02_0": "有人釋涅槃中文云諸佛為世間即經中蓮也別喻佛果三種世間而輔行注云蓮華是二乘者恐誤也又云世間謂諸菩薩者經云諸佛菩薩耳今文欠一佛字也。",
    "X28n0586_013:0395c06_0": "否",
    "X28n0586_013:0395c07_0": "房彼切。",
    "X28n0586_013:0395c08_0": "褰",
    "X28n0586_013:0395c09_0": "去乾切。",
    "X28n0586_013:0395c10_0": "荼",
    "X28n0586_013:0395c11_0": "同都切。",
    "X28n0586_013:0395c12_0": "峙",
    "X28n0586_013:0395c13_0": "直里切峻也直也。",
    "X28n0586_013:0395c14_0": "五星失度等",
    "X28n0586_013:0395c15_0": "五星者太白熒惑鎮星歲星辰星五嶽者泰山為東華山為西霍山為南恒山為北嵩高為中天狗流行者漢書云天狗狀如流星注云星有尾旁有彗下有狗形者亦太白之精也流星者光跡相連也絕跡而去為飛也白虹者虹戶公切爾雅云螮蝀虹也螮音帝蝀丁孔切後漢書獻帝紀云董卓殺太后何氏靈帝四月崩立皇太子辯年十七董卓九月廢帝為弘農王立皇弟恊為帝即獻帝也明年董卓殺弘農王遂遷帝都于長安仍焚洛陽宮廟人家董卓後為呂布殺之袁紹稱天子者文誤也袁術自稱天子袁紹自為大將軍耳八年操尚等者誤略也九年曹操破袁尚乎冀洲自領冀洲牧也十八年五月操自立為魏公耳十九年劉備破劉璋據益州也十九年十一月操殺皇后伏氏滅其族及二皇子即獻帝之后及二子也今云二十年者誤也其年刘備稱漢王者亦誤也至二十四年五月備取漢中至七月方稱王也至十一月孫權乃取荊州也二十五年正月曹操薨子丕襲位十月獻帝遜位丕稱天子即魏文皇帝也封獻帝為山陽公明年刘備稱帝於蜀孫權自王於吳於是天下遂三分矣沛博蓋切郡名也罿徒紅切車上之網也備父事洲郡者蜀志云先主父弘世仕洲郡也少孤等者先主少孤與母販履織席為業也常望氣者誤也遙望見耳叔父子驚曰者叔父子敬曰耳孫傳不能具記者吳主孫權字仲謀堅之子策之弟堅與策俱有功策將佐推奉之稱吳王年號黃武權方頥大口目有精光魏文即位拜為吳王後遂稱帝號云云又下文引楞嚴四種授記中第四無生記闕現前兩字也應云無生現前也又下文云無漏因生者經云無漏果者因有漏生故名為果也。",
    "X28n0586_013:0396a22_0": "春蒐",
    "X28n0586_013:0396a23_0": "蒐音搜也搜索取其不住者也。",
    "X28n0586_013:0396a24_0": "夏苗",
    "X28n0586_013:0396b01_0": "苗言為苗稼除害也。",
    "X28n0586_013:0396b02_0": "秋獮",
    "X28n0586_013:0396b03_0": "獮息淺切獮殺也言順其殺氣也。",
    "X28n0586_013:0396b04_0": "冬狩",
    "X28n0586_013:0396b05_0": "狩手又切得獸則取之無所擇也。",
    "X28n0586_013:0396b06_0": "幟",
    "X28n0586_013:0396b07_0": "尺志切。",
    "X28n0586_013:0396b08_0": "具如玄文約現生後論九論十及以斷惑盡等玄義云又約現生後論九論十釋籤云有現報故名為有報無生後故亦言無報玄義云若就妙覺亦九亦十何者中道智慧乃是損生生既未盡故有諸地生滅不同妙覺損生義足最後那得論報釋籤云別約妙覺亦九亦十者損生義足是故唯九約現生後既有現報亦可為十。",
    "X28n0586_013:0396b15_0": "若如玄文用教多少",
    "X28n0586_013:0396b16_0": "彼文只是以性相等歷五味教有多有少耳故云華嚴中有菩薩佛界兩性相等乃至法華中九種性相入佛性相等中間三味可準知之又下文云介爾景福者鄭玄箋詩云介者助也景者大也福謂五福也言助爾之大福也今但借其語不用彼義也故今乃是細念為介爾耳言五福者尚書云一壽二富三康寧四攸好德五考終命下文引杜文業云五福者非杜延業自說也乃出尚書耳。",
    "X28n0586_013:0396b24_0": "指南",
    "X28n0586_013:0396c01_0": "文選吳都賦云指司方注云指南車也車上有木人常指其南故云司方也又古今注云指南車起於黃帝帝與蚩尤戰于涿鹿之野蚩尤作大霧迷四方於是作指南車以示四方遂擒蚩尤而即帝位又云周公理致太平越裳氏重譯來獻白雉一黑雉一象牙一使者迷其歸路周公錫以文錦二匹軿車古乘皆為司南之制使其越裳氏戴之以南緣扶南林邑海際期年至其國使大夫張騫窶將送至本國而還亦乘司南而背其所指亦朞年而旋始製車轄[車*甚]皆以鐵及還鐵亦銷盡以屬巾車氏攻而戴之常為先導示服遠人而正四方也漢末喪亂車法中絕馬先生紹而作之馬鈎魏人也今指南車是其遺法焉問曰指南之說如此染指之文何據答曰春秋宣公四年夏六月乙酉鄭公子歸生弑其君左傳云楚人獻黿於鄭靈公公子宋與子家將見子公異無食指動以示子家曰他日我如此必甞異味矣及入宰夫將解黿相視而笑公問之子家以告及食大夫黿召子公弗與也子公怒染指於鼎甞之而出公怒欲殺子公子公與子家謀先子家曰畜老猶憚殺之而況君乎反讚子家子家懼而從之夏弑靈公書曰鄭公歸生弑其君夷權不足也君子曰仁而不武無能達也問何故須以三千而為指南乃是終窮究竟極說答法華開權顯實品題乃言方便良以非實無以立權非權無以顯實權有顯實之功是故稱歎方便吾祖智者既靈山親承大蘇妙悟故說法華妙行摩訶止觀明三千妙假之權顯空中實相之實爾是明三千複俗之權顯真諦之實矣若不許心具三千之事圓頓之理乃成徒施故以三千而為指南終窮極說乃顯空中實相之理體如明鏡方見妙有不礙真空亦知真空不妨妙有故前文問但觀於心何須觀具答中乃云一家觀門永異諸說該攝一切十方佛法良由觀具乃至云別教已還尚不識具況識空中又云若不爾者成正覺已何能現於十界身土又上文云故成道時稱此一念遍於法果等豈非並以一念三千不思議假諸法之權顯於實相空中之實往人不了聞三千是俗諦所攸輙便難云豈大師以俗諦為極說荊谿以假法為指南斯蓋率爾之難不思之問耳。",
    "X28n0586_013:0397a16_0": "譜",
    "X28n0586_013:0397a17_0": "博古切籍錄之謂也。",
    "X28n0586_013:0397a18_0": "大經三十三云佛性不名一法等",
    "X28n0586_013:0397a19_0": "章安云夫佛性者下第三總結大宗又四一明佛性之理未得菩提下二明約法因中說果問章安疏義雖則如此輔行引經其意若何答輔行引者明性德境真如觀理直達三千本無四性照窮本理非縱非橫非一非異本自二空頓亡性相為性德境第一義諦一法尚無三千何有是故乃引大經佛性不名一法不名十法不名百法不名千法不名萬法斯乃一念三千複俗二邊緣了即是中道第一義真正因佛性非三千也若謂中道第一義真實相正因佛性之理有三千者却成佛性名一十等百千萬法反經非聖傷害尤甚昧者不覺可不悲乎輔行復引大經云未得菩提時一切善惡無記皆名佛性仍釋之曰善惡無記即三千也常知此乃引證三千名為佛性即是三千複俗二邊緣了佛性也是則佛性非三千即正因佛性也一切善惡無記三千皆名佛性即緣了佛性也故總結示云故知三千非三千具足三佛性良由於此然雖兼示緣了佛性正為引於正因佛性非一十等百千萬法以證性德第一義空三千叵得一念尚無誰論橫竪何則以世諦中尚具無量何但三千自是第三化他境耳以此觀之輔行雖引一切善惡無記三千皆名佛性但是兼示化他境耳若謂不然輔行那云不思議境文異義一意非一異以三諦法不出修性自他故也是故須知性德修德第一義空其理無別但修德境義當占察唯識歷事專照起心四性叵得方乃入於第一義空名修德耳性德境者義當占察真如觀理直達法性照窮理體本無四性頓亡性相悟第一義名性德耳非謂性德境但是理即所收也而輔行以修德境即是自行者須知此約望後化他名為自行望前性德名之為修耳非謂性德不對化他不名自行性德若乃不對化他何故引於一切善惡無記三千皆名佛性耶性德若乃不名自行豈可占察真如觀理不是修行耶若乃專執推撿四性方名修者此則執於唯識事觀而害真如理觀矣應於此中引文句記指今止觀不思議境一念三千非自他等該通性德修德之意令彼此通暢使性修無滯幸希後德精詳祖意流通永永。",
    "X28n0586_013:0397c09_0": "不同俱生及現行等",
    "X28n0586_013:0397c10_0": "准唯識意一者分別謂因邪師邪教邪思惟生此見道斷至初地時便乃斷盡二者俱生不由上三生則便有此修道斷此又二種一者現行二者種子若所知種現地地斷之若煩惱現行亦地地斷煩惱種子直至金剛乃斷觀法師云夫言俱生必有二物煩惱是一與何物俱即妄心事同時生也二生即生雜染即煩惱與生事俱也。",
    "X28n0586_013:0397c17_0": "先尼",
    "X28n0586_013:0397c18_0": "亦云西你迦此翻有軍外道。",
    "X28n0586_013:0397c19_0": "止觀云天親龍樹內鑒冷然外適時宜各權所據應云天親無著而言龍樹者誤也何者以前文破地攝論師且地論是天親所造攝大乘論是無著造今明地攝論主元意內鑒冷然外適時宜各權所據故應須云天親無著耳此由弘論之師不了論主元意遂各執一邊非天親無著之過也若言龍樹者龍樹何甞與天親各權所據耶況前文自破地攝二師違於龍樹不自他等以此明之則知止觀云天親龍樹者誤也。",
    "X28n0586_013:0398a04_0": "輔行云諸論教道不見此實雖內外熏等觀師云依唯識論本有新熏三師異說一青目等唯立本有不從熏生由熏但是增長之義二難陀等唯立新熏有義種子皆熏故生能熏所熏俱無始有三護法等有義種子各有二類一者本有二者始起由此應信諸有情等無始時來無漏之種不由熏習法爾成就其聞熏習非唯有漏聞正法時亦熏本有無漏種子令漸增盛展轉乃至生出世心。",
    "X28n0586_013:0398a13_0": "瑯",
    "X28n0586_013:0398a14_0": "力當切。",
    "X28n0586_013:0398a15_0": "玕",
    "X28n0586_013:0398a16_0": "古寒切瑯玕石似玉也說文云似珠也。",
    "X28n0586_013:0398a17_0": "璆",
    "X28n0586_013:0398a18_0": "奇樛切美玉也。",
    "X28n0586_013:0398a19_0": "琳",
    "X28n0586_013:0398a20_0": "力金切玉名也。",
    "X28n0586_013:0398a21_0": "穰",
    "X28n0586_013:0398a22_0": "汝羊切豐也眾多也詩云降福穰穰毛公傳云穰穰眾也今云穰穰福也者即爾雅釋訓之文也郭璞注云饒多也。",
    "X28n0586_013:0398b01_0": "翾",
    "X28n0586_013:0398b02_0": "許緣切。",
    "X28n0586_013:0398b03_0": "翔",
    "X28n0586_013:0398b04_0": "似羊切。",
    "X28n0586_013:0398b05_0": "若均山毫等鳧鸖恐未可也具如論衡茫贇與靜泰論於齊物贇屈於泰莊子內篇齊物篇第二云天下莫大於秋毫之末而太山為小注云夫以形相對則太山大於秋毫也若各據其性分物宜其極則形大未為有餘形小不為不足苟各足於其性則秋毫不獨小其小而太山不獨大其大矣若以性足為大則天下之足未有過於秋毫也若性足者非大則雖太山亦可稱小矣故曰天下莫大於秋毫之末而太山為小太山為小則天下無大矣秋毫為大則天下無小矣無小無大各安其性也故云均山毫矣秋毫者兔毫在秋而成也又王逸注楚辭云銳毛也桉毛至秋而耎細故以喻小者也夫自是而非彼美已而惡人物莫不皆然然故是非雖異而彼我均也故云齊物矣莊子外篇駢拇第八云長者不為有餘短者不為不足是故鳧脛雖短續之則憂鶴脛雖長斷之則悲故性長非所斷性短非所續故云等鳧鶴矣鳧小鴨也脛脚也斷下管切駢部田切並也拇音母足之大指也駢拇即足拇指連第二指也手有六指為枝指故曰駢拇枝指出乎性哉甞檢古今佛道論衡下卷云太子中舍辛諝齊物論并慧淨法師法琳法師杭拒文淨師文云竊以逍遙一也鵬鷃不可齊於九萬榮枯同也椿菌不可齊乎八千而況爝火之侔日月浸灌之方時雨寧有分同潤而遂均其曜澤哉至若山毫一其大小彭殤均其壽夭斯由相待不定相奪可忘莊生所以絕其有對非於未始無物論云續鳧截鶴庸詎真如草化蜂飛何居弱喪淨師文云報分已定二鳥不羨於短長業理資緣兩蟲有待而飛化下文又引神泰法師與道士李榮等論議耳今文云范贇等尋文未見後人更檢之又下文引大經第二云隘路者文在第五也經文但云譬如隘路乃至不受二人並行今文所引稍有誤也又下文引大經三十四云身子差機者文在二十四卷耳又論衡中卷引周武毀法有道安法師上二教論一十二篇初歸宗顯本篇云若夫以齊而齊不齊者未曰齊也余聞善齊天下者以不齊而齊天下者何須夷岳塞淵然後方乎續鳧截鶴於焉始等此蓋指夫之野議豈達士之貞觀乎故諺云紫實昧朱枉斯濫哲請廣其類上至天子下至庶人莫不資色心以成軀稟陰陽而作體不可以色心是等而便混以智愚陰陽義齊則使同之貴賤此之不可至理皎然雖強齊之其義安在。",
    "X28n0586_013:0398c24_0": "怳",
    "X28n0586_013:0399a01_0": "許昉切。",
    "X28n0586_013:0399a02_0": "[怲-人+(人*人)]",
    "X28n0586_013:0399a03_0": "良獎切若文兩切字須作[恫-(一/口)+(又*又)]。",
    "X28n0586_013:0399a04_0": "駃",
    "X28n0586_013:0399a05_0": "疎士切。",
    "X28n0586_013:0399a06_0": "儵",
    "X28n0586_013:0399a07_0": "式竹切。",
    "X28n0586_013:0399a08_0": "殉",
    "X28n0586_013:0399a09_0": "辭閏切。",
    "X28n0586_013:0399a10_0": "挑",
    "X28n0586_013:0399a11_0": "吐雕切字應作趒他弔切。",
    "X28n0586_013:0399a12_0": "止觀云猶如猛風吹兜羅毦",
    "X28n0586_013:0399a13_0": "大威德陀羅尼經云譬如駛風吹兜羅毦兜羅乃是梵音北土翻為楊華良以彼方細綿如此間楊華故也毦正作毦毦者乃是此方之之言毦而吏切毛毳也又是曲文罽者也又氅毦兜鍪上飾以犛牛尾為兵之飾也氅昌兩切又輔行下文引大經二十六云有因緣不可見者如空中鳥迹者引文脫落也應於如空中鳥迹又上添遠不可見四字又云障不可見如雲外月者經云如雲表星耳如此八種經中結云皆是有因緣不可見也。",
    "X28n0586_013:0399a22_0": "叻",
    "X28n0586_013:0399a23_0": "恐誤也字應作加即結加趺坐也。",
    "X28n0586_013:0399a24_0": "輔行云損之又損之乃至肇公改用",
    "X28n0586_013:0399b01_0": "老子德經云為學日益為道日損損之又損之以至於無為無為而不為今云周易云者恐誤也以周易中無此語故也肇論云書不云乎為學日益為道日損為道者為於無為者也為於無為而日日損此豈頓得之謂要損之又損之以至於無損耳今云肇公改用且依肇者亦誤也以今止觀但引老子之語故也莊周貴坐亡者亡字應作忘字莊子內篇云隳枝體黜聰明離形去智同於大通此謂坐忘也隳許規切端坐而忘故云坐忘也又下文云亦是四方四維之八風者觀經疏解八種清風云四方四維故云八亦可用對八卦也東震西兌南離北坎西北乾西南坤東北艮東南巽故云八卦也故乾風謂之不周坎風謂之廣莫艮風謂之融震風謂之明庶巽風謂之清明離風謂之景坤風謂之涼兌風謂之閶闔此即八卦之風故云亦可用對八卦也餘具觀經往生記中注解學者尋之。",
    "X28n0586_013:0399b18_0": "大明呪如釋籤",
    "X28n0586_013:0399b19_0": "大論問釋提桓因何故以般若為無上明呪答諸外道聖人有種種呪術利益人民誦是呪者能隨意所欲使諸鬼神諸仙有呪得大名聲人民歸伏貴是呪故故名般若以之為呪帝釋白佛是般若呪常與眾生道德樂故餘諸呪術能增長惡般若神呪能滅諸禪涅槃之著何況貪等是故名為大明呪也是無上呪者大或有上故名無上也是無等等呪者等此無等名無等等皆破無明故並云明又諸佛於一切眾生中無等故般若名無等也又無等者妙覺也無能等此無等之位故云無等等也。",
    "X28n0586_013:0399c06_0": "薳",
    "X28n0586_013:0399c07_0": "韋委切轉也遠也。",
    "X28n0586_013:0399c08_0": "不知鑽搖",
    "X28n0586_013:0399c09_0": "或作攢字恐誤也鑽去聲呼或平呼鑽搖乃是取蘇酪醍醐之具耳鑽即抨擊之木也又下文云見品見品者應云見品思品也。",
    "X28n0586_013:0399c12_0": "初阿後荼",
    "X28n0586_013:0399c13_0": "上上聲呼下去聲呼其四十二字今準大論略為頌曰阿羅波遮那羅陀婆荼沙和多夜吒迦娑摩伽他闍簸馱賖呿叉哆若柁婆車摩火嗟伽他拏頗歌醝遮吒荼句句皆有一十字六句乃成四十二。",
    "X28n0586_013:0399c18_0": "尼民陀",
    "X28n0586_013:0399c19_0": "此云持邊此山是七金山中最外邊者護持圍遶餘之六山故名持邊。",
    "X28n0586_013:0399c21_0": "軻梨羅",
    "X28n0586_013:0399c22_0": "木名也亦如此方苦梗木然彼山之中多有此木故以為名也。",
    "X28n0586_013:0399c24_0": "境界性",
    "X28n0586_013:0400a01_0": "性有五種所謂正性了性緣性於此三上加其二種為五種性所加二種諸說不同或云加境界性及果性或云加果性及果果性或云加因性及因因性若釋其義者般若空慧名了因性無量功德名緣因性一切諸法中悉有安樂性名正因性善惡事異名境界性單論智德菩提名為果性兼論斷德涅槃名果果性單約十二因緣事境名為因性兼約觀因緣智名因因性雖諸說不同而數必至五若作境界性即沒果果性為果性所攝若開果果性即沒境界性為緣因所攝若沒因性及因因性者因性及為三因所攝因因性則為了因所攝義可知矣又上文引異皇以雪山偈銷不生生是諸行無常者誤也應云生不生是諸行無常不生生是是生滅法也又云如來證涅槃等四句者不生生是如來證涅槃生不生是永斷於生死又復生死即是生生若能志心聽常得無量樂即不生不生也又云依章安解復是一途等者然章安疏與今止觀亦非碩異故章安云初句明證智次句明證理第三句明證斷第四句明證應若事若理智斷自他於初證中具足無缺廣說備在涅槃疏中是則今云但為銷經別作一途等甚不可也應知止觀與涅槃疏辭或不同意實符會後之學者請細詳之又下文云以地持六住中之四住者應云第四住也又下文云初句即吹而唾第三句即唾而吹者誤也應云初句即唾而吹第三句即吹而唾也。",
    "X28n0586_013:0400b03_0": "曉法師",
    "X28n0586_013:0400b04_0": "唐初海東新羅國有元曉法師造華嚴疏又下文云始從初心終至地前者誤也應云終至初地也又云疏中不釋非方圓尖斜者然涅槃經從非想非非想下更有三句云非是世法無有相貌世間所無今止觀中不引此三句仍依經中上下文意乃加非方非圓非尖非斜以替前之三句耳故非章安疏中不釋也又下文云諸小乘經多云白銀瑠璃漸漸互現等者準涅槃疏引長阿含及樓炭經云瑠璃白銀作月天子所居月以三事故減一者角行二者侍臣形服如瑠璃色在月之前三者以日光照之又以三事故增反上可知又云從初一日至十五日出白銀面從十六日至三十日出瑠璃面故有增減也又云黑衣侍臣從初一日已來漸退故增從十六日以去漸侍故減也。",
    "X28n0586_013:0400b18_0": "安世高",
    "X28n0586_013:0400b19_0": "安息國王之太子也名清字世高常嗣王位乃讓與叔而自出家經遊此方翻傳三藏。",
    "X28n0586_013:0400b21_0": "十四難",
    "X28n0586_013:0400b22_0": "大論云一世界及我常二世界及我無常三世界及我亦常亦無常四世界及我非有常非無常五世界及我有邊六世界及我無邊七世界及我亦有邊亦無邊八世界及我非有邊非無邊九死後有神去後世十死後無神去後世十一死後亦有神去後世亦無神去後世十二非有神去後世非無神去後世十三神異身十四身異神又下文云講者私解者私字誤也應作和字道雖無言由言證道故解其言不違於道是以講者和解為義也又云夢見一人者夢見一人被甲冑手報金剛杵碎一切山後立一山邊夢覺問夫夫云汝所懷者破一切論師唯不勝一人當為弟子即舍利弗為佛弟子也又云一切論可破等者等即等於一切法不忍也忍即安義言一切法我皆能破使不得安也又下文云三無為者今更引之虗空無為以無礙為性由無障故色於中行擇滅無為擇者慧也由慧簡擇四聖諦故滅者涅槃不生名之為滅非擇滅無為言當生者當來生法緣會則生闕緣不生於不生時得非擇滅此非擇滅礙當生法令永不起名畢竟礙言別得者謂非擇滅有實體性闕緣位中起別得得故非擇滅得不因擇但由闕緣名非擇滅如眼與意專一色時餘不見聞等色聲香味觸落謝過去畢竟不得起得非擇滅名也今云二類不同及所證位更請詳之。",
    "X28n0586_013:0400c22_0": "優陀那風觸七處",
    "X28n0586_013:0400c23_0": "優陀那此云丹田也臍中風也又云中也頂齗齒脣舌喉胷名為七處也又上文云四大種者婆沙云大而是種故云大種如言大地及大王等能增能減能益能損是為種義體相形量徧諸方域能成大事是為大義言四微者色香味觸是四細色共成報身故云四微為地等四之所造故聲非報法不恒有故所以不論四微是能生四大是所生言縹色者縹匹妙切青白色也法界次第中作彯字即縹畫之色也。",
    "X28n0586_013:0401a08_0": "皆生濡毳細毛以自溫",
    "X28n0586_013:0401a09_0": "濡音儒若作渜乃管切毳此芮切亦楚稅切尚書云鳥獸氄毛氄而隴切鳥細毛也孔安國注云鳥獸皆生耎毳細毛以自溫焉若依孔注則今濡字應改為耎字也若從尚書濡字應改為氄字也。",
    "X28n0586_013:0401a13_0": "聶",
    "X28n0586_013:0401a14_0": "尼輙切。",
    "X28n0586_013:0401a15_0": "龍樹不任為師知復師於誰乎",
    "X28n0586_013:0401a16_0": "楞伽經中佛告大慧如來滅度後未來當有人於南天國中有大德比丘名龍樹菩薩能破有無見為人說我乘大乘無上法證得歡喜地往生安樂國故知龍樹佛之所記今家承稟深順聖心他宗若云龍猛但說空法不談中者應以論文即空即假即中難之又下文引俱舍云由即六識身等者順正理論云即六識身無間滅已能生後識故名意界無間滅者為遮前念有間滅心雖先開避而未生故由此無間已滅六識為現識依說為意界。",
    "X28n0586_013:0401b01_0": "大經十一空二十空",
    "X28n0586_013:0401b02_0": "內空外空內外空有為空無為空無始空性空無所有空第一義空空空大空此即十一空也撿大經二十空未見又下文云法正人邪名同義異者若淮章安涅槃疏意是則今文見者引論以證己執豈非須約定性四句名為戲論而消之耶若諸文中所引以明圓妙境觀斯乃約於假名四句故不同今見者所引以證己報也。",
    "X28n0586_013:0401b09_0": "具如釋籤中引",
    "X28n0586_013:0401b10_0": "云何知食謂摶等四食云何知食集謂若當來與愛喜貪但云何知食滅謂如實知當來有憂喜貪俱彼彼樂著無餘斷捨吐盡離欲滅息沒云何知食滅道謂八支道又下文云經中鳩槃荼下別譬見惑者誤也應云處處皆有魑魅魍魎是總譬五利夜叉惡鬼下是別譬五利也又引玉篇云山神為魑魅者文句記中但云魑魅者物之精也又引通俗文云山澤之怪也則不見引玉篇之文況玉篇中亦無此說又下文云而不明破深淺者破字當為判字又下文云不字加點如贅生疣者應云如肉生贅如肉生疣也疣贅縣附於肉故也。",
    "X28n0586_013:0401b21_0": "吃",
    "X28n0586_013:0401b22_0": "居乙切。",
    "X28n0586_013:0401b23_0": "艾",
    "X28n0586_013:0401b24_0": "五蓋切。",
    "X28n0586_013:0401c01_0": "錔",
    "X28n0586_013:0401c02_0": "他合切器物錔頭者也。",
    "X28n0586_013:0401c03_0": "疣",
    "X28n0586_013:0401c04_0": "羽求切。",
    "X28n0586_013:0401c05_0": "贅",
    "X28n0586_013:0401c06_0": "之芮切。",
    "X28n0586_013:0401c07_0": "&#;淰",
    "X28n0586_013:0401c08_0": "汝減切濁也水無波也又乃玷切水流也又式荏切水動之謂也又淰之言閃也。",
    "X28n0586_013:0401c10_0": "襵牒",
    "X28n0586_013:0401c11_0": "上之涉切記中作攝[衣-〦+蓻]者攝應作襵若準爾雅音中攝之涉切褻應作褺徒恊切正作摺疊。",
    "X28n0586_013:0401c13_0": "貲",
    "X28n0586_013:0401c14_0": "應作訾子移切訓量也計也無訾即是不可量度其數量也。",
    "X28n0586_013:0401c16_0": "越濟",
    "X28n0586_013:0401c17_0": "僧祇律云佛住舍衛有人食前著沙門標幟入聚落乞食食後著外道標幟入林中佛言此越濟入捨外道入沙門捨沙門入外道不應與出家餘之事迹略如前文已引。",
    "X28n0586_013:0401c21_0": "氂",
    "X28n0586_013:0401c22_0": "應作[氂-未+牛]十毫曰氂。",
    "X28n0586_013:0401c23_0": "餘皆粟散",
    "X28n0586_013:0401c24_0": "或云取數之眾多故云粟散即諸經中諸小王是也或云如人把粟散置盤中各得分位喻王亦爾。",
    "X28n0586_013:0402a02_0": "當此周昭王甲寅之歲",
    "X28n0586_013:0402a03_0": "淨名疏云周時佛興星隕如雨按此乃是周魯二莊之時非昭王之歲也三寶錄云周第十九主莊王十年即魯春秋莊公七年夏四月辛卯夜恒星不現夜中星隕如雨先賢諸德推佛生年互有遐邇依法顯傳側當殷世武乙二十六年甲午依法尚師答高句麗國問則當周第五主昭王二十四甲寅則穆王傳云穆王聞佛出乎迦維遂西游不反依像正記則當周第十七主平王四十八年戊午依後周沙門道安用羅什年紀及石柱銘則當周第十八主桓王五年乙丑依趙伯休梁大同元年於盧山遇弘度律師得佛滅後眾聖點記則當周第二十九主貞定王二年甲戌又文選王簡栖頭陀寺碑云周魯二莊親昭夜景之鑑漢晉兩明並勒丹青之飾今文云昭王自是一說耳又下文云老在桓王之年託[半*ㄆ]母者恐誤也老子是定王丁卯十二年二月十五日生也[半*ㄆ]應作牧桓王至定王中間自有大王即莊僖惠襄項匡也。",
    "X28n0586_013:0402a20_0": "柱下書史漆園吏",
    "X28n0586_013:0402a21_0": "侍御史於周為柱下史而老子甞為之一名柱後史謂以鐵為柱言其審固不橈也秦時張蒼為御史主柱下方書方者板也謂事在板上也又云四方文書也謂習天下阿書計史籍也史記列傳云老子楚苦縣厲鄉曲仁里人也苦縣屬陳國姓李名耳字伯陽諡曰聃周守藏室之吏也莊子蒙縣人也名周周甞為蒙漆園吏蒙縣屬梁國。",
    "X28n0586_013:0402b04_0": "嚴觀法師與何承天論中邊事如釋籤",
    "X28n0586_013:0402b05_0": "宋朝慧觀慧嚴二法師與此土太史官何承天論中邊之國嚴觀乃引周公土圭測景之法以一尺五寸土圭用測日景夏至之日猶有餘陰天竺此日則無餘陰準此而知地上寸景天上萬里故佛生處乃中國矣。",
    "X28n0586_013:0402b10_0": "天竺身毒印度並梵音",
    "X28n0586_013:0402b11_0": "印度此云日月日月照明也良以彼土為中聖賢間出以其道法開悟於人如其日月而照明耳身毒毒音篤餘如玄義補注中示。",
    "X28n0586_013:0402b14_0": "卍",
    "X28n0586_013:0402b15_0": "音萬原夫萬字是吉祥有右旋之相近人定右遶亦準此字定其是非亦有處作卍華嚴音義云卍字本非是字大周長壽二年主土權制此字著於天樞音之為萬謂吉祥萬德所集也若西域萬字元作此[歹*ㄙ*ㄙ]字也。",
    "X28n0586_013:0402b20_0": "乘壞板車出關西",
    "X28n0586_013:0402b21_0": "秦地西有隴關東有函谷關劉向七略云公孫龍持白馬之論以度關關令內傳云周時老子之度關關令尹喜先勅門吏云今日若有先翁從東來乘青牛薄板車勿令過也是日果見老子乘青牛車欲度關乃為尹喜說五千言道德二篇。",
    "X28n0586_013:0402c02_0": "手把十文足蹈二五",
    "X28n0586_013:0402c03_0": "老子中台等經云老子黃色廣顙長耳大目疎齒厚脣手把十字之文脚蹈二五之晝應知老子雖有此相但為人間之異皃非是聖者之奇姿豈得輙與出世法王無量妙相而為比挍哉。",
    "X28n0586_013:0402c07_0": "化胡經",
    "X28n0586_013:0402c08_0": "晉時道士王符所撰文有一卷後人添成十一卷余曾讀之其間倒錯訛偽不可備舉斯蓋人情謬撰惑亂正真也老子只有五千言為道德二篇其餘經者盡是三張而下諸道士輩妄自述成具如破邪辨正等論委破虗妄古者沙門釋子稱為道士而今黃巾竊呼之也晉沙門帛遠字法祖平昔甞與祭酒王符事邪王浮屢屈嗔不自忍乃作老子化胡經誣謗佛法後帛法祖卒少時有人姓李名通死而更蘇云見祖法師在閻王處講首楞嚴經講竟應往忉利天又見祭酒王符次被杻械求祖懺悔斯乃偽撰殃有所歸是故死後方生悔耳宋傳云唐中宗勅斷道家化胡經不許流行又云佛授記寺玄嶷姓杜氏黃冠之侶推其出類為洛都大恒觀主游心七略得理三玄時天后心崇釋氏玄嶷乃悟食蓼非耳願反初服向佛而歸遂求剃落詔許度之住佛授記寺造甄正論斥其邪偽。",
    "X28n0586_013:0402c24_0": "贆",
    "X28n0586_013:0403a01_0": "必遙切。",
    "X28n0586_013:0403a02_0": "蜬五含反",
    "X28n0586_013:0403a03_0": "應云古含切又乎甘切爾雅音取乎甘切。",
    "X28n0586_013:0403a04_0": "界行界種",
    "X28n0586_013:0403a05_0": "若準法勝毗曇云經中佛說有七種使謂約界行種分別成九十八使謂貪使界分別為三種分別為五界種分別為十五慢及無明亦然瞋使界分別為一種分別為五疑使界分別為三種分別為四界種分別為十二見使界分別為三種分別為四行分別為四行種分別為十二身邊二見同見苦斷故為一種戒取見苦見道斷故為二種邪見見取為四種如是為十二使行界種分別為三十六使故有九十八也種謂煩惱種類界謂欲色無色界分行謂見道行思惟道行見道行有四即四諦之行也言五部者俱舍云即見苦所斷乃至修所斷是則見道所斷四諦下惑為四修道所斷惑為一合為五也婆沙問云此中言部欲顯何義答顯眾義如苾蒭部名苾蒭眾婆羅門部名婆羅門眾部眾郡聚名異義同亦如經云四部眾矣。",
    "X28n0586_013:0403a20_0": "以九治七具如禪門",
    "X28n0586_013:0403a21_0": "禪波羅蜜第九云如是六欲誑惑眾生若修九想對治則六欲除滅何者初死想破威儀語言二欲次脹想壞想噉想破形皃欲次血塗漫想青瘀想膿爛想多破色欲次骨想燒想多破細滑欲九想除雜欲及所著人相欲噉想散想骨想徧除人相欲言雜欲者有人皆著五事也人相欲者有人皆不著五事但著人相若男若女雖見上五事若不得所愛之人猶不染著若遇適意之人則能捨世所重頓亡身命無所著人者謂若無所著之人也今止觀中但明六欲且置第六雜欲良以雜欲皆著五事其意可見故不煩文耳今記文中第六第七引文多誤何者第六應云皆著五事第七應云不著五事但著人相若男若女雖得上六等又云令置總存別故但云六者亦誤也思之可見又下文云還精益壽者如黃巾輩教甄鸞大夫公以黃書合氣三五七九男女交接四日兩舌正對行道在於丹田若有行者度厄延年此文出在笑道論中又下文云有宗但十六至不別立者薩婆多宗唯十六天以梵輔無想無別處故若依經部約於身量立十七天以大梵梵輔身量別故若上座部約因果立十八天以梵王用無尋伺為因果無想以無心為因果也又云三有對者對是礙義此有三種一者障礙二者境界三者所緣言障礙者謂十色界自於他處被礙不生如手礙手言境界者如眼與色對等言所緣者謂心心所於自所緣餘如論文又下文云如禪門問彼無所有等者禪門云無所有處亦名少處亦名無想處亦名不用處不用內外一切境界也問有人云修無所有處取少識緣之入定如何答不然應捨一切但念無所有法名無所有耳而言少處者但意根對無所有法塵生於少處非是緣少識入定名為少也請以此等之文用消記中自見訛謬也。",
    "X28n0586_013:0403c05_0": "成由一念雜等",
    "X28n0586_013:0403c06_0": "俱舍頌云先修雜第四成由一念雜由雜修五品生有五淨居論云諸欲雜修四靜慮者必先雜修第四靜慮如是雜修諸靜慮是阿羅漢或是不還彼必先入第四靜慮多念無漏相續現前從此引生多念有漏後復多念無漏現前如是旋還後後漸減乃至最後二念無漏次引二念有漏現前無間後生二念無漏名雜修定加行成就次後唯從一念無漏引起一念有漏現前無間復生一念無漏如是有漏中間剎那前後剎那無無漏雜故名雜修定根本圓成前二剎那似無問道第三剎那似解脫道由雜熏修第四靜慮有五品故淨居唯五何謂五品謂下中上上勝上極品差別故此中初品三心現前便得成滿謂初無漏次起有漏後起無漏第二品六第三品九第四品十二第五品十五。",
    "X28n0586_013:0403c21_0": "挾熏禪",
    "X28n0586_013:0403c22_0": "挾應作夾古合切作挾音恊耳涅槃釋文云此有二解一數人云兩無漏夾熏一有漏心二論人云以慈悲心而熏此定也。",
    "X28n0586_013:0404a01_0": "甑",
    "X28n0586_013:0404a02_0": "子孕切。",
    "X28n0586_013:0404a03_0": "無色有色無色具如釋籤",
    "X28n0586_013:0404a04_0": "華嚴云菩薩鼻根聞無色界宮殿之香中陰經云如來至無色界無色界諸天禮拜世尊仁王經中列無色界天眾涅槃經說無色界色非諸聲聞緣覺境界阿含經云佛將涅槃無色界天淚下如雨大眾部說無色界有細色但無麤色故云無色耳婆沙論中毗婆闍婆提說天色界有色育多提婆說無色界無色。",
    "X28n0586_013:0404a11_0": "立世",
    "X28n0586_013:0404a12_0": "立世阿毗曇也。",
    "X28n0586_013:0404a14_0": "天台三大部補注卷第十三"
}