{
    "X29n0594_001:0001a04_0": "法華經疏義纘目次",
    "X29n0594_001:0001a06_0": "卷第一",
    "X29n0594_001:0001a07_0": "序品第一",
    "X29n0594_001:0001a08_0": "卷第二",
    "X29n0594_001:0001a09_0": "序品之餘",
    "X29n0594_001:0001a10_0": "卷第三本",
    "X29n0594_001:0001a11_0": "序品之餘(釋別序)",
    "X29n0594_001:0001a12_0": "卷第三末",
    "X29n0594_001:0001a13_0": "方便品第二",
    "X29n0594_001:0001a14_0": "卷第四",
    "X29n0594_001:0001a15_0": "譬喻品第三信解品第四",
    "X29n0594_001:0001a16_0": "藥草喻品第五授記品第六",
    "X29n0594_001:0001a17_0": "化城喻品第七",
    "X29n0594_001:0001a18_0": "卷第五",
    "X29n0594_001:0001a19_0": "化城喻品之餘五百弟子品第八",
    "X29n0594_001:0001a20_0": "授學無學品第九法師品第十",
    "X29n0594_001:0001a21_0": "寶塔品第十一達多品第十二",
    "X29n0594_001:0001a22_0": "持品第十三安樂行品第十四",
    "X29n0594_001:0001a23_0": "涌出品第十五壽量品第十六",
    "X29n0594_001:0001a24_0": "卷第六",
    "X29n0594_001:0001b01_0": "分別品第七隨喜品第十八",
    "X29n0594_001:0001b02_0": "法師功德品第十九不輕品第二十",
    "X29n0594_001:0001b03_0": "神力品第二十一囑累品第二十二",
    "X29n0594_001:0001b04_0": "藥王品第二十三妙音品第二十四",
    "X29n0594_001:0001b05_0": "觀音品第二十五陀羅尼品第二十六",
    "X29n0594_001:0001b06_0": "妙莊嚴品第二十七普賢品第二十八",
    "X29n0594_001:0001b07_0": "跋",
    "X29n0594_001:0001b09_0": "法華經疏義纘目次(終)",
    "X29n0594_001:0001b15_0": "天台法華疏義纘卷第一",
    "X29n0594_001:0001b17_0": "東春沙門　智度　述",
    "X29n0594_001:0001b18_0": "釋此經題五門分別謂名體宗用教相初名者是總體宗用是別雖有體等名為妙故別即總雖是一妙名而具體等三故總即別別別於總總總於別俱名妙法也玄文寄教約行者辨其次第耳序品云以是知今佛欲說法華經是名助發實相義是體雨法雨是宗斷三乘疑悔是用此約尋名得體證體須宗了極有用用即斷疑此從自行辨次第也神力品寄教者文云如來所有一切諸法是名自在神力是用祕要之藏是體甚深之事是宗此約化他門故用居第二令他得體證體須宗故云寄教也一釋名二辨體三明宗四明用五判教。",
    "X29n0594_001:0001c05_0": "初釋名者夫名者原聖建名蓋為開深以進始咸令視聽俱得見聞尋途趣遠而至於極故以名名法施設眾生此從俗諦以立名也肇云名無召物之功物無應名之用蓋從真諦釋也道場觀云應物說三三非真實終歸其一謂之無上無上是妙引經云是乘微妙清淨第一又云寄言談於象外而其體絕精麤所以稱妙光宅云妙者一乘因果法也待昔因果各有三麤今教因果各有三妙已上敘舊訖(云云)次今正解先法次妙此從義便文云我法妙難思若從名便先妙次法今從義便故先解法所言法者有三種一眾生法二佛法三心法言眾生者經云為令眾生開示悟入佛之知見若眾生無佛知見何所論開當知佛之知見蘊在眾生即眾生法妙之文也二佛法妙者如經止止不須說我法妙難思佛法雖多不出權實又云是法甚深妙難見難可了一切眾生類無能知佛者即實智妙也及佛諸餘法亦無能問者即佛權智妙此二法唯佛究盡是佛法妙也三心法妙者如安樂行云在於空閑處修攝其心又觀一切法空如實相等是心法妙也雖有此三只是一法故云心佛及眾生是三無差別(略釋法竟)。",
    "X29n0594_001:0002a01_0": "次釋妙字者又二初約待絕二妙次約迹本二門各十妙初二妙者一相待妙二絕待妙言相待者待昔半字為麤明今滿字為妙他有五對一自行名半雙利名滿二生空理名半法空理名滿三生空智名半法空智名滿四煩惱障名半所知障名滿五分段名半變易生死名滿亦是常無常大小相待為麤妙也文云昔於波羅奈轉四諦法輪分別說諸法五眾之生滅今復轉最妙無上大法輪即是待鹿苑麤為法華妙也二絕待是無分別即邊而中無非佛法亡泯清淨豈更佛法待於佛法如來法界故出法界外無復有法可相形比待誰為麤形誰為妙能所俱絕文云止止不須說我法妙難思妙悟之時洞知法界無法可論今言絕者約有門明絕也此絕亦絕約空門明絕也是名絕待妙用此二妙妙上三法各具二妙廣如玄文(云云)問何意以絕釋答只喚妙為絕絕是妙之異名如人稱絕能耳又妙是能絕麤是所絕此妙有絕麤之功故舉絕以名妙也(釋絕待一妙訖)。",
    "X29n0594_001:0002a18_0": "次釋迹本二門各十妙初迹十妙者一境二智三行四位五三法六感應七神通八說法九眷屬十利益言境妙者文云唯佛與佛乃能究盡諸法實相諸法是權境實相是實境也言智妙者文云我所得智慧微妙最第一又云以此妙慧求無上道言行妙者文云本從無數佛具足行諸道行此諸道已道場得成果也言位妙者文云天雨四華表住行向地開示悟入乘是寶乘遊於四方即是因位直至道場即果位也言三法妙者文云佛自住大乘如其所得法定慧力莊嚴大乘即真性軌定是資成軌慧是觀照軌即三法妙也言感應妙者文云於三七日中思惟如是事又我以佛眼觀見六道眾生即感應妙也言神通妙者文云今佛世尊入于三昧是不可思議現希有事言說法妙者文云如來能種種分別巧說諸法言辭柔軟悅可眾心言眷屬妙者文云但教化菩薩無聲聞弟子言利益妙者文云藥王汝見是大眾中無量諸天龍王夜叉乾闥婆阿脩羅乃至聞妙法華經一偈一句一念隨喜者我皆與授記當得阿耨多羅三藐三菩提又云不令有人獨得滅度皆以如來滅度而滅度之即利益也廣如玄文(已上述門訖)。",
    "X29n0594_001:0002b14_0": "次本門十者一因二果三國土四感應五神通六說法七眷屬八本涅槃九本壽命十本利益彼釋有十門今但取引證一門以示其相言因者文云我本行菩薩道時所成壽命今猶未盡即本時行因妙言果妙者文云然善男子我實成佛已來無量無邊百千萬億那由他劫即本果妙也言國土者文云我於娑婆世界得三菩提教化示導是諸菩薩又云自從是來我常在此娑婆世界說法教化此之國土非復迹中娑婆即本國土也言感應者文云諸善男子若有眾生來至我所我以佛眼觀其信等諸根利鈍隨所應度此即本時照機之智是感應妙言神通妙者文云汝等諦聽如來秘密神通之力又中間文云或示己身或示他身等即本神通也言說法者文云阿逸汝當知是諸大菩薩從無數劫來修習佛智慧悉是我所化令發大道心即本說法妙也言眷屬妙者文云是諸菩薩身皆金色三十二相無量光明先盡在娑婆世界之下此界虗空中住此等是我弟子我從久遠來教化是等眾即本眷屬妙也言涅槃者文云於是中間我說燃燈佛等又復言其入於涅槃又云今非實滅度而便唱言當取滅度中間既唱涅槃例本亦有涅槃即本涅槃妙也言壽命妙者文云自說名字不同年紀大小年即壽命大小即長短常無常也中間既爾本壽亦然即本壽命妙也言利益者文云以種種方便說微妙法能令眾生發歡喜心即中間利益例本亦然(釋本門於是訖)。",
    "X29n0594_001:0002c15_0": "次釋蓮華者為四一定法譬二引舊釋三出經論四正解言定法譬者一云權實難顯借喻蓮華譬於妙法又七喻文多故以譬標題又解蓮華非譬當體得名類如劫初萬物無名聖人觀理准則作名如蛛羅引絲倣之結網蓬飛獨運依而造車浮查汎流依而立舟鳥跡成文依而寫字皆法理制事耳今蓮華之稱非是假喻乃是法華法門清淨因果微妙名此法門為蓮華即是法華三昧當體之名非譬喻也此二解皆有理今融二意若定是法蓮華法則難解故借外蓮華為喻若利根即名解理不假譬喻但作蓮華之解中下未悟須譬乃知以易解之蓮華喻難解之蓮華故有三周說法逗上中下約上是法名約中下是譬名三根合論雙標法譬如此解者與誰為諍。",
    "X29n0594_001:0003a04_0": "二引舊解叡師序云未敷名屈摩羅將落名迦摩羅處中盛時名芬陀利遠師云芬陀利伽是蓮華開發然體逐時遷名隨色變故有三名如大經亦云人中蓮華芬陀利華二名並題者應有通別之異今取蓮華是通芬陀利是別稱也道朗云翻為白色或翻為赤色或翻為最香如此皆開盛之義光宅云餘華華果不俱譬餘經偏明因果此蓮華華果必俱譬此經雙辨因果(已上引舊訖)。",
    "X29n0594_001:0003a12_0": "三引經論初引法華論十七名中第十六名妙法蓮華論自解此名有二義一出水義以不可盡出離二乘泥濁水故復有義如彼蓮華出於泥水喻諸聲聞入如來大眾中坐如諸菩薩坐蓮華上聞說如來無上智慧清淨境界證如來密藏故二華開者眾生於大乘中其心怯弱不能生信是故開示諸佛如來淨妙法身令生信心故今解論意若言眾生見淨妙法身者此以妙因開發為蓮華也若言入如來大眾中坐蓮華上者此以妙報國土為蓮華也何者盧舍那佛處蓮華藏海共大菩薩即妙國土為蓮華彼論望今十妙乃是行位兩妙耳次引大集云憐愍為莖智慧葉三昧為鬚解脫敷菩薩蜂王食甘露我今敬禮佛蓮華若依大集行位因果為蓮華菩薩處上即是因華禮佛蓮華即是果華故知因果依正悉是蓮華之法何須譬顯為鈍人者不解法性蓮華故舉世華為喻亦應無妨(已上引經論訖)。",
    "X29n0594_001:0003b04_0": "四正解云此蓮華華果俱多可喻因含萬行果圓萬德故以為喻又解云蓮華麤喻九界十如因果此華妙喻佛界十如因果此從相待得名又解此華喻佛界本迹兩門各有三喻言迹三者一華生必有蓮而蓮不可見喻約實明權意在於實無能知者文云我意難可測無能發問者二華開蓮現而須華養蓮喻權中有實而不能知今開權顯實意在於權三華落蓮成喻廢三顯一唯一佛乘直至道場菩薩有行行見不了了如華開諸佛以不行故見則了了如華落蓮成(迹門)又三譬本門者一華必有蓮喻迹必有本迹含本意在於本雖在於本佛智難知彌勒不識二華開蓮現喻開迹顯本意在於迹能令菩薩識佛方便既識迹已還成於本增道損生三華落蓮成喻發迹顯本既識本已不復迷迹但於法身修道圓滿上地(此本門訖)。",
    "X29n0594_001:0003b19_0-0": "次釋經字者是通名也具存梵音應云薩達磨分陀利修多羅薩翻云妙或云正法護云正羅什云妙正語通漫妙異諸經故翻為妙也達磨翻法分陀利蓮華新云奔荼利迦者白蓮華也西域呼白蓮華為分荼利迦故新經說青黃赤白四色蓮華云嗢鉢羅華[牛*句]其陀華鉢特摩華奔荼利迦華如次配青黃赤白四色若爾白為眾色本喻一乘為三乘本青黃赤三應喻三乘三乘即應體內方便是故不可蓮者芙蕖之實華者花也(音呼瓜反)",
    "X29n0594_001:0003b19_0-1": "華美也修多羅或云修單那蘭多或云修妬路新云素怛覽彼方楚夏此土翻譯不同或云無翻或云有翻言無翻者彼語多含此語單淺不可以單翻複應留本音而言經者開善云非正翻也此間聖說為經賢說為子史佛經聖說稱修多羅菩薩稱論既不可翻宜以此代彼故稱經也既不可翻而含五義一法本亦云出生二微發亦云顯示三涌泉四繩墨五結鬘只作五義不可翻今家又一中作三義一教二行三義本(云云)",
    "X29n0594_001:0003b19_0-2": "言教本者金口所說一言為本流出無量言教聞即得道言行本者示人無諍法導達通塞如教修行入清涼池故名行本言義本者尋一句詮於一義尋無量句詮無量義尋詮會入故名義本(釋法本三義訖)二微發者佛說言辭巧妙次第詮量初中後善圓滿具足如大海水漸漸轉深教行義(例上)三含涌泉者從喻為名佛四悉說法文義無盡法流不絕教行義皆如涌泉(云云)",
    "X29n0594_001:0003b19_0-3": "四含繩墨者佛以四悉正教行義之繩裁邪見教行義之木(云云)五含結鬘者結教行義如結華鬘令不零落世界悉檀結教不零落為人對治結行不零落第一義結義不零落(五義竟)又云經訓常解曰天魔外道不能改壞名為教常真正無雜名行常凝然不動名理常又訓法也法可軌為義即教行理皆可軌故不可翻二有翻者亦為五一翻為經經由為義由聖人心口故今亦教等為由(云云)",
    "X29n0594_001:0003b19_0-4": "二翻為契契緣契義(云云)三翻法本者即教行理等本(云云)四翻綖貫綖貫持教行理令不零落五翻善語教者教善行善理善(出有翻五義訖)上來初釋法字次妙字三蓮華字四經字總釋名竟。",
    "X29n0594_001:0004a06_0": "第二顯體者前釋名總說文義浩漫今須點理正顯經體直辨真性非無二軌欲令易解是故直說體者一部之指歸眾義之都會也非但會之至難亦乃說之不易玄有七門今引初門為顯經體又四意一出舊二論體意三正明體四引證言出舊者北地師用一乘為體此語奢漫(云云)又真諦為體此通小大又一因果為體今亦不用因果二法未免事廣敘(云云)二明體意者釋論云小乘經若有無常無我涅槃三法印即是佛說修之得道無是魔說也大乘經但有一法印謂諸法實相名了義經若無實相是魔說也今取實相為體也三正明體者三軌中真性十界中佛界四諦中無作四諦三諦中第一義諦二諦中真諦廣簡如玄義(云云)四引證者序品云今佛放光明助發實相義又云諸法實相義已為汝等說又云唯佛與佛乃能究盡諸法實相又云要當說真實又云為說實相印等(已上顯体訖)。",
    "X29n0594_001:0004a22_0": "第三明宗者修行之喉衿顯體之要奚如梁柱持屋結網綱維提綱則目動梁安則桷存以喻顯法准此可知故知宗是要義廣如玄文(云云)有云宗即是體今難云何者宗是因果因果為二體非因果體即不二體二非體不二非宗今正明宗者迹門開佛知見亦明弟子實因實果亦明師權因權果為明弟子實因因正果傍本門師弟亦有因果正明師果果正因傍故總因果為正宗也(云云)。",
    "X29n0594_001:0004b06_0": "第四明用者用是如來之妙能為此經之勝用如來以權實二智為妙能此經以斷疑生信為勝用迹門斷權疑生實信為用本門斷近疑生遠信為用故四章中名是總體宗用三是別開總出別境妙是體前四妙是宗後五妙是用宗中前三唯因位通因果三法唯果故前五妙佛乘因果為宗後五前三能化後二所化能所俱名為用合別入總即體宗用攝入名中俱得稱妙也廣如玄文(云云)。",
    "X29n0594_001:0004b14_0-0": "第五教相者若弘餘經不明教相於義無傷若弘法華不明教相者文義有闕但聖意幽隱教法彌難前代法師或祖承名匠或思出袖衿雖阡陌縱橫莫知孰是然義不雙立理無兩有若深存所以復與修多羅合者錄而用之無文無義不可信用今依南岳大師心有所證又勘同經論故天台述而從用也文為五餘四章不引如玄(云云)今初大意者又四初大意次藏部所攝三翻譯時代四教所被機初大意者佛於無名相中假名相說若說餘經各赴緣所益未明教意如說華嚴初逗圓別之機高山先照直明次第不次第修行地上之功德不辨如來說頓之意次說四含增一明人天因果中明真寂深義雜明諸禪定長明破外道不明如來曲巧施小之意次說方等折小彈偏歎大褒圓慈悲行願事理殊絕不明並對呵責之意次說般若論通則三人同入論別菩薩獨進廣歷陰入染淨虗融亦不明共別之意若涅槃在後略斥三修粗點五味亦不委說如來原始要終之意凡此諸經皆是逗會他意令他得益不談佛意意趣何之今經不爾絓是法門網目大小觀法種種規矩皆所不論為前經已說故今經但說如來布教之元始中間取與漸頓適時大事因緣究竟終訖若宿殖純者初即頓與直明菩薩位行功德言不涉小文云始見我身聞我所說即皆信受入如來慧等(云云)",
    "X29n0594_001:0004b14_0-1": "次其不堪者隱其神德以貧所樂法方便附近語令勤作文云我若讚佛乘眾生沒在苦如此之人應以此法漸入佛慧次既得道已宜須彈斥即如方等以大破小文云苦切責之已示以所繫珠次宜兼通半滿淘汰如大品遣蕩相著會其宗途文云將導眾人欲過嶮道次過此難已定之以父子付之以家業拂之以權迹(解云權是迹門三乘迹是本門之近迹)顯之以實本(解云實是迹門一乘本是本門之遠本)",
    "X29n0594_001:0004b14_0-2": "當知此經唯論如來設教大綱不委細網目(大意訖)。",
    "X29n0594_001:0004c22_0": "第二藏部所攝者大乘三藏中從開權顯實修多羅藏亦從開顯十二分教中廣分攝亦通十二(如玄文說法妙中說)第三翻譯時代如下調達品引前後六譯今是什公所譯(云云)第四教所被機者會權歸實唯一圓教逗佛乘機文云但教化菩薩無聲聞弟子(已上五章略示委相廣如玄文釋經題訖)。",
    "X29n0594_001:0005a04_0": "初文句者俱舍頌曰名身等所謂想章字總說論曰等取句身文身應知此中名謂作想如說色聲香味等想疏釋云名謂作想者由於色等立色等名合於色等起色等想名是想因名為作想此是因取果名說名為想詮法相狀義與想同故名為想梵云那(去聲)摩此云名是歸義赴義隨趣義謂音聲歸赴於法趣其自相內有異求表呼專一即歸之義由斯呼召能引自體梵云僧若(阿你反)此云想是能取像專執之義或是共契約之義釋云詮法相狀義與想同者名隨義變詮此詮彼種種不同想隨境變緣此緣彼相狀差別想取色像已而專帶色想名詮於色已亦永召色體(云云)梵云鉢陀此云迹如一象身有四足跡如一頌總四句成今就義翻名之為句梵云縛迦(去阿反)此云章是詮辨終竟義如說諸行無常等章直言諸行是名非句義未究竟故文云無常方成究竟故云詮義究竟名之為章若爾何故外典章句義別答詮義究竟名之為章詮義之中有廣有狹極狹名句廣名為章即於章中分其二義一句義二章義句義同章故名為章梵云便善那此云文是能彰顯義西方俗呼醬酢鹽扇等物為便善那以醬酢鹽等能顯於味扇能顯風故名便善那舊譯為味誤也以文顯故與名句為依(云云)。",
    "X29n0594_001:0005b02_0": "【記】云名詮自性句詮差別文即是字為二所依釋云所言名者諸法之名也一切皆有其名如色聲等言自性者即唯詮得共相之自性也如青黃方圓等並稱為色即共相也呼召色時表非聲等即自性也此是共相之自性若體性之自性者五塵為眼等五識現量所得名體性之自性色等體上之名但呼召時不得體體為身識所得是故名不能詮自性也名召得體喚火之時火應燒口故簡體性之自性也言句詮差別者如梵音斫蒭兩字但言斫唯言蒭未有所目若全言斫蒭詮於眼體是名分位雖名分位未有句分位更加阿薩利縛此言有漏即眼有漏是句差別又若言色無常簡非常色故云句詮差別也言文即是字者文謂文言體即是字依於字義立名句也如俗千文即千字耳如五言詩言即是文故文字言雖三其義一也為二所依者謂此文字為名句所依名句即能依也此二離聲無有別體五蘊所攝聲是色蘊攝名句文是行蘊收色是實有名等是假今言文句者以句而分經文故云文句從狹得名不言章也若准方便品法師品安樂行品壽量觀音等皆有義門並合名章疏等今準餘品多分科節故云句又言章者詩云彼都人士出言成章即六國時名彼都也西方呼此為文物國餘如記(云云)。",
    "X29n0594_001:0005b24_0": "次釋六難者準下歎法希有四難初二全引次二開傳譯等四難記中廣釋今更三門分別一人法釋初雙佛是人說是法次雙傳譯是法開悟是人三雙聞師講是人一遍記是法二通局釋初雙佛通通一代故法局局醍醐故次雙譯通通諸部故開悟局約四依故若所開悟大小法門洞朗何局之有第三雙聞講通通大眾故記局唯章安故三優劣釋於三雙中三隻屬人佛望大師及章安也佛是妙覺大師初依章安未入位以後後劣於前前餘三隻中各一隻是法初醍醐味故云佛說次傳譯及一遍記等並皆佛乘即無優劣縱傳譯通諸部皆佛說也記云廣狹恐未穩(思之)有云開聞法為自悟傳譯二難開能聽出聞講一遍記此各開未可豈聞而不聽耶(云云)。",
    "X29n0594_001:0005c13_0": "言佛出難者約機未熟使佛出難佛自在故豈有難易說是難亦爾言傳譯此難者有二一傳難歷涉山海傳來此土故云傳此難也二譯難者王臣敬信國無諸難善二方音始得譯梵為漢言也此又二義一是此土二是此經前後六譯故云此難也言開悟難者約觀行相似初依人開悟佛乘簡分真位也言聞講難者聞開悟講前後補接纔聞一遍故云難也言一遍記難者雖有不聽泰先已解梁攝論具明八識今於唯識不聽而講此不為難今章安一遍制立章疏善達五時明顯八教故云難也言修補難者問為是義難為是文難設爾何失二俱有過若言義難今了義經依文判義復有何難若是文難文唯開合何名為難答既言二十七聽六十九添削四十餘年緣差不遂名修補難於傳譯前加結集難者結集人和王臣敬信無諸魔外亦是難故記云八難也。",
    "X29n0594_001:0006a04_0": "【疏】添削者添破古人釋義及引經論不當欲斥非以顯是故名為添削者謂初聽未成文體今削文約而義豐故云削也。",
    "X29n0594_001:0006a07_0": "【疏】共期佛慧者自他名共所求名期覺了名佛簡擇名慧以實簡權以果簡因故名佛慧亦名根本智亦名如理智亦名一切種智唯識名根本攝大乘名如理智大論名一切種智皆是佛慧之異名今經名實智即開昔三教智慧為今經佛慧也。",
    "X29n0594_001:0006a12_0": "又義云階位者二序各五義名階位各具四悉也問通序記中通對四釋別序何故具通別二對耶答通序五事有通無別各具四釋不表四一故通無別別序表四一又通別二釋故不同也次義者謂次由述也。",
    "X29n0594_001:0006a16_1": "【記】釋云次通二別者次序唯在通序由述唯在別序。",
    "X29n0594_001:0006a18_0": "【疏】五事冠於經首次序者冠即是首首即初應云初序今云次者次正說後方有此序名經後序從遺屬故名首序從經後故名次序若云眾序之首是通途之次耳有云通由述者由阿難問佛述而安之名通由述此則不然不由阿難問故得說此經故不得為此經之由但述阿泥樓馱遣問不是今經之述故不得云述言二別者由述是別序不通於次若言次正說為次者與光宅逆順何殊但是通途為次耳故通別二序不合相濫(思之)疏疑念序記云雨兼通於由述望前現瑞生疑現瑞為疑念之由疑念為問由問為答由此即通途之由與光宅逆順相由何別故今疑念發問答問三序唯局於述故疏云問答釋疑述序也又學舍養宮者古謂學舍是養勝人之宮切韻云養老宮言序序者禮記云夏氏時養國老於東庠養庶老於西序堯時謂左序右序並非今意。",
    "X29n0594_001:0006b09_0-0": "次品者疏云跋渠此翻為品二十八品通釋一部名也有云三門分別一得名二廢立三次第生起初得名云二十八品總有四例一義為名有十五品二義為名有十品三義為名有一品不定為名有二品初一義名中又四例一從法為名有四品方便品信解勸持陀羅尼品二從喻為名有三品譬喻藥草喻化城喻品三從人為名有四品法師調達常不輕妙音品四從事為名有四品序品授記涌出囑累品次二義為名有十品於中三例一從人法為名有八品授學無學人記如來壽量法師功德如來神力藥王菩薩本事觀音普門妙莊嚴王本事普賢菩薩勸發品解曰學無學是人記法如來是人壽量法法師人功德法如來人神力法藥王人本事法觀音人普門法莊嚴王人本事法普賢人勸發法二能所為名有一品分別功德品分別是能功德是所三唯因為名一品隨喜功德是因也(他云通果)",
    "X29n0594_001:0006b09_0-1": "第三三義為名一品五百弟子授記品五百是數弟子是人受記是事第四不定為名二品一安樂行二見寶塔安樂是果行即通因果見是能見塔是所見亦通二義即在二義名中若安樂即行見即是現在一義名中故名不定二云廢立者調達囑累觀音偈如下對文中辨(云云)第三品次第者今疏隨文銷釋已有次第之意今向文前更重生起凡欲說法必先驚覺群情令其渴仰故先序品序品既訖次辯正宗正宗始指方便是真實故說方便品上根易悟領解述成授記不別開品故寄譬喻品之內明之中根之類雖聞法說由未能解不因曉訓無以解生故說譬喻品中根譬領佛譬故有信解品佛以譬述解故有藥草喻品堪與當果故有授記品下根之徒殊無憶想必假叮嚀之說要資鄭重之訓說過去結緣之始覺照其心述彼化城非實令歸寶所之大故說化城品高名之輩因說即解故領解述成文少寄授記中先陳高名當果之相故五百授記品下位亦歸次授學無學人記品三根並悟訖說利已周將使遠代同規歎人美法令弘大義故有法師品依法修學若法若人可師可軌故破小執而成大道令權旨已入真宗信學既稀歸宗亦鮮多寶現塔分身佛集勸長物信證說不虗故有見寶塔品雖他佛說證信此經未若自尊勸人歸仰故現身作國王為重此經於彼怨家作床求法亦顯經威廣大度龍宮眾極多法力速成化龍女以成道故有提婆達多品既現自他俱為保重聞經菩薩皆受教而願持故有持品末代行法多越軌模今示儀方令易宣暢故有安樂行品八恒菩薩聞妙道以願持佛時不許明己有弘者遂有六萬恒沙菩薩久離毀傷先願弘宣勸發時會故有從地涌出品已下諸品如疏次第(釋品題訖總釋品題竟)",
    "X29n0594_001:0006b09_0-2": "。",
    "X29n0594_001:0007a07_0": "第二依文又三初明分節經文二帖釋下明銷釋用義三序下依文解初文二初佛赴下明分節失次盧山下明處中分章初又二初佛赴下明不分次又佛下第二明分初又四初佛散華貫華下是佛不分次集者下是結集不分三論者下是菩薩不分四古講者下是古師不分初二如文三言論不分者論有三種一破執論中百是(今云通論不分章)二釋義論如智論釋大品經(今云別論不分章)三集義論如唯識對法等是廣集名數釋諸經故(亦名通論)此等三論不分節故云申之四古講者約人師不分如四子注淨名劉虬注法華皆亦不分章故云不識起盡(已上不分矣)次又佛下第二明分節又四初佛隨義立品是佛分次增一下結集三藏各有分節是結集人分三天親下明論者分節無著天親釋金剛經天親論釋涅槃經皆有分節四昔河西下是此土人分章有大過之失故總結云若過若不及也言增一至一分者此小乘三藏於中有三初釋名次佛說次第三結集次第初言契經者有翻家五名中二名也(如前云云)。",
    "X29n0594_001:0007b01_0": "【疏】阿含者秦言法歸法歸蓋是萬善之淵博弘富溫而珍廣明宣禍福賢愚之迹割判真偽異濟之源歷記古今成敗之數墟域二儀品物之倫道無不由法無不歸譬彼巨海百川所歸故目法歸為名。",
    "X29n0594_001:0007b04_1-0": "言律一分者別有四名一名毗尼二名木叉三曰尸羅四名律言毗尼者梵音此云滅外國說滅凡有三種一涅槃二尼留陀謂四諦中滅諦三曰毗尼問此三何別答若通論之體一名異其由眼目耳若別分之非無差別別相如何涅槃尼留當體立稱此二又二所滅不同如涅槃云諸結火滅名為滅度此是尼留陀滅離諸覺觀稱曰涅槃二通局有異涅槃之滅偏據滿處尼留陀滅義通因果是故滅諦滅皆收隨別滅說為涅槃通相之滅名尼留陀約對品異名為事別滅靜妙離四義通宣名為通滅若論毗尼體非是滅有為行德能有所滅故稱為滅有能證得寂滅之果故稱為滅問何故戒行名曰毗尼有此兩義一者戒行能滅業非故稱為滅二能得究竟滅果故說為滅問何故律教得名毗尼答有二義一能詮毗尼二能生行德今從所生故稱毗尼二言木叉者此名解脫解脫有二一無為二有為無為解脫直名木叉有為解脫名毗木叉故相續解脫經說涅槃解脫名為木叉五分法身解脫名毗木叉問何故戒行為解脫答有二義一者戒行能無業羇故名為波羅提木叉也二者能得解脫果故稱為解脫問何故律教名為解脫答有二義一能詮於解脫行法故名解脫二能生於解脫行德故名解脫三名尸羅者此名清涼亦名戒三業炎火焚行人事等如禁戒能防息故號清涼清涼之名正翻彼也以能防禁故名為戒問何故律教名之為戒答有兩義一詮戒故二能生戒故四言律若有二義一就教論二就行辨若就教論詮量名律者就行辨調伏名律毗尼之教詮此律行故稱為律。",
    "X29n0594_001:0007c08_0": "【疏】五部律者曇無德部四分律薩婆多部十誦律彌沙塞部五分律迦葉遺部解脫律(此有戒本)婆麤富羅部律本未來至此依大集分別八十誦者即根本僧祗律部言八十誦者優婆離一夏八十度昇堂誦出。",
    "X29n0594_001:0007c12_0-0": "言毗曇一分者別有四一名優婆提舍二名毗曇三名摩德勒伽亦名摩多羅迦此正一名傳之音異四曰摩夷優波提舍此正名論論諸法也言阿毗曇者此方正翻無比法阿之言無毗言比也曇摩中毗曇最為分別中勝故曰無比言就行者毗曇詮慧慧行最勝故曰無比毗曇之教詮此勝慧故名無比又能生無比之智故曰無比言摩德勒伽此方正翻名行境界辨障行義起行所依名行境界言摩夷者此名行母辨詮行法能生行故為行母與前境界其義相似西域記云健馱羅國迦膩色迦王以如來涅槃之後第四百年每習佛經日請一僧入堂說法而諸異義部執不同王用深疑無以去惑時脇尊者曰如來去世歲月逾邈弟子部執各據見聞因此感傷謂尊者曰去聖雖遠由為有幸敢忘膚鄙紹隆法教隨其部執具釋三藏乃至遠近召集聖哲於是四方輻湊萬里爭馳七日之中四事供養恐其諠雜白諸僧曰證聖果者住具結者還無學住未者還乃至內窮三藏外達五明者住未者還等得四百九十九人王與羅漢建立伽藍結集三藏欲作毗婆沙論是時尊者世友戶外納衣諸羅漢曰結業未除諍議乖謬爾宜遠迹友曰諸賢於法無疑代佛揚化方集大義欲制正論我雖不敏粗達微言乃至世友曰我顧無學其猶涕唾以至於此世友即擲縷丸空中諸天接縷丸而詣曰方證佛果次補慈氏三界特尊四生攸賴如何於此欲證小果時諸羅漢見此事已謝咎推德請為上座是五百賢聖先造十萬頌鄔波第鑠論(舊云優波提舍訛也)",
    "X29n0594_001:0007c12_0-1": "釋素怛攬藏(舊云修多羅訛也)次造十萬頌毗奈耶毗婆沙論釋毗奈耶藏(舊云那耶)後造十萬頌阿毗達磨毗婆沙論釋阿毗達磨藏(舊云阿毗曇藏也)凡三十萬頌六百六十萬言備釋三藏懸諸千古若准此意但是釋佛三藏故知論藏佛說問三藏名通大小乘何故以小為三藏耶答有二意一通大小各三二別小有三藏大無三藏何以得知大智度論龍樹釋云迦葉阿難於王舍城結集三藏為聲聞藏文殊阿難於鐵圍山集摩訶衍為菩薩藏又法華云不得親近三藏學者名習少乘為三藏學準驗斯文定知小乘備明三藏也(云云)",
    "X29n0594_001:0007c12_0-2": "次佛說教次第門一起說次第佛初成道第六七日仙人鹿苑為陳如等轉四諦法是故先明修多羅若依大乘第二七日宣說華嚴若依今經第三七日以為正說如下文(云云)依僧祇律五年已後廣制戒律依四分十二年後須提那廣制戒律故次第二明毗尼藏如來復毗舍離國因於跋耆諸比丘等本末因緣為比丘說第五怖畏法所謂殺生乃至飲酒故次第三明毗曇(上次第訖)",
    "X29n0594_001:0007c12_0-3": "第三明結集次第經論不同智論中明佛滅後迦葉先命阿難誦修多羅次憂波離誦出毗尼後令阿難誦出毗曇阿育王傳次第復異先令阿難誦修多羅第二迦葉自誦毗曇憂波離誦比尼五分律中先憂波離誦出毗尼次令阿難誦出修多羅後令阿難誦毗曇此隨傳不同耳故知論藏是佛說也。",
    "X29n0594_001:0008b14_0": "【疏】增一長中雜者言增一者從一增一乃至百法名增一二長者事義廣多名長也三中者其義不廣不略名中四雜者雜明義類故云雜言人天因果五戒十善為因感無記異熟果言破邪見者破九十五種外道之邪見言深義者斷三界惑盡證三無為名深義言禪定者四禪八定也問何故不八禪耶答色界具枝林功德即名禪各有一心支即名為定四空虗無枝林功德即名定不名禪也。",
    "X29n0594_001:0008b22_0": "【疏】天親至功德者七種成就解曰具足圓滿義次明序中具足七義七義圓滿餘經無故一序分成就者論云此法門示現二種勝義成就一者一切法門中最勝故二者持一切自在功德成就故如王舍城勝餘一切城舍故耆闍崛山勝餘山故二眾成就與大比丘眾下是論云有四種義一數二行三種功德四威儀如法住勝餘經故(云云)三如來欲說法時至成就為諸菩薩說大乘經下是先說無量義經具十七名勝餘經故四所依說法隨順威儀住成就佛說此經已結跏趺坐下是依止定器眾生三種法餘經無故解曰定三昧器是器世間眾生是眾生世間五依止說因成就爾時眉間光下是見能照之境所照等事生希有之心餘經無故六大眾現前欲聞法成就。",
    "X29n0594_001:0008c11_0": "爾時彌勒作是念下是雖問一人多人欲聞生希有心餘經無故七者文殊師利答成就文殊師利以宿命智現見過去因果相成就以十種事如現前是故能答餘經無故解曰十種事者論別釋十因成就(云云)七中分二初二通序後五別序。",
    "X29n0594_001:0008c16_0": "【疏】若過若不及者結前人師不分名不及末代尤煩即名若過。",
    "X29n0594_001:0008c18_0-0": "【疏】廬山下次明處中分文又二初諸師次天台初龍師有三節初序正流通初品為序次方便品至校量偈為正宗後盡經名流通次從序至法師品言方便等者明乘方便乘真實次從見塔品竟經為身方便身真實三從方便至安樂行者為因門從涌出訖經是果門今破云乘豈無身身豈無乘因豈無果果豈無因耶又導法師云二十八品分為二文初一品明如來起化由序餘二十七品辯其正化序品陳其始由正化明其利益訖至經末皆有益故(此師闕流通將流通益為正不可)",
    "X29n0594_001:0008c18_0-1": "稠禪師分三段有二意一者別約會三歸一為三初品名序分從方便品至分別功德品校量偈已來為正宗次從阿逸多若有聞佛壽命長遠下為流通分二者通就當時聞說悟解為三分第一序品為序分第二爾時世尊至普賢品云三千大千等具普賢道為經正宗正明當時說法曉悟時機第三從佛說是經時訖經為流通分也(此師由〔京〕南岳云云)關中云此經所明凡有三段一始於序品迄安樂行明三因為一因次從涌出迄囑累辨三果為一果從藥王下訖經明約三人為一人(因果偏云破如前)",
    "X29n0594_001:0008c18_0-2": "吉藏亦分三段初品名序從方便訖分別功德半品校量偈來凡有十六品半名正說從偈後盡經名流通就三段各開兩章初序二者一證信二發起正說二者從方便至法師明乘方便乘真實次從見寶塔至校量偈末明身方便身真實所以開此二者乘是所乘之法身是能乘人具此二門乘義乃足流通二者始從校量偈至神力品偈為讚歎流通次從囑累竟勸發明付囑累流通此與光宅二十四段離合為異光宅二序各五二正各四者嘉祥云前後兩段各開四別初文四者一從方便品盡偈是略開三顯一動執生疑二從爾時大眾竟身子三請第二段動執生疑由疑致請三從爾時世尊訖授學無學人記品七品半經是廣開三顯一斷疑生信段四法師一品是流通段次後經文四段者一從寶塔至安樂行品明法身果是序段二從涌出訖壽量明壽量果廣開近顯遠段三從分別品初至八世界發心是授記段四從佛說是諸菩薩得大法利時七瑞是領解段光宅二正各四與此相應但將迹門四品流通為本門序故不可也廬山印作四段分文一序品為序二從方便訖安樂行明開權顯實辯三一不二三從涌出訖功德校量偈來明開近顯遠辯長短不二四從偈後竟經為流通今疏云有人作四段是也問云何作三段說耶答有六義一聖人說法必有詮序深理化凡須驚耳目率爾而說不起敬心故在經初宜須置序既靜心信仰宜聞正宗授法次明正說群生無邊慈悲不止欲傳末代故有流通二者大智論云諸佛有三時利益一為菩薩時過去利益二成佛時現在益物三滅度後未來益物今序正現在益物流通未來益物三者序說發其信心正說生其智慧故佛法大海信為能入智為能度此二則能自行次令流通即是化他四者先聞如來正說入流凡有二種一者燃燈二者傳燈燃燈即是序正傳燈即流通五者三世諸佛凡有二種一受前佛付囑二者付囑後佛序正即受前佛付囑流通即付後佛即是紹隆三寶能使不絕六者經唯三分一者前方便是序說二者經體所謂正說三者經用明流通說問序中入定放光雨華動地是說之由漸何名為經答論云泥洹真法寶入有多門經陳受悟不同佛事非一或音聲或默然或光明或香飯皆能入道即六塵俱得為經也。",
    "X29n0594_001:0009c04_0": "【疏】天台等者次今師分文章安對古人稱天台也此地上應三台星彼山對之天者顛也顛者頂也台是星名。",
    "X29n0594_001:0009c07_0": "【疏】華嚴處處集眾者釋籤云舊經七處八會新譯更加普光明殿一會第一摩竭阿蘭若會第二摩竭熙連河曲普光明殿會第三忉利天會第四夜摩天會第五兜率天第六他化天第七重會普光明殿第八三會普光明殿第九逝多林會除四天王化樂天即四天並地居三處名七處並三會普光明殿名九會名處處集眾也。",
    "X29n0594_001:0009c14_0": "次帖釋文中【記】云況因緣語通者約十法界辨因緣故云始地獄終佛界中間八界即具十界各有感應因緣此十界中機發有漸頓不定三種若從地獄一有歷四教機名漸因緣若即悟圓名頓機若淺深前後得悟不同是不定機餘九界例然又若歷六道四聖入圓者是漸因緣若住一一界而入圓者是頓因緣若隨歷一一界或二三界即入圓者是不定因緣。",
    "X29n0594_001:0009c21_0": "【記】云大事四悉者四釋互通也大事因緣大事開顯大事本迹大事觀心即因緣攝四也開顯是教即開顯大事本迹觀心是教中攝四也本迹四者例云本迹大事本迹開顯本迹四也觀心者開顯。",
    "X29n0594_001:0010a01_0": "本迹等皆互相攝(思之)。",
    "X29n0594_001:0010a02_0": "【疏】慈善根力者修無緣慈不佳法相及眾生相乃至十二因緣七覺八正十力無畏諸佛神通無不皆以慈為根本乃至手出師子調伏醉象舉石空中力士驚怖現作莊嚴降諸外道令狂女又見是己子等並無緣慈力也。",
    "X29n0594_001:0010a07_0": "【疏】帖釋中記云設應雖眾不過於慈今云慈悲雖遍不過於應即對眾雖多不過於感其名則順(云云)。",
    "X29n0594_001:0010a09_0": "【疏】如華嚴偈者經云譬如貧窮人晝夜數他寶自無半錢分多聞亦如是譬如盲瞽人本習故能畫悅彼不自見多聞亦如是譬如聾騃人善奏諸音樂悅彼不自聞多聞亦如是。",
    "X29n0594_001:0010a13_0": "【疏】四示相中云且約三段等者記云種等三名三段今觀文意有二種三段一約三世二約序正流通而為種熟脫此等三種依序等三序等三依三世三於三世中聞序等三成種等三即因緣義也故疏云其間節節作三世九世此舉三世次云如是等此舉序等三也(思之)。",
    "X29n0594_001:0010a19_0": "【疏】令種佛道等者問既言因緣即具四悉若有第一義悉即名為脫何名為種耶答准下釋結緣眾中竪明住前三悉為結緣初住已上入第一義悉為當機即結緣[舄-臼+(血/?)]下種當機為得脫今以橫明結緣亦具。",
    "X29n0594_001:0010a23_0": "四悉故聞第一義亦名為種下皆例然。",
    "X29n0594_001:0010a24_0": "【疏】示教相記云教家之相名為教相者問教是名。",
    "X29n0594_001:0010b01_0": "句文如何名相答教即是相謂聲上屈曲名句文即名為教教詮於理是理家之相智能說我智是理家之相教寧非理家之相耶應云教即是相持業釋也教家之相依主釋其義稍疎又記云五味分別之醍醐相此二釋煩重失(云云)。",
    "X29n0594_001:0010b06_0": "【疏】九世者引華嚴第三十一云佛子有十種三世謂過去說過去過去說未來過去說現在未來說過去未來說現在未來說無盡現在說過去現在說未來現在說平等現在說三世平等彼經為成十句故又瓔珞俱翼天子問佛三世皆有諸佛不佛言汝問何等三世過去耶現在耶未來耶故疏三九世是也。",
    "X29n0594_001:0010b12_0-0": "【疏】楊葉等者大經第八云善男子云何名嬰兒行善男子不能起住來去語言是名嬰兒如來亦爾不能起者譬常德如來終不起諸法相謂不起中邊諸法之相不能住者喻淨德如來不著一切諸法謂生死涅槃也不能來者喻我德如來身行無有動搖不從淺至深動搖彼此不能去者如來已到大般涅槃不能語者喻樂德如來雖為一切眾生演說諸法實無所說記判是圓教也又嬰兒者名物不一未知正語雖名不一未知正語非不因此而得識物如來亦爾一切眾生種類各異所言不同如來方便隨而說之亦令一切因而得解記不判所囑今謂通於四教既云一切眾生方類與淨名一音隨類同又嬰兒者能說大字如來亦爾證於大字所謂婆和和者有為婆者無為是名嬰兒又和者名為無常婆者名為有常如來說常眾生聞已為常法故斷於無常是名嬰兒記判藏教有為半字無常之教是六度菩薩即和字也又嬰兒者不知苦樂晝夜親疎菩薩亦爾為眾生故不見苦樂是泯憂喜無晝夜想是齊明闇於諸眾生其心平等故無父母親疎者是等愛憎記判通教又嬰兒者不能造作大小諸事菩薩亦爾不造生死作業是名不作大事大事即五逆也小事者即二乘心菩薩終不退菩薩而作二乘是齊巨細記判別教又嬰兒者如彼嬰兒啼哭之時父母即楊樹黃葉而語之言莫啼莫啼我與金如來亦爾若有眾生欲造眾惡如來為說三十三天常樂我淨端正自資於妙宮殿受五欲樂乃至眾生聞如是樂故心生貪樂止不為惡記判人天也彼疏釋云楊樹喻妄常黃葉喻妄淨木牛木馬喻妄樂木男木女喻妄我(云云)",
    "X29n0594_001:0010b12_0-1": "。",
    "X29n0594_001:0010c16_0": "第三依文釋言序有通別者又二初辨通別次如是下釋初又四初標次從如是下列三通序下釋四通序為下辨離合初二如文三釋中又二初釋名次辨通局初言通者亦名證信序阿難稟承佛化欲以所聞傳之末代我從佛聞證成可信與傳經作末代之由非此經正說之由也名證信序言別序者亦名發起序佛將說經前且顯諸靈瑞發起所說與正說為由名發起序問何故二耶答由經二故問經止是一何曾有二答經雖一約時就人故得分二如來所說蓋在當時阿難所傳傳在末代對佛所說名發起對。",
    "X29n0594_001:0011a02_0-0": "阿難所傳名證信也又如來名經前阿難名經後又證信名遺教佛臨滅度遺言教置故言遺教也二通局者通別二序俱名證信齊號發起何者立序之意皆為生信故俱名證信同為發起正從經初號發起若望經後不名發起(云云)言局者阿難小聖懼人輕謗立序之意專為生信如來大聖人皆尊重立序之意多為發起四離合中為三一定句多少二明置序原由三立序所以一多少者關中五句合佛住處為一句釋立如是傳經者辭也所以經傳遐代休音不絕者有由而然也世有符印無開而不通經有五句印其首者亦令斯道無難而不通矣或六者天親燈論云前三明弟子後三證師說一切修多羅法門皆如是故知有六前三弟子者如是謂弟子之信次句弟子稱我聞三明聞法有時次從佛住已下既標於佛故知後三句證師說也或七未見所出(云云)",
    "X29n0594_001:0011a02_0-1": "第二置序原由者龍樹菩薩集法藏云傳者阿難見佛欲入涅槃心沒憂海阿泥樓馱謂阿難曰如來今日即有明日即無所有未了何不請問乃憂愁也即有四問一依何而住二依何修道三惡性依何擯治四一切經初皆安何等佛答依戒而住念處修道用梵檀治皆安如是對之可見問何故但四不多不少答攝義其足但立四句初是明其正行(是戒)次明正解(念處)三明治障之義修行之緣(惡性車匿用梵檀持)",
    "X29n0594_001:0011a02_0-2": "四明上三義必依聖教(一切經初皆具如是)第三立序所以即是文中四悉釋序所以也智論云如是我聞生信也信受奉行生智也信為能入智為能度信為入法之初基智為究竟之玄術信則所言之理順順則師資之道成由信故所說之法皆可順從由順從故說聽二途師資建立又華嚴云信為道源功德母(世界)生長無量之善法(為人)斷除一切諸起惡(對治)開發顯示無上道(第一義)",
    "X29n0594_001:0011a02_0-3": "。",
    "X29n0594_001:0011b08_0": "【疏】此皆因緣和合次第相生因緣是世界和合是為人次第是對治相生是第一義(云云)。",
    "X29n0594_001:0011b10_0": "【疏】如是者光宅云此是將傳所聞前題舉一部也如是一部經義親從佛聞即為我聞作挊胤耳有云呼轍(如記破之)智論云如是者信順之辭其信者是事如是不信者是事不如是(如疏引)經云如是者感應之端也如以順機受名是以無非立稱眾生以無非為感知來以順機為應故云如是又聖人說法但為顯如唯如為是瑤師云如是者將傳所聞之言於未聞良由善當其理不失機宜為如是梁武云如是者如斯之言是佛所說故云如是耳三藏云如是有三一就佛三世諸佛共說不異名如以同說故稱是二就法諸法實相今古不異名如如如而說稱是三就僧阿難與佛不異為如無非曰是(於三寶佛法與今二悉同僧與今藏教釋同)。",
    "X29n0594_001:0011b22_0": "【疏】大論時方者時謂一時方即住處人謂佛及阿難同聞眾等三事稱於五事所傳可信也。",
    "X29n0594_001:0011b24_0": "【疏】對破外道者今欲簡異故標五事在初即具三寶如是我聞是法寶佛是佛寶同聞眾是僧寶三寶最吉祥故我經初說阿漚(撿云云)。",
    "X29n0594_001:0011c03_0": "【記】云兼但至權實遠近者權實約四教三權圓實遠近約本迹釋法華經前體用明本迹無久遠本迹(有辭別云云)。",
    "X29n0594_001:0011c06_0": "【疏】一匙者記云因緣一釋為一匙今謂古師所解云一部經義親從佛聞名如是者如何分八教之別故云眾戶他不云因緣釋也(云云)。",
    "X29n0594_001:0011c09_0": "【疏】佛明即色是空等者肇論解云若如來者觀色空時應一心見色一心見空若一心見色則唯色非空若一心見空則唯空非色然則空色兩陳莫定其本也是以經云非色者誠以非色於色不非色於非色若非色於非色若非色者大虗則非色非色何所明若以色於色者則非色不異色非色不異色色即非色故知變即無明無明即變今解色有二種一質礙二非質礙虗空是無礙色餘是礙色皆即是空空是無漏故云即色是空。",
    "X29n0594_001:0011c18_0": "【疏】聞持和合者聞是所聞法體持是能持之人故名和合記解聞持二字唯屬能和合二字即通能所恐成曲巧謂和合二義一阿難與時眾和合二阿難能持至末世與機和合也。",
    "X29n0594_001:0011c22_0": "【記】云有人不許滅度後色經至改聞者聞說法聲通佛世及滅後若眼見經卷唯在佛滅後若唯名句行蘊所攝不許色聲色蘊所攝者經初皆改我聞後於行蘊故一字一聲二識不俱名句皆不成就。",
    "X29n0594_001:0012a02_0": "【疏】我是耳主者即第六識有分別俱生法我二執由第六執我令六識能聞故名為主望四緣名總也唯識具八緣(云云)。",
    "X29n0594_001:0012a05_0": "【疏】三摩耶是假者勝論外道執六句義於實句中有九法謂地水火風空時方我意九佛法破云離識之外皆是假無有其實體也。",
    "X29n0594_001:0012a08_0": "【疏】釋佛覺中云世出世總別相者約四諦中苦集是世道滅是出世各有總別行相苦諦四行苦行是總餘三是別集諦四行集行是總餘三是別是世間總別相滅道四行總別亦爾此出世總別也。",
    "X29n0594_001:0012a12_0": "【疏】老比丘像記云如止觀第六記(檢)。",
    "X29n0594_001:0012a13_0": "【疏】圓佛自覺覺他【記】止觀華嚴初住斷無明者檢小乘立二無知染汙無知無明為體者染汙有三種斷一自性斷謂對治道力捨彼得時名之為斷二緣縛斷謂望他身名緣縛斷斷緣他身生煩惱故三不生斷謂煩惱至不生位畢竟不生故言不染汙無知劣慧為體者謂無覆無記劣慧為體通四無記謂異熟威儀工巧通果也言味者諸法資味或苦等味言勢者(諸法損等勢力)熟者(諸法成就位)德者(德用)數者(一二等數)處者(近遠等處)時者(遠近等時)同者(相似)異者(差別)解曰法資味者如觀行者觀苦諦境起苦諦行相得苦味乃至緣道得道味或華藥等苦澀等味言勢者謂諸法損益者如甘草釋毒名益野葛殺人為損言熟者二義一所化根二華菓等言德者謂諸法所有作用如根取境刀割物等即習氣相應劣慧名不染無知如目連曾為獼猴今愛跳躑迦葉曾為樂人聞皷笛聲不覺起儛袖中彈指魔知嬈之化作樂人告迦葉曰我動音樂請尊者儛尊者云我老不能儛與汝唱歌歌曰我不求於陰界入無始時來虗妄法若有求於如是者是人終不得解脫魔聞此已忽然不現有二種斷一緣縛斷二不生斷二乘分斷佛全斷故。",
    "X29n0594_001:0012b09_0": "【疏】釋住中言三三昧是對治門者入空滅見入無願滅愛入無相滅無明也。",
    "X29n0594_001:0012b11_0": "【記】如止觀第七記者彼明道品能開三脫三脫開無漏無漏即三明引大論云不淨開身念處身念處開四念處四念處開道品道品開三脫三脫開涅槃即無漏故三脫望道品名近雖指此文對治義疎不如前解(思之)言聖住者會正之解名聖聖為人依名住亦可聖是依處故名聖住又聖者正也一理正二事正理則約實事則約世間順法也言梵住者淨行名梵梵為人依名住亦可聖人離次名梵梵所居處名梵住言天住者八禪之法故名為天天為人依名天住亦可聖人是淨天天所居處名天住也【記】問若爾今釋佛性何以約欲色二界及三果皆非佛住耶答從通趣別謂從廣之狹即欲色二界廣今王城狹二從勝以攝劣者謂佛所居勝餘人天名為勝此從人說名為勝也若從處說欲色即勝於王城。",
    "X29n0594_001:0012c01_0": "【疏】王舍城者西域記云矩奢揭羅補羅城(唐言上茅宮城)摩揭陀國之正中古先君王之所都多出勝上吉祥香茅崇山四周以為外郭西通峽徑北闢山門東西長南北狹周迴一百五十餘里內城餘址周三十餘里宮城東北行十四五里至姑栗陀羅矩吒山唐言鷲峯亦謂鷲臺舊云耆闍崛山訛也接北山之陽孤標特起既棲鷲鳥又類高臺空翠相映濃淡分色如來御世垂五十年多居此山廣說妙法其山頂則東西長南北狹臨崖西垂有甎精舍高廣奇製東闢其戶其南崖下有卛堵波昔在如來於此說法華精舍言王城者梵音曷羅闍姞利呬城(唐言王城)外郭已壞無復遺堵內城雖毀基趾猶峻周二十餘里西面有一門初頻婆娑羅王都在此上茅宮城也編戶之家頻遭火灾一家縱逸四隣罹灾防火不安其居王曰我以不德下民罹患修何德業可以攘之群臣曰大王德化邕穆政教明察細民不謹致此火灾宜製嚴科以清後犯若有灾起遷之寒林寒林者棄屍之所也既耻陋居當自謹護王曰善宜遍宣令於後王宮中先自失火謂諸臣曰我其遷矣乃命太子監攝留事故自遷焉時吠舍釐王聞頻婆娑羅王野處寒林整集戎旅欲襲不虞邊候以聞乃建城邑以王先舍於此故稱王舍又云王舍等者一是城處二是山處城是華處俗處處則寬廣山是野處道處處則狹小所以引處者吉云證成可信異外道故(云云)。",
    "X29n0594_001:0013a01_0": "【疏】仍說四非常偈者普明王歸國依七佛法請百法。",
    "X29n0594_001:0013a02_0": "師一日二時講說仁王般若第一偈云。",
    "X29n0594_001:0013a03_0": "　劫燒終訖訖坤洞燃　　須彌巨海都為灰揚　天龍福盡於中彫喪　　二儀尚殞國有何常第二師云。",
    "X29n0594_001:0013a06_0": "　識神無形假乘四蛇　　無眼保養以為樂車　形無常主神無常家　　形神尚離豈有國耶第三師云。",
    "X29n0594_001:0013a09_0": "　有本自無因緣成諸　　盛者必衰實者必虗　眾生蠢蠢都如幻居　　聲響俱空國土亦如第四師云。",
    "X29n0594_001:0013a12_0": "　生老病死輪轉無際　　事與願違憂悲為害　欲深禍重瘡疣無外　　三界皆苦國有何賴【疏】耆闍崛山者此云鷲頭山其形似鷲故名佛滅後阿育王見其山頭似鷲使人鑿之作兩翅兩足及尾故全如鷲鳥出陸澄地理記又多聖靈所居故名靈鷲亦名鷄足亦云狼跡增一云此山久遠同名靈鷲更有餘名汝等知不亦名廣普亦名白墡亦名仙人山山城相去凡十五里稠疏云其五山者一名鷲頭山此山高峻在城南二十五里二名王山在城西南去城百里三名耆闍崛山嶮峻故得名在城西四十里(釋論耆闍名鷲崛名為頭)四名崛山在西北去城八十九里五名小香山在城東去城一百五十里未知孰是(云云)問如來說法多以城山為會者何耶答注解云欲明華野兩存潛顯兼導教流皇屋之下理邈姑射之上此釋意初之兩句明如來慈悲普廣隱顯兼化華是城人之所居野是山神之所依如來說法兼化也下之兩句約所表皇屋天子所居顯處表教迹流行故云教流皇屋之下姑射山名隱處表教下之旨隱故云理邈姑射之上。",
    "X29n0594_001:0013b07_0": "【疏】天主穴者帝釋常居此山也蛇神穴準知。",
    "X29n0594_001:0013b08_0": "【疏】三陰如鷲者受是領納在色陰中想取相行造作亦依於色故鷲居山中也。",
    "X29n0594_001:0013b10_0": "【疏】鷲即聚集者三隱聚集如六度萬行即福德莊嚴也。",
    "X29n0594_001:0013b12_0": "【疏】像法決疑四見不同者準淨名疏四土相望不同一同居二方便三實報四寂光有十種差別相望名竪四教對四土名橫寶器喻土體飯色喻土用用有九種一同居自異二同居與方便不同三方便自異四方便與實報不同五實報自異六實報與下品寂光不同七與中品不同八與上品不同九諸土總對寂光不同十諸土非垢寂光非淨但明諸土之體故知體無淨穢隨機不同也今亦爾體用不二即非橫非竪。",
    "X29n0594_001:0013b21_0": "【疏】諸經多爾者從多分說聲聞在前若華嚴唯有菩薩無聲聞眾若炬樓王經利體經大五濁經等先列菩薩後列聲聞從德大小明先後也。",
    "X29n0594_001:0013b24_0-0": "【疏】與大比丘眾等者釋論三義翻摩訶天竺語具足摩訶槃那摩訶名大大有六義一者常義故涅槃云所言大者名之為常譬如有人壽命無量名大丈夫二者廣義故涅槃云所言大者其性廣博猶如虗空無所不至涅槃亦爾三者多義德別非一故涅槃云譬如大藏多諸珍異涅槃亦爾多有種種妙法珍寶故名為大四者深義淵奧難測故涅槃云大者名為不可思議一切世人若聲聞緣覺不能測量涅槃之義故名大五者高義位分高出餘人不至故涅槃云譬如高山一切世人不能得上故名為大涅槃亦爾凡夫二乘及諸菩薩不能窮到故為大六者勝義如世間中勝上之人名為大人涅槃亦爾諸法中勝故名為大此六義中攝在三義常義廣義大中攝深義高義勝中攝多義又三義與起信中三大同一體大是性淨涅槃體窮真性義究法界二相大是圓淨涅槃過無不盡德無不備三用大是方便淨涅槃妙用廣周化現無盡亦十種三義同也(云云)",
    "X29n0594_001:0013b24_0-1": "疏中四教釋如文今疏三眾從所表釋他解云有十五眾一釋種清高眾(是多知識)二已圓未滿眾(是少知識)三承恩出俗眾(是佛夷母)四曩結深恩眾(耶輸)五神功廣大眾(是菩薩)六戰修羅眾(帝釋)七春護舒暉眾(三光四王)八大小自在眾(二自在是)九跨握娑婆眾(梵王)十翳虗含灑眾(八龍)十一清歌雅樂眾(四緊)十二勝芳列樂眾(四乾)",
    "X29n0594_001:0013b24_0-2": "十三動山涌海眾(修羅)十四吞龍噉毒眾(四鳥)十五人中自在眾(闍王是事釋而無所表是新羅解矣)。",
    "X29n0594_001:0013c24_0": "【疏】與字云直明兩意章安涅槃疏中云比丘與佛同共七一也若依三藏明義丈六佛與諸比丘同鹿苑處同轉法輪時同律儀戒同禪定心同無漏知見同涅槃道同有餘脫一一皆與佛同故言共也若藏通兩教相對明義五同二不同何者體法智慧即色見空非色滅見空此見不同也摩訶衍道非隘路道此道不同當知通佛不與藏比丘二同通比丘不與藏佛二同亦爾兩教比丘自相望不同亦然故云直明兩意(今疏心見道三種異者恐悞禪定心不可異也)若通教佛望比丘七一皆同問通比丘望藏佛五同者鹿苑時應有兩教如何玄文云三藏但耶答今從共部方等說也若作別教明義者尊特身佛時處二種望前兩教比丘所不能見如為盲設燭何益無目者乎戒心見道解脫五種望前兩教比丘不聞如為聾人奏樂何益無耳者乎即不與前兩教比丘共也別比丘不與前兩教佛共況與前兩比丘共耶若圓教佛七一皆是佛之境界唯與圓菩薩住首楞嚴示為比丘像者不與前三教佛及比丘共也若開顯竟成圓共也問疏引法華論四種聲聞何耶答為證四教皆有聲聞也問阿難是有學殘思未盡何名解共耶答既是結集人數從後得羅漢時名共也問二乘之智如盲摸像各各不同何得言一見耶答約後得智則異根本智無差。",
    "X29n0594_001:0014a22_0": "【疏】道即性念處至韋陀者性念處者觀四念境身是不淨受是苦心是無常法是無我得無漏理大外道有漏一切智言共念處大神通者前觀念處是無漏慧斷煩惱障更加滅定除禪中事障名心自在是俱解脫起無漏通故勝外道五通也言緣念處者遍學藏教四門法及五明等論即大四韋陀外道四韋陀者一讀誦二祭祀三歌詠四穰灾各四萬偈偈有三十二字言五明者一曰聲明釋詁訓字詮目流別二工巧明伎術機關陰陽曆數三醫方明禁呪閑耶藥石針艾四因明考定正邪研覈真偽五曰內明究暢五乘因果妙理。",
    "X29n0594_001:0014b09_0": "【疏】五繫者大經四依品中四依菩薩駈逐魔波旬若更來者當以五繫繫縛於汝章安解云繫有二一五屍繫二繫五處五屍者死狗死馬死蛇死人死猪也喻不淨觀治於愛魔解曰狗如貪蛇如嗔人如慢猪如癡馬如疑也言五處者兩手兩脚及頭喻觀身陰界入空理治於見魔言頭喻我見兩手喻邊邪二兩脚喻二取見也故首楞嚴中佛令身子觀於諸魔來惱之事也見已問佛誰之所作佛言是首楞嚴三昧之力但有說三昧之處魔欲為障自見五繫佛滅後有說三昧處亦復如是疏肇師云淨命等之四種異是世界乞食並持戒是為人破惡是對治怖魔是第一義由證理故使魔怖也不同記釋云云(此可在五繫上)。",
    "X29n0594_001:0014b21_0": "【疏】十魔者新譯華嚴五十八菩薩有十種魔一陰魔生諸取故二煩惱魔生雜染故三業魔能障礙故四心魔起高慢故五死魔捨生處故六天魔自憍慢故七善根魔恒執取故八三昧魔久躭味故九善知識魔起著心故十菩提心法智魔常不捨故。",
    "X29n0594_001:0014c02_0": "【疏】九十人三明者如第二經釋(云云)。",
    "X29n0594_001:0014c03_0": "【疏】不依淨命者正命也起四邪等名破正命四邪者一方邪謂通國使命二維邪謂醫方卜相三仰邪謂仰觀星宿四下邪謂種植栽五穀等又五邪一為利故現奇特相二為利故說己功德三為利故卜相吉凶四為利故高聲現威令人畏敬五說所得供養以動人心並高流上輩所慎也。",
    "X29n0594_001:0014c09_0": "【疏】無翻名含三義三義異是世界不生是第一義殺賊是對治應供是為人今獲下即約教也不同記(云云)。",
    "X29n0594_001:0014c12_0": "【疏】後世田中止觀第六(檢)。",
    "X29n0594_001:0014c13_0": "【疏】亦是供應者止觀引阿含中有譬喻經云昔波羅奈去城五十里山中有比丘居平旦入城乞食中後還山日暮乃至疲極不堪安禪歷年如此勞而無獲佛化為一道人往至其所而安慰之答曰四大之身去城道遠有何樂耶止念畢命而已化沙門曰夫道以戒為本攝心為行賤形貴道朽棄軀命食以支形守意正定內學止觀滅意得道養身縱情何得免苦願諸道人明莫乞食吾當供養一日之糧明日佛送食五人食已即得羅漢食為道緣此之謂也即供應義。",
    "X29n0594_001:0014c23_0": "【疏】供養此人如供養世尊者止觀第二記云即廣平實相之理修此理故心有階降若能修行得全分寶但能讀誦得中分寶種種供養得下分寶若人積寶滿四天下上至梵天供養於我不如與持經者一食充軀命實相觀即當持義故別供養顯觀功能。",
    "X29n0594_001:0015a04_0": "【經】皆是阿羅漢者第四歎德論有三釋一上上起門二總別相門三攝取事門言上上起者由上句故下句得起或由下句故上句方起非唯一故名上上起門此依論十六句今疏依經五句皆以下釋上初約三德歎如疏次約四智釋初二句我生已盡次一句梵行已立後二句初句是不受後有次句是所作已辦問此四智屬何智耶答婆娑云我生已盡屬盡智餘三屬無生智又婆娑云我生已盡是斷集智滅盡諸漏名我生已盡初二句梵行已立是道智第三句所作已辦是滅智功德成就名所作已辦第五句不受後有是斷苦智第四句問上明三門相貌如何答上上起門上下相釋總別相門有卷舒也攝取事門明句多少故有差別解曰言卷舒者一句為卷十五句為舒言攝取事門者一句攝多句等為多一句攝一句為少。",
    "X29n0594_001:0015a19_0-0": "【疏】諸漏者一總釋者論云於彼漏隨增故說名有漏解曰言隨增者一約所緣二約相應言所緣隨增者謂諸隨眠於此法中隨住增長即是隨轉增湣滯義如衣有潤塵垢隨住有潤田種子增長解曰諸隨眠者九十八使也於法中者諸所緣境也隨住者如塵住衣增長者如田種子也隨轉釋隨住增湣滯釋增長也論釋相應隨增者正理如何隨眠於相應法及所緣境有隨增義如城邑側有雜穢聚糞水土等所共令成於此聚中由糞過失令水土等亦成不淨由水土等力令糞轉增更互相依皆甚可穢汙如是相應聚中由煩惱力深心心所煩惱由彼心心所故煩惱勢力於此轉增更互相依成穢汙義此聚相續穢汙漸增(釋相應也)",
    "X29n0594_001:0015a19_0-1": "又如猪犬等居雜穢聚生極躭樂眠戲其中糞穢所塗轉增不淨復由猪等穢聚漸增(釋所緣也引正理具解二隨增義也)大乘解者漏是洩失念故墮生死故名為漏又釋漏有兩義一住義名漏即留住之義令諸有情留住三有生死二流義名漏即流轉之義令諸有情流轉三有生死又云漏義則寬通其流義住義流義即狹不通住義又流義是寬通其傍順漏義即狹不通順流此二釋從喻立名此喻六根漏泄煩惱即住生死不順正流趣向涅槃此住義也雖亦因業住其生死若無煩惱雖有諸業即不受故煩惱為漏非業名漏二列名者一欲漏二有漏三無明漏是(小記有出体離合不記)",
    "X29n0594_001:0015a19_0-2": "三得名所從者雖三界一切煩惱應皆名有漏漏於三有有之漏故下界煩惱多緣欲起從勝為名說為欲漏上界諸惑更無別勝得其本名名為有漏無明不以餘法為名彰自行相名無明漏此漏非一故名為諸今疏但有列名及總釋二門(云云)流扼等者流者溺三惡趣漂人天趣隨惑不捨如瀑流從喻為名一欲流准大乘法相欲界四諦諦別貪嗔慢疑並修道貪嗔慢三總十九數及隨二十為欲流體二有流者以上二界各五部(四諦修道合為五部)",
    "X29n0594_001:0015a19_0-3": "下十四合二十八惑為體以無嗔故二界各八大隨及憍色界謟誑亦是此體三見流者三界四諦各五並三界修各身邊二見總六十六為體四無明流者三界五部各一無明總有十五為此流體扼亦同之。",
    "X29n0594_001:0015c07_0": "【疏】結者即二十五有生因者又二初釋總名次列九種初總名者煩惱闇惑結縛行人故名為結又能縛心亦名為結亦能結集一切生死故名為結次列九者一愛二嗔三癡四慢五疑六見七取八慳九嫉前七猶是十使五見合為二結餘五名為一結更加慳嫉合為九結釋曰所言愛者於順境貪染名愛猶是貪使言嗔結者於違境上樂相名嗔猶是嗔使言癡結者於中容境緣而不了故名癡癡使有二無明一不共二相應今結唯取不共無明九結皆取作意獨立強名之為結言慢結者自高名慢言疑結者於正理道猶預不決言見結者身邊邪三見顛倒推求故名為結言取結戒見二取取執境界故名結慳結者忌他勝己故名嫉慳等(云云)。",
    "X29n0594_001:0015c20_0": "【疏】得王三昧破二十五有者二十五三昧名王三昧能破二十五有一無垢破地獄有二不退破畜生有三心樂破餓鬼四歡喜破脩羅五日光破弗婆提六月光破瞿耶七熱炎破鬱單越八如幻破閻浮九不動破四天王十難伏破三十三天十一悅意破炎魔十二青色破兜率十三黃色破化樂十四赤色破他化自在十五白色破初禪十六種種破梵王十七雙破二禪十八雷音破三禪十九注雨破四禪二十虗空破無想二十一照鏡破那含二十二無礙破空處二十三常破識處二十四樂破不用處二十五我破非想處頌曰。",
    "X29n0594_001:0016a07_0": "　無垢不退心　　歡喜日月光　　熱如幻不動　難伏悅青黃　　赤白種種雙　　雷雨如虗空　照無常樂我　　是名二十五【疏】八自在我者大經二十三云何等為八一者能示一身以為多身身數大小如微塵充滿世界如來之身實非微塵以自在故現微塵身名為大我二示一塵身滿大千界如來之身實不滿大千界何以故以無邊故名為大我三能以滿大千界身輕舉飛空過於二十恒沙諸佛世界而無障礙如來之身實無輕重四以自在故而得自在云何自在如來一身安住不動所可示他無量形類各令有心如來有時或造一事而令眾生種種成辦如來之身常住一土而令他土一切悉見(云云)五根自在云何自在如來一根亦能見色聞聲嗅香別味量觸知法如來六根亦不見色等(云云)六以自在故得一切法而如來之心亦無得想何以故無所得故若是有者可名為得實無所得云何為得七說自在故如來演說一偈之義經無量劫義亦不盡所謂戒定施慧等如來爾時都不生念我說彼定等(云云)八如來遍滿諸處猶如虗空虗空之性不可得見如來亦爾實不可見以自在故令一切見等(云云)。",
    "X29n0594_001:0016b04_0": "釋名二十一尊者有束為九對一捨邪離染對阿若捨邪如來成道最先悟解悟解之先名了本際等迦葉離染不觸女人少欲知足故二林水城邑對如優樓迦葉三人依林河城修道故三勝智妙通對身子智慧目連神通四辯高見廣對迦旃延論義詞高那律天眼廣劫賓通二五昔習今成對憍梵波提牛呞昔習離婆多假和合今成六惡習善餘對畢陵罵河神名惡習薄拘羅五不死報名善餘七返迷割愛對拘絺羅因與佛論名返迷孫陀羅難陀是佛弟名割愛難陀通二八化有談空對富樓那說法化有情須菩提解空為第一九解深行密對阿難盡持佛教名解深羅睺羅密行名第一。",
    "X29n0594_001:0016b16_0": "【疏】陳如皆共等者一與上座簡異下座二與名者簡異無名三與有德簡異無德故云皆大也。",
    "X29n0594_001:0016b18_0": "【疏】父王遣五人追侍者記云三人父親馬星摩男拘利有云拔提摩男十力是叔類拔提與摩男是梵語異本是一人今云拘利太子他云迦葉未知孰是(云云)。",
    "X29n0594_001:0016b22_0": "【疏】八萬諸天遠塵離垢者據顯露說得小果準智論釋秘密法輪得無生忍即是證大故玄云三藏但於顯露中不合言大也離垢是初果法眼亦然五人得無生是第四果。",
    "X29n0594_001:0016c02_0": "【疏】已知等者五人已知證滅諦理地神等已知他已證。",
    "X29n0594_001:0016c04_0": "【疏】拘隣最初見佛道相者見太子得道之相也初聞太子說四諦法名聞法皷記云佛如皷機如槌說四諦法如皷出聲今謂此二陳如見聞佛也次云初服道香下約拘隣自聞法已修證以說即修三十七品名服道香離苦集之臭也初證滅諦名甞甘露初入道流是初登真諦釋前甘露故在一切人前也。",
    "X29n0594_001:0016c10_0": "【記】云鏡譬至第五記者彼止觀文約三假復推重責自他等不生因成相續相待名自他等四句求生無生四句求滅無滅等(云云)。",
    "X29n0594_001:0016c13_0": "【疏】若能知道下記云觀中三初正明觀次既下觀成破惑三如是下明準因破果初法喻合今謂有結文非合文(云云)次既知下記分先破見次準因破果者亦恐悞破二十身見即破因因破即無果故但成法說次盲下喻亦無合文若云是名觀陰下為合文者殊不相當同是結觀陰耳(思之)。",
    "X29n0594_001:0016c19_0": "【疏】別觀中鏡喻法界者以法界為依持迷是九界悟是發心登地為理地前為事地獄為始妙覺為末自是佛界他是九界皆以果地法界為依持唯識中第八識為所依持為前七識所依復能持於七識種子故名依持第八但名無覆無記自淨之識此梨耶生一切法也若法性為依持者既計法性生一切法也(止觀破云云)。",
    "X29n0594_001:0017a02_0": "【疏】觀鏡團圓者觀是能觀鏡是所觀境智俱圓也。",
    "X29n0594_001:0017a03_0": "【記】云團圓是境者境智俱境俱智亦然。",
    "X29n0594_001:0017a04_0": "【疏】無生觀智云云者記釋云阿若權實始終不迷者權在鹿苑實至法華此從內秘以說本是小機初稟權教後方入實鹿苑為始入實為終即法華得記時也。",
    "X29n0594_001:0017a08_0": "【疏】阿含云阿難持傘蓋燈隨佛後等欲顯其本故也。",
    "X29n0594_001:0017a09_0": "【記】云諸弟子在大在小若顯若晦為主為伴示訥示辨有屈有申厭外欣內背大向小引小入大會偏歸圓自因之果皆為眾生作種熟脫者解云在鹿苑為小在方等般若示為菩薩則大示聲聞得記則顯示八部得記則晦三迦葉於禮為主所領弟子為伴富樓那示辨周利示訥方等般若聞大不受是背外現是聲聞是向被淨名彈示屈為能呵是申示厭外道忻於內教或引小唯藏或會偏前三教或引因是今與先已入十住是也。",
    "X29n0594_001:0017a18_0": "【記】云況令後代聞名起行者行者感應也稟教識體者是約教意思迹觀本是本迹意尋大通時下種子今日得記是脫名廣照始末意又解云於一人所於經一句者了經一句為上求境若於一人是可化機五時八教是聖者化儀四教五乘是凡眾稟益於稟益人須識名義同異如聞無生一名是同四教無生各別是義異或聞名異義同者如云真如實相實際等名異而義是同言行等理殊者四教行行名殊言隨聞成觀者如聞一句無生即四觀不同言解迹本人法者本中之本是久成本中之迹是大通前各有人法迹中之本王子時迹中之迹大通後至今日迹門前各有人法化事長遠是人久成言聖恩難報者如來隨逐眾生不捨或現己身他身己事他事等言眾生難化者退大之後流轉五道中間小接今日方聞故云難化會理至難亦爾如此消釋諸弟子行行尚恐未了況但翻名而已。",
    "X29n0594_001:0017b10_0": "【疏】迦葉緣名畢鉢羅者健馱邏國東南八九里有畢鉢羅樹高百餘尺枝葉扶蔬蔭影蒙密過去四佛已坐其下今猶現有四佛坐像賢劫之中九百九十六佛皆當坐焉即菩提樹也出西域記。",
    "X29n0594_001:0017b14_0": "【疏】十六大國者出阿含經一央伽二摩竭三迦尸四薩羅五跋祇六末羅七支提八跋沙九居樓十槃闍羅十一阿濕波十二婆蹉十三蘇羅婆十四乾陀羅十五劍浮沙十六阿梨提。",
    "X29n0594_001:0017b18_0": "【疏】約教斗藪十二種過者頭陀新云杜多此云斗藪律論不同律有隨坐不作餘食法及一摶食大論則無論有節量食中後不飲醬及次第乞食律中則無又律云納衣論云糞掃衣律但云乞食常乞食此二名異義同餘七俱同下文自列。",
    "X29n0594_001:0017b23_0": "【疏】空慧為食者觀資於境慧即正行諸行為衣者五度為助行於正行上起於助行名行行也行資於理如衣覆身常性下釋食處空慧下釋食妄想下釋衣諸相應下是處第一諸苦行下是衣第一斗藪下是食第一。",
    "X29n0594_001:0017c04_0": "【疏】圓教中云於一切下是處諸佛下是衣過諸下是食清淨即般若也故注云云。",
    "X29n0594_001:0017c06_0": "【疏】舍利者其母眼似舍利鳥此云鶖鷺即百舌是亦名春鸎舍利弗五納衣者西域法護衣是也。",
    "X29n0594_001:0017c09_0": "天台法華疏義纘卷第一"
}