{
    "X29n0597_004:0557a15_0": "法華文句記箋難卷第四",
    "X29n0597_004:0557a17_0": "赤城沙門　有嚴　箋",
    "X29n0597_004:0557a18_0": "安樂行品",
    "X29n0597_004:0557a19_0": "引諸經論所列三門引經者身體及手足乃至五不受等三門者即不動等三釋安樂義也。",
    "X29n0597_004:0557a21_0": "忍辱如善住天子所問經云文殊童子言世尊所說忍者常云若不為彼境界所傷得名為忍今經亦爾不為真俗二邊十惱亂等境界所傷是名住忍辱地。",
    "X29n0597_004:0557a25_0": "寶樹等三大經云一切江河必有迴曲一切叢林必名樹木一切女人必懷諂曲一切自在必受安樂文殊難言是義不然於此大千有洲名拘耶尼其洲有河端直不曲名娑婆耶猶如直繩直入西海如此直河佛未曾說種種金銀琉璃寶樹是亦名林亦有女人善持禁戒功德成就有大慈悲釋梵諸天雖得自在皆悉無常玄文中云諸教隨情故有迴曲三草二木故非真實金沙大河直入西海乃至云是故不廢釋箋云今以迴曲及叢林等以譬有餘金沙河等以譬無餘。",
    "X29n0597_004:0557b09_0": "大經聖行住三地玄文云聖行證三地梵行證兩地梵行是因故論所證病兒是從果起用故不論證戒行從淺至深證不動地定行從淺至深證堪忍慧行從淺至深證無畏地登初地時不為二邊所動名不動地上持佛法下荷眾生名堪忍地於生死涅槃俱得自在名無畏地(云云)又云若地前化他名梵行慈悲喜是他之事行一子地是其證捨心是化他之理行空平等是其證登地慈悲故言一子慈悲與體同故言空平等(云云)然玄文中謂戒行證不動地今記中引經謂戒行住堪忍地定行住不動地者或是登地體融或是寫時筆誤撿經證之經中乃是戒行證不動地定行證堪忍地經與玄同。",
    "X29n0597_004:0557b21_0": "一子地大經云菩薩脩慈悲已得住極愛一子之地譬如父母見子安穩心大歡喜菩薩亦爾觀諸眾生同於一子見脩善者生大歡喜又見諸眾生為煩惱病之所纏切心生愁惱是故此地名為一子。",
    "X29n0597_004:0557c01_0": "有經本云多一經字。",
    "X29n0597_004:0557c02_0": "俱通深淺行處生法二忍近處能離三觀皆通於果故俱深也若悉在五品故俱淺也。",
    "X29n0597_004:0557c04_0": "深俱淺如疏俱深是前品菩薩之行俱淺是七方便之行耳。",
    "X29n0597_004:0557c06_0": "下去約位寂滅忍在妙覺無生忍在初住然亦通初。",
    "X29n0597_004:0557c08_0": "如引義中寂滅忍與畢竟空下引十八空鈔文如云諸法無餘名畢竟空以畢竟故空無所有。",
    "X29n0597_004:0557c10_0": "各說一邊非無所詣詣理附事各雖一邊而皆有所詣故曰非無以例行處近處皆有所詣故令準說。",
    "X29n0597_004:0557c12_0": "口意二文止觀明著經口業中不樂說人及經典過等止也善脩如是安樂心故觀也意業中無懷嫉妬諂誑之心等止也於一切眾生起大悲想等觀也。",
    "X29n0597_004:0557c15_0": "皆云助觀下疏云戒門助觀定門助觀慧門助觀。",
    "X29n0597_004:0557c16_0": "真諦即法空俗諦即生空記中引性相二空證生法者說者紛紜況生法與性相空體本同只一圓妙般若智耳破生法執時必破性相執破性相執時必破生法執何須用證耶今謂記主引諦而證耳非謂證二空體同也諦者了義以由一切眾生於妙真俗未曾諦了若或稟教須諦真空真於何諦諦在五陰諦此五陰本自不生故云真諦即法空俗諦中生空亦復如是了於百界世俗假名亦本不生若能諦俗必除妄執故云俗諦即生空故得引玄文證之意云於世若諦者乃破性也於真若諦者乃破假也此同輔行云若有性執世而非諦破性執已乃名世諦破性名為性空等此豈非是諦者了義耶亦可反例云若有法執法非真諦破法執者由在諦真故云真諦即法空若有俗假俗非生空破俗假者由在諦俗故云俗諦即生空。",
    "X29n0597_004:0558a07_0": "無生忍寂滅忍玄文云就事為無生就理為寂滅又分證為寂滅證果為無生。",
    "X29n0597_004:0558a09_0": "但生忍義深法忍可識柔和下乃生忍也又觀諸法下乃法忍也生忍若深法忍豈淺。",
    "X29n0597_004:0558a11_0": "通名觀耶豈不名上。",
    "X29n0597_004:0558a12_0": "三行兼理如行不行者行即是事不行是理又不行行者亦不行是理行則是事故曰兼理。",
    "X29n0597_004:0558a14_0": "對事設觀以助照理非遠非近即十八空對十八事以設觀也比乎十乘今文尚略故云以助。",
    "X29n0597_004:0558a16_0": "助真似邪向疏云六根名淨發相似解而得入真。",
    "X29n0597_004:0558a17_0": "如病將身大論云菩薩以度人為事云何深山自靜答如病將身體康修業身雖遠離心不遠離合喻云服般若藥煩惱病損法身康後為化未晚。",
    "X29n0597_004:0558a20_0": "五事調心調心不沉不浮調身不緩不急調息不澁不滑調眠不節不恣調食不飢不飽。",
    "X29n0597_004:0558a22_0": "須約六即以論不轉今是五品約觀論耳。",
    "X29n0597_004:0558a23_0": "互論自他從真起妄則真自妄他從妄生真則妄自真他和合則共非共無因。",
    "X29n0597_004:0558b01_0": "勝以因緣一句等勝應作前謂前約因緣一句開為兩境如云從惑因緣生生死從解因緣生涅槃不如次釋意顯以因緣為涅槃以顛倒為生死。",
    "X29n0597_004:0558b04_0": "今從故說下今字恐是又字耳經中但以下總結諸句疏有三釋蓋初釋中從故說常樂觀如是法相九字疏不別釋由例故說說者由倒故云不必若只作今字消文今指次釋不必須云顛倒又却指初文理不貫血脉斷絕。",
    "X29n0597_004:0558b09_0": "總在後示如次文九句十八句以示觀法。",
    "X29n0597_004:0558b10_0": "如無不斷如實相不顛倒無所有性語言道斷。",
    "X29n0597_004:0558b11_0": "不去準知亦可顛倒如虗空乃至無障亦可顛倒道斷乃至無障道斷。",
    "X29n0597_004:0558b13_0": "及以離合第九問云前之六空已明二空何須臾說次七空答以向性相重歷諸法故更明七問內至畢竟破諸法盡何須後五答大論云十三破盡後五重說耳。",
    "X29n0597_004:0558b17_0": "若總若別俱通橫竪四行是總十乘為別十分橫竪者如以十乘分對三根則竪三根各十則橫四分橫竪者初品身安樂未廣說法故二三品口意安樂四五品誓願安樂則竪五品各四則橫。",
    "X29n0597_004:0558b21_0": "應取第三離為三諦釋前疏中云分約三法明行處一直緣一諦二約生法二忍三約三諦住忍辱地是總論三諦也柔和善順者順真諦也不卒暴不驚者安於俗諦也於法無所行者安中諦也。",
    "X29n0597_004:0558c01_0": "離十惱亂亦當生空疏云因脩禪定止於過惡得人無我況復十惱只是生死涅槃二法二法皆是假名假名故空不相違拒各柔和善順。",
    "X29n0597_004:0558c04_0": "乃至六諦一生諦謂五大時方為萬物所依二依諦謂色等五塵好醜依此而有三作諦謂俯仰屈伸四總相諦謂總收萬物五別相諦謂森羅萬象不同六摩婆夜諦謂塵成瓶不相好礙。",
    "X29n0597_004:0558c08_0": "二十五諦一從冥初生覺過八萬劫前冥然不知名為冥諦從心生色等五塵塵生五大謂四大及空從五大生十一根謂眼等根及手足大小遺根并平等根合十一根此等皆依神我。",
    "X29n0597_004:0558c12_0": "遮面防喻喻應作背防背毀也古語云面譽者多背毀。",
    "X29n0597_004:0558c14_0": "但隨順法相隨順法故之相而忘執大之心。",
    "X29n0597_004:0558c15_0": "復順物情若歡若毀今二乘兩無所取。",
    "X29n0597_004:0558c16_0": "尚不令順法而違物情有小機者亦宜說小不必一向以順大法。",
    "X29n0597_004:0558c18_0": "況令違法豈違大法不為說大。",
    "X29n0597_004:0558c19_0": "未壞天子魔以未有中道不動三昧故為天子魔所動也如魔惑阿難時廣說諸法等若菩薩破四魔者釋論中云約得菩薩道破煩惱魔約得法身破死魔并陰魔約得不動三昧破天子魔。",
    "X29n0597_004:0558c23_0": "疏不能阻壞阻應作沮。",
    "X29n0597_004:0558c24_0": "調伏貪憂憂應作愛。",
    "X29n0597_004:0559a01_0": "從地涌出品",
    "X29n0597_004:0559a02_0": "如下委論如云從此下至不輕品明佛弘經功深以勸流通神力下八品明付囑流通。",
    "X29n0597_004:0559a04_0": "唯十一品半此文語略應云本門流通唯十一品半本迹流通共十六品半或恐脫落。",
    "X29n0597_004:0559a06_0": "以經力大今撿流通段文箋之或符經旨更引本經他文釋之亦善。",
    "X29n0597_004:0559a08_0": "舉法舉人法聞一偈人為佛使。",
    "X29n0597_004:0559a09_0": "引今引往今如龍女往阿私仙。",
    "X29n0597_004:0559a10_0": "東方西方東方妙音菩薩西方觀世音菩薩。",
    "X29n0597_004:0559a11_0": "若顯若密顯則佛現光明之身密則天龍作聽法眾。",
    "X29n0597_004:0559a13_0": "總身別身總如彌勒不語變化別如妙音現多身說。",
    "X29n0597_004:0559a15_0": "或逆或順四眾拒不輕者逆八部護持經者順。",
    "X29n0597_004:0559a16_0": "往佛今佛往舉日月淨明德佛今如神力品釋尊。",
    "X29n0597_004:0559a17_0": "自微至著起一念隨喜者微也皆與受佛記者著也。",
    "X29n0597_004:0559a19_0": "現益當益安樂行中顏色鮮白現也勸發品中生兜率天當也。",
    "X29n0597_004:0559a21_0": "親益疎益親若姨母疎非釋種。",
    "X29n0597_004:0559a22_0": "事益理益事則火不能燒理乃達老死實相。",
    "X29n0597_004:0559a23_0": "半品四信之文去取不定分別功德品末疏云南師從十九行偈後長行下屬流通北師以四信弟子判屬正宗從如來滅後下乃是流通又云二家盡可用今依南方。",
    "X29n0597_004:0559b03_0": "機有在無語倒應云機在有無。",
    "X29n0597_004:0559b04_0": "此中未述斷疑在壽量品中。",
    "X29n0597_004:0559b05_0": "重重說等南岳云法慧說十住十方說十住者皆名法慧乃至金剛藏說十地亦復如是十方諸佛說十住與法慧等乃至十方佛說十地與金藏等。",
    "X29n0597_004:0559b08_0": "唯有一佛釋迦化徧。",
    "X29n0597_004:0559b09_0": "地覆本屬本眷屬。",
    "X29n0597_004:0559b10_0": "雖但顯本下文顯菩薩本云下方空中住是本住寂光也本雖如是而於釋迦開迹顯本理且未彰。",
    "X29n0597_004:0559b12_0": "經四分之一將半恒沙開為四分取一分為喻故云之一。",
    "X29n0597_004:0559b14_0": "那由他此數法也解脫經有六十二數流來此土但五十二耳每一數十倍增之謂一十百千萬億落叉度落叉俱胝末那阿庾多大阿庾多那庾多大那庾多鉢羅那庾多大鉢羅那庾多矜羯羅大矜羯羅頻婆羅大頻婆羅阿門婆乃至第五十二阿僧今那由他即第十二那庾多也下藥王品中甄迦羅即矜羯羅第十七數頻婆羅即第十八數阿閦婆即第二十數也。",
    "X29n0597_004:0559b22_0": "亦不須移若移者應云六萬非多若依法門者。",
    "X29n0597_004:0559b23_0": "皆云善者五眼四諦等悉具十善曰皆。",
    "X29n0597_004:0559b24_0": "八自在中之一能作小能作大作輕重等今此能作短能作長亦八之中之一。",
    "X29n0597_004:0559c02_0": "故且抑其一分以五十小劫謂如半日雖是即長而短而未云即短而長曰抑。",
    "X29n0597_004:0559c04_0": "熱休息冷冷應作已。",
    "X29n0597_004:0559c05_0": "開亦不徧未施藏通。",
    "X29n0597_004:0559c06_0": "合亦不周別教利根自入法界。",
    "X29n0597_004:0559c07_0": "彼開施別。",
    "X29n0597_004:0559c08_0": "此開施三。",
    "X29n0597_004:0559c09_0": "此合何殊彼合會別會三入實同故。",
    "X29n0597_004:0559c10_0": "六方便邊藏通各三乘。",
    "X29n0597_004:0559c11_0": "身土四句依中現正正中現依依中現依正中現正。",
    "X29n0597_004:0559c13_0": "然自在大自誤是昔字耳謂華嚴也以次云此述一化蓋今昔對論。",
    "X29n0597_004:0559c15_0": "三節或是重語三周有三節段或指前譬本中通貫三周作廣略三節義。",
    "X29n0597_004:0559c17_0": "法華迹說與眾經同迹中以圓為能開三教為所開縱今經已前有末開之異然其教法不出乎三不同華嚴兼別。",
    "X29n0597_004:0559c20_0": "今日一番之因十地因滿乃受識也。",
    "X29n0597_004:0559c21_0": "多是加菩薩說新經四十品除阿僧祇品及隨相光明功德品是佛自說餘三十八品皆菩薩說。",
    "X29n0597_004:0559c23_0": "而以華嚴形斥法華如合論中以華嚴十義形比法華謂華嚴是報土法華是穢土佛現報身劣應請者是菩薩身子說法是大乘三車被機是菩薩三乘異等。",
    "X29n0597_004:0560a03_0": "七處八會一摩竭陀蘭若二普光明殿二忉利天四夜摩天五兜率天六他化自在天七重會普光明殿八三會普光明殿已上釋籤所出品目若李論中謂第七是三禪天會若云九會天台師謂逝多林李論又加給孤園一處立為十會。",
    "X29n0597_004:0560a08_0": "二處三會一靈山二虗空三又靈山。",
    "X29n0597_004:0560a09_0": "此中橫對四土未變土前同居也四信中諸聲聞眾方便也其菩薩眾實報也遠處虗空表寂光也。",
    "X29n0597_004:0560a11_0": "約五味判諸利鈍華嚴一鈍乃至般若二鈍唯法華純利。",
    "X29n0597_004:0560a13_0": "已如向辨菩薩尚是古佛等。",
    "X29n0597_004:0560a14_0": "疏能問者即是華嚴中四菩薩解脫月等四也。",
    "X29n0597_004:0560a15_0": "用義不同若指銷釋自在神力為不同者前見寶塔品與今銷釋三力用對三世其旨大同今尋前諸所釋言其不同者只是十意以明如來三世益物之相學者更詳。",
    "X29n0597_004:0560a19_0": "對用皆然三身對土三德對三障等。",
    "X29n0597_004:0560a20_0": "教門各二真底中底。",
    "X29n0597_004:0560a21_0": "且據不現劣應之身寂光土中真智斷德故云老不應同居故曰不服俗諦之藥。",
    "X29n0597_004:0560a23_0": "九次第定若入禪時智慧深利能從一禪入一禪心心相續而無間雜九者謂初禪次第定二三四禪次第定四空處次第定第九滅受想次第定。",
    "X29n0597_004:0560b02_0": "奮迅有出入兩奮迅一入者謂入三昧人離欲惡不善法有覺有觀入初禪如是次第入二禪乃至滅受想是名入也二出謂從滅受想定起倒入非有想乃至初禪是名出也。",
    "X29n0597_004:0560b06_0": "超越一超入謂從初禪超入非有想非無想處非有想非無想處起入滅受想處定二超出從滅受想起入散心中散心中起入滅受想定滅受想定起還住散心中散心中起入無所有處無所有處起住散心中散心中起入識處等具如法界次第。",
    "X29n0597_004:0560b11_0": "壽量品",
    "X29n0597_004:0560b12_0": "以理況事性非今昔常住不滅以不滅故稱性而常若云無量劫理數然也以由理常是故事常。",
    "X29n0597_004:0560b14_0": "舉不足以釋之事壽為不足理壽為足用事壽以顯理壽故曰釋之。",
    "X29n0597_004:0560b16_0": "本既不疑長壽彌勒菩薩等從初不疑佛壽何以太長若爾則睿公不須以法壽即報壽非長而長以出其意。",
    "X29n0597_004:0560b19_0": "但先以長為答示答問意也睿公只消以長答短於理自明。",
    "X29n0597_004:0560b21_0": "惟忖中五句至向地今再箋之疏云初一句總後四句別今聞大法雨潤法性種開十住知見今之與先已得十住今從十住改十行示佛知見擊皷演義皆從向地今昔悟入(云云)。",
    "X29n0597_004:0560c01_0": "乘妙中說三法妙中云始終者不取五品教乘為始乃取凡夫一念之心具十法界十種法相為三法始也從性德之三法起名字之三法因名字之三法乃至究竟之三法過荼無字可說乘之終也。",
    "X29n0597_004:0560c05_0": "此違論文天親明三身壽量今是報身具如下引文。",
    "X29n0597_004:0560c07_0": "疏百年為期頤注家用禮記經語記主亦取鄭玄注文而釋之鄭云期者要也頤者養也不知衣服食味孝子要當盡養道而已。",
    "X29n0597_004:0560c10_0": "伽耶既非舊以彼長連上四字以為句非也又釋之云以即報佛是本佛故彼長報佛即今經伽耶之佛故曰何獨意明二身體即故也此亦非矣今謂伽耶曰應彼長曰報以約真諦雙非報應故曰長短斯亡。",
    "X29n0597_004:0560c15_0": "燕趙趙將伐燕蘇秦為燕說趙王等文在輔行第八說中明之然春秋中無秦燕等名乃是春秋後語耳。",
    "X29n0597_004:0560c18_0": "後文具此三句非如三界見於三界法身義又云如實知見三界報身義也又云或示己身己事他身他事應身義也。",
    "X29n0597_004:0560c21_0": "大經一切眾生悉一乘故以具三因佛性故爾。",
    "X29n0597_004:0560c22_0": "更立名異義同而為多並一乘者理乘也理而不滅故常當知乘常只是理常耳若云乘非常理須滅若云理是乘何獨非。",
    "X29n0597_004:0561a01_0": "疏大經超前九劫佛藏經云彌勒發心先四十劫釋迦方始發心佛地論云因七日七夜翹足讚弗沙佛因超九劫與本行經同又說布髮掩泥超八劫大經云身求半偈故超十二劫章安疏云或根緣不同佛增減說之。",
    "X29n0597_004:0561a06_0": "今顯實已不復隱本若初住顯實已亦不復隱本但以無久本可論縱得延促劫智以一日延為多劫而為久本者亦只是權耳當知佛本為實菩薩本權。",
    "X29n0597_004:0561a09_0": "問橋方等陀羅尼經云我於往昔作一比丘時有居士設大施會有一大橋有眾多人從橋上過我以愚故問彼人言是橋何人所作此木何林所生何人所斫何象所載青松白松等後到會所財食無餘。",
    "X29n0597_004:0561a13_0": "疏阡陌道路也南北曰阡東西曰陌。",
    "X29n0597_004:0561a14_0": "彼經十身新經三十八明第八地成就身智入無功用經云佛子此菩薩遠離一切身想分別住於平等知眾生身國土身業報身聲聞身獨覺身菩薩身如來身智身法身虗空身(云云)國土身者地論云千等世界淨不淨世界廣等世界差別皆善分別知智身者論云聞思脩智果行智世間出世間智差別皆如實知法身者論云無量法門平等一法身故如聞取故隨所化眾生根性相應時說差別故有根無根差別相故知第一相差別皆悉應知虗空身者論云知無盡相不可見相無障礙相無為相能通受色相因色分別皆悉能知。",
    "X29n0597_004:0561b01_0": "餘皆化攝謂眾生國土聲聞獨覺菩薩如來等六也既云應開為四而文中兩番云化或恐寫誤應云餘皆應攝又況眾生業報二身兩分若猿猴馬等為業報須指人天等為眾生也學者更詳。",
    "X29n0597_004:0561b05_0": "疏若但性德三如來者是橫約種子義。",
    "X29n0597_004:0561b06_0": "但脩德三如來是縱先法次報後應亦是縱兩番縱義有人云初一番是能顯謂別地前十住脩空顯報十行脩假顯應十向脩中顯法次一番是所顯以由登地始得法身之本從本發智是報報如華臺從報起應應如華葉雖能所異皆縱義也今謂此片古非用顯今是以由古師說三德義而有二縱一師云體義俱不殊而有隱顯之異故今初云脩德三如來是縱又一師云法身正體本自有之了因般若無累解脫此二當有故今次云先法次報後應亦是縱具如前第三記已箋。",
    "X29n0597_004:0561b16_0": "疏量字則通無的句絕。",
    "X29n0597_004:0561b17_0": "借義名釋借觀心因義釋妙智果義。",
    "X29n0597_004:0561b18_0": "相照四句智妙初境照智智照境境照境智照智。",
    "X29n0597_004:0561b19_0": "雙具前兩舊曰具法報中兩亦句以應從法報中起故如是今謂疏既云兩存只是具應中雙非之兩耳乃即遮而照故具也。",
    "X29n0597_004:0561b22_0": "名通義通名謂非常等四義謂四句各四。",
    "X29n0597_004:0561b23_0": "理通法通理謂三身體融法謂權實常住。",
    "X29n0597_004:0561b24_0": "且約次不次而論總別前別約三諦論本迹次也後總約三諦論本迹不次也次為別不次為總。",
    "X29n0597_004:0561c02_0": "俗諦三昧此照俗理也輔行云言俗理者緣於俗諦恒沙三昧言俗事者緣於眾生病及神通。",
    "X29n0597_004:0561c04_0": "一種子無上指對雨譬論云退菩提心已還所脩善根後同得果。",
    "X29n0597_004:0561c06_0": "三增長力無上論云說商主譬今記云化城義同。",
    "X29n0597_004:0561c07_0": "七化生無上論云教化眾生無上故地中涌出無量菩薩。",
    "X29n0597_004:0561c09_0": "八成道無上指壽量三菩提論中引本品三身文義。",
    "X29n0597_004:0561c11_0": "九涅槃無上指醫子論云醫師。",
    "X29n0597_004:0561c12_0": "雨譬已述譬及領經云善說功德誠如所言等。",
    "X29n0597_004:0561c13_0": "方便品已判甚深本論釋方便品中云言甚深者有五甚深一義二實體三內證四依止五無上。",
    "X29n0597_004:0561c15_0": "履所止切蒵胡禮切又音系謂屣帶也。",
    "X29n0597_004:0561c16_0": "今但正化若準今但化益此中四字宜作白字書之若作注文則今但化益亦宜注也。",
    "X29n0597_004:0561c18_0": "鄭重如前釋皇天鄭重頻降命也。",
    "X29n0597_004:0561c19_0": "故此自佗隨用別故具如玄文玄文云前二教所有隨自一向是隨他意語別教一向束為隨自他意語圓教一向是佛自意語今文以迹門為他故曰隨用。",
    "X29n0597_004:0561c23_0": "前雖有二乘之名疏云不復言及二乘。",
    "X29n0597_004:0561c24_0": "小在此三小機多在三善道中。",
    "X29n0597_004:0562a01_0": "疏自應得聞長遠之壽華嚴八十云或見釋迦成佛道已經不可思議劫。",
    "X29n0597_004:0562a03_0": "然燈者拂因疑布髮掩泥得記乃迹。",
    "X29n0597_004:0562a04_0": "非無近果三乘各證。",
    "X29n0597_004:0562a05_0": "身豈不然謂益物處者常在此土此土既本土身亦本身故知是報也。",
    "X29n0597_004:0562a07_0": "展轉相望有五乘七善舊云如地獄有人乘鬼有天乘畜有聲聞乘人有緣覺乘等今謂地獄乘鈍鬼中乘利鬼中乘鈍乃至天中乘利。",
    "X29n0597_004:0562a10_0": "十界交互以論機應下下法界有上上機如地獄界有九界機鬼中有八畜中有七此乃下有上機若上有下機謂初發心求於佛果破戒墯獄於彼可發成地獄機餘八準此此乃上有下機具如釋籤。",
    "X29n0597_004:0562a14_0": "或但論四聖以辨勝負聲聞負緣覺勝乃至菩薩負佛勝。",
    "X29n0597_004:0562a16_0": "且對佛界勝劣應耳既是本佛起應故就佛界論現勝劣之身未宜四聖以辨也。",
    "X29n0597_004:0562a18_0": "現種種身此文寫誤而又語略今檢名號品而刊正之經云種種身種種名種種色相(記中云食)種種脩短種種壽量種種處所種種諸根種種生處種種語業種種觀察記有種種形經無經有種種觀察記無。",
    "X29n0597_004:0562a22_0": "竪中亦然不將他佛望我以論之橫竪也當知以我三世相望自論竪耳。",
    "X29n0597_004:0562a24_0": "佛性有五名一佛性二首楞嚴三般若四金剛三昧五獅子吼。",
    "X29n0597_004:0562b02_0": "如前竪望只得以佛望往菩薩前云然燈緣熟以佛像化之我緣未熟但為菩薩前未拂迹得作此說今既聞竟故得約橫以論佛佛相望也。",
    "X29n0597_004:0562b05_0": "望自身壽即橫若今自壽如四教佛乃橫。",
    "X29n0597_004:0562b06_0": "迹中四佛壽命玄文云三藏佛父母生身八十二盡身灰智滅畢竟不生通教佛誓願之身化緣訖亦歸灰斷此兩佛齊業齊緣別教登地百界作佛得論年紀大小大即大乘常壽小即小乘無常之壽圓教登住亦復如是況妙覺乎。",
    "X29n0597_004:0562b11_0": "本中大小不同玄文云上因妙中以智慧為命此則非長非短由非長短之慧命能為長短此中正明長短壽命經云處處自說名字不同年紀大小紀者是壽命也大小者長短也若經中間處處年紀大小者乃是約迹而懸指於本也。",
    "X29n0597_004:0562b16_0": "今師三釋文云三德不可思議那忽縱不可思議那忽橫乃至那忽一異等此約理藏釋也身常智圓無有優劣能種種建立同歸第一義此約行因釋也即一而三故不橫即三而一故不縱不三而三故不一不一而一故不異此乃約用釋也。",
    "X29n0597_004:0562b21_0": "小乘三德為小小乘師云般若種智已圓果縛尚在解脫未具身猶雜食又云帶無常故一優二劣譬之橫川走火又云先有相好之身次得種智般若後滅身智方具解脫。",
    "X29n0597_004:0562c01_0": "此指開迹文竟者謂本成已入涅槃者皆是迹耳然竟文者三字無疏可牒似如[利禾+垂]更詳之。",
    "X29n0597_004:0562c03_0": "至果名為師子奮迅奮迅下似脫兩字應云師子奮迅奮迅中第十功德等或語略。",
    "X29n0597_004:0562c05_0": "乘栴檀樓閣華嚴四十八云毗盧遮那菩薩從於兜率天沒生於人間淨飯王家乘栴檀樓閣處摩耶夫人胎此名入離垢三昧非眼所見而能處處示現受生。",
    "X29n0597_004:0562c09_0": "貫日之精瑞應經云菩薩初乘白象貫日之精普耀經云入夫人胎如日現水又云其人中尊德超日月在於胎中演金色光蔽於日月乘白象者普耀云菩薩問天何以形貌降神母胎梵天強威白言梵典所尊形象第一何以故三獸度水馬兔未知淺深用譬未達法本象步盡底以譬大乘。",
    "X29n0597_004:0562c15_0": "七步不同南行七步示為眾生作上福田西行七步示斷生死是最後身北行七步示現已度諸有生死東行七步示為眾生而作導首乃至下方七步示滅地獄火。",
    "X29n0597_004:0562c19_0": "如佛問均提類佛五分是同。",
    "X29n0597_004:0562c20_0": "大小仍存逗機別故存而不混。",
    "X29n0597_004:0562c21_0": "五分法身義同生身二身本同何以云義五分功勳猶如均提雖云不滅用火片之終同無常生身灰斷。",
    "X29n0597_004:0562c24_0": "應存兩釋舊云然燈佛者乃他也在彼名菩薩者乃自也今謂自身應他及然燈他雖分兩他只自他耳。",
    "X29n0597_004:0563a03_0": "說彌陀成我事以例兩釋。",
    "X29n0597_004:0563a04_0": "如一眾會等集十方如他集一方若自。",
    "X29n0597_004:0563a05_0": "一在衍門故實釋論云今欲說第一義悉檀故說摩訶般若波羅蜜多經。",
    "X29n0597_004:0563a07_0": "三在三藏故虗玄文云三藏菩薩止伏結惑未有滅證但約三悉檀耳又云多說因緣生生事相少說第一義諦此乃藏通對說耳若以通對別別未證中亦但三悉故玄云通望但得二耳。",
    "X29n0597_004:0563a11_0": "通別二人三虗一實別亦三者在地前也玄文云對通雖四而三別教如何答證道有四教道應三。",
    "X29n0597_004:0563a13_0": "寄事以說寄本迹以談理。",
    "X29n0597_004:0563a14_0": "以句結之各有所屬如云外道非有非無見二乘非有非無證菩薩非有非無門。",
    "X29n0597_004:0563a16_0": "但成別俗九界病耳。",
    "X29n0597_004:0563a17_0": "迦栴延章經具五句云昔者佛為諸比丘略說法要我即於後數演其義是無常義苦義空義無我義空滅義。",
    "X29n0597_004:0563a20_0": "一一悉中復有四悉玄文云一悉檀通有四悉者論云陰入界別是世界因緣和合故有人是為人正世界破邪世界是對治聞正世界得入是第一義乃至第一義中四悉者一切實乃至四句是世界佛支佛心中所得法豈非理善是為人一切語論一切見一切著皆可破一切不能通第一義能通是對治言語道斷是第一義。",
    "X29n0597_004:0563b03_0": "安得更成複具等耶若順文消之安得之言謂更須非之則無複具也若作寫誤消之恐更字是不字耳謂圓尚墯有句安得不成複具等耶。",
    "X29n0597_004:0563b06_0": "一一悉中能所皆足聖人以此而逗物。",
    "X29n0597_004:0563b07_0": "十門解釋一釋名二辨相三釋成四對位五起教觀六說默七用不用八權實九開顯十通經。",
    "X29n0597_004:0563b09_0": "以分二悉玄文問云為人生善只應生善那復斷惡答為人者生善是舊是正斷惡是傍是新治中治惡是舊是正生善是新是傍。",
    "X29n0597_004:0563b12_0": "第一義而通於初四教皆通於初若圓教中或名字五品。",
    "X29n0597_004:0563b14_0": "從漸頓來且寄地位歷時既多且寄十地深位以言善十住尚淺故也。",
    "X29n0597_004:0563b16_0": "準行證文分常者文云久脩業所得對佛者文云壽命無量劫。",
    "X29n0597_004:0563b18_0": "總有五句經云迦栴延云諸法畢竟不生不滅是無常義五受陰洞達空無所起是苦義諸法寂滅無所有是空義於我無我而不二是無我義法本不然今則無滅是寂滅義。",
    "X29n0597_004:0563b22_0": "雖結成通謂寂滅句也淨名疏云三藏明無常非無常義若了諸法非生非滅橫計生滅以四句檢生不可得即無常義也又達無麤細之苦體有即空不見苦相名無所起即苦義又體此諸法本來空寂是真空義又衍門實相本來無有我與無我本來無二真我義疏釋甚廣。",
    "X29n0597_004:0563c04_0": "諸句可明若結句成圓則諸句例爾故疏云亦得是圓釋五義。",
    "X29n0597_004:0563c06_0": "以照寂為等覺寂照為妙覺彼經云等覺照寂妙覺寂照蓋以等覺自行照理名寂妙覺果滿鑑機名照寂之與照附權不即故屬別也南岳大師云照寂順體寂照順用亦其例也但南岳於圓法自論耳。",
    "X29n0597_004:0563c10_0": "事理相對智理惑事。",
    "X29n0597_004:0563c11_0": "似同報身自受用屬智生。",
    "X29n0597_004:0563c12_0": "入中亦然滅於塵沙之惑方有入中之智。",
    "X29n0597_004:0563c13_0": "用却成滅舊云法身體者全指惑也若唱此體有斷惑人即用也今謂若約當體得作此說若三身身相望報應屬用報論滅惑應論唱滅乃二用成滅。",
    "X29n0597_004:0563c16_0": "疏便謂其即是佛纔聞誰有煩惱便癈脩行。",
    "X29n0597_004:0563c17_0": "毗鉢舍般此翻慧。",
    "X29n0597_004:0563c18_0": "奢摩他此翻定。",
    "X29n0597_004:0563c19_0": "若到故破凡夫能破此文寫誤涅槃經云獅子吼言世尊如經中說若毗婆舍那能破煩惱何故復脩奢摩他耶佛言善男子汝言毗婆舍那破煩惱者是義不然何以故有智慧時則無煩惱有煩惱時則無智慧云何而言毗婆舍那能破煩惱善男子如明時無闇闇時無明若有說言明能破闇無有是處善男子誰有智慧誰有煩惱而言智慧能破煩惱如其無者則無所破善男子若言智慧能破煩惱為到故破不到故破若不到破者凡夫眾生則應能破若到故破者初念應破若初念不破後亦不破(已上正文)今須改云若不到故破凡夫能破若到故破初念應破則使記文粲然易了。",
    "X29n0597_004:0564a07_0": "定慧共別慧若能破煩惱何故復脩定兼定則共非也。",
    "X29n0597_004:0564a09_0": "真中二善已生未生論第七云見思本起名已生惡觀於即空令已生不生塵沙無明名未生惡觀即假即中令未生不生一切智名已生善此善易生故言泥洹道易得也道種智一切種智名未生善此智難生空智已生中智未生當脩三觀生此二智。",
    "X29n0597_004:0564a14_0": "治道長故始滅欲惡終至變易。",
    "X29n0597_004:0564a15_0": "上對治治未文無重釋疏中標世界并對治畢次如禪下只釋世界而已若其對治未惡而疏中更不復釋故云無重釋而有向來治已生之義耳。",
    "X29n0597_004:0564a18_0": "淨無垢稱王優婆塞名也以無垢之名位在等覺知治門不近。",
    "X29n0597_004:0564a20_0": "如本劫等見各計四禪等斷惑不同本劫本見末劫末見具六十二故云等斷惑者名伏為斷謂著斷常外道也著斷者於欲界色界空處識處不用處非非想處而起計著謂歸磨滅也著常者計初禪二三四禪悉計自恣五欲得涅槃。",
    "X29n0597_004:0564b01_0": "但對小外對此仍疎八到是小外之病八術是苦空等藥彼八在小故淺今此中意準下文以三達五眼以為八術今八在大故深。",
    "X29n0597_004:0564b04_0": "無明本有義之如損舊云若了脩惡即性惡如病損今謂無始無明翳乎法性如法身損非謂病損。",
    "X29n0597_004:0564b06_0": "所治同故通二乘與藏是同只治一兩有緣者。",
    "X29n0597_004:0564b07_0": "先令斷乳乃至用經云譬如國王闇鈍少智有一醫師性復頑嚚療治眾病純用乳藥亦復不知病起根原雖知乳藥復不善解或有風病冷病熱病一切諸病悉教服乳復有明醫曉八種術善療眾病(云云)是後客醫即語王言從今已後不得復服舊醫乳藥所以者何是藥毒害多傷損故若欲服者當斬其首斷乳藥已終更無有橫死之人(云云)爾時客醫以種種味和合眾藥謂辛苦酸甜酢等以療眾病無不得瘥乃至再令服乳等(云云)經中合法云凡夫所計吾我如大拇指或如芥子等(此舊醫也)如來說我悉不如是謂諸法無我(斷乳也)後還為說性不變易諸法之中真實有我(而令服乳)疏中釋云此中舉五味者即五門禪觀辛譬不淨苦譬無我醎譬無常甜譬空酸譬苦(云云)若今記中云總為六味苦為酸等者乃是引如來性品中文若客醫斷乳乃南本哀嘆中文耳其喻有異釋籤中云彼破三脩故但三味勝劣相對故成六味且略不說淨及不淨又涅槃玄義釋宗中云三脩有三謂邪劣勝邪者見相似法為常適意為樂運為是我愚惑所覆追求無厭劣者無常醎味破其執淡無樂苦味破其執甜無我酸味破其執辣三界皆無常諸有悉非樂一切空無我勝者常樂我也法身常恒無有變易淤諸覺華歡娛樂具八自在我無能遏絕。",
    "X29n0597_004:0564c05_0": "八術經中有二種一菩薩品云譬如良醫善解八術為治眾生一切病苦謂吐下塗身灌鼻若熏若洗若丸若散疏引興皇釋云初四句譬昔教無常吐譬苦下譬無常塗身譬無我灌鼻譬不淨後四句譬今教常德譬薰淨德譬洗樂德譬丸我德譬散二南本哀嘆品中復有八術疏云一治身二治眼三治服四治小兒五治瘡六治毒七治邪八知星內合佛知八正道能治八倒(文文)今記中八術是哀歎品文也以由客醫斷乳正明八術治倒故也。",
    "X29n0597_004:0564c14_0": "何不指善惡心所共為正數即所也何不指善心數與惡心數共為正因而只指通大地數耶。",
    "X29n0597_004:0564c16_0": "惡復別屬善數屬人天惡數屬四趣故云別也若用通大地數則攝得善惡兩十。",
    "X29n0597_004:0564c18_0": "疏十心數謂想欲觸慧念思解脫憶定受此乃通大地十數也。",
    "X29n0597_004:0564c20_0": "人天被開童子戲沙散心稱佛皆成佛道。",
    "X29n0597_004:0564c21_0": "二乘非緣據隔小故若向云亦緣攝者據退大邊。",
    "X29n0597_004:0564c22_0": "為讓前後人天善根屬正因者此讓前也入初住名了因者此讓後也。",
    "X29n0597_004:0564c24_0": "十信相入信念精進慧定不退迴向護法戒願是十一一相入為百說說出相入意。",
    "X29n0597_004:0565a02_0": "修性三因止觀玄文俱有此意謂離合。",
    "X29n0597_004:0565a03_0": "九門共成始色心終受潤只共成修性三因耳。",
    "X29n0597_004:0565a04_0": "皮膚毛彩若華嚴行布般若八十科之類。",
    "X29n0597_004:0565a05_0": "聞眾恠說圓經惑耳驚心之談如淨名芥納須彌毛吞巨海佛藏劫火洞然一唾即滅之類是也以今經唯說只是三千法性體用耳若今人暗禪之恠說斯亦不足可指也。",
    "X29n0597_004:0565a09_0": "法數增減略如玄文七科諦境等類。",
    "X29n0597_004:0565a10_0": "與奪他釋四時三教奪之則一切俱權與之則無非皆實。",
    "X29n0597_004:0565a12_0": "大小二初昔退還中自有最初稟大後以小接此乃大初也自有中間最初稟小此乃小初也。",
    "X29n0597_004:0565a14_0": "二通三別三諦通四教故通三諦[戶@句]別圓故別。",
    "X29n0597_004:0565a15_0": "三周中大擬法說中云若以小乘化此事為不可譬喻中云我身手有力當以机案從舍出之。",
    "X29n0597_004:0565a17_0": "置頓從漸本從乳出酪今文從佛出九部故云置頓。",
    "X29n0597_004:0565a19_0": "三德之名尚通外計塗身外道計大自在天具足三德云法身報身居自在天三目臂即摩醯首羅也而能化身隨行大道。",
    "X29n0597_004:0565a22_0": "大小六義前已籤。",
    "X29n0597_004:0565a23_0": "未擣未節華嚴等大乘戒定慧法藥小乘人未能服服只以三三昧為行耳。",
    "X29n0597_004:0565b01_0": "空假中三準此可知未得妙空如來擣未證妙假如來節節未入姓中如來合。",
    "X29n0597_004:0565b03_0": "具一切法一空一切空十界皆空假中亦爾而以三觀遍修三十七道品入三脫門開佛知見。",
    "X29n0597_004:0565b05_0": "共別二相空無想願此共攝漸空假中三此別攝頓。",
    "X29n0597_004:0565b07_0": "分別功德品",
    "X29n0597_004:0565b08_0": "疏五法成就一不墮三惡道二不生邊地三諸根完具四不生女身五常識宿命初僧祇時也。",
    "X29n0597_004:0565b10_0": "疏文略故從八生乃至四生不語七六五故。",
    "X29n0597_004:0565b11_0": "疏隨分生本論云隨力隨分八生乃至一生論云隨分者意云無明多分隨分而斷。",
    "X29n0597_004:0565b13_0": "初文具如今文初謂一證門也今文謂入初地證智等。",
    "X29n0597_004:0565b15_0": "證分八九唯識宗中但八識而已攝論師取第八識染淨二義又立第九真淨一識七八九識者謂末那阿賴耶菴摩羅。",
    "X29n0597_004:0565b18_0": "一十六字唐三藏譯婆沙論至說非非想處定遂為寶法師所難既不能通乃於論中加一十六字以為遮難之辭此乃添譯之過也。",
    "X29n0597_004:0565b21_0": "仍須正云九品別感方彰別接。",
    "X29n0597_004:0565b22_0": "上根七地若通教三乘三四為上五六為中七八為下今言上者或文誤或別有意。",
    "X29n0597_004:0565b24_0": "餘二意可見但破損生義也若增道及後八世發心不俟更破。",
    "X29n0597_004:0565c02_0": "天親以發心為無生忍非指八世界發心人也以論中將無生忍是證門發心為信門證深信淺故。",
    "X29n0597_004:0565c04_0": "疏十梵行品文彼經第十七云身身業語語業意意業佛法僧戒經中於此十內一一推撿何者是梵行耶乃至結云能如是觀初發心時即得菩提成就慧身不由他悟等。",
    "X29n0597_004:0565c08_0": "以十信功齊極位復成太過未見古人功齊之文今恐十梵行者信信皆修若竪對十信乃成身行在初信戒行在第十信非矣或恐再出前義有將十梵行判住行向地此成大過然住行向地非極更詳。",
    "X29n0597_004:0565c12_0": "初地見道若初地見道二地名修道妙覺名無覺道此是別非圓。",
    "X29n0597_004:0565c14_0": "疏得聞持陀羅尼入十行華嚴十行品云假使有不可說無數眾生共會一處其會廣大充滿不可說世界菩薩於彼眾中而坐是中眾生一一有不可說阿僧祇口一一口能出百千億那由他音同時發聲各別言詞各別所問菩薩於一念中悉能領受皆為訓對令除疑惑如一會中於不可說眾會之中亦悉如是此聞持也。",
    "X29n0597_004:0565c21_0": "得樂說辯才入十迴向彼迴向品云菩薩得決定辯才無盡藏演說一切佛平等法令諸眾生悉解了故。",
    "X29n0597_004:0565c24_0": "得無量旋陀羅尼入初地若寄別義是旋假入中能持善不失故名觀喜彼十地品云菩薩住此地念諸佛故生歡喜念諸佛法故生歡喜念諸菩薩故生歡喜念菩薩行念諸波羅蜜念諸菩薩地殊勝乃至云斷一切惡趣故生歡喜菩薩得歡喜地已五種怖畏悉得遠離。",
    "X29n0597_004:0566a06_0": "得清淨入三地彼經云菩薩住發光地觀一切法不生不滅於無量億那由他劫不積集故邪貪邪嗔邪癡悉得斷除所有善根轉更明淨譬如真金善巧鍊治種量不滅轉更明淨。",
    "X29n0597_004:0566a10_0": "無生已去約惑以論多番。",
    "X29n0597_004:0566a11_0": "不可即云四十二念既云無量念且無四十二念以至妙覺。",
    "X29n0597_004:0566a13_0": "據位必八略無七六五之言且寄八生後位言之。",
    "X29n0597_004:0566a14_0": "亦名法忍非獨此中再釋而諸句皆再釋云是第一義諦亦名第一義空亦名首楞嚴三昧又云是虗空三昧亦名廣大三昧亦名智印三昧乃至陀羅尼亦名無礙智師子吼亦名金剛三昧平等三昧亦名大慈大悲。",
    "X29n0597_004:0566a19_0": "發菩提心及二乘心經云無量恒河沙等眾生發菩提心無量恒河沙等眾生發緣覺心恒河沙等眾生發聲聞心。",
    "X29n0597_004:0566a22_0": "故云次第及番番等別立品目只次第及番番以為品目非經題目。",
    "X29n0597_004:0566a24_0": "疏得真似兩益無生忍至一生真益也其餘似益。",
    "X29n0597_004:0566b01_0": "疏雖戒能化藥王品疏云今品明化他之師經云宿王華汝於我滅後廣宣流布等。",
    "X29n0597_004:0566b03_0": "疏未若戒所化經云汝莫輕彼國等。",
    "X29n0597_004:0566b04_0": "而尚度之已如前說文殊於海而出記云菩薩入海豈須曰之又云或西天梵本有入海時。",
    "X29n0597_004:0566b06_0": "記後猶屬正法身記後更有餘長行文及偈頌猶屬正宗。",
    "X29n0597_004:0566b08_0": "攝五成四此品記末云第五品與第四信齊初二品當初信解第三品當第二信。",
    "X29n0597_004:0566b10_0": "文判四信得為十信此品疏末云四信與五品是同開五品對十信則四信為十。",
    "X29n0597_004:0566b12_0": "唱楞嚴名魔尚被縛佛說首楞嚴三昧經時魔欲為惱自見被縛。",
    "X29n0597_004:0566b14_0": "過減不同實成已久數過微塵此過也近成壽短此乃減也又玄文中謂初住得延促劫智或說現本壽長或現迹壽短亦過減也。",
    "X29n0597_004:0566b17_0": "窮理不二本迹。",
    "X29n0597_004:0566b18_0": "始終一摖心佛。",
    "X29n0597_004:0566b19_0": "止作二持律云止持者方便正念護本所受禁防身口不造諸惡目之曰止止而無違戒體光潔順本所受稱之曰持持由止成號止持戒作持者惡既已離事須修善必以策勤三業修習戒行有善起護名之為作持也。",
    "X29n0597_004:0566b24_0": "眾法少違四人已上行羯磨法名眾今且念念修觀若與眾同行羯磨等事故未暇為之。",
    "X29n0597_004:0566c02_0": "眾別兩行羯磨之法眾別不同若四人已上至百千人行單白白二白四等法者名眾法也其法有一百三十四番羯磨是也若二人對首及心念之法是別法也其法有五十番羯磨是也兩行共有一百八十四番。",
    "X29n0597_004:0566c07_0": "五篇一波羅夷僧祇翻極惡二僧伽婆尸沙善見翻眾初殘三波逸提翻墮四提舍尼翻向被悔五突吉羅翻惡作。",
    "X29n0597_004:0566c10_0": "七篇一波羅夷二眾初殘三偷蘭遮四波逸提五提舍尼六惡作七惡說。",
    "X29n0597_004:0566c12_0": "仍曉開遮輕重緣體此下是將聲聞菩薩兩戒對辯言開遮等者略依菩薩戒疏出其三且如殺戒者疏云菩薩七眾同犯與聲聞五眾大同小異同者同不許殺異者略有三事一開遮異二色心異三輕重異開遮異者大士見機得殺聲聞雖見不許色心異者大士制心聲聞制色輕重異者大士害師犯逆聲聞非逆又盜戒者開遮如前見機得不得等或復見機而盜必無盜心大士為物種種運為皆得聲聞自度心依規矩大士不畏罪但令有益即便為之下諸戒條太略例此。",
    "X29n0597_004:0566c22_0": "制緣漸頓聲聞因事制戒名漸菩薩不爾名頓。",
    "X29n0597_004:0566c23_0": "捨義有無菩薩戒二緣捨疏云若捨菩提願及增上煩惱犯十重則癈今言無者乃小義耳聲聞戒捨義有五毗曇云一增邪見二法滅盡三命根斷四犯重禁五罷道若雜心毗曇云但是穢戒除法滅盡及犯重禁並言不捨二根生時不入僧數又非尼攝餘部不言失。",
    "X29n0597_004:0567a05_0": "坐次分流菩薩戒七眾同受無擇道俗皆應先受戒者在先坐後受戒者在後坐若先大後小大依大坐小依小坐若先小後大聞小夏而成大夏依大先後若聲聞戒五眾同受則有異菩薩坐次也如百夏比丘尼禮初夏比丘足。",
    "X29n0597_004:0567a10_0": "懺法天隔聲聞懺法則有羯磨及出罪對首責心之異菩薩懺法但有要見好相及對首耳又若犯四夷許懺遮罪而性罪不滅若犯十夷懺得好相還同菩薩清淨戒體。",
    "X29n0597_004:0567a14_0": "七眾同不菩薩七眾同聲聞二眾不。",
    "X29n0597_004:0567a15_0": "大小共別大乘戒者先以小撿助成大儀如首楞嚴經云先持聲聞四棄八棄執持不動後行菩薩清淨律儀此所謂共也小乘戒者但專四分此所謂別也。",
    "X29n0597_004:0567a19_0": "而昧存亡緣謂罪性一切俱空何戒可持何罪可犯而不知住持三寶須依律儀及涅槃終制有戒則存無戒則亡。",
    "X29n0597_004:0567a22_0": "鳥鼠人也佛藏經云佛告舍利弗譬如蝙蝠欲捕鳥時則入穴為鼠欲捕鼠時則非空為鳥而實無有鳥鼠之用其身臭穢但樂暗瞑舍利弗破戒比丘亦復如是即不入布薩自恣亦復不入王者使役不名白衣不名出家。",
    "X29n0597_004:0567b03_0": "隨喜品",
    "X29n0597_004:0567b04_0": "既校量滅後五品之初初者謂五品中之隨喜品人也若據輔行則隨喜又通非入品隨喜人此五十人隨喜之心亦何必五品之初隨喜位耶。",
    "X29n0597_004:0567b07_0": "及隨喜後位五品入十信。",
    "X29n0597_004:0567b08_0": "好堅大論第十問諸佛功德無能勝者一切天地誰可為尊梵王答云佛為無上無過佛者譬如一樹名曰好竪在地百年枝葉具足一日出生枝葉悉具等。",
    "X29n0597_004:0567b12_0": "疏比是格劣經中四百萬億財法兩施正是比況格量第五十人之劣。",
    "X29n0597_004:0567b14_0": "疏大七小七大四十九小十四。",
    "X29n0597_004:0567b15_0": "式叉梵音式叉摩尼此翻學法女律云沙彌尼年十八歲時即受五戒受五戒已更用六法調心六法者殺淫妄華纓油塗如是滿二年已先受本法次於大僧處稟具五百大戒。",
    "X29n0597_004:0567b19_0": "如七世等儒論七廟釋談七佛。",
    "X29n0597_004:0567b20_0": "破古師中古人作五十位解傷文失理當知五十只趣舉凡耳。",
    "X29n0597_004:0567b22_0": "但染香處不須此相濕化兩報多是染香為因不須此中廣辨四生因果之相。",
    "X29n0597_004:0567b24_0": "經若有形十二類生攝六趣盡今文從卵生至非無想只舉十類略不言若非有形若非無形二類也然疏記不解者以近事故今恐晚覺輩亦有不識者銷經事昧今引孤山楞嚴經疏箋之言有形者疏云事日月水火愛此光明妄心執著名為色想日月星辰之類是也。",
    "X29n0597_004:0567c06_0": "若無形厭棄色想思無邊空色盡心空沉昧幽隱即無色外道之類。",
    "X29n0597_004:0567c08_0": "若有想外道凡夫祈神禱祀存立形影終身奉事經中謂鬼神精靈之類。",
    "X29n0597_004:0567c10_0": "若無想外道計無情有命金石堅固或習定灰凝思專枯橋化物成身若黃頭外道恐身死往問自在天天令往頻陀山取餘甘子食之延壽食已乃於林中化為石囑其徒曰吾沒後有人難者當書石上後陳那書難詞於石上石不能答遂吼碎又如晉書張華時燕昭王墓有孤謂華表曰我聞張司空多學欲往手之以為如何對曰我聞張司空者博物君子也非但損子亦乃禍吾狐不聽奉刺投華華與論天下人物多為所折天欲雨辭去華固留之謂左右曰我聞巢居知風穴居知雨不是狐狸即是老鼠乃密令人斫華表然而照之遂為狐狸而走此並木石精恠非究竟無情。",
    "X29n0597_004:0567c22_0": "非有想非無想此二類前第二卷已籤。",
    "X29n0597_004:0567c23_0": "初住校量帝釋問法慧菩薩云初住成就幾功德經中校量云供養十方阿僧祇眾生樂具經於千劫後令證支佛百千億分不及其一前第二記已箋。",
    "X29n0597_004:0568a02_0": "經褰縮上去乾切舉也下所六切短也。",
    "X29n0597_004:0568a03_0": "胗章忍切脣上瘡也又說文云脣瘍也。",
    "X29n0597_004:0568a04_0": "咼若牌切口戾也謂斜戾。",
    "X29n0597_004:0568a05_0": "窊鳥瓜切凹說文云污衷也記中作窳蓋寫誤窳音愈非也。",
    "X29n0597_004:0568a07_0": "大師有時依普賢觀如玄文云普賢觀五品在六根內明意稍難見而釋籤不解令疏中每一品開為二以難十信。",
    "X29n0597_004:0568a10_0": "法師功德品",
    "X29n0597_004:0568a11_0": "弟子通初後前疏自軌五法通稱弟子。",
    "X29n0597_004:0568a12_0": "誦說名通五師有誦說五品中有讀誦及解說。",
    "X29n0597_004:0568a13_0": "見聞十界而為外化疏以普現色身而為外化例今使十界機見菩薩像聞菩薩法為外化。",
    "X29n0597_004:0568a15_0": "餘三準知十界群機聞菩薩功德之香嘗菩薩甘露之味覩菩薩智慧之光斯亦為外。",
    "X29n0597_004:0568a17_0": "色等亦然向說六根根根十界而為外化若說六塵亦塵塵十界普熏眾生發菩提心。",
    "X29n0597_004:0568a19_0": "疏讀誦既爾不言受持而言讀誦者取化他二三中之一耳故云四種亦然則受持者亦爾此取五師果入六根中方具內外莊嚴。",
    "X29n0597_004:0568a22_0": "三品分之上中下四百合為千二百。",
    "X29n0597_004:0568a23_0": "況三品人三品共千二百無文可憑故云恨不依文。",
    "X29n0597_004:0568b01_0": "有師以光宅數為二品三品名同其數亦異共為千二百此更無準又有辨中邊論說三品數不欲引之。",
    "X29n0597_004:0568b04_0": "二二分對古人分六根為三下八百中一千上千二百若二二分對者眼耳一對為下但八百鼻舌一對為中但一千身意為上具千二百況經中耳舌各千二百功德身但八百則知分對乖理違文也。",
    "X29n0597_004:0568b08_0": "不假至者若苦澁物在其舌根皆變成上味餘三根更不假至而變。",
    "X29n0597_004:0568b10_0": "色二二十俱舍云色或二或二十且二十者謂青黃赤白長短方圓高下斜正雲煙塵霧影光明暗疏釋形平曰正不平名斜日焰名光星珠電等名明餘亦可見言二者二十種亦不出於形色顯色。",
    "X29n0597_004:0568b14_0": "聲八種前持品中已箋。",
    "X29n0597_004:0568b15_0": "人天等因人修戒善所感五塵則麤天修禪定所感五塵則細。",
    "X29n0597_004:0568b17_0": "更應多並一常一無常一思識一不思議。",
    "X29n0597_004:0568b18_0": "此中三業即是六根只約安樂行以明十善則已攝六根清淨人也疏中云五種法師悉具六根清淨而別明三業此成繁芿。",
    "X29n0597_004:0568b21_0": "疏六根互用良由性即是故根融有人云楞嚴經中如來自約根塵流變三疊以明眼根八百功德耳根千二百功德等文理分明與今經中配根數等而大師却約界如明其數目似非佛意孰故信乎嗚呼斯言之玷不可磨也蓋亦不本兩經之意故妄有彈射也孤山楞嚴疏云此明發覺初心令知顛倒處所居示凡夫六根優劣之用意在阿難擇於耳根以為修證之地彼明依經修行以發相似之解而六根清淨互用無方(已上正上)學本宗者見孤山之言亦可息疑謗也。",
    "X29n0597_004:0568c07_0": "疏若言八百顯其能縮有人問云若盈縮自在可云眼根千二百耳根八百否今為答之若了六自在王互用互徧則盈縮隨時子何不可又問今何不云眼千二百等耶答設經中云眼千二百汝又復問何故眼根不八百邪斯乃戲論耳但信如來金口盈縮之言凡夫妄情不應臆度。",
    "X29n0597_004:0568c13_0": "應云第二十信之名玄文與仁王經中少異今引玄文十名以仁王注之令知同異一信(同)二念(精進)三精進(念)四慧五定(並同)六不退(施)七回向(戒)八護法(同)九戒(願)十願(回向)。",
    "X29n0597_004:0568c17_0": "六根各十五眼之外又有智眼見諸法故光明眼見佛光明故出生死眼見涅槃故無礙眼所見無礙故一切智眼普見法界故此華嚴經前已籤。",
    "X29n0597_004:0568c20_0": "但離合異法眼開出智眼慧眼開出出生死眼餘者並佛眼開出。",
    "X29n0597_004:0568c22_0": "而復斥小小他心通所通不遠若斥之者如云不觀人根不應說法雖得宿命所知不遠等。",
    "X29n0597_004:0568c24_0": "未論修發真天眼等在凡修於事禪入聖發真天眼也言等者真天鼻舌等也皆聖真發也有人問頗有相似位人不得六根清淨否答因中不修事禪果上容有不如今經者也若今法師功德縱因中不修事禪而相似位中六根必清淨哉以由在五品時圓觀十界即空假中故至似位依理而見十界色像依理而聞十界音聲此乃弘經之功非由事禪也故今記云未論修是也。",
    "X29n0597_004:0569a08_0": "疏禪有八觸止觀云從未到定後或經一日一月一歲而定心不散即發八觸身八觸者謂動庠輕重冷暖澁滑。",
    "X29n0597_004:0569a11_0": "經若說俗間經書等實相入諸法故諸法是實相思益經云諸有言說一切皆是如語無異無別何以故諸有言說一切皆是如來言說如皷蠡等眾緣和合而有音聲是諸音聲無所分別以諸賢聖善知一切眾因緣故於諸言說悉皆平等(已上正文)彼方等經說從其體今六根位說從其用。",
    "X29n0597_004:0569a17_0": "以通前五皆不二故眼見耳聞皆可四月至於一歲以表諦緣又一月表菩薩乘若宣說之以三乘法順開權意皆是性海。",
    "X29n0597_004:0569a20_0": "常不輕菩薩品",
    "X29n0597_004:0569a21_0": "前正引昔正應作證疏云引人為證。",
    "X29n0597_004:0569a22_0": "言一乘者通於一部一乘者正因佛性也豈專此品耶。",
    "X29n0597_004:0569a24_0": "報陰現轉六根淨。",
    "X29n0597_004:0569b01_0": "以生後見記主大義在嘉祥後故云也亦可嘉祥後稟天台斯為正見。",
    "X29n0597_004:0569b03_0": "餘經所表權實尚隔如芥子納須彌表菩薩住不思議解脫經中斥云龍象蹴踏非驢所堪又云此座高廣吾不能升皆權實異表。",
    "X29n0597_004:0569b06_0": "此品兼表本迹疏中以不輕禮拜遠近表之。",
    "X29n0597_004:0569b07_0": "若令一人著論只天親一人以著二論何故一說有佛性一說無佛性故知下釋出。",
    "X29n0597_004:0569b09_0": "對法小義梵語阿毗達磨此云對法俱舍云敬禮如是如理師對法藏論我當說舊疏云一切法中真實法涅槃為相故稱達磨此智對諸法於法現前故也又疏云對謂對向對觀以因對果即對向也以心觀四諦即對觀也。",
    "X29n0597_004:0569b14_0": "自悲敗種迦葉言五無間罪猶能發意生於佛法而今我等永不能發譬如根敗之士其於五欲不能復利等。",
    "X29n0597_004:0569b17_0": "若唯識說正唯識論亦是天親所造所以言三無二有者蓋順方等斥奪之意。",
    "X29n0597_004:0569b19_0": "亦以四一而對四悉人一世界教一為人行一對治理一第一義。",
    "X29n0597_004:0569b21_0": "威熱無比根淨與值佛。",
    "X29n0597_004:0569b22_0": "化佛親說詮虗空身化即應佛也虗空身者而與下句空身不類或恐指修安安樂行者觀一切法猶如虗空或恐身字是法字耳學者詳之。",
    "X29n0597_004:0569c01_0": "此乃虗空身說詮於化事虗空身者經云於虗空中具聞威音王佛所說等化事者後更增壽命為四眾說法復化千萬億眾。",
    "X29n0597_004:0569c04_0": "或抑或覆抑二乘覆圓寶。",
    "X29n0597_004:0569c05_0": "廣略準知二十千萬偈與二十四字耳。",
    "X29n0597_004:0569c06_0": "禮知法者如來性品迦葉白佛若有長宿護持禁戒從年少邊咨受未聞當禮敬否出家人從在家人咨受未聞復當禮否然出家人不應禮敬在家人也佛乃答云有知法者若老若少故應供養恭敬禮拜。",
    "X29n0597_004:0569c10_0": "淨名中比丘禮俗富樓那為諸新學說法淨名訶已即自入三昧令諸比丘自識宿命時諸比丘稽首禮維摩詰足。",
    "X29n0597_004:0569c13_0": "即生隨從尚猶墯苦先曾輕賤後方隨從先賤而墯。",
    "X29n0597_004:0569c15_0": "廣對一切一切三法。",
    "X29n0597_004:0569c16_0": "疏龍繩採龍須草為繩縛身上以水洒之即入骨。",
    "X29n0597_004:0569c17_0": "如來神力品",
    "X29n0597_004:0569c18_0": "即從及諸已下文是寫倒一字應云即及從諸已下。",
    "X29n0597_004:0569c20_0": "理滿釋權疑唱滅釋近疑如云自住其中即果理滿也七方便權悉未滿故此釋權疑也如云如來非實滅度以方便力唱言滅度此釋近疑也只一涅槃雙釋二疑。",
    "X29n0597_004:0569c24_0": "不復別判甚深之事二門之宗皆因果也不復別判本迹二宗之殊。",
    "X29n0597_004:0570a02_0": "今借證理今經中於此之言蓋指實理。",
    "X29n0597_004:0570a03_0": "囑累品",
    "X29n0597_004:0570a04_0": "不越先規秀公亦依什本安品次第不妄有踰越也故第二教中云此亦是一見。",
    "X29n0597_004:0570a06_0": "正本既其居先正無添品。",
    "X29n0597_004:0570a07_0": "龜茲音丘慈。",
    "X29n0597_004:0570a08_0": "即而書之梵音正者或多含者即書之。",
    "X29n0597_004:0570a09_0": "論在後魏時譯後魏姓拓跋都雲中去晉凡二百年來論是勒那摩提三藏譯。",
    "X29n0597_004:0570a11_0": "人天來時但云三被移去。",
    "X29n0597_004:0570a12_0": "妙音被誡至久已還國者他人疊正義也義雖正他尚不肯遂執云土淨為集分身若分身在勸發品後方散當知爾前土尚猶淨若妙音被誡者還依舊誡耳謂戒分身未集已前之穢土也。",
    "X29n0597_004:0570a16_0": "上能見下心若淨於淨見穢無咎。",
    "X29n0597_004:0570a17_0": "何有靈山妙音來時若是淨土文殊海出乃亦淨土也豈是靈山之誡耶蓋誡本穢。",
    "X29n0597_004:0570a19_0": "若受多分觀音分寶不奉一分上分身者蓋分身即釋迦也。",
    "X29n0597_004:0570a21_0": "仰止止語辭也詩云高山仰止。",
    "X29n0597_004:0570a22_0": "以婆沙菩薩掩其眼謂法華只開二乘若菩薩人已是大乘而不知婆沙四階是小菩薩必須用開此所謂掩眼無見。",
    "X29n0597_004:0570b01_0": "三界八獄為大科三界與八寒八熱各作科段廣辨苦樂相狀反使今經成俱舍婆沙等論。",
    "X29n0597_004:0570b03_0": "以一乘四德為小義敗種聲聞莫非四德生方便者亦會一乘若謬謂定性永不作佛則便無開會之處。",
    "X29n0597_004:0570b06_0": "表現表當解瓔絡即事因法施即理因疏云分二分者表事理二因奉佛者將二因以趣二果也。",
    "X29n0597_004:0570b08_0": "嘲調調去聲謂弄也亦平聲謂調戲也。",
    "X29n0597_004:0570b09_0": "不應立送分身唱散之後經無復坐之文知囑累在後。",
    "X29n0597_004:0570b11_0": "若言經文次第地計囑累在經末者謂生起次第當如是也故今難之以為非汝言次第者至如不輕品內明行少功多其功既多便合勸持如云汝等於如來滅後應一心受持等而何故又以神力間之耶。",
    "X29n0597_004:0570b15_0": "而嫌妙經違論論云修行力有五乃至去如後品即囑累在後也若安中間乃違論文。",
    "X29n0597_004:0570b17_0": "即是回梵文大梵字不盡彼經云大梵自在天子況自在天子是欲界主豈名大梵即名以大梵二字冠於自在天子之首者乃是譯時回轉大梵字不盡其理。",
    "X29n0597_004:0570b21_0": "悉以能契之行為權如疏云其智慧門即是嘆權智也蓋自行道前方便有進趣之力故名為門從門入到道中為中為實道前為權。",
    "X29n0597_004:0570b24_0": "法慳悋於法施。",
    "X29n0597_004:0570c01_0": "藥王菩薩本事品",
    "X29n0597_004:0570c02_0": "佛有誠誡如云勒修苦行非涅槃因又云若人斷陰不如斷心。",
    "X29n0597_004:0570c04_0": "勝熱息善賊之疑華嚴經有婆羅門名為勝熱求一切智從刀山上自投火聚善財疑念是邪法耶善財言能入此者是菩薩行等善財悔過投入火聚遂得菩薩寂靜安樂照明三昧等。",
    "X29n0597_004:0570c08_0": "尼乾生嚴熾之解尼犍經云有王名嚴熾有大薩遮來入其國先為王說治國之法次為王說佛身相好及種性等乃令王觀如來身云大王當知依煩惱身觀如來身依陰界入觀如來身何以故此身即是如來藏故一切煩惱諸垢藏中佛性滿足。",
    "X29n0597_004:0570c13_0": "燒身得蘭梵語偷蘭遮善見云偷蘭名大遮言障善道體是鄙穢又翻為大罪亦言麤惡是重罪方便故也準目連問罪報經有犯蘭罪者如兜率天壽四千歲於人間歲數當五十六億六十千歲墯地獄中問燒身者本得殺罪何故得蘭答四分云倩他人殺己應得殺罪耶然自己命斷無殺可犯以燒身是殺方便故故蘭耳。",
    "X29n0597_004:0570c20_0": "開小乘遮不須開。",
    "X29n0597_004:0570c21_0": "遮菩薩開不不遮。",
    "X29n0597_004:0570c22_0": "兩眾如何布薩坐次一切各別。",
    "X29n0597_004:0570c23_0": "二體同異小乘戒體同號無盡。",
    "X29n0597_004:0570c24_0": "大秉於小取益何從涅槃終判太水並弘菩薩之心從大取益。",
    "X29n0597_004:0571a02_0": "小誦於大招損誰測但受聲聞戒而輙誦菩薩戒者例如沙彌先誦四分至受戒時則無作不發名為邊人小誦於大亦復如是至受菩薩戒時則大乘戒體不復發矣名為招損故戒疏云凡未受菩薩戒者皆名惡人若預為說後受不得又曠師疏中有大乘布薩儀式其間有遣眾慈云未受菩薩戒者出四分與遣眾同。",
    "X29n0597_004:0571a09_0": "淨穢並陳藥王愛道。",
    "X29n0597_004:0571a10_0": "令物會三若在穢土必先施三而然後會也彼是淨土云何施會耶然淨土多種。",
    "X29n0597_004:0571a12_0": "疏說本事只一行半偈而已有經更添兩句云供養諸如來者後人擅加笈多所譯亦但六句法護所譯七言偈亦但四句。",
    "X29n0597_004:0571a15_0": "疏支佛至無功用不段聞教故。",
    "X29n0597_004:0571a16_0": "餘經要因功用者但疊四果但取下方釋無作四諦。",
    "X29n0597_004:0571a18_0": "有五百具如前第一記。",
    "X29n0597_004:0571a19_0": "不老是樂玄文云達老死實相寶性論云恒即不老不變即不死。",
    "X29n0597_004:0571a21_0": "妙音菩薩品",
    "X29n0597_004:0571a22_0": "奉鉢對治八萬四千惑業是所治故。",
    "X29n0597_004:0571a23_0": "下從利他經中百千萬億眾生受苦稱名菩薩悉救。",
    "X29n0597_004:0571b01_0": "同在一名之內內蘊不輕之解外禮不輕之眾口宣不輕之教。",
    "X29n0597_004:0571b03_0": "五品皆同定無優劣自行化他悉無有異。",
    "X29n0597_004:0571b04_0": "以人對法觀世音從人普門從法餘四品亦其人法當說出其義。",
    "X29n0597_004:0571b06_0": "疏化他門中第二意前科云藥王下五品是化他流通藥王品勗法師流通妙音觀音兩品是勗子弟流通。",
    "X29n0597_004:0571b09_0": "並是法華異名三千體寂竪超一切無相而相名妙幢相性淨無染具於常樂名為淨德中理徧攝照明自在名宿王戲理定離計名無緣種智可信名智印十界語言皆名佛言名解一切眾生語言不捨真寂圓滿六度名集功德不起滅定現諸威儀名神通遊戲即定之慧能破惑闇名慧炬性具萬德名莊嚴王性淨照明名淨光明一念淨心具足權實功德名淨藏即邊之定有異偏小名不共圓光偏滿空不住空名日旋餘諸三昧義亦可了不復解釋。",
    "X29n0597_004:0571b18_0": "疏問訊傳旨經中無不孝父母有人用上一無字總貫下四句意云無不善心不無不攝五情不霅上讀經義云除不孝父母不敬沙門外皆讀為否乃成問善心不攝五情不。",
    "X29n0597_004:0571b22_0": "經或現梵王身梵釋名體銷經時不可不識今亦略箋梵王者菩薩修白色三昧不取不捨不取故不隨禪受生不捨故應為梵王說出欲論以權引實。",
    "X29n0597_004:0571c01_0": "帝釋身修難伏三昧不取不捨說種種勝論。",
    "X29n0597_004:0571c02_0": "自在天身欲界頂即魔王也修赤色三昧。",
    "X29n0597_004:0571c03_0": "大自在天身色界頂即摩醯首羅騎白牛八臂三目。",
    "X29n0597_004:0571c05_0": "小王或云天王為大人王為小輪王為大粟散大附庸為小。",
    "X29n0597_004:0571c07_0": "準下釋中普賢品中旋陀羅尼等三。",
    "X29n0597_004:0571c08_0": "觀世音菩薩普門品",
    "X29n0597_004:0571c09_0": "具足三釋因緣中須具四悉通別異世界與拔等為人智能斷惑對治觀冥於境是法身等第一義此通別義悉在於圓約教也本迹如文。",
    "X29n0597_004:0571c12_0": "疏人有多種法有多種人法各有四教不同。",
    "X29n0597_004:0571c13_0": "羅漢尚能回福為壽邊際定力回福為壽至彌勒下生回福為智即便入滅。",
    "X29n0597_004:0571c15_0": "疏一觀也也應作意。",
    "X29n0597_004:0571c16_0": "疏若就於行謂若依境起觀應名為世音觀。",
    "X29n0597_004:0571c17_0": "疏道前名方便等道前道後義亦多種今文以二乘歷別名道前入王三昧名道後。",
    "X29n0597_004:0571c19_0": "疏相似神通如上說法師功德品。",
    "X29n0597_004:0571c20_0": "疏修行中攝疏例如佛未值定光佛等文。",
    "X29n0597_004:0571c21_0": "疏如入法門中說疏若入王三昧一切三昧等文。",
    "X29n0597_004:0571c22_0": "疏修羅琴用師子筋為絃則不拊而韻。",
    "X29n0597_004:0571c23_0": "初略如釋籤中似多一初字籤引博物誌云伏羲造八卦神農造五糓貨狄造舟維文造臼杵蚩尤造兵乃至嵆仲造車伯益造井蒙恬造筆。",
    "X29n0597_004:0572a02_0": "是名供養普今疏先結他化也次結自行玄文中先結自行次結化他義亦無任。",
    "X29n0597_004:0572a04_0": "此土識過而肉袒史記張祿元是范睢魏人也初仕魏與中大夫須賈使於齊以睢為賢私賞金壁賈嫉之纔於魏云范睢以魏密事告齊魏大怒拉脇折齒棄廁中睢求圊者出之遂易姓名曰張祿隨秦使見昭王王悅之拜為客卿稍遷左丞相後須賈為秦使睢微服而出賈見大驚知是秦相乃脫冠肉袒入謝罪。",
    "X29n0597_004:0572a11_0": "疏大品空無盡經中歷一切因果凡聖依正以明空義。",
    "X29n0597_004:0572a13_0": "大集八十無盡門經云一切諸法因緣果報無盡一切諸法不可盡初發菩提心已不可盡譬如虗空不可窮盡為一切智發菩提心豈可盡乎諸佛戒定慧解脫解脫知見十力無畏等無盡因如是等發菩提心故不可盡乃至六波羅蜜無盡等。",
    "X29n0597_004:0572a18_0": "正在和合皆無自性為因智故境不因智故境亦因智亦不因智故境非因智非不因境故境此權境無性又因境故智不因境故智亦因境亦不因境故智非因境非不因境故智此權智無性然後以無性之智冥無性之境境智和合能顯中道。",
    "X29n0597_004:0572a23_0": "疏善惡合為機單善單惡不得為機玄文云始自地獄終至等覺皆以善惡相帶為機。",
    "X29n0597_004:0572b01_0": "經聞是觀世音菩薩一心稱名疏云聞有四義若能通達四種聞義即聞慧心無所依無住無著即思慧一心稱名即修慧。",
    "X29n0597_004:0572b04_0": "有人以觀世音三字著下句上觀世音即時觀其音聲。",
    "X29n0597_004:0572b06_0": "興皇著上句末一心稱名觀世音菩薩。",
    "X29n0597_004:0572b07_0": "下句上又足觀世音三字連上句讀者則云一心稱名觀世音菩薩觀世即時觀等。",
    "X29n0597_004:0572b09_0": "疏果報火地獄已上初禪已還疏云阿鼻隔子八萬四千內外洞徹上下交炎餓鬼支節煙起畜生燠煑陽炭修羅亦有火難人中焚燒現見若至劫燒須彌洞然初禪已下無免火災。",
    "X29n0597_004:0572b13_0": "惡業火隨有改惡修善之處若五戒十善多為惡業所難經云燒諸善根無過瞋恚術婆伽為欲火所燒金光明云憂愁盛火今來燒我能破善業皆名為火。",
    "X29n0597_004:0572b17_0": "煩惱火行人修道之時並為五住煩惱惑火之所燒害方便未成火難恒逼。",
    "X29n0597_004:0572b19_0": "如禮諸佛教說功異如救燄口經施鬼神食時令稱四佛名稱多寶佛名者令鬼神轉煩惱障及業障稱妙色身廣愽身離怖畏如來名者令鬼神俱除報障。",
    "X29n0597_004:0572b23_0": "經六十二億恒河沙菩薩如何須六十二等耶首楞嚴經云此三千大千世界現住世間諸法王子有六十二恒河沙數修法垂範教化眾生。",
    "X29n0597_004:0572c02_0": "疏格六十二億徧菩薩等一圓菩薩別行疏中釋之或異彼云田有高下薄瘠所致如供百初果不如一二果乃至無學此亦非嘆德之意乃是以下比高法應優劣耳今明一多性不可得無有二相二則非一多則非多同入實際正等無異一中解無量故說六十二億無量中解一故說觀音是為正等。",
    "X29n0597_004:0572c08_0": "心境俱劣等疏云心有濃淡皆是前人心力所致何關觀音(正文)準一多相即乃是正義也。",
    "X29n0597_004:0572c10_0": "加難解難知經云難解難入疏云十住始解十地為入論中此前更加三句謂難見難覺難知記云此難解方便可對聞思修解字誤應云難見。",
    "X29n0597_004:0572c13_0": "乃增三句謂建大法幢然大法炬不斷大法皷。",
    "X29n0597_004:0572c14_0": "說三乘者謬矣首楞嚴經孤山判在法華部類而經中觀音菩薩說三乘法如云若諸有學寂靜妙明勝妙現圓我現獨覺身而為說法若諸有學斷十二緣我現緣覺身而為說法若諸有學得四諦空我現聲聞身而為說法讀者須和融之令無相違。",
    "X29n0597_004:0572c19_0": "經解頸真珠瓔珞疏云頸者表中道一實之理以眾多無著法門莊嚴解者表菩薩修常捨行故一切願行功德乃至佛智菩提涅槃亦不住亦不著。",
    "X29n0597_004:0572c22_0": "受此法施疏云正以財通於法名財即法財即因緣生法即空假中三諦一心一切具足於法平等於財亦等名法施。",
    "X29n0597_004:0573a01_0": "呪詛諸毒藥還著於本譬喻經中有清信士梵志從其乞飲不暇與之遂起尸使鬼往殺之時山中有羅漢教令歸奉三寶於是至曉鬼不得便鬼乃悉反害梵志羅漢蔽之令鬼不見清信士悟道梵志得活等。",
    "X29n0597_004:0573a06_0": "真觀清淨觀別行記中云五觀字皆去聲呼真觀空也清淨觀假也令地淨故智慧觀中也雙遮雙照平等大慧故慈悲觀者以無緣慈觀察眾生又慈悲之法必用三觀霅上音五觀字皆平聲。",
    "X29n0597_004:0573a10_0": "常願常瞻仰上一常字據玄寂僧錄音訓云據藏經中及諸處古本皆是當字耳類如云當願眾生應當發願應當繫念當離放逸。",
    "X29n0597_004:0573a13_0": "悲體戒雷震記云悲體下一行誦口業初二句頌二輪化本說雖在口必假身意為授法本為法現形本期救苦故說法身名為悲體此身先用戒德警人如天震雷物無不肅慈意普覆名曰大雲二輪既施然可授法。",
    "X29n0597_004:0573a18_0": "妙音觀世音等記云五音字皆眾生稱唱之音菩薩妙智觀故成三諦境雙遮空有即妙音雙照空有即世音此二字中智境也梵音是慈悲喜捨四觀照之即俗諦照機不差名海潮音此二音字假智境也畢竟空智出九界情照眾生音起二世相名勝世間音此一音字空智境也。",
    "X29n0597_004:0573a24_0": "或品似大益有大小如淨佛國品五百長者得無生忍此益大也求聲聞乘三萬二千人智有為法皆悉無常得法眼淨此益小也。",
    "X29n0597_004:0573b03_0": "或品似小益有大小如弟子品目連章中云法住實除諸邊不動故法無動搖不依六鹿故說是法時時八百居士發菩提心此益大也須菩提章中云不著文字文字性離是則解脫說是法時二百天子得法眼淨疏云是悟通教即空之理得入見道真中分之通亦名小。",
    "X29n0597_004:0573b09_0": "或兼大小益亦大小如金光明懺悔品通三乘懺悔三乘該四教三障滅時各自得益又最勝王經云若欲求預流果一來果不還果阿羅漢果亦應懺悔滅除業障欲求三明六通聲聞獨覺自在菩薩至究竟地求一切智等亦應懺悔滅除業障此品大小具四教義足。",
    "X29n0597_004:0573b15_0": "皆以向來三義銷之類密不定。",
    "X29n0597_004:0573b16_0": "陀羅尼品",
    "X29n0597_004:0573b17_0": "敦之以呪術謂以呪通之令淺識者恭謹受持。",
    "X29n0597_004:0573b18_0": "幽顯挾贊挾護贊助也幽謂鬼神顯為菩薩。",
    "X29n0597_004:0573b19_0": "矯俗巫覡多詐。",
    "X29n0597_004:0573b20_0": "疏那達居士未檢。",
    "X29n0597_004:0573b21_0": "大明呪等呪謂呪願有二種謂顯密也顯露者大明等三是也秘密者今之存梵音者是也大論有問釋提桓因何以般若為無上明呪答諸外道聖人有種種呪術利益人民誦是呪者得大名聲入民歸伏貴是呪故名般若以之為呪帝釋白佛是般若呪常與眾生道德樂故餘諸呪術能增長惡般若神呪能滅諸佛涅槃諸著何呪貪等是故名為大明呪無上呪者大或有上故次名無上無等等者等此無等名無等等皆破無明故並云明又諸佛於一切眾生中無等故般若名無等又無等等者妙覺位也無能等此無等之位故名無等等已上並大論文。",
    "X29n0597_004:0573c08_0": "總用等輔行云遮惡為遮持持善為總持用此明呪遮惡持善聞者歡喜是世界餘三次第以對三悉。",
    "X29n0597_004:0573c10_0": "別對三教大明破三藏小外之不明無上破別地前之有上無等等破圓金剛前心之有等若大論言破無明者三惑皆通稱之。",
    "X29n0597_004:0573c13_0": "禳災增益攝召禳災如熾盛光增益如功德天呪滿所求攝召如灌頂呪又責鬼神。",
    "X29n0597_004:0573c15_0": "並名真言托神呪以觀真心如誦大悲呪欲求智慧者經云當於寶鏡乎以觀心鏡鏡明性十界像生修十界故名真。",
    "X29n0597_004:0573c18_0": "及以明等明真言無上明無等等明言。",
    "X29n0597_004:0573c19_0": "種子有佛頂陀羅尼名佛頂種子誦之者是了因佛之種子故。",
    "X29n0597_004:0573c21_0": "疏先陀婆涅槃經有四物謂鹽水器馬通名先陀婆。",
    "X29n0597_004:0573c23_0": "經羶帝有人呼于為千非矣准禪秘要經作釋看切周本作書安切。",
    "X29n0597_004:0574a01_0": "疏俱有此鬼人用起尸鬼夜叉用起尸鬼。",
    "X29n0597_004:0574a02_0": "未損大儀或是義。",
    "X29n0597_004:0574a03_0": "妙莊嚴王品",
    "X29n0597_004:0574a04_0": "疏紛愀愀親小切容色變也非矣應作湫子了切隘也。",
    "X29n0597_004:0574a06_0": "喀喀音客謂失於一飡。",
    "X29n0597_004:0574a07_0": "門閭力居切閭侶周禮五家為比使之以相比保五比為閭使之以鄰侶相愛。",
    "X29n0597_004:0574a09_0": "甘苦無喜慍慍於運切怒也僕奉主優客之則甘而有喜過勞之則苦而無慍。",
    "X29n0597_004:0574a11_0": "噏赫噏許及切此乃內息耳應作翕謂盛也。",
    "X29n0597_004:0574a12_0": "不貲音茲貨財用之無盡曰貲。",
    "X29n0597_004:0574a13_0": "籠樊樊謂藩籬也詩云青蠅于樊取飛舞不能出之義也。",
    "X29n0597_004:0574a15_0": "以勗受法弟子所將之眾。",
    "X29n0597_004:0574a16_0": "今佛前光照相菩薩是妙音今佛前者妙音品也此菩薩事訖已歸本國今懸指之耳言光照者或釋尊光照其身或菩薩光明遍照言莊嚴相者經云百千功德莊嚴其身等。",
    "X29n0597_004:0574a20_0": "且從後記燒身在前獻呪在後。",
    "X29n0597_004:0574a21_0": "雙觀師弟此謂妙音也誡云汝莫輕彼國及所將謂雙。",
    "X29n0597_004:0574a23_0": "華德復為妙音所將為字去聲呼。",
    "X29n0597_004:0574a24_0": "有稱歸心國名。",
    "X29n0597_004:0574b01_0": "疏四弘應作等。",
    "X29n0597_004:0574b02_0": "亦不的對不將慈悲喜捨對願智神通方便四波羅蜜。",
    "X29n0597_004:0574b04_0": "疏餘經為正道大論云三十七道品是菩提大品云欲以一切種智修四念處者念處法界攝一切法一切法趣念處是趣不過。",
    "X29n0597_004:0574b07_0": "行行為助道九想十想不淨觀等。",
    "X29n0597_004:0574b08_0": "可具釋之右脇出水左脇出火左脇出水右脇出火并身上下出水火為四共為八履地如水履水如地又空沒現地地沒現空及空中行住坐臥已上十六第十七現大身滿虗空中第十八大復小現。",
    "X29n0597_004:0574b12_0": "攝一切法歸一實相如前指方便品諸法實相界如因果。",
    "X29n0597_004:0574b14_0": "普賢菩薩勸發品",
    "X29n0597_004:0574b15_0": "疏所逕歷處逕應作經經云所經諸國。",
    "X29n0597_004:0574b16_0": "釋衣等三皆通兩句法歸如疏云慈悲覆物惠利歸己名之為室遮彼惡障以醜名之為衣餘二例此。",
    "X29n0597_004:0574b18_0": "而為四釋約位約智約門觀心。",
    "X29n0597_004:0574b19_0": "而迷其本斥無啟心投想之人。",
    "X29n0597_004:0574b20_0": "如魯人耳家語有問魯人曰仲尼何人也對曰東家丘我知之矣。",
    "X29n0597_004:0574b22_0": "疏歡喜如前說或歡喜地或歡喜住。",
    "X29n0597_004:0574b23_0": "經正定聚聚有三謂邪定不定正定邪定則博地不定則住前正定則十住本業瓔珞經十信菩薩如空中毛此名不定聚據地正定在十住明矣然正定位寬疏謂十地若俱舍中諸聖人名正定造五逆名邪定自餘凡夫名不定定聚名同大小位別。",
    "X29n0597_004:0574c05_0": "法華文句記箋難卷第四"
}