{
    "X29n0594_003:0032a09_0": "天台法華疏義纘卷第三(本)",
    "X29n0594_003:0032a11_0": "東春沙門　智度　述",
    "X29n0594_003:0032a12_0": "　　釋別序",
    "X29n0594_003:0032a13_0": "【記】云且約當教相望者是約法華經通別二相望不同前釋通序望一代故彼云通序諸教等。",
    "X29n0594_003:0032a15_0": "【記】云佛序者別序中五皆由佛也如由佛故眾集現瑞由佛故指一說多入定雨華動地放光等皆由佛也疑念發問答問例然故云佛序弟子經前後如前釋。",
    "X29n0594_003:0032a18_0": "【記】云若直就等者約四味論通別也初云通序文通而義通者如是等五文通一代故義通者約當部內如華嚴二方等四般若三通當部機等不對他部故記云部含諸教也。",
    "X29n0594_003:0032a22_0": "【記】云亦有義通而意別者義通如前意別者如華嚴雖義通二教意在頓乳方等義雖通四意在生酥彈斥般若雖通三意在熟酥淘汰故云別在諸味也。",
    "X29n0594_003:0032b01_0": "次釋別序云文別而義別者如方等合蓋般若持鉢文之與義各在當部故。",
    "X29n0594_003:0032b03_0": "【記】云事在當經文亦有義別而意通者義別如前意通者通一代皆有別序也故記云通諸教是也次又亦第二重釋云通序文通而義別者文通同前義別者如華嚴但對二教方等對四般若對三鹿苑對一故記云隨部對教多少別故是別序文別而義通者文別同前義通亦約當部內如華嚴二鹿苑一方等四般若三故記云通敘部內教多少是也前意通對一代釋今義通對當部內釋故有別也不然則成重過(云云)。",
    "X29n0594_003:0032b11_0": "【記】云華地專表斯典意密未宣者唯表定後一乘因果而眾不知故云意密也。",
    "X29n0594_003:0032b13_0": "【記】疑念雙緣過現者從說無量義經竟即入彼定不知定起為說何等故云猶預當也。",
    "X29n0594_003:0032b15_0": "【疏】因緣一釋尚自不明者記云有世界無餘三悉名尚自不明今觀此文光宅亦無世界釋若逆順生起是世界者即表人一如何釋尚自不明故四悉全無名不明也。",
    "X29n0594_003:0032b19_0": "【記】云雨華表中位中地動總成人一者今恐眾喜瑞表人一華地及光總表理一不爾則闕眾喜也(思之)直云比丘等四有人云天龍等四等取人鬼意云人中攝得比丘比丘尼等四雖加龍鬼及天而闕菩薩眾也又云梵魔是色欲天眾沙門婆羅門是人中二眾人天其名四眾沙門攝得外道及出家人婆羅門攝俗二眾梵攝諸天魔是欲主即不攝神畜等也又云聖有二眾謂聲聞菩薩凡有二眾謂客舊二眾國王為舊餘眾是客名四眾又云聲聞菩薩各有二客舊觀音勢至是他方大士為客賢護菩薩是王城主人為舊此是菩薩有客舊也聲聞中阿那律是迦毗羅人為客王城中聲聞為舊也此是小乘有舊客也。",
    "X29n0594_003:0032c07_0": "【記】云雖有此列不判凡聖逆順權實說默今昔微著共別兼獨施開本迹都無旨歸者結緣眾是凡影響等三眾是聖逆順者調達嚴王是逆餘者是順權實者發起影響是權當機通權實結緣唯實說默者發起是說影響是默當機通說默默念發言二領解是也言今昔者發起等四眾在昔則通諸部偏圓在今則唯開權顯實言微著者能引發起影響從微至著所引當機結緣亦從微至著又前三眾為著結緣為微又下種為微熟脫為著言共別者約教發起影響等四能引在昔與諸教共如藏通各有三乘故名共又別圓約多人共化故名共所化機生未轉名別言兼獨者約部發起等四能引在昔華嚴方等般若名兼鹿苑名獨至今經開顯唯圓亦名獨也言施開者能引在昔同權名施至今開竟名開言本迹者發起本或古佛法身菩薩迹通五味也。",
    "X29n0594_003:0032c22_0": "【疏】發起者權謀智鑒知機知時者能發起菩薩有照機權智任運而達不謀而鑒故名權謀鑒亦照也時謂五時機謂四發四發時有前後機有生熟在菩薩懷故云知也引至佛所故云擊揚發動能擊揚發動是菩薩所擊揚發動是是五序謂發動令眾集說無量義入定雨華地動眾喜放光疑念問答等皆為所發起也成辦利益者即四教機五時得益不同皆因發起菩薩今佛定起說經即當機結緣增道損生名成辦利益也如大象躃樹等者大象喻發起菩薩樹喻佛法身躃倒喻起應應身說法令機得益名象子得飽飽不同四教益異今佛定起飽圓機象子也。",
    "X29n0594_003:0033a09_0": "【記】釋又割之令開下約發起二字義兼能所是世界義又擊揚發動四字約為人義又擊發揚動四字約對治義又扣佛下八字約第一義意今謂佛正在定是發起菩薩擊揚非開佛也定後說經方發四益序中得益或過去種熟今於序中得脫皆第一義不應四悉不同(思之)。",
    "X29n0594_003:0033a15_0": "【經】圍繞者周迴曰圍坐遍稱繞進財行為供有攝資行名養明謹曰恭今疏云卑謹曰恭宗仰曰敬今疏云虔禮曰敬敬甚曰尊尊深曰重今疏云至念專注至念是尊專注是重於理談美曰讚觸事論德曰歎四句中初二是身業次一是意業讚歎是口業又圍繞者釋論云大眾圍繞則便佛德益尊既尊其人民必受其道故明圍繞也其猶諸梵之繞梵王忉利之繞帝釋檀林師子坐(思之)。",
    "X29n0594_003:0033a23_0": "【疏】感應妙中已說者記錄彼文句十妙次第長行此土六瑞智妙對眉間第六瑞行妙對入定第二瑞位妙對雨華第三瑞神通妙對地動第四瑞眷屬妙對眾喜第五瑞即取下偈中嚴淨對境妙香風乘妙是開雨華瑞位妙出境妙及乘境是位始乘是位終故四華瑞攝三妙也感應妙取長行四眾疑念序為機見八千為應先光表智此取能應故表感應妙也天皷是下荅問序文表說法妙修行是他土菩薩修勤種種行文表利益妙故通彼此六瑞對十妙也今更噵者但此土六瑞對十妙也如疏。",
    "X29n0594_003:0033b09_0": "【記】釋云一家釋瑞必有所表是則大事大人作大感動者是放光瑞表感應神通二妙是人一大機大益顯於大理者是雨華動地瑞表位境乘三妙是理一須大眷屬以輔大會者是眾喜瑞表眷屬利益說法及智四妙是教一俱感大時大運成就者是入定瑞表行妙即行一不同他對(思之)。",
    "X29n0594_003:0033b15_0": "【疏】說大乘經者百法疏云萬行稱之為乘或可真如亦名為乘若萬行為乘即持業釋亦乘亦大名為大乘若通真如名大乘即依主釋大之乘故解曰亦乘亦大者萬行名大即是乘體乘是大用即是乘體是大用大體能任持乘之業用將體就用大亦即乘將用就體乘亦即大合此二義名亦乘亦大又云通真如等者大即真如是主義乘屬萬行是客義依主如萬行依真如體名依主釋也此釋體用不融成別教義(云云)今疏云大因大果合為大乘者即是亦乘亦大也即萬行廣多名大從因至果名乘故云亦乘亦大也與持業釋同若下云十妙釋七大者境妙是理名大即乘之體有餘六大名乘與依主義同又一家圓教大乘不作六釋何者若言依主釋今圓教生死即涅槃不可生死為主也若言持業者一即無量無量即一持業不成若言帶數釋者即一而三即三而一何數之有若言有財釋者如云富兒錢寶名富五蘊假者不名富也今取錢寶以名假者名為富兒故云有財釋今圓寶法他即是自故無有財若言隣近釋者如云念處先能觀為念念是念心所明記為性慧是慧心所簡擇為性二種不同今言念為能觀者與慧隣近故若釋圓教境智不二念慧相即故無隣近也相違釋准知如是六釋但是藏別二教中義圓通二教皆不相應(思之)。",
    "X29n0594_003:0033c14_0": "【疏】善戒七大者與對法論涅槃同彼論云即此乘性由與七種共相應故名為大乘一戒經云法大性謂十二部論云境大性以菩薩緣百千教法為境故二經云心大謂求菩提心論云行大性以求菩提心亘自利利他二行故三經云解大謂解菩薩藏論云智大性了二無我智解菩薩藏故四經云淨大謂見道淨心論云精進大性即由精進練磨其心入於初地見道令心淨故五經云莊嚴大謂福慧也論云方便善巧大性由具悲智二種悲同經福德智慧有大智故不住生死有大悲故不住涅槃故名方便善巧六經云時大謂三祇行行論云時大性窮生死際盡未來時七經云具足大謂相好論證得大性成就十力四無畏等諸功德故。",
    "X29n0594_003:0034a03_0": "【疏】基師云者越州法華寺基法師也解云無量義者所謂義空也若是有法則有分限名為有量空義深廣稱為無量問若爾與第二時大品教何異彼答云前教明空為三乘行本不得為法華序此中明空為大乘行本故得為法華序故疏引大品非法華所指是基師義耳。",
    "X29n0594_003:0034a09_0": "【疏】指不來秦地者是印法師義吉藏引云印師固執不移云明空無量義經者即是餘時說耳非法華中辯無量義經也法華前無量義經正明萬善成佛文不來秦地是印師義耳。",
    "X29n0594_003:0034a13_0": "【疏】印師云無相善有成佛者此經辯無量萬善也以現在行無量萬善故來世成佛問若說萬善成佛與法華何異答此無量義經中覆相明萬善成佛不言萬善之外無三乘義無量義經但顯實未開權故得為序今疏引云彼經不說有三無三有異者即無量萬善外不說有三無三若說有三但彼經已顯實未開權故得為序老說無三即說法華無異也。",
    "X29n0594_003:0034a20_0": "【疏】光宅云破三與歸一為異故即為序者意謂光宅法華破三無量義萬善歸一與破三為異故得為序非是異無二無三名異也。",
    "X29n0594_003:0034a23_0": "【疏】論列十七名者論云此大乘修多羅有十七種名顯示甚深功德應知何等顯示一名無量義經者成就字義故以此法門說甚深法妙境界故彼甚深法妙境界者諸佛如來最勝境界法故經云甚深無量也二名最勝修多羅者於三藏中最勝妙藏此法門中善成就故解云彼大論四釋一云除疑入法經勝謂除聲聞疑并異生入法令離苦故樂行中道行律勝發生智慧論勝二云甚三字故經勝與定慧為安立處所律勝今得正見故論勝三云離欲得定生上界故經勝免三惡趣得人天身律勝斷無明惑出於三界論勝四云離貪經勝離嗔律勝離癡論勝問唯此四解俱有所長何故今言經為最勝答為於此經會三歸一異餘經律論故名為勝也故經云於諸經中最在其上三名大方廣經者無量大乘門隨順眾生根住持成就故解曰理正名方包含名廣經云當為如是等廣讚一乘道四名教菩薩法者以為教化根熟眾生隨順器善成就故經云名妙法蓮華教菩薩法也五名佛所護念者以依佛如來有此法也經云我常守護不妄宣說六名一切諸佛秘密法者此法甚深唯如來知故經云如來秘密神通之力七名一切諸佛藏者如來功德三昧之藏在此經故經云如來一切秘密之藏八名一切諸佛秘密處者根未熟者非受法器不授與故經云秘密之藏長夜守護不妄宣說故九名能生一切諸佛經者聞此法門能成諸佛大乘故經云乃至一念隨喜我與授記三菩提也十名一切諸佛道場者聞此法門能成諸佛阿耨菩提非餘修多羅故經云當知此處即是道場十一名諸佛轉法輪者此法門能破一切諸障礙故經云諸佛於此轉於法輪十二名一切諸佛堅固舍利者謂諸如來真如法身於此修多羅不敗壞故經云當知是處即有如來全身舍利又以佛舍利起七寶塔十三名一切諸佛大巧方便經者依此法門成大菩提已為眾生說天人聲聞辟支佛等諸佛善法故經云慇懃稱歎方便是十四名說一乘者以此法門顯示如來阿耨菩提究竟之體彼二乘道非究竟故經云一切諸世尊皆說一乘道是十五為第一義經者以此法門即是諸佛如來法身究竟住處故經云此法華經於諸經中最為第一十六名法華經者有二種義一出水義以不可盡出離小乘經泥濁水故(云云)二者華開義以諸眾生於大乘中其心怯弱不能生信是故開示諸佛如來淨妙身令成生信故正當此名有解云無量義如出水即約教理此經如開敷即約行果又云各具教理行果若爾彼是出此是會入望今四一由闕人一果是行終復成剩長十七名最勝法門者攝成就故攝成就者攝無量名句字等偈故此十七句中法門句是總餘句是別故。",
    "X29n0594_003:0034c21_0": "【疏】從一義處出無量法至序者此無量義處各有兩兼從能生所生之無量是序即別卷經是若會所歸能無量即正宗是經之異名若從能生於所之義處是序若會所歸能之義處是正宗故兩兼。",
    "X29n0594_003:0035a01_0": "【疏】常等四至住處者即是寂光四德為處也能觀是報身智所觀是法身境二身皆具常等四俱是能依土即所依能所不二而二立身土名耳言所攝成處者遍法界皆常也所安立處者法界自在也淨者遍法界三惑名為淨樂者住於法身不住十界色身境名不住身心相故。",
    "X29n0594_003:0035a07_0": "【疏】前後兩文者觀經結法華名後准梵網結華嚴仁王結般若像法決疑結方等遺教結涅槃皆文義同於正經故名結也。",
    "X29n0594_003:0035a10_0": "【疏】壽量而是無常者於二經中中間說法華迹本二門縱汝說迹門如來近成可云無常而其所說唯有實相豈不是常耶況本門長遠之壽寧是無常如壽量品(云云)。",
    "X29n0594_003:0035a14_0": "【疏】佛所護念者佛所證理是所護念法如來是能護念人昔知機未熟不說所證名之為護恐此眾生但取方便故名為念引證云眾生根鈍不務速說故言護念若取能生為護念是異名若取所生為護念是覆相於昔所生未開為能但得名序若開為能名護念即正宗。",
    "X29n0594_003:0035a20_0": "【疏】若明文等者記云覆別從通者經家覆法華定之別名從無量義三昧之通號時眾謂重入無量義三昧不識是法華三昧故結集人加之以處即是法華異名定也大通智勝說此經已即入靜室者問釋迦何不入定讓羅云結緣耶答記云但羅云通化即共羅云一代五時通共教化眾生作種熟脫無有別結之機故也有云佛滅後名通化與大通入定讓結何殊不可也。",
    "X29n0594_003:0035b04_0": "【疏】大通身體至不動者問大通入定與釋迦何別答記云若分所入相同時別謂二佛入定皆身心不動名相同釋迦說經前大通說經後各各時別也。",
    "X29n0594_003:0035b07_0": "【疏】問瑞相本論奇異說法入定佛之恒儀何得為瑞者古人與皇不立為瑞但用雨華動地放光三並疑念發問答問為六故今難云何意非瑞也。",
    "X29n0594_003:0035b10_0": "【記】云文殊引古至一定二義不疑者恐悞此是引古入定為序故云何以證今何謂一定證有二義。",
    "X29n0594_003:0035b12_0": "【疏】舊小大白等者光宅云初二是赤圓華本赤圓華次二是白圓華。",
    "X29n0594_003:0035b14_0": "【疏】常雨五色華者河西道朗云天華名也中國亦有之其色似赤而黃如青而紫如綠而紅。",
    "X29n0594_003:0035b16_0": "【疏】銅輪種性等者有解云十善菩薩發大心長別三界苦輪海者雖歷十千劫終不墮惡道信位中分為上中下三品中下品善於南洲作粟散王上品善鐵輪王王南洲也十住名習種性為銅輪王王東南二洲十信即十住中攝十行性種性為銀輪王王東南西三洲十向道種性為金輪王王四天下問此四威伏何別答金輪聞名響應銀輪遣使方伏銅輪身至始從鐵輪興兵現威始來歸化問曰王各何時出等(云云)今謂長別三界是圓教十信不應歷十千劫是別教十信耳闕瑠璃輪聖種性(云云)問善戒地持瑜伽唯識等經論初性後習仁王瓔珞初習後性何耶答善戒等據法爾無漏種子故性種在前次增修習方有新熏故習在後仁王不立法爾唯有新熏故習在前次由修學習已成性在後後近聖道名道種子性瓔珞又開六種四如文加金剛心是等覺性解脫道名妙覺性唯大師釋菩薩戒疏云性習二性若據位分習種在前性種在後若據行論性習同時故前後不定依體起用先明性種後明習種尋用取體先習後性與證教二道相似就位以論教道在前證道在後據行證教同時故前後不定依體起用先證後教尋用取體先教後證也習種性能生報佛性種能生法佛如唯識云理性行性真如理為理性有四智菩提種子名行性四智者大圓鏡智第八識平等性智第七識妙觀察智第六識成所作智前五識轉八識為四智名行性即是新熏決定性聲聞人無行性故不成佛若爾即無報身佛性故不可也解曰唯識中轉八識中心所慧為四智耳(云云)。",
    "X29n0594_003:0035c19_0": "【疏】四輪是別位義者止觀第三云三處雙流乃設問云瓔珞經中列位始終唯初地三觀現前道觀雙流今此何故取通教八地別教初地並圓初住並判雙流故彼答借別八地成通教下即借高成下等者等取借別初住成圓教初住高借下成高不得專執瓔珞別位定在初地明位委悉不過瓔珞所以借之。",
    "X29n0594_003:0036a01_0": "【疏】名通義圓等者文云我等今日真阿羅漢又云我等今日真是聲聞等此名與藏通同而義有異何者彼但殺四住賊無明尚在此殺通別兩惑得如來滅度故殺賊義圓又彼是分段不生界外猶生寶性論二乘於無漏界生三種意陰今則分段變易二俱不生不生義圓彼是界內應供非界外應供淨名云其供汝者不名福田則應供義偏今則普於其中應受供養則供養義圓故羅漢三義圓也言真聲聞者彼但小乘從他聞四諦聲偏聞偏今能令一切法界聞一實四諦佛道之聲使一切聞聲聞義圓故知依義不依語也(云云)。",
    "X29n0594_003:0036a12_0": "【疏】別義賢聖至玄義者玄第九云三十心雖同有賢聖之義但稱為賢伏多斷少故十地去為聖伏少斷多故又圓十住名賢聖者於別名賢於圓名聖望別十地遠故圓人三十心是聖賢者圓者聖於別是賢望別十地近故十地等覺是聖妙覺是聖聖別教十住自是賢望別行向名為賢賢如記(云云)有云別十住是賢於圓名聖故云賢聖別地望圓地名聖聖別信望圓信名賢賢今謂行向自約別教不望圓也(云云)。",
    "X29n0594_003:0036a21_0": "【疏】大眾心喜至勝應者是因緣義內外異是世界問答除疑是對治非常之喜是生善一心觀佛是第一義。",
    "X29n0594_003:0036a24_0": "【經】照東方萬八千等【疏】云今明東是方始者既約本迹二門是一乘因果十住如東方餘三十位如餘三方也言萬者表位圓也一住一切住故以萬表之八千者表位數也雖一位具一切位但一切即一是十住之位分因分果故八千表之餘三方圓缺准之。",
    "X29n0594_003:0036b05_0": "【經】靡不周遍者吉藏云乘有十義十相表之一有最上義以頭表之二有中道義以眉間表之三有顯明義以目表之四有無翳義以毫表之五有破暗義以光表之六有不二義以一方表之七有根本義以東方表之八有果乘具足義以萬表之九有因乘未具足義以八千表之十說因果理盡義以周遍表之今謂此義雖廣於理未盡第一第二但表常德第三第四第五但表淨德望今疏闕我樂二德也第六第七但表方始是住義第八第九已是因果義與第十同若爾東方已表因果盡照餘方復何所表如疏破不可也(云云)。",
    "X29n0594_003:0036b16_0": "【疏】若分文屬此土等者疏有二意初對古人從爾時至相光是此土第六瑞次照東方下屬他土總次若分下第二判從爾時佛下至萬八千盡是此土第六相若分屬他土從爾時佛放下盡是他土總相故此重分若不爾者何因此文耶言總相者他土六事皆因放光光是能照六是所照所從於能故總名瑞光瑞是一故名為總又通彼此亦為總記中分文此土至周遍他土從下至地獄去是他土今恐違分文疏引古人至尼吒屬此土。",
    "X29n0594_003:0036c01_0": "【疏】不別破但言斟酌由人者意未可若盡取他土六瑞屬此土第六者何不取餘五耶若盡屬他土者何不從照東方已去事盡屬他土耶故不可言由人也(思之)今疏云各長短者用左溪分文取東方至尼吒屬兩事屬上此土第六屬下他土第一此用古人至尼吒是此土第六相也故記云通長短(云云)。",
    "X29n0594_003:0036c07_0": "【疏】次光照他下為二初釋六瑞次又此彼下明諸佛道同初六瑞四初標次一下列三既有下生起四若此下明所表自覺覺他次道同中又二初略次廣(與記不同云云)。",
    "X29n0594_003:0036c11_0": "【疏】一見六趣者記指他章離合以為四五道七識住者俱舍別正理從別釋一一趣名言那落名人迦者為惡人多造惡顛倒墮其中由是那落迦又云或趣近人故名那落造重罪人速往彼故或復迦者是樂異名那者無義落是與義無樂相與名那落迦又是救濟義那名不可不可救濟名那落迦言傍生者彼趣多分身橫住故或彼趣中容有少分非傍行者故解曰分橫柱如驢牛等容有竪住如獼猴等為對彼故故云多分也又容少分傍行者兩足者竪行如飛鳥四足者傍行如牛馬等(云云)言餓鬼者又多希求以自存濟言人者謂或多思慮(云云)言天謂尊高神用自在眾所祈告故名天言阿素那者鬼趣所攝(云云)。",
    "X29n0594_003:0036c24_0": "言七識住者論云欲界人天色三靜慮無色三天此云七生處是識住體故曰身異及想異身異同一想翻此身想一並無色下三餘非有損壞論曰身異想異者經說有色有情如人一分天是第一識住(解曰一分天者欲界天及初靜慮除劫初起云云)二有色有情身異想一者如梵眾天謂劫初起是第二識住(云云)三有情身一想異者如極光淨天是第三識住(云云)四有情身一想一者如遍淨天是第四識住下三無色名則如經即三識住是為七(云云)論九有情居頌曰。",
    "X29n0594_003:0037a09_0": "　應知兼有頂　　及無想有情　　是九有情居　餘非不樂住論曰前七識住及兼有頂無想有情為九即七識住上加非想及無想天所以九立有情居以樂住故四識住當知四蘊唯自地經云識隨色住識隨受住識隨想住識隨行住(云云)頌曰。",
    "X29n0594_003:0037a15_0": "　於中有四生　　有情謂卵等　　人傍生具四　地獄及諸天　　中有唯化生　　鬼通胎化二論曰謂有情類卵生胎生濕生化生是名為四正理論云鬼通非情(此即四界寬四生狹也)趣唯有情然不云遍攝(不攝中有狹於生也)生唯遍攝故復有無非有情名眾生故准此有情名有眾生無情不名眾生舊譯有情名眾生者兩名一准大乘具六界故名眾生二具四生生謂生類諸有情中雖餘類雜而生類等言生類等者是眾生義多生類故如下五濁中及論廣說(云云)。",
    "X29n0594_003:0037a24_0": "【記】云先總明道同至當同乃隱者此現六瑞是今同名隱也後人悞改現字作當字耳記釋云若所見下作隱當同釋即現當二同俱隱(思之)下已當二同誤改當作現字今並須除當現二字。",
    "X29n0594_003:0037b04_0": "【疏】昔善為因今教為緣者指王子所聞法華下種為因中間異方便成熟助之為疎緣今聞法華教為親緣即得開示悟等為所生法名脫也。",
    "X29n0594_003:0037b07_0": "【疏】神變者止觀第一記引大神變經佛現十八變竟時商主天子白佛言頗有神變更過此耶佛令文殊廣說變化文殊白佛如是神變摧伏惡魔亦令菩薩久住於世如是未為殊勝若無名無相無聲無字歷十八界皆作此說無三脫說三脫乃至身子問天子曰汝聞此神變不怖耶天子曰我即神變云何怖耶文殊言一切善惡動不動皆神變相不動即法性動即事神變故二緣三緣等無非神變。",
    "X29n0594_003:0037b15_0": "【疏】補處不知尊極者別教補處不知當教妙覺。",
    "X29n0594_003:0037b16_0": "【疏】就極處亦不知者別教妙覺不知圓妙覺名亦不知也所言亦者同補處不知尊極故名亦也若准權不知實權尚不能知圓初心何況妙覺以別妙覺望圓妙覺故云此就也。",
    "X29n0594_003:0037b20_0": "【經】云是佛光明神通之相者光明是別舉一妙覺瑞神通是總舉六瑞也。",
    "X29n0594_003:0037b22_0": "【經】國界莊嚴者此但猶光照故名莊嚴非淨土也偈者舊云偈梵文略也應知偈陀梵訛也思之今從正音宜云伽陀唐言頌頌者三十二言注云彼之讚偈猶此之詠歌歌者頌威德之形容讚偈者讚至理之體相梵語伽陀翻為頌頌美也歌也頌中文句極美麗故歌頌之故此祇頌進詮體義劣於名句退為所依不及聲文於百法不別建立然以聲上屈曲為體即名句文更無別性又云偈有二種一室路迦二法句初有五相一處中句二初句三後句四短句五長句一處中者若八字生名處中句不長不短故三十二字生於四句如是四句成室路迦經論文章多依此數(解曰若八字生至短者言諸行至滅法此是八字不越八字至十二字名為不長句不越此八至前四字名為不短云云)二初句者若六字已上名初句(解曰六字已上直至第七來名初句如處世界如蓮華六字句因淨修廣如青蓮七字句到八字屬中句非初句也)三後句者二十六字以下生名後句(解曰頌二十五字句有二十四字句乃至有九字句皆是後句若到八是處中句非後句也)四短句者若滅六字生名短句(解曰如言能作及俱有有字已前若依前解直至能字皆是短句依第二解意無一字句至二字來皆短句也言一字句者有文有名有句三法同起言淨言諦三字句也)如詩云風(一字句)吹我紅華入紫宇(七字句)五長句者從二十七字已上不限多少也問今四字為句應是短句何名處中答梵語八字翻此為四也如菩提達磨各兩字此翻為覺法二字之例言三十二字者梵語一句八字四句成三十二也莫問長行與偈但三十二字便是室路伽也法句偈要以四句備足然後為偈莫問四言乃至七言必須四句故涅槃云四句為偈是也又伽陀謂孤起二路伽謂頌長行。",
    "X29n0594_003:0037c24_0": "【疏】說法入定能導於人者如云定慧力莊嚴以此度眾生也眾生是能趣之人等者經云生死所趣生死是總通惑業苦三道故所趣是別即六趣果故作此釋者生死是因謂三道所趣是果謂六趣又云所趣果體即生死道能趣是果煩惱假者有情故注釋云善惡業緣即能趣因受報好醜即所趣果善惡業緣者由善為異熟因即五戒十善等會等煩惱為因緣受三惡醜總報果故也。",
    "X29n0594_003:0038a08_0": "【疏】從又覩至經典等者八千界名諸佛聖主師子四句分別一是聖非主如三乘人二是主非聖如諸國主三是主是聖四非聖非主如凡夫今是第三句也能詮一乘之教名經典所詮之理名微妙頓說純大名第一八音詮辯而無雜聞名其聲清淨巧順機宜名柔輭都無二乘名教菩薩能詮無謬名梵音梵即清也唯說法界名深法界容融名為妙赴機不差故云令人樂聞萬八千主伴齊說名各於世界說離邪曲故云正法理顯無隱名為照明從之為名故云佛法理實有別菩薩也逗彼二機名開悟眾生文闕示入彼廣有住行向地故也又云佛悟不濁曰清佛悟不間為淨佛悟至利為柔離剛為軟。",
    "X29n0594_003:0038a20_0": "【經】恒沙者問經何故多以恒沙為喻答有五義釋之一由沙多二為世人共為福水入洗永滅罪投死生天三雖經劫壞名字常存四佛多近此宣說妙法五眾人共委故多以喻初出池四方四十里長八十里闊四十中二十快十里長一肘鑿無至砂處有八萬殊故細如麵以為喻也。",
    "X29n0594_003:0038b02_0": "【經】或有行施等者先有見他土並行六度行總釋名唯識問云何名波羅蜜答梵語此云到彼岸謂到菩提理涅槃岸也所到義同故總名波羅蜜次別釋名釋第一施者三謂財無畏法財資他身無畏益心法利善根資益於他故名為施三俱利他也若望自報後感大財即此施度具合六種財唯攝施無畏攝戒忍法攝後三對法論云施度是財餘四無畏法總攝六般若論云檀度攝六即此義也施謂無貪所起三業以為性也(解曰約行出体即無貪及相應思所及三業利他為体也)。",
    "X29n0594_003:0038b11_0": "【經】云金銀等者七寶一金說文云有五色黃為其長久埋不變百練不輕述曰金字者此是像形字謂土能生金此字少今左右置兩土明金在中是像形也又以與今同聲即形聲中攝也言五色者即青黃赤白黑赤是赤銅白銀青是鉛錫黃是金黑即鐵也二銀是白金三珊瑚紅色石脂似樹形四真珠即赤珠佛地論云赤虫所出或珠體赤名赤真珠五摩尼者如意神珠既闕瑠璃便開珠二六硨磲梵云牟婆洛揭拉婆青白間色七碼碯梵云謨薩羅揭婆謨薩羅此云杵揭婆此云藏述曰此形似杵藏在石即石胎是或言堅實故也色如碼碯從彼作碼碯字是寶類字從玉石類字從石。",
    "X29n0594_003:0038b23_0": "【經】金剛諸珍者一金剛二諸珍帝青大青之類述曰帝釋有寶名曰帝青大梵王有寶名曰大青此寶第一非餘所見在梵王帝釋頂上也三奴古者罪人沒官入賤為奴四婢女之卑稱五車今輿輻之總名夏后氏時奚仲所造又音居曰古者車如居言行所以居人也今曰車車舍是也言行者所居如舍六乘者(食證反)廣雅云乘駕也謂可乘者也周禮云駕為乘乘載也七寶餝輦者(力辰反)說文輓車也在車前引之古卿大夫所乘自漢已後天子乘之故今天子皇后所乘車曰輦以寶飾輿(余據與居二反)說文車輿也又云有輪曰車無輪曰輿輿眾也載也舉也。",
    "X29n0594_003:0038c10_0": "【經】云駟者(相二反)說文駟一乘也謂四馬駟也言欄者鈎欄也亦遮也又檻也縱曰檻橫曰楯(音食尸時召二反伺也)言華蓋者(故爪反)作此俗釋黃帝與蚩尤戰於涿鹿之野有五色雲氣金枝玉葉止於帝上有華葩(披巴切)之形因而作華美之蓋也(音呼苽切)西域暑熱人多持蓋以華飾之名華蓋言軒者(虗言切)說文云車也又云簷宇之末曰軒安車也曲輈轓(上室求切下甫煩切)述曰車轅曰輈車箱曰轓即轅車也或作幰(虗偃反)布帳車上禦熱名幰施有五相頌曰。",
    "X29n0594_003:0038c19_0": "　志心及信心　　隨時自手施　　如法行捨物　是名施五種不受亦有五相頌云。",
    "X29n0594_003:0038c22_0": "　不淨亂眾生　　惱害眾生物　　及壞淨心者　皆不應施與【疏】約比丘論持戒者第二戒有三謂攝律儀攝善法饒益有情對法云律儀是任持身心不造諸惡故攝善法戒是菩提因任持是彼因故饒益戒是大悲任持故釋名防護安住離過失名之為戒法戒軌度復名律儀謂法律儀謂儀戒故云法戒軌度名律儀也體者對法亦以三乘為體瑜伽四十二云律儀七眾別解脫在家出家為體此唯身語二業言善法體有謂諸菩薩受律儀後一切為大菩提即三業積集善法為體言饒益體者亦以三業為體今經云往詣佛所問無上道是善法戒便捨樂土等是饒益有情戒剃除等是律儀戒次分別圓教也(云云)。",
    "X29n0594_003:0039a11_0": "【經】云被者(敷罷反方言披散也)今亦[打丁+串]著之義正言而被法服者(皮義反)服用被帶之義。",
    "X29n0594_003:0039a13_0": "【疏】如五王經者昔有五王相問各陳所好一園林華菓一好婦人善色一好車馬兵甲一好田獵遊戲有一大王次第為說過患華菓即有彫零枯折婦女即有恩愛別離車馬有鬪戰相殺田獵乖傷慈悲不如厭老死求常涅槃四王聞之皆詣佛所出家修道。",
    "X29n0594_003:0039a18_0": "【疏】問忍者疏中三忍謂生苦行第一唯識云亦有三忍一耐怨害二安受苦三諦察法若不耐怨便捨於彼不名為忍以能忍故不捨有情解曰是耐怨忍於逼迫境能安受故解曰是安受忍審諦察法即無生忍解曰是諦察法以觀於法違順無二以無瞋精進審慧三及身口意業為體耐怨害是今文生忍安受苦是今文苦行忍諦察法是今文第一忍也無瞋釋耐怨精進釋安受審慧釋諦察。",
    "X29n0594_003:0039b02_0": "【疏】問精進者唯識云精進有三謂被甲攝善利樂被甲即勢力惡境不能屈伏攝善謂自利不退利樂即饒益無倦若經中五句云有勢有勤有勇堅猛不捨善軌此論被甲攝初有勢句第二攝善餘四句盡以名體寬故第三句是利他前二是自利此論精進具二利約二利為六度故若攝大乘有五種一被甲二加行三無怯四不退轉五無喜是與經相攝並自利無利他言體者俱以勤及所起三業為性今經望唯識但有被甲攝善二精進故云勇猛乃至思惟佛道但自利闕化他無利樂也望攝大乘五精進並攝在自利也。",
    "X29n0594_003:0039b13_0": "【疏】離欲者第五問禪定唯有三種者謂安住引發辦事安住現法樂引發於六通饒益於有情能辦他事變海水為蘇酪以濟飢乏用等持為體對法初云無厭倦任持即安住義二諸所思事成滿任持謂先未得通常思所得令能引發故云成滿三辦事者御眾業任持由定觀機隨諸行門攝御令成益故言靜慮者慮是心慮靜此勞慮名之為定名功德聚林言安住者是禪體引發辦事是禪用言等持為體者即三摩地此約在定唯是定數別境一名為體今經云又見離欲常處空閑是安住義深修禪定得五神通是引發義經云安禪讚佛是饒益義疏云有感則形是饒益也。",
    "X29n0594_003:0039c01_0": "【疏】復見佛子智深等者第六智有三謂一生空二法空三無分別智及俱生生空無分別智此唯根本智為第六體者是決擇煩惱以釋為性瓔珞經云照有照空及照中道根本後得二智今經前自行智是根本智後化他智是後得也。",
    "X29n0594_003:0039c06_0": "【疏】八魔者藏教四魔是煩惱若佛坐道場破煩惱魔得菩提道證法性身破陰死二魔於道樹下得不動三昧破天子魔通教八人見地破煩惱魔六地破陰死魔八地得不動三昧破天子魔別教先破界內同前界外四魔從無常無我無樂無淨四也。",
    "X29n0594_003:0039c11_0": "【疏】華嚴思益者華嚴第十五云又有光明名能捨此光覺悟煩惱眾生令知財寶悉非常恒樂惠施心無著又放光明名除熱此光能覺毀禁者普使受持清淨戒發心願證無師道又放光明名忍嚴此光覺悟瞋恚者令彼除瞋離我慢常樂忍辱柔和法又放光明名勇猛此光覺悟懶惰者令彼常於三寶中恭敬供養無疲厭又放光明名寂靜此光能覺亂意者令其遠離貪恚癡心不動搖而止定又放光明名慧嚴此光覺悟愚迷者令其證諦能解緣起諸根智慧悉通達總有四十二光法問如經(云云)。",
    "X29n0594_003:0039c21_0": "【疏】圓擊梵輪法皷者圓音一演名圓擊清淨之輪與他人名為梵輪輪轉也即理之教名為法皷說法之聲如皷出聲即初住化他名擊法皷。",
    "X29n0594_003:0039c24_0": "【疏】未甞睡眠者成論云身心昏重因睡攝心離覺名眠大乘以一切住著昏暗皆名睡眠菩薩心無染著名未甞睡眠不動而遊故曰經行也。",
    "X29n0594_003:0040a03_0": "【疏】淨如寶珠者三義名淨第十戒是究竟中道戒一珠內外無瑕喻中道戒無見思塵沙二惑名無外瑕無無明惑名無內瑕即是中道清淨也若約三業身口名外意業名內二珠圓無缺喻中道戒於二邊微塵不犯也三珠可寶重喻中道戒於二邊為尊崇也。",
    "X29n0594_003:0040a08_0": "【疏】十戒玄義者謂不缺不穿不雜道共無著智所讚自在隨定具足如菩薩疏(云云)。",
    "X29n0594_003:0040a10_0": "【疏】住忍一問忍者得少謂多名增上慢自特聰明富貴道德名譽而打罵惡罵是口業捶打是身業必有瞋恚之心兼其意業忍三業之惡眾離戲笑謂分別戲論笑謂談謔皆掉悔蓋言一心除亂却貪蓋者貪謂於有具染著為性能障無貪生苦為業謂由愛力取蘊生故述曰有謂後有即異熟果通三有故具有者即煩惱業及器世間並中道有異熟因故名有具足有受用亦得具名於此二境常起於貪名為染著故名為亂一心在定而不起貪是却貪蓋也俱舍云五蓋唯在欲障根本禪今別圓菩薩棄真諦邊五蓋俗諦邊五蓋中道從初地至等覺節節亦五蓋圓教圓棄五蓋準思之。",
    "X29n0594_003:0040a22_0": "【經】栴檀者赤謂牛頭栴檀黑是紫檀之類白是白檀也。",
    "X29n0594_003:0040a24_0": "【疏】冷然下云云者意令分別六度光中所見六之十離合不同唯識第七方便善巧有二謂迴向拔濟攝論云謂前六度所集善根共諸有情迴求無上菩提即方便善巧迴向拔濟義也無性云不捨生死求涅槃由大悲故不捨生死由大智故求涅槃第八願者有二謂求菩提樂利他願即是自利利他第九力者有二謂思攝修習即思擇諸法而修習故第十智者有二謂受用法樂熟成有情由前六度成立妙智受用法樂後由第十成足前六能正了知此施等上饒益有情後五皆擇法為體根本後得智故第六根本後四後得問何故說十不增不減耶答謂十地中除障故問有處唯六何耶答除六相違障故說六也謂對治惱貪破惑瞋恚懈怠散亂愚癡故說六也又施感大財戒獲大體忍招一眷屬精進得不退定報心端慧感明智故言六矣如經下文釋及唯識論(云云)。",
    "X29n0594_003:0040b15_0": "【經】珠交露幔者露謂不覆幔謂覆。",
    "X29n0594_003:0040b16_0": "【經】如天樹王者如涅槃二十七遍喻始自黃葉終至開敷遍喻佛弟子初始出家乃至得果。",
    "X29n0594_003:0040b18_0": "【經】云三十三天有波利質多樹其根入地深五百由旬枝葉四布五十由旬葉熟則黃諸天見已復生歡喜是葉不久必當墮落其葉既落復生歡喜是枝不久必當變色復生歡喜是色不久必當生皰見已復喜是皰不久必當生[口*(隹/乃)]見已復喜是[口*(隹/乃)]不久必當開敷開敷時香氣周遍五十由旬光明遠照八十由旬諸天爾時夏三月中在下受樂我諸弟子亦復如此其葉黃者喻念欲捨家葉落喻剃髮色變喻白四羯磨生皰喻發菩提心[口*(隹/乃)]喻十住菩薩見性開敷喻得菩提香氣喻十方無量眾生受禁戒光明喻如來名號周遍夏三月者喻三三昧諸天受樂喻諸佛在大涅槃常樂我淨。",
    "X29n0594_003:0040c06_0": "【疏】伏難者左溪云文殊內心潛搆名伏彰言拒之名難彌勒釋難著在經文故云彰言初偈釋大眾不疑難次偈釋待佛定起決疑難三偈釋微共籌量難四偈釋既解伏答難。",
    "X29n0594_003:0040c10_0": "【疏】是時文殊師利是結集語從彌勒下至演大法義是惟忖答惟忖中文二初語彌勒下至大士是標章次善男子下是正惟忖即知非經家語也有云爾時文殊者經家標能問人語彌勒者對質疑之人也及諸大士彌勒已下八萬之流也善男子者聲聞四眾天龍八部眾也。",
    "X29n0594_003:0040c16_0": "【疏】光宅以初後兩句法說乃至今明法說不用者准光宅不用中間三句譬說亦不用為三譬亦對因果二門故彼解云雨法潤二乘枯槁則生長一乘之解通因果二門吹螺以改號譬改三乘之號擊皷戒兵使其齊一譬明一實之理解曰吹螺改三乘之號是因明即開方便門擊皷明一實之理則顯真實又亦因門吹螺是改近之號擊皷是顯遠之理並是果門今但取譬不取所對法也故云其法說不用問說大法與演大法義何別答吉云前是能詮教計後是所詮理法不用此解。",
    "X29n0594_003:0041a02_0": "【疏】欲說大法至演大法義者論云大義因成就八句示現何等為八記引四對一破惡進善對二開權顯實對三得智證真對四說法利生對言破惡者欲說大法句破聲聞等新舊二疑云今會中疑王子時發心欲疑即斷今若說此大法之事故言欲說大法言進善者雨大法雨句論云已斷疑者增長純熟智慧身故言開權者擊大法皷句問與法雨何別答法雨句二乘發大心智當作佛悔修少行今此句執唯一乘無別二乘故有異也言顯實者不斷大法皷句論云謂菩薩密境界聲聞密境界密是微密二乘不知權實故今開一實與聲聞記故言為說二密境界言得智者建大法幢句論云上上清淨義故謂即菩提智也體無漏故名清淨出過因因德及二乘故名上上高顯如幢也言證真者燃大法炬句有二義一破闇喻除煩惱二顯照真理故言說法者吹大法螺句佛說身子成佛尚說三乘言利生者演大法義句演謂流演聖道至所化機也不次者不斷大法句居於第七今當第四者擊大法皷為聲聞不斷大法皷為菩薩聲聞迴心即成菩薩故對開權即顯實也問既無顯實句此經應不會既無得智證真此經應無智無真耶(云云)。",
    "X29n0594_003:0041a23_0": "【疏】云此廣答此土他土之問惟忖中有演大法義即表放光亦通他土略曾見中有放光瑞亦通此土廣曾中於今同中具有二土六瑞記中何得惟忖答此略曾答彼廣曾三同唯表此耶答惟忖中第五句雖通他土從今佛之言且答於此略曾中放光雖通於此既言放斯光已即說大法今佛未說故知答他土問也廣曾見中具明彼此六瑞即則知雙答二土問也記云三同表此者恐誤也標章云廣曾見雙答此彼土。",
    "X29n0594_003:0041b08_0": "【疏】云此分明定答他土問者即三同雙表於此思之。",
    "X29n0594_003:0041b09_0": "【疏】欲令眾生咸得聞知者記云收無量歸一是指欲說大法句指下開示悟入是雨大法雨句今觀文意欲令眾生是欲說大法句收無量歸一是雨法雨句即知惟忖五句初句總次四句別同下開示等但是合前總別耳故云一切世間難信之法也(思之)。",
    "X29n0594_003:0041b14_0": "【經】如過去無量無邊阿僧祇劫者法華論云不可思議不可稱不可量者示現過彼阿僧祇劫不可得故梵云阿僧企耶此云無數不可思議者過情計之境不可稱者過言議境不可量非算數境今經云無量者過算分喻分無過者過時分不可思議者過情計分即同般若過四分也言阿僧祇劫者有十類劫者一日月等劫二增減劫三二十劫四四十劫五六十劫六八十劫謂火灾劫七水灾劫八風灾劫九阿僧祇劫十賢劫也。",
    "X29n0594_003:0041b23_0": "【經】日月燈明者注解曰聖人無名借義以立稱仁者見之謂之仁智者見之謂之智將顯上根照之為日中根照之為月下根照之為燈問三根所顯不同皆顯日等是何智耶又日陽而動譬方便慧月陰而靜喻實慧二慧益物如世燈明二慧益物何名燈耶答自行權實其力增盛如日月也化他隨機用三教法其力則微如燈也。",
    "X29n0594_003:0041c06_0": "【經】如來應供十號者准瑜伽八十三解十號一如來二應供三正等覺四明行圓滿五善逝六世間解七無上丈夫調御士八天人師九佛十薄伽梵瓔珞乃至第十佛世尊合為一號智論第十佛號世尊是十號外總號也由具十號故名世尊開合雖殊大意不失也。",
    "X29n0594_003:0041c12_0": "【記】云故知應號即法號者止觀法界即見應身十號與法界等名為法身十號也乘無二智來契正境故名如來以無二理遍入諸法名應供了不二智智體無偏名正遍知不二之智無非法界名明行足不二之智常冥三德名善逝三種世間皆與理同名世間解三惑即三菩提名無上士達九界皆佛界名調御丈夫契法界理為三教人天之師名人天師覺法界理名佛法界為三世間所宗名世尊以法報為真身起真為應身號皆遍法界應號即法號。",
    "X29n0594_003:0041c21_0": "【疏】大乘七善者初時節善如文二義善者文為四初牒經其義深遠是二對教即頓教了義之理是三解釋二乘不測其邊是四結名是義善是言不測邊者釋遠也不測底者釋深也法界非橫而橫故名遠非竪而竪故言深二乘在座如聾等名不測也言深者竪不得其底能絕四句深橫不得其邊超百非稱遠又心行滅為深言語斷為遠注云除饋不究曰深綿不可及曰遠三其語巧妙者一是牒經二即對教三會理下釋會理直說釋巧字悅菩薩心釋妙字四即頓下結又四句自有言雖巧妙而義淺近自義深遠言則麤拙自有俱無自佛法俱有四純一無雜者文為三一牒經二不與下釋三即是下結言不雜者能明一道不雜五乘成論稱獨佛有故今約部無二乘名不雜也理和曰純不一為一五具足者亦四准知言界內外者別圓二教頓理具界內外諸法名為滿字教圓理滿故云圓滿善也六清白者亦四准前二邊者約偏計性五住為二邊穢約依他性真俗二諦為二邊瑕從證道說別教三諦亦融故故云調柔善七梵行之相者文有三一牒經二對教三釋云無緣慈者從理故慈理無垢染名之為梵普益一切名之為行以冥顯二利眾生為相也又解梵名涅槃行即萬行行到涅槃梵之行故顯彰為相又教是梵行之緣緣中說果故云梵行之相也。",
    "X29n0594_003:0042a20_0": "【經】令得一切等者記三釋第三云傍正具舉等者前文明鹿苑具舉三乘二乘為正菩薩是傍佛初成道即却指因時行行故菩薩是傍。",
    "X29n0594_003:0042a23_0": "【記】云忽至三萬豈無表者即表一念十界百如百界千如千界萬如此是眾生世間處一千五陰一千國土各有萬如即成三萬皆佛界為實勝九界為權權中有實即九界中有佛界實中有權即佛界中有九界重重無盡且佛三萬為表權實具足若言一萬八千為表者萬數圓表果滿八千數缺表因而未滿如一位一切位開即示悟入以萬數表之一切位即一位俱名十住以千表之開九界權即佛界實名開若佛界有九界名示佛界與九界不二名悟不二而二名入亦不出權實法也若菩薩八萬為表者八正道中一一皆具十界權實十有百百有千界界有十如即萬如八正即八萬亦權實具足若亦二萬為表表權實滿者千界萬如千如萬界亦佛佛為實滿九界為權。",
    "X29n0594_003:0042b13_0": "【經】又同一姓至墮者此土無音以當之所以引古以證今列均名而同姓者明其佛弘多其道彌一也即是諸佛道同義也。",
    "X29n0594_003:0042b16_0": "【經】各領四天下者有云四種一相繼二應紹三輪王命長等釋伏難云既言劫減佛出劫增輪王出何得彌勒耨佉同所也答耨佉人壽八萬時生以壽長故至劫減人壽六萬時彌勒出世猶得相見四約彼是報佛引八王子入八地若爾何名同引耶(云云)。",
    "X29n0594_003:0042b21_0": "【疏】又若述昔答者記云隱昔顯今者隱昔時菩薩問亦隱昔時菩薩答顯今文殊自述己見非傳他答也。",
    "X29n0594_003:0042b23_0": "【疏】或言因文殊至不便者此是瑤師破古人云不便非大師言不便也從今不是破耳。",
    "X29n0594_003:0042c01_0": "【疏】又取藥王為例者觀此文猶是瑤師引注家為例注經云如來從三昧起因妙光今者昔因妙光今因藥王藥王不列同從妙光序八百弟子者須以顯彌勒經求名之緣以標文殊凡決疑之寄耳即是瑤師許注家名亦故云可爾但有門徒有無名小不類大師難云公抗佛語破注及瑤師。",
    "X29n0594_003:0042c07_0": "【疏】若述昔答至費詞者答問一序總是費詞無勞惟忖等答也。",
    "X29n0594_003:0042c09_0": "【疏】是時下說法同中記云非正宗意者前無量義但屬其序表正宗而已今教菩薩法佛所護念即具四一也名無量義是妙法異名表妙是教一菩薩是人所證理一念所是三乘方便之行即表行一。",
    "X29n0594_003:0042c13_0": "【經】六十至食頃者有解眾生識上變化長短五對分別一勤惰對如世間勤時即短懶惰即長無性攝論云愚修雖少時怠疑已久智雖無量勤勇謂須臾二苦樂對如重病苦時即厭時長歡喜恣逸即厭時短三欣厭對如聽法人樂法心重即覺時短不樂聽者即覺時長四迷悟對如夢中長時事業睡覺之後只是一時五神力非力對由佛轉易其心於多時謂如食頃若如此五釋者四皆是情謂之長短後一是佛神力所為。",
    "X29n0594_003:0042c22_0": "【記】生公豈實然者豈實經六十劫況匠真一之門者言妙理也匠是如來真一是一乘門是教。",
    "X29n0594_003:0042c24_0": "【記】有人四句者圓鏡疏用中論句長不自長亦不從他長不共不無因是故說無長短亦不自短亦不從他短不共不無因是故說無短非長即六十小劫是食頃非短即食頃是六十劫此非聽修觀。",
    "X29n0594_003:0043a04_0": "【經】入無餘者真應合說息應歸真名入。",
    "X29n0594_003:0043a05_0": "【經】時有德至佛陀者多陀如來阿羅訶應供義三正義藐等義又三正義佛陀覺義即是如來應供正覺初三號為對三德謂斷德恩德智德故不說號有云淨身者累無不盡為淨德無不圓稱身西方如來是人應供是斷正遍知是智人具智斷故說三號。",
    "X29n0594_003:0043a10_0": "【疏】執者未驚者記引方等斥奪者方等陀羅尼經云汝等聲聞何不發心作佛汝等即是斥言。",
    "X29n0594_003:0043a12_0": "【記】處處說故不重論者聲聞文殊引昔授菩薩記今佛定起亦是菩薩記已前處處皆見不驚。",
    "X29n0594_003:0043a14_0": "【疏】生非生者記又迹難測下約釋迦本理不約文殊文殊昔滅而非滅今弟子故釋迦今生非實生生有本也。",
    "X29n0594_003:0043a17_0": "【記】實位補處輔應化者謂圓人實位示作權三教補處輔佛故云從權前云此依權道者此是前三教當教實人修至補處以圓形之名為權也此權即前三教之實非圓示權之權今是圓人示作三教之權眾次當說下釋決定答問記中前今見表此與本無異表彼者此土有六瑞何無放光彼土有六瑞何故全無答放光是應既云如來即是應攝他土六者准發問中他土六瑞以佛為本既云佛所護念佛為六瑞所依故亦攝五也。",
    "X29n0594_003:0043b02_0": "【經】供養人中尊者第一偈及此句云人中尊後頌出定云天人所奉尊何耶答當以入定時所奉音未彰出定之後奉音將教故輕重不同奉音未彰者未說法華故輕也出定奉音是說法華故重也。",
    "X29n0594_003:0043b06_0": "【經】瑠璃頗梨色者問燈明所照頗梨色釋迦放光地作黃金色不同何耶答當由感者微有輕重感輕頗梨色重者黃金色或表中道光自在故最後天中天者有多種輪王是人中天三界諸天是天中天初果已上為淨天初地已上第一義天佛為究竟義天最後天中天也。",
    "X29n0594_003:0043b13_0": "天台法華義纘卷第三(本)"
}