{
    "X32n0616_005:0142a18_0": "妙法蓮華經台宗會義卷五之一",
    "X32n0616_005:0142a20_0": "古吳後學蕅益　智旭　述",
    "X32n0616_005:0142a21_0": "安樂行品第十四",
    "X32n0616_005:0142a22_0": "釋此為三一依事釋二附文釋三法門釋各有略廣略明依事釋者身無危險故安心無憂惱故樂身安心樂故能進于弘經口業之行也略明附文釋者先附上品文著如來衣則法身安入如來室故解脫心樂坐如來座故般若導行進又附此品文住忍辱地故身安而不卒暴故心樂觀諸法實相故行進也略明法門釋者安名不動樂名無受行名無行不動者六道生死二乘涅槃所不能動既不緣二邊則法身無動搖安住不動如須彌山名為常住不動法門上文云身體及手足寂然安不動其心常憺怕未曾有散亂即此義也無受者不受凡夫之五受乃至圓教中五受生見亦皆不受(先約外道四句及以絕言名為五受次約藏通別各各四門及一絕言亦各五受後約圓教四門及一絕言若未證實而生著見亦名五受體教入理理無所受方名不受)有受則有苦無受則無苦無苦無樂乃名大樂無行者若有所受即有所行無受則無所行不行凡夫行不行賢聖行故言無行而行中道是故名行也次更廣事釋夫安樂者即大涅槃從果立名也行者即涅槃道從因得名也若常見外道行于苦行則因果俱苦若斷見外道恣情取樂則因樂果苦若析法二乘無常拙度加功苦至方入涅槃則因苦果樂今是如實巧度故因果俱樂大經云定苦行者謂諸凡夫苦樂行者聲聞緣覺定樂行者謂諸菩薩今于菩薩中應更分別三藏菩薩有教無人通教三乘因果俱偏別教菩薩因偏果圓圓教菩薩因果俱圓今以俱樂俱圓之妙果妙因稱為安樂行也次更廣附文釋安樂行是涅槃道涅槃有三義謂三德秘藏行有三義謂止行觀行慈悲行止行者三時柔和違從俱寂即是體法身行上文所謂如來衣也觀行者一實相慧無分別光即是體般若行上文所謂如來座也慈悲行者四弘誓願廣度一切即是體解脫行上文所謂如來室也總此三行為涅槃道總於三德為行之境境稱安樂道稱為行大論云菩薩從初發心常觀涅槃行道因時用此三法導三業為行三業淨故即是淨於六根六根若淨發相似解而得入真果時名為佛眼耳等因名止行果名斷德因名觀行果名智德因名慈悲行果名恩德又因名三業果名三密因時慈悲導三業利他果時名三輪不思議化如此觀時無復分別一切諸法中悉有安樂性一切眾生即大涅槃不可復滅行於非道通達佛道故名為安樂行也此行與涅槃義合彼經云復有一行是如來行如來是人安樂是法如來是安樂人安樂是如來法總而言之其義不異別亦不異彼經明金銀寶樹譬無漏寶林與此經寂滅忍衣合彼經明金沙大河直入西海譬一實慧與此經法空座合彼經明得道女人則無諂曲譬無緣大慈與此經慈悲室合彼經呼為無餘義此經呼為無上道又彼經所明聖行即如來座天行即如來衣梵行嬰兒行病行即如來室也問大經明親附國王持弓帶箭摧伏惡人此經遠離豪勢謙下慈善剛柔碩乖云何不異答大經偏論折伏而住一子地何曾無攝受此經偏明攝受而頭破七分何甞無折伏各舉一端理必具四適時稱宜即世界意攝受即為人意折伏即對治意悟道即第一義意也次更廣法門釋所謂不動門不受門不行門具如玄文十種三法準例可知若以此義為四悉者三法異即世界解脫即為人般若即對治法身第一義也問此安樂行有何次第答法華圓行一行無量行不可思議何定前後今一往隨文說者法師品略示弘經則以益他為本故先明入室此品辨惡世弘經安諸逼惱故先明著衣前後互現耳若約行說者諸法從本來常自寂滅相乖寂起相則應先以般若蕩累是坐如來座諸法不生而般若生同體慈悲愍眾故行道次入如來室既以慈悲化世必涉違從決須安忍次著如來衣然說雖次第行非次第行時入空即具一切法況慈忍耶四安樂行者一是止觀慈悲導身業二是止觀慈悲導口業三是止觀慈悲導意業四是止觀慈悲導誓願也身業有止故離身粗業有觀故不得身不得身業不得能離無所得故不墮凡夫地有慈悲故勤修身業廣利一切不墮二乘地有止行故著如來衣有觀行故坐如來座有慈悲故入如來室止行離過即成斷德觀行無著即成智德慈悲利他即成恩德恩德資成智德智德能通達斷德是名身業安樂行餘口意誓願亦如是此品來意者若諸大菩薩受命弘經深識權實廣知漸頓又達機緣神力自在非復濁世惱亂所能障阻不俟更示方法若初依始心欲修圓行入濁弘經為濁所惱自行不立亦無化功為是人故須示安樂行也。",
    "X32n0616_005:0143b05_1": "△此是迹門流通第五品經文分為二初問二答初中二初歎前品深行菩薩能如法弘經二問始行菩薩云何惡世弘經。",
    "X32n0616_005:0143b08_2": "今初。",
    "X32n0616_005:0143b09_0": "爾時文殊師利法王子菩薩摩訶薩白佛言世尊是諸菩薩甚為希有敬順佛故發大誓願於後惡世護持讀說是法華經。",
    "X32n0616_005:0143b12_0": "△二問始行菩薩云何惡世弘經。",
    "X32n0616_005:0143b13_0": "世尊菩薩摩訶薩於後惡世云何能說是經。",
    "X32n0616_005:0143b14_0": "△二答為三初總標章二解釋修行方法三總明行成之相。",
    "X32n0616_005:0143b15_1": "今初。",
    "X32n0616_005:0143b16_0": "佛告文殊師利若菩薩摩訶薩於後惡世欲說是經當安住四法。",
    "X32n0616_005:0143b18_0": "△二解釋修行方法四初身安樂行二口安樂行三意安樂行四誓願安樂行初中二初長文二偈頌長文中二初標二釋。",
    "X32n0616_005:0143b20_1": "今初。",
    "X32n0616_005:0143b21_0": "一者安住菩薩行處親近處能為眾生演說是經。",
    "X32n0616_005:0143b22_0": "詣理略說名行處即約正行附事廣說名親近處即約助行然說有廣略理無淺深也具如下釋。",
    "X32n0616_005:0143b23_1": "△二釋二初釋行處二釋親近處。",
    "X32n0616_005:0143b24_2": "今初。",
    "X32n0616_005:0143c01_0": "文殊師利云何名菩薩摩訶薩行處若菩薩摩訶薩住忍辱地柔和善順而不卒暴心亦不驚又復於法無所行而觀諸法如實相亦不行不分別是名菩薩摩訶薩行處。",
    "X32n0616_005:0143c05_0": "釋此為三初約一法謂一實諦次約二法謂生法二忍三約三法謂不思議三諦也初一實諦者為一切所歸為一切作本而徧無分別為一切所歸故云住忍辱地諸法歸之故名為地眾行休息故名忍辱此即行不行之行如來衣也(理雖無行依理而行行得理息即名不行行即不行故云行於不行之行)為一切作本故云柔和善順等眾行得理而成譬如萬物得地而生若得理本在剛能柔在逆能順在暴能治在驚能安無量功德從中道一實地生地無所生而生功德此即不行行之行如來室也(依理不行而行于行)徧無分別故云又復於法等謂了知行與不行性相無二見諸法實名不分別亦無不分別相可得名為亦不行不分別即是非行非不行之行如來座也(於法無所行故云非行亦不行不分別故云非不行)無三行而三行故名為行同一實諦故名為處初約一法釋行處竟次生法二忍者即生法二空也此與二乘不同二乘生空但破界內我執二乘法空但破界內邪因緣無因緣法執今明圓教二空約十界假名即中道故無復十界假名可得故名生空約十界實法即中道故無復十界實法可得故名法空若更開者即為四忍謂伏忍順忍無生忍寂滅忍也或為五忍則更加信忍或為六忍則更加和從忍或對四十二地則為四十二忍一地即有四十二地功德一忍寧無四十二忍法耶今且約四忍消文而與別教永異別教伏順二忍是生忍位則淺無生寂滅二忍是法忍位則深圓教不爾二忍四忍悉通初後何者二空之理即是中道初修四忍入于中道見二空理乃至後心亦秖窮二空理故大經云發心畢竟二不別若約無淺深判四忍者從初發心圓伏五住至金剛頂皆名伏忍初後悉不違實相故皆名順忍初後悉不起二邊心故皆名為無生忍初後悉休息眾行故皆名為寂滅忍(凡夫在迷理即二空四忍聞經生解名字二空四忍圓伏五住觀行二空忍六根清淨相似二空四忍四十一位分證二空四忍妙覺極果究竟二空四忍也)經云住忍辱地即住二空四忍地也柔和即伏忍善順等即順忍聞生死苦不匇卒畏懼聞涅槃樂不匇卒求證聞佛常與無常二乘作佛與不作佛生死涅槃異與不異佛道長短難易非長非短非難非易等皆不驚怖故名順忍又復於法無所行而觀諸法如實相即無生忍亦不行不分別即寂滅忍前二名生忍後二名法忍從始至終以二空理忍諸法是著如來衣安住二空理是坐如來座愍諸眾生是入如來室二空四忍名為行理即是處故云是菩薩行處也次約二法釋行處竟三約不思議三諦者住忍辱地總論三諦如有地可據方能忍辱也柔和善順者善順真諦能忍界內界外虗妄見愛寒熱等也而不卒暴心亦不驚者安於俗諦忍眾根緣稱適機宜故不卒暴體忍違從故心不驚也於法無所行等者即安中諦能忍二邊故云無所行正住中道故云觀如實相亦不得中實故云亦不行不分別此則據三諦之地名為處忍五住之辱名為行行亦為三謂止行即行而不行著如來衣觀行即非行非不行坐如來座慈悲行即不行而行入如來室是謂約三法釋菩薩行處明弘經方軌也。",
    "X32n0616_005:0144b10_1": "△二釋親近處三初約遠論近二約近論近三約非遠非近論近(遠近二字並去聲讀是虗活字)初約遠論近是附戒門以助止觀成就慈悲亦是廣上住忍辱地行不行也文為十初遠豪勢乃至十遠畜養於中九是生死第五二乘一種是涅槃二俱遠離乃名親近中道。",
    "X32n0616_005:0144b15_2": "初遠豪勢。",
    "X32n0616_005:0144b16_0": "云何名菩薩摩訶薩親近處菩薩摩訶薩不親近國王王子大臣官長。",
    "X32n0616_005:0144b18_0": "恐始行人恃附勢力失正道故初似小益久則大損。",
    "X32n0616_005:0144b19_1": "△二遠邪人邪法。",
    "X32n0616_005:0144b20_0": "不親近諸外道梵志尼犍子等及造世俗文筆讚詠外書及路伽耶陀逆路伽耶陀者。",
    "X32n0616_005:0144b22_0": "梵志亦云淨裔在家事梵者也尼犍此翻離繫出家外道之通名也路伽耶陀亦云韋陀西域外道典籍依于愛見而為答釋者也逆者徵問之謂即是依于愛見而為問難者也正觀未成切須防斷恐其染習迷於正理。",
    "X32n0616_005:0144c02_1": "△三遠兇險戲。",
    "X32n0616_005:0144c03_0": "亦不親近諸有兇戲相扠相撲及那羅等種種變現之戲。",
    "X32n0616_005:0144c05_0": "那羅此云力即捔力戲也不親近者恐散逸故。",
    "X32n0616_005:0144c05_1": "△四遠旃陀羅。",
    "X32n0616_005:0144c07_0": "又不親近旃陀羅及畜豬羊雞狗畋獵漁捕諸惡律儀如是人等或時來者則為說法無所希望。",
    "X32n0616_005:0144c09_0": "近旃陀羅令人無慈。",
    "X32n0616_005:0144c09_1": "△五遠二乘眾。",
    "X32n0616_005:0144c10_0": "又不親近求聲聞比丘比丘尼優婆塞優婆夷亦不問訊若於房中若經行處若在講堂中不共住止或時來者隨宜說法無所希求。",
    "X32n0616_005:0144c13_0": "近二乘人令人遠菩提故西土大小兩乘各居不雜故云或來既未受大勿妨小志故云隨宜說法。",
    "X32n0616_005:0144c15_0": "△六遠欲想。",
    "X32n0616_005:0144c16_0": "文殊師利又菩薩摩訶薩不應於女人身取能生欲想相而為說法亦不樂見若入他家不與小女處女寡女等共語。",
    "X32n0616_005:0144c19_0": "欲想最能殺害菩提心故。",
    "X32n0616_005:0144c19_1": "△七遠不男。",
    "X32n0616_005:0144c20_0": "亦復不近五種不男之人以為親厚。",
    "X32n0616_005:0144c21_0": "不男最能壞亂菩提志故五不男者一生不男謂胎中或初生時便缺男根二犍不男謂截去或爛壞等三妬不男謂因他婬欲乍有根起而無根用四變不男謂見男變女見女變男五半不男謂半月有用半月不能此皆宿造惡業今感惡報不任載道非佛法器故名重難不得出家亦不應與親厚。",
    "X32n0616_005:0145a03_1": "△八遠危害。",
    "X32n0616_005:0145a04_0": "不獨入他家若有因緣須獨入時但一心念佛。",
    "X32n0616_005:0145a05_0": "獨入他家恐招危害一心念佛障難悉除。",
    "X32n0616_005:0145a05_1": "△九遠譏嫌。",
    "X32n0616_005:0145a07_0": "若為女人說法不露齒笑不現胸臆乃至為法猶不親厚況復餘事。",
    "X32n0616_005:0145a09_0": "律中若為女人說法須有男子知好惡者在旁若無有知男子不得過五六語皆是遠嫌避疑勿令增他不善心也。",
    "X32n0616_005:0145a11_1": "△十遠畜養。",
    "X32n0616_005:0145a12_0": "不樂畜年少弟子沙彌小兒亦不樂與同師。",
    "X32n0616_005:0145a13_0": "少年之人習性未定自畜則妨修正業同師則嬈亂請益故也前文但云住忍辱地是直緣理今戒門廣出眾辱之緣應修遠離非持刀杖亦不棄捨但以正慧而遠離之如是十法諸教皆然但離二乘諸教小異今弘妙典須屬圓人觀心釋者應作總別二種總者無非法界何所可離何所不離非離非不離而論離耳還同非遠非近而論近初心雖了一切本無而須數數近於遠離別者遠離三教教主豪勢二邊之法即是邪法二邊人者即名邪人二觀神通名為兇戲三惑旃陀羅殺三智命偏空滅想名二乘眾偏觀真俗乃至中道法愛皆名欲想滅色住空名為不男方便觀智皆害圓極一切俗境名為譏嫌前三教善根名為年少小兒一一皆以所離為境皆遠三惑而近三觀也初約遠論近竟。",
    "X32n0616_005:0145b03_1": "△二約近論近是附定門以助止觀成就慈悲亦是廣上柔和善順而不卒暴心亦不驚不行行也上直明不暴不驚今廣出修定之心修定之處修定要門以定力故在暴而治在驚而安。",
    "X32n0616_005:0145b07_0": "常好坐禪在於閑處修攝其心文殊師利是名初親近處。",
    "X32n0616_005:0145b09_0": "常好坐禪是修定之心好于中道實相禪法即五法中欲兼攝得精進念巧慧一心也在於閑處是修定之處即五緣中處也修攝其心是修定要門謂呵五欲棄五蓋調五事也于二十五方便中前文附戒門離十惱亂即第一持戒清淨今云在於閑處即第三閑居靜處既在閑處理必兼攝第四息諸緣務但略不言第二衣食具足第五得善知識耳若約觀心明具五緣則三觀為衣禪悅法喜為食諸佛菩薩六度道品法性實際皆為善知識也呵五欲者謂色聲香味觸皆是劫功德賊深知其過休息貪染棄五蓋者謂貪欲瞋恚睡眠掉悔疑惑蓋覆定慧故須急棄如剪毒樹如檢偷賊調五事者謂調食不饑不飽調眠不節不恣調身不寬不急調息不澁不滑調心不沉不浮此二十法一一皆有事相理觀具如摩訶止觀須者尋之行五法者欲得初禪亦須五法乃至諸禪亦復如是今約圓觀則是欲從二邊正入中道不雜二邊為精任運流入為進繫緣法界一念法界為念修中觀方便名巧慧息於二邊心水澄清能知世間生滅法相是為不二其心清淨常一能見般若也以此戒定二門為前方便是故結云初親近處。",
    "X32n0616_005:0145c05_1": "△三約非遠非近論近是附慧門以助止觀成就慈悲亦是廣上於法無所行而觀諸法如實相亦不行不分別非行非不行也文分為三初總標境智二別釋三結成。",
    "X32n0616_005:0145c09_2": "今初。",
    "X32n0616_005:0145c10_0": "復次菩薩摩訶薩觀一切法空。",
    "X32n0616_005:0145c11_0": "觀者中道觀智也一切法者十法界境也空者不思議第一義諦也若單論智智無所觀故舉一切以顯皆空此空即是諸法實相唯佛與佛乃能究盡今菩薩初心便以中道止觀而觀察之所謂從始至終皆以佛知佛見而為修行故能開示悟入中間永無諸委曲相也。",
    "X32n0616_005:0145c16_1": "△二別釋。",
    "X32n0616_005:0145c17_0": "如實相不顛倒不動不退不轉如虗空無所有性一切語言道斷不生不出不起無名無相實無所有無量無邊無礙無障。",
    "X32n0616_005:0145c20_0": "如實相句別釋所觀十法界境不顛倒以下別釋能觀中道智也二邊三諦無一異故名之為如非七方便故名為實以實為相故言如實相也(二邊對中中必三諦三而不三名無一異三諦如實對七辨異故云實耳實即無相徧相一切)不顛倒者無凡夫常樂我淨四倒無二乘無常苦無我不淨四倒亦無出假常樂我淨四倒即是非榮非枯雙照榮枯正中道觀也不動者不為二死所動也不退者心心寂滅自然流入薩婆若海也不轉者不如凡夫輪轉生死不如二乘轉凡為聖也如虗空者但有名字字不可得中道觀智亦但有字求不可得也無所有性者無自性無他性無共性無無因性也一切語言道斷者離四句絕百非故不可思議也不生者惑智理皆不生謂所破能破稱理故俱不生則行位因果等皆不生也不出者如來所治全體即是故無可出畢竟不復發也不起者以入理故一切方便理教皆寂滅也無名者一切名所不能詮即不顛倒乃至不起亦不足以名之也無相者一切相所不能狀即不顛倒乃至不起亦不足以形容之也無名即是性空無相即是相空實無所有者重歎觀體非二邊之有也無量者非陰入界等諸數法也無邊者非偏小等諸有分限法也無礙者徧入一切諸法也無障者無有一法能遮止之也雖復多句秖是能觀之智無相無作與所觀之境稱實相應耳。",
    "X32n0616_005:0146a19_1": "△三結成。",
    "X32n0616_005:0146a20_0": "但以因緣有從顛倒生故說常樂觀如是法相是名菩薩摩訶薩第二親近處。",
    "X32n0616_005:0146a22_0": "但以因緣有者結也上直明中道觀慧今明雙照二邊理性畢竟清淨如上所說非解非惑而從惑因緣生生死從解因緣生涅槃生死涅槃如六龍舞從顛倒故有生死由生死故有涅槃故皆從顛倒生由有生死涅槃故有十界一切諸法可說而十界一切諸法畢竟皆空皆如實相也(上直明中道觀慧者多約雙非故也然而豈有中道不照二邊今此重明照于二邊用結諸文以顯中觀不思議體)又因緣有有於涅槃從顛倒生生於生死由有涅槃生死故有可說而中道實相之體證涅槃而非涅槃在生死而非生死終不可說故菩薩常樂觀之觀涅槃是真諦生死是俗諦涅槃生死所依之體即非涅槃生死是中諦也(此分因緣顛倒而為二邊義則更顯然生死正屬因緣且從倒邊故名顛倒若達因緣便有涅槃故以初句判屬涅槃也又三種涅槃皆以觀因緣有二種生死皆從三惑顛倒而生指迷歸悟故有言說)又但以因緣有從顛倒生者結不思議三諦境也故說者不思議教也常樂觀者不思議三觀也(一切從因緣生顛倒之法無非妙境由此本有妙境說上中道妙觀稟此妙說常樂觀于如是妙境也)已上三節雙約境智釋竟今更通三節文全約觀釋初云觀一切法空如實相者標觀體也實相正是所觀以所顯能觀方有體故也不顛倒下皆釋觀相不為二邊八倒所動故云不倒不動不墮二乘凡夫二地故云不退不轉非未來故不生非過去故不出非現在故不起釋論云如虗空無入無出無住相攝大乘亦爾無未來入處(不從于現以入未故即是不生)無過去出處(不從於現以出過故)無現在住處(現在不住即是不起)餘皆如前可解又經文有十九句初一句是總後十八句對大品十八空如實相即第一義空不顛倒即內空內無六入我我所執故不顛倒不動即外空外不為六塵所流動也不退即內外空十二入皆空故言不退不轉即空空空破諸法諸法是所破空是能破無復諸法唯有空在此空亦空故言空空空既空故無復能轉故言不轉也如虗空者即是大空執方計破故言如虗空也無所有性即畢竟空諸法無遺餘故名畢竟空以畢竟空故無所有性也一切語言道斷即一切空一切空不可說故語言道斷也不生即有為空有為是因緣和合既不合故不生也不出即無為空無為名出離出離法空故名不出也不起即無始空求原初不可得故無起也無名即性空無相即相空並可解實無所有即不可得空無量即有法空有法則有量有量既空故言無量也無邊即無法空無法則是邊表今空故無邊也無礙即有法無法空二俱不可得故言無礙也無障即散空妨障不可得故言無障也十八空皆是中道正慧皆名為空隨十八種境故言十八耳大經云如來常修十八空義故用十八空釋十八句也復次約十八空既可云初總後別前約體相亦可云總體別體總相別相復次初雙約境智釋次但全約觀釋然觀必觀境故可但全約觀境能發觀亦可但全約境今更私作全約境釋謂菩薩觀一切法無不皆空一切法皆如實相一切法皆不顛倒一切法皆不動皆不退皆不轉一切法皆如虗空無所有性一切語言道斷不生不出不起一切法皆無名一切法皆無相一切法皆實無所有一切法皆無量一切法皆無邊一切法皆無礙無障此顯百界千如諸法一一無非實相即權而實即俗而真也但以因緣有從顛倒生故說此顯實相無相之體隨染淨緣具造十界百界千如一切諸法即實而權即真而俗也權實不二乃是圓融不思議之二諦其體相即即名為一實諦言空則一切皆空言有則一切皆有言中則一切皆中復名為圓融三諦非一二三而一二三雖一二三而真理不當名一二三復名為圓妙無諦常樂觀如是法相即是正觀不思議境是故結云第二親近處也問前云行處是正行親近處是助行今第二親近處云何即名正觀答前不云乎詣理略說名行處略說名正附事廣說名親近處廣說名助說有廣略理無淺深圓家正助正助並圓直是非正非助圓道妙理約廣文能裨理觀名為助耳初身安樂行中初長文竟。",
    "X32n0616_005:0147a18_1": "△二偈頌三初頌標二頌釋三明行成。",
    "X32n0616_005:0147a19_2": "今初。",
    "X32n0616_005:0147a20_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0147a21_0": "若有菩薩於後惡世無怖畏心欲說是經應入行處及親近處。",
    "X32n0616_005:0147a23_0": "△二頌釋二初頌約遠論近二頌非遠非近長文分釋行處親近處頌中取意合頌不復次第正顯文有廣略理非淺深也。",
    "X32n0616_005:0147b01_1": "今初。",
    "X32n0616_005:0147b02_0": "常離國王及國王子大臣官長(一)兇險戲者(三)及旃陀羅(四)外道梵志(二)亦不親近增上慢人貪著小乘三藏學者破戒比丘名字羅漢及比丘尼好戲笑者深著五欲求現滅度諸優婆夷皆勿親近若是人等以好心來到菩薩所為聞佛道菩薩則以無所畏心不懷希望而為說法(五兼第十)寡女處女及諸不男皆勿親近以為親厚(六七)亦莫親近屠兒魁膾畋獵漁捕為利殺害販肉自活衒賣女色如是之人皆勿親近(又四)兇險相撲種種嬉戲諸婬女等盡勿親近(又三又六)莫獨屏處為女說法若說法時無得戲笑(九)入里乞食將一比丘若無比丘一心念佛(八)是則名為行處近處以此二處能安樂說。",
    "X32n0616_005:0147b14_0": "增上慢人謂坐禪得小輕安妄謂有所證得者也貪著小乘三藏學者謂專圖名相口耳學問不肯觀心修證者也名字羅漢謂假名阿練若也深著五欲謂于色聲香味觸五塵之中隨有偏嗜者也求現滅度謂但求小乘果證無大慈悲者也著五欲是生死邊求滅度是涅槃邊二皆勿近應近中道明矣此皆長文近處所列而今結云行處近處故知正助但約廣略決無淺深。",
    "X32n0616_005:0147b21_1": "△二頌非遠非近。",
    "X32n0616_005:0147b22_0": "又復不行上中下法有為無為實不實法亦不分別是男是女不得諸法不知不見是則名為菩薩行處。",
    "X32n0616_005:0147b24_0": "別教名上法通教名中法藏教名下法咸開入圓無復藏通別法可得故不行也六凡法界惑業苦等名有為有漏法四聖法界功德智慧名有為無漏法十界真如平等之性名無為法有為色心暫有體用名為實法不相應行依于色心分位假立名不實法又或有為名不實法性生滅故無為名實法性不改故或有漏名不實法以違性故無漏名實法以稱性故或一切實二俱稱諦故(有為是俗諦無為是真諦)一切不實情有理無理有情無故(有漏情之所有理之所無以理無故名為不實無漏理之所有情之所無以情無故名為不實)今皆不行者由觀諸法如實相則有為亦實相非復有為無為亦實相非復無為實亦實相非復是實不實亦實相非復不實故不行也此頌於法無所行而觀諸法如實相也亦不分別是男是女者男即是慧女即是定定慧之法性本絕言故不可分別也不得諸法者常自寂滅相故不知不見者遠離能取所取戲論相故此頌亦不行不分別也。",
    "X32n0616_005:0147c17_0": "一切諸法空無所有無有常住亦無起滅是名智者所親近處。",
    "X32n0616_005:0147c19_0": "此略頌觀一切法空等文也無有常住遮於真諦亦無起滅遮於俗諦真俗雙遮正顯中道言略意周矣。",
    "X32n0616_005:0147c22_0": "顛倒分別諸法有無是實非實是生非生在於閑處修攝其心安住不動如須彌山觀一切法皆無所有猶如虗空無有堅固不生不出不動不退常住一相是名近處。",
    "X32n0616_005:0148a02_0": "此頌從顛倒生故說以為所觀之境兼頌約近論近以為方便然後重頌正觀一切法空等也上文附戒附定合為初親近處慧名第二親近處今以定慧合頌而頌戒門則雙結行近正顯三學互融事理不二也問上云無有常住今云常住一相何也答若對起滅而言常住則是情計是故須破情計破已理本常住又對起滅而言常住則有二相今一切法皆無所有則無起無滅當體常住故名一相一相即實相實相即諸法而非諸法諸法即非法故名實相也二頌釋竟。",
    "X32n0616_005:0148a11_1": "△三明行成三初標行成二釋行成而得安樂三頌總結。",
    "X32n0616_005:0148a12_2": "今初。",
    "X32n0616_005:0148a13_0": "若有比丘於我滅後入是行處及親近處說斯經時無有怯弱。",
    "X32n0616_005:0148a15_0": "事成則外儀無失理成則內心無滯故無怯弱也。",
    "X32n0616_005:0148a16_0": "△二釋行成而得安樂。",
    "X32n0616_005:0148a17_0": "菩薩有時入於靜室以正憶念隨義觀法從禪定起為諸國王王子臣民婆羅門等開化演暢說斯經典其心安隱無有怯弱。",
    "X32n0616_005:0148a20_0": "此釋安樂之因因修禪定止於過惡得人無我外則不損因修智慧離諸取著得法無我內無顛倒是以心不怯弱不怯弱名安樂也。",
    "X32n0616_005:0148a22_1": "△三頌總結。",
    "X32n0616_005:0148a23_0": "文殊師利是名菩薩安住初法能於後世說法華經。",
    "X32n0616_005:0148a24_0": "初身安樂行竟。",
    "X32n0616_005:0148a24_1": "△二口安樂行二初長文二偈頌初中二初標二釋。",
    "X32n0616_005:0148b01_2": "今初。",
    "X32n0616_005:0148b02_0": "又文殊師利如來滅後於末法中欲說是經應住安樂行。",
    "X32n0616_005:0148b04_0": "△二釋為二初止行二觀行止行防非是如來衣觀行說法是如來座又止行拔苦觀行與樂是如來室也初止行又四初不說過二不輕慢三不歎毀四不怨嫌。",
    "X32n0616_005:0148b07_1": "今初。",
    "X32n0616_005:0148b08_0": "若口宣說若讀經時不樂說人及經典過。",
    "X32n0616_005:0148b09_0": "人雖有過于我何與秖應內省何暇非他若喜談人過者如揚糞穢自薰薰他損惱實重非安樂行也一切經典皆是如來方便隨宜所說如食石蜜中邊皆甜安得有過說經典過皆由不解權實妙理故亦非安樂行也。",
    "X32n0616_005:0148b13_1": "△二不輕慢。",
    "X32n0616_005:0148b14_0": "亦不輕慢諸餘法師。",
    "X32n0616_005:0148b15_0": "不倚圓而蔑偏不重實而輕權佛尚以異方便助顯第一義諦豈可自恃不護物機。",
    "X32n0616_005:0148b16_1": "△三不歎毀。",
    "X32n0616_005:0148b17_0": "不說他人好惡長短於聲聞人亦不稱名說其過惡亦不稱名讚歎其美。",
    "X32n0616_005:0148b19_0": "人皆惡聞其短故不譚短面譽彼人則如對毀此人故不稱長大論云自讚者是貢高人自毀者是妖惑人讚他者是諂佞人毀他者是讒賊人智者應以四悉籌量而護自他又日藏經云初中後夜減省睡眠精進坐禪誦經修道背捨生死向涅槃路不稱他短不說己長謙下卑遜不自憍高衣服知足不放逸行繫念思惟心不馳散於一切眾生起慈悲心此皆安樂行之相也於聲聞人等者根性不定若歎二乘或令彼退大取小若毀呰二乘或令彼大小俱失兩無所取也。",
    "X32n0616_005:0148c04_1": "△四不怨嫌。",
    "X32n0616_005:0148c05_0": "又亦不生怨嫌之心。",
    "X32n0616_005:0148c06_0": "若謂彼人彼法妨害我道即是怨心若謂彼人彼法鄙劣即是嫌心心機一動聲說即發杜說過之源故不生怨嫌心也大集經云過去拘留孫佛法中有一比丘發菩提心誦持大小乘法聚各八萬四千意嫌頭陀比丘不誦經典猶如株杌由此墮獄受大苦惱從地獄出受羅剎身至賢劫佛樓至佛時方脫鬼身常人尚爾況安樂行為弘大典將護小行安得不慎其心念耶怨怪嫌責怨深嫌淺淺深俱捨方稱正行此口安樂行所言心者為制口故初止行竟。",
    "X32n0616_005:0148c15_1": "△二觀行。",
    "X32n0616_005:0148c16_0": "善修如是安樂心故諸有聽者不逆其意有所難問不以小乘法答但以大乘而為解說令得一切種智。",
    "X32n0616_005:0148c18_0": "觀諸法空無所取著心不苟執不逆人意不違法相故不以小乘法答若見無大機而為說小則令得方便益若不見無大而為說小則恐妨其大緣故深位有知機之智則可隨宜說法始行無鑒物之能但可說大乘法也口安樂行初長文竟。",
    "X32n0616_005:0148c22_1": "△二偈頌三初頌標二頌釋三明行成。",
    "X32n0616_005:0148c23_2": "今初。",
    "X32n0616_005:0148c24_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0149a01_0": "菩薩常樂安隱說法於清淨地而施牀座以油塗身澡浴塵穢著新淨衣內外俱淨。",
    "X32n0616_005:0149a03_0": "長文但云應住此中別出行相安隱說法欲令前人得安隱道及安隱果即入如來室也於清淨地而施牀座即坐如來座也以油塗身四句即著如來衣也以此三法而導口業名安樂行。",
    "X32n0616_005:0149a06_1": "△二頌釋二初頌止行二頌觀行初中四初頌二不輕慢二頌三不歎毀三頌初不說過四頌四不怨嫌長文俱約止善說頌中皆約行善說也。",
    "X32n0616_005:0149a09_2": "今初。",
    "X32n0616_005:0149a10_0": "安處法座隨問為說。",
    "X32n0616_005:0149a11_0": "慢則不隨隨即不輕慢意。",
    "X32n0616_005:0149a11_1": "△二頌三不歎毀。",
    "X32n0616_005:0149a12_0": "若有比丘及比丘尼諸優婆塞及優婆夷國王王子羣臣士民以微妙義和顏為說若有難問隨義而答。",
    "X32n0616_005:0149a14_0": "但依于義不譚人好惡也隨義答者有二一可答二不可答若問答相難詰相上下若勝負則自知是為智者語一可答也若自放恣敢有違者誅之是為王者語若長短是非皆不知惟覓勝而已是為愚者語二不可答也。",
    "X32n0616_005:0149a18_1": "△三頌初不說過。",
    "X32n0616_005:0149a19_0": "因緣譬喻敷演分別以是方便皆使發心漸漸增益入於佛道。",
    "X32n0616_005:0149a21_0": "若樂說人及經典過生人毒念今不說過故使發心入於佛道佛道從喜生也。",
    "X32n0616_005:0149a22_1": "△四頌四不怨嫌。",
    "X32n0616_005:0149a23_0": "除懶惰意及懈怠想離諸憂惱慈心說法。",
    "X32n0616_005:0149a24_0": "怨嫌心起則懈懶憂惱今慈心說法則精進歡悅也初頌止行竟。",
    "X32n0616_005:0149b01_1": "△二頌觀行。",
    "X32n0616_005:0149b02_0": "晝夜常說無上道教以諸因緣無量譬喻開示眾生咸令歡喜衣服臥具飲食醫藥而於其中無所希望但一心念說法因緣願成佛道令眾亦爾是則大利安樂供養。",
    "X32n0616_005:0149b06_0": "說無上道即頌但以大乘法答願成佛道令眾亦爾即頌令得一切種智也二頌釋竟。",
    "X32n0616_005:0149b07_1": "△三明行成四初標行成二明內無過則外難不生三明內有善法所以行成四格量功德。",
    "X32n0616_005:0149b09_2": "今初。",
    "X32n0616_005:0149b10_0": "我滅度後若有比丘能演說斯妙法華經。",
    "X32n0616_005:0149b11_0": "△二明內無過則外難不生如無臭物蠅則不來。",
    "X32n0616_005:0149b12_0": "心無嫉恚諸惱障礙亦無憂愁及罵詈者又無怖畏加刀杖等亦無擯出安住忍故。",
    "X32n0616_005:0149b14_0": "△三明內有善法所以行成。",
    "X32n0616_005:0149b15_0": "智者如是善修其心能住安樂如我上說。",
    "X32n0616_005:0149b16_0": "若內無過如長文中說若內有善如偈中說也。",
    "X32n0616_005:0149b16_1": "△四格量功德。",
    "X32n0616_005:0149b18_0": "其人功德千萬億劫算數譬喻說不能盡。",
    "X32n0616_005:0149b19_0": "二口安樂行竟。",
    "X32n0616_005:0149b19_1": "△三意安樂行二初長文二偈頌初中三初標二釋三結行成。",
    "X32n0616_005:0149b20_2": "今初。",
    "X32n0616_005:0149b21_0": "又文殊師利菩薩摩訶薩於後末世法欲滅時受持讀誦斯經典者。",
    "X32n0616_005:0149b23_0": "△二釋二初止行二觀行止行是衣觀行是座拔苦與樂是室也初中四初不嫉誑二不輕罵三不惱亂四不諍競。",
    "X32n0616_005:0149c01_1": "今初。",
    "X32n0616_005:0149c02_0": "無懷嫉妬諂誑之心。",
    "X32n0616_005:0149c03_0": "不耐他榮名為嫉妬由貪故瞋瞋垢之最重者也險曲罔他名之為諂藏逆露順不任教誨貪癡為體正與道相違也矯現有德以圖利養名之為誑由貪癡故墮邪命法謬膺恭敬招苦無窮故此等心皆是學道大障苟有其一尚不能得二乘菩提況可弘通大法上求下化耶安樂行菩薩急須棄之。",
    "X32n0616_005:0149c09_1": "△二不輕罵。",
    "X32n0616_005:0149c10_0": "亦勿輕罵學佛道者求其長短。",
    "X32n0616_005:0149c11_0": "彼既發心學佛便墮未來佛數縱令煩惱習性不同互有長短但取其長以自益勿求其短而忤彼也。",
    "X32n0616_005:0149c13_1": "△三不惱亂。",
    "X32n0616_005:0149c14_0": "若比丘比丘尼優婆塞優婆夷求聲聞者求辟支佛者求菩薩道者無得惱之令其疑悔語其人言汝等去道甚遠終不能得一切種智所以者何汝是放逸之人於道懈怠故。",
    "X32n0616_005:0149c18_0": "四眾各有求三乘人所求三乘義攝藏通別之三教此三教法皆是如來善巧方便循循善誘為實所施之權四眾苟能依之求道自可漸引歸圓若自恃圓解呵其去道尚遠自恃薄有行門呵其放逸懈怠彼既被呵便生疑悔進不能薦取圓理退不能遵守三權是即惱亂行人招過不小矣若具知根智眼乃能與奪適宜。",
    "X32n0616_005:0149c24_1": "△四不諍競。",
    "X32n0616_005:0150a01_0": "又亦不應戲論諸法有所諍競。",
    "X32n0616_005:0150a02_0": "名字位人薄解文義未能念念觀心每于消文釋義而起諍競只此諍競便名戲論何況縱恣習氣言語嘲謔濁亂心神增長放逸非安樂行切須戒之初止行竟。",
    "X32n0616_005:0150a05_1": "△二觀行四初大悲想治嫉誑二慈父想治輕罵三大師想治惱亂四平等說法治諍競。",
    "X32n0616_005:0150a07_2": "今初。",
    "X32n0616_005:0150a08_0": "當於一切眾生起大悲想。",
    "X32n0616_005:0150a09_0": "既起大悲誓當拔苦何忍嫉之諂之誑之。",
    "X32n0616_005:0150a09_1": "△二慈父想治輕罵。",
    "X32n0616_005:0150a11_0": "於諸如來起慈父想。",
    "X32n0616_005:0150a12_0": "既學佛道即未來佛佛即我等大慈悲父何可輕罵求其長短。",
    "X32n0616_005:0150a13_1": "△三大師想治惱亂。",
    "X32n0616_005:0150a14_0": "於諸菩薩起大師想於十方諸大菩薩常應深心恭敬禮拜。",
    "X32n0616_005:0150a16_0": "三乘四眾無非菩薩有化訓德皆眾生師常應深心禮敬何得惱令懷疑。",
    "X32n0616_005:0150a17_1": "△四平等說法治諍競。",
    "X32n0616_005:0150a18_0": "於一切眾生平等說法以順法故不多不少乃至深愛法者亦不為多說。",
    "X32n0616_005:0150a20_0": "文隨於義義隨文名為平等平等則無偏執不起諍競也以順法故不多不少量機利鈍隨器而授也多說便為戲論以彼不堪領解徒費文辭無實益故若能領解則如娑竭龍王雨注大海乃至塵說剎說亦不為多二釋竟。",
    "X32n0616_005:0150a24_1": "△三結行成。",
    "X32n0616_005:0150b01_0": "文殊師利是菩薩摩訶薩於後末世法欲滅時有成就是第三安樂行者說是法時無能惱亂。",
    "X32n0616_005:0150b03_0": "此由止行成故惡不能加也。",
    "X32n0616_005:0150b04_0": "得好同學共讀誦是經亦得大眾而來聽受聽已能持持已能誦誦已能說說已能書若使人書供養經卷恭敬尊重讚歎。",
    "X32n0616_005:0150b07_0": "此由觀行成故勝人來集也意安樂行初長文竟。",
    "X32n0616_005:0150b08_0": "△二偈頌二初頌釋二頌行成略不頌標也初中二初頌止行二頌觀行。",
    "X32n0616_005:0150b09_1": "今初。",
    "X32n0616_005:0150b10_0": "爾時世尊欲宣重此義而說偈言。",
    "X32n0616_005:0150b11_0": "若欲說是經當捨嫉恚慢諂誑邪偽心常修質直行不輕蔑於人亦不戲論法不令他疑悔云汝不得佛。",
    "X32n0616_005:0150b13_0": "初四句頌初不嫉誑恚慢二字嫉之本也邪偽二字諂誑之註脚也常修質直行正明對治門也第五句頌二不輕罵第六句頌四不諍競後兩句頌三不惱亂。",
    "X32n0616_005:0150b16_1": "△二頌觀行。",
    "X32n0616_005:0150b17_0": "是佛子說法常柔和能忍慈悲於一切不生懈怠心十方大菩薩愍眾故行道應生恭敬心是則我大師於諸佛世尊生無上父想破於憍慢心說法無障礙。",
    "X32n0616_005:0150b20_0": "初一偈頌初大悲想第二偈頌三大師想次半偈頌二慈父想後半偈頌四平等說法初頌釋竟。",
    "X32n0616_005:0150b21_1": "△二頌行成。",
    "X32n0616_005:0150b23_0": "第三法如是智者應守護一心安樂行無量眾所敬。",
    "X32n0616_005:0150b24_0": "三意安樂行竟。",
    "X32n0616_005:0150b24_1": "△四誓願安樂行二初長文二偈頌初中二初明行法二歎經初又三初標二釋三結行成。",
    "X32n0616_005:0150c02_2": "今初。",
    "X32n0616_005:0150c03_0": "又文殊師利菩薩摩訶薩於後末世法欲滅時有持是法華經者。",
    "X32n0616_005:0150c05_0": "△二釋為三初明誓願所緣之境二明起誓願之由三正立誓願。",
    "X32n0616_005:0150c06_1": "今初。",
    "X32n0616_005:0150c07_0": "於在家出家人中生大慈心於非菩薩人中生大悲心。",
    "X32n0616_005:0150c09_0": "已發三乘出世心者名為在家出家之人全未發心名為非菩薩人就發心中未斷通惑在三界內名在家人已斷通惑出三界外名出家人此收藏通三乘別四十心皆盡也非菩薩人即收六道四生皆盡也如此十法界境各有苦集應拔皆當起於大悲各有道滅應與皆當起於大慈但已發心者善芽既萌因其善而玉成之故起大慈此慈即能拔三惑苦未發心者惡習偏強因其惡而拯救之故起大悲此悲即能與三德樂是謂緣無作諦起無作誓也。",
    "X32n0616_005:0150c18_1": "△二明起誓願之由。",
    "X32n0616_005:0150c19_0": "應作是念如是之人則為大失如來方便隨宜說法不聞不知不覺不問不信不解。",
    "X32n0616_005:0150c21_0": "如來方便隨宜說法者通指一代時教或頓或漸或大或小或圓或偏或顯或密或定不定乃至或兼或但或對或帶或開或顯或廢或立一一皆是不可思議善巧方便一一皆是隨順眾生所宜也非菩薩人則于權法不聞不知不覺在家出家菩薩則于妙法不問不信不解不聞故無三乘聞慧不知故無三乘思慧不覺故無三乘修慧不問故無一乘聞慧不信故無一乘思慧不解故無一乘修慧此皆迷本道滅而為界內界外種種苦集不達苦集體即道滅所以為起弘誓願之由也。",
    "X32n0616_005:0151a06_1": "△三正立誓願。",
    "X32n0616_005:0151a08_0": "其人雖不問不信不解是經我得阿耨多羅三藐三菩提時隨在何地以神通力智慧力引之令得住是法中。",
    "X32n0616_005:0151a11_0": "前明誓由雙舉無權實三慧今但約無圓三慧而立誓者實能攝權故也但乏圓慧尚在所愍況彼沉迷尤當哀惻神通力者如來衣如來室力不起滅定現諸威儀先以定動也智慧力者如來座力四辯莊嚴後以慧拔也引之令得住是法中則必為實施權開權顯實二釋竟。",
    "X32n0616_005:0151a16_1": "△三結行成二初明離過二明利益。",
    "X32n0616_005:0151a17_2": "今初。",
    "X32n0616_005:0151a18_0": "文殊師利是菩薩摩訶薩於如來滅後有成就此第四法者說是法時無有過失。",
    "X32n0616_005:0151a20_0": "起大慈悲是入如來室行成知諸菩薩非菩薩等失于權實三慧是坐如來座行成弘誓制心始終不倦是著如來衣行成室行成故無瞋垢過失座行成故無諂誑過失衣行成故無懈怠過失自既拔苦徧拔他苦義同止行成也。",
    "X32n0616_005:0151a24_1": "△二明利益又二初正明二釋結。",
    "X32n0616_005:0151b01_2": "今初。",
    "X32n0616_005:0151b02_0": "常為比丘比丘尼優婆塞優婆夷國王王子大臣人民婆羅門居士等供養恭敬尊重讚歎虗空諸天為聽法故亦常隨侍若在聚落城邑空閑林中有人來欲難問者諸天晝夜常為法故而衛護之能令聽者皆得歡喜。",
    "X32n0616_005:0151b07_0": "室行成故人天供養隨侍聽法衣行成故諸天衛護無能難問座行成故聽者歡喜自既得樂徧與他樂義同觀行成也。",
    "X32n0616_005:0151b09_1": "△二釋結。",
    "X32n0616_005:0151b10_0": "所以者何此經是一切過去未來現在諸佛神力所護故。",
    "X32n0616_005:0151b12_0": "三世諸佛同皆守護如是妙典說此經者安得不獲此大利益耶初明行法竟。",
    "X32n0616_005:0151b13_1": "△二歎經二初就法略歎二約譬廣歎。",
    "X32n0616_005:0151b14_2": "今初。",
    "X32n0616_005:0151b15_0": "文殊師利是法華經於無量國中乃至名字不可得聞何況得見受持讀誦。",
    "X32n0616_005:0151b17_0": "諸佛出世懸遠難值正使佛出久默斯要是故聞名尚不可得況得見耶況受持耶況讀誦耶意顯今得見聞受持讀誦乃是不可思議因緣應須寶重如說修行也。",
    "X32n0616_005:0151b20_1": "△二約譬廣歎二初不與珠譬二與珠譬初中二初立譬二法合初又五初威伏諸國(至)五惟不與珠。",
    "X32n0616_005:0151b22_2": "今初。",
    "X32n0616_005:0151b23_0": "文殊師利譬如強力轉輪聖王欲以威勢降伏諸國。",
    "X32n0616_005:0151b24_0": "輪王譬如來化世諸國譬陰入界諸境也。",
    "X32n0616_005:0151b24_1": "△二小王不順。",
    "X32n0616_005:0151c02_0": "而諸小王不順其命。",
    "X32n0616_005:0151c03_0": "小王譬見愛等諸煩惱魔即是寇盜所謂林中王耳未得無漏調伏名不順其命。",
    "X32n0616_005:0151c04_1": "△三起兵討伐。",
    "X32n0616_005:0151c05_0": "時轉輪王起種種兵而往討伐。",
    "X32n0616_005:0151c06_0": "戒如堅甲定如營壘慧如利器七賢中方法為前軍須陀洹斯陀含中方法為次軍阿那含阿羅漢中方法為後軍所破者是三毒等分八萬四千之寇盜能破者是八萬四千法門之官兵(小乘八萬四千法蘊)。",
    "X32n0616_005:0151c10_0": "△四有功喜賜。",
    "X32n0616_005:0151c11_0": "王見兵眾戰有功者即大歡喜隨功賞賜或與田宅聚落城邑或與衣服嚴身之具或與種種珍寶金銀瑠璃硨磲碼碯珊瑚琥珀象馬車乘奴婢人民。",
    "X32n0616_005:0151c14_0": "田譬禪定宅譬解脫聚落譬初果二果邑譬三果城譬涅槃即第四果衣服譬慚忍善法嚴身之具譬一切助道善法種種七寶譬七科無漏道品象馬車乘譬二乘盡智及無生智奴婢譬神通人民譬有漏善法。",
    "X32n0616_005:0151c18_1": "△五惟不與珠。",
    "X32n0616_005:0151c19_0": "唯髻中明珠不以與之所以者何獨王頂上有此一珠若以與之王諸眷屬必大驚怪。",
    "X32n0616_005:0151c21_0": "有出分段機發名小功勳有出變易機發為大功勳若未有大勳忽賜髻珠則眷屬驚怪譬眾生大機未發忽說此經不惟二乘疑惑即菩薩亦驚怪也初立譬竟。",
    "X32n0616_005:0151c24_1": "△二法合亦五初合威伏諸國(至)五合唯不與珠。",
    "X32n0616_005:0152a01_2": "今初。",
    "X32n0616_005:0152a02_0": "文殊師利如來亦復如是以禪定智慧力得法國土王於三界。",
    "X32n0616_005:0152a04_0": "禪定智慧力得法國土者禪定是慈忍行成福德莊嚴解脫德也智慧是空座行成智慧莊嚴般若德也以此二修而顯一性合上轉輪聖王雖是王胤由有強力而得登極故言得法國土即是證于常寂光土也王於三界者統攝實報方便同居三土合上欲以威勢降伏諸國令斷三惑出二死順法性也。",
    "X32n0616_005:0152a10_1": "△二合小王不順。",
    "X32n0616_005:0152a11_0": "而諸魔王不肯順伏。",
    "X32n0616_005:0152a12_0": "同居三界則有見愛魔王方便三界則有塵沙魔王實報三界則有無明魔王皆不順法性也。",
    "X32n0616_005:0152a13_1": "△三合起兵討伐。",
    "X32n0616_005:0152a15_0": "如來賢聖諸將與之共戰。",
    "X32n0616_005:0152a16_0": "即是七賢前軍乃至四果後軍與界內見愛煩惱戰也。",
    "X32n0616_005:0152a17_1": "△四合有功喜賜。",
    "X32n0616_005:0152a18_0": "其有功者心亦歡喜於四眾中為說諸經令其心悅賜以禪定解脫無漏根力諸法之財又復賜與涅槃之城言得滅度引導其心令皆歡喜。",
    "X32n0616_005:0152a21_0": "能降見愛名為有功餘可知。",
    "X32n0616_005:0152a21_1": "△五合唯不與珠。",
    "X32n0616_005:0152a22_0": "而不為說是法華經。",
    "X32n0616_005:0152a23_0": "濁障雖除大機未發故不為說也初不與珠譬竟。",
    "X32n0616_005:0152a24_0": "△二與珠譬亦二初立譬二法合。",
    "X32n0616_005:0152a24_1": "今初。",
    "X32n0616_005:0152b01_0": "文殊師利如轉輪王見諸兵眾有大功者心甚歡喜以此難信之珠久在髻中不妄與人而今與之。",
    "X32n0616_005:0152b03_0": "圓明如意珠王譬中道實智體具三德圓即法身德明即般若德如意雨寶即解脫德極果所宗故在王頂臣下從來所未聞見故名難信實為權所隱故云久在髻中解髻即開權與珠即顯實也。",
    "X32n0616_005:0152b06_1": "△二法合。",
    "X32n0616_005:0152b08_0": "如來亦復如是於三界中為大法王以法教化一切眾生見賢聖軍與五陰魔煩惱魔死魔共戰有大功勳滅三毒出三界破魔網爾時如來亦大歡喜此法華經能令眾生至一切智一切世間多怨難信先所未說而今說之。",
    "X32n0616_005:0152b13_0": "大集經云知苦壞陰魔斷集離煩惱魔證滅離死魔修道壞天子魔此約小乘破界內四魔言也然而小乘修出世道但以天魔不能為障故云壞天子魔其實未能降伏天魔惟有如來應身八相成道示現降天魔耳今云與五陰魔煩惱魔死魔共戰滅三毒出三界即是分段功成又云有大功勳破魔網即是大乘機發故大歡喜而說此難信之妙經也。",
    "X32n0616_005:0152b21_0": "文殊師利此法華經是諸如來第一之說於諸法中最為甚深末後賜與如彼強力之王久護明珠今乃與之文殊師利此法華經諸佛如來秘密之藏於諸經中最在其上長夜守護不妄宣說始於今日乃與汝等而敷演之。",
    "X32n0616_005:0152c02_0": "既以法合譬竟又復提譬帖合殷勤讚歎不一而足欲令聞者作難遭想依安樂行敬愛持弘故也誓願安樂行初長文竟。",
    "X32n0616_005:0152c04_1": "△二偈頌二初頌行法二頌歎經初中二初超頌行成二追頌行法。",
    "X32n0616_005:0152c05_2": "今初。",
    "X32n0616_005:0152c06_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0152c07_0": "常行忍辱哀愍一切乃能演說佛所讚經。",
    "X32n0616_005:0152c08_0": "上總明行成今頌別顯初句頌著衣行成次句頌入室行成演說頌坐座行成也。",
    "X32n0616_005:0152c09_1": "△二追頌行法三初頌誓願所緣之境二頌起誓願之由三頌正立誓願。",
    "X32n0616_005:0152c11_2": "今初。",
    "X32n0616_005:0152c12_0": "後末世時持此經者於家出家及非菩薩應生慈悲。",
    "X32n0616_005:0152c13_0": "△二頌起誓願之由。",
    "X32n0616_005:0152c14_0": "斯等不聞不信是經則為大失。",
    "X32n0616_005:0152c15_0": "△三頌正立誓願。",
    "X32n0616_005:0152c16_0": "我得佛道以諸方便為說此法令住其中。",
    "X32n0616_005:0152c17_0": "初頌行法竟。",
    "X32n0616_005:0152c17_1": "△二頌歎經但頌約譬廣歎不頌就法略歎又長文兩譬兩合今初總頌兩譬二總頌兩合也。",
    "X32n0616_005:0152c19_2": "初總頌兩譬。",
    "X32n0616_005:0152c20_0": "譬如強力轉輪之王兵戰有功賞賜諸物象馬車乘嚴身之具及諸田宅聚落城邑或與衣服種種珍寶奴婢財物歡喜賜與如有勇健能為難事王解髻中明珠賜之。",
    "X32n0616_005:0152c24_0": "先三偈頌不與珠譬後一偈頌與珠譬。",
    "X32n0616_005:0152c24_1": "△二總頌兩合。",
    "X32n0616_005:0153a02_0": "如來亦爾為諸法王忍辱大力智慧寶藏以大慈悲如法化世見一切人受諸苦惱欲求解脫與諸魔戰為是眾生說種種法以大方便說此諸經既知眾生得其力已末後乃為說是法華如王解髻明珠與之此經為尊眾經中上我常守護不妄開示今正是時為汝等說。",
    "X32n0616_005:0153a08_0": "先三偈半頌合不與珠後三偈頌合與珠也二解釋修行方法竟。",
    "X32n0616_005:0153a09_1": "△三總明行成之相三初結勸四行二舉三報以勸三總結。",
    "X32n0616_005:0153a10_2": "今初。",
    "X32n0616_005:0153a11_0": "我滅度後求佛道者欲得安隱演說斯經應當親近如是四法。",
    "X32n0616_005:0153a13_0": "△二舉三報以勸亦名三障清淨復為三初報障轉轉現報二業障轉轉生報三煩惱障轉轉後報。",
    "X32n0616_005:0153a15_0": "今初。",
    "X32n0616_005:0153a16_0": "讀是經者常無憂惱又無病痛顏色鮮白。",
    "X32n0616_005:0153a17_0": "常無憂惱轉現報之心又無病痛等轉現報之色也。",
    "X32n0616_005:0153a18_1": "△二業障轉轉生報。",
    "X32n0616_005:0153a19_0": "不生貧窮卑賤醜陋。",
    "X32n0616_005:0153a20_0": "惡業之因乃感惡果持經則不作貧賤業所以不生卑陋處也。",
    "X32n0616_005:0153a21_1": "△三煩惱障轉轉後報二初別明三煩惱障轉二總明一切煩惱障轉初又三初貪障轉二瞋障轉三癡障轉。",
    "X32n0616_005:0153a23_2": "今初。",
    "X32n0616_005:0153a24_0": "眾生樂見如慕賢聖天諸童子以為給使。",
    "X32n0616_005:0153b01_0": "多貪欲者則人忽慢又復障生梵天今貪欲障轉故眾生敬慕天童給使也。",
    "X32n0616_005:0153b02_1": "△二瞋障轉。",
    "X32n0616_005:0153b03_0": "刀杖不加毒不能害若人惡罵口則閉塞遊行無畏如師子王。",
    "X32n0616_005:0153b05_0": "捨瞋則內除刀箭入陣則外刃不傷。",
    "X32n0616_005:0153b05_1": "△三癡障轉。",
    "X32n0616_005:0153b06_0": "智慧光明如日之照。",
    "X32n0616_005:0153b07_0": "初別明三煩惱障轉竟。",
    "X32n0616_005:0153b07_1": "△二總明一切煩惱障轉四初夢入十信相似位(至)四夢入妙覺究竟位蓋安樂既是如來之行故弘經者預表果成當知弘功其力不小又百千萬億劫事咸在一念夢中用表妙法不可思議一中無量無量中一是相前現後當尅果一生弘教功超累劫也。",
    "X32n0616_005:0153b12_2": "初夢入十信相似位。",
    "X32n0616_005:0153b14_0": "若於夢中但見妙事見諸如來坐師子座諸比丘眾圍繞說法又見龍神阿修羅等數如恒沙恭敬合掌自見其身而為說法。",
    "X32n0616_005:0153b17_0": "初二句總貫諸文次四句見佛聞法表上求佛道也後六句為龍神等說法表下化眾生也。",
    "X32n0616_005:0153b18_1": "△二夢入初住見道位。",
    "X32n0616_005:0153b20_0": "又見諸佛身相金色放無量光照於一切以梵音聲演說諸法佛為四眾說無上法見身處中合掌讚佛聞法歡喜而為供養得陀羅尼證不退智佛知其心深入佛道即為授記成最正覺汝善男子當於來世得無量智佛之大道國土嚴淨廣大無比亦有四眾合掌聽法。",
    "X32n0616_005:0153c02_0": "見身處中表入實也聞法歡喜表悟圓因所證與別歡喜地同也得陀羅尼即三總持證不退智即三不退授記作佛即無生現前記也。",
    "X32n0616_005:0153c04_1": "△三夢入住行向地修道位。",
    "X32n0616_005:0153c06_0": "又見自身在山林中修習善法證諸實相深入禪定見十方佛。",
    "X32n0616_005:0153c08_0": "善法者稱性所起慧行及與行行即是七科道品十波羅蜜四等四攝三昧總持等一切佛道也實相即是中道中道非一非多由破四十品惑即有四十番分證中道故名證諸實相也深入禪定即首楞嚴定不以二相見于如來故云見十方佛也又後心菩薩入金剛定諸佛現前灌頂授職故云見十方佛。",
    "X32n0616_005:0153c14_1": "△四夢入妙覺究竟位。",
    "X32n0616_005:0153c15_0": "諸佛身金色百福相莊嚴聞法為人說常有是好夢又夢作國王捨宮殿眷屬及上妙五欲行詣於道場在菩提樹下而處師子座求道過七日得諸佛之智成無上道已起而轉法輪為四眾說法經千萬億劫說無漏妙法度無量眾生後當入涅槃如煙盡燈滅。",
    "X32n0616_005:0153c20_0": "夢八相佛寄顯妙覺也從須陀洹至辟支佛悉有夢唯佛不夢無疑無習氣故金光明最勝王經明將證十地皆先有夢夢是獨頭意識與睡眠心所合幻現三世種種境界所夢與過去事相應即是習氣影子若與未來事相應即是吉凶先兆今持經王得此好夢未來不虗是吉兆也二舉三報以勸竟。",
    "X32n0616_005:0154a02_1": "△三總結。",
    "X32n0616_005:0154a03_0": "若後惡世中說是第一法是人得大利如上諸功德。",
    "X32n0616_005:0154a04_0": "原此安樂行品特示初心弘法方軌具含十乘觀法今略點之令緣心有在觀諸法如實相第一觀不思議境也於在家出家起大慈心於非菩薩起大悲心第二真正發菩提心也三業各有止行觀行第三善巧安心也觀一切法空等第四破法徧也亦不行不分別第五識通塞也三業及誓願即圓四念處依此圓斷二惡而生二善成就如意根力覺道第六調適道品也離十惱亂等第七對治助開也夢中所見表第八次位也而不卒暴心亦不驚第九能安忍也於法無所行第十離法愛也通括四行十法略周又細論之則一一行中並具十法又十法為正四行助之若四若十並涉因果又四行為總十觀為別若總若別俱通橫豎十法導理無不尅終四行事儀豈局在始圓道妙行終始無殊六即義明措足有地初迹門開權顯實竟。",
    "X32n0616_005:0154a20_0": "妙法蓮華經台宗會義卷五之一",
    "X32n0616_005:0154b01_0": "妙法蓮華經台宗會義卷五之二",
    "X32n0616_005:0154b02_0": "古吳後學蕅益　智旭　述",
    "X32n0616_005:0154b03_0": "△釋安樂行品竟次釋從地涌出品。",
    "X32n0616_005:0154b04_0": "從地涌出品第十五",
    "X32n0616_005:0154b05_0": "師嚴道尊鞠躬祇奉如來一命四方奔踊故言從地涌出品(道在師故道尊師有道故師嚴師嚴故命不可違道尊故有命必赴命者一由寶塔品末云佛欲以此妙法華經付囑有在此命猶通二由此品之初他方菩薩請弘佛止之曰我娑婆世界自有六萬恒河沙等即別命也此世界悉檀也)三世化物惠利無疆一月萬影孰能思量召過以示現弘經以益當故言從地涌出品(為人悉檀)虗空湛然無早無晚惑者執迹而闇其本召昔示今破近執而顯遠事故言從地涌出品(虗空譬理理無早睌依理成事事有本迹或執近迹以失遠本本迹尚迷況不思議一故本弟子居下虗空本地之家師經久虗空今之師弟在今虗空久空今空下空上空雖則體一然本弟子元知近迹今之弟子猶迷遠本為破近執召昔示今今弟子因疑致請聞說方破執近之惡對治悉也)寂場少父久服種智還年之藥故老而若少寂光老兒亦久稟常住不死之方故少而若老示其藥力咸令得知故言從地涌出品(第一義悉)文云是從何所來以何因緣集當知四悉檀因緣故涌出也(然初一悉文在今品第二意兼後品三四二悉探用後品皆是助後以成顯遠善生惡破見本故也故知世界即後三悉之由今涌出品專在世界)。",
    "X32n0616_005:0154b20_1": "△二本門開近顯遠三初從此至汝等自當因是得聞是序段二從爾時釋迦牟尼佛告彌勒菩薩下訖分別功德品初彌勒說偈是正說段三從爾時佛告彌勒訖常不輕品共三品半是流通段初序為二初涌出二疑問初中三初他方菩薩請弘經二如來不許三下方涌出。",
    "X32n0616_005:0154c02_0": "今初。",
    "X32n0616_005:0154c03_0": "爾時他方國土諸來菩薩摩訶薩過八恒河沙數於大眾中起合掌作禮而白佛言世尊若聽我等於佛滅後在此娑婆世界勤加精進護持讀誦書寫供養是經典者當於此土而廣說之。",
    "X32n0616_005:0154c07_0": "他方菩薩已聞迹門說流通竟慕此通經勝福故願住此弘宣也。",
    "X32n0616_005:0154c08_1": "△二如來不許。",
    "X32n0616_005:0154c09_0": "爾時佛告諸菩薩摩訶薩眾止善男子不須汝等護持此經所以者何我娑婆世界自有六萬恒河沙等菩薩摩訶薩一一菩薩各有六萬恒河沙眷屬是諸人等能於我滅後護持讀誦廣說此經。",
    "X32n0616_005:0154c13_0": "如來止之凡有三義一者汝等各各自有己任若住此土廢彼利益二者他方菩薩此土結緣事淺雖欲宣授必無巨益三者若復許之則不得召下下若不來不得破近顯遠也問諸佛菩薩分身散影普徧十方誘化一切有何彼此而言己任及廢彼耶答佛菩薩心實無彼此但機有在無無始法爾初從此佛菩薩結緣還於此佛菩薩成熟由此須召下方也召下方來亦有三義一者是我弟子應弘我法二者以緣深廣能徧此土徧分身土而作利益三者得開近顯遠也(各有己任無世界益結緣事淺無為人益不得破近無對治益不得顯遠無第一義益以無四益所以止之子弘父法有世界益結緣深廣有為人益開近有對治益顯遠有第一義益具有四益所以召之)。",
    "X32n0616_005:0154c24_1": "△三下方涌出二初經家敘相二明問訊初中五初涌出二身相三住處四聞命五眷屬。",
    "X32n0616_005:0155a02_2": "今初。",
    "X32n0616_005:0155a03_0": "佛說是時娑婆世界三千大千國土地皆振裂而於其中有無量千萬億菩薩摩訶薩同時涌出。",
    "X32n0616_005:0155a05_0": "地覆本時眷屬如迹隱本今開迹顯本故裂地以表之。",
    "X32n0616_005:0155a06_1": "△二身相。",
    "X32n0616_005:0155a07_0": "是諸菩薩身皆金色三十二相無量光明。",
    "X32n0616_005:0155a08_0": "△三住處。",
    "X32n0616_005:0155a09_0": "先盡在此娑婆世界之下此界虗空中住。",
    "X32n0616_005:0155a10_0": "在此世界之下則不屬此世界此界虗空中住則不屬彼下界非此非彼即表中道常寂光土也常即常德寂即樂德光即淨我常即法身寂即解脫光即般若三德無不常樂我淨四德無非即空假中是為不縱不橫秘密之藏不即此界不離此界故以世界之下此界虗空表之住者以不住法住於秘藏也當知本有四德以為所依修得四德以為能依能所並有能依之身依於能所所依之土二義齊等方是毗盧遮那身土之相是故一人成佛時法界皆為此佛之依正一佛既爾當知一切諸佛亦復如是重重互徧重重互入重重互現重重互融又諸佛既爾當知一切菩薩之所分證亦復如是又諸佛菩薩滿分修德既爾當知一切眾生所有性德亦復如是無不互徧互入互現互融但迷悟攸分故即而常六然法性平等故六而常即所以阿鼻依正全處極聖之自心遮那身土不離下凡之一念也。",
    "X32n0616_005:0155b02_1": "△四聞命。",
    "X32n0616_005:0155b03_0": "是諸菩薩聞釋迦牟尼佛所說音聲從下發來。",
    "X32n0616_005:0155b04_0": "即是聞命故來弘法故來破執故來顯本故來也。",
    "X32n0616_005:0155b05_0": "△五眷屬。",
    "X32n0616_005:0155b06_0": "一一菩薩皆是大眾唱導之首各將六萬恒河沙眷屬況將五萬四萬三萬二萬一萬恒河沙等眷屬者(其數轉多)況復乃至一恒河沙半恒河沙四分之一乃至千萬億那由他分之一(其數轉多)況復千萬億那由他眷屬(其數轉多)況復億萬眷屬(其數轉多)況復千萬百萬乃至一萬(其數展轉倍多)況復一千一百乃至一十(其數展轉倍多)況復將五四三二一弟子者(其數展轉倍多)況復單己樂遠離行(其數展轉倍多)如是等比無量無邊算數譬喻所不能知。",
    "X32n0616_005:0155b14_0": "一一皆是導師之德能引眾人至於寶所當知一己非獨六萬恒沙眷屬非多也若約法門者一即一道清淨二即福智三即戒定慧四即四諦五即五眼六即六度一一度具十法界一一界各有十十即有百百即具千十善即有萬一度具萬六度即六萬法門多不為多一不為一非多非一而多而一初經家敘相竟。",
    "X32n0616_005:0155b20_1": "△二明問訊五初三業供養二陳問訊之辭三佛答安樂四偈頌隨喜五如來述歎初中三初正明供養二明所經時節三明佛神力加持。",
    "X32n0616_005:0155b23_2": "今初。",
    "X32n0616_005:0155b24_0": "是諸菩薩從地出已各詣虗空七寶妙塔多寶如來釋迦牟尼佛所到已向二世尊頭面禮足及至諸寶樹下師子座上佛所亦皆作禮右遶三帀合掌恭敬以諸菩薩種種讚法而以讚歎住在一面欣樂瞻仰於二世尊。",
    "X32n0616_005:0155c05_0": "作禮右遶是身業供養種種讚歎是口業供養欣樂瞻仰是意業供養以此不思議三業供不思議三身而為能感故佛以神力應之令諸大眾長時謂短即狹見廣也。",
    "X32n0616_005:0155c08_1": "△二明所經時節。",
    "X32n0616_005:0155c09_0": "是諸菩薩摩訶薩從初涌出以諸菩薩種種讚法而讚於佛如是時間經五十小劫是時釋迦牟尼佛默然而坐及諸四眾亦皆默然。",
    "X32n0616_005:0155c12_0": "種種讚法而讚於佛遂經五十小劫何止百千恒河沙偈故知梵文積至八里未足為多也問釋迦住世僅八十年說法四十九載相傳八年說法華經何得有此五十小劫答如維摩丈室得容三萬二千師子之座一一座高八萬四千由旬既橫論大小小可容大則豎論久暫暫豈不容久耶問若爾則是延半日以為五十小劫也何故下云佛神力故令諸大眾謂如半日答非延半日而為五十小劫乃納五十小劫于半日中亦猶遠將燈王國中大師子座而入丈室非變丈室為師子座也問時無實法長短本空何得戲論有納入耶答若約真諦則大小久暫悉皆平等若約俗諦則大小久暫仍自歷然若約迷情不知全俗即真故言俗之時則大自大小自小久自久暫自暫不相容攝言真之時則一味掃蕩若約諸佛菩薩了達真俗不二故不惟一事攝一切理而且一事攝一切事所以丈室容師子座師子座不小丈室不大則知半日容五十劫五十劫不促半日不延也又若論寂光實報境界則下方菩薩常面稱揚如來默然常受其讚盡未來時無有疲厭亦不休歇若論同居穢土機緣則住世八旬事須唱滅故令大眾謂如半日若論方便淨土機緣則已破三界見思未破無明別惑應見菩薩讚歎經五十劫是知即此靈山橫論四土眾生福薄見佛入滅是同居土相也五十小劫讚歎于佛儼然未散方便土相也於阿僧祇劫常在靈鷲山眾生見劫盡我此土安隱實報寂光土相也問若方便土菩薩讚歎五十小劫今猶未散則此後十三品經何從得有答佛之神力不可思議為彼示長為此示短三世互入亦無所在如安樂行人一夢尚可經于千萬億劫豈不能攝未來之事令入現在俾此土眾生得沾滅後流通益耶。",
    "X32n0616_005:0156a19_1": "△三明佛神力加持。",
    "X32n0616_005:0156a20_0": "五十小劫佛神力故令諸大眾謂如半日爾時四眾亦以佛神力故見諸菩薩徧滿無量百千萬億國土虗空。",
    "X32n0616_005:0156a23_0": "若約真諦則時劫本空今約俗諦則五十小劫是實故已破無明者知見五十小劫未破無明者不堪耐久由佛神力令其謂如半日不生疲倦也又諸菩薩徧滿無量國土虗空豈惟肉眼不能遠矚縱令天眼何可盡瞻而今四眾以佛神力則能徧見當知長而謂短由迷情未袪狹而見廣由妙機當發又長而謂短意表本為迹隱此迹須開狹而見廣意表迹含於本此本須顯又自佛眼觀則長短平等廣狹平等如理則非本非迹自四眼觀則解者見長見廣如知遠本惑者見短見狹如執近迹今迷長謂短亦云佛之神力是顯佛能隨情即狹見廣亦云佛之神力是顯佛能破情又壽量未談故長令見短下方已涌故狹令見廣夫見雨猛知龍大見華盛知池深見所化如此之多則知能化甚大久遠既開顯已眾豈終惑所以下文神力品中滿百千歲然後還攝舌相不復更云謂如半日也初三業供養竟。",
    "X32n0616_005:0156b15_1": "△二陳問訊之辭。",
    "X32n0616_005:0156b16_0": "是菩薩眾中有四導師一名上行二名無邊行三名淨行四名安立行是四菩薩於其眾中最為上首唱導之師在大眾前各共合掌觀釋迦牟尼佛而問訊言世尊少病少惱安樂行不所應度者受教易不不令世尊生疲勞耶爾時四大菩薩而說偈言。",
    "X32n0616_005:0156b21_0": "世尊安樂少病少惱教化眾生得無疲倦又諸眾生受化易不不令世尊生疲勞耶。",
    "X32n0616_005:0156b23_0": "初標四導師者欲擬開示悟入四十位耳如華嚴經但舉法慧德林金剛幢金剛藏說四十位也四皆名行者安樂行成也上行者開佛知見超于九界也無邊行者示佛知見一行一切行也淨行者悟佛知見事理融妙也安立行者入佛知見自安安他猶如大地也問辭有長文重頌各有二意一問如來安樂二問眾生易度安樂即自行易度即化他自行化他總不出于衣座室三衣座室三即安樂行前品用勗始行菩薩今地涌問佛亦不過云安樂行不而已故知圓行始終理同佛是究竟安樂行菩薩是分證安樂行前品是明觀行安樂行乃至一切眾生無非理即安樂行也。",
    "X32n0616_005:0156c10_1": "△三佛答安樂。",
    "X32n0616_005:0156c12_0": "爾時世尊於菩薩大眾中而作是言如是如是諸善男子如來安樂少病少惱諸眾生等易可化度無有疲勞所以者何是諸眾生世世已來常受我化亦於過去諸佛恭敬尊重種諸善根此諸眾生始見我身聞我所說即皆信受入如來慧除先修習學小乘者如是之人我今亦令得聞是經入於佛慧。",
    "X32n0616_005:0156c18_0": "佛答安樂易度兩事相成安樂故易度易度故安樂也所以者何下釋成易度之由由諸眾生世世受化故也然有二種一者種諸善根則始見我身聞說華嚴即皆信受入如來慧或聞方等般若亦入佛慧二者先修習小則漸漸調伏來至法華亦令聞經得入佛慧(方等般若小乘亦有密得入者但不彰灼故此不言)是知華嚴方等般若法華佛慧不殊不當優劣然佛慧雖同教相稍異且約華嚴法華對辨略明十異第一始見今見華嚴初成道時名為始見法華久後說實故名今見始見今見佛慧不殊也第二開合不開合華嚴日照高山即說於頓故不須開合為不入者開頓說漸展轉調伏令漸歸頓故法華為開已得合開合雖殊二頓無別也第三橫豎廣略華嚴頓直豎入入於法界故言豎廣不歷方便故言橫略法華備歷五味即是橫廣得入佛慧亦是豎廣然既入法界自當通達一切方便二經不殊也第四本迹不同華嚴以遮那為本千百億釋迦為迹法華以久成為本寂場為迹則華嚴之本秖是法華之迹又華嚴雖云或見如來初成道或見如來成道已無量劫意亦密顯于本而未彰灼明言成道久遠若斯是則非本非迹法界理同久本近迹隱顯事異也第五加說不加說華嚴唯阿僧祇及隨好品是佛自說餘皆菩薩被加而說法華迹門三周本門壽量等並佛自說雖加說自說理常平等而化儀有異也第六變土不變土華嚴即穢而淨表圓直大道故不須變法華轉穢為淨表會權歸實故須三變若變不變淨土不毀則無殊也第七多處不多處華嚴七處九會是為多處法華靈鷲虗空故不多處處雖多少理常平等也第八斥奪不斥奪華嚴初會永無聲聞故無斥奪法華正破小執故有斥奪又入法界品二乘如聾如瘂故有斥奪法華皆與佛記故無斥奪華嚴但被界外兩機如醫輕重兩種不死之病收功猶易法華能治定性聲聞如令敗種復生于芽收功更奇也第九直顯開顯華嚴行大直道名直顯實法華決了聲聞法名開權顯實所顯之實終無二也第十根利根鈍利者華嚴即悟鈍者法華方悟利鈍雖殊悟理則一能令鈍悟功亦倍難也經宜不同略為十異種智法界等無差別故云始見我身聞我所說即皆信受入如來慧除先修習學小乘者我今亦令得聞是經入於佛慧明文在茲不須疑也諸師見其緣異逐緣異解迷不知反去道轉遠若識理同千車共轍佛慧無殊也然華嚴兼別以明佛慧方等對三以明佛慧般若帶二以明佛慧唯有法華開彼所兼所對所帶乃至三藏但生滅法咸成佛慧是則所詮圓理彼此無殊能詮之教純雜有異獨稱為妙良不虗也舊云華嚴了義滿字常住法華不了義非滿非常今以此文並之若始入是了義今入不了義者亦應始入是佛慧今入非佛慧若佛慧既齊則了義亦等滿常亦然又地人呼華嚴為圓宗法華為不真宗今亦用此文並之。",
    "X32n0616_005:0157b21_1": "△四偈頌隨喜。",
    "X32n0616_005:0157b22_0": "爾時諸大菩薩而說偈言。",
    "X32n0616_005:0157b23_0": "善哉善哉大雄世尊諸眾生等易可化度能問諸佛甚深智慧聞已信行我等隨喜。",
    "X32n0616_005:0157c01_0": "能問者如華嚴方等般若經中俱有當機問法菩薩乃至法華經中身子三請俱是能問也所問者即甚深智慧所謂如來慧也。",
    "X32n0616_005:0157c03_1": "△五如來述歎。",
    "X32n0616_005:0157c04_0": "於時世尊讚歎上首諸大菩薩善哉善哉善男子汝等能於如來發隨喜心。",
    "X32n0616_005:0157c06_0": "菩薩隨喜能問能信之人佛乃歎其能於如來發隨喜心意顯諸能問者皆是古佛示迹故菩薩隨喜其迹如來述歎其本亦是密顯壽量也初涌出序竟。",
    "X32n0616_005:0157c09_1": "△二疑問序二初此土菩薩疑問二他土菩薩疑問初中二初長文敘疑念二偈頌正發問。",
    "X32n0616_005:0157c11_0": "今初。",
    "X32n0616_005:0157c12_0": "爾時彌勒菩薩及八千恒河沙諸菩薩眾皆作是念我等從昔已來不見不聞如是大菩薩摩訶薩眾從地涌出住世尊前合掌供養問訊如來。",
    "X32n0616_005:0157c15_0": "彌勒及菩薩眾咸疑念者凡有四意一者自寂場以後今座以前十方大士來會不絕雖不可限我以補處智力悉見悉知何於此眾不識一人又我遊化十方奉覲諸佛一切海會咸所諳知就歷履處亦所不識若來若去推求不識不識則無世界益故須疑問二者彼諸大士是前進先達彌勒是後番末學後不知前例如文殊不知入定女人境界女人不知棄諸陰蓋菩薩境界以不識故不知彼之內善自善不生無為人益故須疑問三者彼等大士本實相底應現十方別頭教化所有真應皆非彌勒境界既不識彼利物之道即不識病無對治益故須疑問四者佛託弘經召諸大士大士奉師嚴命故來密開壽量非時眾之所知既不識如來密旨則無第一義益故須疑問也然彌勒迹居補處本亦應深何當如此不識凡有二義若約實論則近成補處不知久本若約權論則本高迹下為物騰疑也。",
    "X32n0616_005:0158a07_1": "△二偈頌正發問四初問來處來緣(至)四結請決疑。",
    "X32n0616_005:0158a08_2": "今初。",
    "X32n0616_005:0158a09_0": "時彌勒菩薩摩訶薩知八千恒河沙諸菩薩等心之所念并欲自決所疑合掌向佛以偈問曰。",
    "X32n0616_005:0158a11_0": "無量千萬億大眾諸菩薩昔所未曾見願兩足尊說是從何所來以何因緣集巨身大神通智慧叵思議其志念堅固有大忍辱力眾生所樂見為從何所來。",
    "X32n0616_005:0158a14_0": "一問何處來二問何因緣來也巨身大神通是歎入如來室智慧叵思議是歎坐如來座其志念堅固有大忍辱力是歎著如來衣三皆自行德也眾生所樂見是歎化他德也。",
    "X32n0616_005:0158a17_1": "△二敘眷屬數量。",
    "X32n0616_005:0158a18_0": "一一諸菩薩所將諸眷屬其數無有量如恒河沙等或有大菩薩將六萬恒沙如是諸大眾一心求佛道是諸大師等六萬恒河沙俱來供養佛及護持是經將五萬恒沙其數過於是四萬及三萬二萬至一萬一千一百等乃至一恒沙半及三四分億萬分之一千萬那由他萬億諸弟子乃至於半億其數復過上百萬至一萬一千及一百五十與一十乃至三二一單己無眷屬樂於獨處者俱來至佛所其數轉過上如是諸大眾若人行籌數過於恒沙劫猶不能盡知。",
    "X32n0616_005:0158b03_0": "△三問師法是誰。",
    "X32n0616_005:0158b04_0": "是諸大威德精進菩薩眾誰為其說法教化而成就從誰初發心稱揚何佛法受持行誰經修習何佛道。",
    "X32n0616_005:0158b06_0": "△四結請決疑又四初結歎(至)四明大會同請。",
    "X32n0616_005:0158b07_0": "今初。",
    "X32n0616_005:0158b08_0": "如是諸菩薩神通大智力。",
    "X32n0616_005:0158b09_0": "△二請答來處。",
    "X32n0616_005:0158b10_0": "四方地振裂皆從中涌出世尊我昔來未曾見是事願說其所從國土之名號我常遊諸國未曾見是眾我於此眾中乃不識一人。",
    "X32n0616_005:0158b13_0": "△三請答來緣。",
    "X32n0616_005:0158b14_0": "忽然從地出願說其因緣。",
    "X32n0616_005:0158b15_0": "△四明大會同請。",
    "X32n0616_005:0158b16_0": "今此之大會無量百千億是諸菩薩等皆欲知此事是諸菩薩眾本末之因緣無量德世尊唯願決眾疑。",
    "X32n0616_005:0158b18_0": "既云欲知本末因緣則若所師若來處若來緣總求佛答明矣初此土菩薩疑問竟。",
    "X32n0616_005:0158b19_1": "△二他土菩薩疑問。",
    "X32n0616_005:0158b21_0": "爾時釋迦牟尼分身諸佛從無量千萬億他方國土來者在於八方諸寶樹下師子座上結加趺坐其佛侍者各各見是菩薩大眾於三千大千世界四方從地涌出住於虗空各白其佛言世尊此諸無量無邊阿僧祇菩薩大眾從何所來爾時諸佛各告侍者諸善男子且待須臾有菩薩摩訶薩名曰彌勒釋迦牟尼佛之所授記次當作佛已問斯事佛今答之汝等自當因是得聞。",
    "X32n0616_005:0158c05_0": "分身眷屬橫在十方亦復不知本地未有四益故與彌勒同其疑問諸佛皆不為答抑待釋迦答彌勒者彌勒所問事迹不輕釋尊一代未曾顯說因茲答問廣顯長壽此大玄秘須待釋迦自開汝自當聞分身來集本為證明故不應答也初本門序段竟。",
    "X32n0616_005:0158c10_1": "△二正說段二初誡許二正說初中二初長文二偈頌長文又三初述歎二誡三許。",
    "X32n0616_005:0158c11_2": "今初。",
    "X32n0616_005:0158c12_0": "爾時釋迦牟尼佛告彌勒菩薩善哉善哉阿逸多乃能問佛如是大事。",
    "X32n0616_005:0158c14_0": "初一善哉述其上契佛心次一善哉述其下契羣念開迹顯本乃一代時教所未顯談故為佛之大事又須約修德果位深遠不約性德平等理趣故名為事也。",
    "X32n0616_005:0158c17_1": "△二誡。",
    "X32n0616_005:0158c18_0": "汝等當共一心被精進鎧發堅固意。",
    "X32n0616_005:0158c19_0": "一心誡勿亂精進誡勿懈堅固誡勿退也良以如來實智久成權迹長遠化窮三世益徧十方非等覺已下所能思議故也亦是寄彌勒以誡大會。",
    "X32n0616_005:0158c21_1": "△三許。",
    "X32n0616_005:0158c23_0": "如來今欲顯發宣示諸佛智慧諸佛自在神通之力諸佛師子奮迅之力諸佛威猛大勢之力。",
    "X32n0616_005:0159a01_0": "諸佛智慧總標果智也自在是我德神通是樂德奮迅除垢是淨德大勢威猛是常德此點圓滿四德徧能三世益物故皆名力約過去久遠久遠名為自在神通約現在分身徧滿十方名為師子奮迅約未來益物永永不窮名為大勢威猛或可奮迅是將前之狀表未來益物大勢是震動十方即現在益物亦無不可又自在神通是究竟慈悲室師子奮迅是究竟法空座威猛大勢是究竟忍辱衣證此究竟三德故力徧十方三世為益不窮也初長文竟。",
    "X32n0616_005:0159a10_1": "△二偈頌三初頌誡二頌許略不顯述歎。",
    "X32n0616_005:0159a11_2": "今初。",
    "X32n0616_005:0159a12_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0159a13_0": "當精進一心我欲說此事勿得有疑悔。",
    "X32n0616_005:0159a14_0": "△二頌許。",
    "X32n0616_005:0159a15_0": "佛智叵思議汝今出信力住於忍善中昔所未聞法今皆當得聞我今安慰汝勿得懷疑懼佛無不實語智慧不可量所得第一法甚深叵分別如是今當說汝等一心聽。",
    "X32n0616_005:0159a19_0": "初誡許竟。",
    "X32n0616_005:0159a19_1": "△二正說三初從此訖壽量品是正開近顯遠二分別功德品初長文是總授法身記三彌勒說偈是總申領解初中二初訖此品是略開顯動執生疑二壽量品是廣開顯斷疑生信初又二初略開二疑請初又二初長文二偈頌初又二初答所師二答來處不答何因緣集所以下文重請。",
    "X32n0616_005:0159b01_2": "今初。",
    "X32n0616_005:0159b02_0": "爾時世尊說此偈已告彌勒菩薩我今於此大眾宣告汝等阿逸多是諸大菩薩摩訶薩無量無數阿僧祇從地涌出汝等昔所未見者我於是娑婆世界得阿耨多羅三藐三菩提已教化示導是諸菩薩調伏其心令發道意。",
    "X32n0616_005:0159b07_0": "此先答誰為其說法教化而成就從誰初發心之問也。",
    "X32n0616_005:0159b08_1": "△二答來處又二初答二釋。",
    "X32n0616_005:0159b08_2": "今初。",
    "X32n0616_005:0159b09_0": "此諸菩薩皆於是娑婆世界之下此界虗空中住於諸經典讀誦通利思惟分別正憶念。",
    "X32n0616_005:0159b11_0": "界下空中略如前釋此答其住處即是來處也於諸經典等者追答稱揚何佛法受持行誰經修習何佛道之問也於諸經典者圓人受法無法不圓法華妙典一切十方三世經典悉入其中權實不二終不取一捨一此答稱揚也讀誦通利思惟分別是答受持正憶念是答修習。",
    "X32n0616_005:0159b16_1": "△二釋又二初釋住處二釋稱揚受持修習。",
    "X32n0616_005:0159b17_2": "今初。",
    "X32n0616_005:0159b18_0": "阿逸多是諸善男子等不樂在眾多有所說常樂靜處勤行精進未曾休息亦不依止人天而住。",
    "X32n0616_005:0159b20_0": "不樂在眾者界內界外五陰名之為眾二邊分別名為多有所說靜處者中道第一義諦也法界一相絕待無餘故名靜處勤行精進未曾休息者心心流注任運與薩婆若相應也不依人天者人表有邊天表空表不依二邊故以此界虗空表之正住常寂光法性土也。",
    "X32n0616_005:0159c01_1": "△二釋稱揚受持修習。",
    "X32n0616_005:0159c02_0": "常樂深智無有障礙亦常樂於諸佛之法一心精進求無上慧。",
    "X32n0616_005:0159c04_0": "由其常樂深智無有障礙所以於諸經典悉皆稱揚由其常樂諸佛之法所以讀誦通利思惟分別由其一心精進求無上慧所以能正憶念也初長文竟。",
    "X32n0616_005:0159c07_1": "△二偈頌二初頌長文二正略開顯初中二初頌答所師二頌答來處。",
    "X32n0616_005:0159c08_2": "今初。",
    "X32n0616_005:0159c09_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0159c10_0": "阿逸汝當知是諸大菩薩從無數劫來修習佛智慧悉是我所化令發大道心此等是我子。",
    "X32n0616_005:0159c12_0": "長文但云得菩提已化令發心不云無數劫來或謂止是圓頓利根一生超證此中但云無數劫來是我所化不云在成道後或謂止是行因行時化令發心故為但答所師未曾彰灼開顯。",
    "X32n0616_005:0159c15_1": "△二頌答來處。",
    "X32n0616_005:0159c17_0": "依止是世界常行頭陀事志樂於靜處捨大眾憒鬧不樂多所說如是諸子等學習我道法晝夜常精進為求佛道故在娑婆世界下方空中住志念力堅固常勤求智慧說種種妙法其心無所畏。",
    "X32n0616_005:0159c21_0": "初頌長文竟。",
    "X32n0616_005:0159c21_1": "△二正略開顯。",
    "X32n0616_005:0159c22_0": "我於伽耶城菩提樹下坐得成最正覺轉無上法輪爾乃教化之令初發道心今皆住不退悉當得成佛我今說實語汝等一心信我從久遠來教化是等眾。",
    "X32n0616_005:0160a01_0": "既云成道之後令初發心又云從久遠來教化是等乃是略開近而顯遠所以動執生疑也初略開竟。",
    "X32n0616_005:0160a03_1": "△二疑請二初長文二偈頌初中二初經家敘疑二騰疑請答。",
    "X32n0616_005:0160a04_2": "今初。",
    "X32n0616_005:0160a05_0": "爾時彌勒菩薩摩訶薩及無數諸菩薩等心生疑惑怪未曾有而作是念云何世尊於少時間教化如是無量無邊阿僧祇諸大菩薩令住阿耨多羅三藐三菩提。",
    "X32n0616_005:0160a09_0": "△二騰疑請答二初騰疑二請答初中三初法說二立譬三法合初又三初執近疑遠二執遠疑近三結難信。",
    "X32n0616_005:0160a11_1": "今初。",
    "X32n0616_005:0160a12_0": "即白佛言世尊如來為太子時出於釋宮去伽耶城不遠坐於道場得成阿耨多羅三藐三菩提從是已來始過四十餘年世尊云何於此少時大作佛事以佛勢力以佛功德教化如是無量大菩薩眾當成阿耨多羅三藐三菩提。",
    "X32n0616_005:0160a17_0": "△二執遠疑近。",
    "X32n0616_005:0160a18_0": "世尊此大菩薩眾假使有人於千萬億劫數不能盡不得其邊斯等久遠已來於無量無邊諸佛所植諸善根成就菩薩道常修梵行。",
    "X32n0616_005:0160a21_0": "△三結難信。",
    "X32n0616_005:0160a22_0": "世尊如此之事世所難信。",
    "X32n0616_005:0160a23_0": "初法說竟。",
    "X32n0616_005:0160a23_1": "△二立譬。",
    "X32n0616_005:0160a24_0": "譬如有人色美髮黑年二十五指百歲人言是我子。",
    "X32n0616_005:0160b01_0": "此譬上執近而疑遠也色美髮黑總是明年少耳。",
    "X32n0616_005:0160b02_0": "其百歲人亦指年少言是我父生育我等。",
    "X32n0616_005:0160b03_0": "此譬上執遠而疑近也。",
    "X32n0616_005:0160b04_0": "是事難信。",
    "X32n0616_005:0160b05_0": "此譬結難信也。",
    "X32n0616_005:0160b05_1": "△三法合。",
    "X32n0616_005:0160b06_0": "佛亦如是得道已來其量未久。",
    "X32n0616_005:0160b07_0": "此合年二十五不應有百歲子也。",
    "X32n0616_005:0160b08_0": "而此大眾諸菩薩等已於無量千萬億劫為佛道故勤行精進善入出住無量百千萬億三昧得大神通久修梵行善能次第習諸善法巧於問答人中之寶一切世間甚為希有。",
    "X32n0616_005:0160b12_0": "此合百歲之人不應是年二十五者所生也。",
    "X32n0616_005:0160b13_0": "今日世尊方云得佛道時初令發心教化示導令向阿耨多羅三藐三菩提世尊得佛未久乃能作此大功德事。",
    "X32n0616_005:0160b16_0": "此合結難信也初騰疑竟。",
    "X32n0616_005:0160b16_1": "△二請答又二初明請意二正請答初又二初為現在二為未來。",
    "X32n0616_005:0160b17_2": "今初。",
    "X32n0616_005:0160b18_0": "我等雖復信佛隨宜所說佛所出言未曾虗妄佛所知者皆悉通達。",
    "X32n0616_005:0160b20_0": "我等雖未了知仰信而已。",
    "X32n0616_005:0160b20_1": "△二為未來。",
    "X32n0616_005:0160b21_0": "然諸新發意菩薩於佛滅後若聞是語或不信受而起破法罪業因緣。",
    "X32n0616_005:0160b23_0": "淺行易生誹謗謗墮惡道不退者雖復仰信以未了知不能增道損生故須答釋令謗者生信信者增道損生也初明請意竟。",
    "X32n0616_005:0160c01_1": "△二正請答。",
    "X32n0616_005:0160c02_0": "唯然世尊願為解說除我等疑及未來世諸善男子聞此事已亦不生疑。",
    "X32n0616_005:0160c04_0": "一請除現在疑二請除未來疑也初長文竟。",
    "X32n0616_005:0160c04_1": "△二偈頌二初頌騰疑二頌請答初中二初頌法說二頌立譬三頌法合初又三初頌執近二頌執遠三頌結難信。",
    "X32n0616_005:0160c07_2": "今初。",
    "X32n0616_005:0160c08_0": "爾時彌勒菩薩欲重宣此義而說偈言。",
    "X32n0616_005:0160c09_0": "佛昔從釋種出家近伽耶坐於菩提樹爾來尚未久。",
    "X32n0616_005:0160c10_0": "△二頌執遠。",
    "X32n0616_005:0160c11_0": "此諸佛子等其數不可量久已行佛道住於神通力善學菩薩道不染世間法如蓮華在水從地而涌出皆起恭敬心住於世尊前。",
    "X32n0616_005:0160c14_0": "△三頌結難信。",
    "X32n0616_005:0160c15_0": "是事難思議云何而可信佛得道甚近所成就甚多願為除眾疑如實分別說。",
    "X32n0616_005:0160c17_0": "初頌法說竟。",
    "X32n0616_005:0160c17_1": "△二頌立譬。",
    "X32n0616_005:0160c18_0": "譬如少壯人年始二十五示人百歲子髮白而面皺是等我所生子亦說是父父少而子老舉世所不信。",
    "X32n0616_005:0160c20_0": "初五句頌譬執近疑遠次一句頌譬執遠疑近後二句頌譬結難信也。",
    "X32n0616_005:0160c21_1": "△三頌法合。",
    "X32n0616_005:0160c22_0": "世尊亦如是得道來甚近是諸菩薩等志固無怯弱從無量劫來而行菩薩道巧於難問答其心無所畏忍辱心決定端正有威德十方佛所讚善能分別說不樂在人眾常好在禪定為求佛道故於下空中住。",
    "X32n0616_005:0161a02_0": "初半偈頌合年二十五次三偈半頌合百歲子略不頌合結難信也初頌騰疑竟。",
    "X32n0616_005:0161a03_1": "△二頌請答。",
    "X32n0616_005:0161a04_0": "我等從佛聞於此事無疑願佛為未來演說令開解若有於此經生疑不信者即當墮惡道願今為解說是無量菩薩云何於少時教化令發心而住不退地。",
    "X32n0616_005:0161a07_0": "初略開顯動執生疑竟。",
    "X32n0616_005:0161a08_0": "△釋從地涌出品竟次釋壽量品。",
    "X32n0616_005:0161a09_0": "如來壽量品第十六",
    "X32n0616_005:0161a10_0": "如來者十方三世諸佛二佛三佛本佛迹佛之通號也壽者受也量者詮量也詮量十方三世二佛三佛本佛迹佛之功德也今正詮量本地三佛功德故言如來壽量品如來義甚多今且明二身三身餘例可解二身者真身如來應身如來也如成論云乘如實道來成正覺故名如來即二身義顯何者乘是如智實是如境道是因覺是果若單論乘則如無所知若單明實則如無能知境智和合則有因果照境未窮名因盡源為果因圓果滿即是乘如實道來成正覺此真身如來也以如實智乘如實道來生三有示正成覺即應身如來也(報智冥法名為真身從體起用名為應身但云二身攝法周足)三身者法身如來報身如來化身如來也如大論云如法相解如法相說故名如來即三身義足何者如即法如如境非因非果有佛無佛性相常然徧一切處而無有異故名為如不動而至名之為來此約所證即法身如來也又復如智稱於如理從理名如從智名來故曰如法相解此約能證即報身如來也又以如如境智合故即能處處示成正覺轉正法輪故曰如法相說此約起用即化身如來也偈云水銀和真金能塗諸色像功德和法身處處應現往如明月之影徧萬川故名為應亦名為化此之三身不可單取故大經云法身亦非涅槃般若亦非涅槃解脫亦非涅槃三法具足稱秘密藏名大涅槃當知三身不可一異縱橫並別圓覽三法稱假名如來也文云非如非異者非彼偏如以顯圓如即法身如來義又云如來如實知見三界之相即如如智稱如如境以一切種智知以佛眼見是報身如來義又云或示己身己事或示他身他事即應身如來義若但性德三如來者是橫若但修德三如來者是縱若先法次報後應亦是縱今經圓說不縱不橫三如來也縱橫三身尚非今義況三藏通教所明如來耶又法華前亦明圓三身義同是迹中三身耳發迹顯本三如來者永異諸經故天親論云示現成大菩提無上故示三種菩提一應化菩提隨所應現即為示現如經出釋氏宮故二報佛菩提十地滿足得常涅槃如經我實成佛已來無量無邊劫故三法佛菩提謂如來藏性淨涅槃不變如經如來如實知見三界之相故經具其義論出其名不如上釋寧會經論耶又三身各論單複單義如前法身複者一自性清淨法身二離垢妙極法身報身複者一自受用報二他受用報應身複者一勝應二劣應又一應現佛界身二應現九界身若束此單複三身而為二身則二種法身及自受用報名為真身他受用報及勝劣應等名為應身故知若複若單若三若二平等平等更欲廣說則四身十身三十二身無量身等開合自在多不為多少不為少非少非多而少而多倘執名相而欲妄較諸經優劣遠之遠矣次明壽量者真如不隔諸法故名為受此法身壽也境智相應故名為受此報身壽也一期示現連持不斷故名為受此應身壽也詮量法身如來如理壽命詮量報身如來智慧壽命詮量應身如來同緣壽命故言壽量法身如來如理壽命者有佛無佛性相常然不論相應不論連持非無量非有量故文云非如非異非實非虗蓋詮量法身如理命也報身如來智慧壽命者以如如智契如如境境發智為報智冥境為受境既無量無邊常住不滅智亦如是譬如函大蓋大故文云我智力如是久修業所得慧光照無量壽命無數劫此詮報身智慧命也應身如來同緣壽命者緣長則長緣促則促如水清月現月實不來水濁月亡月亦不去故文云數數現生數數現滅或復自說名字不同年紀大小此詮應身同緣命也當知所詮不出四句一者有量二者無量三者亦有量亦無量四者非有量非無量有量則無常無量則常雙亦則亦常亦無常雙非則非常非無常今以四句更作別圓二釋一別教各釋者非常非無常雙非理極即法身也常即報身報智冥法亦非常非無常但取金剛道後正智圓滿不復生滅故名為常又依唯識則法身不生不滅故名為常報身生因所生故非常圓滿成就故非無常即雙非句也亦常亦無常即是應身應用無盡故亦常數數唱滅故亦無常也無常即是金剛心前智用增進乃至凡夫生滅出沒皆是無常也三佛各一句凡夫共一句故是別義二圓教通釋者三身各備四句法身四句者不生不滅故名為常無彼凡夫妄計倒常故名無常寂而雙照故名亦常亦無常雙破凡聖八倒故名非常非無常也報身四句者出過二乘故名為常無妄計常故名無常智能雙照故名亦常亦無常智冥諦境故名非常非無常也應身四句者應用不絕故名為常示同生滅故名無常兩義雙具故名亦常亦無常既非實報亦非業感故名非常非無常也乃至凡夫亦具三種四句心性隨緣不變故名為常所謂自從無始至盡未來輪迴生死而生實不生死實不死此是性具法身常也即此心性不變隨緣流轉五道生滅不停名為無常此是法身無常義也隨緣不變故亦常不變隨緣故亦無常此是法身雙亦義也雖不變而非凝然雖隨緣而非斷滅此是法身雙非義也約性具法身既得作此四句依法身而起惑惑即般若即是性具報身亦作四句依惑苦而起業業即解脫即是性具應身亦作四句是為凡夫理即三身各各四句尚無四句名字何況行用圓人稱理而解故有名字三身四句觀行三身四句乃至果成則為究竟三身四句從始至終一身即三身三身即一身不一不異亦不縱橫當知一佛身即具諸身壽命功德隨緣感見長短不同大經云凡夫二乘見佛壽命猶如冬日菩薩所見猶如春日唯佛見佛壽命無量猶如夏日所以然者凡夫博地翳障朦朧藏通二乘雖斷四住不見中道若捨分段受法性身未破無明方便土中所見之佛猶是勝應當知二乘秖見冬日若諸菩薩未登別地圓住所見同彼凡夫二乘若破無明乃至受于分證法身與而言之得見報身壽命奪而言之他受用報猶名勝應未窮報身之源未盡法性之極所見佛壽猶是春日唯佛與佛窮性盡源見法身壽猶如夏日也故舉三譬譬之一者於諸常中虗空第一一切壽命如來第一此譬法身壽命無始無終性相凝湛也二者譬如四河皆歸大海此譬報身壽命所修萬善皆感佛報歸壽命海也三者阿耨達池出四大河此譬應身壽命從法報出隨緣長短也此品詮量通明三身若從別意正在報身何以故義便文會義便者報身智慧上冥下契三身宛足文會者我成佛來甚大久遠故能三世利益眾生所成即法身能成即報身法報合故能益物以此推之正意是論報身佛功德也如是三身種種功德悉是過去久遠久遠劫前道場樹下先所成就名之為本中間今日寂滅道場所成就者名之為迹非本無以垂迹非迹無以顯本本迹雖殊不思議一也若諸經所說本迹則以寂場所成法報為本從本所起勝劣兩應為迹今以寂場所成三身乃至無量劫來中間所成三身皆名為迹獨取最初實得菩提所成三身名之為本故與諸經異也。",
    "X32n0616_005:0162c13_1": "△二廣開顯斷疑生信為二初誡信二正答初中四初三誡二三請三重請四重誡共為四請四誡并前迹門三請一誡合有五誡七請奇特大事殷勤鄭重也。",
    "X32n0616_005:0162c16_2": "今初三誡。",
    "X32n0616_005:0162c18_0": "爾時佛告諸菩薩及一切大眾諸善男子汝等當信解如來誠諦之語復告大眾汝等當信解如來誠諦之語又復告諸大眾汝等當信解如來誠諦之語。",
    "X32n0616_005:0162c21_0": "誠是忠誠諦是審實不欺於物言則詣真昔由機淺止可隨他意語故方便施權說三說近未告誠實今是隨自意語故言誠諦也。",
    "X32n0616_005:0162c23_1": "△二三請。",
    "X32n0616_005:0162c24_0": "是時菩薩大眾彌勒為首合掌白佛言世尊惟願說之我等當信受佛語如是三白已。",
    "X32n0616_005:0163a02_0": "菩薩既秉誠誡不敢致疑說必信受也。",
    "X32n0616_005:0163a02_1": "△三重請。",
    "X32n0616_005:0163a03_0": "復言惟願說之我等當信受佛語。",
    "X32n0616_005:0163a04_0": "△四重誡。",
    "X32n0616_005:0163a05_0": "爾時世尊知諸菩薩三請不止而告之言汝等諦聽。",
    "X32n0616_005:0163a06_0": "初誡信竟。",
    "X32n0616_005:0163a06_1": "△二正答二初長文二偈頌初中二初正開近顯遠二明三世益物初又二初出執近之情二破近顯遠。",
    "X32n0616_005:0163a08_2": "今初。",
    "X32n0616_005:0163a09_0": "如來秘密神通之力一切世間天人及阿修羅皆謂今釋迦牟尼佛出釋氏宮去伽耶城不遠坐於道場得阿耨多羅三藐三菩提。",
    "X32n0616_005:0163a12_0": "此文三意初云如來秘密神通之力是出所迷之法二云一切世間天人及阿修羅是出能迷之眾三云皆謂今釋迦等是出其迷遠之情謂也秘密者一身即三身名為秘三身即一身名為密又昔所不說名為秘唯佛自知名為密神通之力者三身之用也神是天然不動之理即法性身通是無壅不思議慧即果報身力是幹用自在即應化身也佛於三世等有三身實得三身其來甚久於諸教中秘而不說故一切世間天人阿修羅皆謂今佛始於道樹得此三身乃執近以疑遠也此本說中不復言及二乘二乘開已皆名菩薩故但對菩薩菩薩攝在天人修羅三善道內餘三惡趣罪重根鈍少智并不知作此情謂也菩薩有三種下方他方舊住下方即本日所化故無執近之謂他方舊住俱有二種一從法身應生者往世先得無生或先已聞發迹顯本設往世未曾得聞往世報盡受法性身於法身地自應得聞長遠之說是故應生菩薩多無執近之謂二者今生始得無生法忍及未得者咸有此謂也。",
    "X32n0616_005:0163b06_1": "△二破近顯遠上文誠諦之誡正為此復為二初正顯遠二舉譬格量久遠。",
    "X32n0616_005:0163b08_0": "今初。",
    "X32n0616_005:0163b09_0": "然善男子我實成佛已來無量無邊百千萬億那由他劫。",
    "X32n0616_005:0163b11_0": "成佛甚大久遠則伽耶近謂即破。",
    "X32n0616_005:0163b11_1": "△二舉譬格量久遠又三初舉譬問二答三合顯久遠。",
    "X32n0616_005:0163b12_2": "今初。",
    "X32n0616_005:0163b13_0": "譬如五百千萬億那由他阿僧祇三千大千世界假使有人抹為微塵過於東方五百千萬億那由他阿僧祇國乃下一塵如是東行盡是微塵諸善男子於意云何是諸世界可得思惟校計知其數不。",
    "X32n0616_005:0163b17_0": "直爾下塵之界尚不可說況下塵不下塵界豈可說耶。",
    "X32n0616_005:0163b18_1": "△二答。",
    "X32n0616_005:0163b19_0": "彌勒菩薩等俱白佛言世尊是諸世界無量無邊非算數所知亦非心力所及一切聲聞辟支佛以無漏智不能思惟知其限數我等住阿惟越致地於是事中亦所不達世尊如是世界無量無邊。",
    "X32n0616_005:0163b23_0": "一非算數心力所及二非無漏智所思惟三非阿惟越致所達蓋惟佛智之所知耳故佛功德如十方大地土十地功德如閻浮地土非虗語也。",
    "X32n0616_005:0163c01_1": "△三合顯久遠。",
    "X32n0616_005:0163c03_0": "爾時佛告大菩薩眾諸善男子今當分明宣語汝等是諸世界若著微塵及不著者盡以為塵一塵一劫我成佛已來復過於此百千萬億那由他阿僧祇劫。",
    "X32n0616_005:0163c06_0": "下塵不下塵界已不可說況界復為塵耶況復過於此耶僧傳云羅什舊經無一塵一劫四字有齊高僧曇副誦經感夢云少一句後果得之金光明經云一切海水可知滴數無有能知如來之壽此亦明未來常住非明過去久成也若引證此殊不相應又有約法身解此者則有二迷一法身無始豈論遠劫二法身平等何獨釋迦先成故知不達經宗求深反淺問一切諸佛悉顯本不若有顯有不顯則不得云諸佛道同亦不得云是我方便諸佛亦然若同皆顯本則諸佛皆云成佛甚久遠耶答顯本可同遠近不等例如日月燈明八子大通智勝有十六子釋迦一子有子是同數不必等又凡成佛則所證三身必同故云諸佛道同三世益物必同故云是我方便諸佛亦然耳況本高迹下本下迹高本迹俱高本迹俱下凡有四句一期開顯何必盡同惟原始要終則諸佛所證之體同滿三身所起之用同亘三世故不可說有異也初正開近顯遠竟。",
    "X32n0616_005:0163c23_1": "△二明三世益物此以最初成道為體為本從體起用為迹又以最初實得體用為本從是以來所有三世體用皆為迹也文分為二初法說二譬說初中二初正明三世益物二總結不虗初又三初明過去益物二明現在益物三明未來益物初又三初過去益物處二拂過去迹疑三明過去益物所宜。",
    "X32n0616_005:0164a05_2": "今初。",
    "X32n0616_005:0164a06_0": "自從是來我常在此娑婆世界說法教化亦於餘處百千萬億那由他阿僧祇國導利眾生。",
    "X32n0616_005:0164a08_0": "須顯處者上明成道甚久久居何處故云常在此界及於餘國說法利生也此之娑婆即本應身所居之土今日迹居不移於本但今昔時異見燒者謂近照本者達遠故云我淨土不毀常在靈鷲山豈離伽耶別求常寂非寂光外別有娑婆。",
    "X32n0616_005:0164a12_1": "△二拂過去迹疑。",
    "X32n0616_005:0164a14_0": "諸善男子於是中間我說然燈佛等又復言其入於涅槃如是皆以方便分別。",
    "X32n0616_005:0164a16_0": "疑曰若成佛如此之久云何經中說於然燈佛時方得授記又既成佛證常住身云何儒童菩薩在然燈時得記弘法壽終入滅更生餘處諸如此類不一而足今拂之曰皆是方便分別譬如幻師所現幻事非實爾時方得授記亦非業果分段生身捨壽入滅皆是從本所垂諸化迹耳。",
    "X32n0616_005:0164a21_1": "△三明過去益物所宜又二初感應二施化。",
    "X32n0616_005:0164a22_2": "今初。",
    "X32n0616_005:0164a23_0": "諸善男子若有眾生來至我所我以佛眼觀其信等諸根利鈍隨所應度。",
    "X32n0616_005:0164b01_0": "至我所者即是過去眾生漸頓兩機冥扣法身也佛眼觀者即是久已成佛用佛眼鑑照無有遺差將欲起於劣勝兩應而利益之善機凡有二力一感人天華報及三乘權果二感佛道實果若以法眼觀知萬善緣其輕重各得華報及權果報不能究竟知其終得種智果報若以佛眼圓照萬善則能具知始末華果此經一向明佛眼觀能知眾生所有萬善究竟得佛種智果也信等諸根即五根也慧根是了因信進念定四根皆屬緣因此二善根各有利鈍通攝頓漸機緣頓機利鈍即圓別根機漸機利鈍即通藏根機又大乘根名利小乘根名鈍又小乘根名利人天乘名鈍又四教乃至人天諸根各各自論利鈍十法界眾生所有善根利鈍為機如來悉照無有遺差隨所應度而現形聲饒益也。",
    "X32n0616_005:0164b15_1": "△二施化又二初明形聲兩益二明得益歡喜。",
    "X32n0616_005:0164b16_2": "今初。",
    "X32n0616_005:0164b17_0": "處處自說名字不同年紀大小亦復現言當入涅槃又以種種方便說微妙法。",
    "X32n0616_005:0164b19_0": "名字不同年紀大小即非生現生當入涅槃即非滅現滅皆形益也方便說法即聲益也處處者豎則微塵劫數橫則十方剎海一一劫中皆徧十方一一剎中皆歷塵劫無非如來垂迹之時處也名字不同者或示勝應或示劣應或示佛身或示菩薩聲聞等身身既不同故名字亦不同也年紀大小者既示有身則有壽命修短不等也應以現生而得度者既能處處非生現生應以現滅而得度者亦必處處非滅現滅故云亦復現言當入涅槃也種種方便說微妙法者或頓或漸或顯或密或定不定或兼或但或對或帶或施或開或廢或立總是如來善巧方便總令眾生究竟得成一切種智故微妙也。",
    "X32n0616_005:0164c07_1": "△二明得益歡喜。",
    "X32n0616_005:0164c08_0": "能令眾生發歡喜心。",
    "X32n0616_005:0164c09_0": "由施形聲兩化令得權實四益但云歡喜舉一以攝三也初明過去益物竟。",
    "X32n0616_005:0164c10_1": "△二明現在益物二初感應二施化。",
    "X32n0616_005:0164c11_2": "今初。",
    "X32n0616_005:0164c12_0": "諸善男子如來見諸眾生樂於小法德薄垢重者。",
    "X32n0616_005:0164c13_0": "如來見者即佛眼照也諸眾生樂小法者所見之機也貪愛二十五有即人天機名樂小法自求現滅即二乘機名樂小法樂於漸次紆迴佛道即三教菩薩機亦名為樂小法乃至樂近說者亦名為樂小法緣了二善功用微劣名為德薄見思塵沙無明三惑濃厚名為垢重問非生現生備施頓漸二化七方便等可是樂小法者圓頓赴機是應樂大法者云何通名為樂小法耶答此有四義一約往日雖發大心不能專精多著弊欲不得出世故名弊欲以為小法二約現在如佛未出世諸天人等雖有大機而心染世樂或著邪見故名為樂小法此二義與下譬中宛轉於地之意同也三約修行雖不樂三界愛見小法而樂三乘灰斷亦名小法雖不樂三乘近果而樂歷別修行一乘不能一心圓頓普修故名樂小此三意約因門明樂小法也四約果門樂聞近成之小出釋氏宮始得菩提不樂欲聞長遠大久之道故言樂小此等小心非始今日若先樂大佛即不說始成說始成者皆為樂小者耳。",
    "X32n0616_005:0165a07_1": "△二施化二初明現形二明說法。",
    "X32n0616_005:0165a07_2": "今初。",
    "X32n0616_005:0165a09_0": "為是人說我少出家得阿耨多羅三藐三菩提然我實成佛已來久遠若斯但以方便教化眾生令入佛道作如是說。",
    "X32n0616_005:0165a12_0": "此明現在為眾生故非生現生而生實非生也前明頓漸兩機來感法身今即現勝劣兩應劣應應漸機勝應應頓機此兩種應並有生法二身示生之相劣應二身生相者正慧托胎右脇出生即行七步一手指天一手指地自言天上天下唯吾獨尊此生身生相也坐吉祥草三十四心斷結習盡證得五分法身即法身生相也勝應二身生相者乘旃檀宮與諸菩薩處摩耶胎常說大乘作大佛事從右脇出十方周行各各七步作師子吼此生身生相也寂滅道場坐菩提座金剛後心斷無明盡妙覺朗然窮照法性種智圓明萬德普備此法身生相也出家者劣應出分段家勝應出二死家得菩提者劣應得生滅四諦所發無漏盡無生智名為菩提勝應照三諦一實之道究竟一切種智為菩提也(勝劣二種生身生相秖是一番托胎出生但大小兩機所見不同故須甄明非有兩番托胎出生也二種出家二種成道二種法身生相亦無不然故云雙垂兩相二始同時)然我實成佛下明本實不生彼天人阿修羅等今始見此二種生法二身謂言始生其實不然然我實成佛道甚大久遠如上所說剎塵之譬尚復過之今日現生非實生也或疑既非實生何故現生釋曰但為方便教化德薄垢重眾生令入佛道所以作如是說我少出家得菩提耳餘大乘經但破劣應生法二身生實非生不破勝應生法二身今云成佛甚久正破勝應法身非從寂場始生故與餘經永異。",
    "X32n0616_005:0165b12_1": "△二明說法又二初正明一代所說二釋出巧說之由。",
    "X32n0616_005:0165b13_2": "今初。",
    "X32n0616_005:0165b14_0": "諸善男子如來所演經典皆為度脫眾生或說己身或說他身或示己身或示他身或示己事或示他事諸所言說皆實不虗。",
    "X32n0616_005:0165b17_0": "所演經典徧指一代五味八教也皆為度脫眾生總釋頓漸顯密定與不定無非應病與藥令得度脫故也或說己身等略舉一代教中所有種種差別示現事也說自己往昔因緣名說己身說諸佛菩薩及餘弟子種種因緣名說他身現佛界像名示己身現九界像名示他身或現勝應名示己身現劣應身名示他身現佛界事名示己事現九界事名示他事或現種智名示己事現小智斷名示他事現大自在名示己事現九惱等名示他事諸所言說皆實不虗者明其不同世間之寓言也為眾生故一一示現一一有因有果一一有始有終惟其所說己身他身所示己身他身己事他事並無分毫虗言誑語故能度脫一切眾生譬如幻師于四衢道幻作象馬牛羊種種諸物象即是象馬即是馬更無一物而不酷肖乃能令彼愚小歡悅佛亦如是以法性大幻三昧徧于十方三世幻作己身他身己事他事說示于人令彼眾生咸得見聞並無一事徒搆空言乃使眾生信受而得度脫也。",
    "X32n0616_005:0165c11_1": "△二釋出巧說之由又二初明由照權實理故即是說示之本二明由稱漸頓機故即是說示之緣。",
    "X32n0616_005:0165c13_2": "今初。",
    "X32n0616_005:0165c14_0": "所以者何如來如實知見三界之相無有生死若退若出亦無在世及滅度者非實非虗非如非異不如三界見於三界如斯之事如來明見無有錯謬。",
    "X32n0616_005:0165c17_0": "夫現前一念真如法性本無一法可得而無法不具無法不造一切凡聖平等無差然凡夫及二乘人則滯于二死不能自度自脫因位諸大菩薩則局於數量不能橫徧豎窮皆由于此真如法性未能圓滿徹證故也惟有如來久遠劫來圓滿徹證此真法性故能以種智佛眼如實知見分段變易二種三界之相當體即是真如實相了知二種生死即非生死無有若退而在世者既無生死可退則無生死可出故無有若出而滅度者無有生死若退若出是十界實法皆空亦無在世及滅度者是十界假名皆空生死涅槃等如昨夢故非實迷為生死悟證涅槃緣起宛然故非虗無差別而十界差別故非如即差別而一性融通故非異不同二種三界之人或見三界為有或見三界為空故云不如三界見於三界也如斯之事即結指上文所明真俗妙諦即生死無有生死即退無有退即出無有出即在世無在世者即滅度無滅度者即實非實即虗非虗即如非如即異非異是謂即俗而真之事如來以如理智而明見之無有錯謬故能隨智說于隨自意語開權顯實開迹顯本也無有生死而妄見生死無有退出而妄見退出無在世而妄見在世無滅度而妄見滅度非實而妄見實非虗而妄見虗非如而妄見如非異而妄見異是謂即真而俗之事如來以如量智而明見之無有錯謬故能隨情說于隨他意語為實施權為本垂迹也。",
    "X32n0616_005:0166a18_1": "△二明由稱漸頓機故即是說示之緣。",
    "X32n0616_005:0166a19_0": "以諸眾生有種種性種種欲種種行種種憶想分別故欲令生諸善根以若干因緣譬喻言辭種種說法所作佛事未曾暫廢。",
    "X32n0616_005:0166a22_0": "種種者頓漸利鈍千差萬別也性者習欲所成指過去根種也欲者樂欲即從種所發之現行也行者隨諸樂欲所作善惡業行乃至三乘一乘出世行也憶想分別者隨所作行而生于解即相似智慧也於種種性宜用種種為人悉檀於種種欲宜用種種世界悉檀於種種行宜用種種為人對治二悉於種種憶想分別宜用種種第一義悉何以故隨其所得憶想之解更為說法即得朗悟第一義故乃至初地欲樂修行第二地時亦必憶想二地之境即是念想若發二地真解即是念想觀除言語法滅直至佛地方得究竟離于憶想獲常寂照耳故以若干因緣譬喻之辭種種說法令其生諸善根所作佛事未曾暫廢也權實善根有三五七九之不同故名為諸究竟皆歸一切種智故名佛事三輪不思議化晝夜常演令他得益無有間歇故云未曾暫廢二明現在益物竟。",
    "X32n0616_005:0166b13_1": "△三明未來益物二初正明非滅唱滅以益未來二釋須唱滅意初又二初明本實不滅二明方便唱滅。",
    "X32n0616_005:0166b15_2": "今初。",
    "X32n0616_005:0166b16_0": "如是我成佛已來甚大久遠壽命無量阿僧祇劫常住不滅諸善男子我本行菩薩道時所成壽命今猶未盡復倍上數。",
    "X32n0616_005:0166b19_0": "甚大久遠壽命無量阿僧祇劫牒前過去事也常住不滅正明未來永永恒益物也我本行下舉因況果以明常住謂于本未成佛已前初悟圓因而登圓住分證常住法身之壽已不可盡倍於如上所說塵數何況果壽而非常住譬如太子時祿已不可盡況登尊極祿用寧可盡乎當知法身壽命無始無終報身壽命有始無終應身壽命隨緣修短示有始終今正明報身修得壽命故過去雖約剎塵為譬仍是有始未來直云常住不滅則是無終也然三身本非一異鈍者但見應化不知即報即法所以妄計無常利者即于應化而悟法報所以能知常住耳。",
    "X32n0616_005:0166c06_1": "△二明方便唱滅。",
    "X32n0616_005:0166c07_0": "然今非實滅度而便唱言當取滅度如來以是方便教化眾生。",
    "X32n0616_005:0166c09_0": "現在眾生見佛聞法或始見我身聞我所說即皆信受入如來慧或先修習學小乘者我今亦令得聞是經入於佛慧既入佛慧即知如來常住不滅不為此人而唱滅也其有悠悠結緣之眾乃至五千退席之流移置他方之類現在未得種熟脫者此等眾生緣在未來故以唱滅方便而教化之當知三身並有非滅唱滅之義法身非滅唱滅者如淨名云法本不生今則無滅即是法身非滅又云是寂滅義即是法身唱滅何者若已了達不唱寂滅為未了者唱耳又若言照寂即是唱滅若言寂照即是唱生夫法身者雖非生非滅而亦有生滅若迷心執著即煩惱生而智慧滅若解心無染即智慧生而煩惱滅滅惑生解此是無常滅若解生惑滅即是寂滅此之生滅悉約法性而辨若無迷解二緣則不唱有此生滅也報身非滅唱滅者誰有智慧誰有煩惱而言智慧能破煩惱此即明闇不相除是報身不滅義眾生未了聞此便謂即佛而生憍恣不復修道故復唱言道能滅惑有煩惱時則無智慧有智慧時則無煩惱豈非智慧能滅煩惱耶應身非滅唱滅者應是法報之用體既無滅用豈有窮即是應身不滅但為眾生若常見佛則生憍恣故唱我於今夜當取滅度也又法身當體不生不滅報身了達無能生滅應身相續不生不滅是故三身並皆非滅今為方便教化眾生應身唱滅事同三身皆唱滅也初正明非滅唱滅以益未來竟。",
    "X32n0616_005:0167a10_1": "△二釋須唱滅意亦二初不滅有損二唱滅有益。",
    "X32n0616_005:0167a11_2": "今初。",
    "X32n0616_005:0167a12_0": "所以者何若佛久住於世薄德之人不種善根貧窮下賤貪著五欲入於憶想妄見網中若見如來常在不滅便起憍恣而懷厭怠不能生難遭之想恭敬之心。",
    "X32n0616_005:0167a16_0": "不種善根則不生真中二善是為無益思惑貪著五欲見惑入於憶想見思方生而不斷無明重沓而罔知則不斷通別二惡是為有損又起憍恣即增見惑懷厭怠即增思惑故有損不生難遭想即不能生見諦解不生恭敬心即不能生思惟道故無益也若見聞三佛不滅悉有憍恣義聞法身不滅便謂眾生如彌勒如一如無二如平等即真由是生於憍心上慢一切煩惱本自不生今亦無滅何須修道即便恣情放逸為是唱言是寂滅義又聞一切眾生即菩提相菩提相即煩惱相明闇不相除顯出佛菩提便起慢恣不復修善懈怠放逸為是唱言報身智慧能滅煩惱無明力大佛菩提智之所能滅應身不滅憍恣易解。",
    "X32n0616_005:0167b04_1": "△二唱滅有益。",
    "X32n0616_005:0167b05_0": "是故如來以方便說比丘當知諸佛出世難可值遇所以者何諸薄德人過無量百千萬億劫或有見佛或不見者以此事故我作是言諸比丘如來難可得見斯眾生等聞如是語必當生於難遭之想心懷戀慕渴仰於佛便種善根是故如來雖不實滅而言滅度。",
    "X32n0616_005:0167b11_0": "是故唱言雖法本不生今亦不滅要須滅惑方乃寂滅此法身難見義雖云智慧不滅煩惱然明時無闇汝今具足煩惱何能有慧當知智慧能滅障惑此報身難見義應身難見易解眾生聞是唱滅便於三佛生難遭想戀慕渴仰惡滅善生是故三身雖不實滅而唱滅也初正明三世益物竟。",
    "X32n0616_005:0167b16_1": "△二總結不虗。",
    "X32n0616_005:0167b18_0": "又善男子諸佛如來法皆如是為度眾生皆實不虗。",
    "X32n0616_005:0167b19_0": "既成佛已實得三身皆悉不生不滅為諸眾生盡未來時現生現滅實得三身亦實不虗現生現滅亦實不虗所以三世眾生各各得益亦不虗也若但論理而不論事但論性而不論修則同世間寓言何名不虗又設但論事而不達理但論修而不悟性則同權小生滅境界何名不虗故皆實不虗者即是權實本迹無不誠諦故也初法說竟。",
    "X32n0616_005:0167c03_0": "妙法蓮華經台宗會義卷五之二",
    "X32n0616_005:0167c06_0": "妙法蓮華經台宗會義卷五之三",
    "X32n0616_005:0167c08_0": "古吳後學蕅益　智旭　述",
    "X32n0616_005:0167c09_0": "△本門二明三世益物中二譬說二初立譬二法合初中二初良醫治子譬譬上三世益物二治子實益譬譬上總結不虗初又三初遠行譬譬過去益物二還來譬譬現在益物三復去譬譬未來益物。",
    "X32n0616_005:0167c13_1": "今初。",
    "X32n0616_005:0167c14_0": "譬如良醫智慧聰達明練方藥善治眾病其人多諸子息若十二十乃至百數以有事緣遠至餘國。",
    "X32n0616_005:0167c16_0": "前法說中有三意初益物處二拂迹疑三益物所宜今但譬益物所宜就所宜中有感應有施化今具譬之譬如良醫至善治眾病即譬我以佛眼觀有能應之智也其人多諸至乃至百數即譬眾生來至我所有能感之機也於施化中有形聲兩益及得益歡喜今略不譬歡喜又略不譬聲益於形益中又略不譬非生現生但譬非滅現滅一意即是以有事緣遠至他國也言良醫者醫有十種一者治病病增無損或時致死譬空見外道恣意行惡教人起邪斷善根法法身既亡慧命亦死二者治病不增不損譬有見苦行外道投巖赴火苦行行善不得禪定不能斷結故不損亦不斷善故不增也三者治病損而不增但差已還發譬修定斷結外道也四者治病能令差已不發而所治不徧譬二乘人但治一兩種有緣者不能徧治一切也五者雖能兼徧而無巧術用治苦痛譬六度菩薩慈悲廣治難行苦行釋論呼為拙度也六治病巧術治無痛惱但不能治必死之人譬通教菩薩體法巧度但治有反復凡夫不治敗種二乘也七雖能治難愈之病不能一時治一切病譬別教地前菩薩也八能一時治一切病而不能令平復如本譬圓教十信也九能徧治一切亦令平復如本而不能令過本譬圓教四十位也十者一時治一切病即能平復又使過本即是如來(醫有十種者通收邪正貫彼偏圓前之三種亦稱醫者佛未出時一切外道皆自謂出家各自領眾故也第三醫中云差已還發者雖斷事惑還墮三塗以見惑未斷故隨禪受生之後仍受輪迴也如阿含云良醫有四一善知病相二知病因起三善知方治四畢竟不發但是此中第四第五二種醫相何以故所知病相不出界內知病因起不出依正所有方治不逾生滅無常苦空無我不淨所云不發秪是住二涅槃若以四名義通諸教則一一教隨義各別乃至圓教於理無妨若直引彼以證此經則尚不同通教巧治安譬本門數數生滅深不可也第八不能令平復者自入未深未能令他見本法身法身被無明所覆義如病損令還得見方名為復也第十言過本者法身本有今令證本名之為復以對性德無功用故故修名過然初住已上亦得名為分過由殘惑在且名為復又讓極地究竟名過也)前三種醫即大經中之舊醫用乳藥也後七並是客醫無巧術者但用無常苦無我法如用苦酢醎藥有術遠來還令服乳即最後究竟良醫良者善也具曉八術譬三達五眼也智慧者權實二智深知二諦也聰達者五眼鑒機頓漸不差也明練方藥者譬十二部教文理甚深也能詮文如方所詮理如藥藥通行理今且云理理即攝行也善治眾病者譬能觀知諸根利鈍巧用四悉檀也多諸子息者子義有三種一正因佛子謂一切眾生皆有三種性德佛性即是佛子故云其中眾生悉是吾子也二緣因佛子謂曾聞一句一偈稟說修行所生微解即了因性所修微行即緣因性正性為本束此三性總名緣因以能資發一實解故故云長者諸子若十二十乃至三十先因遊戲入火宅也三了因佛子謂聞法悟道三因開發正因理心發即法身德了因慧心發即般若德緣因善心發即解脫德束此三性總名了因以能了達中道義故故云從佛口生從法化生得佛法分真是佛子也若了因子常得見父父不遠行若緣因子機尚未熟父即遠行得有飲他毒藥之義今云多諸子息正是普收正因子也若十者十界中佛界機也二十者十界中佛及菩薩兩界機也乃至百數者十界互具十界故為百也百界並有性德三因並有生善之義故皆名子息也以有事緣者譬此土機淺彼方緣熟也遠至他國者譬非滅現滅即所謂亦復現言當入涅槃也。",
    "X32n0616_005:0168b24_1": "△二還來譬譬現在益物二初譬感應二譬施化。",
    "X32n0616_005:0168c01_2": "今初。",
    "X32n0616_005:0168c02_0": "諸子於後飲他毒藥藥發悶亂宛轉於地。",
    "X32n0616_005:0168c03_0": "此譬上文機應相關見諸眾生樂於小法德薄垢重也佛在世時不但已聞法者薄有解行縱令不見聞者亦蒙利益如生盲不見日輪亦藉日輪而得起作佛既非滅示滅不惟大地幽闇縱令曾結緣者通惑未斷漸著三界見思毒藥故云飲他毒藥不知出要故云悶亂輪轉六道故云宛轉於地也。",
    "X32n0616_005:0168c09_1": "△二譬施化二初譬現形二譬說法。",
    "X32n0616_005:0168c09_2": "今初。",
    "X32n0616_005:0168c10_0": "是時其父還來歸家諸子飲毒或失本心或不失者遙見其父皆大歡喜拜跪問訊善安隱歸我等愚癡誤服毒藥願見救療更賜壽命。",
    "X32n0616_005:0168c13_0": "還來歸家譬上為是人說我少出家得三菩提非生而現生也或失本心者譬貪著三界失先所種若頓若漸諸善根也或不失者譬雖著五欲不失三乘善根也遙見其父者譬佛出時眾生亦見色身而為見思障隔五分不得親奉法身故云遙也見聞佛出皆有喜敬求救之事具如諸經所明。",
    "X32n0616_005:0168c18_1": "△二譬說法上文廣明一代所說及釋巧說之由所謂照理稱機今但總明三意初譬佛受請轉頓漸法輪二譬勸誡三譬得益。",
    "X32n0616_005:0168c21_2": "今初。",
    "X32n0616_005:0168c22_0": "父見子等苦惱如是依諸經方求好藥草色香美味皆悉具足擣篩和合與子令服。",
    "X32n0616_005:0168c24_0": "經方譬頓漸一切諸教典也藥草譬頓漸一切諸法門也並是出世正法故名為好色譬大小乘戒戒防身口事相彰顯也香譬事理諸禪功德普熏也味譬權實諸慧能證空中理味也皆悉具足者不論頓漸大小偏圓皆有此三學也又色是法身體質義故香是解脫離臭義故味是般若證覺義故大小偏圓一切法門皆悉攬此三德而為體也擣譬空三昧篩譬無相三昧和合譬無作三昧大小偏圓皆有此三種三昧一一三昧皆具戒定慧三亦皆以三德為其體性但有明昧之不同耳又空觀如擣假觀如篩中觀如和合三觀皆不離戒定慧亦皆不出三德體性將此法與頓漸眾生令其修行名令服也。",
    "X32n0616_005:0169a12_1": "△二譬勸誡。",
    "X32n0616_005:0169a13_0": "而作是言此大良藥色香美味皆悉具足汝等可服速除苦惱無復眾患。",
    "X32n0616_005:0169a15_0": "汝等可服勸也速除苦惱誡也勸令早服誡令勿遲頓漸諸典俱有勸誡。",
    "X32n0616_005:0169a16_1": "△三譬得益。",
    "X32n0616_005:0169a17_0": "其諸子中不失心者見此良藥色香俱好即便服之病盡除愈。",
    "X32n0616_005:0169a19_0": "子既徧收十界故獨舉不失心者能得現在益也從初成道乃至涅槃最後得度皆由不失三乘善根故耳見色香好即便服之服乃得味得味病除譬因戒生定因定發慧能斷三惑也二還來譬譬現在益物竟。",
    "X32n0616_005:0169a23_1": "△三復去譬譬未來益物上文有二初非滅唱滅次釋須唱滅就初又二初明本實不滅二明方便唱滅次文亦二初明不滅有損二明唱滅有益今具譬之即為四初超譬不滅有損二譬方便唱滅三譬唱滅有益四追譬本實不滅。",
    "X32n0616_005:0169b04_0": "今初。",
    "X32n0616_005:0169b05_0": "餘失心者見其父來雖亦歡喜問訊求索治病然與其藥而不肯服所以者何毒氣深入失本心故於此好色香藥而謂不美。",
    "X32n0616_005:0169b08_0": "餘失心者譬往昔結緣尚淺之人及昔未結緣之輩不能于今佛世得度須至滅後方漸熟脫即是未來機也毒氣深入譬上貪著五欲入於憶想妄見網中好色香藥而謂不美即是不能持戒習定所以終不能得理味譬上便起憍恣而懷厭怠也。",
    "X32n0616_005:0169b13_0": "△二譬方便唱滅。",
    "X32n0616_005:0169b14_0": "父作是念此子可愍為毒所中心皆顛倒雖見我喜求索救療如是好藥而不肯服我今當設方便令服此藥即作是言汝等當知我今衰老死時已至是好良藥今留在此汝可取服勿憂不差作是教已復至他國遣使還告汝父已死。",
    "X32n0616_005:0169b19_0": "死時已至譬當入涅槃也留好良藥譬留諸經教法門也復至他國譬此方現滅他方現生故上文云惟願世尊在於他方遙見守護也遣使者或取涅槃中大聲普告為使人或用神通或用舍利或用經教等為使人今用四依菩薩語眾生云佛已滅度但留此法我今宣弘汝當受行也後時若無四依傳述經法則眾生豈能自知有佛已滅故用四依為所遣使。",
    "X32n0616_005:0169c02_1": "△三譬唱滅有益。",
    "X32n0616_005:0169c03_0": "是時諸子聞父背喪心大憂惱而作是念若父在者慈愍我等能見救護今者捨我遠喪他國自惟孤露無復恃怙常懷悲感心遂醒悟乃知此藥色香美味即取服之毒病皆愈。",
    "X32n0616_005:0169c07_0": "△四追譬本實不滅。",
    "X32n0616_005:0169c08_0": "其父聞子悉已得差尋便來歸咸使見之。",
    "X32n0616_005:0169c09_0": "良由滅後眾生醒悟服藥修行以作因緣能感未來應化如遺教云其未度者亦皆已作得度因緣也亦有精進苦到即于道場感見諸佛者如天台大師親見靈山一會儼然未散便是服藥病除之驗故知滅實不滅益徧未來初良醫治子譬譬上三世益物竟。",
    "X32n0616_005:0169c14_1": "△二治子實益譬譬上總結不虗。",
    "X32n0616_005:0169c15_0": "諸善男子於意云何頗有人能說此良醫虗妄罪不不也世尊。",
    "X32n0616_005:0169c17_0": "初立譬竟。",
    "X32n0616_005:0169c17_1": "△二法合。",
    "X32n0616_005:0169c18_0": "佛言我亦如是成佛已來無量無邊百千萬億那由他阿僧祇劫為眾生故以方便力言當滅度亦無有能如法說我虗妄過者。",
    "X32n0616_005:0169c21_0": "成佛已來無量劫合過去益物譬言當滅度合未來益物譬現在易知故略不合亦無能說虗妄合治子實益譬也前已具顯過去久遠今此合意正欲顯示未來常住與大涅槃及金光明義同初長文竟。",
    "X32n0616_005:0170a01_1": "△二偈頌二初頌正顯遠二頌三世益物。",
    "X32n0616_005:0170a02_0": "今初。",
    "X32n0616_005:0170a03_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0170a04_0": "自我得佛來所經諸劫數無量百千萬億載阿僧祇。",
    "X32n0616_005:0170a05_0": "不頌執近之情但頌顯遠也億載皆數名。",
    "X32n0616_005:0170a05_1": "△二頌三世益物二初頌法說二頌譬說初中二初頌正明三世益物二頌總結不虗初又三初頌過去二頌現在三頌未來初又三初超頌過去益物所宜二追頌過去益物處三頌拂過去迹疑。",
    "X32n0616_005:0170a09_2": "今初。",
    "X32n0616_005:0170a10_0": "常說法教化無數億眾生令入於佛道爾來無量劫為度眾生故方便現涅槃。",
    "X32n0616_005:0170a12_0": "說法教化頌聲益也令入佛道頌得益也方便涅槃頌形益中非滅現滅即兼得非生現生也。",
    "X32n0616_005:0170a13_1": "△二追頌過去益物處。",
    "X32n0616_005:0170a15_0": "而實不滅度常住此說法。",
    "X32n0616_005:0170a16_0": "△三頌拂過去迹疑。",
    "X32n0616_005:0170a17_0": "我常住於此以諸神通力令顛倒眾生雖近而不見。",
    "X32n0616_005:0170a18_0": "雖近不見故但見儒童得記及壽終等也初頌過去竟。",
    "X32n0616_005:0170a19_1": "△二頌現在二初頌感應二頌施化。",
    "X32n0616_005:0170a19_2": "今初。",
    "X32n0616_005:0170a20_0": "眾見我滅度廣供養舍利咸皆懷戀慕而生渴仰心眾生既信伏質直意柔軟一心欲見佛不自惜身命。",
    "X32n0616_005:0170a22_0": "長文明感應中則云樂於小法德薄垢重今頌明供養渴仰等者彼約不知久成義說今約能感迹化義說也又雖戀慕渴仰乃至不惜身命以佛眼觀總是樂於近成小法者耳。",
    "X32n0616_005:0170b01_1": "△二頌施化。",
    "X32n0616_005:0170b02_0": "時我及眾僧俱出靈鷲山我時語眾生常在此不滅以方便力故現有滅不滅。",
    "X32n0616_005:0170b04_0": "俱出靈鷲山頌現形也我時語眾生頌說法也長文頌說法中先正明一代所說次釋出巧說之由其文甚廣今頌甚略常在此不滅句但頌顯實以方便力二句略頌稱機也二頌現在竟。",
    "X32n0616_005:0170b07_1": "△三頌未來長文有二初正明非滅唱滅二釋須唱滅意就初又二初明本實不滅二明方便唱滅今頌不次第初先頌方便唱滅兼頌須唱滅意二頌本實不滅兼廣釋不見得見之由。",
    "X32n0616_005:0170b11_2": "今初。",
    "X32n0616_005:0170b12_0": "餘國有眾生恭敬信樂者我復於彼中為說無上法汝等不聞此但謂我滅度我見諸眾生沒在於苦惱故不為現身令其生渴仰因其心戀慕乃出為說法。",
    "X32n0616_005:0170b15_0": "初一偈先明不滅次半偈正頌唱滅次一偈頌釋須唱滅意後二句是頌唱滅有益得成未來機應也。",
    "X32n0616_005:0170b17_1": "△二頌本實不滅兼廣釋不見得見之由。",
    "X32n0616_005:0170b18_0": "神通力如是於阿僧祇劫常在靈鷲山及餘諸住處眾生見劫盡大火所燒時我此土安隱天人常充滿園林諸堂閣種種寶莊嚴寶樹多華果眾生所遊樂諸天擊天鼓常作眾伎樂雨曼陀羅華散佛及大眾。",
    "X32n0616_005:0170b22_0": "此正頌本實不滅也常在靈鷲山指本時應身居于此土也及餘諸住處指本時應身亦徧十方若淨若穢諸處也本既在此諸處迹亦不移但眾生妄見劫盡而佛土本無生滅即此同居便是方便實報寂光妙土何以言之我此土安隱是佛所證安隱之法即常寂光土也由佛能證即自受用報土也天人常充滿者十地為天三十心為人即他受用報土也眾生所遊樂即方便有餘土九種方便眾生之所居也天鼓伎樂及天華等即實報土中俗諦勝妙五塵方便土中真諦法性五塵也。",
    "X32n0616_005:0170c08_0": "我淨土不毀而眾見燒盡憂怖諸苦惱如是悉充滿是諸罪眾生以惡業因緣過阿僧祇劫不聞三寶名。",
    "X32n0616_005:0170c10_0": "此釋不見之由由于惡業罪也寂光實報方便三種淨土皆悉不毀惡業因緣妄見燒盡在彼眾生則是同分妄見以佛菩薩觀之還是別業妄見而已。",
    "X32n0616_005:0170c14_0": "諸有修功德柔和質直者則皆見我身在此而說法。",
    "X32n0616_005:0170c15_0": "此釋得見之由由於修緣了二因也諸者徧指三乘權實緣修及真修也功德是如來室柔和是如來衣質直是如來座相似三法行成則見如來方便應身分證三法行成則見如來實報報身究竟三法行成則見如來寂光法身。",
    "X32n0616_005:0170c20_0": "或時為此眾說佛壽無量久乃見佛者為說佛難值。",
    "X32n0616_005:0170c21_0": "此總結由于眾生有見不見故使如來所說不同意顯說雖不同皆實不虗也初頌正明三世益物竟。",
    "X32n0616_005:0170c23_1": "△二頌總結不虗。",
    "X32n0616_005:0170c24_0": "我智力如是慧光照無量壽命無數劫久修業所得汝等有智者勿於此生疑當斷令永盡佛語實不虗。",
    "X32n0616_005:0171a02_0": "初一偈頌諸佛如來法皆如是長文引諸佛以證我今頌我以證諸佛也久修業所得正顯此品所詮如來壽量是約修得不約性得性得無始無終生佛體同修得有始無終佛佛道同唯其有始故過去實成有久有近唯其無終故盡未來時常住不滅也次一偈頌為度眾生皆實不虗結勸令斷執近之疑也初頌法說竟。",
    "X32n0616_005:0171a08_1": "△二頌譬說二初頌立譬二頌法合。",
    "X32n0616_005:0171a09_2": "今初。",
    "X32n0616_005:0171a10_0": "如醫善方便為治狂子故實在而言死無能說虗妄。",
    "X32n0616_005:0171a11_0": "初三句但頌非滅現滅一意即顯三世益物方便又顯滅實非滅過去久遠未來常住皆實不虗矣第四句即頌總結不虗。",
    "X32n0616_005:0171a13_1": "△二頌法合。",
    "X32n0616_005:0171a14_0": "我亦為世父救諸苦患者為凡夫顛倒實在而言滅以常見我故而生憍恣心放逸著五欲墮於惡道中。",
    "X32n0616_005:0171a16_0": "此亦總頌非滅現滅一意兼頌不滅有損以顯唱滅是方便也。",
    "X32n0616_005:0171a18_0": "我常知眾生行道不行道隨所應可度為說種種法每自作是意以何令眾生得入無上慧速成就佛身。",
    "X32n0616_005:0171a20_0": "此正頌合總結不虗猶良醫之方便治子病也初正開近顯遠竟。",
    "X32n0616_005:0171a22_0": "△釋如來壽量品竟次釋分別功德品。",
    "X32n0616_005:0171a23_0": "分別功德品第十七",
    "X32n0616_005:0171a24_0": "此品具有授記領解流通於授記及流通中各有淺深不同故言分別佛說壽量本迹二種弟子得種種益乃至現在四信滅後五品亦皆得益故言功德(本弟子即地涌眾迹弟子即靈山眾)。",
    "X32n0616_005:0171b03_1": "△二總授法身記三初經家總敘二如來分別三瑞表圓益。",
    "X32n0616_005:0171b04_2": "今初。",
    "X32n0616_005:0171b05_0": "爾時大會聞佛說壽命劫數長遠如是無量無邊阿僧祇眾生得大饒益。",
    "X32n0616_005:0171b07_0": "△二如來分別。",
    "X32n0616_005:0171b08_0": "於時世尊告彌勒菩薩摩訶薩阿逸多我說是如來壽命長遠時六百八十萬億那由他恒河沙眾生得無生法忍。",
    "X32n0616_005:0171b11_0": "迹門三周說法三根得記並是初住無生法忍見道之位今聞本門復有爾許眾生得入圓住故知一代極唱利益難思也。",
    "X32n0616_005:0171b14_0": "復有千倍菩薩摩訶薩得聞持陀羅尼門。",
    "X32n0616_005:0171b15_0": "先已證無生者今聞本門極唱轉入修道增圓妙道損變易生證圓十住得大聞持圓頓妙法能受能持猶如大海普能受持龍王雨也。",
    "X32n0616_005:0171b18_0": "復有一世界微塵數菩薩摩訶薩得樂說無礙辯才。",
    "X32n0616_005:0171b19_0": "此是增道損生證圓十行不思議假恒沙佛法橫豎貫通故能自在演說辯才無礙也。",
    "X32n0616_005:0171b21_0": "復有一世界微塵數菩薩摩訶薩得百千萬億無量旋陀羅尼。",
    "X32n0616_005:0171b23_0": "此是增道損生證圓十迴向法事理圓融真俗不二一中無量無量中一重重旋轉互總互持也。",
    "X32n0616_005:0171c01_0": "復有三千大千世界微塵數菩薩摩訶薩能轉不退法輪。",
    "X32n0616_005:0171c03_0": "此是增道損生證圓初地心心流注薩婆若海圓轉三不退輪也。",
    "X32n0616_005:0171c05_0": "復有二千中國土微塵數菩薩摩訶薩能轉清淨法輪。",
    "X32n0616_005:0171c07_0": "此是增道損生證圓二地自離三惑垢令他離三惑垢故云轉清淨法輪也。",
    "X32n0616_005:0171c09_0": "復有小千國土微塵數菩薩摩訶薩八生當得阿耨多羅三藐三菩提。",
    "X32n0616_005:0171c11_0": "此是增道損生證圓四地止餘八品微細無明故云八生當得菩提也斷一品入五地斷二品入六地斷三品入七地斷四品入八地斷五品入九地斷六品入十地斷七品入等覺斷八品盡入妙覺每斷一品無明即損一變易生增明一分中道也。",
    "X32n0616_005:0171c16_0": "復有四四天下微塵數菩薩摩訶薩四生當得阿耨多羅三藐三菩提。",
    "X32n0616_005:0171c18_0": "此是增道損生證圓八地止餘四品微細無明也損一生入九地損二生入十地損三生入等覺損四生盡即成妙覺。",
    "X32n0616_005:0171c21_0": "復有三四天下微塵數菩薩摩訶薩三生當得阿耨多羅三藐三菩提。",
    "X32n0616_005:0171c23_0": "此是增道損生證圓九地故止餘三生也。",
    "X32n0616_005:0171c24_0": "復有二四天下微塵數菩薩摩訶薩二生當得阿耨多羅三藐三菩提。",
    "X32n0616_005:0172a02_0": "此是增道損生證圓十地故止餘二生也。",
    "X32n0616_005:0172a03_0": "復有一四天下微塵數菩薩摩訶薩一生當得阿耨多羅三藐三菩提。",
    "X32n0616_005:0172a05_0": "此是增道損生證圓等覺故止餘一生也。",
    "X32n0616_005:0172a06_0": "復有八世界微塵數眾生皆發阿耨多羅三藐三菩提心。",
    "X32n0616_005:0172a08_0": "此即博地凡夫由聞經力證圓十信發相似心也本門得道如此之多一切諸經皆所不及良由原本垂迹處處開引中間相值數數成熟今世五味節節調伏收羅結撮歸會法華譬如田家春生夏長耕種耘治秋收冬藏一時穫刈此後雖復有得道者如捃拾耳問授法身記何缺五地六地七地人耶答此非思議可知惟如來能分別惟補處能領解何必于此生疑問聞持陀羅尼等何與舊文對位又略不同答無生忍等名字並通偏圓權實本無一定但須消釋令會圓理今約義便作此分配若欲互融何所不可當知惟八生四生等的有次序餘皆約義配釋而已二如來分別竟。",
    "X32n0616_005:0172a19_1": "△三瑞表圓益。",
    "X32n0616_005:0172a21_0": "佛說是諸菩薩摩訶薩得大法利時於虗空中雨曼陀羅華摩訶曼陀羅華以散無量百千萬億寶樹下師子座上諸佛并散七寶塔中師子座上釋迦牟尼佛及久滅度多寶如來亦散一切諸大菩薩及四部眾又雨細末栴檀沉水香等於虗空中天鼓自鳴妙聲深遠又雨千種天衣垂諸瓔珞真珠瓔珞摩尼珠瓔珞如意珠瓔珞徧於九方眾寶香鑪燒無價香自然周至供養大會一一佛上有諸菩薩執持幡蓋次第而上至于梵天是諸菩薩以妙音聲歌無量頌讚歎諸佛。",
    "X32n0616_005:0172b07_0": "此中亦有六瑞一雨華瑞二雨香瑞表圓妙慧福自行德也三天鼓瑞四天衣瓔珞瑞表圓妙教行化他德也五燒香供養瑞六幡蓋讚歎瑞表圓妙自行化他同歸極果也初虗空雨華者虗空表平等法性從此法性出生四十真位圓妙慧華也前文既借分身表應釋迦表報多寶表法今先散分身諸佛次及釋迦多寶意顯三身雖非一異而由得見應身乃知報身修德及法身性德也亦散一切菩薩四眾即表大會皆得圓因妙慧皆成三身妙果無差別也細末栴檀沉水諸福德香亦從法性出生亦以奉供三身普及四眾文影略耳天鼓自鳴是表圓音演深妙教千種天衣表寂滅忍衣徧覆一切垂諸瓔珞表戒定慧陀羅尼四種瓔珞攝化眾生令生喜悅也摩尼此云如意又言如意珠者或是偶爾重文華梵雙舉或以四瓔珞字用擬戒等四瓔珞也徧於九方者本從上方雨垂徧於八方及下地也問何不如華嚴云充滿十方耶答華嚴以十表無盡此經以一表同歸今云徧於九方正表一佛界理徧該九界九界無非一佛界也眾寶香鑪燒無價香自然周至供養大會者即表自行妙德總趣極果也前既雨華雨香用表福慧今之燒香即以燒表慧以香表福供養大會三身諸佛普及菩薩四眾諸未來佛故云趣極果也言自然者不由人力亦從法性虗空而顯現也有諸菩薩者亦是自然化現諸菩薩像亦從法性虗空出生也旛者轉義即表增道損生蓋者覆義即表慈悲益物次第而上即表從因至果至于梵天者梵是淨義即表究竟四德妙音歌頌讚歎諸佛即表以佛道聲令一切聞上既以天鼓表化他之教衣瓔表化他之行今還用幡蓋表行歌讚表教二種化他妙德同趣極果也圓益既深故現瑞以表之華嚴佛頂諸經說大法竟皆現奇瑞此經何獨不然二總授法身記竟。",
    "X32n0616_005:0172c15_1": "△三彌勒總申領解上迹門中菩薩亦悟而大事未畢所以不陳今本門既竟故托補處以總申之文分為三初頌時眾得解二頌如來分別三頌瑞表圓益。",
    "X32n0616_005:0172c18_2": "今初。",
    "X32n0616_005:0172c19_0": "爾時彌勒菩薩從座而起偏袒右肩合掌向佛而說偈言。",
    "X32n0616_005:0172c21_0": "一切菩薩分證法空名之為座今從座起表不住所證展轉增進也本實迹權向未發迹如右肩被覆今已開竟故偏袒以表之本迹雖殊不思議一故合掌以表之增道損生速趣極果故向佛以表之。",
    "X32n0616_005:0173a02_0": "佛說希有法昔所未曾聞世尊有大力壽命不可量無數諸佛子聞世尊分別說得法利者歡喜充徧身。",
    "X32n0616_005:0173a04_0": "△二頌如來分別。",
    "X32n0616_005:0173a05_0": "或住不退地或得陀羅尼或無礙樂說萬億旋總持。",
    "X32n0616_005:0173a06_0": "不退地即頌無生法忍初住念不退位餘可知。",
    "X32n0616_005:0173a07_0": "或有大千界微塵數菩薩各各皆能轉不退之法輪復有中千界微塵數菩薩各各皆能轉清淨之法輪復有小千界微塵數菩薩餘各八生在當得成佛道復有四三二如此四天下微塵諸菩薩隨數生成佛或一四天下微塵數菩薩餘有一生在當成一切智如是等眾生聞佛壽長遠得無量無漏清淨之果報。",
    "X32n0616_005:0173a13_0": "無量無漏揀異二乘之有量也妙因所感故言清淨無障礙土故言果報。",
    "X32n0616_005:0173a15_0": "復有八世界微塵數眾生聞佛說壽命皆發無上心。",
    "X32n0616_005:0173a16_0": "二頌如來分別竟。",
    "X32n0616_005:0173a16_1": "△三頌瑞表圓益。",
    "X32n0616_005:0173a17_0": "世尊說無量不可思議法多有所饒益如虗空無邊雨天曼陀羅摩訶曼陀羅釋梵如恒沙無數佛土來雨旃檀沉水繽紛而亂墜如鳥飛空下供散於諸佛。",
    "X32n0616_005:0173a20_0": "此頌雨華雨香二瑞總皆供散諸佛也長有釋梵二句以表機徧十方。",
    "X32n0616_005:0173a22_0": "天鼓虗空中自然出妙聲天衣千萬種旋轉而來下。",
    "X32n0616_005:0173a23_0": "此頌天鼓天衣二瑞略不頌瓔珞而天衣長有萬字正顯所覆必多。",
    "X32n0616_005:0173b01_0": "眾寶妙香鑪燒無價之香自然悉周徧供養諸世尊。",
    "X32n0616_005:0173b02_0": "此頌燒香供養瑞也長文云大會今頌云世尊當知大會皆是三世佛也。",
    "X32n0616_005:0173b04_0": "其大菩薩眾執七寶幡蓋高妙萬億種次第至梵天一一諸佛前寶幢懸勝幡亦以千萬偈歌詠諸如來。",
    "X32n0616_005:0173b06_0": "此頌幡蓋讚歎瑞也。",
    "X32n0616_005:0173b07_0": "如是種種事昔所未曾有聞佛壽無量一切皆歡喜佛名聞十方廣饒益眾生一切具善根以助無上心。",
    "X32n0616_005:0173b09_0": "此結頌瑞表圓益不同循常瑞相故云昔所未曾有也二本門正說段竟。",
    "X32n0616_005:0173b11_0": "△三流通段此下共有十一品半經文盡屬流通今且逐近以三品半而為本門流通者凡有兩意一者四信五品並以聞壽長遠而為言端隨喜功德法師功德兩品秖是申明初品因果功德不輕一品秖是引證讚毀福罪當知此三品半正為流通本門例如法師至安樂行五品正為流通迹門也二者既以初品別序為迹門序迹門自具三段故以此三品半而為本門流通本門亦具三段本迹各三束為正說乃以通序五事而序兩門囑累八品流通兩門體格周正眉目分明也今就此三品半分為三意初一品半明初品因功德以勸流通二法師功德品明初品果功德以勸流通三不輕品引信毀福罪證勸流通初中二初明現在四信二明滅後五品初又四初一念信解二解其言趣三聞持供養四深信觀成初又二初長文二偈頌初又三初出相貌二明功德三明位行不退。",
    "X32n0616_005:0173c02_1": "今初。",
    "X32n0616_005:0173c03_0": "爾時佛告彌勒菩薩摩訶薩阿逸多其有眾生聞佛壽命長遠如是乃至能生一念信解。",
    "X32n0616_005:0173c05_0": "上已分別聞佛壽長得益深廣未入住者悟無生忍已入住者增道損生位鄰極聖未發心者發無上心入于十信此皆夙種既深現得熟脫無生發心二位並屬當機增道損生通于影響發起當機三眾故屬正說授記段也今流通之始乃約初結緣人未登十信或從此會略聞或從現在諸菩薩等展轉得聞聞佛壽命長遠如是然時既甚促聞亦不多故云乃至能生一念信解極言其時之暫而獲益之淺也夫一念者即現前一念介爾之心也信解者信佛本地所證之理是法界妙理此理非實非權而能實能權自行冥理名實化他種種方便名權此理非本非迹而能本能迹初證權實體用名本證後所施體用權實名迹又信解此理既是釋尊之所久證亦是眾生之所久迷亦是現前介爾一念之所同具故曰如心佛亦爾如佛眾生然心佛及眾生是三無差別如是隨所聞處豁爾開明隨語而入無有罣礙信一切法皆是佛法(即權而實不思議真)又信佛法不隔一切法(即實而權不思議俗)不得佛法不得一切法(雙遮)而見一切法亦見佛法(雙照此二句是不思議中)即一而三(隨舉一諦皆具三諦)即三而一(雖分三諦秪是一心)亦是行於非道通達佛道(九界非道純是佛界妙道之用釋上一切法皆是佛法也)行於佛道通達一切道(釋上佛法不隔一切法也)不得佛道一切道(釋雙遮)而通達佛道一切道(釋雙照)無所有而有(三諦皆有)有而無所有(三諦皆無)非所有非無所有(三諦皆非有非無)如門前路通達一切東西南北無有壅礙眼耳鼻舌身意凡有所對悉亦如是(六塵體是法界亘古亘今無非圓妙三諦也)無疑曰信明了曰解是為一念信解心也(上約聞法信解即是信行)若坐思惟隨所思惟豁然開悟通達三諦亦復如是(更約思惟而生一念信解即是法行)如是信解即十信初心未得六根清淨未入鐵輪正位也。",
    "X32n0616_005:0174a10_1": "△二明功德二初總論無量二格量顯多。",
    "X32n0616_005:0174a11_2": "今初。",
    "X32n0616_005:0174a12_0": "所得功德無有限量。",
    "X32n0616_005:0174a13_0": "△二格量顯多又二初舉五度為格量本二正格信解功德甚多。",
    "X32n0616_005:0174a14_1": "今初。",
    "X32n0616_005:0174a15_0": "若有善男子善女人為阿耨多羅三藐三菩提故於八十萬億那由他劫行五波羅蜜檀波羅蜜尸羅波羅蜜羼提波羅蜜毗梨耶波羅蜜禪波羅蜜除般若波羅蜜。",
    "X32n0616_005:0174a19_0": "般若即是今之正慧故言除般若也問既離般若則前五不應名波羅蜜答約別教人為求無上菩提各自於五而盡其邊亦得名度以別教十向後心名假邊際故也問別教亦有次第般若還同所校何以除之答豎論空假般若可為所校中證不殊名等體等故須除也。",
    "X32n0616_005:0174a24_1": "△二正格信解功德甚多。",
    "X32n0616_005:0174b01_0": "以是(五度)功德比前(一念信解)功德百分千分百千萬億分不及其一乃至算數譬喻所不能知。",
    "X32n0616_005:0174b03_0": "△三明位行不退。",
    "X32n0616_005:0174b04_0": "若善男子善女人有如是功德於阿耨多羅三藐三菩提退者無有是處。",
    "X32n0616_005:0174b06_0": "別六心猶退七心不退今圓初心即不退者聞壽量功德自外而資圓順信解自內而熏故不退也初長文竟。",
    "X32n0616_005:0174b08_1": "△二偈頌三初超頌功德二頌位行不退三追頌相貌初又二初超頌格量顯多二追頌總論無量初又二初頌舉五度為格量本二頌正格信解功德甚多。",
    "X32n0616_005:0174b11_2": "今初。",
    "X32n0616_005:0174b12_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0174b13_0": "若人求佛慧於八十萬億那由他劫數行五波羅蜜於是諸劫中布施供養佛及緣覺弟子并諸菩薩眾珍異之飲食上服與臥具旃檀立精舍以園林莊嚴如是等布施種種皆微妙盡此諸劫數以迴向佛道若復持禁戒清淨無缺漏求於無上道諸佛之所歎若復行忍辱住於調柔地設眾惡來加其心不傾動諸有得法者懷於增上慢為斯所輕惱如是亦能忍若復勤精進志念常堅固於無量億劫一心不懈息又於無數劫住於空閑處若坐若經行除睡常攝心以是因緣故能生諸禪定八十億萬劫安住心不亂持此一心福願求無上道我得一切智盡諸禪定智是人於百千萬億劫數中行此諸功德如上之所說。",
    "X32n0616_005:0174c01_0": "△二頌正格信解功德甚多。",
    "X32n0616_005:0174c02_0": "有善男女等聞我說壽命乃至一念信其福過於彼。",
    "X32n0616_005:0174c03_0": "初超頌格量顯多竟。",
    "X32n0616_005:0174c03_1": "△二追頌總論無量。",
    "X32n0616_005:0174c04_0": "若人悉無有一切諸疑悔深心須臾信其福為如此。",
    "X32n0616_005:0174c05_0": "須臾即一念也初超頌功德竟。",
    "X32n0616_005:0174c05_1": "△二頌行位不退又二初明不易信解二明信解則必發願故得不退。",
    "X32n0616_005:0174c07_2": "今初。",
    "X32n0616_005:0174c08_0": "其有諸菩薩無量劫行道聞我說壽命是則能信受。",
    "X32n0616_005:0174c09_0": "其有諸菩薩者約鈍根菩薩言也行道經無量劫善根淳熟方能信受根若未熟佛不為說設令聞之彼必疑惑故信解誠不易也今若利根初聞即能一念信解便可等彼久行菩薩亦且超過彼矣。",
    "X32n0616_005:0174c13_0": "△二明信解則必發願故得不退。",
    "X32n0616_005:0174c14_0": "如是之人等頂受此經典願我於未來長壽度眾生如今日世尊諸釋中之王道場師子吼說法無所畏我等未來世一切所尊敬坐於道場時說壽亦如是。",
    "X32n0616_005:0174c17_0": "如是之人等者雙指利鈍兩根言也聞而信解則必頂受發願所以決不退也問近成者無長可說何得皆言亦如是耶答言如是者謂說常壽若得常壽盡未來際必當過此何但如是今從實成已來故且舉爾許塵劫耳二頌行位不退竟。",
    "X32n0616_005:0174c21_1": "△三追頌相貌。",
    "X32n0616_005:0174c23_0": "若有深心者清淨而質直多聞能總持隨義解佛語如是之人等於此無有疑。",
    "X32n0616_005:0175a01_0": "長文直明乃至能生一念信解便即較顯功德今正釋出相貌以顯一念信解之難得也若欲于此佛壽長遠而無有疑不論久行始行須有深心又須清淨質直又須多聞總持能隨義解不隨文字具此三法方能一念信解則一念信解談何容易信解既不容易所以功德不得不多也深心者上求下化之心了知心佛眾生理元不二依之而起無作四弘故名深心即如來室也清淨而質直者不為五住所污正念真如即如來衣也多聞能總持隨義解佛語者隨有所聞便能總一切法持一切義便能解了如來隨智隨情等語故雖少聞多解義亦名為多聞即如來座也有此觀行三法乃能信解究竟三法既信究竟三法之理乃于究竟位中所有本迹之事亦無疑也初一念信解竟。",
    "X32n0616_005:0175a14_1": "△二解其言趣。",
    "X32n0616_005:0175a16_0": "又阿逸多若有聞佛壽命長遠解其言趣是人所得功德無有限量能起如來無上之慧。",
    "X32n0616_005:0175a18_0": "前但一念信解如人飲水冷煖自知今解其言趣便可略舉似人故能起自他無上之慧也。",
    "X32n0616_005:0175a19_1": "△三聞持供養。",
    "X32n0616_005:0175a21_0": "何況廣聞是經若教人聞若自持若教人持若自書若教人書若以華香瓔珞幢幡繒蓋香油蘇燈供養經卷是人功德無量無邊能生一切種智。",
    "X32n0616_005:0175a24_0": "廣聞廣持廣書廣修供養自行化他功德外資令內智疾入故能生一切種智也。",
    "X32n0616_005:0175b01_1": "△四深信觀成。",
    "X32n0616_005:0175b02_0": "阿逸多若善男子善女人聞我說壽命長遠深心信解則為見佛常在耆闍崛山共大菩薩諸聲聞眾圍遶說法又見此娑婆世界其地瑠璃坦然平正閻浮檀金以界八道寶樹行列諸臺樓觀皆悉寶成其菩薩眾咸處其中若有能如是觀者當知是為深信解相。",
    "X32n0616_005:0175b08_0": "見佛常在靈山共大菩薩諸聲聞眾說法者方便有餘土相也又見娑婆其地瑠璃乃至菩薩咸處其中者實報莊嚴土相也理具此相今依理修觀故觀成而相可見又見此相雖未真證以觀力故暫見二土若三惑分滅方永與相應也有餘土中有聲聞者藏通兩教二乘已斷通惑出生其中仍本為名實報土中純諸菩薩亦是他受用耳但依此觀漸深漸成入圓初住則任運徧見應用無方矣問稱理修觀但觀一念妙理即足何須約土以明深信解相答藏通初心皆滅陰入況能見士別教初心亦且破陰後心乃見帝網之土唯圓即觀一念三千三諦具足是則一心一切心一身一切身一土一切土一念俱觀若身心土若空假中更無前後故觀成時一心見一切心一身見一切身一土見一切土十方諸佛身中現故故於自心常寂光中徧見十方一切身土若但觀心而不觀具何異權乘若唯觀他遮那之土必迷自境若了心境則自即他故他即自故觀土既爾身佛心然故聞長壽須了宗旨所以本門聞壽益倍餘經良由所聞異常故也初明現在四信竟。",
    "X32n0616_005:0175c03_1": "△二明滅後五品二初列五品粗格量後四品功德二隨喜功德品廣格量初品功德廣格量已況出勝者可以意得佛不煩文巧說若此也初中二初長文二偈頌長文為五初直起隨喜心二加受持讀誦三加教人四加兼行六度五加正行六度。",
    "X32n0616_005:0175c08_2": "今初。",
    "X32n0616_005:0175c09_0": "又復如來滅後若聞是經而不毀訾起隨喜心當知已為深信解相。",
    "X32n0616_005:0175c11_0": "初品標人而已格量在後品說。",
    "X32n0616_005:0175c11_1": "△二加受持讀誦二初標人相二格量功德。",
    "X32n0616_005:0175c12_2": "今初。",
    "X32n0616_005:0175c13_0": "何況讀誦受持之者。",
    "X32n0616_005:0175c14_0": "△二格量功德。",
    "X32n0616_005:0175c15_0": "斯人則為頂戴如來阿逸多是善男子善女人不須為我復起塔寺及作僧坊以四事供養眾僧所以者何是善男子善女人受持讀誦是經典者為已起塔造立僧坊供養眾僧則為以佛舍利起七寶塔高廣漸小至於梵天懸諸幡蓋及眾寶鈴華香瓔珞末香塗香燒香眾鼓伎樂簫笛箜篌種種舞戲以妙音聲歌唄讚頌則為於無量千萬億劫作是供養已。",
    "X32n0616_005:0175c22_0": "不須為我復起塔寺等者初心恐被事緣紛動妨修正業故也則為以佛舍利等者指此經文所詮之理即是法身全身舍利能詮之文不異七寶高廣妙塔能所和合不二亦是第一義僧故直專持此經即為廣大供養廢事從理所益弘多若至後心理觀既熟則涉外不妨內觀事資於道如油多火猛順流揚帆又加櫓棹其勢轉疾也問若持經即是起塔乃至即是第一義僧不須起塔供僧者則持經亦即第一義戒不須復持戒耶答持經即順理戒任運不犯性罪亦自任運持得初篇二篇所謂乘急戒緩非全無戒也若至兼行六度則五篇七聚性業遮業悉皆清淨是乘戒俱急也又凡修圓觀者理須自思若初心念念常在四種三昧容於二篇之外所有遮罪或可少違若未專於四種三昧則五篇七聚菩薩重輕不可微犯方合一期教門大旨何以故出家菩薩具足堅持毗尼篇聚大乘戒意一切皆然況僅護篇聚於彼梵網八萬律儀猶未足為持相但因此土器劣且以小檢助成大儀仍須備曉開遮輕重制緣漸頓捨義有無坐次分流懺法天隔復有七眾同否大小共別方於自行量己品位去取適時勿慕大節而昧存亡勿據小文而迷觀道若得今意先以理教定次以行位驗倘不爾者鳥鼠人也安論品位乎敬請受佛遺言少分恭稟。",
    "X32n0616_005:0176a21_1": "△三加教人二初標人相二格量功德。",
    "X32n0616_005:0176a22_2": "今初。",
    "X32n0616_005:0176a23_0": "阿逸多若我滅後聞是經典有能受持若自書若教人書。",
    "X32n0616_005:0176b01_0": "△二格量功德。",
    "X32n0616_005:0176b02_0": "則為起立僧坊以赤栴檀作諸殿堂三十有二高八多羅樹高廣嚴好百千比丘於其中止園林浴池經行禪窟衣服飲食牀褥湯藥一切樂具充滿其中如是僧坊堂閣若干百千萬億其數無量以此現前供養於我及比丘僧是故我說如來滅後若有受持讀誦為他人說若自書若教人書供養經卷不須復起塔寺及造僧房供養眾僧。",
    "X32n0616_005:0176b09_0": "前但自己讀誦受持便為具足供養三寶況今轉以教人則法施功德寧非供養中最耶。",
    "X32n0616_005:0176b10_1": "△四加兼行六度二初標人相二格量功德。",
    "X32n0616_005:0176b11_2": "今初。",
    "X32n0616_005:0176b12_0": "況復有人能持是經兼行布施持戒忍辱精進一心智慧。",
    "X32n0616_005:0176b14_0": "圓觀漸深涉事不坊正行故以事助理名兼行也。",
    "X32n0616_005:0176b15_0": "△二格量功德。",
    "X32n0616_005:0176b16_0": "其德最勝無量無邊譬如虗空東西南北四維上下無量無邊是人功德亦復如是無量無邊疾至一切種智。",
    "X32n0616_005:0176b19_0": "△五加正行六度二初標人相二格量功德。",
    "X32n0616_005:0176b19_1": "今初。",
    "X32n0616_005:0176b21_0": "若人讀誦受持是經為他人說若自書若教人書復能起塔及造僧房供養讚歎聲聞眾僧亦以百千萬億讚歎之法讚歎菩薩功德又為他人種種因緣隨義解說此法華經(財法二施)復能清淨持戒與柔和者而共同止(如法持戒統理大眾)忍辱無瞋志念堅固(忍)常貴坐禪得諸深定(禪)精進勇猛攝諸善法(進)利根智慧善答問難(般若)。",
    "X32n0616_005:0176c04_0": "安樂行中不親近求聲聞人亦不說過亦不讚美今云供養讚歎聲聞眾僧何耶始心觀淺恐染小習故誡勿親近今觀深力大故供養讚歎于彼即能化彼令趣大乘又復彌助權實不二妙觀也文中先禪後進義無先後。",
    "X32n0616_005:0176c08_1": "△二格量功德。",
    "X32n0616_005:0176c09_0": "阿逸多若我滅後諸善男子善女人受持讀誦是經典者復有如是諸善功德當知是人已趣道場近阿耨多羅三藐三菩提坐道樹下阿逸多是善男子善女人若坐若立若行處此中便應起塔一切天人皆應供養如佛之塔。",
    "X32n0616_005:0176c14_0": "已趣道場坐道樹下者位在鐵輪不久得入銅輪能八相作佛也坐立行處便應起塔皆應供養如佛塔者初依人號如來也結此五品初三是聞慧第四是思慧第五是修慧都是十信前耳或云初隨喜品即是入信心位分一品為兩心五品即十信心是鐵輪六根清淨位也今謂兩釋理須並存若圓教利根一念隨喜初垢先落乃至正行塵沙亦盡即相似如來鐵輪位也若解雖圓頓事障未除僅能圓伏五住通惑種子尚存即觀行如來具縛凡夫能知如來秘密之藏也若以五品對前四信則初二品即一念信解第三品即解其言趣第四品即聞持供養第五品即深信觀成其義既齊四五無別但是滅後加讀誦位為第二品耳初長文竟。",
    "X32n0616_005:0177a03_1": "△二偈頌四初頌第二品(至)四頌第五品。",
    "X32n0616_005:0177a04_0": "今初。",
    "X32n0616_005:0177a05_0": "爾時世尊欲重宣此義而說偈言。",
    "X32n0616_005:0177a06_0": "若我滅度後能奉持此經斯人福無量如上之所說是則為具足一切諸供養以舍利起塔七寶而莊嚴表剎甚高廣漸小至梵天寶鈴千萬億風動出妙音又於無量劫而供養此塔華香諸瓔珞天衣眾伎樂然香油蘇燈周帀常照明惡世法末時能持是經者則為已如上具足諸供養。",
    "X32n0616_005:0177a12_0": "△二頌第三品。",
    "X32n0616_005:0177a13_0": "若能持此經則如佛現在以牛頭栴檀起僧房供養堂有三十二高八多羅樹上饌妙衣服牀臥皆具足百千眾住處園林諸浴池經行及禪窟種種皆嚴好。",
    "X32n0616_005:0177a16_0": "△三頌第四品。",
    "X32n0616_005:0177a17_0": "若有信解心受持讀誦者若復教人書及供養經卷散華香末香以須曼薝蔔阿提目多伽熏油常然之如是供養者得無量功德如虗空無邊其福亦如是。",
    "X32n0616_005:0177a20_0": "長行但云兼行布施等今頌供養經卷即兼行之意也須曼華此云善攝意華薝蔔華此云黃華阿提目多伽華此云龍舐華又云善思夷華。",
    "X32n0616_005:0177a22_1": "△四頌第五品。",
    "X32n0616_005:0177a24_0": "況復持此經兼布施持戒忍辱樂禪定不瞋不惡口恭敬於塔廟謙下諸比丘遠離自高心常思惟智慧有問難不瞋隨問為解說若能行是行功德不可量若見此法師成就如是德應以天華散天衣覆其身頭面接足禮生心如佛想又應作是念不久詣道樹得無漏無為廣利諸人天其所住止處經行若坐臥乃至說一偈是中應起塔莊嚴令妙好種種以供養佛子住此地則是佛受用常在於其中經行及坐臥。",
    "X32n0616_005:0177b08_0": "初列五品粗格量後四品功德竟。",
    "X32n0616_005:0177b09_0": "妙法蓮華經台宗會義卷五之三"
}