{
    "X36n0659_022:0639c01_0": "南本大般涅槃經會疏卷第二十二",
    "X36n0659_022:0639c03_0": "涅槃經疏卷第十",
    "X36n0659_022:0639c04_0": "頂法師　撰",
    "X36n0659_022:0639c05_0": "天台沙門湛然再治",
    "X36n0659_022:0639c06_0-0": "大般涅槃經高貴德王菩薩品之四(卷第二十二)北涼　天竺三藏　曇無讖　譯晉　沙門　慧嚴　慧觀　謝靈運　重治德王品之四起卷明第二功德他釋十功德各各論體謂初功德以五事為體今此功德以五通為體今云不爾此文云以得大涅槃威神力故當知十功德皆以涅槃而為其體隨事分別種種不同體應根本豈從枝末而言十德五通者皆約無分別中而論分別若十若五舊云初功德深第二德淺此不應爾上以四句開拓人謂為深此中直說人謂為淺若欲開此為四句者不得得得不得不得不得得得餘章亦爾何淺之有(云云)",
    "X36n0659_022:0639c06_0-1": "舊云大乘異小唯佛乃具漏盡菩薩乃是因人故但五通不說漏盡此乃一往以因讓果若具足論唯佛世尊有真天眼不以二相見諸佛國他心宿命究竟在佛菩薩既其分得五通何以不云分得無漏今此文中雖列五章六通意足舊用不得而得是總標五通今云不爾不得得者得大涅槃大涅槃者中道佛性非漏非無漏之無漏故文中非外道即非漏非二乘即非無漏而言得大涅槃即非漏非無漏之無漏釋云所謂神通者不如小乘十八變化之神通神名天心通名慧性天然之慧即是中道無二邊漏名大涅槃指此而為無漏通也私謂驗此十德皆證初文既有知於祕藏豈有不能分證六通故知德文皆悉互通為辨不別而別故十相不同別而不別同一涅槃是故對地亦應無失況復十地義通圓別別而不別圓義也不別而別別義也若依此意以此十德中之法門一一皆挾十地帶圓法門作通別釋彌益其美此則與經部會與五時會與諸教會與逗機會就文為四初標次列章門三解釋四結。",
    "X36n0659_022:0640a15_0": "復次善男子云何菩薩摩訶薩修大涅槃成就具足第二功德。",
    "X36n0659_022:0640a17_0": "善男子菩薩摩訶薩修大涅槃昔所不得而今得之昔所不見而今見之昔所不聞而今聞之昔所不至而今得至昔所不知而今知之。",
    "X36n0659_022:0640a20_0": "二列六名既異小乘當知六通不與彼共文中解釋一一簡出列名雖異今指此文亦名六通不得而得即漏盡通不聞而聞即天耳通不見而見即天眼通不至而至即如意通不知而知即他心宿命二通。",
    "X36n0659_022:0640b01_0": "三解釋文即為五然列章與解釋小不次第緣宜不同是故爾耳就初不得得章為三一標二簡顯三結。",
    "X36n0659_022:0640b04_0": "云何名為昔所不得而今得之所謂神通昔所不得而今乃得。",
    "X36n0659_022:0640b06_0": "標者即標神通神是大涅槃天然之理此理融通自在無礙故稱神通其名雖同其理永別故簡除凡小顯出中道圓具自在故知漏盡方名神通。",
    "X36n0659_022:0640b09_0": "從通有二種去是簡顯即為二標釋。",
    "X36n0659_022:0640b10_0": "通有二種一者內二者外。",
    "X36n0659_022:0640b11_0": "釋中二一簡非二顯是。",
    "X36n0659_022:0640b12_0": "所言外者與外道共內復有二一者二乘二者菩薩菩薩修行大涅槃經所得神通不與聲聞辟支佛共云何名為不與聲聞辟支佛共二乘所作神通變化一心作一不得眾多。",
    "X36n0659_022:0640b16_0": "初簡非中即簡出外道二乘如文。",
    "X36n0659_022:0640b17_0": "顯是為兩一明一心中神通圓滿具足如文。",
    "X36n0659_022:0640b18_0": "菩薩不爾於一心中則能具足現五趣身所以者何以得如是大涅槃經威神力故是則名為昔所不得而今得之。",
    "X36n0659_022:0640b21_0": "二顯身心自在具足就其體圓自在明其用妙就自在文又二先簡出不自在。",
    "X36n0659_022:0640b23_0": "又復云何昔所不得而今得之所謂身得自在心得自在何以故一切凡夫所有身心不得自在或心隨身或身隨心云何名為心隨於身譬如醉人酒在身中爾時身動心亦隨動亦如身嬾心亦隨嬾是則名為心隨於身又如嬰兒其身穉小心亦隨小大人身大心亦隨大又如有人身體麤澀心常思念欲得膏油潤漬令耎是則名為心隨於身云何名為身隨於心所謂去來坐臥修行施戒忍辱精進愁惱之人身則羸悴歡喜之人身則肥悅恐怖之人身體戰動專心聽法身則怡懌悲苦之人涕淚橫流是則名為身隨於心。",
    "X36n0659_022:0640c10_0": "次明自在。",
    "X36n0659_022:0640c11_0": "菩薩不爾於身心中俱得自在。",
    "X36n0659_022:0640c12_0": "第三結文可解。",
    "X36n0659_022:0640c13_0": "是則名為昔所不得而今得之。",
    "X36n0659_022:0640c14_0": "復次所現身相下二釋不至至章門即是身通文為三一明遠到。",
    "X36n0659_022:0640c16_0": "復次善男子菩薩摩訶薩所現身相猶如微塵以此微身悉能徧至無量無邊恒河沙等諸佛世界無所障閡而心常定初不移動是則名為心不隨身是亦名為昔所不至而今能至。",
    "X36n0659_022:0641a02_0": "二簡異二乘。",
    "X36n0659_022:0641a03_0": "何故復名昔所不至而今能至一切聲聞辟支佛等所不能至菩薩能至是故名為昔所不至而今能至一切聲聞辟支佛等雖以神通不能變身如細微塵徧至無量恒河沙等諸佛世界聲聞緣覺身若動時心亦隨動菩薩不爾心雖不動身無不至是名菩薩心不隨身復次善男子菩薩化身猶如三千大千世界以此大身入一塵身其心爾時亦不隨小聲聞緣覺雖能化身令如三千大千世界而不能以如此大身入微塵身於此事中尚自不能況能令心而不隨動是名菩薩心不隨身。",
    "X36n0659_022:0641a13_0": "三明自在如文。",
    "X36n0659_022:0641a14_0": "復次善男子菩薩摩訶薩以一音聲能令三千大千世界眾生悉聞心終不念令是音聲徧諸世界使諸眾生昔所不聞而今得聞而是菩薩亦初不言我令眾生昔所不聞而今得聞菩薩若言因我說法令諸眾生不聞聞者當知是人終不能得阿耨多羅三藐三菩提何以故眾生不聞我為說者如此之心是生死心一切菩薩是心已盡以是義故菩薩摩訶薩所有身心不相隨逐善男子一切凡夫身心相隨菩薩不爾為化眾生故雖現身小心亦不小何以故諸菩薩等所有心性常廣大故雖現大身心亦不大云何大身身如三千大千世界云何小心行嬰兒行以是義故心不隨身菩薩已於無量阿僧祇劫遠酒不飲而心亦動心無悲苦身亦流淚實無恐怖身亦戰慄以是義故當知菩薩身心自在不相隨逐菩薩摩訶薩唯現一身而諸眾生各各見異。",
    "X36n0659_022:0641b05_0": "復次善男子下三釋不聞而聞即是天耳通文為二初釋次論義釋文為四一修二得三簡四無著前二如文。",
    "X36n0659_022:0641b08_0": "善男子云何菩薩摩訶薩修大涅槃昔所不聞而今得聞菩薩摩訶薩先取聲相所謂象聲馬聲車聲人聲貝鼓簫笛歌器等聲而修習之。",
    "X36n0659_022:0641b11_0": "以修習故能聞無量三千大千世界所有地獄音聲。",
    "X36n0659_022:0641b12_0": "復轉修習得異耳根異於聲聞緣覺天耳何以故二乘所得清淨耳通若依初禪淨妙四大唯聞初禪不聞二禪乃至四禪亦復如是雖能一時聞于三千大千世界所有音聲而不能聞無量無邊恒河沙等世界音聲以是義故菩薩所得異於聲聞緣覺耳根以是異故昔所不聞而今得聞。",
    "X36n0659_022:0641b18_0": "第三文中云復轉修習得異耳根者明其修得皆異小外轉修即是大涅槃心無礙自在之修又雖聞音聲無音聲相是名轉修得異耳根者不與小共。",
    "X36n0659_022:0641b22_0": "雖聞音聲而心初無聞聲之相不作有相常相樂相我相淨相主相依相作相因相定相果相以是義故諸菩薩等昔所不聞而今得聞。",
    "X36n0659_022:0641c01_0": "第四無著中云主相依相者不同外道陀驃求那不作果相等者不以禪定為因神通為果簡異於小餘文可見。",
    "X36n0659_022:0641c04_0": "爾時光明下第二論義有二番問答初問為兩一領旨仰非。",
    "X36n0659_022:0641c06_0": "爾時光明徧照高貴德王菩薩言如佛所說不作定相不作果相是義不然。",
    "X36n0659_022:0641c08_0": "何以故下作兩難一難善聲。",
    "X36n0659_022:0641c09_0": "何以故如來上說若人聞是大涅槃經一句一字必定得成阿耨多羅三藐三菩提如來於今復言無定無果若得阿耨多羅三藐三菩提即是定相即是果相云何而言無定無果。",
    "X36n0659_022:0641c13_0": "二難惡聲皆作定難。",
    "X36n0659_022:0641c14_0": "聞惡聲故則生惡心生惡心故則至三塗若至三塗則是定果云何而言無定無果。",
    "X36n0659_022:0641c16_0": "佛答為二初歎問次正答。",
    "X36n0659_022:0641c17_0": "爾時如來讚言善哉善哉善男子能作是問。",
    "X36n0659_022:0641c18_0": "答又二初總答次別答就初總復二初皆不定次復明定還是不定中之定初有二重皆先法次舉譬後結。",
    "X36n0659_022:0642a03_0": "若使諸佛說諸音聲有定果相者則非諸佛世尊之相是魔王相生死之相遠涅槃相何以故一切諸佛凡所演說無定果相。",
    "X36n0659_022:0642a06_0": "善男子譬如刀中照人面像豎則見長橫則見廣若有定相云何而得豎則見長橫則見廣。",
    "X36n0659_022:0642a08_0": "以是義故諸佛世尊凡所演說無定果相。",
    "X36n0659_022:0642a09_0": "善男子夫涅槃者實非聲果若使涅槃是聲果者當知涅槃非是常法。",
    "X36n0659_022:0642a11_0": "善男子譬如世間從因生法有因則有果無因則無果因無常故果亦無常所以者何因亦作果果亦作因以是義故一切諸法無有定相若使涅槃從因生者因無常故果亦無常而是涅槃不從因生體非是果是故為常。",
    "X36n0659_022:0642a16_0": "善男子以是義故涅槃之體無定無果。",
    "X36n0659_022:0642a17_0": "善男子夫涅槃者亦可言定亦可言果云何為定一切諸佛所有涅槃常樂我淨是故為定無生老壞是故為定一闡提等犯四重禁誹謗方等作五逆罪捨除本心必定得故是故為定。",
    "X36n0659_022:0642a21_0": "次如汝言下別答為兩初答善聲。",
    "X36n0659_022:0642a22_0": "善男子如汝所言若人聞我說大涅槃一字一句得阿耨多羅三藐三菩提者汝於是義猶未解了汝今諦聽吾當為汝更分別說善男子若有善男子善女人聞大涅槃一字一句不作字相不作句相不作聞相不作佛相不作說相如是義者名無相相以無相相故得阿耨多羅三藐三菩提。",
    "X36n0659_022:0642b04_0": "次答惡聲。",
    "X36n0659_022:0642b05_0": "善男子如汝所言聞惡聲故至三塗者是義不然何以故非以惡聲而至三塗當知是果乃是惡心所以者何有善男子善女人等雖聞惡聲心不生惡是故當知非因惡聲生三趣中而諸眾生因煩惱結惡心滋多生三惡趣非因惡聲若聲有定相諸有聞者一切悉應生於惡心或有生者有不生者是故當知聲無定相以無定相雖復因之不生惡心。",
    "X36n0659_022:0642b12_0": "欲明原由惡心不關惡聲。",
    "X36n0659_022:0642b13_0": "世尊聲若無定下第二番問答先問次答如文。",
    "X36n0659_022:0642b14_0": "世尊聲若無定云何菩薩昔所不聞而今得聞。",
    "X36n0659_022:0642b15_0": "善男子聲無定相昔所不聞令諸菩薩而今得聞以是義故我作是說昔所不聞而今得聞。",
    "X36n0659_022:0642b17_0": "善男子下四釋不見而見是天眼通文為六一修二得三簡四不著五明異知六結。",
    "X36n0659_022:0642b19_0": "善男子云何昔所不見而今得見菩薩摩訶薩修大涅槃微妙經典先取明相所謂日月星宿庭燎燈燭珠火之明藥草等光。",
    "X36n0659_022:0642b22_0": "以修習故得異眼根。",
    "X36n0659_022:0642b23_0": "異於聲聞緣覺所得云何為異二乘所得清淨天眼若依欲界四大眼根不見初禪若依初禪不見上地乃至自眼猶不能見若欲多見極至三千大千世界菩薩摩訶薩不修天眼見妙色身悉是骨相。",
    "X36n0659_022:0642c03_0": "雖見他方恒河沙等世界色相不作色相不作常相有相物相名字等相作因緣相不作見相不言是眼微妙淨相唯見因緣非因緣相云何因緣色是眼緣若使是色非因緣者一切凡夫不應生於見色之相以是義故色名因緣非因緣者菩薩摩訶薩雖復見色不生色相是故非緣以是義故菩薩所得清淨天眼異於聲聞緣覺所得以是異故一時徧見十方世界現在諸佛是名菩薩昔所不見而今得見以是異故能見微塵聲聞緣覺所不能見以是異故雖見自眼初無見相見無常相見凡夫身三十六物不淨充滿如於掌中觀阿摩勒果以是義故昔所不見而今得見。",
    "X36n0659_022:0642c15_0": "若見眾生所有色相則知其人大小乘根一觸衣故亦知是人善惡諸根差別之相以是義故昔所不知而今得知以一見故昔所不知而今得知。",
    "X36n0659_022:0642c18_0": "此有數番明知非是後知乃借知明見。",
    "X36n0659_022:0643a01_0": "以此知故昔所不見而今得見。",
    "X36n0659_022:0643a02_0": "後結文乃借天眼文助結以不共故。",
    "X36n0659_022:0643a03_0": "善男子云何下五釋不知而知即是他心宿命兩通文為四一知他心二知宿命三重明他心四以是義故下結初他心又二先知他心。",
    "X36n0659_022:0643a06_0": "善男子云何菩薩昔所不知而今得知菩薩摩訶薩雖知凡夫貪恚癡心初不作心及心數相不作眾生及以物相修第一義畢竟空相何以故一切菩薩常善修習空性相故以修空故昔所不知而今得知云何為知知無有我無有我所。",
    "X36n0659_022:0643a11_0": "次知佛性(云云)。",
    "X36n0659_022:0643a12_0": "知諸眾生皆有佛性以佛性故一闡提等捨離本心悉當得成阿耨多羅三藐三菩提如此皆是聲聞緣覺所不能知菩薩能知以是義故昔所不知而今得知。",
    "X36n0659_022:0643a16_0": "復次下二明知宿命又二初正明宿命。",
    "X36n0659_022:0643a17_0": "復次善男子云何昔所不知而今得知菩薩摩訶薩修大涅槃微妙經典念過去世一切眾生所生種姓父母兄弟妻子眷屬知識怨憎。",
    "X36n0659_022:0643a20_0": "次念過去簡異準前可知略不具說也。",
    "X36n0659_022:0643a21_0": "於一念中得殊異智異於聲聞緣覺智慧云何為異聲聞緣覺所有智慧念過去世所有眾生種姓父母乃至怨憎而作種姓至怨憎相菩薩不爾雖念過去種姓父母乃至怨憎終不生於種姓父母怨憎等相常作法相空寂之相是名菩薩昔所不知而今得知。",
    "X36n0659_022:0643b02_0": "復次云何下三重釋他心又二先橫知六道。",
    "X36n0659_022:0643b03_0": "復次善男子云何昔所不知而今得知菩薩摩訶薩修大涅槃微妙經典得他心智異於聲聞緣覺所得云何為異聲聞緣覺以一念智知人心時則不能知地獄畜生餓鬼天心菩薩不爾於一念中徧知六趣眾生之心是名菩薩昔所不知而今得知。",
    "X36n0659_022:0643b08_0": "次豎知十六心。",
    "X36n0659_022:0643b09_0": "復次善男子復有異知菩薩摩訶薩於一心中知須陀洹初心次第至十六心。",
    "X36n0659_022:0643b11_0": "此文明十六心扶順數義論云見道無量心此心疾利名無間心成論云聲聞欲知第三心乃見十六心緣覺欲知第三心乃見第七心唯菩薩能備知小乘根鈍欲知第三心來去併欲知後諸心比欲知已至第十六心中乘人小利欲知第三心去得知第七心菩薩不爾併知逐之無有一心而不知者此乃是三乘共義而有三人不同而同此十六心非今經意前知六道是知有邊次十六心是知無邊以非有非無中道之體能知有無。",
    "X36n0659_022:0643b20_0": "以是義故昔所不知而今得知。",
    "X36n0659_022:0643b21_0": "是為菩薩修大涅槃具足成就第二功德。",
    "X36n0659_022:0643b22_0": "復次下明第三功德舊云此中明慈成上梵行品(云云)於中先標次釋。",
    "X36n0659_022:0643b24_0": "復次善男子云何菩薩摩訶薩修大涅槃成就具足第三功德。",
    "X36n0659_022:0643c02_0": "釋中二先釋次結初釋中意者然此中功德應具明四心而偏明慈者一云特是文略義應具有二云慈尚是一切善法根本何意不得即是三心捨偏得圓舉一知三略不說之釋文為二先唱捨得二章門次釋。",
    "X36n0659_022:0643c07_0": "善男子菩薩摩訶薩修大涅槃捨慈得慈得慈之時不從因緣。",
    "X36n0659_022:0643c09_0": "釋中先徵起次釋。",
    "X36n0659_022:0643c10_0": "云何名為捨慈得慈。",
    "X36n0659_022:0643c11_0": "釋中凡有五番初約二諦。",
    "X36n0659_022:0643c12_0": "善男子慈名世諦菩薩摩訶薩捨世諦慈得第一義慈第一義慈不從緣得。",
    "X36n0659_022:0643c14_0": "次約凡聖。",
    "X36n0659_022:0643c15_0": "復次云何捨慈得慈慈若可捨名凡夫慈慈若可得即名菩薩無緣之慈。",
    "X36n0659_022:0643c17_0": "三約闡提對如來即是善惡。",
    "X36n0659_022:0643c18_0": "捨一闡提慈犯重禁慈謗方等慈作五逆慈得憐憫慈得如來慈世尊之慈無因緣慈。",
    "X36n0659_022:0644a02_0": "四約卑鄙對菩薩即是勝劣。",
    "X36n0659_022:0644a03_0": "云何復名捨慈得慈捨黃門慈無根二根女人之慈屠膾獵師畜養雞豬如是等慈亦捨聲聞辟支佛慈得諸菩薩無緣之慈。",
    "X36n0659_022:0644a06_0": "五無著。",
    "X36n0659_022:0644a07_0": "不見己慈不見他慈不見持戒不見破戒雖自見悲不見眾生雖有苦受不見受者何以故以修第一真實義故。",
    "X36n0659_022:0644a10_0": "次結如文。",
    "X36n0659_022:0644a11_0": "是名菩薩修大涅槃成就具足第三功德。",
    "X36n0659_022:0644a12_0": "次明第四功德文為二初明功德次論義初為四初標次列章門三解釋四結。",
    "X36n0659_022:0644a14_0": "復次善男子云何菩薩摩訶薩修大涅槃成就具足第四功德。",
    "X36n0659_022:0644a16_0": "善男子菩薩摩訶薩修大涅槃成就具足第四功德有十事何等為十一者根深難可傾拔二者自身生決定想三者不觀福田及非福田四者修淨佛土五者滅除有餘六者斷除業緣七者修清淨身八者了知諸緣九者離諸怨歒十者斷除二邊。",
    "X36n0659_022:0644a21_0": "冶城云前兩是地前後八配八地前言根深即性地亦是生空決定心入初依亦是法空後八初不觀福田即初地檀滿第十斷除二邊即八地是義不然今竝是真證功德。",
    "X36n0659_022:0644b01_0": "云何根深下第三解釋文中第五第六合為一釋釋初章文為三標釋結。",
    "X36n0659_022:0644b03_0": "云何根深難可傾拔。",
    "X36n0659_022:0644b04_0": "初事中具足五義一根本二根深三根廣四根長五根勝不放逸即是根本。",
    "X36n0659_022:0644b06_0": "所言根者名不放逸。",
    "X36n0659_022:0644b07_0": "若通途行善皆不放逸若別論者以初撿心為不放逸具此兩意以為根本。",
    "X36n0659_022:0644b09_0": "次阿耨三菩提根者即是根深。",
    "X36n0659_022:0644b10_0": "不放逸者為是何根所謂阿耨多羅三藐三菩提根。",
    "X36n0659_022:0644b11_0": "深窮實相到際即真是菩提根故言深也。",
    "X36n0659_022:0644b12_0": "一切諸佛諸善根本皆不放逸即是根廣。",
    "X36n0659_022:0644b13_0": "善男子一切諸佛諸善根本皆不放逸。",
    "X36n0659_022:0644b14_0": "以能增長即是根長。",
    "X36n0659_022:0644b15_0": "不放逸故諸餘善根展轉增長。",
    "X36n0659_022:0644b16_0": "諸善中勝即是根勝。",
    "X36n0659_022:0644b17_0": "以能增長諸善根故於諸善中最為殊勝善男子如諸迹中象迹為上不放逸法亦復如是於諸善法最為殊勝善男子如諸明中日光為最不放逸法亦復如是於諸善法最為殊勝善男子如諸王中轉輪聖王為最第一不放逸法亦復如是於諸善法為最第一善男子如諸流中四河為最不放逸法亦復如是於諸善法為上為最善男子如諸山中須彌山王為最第一不放逸法亦復如是於諸善法為最第一善男子如水生華中青蓮為最不放逸法亦復如是於諸善法為最為上善男子如陸生華中婆利師華為最為上不放逸法亦復如是於諸善法為最為上善男子如諸獸中師子為最不放逸法亦復如是於諸善法為最為上善男子如飛鳥中金翅鳥王為最為上不放逸法亦復如是於諸善法為最為上善男子如大身中羅睺阿脩羅王為最為上不放逸法亦復如是於諸善法為最為上善男子如一切眾生若二足四足多足無足中如來為最不放逸法亦復如是於善法中為最為上善男子如諸眾中佛僧為上不放逸法亦復如是於善法中為最為上善男子如佛法中大涅槃法為最為上不放逸法亦復如是於諸善法為最為上善男子以是義故不放逸根深固難拔。",
    "X36n0659_022:0644c15_0": "凡舉十三譬譬其勝相。",
    "X36n0659_022:0644c16_0": "云何不放逸下凡舉十根重釋根長。",
    "X36n0659_022:0644c17_0": "云何不放逸故而得增長所謂信根戒根施根慧根忍根聞根進根念根定根善知識根如是諸根不放逸故而得增長以增長故深固難拔。",
    "X36n0659_022:0645a02_0": "具此十義深固難拔私謂長勝既以多義解釋驗三亦然餘四皆十皆十三。",
    "X36n0659_022:0645a04_0": "以是義故名為菩薩摩訶薩修大涅槃根深難拔。",
    "X36n0659_022:0645a05_0": "云何於身下釋第二章門文為三標釋結。",
    "X36n0659_022:0645a06_0": "云何於身作決定想。",
    "X36n0659_022:0645a07_0": "標如文。",
    "X36n0659_022:0645a08_0": "釋為二一定身二定心。",
    "X36n0659_022:0645a09_0": "於自身所生決定心我今此身於未來世定當為阿耨多羅三藐三菩提器。",
    "X36n0659_022:0645a11_0": "初定身中觀身是有是生死器觀身是無是涅槃器今觀身非有非無正顯中道即三菩提器名身決定。",
    "X36n0659_022:0645a14_0": "心亦如是不作陿小不作變易不作聲聞辟支佛心不作魔心及自樂心樂生死心常為眾生求慈悲心是名菩薩於自身中生決定心我於來世當為阿耨多羅三藐三菩提器。",
    "X36n0659_022:0645a18_0": "次心亦如是若狹小者即自為心變易二義若論修因生滅無常名為變易若論受果變易生死名為變易聲聞支佛從人標心此屬無為邊魔心即魔天自樂心通諸天樂生死心通三界此三心是有邊非決定求慈慈於無求悲悲於有是為決定。",
    "X36n0659_022:0645a23_0": "以是義故菩薩摩訶薩修大涅槃於自身中生決定想。",
    "X36n0659_022:0645b01_0": "云何不觀福田下釋第三章文為三標釋結。",
    "X36n0659_022:0645b02_0": "云何菩薩不觀福田及非福田。",
    "X36n0659_022:0645b03_0": "云何福田外道持戒上至諸佛是名福田若有念言如是等輩是真福田當知是心則為陋劣菩薩摩訶薩悉觀一切無量眾生無非福田何以故以善修習異念處故有異念處善修習者觀諸眾生無有持戒及以毀戒常觀諸佛世尊所說施雖四種俱得淨報何等為四一者施主清淨受者不淨二者施主不淨受者清淨三者施受俱淨四者二俱不淨云何施淨受者不淨施主具有戒聞智慧知有慧施及以果報受者破戒專著邪見無施無報是名施淨受者不淨云何名為受者清淨施主不淨施主破戒專著邪見言無慧施及以果報受者持戒多聞智慧知有慧施及施果報是名施主不淨受者清淨云何名為施受俱淨施者受者俱有持戒多聞智慧知有慧施及施果報是名施受二俱清淨云何名為二俱不淨施者受者破戒邪見言無有施及施果報若如是者云何復言得淨果報以無施無報故名為淨善男子若有不見施及施報當知是人不名破戒專著邪見若依聲聞言不見施及施果報是則名為破戒邪見若依如是大涅槃經不見慧施及施果報是則名為持戒正見菩薩摩訶薩有異念處以修習故不見眾生持戒破戒施者受者及施果報是故得名持戒正見。",
    "X36n0659_022:0645b24_0": "上四依品匡持佛法須簡持犯此中自修宜用平等又前誡出家令遵戒行今誡在家修亡相檀異念處者異於二邊正觀中道持戒外道者非但持戒又得上定下文云施斷結外道勝持戒比丘持戒比丘止伏欲界惡比之言勝施雖四種俱得淨報者以無施無報乃為淨報。",
    "X36n0659_022:0645c06_0": "以是義故菩薩摩訶薩不觀福田及非福田。",
    "X36n0659_022:0645c07_0": "云何淨佛土下釋第四章文亦三標釋結。",
    "X36n0659_022:0645c08_0": "云何名為淨佛國土。",
    "X36n0659_022:0645c09_0": "標如文。",
    "X36n0659_022:0645c10_0-0": "菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故離殺害心以此善根願與一切眾生共之願諸眾生得壽命長有大勢力獲大神通以是誓願因緣力故於未來世成佛之時國土所有一切眾生得壽命長有大勢力獲大神通復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故離偷盜心以此善根願與一切眾生共之願諸佛國土地所有純是七寶眾生富足所欲自恣以此誓願因緣力故於未來世成佛之時所得國土純是七寶眾生富足所欲自恣復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故離淫欲心以此善根願與一切眾生共之願諸佛土所有眾生無有貪欲瞋恚癡心亦無饑渴苦惱之患以是誓願因緣力故於未來世成佛之時國土眾生遠離貪淫瞋恚癡心一切無有饑渴苦惱復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故離妄語心以此善根願與一切眾生共之願諸佛土常有華果茂林香樹所有眾生得妙音聲以是誓願因緣力故於未來世成佛之時所有國土常有華果茂林香樹其中眾生悉得清淨上妙音聲復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故遠離兩舌以此善根願與一切眾生共之願諸佛土所有眾生常共和合講說正法以是誓願因緣力故成佛之時國土所有一切眾生悉共和合講論法要復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故遠離惡口以此善根願與一切眾生共之願諸佛土地平如掌無有砂石荊棘惡刺所有眾生其心平等以是誓願因緣力故於未來世成佛之時所有國土地平如掌無有砂石荊棘惡刺所有眾生其心平等復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故離無義語以此善根願與一切眾生共之願諸佛土所有眾生無有苦惱以是誓願因緣力故於未來世成佛之時國土所有一切眾生無有苦惱復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故遠離貪嫉以此善根願與一切眾生共之願諸佛土一切眾生無有貪嫉惱害邪見以是誓願因緣力故於未來世成佛之時國土所有一切眾生悉無貪嫉惱害邪見復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故遠離惱害以此善根願與一切眾生共之願諸佛土所有眾生悉共修習大慈大悲得一子地以是誓願因緣力故於未來世成佛之時世界所有一切眾生悉共修習大慈大悲得一子地復次善男子菩薩摩訶薩修大涅槃微妙經典為阿耨多羅三藐三菩提度眾生故遠離邪見以此善根願與一切眾生共之願諸國土所有眾生悉得摩訶般若波羅蜜以是誓願因緣力故於未來世成佛之時世界眾生悉得受持摩訶般若波羅蜜。",
    "X36n0659_022:0646b12_0": "釋中但淨土業菩提為本此中十善者非直十善與菩提心和合而行例如上答無畏之問然十善者明相似因得相似果離妄語得華果者明妄無實如華無果今不妄語有實果報受報之時感好華果。",
    "X36n0659_022:0646b17_0": "是名菩薩修淨佛土。",
    "X36n0659_022:0646b18_0": "云何滅除下合釋第五第六兩章義勢相關合為一釋解者不同一云此中開章明三種有餘初兩事釋第五滅除有餘後一事釋第六斷除業緣二云煩惱餘報釋滅除有餘餘業釋上斷除業緣餘有一事但是剩出就文為三先唱三章門二次第釋三結。",
    "X36n0659_022:0646b24_0": "云何菩薩摩訶薩滅除有餘有餘有三一者煩惱餘報二者餘業三者餘有。",
    "X36n0659_022:0646c02_0": "二釋三章中初釋煩惱。",
    "X36n0659_022:0646c03_0": "善男子云何名為煩惱餘報若有眾生習近貪欲是報熟時墮於地獄從地獄出受畜生身所謂鴿雀鴛鴦鸚鵡耆婆耆婆舍利伽鳥青雀魚鼈獼猴麞鹿若得人身受黃門形女人二根無根[泳-永+(瑤-王)]女若得出家犯初重戒是名餘報復次善男子若有眾生以殷重心習近瞋恚是報熟時墮於地獄從地獄出受畜生身所謂毒蛇具四種毒見毒觸毒齧毒歔毒師子虎狼熊罷貓貍鷹鷂之屬若得人身具足十二諸惡律儀若得出家犯第二重戒是名餘報復次善男子若有修習愚癡之人是報熟故墮於地獄從地獄出受畜生身所謂象豬牛羊水牛蚤蝨蟁蝱螘子等形若得人身聾盲瘖瘂癃殘背傴諸根不具不能受法若得出家諸根闇鈍喜犯重戒乃至五錢是名餘報復次善男子若有修習憍慢之人是報熟故墮於地獄從地獄出受畜生身所謂糞蟲駝驢犬馬若生人中受奴婢身貧窮乞匃或得出家常為眾生之所輕賤破第四戒是名餘報如是等名煩惱餘報如是餘報菩薩摩訶薩以能修習大涅槃故悉得除滅。",
    "X36n0659_022:0646c21_0": "若以習報分門則習因為煩惱報因為業今分習報之異故言煩惱餘報然感報由業煩惱但能滋潤此業若大論中只任煩惱亦能得報。",
    "X36n0659_022:0646c24_0": "云何餘業下第二釋上除業緣。",
    "X36n0659_022:0647a01_0": "云何餘業謂一切凡夫業一切聲聞業須陀洹人受七有業斯陀含人受二有業阿那含人受色有業是名餘業如是餘業菩薩摩訶薩以能修習大涅槃故悉得除斷。",
    "X36n0659_022:0647a05_0": "總明凡夫與二乘業言須陀洹人受七有業者然須陀洹人雖斷見盡猶有思惟潤生人天七人七天往還合數只是七有往還離數即十四有斯陀含人受二有業者斯陀含人但人天中各有一生此則兩生離數若合數者只是一有問何故初果合數二果離耶解云只是互現阿那含人受色有業者阿那含人斷欲界思盡餘色惑在故云受色有業然那含有五種但出一上流者上流有二一者至阿迦尼吒二至無色所以經云樂論義者生五淨居樂禪定者生無色界然生尼吒即徧歷四禪若於初禪不得滅者復生二禪二禪不滅生第三禪三禪不滅復生第四禪方滅於中復三超半超徧沒若生無色名無色般(云云)若生無色即不更生亦生即滅不同色界四禪受生故略不云受無色業只云受色業中不生故亦云有行無行生同於色故亦不云。",
    "X36n0659_022:0647a21_0": "云何餘有下第三釋上除有。",
    "X36n0659_022:0647a22_0": "云何餘有阿羅漢得阿羅漢果辟支佛得辟支佛果無業無結而轉二果是名餘有。",
    "X36n0659_022:0647a24_0": "無業無結而轉二果者莊嚴云羅漢轉為六地菩薩支佛轉為七地菩薩故言而轉二果今明此乃通教之義非釋今經開善云無此事轉者本是鈍根羅漢轉為利根支佛亦爾數習故轉為二果今明還是二乘全非今經河西云上句二果得道得向轉羅漢向得羅漢果支佛亦然文中自云得及果者豈可不作此釋今明還是二乘之義非今經意又一解云煩惱因盡果報亦亡而今不滅者只是輪轉餘勢然業既除唯此二果於菩薩為累是故言轉轉即是捨還是他義不關今經興皇云轉二果者二乘果身有寒熱饑渴此果得除故言轉二果亦小乘義今明此果不生任盡則止何用因經轉之答三界果雖盡界外果方生言轉果者轉界外果今明此是別教義亦非圓意。",
    "X36n0659_022:0647b14_0": "如是三種有餘之法菩薩摩訶薩修習大乘大涅槃經故得除滅是名菩薩摩訶薩滅除有餘。",
    "X36n0659_022:0647b16_0": "云何修清淨身下釋第七章亦三標釋結初標如文。",
    "X36n0659_022:0647b18_0": "云何菩薩修清淨身。",
    "X36n0659_022:0647b19_0": "次釋中即師子孔品明或一業一相或一業二相三相此中明百福成一相文為二先明相業次明好業。",
    "X36n0659_022:0647b22_0": "菩薩摩訶薩修不殺戒有五種心謂下中上上上上中上乃至正見亦復如是是五十心名初發心具足決定成五十心是名滿足如是百心名百福德具足百福成於一相如是展轉具足成就三十二相名清淨身。",
    "X36n0659_022:0647c03_0": "所以復修八十種好世有眾生事八十種神何等八十十二日十二大天五大星北斗馬天行道天婆羅墮跋闍天功德天二十八宿地天風天水天火天梵天樓陀天因提天拘摩羅天八臂天摩醯首羅天半闍羅天鬼子母天四天王天造書天婆藪天是名八十為此眾生修八十好以自莊嚴是名菩薩清淨之身何以故是八十天一切眾生之所信伏是故菩薩修八十好其身不動令彼眾生隨其所信各各得見見已宗敬各發阿耨多羅三藐三菩提心以是義故菩薩摩訶薩修於淨身善男子譬如有人欲請大王要當莊嚴所有舍宅極令清淨辦具種種百味肴膳然後王乃就其所請菩薩摩訶薩亦復如是欲請阿耨多羅三藐三菩提法輪王故先當修身極令清淨無上法王乃當處之以是義故菩薩摩訶薩要當修於清淨之身善男子譬如有人欲服甘露先當淨身菩薩摩訶薩亦復如是欲服無上甘露法味般若波羅蜜要當先以八十種好清淨其身善男子譬如妙好金銀寶器盛於淨水中表俱淨菩薩摩訶薩其身清淨亦復如是盛阿耨多羅三藐三菩提水中表俱淨善男子如波羅奈素白之衣易受染色何以故性白淨故菩薩摩訶薩亦復如是以身淨故疾得阿耨多羅三藐三菩提。",
    "X36n0659_022:0648a01_0": "外道所事各止一相佛集眾相備在一身十二日者即子丑等十二日河西云一秊有十二吉日堪祠祀求福然修相好亦四悉意一者法王之體應以相好而自嚴身諸佛皆爾是為世界令人見者生信起善是為為人一身具眾好對破外道是為對治色淨故般若淨般若淨故色淨是第一義文舉四譬或當主此(云云)。",
    "X36n0659_022:0648a08_0": "以是義故菩薩摩訶薩修於淨身。",
    "X36n0659_022:0648a09_0": "云何了知諸緣下第八章此中亦三標釋結初如文。",
    "X36n0659_022:0648a11_0": "云何菩薩了知諸緣。",
    "X36n0659_022:0648a12_0": "菩薩摩訶薩不見色相不見色緣不見色體不見色生不見色滅不見一相不見異相不見見者不見相貌不見受者何以故了因緣故如色一切法亦如是。",
    "X36n0659_022:0648a15_0": "釋中他云知因緣和合即是世諦是義不然不見色相是行支滅不見色緣是無明滅不見色體是識名色六入觸受滅不見色生是愛取有生等滅不見色滅是老死滅不見一相是不見十二因緣空不見見者是不見因緣假真俗雙亡二諦俱泯亦不見中如是通達了知因緣為若此云何止是世諦也一切法亦如是。",
    "X36n0659_022:0648a22_0": "是名菩薩了知諸緣。",
    "X36n0659_022:0648a23_0": "云何菩薩下釋第九章文為三標釋結。",
    "X36n0659_022:0648a24_0": "云何菩薩離諸怨敵。",
    "X36n0659_022:0648b01_0": "標如文。",
    "X36n0659_022:0648b02_0": "次釋為二初明離怨次簡出怨初離怨又二初自離怨次為他離怨初文者。",
    "X36n0659_022:0648b04_0": "一切煩惱是菩薩怨菩薩摩訶薩常遠離故是名菩薩壞諸怨敵。",
    "X36n0659_022:0648b06_0": "遠離煩惱是自離怨。",
    "X36n0659_022:0648b07_0": "五住菩薩視諸煩惱不名為怨所以者何因煩惱故菩薩有生以有生故故能展轉教化眾生以是義故不名為怨。",
    "X36n0659_022:0648b10_0": "次五住者是為他離怨。",
    "X36n0659_022:0648b11_0": "次何等為怨下是簡出怨敵。",
    "X36n0659_022:0648b12_0": "何等為怨所謂誹謗方等經者菩薩隨生不畏地獄畜生餓鬼唯畏如是謗方等者一切菩薩有八種魔名為怨家遠是八魔名離怨家。",
    "X36n0659_022:0648b15_0": "河西釋八魔者謗方等等四惡是四魔即生死魔無常無我等四即涅槃魔(云云)。",
    "X36n0659_022:0648b17_0": "是名菩薩離諸怨敵。",
    "X36n0659_022:0648b18_0": "云何遠離是第十章亦有標釋結標如文。",
    "X36n0659_022:0648b19_0": "云何菩薩遠離二邊。",
    "X36n0659_022:0648b20_0": "言二邊者謂二十五有及愛煩惱菩薩常離二十五有及愛煩惱。",
    "X36n0659_022:0648b22_0": "釋文中以二十五有愛煩惱為二邊即是因果二法私謂破二十五有中三種惑故故離二邊河西以業與煩惱為二邊私謂若云三惑有三種業方會今意直以界內惑業以為二邊全非今意既得此意例一切法有無常斷垢淨縛脫等皆是二邊。",
    "X36n0659_022:0648c03_0": "是名菩薩遠離二邊。",
    "X36n0659_022:0648c04_0": "是名菩薩摩訶薩修大涅槃具足成就第四功德。",
    "X36n0659_022:0648c05_0": "爾時光明下第二論義有問答。",
    "X36n0659_022:0648c06_0": "爾時光明徧照高貴德王菩薩摩訶薩言如佛所說若有菩薩修大涅槃悉作如是十事功德如來何故唯修九事不修淨土。",
    "X36n0659_022:0648c09_0": "問意者若菩薩具修十事如來何故不修淨土。",
    "X36n0659_022:0648c10_0": "佛答為四一我因具修十事眾聖亦然。",
    "X36n0659_022:0648c11_0": "佛言善男子我於往昔亦常具修如是十事一切菩薩及諸如來無有不修是十事者。",
    "X36n0659_022:0648c13_0": "二若使世界下呵其所問。",
    "X36n0659_022:0648c14_0": "若使世界不淨充滿諸佛世尊於中出者無有是處。",
    "X36n0659_022:0648c15_0": "善男子汝今莫謂諸佛出興不淨世界當知是心不善陿劣汝今當知我實不出閻浮提界譬如有人說言此界獨有日月他方世界無有日月如是之言無有義理若有菩薩發如是言此佛世界穢惡不淨他方佛土清淨莊嚴亦復如是。",
    "X36n0659_022:0649a02_0": "三西方下示其無勝淨土。",
    "X36n0659_022:0649a03_0": "善男子西方去此娑婆世界度三十二恒河沙等諸佛國土彼有世界名曰無勝彼土何故名曰無勝其土所有莊嚴之事悉皆平等無有差別猶如西方安樂世界亦如東方滿月世界我於彼土出現於世。",
    "X36n0659_022:0649a07_0": "四為眾生下為化眾生出穢土悉如文。",
    "X36n0659_022:0649a08_0": "為化眾生故於此界閻浮提中現轉法輪非但我身獨於此中現轉法輪一切諸佛亦於此中而轉法輪以是義故諸佛世尊非不修行如是十事善男子慈氏菩薩以誓願故當來之世令此世界清淨莊嚴以是義故一切諸佛所有世界無不嚴淨。",
    "X36n0659_022:0649a13_0": "復次下第五功德文為三標釋結標如文。",
    "X36n0659_022:0649a14_0": "復次善男子云何菩薩修大涅槃微妙經典具足成就第五功德。",
    "X36n0659_022:0649a16_0": "釋中二先釋次論義初釋者舊解五事有三說冶城云通外凡及三十心既言不生邊地諸根完具即是其證二云此德不淺何者登地已上皆依事表理言諸根完具者非耳根等乃是出世信首諸根邊地者非世間邊陲無佛法處乃是離斷離常諸天護念者以佛為天四眾恭敬者為物福田三開善云此乃登地菩薩猶生欲界故言完具等若論無漏得變易報而此菩薩猶有有漏故今受生雖有此五心不存著正以不著為體今評之開善全是三藏菩薩義初家通地前是別教初心不關經意中間登地是證道意就文為二先明功德後論義初功德者有標釋結標如文。",
    "X36n0659_022:0649b04_0": "善男子菩薩摩訶薩修大涅槃具足成就第五功德有五事。",
    "X36n0659_022:0649b06_0": "何等為五一者諸根完具二者不生邊地三者諸天愛念四者常為天魔沙門剎利婆羅門等之所恭敬五者得宿命智。",
    "X36n0659_022:0649b09_0": "釋者此五前四是報果後一是習果。",
    "X36n0659_022:0649b10_0": "菩薩以是大涅槃經因緣力故具足如是五事功德。",
    "X36n0659_022:0649b11_0": "次論義中先問。",
    "X36n0659_022:0649b12_0": "光明徧照高貴德王菩薩言如佛所說若有善男子善女人修於布施則得具成五事功德今云何言因大涅槃得是五事。",
    "X36n0659_022:0649b15_0": "次佛答又二先讚問次正答。",
    "X36n0659_022:0649b16_0": "佛言善哉善哉善男子如是之事其義各異今當為汝分別解說。",
    "X36n0659_022:0649b18_0": "答中有二初是勝劣章次善男子下是顯勝劣相。",
    "X36n0659_022:0649b19_0": "施得五事不定不常不淨不勝不異非無漏不能利益安樂憐憫一切眾生若依如是大涅槃經所得五事是定是常是淨是勝是異是無漏則能利益安樂憐憫一切眾生。",
    "X36n0659_022:0649b23_0": "初舉五章定是樂勝是我常淨可見異是中道不共無漏是證中道利益安樂等是化他。",
    "X36n0659_022:0649c01_0": "善男子夫布施者得離饑渴大涅槃經能令眾生悉得遠離二十五有渴愛之病布施因緣令生死相續大涅槃經能令生死斷不相續因布施故受凡夫法因大涅槃得作菩薩布施因緣能斷一切貧窮苦惱大涅槃經能斷一切貧善法者布施因緣有分有果因大涅槃得阿耨多羅三藐三菩提無分無果。",
    "X36n0659_022:0649c07_0": "次文云離渴愛是釋定釋樂生死斷不相續是釋常得作菩薩是釋淨斷一切貧善法是釋勝釋我無分無果是釋異釋不共兼得釋無漏利益眾生佛說五事因大涅槃得人師解通外凡三十心當知地前不名為得佛自說是無漏開善云是有漏既公抗佛語豈不疑誤後生故知人解全不可信將來學者但自依經。",
    "X36n0659_022:0649c14_0": "是名菩薩修大涅槃微妙經典具足成就第五功德。",
    "X36n0659_022:0649c15_0": "善男子下第六功德舊解金剛三昧若論十地是最後終心若論三忍即是上忍退非菩薩名等覺進非妙覺是金剛心菩薩一釋云具空有二解二云但取照有之解不取空解空解未足莊嚴云金心斷惑盡引此文由乾陀山七日竝照一切燒盡故知等覺斷惑盡開善解金心但伏無明至妙覺佛時斷此一念輕惑即得成佛勝鬘云佛菩提智能斷此文說伏為盡金心有解乃滿空解未足引二十二遊經及夫人經證廣論其義觀師云不可定判其位應例如般若通貫諸地又十地太高第五功德復是何地不應懸殊但使與三昧相應亦不簡高下舊又解十地得百三昧已方得首楞嚴方入金剛三昧者進非佛果退非下地唯在窮學此亦不然此一三昧亦有通別別據窮學通互諸地亦通似道何異金剛般若通初後地般若既通三昧寧別何者舉體堅如金剛舉體定如三昧舉體利如般若故經云金剛三昧有三種名下文亦云佛性五名若言終心有斷無斷乃是二家相扼為緣利益故作斷不斷說而其實理非斷不斷(云云)今謂莊嚴家引由乾陀山譬偏何者夫七日現時非但能燒由乾陀山一切洞然而今不以洞然為喻但燒草存山者非譬十地終心斷惑但取七日初出先照由乾陀故其草然明此三昧是初地功德最初斷惑故以燒草為譬標釋結初如文。",
    "X36n0659_022:0650a21_0": "復次善男子云何菩薩修大涅槃微妙經典具足成就第六功德。",
    "X36n0659_022:0650a23_0": "次釋中為三一略明三昧二廣明三昧三釋其名略中又二前明自德次辨化他自德又二初明能斷次舉非。",
    "X36n0659_022:0650b02_0": "菩薩摩訶薩修大涅槃得金剛三昧安住是中悉能破散一切諸法。",
    "X36n0659_022:0650b04_0": "見一切法皆是無常皆是動相恐怖因緣病苦劫盜念念滅壞無有真實一切皆是魔之境界無可見相。",
    "X36n0659_022:0650b06_0": "悉能破散是能斷見一切法是舉非。",
    "X36n0659_022:0650b07_0": "住是三昧雖施眾生下第二明化他也。",
    "X36n0659_022:0650b08_0": "菩薩摩訶薩住是三昧雖施眾生乃至不見一眾生實為眾生故精勤修習尸波羅蜜乃至修習般若波羅蜜亦復如是菩薩若見有一眾生不能畢竟具足成就檀波羅蜜乃至具足般若波羅蜜。",
    "X36n0659_022:0650b12_0": "譬如金剛下第二廣明又二初廣自行後廣化他廣自行又三初能斷次能見三重明能斷初能斷中凡舉八譬初一譬能斷。",
    "X36n0659_022:0650b15_0": "善男子譬如金剛所擬之處無不碎壞而是金剛無有折損金剛三昧亦復如是所擬之法無不碎壞而是三昧無有折損。",
    "X36n0659_022:0650b18_0": "後七譬稱歎。",
    "X36n0659_022:0650b19_0": "善男子如諸寶中金剛最勝菩薩所得金剛三昧亦復如是於諸三昧為最第一何以故菩薩摩訶薩修是三昧一切三昧悉來歸屬善男子如諸小王悉來歸屬轉輪聖王一切三昧亦復如是悉來歸屬金剛三昧善男子譬如有人為國怨讎人所厭患有人殺之一切世人無不稱讚是人功德金剛三昧亦復如是菩薩修習能壞一切眾生怨敵是故常為一切三昧之所宗敬善男子譬如有人其力盛壯人無當者復更有人力能伏之當知是人世所稱美金剛三昧亦復如是力能摧伏難伏之法以是義故一切三昧悉來歸屬善男子譬如有人在大海浴當知是人已用諸河泉池之水菩薩摩訶薩亦復如是修習如是金剛三昧當知已為修習諸餘一切三昧善男子如香山中有一泉水名阿耨達其泉具足八味之水有人飲之無諸病苦金剛三昧亦復如是具八正道菩薩修習斷諸煩惱瘡疣重病善男子如人供養摩醘首羅當知是人已為供養一切諸天金剛三昧亦復如是有人修習當知已為修習一切諸餘三昧。",
    "X36n0659_022:0650c13_0": "善男子若有菩薩安住下第二廣明能見初一譬能見。",
    "X36n0659_022:0650c15_0": "善男子若有菩薩安住如是金剛三昧見一切法無有障閡如於掌中觀阿摩勒果菩薩雖復得如是見終不作想見一切法。",
    "X36n0659_022:0650c18_0": "次三譬稱歎。",
    "X36n0659_022:0651a01_0": "善男子譬如有人坐四衢道見諸眾生來去坐臥金剛三昧亦復如是見一切法生滅出沒善男子譬如高山有人登之遠望諸方皆悉明了金剛定山亦復如是菩薩登之遠望諸法無不明了善男子譬如春月天降甘雨其渧微緻間無空處淨眼之人見之明了菩薩亦爾得金剛定清淨之目遠見東方所有世界其中或有國土成壞一切皆見明了無障乃至十方亦復如是。",
    "X36n0659_022:0651a09_0": "善男子如由乾陀山下第三重明能斷亦有三譬初一譬能斷。",
    "X36n0659_022:0651a11_0": "善男子如由乾陀山七曰竝出其山所有樹木叢林一切燒盡菩薩修習金剛三昧亦復如是所有一切煩惱叢林即時消滅。",
    "X36n0659_022:0651a14_0": "次二譬亡功。",
    "X36n0659_022:0651a15_0": "善男子譬如金剛雖能摧破一切有物終不生念我能摧破金剛三昧亦復如是菩薩修已能破煩惱終不生念我能壞結善男子譬如大地能持萬物終不生念我力能持火亦不念我能燒物木亦不念我能潤漬風亦不念我能動物空亦不念我能容受涅槃亦復不生念言我令眾生而得滅度金剛三昧亦復如是雖能滅除一切煩惱而初無心言我能滅。",
    "X36n0659_022:0651a22_0": "若有菩薩安住下第二廣明化他為四一變身如佛。",
    "X36n0659_022:0651a24_0": "若有菩薩安住如是金剛三昧於一念中變身如佛其數無量徧滿十方恒河沙等諸佛世界如是菩薩雖作是化其心初無憍慢之想何以故菩薩常念誰有是定能作是化唯有菩薩安住如是金剛三昧乃能作耳。",
    "X36n0659_022:0651b05_0": "二還本處。",
    "X36n0659_022:0651b06_0": "菩薩摩訶薩安住如是金剛三昧於一念中徧至十方恒河沙等諸佛世界還其本處雖有是力亦不念言我能如是何以故以是三昧因緣力故。",
    "X36n0659_022:0651b09_0": "三斷他惑。",
    "X36n0659_022:0651b10_0": "菩薩摩訶薩安住如是金剛三昧於一念中能斷十方恒河沙等世界眾生所有煩惱而心初無斷諸眾生煩惱之想何以故以是三昧因緣力故。",
    "X36n0659_022:0651b13_0": "四三密示現示現又四一口密。",
    "X36n0659_022:0651b14_0": "菩薩住是金剛三昧以一音聲有所演說一切眾生各隨種類而得解了。",
    "X36n0659_022:0651b16_0": "二身密。",
    "X36n0659_022:0651b17_0": "示現一色一切眾生各各皆見種種色相安住一處身不移易。",
    "X36n0659_022:0651b19_0": "三重明口密。",
    "X36n0659_022:0651b20_0": "能令眾生隨其方面各各而見演說一法若界若入一切眾生各隨本解而得聞之。",
    "X36n0659_022:0651b22_0": "前則一音異適今明一法異適。",
    "X36n0659_022:0651b23_0": "四菩薩下意密。",
    "X36n0659_022:0651b24_0": "菩薩安住如是三昧雖見眾生而心初無眾生之相雖見男女無男女相雖見色法無有色相乃至見識亦無識相雖見晝夜無晝夜相雖見一切無一切相雖見一切煩惱諸結亦無一切煩惱之相見八聖道無聖道相雖見菩提無菩提相見於涅槃無涅槃相何以故善男子一切諸法本無相故菩薩以是三昧力故見一切法如本無相。",
    "X36n0659_022:0651c07_0": "何故名為下第三釋名譬有三初不定譬無相。",
    "X36n0659_022:0651c08_0": "何故名為金剛三昧善男子譬如金剛若在日中色則不定金剛三昧亦復如是在於大眾色亦不安是故名為金剛三昧。",
    "X36n0659_022:0651c11_0": "次不平價譬無名。",
    "X36n0659_022:0651c12_0": "善男子譬如金剛一切世人不能平價金剛三昧亦復如是所有功德一切人天不能平量是故復名金剛三昧。",
    "X36n0659_022:0651c15_0": "後離苦毒譬無畏。",
    "X36n0659_022:0651c16_0": "善男子譬如貧人得金剛寶即得遠離貧窮困苦惡鬼邪毒菩薩摩訶薩亦復如是得是三昧則能遠離煩惱諸苦諸魔邪毒是故復名金剛三昧。",
    "X36n0659_022:0652a01_0": "結如文。",
    "X36n0659_022:0652a02_0": "是名菩薩修大涅槃具足成就第六功德。",
    "X36n0659_022:0652a03_0": "大般涅槃經卷第二十二",
    "X36n0659_022:0652a04_0": "日東　天台沙門本純　分會",
    "X36n0659_022:0652a06_0": "南本大般涅槃經會疏卷第二十二"
}