{
    "X36n0658_003:0307b04_0": "涅槃經會疏條目卷下",
    "X36n0658_003:0307b06_0": "迦葉品第二十四之一　會疏第三十一　單疏第十三(初紙已下)第五折攝涅槃用之下此品大科諸師異解此品與前品略有五異破以佛性三世非三世分應法兩身今品斷善生善二文一人兩人異解(并)今解兩取舊云生善有接無明識義故成佛今家委破此義善星權者義(舊云實者)迦葉問善星為惡人不救所以三子譬一代教機(玄一（十六）籤一本（五十二）玄私一本（三十七）料簡今文往見)三田三器三病人三馬三受施人譬佛為菩薩及闡提功用無差答善星記惡人問下引善星無信無慧無定往事文廣善星權者(上文)佛此品時共迦葉往善星所善星即墮獄善星無毫髮善故為闡提記善星墮獄為壞彼徒惡心善星二十年間在佛左右闡提斷善之相殺螘子得殺罪殺闡提無罪目連記後事有相違佛不爾闡提斷善(付)破數人解闡提斷善有二(一有善可斷二無善可斷)理外有信等五根闡提斷之殺闡提無罪等與施食相違(會疏十五同二十九)闡提雖有未來善障未來故言斷三世善闡提不斷佛性善義如世間眾生我性(付)三解上云佛性非三世攝下云佛性未來相違會通佛非三世攝而云未來義闡提雖有孝慈善皆是邪惡無記一切悉無決定性故有轉根佛聽善星出家有二意佛以知根力明知生善斷善機得人身具足正信如爪上土墮三途信邪見如十方地土明說教不定故斷善下迦葉廣舉末代諍論難不決定說佛為不定說所以(有五義)於一名說無量名等三章具應有六句涅槃一名具含眾名一義說無量名引帝釋諸名(付)與前不同帝釋諸名翻名無量義說無量名舉佛諸名具足八智三解(付)八忍八智法比數論異解重釋一義說無量名舉五陰為眾生故廣中說略略中說廣第一義說世諦世諦說第一義相為五種眾生不說五事是為人利鈍廣略正答執諍論下有二十一條初明涅槃不涅槃諍論說佛涅槃有五所以(一為諸仙　二為力士　三為純陀　四為須跋　五為世王)佛為力士現通吹大石提婆闍王惡逆之相提婆失通墮天不死餘勢故說如來不涅槃所以二釋有我無我諍論(付)數人薩婆多純明無我論人曇無德明假我真諦破招提用我無我破兩病義佛有時說有我(釋尊因位善見王緣)佛有時說無我終不離陰文二解三釋中陰有無諍論極善極惡無中有佛為帝釋別開脩羅脩羅鬼道但五不六四明退無退諍論(付)數家論家異解退緣有五事羅漢以外緣生煩惱退失而實無退瞿坻羅漢六反退失第七自害五明佛身有為無為諍(薩婆多有為　僧祇無為　成論兩說)六明十二因緣有為無為諍(付)薩婆多執有為僧祇說無為七明心常無常諍(付)薩婆多無常僧祇成論相續常八明五欲障道不障道諍(付)薩婆多障道僧祇不障成論兩向九明世第一在欲界通三界諍(付)薩婆多等異執十明施通三業不通三業諍(付)成論意地毗曇薩婆多三業十一明有三無為無三無為諍(付)成論三無為同體是計無數人計異體十二明造色有無諍(付)毗曇定有成論則無十三明無作色有無諍(付)成論曇無德無作非色僧祇總云無作十四明心數有無諍(付)薩婆多異體一時起僧祇說無心數提婆成論前後起十五明五有六有諍(付)餘部多五道犢子部說六道釋論同之(大論（三十五紙）)脩羅或天攝或鬼攝一有二有乃至二十五有等十六明五戒八戒具受不具受諍(付)薩婆多具受乃得成論不具亦得無分一分二分多分滿分優婆塞十七明犯重失不失諍(付)四卷毗曇失捨餘部多言不失十八明一乘三乘諍(付)諸部無此諍大乘所談故三乘同歸一乘為非(付)料簡大論云聲聞成佛不成佛非論義者所知十九明佛性離眾生即眾生諍(付)諸部無之近代所計即離二十明犯四重人有佛性無佛性諍(付)開善冶城異解二十一明有十方佛無十方佛諍(付)薩婆多明無(僧祇明有成論一世界無多世界有)世無二佛國無二主迦葉品之二　會疏第三十二　單疏第十三(二十紙已下)三答結問下種種諍訟佛境界非二乘所知生疑心者壞無量煩惱(付)疑是解津復是惑本十使中疑非解津煩惱如須彌山二解簡疑執相(有六番問答)明斷善根人相下斷滅見言無布施業(有六復次)起斷善見者多在閻浮三洲言無父母(有六復次)行善生三惡行惡生天人皆由臨終一念言無因果(有三復次)言無聖人(有九復次)闡提斷善根所以斷善人還生善時節有二時(入地獄時出地獄時)是約利鈍中根應在中生闡提斷現善不斷過未故還生善迦葉問佛性三世非三世(并)可斷不可斷佛性有六(一常　二真　三實　四善　五淨　六可見)佛有四種答(一定答　二分別答　三隨問答　四置答)重釋分別答舉佛性六事後身七事佛性三世非三世義如來後身九住八住五住等佛性不同佛性五事六事等隨位不同所以異解置答有二(一置而不答　二反質答之)復二種(一遮止　二莫著)明因佛性生善下約因果五陰明佛性三世非三世因果佛性(付)五味譬明佛性中道義下佛性非內非外妙樂明中道佛性遍一切處義雙非者復應雙是破非情無佛性義說佛性非內非外中道有多義佛性非有非無中道義佛性亦有亦無(付)種子中亦有果亦無果譬約乳酪譬廣破執見約鹽鹹譬破執見約諸法廣明中道下隨自意等三語隨自意語引五百比丘各說身因隨他意語引長者稱幻等隨自他意語約今教明三語相(止私三本（十一）)十住雖知自成佛不知他成佛故名小見廣略隨自意語七種隨自意語　(一因語　二果語　三因果語　四喻語　五不應說語　六世流布語　七如意語)有無隨自意語(付)如來佛性有二(一果德是有　二煩惱是無)舉二十二雙法例一切眾生悉有佛性說後身菩薩尚不解況二乘餘菩薩佛昔與彌勒論世諦身子等不知(付)此說處二解(玄私三本（二十八）)佛說世諦聲聞不解二解闡提善人相對佛性有無四句分別(付)舊釋今解恒河七種眾生此涅槃河有七種眾生合第一常沒(付)惡法住有六惡果有三合第二暫出還沒(付)有四善事得惡果信不具足戒不具足多義威儀戒從戒戒求戒捨戒名義聞不具足施不具足慧不具足十二部中信六部不信六部二解暫出還沒人提婆瞿伽離等三合得住人(付)此位今品與師子吼品不同(會疏第三十二三紙)得住人舍利弗目連等得住義如坻彌魚(補注七二紙)涅槃河中四人得涅槃生死河中唯第七佛一人得涅槃相違料簡(單疏十三（三十五紙）)迦葉品之三　會疏第三十三　單疏十四(初紙已下)辨行法下不淨觀念處觀因緣觀煖法觀雜心三度門地持五度門迦葉料簡煖法名義色界發煖法觀(付)三義佛弟子緣諦觀修欣猒外道但約地煖法名義體相煖法有為而能發無漏義煖法報得色五陰(付)數論二解得煖法人七十三種(付)三解通三界為七十三人二解合第四觀四方人下頂法至第十六心五人名觀四方實論頂法但行陰云五未免陰故師子吼四方譬四果今譬四諦見惑如四十里水餘在者如一毛滴斷三結名須陀洹(一我見　二非因見因　三疑網)須陀洹夢八十八頭蛇死三結惑中是重又攝諸惑恐眾生退失故佛方便說三結須陀洹觀四諦得四事須陀洹者修習無漏義有順流逆流從逆名須陀洹須陀洹名實通佛從初初果得此名須陀洹亦名菩薩亦名覺須陀洹受生利鈍三根不同(止私六本初)[魚*昔]魚有四事譬須陀洹四事首羅長者聞魔王說五諦等不信得初果故名須陀洹義二果不名須陀洹所以十六行有共不共(付)三解無漏十六行二種(一向果二得果)數論異解須陀洹緣四諦阿那含緣一諦合第五徧觀己行下斯陀含果攝那含向(并)斯陀含向(付)斯陀含向不攝初果所以合第六行已復住下二種那含(并)五種六種七種那含今經文但明九般不言身證及轉世三義現般極利根上行般二(利根或受二身鈍根或受四身)上行般行別相中般涅槃(付)有四種心(付)二解受身般不行般上流般(初約色界　次約色無色)委分別從初禪至尼吒滅等非上流攝熏禪得名數論二解中般者不現般有三所以(一羸劣　二乏眾緣　三喜作世務)欲界有中般色界無中般所以上界亦有初入等義中般有上中下三種合第七到彼岸(付)喻龜水陸空行七種眾生不離涅槃佛性水七法佛性合七種人總合別合世間有七種果(一方便果　二報恩果　三親近果　四餘殘果　五平等果　六果報果　七遠離果)各有近遠二因世間有生因了因涅槃唯了因無生因(付)涅槃亦義為生因而實是了沙門那沙門果義結羅漢支佛(付)支佛因攝第五第六結菩薩佛(付)菩薩屬果義明沒出兩人七人皆不修身戒等文他解文解七種人或一人具七或七人各一邪說謗三寶相佛性者不名一法十法百法等文眾生佛性如虗空義不云佛性有云佛性常所以佛性虗空非內外無罣礙非如來非涅槃非佛性墻壁瓦石無情非佛性文(付)此說為末代權機者實世間相常涅槃等對非涅槃等虗空無對故但名無(付)是互顯義迦葉以四大有例難虗空應有佛不答之所以涅槃有十五句故有虗空無之故無破外道諸執下破空是光明破空是住處破空是次第破空在三處破空是作法破空在無礙處雙破兩執重破空住處(并)例破五大明習解除惑無爭之用下佛不與世間諍菩薩具十法不與世諍世智說有佛亦說有說無亦然凡夫色無常如來色常義智者觀三漏相(并)不能觀人業報相對重四句明觀漏(并)因果報輕重等相明凡夫果無常佛果常所以明菩薩等解除惑下欲漏有漏無明漏相(付)與上德王品三漏不同(會疏第二十)無明為諸惑本(付)不善思惟亦諸惑本與無明互為因果無明漏與諸漏不同觀漏因相(并)一身起多種煩惱所以觀漏果報相三苦三無常文二解料簡無漏果報有無因中說果果中說因無漏實無果無煩惱果相迦葉品之四　會疏第三十四　單疏十四(二十五紙已下)從惡煩惱生惡果因果俱惡雪山有毒草藥王草譬藥王譬淨梵行(并)眾生有此行所以眾生有二(一煩惱果是煩惱因　二煩惱果非煩惱因)觀五陰下(付)不觀色識兩陰所以(并)行陰過重故開二觀受體受因受果一切善惡皆是受時是故先當觀受觸因緣(付)識想無明為觸等觸有三種(一無明觸　二明觸　三非明無明觸)二解觀愛有二(一雜食　二無食)觀想下(付)非想陰行中想倒觀想體(付)想有三(一小　二大　三無量)滅想受二心解脫(付)數論二解佛說有二(或時因眾生說聞者解法　或時因法說眾生聞者解說眾生)雖說想受二滅攝一切可斷觀想因想果相凡夫有二想(一世流布想　二著想)聖人唯有世流布想觀欲體欲因欲果相觀業體業因相業有二(一生業　二受業)業有身口意三(身口二業名業名業果亦名期業意唯名業不名果亦名正業)受想觸欲是煩惱(付)數論二解煩惱作生業不作受業(付)二釋觀業果(付)果有四(一黑黑果報　二白白果報　三雜雜果報　四不白不黑果報)無漏果唯果非報無漏業不名白所以十不善有三(上受地獄　中受畜生　下受餓鬼)人十善有四(下生北州　中生東州　上生西州　上上生南州)(付)閻浮果劣今約修善為上上觀十二因緣下(付)十地為三道今長有為四煩惱業苦有相對展轉生四句經本不同十二句次第相生五道皆苦(付)天上樂壞與地獄苦同觀三界皆苦觀苦因即愛無明是二(求身求財)又二(內外)觀苦果報即取苦因大小乘不同(小乘業煩惱為苦因　大乘愛有無明為苦因)愛無明各有內外二義愛與取逆順互為因緣歎經下(歎教行佛三明是歎三寶)涅槃經一切法之寶藏攝一切(付)二十五譬四教斷惑相(付)圓教同時斷歎行下(付)道品十想為菩薩行二義三十七道品位(付)諸師異解三十七品為淨梵行之宗有漏法顛倒故不為淨梵行世第一有漏非倒而一心故不為梵行眾生五識不無淨梵行五識非倒(付)異解三十七品其體九性道品因緣能知九義迦葉問九義佛讚歎為他問初善欲為菩提根本苦愛為本病宿食為本等生因善欲為本了因不放逸為本二釋明觸(有多釋)道定前說淨根戒二釋三釋攝受四釋增五釋念六釋導七釋勝八釋實九釋畢竟約法約人釋九法就譬明九法文二解根因增三種不同明十想觀下大品十想與今文有兩異十想前六中後三成初三正觀義離解脫想與滅想異三解初無常想二(先麤次細)色有十時差別(會疏十三止私五本（十七）)二苦想(付)無常故苦數論二解三無我想四猒離食想(付)四食食不淨想亦實亦虗比丘淨乞食相五世間不可樂想六死想眾生壽命復速堅疾天一息一眴四百生滅(付)成論云一念六十生滅會釋之二解總歎六想(付)七想略標後四想迦葉以偈讚佛下發心畢竟二不別如是二心先心難初發心為人天師勝出聲聞及緣覺佛名大悲牛一切眾生受異苦悉是如來一人苦唯有諸佛能讚佛除佛無能讚歎者師子吼品明大慈此品明大悲義(單疏第十四（三十九紙）)憍陳如品第二十五之一　會疏第三十五　單疏第十五(初丁已下)此品對憍陳如四悉義迦葉滅度阿難文殊未來故告陳如此經翻譯盡未盡(并)此品正說流通等諸師異解前品攝惡用此品攝邪用此品大分二(一正觀二破邪)四悉義色是無常因滅是色獲得常色等有十五科常無常觀約五陰明之有四義(一化道始終　二隨物所宜　三結一經首末　四諸法始終)獲得常色(付)諸師異解今家破佛無色義今經文約別義破無常色得常色圓義即無常色是常色明外道謀議下(文廣)諸外道指佛言狂人諸外道往阿闍世王所求與佛捔力列外道神通阿闍世王與諸外道來至佛所第一破闍提首那下難涅槃常法義(有多難)佛通釋下二十五諦與百論有同有異(單疏十五（五六紙）會疏無文)佛無二語雖說二語為了一語首那歸伏出家得羅漢苦諦亦二亦一道亦然(付)二解苦諦凡夫是二聖人是一道亦然得羅漢果(付)權者實者異解(并)得正見位異解第二破婆私吒下以四無難涅槃常義佛答非三無同互無三藥治三病(付)譬不淨等治貪瞋癡病中無藥藥中無病(付)無漏中有惑無惑異解婆私吒歸伏得羅漢即時入滅佛命陳如令供養色是無常解脫色常(付)二解外道指佛稱瞿曇與佛弟子稱瞿曇其意不同(會疏十三十二又當卷三十六)善來羅漢即具三衣自得羅漢須授衣鉢第三破先尼下(付)前卷有先尼同名異體先尼問有我無我三問佛不答默然三義外道立我有三義(一立我是徧　二立我是一　三立我是作者)破云我徧一切處(此下單疏異會疏釋)破云我是一亦破云一人一我燈炷譬外道佛不同破云我是作者破餘義下(一破見　二破受　三破知)有我無我論議(有五番)歡喜丸方先尼歸伏得羅漢果第四破梵志姓迦葉氏下論身異命異等義(有五番)梵志歸伏經五日已得羅漢第五破富那下破六十二見(付)六十二見二解破不許約如來作二十計富那歸伏說譬得羅漢佛性與眾生先後有無憍陳如品之二　會疏第三十六　單疏十五(十八紙已下)第六破清淨下眾生起六十二見所以清淨梵志歸伏十五日後得羅漢無明愛名故取有名新三解第七破犢子梵志下梵志問善不善法佛答之問佛法修行四眾佛具答在家得三果諸經多明五百弟子是數方之言外道歸佛求出家四月試之不必一種犢子出家後滿十五日得初果詣佛聞法修習得羅漢入滅第八破納衣下(付)諸師分文不同數人身先煩惱後論人煩惱先身後難身與煩惱先後一時義立諸法自性義難因緣生佛答破自性義答煩惱與身先後一時難下身及煩惱俱無前後而要因煩惱有身今經文約對治說因煩惱有身實無先後(妙樂私)一時因果文諸師異解外道佛法因緣不同破五大性難不破第八難二解納衣歸伏出家得羅漢五時破立次第不同破十仙經文多含攝無常乃至圓常第九弘廣下弘廣歸伏(并)發迹顯本十仙權者實者異解第十破須跋下破須跋章消文他解今解佛大慈非但當時破執亦破未來邪阿難為六萬四千億魔所嬈魔變為佛像說種種法現通阿難聞魔說惑亂所以七方便數論二解阿難受魔亂二義(并)河西五義五百羅漢不堪給使但阿難一人堪給使阿難三願佛許之阿難事佛二十年具八不思議阿難具八不思議故稱多聞藏阿難具足八法能持十二部經過去七佛侍者皆然今歎阿難德所以(軍疏無之)諸菩薩有重任不堪付囑阿難堪囑累長壽品云聲聞不堪付囑今付阿難三義阿難佛從弟而經又直云吾弟欲論近弘廣菩薩當能流布三解佛命文殊為阿難(并)魔說陀羅尼呪今呪同新金光明第十地呪知阿難十地菩薩十地肉身有虎狼等畏呪非文字(此下圓澄私明禪家得意非疏文)遣文殊所以(非疏文)持呪者斷五事表示(非疏文)文殊奉命說呪魔王發心文殊共阿難來佛所呪文不譯而有五義(付)總持名義兼化須跋下命阿難令勸須跋(并)須跋受阿難勸往緣須跋陀羅二翻(一好賢二善賢)雖得五通未捨慢心(付)數論二解須跋愛習未盡二解(并)煩惱習義亦二解須跋來問業行義佛答難邪說責邪師邪說雖說過去業不說現在業故為邪說明過去業現在因緣正義論得解脫義欲調伏身先當調心外道多作六行觀今須跋作八觀佛弟子八行觀(并)須跋八觀無無我(止私六本九料簡今文)破須跋非想謂涅槃鬱頭藍弗退非想作飛貍身須跋歸伏下若觀實想(或作相)能斷一切諸有實相從境實想從智無想之想名為實想(想字或作相)實想義(并)實想異名一第一義空依三智觀得三種菩提三乘同觀第一義空等文(弘三中（四十四）引此章安釋為被接之證止私三本（三十六）云疏都無決所引文者不審)一生實相二生法界(弘三中四十四引此文為被接止私三本三十六玄私三本二十九往見)大眾得益(并)須跋得羅漢應有正付囑文來未盡涅槃後分更有三品北本有四品半圓澄早謙回向涅槃經會疏條目(終)"
}