{
    "X38n0682_002:0256a03_0": "梵網經記卷下",
    "X38n0682_002:0256a05_0": "北京石壁寺沙門　傳奧　述",
    "X38n0682_002:0256a06_0": "自下第二明輕垢戒體非重過名輕黷污淨行稱垢所以制者為護微細惑業增長三聚方便成於十重戒故然其戒相無量無邊今之四十八者蓋尤略也故下數指本品廣明又智度論說略有八萬廣有塵沙今雖略示可反三偶又於諸戒之中有含多種共成七十九戒及有兼於重戒至文當示文三初結前生後次正誦戒相後結勸修學今初。",
    "X38n0682_002:0256a14_0": "佛告諸菩薩言已說十波羅提木叉竟四十八輕今當說。",
    "X38n0682_002:0256a16_0": "釋之可知次正誦戒相文五一明慢師等十戒二明入軍等十戒三明報怨等十戒四明救危等九戒五明受戒等九戒前中分二初具彰戒相後結勸指廣前中即為十段。",
    "X38n0682_002:0256a20_0": "○第一輕慢師長戒既創得戒須從師教反生輕慢失教行虧故先制也文二初制戒令行後違禁結罪前中二初令遵戒受持。",
    "X38n0682_002:0256a23_0": "佛言佛子欲受國王位時受轉輪王位時百官受位時應先受菩薩戒一切鬼神救護王身百官之身諸佛歡喜。",
    "X38n0682_002:0256b02_0": "釋曰二節初釋位令受王之等級如前所說百官即文武將相等二顯益除疑疑云受位不受戒有何失耶故次云爾以具戒故上順聖意故得諸佛歡喜下叶群靈故得鬼神救護有難即救護乃尋常不爾即無以保其社稷治於人民故也後令感恩敬養。",
    "X38n0682_002:0256b08_0": "既得戒已應生孝順心恭敬心見上座和上阿闍梨大同學同見同行者應起承迎禮拜問訊。",
    "X38n0682_002:0256b10_0": "釋曰孝順者感其恩故恭敬者欽其德故上座者眾中尊和尚此云近讀親承事受讀經法故阿闍梨此云軌範以此誨人令成就故上二正唯受此戒者兼之所餘無不敬故大同學者同學中長長通年德同見同行者解行齊均此之二類未必同師應起下意有通別別者過之必作居之承事自外而來即迎而宿已去即禮有所不安即問縱無不適亦要問訊通者見自遠來即速起迎承接禮拜問訊也後違禁結罪。",
    "X38n0682_002:0256b19_0": "而菩薩反生憍心慢心癡心瞋心不起承迎禮拜問訊一一不如法供養以自賣身國城男女七寶百物而供給之若不爾者犯輕垢罪。",
    "X38n0682_002:0256b22_0": "釋曰三節初正明違犯著自盛事曰憍恃己凌他曰慢癡為此二之因瞋為此二之果望下不起等亦得名因斯則憍慢翻前恭敬瞋癡反前孝順此上皆違逆之心也一一之言有兩意謂一一師長處或一一供養事如法供養有三一敬供養謂迎禮等二事供養謂香華等三行供養謂如說行亦名法供養然即正明前二兼後行此亦翻前可知二者別示除疑或曰禮敬隨時人皆所致貧富不等供養如何故此云矣賣身及男女即貧者也身通兼道俗男女唯俗或表鄭重未必貧無國城唯是在家又非凡庶所統曰國所據為城此通四輪兼於粟敗七寶有二一者唯約輪王謂輪寶象寶等二者兼於小王謂金銀等百物者亦有二意謂所賣所供所供即隨彼所須所賣即隨自所持皆通一切大數言百於尊上即言供謂大同學已上於中下即言給謂同見同行已下三總結所犯不爾之言該前別示及次前感恩之兩科若病不能起不能問訊貧不能供身等又無人買不生憍慢等語生慙愧之意即無犯矣。",
    "X38n0682_002:0256c17_0": "○第二飲酒成非戒前即外儀不肅此乃內心昏狂自外之內義之次也文二初制戒令行後違禁結罪前中二初約事總標後約人別制今初。",
    "X38n0682_002:0256c20_0": "若佛子故飲酒而酒生過失無量。",
    "X38n0682_002:0256c21_0": "釋曰酒過無量者四分律中說有十種謂顏色惡少氣力視不明多瞋恚等智論說有三十六實為眾患之基不唯三惑之一上所引說猶是略明經以蔽諸故云無量後約人別制文二初制自飲。",
    "X38n0682_002:0257a01_0": "若自身手過酒器與人飲酒者五百世無手何況自飲。",
    "X38n0682_002:0257a03_0": "釋曰分二初舉輕無手者增上果也以俱是脚故云無手斯則畜生也然亦兼於人類但無手矣二況重可知二制教化。",
    "X38n0682_002:0257a06_0": "亦不得教一切人飲及一切眾生飲酒況自飲酒一切酒不得飲。",
    "X38n0682_002:0257a08_0": "釋曰想失此罪過於自飲損他人故後違禁結罪。",
    "X38n0682_002:0257a09_0": "若故自飲教人飲者犯輕垢罪。",
    "X38n0682_002:0257a10_0": "釋曰自他之中有二於此即當其罪若為治病和諍慈悲為本將行大利等既非酒事故不為犯。",
    "X38n0682_002:0257a12_0": "○第三食肉無慈戒前是亂心之飲此是損形之食酒肉心形皆次第也文二初制戒令行後違禁結罪前中二初標所斷後制令斷今初。",
    "X38n0682_002:0257a15_0": "若佛子故食肉。",
    "X38n0682_002:0257a16_0": "釋之可知後制令斷文二初明失利他以制斷也。",
    "X38n0682_002:0257a17_0": "一切肉不得食夫食肉者斷大慈悲性種子一切眾生見而捨去。",
    "X38n0682_002:0257a19_0": "釋曰分二初標所斷一切之言是肉皆攝後示其失斷大慈等者內失化因積習成性對於現行性即是種或性是現行薰成種故一切下外失化緣有說畜生見食肉之人頭上有血光故怖而捨之所以童子修慈雁與爭路比丘帶殺鳥為分岐後明失自利以制斷也。",
    "X38n0682_002:0257b01_0": "是故一切菩薩不得食一切眾生肉食肉得無量罪。",
    "X38n0682_002:0257b02_0": "釋曰分二初標所斷是故之言躡前文也後示其罪為殺之緣故曰得無量罪如智論說偈肉非自然生皆從斷命得若人不斷肉皆同劫命賊後違禁結罪。",
    "X38n0682_002:0257b06_0": "若故食者犯輕垢罪。",
    "X38n0682_002:0257b07_0": "釋曰若為化生同事如誌公等既不在肉味又無所傷此即無犯餘皆不可。",
    "X38n0682_002:0257b09_0": "○第四噉薰辛穢戒前食有命之血肉此食無命之薰茹即其次也文二初制戒令行。",
    "X38n0682_002:0257b11_0": "若佛子不得食五辛大蒜茖[葸-十+夕]韮[葸-十+夕]蘭[葸-十+夕]興渠是五種一切食中不得食。",
    "X38n0682_002:0257b13_0": "釋曰三節初舉類總制此五臭穢熏刺謂之五辛二列名別制大蒜如常見者茖[葸-十+夕]即山[葸-十+夕]也北地有江南無韮[葸-十+夕]謂胡[葸-十+夕]蘭[葸-十+夕]是家[葸-十+夕]興渠者有說芸薹是有說葉似野蒜根莖似韮亦名蕪荖子江南多有北地所無有曰是阿魏之梵音餘處說[這-言+菲][卄/((起-走+光)-巳+韭)][葸-十+夕]蒜興為五辛與此不同三約食普制一切之言勢說五辛及諸食也後違禁結罪。",
    "X38n0682_002:0257b20_0": "若故食者犯輕垢罪。",
    "X38n0682_002:0257b21_0": "釋曰尚合香潔自居而反薰穢賢聖故當其罪若為治病為大利益即應開許餘終不可。",
    "X38n0682_002:0257b23_0": "○第五匿非同住戒前即自潔此乃淨他故也亦前是物穢此是行穢文二初制戒令行。",
    "X38n0682_002:0257c01_0": "若佛子見一切眾生犯八戒五戒十戒毀禁七逆八難一切犯戒罪應教懺悔。",
    "X38n0682_002:0257c03_0": "釋曰分二初舉戒緣眾生即能犯餘皆所犯八戒五戒者五即八中前五婬但止邪十戒即沙彌戒也毀禁者謂大比丘戒及菩薩戒七逆者出佛身血等如下文說八難者即盲聾等今取其因是造八難因之人一切下兼結上說或取所餘二明戒行梵云懺摩此云悔過見渠有所虧犯須令改過自斷今此文中華梵相兼耳後違禁結罪。",
    "X38n0682_002:0257c10_0": "而菩薩不教懺悔同住同僧利養而共布薩一眾說戒而不舉其罪不教悔過者犯輕垢罪。",
    "X38n0682_002:0257c12_0": "釋曰共住者處同也同利者利同也亦是食同共布薩者法同也正云補敬多此云淨住如上過累共有四重詳之瑜伽說輕過呵中過罸重過擯不爾成犯若舉不悔不伏餘去即自去矣亦不與居居即成犯。",
    "X38n0682_002:0257c17_0": "○第六不能請法戒前於失者不敬此於德者不求故又次之文二初制戒令行後違禁結罪前中二初舉戒緣後彰戒行今初。",
    "X38n0682_002:0257c20_0": "若佛子見大乘法師大乘同學同見同行來入僧坊舍宅城邑若百里千里來者。",
    "X38n0682_002:0257c22_0": "釋曰大乘法師者悟大乘理行大乘行趣大乘果說大乘教故同學者同一師學故同見同行即未必同師皆約大乘之者不許親近小乘三藏學者故鸞鳳不應賓烏鵲故僧坊約出家菩薩舍宅城邑約在家菩薩然舍宅兼於貴賤城邑唯局王候若約逢迎之處亦可通也百里等者意明在途即不必遠迎後彰戒行文二初令敬養不虧。",
    "X38n0682_002:0258a05_0": "即起迎來送公禮拜供養日日三時供養日食三兩金百味飲食牀座醫藥供事法師一切所須盡給與之。",
    "X38n0682_002:0258a08_0": "釋曰分二初明敬養之儀迎送等者謂來者起迎禮拜供養去者供養禮拜送之三時供養者謂朝中夜夜供湯藥等故二明供養所貴三兩金者以佛教門出三界苦恩逾罔極何限三金百味等者謂齋時獻食餘時奉飲偃臥置床說法敷座有所乖適即供醫藥須者即給故云一切後令請法無倦。",
    "X38n0682_002:0258a15_0": "常請法師三時說法日日三時禮拜不生瞋心患惱之心為法滅身請法不懈。",
    "X38n0682_002:0258a17_0": "釋曰請法有言詞即口業禮拜即身業不瞋等即意業謂不以違情故瞋惱不問又不說不瞋說多不惱反此亦得雙說亦得又說過違情而不瞋說深不解而不惱為法滅身者虗生浪死數歷塵沙為法喪軀於理何爽雪山童子等即其例也後違禁結罪。",
    "X38n0682_002:0258a23_0": "若不爾者犯輕垢罪。",
    "X38n0682_002:0258a24_0": "釋曰若實無瞋惱但以病不能興貧不能供聾啞所難兼解不及己等不請不問即無過犯。",
    "X38n0682_002:0258b02_0": "○第七情聽講筵戒前即遇人不請此明有講不聽故也文二初制戒令行後違禁結罪前中二初示其講處。",
    "X38n0682_002:0258b05_0": "若佛子見一切處有講法毗尼經律大宅舍中有講法處。",
    "X38n0682_002:0258b07_0": "釋曰毗尼此云滅滅業滅惑至滅果故律者法也軌則之義法含對法則三藏具矣後敕令聽受。",
    "X38n0682_002:0258b09_0": "是新學菩薩應持經律卷至法師所聽受諮問若山林樹下僧地坊中一切說法處悉至聽受。",
    "X38n0682_002:0258b11_0": "釋曰經律卷者或疏或本聽受者為聽其文受行其義諮問者或昧或疑發明大體益諸徒也山林樹下是前一切處僧坊即是前舍宅或可宅舍山林僧坊是別前後一切之言是總相夫講法之處豈限此三後違禁結罪。",
    "X38n0682_002:0258b16_0": "若不至彼聽受諮問者犯輕垢罪。",
    "X38n0682_002:0258b17_0": "釋曰新學菩薩理合如斯苟乏所聞難為解行指奇身命尚合處求有講不聽為失何甚傷乎即世十有九餘火出水中云何可救若別有大利或病難不遂或彼不如己即不往無犯。",
    "X38n0682_002:0258b21_0": "○第八背正向邪戒前雖勤學須知邪正毫釐之失萬劫為殃故須次辨。",
    "X38n0682_002:0258b23_0": "若佛子心背大乘常住經律言非佛說而受持二乘聲聞外道惡見一切禁戒邪見經律者犯輕垢罪。",
    "X38n0682_002:0258c01_0": "釋曰常住者大乘經律所詮之玅理也常住之經律依主釋也所詮為主故言非佛說者情動於中而形言即知口意二業皆成叛也二乘者第二乘謂緣覺也不爾聲聞何別言之謂緣諦異耳外道者佛法外之道也惡見者不信法空是二乘惡見撥無因果是外道惡見一切禁戒者殺人方重盜滿五錢不遮意地過大利益亦無開許癡於大慈等是二乘禁戒烏雞鹿狗等是外道禁戒邪見經律者即半字及大有等大般若說設菩薩於恒沙劫受玅五欲不名犯戒若起一念二乘之心即名為犯下文亦說若欲摧伏要善他宗於大乘法不背不謗即受彼無犯。",
    "X38n0682_002:0258c13_0": "○第九見疾不救戒前智此悲菩薩行故文二初制戒令行後違禁結罪前中二初據理普勸。",
    "X38n0682_002:0258c15_0": "若佛子見一切疾病人常應供養如佛無異八福田中看病福田是第一福田。",
    "X38n0682_002:0258c17_0": "釋曰兩節初舉尊正勸以如佛之心供養看病人亦如於佛即能所皆如佛也二顯福斷疑或曰何故心境皆如佛那何故勸我行此行耶故此云爾八福田者有一說曰一曠路美井二水路橋梁三平治險隘四孝順父母五供養沙門六給事病人七救濟危厄八設無遮會有曰三寶為三其次父母師僧貧窮病疾畜生為八此八境中皆能生福故名福田言第一者以佛居初文云如佛無異故名第一故偏勸之二約親別勸。",
    "X38n0682_002:0259a02_0": "若父母師僧弟子疾病諸根不具百種病苦惱皆供養令差。",
    "X38n0682_002:0259a04_0": "釋曰父母師僧者是世出世間父母及色身法身皆有昊天之恩故弟子能紹三寶故雖通一切此三尤切故偏勸之百種之言理該一切是苦皆救方曰大悲後違禁結罪。",
    "X38n0682_002:0259a08_0": "而菩薩以惡心瞋心恨心不看乃至僧坊城邑曠野山林道路中見病不救濟者犯輕垢罪。",
    "X38n0682_002:0259a10_0": "釋曰惡心即惡其病事瞋心即慈悲不生恨心即宿有怨惡或由恨故欲使遄死名曰瞋心欲令且病名曰恨心此則恨心為總瞋惡為別也又或嫉彼故惡現違故瞋宿怨故恨僧坊即師僧弟子病處城邑即父母親屬病處山林等通一切人病處或即互通不必局定然菩薩慈悲為心救物為行所以月上女割乳房以濟產婦毗舍佉母割股肉以養病僧忍辱之於父王亦傷肌以瘳疾故不爾者犯斯罪也若實無瞋恨等心但為病難所阻或利過此或彼自無乏等即不爾無犯。",
    "X38n0682_002:0259a20_0": "○第十畜諸非法戒前無救物之心此畜害生之具惡之類也文二初制戒令行後違禁結罪前中二初舉事正遮。",
    "X38n0682_002:0259a23_0": "若佛子不得畜一切刀杖弓箭鉾斧鬪戰之具及惡網羅罥殺生之器一切不得畜。",
    "X38n0682_002:0259b01_0": "釋曰鬪戰之具結上刀杖等殺生之器結上網羅然殺器之言即通戰具之語即局知之一切等者於上二中各有多種故總制之謂鏘弩筌罩等後方便重誡。",
    "X38n0682_002:0259b05_0": "而菩薩乃至殺父母尚不加報況殺一切眾生。",
    "X38n0682_002:0259b06_0": "釋曰父母大怨尚由不報餘生無過豈合傷殘將知畜此誠為非法後違禁結罪。",
    "X38n0682_002:0259b08_0": "若故畜刀杖者犯輕垢罪。",
    "X38n0682_002:0259b09_0": "釋曰為護三寶父母等事假此為威終無殺意即刀杖等可畜其網羅之具義無開許後結勸指廣。",
    "X38n0682_002:0259b11_0": "如是十戒應當學敬心奉持下六品中當廣明。",
    "X38n0682_002:0259b12_0": "釋曰可知。",
    "X38n0682_002:0259b13_0": "自下第二明入軍等十戒文二準前前中十戒即為十段。",
    "X38n0682_002:0259b15_0": "○第一通國入軍戒前畜戰具此為戰使義類相次文二初制戒令行後違禁結罪前中二初約事正制。",
    "X38n0682_002:0259b18_0": "佛言佛子不得為利養惡心故通國使命軍陣合會興帥相伐殺無量眾生。",
    "X38n0682_002:0259b20_0": "釋曰利養通於財位惡心通於宿怨通國使等者計會軍陣之事如欒布等殺無量眾生者如塚下等事斯即兼犯殺戒但以為命輕事故為門也二以輕況重。",
    "X38n0682_002:0259b24_0": "而菩薩尚不得入軍中往來況故作國賊。",
    "X38n0682_002:0259c01_0": "釋曰無事往來尚由不許惡心為命豈可容之後違禁結罪。",
    "X38n0682_002:0259c03_0": "若故作者犯輕垢罪。",
    "X38n0682_002:0259c04_0": "釋曰若為好心不為利養欲使安和即可往也。",
    "X38n0682_002:0259c05_0": "○第二販賣招嫌戒前則通會戰諍此則販賣人民又前即害生令死此即押良為賤故次之矣文二初總舉不應。",
    "X38n0682_002:0259c08_0": "若佛子故販賣良人奴婢六畜市易棺材板木盛死之具尚不應自作況教人作。",
    "X38n0682_002:0259c10_0": "釋曰良人奴婢者或為一事押良為賤故或為二事故六畜者周禮曰牛馬犬羊豕雞其實通於一切畜生市易棺木等者此是旃陀羅業也盛死之具含有所餘可知然其此中共有三事若或別明便成三戒後雙結違禁。",
    "X38n0682_002:0259c15_0": "若故自作教人作者犯輕垢罪。",
    "X38n0682_002:0259c16_0": "釋曰此等買之容有賣即無文開遮得失詳會可知。",
    "X38n0682_002:0259c18_0": "○第三無根謗毀戒前於下位不輕此於上位不輕不謗故為次也文二初制戒令行後違禁結罪前中二初制所應止。",
    "X38n0682_002:0259c21_0": "若佛子以惡心故無事謗他良人善人法師師僧國王貴人言犯七逆十重。",
    "X38n0682_002:0259c23_0": "釋曰惡心即謗因通於怨嫉無事為無根無根說過所以成謗良人下是謗人人有六種合即為三二二合故竝可詳會七逆等是所謗罪以重例輕故不別言也後制所應作。",
    "X38n0682_002:0260a03_0": "於父母兄弟六親中應生孝順心慈悲心。",
    "X38n0682_002:0260a04_0": "釋曰此文與前段影略不爾則成相違孝順心者謂父母已上有過譏諫不犯顏色是為孝順慈悲心者為弟妹已下有過善悔拔其苦業令後安樂是慈悲也後違禁結罪。",
    "X38n0682_002:0260a08_0": "而反更加於逆害墮不如意處者犯輕垢罪。",
    "X38n0682_002:0260a09_0": "釋曰反更等者有過直言為不孝況加謗黷豈非逆流墮不如意處者令父母等墮於惡數中即不義之地唯除逆化餘皆不可。",
    "X38n0682_002:0260a12_0": "○第四放火損燒戒前正報此依報之次也文二初制戒令行後違禁結罪前中二初舉事令知後立制令斷前中二初舉能燒之因。",
    "X38n0682_002:0260a15_0": "若佛子以惡心故。",
    "X38n0682_002:0260a16_0": "釋曰惡心通於怨利後示所燒之事。",
    "X38n0682_002:0260a17_0": "放大火燒山林曠野四月乃至九月放火若燒他人家屋宅城邑僧坊田木及鬼神官物一切有主物。",
    "X38n0682_002:0260a19_0": "釋曰分二初明無主之處此雖無主動識攸依苟至焚燒寧無傷害由是此兼犯殺戒二明有主之物通說唯六別明有十在文可見後立制令斷。",
    "X38n0682_002:0260a22_0": "不得故燒。",
    "X38n0682_002:0260a23_0": "釋曰無主之處從十月初至三月末即許有主之物不論時節皆不可也故者惡心故也後違禁結罪。",
    "X38n0682_002:0260b02_0": "若故燒者犯輕垢罪。",
    "X38n0682_002:0260b03_0": "釋曰害生損物殊不慈悲細詳此事難為開許。",
    "X38n0682_002:0260b04_0": "○第五法化違宗戒前為外損此為內損故也文二初制戒令行後違禁結惡前中二初舉緣。",
    "X38n0682_002:0260b06_0": "若佛子自佛弟子及外道惡人六親一切善知識。",
    "X38n0682_002:0260b07_0": "釋曰五類十類開合可知後立戒令行。",
    "X38n0682_002:0260b08_0": "應一一教受持大乘經律應教解義理使發菩提心十發趣心十長養心十金剛心一一解其次第法用。",
    "X38n0682_002:0260b10_0": "釋曰如次令持教悟理發行定位發趣等同前次第即行位階降謂入住出等法通所斷所證之惑理用通能斷能證之二智或可三十心中所有軌則總名法用依主持業二釋不同如次則免於僭上偪下進退可度也後違禁結罪。",
    "X38n0682_002:0260b15_0": "而菩薩以惡心瞋心橫教二乘聲聞經律外道邪見論等者犯輕垢罪。",
    "X38n0682_002:0260b17_0": "釋曰惡心唯對所教恐不成大利故瞋心嫌於別人如有人教於大乘為瞋能教之者便曲示教小乘令彼修學意圖彼師所教不成橫教之言似有此意或但可是所教之人以違情故不示大法橫教者幸是大根授以小法如以穢食置於寶器況與邪僻豈非橫耶若實無惡心瞋心但緣知是小根不堪授大或使摧伏要善他宗或為圓成種智即教亦無犯。",
    "X38n0682_002:0260c01_0": "○第六借法窺利戒前即不說大乘此乃說之倒錯故也文二初制戒令行後違禁結罪前中二初舉戒緣後立戒行今初。",
    "X38n0682_002:0260c04_0": "若佛子應以好心先學大乘威儀經律廣開解義味見後新學菩薩有從百里千里來求大乘經律。",
    "X38n0682_002:0260c06_0": "釋曰好心者本欲自利利他故學威儀者知其去就開解等者曉其所歸不爾徒設威儀終何益乎見下後學欽風可知後立戒行文二初示苦行以成福。",
    "X38n0682_002:0260c10_0": "應如法為說一切苦行若燒身燒臂燒指若不燒身臂指供養諸佛非出家菩薩乃至餓虎狼師子一切餓鬼悉應捨身肉手足而供養之。",
    "X38n0682_002:0260c13_0": "釋曰分二初上供以荷恩佛德無上己身無二不以此供何報巨恩喜見菩薩即其類也二乃至下下濟以宛願本發大心亡身益物遇此不濟徒願何為薩埵王子即其人也後宣玅法以增慧。",
    "X38n0682_002:0260c17_0": "然後一一次第為說正法使心開意解。",
    "X38n0682_002:0260c18_0": "釋曰大乘教理行果是其正法悟修階級是其次第如華嚴第六會中說修因契果生解分後違禁結罪。",
    "X38n0682_002:0260c21_0": "而菩薩為利養故應答不答倒說經律文字無前無後謗三寶說者犯輕垢罪。",
    "X38n0682_002:0260c23_0": "釋曰為利養者邀令苦求故恐解侵利故應答不答者或全不語或問實答權等倒說等者戒定互言或通下一意即差於首尾謗三寶者佛不如是說法不如是詮僧不如是傳妄言如是是謗三寶若實不為利養但欲隨義隨機方便開誘不依文字即無過焉。",
    "X38n0682_002:0261a05_0": "○第七倚官強乞戒前即憑法取利此即倚官求財又前誑此威耳文四初舉犯因。",
    "X38n0682_002:0261a07_0": "若佛子自為飲食錢財利養名養故。",
    "X38n0682_002:0261a08_0": "釋曰利養者衣食之資名譽者豪勢之名或得財反惠以求善名二明犯緣。",
    "X38n0682_002:0261a10_0": "親近國王王子大臣百官。",
    "X38n0682_002:0261a11_0": "釋曰國王唯明粟散王子通取諸王大臣兼於將相百官統於州縣三彰犯相。",
    "X38n0682_002:0261a13_0": "恃作形勢乞索打拍牽挽橫取錢物一切求利名為惡求多求教他人求都無慈心無孝順心。",
    "X38n0682_002:0261a15_0": "釋曰恃作等倚賴上官現其威怒打拍等者打棒令痛拍恊令懼初即乞之不得即牽牽挽者將見上官橫取者非其義也一切求利者百計營謀故是物皆求故惡求者打拍橫取故多求者得已增貪無厭足故亦即一切求也教他人求者囑上官故駈使別人令作故或教於別人如此求故下惱眾生是無慈心上違佛教是無孝順又眾生皆父母惱之亦名不孝又行惡自隨生為惡人非唯不救幽靈抑亦累於見在亦名不孝也四結犯罪。",
    "X38n0682_002:0261a24_0": "犯輕垢罪。",
    "X38n0682_002:0261b01_0": "釋曰准此亦犯盜戒方便盜故為門異故在此文矣或奪其賊物以還主揤之令種善等不緣自潤一向利他慈心為本即可容也。",
    "X38n0682_002:0261b04_0": "○第八無解為師戒前即倚官求利此即詐解為師文二初制戒令行。",
    "X38n0682_002:0261b06_0": "若佛子學誦戒者日日六時持菩薩戒解其義理佛性之性。",
    "X38n0682_002:0261b08_0": "釋曰勤誦其文六時無替深達義理二諦分明義理者道理也佛性者真理也為揀餘性故云佛性之性又義理即持犯之法佛性即本新行性之性即平等理性後違禁結罪。",
    "X38n0682_002:0261b12_0": "而菩薩不解一句一偈及戒律因緣詐言能解者即為自欺誑亦誑欺他人一一不解一切法不知而為他人作師授戒者犯輕垢罪。",
    "X38n0682_002:0261b15_0": "釋曰句偈有其文義之異可知因緣者通輕重持犯受學傳誦等皆具因緣欺誑自他者彼此俱墮故不知者自冐前人不令知已不解文順合云一切法中一一不解他人不知而為作師受戒即易會也若或無人為師隨己所解不隱所短即無過也。",
    "X38n0682_002:0261b21_0": "○第九鬪謗欺贒戒前則內隱無知此乃外欺有德文二初妬賢嫉能。",
    "X38n0682_002:0261b23_0": "若佛子以惡心故見持戒比丘手捉香鑪行菩薩行。",
    "X38n0682_002:0261b24_0": "釋曰惡心者或恐侵名利或宿有怨嫌但違善品名為惡心持戒者輕重兩全捉香鑪者行道供養後積惡成禍。",
    "X38n0682_002:0261c03_0": "而鬪過兩頭謗欺賢人無惡不造者犯輕垢罪。",
    "X38n0682_002:0261c04_0": "釋曰彼此無過兩頭互說遂令善人心生忿毒遞相凌損故云爾耳又無惡不造屬於此人謂種種鬪謗務令相反是無惡不造也此唯除癡狂心亂餘竝不可。",
    "X38n0682_002:0261c08_0": "○第十不救眾生戒前則於善令非此乃見苦不救文二初制戒令行後違禁結罪前中二初總標後別示今初。",
    "X38n0682_002:0261c11_0": "若佛子以慈心故行放生業。",
    "X38n0682_002:0261c12_0": "釋曰慈心為體放生為業業即是行行即是行行即是用後別示文二初據理正觀後依觀起行前中二初觀同父母後觀同己身前中二初普明皆是後結所不應前中二初約人類。",
    "X38n0682_002:0261c16_0": "一切男子是我父一切女人是我母我生生無不從之受生。",
    "X38n0682_002:0261c18_0": "釋曰分二初標舉後我生生下釋成或曰如何得知皆父母耶故此云爾恩愛業緣即為眷屬屢受生無數理合如斯後約六趣。",
    "X38n0682_002:0261c21_0": "六道眾生皆是我父母。",
    "X38n0682_002:0261c22_0": "釋曰或自身為六道彼此相參又經多劫故應爾也後結所不應。",
    "X38n0682_002:0261c24_0": "而殺而食者即殺我父母。",
    "X38n0682_002:0262a01_0": "釋曰問若然者殺生合成逆罪何不然耶答以隔生故無父母相之想故後觀同己身。",
    "X38n0682_002:0262a03_0": "亦殺我故身一切地水是我先身一切火風是我本體。",
    "X38n0682_002:0262a05_0": "釋曰分二初標舉後一切下釋成或曰云何知是已耶故此云耳意曰我所受身是其四大眾生之體亦復如是所捨身既無邊眾生足明是我後依觀起行文二初躡前總標後約事別辨今初。",
    "X38n0682_002:0262a09_0": "故常行放生生生受生常住之法教人放生。",
    "X38n0682_002:0262a10_0": "釋曰意云准上二義即合生生受生之處常行放生之行法爾常規故云常住之法不唯自爾兼亦教人二利行也後約事別辨文二初普救餘生。",
    "X38n0682_002:0262a13_0": "若見世人殺畜生時應方便救護解其苦難常教化講說菩薩戒救度眾生。",
    "X38n0682_002:0262a15_0": "釋曰分二初別救危者方便救者不爾不遂或反損故後常教化下通救所餘既皆父母固合救度橫該人物竪通幽顯可一一故通為也後別資現在。",
    "X38n0682_002:0262a19_0": "若父母兄弟死亡之日應請法師講菩薩戒經福資亡者得見諸佛生人天上。",
    "X38n0682_002:0262a21_0": "釋曰分二初孝子薦因斯則見今生身父母不同餘類存亡可知以但取忌辰講說餘生雖悉父母隔遠難知又復過見廣多故常講也由是藏疏言此戒中具於二事後福資下先靈享福謂已在人天者即令生於淨土故云得見諸佛若在三塗者不得同生淨土故令且上人天然此正明現在兼於餘類經意然也後違禁結罪。",
    "X38n0682_002:0262b04_0": "若不爾者犯輕垢罪。",
    "X38n0682_002:0262b05_0": "釋曰若力所不及無師可請自又不任或有大利過此不逮兼行即不可也後結勸指廣。",
    "X38n0682_002:0262b07_0": "如是十戒應當學敬心奉持如滅罪品中廣明一一戒相。",
    "X38n0682_002:0262b09_0": "自下第三明報怨等十戒文二准前前中即為十段。",
    "X38n0682_002:0262b11_0": "○第一無慈報怨戒前則見苦不救此乃於怨起酬文二初制戒令行後違禁結罪前中二初總標所斷後別列所斷今初。",
    "X38n0682_002:0262b14_0": "佛言佛子不得以瞋報瞋以打報打。",
    "X38n0682_002:0262b15_0": "釋曰合云以罵報罵共成三業今以身意合之後別列所斷文二初舉重列輕。",
    "X38n0682_002:0262b17_0": "若殺父母兄弟六親不得加報若國主為他人殺者亦不得加報殺生報生不順孝道。",
    "X38n0682_002:0262b19_0": "釋曰二節初正制令斷此舉至親至尊之境以況諸也後示其所由或曰君親之怨不報何名忠孝耶故此云耳生由命也謂殺彼命以還此命故云殺生報生怨怨不息故非孝道如瑠璃王事又彼怨亦是我之父母故亦不合佛心故亦不契正理故故不可也後以輕況重。",
    "X38n0682_002:0262c01_0": "尚不畜奴婢打拍罵辱日日起三業口罪無量況故作七逆之罪。",
    "X38n0682_002:0262c03_0": "釋曰奴婢是屬己之賤打罵之罪猶多怨家是己之父母殺即同七逆七逆之罪不言可知口罪無量者世人於奴婢等大方如此或恐是得字傳寫誤故後違禁結罪。",
    "X38n0682_002:0262c07_0": "而出家菩薩無慈報讐乃至六親中故報者犯輕垢罪。",
    "X38n0682_002:0262c09_0": "釋曰發菩提心是則出家不約形服不爾在家菩薩得不犯耶以中攝初後但言六親爾據此兼犯殺瞋二重戒開遮之義如殺戒說。",
    "X38n0682_002:0262c12_0": "○第二慢人輕法戒前於怨境起瞋招其大損今於德人生慢失其大益文二初制戒令行後違禁結罪前中二初制所應止後制所應作前中二初明制戒因。",
    "X38n0682_002:0262c16_0": "若佛子初始出家未有所解而自恃聰明有智或恃高貴年宿或恃大姓高門大解大福大富饒財七寶以此憍慢而不諮受先學法師經律。",
    "X38n0682_002:0262c19_0": "釋曰分三初實無所解出家者兩意謂身及心又身必兼心不發大心非菩薩故初出之言即無解之因二而自下徒恃豪族有十種一聰明耳目俊利二有智悉諳世事三高賢先曾任官四年宿老大五大姓剎族等六高門上代衣瓔七大解黃籍或是小乘八大福曾作大施九饒財富有錢帛十七寶足金銀等三以此下耻於下問於此十中或一或多不必一人全具於十後明制戒緣。",
    "X38n0682_002:0263a03_0": "其法師者或小姓年少卑門貧窮諸根不具而實有德一切經律盡解。",
    "X38n0682_002:0263a05_0": "釋曰分二初風儀外陋有五類亦不必一人如此將對前文有其通別別者小姓是前大姓之所慢者等通者應可互望為之二而實下德行內宛德即是行行解具故以此反明慢之悞矣後制所應作。",
    "X38n0682_002:0263a10_0": "而新學菩薩不得觀法師種姓。",
    "X38n0682_002:0263a11_0": "釋曰略舉一事可以例諸且夫童子求於羅剎天帝跪於野干皆為慕法情慇不觀形貌弊惡之短足以明途豈得公然輔情損利世多如此哀哉哀哉後違禁結罪。",
    "X38n0682_002:0263a15_0": "而不來諮受法師第一義諦者犯輕垢罪。",
    "X38n0682_002:0263a16_0": "釋曰二諦俱問蓋文略之除自恃輕他外或病難所阻或審知無德或調伏彼惡或因招大損等即可餘不可也。",
    "X38n0682_002:0263a19_0": "○第三輕新求學戒前則有德不問此即有問不言又前慢先德此輕後進是次第也文二初制戒令行後違禁結罪前中二初總標受戒之時後別明受戒之法今初。",
    "X38n0682_002:0263a23_0": "若佛子佛滅度後欲以好心受菩薩戒時。",
    "X38n0682_002:0263a24_0": "釋曰佛滅等者佛在即無自誓等受戒事故欲以好心者願樂深信故意專二利故此即好心之欲揀非惡心是受戒之器後別明受戒之法文二初別顯受學後雙結分齊前中二初明自誓受戒後明從師受戒前中二初總明處法後別顯時緣今初。",
    "X38n0682_002:0263b06_0": "於佛菩薩形像前自誓受戒。",
    "X38n0682_002:0263b07_0": "釋曰情發於中誠言立弘誓願自要口陳羯磨應教相現名為得戒後別顯時緣文二初別明遲速。",
    "X38n0682_002:0263b09_0": "當以七日佛前懺悔得見好相便受得戒若不得好相應以二七三七乃至一年要得好相得好相已便得佛菩薩戒像前受戒。",
    "X38n0682_002:0263b12_0": "釋曰分二初明勝機得戒且斯七日見相即止不必定然好相者佛來摩頂等如下文說後若不下明劣機得戒以見相為限何指一年然極劣者亦不出此故言一年矣由此障有厚薄聖無親疎尤宜自責慎勿怨夫後總結不可。",
    "X38n0682_002:0263b17_0": "若不得好相雖佛像前受戒不名得戒。",
    "X38n0682_002:0263b18_0": "釋曰戒不可見佛又無言不以相表安知可否後明從師受戒文二初明得戒緣後明得戒因前中二初具彰。",
    "X38n0682_002:0263b21_0": "若先受菩薩戒法師前受戒時不須要見好相何以故是法師師師相授故不須好相。",
    "X38n0682_002:0263b23_0": "釋曰三節初標意曰現前有法師先曾受戒今於彼前二徵戒是一源何故自誓須相此不要耶後釋法師從上傳習善知軌摸教授如法故不假相後印定。",
    "X38n0682_002:0263c03_0": "是以法師前受戒即得戒。",
    "X38n0682_002:0263c04_0": "釋曰是者此也即得者不經多日故後明得戒。",
    "X38n0682_002:0263c05_0": "以生至重心故便得戒。",
    "X38n0682_002:0263c06_0": "釋曰雖不假相要在極鄭重之心恐使因修故茲嚴戒至為至到罄竭肝心重為殷重尊人敬法其由瓶安水入溪淨月生後雙結分齊。",
    "X38n0682_002:0263c09_0": "若千里內無能授戒師得佛菩薩形像前自誓受戒而要見好相。",
    "X38n0682_002:0263c11_0": "釋曰千里者八方各爾有而不受即是慢他無而遠求便成自因故兼勗耳後違禁結罪文二初明犯因緣。",
    "X38n0682_002:0263c14_0": "若法師自倚解經律大乘學戒與國王太子百官以為善友而新學菩薩來問若經義律義。",
    "X38n0682_002:0263c16_0": "釋曰分三初智解分明此唯因也二與國下交結豪貴此通因緣三而新學下後進來求此唯緣也後結犯行相。",
    "X38n0682_002:0263c19_0": "以輕心惡心慢心不一一好答問者犯輕垢罪。",
    "X38n0682_002:0263c20_0": "釋曰以恃內解外勢故於新學生輕慢二心通於輕慢亦乃是無慈悲心或是瞋心以是不欲之事故或是嫉妬心恐彼解同己侵名利故如是三心有一於此即不能好說除此心外為老病失心或知其後患故作是說即無犯也其羯磨懺悔受戒等廣如別說由此戒中含於二事為師資各一知之。",
    "X38n0682_002:0264a03_0": "○第四棄正從邪戒前則恃慢凌人此乃背真向偽又前輕人此捨法故次來也文二初明違禁後結成罪前中二初明棄正後顯從師今初。",
    "X38n0682_002:0264a06_0": "若佛子有佛經律大乘法正見正性正法身而不能勤學修習而捨七寶。",
    "X38n0682_002:0264a08_0": "釋曰二節初列所棄之正大乘法是教正見是行即解之行故正性是理正法身是果四法具矣又初是修生法依教聞薰成正智故後二是本有法在纏名性出纏為法故表異外法故言佛也二不能下明所棄之失七寶者諭也大法可重故如七寶意顯二乘等為瓦礫也不能言如捨也後顯從師。",
    "X38n0682_002:0264a15_0": "反學邪見二乘外道俗典阿毗曇雜論一切書記是斷佛性鄣道因緣非行菩薩道。",
    "X38n0682_002:0264a17_0": "釋曰分二初列所從之邪邪見者總明也反前諸正及佛二乘者是異乘邪見外道者僧伽等論俗典者五經六書阿毗曇此云對法即小乘論也雜論者小乘外道及以俗典雜糅所成書者大篆小篆記者大演小演等二是斷下顯所從之失斷佛性者佛種從緣起此等非正緣即自他皆斷障道因緣者由此令菩提教行之道俱不行故非行菩薩道者上二所行非菩薩所行之道故後結成罪。",
    "X38n0682_002:0264b01_0": "若故作者犯輕垢罪。",
    "X38n0682_002:0264b02_0": "釋曰若其行者餘力資於正法圓成種智調化難調即皆藥也如五地菩薩即不妨也。",
    "X38n0682_002:0264b04_0": "○第五為主失儀戒前明捨法此明損財故也文二初制戒令行後違禁結罪前中二初總舉其時後別明其事今初。",
    "X38n0682_002:0264b07_0": "若佛子佛滅度後。",
    "X38n0682_002:0264b08_0": "釋曰佛在即無此事故後別明其事文二初分司立主。",
    "X38n0682_002:0264b10_0": "為說法主為行法主為僧坊主教化主坐禪主行來主。",
    "X38n0682_002:0264b12_0": "釋曰說法主者知法人也通於三學僧房主者三綱也教化主者知修造供養人坐禪主者明了止觀人也行來主者領徒遊方之長為者作也後據位為政。",
    "X38n0682_002:0264b16_0": "應生慈心善和鬪訟善守三寶物莫無度用如自己有。",
    "X38n0682_002:0264b18_0": "釋曰分二初通制五主慈心善和等者既為上首眾有所諍即須善和導之以德故名善也二善守下別明二主此最難故三寶之物用須如法不得同於己物要用即用又守護愛惜如其己物即免損失斯則護之如己物用之不如己物也後違禁結罪。",
    "X38n0682_002:0264b24_0": "而反亂眾鬪諍恣心用三寶物者犯輕垢罪。",
    "X38n0682_002:0264c01_0": "釋曰反亂眾者其身不正雖令不從恣心用兼犯盜戒也若有六群之類或病不護禁王賊所逼等即無過也更細思之。",
    "X38n0682_002:0264c04_0": "○第六待賓乖戒次如科顯文二初制戒令行後違禁結罪前中三初居僧所住二賓客來臻三後枑迎禮今初。",
    "X38n0682_002:0264c07_0": "若佛子先在僧坊中住。",
    "X38n0682_002:0264c08_0": "釋曰先字應平聲二賓客來臻。",
    "X38n0682_002:0264c09_0": "後見客菩薩比丘來入僧坊舍宅城邑若國王宅舍中乃至夏坐安居處及大會中。",
    "X38n0682_002:0264c11_0": "釋曰共有五處一僧房是出家菩薩住處二舍宅是在家菩薩住處三國王宅舍即禁宮中此亦在家菩薩住處城邑通於二住故在兩間然上二或即安僧在中四坐夏處隨所安居處應非少不可遍舉故云乃至謂暫住一夏之處五大會即檀越設齋之處或是僧居為正以前云僧房故後云先住僧故斯則僧所住處皆曰僧房後枑迎禮文二初迎送不虧後寢膳如法文二初自供必備。",
    "X38n0682_002:0264c19_0": "先住僧應迎來送去飲食供養房舍臥具繩牀木牀事事給與若無物應賣自身及男女身供給所須盡給與之。",
    "X38n0682_002:0264c22_0": "釋曰分二初辨富僧臥具者裀褥衾裕之類繩牀者謂要坐故木牀者即臥牀也事事者燈火諸物不可具列故云事事後明貧士在家兼男女出家唯己身盡給與者富即盡其所須貧則盡其所有後他請無踰。",
    "X38n0682_002:0265a03_0": "若有檀越來請眾僧客僧有利養分僧坊主應次第差客僧受請。",
    "X38n0682_002:0265a05_0": "釋曰客雖乍來便有其分既入眾僧之數即須依次差之後違禁結罪。",
    "X38n0682_002:0265a07_0": "而先住僧獨受請而不差客僧坊主得無量罪畜生無異非沙門非釋種姓犯輕垢罪。",
    "X38n0682_002:0265a09_0": "釋曰無量罪者固違聖制已是罪人況利屬十方故獲愆無量愚癡之甚故同畜生急於蒭粟寧有義讓不息惡心故非沙門違佛言故非種姓不從佛口生故不得成佛若病不自由或王力非己或初心未能自責等即可容也。",
    "X38n0682_002:0265a14_0": "○第七受用非法戒前則待客非儀此乃用物非法文二初別彰所犯後通結罪名前中二初舉一以制。",
    "X38n0682_002:0265a17_0": "若佛子一切不得受別請利養入己而此利養屬十方僧而別受請即取十方僧物入己。",
    "X38n0682_002:0265a19_0": "釋曰有標釋結在文可知後例諸以制。",
    "X38n0682_002:0265a20_0": "及八福田中諸佛聖人一一師僧父母病人物自己用故。",
    "X38n0682_002:0265a22_0": "釋曰意曰別請物屬眾僧即是八福田中一數此既不得用餘田之物亦不得用例同此故此可立量云云可思後通結罪名。",
    "X38n0682_002:0265b01_0": "犯輕垢罪。",
    "X38n0682_002:0265b02_0": "釋曰若以慈悲為懷益多損少都不為己意在利人即無犯也。",
    "X38n0682_002:0265b04_0": "○第八請僧踰越戒前受此請故次之也文二初制戒令行後違禁結罪前中二初標彼所欲後示此所應今初。",
    "X38n0682_002:0265b07_0": "若佛子有出家菩薩在家菩薩及一切檀越請僧福田求願之時。",
    "X38n0682_002:0265b09_0": "釋曰檀越此是兼制多有此事故二示此所應文二初正示所應。",
    "X38n0682_002:0265b11_0": "應入僧坊中問知事人今欲請僧求願知事報言次第請者即得十方賢聖僧。",
    "X38n0682_002:0265b13_0": "釋曰知事人者即維那知次第故今欲等者明本意即得等者凡是一僧乃是十方之數以心無揀擇故此一僧便同十方僧也況十方僧內凡聖相兼後校量顯勝。",
    "X38n0682_002:0265b17_0": "而世人別請五百羅漢菩薩僧不如僧次一凡夫僧。",
    "X38n0682_002:0265b18_0": "釋曰江水雖多但為一味海雖少便具百川法准詳之問別請僧豈非十方僧數耶答運心有限不能普故境隨於心成局限故後違禁結罪。",
    "X38n0682_002:0265b21_0": "若別請僧者是外道法七佛無別請法不順孝道若故別請僧者犯輕垢罪。",
    "X38n0682_002:0265b23_0": "釋曰是外道下三意展轉相釋七佛即毗婆尸等違逆佛心是不順孝道若勢力強逼或不為人情但為尊德成大利益或僧次已滿等即應可也。",
    "X38n0682_002:0265c02_0": "○第九惡枝多損戒前為感福此乃增罪文二初明所犯之事。",
    "X38n0682_002:0265c04_0": "若佛子以惡心故為利養販賣男女色自手作食自磨自舂占相男女解夢吉凶是男是女呪術工巧調鷹方法和合百種毒藥千種毒藥蛇毒生金銀毒蠱毒都無慈心無孝順心。",
    "X38n0682_002:0265c08_0": "釋曰惡心利養但因緣異耳販賣下有十三事一賣色即販婬也二自作食等惡觸非法亦世之譏嫌三占相謂占勘婚嫁相其善惡四解夢是吉是凶五辨胎中男女六呪呪詛等七術厭禱符書等八工巧謂刻畫等九調鷹謂縫耄等十合毒以多毒藥合成百千但功能遲速之異耳十一蛇毒以五月五日蛇合和毒藥[罩-卓+鬼]辟蛇等十二生金銀合假金銀等十三蠱毒取七月七日蜘蛛五月五日午時青蛇十二月猫兒共置瓮中閉之多日唯有一在即成其毒然束此十三不出六事謂三四五合故六七八合故第十已下合故若別之即為六戒無慈孝者違法損物故後結所犯之罪。",
    "X38n0682_002:0265c20_0": "若故作者犯輕垢罪。",
    "X38n0682_002:0265c21_0": "釋曰於中開遮可以意悉。",
    "X38n0682_002:0265c22_0": "○第十違禁行非戒前則惡作損生此乃公行毀禁文三初總明所犯之因。",
    "X38n0682_002:0265c24_0": "若佛子以惡心故。",
    "X38n0682_002:0266a01_0": "釋曰不信業果也二別彰所犯之事文二初巧言令色。",
    "X38n0682_002:0266a03_0": "自身謗三寶詐現親附口便說空行在有中。",
    "X38n0682_002:0266a04_0": "釋曰依三寶蔭以求財利己取行違故言詐親等文復巧言無行故云說空等後躬行不善。",
    "X38n0682_002:0266a06_0": "為白衣通致男女交會婬色作諸縛著於六齋日年三長齋月作殺生劫盜破齋犯戒者。",
    "X38n0682_002:0266a08_0": "釋曰白衣等者為媒人通於私禮此是生死之中縛著事合與解之而反縛之六齋日者一日八十五十八二十四三十此是外道六師齋日也三長月者智論說天帝以大寶鏡共諸天眾從正月一日照南州善惡具錄如是二月東三月北四月西五月還至此九月亦然故當修善殺生等者如婆藪仙等唯於此時即行殺等以惡見故此中共有四事兼有犯重詳之後通結所犯之罪。",
    "X38n0682_002:0266a16_0": "犯輕垢罪。",
    "X38n0682_002:0266a17_0": "釋曰唯除癡狂心亂或大聖示同即可餘皆不得後結勸指廣。",
    "X38n0682_002:0266a19_0": "如是十戒應當學敬心奉持制戒品中廣說。",
    "X38n0682_002:0266a20_0": "自下第四明救厄等九戒文二准前前中有九。",
    "X38n0682_002:0266a21_0": "○第一見厄不救戒前則重罪故違此乃尊厄不救文二初制戒令行後違禁結罪前中二初舉緣後正制前中二初總標惡時。",
    "X38n0682_002:0266a24_0": "佛言佛子佛滅度後於惡世中。",
    "X38n0682_002:0266b01_0": "釋曰佛在即無此事前四五百年亦應無此後別明惡事。",
    "X38n0682_002:0266b03_0": "若見外道一切惡人劫賊賣佛菩薩父母形像及賣經律販賣比丘比丘尼亦賣發菩提心菩薩道人或為官使與一切人作奴婢者。",
    "X38n0682_002:0266b06_0": "釋曰外道與佛法為怨故惡人即闡提之類不信佛法故劫賊則凶暴求財故父母形像雖少不無共有五類細分為九義添成十應有論故或為等者欠負官物賣之取錢納官因為奴婢或為犯事被官司收配與別家為賊或因離亂為官所掠賜及有功乃成賤士後正制。",
    "X38n0682_002:0266b12_0": "而菩薩見是事已應生慈悲心方便救護處處教化取物贖佛菩薩形像及比丘比丘尼發心菩薩一切經律。",
    "X38n0682_002:0266b15_0": "釋曰慈心與方便但因緣異耳後違禁結罪。",
    "X38n0682_002:0266b16_0": "若不贖者犯輕垢罪。",
    "X38n0682_002:0266b17_0": "釋曰若癡狂或錢少或教化不得或菩薩自賣志趣堅深則可也。",
    "X38n0682_002:0266b19_0": "○第二畜諸非法戒前則有厄不救此乃無辜加害文二初制戒令行。",
    "X38n0682_002:0266b21_0": "若佛子不得畜刀杖弓箭販賣輕秤小斗因官形勢取人財物害心繫縛破壞成功長養猫狸猪狗。",
    "X38n0682_002:0266b23_0": "釋曰刀等殺器前已制之今重制者傳寫悞失於中仗字從人從本總別雖殊隨取皆得販賣輕秤者或但賣於此或以此販物因官取物下或一事邐迤謂本以勢取勢取不得即以囚繫囚繫不得即破其家產或即三事迢然各別養猫等者能殺所殺皆不相應然此文中開則成六合則有四竝可知之後違禁結罪。",
    "X38n0682_002:0266c06_0": "若故養者犯輕垢罪。",
    "X38n0682_002:0266c07_0": "釋曰若或癡狂或欲慈育或護佛法等有益即許也。",
    "X38n0682_002:0266c09_0": "○第三觀聽作惡戒前貯畜非儀此觀聽作惡以為次也文二初制戒令行後違禁結罪前中二初總舉犯因。",
    "X38n0682_002:0266c12_0": "若佛子以惡心故。",
    "X38n0682_002:0266c13_0": "釋曰但順生死皆惡心也後別彰犯事。",
    "X38n0682_002:0266c14_0": "觀一切男女等鬪軍陣兵將劫賊等鬪亦不得聽吹貝皷角琴瑟箏笛箜篌歌叫伎樂之聲不得摴蒲團碁波羅塞戲彈碁六博拍毬擲石投壺牽道八道行成爪鏡蓍草楊枝鉢盂髑髏而作卜筮不得作盜賊使命。",
    "X38n0682_002:0266c19_0": "釋曰總有五類初觀鬪竸三事可知有二等字是中皆有多種鬪故二亦不得下聽音樂有十事伎樂但是總名以結上諸別兼該所餘三不得下作枝戲有九事波羅塞戲西國兵戲謂二人各布二十餘象或馬於局道所爭得要路以為勝也六愽即雙即戮或即長行等六四爪鏡下行邪術有五事爪鏡者以藥塗爪呪之便見吉凶蓍等竝呪之作術此方所無未知委的五不得下為盜賊使一事可知後約戒總制。",
    "X38n0682_002:0267a04_0": "一一不得作。",
    "X38n0682_002:0267a05_0": "釋曰五中之二也後違禁結罪。",
    "X38n0682_002:0267a06_0": "若故作者犯輕垢罪。",
    "X38n0682_002:0267a07_0": "釋曰前二中因而視聽不是惡心即可餘除化物同事方便皆不可也。",
    "X38n0682_002:0267a09_0": "○第四輙入二乘戒前斷惡此修善又前制身前防意文二初制戒令行後違禁結罪前中三初令護持禁戒。",
    "X38n0682_002:0267a12_0": "若佛子護持禁戒行住坐臥日夜六時讀誦是戒猶如金剛如帶持浮囊欲度大海如草繫比丘。",
    "X38n0682_002:0267a14_0": "釋曰分二初法護持其行則畢世無虧讀誦其文則六時無倦二猶如下諭如金剛者不可壞故如浮囊纖毫不犯涅槃所說艸繫比丘者莊嚴論說有比丘賊剝裸形以艸根繫之經宿不轉王見謂外道臣曰非也是佛弟子以右膞黑是袒露之相王問其由發心請之供養二令生大信。",
    "X38n0682_002:0267a20_0": "常生大乘善信自知我是未成之佛諸佛是已成之佛。",
    "X38n0682_002:0267a22_0": "釋曰佛本同我但由行致故我堅心三令發大心。",
    "X38n0682_002:0267a23_0": "發菩提心念念不去心。",
    "X38n0682_002:0267a24_0": "釋曰由前所信故此信不亡造次顛沛如是故云念等後違禁結罪。",
    "X38n0682_002:0267b02_0": "若起一念二乘外道心者犯輕垢罪。",
    "X38n0682_002:0267b03_0": "釋曰二乘即佛法中外道片雲凝空陽光倐掩小心繞舉大行那在若新發意或習強或示同調物等即可也。",
    "X38n0682_002:0267b06_0": "○第五不發大願戒前則心不向小此則願趣於大文二初制戒令行後違禁結罪前中二初總標大願。",
    "X38n0682_002:0267b09_0": "若佛子常應發一切願。",
    "X38n0682_002:0267b10_0": "後別顯大願。",
    "X38n0682_002:0267b11_0": "孝順父母師僧願得好師同學善知識常教我大乘經律十發趣十長養十金剛十地使我開解如法修行堅持佛戒寧捨身命念念不去心。",
    "X38n0682_002:0267b14_0": "釋曰五願一願成孝敬謂生我訓我皆有胊勞二願得師友師既開示同學研精善友傍資又增解行有知識故三常教下願解教理有能所詮可知四願如法行謂隨相離相二利等行五堅持下願護佛戒然此五願從一至五展轉而起詳之後違禁結罪。",
    "X38n0682_002:0267b20_0": "若一切菩薩不發是願者犯輕垢罪。",
    "X38n0682_002:0267b21_0": "釋曰除已得者餘皆須也。",
    "X38n0682_002:0267b22_0": "○第六不作十誓戒前對順起願此對非立誓文二初制戒令行後違禁結罪前中二初望前總標後正明誓願今初。",
    "X38n0682_002:0267c01_0": "若佛子發十大願已持佛禁戒。",
    "X38n0682_002:0267c02_0": "釋曰意云先發大願方得堅持禁戒斯則十戒之大願也後正明誓願文二初約智以自護後約悲以利他前中二初對自犯以發願。",
    "X38n0682_002:0267c05_0": "作是願言寧以此身投熾然猛火大坑刀山終不毀犯三世諸佛經律與一切女人作不淨行。",
    "X38n0682_002:0267c07_0": "釋曰火等但害一身婬罪沈於多劫故也下諸願門皆約婬戒說此有十三願若於十戒一一言之即成一百三十以不別故故以例之後對他緣以發願願各三意一是淨人料取則如盜二信心敬戒取則誑他三佛留與戒者取則盜佛之物故戒經曰破戒人無一滴水分下文云不得飲國王等水文二初偏約身口。",
    "X38n0682_002:0267c14_0": "復作是願寧以熱鐵羅網千里周匝纏身終不以破戒之身受於信心檀越一切衣服。",
    "X38n0682_002:0267c16_0": "復作是願寧以此口吞熱鐵丸及大流猛火經百千劫終不以破戒之口食於信心檀越百味飲食。",
    "X38n0682_002:0267c18_0": "復作是願寧以此身臥大流猛火羅網熱鐵地上終不以破戒之身受於信心檀越百種牀座。",
    "X38n0682_002:0267c20_0": "復作是願寧以此身受三百矛刺經一劫二劫終不以破戒之身受於信心檀越百味醫藥。",
    "X38n0682_002:0267c22_0": "復作是願寧以此身投熱鐵鑊經百千劫終不以破戒之身受於信心檀越千種房舍屋宅園林田地。",
    "X38n0682_002:0267c24_0": "復作是願寧以鐵鎚打碎此身從頭至足令如微塵終不以破戒之身受於信心檀越恭敬禮拜。",
    "X38n0682_002:0268a02_0": "後別約五塵。",
    "X38n0682_002:0268a03_0": "復作是願寧以百千熱鐵刀矛挑其兩目終不以破戒之心視他好色。",
    "X38n0682_002:0268a05_0": "復作是願寧以百千鐵錐劖刺耳根經一劫二劫終不以破戒之心聽好音聲。",
    "X38n0682_002:0268a07_0": "復作是願寧以百千刃刀割去其鼻終不以破戒之心貪齅諸香。",
    "X38n0682_002:0268a09_0": "復作是願寧以百千刃刀割斷其舌終不以破戒之心食人百味淨食。",
    "X38n0682_002:0268a11_0": "復作是願寧以利斧斬破其身終不以破戒之心貪著好觸。",
    "X38n0682_002:0268a13_0": "後約悲以利他。",
    "X38n0682_002:0268a14_0": "復作是願願一切眾生悉得成佛。",
    "X38n0682_002:0268a15_0": "後違禁結罪。",
    "X38n0682_002:0268a16_0": "而菩薩若不發是願者犯輕垢罪。",
    "X38n0682_002:0268a17_0": "釋曰唯除狂病等及己得人餘皆然也。",
    "X38n0682_002:0268a18_0": "○第七諸難處戒前則護戒心堅此乃存軀長道文二初制戒令行後違禁結罪前中二初制所應作後制所應止前中二初總標二門後別釋四事今初。",
    "X38n0682_002:0268a22_0": "若佛子常應二時頭陀冬夏坐禪結夏安居常用楊枝澡豆三衣瓶鉢坐具鍚杖香爐漉水囊手巾刀子火燧鑷子繩牀經律佛像菩薩形像。",
    "X38n0682_002:0268b01_0": "釋曰分二初標所依時節二時頭陀者春秋也非寒熱故冬夏坐禪者寒熱不出故結夏安居者依教修道故二標所用道具可知後別釋四事文四初雙明二事。",
    "X38n0682_002:0268b05_0": "而菩薩行頭陀時及遊方時行來百里千里此十八種物常隨其身。",
    "X38n0682_002:0268b07_0": "二別明頭陀。",
    "X38n0682_002:0268b08_0": "頭陀者從正月十五日至三月十五日八月十五日至十月十五日是二時中此十八種物常隨其身如鳥二翼。",
    "X38n0682_002:0268b11_0": "釋曰二翼之言論時及物三總彰布薩。",
    "X38n0682_002:0268b12_0": "若布薩日新學菩薩半月半月布薩誦十重四十八輕戒若誦戒時當於諸佛菩薩形像前誦一人布薩即一人誦若二人三人乃至百千人亦一人誦誦者高座聽者下座各各被九條七條五條袈裟。",
    "X38n0682_002:0268b16_0": "釋曰分二初定時主布薩此云淨住不犯默然故二若誦下示軌儀四例結安居。",
    "X38n0682_002:0268b18_0": "結夏安居時亦應一一如法。",
    "X38n0682_002:0268b19_0": "釋曰坐禪含在一一之中後制所應止。",
    "X38n0682_002:0268b20_0": "若行頭陀時莫入難處若惡國界若惡國王土地高下草木深邃師子虎狼水火風難及以劫賊道路毒蛇一切難處悉不得入頭陀行道乃至夏坐安居時是諸難處皆不得入。",
    "X38n0682_002:0268b24_0": "釋曰分二初偏制頭陀十二處有標釋結詳之可見國難惡王離合皆得二乃至兼戒餘事乃至之言該於坐禪遊方後違禁結罪。",
    "X38n0682_002:0268c03_0": "若故入者犯輕垢罪。",
    "X38n0682_002:0268c04_0": "釋曰兼上應作不作共為二戒前若貧不能置等後為自調及調眾生或更無好路好處事不獲等即可也。",
    "X38n0682_002:0268c07_0": "○第八眾坐乖儀戒前外避厄難此內順眾儀文二初制戒令行後違禁結罪前中三初約戒立制。",
    "X38n0682_002:0268c09_0": "若佛子應如法次第坐先受戒者在前坐後受戒者在後坐。",
    "X38n0682_002:0268c11_0": "二舉人重制。",
    "X38n0682_002:0268c12_0": "不問老少比丘比丘尼貴人國王王子乃至黃門奴婢皆應先受戒者在前坐後受戒者次第而坐。",
    "X38n0682_002:0268c14_0": "釋曰僧尼二眾各自隨儀非容於雜三對邪顯制。",
    "X38n0682_002:0268c15_0": "莫如外道癡人若老若少無前無後坐無次第如兵奴之法我佛法中先者先坐後者後坐。",
    "X38n0682_002:0268c17_0": "釋曰不知禮法實為兵奴兵奴豈非癡人後違禁結罪。",
    "X38n0682_002:0268c19_0": "而菩薩不如法次第坐者犯輕垢罪。",
    "X38n0682_002:0268c20_0": "釋曰除狂亂及不知大小及不穩便等即可也。",
    "X38n0682_002:0268c21_0": "○第九應講不講戒前明坐儀此明道引文二初制戒令行後違禁結罪前中二初令化安僧後使講經益物今初。",
    "X38n0682_002:0268c24_0": "若佛子常應教化一切眾生建立僧坊山林園田立作佛塔冬夏安居坐禪處所一切行道處皆應立之。",
    "X38n0682_002:0269a02_0": "釋曰山林園田是立僧坊及佛塔處一切行道處者誦習禮念等處也但是修習佛道之處後使講經益物文二初總明。",
    "X38n0682_002:0269a05_0": "而菩薩應為一切眾生講說大乘經律。",
    "X38n0682_002:0269a06_0": "後別示文三初救疾等諸難。",
    "X38n0682_002:0269a07_0": "佛疾病國難賊難父母兄弟和上阿闍棃亡滅之日及三七日四五七日乃至七七日亦應讀誦講說大乘經律一切齋會求願。",
    "X38n0682_002:0269a10_0": "釋曰國難飢饉等賊難兵戈等二救火等諸難。",
    "X38n0682_002:0269a11_0": "行來治生大火所燒大水所漂黑風所吹船舫江河大海羅剎之難亦讀誦講說此經律。",
    "X38n0682_002:0269a13_0": "三救罪等諸難。",
    "X38n0682_002:0269a14_0": "乃至一切罪報三惡七逆八難杻械加鏁繫縛其身多婬多嗔多愚癡多疾病皆應讀誦講說此經律。",
    "X38n0682_002:0269a16_0": "釋曰三惡是三塗與八難及繫縛等是報障七逆是業障婬瞋癡是煩惱障後違禁結罪。",
    "X38n0682_002:0269a18_0": "而新學菩薩若不爾者犯輕垢罪。",
    "X38n0682_002:0269a19_0": "釋曰兼前教化以為二戒入位大士利益事別不必講經故唯勗新學若彼不受化或不解經又無人所請等即不犯也後勸結指廣。",
    "X38n0682_002:0269a22_0": "如是九戒應當學敬心奉持梵檀品中當說。",
    "X38n0682_002:0269a23_0": "釋曰梵檀此云默擯。",
    "X38n0682_002:0269a24_0": "自下第五明受戒等九戒文二初具彰戒相後結數勸持前中亦有九。",
    "X38n0682_002:0269b02_0": "○第一不受眾生戒前令講法益生此令受戒攝物故次之也文二初制戒令行後違禁結罪前中二初明受戒之機後明受戒之法今初。",
    "X38n0682_002:0269b05_0": "佛言佛子與人受戒時不得簡擇一切國王王子大臣百官比丘比丘尼信男信女婬男婬女十八梵六欲天子無根二根黃門奴婢一切鬼神盡得受戒。",
    "X38n0682_002:0269b08_0": "釋曰有十七類可知後明受戒之法文二初教染衣色後示受戒相前中二初約一方正示。",
    "X38n0682_002:0269b10_0": "應教身所著袈裟皆使壞色與道相應皆染使青黃赤黑紫色一切染衣乃至臥具盡以壞色身所著衣一切染色。",
    "X38n0682_002:0269b13_0": "釋曰袈裟梵音此云染色著此則逆於情愛故與道相應二約餘國以辨異。",
    "X38n0682_002:0269b15_0": "若一切國土中國人所著衣服比丘皆應與其俗服有異。",
    "X38n0682_002:0269b17_0": "釋曰諸國土中衣色不一但要異俗何限青黃後示受戒相文三初揀去七逆。",
    "X38n0682_002:0269b19_0": "若欲受戒時師應問言汝現身不作七逆罪不菩薩法師不得與七逆人現身受戒七逆者出佛身血殺父殺母殺和上殺阿闍棃破羯磨轉法輪僧殺聖人若具七遮即現身不得戒。",
    "X38n0682_002:0269b23_0": "釋曰聖人即五果十地若具等者七中有一即非戒器故總名逆現身者現生造逆之身過去不知二却收餘類。",
    "X38n0682_002:0269c02_0": "餘一切人盡得受戒。",
    "X38n0682_002:0269c03_0": "釋曰除七逆外解法師語者三釋其所由。",
    "X38n0682_002:0269c04_0": "出家人法不向國王禮拜不向父母禮拜六親不敬鬼神不禮。",
    "X38n0682_002:0269c06_0": "釋曰無罪具戒方堪他敬七逆反此故揀不堪六親等者於其六親但不拜而已鬼神之屬亦敬而遠之今文失耳後違禁結罪。",
    "X38n0682_002:0269c09_0": "但解法師語有百里千里來求法者而菩薩法師以惡心瞋心而不即與授一切眾生戒者犯輕垢罪。",
    "X38n0682_002:0269c11_0": "釋曰應云不即與一切眾生受戒恐彼解脫即是惡心不得財利即應瞋也兼前失儀即為二事除病或不解或彼非器即可也餘皆犯也。",
    "X38n0682_002:0269c14_0": "○第二無德作師戒前則有解不為此乃無德強作文二初制戒令行後違禁結罪前中二初舉緣。",
    "X38n0682_002:0269c16_0": "若佛子教化人起信心時菩薩與他人作教戒法師者。",
    "X38n0682_002:0269c18_0": "釋曰或自教化或別人教化令起信心後正示文二初示所要達後明所不敏前中初別明後總結前中二初教資請師。",
    "X38n0682_002:0269c21_0": "若見欲受戒人應教請二師和上阿闍棃。",
    "X38n0682_002:0269c22_0": "釋曰今請釋迦為和尚已為闍棃後問罪揀器文三初問遮罪。",
    "X38n0682_002:0269c24_0": "二師應問言汝有七遮罪不若現身有七遮罪者師不應與受戒若無七遮者得與受戒。",
    "X38n0682_002:0270a02_0": "二問重罪文二初罪滅戒存而不受。",
    "X38n0682_002:0270a03_0": "若有犯十戒者應教懺悔在佛菩薩形像前日夜六時誦十重四十八輕戒苦到禮三世千佛得見好相若一七日二三七日乃至一年要見好相好相者佛來摩頂見光華種種異相便得滅罪。",
    "X38n0682_002:0270a07_0": "釋曰三世千佛者大略言之也種種異相者聖境多端故滅者此則舊戒却圓更不要受後罪存戒滅而可受。",
    "X38n0682_002:0270a10_0": "若無好相雖懺無益是人現身亦不得戒而得增受戒。",
    "X38n0682_002:0270a12_0": "釋曰現身不得戒者不得舊戒得增受戒者增由重也得與重受戒也三問輕罪。",
    "X38n0682_002:0270a14_0": "若犯四十八輕戒者對首懺悔罪便得滅不同七遮。",
    "X38n0682_002:0270a15_0": "釋曰應云據此亦不同十重文之略也後總結。",
    "X38n0682_002:0270a16_0": "而教誡師於是法中一一好解。",
    "X38n0682_002:0270a17_0": "釋曰好解者如法實解也二明所不敏文二初別明。",
    "X38n0682_002:0270a19_0": "若不解大乘經律若輕若重是非之相不解第一義諦習種性長養性不可壞性道種性正法性其中多少觀行出入十禪支一切行法。",
    "X38n0682_002:0270a22_0": "釋曰有四法一教二理三位次配十住等乃至佛位謂初習次養性成不壞入於聖道覺正法故四行多少觀行出入者約地前地上八地前後等料揀說之十禪支者四禪共有十支謂初禪五支一尋二伺三喜四樂五定二禪一內淨三禪三捨念正知四禪一不苦不樂俱如別說二總結。",
    "X38n0682_002:0270b04_0": "一一不得此法中意。",
    "X38n0682_002:0270b05_0": "後違禁結罪。",
    "X38n0682_002:0270b06_0": "而菩薩為利養故為名聞故惡求多求貪利弟子而詐現解一切經律是自欺詐亦欺詐他人故與人授戒者犯輕垢罪。",
    "X38n0682_002:0270b09_0": "釋曰不出三事一名聞二利養三弟子稍解不為利養等即可也。",
    "X38n0682_002:0270b11_0": "○第三非處說法戒前則詐解此乃妄傳也文二初制戒令行後違禁結罪前中三初總示不應。",
    "X38n0682_002:0270b13_0": "若佛子不得為利養故於未受菩薩戒者前若外道惡人前說此千佛大戒邪見人前亦不得說。",
    "X38n0682_002:0270b15_0": "釋曰千佛者千華上佛或是諸佛上云三世千佛大數言故以一切佛皆同說故三雙彰可不。",
    "X38n0682_002:0270b17_0": "除國王餘一切人不得說。",
    "X38n0682_002:0270b18_0": "釋曰國王有損益佛法之力故三釋制所由。",
    "X38n0682_002:0270b19_0": "是惡人輩不受佛戒名為畜生生生之處不見三寶如木石無心名為外道邪見人輩木頭無異。",
    "X38n0682_002:0270b21_0": "釋曰愚癡之甚雖人如畜當必墮落故不見三寶或不奉三寶則見如不見如木石無心者不知業果故亦是貶責之言實非無心後違禁結罪。",
    "X38n0682_002:0270b24_0": "而菩薩於是惡人前說七佛教戒者犯輕垢罪。",
    "X38n0682_002:0270c01_0": "釋曰若或對王若有實信或犯亂不覺等即可也。",
    "X38n0682_002:0270c02_0": "○第四無知敗禁戒前不應說而說此不應犯而犯文二初示所不應後作所成犯前中二初總標本末。",
    "X38n0682_002:0270c05_0": "若佛子信心出家受佛正戒故起心毀犯聖戒者。",
    "X38n0682_002:0270c06_0": "釋曰信心者出家受戒因故起心犯者無慚等不善心也聖即正也二別示過非也。",
    "X38n0682_002:0270c08_0": "不得受一切檀越供養亦不得國王地上行不得飲國王水五千大鬼常遮其前鬼言大賊若入坊舍城邑宅中鬼復常掃其脚跡一切世人咸皆罵言佛法中賊一切眾生眼不欲見犯戒之人畜生無異木頭無異。",
    "X38n0682_002:0270c13_0": "釋曰不得受供者非真福田故亦不得等者水屬王百姓以輪稅故得行得飲若持戒奉於福稅即可今反此故五千等者比丘戒全故神衛鬼去今反此故神去鬼來一切等者賺他信施都無福利如盜僧物故人鬼皆罵賊一切眾生等者到處災故無有慈悲故不欲見之癡無覺知故同畜木二作所成犯。",
    "X38n0682_002:0270c20_0": "若故毀正戒者犯輕垢罪。",
    "X38n0682_002:0270c21_0": "釋曰故者除悞也開遮之理思而示之。",
    "X38n0682_002:0270c22_0": "○第五不敬經律戒前犯行此輕教故文二初制戒令行。",
    "X38n0682_002:0270c24_0": "若佛子常應一心受持讀誦大乘經律剝皮為紙刺血為墨以髓為水折骨為筆書寫佛戒木皮穀紙絹素竹帛亦悉書持常以七寶無價香華一切雜寶為箱囊盛經律卷。",
    "X38n0682_002:0271a04_0": "釋曰縱不剝皮刺血必須紙素香華二違禁結罪。",
    "X38n0682_002:0271a05_0": "若不如法供養者犯輕垢罪。",
    "X38n0682_002:0271a06_0": "釋曰除貧病入定貪化生等不犯餘皆犯也。",
    "X38n0682_002:0271a07_0": "○第六不化眾生戒前誡輕教此教發心文二初制戒令行後違禁結罪前中二初舉因顯戒。",
    "X38n0682_002:0271a09_0": "若佛子常起大悲心。",
    "X38n0682_002:0271a10_0": "釋曰悲為化本復是無緣二對生成戒文二初令受戒。",
    "X38n0682_002:0271a12_0": "若入一切城邑舍宅見一切眾生應當唱言汝等眾生盡應受三歸十戒。",
    "X38n0682_002:0271a14_0": "釋曰謂歸三寶十重戒二令發心。",
    "X38n0682_002:0271a15_0": "若見牛馬猪羊一切畜生應心念口言汝是畜生發菩提心而菩薩入一切處山川林野皆使一切眾生發菩提心。",
    "X38n0682_002:0271a18_0": "釋曰心念口言者心發悲念如念啟言意在警覺聞之作遠因緣也後違禁結罪。",
    "X38n0682_002:0271a20_0": "是菩薩若不發教化眾生心者犯輕垢罪。",
    "X38n0682_002:0271a21_0": "釋曰除病及不解。",
    "X38n0682_002:0271a22_0": "○第七說法乖儀戒前教發心此令敬法文二初制戒令行後違禁結罪前中二初舉因緣。",
    "X38n0682_002:0271a24_0": "若佛子常行教化起大悲心若入檀越貴人家一切眾中。",
    "X38n0682_002:0271b02_0": "釋曰悲即化本是因也人家即化處一切眾即化機上二皆緣言貴人家者此等多慢故偏舉之後制戒令行文二初令止非儀。",
    "X38n0682_002:0271b05_0": "不得立為白衣說法應在白衣眾前高座上坐法師比丘不得地立為四眾說法。",
    "X38n0682_002:0271b07_0": "二令依是儀。",
    "X38n0682_002:0271b08_0": "若說法時法師高座香華供養四眾聽者下座如孝順父母敬順師教如事火婆羅門。",
    "X38n0682_002:0271b10_0": "後違禁結罪。",
    "X38n0682_002:0271b11_0": "其說法者若不如法說者犯輕垢罪。",
    "X38n0682_002:0271b12_0": "釋曰不如法者通明三業唯除化病及王臣力或已不解。",
    "X38n0682_002:0271b14_0": "○第八非法立制戒前說法非儀此恃威滅法文四初舉犯人。",
    "X38n0682_002:0271b16_0": "若佛子皆以信心受佛戒者若國王太子百官四部弟子。",
    "X38n0682_002:0271b18_0": "釋曰信心受戒者不受戒者非此所明故四部僧尼士女二彰犯戒相。",
    "X38n0682_002:0271b20_0": "自恃高貴破滅佛法戒律明作制法制我四部弟子不聽出家行道亦復不聽造立形像佛塔經律立統官制眾使安籍記僧菩薩比丘地立白衣高座廣行非法如兵奴事主而菩薩正應受一切人供養而反為官走使非法非律若國王百官好心受佛戒者。",
    "X38n0682_002:0271c01_0": "釋曰與前四部異者前是能制此為所制又王臣自恃四部憑他皆起異端立茲嚴令三辨犯戒業。",
    "X38n0682_002:0271c03_0": "莫作是破三寶之罪。",
    "X38n0682_002:0271c04_0": "釋曰同體是別相所顯別相是住持所成今破住持即三種俱破初受後破有始無畢詩曰靡不有初鮮充有終即斯義也四結犯戒罪。",
    "X38n0682_002:0271c07_0": "若故作破法者犯輕垢罪。",
    "X38n0682_002:0271c08_0": "釋曰除制惡人出家不許造像賣等餘皆成犯。",
    "X38n0682_002:0271c09_0": "○第九自傷內法戒前恃自威此憑他勢故次來也文二初制戒令行後違禁結罪前中二初制所應止後制所應作前中三初法。",
    "X38n0682_002:0271c12_0": "若佛子以好心出家而為名聞利養於國王百官前說佛戒者橫與比丘比丘尼菩薩戒弟子作繫縛事如獄囚法如兵奴之法。",
    "X38n0682_002:0271c15_0": "釋曰苟求名利容侫王候或傍法以黑人或傍法以黑法事既非理橫義照然因使不安名為繫縛二諭。",
    "X38n0682_002:0271c18_0": "如師子身中蟲自食師子肉。",
    "X38n0682_002:0271c19_0": "釋曰蓮華面經說師子死諸虫獸不敢食師子身中虫自食之三合。",
    "X38n0682_002:0271c21_0": "非餘外蟲如是佛子自破佛法非外道天魔能破壞。",
    "X38n0682_002:0271c22_0": "釋曰外魔不能壞佛法佛弟子自壞也然合文與諭中相影詳之後制所應作文二初順顯戒精後反彰罪重前中文二初以諭略顯。",
    "X38n0682_002:0272a01_0": "若受佛戒者應護佛戒如念一子如事父母不可毀破。",
    "X38n0682_002:0272a03_0": "釋曰父母有其一子憐念情深孝子於其父母愛敬尤切菩薩於其佛戒豈不然乎後寄事廣明。",
    "X38n0682_002:0272a05_0": "而菩薩聞外道惡人以惡言謗破佛戒之聲如三百鉾刺心千刀萬杖打拍其身等無有異寧自入地獄經百劫而不一聞惡人以惡言謗破佛戒之聲。",
    "X38n0682_002:0272a08_0": "釋曰輕身重法故大慈為本故是佛本源故後反彰罪重。",
    "X38n0682_002:0272a10_0": "而況自破佛戒教人破法因緣亦無孝順之心。",
    "X38n0682_002:0272a11_0": "釋曰破法者廢其教教廢則理等俱廢故無孝順心者壞三寶殃父母違至理故後違禁結罪。",
    "X38n0682_002:0272a13_0": "若故作者犯輕垢罪。",
    "X38n0682_002:0272a14_0": "釋曰教道不弘尚為有過反更破壞豈得無愆若不緣名利翻以慈心為法去害即不成犯後結數勸持。",
    "X38n0682_002:0272a17_0": "如是九戒應當學敬心奉持。",
    "X38n0682_002:0272a18_0": "後結勸修學。",
    "X38n0682_002:0272a19_0": "諸佛子是四十八輕戒汝等受持過去諸菩薩已誦未來諸菩薩當誦現在諸菩薩今誦。",
    "X38n0682_002:0272a21_0": "後結勸受持文四初舉佛同誦。",
    "X38n0682_002:0272a22_0": "諸佛子諦聽此十重四十八輕戒三世諸佛已誦當誦今誦我今亦如是誦。",
    "X38n0682_002:0272a24_0": "釋曰三世皆通十方真應我今亦誦即是現在應身二勸眾普持。",
    "X38n0682_002:0272b02_0": "汝等一切大眾若國王王子百官比丘比丘尼信男信女受持菩薩戒者應受持讀誦解說書寫。",
    "X38n0682_002:0272b04_0": "釋曰人之七類法行有六可知三流通不絕。",
    "X38n0682_002:0272b05_0": "佛性常住戒卷流通三世一切眾生化化不絕。",
    "X38n0682_002:0272b06_0": "釋曰展轉受則戒卷流通流通即化化不絕三身自在佛性常住又佛性是理戒戒卷為教化化不絕兼於行果謂依教詮理依理起行得果斯則理等三法非教不成是故慇懃勸令弘教法華曰以佛教門出三界苦即其義也四傳受利益。",
    "X38n0682_002:0272b11_0": "得見千佛佛佛授手世世不墮惡道八難常生人道天中。",
    "X38n0682_002:0272b13_0": "釋曰見千佛者得入二地授手者佛以慈教為手人以信心為手二手相契即是授義不墮惡道等者持小乘戒尚得如此況菩薩戒耶授手之義由茲著矣十三傍地故生人道天中又為道器身攝眾生處不同凡小耳三結勸流通分文四初結所略說。",
    "X38n0682_002:0272b19_0": "我今在此樹下略開七佛法戒。",
    "X38n0682_002:0272b20_0": "釋曰我即釋迦所稱樹謂菩提之樹如毛頭計故曰略開然雖親授舍那今論展轉故言七佛七佛猶略其實無邊盡過去佛戒即是法軌則義故二勸眾奉持。",
    "X38n0682_002:0272b24_0": "汝等大眾當一心學波羅提木叉歡喜奉行。",
    "X38n0682_002:0272c01_0": "釋曰大眾者正是地前兼地上也一心者地前略機未有餘力苟宜篤志故此勗之奉行者受學傳通自他兼利三懸指廣文。",
    "X38n0682_002:0272c04_0": "如無相天王品勸學中一一廣明。",
    "X38n0682_002:0272c05_0": "四群賢頂受。",
    "X38n0682_002:0272c06_0": "三千學士時坐聽者聞佛自誦心心頂戴歡喜受持。",
    "X38n0682_002:0272c07_0": "釋曰三千學士與時坐聽者勢通離合合則一眾已現當學皆名學士同聽聞故若離說者三千學士即地上菩薩或但地前已學現學之流時坐聽者即地前菩薩或是未學當學之輩聞佛自誦者敬受之因餘不爾故心心等者頂禮戴仰情歡足蹈領納文旨不遺不忘人眾不一故曰心心亦可念念相續表其殷極且如遠叶群方邇佛七聖十身之所讚千佛之所弘爰及釋迦是頒金口況以妙圓三點尅備二嚴為利厥深孰不歡荷敬行而已哉。",
    "X38n0682_002:0272c17_0": "爾時釋迦牟尼佛說上蓮華臺藏世界盧舍那佛所說心地法門品中十無盡戒法品竟千百億釋迦亦如是說從摩醯首羅天王宮至此道樹下十住處說法品為一切菩薩不可說大眾受持讀誦解說其義亦如是千百億世界蓮華藏世界微塵世界一切佛心藏地藏戒藏無量行願藏因果佛性常住藏如如一切佛說無量一切法藏竟千百億世界中一切眾生受持歡喜奉行若廣開心地相相如佛華光王七行品中說。",
    "X38n0682_002:0273a02_0": "　明人忍慧強　　能持如是法　　未成佛道間　安獲五種利　　一者十方佛　　愍念常守護　二者命終時　　正見心歡喜　　三者生生處　為淨菩薩友　　四者功德聚　　戒度悉成就　五者今後世　　性戒福慧滿　　此是佛行處　智者善思量　　計我著相者　　不能信是法　滅盡取證者　　亦非下種處　　欲長菩提苗　光明照世間　　應當靜觀察　　諸法真實相　不生亦不滅　　不常復不斷　　不一亦不異　不來亦不去　　如是一心中　　方便勤莊嚴　菩薩所應作　　應當次第學　　於學於無學　勿生分別想　　是名第一道　　亦名摩訶衍　一切戲論惡　　悉由是處滅　　諸佛薩婆若　悉由是處出　　是故諸佛子　　宜發大勇猛　於諸佛淨戒　　護持如明珠　　過去諸菩薩　已於是中學　　未來者當學　　現在者今學　此是佛行處　　聖主所稱歎　　我已隨順說　福德無量聚　　迴以施眾生　　共向一切智　願聞是法者　　疾得成佛道梵網經記卷下(終)承久三年十一月下旬於賀茂佛光山禪堂院住房以草案之本清書畢華嚴宗沙門高辨。",
    "X38n0682_002:0273b06_0": "寬喜二年十二月十六日病後勵力兩卷拜寫心中懇念諸佛照覽願以此功必共自他生知足之雲閣拜慈尊之金容聞法悟道利益群生新發意僧空辨記之(四十七歲)。",
    "X38n0682_002:0273b10_0": "同三年辛卯正月十一日於禪河院菴室再校了沙門空辨(四十八歲)。",
    "X38n0682_002:0273b12_0": "元祿六秊太歲癸酉春二月上旬於洛東禪林僧坊參訂諸本肇成全本釋昇堂謹識。",
    "X38n0682_002:0273b20_0": "竊以菩薩戒者是為千佛之要路萬聖之嚴師三身四智之源五眼六通之本昔有天竺三藏羅什法師譯梵語以就秦言翻祕詞而為顯說次有沙門傳奧造疏弘揚雖綿歷於帝朝奈因緣而隱滯即有常山重地龍興上人法諱慧顒製科并鈔方得法義齊備旨趣周圓望濟益於群靈覩流通於遠代爰有俗弟子張令珣一聞勝事便整衷懷乃命良工刻茲印板總斯巨福普用裝嚴所集殊因竝將迴向迴向真常實性迴向正等菩提法界有情皆霑利樂皇王萬歲宰輔千秋四夷八表以永安君正臣忠而□□師僧父母善友良緣歷劫先亡連綿眷戚皆願同生知足共禮慈尊三塗湮沒以停[酉*爰]六趣漂沈□息浪在眾生數盡啟真誠凡是有情俱登佛道。",
    "X38n0682_002:0273c08_1": "時太平興國八年歲次癸未冬十一月八日工畢記。",
    "X38n0682_002:0273c10_0": "鎮府龍興寺講法華梵網經沙門歸演　挍勘銀青光祿太夫撿挍太子賓客兼殿中侍御史頴州尤從都押衛張令珣　印施妻李氏長男　敕賜及第進士惟吉次男惟一忠吉則吉永吉新婦李氏曹氏衛氏重刻梵網經記後序梵網戒線者舍那薄伽體性之本原菩提薩埵修證之法門其大本也六十一品廣說斯義今此品所明菩薩心地戒常住佛性之尸羅大士首心之學處也大都受持者熱惱去而清涼生頂戴者無間空而忉利現此其福利恩有稟難思議據之譯家特誦出此一品流布於叔世以為累劫之津梁倭漢龍象又從而為之釋者五十有餘家無不蘭菊檀美雖然明月之珠不能無考獨文約義豐致令後徒而便受隨者其惟莫越於奧法師記然斯篇也淹歷年所罕傳於世今年春出游洛西始從白雲菴住上人譚及上人唯然曰吾傳此本久為鴻珍幸壽文梓以福群生當贈舍諸予驚喜曰是真好事苟勿負約於是上人寄彼本來請予挍勘予合爪閱之惜乎傳錄婉轉錯節衍語至若間混魚魯每繙無不釋卷而歎遂憤激之餘自不顧陋拙管識之所暨叨分會經記補苴罅漏紏正錯謬以命工壽梓謀公諸天下噫此篇流通戒宗朗如日星也刻成姑述其顛末如是。",
    "X38n0682_002:0274a14_1": "旹歲次癸酉元祿六禩冬十二月既望釋昇堂和南序于洛東禪林僧坊"
}