{
    "X39n0714_003:0876c06_0": "四分律含注戒本疏行宗記三上之一",
    "X39n0714_003:0876c08_0": "大宋餘杭沙門　元照　述",
    "X39n0714_003:0876c09_0": "【疏】四分律含注戒本疏卷第三(上)(始僧殘第八終三十末義)【疏】終南大一山沙門釋　道宣　撰【律】八無根波羅夷謗戒。",
    "X39n0714_003:0876c12_0": "【疏】第八無根重罪謗戒。",
    "X39n0714_003:0876c13_0": "第八無根對後戒重罪簡下篇。",
    "X39n0714_003:0876c14_0": "【疏】六意開之一制意二釋名三罪多少四結分齊五具緣成六闕緣義。",
    "X39n0714_003:0876c16_0": "【疏】初制意者夫出家同住和合為先互相將護許無惱觸今乃內懷瞋忿橫搆虗狀以彼重事加謗前人自壞心行增長生死以滅正法又復塵坌良善甄在眾外惱他一生廢修正業欺罔事深特須聖制如多論云一為護自行令法久住故二為止毀謗令梵行者安樂修道不妨正業故。",
    "X39n0714_003:0876c22_0": "制意中三初敘所應為許猶令也今下明不應為又三初敘過自下彰損有三初即損自以下滅法又下損他甄在眾外者以犯四重即應滅擯故欺下三示立教如下引證翻上三損成三益故。",
    "X39n0714_003:0877a02_0": "【疏】次釋名者內無三實故曰無根以重加誣名之為謗無根謗非是戒乃是戒家所防戒者能治之行能所通舉故曰也。",
    "X39n0714_003:0877a05_0": "釋名中初牒釋三實即見聞疑言以重者簡下諸聚罪輕降故無下次總示言所防者顯是過相。",
    "X39n0714_003:0877a07_0": "【疏】三約罪多少者。",
    "X39n0714_003:0877a08_0": "【疏】問謗他犯重實無三根誑僧見聞望僧虗解犯妄提否答如見論云無別提罪以謗一向假虗成故。",
    "X39n0714_003:0877a10_0": "三單犯中問意以謗本從虗理須兼妄答中論明單犯無別業故。",
    "X39n0714_003:0877a12_0": "【疏】問如殺畜生及望主財命俱損結二罪亦應望僧是虗解何為不結謗妄邪答不同也以謗一向假虗成無有懷實而行謗盜有損主及害畜故結雙單兩種別。",
    "X39n0714_003:0877a16_0": "轉難中初難七言為句上二句舉類謂殺他人之畜望損主夷望殺畜提容兩犯故下二句並難答中顯別可解雙單即對盜謗也。",
    "X39n0714_003:0877a19_0": "【疏】若爾何故見論云為盜殺草但犯吉乃至受寄本主求觝言不受亦同吉皆是盜戒方便罪何得相似無別罪答所引相成無墮罪當知由同我前義。",
    "X39n0714_003:0877a22_0": "次難中初舉二文彼云若草木於寶藏上生若斫伐者得突吉羅受寄文如盜戒引殺二即壞生觝言是妄語並不犯提則與上文損主及畜雙結義乖故引為難皆下正難相似謂與前事同無別罪謂無別果罪也答中上句領前難詞相成即盜家方便下句反成單犯正符前義。",
    "X39n0714_003:0877b04_0": "【疏】今準別論單雙俱得元情專謗無妄心約心唯可結一罪若兼誑謗兩種心僧誑人謗結二罪如前殺父兼羅漢兩舌相對互說相也。",
    "X39n0714_003:0877b07_0": "次約義中初總標下約兩意故曰別論元下別示約心單複釋通兩解以業隨心結故罪有雙單善達持犯於茲見矣如下舉例有二初舉殺戒故指如前謂父成羅漢而行殺者若但殺父不知成聖止得一逆若知是聖則兼二逆次引兩舌戒即多論中以口三過互歷為句故云相對一是兩舌非妄語惡口二是兩舌非妄語是惡口三是兩舌是妄語非惡口四三種俱是餘二為頭互歷亦爾並由心緣兼獨故使犯有雙單證今謗妄不可偏判矣。",
    "X39n0714_003:0877b17_0": "【疏】四得罪分齊者問元謗望僧治何因言了結答能謗意在治治擯唯僧力遂瞋暢思決言了便成犯。",
    "X39n0714_003:0877b19_0": "四分齊中以謗本為治言了未遂故答中上二句明不待治由出僧力不由我故下二句顯從言了遂瞋暢思顯示業成故。",
    "X39n0714_003:0877b22_0": "【疏】犯緣具八。",
    "X39n0714_003:0877b23_0": "【疏】初是僧尼簡下三眾謗惱情微不廢修行又所犯名輕能謗罪重故也如打奪上二則重下三便輕可知。",
    "X39n0714_003:0877c02_0": "五中初緣正明二意初約惱輕釋不廢修行即是惱微由是下位無大損故又下次約犯輕釋以沙彌犯重通制吉羅謗吉犯殘義非便故如下舉例打及奪衣僧尼同制。",
    "X39n0714_003:0877c06_0": "【疏】若爾不應隨舉僧同結一墮者答莫非違眾是同所以大小齊結。",
    "X39n0714_003:0877c08_0": "次引難中初難以九十中隨舉比丘隨擯沙彌並犯墮故答中彼望眾法不對人故。",
    "X39n0714_003:0877c10_0": "【疏】若爾違眾是一故犯同墮僧尼互相隨順亦齊約眾罪分輕重者答尼隨有教可倚故夷僧則反前故吉。",
    "X39n0714_003:0877c13_0": "次難中以尼隨僧犯夷僧隨尼犯吉亦同違眾不當犯別答中尼倚教者以八敬中制恭敬故僧無奉下故云反前。",
    "X39n0714_003:0877c16_0": "【疏】問何故謗同大僧打同小學者答打據位卑謗約修行不同餘律打謗同罪。",
    "X39n0714_003:0877c18_0": "問打謗中謗既同僧打不當異答中初以義分不下簡部別。",
    "X39n0714_003:0878a02_0": "【疏】二雖是比丘要須體淨如戒本中非波羅夷下文說實則是開位又如出聚出房淨者犯故。",
    "X39n0714_003:0878a04_0": "次依古第二緣初師中初立義如下引證下文即不犯中戒本簡非不犯開實驗取境淨方入正犯又下舉例二戒並見九十準彼若破戒見威儀等皆不犯故。",
    "X39n0714_003:0878a08_0": "【疏】若爾何故律云彼人不清淨加謗犯殘者答云犯下四篇也。",
    "X39n0714_003:0878a10_0": "釋疑中初難引文頗乖上義答約下篇釋通不淨。",
    "X39n0714_003:0878a11_0": "【疏】若爾打犯重墮者答相惱約位謗就治罰故清濁須別。",
    "X39n0714_003:0878a13_0": "次難上簡犯重謗不成殘打同淨境故引為並答文可解。",
    "X39n0714_003:0878a15_0": "【疏】又解謗不淨者亦成謗夫論眾法但取見聞故違見淨說言犯罪自惱惱他故清濁同罪不可如緣如初戒緣可有尼也戒本言非者據緣起說亦可就於謗情非想淨者何由加謗故也下云說實三根想實也故律云彼人不清淨不見彼犯故謗成殘如犯重打提之相。",
    "X39n0714_003:0878a21_0": "次師中初立理但取見聞者三根外淨不論內德不可下次釋妨有二即破前師所據初釋戒本文以沓婆清淨故牒入戒本至論後犯不必如文如初等者舉事以質誣謗沓婆比丘為緣本不因尼及論後制則通尼眾顯知定犯不必從緣亦可就謗情者謂戒本所牒乃約能謗心不論所謗境下下次釋不犯文三根想實亦據能謗則無所妨故下引證彼不清淨明境穢也正據犯重豈止餘篇不見彼犯謂三根淨也如下準例在前理違故作強釋於今義順故引為據。",
    "X39n0714_003:0878b07_0": "【疏】上來解者相從出之然下如律遮法中云若遮無根無餘作者不成遮治其謗罪無餘是重作是曾犯何得後言。",
    "X39n0714_003:0878b10_0": "今取中初科上二句結指然下引示則取後解如字寫多遮法即遮犍度則顯實犯但使無根即成誣謗故云何得後言。",
    "X39n0714_003:0878b13_0": "【疏】問若使所謗實不淨能謗謂淨解向他道不淨得犯僧殘者前境實非人心中作人想隨想而行殺應得波羅夷若所殺實非人我亦所謗實不淨心中作淨解我亦心中作人解若使淨想說不淨便得僧殘罪亦應人想殺非人同得波羅夷若言謗他心是惡望心故結罪殺人心極惡何為非大重今反論相者實淨想不淨向他道不淨此無僧殘罪實人想非人加害亦非重此既是齊何故不淨淨想謗非人人想殺結罪有輕重謗殺二相境心俱違有何義理因果不等。",
    "X39n0714_003:0878b23_0": "並難中即以殺戒境想相並大分為二初約境差順難又二初約境實難展轉二重若使下次約想心難有二重今反下次約想差反難又二初引二句理齊此下反難前不齊。",
    "X39n0714_003:0878c03_0": "【疏】答謗就心虗為義殺唯心境俱實。",
    "X39n0714_003:0878c04_0": "答中謗約心虗不取前境殺須俱實差則不成。",
    "X39n0714_003:0878c05_0": "【疏】二作大比丘想三有瞋心四無根五乃至對一比丘前僧祇若對所謗者前語語僧殘善見以瞋故不現前重事謗得提六以重事七言了八聞知。",
    "X39n0714_003:0878c08_0": "後七緣中復列第二者顯前所立是今已廢但使能謗無根不問所謗淨穢也五中乃至對一比丘者此顯對說不必在僧僧祗對所謗前復加陵辱語語僧制殘之切也善見不現前者或不對所謗或不在眾中私屏泛說不為僧治故罪輕降。",
    "X39n0714_003:0878c13_0": "【疏】闕緣可解。",
    "X39n0714_003:0878c14_0": "闕緣反具故云可解。",
    "X39n0714_003:0878c15_0": "【註】佛在羅閱祇尊者沓婆得羅漢已手出火光為僧知事佛讚第一慈地眾中次得惡房又得惡食便令妹尼對僧重謗問取自言比丘舉過因制此戒。",
    "X39n0714_003:0878c18_0": "【疏】就戒緣中。",
    "X39n0714_003:0879a01_0": "【疏】沓婆得聖僧事第一者舉此知務難為周贍生下謗緣善見云此人是王子出家。",
    "X39n0714_003:0879a03_0": "戒緣釋沓婆中初敘謗緣難周贍者眾情各異多所不足在聖尚然凡僧掌事是非毀讚故是常耳善見次述本緣論云沓婆是比丘名摩羅是王名此王子出家故云沓婆摩羅子年七歲出家剃髮即成無學。",
    "X39n0714_003:0879a08_0": "【疏】問無學之人何故修事答言無學者對治因患盡故今正報未亡不妨修福為除果業。",
    "X39n0714_003:0879a10_0": "初問中以惑盡果圓無所修故答中初釋無學因患盡者集因已傾不受後有故今下釋修事除果業者苦果尚存容酬往業故善見問云三業之中(學問坐禪營事)何以獨修下業答此是前身宿願所牽故曾於過去生居士家值波頭勿多羅佛時國人民共作大會請佛大眾入國供養有一羅漢於大眾中處分床席及諸飲食沓婆見已心大歡喜往至佛所白言願我後身值佛出家速成羅漢為眾分布房舍飲食如今羅漢無有異也今得聖果酬往願故所以營事。",
    "X39n0714_003:0879a20_0": "【疏】問佛讚第一其相如何答如見論云料理僧徒無乖別故一切同業同行皆同一處乃至無記語者不修三業食已睡眠洗浴肥壯共論世語亦使同住得在道門因樂道故得生天上。",
    "X39n0714_003:0879a24_0": "次問前引佛讚但云第一未顯其相故此示之答中有二初明能安諸慚愧同業同行者謂同學修多羅者則同在一處若學毗曇毗尼說法坐禪者亦爾多論云以其各有疑滯使咨問有處是以相近乃至下次明能攝諸不慚愧無記語者此句總標不修三業等即無記者共論世語即上語者準論作無業好語者或恐今文傳誤亦使同住者謂同一處得在道門者不棄外也樂道生天者不令墮惡也具此二能故讚第一。",
    "X39n0714_003:0879b09_0": "【疏】問既營僧事何用光者多論八緣一為止後誹謗表無三毒故如佛為女謗自說十力四無所畏故二學問坐禪者見營事人喜生輕毀故出火光滅勝負故三為折伏山林比丘高慢心故謂在城隍恒在事亂四為現精進果報勵諸惰者故五為增長施主善根故六為現被謗心不退故七現僧有大威德分臥具者尚爾神力況餘大德寧不高勝八為惜正業不全廢缺常在定心兼知僧事二俱辦故。",
    "X39n0714_003:0879b17_0": "三中初問以營事無故不當現通故問釋之多論八緣初止謗者恐人謂有愛恚怖癡故下引佛例者即婆沙云佛為婆羅門女所謗故作師子吼自言我有十力四無畏十八不共法以表清淨二中學問恃解坐禪恃行謂營事者不如於己故懷勝負負猶劣也三中頭陀自恃少欲忽傲多事故四中精進果報謂行精進能感果故六中尊者被謗人疑心退故初六八是利己餘五為他一一各有滅惡生善尋之可知。",
    "X39n0714_003:0879c02_0": "【疏】又問光明神力入定乃知云何事亂有光明者論自解云一効諸佛二業報三禪定四龍力同是不可思議不勞問也二者此人利根當知事時或入或出其間駛迅謂是一心如人打鼓口歌二心恒別又定力暫住何足為難如陶家輪也。",
    "X39n0714_003:0879c07_0": "次問常途通力發自定心營事放光事乖常故下引論釋即是多論初反問釋彼文通說四不思議今取一三可通來問効諸佛者以佛常在定不妨事用故禪定作用唯證乃知皆不可測二者下次承問釋復有二初中以雖同無學不無利鈍出入迅速如似一心利者方能舉喻可見準知鈍根則不能爾駛迅並速疾也又下次釋謂先入定放光雖出營事以先熱力光猶不滅故云暫住陶家謂土作者輪盤一發餘力自轉。",
    "X39n0714_003:0879c16_0": "【疏】慈地眾中得惡食者多云先力故業又於日夜無清淨心天龍鬼神與作因緣令其所得不如意故。",
    "X39n0714_003:0879c18_0": "釋慈地中引論示緣初是宿因又下即現業天等通力能見他心故令失所善見云由無福德故設遇善檀越請次及慈地施聞不喜敷床門外供設而已準此以言寧容妄動幽靈陰罰福德日消動不遂心皆如慈地矣。",
    "X39n0714_003:0879c23_0": "【疏】就戒本句分為七一是犯人二內有瞋心三出謗境戒本明淨辨相廣解互明淨穢四明無根五波羅夷者正重加謗六若於異時下自言虗相七若比丘下結罪。",
    "X39n0714_003:0880a03_0": "戒本總分中初二六並屬能犯中間三句屬所謗七示犯法三中點示兩處不同戒本明淨者云非波羅夷比丘故廣解互明者彼云沓婆清淨無如是事則是淨也又云彼人不清淨不見聞疑以無根謗犯殘即通穢也。",
    "X39n0714_003:0880a08_0": "【律】若比丘。",
    "X39n0714_003:0880a09_0": "【疏】第一可知。",
    "X39n0714_003:0880a10_0": "【律】瞋恚所覆故。",
    "X39n0714_003:0880a11_0": "【疏】二言瞋覆者以彼瞋恚覆於慈善不生故加謗也。",
    "X39n0714_003:0880a12_0": "第二句釋文中文敘瞋覆生謗之由瞋奪慈心義同於覆。",
    "X39n0714_003:0880a14_0": "【註】有十惡法因緣故瞋隨十事中以二事而生瞋也。",
    "X39n0714_003:0880a15_0": "【疏】注解十惡法者。",
    "X39n0714_003:0880a16_0": "【疏】有人言即十不善能為謗本故也。",
    "X39n0714_003:0880a17_0": "釋注古解十不善業但能起謗不能生瞋故所不取。",
    "X39n0714_003:0880a19_0": "【疏】今解云發瞋之本不過情與非情就情為言不過有三因緣一愛我怨家二憎我善友三及己身以此配於三世則有九也故經中說九惱處為種也加非情一故云隨十事中一一事而生瞋是也僧祇瞋恨通於凡夫學人若不喜者乃至無學。",
    "X39n0714_003:0880a24_0": "今解中初總舉就下別釋情中三緣初謂我憎他愛二即我愛他憎三即彼我互憎一切瞋境不出愛憎下指經中未詳何文而十誦云是人已侵我當侵我今侵我(即今後句已當今即三世)是人已利益我怨家當利益今利益(即今初句)是人已侵損我知識當侵損今侵損(即今次句)於彼生惱是名九惱非情一者通收一切不如意事後引僧祇以簡凡聖學人斷愛未盡容得有瞋不喜非使故通無學。",
    "X39n0714_003:0880b08_0": "【律】非波羅夷比丘。",
    "X39n0714_003:0880b09_0": "【疏】三非波羅夷比丘者正是所謗人也解如列句中。",
    "X39n0714_003:0880b10_0": "三中指如列句者前列句中亦略點示或指列緣句字誤耳。",
    "X39n0714_003:0880b12_0": "【律】以無根波羅夷法謗。",
    "X39n0714_003:0880b13_0": "【疏】四無根波羅夷法謗者明其重相也謗是戒本之過法是前犯重法此第五句也無根謂不見其犯也。",
    "X39n0714_003:0880b15_0": "四五中初科釋文中初通示二句謗下別釋初釋第五無根下釋第四且舉不見餘如注中。",
    "X39n0714_003:0880b17_0": "【註】謂根有三見聞疑也見根者見犯梵行見偷五錢見斷人命若他見從彼聞是謂見根聞犯梵行聞偷五錢聞斷人命聞自言得上人法若彼說從彼聞是謂聞根疑根二種從見生者見與婦女入林出林無衣裸形不淨汙身捉刀血汙惡人為伴是也從聞生者若在闇地聞動牀聲聞轉側聲若身動聲若共語聲若聞我犯非梵行聲乃至若聞我得上人法聲除此三根更以餘法謗者是無根也。",
    "X39n0714_003:0880c01_0": "【疏】注解中止解第四句將解無根前釋有根無此三根故曰無根。",
    "X39n0714_003:0880c03_0": "釋注通釋中初文止解第四者唯解無根二字不釋餘文故將下點示注意對之可見。",
    "X39n0714_003:0880c05_0": "【疏】問何名為根答論其謗相與舉無別實無聞見假以聞見而用舉罪即此聞見能為舉本故名為根。",
    "X39n0714_003:0880c07_0": "問立名中初問可解答中以謗本舉他令僧滅擯雖無見聞必須假託以舉他罪望能生舉故得名根故云實無等假猶妄也。",
    "X39n0714_003:0880c10_0": "【疏】若爾無見聞生謗何不名謗根答論謗瞋為根。",
    "X39n0714_003:0880c11_0": "轉難中初難對謗名根正貼今戒何須[起-巳+百]越對舉釋耶答中謗自有根故非謗根。",
    "X39n0714_003:0880c13_0": "【疏】難舉亦心為根答義實應通遠根各別所以然者彼由見聞後能生舉罪心見聞作根故論謗無事枉先瞋後起謗故瞋為謗根。",
    "X39n0714_003:0880c16_0": "次難中舉亦別有根前義亦應壞答中初句縱次句奪所以下釋上三句釋舉根見聞後起心則顯心非根下三句釋謗根枉謂誣枉。",
    "X39n0714_003:0881a01_0": "【疏】若爾無根是先有後起於謗心亦應無根為謗根答不同不必無根而起謗必由因根故生舉也。",
    "X39n0714_003:0881a03_0": "三中躡上遠根生舉謗亦應同答示不同約必不必言不必者非定有謗故。",
    "X39n0714_003:0881a05_0": "【疏】若爾自有根具不舉罪亦應根具非舉根答不同也有根佛制舉即根為舉根無根不制謗無根非謗根。",
    "X39n0714_003:0881a08_0": "四中引不必舉難上必舉答中顯異約制不制以舉是眾法謗起私情故。",
    "X39n0714_003:0881a10_0": "【疏】問三根中唯明見聞不明觸知者答觸就合中知犯非合所委可得加謗言嗅甞觸彼邪是故無觸根言知是通相義須為分別若見聞後知終是見聞攝獨知無謗義內心緣前知此知有通別犯非意緣知此知不成謗證境是弱故若因見聞知緣通見聞故然犯是外境故是通名知。",
    "X39n0714_003:0881a16_0": "次問觸知初問見聞觸知觸兼嘗嗅則攝六根今唯舉二故問明之答中初明不立觸合中知者根塵相合方知覺故犯非合所委者人有所犯鼻舌身根無由得知故云可得等言無此理也言下次明不立知初二句標示知是意根故云通相若下正明初三句約見聞知此知從後起還屬見聞攝獨知無知理豈容有謗義(有作觸知非也)內心已下次約內緣知上二句總標犯非下別釋初三句釋別義意緣而謗人無信故下四句釋通義緣通見聞者意能通緣落謝五塵故云通知。",
    "X39n0714_003:0881b02_0": "【疏】若爾小妄語戒何得有知。",
    "X39n0714_003:0881b03_0": "引難中以小妄戒云見聞觸知違想說是妄語彼兼觸知此獨無者。",
    "X39n0714_003:0881b05_0": "【疏】答小妄中知不取外境違心成誑故有觸知謗境不爾必對犯論故以通知強故成證。",
    "X39n0714_003:0881b07_0": "答中妄取違心謗對外境所以不同通知即上緣根之知有根故強可信故成證。",
    "X39n0714_003:0881b09_0": "【疏】若以觸疑重就犯論故無有妨如善見明了解云就疑生根通於五塵如見與女人出入林舍生疑或隔壁聞與女人語生疑或聞比丘體上有女人粧粉氣或比丘邊得食有不淨酒肉等味或闇中取與疑觸女手因此五事不分明故名曰疑根。",
    "X39n0714_003:0881b14_0": "次科初標示觸無決知可從疑說望前委釋故云重也如下引釋二論並同所以雙牒疑起於意故通五塵見聞生疑自同今律後三皆觸是今所論第列五疑在文自別。",
    "X39n0714_003:0881b18_0": "【疏】就三根消文中分三初列名二見根下顯相三除此根已下釋成無根。",
    "X39n0714_003:0881b20_0": "【疏】就顯相中見根但三事見疑唯婬殺聞根及聞疑則具足四重由妄非見相故見根不言妄盜非見疑了文中亦不說。",
    "X39n0714_003:0881b23_0": "次消文釋第二中初科初通點具闕疑根是一從見聞生故兼兩處由下示闕所以妄是聲塵故相不可見見盜則非疑故非見疑。",
    "X39n0714_003:0881c02_0": "【疏】若爾小妄語中見麤惡語者答此據當時眼見聞說也。",
    "X39n0714_003:0881c04_0": "轉難中初難妄語字誤合作小謗即九十中無根憎殘謗戒彼云見根者或見與婦女麤惡語或見自歎譽等語既可見與上相違答中謂眼見前人與女說故不妨麤語自屬耳聞不可互也。",
    "X39n0714_003:0881c08_0": "【疏】問但列見聞生疑不明見疑生聞及以聞疑生見者答見聞根不濫如文不說疑於犯有不了故從見聞說所以見疑不生聞者聞本對於聲見疑非是聲以見對於色疑本唯是心並非耳所聞故不得從見疑而生聞也所以聞疑不生見者以見對於色聞疑非是色聞者對於聲疑者唯是心並非目所矚故不約聞疑後生見也。",
    "X39n0714_003:0881c15_0": "次難意謂三根合有互生何以疑根獨不能生者答中初敘見聞能生疑所以下次明疑不生見聞又二初明見疑不生聞二明聞疑不生見各有牒釋結文以明根境不互義不可立尋之可見。",
    "X39n0714_003:0881c19_0": "【疏】若爾何故文云若從彼聞是謂見根答此乃從聞說見根非謂從聞生見根以說者是本有生者是後起又聞通五塵從聞通說得。",
    "X39n0714_003:0881c22_0": "三難中文云者即注中結見根文答中初釋通從聞說見者謂聞人說云見也以下辨異說是本有者他人先見因說始聞故非生矣上且釋文又下出意以從聞說見即是聞根聞通五塵者竝由聲說故云通耳。",
    "X39n0714_003:0882a03_0": "【疏】問何為不說從見說聞根答見是局色境聞說通諸塵如上已為解何迷而重問。",
    "X39n0714_003:0882a05_0": "四中承前答勢故生此難於義方盡答文易見。",
    "X39n0714_003:0882a06_0": "【疏】疏者言十三殘中古來諸師講至謗戒以為難解上雖舊有斯料簡相故依而出之律本列六心以約三根互為網目諸師穿鑿又加八心諍竟紛紜何關罪聚今疏所出止取附事現行自餘終古未見故且約略俗書猶云禮貴從俗易重隨時律緣人情也況復出世正道當須研慮日新使有尺寸不可悠悠自墜溝壑無始常習此生須分也。",
    "X39n0714_003:0882a13_0": "次結示中初敘古為二初指前所引律下斥彼妄加三根各二故有六心一自見二從他見三自聞四從他聞五從見生疑六從聞生疑諸師又於從他聞見各生疑心故有八也阿關罪聚者責其不知宗也今下次顯今又四初示意附事見行即奉持相自下二顯略終古謂後世俗下三舉況曲禮云禮從宜使從俗(謂先王制度臨事不可常定行禮當隨事所宜作使當隨俗所尚)易隨卦云隨時之義大矣哉(王弼注云隨之所施唯在於時時異而不隨否之道也)律緣人情者謂俗中法律重輕雖定及乎判斷須緣人情緣謂詳察也上引三文以淺況深當須適變不可同古廣張無益當下四誡勸初二句勸修研慮謂準教治心日新謂精勤不懈有尺寸謂智解無漫不可下勸捨悠悠謂心無所歸溝壑即喻惡道無始常習指出病根此生須分勸令截斷。",
    "X39n0714_003:0882b04_0": "【律】欲壞彼清淨行。",
    "X39n0714_003:0882b05_0": "【疏】文列欲壞彼淨行者述彼謗情瞋怒隆盛將事屠滅故也。",
    "X39n0714_003:0882b07_0": "次釋謗情初科屠即屠殺犯重遭擯義同殺也。",
    "X39n0714_003:0882b08_0": "【註】謂言眾僧滅擯此人我得安樂住。",
    "X39n0714_003:0882b09_0": "【疏】注中所明苦他樂自畜獸之相共陵踐也。",
    "X39n0714_003:0882b10_0": "注中畜獸相者尚非人行況學道乎。",
    "X39n0714_003:0882b11_0": "【律】若於異時若問若不問。",
    "X39n0714_003:0882b12_0": "【疏】若於異時下六明自言相也謗前首後非是一時故言異也若問不問者問是佛問不問是自首也。",
    "X39n0714_003:0882b14_0": "第六中初釋文首字去呼言佛問者如注所引或有不問而自首者故兩言之。",
    "X39n0714_003:0882b16_0": "【註】佛勅比丘問能謗者此事實不若以無根謗他獲大重罪也。",
    "X39n0714_003:0882b18_0": "【疏】注中所解可知獲大重罪者律中若謗行人一向入地獄故言大重也。",
    "X39n0714_003:0882b20_0": "注中引律釋報重相不問淨穢但使謗他罪無輕間故云一向也。",
    "X39n0714_003:0882b22_0": "【律】知此事無根說。",
    "X39n0714_003:0882b23_0": "【註】彼比丘言沓婆清淨人無如是事。",
    "X39n0714_003:0882b24_0": "【疏】知此事無根說者正是首詞非見聞也注中可領。",
    "X39n0714_003:0882c01_0": "次科非見聞者即無根也。",
    "X39n0714_003:0882c02_0": "【律】我瞋恚故作是說。",
    "X39n0714_003:0882c03_0": "【註】由前次得惡房惡食懷瞋恨故便謗彼耳。",
    "X39n0714_003:0882c04_0": "【疏】我瞋故說者既首須盡恐有蔽匿之愆也注中重敘還述戒緣瞋本也。",
    "X39n0714_003:0882c06_0": "三中首須盡者自述本情故蔽覆也匿隱也。",
    "X39n0714_003:0882c07_0": "【律】若比丘作是語者僧伽婆尸沙。",
    "X39n0714_003:0882c08_0": "【疏】若比丘下引人入罪聚也。",
    "X39n0714_003:0882c09_0": "第七釋文可解。",
    "X39n0714_003:0882c10_0": "【註】若以無根四事加謗說而了了僧殘不了偷蘭若指印書使知相了與不了其犯亦爾十三難事謗者同犯除此非比丘法更以餘無根法謗隨前所犯若謗比丘尼亦同前犯謗下眾者突吉羅尼犯僧殘不犯者三根說實戲笑說若疾說獨說靜處及錯說等。",
    "X39n0714_003:0882c15_0": "【疏】注中初明僧尼同犯相後明三眾別犯相就初又二初明僧有成犯相後明尼同大僧相就初分三初以四重謗中以十三難後以諸篇謗文相未解略以義分。",
    "X39n0714_003:0882c19_0": "釋注義分中次第三節據合先分犯與不犯。",
    "X39n0714_003:0882c20_0": "【疏】就謗覆說三種料簡初謗覆說他二自謗覆說三僧尼互謗覆說。",
    "X39n0714_003:0882c22_0": "料簡標中謗通大小罪分兩篇覆說麤罪同是單提此三相濫故須對簡而又自他及互輕重不同故列三門。",
    "X39n0714_003:0883a01_0": "【疏】就前他中約相又三初以四重次以二逆後十三難。",
    "X39n0714_003:0883a03_0": "初科總分中二逆即破僧出血此入制科故容謗說。",
    "X39n0714_003:0883a05_0": "【疏】就初四重明謗覆說。",
    "X39n0714_003:0883a06_0": "【疏】問約謗初二輕重罪別覆說初二同結提者答謗就治罰為言隨篇故有輕重覆初二所以同犯者重屏覆稀輕露覆數稀須輕制數須重制上下相就故合一科又云初二護心義一壞眾不殊故同一墮說初二同提者以重稀輕數同護外信俗人不練輕重譏齊故同一墮。",
    "X39n0714_003:0883a12_0": "明四重中初問言初二者即是夷殘謗既兩別覆說那同答中初釋謗別治既重輕情容深淺所以不同覆下次釋覆說初釋覆罪二義釋之初約稀數釋謂重多屏造知少覆稀殘多露為知多覆數又下次約壞眾釋護即覆也覆過不悔眾法不成故云壞眾二釋說罪亦二初云稀數即同上義次護外信譏無異故。",
    "X39n0714_003:0883a19_0": "【疏】問謗罪結三階論覆結二品毀惱諫等戒約篇則輕重何故同提邪答謗就治罪論覆從壞眾說輕重理須分不同毀疑等彼以汎惱故當時不論犯如罵車木師可是對犯也。",
    "X39n0714_003:0883a23_0": "次問中初敘謗覆差別謗對六聚有殘提吉故云三階覆對六聚則有提吉說麤亦同次難三戒混同即毀呰疑惱不受諫此三戒並通六聚皆共一提答中初釋謗覆如上已明不同下次辨餘三通是泛惱如下引事別證毀呰律出罵相云汝是除糞種竹師種車師種等造車即木師也。",
    "X39n0714_003:0883b05_0": "【疏】次明二逆十三難者。",
    "X39n0714_003:0883b06_0": "【疏】謗逆得殘教輕擯齊故也若實非比丘是有難者內無三根冥然著實則無謗罪容得小罪不同四重謗人體雖汙戒是比丘故比丘身上有難與未罷道謗亦殘也。",
    "X39n0714_003:0883b10_0": "次明逆難明謗中三初明謗逆教輕謂犯蘭也擯齊謂治同也若下辨謗難又二初明謗實犯輕謂先受不得者由無三根故獲吉罪不同下簡異對上可知比丘下次明謗實亦重即先受後難生者如黃門二形之類(與字錯合作而)。",
    "X39n0714_003:0883b15_0": "【疏】說逆亦墮如舍利弗事證也覆罪同之若十三難實有無覆說過若虗便無可覆說也。",
    "X39n0714_003:0883b17_0": "次覆說中初明逆罪下引緣證律云舍利弗白大眾說提婆所為非佛法僧事舍利弗心疑即往白佛我當云何在白衣眾中說其惡佛言僧差故不犯是知不差說即成犯若下次明難事實則非犯虗則不成覆說據實思之可會。",
    "X39n0714_003:0883b22_0": "【疏】二明自謗覆說初自謗無罪者謗他擯惱枉治犯殘自過尚覆豈輒言犯自覆吉者覆他過多有本故重自覆過輕無本故微自說義稀故輕說他事數故重。",
    "X39n0714_003:0883c02_0": "二明自中初科三位自別覆中有本者本即指戒以覆他自淨重制令露自覆己穢故不須制。",
    "X39n0714_003:0883c04_0": "【疏】問前言自謗無罪今何自說得吉者答論謗在僧自故非犯說罪在俗未具招譏同故得吉。",
    "X39n0714_003:0883c06_0": "次引難中謗說有無理非所隱欲明教意故復徵之答文可解。",
    "X39n0714_003:0883c08_0": "【疏】三明僧尼互謗覆說者。",
    "X39n0714_003:0883c09_0": "【疏】初明其謗僧尼雖殊枉治莫別俱廢正修同犯僧殘。",
    "X39n0714_003:0883c11_0": "三明僧尼互初互謗中尼是下流謗同僧犯故須辨之文中所敘同有二種一治擯同二廢業同。",
    "X39n0714_003:0883c13_0": "【疏】說覆以論。",
    "X39n0714_003:0883c14_0": "【疏】僧尼互覆罪無階降尼同類中自分三品。",
    "X39n0714_003:0883c15_0": "次明覆說互覆中初科罪同提吉故無階降同類三品者覆夷犯重覆殘犯提覆提已下皆吉。",
    "X39n0714_003:0883c17_0": "【疏】問尼說大僧則違敬法何故覆罪乃制提者答制尼說過不對犯者但明所隱同類便得故不露罪情過得提。",
    "X39n0714_003:0884a02_0": "釋疑中說既違敬覆不當制答中初明敬法不許對僧但下次明覆犯自論同類。",
    "X39n0714_003:0884a04_0": "【疏】互說之相準前可領。",
    "X39n0714_003:0884a05_0": "互說中僧尼互說同類自說同是提吉竝無階降故云準前。",
    "X39n0714_003:0884a07_0": "【疏】注中隨前所犯者舉四篇謗隨謗分罪也。",
    "X39n0714_003:0884a08_0": "牒釋中初科舉四篇者除四重也隨謗分罪諸提吉也。",
    "X39n0714_003:0884a10_0": "【疏】問謗人惡說還犯惡說者及上初篇還應大重答結罪分齊各有指歸輕重有由階降論罪小下無名止同篇聚若還有者無窮之咎。",
    "X39n0714_003:0884a13_0": "問惡說中以能所犯同例上應爾答文初通示判犯不可一定輕下次明前判三位不同小下正答惡說同篇之意。",
    "X39n0714_003:0884a16_0": "【疏】就不犯中言說實者有五一想心實二瞋境實三前事實如張王青黃等四三根非互實五四戒不互實如十誦四重互說成謗。",
    "X39n0714_003:0884a19_0": "不犯中想心實者意謂不淨也瞋境實所對不謬也前事實所見何等事也餘二可解具五則開闕一成謗。",
    "X39n0714_003:0884a22_0": "【律】九假根波羅夷謗戒。",
    "X39n0714_003:0884a23_0": "【疏】第九假根謗戒者。",
    "X39n0714_003:0884a24_0": "第九假羊為見故曰假根。",
    "X39n0714_003:0884b01_0": "【疏】此戒與前名同種別此假異事有見根相即此見根將以加謗莫知本犯故成假根若異事見向僧道聞便是無根落在前戒乃至餘根類此有無也解制意成犯緣並同前但假根為別耳。",
    "X39n0714_003:0884b05_0": "簡異中名同者並謗戒故種別者無假異故此下示假根若下簡無根餘根類此者謂見言疑又聞疑為頭互歷亦爾解下指前不兩繁故。",
    "X39n0714_003:0884b08_0": "【註】佛在羅閱祇慈地比丘見羊行婬便言此羝羊者沓婆也其母羊者即慈地尼便語比丘我今親見非前無根比丘詰問便自臣伏舉過白佛而制此戒。",
    "X39n0714_003:0884b11_0": "【疏】就戒緣中初明羊婬安可相似便語比丘我今親見者對前無根已被殘罪今似有根定非濫故。",
    "X39n0714_003:0884b13_0": "戒緣中初敘起謗對下次出謗情注云羝羊謂雄羊也。",
    "X39n0714_003:0884b15_0": "【律】若比丘以瞋恚故。",
    "X39n0714_003:0884b16_0": "【註】如上所說。",
    "X39n0714_003:0884b17_0": "【疏】就戒本中七句如前戒說。",
    "X39n0714_003:0884b18_0": "戒本指句如前者一犯人二瞋心三謗境即異分等四無根五正重加謗六自言七結罪。",
    "X39n0714_003:0884b20_0": "【律】於異分事中取片。",
    "X39n0714_003:0884b21_0": "【疏】就第三句言異分者善見云以羊當人是名餘分事相似故十誦云犯初篇中一一戒非比丘失比丘法故言異分不異分者不失比丘法故片者諸威儀事也約四分中如論釋好所言片者人畜乃殊欲義非異故以彼相用同此犯片非有乖故曰取片。",
    "X39n0714_003:0884c02_0": "釋異分中初科前引二文善見所釋頗符四分次引十誦欲彰部異彼以四夷為異分僧殘已下並名不異分諸威儀為片謂於四夷中取少乖威儀事而興謗也約下次明今釋初釋異分指前見論次釋取片片非有乖非猶無也。",
    "X39n0714_003:0884c07_0": "【註】異分者若假異罪異趣異人若本在家若假響。",
    "X39n0714_003:0884c08_0": "【疏】注中解異分者並非實犯假餘相謗故曰異分約相有五言假罪者見犯六聚以初聚謗或七聚通犯想無故謗或違想故謗同犯殘也言假趣者如緣起通之言異人者謂見比丘與所謗者名姓相同以彼人犯用謗此人也言若在家者以上罪趣及人增謗其犯及論據刻乃是異身故非舉謗便就所謗緣身搜求知本在俗有諸重罪即以加舉僧又覆檢身雖非外罪是異時又治其謗故下又引假響即時俱非本犯雖聞何益。",
    "X39n0714_003:0884c17_0": "釋注中初通釋約下牒釋異罪中三初犯六聚者謂不犯夷即體淨者二三通犯即是體穢想無者實犯謂淨也違想者實重謂輕也異趣如緣者緣起因羊餘趣例準異人中名姓相同者律云不清淨人與清淨人相似名同姓同即以此人事謗彼也言下釋異時初明究勘三皆非己故曰異身便就等者出彼轉謗律云若見聞本在家時犯婬盜等便言我見彼犯僧又下釋假響初明再刻身雖非外非異人也罪是異時道俗隔也又引假響者示彼重謗即時非前異時也律云比丘自語聞響聲犯婬盜等便言我聞彼犯假事興謗不出此五知機立教曲盡凡情。",
    "X39n0714_003:0885a05_0": "【律】非波羅夷比丘以無根波羅夷法謗欲壞彼清淨行彼於異時若問若不問知是異分事中取片是比丘自言我瞋恚故作是語者僧伽婆尸沙。",
    "X39n0714_003:0885a08_0": "【註】辨相開通並同前戒。",
    "X39n0714_003:0885a09_0": "【疏】非波羅夷下釋同前戒引用同解。",
    "X39n0714_003:0885a10_0": "指餘中分句釋義並同前戒。",
    "X39n0714_003:0885a11_0": "【疏】總解諫戒四翻不同一十三同篇而諫不諫別二諫有所為廣明破僧三破僧是同而立兩戒擯謗拒僧唯獨立一四違僧諫同罪有輕重。",
    "X39n0714_003:0885a14_0": "釋四諫戒總解四章。",
    "X39n0714_003:0885a15_0": "【疏】初明同篇諫不諫別者。",
    "X39n0714_003:0885a16_0": "【疏】須諫五意一性惡二顯露三惱僧。",
    "X39n0714_003:0885a17_0": "初章列五意中初業重二公白三攪眾四抵突五自是已前九戒雖有不具必具此五乃作法諫初三可解。",
    "X39n0714_003:0885a20_0": "【疏】四倚傍有濫前之九相條然是非更無有濫傍倚聖教過顯群心何須設諫後之四戒皆有倚傍理行二教是非交雜真偽難分迷情墜惡事是可愍故須僧諫開悟迷途冀彼棄惡從善捨邪歸正。",
    "X39n0714_003:0885a24_0": "倚濫中初科初敘餘戒後下次明諫戒又二初明倚教之過佛法皆能詮理起行故云理行或可八正為理教四依及餘為行教故下次明設諫之益。",
    "X39n0714_003:0885b03_0": "【疏】就明倚傍各有所由如破僧者則傍四依八正助破則傍有善斯從擯謗則濫同犯已悔拒諫則制無德不須各至本文重為述也。",
    "X39n0714_003:0885b06_0": "次科初二句通示如下別顯提婆傍佛四依八正立邪五法以勝於佛助破者謂是從善反云此比丘是法語律語比丘擯謗者見同犯已悔而不治罰故云有愛等拒諫者謂律中非法無知不應訶諫故云莫向我說。",
    "X39n0714_003:0885b11_0": "【疏】五明堅執不捨者。",
    "X39n0714_003:0885b12_0": "【疏】問若以堅執故須諫者如下言諍始從一人乃至多語何為不諫答今立諫者執據教事影迹有濫縱而不諫便作大過是故須諫言諍執教據理非犯以教制之不勞諫也。",
    "X39n0714_003:0885b16_0": "五中問意以七滅諍中言諍亦是邪正各執那不設諫言諍有三品用現前多人語毗尼滅下品用三現前一人二法三毗尼中品五現前加僧及界上品用五現更加多人語始終一人即舉下品之初多人語即上品之末故云乃至答中初明四諫作大過者前二破法後二壞眾下明言諍據理謂非影濫非犯謂無大過以教制者即毗尼也。",
    "X39n0714_003:0885b23_0": "【疏】僧祇疏加遠有所防或以輕遮重以重遮輕。",
    "X39n0714_003:0885b24_0": "次他宗中彼疏解律五義同前復加此一或下二句釋上遠防以輕遮重前二為防破僧以重遮輕後二為防毀犯。",
    "X39n0714_003:0885c03_0": "【疏】上之九戒互闕不同至時引出。",
    "X39n0714_003:0885c04_0": "結顯中四五二義九戒通無就前三中漏失等四並是性戒止有初義媒房並遮不具初義而媒有顯露房兼顯惱二謗具三於義可見文令引出故此略示。",
    "X39n0714_003:0885c08_0": "【疏】又有人言夫諫所為者有二謂人事也。",
    "X39n0714_003:0885c09_0": "【疏】事又有二初未成事如破僧未竟二已成事謗僧已了諫表無愛。",
    "X39n0714_003:0885c11_0": "次明二義事中未成攝二破已成中謗僧已了者止是擯謗義收拒諫由先拒僧後加諫故。",
    "X39n0714_003:0885c13_0": "【疏】為人興諫亦二初言對此人為息外化不即為此人破僧初句非法想破非法想說二言對此人即為此人破僧心迷諫悟捨故。",
    "X39n0714_003:0885c16_0": "次為人中唯簡二破初即正破言對此人者謂律中說為提婆制此諫法然彼邪心已決非正所為故云不即為此人也破僧下引證破僧犍度有四句今用初句彼云若比丘非法言法堅持此法破和合僧彼自知非法想破便作非法想說言此是法是毗尼等如此破者一劫受苦也此證提婆心決非諫法所被也(餘二句如律)二即助破諫法正被故云即為此人也破僧下引證即第四句彼云非法說法想說法想破如此破者不受苦此即心迷因諫方曉此證伴黨正是法所被也。",
    "X39n0714_003:0886a08_0": "【疏】次明第二破僧義者。",
    "X39n0714_003:0886a09_0": "【疏】如來一代有斯化迹欲使邪正分途福道路別故示教迹致斯不同遺法同遵求異難剋無由得有破輪之理戒本雖列相從說之至於犯諫萬年無幾而世講者不畏死至隨相廣誦云余宏博不知徒說損費精靈故須舉要識相知境既不失功由削繁故四門分之一明破僧名體差別二羯磨法輪相對明破三明破僧時處四明二逆因果最初二義。",
    "X39n0714_003:0886a16_0": "第二破僧義敘意中初至無幾敘教意初二句示教起之始欲下顯權巧之意邪正分者由彼破僧始分真偽則使俗人知敬而修福僧徒歸正而修道故云福道路別也遺法等者為絕後世邪惡不起即法華云又現邪見相方便度眾生是也戒本等者顯遺後所以相從出者非正要也萬年無幾者言其不多而世下次斥繁廣不畏死至者廢棄光陰故隨相廣誦者躭著世論故云余宏博者逞弄我能故精靈即心神故須下列章言舉要者去閑緩也識相知境令易曉也不失功者無虗廢也由削繁者顯今益也。",
    "X39n0714_003:0886b03_0": "【疏】初明破僧名體者。",
    "X39n0714_003:0886b04_0": "【疏】僧者西音東華所翻名和合眾具於理事破方成逆何以然邪是僧故即事和是寶故是理和也。",
    "X39n0714_003:0886b06_0": "初門釋名中初科初翻名具云僧伽準羯磨疏單翻云眾和合二字乃是是義用今釋破僧欲明所破且從舊譯各有其致事和謂六事同均理和即證理無二何下即用僧寶二字以分兩和於義甚顯凡聖以論凡唯事和未見理故初果已去則兼二和聖人證理不違事故。",
    "X39n0714_003:0886b12_0": "【疏】摩得伽云捨八正學餘道是輪壞同一界各羯磨是僧壞據此以言說破僧者必約羯磨法輪用分業也。",
    "X39n0714_003:0886b15_0": "次科伽論中初引文輪壞即破理和僧壞即破事和據下準決破羯磨犯輕破法輪成逆故云用分業也。",
    "X39n0714_003:0886b18_0": "【疏】據律破僧亦有二種一破行輪者佛說四依資成斷業乃說五邪亂佛正教故文云今斷我四聖種又云二事破僧妄語相似語也二破眾輪者本是一和今分兩別說戒羯磨同界各行故也故文云二事破僧作羯磨取舍羅是也。",
    "X39n0714_003:0886b23_0": "本律中初總標亦有二者行眾二輪即是理事一下別釋行輪又三初示輪四依道緣故曰資成破惑證聖故云斷業乃下明破故下引示有二四聖種即四依法糞掃衣常乞食樹下坐腐爛藥聖道由生故云聖種提婆立五法破上四依律云提婆告三聞達言我有五法亦是頭陀勝少欲知足樂出離者所謂盡形(貫下五法)乞食著糞衣露坐不食酥鹽不食魚肉我今持此五教諸比丘足令信樂又下律云佛告優波離有二事破僧妄語(五中後二提婆自制)相似語(五中前三濫佛四依)次釋眾輪初標示說下正明初句示輪下句明破故下引證亦是告波離文羯磨法別舍羅翻籌即是事別此二既別六和乖矣所言輪者摧碾惑業故得名耳伽論局理律通理事又理論中論據八正律約四依四依道緣八正道因兩文互出義必相兼。",
    "X39n0714_003:0886c14_0": "【疏】上顯兩僧如何言破亦無別有破以八正四依成僧之法差此惑亂應悟不悟故明破也又此羯磨說戒是御眾之法同界各行互不相成故明破也。",
    "X39n0714_003:0886c17_0": "三中初總徵兩僧即理事也亦下別釋初明破理和僧又下次明破事和僧。",
    "X39n0714_003:0886c19_0": "【疏】二明體者有云僧和以非色心為體律中約相全無出體以委論故如律云僧者四人若過也僧義如刪補羯磨疏中廣之。",
    "X39n0714_003:0886c22_0": "二明體中初引示非色心者即目人假是非二攝律下指文初示意言委論者即上所明出成論故如下正引僧義下指略彼有五家出體不同今當第二是彼正取餘四不引須者自尋。",
    "X39n0714_003:0887a02_0": "【疏】二明破法差別先定輪體後對論破。",
    "X39n0714_003:0887a03_0": "【疏】初明法輪二種一行二教。",
    "X39n0714_003:0887a04_0": "【疏】所言行者無過八正用譬世輪語業命三以為戒轂見思二正以為慧輻念定二正以為定輞方便精進為轉輪人若依修行出生死道故名行也。",
    "X39n0714_003:0887a07_0": "第二對明定體中初科三初標示開三學為八正道一切行相無不攝盡故云無過也用下喻顯世輪轂在於中眾輻所湊輞在於外圍於眾輻即喻戒是定慧所依定是慧之外護若下三結合。",
    "X39n0714_003:0887a11_0": "【疏】二就教者本是一和今分兩別以如來法輪化被三千該通道俗故也是以調達唱說五法是四依非乃至地神天神唱告三千世界禪誦不行如鼻奈邪云諸佛常法食時僧壞至暮還復中間天人無悟道者天地闇冥若暮不和天地翻覆故。",
    "X39n0714_003:0887a16_0": "次科初標示以下正釋又二初敘佛法輪是下明提婆反破初明破法乃下示破境如下明破時諸佛常法者決權疑故中無悟道即破義故。",
    "X39n0714_003:0887a19_0": "【疏】第二相對明者有九不同。",
    "X39n0714_003:0887a20_0": "次對論中前約行教通明二輪此用九義對顯差別。",
    "X39n0714_003:0887a22_0": "【疏】初就人明破者羯磨為言通僧及尼俱有破義法輪一種唯據比丘餘眾不可故尼是女報號佛無信三眾未具不合羯磨也。",
    "X39n0714_003:0887b01_0": "初人中羯磨通二眾法輪局大僧女人有五礙不得作輪王釋梵二天王魔王及佛所以尼女號佛人無信者下簡三眾二破俱塞。",
    "X39n0714_003:0887b04_0": "【疏】二假佛明破者若破羯磨不假自號為佛又佛不入羯磨僧故若破法輪必須偽佛以僭敷化故雜心云族姓端正持戒多聞辨才見行增上惡希望故非愛行人易輕動故智論云我三十相減佛無幾弟子未集若眾圍繞與佛何異思惟破僧自稱作佛。",
    "X39n0714_003:0887b09_0": "二中羯磨攝僧法故不假佛佛在應供僧故不入羯磨法輪競化故須假佛僭謂下位僭越於上雜心下引證初列五德族姓者同釋種故端正者有三十相故餘三可知彼文續云彼自立為大師故犯戒者非能壞也見行等者此明提婆具上諸德令諸比丘樂慕受化彼論先出偈云大師及是道諸比丘異忍礙壞和合僧所謂見行壞解云謂比丘起如是惡希望提婆達多是我大師非瞿曇彼所制五法是道非八正(此釋偈上二句)當知是壞僧(釋第三句)又問何等人破僧答所謂見行增上者見行人壞僧惡希望故非愛行人易輕動故(此釋末句)今詳內外兩凡具見惑者名見行人又內凡尚淺故云增上初果已去未盡思惑名愛行人聖人證真不可輕動故云非也即下云凡夫輕躁易可破壞是也智論即提婆自謂三十相者唯無足下輪相及無見頂相耳十二遊經云調達四月七日食時生身長一丈五尺四寸等。",
    "X39n0714_003:0887c02_0": "【疏】三就數明破者磨羯下至同界八人別行眾法彼此不成僧不得益故云破也言法輪者下至九人所以須者故調達邪佛替正佛寶所說五邪替正法寶三聞達等替正僧寶故能破五人一佛四僧所破唯四故九成破所以如來不入十數者俱舍云破在別處不得親對世尊一以如來不可輕逼二以言教最可信受故雜心云大師在眾中彼無威光故。",
    "X39n0714_003:0887c09_0": "三中羯磨八人者兩處各成眾故彼此不成者互望別眾故法輪中初標徵故下列示初出能破主及四伴通為五人由非真佛故在僧數一佛下示所破法寶可知文中不列師徒五人而言四者佛寶位別故不在數故能所十人但云九耳所以下徵示真佛不入之意俱舍破在別處者以對能立所故云五人及論正破不在佛會如下文說破在伽耶輕謂輕陵逼謂逼惱言教可信者若在佛所必受佛化破不成故下引雜心共成三意。",
    "X39n0714_003:0887c18_0": "【疏】四就界內外明者羯磨僧破要在加法界內兩眾別行不通界外法輪僧破初秉法時唯在界內後破行法通界內外。",
    "X39n0714_003:0887c21_0": "四中羯磨一須加結二局界內法輪中初秉法時者以提婆先自布薩破羯磨僧故須局界後方行化則不定處準下先在王舍破行後於伽耶壞眾與此不同今詳破眾已後行化未息故云後耳準知前後皆通內外。",
    "X39n0714_003:0888a02_0": "【疏】五就凡聖二僧明破羯磨破者真俗俱能聖人事迷容生別眾非法故也法輪僧破唯俗諦僧聖人識達必不從化故成實云凡夫輕躁易可破壞若得世間空無我心尚不可破況無漏也。",
    "X39n0714_003:0888a06_0": "五中真即四聖證真諦故俗即兩凡具煩惱故法輪中初正明故下引證世間空無我心即內凡世第一人分見空理者則知爾前猶可破也無漏即初果。",
    "X39n0714_003:0888a10_0": "【疏】六就方明破者羯磨所破通三天下破法輪僧局在南洲故雜心云三方有八羯磨壞閻浮有九法輪壞也。",
    "X39n0714_003:0888a13_0": "六中羯磨不對化主故通三州不通北州法輪對主唯局南州不通三州下引雜心證上通塞八九並約人數如上可知。",
    "X39n0714_003:0888a16_0": "【疏】七就時明破者羯磨通於二世法輪唯佛世故彼論云牟尼般涅槃未結界前後息肉未出時又無第一雙如是六時中不名破法輪。",
    "X39n0714_003:0888a19_0": "七中初科羯磨通現未法輪局現在彼論亦即雜心偈中通明六時正用初句證成上義真佛既滅無可競化故不通滅後未結界者以破法輪必兼羯磨非結界地羯磨不行故未立結界則無破僧前後如疏自釋息肉未出者準俱舍解於正戒見未生破毀時也即以息肉以喻毀破息合作瘜謂臭肉也第一雙者雜心云未建立第一雙準阿毗達磨解未立止觀第一時謂止觀二法名雙超諸法門故云第一由立止觀令眾修習識別邪正必無破僧初後三句各明一時第二句含三時故結云六時。",
    "X39n0714_003:0888b06_0": "【疏】所言前後者昔人約破僧以分前後無第二破故若爾何故破僧通於季代答唯可方便終非究竟。",
    "X39n0714_003:0888b08_0": "次科昔解中初牒文昔下正引彼以正破為中未破為前破已名後義非再破故云無第二也若下釋難可解。",
    "X39n0714_003:0888b11_0": "【疏】俱舍中解前後云初者轉法輪未久後者將般涅槃二時大眾同修一味無破者故。",
    "X39n0714_003:0888b13_0": "次引論中即以鹿苑初成為前鶴林將滅為後若爾與昔解何別學者詳之須知有別。",
    "X39n0714_003:0888b15_0": "【疏】八就罪明破羯磨破者輕蘭非逆法輪破者重蘭得逆何故不同多論有九一以正破正法輪以邪破正二但失事益損微過輕法輪破者失理解故重三弟子破師故重同徒相破故輕四但破行者輕理行俱破重五唯損出家輕道俗同損重六羯磨但情乖法輪情法失七羯磨二眾離法輪七眾破八羯磨定不破法輪法輪喜破羯磨故重九羯磨唯損僧法輪通三寶故重以偈束曰非正理事師徒別一教二教道俗離情乖法乖二七眾定喜三寶一寶持。",
    "X39n0714_003:0888b24_0": "八中初明異羯磨但違制教法輪制業俱犯何故下釋異所以多論九義對明重輕文或不具一一宜以羯磨法論標其上並用故輕故重結其下又唯第三上重下輕餘竝上輕下重一二四八並約法論而有邪正事理之別三五及七並就人辨須分師資道俗之殊六及後九則兼人法宜辨人情三寶之異後偈收束臨時配對攝繁從要照對易明有本除去未知何意。",
    "X39n0714_003:0888c08_0": "【疏】第九明報有二不同破羯磨僧不墮無間破法輪者以成逆故生報阿鼻一劫受苦如成實云不但破僧若言無罪福供養善人父母無報令多人作不善業又如邪人害正見者故謗聖人又殺聖人等事重心重如此諸罪皆墮阿鼻。",
    "X39n0714_003:0888c13_0": "九中初羯磨犯中品蘭故非無間準雜心論墮嘷叫地獄法輪三種定一生報定二阿鼻定三一劫定下引成實通明無間文有三節初即撥無因果二即執邪謗聖三損害福田又如僧祇毀犯四重竝無間業請觀此文自撿行業日用所存寧不畏慎。",
    "X39n0714_003:0888c19_0": "【疏】第三破僧時處。",
    "X39n0714_003:0888c20_0": "【疏】初破僧時倣佛二法用擬邪化一立五邪以為行法替正四依二立非法羯磨以為眾法替正羯磨所以王舍城時忍五法者止是破行後至伽邪羯磨說戒方破眾法始是究竟破法輪僧。",
    "X39n0714_003:0888c24_0": "第三時處正明中初明立法行法被自行眾法為軌眾且依律示論中八正道亦行所收所以下示時處王舍城即遊化之境伽耶山乃住止之處方志云伽耶世謂靈岳亦云象頭山提婆始於王舍行化有五百新學比丘信受五法隨往伽耶布薩二法俱破方成破僧。",
    "X39n0714_003:0889a06_0": "【疏】故僧祇云調達向伽邪山佛喚不得便作羯磨為後世名譽乃至三喚云我已說戒竟佛言非法人已作竟如法人自作布薩便說清淨如滿月偈等以此文證破在伽邪。",
    "X39n0714_003:0889a10_0": "引證中佛喚者如來遣阿難往喚。",
    "X39n0714_003:0889a11_0": "【疏】問調達說戒如來僧等同界何得成者答一破已後兩不相足如拘睒彌說。",
    "X39n0714_003:0889a13_0": "問答中由不相足不妨同界各自成法如下引例拘睒彌說即律犍度彼明拘睒彌國比丘鬪諍破為二部各自說戒佛判成法彼是非異見猶不相足況今邪正兩分不復疑矣。",
    "X39n0714_003:0889a17_0": "【疏】第四明二逆偷蘭因果者。",
    "X39n0714_003:0889a18_0": "【疏】如昔解云出血偷蘭是方便以殺佛不成故而是最初以智論云多聞持戒九清淨人得破僧者若是第二何名淨也。",
    "X39n0714_003:0889a21_0": "第四出血中昔解方便則與今同判為最初則與今異彼據智論既云清淨豈非無犯。",
    "X39n0714_003:0889a23_0": "【疏】今解不爾五逆之罪犯則無初外道犯逆即滅擯也。",
    "X39n0714_003:0889b01_0": "今解中初判定外下引例緣出受戒十三難中制教開初業道無初外道犯逆受已滅擯顯是業道何得有初。",
    "X39n0714_003:0889b04_0": "【疏】若爾無初云何出血方始破僧而名清淨者答於擯罪無違故云清淨。",
    "X39n0714_003:0889b06_0": "初難中通前智論業道雖成逆制教是方便故不違擯法而得名清淨。",
    "X39n0714_003:0889b08_0": "【疏】若爾何故雜心云若犯餘無間不得破僧答謂未受前而犯三逆以受不得非比丘故出血偷蘭可懺淨故。",
    "X39n0714_003:0889b11_0": "次難以無初成逆違心論故答中三逆即殺父殺母羅漢釋上餘無間也逆業障戒無破僧理蘭罪可懺故稱清淨。",
    "X39n0714_003:0889b14_0": "【疏】破僧偷蘭是究竟非方便故以本心規奪徒眾壞僧斷法歸從己見暢滿心腑更無進趣故果蘭罪。",
    "X39n0714_003:0889b16_0": "次破僧罪初科初判定以下釋所以偷蘭因果各有三品此中二罪並是上品。",
    "X39n0714_003:0889b18_0": "【疏】是第二者過狀顯彰佛自訶責重罪一劫因果既明故違而犯如見論云破僧無最初以違佛諫故。",
    "X39n0714_003:0889b20_0": "次第二中初義判佛既訶諫即同先制故無最初如下引證於理顯然。",
    "X39n0714_003:0889b22_0": "【疏】問破僧是第二違諫最初者即僧諫中訶云不捨得重罪者應亦第二同佛諫故答破僧者所諫事也諫時諫破僧作時作破僧故知破僧是第二諫時不諫於違諫故違諫僧殘是最初大能解也。",
    "X39n0714_003:0889c02_0": "次難中破僧逆蘭則無最初違諫犯殘即開最初故引為難僧諫佛諫既同有初無初何異答中佛諫破僧則諫犯不別僧諫違諫則諫犯不同僧亦諫破僧彼犯由違諫故也後句稱美必引他文。",
    "X39n0714_003:0889c06_0": "【疏】問比丘逆罪是有初不答無初也初對佛教逆非佛制。",
    "X39n0714_003:0889c08_0": "三問答中初問答文判罪極明以開初無犯並約制教而論五逆之罪自據業道而辨今明比丘犯逆制教則三夷二蘭業道則通歸無間犯制教則依法治擯違業道則一劫沉淪懺制須準律宗悔逆自從大教若茲以判罪相天分前後教門不復疑矣。",
    "X39n0714_003:0889c14_0": "【疏】問同是逆罪諫有無者答破僧倚傍須諫使分餘無濫故不須設諫。",
    "X39n0714_003:0889c16_0": "次問以五逆中唯諫破僧故答中餘四殺逆故無所濫。",
    "X39n0714_003:0889c18_0": "【疏】問俗人犯逆有初以不答無有初也既是生報之罪無出家修道義也。",
    "X39n0714_003:0890a02_0": "三問俗人無初如前已示欲生下難故復問之又復此據來投受具望在俗犯以為初耳答中是生報者示障道所以。",
    "X39n0714_003:0890a05_0": "【疏】若爾何故涅槃阿逸多犯三逆佛聽受具者答猶自無初望諸比丘不許度故焚燒僧房值佛法王不同常教。",
    "X39n0714_003:0890a08_0": "引難中阿逸多殺父害母殺羅漢來投出家諸比丘不許度便欲燒僧坊佛開為受既不障戒則似開初答中比丘不許即是無初緣難暫開故非常教。",
    "X39n0714_003:0890a12_0": "【疏】大門第三俱破分二戒餘後單立一者答破僧事大立主假伴諫主不捨故立初戒當諫主時伴助勸僧即便諫伴由不捨故立第二戒餘後二戒一人獨辦不假主伴故無兩戒。",
    "X39n0714_003:0890a16_0": "第三重單中初標徵此明四諫破僧分二擯謗拒諫各一單兩不同故此辨釋答中初敘破僧立二所以一以事大二兼主伴後釋餘二異上可知。",
    "X39n0714_003:0890a19_0": "【疏】大門第四同違僧諫齊如此四戒九十一墮得罪輕重舉不舉者。",
    "X39n0714_003:0890a21_0": "第四標中違諫五戒四殘一墮輕重不同此一異也又犯殘不舉犯墮須舉此二異也。",
    "X39n0714_003:0890a23_0": "【疏】昔解云云何由披出今直據理隨事重輕故分輕重如殺盜媒長乃至眾學豈非事之大小邪。",
    "X39n0714_003:0890b01_0": "釋輕重中初科初斥古義鈔引云一解今此四戒皆倚傍行教言說相濫朋黨相助事成破僧前二壞法輪後二壞羯磨等說欲不障於理教有違僧法無濫又復口說未犯根本所以事微故結提罪此所謂云云也披分也今解中初立義如下引例隨事重輕義通一切故總舉諸戒也。",
    "X39n0714_003:0890b07_0": "【疏】問若隨事大小故違諫罪有階降者我未諫前亦應隨事不應同吉答諫諫元事不諫罪何妨說事有輕重。",
    "X39n0714_003:0890b10_0": "釋疑中初難由此五戒未作白前堅持不捨並犯吉羅若云隨事合分階降答中但分所諫有別而未盡來難留在下科。",
    "X39n0714_003:0890b13_0": "【疏】若爾不同何因皆吉答大有道理稀數不同事大作稀事小作數是故俱吉諫本依事隨事大小如前解也。",
    "X39n0714_003:0890b16_0": "次難答中論犯自緣稀數據事何妨重輕。",
    "X39n0714_003:0890b17_0": "【疏】問對舉以論何故彼有此無者答九十諫竟便即出舉者為明能隨舉人有同犯故若不出舉無由得結能隨之過此四諫竟若有不見亦合作舉以隨不見但得吉故既不同犯不勞須出。",
    "X39n0714_003:0890b21_0": "次舉不舉問意可解答中初明後戒有舉以隨舉戒相連次故次明四諫無舉論舉有三一不見舉二不懺舉隨順此二犯吉三惡邪不捨舉即說欲不障也隨順犯提今此四諫舉唯上二隨但輕吉能所各篇故不同上。",
    "X39n0714_003:0890c02_0": "【律】十破僧違諫戒。",
    "X39n0714_003:0890c03_0": "【疏】第十破僧違諫戒。",
    "X39n0714_003:0890c04_0": "【疏】意亦有四。",
    "X39n0714_003:0890c05_0": "【疏】言制有三所以不聽破僧者僧眾和合義無乖異理應詳遵如水乳合今反倚傍理教說相似語惑亂羣心壞僧斷法墜陷無辜為惡滋甚故須聖制意在於斯。",
    "X39n0714_003:0890c09_0": "第十制意中初科初敘僧義詳謂審其邪正遵謂稟其法制今下明破義文敘四過一倚教二惑眾三滅法四損他具上諸惡故云滋甚滋益也。",
    "X39n0714_003:0890c12_0": "【疏】二須諫意然彼邪人倚傍佛教乞食等四生聖之緣趣道遠因說緣為種正語等八生聖之因趣道近法正為聖體稱法而談名為正見邪人反說顛倒教理是非兩濫言同意異真偽難分迷情墜惡實可憐愍須僧設諫開示是非冀彼改迷從正棄惡就善是以須諫意在於此。",
    "X39n0714_003:0890c18_0": "次科三初敘法輪邪人下次明破滅顛倒教理者業疏云彼以八正為緣四依為因五法倣同四依又並制盡形出過四正故云是非濫也須下正明立諫冀望也。",
    "X39n0714_003:0891a04_0": "【疏】三結罪意然彼眾僧詳心設諫明顯是非開示令捨而專執己見不肯從勸違僧命重情過得殘。",
    "X39n0714_003:0891a06_0": "三中初濫設諫而下次明違犯。",
    "X39n0714_003:0891a07_0": "【疏】二釋名者可解。",
    "X39n0714_003:0891a08_0": "釋名中破僧是所作事違諫即所犯過二並所防戒是能防下例此釋。",
    "X39n0714_003:0891a10_0": "【疏】三具緣者有五諫不虗設必有所為所以第一明立邪三寶作破僧事邪三雖立若不行化無容設諫是以第二立邪五法行化於時化而不諫或諫不成本無其罪故次第三如法設諫諫雖如法聞諫順從亦無其咎是以第四聞諫不捨事雖拒諫若諫未竟不成彼罪故須第五作三法竟如此生起類通諸戒上來大繁下去無也。",
    "X39n0714_003:0891a17_0": "具緣中五次第相生以彰教意。",
    "X39n0714_003:0891a18_0": "【疏】闕緣不須事稀故削。",
    "X39n0714_003:0891a19_0": "闕緣削者準上緣成自可通曉但五緣中備具名成少乖號闕則前後諸戒無不解也。",
    "X39n0714_003:0891a21_0": "【註】佛在彌尼樓國度八釋子詣瞻波國並證增上地唯提婆達得神足證佛還羅閱祇提婆教人害佛事發惡名流布利養斷絕便別眾食為佛訶責因即破僧舉過設諫而制此戒。",
    "X39n0714_003:0891b01_0": "【疏】就此戒緣初明八釋出家提婆神足證者為取此人為諫事主故次明別眾食緣分屬九十文相可解。",
    "X39n0714_003:0891b03_0": "別釋中戒緣二段初釋出血但出其意即注中初至斷絕一段文也八釋子皆如來宗族提婆是斛飯王子佛之堂弟梵云提婆達多或云調達此翻天熱生時諸天心熱故餘人皆證增上地即初果也唯提婆為利養故詣佛求學神通佛不為說復至舍利弗目連乃至五百弟子皆不為說阿難是親未得他心授與通法提婆入山學得五通教闍王殺父語言我作新佛汝作新王豈不快耶佛還羅閱祇即王舍城提婆遣人害佛不遂乃自推山壓佛密跡金剛以杵擬之碎石迸來傷佛足指是為出佛身血也次下釋破僧以別食為始分屬九十者後別眾食亦由此緣。",
    "X39n0714_003:0891b15_0": "【律】若比丘欲壞。",
    "X39n0714_003:0891b16_0": "【疏】就戒本中三雙一隻也謂諫所諫人諫所諫事為一雙二彼比丘下屏諫拒屏諫為第二雙也三彼應三諫下僧諫拒僧諫為第三雙未有僧殘是一隻罪也一切諫戒例皆準此若解分齊無由混亂。",
    "X39n0714_003:0891b20_0": "次釋戒本總分中初標謂下釋三雙者初是所諫餘二並能諫屏諫旁引僧諫正被一隻即犯科一切下點示類通諸諫不復分也。",
    "X39n0714_003:0891b23_0": "【疏】就初若比丘者拒諫人也。",
    "X39n0714_003:0891b24_0": "釋第一雙拒諫人即此戒犯人也。",
    "X39n0714_003:0891c01_0": "【疏】欲壞已下諫所為事分三欲壞和合僧者明始心也方便受壞下立邪三寶也堅持不捨者行化於時也。",
    "X39n0714_003:0891c04_0": "【疏】就初又三欲壞者出破正之道理也和合者明正法也僧者所破正人也具此三故成前逆蘭也。",
    "X39n0714_003:0891c06_0": "次所諫事釋始心中初科破正道理即九邪法。",
    "X39n0714_003:0891c07_0": "【註】言破壞者有十八事法非法律非律犯不犯若輕若重有殘無殘麤惡非麤惡常所行非常所行制非制說非說是也。",
    "X39n0714_003:0891c10_0": "【疏】就解初句出道理中律但言壞注中廣解初言破壞十八事者明彼邪人方便立法正眾須分其有十八也就中九對半有如非論中廣解何得隱略。",
    "X39n0714_003:0891c13_0": "初句中初科十八法中九正九邪故云半如非也論中即下多論。",
    "X39n0714_003:0891c15_0": "【疏】一法非法者多論云八正真軌生神解是趣道近因名法彼說為非五邪不能生解為非彼說是法。",
    "X39n0714_003:0891c17_0": "牒釋中初對八正真正故非邪真故非偽軌謂軌範行人神解即心慧。",
    "X39n0714_003:0892a01_0": "【疏】律者八正真能調身口離於七非稱律彼為非律五邪反前彼說為律了論解五正道分是法五邪道分非法彼說反前可知三正道分是毗尼三邪道分非毗尼彼說反之可知。",
    "X39n0714_003:0892a05_0": "二中初約義釋次引了論即離八正兼釋前科語業命三為毗尼餘五為法。",
    "X39n0714_003:0892a07_0": "【疏】多論所云犯者不剃不剪佛制有罪名犯調謂有命若不剃剪說為不犯言不犯者心念作惡雖未身口理違惡微不制有罪說為不犯調說心起三毒最是過本反說為犯了論云罪者過如來所制非罪者順如來所立制故。",
    "X39n0714_003:0892a12_0": "三中二初釋犯髮過半月不剃瓜過一麥不剪竝吉彼謂繫屬人身生長不息即同有命剪除成損不剪無害言下次釋不犯意地心念小機不制彼不知機例說為犯下引了論與上小異彼名罪非罪過佛制是罪彼說非罪順佛制非罪彼反說罪過字彼正作違。",
    "X39n0714_003:0892a18_0": "【疏】言輕重者多云犯遮惡者為輕調見壞葉墮龍便謂一切草木皆重重者初篇業思一形永障為重調見先作無犯便言婬盜俱是輕也。",
    "X39n0714_003:0892a21_0": "四中初科初明輕說重彼見壞葉墮龍者即伊鉢羅龍曾斷伊羅葉今受龍報故次釋重說輕彼謂四重並開最初故。",
    "X39n0714_003:0892a24_0": "【疏】了論云輕重兩相各有二緣由於罪制各有四句一由罪重不由制重如殺畜生性罪故重不在前二故非制重二由制重不由罪重如殺草木非後二篇名制重體遮故罪輕三由罪重亦由制重如初四夷是性罪故罪重即初篇中制亦重故四不由制重不由罪重如眾學戒是遮非罪重末篇非制重輕有四句比前反取可知。",
    "X39n0714_003:0892b07_0": "次科了論即約業制相對互織為句初出重句輕下例出輕句應云一由罪輕不由制輕二由制輕不由罪輕三由罪輕亦由制輕四不由制輕不由罪輕還約上戒反對配之此明佛制輕重之相彼於諸句一一反說耳。",
    "X39n0714_003:0892b12_0": "【疏】有殘無殘者多云犯下四篇非一生障名曰有殘調說無殘若犯初篇永喪道芽則名無殘調說有殘。",
    "X39n0714_003:0892b14_0": "五中初科多論可解但明相反不出其意。",
    "X39n0714_003:0892b15_0": "【疏】了論解云正量上座二部所釋同上多部云七聚之戒從下第七上至第一若犯第七名無殘上六不犯名有殘乃至第二篇犯者下之六聚名無殘雖未並犯即兼破義上之一聚名有殘若犯第一隨一戒一切諸戒並無殘。",
    "X39n0714_003:0892b20_0": "了論中初指三部義同云下復加細釋前對五篇此約七聚乃至者合云若犯第六下二聚名無殘上五名有殘第五第四第三並以下為無殘上名有殘上必兼下下不通上此明犯下六聚通得有殘若犯初聚一向無殘彼並反說如上已明。",
    "X39n0714_003:0892c01_0": "【疏】問犯一重戒止於餘聚種類可破自餘三重不可兼犯云何一切名無殘邪答如人四處不可損傷傷一即死不待餘處重戒例之。",
    "X39n0714_003:0892c04_0": "釋疑中以下諸聚總歸四重種類相通可有破義理無通該異種之戒答文亦出多論四處謂腦咽心腰也。",
    "X39n0714_003:0892c07_0": "【疏】言麤惡者如母論云初二篇方便若身若口無慚心故犯濁重偷蘭名麤惡也非麤惡者波逸提下及餘偷蘭也彼皆反說。",
    "X39n0714_003:0892c10_0": "六中初科母論除前二篇就後五聚以分兩別。",
    "X39n0714_003:0892c11_0": "【疏】了論解云言麤有二一意二罪翻此罪麤意麤有四一邪見撥無因果二不信苦樂等報三放逸不愛惜所受戒縱意造惡四濁重貪瞋癡也次用四句分別一由意麤不由罪麤若由四意殺草木等二由罪麤不由意麤非前四意輕爾殺畜三由意麤亦由罪麤用前四意行殺等罪四不由意麤不由罪麤離四意殺草木也非麤亦四一由意非麤不由罪非麤二由罪非麤不由意非麤三由意非麤亦由罪非麤輕爾損草木四不由意非麤亦不由罪非麤重心殺生者。",
    "X39n0714_003:0892c21_0": "次科初總示二麤翻謂翻對意麤四中初二相濫但第二者未必邪見止不信耳行者觀此四心用省己行汙戒墮惡孰不由斯次互織為句又二初麤四句後非麤四句相翻互歷配對大同非麤四中初即前二二即前一三對前四四對前三。",
    "X39n0714_003:0893a02_0": "【疏】常所行非常所行者多云八正道常所用法調說非常五法非常用法調說常所用了論云非常行者非佛所作所習也彼即說是常所行者是佛所作入定說法受現法樂是佛所習彼又反說。",
    "X39n0714_003:0893a06_0": "七中多論可解次了論中非佛作習即邪見諸惡。",
    "X39n0714_003:0893a07_0": "【疏】制非制者多云五篇戒佛金口制調說非制五法非佛所吐名為非制調說為制。",
    "X39n0714_003:0893a09_0": "第八易解。",
    "X39n0714_003:0893a10_0": "【疏】說非說者四是重禁餘是輕約此名正說調說為非四禁為輕餘篇為重是名非說調為是說。",
    "X39n0714_003:0893a12_0": "【疏】了論云非如來說非如來教彼即說是如來所說五陰十二入十八界乃至八萬法門對治眾生八萬煩惱令其觀察是如來教十二部經名句文是如來說彼皆反之。",
    "X39n0714_003:0893a16_0": "九中了論初明說非為是非如來說及非教者如五邪世典之類名言為說法門為教五陰下次明說是為非。",
    "X39n0714_003:0893a19_0": "【疏】即以此法心懷知是口說言非異見異忍為他人說是名邪佛之法寶也。",
    "X39n0714_003:0893a21_0": "總結中心知是者心不應口也口言非者語不副心也異見異忍是自損為他人說即害他邪佛法寶總前半九法也。",
    "X39n0714_003:0893a24_0": "【律】和合(一羯磨同說戒)僧(四比丘若五若十乃至無數也)。",
    "X39n0714_003:0893b01_0": "【疏】言和合僧者釋僧義也和是僧家法也數是僧家相也故注解中羯磨說戒以表和法即六和之中戒見同也注引四人已上即六和中三業同也此明調達以前邪法引得正眾四人已上從己見也。",
    "X39n0714_003:0893b05_0": "後二句中初釋文為二初總示和下別釋數即僧也故下釋注初段戒見同者乃二種法同義兼利同即內三和也後段三業即外三和此下點示即所破也。",
    "X39n0714_003:0893b09_0": "【律】方便受壞和合法。",
    "X39n0714_003:0893b10_0": "【疏】方便受壞僧法者勸諸受法令敬奉也。",
    "X39n0714_003:0893b11_0": "次立邪中方便即能勸受壞等即所勸。",
    "X39n0714_003:0893b12_0": "【律】堅持不捨(謂住十八法而破僧也)。",
    "X39n0714_003:0893b13_0": "【疏】堅持不捨者行化於時同佛引喻猶不止也注解堅持謂心安邪法廣化天下也彼比丘下是。",
    "X39n0714_003:0893b15_0": "三行化中初釋文堅持持即執也同合作聞疑是寫誤謂佛親諫不止明其堅也次釋注中心安者釋住義也。",
    "X39n0714_003:0893b18_0": "【疏】第二雙屏諫拒屏諫也。",
    "X39n0714_003:0893b19_0": "【疏】就此屏文明僧屏兩諫差別十門。",
    "X39n0714_003:0893b20_0": "【疏】初約人不同分二諫者僧諫唯僧四人已上若論屏諫不問僧尼具不具位道俗多少通別來諫二約法不同僧用白四屏用餘言種種方便得止便罷三就處不同僧據作法同界相諫屏諫則通不問自然作法同界別界皆制相諫四就立戒多少分二諫者違僧諫戒則多如此篇中有四九十中有一尼第八戒及八僧殘立戒雖多諫事則少具五義者方得立之故此一諫唯諫一戒違別人諫立戒雖少如九十中一不受諫以諫作犯二拒勸學以諫止犯立諫雖二通於七聚五得罪輕重不同別人諫中通諫七犯若違未作但結吉羅若作犯提據犯通於輕重僧諫之中隨事大小結夷殘提可以情求六結罪分齊分二諫者僧諫約白及羯磨多少不定屏諫未竟吉諫竟言了提七語默不同僧諫語默同違別諫拒勸由言故犯八止作不同分二諫者僧諫作犯別通止作九已未不同僧通已未如調達等局未擯謗是已成也別據未作若作業成既往不咎也十相成不同分二諫如僧祇先屏處一人三諫三越二眾多人三諫不止三越乃至三羯磨四蘭諫竟合前十罪共成一殘無別小罪如五分中三羯磨未竟捨者作三吉三蘭悔不同四分未白竟有吉三羯磨未竟有蘭也。",
    "X39n0714_003:0893c17_0": "第二雙料簡十門前三並由僧諫秉法屏不作法故分二別四中初總標違下次別釋又二初明僧諫制多事少僧有五戒尼八夷中第六戒僧殘中八戒共有九戒五義即前性惡等五次明違別制少事多九十中不受拒勸二戒並諫通篇聚故也五中別人即屏諫所諫通七聚拒諫兼提吉僧諫中大則犯夷如尼第八中如諸殘下即犯提隨事各定故不同前六中僧諫不定如後注中屏二品定言了即拒諫也七中僧諫但令不捨默亦成違八中別通止作不受諫作犯拒勸諫止犯九中僧諫已未各收二戒既往不咎文出論語既已也咎猶責也十中言相成者謂屏能成僧僧不成屏故云不同初引僧祇越即吉羅異名合因成果故無別小罪四分但分僧別兩諫不論一與眾多五分三吉應是屏處三諫僧祇五分僧諫止有偷蘭唯四分白未竟吉故云不同也已上十門前三并十據能諫不同四與五六約制法差別七及八九就所諫分殊則僧屏兩諫條然可見。",
    "X39n0714_003:0894a11_0": "【律】彼比丘應諫是比丘言大德莫壞和合僧莫方便壞和合僧莫受壞僧法堅持不捨大德應與僧和合歡喜不諍同一師學如水乳合於佛法中有增益安樂住。",
    "X39n0714_003:0894a15_0": "【疏】就解屏諫分二從初至堅持不捨來一往牒過示知非法莫壞莫受二大德應與和合下勸同和相。",
    "X39n0714_003:0894a17_0": "【疏】初中彼比丘者如法比丘見行非法故自陳諫諫是比丘者是行邪法人也初莫壞者牒始心於佛不忍思欲破輪時也中莫方便者牒共四伴計校時也後莫受下牒其行化於時不須破僧不須受法也。",
    "X39n0714_003:0894a21_0": "次正釋牒過中初釋比丘明簡邪正初下次釋壞僧次第三時。",
    "X39n0714_003:0894a23_0": "【疏】二大德下上有所勸不為故下必有所為也。",
    "X39n0714_003:0894a24_0": "次釋勸同總分中上勸不為即前壞僧也下有所為即後令和合也。",
    "X39n0714_003:0894b02_0": "【疏】就勸同中初舉喻示諫二舉有益示諫就初法中初與僧和合者成僧義也俗以和為貴僧以和為義必同六相方成僧體如何同戒而欲別見此勸體同也。",
    "X39n0714_003:0894b06_0": "次科勸體同中俗以和為貴論語云禮之用和為貴先王之道斯為美六相即六和內外各三也。",
    "X39n0714_003:0894b08_0": "【疏】二明不諍同師學者世有諍者由異學故今同釋姓師本無殊有何意見而欲乖異此勸行同也。",
    "X39n0714_003:0894b10_0": "勸行中異學謂各從師同釋姓者非異族也師無殊者非異稟也。",
    "X39n0714_003:0894b12_0": "【疏】如水乳合者師乖見異義則有殊師同見合理則無別如乳合乳如水合水不得云乳合水以相合非體鵝能別故。",
    "X39n0714_003:0894b15_0": "釋喻中乳即水之甘味與水體別唯鵝王能別取而食之既非一體法喻有乖必須二物各自論合故云不得等。",
    "X39n0714_003:0894b18_0": "【疏】二於佛法中增益安樂者良由捨除異見同體行和如法修道必除生死得涅槃樂故曰也增益者超凡夫界也安樂者絕三苦也。",
    "X39n0714_003:0894b21_0": "舉益勸中初通釋同體行和躡上二勸也除生死者即增益也得涅槃者即安樂也增下別釋凡夫界即三有也三苦者一苦苦(苦從苦緣生故)二壞苦(為壞相所壞故)三行苦(無常遷動故)既超三有永絕三苦故安樂。",
    "X39n0714_003:0894c01_0": "【註】應語彼言可捨此事莫令僧作訶諫而犯重罪若用語者善若不用語復令餘比丘尼優婆塞優婆夷若王若大臣種種異道沙門婆羅門求第餘方比丘聞知其人信用語者應求諫之是屏諫也。",
    "X39n0714_003:0894c05_0": "【疏】注中可知。",
    "X39n0714_003:0894c06_0": "點注中文有二段初自諫若不下求他諫初求近人若餘方下求遠人。",
    "X39n0714_003:0894c08_0": "【律】是比丘如是諫時堅持不捨(拒屏諫也)。",
    "X39n0714_003:0894c09_0": "【疏】是比丘如是諫下四拒屏諫也是比丘者通能所也就拒諫時望殘未成但結小罪。",
    "X39n0714_003:0894c11_0": "拒屏諫中通能所者義兼兩釋從所尤親就下判罪如上已明。",
    "X39n0714_003:0894c13_0": "【律】彼比丘應三諫捨此事故乃至三諫捨者善。",
    "X39n0714_003:0894c14_0": "【疏】彼比丘下明僧諫相乃至三諫捨者善何等善邪一以本諫不成殘故二以屏諫非提罪故三以所犯不成蘭故曰善也。",
    "X39n0714_003:0894c17_0": "第三雙初科釋文三義釋善無非離犯不成蘭即破輪罪也。",
    "X39n0714_003:0894c19_0": "【註】彼比丘應集僧羯磨如諫作白已應更求乃至一羯磨二羯磨亦爾。",
    "X39n0714_003:0894c21_0": "【疏】注中明僧和相隨其白羯磨一一住問者明諫法也故約白羯磨中間住諫冀彼迴心從善何得誦過成犯則非本意也。",
    "X39n0714_003:0894c24_0": "釋注中明諫法者以白四羯磨止是告僧故須隨法加勸方名諫法中間住者謂四法三住欲彰諫意不為成罪。",
    "X39n0714_003:0895a03_0": "【律】不捨者(拒僧諫也後戒例爾)僧伽婆尸沙。",
    "X39n0714_003:0895a04_0": "【疏】不捨者拒僧成業相也。",
    "X39n0714_003:0895a05_0": "【疏】問此三羯磨竟得僧殘者為攬因成果不答上方便義已論此何復問恐迷故耳然諸部不同五分所明藉前方便成後重殘如律本中作惡修善有步步罪福多論亦同如律二羯磨竟三蘭心不息故若竟結殘更不云蘭明知相成如僧祇攬一切蘭以成僧殘又見云前因變滅以成後果故知攬四蘭共成一殘。",
    "X39n0714_003:0895a12_0": "次釋拒諫初問答中初示重意然下正釋初句總示五分下別釋又二初至亦同明不相攬五分藉前方便謂藉勢而成顯非攬故如下引律進趣反證外部步步罪福顯是各成非相攬故此示本宗非無彼義多論宗十誦故同五分次從如律下明相攬初引本部即如注中二羯磨竟兼前一白故得三蘭僧祇文如上引及與善見二文並同。",
    "X39n0714_003:0895a19_0": "【疏】問律本但出二羯磨竟三蘭何得加四答僧祇有之義不可別以白未竟因吉竟即果蘭三羯磨未竟因不可吉以竟果殘故有四蘭。",
    "X39n0714_003:0895a22_0": "轉難中初難上云四蘭乖律文故答中初句指出亦即上文次句明同彼明成果故說四罪此明中捨故但有三據理須四如下所示由作法竟方至果殘第三法未竟猶是方便理須結蘭問白未竟吉羯磨未竟為有吉否答無也詳律文意白與羯磨自分兩節各有因果白既一法故以未竟為因白竟為果果既是蘭因故犯吉後三羯磨都是殘因所以三蘭無別因吉也。",
    "X39n0714_003:0895b06_0": "【疏】問偷蘭以蘭為因何過答同名種過。",
    "X39n0714_003:0895b07_0": "次難中初科即躡白未竟吉以為問端答文以因果別聚名種不同故。",
    "X39n0714_003:0895b09_0": "【疏】若爾吉罪何故因同答蘭下有罪以小為因吉下無罪故因同果若作異名名則無窮然通而為言因吉成果吉如九十中諫未竟得吉者是自有多因吉各不相成即如白羯磨未竟者是也。",
    "X39n0714_003:0895b13_0": "次並難中答文二初對蘭釋通然下別示吉罪九十中諫亦白四法初白未竟吉白竟亦吉此即因吉成果吉也又白與羯磨未竟三吉望後提罪三並是因隨法別結各自為果此即多因吉各不相成也。",
    "X39n0714_003:0895b18_0": "【疏】因此通明律中因果不同之相十種分別。",
    "X39n0714_003:0895b19_0": "三明差別中初云因此者指上為由也通明者一則不局此戒二乃不專吉羅觀下十中一一各出二句前九種中欲翻下句故出上句事並如常故所不釋唯後第十二句並異故具釋耳。",
    "X39n0714_003:0895b23_0": "【疏】一有一因生一果可知有一因生多果如一時多受女家語一時語男家別別報女家二有一果從一因生同上有一果從多因生如步步行罪福三諫罪成是也三有同類因果有別類因果如尼八事成重隨捉手捉衣因果各別成八即夷四有果從因生有果不從因生如多云視比坐鉢心念等罪皆無因成果五有因作果有因不作果如出佛身血等六有果攬因成有果藉勢成如五分殘果成已別悔因也七自有因輕果重有因重果輕如教人行盜後捨戒為沙彌八自有唯因唯果有亦因亦果如初諫竟得蘭結吉各不相成此蘭望前吉為果望後殘為因也九有一業一因一果有一業多因多果如造非法房咽不淨食三罪四罪七墮八墮等十有因用因成如白竟吉也自有果用果成如八事成重違諫偷蘭成殘等例。",
    "X39n0714_003:0895c14_0": "初中媒嫁三時受往同時各得一蘭故為一因報不同時別別成殘故生多果二中如上可解三中言別類者謂不由一事而成果罪故舉八事明之即尼受染心男子作八種事具足犯夷文舉初二三入屏處四共立五共語六共行七身相倚八共期因果各別者此謂隨事成蘭各論因果望下成夷則並因耳四中多論即眾學戒起嫌心犯當座即起無別方便然須目視非不兼色心念等者如不攝念惡覺默妄之類竝無因也若爾多論亦制心犯與成宗何異耶思之五中云等者如自殺犯蘭之類六中二句可照前答攬因成果如僧祗四分也七中比丘時教人因蘭沙彌時事成果吉八中亦可引顯上義得蘭即當篇結吉如九十九中造房一業過量不乞難處妨處具則四罪言三四者示不定也咽食一業而有殘宿非時不受內宿內煑自煑惡觸言七八者亦謂不必也上二且列果罪而各有因即二多也十中二句竝見前文。",
    "X39n0714_003:0896a07_0": "【註】若僧諫時白二竟捨犯三偷蘭乃至白竟捨者犯一偷蘭白未竟捨但一吉羅若未白前受破僧法堅持不捨並犯吉羅尼同僧殘。",
    "X39n0714_003:0896a10_0": "【疏】就注辨相中初明違諫輕重二若未白下就諫所為事明輕重者根本以論初行五法輕吉後終外化時重蘭也就尼同犯中雖無破輪體得立主伴堅持五法以誘於人也。",
    "X39n0714_003:0896a14_0": "釋注犯中違諫輕重注云白二竟者謂一白二羯磨以第三羯磨未竟無犯竟則至果故所不明所為事即是破僧根本論者決文中吉罪據從始也尼中無破輪體謂不能自立法故得主伴者倣同僧故。",
    "X39n0714_003:0896a19_0": "【註】不犯者初諫使捨若立非羯磨作訶諫者若非法非律非佛所教若破惡友知識若欲破僧者若作非法者若為僧塔和尚闍黎知識作損減破者不犯。",
    "X39n0714_003:0896a22_0": "【疏】不犯中初諫便捨一切不犯若作五非無成諫義此不犯僧諫非不違屏諫也言非法者作無軌要也言非律者無調業也非佛教者不是聖說也破惡友下以前立邪欲毀正故今以正法破邪非法事緣皆不犯也。",
    "X39n0714_003:0896b03_0": "不犯中初五非者律有五非羯磨一非法別眾羯磨二非法和合眾羯磨三如法別眾羯磨四法相似別眾羯磨五法相似和合羯磨非法非律並據秉法設諫為言法雖不非事乖軌度故云非法又非理折伏而非調攝故云非律也不是聖說者出胸臆也破惡友下注中四節初句指所破人下三並彼所作事言破邪非法對注易見事緣即僧塔和尚等作損減也。",
    "X39n0714_003:0896b11_0": "【律】十一助破僧違諫戒。",
    "X39n0714_003:0896b12_0": "【疏】第十一助破違諫戒。",
    "X39n0714_003:0896b13_0": "【疏】眾僧作法諫主之時四伴影響助成破僧僧尋設諫拒而不受故曰助破違諫戒也。",
    "X39n0714_003:0896b15_0": "十一釋名初科四伴一曰三聞達二名騫茶達婆三名拘婆離四名迦留羅鞮舍影響謂如形之影如聲之響言其相副應。",
    "X39n0714_003:0896b18_0": "【疏】有人言此名助惡遮僧不聽諫違諫戒何以知然故文云諸大德莫訶調達此遮僧也乃至我忍可等此助惡也。",
    "X39n0714_003:0896b21_0": "古解中初科古謂此戒無破僧義故以惡字替之又闕遮僧諫義故復加之兩引文據明非妄謂。",
    "X39n0714_003:0896b23_0": "【疏】問若非助破何以諫言莫破答此列其意不以為諫。",
    "X39n0714_003:0896c01_0": "遮妨中初問戒文諫破故須通之答中以前戒正諫破僧此戒正諫遮諫但由遮諫意在壞僧故文列之非正諫事。",
    "X39n0714_003:0896c04_0": "【疏】若爾前戒諫時有人教言不捨即結其蘭何為不諫答前是助惡而不諫僧此是具二故須設諫。",
    "X39n0714_003:0896c06_0": "轉難中前教不捨亦是助惡必如所立亦應須諫答約具闕即彰兩異。",
    "X39n0714_003:0896c08_0": "【疏】然諸律中但明助破。",
    "X39n0714_003:0896c09_0": "結斥中既按諸律理無攻異。",
    "X39n0714_003:0896c10_0": "【疏】具五緣一調達作破僧事二如法諫三助成破僧此是諫家所為四眾僧如法設諫五三羯磨竟殘。",
    "X39n0714_003:0896c12_0": "【疏】闕緣可解。",
    "X39n0714_003:0896c13_0": "具緣可見翻成闕緣故不別列。",
    "X39n0714_003:0896c14_0": "【註】佛在羅閱祇時提婆達故執五法盡形乞食著糞掃衣常受露坐不食穌鹽魚及肉以教比丘眾僧諫時伴黨比丘助破諫僧比丘舉過佛訶責已因制此戒。",
    "X39n0714_003:0896c18_0": "【疏】就戒緣中初明調達執五法相二明伴黨比丘助破為緣。",
    "X39n0714_003:0896c20_0": "【疏】就前五法乞食糞衣露坐似佛四依為相似語故然不同四依開制託緣此三調達說必盡形故後二妄語者調云蘇鹽味重魚肉損生故立二斷也調達云以此五法為人說時年少比丘必多信受上座長老則不允從於王舍城創說之時五百年少一時信受六十長老及阿難云此是非法非毗尼非佛教脫鬱多羅僧於一面前已設諫今猶復行四伴順從故又設諫緣相如此。",
    "X39n0714_003:0897a04_0": "戒緣牒釋中二初明五法邪正對明但四依中易其第三除去後一復加餘二欲強佛制令人受行一制盡形更無開許教雖嚴峻人不可依不濟機緣但成虗設判歸邪法其致在茲前三傍佛故云相似後二自立故云妄語酥鹽味重者謂以酥鹽煑肉等為膏如多論酥肉汁僧祇五脂為七藥之類也問永斷魚肉若是邪法何以稜伽涅槃復制斷邪答法化初開未宜即禁涅槃方等正合機宜無緣輒制故得名邪機至教興故名正耳又律對小機說為正食斷則成邪經被大根乖於慈行斷則名正又彼法出於惡意不為利生佛教。",
    "X39n0714_003:0897a14_1": "自慈懷無非濟物所以異也調達下次明行化五百年少從彼所化共往伽耶別自說戒目連身子二人往化目連神力令彼昏睡身子說法令得正信同歸佛所還得和合六十下三明設諫又二初敘前戒諫主脫多鬱多羅者以乞懺治擯並著下衣今為僧諫事同擯罰故前下次顯今戒諫伴。",
    "X39n0714_003:0897a21_0": "【律】若比丘有餘伴黨若一二三乃至無數。",
    "X39n0714_003:0897a22_0": "【疏】就戒本中文同上七雙單之科不容重舉。",
    "X39n0714_003:0897a23_0": "【疏】就初句若比丘下乃至無數總明正助破僧人也初謂調達非正諫人列來何為欲取助者二有餘伴黨此正戒本諫所諫人也若一二三是元從調達三聞等四也乃至無數者是化天下招慕所獲者。",
    "X39n0714_003:0897b03_0": "次解戒本釋第一雙初科釋文中初總示初謂下別釋又二初釋正破二釋助破元始也從謂隨從。",
    "X39n0714_003:0897b05_0": "【註】言其伴者四人若過有二順從法順從者以法教授增戒增心增慧諷誦承受也衣食順從者給與衣被食飲牀臥具醫藥。",
    "X39n0714_003:0897b08_0": "【疏】注解云四人若過解正助二伴相也有二順從者戒本雖無順從字伴黨是順從義也其相可識。",
    "X39n0714_003:0897b10_0": "釋注四人為正伴釋上一二三若過是助伴釋上無數有下次釋順從由相順從故為伴黨注中法順從無越三學增心即是定學衣食順從不出四事。",
    "X39n0714_003:0897b14_0": "【律】彼比丘語是比丘大德莫諫此比丘此比丘是法語比丘律語比丘此比丘所說我等喜樂此比丘所說我等忍可。",
    "X39n0714_003:0897b17_0": "【疏】二彼比丘下至我等忍可來明助伴破相正見諫家所為事也就分為二從初至莫諫此比丘一往遮僧不聽諫詞二此比丘下出不聽之道理。",
    "X39n0714_003:0897b20_0": "【疏】初中彼比丘語是比丘者調達四伴語正法僧也莫諫此比丘者不須諫諭調達也。",
    "X39n0714_003:0897b22_0": "【疏】就後說理中初明法律語者人如故我隨順也此比丘所說下法如故我忍可也。",
    "X39n0714_003:0897b24_0": "所諫事釋文易解。",
    "X39n0714_003:0897c01_0": "【註】此謂助伴黨惡諫僧言調達者具明法律我今喜樂云何設諫為此過本也。",
    "X39n0714_003:0897c03_0": "【疏】注解之中文相甚露。",
    "X39n0714_003:0897c04_0": "注中言甚露者露即是顯。",
    "X39n0714_003:0897c05_0": "【律】彼比丘言大德莫作是說言此比丘是法語比丘律語比丘此比丘所說我等喜樂此比丘所說我等忍可然此比丘非法語比丘非律語比丘大德莫欲壞和合僧汝等當樂欲和合僧大德與僧和合歡喜不諍同一師學如水乳合於佛法中有增益安樂住。",
    "X39n0714_003:0897c10_0": "【註】此謂諸善比丘以法屏諫調達所說人法俱非勿妄受也。",
    "X39n0714_003:0897c12_0": "【疏】二彼比丘下明屏諫也就中分四初至我等忍可來一往領彼諫詞也二然此比丘非法律語者出勸捨道理也以人法雙非有何正則而相隨助也三大德下明大眾別人所以加諫恐僧異別故云莫壞當和也四大德與僧和合下勸隨法眾無非法別法喻顯彰樂果非遠故也。",
    "X39n0714_003:0897c18_0": "第二雙屏諫中科分四節點文示義無不盡矣大略同前不復曲釋。",
    "X39n0714_003:0897c20_0": "【律】是比丘如是諫時堅持不捨。",
    "X39n0714_003:0897c21_0": "【疏】四是比丘下拒屏諫也。",
    "X39n0714_003:0897c22_0": "【律】彼比丘應三諫捨是事故乃至三諫捨者善不捨者僧伽婆尸沙(辨相如上)。",
    "X39n0714_003:0897c24_0": "【疏】彼比丘應三諫下正僧諫也不捨者拒僧諫也。",
    "X39n0714_003:0898a01_0": "【疏】本翻律人簡語不淨致令彼此通濫能所不知若不義求難辨邪正也。",
    "X39n0714_003:0898a03_0": "點示中以彼是二字能所不分前所諫事中彼比丘即所諫是比丘為能諫及拒屏中是比丘乃是所諫僧諫中彼比丘又是能諫此謂通濫也準刪定戒並以能諫為彼所諫為是則邪正可分也。",
    "X39n0714_003:0898a08_0": "四分律含注戒本疏行宗記三上之一"
}