{
    "X39n0714_002:0788c01_0": "四分律含注戒本疏行宗記二上之一",
    "X39n0714_002:0788c02_0": "大宋餘杭沙門　元照　述",
    "X39n0714_002:0788c03_0": "【疏】四分律含注戒本疏卷第二上(從正宗初訖殘第七)題中上三字是律題標所宗故次四字是戒本題示所解故疏之一字正目今文若約人以簡律及戒本二並佛言上加四分則起於部主含注及疏乃始於南山餘如前卷。",
    "X39n0714_002:0788c08_0": "【疏】終南太一山沙門釋　道宣　撰【疏】就正宗初約文分位八段自別。",
    "X39n0714_002:0788c10_0": "總舉云自別者以戒本八篇前標後結文無指濫不假分故。",
    "X39n0714_002:0788c12_0": "【疏】餘七未解且明初篇十門分別前明戒犯業必有因故以四戒配其三毒發雖由心暢必在具故次第二起由身口業成彼我非說不曉故次第三自作教他上明成業未辨境緣故次第四犯分三趣犯境內外義須分別故次第五境約自他前雖訖境成其犯緣未知心業交雜之相故次第六明心錯誤心境乃彰通局須顯故次第七明業剋漫業成乃具須知制興故次第八明其教意由致雖陳前後未顯故次第九明其頒位上來兩眾諸相乃分下類業非理須明識故最後列成任運。",
    "X39n0714_002:0789a04_0": "釋初篇敘生起中初句指後且下顯今上二句總標前下正敘文為十段初段創起文不因前後九皆有躡前生後就文尋之初言戒犯者謂於戒有犯或可寫倒言有因者業依惑起故指毒為因發下敘第二具即身口準下通分止歸二業互造則兼三業今云身口且就通標業下第三事假他為故云彼我必涉言教故云非說等上下第四初句通躡上三犯境下第五云內外者內即是己外即目他如漏失戒引五分文以自他身分內外色前下第六初二句承上四五心境下即第七初句總躡上六通局即對剋漫業成下第八初句亦通總前門言教意者即明初篇對何而制下對三毒以立四戒由下第九初句躡上興意言前後者謂明四戒列次所以頒字音誤義合作斑上下第十初一句通躡前九兩眾即具戒僧尼下類即餘三眾上之十門總束為六初文是惑二三即業四五明境六七心境交互八九屬教第十約人。",
    "X39n0714_002:0789a21_0": "【疏】先解初門。",
    "X39n0714_002:0789a22_0": "【疏】婬之一戒無始染本起因三毒成必在貪故善生云若為自樂是名從貪婬怨眷屬是名從瞋於所生母行非梵行是名從癡境交內順非貪不辨以癡不遂瞋是相違故兩不成。",
    "X39n0714_002:0789b02_0": "配毒中婬戒分三初明起成起即據始成即取終故下引經證起境下約義辨成。",
    "X39n0714_002:0789b04_0": "【疏】殺盜二戒犯通損益終因三事互起相成。",
    "X39n0714_002:0789b05_0": "殺盜中標云損益者謂損他益己以婬唯適已而非惱他殺盜兩兼故云通也。",
    "X39n0714_002:0789b07_0": "【疏】何以明之即善生云若為己身及諸眷屬而取他物是名從貪若盜怨物是名從瞋劫奪下姓是名從癡如律本中燒埋壞色不益己故名瞋起成如僧祗中摩摩帝互用佛僧之物皆犯夷者癡心起成三毒互成可以顯也。",
    "X39n0714_002:0789b12_0": "盜中初句徵起即下引示初引善生備明三事下姓即簡大姓如婢僕之類賤故不貪非怨故不瞋故是癡也如下引二律盜相義判二毒摩摩帝即經營人彼以塔無物僧有物即持僧物治塔得重罪三毒下結示盜本貪犯餘亦能成故云互也或可上據三單始終為言此示兼具故云互成應云貪起瞋成貪起癡成餘二為頭亦各有二則為六句或復具三如取怨美物謂無因果之類文不委出故云可顯。",
    "X39n0714_002:0789b21_0": "【疏】因解殺戒論心如善生云貪利害命瞋殺怨家癡謂有福殺老父母又雜心云如毒蛇等於人有害父母老病謂殺無罪皆是癡攝又成論中依王舊法約罪殺人自謂無罪但是癡成何以故具足殺緣心依惑故互起相成。",
    "X39n0714_002:0789c02_0": "殺中初標云因解者謂準盜明殺次第相由故云因解後云又依義亦同此如下先引善生通明三事殺老父母者使其不受病苦仍謂得福又下別引二論義準為癡蛇既害人殺故無罪今多此見即是癡人成論依王法者如今官典刑戮於人言舊法者謂是先王所制依行無罪言癡成者是今所判準論但云亦應得罪何下推釋有二意初約具緣釋論云以四緣得殺罪一是眾生二知是三有殺心四斷命心下次約依惑釋以煩惱未除動必結業故殺本由瞋貪癡能辨故云互起也。",
    "X39n0714_002:0789c12_0": "【疏】又依演出大妄語戒本為利己貪癡起成兼瞋何爽故善生云若為財利自受樂故名貪懷怨名瞋畏死名癡。",
    "X39n0714_002:0789c15_0": "妄語中初科標云依演出者倣前殺盜通三心故為利是貪稱聖是癡兼瞋一句對破他解故下引示可解。",
    "X39n0714_002:0789c18_0": "【疏】有人言思貪名利言了即結暢思事竟則無瞋癡又言章雖了前聞不信既無名利反增瞋惱何得有貪今解不然夫言妄語取其聲相言了即成豈後得財方名成也。",
    "X39n0714_002:0789c22_0": "次科初引古彼分兩別初約得利唯局貪成後約不得容兼瞋毒今下正斥妄取言了不待得物瞋在後起不名成業應如善生懷瞋而誑則相兼明矣。",
    "X39n0714_002:0790a02_0": "【疏】此之四戒成犯之處即結究竟後之暢遂乃隨喜業如婬侵境盜取離處殺據命斷妄在言了斯至果也或有境交離處心無染奪者自在別開非關大判也。",
    "X39n0714_002:0790a06_0": "總判中三初分前後業異如下示結犯分齊或下指境想差別境交即婬對下染字離處是盜對下奪字文略殺妄可例知故。",
    "X39n0714_002:0790a09_0": "【疏】二明三業業門者。",
    "X39n0714_002:0790a10_0": "【疏】通約四戒用分二業前三身犯第四口犯。",
    "X39n0714_002:0790a11_0": "三業中通別兩分者義鈔名麤細分亦可約單互分通分可解。",
    "X39n0714_002:0790a13_0": "【疏】別就互造婬戒成犯事在形交故唯在身口非犯義由無語故。",
    "X39n0714_002:0790a15_0": "別中婬戒由無語者非口能成故律中教他作婬佗作犯蘭不作但吉。",
    "X39n0714_002:0790a17_0": "【疏】殺盜二戒身口互造兩得相成然身為根本口為枝條所以然者損財害命身自獨成不待語助故知身本口語教死言了未成待前命斷方得重罪要由彼身助口成業故知枝條。",
    "X39n0714_002:0790a21_0": "殺盜不互中初科分二初立義上二句明造成通互容相助故下二句明結業不互局本枝故本即正位枝謂旁兼所下徵釋所以初釋根本口下釋枝條。",
    "X39n0714_002:0790b01_0": "【疏】問口業不得獨成殺盜云何呪物過關殺人既得成重曾未身助答如論所陳凡有呪法皆使鬼神扶物過關及以斷命假彼身助方成業也。",
    "X39n0714_002:0790b04_0": "初難中初牒前云下立難呪物過關即盜王稅呪物殺人謂符祝厭禱律皆結重此並口作俱不假身故引為難答中如論即指多雜既憑鬼神還同身助。",
    "X39n0714_002:0790b08_0": "【疏】若爾須身方成業者如師子吼殺獸壯夫咄殺人豈有鬼神身業相助解云亦由人畜身壯聲大不乖前義。",
    "X39n0714_002:0790b11_0": "次難中師子爾雅謂之狻猊食虎豹或一吼則令獸死引畜類人明無他助解中身壯聲大雖即自身義同他助。",
    "X39n0714_002:0790b14_0": "【疏】若爾深河誑淺口造身業彼依而死何必身壯無學著衣身造口業彼依其言何有口助今釋此義亦由問答身業渡河死方成業口業亦爾亦須他助無獨成義。",
    "X39n0714_002:0790b18_0": "後難中初約口成殺業而無身助無學下約身造妄業而無口助或人施物問言是聖人者須著三衣貪施即著則犯重罪釋中並約所殺所誑以明身口兩助此應古解於義未顯疏家助成故標今釋。",
    "X39n0714_002:0790b23_0": "【疏】若依多雜等論三業不互所以者何業性異故事不究竟言雖了了未得成業要由身助又云如自在者語仙人意嫌必須人鬼相助成業。",
    "X39n0714_002:0790c02_0": "次明互造初文為三初示宗多雜等論皆有部所計所下出不互所以則有二意初約業異釋若約能造色身是可見有對口即不可見有對若據所造過身造婬盜殺口作誑妄若約所發業性不混若取來報感果不同事下次約事不竟釋初句立義言下釋成又下引類自在者語如王大臣遣使殺戮此證口互仙人意嫌如下所引此明意互身造口業例亦如是是聖者起必假他語即是口助。",
    "X39n0714_002:0790c10_0": "【疏】若依本律成論所通三業互造各自成業故彼文云殺不善業身亦可造隨以自身殺害眾生口亦可造或教人死或以呪殺心亦可造有人發心能令他死故彼論云如和利經說外道神仙起一瞋心殺那羅國如檀特等諸險難處皆諸仙人瞋心所作。",
    "X39n0714_002:0790c15_0": "今宗中初科為三初示宗各自成者隨約能造結業成罪不同多雜從所作事判定身口故彼下引示且明殺業餘可準知初通明三業身口意三如文次列而身是正口意為互云教死者論云教勅即是遣使文無歎死義亦同之故下別示心造論文二節初引經證那羅國者具云那羅千陀羅國如下次舉事證言檀特者即西土山名經音義云或言單多羅迦山此云蔭山此明仙人心業強猛證上起心即能害故。",
    "X39n0714_002:0791a06_0": "【疏】因此義張三業互相身造口業著脫三衣口造身業教死誦呪意造身業仙人一瞋意造口業布薩默妄如是例通以類諸戒。",
    "X39n0714_002:0791a09_0": "約義中如前引論但明殺業口意造身今總諸戒通論交互文中四位身口各一意則兼二結云通諸戒者上文且據殺妄為言目餘諸戒身業教人(如教人盜及咒物過關等)口業現相(如二麤語等)並攝諸句。",
    "X39n0714_002:0791a13_0": "【疏】問意造二業得互起者何故身口不造意業答意是業本二具由生可以知也。",
    "X39n0714_002:0791a15_0": "問答中本得兼枝枝無造本於義易知恐疑故問二具即是身口。",
    "X39n0714_002:0791a17_0": "【疏】妄語一戒本希名利非言不成亦有身現無疑成重比前互造可以類之。",
    "X39n0714_002:0791a19_0": "妄中初明正業亦下明互造現相必約前信故須無疑義句已明故云比前等。",
    "X39n0714_002:0791a21_0": "【疏】三自作教他門教遣分別。",
    "X39n0714_002:0791a22_0": "【疏】先明教人。",
    "X39n0714_002:0791a23_0": "【疏】言婬戒者自作成重教人為非樂染前人於我無預不得同犯。",
    "X39n0714_002:0791b01_0": "第三門初婬中於我無預言能教人不預其樂也。",
    "X39n0714_002:0791b02_0": "【疏】殺盜二戒過通損益自作教人損境暢思期契相同彼我同犯或能教者剋所使意異或時節早晚坐立乖契或互顛狂捨戒緣闕但有少差於此犯法教者不犯漫心無寄隨作相應皆名為犯。",
    "X39n0714_002:0791b06_0": "殺盜中初通明犯相損益之言不殊前釋或能下二別簡剋漫初剋中或時等者且列五異時節坐立緣闕此三竝約所教顛狂捨戒則通能所故云互也問如教殺坐人彼立即害云何非重答既云剋心能教應言見坐可害立不應害此則不犯若不指定同下漫心時節早晚亦同此釋次明漫心者即不定早晚等也。",
    "X39n0714_002:0791b13_0": "【疏】大妄語者自說成重教人稱聖名利擁彼於我無潤故不同犯。",
    "X39n0714_002:0791b15_0": "妄語中問文云教他不犯者如教他稱己自得名利豈不犯重答此落後遣非此所明。",
    "X39n0714_002:0791b17_0": "【疏】教者離己義疎遣者向己義親何以明之且如戒中遣人就己行婬遣人說己得聖利樂是我犯齊究竟殺盜兩戒無有遣義故非所論。",
    "X39n0714_002:0791b20_0": "次明遣中初分示離合作利寫誤何下推釋可解問殺盜何以無遣義耶答遣人殺己罪不至果豈有令他盜取我物是則婬妄二戒遣重教輕殺盜兩戒有教無遣。",
    "X39n0714_002:0791b24_0": "【疏】四明三趣門罪趣分別者先以罪對趣後以趣分罪。",
    "X39n0714_002:0791c02_0": "第四門標分中初即以罪歷趣以辨重輕後謂將趣歷戒以簡通局。",
    "X39n0714_002:0791c04_0": "【疏】初中約人犯四唯夷一品對非人犯四則夷蘭二品對畜生犯四罪則四種婬則犯夷盜誑皆吉殺則犯提若知解人語或能變化殺誑皆蘭盜亦應同而律不列報異人故殺但犯提盜比外部則得吉羅解語變化相濫於人故盜犯蘭。",
    "X39n0714_002:0791c09_0": "初科初人可解非人二品淫戒犯夷餘三竝蘭畜中四種上列三品若下示蘭一品則為四矣初指二戒殺戒云若畜生有智解於人語若能變形殺者竝蘭妄戒亦云若不能變形向說得吉(反顯能變須蘭)次例盜戒初二句例準文出殺妄盜戒無文故言不列報下釋所以初明報異結輕此本明盜舉殺助顯以殺戒簡犯文最明故比外部者十誦多論鳥獸食殘取者皆吉解下明報濫須重。",
    "X39n0714_002:0791c17_0": "【疏】次以趣分罪者。",
    "X39n0714_002:0791c18_0": "【疏】婬之一戒三趣同犯良以煩情內逸垢心厚重不問境之美惡但是正道適暢不殊故制同犯又不就損境而制故不得論趣優劣何以知然屍上行非同犯重攝知何所損但是生死根源故偏禁制。",
    "X39n0714_002:0791c22_0": "次以趣分罪淫中初示犯良下顯意有二初約染心不異又下約前境無損又三初示義何下舉證律中若死未壞若多未壞婬皆結重但下顯制意欲為有本婬染偏重故推此業為生死源。",
    "X39n0714_002:0792a02_0": "【疏】下之三戒人重餘輕。",
    "X39n0714_002:0792a03_0": "明餘三中三戒大同故先通示不無少異下復別論。",
    "X39n0714_002:0792a05_0": "【疏】何以知然良由人趣善因所招生處報勝知解者多於此財物戀著情重及至盜奪守護亦強能令失者懷惱增苦故有欺侵便得極重非畜兩趣一一反前雖有盜取但制輕罪。",
    "X39n0714_002:0792a09_0": "盜中初徵良下釋前明人重凡有五義初報勝知下強識於下繫著重及下護心強能下惱多非下次釋餘輕異上五義故云一一等。",
    "X39n0714_002:0792a12_0": "【疏】問地居諸天報勝解多盜結輕者豈不相違答天報乃勝趣別盜希於財著少縱盜惱微故結非重如盜北洲但制輕罪於物無我無所著故。",
    "X39n0714_002:0792a15_0": "問中地居天者謂須彌已下依地住者簡異空界然盜空天物結罪無殊但取下地有可盜義故偏舉之報勝解多即上人中初二兩義而天又勝故曰相違答中初二句對上人中前二義報解雖勝盜取稀故於下反上後三義著少惱微義兼護弱如下引例可解。",
    "X39n0714_002:0792a21_0": "【疏】殺相亦爾人重餘輕何以知者亦由人趣報勝根器有緣能修諸善出家成聖然彼形心俱是道器今若加害斷彼相續即是障道為過情深故制極重餘趣反上報微故輕。",
    "X39n0714_002:0792b01_0": "殺戒勝劣中初科上二句指同何以下釋所以初明人重亦由者亦前盜戒有緣者南洲具四緣謂見佛聞法出家成道東西二洲無見佛緣北洲難地故非所論文中且舉下二緣耳(或作有儀非也)然彼等者示制重之意餘下次簡非畜以不具諸緣故云反上。",
    "X39n0714_002:0792b07_0": "【疏】是以多云三歸五戒木叉解脫沙門四果佛及辟支必在人道漏盡成聖故有損害便得重罪天雖報勝不能出家以成僧寶。",
    "X39n0714_002:0792b10_0": "引證中彼論問曰何以但害人得波羅夷答如文引木叉解脫即是具戒上明三種因法則在凡地沙門下三種果人唯局聖位修因剋果俱在人中天雖下簡餘趣不能出家者彼論帝釋語目連云一天子一天女妓樂自娛不能自割況作天王種種宮觀無數天女天須陀食自然百味百千妓樂以自娛樂雖知佛世難遇正法難聞而染樂纏縛不得自在善心力弱何由出家然此且據一相以論至如諸經帝釋梵王多臨法會諸天聞法得道亦多則非言限。",
    "X39n0714_002:0792b20_0": "【疏】又復趣別相殺義希故就此義害得輕罪。",
    "X39n0714_002:0792b21_0": "次約義希在文可解。",
    "X39n0714_002:0792b22_0": "【疏】問趣遠殺希得輕罪者共天行染趣別應輕答天位高遠理絕恒心但婬欲熾盛不擇境之美惡容有下赴為之義數過於殺盜故制重罪如律文中天女事證又如人道下染畜趣即此良證何事疑。",
    "X39n0714_002:0792c02_0": "問中以婬天亦重故引為難答中初承來問絕恒心者不同下地欲心相續故但下正答婬數餘疎重輕乃異如下引證律中有比丘與天女行婬已疑佛言波羅夷又下舉例即律中有比丘與獼猴行婬因制共畜生等以人染畜例天就人於理明顯故云良證。",
    "X39n0714_002:0792c08_0": "【疏】問盜天殺天同得蘭者盜畜殺畜如何輕重答畜保命重於財輕故。",
    "X39n0714_002:0792c10_0": "問非畜中盜殺二戒天同畜異以殺畜犯提盜犯吉故答中反彰天報財命俱重。",
    "X39n0714_002:0792c12_0": "【疏】若爾何故律中龍珠鳥翅一去不還答猶是借喻以輕況重。",
    "X39n0714_002:0792c14_0": "引緣難中龍珠者昔有螺髻梵志居恒水邊為龍所撓佛令從彼乞頸下珠瓔龍即不來鳥翅者昔有比丘住林間正患夜半眾鳥悲鳴佛教乞鳥兩翅即飛出林不復還矣引此二緣則顯畜類於財亦重則違上義答中此出房戒因諸比丘乞求多故人皆逃避佛將制戒因說此喻彼云佛告比丘鳥獸尚不喜乞況於人乎故云借喻等也。",
    "X39n0714_002:0793a03_0": "【疏】問妄語論趣人重餘輕者凡欲顯招名利人趣是長發言誑彼彼多信奉故制與重餘趣不爾報別非解縱有潤微故但輕罪。",
    "X39n0714_002:0793a06_0": "妄中初解人重二義釋文上二句明招利義偏在人中故云長也發下即信奉義人多識別非人邪謟畜類愚癡故餘下簡非畜言非解者反信奉故言潤微者反名利故。",
    "X39n0714_002:0793a10_0": "【疏】有人解云道之修成會在人趣容有修成剋在己用今故誑他自敗其志失利處深豈不制重餘道不爾反前故輕天趣雖勝不能修善又報得通心誑無信義但制輕罪。",
    "X39n0714_002:0793a14_0": "修道解中初文亦二先敘人重以真實聖道自他並有修成之義若用誑人反成兩損自敗是損己無正信故失利即損他令虗解故餘下簡二趣上二句通簡非畜言反前者皆障道故天下別簡天趣二義釋之通心謂他心通言通有二聖人修道得天鬼業報得。",
    "X39n0714_002:0793a20_0": "【疏】問天得通心誑無信義得輕罪者將佛以例誑佛應輕。",
    "X39n0714_002:0793a22_0": "釋難中佛具神通誑亦無信合同天趣不當重輕。",
    "X39n0714_002:0793a23_0": "【疏】答天是異趣不信故輕佛雖無信佛亦無怖約制從人言了即結又且誑怖為義不取元情但使言了相現不問信與不信怖與不怖皆結正罪不同殺佛命不可斷無學同人義不待言。",
    "X39n0714_002:0793b03_0": "答中初約所誑釋以顯不同不信雖同準恐怖比丘戒怖佛亦提然佛無怖制罪同人可為今例又下次約能誑釋初正釋不同下簡異殺戒無學下例同羅漢準佛可知故云不待言也(有作待信非也)。",
    "X39n0714_002:0793b07_0": "【疏】五明自他始終門。",
    "X39n0714_002:0793b08_0": "第五標中即兩門合明。",
    "X39n0714_002:0793b09_0": "【疏】初明自他則有三例一自造他境二他造自境三自造自境三例既別須配四戒。",
    "X39n0714_002:0793b11_0": "【疏】婬約三例犯同一夷引文證成歷然可領。",
    "X39n0714_002:0793b12_0": "初門淫中初例可解次例即怨逼受樂三即律中長根輭脊自淫皆重令引證者上二出戒本後一見調部。",
    "X39n0714_002:0793b15_0": "【疏】盜三例者自盜他物得重不疑餘二無罪故不論也。",
    "X39n0714_002:0793b17_0": "盜中初科唯初例犯餘二無罪皆非盜故。",
    "X39n0714_002:0793b18_0": "【疏】若爾自盜言無罪者何故律中盜得己衣犯偷蘭邪答此是境差方便罪也前盜他物錯得己衣望他物不得結偷蘭也自得衣邊復有何罪故知自盜不成盜以無他境故自慳則成慳自物保惜故自施不成施自貪增自故可以例知。",
    "X39n0714_002:0793b23_0": "釋疑中初牒前伸難即律調部有比丘欲盜佗衣錯得己衣佛言犯蘭今言無罪違彼文故答中初定罪前下釋成故下例顯。",
    "X39n0714_002:0793c02_0": "【疏】殺三例者自殺他他殺自此二可解。",
    "X39n0714_002:0793c03_0": "殺中初科二例殺他夷重他殺無過。",
    "X39n0714_002:0793c04_0": "【疏】自殺自身如善生經無有罪失不起他想無瞋心故又十誦云頗有殺人不犯夷邪謂自殺也。",
    "X39n0714_002:0793c06_0": "第三中初科經據無瞋不結業故律約無戒不至果故。",
    "X39n0714_002:0793c08_0": "【疏】有人解云不立進趣自殺無罪以命斷時無戒可犯若依五分結前方便命斷偷蘭據此為言進趣義顯。",
    "X39n0714_002:0793c11_0": "引古中初文進趣方便本律則無五分則有自古章疏用舍不定是以此師進退兩判義鈔云四分不立進趣自殺夷蘭並無但得殺業不善道又云縱立進趣何咎雖有兩判今須準犯問進趣與近方便何異答如前已辨尋之可知。",
    "X39n0714_002:0793c16_0": "【疏】問如律自殺不死犯蘭此何罪邪答方便自殺緣差不成戒在故結若死有因同前進趣。",
    "X39n0714_002:0793c18_0": "次科問中文出調部欲定罪體故引為問答中初正答由不至死即是緣差若下簡異死同進趣頗見昔非。",
    "X39n0714_002:0794a03_0": "【疏】又以三例通諸下篇自打自謗自覆等戒至時引用成其說功。",
    "X39n0714_002:0794a05_0": "三中後篇不出故此總示又約隨有自他可歷者為言不必一槩打謗覆三戒並初例成犯第二不犯第三打謗無犯唯自覆自犯吉又如摩觸自觸他他觸自並殘自觸自吉麤語亦爾五分互向說亦犯殘故自語自應吉如是類通臨文自歷故云至時等。",
    "X39n0714_002:0794a11_0": "【疏】妄語三例可以意辨。",
    "X39n0714_002:0794a12_0": "妄戒上二可解自誑自吉以乖言說之儀故。",
    "X39n0714_002:0794a13_0": "【疏】次明始終所犯分齊初戒據始侵境即重不待情樂殺戒據終要唯命斷盜妄兩戒據中成犯財雖離地猶未得用妄雖言了未得名利如是準知。",
    "X39n0714_002:0794a16_0": "始終中初戒且據造他若約怨逼須論情樂纔樂即犯亦同於始盜妄據中者盜約正取為始得用為終故以離處為中妄以正說為始得利為終言了為中。",
    "X39n0714_002:0794a20_0": "【疏】六明心有剋漫。",
    "X39n0714_002:0794a21_0": "【疏】言其剋者本情專注唯在一境若言漫者通涉無準。",
    "X39n0714_002:0794a23_0": "第六示名中剋唯有一漫通大小剋即訓定漫猶遍也(準前生起剋漫在七述作隨時不必確定)。",
    "X39n0714_002:0794b01_0": "【疏】審名既定約婬為言犯無剋心同成極重何以明之但有染心將欲成犯初期在此而後會彼或男女境亂張王者別或人畜趣乖境心雙轉但使境交無非大重由出家所為斷愛為先今既反染違出家意所以隨境制通犯重。",
    "X39n0714_002:0794b06_0": "婬中初判犯何下釋成初句徵但下釋有二初敘制犯初四句通示染心將欲即起方便期此會彼即至果本或下別顯餘人非畜為境轉想疑名心轉或境心俱轉由下次出制意初敘出家本志今下次示制教所以。",
    "X39n0714_002:0794b11_0": "【疏】盜殺不爾雖有犯者猶自感聖不同前戒欲為障道所以邪舍是凡檀尼入聖升沈既異剋漫明分是故盜殺剋心相當方成重罪心境俱違但結方便。",
    "X39n0714_002:0794b14_0": "殺盜中初科為二初對簡又二初示異所以下引證耶舍即須提那子猶是內凡檀尼入聖緣如後引升下正立剋漫初二句躡前生起是下略示剋心以剋有重輕漫唯通犯但明剋異漫則可知。",
    "X39n0714_002:0794b18_0": "【疏】有人解云盜殺兩戒亦有作剋不成剋者如害怨命及壞怨財與餘人財同室難別放火燒時知財及人彼此同損以此義約雖剋同漫前言成者剋對財境可分者言。",
    "X39n0714_002:0794b22_0": "次科他解中初立義如下舉事顯相期心在怨理應是剋餘人同處還成於漫前下點前所立義是可分。",
    "X39n0714_002:0794c01_0": "【疏】如十誦中有官逐賊道逢比丘問見賊不有嫌示處死者犯重若唯瞋一餘賊因死瞋者犯重非瞋死蘭據此文證作剋成矣然犯蘭者殺緣不具故也。",
    "X39n0714_002:0794c04_0": "今義中初引誠量有嫌示處此明漫犯若唯瞋一即是剋心據下準文以決驗前同室怨重餘輕上二句正決下二句釋蘭所以緣不具者無殺心故。",
    "X39n0714_002:0794c07_0": "【疏】妄語戒者。",
    "X39n0714_002:0794c08_0": "【疏】有人解云本誑前人望招名利無心誑餘餘雖聞聖本非我境何得犯重如船濟處為人說法尼聽過暮則同不犯。",
    "X39n0714_002:0794c11_0": "妄戒他解中初立義如下舉例即下九十教尼至暮不犯中文正為之人同上所誑尼因預聽同上餘聞。",
    "X39n0714_002:0794c14_0": "【疏】今解不同說法遠嫌開為遮俗此是性罪不可通例若三趣俱現內知歷然犯無剋心通境隨犯三趣不現隨剋隨犯。",
    "X39n0714_002:0794c17_0": "今解中初斥非例若下立義妄語論剋不同殺盜但有多境則不成剋單對一境方成剋義如本期人畜現非犯。",
    "X39n0714_002:0794c20_0": "【疏】七明錯誤門。",
    "X39n0714_002:0794c21_0": "【疏】夫立錯誤義者並是不當本心之謂也逐事曲尋相則難分隨名剋定位容有別錯就現緣境差為義誤就不現緣境差心謬忘為義所以然者現緣二境相別顯然及至造趣事容舛錯即名眾境交涉為錯若論誤者心通前後不可雙緣如前心謂此後心謂彼心想謬忘故謂之誤。",
    "X39n0714_002:0795a03_0": "第七門釋名中初通示遂下別釋初略分上二句明隨事尋名名則有濫如下諸部互出不同隨下次明以名定事事則可分如文所示所下委釋初釋錯義若下釋誤義準文顯相不出境心論境有二一現不現別二多與少別心亦有二一忙亂迷謬二臨機前後如是尋之不更繁釋。",
    "X39n0714_002:0795a09_0": "【疏】既分兩相須配四戒。",
    "X39n0714_002:0795a10_0": "【疏】初之一戒無論錯誤患起內心通皆障道但是正道不問迷誤或此彼男女非畜諸境緣此謂彼誤亦犯重境雖交涉錯亦犯重。",
    "X39n0714_002:0795a13_0": "婬中初示不立但下顯犯初明誤犯境下明錯犯。",
    "X39n0714_002:0795a14_0": "【疏】語盜而言漫心無寄三趣有物皆欲盜奪為我所有及至往趣縱境差舛心有迷忘皆稱欲心錯誤齊重。",
    "X39n0714_002:0795a17_0": "盜戒大漫不論錯誤三趣隨犯。",
    "X39n0714_002:0795a18_0": "【疏】若先剋定要取人物不盜餘趣及往盜時境交想轉雖舉離處不成罪攝不稱本心猶屬本主以於此物元無盜心心境既非何過之有故錯與誤俱不名犯後知錯誤即應還主不還起盜後方成重。",
    "X39n0714_002:0795a22_0": "小漫中初示起心及下明造境初判非犯境交是錯想轉即誤若得人物犯重無疑若非畜物則開無犯不稱下次釋所以初句示心非言不稱者本期在人故猶下三句明境非屬本主者猶是非畜物故心等四句雙結後下明後犯前開離處後知起盜則非所開非畜蘭吉望盜云重。",
    "X39n0714_002:0795b04_0": "【疏】二對人趣辨錯誤者俱亦非犯如欲盜張忽得王物既非所期即是境差物非本物又是想差據此為異境不稱心後物無心心不當境故錯與誤並同不犯。",
    "X39n0714_002:0795b08_0": "對人中初標示如下顯相初示心境俱差據下明開犯所以初二句躡上境差據此為異者本期張人故境不稱者得王物故次二句躡上想差故下結示。",
    "X39n0714_002:0795b12_0": "【疏】三對同主辨錯誤者俱非犯也故善生云盜金得銀還置本處不得盜罪如律男想盜女物者犯據漫心也。",
    "X39n0714_002:0795b15_0": "同主中初通標故下引示得銀許還則知離處不即成犯知銀不還後心自結如下點異律文結夷似不開誤故須引決與上無違據漫心者謂小漫也前之三門初是漫心兼含大小後二剋心別開自他又前對異趣二對異人三約異物。",
    "X39n0714_002:0795b20_0": "【疏】論殺戒者漫無所寄三趣同害及至行事不稱初期雖有少乖不妨本有害意故使錯誤同成一重若論剋局但是一緣造趣行害相應成重若非本期則非殺境及往加害境則交涉或以迷忘非畜雖死不稱本期又無殺心錯誤不犯。",
    "X39n0714_002:0795c01_0": "殺中初科前明大漫同上無開若論下次明小漫而云剋者對大為言初明本趣成犯若非下明異趣俱開初示乖期及下明開犯交涉是錯迷忘即誤。",
    "X39n0714_002:0795c05_0": "【疏】二就人趣以論錯誤如剋心害張不欲害王現境歷然心緣亦別及以殺具害張之時而彼王人忽然與我刀輪相應王命雖斷由非心故錯則不犯若論其誤張去王來緣王張解加害者犯若望後王雖非本期以心不了緣此謂彼既人想不差殺緣具故雖誤犯重如上方便已為分別。",
    "X39n0714_002:0795c11_0": "次人趣正示中初總標如下別釋前釋開錯為三初明標心現下明對境張王並現故云歷然期意在張故云心別及下示錯相若論下次釋誤犯初文斷犯若下釋犯所以如下指廣即上卷境差方便中。",
    "X39n0714_002:0795c16_0": "【疏】問如上解釋誤重錯輕何故五分意欲殺彼而誤殺此犯偷蘭者又如僧祇多人同行欲害前人誤傷中後名不犯者。",
    "X39n0714_002:0795c19_0": "問中初二句領前何下引難五分僧祇並以誤輕與上相反故須通決。",
    "X39n0714_002:0795c21_0": "【疏】答此諸律名不足以定持犯取其事義可分錯誤何以明邪如上律云多人相逐害彼傷此豈非境交犯輕是其錯義又如僧祇弟子偷師衣誤得己衣不分與他半滿犯重此據境殊前後同制重者即誤義也。",
    "X39n0714_002:0796a02_0": "答中初指二律名濫何下約義定文初決上僧祇誤即是錯五分準同又下別引彼文證成誤重故知彼律雖皆名誤輕重自分彼云弟子共要偷師衣共分闇中誤偷白衣出外不分故是中半衣邊滿者波羅夷。",
    "X39n0714_002:0796a07_0": "【疏】論妄語業異趣通辨錯犯誤非漫心無簡錯誤隨犯。",
    "X39n0714_002:0796a09_0": "妄中初科上二句標次一句即小漫本欲誑人非畜境交錯亦隨犯前後差互境想開迷故誤非犯下二句明大漫。",
    "X39n0714_002:0796a12_0": "【疏】二對人趣錯誤俱犯由詐顯道德謀誑在人表聖招利境損義一但使言竟錯誤同重。",
    "X39n0714_002:0796a14_0": "次對人中亦即小漫準知大妄不開剋心。",
    "X39n0714_002:0796a15_0": "【疏】三就所稱凡聖二法心欲說聖口錯稱凡既非聖法前無所損故錯非重又如增慢迷凡說聖既非情過誤亦非重若就聖法明於錯誤如善見云錯說三四禪皆同一重。",
    "X39n0714_002:0796a19_0": "三中初總標心下別釋初明從聖稱凡文唯明錯誤亦應開又下明迷凡稱聖文舉增慢迷己所證常人迷語理準同開若論錯說不犯明開此不在言故所不出上約凡聖互論若下單就聖法以辨心雖錯誤說聖不殊故無差降。",
    "X39n0714_002:0796a24_0": "【疏】問盜戒定相得有錯誤何為妄語言了即結答盜相為言離處有損必不損主故有錯誤妄語不爾言了誑成故無錯誤又云物還本主心無惱故本無盜心錯誤不犯妄有心誑前境相應言聲一吐則無退悔故不同盜。",
    "X39n0714_002:0796b05_0": "問中前明對人剋心俱犯與盜不同又似即上錯說聖法比前盜戒同主俱開答中初約前境釋盜容後還故不損主妄令虗解無非欺誑又下次約本心釋盜本無心於事可解若據妄語本亦無心但望對境非無心故。",
    "X39n0714_002:0796b10_0": "【疏】八明教興門。",
    "X39n0714_002:0796b11_0": "【疏】原聖制戒本為止惡業之所興要唯三毒故十住云三三九種三煩惱生是也又成論云前行後三後行前七故制四戒為對此三對於貪故立前二戒瞋癡當分故立三四。",
    "X39n0714_002:0796b15_0": "第八正示中三初示制意惡通業惑止分近遠今明教本須對惑論業所興者推示業本三毒之言大小兩乘並通惑業業謂意地三業即瞥爾重緣以分相惑謂性中三妄即見思無明以為體良以無始結晴熏積日深觸境發情徧造諸業業雖無量不出三毒以為業本然佛制戒現止業非究其遠圖為清心惑是則深窮制意曲盡教源四重既然餘篇皆爾故下次引文證十住婆沙除業品文三三九種身口意為一三自作教他見作隨喜為二三(上六業道)現報生報後報為三三(此三苦道)三煩惱欲色無色三界繫(此三煩惱道)然則界繫即毒為體由毒起業由業感苦故云從三生也次引成論業道品彼問曰何故名為業道答意即是業於此中行故名業道(此中即指十惡謂心該徧也)先行後三中(先發貪瞋癡)後行前七中(後形身口七支十惡中七支在前三心居後故此分之)此明意思先起三毒後至七業則顯七業發自三心故下三分戒配毒以彰教意。",
    "X39n0714_002:0796c08_0": "【疏】問毒發成業勢分相似有何義故雙隻對異。",
    "X39n0714_002:0796c09_0": "初問躡上分配難其不等。",
    "X39n0714_002:0796c10_0": "【疏】答貪心雖一境殊內外通須歷止故因立二瞋境亦二罪則有差癡慢誑境局唯在情故有殊也。",
    "X39n0714_002:0796c12_0": "答中初示前雙對內外即情非情然盜亦通人且就多分為言耳瞋下明後隻對初二句明瞋毒境亦二者內境易解外即草土掘壞犯提罪不同篇故無雙對據論掘壞未必由瞋但俗計有命譏責無慈故望損傷義同瞋殺故也次二句明癡毒非情無誑唯隻可知下一句結異。",
    "X39n0714_002:0796c18_0": "【疏】如律文云婆羅門問阿難汝世尊何故為諸比丘制增戒學答為調貪欲瞋癡令盡如此文證故知不疑。",
    "X39n0714_002:0796c21_0": "引證中即孔雀冠婆羅門請問阿難制戒之意初引問詞但云制戒不唯四重然種類所收皆歸根本雖明四戒即見諸篇下引答詞證前有據。",
    "X39n0714_002:0796c24_0": "【疏】問戒防業非不除性惑何故對此立戒殄邪答上以廣明可謂依因之所本也。",
    "X39n0714_002:0797a02_0": "次問戒學防業定慧除惑如上所對三學亂倫故致此問殄滅也答中指上文見初卷教興門及解開名義中依因本者遺教意如常所聞。",
    "X39n0714_002:0797a05_0": "【疏】問僧四對三尼八何對答前半同僧故無異釋後半枝條還同前判。",
    "X39n0714_002:0797a07_0": "第三問尼有八重前四同僧後四即摩觸八事覆重隨舉答中上指前四下明後四觸八及隨並是婬類同對貪毒覆是妄類即對癡慢故曰同前。",
    "X39n0714_002:0797a10_0": "【疏】九明先後出對治門。",
    "X39n0714_002:0797a11_0": "第九標中二義合為一門先後即制教次第對治即起行差別。",
    "X39n0714_002:0797a13_0": "【疏】所以先後次第者。",
    "X39n0714_002:0797a14_0": "【疏】有人言由愛染氣分無始故習喜懷犯故所以先明如是次第終於妄語如諸篇首漏失長衣妄語等類可以求也。",
    "X39n0714_002:0797a17_0": "初門人解中初科初句明現起婬心氣分謂勢力也次句明積劫熏習釋上氣分之盛發下喜數之由即下論云心心繫縛自可知矣餘之三戒次第漸稀故云如是等上正敘本篇如下舉餘篇為例。",
    "X39n0714_002:0797a21_0": "【疏】有人言對毒立戒貪既在初故婬第一。",
    "X39n0714_002:0797a22_0": "次釋同前配戒所說貪對二境內重外輕故盜居次。",
    "X39n0714_002:0797a24_0": "【疏】如僧祇中佛成道後五年冬分第五半月十二日中後一人半影為邪舍犯故制初戒則當此間十月二十七日也第二戒者六年冬分第二半月十日食後二人半影制則當此間九月十日也第三戒者同是六年冬分第三半月九日食前一人半影制則當此間九月二十四日也第四戒者同年冬分第四半月十三日食後三人半影制則當此間十月十三日也若如上制從犯次第文相甚明。",
    "X39n0714_002:0797b08_0": "引教中僧祇初引文彼宗戒本四重戒後各標時節四戒間年俱是冬分即八月十六至十二月十五共有八箇半月對數可見言人影者彼約人身量日中影以定早晚晨朝西影初長後短午後東影從短漸長即以人身為度計有幾影不及全半身者則步之以脚不及脚者即加之以指文中比對此方日月並疏家之言疑本是注若下示次第。",
    "X39n0714_002:0797b15_0": "【疏】又智論云婬法不惱眾生心心繫縛故為大罪律中初也。",
    "X39n0714_002:0797b17_0": "次智論中彼列十業殺惱眾生合標戒首婬無所惱不應在初故論釋之方知有以又云比丘之法今世取涅槃故準前僧祇約制緣次第智論據障道重輕兼前人解總為四釋僧祇從緣事雖的實不妨為表前後諸意故使緣發次第冥符。",
    "X39n0714_002:0797b22_0": "【疏】問同是出家法不異故有何三眾與僧不同解云下眾前五猶本俗戒後之五者出家增之。",
    "X39n0714_002:0797b24_0": "問答中初問沙彌十戒以殺戒居初式叉雖加六法還即十戒為體所以問詞通標三眾答中即約先五次十相由之義仍依前相故云後增非謂十戒道俗兩別應知增五為十並是出家增十為具俱成大戒。",
    "X39n0714_002:0797c05_0": "【疏】問戒法是通道俗無別何義次第二種不同。",
    "X39n0714_002:0797c06_0": "次問在家五八亦殺為初據俗本異欲彰二戒不同所以故發斯問。",
    "X39n0714_002:0797c08_0": "【疏】答出家所為要斷煩惱道分所障勿過於欲故婬在初俗不修道斷婬非分畜妻行福不妨世善或求慈行有懷殺害故偏制約以全斷故。",
    "X39n0714_002:0797c11_0": "答中大約道俗別修僧修智分俗修福分婬欲障智妨道故僧祇前標殺害傷慈損福故俗戒初列文中前明僧戒後明俗戒又二初明婬後或下次明殺先。",
    "X39n0714_002:0797c15_0": "【疏】若爾三眾智分應婬在初亦全斷故。",
    "X39n0714_002:0797c16_0": "難中三眾修智與僧無別不應立戒反同彼俗。",
    "X39n0714_002:0797c17_0": "【疏】有人解云人同方便行道少分似同而別。",
    "X39n0714_002:0797c18_0": "初釋上句明同俗五十兩戒竝具戒方便故下明異僧纔霑有願故云少分。",
    "X39n0714_002:0798a02_0": "【疏】有人言年小惑微婬惱未發不妨無慈故殺在初。",
    "X39n0714_002:0798a03_0": "次釋以沙彌七歲驅烏十四應法年在童稚故婬未發癡騃無知故多好殺翻名息慈亦由於此。",
    "X39n0714_002:0798a05_0": "【疏】有人言小學未通教非極制現所禁者從俗無過。",
    "X39n0714_002:0798a06_0": "三中心志蒙昧故云未通例同輕罪故非極制。",
    "X39n0714_002:0798a07_0": "【疏】言對治者對婬制學離染行不淨觀等對盜制學少欲知足行對殺制修慈悲愍物對妄制修實語行等。",
    "X39n0714_002:0798a10_0": "對治中次列四行翻破四過臨境觀緣以善奪惡故云對治離惡名止起治名作止作俱運即成雙持問持名奉戒須約制科心觀化教那得成持答心用雙持義通化制教行雙持唯局制教如上已辨何事猶疑若爾觀行屬化那云制學答制名乃通約罪可判文中或云觀者取其智照或言行者即是思心前後互舉隨召皆得。",
    "X39n0714_002:0798a17_0": "【疏】十明沙彌任運義門。",
    "X39n0714_002:0798a18_0": "第十標中謂沙彌時先作破重方便及後受具正作法時前事成遂三性冥犯故云任運此即前門教他之義三戒可犯婬非所論。",
    "X39n0714_002:0798a21_0": "【疏】言任運者謂自造惡方便未就後更造善由惡障福不得成就然經律中出相不定。",
    "X39n0714_002:0798a23_0": "汎明中且引經論通明造業初科前釋名義造善感惡即是任運障福不成者此中且約前惡強長立有任運故云障福至後正義自有別判然下示不定即如下引。",
    "X39n0714_002:0798b03_0": "【疏】有立無者如善生云先遣戮人信遲未至後受齋時信至即殺以戒力故不得殺罪以此文證知無任運。",
    "X39n0714_002:0798b06_0": "引示中初科上句標計如下引據善生初明起殺方便戮人即殺者後下明造善事成受齋即八戒以下結示。",
    "X39n0714_002:0798b09_0": "【疏】若如此者即善生云欲受戒者先止諸惡若不遮者不名得戒。",
    "X39n0714_002:0798b11_0": "難中還即彼經不應相違。",
    "X39n0714_002:0798b12_0": "【疏】解言此約貴人常勅殺戮義同惡戒以惡強時長後受齊者雖曰善戒時短弱故為惡所障故不得齊不同前段暫惡短弱不能遮齋以此而推惡強長者則有任運短者則無。",
    "X39n0714_002:0798b16_0": "釋中初義先釋通經意貴人謂國王大臣惡戒即屠獵者惡律儀戒不同下簡前所引以下準經雙立。",
    "X39n0714_002:0798b19_0": "【疏】問若惡律儀強長障戒者今善律儀形俱亦強何故斷善便失戒邪。",
    "X39n0714_002:0798b21_0": "轉難中斷善失戒四捨之一即生邪見遠捨三寶善惡翻對相違可知。",
    "X39n0714_002:0798b23_0": "【疏】答障戒不成已如上解生大邪見正是斷善與戒相違惡強善故依如成論善生經說受惡律儀即失善戒如薩婆多云善惡二戒互受捨得。",
    "X39n0714_002:0798c02_0": "答中初指前義生下釋來難初正釋上二句示斷善之相下二句明失戒所以私釋惡是順惑發必強盛是以先惡能禁後善後惡能斷前戒依下引證受惡失善者若義鈔中準心論四捨無惡戒捨不取上文彼云得形俱戒後雖受惡律儀必不失戒非斷善故故知斷善惡戒重輕自別今引取例於義不妨次引多論彼問曰善戒人作惡戒人何時捨善戒得惡戒答若一說言我即屠兒捨善戒第二三說即得惡戒又云隨時捨善即得惡戒又問惡戒自得從他受得答自誓便得以順生死隨心即得論中但明受惡捨善受善捨惡翻對亦同故云互也。",
    "X39n0714_002:0798c14_0": "【疏】今正依門明小學人任運義者。",
    "X39n0714_002:0798c15_0": "【疏】有人不立所以然者若沙彌時作罪成名吉羅若比丘時作罪成名波羅夷今則不爾本沙彌時教人往盜殺未離未命斷能教是沙彌未得究竟罪及受戒後彼所教人離處斷命我是比丘而未教人云何得重。",
    "X39n0714_002:0799a02_0": "正釋中初師立理初句標示所下引釋前明罪聚各異今下明因果俱差上明沙彌因不至果下明比丘事遂無因人同位隔故無有罪。",
    "X39n0714_002:0799a05_0": "【疏】何以知之佛言比丘教人殺者波羅夷今則不爾教時非比丘殺時非沙彌云何而得重事義是難乃可違理至於制教未聞驅擯之罪。",
    "X39n0714_002:0799a08_0": "引證中初引律文即出殺戒今下準文決事證上可知。",
    "X39n0714_002:0799a10_0": "【疏】有人言任運業成何得無罪然彼沙彌受佛戒已遣人行惡即於制教正是相違如何果成業推違理又如沙彌犯重障戒不發據此論業因果相由何得同戒行因後不受果。",
    "X39n0714_002:0799a14_0": "次解立義中初標所立然下次斥前解彼云違理未聞違制故翻前義責其非理又下引邊罪例難初舉難據下比例沙彌犯重障比丘戒明知業通於後那得造因而不至果何下再責同戒謂同一戒即知異戒各不相成。",
    "X39n0714_002:0799a19_0": "【疏】義立既圓須配四戒若沙彌時遣人盜殺稱己感聖後受具戒所遣業成三性之中任運而犯三波羅夷由彼異緣成我身口無作業故受戒未竟所教事成即是邊罪不感戒故若受戒欲竟所教事成則罪戒俱得以善惡二因勢力相資俱得成故。",
    "X39n0714_002:0799a24_0": "配戒中初標示若下分配有二初定成犯前明方便後下明至果在文備舉三重臨事同別不定言三性者若論受戒多是善心餘心不無故此通舉由下出犯所以假他身口故云異緣受下次簡感戒初明未竟謂三羯磨未至竟處事成犯吉此猶沙彌不在言限若下受事俱竟方成夷重即上所立任運之義二因者十戒為具因教人是重因。",
    "X39n0714_002:0799b07_0": "【疏】若準善生受齋惡止者彼以本無其戒故約遮制不同此也。",
    "X39n0714_002:0799b09_0": "簡異中如前引經不先遮惡則不得戒恐疑彼文故為點之本無戒者彼說受齋顯是俗士縱先五戒稀故不論言遮制者出經意也不同此者此有十戒少分法故。",
    "X39n0714_002:0799b13_0": "【疏】上明義訖今次釋文。",
    "X39n0714_002:0799b14_0": "【律】諸大德是四波羅夷法半月半月說戒經中來。",
    "X39n0714_002:0799b15_0": "【疏】初篇分二初有一行標章門也中列四戒釋章門也後已說者結章門也初名標者謂標舉一章總意略示眾情說之梗槩雖復略舉未顯名相故次第二羅列四戒成上標相故曰釋章標釋雖明恐生疑濫若非收解將何會通故末號曰結章門也此標釋結通于八章前一具解後七不述可例知也。",
    "X39n0714_002:0799b21_0": "就文釋中總分又二初略分言章門者後結章中云標釋結中罪四不別共為一章文分三故初名下次牒解初解標章示告也梗槩猶言大略雖下解釋章標下解結章恐生疑者準後釋云諸大德我已說等是正結章若比丘下除兩種疑不得共住等釋同住疑恐人不曉不共住是不住二種僧中故後犯亦爾等釋重犯疑恐謂後犯非重故須此結文方決前相故云若非等收即正結解對釋疑此下指通下篇。",
    "X39n0714_002:0799c06_0": "【疏】初標分四初云諸大德者將說戒相恐有異緣不了淨穢儀乖說聽故命章大告使思惟行撿也二是四棄法者此正提綱諸篇極法勿過此罪故云棄也三半月者示法是時非餘緣難也四戒經中來者明口所傳有承據也。",
    "X39n0714_002:0799c11_0": "釋標中初告眾行檢即戒相二示法經標梵號有翻為棄疏中直以花言釋之三彰時緣難謂八難餘緣四顯所據來謂從彼所出。",
    "X39n0714_002:0799c14_0": "【疏】次釋章門文有四戒不分自別。",
    "X39n0714_002:0799c15_0": "【律】初大婬戒。",
    "X39n0714_002:0799c16_0": "【疏】初婬戒者以義分之門則有四所謂制意釋名犯緣闕緣。",
    "X39n0714_002:0799c18_0": "【疏】就初制意則有通別。",
    "X39n0714_002:0800a01_0": "【疏】言通意者如上所引為止毒源又如多論有四義意一先作無罪得除憂悔二滅將來非法不起三決疑網四有十利。",
    "X39n0714_002:0800a04_0": "次釋章門婬戒制意中通意者義該諸戒不局婬故文中二意初止三毒指上教興又下次為四義初義如須提那最先犯已常懷憂悔由佛制戒知先無犯次義即立戒正意三決疑者以佛制戒得知輕重殘無殘可懺不可懺故四十利者如下戒緣廣釋餘制皆爾故云通也。",
    "X39n0714_002:0800a10_0": "【疏】二別意者婬欲性者體是惡法既能為作則生死苦增熾然不絕沈淪三有莫能出離障道中源勿過於此此過之甚何容不救是故大聖制戒防之意在斯也。",
    "X39n0714_002:0800a14_0": "別意中初示過體既下明結業則下明感報沈下彰所損此下明須制。",
    "X39n0714_002:0800a16_0": "【疏】二釋戒名。",
    "X39n0714_002:0800a17_0": "次釋名門相傳二名者必應古師所立用標戒首故此引之。",
    "X39n0714_002:0800a19_0": "【疏】言不淨行戒者愛染汙心名為不淨隨染境界汙淨戒品故名為行行即業也謂所防之罪戒者能治之行能所通舉故曰不淨行戒。",
    "X39n0714_002:0800a22_0": "不淨名中初科前釋所防即別名也不淨約心行據動身造作戒下釋能治即通名也能下雙合。",
    "X39n0714_002:0800a24_0": "【疏】所以舉此名者戒相寄緣託境以彰欲使觀過興厭修不淨觀離染行成則全正體純淨無染也。",
    "X39n0714_002:0800b02_0": "次科初句推問戒下顯意寄緣者通指心境託境者別召所防欲下一句即止持修下二句即作持則下明行成體淨功由於名。",
    "X39n0714_002:0800b05_0": "【疏】問瞋癡犯者不名不淨此標何邪答此之貪愛一能發業二能潤業牽生感果是黑黑業俱是不淨故以標名餘之瞋癡但能發業不能潤業降此一邊故沒名也故成論云但愛能令諸有相續邪見等中無如上義。",
    "X39n0714_002:0800b10_0": "初問意謂餘戒瞋癡成者如殺妄等同是毒染不立此名故徵此戒獨標所以答中初簡三毒重輕前明貪毒發謂能造新業潤謂滋長故業牽生謂引生諸趣感果謂成就異熟言黑黑者因黑果黑故云俱不淨不淨即黑之異名也俱舍云或有業黑黑異熟或有業白白異熟(上標下釋)諸不善業一向名黑染汙性故(謂因黑也)異熟亦黑不可意故(曰果黑也不可意即苦果)色界善業一向名白不雜惡故(即因白也欲界善業雜惡不名一向)異熟亦白是可意故(即果自也可意即樂果)據論黑黑通諸不善今取彼名別證貪業餘下次簡瞋癡犯者不標之意不兼潤義故云降一邊也故下引證愛即是貪諸有相續即前潤業牽生邪見是癡等字收瞋無如上義謂無潤也彼論問曰欲界繫煩惱一切能使欲有相續色無色界繫亦如是是事云何答如疏引問中通問一切答中唯推貪愛則知餘業不能相續論又云經中亦說慢因緣生亦慢後愛故瞋亦如是故知皆以愛故諸有相續。",
    "X39n0714_002:0800c03_0": "【疏】問若如此解不淨財食莫不由貪俱有二能應名不淨答所防諸惡無非不淨此之染過境偏鄙濁有識同弊若不顯過無由可離故前彰過舉不淨名餘之貪過於此猶輕故從別相以樹名也。",
    "X39n0714_002:0800c07_0": "次問即引提中諸財食戒比例為難答中初二句是縱貪愛同故此下是奪重輕別故初明婬重有識通語羣生弊謂耽著亦可訓惡謂識者惡之後明餘輕樹字上呼立也。",
    "X39n0714_002:0800c11_0": "【疏】又戒亦名非梵行也梵者天音唐言為淨淨者聖也出家所為求聖興行今汙淨戒退失聖法故云非梵行也此與前解言同義異文中自列。",
    "X39n0714_002:0800c14_0": "次非梵中初標名梵下釋義初示字訓經音義云梵言梵摩此云清淨轉云聖者約義訓也出有淨行是聖道故出下合名求聖者遠期道果也興行者近修三學也此下簡異前從過體此據退聖語濫義殊故特點示又復前名據戒本文此從律本律云若有比丘不樂梵行聽捨戒等。",
    "X39n0714_002:0800c20_0": "【疏】上來相傳師資如此今約經律云婬戒。",
    "X39n0714_002:0800c21_0": "今解中初指前二名今下示今所立。",
    "X39n0714_002:0800c22_0": "【疏】婬是耽滯專固為名故俗中婬字隨相以釋水邊[榣-木]者為邪咎過女邊[榣-木]者為邪私也故字兩列各有其義滯雨多者名為雨淫滯書多者名為書淫故皇甫士安讀書三年經時不識春秋乘馬不知牝牡即其證也故滯於色名為色婬即此婬者亦名為荒故書云內作色荒外作禽荒有一于此未或不亡又其證也。",
    "X39n0714_002:0801a05_0": "委釋中初略示耽滯謂染著無猒專固謂繫縛難捨前定字體[榣-木]字音婬又音由水邊為邪咎者謂為非過甚也尚書大禹謨云罔淫于樂注云淫過也女邊為邪私者謂耽女色也說文云私逸也故字從女[榣-木]聲也故下釋字義初釋水淫字隨事雖別義意頗同說文云久雨為淫晉書云皇甫謐字士安號玄晏先生讀書著述常患風疾猶手不釋卷至忘寢食時謂皇甫謐有書淫又類林云漢董仲舒少小耽學常下帷讀書弟子不見其面在家七年不窺後園(所謂不識春秋)乘馬三年不知牝牡(雌雄)此亦淫書之過度然經時乘馬等非士安事學者宜知故滯下釋女婬字初示正名即下引異名書即尚書五子歌第二章有六句上二句謂在宮室則惑女色出外則多遊獵注云迷亂曰荒文略中間二句酣酒嗜音峻宇雕牆(酣嗜皆謂無猒音即歌樂峻謂高大雕謂鏤飾酣尸甘反)下二句者謂上六事人君有一必亡其國況兼有乎今但引證荒字與淫義同。",
    "X39n0714_002:0801a22_0": "【疏】言此比丘性無正慧隨塵封附迷著深結名之為婬聖知非法制教防約依教起行無由可染故名為戒。",
    "X39n0714_002:0801b01_0": "貼釋中初句標機無慧是惑隨塵是業迷著是習聖下初句示教主制教為開迷起行令翻業無染使斷習。",
    "X39n0714_002:0801b04_0": "【疏】若作此解不律儀也何以知之既言婬戒盜戒明知非善法也然隨俗相語法不同西梵所傳前列其境後以心緣如鐘打佛禮之類也故使經律有斯例矣若據東夏先能後所故應號之為戒婬耳若謂婬戒從本從義也若謂戒婬從末從時也兩通俱得慎勿迷名。",
    "X39n0714_002:0801b10_0": "會通中初示名濫不律儀即惡律儀如屠獵受殺戒為行殺故又如外道雞狗等戒為修雞狗行然下會釋初明兩土語異上二句通標西下列釋前明西土境即是所心即是能如下指例鐘佛是所打禮並能又如波羅蜜翻彼岸到折埵理翻分四釋迦云仁能等此皆西竺風俗所尚今云婬戒義亦同之若據下次明此方反前可見若謂下會通無在一以教從彼出二以天音得正故云從本因過制教故云從義此方反上故云從末時俗所宜故云從時。",
    "X39n0714_002:0801b20_0": "【疏】三緣成犯相通別分之。",
    "X39n0714_002:0801b21_0": "【疏】言通緣者則徧諸戒一是比丘簡餘三眾雖同犯婬但吉羅故二制廣後以未制廣但違業行故三無重病以不自知無負心故。",
    "X39n0714_002:0801b24_0": "三具緣中通緣即前義門闕緣方便七種通緣中第一緣也初示通義一下列緣相初簡下位二簡最初三簡心迷律云顛狂心亂痛惱所纏此據自不了知是比丘者重病言通必須簡別負背也。",
    "X39n0714_002:0801c04_0": "【疏】言別緣者據事有二若自造境則有四緣一有正境三趣通論約報分二男則二處女則三處二內染心昏睡無心開不犯故三起方便四與境合若為怨逼緣亦具四一是正境二為怨逼三開境合四受樂犯。",
    "X39n0714_002:0801c09_0": "別緣中二初自造緣四種不出心境前二離明後二合辨三即心為境發四謂境與心會二中開睡者如調部比丘睡中想起女見於上淫已捨去及覺問佛佛言不犯是也若下怨逼緣以開境合約心明犯緣相有別所以兩立。",
    "X39n0714_002:0801c14_0": "【疏】四明闕緣亦有通別。",
    "X39n0714_002:0801c15_0": "【疏】言通闕者如前方便不成中說。",
    "X39n0714_002:0801c16_0": "四闕緣中通闕即指義門七緣問具緣止同第一闕緣通指七者必有所以尋文可見。",
    "X39n0714_002:0801c18_0": "【疏】言別闕者當戒為言一闕初緣非道道想及疑得二偷蘭闕境還立是正境界闕第二緣無染心者則無有犯謂入無記及明觀故闕第三緣未起方便威儀不破但犯吉羅若動身相則有次近二方便耳闕第四緣未與境合有二偷蘭從破容儀去至對境犯輕偷蘭對小眾悔從境交對毛分未侵便止心者得重偷蘭依大眾懺。",
    "X39n0714_002:0802a01_0": "別中初示別義一下列釋初即境差境想後二句非道如餘身分境還立者復造正道也二中無記開前自造如睡眠是明觀開後怨逼如蛇口火中等三四兩闕即三方便隨止之處闕不成犯三中初明犯遠未起方便謂未動身不妨心犯若下次明次近以顯所闕四中但犯次近闕不至果破容即動身小眾謂界外四人口和受懺大眾即界內五人已上作白懺止心語通境強疑心及善心息並如前說。",
    "X39n0714_002:0802a10_0": "【疏】諸篇方便其例大同唯罪重輕懺法差降並如羯磨疏鈔廣之。",
    "X39n0714_002:0802a12_0": "指通中言例同者謂闕義也罪重輕者殘通蘭吉下三皆吉懺法異者殘中二蘭次方便下品對一人悔近方便中品同前小眾餘篇吉罪悔法無別並下指廣疏鈔並明懺法疏見第四鈔在中卷。",
    "X39n0714_002:0802a16_0": "【疏】就消文中。",
    "X39n0714_002:0802a17_0": "次消文相。",
    "X39n0714_002:0802a18_0": "【疏】標舉戒名大婬婬名是一而有小大之殊如漏觸語同成婬行此就觸境有內外也在內則夷在外則殘也如尼兩觸夷蘭二結相可知也。",
    "X39n0714_002:0802a21_0": "釋名中初標示通別如下引戒顯相初明通濫此下明所簡內局三道外通一身下引尼例律制腋已下膝已上腕已後身分犯夷餘處犯蘭以尼內外俱重與僧不同然於外觸自分重輕頗同上義。",
    "X39n0714_002:0802b01_0": "【註】佛在毗舍離國時須提那子持信出家後還本村與其故二共行不淨諸比丘察知已言當於如來清淨法中於欲無欲能斷渴愛破壞巢窟除眾結縛愛盡涅槃云何乃作如是惡事以過白佛即集眾僧知時義合取自言已佛訶責云汝所為非非威儀非沙門非淨行非隨順行所不應為告諸比丘我無數方便說斷欲法越度愛結又說此欲如火如炬乃至如刀如戟如是訶已此為癡人多種有漏最初犯戒今當結戒集十句義一攝取於僧二令僧歡喜三令僧安樂四未信者令信五已信令增長六難調者調順七慚愧者安樂八斷現在有漏九斷未來有漏十正法久住諸戒例爾下並略之欲說戒者當如是說。",
    "X39n0714_002:0802b13_0": "【疏】就戒緣中大分為二從初至正法久住諸戒略之已來明結戒相以顯行法行雖成顯須有緣依故次欲說戒者當如是說辨說教相以成教益。",
    "X39n0714_002:0802b16_0": "戒緣初文敘前段中託緣制立故云結戒呵過立治名為行法對後說戒即是眾法行下明次段緣依即目說由說戒警行故為緣以行憑教故為依前制治過名行益後說弘傳名教益。",
    "X39n0714_002:0802b20_0": "【疏】就初行益文復有三從初至如是訶已來正明比丘不勝名利興漏造染壞其略教制戒緣起過狀已彰理須禁約故次第二此為癡人多種有漏已下明聖隨犯制廣補之使識相行護發起正業然則制戒豈唯止惡而已元為集生眾善護持人法故次第三集十句義下明若依教奉修必能廣興出道紹隆長世上來科約下戒並同若至彼文更不解也。",
    "X39n0714_002:0802c03_0": "初段分文中初云不勝名利者律序身子請佛制戒佛言未得利養過漏未起以初出世法化未通後漸弘廣信施充積因茲生過故知四事眾惡之源有智深思特須遠離毛繩截骨世喻昭然肉駱駝山昔緣顯矣請詳緣本宜用書紳敘下二段一一皆有躡前生起以文對注總意可見上下指略觀下諸戒並委出本緣略明呵制至於十利例皆不述今此所指但前兩科生起同耳。",
    "X39n0714_002:0802c11_0": "【疏】就前戒緣又三分之初佛在國明住處也二須提子者能犯人也三還本村者明犯相也如律結集中犯有戒相恐涉妄列必須三處審同所由若乖其本雖佛所說亦不依用故彼文云何處制因誰制何因故制如是諸戒例此三徵末代持律亦準三責如四廣說可以求之。",
    "X39n0714_002:0802c17_0": "緣起中初科初分文如下引示初敘本集意言三處者初即住處二三即目人犯為處故下次引彼文即五百結集中始自初戒終至眾學迦葉一一舉此三事為問波離隨問答之集成律藏末下明今準用四廣說如別所引律明四說正為末世辦定是非舉彼例此令依處判。",
    "X39n0714_002:0802c23_0": "【疏】就初住處毗舍離者多論云廣嚴城也。",
    "X39n0714_002:0802c24_0": "住處中云廣嚴城者廣謂土境之大嚴即風物之美昔波羅奈國王夫人生一肉團羞媿不已封之金函棄於江內有一道人見而取之後生一兒一女有大人相乃立為王子孫漸多三展其國故曰廣嚴。",
    "X39n0714_002:0803a05_0": "【疏】須提那者多云聚落主名也此云求得其子邪舍此翻為明如僧祇釋持信出家又見論云有財四十億深厭此財生毒害善便捨有為入無為故曰也。",
    "X39n0714_002:0803a08_0": "犯人中初示父名注云須提那子即子從父名西竺多爾翻為求得未詳何義其下出子名初翻名如下釋義初引僧祇釋彼云毗舍離城有長者子名曰耶舍信家非家捨家出家等又下引見論釋以其持信厭財捨家入道故云明也。",
    "X39n0714_002:0803a13_0": "【疏】三就犯緣中分二初還本村行不淨者是其犯相後諸比丘下明訶責相。",
    "X39n0714_002:0803a15_0": "【疏】就訶責中初明比丘後明佛者欲顯比丘同徒同住過犯先知故前列也如來三達知見常圓示同化儀位尊殊隔義無先知故在後列又解理越常情絕於鑽仰今為同徒所訶分當己位容可勵己剋意不為後明佛訶者玄軌之教出於高軌切磋之益義存我友亦彰比丘言無虗設互相敦崇用成同濟之道餘語略之下更不解。",
    "X39n0714_002:0803a22_0": "犯相呵意中初牒問欲下釋通又二初約察知前後釋三達等者明佛非不先知化物之相示同後知三達智論云過去未來現在此三種智通達無礙故又下次約勸誡前後釋初示聖意難測謂其堅不可鑽研其高不可仰視故云絕也(論語顏淵歎夫子云仰之彌高鑽之彌堅今用彼語)今下約義以求初敘比丘呵後下明佛呵玄軌即所制戒法高範即佛之所行切磋喻規諫短失(詩云如切如磋骨謂之切象謂之磋)此謂朋儔職在諫諭師長主乎教誨若不先呵直爾白佛顯同友無相成之義律緣世相法爾須然上約立教須後亦下次明彰前故後餘下略指上句略去餘說下句指後例同以下諸戒多有二呵大同此釋。",
    "X39n0714_002:0803b10_0": "【疏】就前又二初明訶辭後舉過達佛。",
    "X39n0714_002:0803b11_0": "【疏】初中於如來清淨法者略教法也略教法意總舉行體莫非喪苦集求滅道也言於欲無欲者思前貪境名之為欲察知妄起名無欲也言斷渴愛者思後重貪追境不捨如渴也觀如此渴非由境生但是自心如犬咬骨故能斷也此二集諦世結之因破壞巢窟者世結果也集因既傾苦果自滅故曰也除眾結縛者修道法也愛盡涅槃者證滅諦也乃作惡事者總結前辭以用訶也。",
    "X39n0714_002:0803b19_0": "弟子呵詞初釋總舉者總四諦故略教一偈半初一偈喪苦集後半偈求滅道言下釋別相別配四諦故文有五句初釋前二句上句始起貪境即五塵欲即五識下句相續貪二皆有出過對治二門欲愛是過無斷即治此中治法至要用意深思如何思邪因言得理以理觀念見念隨塵取塵為欲欲熾為愛諦觀欲愛所生所在然後可治此乃心行何由盡言聞而不思徒多何益世結者即三界繫破下釋第三句巢窟喻六道依正苦不假斷故云自滅經云苦若滅者即是因滅因滅故果滅是也除下釋第四句眾結總收業惑道法不出三學八正愛下釋第五句涅槃即眾結盡處所證空理乃下釋總結。",
    "X39n0714_002:0803c08_0": "【疏】二明舉過達佛者善見云不欲令佛獨譽於己薄賤犯者遣出清眾又亦不以惡法相鬬亂故正以依實舉罪請聖制戒禁防違失令法久住故。",
    "X39n0714_002:0803c11_0": "舉過中引論先出非意非為益己損他故正下示正意專在滅惡生善故。",
    "X39n0714_002:0803c13_0": "【疏】如來訶辭文又分二初明教主以法不得信舉輙即訶責恐生諍訟故親集僧問取其自言二佛訶已下方明其相。",
    "X39n0714_002:0803c16_0": "【疏】就初集僧多論五意一現佛不自專輙故二眾量結戒犯者心伏故三凡事眾和令法久住故四為肅將來倣佛成規眾量不專故五諸佛法爾於法有儀故。",
    "X39n0714_002:0803c20_0": "釋佛呵集僧中論約五義求佛本懷成濟弘遠不專一事故也。",
    "X39n0714_002:0803c22_0": "【疏】言知時義合者量機教也。",
    "X39n0714_002:0803c23_0": "次科總釋中知時是量機義合即量教。",
    "X39n0714_002:0803c24_0": "【疏】問如來明見知犯非虗有何義故不證他犯多論解云有四種過一不順諸佛常法二違自言治法三令眾生怖不安之相四逆說人過非大人體是以啇度故名為知所言時者多論解云要在比丘眾集時問二結廣時問反此不問。",
    "X39n0714_002:0804a05_0": "別釋知時中初立問徵意佛既先知不當取彼自言故多下次引論以釋初釋知字四過中初謂佛佛皆爾二謂如來於滅諍中制取自言三是安眾四現尊相所下次釋時字論解二義眾集即約人明時結廣即從教明時。",
    "X39n0714_002:0804a10_0": "【疏】雖復機起深應於時若訶責制戒不能滅惡生善亦不宜問以是次明知時義合若非此義不合故問如多論解以制戒故有四種益一先作無犯得除憂惱乃至第四十利功德如上說也。",
    "X39n0714_002:0804a14_0": "釋義合中初躡前若下正釋初敘非義以下明是義然制戒之義有總有別別即隨戒制意不同總則無非滅惡生善今釋義合且就總論合猶當也如下引證文見制意故略二三除憂止非決疑並滅惡義十利即生善義。",
    "X39n0714_002:0804a19_0": "【疏】光律師云知者藥病之差時者應機之趣義合修成契會為要大如上也。",
    "X39n0714_002:0804a21_0": "古解中差謂差別趣即趣向修成契會謂令他獲益語異意同故云如上。",
    "X39n0714_002:0804a23_0": "【疏】三取自言者如五分云五百金剛常隨侍衛若佛三問不如實答便杵碎頭以為七分情怖故答。",
    "X39n0714_002:0804b01_0": "三中金剛者即侍從力士手持金剛杵因以為名如涅槃中迦葉白佛世尊昔十五日僧布薩時有一童子不善修習身口意盜聽說戒密迹力士以金剛杵碎之如塵云何如來視諸眾生同於子想乃至佛言童子力士皆是化人非真實也為欲驅遣破戒毀謗正法一闡提故。",
    "X39n0714_002:0804b07_0": "【疏】次佛訶中總別分之。",
    "X39n0714_002:0804b08_0": "【疏】初總訶云汝所為非者縱放身心理違事惡故曰也非威儀者乖法式也非沙門者絕勝士也非淨行者業體穢也非隨順者違略起非豈順教者上來訶責通諸戒也。",
    "X39n0714_002:0804b12_0": "次釋呵相總呵中牒釋五句初中理違對心事惡對身三中勝士即目四果上下結示總意束五為三初四就造業二五約違教三據障道。",
    "X39n0714_002:0804b15_0": "【疏】次云告諸比丘說斷欲者止在此戒故名別訶舉法引喻文相極顯不復解也。",
    "X39n0714_002:0804b17_0": "別呵中初示別義舉下指文相注中無數方便等即舉法也如火炬等即引喻也。",
    "X39n0714_002:0804b19_0": "【疏】文言此為癡人下明舉過制戒也。",
    "X39n0714_002:0804b20_0": "【疏】多論問曰佛大慈悲兼無惡口云何記犯言癡人者答稱實言之非惡口也此縛凡夫具足愚癡又大慈悲訶責折伏如今師資教誡之相也。",
    "X39n0714_002:0804b23_0": "二明制教釋初句中初科論約二義以徵呵意一違慈心二有口過答亦有二初約稱實答上口過又下次約折伏答上慈心以佛有三不護故無惡口(身口意三無過可護)又折攝二門同為化物故非無慈。",
    "X39n0714_002:0804c03_0": "【疏】有人言但言其癡不舉貪恚以癡通故。",
    "X39n0714_002:0804c04_0": "釋偏舉中初科癡是貪瞋之本舉本則餘二皆收故言通也成論云癡為二本所以者何若人無癡則無貪瞋故。",
    "X39n0714_002:0804c07_0": "【疏】又解聖人制戒非唯止惡元為開道是本意也貪恚等惡與福分相違若論癡者體是無明正障於道故今訶責但舉其癡。",
    "X39n0714_002:0804c10_0": "二中初敘教本貪下二示偏意俗修福分道修知分今訶道人故偏舉耳。",
    "X39n0714_002:0804c12_0": "【疏】多種有漏者如婬所犯墮於地獄乃至人中依正惡報至時廣引故言多也。",
    "X39n0714_002:0804c14_0": "次句中言婬犯者示業因也據通諸戒且約婬論墮獄即總報乃下示別報文略餘報故云乃至今廣引者涅槃云以貪欲習故死入地獄畜生餓鬼從彼得出還為鳩鴿雞雀後得為人復受黃門二形無根等身習因滋長惡果無窮因增果倍非多何謂。",
    "X39n0714_002:0804c20_0": "【疏】最初犯戒者僧祇云邪舍劫初先甞地味通退欲著惡法由興。",
    "X39n0714_002:0804c22_0": "第三中引緣釋義彼云過去世時此界劫盡時諸眾生生光音天後世界成還從天降身有妙光神足自在有自然地味如天甘露有一輕躁貪欲眾生甞此地味即生著心展轉相倣皆競食之食已光滅退失神足等爾時輕躁眾生即耶舍是今日復於清淨僧中先起漏過。",
    "X39n0714_002:0805a04_0": "【疏】今當結戒者是廣教也就此制廣有五種意一定其廣略二教名體二廣教所禁不出遮性三託緣興廣不出三性四廣相所詮不出四相五制廣教意不出六位。",
    "X39n0714_002:0805a08_0": "第四分章初後皆約能詮餘並所詮二即簡過三是約緣四即顯行初兼二教餘局廣教。",
    "X39n0714_002:0805a10_0": "【疏】初廣略二教定其名體如上序初已為分別。",
    "X39n0714_002:0805a11_0": "釋中初科指略尋前可見。",
    "X39n0714_002:0805a12_0": "【疏】二明遮性者由惡緣境不可隨說以義收之大分為二。",
    "X39n0714_002:0805a14_0": "第二遮性總示中上明境廣別相難曉故下約義收總相從要故。",
    "X39n0714_002:0805a16_0": "【疏】言性惡者如十不善體是違理無論大聖制與不制若作違行感得苦果故言性惡是故如來制戒防約若不制者業結三塗不在人道何能修善故因過制從本惡以標名禁性惡故名為性戒。",
    "X39n0714_002:0805a20_0": "性戒中初釋性義性即是體違理之惡從心而起不由制有故云無論等是下合戒義初敘須制放下明立制於本業上復增制罪故云因制應知性戒之言即業制雙舉也。",
    "X39n0714_002:0805a24_0": "【疏】言遮惡者如伐斫草木墾掘土地威儀麤醜不光俗信聖未制前造作無罪由非正業無妨福善自制已後塵染更深妨亂修道招世譏謗故名遮也所言遮者能遮正道故言遮惡前之性惡能遮福故亦可此惡為教遮而生故名遮也。",
    "X39n0714_002:0805b05_0": "遮戒中初敘過明惡威儀麤者失自利故不光俗者失利他故聖下約制釋遮初示反前性惡自下明因制成犯塵染更深者多違犯故妨道招機亦即自他兩失所下轉釋名義有二遮正道者約過釋也教遮生者從制釋也。",
    "X39n0714_002:0805b10_0": "【疏】有人解云若論性戒捨罪以求福若論遮戒捨福以求道。",
    "X39n0714_002:0805b12_0": "古解中性戒障三塗苦近獲人天故云捨罪求福遮戒不專福善遠慕寂滅故云捨福求道此亦一往以判不妨遮性福道兼資。",
    "X39n0714_002:0805b15_0": "【疏】故智論云十善十惡名為舊戒五篇七聚名為客戒前十善惡不假制有若論篇聚必假聖制又涅槃云菩薩持性重戒與息世譏戒等無差別文廣如彼。",
    "X39n0714_002:0805b18_0": "引示中智論為二初示名縱佛未出輪王亦制由來恒有如主常在故名舊戒佛出方有法滅便無去住不定故云客戒或可以上望下合云主戒以下對上合云新戒文中互舉義必兩通問諸遮可爾七支性惡既是舊有何以五篇七聚俱名客戒答業雖舊有制是新加性涉二重遮唯一制故也前下次釋義配上舊客二名可見次涅槃中初引經文彼性重戒即目十善息世戒通命篇聚。",
    "X39n0714_002:0805c02_0": "【疏】明知篇聚制約世譏以義求之如初篇婬殺名性重也下篇所制名性輕也遮亦輕重所以自明。",
    "X39n0714_002:0805c04_0": "結顯中上二句通示廣教以下義判重輕遮亦輕重者二房媒嫁為遮重提等下篇為遮輕又復三篇迭望重輕可知。",
    "X39n0714_002:0805c07_0": "【疏】問遮性兩惡皆有二能一能違制一能妨道云何為遮但以草木由教而生名之為遮以性惡者亦教遮故。",
    "X39n0714_002:0805c10_0": "問中初牒二戒過齊二能即前釋遮中二義云下難得名不等此躡後義為難。",
    "X39n0714_002:0805c12_0": "【疏】答性罪三過一違理惡行二違佛廣制三能妨道業遮罪具二體非違理故名為遮。",
    "X39n0714_002:0805c14_0": "答中二過雖齊然今但約違理一義以定二名。",
    "X39n0714_002:0805c15_0": "【疏】如三千威儀四句辨之或有犯佛法罪非世界罪如制戒後畜財離衣等二是世界罪非佛法罪謂未制前行殺盜等三俱是者制廣教後犯婬欺等四俱非者未制廣前殺草木等。",
    "X39n0714_002:0806a01_0": "引證中四句可解佛法罪即佛制教也世界罪即違理業道也一三明業制單複二四論業道有無此中正用一三兩句證前遮性違理有無對文可見。",
    "X39n0714_002:0806a05_0": "【疏】以此義推未制廣前無問道俗以無教違隨作性惡但犯業行故經云是殺生是殺生報等此豈唯俗不攝道邪而出家犯重俗人者輕由有無作戒可違故又違略教是以律文最初犯戒明違略也如善生云二人同罪不受戒輕受戒者重違佛語故。",
    "X39n0714_002:0806a10_0": "義推中即準第二一句以明業道初明道俗同犯下引淨名證通兩眾而下次簡重輕不同此中乃據未制廣前若制廣後自可知故僧有受體略教可違故重於俗是下引證初引律本證上違略後引經文證上違體。",
    "X39n0714_002:0806a15_0": "【疏】三明廣緣必託三性。",
    "X39n0714_002:0806a16_0": "三託緣中教不孤起必假緣興隨戒別論緣相非一約義通攝不出三性故立此義統該篇聚。",
    "X39n0714_002:0806a18_0": "【疏】言託善緣以興教者如坐禪讀誦講導開悟必以正命居懷制伏煩惱此名善法方希名利邪命自居相雖是善反成貪毒壞心障道勿過於此是故大聖興教防之。",
    "X39n0714_002:0806a22_0": "善性中初標示如下顯相有二初敘過不受殘宿等因坐禪比丘為緣同誦戒以讀誦為緣乞衣過五六語教尼日暮及眾學中諸說法等並因講導為緣方下顯過相是下明制教此中但明遮戒若準鈔文慈心殺人互用三寶則通性戒。",
    "X39n0714_002:0806b03_0": "【疏】言不善緣以興教者如十惡等體是不善能廣三塗增惱障道故聖因過制教防之。",
    "X39n0714_002:0806b05_0": "不善中初標示如下示相又二初顯過故下明制。",
    "X39n0714_002:0806b06_0": "【疏】言託無記緣以興教者如草土等體雖無記數作不已外彰譏醜內增心亂故制防約作者犯墮。",
    "X39n0714_002:0806b08_0": "無記中分科同上緣雖無記犯是有記故結墮罪若準鈔云如比丘方坐高談虗論費時損業癡狂睡眠等即約能犯之心以明無記耳。",
    "X39n0714_002:0806b11_0": "【疏】問若如此者何故成論斷草木等名為無記答此對俗說無非佛制不礙福分無招惡業故名無記出家不爾現大人相若有作者與理相違招謗障道說為記業不妨就緣性是無記。",
    "X39n0714_002:0806b15_0": "釋疑中初問躡上犯墮引論為難出業相品答中初約對俗釋通論意無非字誤古本作由非惡業合作惡果出下次約違制釋前結犯問前云遮戒體非違理今此那云與理相違請為通之。",
    "X39n0714_002:0806b19_0": "【疏】四明教相所詮四字斯盡何者是邪謂犯不犯輕與重也若解四字通決無疑是則上品持律之最。",
    "X39n0714_002:0806b21_0": "四明所詮總示中初科前示詮相見翻能詮總六十卷所詮雖多指歸四字準有五字不犯二字合一事故若下結顯。",
    "X39n0714_002:0806b24_0": "【疏】故涅槃云善解一字名為律師有人解云即律字也律訓為法法謂軌模必約四字以定儀體豈不然邪何名為犯境緣具也。",
    "X39n0714_002:0806c03_0": "次科初引經文但云一字與上不同故須通會有下次引他釋一字是總四字為別總相通含非別不顯須從別論故云必約等。",
    "X39n0714_002:0806c06_0": "【疏】何名不犯起對治也何名為輕因果微也何名為重反上句也。",
    "X39n0714_002:0806c08_0": "牒解中境緣即通別兩緣對治謂通別二持輕重二字若望根條即初篇為重殘下為輕若約戒儀則初二為重提等為輕若五篇迭論則夷重吉輕中間三篇並通重輕。",
    "X39n0714_002:0806c12_0": "【疏】就此四意二門分之初列名解二以義分。",
    "X39n0714_002:0806c13_0": "【疏】就初犯持各有二義一者犯法二者犯行何名犯法作過緣具現違聖教如諸戒本斯犯法也有自壞行汙本所受名犯行也若與犯緣而未相應名為犯法與犯相應則名犯行如此重解極大繁矣。",
    "X39n0714_002:0806c17_0": "次科別分列名中初通標犯持持即不犯何下別釋又二初列示法行法即聖所制教行謂身口造作若下約已未以分如下結示此中據理合解四名前標犯持則通兩位下釋但解犯中二義須知四門並具法行法皆約教行並從人名義俱同故所不出。",
    "X39n0714_002:0807a05_0": "【疏】舉犯法明則有犯行不犯行也。",
    "X39n0714_002:0807a06_0": "次約義分犯法中初科犯法有犯行義見釋名有不犯行在下問答所以文中標而不釋。",
    "X39n0714_002:0807a08_0": "【疏】問與犯法相應如上廣引得有犯行云何犯法有不犯行。",
    "X39n0714_002:0807a10_0": "問中初牒前犯行比難不犯。",
    "X39n0714_002:0807a11_0": "【疏】答聖制戒本不欲順過依行正欲觀犯興厭離過奉行是故得明舉此犯法成不犯行若就犯行無不犯行者以具過緣何得非犯由善惡不俱故。",
    "X39n0714_002:0807a14_0": "答中又二初明犯法可具謂教相明犯意在成持即取成持以為不犯若下明犯行不具以犯不兼持業性異故。",
    "X39n0714_002:0807a17_0": "【疏】二明不犯法中亦有犯不犯行有三不犯法。",
    "X39n0714_002:0807a18_0": "不犯法總舉中三不犯法初約犯中有開說不犯後二約持明不犯二是止持三是作持。",
    "X39n0714_002:0807a20_0": "【疏】一開犯為不犯法非是純淨名為不犯以輕奪重不違本制名為不犯如大妄開戲笑婬摩開淨授離衣開念捨等若忘失念皆有小犯是名犯行當自攝持名不犯行。",
    "X39n0714_002:0807a24_0": "別釋初中又二初標簡如下示相婬摩開淨授者淨對淫戒律中怨逼三時無染授對摩觸律中若有所取與相觸不犯離衣念捨者律中明相未出若捨衣或心念捨或對首捨又如毀呰開慈救掘壞開不故觀軍開有緣之類言失念者非謂染著前事但遇此緣彌須謹護忘念即犯攝意成持故通二行。",
    "X39n0714_002:0807b07_0": "【疏】二起對治行明不犯法如諸戒對治依修成就則據不犯法起不犯行若於此法生情厭背懈怠不修即是託不犯法以成犯行。",
    "X39n0714_002:0807b10_0": "次科正明中初標示如下釋相即前四重各有治法即目此治為不犯法下約順違以分兩行。",
    "X39n0714_002:0807b12_0": "【疏】故涅槃云有四因緣事雖似善不得樂果為勝他故名利眷屬及以世報雖修行善非佛意故。",
    "X39n0714_002:0807b14_0": "引證中初標示為下列釋引此證上不修成犯。",
    "X39n0714_002:0807b15_0": "【疏】問戒又有言名譽利養持戒所得如何經中乃訶非善答深有旨也若為鈍根無由離惡且勸持戒徙惡從善故舉世樂以勸彼持如文是也若又樂福無心涉道非佛本意故又訶毀如上涅槃即戒本末戒淨有智慧便得第一道轉鈍為利豈不然乎依此修行不名為利是於二法立不犯行。",
    "X39n0714_002:0807b21_0": "問中引戒本偈並上經文呵歎相違故須通會答中分三初句總歎若下別釋初釋戒文徙猶改也世樂即名利生天若又下次出經意初正釋引戒本以合經文準知經局利根戒通利鈍利根捨福從道故云轉鈍非出離道故不為利是下三結示二法即以世樂對治為不犯法鈍對世樂立不犯行利就對治立不犯行是知世樂鈍者成持利者名犯。",
    "X39n0714_002:0807c05_0": "【疏】三明制不犯法以明二行如安居說恣並是聖制依教而行成不犯行反說不依即是犯行。",
    "X39n0714_002:0807c07_0": "三中標釋同前此中即約制作之法違順以分然上下義門文句交雜欲令易曉為圖括之。",
    "X39n0714_002:0807c13_0": "【疏】次將違順難易用條前法。",
    "X39n0714_002:0808a01_0": "【疏】若舉犯法以明犯行順犯法成違聖制意(佛說戒本但明犯相依相而行是順戒本聖制欲使違法)舉彼犯法明不犯行違犯法成順聖制意(文中雖列婬盜犯夷我不婬盜豈非違法)。",
    "X39n0714_002:0808a04_0": "違順中犯法為二初約作犯明犯行注中初示順法作犯之行與教合故聖下明違意戒本顯犯意在持故舉下次約止持明不犯行注中示上違法止持之行反犯相故不釋順意。",
    "X39n0714_002:0808a08_0": "【疏】二舉不犯法明二行者。",
    "X39n0714_002:0808a09_0": "【疏】先解開犯為不犯者舉此不犯法明犯行者順不犯法成違聖制意二不犯行者佛意乃至戲笑亦不許故此不犯法明不犯行違不犯法成順聖制意。",
    "X39n0714_002:0808a12_0": "不犯法中三位同前初中又二前明犯行即諸戒不犯文中或結小罪者則有犯行違順同前二中不犯行即約攝念現前不違小罪故。",
    "X39n0714_002:0808a15_0": "【疏】二就起對治行明犯不犯三就前制不犯法明犯不犯者順法即順意違法即違意並可解耳。",
    "X39n0714_002:0808a17_0": "次合明中前別列二位後合示違順由此二不犯法即是止作二持是故順則法意兩順違則法意俱違。",
    "X39n0714_002:0808a20_0": "【疏】上解違順次明難易初舉犯法以明不犯此行易成離重過故次舉不犯法明不犯行此行難成自非專至何由不犯如戲笑等可以情求。",
    "X39n0714_002:0808a23_0": "次難易中以順法持戒可有難易是以但明不犯行耳違法毀戒本非所論故無犯行文中初結前總標初下舉法別釋初明犯法易成可解次不犯法行難成者離輕過故。",
    "X39n0714_002:0808b03_0": "【疏】三明輕法生二行者或有輕法生輕行如具緣殺草木輕心卒爾作等或輕法生重行害心殺蟻子等。",
    "X39n0714_002:0808b05_0": "三輕中初總標或下別釋壞生殺畜同是提篇俱名輕法率爾害心業有輕重故分二行成論云害心殺蟻重慈心殺人是也。",
    "X39n0714_002:0808b08_0": "【疏】四就重法中生二行者具緣行四重三時無悔心是名重法生重行或本無方便後無隨喜事不得已此重法生輕行。",
    "X39n0714_002:0808b11_0": "四明重中標釋同上四重是重法三時具缺以明兩行不得已者如慈心殺父母互用佛僧之類已上四位前二法行並就制論後二不爾法依制罪輕重齊均行約業道重輕乃異。",
    "X39n0714_002:0808b15_0": "【疏】五明制廣意唯六位所謂深防限分約相示過心境內外各有通別所引如後。",
    "X39n0714_002:0808b17_0": "五明制廣標中六位各有通別五六二位文雖不出準前可說。",
    "X39n0714_002:0808b19_0": "【疏】初解深防。",
    "X39n0714_002:0808b20_0": "【疏】言通制者元聖制戒為止業因造業已來必由三毒無以卒制且約身口二業既清心自沈靜能見過本望其本意為防心也未了心性約相遣塵故制四重以為道體對四制餘並號深防恐犯四本制餘令護何以知然配篇種類可以知也。",
    "X39n0714_002:0808c01_0": "深防通中為二前明四重止得名防對下次明餘篇始彰深義初中又二初通示制意動心結業能感後果業即是因故云業因造下次明制教方便初敘業從心起無下明制外防內過本即三毒未下明依境立制毒心微細鈍士難知隨過禁制故云約相能清心本故云遣塵言道體者道無別體即本淨心心隨染緣與道相反故禁重惡還復本淨無漏聖道由此而生故云體也次餘聚中以下篇諸戒近防四重遠禁本心即深防義種類收戒如下殘中。",
    "X39n0714_002:0808c11_0": "【疏】有人別解約戒以明故云過犯未窮預加重約禁微防著故曰深防如觸尼臂犯夷等類亦易解也。",
    "X39n0714_002:0808c13_0": "釋別中初標他解約戒明者示別相也故下引示初釋名義如下舉戒顯相且明尼觸四戒俱爾又如用飲蟲水為防殺畜搏比丘防打之類。",
    "X39n0714_002:0808c16_0": "【疏】言限分者亦有通別。",
    "X39n0714_002:0808c17_0": "【疏】通為防心善惡之本緣想輒起無非我倒因之結業迷墜生死故隨限分還制其心故律本云心念作發心作皆名犯也。",
    "X39n0714_002:0809a02_0": "次明限分明通中謂教必被機機分大小教有淺深大教被於上根制其瞥念假宗被其中品但齊重緣有部則被下流須形身口隨其根器力分堪任故云限分此中且據本部假宗以明初句標示通防心者指一切戒也善下委釋為三初敘起業上三句明從心起業通善惡故兩舉之此中論犯唯明惡業熏習力故任緣而發了無從始故云輒也我倒即煩惱道因下明成業即業道迷下明受報即苦道二故隨下明立教三故律下引律證發心心念如上已釋。",
    "X39n0714_002:0809a12_0": "【疏】然有諸師不立此義戒約身口何處明心然身口具非感善惡終在思心判成業道如上持犯成就門說。",
    "X39n0714_002:0809a15_0": "斥異中初文自昔傳弘不分宗旨故執有部之義以難假宗然身下還用假宗反攻彼計指如前者以持犯成就三機差別即限分義故。",
    "X39n0714_002:0809a18_0": "【疏】如見論中若制心戒無得脫者據獨頭心上明心念據重緣心即是下凡限分制也。",
    "X39n0714_002:0809a20_0": "次科中見論文意但制身口順彼所執故須通之初牒論據下決通又二初釋通論文獨頭念即瞥爾也上下次示前律意是則假實兩分大小不濫矣。",
    "X39n0714_002:0809a24_0": "【疏】若就相論可有修學並是限分又如漏失僧殘尼墮限分之相於此彌彰故光律師云制為當機正存力分若未能行雖作無犯如斯等戒其例是也。",
    "X39n0714_002:0809b03_0": "明別中初三句約義總示言就相者即指戒條正彰別義又下舉相別顯又二初約報以明文中且約漏失顯異又如八事四獨言人紡績染心衣食之類尼限分也漏失二麤二房不定提舍之類僧限分也即僧尼不同戒如下隨篇所明故下次引古解就機以辨三根強弱不可一制故云存力分也無知之罪對根三別(上根即結中根五夏下根不結)四依百一二房畜長上士高逸不樂從聽下流志弱不能專制教既開聽故云作無犯也。",
    "X39n0714_002:0809b12_0": "【疏】三言約相有通制者心過難形以境分相諸篇聚者約相可求別歷約相如盜五錢度人問親之例故光師云過損理違道俗俱禁依王國法準俗制道也。",
    "X39n0714_002:0809b15_0": "約相中初標有下釋初明通相即篇聚所列一切諸戒條別顯然故總名相次明別相且舉盜戒如盜五盜四等律因盜人令出家故制問親並屬盜相故下引示亦且據盜餘則例然如淫則正道毛頭殺則讚歎教遣妄則凡法聖法下篇諸戒一一各辨思之可知。",
    "X39n0714_002:0809b21_0": "【疏】四示過者有戒斯是別相示過如戒緣中佛重出過婬如蛇口如火如刀酒大不善各有十過故光師云罪狀未興預彰過兆逆頒譏醜使耳目聞見等是也。",
    "X39n0714_002:0809c01_0": "示過中初標有下釋初句明通以一切戒並是過相律並呵云非威儀非淨行等下明別過且舉婬酒漏失戒云云何不淨手受人信施二房引龍鳥兩舌舉野干畜寶示四患等皆謂顯過相也佛重出者望前通呵故云重也淫中過相如文所列酒十過者一顏色惡二少力三眼視不明四現瞋恚相五壞業資生六增疾病七益鬪訟八無名稱九智慧少十命終墮三惡道各字恐誤合是略字以酒過多且明十故故下引古顯意無過先示故云逆頒頒合作斑問婬酒二戒過起方制那云罪狀未興答雖託前緣意絕後犯故知前為起教皆是最初望後當機故云未興耳。",
    "X39n0714_002:0809c13_0": "【疏】五心境者有戒斯是無有單心而犯戒者有人云如不學等可有境邪今解不然同此學境何得無邪故光師云緣無定據心相易流境有美惡心有濃淡或約心從境如婬酒戒或制境從心如盜殺等或以心境相應方始成業。",
    "X39n0714_002:0809c18_0": "心境中初明通義無單心犯者即如母論犯必託境關心成業心不孤起境無獨立未有一法不由心境故言通也下斥古解彼謂不學之罪起心即犯不待造境然不學有二初起斷心若頓若漸竝對前境又隨事無知別結不學亦即對境但於學境心有背耳故光師下次明別相初總示差別緣即是境四句隔對尋之可見或下別配戒相文列三句初句唯局淫酒二三兩句則通諸戒上二即境想後四句下一即是初句若爾此即是通何得云別答隨諸戒相句法不同如殺則人非人別盜約有主無主等是。",
    "X39n0714_002:0810a05_0": "【疏】六內外者犯不自成成由緣集因藉萬差要唯內外如情道等為內非情道等為外就情中食飲為內衣服為外如是例準。",
    "X39n0714_002:0810a08_0": "內外中標釋可解初明通者一切諸戒無出二境性戒竝情如七支等遮多非情掘地房酒等就下明別相衣食二種計是非情但隨身用故判屬情而約資用以分內外如三十九十別相可知(後二通別文中隱略約義分耳)六位中初二相對深防約教限分從機三四相對約相明篇聚重輕示過彰行業麤細五六相對五則心境合論六乃單明前境。",
    "X39n0714_002:0810a15_0": "【疏】注中集十句義下明結戒益義就此十句分二初有三利明此戒法生眾功德次有六利明生別人滅惡成善次有一利興建正法行也。",
    "X39n0714_002:0810a18_0": "三修奉益中即釋十利大聖立教利益無邊取其簡要且列十種標分為三戒為能利眾別興建即為所利。",
    "X39n0714_002:0810a21_0": "【疏】言攝取於僧者由制廣教能治別人七支等過故名為攝自行既立同和號僧也令僧歡喜者半月一說行淨無違故歡喜也令僧安樂者依教修成必感大果用以適神故也。",
    "X39n0714_002:0810b01_0": "僧利中初攝僧者制戒治別別聚名僧即是以戒攝別入僧次釋歡喜云半月者以說戒檢行淨穢兩明能令眾喜三釋安樂舉後聖果以顯因心適即是悅神即識心問與第二何異答喜謂現預淨僧樂乃後必剋果二利同就因論所對現當兩別。",
    "X39n0714_002:0810b06_0": "【疏】就別利中初有二利生善後四滅惡。",
    "X39n0714_002:0810b07_0": "【疏】未信令信者由制此戒威儀動人善見云諸未信者作如是言沙門釋子勤心精進難作能作等已信令增者謂先學戒見後來者生大信心云何是人盡形求法一食修道等。",
    "X39n0714_002:0810b11_0": "次釋別利生善中初釋未信約威儀者世多取相故能動人下引善見出彼信詞由觀外相而知內德故難作謂禁制情欲修苦行故次釋已信先學即是已信生大信者即是增長云何下亦出彼詞偏舉難事以彰可信問今始制戒那有先學戒者答先有略教禁三業故或可制後展轉相望而分先後上二生善初對在家故歎沙門次即出家故指先學。",
    "X39n0714_002:0810b19_0": "【疏】就滅惡中言難調者善見云破戒作惡心性剛強內無差恥故曰難調佛為制戒訶責治罸不得動轉改過悔伏故曰調順慚愧者清淨行者制戒治惡不入眾數布薩自恣清淨具足故曰安樂斷現漏者由不覆情隨塵起染若打若死斯現有漏制戒防止無上諸過故曰斷也斷未漏者若不陳悔生業無窮由依廣教洗心悔過盡形行學障於來惡故曰也。",
    "X39n0714_002:0810c02_0": "滅惡中初釋難調引論顯相文列三句上句身口業下二句意業三業不善則名難調佛下顯益七九治罸隨犯治之文中略舉呵責餘可準知次釋慚愧謂惡者折辱善人無惱故文舉說恣由此二法必取行淨若羯磨僧則通持毀三釋現漏言不覆者覆猶護也遭打橫死惡疾迍難皆為現報四斷未漏生業無窮者此通生後二報盡形行學者旦約上篇犯重為言餘篇悔法俱障來報義可知也此四滅惡前二止業並據治罸後二除報必約懺悔然止業除報正在治懺莫不皆由制戒而生故功推戒耳。",
    "X39n0714_002:0810c13_0": "【疏】三明興建正法者如見論云法住三種一學正法久住由人奉修三藏教法攝在己用即行所依故也二信正法久住者謂三藏中所說諸行十二頭陀威儀禪定是也三得道正法久住者由依教行得成四果及涅槃道後有此益並由制故。",
    "X39n0714_002:0810c18_0": "釋興建中引善見三相第一約教非學不解第二是行非信不行是以前二首標學信第三約果則明教行功不虗設。",
    "X39n0714_002:0810c21_0": "【疏】就此三相前後為言初教次行後明果也人多讀教少有依行以無信故如大論云信為道源功德母也若無信者雖入佛法都無所益以不依行無所得故若依教修必剋聖果即是制戒功德道興誠不虗設也。",
    "X39n0714_002:0811a02_0": "明次第中初正指次第人多下釋其所以初句明教少下示行大論即智論聖道從始故喻如源眾善由生故同於母若下明果三法相須一不可闕今時學教唯事講說身履非惡略無慚愧請詳祖訓少警內懷不爾則妄認祖宗實非苗裔矣。",
    "X39n0714_002:0811a10_0": "四分律含注戒本疏行宗記二上之二",
    "X39n0714_002:0811a12_0": "【疏】就釋戒本四種分別一釋名二定句多少三決通諸戒四配人犯相。",
    "X39n0714_002:0811a14_0": "次釋戒本。",
    "X39n0714_002:0811a15_0": "【疏】言釋名者何謂戒本由犯制戒戒為緣本也又約緣雖制文略未顯更以辨相廣張行體略為廣本又云即是半月說之所本所以文云欲說戒者當如是說餘同前卷。",
    "X39n0714_002:0811a19_0": "釋名中初標問由下釋通有三初約緣起釋又下次約廣解釋律敘緣起發後制戒後列廣相釋前戒文故約前後以彰本義即前五義中教本一義又云下三約說戒釋欲近取證故重舉耳道行聽三前已廣故略指之。",
    "X39n0714_002:0811a24_0": "【疏】二定句張縮為二。",
    "X39n0714_002:0811b01_0": "【疏】若依佛解分為九句初若比丘總舉受隨也二共比丘者離明受也三同戒者別明隨也四不還者體淨不捨也五戒羸者體微生厭也六不淨者明業過也七畜生者列犯境也八波羅夷者結罪名也九不共住者治罸法也。",
    "X39n0714_002:0811b06_0": "定句中初張分九句。",
    "X39n0714_002:0811b07_0": "【疏】二以義縮但有二意初之五句合之為一成比丘體有犯重義下之四句託緣分相若立略本四句收盡一是犯人二所託相三犯法成四結罪目。",
    "X39n0714_002:0811b10_0": "次義縮有二初縮為二言託緣者即上過境言分相者即上罪治若下次收為四初即總上五句二即第七犯境三即第六過業四即收前八九前後諸戒句數雖多不出此四故云略本上明張縮止就當戒更立此四該通一切。",
    "X39n0714_002:0811b15_0": "【疏】三決通諸戒者。",
    "X39n0714_002:0811b16_0": "【疏】初句比丘義該八篇文局上六眾學七滅單列持相然非比丘無由可犯故律眾學廣解辨相明比丘義但結集翻譯不欲繁文故略不出可以知也。",
    "X39n0714_002:0811b19_0": "決通中初句分二前總示通局眾學下別顯後二上二句示文無次二句顯義有故下準律廣解可驗文略故知西土梵本必具。",
    "X39n0714_002:0811b22_0": "【疏】第二第三共同兩句釋成得戒之人成初比丘之義通局雖別義該八篇文局初戒四五兩句文義俱同。",
    "X39n0714_002:0811c01_0": "次四句中前釋二三云通局者通謂初句總舉受隨局則二三各明受隨兼前釋後意顯通該次釋四五亦是文局義通故指同也。",
    "X39n0714_002:0811c04_0": "【疏】昔解云此戒愛染久習卒難捨離不障初果故開捨染殺盜不爾違損事大不開捨也。",
    "X39n0714_002:0811c06_0": "斥古中初文彼謂唯婬開捨四五二句不通餘戒初果見惑已破思惑全在雖起貪欲非婦不婬故在僧中欲心設起則捨戒還家故有欲飽還來之事故云不障初果也。",
    "X39n0714_002:0811c10_0": "【疏】今解不同強羸二捨義通諸戒文約婬法欲成極罪故須不捨之言如律云若犯波羅夷無覆開懺此則通也諸篇不明者略也。",
    "X39n0714_002:0811c13_0": "正解中初二句明義通文下示文局如下舉例無覆開懺六聚皆然豈得滯文不通餘聚故知不爾。",
    "X39n0714_002:0811c15_0": "【疏】又解此之四句並釋比丘具戒成犯初戒立法故有餘篇準式故無亦有道理智能解也。",
    "X39n0714_002:0811c17_0": "他解中初示初有餘無於義可見亦下歎美所解於義可取。",
    "X39n0714_002:0812a01_0": "【疏】六七兩句文義當戒所收。",
    "X39n0714_002:0812a02_0": "六七正明業境戒戒不同故文義兩局。",
    "X39n0714_002:0812a03_0": "【疏】八九二句義兼下篇文列初四以有微犯不應說戒則不同住同如棄者。",
    "X39n0714_002:0812a05_0": "八九中初示通局以下示義通。",
    "X39n0714_002:0812a06_0": "【疏】第四隨結。",
    "X39n0714_002:0812a07_0": "【疏】約人明之無制戒時事義足者既無後犯一結便足若文不具生疑託緣則更開結或約一緣或至七八如為女說法及別眾等戒。",
    "X39n0714_002:0812a10_0": "第四通明中初明制無頓足以機起不時故多重制既下明隨犯單重初明單結若下次明重結為女說法初制不得後開智男別眾戒初制不得次開病時施衣作衣道行船行大會沙門施等七緣凡七番再制文言七八且趣舉之尋戒本中無至八者。",
    "X39n0714_002:0812a16_0": "【疏】今約初戒一人隨結配句屬當則有三位第一第六八九四句則屬本制邪舍故也第二至五戒微故立第七畜生心迷故有律中廣相故不敘之。",
    "X39n0714_002:0812a19_0": "別明中初總舉一人隨結者謂因人則制此戒凡對三人前後異時則是各對一人耳文列三位屬當顯然指律廣相備見注文下疏自釋故不繁引。",
    "X39n0714_002:0812a22_0": "【律】若比丘。",
    "X39n0714_002:0812a23_0": "【疏】次就戒本。",
    "X39n0714_002:0812a24_0": "【疏】若比丘者如善見云若者總名不屬一人隨有佛法具戒之徒皆持犯法故云若也如世律令條別顯諸犯者不一之謂也。",
    "X39n0714_002:0812b03_0": "牒釋初句釋文中隨有佛法者此約處也具戒之徒即就人也犯法即指戒本依教守制故云持也如下舉俗律助顯。",
    "X39n0714_002:0812b06_0": "【註】佛言若比丘者。",
    "X39n0714_002:0812b07_0": "【疏】就注解中分三若比丘者標列釋由也名字已下總列眾名也是中者結定犯人也。",
    "X39n0714_002:0812b09_0": "釋注總分中謂上三字是標下列釋之由耳。",
    "X39n0714_002:0812b10_0": "【註】名字比丘相似比丘自稱比丘乞求比丘著割截衣比丘破結使比丘善來比丘受大戒白四如法成就得處所比丘。",
    "X39n0714_002:0812b13_0": "【疏】言名字比丘者善見云此是總名通邪正及未具也如請比丘以設檀會沙彌未具入比丘數是名字比丘也又如涅槃雖未受十戒亦得受請故知通名。",
    "X39n0714_002:0812b16_0": "列眾名中初文善見初示名通如下舉例又下引證。",
    "X39n0714_002:0812b18_0": "【疏】言相似者如善見云謂犯重者內實破戒威儀相貌似持戒者其實破戒故名也。",
    "X39n0714_002:0812b20_0": "【疏】言自稱者十誦云有賊住者剃髮披衣自言我是比丘也。",
    "X39n0714_002:0812b22_0": "【疏】言乞求者如善見云既出家已隨須衣食如法行乞以四海為家居離於邪命故曰求乞。",
    "X39n0714_002:0812b24_0": "四正釋中隨須行乞者示無盡法故四海為家無親疎故。",
    "X39n0714_002:0812c02_0": "【疏】如大論云邪命者略說有五初求利養改常威儀詐現異相二自說於己所有功德三強占吉凶四高聲現威令人畏敬五說自得利激動令施非此邪心得利活命故曰正命如八正中。",
    "X39n0714_002:0812c06_0": "次引示中五邪初是身業餘四口業身口現相心規他物故云邪命八正道中正命一種為離邪命故名正道餘皆可解。",
    "X39n0714_002:0812c09_0": "【疏】著割截衣者有二利故一毀全相離自貪故二既碎雜不為王賊之所剝故常得資身有長道故。",
    "X39n0714_002:0812c11_0": "【疏】破結使者修道進德惑盡解滿理解心明永無業惡即發具戒從緣而感故曰也。",
    "X39n0714_002:0812c13_0": "【疏】言善來者道成初果親感至聖金言命之便得具戒故曰也。",
    "X39n0714_002:0812c15_0": "【疏】受戒白四者即如今時感戒者也。",
    "X39n0714_002:0812c16_0": "總論八種前五約名相後三據受體又三中前二唯局聖白四通凡聖又上二中破結局四果善來局初果所以無三語者或是趣舉故文略之或是但據聖凡三位或可凡中三語已廢故所不出。",
    "X39n0714_002:0813a02_0": "【註】是中比丘者若受大戒白四如法成就得處所住比丘法中是比丘義也。",
    "X39n0714_002:0813a04_0": "【疏】次解第三是中比丘者明此婬戒犯重比丘也。",
    "X39n0714_002:0813a05_0": "【疏】有人云是中者總舉八種也若受大戒者別標定也前列八種或有名濫如沙彌外道雖名比丘不犯夷也或有相濫似割截等或時行濫如乞求破結等或言說濫如自稱也或時體濫如善來羯磨也上列諸位不必犯重或時少分或復全非皆非共比丘義所以結中偏牒第八釋成戒本若比丘也。",
    "X39n0714_002:0813a11_0": "次科簡人中他解初文又三初點文前下釋總別所以行濫中乞求未必具戒破結據是體濫然有破結不發戒者如白衣羅漢之例上下結合少分如行體全非如名相等。",
    "X39n0714_002:0813a15_0": "【疏】所以然者上八所列但明三受自餘五種相因而立若欲犯戒終約受體破結一受乃是無學善來初果聖無犯法皆不同也今約比丘學戒唯羯磨受是末代法故牒解之。",
    "X39n0714_002:0813a19_0": "顯意中初簡非受破下次簡餘二受。",
    "X39n0714_002:0813a20_0": "【疏】此中須引刪補羯磨末代戒緣具足五種廣分別說緣成得戒緣差不發既是大事無宜輕削。",
    "X39n0714_002:0813a22_0": "囑援引中初指文五種者一能受人二所對境三發心乞戒四心境相當五事成究竟既下正勸結文。",
    "X39n0714_002:0813b01_0": "【疏】次解結文。",
    "X39n0714_002:0813b02_0": "【疏】若受大戒簡沙彌也白四如法者羯磨成就緣也言白四者簡非羯磨受者即如破結善來之徒也言如法者除七非法成前如相也得處所者僧數滿足結界成就緣也住比丘法者簡定俗人外道也或雖比丘心住無記病緣等障不守本性者則不住比丘法也是比丘義者則是戒本犯法犯行比丘義也。",
    "X39n0714_002:0813b08_0": "牒釋中五節初約位簡二約法簡三約人界簡四約眾簡文中又二一對俗簡二約緣簡上四簡濫第五顯是。",
    "X39n0714_002:0813b11_0": "【律】共比丘。",
    "X39n0714_002:0813b12_0": "【疏】共比丘者明犯重也受戒法儀共餘比丘則無別也所以出者若所受體同可有犯重體或不同則無有犯故有此同釋諸疑網也。",
    "X39n0714_002:0813b15_0": "次句中初文為二初正釋所下示出意。",
    "X39n0714_002:0813b16_0": "【註】佛言若共餘比丘受大戒白四羯磨乃至住比丘法中者是謂共比丘義也。",
    "X39n0714_002:0813b18_0": "【疏】注中若共餘比丘者謂釋迦一化現未兩時三天下內所有僧尼白四受者同有犯也若緣差互少一非受雖復犯過不名夷重以不共戒無戒可犯也。",
    "X39n0714_002:0813b21_0": "釋注中初釋同義釋迦等者舉一佛所化簡餘佛故現未約竪論現即佛在未則滅後通於像末盡六萬年也三天下據橫說且就一往不被北洲故僧尼位別羯磨受同故通舉之若下次釋不同即本受不得者緣差互者且論能所能即受者身帶遮難無心乞受衣鉢不具等所對雖多然亦不出人法事處四法有乖準此而言本受緣非無犯明矣。",
    "X39n0714_002:0813c05_0": "【律】同戒。",
    "X39n0714_002:0813c06_0": "【疏】言同戒者佛所制戒隨行通行但受無隨亦無戒護故雖犯違法不同也。",
    "X39n0714_002:0813c08_0": "第三句中初文依體起持故名隨行一化齊奉故曰通行無戒護者此謂受時不起持意納體不得亦非同戒如後問答。",
    "X39n0714_002:0813c11_0": "【註】佛言我為諸弟子結此戒已寧死不犯是中共餘比丘一戒同戒等戒是名同戒義也。",
    "X39n0714_002:0813c13_0": "【疏】注中釋之不過教行我為結戒教法同也寧死不犯行法同也今隨教行兩釋其相。",
    "X39n0714_002:0813c15_0": "【疏】先就教者如佛制教數雖極多咸明止惡名為一戒對人共學名為同戒莫不數齊名為等戒如十誦云同入比丘學法者百歲比丘與初受者同初受戒者與百歲者同又同心同戒同說波羅提木叉故。",
    "X39n0714_002:0813c19_0": "釋注中就教分二初釋止惡為一戒者戒雖無量止惡不異故對人為同者三乘俱稟故數齊名等者皆納具足故如下引證前明新舊同者標示同戒又下別舉三同釋成同相同心收見利二和同戒即戒和同說攝身口意三和。",
    "X39n0714_002:0813c24_0": "【疏】次就行解隨體無殊名為一戒對人興治持義不異名為同戒齊防塵沙名為等戒。",
    "X39n0714_002:0814a02_0": "就行中奉持萬別皆名隨行故為一也後二同前約行為別。",
    "X39n0714_002:0814a04_0": "【疏】問斯之隨行據初受言後行乖願可非犯者。",
    "X39n0714_002:0814a05_0": "問中指上所解並據初受行淨可有同義後乖有犯即不名同。",
    "X39n0714_002:0814a07_0": "【疏】答此句來者釋成願行有感戒也前列共者明同受願也後列同者明同隨行也若受戒時且論受願無思學行則但虗願不感戒也。",
    "X39n0714_002:0814a10_0": "答中初明立句本意若下次明二戒相須。",
    "X39n0714_002:0814a11_0": "【疏】故涅槃云是人唯具作戒不具無作戒戒不具足如薩婆多無淳重心不發無作。",
    "X39n0714_002:0814a13_0": "引證中經論二文並證初受無心持奉不發戒體不同無犯文據甚明。",
    "X39n0714_002:0814a15_0": "【疏】故律明此恐人濫犯文列同戒願行相投白四受後犯非則重空願無行後雖行非無戒可違不入犯法也。",
    "X39n0714_002:0814a18_0": "結意中初標示律意即指戒文也準知發體則有戒可違不發則無法可犯。",
    "X39n0714_002:0814a20_0": "【律】若不還戒。",
    "X39n0714_002:0814a21_0": "【疏】言不還戒者釋疑故也後戒羸者自生疑念前制犯重心樂道法有戒可違今我於佛生厭不樂為有戒在同前犯重為無有戒無重可犯故今佛釋若不樂者聽捨還家後欲修行得度得受。",
    "X39n0714_002:0814b01_0": "第四釋文中初科上二句標示後下委釋初敘疑後戒羸者即欲犯過人戒力微劣也故下釋疑若據戒文但標不捨注中乃以捨戒反釋。",
    "X39n0714_002:0814b04_0": "【疏】所以開者凡夫退位知何不為帶戒犯非業則難拔故開捨戒往來無障即是大聖善達機緣任物垂教號法王也。",
    "X39n0714_002:0814b07_0": "次科初敘機劣內凡已上不羸不捨已前皆容有退故云退位即外凡也故下顯開意往謂開捨來謂再受善惡兩通故云無障即下結歎權巧王者得其自在於法自在故稱法王。",
    "X39n0714_002:0814b11_0": "【疏】增一云僧伽摩比丘七反降魔後更受戒得成羅漢自今捨戒聽齊七反若過非法十誦云尼若捨戒轉為男者亦得出家。",
    "X39n0714_002:0814b14_0": "三中初引比丘開限降魔不免破戒故先捨之極齊七反已外不開開中制也次引十誦明尼不開轉根方得反知不轉即障出家又伽論中尼捨再受即成賊住是也。",
    "X39n0714_002:0814b18_0": "【註】佛言若有比丘不樂梵行聽捨戒還家復欲出家於佛法中修梵行者應度出家得受大戒云何不名捨戒若自顛狂心亂痛惱瘂聾又向如是人前及中邊人等互捨不成若戲若眠若無知人若自不語若前人不解並不成捨若言我捨佛捨法捨僧和尚戒律我受家法等是名捨戒也。",
    "X39n0714_002:0814b24_0": "【疏】注中云何不名捨戒下分二初自顛狂下心境不了雖捨不成若言捨佛下對境彰成文相可解。",
    "X39n0714_002:0814c02_0": "注文前段即敘佛開上科已示故從云何下分其文耳。",
    "X39n0714_002:0814c04_0": "【疏】就捨戒中義分四門一汎列經論捨相不同二漸頓異三捨善已未四具捨緣。",
    "X39n0714_002:0814c06_0": "【疏】言汎列者如雜心說若捨命終斷善二形生也善生經加受惡戒時捨善戒俱舍論八戒期心盡夜分終故捨且列如此。",
    "X39n0714_002:0814c09_0": "捨戒中初科若準注文但明作法統括諸文則有六種故云汎列雜心四捨言若捨者即作法斷善即起邪見善生惡戒即惡律儀上五通五八十具俱舍期心唯局八戒義兼五戒言且列者示未盡故。",
    "X39n0714_002:0814c14_0": "【疏】二漸頓者即作法捨中如律我作沙彌五戒等是漸也我作白衣外道等為頓也。",
    "X39n0714_002:0814c16_0": "漸頓中初標簡如下列示隨有退墮漸頓並開。",
    "X39n0714_002:0814c17_0": "【疏】三明捨善已未者問今捨戒者為捨已生隨行為因之業為捨初願本受無作體邪答已生為因不可捨也得聖無漏方傾善習今所捨者止是本體更不相續故雜心云言捨戒者戒身種類滅也。",
    "X39n0714_002:0814c21_0": "三中初標科善謂隨中二持之行未捨之前所有持行名已生善後未修者名未生善今明捨戒為捨何者問中乃約行願兩審答文方見已未存亡答中初答因業不失結業在心行功不滅故不可捨及證初果無漏智力達罪福性漏業方傾(習合作集謂集因也)今下次明無作體失本體即無作不相續者失未生善也故下引證戒身即受體無作種類即相續善行二皆云滅證上可知。",
    "X39n0714_002:0815a05_0": "【疏】四明具緣明捨有五。",
    "X39n0714_002:0815a06_0": "四中戒假緣成還從緣謝受捨各五相反可尋。",
    "X39n0714_002:0815a07_0": "【疏】初體是比丘住自性者。",
    "X39n0714_002:0815a08_0": "初云住自性者即具本受體也。",
    "X39n0714_002:0815a09_0": "【疏】二所對人境如多論云若無出家人隨得白衣外道相解者成。",
    "X39n0714_002:0815a11_0": "二明所對開教從緩不必本眾。",
    "X39n0714_002:0815a12_0": "【疏】三有捨心謂有欣猒心作捨心決定心住自性心久思心歡喜心自有心寂靜心反上八心則不成捨。",
    "X39n0714_002:0815a14_0": "三中八心注云意欲在家念父母等又云不樂梵行猒比丘法即忻俗猒道作捨心謂欲棄捨也決定者非進退也住自性者自知是比丘非狂亂也久思者非朝夕也歡喜者無所悔也自有非他逼也寂靜者心專一也。",
    "X39n0714_002:0815a19_0": "【疏】四心境相當如律中邊不領前人不解並不成捨。",
    "X39n0714_002:0815a20_0": "四中指律即如注引。",
    "X39n0714_002:0815a21_0": "【疏】五一說便成多云受捨相對理宜相準何故難易不同者答相違對故一求增上法如上高山多緣多力捨戒退道如高墜下故不須多二不生前惱若制緣多便言佛多緣惱受須多人捨何須也三受如入海採寶捨如失財王賊水火須臾蕩盡四受容預心捨對境情逼喜帶戒行非一語開成捨尚不依行況多緣也。",
    "X39n0714_002:0815b04_0": "五中初標緣多下引示初引問受捨緣相難易可知且取作法受須白四捨唯一說答中初句通答善惡天別故云相違立法難易故云對也一下別顯四義相對初三約喻二約立教四就機宜。",
    "X39n0714_002:0815b08_0": "【律】戒羸不自悔。",
    "X39n0714_002:0815b09_0": "【疏】言戒羸者對前強不捨此明羸不捨也謂樂俗緣園田家業便於佛道生毀生惱持戒力劣名之為羸若犯則棄由體不捨對前強弱同戒解有戒成犯重也。",
    "X39n0714_002:0815b13_0": "第五句釋文中初牒示強不捨者謂非愁憂思念也謂下釋相初釋羸義若下顯立所以。",
    "X39n0714_002:0815b15_0": "【註】佛言云何戒羸不捨戒若有比丘常懷愁憂不樂梵行厭比丘法意欲在家便言我念父母婦兒親里村落城邑園田家業我欲捨佛乃至學事等是也若作是思我今捨戒是戒羸而捨也。",
    "X39n0714_002:0815b19_0": "【疏】注解中前明戒羸不捨相若作是思下後明戒羸而捨相文中可解耳。",
    "X39n0714_002:0815b21_0": "釋注中前明不捨正釋本文後明捨相反釋不捨。",
    "X39n0714_002:0815b22_0": "【律】犯不淨行。",
    "X39n0714_002:0815b23_0": "【疏】六明不淨行者正明戒本所防過也。",
    "X39n0714_002:0815b24_0": "【註】佛言是婬欲法也男則二道女則三道若從道入道從道入非道從非道入道若限齊若盡入乃至入如毛頭者皆波羅夷。",
    "X39n0714_002:0815c03_0": "【疏】下注解中約報分相文易見也道入非道前後境差也限齊以下釋行犯相生疑故也毛頭之相極微故犯何況餘者。",
    "X39n0714_002:0815c06_0": "六中釋注有三初釋犯境男女是約報二道三道即分相次釋境差三釋限齊配注釋之。",
    "X39n0714_002:0815c08_0": "【律】乃至共畜生。",
    "X39n0714_002:0815c09_0": "【疏】七言乃至共畜生者舉犯境也多論云畜生是六道之邊偏舉下類以況上故云乃至也。",
    "X39n0714_002:0815c11_0": "第七文中初點示多下引釋六道邊者彼云最在邊鄙故。",
    "X39n0714_002:0815c13_0": "【註】佛言可得行婬處者是也有三種行婬人非人畜生趣復有五種婦童女二形黃門男子比丘婬心向前境三處二處初入便犯有隔亦犯若向睡眠若死未壞若多未壞於三處二處行婬初入便犯如是廣說若比丘為怨家將至前所強持令入三處二處始入覺樂犯不樂不犯有隔無隔亦同上若為怨家強捉比丘行不淨行覺樂不樂有隔無隔亦如上也。",
    "X39n0714_002:0816a02_0": "【疏】注云所可行處者謂婬戒言畜舉可行者為言殺戒言畜據有命者成犯通塞相也。",
    "X39n0714_002:0816a04_0": "釋注可行中初科舉戒對顯通塞通謂殺境塞謂淫境犯相各異故須簡之。",
    "X39n0714_002:0816a06_0": "【疏】然趣有六位半兼善惡皆據心行三種善惡故善門明趣初天次人後修羅也惡門明趣地獄為初次鬼後畜也。",
    "X39n0714_002:0816a09_0": "通明中初科上句通舉次句總攝三善三惡故云半兼皆下通示因相又二初攝六種歸於二門故下次就二門各分次第。",
    "X39n0714_002:0816a12_0": "【疏】天以受福自然無貪所感修羅受福懷疑於見非正也地獄所受非貪多由貪故受苦丸漿之類是也餓鬼所以情惱蓋由瞋毒所興也畜生愚騃受形蓋是癡心所結大分次第不爽業緣也。",
    "X39n0714_002:0816a16_0": "次科初歷示五趣天受福者示果相也無貪感者出因相也以行上品十善故文缺人趣下四因果臨文分對大途為言且據三品十善配三善道修羅下品心懷猶預故云非正三毒配三惡道如文自分地獄非貪謂所受苦事非可愛故大下總結本因觀此善惡無非心行故諸學者當好制心報應無差有逾影響自非大智熟能究之。",
    "X39n0714_002:0816a23_0": "【疏】經中所明四惡趣者皆非受道之器故以脩羅屬之。",
    "X39n0714_002:0816b01_0": "引經中通指諸經上以脩羅攝在善門有云四惡故引決之皆非等者出經意也屬之謂攝屬惡趣也。",
    "X39n0714_002:0816b04_0": "【疏】注中有三種下明成犯相初列趣境二比丘婬心向前境下明自身造境也三為怨家將至下明非自心外難所逼也。",
    "X39n0714_002:0816b07_0": "釋成犯相列趣可解。",
    "X39n0714_002:0816b08_0": "【疏】初文又二前列三趣後五種下約趣明報也。",
    "X39n0714_002:0816b09_0": "【疏】就中三種行婬即人非畜也。",
    "X39n0714_002:0816b10_0": "【疏】所以律合三趣論開六道者。",
    "X39n0714_002:0816b11_0": "離合中初問以六趣中人畜各位餘四或合通號非人故言論開者亦且通指今據智論云復次善惡故有六道善中有上中下故有三善道惡中有上中下故有三惡道也(十善十惡各分三品)。",
    "X39n0714_002:0816b15_0": "【疏】論據善惡故分律據通用故合。",
    "X39n0714_002:0816b16_0": "答中初文善惡即業報通用謂神通。",
    "X39n0714_002:0816b17_0": "【疏】故律人畜不異由來解釋非人乃云鬼也若論此戒但說非人天等不列可非犯也然下律中天子阿修羅子餓鬼子地獄無文義是鬼攝此之四趣通用是齊故合為一非人趣也。",
    "X39n0714_002:0816b21_0": "次科指律廣解上明人畜同諸經論故云不異由來下釋非人示其偏局若下點當戒義含然下引後文以證即同宿戒及受戒問難中彼云非人難者謂八部鬼神天子等如文所引而不出地獄故云無文義同餓鬼故攝鬼趣此下結成上文合之所以。",
    "X39n0714_002:0816c03_0": "【疏】二復有五下明以五報分三離分三趣有十五種是所犯境也。",
    "X39n0714_002:0816c05_0": "明報中五報離分三趣者謂以婦女形黃男子別歷人非人畜故有十五若開非人則有三十。",
    "X39n0714_002:0816c07_0": "【疏】就自趣境初約覺境以明犯相二若向睡眠已下舉後三境以對覺境同成犯相。",
    "X39n0714_002:0816c09_0": "自造中三境並不覺境對覺境者此戒四境齊犯又四境中上二生境下二死境。",
    "X39n0714_002:0816c11_0": "【疏】就後怨逼復分二緣前明怨捉將向前境後明怨捉就身行犯。",
    "X39n0714_002:0816c13_0": "怨逼中由開身合故約心論。",
    "X39n0714_002:0816c14_0": "【疏】問所以自身造境但明侵境不問其心後怨家逼乃問樂者答適化無方意在無逸若俱禁者事難當行怨但逼身心唯佛制故開境合無樂不犯文相可解。",
    "X39n0714_002:0816c18_0": "問詞躡前兩判欲彰開意答中初敘制必須開以大聖設教不定一端故曰無方禁即是制謂若唯一制不濟機緣故曰難常怨下明開中復制。",
    "X39n0714_002:0817a03_0": "【律】是比丘波羅夷。",
    "X39n0714_002:0817a04_0": "【疏】是比丘波羅夷者引人依法科也。",
    "X39n0714_002:0817a05_0": "第八釋文中引人即是比丘法科即波羅夷。",
    "X39n0714_002:0817a06_0": "【註】佛言譬如斷人頭不可復起比丘亦如是犯此法者不復成比丘故名也。",
    "X39n0714_002:0817a08_0": "【疏】就注解中分二初釋罪名後方便欲行下釋成不相。",
    "X39n0714_002:0817a10_0": "【疏】就初所以將罪以況斷頭者過之重也如俗極刑勿過大辟謂斬首也約刑制戒兩以通之故鈔引云如人有頭受諸塵也若不毀重能有見諦反此毀壞永不能見故以類也。",
    "X39n0714_002:0817a14_0": "釋注罪名中初文前明舉喻所以如下引俗刑比釋準俗制道事義相類故云兩通故下引示即標宗篇引婆沙文人之頭首具納六塵戒法亦爾能通諸法故以比之故彼論云戒名為頭能見苦諦等色聞名身等義嗅覺意花嘗出離三菩提味覺禪定解脫等觸知色陰等法廣如鈔記委釋。",
    "X39n0714_002:0817a20_0": "【疏】人又解云犯二篇罪可有上起若犯初篇如人頭斷不可復起縱有開懺障於地獄然於僧用則無成法故文云若作法已僧說戒時來與不來皆無犯矣。",
    "X39n0714_002:0817a23_0": "他解中即以初二兩篇對顯喻意二篇有餘懺已復本如人被斫殘有咽喉初篇永弃眾不容受故如斷頭不可復活故下引律證成無用僧無別眾故云無犯。",
    "X39n0714_002:0817b03_0": "【註】若方便欲行不淨成者波羅夷不成者偷蘭遮若教比丘行若作教者偷蘭遮不作突吉羅除比丘比丘尼餘眾相教作不作盡突吉羅若屍半壞若一切壞若骨間若地孔泥孔行不淨者並偷蘭若道作道想若疑若非道想並波羅夷若非道道想道疑並偷蘭遮比丘尼波羅夷式叉摩那沙彌沙彌尼突吉羅滅擯是謂為犯不犯者若睡眠無所覺知不受樂一切無有婬意不犯者最初未制戒癡狂心亂痛惱所纏。",
    "X39n0714_002:0817b12_0": "【疏】二若方便行不淨下成犯相中文分為二初明成犯相後明不犯者開犯法也初人分二初明比丘犯相後明四眾犯相諸戒同爾下更不解就前分二前明自作教他成犯相二屍壞已下境想相對成犯相就前又二初自作明輕重二教比丘行下教作明輕重文可解耳。",
    "X39n0714_002:0817b18_0": "犯相中總分凡四重初約法簡二就人分三心境不同四自他兩異一一對注分節文句。",
    "X39n0714_002:0817b20_0": "【疏】問死屍半壞行染何罪答有二緣若唯重婬意入便偷蘭縱出不淨不犯僧殘若欲喜樂意者如十誦五分乃至骨間出不淨殘不出止蘭此是大婬戒不就僧殘結以不作出意故。",
    "X39n0714_002:0817b24_0": "隨釋中初科問何罪者若據注中明結偷蘭由兼殘境欲分兩犯故發是問答中初句總示若下別釋又二初約心分相此下結示今犯。",
    "X39n0714_002:0817c03_0": "【疏】就境想中前之三句本境為言後之兩句境差想也。",
    "X39n0714_002:0817c05_0": "境想中分句前三皆重不開迷故後二並輕由境非故。",
    "X39n0714_002:0817c07_0": "【疏】義門分之廣如事鈔今略出之。",
    "X39n0714_002:0817c08_0": "【疏】初明制意若無境想不可定罪輕重。",
    "X39n0714_002:0817c09_0": "義門中制意以心有是非境有錯誤婬酒前三句重後二句輕餘戒初句相應故重後四句乖差故輕。",
    "X39n0714_002:0817c12_0": "【疏】二明有無者準律約戒不必具有今解無者是略也無別所以。",
    "X39n0714_002:0817c14_0": "次門正釋中據律戒本二十六戒具出境想句餘並不出故須辨之。",
    "X39n0714_002:0817c16_0": "【疏】有人云一切過境皆重則無境想如漏失者今解不然境雖通犯染起由心如律調部精出約心明有無想即輕重也故知無者但是略耳。",
    "X39n0714_002:0818a01_0": "斥非中初引彼解以漏失戒內色外色水風空等皆是犯境隨境犯殘不須簡辨故無句法今下正斥初立理如下引據彼云非道想不疑殘則明漏失文略不出非理無也。",
    "X39n0714_002:0818a05_0": "【疏】三定四五句者。",
    "X39n0714_002:0818a06_0": "三中以律中列句四五不定且如初篇婬殺妄三戒並五句盜戒四句殺五句者一人作人想夷二人作人疑蘭三人非人想蘭四非人人想蘭五非人非人疑蘭盜四句者一有主有主想夷二有主有主疑蘭三無主有主想蘭四無主無主疑蘭餘如鈔記具引但由第三一句結罪有無故句法不定如殺戒人非人想轉想蘭本迷吉(以作非人殺故)盜戒無第三句者以有主無主想想轉亦蘭本迷無罪(以無主物非罪緣故)若準鈔中則約本迷轉想對明今此一門唯約本迷罪之有無於義易解。",
    "X39n0714_002:0818a16_0": "【疏】若輕重相望境是可學生不可學迷同是五句如覆重謂輕等。",
    "X39n0714_002:0818a18_0": "輕重中迷重為輕如人作非畜殺有主作非畜盜等皆緣罪境定有第三句故同五句覆重者即覆麤戒律出四句今約罪緣入五句中謂覆藏初二兩篇麤罪犯提迷夷作提迷殘謂吉覆則犯吉此雖本迷不妨結犯律中不出謂一向無罪而覆藏者。",
    "X39n0714_002:0818a24_0": "【疏】若犯不犯相形則四則五謂前後俱迷非緣罪境即定四句除第三位如處分想無主想等迷雖是定而緣罪境即定五句如非道想非人想減五想等。",
    "X39n0714_002:0818b03_0": "犯不犯中初標舉謂下別釋初明定四處分律出五句今望本迷無罪故入四中無主想者律無此句迷雖下次明定五此即總放輕重二位減五想者此謂盜戒若作無主則是四句若盜滿五迷為減五亦隨結犯故入五句如前或將本四入五如覆麤是或以本五為四如處分是意顯隨義不定不必依文。",
    "X39n0714_002:0818b10_0": "【疏】四互四五者由是可學生不可學迷即互輕重。",
    "X39n0714_002:0818b11_0": "【疏】或從四以至五如實無主體唯四句後轉為主即為五也。",
    "X39n0714_002:0818b13_0": "四中初文從四至五者即約前心本迷後心轉入罪境故。",
    "X39n0714_002:0818b15_0": "【疏】若緣罪境人非人想即五句也若本緣人轉想當杌約從後心則唯四句前心謂人偷蘭罪者屬於方便想差所攝。",
    "X39n0714_002:0818b18_0": "次科亦合標云從五至四謂本是心境相當後轉緣非罪境故云轉想當杌即人作杌木想前心下簡前蘭罪。",
    "X39n0714_002:0818b21_0": "【疏】五輕重者。",
    "X39n0714_002:0818b22_0": "【疏】如文次第前疑重後疑輕以境是異輕本境故前想重結本方便心境相當故後想輕以正犯時有心無境。",
    "X39n0714_002:0818c01_0": "五中初文前釋兩疑後釋兩想制教同罪心業重輕故分兩異前疑重下準鈔應云以本緣人人境不捨臨殺有半緣人心故後疑雙闕故輕後二想中有心無境者闕本境也。",
    "X39n0714_002:0818c05_0": "【疏】又就本境中疑重想輕以疑半心不捨本境故重想則捨本從異故輕就後異境想重疑輕以想緣本但是境差故重以疑減半緣於異境故輕。",
    "X39n0714_002:0818c08_0": "次科初明本境二句次明異境二句疑減半者以疑猶豫半涉是非是於異境復減半心故輕於想。",
    "X39n0714_002:0818c10_0": "【疏】此判輕重據本重異輕為言若本輕異重例之即是如殺非畜人為異境可以例諸。",
    "X39n0714_002:0818c12_0": "三中初立義如下顯相又如非道漏失道為異境等是也。",
    "X39n0714_002:0818c14_0": "【疏】言不犯者。",
    "X39n0714_002:0818c15_0": "【疏】先總解不犯相有五一作事無違說不犯如癡狂等二說犯為不犯如最初人違略起非無廣可犯三說不犯為不犯如律一切無婬意正念攝心故四開前禁後說不犯如怨逼想五當戒別開說不犯如文睡眠無覺故。",
    "X39n0714_002:0819a02_0": "不犯中初科注列五種疏以五意從後倒釋初釋後二即是通緣後釋前三即是別緣第四即釋不受樂句開前謂許身合禁後謂制心樂。",
    "X39n0714_002:0819a05_0": "【疏】又開大位難別通三。",
    "X39n0714_002:0819a06_0": "次科總舉難別通者即上五開大分三位不樂無意命難故開睡眠不覺當戒別開最初癡狂諸篇通開。",
    "X39n0714_002:0819a09_0": "【疏】初言難者命梵二也。",
    "X39n0714_002:0819a10_0": "【疏】梵行難者夷殘二位也恐犯此故已下開之餘之三篇有不開者或是性惡或由事重或以重奪輕故不開之有開反前可以例也。",
    "X39n0714_002:0819a13_0": "釋梵難中夷殘二位標行體也已下開者為護行也餘下簡辨所開有差別也文列三句初句簡性戒小妄毀兩殺打飲用之類下二句簡遮事重如掘壞背別非殘之類以重奪輕者如牙角針筒過量坐具等雖事是輕須加重制故有開反前者亦有三句或是遮惡如輒教尼同坐同行乘船等遮機過故或事是輕離衣奪衣餘語二敷兜羅綿等以輕遮重共女宿藏衣鉢非時入聚等為防婬盜故。",
    "X39n0714_002:0819a22_0": "【疏】言命難者恐被奪命故不名犯婬開境合教制約心盜雖無文約義許有既不損境暫移後還不作永意何過之有殺妄兩戒罪成無改故並不開。",
    "X39n0714_002:0819b01_0": "命難中上二篇中唯開婬戒初示難相婬下次簡四戒初準文開婬二約義通盜三明不開殺妄。",
    "X39n0714_002:0819b03_0": "【疏】二別開者諸戒中各有別相故其開通類例不一如婬開睡盜開親等。",
    "X39n0714_002:0819b05_0": "別開中初敘諸戒相別即就別緣各明開義故不一也如下略舉二戒盜開親者謂親厚意取又如殺開瓦石誤著妄開增慢戲笑等。",
    "X39n0714_002:0819b08_0": "【疏】三通開者如文最初者約初作人有略可犯故言初也未制戒者舉時節也初犯無過何等之時未制廣前故不說犯言癡狂者以不憶識是比丘故此通諸戒。",
    "X39n0714_002:0819b12_0": "通開中前釋最初開未制也次釋癡狂開無心也。",
    "X39n0714_002:0819b13_0": "【疏】就前別開言睡眠者開怨來逼無所覺故不受樂者開前怨家將向前境禁無染故一切無有婬意者開身造境既無有心亦無境故。",
    "X39n0714_002:0819b16_0": "覆釋中三種並約怨逼釋之言怨有二如王大臣惡賊持刀陵逼是名強怨若親里故二愛染纏擾名軟怨睡眠開者強軟俱開無樂無心唯開強逼雖無文判準理合然無心無境者雖與境合攝念當前必無染著故云無境。",
    "X39n0714_002:0819b21_0": "【律】不共住。",
    "X39n0714_002:0819b22_0": "【疏】九言不共住者治擯名也。",
    "X39n0714_002:0819b23_0": "九中釋文云治擯名者若犯夷重滅擯永弃故不共住。",
    "X39n0714_002:0819c01_0": "【註】佛言有二共住同一羯磨同一說戒不得於此二事中住故名不共住也。",
    "X39n0714_002:0819c03_0": "【疏】注解中初列兩同後反釋之此律解中但明法不同住如十誦中財法兩種俱不同也。",
    "X39n0714_002:0819c05_0": "釋注中初科上二句點注文同羯磨者眾法同也同說戒者自行同也持奉無瑕方應說戒故此下會釋本律二同並據法說法既加擯義不同財但無顯文故引十誦耳。",
    "X39n0714_002:0819c09_0": "【疏】如多論中四解一既壞道法無所住用擯出眾外生天龍鬼神信敬心故二現佛法無愛無憎清淨者共住不淨者擯出眾故三為息外道誹謗故四為持戒者得安樂住增善根故又肅將來欲犯戒者生慚愧心不犯惡故。",
    "X39n0714_002:0819c14_0": "次科論中四義求佛擯意初與四並生善益內外分之二表彰法勝三滅惡益若不除惡必遭外毀。",
    "X39n0714_002:0819c16_0": "【疏】此戒是初故繁解釋自此說文多約略也。",
    "X39n0714_002:0819c17_0": "顯繁意中上二句示當戒下二句點後諸戒。",
    "X39n0714_002:0819c18_0": "【律】二大盜戒。",
    "X39n0714_002:0819c19_0": "【疏】二明大盜戒。",
    "X39n0714_002:0819c20_0": "盜戒對不滿五故云大盜。",
    "X39n0714_002:0819c21_0": "【疏】前就內色起貪此就外財生染並由貪惑纏縛故犯形於次第。",
    "X39n0714_002:0819c23_0": "敘次中初明約境分異並下次明就心是同故下正顯列次謂境異須分心同故並內重外輕故有前後內色即有情形謂相形比義。",
    "X39n0714_002:0820a02_0": "【疏】就戒四意。",
    "X39n0714_002:0820a03_0": "【疏】言制意者資財形命之本非此不濟人情保重戀著處深然出家之士理須捨己所珍以濟於物今反侵奪以自擁。",
    "X39n0714_002:0820a05_1": "己自壞惱他過中之甚是以聖制意在於此。",
    "X39n0714_002:0820a07_0": "釋制意中三初敘財境然下次顯過狀又二上明為道專崇兩利下明違行反成兩損捨已除貪是自利濟物成用即利他己所珍者謂內外兩財珍謂珍惜物即群生擁猶積也是下三結制意。",
    "X39n0714_002:0820a11_0": "【疏】二釋戒名者。",
    "X39n0714_002:0820a12_0": "【疏】問盜劫偷竊不與取等無非損財所以此戒標盜名者。",
    "X39n0714_002:0820a14_0": "釋名問中通列四名以徵別標之意偷竊是一種。",
    "X39n0714_002:0820a15_0": "【疏】答云文不可具且列一名。",
    "X39n0714_002:0820a16_0": "初答可解。",
    "X39n0714_002:0820a17_0": "【疏】有人言據俗大盜謂竊神器今言盜者對犯輕過非此戒收故言大盜但世賊盜義通不別。",
    "X39n0714_002:0820a19_0": "次答初釋名前示俗名竊神器者謀篡國位也老子注云大寶之位是天下神明之器今下次顯今名輕過即盜四已下止得蘭吉不至夷重故標大字但下遮妨謂雖有多名皆歸盜義故云義通不別。",
    "X39n0714_002:0820a24_0": "【疏】有人言非理損者為盜公白取者為劫畏主覺知為偷不與取者明主不捨。",
    "X39n0714_002:0820b02_0": "後釋中初文非理取者因利求利侵虧於人公白謂強力直奪。",
    "X39n0714_002:0820b04_0": "【疏】然則偷之與劫名局義乖不與取者雖是名通然於義中有非盜濫何者是邪四句分之初與取不是盜二與取而是盜如儉分食錯得二餅等三不與取是盜四不與取非盜如親友意暫用等是以眾名俱不標戒若舉盜者名通彼此損盜義盡又無非盜之濫故云盜也。",
    "X39n0714_002:0820b10_0": "次科初簡餘三名上二句明偷劫名局謂公私不同義乖謂兩不相攝下明不與取名通義濫四句中初三可解故不顯相二約儉時食有限量錯得不還即成重盜若下正顯今名言名通者反前偷劫也由此盜名該彼偷劫故云通彼此也言無濫者反上不與取也。",
    "X39n0714_002:0820b16_0": "【疏】戒者能治之行能所通舉故云盜戒。",
    "X39n0714_002:0820b17_0": "釋戒中盜是所觀之境治謂能觀之智境智相合思修業成故名為行。",
    "X39n0714_002:0820b19_0": "【疏】三具緣成犯者此戒五緣。",
    "X39n0714_002:0820b20_0": "【疏】初是人物以盜餘趣不成重故。",
    "X39n0714_002:0820b21_0": "具緣中初緣雖通三寶至於結重多從主掌是以初緣通云人物對簡非畜如後自分。",
    "X39n0714_002:0820b23_0": "【疏】物雖人主及至盜損還須人想若生餘想疑謂別境則是輕犯非此戒收是以第二作人物想。",
    "X39n0714_002:0820c01_0": "二中初躡前及下敘。",
    "X39n0714_002:0820c01_1": "文明疑想即境想中二三兩句。",
    "X39n0714_002:0820c03_0": "【疏】問想知二心有差別不答有同異也了境無疑曰知當境意謂為想俱能了境想與知同然知唯了境想通迷悟故與知異若以此心知是人物於下闕緣轉想不便謂實達境非迷忘故若謂人物想即順闕緣不乖律文境想互義。",
    "X39n0714_002:0820c08_0": "問中或有立云知是人物故問決之答中初答知想差別上句通標了下分示俱下顯同異若下次明立緣是非前敘立知有濫意謂若具緣中標云知者則人謂後闕緣中轉想皆是明了之心故不可立若下次明立想順教以律但有想差不言知故互即差也。",
    "X39n0714_002:0820c14_0": "【疏】想雖當境若盜輕物不成重罪故次第三明是重物。",
    "X39n0714_002:0820c16_0": "【疏】財雖滿五若無盜心本自無咎故次第四明有盜心。",
    "X39n0714_002:0820c18_0": "【疏】心雖起盜財未離處損主未就屬己不顯亦未成重故次第五明舉離處。",
    "X39n0714_002:0821a02_0": "餘三可解總五為三初三是境二四是心五心境合。",
    "X39n0714_002:0821a03_0": "【疏】問前後諸戒緣具方便今此盜緣無方便者答損財明盜便成重罪有盜成重不假方便恐涉濫故縱有方便亦俱不明但知未離已前並方便攝。",
    "X39n0714_002:0821a06_0": "初問可見若準事鈔須具六緣五興方便今此除之故發是問答中初示成犯齊限有下次明避濫不出如互用三寶燒薶壞色寄借抵拒之類但使虧損即成盜業不必方便然非一向都無故云縱有不明等。",
    "X39n0714_002:0821a11_0": "【疏】問經論明盜緣雖多少皆無重物者何答彼為成業受苦招生故無輕重如牛呞比丘但損一粟五百生償今雖遇聖口猶是牛律明持犯盜輕開悔得住盜五制重擯出故使法律軌儀其相在此。",
    "X39n0714_002:0821a15_0": "次問中經論即通指化教緣多少者謂所盜之物多少不定不約滿五以定犯相欲彰教意故問示之答中有二初示化教但論心業故不簡境如下引緣以示梵云憍梵波提此云牛呞(音詩爾雅注云食之已久復出嚼之)亦云牛跡智論云昔作比丘摘他一穗穀觀其生熟五百生作牛償力今遇佛出家得道口有牛呞足有牛蹄之相律下次明制教須分重輕由有懺擯開制不同故須軌定化教不爾所以不分。",
    "X39n0714_002:0821a23_0": "【疏】四闕緣者其相甚易列句辨犯講者通誦世相無幾時節可惜故不出也如其不解試為略舉。",
    "X39n0714_002:0821b01_0": "闕緣中反具成闕故云甚易學者皆能故云通誦世下示不廣所以如下生下所出無幾謂非久也時可惜者恐虗度也。",
    "X39n0714_002:0821b04_0": "【疏】若闕初境得三偷蘭初非人物替人物處作人想取二畜生物三無主物俱作人想望本人物不得境差方便蘭後之三物本自無心則非罪也如前義門可以通之此據小漫人物並取為言若據剋心王物替張亦同前判闕境還立如此識相舉一千從可謂達持犯者。",
    "X39n0714_002:0821b10_0": "初緣中二前約小漫以大漫隨犯故非所論上二句總標初下別示三種異境替人物處而非本境故名闕境俱下示犯如下指廣即境差方便中此下次明剋心躡前以示同前判者張物不得境差方便蘭王物無心則無所犯對上小漫人趣無闕故云還立如下結歎。",
    "X39n0714_002:0821b16_0": "【疏】闕第二緣據小漫者九句偷蘭謂轉想疑心雙闕各三故有九也亦不勞出恐未達者聊試舉之。",
    "X39n0714_002:0821b18_0": "闕第二中即闕人想想疑境定心差雙闕心境俱差用此三種各歷三境故成九句亦下示意同前。",
    "X39n0714_002:0821b20_0": "【疏】言轉想者。",
    "X39n0714_002:0821b21_0": "【疏】初須人想可得同境臨欲取時乃作非人物想據後心時俱得吉羅然律但結前心之罪盜人方便故云人物非人物想取偷蘭此句既爾諸句諸戒例同此解後不言也。",
    "X39n0714_002:0821c01_0": "轉想三中初句又三初明心轉須人想者示本想也心境相當故云同也臨欲等者明後心也據下次辨罪相此下三例通諸句即下八句諸戒指殺妄等若據殺戒亦列句數但不敘前後心相結罪之義故云不言耳。",
    "X39n0714_002:0821c06_0": "【疏】二人物畜生物想。",
    "X39n0714_002:0821c07_0": "【疏】三人物無主物想罪或有無若先知人物後作無主想則有前心罪若本作無主無心故無罪也。",
    "X39n0714_002:0821c09_0": "三無主想罪有無者即約轉想本迷為言今此正明轉想旁示本迷。",
    "X39n0714_002:0821c11_0": "【疏】二明疑心者初是人物對境生疑為人非人物為人畜生物為人無主物。",
    "X39n0714_002:0821c13_0": "【疏】三明雙闕者初盜人物非人物替闕境緣也就非人物復生疑心為人物為非人物闕心緣也二畜物來替為闕為畜邪三無主物替為主無主邪並例準知如此處解餘戒不釋。",
    "X39n0714_002:0821c17_0": "疑及雙闕同是疑心但前疑據境定雙闕約境轉耳作圖示之。",
    "X39n0714_002:0822a01_0": "【疏】闕第三緣重物作輕想結前方便蘭。",
    "X39n0714_002:0822a02_0": "闕第三中如取滿五意謂不滿。",
    "X39n0714_002:0822a03_0": "【疏】闕第四緣有盜無盜心前心吉羅本無非罪。",
    "X39n0714_002:0822a04_0": "四中有二初約先有後無前心吉者遠方便也下句次約始終無心如開緣中糞掃親厚等取也由前具緣不列方便故此闕中須分二種當知先有後無即闕方便始終無者正是闕心問前心犯吉那云闕心答望未動身猶非盜等故名闕心若爾至次方便轉入無心名闕心否答身色纔動盜業已彰但物未離未成根本是以擁住次近並名闕第五耳問前心後轉與闕想何異答闕想有心此據無心又前約動身後轉此約初心即轉如是思之。",
    "X39n0714_002:0822a14_0": "【疏】闕第五緣未離處輕重二蘭隨相分別。",
    "X39n0714_002:0822a15_0": "五中二蘭未與物交次方便也相交未離近方便也或次或近有阻不成擁在方便次近不定故令隨分。",
    "X39n0714_002:0822a18_0": "【註】佛在羅閱城有檀尼迦在閑靜處草屋坐禪為人持去乃作全成瓦屋佛令打破便詐宣王教取彼要材為王臣人民訶責無使入村勿復安止比丘以過白佛因斯如上制戒。",
    "X39n0714_002:0822a22_0": "【疏】就戒緣中初明盜緣二為王臣下訶犯之相緣中又二初作瓦屋打破盜戒遠緣二便詐宣教下正是所犯。",
    "X39n0714_002:0822b01_0": "【疏】就遠緣中明靜居坐禪者欲顯盜相動心禪行尚爾況餘滯境其過彌繁世俗常言顧雍拜萬戶封家人不知葛亮受三郡賞庫無石貯斯豈道邪知足若此可以自勵。",
    "X39n0714_002:0822b05_0": "戒緣中遠緣分二初示託緣之意滯境謂貪吝之人世下引俗誡道顧雍吳志云吳郡人孫權為王累遷官至尚書令封陽遂卿候還家而家人不知後聞乃驚此謂輕其勢祿也葛亮姓諸葛蜀志云瑯瑘陽都人事蜀先主後收江南以亮督零陵桂陽長沙三郡家無一石之粮此謂輕其財利也。",
    "X39n0714_002:0822b11_0": "【疏】問瓦舍打破不犯罪邪答如見論解以損命妨道惡法相學故勅打破無損財咎。",
    "X39n0714_002:0822b13_0": "問答中佛令阿難打破瓦屋恐疑損財有所犯故答中引論出彼三過示其可打復稟佛勅明非自為。",
    "X39n0714_002:0822b16_0": "【疏】就犯相中言要材者僧祇云取飛梯二枚故取重財早覺急制為開教主豈是凡邪故彼律明後得無學說自慶頌欲得寂滅樂當習沙門法止財支身命如蛇鼠入穴又云衣食繫身命精麤隨眾得餘注可解。",
    "X39n0714_002:0822b21_0": "次科僧祇初釋要財飛梯亦曰雲梯即相戰攻城之具是國家要用之物故云要財瓶沙王木坊中有五枚故言取二故下出故盜之意檀尼已證初果故云非凡此彰起教非實行故故彼下引證亦即僧祇彼云達貳伽耶(梵言之異)即作念言我作第一房上座次受駈我令出(因分房故)第二第三亦駈我出(今注不出此緣)後續作燒成瓦屋世尊復勅令壞及取王材作舍復見呵責徒自辛苦用多事為自今已後止此苦事依隨僧眾苦樂任時便習無事晝夜精進專修道業得諸禪定成就道果遂說三偈以自慶初偈如疏引初句標所期道果寂滅即是涅槃脫三界苦故云樂也次句示修因因即是行行依於教即三學八正是沙門法此上二句三偈並同各下二句有別並是成道之緣初即少欲行上句法說下句喻顯多欲多惱損害形命少欲無事資養安適蛇鼠入穴相似法故支持也即經云多求利故苦惱亦多少欲之人無求無欲則無此患是也第二下半明隨緣行身名有待必假資緣非別所懷繫命而已隨得隨受不擇美惡即經云於好於惡勿生增減趣得支身以除飢渴是也第三下半明知足行偈云一切知止足專修涅槃道上句謂隨於四事受用有餘下句謂心存聖道更無餘務此之三偈即是頌前長行初偈頌前止此苦事次偈頌前依隨眾僧後偈頌前專修道業又此三偈上二句並滅道二諦各下二句總明苦集二諦初是多欲苦二即多食苦三即無厭足苦三行對治如上所釋即知苦斷集修道證滅尊者道成無學說此自慶以示未悟故云欲得等。",
    "X39n0714_002:0823a01_0": "【疏】就戒本中約文求相事在弘演諸律明盜其相極多後學未周何由總括然余所撰事鈔隨戒釋相文亦具矣恐本未見故略解之然則盜相難分要知足者可有評判自餘隨境何由通曉。",
    "X39n0714_002:0823a05_0": "戒本中敘意為四初推講演諸下敘相繁未周謂未能徧覽諸部律論也然余下指廣生起然則下示難勸學隨境謂隨逐塵緣者。",
    "X39n0714_002:0823a08_0": "【律】若比丘(其義如上)。",
    "X39n0714_002:0823a09_0": "【疏】就戒句中文分為六初句能犯人在村若靜明盜物處不與者下明其心業王臣已下為俗法訶上三明其盜本不通諸戒下二罪擯如上解也。",
    "X39n0714_002:0823a12_0": "【律】在村落。",
    "X39n0714_002:0823a13_0": "【註】村有四種一者四周牆二者柵籬三者籬牆不周四者四周屋也。",
    "X39n0714_002:0823a15_0": "【疏】言村靜處者遮惡比丘心出罪網也彼生疑意村中有主攝護是強靜處犯盜可亦制罪故今張網綱維廣布罪目但是有主以我心盜非理義立何得無愆故列空有二處用收罪人。",
    "X39n0714_002:0823a19_0": "總釋二處中初科上三句牒文略示辟制造過即惡比丘心戒標二處即出罪網彼下委釋初敘惡比丘心故今下釋出罪網綱維並網上繩故列下結顯空即閑靜處有即村落。",
    "X39n0714_002:0823a23_0": "【疏】村有四種假以事明必過於此理亦通攝據文約相五種圍之對五不周則有十種餘者不出例此二緣。",
    "X39n0714_002:0823b02_0": "釋村中初示義通但取有物周圍不必此四故云必過等如僧祇渠溝壍等圍皆名聚落據下點文相言五種者一垣二墻三柵四籬五屋(屋必有壁注中脫垣字置令妄解)此五相中或容餘物閒接皆名不周則又為五注中第三且據墻有籬閒餘者準知或可五物二對參閒自有十種一垣墻二垣柵三垣籬四垣屋五墻柵六墻籬(注即此句)七墻屋八柵籬九柵屋十籬屋(三對有六四對有三五對有一準上作之)餘下指例言不出者即渠壍等二緣謂周不周也。",
    "X39n0714_002:0823b11_0": "【律】若閑靜處。",
    "X39n0714_002:0823b12_0": "【註】即村外靜地也處者若地中若地上處若乘若擔若空若架上若村若阿蘭若若田處若處所若船若水若私度關塞不輸稅若取他寄信物若取水若楊枝若園果草木若無足眾生若二足四足多足若同財業若共要若伺候若守護若邏道是名處也。",
    "X39n0714_002:0823b17_0": "【疏】言閑靜處者注解村外也就文明處通村內外者總舉盜相之緣位也。",
    "X39n0714_002:0823b19_0": "釋靜中村外謂齊聚落行來處已外蘭若地也。",
    "X39n0714_002:0823b20_0": "【疏】就分為三初十三種明物處差別次取寄信物下八種明物體差別若同財業下五種明契要差別此之三位隨盜財物皆據有主以入盜科若無主者則不名犯今總明主後就文消。",
    "X39n0714_002:0823b24_0": "別釋中總分為二前分三位今下次列二科明主。",
    "X39n0714_002:0823c01_0": "【疏】計主物者於物自在集散皆得故曰主也大約以分不出三位。",
    "X39n0714_002:0823c03_0": "總舉中初示主義集謂聚積散謂費用大下分主相。",
    "X39n0714_002:0823c05_0": "【疏】初明三寶二盜別人三明非畜初明三寶。",
    "X39n0714_002:0823c06_0": "【疏】謂知事者掌用此物罪福大深如大集中非聖非淨何能監護無有瘡疣。",
    "X39n0714_002:0823c08_0": "三寶中初科上三句敘罪福二皆深者由境勝故如下準教簡人彼經云僧物難掌佛法無主我聽二種人掌三寶物一者阿羅漢二者須陀洹(此二聖人)復有二種一能淨持戒識知業報二畏後世業有諸慚愧及以悔心如是二人自無瘡疣(此二清淨人瘡疣喻破戒惡業)。",
    "X39n0714_002:0823c14_0": "【疏】初盜三寶總而為言有守護者隨盜滿五皆是極重佛物無護如鼻柰邪斷施主故餘廣如鈔。",
    "X39n0714_002:0823c16_0": "次文兩判初望護主佛下二斷施福並犯夷重鼻奈耶云若盜佛塔聲聞塔等幡蓋皆望斷施主福邊得棄捐不受(即波羅夷)若準鈔中佛無我所例非人結蘭今文不出故指如彼。",
    "X39n0714_002:0824a02_0": "【疏】言佛物中有四差別。",
    "X39n0714_002:0824a03_0": "【疏】初佛受用物者如堂宇衣服及以金石泥土曾為佛像之所受用者不得差互常擬供養生世大福故律云若是佛園坐具等者一切天人供養同塔事故所以不許者莫不即體法身之相表處是深不得輕故。",
    "X39n0714_002:0824a08_0": "佛物中初科分三初示物相故下引律證所下徵所以法身無相隨物以彰故此諸物即法身體。",
    "X39n0714_002:0824a10_0": "【疏】二屬佛物所以得轉者由本施主通擬佛用故得貨易不同前者曾為勝相故唯一定也。",
    "X39n0714_002:0824a12_0": "二中初標示即錢寶人畜等物所下明開轉所以不下對前簡異。",
    "X39n0714_002:0824a14_0": "【疏】三供養物以幡華等得貨易者事同屬佛可以義求。",
    "X39n0714_002:0824a16_0": "三中物別轉易同上。",
    "X39n0714_002:0824a17_0": "【疏】四獻佛物者開侍衛者用之義同佛家之所攝故如薩婆多有施法者法師說法誦經者亦取分故餘廣如鈔。",
    "X39n0714_002:0824a20_0": "四中初標示物即飲食果實等次明用與初判屬侍人今時掌佛廟人義通道俗善見云佛前獻飯侍佛比丘食之白衣侍佛亦得食之如下引例論云若施法者分作二分一分與經法一分與誦經說法人謂彼雖施法而人獲分例今侍佛得食無疑古記問云若用常住僧食供佛通彼用否答法苑云後還入常住。",
    "X39n0714_002:0824b03_0": "【疏】言盜法物亦有其四。",
    "X39n0714_002:0824b04_0": "【疏】一法所受用者謂紙素竹木上書經像或箱函器襆曾經盛貯剋定永施不許改轉此則一定敬同聖教皆是滅理之所依持故有損益並望涅槃而生罪福。",
    "X39n0714_002:0824b08_0": "法物中初文前出物體皆下示所以紙素函器止是世物但望所詮至真無價故。",
    "X39n0714_002:0824b10_0": "【疏】有人無識燒毀破經我今火淨謂言得福此妄思度半偈捨身著在明典兩字除惑亦列正經何得焚除失事在福也。",
    "X39n0714_002:0824b13_0": "次科前出謬見(世中妄傳說偈得燒故經不見此疏焉知誤他)此下次據文斥上引半偈捨身者一彰如來求法之勤二示如來重法三顯正法難聞下引經證兩字除惑顯佛法功深舉少況多其過彌甚儻畏來苦勿逐魔徒二緣並出涅槃經彼云佛告迦葉菩薩言過去之世佛日未出我於爾時住於雪山唯食諸果食已繫心思惟坐禪經無數歲不聞如來大乘經名修是苦行時釋提桓因自變其身作羅剎像下至雪山宣過去佛所說半偈云諸行無常是生滅法乃至聞此半偈心生警疑汝今幸可說竟此偈羅剎答言今我實為飢苦所逼實不能說我即問言汝食何物羅剎言惟人煖肉其所飲者唯人熱血我復語言且說半偈我聞偈已當以此身奉施供養羅剎即說半偈云生滅滅已寂滅為樂菩薩偏於石壁樹道書寫此偈已即上高樹投身樹下身未至地虗空之中出種種聲乃至阿迦尼吒爾時羅剎還復帝釋形即於空中接取菩薩安置平地云云又經云善男子若復有人不知如來甚深境界乃至輪轉生死增長諸結多受苦惱若有能知如來常住無有變易或聞常住二字若一經耳即生天上後解脫時乃能證知如來常住無變易等言事在福者如施主作橋井等事隨在福生緣壞則失名事在無作今燒故經其事亦爾。",
    "X39n0714_002:0824c12_0": "【疏】餘之三相可以準前。",
    "X39n0714_002:0824c13_0": "指餘三中前二轉易後與侍人並同前判。",
    "X39n0714_002:0824c15_0": "四分律含注戒本疏行宗記二上之二",
    "X39n0714_002:0824c19_0": "四分律含注戒本疏行宗記二上之三",
    "X39n0714_002:0824c21_0": "【疏】就僧物中則有四別。",
    "X39n0714_002:0824c22_0": "僧物中前二屬處永定通名常住但前無分義後是可分故加常住十方以簡之後二俱是即施通名現前但前局當處後通內外故加現前十方以別之。",
    "X39n0714_002:0825a02_0": "【疏】一常住常住物如堂宇田園人畜米麫屬處已定不可分割必欲惠給餘寺羯磨和與若直送者是名盜損或有主掌自盜不望十方不滿隨取計五便與極重如僧祇中縱集得僧亦不可分故。",
    "X39n0714_002:0825a06_0": "初中分四初出物體屬下示名義或下明結犯餘盜望主此義易知故文但出主自盜耳如下引證。",
    "X39n0714_002:0825a08_0": "【疏】二十方常住物如飯餅等見熟之食本擬十方聞聲同飯有盜此食望護結重望僧結輕以僧分業無滿五故。",
    "X39n0714_002:0825a11_0": "二中初列物體本下示別名通名同上故不重出有下明犯相有二望主重者謂餘人盜望僧輕者即犯偷蘭或主客同盜或主自盜問二種常住並通十方何以前不望僧後望僧者尋文可通。",
    "X39n0714_002:0825a15_0": "【疏】問聲鐘告集是僧皆飯未知他寺奴畜得否答不合也僧具六和隨處皆是人畜別屬義非通使使既是局食亦如之。",
    "X39n0714_002:0825a18_0": "問中意謂他寺奴畜彼此通僧應得食故答中初句判定僧下釋所以初示僧通之義人下明奴畜不通鈔云行至外寺私有人畜用僧物犯重以施主擬供當處僧不供別類非福田故僧家人畜犯吉(今多私務將帶人僕食彼僧食明文犯重之)。",
    "X39n0714_002:0825a23_0": "【疏】三現前現前物如今諸俗以供養僧無問衣藥房具並同現前僧也如中含施招提僧房所謂別房施是也又如經中僧鬘物者此梵本音據唐言之對面物也即是現前對面之施耳鈔引昔解謂花果者隨字顯相乖其事義也。",
    "X39n0714_002:0825b04_0": "三中初示名體如下引證中阿含經阿難受別房用施招提僧所謂別房施即翻名也謂以別房施現前僧又如經者即涅槃文初翻名顯相鈔下點示昔非謂事鈔中誤用昔解彼云房宇是招提物華果是僧鬘物即取華果結鬘之義故云隨字顯相華梵不辨即是乖事義也。",
    "X39n0714_002:0825b10_0": "【疏】四十方現前物如僧得施及五眾亡物以此物施通擬十方有僧皆得故此福分廣大無邊及論立法不可盡集制作通法用約十方隨現集者皆有其分故曰也若未羯磨盜者偷蘭以十方僧不滿五故若羯磨已而行盜者隨其輕重據現結正既定罪相隨務則多講至於此引鈔解也。",
    "X39n0714_002:0825b16_0": "四中初簡物相以下示名義制通法者即白二羯磨若下定犯相輕重兩判準善生經初犯蘭者由未作法人無限數望十方結後隨輕重者既作法已人有數限故隨所盜輕重兩結。",
    "X39n0714_002:0825b20_0": "【疏】二盜人物就緣分三初明掌護損失後明被賊盜相。",
    "X39n0714_002:0825b22_0": "【疏】初中妙同鈔引善見論中若守護財物謹慎不懈而有盜者私竊而取或強逼取皆望本主結者以非護主能禁之限故也若反此者守物須償以本盜人欺守護故是須還他若不還犯。",
    "X39n0714_002:0825c02_0": "次別人物釋中初科上句指廣彼約二主分為七種一掌護損失主二寄附損失主三被盜物主四賊施比丘物主五枚囚縛賊主六狂人施物主七守視人作主並廣如彼須者尋之下引善見即彼初位論中初明守護謹慎望本主者有二義故一非能禁二無填償本主索償反成盜故若下次明慢藏反上二義故從守護。",
    "X39n0714_002:0825c09_0": "【疏】二被賊奪者如鈔所引義張二位謂現不現結罪時當隨二主心絕已不若財主已絕賊主得定此不可奪如律賊復奪賊二財主雖定賊主不定此則可奪以緣不具故三財主遲疑賊主已定此不得奪以緣成故何問本主四俱不定此則收得由心不定業非通暢故也今以四句可約判之。",
    "X39n0714_002:0825c15_0": "次科歷句中初總舉現不現者即對面現前盜及不現前盜二主謂財主賊主若下別列初後二俱可解次句以賊心猶豫盜業未成故云緣不具也第三反之故不得奪。",
    "X39n0714_002:0825c19_0": "【疏】問今有賊施得取物不答據理成也以物非定屬隨後作主如似世錢可定屬也隨人隨用隨處隨定隨損隨結可例通之。",
    "X39n0714_002:0825c22_0": "問中恐疑共盜故問釋之答中初判定以下釋所以如下舉事例通。",
    "X39n0714_002:0825c24_0": "【疏】三就所盜略舉通收情非情道並攝盡矣如鈔所引明了論解恐不見鈔故又引之。",
    "X39n0714_002:0826a02_0": "三中標文初總示如下生起。",
    "X39n0714_002:0826a03_0": "【疏】如彼解云盜義極多且約六根起非法行若偷六大亦犯重罪。",
    "X39n0714_002:0826a05_0": "釋中初科六根即約能盜以攝所盜六大即括所盜以顯能盜故知盜境該通無窮。",
    "X39n0714_002:0826a07_0": "【疏】何以明之如諸仙人是胸行師有人蛇螫作仙人書見者皆愈然須價直比丘被害偷看不問損與不損看時即犯以此例諸秘方要術不許人傳偷見違惱何啻在五所謂眼盜下根例之如誦呪治病欲學須直比丘密聽計直犯重偷齅甞觸亦例此知若要方術病緣即差得直方與得直聽寫比丘受學心緣得差不與價直故犯重也。",
    "X39n0714_002:0826a14_0": "六根中初句徵起如下列釋初委釋眼根胸行師准論合云胸行蛇毒藥師(謂蛇以胸而行)螫施亦反謂虫行毒也下下例餘五根。",
    "X39n0714_002:0826a17_0": "【疏】次約六界前地水火可知如律中有呪扇藥塗比丘偷搖不與價直是謂盜風若起閣斜臨妨他起造是名盜空智者識界也人有伎倆不空度他得直方與比丘方便就他學得不與價直即盜識也識不可盜以無形故但可從緣盜其智用耳。",
    "X39n0714_002:0826a22_0": "次六大中大謂六皆廣遍界謂六相差別體同名異前後各標就文初略指前三如律下引釋後三初明盜風若下次明盜空智下後明盜識伎倆謂藝能也識不可盜者謂不可盜去但其機巧為人所學故云盜耳。",
    "X39n0714_002:0826b03_0": "【疏】三明非畜物者如上立義已明可尋鈔中罪輕重也。",
    "X39n0714_002:0826b05_0": "非畜中指上立義者近指當戒具緣闕緣遠指篇前境差方便下指鈔者彼明盜非人物有主望主結夷無主望非人結蘭盜畜生物古謂犯夷今師準十誦多論但結吉羅。",
    "X39n0714_002:0826b09_0": "【疏】文中處者總舉用收其相也。",
    "X39n0714_002:0826b10_0": "【疏】初地中者恐人不了處之所在故以相列令知犯境不得迷也如律中解即地中伏藏有主守護若盜此物計五成重今約律中佛地僧地若有伏藏隨出隨屬佛僧二位亦無還主及送與王可如鈔中捉寶戒說。",
    "X39n0714_002:0826b15_0": "次物處初釋地中初明列相所以如下引釋指如鈔者彼云地上屬王不論地中如給孤獨聖人亦取此物故知無罪。",
    "X39n0714_002:0826b18_0": "【疏】二地上處者如今道地所得物也。",
    "X39n0714_002:0826b19_0": "【疏】三言乘者謂象馬等乘也就此乘上有財欲盜離乘便重即以乘為處也若欲取財無由得離雖乘行百里千里但得偷蘭後離方重若兼乘盜心絕乘離即犯重罪僧祇盜四足者驅向所期足徧犯重不隨所向者輕本期不定舉徧即重本主來逐心未得者輕也。",
    "X39n0714_002:0826c01_0": "乘上初示物就下辨盜初明就乘盜物若兼下連乘俱盜又二初正判僧下引類。",
    "X39n0714_002:0826c03_0": "【疏】四言擔者謂所有物屬於步擔義同前乘可以兩分。",
    "X39n0714_002:0826c05_0": "擔中亦約擔上盜物及連擔盜判犯不同故云兩分。",
    "X39n0714_002:0826c07_0": "【疏】五言空者明了論中約有辨空結罪如上今律明空謂有衣物鳥等從風所吹有主之物而加盜取明離處者即空異處是名離處故善見云盜空中鳥左翅過右翅尾處至頭上下亦爾俱得重罪杖遮不隨者蘭十誦中有主鳥銜重無主鳥銜者蘭。",
    "X39n0714_002:0826c12_0": "空中初標異彼論約起閣侵他空處故云約有辨空今下正釋初明空處故下引示左翅過右約橫飛說尾至頭處約直飛論上下可解以空無分齊還約鳥之飛動以明離處之相十誦彼具云諸有主鳥&#;是物去比丘以偷奪是鳥物波羅夷若野鳥&#;是物去比丘偷心奪是鳥物偷蘭遮此奪鳥物望人結罪亦應約空辨處故此引之。",
    "X39n0714_002:0826c19_0": "【疏】六架上者謂諸架壁有財物也若盜離者即以為處如十誦中取衣不取架持架將去不得重後離架時方得重亦同上判義相似也故又出者知無異也。",
    "X39n0714_002:0826c22_0": "架中初示處若下辨犯亦下指同謂同前乘擔離合兩判故下顯重意知無異者若不出相不知同故。",
    "X39n0714_002:0827a01_0": "【疏】七言村者謂託村為處律中初約盜物後盜村體或以機關攻擊強力水澆言辭辨說誑惑而取皆重。",
    "X39n0714_002:0827a03_0": "七中初盜物者律云若村中有金銀等若牽挽取初離得夷是也盜村體者即如所引攻擊水澆損壞也強力者律云依親厚強力而盜取也言詞辨說者誑誘取也說音稅。",
    "X39n0714_002:0827a07_0": "【疏】八阿練若者村外空地二位同村可知。",
    "X39n0714_002:0827a08_0": "蘭若梵言即翻空處二位同村即盜物及體律云空處有金銀等又云若以方便壞他空等是也。",
    "X39n0714_002:0827a10_0": "【疏】九田處者田有多種百穀所生之處總名為田律中兩相如上村解十誦云若為田故相言得勝者重不勝者輕若作異相過分勝者重僧房舍者亦爾不言理之曲直如尼言犯殘中但得述理官占無犯不許橫言今以義約若後主想決則應屬己若不定者應非重科。",
    "X39n0714_002:0827a16_0": "田中初示名相律下引釋初本律言兩相亦即物體十誦相言謂詣官詞訟得勝重者謂非理而得不如字誤彼作不勝若作異相者彼云若不勝已更作相若所得地乃至滿五得彼羅夷(謂作標相取也)房舍準田以判故云亦爾不言下決文不了又二初準例決即約理之曲直明犯不犯尼下脫相字即尼相言戒開述理故今下次約義決即就主心定與不定判犯輕重縱是僧地前主心決奪亦成重。",
    "X39n0714_002:0827a24_0": "【疏】十處所者或店肆作處如是非一亦有二位如上列之。",
    "X39n0714_002:0827b02_0": "十中初示相處所語通故云非一律云若家若市肆果園菜園庭前舍後若復有餘處等亦下判犯盜物盜體二位同前故略指之。",
    "X39n0714_002:0827b05_0": "【疏】十一船處者亦有二科船中盜物即船為處若盜船體如僧祇中解船筏時越動時偷蘭雖斷繩未離者蘭要斷繩離處方重善生流水中解船離栓即重。",
    "X39n0714_002:0827b08_0": "十一初總示舟下別釋初明盜物若下明盜船僧祇中明因果分齊次第之相善生離栓亦同栓巨月反樁也。",
    "X39n0714_002:0827b11_0": "【疏】十二盜水者律中但明所損不出分齊如僧祇中溉灌流水或一宿直一文乃至四五比丘為於佛僧復自為盜壞彼渠得越水入田蘭滿五者夷摩得伽云計彼塘工過分而用水滿者結重。",
    "X39n0714_002:0827b15_0": "十二初示本宗通漫律中但云盜水中金銀衣被魚鼈及壞他水處等如下引他部顯相僧祇前明主者計價下明比丘盜損為佛者他緣亦犯也渠即水溝伽論二義判犯一計塘工二用過分。",
    "X39n0714_002:0827b19_0": "【疏】十三私度關塞者。",
    "X39n0714_002:0827b20_0": "【疏】如律比丘無稅白衣應稅為彼過物故制重如十誦中比丘應稅不稅亦重雖不為過而示餘道以不被稅為他過物故犯罪也如多論中持國禁物出界入死罪故言重者但違王教故得吉羅薩遮經云不輸王課非盜也又僧祇云一切出家人不稅若賣買人應稅。",
    "X39n0714_002:0827c02_0": "十三中初科本律比丘無稅者謂官不稅比丘物而為他過物也十誦初明自稅謂有國土稅比丘物雖下明為他免稅多論兩斷論云若國禁物出王界者入死罪若比丘持出律師初言得重後云不入重但有違王教吉據此縱令官稅比丘物而故不稅者止得吉耳此則決前十誦結重之文下引經律文據益顯薩遮尼犍子經云何等不應稅世尊弟子比丘比丘尼一切外道出家人物是名不應稅若賣買者應輸是名稅分齊課即稅也(準此不稅無犯但是隨身道具若為治生不稅則如十誦犯重)僧祇同上。",
    "X39n0714_002:0827c12_0": "【疏】若官稅比丘方便自免者非犯一本不共要二非理稅我故上文云比丘無稅法也若成犯者賊來劫我方便隱物亦應犯重然有白衣官稅其物比丘為隱如律科重。",
    "X39n0714_002:0827c16_0": "次中初明不稅無犯又三初約義定故下指文據即四分多論等文若下引事反質然下次明為俗故犯如律即上四分。",
    "X39n0714_002:0827c19_0": "【疏】次明物體。",
    "X39n0714_002:0827c20_0": "【疏】初云取信物者律中持人物在右手隨離結重若本左手持物盜心不還須捨盜心方移右手不捨而移是名重盜如是類之又十誦云若貸他物抵言不貸故妄得提如善見中偷方便故吉羅十云若先用盡後斷當已得重先斷當後離處方得夷受他寄物亦爾善見云若負他債比丘持去無盜故無罪也。",
    "X39n0714_002:0828a02_0": "次物體中初信物者謂人寄附之物前引本律就身為處文約左右手以明犯相餘身分亦然故令準類律云頭上移肩上肩上移頭上左肩移右肩右肩移左肩下引諸部初十誦明貸寄前明抵拒犯提善見結吉示不同故十下次明犯重先用盡者謂己用過他所貸物後斷當者謂主來求索抵拒不還也先斷當者謂貸物猶在故約離處方犯受寄亦爾者抵拒斷當犯相並同次引善見謂負餘人債比丘輒爾為他持還但不成盜義應有罪。",
    "X39n0714_002:0828a11_0": "【疏】二取水者律中離地水器盛而盜隨滿結重僧祇若以筒就孔中飲滿者重若稍飲數止咽咽偷蘭若器先塞盜拔塞時越注入器中蘭注滿者重若注未滿即悔畏重以倒本器中偷蘭雖繩斷未離處離處未斷繩俱蘭蘇油蜜等例同。",
    "X39n0714_002:0828a16_0": "二中律約器盛者文云大小瓮及餘種種水器若香水若藥水若取者夷僧祇前明以筒盜飲稍即少也若下明持器盜取雖下約連器持去下例蘇油同上三判。",
    "X39n0714_002:0828a20_0": "【疏】三楊枝者義同上相律隨有者便隨言之。",
    "X39n0714_002:0828a21_0": "三中同上者亦為隨盜滿五成重律云若一若兩若眾多若一把一擔等律下通示律文列相之意謂前後所出隨據有者為言非止此數。",
    "X39n0714_002:0828a24_0": "【疏】四園果草木者如上僧物中鈔中廣引。",
    "X39n0714_002:0828b01_0": "四中初科指上即常住常住物下又指鈔即盜戒中彼引大集云盜僧物者罪同五逆隨損一毫則望十方凡聖一一結罪又引方等云五逆四重我亦能救盜僧物者我所不救等彼又廣引諸律明用得否撿彼看之。",
    "X39n0714_002:0828b06_0": "【疏】僧園果木比丘多犯以我寺中不謂有犯然立寺者以盛無我之僧隨有施為無非為解脫故今不思此取他眾人所有之物以為自保此罪大也如僧護日藏分中特可畏也故須深思。",
    "X39n0714_002:0828b10_0": "次科初敘喜犯然下次彰業重初明立寺之本今下次明盜取之情如下指教勸思僧護經彼因耶舍遊海邊見五十餘處地獄多是侵盜僧物現受苦報日藏具云大乘方等日藏經佛對日藏菩薩說諸破戒受苦等事鈔云別人得用僧薪草者此要具戒清淨應僧法者若行少缺得罪無量。",
    "X39n0714_002:0828b16_0": "【疏】如僧祇中僧地種果有功聽與一熟乃至菜瓜例與一翦若於園中搖樹果落地持云方重若就園內食滿者結重十誦僧園樹華聽供養佛大木供僧皮葉隨比丘用僧祇院內樹薪供僧食用若無定限應取乾者。",
    "X39n0714_002:0828b21_0": "三中僧祇初明賞功一熟謂一番熟者與之一翦亦約一番採摘若下次明盜果十誦樹華僧用供佛不成互用皮葉及僧祇樹薪並開別人取用準前明判要須戒淨。",
    "X39n0714_002:0828c01_0": "【疏】五無足者律中蛇魚為初有主盜取故僧祇云若以龍蛇等盜取犯重若瞋罵言何以籠繫即開放者越五分若壞殺具無犯不應爾十誦摩得伽中壞網慈心吉羅。",
    "X39n0714_002:0828c05_0": "五中律文先列蛇魚續云及餘無足眾生故云為初僧祇初明盜取彼云無足者所謂蛇蟒或蛇師比丘盜取蛇或筐滿五皆重今云龍者疑是文誤若下次明解放下引律論壞具皆輕以非盜故。",
    "X39n0714_002:0828c09_0": "【疏】六二足者盜人為初。",
    "X39n0714_002:0828c10_0": "六中人為初者律云人非人鳥乃餘二足眾生有主者重。",
    "X39n0714_002:0828c12_0": "【疏】約律盜人令出家去如上可知既非僕隷則非別屬雖違王教如上多論。",
    "X39n0714_002:0828c14_0": "盜出家中初明成重如上即約有主結也既下揀輕謂僕隷等損主故重餘無所損止可結吉故指如論即上度關等善見亦云盜人無罪者謂主人兒落度父母所遣等將去無罪是也。",
    "X39n0714_002:0828c18_0": "【疏】義言若他兒子賊奪去將便損父母依報力用屬賊是強不得教走若自走來則不負賊故十誦中賊捉弟子將去師還奪取犯重賊未決想無犯弟子自偷身來者不犯如昔解云師不得奪身自得走者父母感子力強賊奪得重已屬賊是強師弱奪賊故重兒報正體是強賊得力用則弱走是強報相逐弱用隨來不犯。",
    "X39n0714_002:0829a01_0": "奪賊中三初以義判前明賊奪成重子是父母所依假其力用所損處重故屬賊強不下教比丘護盜教走成重以損賊故自來無過以非意故故下引證可見如下引昔解初牒前兩判父下釋出所以初明師犯重意兒下次明自來無犯兒報強者自所有身非他屬故賊得弱者非所生親復非雇主故強報相逐者身隨己意故弱用隨來者賊無分故。",
    "X39n0714_002:0829a09_0": "【疏】十誦云見他奴婢語言辛苦何不走去如語吉羅舉一足蘭舉二足重若奴已叛催令駛去隨語得重或言此儉彼豐奴即叛去不教故不犯或問豐樂逐比丘去即驅使者逢難喚走皆不犯。",
    "X39n0714_002:0829a13_0": "三中四段前二教走成重後二不教無犯初明誘引若下次明催去駛疾也或言下三約比丘語彼或問下四據彼問比丘。",
    "X39n0714_002:0829a16_0": "【疏】七四足多足律約畜論亦可準上。",
    "X39n0714_002:0829a17_0": "七中律云象馬牛駱駝驢鹿羊及餘四足等多足者律云若蜂若百足及餘多足等並約有主成重故令準上。",
    "X39n0714_002:0829a20_0": "【疏】同財業者謂違契要故此引也據此同財其相多種或資生同如今師資同活等取五即犯不假半分以彼同財全欺負故或同活生共營財業若生心盜則須計分滿十方重五是我分五欺彼故。",
    "X39n0714_002:0829a24_0": "同契差別中初科前示犯意以同財業本無有犯但望違契有成盜義故云在此引也律云同事業得財物當共(此契要也)以盜心取五若過犯重(即違契也)下辨犯相初二句總標或下別釋初明資生同謂彼此有財無所簡別故取五即重次明同活生者謂共營生得財各半故取十成重(活生或是寫倒)。",
    "X39n0714_002:0829b06_0": "【疏】言共要者。",
    "X39n0714_002:0829b07_0": "二中要即約也。",
    "X39n0714_002:0829b08_0": "【疏】律舉行盜先要共分如上律中弟子倫師衣誤得己衣須分一半與共要者以同要時但云得衣不問自他皆分半故。",
    "X39n0714_002:0829b11_0": "初科上二句示犯律云共他作要教言某時去某時來若穿墻取物若道路劫取若燒從彼得財物來共分如上律中即前錯誤中僧祇文也。",
    "X39n0714_002:0829b14_0": "【疏】如僧祇中兩教作者自共制言從今得衣二人共分一人得衣便自念言後得不必及是便解制云從今各任相祿先得衣者半滿結夷又得衣咒願已言且置汝邊便解制蘭又聞欲施便解要越有二糞掃衣者要共覓衣一得好衣解要二得好衣草覆三不覆解要如上犯罪三階列之後二句中不得重者由初立要入手共分以不捉衣解要故輕。",
    "X39n0714_002:0829b21_0": "次科僧祇二節初約受施違要前明共制兩教謂兩人互教一下次明各解有三初貪好故解入已故重相謂福相祿即祿分二隱藏後解蘭三聞施先解吉此二並未入手故輕如後所決有下次明糞衣違要初明共要一下明各解又三初列句次句下略摶覆字第三句上略不取字如下示犯初句重次句蘭後句吉故云如上後下出後二句犯輕所以。",
    "X39n0714_002:0829c05_0": "【疏】善見云期時共去中前中後今日明日今年明年相要不絕相當者重不如要者輕。",
    "X39n0714_002:0829c07_0": "三中善見上明作要下示犯相言相當者論云時剋相應俱得罪不如輕者彼云若不從教教中前取而中後取教初夜取而後夜取教白月取而黑月取教此年取而後年取教者小罪(偷蘭)取者波羅夷此據專剋為言若本通漫不定時日隨違成重。",
    "X39n0714_002:0829c12_0": "【疏】言伺候者規財便利覘候處所相期進不得財必共故也縱得不共為候亦犯。",
    "X39n0714_002:0829c14_0": "三中初約共要犯覘勑豔反窺看也律云我為往觀彼村若城邑船渡山谷人所居處等於彼得物一切共盜取成重等縱下次約受教犯雖不共分盜戒教他能所同重故云亦犯。",
    "X39n0714_002:0829c18_0": "【疏】言守護者為其掌錄所在追求隨得共之故言此也若先不要但為守護既不同心義亦非犯。",
    "X39n0714_002:0829c20_0": "四中初明共盜犯律云從外得財我當守護若所得物一切共故若下次明不共非犯。",
    "X39n0714_002:0829c22_0": "【疏】言邏道者相望通塞防慮外人得財共之故曰也僧祇二人共盜一人守門一人入取解時俱越牽時俱蘭離時俱夷。",
    "X39n0714_002:0830a01_0": "五中邏郎佐反遊弈守路也律中或作看道初示犯相通謂無人為疑塞則反之律云我當看道若有王者軍來若賊軍來長者軍來當相語告若有所得一切共是也下引文證同犯可知必非同意為守同上已上五種前二則通盜者互違後三但據共盜同別。",
    "X39n0714_002:0830a07_0": "【律】不與。",
    "X39n0714_002:0830a08_0": "【疏】文言不與者明主不捨心任私之成我盜也。",
    "X39n0714_002:0830a09_0": "第三句釋文中心任謂己得自在私之謂不與他共。",
    "X39n0714_002:0830a11_0": "【註】他不捨也若也物想他所護想有主想非己物非暫用非同意故也。",
    "X39n0714_002:0830a13_0": "【疏】注中他物想者非己物也他護想者非暫用也有主想者非同意也物雖屬主同意破用雖盡無過故以此解釋成有主。",
    "X39n0714_002:0830a16_0": "釋注中即用注文後三非句配前三想對之可見。",
    "X39n0714_002:0830a17_0": "【疏】上雖約物明盜然結正時終須離處因明十種。",
    "X39n0714_002:0830a18_0": "離處中以盜戒成犯雖約離處然其離相不必物離故以十門括示差別。",
    "X39n0714_002:0830a20_0": "【疏】一文書成明離處者如今持律判亡僧物重輕互斷下筆成犯善見云書地作字一頭時輕兩頭時重二言教立善見云口斷多端偷夏唱大律中言辭誑惑取是三移標相者善見盜心取地移標得一髮亦重四墮籌如律隨下犯五異色如律壞本色故六轉齒如十誦蒲薄移棊子等七離處非犯如祇驅牛馬心疑故非犯八不離處明離處如見必得不疑動即重也九無離明離律中攻擊破村燒埋等十雜明如空中等相廣如鈔引。",
    "X39n0714_002:0830b05_0": "初中凡判亡物判重入輕夷判輕歸重蘭但取文成不待物離善見書地者謂作契書判斷田地一頭輕者是方便蘭兩頭重者即究竟果二中口斷多端謂強詞巧辯非理而斷偷夏唱大如施十夏者物貪心欲取未滿言滿律中誑惑即邪心勸誘上之三相竝望發言決得無疑皆成夷重三中標相即今丈尺度量之物一髮重者善見云地深無價故四中如律調部云時有比丘易他分物籌佛言舉籌波羅夷又有比丘盜他分物籌佛言直五錢波羅夷五中並指調部文云若破若燒若埋若壞色佛言皆波羅夷(上三即如九中所引)六中轉謂翻轉齒即骰子棊子多用牙骨為之摴蒲即賭博之名今謂先曾約物而盜翻彼采或轉己負為勝或轉他勝為負虧他滿五皆重七中如祇即僧祇如前乘中具引八中如見即善見彼云空靜處盜決得無疑如擲杖空中必無不下故動即成重九中攻擊如上盜村體燒埋等如五中引十雜明者示不盡故下指鈔者彼云如空中吹物盜鳥曲弋斷流水注等即上物處中已明。",
    "X39n0714_002:0830b24_0": "【律】盜心取。",
    "X39n0714_002:0830c01_0": "【疏】文言盜心取者明心應境也欲明行盜心業須具必兼兩緣以成一盜故注解云賊心取也。",
    "X39n0714_002:0830c03_0": "盜心中釋文初標示總意應猶稱也上云不與是境此句即心欲下出立句所以兩緣即心境。",
    "X39n0714_002:0830c05_0": "【註】賊心取也有五種黑暗心邪心曲戾心恐怯心常有盜他心又五種取決定取恐怯取寄物取見便取倚託取或依親友強力若以言辭辯說誑惑而取者是。",
    "X39n0714_002:0830c09_0": "【疏】律中具出二五盜心。",
    "X39n0714_002:0830c10_0": "【疏】初云黑闇心者謂癡心也愚於教行不肯修學故於盜境生可學迷律云隨作結根本是也即如上引知事比丘互用佛僧物隨滿犯重也言邪心者謂邪命也貪心規度為財說法即是以利求利惡求多求外現清白內實邪濁故五分云諂心取財是盜也言曲戾心者即瞋心也與少嫌恨現相索多或示威怒相是也言恐怯者謂迫喝也或說地獄惡報或說王官勢力而得財者如摩得伽云強奪取是也言常有盜心者恒懷規奪得物乃休也。",
    "X39n0714_002:0830c19_0": "五種心中初文又二初通示心相引律隨作犯者則知此心通犯諸戒又云更增無知罪則不學無知亦同此耳即下別指盜業即前三寶境中已明二中初示名邪命謂邪求養命貪下列相規謂希求度即籌慮規度說法事同治生販易故云即是等也故下引證三中初釋名曲謂非理戾即忿怒與下示相嫌恨約內心威怒約色相四中示名迫謂以事逼切喝謂說時作其大聲或可作遏謂抑遏也或下顯相說地獄謂濫託聖法王官謂倚恃豪勢如下引證第五可解。",
    "X39n0714_002:0831a05_0": "【疏】又變此心云五種取者取是其業對境行事也。",
    "X39n0714_002:0831a06_0": "次釋五取標簡中前五約心不出三毒若就通說莫非希物五並貪心若約別論如文乃異初二及四並是癡心三即瞋心五是貪心又前五種外相非盜故約心論後之五種內外俱盜故從外事。",
    "X39n0714_002:0831a10_0": "【疏】言決定取者心慮已定必得如期故曰也言恐怯取者示身口相令生怖畏故取彼財如十誦中輕慢抵突而取他物是也言寄物取者或全抵債或以少還他是也言見便取者伺他慢藏陽作陰伏之類也言倚託取者或假名聞威德或恃親友形勝也。",
    "X39n0714_002:0831a15_0": "第二引十誦文輕慢謂倨傲抵突謂觸犯四中慢藏謂不勤收舉陽作謂詐作餘事陰伏即潛藏他物五中二相假名德則通自他恃親友則唯在於他形勝謂位貌過人者如王臣貴族等。",
    "X39n0714_002:0831a19_0": "【疏】餘注云或依親友下律中隨諸相下皆引此言當今季世多弊斯犯故聖制有以也文相易耳。",
    "X39n0714_002:0831a21_0": "餘相中初示律文律列物處十三種別一一處後皆出此二相當下顯制意弊猶滯也下句點文以其事顯不勞釋故。",
    "X39n0714_002:0831a24_0": "【律】隨不與取法。",
    "X39n0714_002:0831b01_0": "【疏】文言隨不與取法者結罪分齊釋成重相也不與取者犯名也法者盜刑也滿五便入死位故是法攝謂比丘行盜準此以判故言隨也。",
    "X39n0714_002:0831b04_0": "三中釋文初總示不下牒釋初釋不與取次釋法義謂下釋隨義準此判者即準國家滿五入死之法。",
    "X39n0714_002:0831b07_0": "【註】以王立法若取五錢若直五錢物罪應至死佛隨王法盜滿制重也。",
    "X39n0714_002:0831b09_0": "【疏】注中依王法故制有此位取錢者即五錢體也直五錢者財準錢法也猶如唐律隨有犯者皆約絹估以從尺寸方定刑名也注云盜五死罪準此行盜驅擯不別事同死也。",
    "X39n0714_002:0831b13_0": "注中初科又三初釋王法此位即盜戒取下次釋滿五財即總於眾物唐律如下自引今時俗律亦約絹估驅擯同死者道俗制別片相似故。",
    "X39n0714_002:0831b16_0": "【疏】如多論問盜何等錢而成重罪解有三種初云本依王舍國法隨彼用何等錢準彼為限二云隨國所用有佛法處即以為限後云佛依王法盜五得死依而結戒今隨有佛法處依國斷盜幾物應死即以為限如上三釋論師以後義為正。",
    "X39n0714_002:0831b21_0": "次科引論中以錢體多別故問定之初解依王舍者以佛在彼國制此戒故彼是大銅錢一當十六則盜小錢須滿八十次解隨國用者無論物體但滿五數後解不約多少但隨國死刑為準論取後義今依次解耳。",
    "X39n0714_002:0831c02_0": "【疏】然五錢義互釋不同判罪觀緣緩急者如母論善見所說若約護行草葉不取者是也。",
    "X39n0714_002:0831c04_0": "取舍中初科上二句標諸說不出論家三解判下示教意初明判罪母論中一切戒皆有緩急二緣鈔記具引如盜戒乃至草木小葉他物不得取等名急若非他物想取名緩善見如下引若下次明護行母論善見四分條部竝有此文。",
    "X39n0714_002:0831c09_0": "【疏】今諸持律多依十誦故彼文云古大錢者大銅錢也據今小錢即八十文。",
    "X39n0714_002:0831c11_0": "次科依十誦者即取多論初解。",
    "X39n0714_002:0831c12_0": "【疏】如多論中盜相通濫初釋本錢何由可曉後解隨國現斷入死言亦泛濫難可依承如此唐律強盜滿尺則是極刑竊盜五十匹罪至役流縱多盜者不加至死論令準此則刑無死名比丘多竊少有強者縱有強奪計尺死刑盜五十匹又非死例準俗制道盜相叵論如僧祇云正無定法斷盜不定。",
    "X39n0714_002:0831c18_0": "三中初二句通示初下別釋前破初解但傳聞彼錢時賖處隔莫知體相故云何由曉也後下次斥第三解初斥其通濫如下次引俗例強盜如劫奪竊盜即密取極刑即死罪叵猶不可如下後引文證明不可依。",
    "X39n0714_002:0831c23_0": "【疏】若依四分但云五錢錢則八種並同一制可如多論中間一解隨國用錢準五為限則諍論自息也。",
    "X39n0714_002:0832a01_0": "四中初示本宗有準八種謂金銀銅鐵白鑞木皮胡膠可下次取多論會同。",
    "X39n0714_002:0832a03_0": "【疏】就斷盜相結罪分齊六門分之善見云於戒律中宜應從急又觀五事處時新故等。",
    "X39n0714_002:0832a05_0": "斷盜中初科善見宜從急者謂護行也觀五事者謂判罪觀緣也五事文略隨身用處時如下引新故者彼云有物新貴後賤如新鐵鉢完淨無穿則貴後穿破便賤隨身用物者如刀斧初貴後賤若偷他斧應問主幾直買等如鈔記備引。",
    "X39n0714_002:0832a10_0": "【疏】初錢有貴賤時如十誦錢貴盜一入重賤時百千入輕二貴賤處者如律貴處盜物賤處賣還依本處定價三善見云貴時盜賤時賣定罪還依本時如上三門唐律明相亦同也四取多非重不得而重者如伽論云數取四錢數作斷意乃至五千不犯重也又如四分燒埋壞色或教他不為己亦犯重故五不滿五結重過五但輕者如律眾多人遣一人盜五錢多人共分隨本一分滿五通犯如十誦中盜眾多人未分物雖多而輕謂亡比丘輕物也六盜一人一錢重如僧祇五人各以一錢同遣一人掌之若盜望護主結是也又如善見欲識盜相如師徒四人相教互盜一人六錢各得一夷一蘭此義應知如師語三弟子曰彼有六錢大者取三次小各取一我自取一乃至小弟子亦作此言彼有六錢和尚取三同學各一我自取一教人滿五夷自偷不入教人業故但蘭可以類知。",
    "X39n0714_002:0832b02_0": "初時中貴謂以一當多賤則雖多成少二中但明貴盜賤賣賤盜貴賣亦從本斷第三依本亦同約處如下合同俗律四中初雙標如下引釋初釋上句又下次釋下句第五初標二句如下對句次釋可見六中初標句如下引釋僧祇中且從本主以立句義然望護主成重自是盜五耳善見中初立義如下示相四人互教乃約異時為言若一時中止可一人為能教三為所教能教取一即是盜一成重之義自偷即自業相成教人即假異緣剋果二業緣別故不相入。",
    "X39n0714_002:0832b12_0": "【律】若為王(得自在不屬人)王大臣(種種大臣輔佐王者)所捉若殺若縛若驅出國汝是賊汝癡汝無所知是比丘波羅夷。",
    "X39n0714_002:0832b14_0": "【疏】文中若為王下七相治罰賊法訶罵賊辭。",
    "X39n0714_002:0832b15_0": "第四句標中點文可解。",
    "X39n0714_002:0832b16_0": "【疏】所以列者欲明盜損道俗同弊輕仁薄義勿過於此故列此相用懲後犯。",
    "X39n0714_002:0832b18_0": "顯意中初句徵問欲下引釋初約誡後釋弊惡也皆有此惡故云同弊輕仁謂無濟惠之心薄義謂非義而取懲音澄誡也。",
    "X39n0714_002:0832b21_0": "【疏】又人解云初篇四夷餘三自犯無多過失顯盜是公白尚盜王材況餘凡庶而得免者故舉貴類賤舉難況易意可見也。",
    "X39n0714_002:0832b24_0": "次科約彰過釋貴則無過國王難則無過王物故舉其極以況其餘。",
    "X39n0714_002:0832c02_0": "【疏】捉殺四相輕重文亂若欲糾正應言捉縛驅殺也。",
    "X39n0714_002:0832c03_0": "牒釋中初科以殺第二治法不次義須後列糾定也。",
    "X39n0714_002:0832c05_0": "【疏】所言捉者僧祇云瓶沙王遠祖治賊但令栴陀羅拍頭捉手便自愧恥永不行盜所言縛者世濁情澆雖捉猶作乃於多人之處祖王使人以灰圍之及至父時止故灰圍行驅出法至瓶沙登位七反驅出還入為盜乃截一指愁悔無極佛為王說過去為養千愚事至阿闍世乃行殺戮也。",
    "X39n0714_002:0832c11_0": "釋四相中並引僧祇文旃陀羅此翻殺者澆薄也灰圍即同縛也及下釋第三驅出似今之配流至下釋第四七反者彼云時有一賊七反驅出還來劫殺村城爾時有人捉縛與王乞令苦治王令將截去小指王尋生悔念言夫為王者愛念民物何有人王傷截人指即往問佛佛言過去世時有城名波羅奈國名迦尸王號名稱國民皆工巧伎以自生活若無伎術及作賊者皆付名愚癡時有作賊送至王所王言始有一愚若滿千數用作大會方苦治之勅付大臣令著無憂國與五欲樂後愚聞王賜樂不久滿千臣即白王王乃與食施寶勅愚人言汝等還家供養父母勤修家業勿復作賊。",
    "X39n0714_002:0832c23_0": "爾時愚人聞勅奉行王即以位授太子入山學仙人法而說偈言本求千愚人作會謂難得如何未幾時千數忽已滿惡法日夜增大會於是止欲離世惡人宜時當出家佛言諸比丘爾時國王即瓶沙是先世已來常畏罪報今既為王續亦畏罪故生疑問佛也準有五法今既截指合歸後殺。",
    "X39n0714_002:0833a05_0": "【疏】問如戒緣中若盜五錢罪應死者云何乃指其後殺邪答滿五合死古法常然王欲輕刑減死從擯如今此國竊滿絞刑政緩刑寬減從加伇也。",
    "X39n0714_002:0833a08_0": "問中意謂既有四治不合戒緣獨指後一答中初二句釋戒緣明死王下示文列四治。",
    "X39n0714_002:0833a10_0": "【疏】餘三罵辭及後結罪文相易解。",
    "X39n0714_002:0833a11_0": "指餘中初句指當句及下指後二句。",
    "X39n0714_002:0833a12_0": "【註】比丘如上諸處得物盜直五錢若過五錢波羅夷方便偷蘭遮若取減五錢偷蘭遮不得者突吉羅教人盜取彼若得物俱波羅夷若受教者自取異物若異處取物取者犯重教者偷蘭若為取物使無盜心教者波羅夷受使者不犯若教人取物謂遣盜取受教者犯重教者無犯有主想犯重若疑偷蘭無主物有主想疑偷蘭比丘尼等四眾並如上戒不犯者與想取己有想糞掃想暫取想親厚意想者是也。",
    "X39n0714_002:0833a20_0": "【疏】就注辨相犯不犯中五眾犯相分文同上下更不分直隨相釋。",
    "X39n0714_002:0833a22_0": "辨相中初科應先分二即犯不犯犯中又二即比丘及餘眾比丘又二初自作教他有主下境想相對初中又二前明自作教下後明教他前中又二初明成重方便下犯輕如是對之。",
    "X39n0714_002:0833b02_0": "【疏】初明自作輕重相。",
    "X39n0714_002:0833b03_0": "自作中重即注中滿五究竟輕謂方便減五等相。",
    "X39n0714_002:0833b05_0": "【疏】就教人中分二初心境相當同犯相二若受教取異物下分二初有二句懷盜心同物處有異故重輕別後有二句取物是同心有無異故罪無罪別。",
    "X39n0714_002:0833b08_0": "次釋教人分示中初二句即自取異物為一異處取物為二後二句即從若為取物下為他取物為一句教人取物為一句。",
    "X39n0714_002:0833b11_0": "【疏】就初受教自取異物者主同物異也後句主異物同也取離地時專是所教故重能教乖境故但結本方便。",
    "X39n0714_002:0833b14_0": "釋中初科前分句差別取下示犯重輕。",
    "X39n0714_002:0833b15_0": "【疏】就後心有無中初能教有心所教無心若得物時須分半取以本要期得物分故後句所教有心亦須分半雖是我衣以所教取時作他想故盜緣成犯何得不分若不與者賊復奪賊義可見也。",
    "X39n0714_002:0833b19_0": "次科前釋初句注中教字下脫者字須分半者即與所教必能教者本無期心不與無過後句亦分半者此定須與不與復成盜重作他想者以彼意謂為能教取故雖誤得己物亦須分與同上僧祇。",
    "X39n0714_002:0833b23_0": "【疏】就境想中律文具列輕重二位今注略故但舉重者。",
    "X39n0714_002:0833c01_0": "境想標中輕重二位者律中盜戒境想有二重初滿五有四句如注所引次減五四句亦同但初句結蘭餘三並吉。",
    "X39n0714_002:0833c04_0": "【疏】計應五句有主無主想所以不出者濫故不明濫相如何若始終無心則不可學迷故非罪攝若前後想轉據後非罪前心有主偷蘭若云無罪則濫轉想若云偷蘭又濫本迷是以相與不出後諸例爾可以通鏡。",
    "X39n0714_002:0833c09_0": "次科示所以中初標句徵意濫下約義申通初句略示濫相下委釋初重徵若下示相前列二心結犯有無若云下次敘兩濫明不可出下指例者即境想中凡四句者皆同此故。",
    "X39n0714_002:0833c13_0": "【疏】問此由濫故便隱沒者何為後戒得具五邪。",
    "X39n0714_002:0833c14_0": "初難中後戒即律殺戒具列五句是亦有濫理不當列。",
    "X39n0714_002:0833c16_0": "【疏】答罪有緣非緣異故以無主想謂同糞掃非生罪緣人非人想境雖重輕同是制約生罪緣故所以有也。",
    "X39n0714_002:0834a01_0": "答中初通答緣謂前境是生犯緣以下別釋初釋盜戒非緣人下釋殺戒有緣。",
    "X39n0714_002:0834a03_0": "【疏】問若如此者不處分處分想非生罪緣何故具五。",
    "X39n0714_002:0834a04_0": "次難中處分緣法後心無罪而列五句者則乖前義。",
    "X39n0714_002:0834a06_0": "【疏】答彼以事法俱可學故雖有造作有教可依無容迷忘縱迷非學不結其罪以事是難容有大犯故列第三。",
    "X39n0714_002:0834a09_0": "答中初敘可學無迷事即過量法即處分由教聽作各有制度故不容迷縱下次明不可學不出所以既有教法迷心非易故云事難若從迷忘無罪而除此句容有濫託而犯根本故云容大犯也。",
    "X39n0714_002:0834a13_0": "【疏】問若如此釋律中地非地想暮非暮想亦迷非學何故列之。",
    "X39n0714_002:0834a15_0": "三難中掘地日暮並是對事迷心無罪止合四句不應列五。",
    "X39n0714_002:0834a17_0": "【疏】答同以轉想結前心罪如前境想互四五中說。",
    "X39n0714_002:0834a18_0": "答中言同以者通前二房竝同此義淫中已釋故指如前。",
    "X39n0714_002:0834a20_0": "【疏】問何名無主物答如鈔具引讀取通之即善見中子惡父逐後亡者是如僧祇中若失物時作捨心者是無主物如多論云取計滿犯。",
    "X39n0714_002:0834a23_0": "明無主中初問次答上二句指廣彼引善見文同下引又引多論二國中間國破王走後王未立竝名無主即下略示善見可解若論此方屬官為主僧祇捨心理應得取下引多論顯己非主然己屬他故計成犯彼云若先心已捨正使己物亦不得取計非他屬取亦無過。",
    "X39n0714_002:0834b05_0": "【疏】就不犯中。",
    "X39n0714_002:0834b06_0": "【疏】與想取者實是他物意謂與我故非犯也言己有想者實是他物意謂己物無他想故言糞掃想者實是有主意謂無主開境想中初有主想句也言暫取者既非永用暫取借故開上主不捨中非暫取也言親友意者情若琴瑟財有何別古有食必兼人衣亦通被故衣從二人食字亦爾如親情故開上非情友也如律七法可為親友難作能作難與能與難忍能忍密事相告互相覆藏遭苦不捨貧賤不輕是也。",
    "X39n0714_002:0834b14_0": "不犯中五前三約心明開後二就事明開三中境想初句者即取前不與下三非配此三開也五中初約世俗釋若琴瑟者喻其調和不相乖也食兼人者謂同食也衣通被者謂同服也衣字從二人者據篆體本作众說文云象覆二人之形食字本從[入/一](音集)從皂(音急)說文云後[入/一]象三合之形皂即穀香也今取上三合之義故云亦爾如下次引律解順此七法方入開位初三難事能為四即切磋琢磨五謂掩惡揚善後二存始終。",
    "X39n0714_002:0834b23_0": "【律】不共住(義如上解)。",
    "X39n0714_002:0834b24_0": "【疏】此戒人多潛犯不謂重罪但是麤心鈔疏雖繁猶恐未悟可例此斟酌犯罪相也故善見云戒中宜從急護此第二戒事相難解不得不曲碎解釋其義理分別汝當善思論文如此臨事可不免邪。",
    "X39n0714_002:0834c04_0": "結勸中初敘數犯所以鈔下指撰述勸修故下引論文勉學前引論文後二句指文以勸。",
    "X39n0714_002:0834c07_0": "四分律含注戒本疏行宗記二上之三",
    "X39n0714_002:0834c11_0": "四分律含注戒本疏行宗記二下之一",
    "X39n0714_002:0834c13_0": "【律】三大殺戒。",
    "X39n0714_002:0834c14_0": "【疏】第三大殺戒。",
    "X39n0714_002:0834c15_0": "釋殺戒。",
    "X39n0714_002:0834c16_0": "【疏】經明性重多以此戒為初豈非身為業先故殺業因首故也言性重者以性含輕重也重則人道輕則非畜約境分心故罪階三位。",
    "X39n0714_002:0834c19_0": "明輕重中初示經律不同以彰過重經明十業並殺為初菩薩梵網十重亦爾問其意云何答化教明於業行業中身殺居先又復殺惱乖慈大士特須偏禁淫無違惱故列于後制教不爾為道而制障道中深勿過淫欲小機自利不慮違慈故與前反各有其致諸經皆爾不可一指是故文中但云經明豈下出意三業之中口意二業依身而成身居其初故云先也又身三業中殺為最重如上所明由此義故經標在初故云因首次言下轉釋重名性名通含對經云重心無輕重隨境分差教依心制故罪亦別。",
    "X39n0714_002:0835a06_0": "【疏】今就人趣四句分業一非恩養非福田二是恩養非福田三是福田非恩養四亦福田亦恩養。",
    "X39n0714_002:0835a08_0": "分句釋中即對常人父母無學及佛以為四句雖同人道業道制教重輕單複因果竝殊故須標別方無通濫大約而分前一唯凡後二唯聖第二父母則通凡聖廣如後釋。",
    "X39n0714_002:0835a12_0": "【疏】先釋初句。",
    "X39n0714_002:0835a13_0": "【疏】言制戒意者以非父母故非恩養又非無學故非福田既非此二則餘人道所以不許加害者人趣報勝善因所招形心俱是受道之器出家之士理應四等為懷慈濟物命今反內懷瞋忿斷彼相續違慈惱他損害道器過中之甚故聖徧禁。",
    "X39n0714_002:0835a18_0": "初句制意中初對句揀境所以下正示制意又二初明所害境勝文中三義初是現報勝二謂宿因勝三堪受道六道之中唯人一道有緣可化故云道器出家下次明能殺過深初明順行四等即慈悲喜捨於物無偏故四皆名等今下明違行上二句明結業次二句顯情過色心報命堪貯聖道喻若器焉下二句示制教。",
    "X39n0714_002:0835b01_0": "【疏】二釋戒名。",
    "X39n0714_002:0835b02_0": "【疏】古人云殺生戒者無論人畜約命是同今言大殺對後小害大則重夷小則輕墮故名也。",
    "X39n0714_002:0835b04_0": "釋大殺中初科又二初標古通濫今下明今列意據標大殺亦簡非人但文見廣解無別戒條且對九十揀異畜趣。",
    "X39n0714_002:0835b07_0": "【疏】故善見云生有二種一者色生二者無色生色生可壞無色生不可壞然無色生依於色生色心相依行者資稟成一假命今以刀輪壞彼色生無色生者相與俱壞使前不感後後不赴前斷報相續名之為殺。",
    "X39n0714_002:0835b12_0": "次科為二初引示色無色者即是五陰四陰皆心故言無色色即凝滑心謂業識此二相依乃成假命故竝名生然下正釋初釋生義上二句明心依於色色心下二句六字為句讀之此顯相依而成報命(依行古本作依住)今下釋壞義以刀為輪趣舉殺具如罽膩吒王為千頭魚劒輪遶身之類問上言無色生不可壞此云俱壞者答心依於色以色壞故識無所依故言俱壞不妨心識實無壞也前即過去心色既已斷滅故不感後後謂未來心色既不相續故不赴前。",
    "X39n0714_002:0835b22_0": "【疏】戒者能治之行能所通舉故曰殺戒。",
    "X39n0714_002:0835b23_0": "釋戒同前並以防過為戒故舉過相攬成戒名下皆同此更不釋也。",
    "X39n0714_002:0835c01_0": "【疏】故涅槃云眾生佛性住色陰中若壞五陰名曰殺生若有殺生即墮惡道色有三種過去現在則不可殺遮於未來故名為殺夫眾生者名出入息斷出入息故名為殺我等諸佛亦隨俗說說名為殺。",
    "X39n0714_002:0835c05_0": "引證中彼經佛說佛性常住不可斷壞故迦葉菩薩乃舉殺業以難今疏但引佛答耳但望壞五陰而得名殺亦由色陰滅故餘四隨滅是以下文正明三色過現不可殺者過去已往現色遷滅念念不停未滅則是未來已滅還成過去現色不立故不可殺遮未來者斷相續故眾生無實攬陰以成但有名字然識依息隨息斷續以分存亡故名眾生為出入息第一義中實無眾生逐陰求之尚無生相何況有殺但隨世諦說為業道非唯釋迦故云我等經文三段初引如來性品證前二生俱壞色下次引梵行品簡上所壞何色夫下復引梵行品後段明上斷報相續。",
    "X39n0714_002:0835c17_0": "【疏】第三成犯緣具有五種一是人道以餘道非重罪故二作人想三有殺心四起方便五明命斷。",
    "X39n0714_002:0836a01_0": "成犯緣中對下闕緣辨釋可解。",
    "X39n0714_002:0836a02_0": "【疏】第四闕緣義。",
    "X39n0714_002:0836a03_0": "【疏】若闕初緣小漫心起但得三蘭以非人畜杌三境替故大漫心起但得一蘭三趣隨犯俱無差故若對尅心加王異境來替張處則有四句可準上思。",
    "X39n0714_002:0836a06_0": "闕緣中初闕三別即大小二漫及剋心也大漫一蘭者以三趣齊害杌境來差心期雖漫望人從重故得蘭罪必對杌木起非畜想理應得吉非此所明在文蓋闕此中結句大漫一句杌作人想小漫三句一非人人想二畜生人想三杌木人想剋心中但加一句王作張想殺則同重餘三同前故云四句通前二漫總有八句。",
    "X39n0714_002:0836a13_0": "【疏】二闕想緣亦有小大兩漫及一剋心。",
    "X39n0714_002:0836a14_0": "闕第二緣初通舉三位一一位中各有想疑單雙之別如指略中。",
    "X39n0714_002:0836a16_0": "【疏】且對剋心生想有四句一夷三蘭也剋心生疑有十句一夷九蘭也謂直疑有四互疑有六亦可準知也。",
    "X39n0714_002:0836a19_0": "剋心中句法交亂須作圖相三位不同。",
    "X39n0714_002:0836b01_0": "【疏】剋心雙闕二緣四十句如王境差心對有十乃至杌木例可解也。",
    "X39n0714_002:0836b14_0": "通前三心總五十四句三夷五十一蘭圖中可見但知前二心差境定後一復加境差故號雙闕耳。",
    "X39n0714_002:0836b16_0": "【疏】餘大小漫心境闕相可以準知事稀故不能具列。",
    "X39n0714_002:0836b17_0": "指略中小漫但除王人則想有三句疑但九句雙闕除王境差但存三境亦各九句總前三位共有三十九句大略同上圖相唯直疑中各除第一句為異又通改張字為人字讀之準前易見不復重出大漫三境通害但有杌為異境止有一十三句復恐難曉故須列示。",
    "X39n0714_002:0836c07_0": "文中二意故略一可準前二以事稀故。",
    "X39n0714_002:0836c08_0": "【疏】三闕殺心或無罪如開緣中或得吉羅如打下眾雖死無心或得墮罪如打全破諸比丘等或得功德如看貧病死而無賞或得衣鉢如看富病以勞賞故或得偷蘭謂苦治人過與病藥近死方便但無殺心。",
    "X39n0714_002:0836c12_0": "闕心中六別並以或字間之初如戒本後注所列二三打分大小因打致死故明無心文言全破全即具戒破即毀戒四五看病分貧富此據如法看死故非害心六中兩相苦治即有過因罸而死與病藥即不好心看反令增病。",
    "X39n0714_002:0836c17_0": "【疏】四闕方便由未起故不制單心或得吉羅雖心緣殺以未動身尋悔故也或得輕重二蘭如十誦中病者多衣望死分得或厭患懈怠不看致死但結偷蘭以無方便故。",
    "X39n0714_002:0836c21_0": "闕方便中三初約無犯明闕言未起者未至重緣也次約犯吉明闕即約重緣遠方便罪三約犯蘭明闕下引十誦以示犯相望衣過輕理得中蘭不看近殺應犯上蘭故標云輕重也無方便者反有方便即攝夷重。",
    "X39n0714_002:0837a02_0": "【疏】闕第五緣未斷命如上七方便則具七蘭如十誦云殺人未死則狂發戒捨但結偷蘭。",
    "X39n0714_002:0837a04_0": "闕命斷中指上七緣下引十誦略證初緣。",
    "X39n0714_002:0837a05_0": "【疏】上明人趣非人畜生加害等同但罪輕為別耳。",
    "X39n0714_002:0837a06_0": "指例中非畜二殺並五緣犯具闕同之。",
    "X39n0714_002:0837a07_0": "【疏】第二非福田是恩養。",
    "X39n0714_002:0837a08_0": "【疏】初制意者人非化生業寄胎報攬彼遺分用成己身兼復鞠育其恩深重理應敬養報恩植福今反瞋忿乃如逆害違背恩養過咎極深故制逆罪又增夷重餘非恩養降階非逆。",
    "X39n0714_002:0837a12_0": "二非福是恩制意中初文先敘合敬若準俱舍人通四生今據多分故云非化遺分謂精氣也上明二恩一是成身二即鞠養備斯二種故云深重次明違反初明加害違下顯過言背恩者反上二種又增夷者害人罪也餘下簡異。",
    "X39n0714_002:0837a17_0": "【疏】問今殺父母為知得逆為不知耶答漫心無簡若對父母心雖不知以稱本期何無逆罪如善見中初有羺羊在於樹下後欲加害心乃漫緣隨有父人鬼畜來替羊處以心漫故亦結逆等若對剋心不知無罪故伽論云非父母想若殺得出家不犯逆。",
    "X39n0714_002:0837a22_0": "初問由諸論中所出各異故問決之答文初約漫心成犯謂不簡親疎心通害故若對下次約剋心不犯各引文證二段顯然論明戒障故約出家明之。",
    "X39n0714_002:0837b02_0": "【疏】問父母出家成羅漢道若有殺者為得幾逆。",
    "X39n0714_002:0837b03_0": "次問亦由教中單重不定故須詳審。",
    "X39n0714_002:0837b04_0": "【疏】答如十誦中得一夷二逆又涅槃云一殺父王二殺須陀洹罪兼二重以斷父命恩養福田心懷二境二俱損故。",
    "X39n0714_002:0837b07_0": "初答中先引經律以下次顯重意涅槃三十三云羅閱耆王頻婆娑羅其王太子名曰善見業因緣故生惡逆心閉父城外乃至遮斷衣食湯藥過七日已王命便終太子生悔大臣惡邪謂言無罪耆婆復言大王當知如是業者罪兼二重等頻婆娑羅已證初果故云須陀洹也(若準觀經進成三果此據爾前故云初果耳又據成逆定約四果經通四聖與律不同)。",
    "X39n0714_002:0837b14_0": "【疏】如俱舍論殺父羅漢得一無間依止一故。",
    "X39n0714_002:0837b15_0": "次答中俱舍名五逆為無間業義如下釋依止一者無別命故但據殺父止結一逆。",
    "X39n0714_002:0837b17_0": "【疏】問如上涅槃如何通耶答為顯無間二因而成命既是一何得二罪直以逆名標此業重故言二逆其實無也。",
    "X39n0714_002:0837b20_0": "會通中答文為二初示涅槃之意命下次顯無重之理然別造多逆則隨業別受準俱舍中皆次生熟涅槃中作一逆者則便具足受一罪若造二逆則二倍五逆具者罪亦五倍。",
    "X39n0714_002:0837b24_0": "【疏】因斯明律結罪多少約緣業四位不同。",
    "X39n0714_002:0837c01_0": "因明中上明夷逆雙結律中率多此例故寄此以明文約緣業二種俱互四句一一句中各有一多二位緣即事緣業指身口。",
    "X39n0714_002:0837c04_0": "【疏】初業一緣異結多罪如二房咽食等謂妨難過量不乞殘宿惡觸總為緣也身口二業隨作隨咽得多罪也即結一罪者如謗假妄如盜掘地無別提罪相從究竟。",
    "X39n0714_002:0837c08_0": "初句前明多罪先明緣異且舉房食房具四緣食容多犯鈔云一咽七罪非時不受殘宿內宿內煑自煑惡觸並隨有者言之身下明業一然上房食並是身業而云二業意令例通如謗清人又欲誑僧之類殺父羅漢此句所收即下次明一罪善見謗假妄成無別妄罪為盜掘地方便蘭罪若準五分掘地亦提。",
    "X39n0714_002:0837c15_0": "【疏】二緣一業異結多罪者如一人前後加打隨打隨提亦結一罪如盜前後相假成也。",
    "X39n0714_002:0837c17_0": "次句初多罪中一人是緣隨打是業亦下明一罪前境是緣前後盜業是但前方便終趣一果。",
    "X39n0714_002:0838a01_0": "【疏】三緣業俱異結多罪者如前後殺盜人別罪異也亦結一罪者如尼八事前後成重。",
    "X39n0714_002:0838a03_0": "第三句多罪中人命他物是緣隨作是業一罪中隨對男子是緣八事有別是業。",
    "X39n0714_002:0838a05_0": "【疏】四緣業俱一結多罪者如發一語具口四過也亦結一罪此則竝易不勞出也。",
    "X39n0714_002:0838a07_0": "第四句多罪者即多論云傳他此語向彼說以不實故是妄語作分離心故是兩舌非輭語故是惡口成論云綺語一種必不相離文中且舉具者言之三二亦爾一罪中各戒各犯故云竝異(或作易亦通)。",
    "X39n0714_002:0838a11_0": "【疏】餘有約緣具闕竝可準前。",
    "X39n0714_002:0838a12_0": "指略中令準前者亦具五緣一是父母二父母想三有殺心四興方便五命斷闕緣亦同尋上對之。",
    "X39n0714_002:0838a14_0": "【疏】第三殺羅漢者末代所稀理何須舉然經律中多有逆相識知其事用為後習明覺開達終因此緣故略明之。",
    "X39n0714_002:0838a17_0": "第三句中先示須出之意在事雖稀於教須識言後習者由今學知以為識種後遇勝緣夙智開發故云明覺等此緣即今所示。",
    "X39n0714_002:0838a20_0": "【疏】言制意者是應供故名福田非懷育故非恩養欲明此人斷結成聖八輩僧寶第一福田慈濟物故俯從供養理須植因用收聖果反懷逆害損喪聖身自既失利障他弘福情過是重故制逆罪餘七輩僧道非究竟故感福微殺同凡罪自可聖行約業非輕。",
    "X39n0714_002:0838b01_0": "制意中初示句欲下正敘初敘境勝合敬四果四向為八輩俯猶下也反下次明損害制罪自不加敬是失自利斷他勝田即失他利餘下簡去餘聖上四句正簡下二句釋疑上云同凡且據制罪凡聖位別業必重輕。",
    "X39n0714_002:0838b06_0": "【疏】問如十輪經殺辟支佛不同羅漢者答以聲聞人因聲入道一能說法二能現通三令他得道益深利廣故結夷逆辟支不爾故殺同人如涅槃云緣覺之人志樂獨處若化眾生但現神通終日默然無所宣說不能說法令人得果以此文證福田狹故。",
    "X39n0714_002:0838b11_0": "初問中彼明殺支佛不障戒今以斷證是同福田亦等故須問決答中先明聲聞具三能故重下明支佛不具故輕後引大經證闕二能然支佛有二一者出無佛世則名獨覺二者觀十二因緣得道則名緣覺如上所釋且據大途不妨緣覺善能化物自有聲聞不堪說法。",
    "X39n0714_002:0838b17_0": "【疏】問殺下三果何不犯逆答惑未盡故福田不滿故善見云若殺白衣阿羅漢不得出家殺三果者不障出家。",
    "X39n0714_002:0838b20_0": "次問立義引證文甚易解。",
    "X39n0714_002:0838b21_0": "【疏】若爾犯四果尼可是障戒下三果犯不應障答殺望福田故逆不逆異犯尼事通凡聖壞淨境故。",
    "X39n0714_002:0838b23_0": "轉難中汙尼障戒事實不同欲辨殺汙兩別故立此難但殺損福田故不通下位汙取境淨而不局聖人。",
    "X39n0714_002:0838c02_0": "【疏】問若殺辟支不入逆者何故涅槃知殺有三蟻子畜生為下凡夫三果為中羅漢辟支菩薩為上答彼以約境分心故分三位不明逆夷輕重等相若不爾者即彼文云闡提不墮三種殺中可無罪耶約律中從境闡提人夷約經論闡提無性也。",
    "X39n0714_002:0838c07_0": "三難中即據涅槃轉難初答經明佛及菩薩皆了知殺法故云知殺羅漢上準經有父母二字今此正問辟支故略之耳經文既以三乘同為上品則知緣覺罪無差降答中初出經意經分心業不揀夷逆準此若殺辟支雖非逆重由境尊勝業異常流若不下就經反質初引示經文梵云一闡提此云信不具不墮三殺者由殺無罪不入三品故經云譬如刈草掘地等無有罪報約下比對律制言無性者準經前明闡提無佛性據後決前此名隨他語一切有性名隨自語。",
    "X39n0714_002:0838c17_0": "【疏】問若殺羅漢為知得逆為不知耶答俱舍云若於非聖而行殺害後臨殺時成羅漢者無無間業以於羅漢不起殺故若起漫心具緣諸相竝如前說。",
    "X39n0714_002:0838c20_0": "四問可解答中先引論明剋心不成若下次約義立漫心成犯大同父母故並指前。",
    "X39n0714_002:0838c22_0": "【疏】第四惡心出佛身血者。",
    "X39n0714_002:0838c23_0": "【疏】垂降生善為世福田慈濟含識亦是恩養佛為法王四弘開化惠益群品其恩無外宜應敬養植福清心反加瞋忿興於逆害命不可斷但出身血損法身器其過尤深故制方便業當逆罪。",
    "X39n0714_002:0839a03_0": "第四句制意中初科為二初示句佛下正敘初明恩深合敬四弘即上四等弘即訓大亦由普徧故得名耳恩無外者所被無遺故反下次顯過明制損法身器者多論云色身是法身所依故制方便者即偷蘭也佛不可殺義無究竟制輕業重相別可知。",
    "X39n0714_002:0839a09_0": "【疏】然出身血其相是一心懷善惡同一業報耆域出血善心治病一劫色有而受樂報調達反此故入地獄恐濫善者故標惡心。",
    "X39n0714_002:0839a12_0": "次科初明相濫同業報者此約時論並一劫故耆下次引緣釋耆域亦云耆婆善醫世尊足疾因針出血色有即梵天此明善心也調達以推山壓佛碎石傷佛指足生陷阿鼻此明惡心也恐下後示簡意。",
    "X39n0714_002:0839a17_0": "【疏】問不知是佛不得逆者若供不知不應得福答供本漫心生福皆敬雖對佛身作樹神想以心通故佛邊得福若本剋心對佛神想則無福也。",
    "X39n0714_002:0839a20_0": "問中準前合須先問約知不知或可承前羅漢義勢是同故直發此問答中亦約剋漫二心分之。",
    "X39n0714_002:0839a22_0": "【疏】餘具緣等同前準說。",
    "X39n0714_002:0839a23_0": "指具緣中亦同上五故不繁文。",
    "X39n0714_002:0839a24_0": "【疏】就闕緣中有同有異闕初境緣四句俱同皆異境來替佛本故雙闕亦爾若闕想疑二句不同以佛正命必不斷故既明出血本結偷蘭境雖極尊約從人制境強方便故也。",
    "X39n0714_002:0839b04_0": "闕緣中初總標闕下別釋初明同有二一境差同一人作佛想二非人佛想三畜四杌四句並蘭二示雙闕同若下次辨異闕想四句疑心十句此二初句前並犯夷今同蘭罪以下出異所以。",
    "X39n0714_002:0839b08_0": "【疏】因即料簡五逆之義四門分之初列數顯相釋名輕重二定體狀初二懺不三約三業四明通塞。",
    "X39n0714_002:0839b10_0": "【疏】初列數者父母羅漢出血壞僧為五也。",
    "X39n0714_002:0839b11_0": "明五逆中初文可解。",
    "X39n0714_002:0839b12_0": "【疏】顯相者要約親生膝下故恩養極也如世律中惡逆過者通祖父母世叔等親何況假父後母姑姨之屬則並非逆所以經律據二惟親。",
    "X39n0714_002:0839b15_0": "二顯相中又二初簡定且約二逆餘同前敘或可餘三無濫不須辨相膝下者語出孝經謂孩幼之時也如下引俗示濫祖父母即父之父母世叔及伯即諸父也假父後母皆本非親同名為逆望上祖等此二又親故云何況姑姨非逆族姓異故所下結前簡意。",
    "X39n0714_002:0839b21_0": "【疏】言釋名者何故名逆以違恩養福田極故亦違佛世兩王化故名之為逆如論所出云五無間謂常續有無間隔故。",
    "X39n0714_002:0839b24_0": "釋名中初科逆有二義初違恩福父母違恩羅漢破僧違福出血兼二次違王化佛是法王世即人王二教齊禁犯則俱違華梵雖殊法律無異然於五中唯殺父母道俗同重餘三則別。",
    "X39n0714_002:0839c04_0": "【疏】如成實云一趣果無間捨身生報故二受苦無間中無樂故三時無間定一劫故四命無間中不絕故五形無間如阿鼻相縱廣八萬由旬一人多人皆徧滿故不相障礙業不可思。",
    "X39n0714_002:0839c08_0": "次科論即俱舍釋義猶通成論五義示相甚顯三意束之第一即間隔也二及三四謂間絕也第五即間缺也然形無間一多不礙凡情難信故云業不可思。",
    "X39n0714_002:0839c12_0": "【疏】問三寶皆福田損佛破僧得論逆者何故不言破法逆耶。",
    "X39n0714_002:0839c14_0": "初問三寶福田是同成逆則異故問釋之。",
    "X39n0714_002:0839c15_0": "【疏】答謗法重故不入逆中如今五逆不入四重廣如智論及法華中。",
    "X39n0714_002:0839c17_0": "答中初約業重釋如下舉例廣下指證智論云聲聞道作五逆受地獄一劫菩薩道破佛法此間劫盡復至他泥犁中受無量罪如是乃至徧於十方地獄等法華譬喻品後廣明謗經獲罪之相乃至云其人命終入阿鼻獄具足一劫劫盡更生如是展轉至無數劫從地獄出當墮畜生等。",
    "X39n0714_002:0839c23_0": "【疏】有人言謗法重者謂大乘也對田論逆即壞法輪破法逆也。",
    "X39n0714_002:0840a01_0": "次他解中初科又二初點前義對下示正解就小論逆指歸破僧則通三寶。",
    "X39n0714_002:0840a03_0": "【疏】問若如此者何故毀呰修多羅但吉答前言逆者謂破滅故今言犯吉但毀呰耳。",
    "X39n0714_002:0840a05_0": "次難中毀毗尼戒毀餘二藏皆同吉羅上云成逆義則相違答釋可解。",
    "X39n0714_002:0840a07_0": "【疏】若但破僧不名為逆如破羯磨以損輕故若殺羅漢是損真僧以違福極故得逆也。",
    "X39n0714_002:0840a09_0": "三中初約破僧反顯若單破僧既不成逆則顯逆業全由破法若下次引殺聖比例由殺羅漢亦望損彼真福田僧故成逆罪則知破僧一逆法在其中故不別標也。",
    "X39n0714_002:0840a13_0": "【疏】次明重輕如前列者初輕後重故成論云破僧最大惡別離三寶故離僧壞佛毀法寶故又於佛所起嫉妬心違轉正法復惱大眾乃至三十界內禪誦不行故。",
    "X39n0714_002:0840a16_0": "輕重中指前所列且據麤分細而明之中間三逆望前為重望後名輕所以害母重於父者以佛教中懷育恩多偏尊母故羅漢超凡必重父母出血極尊義過小聖下引成論獨證破僧文有二義初約壞滅損境明重又下次約起心違惱明重禪誦即諸觀法一化境中道行退失或復不進故云不行上約業理不論制教。",
    "X39n0714_002:0840a23_0": "【疏】二定體狀初二及懺相。",
    "X39n0714_002:0840a24_0": "定體中標列三科次云初二即明逆罪最初第二。",
    "X39n0714_002:0840b01_0": "【疏】言體狀者如五逆名非佛所制違恩福故業理自重有夷蘭者是佛制也但約人相犯夷不論恩福不具得蘭從殺方便若論破僧應制極重以事不獨建通攝三人故也。",
    "X39n0714_002:0840b05_0": "初科以業制相濫故須揀定初示業體五逆之罪但違業道古法常有故非佛制有下次定罪體即約制教初通示夷蘭二聚統收五罪三夷二蘭但下別釋又二初釋三夷得下釋二蘭破僧攝三人者舊引義鈔云破僧有三一王破二伴破三助破。",
    "X39n0714_002:0840b10_0": "【疏】言無初者以逆犯相無略可違以外道殺父佛言滅擯可是違教餘如後說。",
    "X39n0714_002:0840b12_0": "次科初約義以定以下舉事釋成文出受戒法中以凡開最初必違略教俗非稟略亦令擯之故知約行偏重隨作即成極業如後即破僧戒。",
    "X39n0714_002:0840b15_0": "【疏】言可悔不者如大乘中開悔五逆若爾何故經中令王重罪微薄耶答罪無定也即如彼經有愧非有無慚非無或可本定故轉輕耳餘之三夷兩蘭皆可滅除學悔說故十誦九清淨人破僧偷蘭罪從僧懺文自驗矣。",
    "X39n0714_002:0840b20_0": "三中初示懺業上二句判定可懺大乘即佛名方等通懺三世十惡五逆又鴦掘摩羅作五逆因值佛得滅等若下引難經即涅槃上據大乘立義故還引大乘為難闍王殺父阿鼻一劫佛令懺已於黑繩地獄七日受盡既但轉重令微則顯逆非可懺答中二意初引彼經有無不定約心明業雖悔復受理無所疑或下示次意既轉令輕明開成悔餘下次明懺制初判定學悔下引證初證懺夷律令學悔開懺不疑十下次證悔蘭邪正各五方成破僧真佛位別不入僧數故云九人邪徒破僧皆犯蘭罪今既邪正通名清淨故知開悔從僧懺者上品罪故。",
    "X39n0714_002:0840c08_0": "【疏】三明業相者。",
    "X39n0714_002:0840c09_0": "【疏】破僧是口業餘四是身業若互作者有語助成若論破僧身現不得必須言說用化前人能破是口不善業所破是不和合性。",
    "X39n0714_002:0840c12_0": "業相中初科又二初明各造俱舍頌云此五無間中四身一語業三殺一誑語一殺生加行(加行即方便)若下次明互造上明口兼身四若論下次明身不兼口文中能所對明所無別體即是事理二種不和故指為性性即體也。",
    "X39n0714_002:0840c17_0": "【疏】破僧瞋嫉心起餘四分通三性。",
    "X39n0714_002:0840c18_0": "二中初明破僧調達見佛人天奉敬頻婆國王日給千車遂起嫉心結連闍王以謀害佛又於佛所乞請攝眾為佛所呵即懷瞋恨此明破僧局不善性餘下示餘四殺通三性四逆同之然本是不善性旁兼善無記故示分通也。",
    "X39n0714_002:0840c23_0": "【疏】破僧雖口說言了未結罪要待前人忍方成其破輪也。",
    "X39n0714_002:0841a01_0": "三中以餘口業吐詞即結破僧特異故別顯之出血不至果餘三同殺命斷成犯故不須論。",
    "X39n0714_002:0841a03_0": "【疏】四明通塞者時處人分別。",
    "X39n0714_002:0841a04_0": "通塞中三科料簡有則名通無者號塞。",
    "X39n0714_002:0841a05_0": "【疏】佛在具五滅後惟三無法輪主故。",
    "X39n0714_002:0841a06_0": "初中佛在俱通滅後三通二塞法輪雖在無主競化故二俱闕。",
    "X39n0714_002:0841a08_0": "【疏】二言處者南洲具五東西俱三出血破僧須佛身故北洲俱無雜心云以命定無相殺故。",
    "X39n0714_002:0841a10_0": "次科若論有無則三洲有北洲無若約具闕則南洲具東西闕下引心論引證北洲言命定者長含中修十善行生鬱單越壽命千歲不壞不滅是故彼人壽命常定。",
    "X39n0714_002:0841a14_0": "【疏】三言人者俗人及四眾唯四逆除破僧故比丘具五可知俱舍云北洲及餘道皆無無間業何況於餘界解云人道男女能作此業黃門等不許彼無戒因父母於其恩少由不具身分為增長故愛念少故又其於父母不起重慚差故畜生鬼神道不許有無間業故若智明了如聰慧馬有五無間也。",
    "X39n0714_002:0841a20_0": "三中初正明俗人無濫下眾未具無破僧理故但有四亦通伴助如後所明俱下引論初引論偈餘界即色無色天次引論解前簡人道別除黃門文列三義初無戒因者以具戒者方能具造黃門當體即戒障故次父母下明上恩疎增上謂身不具形報非勝故又下顯下敬薄故有殺者不成逆業然文中但明父母二逆餘不能作於義可知畜下簡餘趣文約愚智以明有無據論有者可對三逆豈有非畜而能破僧出血耶論無五字必是傳訛。",
    "X39n0714_002:0841b05_0": "【註】佛在毗舍離為諸比丘說不淨觀。",
    "X39n0714_002:0841b06_0": "【疏】就戒緣中說不淨觀行不得方。",
    "X39n0714_002:0841b07_0": "戒緣中初標緣方即法也。",
    "X39n0714_002:0841b08_0": "【疏】言不淨觀者如來立藥對治心病多貪不淨瞋以慈心癡不覺了陰界分別初對貪者故云不淨。",
    "X39n0714_002:0841b10_0": "次科總明中初通示三種藥病陰即五陰界即十八界文略十二入配對三迷如前已示若對五停前二同此三愚癡多觀十二因緣四我慢多觀十八界(此二可對第三)五亂想多數出入息(即當後觀)初下別指今文。",
    "X39n0714_002:0841b15_0": "【疏】如智論說具有五種。",
    "X39n0714_002:0841b16_0": "【疏】一種子不淨攬父母形以為己有故偈云是身種不淨非餘妙寶物不由白淨生但從穢道出。",
    "X39n0714_002:0841b18_0": "引示中初不淨中論云父母以妄想邪憶念風婬欲火故血髓膏流熱變成精宿行因緣識種子在赤白精中住是名身種偈中初句標示下三句釋成上句明當體不淨下二句生出不淨穢道即父母便利處也。",
    "X39n0714_002:0841b23_0": "【疏】二依處不淨謂在生熟兩藏中間故偈云是身為臭穢不從華間生亦不從薝蔔又不出寶山。",
    "X39n0714_002:0841c01_0": "第二依處亦名生處人有生熟二藏食在生藏猶未變動流入熟藏即成糞穢胎處于中故云不淨偈中初句標下三句簡非淨處以顯不淨薝蔔亦花而別舉者以花極好彼國所貴經論多引蓋此意也此翻黃花。",
    "X39n0714_002:0841c06_0": "【疏】三當體不淨謂三十六物成身十二內外兩相各十二也故偈云地水火風質能變餘不淨傾海洗此身不能令香潔。",
    "X39n0714_002:0841c09_0": "三當體者亦云自性三十六物論中備列總判為三而少不次今以義分髮毛爪齒薄皮厚皮筋肉骨髓血心(此名成身十二如論云中有十二通於內外)脾腎膽肝肺小膓大腸胃胞(匹交切合作脬水府也)肪(音方膓脂也)[狦-(狂-王)+月](音珊胃脂也)腦膜(此內十二論云內有十二名性不淨)屎尿垢汙淚涕涎唾膿黃白痰癊(此外十二論云外有十二名相不淨)偈中上句示體次句明流變餘不淨者總上諸物下二句顯示不淨。",
    "X39n0714_002:0841c16_0": "【疏】四外相不淨者九孔常流俱不可用故偈言種種不淨物充滿於身中常流溢不止如漏囊盛物。",
    "X39n0714_002:0841c18_0": "四中九孔眼耳鼻口及大小道偈中上二句明內穢下二句示外相。",
    "X39n0714_002:0841c20_0": "【疏】五究竟不淨終歸死膖不可忍見故偈言審諦觀此身終歸必死處難御無反覆背恩如小兒。",
    "X39n0714_002:0841c22_0": "第五論云身若投火則為灰若虫食則為屎在地則腐爛在水則膖脹偈中上半標示下半釋成時至莫留故云難御奄然長往故無反覆生存資養一旦捨故云背恩小兒相似法故。",
    "X39n0714_002:0842a02_0": "【註】彼習定已厭患身命歎死勸死。",
    "X39n0714_002:0842a03_0": "【疏】注云彼習定已厭患身故歎死勸死者以修乖方少於遣滯故習此觀封著不捨便滅其身此非有智。",
    "X39n0714_002:0842a05_0": "三中初科智能遣滯有修無智即是乖方。",
    "X39n0714_002:0842a06_0": "【疏】善見云佛是一切智人何因說觀乃令其死答深見往機曾作獵師多殺群鹿已墮地獄餘報出家若不說觀人殺生惱惡心無已由作此觀人殺生喜得生天上故無咎也乃至說已入靜室中五百人死同世不知知必制戒息世機故。",
    "X39n0714_002:0842a11_0": "引示中如來大智鑒機授法藥病不差今此殺緣全乖上義論申佛意以決群疑相似差機實唯應病答中初敘知機獲益乃下明示現不知佛自明鑒示同凡人故云同世若不如此必生外謗故云息譏。",
    "X39n0714_002:0842a16_0": "【註】難提比丘受雇殺人居士警怖。",
    "X39n0714_002:0842a17_0": "【疏】言難提受雇者善見云是外道沙門也頭留少髮依比丘住拾殘食活。",
    "X39n0714_002:0842a19_0": "雇殺中注稱比丘疏號沙門由此二名通邪正故留少髮者表異內眾亦著壞色衣一以覆身一置肩上問此戒犯緣為是何人答據下呵責乃斥相歎內眾比丘外道受雇非緣起也。",
    "X39n0714_002:0842a23_0": "【註】佛知此事便說禪法。",
    "X39n0714_002:0842a24_0": "【疏】言佛知此事便說禪法者數息觀也。",
    "X39n0714_002:0842b01_0": "釋改觀中初科禪法亦即觀門故以觀釋但止心名禪照境為觀不淨數息並具二門而注文前後異者以不淨正取照境數息偏在止心故也。",
    "X39n0714_002:0842b04_0": "【疏】所以改觀者前對多貪故說不淨思覺之人本非彼治故說數息或前觀色是麤今觀心是細也。",
    "X39n0714_002:0842b06_0": "顯意中有二初約機宜對病加藥或下次就所觀以分麤細了色求心先麤後細自淺至深故宜改也。",
    "X39n0714_002:0842b09_0": "【疏】就明數息如論廣之一數二隨三止四觀五還六淨並息亂法以漸調心。",
    "X39n0714_002:0842b11_0": "示法中大小乘論並有觀法故今通指但云如論今依成論釋云數者名出入息從一至十數有三種若等(十數為十)若過若減(並乖數法)隨者心隨息出入止謂令心止住出入息也觀謂見息繫身如珠中縷還亦云轉謂轉身緣心令心現前淨謂離一切煩惱諸難心得清淨並下總結觀意。",
    "X39n0714_002:0842b17_0": "【註】比丘修習並證上果因訶上過而制此戒。",
    "X39n0714_002:0842b18_0": "【疏】言修獲上果者即聖無漏在凡之上也。",
    "X39n0714_002:0842b19_0": "獲果中聖無漏者言通四聖。",
    "X39n0714_002:0842b20_0": "【疏】問如來說法比丘依行深見不淨正是如說有何等過復見訶責答佛說不淨令厭苦本若欲修斷必識身因如何未斷集因即除苦本非唯果不可盡乃使迷因轉深故使修行非道大可訶也如經說身有苦不說厭離於身斯良證矣。",
    "X39n0714_002:0842c01_0": "呵責中問中隨順無違反遭呵責義似非當故問決之答中為四初明教旨如何下顯過今亦有僧不知所以自投焚溺欲冀超昇苦因未除寧亡三有之報死而無悔實唯一勇之夫將謂永滅不生焉知此沒彼出固當勤修三學廣運四弘誦持方等大乘繫念諸佛嘉號冀龍花而得度指安養為所歸深厭死生善識因果欲除苦本其要在茲故使下明合呵如經下引證通標經者大小皆明不可別指遺教云此是應捨罪惡之物乃至云唯有智者得除滅等問五百已死誰當呵者答受行觀法讚勸必多論明五百且據已死為彼改觀即所呵者。",
    "X39n0714_002:0842c13_0": "【疏】二就戒本中文有六句初句能犯過人二故自手者明是自業三人命所殺境界四持刀下明教他業是比丘下將人附罪入治擯相。",
    "X39n0714_002:0842c16_0": "【律】若比丘故自手斷。",
    "X39n0714_002:0842c17_0": "【疏】初句可解。",
    "X39n0714_002:0842c18_0": "【疏】二自殺中而言故者除有悞者非犯法也。",
    "X39n0714_002:0842c19_0": "次釋戒本第二句。",
    "X39n0714_002:0842c20_0": "【註】所謂行殺也若自殺若教殺若遣使殺若往來使殺若重使殺若展轉便殺若求男子殺若教人求男子殺若求持刀人殺若教人求持刀人殺若身現相若口說若身口現相若教使歎若遣書若教遣書若坑陷若倚撥若與藥若安殺具及餘方便殺者是也。",
    "X39n0714_002:0843a02_0": "【疏】注中廣列所行殺相相分為二初自殺有八一自殺二身相三口說四身口俱五坑陷六倚撥七與藥八安殺具就教他中有十一初遣使二往來使三重使四展轉使五求人六教求人七求持刀八教求持刀九遣書十教遣書十一遣使歎也。",
    "X39n0714_002:0843a07_0": "釋注總分中不依文次以類括之。",
    "X39n0714_002:0843a08_0": "【疏】言自殺者謂自行殺若身若杖隨死皆是。",
    "X39n0714_002:0843a09_0": "自殺可解。",
    "X39n0714_002:0843a10_0": "【疏】言教殺者或教人殺或但教人死之方便言遣使殺者指示所殺在其方所而往害也言往來使者受語往害至彼還來重復往者是也言重者隨續使人乃至百千害一人者言展轉使者初使往害彼使不去更使人往如是展轉乃至百千最後一人斷彼命者隨前而使皆同一重乃至上列往來重使皆例同犯餘有契要不同心不如意竝如前竪義中說下有四求皆教人相。",
    "X39n0714_002:0843a18_0": "教人八種據文似九前總分中不列教殺則知注中此句通標下列別相耳展轉中乃至下決通前二例皆同犯遣使可知故不點之餘下指餘不同如前者即自作教人門中或能教者剋所使意異或時節早晚坐立乖契顛狂捨戒等教者不犯漫心無寄隨作皆犯下下略示四求求男子者謂欲得勇士往害於他持刀人者即旃陀羅輩兩是自求兩令人求並非自殺故云皆教人者。",
    "X39n0714_002:0843b02_0": "【疏】言身現相者或令怖畏墜墮溝壑或示死相等言口現相者或以言說歎勸其死或以大聲恐喝令他死者即如世中有厭身者或投火墜巖或刀解繩縊不知教者合掌唱善或扶接登山或為辦繩具斯即教歎正符犯法身口俱現即此之流。",
    "X39n0714_002:0843b07_0": "現相中身現二義初示可畏之容二作取死之狀口現亦二如文自分即下後釋俱現初舉現事決犯縊於計反扶接登山者助彼投巖也斯下結合文相教即扶接辦具對下身現歎即合掌唱善對下口現。",
    "X39n0714_002:0843b12_0": "【疏】言教使歎者遣人語彼人令彼語所殺者生多眾罪不如早死之詞。",
    "X39n0714_002:0843b14_0": "教歎中初示教相生下出其歎詞即戒本中惡活寧死二句耳。",
    "X39n0714_002:0843b16_0": "【疏】言遣書者身現其相表於紙墨令用死者如多論中若優婆塞及以比丘知吉凶相令破異國隨得財命皆同殺盜重罪若作死書教使送彼使向親說使自得重遣者犯輕使自依死犯輕亦爾若作死經有人偷讀遺失拾得依經取死造者犯重言教遣書者自不親對遣人作書令彼受死無問自他若死俱重五分作書時字字蘭。",
    "X39n0714_002:0843b23_0": "遣書中前明死書初示相言身現者謂書中所述也如下次引明若據論中未定遣書然吉凶之相容可書報故引釋之若下辨犯使向親說不以書示也及使自害並由能教心克乖本所期但得蘭罪故云犯輕若作下次明死經偷讀拾得死皆重者由本造時漫心無簡故教遣書中初明犯相五分下引示方便彼立進趣故約字論。",
    "X39n0714_002:0843c06_0": "【疏】言坑陷者知人遊行必從此道故設坑穽令墮死也十誦云為人作坑人從死重非留死蘭為畜造坑畜死提人死吉若不定者隨人畜死重輕如律言倚撥者審知彼人倚撥其處便施刀杖彼依而死者言與藥者文事可解言安殺具者即如世中行刑之所比丘往看施其繩索令彼死者同重多云若為殺故造刀杖者吉羅往趣彼人步步輕蘭或著彼身命未斷重蘭。",
    "X39n0714_002:0843c14_0": "殺具中坑陷又二初示相穽音靜亦坑也十誦下引釋初約三趣互論輕重即是小漫合有為非人作坑人畜死吉稀故不明下云不定乃約大漫隨犯可會倚撥者謂潛安殺具令彼觸動也安殺具者置辦器杖令彼自用即下決其世事多論下示其方便。",
    "X39n0714_002:0843c20_0": "【疏】文言及餘方便者非謂如上所列而言相盡更餘方便律雖不載但依而死皆是重攝。",
    "X39n0714_002:0843c22_0": "顯略中初文律不載者謂不盡也。",
    "X39n0714_002:0843c23_0": "【疏】又欲遮惡比丘避於佛制如上網目所不攝者欲加殺害故又張網總而收之欲獲罪人實唯一目故俗云天網恢恢疎而不漏是也。",
    "X39n0714_002:0844a02_0": "次科又張網者謂此一句統收多相猶如張網後必有犯止在一事猶如得魚故云一目下引俗證出老子道德經恢大也謂天道雖大不容於惡如網雖疎不漏於物。",
    "X39n0714_002:0844a06_0": "【疏】問如汝所釋浪作分疎至如佛意何必如此答凡心度佛誠非擬議然佛立教自有比量如經比智用擬上位何以知然如律文中佛制比丘不得服用俗人外道衣服遂即方便更作餘相佛即訶言汝等癡人避我所制更作餘事自今已後一切俗人外道衣服竝不得著著者如法治據此明證豈非通約也。",
    "X39n0714_002:0844a12_0": "問中欲引後量假設來難答中初二句承意然下正答西土論議其量有三一現量(理義顯然)二比量(舉事相並如今引例)三正教量(三藏明文)因明論云藉眾相而觀於義於所比義有正智生故名比量言比智者成論云知餘殘法思量比知名為比智又云未得真智以相比智經論皆說故通指如經何下引量即衣犍度文一切之意正符前釋。",
    "X39n0714_002:0844a19_0": "【律】人命。",
    "X39n0714_002:0844a20_0": "【疏】言人命者謂殺境也。",
    "X39n0714_002:0844a21_0": "【疏】所言人者仁也仁者忍也俗中釋名大有意致亦可尋也謂人立志存育為先故云人仁也若但言人而人有無命者害非重罪故又重列言其人命也。",
    "X39n0714_002:0844a24_0": "第三句釋人中初訓字俗下示所出釋名即劉熙撰彼云仁忍也好生惡殺善惡含忍也謂下釋義天陽之氣資始萬物人有推愛及物博施濟眾合天之道得人之正故云存育等若下明重言之意。",
    "X39n0714_002:0844b04_0": "【疏】所言命者謂此身報假之維持終於一形壽所因本故謂命根以命持識令依住故如雜心中命根體者非色非心良由眾生往業所剋期在此形連持不絕故今死者氣雖斷絕隨有暖處識在其中即識住處為命根攝。",
    "X39n0714_002:0844b09_0": "釋命中初科為三初釋名壽無別體即命短長以為人壽故云因本能持於識為壽之本故得名根如下示體以無形段復與識異故二非攝良下顯相先敘業感故下正示命相由煖識息三種相依故有煖處息識未捨生分未絕即為命矣。",
    "X39n0714_002:0844b14_0": "【疏】然今殺者命根非色何由可殺識本無形殺亦不得故隨相說斷其依處命根不續識無所依故云殺也。",
    "X39n0714_002:0844b17_0": "次科云依處者即色生也。",
    "X39n0714_002:0844b18_0": "【疏】律經約相但言識者以命根相不可見聞依聖言說信而為有若論識者愚智齊知但殺前生無識能學即為死人也麤相易曉持犯不難隨機之義復現茲矣。",
    "X39n0714_002:0844b22_0": "三中初牒問律經即律戒本如注所引以下釋通初明不約命根若下次明但言二識麤相等者正出戒經之意去難取要令物易解故云隨機。",
    "X39n0714_002:0844c01_0": "【註】從初識至後識而斷其命。",
    "X39n0714_002:0844c02_0": "【疏】言初識者謂初託陰止是凝滑不淨故經中說為迦羅之時也如五分云入胎四十九日名日似人過是以往乃名是人即五王經云受胎一七日如薄酪二七日如稠酪三七日如凝蘇四七日如肉團五七日五胞成就六七日已後六情開張。",
    "X39n0714_002:0844c07_0": "初識中經即涅槃彼云肉身處胎歌羅邏時亦云迦羅此云薄酪智論云受胎七日赤白精和合時也次引五分似是兩分續引五王釋上似相五胞頭及手足也不云七七者即同上引名似人故。",
    "X39n0714_002:0844c11_0": "【疏】言後識者即最終時在後一念為後也。",
    "X39n0714_002:0844c12_0": "後識中云一念者即前所謂有煖處也。",
    "X39n0714_002:0844c13_0": "【疏】所以言此二識者亦為遮惡比丘念也若殺人者可得重罪如胎分中迦羅邏者即既非人故不名犯所以張網通收初後若有胎人識所依止隨有損害無非極刑即如五分若人似人意亦可見四分下文墮胎等相。",
    "X39n0714_002:0844c18_0": "出所以中先徵次釋初略示前用此義釋餘方便故云亦也若下委釋初敘彼避制所下結顯教意五分兩相皆重正為通收故云可見四分下文即調部云婦人他邊得身語大德言與我藥墮之比丘即呪藥與令其胎墮佛言波羅夷及按腹墮胎亦夷故云等也。",
    "X39n0714_002:0844c24_0": "【律】持刀與人歎舉死快勸死咄男子用此惡活為寧死不生作如是心思惟種種方便歎譽死快勸死。",
    "X39n0714_002:0845a02_0": "【疏】言持刀下此教殺相就分為二初持刀者教殺歎譽死者口業也。",
    "X39n0714_002:0845a04_0": "第四句初科但分身口戒本難曉略為釋之文敘殺相先持刀與次乃口勸咄下出其勸詞欲警令悟故先咄之惡活者或現不淨或能造惡也作如是者指上歎相也種種方便者總收餘歎也。",
    "X39n0714_002:0845a08_0": "【疏】問身口殺相律文非一以何義故獨舉口歎以入戒本答據論戒本不勞繁文但云殺人得重自應通攝然毗尼者以因緣求此殺戒緣由相歎故即以此緣入於戒本前後諸戒繁相並同。",
    "X39n0714_002:0845a12_0": "問中躡前十九殺相以徵文局故云非一答中初正通來難前下決通餘戒。",
    "X39n0714_002:0845a14_0": "【律】是比丘波羅夷。",
    "X39n0714_002:0845a15_0": "【疏】是比丘下收入罪擯。",
    "X39n0714_002:0845a16_0": "五六中罪擯二字別配二句。",
    "X39n0714_002:0845a17_0": "【註】若作如上殺人方便不死偷蘭若殺非人若畜生有智解於人語若能變形方便殺者並偷蘭不死者突吉羅畜生不能變形若殺波逸提實人人想波羅夷非人想疑偷蘭四眾犯相如上不犯者擲刀杖瓦石誤著而死若營事作房誤墮木石而死若扶將病人入房往反一切無害心而死者是。",
    "X39n0714_002:0845a23_0": "【疏】就注解中初當趣明輕相二非人下分異趣相。",
    "X39n0714_002:0845a24_0": "釋注分文中準前亦應細分初犯不犯為二犯中又二比丘餘眾比丘中復二犯相及境想前又約趣如疏分之凡至辨相例須科約婬中委示餘使自求但舉一隅三隅須反。",
    "X39n0714_002:0845b04_0": "【疏】就畜分二智變有勝加害犯偷蘭者以相同人心非重者何能害也如世鸚鵡鸜鵒人有教其語者殺未犯蘭此但為人所教未教本非其智故非重也又如狐狸虎豹諸獸旌異志怪諸傳記中變為人相往往非一律中舉龍為首不言餘者若知而害義依法科不知而害亦從律結竝如上解具緣所列。",
    "X39n0714_002:0845b10_0": "釋畜中初句分經智愚兩判智下別釋智變分四初明犯意如下簡濫又下示相旌異記志怪錄並俗中紀述怪事之書律中以龍多能變化故偏舉之雖略餘者義可類同若下斷犯還約知論依法科者即結蘭罪不知從律如常犯提下文指略即前義中三趣門已說故云如上又闕緣後指非畜緣同罪輕重別故云具緣列也。",
    "X39n0714_002:0845b17_0": "【疏】就不犯中文相極顯所以不犯者如文云一切無害也。",
    "X39n0714_002:0845b19_0": "釋不犯文略示大意就注分二初擲物營事並是誤觸然此誤者由於他事全無害心不同前明錯誤之誤學者知之二扶往返即是無心。",
    "X39n0714_002:0845b22_0": "【律】不共住。",
    "X39n0714_002:0845b23_0": "【律】四大妄語戒。",
    "X39n0714_002:0845b24_0": "【疏】第四大妄語戒。",
    "X39n0714_002:0845c01_0": "【疏】次明口業所犯法行。",
    "X39n0714_002:0845c02_0": "大妄語戒初標簡中前三身業身為業本並列於前口業依身故次于後兩業既異故先點之。",
    "X39n0714_002:0845c04_0": "【疏】古來翻經約業顯相多云身口今時正譯審定名體不濫境心故以聲所從者並為語業故經云正語是也所以然者人之面門名之為口口是頑色但知吐納至於所損約從身攝論妄語四出雖在口必以聲相用分業道然其聲發豈止於口七處無壅方成語言餘且略之。",
    "X39n0714_002:0845c10_0": "翻名中初示古翻漢魏秦晉已來所譯皆爾今下次明唐翻故云今時文有二段初顯今兩得語即業體則名體相符語對耳根故境心不濫下引經證古明三業並標為口及列八正乃云正語故還引八正證今得實所下次敘古兩失先明口所屬論下正陳失相語既從聲為耳所得口屬身色自為眼見則心境濫矣又依聲發語遂成業行口是頑色本非善惡則名體乖矣然下潛通外難恐謂聲出於口從具彰名義有何失而見指斥故此防之明非通攝七處者智論云如人欲語口中風入至臍觸臍響出響出之時觸七處退是名語言偈云風名憂陀那觸臍而上去是風七處觸項及齗齒肩舌咽及以胸是中語言生於此應辨語業體相音曲名句依止於聲即聲為體方彰古譯名義全乖此不委明故云且略。",
    "X39n0714_002:0846a01_0": "【疏】所以語業具列有四妄語居首者由過數起順本惑業無始無明無非誑妄非有謂有諸例非一今既出家宜須體妄澄汱成淨反本即真如何不思重增欺負深可責也故在重初自餘罵讚輕故後列。",
    "X39n0714_002:0846a05_0": "前後中初徵起由下釋通分二初敘妄重虗妄成惑依惑起業轉更不實故此妄語與二相順無明即惑誑妄即業非有等者示妄語相如後列相所稱多種故云非一今下彰過上明所應作不作汱名作汰音太淘洗也如下明不應作而作故下結合初句明妄重下顯餘輕重謂四夷之末初即四業之首或可重是大妄初即小妄由上文中大小通敘故也讚即兩舌綺語不相離故不別指。",
    "X39n0714_002:0846a13_0": "【疏】然斯妄相人多弊之吐言一返追不可得故以義張識其非相四門敝之一能妄在凡非聖意二明凡妄語五種別三立妄為言兩分相四本誑令知不待信。",
    "X39n0714_002:0846a17_0": "妄相標中一反謂忽相違也追不得者言其疾也即論語云駟不及舌列示四門初簡聖凡二簡輕重三簡虗實四簡知信。",
    "X39n0714_002:0846a20_0": "【疏】初門中明能妄人在凡不在聖者。",
    "X39n0714_002:0846a21_0": "【疏】由彼聖人有二種實語一者身證二者想心。",
    "X39n0714_002:0846a22_0": "【疏】言身證者修道德滿證真斯極除斷虗偽妄則斯盡出觀陳說言必稱實義無欺負起誑妄過此身證也。",
    "X39n0714_002:0846b01_0": "初門身證實中初敘身證修等四句即是四諦出觀下明實語據是心證然茲聖道非身不剋心道幽隱從相顯彰即律序云餘身證者經律皆言最後身得是也問出觀陳說即實得道將無犯邪答戒制未具不遮同意。",
    "X39n0714_002:0846b06_0": "【疏】然彼聖人定前方便理觀事察自然聞彼異域奇相及出觀後如心陳告我入空慧定中見也餘人不解便生疑怪何有空慧得見奇相此則目連虗稱上法如僧祗律本皆有是事佛言實爾定不清淨是前方便謂言定體如斯事相想心實語。",
    "X39n0714_002:0846b11_0": "想心實中且據四分調部目連入四空定以明其相分文為四初示想心將欲入定攝心正想忽見異事而非正定故云方便理觀即空慧事察即方便及下次引目連自述律云目連告諸比丘我入空慧定聞伊羅婆尼象入難陀池水聲(律文廣列多種須者尋之)餘下三引比丘疑怪既見是相則非空慧僧祇同此故下指之十誦亦然佛下四引佛決疑(識慧處無所有慧處非非想慧處亦如是)下二句結示問如見而說何但想實答定前方便彼謂定體則同妄語但由不識作正定想故無犯耳。",
    "X39n0714_002:0846b21_0": "【疏】問若如上引二種實者舉彼大聖亦有二不答如來照境斯盡但唯身證實語所以然者聲聞了境有礙二者劣用不同入則徹於視聽出則如凡聞見有此義故便有想心實語佛則不爾反前可知故淨名云常在三昧悉見佛國又無量義經云永斷夢妄思想念故無想心實語。",
    "X39n0714_002:0846c03_0": "問中由前二語但約小聖欲明極聖與彼異故答中初標異智度大海唯佛窮底證理斯極如理而說故無異想所以下徵釋初敘小聖有想言有礙者即下出同凡故言劣用者即下入出不等故由證偏空智非圓極但除麤惑猶有事迷故也佛下次明如來無想言反前者照境無礙出入同等下文引證初證同等彼經諸梵志問云世孰有天眼維摩答言佛世尊常在三昧禪志不虧悉見諸佛國不自稱說等又下證無礙良以想心所起由不了境佛既通達無礙豈有想乎文引諸菩薩讚佛偈具云大哉大悟大聖主(此句總讚三身已下別讚三身)無垢無染無所著(法身)天人象馬調御師道風德香熏一切(應身)智恬情怕慮凝靜意滅識亡心亦寂永斷夢妄思想念無復諸大陰界入(報身妄無實故喻之如夢思想即念)。",
    "X39n0714_002:0846c17_0": "【疏】由彼下凡無彼聖人二種實語發言欺誑令他虗解故成妄過。",
    "X39n0714_002:0846c19_0": "在凡中正明可解。",
    "X39n0714_002:0846c20_0": "【疏】問凡夫身心亦有事中身證實語如向人說身證苦樂不妨迷忘違境而說想心實語律不結犯與彼聖人想實何異答雖有非犯然非理解緣念之想由未斷本偽妄之心後時違心背想而說還成妄語有斯別故不同聖也。",
    "X39n0714_002:0847a01_0": "問中先敘身證簡聖理解故云事中不下正難想心上標身證理事自分至論迷想聖凡同事既容通濫義必須分律不結者大妄則開上慢小妄唯結違想答中初示異聖智達理知心虗妄而起緣念故名理解之想凡情計實故不同之由下推異所以良由下凡本妄未除雖復開迷後容違想不同上聖結惑已亡雖或想乖必無虗妄故也。",
    "X39n0714_002:0847a08_0": "【疏】次明凡夫妄語隨緣無量以罪定名不出五位謂波羅夷僧殘偷蘭波逸提突吉羅也。",
    "X39n0714_002:0847a10_0": "次明五別。",
    "X39n0714_002:0847a11_0": "【疏】就此五位約分為二。",
    "X39n0714_002:0847a12_0": "【疏】夷蘭二妄同出世法成誑重者良以下凡於出世法未實交證假偷在己惑誑於人用謀名利損重過深故得極重即以斯語用誑非人損過稍輕故結蘭罪階降乃殊同非凡法。",
    "X39n0714_002:0847a16_0": "前二中初標示良下釋成初敘誑人即下次誑非人此二語同境別故分輕重交猶會也稍少也階下總結。",
    "X39n0714_002:0847a19_0": "【疏】餘三妄語同以世法用誑於人罪便異者良以瞋謗凡情易起實無三根橫搆虗狀以餘重罪誑僧見犯欲令治擯永處眾外情狀尤重故得僧殘又以二篇所犯之罪誑僧聞見謗相既輕故得提罪戲笑不實乖越威儀情過為微故得吉羅三階乃立無服世法。",
    "X39n0714_002:0847b01_0": "餘三中初總示良下釋成初明大謗又下次釋小謗不約小妄為提者自可知故下明戲妄此三語異境同以明差別三下結示服字誤合作非。",
    "X39n0714_002:0847b04_0": "【疏】上以義約大分凡聖今用教徵便有塗轍自有說凡而得重自有說聖而得輕。",
    "X39n0714_002:0847b06_0": "次引教徵生起中便合作更途轍謂多別相也自有等者後引諸相並約此二隨文分之。",
    "X39n0714_002:0847b08_0": "【疏】何者如十誦云我於那含果未得或言失者偷蘭若言有者重。",
    "X39n0714_002:0847b10_0": "初文十誦彼因波離問佛大妄重輕乃至下文並佛所答那含未得者彼具列四果今文略之已下並約人問答以顯言相而多以乃至略其問辭言偷蘭者此謂說聖得輕也。",
    "X39n0714_002:0847b14_0": "【疏】或言我今日不入世定前人言昨日云何答言亦爾不入蘭皆謂言近聖相故結蘭也。",
    "X39n0714_002:0847b16_0": "次文色無色定名為世定不入犯者以言今不入則顯餘時入故文引犯輕彼又云若說禪法得夷此即說凡得重。",
    "X39n0714_002:0847b19_0": "【疏】或云我是學前人問云何名學便言我是多聞利根禪誦慧解者犯偷蘭若言無漏學人者重。",
    "X39n0714_002:0847b21_0": "三中輕重可解。",
    "X39n0714_002:0847b22_0": "【疏】或言我是無學乃至答言懈怠不學說聖無學者重。",
    "X39n0714_002:0847b24_0": "四中懈怠者彼亦結蘭言相濫故。",
    "X39n0714_002:0847c01_0": "【疏】若言我無所有我無不活畏及大眾畏乃至答言我無衣鉢名無所有者蘭言無貪癡斷五畏者重。",
    "X39n0714_002:0847c03_0": "五中無所有者濫空理故無不活等者濫聖德故聖人無五種畏文舉初後第二惡名畏三死畏(上即畏不存活此謂畏其死至)四惡趣畏答無衣鉢亦由言濫故結蘭罪答無貪等即僭聖德故結重也。",
    "X39n0714_002:0847c07_0": "【疏】或言我是盡結使人我今是佛乃至答言過去無故所以結盡覺一切不善法名為佛者蘭言斷結使說名佛者重。",
    "X39n0714_002:0847c10_0": "六中初標泛說乃下顯妄相初明犯輕言過去者從本已來無諸結故覺不善者佛名覺者心能覺了即是佛故言下結重可解。",
    "X39n0714_002:0847c13_0": "【疏】伽云我是佛者我是天人師者並偷蘭以人不信故若云我於四沙門果退者夷所言有涉也。",
    "X39n0714_002:0847c15_0": "伽論稱佛二號人不信者以無濫故此即決上犯重之文下稱四果退亦重者既言我退則顯己得故也。",
    "X39n0714_002:0847c18_0": "【疏】多論若言不淨觀等乃是凡法亦得重罪。",
    "X39n0714_002:0848a01_0": "多論不淨者五停之一論云是甘露初門一切聖人由之入道故。",
    "X39n0714_002:0848a03_0": "【疏】十誦云若人作書自云初果以書示人書云得果我實非得犯蘭。",
    "X39n0714_002:0848a05_0": "十誦意託書誑以避口犯。",
    "X39n0714_002:0848a06_0": "【疏】僧祇云若言某處皆非凡夫者越毗尼我亦在中者蘭以非定指故若言我亦得此法者犯重。",
    "X39n0714_002:0848a08_0": "僧祇中三初得越者泛指他故次犯蘭者霑己分故三犯重者由的指也。",
    "X39n0714_002:0848a10_0": "【疏】三明聖法起妄必以心境俱差凡法明妄但以心虗不問境之虗實者。",
    "X39n0714_002:0848a12_0": "兩分相中總標分二即前五種論犯兩別。",
    "X39n0714_002:0848a13_0": "【疏】凡論妄語四句分之初心境俱虗二心境俱實三心虗境實四境虗心實即以分之初句犯夷第二犯墮第三境實不名為犯以心虗故今解不爾如後小妄違想而說即犯墮也第四句者增上慢也由心實故開前大妄由境虗故開後得道。",
    "X39n0714_002:0848a18_0": "聖法中前列四句即下舉事配釋初句正犯此戒第二墮者即實得道向未具說第三上引他解下示今解即準小妄為例言境實者若實證聖豈有心虗然有下凡得不淨觀或感天供想心謂非違心而說可例小妄而結重夷據此論犯不必俱虗第四如文自顯開後得道謂不犯提也。",
    "X39n0714_002:0848a24_0": "【疏】後以世法誑者以境雖是事通於內外加謗得殘自三根為內他三根為外亦可意有見想為內見聞覺知為外皆非聖法不據前境但使心虗皆成妄語故文云彼人不清淨不見彼犯雖復著實不那心虗結殘可知。",
    "X39n0714_002:0848b05_0": "凡法中初通標以下別釋有二前示二謗言境是事者對前聖法境通理故據論境事止合局外然今謗妄境通內外自三根者親見聞疑也他三根者從他傳也如後二謗注文所列亦可等者上解唯局二謗此義兼通謗妄言見想者謂內心虗起非實見聞也見聞等為外者根塵觸對也皆下總示成犯前雖實犯淨想而謗亦犯僧殘又如實見作不見想向人云見亦成提罪故下引證可解那字去呼。",
    "X39n0714_002:0848b14_0": "【疏】四明妄語本欲誑人生信今結正時但言了結不待信者。",
    "X39n0714_002:0848b16_0": "第四標中餘戒結正多取迷心妄戒獨異故須辨示。",
    "X39n0714_002:0848b18_0": "【疏】如昔人解知麤信細云云何極。",
    "X39n0714_002:0848b19_0": "斥古中義鈔引古云知麤信細止得從知後生信不得從信後生知故不待信更有難問今並不引故斥云云。",
    "X39n0714_002:0848b22_0": "【疏】今言造業各有所由口造語業言了前知壞境既備何得待信以領達言竟欺負即了信疑兩緣壞後方起語造身業言了未壞故未結重餘如竪義。",
    "X39n0714_002:0848c01_0": "立今中即首師解初通標口下正釋前明正造又二初明成犯分齊以下釋其所以上二句釋上壞備下二句釋不待信次明互造語造身者如教殺歎殺深河誑淺之類又身造語業事容混濫疑輕信重文中不出故指如前即三業門也。",
    "X39n0714_002:0848c06_0": "【疏】就解戒本亦有四意。",
    "X39n0714_002:0848c07_0": "【疏】所以約制者然則無漏聖道非凡所證由未得故冐假虗談自言己證惑亂群心欺負於世希招名利曀法罔時過中之甚故須極制。",
    "X39n0714_002:0848c10_0": "牒釋制意中敘過有四初至已證明竊法過惑下即誑人過希下邪求過曀下滅法過冐覆也覆其所無妄云已有曀即昏暗罔謂誣罔過下總結問四戒敘意各自云重畢究初篇何戒最重答四戒皆重何有優降但各專一義互望為劣如淫障道之極餘三則輕盜則違惱殺損道器妄取罔時準上相比義亦可解。",
    "X39n0714_002:0848c17_0": "【疏】二釋戒名者體乖實錄名之為妄過重欺深名之為大成業在口名之為語戒是能治之行故曰大妄語戒。",
    "X39n0714_002:0848c20_0": "釋名中初科貼釋戒本。",
    "X39n0714_002:0848c21_0": "【疏】如昔解云言非稱實名之為妄妄說聖德事超凡境故云過人法言過有二過凡至聖過欲至色以此二法同誑於人故曰妄說過人法戒。",
    "X39n0714_002:0848c24_0": "引古中彼立戒名云妄說過人法戒故作此釋二義釋過上即據位如說初二果等下乃約界如說四禪四空等。",
    "X39n0714_002:0849a03_0": "【疏】問何以但言過人法不云過天者答如多論解佛在人中結戒故人中有木叉多修善法入道勝天但云勝人已過天故又勝人以罪重天故無所論。",
    "X39n0714_002:0849a06_0": "問答中多論三義釋之初約制戒釋多下次約人勝釋諸天著樂多不修善劣於人故但言過人又下三約比況釋謂過人已重何況過天理必可知故云無所論也。",
    "X39n0714_002:0849a10_0": "【疏】三釋成犯緣具九一前境是人二作人想三誑境是虗四知已境虗五誑他心六說過人法七自言已證八言章明了九前人知解。",
    "X39n0714_002:0849a13_0": "具緣中初後是境二五並心餘皆妄法。",
    "X39n0714_002:0849a14_0": "【疏】四解闕緣。",
    "X39n0714_002:0849a15_0": "【疏】若闕初緣小漫三句正剋四句異境來替相同前戒闕第二緣漫心想轉有三剋心轉想有四加王人想故漫心辨疑有六剋心辨疑有十雙闕二緣有四十作句並如上可解也闕第三緣境虗今謂實者全無罪容犯提吉如後得道戒闕第四緣知己虗即增慢者無罪闕第五緣有誑心今不作究竟意戲故吉羅闕第六緣說過人法今說人法如多論云自言持戒清淨婬欲不起不誦四含毗尼不坐禪非練若而言我誦我是竝偷蘭闕第七緣自言已證今不言自證或有功德歎三寶故或得吉羅我師是故或得偷蘭虗說他得以謀名利邪命活故闕第八緣言不辨了輕偷蘭闕第九緣前人不聞或不丁但偷蘭耳。",
    "X39n0714_002:0849b03_0": "闕緣中初緣不明大漫若對杌木合有三句即杌作人想杌作非人想杌作畜想二中有三前明轉想漫心三句即約小漫一人作非人想二作畜生想三作杌木想剋心四句加張作王想次明疑心漫心有六者亦約小漫直疑有三一非人疑二畜生疑三杌木疑互疑亦三一為非為畜二為非為杌三為畜為杌剋心十句及下雙闕並同前戒闕第三中實得道戒向未具說提戲笑說吉闕六中說人法者據是小妄但虗稱功行即大妄闕緣故結蘭罪第七中初示闕義或下明闕相歎三寶者即說僧寶通聖賢故稱師吉者但虗稱美不為利故必謀名利同下犯蘭。",
    "X39n0714_002:0849b15_0": "【註】佛在毗舍離時世穀貴乞食難得婆求河邊有安居者便共稱歎得上人法信心居士減分施之後往佛所因問訶責而制此戒。",
    "X39n0714_002:0849b18_0": "【疏】就戒緣中初明穀貴遂行邪命者論語云君子固窮□小人窮斯濫矣斯言有由以俗誡道鈍士所懷也。",
    "X39n0714_002:0849b21_0": "戒緣中引論語者事相類故彼因孔子在陳絕粮子路問云君子亦有窮乎疏引彼答言君子處於困窮確然守志而不變故云固也小人當困則無所不為故云濫也斯下示引用之意。",
    "X39n0714_002:0849c01_0": "【律】若比丘實無所知。",
    "X39n0714_002:0849c02_0": "【疏】戒本七句初出能犯戒者二實無知者是妄語境也三自稱我得下正是犯過戒本也四彼於異時下制疑網也五除增上慢開心實也下二可知如上說也。",
    "X39n0714_002:0849c06_0": "戒本標列中第四文明兩種自言恐疑自首不結正犯故科云制疑網也。",
    "X39n0714_002:0849c08_0": "【疏】第一如上。",
    "X39n0714_002:0849c09_0": "【疏】言實無所知於聖無漏由來無得可是虗耶故曰也。",
    "X39n0714_002:0849c11_0": "【註】謂實無知見法。",
    "X39n0714_002:0849c12_0": "【疏】注解實無知見者如僧祇云於四真諦名知諸通名見此二於身空無知見故曰也此是妄稱之境也。",
    "X39n0714_002:0849c14_0": "次句釋注引僧祇者彼有四句一知而非見(言我知苦集滅道)二見而非知(言我得天眼天耳他心神足宿命漏盡)三亦見亦知(知四諦見六通)四非見非知今引第四故云此二等此下點示即上空無知見是為妄境。",
    "X39n0714_002:0849c18_0": "【律】自稱言我得上人法。",
    "X39n0714_002:0849c19_0": "【疏】三自稱我得上人法者是總舉也我已入聖者別示相也。",
    "X39n0714_002:0849c21_0": "【疏】就前總舉言人法者謂成人之緣無越陰界故曰法也所言上者謂無漏信戒凡法之表故曰上也。",
    "X39n0714_002:0849c23_0": "第三總舉文中成人緣者以陰界入各有別相和合名人今就別中取能成邊得名為法。",
    "X39n0714_002:0850a01_0": "【註】自稱說有信戒施聞智慧辯才過人人法者人陰人界人入也上人法者諸法能出要成就也。",
    "X39n0714_002:0850a03_0": "【疏】就注解中言自稱說有信者釋上行妄語者言也信謂理解不壞之信戒謂八正定道之戒施謂亡我之施聞謂道分無漏聞慧智慧謂思修壞正之智辯才謂四無礙辯非凡所得也此之六相唯聖所感在凡人上故曰上人法故。",
    "X39n0714_002:0850a08_0": "注中初科前總示注意信下別釋言相初明信者準業疏云信有二種一事信此有退失二理信謂內凡分見真理善根堅固不可傾動故云不壞釋戒云八正者初果已去得無漏智故彰正名亦名聖道初三戒攝一正語(除四邪命住正語中)二正業(除身一切邪業住清淨正身業中)三正命(除五種邪命住清淨正命)定道者若得色無色定及初果已上得無漏道時身口任運離諸業非與定道同時故二並名共亦名為俱文云八正即八中前三定道即指二共並聖戒耳釋施云亡我者能施所施及中間物三皆不可得則心不望福求報名不住相施釋聞及智乃約聞思修三慧配之可見懷即思修正即聖道釋辯才云四辯者一義二法三辭四樂說四皆通達俱名無礙此下探取下注合釋上經。",
    "X39n0714_002:0850a22_0": "【疏】人法者下列陰界入也古翻經者謂積聚是陰義撿諸字書無此訓故今世所翻改陰為蘊不可怪也如古改陰為眾可以通之。",
    "X39n0714_002:0850b01_0": "釋人法定名中初牒示古下引釋古云積聚者語出雜心字書無訓點其非也今下即唐翻如下謂秦晉所翻多云五眾蘊眾二名並符聚義故俱舍云諸有為法和聚故是蘊義。",
    "X39n0714_002:0850b05_0": "【疏】如論中說陰界一也論本成人但色心耳眾生迷執多不解悟故隨病設藥治之不須諍也秪恐誦藥而迷愈疾非聖意也。",
    "X39n0714_002:0850b08_0": "次科總標中如論即成實陰界一者體不異也義必兼入文中語略論本下示同相眾生下明別相若準雜心凡有三義一約欲(樂廣說界中者說入樂略說陰)二約迷(如下引者是)三約根(上根說陰中則說入下則說界)雖開多別名別體同則無所諍秖恐下以世學者多誦少行說食數寶終成無益故此責之。",
    "X39n0714_002:0850b14_0": "【疏】故彼文云迷於心者為說陰色相為一分心為四令知識想受三猶未成業若至行心三毒三善隨發成業則不可治故當常爾一心念除諸蓋斯成藥也對病之時並亡去矣病成方憶難可言也。",
    "X39n0714_002:0850b18_0": "釋陰中三初明立法令下次顯分心開迷之意故下三勸對治既識四心知行成業乃達生因即窮苦本體三毒源息有漏業縛著可解出離有期矣常一心者即教藥也諸蓋即機病也一欲蓋(貪也)二恚蓋(瞋也)三睡眠四掉悔五疑(此三癡也)由此五種能覆真性故通名蓋對病竝亡者藥病俱除也若存於藥還成其病如船渡岸似指標月喻可曉也病成難言傷縱怠也任毒不治起行成業後覺叵追悠悠不覺生死長矣。",
    "X39n0714_002:0850c03_0": "【疏】迷於色者為說入六塵五根俱是色意根不分非迷也。",
    "X39n0714_002:0850c05_0": "次釋入中六根六塵相入名十二入故亦名為處然色名通莫辨體相故離根塵以開迷者。",
    "X39n0714_002:0850c07_0": "【疏】通迷色心為說界分色為十一分心為七分至於藥治可例上也。",
    "X39n0714_002:0850c09_0": "後釋界者就上意根更開六識為十八界界是別義體相各異故亦是因義相假成用故然法塵二界兼通色心故使經論開合不定或攝在心則色十心八或分為二則十色七心各兼少分今收於色故云十一至於下示上入界通須勸治良由根境和合起用造諸妄業遂受輪轉今既了達隨境制根然此諸根心為其主亦當常爾一心等界中加識對治亦爾故云例上也。",
    "X39n0714_002:0850c17_0": "【疏】此之人法通凡及聖觀察識妄斯唯聖證謂我能觀此凡想倒不可信也。",
    "X39n0714_002:0850c19_0": "總結中初明同異謂下破妄情。",
    "X39n0714_002:0850c20_0": "【疏】就解上人法中戒慧非一名諸體唯缺有名出離此法外非餘法能名要順法治惑故曰成就也。",
    "X39n0714_002:0850c22_0": "釋上人中云非一者指前六種缺有者缺猶破也下以治惑釋成就者聖果所剋由惑斷故。",
    "X39n0714_002:0850c24_0": "【律】我已入聖智勝法。",
    "X39n0714_002:0851a01_0": "【疏】二別解中我已入聖智勝法謂得生空之智故言聖智會正名聖由觀無我感於聖故又法空解達陰知無故曰勝法。",
    "X39n0714_002:0851a04_0": "次別解者謂釋上所稱之相初總牒謂下別解上約人空解聖智又下次約法空釋勝法。",
    "X39n0714_002:0851a06_0": "【註】自言有念在身若正憶念若堅持戒若有欲若不放逸若精進若得定若正受若有道若有修若有慧若有見若有得若有果。",
    "X39n0714_002:0851a09_0": "【疏】就注解中此勝法之相耳。",
    "X39n0714_002:0851a10_0": "【疏】有人依解廣竪義章動經他日意所異也舉宗以明持犯為正自餘隨律之經略知名相而已諸經論師自分宗體彼尚不解律刑此豈橫知他學縱有前聞亦不得述費時損日徒張無益自宗猶困於未聞況餘經論何由道盡可謂不識分量也須臾死去莫浪多事故今但釋其名也。",
    "X39n0714_002:0851a16_0": "釋注斥世中初四句牒非顯異他日即多日也意異者疏主自謂也舉下明其異相初指宗斥濫縱下遮其舊習費下彰過自下結責未曉己宗強知他學劣識而欲博通蠡杯而酌大海故云不識分也須下誡勸故下標今。",
    "X39n0714_002:0851a21_0": "【疏】言有念在身者即身念處也故律云有念能令人出離狎習親附乃至無復艱難而得自在也言正憶念者謂受心法也言堅持戒者八正道中語業命也言有欲者四如意足也言不放逸者五根力也言精進者四正勤也若得定者謂三空即空無相無作也若正受者四種一想正受初禪覺觀俱也二無想正受二禪無覺觀也三隨法正受三禪樂由隨也四心想正受四禪有無想外人計為滅心為除此計故言心想也言有道者律釋十一支道廣如舍利弗毗曇所說若修若慧若見即道分三慧也剋證在己為得遂因為果酬因為報無漏是果而非報攝。",
    "X39n0714_002:0851b08_0": "略釋中初言身念(即觀身不淨也)下引律釋初句標觀功用繫念修學故云狎習乃至者彼續云修習增廣如調伏乘守護觀察善得平等已得決定方接下文遠離諸有故無艱難斷貪絕縛故得自在受心法者(即觀受是苦觀心無常觀法無我并上即四念處)八正(正語正業正命此三屬戒正念正定正方便此三屬定正思惟正見此二屬慧今取前三即聖戒也)四如意足(一欲如意足二精進如意足三心如意足四思惟如意足亦名四神足)五根力(一信根二精進根三念根四定根五慧根五力體同但根取能生力從功用)四正勤(一未生惡令不生二已生惡令速滅三未生善令生起四已生善令增長)三空(即三解脫門無作亦名無願)四正受即四禪天定初禪具五支(一覺二觀三喜四樂五一心成論云散心數起名覺散心小微名觀今舉前二涅槃云內有覺觀外有火灾)二禪具四支(除覺觀二支加一內淨也大經云內有歡喜外有水灾)三禪五支(一捨二念三慧四樂五一心大經云內有喘息外有風灾)四禪四支(一不苦不樂二捨三念四一心此有九天第四名無想外道所居涅槃云四禪無過諸灾不及謂無三灾由內無患故)十一支道者(支即分義從一至十一總攝諸法皆能趣道律但有總名故指論釋彼十一支文甚廣今略引名數須者尋之)一支道(身念處)二支道(定慧)三支道(有覺觀定無覺觀定三空定)四支道(四念處四正勤四如意)五支道(五根五力)六支道(六念謂念佛法等)七支道(七覺支)八支道(八正道)九支道(九次第定)十支道(十一切八)十一支道(十一解脫入準法界次第名十一智)三慧(律自委釋)修(戒定慧解脫解脫知見)慧(法智比智等他心智)見(見四諦得天眼等此三並聖所證故云道分)。",
    "X39n0714_002:0851c04_0": "【律】我知是我見是。",
    "X39n0714_002:0851c05_0": "【疏】文言我知是者釋上境虗知諦不妄也我見是者亦同也。",
    "X39n0714_002:0851c07_0": "釋我知中前引僧祇知對四諦故云知諦見亦同者應云見通不妄。",
    "X39n0714_002:0851c09_0": "【註】若言天龍鬼神來供養我若得不淨觀四禪四空定等。",
    "X39n0714_002:0851c11_0": "【疏】注中云天龍來供戒本不引今所有文引受戒時舉重示相義不乖也。",
    "X39n0714_002:0851c13_0": "釋注中初科戒本不引者指律廣解也今下指所出即受法說相中彼皆判重犯相是齊故云不乖。",
    "X39n0714_002:0851c15_0": "【疏】問天龍來供凡尚感發有何罪故乃入聖中答相與聖通故齊一重又過常人之所有故。",
    "X39n0714_002:0851c17_0": "問中由事非局聖疑其同重故答中兩意上約濫聖釋下約過凡釋。",
    "X39n0714_002:0851c19_0": "【疏】下列不淨觀四禪四空例是凡法有誑俱重者多論答云是甘露初門一切聖人由之而入故言過人法也。",
    "X39n0714_002:0851c22_0": "次禪觀中初牒問以疑凡法而得重故下引論答以決所疑甘露者味中最勝以喻出世無漏聖道入道之始必由五停不淨居首故云初門問前明有念在身即是觀身不淨四種正受亦即四禪今注復列何為答由此禪觀凡聖通修前約聖道此據凡論縱不稱聖但云得此亦在重例是以疏中判為凡法意可見也。",
    "X39n0714_002:0852a05_0": "【律】彼於異時若問若不問欲自清淨故作是說我實不知不見言知言見。",
    "X39n0714_002:0852a07_0": "【疏】文云彼於異時下明犯過者以後悔前相也。",
    "X39n0714_002:0852a08_0": "【疏】問妄語之相戒有五位大妄大謗戒本所列自言引虗小妄小謗戒本不出者。",
    "X39n0714_002:0852a10_0": "第四句明自言中問意謂謗妄不殊理當俱列而出沒不等必有深意。",
    "X39n0714_002:0852a12_0": "【疏】如昔解云上二罪重有壞眾義須僧治罰故安自言餘過是輕故不安著也。",
    "X39n0714_002:0852a14_0": "初解中言壞眾者以犯二篇坌污清眾必加治擯須取自言餘但壞行不必加治故不須著。",
    "X39n0714_002:0852a16_0": "【疏】若爾須治初二篇罪俱是壞眾餘何不著答義應如問但為相隱難知非其自言無由可識故結集家取意集之重著輕略大覆小覆大妄小妄大謗小謗例如此也。",
    "X39n0714_002:0852a20_0": "次難中意云二篇並是壞眾何獨三戒列之答中初正答來問言相隱者三皆語業語無形迹不同餘戒麤相彰顯故重下潛通來難以小妄等亦是相隱何不著耶故此通云輕者略耳大覆即尼八重之一戒本亦列自言僧戒雖無意彰律本重者皆著故隨引之。",
    "X39n0714_002:0852b02_0": "【疏】又人解云自言有二若問自言通一切戒不問自言如戒本列初篇有者以緣有故列之後篇無者以緣無故不出如夢漏失當時有故即除婬亦應開當時無故不列在律下文開之如是準知上已解竟可細尋取豈非緣也。",
    "X39n0714_002:0852b07_0": "次解中分四初示二種通塞問自言者如諸戒緣如來並先審實後方制戒故云通一切也初下立義如夢下舉例下文開者即律調部比丘睡中為女就婬佛判不犯是也如是下結指上已解者即殺戒云毗尼以因緣求乃至云前後諸戒繁相並同等。",
    "X39n0714_002:0852b13_0": "【疏】問若如此者文列若問自言列來何為解云類通諸戒俱不須列為除疑故相與列之若不彰者見有不問自言謂不須問自言也故相對出餘戒無不問自言故問自言無對故不出大有理也。",
    "X39n0714_002:0852b17_0": "難中意謂不問自言可從緣說問自言者既通一切何須列之釋中初正答三戒須列之意餘下點示諸戒不列所以大有理者疏家結歎。",
    "X39n0714_002:0852b20_0": "【疏】彼於異時者犯罪發露前後經夏故言異時。",
    "X39n0714_002:0852b21_0": "牒解中初文即婆裘河邊諸比丘夏初妄語安居竟往佛所方乃自陳故云經夏。",
    "X39n0714_002:0852b23_0": "【疏】若問不問者當時如來以世疑問汝有實不懼犯過故遂自陳首我行妄聖即不問自言也。",
    "X39n0714_002:0852c01_0": "次科初句總牒當下別釋初敘問諸比丘至佛所自述稱聖遂招利養佛問如疏知而故問示同常人故同世疑懼下次釋不問。",
    "X39n0714_002:0852c04_0": "【疏】欲自清淨故作是說者見世行惡詣官首露便原六罪佛法不爾業結在前吐言招惡成因已竟苦果難除。",
    "X39n0714_002:0852c07_0": "三中世禮約刑佛法論業不可類同原謂取其本情而赦罪也。",
    "X39n0714_002:0852c09_0": "【註】意欲以後悔前用實轉虗由口造業言了結重。",
    "X39n0714_002:0852c10_0": "【疏】注中解取意可通也。",
    "X39n0714_002:0852c11_0": "點注中以前後注文並引律解此取相傳故特點示。",
    "X39n0714_002:0852c13_0": "【律】除增上慢。",
    "X39n0714_002:0852c14_0": "【疏】除增上慢者無漏正道出過相有名為增上然於增上之法未得謂得名之為慢。",
    "X39n0714_002:0852c16_0": "第五句正釋中初釋增上即目聖道然下釋慢謂不進求。",
    "X39n0714_002:0852c18_0": "【疏】十誦云久在山林不覩妙色暫伏煩惱自謂永無故生慢告後近城傍見色起染知己是凡更加精進果成羅漢佛言犯吉障道。",
    "X39n0714_002:0852c21_0": "緣中妙即好也境虗心實但乖言議故得吉罪既已證聖那言障道此據罪體能障為言聖人但不結業非無違制義須悔除如擯阿難結集之時受責悔過之例若據本律則不結罪。",
    "X39n0714_002:0853a01_0": "【註】比丘慢心自謂得道後勤精進證增上果生疑白佛便言增上慢人為不犯。",
    "X39n0714_002:0853a03_0": "【疏】注中文相可解云生疑者解言準境虗邊應犯正罪然我心迷無有情過故於持犯不能自決佛判非犯止為心迷。",
    "X39n0714_002:0853a06_0": "注中初句總指云下別釋初敘疑情即於心境疑犯非犯下二句明佛斷。",
    "X39n0714_002:0853a08_0": "【律】是比丘波羅夷。",
    "X39n0714_002:0853a09_0": "【疏】是比丘下引人入法也。",
    "X39n0714_002:0853a10_0": "第六文中引人即比丘入法即罪名。",
    "X39n0714_002:0853a11_0": "【註】若作是虗而向人說前人知者波羅夷不知者偷蘭若遣手印若遣使若書若作知相若知者其犯亦爾若於不能變形畜生向說得突吉羅下四眾如前說不犯者增上慢人若業報得若不言我得或戲笑說疾說屏說欲說此錯說彼是也。",
    "X39n0714_002:0853a16_0": "【疏】初自作輕重中若遣書印者西域人指並貫環印見相知心義應假語。",
    "X39n0714_002:0853a18_0": "注文科約同前但無境想句明犯中初科雖示印相亦有語助故云假語。",
    "X39n0714_002:0853a20_0": "【疏】言作相者現身口威儀令異凡度也。",
    "X39n0714_002:0853a21_0": "次科作相即身造口業注中作下有知字謂現相示有所知也。",
    "X39n0714_002:0853a23_0": "【疏】於不變畜向說何益者以出家人言行相守何得自輕妄稱不實也。",
    "X39n0714_002:0853b01_0": "三中云不變者以對能變得蘭故初難結犯畜既無知何意須誑以下敘其犯意。",
    "X39n0714_002:0853b03_0": "【疏】就不犯中若業報得者今有見鬼徹聽非是修得恐同聖故如世俗通呪通術通幻通藥通報通如鳥飛空報通也人雖不得亦不怪彼。",
    "X39n0714_002:0853b06_0": "不犯中初科通力有二聖人修得則具六通凡夫報得但無漏盡初正示恐同聖者顯注簡也恐世有者疑謂犯重故須出之如下引類文列五種上四靈妙莫測下一去來無礙故並名通如下別示報通出不犯意人見飛鳥既不驚怪則知報得不足動人。",
    "X39n0714_002:0853b12_0": "【疏】戲笑已下以輕遮重非謂全持如上制戒明違順也。",
    "X39n0714_002:0853b14_0": "次科由制犯吉故云以輕遮重如上即初戒教所詮中彼云順不犯法成違聖制意是也(雖合開文然非佛意)。",
    "X39n0714_002:0853b16_0": "【律】不共住。",
    "X39n0714_002:0853b17_0": "【律】諸大德我已說四波羅夷法若比丘犯一一波羅夷法不得與諸比丘共住如前後亦如是是比丘得波羅夷不應共住今問諸大德是中清淨不(三說)。",
    "X39n0714_002:0853b20_0": "【律】諸大德是中清淨默然故是事如是持。",
    "X39n0714_002:0853b21_0": "【疏】上明四相釋標章門眾已委知又除疑執故又結也。",
    "X39n0714_002:0853b22_0": "【疏】就結章門又分為三初有一句告眾情也若比丘犯下除疑執也今問諸大德下欲說後篇又靜眾也。",
    "X39n0714_002:0853b24_0": "【疏】就初又二諸大德者舉人歎德動神府也已說四波羅夷法者正結章門也標釋結中罪四不別共為一章文分為三也。",
    "X39n0714_002:0853c03_0": "結章告情中初正釋神府即是心識也標下通示總別開合之意。",
    "X39n0714_002:0853c05_0": "【疏】次除疑中分二。",
    "X39n0714_002:0853c06_0": "【疏】初云若比丘犯一一法乃至不得共住如前者釋同住疑也時人疑意但言犯者不共住不知何等不共住故今解云未犯已前以人淨故得於二種法中同住今既一犯不得如昔同法共住故言不得共住如前也。",
    "X39n0714_002:0853c11_0": "次科今解中初文又二初標示時下敘疑故今下正釋二種法者一說戒二羯磨。",
    "X39n0714_002:0853c13_0": "【疏】二後亦如是者釋重疑也時人意謂初犯斬首有戒可破後雖犯過謂非有罪故今釋言後犯亦爾不預前共住之例故曰不應共住也。",
    "X39n0714_002:0853c16_0": "次疑中初標示時下出疑意故下釋通不預前者謂未犯時。",
    "X39n0714_002:0853c18_0": "【疏】有人言白衣沙彌不足僧數一犯已後如前無異故言不得共住如前疑無重犯故云後亦如是。",
    "X39n0714_002:0854a02_0": "他解中大同上解唯如前義別謂犯重非數與本未具無異故云如前。",
    "X39n0714_002:0854a04_0": "【疏】問此律重犯隨作不輕何故僧祇學悔人犯止但吉羅亦應驅出者答義同文異也律中犯重有行悔者猶在僧中說戒自恣異於沙彌故同夷罪如打犯重還結波逸提僧祇輕者就不足為言故十誦云與學悔沙彌尼安居中犯僧殘聽比丘受日與摩那埵若學悔沙彌行婬盜殺妄還得波羅夷。",
    "X39n0714_002:0854a10_0": "問異部中四分僧祇重不重別計非相比欲顯二宗之意故此問之答中初句通示學悔預眾而不足數彼此皆爾故曰義同重犯結罪夷吉重輕故云文異律下別釋初明本部重結別下眾故引例可知次釋僧祇犯輕簡堪足故下引十誦示之先明不重唯約初篇僧殘已下例有重犯若下次顯初篇亦有重義謂同名之罪有重犯如前婬後殺等同種之罪不重犯如前盜後復盜等。",
    "X39n0714_002:0854a18_0": "【疏】問初篇二篇同壞眾一假僧治罸何故初篇著後亦如是二篇則無意有何義答初篇斷頭之罪疑謂一犯後不重科須安後亦殘是有餘無疑不著。",
    "X39n0714_002:0854a21_0": "次問中欲顯重犯之疑唯局初篇故約二篇相比為問答中可解。",
    "X39n0714_002:0854a23_0": "【疏】若爾初既重犯不應斷頭既喻斷頭亦無重犯答斷頭據果為譬重犯據戒猶存。",
    "X39n0714_002:0854b01_0": "難中重犯斷頭二義相奪不可齊立故引為難答中以各從一義故不相妨。",
    "X39n0714_002:0854b04_0": "四分律含注戒本疏行宗記二下之一",
    "X39n0714_002:0854b08_0": "四分律含注戒本疏行宗記二下之二",
    "X39n0714_002:0854b10_0": "【疏】就解戒本廣宗八篇次解第二。",
    "X39n0714_002:0854b11_0": "【疏】義門分別有八種意初明業不自成必由惑發雖眾多不出三毒故以篇戒配毒成相發雖在惑暢必在具所以第二配屬身口兩業乃現作必有由故次第三明自他義上顯成業由境而興故次第四遮性相攝然初制意為存道本故次第五配篇種類名相乃異須定行基故次第六持犯方軌凡所禁制約報彰持故次第七僧尼同異上雖張相未辨小學故最末論沙彌任運。",
    "X39n0714_002:0854b19_0": "釋僧殘篇初總列八段束之為四初即是惑二三約業四五六據教七八就人從二已下一一皆有結前生起遮性二位或約情非情或就事輕重並從境分故云由境也八篇戒相遮性統收故云相攝也為存道本者下篇諸戒為防四重四重即是入道之基故持犯總收四行四行統一切行故指持犯以為行基。",
    "X39n0714_002:0854c02_0": "【疏】初明第一配三毒者。",
    "X39n0714_002:0854c03_0": "【疏】就此十三初有七戒因雖三毒成必貪心次二謗戒因亦三毒成在瞋嫉二破兩戒亦因三事癡慢心成後有二戒因瞋癡起成亦同之。",
    "X39n0714_002:0854c06_0": "配毒中因即始起成謂究竟始終二心同異不等故須兩列然起不可定今但取成初七貪成者漏失等五從內色起二房由外事生二謗瞋嫉成者如律緣起瞋恨沓婆嫉他好請嫉對違境亦屬瞋中二破癡慢者癡謂立邪破正慢則稱佛自尊慢攝於癡後二瞋癡起成同者瞋謂遭擯被諫癡謂謗僧抵拒。",
    "X39n0714_002:0854c13_0": "【疏】若當講解須敘戒緣用顯三毒成業相貌。",
    "X39n0714_002:0854c14_0": "次廣敘中因佛制婬戒迦留陀夷欲盛次第起前四戒迦羅舊知媒法遂結第五佛聽造房比丘廣乞因制六七故總歸貪餘略如上至後注中更自委釋。",
    "X39n0714_002:0854c18_0": "【疏】故僧祇云有戒從貪欲生如弄身婬觸染語媒嫁也有罪從瞋恚生如無根謗毀呰驅出打搏等有罪從愚癡生如邊邪等見有罪非三毒生如無學犯。",
    "X39n0714_002:0854c21_0": "引證中僧祇通明諸罪非止一篇僧殘篇中止有七戒染語即兼二麤邪見即二破如無學犯者誤心遮也。",
    "X39n0714_002:0854c24_0": "【疏】第二明身口相者。",
    "X39n0714_002:0855a01_0": "【疏】漏失摩觸唯身心犯二房據本由身成犯亦有教人口業犯義自餘九戒口業成犯亦有身業助成之義如後四諫縱設不言隨滿便結何待口也意通前業不可別配。",
    "X39n0714_002:0855a05_0": "三業中初配漏觸但是身業而云心者以通從別相帶而言次二房亦有口業犯者如下教遣是也後九下明互造且舉諫戒不必假言而二麤媒嫁二謗如後戒本並通作相故意下若單意業未必有身口若身口業其必兼意業故云通前也。",
    "X39n0714_002:0855a10_0": "【疏】故僧祇云有罪非身口從心生即應問言何心取物殺人觸女斷草掘地是名取心不取事也有罪取事不取心者不應問他汝以何心婬飲酒與未受人宿過限隨有犯者當如法治。",
    "X39n0714_002:0855a14_0": "引證中除後三戒罪從境制(四分破僧從境同宿約心)自餘一切皆從心制故知無心不犯可證上文意通之義。",
    "X39n0714_002:0855a16_0": "【疏】第三教遣不同相者。",
    "X39n0714_002:0855a17_0": "【疏】二麤二房四戒自作成重故不須說教人作者於身無潤不同犯輕。",
    "X39n0714_002:0855a19_0": "教遣中通示四戒者一往麤分如下細簡。",
    "X39n0714_002:0855a20_0": "【疏】若二麤能所互有染隨染而結重。",
    "X39n0714_002:0855a21_0": "別釋中二麤能所互染者重不染者蘭義鈔云能所互有染心能所互輕重能所俱有染心能所同犯明有教人成重之義。",
    "X39n0714_002:0855a24_0": "【疏】若論媒相不問利非利俱同犯殘。",
    "X39n0714_002:0855b01_0": "媒嫁中初科古約得利今取染分故云不問等。",
    "X39n0714_002:0855b02_0": "【疏】昔人解云自重教輕者便引律云若我語僧恩不在我故知有利方結殘者不如此也斯引緣耳必結成業教他同犯如白二遣人媒合眾同犯者以染愛分故。",
    "X39n0714_002:0855b06_0": "古解中引律者即調部文彼因檀越憑求他女為婦僧為白二差使往問許已作使比丘念言我今若還白僧恩不在我即自往彼語居士已生疑白佛佛言眾僧偷蘭使比丘僧殘古謂僧犯偷蘭則是能教不得利耳不如此者斥其錯解以佛判僧蘭乃是方便非約不得利也斯引緣者指彼誤引以彼使言恩不在我乃敘本緣非正判犯故必下示正判也以僧犯蘭由不至果若同往報合眾皆殘故云必結等也如下引證亦出調部緣起同前但作使比丘問已還伽藍中白僧僧即告彼居士令知佛言一切僧殘愛染分者分字去呼謂皆沾染分故。",
    "X39n0714_002:0855b18_0": "【疏】若如二房亦有共作義亦同犯也。",
    "X39n0714_002:0855b19_0": "二房中共作同犯者雖是教他由有己分即如善見段段計人過量亦犯。",
    "X39n0714_002:0855b21_0": "【疏】二謗為言教人起謗損境暢思不問為己不為己皆同犯也。",
    "X39n0714_002:0855b23_0": "二謗中初文誣污清人損境情重故不獨為己。",
    "X39n0714_002:0855b24_0": "【疏】有人云不同犯所以然者若教他言持我三根往謗彼人僧若撿校不問所教故知是輕故善見云慈地得殘能教人也尼得吉羅所教人也。",
    "X39n0714_002:0855c03_0": "次科初標所立所下釋成故下引證以慈地比丘教妹尼對眾僧前謗沓婆故。",
    "X39n0714_002:0855c05_0": "【疏】任情所存然作業是重未可同於外部。",
    "X39n0714_002:0855c06_0": "三中初句縱古然下奪歸今判古據善見乃執異部耳。",
    "X39n0714_002:0855c08_0": "【疏】次有六戒教人但輕漏失摩觸及四諫戒若僧未設諫教者但吉若僧設諫教莫捨者蘭以有僧命眾法可違故漏觸教人成者犯蘭義不待言。",
    "X39n0714_002:0855c11_0": "釋後六戒正示中初總示若下別釋先釋四諫漏下次釋漏觸不待言者以易知故。",
    "X39n0714_002:0855c13_0": "【疏】問如漏觸教若未成但犯吉羅如何四諫作未成犯已結蘭者答不同也彼但自壞損他又無僧命可違故待事成方蘭此諫教人自他俱損復有違於眾法反前故重。",
    "X39n0714_002:0855c17_0": "初問以漏觸四諫教人未成結犯輕重故問釋之答中初句略示彼下正釋初明漏觸反下二義文多自壞二字義鈔云彼教人者但是損他可驗傳誤此下次明四諫相比可知。",
    "X39n0714_002:0856a03_0": "【疏】問所諫之人違白未竟但結吉羅何以能教犯重所教輕者解云所諫結罪因果分齊違白若竟其果是蘭故白未竟其因但吉又有僧殘重果可趣能教之人無果可趣隨語違命故但偷蘭。",
    "X39n0714_002:0856a07_0": "次問所教拒眾應合犯重能教語助理合過輕事乖常理故須問釋解中初明所諫犯輕二義通之初對前輕過釋此就一白自分因果果既是蘭因不當重又下望後重果釋由後有重故結前輕能下次釋能教重義言無果者無上二果當體即果故。",
    "X39n0714_002:0856a13_0": "【疏】次明遣人謂九戒遣人為己作者同於自犯如漏觸於己身之類也四諫無有教人為己違諫故所不論。",
    "X39n0714_002:0856a16_0": "遣人中教謂令彼自為遣即使他就己如漏觸等舉事可為眾法行諫必對犯人止容自拒故無遣義。",
    "X39n0714_002:0856a19_0": "【疏】第四明於遮性之義。",
    "X39n0714_002:0856a20_0": "【疏】媒嫁二房是惡名遮自餘十戒體是不善名性惡也以媒房等自損妨道等同殘業者如母論云結戒法異輕制重名欲令行者稀而不為令進道也。",
    "X39n0714_002:0856a23_0": "遮性中初總分諸戒以下別釋媒房初約事輕徵其所以如下引論釋通初正釋彼分四位犯重報輕(如疏所引)犯輕報重(如殺畜等)犯報俱重(四夷等是)犯報俱輕(誤心吉等廣如事鈔持犯篇明)欲下顯意。",
    "X39n0714_002:0856b03_0": "【疏】第五明戒皆初篇種者。",
    "X39n0714_002:0856b04_0": "【疏】如多論云如初四戒各有種類。",
    "X39n0714_002:0856b05_0": "種類中多論云二百五十戒以類而言有四種類以罪而言有五差別即四戒為種下篇為類。",
    "X39n0714_002:0856b07_0": "【疏】何以知然如十三中初有五戒三十中尼衣使浣染毛三戒九十中與女人說法同宿安坐強坐露坐教尼已下有十戒悔過法中第四戒於眾學中高眄視等屬婬種類。",
    "X39n0714_002:0856b11_0": "初淫中十三有五(漏觸麤歎媒)三十有三(如疏)九十有十五戒上列五戒露坐即在教尼下十中則有十四準論後列與女議共道行乃成十五文中闕之上四可知(同宿通道俗餘三對俗女)教尼下十(一輒教二日沒譏三教四同道五同船六與衣七作衣八屏坐九與女露坐十尼贊食第九對俗女餘並對尼)悔過第四即蘭若受女人食眾學高眄視彼因佛入舍衛人民於屋樓閣看佛及僧六群仰視男女好醜因制不得眄視入白衣舍及坐二戒即四分左右顧視(已上二十六戒)。",
    "X39n0714_002:0856b20_0": "【疏】二房畜寶貿寶販賣乞縷奪衣迴僧藏衣用淨賊期四悔學家覆食汙草水等為盜種類。",
    "X39n0714_002:0856b22_0": "盜中十三有二(二房)畜下即三十準論有七文闕勸織藏下即九十有三(用淨即真實淨輒著戒)四悔中學家盜攝者以僧法制斷往受同盜故覆下眾學中三(覆食即以飯覆羮草水即生草淨水二戒十誦因六群從守園人索菜令浣衣彼不與菜及不浣衣乃於菜淨水中大小便由壞他物故落盜中已上十六戒)。",
    "X39n0714_002:0856c03_0": "【疏】汙家憍奢用蟲飲蟲殺畜打摶尼食大摶便於草水並殺種類。",
    "X39n0714_002:0856c05_0": "殺中汙家即十三中一若取擯謗合在妄中今取汙家令他不得供給故在殺中(或取惡行種華溉灌於義似疎)憍奢三十中一即四分蠶綿臥具也用下九十中五尼食即四悔中初戒因取尼食令彼飢困故大摶下眾學中三大摶在殺者或能令他不得食故(或云容有食曀致死者非)草水即上盜中二戒望損物命又在殺中義通兩用故列前後(已上十二戒)。",
    "X39n0714_002:0856c12_0": "【疏】二謗兩破戾語一二居士王臣妄語次十指授食說法戒等並妄種類。",
    "X39n0714_002:0856c14_0": "妄中初十三中五戾語即惡性不受語也一下三十中三妄下九十中十(一妄語二毀呰三兩舌四僧斷事發起五為女說法六以偈句教未具七未具前說過人法八說麤罪九與欲後悔十毀毗尼)指授即四悔中第二佛令呵止不呵而食而食故在妄攝說法等者即眾學諸戒十誦二十一條(一騎乘二在前三在道四在座五人坐六人臥七覆頭八褁頭九叉腰十現胸十一現脇十二抄衣十三左右反抄十四放衣挑十五著屐十六著革屣十七捉杖十八捉蓋十九捉五尺刀二十捉小刀二十一捉弓箭四分但有二十已上總四十戒)。",
    "X39n0714_002:0856c22_0": "【疏】講者不可單歷欲令他解次第張相結過屬著豈不然乎疏者加之甚易恐繁故也。",
    "X39n0714_002:0856c24_0": "結示中初令廣示疏下次顯文略疏中準論總配九十三戒餘雖不出大略可知但不顯攝屬之意故令講者臨文提示然今記中隨有隱者已略明之餘如圖相一一列示。",
    "X39n0714_002:0857a04_0": "【疏】第六明持犯方軌唯有二房具兩持犯餘名止持造則作犯。",
    "X39n0714_002:0857a06_0": "持犯中標判者前約心用教行以明雙持今就戒本須從後義。",
    "X39n0714_002:0857a08_0": "【疏】若為明者。",
    "X39n0714_002:0857a09_0": "【疏】如昔解云止不作房名止持從僧乞法名作持言二犯者止不乞法名止犯作房成者名作犯據犯名體是一據持名體各異。",
    "X39n0714_002:0857a12_0": "釋中初科引古又二初列示四行彼約守戒無汙為止持故云止不造房也造房乞法方有作持兩犯據下次總判名體據犯名體一者文誤準義鈔合云名異體一言名異者止作別故言體一者同造作故據持名體異者名異同上言體異者止持守戒不為作持造房乞法今詳古解略指三失彼以止不作房而為止持則全不曉持義前約四心分為二別行前三心體無汙染義名止持行心思慮業相顯彰方得名持豈有不為而名持耶又止持作犯須約一事相翻以明若謂不作名止持作成名作犯則事非一體義非相翻又若不作即名止持則應不問量之如非但使作房即成作犯又復依量而造為屬何持若屬止持理應不可若屬作持且非乞法是則二持俱無所屬又雙持雙犯亦據一事而分止作今既二持名體各別則非雙持之義不可立矣略言三過餘如正解。",
    "X39n0714_002:0857b04_0": "【疏】今解持犯之生皆從法起違順教相故有犯持據房為言事法分二各具二持名體須顯安有端坐不修為持如殺盜等隨境制禦識達業相方成前行號曰止持豈可臥地我不殺生便於生境能發隨戒戒隨三善緣境而生前立義中約行明持無問止作前之三心不名持犯云何此中我不造房名為止持義不可也。",
    "X39n0714_002:0857b11_0": "今破中初通示持犯之本法即是教未立教法無持犯故據下別示房戒初立正義反古三失事法各具止作名體如下所顯安下次斥古非初舉重戒例破禦謂正念離非即能治之行識達謂明辨行相即解教之智必須此二方得成持自餘悠悠但名泛善學者臨文細意詳究戒隨下次約隨戒飜破指前立義者即持犯成就中今師必據造房以明與古全異故此斥之。",
    "X39n0714_002:0857b19_0": "【疏】故前義立後以事法明持犯相如此可識。",
    "X39n0714_002:0857b20_0": "次科生起中上句結前餘文生後事理合作事法寫誤。",
    "X39n0714_002:0857b22_0": "【疏】就房事明持犯者依教不越名止持驗教知量名作持出於教量名作犯不順教故名止犯此則約其度量顯其違順止作持犯名體各別。",
    "X39n0714_002:0857c01_0": "次分事法中初科四行舉要為言止取離過望不犯罪則名止持反成作犯作取修善望依制法名曰作持反則止犯方顯四行名體不濫驗合作撿度量即長廣制法。",
    "X39n0714_002:0857c05_0": "【疏】次就法論恐犯教制如法無違名止持從僧乞法名作持故違不乞名作犯即此違教名止犯此亦名體各別止據無違作據順教極分明也若有昧者翻犯可知。",
    "X39n0714_002:0857c09_0": "後法中先列四行止據下重示二持令翻犯者古謂乞法但有作持及以兩犯既存兩犯必具二持以翻作犯即止持故。",
    "X39n0714_002:0857c12_0": "【疏】問準此持犯與前既乖約事明作身營可悉故犯僧殘約法明作其相如何答此之過量及以不乞緣雖兩望果由房結對相思事隨有四違纔一舉手營搆土木即有偷吉四罪隨生安有過量偏屬作犯若如此問後戒無過無作犯矣準此成例身業是過約緣分罪隨多少也。",
    "X39n0714_002:0857c18_0": "問中意者以不乞法但是不為何有作犯故躡前事相比徵之答中初正答兩望即過重處分此謂不乞還望造房得有作義對下次斥偏局又二初約多罪難對相即房境思事即行心籌度事法各有止作兩犯故云四違偷吉此約方便二作犯兩蘭二止犯兩吉(或將妨難二處為二吉者妨難之罪但是離過單持所攝非此所明)若下次引後戒例難此二重難雖釋前問乃是對破古師耳準下結顯後戒無過而有作犯可例此戒具二作犯既有二作則兼兩止並望身業造作過量具兼四犯又復乞過有無不定故云約緣等也。",
    "X39n0714_002:0858a05_0": "【疏】今以句法用收教相意同持犯方軌中說九人造房中有迷悟一人識達法犯無疑故不結其不學無知餘之八人隨相多少。",
    "X39n0714_002:0858a08_0": "歷句中初科為二初指前文九人下示立句。",
    "X39n0714_002:0858a09_0": "【疏】初但一句識法識犯法謂白二犯謂僧殘既隨僧乞名曰作持於僧殘罪欲犯不得名曰止持如此約句何有不解。",
    "X39n0714_002:0858a12_0": "上品中初標句法謂下釋相既下判行復示雙持於義益顯仍斥偏執。",
    "X39n0714_002:0858a14_0": "【疏】中有四句一識法疑犯二識法不識犯三疑法識犯四不識法識犯並乞造房同號作持由於法犯迷而不學各有罪故。",
    "X39n0714_002:0858a17_0": "中品列句結行在文易解。",
    "X39n0714_002:0858a18_0": "【疏】問罪是止犯作持何用答就事作故無犯名持何妨於法無學故結。",
    "X39n0714_002:0858a20_0": "問答者以持中說犯理不當故。",
    "X39n0714_002:0858a21_0": "【疏】下品四句一疑法疑犯二疑法不識犯三不識法疑犯四不識法不識犯。",
    "X39n0714_002:0858a23_0": "【疏】所言疑者疑法白二白四或用單白直和或須不須故曰疑也言不識者謂直單白不須白二或須白二不識通塞亦是不識對法既爾約犯僧殘迷疑同此。",
    "X39n0714_002:0858b03_0": "下品釋迷疑中迷即不識言約犯同者疑謂為殘為蘭為無罪等迷謂直犯蘭吉等。",
    "X39n0714_002:0858b05_0": "【疏】既無識兼不及中故名為下品若論法犯俱有迷者最是下下之人而名持者由於僧殘有乞無犯。",
    "X39n0714_002:0858b07_0": "示品位中初三句正示無識兼者異前中品半識相兼故若下別簡末句而下結行。",
    "X39n0714_002:0858b09_0": "【疏】問等同不學疑迷二相結罪不同者答疑兩緣生故是解律分有智性故結吉羅不識不爾癡故昏迷同於黑業故結提也如上廣之。",
    "X39n0714_002:0858b12_0": "門中但問無知兩結之意答中初明疑相由半涉是非故云兩緣生也(解律字有改為津非)不下釋迷相黑業經論明白黑二業即善惡也此雖非惡由癡暗心縱毒成業故云同也。",
    "X39n0714_002:0858b16_0": "【疏】第七僧尼不同門者輕重分戒有六不同。",
    "X39n0714_002:0858b17_0": "僧尼中尼十七戒今約僧中十三對明同異。",
    "X39n0714_002:0858b18_0": "【疏】言漏失者僧重尼輕如多論解女人煩惱染重難拘難制若制與重罪惱眾生故也又云女作在屏苦乃盈流故輕男子不爾隨事能出故重。",
    "X39n0714_002:0858b21_0": "明異中初科言尼輕者但犯提故多論二義初約染心男輕女重教必隨教又下次約難易則男易女難教則緩急。",
    "X39n0714_002:0858b24_0": "【疏】摩觸一戒尼重僧輕所以然者尼則煩惑情重既受摩捉必為陵逼成大過故方便之內制與重名丈夫摩捉必無陵壞不假深防但就限分故制輕也又女人貪觸情重律有背夫從觸之相如彼賢愚試蛇以[疊*毛]女住男去情有著故。",
    "X39n0714_002:0858c05_0": "摩觸中初正示尼重即八夷之一所下顯意兩義明之初約陵壞有無又下次約觸情輕重律下引證律明女人有十種惡業第六謂體背夫主若見端正男無羞追逐下至從彼受於觸樂賢愚云時特叉尸梨舍衛二國不和特叉王欲試舍衛有聖智否遣使送二蛇麤細長短相似能別雌雄斯為大善波斯匿王及諸群臣無能識者時梨耆彌歸問兒婦婦言以一端細[疊*毛]敷置於地取此二蛇著上雌者靜然雄則搔擾何以知之女之為性愛著細滑得軟生染不欲動搖男子性剛轉側不安故可別也疏云女住男去即雌者靜然雄者搔擾也。",
    "X39n0714_002:0858c16_0": "【疏】言二麤語僧重尼輕男則剛獷無羞為之事數故重女則輭弱多恥為之義稀又趣重果方便縱造但結蘭罪。",
    "X39n0714_002:0858c19_0": "二麤尼輕但犯蘭故亦約二義釋之初約稀數又下次就趣果問比丘為婬故語為得何罪答亦方便蘭若爾與尼不異何以尼眾一向結蘭答女既耻為自非交染必無泛語若爾必非期婬為語何罪答如文亦蘭但非因罪耳。",
    "X39n0714_002:0858c24_0": "【疏】二房亦爾所以不同僧是多利孤遊造房事數故重尼則反前故輕又如多論二人共造不獨宿故人無房量縱有過者輕而不重。",
    "X39n0714_002:0859a03_0": "二房中尼蘭同上故云亦爾所下徵示初約稀數釋尼反前者化緣微寡則非多利出處須伴則非孤遊又下次約共不共釋人無房量者由是共造各不滿量也。",
    "X39n0714_002:0859a07_0": "【疏】媒謗已下同犯可知。",
    "X39n0714_002:0859a08_0": "顯同中媒嫁二謗四諫共七戒二眾不異。",
    "X39n0714_002:0859a09_0": "【疏】第八明方便任運義者如沙彌時遣人為己麤語歎身媒嫁二房及以二謗進受戒已前所遣人七事成就三性之中任運成殘餘無遣人同犯義故不說任運。",
    "X39n0714_002:0859a13_0": "任運中但使有遣人義即有任運初明有中文列七戒餘下二明無謂漏觸樂在他四諫須身現。",
    "X39n0714_002:0859a15_0": "【律】諸大德是十三僧伽婆尸沙法半月半月說戒經中來。",
    "X39n0714_002:0859a17_0": "【疏】次消文中標釋結並同須引。",
    "X39n0714_002:0859a18_0": "牒釋中先示三章八篇皆爾。",
    "X39n0714_002:0859a19_0": "【疏】就釋相中。",
    "X39n0714_002:0859a20_0": "【律】初故出不淨戒。",
    "X39n0714_002:0859a21_0": "【疏】第一漏失戒。",
    "X39n0714_002:0859a22_0": "【疏】此戒人多喜犯者良由放逸心性不思死至故也若依涅槃常思觀察我此生死未有邊際世之事者無由造矣多論云佛所以不聽者為令正法久住故又止誹謗故又欲生天龍善神信敬心故又婬欲惡法正是生死之源障道根本理宜制斷令梵行清淨故。",
    "X39n0714_002:0859b04_0": "釋初戒制意中初敘過本引涅槃以證次明制意引多論委示文列四義初住持二四滅惡三是生善鈔云四律並言云何以不淨手受人信施。",
    "X39n0714_002:0859b07_0": "【疏】次釋戒名者方便動轉標心究竟名之為故體分盈流故曰也。",
    "X39n0714_002:0859b09_0": "釋名中體分即不淨。",
    "X39n0714_002:0859b10_0": "【疏】言具緣者但唯三緣一標心出不淨意二方便動轉三出便犯。",
    "X39n0714_002:0859b12_0": "具緣有三隨境成犯故不列境。",
    "X39n0714_002:0859b13_0": "【註】佛遊舍衛城迦留陀夷欲意熾盛身色瘦悴獨處一房好牀蓐被地施敷具飯食豐足隨念弄失諸根悅豫顏色光澤諸比丘舉過白佛佛無數訶責已而制此戒。",
    "X39n0714_002:0859b17_0": "【疏】就戒緣中明獨處安敷故起逸過豈非不思世間不可樂想故致斯過也。",
    "X39n0714_002:0859b19_0": "戒緣同上制意不可樂想者謂觀世間無常不淨生厭離故。",
    "X39n0714_002:0859b21_0": "【律】若比丘故弄陰失精。",
    "X39n0714_002:0859b22_0": "【疏】就戒本中四句。",
    "X39n0714_002:0859b23_0": "【疏】初能犯人。",
    "X39n0714_002:0859b24_0": "【疏】二故弄下明其過業男陰女陽之相無暇述之生沈終浮死則伏仰異也。",
    "X39n0714_002:0859c02_0": "次句釋文中男體是陽而用屬陰女體是陰其用屬陽凡人溺水生則沉下死則浮上男伏女仰可驗陰陽今戒制僧故目其根以為陰耳。",
    "X39n0714_002:0859c05_0": "【疏】精者持身之寶也必徧身分中如善見所釋律中分色輕重乃至二果色如漿者欲心薄也。",
    "X39n0714_002:0859c07_0": "釋精中指善見者彼云舉體有精除髮爪及燥皮無也律下彼云精有七種一青者轉輪聖王二黃者輪王太子三赤者犯女色多四白者負重人五黑者輪王第一大臣六酪色者須陀洹七如疏引。",
    "X39n0714_002:0859c11_0": "【註】實心故作出不淨意前境有六若於內色外色內外色若水若風若空隨作方便若出即犯。",
    "X39n0714_002:0859c13_0": "【疏】注解云實心故作者謂非心所行不名犯也解上故字也。",
    "X39n0714_002:0859c15_0": "釋注初科非心不犯者反釋實心故作成犯。",
    "X39n0714_002:0859c16_0": "【疏】言境有六者據戒無境也何以知然若空動身亦名犯也若不出境通收內外恐漏罪網故便列之。",
    "X39n0714_002:0859c18_0": "境中初云無境者以隨緣可出非局一境故引空動證無可知若下次明律中列境之意內外如下所列。",
    "X39n0714_002:0860a03_0": "【疏】言內色者律中受色謂心領納名之為受與受相應色名為受色即是人身有識持者二外色者謂非情色也三內外色者兩色中間也五分云內色己身外色他身也四者水中逆順而出也五者風中相同於水乃至口吹者六者動身也文相可解。",
    "X39n0714_002:0860a08_0": "別相中初釋三色內即有情通於自他(如自手或他身分是)外即非情(牀褥壁穴等處)兩色中間即兼二色(如以手持物他身衣障等)前釋受色受即四陰之一心依色陰和合成身故云相應色也即人身下直指其相人身即色識持即心(人多錯解故委示之)次引五分示不同相本宗自他並是內色四水五風並謂逆順觸根皆可出故第六即空為境。",
    "X39n0714_002:0860a15_0": "【律】除夢中。",
    "X39n0714_002:0860a16_0": "【疏】三除夢中者開緣也。",
    "X39n0714_002:0860a17_0": "【註】佛言亂意睡眠有五過失一者惡夢二者諸天不護三者心不入法四者不思惟明相五者於夢中失精善意睡眠有五功德即反上句也。",
    "X39n0714_002:0860a20_0": "【疏】注解善惡兩夢其相可知。",
    "X39n0714_002:0860a21_0": "【疏】善見論夢有四種一四大不和故夢如見山崩地動飛騰虗空虎狼賊逐等二先見故夢如晝見青黃男女夜則夢見三天人與夢或有善惡天子為現善惡兩夢四想心故夢此人前身為福則有善夢誦經禮佛等若為惡者則見殺盜等前二不實經云如夢幻等是也後二為實經云但取夢相如方等佛名所說。",
    "X39n0714_002:0860b04_0": "第三句釋注引教中初科前列四種後總判虗實如夢等者經中多取喻法不實故如方等者悔法有三一無生二作法三取相彼明取相故令求夢以表罪滅此皆聖人所示如上第三是也。",
    "X39n0714_002:0860b08_0": "【疏】如善見云夢通三性若見禮誦是善性乃至見青黃赤白為無記也。",
    "X39n0714_002:0860b10_0": "次科引示中乃至者文略夢殺生偷盜姧婬是不善性。",
    "X39n0714_002:0860b12_0": "【疏】若爾三性豈非罪耶如成實夢中成業如蛐蟻等是以律中五種過失豈非罪也如五分中不攝而眠五吉羅也此云不犯開於殘耳。",
    "X39n0714_002:0860b15_0": "徵釋中躡上惡性以難今開如下釋通初引成論明結業如蛐蟻者示感報也次引二律明違制律中者如注所引過失即罪但無罪目故引五分決之義鈔明夢業不感總報不無別報。",
    "X39n0714_002:0860b19_0": "【疏】如僧祇中云夢者虗妄不實若有實者於我法中修梵行者無有解脫以不實故得盡苦際。",
    "X39n0714_002:0860b21_0": "三中引祇律者以修行者尚有夢中造罪由無實故不能障道。",
    "X39n0714_002:0860b23_0": "【律】僧伽婆尸沙。",
    "X39n0714_002:0860b24_0": "【疏】僧伽婆尸沙下結罪名。",
    "X39n0714_002:0860c01_0": "【註】若方便弄不失偷蘭比丘自相教若失犯偷蘭不失突吉羅尼波逸提下三眾吉羅不犯者一切不作出精意。",
    "X39n0714_002:0860c04_0": "【疏】下注解辨相可知。",
    "X39n0714_002:0860c05_0": "第四句點注中亦應科分犯與不犯犯中分三初明方便次辨相教後對餘眾。",
    "X39n0714_002:0860c07_0": "【律】二觸女人戒。",
    "X39n0714_002:0860c08_0": "【疏】第二觸女戒。",
    "X39n0714_002:0860c09_0": "【疏】佛所以制者多論云有六義一者出家之人飄然無所依止今制此戒與之作伴有所依怙故二者息諍根本故三為息疑嫌心不但為捉而已言即作大惡故四為斷大惡之源禁微防著故五為護正念若捉女人失正念故六比丘出家理應跡絕塵染標心累外為世軌則若捉女人則喪世人崇敬心故。",
    "X39n0714_002:0860c15_0": "二摩觸戒制意中一五六生善意二三四滅惡意息諍者人多妬色故息疑心者疑謂作婬故云大惡失正念者以著欲樂不能攝故。",
    "X39n0714_002:0860c18_0": "【疏】次辨釋名者輕重離合三意。",
    "X39n0714_002:0861a01_0": "【疏】言釋名者身相摩對名之為觸故曰也。",
    "X39n0714_002:0861a02_0": "釋名可知。",
    "X39n0714_002:0861a03_0": "【疏】言輕重者。",
    "X39n0714_002:0861a04_0": "【疏】問僧尼俱觸而罪有輕重二人俱宿而罪無階降者答觸對為言陵不陵別故夷殘宿中懸對譏義是同故俱提也。",
    "X39n0714_002:0861a07_0": "輕重中問意以二眾觸宿結犯不等故答中上明觸別下示宿同未即有譏先防而制故云懸對。",
    "X39n0714_002:0861a09_0": "【疏】若爾如尼受染心衣食共男入室譏義不殊何為階降答染心衣食深防重罪故重共入闇室當相譏疑故輕故非決也。",
    "X39n0714_002:0861a12_0": "轉難中受染心衣食犯殘共男入暗室結提此引尼戒難前同宿譏同罪等答中初明染心不就譏論故異次明入室從譏故同異上懸對故云當相制緣既異不可相決故云非也或可決合作例。",
    "X39n0714_002:0861a16_0": "【疏】言離合者有人問曰九十制坐則尼女分戒十三明觸則道俗同罪者何。",
    "X39n0714_002:0861a18_0": "離合中問意可解。",
    "X39n0714_002:0861a19_0": "【疏】昔齊大德隱律師曰結罪便故所以合之若對比丘二女俱殘若對於尼二男俱重故不分戒九十須離者僧對二女俱提理應須合但結尼罪則道俗輕重不同故使離之。",
    "X39n0714_002:0861a23_0": "釋中初科初總示即高齊曇隱依光師學律撰鈔四卷今用彼文若下別釋初明觸合僧尼二觸並合制故九下次明坐離尼對比丘屏坐吉俗男則提此謂因尼犯不同致僧戒兩立。",
    "X39n0714_002:0861b03_0": "【疏】若爾者尼離五衣俱提如僧對二女坐提僧則三重二輕相同尼對二男坐也此亦輕重不同何為得合答若就二三結罪不同實亦應離俱對受法以明離故合也然前屏露直是事中之譏隨義故別不同衣有聖法對法以明同離故不分之。",
    "X39n0714_002:0861b08_0": "次難中初引僧尼離衣相並前既尼犯兩別僧坐因離此亦僧制重輕尼衣何合答中初縱奪釋通然下事法對簡事中譏者與尼坐戒律因迦留陀夷與偷蘭難陀尼共坐居士譏嫌與女露坐亦因迦留與優婆私坐乞食比丘嫌故白佛等隨義別者即上對尼輕重之義不同衣者五衣加受離失不異故。",
    "X39n0714_002:0861b15_0": "【疏】又難若使結罪便故戒不分者如下行戒僧則二女俱提尼則二男俱吉此亦是便何故分耶答結便應合開緣有異故離如尼女同行尼則開僧將援俗女則無又尼行必假多伴為除譏醜俗女但有第三便無濫過所以分也。",
    "X39n0714_002:0861b20_0": "後難中以同行戒彼此犯同亦應須合答中初句縱次句奪如下引緣以釋初約將護有無釋又下次約伴行多少釋下云行途逈遠招譏過大縱多比丘一尼亦犯要得多尼為伴方開。",
    "X39n0714_002:0861b24_0": "【疏】三具緣成犯有五一人女二人女想三有染心四二俱無衣五著便犯。",
    "X39n0714_002:0861c02_0": "【疏】闕緣中境心二闕略同前篇罪輕為別。",
    "X39n0714_002:0861c03_0": "闕緣中初二指前非畜等替心定境差名闕境前境不改非畜疑想則是闕心歷句辨犯輕重有無同故不出。",
    "X39n0714_002:0861c06_0": "【疏】闕第三緣無染心者無罪或結非威儀十云若女為水所沒開令接出雖婬心起但捉一處莫放至岸更捉僧殘僧祇中若他女人沒水作地想者持出不爾者與竹木繩索等。",
    "X39n0714_002:0861c10_0": "闕第三中初正明或結非威儀者鈔引僧祇若共女人捉物呪願捉器行食等皆非威儀有欲心者吉十下引示十誦婬心由是開緣故無所犯捉一處者開中制也至岸無開乘前欲心再捉成重僧祇地想治勝故開治力未充則不開捉故云不爾等鈔云十誦四分開處猶多僧祇水溺難緣至死不開是也。",
    "X39n0714_002:0861c17_0": "【疏】闕第四緣二俱有衣吉羅互有衣偷蘭。",
    "X39n0714_002:0861c18_0": "闕第四中通上具緣二俱無衣共為四句結犯階降。",
    "X39n0714_002:0862a02_0": "【疏】闕第五緣隨有遠近方便二偷蘭故。",
    "X39n0714_002:0862a03_0": "闕五中遠合作次遠方便吉具蘭並歸第三緣明之。",
    "X39n0714_002:0862a05_0": "【疏】不同昔人受樂便犯但先有染來觸於女著便是犯何得論樂故十誦云比丘觸女不問樂不樂皆殘若女來觸比丘要須動身受樂結殘餘廣如鈔。",
    "X39n0714_002:0862a08_0": "斥古中初斥非故下引證往來兩分據斷有準下指鈔者彼分三別一比丘往觸不問樂不樂二女觸比丘動身受樂殘(亦準十誦)三不動受樂律但結吉鈔約先有染心不動犯蘭動亦得殘。",
    "X39n0714_002:0862a12_0": "【疏】問婬觸近重境犯殘非方便盜四亦近重而成方便者。",
    "X39n0714_002:0862a14_0": "問中以隣重既同而因果制別故以為問。",
    "X39n0714_002:0862a15_0": "【疏】答盜五必假四故四而非重大婬不假觸故觸非方便故多論云犯婬不假他如己二處也。",
    "X39n0714_002:0862a17_0": "初釋引論自婬以證。",
    "X39n0714_002:0862a18_0": "【疏】又云盜有續成重故作方便名再觸非大婬如何結究竟如律云再盜不滿五佛言相續夷。",
    "X39n0714_002:0862a20_0": "次釋引律此據初盜期心未遂必作斷心多反亦蘭。",
    "X39n0714_002:0862a22_0": "【疏】又內外起心異故分因果別。",
    "X39n0714_002:0862a23_0": "後釋中婬為內觸心期婬事觸則因蘭摩是外觸即成殘果故云因果別盜唯外起無別因果。",
    "X39n0714_002:0862b01_0": "【註】佛在舍衛國迦留比丘以佛前制便在內外伺諸婦女將至房中手捉捫摸樂者便笑有不樂瞋恚罵辱諸比丘舉過白佛便集僧制戒。",
    "X39n0714_002:0862b04_0": "【疏】就戒緣中俗女譏笑有二相者如薩婆多云諸女何以來者一以世俗忽務出家住靜安樂故二善友知識聞法故三僧房嚴飾可觀故何故入房者謂出家人斷欲清淨信無疑故何為笑罵者一有欲心多少故二為知識非知識故三樂覆樂露故四有親有難無者無故如是應知。",
    "X39n0714_002:0862b10_0": "戒緣引論次列三意初女來意復有三別次入房意言無疑者信彼出家必無欲故後笑罵意中四句雙列分配笑罵上二可知三中樂覆則笑樂露則罵四中有親則畏難故罵無親則無畏難故笑。",
    "X39n0714_002:0862b14_0": "【律】若比丘婬欲意。",
    "X39n0714_002:0862b15_0": "【疏】戒本五句初犯人二染心三女人者觸境四身相觸下明過業五若觸下結罪。",
    "X39n0714_002:0862b17_0": "【疏】就解文相言欲意者明本緣也凡有觸女不必皆殘故出其心用成業本。",
    "X39n0714_002:0862b19_0": "戒本第二句中初釋欲意言本緣者以愛染心是觸之本凡下顯示戒本須出之意。",
    "X39n0714_002:0862b21_0": "【註】愛染汙心。",
    "X39n0714_002:0862b22_0": "【疏】注云愛染心者心本性淨由愛染之故曰也然愛有二相如子之愛二親如父之愛一子斯則念之重也今言愛者謂婬欲染汙之愛也非淨心故。",
    "X39n0714_002:0862c01_0": "釋注中但云愛染則知欲意非為期婬然下簡辨愛心明非通濫。",
    "X39n0714_002:0862c03_0": "【律】與女人。",
    "X39n0714_002:0862c04_0": "【疏】言與女人明其觸境女名乃通人趣別也如下輕重對趣分心。",
    "X39n0714_002:0862c06_0": "第三中如輕重者指注辨相若準下文但明畜吉鈔引僧祇非人女亦吉釋云謂無婬心意顯有婬心理應結蘭罪。",
    "X39n0714_002:0862c09_0": "【註】謂境有四覺睡新死及少分壞。",
    "X39n0714_002:0862c10_0": "【疏】就境有四覺睡生分新少死分也。",
    "X39n0714_002:0862c11_0": "釋注中總約生死用收四女。",
    "X39n0714_002:0862c12_0": "【律】身。",
    "X39n0714_002:0862c13_0": "【註】從髮至足。",
    "X39n0714_002:0862c14_0": "【疏】言身相觸約其業相也從髮至足者括結兩頭綱網徧也。",
    "X39n0714_002:0862c16_0": "第四句釋身中初點文從下釋注身相多別觸皆成犯髮足二字統攝一身無不盡故綱網徧者教制無遺故。",
    "X39n0714_002:0863a01_0": "【律】相觸。",
    "X39n0714_002:0863a02_0": "【註】若捉摩重摩或牽或推逆摩順摩或舉或下或捉或捺若餘觸方便。",
    "X39n0714_002:0863a04_0": "【律】若捉手若髮。",
    "X39n0714_002:0863a05_0": "【疏】言相觸者律明觸相乃有十種易解若捉手髮者手謂犯起先由髮謂釋除疑結也時有疑云捉手身肉則有適樂細滑髮是身分何業之有而結罪耶故今以髮入於戒本但著則犯由染汙心。",
    "X39n0714_002:0863a09_0": "觸相中初科前指律中十種者如注所列今引律釋之一捉摩者摩身前後二重摩(律文不釋相亦同上但重為別)三牽者牽前四推者推後五逆摩者從下至上六順摩者從上至下七舉者捉舉上八下者若立捉令坐九捉者捉前捉後捉乳捉髀十捺者以手按也(四處同上捉中)若下次點戒文二相時下別釋除疑初敘疑情故下示出意。",
    "X39n0714_002:0863a16_0": "【疏】今四分中不分其相應以四句明其輕重覺不覺境如是分之故善見云髮髮相著爪爪相觸悉得偷蘭俱無覺故若互觸者理結僧殘同戒本也。",
    "X39n0714_002:0863a19_0": "歷句中初指句一覺觸不覺(手捉髮爪)二不覺觸覺(爪觸女身)三覺觸覺(上三並殘)四不覺觸不覺(偷蘭如下引)故下次引善見別證第四句若互下後約義意決前二互鈔引十誦互觸並蘭今據戒本捉髮成重故云理結僧殘等(舊云此決初句次句亦蘭然今文中但云互觸須通兩句)。",
    "X39n0714_002:0863a24_0": "【律】若觸一一身分僧伽婆尸沙。",
    "X39n0714_002:0863b01_0": "【疏】若觸一一下引業成過也。",
    "X39n0714_002:0863b02_0": "第五文中二句躡前觸相結成罪名故云引業成過。",
    "X39n0714_002:0863b04_0": "【註】若觸四女著便僧殘女觸比丘動身同犯若不動身但犯吉羅先有染心偷蘭互觸有依偷蘭俱有衣者吉羅若與二形相觸偷蘭若以欲心觸男子身或衣坐具乃至自觸及以畜生一切突吉羅尼波羅夷下三眾吉羅不犯者有所取與戲笑相觸是也。",
    "X39n0714_002:0863b09_0": "【疏】就注解人女中三位初二俱無衣分二初明比丘觸四女相後明女來觸比丘相犯有輕重可解耳二明互觸有衣相計應約身動不動約心樂不樂分輕重以偷蘭含故文中不分也對後俱衣例同下斷。",
    "X39n0714_002:0863b13_0": "釋注犯中初科三位初對文可見次互有衣中言計應者亦須同上分二比丘觸女並蘭女觸比丘動身受樂亦蘭不動但吉先染亦蘭偷蘭含者由互觸中多結偷蘭罪相通含故不別舉也對下即第三俱衣亦應分二往觸來觸動及不動無非吉羅故云例同下斷也。",
    "X39n0714_002:0863b19_0": "【疏】觸衣鉢等亦結罪者並是禁約之極心為罪本故隨境制不令妄起故也。",
    "X39n0714_002:0863b21_0": "次科觸衣鉢者即深防制故云禁約極也。",
    "X39n0714_002:0863b22_0": "【疏】尼結夷者大分為言約境有深淺義非即重也。",
    "X39n0714_002:0863b23_0": "三中境深淺者即分重輕腋已下膝已上腕已後名重境餘名輕境重輕二境互觸皆夷俱重可知俱輕得蘭故云非即重也。",
    "X39n0714_002:0863c02_0": "【疏】言戲非犯者不以婬心則餘戲耳為開殘故非不損威儀。",
    "X39n0714_002:0863c04_0": "不犯中雖內心無染而外相乖儀理須結吉故云非不等。",
    "X39n0714_002:0863c06_0": "【律】三與人女麤語戒。",
    "X39n0714_002:0863c07_0": "【疏】第三共麤語戒。",
    "X39n0714_002:0863c08_0": "【疏】下及歎身制意同觸莫非欲染纏心隨境而避佛制如緣可尋。",
    "X39n0714_002:0863c10_0": "三麤語戒指制意中探引後戒雙指同前莫非下略示大意四戒並因迦留陀夷避制相由而結如注委引。",
    "X39n0714_002:0863c13_0": "【疏】釋戒名者婬欲鄙惡極是不善故名為麤今說其狀表彰於口故曰語也。",
    "X39n0714_002:0863c15_0": "【疏】犯緣有七一女人二作人女想三有染心四麤惡語五麤語想六言章了七前人知解。",
    "X39n0714_002:0863c17_0": "【註】佛在舍衛國迦留陀夷聞佛已制前二戒故便於女前欲心向彼說麤語比丘舉過佛因制戒。",
    "X39n0714_002:0864a01_0": "【疏】就緣中列前二制者釋成後犯緣也如上解之。",
    "X39n0714_002:0864a02_0": "釋戒緣中言如上者即指制意避制之文。",
    "X39n0714_002:0864a03_0": "【律】若比丘婬欲意與女人。",
    "X39n0714_002:0864a04_0": "【疏】就戒本中有五初出犯人二明內染三出犯境四陳過相五隨說下結罪也。",
    "X39n0714_002:0864a06_0": "【註】女人有智命根不斷。",
    "X39n0714_002:0864a07_0": "【疏】三出語境中注解人女有智命根不斷者異於觸境彼境通於死活此則唯是其生故云命根不斷也彼則通於昏睡孩童此則唯論有智時可知言染淨迷悟罪分輕重故此戒女異於前也。",
    "X39n0714_002:0864a11_0": "戒本第三中初總示以摩觸境通麤語境局故對前觸以顯別相彼下別簡初簡死壞彼則下次簡昏小知言染淨即辨麤非麤迷悟即知誤非誤罪輕重者律云情相領結殘解語不解義偷蘭故下結顯。",
    "X39n0714_002:0864a16_0": "【律】麤惡婬欲語。",
    "X39n0714_002:0864a17_0": "【疏】麤惡婬欲者正是戒本所防業也。",
    "X39n0714_002:0864a18_0": "【註】麤惡者非梵行也婬欲語者稱二道好惡也若求若教他求若問若答若解若說若教若罵所言求者與我二道作如是事若復作餘語如是解者是也。",
    "X39n0714_002:0864a21_0": "【疏】注解中非梵行者釋麤惡相也說二道好惡明其欲相文須識者恐未明了妄為次死之罪下有八相律文具解既離非相故廣列之。",
    "X39n0714_002:0864a24_0": "第四釋注中初分語相文下顯示注中的指之意下點八相竝謂對女說上麤語差別之事且出八種臨事何窮注中次列但釋第一餘七略之今為具引律云若教求者若復作餘語教他求二道也若問者即問言汝二道何似若答者即云汝二道如是若解若說亦如是若教者言我教汝如是治二道可令敬愛若罵者即言汝二道破壞腐爛等既下示注引意。",
    "X39n0714_002:0864b08_0": "【疏】此律約緣明比丘向女人說也就後解中若問若答明知女說染心相領亦同犯也故五分中彼此互說皆犯殘罪下戒亦同。",
    "X39n0714_002:0864b11_0": "通互中初示本律前後二文約緣者據本迦留則無互義後解即八相中既容問對顯通彼此互說皆成故下次引他文為證下戒同者即指歎身互說同犯。",
    "X39n0714_002:0864b15_0": "【疏】若復作餘語者言極非染表事是穢故也廣如鈔中。",
    "X39n0714_002:0864b17_0": "釋餘語中言非染者律因消蘇(女名)著赤衣時女形露便言消蘇好否若女情相領僧殘指廣如鈔故不盡錄。",
    "X39n0714_002:0864b20_0": "【律】隨說麤惡婬欲語者僧伽婆尸沙。",
    "X39n0714_002:0864b21_0": "【疏】隨說已下引過結罪。",
    "X39n0714_002:0864b22_0": "【註】若一反麤語僧殘隨語多少說而了了者一一僧殘不了了偷蘭若與書印遣使作相令彼女知僧殘不知偷蘭除大小道說餘處偷蘭與非女人黃門二形麤語知者偷蘭畜生不能變形若向男子麤語一切吉羅尼偷蘭下三眾吉羅乃至下戒亦爾不犯者為說不淨觀若說毗尼受經問答無欲意故。",
    "X39n0714_002:0864c04_0": "【疏】注解辨相中不知偷蘭者以解語不解義故結方便餘可解。",
    "X39n0714_002:0864c06_0": "五中釋注頗略隨與點之注云除二道說餘處蘭問女人婬通三道此戒但云說二道者答口雖通婬本非婬處故說非重非女黃形非全女相適情義少罪亦階降畜取不變能變應蘭不犯中並約說法教授因而言及故非犯科。",
    "X39n0714_002:0864c11_0": "【律】四歎人向人女索欲供養戒。",
    "X39n0714_002:0864c12_0": "【疏】第四歎人索供戒。",
    "X39n0714_002:0864c13_0": "【疏】言多巧偽美己之善意專在欲言現清淨蕩逸其情妄謂歡適故言歎身索供戒也。",
    "X39n0714_002:0864c15_0": "四歎身戒釋名中上二句敘歎身意下四句明索供。",
    "X39n0714_002:0864c17_0": "【疏】犯緣有七準上可知。",
    "X39n0714_002:0864c18_0": "【註】佛在舍衛國因迦留陀夷聞佛已制前三戒故伺諸婦女將入房中自讚歎身汝可持欲以供養我諸女訶恠比丘舉過佛因制戒。",
    "X39n0714_002:0865a03_0": "【疏】戒緣明起過者釋重犯相更避造罪者計義同犯無非愛欲託境少異故分四相欲約後犯除疑妨故。",
    "X39n0714_002:0865a05_0": "戒緣中初通示更下委釋初示義同謂同麁語託下明相異前唯鄙語此乃善言故云少異欲下顯重意謂若不別立恐疑無過故。",
    "X39n0714_002:0865a08_0": "【律】若比丘婬欲意於女人前。",
    "X39n0714_002:0865a09_0": "【疏】就犯戒中六句一是犯人二是欲意三過境四自歎下正明犯法五大妹下是其所稱六可持下結罪屬彼。",
    "X39n0714_002:0865a12_0": "【註】女人如上。",
    "X39n0714_002:0865a13_0": "【疏】就注解人女言如上者即麁語中女不同觸身也。",
    "X39n0714_002:0865a14_0": "戒本第三句注釋如上者以上二戒女境不同故須定指不容相濫。",
    "X39n0714_002:0865a16_0": "【律】自歎身。",
    "X39n0714_002:0865a17_0": "【註】歎身端正好顏色我是剎帝利長者居士婆羅門大姓種。",
    "X39n0714_002:0865a19_0": "【疏】就歎身注中初好顏色者歎其豐美以調前女也二我是剎帝利下明種族高貴女人性弱貪附此二者多故以動之令其心醉也。",
    "X39n0714_002:0865a22_0": "第四句前釋色族女下顯意醉謂迷著。",
    "X39n0714_002:0865a23_0": "【律】言大妹我修梵行。",
    "X39n0714_002:0865a24_0": "【疏】我修梵行下舉善法以動也。",
    "X39n0714_002:0865b01_0": "【疏】問既修梵行義無行非何用索欲供者答必實行欲索者偷蘭大婬方便也今本不行口言其相妄開婬門擬通適故耳。",
    "X39n0714_002:0865b04_0": "第五梵行中問答甚要能破二疑一自稱梵行不當索欲二索欲婬因理應蘭罪一披後答頓釋深疑雖不期婬發言求索故云婬門通即是暢適即訓悅。",
    "X39n0714_002:0865b08_0": "【註】勤修離穢濁也。",
    "X39n0714_002:0865b09_0": "【疏】注言勤修離濁者濁謂欲染所以汙染離由勤修也釋上梵字當唐言淨行也。",
    "X39n0714_002:0865b11_0": "釋注欲染即五欲所以污染離(句絕)。",
    "X39n0714_002:0865b12_0": "【律】持戒精進。",
    "X39n0714_002:0865b13_0": "【疏】言持戒精進者明止作兩持無有缺也。",
    "X39n0714_002:0865b14_0": "【註】不缺不穿漏無染汙。",
    "X39n0714_002:0865b15_0": "【疏】注解不缺不犯第二篇不穿不犯三四聚無染汙者謂餘篇聚皆明淨也又解初持方便言不缺也中持正本言不穿也後奉持戒隨助之心故云無染汙也或以戒見威儀具持故以三配之可解。",
    "X39n0714_002:0865b19_0": "持戒中釋注三義初約篇聚釋文收下聚不配初篇是行本故持則堅完犯則喪失故不論穿缺也餘篇聚者謂下篇惡作惡說又下次約三時釋初中後心配缺穿汙或下三對四事釋不缺即戒不穿是見無汙對威儀正命即攝戒中。",
    "X39n0714_002:0865b24_0": "【律】修善法。",
    "X39n0714_002:0865c01_0": "【疏】修善法者謂頭陀等相並生善道之法也。",
    "X39n0714_002:0865c02_0": "【註】樂閑靜處時到乞食著糞掃衣作餘食法不食一坐食一揣食塚間坐樹下坐常坐隨坐持三衣唄匿多聞能說法持毗尼坐禪是也。",
    "X39n0714_002:0865c05_0": "【疏】注解中分六位初舉頭陀明節儉法二舉唄匿明稱讚法三舉多聞明廣見法四舉說法明開智法五舉持律明奉行法六舉坐禪明剋道法。",
    "X39n0714_002:0865c08_0": "修善注中初科六位統收善法束六為二不出解行或復為三即是三學。",
    "X39n0714_002:0865c10_0": "【疏】就前頭陀約相十二以事束之止唯四位謂衣食處儀也於衣知足立二謂糞掃衣一衣也於食知足立四謂乞食不餘一坐一摶也於處知足立五謂靜處塚間樹下露地隨坐也四儀唯一即是當坐繫念現前發智觀察也餘如鈔中。",
    "X39n0714_002:0865c15_0": "次科四位總收可解食中不餘食者但能節後一坐食者前後俱節一摶食者不復受益處中五種注中缺露坐後世寫脫律本具之事鈔頭陀篇中一一具出制意名體行相功益此不繁引故略指之。",
    "X39n0714_002:0866a02_0": "【律】可持是婬欲法供養我如是供養第一最僧伽婆尸沙。",
    "X39n0714_002:0866a04_0": "【疏】文中可持是下引罪成也。",
    "X39n0714_002:0866a05_0": "【註】若作如上譽已供養我來不說婬欲者偷蘭餘境雜犯如前戒說不犯者若比丘語女人言此處妙尊最上此比丘精進持戒修善法汝等應以身口意業等供養於彼若女意謂為我歎身若說毗尼言次及此彼謂歎身若錯說者並不犯。",
    "X39n0714_002:0866a10_0": "【疏】就辨相中若但說欲如前戒若但歎身結偷蘭歎身索欲方犯此戒罪餘相狀可解。",
    "X39n0714_002:0866a12_0": "第六中釋注辨相云餘可解者注指前戒謂遣書現相報□別趣異等並同故也就不犯中初如實歎他及說法等彼謂歎身非我心故。",
    "X39n0714_002:0866a15_0": "【律】五媒人戒。",
    "X39n0714_002:0866a16_0": "【疏】第五媒嫁戒。",
    "X39n0714_002:0866a17_0": "【疏】制戒意者然此婚娶禮法乃是生死之結障道之源出家離著彌須遠彼乃復往返言議乖越威容深是鄙恥理須遮制然復事務猥濫妨修道業跡涉譏醜不免世訶具斯諸過故所以制。",
    "X39n0714_002:0866a21_0": "五媒嫁戒制意中敘過有四初明障於聖道乃下二明乖於僧儀然下三廢於進業猥鄙也跡下四招於世謗具下總結。",
    "X39n0714_002:0866a24_0": "【疏】釋名者為彼男女往返相謀以成嫁娶故曰媒也媒者謀也計度二姓用為好合。",
    "X39n0714_002:0866b02_0": "釋名中初示名義計下顯事相計度謂量其可否好字去呼。",
    "X39n0714_002:0866b04_0": "【疏】論犯八緣一人男女二想實三為媒事四知是媒五言了六受語七往說八還報犯。",
    "X39n0714_002:0866b06_0": "【疏】闕緣可解。",
    "X39n0714_002:0866b07_0": "【註】佛在羅閱祇迦羅比丘本是大臣善知俗法城中嫁娶盡往[言*恣]問時婚娶者逢對好惡便願迦羅受於苦樂居士譏訶比丘舉過佛因制戒。",
    "X39n0714_002:0866b10_0": "【疏】就戒緣中迦羅本知姻媾相祿休咎故雖出家還尋本業斯積習生常不言有過如今屠販之士迷利故所以行可不然哉故律中先客書者不得畜筆先客縫者不得畜針先客木者不得畜斥斧等並制惡習也又言婚對好惡願受苦樂者俗人無識不謂往緣既得違順便言媒人與我苦樂斯為過兆故制在茲由諸比丘與迦羅類故彼言有涉也。",
    "X39n0714_002:0866b17_0": "戒緣中初明迦羅本緣姻媾皆婚娶之名相祿謂命分休咎即吉凶如下舉事為況故下引教以證令知出家必除俗習又下次釋毀讚律云彼婚娶得適意者便歡喜供養讚歎言令迦羅常得歡樂及餘比丘亦得供養若彼不得適意者便言當令迦羅常受苦惱及餘比丘亦受苦惱不得供養等然彼毀讚言及餘人須出其致故云由諸比丘等由是同類例遭譏毀據此戒本注中願迦羅下合有及餘比丘一句恐是寫脫。",
    "X39n0714_002:0866c02_0": "【律】若比丘往來彼此媒嫁。",
    "X39n0714_002:0866c03_0": "【註】使所應可和合者是也。",
    "X39n0714_002:0866c04_0": "【疏】戒本四句第一可知往來媒者正是業本持男意下釋前成相為成婦下是其罪也。",
    "X39n0714_002:0866c06_0": "戒本分句可解。",
    "X39n0714_002:0866c07_0": "【疏】解媒業中言往來彼此者舉其事相顯其媒也注云所應可和合者謂良賤貧富於事所異由開解故成也。",
    "X39n0714_002:0866c10_0": "釋次句中由開解者謂假媒者辯說成故。",
    "X39n0714_002:0866c11_0": "【律】持男意語女持女意語男。",
    "X39n0714_002:0866c12_0": "【疏】三持男意下反釋第二往來之相男女兩意並據可娉之家或鰥夫寡婦則自言仇好或童男處女則伉儷在親故律通言莫非男女也。",
    "X39n0714_002:0866c15_0": "第三釋文中初點示男下牒釋娉即是娶彼此意願故云可娉無妻曰鰥無夫曰寡此等多無長上故但自言仇對也好合也伉儷謂敵偶童男室女必由二親故下指成文通收前二。",
    "X39n0714_002:0866c19_0": "【註】女人有二十種母護父護父母護兄護姉護兄姉護自護法護姓護宗親護自樂為婢與衣婢與財婢同業婢水所漂婢不輸稅婢放去婢客作婢他護婢邊方得婢是也男子亦有二十種並同上列。",
    "X39n0714_002:0866c23_0": "【疏】注解中女男兩相各二十種先明女者以好合之來男多求女故隨求處所以先明。",
    "X39n0714_002:0867a01_0": "釋注初科據能求則男合在先故約所求以通律意。",
    "X39n0714_002:0867a03_0": "【疏】就女相中良賤等論者亦遣疑網也但令婚娶不簡良賤竝犯殘也。",
    "X39n0714_002:0867a05_0": "次總分正明中初示文意但下釋疑相恐謂賤者不成媒故或疑良賤互不成故。",
    "X39n0714_002:0867a07_0": "【疏】有人言母護男取母護女故可和合若母護男乃至取邊方婢無此理也故文云所應和者今解如上現見世間婚娶何由可對乃至有婢為趙夫人漁師欲於王女天人交會可不然乎。",
    "X39n0714_002:0867a11_0": "斥古中先出彼見古謂男女二十相對可媒耳仍執上文以為證據所云應可和者但是二家好合豈簡良賤類殊故知不爾今下斤非略舉三事質其妄執漢書云孝成帝趙皇后本長安宮人(謂省中侍使官婢名宮人非天子掖庭中者)善能歌舞號曰飛燕成帝見而悅之召入宮中大幸之智論中國王有女名拘牟頭捕魚師因見染著不能飲食以情告母母送肥魚遺王女不取價王女怪問母以情告王女許之令月十五日住某天祠像後至時而往王女到廟獨入而天神即厭此人令睡女即脫瓔珞遺之而去女去方覺婬火自燒而死律中比丘與天女行婬犯重用此多緣證知不簡。",
    "X39n0714_002:0867a23_0": "【疏】言母護者父崩母養恐有顛危常自監守故言護也如世孟軻母為三徙故道成儒宗也言父護者其相如前如世曾參為子不娶故也二親俱在其護自明乃至兄姉例同上也。",
    "X39n0714_002:0867b03_0": "初母護中初釋護義如下引示言父崩者天子曰崩古語通用故得稱之孟軻者史記云字子輿鄒人也軻少與母偏孤居近墓軻乃常戲為墓母曰此非所居去居市傍軻復戲為商賈母又曰不可居又居學舘之傍乃為揖讓進退有禮母曰此真可以居軻遂為大儒孟子序云幻被慈母三遷之教是也父護中如前即反上文母喪父養等曾參者孔子弟子參為後母故妻以蒸梨不熟因出終身不娶其子元請焉告其子曰高宗以後妻而殺孝已尹吉甫以後妻放伯奇吾上不及高宗中不比吉甫庸知其得免於非乎文出家語此明父護子也。",
    "X39n0714_002:0867b15_0": "【疏】言自護者本無師友性與天成雖遇塵染涅而不緇也如大迦葉柳惠之倫也。",
    "X39n0714_002:0867b17_0": "自護中天成者謂天然自立論語云不曰堅乎磨而不磷(磷薄)不曰白乎涅而不緇(喻君子在濁而不染同塵而內正)付法藏傳明大迦葉年十五父母欲與娉妻聞之愁惱白父母言我志清淨不須妻也後父母為娉得一金色女乃至共要云我若眠息汝當經行汝睡我行如是清淨不喜塵染後白父母求出家等孟子云柳下惠(姓展名禽柳下惠是號)不羞汙君不辭小官進不隱賢必以其道遺佚而不怨阨窮而不憫與卿人處由由然不忍去爾為爾我為我雖袒裼裸裎於我側爾焉能浼我哉(憫懣也裼裎皆衣浼汙也)。",
    "X39n0714_002:0867c03_0": "【疏】言法護者或世法自防不許荒逸故俗云三十之男二十之女待禮而行過此已往相奔不禁之類又如世律非媒娉合罪在徒刑恐違此法故。",
    "X39n0714_002:0867c06_0": "法護者律云修梵行也今約世法以釋故云或也初明守禮世法謂王教俗云者出禮記內則篇男取陽數女取陰數減則不得過則許之故云不禁相奔謂住為夫婦也又下次約懼刑不敢非濫。",
    "X39n0714_002:0867c10_0": "【疏】言姓護者族望所重海內稱之若濫染汙事則不可要須媒媾非此不得也。",
    "X39n0714_002:0867c12_0": "姓護者恐辱貴族不敢為非故海內即指天下在四海之中故。",
    "X39n0714_002:0867c14_0": "【疏】言宗親護者姓雖高貴至親物故若妄造非宗親所護故曰也。",
    "X39n0714_002:0867c16_0": "宗親護中至親即父母物故謂死如物柯故。",
    "X39n0714_002:0867c17_0": "【疏】上十是良其相自顯下明十婢律有正消文相可解故不出也。",
    "X39n0714_002:0867c19_0": "次明賤中疏文示略今引律釋云自樂婢者樂為他作婢二與衣者與衣為價三與財者乃至與一錢為價四同業者同共作業若未成夫婦五水所漂者水中救得六不輸稅者若不取輸七放去者若買得若家生八客作者雇錢使作如家使人九他護者受他花鬘為要十邊方得者抄劫得也。",
    "X39n0714_002:0868a01_0": "【疏】男子二十種相同於女改名便得不復煩文故律略示也。",
    "X39n0714_002:0868a03_0": "男中二十良賤半分良者云男賤者名奴別相同上。",
    "X39n0714_002:0868a05_0": "【疏】就男女交絡互為句數其相煩多且如母護男取母護女乃至下婢一男娶二十女二十男則四百句如是指印書使現相等例之無量。",
    "X39n0714_002:0868a08_0": "歷句數中初示互句之多且下略舉直句言四百者且約語媒如是下例通餘四五種總二千句用此參互則不可數故云無量但識下文受說報三明犯分齊無不通矣。",
    "X39n0714_002:0868a12_0": "【律】若為成婦事若為私通乃至須臾頃僧伽婆尸沙。",
    "X39n0714_002:0868a13_0": "【疏】四言若為成婦事下除疑網也世云媒者為盡生也婦是伏事之言箕箒終於命報可有重殘私通暫時未必有犯為除此妄故結終始從婦至於須臾無非欲事故並犯重收綱攝網也。",
    "X39n0714_002:0868a17_0": "釋第四句初文前總示文意世下出疑情箕箒者即掃洒之具明伏事之禮俗書並謂掃洒是婦人之職為下明斷疑始謂婦事終即須臾私通居次故云至於等。",
    "X39n0714_002:0868a21_0": "【疏】言須臾者時之異名也僧祇云二十念為瞬二十瞬為彈指二十彈指為羅預二十羅預為一須臾日極長時晝則十八須臾夜則十二須臾若夜長日短反上可知此則西梵約日夜為度數法也此方漏刻經中不問冬夏兩至例分百刻約箭在水用刻分時未遑廣述所謂時節學也。",
    "X39n0714_002:0868b03_0": "次科為三初標示由是時之別相故云異名僧祇下次引釋瞬謂目一開合也羅預亦是西梵時名未詳所釋(俱舍名臘縛而云三十臘縛為一須臾與是全別不可和會)日極長者且舉夏至夜長日短即謂冬至晝則十二夜則十八故云反上春秋二分則晝夜半分焉此下三明二土不同漏刻經梁朝出之明置漏刻之法不問下冬至日四十刻夜六十刻夏至反之春秋二分亦各等半箭在水者刻漏制云箭長四尺五寸分四面每面三時二十五刻四面共成百刻其箭在水壺中壺上安木蓮華作木人高七寸跪坐花心兩手捧盤壺中浮箭自盤心涌出以驗時刻之數水漏下一刻箭上涌一刻每箭上壺二十五刻一度放水故四度而成晝夜未下顯略遑及也時節學者謂知時刻別是一家之學非可於此具論。",
    "X39n0714_002:0868b17_0": "【註】若初受語吉羅往說不報偷蘭若還報者僧殘若遣使若書指印現相隨媒多少說而了了隨其往反一一僧殘若不了者偷蘭除二道說餘身支節而媒嫁者偷蘭若媒非人黃門二根者偷蘭若媒畜生及人男者吉羅若持他書往而不看若為白衣作餘使者吉羅比丘尼同犯不犯者若男女先通後離還合若為父母疾患繫閉看書持往信心精進俗人亦爾若為佛法比丘使亦同。",
    "X39n0714_002:0868c01_0": "【疏】就注辨相初自作輕重中媒緣有五先舉語媒後四例結。",
    "X39n0714_002:0868c03_0": "【疏】就語媒中有三。",
    "X39n0714_002:0868c04_0": "【疏】受語吉羅者計應是蘭僧殘方便而吉者意不往說對往輕也。",
    "X39n0714_002:0868c06_0": "釋注受語中對往輕者謂受而不往故結輕吉。",
    "X39n0714_002:0868c07_0": "【疏】二往就說而不返報若報成重故但偷蘭。",
    "X39n0714_002:0868c08_0": "往即犯蘭是殘方便。",
    "X39n0714_002:0868c09_0": "【疏】若爾初罪是蘭而言吉者則殘罪方便唯是一蘭答所言吉者望為作使非是威儀故犯一吉又傳情欲更犯一吉止為息心故不行往所以方便罪同偷蘭如上方便義中二篇則兩蘭也。",
    "X39n0714_002:0868c13_0": "問意躡上二罪可解答中初釋不往犯輕文明二吉由此篇犯相故心雙結一者應懺二則非儀今傳情欲即是應懺也所以下次明往即結重指如上者謂作意欲往即吉受語即下品蘭還報未及又中品蘭同上次第三方便矣文中承前一吉故云兩蘭。",
    "X39n0714_002:0868c19_0": "【疏】三就還報故殘何疑。",
    "X39n0714_002:0868c20_0": "【疏】語既三時重輕下四例此可悉若使及書言中自了指印現相必假言通故僧祇云作相者當知見我著垢衣持空鉢坐卑牀說賤語者不得也反上吉相得與不得還報者殘。",
    "X39n0714_002:0868c24_0": "餘四中初指例四相雖殊三時無異故云可悉若下別簡以遣使遣書有字語傳情故云自了指印現相但是示信立約相中不顯故云必假言通故下引示語令覩相證須言通反上吉相者應云見我著淨衣鉢持好食坐高牀說法語即得相也。",
    "X39n0714_002:0869a05_0": "【疏】注中隨媒多少隨信往反一一殘者。",
    "X39n0714_002:0869a06_0": "【疏】有人解云上媒境既多故通其相若據結罪如媒男女一家好合以來但一殘耳。",
    "X39n0714_002:0869a08_0": "釋多少中他解媒境者即上男女各二十及五相等彼謂一一之言屬上多境非是一家容有多犯又復結犯須據和合。",
    "X39n0714_002:0869a11_0": "【疏】今言不爾一家婚媾何由即合情雖相會而事相須重或經年紀信使重沓然後方許者自有一發言情宛同符契者今判約罪止可同律附其三返即結僧殘不待二家和不和也故僧祇中同此結也。",
    "X39n0714_002:0869a15_0": "正義中初約久近不定以斥十二年曰一紀契合也今下準律判犯反古二義對上可知下指僧祇即上引云得與不得還報者殘斯為明證。",
    "X39n0714_002:0869a18_0": "【疏】就不犯中男女先通者非初情會欲非我也故十誦遣婦作書雖未唱令和者犯蘭出門者重然其相狀意在本通故五分中為男倩女為女倩男長使者蘭明後有會故也。",
    "X39n0714_002:0869a22_0": "不犯中初科前釋開意故下引文以決本律文漫故取外部示其分齊據輕重兩結則知本律不犯義同未唱望非僧殘故在聞耳然下釋犯意以知彼先通遂為和合欲使復通故云意在等十誦就此而入犯科故下轉證本非媒事恐後有通亦制與罪證上和合知後必通犯無疑矣。",
    "X39n0714_002:0869b04_0": "【疏】父母疾閉看書往者以媒為俗使故開為父母生身重故又開俗人者未受歸戒無法相收故文約截信心精進也良由內外兩眾同法同儔雖形參道俗而法情無二故開餘文可解。",
    "X39n0714_002:0869b08_0": "持書中初釋開親初明因制之意以持書通使未必為媒因媒而制故列開中開為下正示開緣文中但釋開親疾閉兩難易知不點又下次釋信士上明簡信良下敘開意同法者五八體通故同儔者皆稟正化故雖形參者遮疑妨恐見形異而謂法別故餘下指略即點注中佛法僧等。",
    "X39n0714_002:0869b14_0": "【律】六無主不處分過量房戒。",
    "X39n0714_002:0869b15_0": "【疏】第六無主不處分過量房戒。",
    "X39n0714_002:0869b16_0": "【疏】就制意中。",
    "X39n0714_002:0869b17_0": "【疏】初明開諸比丘自造房者然上士之報氣剛方盛堪忍寒暑情非以惱隨受捿泊即是修行長道之緣是以如來聽在塚間樹下露地靜緣資業無畜房宇中下報類形必萎顇制同上士塚間修道力分不堪或隨退沒則非隨機達化之用是以如來任其分量但能弘道則開資給或小房石室兩房一戶起不礙頭坐趣容膝足堪進業意在於斯。",
    "X39n0714_002:0869b24_0": "六無主房戒制意中初科文敘三根以彰隨緣用教須否初明上行頭陀不須之意泊止也次明中下報劣必須開立萎顇謂薄弱也文明開意皆云為道若但養身恣情取適則非教意小房等者且依律受法趣列其相下約起坐示低窄之極末世奢縱反競豪雄不論道業空虗但務堂舍高廣乞法制量舉世無聞樹下塜間斯蹤久絕仰追聖世良用慨然。",
    "X39n0714_002:0869c08_0": "【疏】何故不聽過量不處分者然則出家之士理非滯著隨事將擬即堪修道若有信施量時而受縱有經營容身使罷今乃廣作煩勞不少一須人結搆妨廢正行二如多云長己貪結壞少欲知足故三處處乞覓惱亂二趣不生信敬壞滅正法令不久住故四專任自由不乞處分容有障礙僧事多惱亂故五或容自損或違慈道壞梵行故以斯諸過故制罪也。",
    "X39n0714_002:0869c15_0": "次意中三初雙徵事法然下二正明制意初敘少欲順教今下明違法多過上二句總標一下別列五中前三過量過後二不乞過前中初過多事長業則反正行第二多貪增惑則反少欲第三多乞惱他則反自滅法二趣者如戒緣中人非人也四中不乞處分眾法不行故礙僧事第五若在難處則有命梵二難自損即命難違慈即梵難以下通結。",
    "X39n0714_002:0869c23_0": "【疏】問四依須行不行不制四開有違制輕重者答四在少欲依成上品若使不行便當中下是故依而不行聖不結犯四開非勝稱緣而設而於自分不行故有輕重別制但為房是疎緣義不交急營搆過多具前五種是故制殘餘三依開資身正要事不獲已必須服用約情敘過微故制墮。",
    "X39n0714_002:0870a05_0": "問中含二意一問違依無過違開有罪二問違開制罪房重餘輕答中先答初意前明違依但由機劣力所不堪而非故違故無所犯下明違開食依房藥四依之後隨列開法故云四開言非勝者開對下機教則緩故自分不行謂不守開中制法故但下次答後意初明房重交猶至也義鈔作要急或恐傳誤下明餘輕三依開者糞衣中開畜長取衣等乞食中開受請即有別眾展轉足食等腐樂中開長藥請藥等並見墮中。",
    "X39n0714_002:0870a14_0": "【疏】次釋名辨離合。",
    "X39n0714_002:0870a15_0": "【疏】初中專任在己故稱自為身獨運造故云無主大非法限故曰過量餘同上也。",
    "X39n0714_002:0870a17_0": "釋名中言自為者戒本標名則無此語比下有主亦云為己況疏文牒釋犯緣明列理必有之但恐寫脫耳指同上者亦應分對所防能治諸戒皆爾。",
    "X39n0714_002:0870a20_0": "【疏】言離合者。",
    "X39n0714_002:0870a21_0": "【疏】問初後皆房何故分者答同少異多故不可合何者有主無主異有量無量異羯磨法中相翻是異有三別故所以分之。",
    "X39n0714_002:0870a24_0": "離合中初問答中三異上二易知羯磨相翻者前戒則牒自乞無主後戒乃云有主為己。",
    "X39n0714_002:0870b02_0": "【疏】若爾前房亦有不乞過量何為復合答欲明房雖一口罪則四含過濫是多懼非輒造故也又顯過量不過量俱有不乞罪處分不處分俱有過量罪。",
    "X39n0714_002:0870b05_0": "轉難中由前二罪合為一制故舉為難答中初多罪答四含者加妨難二吉懼非者非猶不也又下次約互顯答。",
    "X39n0714_002:0870b08_0": "【疏】問此罪混合何以開於最初答前初是過量後初是不處分也。",
    "X39n0714_002:0870b10_0": "最初問中一戒兩犯何者初開律無指的故云混合答文易解。",
    "X39n0714_002:0870b12_0": "【疏】若爾前已有不乞則是後第二何故前列答結集者意次文不同何以知然若同一戒文義不同約異戒相形則不能比類如前大殺已結小殺明知此列結集境通非謂小提迦留前制若前已結後犯非禮不應訶言最初犯戒以此挍量同別類矣。",
    "X39n0714_002:0870b17_0": "再難中既云不乞是後戒最初則前戒不乞反是第二答中初二句略示何下委釋前明二戒不可合制文義不同者如上三異故約下引類異戒不類者謂餘戒列相並無此例雖例同殺戒亦是廣解非關戒本故知唯獨此戒次列不同耳如下正引同別類者同謂大殺合結別謂小殺後制義同二房故云類也。",
    "X39n0714_002:0870b24_0": "【疏】犯緣有六一無主二自為三專乞求四過量不乞五具二想六房成犯。",
    "X39n0714_002:0870c02_0": "列緣中五具二想即過量不乞。",
    "X39n0714_002:0870c03_0": "【疏】闕緣相狀大同犯多悔少故不廣也。",
    "X39n0714_002:0870c04_0": "闕緣大同者同上具緣翻具成闕耳犯下示略意。",
    "X39n0714_002:0870c05_0": "【疏】就闕第六緣房未成多論云末後二團泥未竟已還輕蘭餘一團泥在重蘭如善見云末後團泥在留待當成蘭決心且罷即殘又如僧祇最後不定或瓦木版石灰泥草等隨作房法也。",
    "X39n0714_002:0870c09_0": "第六中初引二論並以團泥以分因果擁住因蘭則名闕矣次引僧祇通指諸物但取末後不獨團泥。",
    "X39n0714_002:0870c12_0": "【疏】此非法房自他兩用一入一吉房主若死休道及施僧者乃可通用據此悔殘理亦開受。",
    "X39n0714_002:0870c14_0": "受用中初明犯相房下次明通用文列三緣開施僧者若據販賣食施僧不得受或房用是疎或用非入己食則反此故不同也據下疏家義斷亦不同食縱懺不聽問悔已開受為自為他答既無本過義通自他問為須除量外否答文雖不顯義不須除以房物重大造立已定不同衣量容可截續。",
    "X39n0714_002:0871a02_0": "【註】佛在羅閱祇聽諸比丘作私房室曠野比丘便作大房乞求煩多惱亂居士乞既難得遂斫神樹神及比丘以事白佛因往曠野訶責引喻便制此戒。",
    "X39n0714_002:0871a05_0": "【疏】就犯緣中初明隨開造房便樂大作惱亂居士遂斫神樹即是二趣俱惱之緣也多見二論云樹神兒子遊戲上下遂斫兒臂神大瞋怒將欲加害夜往佛所聞偈得初果言佛訶責引喻者喻有二初舉龍鳥以下況上也後舉賴吒比丘不往親乞以親況疎也講時依律敘之亦有助光行迹矣。",
    "X39n0714_002:0871a11_0": "戒緣中初釋惱亂發起之由多下引論別證非人聞偈者佛言若人起瞋心譬如車奔逸車去雖能制不足以為難人能制瞋心是乃說為難言佛下次釋呵責龍鳥二緣如前篇引賴吒比丘者律云佛告諸比丘昔有族姓子名賴吒婆羅出家為道至父母家終不乞求時父語言汝是我子何不從我乞耶賴吒說偈曰多求以不愛不得懷怨恨是故我不乞恐生增減故當知賴吒於父尚不從乞況汝等乃在諸居士家多所求索令彼不喜等文中兩點喻意然非假設並是往昔實事但彼引緣欲彰人意不喜乞求比類呵責故云況也下令詳引誡勗後進必有高節則美行外彰故云亦有等。",
    "X39n0714_002:0871a23_0": "【律】若比丘自求。",
    "X39n0714_002:0871a24_0": "【註】彼處處乞索也。",
    "X39n0714_002:0871b01_0": "【疏】戒本分二各有十句。",
    "X39n0714_002:0871b02_0": "【疏】初立法中明造房之緣務也。",
    "X39n0714_002:0871b03_0": "【疏】初明比丘謂造房者非犯士也。",
    "X39n0714_002:0871b04_0": "【疏】二明乞求者以有自物則無過量非法乞求惱施之甚故犯過量也注云處處乞者成前惱多相也。",
    "X39n0714_002:0871b06_0": "立法十句中第二釋注成前者即指戒緣。",
    "X39n0714_002:0871b07_0": "【律】作屋。",
    "X39n0714_002:0871b08_0": "【註】屋者房也。",
    "X39n0714_002:0871b09_0": "【疏】三作屋顯所為也除作餘事不須乞處分故注以房解用別開總也爾雅釋室與宮不別據俗釋名更有品類如今宮第宅宇異等故無暇廣也。",
    "X39n0714_002:0871b12_0": "第三釋注云別開總者屋是總名房為別相故下引俗書釋其名義初爾雅者示名通也彼云宮謂之室室謂之宮次據俗下彰名局也言釋名者此即通指字書非一文也劉熙釋名云宮穹也屋見於垣上穹崇然謂王者所居也第者漢書注云有甲乙次第故謂公候之舍也宅釋名云擇也令擇吉處而營之宇說文云屋四邊也此二貴人之居通則無非屋舍之名別則須分尊卑之異今但識其通名別相廣亦非要故云無暇。",
    "X39n0714_002:0871b21_0": "【律】無主。",
    "X39n0714_002:0871b22_0": "【註】彼無有主若一若二若眾多也。",
    "X39n0714_002:0871b23_0": "【疏】四無主者對後有主故無過量罪也注中似有主一多及通無主義故僧祇云彼有男女在家出家皆得為主無如此主故言無主。",
    "X39n0714_002:0871c02_0": "四中初云對後者使結罪無濫故注中列主一二眾多反明無主故云乃通等及字傳誤然本律中不明道俗故引僧祇顯通七眾。",
    "X39n0714_002:0871c05_0": "【律】自為己。",
    "X39n0714_002:0871c06_0": "【註】不為他作。",
    "X39n0714_002:0871c07_0": "【疏】五自為己者除為他作既不潤己則無犯故。",
    "X39n0714_002:0871c08_0": "自為中為他無犯者據本罪為言。",
    "X39n0714_002:0871c09_0": "【律】當應量作是中量者長十二佛磔手內廣七磔手。",
    "X39n0714_002:0871c10_0": "【疏】六當應量下明分齊也。",
    "X39n0714_002:0871c11_0": "【疏】所以用佛為量不即身為量者身不可約以小大故佛則限其一化也。",
    "X39n0714_002:0871c13_0": "第六磔量中初科人身不定佛則定故然佛示身亦有大小且取王宮丈六以為準約故云一化。",
    "X39n0714_002:0871c15_0": "【疏】佛磔手者磔謂張磔可從石也今有從手從足俗字耳。",
    "X39n0714_002:0871c17_0": "次科張磔者謂以大母指與中指張開相去之間今下點非以律本中多從手作。",
    "X39n0714_002:0871c19_0": "【疏】本律無文可依五分二尺為定僧祇二尺四寸者此律翻在宋朝元魏所用一尺當於宋家一尺二聞傳佛教從北自南則為魏尺當於佛磔所以五分磔長二尺者此律翻時道生智嚴等竝是名士既明曆緯又善方志所以通於東西定於尺秤誠有由矣。",
    "X39n0714_002:0871c24_0": "三中初科上句明律缺五分下示所取僧下顯不同所以初明僧祇宋受東晉禪都建康為南朝元魏都長安為朝魏北用增尺宋用周尺譯者不詳即用魏家二尺於宋則多四寸彼律是佛陀跋陀羅譯中天竺僧故不體此方時事如以果汁為木蘭之類聞下出譯者之意彼以教法既從北來宜準於魏自猶至也(若準初卷僧祇乃在東晉義熙十四年譯今言在宋必涉兩朝詳之)所下次出五分曆緯即陰陽書明星辰纏度則分寸可知方志即地里書明南北時政則是非可辨東西即南北二朝或可花梵兩土。",
    "X39n0714_002:0872a10_0": "【疏】南尺本是姬周所用從秦漢魏並無改張晉氏南遷斯法永定元魏撥亂文籍焚除無可依準故隨世立用古尺一今魏一尺則唐雜令還述如此隋煬博物還依古行習俗生常故古非用今還用魏以通時俗至於分度星次律量衡平藥石分銖祠祭升合無非準古所以律本大鉢三斗小者斗半姚秦時政用古未訛故此翻文頗得通允。",
    "X39n0714_002:0872a17_0": "次科初明宋尺可準漢魏者魏即曹魏晉南遷者中原既亂中宗度江南鎮建業立社稷于建康為東晉焉元下明訛變之始則下敘唐朝承用雜令者魏徵撰彼云以一尺二寸為尺隋下明前代復古煬帝隋第二主撰博物志通明物理習下明後世不從初明用魏即前元魏至下次明用古文明兩用顯其無準星次謂眾星周天而行必約分數以明行度律量謂俗律決犯並準丈尺衡猶準也上二辨尺藥下明秤二十四銖為兩合和兩分不可增減故祠下明升斗已上四事必須準定故皆從古所下會同本律。",
    "X39n0714_002:0872b04_0": "【疏】有人云何足如斯但隨國用如今時節有四尚不能迴破為三明知隨國用尺則比佛量自得斯非言也若以隨國即得鉢量三斗不勝尺量諸說難一何由定其持犯未足開決深疑也。",
    "X39n0714_002:0872b08_0": "斥妄中先出彼見引時例尺西土三時無秋分故斯下一句責非若下例難勝讀為升言不勝受唐三斗故尺下顯濫據文斥他亦彰今意委明尺量使持犯揩定令斷割無濫事鈔所謂古今諸師曾未霑述故即補闕反光九代故知決正尺斗始出今宗。",
    "X39n0714_002:0872b14_0": "【疏】今且準酌意言為允如有隱括不畏紙貴也所以如來常光一丈常身丈六多論以人長八尺也即如文中二尺為卒率音律也長二文四尺廣一丈四尺既明內廣理除其外也僧祇邊壁丈二尺若通其本止一丈耳。",
    "X39n0714_002:0872b19_0": "顯今中初明理當教無明判義例決通故云意言如有等者示須廣之意晉左太沖作三都賦豪貴傳寫洛陽為之紙貴所下次引據常光常身竝簡現起則有不定一丈或云一尋佛身倍半則磔必倍尺故云即如等音率為律有本細注疑是後加率猶數也長下示量上明縱廣量後引僧祇出高下量彼用魏朝一文即是宋朝文二今取姬周應除二尺故云若通等。",
    "X39n0714_002:0872c03_0": "【律】當將諸比丘指授處所。",
    "X39n0714_002:0872c04_0": "【疏】七當將比丘指授處所下文可解也。",
    "X39n0714_002:0872c05_0": "【註】彼比丘看無難無妨處己到僧中脫革屣偏露右肩禮上座足右膝著地合掌白言大德僧聽某甲比丘自乞作屋無主自為己我今從眾僧乞知無難處無妨處如是再三也。",
    "X39n0714_002:0872c09_0": "【疏】注中廣列作之方法初看無妨難者以羯磨所因在于妨難必有作法得罪不成故先定基址後方從乞六門分之一能處分人是非二僧私二地須處分不三有妨難作法成不四處分法約作於人處五不處分罪分有無六沙彌已乞受竟須不。",
    "X39n0714_002:0872c14_0": "指授釋注中初科前點注意六下列義章初人二處三法四人法處三種合論五罪六下眾。",
    "X39n0714_002:0872c16_0": "【疏】初依律量觀信與不信信即依作不信往觀如僧祇中都無解羯磨者一切往就作房處一比丘唱云僧為某比丘指授作房處三說亦得若處遠隔水等緣但差二三人亦得若越年異界作私房多妨難處皆不成也。",
    "X39n0714_002:0872c21_0": "初中前引本律量可如下次引僧祇往觀初明僧往以無能秉故開唱告若下次明別人往若越下顯非文列四種竝約造房比丘為言。",
    "X39n0714_002:0872c24_0": "【疏】二僧私二地須處分不者皆須加法以妨難是通如明了論樹空山巖石陰等得行住坐臥如作房舍所攝若不爾者自損惱他故也。",
    "X39n0714_002:0873a03_0": "二中初正示如下引證以樹空等義非私處同須乞法難處自損妨處惱他。",
    "X39n0714_002:0873a05_0": "【疏】三妨難若有作法成不者。",
    "X39n0714_002:0873a06_0": "【疏】昔解云成若爾何故律云有妨難不應與處分答乞處分者制其專任之過本不防於妨難所防不同故又得成如律有妨難處不過處分但得二吉文誠驗矣。",
    "X39n0714_002:0873a10_0": "三昔解中初句判定若下釋難前引律難顯是不成答據所防復有成義故云又也如下引證。",
    "X39n0714_002:0873a12_0": "【疏】今解不成毗尼因緣三求無過則成持也此戒緣者正妨難也戒本所列還分妨難及後廣解妨難愈彰故律文中互有不成何況俱者必有作法與法正違眼看妨難卓然而云無有妨難者大可笑也。",
    "X39n0714_002:0873a16_0": "今解中初句義斷毗下斥非初約義斥戒本廣解文現可知若據戒緣不明妨難或指二戒斫伐神樹神欲加害即為妨難故下次引文斥律列四句一有妨有難二無難有妨三有難無妨(三句皆不應與處分)四無難無妨(唯此句得成)必下三約作法斥。",
    "X39n0714_002:0873a21_0": "【疏】若爾前言二吉此豈凡心答此是處分先成妨難後起法成不壞無殘可結妨生不合強作故吉此是緣外相違故生不壞前法如受戒後難生不失前戒相似也。",
    "X39n0714_002:0873b01_0": "釋古執中初難由前古師引此為據故問通之答中初二句立理法下明開制此下釋開成之意羯磨後生故云緣外如乞法時本無妨難得法已後惡獸始來等下引受戒難生為例具戒者汙尼賊住必無後生二形破內永變非畜戒亦有失邊黃五逆暫變二趣則無有失今云不失蓋據此耳。",
    "X39n0714_002:0873b07_0": "【疏】若爾人病衣重病差法在不答不同也以此要心有期病差必違前法如受戒後捨者以遂要期便失。",
    "X39n0714_002:0873b09_0": "次難中以羯磨離衣病差法失故引為並意言既許難生不壞亦應病差法存答中初句直破前難以下釋法失之義如下引例受戒後捨通指四捨。",
    "X39n0714_002:0873b12_0": "【疏】若爾狂病既止須解者何答此由得法本不由心所以病差法存須解。",
    "X39n0714_002:0873b14_0": "三中顛狂羯磨病差須解例難自失答中文意易見。",
    "X39n0714_002:0873b16_0": "【疏】故知有妨難處分不成同受重難障戒不發。",
    "X39n0714_002:0873b17_0": "次舉例中初例可解。",
    "X39n0714_002:0873b18_0": "【疏】若爾百遮同難應不成受答房非道本三義不成一妨難容可待無二可避餘處三不可避者容全不作故有不成受則不爾一青黃三角不可待無二即身自有不可待避三若以小遮不開大受未成通化永乖出期由此道本故不類也。",
    "X39n0714_002:0873b23_0": "次難中律有一百五十餘遮今舉大數故云百耳言同難者謂同妨難遮中不稱己名不稱師名年歲不滿先三定不發戒餘通得不帶遮為受僧但犯吉不妨得戒今難意云遮同妨難何以有成答中初明處分三義不成受下次明受戒三義相反百遮中顏色太青太黃眼生三角並是戒遮今略舉此三以彰不改然年歲衣鉢稱名疥癩亦可待無文據一往為語。",
    "X39n0714_002:0873c07_0": "【疏】四明人處者。",
    "X39n0714_002:0873c08_0": "四中以凡作羯磨必有所被今此處分人處兩兼情非情合義須定指故有此科。",
    "X39n0714_002:0873c10_0": "【疏】問處分法者為與人相應與處相應耶答此羯磨者與處相應何以知之論云處分地得餘處不得也。",
    "X39n0714_002:0873c12_0": "初問可見答引論證即多論也。",
    "X39n0714_002:0873c13_0": "【疏】若爾與處相應者餘人就此上應得作不答不得也。",
    "X39n0714_002:0873c15_0": "次難答文不委意在後通。",
    "X39n0714_002:0873c16_0": "【疏】若爾結界法亦與處相應餘人亦不得羯磨答不同也結界時無人別乞復不制稱人名法無所局故得此並反上不合故多論云餘人就此房上作重屋但問房主無不處分罪。",
    "X39n0714_002:0874a02_0": "第三難答中初示不同二義相反故有通局不稱名者謂羯磨不別牒也故下引證一須問房主二唯作重屋驗知自乞不通餘人。",
    "X39n0714_002:0874a05_0": "【疏】五明不處分罪有無者。",
    "X39n0714_002:0874a06_0": "【疏】若元不處分此何所疑今謂已得處分依限而作過限未知此過得不處分罪不。",
    "X39n0714_002:0874a08_0": "五中初問若全不乞定知有罪故約已乞以為問端。",
    "X39n0714_002:0874a10_0": "【疏】昔云此非全不處分但得小罪不犯殘也。",
    "X39n0714_002:0874a11_0": "【疏】有人云雖本處分處分不作反出於外理得殘罪故文云僧不處分此言知何不該。",
    "X39n0714_002:0874a13_0": "【疏】有人言如昔是也故律云僧處分過量一殘故無不處分罪別。",
    "X39n0714_002:0874a15_0": "三釋中後師引文助成初義既各有據義難取捨意以後師文義為允。",
    "X39n0714_002:0874a17_0": "【疏】問處分羯磨防妨難不答不防也。",
    "X39n0714_002:0874a18_0": "次科中初問答易解。",
    "X39n0714_002:0874a19_0": "【疏】若爾說淨法竟應不防長答本有妨難則不聽與處分待無方得說淨不爾懸防長故有過不合止由處分不防妨難處分竟便得生說淨正防長故作法竟即無由起。",
    "X39n0714_002:0874a23_0": "次難中立法是同所防有異故引徵之答中初約防不防以分兩異止下次約生不生轉釋不同。",
    "X39n0714_002:0874b01_0": "【疏】六明對沙彌者若彼沙彌時乞處分後受具戒竟方作房者更不須乞人法不異故也。",
    "X39n0714_002:0874b03_0": "沙彌中恐疑大小位別欲明前法存亡故也。",
    "X39n0714_002:0874b04_0": "【律】彼比丘當指示處所。",
    "X39n0714_002:0874b05_0": "【疏】八彼比丘下正明與法相。",
    "X39n0714_002:0874b06_0": "【註】爾時眾僧觀此比丘若可信者即聽使作若不可信者眾僧往看若僧不去應遣僧中可信者看若有妨難不應處分無者應與眾中應差堪能作羯磨者若上座若次座若誦律若不誦律應作白言大德僧聽某甲比丘自乞作屋無主自為己今從僧乞處分無難無妨處若僧時到僧忍聽當與某甲比丘處分無難無妨處白如是大德僧聽某甲比丘自求作屋無主自為己從僧乞處分無難無妨處僧今與某甲比丘處分無難無妨處誰謂長老忍僧與某甲比丘處分無難無妨處者默然誰不忍者說僧已忍與某甲比丘處分無難無妨處竟僧忍默然故是事如是持彼作房者應知初安石及土塹泥團乃至最後泥治訖者是也。",
    "X39n0714_002:0874b19_0": "【疏】就注解中分三從初至無者應與來商度彼人堪可進不二眾中應差下至如是持來明與白二之相也三彼作房下明作成分齊也相中可解。",
    "X39n0714_002:0874b22_0": "第八釋注云相中可解即指三科文相然第二與白二中先列四位簡能秉人上二約臘次下二取智能不誦律者但解義故以舉法被事必曉如非律擇堪能不容妄作。",
    "X39n0714_002:0874c02_0": "【律】無難處。",
    "X39n0714_002:0874c03_0": "【註】有虎狼師子諸獸者下至蟻子若不為此諸蟲獸所惱應治平地若有石樹株杌荊棘使人掘出若有坑溝渠陂池當使填滿若畏水淹漬當豫設堤防若地為人所認當共斷當無使他有語是謂難處也。",
    "X39n0714_002:0874c07_0": "【疏】九言無難者注中所列命梵而已如虎狼等為命蟻子等為梵若有石樹乃至水漬無非在後為命留難也為人認者計是妨緣今入難位者恐後諍競起非淨行也。",
    "X39n0714_002:0874c11_0": "九中初通示二難若下別點餘相諍競相言則違佛戒故云非淨行也。",
    "X39n0714_002:0874c13_0": "【律】無妨處。",
    "X39n0714_002:0874c14_0": "【註】謂通草車迴轉往來者。",
    "X39n0714_002:0874c15_0": "【疏】十妨處者止存一緣如諸部論中廣引必欲締搆理須精博不爾陷非良由不學故也。",
    "X39n0714_002:0874c17_0": "十中云一緣者即如注引草車謂大車也如諸部者十誦四周一尋內有塔地官地居士外道等地善見是人田園尸陀林王誌護等備如鈔中必下恐專據本律誡令通曉。",
    "X39n0714_002:0875a03_0": "【律】若比丘有難處妨處自求作屋無主自為己不將諸比丘指示處所若過量作者僧伽婆尸沙。",
    "X39n0714_002:0875a05_0": "【疏】就後犯本亦分十句初犯人二難三妨所以立法最末論此中而先述者答立法在後行之次第由僧處分止為妨難也此中論初作之次第非所起也餘句易識可解耳。",
    "X39n0714_002:0875a09_0": "後犯本中初科前標三句所下次明妨難前後不同非所起者非即是過餘下略指七句四自求五作屋六無主七自為八不乞處分九過量十結罪。",
    "X39n0714_002:0875a12_0": "【註】若彼作房於妨難二處者二突吉羅不處分過量二僧殘互相有無者隨其所犯若使他作成犯亦爾為他作成者二偷蘭二吉羅若以繩絣地作受教者過量作者犯殘不還報又不問彼並犯吉羅比丘尼偷蘭不犯者如量作減量作僧處分無難處無妨處如法絣作若為僧為佛圖講堂草菴葉庵小容身屋若作多人住屋如法者是。",
    "X39n0714_002:0875a19_0": "【疏】就辨罪中自他分別。",
    "X39n0714_002:0875a20_0": "【疏】初自作中二吉二殘有無可解。",
    "X39n0714_002:0875a21_0": "次科自作中初文言有無者注明具四而互有不定律約句數辨之初三罪四句一不處分過量無難有妨二不處分過量無難有妨(此二句二殘一吉)三不處分不過量有難有妨四僧處分過量有難有妨(此二句並一殘二吉)次明二罪有六句一不處分不過量有難無妨二不處分不過量無難有妨三處分過量有難無妨四處分過量無難有妨(此四句並一殘一吉)五處分不過量有難有妨(二吉律止有五句應加云)六不處分過量無難無妨(二殘有妨難得乞法者並約羯磨後生)三一罪四句一處分不過量有難無妨二處分不過量無難有妨(並一吉)三處分過量無難無妨(律止三句亦義加云)四不處分不過量無難無妨(各得一殘)。",
    "X39n0714_002:0875b09_0": "【疏】問為互過結罪俱過方結耶答如見論云長中減一磔手廣中過一磔手亦犯僧殘然此互過是兩口房廣長俱過是一口也俱是一業終是一殘可知。",
    "X39n0714_002:0875b12_0": "問俱互中唯明過量一殘答中先引論示犯然下對房顯相言兩口者一口則無廣長互義俱下明制業無差恐謂俱互有重輕故。",
    "X39n0714_002:0875b15_0": "【疏】二教他作中亦同犯罪。",
    "X39n0714_002:0875b16_0": "教佗中初文教即是遣故注云使耳。",
    "X39n0714_002:0875b17_0": "【疏】為他造非法故約緣分輕重也。",
    "X39n0714_002:0875b18_0": "次科輕重中點注二蘭二吉。",
    "X39n0714_002:0875b19_0": "【疏】二以繩絣地下明房主巧師過有無相但云受教者犯所以不定者若作過者房主則重巧師則輕故也又不問彼或不還報罪通自他也。",
    "X39n0714_002:0875b22_0": "有無中初示科意但下釋不定罪名注中多一殘字撿律亦無只由注中通言犯故乃有釋文若定犯殘此文何指若下釋成意謂罪該二人重輕有別故不可定又下釋報問對注不次律制房主房成須問不問吉羅又制巧師作已還報不報亦吉故言通自他也。",
    "X39n0714_002:0875c04_0": "【疏】上明身業為他作非法中但是勞務業不問房主犯不犯一向自得偷蘭罪不同口業教他作前人殘教者蘭前無罪教者吉由無身造故。",
    "X39n0714_002:0875c07_0": "次對簡中初明當戒教他犯相受教營造故是身業不下次明餘戒結犯有異如教他弄觸等並據前作不作辨犯輕重四重亦爾下篇無蘭應同結吉。",
    "X39n0714_002:0875c11_0": "【疏】就不犯中如量減量開前過量處分及無妨比上開之如法絣作開上過分齊俱有殘簡吉等若為僧下開二殘相草庵已下小故非犯。",
    "X39n0714_002:0875c14_0": "不犯中初科如量至絣作等此並依教明開為僧者此對為己明開。",
    "X39n0714_002:0875c16_0": "【疏】多人住者以擬多人住故非謂多人共造也如畜長例。",
    "X39n0714_002:0875c18_0": "釋多人中非謂共造者容同犯故如畜長者多人未分物過日不犯則同擬多人也分屬已定共處亦犯如共造也。",
    "X39n0714_002:0876a03_0": "【疏】有人云此由造作過量犯非謂如量貯畜罪如見云若沙彌大僧多人共作不犯段段計分一口過故亦犯。",
    "X39n0714_002:0876a06_0": "他解中意謂房長不可例同長則共畜有犯房則共造無過如下引證無犯必約段段計過方有犯義。",
    "X39n0714_002:0876a09_0": "【律】七有主為己不處分造房戒。",
    "X39n0714_002:0876a10_0": "【疏】第七有主為己不處分房戒。",
    "X39n0714_002:0876a11_0": "【疏】制意犯緣竝同上但無制量為別。",
    "X39n0714_002:0876a12_0": "七有主房指緣同者今須辨異一有主二為己三長佛六磔廣四磔須乞四不乞五不乞想六房成對前同別可知。",
    "X39n0714_002:0876a15_0": "【疏】如見云長佛六磔手廣四磔手已上者須處分。",
    "X39n0714_002:0876a16_0": "乞法量者此通二戒減此則不須乞。",
    "X39n0714_002:0876a17_0": "【註】佛在拘睒彌國時憂填王為闡陀造屋便斫路中神樹路人訶已比丘舉過佛訶責已若斫神樹吉羅便制此戒。",
    "X39n0714_002:0876a20_0": "【疏】就戒緣中問既有主為辨何須斫樹答為取下地擬施基故多人受用被訶非一。",
    "X39n0714_002:0876a22_0": "戒緣答中去樹為基明非取樹施字平呼多受用者律云尼拘律樹多人往返象馬車乘止息其下等。",
    "X39n0714_002:0876b01_0": "【律】若比丘欲作大房。",
    "X39n0714_002:0876b02_0": "【註】大房者多用財物也。",
    "X39n0714_002:0876b03_0": "【律】有主。",
    "X39n0714_002:0876b04_0": "【註】反上無主是也。",
    "X39n0714_002:0876b05_0": "【律】為己作當將餘比丘往指授處所。",
    "X39n0714_002:0876b06_0": "【註】彼比丘如上知已應至僧中禮上座足等從僧三乞文同於上以有主為異。",
    "X39n0714_002:0876b08_0": "【律】彼比丘應指授處所。",
    "X39n0714_002:0876b09_0": "【註】僧應觀察若有信者有智慧即信彼而與白二若不信者如上進止。",
    "X39n0714_002:0876b11_0": "【律】無難處。",
    "X39n0714_002:0876b12_0": "【註】謂師子罷熊等獸也若不為彼而所嬈者應如上平治乃至畏識認應先斷了。",
    "X39n0714_002:0876b14_0": "【律】無妨處。",
    "X39n0714_002:0876b15_0": "【註】中問容草車迴轉者。",
    "X39n0714_002:0876b16_0": "【律】若比丘有難處有妨處作大房有主為己作不將餘比丘往指授處所者僧伽婆尸沙。",
    "X39n0714_002:0876b18_0": "【註】辨相開通如前房戒唯無過量為異也。",
    "X39n0714_002:0876b19_0": "【疏】就戒本中先明立法有八句除自求及量限後戒本中除自求及過量文相可解餘如鈔。",
    "X39n0714_002:0876b21_0": "戒本中立法犯本除句並同下指鈔者彼云此房屬於己身若死遠去不還隨念分處若與三寶親友白衣自賣取錢隨心自在唯不得賣地地是僧物僧不許賣房僧得罪若房主不自處分者屬四方僧次第住之。",
    "X39n0714_002:0876c03_0": "四分律含注戒本疏行宗記二下之二"
}