{
    "X45n0765_001:0443b05_0": "起信論疏略序",
    "X45n0765_001:0443b07_0-0": "一心印萬法萬法攝一心故一多無礙生佛不二而尚匪筆墨之所形容焉蓋摽月者可假指渡海者非無筏所以一切聖賢知娑婆教體乘音聲輪以如幻三昧談摩訶衍乃經乃論沄沄然興焉積而成大藏靡踰詮一心也中印度馬鳴大士應婆伽之懸讖倒波旬之赤幡推本實相作為斯論所謂開二門於一心眾典之要一以貫之不亦宜哉梁承聖年中三藏真諦譯成一卷今此譯是也論文幽邃雖高師碩德猶難之故訓[言*故]之家無慮不多矣方今其傳者疏無核於賢首記無博於長水蓋垂千載亦復無媿焉近明憨山大師撮精要於二家參互後譯發明隱微間出一言冷冷喚醒使學者優柔反覆是憨師之用心勤哉餘友龍湫每有禪寂之餘栖心乎竺墳適得憨師之疏略以為奇秘也今歲丙午夏餘客自東尾避暑於智山白鷺水嘗見龍之帳中別無餘長唯疏略一篇而已龍既謂余曰吾得此疏蓋亦有年言不繁理已穩尤便於初學乃授梓人廣布海內請子為之序余曰於戱叔末之弊人才益謭書籍益多雖戶誦家說靡得而通焉負笈之士病諸且起信一論也賢首長水二家窮源盡委無復餘蘊也以此疏略監諸二家存什一於千百恐人以為有遺漏乎龍師曰吁否若子之言憨師此疏無益於學者耶刪繁從略此疏之所以興也今之人力淺才謭無以通貫者非書籍之過矣面牆之徒胯蠁競馳謾執性癈書是效少林遣著之顰取大方無礙之笑者也蓋雖焚青龍之新疏無白馬之舊馱則法何仗傳哉子思之乎余立癈卷",
    "X45n0765_001:0443b07_0-1": "唯々退遂出書林壽木繕刻三閱月竣既而又請余之言顧龍師之言也雖出一時之言確然不可闕蓋讀此疏莫以略為不足以前一言記徧端矣。",
    "X45n0765_001:0443c16_0": "時寬文丙午仲秋日東尾沙門覃思熏沐合十書于般若山空諦室大乘起信論疏略卷上此論之題目乃一論之綱宗也言大乘起信者為欲發起大乘正信故言大乘者即所信之法體所言法者謂眾生心是心即攝一切世間出世間法具有體相用三大之義故乘者運載之義謂諸佛乘此而證菩提般涅槃菩薩乘此而趣果海眾生乘之而輪轉生死以此心是一切聖凡迷悟因果之總相故故下文云即一法界大總相法門體今欲諦信此心即是大乘正解不謬故云大乘起信以佛入滅六百年中小乘心外取法不信唯心多起諍論外道邪見破壞正法故論主興悲特造此論故下因緣云為欲除疑捨邪執故以疑與信友今信此心則疑自除矣論者決擇是非發明正理揀非經律故以論名賢首本疏精詳但科叚少隔故刪繁從略間會記義不別出文貴成一貫故云疏略。",
    "X45n0765_001:0444b07_0": "馬鳴菩薩造",
    "X45n0765_001:0444b08_0": "此造論人也馬鳴者以此菩薩初生之時感群馬悲鳴故以為名及說法時諸馬聞之亦皆悲鳴疏引摩訶摩耶經云如來滅後六百歲已諸外道等邪見競興毀滅佛法有一比丘名曰馬鳴善說法要降伏一切諸外道輩。",
    "X45n0765_001:0444b13_0": "真諦三藏譯",
    "X45n0765_001:0444b14_0": "此譯人名也論有二譯一西印土優禪尼國沙門波羅末陀此云真諦梁元帝承聖三年於衡州建興寺譯成一卷二十四紙一于闐國沙門實叉難陀此云喜學大周則天時於東都佛授記寺譯成兩卷亦二十四紙今行前譯。",
    "X45n0765_001:0444b19_0": "西京太原寺沙門法藏造疏",
    "X45n0765_001:0444b20_0": "明南嶽沙門　　德清纂略",
    "X45n0765_001:0444c01_0": "將著論文先歸敬述意。",
    "X45n0765_001:0444c01_1": "後述正論文。",
    "X45n0765_001:0444c01_2": "且初。",
    "X45n0765_001:0444c02_0": "歸命盡十方。",
    "X45n0765_001:0444c03_0": "將造斯論先須歸命三寶請求加被所以然者以造論釋經經乃佛說佛智甚深非情可測故請三寶威力加被攝受故使論義印契佛心且示法有所宗以三寶是所宗依故今云歸命乃能皈之心也欲入法性先忘我相命以統攝六根今以命歸則身心俱亡能歸之至也十方乃所歸分際意謂所著論義乃法界之宗故須皈命盡十方之三寶以心無分限故境亦無量也。",
    "X45n0765_001:0444c11_0": "最勝業徧知色無礙自在救世大悲者。",
    "X45n0765_001:0444c12_0": "此歸佛寶也佛以三輪應物今所歸三輪皆最上殊勝者意顯非應化身乃從法垂報之身也徧知意業最勝也凡夫不知外道邪知聲聞偏知菩薩分知唯佛徧知以實智證理理無不徹權智鑒機機無不宜故色無礙自在身業最勝也華嚴佛有無量相相有無量好根根圓融周徧自在又十身歷然無壞無雜故救世大悲者語業最勝也佛以音聲輪應機說法世乃眾生世間所救之處大悲能救之心萬德之中如來唯用大悲為力故者指歸其人也。",
    "X45n0765_001:0445a02_0": "及彼身體相法性真如海無量功德藏。",
    "X45n0765_001:0445a03_0": "此歸法寶也及者謂不但歸佛亦歸法也彼身指上佛也佛以法為身謂真如所流教法即是法身常住以此中已有如來全身故意顯此法即佛之體相本無二故法性真如海正指法體也謂真如法性即法身真體徧與一切染淨諸法為體性故以隨緣不變不變隨緣故喻如海遇風起諸波浪濕性無二故如來藏中含攝眾德故云功德藏。",
    "X45n0765_001:0445a10_0": "如實修行等。",
    "X45n0765_001:0445a11_0": "此歸僧寶也僧通凡聖聖通大小如實修行乃地上菩薩也據後譯云無邊德藏僧勤求正覺者則上句歎德人能攝德故名為藏。",
    "X45n0765_001:0445a14_0": "下述造論意。",
    "X45n0765_001:0445a15_0": "為欲令眾生除疑捨邪執起大乘正信佛種不斷故。",
    "X45n0765_001:0445a16_0": "此述造論意也法不虛設必有所為今有四意一以二乘不信唯心故顯示正義令除疑惑二以外道邪執故對治邪執令捨邪見三以修行者未起正行故分別發趣道相令起正信以為行本四為使信成滿入住不退堪受佛果故云佛種不斷為此多意所以造論。",
    "X45n0765_001:0445b02_0": "下正述論文。",
    "X45n0765_001:0445b03_0": "論曰有法能起摩訶衍信根是故應說。",
    "X45n0765_001:0445b04_0": "首標論者揀異經律非佛親說法者即論所依宗本謂一心法具二門三大義故正示所宗摩訶衍此云大乘謂所宗心法即是大乘能信此心為大乘根本有此勝益是故須說。",
    "X45n0765_001:0445b08_0": "說有五分云何為五一者因緣分二者立義分三者解釋分四者修行信心分五者勸修利益分。",
    "X45n0765_001:0445b10_0": "此標製作之規也分章析義故名為分將述此論先立五分以為次第法不孤起必有因由故首因緣由致既興必標宗本故次立義宗本修然非釋不解故次解釋既解法義非行不階故次修行信心解行雖陳鈍根懈進故次勸修此一論之大節也。",
    "X45n0765_001:0445b16_0": "下列釋因緣分。",
    "X45n0765_001:0445b17_0": "初說因緣分問曰有何因緣而造此論答曰是因緣有八種云何為八。",
    "X45n0765_001:0445b19_0": "徵釋因緣略有八種。",
    "X45n0765_001:0445b20_0": "一者因緣總相所謂為令眾生離一切苦得究竟樂非求世間名利恭敬故。",
    "X45n0765_001:0445c02_0": "此八因緣中第一總相與一論為發起之由故以凡夫外道迷此一心以招苦苦壞苦行苦分叚生死之苦二乘菩薩尚有變易生死之苦謂佛證得菩提覺法樂涅槃寂靜樂今為令眾生離苦得樂非求世間名利恭敬故。",
    "X45n0765_001:0445c07_0": "二者為欲解釋如來根本之義令諸眾生正解不謬故。",
    "X45n0765_001:0445c09_0": "此與立義分及解釋分中顯示正義對治邪執作發起因緣也以彼文中說依一心法有二種門各攝一切法即是如來所說法門之根本又生滅門中本覺名如始覺名來始本不二名曰如來今以如來依此心成故名此心為如來根本之義具釋此義令地前三賢比觀相應故云正解即顯示正義也比觀離倒故名不謬即對治邪執也。",
    "X45n0765_001:0445c16_0": "三者為令善根成熟眾生於摩訶衍法堪任不退信心故。",
    "X45n0765_001:0445c18_0": "此即下分別發趣道相也以彼文云令利根者發決定信進趣大道堪任住於不退信故此當十信終心自分滿足故云成熟進入住正定聚中使前信心堪任不退。",
    "X45n0765_001:0446a02_0": "四者為令善根微少眾生修習信心故。",
    "X45n0765_001:0446a03_0": "即下修行信心分初四種信心及四種修行也以彼文云令信未滿者修行信心使滿足故以信未滿故云微少令進向滿故云修習信心也。",
    "X45n0765_001:0446a06_0": "五者為示方便消惡業障善護其心遠離癡慢出邪網故。",
    "X45n0765_001:0446a08_0": "此中根劣易退賴多方便故有四也四中前三為下中上三品後一策以勸修今當初下品也即下修行信心中第四修行末文云令業重惑多者善根難發眾生以禮懺等方便消惡業障障輕故內離頑嚚癡慢外出邪魔骨網。",
    "X45n0765_001:0446a13_0": "六者為示修習止觀對治凡夫二乘心過故。",
    "X45n0765_001:0446a14_0": "當中品也即下第五修習止觀門文中雙明止觀遣凡小二執故云對治也。",
    "X45n0765_001:0446a16_0": "七者為示專念方便生於佛前必定不退信心故。",
    "X45n0765_001:0446a17_0": "當上品也即下修行信心末勸生淨土門等文云舉勝方便令彼觀解分得相應眾生恐後報遷遇緣成退故令往生淨土成不退也。",
    "X45n0765_001:0446a20_0": "八者為示利益勸修行故。",
    "X45n0765_001:0446b01_0": "即下勸修利益分也文云舉彼損益勸令修捨即總策成前諸行也。",
    "X45n0765_001:0446b03_0": "有如是等因緣所以造論問曰修多羅中具有此法何須重說答曰修多羅中雖有此法以眾生根行不等受解緣別所謂如來在世眾生利根能說之人色心業勝圓音一演異類等解則不須論。",
    "X45n0765_001:0446b07_0": "此下難明須論不須論也此言當正法時佛現住世以有如來親為說法故不須論也色心圓音即佛三業殊勝一音圓音有二義華嚴經云如來於一語言中演說無邊契經海如來同一切音故云圓音又云一切眾生語言法一言演說盡無餘以一切音即一音一音即一切音一一語言徧窮生界而其音韻恒不雜亂若音不徧則是音非圓若音徧而無韻曲則是圓非音今不壞曲而等徧不動徧而差韻此是如來圓音非是心識思量境界。",
    "X45n0765_001:0446b16_0": "若如來滅後或有眾生能以自力廣聞而取解者。",
    "X45n0765_001:0446b17_0": "聞廣經文得解佛意不須他論故云自力此具文持義持。",
    "X45n0765_001:0446b19_0": "或有眾生亦以自力少聞而多解者。",
    "X45n0765_001:0446b20_0": "亦以自力尋略經文而能深解佛意故亦不須論此有義持無文持。",
    "X45n0765_001:0446c02_0": "或有眾生無自心力因於廣論而得解者。",
    "X45n0765_001:0446c03_0": "此但依經文不能解意因他廣論而得解了故云無自心力此有文持無義持。",
    "X45n0765_001:0446c05_0": "自有眾生復以廣論文多為煩心樂總持少文而攝多義能取解者。",
    "X45n0765_001:0446c07_0": "此明當機也不須廣論有二義一根利不假二心煩不耐。",
    "X45n0765_001:0446c09_0": "如是此論為欲總攝如來廣大深法無邊義故應說此論。",
    "X45n0765_001:0446c11_0": "此明論義深廣也以一心法為一法界大總相法門體徹法界源故云深攝法無邊故云廣深者如理智廣者如量智。",
    "X45n0765_001:0446c14_0": "已說因緣分次說立義分摩訶衍者總說有二種云何為二一者法二者義。",
    "X45n0765_001:0446c16_0": "此標立義分也法者出大乘體即宗本法也大位在因通於染淨在果唯取於淨義者辨大乘名義何故此心是大乘耶謂此心具三大義故名為大有二運轉故名為乘是故先顯法體後釋義理。",
    "X45n0765_001:0446c20_0": "所言法者謂眾生心是心則攝一切世間出世間法依於此心顯示摩訶衍義。",
    "X45n0765_001:0447a02_0": "此標宗顯義也出其法體言眾生心者謂如來藏心具和合不和合二門以在眾生位就隨染故得具二門若在佛地則無和合義以始覺同本唯一真如以此心體相無礙染淨同依隨流返流唯轉此心故隨染不覺則攝世間法約不變之本覺於返流之始覺則攝出世間法此猶約生滅門辨若約真如門則融鎔含攝染淨不殊依此一心宗本法上顯示大乘三大之義故名此心以為法也。",
    "X45n0765_001:0447a10_0": "何以故。",
    "X45n0765_001:0447a11_0": "此徵明法義也徵有二意一心通染淨大乘唯淨如何此心能顯彼義二心法是一大乘義廣如何一心能示彼義下釋義中以心含染淨故能顯大乘心具三大故能顯乘義。",
    "X45n0765_001:0447a15_0": "是心真如相即示摩訶衍體故是心生滅因緣相能示摩訶衍自體相用故。",
    "X45n0765_001:0447a17_0": "此標舉二門為起下文張本也舉真如門起下即是一法界等文真如相起下復次真如者依言說分別等文此相者是義相即性也舉生滅門起下依如來藏有生滅心等文生滅者隨熏變動也因緣者生滅緣由起下復次生滅因緣等文相者生滅之狀起下復次生滅相者等文真如門中云即示者以與彼所顯詮旨不別故云即示以是不起故唯示體生滅門中云能示者以染淨既異詮旨又分能所不同故不云即而云能此中體謂生滅門中本覺之義是生滅之自體以是生滅之因故故下釋生滅文具顯所示三大之義以真如是不起門故唯直示體生滅是起動門起含不起故具示三大之義。",
    "X45n0765_001:0447b10_0": "上示法。",
    "X45n0765_001:0447b10_1": "下示義。",
    "X45n0765_001:0447b11_0": "所言義者則有三種云何為三一者體大謂一切法真如平等不增減故二者相大謂如來藏具足無量性功德故三者用大能生一切世間出世間善因果故。",
    "X45n0765_001:0447b15_0": "此標列義門以起下復次真如自體相者等文也言體大者真性深廣凡聖染淨皆以為依故受大名以真如是一切法平等體故不增減者謂隨流加染不增缺淨不減返流除染不減加淨不增染淨之所不虧始終之所不易故相大者即二種如來藏中不空之義以不異體之相故云性德用大者謂隨染業行然此用大是報化二身麤細之用令諸眾生始成世善終成出世善也。",
    "X45n0765_001:0447c03_0": "上釋大。",
    "X45n0765_001:0447c03_1": "下釋乘。",
    "X45n0765_001:0447c04_0": "一切諸佛本所乘故一切菩薩皆乘此法到如來地故。",
    "X45n0765_001:0447c06_0": "此釋乘也諸佛者標果望因以解乘也菩薩者舉因望果以成運也始覺之智是能乘本覺之理為所乘故攝論云乘大性故名為大乘。",
    "X45n0765_001:0447c09_0": "已說立義分次說解釋分。",
    "X45n0765_001:0447c10_0": "此結前生後也。",
    "X45n0765_001:0447c11_0": "解釋有三種云何為三一者顕示正義二者對治邪執三者分別法趣道相。",
    "X45n0765_001:0447c13_0": "此標列釋名也顯示者正釋所立大乘法義對治者既明正體須遣異計發趣者趣正理之階降也列此三名即下正宗一分有此三叚依義解釋。",
    "X45n0765_001:0447c16_0": "且初顯正義。",
    "X45n0765_001:0447c17_0": "顯示正義者依一心法有二種門云何為二一者心真如門二者心生滅門。",
    "X45n0765_001:0447c19_0": "此標宗本釋上立義分中眾生心攝一切等也謂如來藏含於二義一約體絕相義即真如門謂非染淨生滅不動不轉平等一味性無差別眾生即涅槃不待滅也二隨緣起滅義即生滅門謂隨熏轉動成於染淨染淨雖成性恒不動正由不動能成染淨是故不動亦在動門即下文識中本覺及上文生滅門中自體是也故楞伽云如來藏名阿賴識而與無明七識共俱如大海波常無斷絕等並約生滅門說也然此二門舉體通融體相莫二此無二處諸法中實不同虛空性自神解故云一心。",
    "X45n0765_001:0448a10_0": "是二種門皆各總攝一切法。",
    "X45n0765_001:0448a11_0": "此結釋二門也上立義分中直云攝今釋中云各總攝者以一心含通別二門故今分通別又各攝故以真如門是染淨通相通相之外無別染淨故得總攝一切諸法生滅門者別顯染淨染淨之法無所不該故亦總攝一切諸法通別雖殊齊無所遺故云各攝又以此即是真如隨緣和合變作諸法諸法即無異體還攝真如門也以此二門齊攝不二故得說為一心也問二門既齊攝者何故真如門中唯示體生滅門中具顯三大耶答真如是泯相顯實門不壞相而即泯故得攝於生滅以泯相故而相不存但攝體也生滅是攬理成事門不壞理而成事故得攝於真如以成事而理不失故具三大義也以生滅起必賴於真故攬理理不失真如未必藉生滅故泯相相不存相不存故唯示體理不失故示於三大是故攝義是齊示義別也。",
    "X45n0765_001:0448b06_0": "此義云何以是二門不相離故。",
    "X45n0765_001:0448b07_0": "此結二門義也責義云若二門各別不可相從若本唯一心未容影攝答云以體不相離故如金莊嚴具思之可見。",
    "X45n0765_001:0448b10_0": "下別辨二門。",
    "X45n0765_001:0448b10_1": "初真如門分二義。",
    "X45n0765_001:0448b10_2": "初顯體離言以明觀智境。",
    "X45n0765_001:0448b11_3": "二依言辨德以明生信境。",
    "X45n0765_001:0448b11_4": "且初顯離言。",
    "X45n0765_001:0448b13_0": "心真如者即是一法界大總相法門體所謂心性不生不滅。",
    "X45n0765_001:0448b15_0": "此標釋真如門也顯體離言釋上立義分中真如義也即無二真心為一法界此非筭數之一謂如理虛融平等不二故稱為一依生聖法故云法界中邊論云法界者聖法因義總相法門者二門之中不取別相但取總相然亦該收別盡故云大也此一法界生滅真如皆舉全體故云體也軌生物解故曰法聖智通遊故云門不生不滅者釋上法體隨妄不生約治不滅又修起不生處染不滅。",
    "X45n0765_001:0448c03_0": "一切諸法唯依妄念而有差別若離心念則無一切境界之相。",
    "X45n0765_001:0448c05_0": "此釋上不生滅之所以也妄執者云現見諸法差別遷流何言性無生滅釋云差別相者是汝徧計妄情所作本來無實如依病眼妄見空華疑者又云以何得知從妄念生釋云以諸聖人離妄念故既無此境即驗此境定從妄生。",
    "X45n0765_001:0448c10_0": "是故一切法從本已來離言說相離名字相離心緣相畢竟平等無有變異不可破壞唯是一心故名真如。",
    "X45n0765_001:0448c13_0": "此覈真如得名也由一切法離念則無境界之相故皆即真如也非音聲之所說故離言說相非文句之所詮故離名字相此二句言語路絕非聞慧境也心行處滅故離心緣相非思慧境也以離妄名真離異名如畢竟下三句以離世間非修慧境也平等者雖徧通染淨而性恒無二也所以得無二者以在緣時始終不改所以在緣不改者以不同有為可破壞故此則在染不破治道不壞一心者結歸法體真如者依義立名。",
    "X45n0765_001:0449a02_0": "以一切言說假名無實但隨忘念不可得故言真如者亦無有相。",
    "X45n0765_001:0449a04_0": "此釋上離緣以雙遣名相也離言說相者以言教非實不可如言取也但隨下釋成無實所以也疑云既云離名字相何故復立此真如名此自語相違也故今釋遣假名非實不相違也不但離名而亦離相以名依相立但是徧計所執故楞伽云相名常相隨而生請妄想故今名相雙遣。",
    "X45n0765_001:0449a10_0": "謂言說之極因言遣言。",
    "X45n0765_001:0449a11_0": "此釋疑也疑云既絕名相但假客名者何故不立餘名而唯云真如耶釋云真如者是言說之極謂此名之後更無有名故攝論中十種名內真如是第十究竟名故云極也因言遣言立名之意也立此極名為遣於名故。",
    "X45n0765_001:0449a16_0": "此真如體無有可遣以一切法悉皆真故亦無可立以一切法皆同如故。",
    "X45n0765_001:0449a18_0": "此重拂妄計也恐難者見前雙遣真如名相將謂真如亦是可遣則生斷見故此釋云但遣虛妄名相不遣真如實法以是妙智觀境故何以不遣以法悉真無法可遣疑者既聞真理不遣則謂有法可立當情執取故釋云亦無可立以離妄情故何以不立以如故不可立也。",
    "X45n0765_001:0449b04_0": "當知一切法不可說不可念故名為真如。",
    "X45n0765_001:0449b05_0": "此結離言絕慮也。",
    "X45n0765_001:0449b06_0": "問曰若如是義者諸眾生等云何隨順而能得入。",
    "X45n0765_001:0449b07_0": "隨順問方便觀得入問正觀。",
    "X45n0765_001:0449b08_0": "答曰若知一切法雖說無有能說可說雖念亦無能念可念是名隨順若離於念名為得入。",
    "X45n0765_001:0449b10_0": "此正明觀智境也說念皆無能所者明念即無念非滅於念非滅念故故名雖念離於斷見也即無念故皆無能所離於常見也於一念間離此二見無此二故故能稱順中道隨順法性無念亦離方入真如。",
    "X45n0765_001:0449b15_0": "上明離言以明觀智境竟。",
    "X45n0765_001:0449b15_1": "下依言辨德以明生信境。",
    "X45n0765_001:0449b17_0": "復次真如者依言說分別有二種義。",
    "X45n0765_001:0449b18_0": "以前標云是心真如相此上釋真如二字下釋相字相即義也於真體中開說二義故不標相字顯此二義者若離於言即唯一味今既依言故說有二即顯不可隨言執取也但為生物信解故。",
    "X45n0765_001:0449c02_0": "云何為二一者如實空以能究竟顯實故二者如實不空以有自體具足無漏性功德故。",
    "X45n0765_001:0449c04_0": "此徵釋二義也如實空者此以如實之中空無妄染非謂如實自空此則如實之空也以妄空故遂能顕示真理故云顯實不空有二義一異妄無體故二異恒沙有流煩惱故故云具足等也佛性論偈云由客塵空故與法界相離無上法不空與法界相隨。",
    "X45n0765_001:0449c10_0": "所言如實空者從[(傘-(企-止+十))/月]已來一切染法不相應故謂離一切法差別之相以無虛妄心念故。",
    "X45n0765_001:0449c12_0": "此略釋空義也以妄境從妄念生故釋顯空無也良以倒心妄境情有理無真如之德理有情無故不相應也。",
    "X45n0765_001:0449c15_0": "當知真如自性非有相非無相非非有相非非無相非有無俱相非一相非異相非非一相非非異相非一異俱相。",
    "X45n0765_001:0449c18_0": "此廣釋空義也非有相者明真離妄有也惑者云既其非有即應是無故釋云非無也惑者聞上非有非無則謂雙非是真如法釋云因汝執有我說非有非謂法體是非有因汝執無我說非無非謂法體是非無故又非却雙非也惑者云我上立有立無汝立雙非雙非若存即有無隨喪今雙非既非我有無還立釋云因汝執雙非故我說非非非許雙是如何復執俱相以惑者執四句為真如法特以非字破之所謂四句既離百非俱遣也一異等四句準前可知然執取雖多總攝不過此二四句故廣百論云復次為顯世間所執諸法皆非真實及顯外道所執不同故偈云有非有俱非一非一雙泯隨次而配屬智者達非真。",
    "X45n0765_001:0450a11_0": "乃至總說依一切眾生以有妄心念念分別皆不相應故說為空若離妄心實無可空故。",
    "X45n0765_001:0450a13_0": "此結空義也妄計塵沙難可徧歷故今總攝辨不相應此順結也離妄者反結也以對染無說真為空非無如體以為空也亦可此文是釋疑疑者聞上真空則撥無真體及恒沙功德故為此釋是則聞空不異不空也。",
    "X45n0765_001:0450a18_0": "上釋空義竟。",
    "X45n0765_001:0450a18_1": "下釋不空義。",
    "X45n0765_001:0450a19_0": "所言不空者已顯法體空無妄故即是真心常恒不變淨法滿足則名不空。",
    "X45n0765_001:0450b01_0": "此顯不空義也常恒不變者竪顯真體三際無窮釋前以有自體也淨法滿足者橫顯淨德十方無盡顯前具足無漏等也自體既常不變復具無漏功德法體若然豈是空耶故結不空。",
    "X45n0765_001:0450b05_0": "亦無有相可取以離念境界唯證相應故。",
    "X45n0765_001:0450b06_0": "此釋疑也惑者聞淨法不空則謂同於情執之有故此釋也是則不空不異於空以離下釋離相所以也若妄念可緣則是有相既唯真智之境明知無妄執之相也故云唯證相應。",
    "X45n0765_001:0450b10_0": "上釋心真如門竟。",
    "X45n0765_001:0450b10_1": "下釋心生滅門有二大科。",
    "X45n0765_001:0450b11_0": "初釋生滅心法。",
    "X45n0765_001:0450b11_1": "二辨所示之義。",
    "X45n0765_001:0450b11_2": "初中又二初染淨生滅。",
    "X45n0765_001:0450b12_3": "二染淨相貲。",
    "X45n0765_001:0450b12_4": "且初。",
    "X45n0765_001:0450b13_0": "心生滅者依如來藏故有生滅心。",
    "X45n0765_001:0450b14_0": "此下釋生滅心初標體也謂不生滅心因無明風動作生滅故說生滅心依不生滅心然此二心竟無二體但約二義以說相依如不動之水為風所吹而作動水動靜雖殊而水體是一謂自性清淨心名如來藏因無明風動作生滅故云依如來藏有生滅心也。",
    "X45n0765_001:0450b20_0": "所謂不生不滅與生滅和合非一非異。",
    "X45n0765_001:0450c01_0": "此辨生滅相也是上如來藏自性清淨心動作生滅不相離故故云和合非謂別有生滅來與真如合謂生滅之心心之生滅無二相故心之不生滅因無明成生滅心從本覺起而無二體不相捨離故下文云如大海水因風波動水相風相不相捨離謂真心舉體成生滅之相生滅之相莫非神解不離真心如是不離名為和合非一非異者真如全體動故心與生滅非異而恒不變真性故與生滅不一依楞伽經以七識染法為生滅以如來藏淨法為不生滅此二和合為阿黎耶識以和合故非一非異以若一則無和合若異亦無和合以非一非異故得和合也如經云譬如泥團微塵非異非不異金莊嚴具亦復如是若泥團微塵異者非彼所成而實彼成是故非異若不異者泥團微塵應無差別如是轉識藏識真相若異者藏識非因若不異者轉識滅藏識亦應滅而自真相實不滅是故非自真相滅但業相滅解云此中真相是如來藏轉識是七識藏識是黎耶今此論主總括彼經上下文義作此安立故云非一非異。",
    "X45n0765_001:0450c20_0": "名為阿黎耶識。",
    "X45n0765_001:0451a01_0": "此出生滅名也此生滅不生滅即之義不一辨之心不異目此二義不二之心名阿黎耶識或云阿黎耶者但梵音楚憂耳梁真諦三藏就名翻為無沒識今奘法師就義翻為藏識藏是攝藏義無沒是不失義義一名異也所攝名藏謂諸眾生取為我故良以真心不守自性隨熏和合似一似常故諸愚者以似為實執為內我我見所攝故名為藏由是義故二種我見永不起位失賴耶名也又能藏自體於諸法中又能藏諸法於自體內論云能藏所藏我愛執藏此之謂也依此義立名。",
    "X45n0765_001:0451a11_0": "此識有二種義。",
    "X45n0765_001:0451a12_0": "此辨義也二義者謂此識體原是真妄和合而成故今在迷具含二義謂真如有二義一不變義二隨緣義無明亦二義一無體即空義二有用成事義此則真妄二義中各含二義由初義成上真如門由後義成此生滅門也就此識在生滅門中亦含二義謂覺義不覺二義於覺義中有本覺始覺不覺中有根本不覺枝末不覺以上真妄各二義具在本識中故云此識有二種義舊疏以為難故有多解大約就隨流返流之別故有多義耳問此中一識有二義與上一心有二門何別耶答上一心中含於二義謂不守自性隨緣義及不變自性絕相義今此但就隨緣門中染淨事理無二之相明此識也是則前一心義寬該收於二門此一識義陿局在於一門問此中本覺與上真如何別答真如約體絕相說本覺約性功德說謂大智慧光明義等名本覺相本者是性義覺者是智慧義以此皆為翻妄染顯故在生滅門中攝以真如門中無翻染等義故與此不同也是故體相二大俱名本覺並在生滅門中故得具三大也。",
    "X45n0765_001:0451b11_0": "能攝一切法生一切法。",
    "X45n0765_001:0451b12_0": "此顯識勝能也上二門中云皆各總攝此中不云各者以此二義陿於二門故但明一識由含二義故攝一切不言二義各攝一切又上文中但云攝而不云生者以真如門無能生義故此識之中以不覺熏本覺故生諸染法流轉生死以本覺熏不覺故生諸淨法返流出纏成於始覺依此二義徧生一切染淨法故云能生也。",
    "X45n0765_001:0451b19_0": "云何為二一者覺義二者不覺義所言覺義者謂心體離念離念相者等虛空界無所不徧法界一相即是如來平等法身依此法身說名本覺。",
    "X45n0765_001:0451c02_0": "此下依名辨釋也覺有本始先釋本覺離於妄念顯無不覺非唯無不覺之暗乃有大智慧光明義等故也虛空有二義以況於本覺一周徧義謂橫徧三際竪通凡聖二無差別義謂在纏出障性恒無二故如來法身者欲明覺義出纏相顯故既是法身之覺理非新成故云本也。",
    "X45n0765_001:0451c08_0": "何以故本覺義者對始覺義說以始覺者即同本覺。",
    "X45n0765_001:0451c09_0": "以覈本覺得名責有二意也謂前開章中直云覺義今何云本覺二謂今既云本覺何故前但云覺故此答云以對始故說之為本答初意也以本覺隨染要待始覺方名本覺覺至心源本無二相是故上文但云其覺答後意也又始覺是本覺所成還契心源融成一體方名始覺。",
    "X45n0765_001:0451c15_0": "上明本覺。",
    "X45n0765_001:0451c15_1": "下明始覺。",
    "X45n0765_001:0451c16_0": "始覺義者依本覺故而有不覺依不覺故說有始覺。",
    "X45n0765_001:0451c17_0": "此明起始覺之所由也依本覺者謂即此心體隨無明緣作妄念故依不覺者本覺內熏力故漸有微覺厭求乃至究竟還同本覺故下文云本覺隨染生智淨相者即此始覺也。",
    "X45n0765_001:0452a01_0": "又以覺心源故名究竟覺不覺心源故非究竟覺。",
    "X45n0765_001:0452a02_0": "染心之源謂性淨也麤相之源謂生相也覺此者始覺道圓同於本覺此在佛地不了其源始未同本此在金剛已還。",
    "X45n0765_001:0452a05_0": "此義云何。",
    "X45n0765_001:0452a06_0": "此徵明究竟不究竟義也此下將四相麤細寄顯返流四位以明始覺分際前三相釋不究竟覺後一相釋究竟覺然此四相約真心隨熏麤細差別寄說為四非約一剎那心明四相也從細至麤約三細六麤以明四相分齊生相唯一即業相住相有四即轉相現相智相相續相異相有二即執取相計名字相滅相唯一者即起業相下約返流寄位從麤至細先覺滅相。",
    "X45n0765_001:0452a14_0": "如凡夫人覺知前念起惡故能止後念令其不起雖復名覺即是不覺故。",
    "X45n0765_001:0452a16_0": "此下寄位辨始覺也未入十信已前廣造身口意業而不覺知今入信已能知惡業定招苦報故言覺知此明覺於滅相義也以但能止惡故云雖覺未覺煩惱故云不覺。",
    "X45n0765_001:0452a20_0": "如二乘觀智初發意菩薩等覺於念異念無異相以捨麤分別執著相故名相似覺。",
    "X45n0765_001:0452b02_0": "此三賢菩薩覺異相也十解初心名發心住舉初等後以此菩薩雖留惑故不證人空然於人空實得自在故與二乘同一位論此中二乘不約人但約人空觀智與菩薩同故雙舉之起貪瞋等名麤分別著違順境名執著相異相夢破故能捨之未破住相故云相似覺。",
    "X45n0765_001:0452b08_0": "如法身菩薩等覺於念住念無住相以離分別麤念相故名隨分覺。",
    "X45n0765_001:0452b10_0": "此地上菩薩覺住相也初地至九地同證法身徧滿皆名法身菩薩覺念住者以此菩薩於無明念中次第覺於四種住相謂初地覺相續相從二地至七地覺智相八地覺現相九地覺轉相此四俱名為住故云覺於念住然異前執著今但約心故云分別異彼根本生相故云麤念相以覺道未圓故云隨分。",
    "X45n0765_001:0452b17_0": "如菩薩地盡滿足方便一念相應覺心初起心無初相以遠離微細念故得見心性心即常住名究竟覺。",
    "X45n0765_001:0452b19_0": "此覺生相也十地學窮故云盡萬行已圓故云滿足此明行滿即方便道也一念相應即無閒道無閒道以此為初故云一念此則無念之念也覺心初起者以根本無明動彼靜心令起微念故云初起知動念本寂動念都盡唯一真心故云心無初相業識動念念中最細名微細念謂生相也此相淨盡無餘故云遠離今遠離虛妄真性顯現故云見心性也今生相即盡無明風止性海湛然故云常住一心平等始本不異名究竟覺。",
    "X45n0765_001:0452c08_0": "上約位以明四相。",
    "X45n0765_001:0452c08_1": "下引經以釋心源。",
    "X45n0765_001:0452c09_0": "是故修多羅說若有眾生能觀無念者則為向佛智故。",
    "X45n0765_001:0452c11_0": "引證謂在因地時雖未離念能觀無念道理說此能觀為向佛智佛智無念此舉因望果說也。",
    "X45n0765_001:0452c13_0": "又心起者無有初相可知而言知初相者即謂無念。",
    "X45n0765_001:0452c14_0": "牒上覺心初起之言非謂覺時知有初相故也問既無初相何故說言知初相耶故為此答也覺心之時知初動念即本來靜故云即無念也。",
    "X45n0765_001:0452c17_0": "是故一切眾生不名為覺以從本來念念相續未曾離念故說無始無明。",
    "X45n0765_001:0452c19_0": "以前無念名覺即顯有念不得名覺也以從下顯不覺所以即金剛已還一切眾生未離無始無明之念故不得名覺無始無明結成不覺義也無有染法始於無明故云無始。",
    "X45n0765_001:0453a03_0": "若得無念者則知心相生住異滅以無念等故。",
    "X45n0765_001:0453a04_0": "若至心源得於無念則徧知一切眾生一心動轉四相差別以無念等者釋成上義以四相念中各即無念故云以無念等也是故得無念者徧知四相諸念也。",
    "X45n0765_001:0453a08_0": "而實無有始覺之異以四相俱時而有皆無自立本來平等同一覺故。",
    "X45n0765_001:0453a10_0": "此明始不異本也此雖始得無念之覺然其所覺四相本來無起待何不覺而有始覺之異以四下釋成上義也以彼四相本一淨心無有前後離淨心外無別自體無自體故本來平等同一本覺然未至此位隨其智力前後而覺未稱法故不得同本今既四相俱時平等覺知皆無自體同一本覺是故則無始覺之異。",
    "X45n0765_001:0453a17_0": "上明始覺義竟。",
    "X45n0765_001:0453a17_1": "下明本覺義有二。",
    "X45n0765_001:0453a17_2": "初明隨緣本覺。",
    "X45n0765_001:0453a18_3": "二明性淨本覺。",
    "X45n0765_001:0453a18_4": "且初。",
    "X45n0765_001:0453a19_0": "復次本覺隨染分別生二種相與彼本覺不相捨離。",
    "X45n0765_001:0453a20_0": "此明本覺中隨染義也此二既在隨染門中故云生也生已不離不動覺體故。",
    "X45n0765_001:0453b02_0": "云何為二一者智淨相二者不思議業相。",
    "X45n0765_001:0453b03_0": "此標舉二相也一明本覺隨染還淨之相二明還淨本覺業用之相此之二相謂離染緣則不得成故云隨染。",
    "X45n0765_001:0453b06_0": "初明智淨相。",
    "X45n0765_001:0453b07_0": "智淨相者謂依法力熏習如實修行滿足方便故破和合識相滅相續心相顯現法身智淳淨故。",
    "X45n0765_001:0453b09_0": "此明智淨相也真如內熏之力及所流教法外緣熏力此在地前依此熏力修習資糧加行善根也如實者登地已上行契真如滿足者十地行終此在金剛因位極也此明因也由滿足方便能破和合識內生滅之相顯不生滅之性此根本無明盡故心無所合即顯本覺義此明果也即於此時能滅染心之中業相等相續之相不滅相續心體故令隨染本覺之心遂即還源成淳淨圓智成於報身始覺義也然此始覺無別始起即是本覺隨染作也今染緣既息始還同本故云淳淨淳淨智即智德餘皆斷德也。",
    "X45n0765_001:0453b20_0": "此義云何。",
    "X45n0765_001:0453c01_0": "此疑問意云如所說動彼淨心成於起滅今既盡生滅應滅淨心。",
    "X45n0765_001:0453c03_0": "以一切心識之相皆是無明無明之相不離覺性非可壞非不可壞。",
    "X45n0765_001:0453c05_0": "此答意也謂業等染心名諸識相此等皆是不覺之相非約心體轉難云既言識相皆是無明故說滅者皆應別有體性離於真如此真妄別體難也答云如此諸識不覺之相不離本覺之性非一非異以非異故非可壞以非一故非不可壞以非可壞故無明即明涅槃云明與無明其性無二無二之性即是實性以非不可壞故無明可滅覺性不壞以惑體即真全覺之不覺故。",
    "X45n0765_001:0453c13_0": "如大海水因風波動水相風相不相捨離而水非動性若風止滅動相則滅濕性不壞故如是眾生自性清淨心因無明風動心與無明俱無形相不相捨離而心非動性若無明滅相續則滅智性不壞故。",
    "X45n0765_001:0453c17_0": "此以喻釋可壞不可壞義也以濕全動故無於水相以動全濕故無於風相心法亦爾真心隨熏全作識浪故無心相然彼識浪本即是真故無無明相。",
    "X45n0765_001:0454a01_0": "上釋智淨相。",
    "X45n0765_001:0454a01_1": "下釋不思議業相。",
    "X45n0765_001:0454a02_0": "不思議業相者以依智淨相能作一切勝妙境界。",
    "X45n0765_001:0454a03_0": "此依體總標也謂與眾生作六根境界故寶性論云諸佛如來身如虛空無相為諸勝智者作六根境界示現微妙色出於妙音聲令齅佛戒香與佛妙法味使覺三昧觸令知深妙法故名妙境界。",
    "X45n0765_001:0454a07_0": "所謂無量功德之相常無斷絕隨眾生根自然相應種種而現得利益故。",
    "X45n0765_001:0454a09_0": "此約用別辨也無量者橫顯常者竪顯自然者無功應機得益者利潤不虛報化二身真如大用無始無終相續不絕故以始本不二故無始無終常化眾生是真如之用故云不思議業也隨眾生根者以本覺與眾生心本來無二但不覺隨流用即不現妄心厭求用則於彼心中穪根顯現而不作意我現差別故云隨根自然相應雖不作意現無不益。",
    "X45n0765_001:0454a17_0": "上明隨染本覺已竟。",
    "X45n0765_001:0454a17_1": "下明性淨本覺。",
    "X45n0765_001:0454a18_0": "復次覺體相者有四種大義與虛空等猶如淨鏡。",
    "X45n0765_001:0454a19_0": "此標性淨覺體也以再標前本覺故云復次覺相有四種義一一皆徧法界故云大若單舉空喻則不顯四義若單舉鏡喻則不顯周徧遂舉二喻互相顯發然此雙標而單釋者以空隨鏡顯也。",
    "X45n0765_001:0454b03_0": "云何為四。",
    "X45n0765_001:0454b04_0": "四中初二體後二相故云覺體相也。",
    "X45n0765_001:0454b05_0": "一者如實空鏡遠離一切心鏡界相無法可現非覺照義故。",
    "X45n0765_001:0454b07_0": "初顯空義也以真如體中妄法本無故云如實空遠離二句正顯空義無法一句重辨所空倒心妄境元與覺體本不相應非謂有而不現但以妄法理無故無可現如鏡非不能現但以兔角無故無可現也非覺照義者如鏡於兔角無照燭之功此約徧計理無下約依他說故能現世閒境界。",
    "X45n0765_001:0454b13_0": "二者因熏習鏡謂如實不空一切世間境界悉於中現不出不入不失不壞常住一心以一切法即真實性故又一切染法所不能染智體不動具足無漏熏眾生故。",
    "X45n0765_001:0454b17_0": "二顯不空義也因有二義一能作現法之因二能作內熏之因亦可初是因義後是熏習義故云因熏習也如實不空者總出因熏習法體謂有自體及性功德故下別釋二因初因云世境悉現者明一切法離此心外無別體性猶如鏡中能現影也不出者明心待熏故變現諸法非不待熏而自出也不入者離心無別能熏故不從外入不失者雖復不從內出外入緣起之法顯現不無不壞者謂諸法緣集起無所從不異真如故不可壞如鏡中影非刃能傷以同鏡故常住一心者會相同體一切法即真實性者釋成同體所由以於心中顯現無出入等故即無體性無體性故本來平等不異真如故云常住一心後因云染法不染者以性淨故雖現染法非染所污良由現染反顯淨也以雖現染不為所染故云不動具足無漏者此本覺中恒沙性德無所少也又與眾生作內熏之因令厭生死苦樂求涅槃故勝鬘經云由有如來藏內厭生死苦樂求涅槃也。",
    "X45n0765_001:0454c15_0": "三者法出離鏡謂不空法出煩悻礙智礙離和合相淳淨明故。",
    "X45n0765_001:0454c17_0": "三明離障出纏義也謂真如之法出於二障離於和合故云出離前在纏性淨不空如來藏今明不空出纏離垢法身如宝性論云有二淨一自性淨以同相故二離垢淨以勝相故不空法者出法體也染心名煩惱礙無明名智礙智礙既出業識等以心無所合故云離也離和合雜相故淳無惑染故淨出無明故明。",
    "X45n0765_001:0455a04_0": "四者緣熏習鏡謂依法出離故徧照眾生之心令修善根隨念示現故。",
    "X45n0765_001:0455a06_0": "四明外緣義即彼本覺出障之時隨照物機示現萬化與彼眾生作外緣熏力故云依法乃至示現故問前隨染中智淨與此法出離何別前業用與此緣熏何別答前約隨染故還淨說為智即明彼智用俱就始覺說此約自性故離障顯法體即明此法用俱就法體說是故前云智此云法前云業此云緣也然法智體一始本不二但今就義開故不同耳。",
    "X45n0765_001:0455a14_0": "上釋生滅門中覺義已竟。",
    "X45n0765_001:0455a14_1": "此下釋不覺義。",
    "X45n0765_001:0455a15_0": "此中有根本不覺枝末不覺。",
    "X45n0765_001:0455a15_1": "且初。",
    "X45n0765_001:0455a16_0": "所言不覺義者謂不如實知真如法一故。",
    "X45n0765_001:0455a17_0": "此釋根本不覺中初依覺成迷也不了如理一味故如迷正方。",
    "X45n0765_001:0455a19_0": "不覺心起而有其念。",
    "X45n0765_001:0455a20_0": "業等相念即邪方也。",
    "X45n0765_001:0455b01_0": "念無自相不離本覺。",
    "X45n0765_001:0455b02_0": "邪無別體不離正方。",
    "X45n0765_001:0455b03_0": "猶如迷人依方故迷若離於方則無有迷眾生亦爾依覺故迷若離覺性則無不覺。",
    "X45n0765_001:0455b05_0": "喻合可知。",
    "X45n0765_001:0455b06_0": "以有不覺妄。",
    "X45n0765_001:0455b06_1": "心故能知名義為說真覺若離不覺之心則無真覺自相可說。",
    "X45n0765_001:0455b08_0": "此明依迷顯覺也良以依真之妄方能顯真隨妄之真還待妄顯既待他有則自相不成自相既無他亦不立以顯染淨無有自相皆不可得也。",
    "X45n0765_001:0455b11_0": "上明根本不覺竟。",
    "X45n0765_001:0455b11_1": "下明枝末不覺有二。",
    "X45n0765_001:0455b11_2": "初無明不覺生三細。",
    "X45n0765_001:0455b12_3": "二境界為緣生六麤。",
    "X45n0765_001:0455b12_4": "且初。",
    "X45n0765_001:0455b13_0": "復次依不覺故生三種相與彼不覺相應不離。",
    "X45n0765_001:0455b14_0": "此標無明為因生三細也相不離體故末不離本故依無明起妄心依妄心起無明故。",
    "X45n0765_001:0455b16_0": "云何為三一者無明業相以依不覺故心動說名為業覺即不動動即有苦果不離因故。",
    "X45n0765_001:0455b18_0": "此標釋無明業相也以揀本覺隨染不思議業相故曰無明業相顯覺不覺皆有業相而真妄不同此中業有二義一動作是業即此心動是也不動者反舉釋成既得始覺時即無動念是知今動只是不覺二為因是業義此既招苦即為因也始得寂靜無念之時即是涅槃妙樂故知今動則有生死苦患動因苦果既無別時故云不離也此雖動念而極微細緣起一相能所不分即當黎耶自體分也無相論云此識何相何境界答相及境界不可分別一體無異當知此約賴耶業相義說也下約本識見相二分為一。",
    "X45n0765_001:0455c09_0": "二者能見相以依動故能見不動則無見。",
    "X45n0765_001:0455c10_0": "此標釋轉相也以依下謂依前業識轉成能見不動下謂若依性淨門則無能見也反顯能見必依動義如是轉相雖有能緣以境界微細故猶未辨之。",
    "X45n0765_001:0455c14_0": "三者境界相以依能見故境界妄現離見則無境界。",
    "X45n0765_001:0455c15_0": "此標釋現相也依前轉相能現境界離見下反釋三細屬賴耶六麤屬意識不顯末那者楞伽不說末那經云真識現識分別事識現識即三細中現相分別事識即是下六麤又六麤智相相續相乃麤中之細七識已含此中以義不便故不別說也古疏辨此有多義此不繁錄。",
    "X45n0765_001:0456a01_0": "上無明為因生三細。",
    "X45n0765_001:0456a01_1": "下境界為緣生六麤。",
    "X45n0765_001:0456a02_0": "以有境界緣故復生六種相云何為六。",
    "X45n0765_001:0456a03_0": "此標徵也。",
    "X45n0765_001:0456a04_0": "一者智相依於境界心起分別愛與不愛故。",
    "X45n0765_001:0456a05_0": "此釋六中起計也於前現識所現相上不了自心所現創起惠數分別染淨執起定性。",
    "X45n0765_001:0456a07_0": "二者相續相依於智故生其苦樂覺心起念相應不斷故。",
    "X45n0765_001:0456a09_0": "此釋生受也謂依前分別愛境起樂受覺不愛境起苦受覺數數起念相續現前此明自相續也又能起惑潤業引持生死即令他相續也故下文云住持苦樂等。",
    "X45n0765_001:0456a13_0": "三者執取相依於相續緣念境界住持苦樂心起著故。",
    "X45n0765_001:0456a15_0": "此釋取著也心起著者是此執取相也謂於前苦樂等境不了虛無深起取著故下文云即此相續識依諸凡夫執取著轉深計我我所也。",
    "X45n0765_001:0456a18_0": "四者計名字相依於妄執分別假名言相故。",
    "X45n0765_001:0456a19_0": "此釋計名也依前顛倒所執相上更立假名是分別故楞伽經云相名常相隨而生諸妄想故云依於妄執等。",
    "X45n0765_001:0456b02_0": "上起惑。",
    "X45n0765_001:0456b02_1": "下造業受報。",
    "X45n0765_001:0456b03_0": "五者起業相依於名字尋名取著造種種業故。",
    "X45n0765_001:0456b04_0": "此釋造業也謂執相計名依此麤惑發動身口造一切業即苦因也。",
    "X45n0765_001:0456b06_0": "六者業繫苦相以依業受果不自在故。",
    "X45n0765_001:0456b07_0": "此釋受報也業因已成招果必然循環諸道生死長縛。",
    "X45n0765_001:0456b09_0": "當知無明能生一切染法以一切染法皆是不覺相故。",
    "X45n0765_001:0456b11_0": "此結歸也三細六麤總攝一切染法皆因根本無明不了真如而起問染法多種差別不同如何根本唯一無明答染法雖多皆是無明之差別相故不異不覺也。",
    "X45n0765_001:0456b15_0": "復次覺與不覺有二種相云何為二一者同相二者異相。",
    "X45n0765_001:0456b17_0": "此雙辨同異也要明真妄不即不離之旨故此辨之。",
    "X45n0765_001:0456b19_0": "言同相者譬如種種瓦器皆同微塵性相如是無漏無明種種業幻皆同真如性相故。",
    "X45n0765_001:0456c01_0": "此辨同相也染淨二法同以真如為性真如以此二法為相瓦器喻染淨二法器以塵為性塵以器為相無漏者本始二覺無明者本末二不覺此二皆有業用顯現而非實有故云幻以動真如門作生滅門中染淨二法更無別體故云性也真如亦以此二法為相淨相可知其染相者下文云但以無明而熏習故即有染相。",
    "X45n0765_001:0456c08_0": "是故修多羅中依於此義故說一切眾生本來常住入於涅槃菩提之法非可修相非可作相畢竟無得亦無色相可見而有見色相者唯是隨染業幻所作非是智色不空之性以智相無可見故。",
    "X45n0765_001:0456c12_0": "此釋同相義也此有二義一依此同相門如上本末二不覺本來即真如故說一切眾生自性涅槃不更滅度故淨名經云一切眾生即涅槃相不復更滅二依此同相門如上始本二覺即真如故諸佛菩提非修等也又前義約不覺即如故眾生舊來入涅槃次約覺智即真故諸佛菩提無新得也疑云若眾生已入涅槃更無新滅者即己同諸佛何故不能顯報化等色身釋云法性自體本無色相可見如何更現色等耶又疑云若以法性非是色相可見法故不現色者諸佛何故現報化等種種色耶釋云彼見諸佛種種色等者並是隨眾生染幻心中變異顯現屬後異相門非是同相門中本覺不空以恒沙德中亦無此色故也問何以得知彼法體中無色相耶答云以本覺智非是可見之法故也。",
    "X45n0765_001:0457a07_0": "言異相者如種種瓦器各各不同如是無漏無明隨染幻差別性染幻差別故。",
    "X45n0765_001:0457a09_0": "此釋異相義也以彼無明迷平等理是故其性自是差別故下文云如是無明自性差別故也諸無漏法順平等性直論其性則無差別但隨染法差別相故說無漏法有差別耳如下文中對業識等差別染法故說本覺恒沙性德又由對治彼染法差別故成始覺萬德差別也如是染淨皆是真如隨緣顯現似有而無體故通名幻也上所說同異之義即是真如生滅二門不相離義約生滅門即同而異約真如門即異而同苟得一心二門之旨即無惑於此。",
    "X45n0765_001:0457a19_0": "已前釋生滅心竟。",
    "X45n0765_001:0457a19_1": "下釋生滅因緣有二。",
    "X45n0765_001:0457a19_2": "初明生滅因緣。",
    "X45n0765_001:0457a20_3": "二重顯所依緣體。",
    "X45n0765_001:0457a20_4": "且初。",
    "X45n0765_001:0457b01_0": "復次生滅因緣者所謂眾生依心意意識轉故。",
    "X45n0765_001:0457b02_0": "此下釋生滅之因緣也黎耶心體不守自性是生滅因根本無明熏動心體是生滅緣此能生三細之因緣也又無明住地諸染根本是生滅因外妄境界動起識浪是生滅緣此能生六麤之因緣也然此兩重但有三法謂真如唯因境界局緣無明則望真為緣望境為因諸識生滅相集而生故名眾生而無別體唯依心體故言依心即是黎耶自相心也能依眾生即是心意意識依心體起故云轉轉者起也。",
    "X45n0765_001:0457b11_0": "此義云何。",
    "X45n0765_001:0457b12_0": "此徵心作眾生義云何。",
    "X45n0765_001:0457b13_0": "以依阿黎耶識說有無明。",
    "X45n0765_001:0457b14_0": "此釋所依心也黎耶者是上所說心即是生滅之因無明者於黎耶二義中此是不覺義即生滅之緣欲明依此因緣意意識轉故故言以依等也上總中略指其因故但言依心此別釋中具顯因緣故說依心及無明也問上說依覺有不覺由此不覺力故動彼心體令起滅和合方有黎耶業相等識何故此中說依黎耶有無明乎答此有三釋一由此黎耶有二種義故謂由無明動彼真心成此黎耶又即此黎耶還却與彼無明為依以不相離故二云依黎耶有二義謂覺不覺前別就本說故云依覺有不覺今就都位論故云依黎耶有無明也此即二義中不覺之義正在黎耶中故說依也三云此中正意唯取真心隨緣之義此隨緣義難名目故或就未起說依真如有無明或約成就起已說依黎耶有無明。",
    "X45n0765_001:0457c09_0": "不覺而起能見能現能取境界起念相續故說為意。",
    "X45n0765_001:0457c10_0": "此釋意轉也所依心體由無明熏舉體而動即是業識也前依黎耶有無明即依似起迷今熏淨心成黎耶即依迷起似此二義一時說有前後耳即彼心體轉成能見是轉識也即彼心體復成能現是現識也能取現識所現境界是為智識前以取境起諸麤念是相續識依此五義次第轉成依止依止此義而生意識等故說為意攝論云意以能生依止為義。",
    "X45n0765_001:0457c18_0": "此意復有五種名云何為五一者名為業識謂無明力不覺心動故。",
    "X45n0765_001:0457c20_0": "此下釋五意中業相也根本無明即所依緣也明心不自起起必由緣正明起相釋成業義起動是業義故。",
    "X45n0765_001:0458a03_0": "二者名為轉識依於動心能見相故。",
    "X45n0765_001:0458a04_0": "此釋轉識見相也依前業識之動轉成能見之相轉識有二若就無明所動轉成能見者在本識中若其境界所動轉成能見者在事識中此中轉相約初義也。",
    "X45n0765_001:0458a08_0": "三者名為現識所謂能現一切境界猶如明鏡現於色像現識亦爾隨其五塵對至即現無有前後以一切時任運而起常在前故。",
    "X45n0765_001:0458a11_0": "此釋現識當現相也依前轉識之見起此能現之功故云現境界以其心體與無明合熏習力故現於種種無邊境界故也非如六七識有時斷滅故云常在前又為諸法本故明此識在諸法之先以是諸法所依故揀異末那識。",
    "X45n0765_001:0458a16_0": "四者名為智識謂分別染淨法故。",
    "X45n0765_001:0458a17_0": "此釋六麤中智相也此即事識內細分謂不了前心所現境故起染淨微細分別故云智識。",
    "X45n0765_001:0458a19_0": "五者名為相續識以念相應不斷故住持過去無量世等善惡之業令不失故復能成熟現在未來苦樂等報無差違故能令現在已經之事忽然而念未來之事不覺妄慮。",
    "X45n0765_001:0458b03_0": "此釋六麤中相續相也此亦事識中細分以法執相應得長相續此約自體不斷釋相續義從住持下總辨前五意功能初住持業果是前三細功能屬黎耶後念已未之境是後二功能屬事識細分。",
    "X45n0765_001:0458b07_0": "是故三界虛偽唯心所作離心則無六塵境界。",
    "X45n0765_001:0458b08_0": "此結歸一心也以一心隨無明動作五種識故故說三界唯心轉也此心隨熏現似曰虛隱其虛體詐現實狀曰偽虛偽之狀雖有種種然窮其因緣唯心所作離彼現識則無境界反驗六塵唯是一心。",
    "X45n0765_001:0458b13_0": "下釋疑廣辨。",
    "X45n0765_001:0458b14_0": "此義云何。",
    "X45n0765_001:0458b15_0": "此疑現有塵境云何唯心。",
    "X45n0765_001:0458b16_0": "以一切法皆從心起妄念而生一切分別即分別自心心不見心無相可得。",
    "X45n0765_001:0458b18_0": "此釋疑也以一切法皆是此心隨熏而起更無異體故說唯心疑云何以此心作諸法耶釋云由妄念熏故生起諸法疑云是法既無云何分別釋云一切分別即分別自心又云若如是者即應見心故釋云心不見心反明分別悉皆是妄又云如何心不見心釋云無相可得斯則能所俱寂唯一心在經云諸幻滅盡覺心不動。",
    "X45n0765_001:0458c05_0": "當知世間一切境界皆依眾生無明妄心而得住持。",
    "X45n0765_001:0458c06_0": "此結相屬心也無明根本也妄心業識也以一切境界由此而成即現識等也若無明未盡已還此識住持境界不息。",
    "X45n0765_001:0458c09_0": "是故一切法如鏡中像無體可得唯心虛妄心生則種種法生心滅則種種法滅故。",
    "X45n0765_001:0458c11_0": "此喻顯屬心也法屬心者以無體故謂此境離心之外無體又即心故無體如像離鏡之外無形鏡內復無其體疑云既無其體何以宛然顯現釋云此並真心之上虛妄顯現何處有體而可得耶又問何以得知心上顯現答云以心生法生等故知也此中以無明力不覺心動乃至能現一切境界等故言心生種種法生此則心隨熏動故云生也若無明滅境界隨滅諸識分別皆滅無餘故言心滅則種種法滅此則心源還淨故云滅也問上說生滅過屬無明此辨因緣如何結屬心也答前以無明動彼靜心令心生滅故此生滅功在無明今此因緣和合道理成辨諸法無性義顯不住義彰故結和合屬於心也。",
    "X45n0765_001:0459a04_0": "上釋意轉。",
    "X45n0765_001:0459a04_1": "下釋意識轉。",
    "X45n0765_001:0459a05_0": "復次言意識者即此相續識依諸凡夫取著轉深。",
    "X45n0765_001:0459a06_0": "此下釋意識轉也此生起識麤細雖殊同是一識更無別體故即指前第五識也但前就細分法執分別相應依止義門則說為意此中約其能起見愛麤惑相應從前起門說名為意識謂意之識故名意識今約凡夫顯其麤也取著者以無對治追著妄境故云深也。",
    "X45n0765_001:0459a12_0": "計我我所種種妄執。",
    "X45n0765_001:0459a13_0": "此出其惑體正釋取著之相也非但心外計境為塵亦復於身計我於塵計所妄執者顯計我之相也或執即蘊或執離蘊如是眾多故云種種。",
    "X45n0765_001:0459a16_0": "隨事攀緣分別六塵。",
    "X45n0765_001:0459a17_0": "此明執所依也但緣於倒境之事不了正理故名隨事等。",
    "X45n0765_001:0459a19_0": "名為意識亦名分離識又復說名分別事識。",
    "X45n0765_001:0459a20_0": "此制立其名也此論就一意識義分出五識故說意識分別六塵分離者依於六根別別取六塵故分別事識者又能分別去來內外種種事相故。",
    "X45n0765_001:0459b03_0": "此識依見愛煩惱增長義故。",
    "X45n0765_001:0459b04_0": "此明識起所依也見謂見一切處住地即見道惑愛謂欲色有三愛即修道惑以此見修二惑熏於本識令生此分別事識上六麤中執取計名及起業相並相從入此意識中及後六染中執相應染亦入此攝。",
    "X45n0765_001:0459b09_0": "上釋生滅因緣已竟。",
    "X45n0765_001:0459b11_0": "大乘起信論疏略卷上"
}