{
    "X45n0759_001:0255b05_0": "大乘起信論同異略集本",
    "X45n0759_001:0255b06_0": "(全述起信唯識二論同異耳)",
    "X45n0759_001:0255b08_0": "青丘沙門見登之補",
    "X45n0759_001:0255b09_0": "夫龍出於河則八卦宣其象麟傷於澤則十翼彰其用時歷三古業資九土況乎如來圓音振於十方百八之廣詰泯一心之圖菩薩妙智照於五印十五之幽致開二門之城於茲真主天慧寫貝葉於竹素魏象丘龍著注記於券疏續傳有准奚裁頑襟余幸生東隅僅遇遺法本論十一投於鐘山僧統年次十七纔預出塵之真自爾以來恭事資習寄志此論祈通誓達象觸之迷彌篤野馬之情增鬱葢此一生強不植操觚之因何世幸見傳燈之聖聊卛愚靈略集古迹為備私志不好流通庶幾同趣之賢埀以改作付之燕石傳之夜光云爾。",
    "X45n0759_001:0255b20_0": "將集二論同異略述八門一建立真理同異門二建立真智同異門三建立八識同異門四建立唯識同異門五建立熏習同異門六建立三身同異門七建立執障同異門八建立位行同異門。",
    "X45n0759_001:0255b24_0-0": "第一建立真理同異門者唯識論中但明二空所顯真如是凝然常雖為諸法之性而非隨緣變然則唯明不變真如未說隨緣真如故不許真如為所熏亦為能熏論能所熏各四義中委簡之矣若廢詮談旨亦一味平等非有非無然非如兔角無亦非如牛角有但諸名言不及說為非有非無耳若許真性空者俗諦亦無真俗竝無是名惡取空故護法論師與清辨菩薩深諍論矣故掌珍云真性有為空如幻緣生故無為無有實不起似空華唯識論云有依似比量撥無此識及諸法等大乘基云其空比量有有法一分不極成過故名似比量唯識燈云真性之中既無言說取何有為以為有法故名有法不極成案云四重二諦中第四廢詮談旨之真名為真性既有為無為一味平等非有非無名第四真然而如何真性之中更言有為耶我不許此故若一分不極成此則所別差別他一分不極成過耳餘諸過失具如別處故護法論師非有非無之有名為真如清辨菩薩非有非無之空名為真性今此起信論中諸法之總體諸法之中實無障礙之道名一心法界是一心法界非靜非動非理非事以非靜故舉體動是名心生滅門以非動故舉體寂靜是名心真如門是故論云依一心法有二種門一心真如門二心生滅門此二種門各攝一切法等案云此則心真如門一味通體名不變真如此是同於唯識所說矣心生滅門自體本覺是名隨緣真如是則異於唯識論宗矣所以起信論中許真如為所熏亦為能熏熏習同異門中委引文明矣又其心真如門中亦有異義絕言真如同於廢詮談旨之真依言真如之中亦有二義一如實空二如實不空真如案云真如之中無染淨之差別故名如實空雖無染淨之差別而具恒沙性德故名如實不空然如實不空不異實空之如實不空故護法論師說非有非無之有為真如理亦得意矣以如實空不異不空之如實空故清辨菩薩說非有非無之無以為真性亦得意耳如塔上細下闊以諍論耳以不知真如真實空之義故說其真如以為實有亦以不知真如真實不空之義故亦說真如為畢竟空所以論下文破二執中委破此迷故彼云二者聞修多羅說世間諸法畢竟體空乃至涅槃真如之法亦畢竟空從本來自空離一切相以不知為破著故即謂真如涅槃之性唯是其空如何對治明真如法身自體不空具足無量性功德故三者聞修多羅說如來之藏無有增減體備一切功德之法以不解故即謂如來之藏有色心法自相差別云何對治以唯依真如義說故因生滅染義示現說差別故案云總而論之其真如理有二種義所謂遮與表義也然遮即表故說真如之理具性功德是即不有之有是為如實不空之義護法之宗且寄此義矣表即遮故說真如之性無差別德是即即有之空是為如實空之義清辨之宗且寄此義矣由此二論師言雖似諍論而意非諍論各互相破以成真如二義耳故大佛頂首楞嚴經第五頌云。",
    "X45n0759_001:0256b03_0-0": "　真性有為空　　緣生故如幻　　無為無有實　不起如空華案云掌珍比量是如來說也豈護法菩薩不知此經文為諍論哉故馬鳴之宗破此二執會以為宗也由斯等義華嚴香象和此諍論故其三性同異章云問若由依他有二義故前代諸論師各述一義融攝依他不相違者何故后代諸論師如清辨等各執一義互相破耶答此乃相成非相破也何者為末代有情根機漸鈍聞說依他是其有義不違彼是不異空之有故即執以為如謂之有是故清辨等破依他有令至於無至畢竟無方乃得彼依他之有若不至此徹底性空即不得成依他之有是故為成有故破於有也又彼有情聞說依他畢竟性空不達彼是不異有之空故即執以為如謂之空是故護法等破彼謂空以存幻有幻有立故方乃得彼不異有之空以若有滅非真空故是為成空故破於空也以色即是空清辨義立空即是色護法義存二義鎔融舉體全攝若無后代論師以二理交徹全體相奪無得得顯甚深緣起依他性法是故相破返相成也案云此且約依他性述其和會就其真如空不空義亦復如是故即下文云真如是有義以不空義故真如是空義以離相故等廣說矣故說真如理雖異於二宗而全不遮是起信論宗矣問不變真如與隨緣真如云何異耶答不變真如者一心舉體寂靜一味遠離名言染淨情非情之通體是也言隨緣真如者一心舉體隨無明緣生滅流轉變為有情之自體是也故經云即此法界流轉五道名為眾生又有經偈言無明力最大能動一法界遍生二生死此論云自性清淨心因無明風動等然是隨緣之真如不異不變之無常故名不思議無常不變之常亦復如是故經云不思議熏不思議變是現識因等此中委曲應說真如佛性如來藏法身等名差別義委如別處恐繁且止。",
    "X45n0759_001:0256c11_0-0": "第二建立真智同異門者唯識論中至見道位轉第六識得妙觀察智轉第七識得平等性智至佛果位轉第八識得大圓鏡智轉其五識得成所作智然此四智是別體也以轉別聚八識所得故理雖應八智而五識用同故但名成所作智耳但此四智各有二用照理之用名正體智照事之用名後得智雖一時照而以義說前後護法論師云成所作智但作變化事但照俗諦事故唯有俗智而無真智雖有此說而大乘基云隨一往義雖云然而佛果之位自在滿故亦照真俗故有二智之用(云云)",
    "X45n0759_001:0256c11_0-1": "法苑唯識章出之矣問大圓鏡智照理之用若有間斷耶答其第八識有因位時常相續轉變佛果之位有間斷耶恒照真理亦照俗事念念相續無有間斷然此四智種子因雖法爾本有而其現行四智修萬行之因所感得故名始有智然無終盡證理無窮故雖有始而無終以有終是患故既法爾無漏種子及新熏種子并萬行因之所感生故是有為法故有剎那生滅但無死生之患亦無間斷故名為常住非謂無剎那生滅問若隨除大圓鏡智餘三之智亦常照理無間斷耶答餘之三智隨其意樂亦有止息若但欲照理亦得照理若唯欲照事亦唯得照事自在滿故得為然耳然戒賢論師并大乘基等一類師云四智心品雖冥合理無能所別而理是無為智是有為故理雖凝常而智剎那生滅等智光論師及吉藏師等一類師云未至佛果無明所隔故剎那生滅而既至佛果之位無明都盡冥合真理無能所別境如智智如境故如境智亦常都無剎那生滅等前師引證云如涅槃經云如來非常以有知故常法無知猶如虗空大品經云何等為有為法若法生住滅欲界色界無色界乃至十八不共法及一切智是名有為法依如此文故知非常而餘處說無為常住者以不同生死磨滅有為永離彼有為故名無為窮未來際相續不斷恒在無盡故說常住等後師引證云涅槃經云以法常故諸佛亦常楞伽經言更有餘法依彼法故得言如來世尊是常依內證智證常法故智度論云薩婆若不與過去世合何以故過去世是虗妄是生滅薩婆若是實法非生滅故未來現在亦如是說等依如此文故知佛德無為常住而餘處亦說有為無常者以始起法不同法身本有之常故作是說等今此起信論中因位之中雖有八識心王心所差別而皆是一心流轉起動故皆一味一心耳佛果之位轉此一味一心而得一味圓智則此一味圓智隨其功用別開為四即此一心離闇成明明白清淨無影不照是名大圓鏡智即此一心遠離二邊通達自他平等是名平等性智即此一心無所觀故於諸法則無不觀察是名妙觀察智即此一心無所作故於利他事無所不作是名成所作智四智既圓始覺斯滿還同本覺本覺之內具四大智持諸功德無所不成同一心量是名一大法身然此始覺圓智是一心隨他動之義還息不覺之性成圓覺之性論下文云智淨相不思議業等斯之謂也若一心自性不動之義本有大智慧光明義遍照法界義名性本覺其前隨他動之義名隨染本覺然則此之論宗就智有二義一始覺智二本覺智此則全異於唯識論矣但其始覺之智是本覺內熏之因及萬行之緣所生起故名為有為亦名生滅其本覺之智始覺熏修之力及萬行之緣所顯了故亦名無為名凝然常然本覺之智不異始覺之本覺故為生滅法之自體始覺之智不異本覺之始覺故為無生滅之相用故論云以始覺者即同本覺又云得見心性心即常住由此等義故本有之修生故佛果之智皆名生滅修生之本有故佛果之智皆為無生始本無二亦無障礙所言從因生起門者本因惑業受生死報今修萬行感得佛果果本無從因有於此門中恒有生滅從緣生故無自性故所言息緣歸原門者一心本為無明所動今除無明還歸自性自性常靜本無起動於此門中湛然常住息諸緣故歸自性故總而言之諸佛功德離性離相無障無礙由至無為故無不為耳問佛果之德既常無常無障無礙是為論宗若佛果之德有色聲差別之德以為論宗耶若許爾者即同護法論師之宗若唯說有大定智悲德無色聲之兼德是為論宗耶若許爾者即同於龍軍論師說矣答唯識正義云佛果之德有色聲之差別以轉色蘊依得色自在等故又經云一音演說法隨類各得解等故有色聲之德也龍軍論師云自受用身遠離色形法性淨立為所住處是故都無色相可得如本業經言果體圓滿無德不備理無不周居中道第一義諦清淨國土云無名無相非一切法可得非有體非無體乃至廣說唯有大定智悲都無色聲德今此起信論中遣二偏執會二義宗以為論宗何者謂如來果德無障無礙略有二門若就七相歸源之門故無色聲若依從性成德之門故亦有色聲謂一心舉體自性不動本有覺照之義是名本覺然無明所覆其用不顯今依內熏亡相歸源故其體平等無有色聲差別之德故論云一切眾生本來常住入於涅槃菩提乃至亦無色相可得等又云非是智色不空之性以智相無可見故魏香象解云非此同相門本覺智內有此色礙不空之性又可本覺不空恒沙德中亦無此色相何以得知彼法體本無色相者以本覺智相非是可見法故也集者云一心舉體自性不動而隨他動其自性不動名為性淨本覺其隨他動義名為隨染本覺此隨染本覺隨師友緣依內熏因止不覺性而成覺德此覺之德從性所成是名修生德此修生德寄緣而見之備有色聲之德若離緣而見之都無色聲之德譬如水精之珠點赤丹矣若寄赤丹而見珠體者皆舉體有赤丹色若遮赤丹而直見珠體本無赤色唯照耀清淨佛果之德亦復如是若就本覺之體佛德舉體皆無色聲望始覺之德佛果舉體皆有色聲由此義故論初頌曰色無礙自在又因緣分云圓音一演異類等解華嚴性起云如來正覺成菩提時得一切眾生身等得一切法等身乃至廣說佛子隨如來所得身當知音聲及無礙心亦復如故亦非生滅亦非非生滅遠離萬相永寂百非唯是一心名法身然則修生之本有故一類師說凝然常住亦得意矣本有之修生故一類師說剎那無常亦得意矣若互偏執無所不非得意而說無所不是此則破二迷而會二宗此論宗矣問既常與無常乖角吳越如何和會以為宗旨答此疑誠深輙以難辨然准論意無不釋然謂一心舉體寂靜平等名心真如一心舉體起動差別名心生滅既不動實際而建立諸法不壞假名而說實相不壞生滅而全體不生滅不動不生滅而舉體生滅故勝鬘經云染而不染不染而染論文亦同也一心之體既其如是一味之智豈不得然哉由此等義華嚴偈言。",
    "X45n0759_001:0258b04_0-0": "　牟尼離三世　　相好悉具足　　住於無所住　法界悉清淨　　因緣故法生　　因緣故法滅　如是觀如來　　究竟離癡惑當知如來非無常故恒離三際非常住故恒有生滅若依如是無障無礙說常與無常皆有道理故丘龍和諍論云夫佛地萬德略有二門若從因生起之門報佛功德剎那生滅初師所說且得此門若就息緣歸原之門報佛功德凝然常住後師所說亦得此門隨一一德有此二門二門相通不相違背故其動靜是如來具足如是三種清淨無量等問既就本覺之體佛果之德無色聲之相若約始覺之用有色聲之德者則體用乖角豈得和會以為論宗哉答既一心法界舉體作色亦舉體作空豈其始本德得相違乎以本不異始之本覺故本覺亦有色聲以始不異本之始覺故始覺亦無色聲以始本無二故非有色亦非無色如是無礙為佛果德耳為明此義論中問云若諸佛法身離色相者云何能現色相答曰即此法身是色體故能現於色所謂從本已來色心不二以色性即智故色體無形說名智身以智性即色故說名法身遍一切處所現之色無有分齊等然就亡相歸源之門一類師說無色聲之差別亦得意矣就從性成德之門一類師說有色聲之差別亦得意矣若互偏執無所不非若竝得意無所不是竝是之義無所不立雙非之宗無所不遣是馬鳴之宗致起信之大趣矣問佛智作境不作境者其義云何何以為論宗耶答唯識論宗云佛果四智各有二用(成事智有諍可知)",
    "X45n0759_001:0258b04_0-1": "。",
    "X45n0759_001:0258c06_0-0": "其正體智唯親證真如體無作境者也然還照自體故唯識不失其後得智必作影像照心中所現之影然而根本真如遠離愚痴故得云證真如耳但佛果位中四分相緣當可分別若緣舊者非必作影若緣新者必作影像如見分證證自證分等是為緣新如證自證分緣自證分等是為緣舊(基師云爾)測師作多釋(云云)具如唯識疏今此起信論中略有二義一云若就一切理事諸法皆一心所現之通影而論之者若理若事一切境界莫不皆佛心所作何以故法無自性唯心所現故如楞伽經云真如及實際無相及真實聖諦與涅槃我說唯心量論云依一心法有二種門一心真如門二心生滅門等又云以一切法皆從心起妄念而生一切分別即分別自心等華嚴經云心如工畫師畫種種五陰一切世間中無法而不造如心佛亦然如佛眾生然心佛及眾生是三無差別丘龍解云當知諸法佛心所作無有一法離佛心者但諸凡夫未解自作而計為外故是顛倒佛知諸法唯自心作不計為外故成無倒故論本云凡夫二乘心所見者名為應身以不知轉識現故見從外來取色分齊等問若說真如是心所作即此真如成始有法如其真如本來凝然而為識作不應道理答如心習諸相相現於心故說識作諸相之事如是心習離相離相現心故言心作離相之理理既離相故非始有何者菩薩修習唯識觀時若內若外若始終等一切諸相皆習除遣積習純熟妄想都盡絕相之理當心顯現永離能所平等平等非內非外無始無終故不可言始有法若離是心求本有理於一切德都無所得故不可言理是本有但離內外相故言無邊絕始終相故言無始是故理為心作而無始有之過(丘龍云爾)",
    "X45n0759_001:0258c06_0-1": "集者云若如唯識宗其正體智雖不作境而還證自性故唯識不失其後得智作影而緣故成准識者真如之理近正智而遠後得理有遠近不應道理又其後得智不應以真理為體但正體智以理可為自體故佛智皆作境也若諸正體智無分別故直證理體其後得智帶分別故作影而緣者如四分中自證分等帶分別故亦作影而可緣證自證分餘例亦爾若雖帶分別而直證自體分者其後得智亦帶分別而直可證自性理若謂理深事淺故自證分帶分別而直證自體後得智證理作影而緣者若爾緣俗不可作影若謂俗事是相分故作影而緣者真如是自性故亦直可證其理既齊何有作不作殊耶若就俗法皆作境緣設微釋難具如和諍論恐煩不列矣二云若就一切諸法皆是無明緣所作之差別一切種智照達諸法如鏡而照非心作境何以故心無自性眾緣所生故論本云當知無明能生一切染法以一切染法皆是不覺相故智度論云諸心心法眾緣所生離唯眾緣和合自性皆不可得當知諸心唯從緣生離眾緣外無別能作故今還說唯緣無心但諸愚夫未達此理遍計諸法皆有自性而其所計永無所有是故說言唯識無塵耳問若離眾緣外無心自性是故說言唯緣無心者彼眾緣法非從緣耶若彼諸緣亦從緣生則不可言唯緣無心答若因若果若色心等一切諸法無不從緣離唯眾緣和合一切皆不可得但為對破唯識之執故且說言唯緣無識耳若執唯緣者亦可遣耳問二義乖角以為桙楯如何和會以為論宗耶集者云一心隨緣總有二義一熏動之義謂一心舉體作真俗之法二熏生之義無明能作諸生滅之法又一心亦有二義一不變義從本以來不生不滅皆唯分別性二隨緣義從本以來生滅起動皆唯依他性若就熏動之義真俗之法皆心所作故論本云依一心法有二種門謂心真如門心生滅門等又云心生滅者依如來藏故有生滅心等又云自性清淨心因無明風動等若就熏生義一切諸法非心所成唯依無明緣所生故故論本云此二種生滅依於無明熏習而有所謂依因依緣依因者不覺義故依緣者妄作境界義故諸凡夫之人無明所隔故親不證法界之體諸佛世尊無明都盡故親證法界之體故如法照達非變作者也又就不變之義唯分別性義諸佛之智更不作境理體不動如理照達若就隨緣義唯依他性義諸佛之心皆作境緣理體動轉唯是一心然如是二門亦一種義皆不妨礙是法界法門之術故以為論宗矣(深有大味思准可知)",
    "X45n0759_001:0258c06_0-2": "問唯識論宗說佛果之智其之種子雖本有而現行智是始有也無始法爾有為無漏種子之因及十地萬行之緣所感生故名為修生亦名始有但證理無終有始而無終等(云云)故無本覺之智唯有本有之理今此起信論宗佛果之智有二種智一本覺智二始覺智依何聖教文以為龜鏡立此二智以異於唯識之宗耶答聖教繁廣略引一二一此起信論云此識有二義一覺義二不覺義所謂覺義者對始覺義故說有本覺義乃至以始覺者同本覺故等又下文云從本以來有大智慧光明義遍照法界義乃至過恒沙等性德具足等廣說矣二寶性論十種佛性中引華嚴性起云邪定聚眾生身中從本以來有如來日輪光照作未來善根因緣增長白法等三華嚴性起品云邪定聚眾生身中有如來智自然智無師智無礙智等四如來藏經云以佛眼觀眾生婬欲恚癡中有如來身有如來相儼然不動如我今無異等五法界無差別論說灰中火喻等斯等聖教爛然盈目豈無本覺之智唯有始覺之智哉更廣引經論具明斯義如香象法界無差別記并教分記所詮異義度幾更驗古迹以為明證矣。",
    "X45n0759_001:0260a02_0-0": "第三建立八識同異門者唯識論中八識心王心所皆別聚別體各從別種子生雖有四分而皆別自種生唯以別從總見相二分依自證起等唯約生滅一分義名為阿賴耶識所以知然者唯識之宗業煩惱所感之果名為異熟果亦名阿賴耶是本無今有故得佛果時皆轉捨而更起圓智所依淨識故第八既爾餘七轉識亦復如是唯阿賴耶識為真異熟餘眼等六識亦是作業有異熟無記之法唯異熟生非真異熟其第七末那唯從名言種子生不作業故無業果之義故不名異熟唯是有覆無記性耳皆七轉識以第八所變以為踈所緣以此所緣為自本質各變影像境以為自親所緣皆別聚別體互不相緣若許相緣者唯識義壞矣第八與第七各互為俱有根無不共根義以常相續轉轉一味一類故第六意識以第七識為不共根生眼等五識以眼等根為不共根生亦六轉識互為俱有根矣其第八識緣三種境謂種子五根器世間等若在欲界時緣狹小境若在色界時緣廣大境若在無色界緣無量境等第七末那唯未轉依位但緣第八見分為我我所第六意識皆緣十八界眼等五識唯綠色等五塵若約三類境分別者第八性境第七帶質第六意識兼三類境若緣現現在五境等名為性境若緣他界無為等名為獨影若緣第八見分為我我所等亦是帶質更作四句而可委釋如下唯識門今起信論中八識心王心所等雖似各別而一心流轉謂依無明之緣動一心之海令起八識之浪浪寂名水水皷為浪水浪似異而浪水無別八識亦爾隨能似異耳與一心無別所變之境亦雖本質影像各似異而一心圓鏡所現之影耳由此義故香象十門唯識章云其七轉識皆是本識差別功能無別體故楞伽云譬如巨海無有若干相諸識心如是異亦不可得解云既離水無有別浪明離本識無別六七然則此論之宗就生滅不生滅和合而不一異義名阿棃耶動本靜而令流轉是名八識故論云心生滅者依如來藏故有生滅心所謂不生不滅與生滅和合非一非異名為阿棃耶識密嚴經云佛說如來藏以為阿棃耶惡慧不能知藏即阿賴耶識又云如來清淨藏世間阿賴耶如金作指環展轉無差別等問如何不生不滅與生滅和合名為生滅心等耶答依根本無明之力熏一法界之心初令微動是名業識更以無明熏業識心轉令向能見是名轉識又以無明熏轉識心令現境界名為現識此三種識名細生滅在第八位故論云復次依不覺故生三種相與彼不覺相應不離云何為三一者無明業相以依不覺故心動說名為業覺則不動動則有苦果不離因故二能見相以依動故能見不動則無見三者境界相以依能見故境界妄現離見則無境界丘龍釋云此初業相雖有動念而是極細能所未分其本無明當知亦爾如無想論云問此識何相何境答相及境不可分別以體無異等第二轉相雖有能緣而未顯所緣境相直是外向非託境故如攝論云意識緣三世及非三世境是則可知此識所緣境不可知故是約轉相顯本識也第三現相依前轉相能現境界如四卷",
    "X45n0759_001:0260a02_0-1": "楞伽云大慧略說有三種識廣說有八相何等為三謂真識現識分別事識譬如明鏡持諸色像現識所現亦復如是等如是等文約於現相以顯本識等次復無明力與境界緣和合熏現識心令起七識中六種麤相故論云以有境界緣故須生六種相云何為六一者智相二相續相三執取相四計名字相五起業相六業繫苦相楞伽經云境界風所動七識波浪轉又丘龍解云初之一相是第七識次四相者在生起識後一相者彼所生果也初智相者是第七識麤中之始始有慧數分別我塵故名智相既經云境界風所動七識波浪轉又論云依於境界心起分別愛與不愛故故第七識緣於本識計以為我緣所現境計為我所而今此論中就其麤相故說依於境界心起等也又其境界不離現識猶如影像不離鏡面此第七識直爾內向計我我所而不計心外有塵故顯揚等論說還緣彼識耳故對但緣本識見分不緣色塵者立比量云此第七能依意識生時必與應同境不共所依故如眼等此比量有法中云意識生時者簡不定過等若無心睡眠等位雖有第七而意識不生名彼同分根故取意識生位以簡不生位故無不定過又有法中置必與字者簡一分相符過謂必取不同緣之時以為量宗設使不取同緣之時者也如因明作法中責取他可勝用若不加勝字者有一分相符過外許劣用故故加勝字而簡一分相符過必與之字亦復如是思准可知有人作法差別相違等者有自教相違等過故是過類耳又有人亦作聖教相違等過者亦違楞伽顯揚等論今此比量之中不用護法之文更違何教以為過哉(此意根量作法丘龍和上處處異出今依基師二障章作如是立耳合喻如常知之)",
    "X45n0759_001:0260a02_0-2": "問能依意識緣意根時豈有同緣耶答所依意根亦對自體以有自證分故無過更引對法論十種分別中第二顯現分別者謂六識身及意文以證通緣也具如本起信論記恐繁不集餘五種相等委如本二疏然則此起信論宗所依如來藏不生不滅心與能依生滅心和合非一非異名為八識其唯識宗能依生滅心中取第三現識以為阿賴耶智相識等為七轉識未顯不生滅心若說不生滅心者真如之理亦可許所熏既所熏四義中簡別常法不受熏習何為同哉今此起信論許真如熏習義如下熏習門問何以定知唯識論中取第三現識為所熏識耶答起信論文明現識云何謂能現一切境界猶如明鏡現於色像現識亦爾以一切時任運而起常在前故唯識論中明阿賴耶識云任運恒轉一切諸法皆阿賴耶識頓現一相彼此文同義亦無異故知唯識之宗取起信論所說第三現識以為阿賴耶由此香象云大乘始教中取生滅一分義以為阿賴耶大乘終教中取緣起生滅不生滅義以為阿賴耶等具如教分記第二緣起六因章並第三卷",
    "X45n0759_001:0260a02_0-3": "所詮異義中所說具足丘龍會云或有說者棃耶心即是異熟法但為業惑之所辨生是故業惑盡時本識亦盡然於佛果位亦有福慧二行所感大圓鏡智相應淨識而於二處心義是同以是義說心王至佛果耳或有說者自相心體舉體為彼無明所起而是動靜令起非謂辨無令有是故此心之動因無明起名為業相此動之心本自為心名為自相自相義門不由無明然即此無明所動之心亦有自類相生之義故無自然之過而有不滅之義無明盡時動相隨滅心隨始覺還歸本源或有說者二師所說皆有道理皆依聖典之所說故初師所說得瑜伽意後師義者得起信意當知二義皆不可說雖不可說而亦可說以雖非然而非不然故問既云雖不可說而亦可說者約可說之義二論相乖如何和會以為論宗耶答業惑所辨生之果是辨無令有是異熟果名阿賴耶是約經可思議熏因果及論境界熏亦熏生義所說矣其無明所動轉之心是動靜令起是業相識名阿賴耶者約經不思議熏因果及論無明熏亦熏動義所明矣然又不異末之本故不思議熏不異於可思議熏以末不異本之末故可思議熏不異於不思議熏故唯識論唯取業惑所感義邊以為阿賴耶未明不思議熏義以不說隨緣真如故今此起信論正取無明所動義邊以為阿梨耶兼亦取業惑所生義以具明二因果故又委說不變真如隨緣真如義故良有深味思准可知問此起信論宗說八識心王雖似各別而一心所動故無別體唯隨其功用分八識者其五十一心所亦一心所流故離於心王無別體耶若無別體者丘龍判云八識心王是從一心所來故隨其流處皆作心王其一心是為諸法宗源故其心所等是無明處來皆取塵別相隨其流處皆作心所其本無明執差別相故是非主義故然則心王雖云一心而心所是可有別體答汎論生滅不生滅法皆有非一非異義就非一之義且分心王心所別義若約不異義五十一心所皆八識心王差別功能隨能異分耳七轉識亦是本識差別功能隨能開七本識皆是如來藏真心差別功能隨能異聞耳由此義故涅槃經云一味之藥隨其流處有種種味而其真味亭留在山又香象十種唯識章云三攝數歸王故說唯識以彼心所從於心王無自體故四以末歸本故說唯識謂七轉識皆是本識差別功能無別體故五攝相歸性故說唯識謂此八識皆無自體唯是如來藏平等顯現餘相皆盡等各引證文廣明其義委本識章及十門唯識要彰裁繁以任窮達矣。",
    "X45n0759_001:0262a01_0-0": "第四建立唯識同異門者唯識論中為除遍計所執心外之境存依他識內之分明唯識理以為正義謂八識及諸心所并所變相分本影具足以第八識頓現一相為本質境以七轉識所變相分為影像之境本質之境其七識是雖同為踈所緣而影像之境則是別聚以能變七識此別體故各以自所變影為親所緣就此親所緣之境以說唯識之理非約踈所緣之境以親所緣之境各互不相緣故若許通緣者唯識雜亂矣若約八識分別唯識者就第八識有通有別別者唯約所緣以辨識然則五根所依及有漏諸種子并外器世間此三種法是異熟識所變所緣故約此法以辨唯識能緣之外無所緣故所謂通者約不相離義以說唯識然則七識及無漏種子并無為法等此三種法不離第八故亦名唯識故唯識論云無漏種子雖依附此識而非此識性攝故非所緣雖非所緣而不相離如真如性不違唯識然不得說唯塵無識識本塵末故其有漏意識見緣一切法皆現影像故名唯識其有漏五識緣五塵及末那識緣第八見分亦現影而緣故名唯識然意識末那即有二義一相分是見分所變還以見分為體故名唯識二所計外塵都無所有故名唯識但是二種識為能遍計能與二執相應計有外塵故第八及五識是不起執故不為能遍計如下建立執障門若無漏八識緣真如時親緣著本性而真如是無分別智通體故還緣自體故唯識若緣俗法時現影而緣故名唯識然大乘基師略存五重以明唯識一遣虗存實識謂遍計所執情有理無唯虗妄起都無體用故名唯識遣空其性依他圓成理有情無諸法實體故名二智境存有其性故成唯識云總顯一切有情各有八識六位心心所所變相見分位差別及彼空理所顯真如識自相故識相應故二所變故三分位故四實性故如是諸法皆不離識總立識名唯言但遮愚夫所執定離諸識實有色等二捨濫留純識雖觀事理皆不離識然此內識有境有心心起心託內境生故唯識言唯不言唯境成唯識云識唯內有境亦通外恐濫外故但言唯識三攝末歸本識心內所取境界顯然內能所心作用亦爾此見相分俱依識有離識自體本來必無故成唯識說變謂識體轉似二分相見俱依自體起故四隱劣顯勝識非但心自體能變似彼見相二現亦貪信等心所自體亦各能變似自見相現以心勝故說心似二現故但云唯心心所劣故隱而不說故莊嚴論云許心似二現如是似貪等或似於信等無別染善法等五遣相證性識識言所表具有理事事為相用遣而不取理為性體應求作證勝鬘經說自性清淨心等故如是雖遣虗存實捨濫留純攝末歸本隱劣顯勝攝相歸性說唯識而心王心所是別種生故是別體見相二分依自體起而四分依他各有自體皆別種生然相見種或同或異若同種者即一識體轉似相見二分而生如一蝸牛變生二角若別種者體轉似見轉相分種亦似相起似彼非實故立似名相別有種何名識變由心分別相方生故然此三法種基樞要判云護法正義質影見三三性種子繫未必同隨所應故故總頌曰。",
    "X45n0759_001:0262c06_0-0": "　性境不隨心　　獨影唯從見　　帶質通情本　性種等隨應釋云總攝諸境有其三類一者性境諸真法體名為性境色是真色心實是心此真實法不定隨心三性不定如實五塵唯無記性不隨能緣五識通三性故亦不隨心同於一界繫如第八識是一界繫所緣種子通三界繫身在下界起二通時緣天眼耳身在上地眼耳二識見欲界境二禪已上眼耳身識緣自地境識初禪繫境自地繫太賢集云基唯識疏出二解一云同此一云初禪三識取上色等不異界故同初禪繫(如是等類亦不通心一種所生由見相種各別體故五聚法中心心所色此等法或時有實用故必有各別法爾種子若心緣彼分明現前不待推求亦非過未純以自種相分體生不關他種名性境轉識中影雖無實用純自因生名為真實法樞要後文緣他地法無自本質然准此文從別種生識現初禪境自地繫繫不隨心此文定故彼若以他法為質彼見何緣自無質故謂生上界不起定通亦得明見下地諸色下色非自業及定通果故)",
    "X45n0759_001:0262c06_0-1": "二者獨影之境唯從見分性繫種子皆定同故知第六識緣龜毛空華石女兒無為他界所有諸境如是等類皆是隨心無別體用假境攝故名為獨影(太賢集云且龜毛等無法爾種子〔名〕有法爾應如色等或時容有生本法故無為亦爾其他界法雖有容生下染緣上〔亦〕不分明但以名字推求而盧無力〔繫〕發上種生影但以分別所立之影種無從見性繫必同非上緣上分明取故此中等取密蘊計我法漏無漏類眾多故言等也種子六義引自果者屬正生門非傍生故不相違也)",
    "X45n0759_001:0262c06_0-2": "三者帶質之境謂此影像有實本質如因中第七所變相分得從本質是無覆無記等亦從見少分是右覆所攝亦得說言從本質種生亦得說言從見分種生義不定(太賢集云非現證境推求力生故從見種說通有覆而有本質似質而生故從質種說通無有覆以得熏生本質種故問能熏之影既通二性所熏種子亦應通二既六義中種現性同所生賴耶豈通有覆答唯從質分熏種非餘從見之分如獨影故謂從見種故不熏質不似見故亦不熏見其無覆邊從本質種似本而起得熏本質未詳決云六七我執無所似故名為獨影唯染不熏第八識種不同性故非也行相雖倒有質質影都無所爾不應理故)",
    "X45n0759_001:0262c06_0-3": "性種等隨應者隨應是不定義有二隨應一義顯三境諸心聚生有唯有一有有二合有三同聚有一者如前已說有二合者如第八識緣自地散境心王所緣是初性境心所所緣是獨影境(太賢集云心所所緣是獨影者任運酬業隨識而轉麤細既等無勝助緣唯自見分似彼而生異熟五識自性麤動有勝助力謂同境根同緣意識由此擊發本識中種令生自心現行相分若種子影純從種生應成現行相不相似既似種故從心別起唯此五數唯獨影此師意也)",
    "X45n0759_001:0262c06_0-4": "五識所緣自地五塵是初性境亦得是帶質之境如第六識緣過未五蘊得是獨影亦得說是帶質之境熏成種子生本質故(太賢集云五識所緣實唯性境心託本生假名帶質雖言帶質性不交雜不待推求分明現證自種子生不從見故緣過未蘊現無本質假名獨影而從過未質種而生熏生彼類故帶質攝由分別力不名性境且如金剛心所現鏡智影無現本質名為獨影然從境智法爾種生熏自新種亦名帶質證師云由帶現在有漏〔八五〕緣未來故得熏無漏作鏡智種若無現在自類法者不熏彼種非也有漏為質熏無漏種現相違故第八識慧等心所既無種現質應不熏故意識品種所生獨影熏生第八不應理故他法為質種不相關不共內法不〔託〕熏故)",
    "X45n0759_001:0262c06_0-5": "有三合者如因第八緣定果色心心所緣唯是獨影心王所緣是實性境亦得說為帶質之境第六所變定果之色為本質故(太賢集云隨定所思金銀等影果色隨起假名帶質有說同時一種通生境果二色名為帶質不同眼識中影與質各別種生名性境故非也勿無漏定所引之果必異種生非帶質故業所生器雖他為質種不相關不名帶質定果不爾定境熏果色故)二者又性種等隨應者顯上三境隨其所應或性雖同而繫種不同如在下地緣上天眼耳或繫雖同性種不同如五識緣自界五塵或種雖同而繫不同約聚論之即有一法論之即無如第八識聚心所所緣與見同種心王所緣而繫不同(云云)",
    "X45n0759_001:0262c06_0-6": "(太賢集云以何為證有此三境照師云唯無聖教正理為量和上云瑜伽七十三說復有餘二種相先分別所生及相所生共所成相云何影像相謂遍計所起勝解所現非住本性相解云先分別生謂能緣相相所生者性境共所成者帶質也影像相者獨影也就由他種生言非住本相)則師云見相定別種生各別熏故如成唯識云謂七轉識及彼相應所變相見性界地等除佛果善極劣無記餘熏本識生自類種基師會云此論總相非委細爾又性界等無別體種但見分力自體傍用熏能緣種性界不雜也證師云緣一切無百法之體心有所無不離色等故與見分必不同體強分別心緣無法等所現相分必具四義既自熏種何從見生(太賢集云此不應理無法影若從所無色等種生非無影故若無法爾影必無力非能〔生〕故設有生影法爾何失由此熏生自類〔影像〕解云理有不盡如何羅漢緣煩惱若不從見以何種生若有自種羅漢應生染法種故佛緣生死及二乘法無彼種故唯名獨影爾時無生相分故)",
    "X45n0759_001:0262c06_0-7": "集者判云如是雖分別三類境明唯識理而不遣內相見若遣內相見者約真許俗空若許內俗者與清辨同故唯識之宗雖云唯識而存相見是為正義除依他相而歸識體者是不正義等矣今此起信論中心心所雖差別而皆是一心之流轉謂一心法界隨無明緣最初微動名為業識乃至起麤執分別名分別事識即從無明氣還生心所取塵別相是名數法故其一心功能流成心心所等法更無自體皆是一心所顯現也能緣既爾所緣亦爾本質影像雖差別而現識所現離現識而無別體故故初雖存見相明唯識義然所變相分無別自種生能見識生帶彼影起故除相分而存能緣以明唯識義矣然亦其能緣雖王數差別而數離心王而無體性是心王差別功能以許彼亦是心所變故故攝數歸王說唯識義矣然亦心王本末差別其末七轉識皆是本識差別功能無別體故故攝末歸本以明唯識義矣然亦其本識是無明所動之相是所動之相有三種相所謂業相見相現相也現相者是見相之所現見相者是業相之所現也業相者是真心所現真心之外無別體性唯是如來藏平等顯現餘相皆盡故名唯識故楞伽云不壞相有八無相亦無相又論中云如菩薩地盡滿足方便一念相應覺心初起心無初相以遠離微細念故得見心性心即常住名究竟覺等也其既盡相而窮性性隨相而流轉謂如來藏不守自性隨緣顯現八識心王心數相見種現故名唯識其所現相是如來藏舉體顯現但雖隨緣成辨諸事而其自性本不生不滅此則理事混融無礙是故一心二諦皆無障礙故名唯識由斯論中為明上義說云以一切法皆從心起妄念而生一切分別即分別自心心不見心無相可得又云是故一切法如鏡中像無體可得唯心虗妄心生則種種法生等又下文云從本已來色心不二以色性即智故色體無形說名智身以智性即色說名法身等此則明事理混融無礙之義欲明如斯等義香象和上括一代之聖教略開十門之唯識一相見俱存故說唯識(是護法正義委如前說)",
    "X45n0759_001:0262c06_0-8": "二攝相歸見故說唯識(是親光論師等義)三攝數歸王故說唯識(是無著菩薩等義)四以末歸本故說唯識五攝相歸性故說唯識六轉真成事故說唯識七理事混融故說唯識(已上四門是馬鳴堅慧等菩薩義)八融事相入故說唯識謂由理性圓融無礙以理成事事亦鎔融互不相礙或一入一切一切入一無所障礙故名唯識九全事相即故說唯識謂依理之事事無別事理既無此彼之異全事亦一即一切故名唯識十帝網重重故說唯識謂一中有一切彼一切中復一有一切既爾一門中如此重重不可窮盡餘一一門各皆如是如因陀羅網重重影現皆是心識如來藏法性圓融故令彼事相如是無礙廣如華嚴經說(已上三門明華嚴別教唯識道理非起信論正所宗耳)",
    "X45n0759_001:0262c06_0-9": "此十門唯識具引聖教委配諸宗廣如其十門唯識章問諸論師等說心所現影各有差別皆有本質耶答若准香象華嚴探玄記總有四句一唯本無影如小乘教以無唯識變現等故達磨多羅等諸論師多立此義(然其小乘全不說無影者唯不云相分名為行相耳以未說唯識故)二亦本亦影如大乘始教等護法論師等皆立此義三唯影無本如大乘終教等龍軍堅慧等諸論師竝立此義四非本非影如大乘頓教等龍樹等宗多立此義問此起信論意上十門唯識并此四句宗中說何唯識以為論宗耶答若唯論一心二門兼取十門中前七門此四句中後三句宗為論宗矣若正取論宗者十門之中中間四門四句之中唯影無本宗是也問如何得知此論之宗有兼正耶答集者云一心法界以離靜性以離動性以離靜性故動作萬像以離動性故本來寂靜以動作萬像故流成梨耶等心王心數等差別之法作色處法處等差別之境此差別之境是一心之所現故對一心之鏡為一鏡之影此名通影是一心所現之通影對一心所流之八識名為別影譬如一圓鏡所照之影望於一鏡名一鏡影各望諸緣名為柱影等其別門影以有別相故以賴耶所變之影以為本質為疎所緣以七識所變之影以為影像名親所緣心所緣各有親踈即本質境離轉識見轉識之見非賴耶之所變亦望七識之見所緣不離故相見俱存立唯識義護法論師所宣寄此義矣然別門影像離通門影都無自相唯於一心所現一味影像相望似異故別門影像以通門影像為其自體通門影像即以梨耶正體為其體性以別門影望七轉識亦復如是以見為體譬如臨油鉢時面白影黑相見亦爾見隨緣而似色相耳除相歸見唯識自彰相見同種之種不明而自照親光等論師相分虗而見分實且得此理矣非但所變之影不異於心體其心所法亦心王所緣更無別體故攝數歸王明唯識理故莊嚴論第五卷",
    "X45n0759_001:0262c06_0-10": "述求品云種種心光起如是種種相光體非體故不得彼法實釋論釋曰種種心光起如是種種相者種種心光即是種種事相或異時起或同時起異時起者謂貪光瞋光等同時起者信光進光等光體非體故不得彼法實者如是染位心數淨位心數唯有光相而非光體是故世尊不說彼為真實之法已說求唯識等既有光相而無光體更以何為體故以心王為體等故名唯識非直心數離心王而無體性七轉識亦離本識無體性故名唯識故楞伽云識藏海常住境界風所動種種諸識浪騰躍而轉生乃至異不可得豈離水而有別浪哉七識亦爾思准之非但離本識而無七識亦本識之相離如來藏都無體性故唯識故密嚴經云如來清淨藏世間阿賴耶如金作指環展轉無差別委釋此喻如法界無差別論香象記見之總為明如是唯識淺深道理論云依一心法有二種門一心真如門二心生滅門此二種門各攝一切世間出世間法以此二種門不相離故等餘門如前問前四句宗中唯影無本是論正宗者所變之影還以能緣之心可為其質譬如油鉢之影還以面而為本質豈唯影無質哉答一切眾生及如來皆是一心所現之影故云唯識無質耳故論云凡夫二乘心所見者名為應身以不知轉識現故見從外來取色分齊不能盡知故又大瓔珞經云自見己身當果諸佛摩頂說法身心別行不可思議又華嚴頌曰。",
    "X45n0759_001:0265a05_0": "　若人欲求知　　三世一切佛　　應當如是觀　心造諸如來問小乘之中亦心中影像名為行相即心中所攝如鏡中影即鏡所攝豈但無影像耶答雖名行相而不稱相分未明唯識變現之理故故云無影耳思准之。",
    "X45n0759_001:0265a11_0": "大乘起信論同異略集本"
}