{
    "X46n0777_001:0199b06_0": "金剛頂菩提心論略記",
    "X46n0777_001:0199b08_0": "唐沙門　遍滿　撰",
    "X46n0777_001:0199b09_0": "論題云金剛頂瑜伽中發阿耨多羅三藐三菩提心論者言金剛者謂不壞義行人若住菩提心時不為世間染法所破故云不壞頂謂頭也極也即明菩提心外莫更越高也如人登山下觀萬物莫不明了菩提心頂亦下觀法界圓照無礙故名為頂言瑜伽者謂相應義也即明三密相應義言三密者謂即真言觀是也即身口意也中謂中道遠離二邊契會中道故云中也秘釋云中謂內也若心水澄住菩提心月影現於中也發謂顯也得也下云於一切有情身中本來有普賢大菩提心□為貪瞋癡煩惱之所縛故諸佛大悲以善巧智說此甚深瑜伽令修行者於內心中觀日月輪云云又云由作此觀照見本心湛然清淨猶如滿月光遍虗空無所分別亦名無覺了亦名淨法界云云蕩妄霧於慧風見大日光澄迷濁於定泉顯得本覺云顯得言阿耨多羅三藐三菩提者印度之語也大唐謂云阿云無耨多羅云上三云正藐云等亦三云正菩提云覺即是無上正等正覺此有四覺一無上覺是總也即顯菩提清淨法界二正覺簡外道邪覺故三等覺簡二乘但了主空偏覺故四又正覺簡菩薩菩薩因覺未滿果位非正覺故此顯菩薩道即四智品下一覺字實通上四由具下三一切莫過過超以喻真理所覺名無上覺□□然諸經論多說真理名無上菩提體以本根故今此雙取佛果智俱名無上菩提於此有五淨法界及四智法也無著般若論云無上菩提是法身理三藐三菩提是報身智云云故即通顯此之二種體過一切(已上常途義釋也)若秘釋者一一字一一尊三摩地門梵云阿耨多羅三藐三菩提初之阿字具含四字一者阿(聲短)字菩提心義此字一切字之為先於大乘法中趣向無上菩提心為先二者阿(長聲)字是行義則四智印瑜伽教中修行速疾方便由集福智智慧資糧證成無上菩提正因三者暗字是等覺義由於邊智解脫三摩地陀尼羅門摧伏四種魔羅受十方一切如來三界法王灌頂轉正法輪四者惡(入聲)字是涅槃義由斷二種障謂煩惱所知之障證得四種圓寂所謂一者自性清淨涅槃二者有餘依涅槃三者無餘依涅槃四者無住涅槃前三通異生緣覺聲聞第四唯佛獨證不同異乘則此四字是毗盧舍那佛自覺聖智四種智解脫外現四大轉輪王菩薩所謂金剛薩埵金剛寶菩薩金剛法菩薩金剛羯磨菩薩(至下當知)第二耨字一切法譬喻不可得義也如來萬德難可比喻故即金剛寶三摩地門是也第三多字者一切法如如不可得義斷除二障證得本覺如如故即金剛香菩薩三磨地門是也第四羅字者一切法清淨無垢染義故智慧火燒妄執塵糞盡故即金剛聲菩薩三摩地門是也第五三字者一切法一切諦不可得義如實諦觀一切諸法性相故即金剛喜菩薩三摩地門是也第六藐字者一切法吾我不可得義四德之中第三秘德即無戲論如來三摩地門是也第七三字者入現前降霑大雨般若波羅門悟一切法時平等性不可得故即前金剛喜菩薩三摩地門是也第八九菩提兩字者一切法無縛義若知自身中菩提心成就三世平等猶若虗空離諸萬象象則知一切有情心及諸佛心清淨則生大悲深生矜愍則持種種方便令一切有情至於離苦究竟解脫無縛金剛薩埵大菩薩三摩地門是也梵云質多漢語云心謂普賢心普賢心即一切如來一切如來即菩提心通持依二釋如金剛頂五秘密經云若於顯教修行者久經三大無數劫然後語成無上菩提於其中間十進九退我證七切八前集福德智慧迴向聲聞緣覺果仍不能語無上菩提若依毗盧舍那佛自受用身所說內證自覺聖智法及大普賢金剛薩埵佗受身用智則於現生遇逢曼荼羅阿闍梨得入曼荼羅為具足羯磨以普賢三摩地引入金剛薩埵入其心中由加持威德力故於須臾頃當證無量三昧耶無量陀羅尼門以不思議法能變易弟子俱生我執種子應時集得一大阿僧祗劫所集福德智慧則為生在佛家纔見曼荼羅則種金剛界種子具受灌頂受職金剛名號從此已後受得廣大甚深不思議法云云第十論者梵云摩怛哩迦漢云論也本母之義也此菩提心出諸法故又教誡之義教誡行者令修大菩提行故即明論文根教識一者謂無類之義唯有一故云一卷也。",
    "X46n0777_001:0200b10_0": "論云龍猛菩薩造者明造者之名目真言教祖第三之人也梵云那伽閼剌樹那菩提薩埵漢云龍猛菩薩舊云龍樹誕迹南天化被五印尋本則遍覆初生如來現迹位登初地或遊邪林同塵同事或述正幢以宣揚佛威作千部論擁邪顯正上遊四王自在處下入龍海中宮誦持所有一切法門遂則入南天鐵塔中親授金剛薩埵灌頂誦持秘密最上曼荼羅教流傳人間楞伽經說我乘內證智妄覺非境界如來滅度後未夾當有人於南大國中有大德比丘名龍樹菩薩能破有無見為人說我乘大乘無上法。",
    "X46n0777_001:0200b20_0": "論云大興善寺三藏沙門大廣智不空者正明翻家之主是第六祖師即北天竺婆羅門子也初母氏遇相者曰爾汝所懷菩提薩埵也數日之後夜夢佛視以微笑眼灌以五智水省悟以後室明如晝遂則娠孕和尚面未幾耶早弃背孤露無歸年甫十歲隨舅氏至武威郡年至十三遊大原府尋入長安見大弘教金剛三藏以為真言師初試教悉曇章令誦梵經梵言□□無墜一閱有悟便許入壇授發菩提心戒或十五出家弱冠從有部進具成大苾蒭律相洞閑知而不住將欲學聲明論窮瑜伽宗以白先師師未之許夜夢佛菩薩來悉告曰我之法藏悉以付汝遂授以三密談於五智至開元二十九年秋先師厭代入唐之後有詔令命賷國信使師子國白救連山巨鱗橫海洪濤淘湧猛風振激和尚手翫金剛口諷隨求羣災靜然船達彼國□弟子僧含光慧辨皆月擊驚怪焉師子國王郊迎宮中七日供養以真金器沐浴和尚時步慰問以梵禮王諸眷屬宰輔大臣備盡献敬其國有阿闍梨名曰普賢位鄰聖地德為時尊從而問律無展奉献黃金以表丹誠見之報曰吾所寶者心也非此寶矣即授十八會金剛頂瑜伽并毗盧舍那大悲胎藏五部灌頂真言秘典經論梵篋五百餘部僉以為得焉佗日王作調象戲以試和尚和尚結佛眼印住慈心定誦真言門其象顛仆不能前進王甚歎怪稱增虔誠即知七葉之花本無香氣五陰之舍豈有我人至于天寶六載自師子國歸還玄宗延入建壇親授灌頂即賜紫袈裟一副絹二百匹至于十三載有　勅令往武威府節度使十五載三月　勅還京住大興善寺洎至德中肅宗皇帝密進不動尊八方神旗經等乾元中延入內殿建護摩親授灌頂天恩彌篤敬重常新尋令於智炬寺念誦感本尊月輪懸虗空大明暉岩谷及寶應臨朝金輪馭曆聖眷彌積師事道尊授特進試鴻臚卿加大廣智之號或普賢流神光於紫殿六宮作禮或文殊呈瑞相於金閣萬乘修崇或翻密嚴國護之梵文雲飛五色或譯虗空庫藏之具偈霧擁千僧和尚銜命向涉彼清凉承恩而旋歸漢邑前後奉詔所譯經論總八十三部一百二十卷並已入目錄而流行至九年六月十一日制加開府儀同三司封肅國公食邑千三戶餘如故榮問優洽寵光使繁降北極之尊為師宗之禮　勅書盈篋中使相望前古已來未有如之夫眾色摩尼本無定彩七珍百移於我何為只唯真堯之大寶是我所重矣電影粗駐幻化誰人自知去辰某月十五日命弟子進表上辭屬以後事削髮湯沐右脅累足奄然而化春秋七十法夏五十天開哀悼九重輟朝三日贈絹三百匹布二百端錢三萬米麵共四百石香油薪炭及諸齊七殊支給又贈錢二百二十五萬建以靈塔又　勅高品李憲城勾當及功德使開府儀同三司李元琮監護即以七月六日葬于鳳之南少陵原其日中書門下　勅牒贈司空贈諡大辨正廣智不空三藏池涸花萎告終之相同雙林之變色均提河之逆流四部弟子凡數萬人痛大夜之還昏悲慧炬永滅夫法體堅固無去來應俗緣則現於人世證道品則歸之涅槃奇哉夫言奉詔譯者明佛法國王之所仰非餘人之所興故仁王般若吾滅度後正法欲滅此經三寶附諸國王建立守護我四部弟子等受持讀誦解其義理廣為眾生宣說法要令其修習出離生死今此論者則開元年中奉詔所譯即入目錄流通故云奉詔譯也。",
    "X46n0777_001:0201b06_0": "論云自大阿遮梨至不求餘果者宣暢金剛薩埵之說所言大阿遮梨者第二祖師也梵曰縛日羅薩怛縛摩訶薩怛縛譯云金剛薩埵大薩埵金剛頂經說是金剛薩埵親對法身如來海會受灌頂職位則說自證三密門以献毗盧舍那如來及一切如來使被加持教勅毗盧舍那如來及一切如來言汝將來於無量世界為最上乘者令得現生世出世間悉地成就五秘密經云金剛薩埵者是普賢菩薩即一切如來菩提心一切如來祖師是故一切如來敬禮金剛薩埵故右擲五智金剛左振般若鈴鐸驚長眠三有受法樂十方遂則釋迦善逝掩化之後八百年中灌頂龍猛傳授秘法其後早度支那及與日本三密之教師師相承拔濟羣生言有上根者謂大乘真言根人也言有上智者謂大菩薩智非二乘外道智也言有大度量勇銳無惑者重明上根上智之功用也言宜修佛乘當發如是心者令勸發菩提心言我今志求阿耨多羅三藐三菩提者明無上菩提之大果也言不求餘果者謂聲聞緣覺之二乘也。",
    "X46n0777_001:0201b24_0": "論自誓心決定故至修菩提行此有七誓心決定故者明第一行人發菩提心時天魔宮殿破裂身心不安也言十方諸佛皆悉證知者明第二十方諸佛隨喜證誠也言常在人天受勝快樂所生之所憶持不忘者明第三生生世世受持不忘也言若願成瑜伽中諸菩薩身者亦名發菩提心何者為次諸尊皆同大毗盧舍那佛身者明第四修本尊觀亦名發菩提心也周遍之義如月輪觀故亦名發菩提心言諸菩薩者三十七聖是也瑜伽中諸尊由毗盧舍那佛互體無二無別故云何者為次諸尊皆同大毗盧舍那佛身也言如人貪名官者發求名官心修理名官行若貪財寶者發求財寶心作經榮財物行者別明第五以心求世間悉地言凡人欲為善之與惡皆先標其心而後成其志者總明第六以心作善悉事言所以求菩提者發菩提心修菩提行者第七□成即明若欲求無上菩提者□發普賢心行普賢行。",
    "X46n0777_001:0201c16_0": "論云既發如是心已須知菩提心之行相者勸知菩提之行相。",
    "X46n0777_001:0201c18_0": "論云其行相者三門分別者總表將說菩提心行相也。",
    "X46n0777_001:0201c20_0": "論云諸佛菩薩昔在因地發是心已勝義行願三摩地為戒乃至成佛無時暫忘惟真言法中即身成佛故者明諸佛菩薩因果位中常發菩提心之行願無有休息言惟真言法中即身成佛故者若依內證智境界修行者不過三祗之道現生成佛。",
    "X46n0777_001:0202a01_0": "論云於諸教中闕而不書者明顯教大乘中無說頓證菩提文矣。",
    "X46n0777_001:0202a03_0": "論云一者行願二者勝義三者三摩地者此列數也於此有二初總別名後別釋之此總列也。",
    "X46n0777_001:0202a05_0": "論云自初行願者至者方便引進此別釋也。",
    "X46n0777_001:0202a05_1": "言為修習之人常憶如是心我當利益安樂無餘有情界者行願者有二一大慈門二大悲門大慈門復二一者利二者安樂此總明大慈門。",
    "X46n0777_001:0202a09_0": "論云觀十方含識猶如己身者總明大慈門論云所言利益者為勸發一切有情悉令安住無上菩提終不以二乘之法而令得度者別明大慈門中初之利益也。",
    "X46n0777_001:0202a13_0": "論云真言行人應知一切有情皆含如來藏性堪任安住無上菩提是故不以二乘之法而令得度者明一切有情具備本覺真理。",
    "X46n0777_001:0202a16_0": "論云故華嚴經云無一眾生而不具足真如智慧但以妄想顛倒執著而不證得若離妄想一切智自然智無礙智則得現前者引證成前義。",
    "X46n0777_001:0202a19_0": "論云所言安樂者謂行人既知一切眾生畢竟成佛故不敢輕慢者別明大慈門中後安樂也。",
    "X46n0777_001:0202a21_0": "論云又於大悲門中尤宜極救故隨眾生願而給付之乃至身命而不恡惜令其安存使令悅樂者別明大悲門於此有二初施財物後與法寶初施復二一施十珍百味二施己身頭目此明初地相。",
    "X46n0777_001:0202b01_0": "論云既親近已信任師言因其相親亦可教導者後明法施也。",
    "X46n0777_001:0202b03_0": "論云眾生愚朦不可強度真言行者方便引進者結成前義菩薩者欲等眾生先行財施後與法財。",
    "X46n0777_001:0202b05_0": "論云二自勝義至為究竟此明第二勝行相。",
    "X46n0777_001:0202b05_1": "言觀一切法無自性者此總標也。",
    "X46n0777_001:0202b06_2": "言云何無自性者此問所觀之行相謂凡夫至五欲者總明凡夫執相也。",
    "X46n0777_001:0202b07_3": "言真言行人誠可厭患者別明執著名聞利益言誠可弃捨者復別明恣行三毒五欲。",
    "X46n0777_001:0202b09_4": "言又諸外道等戀其身命或助以藥物得仙宮住壽者謂外道世間悉地名為人乘也。",
    "X46n0777_001:0202b11_5": "言或後生天以為究竟者謂愚夫出世悉地名為天乘言真言行人應觀彼等業力若盡未離三界煩惱尚存宿殃未殄惡念旋起當彼之時沉淪苦海難可出離當知外道之法亦同幻夢陽炎也者明人天果報外道愚夫之所示若修菩薩行者不可願樂也。",
    "X46n0777_001:0202b16_6": "言又二乘之人聲聞觀四諦法緣覺執十二因緣者總明二乘所知之法言知四大五陰畢竟磨滅深起厭離破眾生執勤修本法剋證其果趣本涅槃已為究竟者別明二乘能觀之心所證之果言真言行者當觀二乘之人雖破人執猶有法執但淨意識不知其他久久成果位者總明不定性二乘未斷法執之由也。",
    "X46n0777_001:0202b22_7": "言以灰身滅智趣其涅槃如太虗空湛然常寂者別明定性二乘遂不證大菩提也。",
    "X46n0777_001:0202b23_8": "言有定性者難可發證要待劫限等滿方乃發生者別明有定性之人期乘量時入邪定聚無上依經云佛告阿難世間中有三品眾生一者著著有有復二一背涅槃道無涅槃性不求涅槃願求生死二者於我法中不生渴仰誹謗大乘乃至落闡提網不能自出前是彰無性後是有性但名邪定聚前云無性即論云灰身滅智趣其涅槃是也云有性即論云侍劫限等滿方發生是也。",
    "X46n0777_001:0202c07_9": "言若不定性者無論劫限遇緣便迴心向大者別明不定性之人言從化城起以為起三界謂宿信佛故乃蒙諸佛菩薩加持力而用方便遂發大心者復明不定性之人。",
    "X46n0777_001:0202c10_10": "言乃從初十信下遍歷諸位經三無數劫難行苦行然後得成佛者總明依教門修行之人成佛之由也。",
    "X46n0777_001:0202c12_11": "言既知聲聞緣覺智慧狹劣亦不可樂者明二乘之行不可樂無利佗之行故。",
    "X46n0777_001:0202c14_0": "言又有眾生發大乘心行菩薩行於諸法門無不遍修復經三阿僧祗劫修六度萬行皆悉具足然證佛果久遠而成斯由所習法教致有次第者明決定大乘者行菩薩行得成佛道也。",
    "X46n0777_001:0202c17_1": "言今真言行人如前觀了者明真言者先觀外道二乘境界然修瑜伽三密門也。",
    "X46n0777_001:0202c19_2": "言復發利益安樂無餘眾生界一切眾生心以大悲決定永超外道二乘境界者明真言行人雖未證大覺位由發利益安樂無盡生死有惰心永超外道二乘境界言復修瑜伽勝上法能從凡入佛位者亦超十地菩薩境界者明若修真言三密門者不經三僧祇入大覺位言又深知一切法無自性云何無自性前以相說今以旨陳者前以相說謂有相觀也今以旨陳謂無相觀言夫迷途之法從妄想生乃至展轉成無量無邊煩惱輪迴六趣者別明妄想生也言若覺悟已妄想止除種種法滅故無自性者明若觀諸法無自性時妄想不生也復次諸佛慈悲從真起用救攝眾生應病與藥施諸法門隨其煩惱對治迷津遇栰達於彼岸法已應捨無自性故者明諸法實相不可以言宣諸佛慈悲於自性亦起有相之說達之者則除煩惱病永在菩提之命迷之者溺所知津則不達涅槃之岸言如大毗盧遮那成佛經云諸法無相為虗空相者引證成前義問曰云何名為無相耶答曰虗空相名無相問曰何故虗空名無相耶。",
    "X46n0777_001:0203a13_0": "答曰如世間虗空無執著法性虗空又如是遠離一切執相故名無相問曰若言諸法無相者誰尋求一切智誰為菩提成正覺□誰發起彼一切智智答曰自心即一切智即是大覺真如本性清淨故乃至功德皆悉成就言作是觀已名勝義菩提心當知一切法空已悟法本無生心體自如不見身心住於寂滅平等究竟真實智令無退失者明十地位行願蕩三妄於無性證十地於平等言妄心若起知而勿隨者觀通達菩提心義妄霧忽晴見大日於性空執雲斯散仰心月於本覺言妄若息時心源空寂萬德斯具妙用無窮者明修菩提心及佛身圓滿義心習礦於此悉盡曼茶莊嚴是時忽開五部沒馱擎智印森羅四種曼茶住法體駢填言所以十方諸佛以勝義行願為戒但具此心者能轉法輪自佗共利者以例結成也言如華嚴經云悲先慧為主方便共相應者明具三智利自佗謂平等性智妙觀察智成所作智是也言信解清淨心如來無量力無礙智現前自悟不由修具足同如來者明於勝義菩提心信解清淨也言發此最勝心佛子始發生如是妙寶心則超凡夫位入佛所行處生在如來家種族無瑕玷與佛共平等決成無上覺者明真言行人若發無相行願行起越外道二乘位生在佛家決定成無上菩提言纔生如是心即得入初地心樂不可動譬如大山王者明真言行者若發菩提心即入初地得不退轉初地謂普賢初地普賢初地即如來初地也言又準華嚴經云從初地乃至十地於地地中皆以大悲為主者謂三僧祇中皆以大悲為先言如無量壽觀經云佛心者大慈悲是者明諸佛如來常住慈悲利益安樂無餘有情言又涅槃經云南無純陀身雖人身心同佛心者明南無初發心之人也言又云憐愍世間大醫王身及智慧俱寂靜無我法中有真我是故敬禮無上尊者明敬禮發心已後之人言發心畢竟二無別如是二心先心難自未得度先度他是故我禮初發心初發已為人天師勝出聲聞及緣覺如是發心過三界是故得名最無上者明未成佛心與已成佛心言如大毗盧舍那經云菩提為因大悲為根方便為究竟者謂薩般若心堅固不動離業受生成就真性生萬行功德從此增長故曰菩提心為因也此菩提心為後二句因若望生死中所植善根則名為果以覩佛法前相故大悲為根是能執持義猶如物根執持莖花果便不傾拔也梵音謂悲為迦盧拏迦是苦義盧拏是剪除義慈如廣植嘉苗悲如芸除草穢故此中云悲即兼明大慈也隨行者以無住心所修萬行即由大悲地界所執持故大悲火界所溫育故大悲水界所滋潤故大悲風界所開發生故大悲虗空不障礙故爾時度門任運開發方便為究竟者謂萬行圓極無可復增應物之推究盡能事即醍醐妙果三密之源也又釋云淨菩提心者猶如真金本性明潔離諸過患大悲如習學士巧以諸藥種種練冶乃至鏡徹柔耎屈申自在方便如功藝成就所作隨意皆成。",
    "X46n0777_001:0203c16_0": "論云第三言三摩地者真言行人如是觀已云何能證無上菩提者是問也。",
    "X46n0777_001:0203c18_0": "論云當知法爾應住普賢大菩提心者是答也。",
    "X46n0777_001:0203c19_0": "論云一切眾生本有薩埵者即普賢薩埵普賢薩埵者即大菩提心是也。",
    "X46n0777_001:0203c21_0": "論云為貪瞋癡惱煩之所縛故者明普賢心之不現。",
    "X46n0777_001:0203c22_0": "論云諸佛大悲以善巧智說此甚深秘密瑜伽令修行者於內心中觀日月輪者明三密相應觀菩提心日月輪也。",
    "X46n0777_001:0204a01_0": "論云由作此觀照見本心湛然清淨猶如滿月光遍虗空無所分別亦名無覺了亦名淨法界亦名實相般若波羅蜜海者明菩提心之名體。",
    "X46n0777_001:0204a04_0": "論云能含種種無量珍寶三摩地猶如滿月潔白分明者明菩提心德萬圓滿義也。",
    "X46n0777_001:0204a06_0": "論云何故以日輪為喻者是問也。",
    "X46n0777_001:0204a07_0": "論云為滿月圓明體即與菩提心相類者是答也。",
    "X46n0777_001:0204a08_0": "論云凡月輪有一十六分者謂自一日至十五日漸漸增加名曰十五分加而名十六分也。",
    "X46n0777_001:0204a10_0": "論云喻瑜伽中金剛薩埵至金剛拳有十六大菩薩者者明如月輪有十六分真言行者所觀大菩薩亦有一十六。",
    "X46n0777_001:0204a13_0": "論云從東方阿閦佛至由成法界智為本者別明五智也。",
    "X46n0777_001:0204a15_0": "論云已上四佛智出世四波羅密菩薩焉者明定慧而起。",
    "X46n0777_001:0204a17_0": "論云四菩薩即金寶法業也者明四波羅密別號也。",
    "X46n0777_001:0204a18_0": "論云三世一切諸聖賢生成養育之母者明定能生佛身一切佛身皆從定而生故。",
    "X46n0777_001:0204a20_0": "論云於是印成法界體性中流出四佛也者謂大日如來流出四佛也者引四佛也從本垂迹之義。",
    "X46n0777_001:0204a22_0": "論云四方如來各攝四菩薩者總標也。",
    "X46n0777_001:0204a23_0": "論云東方阿閦佛攝四菩薩金剛薩埵金剛王金剛愛金剛喜為四菩薩也南方寶生佛攝四菩薩金剛寶金剛光金剛幢金剛笑為四菩薩也西方阿彌陀佛攝四菩薩金剛法金剛利金剛因金剛語為四菩薩也北方不空成就佛攝四菩薩金剛業金剛護金剛牙金剛拳為四菩薩也者別明四佛各攝四菩薩也。",
    "X46n0777_001:0204b06_0": "論云四方佛各四菩薩為十六大菩薩也者明十六大菩薩四方四佛之所攝。",
    "X46n0777_001:0204b08_0": "論云於三十七尊中除五佛四波羅蜜及後四攝八供養但取十六大菩薩為四方佛所攝也者結成(具加禮懺秘釋)。",
    "X46n0777_001:0204b11_0": "論云又摩訶般若經中內空至無性自性空又有十六義者謂內空外空內外空大空空空勝義空有為空無為空畢竟空無際空無散空本性空相空一切法空無性空無性自性空是名十六義也。",
    "X46n0777_001:0204b15_0": "論云一切有情於心質中有一分淨性眾行皆備其體極微妙皎然明白乃至輪迴六趣亦不變易如月十六分之一者明一切有情心中有一分圓明即菩提心是也。",
    "X46n0777_001:0204b19_0": "論云凡月其一分明相若當合宿之際但為日光奪其明性所以不現後起月初日日漸加至十五日圓滿無礙者取世間所見明月喻本覺圓明心月。",
    "X46n0777_001:0204b22_0": "論云所以觀行者以初阿字發起本心之中分明只漸令潔白分明證無生智者明修阿字觀也。",
    "X46n0777_001:0204b24_0": "論云夫阿字者一切諸法本不生義者總明阿字本來不生不滅義也。",
    "X46n0777_001:0204c02_0": "註云準毗盧舍那經疏釋阿字具有五義一者阿字(短聲)是菩提心二阿字(引聲)是菩提行義三暗字(短聲)是證菩提義四惡字(短聲)是般涅槃義五惡字(引聲)是具足方便智義也又將阿字配解法華經中開示悟入四字也開字者開佛智見即雙開菩提心如初阿字是菩提心義也示字者示佛智見如第二阿字是菩提行義也悟字者悟佛智見如第三暗字證菩提義也入字者入佛智見如第四惡字是般涅槃義也總而言之具足成就第五惡字是方便善巧智圓滿義也者明釋家之解釋之顯易恐繁不記。",
    "X46n0777_001:0204c12_0": "論云即讚阿字是菩提心義頌曰八葉白蓮一肘間炳現阿字素光色禪智俱入金剛縛召入如來寂靜智者總讚阿字菩提心義也。",
    "X46n0777_001:0204c15_0": "論云扶會阿字者揩是決定觀之當觀圓明淨識者謂如來第八識也即大菩提心是也於一切有情有此大菩提心淨識故金剛界藏識本非染清淨無瑕穢由具福智故曰心如滿月云云何故第八識名為藏答曰具三義故曰藏能藏所藏執藏是也。",
    "X46n0777_001:0204c20_0": "論云若纔見者則名見真勝義諦者明漸見三昧之義。",
    "X46n0777_001:0204c22_0": "論云若常見者則入菩薩初地者言菩薩者普賢大菩薩也即是如來初地非菩薩初地即明安住三昧之義。",
    "X46n0777_001:0205a01_0": "論云轉漸增長則廓周法界量等虗空卷舒自在當具一切智者明正體智會真如之義(廣如念誦秘釋決)。",
    "X46n0777_001:0205a03_0": "論云凡脩習瑜伽觀行人當須具修三密行證悟五相成身義也者總標也。",
    "X46n0777_001:0205a05_0": "論云所言三密者一身密者如結契印召請聖眾是也二語密者如密誦真言令文句了了分明無謬誤也三意密者如住瑜伽相應自淨月圓滿觀菩提心也者別明三密之義。",
    "X46n0777_001:0205a09_0": "論云次明五相成身者一是通達心二是菩提心三是金剛心四是金剛身五是證無上菩提獲金剛堅固身也者別明五相成身義問曰何為通達菩提心等耶答言通達菩提心者□□觀自心輕霧中有□□修菩提心者謂觀自心清淨滿月也成金剛心者謂於清淨月輪中有諸尊三昧耶身也證金剛心者謂觀自身成本尊三昧耶身也佛身圓滿者謂觀三昧耶身成為本尊身萬德圓滿也。",
    "X46n0777_001:0205a17_0": "論云然此五相具備方成本尊身也者結戒也。",
    "X46n0777_001:0205a18_0": "論云其圓明則普賢身也亦是普賢心也與十方諸佛同之者正明自心滿月輪之義。",
    "X46n0777_001:0205a20_0": "論云亦乃三世修行證有前後反達悟已無去來今者謂三世諸佛真理所語無二無別故云無去來今。",
    "X46n0777_001:0205a22_0": "論云凡夫心如合蓮華者明不染不著之義為客塵煩惱之所纏未顯得故云合也即是隱為如來藏之義。",
    "X46n0777_001:0205b01_0": "論云佛心如滿月者是平等遍照之義能破癡暗如圓明之照世間即是顯位法身義。",
    "X46n0777_001:0205b03_0": "論云此觀若成十方國土若淨若穢六道含識三乘行位及三世國土成壞眾生業差別菩薩因地行相三世諸佛悉於中現證本尊身滿足普賢一切行願者脩日輪觀成就有如是作用也。",
    "X46n0777_001:0205b07_0": "論云故大毗盧舍那經云如是真實心故佛所宜說者引證結成。",
    "X46n0777_001:0205b09_0": "論云問前言二乘之人有法執故不得成佛今復令修菩提心三摩地者云何差別答二乘之人有法執故久久證理沉空滯寂限以劫數然發大心者此答無量時定性二乘。",
    "X46n0777_001:0205b13_0": "論云又乘散善門中經無數劫者明若依顯教大乘修行者經三大無數劫方得成佛。",
    "X46n0777_001:0205b15_0": "論云言是故足可厭離者明二乘之行。",
    "X46n0777_001:0205b16_0": "論言不可依止者明顯教大乘。",
    "X46n0777_001:0205b17_0": "論言今真言行人既破人法上執雖能正見真實之智或為無始間隔未能證於如來一切智智者於真言行人所斷有三一麤妄執二細妄執三極細妄執破人之上執者謂破麤妄執即是人執破法之上執者謂破細妄執即是法執或為無始間隔未能證於如來一切智智者未斷極細妄執故不能證於一切智智是二障習氣未斷也。",
    "X46n0777_001:0205b24_0": "論云故欲求妙道修持次第從凡入佛智者者言妙道者謂無上菩提之妙果言修持次第者謂三密加持次第是也若依真言門次第法則修行者不起于座能成一切佛事有情事業。",
    "X46n0777_001:0205c04_0": "論云即此三摩地者能達諸佛自性悟諸佛法身證法界體性智者言諸佛自性者本地法身也言悟諸佛法身者自受用也。",
    "X46n0777_001:0205c07_0": "論云成大毗盧舍那佛自性身受用身變化身等流身者明四種法身也。",
    "X46n0777_001:0205c09_0": "論云為行人未證故理宜修之者明若未證四種法身者勸修三密門。",
    "X46n0777_001:0205c11_0": "論言故大毗盧舍那經云悉地從心生者引證結成也。",
    "X46n0777_001:0205c13_0": "論云如金剛頂瑜伽經說一切義成就菩薩初坐金剛座取證無上道遂蒙諸佛授此心地然能證果者釋迦如來為太子行菩薩道時名為一切義成就金剛座者三世諸佛成正覺座一切天魔外道不能傾動故名金剛坐即中印土菩提樹下師子坐是也遂蒙諸佛授此心地然能證果者明釋迦菩薩雖三大無數劫中滿諸願行不能成無上菩提依虗空諸佛驚覺授與心地方得成正覺故守護國界主經云佛言秘密之我於無量無數劫中修習如是□波羅蜜多至最後身六年苦行不得阿耨菩提成毗盧舍那坐道場時無量化佛猶如油麻徧滿虗空諸佛同音與告我言善男子云何而求成等正覺我白佛言我是凡夫未知求處惟願慈悲為我解說是時佛同告我言善男子諦聽應當於鼻端想乃至如恒河沙三世諸佛不於月輪作唵字觀得成佛者此無有處。",
    "X46n0777_001:0206a04_0": "論云凡今之人若心決定如教修行不起于座三摩地現前應於是成就本尊之尊身者令勸後學住菩提心。",
    "X46n0777_001:0206a07_0": "論云故大毗盧舍那經供養次第法云若無勢力廣增益住法但觀菩提心者廣增益者具備七珍百味供養諸尊如說修行但觀菩提心者明若菩提心觀成就萬行圓滿何更辨供。",
    "X46n0777_001:0206a11_0": "論云佛說此中具萬行滿足淨白純淨法也者明菩提心福智圓滿。",
    "X46n0777_001:0206a13_0": "論云此菩提心能包藏一切諸佛功德故者述所以也。",
    "X46n0777_001:0206a15_0": "論云若修證出現則為一切導師者若證菩提為人天之導師。",
    "X46n0777_001:0206a17_0": "論云若歸本則是密嚴國土不起于座能成一切佛事者密嚴國土者謂遮那之內都即不起于座能成一切佛事者謂不經生而現身能起成所作智用也。",
    "X46n0777_001:0206a20_0": "論云讚菩提心曰若人求佛慧通達菩提心父母所生身速證大覺位者初二句明勸住菩提心如心地秘訣云若作菩提心觀一切佛法恒沙功德不由他悟以一貫之自然通達能開一字演說無量法剎那悟入於諸法中自在無礙無去來起滅一切平等然於此心復有五心義一者剎那心謂初心見道一念相應速還妄夫如夜電光暫現即滅故云剎那二者流澍心既見道已念念加功相續不絕如流大菩提澍故云流澍三者甜美心謂施功不已乃得虗然朗徹身心輕泰翫味於道云甜美四者摧散心謂率起精勤或復休癈二俱不達道故云摧散五者明鏡心既離散亂之心悉鑒達圓明一切無著故云明鏡故云若人求佛慧通達菩提心後之二句明頓證如來之義若初心念菩提者超過諸地頓入金剛秘藏不經三劫速證大日尊位故云父母所生身速證大覺位自心法爾菩提月能發圓明遍大虗令者讚揚似海滴願俱含識歸如宮。",
    "X46n0777_001:0206b14_0": "金剛頂菩提心論略記一卷"
}