{
    "X48n0796_009:0120b11_0-0": "大乘阿毗達磨雜集論述記卷第九(論本第九十十一)大慈恩寺沙門　基　撰第三見道有二初問後答答有三初明見道體相次明聖道輪後釋經說見道處義初中復二初明見道體後明見道真相差別若總說下初出體後又所緣能緣等下辨真相差別差別真相中有二科若以一心為正初所緣能緣平等平等智為其相辨一心真又遣以下辨三心十六心假若三心為真初辨三心等總是真見道後十六智等為相真中初總出體竟俱以平等智為相後顯差別故說三心又初如瑜伽說一心事究竟故據實而言即有三心顯揚第十七成現觀品說見道然三心已下有二段文一云三心以前真後明相然真中菩薩三心真十六心菩薩相若依二乘二品為真但斷人執為二品故明十六心相見道中有二初解相見道後結非實解相見道中有三初列十六智次別牒解釋後於此位中由法忍法智等總聊簡之別牒解釋中有二初明苦諦四智後類餘三諦苦類智忍中言後聖法皆是此類者其修道無學道中此智如何行相不可言緣後聖法是此類此類如後得智前因種類故名後得此但緣智為境初後分成類忍智何必要須作此解相或緣同類亦得但知緣智智今顯智緣如智之類故總聊簡文中分三初釋法類智差別次釋名無相觀者後顯十六心剎那總名見道此十六心是諦觀行相攝法不盡唯後得智收不說緣餘事智故第二釋名無相觀中分三初論本解名無相觀者次釋論引經證成後別顯六種無相住於此位中一切相等者不同緣有漏有十相此無男女等相此中無願等有頂等名無相者無分別差別相非一切全無解十六心剎那是論本文下說為四心等是釋論師合為四又心剎那進看文勢總束為一准下結中即一一諦名為一心緣一諦究竟故結上段中三心為真由諸十六三心為假遍結三心道諦四相道法輪中初安立釋何須相見道所以重觀真位擬後說故乃至無學位亦爾。",
    "X48n0796_009:0120c23_0": "四輪中文有三初標次說後結此意由聲聞等說次學加行次證次圓滿後復說之名輪。",
    "X48n0796_009:0121a01_0": "釋經遠塵中分二初釋三句經後釋九句經二句初次即後釋之初中初總後別釋又於此忍智兩位等者遍知苦斷集或逆次配無間道斷解脫道知或無間道知解脫道斷已斷故。",
    "X48n0796_009:0121a05_0-0": "次第四明修道中有二初問後答答有二初烈後釋烈中有二一名所顯九義通相修道三類差別二等中別顯修道不共別勝十一五類是前功德初中復二初別烈九義三類差別後釋論師所以者何下解後釋中烈二隨前所標顯名不顯二類別故釋初修名中有二初別解九義後傍乘義辨修前法前九義中分三一世出世間對二三品對三四道類世出世間分二隨名別故世間道中有二初烈世間八定後依此八以四種相分別然此八定通出世後出世間中八智品實通世間然世間者宗明有漏定以八定體寬能伏現行義增上故說為世間正證八智品唯在無漏因以為稱非不互通然見道前非不得品品具足行相周廣要唯修道無學道中多分已得別有勝事不說八為無學又正修道位之所修故名修道然聞思修欲界上有依所修習柝伏煩惱唯定地非對故不說欲界聞思四相分別中有二初烈後釋然此四中初二通八地所能治相對後二通八地依勝位八顯就解雜染中有三初標列次別解後結染此中謂四取無明瑜伽十二及六十二取疑此論因彼論果由癡故疑又此四種見疑唯分別愛慢通俱生何故說修道障也因說修道障他所有通說故此中說為根者由此四種定煩惱故與退分位無相入出故為生散煩惱為根第六中惑非第七也古人說為第七者非不緣定起此緣定起故如瑜伽第十二此所治能治對中淨定通八根本未至勝定從愛為名亦通八根本八未至中有二說一云有二云無第三建立中有二初烈四種後隨別釋初中有二初論本烈後釋師解八定通局支分建立中有二初明支分建立後明無色不立支所以初中有二初解四靜慮具支多少後解支增減增減中有二初總問答後別解支多少所因支分四門出體釋名通廢立別地名廢立等至建立中有三初標七入八地次別解七後結釋麤靜相初中如聲聞地後瑜伽處者即聲聞地有四瑜伽第四瑜伽名後即三十三卷",
    "X48n0796_009:0121a05_0-1": "彼四復次第一第三同此彼第二以離生喜樂起有多少第四四種作意及四對治釋其六十六有四對治攝第二十八有四瑜伽相攝第十一有四十作意攝七作意八門分別一出體古人以慧為體能斷道故今解以作意數為體此論云最初斷道俱行作意名遠離作意故知非慧又可是定數對法第一是故心得定者名得作意定由作意勝立從彼為名如念住等或此論云由定地作意故知定地與作意數也二釋名相云了了作行相了即作意勝解遠離俱時之作意遠離者體道也樂云攝攝樂即作意觀察俱時之作意觀察者道或作意即觀察不及前解加行究竟即作意加行究竟之果即作意或果之作意果是慧道故前解勝三依地依此初入方便地有六根本地有七第二復次不斷方便地有七不說第七是根本故理亦應爾不爾第九解脫道不入根本何作意所攝其此明有漏作意如六十六依四道第十一明四十作意有學無學等作意說亦通無漏故知此七中了相一種唯有漏餘六通無漏勝解為修道無漏加行故或了相亦通無漏從識了麤等三了四諦相等如燸頂二位忍下忍位方名勝解印可決擇故其修已此了相何妨亦有此相今正解前解勝四四瑜伽相攝如二十八五四道六四對治二種對治四十作意者七釋妨難何故初品斷道說二加行難故第二斷道不說加行易故與一名據實亦有總名攝樂第三斷道亦以觀察為加行者亦難故說創起最難須二加行餘易總一或不說何故第三斷道說解脫道餘二不說者即後作意故如初品解脫道即攝樂已攝樂故第二解脫道亦爾俱攝樂故相無分別更不別說或即第二觀察所攝觀察為後加行勝長作名其第二解脫道雖未觀察短念從長作名亦無妨難問九品煩惱何故唯說三無間也答世間道唯有三品道故若爾便無一間之人彼依聖道得一間故世道必三又亦九品了相斷上上勝解斷上中品遠離能斷上下上品盡時與名遠離非前不斷又第二三品准此應思相此若六行彼猒得定必伏惑若見道前觀諦得定不必能伏惑即三無間中既有九品以類同故不說九品初二不能斷惑此中熏修唯有有漏同本地第四卷",
    "X48n0796_009:0121a05_0-2": "彼第十地更熏習生色究竟上其第十二此已前說凡三品修第十二說有漏無漏四靜慮雜修生五淨居如彼退生等義。",
    "X48n0796_009:0122a07_0-0": "出世間中大文分二初明出世間體次明此所依後明滅定亦出世間初中初烈後指此見道說第二別中初明智及相應依八地後明非想非智依不說中間禪即初定攝上地無此不須簡略唯初未至有無漏故恐濫上未至所以說問何故上地無中間下地有邪初得彼定起上難故梵王等臣主別故八智緣差別如六十九何獨初未至有無漏如六十九說非想名世間無斷惑道等故此中說斷惑明利道名出世間故由此應作四句有是出世非世謂下八地明利無間道有唯世間非出世一切有漏道有俱者謂有頂無漏道不爾滅定應非出世又有四句即初句即十地無分別正體智第二句即唯世俗有漏智俱句即十地後得智此通取非想故言十地第三明滅定中有二初標滅定體出世間後辨地依辨地依中分二初明起地後問答明不起地初起地中分二初明初起地後明後起地後起地中分二初總明或欲色界後起後問答釋之佛色界得重起有伏惑得滅定六十九云聖者後得智離欲乃至得有頂即六十九文勢似預流者亦得有頂無漏定何故不說得滅定此論唯說離三定下惑得六十九雖不言得滅定以後得智伏無所有處下惑亦可得滅定唯識第七卷",
    "X48n0796_009:0122a07_0-1": "二說皆有證約彼初說對法且依彼人據實未離初定亦得據彼後說六十九通論第三果人非必初果六十九不言不還未離初定得滅定為正唯識論天親攝論說唯識不還不退菩薩三乘無學唯此定故故知初二果不得論云云何見道依此論及大論五十八有一心見道及五十五顯揚十七有三心見道五十八復有九心見道此論下文復有十六心見道四心見道何以如此不同者西方二說一云其真見道離戲論唯只一心如五十八說其三心等皆假說相見道何以名緣非安立諦云何言從世第一法生何用三心各皆言斷麤重十六心等復言世第一法生而何所因述曰引時證異故說不同其真觀中唯一心是但以菩薩前加行先學人觀後學法觀入真觀中雙為二觀後相見道前之二心學前加行第三雙觀放真觀中又即真觀中人法各異麤細不同先學斷麤後方學細第三雙放義析真如有異故有三心故菩薩相見道三心不同真觀相難知相觀相易說義識真觀唯說三心假言斷麤重故言從第一法生緣非安立諦又為十六心者一菩薩相觀亦放前真前真之中分義用異無間解脫道皆緣相分生返照自體名自證分故相見道法忍法智學前二道類忍類智學自證分但緣前心類智雖緣忍生可以擬學解脫道之自證類忍准知學無間道心自證又二乘之人加行作十六心觀其入真觀亦唯生空一心後相觀中亦放加行學真觀者已如前說亦以真觀難說但說相觀之心假說為真故言從世第一法無間十六心生或十六心觀唯二乘相為非菩薩作其言九心者於中三釋一說謂四忍智品別有八心忍智合論故說為四類忍智亦然復依一止說故有九心又說法智品有四者既云品言明非一定此中意取四法忍類忍亦然合說忍數故有八種依法類智品復有八心俱解脫道故依一心說唯說一心故合有九又說法忍智計合八心斷下界惑故故合說為四類忍智品者亦八心斷上界惑故故合說為四後重觀前十六心事究竟故依一止說唯說一心總名九心其四心者此乃分諦而論非觀中為四至文可知其此會釋二家同此。",
    "X48n0796_009:0122c17_0-0": "第二說說三心為真見道者即取彼五十五文緣非安立等為證後十六心是假相見道三心皆言斷麤重者麤重有多種今說無妨思之可知云何五十八言一心文釋曰見道斷惑非如修位作九品見斷束煩惱為一品事究竟故總名一心亦無妨難諸餘相違一如前說如諸論皆云第三是類智此言法智者法類二種義有多端一斷緣上二界名類斷緣下界名法如言法忍斷下惑類忍斷上惑二緣理名法緣智名類如十六心依總相說三別觀法名法總觀法名類即此相違者是也依此三位思一切法其言一心家三心既為相見解脫道即翻前者是或別一心緣解脫亦得其三心家皆翻前名解脫思准可知唯第三心亦法二釋一別起一心為解脫道亦得或即相見中苦法忍是亦得義理無違又或說苦法忍斷惑世第一法生等於真觀中義說亦得說相見道亦得如前說一心見道家觀心解唯一品此中為一剎那為多剎那相續又二說唯一剎那又亦多剎那以事究竟故三心家如何問又六十九云法智見道斷欲界惑類智見道斷色無色界惑此之會釋如前論無別法智斷上界惑但有總言法智為無間道法智三位如前應知准彼釋此應思類解彼論次文問一切類智現在前時皆能了別色界無色界耶答若有曾於上界諸法善取相者即能了別若不爾者即不能了別諸法師多以此文既云曾習類智能了上界明知超越依類智斷若不爾者不能了別即云初修行次第人以法智斷上界惑此理不然諸論皆無以法智斷上界惑文今言分別但以智緣事差別觀曾修彼法以類智緣不曾習人不能了別但遮類智能了故言何必法智不曾習人遂緣上界其實法智斷三界惑類智但能緣法智生如此論下其言類智斷上界者此隨轉文非真實理其入見道依幾地如大論六十九彼亦有依身處又唯依初未至及四靜慮非餘未至及無色如下釋更有餘文同雖有中間無漏不言入見道以遊觀無漏故梵王居多散故其依五地皆是那含依未至地唯初二果若得初禪依七作意必那含果以斷欲九惑故方得究竟其那含超越人等亦爾為一觀斷修惑或當別斷如此道理至十二卷",
    "X48n0796_009:0122c17_0-1": "方解。",
    "X48n0796_009:0123b07_0-0": "法智中言解脫而得作證者雋師云此寄相說其證無為解脫如前一心三心見道二說如前可知今寄相言以法忍斷惑故以智為證解脫非真實理其類忍中此言緣法智諸論有言斷上惑者如前會釋論云又無相住有六種如文可知如大論五十八云隨信法行入見道為第六無相行非信勝解見得身證慧解脫俱解脫五得其名如備師云此從下向上說為第六非上從下此乃雋師云所未文見釋云大論約人為論故言隨信法行入見道此論約法為論直言見道故無相違未聞此中六種與彼六法不同彼以人此約法故別也彼云俱脫慧脫身證信解見得隨信法行第六此汎釋六種無相彼約六行即究竟道二修道三見道一此言第六無相見道十六心皆是彼言隨信法行者准下第十三法信行在已具資糧即在上品決擇分位何故相違答曰彼隨信法行入在見道不取隨信故此不同問曰下第十三言隨信法在決擇分位不入果差別何故彼五十八云入見道與向說異即究竟道二修道三人見道一人合隨信法入見道如毗婆沙云以行相等故合說四種道諦中論云聲聞以後得智說法雋師二說一即無漏心說法若爾身口之業亦應無漏如菩薩以心無漏故又釋此後得智種類名後得智若爾無漏智中何故不說今取後釋以二乘劣故無漏智不能說法又身口有漏非如菩薩以無漏智說身口業亦無漏故論云引經遠塵離垢等者遠塵謂見道法忍離垢謂法智大論八十三忍智通修道彼論文云謂見慢及我慢准義修道有不是明言修道即彼論中彼文亦解不作此言更勘讀未見文此約勝言。",
    "X48n0796_009:0123c11_0": "見法大論八十三有二復次說前復次云見法者謂二忍得法謂二智達法謂見道無間道堅聖謂解脫道後復次同此如此引釋並法師別記勘五十三六十三九十三並無此文疏上亦無此釋問四無記根中此四惑皆於末那中起論云於諸染汙靜慮定門等者此中意說由此四惑為門染汙靜慮門言所由此惑為所以大小二惑生長先際等見即六十二見先際分別見等所攝如六十二見中說慢謂於下界生慢謂自地為勝等如前會釋。",
    "X48n0796_009:0123c20_0": "疑謂疑煩惱前文云疑無明增故由無明而起於疑五上分結廣如彼釋今論云唯由第七中惑故起上二界第六中惑者此約欲界不善增勝無能治道第六中惑應自然生其上二界有能治道第六中惑應不得生有此妨故唯說上界言彼諸惑不應得起由第七惑故染汙第六第六故起惑釋疑文中言求解脫者且釋此若依實外凡異生生彼界中亦起此惑且舉求解脫者當起此疑何況餘凡此若未見諦即內凡異生疑即疑結若諸有學生彼界者且說為法執疑如上分結說又疑無明增故有學雖斷疑借疑名說無明亦如上分結釋又此約異生為論不通有學無妨何以得知者下文云於勝品所證為解脫不解脫等故知異生非諸有學又上文解經中若證真理非他導引自生決定故顯揚十九初未至有喜根非餘大論第十二支義論云淨白者謂淨靜慮依此論文說唯有漏如顯揚第二卷潔白謂淨靜慮及無漏顯揚約八地所有道合作法通漏無漏此論唯說有漏不言無漏此論前初開九門初是世間門於中別出淨白門故唯有漏顯揚是世出世間門故通漏無漏理實無違。",
    "X48n0796_009:0124a16_0-0": "支分建立中明禪支義名合十八假實合論如顯揚十九有開合廢立等大精體唯有七遍行受別境中念定慧善中捨不定中尋伺以此離為十八若約唯實通漏無漏體唯有六法以尋伺是假無漏位中無此數故准八聖道正思惟諸法師但以慧為體不得用尋尋唯漏故又言尋伺法麤唯在方便瑜伽下文定中無尋伺無發語言尋伺非無細尋伺知定中用尋伺為支體無漏位中支無十八等亦名四靜慮支亦名心一境性支義者利益義隨順義廢立問答者色非隨順利益定所以不名支識蘊為能所治皆取等故所以不取無偏利益能治義故想蘊亦爾無能治利益故受蘊中餘苦憂非利益等義又彼地無故行蘊廢立者此二十四不相應彼非利益隨順義增所以不取遍行五中四數能所淨等如心王相似所以不取別境欲勝解亦爾善中唯捨別除下定劣性強故所以獨取餘則不爾煩惱隨煩惱非能治故不定中惡作睡眠非能治順定所以不取增減四五者約超行故欲二障多故欲界不善二禪喜滿故動增又如八聖道中思惟以慧為體即以慧為斷惑支至下廣別釋尋伺以慧為體又約禪廢立尋伺唯初定喜樂至二三禪不至以上者此繫地法不至於上界不須釋妨問何故尋伺於二禪說斷非內淨等以內淨通無漏故又非障故不說斷內淨云何第二禪為名非餘定初義名如顯揚第二卷",
    "X48n0796_009:0124a16_0-1": "云為治尋伺故攝念正知於自內淨其心捨住遠離尋伺塵濁法故名內等淨體如大論六十三云內等淨以念正知捨為自性與前顯揚第十九卷文同第二義餘定不立內於內門中離沉浮三法平等令心品法淨名內等淨也顯揚第二云內體遍淨故立淨名如顯揚十九云念正知捨一切處有何故初靜慮等不立內淨答曰初禪中由尋伺門所引發故雖有不說第二靜慮中有踊躍自體之所作業及心所有少分煩惱所纏覆故總以內淨名顯之第三禪中彼心所有少分煩惱皆遠離故顯彼自相初禪雖離欲貪未離喜貪第二禪雖離尋伺貪未離喜貪第四禪中即此捨念極善清淨顯了是故於諸靜慮如其所應彼差別應知此與大論六十三文同第三禪既離欲尋伺喜貪何故不名清淨義曰以自地有樂故第四定地雖有不苦樂非障說清淨若非障何故不說正知故知不苦樂是障雖有羸劣第三異無剛猛障故其不苦樂受唯第四禪非下地者以下地有喜樂為利益支故不立何故第四禪不立正知此大乘無不立文毗婆沙有多復次且一義曰以不苦樂受體闇明暗相違故不立若爾何故立念捨耶以治下地樂故正知彼受正相違非念捨二法亦如大論第五十六有不苦樂受與正知相違文何故此二在四禪名清淨以樂無故非如第三禪其不取信輕安為支以有意地樂故無輕安以三法為內淨體故非用信數約廢立者心心所通無漏者無量何故唯七數開耶准下文且三緣故不用餘數謂對治利益所依由具此三支遂圓滿非待餘法餘法亦隨順禪約此三故不立如大論六十三第十九有無量復次且取此論文無繁廣引何故初三等五二上齊四初如大論六十三云問何因四靜慮立四支五支耶且如初禪住所依故謂尋伺住饒益故謂喜樂住自性故謂心一境性支如是諸禪隨義准知大有復次不煩廣引十地論同此論文諸無色等不立初禪所治有五如顯揚十九云一貪恚害尋二苦三憂四犯戒五散亂如大論六十三云一欲貪二欲恚害三種尋思三憂苦餘二同此何故相違者且如大義大論意欲貪與欲尋伺雖俱貪數然欲貪於五欲境起煩惱雖多為此增勝欲尋謂未會境是尋上欲而唯意欲故分為二顯揚意欲貪欲尋二法並有唯一名說為欲尋知有欲貪以俱時故又義唯說欲尋不說欲貪略故不論大論憂苦皆受苦二禪雖斷此障輕微所以合說顯揚以識起各異故別說苦是現行故第二禪障有五一初定貪二尋伺三苦四掉五定下劣問曰何故初禪障有苦第二禪復有耶如六十三云問何緣故知初禪中苦根未斷答彼品麤重未遠離故若於是處苦根已斷便與第二靜慮住時應無差別是故當知彼禪未斷初禪雖斷種子等非究斷麤重第三禪有四一第二禪貪二喜三踊躍即緣喜作意也四定下劣性第四定障有五一入出息二第三禪貪三樂四於樂發悟顯揚名於樂作意五定下劣性六十三與顯揚十九餘不相違如六十三抄其簡道品者至道品當會心一境性如大論三十六與九定相應名定與四慧相應名慧此中與定相應名定九定中何定也應第九定以功用滿故。",
    "X48n0796_009:0125a22_0": "等至建立中明七作意如大論三十卷廣說如彼抄廣有大義釋了相作意雋師云釋此論文似通三界其六作意唯上界大論此七作意其上二界非下欲會云彼於根本說故唯通上二此論通說以初聞思為方便以初靜慮中初作意有聞思所間尅體唯修慧故伽論從多說唯上二此論據實論是以了相即以聞思為方便雖有此釋仍未會釋若依三十三云此了相為聞思間除此已後唯用修相。",
    "X48n0796_009:0125b06_0-0": "釋勝解中結前文下牒定先已如所思惟發起勝解故知前亦是修慧欲界寧有若唯上二即三十三下文云又了相作意為斷為得發希願心勝解作意正發加行故知了相是欲界餘六方上二既得上定下惑不生了相既是上心下惑即應不起云何如發希願未令惑滅方為六行其勝解為加行道即伏上心正無間道當伏種子釋彼修定慧已文云其已上定未必己得何為加行心修習已至後方得雖爾論云六十二云近分攝六作意訖云此七始但初禪乃至非想又上隨順等四作意相收中與勝配同攝又力勵等四作意初一是不定地心若了相是不定地何故不云了相是力勵作意及有間作意收又三瑜伽中云了相者是已得定作意無文言欲界在二界時法也遠離作意中言斷上品煩惱及彼麤重者若無漏道斷麤重理更無疑若有漏道云何斷麤重釋云若斷上品心時先即斷此品惑令行者身中硬澁性斷令不得起令身調順又伏種子上麤重令不生現惑者名斷麤重不然此文唯約無漏為論第二復次釋觀察作意遠離增上慢如大論三十三云由樂斷修欲界煩惱於行住位不復現起遂作是念我於此惑為覺知不覺知於一諦境作意思惟不能違逆不能猒毀彼作是念我未正解脫為欲增斷為此作意若依如是文即已謂無煩惱名為增上慢今既誡已更復觀察令不起深計已解脫慢又二十八云云何離增上慢謂於所得觸證無增上慢離顛倒執於真所得起得想乃至真證亦爾是為離增上慢遠離此慢故即遠離三十三第三復次釋離增上慢解之取餘文可不此七作意第九袟中明通無漏者未見文觀察作意通勝進無間道據文思之可解若以修慧名作意此即皆是修慧若以修慧相應作意名作意此七以作意數為體如三十三遠離攝樂生時能適悅身離生喜樂於時時間微薄現行加行究竟轉時即彼喜樂轉增轉勝至究竟果遍身充滿生彼喜樂無有間隟云何與四種作意相攝者了相勝解二總名隨順作意大論第十一云第二十五作意若遠離究竟二名對治作意當二十六攝樂一種名對治及順清淨作意當二十七若觀察作意名順觀察作意當三十九此四作意如大論二十八云隨順作意者於所緣境深生厭壞起正加行而未斷惑若勘三十三唯勝解作意名正發加行初二作意隨順作意所攝了相亦起正加行豈不相違會云據實了相亦正加行即如二十八卷",
    "X48n0796_009:0125b06_0-1": "又隨順作意是加行今三十三就無間道隣近勝處說故唯說勝解不論了相據實無違又以了相聞思所間不如勝解一向修故據勝唯說勝解不取了相對治作意者謂能斷惑順清淨作意者謂心下蹙取淨妙相策令歡悅順觀察作意者謂順觀察煩惱斷與未斷此如大論第十一卷四十作意中廣說彼下文以四十攝七即四十中有攝七遍今以七攝四十故但攝四種不論於餘如彼下文相攝如決擇六十二有四道相攝與此勘之謂加行道等六十六四道相收復別以下取與四對治相收者如三十三云與四對治相收了相勝解二是猒壞對治遠離加行究竟三是斷對治餘三無文義准思之可知攝樂一種以斷惑故亦斷治觀察作意或是持對治是前諸品解脫道故亦得是遠分對治是勝進道故究竟果作意是持對治亦是解脫道故若以前無間道為加行道後心望自品為無間道者是則遠離攝樂等皆有厭壞對治義若除初無間道以去後為前解脫道餘四次第相望皆有對治義若第二無間道攝樂作意以去望初無間道皆名勝進道皆有遠分對治義勘下四修中文此作意若有漏者皆名伏對若無漏者皆離繫對治若無漏作意初二是加行道即有漏名伏對治餘無漏故名離繫對治若二乘人及菩薩一分為欲斷煩惱障及有漏等此七是煩惱障對治若菩薩一分為斷法執故名所知障對治與四作意相收一力勵運轉作意謂初修行者令心安住等住未得作意所修猶是不定地非七作意所攝二有間運轉作意者得所修已漸次勝進即了相作意所收由為聞思間故驗此文了相亦修慧三無間運轉作意謂了相乃至加行究竟四無功用運轉謂加行究竟果作意如二十八九說如二十八云與三瑜伽相攝一初修業瑜伽此復二種一於作意初修業瑜伽即初學業人住心一緣未得作意未證定心故知了相是修慧二淨煩惱初修業已得所修作意於諸煩惱欲淨其心即了相收二已習行瑜伽謂除了相於餘乃至加行究竟五作意中已善串習三度作意瑜伽謂住加行究竟果作意由此超過加行方便所修作意安住修果其與六現觀相收至下十現觀當說又與四十作意相攝如大論第十一卷",
    "X48n0796_009:0125b06_0-2": "廣說。",
    "X48n0796_009:0126b14_0": "論釋下地麁相中大論二十七有二復次麁相第一復次麁相有二一體麁雖一切地皆具五蘊而下界最為鄙惡深可猒逆二數麁下界色蘊有多品類等第二復次與此文同第三十及三十三云有六麁相謂義事相品時理等廣如彼釋義謂語中有如是義事謂內外二事相謂自共相白黑品名品過去未來現在名時四種道理名理此乃通論一切麁相廣如第十卷又有復次還同此文極有猒逆法用廣如彼論釋。",
    "X48n0796_009:0126b23_0": "品類中如顯揚第二卷廣釋不可繁引乃至生無色界無宮殿等以無色貪故等出世中謂於修道中法智類智乃至如實照了通達此中文意如從未至乃至無所有處有無漏非非想地八智與忍此八地皆有亦能斷惑如瑜伽六十三及顯揚第十九云唯依諸靜慮及初靜慮未至能入聖諦現觀非無色無色定中毗鉢舍那劣故非生無色界能入現觀彼處難生猒故如大論釋。",
    "X48n0796_009:0126c07_0-0": "六現觀中三依五依生西方釋云此三即智諦現觀邊現觀戒現觀其信通漏無漏思唯有漏究竟唯無學故故取前三五依者即初未至乃至第四禪不取中間禪及無色定以入現觀位故唯依此五五地入見道見道初入即得前三現觀所以不取中間禪者以梵王所居多散亂故下文中間雖有無漏非斷惑如非地想唯遊觀者又入現觀依地不說故又唯初靜慮近分能入非餘近分餘近分即皆有漏故初近分通漏無漏以聖弟子初無定故依未至而斷下惑從初靜慮以去為前有定皆依根本而斷煩惱不依未至如彼論廣釋其修道斷惑通依八地從初未至乃至無所有處故即彼論廣作是說聖人生彼上二界皆得起修智其非想地如大論有無漏能入滅定等此唯遊觀非斷惑如下斷惑中廣辨諸師多以中間禪亦入見道者不然未見文未尋理取小乘義故論云或於色界能現在前先已生起後重現前故者如第三卷",
    "X48n0796_009:0126c07_0-1": "釋滅定中廣釋四句中云何聖弟子已得無色定已離色界欲復生色界耶此中問意已離色界欲得無色定耶已得無色定後生色界耶總合作問故有此文初問即慧解脫人未得八解脫故第二問即第三果人以無漏道斷三禪已下惑伏第四禪以上惑得滅盡定二說如唯識第七卷釋雖命終生第四禪後依勝進道而得滅定問曰第四禪以上惑既以勝進無漏道伏以是遊觀故得起彼地無漏何故後生色界如凡夫起六行等時即不生彼地故為此難答曰聖人生他地以種子潤生故凡夫以現行潤生故不可例如前第三卷",
    "X48n0796_009:0126c07_0-2": "云云如第二卷抄一釋云此是寂靜解脫定者未必是滅定今依大論三十三解滅定中云若諸聖者已得有頂欲暫時寂靜住從有頂心與求上進無所得故心滅不起故知寂靜解脫定滅定論云由住寂靜解脫異熟者謂無色貪所感報四蘊異熟故名寂靜顯揚十八云無色定名寂靜等問中無色界滅定不現前者此約起依為問不約成依為問如大論攝論等若未建立阿賴耶識依者於無色界不發起滅定若建立依者即彼界入滅定此中更曾云就小相而非究竟極理如唯識第七卷",
    "X48n0796_009:0126c07_0-3": "廣。",
    "X48n0796_009:0127a20_0-0": "輭等三道中此謂斷修惑非見惑見惑迷理生故修惑迷事起故下智斷上惑如論文可解下智斷下惑其理當云何如第十三云建立二果中以三界惑攝為九品始欲界初品終非想始品如是合為一品豈不下智斷下惑耶答曰智有猛劣根有上下智劣根下如此處文智猛根上如十三卷智猛根上下道望有頂初惑還成下智斷上惑理實無違於修道中以無相觀斷惑大論五十八說加行道或有漏無漏或斷惑伏惑得擇滅等如常可解如大論六十九說有多復次與此文無違其無間道又轉麁重依得無麁重者唯識二解一云此時猶未捨彼無堪任性正現前故今言捨者正捨名捨如未起殺怨想二云此與障種已滅名捨勝進道中大論云或有無間為斷餘品修加行道此於前品名勝進道於後所斷名加行道此論云為斷此品後餘惑所有加行無間解脫道望此是勝進此論據實論遠近後三道皆前勝進大論約一道隣近顯說并出此觀後別起加行趣心語非於一觀即起九品道語又此中第二復次有三釋前二皆云或勤方便六十九或有無間中云解言或住放逸此論言或勤方便彼言或住放逸者此論牒解中或復於先所思所證法中安住觀察故言或勤方便彼論更有解云或有無間不修方便但於前品生知足想不求勝進即與此文同彼論放逸之言別復次釋彼論更解云或於已斷以觀智而更觀察亦與此文相當雖爾彼論言已斷此論云所證亦有相違取前復次釋勝設爾立勝進道漸漸增勝名勝進道既云或住放逸亦勝進道此論何用或勤方便之言細續更問勘唯識第十及六十九有四道立為章門四修中得修若小乘得修在未來今大乘得修謂現在世種子未能生上心修習此種令生現行名為得修現行之法修令增長名為習修如第二復次釋中初地道生現行令增名為習修安立自種展轉增長名為得修未必唯取未生現行時種子。",
    "X48n0796_009:0127c05_0": "四對治中此猒患對治謂有漏諸行法師通漏無漏聞思慧等此義不然此中義別聞思一向有漏云何通漏無漏聞思慧等斷對治謂加行無間道前解七作意中初二作意是猒患對治皆加行道遠離等三作意是無間道今既云斷對治取加行無間道猒患作意非加行道豈不相違釋云初二作意是加行道是猒患對治今此中斷對治攝加行無間道者取遠離作意已去無間道前無間望後無間是加行道故此二並斷對治雖前二皆加行道此中不說以猒患對治非正斷惑故。",
    "X48n0796_009:0127c15_0": "第二復次釋次十一種道五類中分二初解五類十一道後釋修義初文有二初列略釋後廣別解初文復二初列後釋列中復二初列後結屬。",
    "X48n0796_009:0127c18_0": "　　論本第十",
    "X48n0796_009:0127c19_0-0": "其與禪支相攝至下方會依佛地論第五卷菩提分法略三十七廣即無量於下一一門中別釋名廢立道品佛果四智因之為道此三十七並在因中助成果道故言助道法其通出體者如大集經乃用平等無分別智為道品體自餘道品終成觀行皆悉平等佛地論等第三卷若約實義一一智品具攝一切功德法若就麁相妙觀察智攝四念住四如意足觀察一切平等法故以三摩地為自性故平等性智攝四正斷雖用精進而為其性而由如來平等性智所攝受故無高下相五根五力攝在大圓鏡智平等性智覺支道支攝在平等性智若別出體諸法師出體皆並取十法信精進念慧喜輕安思捨戒三摩地以正思惟小乘取覺數此法大乘是有漏不得為八正道法此尋依思慧為體慧為正見支正思惟乃取思為體此理不然未見文故如大論二十九云正思惟是慧蘊攝又下文言毗鉢舍那收又五十七釋二十二根中云問五根三十七品為五攝三十七為三十七攝五答三十七攝五非五攝三十七不攝何等謂語業命喜安捨如是或六或四彼所不攝若正思惟是思數於不攝中應云不攝七法以二十二根中無思數故但以正思惟以慧為體故是根中慧根攝何故發語得通思慧唯取慧而非思以發五種蘊身故唯慧非思如大論今大乘三十七品以九法為體即信精進念定慧喜安捨道共戒或十一即開戒為三故雖正思惟如文以慧為體與正見何以異正見是分別支故釋曰正見觀中分別未發語言正思惟為他說法依此發語以無漏觀中非尋伺所發語故佛無尋伺故又唯識第七因中以尋為體其三十七於百法數相收可知慧開為九即四念住慧根力擇法正見思惟如餘法即開為八其四念住如此論及大論顯揚菩薩藏經多言皆以念為念住此論中念住以慧念二法為體大論二十八顯揚第二又以聞思修三慧為念住體聞思唯有漏修慧通漏無漏又菩薩藏二十八云念住以先觀察若准以三慧為體文念住以慧為體性有一念為體如大論二十九釋是皆根力中念根力即四念住同時增上法以此說體非真實理精進開八謂四正斷精進根力正精進精進覺支等定開為八四如意足定根力覺支道支合前三法開為二十五念數憶念功不獨守一位但開為四念根力覺支道支信開為二信根力合前三十一法喜安捨此三不開道共戒分三正語業命念住於四所緣安住其念慧心故名念住謂遍滿所緣淨行善巧淨戒如第十一卷",
    "X48n0796_009:0127c19_0-1": "廣說念住論文何故不增多減少者以除四種顛倒覺故何故最初明者猶願欲除此顛倒繫念心故最初明。",
    "X48n0796_009:0128b16_0-0": "此文及五十三蘊次第中以心為我自體法為染淨即下文修果中除四倒中心為常倒如大論二十八二文相違亦如是即彼下文為欲除遣於心意識執我愚者我事愚故立心念住即於心為常是我所依常事為欲除所執我心能染淨愚故立法念住即除我體若勘彼論上下文觀法為無我但除執我心非除法我體更有相違如第二卷末會釋依大論五十七云二十二根中於幾根處立身住等於七根處立身念住謂七色根於五根處立受念住謂五受於一根處立心念住謂意根於九根處立法念住謂最後八及命四倒以何為體乃至如菩薩藏十八大論二十八顯揚第二及十九四念各三等大智度論廣以二十四復次釋勘讀彼文如大論二十八修念住以三慧聞思唯有漏修慧通漏無漏諸論乃至五力皆不見通無漏文唯此念住念住修習中釋於內外受中復次取緣他身生受者此受望他有情亦是內收此中論文合作法如身中己身扶根塵別作法他身內處亦別作法皆名內外今此中合云如大論廣為此釋如大論二十八有六復次勘之又修習中此諸煩惱並無此數一一煩惱皆得此名或可別配思之可解其策心如大論等解念住中皆無此文唯四正斷中有策心持心策心治沉持心治掉今此中策心雙治沉掉彼文以開策心持心所以各治此論以合策持但為一策所以雙治問此下四斷中亦有此文相違何故次明正斷者如菩薩藏經菩薩為欲修慧時精勤修習故次須明四正斷如菩薩藏經亦名正斷亦名正勝如大論二十九亦名正勝道大論二十九釋四正斷有四種一律儀斷謂於已生惡法為令斷故生欲策勵等應修律儀令其斷滅二名斷斷未生惡法為不生故生欲等如前令不現前故為斷故斷名為斷斷三名修斷未生善法為令生故策心持心先未得善法數修數習令現在前能有所斷故名修斷四名防護斷謂已生善法為欲令住策心持心防護善法令不忘失故名防護斷修習者五句一一皆依四正斷說此如大論顯揚並有此文如大論八十三云欲者若於是處樂作樂得精進者發起加行其心勇悍言策勵者既勇悍已於彼加行正勤修習已生惡法中有此五句初三顯不定地中聞思兩慧下品對治後之策持對治修慧其沉掉相違如上未生惡法亦如前說未生善中上之三句是不定地聞思善法下之策持定修善法已生善中亦如前說五句一一皆通所依能依亦准通四其此中文既通四正斷策心持心治沉治掉如理准思。",
    "X48n0796_009:0129a11_0-0": "神足助伴中謂欲勤心觀如大論二十九云顯揚第二生欲等五句以斷行一一皆通四神足現行諸纏能令遠離而未永害隨眠是名欲增上力所得三摩地三世境能順生不善法順此境三品纏中其未至者為令不生已生令斷未永害隨眠是名勵增上力所得之定修增上捨觀諸煩惱過患善法對治是名心增上所得三摩地所得善法轉更思惟是觀增上力所引之定若准此文依四正斷如次配屬即合一一正斷皆有欲等五欲今此論取正斷欲勤等遂以五句而次配之豈不相違如大論云由是四三摩地增上力故等乃至為永害隨眠為得治彼善法更生起欲策勵等故無違其八斷行如大論二十九亦名八勝行此中如諸論更無相違何以此有正知而非對治遂取思捨而為對治義曰如大論二十九云緣過未不現見境思能對治若現在現見法捨能對治由此二因得能斷隨眠也又即彼論解八斷行捨中緣三世不染汙心平等復通不現見其實捨通緣三世思亦然彼解思中文勢亦爾但以彼論前解策勵中作現見不現見今別約此義非如實理故無違也若以思捨斷隨眠餘六為定圓滿而修習為二因緣修八斷行如下說且釋云此四神足未真斷惑於加行中起故如大論於止等相中思能發三業捨能捨惡法正知是毗鉢舍那品慧其實慧能對治今此中若發惡身口是名起沉掉煩惱等以正思發善身口遂能違彼惡身口故以為對治慧為知過因不說為對治體從增上說義不相違問其思既名與止觀俱身口業明知是定共戒未得無漏故非道共戒此八勝行皆為斷隨眠瑜伽而修習故為害隨眠瑜伽即四瑜伽如二十八說謂欲精進信方便初三次第配餘五皆方便廣如彼又為定圓滿而修八斷行此云引發止等相故修習以斯二論大同又八斷行智如斷隨眠斷行攝四瑜伽四瑜伽皆斷隨眠故知八種智能斷種八種智能得定別言思斷種然此偏約一義此中攝為四與四瑜伽異廣如彼抄不可會之。",
    "X48n0796_009:0129b21_0-0": "復次欲勤心觀修有二種雋師多釋其所取者此中依文數二種修前修所治後修即善修體且如勤斷二惡亦名正勤此中亦爾修斷惡法亦名為修即如文數聚散二法各有因緣并辨此等應云聚散并彼因緣今以順彼本言故以并字為始因緣者謂過患思相及於此思唯俱說體謂掉睡眠此中聚散如文可解若廣分別如大論二十四釋大好然彼論說五蓋此說止觀障若并曰流行觀散并因緣障定不同彼說然論云依觀察相者如二十四廣辨屬下經文正當有前後想如大論二十八云修慧時修習觀品有前後想謂住觀於坐坐觀於臥或在後行觀察前行此謂慧觀三世住勸於坐者此即以現在意觀未來諸行現在意位已生故名住未來法未生臨欲起故名坐坐觀於臥者可謂以現意觀過去行現在意臨欲滅故說名為坐過去已謝故說名為臥於現在世亦名為住亦名為臥者約已生為論望未來名住住已復坐望過去法現在名坐或在後行觀察前行者此即以現意觀無間滅現行作意已生作意無間謝滅所取作意說名前行若此無間新新生起能取作意取前已謝滅者說名後行此依慧觀觀察諸行論云謂依不淨想觀察髮毛等事屬下經文當上下想如大論二十八云即修定時修習止品上下想者謂觀此身如其所住如其所願上從頂上下從足下種種雜類不淨充滿謂此身中所有種種髮毛爪齒如前廣說當知此中為修止觀修彼二品勝光明想即當此處彼二所依隨順修恐心沉下緣上界諸天所有光明為令心舉策發其心若依彼此中不劣修觀品所攝即除前因緣并彼聚體不散隨順修止品所攝除前散體并彼因緣彼二所依即能除體義通止觀修其明正止觀相収二所依依此牒成遠觀修三種光明如第十一引經配中我之欲樂此乃總言乃至及上下想句句次配乃至不散隨順修開發一句結上諸句遠離以下配上彼二所依瑜伽第十一亦說五蓋多同此。",
    "X48n0796_009:0130a07_0-0": "五根五力義門如文為除五障能治唯五謂不信等五障故其力伏諸煩惱非成永斷不為一切天魔之所傾覆廣如菩薩藏經如大論二十九云信為上首餘精進等亦名為力經中說信根力即證淨中信故世尊依因果道理說非即彼體由得神足已其信等堅固能生聖智故五為根天魔等不轉業煩惱不能屈故名為力精進根力即四正斷中精進證見道加行故念根力即四念住中念能無餘斷一切顛倒定根力即四靜慮能為加行證不還果以初二果人未得根本定要第三果方能起通得定故說第三果准此例第四果亦然又略唯慮和合人非無學故慧根力即緣諦智得現觀證沙門果故七覺支如顯揚以次第束釋菩薩藏經廣說大論極略唯云此七三種觀品所攝謂擇法精進喜支精進策慧或出離至所到故喜動不順定相三種止品所收謂安定捨支安唯於定心悅捨唯平等相扶定故念支一種二品所收念為前六依故餘下八道支會釋論云念法唯無漏顯揚通漏無漏此約地上說彼論通地前說論云精進出離支下道支中是淨支何相違者二說一云以扶慧故但名策發二即速出離亦得斷惑喜法論云是利益如菩薩經云於法生悅心不沉沒生清淨喜身心安隱今以義思五修中得五果中得法菀樂者是餘支皆略於此論及經喜安二法道支所無至智方會此中依定得轉依道支中引發神通故據義別說理不相違捨法此中永除貪愛下文知所異也唯言永除貪愛者貪於集諦為勝故如第六卷",
    "X48n0796_009:0130a07_0-1": "會受中餘四通因果有無記性唯憂一種善惡是業非無記及果報故以無色法故無戒學所攝唯二學所收如下會釋此中皆自意非有上命何以無正思惟語業命唯道支耶如二十九云率爾智生名為見道長時修習名為修道由是因緣正語業命於修道中方始建立非見道正思惟體性唯慧能發語言見道雖慧可成發言義絕故亦唯修非見建立又不立信為覺支有何所以今且釋云信雖通無漏於覺支時名不壞信見道非語言故信三寶起語言故見道中不立若爾修道何無見道約七緣增勝故不立信欲等謂所依自體出離利益由不染依不染體不染約此七緣不說餘如大論二十九自辨以證淨為信不立大疑問覺支修習中此中如文顯揚云寂靜依止謂欲界寂靜依故離欲依止謂上二界離欲依故滅依止者已得三法無餘滅趣向弃捨者謂未來三法不相續非此論文相違義別釋故三法者蘊界處也七覺在見大乘何處即文者如大論二十九乃至於爾時獲得七覺支故名初有學見聖諦迹已永斷滅見道所斷一切煩惱唯餘修道所斷煩惱故知見道正見論云謂分別支如大論取見道無分別後得二智為正見體由此正見增上力故所起出離無恚無害分別思惟名正思惟即無漏思為正思惟體彼唯思惟如是相狀無恚等名正思惟若思惟發言論名正語若取見道正見等為正見十無學法五分法身正見與解脫智見身何異通彼正見唯緣一事此正見通緣理事故何故必同名正見體即是一此解未見論文更異同審思應出。",
    "X48n0796_009:0130c12_0": "十無學法中唯以慧眼緣理故慧身亦緣理即慧眼故智見身緣解脫身中解脫法者是廣有異同並如下解。",
    "X48n0796_009:0130c15_0-0": "正語業與命何異答無嗔癡所發身語是語業二若無貪善根及無癡一分所發之身語是正命五種邪命是所治一行者為利養故詐現奇特二為利養故數自說功德三為利養故占相吉凶為人說法四為利養故高聲現威令人畏敬五為利養故稱得供養以動人心邪緣活命名為邪命即正語業命名聖愛戒彼論云諸聖長時愛樂悅慕所證之戒名聖愛戒精進如前說正念此中為能治支於覺支中是所依收然覺支中雖是所依亦能治惑於善不忘即治忘念即此無違前據依義增後約治義勝各據一義故說不同此中三學所收大論二十九云正見思惟精進是慧正念正定是定語業命是戒又大智度論四念處前三為定門後一為慧門此論四念住俱以慧為體又大論七十八精進三學所攝法又論福德智慧中精進及定是慧學根力中前四為定門後一是慧門大論二十九七覺八道論念攝不同者據實七覺中言念通二依者是道支中約念法順定是定門據實不違勘第七覺支又智度論念處攝色受心為定門者何以前喜為慧門受攝不同者此大論約喜法動湧受是慧門智度論約多門論攝受法是定不分別喜又不約體語若約體者念住皆以慧為體約門攝語順相不同前三為定後一為慧大論七十八精進通三學又以通策故如成實論又福德智慧攝中精進策三學心咸是智法如上以定能生慧者名慧尅實福如第十二卷",
    "X48n0796_009:0130c15_0-1": "六波羅蜜中會又收根力中前四為定門者何以精進亦為定門此論為慧門如成實論精進通三學何妨前四根力為定門念法約順相如前會若爾何以大論精進為慧門約策發迅利順相增用故唯慧學據實通三至波羅蜜處當會釋餘會妨難問更思之其餘相收如大論同何以正思惟語業命非學支立如前覺支中會可知何以喜安捨非道支有見道初得法樂始起輕安頓斷諸惑喜安捨次第見道中增覺支故有修道說法義增久得法樂輕安先起諸惑漸除義有隱顯非道支故無三法若爾正見精進正念正定修道應無答若以初得之義見增非修學道求果修道殊顯修道故有正見等四法豈不見道以初得真智名為擇法修道雖亦緣理說法義增次名正見小乘以七覺在修道支居見廢立如毗婆沙此中義既新安住更推搆何以八外更不廣立約六緣故分別誨示令信淨障斷隨障淨功德約此六緣故不多立隨增義說善法雖有不增不立見道初覺真如但以覺支為稱修道已成聖數依八得彼涅槃但以聖道支名如緣起經下卷",
    "X48n0796_009:0130c15_0-2": "有八正道次第及所以勘其即通表無表。",
    "X48n0796_009:0131b11_0": "四正行中如顯揚第二云得現法樂住名樂謂四根本定慧均故止觀不等名之為苦與此文同此中或有根度地度人度皆小乘義非是我宗根度即利鈍根殊地度乃得禪差別人度謂初後果不同如那含入第四禪羅漢入第三互不相知不還以人度不知羅漢以地度不知或鈍根不還入第四禪利根不還入初禪上以根度不知下以地度不知廣如小論言遲速通等者遲速謂根鈍利通謂修行如大論六十三云苦速通已得行迹已見諦者復有異生未得行迹已得有情緣無量已離欲者若已證得生死智通是名智見清淨又樂遲通樂速通皆已得行迹已見諦者不言苦遲通有何異意法迹但以所依因為迹非所治故名迹餘論並同此無違九種定中二十六卷相違等如下第十一卷會之取會此處如第三十卷廣釋。",
    "X48n0796_009:0131c02_0": "論云調順中於散亂因色等法中者如大論三十色等者等取貪味五塵三不善根男女等相寂靜惡尋謂欲恚害等隨煩惱中即謂五蓋等平等攝持謂修習多修習故得無加行功用任運轉道不由功用心任運轉無散亂餘釋文同此然不同三十云六力辨九種心一聽聞力二思惟力三憶念力四正智力五精進方六串習力由聽聞思惟二力辨二心或三心謂內住即令住是一等住是一雖有安住未必取之以下文憶念力中有安住故以此義故二有義三以安住近前三力故無妨憶念力辨二謂安住近住故不得取安住此別解安住安住為二分一分通前二一分通後一正智力辨二謂調順寂靜精進力辨二最極寂靜專注一趣中習力辨一即平等攝持廣其次准文可知。",
    "X48n0796_009:0131c16_0-0": "復有四作意攝九心一力勵運轉作意內住等住中有二有間缺運轉於安住近住調順寂靜最極寂靜中有三無間缺運轉於專住一趣中有四無功用運轉於平等攝持中有此九幾未致幾根本七作意中如何配釋幾通漏無漏如文廣釋四種毗鉢舍那且汎釋云盡所有性先翻云如量智如所有性如理智普遍尋思謂有漏慧分別諸法周審觀察謂即前分別上委推求或尋思四尋思也觀察謂如實智或先有漏慧故分別後是無漏慧言周審或前亦無漏汎證諸法後亦無漏更細推求如大論三十卷",
    "X48n0796_009:0131c16_0-1": "云謂於淨行所緣境善巧所緣境淨惑所緣能正思惟擇盡所有性是名思擇若以此義論文七句後三別有體者不然後三即初句也謂即於彼所緣境界最極思擇如所有性名最極簡擇如論同於彼所緣境由慧俱行有分別作意取彼相狀周遍尋思於彼境界審諦推求周遍伺察亦同不違如大論八十三云廣說如聲聞地至十一卷會二十六三十七卷妨八十三牒彼云簡擇諸法者先釋擇法次釋簡擇已得無漏真作意故緣聖諦境一切無漏作意相應名為擇法言簡擇者總取一切苦法種類為苦聖諦故謂無漏智簡擇苦類為苦聖諦名簡擇諸法最極簡擇者先釋此句總言後重解極簡擇法釋總句者各別分別取諸苦故謂生老等解極簡擇法者依此處所簡擇契經等法謂依生等苦故簡擇經等法又簡擇者謂審定解了言解了者於所知事作意發語故最極簡擇者謂審定等解了解了既發語已方便尋求極簡擇法者謂審定近解了近解了者求已決定前是尋求道謂解了已來釋中前二句後是決定道謂後一句周遍尋思等下散釋不見文前三智皆通理事待後會之前二無漏慧且隨增說前是後得以緣事故後是正智如所有性故後二有漏慧前四尋思後如實智前二雖有漏亦有意取無漏後二無漏雖有意取地前或總地前或總無漏義理無違細勘讀之同如三十卷",
    "X48n0796_009:0131c16_0-2": "。",
    "X48n0796_009:0132b02_0-0": "如是毗鉢舍那由三門六事所緣其三門者一謂於教授教誡等暫爾思惟未思未量未推未察是名唯隨相行慧二謂若於彼思量推察是名第二隨尋思行慧既推察已如所安立復審觀察是名第三隨伺察行慧是謂三門若細尋之後二門隨二慧配之相約初相若如二十六云前二句有文是有漏等作無漏觀不作者初句即有漏前二句八十三及第十卷言無漏各非此初門收此初門約前二句有漏者語若言無漏有即不得言六事者一謂義即語有是義如三十三云諸欲有多過患等種義二事有二種謂內外二事此無解如三十三及已下文云內外事有內外貪欲彼解麤相中語此解一切事之內外不知同不三相謂有三種謂自相共相次下文同四品謂白黑品次下文同如三十三云如是諸欲皆隨黑品乃至憤諍等五時謂過去未來現在等法次下文同三十三云謂三世欲六理謂四種道理次下文同三十三云諸欲從無始本性麤穢不思議等是量名理何以如是有同不同者三十三據問六行中麤相解六相所以多約諸欲此中通一切論故有不同次下文解麤相六相與此文同更有諸文相違此三門六相攝一切慧如是六相四慧如論依三覺建立一語義覺六相中思義故有語義覺尋思事及自相故起事邊際覺六相中一全謂事一少分謂自相謂盡所有性以自性是諸法自體故共相是真如故非盡所有性尋思共相品時理故起如實覺即如所有性共相等名觀事體之理即釋前六相中自共相次下亦明不淨六相同三十三卷",
    "X48n0796_009:0132b02_0-1": "如下六相三覺不同思。",
    "X48n0796_009:0132c05_0": "問其六相通四慧不若盡所有性唯是前二慧若後二慧非六相若通相論六相智淨得大妨由論云三根中初根取十五心法師云何意見道取十六心初根取十五心耶俱未曾得同緣諦理以行未圓十六心方見道圓滿名見道已知重知名已知根取第十六心已去雖前三諦有重覆知然諦未遍緣未名重覆故十五心是初根第十六心已去名已知根於修道位得名曾得未曾得於見道位唯未曾得見道十六心皆未曾得以知重知名已知根第十六心是忍智相覆行圓故若言十五心為見道第十六心已去名修道者此小乘義如五十七云得初果時初根亦滅亦捨彼論前云未知根乃至第三果由數有者約超越人為論此據次第人故得果時捨初根無學果捨已知根亦爾准知其憂根體唯有漏非正根體論文云位中起故說之為體如身緣下界修決擇分善其信等意三受可得是四善根體此四善根皆是定法憂根唯散唯下界非彼善根時入觀已出定隨出何善根彼憂根緣涅槃起愁慼遂以為初根體。",
    "X48n0796_009:0132c23_0": "問曰憂根在欲界遂為初根體思觀在欲界亦為煗等初根體釋曰憂根居煗位不為煗等正是初根體但以位起為體非約實論其思觀唯下界四善根在色界麤細相異不可以位中得起亦為煗等體若思為初根體思數非是根故若如下十三卷文亦得思觀於煗等位起故得為體至十二卷當廣釋言隨一者如小乘有異義此中不然如大論五十七二十二根中云。",
    "X48n0796_009:0133a07_0-0": "間幾根未至地可得答十一謂信等三無漏意及喜捨以樂隱故不說其下引經中亦兼明有樂若爾有十三根根本初三靜慮有十八除男女憂苦四根第三禪十七前中除喜第四禪十六前中除樂空識無邊處無所有處有十一前中除五色此並漏無漏合說非想地有八前中除三無漏以不斷惑唯有漏說若餘處類斷惑無漏合說通漏無漏有十以義准除未知當知根見道無故此十根中九根除憂近上地多少故言隨一此中唯有說意此諸根成果非五識故不取苦根無學雖有義名無漏亦不取也此中已知根謂於修道乃至金剛定其此根亦具十根若以此文第三果人亦有憂憂根如大論五十七云如經言於上解脫希求憂慼乃至別解希求等四字已云此中預流一來於一切種皆圓滿故建立憂根若不還果雖有希求而無憂慼不立憂根唯善法欲故知第三果人無憂根此論言已知根者以初二果亦入已知根通法為論其實第三果人無若有憂者云何憂根離欲界時斷有義憂根能取三果即超越人義說第三果有非據實此下界人非上界又論主據學無學相對論已知根故有憂根非論實體其餘信等諸有漏者亦同憂根取無漏者不取何故不取者何故不同初根第二故通色界繫又初根加行故唯言加行道以有憂根亦通資糧道故思之論菩薩三根如五十七云於勝解行地建立初根此據通佛法實見道無間道未至十六心豈不名初根耶於淨增上意樂地建立第二根此據十地皆名增上意樂此意樂如第十三卷",
    "X48n0796_009:0133a07_0-1": "會於如來地立第三根此根中應說見道修道有漏無漏上修下當得下地亦修上如無色見道傍修等是義。",
    "X48n0796_009:0133b12_0-0": "依止修道分別修義者若依小乘見道依上得修下下未曾得故不得修上修道依下地道緣上地境得修修上地隨所斷惑地皆得亦得修下地且如未至禪發觀斷初根本惑時修上二地善根謂中間及根本一切上地修法如理准知若依此文唯論修道言依上修下所有善根不云見道若此文以為真實理全異小乘故修道不同故見道准知可解若隨他小乘義以此大乘無者此論唯據一邊又此修非生上界者唯身在下界者得若生上界聖人不退還故何須自在而修下善唯第三果人得諸靜慮已修道修諸善根其初二果如佛地論伏惑得第四禪起無漏道滋變易生死亦得上界諸定何故不修下地善根且釋不得其第三果久來離欲成就上地修道亦於下法自在得修習其初二果未離下地欲於下地善法現行自在何用修習若爾第三果人身在下地不現行起下地善根耶答起但入修道觀時令下地善法種子增長令得自在初二果人修道上地未得自在起故其修道未見不知是無漏為當有漏若無漏修道亦得修習見道何故不修如前准知大乘唯令種子增本識居見道位有五地善法種子何故不得修又修道隨斷惑地如發二禪發觀斷空處惑何故不修上若約此道理修道不得修上今此中唯約自斷惑修語不約發觀斷他地語問二十四種麤重分之為七如文可解下論文云由成就念為因故乃至於意所識法此中如善調等四句或有以念處四法一一相配或可一一念處皆有此四善調等此中意言始修行者最初以念為因於六塵中一一塵上皆能善調善護善防善覆勿令於此六塵而生忘念起諸過失有大論文未見繫得如實論一切麤重有漏諸法皆有麤重積習名繫得性若以縛諸眾生但以煩惱為縛非餘有漏若取強邊唯取煩惱若據實論諸有漏法皆名繫得離繫得者即諸涅槃之上假立翻繫得即是。",
    "X48n0796_009:0133c21_0": "金剛喻定文中為加行道如佛地論師八地以去無加行此云何通二會一通小乘金剛喻定說故有加行道以小乘人有漏道為加行道故二即菩薩無有漏加行智非無遊觀無漏而為加行道金剛喻定義一剎那隣生無生智者是加行道取何者取隣次加行無漏不取遠前又金剛定義一剎那云何金剛藏而是金剛喻定菩薩且釋云見道名一剎那起不多時相續非如修習地有分齊作行有多時數出入觀見道一觀便斷煩惱事究竟故名一剎那金剛喻定亦復如是義准可知問又金剛喻定為加行道者以能永伏現令不起義亦名金剛定尅實無間道斷此中加行道取末後加行道非餘若無間道生惑滅盡智應與無間俱答曰然仍不說已未全淨故於解脫道方說至下更可解若唯一剎那名金剛定云何前定須名無間由與加行合說故非此無間道一念名無間或無間後謂菩提非中間故又金剛喻定斷諸煩惱人法種子等分齊至斷惑處當分別及智起分齊勘佛地論第三卷心轉依法師以正智是心真如亦名心如說智及智處皆名為般若此亦如是至第十一卷當廣釋正智為真心故真如之性亦名為心麤重轉依謂擇滅道謂正智下轉依等當別釋三六轉依作四句等義。",
    "X48n0796_009:0134a19_0": "盡無生智通大小乘說漏盡人身中得名盡智盡智十智性緣漏盡涅槃故盡智六智性無生智亦然六智者謂盡智無生智世俗智法智類智及與滅智此上法師引薩婆多云今大乘思之不然其類智不緣涅槃如第九卷釋言六智皆緣涅槃者非也若如三心見道說第三雙觀此文說類智此智緣如前二心類未必類智唯緣法智生若以此義類智亦得據實義者此第三心非十六智中類但忍法智収以緣如故以總名說若爾類智不緣涅槃非盡智收有義法智滅智後得智為盡無生智用前智作世俗理不得緣類智還同前判以是義故並非緣如以起分別名言故如大論六十九云盡無生智當知唯於漏盡中生若不分別盡及無生謂我已得諸漏永盡我未來苦不後當生者唯是無漏唯出世間若作如是分別者唯是無漏世出世間世俗智攝是未曾得是阿羅漢相續中生且據羅漢佛亦如是又世俗智小乘無學等亦有體是世俗智緣涅槃亦得如佛世俗智體非世俗緣世俗故名世俗亦不緣涅槃約小乘人唯有五智除類智隨小乘義有六智若佛身中唯有四智除世俗及類智盡智無生智有是不是據是者不違如佛地論第三卷釋漏盡通力云若說漏盡相續中有四智所攝若說彼緣漏盡涅槃為境多分攝在大圓鏡智平等性智通力既爾智准可思無生智中文有二或字至下釋論即分出前十智性者後六智性者無生智既爾盡智隨知。",
    "X48n0796_009:0134b20_0": "十無學法中五分法身如常分別唯慧蘊及智見蘊何異義曰慧蘊謂觀於事智智見蘊謂觀理慧此不見文又釋見蘊謂緣如理解脫智見謂緣佛身一切無漏解脫法此但以多復次釋不見論文自餘出體等門易如前八道支中會釋五分法身十無學法相攝道支義如前會道四行中道相出相有何差別問十六行中下文以加行智為分別其後得智亦分別為十六行豈不相違義曰若以有漏無漏門無漏者無分別後得智雖語言仍無分別收加行雖無語仍是分別攝若以名言非名言門正智非分別後得分別收若以此義加行應是無分別以無言故但以有漏門是分別收攝論云加行智如瘂求受塵此非語言豈不相違如前類釋更有後得智妨思之問戲論亦二重如前可知此中依初入聖前十六行說名有隨眠等不爾無學身等豈不作有漏十六行前。",
    "X48n0796_009:0134c11_0": "　　論本第十一",
    "X48n0796_009:0134c12_0": "修多羅中唯言長行者如涅槃經云始從如是我聞乃至歡喜奉行皆是修多羅并偈頌等是未必唯取長行與此文違彼涅槃約通相修多羅此論約別相修多羅理實無違智度論此論同大論二十五同此此中修多羅并三藏中修多羅何者寬狹義曰若以名為寬狹三藏修多羅攝十二部經多故名寬十二部經修多羅唯一法故名狹若以體論寬狹此中修多羅攝十二部經故寬彼修多羅不爾又以此義此中修多羅攝三藏三藏中修多羅不攝三藏等盡。",
    "X48n0796_009:0134c21_0": "應頌中唯有中後而無先頌者法師判是此中收有義諷頌中收問諷頌中不說一句者一句乃成長行非偈成頌二句為顯二句亦得成頌言三句意未必欲取三句成但顯六句一頌半亦成若爾言三顯六何故復有六句之言有解言三句顯三句亦得成頌又釋言三但顯於下六句成頌復下言六句者為顯十二句成頌不欲取六句前三句中已顯六故若爾六句已上十二句已上豈不成頌耶答曰亦成此中但約少法為例多頌並成問大論與此同汎作法也。",
    "X48n0796_009:0135a06_0-0": "自說中無問自說既得成經無答自問亦應成經釋曰無問自說是佛說故成經無答自問異教主非成經若有異教主說佛與問答者成經唯有無問自說不有無答自問本事中依智度論宣說佛及弟子本隨形六道為猿猴等事本生中宣說佛及弟子實報身行菩薩行事此中本事約弟子本生約自身義局且別說也問藏攝中如此若聲聞菩薩合論七經修多羅藏如文可知若約顯揚大論二十五十經是修多羅除緣起論議何以十經七經有相違耶答義曰彼十經者說本事等自性故此七經者本事等三毗奈耶眷屬故如論文可知論文契經乃至自說此五聲聞修多羅藏收據實菩薩亦有法師云以聲聞乘由根鈍所廣明三學是契經如是等隨增說是聲聞修多羅有義且以二藏相對明修多羅方廣等二是菩薩修多羅契經等五是聲聞修多羅據實菩薩藏中亦有前五聲聞自藏亦明三藏十二部望方廣等亦未有故三十八云方廣一經唯菩薩藏餘十一分有聲聞藏此約眷屬彼約自性非相違也勘何所以毗奈耶自性可知眷屬說餘三如本事本生說過去本幻術等因緣事說過去等本因緣生事故眷屬毗尼收若顯揚十經者不別分聲聞菩薩三合法為論彼論毗奈耶唯一經者以說自性故此論以希法為菩薩藏大論二十五以希法為聲聞藏者以希法通說聲聞未曾有法故亦得聲聞藏收方廣不然唯大乘有八萬四千法蘊中如賢劫經廣辨始從修習行法波羅蜜多乃至最後分布佛體波羅蜜多合三百五十度皆有六到彼岸合計二千一百對貪嗔癡及等分煩惱一一皆有二千一百四法乘之有八千四百復以此數法對四大六衰亦名無義所生過失一一皆有八千四百以十法乘合有八萬四千論云百千名百千者梵語云一洛叉即百千也此土大數之名然合計當一億百百千一俱胝者俱胝謂梵語即千萬也即合計是京就別號亦名百億其八萬四千法蘊一一以千乘之即八俱胝四十洛叉計當八千四百萬大數乘之當八京四兆細筭之可知論云以千乘之其本但以十百二數之今就此言故知千也此如佛地論亦明。",
    "X48n0796_009:0135b19_0": "論云三藏聞思修所行境此大論同彼說修慧緣教說故論云此顯名句文身所攝經等教法為所緣境如此文教體唯以名身為體如初卷教詮章中辨此隨相語據詮有差別語。",
    "X48n0796_009:0135b23_0-0": "有分別影像緣等論文中云一向世間謂勝解作意法師云既云勝解作意明知是有漏見道已前勝解行地如大論二十云有分別影像者謂乃至由三摩呬多地毗鉢舍那行觀察簡擇極簡擅遍尋思伺察乃至為六行於此所知事知功德過失大論此文即有分別影像通漏無漏以簡擇如大論八十三卷釋唯無漏此論有分別是有漏大論有分別與此不同此據見道前語彼約通地前後語無違問論云無分別影像謂一向出世間及此後所得作意如此文即唯無漏如大論二十六云無分別影像者謂修觀行受取如是影像已不復觀察簡擇乃至遍伺察以九種奢摩他行寂靜其心勘與此論相違此論第十卷",
    "X48n0796_009:0135b23_0-1": "及大論第四十中釋九種定皆有漏始修行者所為大論以無分別影像觀為此論據有漏者彼論據無漏者據實通漏無漏又極簡等大論謂無漏二十六無分別觀不復修習如是有分別影通無漏名有分別如無分別得有影像緣四慧無分別而為九種定二論不同有漏無漏異者有四種慧通漏無漏如三十卷解四慧中不言無漏亦得通漏無漏下三門中相似有漏並如九種定會法師引西方無漏觀無影像家釋此文亦然能去內心有所緣慮相是心家影名無分別影像緣又無他分別影像名無分別影像若作此釋大論二十六云即此無分別影像亦名影像乃至亦名三摩地門乃至亦名光影云何言無他分別影像佛地論三家釋像待問錄之又無分別中既有影像之言明知非無分別智爾者云何言內真證智後得智有二分一反緣理二緣事反緣理者此是不論無分別智邊際如大論二十六云皆言如所有性盡所有性與此文大同如所有性彼唯真如此兼有餘行不同會之大意盡所有緣事如所有緣理更有釋待問一切行但言苦無常無我不言於空問所作成就此文謂轉依如大論二十六云勘彼相違抄文所作成就者謂於定慧修習多修習故諸緣影像所有作意皆得圓滿圓滿此故便得轉依一切麤重悉皆息滅得轉依故超過影像即於所知事有無分別現量智見生者依此文至果定慧圓滿得轉依即無影像云何前言有無分別二種影像皆通無漏若以此義應彼因中無漏亦有影像果中無漏即無影像應是正義且釋起有漏執影像名影像非無漏心因有果無影像及果後得亦無影像勘二十六抄也問彼下文云有分別影像即是此中毗鉢舍那品若說無分別影像即是此中奢摩他品事邊際即是一切事真實事所作成辦即是因果相屬事次下頌中常於影像靜慮即謂有無分別影此二皆說為靜慮又此論云有分別影像即謂勝解作意所有奢摩他毗鉢舍那。",
    "X48n0796_009:0136a21_0-0": "何以此三論文不同論文三解脫門中有五文不同如瑜伽五十五會空攝二行此一切論同無願攝六行無相攝八行法師云大論二文第三十卷不見尋伺地解無願收六與此論同列六名并有等字等者等取道下四第八袟中無願謂十緣取道下四無相有四會云若論文無相唯攝滅下四者以無十相名無相十行名無願者以有為故不願求論云無願收六行者唯於有漏生死法不願求故無相八行以通無男女及有漏相故名無相故收八行即滅道下各四行此中且會無願無相各二重一有漏無漏重二有為無為重如前思准前見修法師取三十三卷",
    "X48n0796_009:0136a21_0-1": "文云無願唯六行言等者於內等未必等取道下四行即與五十五同若爾無相攝滅四無願攝前六道下四行即無所收義曰道下四行無法收無十相故名無相道下行有生滅法非無相有漏諸法名界繫是生死界無願求不希生死名無願道下四行非有漏界繫非無願故無法收義出多端何勞一准問會問此中斷惑如六十九十智中如五十五抄會用空無我即通四諦空行應攝十六行以遍諦故正智具不具法師云正智唯有空行觀無餘二行觀大師若以正智義說亦具三解脫門別作非正智故大論解外五法中若以解脫門言之則出世正智所攝又釋此文或約緣諦別觀故亦是出世正智問思之依大論二十八云有有二種謂有為無為於有為中見過患故無所祈願依此建立無願解脫門於無為中建立無相門若約此文苦集道合十二行皆無願會正法約總語又說不說空以空惑故大疑問顯揚第二卷",
    "X48n0796_009:0136a21_0-2": "論云空行攝苦下二即二我不可得無相擇滅可得無願謂苦二及因集生緣又云空道作道下四此亦是空行無願作道四行亦無願行無相作道四行亦無相行若無差別總名空無相無願者此通聞思修所生之慧世及出世若名空無願無相三摩地者唯是修所生慧通世出世若名空無相無願解脫門此唯出世應知且以義思道下四言通三門者此非空行緣無我等道此謂緣空行等之道以重空解脫門故顯揚中空行攝二無我即遍四諦空若十六行還攝二行二行下文不論明知不在空行中收無相收滅四及二無我性此謂緣諦下真如是非十六行若十六行唯緣滅四無願緣有為不斷惑不遍緣四諦唯有六行道下四行緣道者不出三空之心是故道下四三門皆收隨彼行相收故不緣三空之道者此中不論此中即重三門也以此義道下行無相無願等不收者此論三門合云細尋思即知無疑。",
    "X48n0796_009:0136c16_0": "淨行所緣中如大論二十六七卷廣說乃至有六種不淨等尋之并十六持勝斯名勝行善巧所緣如大論二十七廣釋決擇文見之未得忘淨惑所緣如大論二十七廣釋彼唯有六行四聖諦而無真如彼問云何謂此諦唯諸聖者以此為實苦集等聖者實之名為聖諦愚夫不能實知故論文其如十六行者如上法師云真如謂正智觀四諦謂後得觀先聞法師釋謂正智觀唯作二無我不別緣四諦唯一真如既斷四諦義說為十六行如前第九卷初會釋約詮說為四諦義亦無違四道理如攝論廣明無異。",
    "X48n0796_009:0137a02_0": "分別尋思如實智此大有異非二乘能有如攝論廣起位次第體如決擇分善以慧為自性同時五蘊如理准思大論七十二廣明五法中云如實智正智所攝尋伺分別所收法師云若依攝論等尋思在燸頂實智在忍第一法決擇分善是有漏云何實智正智收義曰此約後得智說後得智亦作尋思如實觀以實智隣近見道收又釋大義曰尋思位智未決定實智位智已決定實智為正智收非尋思也有何差別顯揚第十六卷云於尋思中前二離觀能詮所詮別觀故後二合觀能詮所詮同一自性差別觀若義不爾何有色等名故顯揚論云此名為此義故於此事中建立為令世間起相見言說故若不立色等名言諸世間無有取知是色等以起執故故有言說知為實事成如實智乃至廣說遍計所執諸法體不可得非有性不可言說自性成就非無性由勝義故非有色依世俗故假立色乃至有無色門盡當知。",
    "X48n0796_009:0137a18_0": "問何故尋思中名事不言假立自性差別帶假立言義曰以初二別觀不言假立後二合觀故假立言又初觀未為假立但觀不相稱後觀但為假立大義未知問論文自性假立中初言能所詮相應中後言但於肉團等名言因中起此名言故者此為二釋如所詮為能詮名之因故起名言不言名言為所說因前解言為所詮因後解所詮為言因故便別解未必用二文義又眼等自性以下雖文唯結所詮為言因下名言因義有更互為因義釋曰由色為名言因故起此名言此謂所詮為言因言即是因由與所詮為因故起此名言此乃言為所詮因熟細尋文餘准類解。",
    "X48n0796_009:0137b05_0": "於尋思中以知名等不可信已有智生何故如實智位方言如實智前雖有智未決定於此智起方得決定乃至四智等出體如理准思初二是方便次一是燸頂忍次持任鏡明依中前四在決擇分位後一是見道中前三是世第一法下問答內文中有次地前後二見道論文言前四是此地因後一是果者以明是地又釋第四明亦是地前如論文可知泰法師云引大莊嚴論與此同真諦師釋入第二僧祇初僧祇滿心語故言超過第一非即入彼第二僧祇如等覺三祇內仍言等覺菩薩超過三僧祇豈即是佛位居僧祇外意欲釋依入初地故如從由先積集已方入見道故有超過之言非不是初僧祗內如餘處此第一法等居勝解行位攝論解五種覺地中勝解行地者謂初阿僧祗企耶修習業分勝解勝解既居見道前初僧祗劫世第一法即在此中顯故乃言第二僧祇劫也又除能取論云既以位判與所取別除。",
    "X48n0796_009:0137b21_0": "問曰所取實塵無非實有由心起執境從心起塵既無有見心亦無即同時除何故言別時除義曰當除所取之時能取之心非有所取遍緣而能取心亦已先除為境從心生故未以觀心觀能取無後至忍等方以智觀能取非有如是次第餘如攝論及疏廣釋。",
    "X48n0796_009:0137c02_0": "第五善巧謂前際等者此中大意由前世修習領受力故後身便得出離涅槃自悟如來方便密意六度福慧相攝門智度論等多論不同更問廣辨且如此中論文云由勤故修習對治由定伏惑由智斷惑種此中據實義解如八道七覺等中種種不同略如前會其餘相收更待思問。",
    "X48n0796_009:0137c08_0": "施相中種性謂法爾種性願謂發菩提心即有種性此通餘五如仁王經性在十行施自體如文以三業為體或有以慧為體據實是無貪善根性初三業及慧出體者此上出體非約實自體為論如下第十二卷說六種體其定慧中先辨自性後相求故四種薩般若中言道中能感定者前五定感其慧。",
    "X48n0796_009:0137c14_0": "言自性者乃至即所行施究竟圓滿此中二意一義曰以因中行施時由慧力故後成一切智時其一切智種以施共成一切智故說施能生一切智性二義曰智種子自是慧生據增上緣施能助成就法身故亦名自性依智度論釋鉢羅若謂理慧毗鉢舍那謂觀汎簡於止般若謂因中智彼薩般若謂果中之智釋詞離過中言遠離不平等追求等過故者如下最勝中合當方便最勝此謂求惡因自在天等過故。",
    "X48n0796_009:0137c22_0": "又戒等離過中謂遠離我增益等者此有二釋一義曰由持戒故能遠離增益我心非持諸狗等戒二義曰唯言戒等離過遠離增益以施後有戒故次言戒等此下慧偏簡取釋增益執則慧過耶故言隨其所應如大論慧除增益損減故知是慧過如攝論第七亦作是說此等與此無違。",
    "X48n0796_009:0138a04_0": "不共詞解戒中有二清凉一涅槃名清凉故論云涅槃所依二戒即清凉故論云遠離一切忿熱灰故大論八十三言與清凉義相應故。",
    "X48n0796_009:0138a07_0": "　　第十一卷法品",
    "X48n0796_009:0138a08_0": "科品次第如初卷解此品有二初問後答答中有二初明三乘通法後明菩薩別法復次何因緣故十二分聖教中方廣分名菩薩波羅蜜多藏耶下是初文有三初因前所詮諦理辨能詮教法次如是三藏為誰所行境耶下乘前所辨以顯能所緣行法後云何於諸法中法善巧云何義善巧合辨文義等善巧初中有二初明十二分教後明三藏相攝等義初中初標列後別釋契經中有二初辨後問答三藏相攝等中分三初三二藏相攝次建立三藏所因後法蘊之量。",
    "X48n0796_009:0138a18_0": "如是三藏為誰所行境下第二段乘前所辨以顯能所緣行法中分二初明資糧位後辨四種道理下加行位初中有三初辨二非法能緣之體次辨於法能緣行相等有所緣等是後別顯於法所緣差別第二辨於法能緣行相等中有二初標辨後顯成顯成分二初引經四義後別釋之於法所緣差別有二初問後答答有二初標後釋此乃前卷所明止觀行別釋中初遍滿所緣定止觀體後之三種明正修行修行分三如次乃是初中後修從次方入加行位故後加行位中有四道理四道理加行位之方便四尋思燸頂位四如實智忍第一法後五瑜伽通前方便根本二加行位能入見道道理有二初標後辨辨有二初問後答答中有二一標二辨尋伺實智各三初標次辨後結五瑜伽有二初問後答答有三一標二辨三配因果辨中為五古解初四四善如次今解不然初二是欲入善根方便鏡在燸頂明在忍第一法故或鏡在初三明在第一法解明問答中初問云何修學於見道中證無所得非問第一法印二無得後答中初明資糧第一劫滿次明聞法持如理作意任二方發等持等持已下始引燸頂忍第一法故知持任前根方便答文有二初解後證解中初解初位第一劫修後解持任等四於中初解後引經。",
    "X48n0796_009:0138b16_0": "第三大段文義善巧等中有二初明善巧後明安位初中有三初釋論師為五問生下次答引經由五成四法後別顯之安住中初問後答答中有三初論家自釋安不安住次如經言大德當知下引經釋安不安住乘文便故先釋安後釋不安後是故世尊因住法苾蒭下引經釋成前住法義有三初引經證若有具得下論結不捨瑜伽下牒釋。",
    "X48n0796_009:0138b23_0": "第四大段明菩薩藏法中文復有六初廣明名體第二明乖違方廣第三釋方廣密意第四明了决方廣第五明方廣果第六明方廣生福初中有二初明自體後明方廣名明自體中有二初略後廣略中初問答波羅蜜多藏後問答說處初問中問何因緣故十二分教之中方廣一分名菩薩波羅蜜多藏也波羅蜜多行也藏者教也因方廣分名波羅蜜多之教也據實諸分非不此藏方廣全故所以偏說廣釋中有二初問後答於中二門初明五相後明四相唯識有七同解深密攝論有六種相菩提心中收此中有五第五三業自體非相貌是體相二種合說唯識攝論等但說相貌所以不取體體自有別門故問善三種一巧便勝二迴向勝三清淨勝此三願中收故以別出體故合此也唯識論正不言種性唯說六者二乘無性應成到彼岸又以後說四相明不定廻向等四相中初二因於果相後二果體用相此中據果圓因中亦分得如理應思。",
    "X48n0796_009:0138c16_0": "釋通名中如攝論二復次解深密等文中有二初釋共詞後釋不共共中有五復次無盡廣慧經即大般若後六會也遠離我增益等者謂諸持戒令我解脫我是增益故邪忍邪精進等皆准此知十二段中不求世樂出凡夫又最上出二乘彼大果故今解正求世樂行最為大無間勝中古云利自他無間缺今利無離阻間隔故令他施果或由自他無二所以修無間常時也如廣大第一常故無難勝中由過去隨喜施等不為障故所以無障難發起勝中唯言上品忍者以世第一法唯一念不可分行又無可形唯上忍位時長有下可形故論說離二取相故第三復次最勝所作蜜多勝作義故即作行彼岸又蜜多勝到義即到果彼岸第四復次到所知彼岸此當攝論第五教彼岸雖行能離橫以教為先故說不共中他所發智從他言音慧是聞慧如理作意是思慧修慧即內證智攝所以不別說又解下如理作意攝又解初為隨信行三慧後為隨法行三慧。",
    "X48n0796_009:0139a10_0": "大乘阿毗達磨雜集論述記卷第九"
}