{
    "X53n0836_007:0085b15_0": "俱舍論疏論本第七",
    "X53n0836_007:0085b16_0": "大慈恩寺沙門　神泰　述",
    "X53n0836_007:0085b17_0": "○分別根品第二之五",
    "X53n0836_007:0085b18_0-0": "自下有十二行半頌辨四緣於中有三初一行半頌舉四緣數生四緣體文中初結前問後次舉頌本後釋頌本文中有六初釋初句文中初問此四緣於何處說次答謂契經中說後釋經中性義此經中性者是四緣種類種義是性義二釋第二句於六因中除能作因所餘五因是因緣性三釋第三第四句等無間緣性於中有初生緣性釋頌本除過去現在三無學通名羅漢臨無餘涅槃時最後一剎那心心所法以諸餘過去現在已生心心所法是等無間緣性二釋緣名義初總述薩婆多釋心心所緣生之法前後多少相似故名為等中間無隔故名無間依如是義立等無間名正理論云謂一相續必無間緣二法俱生故說名等此緣對果無同類法中間為隔故名無間由此前後多少相似方立等無間緣故舉色等皆不可立等無間緣以前後多少生不等故下指其事謂初念但有欲界無表色第二念入有漏初定時有欲界色界二無表色若第二念入無漏初定時或無間生欲界無漏二表色以諸色法前後多少雜亂現前等無間緣生無雜亂故色等不立等無間緣二別述尊者婆須密多羅作如是言於一身中初一長養色相續不斷後更遇長養緣復有第二長養色生與前長養色不相違害雜亂現前故不可立等無間緣二述大德釋於中有七初述大德釋以諸色無間生起或少或多等二問豈不心所無間生時亦有少多品類非等謂欲善二十二不善心品中心法二十一無記說十二三性相生少多非等或從有尋有伺三摩地入無尋有伺三摩地等從多生少三答此於異類實有多少然自類中無非等義下指其事謂無少受生多受等四問豈唯自類前能為後等無間緣五答不爾六徵云何七釋前心品法總為同類異類等無間緣非唯自類前文且於受等自體類中無少生多以釋等義。",
    "X53n0836_007:0086a02_0": "上來雖有七文合為第三述大德釋自下第四述相似法沙門義文中初述彼義唯執同類相續者說唯自類有等無間緣心唯生心等又若從無染無間染生此染心中所有煩惱用先滅煩惱為等無間緣下引類釋如出滅定心還用先滅正入滅定心為緣故次論主破彼說非善初無漏心前無無漏心故應闕此緣而得生故應初無漏心不具四緣也正理論云且初無漏等應不生無等無間緣為能取故既爾解脫畢竟應豈不如無同類因取而有無漏初心等生如是雖無等無間緣取何妨無漏初心亦生此例非等緣初無漏心及心所法有所緣故如餘一切心心所法定四緣生執同類宗二事皆闕此心心所如何得生非有極成心心所法從三緣起可為同喻是故解脫畢竟應無若爾唯應此心心所生由異類等無間緣如無同類因唯異類壽是此亦非理種子理故立同類因有漏不應為無漏種故非許此有同類因等無間緣由開避理同類異類皆有此能與所牽生力無別故諸心心所隨其所應同類異類皆能引起許皆能作等無間緣於教及理并無違失無無想等喻與法不同謂不相應非心心所故不能作等無間緣沒及出時心心所法可還用彼生及入時心心所法為此緣起餘有心位剎那剎那等無間緣曾無暫闕何勞以隔越為等無間緣夫等無間緣謂與處牽起異類心等與處牽起義同而非等無間緣斯有何理。",
    "X53n0836_007:0086b02_0-0": "上來明唯心心所為等無間緣色法雜亂故非等無間緣自下類釋十四不相應行亦如諸色雜亂現前故非等無間緣三界及不繫四種不相應行可俱現前故正理論云若爾命根無二俱起何不許說等無間緣此例不然命與生躰俱先行力所引起故謂此命根非無間滅命力所引要是先位所作行業力所引生既爾命根應一念頃一切頓起一切同依一念行業力所引故先業所引心心所法起應不藉等無間緣且諸命根無頓起失即由業力生決定故因果法爾一剎那業引多剎那異熟令起又無用故命不頓生謂為任持同分故引命根起一命相續足能任持多便無用心心所法雖先業引而非不待等無間緣託諸根境而得生故既託根境和合故生沒多並生亦非無用然無第二等無間緣故同類中無二俱起又心心所非唯先業力所引生異熟及餘雜亂起故若不更託等無間緣未應一剎那有多俱起謂命根體唯是異熟雖由先業力所引生可言同類決定而起心心所法無如是事異熟滅已有等流生等流無間有剎那起或起異熟非定同類故心心所雖有異熟生而亦不可言與命根等正理論第二十卷",
    "X53n0836_007:0086b02_0-1": "云二定何緣是心等無間而不說是心等無間緣由心等力所引生故如心心所生必繫屬前心滅故非如色法可與餘心俱時轉故非如得等可有雜亂俱現前故非如生等是餘伴故然心方便加行引生故可說為心等無間與心等起定相違害故非心等等無間緣問如名不亂起味句亦然何故不立等無間緣答如化主化人同時言語一時得起多名味句亦亂起故非等無間緣上來雖述四釋合為第二釋緣名義等無間緣體以過去現在除三無學後心餘四十七心心所為體然無等無間者等與無間俱是果名故下論云第一自者謂無心定出心心所及第二等二定剎那是心等無間非心無間故知等無間俱是果名而名無間者等無間是果緣是其用此從果及用為名也然其果名等無間者依正理論有五釋故彼論云謂一相續必無一類二法俱生故說名等此緣對異無同類法中間為隔故名無間若說此果無間緣生名無間者生無想等心等望前應非無間或無等法於中間起名等無間是二中間無容得有等法生義或前俱生心心所品等與無間後品為緣非唯類同名等無間唯執同類相續者說言唯心心所二自類前能為後等無間緣或法前等而無間彼法可立等無間緣謂現行心若此所繫或非所繫俱行受等此皆同故名為等無心受等同一類法二體俱生色法不爾謂一心時有欲界繫及色界繫二色并生或欲界繫及不繫色俱時而起故色無有等無間緣解云初釋後果必無同類心受等俱生同類果必一法故說名等此緣對果或有異類中間為隔必無同類中間為隔故名無間第二唯約定前心釋以定前心望二定及生定心心所中間或無心心所等法於中間起從無自類為名故名等無間第三釋前俱生心心所如聚等與無間同類異熟為緣非唯同類名等無間等是齊等義無間是隔義此從用及無他為名也第四唯執同類者言唯心望心唯受望受三性及漏無漏等與同類無間果為緣故名等無間此從果為名也初釋彼同類果無多少故名等合第四釋後果體類及性類皆同故名為等第五唯約現行一念緣說初及釋現行一念心若此三界所繫或非所繫俱行受等與此皆同是受等義故名為等下順釋無心受等同一類法二受等體俱生故名等無間間之言隔無心受同一類法漏無漏等間隔雜生故名等無間以此等無間法為緣名等無間緣此亦從無自類為名也此五釋中前三及第五是薩婆多第第四是相似沙門義又前四釋俱舍具有如文可見。",
    "X53n0836_007:0087a17_0": "自下大文第三問答分別於中初問辨未來世非等無間緣第二諸阿羅漢下問答辨羅漢最後心非等無間緣就初辨未來世非等無間緣中有六初問何緣不許未來世有等無間緣二答以未來法雜亂而住無前後故三問答未來世無前後者如何世尊知未來世此法無問此去應生。",
    "X53n0836_007:0087a23_0": "自下第四有三師釋初述薩婆多釋此過而現知故是第四定凡智所隔論立破若爾世尊未見前際於後際法應不能知次述餘部釋有餘部復言有情身內有未來世果因先兆是不相應行蘊差別佛起欲界等智唯觀此現在先非便知未來非要現由根本定起生死通慧定得知也下論主破若爾諸佛便於未來占相故知正理論云復有餘師為如是說有情身內現有未來果因先相由如影像或色或心不相應行佛唯觀此便知未來非要現由定慮通慧然非於彼占相故知以於未來現證見故非占相智能於所占現前證見分明記別後述經部故如經部諸師所言世尊舉意遍知諸法非如薩婆多比非如餘部占論主評取此說為善下引經證諸佛境界不可思議。",
    "X53n0836_007:0087b13_0-0": "上來雖述三師合為第四釋第三問自下第五重牒前宗指事為難若於未來無定前後次第安立何故但言世第一法無間唯生苦法忍不生餘法乃至金剛喻定無間唯生盡智不生餘法六薩婆多釋若此果法生繫屬彼因法要彼因無間此果乃得生如芽等果生要藉種等然此芽等色法亂故非有等無間緣未來苦法忍等亦爾雖要藉世第一等生如婆沙說且如未至定未來世中世第一及苦法忍皆有眾多不知何世第一生何苦法忍亦以亂故非等無間緣正理論云若執未來有定前後如何世第一於苦等彼據何界說定前後非未來治前後可成謂非未來世第一法於苦法忍可說前後以彼本唯一世攝故夫前後義歷世方成世第一法至已生位苦法智忍方名為後故前後義於未來無等無間緣由此非有又設未來有定前後亦不可立等無間緣如芽等生屬種等故雖有前後而無此緣若此法生繫屬彼法要彼起已此乃得生故等無間緣唯生已方立若爾未來應無異熟因由此因果定有前後然非未來有前後故無斯過失雖定前後而不約之立此因故謂雖異熟因定有前後而不約前後立異熟因若爾如何立此因果謂如是業因感如是異熟此相可說亦未來故於未來亦可安立然約法性預說未來此因前生此果後起因已生位果後義成爾時方名真實前後非未來位有異前後諸因可說未來有者彼因不待歷世而立如俱有因相應因等豈不俱有因待中世而立此責非理不了義故以俱時有故名為俱有因是更互相望為因果義。",
    "X53n0836_007:0087c16_0-0": "上來雖有六文合為第一問答辨未來世無等無間緣自下第二問答辨羅漢後心非等無間緣文中初問諸羅漢後心何緣故說非等無間緣二答無餘心等續此起故三舉意界例豈不如是無間滅心亦名為意後心無間識既不生應不名意四薩婆多釋意是依所顯非作用所顯正理論云或復能牽能與等無間心心所處名等無間謂正滅時心心所法能與在正生位等無間法處名等無間緣諸阿羅漢最後心等於正滅時無有正生等無間法故不可說等無間緣若爾無想及二定前心心所法於正滅位正生位中無等無間心心所法望沒出位諸心心所應不可說等無間緣無斯過失沒生心等定當生故生入心等於正滅位即能為彼等無間緣由不相應中間為隔沒生心等不得即生彼若生時名等無間故此可說等無間緣或此滅時彼雖未起中間隔越而由為此等無間緣力所取故義已可說等無間生有餘釋言無餘心等續此起故諸阿羅漢最後心心所非等無間緣然非此心更無後念諸續生故有非意失以立意根依所顯故然最後心有所依義闕餘緣故後識不生等無間緣作用所顯若法此緣取為果已彼法無間必定當生彼所說因都不應理若闕餘緣故後識不生則唯具餘緣後識應起既不如是應說此心由闕餘緣無此緣用此緣無故後識不生何乃說言無餘心等續此生故非此緣體若謂最後心亦能取果唯餘緣闕故後識不生如是所依得名意界亦應說是等無間緣等無間緣作用所顯此既有作用餘何不續生由此彼應更說餘理故前二釋為無遍因。",
    "X53n0836_007:0088a20_0": "上來初辨未來世非等無間緣第二辨羅漢心非等無間緣雖有二文合為大文第三問答分別自下大文第四四句分別於中有二四句初以心等無間果對心無間四句分別第二以心等無間果對定無間四句分別正理論云二定剎那前望於後何緣不立等無間緣諸念皆由前心等引不能後如前已說又最後念應無果故出心無果無斯過失豈不已說此非心等無間緣如何可言最後念定出心為果又出定心依前心等加行起故不可說作最後剎那定所引果入定心等望出定心非無間滅出心望彼如何可說等無間耶無等無間緣於中為隔故無間等無間義各有差別前心等力引後法生後心名為前等無間剎那無間立無間名是故二言其義各別故作是說若法與心為等無間彼法亦是心無間耶應作四句就初文中初問若法與心為等無間果彼法亦是接後心起心無間耶次舉宗答應作四句第一句者謂從二無心定出所法及第二念等二定剎那從等無間緣生故是心等無間果不接心後起故非心無間第二句者謂初念所起二定剎那及有心位諸心心所上生住異滅接心後起故是心無間不從心等無間緣生故非心等無間果第三句者謂初念二定剎那及有心位心心所法為俱是句可解第四句者謂第二念等二定剎那及二無心定出生心心所上生住異滅為俱非句可解。",
    "X53n0836_007:0088b20_0": "次下第二以心等無間果對定無間四句分別文中初問若法與心為等無間果彼法亦是接定後起與無心定為無間耶次舉宗答應作四句謂前第三句初念所所起二定剎那及有心位心心所法從心等無間緣生故是心等無間果不接二無心定後起故非無心定無間故為合第一句前第四句謂第二念等二定剎那及無心定生心心所上生住異滅不從心等無間緣生故非心等無間果皆接無心定後起故是定無間故為合第二句即前第一句謂無心定生心心所及第二念等二定剎那皆從等無間緣生故是心等無間緣果皆接無心定後起故是定無間故為合第三句前第二句謂初念所起二定剎那及有心位諸心心所上生住異滅不從心等無間緣生故非心等無間果不接定後起故非定無間故為合第四句問從二定生諸心心所望入二定心中間遠隔非是無間如何為法入定心等無問果耶答中間不隔心心所無等法所間故還以定前心為等無間緣。",
    "X53n0836_007:0088c14_0": "上來第三釋第三第四句自下第四釋第五句文中有六初結前生後所緣緣性下正釋頌本生所緣緣性即一切法為體三望心心所隨其所應下明六識及相法所緣緣不同四若法與彼法下法喻辨所緣緣性定縱不緣時亦所緣緣攝故五心心所法下牒所緣三定例問所依亦有如是三定耶言所緣三定者一處定如眼識心心所決定唯以色處為所緣二事定者就色處中有二十種色體事若眼識等應以青色事為所緣決定不緣餘色事三剎那定者若眼識應依此剎那定生依餘時則不依毗婆沙云依定緣定剎那定者依定之言悟也六答應言亦有如是三決定以剎那剎那所依根事各別故就時辨所依事別也五識所依有此三定第六意識所依但有處剎那定無事定也以未來二心展轉為因故然五識等於現在世親附自所依以現在與根聚集故過去未來與所依相離以過去未來散在處處故有說在過去亦親附所依此不正義也若所緣緣體以一切法為體然名所緣緣者以影像相於心心所上現故說境為所緣以有體能生識故名緣此相形就用為名廣如大乘思塵論破薩婆多義中釋及如佛地論記中釋。",
    "X53n0836_007:0089a11_0": "自下第五釋第六句文中有三初結前二釋頌本生增上緣性即是能作因以能作因為增上緣故三釋緣名義此緣體廣名增上緣問既一切法亦所緣緣此增上緣何獨體廣答俱有諸法未曾為所緣然為增上故唯此緣體廣婆沙云所緣緣以體言之攝一切法以剎那言之除相應俱有合據剎那故言俱有諸法未曾為所緣據體故所緣緣性即一切法又釋或所作廣名增上緣以一切法各除自性與一切有為法增上故。",
    "X53n0836_007:0089a20_0": "自下第六頗設問答一問頗有法於法全非四緣否答有自性於自性問於他性亦有不答有謂有為於無為無為於無為。",
    "X53n0836_007:0089a23_0-0": "上來一行半頌舉四緣數出四緣體自下第二有一行頌辨四緣與果時節以取果時依正理論師俱現在無差別故不說文中初問次舉頌答後釋頌本文中有四初釋初句於五因中二因與果作用於正滅時正滅時言顯法現在滅相現前用故名正滅時若如正理論師釋住異滅三相同時作用故正滅相用時攝現在盡若如婆沙師釋三相前後作用正滅相用時住異用息如前四相中說據用究竟時但言正滅時答據少分亦通住異俱有相應於果法滅位方與作用由此二因令俱生果有作用故正理論云如是二因雖俱一時取果與果而今但約與果功能二牒第二句釋所言三因於正生者謂未來果法於正生位生相現前用故名正生時同類遍行異熟三因於果法生位作用方興三釋餘二句已說因緣二時作用二緣作用與此因緣二時相違前明二因作用於正滅時今明等無間緣取與二因時相違於果法生位而興作用以彼果生時前心心所與其處故正理論第二十卷",
    "X53n0836_007:0089a23_0-1": "云等無間緣非即諸因然果是五果士用果攝若所緣緣能緣果滅位而興體用以心心所要現在時方取境故與前三因於正生時相違既心心所三相時皆能取境故知所緣緣三相時皆能與果而言正滅時者以未來名正生時故現在三相總名正滅時以生滅相對故正理論云其所緣即為因不有作是說能作因以體與果俱相似故豈不所緣緣士用果為果有作是說此所緣緣果唯增上或復能作因亦有士用果故無有失四釋唯增上緣於一切位皆無障住故彼作用隨無障位一切無遮諸師釋言增上緣疎所作因故通三世及無為於一切位無遮今解不然前明二因於正滅遮正生時三因於正生遮正滅時等無間緣於正生遮正滅時所緣緣於正滅遮正生時今明增上緣通生滅位皆能與果故言一切無遮故正理論云其增上緣法生滅位皆無障住故彼作用隨無障位一切無遮此亦與所作因與果果時因若與果俱果滅時與果若與後果果生時與果。",
    "X53n0836_007:0089c10_0-0": "自下第三有一行頌辨諸法從緣生多少文中初問次舉頌答後釋頌本文中有四初釋初句如文可解二滅盡無想下釋第二句亦可解正理論云豈不無想亦三緣生是心心所等無間緣故亦應說為心等無間但非心等加行引生故於此中廢而不說或此無想但聲所顯非如二定相對立故二定何緣是心等無間而不說是心等無間緣由心等力所引生故如心心所生必繫屬前心滅故非如色等可與餘心俱時轉故非如得等可有雜亂俱現前故非如生等是餘伴故然心方便加行引生故可說為心等無間與心等起定相違害故非心等等無間緣有為此說理相違故謂修行者厭惡現行心心所法入無心定若無心定復為此緣引心心所則修行者應於此定無樂起心為離現行心心所法入無心定此復引生心心所法不應道理三餘不求應下釋第三句亦可解四一切世間下釋第四句文中有七初釋頌本一切世間唯從如上諸六因諸四緣所起一非自在天二非吠世師實我三非僧佉勝性等一因所起二總問此有何因非一因所起三總答若一切立宗因喻或許因者豈不便捨一因生論四又諸世間下別破自在為因論於中初總舉宗又諸世間非自天等所樂欲一因所起以次第因等取又彼自在作大功力及又若信受一切世間也於中先以次第因破文中有八初牒計以次第理破謂諸世若自在等一因生者劫初之時則應一切六道俱時而生非次第起現見六道等諸法次第而生故知定非一因所起二牒轉計若執自在天從自在天樂欲故然乃至是則應成非一因起天外亦由樂欲差別生故三重難先後差別欲應一時生所因自在天無差別故四牒轉救若先後欲差別除自在外更待餘因故不俱起者則非一切唯用自在天一法為因便違本宗五進責或所待因亦應更待餘因應無邊際六退徵若更不待餘差別因乃至則令諸法先後起差別欲非次第生七若許諸因下重牒因無邊不起釋門理八牒轉計若自在欲雖頓生而諸世間不俱起者汝言由隨自在欲所生故理亦不然彼自在欲前位與後一時頓起無差別故世間亦應頓起。",
    "X53n0836_007:0090a23_0": "上來雖有八文合為第一釋次第因自下第二釋所等初又文中有三初以理責又彼自在天作大功用生諸六道世間得何義利二牒許若為自發生善故劫初時生諸世間者此喜離餘生諸世間方便不發是則自在乃至應非自在於喜既非自在於餘亦然差別因緣不可得故三以生苦發喜責或若自在生地獄等乃至何用此自在為若自在天生他苦者依彼事天婆羅門等頌成為善說彼事天婆羅門說自在天有三身一法身天遍周法界二報身天居自在天宮為大梵王或為摩醯首羅天王三化身天在世間護國土言曲險利能燒者真諦師云有三阿脩羅將三國土飛行空中從摩醯首羅天上過其天意不耐以火箭射之燒三國土一時俱盡火箭險利能燒三國也可畏恒通害者以龍貫人體髏繫其首領又以龍縛煞象雖取皮帶血反披之樂食血肉髓者凡所飲食是此事故今祭祀者皆以血肉髓祭之故名魯達羅魯達羅者奘法師言此云暴惡彼事天婆羅門說此頌頌化身天今論主云生地獄等苦發生自喜故知彼頌亦是報身天事成為善說。",
    "X53n0836_007:0090b18_0": "上來雖有三文合為第二釋所等初又自下第三釋所等第二又文中有四初牒計以撥現量責又若信受一切世間唯自在天一因起則為誹撥現量所見人功等事造作車舍等種糓麥等應不須人功二牒計若言自在待餘人功因緣乃至但是明敬天言離人功外不見天用三重難或彼自在乃至應非自在四牒轉計若執劫初起自在為因餘劫末後續生待餘因者則世間初所起不待餘因應無始來不待餘因成由如自在天無始來有故。",
    "X53n0836_007:0090c03_0": "上來第四破自在天一因論自下第五我勝性等下類破餘二論六奇哉世間下傷難妄執七且止破邪下止破顯立。",
    "X53n0836_007:0090c06_0-0": "自下第四有一行頌辨大種所造為因多少文中初牒前為問次舉頌答後釋頌本文中有四初釋初句正理論云是諸大種更互相望但為俱有同類因義俱起前生為因別故謂隨闕一餘不生故更互相望有俱有因性類雖別而因一事更相隨故有同類因二釋第二句文中有六初釋頌本大於所造能為五因二問何等為五三答謂生依等四攝五因入六因如是五因但是能作因之差別五辨五因相初從彼大種起說為生因等六如是則顯下總結正理論云大於所造能為五因何等為五謂生依立持養別故雖同時生而隨轉故如形起影燈焰發明大於所造得成因義如是五因俱是能作因之差別大望所造色非俱有因非一果故豈不大種與生等相非同得一所造色果非不相望為俱有因雖非因得一所造果而更有餘同一果義大與所造必無一果故例生等理定不齊又諸大種與生等相設互相望不同一果而互為果故得成俱有因大與所造無如是義豈不心與心之隨相非互為果而心與相為俱有因大與所造亦應如是何故非因此例非等心與隨相雖復相望非互為果而彼相望互為果法定有與心互為果義又心隨相與心一果故心與彼為俱有因大與所造無如是事故大於彼非俱有因又所造色有善不善大種一向無記性攝非如是相成俱有因若爾大種望無記造色應成俱有因不爾所造善不善無記同一種類故同一類色少分以大種為因少分非大種為因無如是理如一類法少分與心相應少分非心相應無如是義又許大種在過去世所造之色通去來今非俱有因有如是理又成就別故無此因謂有成就諸所造色非四大種或有成就能造大種非所造色非俱有因有如是相故大與造非俱有因非相應因不相應故亦非遍行及異熟因大種無覆無記性故非同類因俱時起故設後起者非同類故雖有無記同而種類異故如心受等種類雖別而互相望為同類因大與所造亦應爾者理亦不然受等與心種類雖別而同一果故得為因由此應知說緣道理又本論中亦有文證大望所造色無五種因如說有色處非無記為因亦非無記謂善色處若諸大大種望亦造色於五因內隨作一因則此句義應不成立若爾應與經相違如契經言因四大種施設色蘊本論亦言大種所造因增上等俱不相違據生因等說此言故大與所造五性生因者從彼起故如母生子為依因者隨彼能故如臣依王為立因者能任持故如地持物為持因者由彼力持令不斷故如食持命為養因者能增長故猶如樹根水所沃潤或生因者一切大種生所造色非離諸大種有造色生故造色生已因類相續不斷位中火為依因能令乾燥不爛壞故水為立因能為沃潤令不散故地為持因能任持彼令不墜故風為養因能充發彼令增長故如是大種雖與所造無俱有等五種因義而有生等五種別因故與經論無相違失解云謂有成就現在別解脫戒諸所造色非過去四大種或成就六地四大所造無漏道共戒非下地四大種或有成就現在能造四大種非未來所造別解脫戒又六足本論中亦有文證大望造色無相應等五種因如本論說有色處體非無記其因亦非無記謂無記善色入處體非無記其因緣亦非無記若諸大種望所造色於相應等五因內隨作一因則此本論句義應不成立問若爾應與經相違如契經言因四大種施設色蘊經既言因四大種故知四大望造色有俱有因等義迦延本論亦言大種所造因增上等迦延據四緣作論既言大種所造因增上故知大種望所造得有因緣增上緣答俱不相違前言有色處非無記為因亦非無記者非俱有因等五因也後經言因四大種迦延言因增上者據生等五因說此言故然據婆沙十因為因緣生等五因四緣中亦因緣攝俱舍及正理論生等五因是能作因攝生等五因義說前後與有對造色俱時而生故論云雖同時生而隨轉故如形起影燈燄發明大於所造得成因義若過去四大造現在未來別解脫無表則前後為生因等三諸所造色自互相望容有三因等釋第三句四所造於大但為一因下釋第四句。",
    "X53n0836_007:0091c05_0": "自下第五有八行頌廣明心義重辨等無間緣文中有二初牒前生起前已總說等無間緣然未決定說何心無間後有幾心生復從幾心後有何心起故今當定說二舉頌辨於中有三初有五行頌辨十二心相生多少次有兩行頌辨二十心相生多少後有一行頌辨一界三性心得十二心多少就初十二心中文復有二初頌前生起謂且略說有十二心云何十二等二舉頌辨於中初一行頌列十二心後有四行頌正辨十二心相生多少就釋頌中文有初釋初句欲界善心無間生九自界四色色界二心於入定時及緣生位正理論云生何善心復何地攝答此於初位生加行心若於後時生離欲得隨順住故無容得起彼生得善心生在此間不能令起現前故有說彼未至地攝有言亦攝在初靜慮有說亦在靜慮中間尊者妙音作如是說乃至亦在第二靜慮如起定時隔地而起有作是說非等引心無力能牽隔地心起是故彼說理定不然就十二心中六心命終不受生謂三界善心三界無記心二心受生不命終生上界謂欲界二染心有二心亦受生亦命終謂上界二染心有二心不受生不命終謂二無漏心餘文可解。",
    "X53n0836_007:0092a01_0-0": "次辨安心文中初結前問次舉頌答後釋頌本文中有九初釋第二第三句二欲界無覆無記下釋第四第五第六句三色無覆心下釋第七第八句四如是一二下釋第一句五威儀等三六辨三無記心緣境次差別威儀工巧三無記心色香味觸為所緣境工巧處等取變化心亦緣於聲如是三心若發業者唯是於識故婆沙云威儀工巧心者謂能起威儀工巧心五識是威儀工巧方便不能起威儀工巧心意識能起威儀工巧亦能起威義工巧心合文同婆沙發業心故言如是三心唯是意識報心不發業通六識通緣十二入故此中不說威儀加行通四識以聲非威儀故工巧加行亦通五識此文同婆沙五識為工巧方便等有餘師說有威儀工巧所引意識能具足緣十二處境唯婆沙生處得智威儀工巧心中得緣他心故知具緣十二處是正義也六如是等下廣辯二十心相生多少二十心中八心命終不受生謂三界生得善心三界報心二界威儀心二心受生不命終生上謂欲界二染心二心亦命終亦受生謂上界二染心八心不命終不受生謂三界加行心二界變化心欲界工巧心二無漏心餘如文可解六問答辨通局有四對辨初對問復有何緣加行無間能生二無記心非彼三無記無間生加行善心耶答異熟無記勢力劣故非作功用所引發故樂作威儀工巧功用引發工巧威儀轉故三無記心不能順起加行善心以出心不由功用轉故加行無問可能生彼三無記心第二對問若爾染汙無間不應生加行善心不相順故答雖爾厭倦煩惱現行謂欲了知煩惱心後容起如行第三對欲界生得以明利故可有從彼學無學心色界加行無間而起欲界生得非作功用所引發故不能從此欲界生得引生彼三心第四對又欲界生得以明利故防護上定可從色染無間而生色界生得不明利故不能防護上定非無色染無間而起七明三種作意出入聖道通局文中初舉數列名辨三作意相次述三師釋初師釋云三種作意入聖道三種作意生聖道若作是說便順此經言不淨觀俱行念等覺分以不淨觀是勝解作意能入聖道前後俱也第二有餘師說唯從共相作意無間聖道現前聖道無間通起三種經言不淨觀俱修行念等覺分者修不淨觀調伏心已方能引生共相作意從此共相作意無間聖道現前依之傳傳密意故說不淨觀俱修行念等覺分第三有餘師復言唯唯從共相入聖道共相生聖道下毗婆沙師破若唯俱相出爾者有依未至定等三地證入正性離生聖道無間可生欲界共相作意若依第二第三第四定證入正性離生聖道無間起何地作意耶非得起欲界共相作意以極遠故若起當地未曾得共相作意即是聖道又非於彼地已有曾得共相作意異於曾得順決擇分可起現前又非諸聖者順決擇分可復現前以非得果已已可重發生加行道故若汝謂有別共相作意順決擇分同時已得修由繫屬彼是彼決擇分種類如觀三諦諸行皆是非常觀一相四諦法皆是非我涅槃寂靜從聖道無間引彼現前以不部分觀四諦故非決擇分毗婆沙師不許此義決擇分中唯須同類決擇分者此非決擇分如何決擇時已得修耶言此義違正理也於三師中若據修道無學道三種作意入聖道三種作意生聖道若據見共相入三種出故前二師皆為正義唯第三師義不正故毗婆沙師不許也文中破第三師唯共相出故且縱許未至定等三地證入正性離生聖道無間可生欲界共相作意然後就依第二三四定出聖道破然依正義三種作意俱得出聖道故出見道時與羅漢同若依未至定出見道或起欲界三種作意中隨一或起未至定自相勝解二作意中隨一若依餘五地出見道唯起自地二作意中隨一若起共相作意即是聖道故不得起共相作意也八明初得羅漢後出觀心地別不同若依未至得果後生觀心或即彼地或是欲界以欲界心初得為聖道他地修者故依無所有處亦爾餘地學位以得聖道修他地心故無學不起他地心出觀也九於欲界中有三作意下明三界八種作意出入聖道通局可解正理論云若生第二定已上起初定三識時諸有未離自地染者彼從自地善染無記作意無間二識現前三識無間還生自地三種作意諸有已離自地染者除染作意唯善無記體意唯善無記作意無間三識現前三識無間亦唯起此二種作意。",
    "X53n0836_007:0093a04_0-0": "自下有一行本頌辨三界三性心得十二心多少於中有三行頌初一行是本頌後兩行因論生論是子頌就初文中初牒前為問次舉頌答後釋頌本於中有六初釋欲界染心中得六心六心先不成合得成故斷善人由疑續善及上界沒退還生欲界善心爾時名得雖有兩時得心不同以同是欲界善心故合名得一心也又由凡聖起欲界惑退及凡夫界退還得欲界不善有覆二心爾時名得此二心及得色界一有覆心如前四心由無學人起或退得無色界一有覆心及得學心如前四心故名得六二釋色界染心得六凡夫由界退還得無色一無覆無記變化心及色界三心色界染心亦由凡聖起或退得又由無學起色界或退得無色界一有覆心及得學心故名得六也三釋無色界染心中得二種無學人由起惑退得彼染心及得學心故名得二正理論第七十卷",
    "X53n0836_007:0093a04_0-1": "云豈不順退分各於自地離染時捨如何無學者未退起惑彼心現前理實如是然順住分品類有三一少順退二少順進三守自位前言自地順退分定即順住分中少分退分者少順退故得順退名然此定心與守自位多相涉順住分攝諸有未失順退分者彼心無間煩惱現前若捨彼心從順住分少順退者起煩惱退故於文義無所相違若起欲纏而退失者從自善無覆無記二心無間皆容現前諸從學位起惑退者起色無色煩惱退時若先全離此地染者唯從此地順退分定相應善心無間而起若未全離此地染者從此地攝善及染法二心無間皆容現前起欲界纏而退失者若先全離欲界繫染從自地善無覆無記二心無間皆容現前若未全離欲界染者從欲善染無覆無記三心無間皆容現前若未現前獲得清淨靜慮無色必無能起色無色纏退失所得彼惑從彼無間起故但起欲纏退失所得若現前得清淨慮由未現前得淨無色必無能起無色纏退起欲色纏退失所得若已現前獲得清淨靜慮無色通起欲界無色界纏退失所得諸有退失先所得時若起上纏現在前退不失下善不成二惑若起下纏現在前退定失上善定成上惑復有欲令要先退已後時對境惑方現前於此二說前說為善四釋色善三色界善心正現前位容得三心初得未至定得彼善心第九解脫道得欲色界化心皆由升進故得五釋學四若有學心正現前位得四心由初證入正性離生苦法忍時得學心及由聖道離欲界染第九解脫道得欲色界化心聖道離色界染初無礙道同治修得無色界善心六釋餘皆問可得可解正理論第二十卷",
    "X53n0836_007:0093a04_0-2": "云得六心等有一剎那應言不爾且起欲界染汙心時或界退還或續善本或退勝得於此三位隨容有數總得六心界退還時除自無覆定得自界善等三心色界染心亦容可得續善本位得自善心以疑心中續善根故退勝德位三界染心及有學心皆容可得若起色界染汙心時或界退自德隨容有數亦得六界退還時得自三種及欲通果退勝德位得色無色色二染污心及有學心皆容可得若起無色染污心時頓得二心謂學自染此中唯有退勝德位色界善心正現前位容得三心謂自善心及欲色界無覆無記由升進故有說根本靜慮起時頓得三心若汎說得此義非無然於爾時唯得後二以前一種先已得故若不爾者此位學心亦容可得應言得四若有學心正現前位容得四心若初證正性離生爾時學心即名為得若以聖道離欲界染最後解脫得欲色界無覆無記若以聖道離色果染得無色善此中離言非究竟離以於色染未全離時無色善心已可得故有說全離色界染時得無色界根本地善若爾應說亦得學心離欲染時亦得色善是則應說學心得五餘謂前說染等心餘謂三界三無覆無記欲無色善及無學心應知彼心正現前位唯自可得色無覆心正現前位都無所得前已得故不應說言皆自可得豈不無學心正起時亦容得四謂三界善初盡智時未來脩故非先已得有未來脩如何可言此唯自得又無色善正現起時亦得學心寧唯自得合言得者非先所成如後頌說故無此難有餘但言心有十一以學無學同無漏故即約此義總說頌言慧者說染心等俱舍云有餘於此總說頌言者餘說有十一心師總說此頌雜心論主以此頌頌十二心世親論主言於善心中應言得七謂由正見續善根時欲界善心起位名得離欲界染第九解脫頓得欲色無覆無記二心加前為三得色無色定時彼二善心說名為得加前為五初入正性離生位證羅漢時學無學心說名為得加前為七正理論云如經主難應言得七然學無學同無漏故總說一心言六無失解云餘師心有十一言六無失雜心論主心有十二言六有失為攝前三界染心中得六六二種頌義復說頌言一由託生是界退還二由入定是色無色界善心及有學心正現前位三由離染是由聖道離色無色染四由退時是三界染心起或退時五由續善是由疑正見續善時此五位得心皆非先所成故。",
    "X53n0836_007:0094a17_0": "俱舍論疏卷第"
}