{
    "X53n0843_009:0525a03_0": "順正理論述文記第九",
    "X53n0843_009:0525a05_0": "沙門　元瑜　述",
    "X53n0843_009:0525a06_0": "○釋第十二卷論",
    "X53n0843_009:0525a07_0": "無色法中(至)蘊得等性。",
    "X53n0843_009:0525a08_0": "述曰此下明非色非心法問前於心所之初舉四有為結二生下理應於此結前心所引不相應何故此中乃於無色結二生一未詳其旨解云由於次上括異名中兼亦明心不唯心所故於無色結引可知於正解中初標列次牒解後簡類此即標列也一句總標三句別列案薩婆多部諸師立心不相應行故亦無定隨諸論增減不同今此論主於十四外許有和合性故於等中攝之復有餘師於得等外更計度蘊得界得處得等當知此即得之流類或於非得外計有不和合及追等當知即是非得流類非有異體故復言類故今等言等取異體類言類取即體異名。",
    "X53n0843_009:0525a20_0": "如是諸法(至)相應而起。",
    "X53n0843_009:0525a21_0": "述曰此釋總名非如心所與心相應而體復是行蘊所攝故言心不相應即遮心所行言即遮色心無為以彼皆非行蘊攝故。",
    "X53n0843_009:0525a24_0": "說心言者(至)故復言行。",
    "X53n0843_009:0525b01_0": "述曰此第二釋言心者為明得等而心同是無色之類而心同類故說言心心言即遮色法一種以諸心所亦是無色又所例等而心同類而心相應為簡彼故言不相應諸無為法是無色故可名為心無所依□□不相應非行蘊攝或非遷流為簡彼故故復言行。",
    "X53n0843_009:0525b07_0": "此已總標(至)自相續二滅。",
    "X53n0843_009:0525b08_0": "述曰此下牒解隨義相似相對解釋總為七節一明得非得二明同分三明無想四明二定五明壽命六明四相七明名等就第一明得非得中初明自性後明差別明自性中上兩句對明其體下兩句總示所依得是總名但得初重說獲成就。",
    "X53n0843_009:0525b13_0": "論曰得獲成就(至)不獲聖法。",
    "X53n0843_009:0525b14_0": "述曰初釋頌文後廣決擇釋頌文中此釋上半生二法體一得義中未得初得說名為獲已得重得說名成就總而言之但是一得別得二義名獲成就總別初重門異故爾此與俱舍釋有少異俱舍中以本來未曾得及得已失但今初得即名為獲第二念已去相續不失名為成就與此相違名非得者□□曾失及重得已但今初失名之為不獲第二念已去非得相續名不成就是則得與非得皆卞初生相生一念名獲不獲自□□續名成就不成□此論中但據本來未得今得名獲即以未得非得名不獲若已曾得設令因退今時重得但名成就以是重得故即以己失非得名不成就問如是便與得捨成就不成就四句相違解云得獲成就本唯一物隨論者意所用便別此文與彼不可一例其義如何此明獲成就意以異門相對解釋辨得非得差別之相故獲成就體各不同彼四句中欲以異門莊嚴於義得即唯據新得成就即通於新舊成就攝於得得不攝於成思之可解。",
    "X53n0843_009:0525c08_0": "於何法中(至)如理應思。",
    "X53n0843_009:0525c09_0": "述曰此釋下半總示所依所依有二有為無為且有為中唯自相續有得非得謂有為法墮自身中非他相續無有成就他身法故非非相續無有成就非情法故無為法中唯於二滅有得非得心所引故違內起故非得虗空非心所引故不違內起故問非情色等非擇滅云何答亦由是自增上果不生亦應成就亦許多人共成猶如擇滅應審思之一切有情皆成非擇滅具縛異生及具縛者入見道時苦法忍位唯此二人不成擇滅餘皆成就但言除具縛理亦應盡為於凡聖各別分別故說二門諸有得者即有非得理實得非得相翻而立故為證得義引本論說色行二蘊一得等色行蘊者謂色及十得皆為大得所得故言一得得也問餘相所相為一得耶為別得耶若爾何失二俱有過若一得得諸相應法便為例難若別得得有無窮過以得有四相四相復有得如是展轉成無窮故解云有別得而非無窮非於一法即成多故此得有四相四相名有得此得設有相異法相依多亦何失既不相礙有應無過又解一得所得然諸相應不可例難豈以能相所相同相故即令心王心所同相相即應以同相相者一得所得若以心王心所共一相應所相應故為例難者不然不說四蘊一得得故有缺滅故非一切故應更思之。",
    "X53n0843_009:0526a08_0": "經主此中(至)別物名得。",
    "X53n0843_009:0526a09_0": "述曰此下廣決釋初答門引至教後徵難立比量此即初文也於中先敘俱舍中經主所問。",
    "X53n0843_009:0526a11_0": "應答彼言(至)及不善法。",
    "X53n0843_009:0526a12_0": "述曰此論主答引經中破戒苾蒭及非斷善造五逆等具足成就善此。",
    "X53n0843_009:0526a14_0": "若謂經說(至)有太過失。",
    "X53n0843_009:0526a15_0": "述曰此牒外難案此等經便有依非情輪珠他相續象馬兵臣女寶有得之過成太過失。",
    "X53n0843_009:0526a17_0": "此難不然(至)名成就故。",
    "X53n0843_009:0526a18_0": "述曰此是論主釋餘主經言成就者謂自在義非與此同。",
    "X53n0843_009:0526a20_0": "若謂餘經(至)亦應爾者。",
    "X53n0843_009:0526a21_0": "述曰此牒外道難既維輪王應非別得。",
    "X53n0843_009:0526a22_0": "此亦不然(至)說名成就。",
    "X53n0843_009:0526a23_0": "述曰此論主釋言自在者謂現在主於現有能謂彼七寶皆是增上果攝恒現在前隨彼經王所乘而轉可名成就非於過未善不善法不俱現行一現行時於不行者若無有得云何成就過未有體無得成就尚難況汝宗中無體於而成就。",
    "X53n0843_009:0526b04_0": "若於未來(至)名成就者。",
    "X53n0843_009:0526b05_0": "述曰此牒前計現雖無體□□別得仍於未來有能生用即名成就。",
    "X53n0843_009:0526b07_0": "理亦不然(至)應是預流果。",
    "X53n0843_009:0526b08_0": "述曰此論主難若如汝解便有非□業過失一得俱至最後身菩薩定生無漏□即是成就無漏故已應是聖阿羅漢最後心是異就生滅像心後更不能生於無漏即是不成就無漏應是異生俱世俗忍見所斷惑既不復生便為不成就應是預流果案此文似入忍位即得見所斷煩惱非擇滅不增上忍應更堪餘文。",
    "X53n0843_009:0526b15_0": "又若許有(至)有何非理。",
    "X53n0843_009:0526b16_0": "述曰此下徵難立比量初執宗微過二外難顯非三以理雪非四外舉宗□□廣破所執六結定是非此即執以己宗徵□□□過。",
    "X53n0843_009:0526b19_0": "如是非理(至)是為非理。",
    "X53n0843_009:0526b20_0": "述曰此第二外難顯非古有體法現量所知如色聲等五識現取如貪嗔等他心智取聞現可知說非現境須有作用比量安立如眼耳等所執之得體用俱無越於現比無而言有是為非理立比量言所立之得必定是無體用無故猶如兔角。",
    "X53n0843_009:0526c01_0": "此定不然(至)說此為無。",
    "X53n0843_009:0526c02_0": "述曰此第三論主以理雪非也義所許得有大作用謂由得故已得諸法不失成就得為幖幟知此屬彼分別智生不失生智二因斯為為大用更有何用過此而言是無此量言義所許得定有別體有大用故猶如眼等以有用故知有自體顯外所立體用無因有不成過。",
    "X53n0843_009:0526c08_0": "若爾何用(至)智之幖幟。",
    "X53n0843_009:0526c09_0": "述曰此第四外人舉自宗義奪前所立謂經教說如是二用無勞於得但所依中有諸種子煩惱種子未拔生得善種子未損加行善種子增長自在有前二用。",
    "X53n0843_009:0526c13_0": "此復云何(至)說名為斷。",
    "X53n0843_009:0526c14_0": "述曰此重釋前義雖開二門且就生得釋未損義謂邪見力能損身中生得善種令不能生現行善心即名為斷非畢竟害令其總無有而無用故但名損即不成就未損名成就。",
    "X53n0843_009:0526c18_0": "安由功力(至)名不成就。",
    "X53n0843_009:0526c19_0": "述曰此約加行易釋增長自在謂無始來曾習其先有種子而不自在未曾習善或有言本有者或有言習生者皆由起已種子增長由彼種子增長自在能生現行說名成就即與大乘自在成就義勢相似若□未起或智已退還不自在名不成就。",
    "X53n0843_009:0526c24_0": "不善無記(至)便為無用。",
    "X53n0843_009:0527a01_0": "述曰此釋不善及有覆無記由見修道令所依身轉變異本於彼二道所斷惑中無復功能令其現起是名為斷與此相違名為未拔若世間道伏彼種子令無功力生於現行亦名為斷與此相違亦名未損自淨無記或無功力可生現行謂工巧等習未明利與此相違名為自在諸如是等但約所依種子差別二用便成無勞知得故彼二用非依於得明論主立有大用因有不成過。",
    "X53n0843_009:0527a09_0": "如是種種(至)名為種子。",
    "X53n0843_009:0527a10_0": "述曰此下第五廣破所執就中初破種子後隨法別破此即初文也故先總非而所說以彼所說皆依種子根植不正枝葉自傾是以先徵種子體相。",
    "X53n0843_009:0527a13_0": "謂名與色(至)轉變差別。",
    "X53n0843_009:0527a14_0": "述曰經部宗中安立種子自有二說一說依名色一說但依心隨破二義文即分二此即初義述種子也謂名色中於生自果有展轉引功能或隣近生功能由所依身於後二念功能起故名為轉變者即是展轉功能後漸增長將生果位功能增減名為差別差別即隣近功能故由相續有轉變差別不同所以功能有展轉隣近差別。",
    "X53n0843_009:0527a21_0": "名色者何。",
    "X53n0843_009:0527a22_0": "述曰此責名色體。",
    "X53n0843_009:0527a23_0": "謂即五蘊。",
    "X53n0843_009:0527a24_0": "述曰此出名色體也。",
    "X53n0843_009:0527b01_0": "如何執此(至)以何為種。",
    "X53n0843_009:0527b02_0": "述曰此論主正破汝以五蘊為性三性因不過三種若總□五蘊令方名因即應是假若一一蘊別能為因汝經部宗唯無記云何無記生二性耶若自種類善唯生善者異性相間以何為種。",
    "X53n0843_009:0527b06_0": "天愛非汝(至)不善性生。",
    "X53n0843_009:0527b07_0": "述曰此第二師立義還謂論師為天愛者其人劣弱為天所矜意存相蔑故名天愛也非諸劣智能解種子古種子者由前剎那殊勝思故熏於後心令彼後心異功能起前思差能者謂現行思有勝作用是思中之差別故名思差別令後心中功能轉異亦是功能中之差別即為種子故如是生三性心功能一一遍依三性心知由此種子令所依心相續轉變即展轉功能差別□隣近功能故得異性更相引起。",
    "X53n0843_009:0527b16_0": "今汝所執(至)為無別體。",
    "X53n0843_009:0527b17_0": "述曰此徵外執種子與心體為因異。",
    "X53n0843_009:0527b18_0": "此無別體。",
    "X53n0843_009:0527b19_0": "述曰此外人答即心功能無有別體。",
    "X53n0843_009:0527b20_0": "豈不許善(至)處非處智力。",
    "X53n0843_009:0527b21_0": "述曰此下正破若種與心無別有體善心如種能生不善不善如種能生不善皆由與種體不異故恐彼釋言於善心中不善種子能生不善非即善心故下難言狂無心者可作是念有心之終無此語如與煗豈別用耶由無別故應因減果立比量言善心應能感不善果與不善種體無別故猶如彼種既現不善心不能感愛果不可於中安善種子那落迦者西方二釋一云落迦名末那名不可不可等故名那落迦二云那落名忌名為人造惡之人顛墜於彼故名惡人古代翻譯以義傍翻名為地獄等即等傍生餓鬼又現善心不能感非愛果不可於中安不善種末奴沙者唐言攝意以劫初時釋種上祖摩訶三末多王減諸大眾汝等有情當攝於意義當人趣涅槃經云人者能多思義即其義也若因欲於善不善心安不善善二種子者心如種善便招惡如來但知善得善果為是處得不善果為非處吹更許有善招不善非佛所知是即如來味為成就處智故為謗佛。",
    "X53n0843_009:0527c15_0": "又應許(至)極為迷謬。",
    "X53n0843_009:0527c16_0": "述曰此中又以無別體故證種與心同得一果即同得一果為因證無漏心能感三有又應無漏能生煩惱以無漏心中安煩惱種故恐彼釋言無漏兄或親對治故無漏心中不安或種故下難言或聖身中脩所功惑應無種子自然而生是即今無漏生有漏若煩惱心安無漏種應即煩惱能生無漏恐彼釋言障次相反故無漏不依或心故下難言聖起惑已重生無漏應無種子恐彼釋言如苦法忍無種而生斯亦何失故下難言無因而生爾時應是初無漏攝名為剎那是即剎那非唯一念如是徧約有學為難退姓無學應有三界脩或種子以經部宗無煩惱退此難不成故指下文并煩惱退恐彼釋言種之與心雖無別體而有差別有差別故各生異果依他起故無有別體故下難言曾未見有言別而同非智所樂。",
    "X53n0843_009:0528a07_0": "又前所起(至)更互相應義。",
    "X53n0843_009:0528a08_0": "述曰此文徵彼前思後心既不俱有云何成因果。",
    "X53n0843_009:0528a09_0": "此何所疑(至)更互相應。",
    "X53n0843_009:0528a10_0": "述曰此外人釋因前故有後無前後不生因果法爾此何不或。",
    "X53n0843_009:0528a12_0": "若有思時(至)當更思擇。",
    "X53n0843_009:0528a13_0": "述曰此論主破有前思時後心少有可言相對得說相應有無不但相應豈有如是之例後當更說。",
    "X53n0843_009:0528a15_0": "然彼所說(至)本無種故。",
    "X53n0843_009:0528a16_0": "述曰此下隨法別破一破生得善中非畢意害義二破加行善中彼法已智義三破諸煩惱中二道所斷義四破釋種子中展轉隣近義此即初文也若實有種害之不盡可言畢竟害本無種故俱應言畢竟不害無所害故。",
    "X53n0843_009:0528a21_0": "又彼所說(至)而作是言。",
    "X53n0843_009:0528a22_0": "述曰此與彼作違教過經說彼人初智惡心善心漸隱惡法生現更於後時耶見成就一切皆斷經說一切皆斷而執非畢竟害不由分別鬼何用有此亂言。",
    "X53n0843_009:0528b02_0": "又善種子(至)能生善故。",
    "X53n0843_009:0528b03_0": "述曰此進退難若損力聞盡有之後何用若損用不盡應非斷善根。",
    "X53n0843_009:0528b05_0": "又彼所言(至)說名成就。",
    "X53n0843_009:0528b06_0": "述曰此第二破加行善中彼法已起義此即牒彼所說。",
    "X53n0843_009:0528b08_0": "此亦非理(至)品類計度。",
    "X53n0843_009:0528b09_0": "述曰此正破汝經部宗無未來法加行善法先未曾生於現心中理無種子又如前破種子不成無生因故生義必無初生尚無呪有已起又未來無於何自在恐彼責言何因緣故而本不生故下釋言以生因無故非有不生因生因既本無功力如何有即由此義兼破宗計度品類斷煩惱法其義云何品類者謂九品五類也如前已破種子不成無漏心生現無諸惑未來過去其體是無有何諸惑言品類設種子依何而立現無漏心非所依故若依無漏體不異故應同一果應非所斷如無漏心如其不依種現無體有種令無是斷惑義種體既無亦無所斷云何可說斷煩惱耶故攝□論云無種戒無體若許為轉依無彼二無故轉依不應理謂轉依者或彼種體無名為轉依非出世心正現前時有彼可得云何可說彼無種子或體斷滅若以現無即名為斷一切皆無心應即頓斷云何可得說有品類。",
    "X53n0843_009:0528c02_0": "然彼所言(至)名未斷者。",
    "X53n0843_009:0528c03_0": "述曰此第三破諸煩惱中二道所斷義此即牒所說也。",
    "X53n0843_009:0528c05_0": "此今應說(至)無生用故。",
    "X53n0843_009:0528c06_0": "述曰此徵彼意二道何別恐彼責言二道勳異如何致疑下即釋言由汝俱說如種被燒無生用等故應徵向。",
    "X53n0843_009:0528c09_0": "若謂如種(至)諸煩惱者。",
    "X53n0843_009:0528c10_0": "述曰此牒彼釋如種雖損未是令壞猶如種子已被閏濕將欲生牙忽遇火緣令還乾燥雖現不生名為被損非永害故後得生世道伏惑亦應如是雖現不能生於諸果名之為斷更於後時猶有如前生諸行果即異熟等及諸煩惱即等緣果。",
    "X53n0843_009:0528c15_0": "如何說言(至)如何名斷。",
    "X53n0843_009:0528c16_0": "述曰此論主破過火種乾是闕生緣非為損種去種被損必不生牙若能生引不名為損或亦如是云何名斷。",
    "X53n0843_009:0528c19_0": "又一心中(至)理不成立。",
    "X53n0843_009:0528c20_0": "述曰此下第四破釋種子中展轉隣近義謂以能所不俱破其斷義違斷義故種子不成立有種子其過若斯故彼所言理不成立。",
    "X53n0843_009:0528c23_0": "又彼所言(至)生果功能。",
    "X53n0843_009:0528c24_0": "述曰此即□牒彼釋前展轉隣近之義謂相續中前後轉變是展轉功能差別是隣近功能。",
    "X53n0843_009:0529a02_0": "如是具壽(至)如後當辨。",
    "X53n0843_009:0529a03_0": "述曰此正破汝譬喻宗唯立現在過未是無現唯剎那現無相續前後之異而言前後違所許宗故言異意過未無體而言三世諸行相續是永理言故曰異言後果既無於何起用果生之位因無誰生而以無間生果為種之號此亦乖理故名為異號者西方喚頭為命能轉身故豈身之最種生果位勝故名前前違於理故言首異又釋彼宗所許於現剎那功能名種而所發言乃云轉變相續差別言意相永故云異意言也若意若言違種子性所以然者意許唯現現無差別言說差別違二世故彼皆建立種之法故言其種亦異也又釋此俱戲調之言耳明彼運心形言動首皆有別別之過異異生智言異也。",
    "X53n0843_009:0529a16_0": "彼由憎背(至)有何相違。",
    "X53n0843_009:0529a17_0": "述曰此下第六結定是非就中初結過有無次結宗成壞後結立破意此即結過有無也謂彼皆得其過眾多令己不訖許有得者有何相違相違無故名無過也。",
    "X53n0843_009:0529a21_0": "經主於中(至)體用極成。",
    "X53n0843_009:0529a22_0": "述曰此結宗成壞經主所引種子不成既無種子故知二用唯應在得得有用前因成立因無過故其宗得成。",
    "X53n0843_009:0529b01_0": "對法諸師(至)建立己宗。",
    "X53n0843_009:0529b02_0": "述曰此結立破意由彼諸說壞亂正宗謂譬喻者執心差別生果功能說為種子異部諸師或有說彼名隨界是因義隨身有故或有說為熏習者由依前念熏成習故或有說為功能者以有功力能果故正量部師說為不共由有此故當果必生猶如義故大眾部師說名僧長前思所長故能長後心故如是等執彼彼部中或有諸師執有別體如惑業論說由有此等聖餘雜亂故今決擇令辨正耶。",
    "X53n0843_009:0529b10_0": "如是已成(至)非所斷二種。",
    "X53n0843_009:0529b11_0": "述曰此下辨差別初明得差別後明非得差別得中初正分別後重簡擇此即正分別也第一句三世分別第二句三性分別第三第四句四繫分別第五句三學分別第六句三斷分別若論得體通於三世三性四繫三學三斷今此文中就所得說故有差別。",
    "X53n0843_009:0529b17_0": "論曰三世法得(至)後當更辨。",
    "X53n0843_009:0529b18_0": "述曰此釋初門過去有三中過去者或是法前得或是法後得或是法俱得現在未來聞是法後未來法有三中過去現在者皆是法亦得未來無次第故不可定其文後應更思之現在法有三等過去者唯法前未來者唯法後現在唯法俱通據一切容可如是自有諸法無三得於後重簡擇中釋。",
    "X53n0843_009:0529b24_0": "又善等法(至)無記三得。",
    "X53n0843_009:0529c01_0": "述曰此第二門明得所得同善等性問諸得差別不可一例有為法得同法善等耶解云有為法得隨所得法通於三性得擇滅得隨於治道故亦是善非擇滅得隨所依身界眾同分是等流性故是無記更是餘文亦應思勘。",
    "X53n0843_009:0529c06_0": "又有繫法(至)唯有不繫。",
    "X53n0843_009:0529c07_0": "述曰此釋第三門非擇滅得通三界者謂一切法非擇滅得皆通三界所以者問若於欲界身中得者皆隨所依欲界攝故餘可例思擇滅得者若隨有漏道上二界繫欲界無道得無為故隨無漏道即是不繫餘皆隨法以義應思。",
    "X53n0843_009:0529c12_0": "又有學法(至)得唯無學。",
    "X53n0843_009:0529c13_0": "述曰此釋第四門五取蘊得隨法是有漏非擇滅得隨依是有漏有所證擇滅隨道是有漏故皆非學非無學既可知問知聖者於修道位斷三空已還煩惱有漏無漏道更相得脩無學位中脩有漏道所得無為並二道得釋義云何解云彼一無為二道所證隨其所空為聖道證邊得隨聖道是學無學有漏道證邊得隨有漏道非學非無學。",
    "X53n0843_009:0529c20_0": "又見脩所斷(至)謂非所斷。",
    "X53n0843_009:0529c21_0": "述曰此釋第五門准前可解。",
    "X53n0843_009:0529c22_0": "前言三世(至)欲色無前起。",
    "X53n0843_009:0529c23_0": "述曰此重簡釋餘門可見三世有疑故別分別於此頌中俱舉一切無三世得者具者不論。",
    "X53n0843_009:0530a01_0": "論曰無覆無記(至)工巧處者。",
    "X53n0843_009:0530a02_0": "述曰此釋上半明無覆無記中唯有二通及變化心俱生四蘊雖是無記皆由勝加行力所引起故勢力強盛威儀路者謂心是威儀所依故名路於一分極脩習者如佛威儀飲光見而心悅馬勝尊者身子覩而欽□如是等例亦加行成工巧處者亦以心是工巧所依故名處於中一分極脩習者如毗濕轉羯磨(唐言差別作業或云種種作業)天神最善工巧西方工匠莫不祠事如是等例亦加行成故此等法有三世得自餘一切異熟五蘊變化威儀工巧五蘊威儀工巧一分唯法俱得世斷者唯一世成就故剎那斷者一剎那成就故威儀路工巧處四蘊一分有世得是正義不若是頌中何不說若非此中何不破解云此是正義故識身足論云成就欲界善心不善心隱沒無記心皆云定成就欲界不隱沒無記心若在欲界未入上定二無記心無法前得云何定成耶頌中不說不說者非全故後得心中當更分別。",
    "X53n0843_009:0530a19_0": "雖有無覆(至)法前後得。",
    "X53n0843_009:0530a20_0": "述曰此釋第三句欲界有覆不能發業二定以心非尋伺同俱亦不發業唯初靜慮三大煩惱及諂誑憍發有覆色不發無表勢力劣故唯法得當知一切有覆四蘊有三世得。",
    "X53n0843_009:0530a24_0": "欲界諸色(至)及後知得。",
    "X53n0843_009:0530b01_0": "述曰此釋第四句謂欲界善不善色通表無表有記性故有法後得非心俱故無法前得當知一切不善四蘊欲界無色界善四蘊色界善五蘊一切無漏四蘊五蘊皆有三世得。",
    "X53n0843_009:0530b05_0": "如是已辨(至)得法易他捨。",
    "X53n0843_009:0530b06_0": "述曰此下明非得差別第一句三性分別第二句三世分別次三句界繫分別後一句明捨時分若論非得體無覆無記性通三世三界今此文中就所不得法說故有差別若准得中亦合作學三斷分別俱以初言唯無記性是非學非無學脩所斷義可知故不別說。",
    "X53n0843_009:0530b12_0": "論曰性差別者(至)無記性攝。",
    "X53n0843_009:0530b13_0": "述曰此釋初句明一切三性法非得皆無覆無記性以諸非得皆隨所依非作意智如界同分等流性攝。",
    "X53n0843_009:0530b16_0": "世差別者(至)性相違故。",
    "X53n0843_009:0530b17_0": "述曰此釋第二門未來不成就法非得先知故通三世過去不成就法通前後知故有三世現在法現成就故現無非得諸不成就者以不應有得故非得亦無雖有二說言異意同未得之前有過去非得後生之徒有未來非得雖非得雜非現知性已有焉。",
    "X53n0843_009:0530b23_0": "界差別(至)可名異生性。",
    "X53n0843_009:0530b24_0": "述曰此釋第三門非得隨依故一一法非得皆通三界繫恐有難言有漏法非有漏三界繫無漏法非得應無漏不繫故以二句釋之謂本論中許以聖遂非得為異生性異生性體必非無漏此以教證非得之體不隨所不得法但隨所依共緣起故智非擇滅得不可言其無漏或有難言異生不得聖非得是有漏聖不得異生非得應無漏如是欲界不得色非得欲界攝不色得於欲非得應色攝如是等難一切應以隨所依故而心云通之。",
    "X53n0843_009:0530c09_0": "不獲何聖法(至)苦法智忍。",
    "X53n0843_009:0530c10_0": "述曰此問異生性至所不得法。",
    "X53n0843_009:0530c11_0": "有說不護一切聖法。",
    "X53n0843_009:0530c12_0": "述曰有三師釋此即初也異生耳中一切聖法皆養未得故約一切名異生性。",
    "X53n0843_009:0530c14_0": "若爾豈不(至)一切聖法故。",
    "X53n0843_009:0530c15_0": "述曰此外人難若一切聖法非皆是異生性既無一有情成一切聖法皆有非得故應俱是異生。",
    "X53n0843_009:0530c17_0": "若有不獲(至)故無有失。",
    "X53n0843_009:0530c18_0": "述曰解者通難若於身中於諸聖法唯有不獲此純不獲是異生性但雜即非故無上失。",
    "X53n0843_009:0530c20_0": "若爾本論應說純言。",
    "X53n0843_009:0530c21_0": "述曰此難義徵若純不獲方是異生性本論應言云何異性謂純不獲聖法。",
    "X53n0843_009:0530c23_0": "不爾雜言(至)不雜餘故。",
    "X53n0843_009:0530c24_0": "述曰此解者釋雖無純言純義已顯如說此人食水明知即不雜餘。",
    "X53n0843_009:0531a02_0": "有說不獲(至)彼非得故。",
    "X53n0843_009:0531a03_0": "述曰此第二釋唯望不成苦法智忍恐彼難言通比智生捨初無漏應是異生故預遮言然非如是以初無漏非得有二一依異生身二依聖身依異生身者必定不與無漏俱智名異生性彼已永害今時雖有依聖身者與無漏俱故不名異生性若有後以三乘初無漏為問亦應以純不獲義通之准前對一切聖法者義即可解。",
    "X53n0843_009:0531a10_0": "經主於此(至)復作是言。",
    "X53n0843_009:0531a11_0": "述曰此下廣決擇故先牒俱舍中經主引經部釋異生性謂於未生聖法身相續上分位差別假立異生性徵其釋意。",
    "X53n0843_009:0531a14_0": "謂異生性都無實物。",
    "X53n0843_009:0531a15_0": "述曰釋經主意俱由謂異生性無別實物故作此釋。",
    "X53n0843_009:0531a17_0": "若爾是誰續分位。",
    "X53n0843_009:0531a18_0": "述曰此徵經主既言是假依何而立誰之分位。",
    "X53n0843_009:0531a19_0": "謂眼耳等相續分位。",
    "X53n0843_009:0531a20_0": "述曰此釋經主意是眼等分位。",
    "X53n0843_009:0531a21_0": "豈一剎那(至)非實過故。",
    "X53n0843_009:0531a22_0": "述曰此正申難無別異生性即眼耳等未生聖法名異生性者但一剎那應即異生性若一剎那非異生性即一剎那應生聖法既一剎那不生聖法而言相續位方異生性此必不然恐彼釋言色等剎那有相續者故令遮曰去言相者是兩望義而為剎那便應是假剎那非實違於自宗以經部說剎那剎那是實法故。",
    "X53n0843_009:0531b05_0": "此非唯有(至)可超越故。",
    "X53n0843_009:0531b06_0": "述曰此更出過非唯相續言違俱一剎那是異生性義又無別異生性違超異生地經謂經中說若有鈍根因聞他教能如說行法隨法行至於苦忍如是名為隨信行者乃至廣說恐言經說異生地不言異生性下即解云此異生地即異生性復有問言何緣故知即異生性下即答言說得捨故謂有經說於世第一滅位之中捨異生獲得聖性復有經言世第一法與異生性成就得俱滅苦法智忍與異生性非得成就得俱生既於彼時說得於聖法說捨異生性復即此時說入正性超異生地故知異生地即是異生性恐彼釋言如我所說未得聖法名異生性爾時超越於經不違故下難言非於爾時於眼耳等少有所捨令可知如得聖法眼等如本皆成就故既無所捨是即違經。",
    "X53n0843_009:0531b20_0": "若謂惡趣(至)應非異生。",
    "X53n0843_009:0531b21_0": "述曰此牒轉計以惡趣為異生性下即破言於忍位中已得惡趣非擇滅應非異生。",
    "X53n0843_009:0531b23_0": "若謂眼等(至)異生地者。",
    "X53n0843_009:0531b24_0": "述曰此牒轉計即超越眼等文顯易知。",
    "X53n0843_009:0531c01_0": "理亦不然(至)超越眼等。",
    "X53n0843_009:0531c02_0": "述曰此論主破眼等如本云何超越。",
    "X53n0843_009:0531c03_0": "若言如證(至)超越眼等。",
    "X53n0843_009:0531c04_0": "述曰此牒外救如有經言證無學果超越過一切有漏之法豈即眼等非如本眼。",
    "X53n0843_009:0531c06_0": "理亦不然(至)故喻不齊。",
    "X53n0843_009:0531c07_0": "述曰此論主破證無學時據斷結故名超越今既具轉故不成例。",
    "X53n0843_009:0531c09_0": "若謂如言(至)超越惡趣。",
    "X53n0843_009:0531c10_0": "述曰此牒外救如說預流能越惡趣豈是斷結耶此亦應爾。",
    "X53n0843_009:0531c12_0": "理亦不然(至)超越何眼等。",
    "X53n0843_009:0531c13_0": "述曰此申理破預流果位於三惡趣業永不作於果永不趣於煩惱永不行得非擇滅故名為越今見道中眼等具有云何名越。",
    "X53n0843_009:0531c16_0": "若言應有(至)生性等例。",
    "X53n0843_009:0531c17_0": "述曰此下通外難故牒外難言離異生身有別異生性亦應離瓶等別有瓶等性故牒彼難非之不然瓶若不破不失瓶性故知無別體不失眼等捨異生性故知有別體恐彼更以牛馬等性為難故總例遮皆以與體俱有無故知無別體。",
    "X53n0843_009:0531c22_0": "若言婆羅門等性何不爾者。",
    "X53n0843_009:0531c23_0": "述曰此牒外難如諸世門吠舍或違羅剎帝剎行梵志行可以或為婆羅門若婆羅門門行穢惡行可以[阿-可+出]為吠舍等是即婆羅門等性不與身俱應有別體何不有別耶。",
    "X53n0843_009:0532a03_0": "如聖異生(至)故無有過。",
    "X53n0843_009:0532a04_0": "述曰此論主通難聖者於三惡趣不作不趣不行異生作趣行有此定別知意了法工巧施為制止諸惡堪能行善如是等事隨於何性皆有能者既無定別依何立有彼等性耶設有中因邊方少分差別當知即依眾同分故更無別性。",
    "X53n0843_009:0532a09_0": "豈不如聖法(至)故名異生。",
    "X53n0843_009:0532a10_0": "述曰此牒人外引聖性為例難。",
    "X53n0843_009:0532a11_0": "此例不然(至)是異生性。",
    "X53n0843_009:0532a12_0": "述曰此論主釋凡無無漏法無漏成聖性聖有有漏法有漏非凡性恐彼難言惡趣等既聖無應是異生性故下復加遍異生成就簡定恐彼又以異生同分為難具二義故應是異生性故下第二復加違聖道得為簡同分。",
    "X53n0843_009:0532a17_0": "又若有法(至)是異生性。",
    "X53n0843_009:0532a18_0": "述曰此中應有外人設難云何知有異生性體非如色等現量所知非如眼等有用可比故今為通此異生性與諸異生作身生因是為大用有故知共有體。",
    "X53n0843_009:0532a22_0": "豈不業煩惱(至)何用異生性。",
    "X53n0843_009:0532a23_0": "述曰外人難業等是身因何預異生性。",
    "X53n0843_009:0532a24_0": "此責非理(至)而可得生。",
    "X53n0843_009:0532b01_0": "述曰此論主答眼等從業生必依於大種如是身生依異生性更相待力豈唯業等。",
    "X53n0843_009:0532b03_0": "故有別法(至)有大義趣。",
    "X53n0843_009:0532b04_0": "述曰此總能由有用故知別有體即由越此名異生地作此釋不違經說若無異生性成聖教相違。",
    "X53n0843_009:0532b06_0": "傍論已了(至)何時當捨。",
    "X53n0843_009:0532b07_0": "述曰此下釋第四以故前結引徵智。",
    "X53n0843_009:0532b08_0": "此法非得(至)類此應思。",
    "X53n0843_009:0532b09_0": "述曰此中初別二種捨時一以違得故得法時即捨二以隨身故易地時即捨此中先釋得法捨指事所見隨得聖法時捨三界非得者今三界異生性得非擇滅故名捨非謂一時捨於三界又解捨三界中異生性如言斷三界善根如是乃至阿羅漢果時解解於不時解脫者中間越於二種種性故言乃至又解兼說學位利鈍根等故云乃至餘易了。",
    "X53n0843_009:0532b17_0": "又此非得云何名捨。",
    "X53n0843_009:0532b18_0": "述曰此責捨法。",
    "X53n0843_009:0532b19_0": "若非得得斷(至)捨於非得。",
    "X53n0843_009:0532b20_0": "述曰此釋捨法用問非得既是無記唯一剎那成就第二剎那望前非得既不成就即有非得智是剎那剎那皆捨非得云何乃言得法易地方捨非得解云今言捨者據一類盡非少分捨非得得斷謂更無此類續智如入聖已去更無異生性得續智故名斷非得非得據此類非得總有非得生非於少分思之可知。",
    "X53n0843_009:0532c03_0": "得與非得(至)必不俱生。",
    "X53n0843_009:0532c04_0": "述曰恐有難言得又有非得應成無覆故今以大小得相得以遣得上無窮非得及非非非非況不俱生纏即先無無窮之過所以者何非得現在現成就故於工有得更無非得第二剎那方非得智失得故以非得非得為得為名理實應如後念之得得前念得雖得於得仍名得非即不得故非得不可以十為名如一法智具誰於得第一剎那有三法第二剎那有六法第三剎那十八法如是非得初失一法第一念時一非得智第二念時二非得智第三念有以如是是如理應思。",
    "X53n0843_009:0532c14_0": "又從下地(至)非得轉故。",
    "X53n0843_009:0532c15_0": "述曰此釋易地捨隨依轉故義亦可見。",
    "X53n0843_009:0532c16_0": "如是已辨(至)同分有情等。",
    "X53n0843_009:0532c17_0": "述曰此下大文第二明同分同分者牒章門有情等者示體性謂彼同分唯以有情等類為性說有情言為遮非情等言即遮非等之類有情等言義兼能所若即同分是有情體是均等性就同依釋即有情是等若所等是有情等言顯同分能等故說等相似故說等即就依士釋有情義等名有情等若有情即諸有情等是相似義即有情等然此言下不自同分俱舉其果以明其因。",
    "X53n0843_009:0533a01_0": "論曰有別實物(至)名眾同分。",
    "X53n0843_009:0533a02_0": "述曰就論中初迷正宗後通外難述宗中一示體二二云名三辨用四釋名五辨依六捨位有別實物是情展轉類等三解如前第二解勝即示體也本論說為眾同分此即念名也多法相似因故名眾同分。",
    "X53n0843_009:0533a07_0": "一趣等生(至)有差別故。",
    "X53n0843_009:0533a08_0": "論云一趣等生用謂與一趣一生一界一地一姓等中生隨其同身形大小安布諸根所作事用所飲所食皆互相似為因亦與彼類作相業因若無同分必相似相樂之義相故似及樂由同分力恐有難言由業力故生於趣等何預同分故下釋言如一有情在面淨色先業所感現心所引四大所造具三種因故身形等雖同於業亦由同分云何知然現見世間同業所別身形量等而彼諸根有好醜別作用有勝劣飲食有不同當知皆由同分有異以業因故。",
    "X53n0843_009:0533a18_0": "若謂滿業(至)此差別者。",
    "X53n0843_009:0533a19_0": "述曰此牒外釋引業同故身形是等滿業有異故根等別非由同分。",
    "X53n0843_009:0533a21_0": "理不應然(至)作用等別。",
    "X53n0843_009:0533a22_0": "述曰此論主難有漏者假令如是或唯引業勢力勝故名受於果而引業同作用等別豈非由有眾同分耶。",
    "X53n0843_009:0533b01_0": "若身形等(至)應不得有。",
    "X53n0843_009:0533b02_0": "述曰此牒外宗以理徵難現見有人先習一業後便捨置更行餘業若由業滅應不可及無現可改明由同分故知同分是彼相似相業之因。",
    "X53n0843_009:0533b05_0": "此中身形(至)故名同分。",
    "X53n0843_009:0533b06_0": "述曰此釋名也身業相似名同同義之分故名同分就依士釋思之可知。",
    "X53n0843_009:0533b08_0": "如是同分(至)謂蘊處界。",
    "X53n0843_009:0533b09_0": "述曰此辨依也謂依有情說天等故乃至廣說餘之三趣若據實義同分非一所謂三界五趣四生四十二住處或中邊處男女等身婆羅門等姓近事苾蒭學無學等無量差別若據法說隨於蘊等復有無量皆依內法不約無情依俱舍中一法二一有情同分法同分有情同分復有二種一無差別謂諸有情有情同分一切有名等有故二有差別所謂界等一類有情各等有故。",
    "X53n0843_009:0533b17_0": "異生同分(至)涅槃時捨。",
    "X53n0843_009:0533b18_0": "述曰此捨位也略舉二種餘可准知總而言之離彼類中捨彼同分故俱舍中約死生得捨作四句有死生無捨謂是處死還生是處如是有捨得無死生俱不俱句思之可解。",
    "X53n0843_009:0533b22_0": "豈不異生性即異生性同分。",
    "X53n0843_009:0533b23_0": "述曰此下通外難即通俱舍中經主所立五重難此即初難得初無漏捨異生性及異生同分捨時既同道有別體。",
    "X53n0843_009:0533c02_0": "此不應然(至)捨而不得。",
    "X53n0843_009:0533c03_0": "述曰此論主通難同時捨作用別故知有別體作用等因名同分捨異生同分得聖者同分違成聖道立異生性捨異生性不得聖性以聖身中有異生計故以用別故明知異體。",
    "X53n0843_009:0533c07_0": "同分非色(至)無別事類。",
    "X53n0843_009:0533c08_0": "述曰此經主下第二難同分非色不可現見如何知有先無別用無別事即身形等無別類即相牙等俱舍論中雖言無用上已辨用故置不論。",
    "X53n0843_009:0533c11_0": "由見彼果(至)現證知故。",
    "X53n0843_009:0533c12_0": "述曰此論主通見無別果知有同因即是比量觀行者知又是現量謂有漏道厭下同分及觀諦者緣苦樂心。",
    "X53n0843_009:0533c15_0": "何不許有無情同分。",
    "X53n0843_009:0533c16_0": "述曰此第三難人等相似既有同分表等相似何無同分。",
    "X53n0843_009:0533c18_0": "不應如是者(至)蒃豆等生。",
    "X53n0843_009:0533c19_0": "述曰此論主通若責如天等有同分者亦應如天等有生及趣成大過失。",
    "X53n0843_009:0533c21_0": "又佛世尊(至)別有同分。",
    "X53n0843_009:0533c22_0": "述曰此第二釋佛既不說理在絕言為解佛意復應思擇何唯依有情何緣知實有下有五重釋初二釋初後二釋後中一雙釋此即初也由諸有情各各欲樂有平相似故立同分等中無故無同然俱舍中經主意以緣法有情起同類學及言說故說有同分諸非情諸緣之亦智同覺施設故引非情為難令此論主既以各智相似為同故己善通彼難。",
    "X53n0843_009:0534a06_0": "又必因有情(至)說有同分。",
    "X53n0843_009:0534a07_0": "述曰此第二重以因內有外故約內說。",
    "X53n0843_009:0534a08_0": "又因先業證有實物。",
    "X53n0843_009:0534a09_0": "述曰此第三重以內有先業感得趣生同分有勤勇故引得勤策等同分前等中無故依內說即由二因以證果有問芬等是非業增上果及由勤勇種殖生耶解云二並依內非彼自有又疎遠設有名無。",
    "X53n0843_009:0534a14_0": "又木素漆(至)由此法生。",
    "X53n0843_009:0534a15_0": "述曰此第四重以像及真形雖多相似而唯緣一起真實言故知內法可有物類為實言依明知別有若無別者色等相似應俱言實。",
    "X53n0843_009:0534a18_0": "又前說故(至)有差別故。",
    "X53n0843_009:0534a19_0": "述曰此第五重指同上釋以有異故知有別體。",
    "X53n0843_009:0534a20_0": "是諸同分(至)覺施設耶。",
    "X53n0843_009:0534a21_0": "述曰此第四難同分既同分云何得智同覺言耶。",
    "X53n0843_009:0534a22_0": "由諸同分(至)而色性成。",
    "X53n0843_009:0534a23_0": "述曰此論主通是同因故體即是同如四大種自成色性此中言覺施設因者亦應如前於身中智覺施設更互相似亦可約所緣同分一解脫由前諸別因外法無同分。",
    "X53n0843_009:0534b03_0": "此應顯成(至)同異句義。",
    "X53n0843_009:0534b04_0": "述曰此第五難汝執有情同分遍有情故同勝論宗大同句義即第四大有諦餘有差別一切皆同□異句義即第五諦也。",
    "X53n0843_009:0534b07_0": "若勝論執(至)不應収採。",
    "X53n0843_009:0534b08_0": "述曰此論主通勝論所執與此不同彼執一法遍多法其體是常依和合諦方與法合如是等異若無此別同亦何遇豈以彼言所見是色令佛弟子言非色耶理中為正何論外道明人之難智者所慚。",
    "X53n0843_009:0534b13_0": "已辨同分(至)異熟居廣果。",
    "X53n0843_009:0534b14_0": "述曰此下大文第三明無想一明生處謂無根天中二明自體謂心心所滅三五事分別謂唯是異熟四明居所依謂廣果天。",
    "X53n0843_009:0534b17_0": "論曰若生無想有情天中。",
    "X53n0843_009:0534b18_0": "述曰此釋生處於彼天中多時無想故名無想雖亦滅心等以本脩定時唯厭想故立無想名恐濫草木故言有情情者謂識彼位雖無諸根體是識所依故而從類例說有情言亦可彼天具有二分無心之位名無想有心之位名有情總舉彼天為其生處。",
    "X53n0843_009:0534b24_0": "有法能令(至)如堰江河。",
    "X53n0843_009:0534c01_0": "述曰此釋自體謂有別法能令心等暫時不智能令想無故名無想從用為名。",
    "X53n0843_009:0534c03_0": "此法一向(至)名無想天。",
    "X53n0843_009:0534c04_0": "述曰此釋異熟性是無想定所感異熟由彼已下汎述大宗修無相者皆由天眼見彼天身形容殊妙寂靜無動有色無心謂是涅槃便生欣慕脩無心想定冀當尅證故彼色蘊并無相事決定唯用無想定感以非業故不能感眾同分命相入無想前出無想後多時有心四蘊異熟通用定業俱感無過相婆沙云無想無定不能造受身處所以者何非是業故業能造受身處及能得根命根無想定得無想諸餘是彼共根案婆沙似命色蘊亦是共根論者解異皆許五根通非業感然於餘處更無此例但無想定勢力強故能感五根非如得業命根如上既有延俱雖非總異熟而是持身主故亦唯業感以說彼天有多心故恐有難彼無想之名故以從多通釋名義。",
    "X53n0843_009:0534c18_0": "無想有情(至)名無想天。",
    "X53n0843_009:0534c19_0": "述曰此一問答明俱所依。",
    "X53n0843_009:0534c20_0": "彼以業生(至)二種俱有。",
    "X53n0843_009:0534c21_0": "述曰恐有難言如佛經說一切有情皆因食住彼無想中四食俱闕云何得住故今釋言彼以宿業為思食由受生心所牽引無間入無想心為資助亦可二心皆為牽引資助為識食又以彼識相應之觸為觸食故無心位唯有過去三食既食即無請有心位亦有現食間無想事體不從等無間緣生何故此中說之為食解云謂續生心等無間力引生彼地無想前心名等無間緣以彼為食若無彼者不生彼天無想之體無容得起亦可以彼出無想等無間緣為食資助力故。",
    "X53n0843_009:0535a07_0": "彼諸有情(至)順後受業。",
    "X53n0843_009:0535a08_0": "述曰此釋彼天由想智故便謂涅槃非真究竟便智彼地謗滅耶見便捨彼壽生於欲界先業力既更不進脩如箭墜地還生欲界生彼天中無欲界業故必應無有脩後受業北俱盧洲定生天故有生天業成先所造順後受樂或即於彼起順生業定有業義同非順後相似。",
    "X53n0843_009:0535a14_0": "已辨無想(至)非聖得一世。",
    "X53n0843_009:0535a15_0": "述曰此下大文第四明二定一結引二別名三辨相四依身結引別名如文可見辨相中先明無想定後明滅盡定就無想中一明自體即如前心等減二明依他即後靜慮三明作意即求解脫四明性攝即唯是善五明招果即唯順生受六明修者即非聖異生七明成就即初得一世。",
    "X53n0843_009:0535a21_0": "論曰如前所說(至)無想同。",
    "X53n0843_009:0535a22_0": "述曰此釋自體謂如是繫是例前義能滅心等與無想同。",
    "X53n0843_009:0535a24_0": "由正成辨(至)而入定故。",
    "X53n0843_009:0535b01_0": "述曰此釋無想定名此中定言梵云三摩鉢底唐言等至隨言便故標之以定謂無想定體正性相續能成大用故名等至即是等性至大用義或復等言顯最極義謂無初後聞窮至故名為等至即依等至義說為定有餘師釋不謂如理如理是善正故名等隨緣相續行故名至心所中定令心心所及所依大平等而行故名等至此無想定能令大種平等而行故名等至此法具前義故得名等至等至故名定何故名無想定補特伽羅身中無想名無想者此定是無想者所有就依士釋無想之定名無想定或即彼定與想相違即定無想名無想定是同依釋恐有難言於彼定中心心所滅何唯無想故下釋言想最麤動是所厭懷從於便立名故但名無想諸異生等既受入定故不厭受受與想相應故想滅時受等亦滅。",
    "X53n0843_009:0535b16_0": "此定在何地(至)靜慮非餘。",
    "X53n0843_009:0535b17_0": "述曰此釋所依地。",
    "X53n0843_009:0535b18_0": "此不應說(至)而修彼因。",
    "X53n0843_009:0535b19_0": "述曰此外人責此定能於無想異熟前欲說無想居廣果天後品說廣果在後靜慮果既已顯其因定隨何勞此中說依後靜慮地。",
    "X53n0843_009:0535b22_0": "此責不然(至)為無想因。",
    "X53n0843_009:0535b23_0": "述曰此論主破為無想因曾未說故。",
    "X53n0843_009:0535b24_0": "豈不前頌(至)說為無想定果。",
    "X53n0843_009:0535c01_0": "述曰此外人難前頌釋中說無想是無想是定果即顯此定為無想因即是已說。",
    "X53n0843_009:0535c03_0": "此亦不然(至)今說乃成。",
    "X53n0843_009:0535c04_0": "述曰此論主答前無頌說今乃顯成豈以前釋取後文即後文即食後頌中不說。",
    "X53n0843_009:0535c06_0": "何故此定名異生定。",
    "X53n0843_009:0535c07_0": "述曰此下釋作意故引經中說異生定為問徵智。",
    "X53n0843_009:0535c08_0": "為求解脫(至)名異生定。",
    "X53n0843_009:0535c09_0": "述曰此釋經文即解求脫作意謂諸異生執無想果為真滅諦解脫涅槃計無想定為能出離生既道諦依依脩行證解脫果方脩此定聖者不然故唯異生學名為異生定即釋頌中求脫作意為先而入。",
    "X53n0843_009:0535c14_0": "前說無想(至)一向是善。",
    "X53n0843_009:0535c15_0": "述曰此善性攝恐有難言前於無想何不脫為無記性攝故今釋言前言異熟無記自成。",
    "X53n0843_009:0535c17_0": "豈不此是(至)五蘊異熟。",
    "X53n0843_009:0535c18_0": "述曰此外人難為異熟因明知善性何勞說善。",
    "X53n0843_009:0535c19_0": "不爾頌中(至)誰復能遮。",
    "X53n0843_009:0535c20_0": "述曰此論主答為異熟因頌中未說故令說善為因義顯又不言善說異熟因雖遮無染無記有染無記誰復能遮西方諸師亦有即執此文言染無記異熟因攝者今謂不然色界唯是自業果故不能招欲界因果斷地故無記之法不堅實故諸論唯說不善善有漏為異熟因故竊謂論主此語失宗亦可由諸煩能閏生故相從義說為異熟因故今言善為欲遮彼又解曰次下句順生受言顯招異熟煩惱閏業相從亦有順受之義故應遮遣於此門中兼明無想定所感異熟即無根天五蘊果也。",
    "X53n0843_009:0536a07_0": "若爾此中應言純善。",
    "X53n0843_009:0536a08_0": "述曰此外人難若但言善非遮異性為欲遮故應說純言。",
    "X53n0843_009:0536a10_0": "不爾離言(至)已顯非餘。",
    "X53n0843_009:0536a11_0": "述曰此論主釋雖不說純純義已顯如異生性中說引食水風例又但言善有善即說不言餘性義准知無。",
    "X53n0843_009:0536a14_0": "此定既是(至)為順何受。",
    "X53n0843_009:0536a15_0": "述曰此下釋招果故先徵問。",
    "X53n0843_009:0536a16_0": "唯順生受(至)非約成就。",
    "X53n0843_009:0536a17_0": "述曰此論主釋一類法師言唯生受我如理釋通生不定謂諸外道得此定已迴心入聖聖道生已必不更智約非聖所行名異生定非據成就若入聖道必不受果故通不定俱舍論中經主不取如是正釋於前師解智不俱心言此定退得說必智得此定者必不入聖於此不信可謂聰明。",
    "X53n0843_009:0536a23_0": "又許此定(至)不樂入故。",
    "X53n0843_009:0536a24_0": "述曰此釋脩者此定通是此法異生即佛弟子外法異生即諸外道共所脩得非諸聖者此無想定既是有漏聖者觀之唯生厭患招生死果喻之帆然脩彼須求脫想故非聖者之所修習此文中言此法異生脩即證前修者得入聖有順不定受皆言異生不善聖即釋修者唯異生。",
    "X53n0843_009:0536b06_0": "頌中已說(至)便為無用。",
    "X53n0843_009:0536b07_0": "述曰此是論主彈頌煩身已言求脫為作意無勞更說非聖脩。",
    "X53n0843_009:0536b09_0": "此初得時為得幾世。",
    "X53n0843_009:0536b10_0": "述曰此下釋成就世寬狹故先徵問。",
    "X53n0843_009:0536b11_0": "此於諸位中(至)非離染得。",
    "X53n0843_009:0536b12_0": "述曰此正釋諸位者初後位中皆如欲界別解脫或得未曾故於初食時不得過去若得過去非謂未曾以無心故不脩未來故唯得一世第二食等心未知前恒有現在亦成過去即成二世出無心已來捨以前更無現在唯成過去恐有難言定心引智何不修未來故以天眼耳根為例通釋因無心故不脩未來此是善故有法後得無前得故非離染得別脩成故唯加行得。",
    "X53n0843_009:0536b20_0": "次滅盡定(至)三十四念故。",
    "X53n0843_009:0536b21_0": "述曰此下相明滅定於中一明自體謂如前滅心等二明作意謂求寂靜住三明依地謂依有頂定四明性攝謂唯善是性五明招果謂通於三種六明脩者謂聖非異生七明初得謂俱由加行。",
    "X53n0843_009:0536c01_0": "論曰如前無想(至)名滅盡定。",
    "X53n0843_009:0536c02_0": "述曰釋中初釋頌文後通經義釋頌文中亦有亦七分此釋自體謂亦然聲為例如無想能滅心心所。",
    "X53n0843_009:0536c05_0": "如是二定(至)而得證入。",
    "X53n0843_009:0536c06_0": "述曰此釋作意為顯與前無想定別故對解釋前無想定執果為解脫唯厭於想執定為出離道令滅盡定求現寂靜住為現法涅槃厭於麤動觀滅盡定心心所滅但是止息由止息故遠離散動得寂靜住寂靜住謂身凝宗止息謂心等滅。",
    "X53n0843_009:0536c11_0": "前無想定(至)有滅盡定。",
    "X53n0843_009:0536c12_0": "述曰此釋依地所以非想名有頂者上業所生有中勝故名有頂或最上邊名為頂。",
    "X53n0843_009:0536c14_0": "何緣下地無此定耶。",
    "X53n0843_009:0536c15_0": "述曰此責下地無滅定意。",
    "X53n0843_009:0536c16_0": "厭背一切(至)中際心斷。",
    "X53n0843_009:0536c17_0": "述曰此論主釋得此滅定由具二緣一緣一切心下地不厭上二色際謂斷極上心下地不能斷上故。",
    "X53n0843_009:0536c20_0": "於三性中(至)為寂靜住。",
    "X53n0843_009:0536c21_0": "述曰此釋性攝謂唯是善以染及無記皆是散動聖聖者厭之無容更取以為靜住。",
    "X53n0843_009:0536c23_0": "前無想定(至)四蘊異熟。",
    "X53n0843_009:0536c24_0": "述曰此釋招果取正理故言前無想順生不定滅定退者許得受生故通後受為顯此等皆受於異熟果說故言約異熟果下地盡滿即全不受既見別說全不受知三種但約時說今此方言異熟不定亦可此亦不定中收下分其果即是簡一明滅定所感異熟即非想天中四蘊。",
    "X53n0843_009:0537a06_0": "前無想定(至)得滅盡定。",
    "X53n0843_009:0537a07_0": "述曰此釋脩者謂唯聖得非諸異生以有頂地見所斷或是智滅定自地障礙異生未斷故無能入。",
    "X53n0843_009:0537a09_0": "有餘師說(至)非諸異生。",
    "X53n0843_009:0537a10_0": "述曰此敘異說即經主解異生怖斷所以入現涅槃勝解方得入此故聖不怖斷有涅槃勝解異生相違故唯聖得。",
    "X53n0843_009:0537a13_0": "彼說非理(至)無差別故。",
    "X53n0843_009:0537a14_0": "述曰此論主難破經主釋若異生怖斷無涅槃勝解應無無相定所以者何二無心定心皆斷滅外道亦緣無想以為涅槃是即涅槃勝解無差別斷滅之理斯一由此不脩滅滅定例亦應無無想故釋非理。",
    "X53n0843_009:0537a19_0": "此中有說(至)故不怖斷。",
    "X53n0843_009:0537a20_0": "述曰此敘世親師主如意論師同釋前義入無想者經滅麤心猶有上地細心為依非令斷滅故不怖斷。",
    "X53n0843_009:0537a23_0": "彼亦非理(至)非為正因。",
    "X53n0843_009:0537a24_0": "述曰此論主破失脩無想本為滅心明不怖斷既求解脫智出離想明失亦用涅槃勝解為方漏入故彼所言異生怖斷無涅槃勝解不成過故非為正因。",
    "X53n0843_009:0537b04_0": "一切聖者(至)滅盡定不。",
    "X53n0843_009:0537b05_0": "述曰此下釋初得故先徵問。",
    "X53n0843_009:0537b06_0": "應言不得(至)離染得故。",
    "X53n0843_009:0537b07_0": "述曰此論釋加行方智非離染得故得有頂時未即得彼意。",
    "X53n0843_009:0537b09_0": "由何而得。",
    "X53n0843_009:0537b10_0": "述曰此責得時。",
    "X53n0843_009:0537b11_0": "由加行得(至)亦成過去。",
    "X53n0843_009:0537b12_0": "述曰此論主釋由加得得如無想定。",
    "X53n0843_009:0537b13_0": "世尊亦以加行得耶。",
    "X53n0843_009:0537b14_0": "述曰此外人責如來一切德皆離染得若言滅定加行得世尊亦爾耶。",
    "X53n0843_009:0537b16_0": "不爾。",
    "X53n0843_009:0537b17_0": "述曰此論主略違。",
    "X53n0843_009:0537b18_0": "云何。",
    "X53n0843_009:0537b19_0": "述曰此外責。",
    "X53n0843_009:0537b20_0": "成佛時得(至)盡智時得。",
    "X53n0843_009:0537b21_0": "述曰此敘俱舍經主解謂盡智時得。",
    "X53n0843_009:0537b22_0": "豈不盡智(至)亦有過失。",
    "X53n0843_009:0537b23_0": "述曰此中論主彈經主釋有不中理去言得者謂是初獲初獲即是至生相時若至現在名為成熟不名為得計成佛時即是盡智至乎現在當此之時盡智亦非得何況滅定得盡智時謂金剛定盡智之得住於生相爾時名得盡智起時但可名曰伍立現行言佛功德離染得者謂金剛定名為離染由彼離染令佛功[仁-二+(彰-章)]之得至於生相名離染得非成佛時方始得也故彼所言暫起欲樂皆現在前此言無過言成佛時得此言有過非全違理是故說亦亦有過失。",
    "X53n0843_009:0537c09_0": "隨宜為彼(至)定成佛故。",
    "X53n0843_009:0537c10_0": "述曰此是論主代經主通難理實得言在菩薩位今於近佛成熟事說遠菩薩初得聲故於佛位說得無過又金剛定無間成佛即名為佛約彼位中言成佛得斯亦無過。",
    "X53n0843_009:0537c14_0": "且置斯事(至)俱分解脫。",
    "X53n0843_009:0537c15_0": "述曰此假為向且止成佛時名得不名得論滅定無心故無未來修佛盡智時先未曾起既不成滅定何名俱解脫。",
    "X53n0843_009:0537c18_0": "永離定障故(至)成俱解脫。",
    "X53n0843_009:0537c19_0": "述曰此論主釋定障者謂有漏心上無堪任性此永離故未成佛時於滅盡定應得不得有未得退彼不依佛身成佛時捨名捨不成就又解於滅定有一類不得依未斷鄣身彼已永捨如得聖時捨異生性聖道非得無厭有餘聖道不得故成佛時有依佛身滅定非依未斷鄣者已永斷故名俱解脫又雖未得於得自在立比量言盡智如來名俱解脫於起滅定得自在故如已起位。",
    "X53n0843_009:0538a03_0": "西方師說(至)後得菩提。",
    "X53n0843_009:0538a04_0": "述曰此乾地衛國薩婆多師作如是解謂彼菩薩見道圓滿生無漏心入滅盡定方入脩道於盡智時成過去故名俱解脫。",
    "X53n0843_009:0538a07_0": "迦濕彌羅國(至)後方生盡智。",
    "X53n0843_009:0538a08_0": "述曰此舉能方毗婆沙釋菩薩學位不起滅定。",
    "X53n0843_009:0538a09_0": "何因此國知前未起。",
    "X53n0843_009:0538a10_0": "述曰此責北方師前未起因。",
    "X53n0843_009:0538a11_0": "何為不責西方起因。",
    "X53n0843_009:0538a12_0": "述曰此北方師語其不向西方起因意意欲亦徵先已起因。",
    "X53n0843_009:0538a14_0": "此我迦濕(至)安觸心故。",
    "X53n0843_009:0538a15_0": "述曰北方師釋未起意謂彼菩薩時入觀時發願發斯所作未辦終不重起故於中際無起異心若起即有越斯心過故知菩薩不入滅定。",
    "X53n0843_009:0538a18_0": "理實菩薩(至)無漏聖道。",
    "X53n0843_009:0538a19_0": "述曰此西方師釋俱舍中云外國師說即印度諸國薩婆多師釋意同故隨舉皆是彼說縱入滅定暫越無漏道實非越歸心。",
    "X53n0843_009:0538a22_0": "若爾斯心如何不越。",
    "X53n0843_009:0538a23_0": "述曰此北方難智有漏心即名為越如何不越。",
    "X53n0843_009:0538a24_0": "謂我未得(至)諸事究竟故。",
    "X53n0843_009:0538b01_0": "述曰此西方釋必定盡漏故言不越中間智定於理何違。",
    "X53n0843_009:0538b03_0": "豈不由斯(至)為非前因。",
    "X53n0843_009:0538b04_0": "述曰此北方師難見所斷惑能為惑因故名根或煩惱得名或於脩所不斷或引以外境故名怨歒菩薩要動欲脩脩未曾道狀除諸或見道滿時事未究竟無始已來為有漏定之誑惑滅盡定者既是有漏即能誑或世間諸定之類也與聲聞共兼之易得豈容菩薩本[玄*(句-口+匕)]未滿而能尊彼稽留大事若起彼定即[玄*(句-口+匕)]心[玄*(句-口+匕)]心既不越故知喻未起故以三十四念得菩薩提故證前未起其理尊成。",
    "X53n0843_009:0538b12_0": "如契經言(至)觸此三觸。",
    "X53n0843_009:0538b13_0": "述曰此下通經義如摩訶俱瑟祕羅經作如是問出滅定時當觸佛言具壽當觸三觸乃至廣說何者是三觸體云何觸彼觸耶。",
    "X53n0843_009:0538b16_0": "有說滅定(至)觸於三觸。",
    "X53n0843_009:0538b17_0": "述曰此釋前經問有三義說此即初也三解脫一相應觸如其次第名三觸其義云何我我所執掉舉名動空無我行能對治故能破動故名為不動不動相應觸不動觸貪心執境攝為己有有所執故名所執故名三摩地能斷所有名所有餘如前說生死十相五境生住滅界女涅槃中無為無相無相之定緣無相故名為無相餘如前說此是三觸體住無心時無此等觸出時忽遇名觸如闇中行忽遇壁等是謂觸三之義。",
    "X53n0843_009:0538c02_0": "有餘師說(至)現在前故。",
    "X53n0843_009:0538c03_0": "述曰此第二師解識處方便唯觀於識空處方便亦唯觀空無異想故名為不動彼相應觸名不動觸根本地中雖通異想從方便說皆名不動無所有處無先遍識所有有頂地中無有想異無二分明相故名無相乃至有頂下可言無相故四無色皆名有想是謂三觸體智滅定心通有漏無漏若有漏者若逆次入非想等至名觸無相觸若逆超入無所有處乃無漏逆次第入無所有智觸無所有觸若無漏逆超入處名觸不動觸雖不得入空處以二處皆名不動觸一即具其名又釋此師非正宗義是異部師許從滅定入空處等故作是釋。",
    "X53n0843_009:0538c14_0": "復有餘師(至)名為無相。",
    "X53n0843_009:0538c15_0": "述曰此第三師解但取一念無漏無所有處緣滅諦涅槃心約體是無漏非有漏故名不動約地名為無所有約所緣名無相彼相應觸具三種名入彼心時名觸三觸。",
    "X53n0843_009:0539a01_0": "雖已說二定(至)滅定初人中。",
    "X53n0843_009:0539a02_0": "述曰此下第四明佛身前辨相中若自體皆滅心心所生攝俱唯善初得一世是謂多同依地作意招果脩者兼長行中異熟是謂多異今於此中明依身即二定俱依欲色為同初起即無想通二滅定初人是謂有異。",
    "X53n0843_009:0539a07_0": "論曰言二定者(至)是名同相。",
    "X53n0843_009:0539a08_0": "述曰釋論中初釋頌文後釋妨難釋頌中初釋依身以衣同相謂總相說二定俱依欲色界身然熟無想中有三家異說初言在下三次言餘無想是自類異釋亦無妨難唯第三說不通色界亦是自部異師有違教過發惠論說色有謂色界是五行謂具五蘊過知迦葉佛時名五蘊為五行論主取彼名而造論或即五蘊無常名行彼論中以色有五行相對四句第一句者謂是色有而非五行謂生色有有想天中起他界心無漏心入二無心定及生無想天已入無想彼皆是色非色有五行第二句者謂在欲界入諸靜慮第三句生色界住自界心第四除上說既有生色有入無相定故言不入違自教過。",
    "X53n0843_009:0539a21_0": "言異相者(至)唯具三蘊。",
    "X53n0843_009:0539a22_0": "述曰釋初起一謂無想定因天眼通見彼無想有情謂為涅槃便即脩故於色界中有得初起若滅盡依說力起唯於欲界有佛為說者有俗為釋者居惱故有強加行故得初起非於上地宿習力故色界復智非於無色以諸蘊相依故無一蘊獨住心心所必俱亦無獨三蘊可有二蘊謂入無心亦有四蘊謂入無色餘皆可易。",
    "X53n0843_009:0539b05_0": "何因故知滅定有退。",
    "X53n0843_009:0539b06_0": "述曰此外人責問言滅定退出色界云何知耶。",
    "X53n0843_009:0539b07_0": "準鄔陀夷(至)色界受生。",
    "X53n0843_009:0539b08_0": "述曰此論主答雖無正□文准義可解謂舍利子曾於一時於大眾中說如是義有說苾蒭乃至廣說今解滿足者謂無漏解得無學果名為滿意成天者謂諸化生不由父母由意所樂住意即成名意所成天說彼義時鄔陀夷於大眾中形言相違背言無是處舍利嘿然後至佛邊乃至廣說由生色界知退已失。",
    "X53n0843_009:0539b15_0": "如是廣釋(至)有差別故。",
    "X53n0843_009:0539b16_0": "述曰此總結二定別相地謂後定有頂有差別故二加行有異出離止息故三相續即前異生聖者四異熟即前長行中說無相有頂異熟別故五順受處有異無相順生不定滅定順生後不定六初起無想通二界滅定唯人中是謂差別六門文中不說無差別者有門一自體門二種攝門三得世門四依身門是謂為同。",
    "X53n0843_009:0539b23_0": "○釋第十三卷論",
    "X53n0843_009:0539b24_0": "今應思擇(至)滅受想定。",
    "X53n0843_009:0539c01_0": "述曰此下釋妨難此總標疑勸令思擇所滅是總立名唯別何也。",
    "X53n0843_009:0539c03_0": "猒逆彼二(至)入滅盡定。",
    "X53n0843_009:0539c04_0": "述曰此論主釋由方便中漏厭此二見受所依二淨根故生死依依供方便約二立名。",
    "X53n0843_009:0539c06_0": "有餘師主(至)乃至廣說。",
    "X53n0843_009:0539c07_0": "述曰此下釋滅定滅法多少此是自部異師解理實言之心心所法同生同滅同得同斷故滅中一切皆斷然如來說隨眾生宜或說滅受想以過多故或識滅心是所依故或名滅盡心心所盡故對法諸師唯依正理顯其本意不執一文不得聞滅受想便謂留心聞言滅心即謂留所執一非餘未為通論舉識不離已顯兼所舉受及想言滅意行明亦滅心無上菩提言心不放逸為本明不亦攝精進精進亦然智慧能害煩惱明知亦攝無常想欲貪者欲界貪乃至廣說色無色貪等。",
    "X53n0843_009:0539c17_0": "譬喻論者(至)互不相離故。",
    "X53n0843_009:0539c18_0": "述曰此敘鳩摩羅多門徒釋彼宗所執唯一心王隨用差別立種種名無別心所但心緣境第一剎那初了名識第二剎那取像為想第三剎那領納名受第四已去造作名思諸餘心所皆思差別識想受三唯無記性思心已去方始通三入滅定者滅想受心由此二麤是所厭故識心雖非所厭定中亦不得智是無記故於行位中思之差別為滅定體以實言之即是心就用言之是心所故彼定中必有心體但無受想之位何以知然稱滅受想定故知無受相必定無有無心有情既曰有情明知心有又契經中具壽毗舍佉問佛言世尊入滅盡及與命終為有別不佛言有別去命終者身行斷壽命斷諸根壞煗觸滅識離身入滅定者身行斷語行斷意行斷壽命不斷諸根不壞煗觸不滅識不離身如是即顯有心故異無心識不離異於離又說壽等互不相離定中有壽煗明知亦有識。",
    "X53n0843_009:0540a10_0": "此說非理(至)俱生滅故。",
    "X53n0843_009:0540a11_0": "述曰此論主破去有心體必受想俱既曰有心寧無受想。",
    "X53n0843_009:0540a13_0": "有何至教證此義成。",
    "X53n0843_009:0540a14_0": "述曰彼師責心必受想俱生滅言憑何至教取信為實。",
    "X53n0843_009:0540a16_0": "如契經說(至)離受想生。",
    "X53n0843_009:0540a17_0": "述曰此論主引經證必俱義。",
    "X53n0843_009:0540a18_0": "又此定中(至)一切皆滅。",
    "X53n0843_009:0540a19_0": "述曰恐彼釋言識心若起必受等俱於此定中俱有行心而無識心故無受等故今難言若以識心所依無故能依受想亦無行中心所亦無所依云何獨起如是即應一切皆滅。",
    "X53n0843_009:0540a23_0": "若謂此俱言(至)此亦應爾。",
    "X53n0843_009:0540a24_0": "述曰此牒釋經言俱者前後相隣非謂並智此定中心戒從前受等入戒後受等生亦是俱智故不違經引之而例如久易可解立比量言此經言俱非日並起說俱聲故如彼二經。",
    "X53n0843_009:0540b04_0": "理必不然(至)非無間起。",
    "X53n0843_009:0540b05_0": "述曰此論主破彼之二經與此有別不可一例曼駄多經智心與隨因果不並又彼經中說以故聲是第五囀從於智心生墮落第五囀聲多明前後由此道理可不同時不淨覺支性相違故同時有過可前後智今此所引同時無過故必同時如是江顯所立同喻差別所立不成之過。",
    "X53n0843_009:0540b11_0": "又執俱言(至)顯同時義。",
    "X53n0843_009:0540b12_0": "述曰此引二輕說以俱言目同時義有之云心經雖不言俱亦是俱義恐彼釋言貪無間起名有貪心故即遮言諸善無記貪次第起皆名有貪成太過失如是二經言俱非善又顯前因有不定過。",
    "X53n0843_009:0540b16_0": "又受想等(至)應不得生。",
    "X53n0843_009:0540b17_0": "述曰此又難彼所許心心所法前後而起心所依心所名斯立起時無心如何得起。",
    "X53n0843_009:0540b19_0": "若謂心作(至)當更廣辨。",
    "X53n0843_009:0540b20_0": "述曰恐彼釋言心次第起名為心所故牒彼計下即破言心從心之生應名心心所之生心應是所依後當更說。",
    "X53n0843_009:0540b23_0": "又契經說(至)受想二法。",
    "X53n0843_009:0540b24_0": "述曰此又引經諸意行滅即應心所皆滅以識心所皆意行故彼言雖滅受想自散相違。",
    "X53n0843_009:0540c02_0": "又識相續(至)亦應不滅。",
    "X53n0843_009:0540c03_0": "述曰此又以彼心不滅故以理徵令受想二法亦不得滅。",
    "X53n0843_009:0540c05_0": "若謂如經(至)聞受等緣。",
    "X53n0843_009:0540c06_0": "述曰此牒外計俱舍說言是尊者世友說亦譬喻師差別也彼謂經言受緣受有受不生受雖言觸生受何妨有不生此師許定中有觸無受想。",
    "X53n0843_009:0540c09_0": "此例不然(至)必有受等。",
    "X53n0843_009:0540c10_0": "述曰此論主難俱舍中說尊者瞿沙亦薩婆多異師也彼難言受生於愛經中自荀言有不生觸生於受由來決定不可一例。",
    "X53n0843_009:0540c13_0": "有餘師(至)而無觸者。",
    "X53n0843_009:0540c14_0": "述曰此第二師釋言應有受想難以於定中觸亦無故受依何生。",
    "X53n0843_009:0540c16_0": "未知彼意(至)但有虗言。",
    "X53n0843_009:0540c17_0": "述曰此論主難無觸義故先徵其觸體所以問者薩婆多師三和生觸云三和者必是觸觸□因故亦得名觸經部宗中三和即觸既有三和理應即觸今許有識為三和而言無觸非知所許。",
    "X53n0843_009:0540c21_0": "又滅定中(至)理必應有。",
    "X53n0843_009:0540c22_0": "述曰又以理難若執滅有心而經中說諸意行滅教力證故亦應無心若無思便無思慮以思慮由田可故思既無故心亦應無由此即證無心有情決定應有故彼所言無無心有情理逼為虗說。",
    "X53n0843_009:0541a02_0": "有命等故(至)色心隨一。",
    "X53n0843_009:0541a03_0": "述曰此彼引異命終難有命根根不壞等在名為異所以者何有命故名有情非由心以無色界無色無心位無心是有情故命不孤起隨依一種。",
    "X53n0843_009:0541a06_0": "引契經說(至)仍名不離。",
    "X53n0843_009:0541a07_0": "述曰此以現身必起名不離通前識不離身離。",
    "X53n0843_009:0541a08_0": "引壽煗識(至)必無有心。",
    "X53n0843_009:0541a09_0": "述曰此以約少分說通前三法樂不相離雜恐他許言無色界有色故指下破上來具顯於滅定中有心有過無心無失以此故知決定無心。",
    "X53n0843_009:0541a12_0": "然定後心(至)所引發故。",
    "X53n0843_009:0541a13_0": "述曰就彼說者心本不斷於生無離恐彼難言滅位無心後云何知故今釋云入心為等無間緣恐又難言等無間緣無有差別云何起定心有遲速故今釋言由寶斯力所引發故。",
    "X53n0843_009:0541a17_0": "滅盡定體為假為實。",
    "X53n0843_009:0541a18_0": "述曰此下明體假實初總問起次述正釋三敘異論四廣徵破此即問起也。",
    "X53n0843_009:0541a20_0": "應言此定(至)令不生故。",
    "X53n0843_009:0541a21_0": "述曰此述正釋此滅定力能遮正心有大用故猶如心等其體實有。",
    "X53n0843_009:0541a23_0": "經主於此(至)是有為攝。",
    "X53n0843_009:0541a24_0": "述曰此下敘異論即俱舍中經主亦經部中異師釋也彼說滅定全無有心由前定心力別引起一類與心相違所依相續令後餘心暫時不轉由前定心與後餘心相違起故前心能遮非滅定體有大用因有不成過前心所引心不轉者俱是心無更無別事前心之後後心之前於此分位假立定體恐有難言依無而立云何滅定許是有為下即解云即此假定約前後無似有生滅假說有為。",
    "X53n0843_009:0541b08_0": "或即所依(至)假立為定。",
    "X53n0843_009:0541b09_0": "述曰此亦即彼師徒異釋即彼所依違心而起即假說之為滅定體。",
    "X53n0843_009:0541b11_0": "若爾後心從何而起。",
    "X53n0843_009:0541b12_0": "述曰此下廣徵破沙宗既初入定心能遮心故非心生因現復無心復從何起。",
    "X53n0843_009:0541b14_0": "彼說此依(至)為種別故。",
    "X53n0843_009:0541b15_0": "述曰彼師釋由前定心重身成種即從彼生無色界沒從心生色從滅定起依色生心故言展轉互為種子。",
    "X53n0843_009:0541b18_0": "何有此理(至)俱時起故。",
    "X53n0843_009:0541b19_0": "述曰此論主難有根身中一切心種皆無缺少境復現前應俱時起。",
    "X53n0843_009:0541b21_0": "說依前心(至)境識俱起。",
    "X53n0843_009:0541b22_0": "述曰此是論主述以己宗生緣唯一無俱起過。",
    "X53n0843_009:0541b23_0": "若執不待(至)欲符彼執。",
    "X53n0843_009:0541b24_0": "述曰此重申難若無別緣即應俱起此言便似方便欲明上座部等許有多識同時俱起以有多因果應俱故。",
    "X53n0843_009:0541c03_0": "若言所說(至)不從彼起。",
    "X53n0843_009:0541c04_0": "述曰此牒彼釋唯從種生據無心起在定位故不可多心有心位中從自類智故無多識同時起過。",
    "X53n0843_009:0541c06_0": "此亦非理無異因故。",
    "X53n0843_009:0541c07_0": "述曰此論主難有想身中有種義一初從彼起後即不能無異因證又初起心種俱壞遍何不多識俱時而起更無異因證心初起定無多種。",
    "X53n0843_009:0541c10_0": "又有心位(至)生起餘心。",
    "X53n0843_009:0541c11_0": "述曰此第二難無心位身餘心種子現被損伏當能生心有心位中既不被損轉應能生理實言之現損者應不能生。",
    "X53n0843_009:0541c14_0": "若言此位(至)餘心生者。",
    "X53n0843_009:0541c15_0": "述曰此牒外釋於彼身中雖有少分違心心種謂入定心種子能有無量不違心種從彼心生。",
    "X53n0843_009:0541c17_0": "有心位中(至)有根身生。",
    "X53n0843_009:0541c18_0": "述曰此論主難無心位有不違種既能生心有心位亦例能何不生也應立量言有心之位心應依種有心種故如無心位。",
    "X53n0843_009:0541c21_0": "又如有執(至)聞不嗤笑。",
    "X53n0843_009:0541c22_0": "述曰此引共知例顯其過如是意顯心從前生於定位中俱有遮力無生心力。",
    "X53n0843_009:0541c24_0": "又執滅定(至)都無有義。",
    "X53n0843_009:0542a01_0": "述曰此正破彼前師定體云言假法雖依於實以無實故假法亦無定位中無前後何別俱是無故不可言有無義恒故復非有為無所依故亦無假有。",
    "X53n0843_009:0542a05_0": "若言假定(至)可說為善。",
    "X53n0843_009:0542a06_0": "述曰此破第二重有所依以假從實應無記攝。",
    "X53n0843_009:0542a07_0": "是故唯(至)實而非假。",
    "X53n0843_009:0542a08_0": "述曰此續定也由前道理初入定心能引後故無遮顯礙力滅定之體既是尊性明不依身不可無依而立假法又遮心用不可言無有大用因還得成立故知別有實法名為滅盡定體唯能遮礙無生心力。",
    "X53n0843_009:0542a13_0": "脩觀行者(至)還生意識。",
    "X53n0843_009:0542a14_0": "述曰恐有難言前心能引後何因斷絕滅定能遮礙後何得生故今釋言由滅定遮礙有因而不起前心引力故定盡心復生既以定能遮心有用故知體實前心引後唯一故無多起問俱舍論中能明後心起因別明定體假實何故此論總今說耶解云經主意許前心有遮力種子生後心定中心並滅滅定體是假後三義因時故應別顯今此論宗前心能引後種子如前定中心並滅滅定體實有能遮礙於心意欲以能遮心證其體實故遮引義於對明。",
    "X53n0843_009:0542a24_0": "由此准釋(至)隨其所應。",
    "X53n0843_009:0542b01_0": "述曰此以滅定例餘無心然於無想少有差別所謂不得言入定心應言趣無想心不得言安斯力出應言因勢盡不得以應無記攝為難有相符過但應以能遮心證其有體彼所依身與前因相前應如後後應如前比量所逼非能遮體無想定中大分相似子細分別非無亦異故約此說隨其所應。",
    "X53n0843_009:0542b08_0": "已辨二定(至)能持煗及識。",
    "X53n0843_009:0542b09_0": "述曰此下明命根上句句云名下句因證命是活義壽是斯限決定之義斯限已來活即為命故知命者即壽異名而壽體相越諸根境故以能持煗識作用比知立比量言壽體實有大用故猶如大種。",
    "X53n0843_009:0542b14_0": "論曰命體即壽(至)謂三界壽。",
    "X53n0843_009:0542b15_0": "述曰此下釋於中初釋頌文後思隨義此引本論釋上上云名本論即是發智論說。",
    "X53n0843_009:0542b17_0": "異名雖爾(至)何法名壽。",
    "X53n0843_009:0542b18_0": "述曰此下釋下句故先領異名徵其壽實體。",
    "X53n0843_009:0542b19_0": "謂有別法(至)說名為壽。",
    "X53n0843_009:0542b20_0": "述曰此下答初述正宗後破異執此正引經證其有用即釋下句成前因義能說三法能持於身若捨身時身便強仆仰倒為強仆面為仆即是倒臥取終之義故知由壽持於煗識三法共聚能持於身令得久住此能持因即是壽體。",
    "X53n0843_009:0542c01_0": "若爾此壽何法能持。",
    "X53n0843_009:0542c02_0": "述曰此外徵二有壽持誰復持壽。",
    "X53n0843_009:0542c03_0": "此壽能持(至)能持煗識。",
    "X53n0843_009:0542c04_0": "述曰此下答為異經主初言煗識能持於壽為難所逼方言業得故言我說一句是業為遮彼難何不許業能持煗識何用壽耶如是即顯有大用因不成之過故今釋言壽有二義故為業持一唯業異熟二常續無斷煗闕一義謂雖無斷有非異熟謂長養等流識闕二義謂有非異熟謂等漏剎那識及有間斷時謂處無心位雖於無色及惡趣中不入無心有第二義闕初義故非業所持所以者何若唯依業非異熟者誰之所轉間斷位中業持何法。",
    "X53n0843_009:0542c14_0": "非非業滅(至)壽力所持。",
    "X53n0843_009:0542c15_0": "述曰釋以於非業耶滅識中業無少用故非業持識由有壽故斷而復起若無壽者斷不重生故壽持識豈不無業識亦無耶不爾等流非業生故豈不異熟必依業耶不爾從多明類說故。",
    "X53n0843_009:0542c19_0": "復如何知壽能持煗。",
    "X53n0843_009:0542c20_0": "述曰此問壽持煗因。",
    "X53n0843_009:0542c21_0": "要有壽者(至)非煗所持。",
    "X53n0843_009:0542c22_0": "述曰此釋有煗必由壽故知壽持煗恐有難言有煗必有壽應說煗持壽故下破言如無色界有壽無煗故知彼壽非煗所持。",
    "X53n0843_009:0543a01_0": "豈不無壽亦無有煗。",
    "X53n0843_009:0543a02_0": "述曰外難如外煗無壽煗應非壽持。",
    "X53n0843_009:0543a03_0": "雖亦既有(至)俱行煗故。",
    "X53n0843_009:0543a04_0": "述曰此論主通說內非外何成例難若又難言我亦應說煗俱行壽應可通同非俱行者何能為持彼若復言外煗無壽何能持者應告彼曰既云外法何次說持。",
    "X53n0843_009:0543a08_0": "由此故知(至)說之為壽。",
    "X53n0843_009:0543a09_0": "述曰此總結由前道理煗之與識非業所持既為壽持顯壽大用持煗及識前因復成。",
    "X53n0843_009:0543a11_0": "經主於此(至)非別實物。",
    "X53n0843_009:0543a12_0": "述曰此下破異執一敘計二徵體三廣述四徵破此即敘計也即俱舍中經主所引我亦有壽宗義相符俱非許有別物為體。",
    "X53n0843_009:0543a15_0": "若爾何法說為壽體。",
    "X53n0843_009:0543a16_0": "述曰此徵體也。",
    "X53n0843_009:0543a17_0": "謂三界業(至)住時勢分。",
    "X53n0843_009:0543a18_0": "述曰此廣述也即經部計謂三界業隨其所應引三界果六處并依依即扶根及心所等此所引果從始至終前能引後相續勢分即此勢分說為壽體彼勢分有相續決定由彼相續有定限故隨應住時爾所時住如穀種所引芽等乃至熟時相牽勢分箭喻例知是故但於并依六處住時勢分假說為壽非別有物。",
    "X53n0843_009:0543b01_0": "壽體實有(至)住時勢分。",
    "X53n0843_009:0543b02_0": "述云此下徵破成立為有如前根處謂彼前言由有命故施設諸根及根差別由此有彼有無彼無又於眾同分能續能持故於無色界要有命根身有所生處決定故起染等非命終故由此等用當知實有彼言經主說諸大種住勢分名為命根如復當破故命枝之謂無色界無內五處或起餘心又無異熟意更異勢分於彼既無說何為壽若有異熟住時勢分可名命根此無色界處此起餘心時既無異熟勢分說何法為命所依既無說何為勢分此依第一轉明無勢分體。",
    "X53n0843_009:0543b12_0": "既無所引(至)復囑於誰。",
    "X53n0843_009:0543b13_0": "述曰此明相續決定本是勢分義相續決定既無所天依第六轉明相續等無所屬主。",
    "X53n0843_009:0543b15_0": "既無如是(至)說為壽體。",
    "X53n0843_009:0543b16_0": "述曰此明由有相續決定義故說隨應住時爾時所住無相續等依第三轉明無所由此亦無異說何為壽。",
    "X53n0843_009:0543b19_0": "是故經主(至)都無所表。",
    "X53n0843_009:0543b20_0": "述曰此續定也。",
    "X53n0843_009:0543b21_0": "又所引喻(至)說名命根。",
    "X53n0843_009:0543b22_0": "述曰此明二喻皆無間斷於有間斷不成為喻反顯有間便無勢分彼義不立別有義成。",
    "X53n0843_009:0543b24_0": "如是命根(至)亦有命根。",
    "X53n0843_009:0543c01_0": "述曰此結命根不依於二。",
    "X53n0843_009:0543c02_0": "若爾命根依何而轉。",
    "X53n0843_009:0543c03_0": "述曰此問所。",
    "X53n0843_009:0543c04_0": "此依先世(至)亦准命根。",
    "X53n0843_009:0543c05_0": "述曰此出命正依先業兼依現在眾同分住眾同分准命亦依先業及現命根。",
    "X53n0843_009:0543c07_0": "今復應思(至)俱盡故死。",
    "X53n0843_009:0543c08_0": "述曰此下思擇隨所應義此先思擇身死之因引施設論其文易了俱舍經主第四句中謂亦應言捨壽行故其理不然捨壽行者引滅業令滅富樂即是滅壽業盡故應初句攝故於第四不應復言今以理釋既引令招富異熟果受已命終亦應容在第三句攝恐有難言福盡命不盡實有受若而活命盡福不盡必無不死而受故知俱盡之位福盡於死無能只可言壽盡故死何勞言福盡故故今釋言實無功能俱謂於俱盡位有死說為俱盡故死依第七處說第五轉思之可知。",
    "X53n0843_009:0543c18_0": "發智論說(至)彼言何義。",
    "X53n0843_009:0543c19_0": "述曰此舉發智論文責其說意。",
    "X53n0843_009:0543c20_0": "若所依身(至)非時死故。",
    "X53n0843_009:0543c21_0": "述曰此釋若如身可害名隨相續身不可害名之便住初顯命根有身損障而斷復顯命根無身損障不斷即由此義證有第四抂橫而死名非時死然俱舍中經主意許壽無別體即所依身是故隨身轉及恒住故恒有障等為婆沙師釋。",
    "X53n0843_009:0544a02_0": "經說所得(至)自捨命故。",
    "X53n0843_009:0544a03_0": "述曰此又通釋經中句此釋初句也欲界諸天除地居者以彼恒若何素落戰有破傷故空居諸天非地所害俱由發起增上喜受身心勞弊便致命眾賢□師於舊釋外以義復如捨壽行者理恐有違以諸聖者可他害故亦可論主約正住在邊際定時非他所害亦可准約佛捨壽說以佛必無因於他害而命終故即同俱舍又應說佛自涅槃故。",
    "X53n0843_009:0544a10_0": "唯可自害(至)損害故。",
    "X53n0843_009:0544a11_0": "述曰此釋第二句。",
    "X53n0843_009:0544a12_0": "俱可害者(至)欲界有情。",
    "X53n0843_009:0544a13_0": "述曰此釋第三句謂除那落迦等餘欲界有情。",
    "X53n0843_009:0544a14_0": "俱非害者(至)主處胎時。",
    "X53n0843_009:0544a15_0": "述曰此釋第四句那落迦者業力所業非由害而致命終北俱盧洲命分定故王佛者謂輪王太子既灌頂已先應學習古昔仙王所行梵行故謂王仙以彼當紹輪王位故非自他害佛使者如時轉迦舊云耆婆或言耆域並訛略也唐言命者能濟諸命故以標名或名能活下針定差投藥必愈故以名也彼由使入火取有明故知非所害佛所記別者如殊底色迦舊云樹提伽訛也唐言有明彼之父母其家巨富年邁無子忽因懷孕問諸外道或言是女而不遐齡及其問佛佛記是男長年具德外道無識方便藥中母喪焚軀子安無損即由其為佛所記別佛令命者入而抱出委如經說達弭羅等三人如經中說皆由業力於嬰兒時或投猛獸或置曠野或墜深坑而不頭逝長者子耶舍即昔如來在婆羅痆斯國鹿野苑中轉法輪時大長子名之耶舍應感祥夢走赴如來路遊尼連禪河不為所溺蒙佛告慰善來入道鳩摩羅時婆其人是鹿母之子為大義所眩遂損之首在車馬屢踐不損容儀頻毗娑羅王因出而見收而養焉後遂長大出家獲果最後身菩薩即所住最後身謂王宮所生也菩薩在胎時菩薩福力母亦無損輪王例焉。",
    "X53n0843_009:0544b13_0": "若爾何故(至)受生有情。",
    "X53n0843_009:0544b14_0": "述曰此外人難如前所解俱非害中所攝乃眾令於二界一界少分何故此經唯言非想。",
    "X53n0843_009:0544b16_0": "彼經舉後(至)舉後顯相。",
    "X53n0843_009:0544b17_0": "述曰此下通難總有三義此即也如初靜慮有離生樂謂之種安諸地亦有唯言初者舉初顯後顯初。",
    "X53n0843_009:0544b20_0": "或除有頂(至)從彼處歿。",
    "X53n0843_009:0544b21_0": "述曰此第二釋下諸無色四靜慮中皆應攝在第一句攝以彼亦起□耽定味貪而命終故而非重貪故言起於種類煩惱非即皆如欲界天也若依此釋便與前解四句文違非此論主所存之義。",
    "X53n0843_009:0544c01_0": "或餘無色(至)俱非所害。",
    "X53n0843_009:0544c02_0": "述曰此第三釋以非想地自無無漏名非自害又無上地近分定害名無他害餘地相違是即應是第三句攝故第四句唯乎非想。",
    "X53n0843_009:0544c05_0": "豈不有頂(至)應名他地。",
    "X53n0843_009:0544c06_0": "述曰此是俱舍經主之難有頂亦為他地聖道所害是即應是第三句。",
    "X53n0843_009:0544c08_0": "若依此說(至)不名他故。",
    "X53n0843_009:0544c09_0": "述曰此是論主前解者通經主難謂如是難亦可通釋以世間說勝者為他謂如怨言今高勝豈念下流不見愍言他今次溺我應濟拔故知他言唯依勝轉故今言意顯上地又諸卑劣力不制強而得說言他他力勝不見勝者言他力劣故上制下有自在能不名他故是故非想雖有下地聖道所害下非他故不名他害。",
    "X53n0843_009:0544c16_0": "然於此中(至)非自他所害。",
    "X53n0843_009:0544c17_0": "述曰此是論主以上道理破師解謂佛經中所言害者皆據因害而致命終斷或名害非經本旨若據斷煩惱不應言致死既言致死明知非約斷煩惱說而今乃以斷或為害非當聖言又若案此那落迦等皆為他地聖道所害是亦應是第二句攝非謂第四故言斷或為害便與前釋相違今謂此中違前釋難有少難解其義云何此第三師釋若唯以斷或為害即三無色四靜慮地第二句攝欲界一切第二句攝非想一地第四句攝闕第一句若亦兼以煞傷為害即欲界中非自害者第二句攝可自害者第三句攝如是二根其那落迦皆應許是第二句攝從與前師義相違者恐非過難以第三解本欲為違前二釋故是故但應以違經意一難使屈無煩後難亦可經中先有此判那落迦等第四句攝論主今言違經前釋其難即成西方釋義有言於此三異根中□論主意取第二為勝今解唯取初釋為勝云何得知如前建立行蘊中言四得自體契經中說生在非想非非想天俱非所害非不一切色無色立俱非所害舉後攝初故作是說彼文既是論主正釋明知此中意取第一良為上地所有煩惱害含藏起而微劣又無外境之所牽逼上地命根勝業所引豈因結或而致命終故應但以初釋為中。",
    "X53n0843_009:0545a22_0": "然彼尊者(至)乃至廣說。",
    "X53n0843_009:0545a23_0": "述曰此中又引彼經後文向教興意謂彼經世尊分別四得自說聽俱了然舍利子我第四句尋復生疑世尊為通意顯必死以一切生皆歸死故若第四句唯維有頂即彼所言斷煩惱不俱言自地若第四句通攝於下即應隨於一切善起若有能斷一切煩惱便般涅槃不斷殞歿通於一切俱非害者下釋經意恐諸有情聞彼彼類俱非所害便謂是善故重問答明其必死謂彼諸類雖非可害然由福命盡故致死或有一先盡所以有中夭非由被害而致命終西方釋家有言此文偏依有頂即顯前文俱非可害唯非想意直取文意似不相當故非所樂應更思擇。",
    "X53n0843_009:0545b11_0": "命行壽行(至)壽行差別。",
    "X53n0843_009:0545b12_0": "述曰此一問答解釋命壽差別之相於中總有五師解釋總而言之命是活義存義住義未死即名為命壽是定義斯義限義近得不名為壽是故有壽非命有命非壽有通命壽第一解生不生法一對分別得業所引限皆決定失緣不生便無活義第二解雖約捨意與前同第三解明所延命時限無定故非壽攝本壽業引名壽亦命第四解明謂智慧即延命時無明諸煩惱即潤生時所望雖別意同第三第五解以所延命雖無學得業所引者通於一切故約此分別意亦同第三如是五解皆附正理所以者何若案正理命壽無別如本論言云何命根謂三界壽若通義說括前五義應成四句壽非命者謂諸命根住不生法命非壽者謂由定力延得命根壽亦命者謂先業因生法命根第四句者解前諸相。",
    "X53n0843_009:0545c03_0": "順正理論述文記第九",
    "X53n0843_009:0545c05_0": "永超東域傳燈錄云順正理論述文記元瑜撰業品已下未成序神昉撰西大寺本有二十四卷元興寺本有二十卷成辨序云或二十卷或二十四卷(已上)。",
    "X53n0843_009:0545c09_0": "寬政六甲寅年於洛西久瀨村光福寺講俱舍論之日得此本於智積院大眾藏令本誓寫之惜哉但第九一冊未見餘後學當弘通全本。",
    "X53n0843_009:0545c12_0": "豐山愛染院住沙門　林常快道　誌"
}