{
    "X53n0836_004:0033a21_0": "俱舍論疏論本第四",
    "X53n0836_004:0033a22_0": "大慈恩寺沙門　神泰　述",
    "X53n0836_004:0033a23_0": "○分別根品第二之二",
    "X53n0836_004:0033a24_0-0": "一問今應思擇一切有為如體相不同生亦各異別生耶為有諸法決定俱生二答有定俱生三總舉一切法略有五品等四簡無為無生此中不說今先辨色決定俱生自下二十七行頌明三聚法於中初一行頌辨色聚俱生文中初舉宗次舉頌本後釋頌本文中有十六初釋初兩句色聚中極細之者立微聚之名為顯更無細極於此者此在欲界無聲無根生山河地等八事俱生隨一不成云何八事謂四大種及四所造色味香觸二無聲有根下釋下兩句無聲有根諸極微聚此俱生事或九或十謂有身根聚九事俱生八事如前身為第九有餘眼等四根聚十事俱生九事如前加眼等一以眼耳鼻舌必不離身根故四極微聚十事俱生四根展轉相望處論受各別故不相加也上來文同雜心論極微在四根十種應當知身根九餘八念法師等依此以為正義然婆沙有兩師釋初師云一切四大必不離色聲一切欲界色必不離香味第二師云一切四大不必有色聲一切欲界色不必有香味念法師依雜心論判婆沙二師義皆為不正兩師合取方是正義初師云一切四大必不離色一切欲界色不離香味是正義一切四大必不離聲不正義第二師云一切四大不必有聲是正義不必有聲及一切欲界色不必有香味是不正義若依正義應云一切四大必不離色不必有聲一切欲界色必不離香味方順雜心是正義者此大謬也迦旃延云誰成就聲持答曰欲色界又雜心云無想眾生十八性故知婆沙初師一切四大必不離色聲一切欲界色必不離香味是正義也故今論云於前諸聚若有聲生如次數增九十十一以有聲處不離根生謂論有執受大種因起然雜心論及此論頌不說聲者以聲因大種相擊方生故此論別加雜心略而不說故正理論第十卷",
    "X53n0836_004:0033a24_0-1": "云無聲無根八事俱生此若有聲即第九事而不說者顯因大種相擊故生非如色等恒時有故問內身中聲何大種相擊故生非答如內身之中常為外風擊發故生故正理論云表色在欲界初靜慮中非上地可言有表問語表已無何有聲處答外大種為因發聲不遮外色故無有失又成實論破薩婆多云有論者言四大種相擊觸同故有聲是義不然故知眾生身中常為外四大相相觸礙故常有聲故欲色界定成就聲無想眾生十入性也問若言身中常觸故有聲者何故正理論云顯因大種相擊故生非如色等恒時有故答外大常觸礙內大故言大種相擊故生色等四塵不由常相擊任運恒有故別說也婆沙第九十云身色聲觸界欲色界成就無色界不成就者問身色觸界可爾聲界云何恒時成就有作是說大種合離必生聲界有情若在欲色界中大種恒有故常發聲評曰彼不應作是說若四大種必恒生聲此所生聲何大種造若即此造應多有對色一四大種生若說餘造餘四大種復必生聲如是展轉有無窮過應作是說生欲色界有情身中多四大種在一身內有相擊者便發聲不相擊者即無聲起雖一身中必有聲界非諸身分皆遍發聲婆沙一百二十七云問一四大種為但造一造色極微為能造多答應作是說一四大種但能造一造色極微有說造多評曰如前說者好也三經部問若四大種不相離生於諸聚中隨一可得非餘四於彼聚中下論主述薩婆多答於彼四大聚中勢用增者明了得一餘三大體非無如觸針鋒與籌合觸針鋒與籌合為一束但觸身時針勢用強但覺針鋒不覺籌也又如鹽味與麨合味人若甞時鹽勢用強但覺鹽味麨體非無正理論第五卷",
    "X53n0836_004:0033a24_0-2": "云今應思擇若諸大種色聚中增為體為用何緣復勸如是思擇為欲蠲除不實過故經主自論有處說言此是彼宗所有過失彼宗謂彼毗婆沙師言諸聚中一切大種體雖等有而或有聚作用偏增如心心所又如所覺團中鹽味未審此中經主意趣定謂誰是毗婆沙師若謂善釋阿毗達磨諸大論師彼無此說彼說大種由體故增石水焰風諸色聚內堅濕煗動體相偏增一一聚中各了一故若諸聚內大種體均不應此中各唯了一又隨世想立地等名應全無因空有言說以諸色聚形顯皆同若執堅等體均無異因何得生地等別想若謂因用理必不然用與自體無差別故用若是實即體增成實即體故用若非實亦體增成不異體故無非實用異體有增由此即釋彼心心所團中鹽喻謂鹽受等用即體故即體用增總說如是然有差別謂諸大種有對礙故可積聚故方處差別分明可了受等無對不可積集但由用別了增微異是故大種體可積集就體說增心心所法就用差別說增微異豈不色法亦見用增如酢和水良藥和毒鹽和水等雖兩類同而用有異如何言色就體說增此不相違以酢與水觸微雖等而味不同酢味微多水味微少故酢味勝還由體增於諸聚中有味等物體增強故謂是用增良藥毒等緣起理門有差別故體類如是由此雖少而能伏多非異體類有別用生故執用增是為邪計五經部重問云何於彼一一聚中知亦有餘三大種六薩婆多答由一一大聚中有水攝火熟風長地持業四大業故知具有四大有餘師說過緣堅等便有流等相故故知堅等中先有水等大又如水聚中由極冷故有煖相起雖不相離而有冷用增者如雲中水由冷相擊則出電電即火大也又如人作石灰燒石後石已冷用水沒之即便火出又如受及聲用有勝劣故但覺勝受不覺劣受聞聲之時但聞勝聲不聞劣者有餘師說於此一大聚中餘有三大種子功能未有體相故契經說於本聚中有種種界界謂種子七經部問如何風中知有顯色而不可見八此我但可信教故知不可以理比知或風所合香現可取故香與顯色不相離故亦可比知有顯色也九類釋色界前卷",
    "X53n0836_004:0033a24_0-3": "說色界香味並無故彼無聲有六七八有聲有七八九俱生此可准知故頌不別說十外人問此頌中言事為依法體說為依十二處說十一論主反責外人若爾何過十二外人出過二俱有過若依體說八九十等便為大少由諸微聚必有長短等形色有多極微共聚集故重觸輕觸定隨有一滑觸澀觸隨一亦然或處有冷有飢有渴故於八中有長有重有滑有冷有飢成十三種九成十四十成十五是則所言八九十者有太少過若依十二處說八九十等便為太多由四大種觸處攝故八應說四九應說五十應說六是則所言八九十等有太多失十三論主釋二俱無過應知此頌中所言事者一分依體說謂所依四大種一分依十二處說謂能依造色五根四塵十四外人問若爾大種事應成多如八事中四所造色各別依一四大種故所造有四能造四大種四四十六便成二十何故說八九事應說二十四十事應說二十八也十五論主釋應知此中依體類說諸四具五具六具四大種類無別故不別說也正理論云若謂事言依體依處太少太多成過失者所依能依依體依所差別說故無有過失謂所依事依體而說若能依事依處而說或唯依體亦無有失由此中說定俱生故形色等體非決定有光明等中則無有故或唯依處然為遮遣多誹謗故別說大種多誹謗者或謂謗言大種造色無別有性或復謗言無別觸處所造色體或復謗言非一切聚皆具一切或復謗言數不決定別說大種此謗皆除若言大種各各別生造色果故應成多者其理不然約類說故解云此有三說初約依體依處說與俱舍同第二唯依四大體說由此說造四根四大體中說決定與造四根大種決定俱生者故說有十種或十一種如長短形色等體非一切四大種中決定有色光明等中唯有顯色光明即無長短等形色今言造根大種聚中十色等決定俱生第三說此中或唯依處能為遮遣多誹謗故處外別說大種十六論主責外人何用分別如是語為語隨欲生顯數多少隨欲不定應思擇義何須多語。",
    "X53n0836_004:0035a12_0-0": "自下十二行頌辨心聚於中初五行頌辨五大地次有四行頌辨五品心起數多少次有兩行頌辨心所差別後有一行頌辨心所眾名就初五行頌中初有四句辨心心所俱行相得並文中初結前生後次舉頌本後釋頌本文中初釋初句心與心所決定俱生如自在名我我必有所於所自在心自在故如非心王自在故必於所故心數名心所也次釋第二句諸行即是一切有為三聚諸行前句必俱言流至於此第二句中謂色心等二聚諸行生時必與有為四相俱起故言諸行相也言或得者謂諸行內唯有情法與得俱生餘無情法不然不定故言或因明心與所俱故通舉行與相並然意欲明心亦與相或得俱也次有兩句舉五大地數就釋頌中初舉心所且在五品此即舉數釋初句也二何等為五下問答列五品名釋第二句也三地謂行處下總釋數名義地謂所依行處如世間地是人所依行處若此心王是彼心所所依行處即說此心王為彼心行法地正理論第十卷",
    "X53n0836_004:0035a12_0-1": "云若此是彼容心所行即說此法為彼法地次有一頌辨通大地法文中有四初釋大地名義想等十數名為大法心王與十大法為地從果為名故說心王名為大地地辨大地名義中若十法為心王所有從能有為名想等十法名大地法謂大法恒於一切心有故名為大非餘心所正理論云地即是心大法地故名為大地此中若法大地所有名大地法謂法遍與一切品類一切心俱生由此故心非大地法外心俱生故二問彼大地法是何三舉頌答四釋頌本文中有三初釋第四句婆沙傳說如是十法諸心剎那和合遍有自古諸師建立大地種種不同如猶論師五義建立通大地一通三界二通六識三通三性四通漏無漏五通並頭起餘三十六不具五義故不立也長耳三藏具八通無八居立通大地烋法師具九義立通大地今依俱舍但一義立謂通於一切心餘三十六不遍一切心故不立也二此中已下釋上三句十法名義文中七法可解言慧謂於法能有簡擇者依此論宗推求名見決斷名智簡擇名慧也作意謂能令心驚覺者雜心名憶此云作意正理論第十一卷",
    "X53n0836_004:0035a12_0-2": "云謂於所緣能作動意名作意相問若於所緣唯作動意諸餘心所應不能緣若此難非理諸心所法依心轉故但動於意餘動亦成故無心所不能緣過心王若無作意應如人眠無所覺知由作意故能令心王不眠名驚覺也勝解謂能於境印可者雜心論名解脫今名勝解於境解脫印可必爾名勝解也三歎心聚難知諸心心所以無形故異相微細前後一一相續分別尚難況一剎那十法俱時而有也有色百味諸藥其色根取其百味差別尚難了知況無色法唯覺慧取耶四結如是已說十大地法次一行頌辨十善地法文中初釋地名義信等十法名大善法心王與大善法為地從果為名名大善地此釋名中若信等法為大善地所有從能有為名名大善地法謂十法恒於諸善心有故名大善亦簡心王二問彼十法是何三舉頌答猶論師具五義建立善大地一遍三界二通六識三通漏無漏四並頭五唯是善今頌但一義釋謂唯遍善心唯簡通大地地大地雖遍善心而不唯善通三性故遍善心簡餘二十六數不遍善心四釋頌本文中初釋唯遍善心如是信等諸法唯遍善心二牒信釋初釋令心澄淨二釋於四諦三寶善惡本論業果中現前忍許三牒不放逸釋謂能修諸善法三問離諸不善法外復何名能修三答謂此於善法專注修習性四餘部經釋能守護心不造諸過名不放逸四牒輕安釋一薩婆多立宗輕安者謂心堪任性二經部難豈無經亦說身輕安耶三薩婆多釋雖非無說此如身受依色根身故名身而體是心應知五識相應輕安亦爾四經部責若五識相應有輕安心法者五識不與意識同時如何可立此為猗覺支耶五薩婆多釋應知此覺支經中身輕安是七種所造觸中輕觸令身輕舉身堪任性與無漏意識同時起也六經部難輕安輕觸體是有漏色法復如何說此為猗覺支謂七薩婆多釋能順覺支故無有失以身輕觸色輕安能引覺支心輕安故八經部問餘亦見有是隨順相從說耶九薩婆多答有如經說喜及順喜相應法名喜覺支嗔及生嗔相應俱有自分遍因緣法名嗔恚蓋等正理論第十一卷",
    "X53n0836_004:0035a12_0-3": "云有作是言此中既說身輕安故非唯心所說名輕安此言非理受等亦應同此說故然五識相應諸受說名身受有作是說設有輕安體非心所然此中說心所法故不應說彼以能隨順覺支體故亦名覺支謂身輕安能引覺支心輕安故亦見餘處嗔及嗔因名嗔恚蓋見思唯勤亦名慧蘊雖彼嗔因思惟及勤非嗔非慧然順彼故亦得彼名此亦應爾五釋捨一薩婆多立宗心平等性無驚覺性說名為捨二經部問如何可說於一心中有作意驚覺性捨無驚覺性相應起三薩婆多釋豈不前說諸心心所其相微細難可了知四經部責有法雖能了由審推度而復可知此中作意捨最難可知如何相違背俱起不乖反五薩婆多釋此作意有驚覺於餘捨則無二體既懸殊俱起何乖反六經部難若爾不應同緣境或應一切貪無貪等別體相違皆亦相應七薩婆多釋如是相違俱起種類所餘諸法此中應引來為例釋如疑智相違無明與慧明乖反皆同時起或想取相受不取相即是有想無想相違而同時起如彼所引理趣相違法得同時起今於此有警覺無警覺中應知亦爾然貪無貪障治別故不俱起也六釋慚愧二種指後當釋七牒二根釋謂無貪無嗔無痴善根大地法故不重說也八牒不害釋謂無損惱九牒勤釋謂令心勇悍十結如是已說大善地法此十法中自古諸師皆云翻八有體謂翻信為不信等翻二無體謂輕安無不輕安翻捨無不捨者不然今依俱舍正理論釋翻十皆有體謂翻輕安為昏沉故舊俱舍云翻安為不安不立煩惱大地於誰有失又翻捨為掉故正理論第十一卷",
    "X53n0836_004:0035a12_0-4": "云心平等性說名為捨掉舉相違如理所引令心不越是謂捨義。",
    "X53n0836_004:0036b17_0": "次半行頌釋煩惱大地文中有四初釋大煩惱地名義類同前釋二問彼法是何三舉頌答自古諸師亦五義建立一通三界二通六識三通二輪四並頭起五唯不善及無記今依俱舍但一義釋謂恒唯染恒簡三十數唯染簡通十也四釋頌本文中初釋痴釋痴者所謂愚痴即是無明無智無所顯照放逸懈怠不信如文可解次牒昏釋昏謂昏沉二對法中說下引本論證五識相應名身昏沉性意識相應名心昏沉性是名昏沉重無堪任昏沉異名也三問此是心所如何名身四答如身受言故亦無失次牒掉釋掉謂掉舉令心不靜唯有如是六種名大煩惱地法。",
    "X53n0836_004:0036c05_0": "上來第一論主立宗二法救問豈不釋本對法中說有十種又於彼本論不說昏沉等三論主釋答天愛汝今但知本論至言不閑意旨西方呼愚痴人為天愛養名天愛也四法救問意旨者何五論主答論失念等五法已說在大地法中如無痴慧為體故非大善法彼五數亦應爾即通中染污念名為失念等故本論說若是大地法亦大煩惱法應作四句如文可解念等五法大煩惱地中重說者古師釋云受生愛分相不生見分思是業性從煩惱發不順生煩惱觸有和會釋塵之功無有生惑之用欲生愛分不生見分此之五法生惑不能故唯通大地念等五法通生見愛二分煩惱生惑中引故重說也又釋念定慧作意勝解皆是功能法名恐非染引心俱故重說也又餘師執邪等持性非即心亂竟彼師作四句與此四句不同第一句謂受想思觸欲等持第二句謂不信懈怠無明掉舉放逸心亂第三句謂失念不正知非理作意邪勝解第四句謂除前相又云大謂許昏沉通與一切煩惱相應不說在於大煩惱地法於誰有過六法救又作是言應說在此大煩惱地而不說者順等持故彼法救謂諸有昏沉行者速發等持非掉舉行七論主問誰昏沉行非掉舉行等此未嘗不俱行故八法救答雖爾應知隨增說行九論主結本宗雖知說行隨用偏增而依同時有體建立地法故此地法唯六識成此六唯遍染心俱起非餘故亦釋頌本恒唯染也十總結前如是已說大煩惱地法。",
    "X53n0836_004:0037a06_0": "次半頌辨大不善地文中初釋大不善法地名義類同前釋二問彼法是何三舉頌答古師亦以五義建立一通六識二通二相三並頭起四唯不善五唯欲界今依俱舍但一義釋謂唯遍不善心唯簡遍十遍不善心簡三十四數也四釋頌本如文可解。",
    "X53n0836_004:0037a11_0": "次一行頌釋小煩惱地法文中有四初釋小煩惱法地名義二問彼法是何三舉頌答四釋頌本古師亦以五義建立一不通三界二不通六識三不通三性四不通二輪五別頭起今依俱舍以三義建立一如是類法唯修所斷二意識地起三無明相應分別現行具此三義名為小煩惱地法此法如後當廣分別二總結上文如是已說五品心所三復有此五品心所餘不定心所謂惡作睡眠尋伺等取貪嗔慢疑以上八法不定入五大地故名不定心所。",
    "X53n0836_004:0037a20_0": "上來五行頌辨大地等五自下四行頌辨五品心起數多少於中初三行頌辨欲界心品起數多少第四行頌明上二界心起數多少既前文中初問次舉頌答後釋頌本文中初且明欲界舉數列名有五品心次然欲界心下別明三性五品心起數多少即為三段就初明欲界善心中文有其七初釋初頌然欲界心定有尋伺故善心品必二十二心所俱生謂通十善十及尋為伺非諸善心皆有惡作若有惡作時增數至二十三將釋此文須知心聚相應自力四句多少一相應非自力有二十九謂通九除慧善十大惑五除無明不善大地二地外尋伺及眠二自力非相應有十五謂小惑十地外愛恚慢疑悔三亦相應亦自力有二謂通中慧大惑中無明如通中慧若作五見則自力起餘則相應也大惑中無明若與九使十小惑及悔俱則相應也不共無明則自力四非相應非自力謂心王也又須知心所三性染淨差別有二十二唯染非淨謂大惑六不善二小惑十愛恚慢疑有十唯淨非染謂善大地十有十四通三性染淨謂通十地外尋伺悔眠今文中善心品俱必二十二謂十大地相應通淨十大善地唯淨相應地外尋伺相應通淨故必定俱惡作及眠不恒起雖通淨品別加增至二十三四餘二十二唯染非淨故不俱也非諸善心皆有惡作若有惡作增體增數至二十三惡作自力起餘二十二相應從也。",
    "X53n0836_004:0037b20_0": "上來第一立宗二問惡作者何三答惡所依體名為惡作應知此中緣惡作法從境為名說名惡作謂緣惡作心追悔性從行解名應名為悔從所緣名說名惡作如緣空解脫門說名為空緣不淨無貪說為不淨皆隨境立名也或隨所依立名又見世間約所依處說能依事如言一切村邑國土皆來集會村邑國土人所依故說人為村邑國土也惡作即是追悔所依故約所依說為惡作又於果上假立因名惡作境是因生追悔心果於追悔果體假立惡作因名也如說此眼等六根六觸處應知名宿作業亦是於果立因名也四問若緣己作惡事心追悔生可爾若緣未作業云何名惡作五答於未作業亦立作名如追悔言我先不作如是事業是未作事而言是我惡作也六問何等惡作說名為善七答謂於善不作於惡作中心追悔生說名為善與此相違名為不善此二善惡悔各依善惡二處而起。",
    "X53n0836_004:0037c12_0": "上來雖有七文合為第一明善心品俱自下第二明不善心於中初明不共心品文中初汎舉若於不善不失心品必有二十心所俱生謂十大地法以通染相應故六大煩惱法二不善地法以是染相應故並二不定謂尋為伺以是通染及相應相三問何等名為不共心品四答謂此四品唯有不共無明以無明使通相應自力故自力起者見道所斷名不共無明無有所餘貪煩惱等九隨眠故不說與餘二十六俱者以十善地唯淨非染故十小煩惱愛恚慢疑悔自力起故有時眠俱復別加故次明不善餘煩惱品於不善三見相應心品亦有二十心所俱生名則如前不共品說非見增故有二十一以即於十大地法中慧用差別說為見故慧是相應自力起故也言不善見相應心者謂此心中三見也於四不善貪恚慢疑自力心品有二十一心所俱生二十如不共加貪等隨一於前所說忿等十小惑亦二十一心所俱生二十如不共加忿等隨一不善惡作亦二十一二十加不共惡作第二十一下總結略說不善品中不共無明及三見相應心唯有二十餘四大煩惱及十小惑並悔隨煩惱此十五相應心品有二十一心品俱生雜心但說愛恚慢疑有二十一文略也。",
    "X53n0836_004:0038a09_0": "自下第三明無記品於中初明欲界無記有覆心若於無記有覆心品唯有十八心所俱生謂十大地法通染相應故六大煩惱地法相應染故并二不定者謂尋為伺通染及相應故欲界無記有覆心者謂與身邊二見相應此中不增見通數如前釋次明於餘四無記無覆心品許唯十二心所俱生謂十大地法并二不定尋伺以通無記及相應故外方諸師欲令惡作亦通無記此相應品便有十三心所俱起正理論云有執惡作亦通無記憂如喜根非唯有記此相應品便有十三心所俱起釋云外方諸師欲令憂通三性故執惡作為無記憂俱然雜心論悔增三品是外國師義有說憂唯善不善前後相違也四明眠增五品應知睡眠與前所說一切五品心皆不相違通一善二不善三無記性故隨何品有即說此增謂如前欲善二十二增二十三善悔二十三增至二十四不善不共品及三是二十增至二十一愛恚慢疑十小惑及悔二十一增至二十二有覆無記十八增至十九無覆無記十二增至十三外方諸師自悔十三增至十四不正義也若眠增五品增體亦增數若悔增二品如善二十二增悔二十三增體亦增數悔是自力起二十二隨從若於不善品增體不增數如不共無明自力起一向不增悔悔亦自力起愛恚慢疑十小惑自力起悔亦自力起故於十四惑不增悔也悔亦自力起餘并隨從故亦大一增體不增數也。",
    "X53n0836_004:0038b09_0-0": "次一行頌明上二界心所多少文中初結前生後次舉頌本後釋頌本於中初釋上一句初定中於前欲界所說五品說心所法除唯不善惡作睡眠餘皆具有唯不善者謂瞋煩惱除謟誑憍所餘忿等七小惑及無慚愧此十唯不善并悔眠餘皆具有者如欲界說餘三十四謂通十善十大惑地六謟誑憍尋伺愛慢疑次釋第三句中間定除前所除十二又更除尋十三餘三十三皆具有次釋第四句第二定已上乃至無色除前所除十三又除伺等三等者顯除謟誑餘三十皆具有次引經證上地無謟誑經說謟誑極至梵天眾相依故上地無有正理論云以從欲界乃至梵天皆有王臣眾生等別故有云謟誑上地無馬勝比丘思惟四大何處永滅為欲知故遍問六天並皆不解故往問梵王梵王不知無餘滅位恥於眾故便矯亂答我於此梵眾中尊故是大梵統攝一切皆得自在故名自在能作器世間名作者能化有情世間名化者下重釋以能生器世間者故名作者以養育有情世間者是一切有情世間父故名化者作是謟誑以引出眾外謟言慚謝令還問佛婆沙九十八云問此中是梵是大梵得自在有何差別答是梵者謂執梵王五取蘊果是真清淨寂靜安樂是大梵者謂執梵王五取蘊果是諸真淨寂樂中尊得自在者如謂梵王五取蘊果有最勝用統攝一切皆得自在如是皆名取劣為勝謂執穢苦為真淨樂及有淨樂最勝用故真樂淨者諸滅道諦滅道二諦俱是真勝一切法中涅槃最勝是善是常超餘法故有為法中所王道最勝能永超越生死法故問於梵世中梵王最勝觀彼為勝應是正見何說彼是惡見耶答曰若謂唯於梵世中勝容非惡見然彼謂於一切最勝故惡見攝彼於諸佛獨覺聲聞及上諸天皆為劣故又彼妄執五取蘊果同真滅道故惡見攝問此中於世間能造化能生生是彼父等有何差別答於世間者謂於有情世間及器世間能造化者謂能造作器世間及能化作有情世間能生生者謂能生生非情數物重顯造義是彼父等者謂是一切有情之父重顯化義此執皆是非因許因謂執梵世五取蘊果能造化作一切世間然諸世間有情數者各從自業煩惱而生非情數者一切有情業增上力共所引起彼於劣果執為勝因既非因計因故戒禁取攝此及前見取俱迷果處苦諦生故皆見苦所斷又我常執力所引故如彼皆成見苦所斷婆沙百二十九云諸四大種依何定滅乃至廣說答如佛昔在室羅筏城住誓多林時有比丘名曰馬勝是阿羅漢獨於靜室作是思惟諸四大種何處永滅為欲知故入勝等持即以定心於誓多林沒欻然出在四大王眾天從定而起問彼天眾諸四大種何處永滅天眾告曰我等不知是四大種何處永滅然我所事四大天王智慧威德普殊勝彼或能了可往問之尊者即時詣四王所作如上問皆云不知彼共推三十三天眾三十三天復推帝釋帝釋仰推夜摩天眾夜摩天眾推蘇夜摩天子蘇夜摩天子推都史多天眾都史多天眾推珊都史多天子刪都史多天子推樂變化天眾樂變化天眾推妙變化天子妙變化天子推他化自在天眾他化自在天眾推妙自在天子妙自在天子推梵天眾如是尊者遍問欲天竟不能知大種滅處欲往梵世入勝等持復以定心自在宮沒梵眾天生從定而起化如上問梵眾咸曰我等不知有大梵王是非大梵作者化者為一切父自在生育具大威德無與等者無有不見不了不識彼定能知仁者應往問尊者復問大梵所在梵眾答曰我亦不知大梵天王定所在處仁欲見者隨處諦求即有光明於中而現尊者馬勝遂起誠心願大梵王於此眾現應時大梵即放光明便自化身為童子像首分五頂形貌端嚴在梵眾中隨光而現尊者前進問曰大仙諸四大種何處永滅梵王不達作矯亂言比丘當知我是大梵是自在者作者化者生者養者為一切父此是諂誑所發語業尊者告曰我不問仁梵非梵等但問大種何處永滅爾時大梵如此比丘非憍亂言卒能翻造便執兩手引出眾外此是謟誑所發身業出眾外已謝尊者言我實不知大種滅處然諸梵眾咸謂我是自在作者無不知見若我眾中云不知者是諸梵眾便見輕蔑尊者自失近捨如來遠勞見問致無所獲今可速還詣佛請問如佛所說應正受持馬勝既聞梵王推佛歡喜辭退復入等持即以定心於梵世沒欻然還生誓多林中從定而起整理衣服往世尊前恭敬作禮問四大種何處永滅爾時世尊即告彼云汝欲問者當是問四大與短長細麤淨不淨於何處永棄名色滅無餘佛經雖作是說而爾廣分別今欲廣辨故作斯論諸四大種及所造色依何定滅答依四定或依未至滅依四定者謂依四靜慮依未至滅者謂依初靜慮近分及四靜慮中間空無邊處皆名未至並未能入勝根本地而現前斷煩惱故。",
    "X53n0836_004:0039b19_0": "次兩行頌辨四對八心所差別文中初結前生後二無慚下舉兩對心所問其差別三舉頌答四釋頌本於中先釋初兩句此辨差別中無漸無愧別者於諸尸羅等功德及親教師等有功德者於此二境無敬無崇是無慚相即是敬崇所歒對法正理論云諸功德者謂尸羅等有德者者謂親教等於此二境無敬無崇是無慚相即是敬崇能障礙法或緣諸德說為無敬緣有德者說為無崇無所忌難無所隨屬總顯前二或隨次第無敬故無所忌難無崇故無所隨屬一立宗為諸善士所呵厭法說名為罪於此罪中無見怖畏說名無愧此中怖言顯非愛果能生怖故二問不見怖言欲顯何義為見而不怖名不見怖謂為不見彼怖名不見怖謂三論主反責若爾何失四外人何論二俱有過見而不怖應顯邪智若不見彼怖應顯無明五論主答此言不顯見與不見六外人問何所顯謂七論主答此顯別有無愧法是隨煩惱為彼見無明二因說名無愧正理論云前應顯無明後應顯邪見此言不顯見與不見為無愧體但顯有法是隨煩惱能與現行無智邪智為隣近因說名無愧有餘師立宗謂於所造罪自觀無耻名曰無慚觀他無耻說名無愧二外人問若爾此二所觀不同云何俱起三論主答不說此一時俱起別觀自他然有無耻觀自時勝說名無慚觀他時勝說名為無愧慚愧差別翻前兩釋可解。",
    "X53n0836_004:0039c19_0": "次釋下兩句明愛敬別愛謂愛重體即是信然汎解愛有二一有染謂貪愛如愛妻子等二無染愛謂信如愛師長等下四句分別可解有餘師說信者謂忍許有德由此為先方生愛樂故愛非信正理論云信復有二一忍許相二願樂相若緣是處現前忍許或即於中亦生願樂此中愛者是第二信或於因中亦立果稱前信是愛隣近因故名愛無失釋云前說據初義後說依後義敬謂敬重體即是慚如前解慚謂有敬等下兩句分別可解有餘師說敬者有所崇重由此為先方生慚耻故敬非慚正理論云然復有言有所崇重故名為敬由此為先方生慚耻故敬非慚彼師應許無慚愧者能起恭敬以執先起敬時未有慚耻故應無慚耻者能起恭敬若謂敬時已有慚耻則不應說由敬為先方生慚耻若謂敬時非無慚耻然敬非慚此亦非理言敬非慚無證因故非敬為先方生慚耻勿無慚者能起恭敬又勿有敬而無慚耻然復確執敬體非慚但有虗言都無實義故應敬體是慚差別謂或有慚名有崇重此慚差別說名為敬望所緣境四句分別如文可解補特伽羅此云數取趣謂五道眾生數取諸趣此名通五趣假者若言人唯在人趣假者之名不通餘四趣也。",
    "X53n0836_004:0040a16_0-0": "次下一頌辨尋伺憍慢差別文中初結前問後次舉頌答後釋頌本文中初釋初句心之麤性名尋心之細性名伺問麤細相違云何此二一心相應下有兩師釋有初師作是釋如冷水上浮以熟蘇上烈日光之所照觸藉因水日非釋非凝如是一心下舉法同喻二論主難若爾尋伺是麤細心王因非細論體等又責麤細性相待而立界地九品相形乃至有頂應有尋伺又責麤細相待性無別體類不可依之以別尋伺體類復有第二曰婆沙師釋云尋伺二法是語言行次引經證可解此語言行麤者名尋細者名伺於一心內有別尋法是麤別伺法是細於理何違二論主難於一剎那心品中若有相形麤細別體類俱起理實無違然無相形別體類故成相違一體類中無容相形形下地名上故細形上地名下故麤上下細麤俱時起故也若言上下細麤體類亦有差別應說體類差別云何三婆沙師釋此二體類別相難說但由相形上下顯其別相正理論云雖一心中二體可得用增時別故不相違如水與酢等分和合體雖平等而用有增麤心品中尋用增故伺用被損有而難覺細心品中同伺增故尋用被損有而難覺若謂酢用一切時增故非喻者此言非理我不定說以酢喻尋伺喻於水但有用增者即說如酢故若心品中尋伺二法隨用增者即說如酢微便喻水由是尋伺雖一心中體俱可得用時別故而無一心即麤即細如貪痴性雖並現行而得說心為有貪行四論主破非由上下能顯尋伺有體類相以一一體類中相形有上下故由是應知尋伺二法定不可執一心相應五婆沙師問若爾云何經說初定具五支六論主述經部釋具五支言就一地前後起說非一剎那故無有過次釋上三句辨慢憍差別慢謂對他心自舉性等憍謂染觸自法貪心為先復令心放逸無所顧性有餘師說喻如因酒生欣舉差別說名為醉如是貪如酒生憍舉差別如醉說名為憍。",
    "X53n0836_004:0040c01_0": "次一行頌辨心心所眾名文中初結前生後次舉頌本後釋頌本先釋初句集起故名心如樹有心能集起枝條花果思量故名意了別故名識復有婆沙師釋言令三界六道淨不淨果種種差別故名為心亦同前集起義也即此心為他後識作所依止故名為意作能依止故名為識故心意識名異體一。",
    "X53n0836_004:0040c07_0": "次釋下三句心心所眾名文中初結前生後次辨眾名謂心心所皆名有所依或名有所緣或名有行相即於所緣本性相品類差別等境起影像相此影像相由行解現故名行相或名相應以等和合故次問依何義故有等和合下答有五義故謂心心所五義平等故說相應謂一所依根同二所緣本性相境同三行相影像相同大乘影像相是蘊界處攝得為所緣緣心心所等現影像相各各不同故瑜伽論云所依同所緣同行相不同今依薩婆多影像相非蘊處界攝亦非所緣緣然心心所同取意所現影像相名行相同如下智品中說四時同同一剎那故五事同五義皆平等也下重釋事平等者一相應中如心體一諸心所法各各亦爾既事平等外別說行相故知行相非心心所體也行相如大乘相分事平等如大乘見分也。",
    "X53n0836_004:0040c22_0-0": "上來初一行頌辨色聚次有十二行頌辨心聚自下有十四行頌辨非色非心聚於中初一行頌列十四不相應名頌中初句總舉心不相應行下三句列名一得二非得三同分四無想五二定加前六命根七四相加前十一名身句身文身合成十四若作十四不相應釋等類等取句身文身依正理論師十五不相應釋等者等取句身文身及和合性類者顯餘師所計度法蘊得處界得等性故正理論第十二卷",
    "X53n0836_004:0040c22_0-1": "云等者等取句身文身及和合性類者顯餘師所計度法即前種類謂有計度離得等有蘊得等性如是諸法不與心相應故說名為心不相應行非如心所與心共一所依所緣相應而起說心言者為顯此中所說得等是心種類諸心所法所依所緣皆與心同亦心種類為簡彼故言不相應諸無為法亦心種類無所依緣故亦是不相應為欲簡彼故復言行釋云等者頌舉名身等取句身文身和合性不和合性非得中攝故不別說問不和合性既是非得翻不和合立和合和合應是得所収答諸法不必相翻立如以凡翻於聖凡性是非得不可以聖翻於凡聖性即是得然婆沙說聖性苦法忍是言類者顯是餘師所計度法得蘊處界性苦為第十六不相應即是前十五不相應種類故言類也謂有餘毗婆沙師離前得等十五不相應外別計度有蘊處界得性前十五中得得諸法屬行者唯在於內今明蘊處界身得令蘊處界得成蘊處界性通於內外如是或十四或十五或十六諸法不與心相應故說名為心不相應行非如心所想受等與心共一所依所緣相應而起也頌中說心言者為顯此頌中所說得等十五不相應與心同是非色法故是心種類然諸心所法想受等所依所緣皆與心同亦心種類為簡彼想受等故言不相應諸三無為法是非色故亦心種類無所依緣故亦是不相應為欲簡彼無為故復言行。",
    "X53n0836_004:0041b06_0": "自下五行頌別辨得非得於中一行頌辨得非得自性後四行頌辨得非得差別文中初頌前生起次舉頌本上兩句辨得非得相下兩句辨得非得處後釋頌本文中有三初釋第一句得有二種一者先未得或得已失今初獲二者先得已不失相續成就初得名獲後得名成就獲與成就皆是得義二釋第二句故言應知非得與此得相違非獲非成就是非得義三釋下兩句於中問初二字於何法中有得非得次舉下七字答唯於自相續及二滅中有得非得謂有為法若有墮在自身相續中有得非得非他身相續無有成就他身法故亦非成就非相續法無有成就非得法故一期命不斷名相續非情無命名非相續成實論云色心相續名之為命命是假法薩婆多宗命是實法即命辨相續無為法中唯於二滅有得非得然一切有情無不成就非擇滅者以念念中常得諸法非擇滅故故本論對法中傳說如是言誰成就無漏法謂一切有情除初苦法忍剎那具縛聖人及餘一切具縛異生諸餘凡聖有情皆成擇滅決定無有成就虗空可解諸自相續及二滅中有得者亦有非得義准可知故頌不別釋。",
    "X53n0836_004:0041c02_0-0": "上來第一薩婆多立宗自下第二論主述經部問何緣知有法體之外別物名得三薩婆多答契經說於彼十無學法盡智名以生無生智名以得無學正見智名以成就以斷五支上分結乃至廣說十無學分者八正道上加正智正解脫如下文釋經言以得以成就故知有別物名得四論主難若爾非情及他相續亦應成就經說輪王成就七寶於中輪珠寶是非情餘寶是他相續故五薩婆多釋此經中說輪王於彼七寶有自在力隨樂轉故說名成就六論主難此輪王既於七寶自在說名成就餘十無學經亦應起自在故說名成就復何因知法體之外有別物得耶正理論救云若謂經說有轉輪王成就七寶有大過失此難不然王於七寶自在無礙名成就故若謂餘經所說成就亦應爾者此亦不然以現在者唯於現在有自在力非過未故謂轉輪王於現七寶有自在力增上果故恒現前故隨樂而轉可名成就善不善法則不決定且如善法現在前時補特伽羅於現善法可說成就彼於過未不善法中應更指陳若無現得由何別法說為自在不善現前微善亦爾況執過未全無體者於何自在說名成就若於未來有能生力名成就者理亦不然是則應有非愛過故謂諸異生住最後有定生無漏應是聖者諸阿羅漢住最後心決定不能復生無漏應非阿羅漢便退成異生住世俗忍見所斷煩惱必不復生應是預流果七薩婆多反責論主許有別物有何非理八論主為生非理如是非理謂所執得無體可為證量所知如色聲等五塵為五識證量所知或貪嗔等五為他心智證量所知又無用為比量可知如眼耳等五根有生識用故為比量智所知上來以明輪王經成就七寶故不可以十無學經成就十無學為教量故今但約二量責也謂所執得非二量知故無容有別物名得執有別物是為非理次財計破若謂此得亦有作用為比量知為作所得色心諸法生因作用能生諸法是則二無為應無有得以不生故又所得法先未得或先得已捨謂三界九界九地轉易時及雜染時如從欲界轉易生無色界於欲界有本得法亦有得已捨法復從無色界命終將生欲界時彼無色界命終時現無欲界得當云何生欲界法耶若言欲界中有初受生時取俱生法俱得名欲界法生因者法俱大生者與生生復何所作耶又非情法無得應是不生此中進退難若言得與諸法作生因者二無為無生應無有得非情無得應定不生覆並重成前難然非情無得而復得生無為無生而復有得故知得法非生因也又責諸具縛者下中上品煩惱起差別應無三品有得無差別故然具縛人三品或得現起無別然由習下中上品人不同故三品煩惱現行有其差別故知不由得為生因次財救破若破言由餘久習自分因有差別故三品現行差別者即應由彼自分因故諸法得生得復何用耶故彼所言得有作用諸法生因理不成就九薩婆多云誰言此答作諸法生因十論主問若爾此得有何作用十一薩婆多答謂於差別凡聖為建立凡聖差別因所以者何若無有得異生聖者同起世俗心應無異生及諸聖者建立差別十二論主示差別因豈不煩惱聖人已斷凡夫未斷有差別故應有凡聖差別不由此得十三薩婆多反責論主若執無得如何可說煩惱已斷及與未斷如我薩婆多許有得者斷未所成等十四論主為釋由所依身五根及心王中有或種無或種有差別故煩惱已斷未斷義成謂諸聖者見修道力令所依身六根等中斷或種故轉變有種身成無種異本有種身於彼二道所斷見修惑中無種子故無復功能令惑現起猶如種子火所焚燒轉變異前無能生芽用如是聖者所依身中無生惑種子能名煩惱斷或凡夫用世間六行等智道損伏所依身中煩惱種子無近生惑功能亦名為斷與上相違名為未斷諸未斷者說名成就諸已斷者名不成就如是成就不成就二種但假建立得非得非實有體。",
    "X53n0836_004:0042b21_0": "上來約惑種辨得非得自下約善種子辨得非得善法有二一者生得二者加行得生得善者若所依身中種未被損名為成就若所依身中種已被損名不成就謂斷善者由邪見力損所依身中善根種子不能生現行等智名斷非所依身中善根種子畢竟被害說名為斷邪見斷善但斷生得不斷加行要由功力而修得者若所依身中彼聞思修法已起生彼現行種子功力自在無損說名成就或久不修習或退起障或生異地彼法不起生彼現行功力不自在與上自在相違名不成就如是善種子上成就不成就二種亦於善種子上假建立非實有體故所依中唯有煩惱種子未為聖道援未為世道損善根種子增長自在於如是位立成就名種子之外無有別物十五薩婆多問此中何法名為種子十六論主答謂五蘊名色中有功能於生自類果所有展轉隣近生果功能此功能由三義一由相續二由轉變三由差別種子義成問何名第二轉變答謂自身相續中前後變異性如種子由水土故蹔脹大變異也何名第一相續謂望後為因望前為果相續通三世諸行問何名第三差別答謂有展轉無問生果功能與餘不生果法有差別也亦可取最後一念無間生後念果功能與餘念不生果功能差別經部因果不同時故說無間生果功能也。",
    "X53n0836_004:0042c20_0-0": "自下會釋經若約種子有生果功能名成就者何故經說若成熟貪便不能修四念住耶如七方便中乃至世第一法猶成就貪能修七方便豈成就貪種子便不能修五停之後四念住邪今論主釋然有處經說若成就貪便不能修四念住者彼經意說躭著貪現行者不能厭捨現行貪故名現行成就由隨耽著貪愛時分現行之時於四念住必不能修不約種子成就故不相違對法論云有三種成就一種子成就二自在成就三現行成就經部同此說十七論主結經部宗如是成就遍一切種內法尚有或通內外唯假非實唯遮於此三種成就名不成就亦假非實十八述毗婆沙師說此得不得二種皆有別物實而非假十九論主評如是經部及薩婆多二途皆為善說所以者何經部不違理故薩婆多我所宗故正理論云名色者何謂即五蘊如何執此為種子性能為善等諸法生因為總為別自種類且汝所執唯應爾所若言是總種體應假假為實因不應正理若言是別如何可執無記色種為善不善諸法生因若自類種善法無間不善法生或復相違以何為種天愛非汝解種子性前心俱生思差別故後心功能差別而起即後心上功能差別說為種子由此相續轉變差別當來果生此中意說不善心中有善所引展轉隣近功能差別以為種子從此無間善法得生或善心中不善所引展轉隣近功能差別以為種子從此無間不善法生今汝所執功能差別種子與彼善不善心為有別體為無別體此無別體是不許善為不善種及許不善為善種耶誰有心者執烟為火無有別體而復執言唯烟能燒火不能燒云何感那落迦等諸異熟果不善心中安非能感可愛異熟善惡差別所引功能差別種子復云何感末奴沙等諸異熟果淨善心中安非能感非愛異熟惡思差別所引功能差別種子釋云末奴沙此云人責意云復云何能感人等諸異熟果淨善心中安置能感非愛異熟惡思差別所引功能差別種子。",
    "X53n0836_004:0043b06_0-0": "上來一行頌辨得非得自性自下四行頌辨得非得差別文中初結前問後已辨得非得自性得非得差別云何次答有二初兩行半頌辨得差別後一行半頌辨非得差別就前文中初一行半頌五門辨得差別後一行頌重辨三世得差別門就初門中有三初舉宗且應辨得次舉頌本於中初句三世門第二句三性門第三第四句繫界不繫界門第五句學等三門第六句見斷等三門後釋頌本文中有五初釋初句三世法各有三世得二又善等下釋第二句三性法各同性得三又有繫法下釋第三第四句繫不繫門於中有繫法得唯自界謂三界法各自界繫得若無繫法得通四種謂無染法總而言之得有四種即三界得及無漏得別分別者非擇滅得通三界繫以得隨受身處繫故若擇滅得色無色界繫及與無染法擇滅得隨治道故其道諦得唯有無漏得隨所得故四釋第五句學等三門又有學法得唯有學若無學法得唯無學以得隨所得故非學非無學得有差別此法得總說有三別分別者一切有漏及三無為皆名非學非無學等且有漏法唯有非學非無學得以得有為得隨所得法故非擇滅得及非聖道等智所引擇滅得亦如論是非學非無學以非擇滅得隨受身處故等智所引擇滅得隨治道故若有學道所引擇滅得即有學若無學道轉根所引擇滅得即無學皆以得隨治道故五釋第六句見斷等三門有見修所斷法如其次第有見修所斷得以得有為隨所得故非所斷法得有差別謂此法得總說有二別分別者諸無漏法名非所斷非擇滅得唯修所斷隨受身處故若非聖道智所引擇滅得亦修所斷得隨治道故聖道所引擇滅之得及道諦得皆非所斷以聖道所引擇滅得隨治道故道諦得隨所得故。",
    "X53n0836_004:0043c12_0-0": "自下一行頌重辨初三世門文中初財前生後前頌初門雖總說三世法各三世得今重簡別其中差別相次舉頌文文中有二初釋初句無覆無記得從多唯俱起二一切無覆下釋第二句文中一問二答不爾三徵云何四舉頌答眼耳通及能變化一以勢力強故二以加行差別所成辦故雖是無覆無記性故而有前後及俱起得若工巧處及威儀路極數習者得亦許爾前後及俱起也威儀工巧不隱沒無記心依識身論從上界生欲界亦成就故彼論以善心對不善心有四句一成就善非不善謂欲界離欲人二成不善不成善心如斷善根人三成善心不善心如不斷善未離欲四俱不成謂生上界以善對隱沒無記亦有四句若以善對不隱沒無記心但有二句初句若成欲界善心必成就不隱沒無記心二成就欲界不隱沒無記心不成欲界善心謂生色界成就欲界變化心也若從上界沒生欲界時不得欲界威儀工巧心者何不有但成欲界善心不成欲界不隱沒無記心邪以欲界久習威儀工巧命終生上界後退還生欲界初心願得威儀工巧不隱沒無記心也若依雜心及俱舍從上界沒生欲界時皆不得欲界不隱沒無記心與識身論共違能作論主者立義別也亦可雜心俱舍據欲界不極數習威儀工巧者命終生上界後退生欲界初心不得欲界不隱沒無記心也三釋第三句文中一問唯有無覆無記法得但俱起耶二答不爾三徵云何四釋有覆無記色得亦爾謂有覆無記表色得亦如前但有俱起雖有上品煩惱發而亦不能發無表故勢力微劣由此定無法前後得四釋第四句文中一問如無記法得有別異善不善得亦有異耶二答亦有三徵云何四釋謂欲界繫善不善色得無前起唯有俱生及後起得婆沙百五十七云所得法類有十一種欲界有四謂善不善有覆無記無覆無記色界有三除不善心無色界亦爾及無漏法欲界善不善無覆無記各具五蘊有覆無記唯有四蘊色界三各具五蘊無色界三各唯四蘊無漏法具五蘊及擇滅非擇滅除虗空無為非所得法故此中欲界善不善色若過去有三世得若在未來唯有未來得若在現在有二世得謂未來現在善不善有覆無記四蘊及無覆無記中通果心俱生品四蘊彼得世雜剎那雜謂在過去未來現在皆具三世得故無覆無記一切色蘊異熟生四蘊及威儀路工巧處多分四蘊彼得世不雜剎那不雜若在過去若在未來得亦未來若在現在得亦現在威儀路四蘊中善串習者如佛馬勝及餘有情所善串習并工巧處四蘊中善串習者如佛妙業天子及餘有情所善串習彼得亦皆世雜剎那雜謂在三世各有三世得故色界善五蘊有覆無記及無覆無記中通果心俱生品四蘊彼得世雜剎那雜謂在三世各有三世得故不定善色蘊如欲界善不善色蘊說一切有覆無記無覆無記色蘊及威儀路異熟生四蘊彼得世不雜剎那不雜隨在彼世願唯有彼世得故無色界善有覆無記四蘊彼得世雜剎那雜謂在三世各有三世得故異熟生四蘊彼得世不雜剎那不雜隨在彼世願唯有彼世得故無漏五蘊彼得亦世雜剎那雜謂在三世各有三世得故此則總說若別說者諸未曾得無漏五蘊及未曾得有漏修所成并未曾得聞思所成彼最初得若在未來彼法唯有未來得若在現在彼法則有未來現在得若在過去彼法則有三世得擇滅法雖非三世攝而有三世得然擇滅得有二種謂有染無染有染擇滅得由離欲界染乃至無所有所染故起是世俗道類若未離染彼滅唯有過去未來得若已離染彼滅願有三世得無漏擇滅得由離三界見修所斷染故起是聖道類欲界見苦所斷法擇滅若苦法智未現在前彼滅唯有未來得若現在前彼滅則有未來現在得若已滅彼滅則有三世得如是乃至有頂第九品法擇滅若盡智未現前等如理應知非擇滅得唯是有染彼最初得若在未來彼滅唯有未來得若在三世得彼滅則有未來現在得若在過去彼滅則有三世得此中初問答顯一一世法得第二問答顯一一世得世得三世及離世法是謂此處略毗婆沙也婆沙百五十八云問何故得與所得法性類或同或異邪答得有三種一有為法得二擇滅得三非擇滅得有為法得隨所得法性類差別以有為法能有作用引自得故擇滅得隨能證道性類差別以諸擇滅自無作用但由道力求證彼時引彼得故非擇滅得隨自所依性類差別以非擇滅自無作用非道所求彼得但依命根眾同分而現前故問非得隨何性類差別答彼定不隨所不得法以相違故又不隨道非道所求故但依命根眾同分轉故隨所依性類差別問若諸非得非擇滅得隨所依性類別者所依或異熟或唯等流此二隨何性類差別答隨等流性以義遍故異熟非遍故不隨立問非得若隨所不得法性類差別有何過邪答斷善根者應成就善已離欲染者應成就不善諸無學者應成就染異生應成三乘無漏法退果應成果捨向應成向二滅非得應是無為由此等過非得不可隨所不得性類有異問為一一法各別有得為不爾耶乃至如是說者法與生等同一得得相與所相極親近故由此善通色蘊行蘊一得得等又云如前無窮過失如說得如是非得與得相違應隨廣說然無同時非得非得有情數法現在前時必與得俱是故非得起時決定不與非得非得及彼法俱起由此三法互相違故異時說有此則不遮然得總有四種一在彼法前二在彼法後三與彼法俱四非彼法前後及俱若所得法則有六種一有所得法唯有俱得如異熟生第二有所得法唯有前得如三類智邊世俗智等有說此等亦有俱得三有所得法唯有俱得後得如別解脫戒等四有所得法唯有俱得前得如道類智忍等五有所得法具有前後俱得如所餘善染污等六有所得法不可說有前後俱得如前有諸得謂擇滅非擇滅必無有法唯有法後得者現在前時必有得故一切非得總有三種一在彼法前二在彼法後三非彼法前後及俱所不得法亦唯有三一有所不得法唯有法前非得謂一切未來定不生法及入無餘涅槃時最後剎那心等二有所不得法通有彼法前法後非得謂諸餘隨應有情數法三有所不得法無彼前後及俱非得而有非得謂擇滅非擇滅必無非得可與法俱以法現在前時是所得者必有得故非所得者無得無非得故亦無唯有法後非得非無始來恒成就彼未捨必起彼類盡故然諸非得生類羸劣故唯成就現在一一剎那得已即捨於未得彼法及已捨位恒有此非得問何故諸得隨所得法成善等性而不成色等邪答善等是諸法性類諸法性類可相隨轉色等是諸法自體諸法自體無相隨義有說善等是共相可隨而轉色等是自相無相隨義問何故諸得隨所得法定是善等不隨所得法定是過去等耶答所得諸行世不定故能得得世亦不定捨得諸法善等性定故能得得善等亦定問頗有捨得而不得非得邪答有謂入無餘涅槃時捨諸法得而不得非得所依斷故問頗前恒成就故問頗有諸法本有諸法先起非得一得已去更不起非得邪答有謂諸非擇滅及無生智等一得已去乃至無餘涅槃未有得無非得邪有說無以有得者必有非得故有說有如三類智邊世俗智等非擇滅法本來有得無有非得以彼本來定不生故問如有一得能得彼法及得得亦有一非得能捨彼法及非得非得邪答無以非得同時無非得非得故問頗有法無得無非得彼法滅有得有非得邪答有謂一切非有情數法。",
    "X53n0836_004:0045b20_0-0": "上來兩行頌辨得差別相自下一行半頌辨非得差別相文中一問非得如得亦有如上品類別耶二答不爾三徵云何四舉頌答五釋頌本文中有五初釋初句性差別者一切非得皆唯無覆無記性攝是自淨無記故頌云非得淨無記二釋第二句世差別者過去未來法各有三世非得謂現在法決定無有現在非得唯有過去未來非得正理論云以現在法與不成就不俱行故有說現法無記非得性相違故舊俱舍云現在法有現在非得者翻譯謬也若過去未來法一一世各有三世非得三釋第三句界差別者三界繫法及不繫法各有三界繫非得謂欲界繫法有三界非得身在欲界欲界法非得即欲界繫乃至身在無色界欲界繫法非得即無色界繫正理論云由所依力非得轉故也色無色界及不繫法非得又通三界繫依婆沙亦約學等三門及見斷等三門分別今此文中但明非無漏即是非學非無學及修斷四釋第四十五句文中初立宗定無非得是無漏者二舉頌本釋所以者何由許聖道非得說名異生性故三如本論言下引本論四問不獲何聖法名異生性五答謂不獲一切三乘聖道方名異生性以本論不別說故若異此不獲一切聖法但不獲少分聖法即名異生性者諸佛世尊亦不成就二乘種性聖法佛世尊身中有二乘不得性應名異生性然佛身中雖有自身二乘不得性但名不得不名異生性故知凡夫身中乃至世第一法時不得一切三乘聖道不得方是異生性入苦忍已去於聖法有少分得少分不得故其少分不得但名不得不名異生性故婆沙論云若不得不破是凡夫性若不得破非凡夫性六責若不獲一切聖法方名異生性爾者彼本論應說純言應云謂純不獲聖法也若入苦忍已去有獲聖法有獲凡法即是雜也七釋不要須說純言此不獲聖法一句中含純義故如說此類外道食水即知純食水不食餘此類外道食飛不食餘物即知純食飛以西方九十五類外道各別略引二類為喻。",
    "X53n0836_004:0046a06_0": "上來雖有七文合為第一毗婆法師釋自下第二毗婆沙師釋云有說不獲苦法智忍及俱生法名異生性二遮外難不可難言道類智時捨此苦法忍故有苦法忍不得起應成非聖異生性前初得苦法忍時已永害彼異生性非得以苦法忍前非得具足不破方名異生性今道類智時雖有苦忍不得起於道類智品不得已破故苦法忍不得但名不得不名異生性三問若爾此苦法忍既通三乘不獲何乘苦法忍不得名異生性四釋此亦應言不獲一切三乘苦法忍五難若爾此亦應同前難本論應說純言謂純不獲苦忍聖法六此難復應如前通釋此一句中含純言故七若爾重說不獲苦法忍唐捐其切應如初師不獲一切聖法名異生性也。",
    "X53n0836_004:0046a19_0-0": "自下論主評取如經部師所說為善次問經部所說其義云何後答謂曾未生聖法相續分位差別名異生性正理論云豈不如聖法即說是聖性成就此性故名聖者如是異生法應即異生性成就此性故名異生此例不然以諸聖法唯聖者有可即聖法說為聖性諸異生法聖者亦有如何可立為異生性釋云自古諸師已見雜心十四不相應中立凡夫性其餘斷善不成就退不成就等別立為不成就性非凡夫性今依俱舍但立不得其不得中於聖法不得名凡夫性斷善不成就等皆是不得性攝也五釋第六句捨非得時文中初問如是非得何時當捨二舉頌答如此苦法忍忍法非得得此苦法忍時捨乃至盡智法非得得此盡智法時捨餘一切法非得亦然然此非得隨所依身繫故或凡或聖轉易生諸地時捨此地非得得彼地非得也下指其事如聖道非得說名異生性後得此苦法忍聖道時捨此非得或在凡位易地時便捨非得餘一切法非得類此應思三問若苦法忍上非得苦法忍起時其非得上得斷不續故於苦法忍非得上有非得生如是名為捨於苦法忍非得既非得上有非得生未知得與非得上豈復有餘得非得邪四答應言此二得與非得上各復有餘得及非得五外人生過若爾豈不有無窮過六論主釋云無無窮過且就得辨許大小得展轉更相成就故下指其事且如苦法忍生時并其自體三法俱起第一苦忍本法第二苦忍法得第三得得謂自身相續中苦忍法大得起故成就苦忍本法及得得以得得起故成就苦忍法大得是故此中無無窮過下類釋如是若善若染污法除不隱沒無記多無法後得故不說其自染污一一自體初生起時并其自體三法俱起如前釋第二剎那六法俱起謂三法大得得過去善念三法及三得得能得同時三大得第三剎那十八得俱起謂於第一剎那三法第二剎那六法合有九法得得過去九法及九法得得能得九大得如是諸得後後轉增一切過去未來大小惑并生得善剎那剎那相望俱有無始無終有無邊得且一有情剎那剎那起無邊得如是一切有情各別剎那無邊得起如秋細霧遍滿十方如是諸得法界眾生所起極多集會若是色法應不相容以非色法無對礙故互相容受若不爾者一有情得若是色法十方虗空不容況次第二有情等耶。",
    "X53n0836_004:0046c12_0": "俱舍論疏第四",
    "X53n0836_004:0046c14_0": "殺盜婬等惡　疏顯揚二至細勘無之者淨定染定無漏三種定中皆不言未至定起染也　疏唯染定煩惱等者定滅者即其生之惑生在彼地。"
}