{
    "X53n0841_006:0424b01_0": "俱舍頌疏記　論本第六",
    "X53n0841_006:0424b02_0": "富春沙門　遁麟　述",
    "X53n0841_006:0424b03_0": "且因六者四緣後辨且辨六因故言且也問六因中所以能作最居先者顯宗論云能作因體通一切法是故前說俱有因體通諸有為故居第二餘同類等於有為中如其所應各攝少分隨言便穩次第而說迦多演尼子思惟者正理云謂諸經中所化力故世尊方便作異門說對法諸師由見少分相知其定有分明結集故有言此六因義說在增一增六經中時經久遠其文隱沒尊者迦多演尼子等於諸法相無間思求冥感天仙現來授與如天授與筏弟遮經其理必然如四緣義雖具列在此部經中而餘部中有不誦者乃至廣說(解云如來在世有一苾芻名筏弟遮中夜誦經文虧一品室中天授忽領異聞晨白世尊遂蒙印述六因准彼理亦應然如四緣在增四經中而化地部達磨毱部中不誦六因亦爾故也)。",
    "X53n0841_006:0424b16_0": "言除自體餘有為法者簡無為法以無為法無生故故不望彼為能作因所以須除自體者謂無障義是能作因自於自體恒為障礙又一切法若待自體應有恒成損減等過謂若待即此自體自體恒有應恒成之過若待第二自體第二自體恒無應成損減過有餘師說自於自體不見有用故非因緣猶如不自指刀不自刻眼不自見以一切法為能作因者問日光生時星等不現能緣彼識緣闕不生如何有為唯除自體以一切法為能作因答於彼生時不為障住故說能作非謂不生時說名能作譬如國人以其國主不為損害咸作是言我因國主而得安樂若爾涅槃及不生法普於一切有為生中本無障用何得為因答雖無障用而亦為因如無力國王亦得如前說言無障住者謂此因體住無障性中無障住因即能作者此即能作在因准顯宗總有四說此是一解第二解云或復此因能作二義以無障故可名為因可名非因不能生故三云能作者是餘親因此能助故名能作因(解云謂此能助餘五因也)四云或此令他能有所作他即是果能作名因名能作因(解云如華果能為後種也)如色處者謂眼等十處皆是色法以餘九處有別名唯此色處更無別名以餘九之所簡別而此色處雖標總稱即受別名今此能作雖是總稱亦成別名(此依四釋中初說故為此釋)。",
    "X53n0841_006:0424c15_0": "互為果釋俱有因者論云猶如三杖互相依住如是俱有法因果義成准婆沙評家及正理論皆言同一果義是俱有因言一果者如心心所同共成一果也此四大種至互相假藉者婆沙云謂四大種若有偏增若無偏增地為三因三為地因所以者何地不觀地生所造色以一切法不觀自性及同類體為他因果故餘大例爾。",
    "X53n0841_006:0424c21_1": "三四相自互相望者此經中分別三類為五類故有四相自相望也若依正理不說四相及心隨轉自互相望故彼問云此中所說因相太少然自釋云本論說故此中應辨造論者意以於此中為欲顯示但說異類為俱有因同類互為因不說自成故(准此論文但說三類)此中應辨者若准新科謂此中辨何法名隨轉連為句也今章言是論主勸有宗通互為果過其過者謂小相非互為果然法與小相為因即是因不遍宗法因狹宗寬今詳婆沙評家既以一果釋俱有因世親論主自以互為果釋何言論主却出有宗過耶故正理師彈此論互為果有過遂以一果釋俱有因也舊云入阿毗達磨是此論後造言互為果者學我世親阿闍梨也准此等文不應是論主出有宗過請重詳之問婆沙等言一果者為是同時為是異時設爾何失二俱有過若是同時即自體非自體果如何俱有同一果耶又大生小生不同一果故此即一果之因不遍宗法與前何異若謂異時果者此即小相與其本法同一等流異熟因何不與本法為因此即一果之因通其異品於異品轉其過更甚新云兩論所立皆無有過如言變礙名色此因不遍無表急食急行名之為馬而有馬急食行亦有是馬緩食行然此立名不違世理互為果義及一果因例亦應爾是入阿毗達磨將不違理兼舉二因此論略故但舉其一(解云二因者即互為果及同一果為二因也)。",
    "X53n0841_006:0425a21_0": "彼及心諸相者此一句唯取生等四相也以一彼言攝二種相一心所上相二律儀上相更兼心王上相總有三類四相也舊云既言生等不言生生等即顯隨相非心隨轉也。",
    "X53n0841_006:0425b01_0": "若未來法未至生相者謂未來法至生相位則稍親近餘則不然以舉未隣生相故由此故說在未來之前也及過去法者謂已謝之法在過去世非滅相攝故但言同生即不攝生相之前未來但言同滅即不攝生相之前但言同滅即不攝滅相之後過去故三相攝法不盡也故正理云豈不但言一生住滅雖亦即知墮於一世而猶未了此法與心過去未來亦不相離或為顯示諸不生法故問四相之中不說異者答生顯同在未來將入現在滅顯同在現在入於過去住顯此法於現取果即顯去來三世同時異之一相無別顯能故此不說一果言意取士用及離繫果者謂等流異熟非俱有因准取士用離繫二果故瑜伽云夫以果言下攝一切從因緣果然由此中說俱有因故不應明餘之二果由此果言唯攝士用及離繫果恐有難言若爾此中解隨轉義但應說一果不應言餘二種故今釋言為遣疑妨須說彼二意義云何夫士用果總有四種(文如章例)如是四種皆依能行之心俱有因力所引起故依如是義皆名士用今此隨轉中言一果者不說展轉士用果以彼自體非自體果非一果義但取俱生中餘造作得者及餘無間隔越不生諸士用果恐諸未解者聞一果言謂攝俱生展轉士用及執唯有俱生士用故於今時更別顯示等流異熟決定與因不俱時果為欲遮遣唯執與因俱生和合聚中有士用果所以須遮此士用者非一果故又復何但為遮唯執俱生展轉之果亦乃兼顯無一果義由斯意故不說等流異熟非所要非一果攝舊解亦同新云然此論文遮得同時果非是欲取無間隔越諸士用果與上釋異(繁不具述)一俱有相應因展轉士用果者即心心所四相等互為果也二及餘同時造作得者謂展轉果外名之為餘正理抄云如四大種所造有對色等准此既言有對色等即通表無表林云謂同聚之中隨相及心同時表無表色也(今詳隨相名造作得未詳所以)。",
    "X53n0841_006:0425c10_0": "等無間緣所引者即前念心心所等有力能引起後念等之果如下當明二及餘隣次造作得者謂此造色是無間緣果之外故名餘後念望前非其遠隔故曰隣次此云隣次之言望前念心所等造作之言望同時大種又云唯局定道二種無表色以色是隨心轉故隔越果者謂第三念已去所得諸果是如農夫隔越遠果者正理抄云如人種田等訖後於異時牙等方起此果亦爾(解云即如初念大種懸造未來眾多無表望前大種豈非隔越)於俱生士用中唯取同時造作者以展轉果自體非自體果非果義故不取也取餘異性無間者上明無間士用有二一等無間緣果二隣次造作得果然於其中通其同性及以異性今除同性俱取異性且如等無間緣果中異性者如前善心等引後不善心等是異性也同性可知其造作得果若唯取無表望大種但是異性若兼望心即通同異然此異性之果總望二類通心及色故。",
    "X53n0841_006:0426a02_0": "一果言唯攝士用及離繫果者結上也然此總取四士用果一同時造作得果二異性無間果三遠士用果四不生士用果此同舊解由此十因名心隨轉者但是據其大位非要皆具十因如三性不可俱故無漏隨轉無異熟果故言極少由與五十八法為俱有因者謂唯約受等十心所辨無減於此故言極少且如二定已上於無覆無記心位唯有十一法并大小四相有九十九法心王於此九十九內唯與五十八法為因(解云二定已上無尋伺故無覆無記又無信等癡等故唯十心所并心王為十一唯此位極少若欲界初禪有尋伺故非極少也)問此何不望心所上隨相為因耶答以疎遠故心王望彼非俱有因(謂心王力不及第二也)若論極多心王即與一百五十八法為因謂初禪中大地十大善地十欣厭隨一及與尋伺定共七支總三十一法并大小相總二百七十九法除其心王定共戒等上小相故但一百五十八法為因也言心不因隨相相者顯宗云隨相於一有功能故唯與所相為俱有因正理亦云何緣心隨相非心俱有因不由彼力而心得生故非心與彼互為果故聚中為多分非彼果故(解云小相但相大相之一法餘法並非小相果也)即由如是所說多因隨相不名心隨轉法(因便明隨相非心隨轉也)若爾云何心能與彼為因答由隨心王生等諸相而得轉故問心所上相不相心王何得互為因耶答彼於心王有力用故如心所於心王故顯宗云本相與法其力等故同其本法為俱有因不同心王隨相以無力故不為因也此上明因通取心所上相有餘師說唯十大地并心本相一十四法為心王因此非正義論廣有破。",
    "X53n0841_006:0426b04_0": "諸由俱有因故成因彼必俱有者上因字是因由所以之因下因字是因緣因謂若由俱有之理得成因者必是同時故言必是俱有等或有俱有非由俱有因故成因者謂或諸法雖是同時不由同時之理即成俱有因即如下八對之法是也八對法中初對如前解第二對注中言展轉相望不同一果者展轉謂四相四相互望也非心一果等者如小生但生大生小住但住大住故不同果等取非一異熟及一等流新云此非一果意極難解詳此即是共力同取是一果義果雖是同力不同取非是一果故正理云聚中多分非彼果故(解云一共力二同取是一果義如兩人共證擇滅無為果雖同非是一果要相應等俱有力能方名一果今四小相雖與本法同得一異熟等流由力不同故非一果等此對既爾餘類亦爾)第五對色聲等雖復同時相望無共得一果等故非俱有因造色大種者然四大種有共得造色果義造色望大種都無果義故亦非互為果論總結云如是等諸法雖名俱有而非由俱有因故成因非一果異熟及一等流故此即通前七對無一果義第八得與所得以不定故論別明之又上八對於十因前之四對及第六對皆具七因但無果等三也第五一對有時等四無善等三及果等三如色聲通三性香等唯無記故第七對亦爾第八得與所得雖有同性然時不定由此或前或後偶然相值故有宗所明同時因果如焰與明如身與影若依經部前因後果如互與種論有相破(云云)。",
    "X53n0841_006:0426c04_0": "同類因者此有二釋若與相似法為因名同類因同類之因是依主釋若以相似法為因名同類因同類即因即持業釋新云後不及前染汙與染汙者此染汙言通不善法及有覆無記以此二法互為因故謂身邊二見是有覆無記或能與不善為因及從不善生故故以染言通攝二類無記與無記者此明無覆無記也言亦爾者准論善染之因更無異說論無記五蘊四說不同今但敘正故言亦爾然依論文更有三說一云淨無記蘊五是色果四非色因(此師意以色性劣故與勝為因四蘊勝色故非色因故也)二云五是四果色非四因(此師意以四蘊力勝能與五蘊為因色蘊勢力劣故不為四因也)三云色與四蘊展轉相望皆不為因(此師意以四蘊色蘊雖同無記以〔為〕劣故異類相望皆不為因也)四說之中舊云既無評家且以後解為正新云初說為善以善染性中既五蘊展轉總得為因何為無記即便不爾違二性例故自部者五部對九地五九四十五類各別為因然於此中但簡異地異部不簡異趣異處故婆沙云同地異處所起煩惱展轉相縛隨類展轉為同類因然除異部五部隨眠繫縛分齊有差別故言前生者如發智本論說云何同類因謂前生善根與後生善根及彼相應俱有法自界同類因故成因然言過去望現在等但是麤相若准義求過去前生與過去後生法及現在未來不生法等過去後生與現在未來生法及不生法方可盡理現在亦爾以望後生及不生法彼皆得為因未來無同類因者以未來法雜亂住故未分前後假至生相亦未越未來約世定故非前生也道九地者除欲界有頂欲界無定故有頂昧劣故皆無聖道故唯此九地於諸地皆如客住者釋上九地為因所以也一如客人住二不墮界繫三非愛所執具此三義故異地相望皆得為因唯等勝為果者總望九地雖得為因然於其中非無差別即此已下指法明也於中有二初指事正明次論云諸上地道已下釋妨前文又二初約三道以辨次又於已下別約利鈍以明依此論文見道與三為因修道與二為因修道無學道不與見道為因若准正理三道展轉得為因如前鈍修道亦與未來不生利見道為因前生鈍無學道亦與未來不生利見修道為因或從無學退至學位轉根亦與已起利根修道為因而言與三二為因者且據現起次第而說(准彼與此論不同或可此論且據現說為因也)次約三道分六種聖此等名義如前賢聖品釋妨中初約道勝後約根勝於前又二一約見修二道以明勝劣二於一道中九品以明勝劣言見道等下釋因增長者指前論文舉見道下下品等後後等文也論文不釋根者謂上列因根二義及至釋中但釋因增長不釋根義者以利鈍之義易解故故不釋也不由地有上下令道有勝劣者謂設依無所有處起鈍根道望未至地利根道亦非勝也准此無所有處鈍根道得與依未至地起利根道為因與正理論依於自上有依於下地無少有不同繁不具述。",
    "X53n0841_006:0427b05_0": "釋伏難者但釋見道以言隨信法行故所以然者以修無學道時長相顯不別釋妨見道時速相隱故別釋妨如章可解思與修為因者今謂不然以欲界有思無修色界有修無思異地相望又不為因如何乃言思與修慧為同類因耶又言聞與思修為因者亦是總言然於其中理應分別如欲界聞不與修為因故色界聞與思不為因故故論云如欲界繫聞所成法能與自界聞思所成為同類因非修所成欲界無故思所成法與思所成為同類因非聞所成因以彼劣故(准此不言與修為因)若色界繫聞所成法能與自界聞修所成為因非思所成因色界無故修所成法唯與自界修所成為因非聞所成以彼劣故無色修所成唯與自界修為因非聞思以無故劣故(解云無故謂無聞思設有亦劣准此論文並約當界自明理實而言應約自地今論總相且言異界也)生得善法展轉為因者以非加行力故任運現前故得有九品皆互為因不同加行善不與劣為因如勤功力種稻麥等莫設劬勞而無所獲舊云生得善與加行善為因加行善不與生得善為因以彼劣故今但約生得相望故通九品無覆無記四種者異熟任運而起最為微劣威儀路作意而起力用少強勝異熟工巧處強想生故力用更強勝威儀路化心是通果其力最勝故如其次第相望除前。",
    "X53n0841_006:0427c03_0": "相應因者此有二義謂心心所更相隨順義用相應法為因是持業釋若與相應法為因即依主釋謂同依言即顯必同所緣同行相等者釋頌中但言同所緣下所以也由一所依義最要故所以偏說為遮所緣行相別者及遮異時所緣行相同者或遮異身所緣行相時同者如眾共觀初月等事為以一言總遮如是眾多妨難故說同依以言同依名同所緣行相等故問心心所相應因體即俱有二因於何別答由互為果義立俱有因如商侶相依共遊險道由互平等共相應義立相應因如商侶同作食等事業其中闕一皆不相應故又正理云由展轉力同生住等是俱有因若展轉力同緣一境是相應因(准此俱有通四相等是寬相應唯心心所是狹故知若是相應必是俱有因自有俱有非相應也)。",
    "X53n0841_006:0427c16_0": "遍行因者唯是持業釋不得為依主以因是遍行義果非遍行義故不可言遍行之因也言遍者三義遍故一遍緣五部二遍隨眠五部三遍與五部染法為因由此三義故名遍行五部惑中唯此十一有上三義故名遍行餘惑不然故非遍行此等癈立如隨眠品然此遍行能取他部果若同類因唯取自部果是故二因寬狹有異由是論中四句分別(云云)。",
    "X53n0841_006:0427c23_0": "異熟因唯諸不善至異熟法故者此辨因體簡無漏及無記以不善法及善有漏有異熟果名異熟法非此善等體即是異熟法也舊云法之言持即目於因此因能持異熟果故名異熟法異熟之法依主釋也若言異熟即法是持業釋即三性法中不善全是異熟因無記全非善有二類若有漏者是異熟因無漏善法非彼因也釋異熟名者異熟或在因或在果持業依主二釋並通如前已辨。",
    "X53n0841_006:0428a06_1": "餘法具二者翻前無漏二義可知依新更加力用增強成三義也故唯此一名異熟因者是婆沙師對餘因癈立彼意以熟名雖通六因之果然非異熟故唯一名異熟因准論主釋熟名不通餘果故論云由此但應作如是釋變異而熟是異熟義不應但異簡別餘因(此論主正釋也)。",
    "X53n0841_006:0428a12_0": "明世攝者謂明六因於三世中立在何世中也故有此門遍行同類不通未來者然此二因皆因前果後未來既無前後故無此因已如上辨相應俱有既要同時生住等故通三世其異熟因雖亦因前果後而善惡性為因無記性為果約性定故故通未來以異熟約體建立同類因就位建立故不同也頌不說能作因正理論云不可說彼定時分故。",
    "X53n0841_006:0428a19_0": "無為無取與故無有為果者謂無為雖於他生不障立能作因無取與用不名有果故無為法無增上果言二無為是因非果者謂虗空非擇滅二種無為但約不障是能作因不行世故非所引果無記性故非道證果三無為皆無因果者總論三種無為皆得名為無因無果道於得有功能等者此難意道既能引得則唯於得有功能非於擇滅有功能也言擇滅為道果者謂道望擇滅雖非生因而是證因故是道果上依有宗所釋若依經部不許無為是因無經說故唯說因是有為故如經言諸因緣能生色者皆是無常廣說(云云)有部通云豈不亦說唯能生因是無常故不據無為唯不障故為能作因(云云)。",
    "X53n0841_006:0428b07_0": "初異熟果此因所得者且果有五一異熟果二等流果三離繫果四士用果五增上果次第狹者居先廣者居後六因次第廣者居先狹者居後因此前因對於後果後因對於前果其離繫果非六因得故此不論然與士用少相濫故及狹士用故別在士用前不同四果廣狹次第所以非次異熟之後於法不障得增上名者問唯無障住有何增上答即由無障方得起得增上名諸有情業於器世間者謂由有情業力感器世間故業望於彼有增上力此二種因得等流果者若同類因唯取自界自地自部自性之等流果若遍行因唯取自界自地自性染汙之等流果此二因所得果皆似於因故因雖二其果唯一問如邪見生有身見雖性不同同是染故為等流果善生無覆雖性不同同是淨故應是等流答染性易同故得為果淨法難同故不為果因有作用者為遮勝論於法體外別有業用即此二因有勝用力非越士用體別有士用故由此二因得俱生勝士用果此中偏說醉象將軍者一解如章舊又解云醉象似將軍能入陣故餘因亦有此果者問既爾何以但言相應俱有二因得士用果答二師據通名故餘因亦得頌中約俱生親所得故簡餘四因唯二因得。",
    "X53n0841_006:0428c04_0": "唯無覆無記有異熟果者謂無記法總有四種於中唯一法是異熟法故言有等問何以異熟果非善染不答若是善惡即所造業無變盡期故異熟果唯是無覆無記中攝異熟不通非情者謂外器等共業所感異熟不爾故不通也正理論云豈不大梵所住非情是別業果應名異熟何乃言非有作是言大梵住處一切大梵業增上生有餘師言大梵住處相續未壞餘可於中有受用理故非不共明知不通等流長養者此宗五類義體各別不同互不相攝今因此理證顯宗義故言明知言通三性者等流可知其能長養即通三性所長養唯無記如上已辨又此二種果唯同類非異熟也入阿毗達磨釋五果名云果不似因故名為異熟謂成熟堪受用故果即異熟名異熟果果似因故說名為流果即等流名等流果擇滅無為名離繫果果即離繫故已上三果並持業釋士用增上從因得名並依主釋今此同舊又云或異熟之果或因與果類相似名等流等流之果或離繫之果名離繫果謂無漏離繫縛故乃至增上即果謂果眾多體增上故言清淨靜慮生變化心者謂簡味定等故言清淨也擇滅名不生士用果等問此果既不生如何可說用彼力生名士用果答正理云現見於得亦說生名如說我財生是我得財義問此與離繫何別答若無間道斷諸隨眠所證擇滅如是擇滅名離繫果及士用果若無間道不斷隨眠重證本時所證擇滅如是擇滅非離繫果唯士用果(已上論文)。",
    "X53n0841_006:0429a05_0": "問但言五因取果不說能作因者答以能作因現在取果與五因同於中無為無果所以不說准婆沙有二說許能作因過去取果正理唯許現在取果與此論同彼言取果者是能引義謂引未來令其生等於同體類能為種子於異體類由同一果如是別者名為取果取與四句中第一句言最後所捨得者謂未斷善根無始已來生得善得相續無量今斷善根時雖捨諸得唯取最後念得為此句也以前諸得亦與果故未來諸得未取果故此念與取非與第二句言最初所得得者疏解謂續善根時最初起得得過去所捨得名初所得得若依新解最初謂剎那所起得名初所得得爾時此得是所取果舉所取得顯前能與而不取前已取故二說並通。",
    "X53n0841_006:0429a17_1": "應言爾時續者前得者此意恐人通謂取過去諸得故說前言以簡之即是前第一句中最後所捨之得也正理彈云如何前位多剎那得為同類因皆取今得而於今時但說最後一剎那得與今得果是故應如本文為善作俱舍師救論主意說若法從未來與果者此中說是過去諸得雖於續時皆悉與果以前諸念皆曾與果俱句攝故所以不說其最後唯今與果故偏說之又解前得通前過去所有善得誰言唯取最後所捨得耶以所捨得通於三世非彼一切皆能與果故以前言簡取前者今此章中但同前解問所以偏說得為單句不說餘善根者答得斷善根以不現行唯有善得現行故偏說得。",
    "X53n0841_006:0429b06_0": "言三所餘者但此二類之法是前三類之外名三所餘非謂三法名有其餘如染汙一類即無餘也初句染汙法除異熟因者以異熟果是無覆無記故非染汙性從五因生者是心法故必有相應相應因中必是俱有同染性故有同類因染汙法故復通遍行能作必有故具五因餘四准此更不廣說異熟法除遍行者遍行唯為染汙因故所以除之故上二因互不通從餘因生可以思知問異熟既善惡為因無記為果如何可說從同類因生答後之異熟從前異熟生以無始來有異熟果為同類因故得有也三所餘法除異熟遍行二因者非異熟故除異熟因非染汙故除遍行因從相應俱有同類能作四因所生初無漏法及除一同類者謂苦法忍體是無漏世第一法是有漏故苦忍不從同類因生從三因者謂相應俱有能作可知此謂心心所者如上所明謂是心心所法故有相應因已下明色及不相應法如上四類所除因外更除相應因不相應中染汙等四者一染不相應謂染法上四相等二異熟不相應五根四相等及命根眾同分等三三所餘法不相應謂除上二類及初無漏餘不善有漏即除上四相及善有漏法上四相并非得二定等四相初無漏不相應即苦法忍上四相等一因生法決定無有者准上所明極少猶有二因所生不同外道計一因生法也。",
    "X53n0841_006:0429c05_0": "俱舍頌疏記"
}