{
    "X56n0937_002:0578a18_0": "金剛錍釋文卷中",
    "X56n0937_002:0578a20_0": "荊谿尊者湛然撰後學玄箸海眼會",
    "X56n0937_002:0578a21_0": "天台沙門時舉釋後學新伊大真校",
    "X56n0937_002:0578a22_0": "今搜求現未建立圓融不弊性無但困理壅故於性中點示體遍傍遮偏指清淨真如尚失小真佛性安在他不見之空論無情性之有無不曉一家立義大旨故達唯心了體具者焉有異同若不立唯心一切大教全為無用若不許心具圓頓之理乃成徒施信唯心具復疑有無則疑己心之有無也故知一塵一心即一切生佛之心性何獨自心之有無耶以共造故以共變故同化境故同化事故。",
    "X56n0937_002:0578b06_0-0": "今家依法華涅槃二經建立圓融佛性周遍唯心體具之旨而復示於立宗實意使歸乎一實以法華正為現世機緣開權顯實明常住之義涅槃為未來機緣談常住佛性二經相對而分故摩訶止觀依此二經建立圓融之行故義例云散引諸文該乎一代文體正意唯歸二經今荊谿亦效止觀建立圓融佛性之旨不同野客無情無佛性之弊故云不弊性無困者病也但病而不解佛性之理於此實理壅而不通正見唯局佛性於有情不遍無情故今於眾生煩惱妄染心體示其本有正因佛性非內外遍虗空能解是義任運不隔於無情則成無情有於佛性矣故云故於性中點示體遍正是眾生正因體遍也旁遮偏指清淨真如者旁者對正為言今之所以點示體徧者正為顯圓妄染即佛性義在此而不在彼也蓋他宗偏指眾生有清淨性但局有情不遍無情由失於唯心體具之旨故今建立圓融遮防其謬執也偏指之言含於二義一者惑果事而迷因理謂眾生因中但有其性而無其事不知果地依正融通蓋由眾生理本具足也二者佛性融通豈間無情而云有情有性無情無性耶不但其解如此及其立行亦直觀清淨真如為境若其然者小乘偏真亦滅苦集而復證真苟直觀真如豈但昧於大教心境尚乃失於小真佛性安在哉此以圓教對偏中三藏小乘而說他不見之者正指其不見佛性圓具融即心佛眾生三無差別之旨空論夫果事方融無情則有因理既隔無情則無若知果體遍由生性遍及一家立乎大旨在於唯心體具者則不致於空論矣故達唯心了體具者止之有無也點出不分情無情之圓旨唯心體具即徧具二義若了萬法唯心心外無境則知此心遍一切法不間情無情異此之唯心既遍一切即體量也若知此體具一切法豈分情無情異此具字即體德也故下文云示遍是(量示具是示體)",
    "X56n0937_002:0578b06_0-1": "德若達此二則法法皆唯法法皆具有何彼此同異之分耶若信唯心體具復疑有無是於自心疑有無耳則心佛眾生三無差別之旨全然不曉故結云故知止同化事故若知心佛眾生三無差別則無情至微之一塵眾生介爾之一心即一切生佛之依正汝既疑己心之有無豈非疑一切生佛之有無耶何獨疑於自心哉抑又何但因理不融不遍矣以由造則三法共造以體元妙故此是理造變則三法全體共變此是事變所化之境約機而言能化之事約應而言以由十界本同故皆云同所謂能應雖多不出十界物機無量不出三千如是則機應事理同一佛性佛性周徧圓具攝情無情義無不明豈復疑於有無耶。",
    "X56n0937_002:0579a04_0": "故世不知教之權實以子不思佛性之名從何教立無情之稱局在何文已如前說余患世迷恒思點示是故寱言無情有性何謂點示一者示迷元從性變二者示性令其改迷是故且云無情有性若分大小則隨緣不變之說出自大教木石無心之語生於小宗子欲執小道而抗大逵者其猶螳螂乎何殊井蛙乎。",
    "X56n0937_002:0579a11_0": "前來既以圓實大教唯心體具示其佛性周遍已畢今須欲明點示之意故重結責由世人不知教有權實故執權教緣了不遍無情以子不思正因體遍佛性之名從何教立無情之稱局在何文前文若云無情即不應云有性屬前三教若云有性即不合云無情局在圓教又云眾生佛性猶如虗空又云為非佛性說為佛性非佛性者謂墻壁瓦礫已如前說如上說者余患世人迷此佛性之旨所以常思點示不覺寱云無情有性點示有二一者示迷元從性變即從真起妄之義二者示性令其改迷即返妄歸真之義故且云無情有性然法法平等本來清淨何分有無但迷者不覺流而忘返故茲點示耳若以教分大小此約偏圓分大小已如前說不變是理隨緣是事事即是理理即是事如此則隨緣時誰情無情若然則不當別立無情之名若在小宗則容有木石無心之語隨緣該別非今所論亦屬小宗也子欲執小道而抗大逵等者他宗執墻壁非佛性之小道抗大教佛性之大逵其猶螳螂拒轍井蛙輕海語出莊子更不繁引。",
    "X56n0937_002:0579b07_0": "故子應知萬法是真如由不變故真如是萬法由隨緣故子信無情無佛性者豈非萬法無真如耶故萬法之稱寧隔於纖塵真如之體何專於彼我是則無有無波之水未有不濕之波在濕詎間於混澄為波自分於清濁雖有清有濁而一性無殊縱造正造依依理終無異轍若許隨緣不變復云無情有無豈非自語相違耶故知果地依正融通並依眾生理本故也此乃事理相對以說若唯從理只可云水本無波必不得云波中無水如迷東為西只可云東處無西終不得云西處無東若唯從迷說則波無水名西失東稱情性合譬思之可知無情有無例之可見。",
    "X56n0937_002:0579b18_0-0": "此文乃用彼所立而斥於彼也良由起信論於一心門中開真如生滅二門藏師於藏疏中却以真如門明不變隨緣二義彼雖立隨緣之義但以一理隨緣而性具隨緣非彼所知四明所以立別理隨緣而格量之也故今以彼所立斥之萬乃諸法之總稱子乃指萬法是真如由於不變豈非真如隨緣為萬法時當體不變故萬法是真如也真如從理立稱既指真如是萬法由於隨緣豈非萬法不變處是真如全體隨緣故真如是萬法也子既知此矣復不信無情有佛性者豈非萬法無真如耶萬法之稱等者以一家圓教真如隨緣之義破之既全真如為萬法萬法豈隔纖塵又真如之體本來平等何局我之有情隔彼之無情既不專於彼我豈有情有無情無耶次以波水喻之波喻萬法水濕喻真如濕無混澄喻性不變波分清濁以喻依正波雖有清濁之殊而濕性無殊雖有依正之別而佛性無異轍依理之依字者依乃據也若許下以其所立而結責之謂藏疏既明真如隨緣是則隨緣為萬法處當體不變萬法既該依正依正無非佛性復云無情有無者豈非自語相違耶故知果地依正融通者果事也竝依眾生理本者因理也果事之所以融通自在者其由在於眾生性體元遍故也若不由眾生理本却成本無今有是無常法也他不達佛現互融之由由在於此故惑果事而迷因理執無情無佛性之疑要知凡聖因果依正自他體同性遍無非眾生因心本具者也心佛眾生三無差別斯言有在此乃等者總結上文隨緣不變波水互論不出一往約事理相對論之云也若惟從理下全約喻顯不順迷情直約理說只可云理本無事何者法法即性何適而非理也世間相常住斯之謂歟必不當云事中無理東西亦然本是東也迷之謂西今直從東說只可云東處無西迷而為西西元是東終不當云西處無東也若惟迷說則情迷於理唯迷而已所謂波無水名西失東稱者但見情無情有差別則不復見於佛性矣情性合辯四句如前若從理說水喻理波喻事但可云佛性無迷情之事必不得云迷情無佛性之理東西亦然從迷而論但見有迷情之事不復見佛性之理如波無水名西失東稱此約情性合譬於從理從迷之說無情有無例之者若從理論誰情無情從迷而說情無情隔無情無佛性矣。",
    "X56n0937_002:0580a12_0": "於是野客恭退昃跪而諮曰波水之譬其理實然僕曾聞人引大智度論云真如在無情中但名法性在有情內方名佛性仁何故立佛性之名餘曰親曾委讀細撿論文都無此說或恐謬引章疏之言世共傳之汎為通之此乃迷名而不知義法名不覺佛名為覺眾生雖本有不覺之理而未曾有覺不覺智故且分之令覺不覺豈覺不覺不覺猶不覺耶反謂所覺離能覺耶客曰若爾至佛方會凡離何乖余曰子為覺佛為覺凡耶理本無殊凡謂之離故示眾生令覺不覺故覺不覺自會一如故知覺無不覺不名佛性不覺無覺法性不成覺無不覺佛性寧立是則無佛性之法性容在小宗即法性之佛性方曰大教。",
    "X56n0937_002:0580a24_0-0": "已上約波水之喻合於真如隨緣野客聞此不復如前麤獷而不退伏於是退跪而諮曰其理實然不敢疑而不信矣雖然其所宗真如分為兩派不能無礙此正據賢首清涼妄引大論在有情名佛性在無情名法性仁何於無情名佛性耶汎為通之此乃迷佛性法性之名而不知佛性法性之義故今汎通大經佛名為覺法名不覺之旨而復會乎佛性法性真如等名並是圓詮名異體一也可謂其迷名不知義歟法名不覺即本覺之理佛名為覺即始覺之智智為能覺理為所覺而此本覺誰人不具何法不然但由迷情流轉無真不俗失於圓聞一向不覺條然相乖由佛說故此性可修佛若不說眾生不知故一往分之令其以能覺之智覺所覺之理既能覺所覺能所相即修性一如豈已覺其不覺猶守迷而不覺也抑謂所覺與能覺離耶苟為不離不覺即覺覺即不覺佛性法性不可隔異也客曰下野客意謂若爾則佛翻為覺能覺不覺至佛方會今眾生在凡不覺離覺復何所乖余曰下以理折之子號弘通大乘今起是見者為學佛耶為學凡耶若學於凡則謂之離若學於佛則佛之知見開眾生之本有初心則能用佛眼智稱本覺理照一切法同一覺體生佛無差依正融泯如此則理本無殊凡謂之離爾故示眾生下複疎前來令覺不覺句只由眾生妄謂覺離不覺故令其以能覺之智覺其所覺之理既全所覺為能覺故覺不覺自會一如矣若非全不覺為覺全本為始全性成修則何足以名佛性者哉故曰故知覺無不覺不名佛性此句結上覺無不覺即佛性義不覺無覺下四句明佛性法性二義互即方是大教所詮之佛性法性也克體言之名義偏強法是所覺佛是能覺然則全修在性全始為本境外無智方名法性故曰不覺無覺法性不成全性成修全本為始智外無境方名佛性故曰覺無不覺佛性寧立也結云是則無佛性之法性容在小宗即三藏四含容有是義真諦法性滅苦集而後會真也今立無情有於佛性者蓋本大教所詮全不覺為覺即法性為佛性也故曰即法性之佛性方曰大教如是則法性佛性名異體一苟能了此覺不覺義則其謬托大論以行其兩派之說不攻而自壞矣。",
    "X56n0937_002:0580c16_0": "故今問子諸經論中法界實際實相真性等為同法性在無情中為同真如分為兩派若同真如諸教不見無情法界及實際等若在無情但名法性非佛性者何故華嚴須彌山頂偈讚品云了知一切法自性無所有若能如是解則見盧舍那豈非諸法本有舍那之性耶又云法性本空寂無取亦無見性空即是佛不可得思量又精進慧云法性本清淨如空無有相此亦無所修能見大牟尼豈於無性又云無修能見牟尼又真實慧云一切法無相是則真佛體既真佛體在一切法請子思之當免迷教及迷佛性之進否也。",
    "X56n0937_002:0581a03_0-0": "佛性法性名異體同無可疑者然經中圓詮之名所出非一法界實際等名今欲引而徵之使歸乎一揆汝執法性在無情中且法界等名還與法性同耶異耶若曰法界等與真如同分為兩派偏情無情而諸教中不見有無情法界實際等縱汝所執無情但有法性無有覺悟不得云佛性者汝之所弘乃自華嚴華嚴何嘗言法性局在無情故引舊經四偈云初偈一切之言徧收依正色心以本性空故故無所有能如是解即見舍那豈非諸法本有舍那之性何故執無情但有法性名為不覺不名佛性耶第二偈云法性本空寂即畢竟空離四性故不可以四句取即是性空離四句外不可以四句見即是相空如此法性本自二空故即是佛如此則豈非諸法本有覺佛之性名法性耶此與前偈結皆報身性故不再結三精進慧云法性本清淨謂法性之體本來清淨猶如虗空離一切相既本無相更何所修見牟尼即應身也汝執法性名為不覺專在無情與佛性異者何故今於法性本淨無相無修能見牟尼耶四真實慧云無相即法身離染礙之相故云無相真佛體即法身也法身遍處二身常在三一融即未始暫離若見法身豈容乖二前之二身亦復如是文從別說耳既了真佛之體在一切法不當分情無情佛性法性之異也請子思之仍以迷教進否而責之由野客迷無情專名法性不當立佛性之名故今從實以法性即佛性而申之即前來大經說實教佛性之進也若不許於無情上立佛性之名者此乃前來帶權而說佛性之否也意質野客必信無情有佛性矣。",
    "X56n0937_002:0581b08_0": "故真如隨緣即佛性隨緣佛之一字即法佛也故法佛與真如體一名異故佛性論第一云佛性者即人法二空所顯真如當知真如即佛性異名華嚴又云眾生非眾生二俱無真實如是諸法性實義俱非有言眾生非眾生豈非情與無情二俱隨緣竝皆不變故俱非有所以法界實際一切皆然故知法性之名不專無情中之真如也以由世人共迷法相名異體一故也。",
    "X56n0937_002:0581b16_0": "既示法性即是佛性則了佛性不專有情也不但法性即是佛性而隨緣之真如亦即佛性異名為破彼計真如隨緣遍情非情有佛性法性之異今通會之故云真如隨緣即佛性隨緣佛之一字即法佛也法即法身以法身是理會真如名便符上立宗正因體遍之義故也他宗但知法身遍不知真如隨緣即是法身體遍法身體遍即佛性體遍故記主以法佛之性會真如名令成一轍也佛性論文凡四卷天親所造言佛性即人法二空所顯真如故今引會名異體同人法二空即能顯之觀智也真如佛性所顯之理體也故結會云當知真如即佛性異名也次引華嚴法性隨緣會真如而顯體同眾生非眾生即情與無情二俱隨緣雖俱隨緣當處不變若了不變則隨緣之相自泯故曰並皆不變故俱非有所以下通例前來所列法界等名並與真如名異體同悉有隨緣不變等義皆不隔情與無情是知法性之名不專於無情中之真如此世人迷於法相體一名異故割真如為兩派使佛性法性之碩乖矣。",
    "X56n0937_002:0581c11_0": "然雖體同不無小別凡有性名者多在凡在理如云佛性理性真性藏性實性等無性名者多通凡聖因果事理如云法界及實相等如三昧陀羅尼波羅蜜等則唯在於果所以因名佛性等者眾生實未成佛得理證真開藏以煩惱生死是佛等性示令修習名佛等性而諸教之中諸名互立。",
    "X56n0937_002:0581c17_0": "上示諸經論中凡明所詮法界等名並是名異體同然於同中不無少別以由諸名有性名無性名如佛性五名多在凡在理多之為言乃從偏強而說多必對少亦有通義若法界等無性名者多通於凡聖因果事理蓋陀羅尼即果人所得總持祕要之法波羅蜜即果人所至究竟涅槃彼岸也如三昧等名惟局在果後別示因名佛性等由眾生實未成佛得理證真開藏以其煩惱生死是修惡故從無始來全性而起故今指此修惡性是性惡示令稱性修習故名佛性理性等諸教諸名互立者如前有性無性果德之名在諸教中諸名互立亦不一向也。",
    "X56n0937_002:0582a05_0": "涅槃經中多云佛性者佛是果人言一切眾生皆有果人之性故偏言之世人迷故而不從果云眾生有故失體徧又云徧者以由煩惱心性體徧云佛性徧故知不識佛性徧者良由不知煩惱性徧故唯心之言豈唯真心子尚不知煩惱心徧安能了知生死色徧色何以徧色即心故。",
    "X56n0937_002:0582a11_0": "然大總相法門之體本無高下而涅槃經中偏於性字之上加一佛字者由眾生背覺合塵是以特唱此名寄果立因言一切眾生皆有果人之性無二無別欲其改迷向悟從因至果同佛受用故偏言之此果上依正融通並由眾生理本具足世人迷此而不從果上依正融通之義但云有情眾生有佛性無情無佛性若知果上依正融通因心本具豈分情無情之別而失體遍之旨耶又云遍者下約經遍義以斥其疑所以遍者良由眾生煩惱心性體遍云佛性遍故上云眾生佛性猶如虗空由無始以來全性起修名為煩惱之儔即生時此種純變為修者也是故今來指修即性一切眾生有此性故此是如來種性元遍名佛性遍也故知不識佛性遍者良由偏指清淨真如不知煩惱性遍即佛性遍也所謂唯心者正唯煩惱心也非但不識佛性體遍亦失惟心之義故使用觀亦直觀真心子尚不知煩惱心遍安知生死色遍由色即心故依正一如同居一念所以眾生正因體遍也四明得之則曰若信諸色即心則成無情有於佛性義也生死色者即分段變易之色故云生死若約十界則屬九界之色由無明未盡故曰生死故吾祖云寂五住滅二死也。",
    "X56n0937_002:0582b09_0": "何者依報共造正報別造豈信共徧不信別徧耶能造所造既是唯心心體不可局方所故所以十方佛土皆有眾生理性心種以性喻空具如涅槃一十復次故知不曉大小教門名體同異此是學釋教者之大患也故身子云我等同入法性及亦得解脫等。",
    "X56n0937_002:0582b14_0": "至此徵起以釋上文色遍融於即心之義色何以遍良由依之與正竝是隨緣變造之事如山河國土依報也五陰色質正報也同業所感砂礫荊棘共造也異業所感巨細殊形別造也造雖共別既同出一源二則俱二一則俱一此二相即心遍故色亦遍豈信共遍不信別遍者非斥野客之辭意謂有情別造之正報無情共造之依報並是全體隨緣變造而有於隨緣中造分能所心色異耳今明色遍正論平等法體色心不二顯妙境遍若信隨緣之色體性元遍豈有不信隨緣之心體者耶此述者之意此依之與正雖隨緣邊造分能所既皆惟心心體遍故橫亘竪窮詎可以方所局之分有無耶世人局遮那於陰質內則有於方所矣所以十方佛土皆有眾生理性心種者此也所謂理性心種者本有三道指修即性即三佛性由未曾發心加行名理性也種者能生為義煩惱之儔是如來種即本有三種三理元遍是今心體能生一切依正故經云眾生佛性非內非外猶如虗空無有罣礙以性喻空具如涅槃一十復次者歸元佛性斥邪顯正亦所以寄斥世人及野客者也故知下以名體同異而結責之大小教門名同體異名異體同如法性解脫等大小名同其體永異如大教佛性真如等其名雖異其體乃同學釋教者苟不達此是大患也故引法華等證我等同入法性乃真諦法性其名雖同其義則異解脫亦然。",
    "X56n0937_002:0582c15_0": "子初不達余之義旨故聞之驚駭為子申己理合釋然故知世人局我遮那唯陰質內而直云諸法是無情者則有二種不如外道外道尚云我大色小我徧虗空又外道猶計眾塵所成亦不直云無情而已又有二種不如小乘小乘尚云猶業力造造遍三界又小乘猶知諸法無常亦不直云無情而已又有二種不如共乘共乘尚知造心幻化幻徧三界又知諸法體性即真若次第乘故非所擬子聞是已亦合薄知教法權實佛性進否。",
    "X56n0937_002:0582c24_0": "子初聞無情有性惑耳驚心者以不達余所立之義旨故也今既為子始自大經進否權實終於名體同異委曲而詳申之已合渙然冰釋世人局遮那佛性於有情陰質內直云諸法是無情者不但迷於大教體遍之旨如邪外偏小亦皆不及矣如外道二種一計神我之我我大色小者及我遍虗空一切無非我者又有計我身微塵所成者雖所計不同皆於無情等色有我遍之義不直云無情而已又如小乘二種一者詮業力搆造三界業由於心義當心造即實有俗也又知法性無常即真諦也此以小乘二諦言之亦不直云無情也如共乘即通教二種一者詮能造心如幻如化幻徧三界何所不該即幻有俗也又知諸法體性當體即空真諦也此以共乘二諦而言豈直云無情耶若次第乘之別教詮一真徧造諸法心生理徧故非所擬又聞是已者擬上多番往復開導亦合薄知教法權實佛性進否之義此再擊之欲其開解耳。",
    "X56n0937_002:0583a17_0": "客曰仁善分別實壞重疑信一切法皆正因性而云正中三因種徧修徧果徧又云一塵一心即一切生佛之心性情猶未決余曰良由自昔不善徧攬因果自他依正觀於己心心佛眾生亦由不閑諸教大旨不曉佛說果德之意不達佛現互融之由余欲開導子之情懷更以四十六問而問於子子若能曉余之一問則眾滯自消法界融通釋然大觀洞見法界生佛依正一念具足一塵不虧。",
    "X56n0937_002:0583b01_0-0": "自野客以大經無情非性執難以來述者為判涅槃權實之文佛性進否之義兼示唯心唯色之旨示煩惱性遍修遍等義節節復疎至此方解瓦石無性是權虗空體遍是實故曰仁善分別實壞重疑偏權疑碎理實然也雖解此意解而未解如上文有種遍修遍果遍一塵一心即一切生佛之心性等若不具以一家不思議境圓具之旨而廣示之終未能盡圓解之妙故又以情猶未決為辭而生起下文也只一具字彌顯今宗抗折百家超過諸說述者於觀心中明凡聖一如色香泯淨乃至不逾下凡之一念者由具故也無情遍者此也昔計佛性唯局有情今蒙開示知正因性遍情與無情故云信一切法皆正因性猶疑緣了性遍修遍果遍此指前文若頓教實說本有三種三理元遍達性成修修三亦遍雖不云果既曰修遍則必訂果果在其中矣所以前云十方佛土皆有眾生理性心種也言三因種者即性三也修遍者則修二亦各具三也果徧者即一佛成道法界無非此佛之依正也故云三千果成咸稱常樂前云正因遍雖已粗曉但云三因俱遍等疑猶未決余曰下謂以由不達教觀圓具之旨故今以觀言之由自昔不善徧攬因果自他依正觀於己心心佛眾生三無差別之旨是故昧於種遍等義此由不善觀心具之失也文云因果自他依正三雙通而言之即一念三千之旨別而言之不善徧攬因果觀於己心所以不解種徧修遍果遍不善徧攬自他依正所以不解一塵一心即一切生佛之心性也以教言之一代顯頓諸教大旨示眾生本有性種合依解立行全性成修既不閑此所以不解種遍修遍說佛果德意在因心本具既不曉此所以不解果遍佛現融通全由理本故云佛說果上依正融通並由眾生理本既不達此所以不解一塵一心即生佛心性雖有此四不出教觀二義教則為下四十問張本觀則為下觀心六問張本是以更設四十六問而徵之於一一問無不顯三千圓具之旨以見無情有佛性義於諸問中若解一問無滯不銷則了諸法皆是法界法界圓融故不見有一法之隔法界虗通故不見有一法之礙豈非大覺是以洞見法界生佛依正一色一心無非法界所以前云一念具足一塵不虧一念具足即唯心三千也一塵不虧即唯色三千也色法不二依正體一文雖不明言三千三千之旨在其中矣此四十六問不無生起次第佛性是所立之宗故先徵之無情是所破之執故居其次已上情性既皆唯心故次示心法心法屬自生佛屬他故次心問生心生在因佛法在果故次生問佛佛是正報佛既屬悟依正兼明故次問土成道之別心佛眾生不出變造十界諸法並屬所隨之緣而能隨者全是真如故次之真如之問上之七義皆屬法說利根雖解鈍根未明故更以譬問前四十問乃約教開解為問對前不了教旨之失後之六問約依解立行為問對前不觀心具之失若約總別言之前四十五問是別後之一問是總如下文云豈非曉最後問三無差別文。",
    "X56n0937_002:0584a07_0": "問佛性之名從因從果從因非佛果不名性問佛性之名常無常耶無常非性常不應變問佛性之名共耶別耶別不名性共不可分問佛性之名大小教耶小無性名大無無情問佛性之名有權實耶對體辯異其相何耶。",
    "X56n0937_002:0584a12_0": "初問因果當知佛唯在果性多在因因具果性故名佛性果上依正融通並由眾生因中本具因果不二佛性寧偏何執情與無情有性無性故大經云是果非因名為涅槃是因非果名為佛性一切眾生即大涅槃是約因從果佛性名因是約果從因二問常無常佛性不變應是他宗執在無情偏名法性者却見佛性是無常耶三問共別佛性平等一切眾生同共有之遍一切處非內非外大小內外其理一如何得分情無情有性無性耶四問大小小教乃存無情之說無佛性之名大教唯有佛性之談無無情之說今佛性既屬大教所詮豈復存無情無佛性之稱耶五問權實者此問因涅槃經中云瓦石非性故以權實為徵涅槃瓦石非性之文則有帶權說實故有緣了難正之文實則正因體遍權則緣了不遍若一向實如三點二鳥等若一向權如恒河中七種眾生等如是則權實各有所歸。",
    "X56n0937_002:0584b05_0": "問無情之名大小教耶大教大部有權實耶問無情無者無情為色為非色耶為二俱耶問無情色等佛見爾耶為生見耶為共見耶問無情敗壞故無性者陰亦敗壞性亦然耶問無情是色法界處色為亦無耶為復有耶。",
    "X56n0937_002:0584b10_0": "問大小教部者前約佛性問大小今約無情分大小乃就經部中用權實分大小耳無情之名局在小宗亦遍大部由大部中有於權實權有無情之名實教不分情無情異二問非色即心此以今家色心一體而詰之子執無情無性若云無情是色無佛性若云無情即心與俱遍色心色心相即豈非佛性耶三問無情色等即等於色非色異為佛見耶佛眼佛智真空冥寂不應有二為生見耶生既迷妄所見故二子為順迷為順悟耶若生佛共見者佛見既其不二生見豈定異耶四問若以生滅色法有敗壞故無佛性者有情陰質亦有敗壞身內亦應爾耶五問以無情是色者約根塵相對十八界中色聲等雖屬外五塵於法界法塵中少分轉入意地緣慮之色為當有耶無耶若有佛性內色既有草木之色何無耶若云此色無者且此無色一分屬心心若無者却見有情亦無耶。",
    "X56n0937_002:0584c02_0": "問唯心之言子曾聞耶唯只是心異不名唯問唯心之言凡聖心耶若聖若凡二俱有過問唯心名心造無心耶唯造心耶二俱有過問唯心唯心亦唯色耶若不唯色色非心耶問唯名心造無心耶唯造心耶二俱有過問唯心所造唯依與正依正能所同耶異耶。",
    "X56n0937_002:0584c08_0": "初問一切唯心文出華嚴豈不聞乎既曰唯心則心外無法只一心而已謂情無情苟曰有異唯義不成二問唯心只是法界依正一體聖凡一致若執凡心聖在凡外若執聖心凡與聖隔故曰若聖若凡二俱有過只緣他執眾生唯有清淨真如正是棄凡唯聖即唯聖心之過若如今家了一念三千之旨則無是過也三問造有能所心為能造色為所造唯者無外之稱既曰唯心即能造所造全色是心心外無色色心不二今唯心之言唯造於色(無心是色)為只造心(造心是心)若執一邊則色心隔異非唯心也四問既名唯心為復只是唯心為亦唯色色非心者大教唯心心色不二色即是心心即是色一體不二何得心外有色耶五問唯心所造不出依正正是能依依是所依若云同者豈可佛性一無一有若云異者能造既唯一心所造豈應有異。",
    "X56n0937_002:0584c24_0": "問眾生量異性隨異耶不爾非內爾不名性問眾生惑心性徧不徧神我句四為同異耶問眾生有性唯應身性亦法性耶亦報性耶問眾生本迷迷佛悟耶佛既悟已悟生迷耶問眾生一身幾佛性耶一佛身中幾生性耶。",
    "X56n0937_002:0585a05_0": "初問眾生量異謂眾生形量巨細長短異狀若佛性隨異異不名性若佛性不隨量異者却不局眾生身內故曰不爾非內爾不名性者若謂佛性隨眾生量者佛性是一豈有變遷量異不同二問眾生惑心等者謂無明惑心之性為徧不徧惑性若徧佛性安得不徧無情若云不徧與外道四句為同為異若謂是同外道自云我大色小我遍虗空今云不徧那得與同若云異者尚不及外況圓頓教耶三問眾生有性佛性有三今問他云眾生有性必竟有何性耶若云法身性者法身體遍法身遍在一切處何隔無情若云有報應性三身相即無暫離時如妙樂云法身徧處二身常在故云性具三不可遍一義解云此難眾生有情性邊故自應身遍乎法報也四問眾生本迷者生佛迷悟眾生無始背覺合塵濁成本有迷成不覺諸佛究竟背塵合覺返本還源迷名永失是則生惟迷佛之悟佛乃悟生之迷迷悟雖殊事理體一佛既依正融通生豈情無情異五問眾生佛身者三千妙性圓融遍入生佛互具悟之成佛迷之成生一一生佛即具一切生佛之性豈可計於一生幾佛一佛幾生耶。",
    "X56n0937_002:0585b02_0": "問佛國土身為始本耶始本同耶為復異耶問佛土佛身為一異耶一無能所異則同凡問佛土界分生亦居耶為各所居佛無土耶問佛土所攝為遠近耶何土與生一異共別問佛佛土體為同異耶娑婆之處為共別耶。",
    "X56n0937_002:0585b07_0-0": "初問國土者乃他宗所弘華嚴之經現十身舍那之一也由其執國土無情無性故難云此國土身為在果上始有為因中本有若果上始有者乃本無今有是無常法若云眾生身中本具國土身即見有情有國土之色何云國土無性乎始本同者因果不二因果既其不二果既依正融通因亦不當分情無情之別若言異者非圓頓所詮二問佛依正者如來所依之土能依之身為一為異一則無能依所正之別異則同於凡夫身土差別子為學佛為學凡耶三問佛土界分等者其意有三佛土界分生亦居耶者此問為是佛土許生同居耶為各所居者此問生佛還各有土而自居耶佛無土者此問生所居土為佛與居佛身無土耶問雖有三正顯生佛共居佛既依正相即生豈不然以佛驗生無情性顯四問佛既三身土必攝四言遠近者若分別為言方便在同居外乃至寂光在實報外故名為遠若即事而真即此娑婆或見方便或見實報豈離伽耶別求常寂非寂光外別有娑婆故知橫竪只在一處故名為近一既攝四何土與生一異共別一異約土共別約人土既非一非異人誰共居別居以佛互融顯生不二也豈可若共若別理固不可若一若異佛性寧分五問佛佛土體者前以生佛對論同異今以佛自問所謂若兼體同一切皆四則同實未嘗同又知橫竪只在一處則異實未嘗異如是則法界終日常同終日常異何同何異究竟而言求其身土了不可得何情無情之有耶此通約四土論同異也第二別約釋迦同居與諸土論同異為別是釋迦之土為復即同諸佛之土然土體既一一必成同同則無異何得分情無情耶。",
    "X56n0937_002:0585c13_0": "問佛成道時土亦成耶成廣狹耶不成有過問佛成見性與生見處為同異耶離二不可問佛成土成與彼彼成彼彼不成為一異耶問佛成三身與彼彼果及彼彼生為一異耶問佛成身土成何眼智見自他境初後如何。",
    "X56n0937_002:0585c18_0": "初問佛成土成凡佛成道三惑究盡四德圓明法界之體究竟極證得法界之大用依隨正轉山河國土靡不成矣所謂一成一切成法界無非此佛之依正尚可成否廣狹之問耶若計不成過莫大矣二問佛成見性者佛成道時佛眼所見皆毗盧體眾生肉眼所見自成差別今是佛成道所見有何情無情異然依正色心之境雖同而能見自有迷悟之異同異二義不可離也三問佛成土成即依正也彼彼十方諸佛果成即理事一也彼彼不成即是眾生有異圓宗所詮三無差別豈應異耶四問生佛三身者前第三問通就身土今別就三身為問佛成三身遍其依正與彼十方果成三身事理一也與彼彼眾生理一事異也既理是一豈分情無情異五問身土既成畢竟成何眼智身既遮那土既寂光非四眼二智森羅即佛眼種智真空冥寂豈復境有自他初後之殊既自他初後不二豈分情無情耶。",
    "X56n0937_002:0586a11_0": "問真如所造互相攝耶不相攝耶二俱如何問真如之體通於修性修性身土等不等耶問真如隨緣變為無情為永無耶何當有耶問真如隨緣隨已與真為同異耶為永隨耶問真如本有為本無耶與惑共住同異如何。",
    "X56n0937_002:0586a16_0": "初問真如所造相攝不相攝者真如隨緣造於萬法若互相攝則依正不二若不相攝能隨既一所隨豈異二俱如何者豈攝不攝義兩立耶二問真如通修性者此問正同妙樂修德四德為能依性德四德為所依能所竝有能依之身依於所依之土二義齊等方是毗盧遮那身土之相今所問意既是毗盧遮那身土之相何云無情依報無性矣三問情無情竝是真如全體不變而變變為有情而有性變為無情則無性者為永無耳既從性變那得永無若也永無那得將來佛果當成依正融攝果既融攝因驗不無四問真如隨緣同異者蓋問能隨之真如為所隨之真如為同為異故云隨己與真為同異耶為復永隨不與真如同耶謂異則非圓頓大教所詮謂同則不當分情無情之別五問以真如有無為問當知真如佛性本自有之非適今也故曰本有若謂本無則因不稱果若也共住為同為異真妄同源惑性體即惟同非異誰情無情未發心前無真不俗唯異非同固非所論耳。",
    "X56n0937_002:0586b11_0": "問波水同異前後得失真妄同異法譬如何問病眼見華華處空處同異存沒法譬如何問鏡像明體本始同異前後存沒法譬如何問帝網之譬唯譬果耶亦譬因耶果無因耶問如意珠身身有土耶唯在果耶通因如何。",
    "X56n0937_002:0586b16_0": "初問波水之喻在濕詎間於混澄水同也為波自分於清濁波異也前後得失者若論波濕同時未始前後一往言之全水為波為前全波為水為後水本無波得也波無水名失也合法言之從真起妄名前返妄歸真名後若從悟理名得若從迷事名失問意在於真本無妄豈隔無情二問空本無華由眼病故華存空泯眼病若除空存華沒於空同處見華成異由眼病故即華異處見空元同由眼病除故是則空同空異若並存沒合法言之病喻妄情空喻佛性華喻依正真如境上依正元融由無明妄情於融成隔但見差別不見無差如華存空沒妄情若除隔即融泯故所見處差即無差如空存華沒唯一佛性而已何間無情三問鏡像明體者謂鏡像之體鏡明之體本始同異者鏡明性十界本也像生修十界始也明體則同像分妍醜前後存沒者本前始後明存則像沒明沒則像存以法言之若論佛性不存依正依正佛性寧存四問帝網之珠帝網喻依正互融舉一全收彼彼無礙若唯譬果成果異因若亦譬因因必攝果故依正融通豈唯果上身土耶五問如意珠身者此珠狀如芥粟七寶琳琅非內畜非外入稱意豐儉降雨穰穰今以之喻隨所應度現十界身譬如意珠王隨意雨寶說法利生故名如意珠身身必有土故云身有土耶若謂如意珠身唯在果者却見此果無因若通因者請示其旨故曰通因如何若知果既身土不二因何依正差別。",
    "X56n0937_002:0586c18_0": "問行者觀心心即境耶能所得名同異如何問行者觀心一耶多耶一多心境同異如何問行者觀心為唯觀心亦觀身耶亦觀土耶問行者觀心在惑業苦內耶外耶同耶異耶問行者觀心心內佛性為本淨耶為始淨耶問行者觀心心佛眾生因果身土法相融攝一切同耶。",
    "X56n0937_002:0586c24_0-0": "良由世人不閑諸教大旨故前以四十問為其開解亦由世人不善遍攬因果自他依正觀於己心今更以六問問於觀心意謂既能妙解須立妙行解行相資凉池可到矣當用觀時以此心為所觀復即此心為能觀能所俱心境智互照俱三千故各攝一切境之與觀不分而分得名有異二而非二其體復同故義例云以心為境心亦能照若能所不二境觀一如豈分情無情之異耶二問心境一多者行者唯於萬境觀一心豈非一心遍於萬境故不以一多求之蓋由行者即於當念觀具三千故一念即三千三千即一念妙不決定不可以一求之故不同也不可以多求之故不異也三問行者觀心了自他依正之法無非心具若只觀心不觀身土則成差別不得名為不思議境觀不二門云依正既居一心一心豈分能所雖無能所依正宛然豈分情無情耶四問苦惑業三圓人了達三道即是三德不可於三道外別求三德若離三道別求清淨真如如何名為圓具一體不二五問心內佛性為本淨始淨者由眾生本理清淨依正一如是故始覺果成身土融通自在六問此以心佛眾生因果身土融攝為問者若了心佛眾生同一三千三無差別則因之與果身之與土一切法相互相融攝未始有一法之不同苟能如是解而觀之則凡聖一如色香泯淨阿鼻依正全處極聖之自心毗盧身土不逾下凡之一念如此則豈計無情無佛性耶是知此一問總前諸問若了無差之旨則一問中可消眾滯一答之中則為遍答眾問故下文云豈非曉最後問三無差別即知我心彼彼眾生一一剎那無不與彼遮那果德身心依正自他互融互入齊等。",
    "X56n0937_002:0587b06_0": "如是記問不可窮盡為斷子疑且至爾許客曰何以不多不少唯四十六余曰攻惑攻疑攻行攻理通教通義通自通他一問亦足為對鈍根故四十六及對六即分證離為四十一位兼前及後故四十六應知一問亦皆能攻餘四十五餘一一位仍須皆具四十六問乃至無量亦復如是。",
    "X56n0937_002:0587b12_0-0": "不可窮盡者以略例廣謂若也搜括一家教觀深旨設於問端不可窮盡客擬止爾故且至爾許客所擬者以教言之由其不閑教旨因果互融遂不了無情佛性三法無差真如變造如全水為波等故有前四十問以觀言之由其不善徧攬因果自他依正觀於己心心佛眾生但觀清淨真如故有後之六問耳設復客問以不多不少為辭生下答文若利根者則若惑疑行理一問亦足眾滯自消何待四十六問所謂攻者即攻破也通者即通達也他所惑者由惑果事而迷因理不了因心本具至果方融此惑當攻既疑無情無性此疑當攻不但其解如此及其立行用觀亦直觀於清淨真如此行當攻其將真如變造依正分為兩派此理當攻若攻此四則通權實之教通佛性進否之義若能妙解一念三千依之立行無復直觀清淨真如則自行無壅而通矣自行既立無復踵於真如兩派之說而障後學佛之知見故曰通他此對利者而言次對鈍根故四十六及對六即也為對鈍根等者當知利根之人於一問中即能袪滯釋然大觀解行俱通若鈍根者以四十六問備該圓頓因果及以經論所明身土觀境互融之義方能解了依正一如始終理一及對六即者謂非但唯對鈍根而已仍兼乎六即之位故也理同故即事異故六如指要分證離為四十一位者初住至等覺兼前理即名字觀行相似及後究竟共為四十六也以問對位其數雖同非謂直以一問對一位在問則無不遍攻在位則無不具攝亦理然也又復應知諸問自佛性至觀心就其所攻義異故曰一能攻餘攻者斷其疑也若論能攻之問只是一念三千教則解此三千行則觀此三千豈復更自相攻耶乃至無量亦復如是此結上不可窮盡之意。",
    "X56n0937_002:0587c20_0": "金剛錍釋文卷中"
}