{
    "X56n0931_001:0401b10_0": "重刻十不二門指要鈔詳解引",
    "X56n0931_001:0401b12_0": "十不二門指要鈔者玅顯荊溪之意善示修證之要而無極大師所著詳解消釋詳悉意旨精密大有功於學者焉第其分會有未盡善者加之國本脫誤尤多則蒙學之士往往病焉(余)曩訪獲善本對挍一通及竊正分會之未善者猶慮其未詳不丞刻梓客秋因本寺講鈔復細為挍訂質諸老師宿衲而剞劂流通讀者誠由文辭之易曉以開發玅解則庶幾此舉之務立行造修之一助乎。",
    "X56n0931_001:0401b20_0": "旹",
    "X56n0931_001:0401b21_0": "元祿癸未秋八月朔旦",
    "X56n0931_001:0401b22_0": "天台山沙門(亮潤)敘于德王之圓覺室中重刻十不二門指要鈔詳解凡例(九條)一國本有脫誤者今依明本悉讎正之其明本有疑誤者於格上書某字疑某字。",
    "X56n0931_001:0401c04_0": "一釋籤及鈔嘗有諸本與此所合不同者亦書某字一本作某字。",
    "X56n0931_001:0401c06_0": "一會本每卷之首列撰人直斥二祖之諱非所以尊祖也今竝刪之惟存某尊者之稱。",
    "X56n0931_001:0401c08_0": "一會本所標之釋題之科既非鈔科亦非解文葢分會之際欲對釋文之科私添入耳今欲不濫鈔科盡刪去之。",
    "X56n0931_001:0401c11_0": "一會本不標指要述人而反標釋籤述人大非鈔解之意今據鈔解標否得當。",
    "X56n0931_001:0401c13_0": "一會本標鈔科每科刪某下數字及往往改削字句者今據原文悉補之無復一字之損傷。",
    "X56n0931_001:0401c15_0": "一會本數處私補結門之科理雖當有亦不可謾添今別標諸格上以便見前後應對。",
    "X56n0931_001:0401c17_0": "一會本分會差謬者凡三處今竝改會之。",
    "X56n0931_001:0401c18_0": "一此番重刻務在刪補會刻之增損完全各書之原文然惟釋籤指要有別行之可考而詳解則別行亡久故今多所可疑而不得而挍證讀者詳焉而可也。",
    "X56n0931_001:0402a06_0": "合刻十不二門指要鈔詳解序",
    "X56n0931_001:0402a08_0": "指要鈔者開十不二門之玅鑰也其語深其義邃非利根上智曷能通之有宋可度無極大師深明一家教觀為之詳解誠如執柯折薪遊刃破竹矣然其本釐而未合也學者病之天台雲石師乃無盡大師之高足其兄以玄師亦法門之偉人每念及之時復扼腕乃留意參會成帙未梓行而寂雲公憫兄齎志毅然繼志而梓之以公同學不亦善哉噫此解流通台宗朗如日星矣合帙而觀用志不分法華開會之大旨則又思過且半矣得非大有功於後學歟是不可一日少緩也丞募檀資以付剞劂氏梓成問序於余余媿無文而直述其會刻之顛末昆仲之苦心如此云。",
    "X56n0931_001:0402a20_0-0": "崇禎辛未端陽後二日武林天台後學沙門海眼槃譚書於報國院十不二門指要鈔詳解總序夫具妙心者人悟妙心者佛闡妙心者教釋妙教者祖祖言既玄必因門而入妙門雖闢須得要而登既指要之可憑必詳言而始解妙法蓮華經者闡妙心之至教了佛意之玄詮如來說之於八年結集堆之以八里梵冊傳來猶太倉之粒粟童壽翻譯如滄海之一漚然而縮一劫為一日妙在神通藏剎海於一塵玄由至理是則雖粒粟可以為太倉之種一漚可以收滄海之深七佛繹經之師六萬傳心之旨斯言不謬厥義可徵若夫嘗一粟而眾味具存見一漚而瀛渤俱在則惟在吾天台智者大師之具足五舌五眼乃能得之也蓋大師靈山夙聞大蘇妙悟縱無礙辯稱性宣揚依迹本二門開待絕二妙如來大事因緣眾生佛之知見至是殆無餘蘊矣第迹門非遠十妙難通至理雖彰妙心難悟由是荊溪開以十不二門四明指以一念心要噫若如來之與智者可謂破一微塵而出大千經卷",
    "X56n0931_001:0402a20_0-1": "荊溪之與四明可謂合大千經卷而歸一微塵則法華玄義迹門十妙十不二門指要鈔者真直指人心見性成佛之要門無離文字而說解脫之秘典也惟約為博源略為詳本不有錢塘可度大師孰傳四明法智精義發為詳解十數萬言譬王家椒室相宅朱門非主壺者而莫識其淺深非司閽者而莫啟其階降良遺澤於後崑流芳於末運者也惜其未入大藏散於僧寮徒仰嘉名不獲寓目有四明延慶寺僧傳慧字朗初者詩酒僧也偶於山寺得獲此書雖知井中具寶不解燃炬而觀以之進余用當清供余得之如熱渴之滿飲甘露饑餒之飽飫醍醐冀登梨棗以公同志復以鈔解各行艱於尋繹命弟子正謐會合其文藏之笥中三十年矣茲弟子正識堅誠募梓因緣輻輳大法當行垂老覩茲頗為稱快然而歸功有自慧僧不無緣因即此可以懺生平綺語截舌之愆釋積劫麴糵灰河之罪因斯冥益重得為僧以實語讚性具之宗慧業裂迷癡之網併將功德普惠四生若自若他俱臻十妙是可酬山僧流通之志與兩弟子錫類之心爾。",
    "X56n0931_001:0402c18_0": "時",
    "X56n0931_001:0402c19_0-0": "皇明天啟五年歲次乙丑仲冬天台山幽溪沙門傳燈著於四明延慶寺之羅雲堂十不二門指要鈔科鈔科分(二)初釋題(二)初正釋題(十)二述人號(荊)二釋文(三)初總敘立意(四)初序前文立述作之意(二)初敘前(二)初敘教廣(二)初十玅意(燃)二眾釋意(凡)二敘觀略(觀)二立意(二)初重示大部意(所)二正明今述意(二)初為成玅解(故)",
    "X56n0931_001:0402c19_0-1": "二為成玅行(故)二例後義彰法理無殊(二)初例本玅(若)二例四章(況)三別示玅體令解行俱成(三)初指玅歸心(若)二示成由行(則)三功成識體(則)四結示立名使詮旨斯顯(四)初立門所由(故)二出門名義(何)三各自高深(一)四直彰宗趣(本)二列門解釋○三結攝重示○○二列門解釋(二)初列門對玅(二)初列門(一)",
    "X56n0931_001:0402c19_0-2": "二對玅(是)二釋門旨趣(十)初色心不二門(三)初標(一)二釋(二)初約諸境明總別(二)初雙標(且)二雙示(二)初別(何)二總(既)二就理事明諦境(二)初約理事明三諦(二)初明理事(當)二結成三諦(是)二會生佛居一念(故)三結(故)二內外不二門(三)初標(二)二釋(二)初明內外境觀(二)初標示(凡)二釋相(二)",
    "X56n0931_001:0402c19_0-3": "初明外境觀相(外)二明內境觀相(所)二明內外融泯(二)初互融(是)二俱泯(誰)三結(此)三修性不二門(三)初標(三)二釋(二)初修性雙立(三)初修性對論(二)初直明性德(性)二以修對辨(二)初明相成(性)二明互具(在)二明逆順相反(二)初明對逆故二性並存(修)二明因順故二心俱泯(可)三明離合本同(二)",
    "X56n0931_001:0402c19_0-4": "初約法明離合相異(又)二約喻明修性體同(二)二修性俱立正示不二(應)三結(此)四因果不二門○五染淨不二門○六依正不二門○七自他不二門○八三業不二門○九權實不二門○十受潤不二門○○四因果不二門(三)初標(四)二釋(三)初就圓理明因果暫存(三)初明始終理一(眾)二明悟迷事異(二)初問二答三明事極理亡(祇)",
    "X56n0931_001:0402c19_0-5": "二依圓解明修證無得(二)初約法明惑智之體本虗(秪)二約喻明修證之功不立(二)初明修證功亡(故)二明德障體異(空)三約圓乘明始終不二(二)初翻覆對揚明體一(是)二高廣無減明不二(所)三結(此)○五染淨不二門(三)初標(五)二釋(二)初明所顯淨法(二)初染淨體用理無增減(三)初法(二)初明染淨體(若)二明染淨用(法)",
    "X56n0931_001:0402c19_0-6": "二喻(濁)三合(清)二界如緣起性本圓常(二)初約性德直示(故)二約修成反顯(故)二明能顯玅觀(故)三結(此)○六依正不二門(三)初標(六)二釋(二)初明果用由因本具(三)初示依正不二(二)初明不二之由(巳)二示不二之相(以)二明因理本融(二)初明三位本玅(是)二示一切皆融(但)三明始終無改(二)初明情智局徧(然)",
    "X56n0931_001:0402c19_0-7": "二明體用常融(二)初略示(始)二廣示(故)二明理顯以觀為功(二)初克彰觀行之功(若)二結示生佛一致(如)三結(此)○七自他不二門(三)初標(七)二釋(二)初示感應之體本同(二)初約法示(三)初約一性明自他(隨)二約三千明感應(如)三約俱具明道交(眾)二約喻示(二)初順喻(不)二反喻(若)二明觀行之功方顯(二)",
    "X56n0931_001:0402c19_0-8": "初帶喻彰用匪功成(若)二就法明發由觀合(應)三結(此)○八三業不二門(三)初標(八)二釋(二)初明所顯果用(二)初約對機顯逗會無差(二)初示三輪不同(於)二明真應復殊(在)二約稱理明卷舒自在(二)初融身說(二)二曾三輪(身)二明能顯觀體(三)初結指心因(豈)二觀成用顯(百)三染體本玅(故)三結(此)○九權實不二門(三)",
    "X56n0931_001:0402c19_0-9": "初標(九)二釋(三)初明等鑒由理融(平)二遍逗由心證(至)三結示歸理一(對)三結(此)○十受潤不二門(三)初標(十)二釋(三)初明權實本圓薰修如幻(二)初由具可薰(物)二因薰可發(若)二明生佛一際欣赴不偏(然)三明地雨無殊利益平等(故)三結(此)○三結文示意(三)初明十門通貫理體無殊(二)初約十門明理一(是)",
    "X56n0931_001:0402c19_0-10": "二約十玅明理一(如)二明一念包容觀行可識(三)初明一念觀境之功(既)二明心法攝成之要(若)三明重述觀行易明(故)三明得意符文總別無異(首)十不二門指要鈔科(終)十不二門本迹二十重玅十不二門指要鈔序詳解宋慈雲懺主　遵式　序宋武林沙門　可度　詳解明天台後學　正謐　分會指要鈔序【觧】此題上三字是所序之正文序字是能序之通目以別冠通故云指要鈔序指要二字本序自釋鈔者鈔錄為義西資鈔序云夫疏之有記鈔葢後學之曹記錄要義抄寫格言以輔翼其疏防乎傳受之謬誤討尋之忽忘耳(文)",
    "X56n0931_001:0402c19_0-11": "序者所以序作者之意爾雅云東西墻謂之序註云所以序別內外也(文)謂見墻別宅舍之淺深觀序知述作之難易又序緒也謂繭之緒也凡繭之抽絲先抽其緒緒盡方見其[糸*系]今序在初如[糸*系]之緒也(光記)。",
    "X56n0931_001:0408a20_0": "【序】東山沙門遵式述【觧】東山即台之東掖山能仁寺懺主云東掖山者葢予幼歲受經之所時年傳法之地也懺主族姓葉氏台之寧海人其母乞靈於觀音大士夢一美女授以明珠咽之生師七月能從母稱觀音名十八祝髮二十納戒初住寶雲終於天竺與法智同稟學於寶通雲師指要既成乃為述序發明述作之功沙門如常釋述者禮云述者之謂明作者之謂聖今云述者葢謙詞耳語云述而不作。",
    "X56n0931_001:0408b05_0": "【序】大教隆夷存乎其人諸祖既往玄化幾息時不可久替必有間世者出焉。",
    "X56n0931_001:0408b06_1": "【觧】通敘教法興衰在人通指佛法以為大教玅玄總序云大法東漸籤云通指佛教以為大法(文)此對西土外道此方儒教約內外而分大小隆盛也夷平也文選云道有隆夷(文)即興衰之義易曰神而明之存乎其人(文)存在也謂教法興衰在人得人則興失人則亡禮云文武之道布在方策其人存則其政舉其人亡則其政息(文)諸祖者通指荊溪已前諸祖在世教法盛行諸祖既往則幽玄之化幾近於息滅矣文選云仲氏既往玄化幾息繫辭曰易不可見乾坤或幾乎息矣(文)替廢也間世即名德間生於世孟子曰五百年必有王者興其間必有名世者(文)以時節不可久廢不遠而復必有間生者出興於世荷負斯道四明塔銘云天欲久其道世必生有人(文)間世者誰故出其人。",
    "X56n0931_001:0408b21_0": "【序】四明傳教導師禮公實教門之偉人也。",
    "X56n0931_001:0408b21_1": "【觧】別敘傳弘之德四明乃慶元府南面山名有峰最高四穴在上每澄霽望之如戶牗相傳謂之石窻謂四畔通日月星辰之光故曰四明人尊其道故以處名人傳轉也以己之道轉以授人導師者法華云有一導師聰慧明達(文)尊者上字諱知下字諱禮二名不偏諱故稱下字公者尊之稱也偉大也謂奇偉卓絕一家教觀賴師中興故稱偉人此且總歎。",
    "X56n0931_001:0408c06_0": "【序】童子受經便能思義天機特發不曰生知之上性者乎。",
    "X56n0931_001:0408c07_1": "【觧】童子即太和未散之時幼稚之稱爾雅云人未冠曰童禮云人生十年曰幼學二十曰弱冠(文)弱冠已前皆名童子尊者七歲屬母喪為報鞠育急於出家從里中大平興國寺洪選為弟子即童時也受經思義雖不見所出尊者之母既夢梵僧遺童子曰此佛子羅睺羅從而有孕初出家時從師受經必能思義懺主與師同門必知其事天機特發者天然之機挺特而發莊子云其嗜欲深其天機淺(文)不曰即豈非之謂語云生而知之者上也今借用以擬本有性德宿習開發義似生知止觀統例云生而知之者葢性德也學而知之者天機深也。",
    "X56n0931_001:0408c19_0": "【序】及進具稟學於寶雲通師初預法席厥父夢其跪於師前師執瓶水注於口中其引若泉其受若谷於是乎天台大教圓頓之旨一受即了不俟再聞師謂之曰子於吾言無所不達非助我也逮師始滅公復夢貫師之首擐於左臂而行。",
    "X56n0931_001:0408c23_1": "【觧】敘師資授受自行化他事匪偶然故有奇相形於夢寐預表彰焉進具謂進受具戒稟學者按實錄曰十五受具戒專探律部二十從寶雲學天台教(文)通師本高麗君族壯遊中國當晉天福年間見螺溪寂法師了天台宗旨會漕使顧公捨宅為寺以為傳道之所即寶雲寺也初預者預廁也入也初入寶雲師輪下其父之夢葢受學之先讖也父金性諱經夢尊者跪於通師之前通持瓶水注於口中其引若泉來之而不竭其受若谷注之而不盈孟子曰源泉混混不舍晝夜谷者說文云泉出通川曰谷爾雅云水注川曰溪注溪曰谷謂師之樂說無窮如泉之不竭尊者之容納如谷之不盈谷音欲若作穀音者訓空谷窮谷也於是猶自此也天台大教特言圓頓者別於藏等四教舉其極者言之一家所談功由即具尊者自此於寶雲言下一遍受之即能解了不俟再聞師謂之言即印可之語凡師資授受難疑問答更相啟發今一聞即了不假再詢其於啟發之道何有哉故曰非助我也語云回也非助我者也於吾言無所不悅(文)顏子於聖人言下默識心通無所疑問故曰非助我也尊者亦然通師深讚之言也逮及也通師示寂於端拱元年初入滅時尊者又得傳持之讖貫穿也擐音患帶也左傳云擐甲執兵葢夢穿師之頭帶於左臂而行夢雖似異有所表故。",
    "X56n0931_001:0409a24_0": "【序】嘻得非初表受習若阿難瀉水分瓶之莫二也後表傳持操師種智之首而行化也。",
    "X56n0931_001:0409b01_1": "【觧】此示夢不徒然必有所表嘻歎聲初父之夢表尊者受習通師之道如水分瓶猶如來說法阿難傳受如水分瓶更無二也大經云阿難自侍我來持我所說十二部經一經於耳曾不再聞如分瓶瀉水置之一瓶(文)後表等者後夢即表持於種智之首行化於他法門身以種智為頭即中道種智即三而一也光記三云一切智是萬行首故以為頭。",
    "X56n0931_001:0409b09_0": "【序】淳化初郡之乾符寺請開講席諸子悅隨若眾流會海繇是堂舍側陋門徒漸繁未幾遂遷於保恩院焉法華止觀金光明諸部連環講貫歲無虗日。",
    "X56n0931_001:0409b12_1": "【觧】敘遊化處所說法年代淳化即宋朝太宗年號二年辛卯歲也尊者年三十二出世住持誓辭曰予居寶雲既值鶴林始遷乾符西偏小院乾符改承天今為能仁西偏小院即今法華附庸院也悅隨者所謂道不求揚而四方盡聞眾不待召而千里自至易曰剛來而下柔動而悅隨(文)梁學士云學者悅隨如群流之會通川也(文)繇由也側謂偪仄陋謂隘陋住處狹陋學徒加多遂遷居焉未幾猶言居無幾何實錄曰淳化辛卯受請乾符寺綿歷四祀遂遷於保恩院(文)即今之延慶法華該乎玄句諸部總包諸章疏也實錄曰專務講懺常坐不臥足無外涉修謁盡遣前後講法華玄義七遍法華文句八遍摩訶止觀八遍大般涅槃經疏一遍淨名疏二遍金光明玄疏十遍觀音別行玄疏七遍觀無量壽佛經疏七遍金剛錍止觀義例止觀大意十不二門始終心要不計其數(文)連環者莊子云連環不可解也荀子曰始則終終則始若連環之無端(文)講貫者講說之道使義理貫通無礙國語云朝而受業暮而講貫(文)尊者四十餘年專務講說連屬循環未嘗一日虗棄。",
    "X56n0931_001:0409c08_0": "【序】嘗勗其徒曰吾之或出或處或默或語未始不以教觀權實之旨為服味焉為杖几焉汝無怠也大哉。",
    "X56n0931_001:0409c10_1": "【觧】尊者常以弘持教觀為己任即以自行而為化他勉勵來學勗誡也出處語默者繫辭曰君子之道或出或處或默或語(文)今借用其語以示四儀常在教觀故云未始等也教即能詮之教觀即所修之行教行二途缺一不可權謂權謀實謂真實若權實不分則昧於化意所謂為實施權等服則被身味則充口行則倚杖坐則凭几皆日用不可須臾缺也其於教觀權實未始暫忘亦猶是也解謗云予自濫講四十餘年凡釋一文申一義未嘗不以部味教觀而為憑準(文)以己所行勉勵其徒故云汝無怠也既自彰於言可得稱讚曰大哉也。",
    "X56n0931_001:0409c22_0": "【序】若夫被寂忍之衣據大慈之室循循善誘人不可得而稱矣。",
    "X56n0931_001:0409c23_1": "【觧】言其三軌匠物人莫能知然涉世弘經必須柔和忍辱運大慈悲了諸法空方能取成大利若夫發語之端衣座室三缺一不可令成文體且言其二祭文則曰開慈悲之室踞法空之床其義是同循循者語云夫子循循然善誘人尊者訓人循循有序亦如是也其化導之功莫大故云不可稱矣。",
    "X56n0931_001:0410a06_0": "【序】釋籤十不二門者今昔講流以為一難文也或多註釋各陳異端孰不自謂握靈蛇之珠揮彌天之筆豈思夫一家教觀殊不知其啟發之所。",
    "X56n0931_001:0410a08_1-0": "【觧】正明述鈔由致釋籤者玄文有疑弟子籤出荊溪釋之師資合標門師序云因籤以釋思逸功倍(文)荊溪於本迹二門之間述此十門後人錄出別行於世自昔至今講解之流皆為難曉之文葢斯文乃本迹之文心三部之綱要教觀旁正之意彼此相成之說事理二造一念三千修性離合即具隨緣本法總別揀境立陰種種大義蘊在其中文約義豐誠不易曉由謂之難解釋者眾如清師示珠指昱師註文更有他師著述故云或多諸師消文曲隨己見而不得一家正意故云各陳異端孝經序異端起而大義乖(文)",
    "X56n0931_001:0410a08_1-1": "雖所見暗短莫不自矜己能謂得佛祖之意故曰孰不等靈蛇珠者史記云楚臣隋候出行見牧童打傷蛇腦侯憐之用藥塗治而去一夜偶見庭中有光燭之乃一蛇銜珠在地自言我本龍子變形遊戲為牧童所傷賴君以救今擕珠以謝侯得之進楚王王置殿上發光如晝(文)彌天筆者梁僧傳云道安法師文理通經德望隆重時習鑿齒鋒辯天逸時往謁見既坐稱言四海習鑿齒師曰彌天釋道安時人以為名對筆者葢取三分分經符合經論故云也文意謂諸師自言所述之文除後學之疑如靈蛇珠光耀破暗契佛祖之意若安公秉筆分經合論龍子變形故曰靈蛇文選云人人自謂握靈蛇之珠家家自謂抱荊山之玉(文)",
    "X56n0931_001:0410a08_1-2": "豈思等者鈔中所破清師解今一念為真心昱師不立陰境唯觀不思議境一家教觀揀一念妄心為入理之門起觀之處若唯觀真及不思議則不知啟發之所矣。",
    "X56n0931_001:0410b12_0": "【序】公覽之再歎豈但釋文未允奈何委亂大綱山隤角崩良可悲痛。",
    "X56n0931_001:0410b13_1": "【觧】尊者披覧諸師所述失旨咨嗟不已故云再歎允當也委墜亂紊非但釋文未為允當抑且委墜紊亂大綱大綱者何即一念三千即空假中山外棄妄觀真及不思議即墜亂大綱也未允者之字訓往造謂體同改二十來字山頹者禮記檀弓曰泰山其頺乎梁木其壞乎哲人其萎乎角萠者書云百姓凜凜若崩厥角言民畏紂虐危懼不安若崩摧其角無所容頭今取二事喻解行不正委亂教門綱紀如泰山之頹邪說暴行使學者無所趣向危懼不安若畏紂之虐。",
    "X56n0931_001:0410b23_0": "【序】將欲正舉捨我而誰遂而正析斯文旁援顯據綽有餘刃兼整大途教門權實今時同昧者於茲判矣別理隨緣其類也觀道所託連代共迷者於茲見矣指要所以其立也。",
    "X56n0931_001:0410c02_1": "【觧】正明述作將欲扶顛持危正舉斯道捨我其誰哉孟子曰如欲平治天下當今之世捨我其誰哉(文)析剖也楞嚴云析出精明(文)正則剖析十門奧旨義理泠然旁則援引佛祖誠言顯據免生疑謗綽寬裕也孟子曰豈不綽綽然有餘裕哉(文)刃者庖丁解牛數千而刀若新發硎恢恢然其於遊刃必有餘地(文)言得其玅處也兼整大途謂消文合理之外復能整大途即教門權實觀道所託權實者前之兩教教證俱權圓教教證俱皆是實別教教權證實意稍難曉今時同昧即齊玄頴三師但見荊溪有圓教隨緣之說尊者深究圓別教旨以別教真如既能生法安不隨緣特立別教理隨緣之義以圓別同詮中道而但不但殊別則教權故但理實故中以理實故亦說隨緣以教權故顯非即具他宗於終頓圓三教皆明隨緣只云性起不云性具驗非圓教故尊者格量他宗所談但齊今家別教類謂流類鈔中引玅記專緣理性是別教義等觀道所託即介爾妄心一家入道不可遠求即剎那心顯三千法豈同山外棄妄觀真始因慈光恩師兼講華嚴以華嚴心造為真心自此奉先清師梵天昭師孤山圓師謬有承襲皆謂觀真故義書云葢由上人師祖已降皆謂心獨是理(文)若此之迷非始今日故云連代四明立宗則指介爾之心為事理解行之要以此正說格彼謬談故曰於茲見矣等逸堂云教門權實觀道所託所以四明得為中興教觀功在於茲。",
    "X56n0931_001:0411a05_0": "【序】至若法華止觀綱格之文隱括錯綜略無不在後之學者足以視近見遠染指知味易不云乎通天下之志定天下之業斷天下之疑實此一二萬言得矣。",
    "X56n0931_001:0411a08_1": "【觧】言二卷之書而於三部綱格之文莫不該攝綱謂綱紀如網之外圍格謂格正如物之大體隱括者荀子云抅木必將待隱括註云正曲木之具錯綜者如易三五以變錯綜其數所謂河圖洛書今是洛書之錯綜也謂戴九履一左三右七二四為肩六八為足中則有五縱橫交錯皆十五也門師輔行序云豈唯錯綜所聞將以隱括所治所治即行三多之玅運遽階所聞唯解一真之玄覽斯[泳-永+曶]今法彼文謂玄句開解止觀明行三部綱格之文所治所聞若解若行皆萃此書也視近見遠謂閱指要之近可以見三部之遠究指要之意趣如染指於鼎然後知三部之味染指者左傳云楚人獻黿於鄭靈公(穆公太子夷也)公子宋與子家將見(子公宋之字子家歸生字也)子公之食指動以示子家曰他日我如此必甞異味及入宰夫將解黿相視而笑公問之(問所笑)子家以告及食大夫黿召子公而弗與也(欲使食指無驗)子公怒染指於鼎嘗而出(文)今取染指之微知全鼎之味如覽二軸之文言達三部之義旨易不下復借易中三句通結指要述作之功可以通達今時同昧教門權實之志可以定連代共迷觀真觀妄之業引佛祖誠言證成其義斷學者之疑。",
    "X56n0931_001:0411b06_0": "【序】式忝同學也觀者無謂吾之亦有黨乎取長其理無取長其情文理明白誰能隱乎云也。",
    "X56n0931_001:0411b07_1": "【觧】敘作序之意因釋他人之疑式者懺主自斥其諱古人亦尚單稱如涅槃疏云頂滯於豫章釋籤序云普早歲在塵謂忝與四明同一師學為斯鈔序理之當然毋謂言辭虗餝情黨所及語云吾聞君子不黨疏曰相助匿非曰黨後人不必致疑特文理優長宗旨明白昭昭然若揭日月於青天使之沈沒可乎故曰誰能等。",
    "X56n0931_001:0411c06_0": "十不二門指要鈔詳解卷上本",
    "X56n0931_001:0411c08_0": "唐　荊溪尊者　釋籤",
    "X56n0931_001:0411c09_0": "宋　四明尊者　鈔",
    "X56n0931_001:0411c10_0": "宋武林沙門　可度　詳解",
    "X56n0931_001:0411c11_0": "明天台後學　正謐　分會",
    "X56n0931_001:0411c12_0": "【序】十不二門指要鈔卷上(并序)。",
    "X56n0931_001:0411c12_1": "【觧】上四字是所釋下三字是能釋上六字是別別在今題鈔字是通通於諸鈔上四字入文委釋指要二字本序自明鈔字如向卷者卷舒為義文凡二卷故以上下甄之并序者摭華鈔云疏題兼目於序故云并也葢序後不再列題目故(文)。",
    "X56n0931_001:0411c18_0": "【序】宋四明沙門知禮述。",
    "X56n0931_001:0411c18_1": "【觧】能述人號讀者避之此非臨文不諱之例。",
    "X56n0931_001:0411c20_0": "【序】十不二門本出釋籤豈須鈔解。",
    "X56n0931_001:0411c20_1": "【觧】先寄問辭徵起以明述鈔之由此文乃荊溪釋迹門十玅之後搜括十玅大意而立十門釋籤已是能釋何須作鈔解之得非能所重煩乎文心解亦曰玄義申經記釋玄義文已三矣詎假染筆以四其說(文)。",
    "X56n0931_001:0412a01_0": "【序】但斯宗講者或示或註著述云云而事理未明解行無託荊溪玅解翻隱於時天台圓宗罔益於物。",
    "X56n0931_001:0412a03_1-0": "【觧】答出山外著述之謬雖非山家正說亦稟學台教故云斯宗講者或示奉先清師示珠指也或註天台昱師註不二門二師著作撰述皆有云云之言汲黯傳云吾欲云云師古註曰猶言如此如此也史略其辭爾漢雋諸文橫註云云二字輔行云未盡之貌云者言也說文云象雲氣在天回轉之貌言之在口如雲潤物廣雅云云者有也下文尚有如雲之言(文)忠法師曰吾祖法智尊者始因錢塘奉先清師製示珠指解十不二門總在一念之文為真心別分色心為俗諦改造謂體用為造謂體同凡改二十來字天台昱師註不二門立唯觀不思議境消一念三千唯色唯心之文為真諦法智愍而救之所以指要之所由作也故序曰或示或註著述云云(文)",
    "X56n0931_001:0412a03_1-1": "孤山正義乃祥符四年作在指要後事理等者一家所明事理有乎多義今為山外迷於三法事理也圓論三法各具事理兩種三千若欲造修須揀生佛之高廣唯觀一念妄心此心當體圓具三千即理造此心能變造三千即事造如此解之名為玅解如此觀之名為玅行山外諸師乃以三法抗分事理謂心法屬理是能造生佛屬事是所造心既屬理敻指真心則初心依何開解立行故知山外三法事理未明則玅解玅行無所依託故忠法師曰清師又立心法三千為理造生佛三千為事造殊不知三法各具事理二造故指要破曰據他所釋(至)",
    "X56n0931_001:0412a03_1-2": "無差之文永失矣故序云事理未明解行無託是皆破於清公也荊溪等者荊溪玄解十玅作此十門門門結歸一念三千合修觀者易入諸師異說敻指真心翻使荊溪玅解隱沒於時矣吾祖依法華開顯玅旨建立圓頓宗乘點示諸法圓具事理三千意令物機開解立行揀境修觀即一念妄心達陰成不思議顯三千法若唯觀真但眾生在事未曾悟理是杜初心入理之門起觀之處則天台圓宗何益於物機乎。",
    "X56n0931_001:0412b12_0": "【序】爰因講次對彼釋之命為指要鈔焉葢指介爾之心為事理解行之要也。",
    "X56n0931_001:0412b13_1": "【觧】正明述作仍釋命題之義爰於也講次者因講玄籤之次對清昱二師而釋之下文有人解今一念是破清師有人不許立陰等是破昱師命此能釋之文為指要鈔介爾者輔行云弱也謂細念也(文)介爾有心三千具足圓論諸法皆具三千若欲造修須從近要的指一念為事理解行之要此心圓具三千即理之要心能變造三千即事之要文云若事若理皆以一念為總解此一念具兩種三千依解立行於一念心觀此三千文云教行皆以觀心為要特指心者萬法之本眾病之源心能具故心能造故荊溪門門結歸一念天台的論境體唯在識陰葢以此也推而廣之一大藏教無越此心故曰一期縱橫不出一念故知指要其功莫大。",
    "X56n0931_001:0412c03_0": "【序】聊備諸生溫習敢期達士批詳耶時大宋景德元年歲在甲辰正月九日序。",
    "X56n0931_001:0412c04_1": "【觧】謙己以記歲月聊備學徒溫故誦習豈敢期望明達之士批覧研詳景德乃真宗年號。",
    "X56n0931_001:0412c07_0": "【鈔】鈔曰此文題目多本不同或云法華本迹十玅不二門或無本迹二字有唯云玄文十不二門此或以所通之義所釋之文而冠於首葢不忘其本也而盡是別錄者私安取舍由情無勞苦諍。",
    "X56n0931_001:0412c10_1": "【觧】十門本出釋籤初無題目後人錄出各隨己見以立首題且示三家初是昱師次是清師第三莫知誰立雖所立異不出二義初二是所通之義第三是所釋之文所通義者十門為能通十玅為所通所釋文者籤為能釋玄為所釋不忘本者要見十門出於大本故取舍等者示珠指立題云法華十玅不二門又云有本題玅法蓮華經本迹十玅不二門或云法華本迹不二門或但稱本迹者並後人增損今所不用(文)問答決疑中廣破他人立題今鈔主暗破之諸師立題盡是私安非荊溪意取彼捨此皆由人情何勞苦興諍競廣破他人立題之不當耶尊者之意只云十不二門故云作者自立引下文釋之孤山正義云義家抄錄往往別行標立題目二三其說吾將適從今依行滿法師涅槃記指為法華玄記十不二門況滿是荊溪門人必也親聞呼召故依彼記以立總題雖違眾吾從古也(文)雖云有據恐非作者之意學者孰不知此文出自今經玄記耶。",
    "X56n0931_001:0413a05_0": "【鈔】若十不二門四字乃作者自立故文云為實施權則不二而二開權顯實則二而不二法既教部咸開成玅故此十門不二為目須據此文釋其題旨豈非四時三教所談色心乃至受潤無不隔異故皆名二今經開會實理既彰十異皆融互攝無外咸名不二。",
    "X56n0931_001:0413a10_1": "【觧】正釋題目初釋不二為實施權意在於實實本不二順權機故分隔而說故云不二而二開權顯實意在於權權既同體不動纖毫故云二而不二法既等者荊溪云若不約教則不知教玅若不約部則不知部玅(文)境等十法既約教約部判後開之則此十皆玅今此十門依十玅而立宜名不二也須據開顯玅旨而釋方異昔經之不二也豈非下正釋不二約今昔對分二與不二約教則三教為二約部則昔圓兼帶亦非不二以四時三教未證三千三諦無不差別隔異故此十法皆名二也今經開顯三千實相玅理彰明十法隔異悉皆圓融舉色則色攝於心色外無法舉心亦然乃至受潤亦爾故云互攝無外。",
    "X56n0931_001:0413a23_0": "【鈔】即以不二當體為門然亦可云十不二為能通十玅為所通問玅即不二不二即玅俱名俱體何分能通所通答今不以麤玅分能所亦不以名體分之葢以十玅法相該愽學者難入此文撮要徑顯彼意乃以略顯廣以易通難義立能通所通。",
    "X56n0931_001:0413b03_1": "【觧】次釋門字門有當體能通二義初句當體然亦下能通當體者不須更約能通所通即不二體便能通入孤山云不二即門亦此謂也法華開顯三千玅理當處虗通法法趣入以為其門故曰當體經云開方便門示真實相此方便實相各有當體能通二門疏八(二十四)云實相不二當體虗通故名為門如淨名不二門華嚴法界門等記八云無礙名虗無壅曰通故得全體成能通門(文)四明云門外無理能所泯亡(文)然亦等者十門雖皆當體然約義立亦有能通所通以門為能通玅為所通故生下問凡言能通必以能通之麤通於所通之玅今不二即玅玅即不二何分能所之殊名體言之名為能通體為所通今不二與玅俱得為名俱得為體那分能所答中不以麤玅答上初義不以名體答上次義麤玅分能所者玅玄第九就能所判麤玅為四句自有能通麤所通亦麤能通玅所通麤能通麤所通玅能通玅所通亦玅(文)又云門名能通理是所通即名體分能所也今之能所並非此二葢以玄文十玅所談法相該羅廣博學者難以造入此之十門撮其綱要徑直顯彼十玅之意乃以十門之略顯彼十玅法相之廣對上法相該博言之十門門門結歸一念修觀之易通彼十玅文文之下散漫觀心之難對上學者難入言之以此難易廣略之義立於能通所通爾。",
    "X56n0931_001:0413c04_0": "【鈔】數至十者葢從十玅而立雖立門對玅互有多少而不虧本數也此且總明待至釋文更為點示若欲標述作人者即是荊溪尊者既是後人錄出不可正斥其諱。",
    "X56n0931_001:0413c07_1": "【觧】釋十字十是數方方者法也如華嚴中凡諸法門以十為數(輔行)從十玅立者從所通玅立能通門玅既有十門亦如之雖立門對玅或門多玅少或門少玅多門之與玅彼此皆十故云不虧此且總明者今且總明釋題待至消釋別文門門之下點示不二之旨如釋色心門初云故今攝別入總特指心法明乎不二以此為門則解行易入內外門云復為顯其玅義必須內外互融隨觀一境皆能遍攝此之不二悉得稱門泛論雖爾一家觀法皆用內心玅義為門下去諸門亦皆點示或指立門對玅科或指出門名義者皆非。",
    "X56n0931_001:0413c19_0": "△釋文為三初總敘立意二從一者去列門解釋三是故十門訖文結攝重示此三即擬三分也。",
    "X56n0931_001:0413c20_1": "【觧】結攝重示者門門通入乃結十門而攝十玅重示一念三千三諦觀行易明鈔末云結文示意以十門十玅理一結文重示即示意也擬三分者三分本為分經但可比擬而已總敘立意擬序分以今正明十門先總敘玄文以立十門之意列門解釋正明十門可擬正宗結攝重示既結十門重示觀意可擬流通也荊溪科節止觀亦擬三分。",
    "X56n0931_001:0414a04_0": "△初又四初敘前文立述作之意又二初敘前又二初敘教廣二初十玅意。",
    "X56n0931_001:0414a06_0": "然此迹門談其因果及以自他使一代教門融通入玅故。",
    "X56n0931_001:0414a07_1": "【觧】科十玅意者迹門所談境等十法意開一代教門無不皆玅故也初三句十玅後二句明意然即領上之辭此即指法之語荊溪釋迹門竟搜括大意而成此書故於文初領上十玅故云然此等也迹門者迹謂足迹玄七(八)云如人依處則有行迹尋迹得處文心解云望本為名皆從喻立也如人從本處則有行來之迹故因其迹以通其本(文)門者迹中化用通至實相故稱門也十法雖廣不出因果自他因收境智行位果收三法自收能應神通說法他收感及眷屬利益也。",
    "X56n0931_001:0414a17_0": "【鈔】然者是也即領上之辭亦信解之語若不信者乃云不然此迹門等者指上玄文所談十玅境智行位因也三法果也感應兼自他神通說法是能化者作屬自也眷屬利益是所化者事屬他也故因等四收十玅盡一代教門所明法相豈過於此今於十義皆用待絕二玅而融會之令無壅礙故云融通入玄。",
    "X56n0931_001:0414a23_1": "【觧】境等為因三法屬果者葢本玄六(初)云上來四玅名為圓因三法祕藏名為圓果(文)位玅通因果今總名因者籤云位玅若立實通因果為對三法且從因說(文)因果自他四明孤山前五玅是同於後五玅四明兼自他孤山唯屬他正義云自他者攬前五玅名自行因果對後五玅名化他能所玅玄云前五約自因果具足後五約他能所具足(文)既云約他則唯屬他四明何云通自他耶(文)今謂玄文雖約自他對前後五玅既云後五約他能所具足能所即是自他下文云能化所化自他義蘊其中能化者作現通說法是果上作用所化者事所化之機天性相關則成眷屬無不蒙潤則成利益並所化邊事也十義十玅也待謂相待彼此互形曰相以他望己曰待以法華之玅形四時為麤以四時之麤形法華為玅待者前四時為所待麤法華為能待玅故云相待絕待者絕前諸麤無復形待故名為絕相待論判出前三教四時之上絕待論開復能開前令皆圓玅籤云圓中約時待絕俱玅(文)而融會之釋融字謂法法皆融令無壅礙釋通字謂法法通入。",
    "X56n0931_001:0414b19_0": "△二凡諸下眾釋意。",
    "X56n0931_001:0414b20_0": "凡諸義釋皆約四教及以五味意在開教悉入醍醐。",
    "X56n0931_001:0414b21_0": "【觧】眾釋者境有七科智明二十乃至利益各明法相意者於此諸釋皆用教味先判後開俱圓俱玅開教等者約教則開三教入圓約部則開四味入醍醐正義云開教不語入圓入醍醐不語開味影略互顯巧玅若斯(文)。",
    "X56n0931_001:0414c02_0": "【鈔】如初理境具有七科一一皆用四教揀之意開藏等俱圓復以五味判之欲開兼等皆玅即使醍醐之外更無餘味如此釋之方稱玅法智行乃至利益各明種種法相無不皆用四教五味判後開之皆成極味。",
    "X56n0931_001:0414c06_1": "【觧】理境者實相玅境為智所照從本具邊故名理境柬判也。",
    "X56n0931_001:0414c08_0": "△二觀心下敘觀略。",
    "X56n0931_001:0414c09_0": "觀心乃是教行樞機仍且略點寄在諸說或存或沒非部正意故縱有施設託事附法或辨十觀列名而已。",
    "X56n0931_001:0414c11_1": "【觧】觀即能觀玅觀心即剎那妄心稟教修行莫不由觀心顯發故喻樞機樞機者要也發也易曰言行君子之樞機樞機之發榮辱之主也樞喻教行以觀心為要機喻教行從觀心而發如云教不觀心如貧數寶行不觀心非涅槃因仍且下明玄文觀略之意觀心雖是教行之要但玄文正明五重玄義出諸教上觀且傍示止觀則委明行相故於今文但略點示有存沒者非部意故縱諸文末有明觀心但是附法託事雖位玅中略列十乘之名既非專行亦不委明故云或辨等。",
    "X56n0931_001:0414c21_0": "【鈔】樞即門之要也機謂機關有可發之義葢一切教行以皆觀心為要皆自觀心而發觀心空故一切法空即所修諸行所起諸教皆歸空也假中亦然豈不以觀心為樞機耶然今玄文未暇廣明寄諸文末略點示爾又雖據義一一合有為避繁文故有存沒如十二因緣境後則有四諦則略葢有止觀對此明乎教觀旁正如常所說託事則借彼事義立境立觀如王舍耆山等附法則攝諸法相入心成觀如四諦五行等既非專行故十乘不委此即義例約行等三種觀相也。",
    "X56n0931_001:0415a06_1-0": "【觧】上二句就譬釋樞謂門臼門若無樞則無開閉之功故云要也機謂弩牙弩若無牙則無啟發之用故機有可發之義也葢一下就法釋以觀心為要合樞要義觀心為教之要果上偏圓漸頓諸法皆我心具行者必須攝法歸心修觀故至果成稱性設化四教義問四教從何而起答依三觀起觀為行要者所修六度萬行皆因心本具故全性起修名無作行皆觀心而發合上發義由觀心故理顯出觀心故果成若非三千空假中安能成茲自在用故教行皆自觀心而發觀心空故等者一切諸法若教若行皆心本具若觀心空則所修六度萬行果上所起諸教皆歸空寂空觀既爾假中亦然說雖次第用在一心只於一心宛有三用此亦為下起教觀之張本也然今下釋仍且略點等未暇廣明者觀心雖為樞要以玄文正明開解未暇委明乘境寄者非部正意故因緣境後則有者玄二(十九)",
    "X56n0931_001:0415a06_1-1": "明觀心者一念無明即是明乃至一念之心既具十二因緣觀此因緣恒作常樂我淨之觀其心念念住秘藏中(文)四諦則略玄二(二十二)觀心可知不復記也(文)以有釋存以略釋沒非全無為沒但觀心語略其文隱沒耳或云二句並釋或存沒則不釋箋要云以略釋存沒固可知不復更出也教觀傍正者樞要云此文興致正為於觀教觀傍正須知二意一約三部所自之文二約一家傳通之旨三部所自則傍正互有如義例云如法華玄雖諸義之下皆立觀心然文本意明五重玄義出諸教上則教正觀傍託事興觀義立觀心若今止觀縱用諸教意在十法以成玅觀則觀正教傍一家傳通則唯觀為正是故三部皆以觀心而為正要乃至以從文故玄既觀傍故於十玅觀有存沒今用旨故玄亦觀正故撮十玅為此十門門門既乃即心玅玅無非是觀若談觀文言望於止觀此中極略若談宗旨望於止觀今文頗周以止觀宗旨無出三千即在一念今以三千不二點示一心心全是玅玅不出十若曉十玅止觀可知故云一期縱橫等既非下釋或辨十觀謂玄文既非專明觀行是故十乘不暇委明但列名耳然後總結指向所明託附二觀顯名所出即義例文中約行附法託事三種觀相也三種觀法初名義三種觀法義蘊經疏天台依諸大乘經立四種三昧修十乘觀法直就陰心顯三千法即從行觀義又依諸經於玄句約事相法相入心成觀託事謂心為能託依正事為所託附法謂心為能附諸法門為所附即事法兩觀之義荊溪考覈其義立三種名故義例云夫三觀者義唯三種一者從行唯於萬境觀一心萬境雖殊玅觀理等二約法相如四諦五行之文入一念心以為圓觀三託事相如王舍耆闍名從事立借事為觀以導執情如方等普賢其例可識(文)",
    "X56n0931_001:0415a06_1-2": "次用與此三種觀妙玄文句各有事法玄約四諦五行等即是附法託感應等事修觀即託事也句釋如是我聞等即附法王舍耆山即託事也以玄句消經而於事相法相文末令行者附託觀心免數他寶故缺從行止觀正明十法成乘如正修章專約一心修乎十觀前六章廣開玅解縱明事相觀心亦只助成約行觀爾若義例以三種敵對三部者乃引三部三觀顯文示其觀相也三修不問事法二觀可造修不修則乘境不備不修則立觀何為答山外一宗謂事法觀門不通修習所以玄句立觀心者有二義焉一為已修止觀者令其不忘本習故二為未修止觀者忘於封滯令知起行必依止觀故四明義書引玅玄觀心即聞即行釋籤隨聞一句攝事成理不待觀境方名修觀等文示之乃轉計云不論立陰四明引正當觀陰具如止觀第五去文又諸觀境不出五陰等文逐之又轉計云我本自問於陰揀境諸文所無不問通立陰境四明又引玅樂揀境及心玅玄由一心成觀等文為證既被四明前後窮逐義皆破壞不足評矣四明建立三種觀法皆可造修義書五云三種觀法皆為行立俱可造修若但論教義不觀己心如貧數他寶(文)",
    "X56n0931_001:0415a06_1-3": "尊者之說懸合吾祖所立觀心之意深符即聞即行立陰揀境之文然乘境不備若為修習據義書有乎四意一者咨稟口決如云豈非大師說諸玄疏多在圓頓止觀之前所談玄疏正開座下行人圓解葢兼有觀行之機欲修觀法故託於事相法相立乎觀門令其即聞即修得益者何限豈待玉泉唱後尋之方修耶或於事法觀道有壅則咨稟口決而通達之二以廣決略文云大師滅後傳持此教為師之者必須懸取止觀之意而開決之荊溪數於記中指乎止觀乃令講授之人取彼廣文決茲略觀既得決通乃於事法觀門便而修習豈須背今見講自尋止觀耶三從行度入文云若於師門先聞止觀久曾研習今覩玄疏事法觀門則用本習觀法度入事法觀門而修或因茲得悟乃名事法觀門悟入非是約行觀中得悟也四略論三觀文云又一種根性只於事法觀門修之得悟亦不待尋止觀故法華三昧只約一念妄心略論三觀乃有三品證相(文)",
    "X56n0931_001:0415a06_1-4": "已上四義並是十義書發明隨聞事相法相攝歸內心成乎理觀不待尋彼止觀專示觀境方名修觀若山外既謂事法不通修習釋彼文云隨聞一句事相法相攝歸真理便是觀心不待託陰修觀此與四明說義優劣可見矣四兼獨事法二觀皆有兼含之義如光明玄觀心三菩提云若知即空真諦菩提心度妄亂心數之眾生若真即假俗諦菩提心度沉空心數之眾生雙忘二邊即發中道第一義諦菩提心度二邊心數之眾生(文)",
    "X56n0931_001:0415a06_1-5": "菩提屬法眾生是事法中兼事故記作附法含託事釋光句以四方佛表四諦智佛即是事四諦屬法事中含法故句記作託事兼附法釋云行者應知借四方佛表四諦智此乃託事含附法也(文)且行人心無並慮何得兼含而修當知但約兼含釋義不約兼含修觀若從行一種無兼含義舊謂淨名疏釋法無眾生等諸句一一皆以生空觀歷心及餘陰入諸法而觀義書判云乃是用於約行觀門修附法觀以為附法含從行又據方等歷幡壇道具是從行兼託事今謂法無眾生之文四明謂以從行觀修附法觀觀成即附法觀成非法含從行若方等乃修三昧者傍歷幡壇等事非從行兼事也五內外事理從行通觀內外事法惟局內心如四三昧屬從行觀四行中修十乘觀正觀內心至例餘陰入歷緣對境則通觀內外十六觀經觀佛亦從行外境附法乃附四諦五行法相入心成觀託事則借事表託內心唯局內心不通外境通事理者上三三昧并諸經行法屬理縱任三性是事理觀觀陰心本具三千事觀觀變造三千舊謂事法亦通事理今不取焉六料簡問輔行標歷結託義例引歷例託其義云何答諸文凡約事相明觀皆名託事文句借城山事表對五陰正論修觀止觀以正觀心傍歷事儀表對法門修觀觀門雖異表託義同故得諸文通稱託事則標歷結託引歷例託二俱無妨請觀音疏以大林精舍明託事觀與城山同義書云大林精舍是依報色入以理智體之正同方等普賢歷尊容道具用法門體達此則方是託事之觀(文)",
    "X56n0931_001:0415a06_1-6": "大悲懺儀云二託事者觀音一身有千手眼手有提㧞之力眼有照明之用即是一千神通智慧也又云三種觀門相須而進(文)此與止觀傍歷義同皆可稱託事也問四種三昧收諸行盡且四三昧自屬從行何云收諸行盡答諸經所明行相不出四種故云收盡事法二種乃吾祖於玄句事相法相立此觀心令行人攬彼事法入心成觀不可為難。",
    "X56n0931_001:0416c17_0": "△二所明下立意又二初重示大部意。",
    "X56n0931_001:0416c18_0": "所明理境智行位法能化所化意在能詮詮中咸玅為辨詮內始末自他故具演十玅搜括一化出世大意罄無不盡。",
    "X56n0931_001:0416c20_1": "【觧】科重示大部意者向敘前文教廣觀略今欲正明述作意故重示之以為下玅解玅行之張本也意在能詮等者大部明此境等十玅是能詮名意在開顯一代教中因果自他之法無不咸玅為辨等者示須十玅所以如來出世施設一化無出自行因果化他能所故演此十則一化大意該攝無遺文心解曰不談十玅攝法不周不論一化示玅不徧(文)十玅釋題是能詮名詮於題下別文故云詮中詮內也。",
    "X56n0931_001:0417a05_0": "【鈔】更舉十玅方出其意能化即應并神通說法也所化即感及眷屬利益也此十乃是一代教中能詮名字大部明此意在開顯諸名咸玅故也須辨十者欲收始末自他盡故始謂境等即自行之因末謂三法即自行之果自他如前若辨此十一一咸玅則了如來出世意盡。",
    "X56n0931_001:0417a10_1": "【觧】釋重示科初二句總標次釋能化所化即後五玅前五玅文顯不釋此十下明大部明此意開諸名皆玅謂一代能詮無超此十玅玄釋法華開顯之意開前四時所談十麤皆成十玅此十若玅則一代能詮諸名無不成玅也須辨下釋為辨詮內等出須十玅意始末即因果也自他即後五玅故指如前。",
    "X56n0931_001:0417a17_0": "△二故不下正明今述意二初為成玅解。",
    "X56n0931_001:0417a18_0": "故不可不了十玅大綱。",
    "X56n0931_001:0417a18_1": "【觧】不可不了即誡勸之辭玄文十玅科目繁夥猶如網目舉其大綱則網目可尋大綱即三千也若欲立行造修先須解了三千三諦之法體此之法體是如來當時一番修證自他因果之法今欲修證此從因至果之法先須解了依此玅解方可立行。",
    "X56n0931_001:0417a24_0": "【鈔】欲知此十皆玅須了開顯大綱即三千世間俱空假中是今經之大體能開之絕玅境即此故事理俱融智發此故無緣行起此故無作位歷此故相攝三法究盡此故果滿生具此故一念能感佛得此故無謀而應神通用此故化化無窮說法據此故施開自在眷屬全此故天性相關利益稱此故無一不成佛今此十門正示於此若能知者名發玅解。",
    "X56n0931_001:0417b07_1-0": "【觧】釋為成玅解初總明三千玅解境即下別示十玅所依今此下結顯十門所示三千世間俱空假中者世是隔別十種五陰十種假名十種依報隔別不同故名世間是間差三千種世間差別不相謬亂故名為間以三千法皆因緣生是故一一即空假中今經大體者法華三周開顯並以三千為體輔行云十玅是今經權實正體亦大車體亦寶所體(文)能開等者玅樂云若不先了能開之玅將何以為所開之麤(文)",
    "X56n0931_001:0417b07_1-1": "境即等者此字即指三千大綱七科諦境不出三千理本圓融事寧隔異理即性具事即變造具變不二故曰俱隔色心門從境玅立故荊溪名事理不二門也智發等者以智緣境智為能緣境為所緣以境發智境為能發智為所發三千玅智既全境而發境智一如緣即無緣行起等者進趣名行即修治造作全性德三千起修德妙行以性奪修修德無功故稱無作位歷等者位位皆具三千故一一位具攝諸位功德初阿字門具四十二字後茶亦爾故云相攝三法等者玅乘三軌真性遍周觀照圓導資成助發唯佛究盡故稱果滿生具等者生雖在迷理體本具眾生由理具三千故能感佛得等者諸佛由三千果滿故能應所謂任運真化不須謀作如月不下降水不上升水月一際感應道交神通等者神名天心通名慧性與六法相應用此三千任運化物化復作化化化無窮說法等者五時說法憑據此三千施則稱性被機分隔而說開則稱理示玅無不圓融眷屬等者前機受道即成眷屬既全三千故得父子天性自然相關利益等者十種利益稱三千故七方便人來至今經咸成佛道如三艸二木皆一地所生一雨所潤也今此十門正示此十玅大綱以十法皆即三千三諦故皆稱玅能知此者名發玅解為此義故十門所由作也若能知者名發玅解是發明荊溪開發玅解故述此十門不離一念令修觀者易入序云荊溪玅解葢謂此也。",
    "X56n0931_001:0417c18_0": "△二故撮下為成玅行。",
    "X56n0931_001:0417c19_0": "故撮十玅為觀法大體。",
    "X56n0931_001:0417c19_1-0": "【觧】撮攬也攬此十玅三千之法為今止觀之大體而修玅行述作意荊溪於迹本二門之間立此十門有何深意孤山正義云葢荊溪大師攬玄文教義入止觀行心俾夫名字行人識法相之有歸達造修之無滯也又云悟理之要必在十乘故荊溪恐後昆昧旨乃於釋籤更立十門結束十玅咸歸止觀一念三千不思議境方顯教不虗設悟理有從荊溪述作意在斯焉又云以彼觀門收此教義以此義教識彼觀門若欲造修須依彼部勿謂此文便堪修行(文)",
    "X56n0931_001:0417c19_1-1": "既云攝教歸行唯以玄觀教理相對義歸一邊反顯事法不通修習乃見十門虗設難可信從淨覺文心解云述作之意不逾二焉一為攝教成觀即前云故撮十門為觀法大體二為示略知廣即後文云使一部經旨皎在目前然其後意亦成前意(文)初云攝教成觀無妨之說次云示略知廣以十門為略經文為廣況以後意成前致使二義皆未明述作之意法智科此文云為成玅解玅行且玄文十玅大師縱辨宣揚釋經題旨豈非玅解文文之下立觀心釋豈非玅行又何假荊溪重述十門方成玅解行耶須知玄文十玅法相該愽學者難以造入荊溪攬彼十玅攝作十門門門結歸一念三千以此三千是十玅之大綱觀法之大體乃以略顯廣以易通難正為成於玅解玅行如此明之深得荊溪述作之意矣觀法攝屬問荊溪述此十門以三種觀法言之屬何一種若云從行則部旨有妨葢玅玄唯明事法籤解玄文豈是從行反顯事法不通修習過同山外若云託事附法且十門不約四諦五行法相及王城耆山事相明觀何名事法答須知的屬事法二觀所攝葢由玅玄廣解十玅文文之下立觀心釋或於四諦五行文末附彼法相以明觀心或託感應神通事相以明觀心故今文云縱有施設託事附法然玄文正意生解義強觀且傍示乘境不備難以造修若大師在日說玄疏時座下有觀行之機咨稟口決而修習之得益者何限大師滅後為人師者必須三部通達諳練學者欲修事法之觀懸取止觀十乘十境而開決之荊溪懸鑒末代神根既鈍何能諳練止觀乘境之相故於迹本二門之間述此十門門門結歸一念三千為觀法之大體稟學之徒覩事法觀心之文若欲造修不待遠尋止觀乘境即觀一念具足三千三諦便能通入所謂以略顯廣以易通難即此義也故鈔云玄文雖立觀心而且託事附法葢非部意故多缺略若具論能成之功須指摩訶止觀也又云此文乃行正解傍與止觀同成觀體以由十門門門皆顯三千即是摩訶止觀十乘觀法之大體若論能成雖是止觀從行須知正為成就玄文事法觀門觀成則事法觀成非從行觀成也是知十門即玄文總觀心文耳能成既是從行不妨通於內外二境所成正是事法不與部旨相違或據攬彼無邊法相攝作十門作附法觀收攝須知玄文本通事法二觀不可迷荊谿義例以三種敵對三部便謂玄文只屬附法且十玅法相無邊行人心無並慮安可俱時而修豈可見攬十玅法相遽作此判。",
    "X56n0931_001:0418c02_0": "【鈔】言觀法者十乘也應知止觀十乘是別論行相而一一乘不離三千即空假中故云觀法大體義例云散引諸文該乎一代文體正意唯歸二經一依法華本迹顯實二依涅槃扶律顯常以此二經同醍醐故是知用此十玅絕待之義為觀體者方譬日光不與暗共又此三千法門徧於諸法若色若心依之與正眾生諸佛剎剎塵塵無不具足故華嚴云如心佛亦爾如佛眾生然心佛及眾生是三無差別故今家釋經題法字約此三法各具三千互具互融方名玅法然雖諸法彼彼各具若為觀體必須的指心法三千故玄文云佛法太高眾生法太廣於初心為難心佛及眾生是三無差別觀心則易又義例云修觀次第必先內心今家凡曰觀心皆此意也故今文中撮乎十玅入一念心十門示者為成觀體故也若不爾者何故節節唯約心說豈塵剎生佛而不具邪若不見此全失今文述作之意也。",
    "X56n0931_001:0418c18_1-0": "【觧】釋為成玅行初明絕待三千為觀體十乘觀法是所修行相三千三諦即十乘之大體別行玄記云止觀十乘是觀別相三千空假中是觀總體(文)別相雖有十乘論其大體只一三千如云觀法非十對根有殊雖復根殊但以不思議觀觀不思議境(文)十玅既以三千為大綱故撮開顯大綱為觀法大體大綱大體法喻異耳此且正示次引文證本迹顯實者迹門顯圓成之實本門顯久成之實文句分經云前十四品迹門開權顯實後十四品本門開權顯實義例云所以始末皆依法華此即法華三昧之玅行也次用涅槃者雖依法華咸歸一實末代根鈍若無扶助正行傾覆正助相添方能遠運(文)",
    "X56n0931_001:0418c18_1-1": "設三種權扶一圓實名扶律顯常金錍云指的玅境出自法華此因野客問玅境所憑故大部談圓極處無非三千玅境所出獨在法華今文通約一部言之前六章廣開玅解通乎大小偏圓論其正意歸於二經由本迹顯實談常顯性是同同一味故結顯云是知用十玅為觀體等不與暗共者既指開顯十妙三千而為觀體方可喻如日光赫奕不與暗共在昔諸經大小並陳權實各立其猶燈炬星月與暗共住來至今經指權即實佛慧圓明法界洞朗其猶日輪當午無處不南玅玄云燈炬星月與暗共住譬諸經存二乘道果與小並立日能破暗故法華破化城除草菴故(文)",
    "X56n0931_001:0418c18_1-2": "又此下明三千周遍示唯心體具初明諸法圓具又者更端之辭徧於諸法此句總標色心是已色陰及四陰心依正者色心是正國土屬依生佛即十界正報剎塵即生佛依報即心佛眾生皆具三千引華嚴如來林菩薩說偈為證彼文先明心造一切次以心例佛以佛例生明三無差今家釋心造有事有理則三法各具兩種三千方無差別義書云以我一念之心及一切眾生十方諸佛人人說於理具各各論於事造而皆互具互攝方名三無差別(文)",
    "X56n0931_001:0418c18_1-3": "今家等者玅玄三釋法字約心佛眾生三法一釋眾生法云一法界具九法界則有百法界千如是等(次約佛法心法釋云云)今云三千廣略異爾各具互具者隨境示具曰各具體本同曰互然雖下明觀體唯心諸法體同故彼彼圓具今欲修觀須揀難從易的指自心故引二文為證佛法等者義書云是則諸佛亦有心眾生亦有心若隨淨緣熏起作佛界之心則高遠難觀若隨染緣熏起作九界心則廣散難觀故輒取一分染緣熏起只今剎那陰識之心依之顯性也(文)",
    "X56n0931_001:0418c18_1-4": "義例云者心境釋疑例問諸文皆云色心不二若欲觀察如何立觀答色心一體無前無後修觀次第必先內心(文)今家諸部凡明觀心皆揀難從易之意故今下的示今立意今之十門撮彼十玅入一念心束作十門而示者為成觀法大體故也撮前五玅成今四門為十乘觀體撮後五玅成今六門為起教觀體並以心法三千為門不然何故十門節節云一念或心性剎那等耶豈可見多明心具不了揀難從易之意便謂塵等不具乎諸法圓具如向所陳孤山唯談心具不許色具故寄此斥之今為成玅行故撮十玅大綱一念三千成乎觀體不見此意全失荊溪述作之意也。",
    "X56n0931_001:0419c01_0": "△二若解下例後義彰法理無殊二初例本玅。",
    "X56n0931_001:0419c02_0": "若解迹玅本玅非遙應知但是離合異耳因果義一自他何殊故下文云本迹雖殊不思議一。",
    "X56n0931_001:0419c03_1": "【觧】科語謂以前迹玅例後本玅又以釋名例下四章彰本迹十玅名等五章自他因果之法三千玅理無殊初例本玅迹本俱談十玅但有離合之異自行因果既一化他能所豈殊故引玄文為證此二句本肇師九轍中語彼第六本迹無生轍云多寶為本釋迦為迹本既不滅迹豈有生本迹雖殊不思議一(文)今家雖用其語義則永異以約久遠成佛為本中間施化今日五時近成為迹本迹久近雖殊三千三諦不思議一也。",
    "X56n0931_001:0419c13_0": "【鈔】若本若迹各論十玅而不同者但是互有離合故也迹因具明境智行位四者離因故迹果惟明三法一玅者合果故本中不云境等唯明一本因玅者合因故本果之外更立本國土本涅槃本壽命者離果故故知唯云因玅必具境等唯云三法必具國土等若知因果不殊自他豈應有異以本初坐道場時亦徧赴物豈不現通說法豈無眷屬獲益邪應知久近雖異皆以三千俱空假中而為大綱故云不思議一。",
    "X56n0931_001:0419c21_1-0": "【觧】若本下釋初三句若知下因果義一自他何殊應知下釋後二句離合異者迹中因開而果合合習果報果為三法玅也習果既證三法必有壽命國土但合為一三法玅耳本中因合而果開開習果出報果明本國土玅也葢由涅槃壽命國土是稱實感報故於習果開出涅槃壽命國土之報果亦是開正報出依報也又因果有傍正玄九云迹門破廢方便開顯真實佛之知見明弟子實因實果亦明師門權因權果為成弟子實因實果因正果傍本門廢方便之近壽明長遠之實果亦明弟子實因實果亦明師門權因權果要顯師之實果果正因傍(文)",
    "X56n0931_001:0419c21_1-1": "良以迹中正為物機開顯得入真因故因為正本中正開長遠壽量故果為正正則離而詳說傍則略而合明因果既有傍正所以文有廣狹義有可否文廣狹者唯佛與佛乃能究盡諸法實相境玅也唯我知是相十方佛亦然智玅也本從無數佛具足行諸道行玅也天雨四華位玅也此因文廣也佛自住大乘果文狹也本門經曰我本行菩薩道時所成壽命今猶未盡因文狹也我成佛來久遠若斯果玅也自從是來我常在此婆婆世界國土玅也然今非實滅度而便唱言當取滅度涅槃玅也處處自說年紀大小壽命玅也此果文廣也義有可不者機土淨不淨化事成未成故於習報開不開也由本佛是淨土淨機故不說涅槃即於法華唱滅有涅槃玅既有涅槃必論壽命長短故有壽命有正必有依故有國土又往事已成開出涅槃等迹中無此但一果證三法而已由此諸義故本迹十玅互有離合也(玅玄本門文意)",
    "X56n0931_001:0419c21_1-2": "。",
    "X56n0931_001:0420b02_0": "△二況體下例四章。",
    "X56n0931_001:0420b03_0": "況體宗用秪是自他因果法故況復教相秪是分別前之四章使前四章與諸文永異。",
    "X56n0931_001:0420b04_1": "【觧】上以迹例本總是釋名今以釋名例下四章亦不外此故云秪是教相只是區別麤玅永異諸經也自他因果與因果自他不同前以因果自他收攝十玅今欲自他各論十玅機應皆能化物故鈔云必合從因至果等故自他各有體等則自他在前也。",
    "X56n0931_001:0420b10_0": "【鈔】如上所明二十重玅皆是釋名而含體等以釋名是總三章是別總總別故且十玅中境即是體智行位法是宗應等三玅是用感及眷屬既獲利益必合從因至果還起利他之用亦具體等故云秪是自他因果法故又名等四章皆是被下之法即屬教也而須以相別其麤玅今之四章出前三教四時之上復能開前今皆圓玅故永異之言含其待絕以唯今經能徧開故。",
    "X56n0931_001:0420b17_1-0": "【觧】初釋例三章又名下釋例教相初如上下示名含三章且十下釋自因果感及去釋他因果釋名含體等者名謂名言一部言句皆能詮名體宗用三皆遍始終但題目是總經文是別攬別為總就題釋名故釋名章能總含三章之別如法華本迹十玅以名其名具含體等即今文云境即是體等境是理境因果所依故屬體智行位三是因三法是果因果屬宗應及神通說法是果上之用依體起宗宗成有用也籤云境是體是法身智行是宗是用乃境智行三住前三法對體宗用即一性二修規矩今文以名例於體等名既不出十玅故以十玅分對體等也名等等者鈔主釋意前四章為教第五章為相常逾名是能詮體等是所詮今文體等例屬於教者纔涉言詮即屬教也玅宗云上之四章皆是言教謂詮名詮體詮宗詮用之教玅樂云通論聖言被下俱名為教(文)",
    "X56n0931_001:0420b17_1-1": "並約能詮為言玅宗云五重玄義本是經中所詮觀法(文)此約所詮為語此四皆是聖人被下之法故皆屬教須以大小偏圓之相揀別麤玅今經四章相待論判則出前三教四時之上絕待論開則開前諸麤令皆圓玅以唯下釋絕待永異相待則待麤論玅永異可見絕待則無非一玅何言永異故釋云唯獨今經遍開一切則前部所無豈非永異又凡言教相有教即是相有教家之相玄十云教即是相非謂無相(文)",
    "X56n0931_001:0420b17_1-2": "於前四章俱論簡判名教即是相玅樂云教家之相故云教相(文)謂前四章為教第五章為相即前四章教家之相也。",
    "X56n0931_001:0420c21_0": "△三若曉下別示玅體令解行俱成三初指玅歸心。",
    "X56n0931_001:0420c23_0": "若曉斯旨則教有所歸一期縱橫不出一心三千世間即空假中理境乃至利益咸爾。",
    "X56n0931_001:0420c24_1": "【觧】科別示等者上科敘前例後名等四章玄文該遍今乃離文別示三千玅體入一念心令玅解行俱得成就初指玅歸心若曉三千三諦十玅大綱之旨則一代教法有歸趣矣以一代教法不離三千三千不逾一念故云一期等籤一云始自寂場終乎鶴樹故云一期五味為縱四教為橫如來五時化物四教逗機所說法門雖即無量不出一念三千三諦理境等者上雖攝法歸心言猶通總故今歷玅別示始自理境終至利益無出一念三千故云咸爾也。",
    "X56n0931_001:0421a10_0": "【鈔】三千玅體為教所歸故一期之內五味傳傳相生故縱四教各各趣理故橫而所詮法雖有顯覆準今經意未甞暫離三千玅法又雖諸法皆具三千今為易成玅解玅觀故的指一念即三法玅中特取心法也。",
    "X56n0931_001:0421a14_1": "【觧】釋指玅歸心今初正釋三千玅體等者一代時教宗歸法華法華開顯三千實相是諸法之大旨眾流之歸趣也傳音轉驛遞之義約部則五味次第相生從淺至深為縱約教則藏通趣真別圓趣中為橫所詮即境等十法雖有昔日之覆法華之顯若準今經開權顯實正意則無非三千玅法以前四時十法之麤皆從三千玅理施出故也又雖等者上雖通以諸法各具三千為所歸今之文意為成觀故的指心法即揀難從易心佛眾生三法中揀生佛之高廣特取心法近而復要易成玅觀故也。",
    "X56n0931_001:0421b01_0": "【鈔】應知心法就迷就事而辨故釋籤云眾生法一往通因果二往唯局因佛法定在果心法定在因若約迷悟分之佛唯屬悟二皆在迷復就迷中眾生屬他通一切故心法屬己別指自心故四念處節節皆云觀一念無明心止觀初觀陰入心九境亦約事中明心故云煩惱心病心乃至禪見心等及隨自意中四運心等豈非就迷就事辨所觀心。",
    "X56n0931_001:0421b08_0-0": "【觧】此句定心法屬於迷事為下觀真立陰破立之張本應知之言辭含誡斥應知此心乃約迷約事以辨非從悟從理以論即引三文為證初觀陰心證心是迷下之九境四運心等證心是事玄二(初)云若廣眾生法一往通論諸因果及一切法若廣佛法此則據果若廣心法此則據因籤二(二十)釋云然眾生義通故云通論義非究竟故云一往一往雖通二往則局不通於佛及唯在因(文)",
    "X56n0931_001:0421b08_0-1": "此文鈔中三番引用初定心法在迷二斥山外違文三釋因果二字雖三番引各有所主非繁重也玄籤但約因果通局以論三法四明復約迷悟自他柬判者以因果名義然有收揀以六即言之九界屬迷皆名理即名字已去並名佛界此收無不盡也下文云因從博地至等覺還果唯玅覺此揀無所遺也則因果分之九界為因佛界無果其如佛界言猶通漫名字以去並名佛界故須復約迷悟甄分佛唯屬悟的取圓教玅覺為果等覺已還並屬九界三道以無明未盡故也心生雖皆在迷心法乃別指自己剎那妄念以心對生九界皆名眾生並屬於他又復應知玄籤約教且約因果今文明觀更約自他下文云生雖在因復通一切唯取心因是今觀體(文)",
    "X56n0931_001:0421b08_0-2": "故知四明約因果迷悟自他揀判方見三法體相不濫矣四念處等者彼文四(九)云此之觀慧只觀眾生一念無明之心即是法性又云觀無明心畢竟無所有而能出十界諸陰又云今觀此無明心從何而生等(文)止觀初觀陰者正修章初觀陰境用十乘觀法下之九境亦是約事第四三昧隨自意中觀起心推四運亦是事也豈非下結指上所引文皆是迷事三法通局玄籤之文如前所引今問玄文云一往通論諸因果諸者不一之辭似約界界各論因果四明那約迷悟九一分耶答諸字訓於即語助也下文云一往通於因果是也舊謂界界各論因果者非問十界因果攝法周足何得又云及一切法答拾遺記云一切法者即是假人實法及以依報各有性相體力作因緣本末究竟等法也是知上云因果通言十界今云一切法即十界中各具十如是法界界互具乃成千如矣舊謂九界中善惡等法義恐不然問籤云一往雖通二往則局不通於佛及唯在因(文)",
    "X56n0931_001:0421b08_0-3": "既云不通於佛又云及唯在因何繁重乎又及字對何處下答此二句釋上二往局義以眾生法二往言之正在於因不通佛界唯在九界故云不通於佛既不通於果佛及唯在九界之因故云及也問眾生法須約一往通論有何所以答玄文廣明千如玅旨正約眾生法說之一往通論十界皆名眾生則千如義備也。",
    "X56n0931_001:0422a06_0": "【鈔】有人解今一念云是真性恐未稱文旨何者若論真性諸法皆是何獨一念又諸文多云觀於己心豈可真理有於己他更有人全不許立陰界入等為所觀境唯云不思議境此之二師灼然違教。",
    "X56n0931_001:0422a10_0-0": "【觧】敘破清昱二師觀真棄陰初云是真性是清師次不許立陰天台昱師也忠法師云如序中引示珠指解今一念以帝網珠喻乃至云我之一念亦復如是能如是觀一切諸法唯心無性名真性空等(文)今且從容不迫略斥之日恐未稱不二門之文旨何者下徵釋且摩下示止觀前六章廣開玅解明一切諸法無非真性何獨一念今之一念為成玅觀須就迷就事而辨若敻指真心初心如何造趣諸文觀己心者如籤云己心生佛別行玄云他者謂眾生佛自者即心而具(文)",
    "X56n0931_001:0422a10_0-1": "若論真性生佛平等無間己他更有人者忠法師云昱師唯觀不思議境消一念三千(文)若據註文本無此語但云介爾起心三千性相即非縱橫並別之旨故云總在一念(文)既云三千性相非縱橫並別豈非不思議境故四明約義引而破之此之下總斥二師灼然違背一家教文觀真妄問一家圓觀觀一念心為真為妄若云觀真止觀揀境修觀唯觀識陰若云觀妄止觀何云繫緣法界玅樂何云但觀理是等耶答示珠指謂心唯是理如云一念即一性也一念靈知等又云心即生佛之心非離生佛外別有心為生佛之本(文)",
    "X56n0931_001:0422a10_0-2": "謂心是非迷非悟之真心究其弊源始因慈光恩師兼講華嚴見清涼大疏以心法是理為能造生佛是事為所造既不深本教濫用他宗故定一念屬真清昭諸師謬有承襲咸謂觀真須知克論此心真妄同源眾生無始在迷未甞離念約修門說必須達妄即真若敻指真心則杜初心入理之門起觀之處凡論諸法皆是真性自是開解奈何山外境觀不明將解為觀慈雲所謂不知啟發之所四明定所觀境的屬妄心只由凡夫眾生迷真逐妄見前一念全體是陰欲令返本還源故須從近從要令達妄以顯真方是佛祖為人之意若敻指真心真心已是顯悟何須修觀耶然雖定境屬妄畢竟圓頓行者正用觀時觀一切法為真為妄當知直觀此一念妄心當體具足三千諸法皆不思議所謂造境即中無不真實止菴曰直觀一念心體是三千譬如見冰不問融與不融直作水會先達云山外觀真即同觀妄四明觀妄即同觀真斯言得矣梵天昭師孤山圓師本承襲清師之說孤山見四明立義定境屬妄遂轉計云昔人觀真今人觀妄鷸蚌相扼我乘其弊達六識之妄心顯三諦之玅理(文)",
    "X56n0931_001:0422a10_0-3": "昭師因被四明往復徵詰巧作救義云觀六識之妄心成三諦之真心(文)義書云予聞此救喜躍不勝葢予義論有益能轉人心改迷從悟也上人因誰得解若謂奉先座下得聞且示珠全不約妄釋心亦無觀妄成真之說(文)是知觀妄成真出自四明如云乃依此心觀不思議顯三千法又云以依陰心顯玅理故孤山何得竊取以為己說却乃妄破直云觀妄耶昭師縱能轉計巧救為觀妄顯真但有其言全迷其義也立陰止觀第五(初)",
    "X56n0931_001:0422a10_0-4": "正修章列所觀十境陰乃居初文云此十境通能覆障陰在初者一現前二依經大品云聲聞依四念處行道菩薩初觀色乃至一切種智章章皆爾故不違經又行人受身雖不陰入重擔現前是故初觀輔行云今家用此十法為境不同常途別立清淨真如無生無漏(文)據此則圓頓行者陰境現前恒得為觀何須言立葢由山外不立陰等為境直觀不思議境今對彼不立故云立耳問圓頓行人必須觀陰釋籤何云陰等十境唯在三教答若論陰體所屬在前三教如止觀五(二)",
    "X56n0931_001:0422a10_0-5": "云此十種境始自凡夫正報終至聖人方便陰入一境常自現前(方便即別教道)則別教教道已還三教九界背性成迷無非三障四魔皆屬陰境所攝圓人了知無非性具法門荊溪據陰體而判故云惟在三教圓人既了此陰無非法界即此便是圓人所觀之境故連文云今是圓人所觀境界(文)葢前輩有讀文不盡之過但以陰境在三教為難殊不知今是圓人所觀境也。",
    "X56n0931_001:0423a05_0": "【鈔】且摩訶止觀先於六章廣示玅解豈不論諸法本真皆不思議然欲立行造修須揀入理之門起觀之處故於三科揀却界入復於五陰又除前四的取識陰輔行又揀能招報心及以發得屬於下境此是去丈就尺去尺就寸如灸得穴也乃依此心觀不思議顯三千法乃至貪嗔等心及諸根塵皆云觀陰入界及下九境文中揀判毫末不差豈是直云真性及不思議。",
    "X56n0931_001:0423a12_1-0": "【觧】引止觀依解立行揀境修觀皆觀陰妄結斥觀真不立陰境之非初明前六章開解然欲下明第七正修至觀陰入界總是初境及下去明下之九境豈是下結斥前六章開解者止觀五(初)云前六重依修多羅以開玅解今依玅解以立玅行(文)輔行問五略中有行有解有因有果何故但云六重是解答言大意者冠於行解自他因果意既難顯還作行解因果等釋非謂已有行果等也若論文意但屬於解於屬解中恐解不周故須委明名體及攝法等方便望五稍似行始若望正觀全未論行亦歷二十五法約事生解方乃堪為正修方便是故前六並屬於解(文)",
    "X56n0931_001:0423a12_1-1": "然欲等者既能解了法法本真皆不思議若欲起行造修入此真理須得其門欲觀此不思議境須知起觀之處所以吾祖於正修章中廣明十境十乘行相三科揀卻界入者止觀云依毗婆沙明三科開合若迷心開心為四陰色為一陰若迷色開色為十入及一入少分心為意入及法入少分若俱迷者開為十八界也十界少分屬色七界少分屬心以此法界中亦有四類法故言二少分者以法入中有四類法謂無表色心所法不相應行三無為則無表色屬色心所法屬心不相應行非色非心三無為非三聚攝(文)",
    "X56n0931_001:0423a12_1-2": "次克示境體云若欲觀察須伐其根如灸病得穴今當去丈就尺去尺就寸但觀識陰識陰者心是也(文)輔行云從廣之狹正示境體陰入界三並可為境寬漫難示故促的指略二就陰如去丈就尺略四從識如去尺就寸以由界入所攝寬多陰唯有為有為之中義兼心色故置色存心心名復含心及心所今且觀王置於心所故初觀識餘下例之(文)輔行又揀等者彼云於第六中取能招報者仍須發得屬煩惱境餘之分別方是今境(文)",
    "X56n0931_001:0423a12_1-3": "彼云取取去也今文云揀其義是同能招報心有二一見行二發得並須揀去故四明用及以二字代彼仍須文義易曉發得能招報屬下煩惱境中見行能招報乃受想行三心雖五陰中揀去界入中未分王數故須此揀在後文例餘陰入中觀乃依等者正指所揀克示境體總無明心也貪嗔等心即歷餘一心如破遍文後云歷餘一心三觀者若總無明心未必是宜更歷餘心或欲心嗔心慢心此等心起即空即假即中還如總中所說(文)",
    "X56n0931_001:0423a12_1-4": "輔行云今此但觀欲等心王(文)及根塵者破法遍文末例餘陰入及十乘文後歷緣對境故云皆也止觀云前來所說但觀識陰作如此說餘四陰亦如是十二入十八界亦如是輔行云此文應在第七卷末十乘文後何故於此即例餘耶答以義便故從初至此單約識心從此已去乃至離愛具約五陰方成行相故須於此例餘陰入輔行云欲融諸法示觀境遍(文)歷緣對境者止觀云端坐觀陰入如上說歷緣對境觀陰界者緣謂六作境謂六塵(文)",
    "X56n0931_001:0423a12_1-5": "更有淨心歷法以示玅境在第五卷不思議境說教大體科後及下九境謂煩惱病患業相魔事禪定諸見現文六境也兼上慢二乘菩薩三境託緣不說前開章明於十境今亦通言文中揀別分判如云煩惱心病心等皆屬迷妄之事毫釐無有差忒也揀境止觀正修章先示三科色心為境次克示境體揀去界入及前四陰唯觀識陰文云若欲觀察須伐其根等并輔行釋並如前引但南屏已來謂識中有善惡無記三性為通觀三性別觀無記若別觀無記止觀不揀善惡總觀識陰若通觀三性輔行何云在無記故竹菴艸錄釋出此義云摩訶止觀所立觀境通陰界入初心通漫難可用觀的揀見前無始日用能造諸法識陰心王為所觀境若乃善惡無記三心屬所起心相非能造識體非所揀境歷緣對境隨自意三昧方能觀境荊溪云在無記故通約五陰色心屬報陰法對下所發煩惱九境非善即惡以分三心本自分明初無難見(文)",
    "X56n0931_001:0423a12_1-6": "但輔行料揀自來謂文無生起止觀揀境已自分明荊溪何故孤然立問況五識五意識乃是界入中法相大師既揀荊溪又却取來為問至答文中又云定是今境豈非師資相違止菴約二義斷之曰界入無歸識名通濫由止觀揀去界入諸識唯取第六識心荊溪謂五識五意識既皆揀去在何處得為觀境又五識五意識通名為識何等識心是今觀境正對止觀設問初不相違今但直消輔行料揀之文則揀境之義從而可了問五識五意識及第六識並能生於受等三心何等識心及所生三心是今觀境初且定能生所生何等下徵問此據上文引有宗所計以下界入二科對今五陰揀示境體識心而問上文既云今初且觀諸識為境又云若以識界而為觀初何往不得但識名多故陰在初故又名略故是故先用(文)",
    "X56n0931_001:0423a12_1-7": "其義已明恐人迷故復設此問意謂三科既但開合之異若略二就陰十八界眼等五識及五意識及界入中第六識心十二入中雖無識名意根即第六識以前念為根後念為識也此等識心及所生三心是今所觀陰境否答五識五意識定是今境未屬煩惱在無記故先答界中五識等也五意識者即第六識與眼等五識同時取境名五意識亦名同時意識約用中相背故分五種既是報陰無記未屬所起煩惱心也判屬今陰境所觀在下當明於第六中取能招報者今文云輔行又揀能招報心彼文云取取去也此答第六識先答所生三心也能招報即受想行受想煩惱潤於行業遷流造作即能招報此有二種一者見行二者發得屬下煩惱境第八記云自此已下現文六境及略三境咸是發得此九境外所起煩惱乃至四弘但屬受等三陰所攝是故尋常非無煩惱乃至發心亦並通觀非不名境(文)",
    "X56n0931_001:0423a12_1-8": "雖在五陰中已揀三心由界入中未分王數故須此揀然此現起能招報心輔行既云非不名境亦並須觀今既揀去就何處觀須知例餘陰入中觀仍須發得屬下煩惱境今文云及心發得屬於下境現行能招報心如上已揀仍須更揀發得能招報心亦當揀去自屬下煩惱境中所觀然輔行的指煩惱一境今通云下境者以煩惱所起之心既是發得下諸境中所起之相亦不出此故也不答五識五意識中三心者以起惑造業皆第六識王數共造五識五意識但為助耳既揀第六餘五可知餘之分別方是今境謂第六中有乎三種除彼二種能招報者對境所有能分別者名之為餘故云方是又此五識五意識雖是今境仍在下文歷緣對境中明覆疎初答文止觀第七十乘文末歷六作緣對六塵境修觀然語不頓疎說非行時前判定在今所觀境乃是修觀行者歷經行等緣對色香等境以正觀心攬彼緣境攝入一心總為觀境玅觀觀之令成玅境故止觀云若不於行中習觀云何速與道理相應又云懷道之賢觸處用觀(文)",
    "X56n0931_001:0423a12_1-9": "行緣既爾餘之緣境用觀亦然(己丁並依桐洲註釋)五識五意識第六識相狀智湧云今且約於眼根見煙以示其義由勝義根引生眼識見於前塵分別是煙屬現量境既見其煙比知有火即眼意識屬比量境境謝緣念即存屬第六識緣法塵中落謝色塵竹菴云剎那有初後境界有現比並能生三心之相鑑堂約親疎說今謂只是空有二宗宗計不同荊溪挾有宗立難不必苦求相狀也。",
    "X56n0931_001:0424c17_0": "【鈔】問常坐中云以法界對法界起法界安心中云但信法性不信其諸及節節云不思議境今何不許答此等諸文皆是能觀觀法復是所顯法門豈不讀輔行中分科之文先重明境即去尺就寸文也次明修觀即觀不思議境等十乘文也況輔行委示二境之相非不分明豈得直以一念名真理及不思議耶。",
    "X56n0931_001:0424c23_1": "【觧】料簡法界法性不思議等第二卷常坐中但云一念法界繫緣法界今是第一卷弘誓中文云佛法界對法界起法界輔行釋云佛法界根也對法界塵也起法界識也仍本迷說故云根等得名法界更無差別(文)義例作弘誓文引二文俱有法界之言約義引之安心中者止觀云惟取此心但是法性起是法性起滅是法性滅(文)今是發大心科六即顯是中文義例亦云安心者二文皆云法性文意相似約義引也二文法界法性正符山外之見今何不許而觀妄耶答中二句總判上諸文不出能觀所顯下文一一對釋義例云體達若起若對不出法界止觀云繫緣法界是止一念法界是觀(即法界是能觀所顯)止觀云若未聞時處處馳求既得聞已攀緣心息名止但信法性不信其諸名之為觀(即法性是能觀所顯)重明境者前於生起互發中具明十境已竟今復明之故云重明於此陰境委明三科色心正是定境未論修觀次明修觀即不思議境十乘觀法義書亦云輔行於陰入境文分兩段謂先重明境即指三科內唯取識心去尺就寸文也次明修觀即十法成乘之文也(文)委示二境者揀示陰境及不思議境也豈得下結斥二師。",
    "X56n0931_001:0425a21_0": "【鈔】應知不思議境對觀智邊不分而分名所觀境若對所破陰等諸境故不思議境之與觀著名能觀故止觀云譬如賊有三重一人器械鈍身力羸智謀少先破二重更整人物方破第三所以遲迴日月有人身壯兵利權多一日之中即破三重輔行釋云約用兵以譬能所今以身壯譬圓三諦兵利譬圓三止權多譬圓三觀械等並依身力故也(上皆輔行文也)豈非諦觀俱為能觀耶今更自立一譬雙明兩重能所如器諸淳朴豈單用槌而無砧耶故知槌砧自分能所若望淳朴皆屬能也智者以喻得解幸可詳之皆為不辨兩重所觀故述斯旨。",
    "X56n0931_001:0425b07_1-0": "【觧】由山外不曉兩重所觀直將不思議境為所觀境不知若對陰等諸境則不思議自屬能觀以對觀智邊忘能所故從境受名耳故此特以兩重能所示之令知所觀決然屬妄如義書云故不思議境望下九乘名所觀境望前識陰則玅境并下九乘同是能觀之三觀也大意云諦觀名別體復同是故能所二非二(文)然此兩重在於一心更無前後譬如等者止觀約別圓對揀修證遲速之殊含於兩重能所之義故引為證彼云別教初知中道前破兩惑奢促有異何以故別除兩惑歷三十心動經劫數然後始破無明圓教不爾只於是身即破兩惑即入中道一生可辨譬如賊有三重等(止觀六二十六紙)",
    "X56n0931_001:0425b07_1-1": "賊有三重(三惑)一人(別教行人)器械鈍(次第三止)械者兵器通名身力羸(次第三諦)智謀少(次第三觀)先破二重(別教歷三十心方破二惑)十住修空破見思十行修假破塵砂更整人物(十向修中)方破第三(無明)歷劫修行故云遲迴日月有人身壯(圓教行人)一日(一生)一生能入初住故曰一日之中即破三重兵智譬三止三觀並是能觀身譬三諦此語所觀械等並依身力等者三止三觀皆依三諦譬智械並依身力而有輔行云智械並依身力故也(文)",
    "X56n0931_001:0425b07_1-2": "兵器智謀是能依譬能觀玅止玅觀身力是所依譬所觀不思議境此一重也賊譬所破陰妄之惑前之諦觀若望所破皆屬能破此一重也今更等者復加砧槌一喻的譬圓教兩重能所兩重用在一時故曰雙明器諸淳朴者玅樂云本以古質為淳朴今以未治為淳朴令其成器故名為器淳朴不一故名為諸(文)兩重能所舊云初重以一心三觀為能觀一境三諦為所觀次重合上境觀俱為能觀一念妄心為所觀問兩重能所約何義而立答初重約圓詮開解而說次重約立行造修而說(文)",
    "X56n0931_001:0425b07_1-3": "讀教記云定境用觀一家要宗必先詳於解行之文解行詳則境觀明矣止觀一部其要在乎解之與行解則圓解諸法本真行則立行定境用觀第五文云前六重依修多羅以開玅解今依玅解以立玅行此解行之分也余甞斷曰開玅解於定境之前用玅觀於定境之後故知定境用觀盡在立行文中與開解文了不相涉荊溪義例十不二門大槩同然皆先開解而後立行也立行有二先定境後用觀定境者何立陰是也若不立陰玅觀就何處用玅境於何處顯故十義書云定境修觀乃是止觀一部綱格進道要宗輔行於陰入境文分兩段謂先重明境即指三科內唯取識心去尺就寸文也次明修觀即十法成乘文也山外之失可知矣近代有謂定境之後方用玅解葢不究此解行之文如其說則定境在前開解在後矣又謂先以不思議觀觀不思議境為初重能所却合不思議境觀而觀於陰為次重能所如其說則修觀在前定境在後矣顛倒錯亂不足評也(文)",
    "X56n0931_001:0425b07_1-4": "私謂開解立行定境用觀如上所明可謂詳矣須知圓頓行者正用觀時的觀現前一念妄心具三千法三千即一念一念即三千不縱不橫不前不後觀之不已則陰境轉成不思議境矣不思議境境即是觀兩重能所歷歷分明以要言之但觀心是不可思議境則兩重能所玅在其中此義蘊之止觀輔行四明因山外境觀不明不許立陰入為境唯觀不思議境因示之曰不思議境是能觀觀法所顯法門復以兩重能所示之(云云)",
    "X56n0931_001:0425b07_1-5": "遂引止觀輔行明文為證復自立槌砧淳朴之譬詳夫祖師文意說有次第用在一心稱性而觀絕待而照焉有初重次重之分又何得謂之初重約解次重約行又何得謂先以不思議觀觀不思議境為初重却合不思議境觀而觀於陰為次重解行倒置境觀前後如上所評義學不可不精究之。",
    "X56n0931_001:0426a23_0": "【鈔】又若不立陰等為境玅觀就何處用玅境於何處顯故知若離三道即無三德如煩惱即菩提生死即涅槃玄文略列十乘皆約此立又止觀大意以此二句為發心立行之體格豈有圓頓更過於此若如二師所立合云菩提即菩提涅槃即涅槃也。",
    "X56n0931_001:0426b04_1-0": "【觧】明圓人離陰無德若如山外直觀真心不立陰妄為境反顯觀非即境而立故曰觀無處用境非達陰而成故曰於何處顯離三道別求三德如棄冰求水豈可得耶如煩惱即菩提等不言結業即解脫者乃順四諦法相生死即涅槃(生死是苦涅槃是滅)煩惱即菩提(煩惱是集菩提是滅)意令行人翻苦為滅翻集為道以苦集二諦束為三道結業收在集諦鈔云集既兼業以惑業俱屬故因於兼之耳玄文略列十乘者玄八(末)",
    "X56n0931_001:0426b04_1-1": "辨體章入體之門四教皆列十乘至第九卷初明圓十乘一一乘皆依此二句而立不思議境云即生死之苦諦是無作之滅諦即煩惱之集諦是無作之道諦發心云一切生死即大涅槃一切煩惱即是菩提安心云體生死即涅槃名為定達煩惱即菩提名為慧破遍云若生死即涅槃者分段變易苦諦皆破若煩惱即菩提者四住五住集諦皆破通塞云知生死過患名為塞即涅槃為通知煩惱惱亂為塞即菩提為通道品云觀生死即涅槃治報障觀煩惱即菩提治業障煩惱障次位中云生死之法本即涅槃理涅槃也乃至盡生死底即究竟涅槃也觀煩惱即菩提亦如是安忍中云若觀生死即涅槃不為陰入等境所動若觀煩惱即菩提不為見慢境所動離愛中云觀生死即涅槃故諸禪三昧功德生觀煩惱即菩提故諸陀羅尼等生(文)",
    "X56n0931_001:0426b04_1-2": "止觀大意者荊溪所述文中發心文云眾生無邊誓願度生死即涅槃故煩惱無數誓願斷煩惱即菩提故安心中云若知煩惱生死本性清淨名之為寂此煩惱生死本性如空名之為照通塞中云雖知生死煩惱為塞菩提涅槃為通(文)。",
    "X56n0931_001:0426c09_0": "【鈔】又引常坐中起對俱法界者今問法界因何有起對邪須知約根塵識故方云起對法界故義例釋此文云體達(修觀)若起若對(陰入)不出法界(成不思議)彼有約理約觀約果三義此文正約觀行辨也又安心文云唯信法性者未審信何法為法性邪而不知此文正是於陰修乎止觀故起信論云一切眾生從本已來未曾離念又下文云濁成本有若不觀三道即玅便同偏觀清淨真如荊溪還許不故輔行解安住世諦云以正觀安故世諦方成不思議又云安即觀也故談玄玅不違現文方為正說今釋一念乃是趣舉根塵和合一剎那心若陰若惑若善若惡皆具三千皆即三諦乃十玅之大體故云咸爾斯之一念為成觀故今文專約明乎不二不可不曉故茲委辨。",
    "X56n0931_001:0426c22_1-0": "【觧】前問答中直分判其能觀所顯今出其意故云因何有起對等耶約根等者輔行釋云佛法界根也對法界塵也起法界識也(文)義例釋者心境釋疑例問第一卷弘誓境中云對法界起法界法界如何有起有對答一者約理心佛無殊雖起雖對奚嘗非理二者夫念起依理體達若起若對不出法界三者稱理理既法界起對稱理無非法界(文)即約理等三義也雖有三釋今欲顯法界之言是所顯故但引約觀一義唯信法性者正是達妄成真真外無法故云唯信法性山外引此為觀真心而不知乃於陰妄修乎止觀二文並答上能觀所顯引起信并染淨門並證一念屬妄論云是故一切眾生從本以來念念相續未曾離念故說無始無明(文)",
    "X56n0931_001:0426c22_1-1": "偏觀等者輔行云今家用此十法為境不同常途別立清淨真如無生無漏(文)金錍云傍遮偏指清淨真如知荊溪不許也安住等者因止觀五(二十八)引大經不生等四句於不生生中云安住世諦名不生生止觀釋云無明共法性能生一切隔歷分別故名世諦安住者以止觀安於世諦即是不可思議境輔行五下(二)釋云以止觀安故世諦方成不思議境安即觀也(文)",
    "X56n0931_001:0426c22_1-2": "豈可直云不思議耶今釋文中一念乃是意根為因法塵為緣因緣和合起一念心輔行云秪觀根塵一念心起(文)此心的屬於妄也陰是苦道惑是煩惱善惡是業此之三道皆具三千皆即三諦舊謂一念三道正當揀境今謂不然須知正釋理境乃至利益咸爾意謂此之三道趣舉一法皆具三千皆即三諦為今十玅大體故云咸爾若爾何故文云不出一念故繼之曰斯之一念為成觀故與上文諸法皆具為成玅觀的指一念義同。",
    "X56n0931_001:0427b04_0": "【鈔】問相傳云達磨門下三人得法而有淺深尼總持云斷煩惱證菩提師云得吾皮道育云迷即煩惱悟即菩提師云得吾肉慧可云本無煩惱元是菩提師云得吾髓今煩惱即菩提等稍同皮肉之見那云圓頓無過。",
    "X56n0931_001:0427b08_1": "【觧】上因山外不立陰境直觀真心遂引玄觀以生死即涅槃煩惱即菩提為一家宗極之說又恐他人以禪宗名同義異之文惑亂正說故料簡之相傳云者不欲指其異說之人故須知此出圭峯後集裴相國問禪法宗徒源流淺深圭峯答釋云達磨直出可師傍傳道育及尼總持及示三人見解親疎故有此語印本見行詳四明意恐當時有人引此為難故今斥之如往復書云圭峯後集流衍來吳禪講之徒多所宗尚咸云達磨印於二祖本無煩惱元是菩提方為得髓智者所說即同持育二人之解乃成得肉之言鄙僧忝嗣台宗得不傷痛遂於指要文中對揚厥旨(文)今煩下結成難勢。",
    "X56n0931_001:0427b21_0": "【鈔】答當宗學者因此語故迷名失旨用彼格此陷墜本宗良由不窮即字之義故也。",
    "X56n0931_001:0427b22_1": "【觧】當宗學者不得今家正傳因見迷即煩惱等說便同今家煩惱即菩提之語即迷名也但有即名而無即義雖云迷即煩惱悟即菩提乃背面相翻之義非今家當體全是之義故云失旨若用彼禪宗格量吾教則使抗折百家之說同彼得肉之言故云陷墜皆為不明即義故也。",
    "X56n0931_001:0427c05_0": "【鈔】應知今家明即永異諸師以非二物相合及非背面相翻直須當體全是方名為即何者煩惱生死既是修惡全體即是性惡法門故不須斷除及翻轉也諸家不明性惡遂須翻惡為善斷惡證善故極頓者仍云本無惡元是善既不能全惡是惡故皆即義不成故第七記云忽都未聞性惡之名安能信有性德之行若爾何不云煩惱即煩惱等而云菩提涅槃邪答實非別指秪由性惡通融寂滅自受菩提涅槃之名葢從勝立也此則豈同皮肉之見乎又既煩惱等全是性惡豈可一向云本無邪。",
    "X56n0931_001:0427c15_1-0": "【觧】今家所明即義永異諸宗人師此通總言之下云諸家諸宗是同二物相合對總持斷惑證理背面相翻對道育迷惑悟道當體全是正示今家即義輔行云即者廣雅云合也若依此釋仍似二物相合其理猶疎今以義求體不二故方名為即(文)雖不對可師本無元是今既云煩惱當體全是菩提豈可謂本無煩惱是知可師亦無即義往復書云智者立法華待絕二玅止觀圓頓十乘以生死即涅槃煩惱即菩提二句文以為綱格誠非二物相合名即不可以斷證明之亦非一法翻轉名即故不可以迷悟分之煩惱非定本無菩提非定本有故用煩惱即菩提絕其言詮寂其思慮俾玅解圓明玅行頓顯者也(文)",
    "X56n0931_001:0427c15_1-1": "何者下徵釋即義發明即具宗旨點示性惡法門修惡性惡對修善性善得名克論法體不出十界九一對分善惡別行玄記云九界望佛皆名為惡(文)煩惱生死是九界法故屬修惡圓人解了九界修惡當體即性性名不改復是法門豈可斷除翻轉斷對總持翻對道育別行玄云性之善惡但是善惡之法門性不可改歷三世無誰能毀復不可斷壞記云善惡是性性不可改安可斷耶既不可改但是善惡之法門也法名可軌軌持自體不失不壞復能軌物而生於解門者能通可出可入等諸家下明諸宗失即義別行玄記云以性具善諸師亦知具惡緣了他皆莫測(文)",
    "X56n0931_001:0427c15_1-2": "言雖兼指意破禪宗三師翻破道育斷證破總持極頓破可師可師既云本無元是不能全煩惱修惡當體即是性惡故三師皆即義不成第七記者玅樂七(二十二)因文句釋經一相一味謂解脫相離相滅相即本有三道性惡法門記云若不爾者徒開浪會虗說漫行(止)對此終窮焉能昧實忽都未聞等謂忽若都未曾聞性德三道之名安能信有一乘性德之行光記一云須聞性惡者以知性惡故修惡本虗三觀十乘無惑可破無理可顯修德功寂是無作行故以性德召此行也(文)",
    "X56n0931_001:0427c15_1-3": "問摩訶止觀無性惡之名應非性德之行竹菴曰荊溪出語各有所對自有對山家學者自有對他宗學者今文乃對他宗而言也止觀性具三千與今談性惡廣略異耳若爾下徵釋即義由上云不能全惡是惡謂斷除翻轉本無皆不能全修是性今徵云何不云煩惱即煩惱生死即生死耶答實非煩惱生死之外別指他法為菩提涅槃只由生死等雖是惡法以即性故法體通融故煩惱受菩提之名法體寂滅故生死受涅槃之號從勝立名名雖勝劣體無優降但約化他修門邊說言煩惱生死則生厭離言菩提涅槃則生欣樂為此義故從勝立名名雖轉而體不轉也若名體俱不轉謂生死即生死亦應無妨煩惱即菩提等體既不轉豈同持育斷除翻轉得皮得肉之見又既修惡全是性惡豈同可師云本無耶名體轉不轉四句分別一名轉體不轉(三道即三德三道之名雖轉為三德體實不轉生死即涅槃即此句)",
    "X56n0931_001:0427c15_1-4": "二體轉名不轉(大論云轉生死五陰為法性五陰而猶有五陰之名)三名體俱不轉(如云十二因緣非佛天人修羅所作本自有之此名體俱不轉今云全惡是惡亦爾)四名體俱轉(止觀云無明復為法性明即名體俱轉)性惡問天台諸部不談性惡獨在別行言之何耶答玄約人法十雙總釋品題初人法至第八乃順論自他九明緣了是却討根本上之八雙皆是緣了二因而為種子至料揀中問緣了既有性德善亦有性德惡不答具(文)",
    "X56n0931_001:0427c15_1-5": "以此義故在彼文明諸部不明者記云摩訶止觀明具三千玅玄文句明示千法微乎修性其文既廣具義難彰是故此中略斷善惡明性本具名言既略學者易尋若知善惡皆性本具性無不融則十界百界一千三千以此所談望止觀文不多不少(文)據此則玄句止觀非不明之但是廣談一千三千別行略說性具善惡也問修性善惡其相何如答性具佛界為性善性具九界為性惡修中佛界為修善修起九界為修惡四明云本具三千為性善性惡緣起三千為修善修惡(文)",
    "X56n0931_001:0427c15_1-6": "問緣起三千為修善惡則三千法體不可斷破指要云煩惱生死既是修惡全體即是性惡法門故不須斷除及翻轉也若云不斷別行玄又云闡提斷修善盡佛斷修惡盡北峯曰今言斷者約即論斷四明云障體即德無障可論斯為斷義(文)今亦可疑既即是了有何可斷曰以由即故而顯於離以由離故全顯於斷離謂離情即謂即法以離情故即是於斷以即法故故言不斷應知但斷能執之情病故云諸佛斷修惡盡不破所執之法故云修善修惡即事造三千也問性惡斷不答性具善惡實不斷破故云性之善惡但是法門性不可改復不可斷壞如云若斷性惡普現色身從何而起若云拔性德苦即理毒害為所消伏此乃體是修惡以就圓論指修即性故受理性之稱亦約即論斷義也應知性惡有起有具具者性具九界也起者乃全性起惡此是修惡以圓詮故即性而起受理性稱如云法界無染即理性之毒玄云破無明理惡別行云拔性惡苦皆此類也既指修即性以修為性也。",
    "X56n0931_001:0429a05_0": "【鈔】然汝所引達磨印於可師本無煩惱元是菩提等斯乃圭峯異說致令後人以此為極便棄三道唯觀真心若據祖堂自云二祖禮三拜依位立豈可言煩惱菩提一無一有耶故不可以圭峯異說而格今家玅談爾。",
    "X56n0931_001:0429a09_1": "【觧】此一節元本自云此乃又超得髓之說也可師之見意縱階此語且未圓問今明圓教豈不論斷惑證理及翻迷就悟耶若論者何異持育之解答只如可師豈不斷惑翻迷豈亦同前二耶故知凡分漸頓葢論能斷能翻之所以爾(文)時天童凝禪師有書於四明謂不可以道聽塗說將為正解凡往復二十來番諍之不已太守直閣林公勸四明下和融之語辭不獲已遂改數行云然汝等汝字正指前相傳云者葢當時禪講之徒咸謂台教宗旨只齊持育之見尊者救時之蔽故此闢之往復書云人據圭峯以難台教豈不依教而反破之(文)能斷能翻之所以者其實漸頓二教咸皆斷證迷悟葢約能斷能翻之觀智即不即次不次以分漸頓之別爾。",
    "X56n0931_001:0429a23_0": "【鈔】今既約即論斷故無可滅約即論悟故無可翻煩惱生死乃九界法既十界互具方名圓佛豈壞九轉九邪如是方名達於非道魔界即佛故圓家斷證迷悟但約染淨論之不約善惡淨穢說也諸宗既不明性具十界則無圓斷圓悟之義故但得即名而無即義也此乃一家教觀大途能知此已或取或捨自在用之故止觀亦云唯信法性不信其諸語似棄妄觀真(元云豈異可師之說)而義例判云破昔計故約對治說故知的示圓觀須指三道即是三德故於陰等觀不思議也若不精揀何稱圓修此義難得的當至因果不二門更為甄之。",
    "X56n0931_001:0429b09_1": "【觧】此下對前斷證迷悟二義以明今家正意若得前來修惡即性之義則斷與不斷二皆無在今家約即論斷不同尼總持約即論悟不同道育當知煩惱生死乃九界修惡之法既十界互具界界具十則九界當處即是佛界是名圓佛豈斷壞九界而證佛界又豈轉九界之迷為佛界之悟耶如是論之方名達九界非道即是佛道魔界如佛界如也四明云佛之與魔相去幾何(文)圓論斷證迷悟但約情理以說情著則十界俱染有惑可斷為惑所迷理融則十界俱淨不斷而證了迷即悟但約此論不約三善三惡六穢四淨法體而說以善惡淨穢皆性本具不可斷除翻轉故也此乃等者指上即具之旨是教觀大途教不明此非圓頓玅教行不明此非圓頓玅觀苟能知此旨取捨自在無不圓極取捨即斷否義光記云秪就即之一字明於二義障體即德無障可論斯為斷義障既即德障何嘗斷斯不斷義斷與不斷玅在其中(文)止觀亦云者對前第三師說非特彼云本無元是而止觀亦云唯信法性然義例云約對治文云以眾生久劫但著諸法不信法性破昔計故約對治說令於諸法純見法性若見法性則見諸法純是法性(文)故知下通結上文所明即義一家極談難於的當至下釋三千並常更為甄別鈔云體用之名等。",
    "X56n0931_001:0429c09_0": "△二則止下示成由行。",
    "X56n0931_001:0429c10_0": "則止觀十乘成今自行因果起教一章成今化他能所。",
    "X56n0931_001:0429c11_1": "【觧】科示成由行者欲成顯此十玅因果自他當修玅行止觀凡十章大意釋名體相攝法偏圓方便正觀果報起教指歸此十亦即因果自他於十章中唯舉十乘起教者前六是十乘之解果報是三法之相旨歸是息化之理今故不言但舉正觀成前五玅起教成後五玅。",
    "X56n0931_001:0429c17_0": "【鈔】已約心法顯乎玅旨雖知十玅不離一念若非玅行何能成之故玄文雖立觀心而且託事附法葢非部意故多闕略若具論能成之功須指摩訶止觀也故境等五玅且論諸聖及佛世當機所觀所發所行所歷所究盡法而於我曹稟教行人如何成就故令修止觀用十法成乘方能親觀玅境發智立行歷位登果故彼十乘能令行人成就自行因果也。",
    "X56n0931_001:0429c24_1": "【觧】將欲正出今文之意先重指前科指玅歸心乃約一念心法顯示三千玅旨則了十玅法相不離一心雖能解知若欲成就須修玅行故玄下釋出相成之意玄文縱有觀心但是託事附法以其解正行傍非部正意故乘境不備若欲具足論於能成須指止觀以止觀正明觀法行正解傍乘境悉備故須修十乘起教成就玄文十玅因果自他之法故境下釋十乘成自行因果玄文所談境等五玅乃佛世諸聖當機修證之法於我輩今日稟教修行之人何能成就故荊溪令學者依止觀十乘修之方能成顯也所觀(境)所發(智)所行(行)所歷(位)究盡(三法)。",
    "X56n0931_001:0430a12_0": "【鈔】言起教一章成今化他能所者彼文起教雖即弗宣而且不出裂網之意此裂網文泛論生起雖在果後化他細尋其意多明初心自行故文云種種經論開人眼目執此疑彼是一非諸今融通經論解結出籠豈非始行能裂他網又文云若人善用止觀觀心則心慧明了通達漸頓諸教如破微塵出大千經卷河沙佛法一心中曉豈非自行起教又云若欲外益眾生逗機設教等此文方是果後化他也輔行二釋謂化他裂網自行裂網但自行文略故讀者多暗至於歸大處文亦為初心修觀而說故云膠手易著寱夢難醒封文齊意自謂為是乃至云為此意故須論指歸故知五略十廣雖該自他始終而盡是行者修法若了彼文方可銷今相成之意故今十門從染淨不二已去皆指果後設化之相悉在初心剎那一念而必須三觀功成此用方顯故文云故須初心而遮而照等故知能修起教之觀則能成就應機現通說法之用也此意稍隱解者方知不作此解則止觀裂網指歸之文記中自行之釋及今相成之語如何銷之若云但修十乘果用自顯者則合云十乘成今化他能所爾。",
    "X56n0931_001:0430b08_1-0": "【觧】桐洲私科分四初標起教章二示止觀文意三示今門文意四結迷解得失次文分三初正示起教文意二初引止觀文二初示意弗宣者天台說摩訶止觀至第七正修纔至見境時逼夏終法輪停轉後三章不說起教不出五略中裂網之意起教本為除他疑網其意是同故輔行云雖缺餘文行門非要略中已具足表其心(文)此裂等者若以止觀文相生起次第言之則裂網在感果之後須至果後化他方能裂他疑網若委細推尋文中元意必自行修之後方化他則一部始終盡是行者修法故深求文意多明初心自行少論果後化他淨覺謂自裂網則通初心裂他網須至果後但得泛論生起之義二引文凡三節北峯謂初文乃初心為他通經非修觀也第三是果後化他亦非修觀今起教觀正是第二自行起教之文由善用止觀觀心發悟通達諸教名自行起教未是破無明果上起教又非初心為他說起教若初心為他說名初心裂網非正修起教觀義也(文)",
    "X56n0931_001:0430b08_1-1": "初始行裂網文云種種等者第二卷五略生起中標裂網文云云何裂大網種種經論開人眼目執此疑彼是一非諸聞雪謂冷聞鶴謂動今融通經論解結出籠(文)大小乘教本是開明智眼逗物不同種種各說不曉如來悉檀被物之意於四門互相執著是一非諸今融通經論解結出籠既云融通經論即初心能裂他網也輔行釋云雖本為開眾生智眼實機未顯如法華前眾生於教權實空有事理互迷若為判已開權顯實使權實不濫令識教本意破執教疑網達一理無外了法門大體知眾教有歸(文)",
    "X56n0931_001:0430b08_1-2": "今融通等者理本無說說必被機四悉四門諸觀諸諦適時利物未及通方便各計一隅情執未破今為融會重疑颯然如繫鳥在籠情無所適解執滯結開權教籠如游太虗縱曠無礙(文)此是始行裂他網之文初心便能解釋經論教示來學淨覺謂若自裂網則通初心裂他網須至果後者不究融通經論之言與釋裂網中通除自他疑網之說又籤云自行則從因至果化他則位位有之(文)",
    "X56n0931_001:0430b08_1-3": "淨覺見據初心依理生解與果上起教不同者輔行自揀初心觀化他境是內心觀解與果上起教不同於今始行裂他網了無關涉又文云等者第二卷釋裂網文云第四為通裂大網諸經論故說是止觀者若人善用止觀觀心等(文)此正明修起教觀故云用觀觀心通達諸教輔行明作自行釋之言善用者用不思議觀觀於玅境則攬果上偏圓漸頓不出一心用觀觀之則河沙佛法一心中曉輔行云初文通除自他疑網故云通裂乃至須曉漸頓諸教出自一心若不善用不思議觀觀於一心不思議境何由可裂執教大疑(文)",
    "X56n0931_001:0430b08_1-4": "科云初約觀心自除疑網豈非正明初心修起教觀耶破塵出卷者華嚴如來性品譬如有一經卷如大千界所有一切無不記錄時有異人具足天眼見此經卷在一塵內作是念言云何經卷在一塵內遂破塵出卷輔行引寶性論云有神通人見佛法滅以大千經卷藏一塵中後有人破塵出卷(文)三果後化他連文云若欲外益眾生逗機設教者隨人堪任稱彼而說等(文)四明斷為果後起教二明輔行釋二釋者通指上兩文初作自行釋故云須曉等次作化他釋故曰為利他故裂他疑網自行文略者輔行自行釋中文甚簡略只由淨覺引文不備專據若不善用不思議觀等文謂但修十乘果上自顯不許四明修起教觀而不看上文云須曉漸頓諸教出自一心此正當修起教觀之義淨覺昧此故云讀者多暗又謂自裂通初心裂他須果後不許初心裂他及修起教故四明備引三文一一結示使初心有裂他網義有修起教義有果後起教義初文有融通之言即始行裂他網也次文有善用止觀之言即初心修起教也第三有逗機之言即果後施化也二例示指歸文意云至于等旨歸三德名為大處自他同歸三德雖是息化之理亦為初心故止觀二(二十二)",
    "X56n0931_001:0430b08_1-5": "云第五歸大處諸法畢竟空故說是止觀者夫膠手易著[日*藝]夢難醒封文齊意自謂為是競執瓦礫為瑠璃珠近事顯語猶尚不知況遠理密教寧當不惑為此意故須論旨歸(文)輔行釋云心性如手惑著如膠隨文封滯迷於旨趣不達教相不曉旨歸隨文生著互相是非非但不至三德旨歸為陰集魔而擔將去寱夢等者夢甚故寱寱故難醒法性如眠無明如夢僻執如寱執重難除名為難醒封文等者封閉也塞也諸教諸門諸諦諸悉隨一各執故云齊意(文)",
    "X56n0931_001:0430b08_1-6": "三通一部文意五略中發心修行即自行始感果即自行終裂網即化他始歸處即自他同歸亦自他終三示今門文意謂若了止觀裂網文意通於初心方可消今之起教成化他能所後之五玅也故今十門前四門為十乘觀體後六門為起教觀體也從染淨門去純談化他悉在初心修觀由因中修觀之功至果顯化他之用故引染淨門能顯玅觀文證空中名遮假觀名照三觀圓修淨用方顯故知因修起教能成就應機等用也感應玅中之應神通說法二玅皆是能化之用所化即感及眷屬利益二玅也後六門中染淨謂所顯淨法依正謂果用由因本具自他謂感應之體本同三業謂所顯果用皆果後化他也若染淨云能顯玅觀依正云理顯以觀為功自他云觀行之功方顯三業云能顯觀體皆因中修起教觀之相也四結迷解得失若云等者結斥淨覺偏見之失彼謂四明離十乘別修起教自立義云但修十乘果用自顯今反質云如其說則荊溪合云十乘成化他爾起教觀輔行二下(十八)",
    "X56n0931_001:0430b08_1-7": "云問大章名起教五略名裂網云何得同答對揚利物名為起教令他除疑名為裂網起教本為除他疑網是故同也(文)止觀大意敘五略中云起八教是則裂網起教名異義同四明深得此意乃云彼文起教雖即弗宣而且不出裂網之意(文)以五略略於九廣九廣廣上五略文心解云起教之言須起八教徧逗群機而反用自裂之文作自行起教不亦謬濫乎(文)彼迷於義同名異反顯廣略義不相關況復止觀明指第九重當廣說是知五略裂網即大章起教也今文云此裂網文泛論生起雖在果後化他細尋其意多明初心自行(文)",
    "X56n0931_001:0430b08_1-8": "尊者立義果後化他法門須在初心修觀因若不修果何能顯初心行人必須徧攬果上偏圓漸頓權實法門入一念心修之方能果後遍逗群機也止觀明指第九重當廣說攝法中亦略示(文)起教雖即弗宣攝法之文可考止觀三云如來曾作漸頓觀心偏圓具足依此心觀為眾生說教化弟子令學如來破塵出卷仰寫空經(文)又釋裂網文如前引並初心修起教觀之明文也然初心修起教為離十乘外別修耶即十乘而修耶若別修者則顯十乘觀體一念三千攝法不盡況自行初心修不思議境又修起教應兩重用觀耶若即十乘而修不二門那云十乘成自行起教成化他耶答若以觀體言之十乘起教只一三千三諦何法不具但修觀行者須精識果上偏圓漸頓諸教出自一心攬此等法入一念心而修名起教觀北峯曰法理已備修相未明是知說有次第修在一心善修止觀者攬化他法融入一心焉有起教在十乘外荊溪云須曉漸頓諸教出自一心(至)",
    "X56n0931_001:0430b08_1-9": "執教大疑如此自他並由玅觀契於玅境是故能有如是玅用(文)草菴云終日十乘終日起教但文義主對解行相當則玅玄十玅止觀十章各具自行化他之法玅玄前五玅須修止觀十乘自行之觀成之後五玅須修止觀起教之觀成之此關節也若以旨趣言之十乘不離起教起教不離十乘艸菴曰止觀雖十乘不思議境觀一也初心雖起教而不思議境觀亦一也文心解引輔行云若不善用不思議觀等文豈非但修十乘耶若謂十乘不該果用後之五玅更須別修則眾寶之車成壞驢之運(文)",
    "X56n0931_001:0430b08_1-10": "此以旨趣而難關節抑亦四明何嘗云別修耶若云起教不通初心修者籤文云撮十玅為觀法大體應云撮五玅為觀體只合云重述四門令觀行可識淨覺不許初心修起教觀如何消今相成之意耶文心解曰但以起教之義正明感應等事彼此相顯故云成今(文)荊溪謂十乘成前五玅起教成後五玅故重述十門令觀行可識是知十乘起教俱是觀法若以彼此教觀相顯以釋相成却見十門徒施觀法無用矣問鈔云互相顯映與彼此相顯何異答淨覺但約彼觀此教而言相顯不知以行成解四明約教廣觀略行正解傍而論相顯即解行相成也問初心修起教與化他境為同為異答起教觀乃攬果後化他法門入初心修化他境明三千法離性執己無妨四說不可會同。",
    "X56n0931_001:0432b15_0": "十不二門指要鈔詳解卷上本",
    "X56n0931_001:0432b18_0": "十不二門指要鈔詳解卷上末",
    "X56n0931_001:0432b20_0": "唐　荊溪尊者　釋籤",
    "X56n0931_001:0432b21_0": "宋　四明尊者　鈔",
    "X56n0931_001:0432b22_0": "宋武林沙門　可度　詳解",
    "X56n0931_001:0432b23_0": "明天台後學　正謐　分會",
    "X56n0931_001:0432b24_0": "△三則彼下功成識體。",
    "X56n0931_001:0432c01_0": "則彼此昭著法華行成使功不唐捐所詮可識。",
    "X56n0931_001:0432c01_1": "【觧】科功成識體者十乘起教觀行功成則識所詮三千玅體彼此者彼即止觀此即十玅彼觀此教解行相成昭明顯著法華玅行於茲成就使功不虗棄教下所詮之體可識。",
    "X56n0931_001:0432c06_0": "【鈔】故知得此相成之意則不唐學問不謾修行教下所詮玅體可識。",
    "X56n0931_001:0432c07_1": "【觧】故知若得前科解行相成之意解成則不唐學問行成則不謾修行也。",
    "X56n0931_001:0432c09_0": "△四故更下結示立名使詮旨斯顯四初立門所由。",
    "X56n0931_001:0432c11_0": "故更以十門收攝十玅。",
    "X56n0931_001:0432c11_1": "【觧】科結示立名使詮旨斯顯以十門攝十玅結示立名直申一理使經旨泠然詮旨斯顯也初立門所由十門從十玅立故云所由故更之言承上而來欲令解行俱成故更立十門收攝十玅。",
    "X56n0931_001:0432c16_0": "【鈔】如文。",
    "X56n0931_001:0432c17_0": "△二何者下出門名義。",
    "X56n0931_001:0432c18_0": "何者為實施權則不二而二開權顯實則二而不二法既教部咸開成玅故此十門不二為目。",
    "X56n0931_001:0432c19_1": "【觧】十門何故皆名不二徵釋云為實等在昔四時三教分隔而說皆云二法今經顯實開會而談皆不二也。",
    "X56n0931_001:0432c22_0": "【鈔】理事三千本皆融即實機未熟權化宜施佛順物情分隔而說故云不二而二半滿諸法暫有差殊權化若成實理須顯佛隨自意開會而談故云二而不二境等十法即是所通既約教部判後開之俱圓俱玅故能通門宜名不二。",
    "X56n0931_001:0433a02_1": "【觧】理事至而說釋為實施權初二句明一實理次二句明施權意後二句正明施權諸佛慈悲不與世諍物情差別亦以差別之法逗之從一清淨道施出二三四故云分隔而說此施權當分義也半滿至而談釋開權顯實意初二句明權法次二句明開顯意後二句正明開權會二三四咸歸於一故云開會而談此開權跨節意也與玅玄二會異科明施開意同初明諸法本實云一切諸法無不皆玅眾生情隔於玅耳(今云理事等)次大悲施權云大悲順物不與世諍是故明諸權實不同(今云實機等)三今經開顯云今開方便門示真實相(今云半滿等)境等去釋法既教部等門為能通境等即所通約教判三麤一玅約部判昔麤今玅約教開偏入圓約部開四味麤即醍醐玅俱圓則約教論開俱玅乃約部義也所通之法既俱圓玅門由玅立故能通門宜名不二也。",
    "X56n0931_001:0433a18_0": "△三各自高深。",
    "X56n0931_001:0433a19_0": "一一門下以六即檢之。",
    "X56n0931_001:0433a19_1": "【觧】各自高深者該修德之極為高(究竟)徹性德之源為深(理即)門門皆用六即檢校高下故云各自須六即檢者以十玅不出三千三千不離一念既以十門收攝十玅則門門之下的指一念三千為今觀體故須六位揀其高下也。",
    "X56n0931_001:0433a24_0": "【鈔】一家所判法門名義無間高下己他無不理性本具全性起修分顯究盡故今十門一一如是皆為觀體其義更明然事異故六理一故即此宗學者誰不言之而的當者無幾應知圓家明理已具三千而皆性不可變約事乃論迷解真似因果有殊故下文云三千在理同名無明三千果成咸稱常樂(約事明六)三千無改無明即明三千並常俱體俱用(約理明即)若見斯旨稍可持論。",
    "X56n0931_001:0433b07_1-0": "【觧】一家等者天台一家判諸經論一切法門能詮名字所詮義理無論高下己他皆用六即揀判止觀云圓觀諸法皆云六即故以圓意約一切法悉用六即判位(文)高下己他即心佛眾生十界依正佛界為高九界為下心法為己生佛為他理性本具(理即)全性起修(名字觀行相似)分顯(初住至等覺)究盡(究竟)既諸法門皆用揀判故今十門亦以六即撿之故云一一如是十門既約六即乃顯門門攝歸一念三千皆可修證則十門皆為觀體前四為十乘觀體後六為起教觀體其義至此猶更分明驗知起教初心不可不修矣然事下北峯分四初標迷二正示三引證四結示初文即止觀大意文此二句自荊溪發明之後凡稟山家學者皆能言之而得旨者少故云無幾以由淨覺以空中為理同俗假為事異(此義雖在雜編以在四明輪下已有此語故暗斥之)",
    "X56n0931_001:0433b07_1-1": "應知等者三千法門理性本具不可改變荊溪云萬法是真如由不變故隨緣即不變乃全事成理理同故即也約事乃論迷解等即變造三千全理成事遂分六位之差即事異故六也理即名迷名字觀行屬解真即分證似謂六根因即前五果即究竟引因果門四句釋之鈔下釋曰三千在理為染作因縱具佛法以未顯故同名無明(該前五即因中三千也)三千離障八倒不生一一法門皆成四德故咸常樂(究竟即果上三千也)",
    "X56n0931_001:0433b07_1-2": "此二句既將因果對分必該六位故註云約事明六三千實相皆不變性迷悟理同故曰無明即明(此明因果只一三千)三千世間一一常住理具三千俱名為體變造三千俱名為用故云俱體俱用(此明因果三千俱能起用因中三千起於染用果上三千起於淨用)此二句示三千之性在迷在悟未始改易雖在於體體不離用全用是體也故註云約理明即原夫事理兩種三千本圓融相即之義理即迷此名字解此乃至究竟顯此今以理同事異對兩種三千者不分而分以事異故六即理之事對事造三千理同故即即事之理對理造三千也若謂兩種三千之外更有迷悟之事則兩種三千攝法不盡何名玅法耶六即義蘊大經名出智者止觀一引如來性品云譬如貧人家有寶藏而無知者知識示之即得知也耘除草穢漸漸得近近己藏開盡取用之(文)",
    "X56n0931_001:0433b07_1-3": "經文甚廣大師撮略而引輔行委釋義雖蘊經諸師莫知吾祖深悟圓宗發明此義故於止觀發大心約六即顯是觀經疏約六即釋佛字荊溪云此六即義起自一家深符圓旨(文)即之為義輔行云如前引體不二故名即指要云當體全是方名為即(文)吾祖立六即義有二一顯圓詮諸法事理不二生佛體同免生退屈故明即字雖全體是迷悟因果其相有殊免生上慢故明六字止觀云若智信具足聞一念即是信故不謗智故不懼初後皆是若無信高推聖境非己智分若無智起增上慢謂己均佛初後俱非為此事故須知六即(文)",
    "X56n0931_001:0433b07_1-4": "二革文字暗禪之蔽世間暗證禪人撥棄修行唯云即心是佛不辨階位淺深多濫上聖為救斯蔽故明六位文字法師封文滯意唯守名相推功上人自謂絕分為此等故故明即字以示初後理同輔行云暗禪者多增上慢文字者推功上人並由不曉六而復即(文)此六即與兩種三千如何會同雜編云理同者三千空中之理迷悟咸同也事與者三千即假之事因果有異也(文)霅川之說分割三諦已死之義置而勿論南屏云兩種三千法體皆不思議名理同六位淺深情分高下名事異(北峯評曰不二門云名智淺深何嘗云情)",
    "X56n0931_001:0433b07_1-5": "北峯因南屏之說又詳究玅宗指要之文曰理同者事造三千法體與理同故即也事異者情智迷悟淺深所見事異故六也(改情分為情智也)葢圓詮生佛迷悟緣起變造諸法皆事三千並由理起全事即理事與理同故云理同故即也而事造上有迷有悟逆順事殊悟仍淺深真似相別故云事異故六是則理同故即通事理兩種三千事異故六別指事造三千分迷悟淺深事異也(文)",
    "X56n0931_001:0433b07_1-6": "今恐理事三千攝法周遍豈事造外更有情智淺深應屬緣生虗假非圓家即理之事也鑑堂云應知理同故即是理造三千事異故六是事造三千以事造不出逆順二修權實二造皆是即理之事全性起修雖迷解真似乍分當處無非理性本具故即不妨六六不妨即一一無異故事造三千始終不缺正由迷解法上當處點即也(文)今依此說更助顯之理同事異非單理單事葢由全性起修故有六位迷悟高下之殊故曰事異其實皆當處即理也全修成性故六皆即理故曰理同是則理同故即即事之理對理造三千事異故六即理之事對事造三千若爾何名俱體俱用耶答俱用之言正彰理同故即能即體起用因中全三千之體起於染用果上全三千之體起於淨用其實正意明理造三千也四明云第四句明圓最顯體用之名本相即之義(文)",
    "X56n0931_001:0433b07_1-7": "問三千乃圓融法體今以六位迷悟高下會事造三千將非差別法而會圓融法乎答全性起修雖分六位其實當處即理故四明曰理則本具三千性善性惡也事則變造三千修善修惡也既以修善修惡為事造何妨以六位高下對之復次四明於玅宗發明蛣蜣六即之義文云六即之義不專在佛一切假實三乘人天下至蛣蜣地獄色心皆須六即辨其初後所謂理蛣蜣乃至究竟蛣蜣等(文)",
    "X56n0931_001:0433b07_1-8": "潤師指瑕云理即在迷故則有蛣蜣等名字在悟則五即皆佛如何却於此五而立蛣蜣等名字乎淨覺時在四明輪下作抉膜書委破潤師後來背宗還同他見故雜編云六即之名本為揀濫雖一切法通於六位若名有叨濫故須甄之若名不濫者不必揀也且蛣蜣蝮蠆是畜趣之微物俱是迷逆之號固無叨濫之理何須用六位甄分良為他人見涅槃疏中蛣蜣蝮蠆具於四分例彼四分立此六即蟲名雖同分之與即二義敻殊何者彼之四分既名為作葢約權造事用而言此之六位既名為即須從實證理體而說(文)",
    "X56n0931_001:0433b07_1-9": "北峯破云有三失初至不揀是一切不遍失止觀云圓觀諸法皆云六即何云蛣蜣等不必揀耶二從且蛣蜣至何須甄分是圓見同凡夫失圓見含靈皆毗盧體豈同凡夫三從良為至盡文是妄破例四分失四明不曾例涅槃四分乃成加誣艸菴扶成云十方虗空生我心內空生大覺如海一漚覺體周涵無乎不在然佛名曰覺覺遍十方毗盧遮那即一切法者也夫如是圓頓初心莫不即是若唯即是上慢彌滋六位甄分革斯叨濫於是圓觀諸法皆須六即也四明達此則曰不惟顯佛九亦同彰下至蛣蜣皆須六即葢佛以十界為通體蛣蜣即佛界別相十皆究竟不舍蛣蜣至果圓成名體不轉以如來終日與蛣蜣同而蜣蜣終日與如來異故曰三千在理至咸稱常樂茲乃唯心觀體無法不收六即相須深符圓旨(文)",
    "X56n0931_001:0433b07_1-10": "葢圓詮十界初後不二迷則俱迷悟則俱悟毗盧身土不逾凡心阿鼻依正全處極聖一佛成道法界無非此佛依正一成一切成故玅宗曰以論十界皆理性故無非法界一一不改故名字去不唯顯佛九亦同彰乃至果成十皆究竟(文)解謗云蛣蜣名相至究竟者此名理性具十界也(文)忠法師云廣智傳四明曰約一人唯心觀體說也(文)。",
    "X56n0931_001:0435a10_0": "△四直彰宗趣。",
    "X56n0931_001:0435a11_0": "本門已廣引誠證此下但直申一理使一部經旨皎在目前。",
    "X56n0931_001:0435a13_0": "【鈔】如文。",
    "X56n0931_001:0435a14_0": "△二一者下第二列門解釋二初列門對玅二初列門。",
    "X56n0931_001:0435a16_0": "一者色心不二門二者內外不二門三者修性不二門四者因果不二門五者染淨不二門六者依正不二門七者自他不二門八者三業不二門九者權實不二門十者受潤不二門。",
    "X56n0931_001:0435a20_0": "【鈔】可見。",
    "X56n0931_001:0435a21_0": "△二是中下對玅。",
    "X56n0931_001:0435a22_0": "是中第一從境玅立名第二第三從智行立名第四從位法立名第五第六第七從感應神通立名第八第九從說法立名第十從眷屬利益立名。",
    "X56n0931_001:0435a24_1": "【觧】十門從十玅立前云立門對玅互有多少即今文。",
    "X56n0931_001:0435b02_0": "【鈔】七科之境不出色心此二不二則諸境皆玅故云第一從境立名智行二法正論修相儻二境不融修性有異則不成玅故二三從智行立名位多在因三法唯果若了始終理一此二皆玅故第四從位法立名通應是事果後利他既是淨用依正必融縱是他機亦同自體此之玅事在今染心能如是觀玅用方顯故五六七從感應神通立名三業是能說之人權實是所說之法此二若融說法方玅故八九從說法立名眷屬是三艸二木利益由法雨所滋若知本一地雨則權實益等故第十從眷屬利益立名立此十門意成十玅解行故也。",
    "X56n0931_001:0435b13_0": "【觧】玄文明境具有七科今以色心二法收盡故云不出今經開權色心諸法咸成不二門顯七科無非玅法依境發智以智導行是正論起修今明內外二境互融修全性起故使智行方稱玅法鈔中反顯云不融有異也位玅實通因果為對三法極果故多在因若了始因終果一理無殊位法方玅故因果門從二玅立神通感應是果後利他之事果上全三千之體起於淨用其用既淨故依正不相妨他機同自體此之淨用在今染心能以利他之法攬入一心玅觀觀之果用方顯故此三門從通應二玅而立此初心修起教觀之相也能說之人三輪設化所說之法權實不融今經開之咸名不二三草二木是能受法雨是能潤今皆一地所生一雨所潤即利益平等結意云荊溪立此十門為成玅解行也。",
    "X56n0931_001:0435c04_0": "△二一色下釋門旨趣十段初色心不二門三初標。",
    "X56n0931_001:0435c05_0": "一色心不二門者。",
    "X56n0931_001:0435c06_0": "【鈔】一切諸法無非玅境本文七科亦且從要七科尚廣玅旨難彰今以色心二法收盡故大論云一切世間中唯有名與色若欲如實說但當觀名色此二不二諸法皆玅故今攝別入總特指心法明乎不二以此為門則解行易入也。",
    "X56n0931_001:0435c10_1": "【觧】釋標文初釋色心此二下釋不二以此下釋門初文從寬至狹示境之要法華開顯三千諸法無非玅境天台從要總作七科次明法相該愽故云尚廣今以略顯廣故用色心收盡心法為門解行易入即以易通難也論云一切諸法中但有名與色更無有一法出於名色者若欲求真實但當觀名色(文)箋要曰大論云名色者謂心但有名故若望假名此名即實(文)攝別入總者攝色心之別入一念之總故就心法以明不二解行易入者攬法歸心無法不趣解易入也即心成觀觀無不通行易入也。",
    "X56n0931_001:0435c21_0": "△二且十下釋二初約諸境明總別二初雙標。",
    "X56n0931_001:0435c22_0": "且十如境乃至無諦一一皆有總別二意總在一念別分色心。",
    "X56n0931_001:0435c23_1": "【觧】總科云約諸境明總別謂約七科諦境明乎總別別則分色分心總乃的指一念今且通分總別下方別開事理諸師不得此意便就此分事理將理為總以事為別致與一家文義相違。",
    "X56n0931_001:0436a03_0": "【鈔】總在一念者若論諸法互攝隨舉一法皆得為總即三無差別也今為易成觀故故指一念心法為總然此總別不可分對理事應知理具三千事用三千各有總別此兩相即方成玅境。",
    "X56n0931_001:0436a06_1-0": "【觧】初句牒文若論下通論諸法皆總今為下正明一念為總然此下遮異說應知下顯正義諸法互攝者三千諸法以即性故趣舉一法攝一切法則法法皆得為總即心佛眾生三無差別諸法雖多不出三法故用此結也然雖諸法皆得為總今意為成玅觀故指一念玄文揀難從易之義也不可等者以山外以理為總事為別以理同故論理總事異故論事別俟下評破四明建立則理具三千一法為總諸法為別事用三千總別亦爾故云各有相即者理中總別即事總別事中總別即理總別方得稱玅皆由理具方有事用故也事理總別文云總在一念別分色心以一家事理如何分對孤山以理總事別而釋以理同故論總由事異故論別一念是總屬能造故名理總生佛依正是事屬所造名事別淨覺亦云理總事別但以空中為理俗假為事舊破云以彼不曉性具諸法法法宛然故無理別不曉事相本來圓玅故無事總如毛吞巨海芥納須彌豈非事相能總諸法耶破義未盡別出義章四明立義理具三千事用三千各有總別性具諸法總別相收緣起諸法總別亦爾等尊者之說符文得旨符文者不二門當知心之色心即心名變玅樂記四句立法金錍圓見事理一念具足皆蘊乎事理各論總別之義又深得一家圓頓解行之旨以圓論諸法事理不二趣舉一法咸具事理理體具足名理總雖同趣一理而諸法宛然名理別此性具三千也緣起諸法以即性故隨舉一法諸法咸趣名事總雖同趣一法而諸法宛然名事別此變造三千也是則三千諸法法法即性法法起修法法終日不失自體法法終日同趣剎那雖各有總別其實事理互融圓解雖爾若欲修觀必須揀難從易的指一念心法為總則玅觀易成故四明云若事若理皆以事中一念為總則又得一家立行造修之旨然此既約兩種三千會之則修性體用無住本法不變隨緣皆一揆矣又知荊溪明乎總別之意欲顯諸法互攝一一性遍故也以互攝故法法為總以性遍故別體宛然故四明云諸法不失自體為別即性遍也同趣剎那為總即互攝也。",
    "X56n0931_001:0436b21_0": "△二何者下雙示二初別。",
    "X56n0931_001:0436b22_0": "何者初十如中相唯在色性唯在心體力作緣義兼色心因果唯心報唯約色十二因緣苦業兩兼惑唯在心四諦則三兼色心滅唯在心二諦三諦皆俗具色心真中唯心一實及無準此可見。",
    "X56n0931_001:0436c01_1": "【觧】前雙標中先總次別今雙示中乘其義便先別次總又欲攝別入總故也十如中本末究竟文略不對鈔中點出因緣束為三道。",
    "X56n0931_001:0436c05_0": "【鈔】十如中相可別故屬色性據內故屬心觀音玄義指心為體而諸文中雙取色心力作單不能運緣或指愛或指具度既存兩說義必雙兼若云業為因者則似兼色今從習邊故因果皆心五陰皆報則須兼心今從受身約色義強本末究竟文雖不對既論三等同後三諦因緣中現未七支皆須雙具識名雖獨必含中陰故亦兩兼行有是業不可偏屬無明愛取唯心可知諸諦中苦同七支集既兼業道亦含戒皆具色心俗論諸法兼二可知滅及真中一實無諦體唯是理無相可表並心證故故不兼色然上所對不可永殊欲成別義故且從強。",
    "X56n0931_001:0436c16_1-0": "【觧】初消文然上下明意相性二法玄云相以據外攬而可別性以據內自分不改指心為體玄下云心覺苦樂故以當體(文)雙取者玄云地獄界以摧折色心為體人天以安樂色心為體等力作者功用名力搆造名作動作須是色心相應故云單不能運緣或指愛者止觀云無明愛等能潤於業即心為緣也玄云二乘以無明為緣六度菩薩以煩惱為緣或指具度玅玄云緣助也所謂諸惡我我所所有具度皆能助成習業(文)",
    "X56n0931_001:0436c16_1-1": "業因兼色者善惡之業皆以意為方便身口七支所造故兼色心今從習因而說故唯在心玄云如是因者惡習因也自種相生習續不斷以習發故為惡易成故名如是因(文)果屬心者玄云習果也如多欲人受地獄身見苦具謂為欲境便起染愛此習果也(文)五陰皆報既四陰屬心一陰屬色合兼色心今取受身為報故唯屬色亦從強而說本末等者玅玄初相為本後報為末所歸趣為究竟等(文)",
    "X56n0931_001:0436c16_1-2": "既論等者玄云若作如義初後皆空為等若作性相義初後相在為等若作中義初後皆實相為等(文)同後者真中唯心俗兼色心也七支皆名苦道須兼色心現五果中識本唯心今取含中陰色故亦兩兼此識託胎乘於中陰陰義屬色天眼能見身口屬色意業屬心故不偏屬無明等惑唯在心也諸諦者四二三一無諦通總而示四諦中苦同前因緣理須雙具集兼業者四諦法相合惑業二皆集諦收集是煩惱只唯在心既兼於業故通色心道即三學戒體屬色故雙具(此釋三兼色心)",
    "X56n0931_001:0436c16_1-3": "二諦三諦俗該依正故兼色心四諦中滅二諦中真三之真中一實無諦體並屬理無形相表故不兼色並內心證故唯在心示意者上將七科分配色心欲成別義一往從強若論諸法本來相攝又不可謂條然永殊。",
    "X56n0931_001:0437a23_0": "△二既知下次總。",
    "X56n0931_001:0437a24_0": "既知別已攝別入總一切諸法無非心性一性無性三千宛然。",
    "X56n0931_001:0437b01_1": "【觧】既解上科別分色心今當攝諸法差別歸剎那之總一切諸法別也無非心性總也既云諸法無非心性豈非攝別入總心屬事性屬理今欲於事顯理是故雙舉一性下正釋攝別入總之所以良由一性圓融無決定堅住之性立理事三千故能攝別以歸總也前云一念今云一性理事相顯也。",
    "X56n0931_001:0437b08_0": "【鈔】前約諸法不失自體為別今明諸法同趣剎那為總終日不失終日同趣性具諸法總別相收緣起諸法總別亦爾非謂約事論別以理為總又復應知若事若理皆以事中一念為總以眾生在事未悟理故以依陰心顯玅理故。",
    "X56n0931_001:0437b12_1": "【觧】釋攝別入總文相稍廣初釋前四句次釋後二句初又二初正釋二揀顯初文有三節初對前明攝別入總二性具下示事理各有總別三又復下明並以事念為總前別分色心為顯法法宛然不相混濫不失自體今明諸法元同一性故同趣剎那妄念別時常總總時常別總別同時故云終日亦為成觀故云剎那據圓詮玅旨法法為總亦可云同趣一塵也此之總別若事若理皆有此義故云性具等本具三千一法為總諸法為別一攝一切故云相收緣起三千既全性起亦以一法為總諸法為別亦皆融攝故云亦爾非謂下如前敘破應知理事三千皆以心法為總就迷而辨故云事念眾生全體在迷未嘗悟理須指事念不可以心為真心以依陰心觀顯不思議理故曰事念豈可不立陰等直觀不思議耶上云若事是事造緣起之事下云事念是迷妄之事現前一念云何能總事理諸法須知約此一念能具諸法名為理總所具諸法名為理別約此一念能造諸法名事總所造諸法名事別如此分之兩重總別自然不濫鈔云本具三千為別至咸趣一念也又序云介爾之心為事理解行之要即此謂也。",
    "X56n0931_001:0437c10_0": "【鈔】問他云一念即一性也一念靈知性體常寂又云性即一念謂心性靈寂性即法身靈即般若寂即解脫又云一念真如玅體又云並我一念清淨靈知據此等文乃直指文中一念名真淨靈知是約理解今云屬事是陰入法與他所指賖切如何。",
    "X56n0931_001:0437c15_0": "【觧】二揀顯中初問起他云者引示珠指文對今一念屬事並難凡引四文初是釋今總在一念云一性即一念也一念靈知性體常寂次釋修性門界如一念云性即一念德即法身般若解脫皆常樂我淨也今敵體示性德相謂心性靈寂性即法身靈即般若寂即解脫(文)第三文是未入文前懸敘不二唯心實相科云一一法界皆即一心真知玅體又云當知諸法不二唯心唯心無相具一切法故此十門門門之法皆名不二一一諸法當體通入名之曰門若一法入此一法外更無九門之法為異並我一念清淨靈知(文)據此四文並約理解今云屬事與他所見遠近如何賖遠切近。",
    "X56n0931_001:0438a03_0-0": "【鈔】答此師祇因將此一念約理釋之致與一家文義相違且違文者一違玄文彼判心法定在因佛法定在果眾生法一往通因果二往則局因他執心法是真性故乃自立云心非因果又礙定在因句復自立云約能造諸法故判為因佛定在果者乃由研修覺了究盡為果今問既將因果分判法相何得因果却不相對果若從覺因須指迷何得自立理能造事而為因邪既不相對何名分判又違華嚴心造之義彼經如來林菩薩說偈云心如工畫師造種種五陰一切世間中無法而不造如心佛亦爾如佛眾生然心佛及眾生是三無差別輔行釋云心造有二種一者約理造即是具二者約事即三世變造等心法既有二造經以心例於佛復以佛例於生故云如心佛亦爾如佛眾生然是則三法各具二造方無差別故荊溪云不解今文如何銷偈心造一切三無差別何忽獨云心造諸法得名因邪據他所釋心法是理喻論能具能造生佛是事唯有所具所造則心造之義尚虧無差之文永失矣又若約能造釋因則三法皆定在因以皆有二造故此文是今家立義綱格若迷此者一家教旨皆翻倒也焉將此解定教文之欠剩耶二違大意及金剛錍他自引云隨緣不變名性不變隨緣名心引畢乃云今言心即真如不變性也今恐他不許荊溪立義何者既云不變隨緣名心顯是即理之事那得直作理釋若云雖隨緣邊屬事事即理故故指心為不變性者佛法生法豈不即耶若皆即理何獨指心名不變性故金錍云真如是萬法由隨緣故萬法是真如由不變故故知若約萬法即理則生佛依正俱理皆不變故何獨心是理耶若據眾生在事則內外色心俱事皆隨緣故何獨心非事邪他云生佛是因果法心非因果驗他直指心法名理非指事即理生佛二事會歸心故方云即理亦非當處即具三千是知他師雖引唯色之言亦祇曲成唯真心爾。",
    "X56n0931_001:0438b12_1-0": "【觧】答中總斥他解違文背義別破初違文二違義初又二一違玄文二違大意金錍初引玄籤三法因果之文如前示他執等者敘他謬見示珠指云心法定在因者心非因果約能造諸法判為因也華嚴云一切唯心造心造諸如來等豈非十法界皆由心造佛定在果者由覺自心研修究竟名佛故云定在果也(文)今問下徵斥因果相對者對迷說覺既以研修究了名果則合判迷為因何云心法是理能造生佛之事故判為因耶又違等者前云心造諸法故判為因豈但違玄文又違華嚴心造一切三無差別之義須知心佛眾生三皆能造故云無差豈可獨云心能造耶故引彼經輔行委破輔行五中引經十八如來林菩薩說偈云心如工畫師至是三無差別若人欲了知三世一切佛應當如是觀心造諸如來不解今文如何消偈心造一切三無差別(文)",
    "X56n0931_001:0438b12_1-1": "如工畫師者畫師即無明心能造十界五陰故云種種一切世間即十法界假實國土等輔行釋初偈云言心造者不出二意一者約理造即是具二者約事不出三世三世又三一者過造於現過現造當二者現造於現三者聖人變化所造亦令眾生變心所造(彼文甚廣)今云三世變造指前二義等即等於聖人權造也問華嚴只云心造荊溪得何文意便作事理而釋答正得天台引造證具之義(如下辨)",
    "X56n0931_001:0438b12_1-2": "經以下四明例釋次偈別行玄記上云經文先示心造一切便以此心而例於佛示佛權造同心實造次復以佛而例於生示生實造同佛權造權實雖異因果暫殊三皆能造一切世間故得結云三無差別(文)不解天台引造證具之文如何消釋華嚴經偈心造一切(指初偈)三無差別(指次偈)輔行又云若無今家諸圓文意彼經偈旨理實難消(文)通指一家諸部圓文今此正指不思議境文也葢清涼華嚴大疏解釋此文以心為理為能造生佛是事為所造故斥云不解今文等也荊溪釋意三皆能造山外何獨以心為能造耶據他等者然示珠指本無顯文指心是理四明據他立義覈而破之義書六引珠指云佛名真覺生名不覺心即生佛之心非離生佛外別有心為生佛之本經示本末因果不二故云三無差別耳(文止此)",
    "X56n0931_001:0438b12_1-3": "四明斷云豈非謂心是非迷非悟之真心(註云心唯屬理)今云心法是理能具能造義書云此心迷則為生悟則為佛(今云生佛是事所具所造)此則只得一人心法少分(註以唯知事造生佛不知理具生佛二造雙明方〔明〕全分)今云心造尚虧殊不識法界有情十方諸佛生佛之全分因嗟珠指棄於大海而取一漚所得者如爪上土所失者如大地土(今云無差之文永失)",
    "X56n0931_001:0438b12_1-4": "故指要斷云心造之義尚虧無差之文永失以我一念及一切眾生十方諸佛各各論於事造人人說於理具而皆互具互攝方名三無差別(文)問心造義虧為理為事若云虧理他云心法是理若云虧事義書云唯知事造答義書明云唯知事造不知理具正當虧理他謂心是非迷非悟之真心此心迷則為生悟則為佛心能作生作佛豈非事造以約迷悟說故迷悟屬事也他云心法是理者他謂非迷非悟之真心故云心唯屬理非圓詮性具三千之理也問既云能具豈非理耶答他計真心遍一切處名之為具但有具名而無具義也又若等者若謂心能造法釋心在因應須生佛亦定在因以三法皆具二造故也以三無差別之文是一家所立不思議境觀心具造等義之綱格若以非迷非悟之理以釋心法乃成緣理斷九偏指真如則抑挫圓宗反同歷別之行故云翻倒也欠剩者山外謂玅玄類通十種三法合有觀心之文文無者略也光明玄十種三法圓談法性若更立觀心則是剩也義書十云玅玄但以三軌類通十法而已合有觀心一科彼文無者略也今之玄文雖帶十種法相並以一性貫之法性無外即我一心豈此之外而有法相不融更須附法作觀乎(文)",
    "X56n0931_001:0438b12_1-5": "焉可將此等見解定教文中之欠剩耶只緣山外纔見言心便作真理而釋謂圓談法性便是觀心故此斥之二造問大師於止觀不思議境引華嚴心造之文荊溪得何文意便作二造而釋況造謂造作正屬於事云何理中說造答荊溪得義符文葢圓宗大旨法理當然以一切法並由理具方有事用只一心造任運有事有理此得義也符文者止觀初明陰境引此文證正示境相即心生十界事造義也不思議境又引此文證心具十界理造義也輔行科云重牒初引示境相文前云心造即是心具故引造文以證心具又云不解今文如何消偈心造一切三無差別(文)",
    "X56n0931_001:0438b12_1-6": "故知正得引造證具文意乃作二造而釋也問指的玅境出自法華何故止觀正明玅境却引華嚴文耶答三千玅境出法華心造揀境出華嚴從所揀境以示玅境故重牒華嚴文雖引彼義歸法華以今經說因緣果報皆是實相因緣是能造果報是所造此之造義既在實相是故造義理本具足以此理造方有事造(別行玄文)問緣生事造其相易知理具三千其相如何答理無所在徧在於事即世間諸法是理造之相若爾以何為事造耶曰事造亦不出此若爾二造不分曰只一十界據心而分事理之殊以由此心有起有具約心體本具諸法即指諸法無非理造之相約起心變造十界即指十界諸法是事造之相諸法是一但約此心而分事理故曰只一非事非理之三千趣事趣理之不同輔行云一一修具無非理具鑑堂云理造之相不可別求只於事上覔也○二違大意金錍示珠指釋色心門心之色心引止觀大意云隨緣不變名性不變隨緣名心今言心即真如不變性也之色心即隨緣也(文)",
    "X56n0931_001:0438b12_1-7": "雖不引金錍由二文並明不變隨緣之義既違大意亦違金錍也隨緣不變名性即事之理也不變隨緣名心即理之事也他云心即不變之性直作理釋即不許荊溪立義也若云下縱釋以三法無差破之若言心法即理生佛亦然若知三法無差不可獨指心名不變性也引金錍文以顯事則俱事理則俱理既云萬法是真如則心與生佛俱理不獨指心為理既云真如是萬法則心與生佛皆隨緣事不可云生佛是事心非事也他云生佛是因果法者珠指云佛名真覺生名不覺心非因果如前引驗他所解既謂非迷非悟之真心正是指心為理他謂會生佛歸心方名事即於理須知一家圓說色心依正生佛剎塵一切諸法趣舉一法當處具足三千所以大師圓四念處六塵皆唯唯者無外之稱舉色則諸法趣色色外無法香等亦然四明云唯色之言非權唯實山外不曉雖引唯色之言克論其義只是唯心以不明諸法當處圓具須攝色歸心方具故也。",
    "X56n0931_001:0440a07_0": "【鈔】況復觀心自具二種即唯識觀及實相觀因何纔見言心便云是理又實相觀雖觀理具非清淨理乃即事之理也以依陰等顯故問若爾二觀皆依事如何分耶答實相觀者即於識心體其本寂三千宛然即空假中唯識觀者照於起心變造十界即空假中故義例云夫觀心法有理有事從理則唯達法性更無餘途從事則專照起心四性叵得亦名本末相映事理不二又應知觀於內心二觀既爾觀於外境二觀亦然此皆止觀及輔行文意非從臆說他云真心具三千法乃指真如名不思議境非指陰入也金錍云旁遮偏指清淨真如那得特偏指耶又云夫唯心之言豈唯真如心耶須知煩惱心徧第一記云專緣理性而破九界是別教義那得句句唯於真心又此標一念乃作一性真如釋之後文多就剎那明具三千亦作真如釋耶。",
    "X56n0931_001:0440a22_1-0": "【觧】以事理二觀破他指心為理初示觀心具事理因將此心作真理釋違背諸文況復一家所明觀心具乎二種謂唯識歷事實相觀理因何纔見言心便云是理次明觀理即事而顯今雖觀理非同他見清淨真如之理即迷事而顯理也三簡二觀皆依事答釋二觀之相此二各具能觀所觀所顯之義識心是境體是於觀本寂三千所顯也照是於觀起心是境變造十界所顯也云識云起即二觀皆依事也雖皆依事今以具變而分故云本寂三千變造十界也引義例心境釋疑例云問即此文中或云諸法即是法性或云四運四性推檢何者為要答夫觀心法等(文)",
    "X56n0931_001:0440a22_1-1": "直觀本寂三千不推四運故云更無餘途用自他共離四性推檢四運起心畢竟不可得故云專照等四運局事觀四性通事理然理觀亦觀起心但投足制縱不同今縱其所起屬已未正等故云專照理觀雖通四性但推本具理心且約所起對理自具而為研覈四運是所觀四性是能觀本末相映者本即理觀末謂事觀能觀皆是一心所緣莫非三諦故云相映不二者義書云須知事理不二之語得意之者隨修一觀必含二義如修理觀者雖云但觀理具須知全修在性則善修實相觀也修事觀者雖觀能造十界之心須知全性成修則善修唯識觀也豈令九旬常坐之徒皆須縱任善惡之念四運推檢耶豈令公私匇遽之徒皆須靜室觀理然後方名事理不二耶(文)",
    "X56n0931_001:0440a22_1-2": "四示外境具二觀孤山唯識觀外真如觀內直以內外二境分對事理四明立義內外皆修事理二觀內心二觀者上三三昧及諸經行法是理觀縱任三性是事觀外境二觀者觀色等諸法本具三千即理觀觀色等變造十界即事觀先輩或約外色生滅例心四運或約大經琉璃光菩薩非青現青等文殊云此光即是智慧大師謂是有分別色或云推過在心今謂內心約四運推檢者只緣此心但起慮想無色質可見故須推之若外境色法摐然在目何必推之但直觀一色變造十界即空假中即外境事觀也止觀輔行文意者結上內外各具二觀備見大師荊溪文中非任胸臆如隨自意歷六作六受即見色等豈非外境事觀耶他云等者重復結斥真心具法之謬前云心法是理能具能造驗他約真心攝於色具正指清淨真如名不思議境具足三千非指現前妄念陰入之心也傍遮等者義書云荊溪立於無情有性正謂顯圓妄染即佛性傍遮偏指清淨真如珠指正當金錍所遮云何將所遮之義為能釋之文如以毒刺損眾生之佛眼殊非金錍抉四眼之惑瞙(文)",
    "X56n0931_001:0440a22_1-3": "唯心等者義書云此則遮於世人約於真心說唯心義故云唯心之言豈唯真心應知唯字正屬唯心乃今約煩惱心說唯心不可約真如心說唯心豈非金錍本示無情有於佛性無情色與煩惱心二法俱約隨緣義說於隨緣中煩惱心為能造生死色為所造所造即理故既遍能造即理豈不遍耶(文)第一記者文句約教釋阿若憍陳如阿若翻無生別觀無生中云依於法界修菩提行記釋云依境起行專緣理性等謂緣佛界清淨真如而破九界自是別義今偏指真心正當此責今云總在一念以一性釋後文云三千因果不離剎那亦是真耶事理二觀義蘊經祖名出荊溪占察經云唯心識觀者所謂一切時一切處隨身口意有所作業悉當觀察等真如實觀者思惟心性無生無滅不住見聞覺知永離一切分別之相(文)",
    "X56n0931_001:0440a22_1-4": "義例引東陽大士詩云獨自精其實離聲名三觀一心融萬品荊棘叢林何處生(理觀)獨自作問我心中何所著推檢四運併無生千端萬累何能縛(事觀)止觀上三三昧及諸經行法是理觀第四縱任三性是事觀荊溪據茲文義而立顯名義例如前引輔行二下云觀有二種一者唯識謂一切唯心二者實相謂觀真如唯識歷事真如觀理(文)約何義分事理孤山據經唯識觀成得色寂三昧真如觀成得心寂三昧以二觀直對二境唯被一機謂先修內心觀成以此淨心歷外諸法即名事觀此說違文背義義書破云若以唯識為外觀者唯色之觀為在於何四念處約唯識唯色分於內外非不顯然上人何得故違宗教堅令唯識為外觀耶又義例顯云事觀專照起心四性叵得那對外境(文)",
    "X56n0931_001:0440a22_1-5": "又占察二觀雙被利鈍二機若謂觀成歷於外境名事觀者是則唯有理觀之機事觀無用也又不曉義例觀成歷法之文致茲謬說義例意云修內觀成內心若淨以此淨心歷外諸法任運泯合內觀既然外觀亦爾如義書三云自有初心便宜修外觀等如後內外門引占察唯識觀成得色寂三昧等者神智圓通記云須知占察知唯是心則於色界及諸外境不起分別所以經云色寂三昧非謂事觀專觀外色真如實觀思惟心性不生不滅以能超過無色四空心及心所二俱寂滅是故經云心寂三昧非謂理觀唯在內心(文)",
    "X56n0931_001:0440a22_1-6": "此說據經深可依用淨覺亦以二觀分對二境但約三諦分事理孤山義壞淨覺例然四明云觀於內心二觀既爾觀於外境二觀亦然(如前消文)二觀之相先達約二義分之制縱定投足具變分事理如上三三昧制心從理而修理觀隨自意中縱任三性名修事觀初義也鈔云實相觀者體其本寂三千宛然即空假中唯識觀者照於起心變造十界即空假中義書云事理二造既其不分事理二觀因何而起(文)",
    "X56n0931_001:0440a22_1-7": "次義也逸堂約起心不起心推運不推運分之如指要觀本寂三千為理觀照起心變造十界名事觀義例從理唯達法性從事專照起心是約起不起分之也上三三昧直觀一念本具三千名理觀隨自意縱任三性用於四運推檢起心變造十界名事觀推運不推運也或云二觀皆觀起心以眾生無始未嘗離念止觀修德境云心起必託緣(文)此心何嘗不起今謂纔言心起必有四運雖眾生日用妄心常起若修理觀直觀當念本具三千既云唯達法性體其本寂則知理觀非觀起心若云心起必託緣輔行釋云且約所起對理自具而為研覈其實但推本具理心(文)",
    "X56n0931_001:0440a22_1-8": "問上三三昧既唯理觀輔行何云或唯觀理答此釋第四三昧云是隨自意中從末從事而修觀法意謂自有諸經行法一科豈亦屬事故釋云如常坐等或唯觀理此正點諸經行法而言也問既以四三昧分對事理輔行何云修三昧者於此二途一不可廢答凡修三昧人有此二向於此二途須修一種不修理觀則修事觀故云也。",
    "X56n0931_001:0441c14_0": "【鈔】問永嘉集既用今家觀法彼奢摩他云一念即靈知自性他立正合於彼何謂不然答彼文先於根塵體其本寂作功不已知滅對遺靈知一念方得現前故知彼之一念全由玅止所顯不爾何故五念息已一念現前秪如五念何由得息那得將彼相應一念類今剎那念邪況奢摩他別用玅止安心毗鉢舍那別用玅觀安心優畢叉方乃總用止觀故出觀體中一念正是今之陰識一念也何者彼文序中先會定慧同宗法爾中乃云故即心為道可謂尋流得源矣故出觀體云秪知一念即空不空非空非不空言祇知者乃即體(止也)了(觀也)現今剎那是三諦理不須專亡根境顯其靈知亦不須深推緣生求其空寂故云秪知此乃即心為道也若奢摩他觀成顯出自性一念何用更修三觀問彼云若於相應一念起五陰者仍以二空破之那云不更修觀答於真知起陰以觀破之不起陰者何用觀之彼二空觀乃是觀陰非觀真知故知解一千從迷一萬惑若欲廣引教文驗其相違不可令盡書倦且止。",
    "X56n0931_001:0442a08_1-0": "【觧】永嘉大師與左溪同時嘗學天台教有集見行其間暗用天台三觀故云用今家等恐山外謬據彼文靈知自性以釋今文一念故茲料揀彼集有十大章第四奢摩他(玅止)第五毗鉢舍那(妙觀)第六優畢叉(止觀)彼奢摩他云得此五念停息之時名為一念相應一念者靈知之自性也(文)答中釋出彼文靈知一念乃是所顯與今文一念屬陰不同先於根塵等者彼云夫念非忘塵而不息塵非息念而不忘塵忘則息念而忘念息則忘塵而息忘塵而息息無能息息念而忘忘無所忘忘無所忘塵遺非對息無能息念滅非知知滅對遺一向冥寂閴爾無寄玅性天然(文)",
    "X56n0931_001:0442a08_1-1": "文中念即是根故云根塵息無能息忘無所忘故云體其本寂進修無間故云作功不已能知之念既滅所對之塵亦遺故云知滅對遺玅性天然即今靈知一念方得現前故彼靈知一念由修奢摩他玅止體其根塵本來寂滅五念停息方顯也五念者文云復次初修心人入門之後須識五念一故起二串習三接續四別生五即靜故起念者謂起心思惟世間五欲串習念者謂無心故憶忽爾思惟接續念者謂串習忽起知心馳散又不制心更復續前思惟不住別生念者謂覺知前念是散亂即生慚愧改悔之心即靜念者謂初坐時更不思惟世間善惡及無記等事即此作功故云即靜四念為病即靜為藥雖復藥病有殊總束俱名為念得此五念停息之時名為一念相應一念者靈知之自性也(文)",
    "X56n0931_001:0442a08_1-2": "斥彼謬據並難之非故云那得等也別用玅止者以彼所明止觀二法有於總別別則先止次觀總則止觀雙修對優畢叉總用故云別也對散用止對昏用觀總用止觀是彼正意故前云況次云方乃也出觀體中一念乃指摘彼文觀體中之一念恰與今文陰識一念是同彼第六優畢叉中十門初則言其法爾次則出其觀體定慧同宗者彼序云夫定亂分歧動靜之源莫二愚慧乖路明暗之本非殊至暗動之本無差靜明由茲合道愚亂之源非異定慧於是同宗(文)",
    "X56n0931_001:0442a08_1-3": "定即是止慧即是觀同宗即總用止觀也法爾者註云今古常然名為法爾謂真如之法法爾隨緣萬法俱興法爾歸性本自如斯故云法爾(文)即心為道者彼云一心深廣難思何出要而非路是以即心為道者可謂尋流而得源矣(文)即心為道鈔文自釋以玅觀體了一心是三諦理也立觀體者即文云第二出其觀體者只知一念即空不空非空非不空(文)立三觀之體也祇知者今釋即是用於止觀體了見前一念是三諦理故云即空等體了即能觀剎那是所觀三諦是所顯兩重能所蘊乎其中不須等者異奢摩他亡根境也彼一念對塵即是根境塵念俱忘靈知斯顯彼云忘緣之後寂寂靈知之性歷歷(文)",
    "X56n0931_001:0442a08_1-4": "深推等者亦不同毗鉢舍那也彼云一切諸法悉假因緣因緣所生皆無自性一法既爾萬法皆然境智相從于何不寂(文)此即推緣生求空寂也謂唯用止觀體了一念是三諦理故云只知等即法爾中即心為道之義也然若奢摩他中塵念俱忘顯出自性靈知相應一念則不須優畢叉中更修三觀因茲並難彼奢摩他既云此五陰者舉體即是一念此一念者舉體全是五陰歷歷見此一念之中無有主宰即人空慧見如幻化即法空慧(文)",
    "X56n0931_001:0442a08_1-5": "是則仍修二空之觀破其五陰何云不修觀耶答於相應一念起陰用觀破之不起則何須修觀況彼二空正是觀陰非是觀真初亦無妨故知下總結斥由不知一念是妄纔見言心便云是理故於諸文觸途成礙矣。",
    "X56n0931_001:0442c22_0-0": "【鈔】二違義者問據上所引眾教雖見相違且如立此十門欲通玅理亡於名相若一念屬事豈但通事將不違作者意乎答立門近要則玅理可通若敻指真如初心如何造趣依何起觀邪今立根塵一剎那心本具三千即空假中稱此觀之即能成就十種玅法豈但解知而已如此方稱作者之意若也偏指清淨真如偏唯真心則杜初心入路但滋名相之境故第一記云本雖久遠圓頓雖實第一義雖理望觀屬事他謂圓談法性便是觀心為害非少今問一念真知為已顯悟為現在迷若已顯悟不須修觀十乘觀法將何用邪若現在迷全體是陰故金錍云諸佛悟理眾生在事既其在事何名真淨然誰不知全體是清其奈濁成本有應知觀心大似澄水若水已清何須更澄若水未清須澄濁水故輔行釋以識心為玅境云今文玅觀觀之令成玅境境方稱理又解安於世諦云以正觀安故世諦方成不思議境故知心雖本玅觀未成時且名陰入為成玅故用觀體之若撥棄陰心自觀真性正當偏指清淨真如之責復招緣理斷九之譏且如今欲觀心為今剎那便具三千為須真知體顯方具三千若即剎那何不便名陰心為於玅境而須止真心邪又大師親令觀於陰等諸境及觀一念無明之心何違教邪應是宗師立名詮法未的故自別立邪又若謂此中一念不同止觀所觀陰等諸心者此之十門因何重述觀法大體觀行可識斯言謾設也又中諦一實別判屬心與總真心如何揀邪。",
    "X56n0931_001:0443a24_1-0": "【觧】假設問辭以理難事意在答出即事通理以顯專理則違義問中先領上違文次設難難意立此十門意令學者從門入理不滯名言今釋一念既屬於事莫違述作元意乎初總答初二句明觀妄之得正約一念近而復要即陰妄而通玅理也次三句明觀真之失若遠指佛界真如為所通初心何能造入抑亦觀無所託矣次今立下別答至作者之意廣上總中觀妄之得今文正意乃是趣舉根塵和合一剎那心當處具足三千三諦稱性而觀即能成就玄文因果自他十玅法相即以易通難之義若云十門通於玅理亡名離相但是開解荊溪述意為成玅行豈但解耶即妄顯真方稱述作之意若也至名相之境廣上總中觀真之失敻指真心而為所觀正同偏指真如唯於真心則杜絕眾生入理之門起觀之處但滋名相耳故第下引證理觀為要若以一念為真則不須修觀如云攬玄文教義歸止觀行心俾乎行者識法相之有歸達修造之無壅此但解知而已今立根塵一念為境玅觀觀之顯此十玅故知觀心為要文句四釋消經前之三釋望後觀心並屬事境玅樂釋疏因緣約教本迹觀心四釋文意云本雖久遠(本迹)",
    "X56n0931_001:0443a24_1-1": "圓頓雖實(約教)第一義雖理(因緣中世界為人對治並事第一義屬理)望觀屬事(三釋望觀心並屬事)他謂下舉妄毀觀心結斥葢有宋景德年間光明玄廣略二本並行於世慈光恩師製記曰發揮專解略本廢廣本十法觀心之文謂後人擅添清昭已下皆承其說謂十種三法是圓談法性不須觀心義書斥曰若剛廢此文則杜眾生入理之門趨果之路全迷一家解行之要故今云為害非少也今問下徵問一念為迷為悟初二句定若已下覈問金錍下引證眾生在事既其在事則一念屬妄何名真耶然誰下約譬顯染淨門云清濁雖即由緣而濁成本有濁喻迷中染心清喻果後淨心從來未悟故濁在前以驗此心是妄輔行下重引證觀妄顯真以識心為境如輔行五中初云前雖示體但直指心心為一切法之本故示體是心至是故今文玅觀觀之令成玅境境方稱理(文)",
    "X56n0931_001:0443a24_1-2": "此以前簡示境體一念識心為不思議境正是達陰成不思議也安住世諦如前釋故知下示觀妄意心雖本玅合全體是清觀未成時全體是迷須名陰妄今為成就玅法故用玅觀體之若撥下結斥成失既其棄妄觀真正當今錍傍遮之責復招玅樂專緣理性而破九界之譏且如下以今文止觀皆觀陰入徵斥只問今欲觀心為現今剎那妄陰即具三千為須顯悟真理方具若即妄示真正是以識心為玅何須別立真心又天台說止觀親令行人觀現前陰入并所發下之九境及四念處節節皆云觀一念無明心何得固違宗教別立真心恐是祖師立陰等名詮示行法未為的當而自立耶又若等者為防轉計若謂今文一念不同止觀陰等諸境猶更不可重述十門令觀行可識觀法大體行正解傍與止觀同成觀體等言皆成虗設矣又中等者以他立義反難於他彼謂理總事別今別分色心中諦一實諦體唯是理別屬於心今問此別中真心與總真心如何揀異若云是異皆是真心若云是同則總別不分況別判屬心正當理別何謂理中無別耶。",
    "X56n0931_001:0444a09_0": "【鈔】心性二字不異而異既言不變隨緣名心即理之事也隨緣不變名性即事之理也今欲於事顯理故雙舉之例此合云不變隨緣名佛隨緣不變名性生性亦然應知三法俱事俱理不同他解心則約理為通生佛約事為別此乃他家解心佛眾生之義不深本教濫用他宗妨害既多旨趣安在。",
    "X56n0931_001:0444a15_0": "【觧】釋無非心性心性二字通迷通悟楞嚴云常住真心性淨明體屬悟也義書云專是凡夫一念陰識之性矣在迷也今云心性不異而異事理相即故不異性屬不變之理心是隨緣之事而異也大意云不變隨緣名心乃即理之事隨緣不變名性乃即事之理今文雙舉欲就事顯理故也次以此心例彼生佛俱是即不變之隨緣皆即理之事亦應不變隨緣名佛名生故云亦然應知一家所論心佛眾生事則俱事理則俱理不同等者結斥山外濫用他宗華嚴大疏以心性為理為能造生佛是事是所造此是他宗解心佛眾生三無差別之義慈光不深台教兼講華嚴濫用此義妨害今家三法各具事理二造之旨。",
    "X56n0931_001:0444b04_0": "【鈔】一性等者性雖是一而無定一之性故使三千色心相相宛爾此則從無住本立一切法應知若理若事皆有此義故第七記釋此文云理則性德緣了事則修德三因迷則三道流轉悟則果中勝用如此四重並由迷中實相而立今釋曰迷中實相即無住本乃今文一性無性也上之四重即立一切法乃今文三千宛然也第一重既以性德緣了為一切法須以正因為無住本餘之三重既將逆順二修為一切法必以性德三因為無住本此即理事兩重總別也問既以迷中實相為一性對三千為別正當以理為總何苦破他答以三千法同一性故隨緣為萬法時趣舉一法總攝一切也眾生無始全體在迷若唯論真性為總何能事事具攝諸法而專舉一念者別從近要立觀慧之境也若示一念總攝諸法則顯諸法同一真性故釋籤云俗即百界千如真則同居一念須知同一性故方能同居一念故以同居一念用顯同一真性非謂便將一念名為真諦豈同居一塵非真諦邪今文以一性為總前後文以一念為總葢理事相顯也此之二句正出攝別入總之所以也由一性無性立理事三千故故兩重三千同居一念也豈同他釋直以一念名真性耶。",
    "X56n0931_001:0444c01_1-0": "【觧】釋後二句初文性雖至宛然是正釋一性即性體也無定性乃性計之性也以性有二真常不變隨緣染習上云一性不變性也下云無性染習性也謂此性體雖是真常一理而其性融玅不決定亦是三德秘藏無堅住性也故此玅性具足三千次會同本法今文一性無性即無住本三千宛然即所立法應知理事三千各有本法故云皆有引第七記四句立法因疏釋經一相一味云一相即無住本立一切法無住無相即無差別立一切法即有差別(文)",
    "X56n0931_001:0444c01_1-1": "記釋云一相即無住本立一切法理則性德緣了事則修德三因等此之四句即是兩重立法初云理則性德緣了(性德正因為本性德緣了為所立法)事則修德三因(順修)迷則三道流轉(逆修)悟則果上勝用(亦屬順修從因至果果必化他故云勝用次三重皆以性德三因為無住本)四句立法皆本經疏如下委辨今釋等者會釋今文彼云四重並由迷中實相而立即無住本且前三重可得由迷第四果用亦從迷立耶曰果由因克故亦由迷理以果地融通並由理本上之四重不出理事三千各有本法修有逆順因必克果故有四重此即下會同事理總別者初以性中正因為本即理總性德緣了為所立法即理別次以性德三因為本即事總逆順二修為所立法即事別今問次重既云性德何名為事既云三因安得目總答雖云性德全體在迷雖曰三因只一實相故云並由迷中實相而立若爾初重正因亦是迷中實相那云理總答正由若事若理皆以事念為總其義宛齊問答去料揀事理初約性本同理總問既將本法會釋今文迷中實相乃今文一性無性則一性是總三千是別一性既是實相正當理總答謂諸法性同俱得為總今為成觀從要指心以三千色心同一真常不變之性全不變性隨緣變造諸法諸法既同一性故趣舉一法總舉一切眾生從本已來未曾離念須就迷點示若以真理為總何能諸法互攝故今專指一念是於諸法中別就近而復要立乎觀境既知一念總攝方顯同一真性乃即妄而顯真故引籤文證今一念為總彼文因明七二諦境初約跨節意存略而示故云但點法性為真諦無明十二因緣為俗諦於義即足籤釋云唯一法性以對無明至只點一法二諦宛然俗即百界千如真則同居一念(文)",
    "X56n0931_001:0444c01_1-2": "帖今文意百界千如乃今文三千宛然也同居一念乃今文一性無性也功由諸法同一真性故得同居一念之總今以事顯理達妄成真故以一念用顯一真山外何得作真理釋須知圓詮諸法互攝互具今為成觀故的指心且云同居一念若同居一塵豈非真邪今文下結示初後點文意前云總在一念後云寧乖一念前後文也一性是理一念指事即事之理故云一性即理之事故云一念即相顯也此一性無性三千宛然二句正明所以由於從總立法故得攝別入總也無住本諸大乘經出處非一文義最顯莫若淨名經中卷",
    "X56n0931_001:0444c01_1-3": "觀眾生品文殊問淨名曰善不善孰為本答曰身為本(見一切住地)又問身孰為本答曰欲貪為本(欲愛住地)又問欲貪孰為本答曰虗妄分別為本(色愛住地)又問虗妄分別孰為本答曰顛倒想為本(無色愛住地)又問顛倒想孰為本答曰無住為本(無明住地)又問無住孰為本答曰無住則無本文殊師利從無住本立一切法(文)楞嚴第七佛語阿難本此無住建立世界及諸眾生(文)",
    "X56n0931_001:0444c01_1-4": "大師不見法華藥艸喻品一相一味亦其義也天台引用一如玅玄約理事明本迹二如文句釋經一相一味三如文句釋方便品十雙權實初約理事四如光明玄逆順兩番生起無住本義四明約無堅住義釋捨遺記上云都由三德秘密法性無堅住性是故大聖以此法性無住為本(文)別行玄記下云以本覺性元離住著即無住本指要云性雖是一而無定一之性(文)淨覺義編云有云無住本者謂性不定住也真如非寂非照而寂而照是性不定住無明體空立一切法亦是性不定住此釋無據葢未看本疏也疏解無住則無本云無明依法性法性即無明無二無別豈得性還依性當知無明則無本又解無住義云即無始無明也以身見等惑皆有所依而起起則有始此無所依起亦無始故云無始無明即是無住以此明之無住是無依義何嘗云性不定住耶(文)",
    "X56n0931_001:0444c01_1-5": "破四明無據自憑本疏是無依義今謂疏約無依義釋經無住則無本何得錯引以釋無住本耶四明無堅住義深得荊溪文意玅樂云此無住本具如釋籤第七已釋籤云法性即無明法性無住處無明即法性無明無住處無明法性雖皆無住而與一切法作本(文)玅樂云無住即本名無住本(文)次辨四句立法玅樂因釋疏一相即無住本立一切法云理則性德緣了事則修德三因迷則三道流轉悟則果中勝用如此四重並由迷中實相而立(文)",
    "X56n0931_001:0444c01_1-6": "荊溪立此四句正得經疏元意理性本法即經云一相至寂滅相疏釋云眾生心性即是性德解脫遠離寂滅三種之相修德三因即經云一味疏釋云如來一音說此三法即是三味此三相則為境界緣生中道之行記云由佛說故此性可修重指性三以為修境三道流轉即疏云性德只是本有三道解脫相者即是業道解脫德離相者即是煩惱道般若德寂滅相者即是苦道法身德果中勝用即經云究竟至于一切種智疏云終則得為一切智果經疏但云自行證果既有自證後必化他故云勝用又符圓詮教旨初重為彰性德本具故以正因為本緣了為所立法即理具三千次重為彰全性起修故以性三為本修三為所立法即全體起用變造三千也指要引此會釋一性無性三千宛然者葢為他師指心為理生佛是事理唯是總事唯是別故特引修性各有本法以顯事理皆有總別也又四明直作兩重而用如云第一重既以性德緣了為所立法須以正因為無住本餘之三重即將逆順二修為所立法必以性德三因為無住本(文)",
    "X56n0931_001:0444c01_1-7": "初重約性中三法自分次重約修性相對淨覺不許雜編云近人持論多任胸臆無住差乎一性立法謬於二修本末相紛源流一混又云初重可爾餘三不然他意謂餘之三重是離三法門既將修德三因為所立法必以性德三因各相主對為無住本斯乃不知修性離合之旨何者約性雖離對修須合由性中了因未曾發心緣因未曾加行同名正因修中正因即了因所照緣因所嚴只是無住本耳記云事則修德三因對本兼舉也例如智者解無量義經從一法生四果荊溪云圓佛為一而生三權能所相對故云四佛今亦如是正因為本而生緣了修性相對故云三因又修性不二門云修雖見九九只是三例今修雖具三三只是一(文)",
    "X56n0931_001:0444c01_1-8": "淨覺意謂無住只是一性立法但可二修若判餘三重以性三為本即是以二修差雜一性(故云無性差乎一性)修三為所立法即以一性謬亂二修(故云立法謬於二修)以修差法故末紛於本以性謬修故本紛於末(故云本末相紛)今謂四重立法是荊溪本經疏元意既將三因三道為所立法必以性三為無住本若破四明即破荊溪也約性恒開對修方合是性種三道敵對三德對卻類種合性三為一即修性相形義今文是修性各三法相修性相對義何得妄破四明不知修性離合耶又若謂修德三因是對本兼舉者三道流轉亦應爾邪淨覺立義皆為不善圓實教中修性法體各具三法未嘗聞性但正因修但緣了進不成圓退不成別也會光明玄十種三法逆順兩番生起初約施教逆推理顯由事是逆生起次約立行造修反妄歸真是順生起初從法性無住本立一切教法二從無明無住本立一切行法以四句會之拾遺記云今之初番是彼第四果中勝用今之次番是彼第二修德三因(文)",
    "X56n0931_001:0444c01_1-9": "淨覺謂十種三法中三因佛性即初二兩句正因佛性本具二修即性德緣了緣了二修共發一性即修德三因逆順兩番生起即三四二句無明為本立十種三法即三道流轉句法性為本立十種三法即果中勝用句如此會釋本法顛亂何得於十種中特取三因分折對當初之二句其餘九重何不對耶二從無明無住立一切行法乃立行造修是順生起何云三道流轉耶會兩重總別指要云第一重性德緣了為所立法須以正因為本餘三重以逆順二修為所立法必以性三為本此即理事兩重總別也(文)",
    "X56n0931_001:0444c01_1-10": "舊問兩重之本並屬於理兩重之總並在於事又次重本法性三為本兩重之總並是一念事理不同三一有異如何會同北峰云兩重總別就法故並以事念為總兩重本法推功故並以理性為本何者兩重總別並由一性故能總在一念就法在迷在事以事為總推功歸性亦得以理為總故四明云今文以一性為總事理相顯也兩重立法雖推功由理以理為本既以實相在於迷中當知就法亦得以事為本夫如是則從總別推功與本法齊從本法在事與總別等問淨名疏云法性即無明無二無別當知無明無本籤云法性即無明法性復以無明為本(文)",
    "X56n0931_001:0444c01_1-11": "淨名即故無本籤云即故為本何耶答淨名疏釋無住則無本籤釋無住本故法性無明相即互得為本問玅樂明四句立法之後云具如釋籤第七已釋且籤文無四句立法何虗指耶答正指釋無住本義非指四句立法也。",
    "X56n0931_001:0446c17_0": "△二當知下就理事明諦境二初約理事明三諦二初明理事。",
    "X56n0931_001:0446c19_0": "當知心之色心即心名變變名為造造謂體用。",
    "X56n0931_001:0446c19_1": "【觧】大科就理事明諦境者前明總別未分事理今明事理俱有總別初約事理明三諦者理具事造咸空假中故先明理事次結三諦也初言心者能具剎那之心即理總也色心者所具三千即理別也即心者即上能具三千剎那之心事總也名變者即事造三千事別也變名為造者此變亦名為造隨緣變造非搆造也此即事理兩重總別此之變造乃全體之用故云造謂體用。",
    "X56n0931_001:0447a04_0": "【鈔】心之色心者即事明理具也初言心者趣舉剎那也之者語助也色心者性德三千也圓家明性既非但理乃具三千之性也此性圓融徧入同居剎那心中此心之色心乃秪心是三千色心如物之八相更無前後即同止觀心具之義亦向心性之義三千色心一不可改故名為性此一句約理明總別本具三千為別剎那一念為總以三千同一性故故總在一念也。",
    "X56n0931_001:0447a11_1": "【觧】先正釋次料簡初又三初釋初句理具總別心之至念也初句牒文即事明具總標也即事標心字理具標色心初言下釋圓家下出意圓論性德非別教但中之理具法之性也圓融徧入者無一法偏謂之圓無一法異謂之融法法周遍法法互入只由諸法性體圓融互遍互入故同居剎那也此心下絕能所上明色心諸法同居一心謂有能具所具今絕此計故云只能具心即是所具三千色心如彼八相遷物不分前後相在物前物在相前則不被遷只物論相遷只遷相論物謂無前後是故云祗具如止觀不思議境止觀心具正指玅境文也止觀云一念即三千三千即一念一念不在前三千不在後(文)八相者大小各四謂生住異滅輔行釋云相為能遷物為所遷俱舍云此謂生生等於八一有能謂本四相及隨四相名之為八大相為本小相為隨以此八故令一切法成有為相言生生者謂小生生大生於八一有能者謂小相於一有能能生大相大相於八有能謂一大相起時必與三大相及小四相俱起并一本法故云八相餘三大相亦復如是故此八相望於本法不前不後心具三千亦復如是三千如八相一心如本法(文)亦向心性指上無非心性此三千色心在因在果不可改變故名性德此一下結成總別此理總別亦事念為總。",
    "X56n0931_001:0447b11_0": "【鈔】即心名變等者即上具三千之心隨權淨緣不變而變非造而造能成修中三千事相變雖兼別造雖通四今即具心名變此變名造則性屬圓不通三教此二句則事中總別變造三千為別剎那一念為總亦以三千同一性故故咸趣一念也。",
    "X56n0931_001:0447b15_1": "【觧】釋即心名變名事總別即心名變者牒文即上下釋即心也即上來具德剎那之心隨染下釋變造文謂真如不變之性能隨染淨二緣變造十界諸法不變等者全性變造故云不變非造變雖下釋變造義金錍云變義唯二故云兼別造通於四藏通論業惑搆造造變雖通具義則局以通從局即具名變變亦名造三義俱圓也此二下結成事中總別。",
    "X56n0931_001:0447b24_0": "【鈔】造謂體用者指上變造即全體起用故因前心具色心隨緣變造修中色心乃以性中三千為體修起三千為用則全理體起于事用方是圓教隨緣之義故輔行云心造有二種一者約理造即是具二者約事乃明三世凡聖變造即結云皆由理具方有事用此文還合彼不。",
    "X56n0931_001:0447c05_1": "【觧】釋造謂體用初句牒文指上至起用者總標故因下釋因前心具色心指上理具隨緣變造修中色心指上事造乃以下二句釋今體用則全下二句釋出全體起用即不變隨緣方成圓教隨緣之義引文證同者一者約理同今心之色心二者約事同今即心名變等皆由理具方有事用同今造謂體用二文若合符節矣。",
    "X56n0931_001:0447c13_0": "【鈔】問變名本出楞伽彼云不思議熏不思議變故造名本出華嚴彼云造種種五陰故華嚴唯有二教楞伽合具四教何故金錍云變義唯二造通於四答部中具教多少雖爾今約字義通局不同何者大凡云變多約當體改轉得名故變名則局若論造者乃有轉變之造亦有搆集之造故造名則通別圓皆有中實之性是故二教指變為造藏通既無中實之體但明業惑搆造諸法不云變也大乘唯心小乘由心故云變則唯二造則通四。",
    "X56n0931_001:0447c21_1": "【觧】簡變造所出用與所出謂二經用與如金錍正約部中具教多少以難不思議熏理具也如云真如內熏輔行云真如常熏內具亦云舊熏不思議變即事造楞伽部屬方等故具四教金錍云變義唯二今云等者等上熏義答中謂不約部中具教多少以論乃約字義通局而說先釋變義變謂轉變由中道實性玅不決定故受熏變當體改轉義也此義唯局別圓次出造義有二轉變搆集別圓同詮中道實性當體改轉名造此釋轉變名造藏通灰斷不談常住故云無中實體但明見思煩惱潤有漏業搆六凡生死非轉變造此釋搆集造也金錍云藏通造六業惑造也別圓造十轉變造也唯心結上轉變由心結上搆集大乘所說諸法唯心故論轉變小乘由業力造造遍三界故云搆集。",
    "X56n0931_001:0448a12_0": "【鈔】問他云造謂體同及改此文二十來字而云收得舊本又云勘契多同今何違舊答舊本諸文全無錯邪應是荊溪親書本邪又多本同者止如杭州十藏中台教頃曾略讀錯字不少豈非初將一本寫之一本或錯十處皆訛又云日本傳來別行十門題云國清止觀和尚錄出亦云體同等者未審止觀和尚又是誰耶此人深諳一家教不始錄之本全不錯不豈以先死之人遵之為古所立之事皆可依耶如乾淑所錄邃和尚止觀中異義乃以三界為無漏總中之三可盡遵不況諸異義特違輔行自立己見故皆云記文易見和尚云云此師又稱第七祖故知止觀和尚多是此師若其是者則全不可依既暗荊溪深旨必有改易也又日本教乘脫誤亦多唯有別行十不二門則全同他所定之本他既曾附示珠指往於彼國必是依之勘寫爾設是舊本須將義勘莫可專文。",
    "X56n0931_001:0448b03_1-0": "【觧】簡謬本改字違文示珠指云有別行本云造謂體用者近人謬故也或者意云造是體之用而不知此文正示色心全真如變色心不異本性故云體同及改二十來字者下文多一差字內外門除兩假字改終自炳然為終日炳然修性門藉智起修為藉知曰修一期為其字因果門三千並常為三身並常染淨門除二與字自他門形事不通為未通三業門若信因果除因果二字此皆示珠指據舊本改除也以舊本多同為問先答舊不可依次答多本同者錯字亦多日本傳來等者亦契勘多同中義故亦云體同也國清等者淨覺雜錄名義云唐貞觀十一年有日本僧最澄乃天台道邃門人邃即荊溪弟子澄初傳教歸國以道邃為始祖封山曰天台造等曰國清自是教法大行於彼今云止觀和尚即邃師也乾淑僧名有文集抄錄邃師所釋止觀異義邃師暗於止觀之義多有異見與荊溪所釋相違如釋止觀無漏總中三謂於三界有漏法上證於無漏止觀一明漸次止觀云先修歸戒翻邪向正止火血刀達三善道次修禪定止欲散網達色無色定道次修無漏止三界獄達涅槃道次修慈悲止於自證達菩薩道後修實相止二邊偏達常住道輔行云此中番數但有五重義則十三初番有六謂三善三惡第三番四謂兩教二乘并前六義合為十也餘三不開合為十三於十三中實相是所緣之境望頓是同不應數為不同之限(文)",
    "X56n0931_001:0448b03_1-1": "止觀下文料揀三種止觀騰疑者云教境名同相頓爾異釋曰然同而不同漸次有六善惡各三無漏總中三凡十二不同從多而言故言不定輔行云兩教二乘是無漏四而今乃云無漏總中三者何耶別而言之離為四人若總名無漏則合郤三人但存一位今舉總合開一中兼三故名無漏總中三也若沒本位離而為四并善惡各三及以禪定慈悲各一故成十二(文)和尚云云者乾淑所錄異義甚多今不煩引故此指之稱第七祖者謂天台已下至邃師當第七也設如所言收得舊本須以義勘豈可專文而害於義。",
    "X56n0931_001:0448c16_0": "【鈔】問文縱難定義復相違何者此文攝別入總合云變造體同若云從體起用還是開總出別既失不二之義便無開會之功也答若得前之總別意者則是不執舊訛文也豈理體唯總事用唯別如常坐中修實相觀既云唯觀理具文中廣辨三千還有總別不若無者那云一心具三千邪隨自意中修唯識觀觀於起心即約變造事用而說還有總別不若無那云一切法趣檀等那云觀一念善惡心起十界邪豈隨自意三昧非不二開會觀耶應知立茲體用欲於理體及以事用皆明三諦事用若即空假中還成不二圓玅不既於理事兩重總別皆顯絕玅那將攝別入總而為難邪又夫開顯乃示法法皆玅若知即具而變用豈不玅耶。",
    "X56n0931_001:0449a04_1": "【觧】揀謬釋從訛暗義初依謬立難此文攝別入總者他不明事理各有總別乃指前別為歷境顯示別相從即知下為攝別入總正示歸宗從當知下為結顯不二故云此文攝別入總也只由他謂理總事別故攝別入總是攝事歸理也合云變造之事與理體同若云從體起用還成開理總而出事別他謂體同等文正是結顯不二故云則失結顯不二之義他云今文變造體同唯約法華圓門開顯以同示體令曉變造色心性常不二故云若作從體起用則無開會之功也二據正決答初總示正斥邪若得前文正釋總別之意謂理具事用各有總別也豈理唯總事唯別耶如常下徵事理總別文義正指下文不思議境以下十乘名通四行常坐居首故先言之唯觀理具者荊溪云實相觀理廣辨三千正是不思議境一心是總三千是別理中總別也隨自意乃五略修大行縱任三性推四運心即唯識觀歷諸善中不出六度一切法是別趣檀是總等謂餘五度也止觀云一切法趣檀成摩訶衍是菩薩四運又一念是總十界是別四種三三昧玅行皆依法華絕待玅義而為觀體豈非不二開會觀耶應知下彰事理總別皆玅應知今明理事總別欲於體用結成三諦故下文云非色非心等法法皆玅者正示事造諸法全具而變理具既玅事變亦然。",
    "X56n0931_001:0449b05_0": "【鈔】問他云之猶往也即全真心往趣色心則全理作事此義如何答非唯消文不婉抑亦立理全乖何者心不往時遂不具色心耶又與心變義同正招從心生法之過況直云心是真理者即乖金錍釋心既云不變隨緣名心何得直云真理又造謂體用方順文勢如何以同釋造。",
    "X56n0931_001:0449b10_1": "【觧】簡謬執訓釋乖理他云等者珠指云之往也非助語也謂全性往趣故云之色心爾雅云之者往也般若云一切法趣色是趣不過(文)答中初斥消文立理俱非若云真心往趣殊非性德本具次斥義同生法心之色心正明理具若云往趣卻與即心名變義同全同別教從心生法則四性計中墮自性過次斥指心為理公違大意金錍不變隨緣之義金錍云萬法是真如由不變故故知諸法皆理何獨指心為理如前已明今但云即乖彼文不變隨緣名心乃即理而事何得直作理釋又造下重破體同之謬以全體起用名造謂體用文方宛順。",
    "X56n0931_001:0449b22_0": "【鈔】問若真心往作色心有從心生法之過者文云即心名變亦有此過邪答不明剎那具德唯執真心變作灼然須招斯過今先明心具色心方論隨緣變造乃是全性起修作而無作何過之有。",
    "X56n0931_001:0449c01_1": "【觧】揀心變對謬顯正問中牒前生法以難心變初至過者牒前真心往趣義同生法次文云至過耶並難即心名變亦應招過答中約心變異性具通難初順問答謂若不明具單云心變豈免斯過今先下違問答今既先云心之色心即是理具次云心變是隨緣變造全具而變全性起修何過之有。",
    "X56n0931_001:0449c08_0": "【鈔】問即心名變此心為理事邪若理者上約隨緣名心若事者乃成事作於事那言全理起事答止觀指陰入心能造一切而云全理成事者葢由此心本具三千方能變造既云心之色心已顯此心本具三千今即此心變造乃是約具名變既非但理變造自異別教也。",
    "X56n0931_001:0449c13_1": "【觧】揀即心名變全理成事答中以止觀例顯今文葢由此心本具三千方能變造即並由理具方有事用也今既先明心之色心已顯心具次云心變即全具而變既非等者以由變造義通別圓復須此揀既全具而變不同別教但中之理隨染緣造九界也。",
    "X56n0931_001:0449c19_0": "△二是則下結成三諦者。",
    "X56n0931_001:0449c20_0": "是則非色非心而色而心唯色唯心良由於此。",
    "X56n0931_001:0449c20_1": "【觧】結成三諦結上事理總別無非玅三諦也。",
    "X56n0931_001:0449c22_0": "【鈔】上之事理三千皆以剎那心法為總心空故事理諸法皆空即非色非心也心假故事理諸法皆假即而色而心也心中故事理諸法皆中即唯色唯心也故輔行云並由理具方有事用今欲修觀但觀理具俱破俱立俱是法界任運攝得權實所現言良由於此者即由心之色心故(理也)即心名變故(事也)全體起用故(理事合也)方能一空一切空一假一切假一中一切中也他解此文分擘對當大義全失仍不許對三諦而云此中未論修觀故設未修觀立諦何妨況此色心本是諦境更有人互對三諦云得圓意葢不足言也。",
    "X56n0931_001:0450a08_1": "【觧】初正釋上云心之色心即心名變心及即心豈非剎那為總色心即理具三千變造即事用三千非色非心破也而色而心立也唯色唯心法界絕待也引輔行文初二句證事理三千俱破等證結成三諦只觀性具三千任運攝得事造三世變造是九界實造聖人變化是佛界權造權實皆事猶同示現俱破等者若云三千俱破是空俱立是假法界是中即名隨德用若云三諦俱彰蕩相故云俱破三諦俱彰立法故云俱立三諦皆顯絕待故俱法界即體一互融一空一切空等可見他解下斥謬珠指云非色非心顯上心性也(上云一切諸法無非心性)而色而心顯上之色心唯色唯心顯上體同唯心不二也(文)不許對諦彼云有人用對三觀三諦非色非心對空真而色而心對俗假唯色唯心對中今謂此是圓法若隨自意何法不通豈止三觀諦耶此門本依諸諦境立既攝別入總以明色心唯顯色心不二至內外門對境明智方辨觀智(文)互對者昱師註文云淨光大師點讀云非色非心真諦也而色而心俗諦也唯色唯心中諦也予之書曰非色非心中諦也而色而心俗諦也唯色唯心真諦也一家玅旨三諦讀經愚今註曰是相如色即真諦如是相色即俗諦相如是色即中諦一如三諦等乃至不縱不橫不並不別如斯消釋奇哉暢哉快樂哉何法華三昧之遠乎旋陀羅尼之異耶(文)故斥云云得圓意葢不足言。",
    "X56n0931_001:0450b10_0": "△二故知下會生佛居一念。",
    "X56n0931_001:0450b11_0": "故知但識一念遍見己他生佛他生他佛尚與心同況己心生佛寧乖一念。",
    "X56n0931_001:0450b12_1": "【觧】理事三千全心本具即具而變全體之用故知但了見前剎那為諸法總則能徧見理事三千己他生佛者九界為生極果為佛心具十界名己生佛生佛各具十界名他生佛以他況己謂生佛三千之高廣尚與心同況近在自心之所具寧乖一念。",
    "X56n0931_001:0450b18_0": "【鈔】己生佛者心法三千他生佛者佛法眾生法並名為他各具三千三千不出生佛也以理攝事同趣我心葢心之具故即心變故全體用故故識一念即能徧見也。",
    "X56n0931_001:0450b21_1": "【觧】釋云以理攝事謂理具攝得事造既全理成事理既舉一全收故使事中同趣一念此釋但識一念遍見己他生佛。",
    "X56n0931_001:0450b24_0": "△三故彼下結不二。",
    "X56n0931_001:0450c01_0": "故彼彼境法差差而不差。",
    "X56n0931_001:0450c01_1": "【觧】結上不二彼彼等者己他生佛之境迷悟高下之別既同一心故云差而不差也。",
    "X56n0931_001:0450c04_0": "【鈔】可見他云此本多一差字存略無妨不須苦諍。",
    "X56n0931_001:0450c05_0": "【觧】他云者珠指云有別行本多一差字亦近人添也(文)四明意謂存略無在。",
    "X56n0931_001:0450c08_0": "十不二門指要鈔詳解卷上末"
}