{
    "X56n0937_003:0588a01_0": "金剛錍釋文卷下",
    "X56n0937_003:0588a02_0": "荊谿尊者湛然撰六夢居士虞淳熙訂",
    "X56n0937_003:0588a03_0": "天台沙門時舉釋二華居士施浚明閱",
    "X56n0937_003:0588a04_0": "客曰仁所立義灼然異僕於昔所聞僕初聞之乃謂一草一木一礫一塵各一佛性各一因果具足緣了若其然者僕實不忍何者草木有生有滅塵礫隨劫有無豈唯不能修因得果亦乃佛性有滅有生世皆謂此以為無情故曰無情不應有性僕乃悞以世所傳習難仁至理失之甚矣過莫大矣。",
    "X56n0937_003:0588a10_0": "自從文初立義乃至四十六問所立之義善符經宗灼然異僕於昔所聞無情無佛性也僕初聞者即初前來不覺寱云無情有性如此則今所聞與昔所聞碩異所以驚駭初聞之時將謂一草一木一礫一塵各各自有一佛性修自修他從因至果各各具足緣了二因佛性若其然者僕忝尋釋教薄究根源實不忍聞斯義何者且如草木春生夏長秋凋冬落生滅不止塵礫隨其成住壞空有無若謂無情有性者非但不能修因得果亦見佛性有生滅耶世人皆謂此之草木等為無情故曰無情不應有性今聞仁所立義乃約惟心體具三無差別而明無情有佛性故今悔云僕乃誤以世所傳習難仁至理失之甚矣過莫大矣。",
    "X56n0937_003:0588a23_0": "余曰子何因猶存無情之名客曰乃僕重述初迷之見今亦粗知仁所立理只是一一有情心徧性徧心具性具猶如虗空彼彼無礙彼彼各徧身土因果無所增減故法華云世間相常住世間之言凡聖因果依正攝盡。",
    "X56n0937_003:0588b04_0": "此文由野客所聞乃至無情不應有性是故荊谿重責前來既信一切法皆正因性開導情懷已竟何故猶存無情之名耶故下野客便云乃僕重說昔日所迷之見非謂今日已蒙開導解佛性矣復更猶存無情之名也重述初迷指前云僕初聞之文昔日曾有此迷今日重述此乃荊谿覈定野客今日之見不可混濫今則不然亦粗知仁所立理矣不出具徧之旨即前文今立眾生正因體遍經文亦以虗空譬之及故達惟心了體具者焉有異同三無差別果性身土霑於瓦石等義也今先點其大意然後消釋問今文正是領解無情有佛性何故却云只是一一有情心遍性遍乃至攝盡如此則正同孤山顯性云此文既一一有情心遍云何輒云身土自具三千耶文若爾則正合孤山觀心具三千獨頭之色不具三千耶答若能洞見生佛依正一念具足一塵不虧直下現成本來同體只緣眾生惑於知見妄自分別所以色心派分依正角立分情無情此乃眾生情想誠非佛性有殊祖師正要就迷點示眾生所以多約有情之心示佛性遍故多云色即於心又欲從於近要成內觀義故且約惟心而說孤山不達此義但見祖師一文一義約心論遍便謂色不具三千耶故十義書云上人堅據金錍心具三千談佛性者蓋由彼文正顯佛性遍義以佛約有情說故多明色即於心故知若信諸色即心則成無情有於佛性義也亦為成於內觀義故故且約惟心而論以諸教文正被下界眾生故多明唯識也非謂彼一向攝歸一邊如生佛依正一塵不虧之文如云作不具三千而釋如何作一向攝外歸內釋耶文只是一一有情心遍性遍者隨緣名心不變名性今點隨緣之心當處不變即名為性云心性俱遍者即示體量義心具性具者即體德義亦即上體具唯心之旨此之具遍既同法界故如虗空無礙各遍與彼彼生佛三無差別如是則方知生之與佛同一三千圓融遍入以由性體如空互融無礙是故彼彼圓融遍入身土者依正也因果者心生在因佛在於果三法齊等故無所增減是則以我之心例彼生佛因果身土一一徧融無不齊等是故佛性豈不遍於無情者哉故引世間相常為證。",
    "X56n0937_003:0588c19_0": "余曰觀子所見似知大旨何不試答向之一問客曰仁向自云若思一問眾滯自消僕若答者則以一答徧答眾問何一問之有耶余曰請述其旨客曰僕還攬向諸問意若消眾滯即名為答何假曲申一一問耶何者眾問豈不由僕不受無情有性之說僕今受之此即是答。",
    "X56n0937_003:0589a01_0": "良由野客粗知仁所立理領解心性遍具猶如虗空引法華世間相常依正攝盡此之所見似如薄知教部權實佛性進否經中大旨也云向之一問者既能似知大旨何不試答向來所問四十六中之一問耶如上文云若能曉余之一問則眾滯自消法界圓融釋然大觀也仁者向來既云曉一問則眾滯自消今以一答使諸問皆釋何一問之有耶荊谿因其謂一答遍答眾問故請述其旨客曰遍覽向來諸問中一一為顯三因俱遍三法無差教部權實碎偏權難顯圓實理如是眾滯既消既達無情有性之旨即名為答何假曲申一一問耶故即徵起正答云何者眾問豈不由僕不能受無情有性之說今來信受此義即此一答遍答眾問也。",
    "X56n0937_003:0589a15_0": "余曰大略雖爾未曉子情客曰仁所立義關諸大教難可具陳僕略論之冀垂聽覧豈非曉最後問三無差別即知我心彼彼眾生一一剎那無不與彼遮那果德身心依正自他互融互入齊等我及眾生皆有此性故名佛性其性徧造徧變徧攝世人不了大教之體唯云無情不云有性是故須云無情有性了性徧已則識佛果具自他之因性我心具諸佛之果德果上以佛眼佛智觀之則唯佛無生因中若實慧實眼冥符亦全生是佛無別果佛故生外無佛眾生以我執取之即無佛唯生初心能信教仰理亦無生唯佛亡之則無生無佛照之則因果昭然應知眾生但理諸佛得事眾生但事諸佛證理是則眾生唯有迷中之事理諸佛具有悟中之事理迷悟雖殊事理體一故一佛成道法界無非此佛之依正一佛既爾諸佛咸然眾生自於佛依正中而生殊見苦樂昇沈一一皆計為己身土淨穢宛然成壞斯在仁所問意豈不略爾余曰善哉善哉快領斯旨實可總知諸問綱格此即已答百千萬問何獨四十六耶。",
    "X56n0937_003:0589b09_0": "述者以其領解信受之辭其略雖爾終未曉子舊執之情必能釋然大觀洞見法界客亦不復自抑故進之曰仁所立義關諸大教等立義即前諸問之義僕略論之即曉最後問三無差別去即答也由曉三無差別等義因問開解是故備領前教觀之義自即知我心去止其性遍攝是領上攬因果自他觀於己心心佛眾生義也自世人不了大教之旨止須云無情有性是領上大教之旨義也自了性徧已止因果昭然是領佛說果德義也自應知眾生但理止諸佛咸然是領佛現互融義也與眾生不同大分如此當次第釋之初義者遮那果德身心依正者即三千果成咸稱常樂所以若色若心若依若正咸彰四德三無差別心生本同故得自他互融互入齊等自他者既約互融而論則當三法互論自他或心為自生佛為他或佛為自心生為他互融者即上彼彼各遍也即指要所謂圓融遍入是也齊等者即上身土因果無有增減也由齊等故故無增減一切眾生皆有果人之性故曰我及眾生皆有此性故名佛性其性遍造造即是具即具一切色心依正也遍變者變謂轉變即變造一切色心依正也徧攝者既全具為變全變即具舉一全收未始有一法而不攝此即徧攬自他依正觀於己心心佛眾生之義也次義領上諸教大旨者諸教大旨之所詮示唯心體具本有佛性而已世人迷故而不從果云眾生有致失體徧情無情隔唯云無情不云有性是故仁今所立須於性中點示體徧云無情有性此諸教大旨也三義佛說果德義彰因心性具欲令眾生全性起修而已既能解了性體元徧三無差別則識佛果具自他之因性即果具於因也我心具諸佛之果德即因具於果也因之與果同一三千三千理滿而成於果以究竟圓明眼智而觀之則真空冥寂更無彼此迭相見唯一真如智獨存所以唯佛無生亦可通於分證位因中若實慧實眼冥符者此句該觀行相似兩位慧之與眼莫不稱實而照稱實而見如初入品便能見於融妙三千但望後位明昧異耳而言冥符者以障中無明未破未能顯見但冥與之合亦全生是佛所見諸法皆三千故有何果佛在眾生外耶眾生下二句明理即也眾生因心無不理具然長劫用理長劫不知唯隨妄我於三界中執取生著故無佛唯生初心下名字即名字初心以稟教故起圓常正信理雖未見而生仰慕洞開圓解以理融事能了諸法無非法界亦無生唯佛名字位長未入品前皆是名字能入品者皆亡照之功今茲亡照且在名字即照而亡緣起俱泯絕生佛之假名即亡而照諸法宛然因果昭然四義生佛迷悟所見不同眾生但理諸佛得事等者如妙玄云眾生得事聖人得理又聖人得事凡夫有理釋籤解曰眾生得即理之事聖人得即事之理聖人知即眾生不知聖人得於因果化他感應等事眾生但得非因非果迷中之理眾生非但未悟亦不知迷故曰唯有迷中之事理諸佛非但已悟亦復顯迷故云具有悟中之事理迷悟雖殊不出百界千如一心一塵無不當處即具三千是以事理始終體一故一佛成道證法界體得法界用依隨正轉一成一切成法界無非此佛之依正一佛既爾彼彼果成亦復如是故曰諸佛咸然若眾生所見者由其從本以來背三德性惟迷惟逆流轉三道於平等法中起自他妄想見相差殊故於苦樂升沉之處各各皆計為己身土諸佛常融眾生自隔所以淨穢宛然成壞斯在仁所問下二句結答余曰下印述。",
    "X56n0937_003:0590a23_0": "客曰幾不遇仁此生空喪必依此見獲勝果耶余曰必欲修習教法未周若不善余一家宗途未可委究行門始末安能徧括教行事理惑智因果依正心法用為凡夫初心觀首然子所領似虗其情計子觀道猶為罔象客曰觀道者何仁師誰耶法依何耶余曰子豈不聞天台大師靈山親承大蘇妙悟是余師也摩訶止觀所承法也以二十五法為前方便十法成乘觀於十境十境互發觀時進否此觀道之大略也諸問且令識十乘初妙境而已餘乘諸境不暇論之客曰善哉僕當慕之以為永劫之仗託也。",
    "X56n0937_003:0590b09_0": "幾者近也謂近不遇仁則此生空自喪身亦可幾乎而失何所益哉今聞圓具之談無差之旨雖免此失還必依此旨修證可以尅獲勝妙之果報耶余曰至教法未周者此即且示十乘初不思議境而已委悉如摩訶止觀故下文云且令識十乘初妙境而已餘乘諸境不暇論之故曰教法未周若欲委究行門始末須善一家宗途且所傳摩訶止觀以法華為宗骨以智論為指南以大經為扶疏以大品為觀法引諸經以增信引諸論以助成觀心為經諸法為緯織成部帙不與他同所以必須五章以生妙解次於修行俱須二十五法以為方便十乘十境以為正修若不了此行門始末何自而知始末者即輔行云始終只是觀於三德入於三德乃至指歸自他也不過五略乃至二十五法方便十乘十境從因至果之後自他同歸祕藏一期為始終也教行至心法文有六雙即止觀攝法之意如云攝一切理惑智行位教六也教行即六中之二事理即事理兩種三千既攝一切理餘五是事惑即三惑智即三觀位通因果即因果一雙依正即因果通有十界依正心法即能造心所造法若不稟承摩訶止觀十章始末開解立行曷能周遍搜括如上等法入一念法觀具三千以為初心修觀之端首矣觀子所領受上三無差別之旨似如情懷虗豁但是解知今度子於今家觀道尚為罔象罔象者未實之貌也客曰下因上云計子觀道未明遂有三問一問觀道二問師承三問所承答中先答師承昔日靈山妙會親承法華今生稟承南嶽大蘇妙悟等且如別傳且荊谿答師承自左溪推至智者乃五世孫今云天台大師乃高祖之師也左溪乃父師也以摩訶止觀答所承法也摩訶揀非漸次不定及小止觀等二十五法下答所觀道二十五法為前方便者對十乘是近方便十法成乘者如不思議境乃至十離法愛此之十法和合成大乘名能觀觀十境為所觀境然一一境具有十乘十境互發者如觀陰境而發煩惱等具如止觀明次不次等當其境發之時宜善分別須知進否無使差互此言其大略也且是十乘初不思議境而已故曰諸問等由諸問所明不出無情佛性即三千之大旨望於初乘觀法尚未委悉自餘乘諸境未暇委論野客受上觀道之旨深生慕仰以為永劫之依憑也。",
    "X56n0937_003:0591a02_0": "客曰屢聞講說大乘諸師猶以無情佛性為一別見何耶余曰此有由也斯等曾覩小乘無情之名又見大乘佛性之語亡其所弘融通之談而棄涅槃虗空之喻不達修性三因離合不思生佛無差之旨謬斆傳習無情之言反難己宗唯心之教專引涅槃瓦石之說不測時部出沒之意如福德子而無壽命弱喪徒歸猶迷本族如受貴位不識祖宗亦如死人而著瓔珞用是福為用瓔珞為法相徙施全迷其本忽遇斯等應以如上諸意問之所弘之典大小乘耶尚失小乘已如前說。",
    "X56n0937_003:0591a12_0": "客領一家解行中心悅而誠服矣方以其所宗途諸大乘師以無情佛性二者而生差別之見為問所謂見者只是於斯無情佛性妄計無情無於佛性佛性不遍無情情性則異故曰別見記主推其所迷之自以破之蓋由此等曾觀小乘四含部中一向局彰無情之名此無情不云有性又見諸大教中有佛性之語此唯談佛性不立無情雖執無情佛性二者碩異遂乃忘其所弘華嚴依正融通之談惑為果事而不信因果本融致棄涅槃虗空之喻眾生理性正因佛性遍一切處非內非外而復不達修性三因離合之義正因徧處緣了必俱合而言之但名正因又不思生佛無差之旨果地三身既遍心生豈不然乎是故謬效傳習小乘無情草木生滅瓦石有無之言反難己宗所弘華嚴諸法唯心之教專引涅槃瓦石之說以為誠據者由不知時部帶權說實佛性有進否之義所謂出沒即或權或實及並明等意也瓦石無情乃並明中帶權佛性否義也豈可以為畢竟乎如上十句文義相由而生也下舉四意以斥其忘本雖說法相何益於人一如福德子而無壽命喻出大經二弱喪徒歸者弱者幼也喪猶失也幼失家而後還歸猶迷本族如莊子云弱喪而不知歸者是也三如受貴位不識祖宗事見梁史矦景傳中四如死人著瓔珞喻文出月燈三昧經今以其所弘大教法相譬福德徒歸受貴著瓔以其不知理本佛性元遍如無壽迷族昧祖死人雖有瓔珞貴位徒歸福德徒爾何為後但言福瓔餘二例知故總結云法相徒施全迷其本野客雖曉復誡其餘故曰忽遇斯等意謂脫若後世遇有此等別見之說亦以上融通等意問之其於大小得失可知云尚失小乘即前尚失小真及尚昧小乘等故曰已如前說。",
    "X56n0937_003:0591b19_0": "客曰斯失者眾聞仁所宗四教釋義可得聞耶余曰此之四釋關涉五時牢籠八教十方三世大小乘法咸攝其中豈可率爾譚其始末客曰若爾可能以四教略判佛性無情有無心造心變具不具耶余曰略示方隅斯亦可矣何者自法華前藏通三乘俱未稟性二乘憚教菩薩不行別人初心教權理實以教權故所稟未周故此七人可云無情不云有性圓人始末知理不二心外無境誰情無情法華會中一切不隔草木與地四微何殊舉足脩途皆趣寶渚彈指合掌咸成佛因與一許三無乖先志豈至今日云無情無。",
    "X56n0937_003:0591c06_0": "既辨其失則知非別見矣乃復請以四教意在判今佛性所歸則曰聞仁所宗等然一家所宗教門其唯二途謂化儀化法化儀則判教化法則釋義今從釋義以問故知為化法而問也余曰等者先言四教攝法該廣未易言其始末此之四釋者謂此四教是一家釋義之綱目故曰四教釋所以關涉五時牢籠八教者關涉乃出入之義牢籠乃該羅之義然如來一代施化所談法門雖五時八教之殊要不出以此藏等四教門戶出入而該羅之廣而言之十方三世大小乘法咸攝其中何以故以其佛佛道同故所關涉牢籠罄無不盡也此亦可為四教立題之的據也蓋如來所說之法不出藏通別圓但隨順物機將藏等四作頓漸秘密不定等四說之不同故四教儀云然秘密不定二教教下義理只是藏通別圓釋籤云兩種四教不出四緣四緣只是藏等四教輔行云藏等四教逼收一切大小乘經因果顯了各立教主各被機緣始終備足不過此四頓等四教但是如來不思議力布措藏等盈縮調停成熟物機乃至廢偏顯圓會權立實故有諸部相生文談其始末者既該始末則涉乎一化故未可率爾而言也客曰若爾等者猶言如此則還可以今四教略釋無情佛性之有無否及心造心變具不具之通局耶余曰略示方隅等者今以四教偏圓判夫佛性及變造等義猶示其方隅矣先判佛性有無義云自法華前藏通三乘俱未稟性者竝約機教相對而說以其教不詮中道佛性故使機緣無得而聞二乘憚教者憚猶畏也此以非己智分名之為憚不同華嚴之憚教也菩薩不行者且約鈍根及三藏言之若受接者亦可得去非不行也別教初心教權理實以理實故雖異前二以教權故所稟之中出二邊外此中但理不具諸法故云未周所以約教道言之同前兩教皆可云於無情不云有性若回向圓修則後方知者不在其數故此七人者即前四時三教七方便人可云無情不云有性文言可者對不可言之至若圓人與夫法華當機則不得云耳故云圓人始末知理不二此言知理即須自名字以去雖始末之異莫不皆知不二之理也心外無境了達唯心也誰情無情唯一佛性也此猶以昔圓對偏言情無情性非性異至法華會上一開之後則權實性情無間然矣故曰一切不隔草木等者並約法華部旨開顯言之三草二木喻權一地喻實而色香味觸四微不殊則權實不二也化城喻權寶所喻實舉足脩途皆趣寶渚亦權實不二也彈指合掌本人天小善而咸成佛因許三與一雖非本所望而無乖先志得非善體本妙佛意元實故使偏小無非一乘實相理通不隔諸法佛法之談本相是矣涅槃同味不亦宜乎佛世開顯既爾末代判教準知故曰豈至今日云無情無今日無者亦追斥野客言也故知以教判則有偏圓以部判則有今昔其惟醍醐圓頓佛性明矣。",
    "X56n0937_003:0592b09_0": "言心造心變咸出大宗小乘有言而無其理然諸乘中其名雖同義亦少別有共造依報各造正報有共造正報各造依報眾生迷故或謂自然梵天等造造已或謂情與無情故造名猶通應云心變心變復通應云體具以無始來心體本徧故佛體徧由生生徧徧有二種一寬廣徧二即狹徧所以造通於四變義唯二即是唯圓及別後位故藏通造六別圓造十此六及十括大小乘教法罄盡由觀解異故十與六各分二別藏見六實通見無生別見前後生滅圓見事理一念具足論生兩教似等明具別教不詮種具等義非此可述故別佛性滅九方見圓人即達九界三道即見圓伊三德體徧。",
    "X56n0937_003:0592b21_0": "次答徧造等義故言牒上問云言心造等心造出於華嚴謂一切惟心造心變出於楞伽謂不思議熏不思議變故曰咸出大宗大宗即大教也變義唯二造通於四是則造之為言通於小乘雖有其言而無其變造之理又諸乘中凡明於造必造正造依其名雖同至於能造之有共別所造復殊義亦少異藏通論於業惑搆造別圓明隨緣變造即不即異共造依報者三界苦域六道同業共造也各造正報者六道苦樂升沈之異也共造正報者如因中同修人業故共感人身也以業有重輕故貧富窟宅勝劣之不等也人界既爾餘界准知眾生迷故雖有如上之異莫非正因緣所生之法非彼邪外所計故曰眾生迷故或計自然及梵天等造謂自爾而然非由業力所造所成梵天等者或計梵天為能生萬物之主及為一切眾生之父以光音天初生梵世故大經云梵天自在天八臂天乃至微塵法及非法是造化主微塵即眾塵和合而成以皆計能生萬物故也如涅槃疏釋或謂情無情者彼但見已造之末有情無情而已殊不知元由性變故生差別之見而分依正之殊情無情隔矣如此小別應須楞伽心變而甄之故云造名猶通應云心變然變名復通者有心生論變心具論變故心變復通應云體具具則具於圓矣故譴之曰以無始來等此以遍義釋具以無始來未起念時體本周圓三千心色融攝無遺舉一全收三無差別佛得此故身土相即一多無礙生具此故如佛身土亦即一切如此則知郎變而具即具而變方稱圓旨記主於此復明二種之遍以顯體具不出各具互具之義以即狹言之即各具義以寬廣言之即互具義北峯曰我心之體本具三千十方生佛即心而是即狹遍也我心之體既具三千十方生佛是我心體寬廣遍也故輔行云又復學者縱知內心具三千法不知我心遍彼三千彼彼三千互遍亦爾此是各具互具之正文以三法各具三千言之似有凡聖高下究論法體生佛乃具我心之法我心亦具生佛之法故名互具是則於生佛具處是我心寬廣遍我心具處是生佛寬廣遍故云我心遍彼三千彼彼三千互遍也故知二遍之文釋成具造之義矣所以下以四教結前造遍等故藏通下先釋造通於四通名曰造而界內外有造六造十之異以之搜括大小乘教罄無所遺又復隨教異解故有事理即異之別所以藏見六實則六凡依正從事而觀皆實有也通見無生者境不異前但約即理故知幻化悉無生也別亦從事約離言之故十界三諦次第破顯也圓人不唯得理亦達於事若事若理一念具足無非法界而特云一念者蓋言不前不後俱時而具一字圓旨見於此矣所以四教觀法有析法體法次第一心之異論生兩教似等明具別教不詮者別雖論生似與圓同若曰即具而生別遠不逮況即具之旨惟圓而已種具等義者謂若欲委明性類等種以辯兩教具不具等非此可以具述別人由此所以佛性滅九方見圓人從初不同四眼二智所見差別初心即依佛眼佛智用上品寂光而為觀體即所見處九界即遮那三道即三德無所往而不見佛性矣況後位乎所以即具唯圓及別後位。",
    "X56n0937_003:0593b05_0": "客曰如何能攝依正因果余曰一家所立不思議境於一念中理具三千故曰念中具有因果凡聖大小依正自他故所變處無非三千而此三千性是中理不當有無有無自爾何以故俱實相故實相法爾具足諸法諸法法爾性本無生故雖三千有而不有共而不雜離亦不分雖一一徧亦無所在。",
    "X56n0937_003:0593b11_0": "然此野客問者由前荊谿云若不善余一家宗途安能遍括教行事理為初心觀首以至明於具遍之義故復申問二答中於一念理具三千者由前言云圓見事理一念具足故以圓詮一念即具事理三千釋之前云不思議境正是理造三千以止觀正意唯觀理具故輔行云但觀理具俱破俱立俱是法界故所變處即全理成事造三千也而云三千者點上三千性是中理不當有無雙遮二邊也有無自爾雙照二邊以結成三諦也三千者通體也三諦者體上之德相由此三千之性妙不決定當處皆空全體即假二邊叵得中道不存不可以一求不可以三取不縱不橫絕思絕議是以摩訶止觀不思議境後歷界如等一一三諦結之故今亦曰而此三千性是中理等此四句標也次何以故三字徵起俱實相故下釋成上文三千之性是中理者由俱實故實相法爾具足諸法即有自爾也諸法法爾性本無生即空自爾也故雖三千下結成上文云有而不有謂雖有三千體是中道中道寂滅雙遮二邊也共而不雜者三千雖同居一念十界因果不相混濫也離亦不分者十界因果雖異而理體本來融妙也雖一一遍者三諦無非遍一切處雖遍一切亦無所在也如是則終日同趣終日不失。",
    "X56n0937_003:0593c10_0": "客曰其理必然僕深仰之此為憑教為通依諸部為專在一經余曰斯問甚善能使其理永永不朽雖則通依一切大部指的妙境出自法華故方便品初佛歎十方三世諸佛所得微妙難解之法所謂諸法實相如是相等當知如是相等即是轉釋諸法實相以諸法故故有相等以實相故相等皆是實相無相相等皆如。",
    "X56n0937_003:0593c17_0": "理者即上三千世間俱空假中之旨可謂盡善矣所以深仰為憑教客既仰信復問此之妙境三千必憑教而立若通憑教為通依諸部為專在一經答中先稱客問之善能使其理不朽也雖則通依一切大部者如華嚴心造十界大經大論三種世間等如云散引諸文該乎一代等指的妙境出自法華先德云大師依妙經十如是并大經大論立三世間金錍云雖則通依一切大部指的妙境出自法華應知法華以前諸大乘經雖說諸法實相非是彰灼談此妙境以未開顯聲聞緣覺及偏菩薩九界十如具佛界十如故(文)良由十如為今經三周開權顯實正體以由開顯所以十界互具互融前諸部文兼但對帶以未開故推功歸此故曰指的妙境出自法華故方便品正示所依故文句云諸法實相下即甚深境界今明此境為二初一句略標權實章次十句廣釋權實相今云轉釋者即三轉讀文之轉也以諸法下即出轉釋之相所以文句初謂之略標次謂之廣釋也以諸法故假也以實相故中也實相無相空也故指要云三德三諦之三千而文中轉釋三觀不次第者從義便故也。",
    "X56n0937_003:0594a14_0": "客曰云何三千余曰實相必諸法諸法必十如十如必十界十界必身土又依大經及以大論立三世間故有三千具如止觀及廣記中故知因果凡聖恒具三千是故歎云唯佛與佛乃能究盡十方世界稻麻二乘如恒河沙不退菩薩並不能知斯義少分即指前之七種人也是故身子三請殷勤十方三世諸佛開顯釋迦仰同無復異趣大車譬此宿世示此壽量久本唯證於此根敗適復獲記由此菩薩疑除損生增道始初發心終訖補處豈有餘途並託於此由前四時兼但對帶部非究竟故推功法華涅槃兼權意如前說。",
    "X56n0937_003:0594b01_0": "問既聞三千之語又聞十如所憑之文未曉所以結成者故於是問曰云何三千而答以實相必諸法等此言三千是其總名界如身土名下之別法而一一法皆言必者以實相必具諸法理必有事諸法必十如事必有因果也十如必十界因果之法必該善惡凡聖也十界必身土正報之身必有所依之土也故前舉十如之言則已具三千何者蓋十如無別法必約十界分別十界互具既成百界百界十如乃成千法以此千法歷於依正假實此三千所以必備也但文有隱顯故三種世間又不如大經大論之顯著也故借彼文助顯而結成之非謂三千亦出彼文也不然何謂妙境出自法華乎若大經等文如止觀及記所引故知因果凡聖恒具三千者上約因心以示故因等是所具法今推廣言之則因果凡聖皆為能具言恒具者恒之言常故知若因若果若凡若聖無往而不具三千亦無往而不攝矣開顯妙談豈有圓頓更過於此大事因緣如是而已是故歎云者以由諸法實相三千妙境該於修德之極徹於性德之源三惑淨盡三德極圓佛眼種智乃能究盡其理然也七方便人於法華前雖如稻麥河沙以其但空偏假之智眼烏能知斯義之少分者哉所以身子三請者以未解此三千實相故也諸佛開顯顯此三千實相故也諸佛既爾釋迦亦然故曰仰同故經云唯佛與佛乃能究盡大車譬此者為中根人譬此也宿世因緣者為下根人示此也三周開顯迹化既爾塵劫之前壽量久本證非如非異亦唯此也此就應邊而說二乘在昔菩提心死譬猶根敗今聞迹中開顯根敗適復獲八相記者由此三千實相故也菩薩於迹於本斷疑生信損生增道始自發心終於補處並託此三千實相故也此就機邊而明若機若應若法若喻本證迹施無不本此三千實相者也通而言之前四時中唯除鹿苑顯露無圓乳及二酥圓人自妙但猶兼但對帶部未純一權實相隔大小殊途既非究竟故推功法華開顯之妙也涅槃兼權為末代故味同醍醐應無二別也。",
    "X56n0937_003:0594c14_0": "當知一乘十觀即法華三昧之正體也普現色身之所依也正因佛性由之果用緣了行性由之能顯性德緣了所開發也涅槃真伊之所喻也法華大車之所至也諸大乘意准例可知子得聞之可謂久種勤而習之無使焦敗願未來世諸佛會中與子相遇。",
    "X56n0937_003:0594c19_0": "一乘十觀者以此十觀但是一不思議觀不思議境為對根殊故觀列十雖列於十乃至離愛不離妙境以初妙境為下九乘所依故喻以大車即一乘也故曰一乘十觀且三千妙體既本於此經故十乘觀法還即法華三昧妙義之正體以實相理從所發定言之故云三昧然今以妙境為三昧之正體而妙記以止觀三昧為筌罤蓋筌罤從行正體約理故也此三昧正體亦為普現色身之所依所以諸佛果上遍應大用如觀音現身說法等事皆依於此理如曰諸佛若斷性惡普現色身從何而立蓋性惡即三千故正因佛性等者此又言修性三法由此一念三千故能為體為用成性成修所以正因即之起果上三千之用緣了即之而能顯於性德三千而此緣了全由性德之所開發是故三因莫非性也如是之義本於性德而顯於修成修非性無以發性非修無以彰體用等義莫不皆然是則三因為因全顯於果果即三德故為涅槃真伊之所喻也而果必由因則法華大車之所至也至則道場所證之法故例諸大乘亦無出此理如前一代教中已多顯頓是也故曰准例可知子得聞之者結示功歸久種仍為熟脫之緣愈彰此道之不輕也。",
    "X56n0937_003:0595a17_0": "於是野客悲喜交集曰投身莫報粉骨寧酬唯以此義隨方轉說以報所聞如何余曰佛有誠誡自可為規經云若但讚佛乘眾生沒在苦我寧不說法疾入於涅槃尋思方便先小後大此乃以偏助圓方可為說又云當來世惡人破法墮惡道志求佛道者廣讚一乘道此即簡人方可為說然末代施化復未知根亦可如安樂行中但以大答亦可如不輕喜根而強毒之故首楞嚴中聞生謗者後終獲益如人倒地還從地起應運大悲無惱他說子應從容觀時進否將護彼意順佛本懷。",
    "X56n0937_003:0595b03_0": "或科此下為流通無不可者恐濫三分故不必爾投身者如涅槃第十三釋迦去世作婆羅門雪山修道帝釋化為羅剎說半偈(諸行無常是生滅法)菩薩舍身求後半偈既得以書石壁即上樹自投從樹下來至地羅剎後復本形讚歎粉骨者如大品薩陀波崙欲求般若七日七夜悲泣空中告曰佛子東行五百由旬香城有菩薩名曇無竭一日三時說般若自賣身帝釋化為婆羅門買骨髓時波崙以刀出髓(文)此並顯恩大難酬也夫恩莫大乎生吾法身而色身次之葢今佛性之旨雖遍示無情實全於圓解故法身得生此大恩所以難報也若報大恩莫若流通此道轉教眾生如云若不傳法化眾生必竟無能報恩者故今效之但流通說法為不易故復示其規焉故曰佛有誠誡等佛世鑑機須先小後大此以偏圓分大小也若佛滅後有知根不知根性者不知根者得以揀人為說故曰當來世惡人等其不知根者又有二例或如安樂行但以大答即但以大乘而為解說雖於小無近益而不失於大緣或如不輕喜根而強毒之且為成其遠因久種故雖謗法墮苦不暇卹也不輕如法華喜根文出大論云喜根菩薩說瞋恚即是道勝意比丘云是邪說而罵喜根喜根念彼恐謗法及墮苦廣說偈云婬欲即是道瞋恚亦復然等勝意大罵生陷地獄經無數劫由前謗種亦得成佛此乃強毒令成大乘大乘若發能破無明因其強毒故引楞嚴文以釋疑妨蓋墮苦有終出之時而乘種不可失故也不然則差機惱他之說何傳法利人之有耶故應運大悲心無惱他說然後可爾雖然此且示大途而已若夫從容適宜觀時進否則不專於此亦當將護彼意即所謂無惱說順佛本懷即應運大悲也。",
    "X56n0937_003:0595c10_0": "若有眾生未稟教者來至汝所先當語云汝無始來唯有煩惱業苦而已即此全是理性三因由未發心未曾加行故性緣了同名正因故云眾生皆有正性既信己心有此性已次示此性非內外徧虗空同諸佛等法界既信徧已次示徧具既同諸佛等於法界故此徧性具諸佛之身一身一切身如諸佛之感土一土一切土身土相即身說土說大小一多亦復如是有彼性故故名有性。",
    "X56n0937_003:0595c18_0": "此眾生雖未稟權實教然其來也則已成機唯當依今大乘示以三種之義故誡語云汝無始來等煩惱業苦即本有三種理性三因即三理元徧指修即性波為水種即性種也由了因未曾發心緣因未曾加行性雖具三以在迷故開乃成合故但同名理性正因而已一切眾生皆有此性即與上文今立眾生正因體遍其義正齊次示性遍既已信己心有此性已還示此性非內根非外塵猶如虗空亦非內外徧一切處心佛眾生三無差別故同諸佛性遍虗空體稱法界法界無外性亦無外故等法界此示體量也次示性具者上既示遍義故即遍論具若但論徧不論具者非圓徧也二者相即方名圓遍圓具也故即前徧名具故曰故此遍性具諸佛之身等即上文故於性中點示體具即此徧性具諸佛之身一身一切身一土一切土身土相即亦可云一身一切土一土一切身身說土說大小無礙一多自在故今即此遍性平等具足絲毫不虧三無差別故曰亦復如是所謂眾生有佛性者由有彼果人之性故也故曰有彼性故故名有性具體本同體德備矣若了此遍具之旨則妙解佛性體如虗空無有&#;礙不隔情與無情也。",
    "X56n0937_003:0596a16_0": "若世人云眾生唯有清淨之性加修萬行為功用體故至果時方有大用此乃佛有眾生之性不名眾生有佛性也三無差別斯言有徵寄言說者勿負斯教若言眾生有正因性與法身等不與報化等者還成眾生與眾生等何者若除報化猶是眾生若言等於有報化之法身其如法身非報化外以是言之故須悉等。",
    "X56n0937_003:0596a23_0": "承上先示種性次示體遍三示體具之後而斥他非正由世人不了種性等義故因斥之所以初計謂眾生惟有清淨之性者此即旁遮偏指清淨真如故四明云正為顯圓妄染即佛性義旁遮偏指清淨真如此斷盡金錍一書矣他既失於迷染三道即佛性是不知種性義所以不能全性起修是故須用外加萬行之功為果上功用之體逮至果時方有其用非全性起修既不具德則成佛有眾生之性不名眾生有佛性也豈非以性淨之佛而具眾生故得斥云此乃佛有眾生之性此且一往云爾彼尚不善生具佛性豈達三無差別故引華嚴以證其失斯言有徵者謂此之經文可以證驗今佛性義若不准者則負於斯教也其次縱其轉計若言眾生但有正性與法身等等者理體法身何往不可若不與報化等則不惟眾生自等眾生抑不知體遍義何以故以向示體徧必同諸佛等法界若除報化猶是眾生何同之有又次轉計若言等是斥其不知體德也若知法身體德圓具一身一切身以例報化亦悉應然必不偏計等於有報化之法身而已故結斥云故須悉等蓋法身非報化外三身無二無別故也。",
    "X56n0937_003:0596b20_0": "今此示有是示種性示徧是示體量示具是示體德既示三已次令緣於一體三寶發四弘誓進受菩薩清淨律儀一一緣向理性三因修行填誓如向所聞種必相續世世生處以人天身佛會再聞而得解脫。",
    "X56n0937_003:0596b24_0": "只一心體體是佛性具足三義曰種曰量曰德以此心因是三道本指波即水有能生義為三種德故曰種性以此心體本來周遍一切不隔無有&#;礙同佛如空故曰體量以此心體性本圓具身土因果無有缺減生佛無差故曰體德以此格彼則偏指真如者一無有焉義雖有三要而言之只一性具不了此者一切俱失故曰只一具字彌顯今宗記主至此既為示此三已復令示其依解立行依此而緣於一體三寶據此而發於無作四弘進受菩薩律儀復令一一緣向理性三因三因者即所緣三寶之勝境迷悟同源生佛一致故也托此起行則六度萬行一一無作以茲行山填於願海行願相資當當來世終期尅獲勝果而云如向所聞種必相續等者蓋聞而種種必相續自此聞法稟戒二者俱急不失人天佛會再聞而得解脫。",
    "X56n0937_003:0596c15_0": "若已稟方便教者若聞若行若伏若斷隨其所得點示體具故經云汝等所行是菩薩道故法華中五章開權一一但云是法皆為一佛乘故眾生聞已皆得種智。",
    "X56n0937_003:0596c19_0": "此人已稟權教而云若聞若行若伏若斷即三教內外凡及小中聖所得亦不出但空偏假而已應准法華開顯之意從容觀時點示以三千實相體具之旨倘曰觀時或否亦勿惱他為說故引經二開權文為證。",
    "X56n0937_003:0596c24_0": "散心講授者隨宜設化。",
    "X56n0937_003:0597a01_0": "此人雖亦憑教講授而圓解尚昧內慧不明於一家圓具境觀未得其所以說葢文字法師之流亦應從容觀時隨宜而設化之。",
    "X56n0937_003:0597a04_0": "一種觀心者從心示之。",
    "X56n0937_003:0597a05_0": "此人雖習觀心即白首論心或謂即心是佛及上慢暗證之流不了心具者彼既偏習觀心故令觀時進否但從心以示其體具之旨若知體具內觀自明。",
    "X56n0937_003:0597a09_0": "若憚教生諍競者應當語云聞已成種不敢輕汝汝等行道皆當作佛。",
    "X56n0937_003:0597a11_0": "憚教直不受耳若諍競則又因聞大法非彼所堪從而起諍毀謗者當如上不輕喜根強毒之可也雖無近益而有遠種雖因謗墮後終得脫也。",
    "X56n0937_003:0597a14_0": "故大師判教末云佛法不思議唯教相難解二乘及菩薩尚所不能測何況諸凡夫而欲判此事譬如生盲人分別日輪相欲判虗空界一切諸色像而言了達者畢竟無是事是故有智者各生慚愧心自責無明暗捨戲論諍競大師親證判已尚自謙喻後輩余今准此一家宗途獎導於子非師己見子亦順教如是流行。",
    "X56n0937_003:0597a21_0": "此淨名文後大師說偈也栢庭云既誡隨機而授道矣是故以此道合其順教道流行通於後世也因復引大師判教結勸之文兼己以諭之使彼舍己見唯理是從不可諍競忘我利物則化導之功大矣佛法者心法也由心法妙故佛法所以不可思議教相又乃吾佛設教被機之相惟其機緣差別是故教相難解如曰是諸佛境界尚非等覺已還所知豈三乘凡聖所能測哉故吾祖明誡勗之深有所以也。",
    "X56n0937_003:0597b06_0": "野客於是歡喜頂受自爾永劫唯奉持之所在宣弘不違尊命斂容再拜安庠而出忽然夢覺問者答者所問所答都無所得。",
    "X56n0937_003:0597b09_0": "客既歡喜領命弘持其於弘持也非三軌可乎故其斂容也亦非向來麤獷之時蓋已得之於柔忍矣故其再拜也非向來不恒之時蓋已得之於大慈矣故其安詳也則非向來平立之時蓋已得之於法空矣所在弘宣或以偈結云我祖毗陵師甞以夢說夢夢事不可思了夢本不實誰為夢覺者覺夢兩無有誰問有誰答問答了無得我亦無所得復以夢圓夢願以幻夢思回施諸眾生同入三摩地頓空如夢幻野客既已領命弘持夢境於是罷論而無所得然則無得而得得之於心得之無得亦得於心其於教部權實佛性進否之旨洞然於胸中矣又何偏權之疑哉。",
    "X56n0937_003:0597b22_0": "金剛錍釋文卷下(終)",
    "X56n0937_003:0597c07_0": "金錍釋文蓮居僅存宋人手書梵本其不墜者如綫矣乃先師　紹覺講主所珍欲廣流通未竟斯志念復依師以來親炙其學不猒誨不倦者二十年如一日墓木雖拱中心無忘幸值初度刻此以畢　師願其本末二文先未合帙欲便於覽者籍玄箸新伊二兄合會焉更質於尊宿同志校閱方梓選徑山第一書刻謀始於　仲春　佛涅槃日於本年孟夏　佛誕日告成　　盧復記。",
    "X56n0937_003:0597c16_0": "維時承應甲午中夏下旬聊應蒙求[艸-屮][艸-屮]訓之謹白可畏願緣此書恒為善友同遇錍毉速決眼瞙亦決他耳。"
}