{
    "X58n1031_003:0732b14_0": "原人論發微錄第三",
    "X58n1031_003:0732b16_0": "諸識亦爾以皆假託眾緣無自性故。",
    "X58n1031_003:0732b17_0": "故中觀論云未曾有一法不從因緣生是故一切法無不是空者又云因緣所生法我說即是空起信論云一切諸法唯依妄念而有差別若離心念即無一切境界之相經云凡所有相皆是虗妄離一切相即名諸佛(如此等文徧大乘藏)。",
    "X58n1031_003:0732b22_0": "是知心境皆空方是大乘實理。",
    "X58n1031_003:0732b23_0": "方是大乘實理者先縱之乃是但空之實理也不了之義後文奪破。",
    "X58n1031_003:0732c01_0": "若約此原身身元是空空即是本。",
    "X58n1031_003:0732c02_0": "今復詰此教曰若心境皆無知無者誰。",
    "X58n1031_003:0732c03_0": "知無者誰此一句出秦王答書彼云諸家通第一義諦皆云廓然空寂無有聖人若無聖人知無者誰今論主借其語勢破心境俱無矣。",
    "X58n1031_003:0732c06_0": "又若都無實法依何現諸虗妄。",
    "X58n1031_003:0732c07_0": "且現見世間虗妄物未有不依實法而能起者。",
    "X58n1031_003:0732c08_0": "如無濕性不變之水何有虗妄假相之波若無淨明不變之鏡何有種種虗假之影。",
    "X58n1031_003:0732c10_0": "如無下濕性之水淨明之鏡皆喻本有性淨真心。",
    "X58n1031_003:0732c11_0": "又前說夢相夢境同虗妄者誠如所言。",
    "X58n1031_003:0732c12_0": "然此虗妄之夢必因睡眠之人。",
    "X58n1031_003:0732c13_0": "必因睡眠之人即性淨真心亦合前莊周睡時本心耳。",
    "X58n1031_003:0732c15_0": "今既心境皆空未審依何妄現。",
    "X58n1031_003:0732c16_0": "故知此教但破執情亦未明顯真靈之性。",
    "X58n1031_003:0732c17_0": "故法鼓經云一切空經是有餘說(有餘者餘義未了也)大品經云空是大乘之初門。",
    "X58n1031_003:0733a01_0": "上之四教展轉相望前淺後深。",
    "X58n1031_003:0733a02_0": "前淺後深者以人天教唯齊業報小乘教齊後四麁法相教極於三細破相教密顯真性是則人天唯淺破相唯深中間二教互論淺深謂望前則深望後則淺也。",
    "X58n1031_003:0733a06_0": "若且習之自知未了名之為淺若執為了即名為偏故就習人云偏淺也。",
    "X58n1031_003:0733a08_0": "真顯真源第三。",
    "X58n1031_003:0733a09_0": "源之一字喻一切眾生本覺真性也在萬法為依正之源在眾生為迷悟之源在菩薩為萬行之源在諸佛為萬德之源。",
    "X58n1031_003:0733a12_0": "五一乘顯性教者說一切有情皆有本覺真心無始已來常住清淨昭昭不昧了了常知亦名佛性亦名如來藏。",
    "X58n1031_003:0733a15_0": "一乘顯性教即同禪詮序中顯示真心即性教彼對禪宗直顯心性宗故云即性此超第三法相第四破相故云顯性又異大乘偏淺故標一乘(大乘法相在生滅門極於三細大乘破相在真如門密顯空義皆偏淺耳)說一切下此就真如性徧一切眾生皆有本覺真心也大經云法性徧在一切處一切眾生及國土智論云白石有銀性黃石有金性一切眾生有涅槃性斯皆良證也無始已來常住清淨者起信云一切眾生本來常住又云不失不壞常住一心從本已來一切染法不相應故故云清淨然清淨有其二義無上依經云一者自性清淨是其通相二者離垢清淨是其別相寶性論中亦有二義一自性清淨謂性淨解脫二離垢清淨謂離障解脫今云常住清淨即通相性淨解脫也昭昭不昧了了常知者華嚴回向品云真如照明為性故云不昧此言知者不是證知意說真性不同虗空木石故云知也非如緣境分別之識非如照體了達之智直是真如之性自然常知故馬鳴菩薩云真如者自體真實識知義故亦名佛性下是諸佛萬德之源故名佛性是眾生迷悟之源故名如來藏(釋上文義多依禪詮兼取賢首教義章)。",
    "X58n1031_003:0733b11_0": "從無始際妄想翳之不自覺知但認凡質故耽著結業受生死苦。",
    "X58n1031_003:0733b13_0": "從無始際妄想翳之者際時也翳障也妄想即無明起信云從無始時來皆因無明所熏習故又染心義名煩惱礙能障真如根本智故不自覺知者十地論云真樂本有失而不知妄苦本空得而不覺但認下向明妄想即法執所知障也但認凡質即我執煩惱障質身也耽著結業即業障受生死苦即報障。",
    "X58n1031_003:0733b20_0": "大覺愍之說一切皆空又開示靈覺真心清淨全同諸佛。",
    "X58n1031_003:0733b22_0": "大覺即世尊故詮序云感而即通名大覺尊愍悲也說一切皆空者以世間生死出世涅槃一切皆空此敘前破相也開示靈覺下正述顯性問明品云其性本清淨開示諸眾生全同諸佛者清涼疏云凡厥生靈皆含佛智圓滿普法無不備矣。",
    "X58n1031_003:0733c03_0": "故華嚴經云佛子無一眾生而不具足如來智慧但以妄想執著而不證得若離妄想一切智自然智無礙智即得現前。",
    "X58n1031_003:0733c06_0": "故華嚴下此皆出現品開物因性經文但以等者具云但以妄想顛倒執著釋曰凡夫妄想權小執著顛倒通二。",
    "X58n1031_003:0733c09_0": "便舉一塵含大千經卷之喻塵況眾生經況佛智。",
    "X58n1031_003:0733c10_0": "便舉一塵下大經云譬如有大經卷(喻佛智慧)量等三千大千世界(智體無邊廓周法界)書寫三千大千世界事一切皆盡(喻體上本有恒沙功德恒沙妙用也)此大經卷雖復量等大千世界而全住在一微塵中(喻佛智全在眾生身中圓滿具足也)如是一塵(舉一眾生為例)一切微塵皆亦如是故云塵況眾生也。",
    "X58n1031_003:0733c16_0": "次後又云爾時如來普觀法界一切眾生而作是言奇哉奇哉此諸眾生云何具有如來智慧迷惑不見我當教以聖道令其永離妄想自於身中得見如來廣大智慧與佛無異。",
    "X58n1031_003:0733c20_0": "教以聖道者即教彼眾生修習聖道道因也謂六波羅蜜三十七道品也。",
    "X58n1031_003:0733c22_0": "評曰我等多劫未遇真宗不解反自原身但執虗妄之相甘認凡下或畜或人。",
    "X58n1031_003:0733c24_0": "評量也真宗即佛教但執下圓覺云妄認四大為自身相六塵緣影為自心相故結云甘認凡夫下類矣。",
    "X58n1031_003:0734a03_0": "今約至教原之方覺本來是佛。",
    "X58n1031_003:0734a04_0": "至教者佛教至極之談即指華嚴也本來是佛者圓覺疏云心本是佛由念起以漂沈出現品云如知眾生本來成佛。",
    "X58n1031_003:0734a07_0": "故須行依佛行心契佛心返本還源斷除凡習損之又損以至無為自然應用恒沙名之曰佛。",
    "X58n1031_003:0734a09_0": "故須下清涼心要云若任運以寂知則眾行爰起即行依佛行也若無心而忘照則萬累都損即心契佛心也還本還源者大疏云令諸眾生還本還源窮未來際無有休息凡習即凡夫習氣損之下以為道日損惑也為學日益智也損之又損之則寂照現前自然應接恒沙之機非佛而何。",
    "X58n1031_003:0734a15_0": "當知迷悟同一真心大哉妙門原人至此。",
    "X58n1031_003:0734a16_0": "迷悟同一真心者迷即眾生悟即諸佛大經云心佛及眾生是三無差別故云同一也大哉即仰歎之辭妙門即絕思之稱。",
    "X58n1031_003:0734a19_0": "(自注)然佛說前五教或漸或頓。",
    "X58n1031_003:0734a20_0": "或漸或頓者詮序云轉凡成聖即漸從迷而悟即頓。",
    "X58n1031_003:0734a22_0": "若有中下之機則從淺至深漸漸誘接先說初教令離惡住善次說二三令離染住淨後談四五破相顯性會權歸實依實教修乃至成佛。",
    "X58n1031_003:0734b01_0": "中下之機通取漸修漸悟以明中下離惡住善即人天教離十惡修十善也離染住淨者小乘即離煩惱染住我空之淨法相即離所知之染住法空之淨會權歸實即會破相之權歸顯性之實也。",
    "X58n1031_003:0734b05_0": "若上上根智則從本至末謂初便依第五頓指一真心體心體既顯自覺一切皆是虗妄本來空寂但以迷故託真而起須似悟真之智斷惡修善息妄歸真妄盡真圓名法身佛。",
    "X58n1031_003:0734b09_0": "若上上根智至本來空寂即頓悟也從但以迷故已下之文即漸修也由迷無明為妄惑悟妄惑為真智悟真之智為能斷妄惑之惡為所斷餘如文。",
    "X58n1031_003:0734b12_0": "會通本末第四(會前所斥同歸一源皆為正義)。",
    "X58n1031_003:0734b13_0": "會通本末者末即第一斥迷執第二斥偏淺本即第三直顯真源故云會前所斥同歸一源。",
    "X58n1031_003:0734b15_0": "真性雖為身本生起蓋有因由不可無端忽成身相。",
    "X58n1031_003:0734b16_0": "真性雖為身本者即躡前顯性教云一切有情皆有本覺真心也生起蓋有因由者言迷真生妄心有所因故起信云不如實知真如法一不覺心起此則起妄之由也不可下推其身本即現相中根身是忽成身相也。",
    "X58n1031_003:0734b21_0": "但緣前宗未了所以節節斥之。",
    "X58n1031_003:0734b22_0": "但緣前宗下始自迷執宗終至破相宗有五節矣。",
    "X58n1031_003:0734b23_0": "今將本末會通乃至儒道亦是(初唯第五性教所說從後段已去節級方同諸教各如注記)。",
    "X58n1031_003:0734c01_0": "謂初唯一真靈性。",
    "X58n1031_003:0734c02_0": "謂初下起信云所言法者謂眾生心眾謂四聖生謂六凡詮序云凡夫聖賢根本悉是靈明清淨一法界心(即同此文一真靈性)。",
    "X58n1031_003:0734c05_0": "不生不滅不增不減不變不易。",
    "X58n1031_003:0734c06_0": "不生下起信云所謂心性不生不滅無有變異乃至離念境界唯證相應(上但攝引論文或引禪詮序為證)。",
    "X58n1031_003:0734c08_0": "眾生無始迷睡不自覺之由隱覆故名如來藏依如來藏故有生滅心相(自此方是第四教亦同破此已生滅諸相)。",
    "X58n1031_003:0734c10_0": "眾生下起信云心生滅者依如來藏故有生滅心無始迷睡即法喻雙標論云猶如迷人依方故迷迷喻無明方喻覺性若準前文云然此虗妄之夢必因睡眠之人則睡喻覺性夢喻妄識皆生滅門耳注亦同下應云亦同破此已有生滅諸相諸相即垢淨增減故心經云是諸法空相不生不滅不垢不淨不增不減正同此也。",
    "X58n1031_003:0734c17_0": "所謂不生不滅真心與生滅妄想和合非一非異名為阿賴耶識。",
    "X58n1031_003:0735a01_0": "所謂下起信云所謂不生不滅與生滅和合今云真心即不生滅如來藏妄想即生滅心相故十地論云唯真不生單妄不成真妄和合方有所為。",
    "X58n1031_003:0735a04_0": "此識有覺不覺二義(此下方是第三法相教中亦同所說)。",
    "X58n1031_003:0735a05_0": "此識下起信論云此識有二種義一者覺義謂心體離念二者不覺義謂不如實知詮序云覺是三乘賢聖之本不覺是六道凡夫之本。",
    "X58n1031_003:0735a08_0": "依不覺故最初動念名為業相。",
    "X58n1031_003:0735a09_0": "依不下起信云一者無明業相以依不覺故心動說名為業即此云最初動念也二者能見相以依動故能見即此云轉成能見之識也三者境界相以依能見故境界妄現即此云境界相現也。",
    "X58n1031_003:0735a13_0": "又不覺此念本無故轉成能見之識及所見境界相現又不覺此境從自心妄現執為定有名為法執(此下方是第二小乘教中亦同所說)。",
    "X58n1031_003:0735a16_0": "又不下起信云智相依於境界心起分別即此云從自心妄現也又云相續相依於智故生於苦樂即此云執為定有也。",
    "X58n1031_003:0735a19_0": "執此等故遂見自他之殊便成我執。",
    "X58n1031_003:0735a20_0": "執此下起信云執取相依於相續緣念境界即此云遂見自他之殊也。",
    "X58n1031_003:0735a22_0": "執我相故貪愛順情諸境欲以潤我瞋嫌違情諸境恐相損惱愚癡之情展轉增長(此下方是第一人天教中亦同所說)。",
    "X58n1031_003:0735a24_0": "執我下起信云計名字相依於妄執分別即此云貪愛瞋嫌愚癡之情也。",
    "X58n1031_003:0735b02_0": "故殺盜等心神乘此之惡業生地獄鬼畜等中。",
    "X58n1031_003:0735b03_0": "故殺下起信云起業相依於名字尋名取著造種種業(善惡二業其善業在次文)又云業繫苦相以依業受報不自在故(苦樂二報樂報亦在次文)釋云惡業即此殺盜等等者以十惡中但言殺盜之二等取餘八也心神即妄心神識也苦報即此云地獄鬼畜也。",
    "X58n1031_003:0735b08_0": "復有怖此苦者或性善者行施戒等心神乘此善業運於中陰入母胎中(此下方是儒道二教亦同所說)。",
    "X58n1031_003:0735b10_0": "復有下謂有怖三塗之苦者行施戒等言等者等取餘善也乘者乘者乘因感果也中陰者謂此陰既滅彼陰未生故於中陰入母胎中即人趣樂報也。",
    "X58n1031_003:0735b14_0": "稟氣受質(會彼所說以氣為本)氣則頓具四大漸成諸根心則頓具四蘊漸成諸識十月滿足生來名人即我等今者身心是也。",
    "X58n1031_003:0735b17_0": "稟氣受質者質身也以氣為本者前文云萬物與人皆氣為本漸成諸根者如佛為難陀廣說胎相在母胎中三十五箇七日人相具足即漸成也諸根即五根諸識即五識十月滿足者或云計日即唯九月如摭華鈔辨之。",
    "X58n1031_003:0735b22_0": "故知身心各有其本二類和合方成一人。",
    "X58n1031_003:0735b23_0": "二頭下身即四大心即四蘊此二和合方成人耳。",
    "X58n1031_003:0735b24_0": "天修羅等大同於此。",
    "X58n1031_003:0735c01_0": "大同於此者人道既以身心和合餘之五趣亦皆大同又若鬼趣色蘊人見不及非非天唯有細色是亦小異。",
    "X58n1031_003:0735c04_0": "然雖因引業受得此身復由滿業故貴賤貧富壽夭病健盛衰苦樂。",
    "X58n1031_003:0735c06_0": "然雖下俱舍云引業引一生多業能圓滿猶如繢像先圖形狀後填眾彩受得此身即先圖形狀也貴賤貧富即後填眾彩也然其引業能造之思要是第六意識所起若其滿業能造之思從五識起又此引滿二業亦名總別二報總別交絡有其四句一總報善別報不善謂人受貧窮疾病等二總報不善別報善謂畜生有肥好等三總別俱善謂人受富貴等四俱不善謂畜生有盲跛者今此既原人身唯取第一句人受貧窮疾病即同此文貧賤病苦也第三句人受富貴等即同此文富貴盛樂也其第二第四兩句既是畜生總別二報故不引配耳。",
    "X58n1031_003:0735c18_0": "謂前生敬慢為因今感貴賤之果乃至仁壽殺夭施富慳貪種種別報不可具述。",
    "X58n1031_003:0736a02_0": "謂前下前生敬人為因今感尊貴為果前生慢人為因今感卑賤為果乃至前生行仁為因今感長壽為果餘皆例之。",
    "X58n1031_003:0736a05_0": "是以此身或有無惡自禍無善自福不仁而壽不殺而夭等者皆是前生滿業已定故今世不同所作自然如然。",
    "X58n1031_003:0736a08_0": "自然如然者言非使之然也。",
    "X58n1031_003:0736a09_0": "外學者不知前世但據目覩唯執自然(會彼所說自然為本)。",
    "X58n1031_003:0736a10_0": "自然為本者前文云萬物皆是自然生化。",
    "X58n1031_003:0736a11_0": "復有前生少者修善老而造惡或少惡老善故今世少小富貴而樂老大貧賤而苦或少貧苦老富貴等。",
    "X58n1031_003:0736a13_0": "復有下文有四句皆隔句以示因果前生下初句為因故今下第三句為果第二句或前生少惡老善為因第四句或今世少貧苦老富貴為果。",
    "X58n1031_003:0736a16_0": "故外學者唯執否泰由於時運(會彼所說皆由天命)。",
    "X58n1031_003:0736a17_0": "否泰者周易二卦之名也否者天地不交而萬物不通也(二氣不接萬物塞矣)泰者天地交而萬物通也(二氣交感萬物乃通)故離卦云否泰反其類也由於時運者時塞即止否也時行即通泰也　注皆由天命者前文云貴賤苦樂皆稟於天由於時命耳。",
    "X58n1031_003:0736a22_0": "然所稟之氣展轉推本即混一之元氣也所起之心展轉窮源即真一之靈心也。",
    "X58n1031_003:0736a24_0": "所稟之氣即稟二氣受身也展轉推本者推於萬物本乎天地推於天地本乎元氣也所起之心即六識之心也展轉窮源者窮前六識本乎末那窮第七末那本乎賴耶窮第八賴耶本乎一心源也。",
    "X58n1031_003:0736b04_0": "究實言之心外的無別法元氣亦從心之所變屬前轉識所見之境是阿賴耶相分所攝。",
    "X58n1031_003:0736b06_0": "心外下即真心外的無別法以總該萬有即是一心矣從心下即真心隨緣也相分所攝謂元氣屬相分攝耳。",
    "X58n1031_003:0736b09_0": "從初一念業相分為心境之二。",
    "X58n1031_003:0736b10_0": "初一念即三細中第一業相心即第二轉相境即第三現相。",
    "X58n1031_003:0736b12_0": "心既從細至麤展轉妄計乃至造業(如前敘列)境亦從微至著展轉變起乃至天地。",
    "X58n1031_003:0736b14_0": "心既從細至麤者謂轉相從業相起也以業相是細中之細轉相是細中之麤耳展轉妄計即六麤中智相相續執取計名四麤也乃至造業即第五麤起業相也其第六麤業計苦相即下文業成即身成也注如前敘列者即前文始自顯一心乃至第五人天齊業報是也境亦從微至著者謂現相亦從轉相起也微著即麤細變其文耳展轉變起即根身種子乃至天地即器世間。",
    "X58n1031_003:0736b22_0": "即彼始自大易五重運轉乃至太極太極生兩儀。",
    "X58n1031_003:0736b23_0": "注即彼者指儒教也易緯曰氣象未分謂之太易元氣始萌謂之太初氣形之端謂之太始形變有質謂之太素形質已具謂之太極彼五重運轉例此從微至著也。",
    "X58n1031_003:0736c03_0": "彼說自然大道如此說真性其實但是一念能變見分。",
    "X58n1031_003:0736c05_0": "彼說下指道教也能變見分即第二轉相。",
    "X58n1031_003:0736c06_0": "彼云元氣如此說一念初動其實但是境界之相。",
    "X58n1031_003:0736c07_0": "元氣儒道二教皆宗之一念初動即第一業相境界之相即第三現相耳。",
    "X58n1031_003:0736c09_0": "業既成熟即從父母稟受二氣與業識和合成就人身。",
    "X58n1031_003:0736c11_0": "業既下謂過去已熟之業為因此世父母赤白二氣為緣與初念業識和合漸成人耳。",
    "X58n1031_003:0736c13_0": "據此則心識所變之境乃成二分一分即與心識和合成人一分不與心合即是天地山河國邑。",
    "X58n1031_003:0736c15_0": "心識即業識也與識和合即心有知覺不與心合即想枯澄凝故楞嚴云想澄成國土(即此文云天地國邑)知覺乃眾生(即此文云和合成人)若對三境和合成人即根身種子天地國邑即器世間裴相序亦云內為筯骸所括外為山河所眩可以例釋。",
    "X58n1031_003:0737a02_0": "三才中唯人靈者由與心神合也。",
    "X58n1031_003:0737a03_0": "佛說內四大與外四大不同正是此也。",
    "X58n1031_003:0737a04_0": "內外四大者內謂自他身內所有堅者即毛髮等外謂自他身外所有堅者即土石等地大既爾餘之三大亦然不同者和合與不和合也。",
    "X58n1031_003:0737a07_0": "哀哉寡學異執紛然。",
    "X58n1031_003:0737a08_0": "哀哉悲歎之辭寡者許慎曰少也學者楊雄曰覺也紛然亂貌通而言之少學之人異端妄執紛然而亂故肇公云異端之論紛然久矣或謂通惠云臣實慙寡學空老年齡此乃臣下對天子之謙辭耳。",
    "X58n1031_003:0737a13_0": "寄語道流欲成佛者必須洞明麤細本末方能棄末歸本反照心源。",
    "X58n1031_003:0737a15_0": "寄語道流即學道之流無外亦云寄言後哲宜乎介懷麤細約惑次文辨之本末約教謂棄前二篇之末歸直顯真源之本故云變照心源也。",
    "X58n1031_003:0737a18_0": "麤盡細除靈性顯現無法不達名法報身自然應現無窮名化身佛。",
    "X58n1031_003:0737a20_0": "麤盡細除即起信隨分究竟二覺論云念無住相以離分別麤念相故名隨分覺又云覺心初起心無初相以遠離微細念故名究竟覺靈性即法身故論云法身顯現自然而有不思議業種種之用故云無法不達也法身是理報身是智理智冥合如珠與光即發化用故曰應現無窮矣。",
    "X58n1031_003:0737b03_0": "原人論發微錄(終)",
    "X58n1031_003:0737b07_0": "秀州嘉興縣清風卿青墽鎮居住清信弟子莫侁謹施淨財一十五貫文足開原人論發微錄一卷仍印三十卷捨入本鎮密印寺寶閣講院賢首教藏集茲勝因用答　母親蘇十娘腹有育之恩劬勞之德謹願雲間善住寶閣法孫比丘　晉倦　勾當青墽密印寺傳天台教觀普光大師　道湘勸緣延文三秊(戊戌)十一月八日於東寺西院僧坊寫點訖同十二日一校了。",
    "X58n1031_003:0737b17_0": "杲寶(生五十三)"
}