{
    "X58n0995_010:0251b21_0": "華嚴一乘分齊章義苑疏卷第十",
    "X58n0995_010:0251b23_0": "霅溪普靜沙門　道亭　述",
    "X58n0995_010:0251b24_0": "故此經云至盡義者是也。",
    "X58n0995_010:0251c01_0": "釋曰解前發心功德稱性德而無涯一證一切證故云一切一切如彼下指喻何況下以多法例多喻意顯法無邊而略如其喻也。",
    "X58n0995_010:0251c04_0": "所以爾者至窮終方原始。",
    "X58n0995_010:0251c05_0": "釋曰此顯位上下相即也由是下以法顯人故皆始終一齊耳。",
    "X58n0995_010:0251c07_0": "如上同時至佛者即其事也。",
    "X58n0995_010:0251c08_0": "釋曰初例總顯別又云下引地經與十住偈文皆明相即十信下以人顯法是以賢首品談德業該收故十信道圓一念該於佛地斯之謂歟。",
    "X58n0995_010:0251c11_0": "問如同體至屬因陀羅攝。",
    "X58n0995_010:0251c12_0": "釋曰矧茲同體法既交參義非一準是故炳然齊現猶比芥瓶交映重重若帝珠之互入此是具別門之義也。",
    "X58n0995_010:0251c15_0": "餘義即同至門中亦準思之。",
    "X58n0995_010:0251c16_0": "釋曰此辨本門相即之義仍隨下亦具餘門法本如然非同應化故云舊來如此也。",
    "X58n0995_010:0251c18_0": "問若一門中至攝一切無盡故。",
    "X58n0995_010:0251c19_0": "釋曰此問躡前答辭而起答約隱顯相奪而酬。",
    "X58n0995_010:0251c20_0": "問此同體中至中一切耶。",
    "X58n0995_010:0251c21_0": "釋曰自他之義顯然有異豈有斷自復容於他耶。",
    "X58n0995_010:0251c22_0": "答既攝自至窮其法相也。",
    "X58n0995_010:0251c23_0": "釋曰自他皆攝者窮其緣起方盡難思耳。",
    "X58n0995_010:0251c24_0": "何以故圓融至不可說其邊量。",
    "X58n0995_010:0252a01_0": "釋曰初句徵餘皆釋釋中竝用所因圓融法界者法性融通故無盡緣起者緣起相由故此但論法界等者唯心迴轉故末句結答問宗。",
    "X58n0995_010:0252a04_0": "故此經偈云至俱齊無前後別。",
    "X58n0995_010:0252a05_0": "釋曰初偈約時顯法前三句言時劫不可盡乍可盡第四句正況緣起之法決不可盡也次二偈約依正顯法謂正報眾生心行差別是最難知今亦可知碎利為塵塵不可數此亦可數虗空無邊一毛無間乍以無間之毛端度量無邊之虗空若是菩薩發心功德不可測量良由下出其所以則一證一切證因果該徹故也。",
    "X58n0995_010:0252a12_0": "故地論云至此事不疑。",
    "X58n0995_010:0252a13_0": "釋曰因果不二為大緣起仍以六相融通故自他相即明知下亦因果圓融歷歷齊現故云互為主伴深須下勸誡也。",
    "X58n0995_010:0252a16_0": "又此經云至廣如經文。",
    "X58n0995_010:0252a17_0": "釋曰初發心菩薩與諸如來依正等說法等身量等智慧等度生等又云下略明初心正覺之相也。",
    "X58n0995_010:0252a19_0": "問此等歎因至故非因也。",
    "X58n0995_010:0252a20_0": "釋曰此之問意由前廣歎初發心之功德故以果德例而難之答中以一乘緣起因果同源故因是果家之因得初即得其後也若不得者非果之因非緣起之因也。",
    "X58n0995_010:0252a24_0": "問上言果分至得果法耶。",
    "X58n0995_010:0252b01_0": "釋曰亦由上文因即果故便引果海難思而辨果也。",
    "X58n0995_010:0252b03_0": "答令言作佛至不可說也。",
    "X58n0995_010:0252b04_0": "釋曰此中答意約其三生於第三生因圓果滿猶帶言詮故上廣辨作佛纔臻位極則沒同果海唯證乃知故不可言議此之三生在于一念故清涼云一生不克三生必圓。",
    "X58n0995_010:0252b08_0": "此如龍女至應準思之。",
    "X58n0995_010:0252b09_0": "釋曰示圓機證果也雖女人五障此女乃道成轉身如法華中辨餘皆當經詳矣。",
    "X58n0995_010:0252b11_0": "問上言一念至與彼何別。",
    "X58n0995_010:0252b12_0": "釋曰介爾成佛權實皆宗故成此問。",
    "X58n0995_010:0252b13_0": "答三乘望理至具足一切耳。",
    "X58n0995_010:0252b14_0": "釋曰三乘望理為一念者謂理則頓悟乘悟併消事非頓除因次第盡今此一乘等者謂緣起一念一多混融是故此成即是彼成故與眾生同時作佛言十同時者無盡之時同趣一念故也後皆新新斷惑者舊佛新成促不礙延也亦不住學地而成正覺等者因該果海逆順等者以玄門而狀證相十信終心具諸位者果徹因源也應用六相通之。",
    "X58n0995_010:0252b22_0": "然此一念至自在門訖。",
    "X58n0995_010:0252b23_0": "釋曰一念同劫者延促無礙由法融通故時無盡也直須思之者示勸修忌落其識情耳。",
    "X58n0995_010:0252c01_0": "第四因陀羅至互現重重無盡。",
    "X58n0995_010:0252c02_0": "釋曰此上諸義體相自在等者謂以一事稱性故能攝一切餘法亦皆稱性何有一法而不攝即是故重重互相涉入如天帝殿珠網覆上一明珠內萬像俱現珠珠皆爾此珠明徹互相現影復現影而無窮盡梵云因陀羅此云能天帝十門唯此從喻受名若就法立應名重珠現無盡門。",
    "X58n0995_010:0252c08_0": "故此經云至即三世間也。",
    "X58n0995_010:0252c09_0": "釋曰初偈塵中現諸佛智正覺世間也次偈塵中現佛土器世間也後偈塵中現三道六趣眾生世間也。",
    "X58n0995_010:0252c12_0": "又云一切至無量廣如經辨。",
    "X58n0995_010:0252c13_0": "釋曰初偈主伴同會普法圓彰次偈依正容持分圓無礙末後舉一例餘。",
    "X58n0995_010:0252c15_0": "此等竝是至如量境也。",
    "X58n0995_010:0252c16_0": "釋曰結示本法由法智圓明皆悉無盡也。",
    "X58n0995_010:0252c17_0": "其餘變化至去情思之。",
    "X58n0995_010:0252c18_0": "釋曰其餘變化等者揀三乘應現也何以故下徵釋本法離本法離見超情耳。",
    "X58n0995_010:0252c20_0": "問上一塵至宜準思之。",
    "X58n0995_010:0252c21_0": "釋曰問中約一塵一剎平徧而難答中據塵剎相含重重互徧而說也。",
    "X58n0995_010:0252c23_0": "問若據此文至因陀羅成也。",
    "X58n0995_010:0252c24_0": "釋曰問責瀚漫焉辨始終答藉智成雖重重交涉不礙歷歷齊彰故論主伴耳如上教義等者示法法皆有主伴也及前等者指前二互若乃隱映互現展轉無窮皆此門攝故云皆悉如是等。",
    "X58n0995_010:0253a04_0": "五者微細相容至無不明了。",
    "X58n0995_010:0253a05_0": "釋曰炳然同時齊現等者炳明也如瑠璃瓶盛多芥子隔瓶頓見然微細者總有三義一所含微細猶如芥瓶如毛孔能受彼諸剎諸剎不能遍毛孔故以毛據稱性却如瑠璃之瓶剎約存相故如芥子在內二約能含微細以一毛一塵即能含故如下引經證三約難知微細微塵不大而剎不小而能廣容即難知義一能含多即曰相容又法法皆爾故云相容一多不壞故云安立。",
    "X58n0995_010:0253a13_0": "猶如束箭至可如理思之。",
    "X58n0995_010:0253a14_0": "釋曰菩薩於一念中從兜率天等者即如十微細中八相之中一一各具餘之七相之義又云下依正相含炳然之相故皆言安住也。",
    "X58n0995_010:0253a17_0": "問是義與上至宜細思之。",
    "X58n0995_010:0253a18_0": "釋曰此之答意但以諸法同時相容顯現與展轉攝入重重故分二玄之別更無別義也。",
    "X58n0995_010:0253a20_0": "六者秘密隱顯至俱時成就也。",
    "X58n0995_010:0253a21_0": "釋曰此上諸義隱覆顯了者謂一事能攝彼多則一顯多隱一切攝一事則一隱多顯二隱不俱二顯不竝隱顯顯隱同時無礙故曰俱成。",
    "X58n0995_010:0253a24_0": "故此經云至秘密授記等。",
    "X58n0995_010:0253b01_0": "釋曰於此方入正受為顯他方三昧起為隱以此但入定不見起故眼根入正受即是顯色塵三昧起即是隱下之隱顯例可知矣然茲隱顯皆就二法形對言之應成多對一此彼方隅對二根塵能所對三男女左右對四塵毛依正對五往返度生對六現滅流通對七顯授冥記對此上多對皆顯密同時無有前後耳。",
    "X58n0995_010:0253b08_0": "如上第一至此準思之。",
    "X58n0995_010:0253b09_0": "釋曰一中多顯故一錢中十錢為顯了多中十隱故第二錢望第一錢中十即為秘密何以故下徵釋隱顯則見此不見彼彼名隱此名顯亦如一人身上六親所望雖各不同然各全得亦不雜亂由此隱顯體無前後不相妨礙名秘密俱成問此隱顯門與前相入相即何別耶答若攝他他現是相入門若攝他他不現即相即門若攝他他不盡不現即隱顯門故如八夜月晦明相竝隱顯同時矣。",
    "X58n0995_010:0253b17_0": "第七諸藏純雜至故名為雜。",
    "X58n0995_010:0253b18_0": "釋曰初標名次釋義若以人下釋純又即下明雜斯二同時故云具德。",
    "X58n0995_010:0253b20_0": "又如菩薩至俱時成就也。",
    "X58n0995_010:0253b21_0": "釋曰此約古立如一施行一切皆施名純施中具於諸行名雜即事事無礙新云廣陿以大師意云萬行純雜有通事理無礙及單約事說故廢之可謂同一法界故純不壞事相故雜此即事理無礙也一行長行故純不妨餘行故雜此但約事也故昔廢之而立廣陿若欲會取即事同理而徧故純不壞一多故雜即亦有事事無礙義耳如上人門取者是也玅嚴品說諸眾生海各各唯得解脫門純也普賢菩薩得不思議解脫門雜也又如善財所求諸善知識各言我唯知此法門純也皆推進云如諸菩薩種種知見種種修行種種證得者此雜門也自言知一推他有多自他雖異然屬一身此亦純雜無礙門也。",
    "X58n0995_010:0253c10_0": "如是繁興至宜準思之。",
    "X58n0995_010:0253c11_0": "釋曰緣起無涯普周法界純一無二各不壞本位故曰無不具足者矣。",
    "X58n0995_010:0253c13_0": "八者十世隔法至不相離故。",
    "X58n0995_010:0253c14_0": "釋曰三世區分名為隔法而互相在即是異成此上諸雜義徧十世中者以時無別體依法以立法既無礙時亦如之同時者一念之總別異者九世之別以時下出十世融通所以如見華開知是芳春茂成結果知是朱夏凋落為秋收藏為冬皆因於物知四時也今時相入知法之融通故不相離。",
    "X58n0995_010:0253c20_0": "言十世者至得即入也。",
    "X58n0995_010:0253c21_0": "釋曰各有過去等者取意以立即離世間品意文云菩薩有十種說三世何等為十所謂過去說過去過去說現在過去說未來現在說過去現在說平等現在說未來未來說過去未來說現在未來說無盡為九世又三世說一念即是總句言無盡即未來未來欲彰無窮故云無盡現在平等即現在現在謂現在可以目覩例同過未故云平等不言一念亦名九世攝歸一念故云十世總別相資互為緣起。",
    "X58n0995_010:0254a06_0": "故此經云至渾融成矣。",
    "X58n0995_010:0254a07_0": "釋曰念劫圓融延促無礙故經偈云無量無數劫解之即一念知念亦無念如是見世間又十地品第十地云菩薩知種種入劫智所謂一劫入多劫多劫入一劫乃至云長劫入短劫短劫入長劫等此亦以時而顯智也思之。",
    "X58n0995_010:0254a12_0": "又此經云至廣如經文。",
    "X58n0995_010:0254a13_0": "釋曰引此諸經意顯時處無礙初塵現時剎二塵現時眾三塵現時化事四塵中轉無盡法輪。",
    "X58n0995_010:0254a15_0": "此普攝上至宜可思之。",
    "X58n0995_010:0254a16_0": "釋曰結前十對之法與十世而融通者矣。",
    "X58n0995_010:0254a17_0": "九者唯心迴轉至故異三乘耳。",
    "X58n0995_010:0254a18_0": "釋曰言唯是一如來藏清淨心轉者謂心能變境境須似心心既無礙境亦無礙況真心所現揀異妄心故言清淨真法具德故能即入重重無礙故云但性起具德異三乘耳然此一門雖異三乘葢宗因亦舉猶有帶理之言故大師新改為主伴圓明具德門移此迴心為立門之所以。",
    "X58n0995_010:0254a24_0": "然一心亦具足至等者即其事也。",
    "X58n0995_010:0254b01_0": "釋曰十心之義如心識中辨。",
    "X58n0995_010:0254b02_0": "所以說十者至無窮種種德耳。",
    "X58n0995_010:0254b03_0": "釋曰結德彰圓重重無盡也。",
    "X58n0995_010:0254b04_0": "此上諸義門至宜思釋之。",
    "X58n0995_010:0254b05_0": "釋曰指法唯心出宗所以不可率情故宜思擇。",
    "X58n0995_010:0254b06_0": "十者託事顯法至一切法門。",
    "X58n0995_010:0254b07_0": "釋曰謂見一事即是見於無盡法界非是託此別有所表故金色世界即是本性彌勒樓閣即是法門勝熱婆羅門火聚刀山即是般若無分別智等故曰別顯別法者也。",
    "X58n0995_010:0254b11_0": "如此經中至如經思之。",
    "X58n0995_010:0254b12_0": "釋曰雲標十種表法乃三雖上諸義即是等盡法界但隨一義以名目之如顯可重圓明即名為寶稱性自在即稱為王無心霑潤即名雲等齗齶者謂雲之騰貌為霑潤之根。",
    "X58n0995_010:0254b16_0": "問三乘以有至宜可如理思之。",
    "X58n0995_010:0254b17_0": "釋曰初問二答答中三乘託異事相表顯異理等者謂三乘中衣表忍辱室表慈悲等今此一乘所託之事等者謂今明一事即法即人即依即正具無盡德從無盡因之所生故。",
    "X58n0995_010:0254b21_0": "此上十門等至大見聞心中。",
    "X58n0995_010:0254b22_0": "釋曰融成一致成大緣起也言十門與本文十義皆悉同時者謂每一門既帶同時等十門具此十門皆各具教義等十義一門既爾門門皆然重重取之乃至無盡故成緣起普眼境界言諦觀察等者約智修入則無心體極無間常行一生不克三生必圓斯之謂矣。",
    "X58n0995_010:0254c04_0": "然此十門至緣起義耳。",
    "X58n0995_010:0254c05_0": "釋曰初諸門相攝二六相圓融三結歸一乘言隨一門即攝餘門者此雖相攝不俱次緒乃依至相也以大師新立有次第故一同時具足相應門以是總故冠於九門之初二廣陿門別中先辨此者是別門之由由上事理無礙中事理相徧故生下諸門且約事如理徧故廣不壞事相故陿故為事事無礙之始三由廣陿無礙所徧有多以己望多故有一多相容相容則二體俱存但力用交徹耳四此容彼彼便即此由此徧彼此便即彼等故有相即門五由互相攝即互有隱顯謂攝他他可見故有相入門攝他他無體有相即門攝他他雖存而不可見故有隱顯門以為門別故此三門皆由攝而有相入則如二鏡互照相即則如波水相收隱顯則如日月相暎六由此攝他一切齊攝彼攝亦然故有微細相容七由互攝重重故有帝網無盡八由既如帝網隨一即是一切無盡故有託事顯法九由上八皆是所依所依之法既融次辨能依能依之時亦爾故有十世門十由法法皆然故隨舉其一則便為主連帶緣起便有主伴門此據新立故改門而次緒有異於古也非謂古失葢欲學者展轉精明耳。",
    "X58n0995_010:0255a02_0": "又於其中至境界準思之。",
    "X58n0995_010:0255a03_0": "釋曰揀[((冰-水+臨)-品+口)/皿]指文護一乘故也言與彼三乘或同或異者謂法相有通一乘有局三乘略如一乘中辦所設等者且三乘名教但為一乘之先客廣如經論疏鈔者以大師凡著義疏數本皆明權實不能備舉孔目及問答通至相述作亦三一甄分故次云全別不同宜可廣依等者勸示修學令不混通規耳。",
    "X58n0995_010:0255a10_0": "問此上道理至對比決之。",
    "X58n0995_010:0255a11_0": "釋曰初引經正答良由下出聖意也。",
    "X58n0995_010:0255a12_0": "又偈云至佛法一乘也。",
    "X58n0995_010:0255a13_0": "釋曰據經定義參以四乘權實顯矣次下原佛本意云。",
    "X58n0995_010:0255a15_0": "由此一乘至三身等佛。",
    "X58n0995_010:0255a16_0": "釋曰良以法門高玅權小難窺故隱實施權未稱本懷權現身相此明偈中三乘之義也。",
    "X58n0995_010:0255a18_0": "今為如是至無盡佛法也。",
    "X58n0995_010:0255a19_0": "釋曰圓根叩擊利見大人故現無盡身雲演難思之法義此明偈中一乘之義故結云名現佛身說無盡也。",
    "X58n0995_010:0255a22_0": "三乘但隨機至為實德耳。",
    "X58n0995_010:0255a23_0": "釋曰三乘但隨機者逐機末教也未顯諸佛十身等者非稱性本教也然此三乘既不稱性縱爾終談亦是設化隨機未亡形對故云非窮盡說也何以故者徵徵云焉知三乘不談無盡耶故釋云三乘以此無窮為過失故返顯一乘宗無盡德也故知他宗爾爾三千猶存限量亦屬三乘。",
    "X58n0995_010:0255b05_0": "又此經云至驚怪者矣。",
    "X58n0995_010:0255b06_0": "釋曰此通疑難也惑者云既言一乘以無窮為實德何以經中有談二三等諸乘耶故此釋云此據本末分齊說耳何故如斯且非本無以垂末非末無以顯本本末齊彰方窮無盡是故海印炳現斯之謂歟題稱一乘教義分齊却備談一代教跡三藏微言者正是斯意學者知趣莫驚怪應以虗心體茲宗極耳。",
    "X58n0995_010:0255b13_0": "第四六相圓融至三問答解釋。",
    "X58n0995_010:0255b14_0": "釋曰六相之義本出地經世親菩薩以論開闢故論云一切所說十句中皆有六種差別相門清涼釋云此乃標舉顯通謂法之體狀目之為相義別為門又由此通入證智中故論又云此言說解釋應知除事者清涼云此顯立意謂此六相為顯緣起圓融之法勿以陰界入等事相執取意不令人隨事執取非除界不具六相也故云六相緣起大師立意亦然但文小異耳。",
    "X58n0995_010:0255b22_0": "初列名者至不移動故。",
    "X58n0995_010:0255b23_0": "釋曰列名略釋先須總識其相列名是論文為論中釋義隨經義門難見是故大師約通義略釋言別依止總滿彼總故者謂依一開九無總別不立故云依止由別方成總故云滿彼清涼云總則攬別而成別分總為別同則別別帶總異則別別互乖成則雙攬同異方成若無同異總相不成故如舍椽梁總皆相似終不成舍壞則唯別各住自性故又壞者猶如世界多緣共成其中事物一一推徵何者是界名壞。",
    "X58n0995_010:0255c08_0": "第二教興意者至陀羅無窮理事等。",
    "X58n0995_010:0255c09_0": "釋曰教興意者約教道解釋故此教下彰其德用由六相之圓融耳。",
    "X58n0995_010:0255c11_0": "此義現前至便成正覺。",
    "X58n0995_010:0255c12_0": "釋曰此義現前者謂六相緣起法智融通則不見一法當情故一斷一切斷法混時融故得九世十世或滅或亡智顯智與理而齊彰故初心正覺攝多劫於剎那十信道圓一念該於佛地。",
    "X58n0995_010:0255c16_0": "良由如是至華嚴經說。",
    "X58n0995_010:0255c17_0": "釋曰良由者出前道成之相束為因果二門故曰因即普賢果即十佛等。",
    "X58n0995_010:0255c19_0": "第三問答至就緣成舍辨。",
    "X58n0995_010:0255c20_0": "釋曰以喻總釋也一切處通者但有形量法皆具六相或曰既言一切法皆具六相此緣成舍豈非法耶何以喻釋答據舍是法亦緣起故今言喻者仗此曉餘故屬其喻耳下多不釋準此知之厥或義難見所由請撿前因緣起。",
    "X58n0995_010:0256a01_0": "問何者見總至即得舍矣。",
    "X58n0995_010:0256a02_0": "釋曰言為椽全自獨能作舍者即互偏相資義謂此椽等諸緣要互相偏應方成緣起如一椽偏應多緣各與彼多緣全為椽故此則一椽具多椽也若此一椽不具多緣則資應不徧不成緣起。",
    "X58n0995_010:0256a06_0": "問若椽全自獨至不名為椽。",
    "X58n0995_010:0256a07_0": "釋曰躡前為難難以孤單答以因緣何乖椽舍。",
    "X58n0995_010:0256a08_0": "問若椽等至少力並全成也。",
    "X58n0995_010:0256a09_0": "釋曰此重問答據力用義以顯之謂須一全有力餘緣無力若餘有力一緣定無力方成舍耳故不可各出少力是故少力成過也言故知非少力並全成也者結少力之非顯一椽全有力之是也。",
    "X58n0995_010:0256a13_0": "問無一椽時豈非至餘椽例然。",
    "X58n0995_010:0256a14_0": "釋曰言答總並是椽者謂攬別成總舉一椽之總故力貫諸緣也若去於椽即舍便壞瓦等亦壞故此諸緣皆即是椽舍方善成一緣既爾餘亦然。",
    "X58n0995_010:0256a17_0": "是故一切至一切處準知。",
    "X58n0995_010:0256a18_0": "釋曰是故下結成緣起謂此大緣不起則止而不論若起則圓融離識耳。",
    "X58n0995_010:0256a20_0": "第二別相者至以此方便會一乘。",
    "X58n0995_010:0256a21_0": "釋曰此頌分句前六句每句一相第七句揀非識情最後一句依修而證良由攬別成總故云一即具多分總為別故多即非一諸緣各別而成力義齊故多類自同諸緣隨自形類功能各別故各體別異由此異故方顯前同也同異雙資義理出於思識方成總舍故云一多緣起理妙成也雖成一總且不失諸緣故各住自法然此六相為顯緣起圓融之法大智造之無涯故云唯智境界勿以陰界入等事相執取故曰非事識依此緣起因修證于果海故云以此方便會一乘問此之義理分齊與夫大疏義理分齊同耶異耶答旨趣雖同建立有異故彼所依體事同此立義門攝歸真實同此二義相收一性無二等彰其無礙同于三性交參周徧含容全同解釋建立異者爰大疏宗終南三觀故止于斯此章乃該羅眾義本末齊彰故三性攝餘宗六因收權淺若爾一乘之旨豈殊途耶答彼克一經此就判教是故克經則三觀澄明判教則旁該餘義然後融歸圓實未來通規一代教興海印斯現耳。",
    "X58n0995_010:0256b16_0": "偈辭述意迴向。",
    "X58n0995_010:0256b17_0": "　一乘妙法難承受　　曠劫難逢今幸偈　大師法義綺成章　　數百年餘孰分剖　我今輙以凡心智　　啟廸無邊無上義　迴茲功德霑含靈　　同趣菩提實際地華嚴一乘分齊章義苑疏卷第十(畢)義苑後序教章義苑疏者廓具德之宗剖法義之判是以宗之為德為實趣之為本為融注之而十宗備矣若夫未明空有之朕本絕理事之蹤十佛自知法本然爾雜華果分不可說者法也暨于因門緣起分齊具彰攝義從名五門等異判之為五教分之為大小推之為權實定之為頓漸融之為同別一代聖言三藏正典區矣別矣雜華因分可說者斯之義歟尋斯宗旨却覧餘乘起信守宗者自可知耳是則三卷之書十章之義會經故不同乎經辨律故不同乎律扸論故不名乎論飄飄然但總相彰明遂云章也上云以此章釋無盡章者此也既不牒文箋釋故不云疏及其義苑之解搜義會教會宗搜文故例如孔目之與攝論宗輪之與毗曇搜義故略如一乘之與化儀六因之與三性引而伸之足而補之精義見矣然後會諸師之得失定的判之名立決擇部異之宗使相從於有則對明二祖宗義出意會之無違克義箋文得旨繄表濫觴釋決擇流通稱之曰疏余竊恐淺學不曉分齊云章義苑曰疏故復書之于卷末。",
    "X58n0995_010:0257a02_0": "元祐五年五月五日無為楊傑於姑蘇行舟序朝請郎差充淮南路安撫司主管機宜文學差浙西買軍需錢　仲[席-廿+禺]　捨錢壹佰貫文刊華嚴經義苑疏第十卷功德上薦　先考參政大資太師文惠溫國公　先妣秦國太夫人季氏　伴薦　亡室安人陳氏　亡次男通仕郎錢　紹修　超昇　天界旹嘉定二年上元日鳥鎮普靜寺僧淨覺募緣重開"
}