{
    "X62n1172_001:0032a03_0": "淨土晨鐘自序",
    "X62n1172_001:0032a05_0": "戊巳之交予輯金剛法華持驗諸紀又以佛法中最簡捷而通貫者莫如淨土一門因取古今之書表章是教者裒其精要類而編之曰晨鐘意欲用世人之朝氣警甜夢者而鼓鐘之焉耳冬初書成予不揣竊取名賢論述之意而為之序序曰。",
    "X62n1172_001:0032a10_0": "如來為一大事因緣出現于世大事者何生死是也如來憫眾生沉迷而指以出離之途即示以遄歸之所曰大慈曰能仁以其仁慈我眾生而名之也允哉乃眾生不自仁慈其身畢世沉迷以悖如來之教茫茫生死波中淵深而海濶周行震旦都如過銅人沒處頭髻長出嗟嗟有聲不亦哀乎今夫人之朝而必夕也暑而必寒也幼而必壯壯而必老老而必死也自古及今如是苟夫人之朝而不為夕謀暑而不為寒謀必群誚其愚獨自幼至壯且老而濵死不知為之謀其愚不又甚乎然人之不知謀死也非昏而忘之則畏而諱之耳忘之而卒至諱之而終不我貸則雖欲忘且諱之而庸可得耶且人之畏死又非真能畏死者也當其驀焉而生蠢焉而長頹焉而老以死栩栩焉蘧蘧焉而愛河慾海之溺人無已時名利韁鎻之牽人無已時一旦灰寒火傳薪換臨了一局誰人能免自茲以往滅滅生生六道三途如轉轆轤又誰人能免跡其所為日相尋于生死之業而不求解脫之方謂之愍不畏死可也真能畏死者必求解脫生死之方求解脫則舍念佛何途之從舍淨土吾誰與歸念佛生淨土則得解脫得解脫則超然生死之外亦翛然生死之中而又何死之足畏是能真畏死者也是能畏死謀死而終得無畏者也是能了當大事者也是能不悖大慈能仁之教者也夫世人而可免夫生死則已世人而不免夫生與死也則淨土之業其可以不修而是書其可以弗讀也哉。",
    "X62n1172_001:0032b11_0": "或曰淨土人人可修則了當生死之法顧若是易乎曰中庸言達道達德舉生知安行而繼以學困勉強成功之一以聖凡無殊性故故孟子又曰道一可見此法非難非易其實人人可為即經所謂眾生是淨土及眾生煩惱心中皆具如來德相是也般若經云滅度無量眾生實無眾生得滅度者葢度人只在自度內修淨土法門者雖止自度而使人皆學此法門自度其為度人也不既多乎故未悟者勿論即已悟而必自我度人其度也小我不必作度人相而即以自度者度人其度也太度而無度般若所云旨不出此然則論淨土者曰欲度眾生必先自度猶止說得一半。",
    "X62n1172_001:0032b23_0": "或曰今人喜談即濁即淨不如捨濁取淨之有實益是圓不如別乎曰念佛門中諸根畢攝理悟同歸能捨濁取淨而即濁即淨之理亦具其中圓莫圓于是故即濁即淨之說尚是假圓而此淨土之圓為真圓或曰惟心淨土之說誠謬乎曰否究竟只是惟心淨土書中千萬語無非欲人歸依佛歸依佛無非心即佛耳蓮師最駁撥土言心之說而曰一心不亂是阿彌陀經之訣是心是佛是心作佛是觀經之訣可知心佛合一故能一心不亂不亂之心即是作佛之心即是無住平等之心即是惟心淨土之心故維摩經云欲得淨土但淨其心真鐵板語不容顛撲也。",
    "X62n1172_001:0032c10_0": "或曰然則古今諸大知識痛辨惟心之說者非歟曰否從來言者之失徒在空談此心耳不思惟心淨土不可說現成空頭話須有修為工夫在念佛求生淨土正是修悟自性惟心之工夫處也此方念佛淨土華鮮念佛心弛淨土華萎鮮萎一由佛之念與不念念佛須是心念安得謂惟心之說之有謬乎故凡執心而議土與夫執土而議心其失均也大梅云任伊非心非佛我只是即心即佛吾亦曰任伊非心非土我只是即心即土請即以質之蓮池龍舒諸老何如若云此亦是隨人脚下盤旋語則宜一併掃去道不是不是。",
    "X62n1172_001:0032c21_0": "觀經以十六觀為正因而又言三福三種心等都不復及修觀以方便多門六度萬行皆可回向西方故又末法般舟三昧經先滅無量壽經更留蓮池謂稱名易學觀想難成般舟先觀足輪亦觀經類耳而六字稱名則三尺童子辨之故無量壽經偏救末世由是觀之如來設教不可謂不寬淨土之門不可謂不廣獨稱名一法簡要可以通行故古今尊宿往往單提此門耳。",
    "X62n1172_001:0033a05_0": "須知理外無事淺外無深故利鈍兼收非難非易若會事歸理則三福等俱入實相即是妙觀即稱名與觀想非屬二心其歸亦一且法何有末末法云者人末之世末之也先滅云云者或預懸以示儆欲不以世與人之末而末法耳非為是便當舍難趨易也但學者從一門而入專勤為之淨業自成不可于同堂中自生秦越崇此而抑彼。",
    "X62n1172_001:0033a12_0": "是故有理而無事者非法之至是境而非心者非法之至可深而不可淺可別而不可圓者非法之至可權而不可實可聖而不可凡可自為而不可與人共為者均非法之至且而學無生即無滅生與死二乎了妄即真真與妄二乎溪山異而明月同禪與淨二乎即十萬億國土而彈指可生遠與近二乎以足指按地而成金色世界娑婆與極樂二乎難勝何非清泰之鄉瞿曇得無法藏之後釋迦與阿彌二乎常寂光中遍包三土而土土相資同居與寂光二乎法之至者聖凡一也物我一也理事心境一也深淺一也權實一也別圓一也以至一死生一真妄一禪淨一遠近一釋迦彌陀一娑婆極樂一同居寂光夫是之謂一心不亂。",
    "X62n1172_001:0033b01_0": "果能依是真實做去始也攝心而念佛念佛則心自淨心淨則土隨淨大惠禪師云人于一日中心不馳求不妄想不緣諸境便與三世諸佛諸大菩薩相契即此火宅塵勞便是解脫出三界之處修淨土者宜亦如是靠住一佛心心無間行之既久便可將四大所合之身一拳粉碎四大所合之世界一脚踢翻然後隨所聞見鳥語蟬吟牧歌樵唱即西方之無常苦空法音天樂也竹籬茅葢即西方之金臺樓閣也飛泉鳴瀨即西方之寶池德水野芳嘉木即西方之寶網交羅妙華天雨也明師良友之儔木石鹿豕之侶即西方之諸上善人也何苦何樂何須何逆何邪魔何三毒等煩惱目前純是淨土則未來之決定往生可知到得厭世時無怖無亂不支不吾怡然拱手歸來故鄉不必問此際佛來迎與否能預知時日否聞異香奇樂否總是生平得力處到此決用得着決有好消息上品上生無疑也雖然此等曉曉皆為未看破人打之遶耳人但看得破守得定時凡苦樂淨穢疑信辨難紛紛之說且教一筆勾却如何。",
    "X62n1172_001:0033b19_0": "順治己亥陽月陽羨淨業弟子周克復盥沐謹譔淨土晨鐘目錄卷第一晨課觀經上品上生章般若波羅蜜多心經楞嚴大勢至念佛章(念佛願文禮拜三歸俱同夕課)夕課佛說阿彌陀經往生淨土呪念佛文(禮拜三歸)又慈雲願文善導臨睡入觀文原始一阿彌陀佛成佛阿彌釋迦分現淨穢佛為韋提希說淨業九品往生佛為父王說念佛龍樹菩薩勸念佛念佛十種功德淨土往生之因阿彌度生之因釋迦勸人念佛之因釋迦開導淨土之因四土往生本末三界六道輪迴本末卷第二啟信二淨土有益生前淨土不妨俗事淨土佛無妄語淨土一念必生淨土脚踏實地淨土非仙可比淨土因果不妄淨土如明鏡日月淨土正信為要淨土該戒定慧淨土獨推阿彌淨土苦樂相比淨土為難信法淨土了生死淨土念佛有力淨土諸聖尊宿同歸卷第三勸修三勸急辨大事勸活物活計勸神隨業往勸兜率不如西方勸宿債須還富貴易墮勸為身後計勸佛心為心勸隨遇隨勸勸出世間孝勸人人念佛勸真實念佛勸學者念佛卷第四念佛法門四十聲念佛誦偈十氣十念六時晨昏念佛懺罪念佛一相念佛攝心調息念佛參禪念佛總論持名念佛總論念佛事理一心禮念觀想觀想佛毫一心三觀念佛論約心觀佛論一心三觀論圓修三觀生四淨土卷第五功行法門五孝養父母慈心不殺持戒十善發菩提心讀誦大乘淨心行善奉行眾善布施(以上正因)方便廉儉不妄取財省口腹淫慾兼福慧不慕尊榮不辭輕蔑禮懺施食放生居官(以上助修)卷第六策進六策願力策勇猛精進策攝心悟心策三種念佛策出家策在家策老者病者卷第七飭終七飭臨終往生正念飭臨終三疑四開飭十念往生飭父母往生飭眷屬往生飭護病者飭自念佛度冤親飭臨終請眾念佛飭未終思終卷第八正辨八辨生淨土救眾生辨見性悟道辨不修淨土五惑辨禪淨同歸辨念佛有益參禪辨禪宗淨土遲速辨得悟正宜往生辨心境非二辨淨土專志西方辨念佛修觀非着相辨念佛不可輕視辨參究念佛辨念佛融通宗教辨念佛心性身名辨理事非二心辨宜繁宜簡辨往生早暮辨一念往生辨念力重大辨業性本空辨心量廣大淨土非遠辨自心佛現辨不往而往無生而生辨欣厭取捨辨不信佛論附佛入中國考卷第九了俗九了色身之妄(如二顏丙文○無着○身有真假○齊生死○用形骸得失)了世染之妄(輪迴根本○蛇喻○對境○真空○四窮民○今日方間○出家後出家○悟後有修)了富貴之妄了浮生之妄了生死之妄(獄喻○防死○勾當自家事○醉生夢死○徹悟○生死根本)了物緣之妄(六根○五蘊皆空○真性○廢心用心)了心念之妄了邪教之妄(附寄庫○念經)卷第十持驗十比丘往生(慧遠○慧永○曇順○僧叡○曇恒○道昞○道敬○慧恭○慧虔○曇鑒○慧光○道珍○曇鸞○智者大師○道喻○善導和尚○法照○少康○懷玉○道綽○惟岸○僧衒附啟芳圓果○懷感○辨才○大行○明瞻○智覺禪師○志通○悟恩○省常○遵式懺主○宗坦疏主○子元○法持○基法師○若愚○宗賾○知禮○有巖○智廉○懷義○宗本○元照○慧亨○智圓○可久○明本○善住○瑩珂○惟則○普度○楚琦○祖香○蓮大師○黃州僧○海寶)宰官往生(劉程之○張野○王仲回○馬子雲○白居易○張迪○王龍舒○葛蘻○胡闕○楊傑○文彥博○馬玗○鍾離瑾○閻邦榮○咎定國○馮楫○王敏仲○吳子才○蘇軾○朱綱○顧寶幢○朱元正○丁明登○唐時○附辨融覺浪余大成)士民往生(門公則○周續之○孫良○庾銑○宋滿○王闐○范儼○孫忠○沉銓○計公○金奭○劉通志○唐廷任○楊嘉禕○郭熙載○戈以安○孫大玗)尼僧往生(大明○淨真○悟性○能奉○法藏)婦女往生(隋后○葛濟之妻○姚婆○溫諍文妻○鄭氏○王氏夫人○馮氏夫人○陸氏宜人○樓氏○秦氏○鄭氏○于媼○方氏○薛氏○張母○孫氏母○徐氏○楊選一妻○湯公甫母)惡人往生(張善和○雄俊○仲明○吳瓊○陳企○附俘囚)物類往生(鸚鵡○鴝鵒○雞○蛇○又雞)淨土晨鐘目錄(終)勸流通淨土晨鐘引經典所在流通即屬善緣福報無量故語云能以大乘法傳一人者當十善傳十人者當百善傳大貴人大豪傑大力量者當千善重刊廣布者當萬善況淨土法門超出生死輪迴永不退轉直至成佛而後已是勸一人修淨土乃成就一眾生作佛也凡作佛者必度無量眾生彼所度之眾生皆由我而始其福報信不可窮盡故欲勸一切見者聞者廣大其心以佛之心為心使人人知之而盡生淨土龍舒所言自宜諦信不誣至法華華嚴二經尤佛說妙法中之最上乘觀音大士普度世間無剎不現往賢感通事跡歷&#;昭然各為纂集以勸進修斯誠鈴鐸方來津梁末路之最方便門也戊戌秋予輯金剛持驗已有流通小引敬懇同人茲刻淨土法華華嚴觀音持驗諸紀搜採載籍徵信古今頗殫心手之微勞用志歸依於不朽但拙刻板在此地未能廣傳他省既並生莊嚴佛土之中安可缺法事流通之勝復告當世善信獲見諸本不吝廣為刻施或仍原本或易新編其見聞欣及有關持驗者尤冀續緝於後一句讚揚即是一句獲持善根一念鼓動即是一念消弭罪業於以續佛慧命自利利他所謂護法諸神既護法寶自護弘法載寶之人斷斷不爽昔賢為劈窠圖勸人念佛後以他人念佛多生淨土乃歸功施圖之人亦得生淨土法施功德不可思議如是願與同人共勗之。",
    "X62n1172_001:0035c04_0": "同善道人　克復　敬懇",
    "X62n1172_001:0035c07_0": "淨土日誦晨課",
    "X62n1172_001:0035c09_0": "淨業弟子　周克復　敬訂",
    "X62n1172_001:0035c10_0": "南無本師釋迦牟尼佛(三稱)",
    "X62n1172_001:0035c11_0": "開經偈",
    "X62n1172_001:0035c12_0": "　無上甚深微妙法　　百千萬劫難遭遇　我今見聞得受持　　願解如來真實義佛說觀無量壽佛經(上品上生章)佛告阿難及韋提希上品上生者若有眾生願生彼國者發三種心即便往生何等為三一者至誠心二者深心三者迴向發願心具三心者必生彼國復有三種眾生當得往生何等為三一者慈心不殺具諸戒行二者讀誦大乘方等經典三者修行六念迴向發願願生彼國具此功德一日乃至七日即得往生生彼國時此人精進勇猛故阿彌陀如來與觀世音大勢至無數化佛百千比丘聲聞大眾無量諸天七寶宮殿觀世音菩薩執金剛臺與大勢至菩薩至行者前阿彌陀佛放大光明照行者身與諸菩薩授手迎接觀世音大勢至與無數菩薩讚歎行者勸進其心行者見已歡喜踴躍自見其身乘金剛臺隨從佛後如彈指頃往生彼國生彼國已見佛色身眾相具足見諸菩薩色相具足光明寶林演說妙法聞已即悟無生法忍經須臾間歷事諸佛遍十方界於諸佛前次第受記還至本國得無量百千陀羅尼門是名上品上生者。",
    "X62n1172_001:0036a08_0": "般若波羅蜜多心經",
    "X62n1172_001:0036a09_0": "觀自在菩薩行深般若波羅蜜多時照見五蘊皆空度一切苦厄舍利子色不異空空不異色色即是空空即是色受相行識亦復如是舍利子是諸法空相不生不滅不垢不淨不增不減是故空中無色無受想行識無眼耳鼻舌身意無色聲香味觸法無眼界乃至無意識界無無明亦無無明盡乃至無老死亦無老死盡無苦集滅道無智亦無得以無所得故菩提薩埵依般若波羅蜜多故心無罣礙無罣礙故無有恐怖遠離顛倒夢想究竟涅槃三世諸佛依般若波羅蜜多故得阿耨多羅三藐三菩提故知般若波羅蜜多是大神呪是大明呪是無上呪是無等等呪能除一切苦真實不虗故說般若波羅蜜多呪即說呪曰。",
    "X62n1172_001:0036a22_0": "揭諦揭諦波羅揭諦波羅僧揭諦菩提薩婆訶楞嚴大勢至菩薩念佛章大勢至法王子與其同倫五十二菩薩即從座起頂禮佛足而白佛言我憶往昔恒河沙劫有佛出世名無量光十二如來相繼一劫其最後佛名超日月光彼佛教我念佛三昧譬如有人一專為憶一人專忘如是二人若逢不逢或見非見二人相憶二憶念深如是乃至從生至生同於形影不相乖異十方如來憐念眾生如母憶子若子逃逝雖憶何為子若憶母如母憶時母子歷生不相違遠若眾生心憶佛念佛現前當來必定見佛去佛不遠不假方便自得心開如染香人身有香氣此則名曰香光莊嚴我本因地以念佛心入無生忍今於此界攝念佛人歸於淨土佛問圓通我無選擇都攝六根淨念相繼得三摩地斯為第一。",
    "X62n1172_001:0036b13_0": "念佛文願文禮拜三皈俱同夕課如在家人不能全誦或晨夕專持阿彌陀經往生呪佛號如夕課儀亦可淨土夕課南無蓮池海會佛菩薩(三稱)　無上甚深微妙法　　百千萬劫難遭遇　我今見聞得受持　　願解如來真實義佛說阿彌陀經如是我聞一時佛在舍衛國祗樹給孤獨園與大比丘僧千二百五十人俱皆是大阿羅漢眾所知識長老舍利弗摩訶目犍連摩訶迦葉摩訶迦旃延摩訶俱絺羅離婆多周利槃陀伽難陀阿難陀羅睺羅憍梵波提賓頭盧頗羅墮迦留陀夷摩訶劫賓那薄拘羅阿菟樓馱如是等諸大弟子并諸菩薩摩訶薩文殊師利法王子阿逸多菩薩乾陀訶提菩薩常精進菩薩與如是等諸大菩薩及釋提桓因等無量諸天大眾俱爾時佛告長老舍利弗從是西方過十萬億佛土有世界名曰極樂其土有佛號阿彌陀今現在說法舍利弗彼土何故名為極樂其國眾生無有眾苦但受諸樂故名極樂又舍利弗極樂國土七重欄楯七重羅網七重行樹皆是四寶周帀圍繞是故彼國名為極樂又舍利弗極樂國土有七寶池八功德水充滿其中池底純以金沙布地四邊階道金銀琉璃玻瓈合成上有樓閣亦以金銀琉璃玻瓈[王*車]璖赤珠瑪瑙而嚴飾之池中蓮華大如車輪青色青光黃色黃光赤色赤光白色白光微妙香潔舍利弗極樂國土成就如是功德莊嚴又舍利弗彼佛國土常作天樂黃金為地晝夜六時雨天曼陀羅華其土眾生常以清旦各以衣裓盛眾妙華供養他方十萬億佛即以食時還到本國飯食經行舍利弗極樂國土成就如是功德莊嚴復次舍利弗彼國常有種種奇妙雜色之鳥白鶴孔雀鸚鵡舍利迦陵頻伽共命之鳥是諸眾鳥晝夜六時出和雅音其音演暢五根五力七菩提分八聖道分如是等法其土眾生聞是音已皆悉念佛念法念僧舍利弗汝勿謂此鳥實是罪報所生所以者何彼佛國土無三惡道舍利弗其佛國土尚無惡道之名何況有實是諸眾鳥皆是阿彌陀佛欲令法音宣流變化所作舍利弗彼佛國土微風吹動諸寶行樹及寶羅網出微妙音譬如百千種樂同時俱作聞是音者自然皆生念佛念法念僧之心舍利弗其佛國土成就如是功德莊嚴舍利弗於汝意云何彼佛何故號阿彌陀舍利弗彼佛光明無量照十方國無所障礙是故號為阿彌陀又舍利弗彼佛壽命及其人民無量無邊阿僧祇劫故名阿彌陀舍利弗阿彌陀佛成佛已來於今十劫又舍利弗彼佛有無量無邊聲聞弟子皆阿羅漢非是算數之所能知諸菩薩眾亦復如是舍利弗彼佛國土成就如是功德莊嚴又舍利弗極樂國土眾生生者皆是阿鞞跋致其中多有一生補處其數甚多非是算數所能知之但可以無量無邊阿僧祗說舍利弗眾生聞者應當發願願生彼國所以者何得與如是諸上善人俱會一處舍利弗不可以少善根福德因緣得生彼國舍利弗若有善男子善女人聞說阿彌陀佛執持名號若一日若二日若三日若四日若五日若六日若七日一心不亂其人臨命終時阿彌陀佛與諸聖眾現在其前是人終時心不顛倒即得往生阿彌陀佛極樂國土舍利弗我見是利故說此言若有眾生聞是說者應當發願生彼國土舍利弗如我今者讚歎阿彌陀佛不可思議功德之利東方亦有阿閦鞞佛須彌相佛大須彌佛須彌光佛妙音佛如是等恒河沙數諸佛各於其國出廣長舌相遍覆三千大千世界說誠實言汝等眾生當信是稱讚不可思議功德一切諸佛所護念經舍利弗南方世界有日月燈佛名聞光佛大燄肩佛須彌燈佛無量精進佛如是等恒河沙數諸佛各於其國出廣長舌相遍覆三千大千世界說誠實言汝等眾生當信是稱讚不可思議功德一切諸佛所護念經舍利弗西方世界有無量壽佛無量相佛無量幢佛大光佛大明佛寶相佛淨光佛如是等恒河沙數諸佛各於其國出廣長舌相遍覆三千大千世界說誠實言汝等眾生當信是稱讚不可思議功德一切諸佛所護念經舍利弗北方世界有燄肩佛最勝音佛難沮佛日生佛網明佛如是等恒河沙數諸佛各於其國出廣長舌相遍覆三千大千世界說誠實言汝等眾生當信是稱讚不可思議功德一切諸佛所護念經舍利弗下方世界有師子佛名聞佛名光佛達磨佛法幢佛持法佛如是等恒河沙數諸佛各於其國出廣長舌相遍覆三千大千世界說誠實言汝等眾生當信是稱讚不可思議功德一切諸佛所護念經舍利弗上方世界有梵音佛宿王佛香上佛香光佛大燄肩佛雜色寶華嚴身佛娑羅樹王佛寶華德佛見一切義佛如須彌山佛如是等恒河沙數諸佛各於其國出廣長舌相遍覆三千大千世界說誠實言汝等眾生當信是稱讚不可思議功德一切諸佛所護念經舍利弗於汝意云何何故名為一切諸佛所護念經舍利弗若有善男子善女人聞是經受持者及聞諸佛名者是諸善男子善女人皆為一切諸佛之所護念皆得不退轉於阿耨多羅三藐三菩提是故舍利弗汝等皆當信受我語及諸佛所說舍利弗若有人已發願今發願當發願欲生阿彌陀佛國者是諸人等皆得不退轉於阿耨多羅三藐三菩提於彼國土若已生若今生若當生是故舍利弗諸善男子善女人若有信者應當發願生彼國土舍利弗如我今者稱讚諸佛不可思議功德彼諸佛等亦稱讚我不可思議功德而作是言釋迦牟尼佛能為甚難希有之事能於娑婆國土五濁惡世劫濁見濁煩惱濁眾生濁命濁中得阿耨多羅三藐三菩提為諸眾生說是一切世間難信之法舍利弗當知我於五濁惡世行此難事得阿耨多羅三藐三菩提為一切世間說此難信之法是為甚難佛說此經已舍利弗及諸比丘一切世間天人阿修羅等聞佛所說歡喜信受作禮而去。",
    "X62n1172_001:0037c19_0": "佛說阿彌陀經",
    "X62n1172_001:0037c20_0": "拔一切業障根本得生淨土陀羅尼(出小無量壽經)曩謨阿彌跢婆夜哆他伽哆夜哆地夜他阿彌唎都婆毗阿彌唎哆悉躭婆毗阿彌唎哆毗迦蘭帝阿彌唎哆毗迦蘭哆伽彌膩伽伽那枳多迦隷娑婆訶(三遍)念佛文　阿彌陀佛身金色　　相好光明無等倫　白毫宛轉五須彌　　紺目澄清四大海　光中化佛無數億　　化菩薩眾亦無邊　四十八願度眾生　　九品咸令登彼岸南無西方極樂世界大慈大悲阿彌陀佛(課千聲或五百聲)南無觀世音菩薩南無大勢至菩薩南無清淨大海眾菩薩(各十稱畢舉蓮大師西方願文)　稽首西方安樂國　　接引眾生大導師　我今發願願往生　　唯願慈悲哀攝受弟子(某甲眾等)普為四恩三有法界眾生求於諸佛一乘無上菩提道故專心持念阿彌陀佛萬德洪名期生淨土又以業重福輕障深慧淺染心易熾淨德難成今於佛前翹勤五體披瀝一心投誠懺悔我及眾生曠劫至今迷本淨心縱貪嗔癡染穢三業無量無邊所作罪垢無量無邊所結冤業願悉消滅從於今日立深誓願遠離惡法誓不更造勤脩聖道誓不退惰誓成正覺誓度眾生阿彌陀佛以慈悲願力當證知我當哀憫我當加被我願禪觀之中夢寐之際得見阿彌陀佛金色之身得歷阿彌陀佛寶嚴之土得蒙阿彌陀佛甘露灌頂光明照身手摩我頭衣覆我體使我宿障自除善根增長疾空煩惱頓破無明圓覺妙心廓然開悟寂光真境常得現前至於臨欲命終預知時至身無一切病苦厄難心無一切貪戀迷惑諸根悅豫正念分明捨報安詳如入禪定阿彌陀佛與觀音勢至諸聖賢眾放光接引垂手提携樓閣幢幡異香天樂西方聖境昭示目前令諸眾生見者聞者歡喜感嘆發菩提心我於爾時乘金剛臺隨從佛後如彈指頃生極樂國七寶池內勝蓮華中華開見佛見諸菩薩聞妙法音獲無生忍於須臾間承事諸佛親蒙授記得授記已三身四智五眼六通無量百千陀羅尼門一切功德皆悉成就然後不違安養回入娑婆分身無數徧十方剎以不可思議自在神力種種方便度脫眾生咸令離染還得淨心同生西方入不退地如是大願世界無盡眾生無盡業及煩惱一切無盡我願無盡願今禮佛發願修持功德回施有情四恩總報三有齊資法界眾生同圓種智。",
    "X62n1172_001:0038b14_0": "南無阿彌陀佛(禮願九拜作九品往生觀)南無觀世音菩薩南無大勢至菩薩南無清淨大海眾菩薩(各禮一拜次稱三皈)自歸於佛　當願眾生　體解大道　發無上心自歸於法　當願眾生　深入經藏　智慧如海自歸於僧　當願眾生　統理大眾　一切無礙和南聖眾(各禮一拜)又慈雲懺主願文(不能誦前願文者用此亦可)弟子某一心歸命西方極樂世界阿彌陀佛願以淨光照我慈誓攝我我今正念稱如來名為菩提道求生淨土佛昔本誓若有眾生欲生我國至心信樂稱我名號乃至十念若不生者不取正覺以此念佛因緣得入如來大誓海中承佛慈力眾罪消滅淨因增長若臨欲命終自知時至身無病苦心不貪戀意不顛倒如入禪定佛及聖眾手執金臺來迎接我於一念頃生極樂國華開見佛即聞佛乘頓開佛慧廣度眾生滿菩提願。",
    "X62n1172_001:0038c08_0": "善導和尚臨睡入觀文",
    "X62n1172_001:0038c09_0": "弟子某生死凡夫罪障深重輪迴六道苦不可言今遇知識得聞阿彌陀佛名號本願功德一心稱念求願往生願佛慈悲不捨哀憐攝受弟子某不識佛身相好光明願佛示現令我得見及見觀音勢至諸菩薩眾彼世界中清淨莊嚴光明妙相等令我了了得見(正念入觀而寢不得雜想但久遠專志必如所願)。",
    "X62n1172_001:0038c20_0": "淨土晨鐘卷第一",
    "X62n1172_001:0038c22_0": "荊溪同善道人周克復纂男周　石訂",
    "X62n1172_001:0038c23_0": "吳郡潛確居士陳濟生參",
    "X62n1172_001:0038c24_0": "淨土原始",
    "X62n1172_001:0039a01_0": "極樂是我故鄉阿彌號為慈父故欲超生死無如淨土一門世人浸沒五濁窟宅中如少亡之子問其祖父里邑室廬茫然不復記憶雖欲向往其路何由今折衷經籍溯其源流庶樂國歷歷如在目前而後信心可發也述原始第一。",
    "X62n1172_001:0039a06_0": "阿彌陀佛成佛之始",
    "X62n1172_001:0039a07_0": "鼓音王經云過去劫中有國名妙喜王名憍尸迦祖父清泰國王父月上轉輪王母殊勝妙顏時有佛出世名世自在王憍尸迦心發道意棄捨國位投佛出家號曰法藏比丘(即阿彌陀佛)又大彌陀經云法藏比丘於自在王佛所發無上意一切世間無能及者時佛說二百一十億諸佛剎土應其心願法藏稽首禮佛廣說四十八願(具載本經)若不爾者誓不成佛是時大地震動天雨妙華空中同聲讚言決定成佛。",
    "X62n1172_001:0039a15_0": "阿彌現淨土釋迦現穢土之始",
    "X62n1172_001:0039a16_0": "悲華經云往昔劫中有轉輪王名無諍念大臣名寶海為善知識同於寶藏佛所發菩提心無諍念發願云我修大乘取於淨土終不願於穢土成阿耨多羅三藐三菩提世界眾生無諸苦惱我不得如是佛剎乃不成正覺今既果滿號阿彌陀故現淨土寶海大臣願於穢土成熟有情今已果滿號釋迦牟尼於此濁惡世中成佛菩提。",
    "X62n1172_001:0039a23_0": "佛為韋提希聖后說淨業正因",
    "X62n1172_001:0039a24_0": "觀無量壽佛經云爾時韋提希號泣向佛白言世尊願為我廣說無憂惱處我當往生不樂閻浮濁惡世也爾時世尊放眉間光徧照十方無量世界諸佛國土皆於中現韋提希見已白佛言是諸佛土雖復清淨皆有光明我今樂生極樂世界阿彌陀佛所惟願世尊教我思惟教我正受佛告韋提希阿彌陀佛去此不遠汝當繫念諦觀彼國我今廣為汝說亦令未來凡夫脩淨業者得生西方極樂國土欲生彼國者當脩三福一者孝順父母奉事師長慈心不殺脩十善業二者受持三歸具足眾戒不犯威儀三者發菩提心深信因果讀誦大乘勸進行者如此三事名為淨業正因佛告阿難及韋提希諦聽諦聽善思念之。",
    "X62n1172_001:0039b12_0": "九品往生",
    "X62n1172_001:0039b13_0": "觀經云上品上生者若有眾生發三種心即便往生一者至誠心二深信心三迴向發願心復有三種眾生當得往生一者慈心不殺具諸戒行二者讀誦大乘方等經典三者修行六念(念佛法僧天施戒為六念)迴向發願願生彼國具此功德一日乃至七日即得往生○上品中生者不必受持讀誦方等經典善解義趣於第一義心不驚動深信因果不謗大乘以此功德迴向求生極樂國行此行者即得往生○上品下生者亦信因果不謗大乘但發無上道心以此功德迴向願求生極樂國行者命欲終時即得往生○中品上生者若有眾生受持五戒持八戒齋修行諸戒不造五逆無眾過患以此善根迴向願求生於西方極樂世界臨命終時即得往生○中品中生者若有眾生若一日一夜持八戒齋若一日一夜持沙彌戒若一日一夜持具足戒威儀無缺以此功德迴向願求生極樂國戒香熏修如此行者命欲終時即得往生○中品下生者若有善男子善女人孝養父母行世仁慈此人命欲終時遇善知識為其廣說阿彌陀佛國土樂事亦說法藏比丘四十八願聞此事已尋即命終即得往生○下品上生者或有眾生作重惡業雖不誹謗方等經典如此愚人多造惡法無有慙愧命欲終時遇善知識為說大乘十二部經首題名字以聞如是諸經名故除却千劫極重惡業智者復教合掌叉手稱南無阿彌陀佛稱佛名故除五十億劫生死之罪即得往生○下品中生者或有眾生毀犯五戒八戒及具足戒如是愚人偷僧祇物盜現前僧物不淨說法無有慙愧以諸惡業而自莊嚴如此罪人以惡業故應墮地獄命欲終時地獄眾火一時俱至遇善知識以大慈悲即為讚說阿彌陀佛十力威德廣讚彼佛光明神力亦讚戒定慧解脫解脫知見此人聞已除八十億劫生死之罪即得往生○下品下生者或有眾生作不善業五逆十惡具諸不善如此愚人以惡業故應墮惡道經歷多劫受苦無窮臨命終時遇善知識種種安慰為說妙法教令念佛彼人苦逼不遑念佛善友告言汝若不能念彼佛者應稱無量壽佛如是至心令聲不絕具足十念稱南無阿彌陀佛稱佛名故於念念中除八十億劫生死之罪命終之時即得往生。",
    "X62n1172_001:0040a03_0": "佛為父王說念佛",
    "X62n1172_001:0040a04_0": "寶積經云世尊父王頂禮佛足一心合掌而白佛言云何脩行當得諸佛之道佛言一切眾生皆即是佛今當念西方世界阿彌陀佛常勤精進當得佛道王言一切眾生云何是佛佛言一切法無生無動搖無取捨無相貌無自性可於此佛法中安住其心勿信於他爾時父王與七萬釋種聞說是法信解懽喜悟無生忍佛現微笑而說偈曰釋種決定智是故於佛法決信心安住人中命終已得生安樂國面奉阿彌陀無畏成菩提。",
    "X62n1172_001:0040a13_0": "龍樹菩薩勸念佛",
    "X62n1172_001:0040a14_0": "大智度論云佛是無上法王諸大菩薩為法臣諸臣所尊重者惟佛法王是故菩薩應當念佛又云有諸菩薩自念往昔謗般若墮惡道經無量劫雖修餘行未能得出後遇善知識教行念佛三昧即得併遣罪障方得解脫又偈云若人願作佛心念阿彌陀即時為現身故我歸命禮若人欲疾得不退轉地者應以恭敬心執持稱名號若人種善根疑則花不開信心清淨者花開即見佛。",
    "X62n1172_001:0040a22_0": "佛示人念佛十種功德",
    "X62n1172_001:0040a23_0": "經云若人受持一佛名號者見世當獲十種功德利益一晝夜常得諸天大力神將併諸眷屬隱形守護二常得二十五大菩薩如觀世音等及一切菩薩常隨守護三常為諸佛晝夜護念阿彌陀佛常放光明攝受此人四一切惡鬼若夜叉羅剎皆不能害一切毒蛇毒龍悉不能害五一切火難水難冤賊刀箭牢獄杻械橫死枉死悉皆不受六先所作罪皆悉消滅所殺冤命彼蒙解脫更無執對七夜夢正直或復夢見阿彌陀佛勝妙色身八心常歡喜顏色光澤氣力充盛所作吉利九常為一切世間人民恭敬供養禮拜猶如敬佛十命終之時心無怖畏正念現前得見阿彌陀佛及諸菩薩聖眾手持金臺接引往生西方淨土盡未來際受勝妙樂。",
    "X62n1172_001:0040b12_0": "淨土往生之因",
    "X62n1172_001:0040b13_0": "大藏言西方淨土事不止十餘經其大略謂彼處以七寶莊嚴無地獄餓鬼禽畜以至蜎飛蝡動之類常清淨自厭無一切穢雜故名淨土其人皆蓮華中生長生不老衣食宅宇隨意化成其景序長春無復寒暑大受快樂無一切苦惱故名極樂世界其佛名阿彌陀者梵語也此云無量以此佛光明照見十方世界無有限量凡念佛眾生無不知之故又名無量光佛此佛壽命與其國中人民壽命皆無有限量雖恒河沙劫亦無有盡故又名無量壽佛此佛有大誓願度人其威神不可思議故至心信向念其名號者現世必消除災難禳却冤鬼安靜形神增延福壽西方七寶池中則生蓮華一朵他日於其中託生直脫輪迴之外若此者皆有事跡非虗言也盡大藏中八萬四千法門無如此之要捷者而人或不知知而不行可痛惜也(龍舒淨土文)。",
    "X62n1172_001:0040c04_0": "阿彌陀佛度生之因",
    "X62n1172_001:0040c05_0": "經云法藏比丘對世自在王佛發四十八大願每願皆為濟度眾生發此願已乃精進以了生死次入菩薩地了生死者乃生死自如也入菩薩地者內則修慧外則修福也修慧者使慧性日廣一日至成佛時則慧性含虗空世界無所不知無所不見也修福者託生於一切眾生中同其形體通其語言以設教化故上自天帝下至微細蟲蟻皆託生其中如此無量劫來設化眾生夫設化眾生無非得福也得福而不受用故其福愈積而愈大久則徧虗空世界矣福大則威神大又經云阿彌陀佛歷大阿僧祇劫行菩薩行忍力成就不計眾苦常以和顏愛語饒益眾生善護口業不譏他過善護身業不失律儀善護意業清淨無染手中常出一切衣服飲食寶幢音樂及一切最上所須之物以此施惠眾生令生歡悅以行教化故致無量眾生發無上菩提之心如是善行歷無數劫功德圓滿威神熾盛方得成就所願而入佛位是初發願以至成佛無非為眾生者故十方無央數世界諸天人民以至蜎飛蝡動之類無所不度人能精心念其名號想其形相現世必見佛之真身以佛威靈無所不在而人心念與佛純熟則自然交通也若身後經生其國皆於寶池蓮華中化生其容皃端好非天人可比皆受自然清虗之身無極之壽徧彼剎中皆諸上善人無有婦女皆洞視徹聽遙相瞻見遙相聞語聲雖歷萬劫已所從來靡不知之復知十方世界去來現在之事以其慧性通徹故爾又阿彌陀佛誓願云已生我國欲往他方生者如其所願永不復墜三惡道何則生淨土者必證無生法忍無生法忍者乃了生死也了生死者雖入生死界中此一性已不昧矣性既不昧何由而為惡乎況又仗佛力故墜墮必無由是設化一切眾生而入一切眾生生死界中或生天上或生人間或生大富貴中或生清淨中或長生不滅或滅而復生隨意所欲生死自如此所以貴於修淨土也(纂龍舒文)。",
    "X62n1172_001:0041a14_0": "釋迦勸人念佛之因",
    "X62n1172_001:0041a15_0": "阿彌陀佛現在西方西方為淨土釋迦所生國與我中國同土皆屬娑婆世界皆為穢土穢土眾生必憶佛念佛一心不亂彌陀方來接引往生西方然彌陀聖號及淨土往生之事此土誰知緣釋迦如來說彌陀諸經殷勤苦口勸人念佛迦文不妄的確可信此震旦念佛法門之所由始也阿者無也彌陀者量也阿彌陀佛者無量覺也無量有二義無量壽體也無量光用也只無量光壽四字便是如來萬德洪名專持此四字即生淨土者何也葢因彌陀發四十八願攝受眾生有云眾生欲生我國但能志心稱我名號即生我國受福快樂壽命無量佛有此本願故眾生念佛即得往生此是仗佛願力非眾生之自力自力難成仗佛易就故也。",
    "X62n1172_001:0041b04_0": "釋迦開導淨土之因",
    "X62n1172_001:0041b05_0": "唐宜之南無篇云向於淨土書中聞阿彌陀佛取淨土釋迦佛取穢土君臣弘願攝受兩土眾生而未詳也又讀悲華經始知阿彌陀佛為轉輪聖王時供養寶藏如來黃金為地七寶為樓自燃身燈竟夜供養然猶迴向為忉利大梵天王統領四天下而已爾時賴釋迦佛為寶海梵志乞夢陳白輪王感悟乃於寶藏如來前取西方淨土是則西方淨土成自彌陀而開導由釋迦也不惟是爾時輪王千子與八萬四千小王無一人不由寶海開示發心者太子即觀世音二王子即大勢至三王子即文殊八王子即普賢也不惟是爾時寶海有八十子與三億弟子無一人不由寶海開示同時發心者凡賢劫千佛與當來彌勒尊佛皆寶海弟子也秪因諸菩薩皆發心取清淨佛土而此娑婆世界厚重煩惱為佛菩薩之所擯棄於是寶海憂愁憔悴發願久在生死忍受諸苦不捨如是眾生願入阿鼻願為畜生願為餓鬼願為貧窮鬼神願為人中卑賤願施恒沙七寶願施恒沙身命以度眾生今人朝夕頂禮彌陀觀音勢至為大依怙若不讀此經安知三聖證果之因至念釋迦如來施足施首施手施耳施鼻舌施血肉施髓腦調伏我等豈能不慟哭乎然則釋迦當日以淨土開導三聖後說彌陀諸經又專為娑婆眾生而發是即以開示佛菩薩者而開示我等也以阿彌接引之大力合釋迦指點之悲心如此深恩眾生若何辜負也耶。",
    "X62n1172_001:0041c05_0": "四土往生本末",
    "X62n1172_001:0041c06_0": "經云應觀法界性一切惟心造法界有十又分四種國土一曰常寂光土為佛法界二曰實報無障礙土為菩薩法界三日方便有餘土為聲聞緣覺二法界謂之四聖四曰凡聖同居土為天人阿修羅地獄餓鬼畜生六法界謂之六凡如是十界四土於凡夫一念識心悉皆具足故凡一土各具四土唯隨染淨緣以分淨穢維摩詰云隨其心淨則佛土淨此之謂也四土各有淨穢常寂光者諸佛如來所居(常即法身德寂即解脫德光即般若德)真常究竟極為淨土亦有淨穢者以究竟分證異也(究竟如來所證乃上品寂光圓教人所證名中品寂光別教則證下品寂光耳)實報無障礙者菩薩居之(行真實法感得勝報色心不相妨礙故言無障礙)等分十地皆屬大乘其淨穢以次第頓入分也(次第者別教菩薩頓入者圓教菩薩)方便有餘者二乘所居已出三界之外(修方便道斷四住惑故曰方便無明未盡故曰有餘)其淨穢相者體巧柝拙也(體觀感淨拙觀感穢)凡聖同居淨土者即極樂國是安養清淨池流八德樹列七珍次於泥洹皆正定聚(生安養者煩惱調伏近於涅槃故名為次聚有三如此土博地凡夫屬邪定聚發心修行未不退者屬不定聚不退轉者稱正定聚)穢土即娑婆世界其淨穢以五濁輕重而分也然佛法遍一切界下三土皆常寂光所遍故如來居寂光時垂應下三土釋迦現身垂應娑婆阿彌現身垂應極樂是也同居穢土之人欲生極樂淨土須以念佛三昧或執持名號一心不亂或端坐西向觀想彌陀如此二行方能輕其三毒澄其五濁臨終正念乃得往生若因此三昧破斷見思二惑即能往生方便土更破塵沙煩惱并破根本無明即得生實報土破盡無明方得生寂光淨土又有淨土橫出三界穢土竪出三界之異竪者自下昇高如登九級臺其出難橫者從東至西如履坦途其出易據觀經往生九品橫出有三種如上品上生垂終乘金剛臺往生彼國見佛聞妙法已即悟無生此橫出三界生實報莊嚴淨土也上品中生者坐紫金臺往生彼國經宿乃開經一小劫得無生法忍此橫出生方便有餘淨土也上品下生以下皆橫出三界生凡聖同居淨土也(極樂雖有天人之殊既無婬欲故無欲界生彼者次于泥洹皆正定聚則不隨禪而受生故無色界無無色界可即同居而證入上三土耳)竪出三界有四種人即藏通別圓四教雖頓漸不同各有階級然後得出三界生死修為難而失墜易何如專心念佛仗佛提擕從橫而出生彼華池實報與寂光恒見十地直下可登之為愈乎按此十界四土之說諸淨土書多略而未載然眾生既願生彼土即當以成佛為期同居淨土之人不得生寂光未為究竟故往生後境地修持者不可不知況四土一土不出惟心所造此實凡聖同歸之途頓漸雙融之旨也。",
    "X62n1172_001:0042b01_0": "三界六道輪迴本末",
    "X62n1172_001:0042b02_0": "眾生因情生十二緣造成三界六道輪迴之業不得斷絕往西方則情滅而性現故永劫無輪迴有十二緣之業造成三界六道輪迴之報不得解脫生西方則業斷而報空故永劫無墜墮十二緣者曰無明曰行曰識曰名色曰六入曰觸曰受曰愛曰取曰有曰生曰老死是也無明謂暗昧真性行謂動作識謂魂識名謂受想行識色謂色身六入謂六根眼耳鼻舌身意也觸謂觸六根者因暗昧真性故不能寂然不動乃生魂識因有名色遂有六入因六入故有觸因觸故受因受故愛因愛故取因取故當有之因此復受生因生故有老死相牽緣不斷故名十二緣三界者自阿鼻大地獄至他化自在天皆名欲界以有情欲也上有色界止有色身無男女之形又上有無色界亦無色身止有魂識如鬼神此名三界所謂輪迴者何曰天曰人曰阿修羅曰餓鬼曰畜生曰地獄是名六道餓鬼以下亦名三途瞋殺傲慢造有微福感修羅道慳貪不捨損人利己感餓鬼道愚呆無知酬償宿債感畜生道五逆十惡輕重不等感地獄道四道皆苦天道修十善而致感報受樂樂勝則不暇修行福盡則仍墜落人道樂少苦多能勇猛精進可以修行而不發肯心報盡則轉墮三途人天為勝餘四為劣或劣者悔過而徵勝或勝者造惡而徵劣如車輪迴轉升沉非一經云三界無安猶如火宅此之謂也業報可畏如此曷不回頭猛省求生西方(已上克復纂)。",
    "X62n1172_001:0042c03_0": "淨土晨鐘卷第一"
}